{"poster":"Hondom","date":"2017-07-13T11:34:55.732+0000","title":"Why Kayn will be popular even after a year of his release.","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"He is an anime character. \r\n\r\nLooks like it&#039;s time to update the list of toxic try-hards{{champion:92}} {{champion:64}} {{champion:238}} {{champion:157}} {{champion:141}} \r\n\r\nbtw if you meet someone who mains atleast one of these champions then there is a 60% that they have the others as side mains.","replies":[{"poster":"Lord Sesshomaru","date":"2017-07-13T14:02:00.464+0000","up_votes":2,"down_votes":1,"body":"He's a shadow ninja demon with a scythe.\nThe symbol incarnate of pre-pubescent 'badass'.\n\nThat's why he will always be popular.\nI don't think anime has anything to do with it?\n\nbetween ages 10 and 16 pretty much anything 'darkness' and 'death' is the epitome of coolness.\nOnce you grow up and develop a sense of subtly, you start to appreciate how unimaginite it is and how much cooler the more complex and quirky characters are.\n\nBut I do agree, you look at a Lee main's most played champs and its always Yas, Riven or Trynd, and vice versa.","replies":[{"poster":"Husy15","date":"2017-07-15T08:49:28.264+0000","up_votes":1,"down_votes":0,"body":"Ehh, i don't see him as an anime character, or \"the symbol incarnate of pre-pubescent 'badass'\"\n\nIt's a character that represents Death, and has a huge-ass scythe... People will enjoy this regardless. And yes, that's someone who like's Kayn, and yes i'm VERY much over 16.\n\nWhether a character is subtle or not, i don't really mind, the play style is all i care for.\n\nAs for the \"toxic-tryhard\" portion of this post:\n\nEach of the champions you listed are known to be high skill-flaw/cap champions... yes, if you play them once or twice, you may get the gist of their character, but watch Pro-players play the characters you listed... it's a whole other ballpark. The champions have insane mechanical reach, and do take effort and skill to master.\n\nRiven: Without knowledge of weaving-auto's, auto/animation cancelling, and the prospect of positioning... she's useless.\n\nLee sin: Without being able to understand your role, and use your skills to properly help your team.. he's useless (I've seen lee-sins kick a tank into their ADC before... it really is a big difference to a teamfight)\n\nZed: Ehh... a little more controversial, depending on how strong he is in the current meta, he's either hit or miss, although positioning matters a LOT for a zed.\n\nYasuo: Dodging his Q's are easy, and once you understand how his dash works... he requires a lot more skill to do well with, In higher-tiers, yasuo's are usually hit-or-miss,\n\nAnd lastly Kayn: So far, his potential is high, and his numbers may be slightly skewed towards the more \"overpowered\" nature, however he DOES have a skill-cap required to play, he isn't as mind-less as people assume... everyone is just currently panicking. \n\nfor example:\n\n1. Learn to ward/play lane against a kayn... he's not your average jungler, different warding-zones, and a more defensive-pattern would work better (Same deal against someone like Eve or twitch.. warding River bush may seem smart.. until it does literally nothing to save you)\n\n2. Hit him if he's Blue, CC him if he's red (In his classic skin)\n\n3. So many games.. i've seen a Kayne Ult someone, and that person panic like their hp bar is going to melt... His ult does BARELY any damage, and he's invuln for 2 seconds, and has a .5 second delay once he gets pushed out of it.... DO NOT FLASH AND USE ALL YOUR ABILITIES ONCE HE ULTS YOU, just wait... \n\nOnce people learn these simple 3 things... then you'll see kayn drop out of the \"new-champion-hype\", and his skill-cap will rise exponentially, so yes... he may become one of the champions listed above.. however, league of legends has always worked the same way.. since Beta..\n\nEasy champions are meant to be weaker by number-standards\n\nHarder-to-master champions, are meant to be stronger by number-standards...\n\nIf master YI had the numbers that riven or yasuo had? You'd see him insta-kill an entire team every single game. however, he's mechanically easier, therefore his numbers are lower (usually, balancing is a LOT harder than people give credit...)\n\ntl;dr: Kayn looks interesting, is fun to play, and like the champions above, has a high-skillcap, yes people will continue to play them, but he will fall and rise out of meta constantly like most other champions...","replies":[]}]},{"poster":"jadelink","date":"2017-07-15T16:29:02.775+0000","up_votes":1,"down_votes":0,"body":"Agreed.  Like the above champions he will also have a tragic winrate in bronze and silver.","replies":[]},{"poster":"Krimsonkid","date":"2017-07-13T20:21:07.348+0000","up_votes":1,"down_votes":0,"body":"wheres vayne?","replies":[{"poster":"jadelink","date":"2017-07-15T16:28:10.326+0000","up_votes":1,"down_votes":0,"body":"Usually tumbling under tower next to a fed nasus in order to steal a kill on a 0/7/3 support.","replies":[]}]},{"poster":"jigglejigglwoosh","date":"2017-07-15T12:13:43.742+0000","up_votes":1,"down_votes":0,"body":"day 3 he has been forgotten","replies":[]}]}