{"poster":"Miss Fluffiness","date":"2017-11-26T18:43:51.229+0000","title":"Suchen noch zwei nette Spieler für unser Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo ihr Lieben :)\r\n\r\nWir (drei Spieler/innen) w&uuml;rden noch zwei weitere nette Mitspieler f&uuml;r unser Team suchen.\r\nAb und zu sind wir zwar schon zu f&uuml;nft, dennoch sind wir meistens nur zu dritt. Daher suchen wir Mitspieler die gerne mit uns Mitspielen w&uuml;rden, die es aber auch nicht st&ouml;rt ab und an alleine zu spielen. \r\n\r\nKurz zu uns, unsere Lane-Vorlieben und ein kleiner &Uuml;berblick:\r\n\r\nStef (22 Jahre)\r\nMeine Lieblingslanes sind Jungle, Midlane und ADC.\r\n\r\nKat (22 Jahre)\r\nLieblingslanes: Midlane, ADC und Support.\r\n\r\nMartin (23 Jahre)\r\nLieblingslanes: Toplane, ADC, Jungle, Support\r\n\r\nWir sind eine recht aufgeweckte Truppe bei der es auch etwas lauter werden kann, da wir uns sehr in das Spiel einf&uuml;hlen, und w&uuml;rden f&uuml;r unser Team noch Mitspieler suchen die ,zwischen den Lanes auch wechseln k&ouml;nnen und auch alle Lanes gerne spielen, UND die nicht tilten und flamen. \r\nKillsteals k&ouml;nnen vorkommen, solange man sich entschuldigt und auch ab und an versucht dem Team auch ein paar Kills zu &uuml;berlassen. (XD Klar das Team gewinnt gemeinsam und nur gemeinsam ist man stark, dennoch macht es jedem am meisten Spa&szlig; wenn jeder auch alleine etwas klar kommt, ohne auf Hilfe vom Team angewiesen zu sein). \r\n\r\nWenn du freundlich bist und es dich nicht st&ouml;rt ab und an auch ein paar Spiele zu verlieren, aber dennoch Spa&szlig; am Spiel hast und versuchst immer das Beste daraus zu machen meldet euch bitte. \r\n\r\nRanked w&auml;re wirklich ein Wunsch von uns daf&uuml;r m&uuml;ssen wir uns aber wirklich noch verbessern, also wenn uns jemand dabei unterst&uuml;tzen k&ouml;nnte und mit unserem kleinen Chaosteam zurecht kommt, dann meldet euch bitte bei mir :) \r\n\r\nIngame Name: Ceylanie\r\n\r\nTs3 haben wir auch und auch einen Server den wir zur Verf&uuml;gung stellen k&ouml;nnen.\r\n\r\n\r\nWir wollen mit unserem Team wachsen. \r\nWie schon erw&auml;hnt w&auml;re es Vorteilshaft wenn es euch ab und zu nicht st&ouml;rt, alleine Spiele zu meistern.\r\n\r\nLiebe Gr&uuml;&szlig;e von uns 3 :D\r\n\r\ncya~","replies":[]}