{"poster":"Climesdale","date":"2015-07-20T20:28:38.118+0000","title":"Suchen Support für 5v5-Ranked Team","subforum":"Clans & Teams","up_votes":1,"down_votes":2,"body":"Guten Abend liebe LoL-Community,\r\n\r\nWir suchen einen aktiven und freundlichen Support, der sich dazu bereiterkl&auml;ren w&uuml;rde mit uns gemeinsam im 5v5-Ranked Team zu spielen. \r\n\r\nWas wir bieten:\r\n\r\n- Wir sind vom Rang her 3x GoldV und 1x SilberV\r\n- Alle von uns sind freundlich und zielstrebig, die als Team sehr viel erreichen wollen\r\n- Wir bieten einen weiten Championpool von Meta bis Non-Meta-Champions, die wir sehr gut beherrschen\r\n- Au&szlig;erdem m&ouml;chten wir uns konstant mit Analysen und Teambesprechungen verbessern\r\n\r\nWas wir von dir wollen:\r\n \r\n- Ein Rang von Gold III bis Silber V \r\n- Einen freundlichen und teamorientierten Charakter, der zu einer guten Teamf&auml;higkeit neigt. \r\n- Gute Map-Awareness, Ward-Placing und ein gewisses Ma&szlig; an individuellem Skill sind ebenfalls notwendig. \r\n- Einen einigerma&szlig;en breiten Champion-Pool den wir gemeinsam trainieren k&ouml;nnen\r\n\r\nSo, das wars auch schon. \r\nBei Interesse an meinem Post meldet euch doch bitte an meinen IGN Climesdale im LoL Client, ich freue mich schon sehr im Vorraus.\r\nMFG Climesdale","replies":[{"poster":"tQ Selfish","date":"2015-07-20T23:33:08.677+0000","up_votes":1,"down_votes":0,"body":"Hey, ich wäre interessiert.\nIch habe einen sehr großen champion pool und bin derzeitig G5.\n\nSolltet ihr iInteresse haben und um 18 Jahre alt sein würde ich mich freuen wenn ihr mich addet.(bin selber 21)","replies":[]},{"poster":"dragonfire4321","date":"2015-07-20T21:02:34.432+0000","up_votes":1,"down_votes":0,"body":"Guten Abend \n\nIch sehe Euren Beitrag und fühle mich sehr angesprochen. Ich spiele die Champions Thresh, Nautilus und Taric (Leona kommt noch). Ich bin ein sehr aktiver und freundlicher Mitspieler der auch Teamspeak besitzt mit einem Funktionstüchtigen Headset. Ich habe in der letzten Saison in Silber 1 verbracht und nun bin ich leider in Silber 3. Ich selber strebe danach ein Team zu begleiten und dies zu unterstützen und deswegen melde ich mich bei ihnen. Ich hoffe ich habe Eure Interessen geweckt und werde bald kontaktiert. \n\nMit freundlichen Grüßen \n\ndragonfire4321 / Jakob","replies":[]}]}