{"poster":"Kartoffelking983","date":"2018-07-17T22:37:24.738+0000","title":"Honor lvl und bann","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":0,"body":"Sch&ouml;nen guten Morgen/Nacht \r\nAngenommen ich habe Max honor lvl ( Bin mir nicht sicher ich glaub 5 ist es )\r\nUnd werde dann toxic oder so werde ich wie andere behandelt ( Bann, Chatban bzw Riot merkt sich das game )\r\nOder wird man mit Honor lvl mehr bevorzugt? \r\nTheoretisch hat man es schon verdient aber irgendwie auch nicht oder?","replies":[{"poster":"Alpacana","date":"2018-07-17T22:41:29.485+0000","up_votes":2,"down_votes":0,"body":"Nein du wirst wie jemand behandelt, der z.B Honor Level 2 besitzt.\n\nAllerdings musst du es so sehen: \nJemand der schon einmal einen Bann hatte (z.B 2 Wochen Bann) muss extrem aufpassen was er schreibt, da ein einfaches \"report x\" schon für den perma reichen kann. In der Hinsicht kann sich jemand, der vorher noch keinen Bann hatte schon mehr leisten. Ohne Vorbestrafung musst du schon etwas mehr flamen um eine Strafe zu bekommen ;)","replies":[{"poster":"Kartoffelking983","date":"2018-07-17T22:43:10.670+0000","up_votes":2,"down_votes":0,"body":"Das mit dem 2 wochenban war mir klar hab selbst schon diesen Acc hier verloren nach 4 Jahren und daraus gelernt \nDanke für die Antwort finde ich gut das es da keine Unterschiede gibt \nLG :3","replies":[{"poster":"Alpacana","date":"2018-07-17T22:45:22.622+0000","up_votes":2,"down_votes":0,"body":"Honor-Level sind ja im Grunde nur dazu da, damit andere Leute sehen wie nett man doch ist (und um die schönen Kapseln öffnen zu können)^^ Hat mit Bestrafungen nichts zu tun, ist nur was optisches für die Spieler :)","replies":[{"poster":"Kartoffelking983","date":"2018-07-17T22:50:07.223+0000","up_votes":1,"down_votes":0,"body":"Das verstehe ich aber nicht ich kann zbs von Freunden das Lvl nicht sehen es wird ausgeblendet ( Laut ihm ist er lvl 3 aktuell ) Würde mich auch nicht wundern er ist zwar oft beleidigt aber noch nie gebannt worden oder so \nUnd was mich noch interessiert angenommen man ist es jetzt wie ich schlecht in englisch \nals beispiel zum lachen \n\" Hay jungler can you come and gank my lane i would rlly love you supporting \" \n( War nur ein spontanes beispiel ) \nKann es bei sowas nicht zu Missverständnissen kommen? Ich hatte mal einen Fall vor ner Woche ich bin mir nicht sicher was ich geschrieben haben ( Jetzt gerade ) wurde aber von 3 Leuten als Rassist beleidigt ( Habe mich entschuldigt und gesagt \" English not my main language \" Mein meist verwendeter Satz XD\nIst das dann nicht irgendwie auch blöd weil ich weiß nicht kann einfach nicht gut englisch reden ( Verstehen schon  und ich besser mich auch ) ^^ Aber in 2018 mit 18 Kein englisch gut zu können ist bisschen Peinlich laut anderen laut mir nicht da ich eben Österreicher bin \nWie siehst Du/Sie das falls du dir mein Post durchlesen willst :)\nLG","replies":[{"poster":"Alpacana","date":"2018-07-17T22:57:14.988+0000","up_votes":2,"down_votes":0,"body":"Hm mit dem Punkt überfragst du mich jetzt ein wenig^^\nIch kann mir vorstellen, dass man die Level der anderen nicht sieht, damit man nicht differenzieren kann wer der \"Abschaum\" ist (die positiven Menschen sieht man ja trotzdem im Loading Screen)^^\n\nUnd wie genau meinst du das mit deinem Englisch und Missverständnissen?","replies":[{"poster":"Kartoffelking983","date":"2018-07-17T23:02:32.854+0000","up_votes":1,"down_votes":0,"body":"Ok da mit dem loadingscreen hast du recht ganz vergessen \nJa kurz gesagt ich sage was will etwas sagen aber in englisch klingt es unfreundlich oder die Leute beachten es nicht da es so schlecht geschrieben ist oder was anderes bedeutet vllt obwohl ich vllt einfach nur etwas sagen wollte oder gestern habe ich vergessen Items zu kaufen am anfang und habe dann geschrieben \" Be care i won the trade without items muhaha \" \nDurfte mir dann aber das Ganze Spiel vom gegnerteam anhören zbs \" Du gewinnst ohne Items verlierst mit gj \" \" ez \" \" nice items \" \nerstes natürlich auf englisch nicht auf Deutsch :D","replies":[{"poster":"Alpacana","date":"2018-07-17T23:08:36.911+0000","up_votes":2,"down_votes":0,"body":"Ah verstehe^^\nKlar, Missverständnisse kann es in der Hinsicht vielerlei geben. Passiert aber im \"normal\" geschriebenen Englisch auch, z.B wenn einer etwas mit Ironie meint und der andere die Ironie darin nicht sieht, z.B folgende Situation:\nDarius bekommt das First Blood auf Riven in einem 1v1, der Fight war schon fast Challenger-Like und beide haben es perfekt gespielt. Jetzt schreibt Darius im All-Chat \"not even close ;)\". Riven ist gerade gestorben, womöglich leicht tilted von dem knappen Fight und sieht (bzw will nicht) die Ironie in diesem Satz sehen und kontert mit \"stfu just luck\".\n\nVerstehe aber deinen Punkt. Wenn man sich in der englischen Sprache nicht gut zu artikulieren weiß kann es sehr schnell zu Missverständnissen kommen, vor allem mit der Community die LoL beherrscht^^","replies":[{"poster":"Kartoffelking983","date":"2018-07-17T23:34:40.966+0000","up_votes":1,"down_votes":0,"body":"Das meinte ich so ein \" not even close \" klingt für mich wie \" Ha nicht mal knapp \" als würde er es halt alles berechnet haben oder bedeutet das was anderes?","replies":[{"poster":"Alpacana","date":"2018-07-17T23:50:42.341+0000","up_votes":1,"down_votes":0,"body":"Nein, bedeutet genau das :)\nEr (Darius) mag es dann vielleicht spaßig mit Ironie gemeint haben, die Riven allerdings ist halt evtl schon leicht getilted und versteht diesen \"Spaß\" schon nicht mehr und sieht diese Aussage dann als BM.\n\nWar aber nur darauf bezogen dass Missverständnisse nicht nur durch Sprache auftreten können, sondern durch viele verschiedene Situationen :)","replies":[]}]}]}]}]}]}]}]}]},{"poster":"IAmLuckyI","date":"2018-08-04T08:17:35.251+0000","up_votes":1,"down_votes":0,"body":"Account Honor 2\nWenn man 10 Games Chat Ban bekommt auf 1 und wenn man die 25 Games bekommt dann auf 0.","replies":[]},{"poster":"5 Dunks 1 Darius","date":"2018-07-23T16:13:10.183+0000","up_votes":1,"down_votes":0,"body":"Du wirst wie alle anderen behandelt, allerdings kann es sein dass du bei Chatbanns nicht bis auf 0 zurückgesetzt wirst ( ich glaube nur bis auf 2), bin mir da aber nicht zu 100% sicher.","replies":[]}]}