{"poster":"asdkri10000","date":"2015-02-14T08:39:24.064+0000","title":"Miért tobott 9 winnel és 1 loseval, bronz 2 be?","up_votes":0,"down_votes":0,"body":"Üdv. Lenne egy olyan balyom hogy mentem 10 rankedet (9 win 1 lose) és bronz kettőbe tobott.\r\nTavaly 3 win 7 lose-val, bronz 1.\r\nMiért van ez érlek irjatok indokot.\r\nHello","replies":[{"poster":"Eshu","date":"2015-02-14T12:34:13.357+0000","title":null,"up_votes":1,"down_votes":0,"body":"A tavalyi meccseid azaz besoroló meccsek voltak. A mostaniak már nem teljesen azok. Pl az elején bronztól gold 5-ig bárhova letehet ez a kezdőpontod. Míg az ezt követő években az MMR-ed egy kicsit közelebb kerül az átlaghoz de nem veszik el teljesen divíziókban viszont szándékosan lejjebb tesznek hogy kiszűrjék a vásárolt és a boostolt felhasználókat. \n\nPélda: Besoroló meccsek esetén összefarmolsz 1200 MMR-t és a játék a 10. után letesz az ehhez az elohoz tartozó divizióba - ami kb silver 3. \n\nPélda 2: Eltellik egy év - a tavalyi év alatt összefarmoltál 2000 MMR-t. A soft reset után marad belőle mondjuk 1500 - Megcsinálod a 10 kezdőmeccset de a játék nem tesz be rögtön az ehhez tartozó gold divizióba hanem valamivel alá - pl kapsz egy silver 3-at. De ettől még az MMR-ed magas. Ha nyersz sok LP-t nyersz és akár 2 div-et is ugorhatsz a promódon. Ha vesztesz keveset vesztesz - de végig kell csinálnod a promóid hogy visszakerülj a helyedre. \n\nVedd úgy hogy minden más verseny is a start mezőn kezdődik nem a pálya közepén.","replies":[]},{"poster":"YiJaegar","date":"2015-02-14T08:58:47.800+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez már az 5. alkalom hogy \"resetletek\", hogy azok is jobban érezzék magukat, (a sport \nligák jó része is \"resetelődik\" minden új évad kezdetén) akik a rossz csapat miatt nem \ntudnak feljebb jutni ilyenkor mindenki mmrjét (season 3 kezdetéig elonak nevezett dolog \nami a ligák előtt volt a rang felmérője) vissza álitsák a skála zérúspontja, azaz 1200 \nfelé (silver és broze határa) ezrét van az hogy bronzosok (1200 alatti mmr) \nkönnyebbedne ugornak diviziót előre még a silver és az felettiek visszább esnek \n(silveresek kicsit dia-challanger jobban). \n\nA besoroló játékok alatt nagyobb az mmr mozgás meccsenként, mint a többi ranked \njátéknál ahol már be vagy sorolva (ez is az elsőtől a tizedik felé csökken). \nTehát ha az első 5 nyered utolsó 5 bukód jobb helyen leszel, ha az első 5-t veszted és \nutolsó 5 nyerned rosszabb helyen leszel, Ha felváltva nyersz vesztesz (és elsőt \nnyerted) esetén maradsz kb ott ahol van a \"soft resetelt\" mmr-ed.\n\nSzámít az ellenfeleid mmr-je is mert az is meghatározza mennyi mmr-t nyersz \nmeccsenként, (ha ellenfelek gyengébbek kevesebbet ha erősebbek többet).\n\nHa jobb vagy mint ahova besorolt nagyon gyorsan feljebb kerülsz akár 2 divíziót is \nugorhatsz egy győzelmi sorozattal.","replies":[]}]}