{"poster":"TheFhuer","date":"2016-10-20T22:46:41.255+0000","title":"Non mi si apre LOL","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Non mi si avvia il gioco non riesco a capire il motivo!!","replies":[{"poster":"TheFhuer","date":"2016-10-21T01:41:55.518+0000","up_votes":1,"down_votes":0,"body":"Ho formattato il pc ho disintallato il gioco.ho riavviato il pc 400 volte Adesso e la 300 volta che riscarico il client e non mi si Apre nemmeno.Non riesco a capire cosa cazzo sta succedendo  E qui nessuno che ti caga di stricio Mamma mia sempre peggio.","replies":[{"poster":"Chroniicles","date":"2016-10-21T05:14:36.313+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TheFhuer,realm=EUW,application-id=98NGV4Al,discussion-id=E9vpjfnA,comment-id=0001,timestamp=2016-10-21T01:41:55.518+0000)\n>\n>  E qui nessuno che ti caga di stricio Mamma mia sempre peggio.\n\nSai com'è, di solito la gente di notte dorme xD\nSe formatti il pc e non reinstalli driver e programmi indispensabili per il gioco (tipo net framework 3,5, librerie c++ e driver direct x) non prendertela con il gioco se non va","replies":[{"poster":"TheFhuer","date":"2016-10-21T06:57:40.205+0000","up_votes":1,"down_votes":0,"body":"Sai comè il gioco non  mi si apriva nemmeno prima di formattare il pc. e nemmeno tutt'ora mi si apre mi esce scritto pvp kernel patch a smesso di funzionare oppure prima mi diceva che c'era gia aperto un altro Client ma io non avevo aperto nulla.","replies":[{"poster":"Chroniicles","date":"2016-10-21T10:37:54.385+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheFhuer,realm=EUW,application-id=98NGV4Al,discussion-id=E9vpjfnA,comment-id=000100000000,timestamp=2016-10-21T06:57:40.205+0000)\n>\n> Sai comè il gioco non  mi si apriva nemmeno prima di formattare il pc. e nemmeno tutt&#x27;ora mi si apre mi esce scritto pvp kernel patch a smesso di funzionare oppure prima mi diceva che c&#x27;era gia aperto un altro Client ma io non avevo aperto nulla.\n\nSe le cose non ce le spieghi noi non abbiamo neanche la sfera di cristallo ^^\ncomunque, mettiamo da parte inutili lamentele e cerchiamo di risolvere il problema.\n\n1- Quando ti capita l'avviso del client già aperto, la prima cosa da fare è forzare la chiusura del processo precedentemente aperto(n.b, non è detto sia stato tu ad aprirlo manualmente): ctrl+alt+canc, gestione attività, cerca tra le voci il client di lol e termina il processo col tasto destro. \n\n2- Disinstalla nuovamente il gioco, stavolta segui [queste](https://support.riotgames.com/hc/it/articles/202539040-Reinstallare-League-of-Legends) linee guida \n\n3- Installa tutti gli aggiornamenti del sistema operativo andando in Windows Update\n\n4- Installa tutti gli altri aggiornamenti che sicuramente ti mancano post formattazione. Dal pannello di controllo, vai su gestione dispositivi. Se ti compaiono dei punti di domanda sulle periferiche, prova a far partire l'aggiornamento con Windows update, se non funziona prendi il nome della periferica e cercala su goolge per scaricare i driver dal sito del produttore. **Per la scheda video sei obbligato a seguire la procedura lunga**\n\n5- Installa manualmente netFramework 3,5, le ultime librerie c++ e le directx dal sito Microsoft\n\n6- Ravvia il pc, reinstalla il gioco **avviando sempre come amministratore**","replies":[{"poster":"TheFhuer","date":"2016-10-22T02:02:35.578+0000","up_votes":1,"down_votes":0,"body":"Non mi fa vedere gli aggiornamenti in widows update e non riesco nemmeno a farli partire.E nemmeno se vado tramite pannello di controllo non ci sono punti di domanda sulle periferiche..","replies":[{"poster":"Chroniicles","date":"2016-10-22T07:58:42.148+0000","up_votes":1,"down_votes":0,"body":"Se non ti fa partire gli aggiornamenti è grave, ma torniamoci tra un po'.\nSe non ci sono punti di domanda in gestione dispositivi invece è buon segno, ti ha installato automaticamente un driver per ogni periferica!\nHai eseguito l'installazione dei driver manualmente per la scheda grafica? Se non sai come fare, dimmi che modello hai e ti aiuto a cercare il driver più aggiornato. E' indispensabile per far funzionare correttamente il gioco.\nHai anche installato [questo](https://www.microsoft.com/it-it/download/details.aspx?id=21), [quest'altro](https://get.adobe.com/it/air/) e [quest'altro ancora](https://support.microsoft.com/it-it/kb/2977003)?\n\nTornando agli aggiornamenti:\nhttps://i.gyazo.com/0261a0ebcda32e48533921f8a621b8ff.png\nquesto è quanto dovresti vedere se il sistema è aggiornato. Per essere sicuro sia stato installato tutto correttamente, vai su opzioni avanzate, visualizza la cronologia aggiornamenti:\nhttps://i.gyazo.com/8d55477e9b34a87ca959e349dfd7eedc.png\ndovresti avere una lista di aggiornamenti tutti riusciti, in caso contrario postami esattamente quale aggiornamento fallisce","replies":[{"poster":"TheFhuer","date":"2016-10-22T12:32:39.050+0000","up_votes":1,"down_votes":0,"body":"Sto Seguendo passo per passo quello che mi hai detto tu, ho installato i programmi che mi hai linkato sopra, e no non vedo nessun aggiornamento non riuscito e tutto quello che mi hai detto di installare e  andato a buon fine cosa devo fare ora??","replies":[{"poster":"TheFhuer","date":"2016-10-22T13:09:26.767+0000","up_votes":1,"down_votes":0,"body":"Siamo riusciti a farmi ripartire LOL, ora mi aspetta solo il download {{champion:115}}  Grazie mille per l'aiuto mate","replies":[{"poster":"Chroniicles","date":"2016-10-22T13:19:55.864+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheFhuer,realm=EUW,application-id=98NGV4Al,discussion-id=E9vpjfnA,comment-id=00010000000000000001000000000000,timestamp=2016-10-22T13:09:26.767+0000)\n>\n> Siamo riusciti a farmi ripartire LOL, ora mi aspetta solo il download {{champion:115}}  Grazie mille per l&#x27;aiuto mate\n\nPrego, d'ora in poi però non ti agitare se qualcosa non va come dovrebbe... con la calma si risolve tutto ^^","replies":[{"poster":"TheFhuer","date":"2016-10-22T13:27:57.148+0000","up_votes":1,"down_votes":0,"body":"ero tiltato  dopo 3 ore di fila che ci ero a dietro mi erano girati i coglioni ahahah sorry for that <3","replies":[{"poster":"Chroniicles","date":"2016-10-22T13:29:50.131+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TheFhuer,realm=EUW,application-id=98NGV4Al,discussion-id=E9vpjfnA,comment-id=0001000000000000000100000000000000000000,timestamp=2016-10-22T13:27:57.148+0000)\n>\n> ero tiltato  dopo 3 ore di fila che ci ero a dietro mi erano girati i coglioni ahahah sorry for that &lt;3\n\nahahah xD","replies":[{"poster":"TheFhuer","date":"2016-10-23T03:05:16.149+0000","up_votes":0,"down_votes":0,"body":"Mi dispiace romperti ancora le palle ma il gioco continua a non andare il problema ora è diverso il punto : io il gioco lo faccio partire mi scarica l'aggiornamento e arriva fino al 74 o 77 e si blocca io credo che sia bugsplut. lo chiudo e cerco di riaprirlo ma non mi si riavvia e mi rimane la scritta League of Legend ma non succede nulla. se io riavvio il pc il gioco me lo riapre ma il il download continuerà a bloccarsi al 74% tutte le volte.. E gia la seconda volta che faccio l'aggiornamento ma e mi si blocca sempre nello stesso medesimo punto. ora provo a riavviare ancora il pc e a vedere cosa succede\n\n\nPS: ora mi si e riaperto  senza riavviare il pc provo lasciarlo andare per vedere se mi finisce l'aggiornamento senza bloccarsi. ti faccio sapere presto\n\n\n2° ps: Non va oltre al 74% (applicando le patch) terza volta che lo rifaccio Cosa mi consigli di fare?\n\n\n°3ps: Sto provando ad disinstallarlo e reinstallarlo a vedere se cambia qualche cosa, sto iniziando a tiltare ^^","replies":[{"poster":"Chroniicles","date":"2016-10-23T20:24:07.145+0000","up_votes":1,"down_votes":0,"body":"accidenti... non tiltare, con calma xD prova a forzare la patch manualmente.\n\n> Forzare l'applicatore di patch:\n> \n>     A volte i file si danneggiano durante l'applicazione della patch, solitamente per problemi di connessione. Forzare l'applicatore di patch risolve molte volte il problema senza ricorrere a una riparazione completa del client.\n>     Come forzare l'applicatore di patch:\n> \n>     Vai nella cartella Riot Games (Percorso predefinito: C:/Riot Games/League of Legends)\n>     Apri la seguente cartella:\n> \n>     C:\\Riot Games\\League of Legends\\RADS\\projects\\lol_air_client\\releases{numero di versione più alto}\n> \n>     Cancella i seguenti file:\n> \n>         releasemanifest\n> \n>         S_OK\n> \n>         Apri la cartella Deploy\n>         Cancella i seguenti file/cartelle:\n> \n>         lib (cartella)\n>         META-INF (cartella)\n>         mod (cartella)\n>         lolclient.exe (file)\n>         lolclient.swf (file)\n> \n>         locale.properties (file)\n> \n>         Riavvia League of Legends\n> \n>     Se non funziona, prova così:\n> \n>     Cancella la seguente cartella:\n> \n>     C:\\Riot Games\\League of Legends\\RADS\\projects\\lol_launcher\n> \n>     Riavvia League of Legends\n\n Dovrebbe ripartire da capo il download della patch.\nSe ti si blocca e non riesci a farlo ripartire, senza dover ravviare il pc, forza la chiusura di lol tramite task manager come ti avevo spiegato qualche post sopra.\nImposta l'avvio automatico da amministratore, così non ti dimentichi (tasto destro sull'icona del gioco, proprietà, compatibilità, metti la spunta su avvio automatico da amministratore.\nHai windows 10 come sistema operativo? se non va neanche così proviamo a far andare il gioco in modalità compatbilità con Windows 7, prima però stringi i denti e prova questa strada","replies":[]}]}]}]}]}]}]}]}]},{"poster":"TheFhuer","date":"2016-10-22T01:30:06.117+0000","up_votes":1,"down_votes":0,"body":"Ok ora provo a  fare come mi hai appena scritto te vediamo se riesco","replies":[]}]}]}]}]},{"poster":"TheFhuer","date":"2016-10-20T23:10:46.650+0000","up_votes":1,"down_votes":0,"body":"STO PROVANDO A DISINSTALLARLO!!!!! PIENO DI BUG STO GIOCO !!!!!!!!!!!!!","replies":[]}]}