{"poster":"Javi38","date":"2020-02-10T07:22:05.415+0000","title":"¿Campeon asesino mas facil para JG?","subforum":"Guias y consejos","up_votes":2,"down_votes":0,"body":"De todos los campeones asesinos AD ({{champion:141}} {{champion:121}} {{champion:35}} {{champion:56}} {{champion:246}})  del juego, ¿cual de todos creen que es el mas fácil de usar (que casi no tenga mecánicas o complejidades al usarse) para alguien que quiere empezar a jugar jungla?, ¿que opinan?","replies":[{"poster":"Necrosis","date":"2020-02-10T10:44:35.457+0000","up_votes":1,"down_votes":1,"body":"Lo más simple que podes usar para empezar jungla es **Warwick**, mecánicas simples pero efectivas. No necesitas ni ayuda para junglear, avanzas tranquilamente.\nPero también te recomendaría que busques videos de como junglear, donde wardear según el tipo de partida, caminos/rutas posibles en cada ocasión, puntos de gankeos y las distintas opciones que podes ir tomando a lo largo de la partida dependiendo las diferentes situaciones. \n¡Suerte! (y)","replies":[{"poster":"rama144","date":"2020-02-10T14:51:36.666+0000","up_votes":2,"down_votes":0,"body":"\"Asesino\"","replies":[]}]},{"poster":"Salvor","date":"2020-02-10T12:13:00.867+0000","up_votes":1,"down_votes":0,"body":"{{champion:28}} {{champion:120}}","replies":[{"poster":"rama144","date":"2020-02-10T14:51:05.854+0000","up_votes":2,"down_votes":0,"body":"Asesinos \"AD\"","replies":[]}]},{"poster":"DIBUJE PICHICHI","date":"2020-02-10T08:48:30.845+0000","up_votes":1,"down_votes":0,"body":"Kayn azul","replies":[{"poster":"UNKNOWSER","date":"2020-02-10T08:50:57.415+0000","up_votes":2,"down_votes":0,"body":"se llama rhaast capo","replies":[{"poster":"DIBUJE PICHICHI","date":"2020-02-17T02:09:51.850+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=UNKNOWSER,realm=LAS,application-id=8sKIclmi,discussion-id=En1zK8Es,comment-id=00020000,timestamp=2020-02-10T08:50:57.415+0000)\n>\n> se llama rhaast capo\n\nRhaast es el darkin que esta contenido en la guadaña jajajjaja","replies":[]},{"poster":"TvTLucio22","date":"2020-02-10T09:20:19.649+0000","up_votes":1,"down_votes":0,"body":"rhaast es el rojo, se refiere a shadow assassin kayn","replies":[]}]}]},{"poster":"GIRsito","date":"2020-02-12T22:57:31.600+0000","up_votes":1,"down_votes":0,"body":"Realmente toda la gente que dice Nocturne, Shaco, Etc... Realmente se equivoca\nNos referimos a \"Asesino\" como \"Personaje AD/AP que realice muchisimo daño en muy poco tiempo\"; y el exponente número uno de esta iniciativa es ni mas ni menos que {{champion:121}} \nEs super facil jugarlo, unicamente te subes al máximo la Q, Evolucionas la habilidad que mas te convenga y listo, mas si sobre todo estás contra un JG que no es un tanque o un luchador (Ej: {{champion:11}} {{champion:245}} {{champion:30}} {{champion:76}} ).\n\nPara que tengas en cuenta es el rey de los 1v1 y 1v2, sus counters por lo general son tanques con CC, o personajes con un sustain por básico y/o por habilidad (Ej: {{champion:2}} {{champion:98}} {{champion:33}} {{champion:19}} {{champion:154}} {{champion:36}} )\n\nEspero que te sirva mi recomendación, y no te olvides que este JG no es para todas las composiciones, solo escógelo cuando el equipo enemigo sea relativamente Squishy.","replies":[]},{"poster":"gurennaxus12","date":"2020-02-10T18:09:20.044+0000","up_votes":1,"down_votes":0,"body":"te recomendaria shaco gankea bien puede escapar de situciones complejas y tienes que tener un iq de mas de un millon pero eso es si quieres mainearlo y si lo haces te recomiendo que veas pink ward es un streamer que es super bueno con el vee los montages en youtube y lo domina al 100","replies":[]},{"poster":"rokushoger","date":"2020-02-10T15:10:04.299+0000","up_votes":1,"down_votes":0,"body":"Creo que nocturne, pero lo que no te lleva de mecánicas te lleva en aprender cuando y como entrar, porque donde entres mal no solo no matas a nadie sino que te bajan de toque.","replies":[]},{"poster":"Errør 404","date":"2020-02-10T08:27:13.246+0000","up_votes":1,"down_votes":0,"body":"Hola! Yo optaría por Nocturne o Shaco. Realmente tenés que ser muy malo para no fedearte con Nocturne ya que su ultimate convierte en free kill a cualquier enemigo con poca vida xD Pero si lo tuyo es ser un verdadero asco, Shaco te va a encantar! Gankea bien y puede escapar de situaciones complejas gracias a la invisibilidad. Además es de juego temprano así que podés robar la jungla rival sin preocuparte demasiado ;D \n\nPor ultimo creo que eligiría a Kayn por su versatilidad. Si hay muchos tanques te hacés rojito, si hay muchos squishys te hacés azul. ¡Es genial! El unico problema que noto en Kayn es que es mas de juego medio/tardio y eso, si no tenés team, es gg :/\n\nPD: Aunque me gusta ir jungla no juego ninguno de esos campeones. Prefiero los junglas tankes/iniciadores o combatientes. Todas las opiniones que escribí anteriormente se basan en mi experiencia al tener a esos campeones EN CONTRA. \n\nUn abrazoo!! ","replies":[]},{"poster":"SKD Chichin","date":"2020-02-10T07:37:21.730+0000","up_votes":1,"down_votes":0,"body":"te recomiendo Nocturne, es un campeon bastante simple, te dejo unos tips:\n-Habilidades: Q->E->W maxeas Q luego E y de ultimo W, obviamente la R cada vez que puedas\n-Ruta recomendada: \n Lado Azul(Sur/Izquierda) : Red->Krugs->Pajaros -> Lobos -> Blue -> Gromp - > Cangrejo de top/ gank/recall\n Lado Rojo(norte/derecha): Blue->Gromp->Lobos -> Pajaros -> Red -> Krugs -> Cangrejo de top/gank /recall\nAl terminar tu primera limpieza de jungla puedes repetir el proceso saltandote los buffos y utilizando el tiempo que sobre para hacer un gank o sacar cangrejo/ poner o quitar vision del enemigo o hasta invadir si ves la oportunidad. Luego cuando veas que estan por salir tu Red(si empezaste por el lado azul) o Blue(si empezaste por el lado rojo) intenta recallear y hacer la limpieza nuevamente y repites el ciclo.\n-Tips:\nUtiliza tu W para prevenir los cc o daño importante de los enemigos al momento de pelear\nPower farmear y esperar a tener tu ulti para hacer un gank es bastante viable si el juego esta tranquilo\nEres un asesino asi que no busques meterte entre 5, buscaa los enemigos que esten separados del resto y que sean blanditos\n\nExito :)","replies":[]}]}