{"poster":"PP Naruto","date":"2015-04-15T18:48:25.980+0000","title":"Why can't I get out of silver 5","subforum":"[ARCHIVED] General Discussion","up_votes":8,"down_votes":2,"body":"Ok before people start looking at my stats, recently some games have been bad. I admit fault and I know my mistake. but thats usually quite low to be honest.\r\n\r\n\r\nNOW: Most my games, I tend to play carries, people I know will kill the team/split push at the right time successfully and make it out alive, think volibear, udyr, kalista, yasuo things of that nature. I carry the majority of my games......here's why I lose (andd scream so loud) and it's not afk'ers and trolls, those are honestly quite rare. although in the past 20 games maybe got one dc..\r\n\r\n\r\n\r\n-baron throws, team isnt with me and they're suddenly going to baron and get caught and start baron but instead of collapse on the first two that poke or even just ditch baron, they just continue till they are half health and boom get quadra'd.\r\n\r\n-the feed team: this is most my games, I'm usually bot lane doing very well with kalista, extremely well even against my counters, for example against a graves yesterday, i kept up in farm actually did more cs than my counter the whole game. just sucks that graves burst kills me faster.  but none the less, the team while im staying 0 0 0 bot lane, feeds a fiora top and annie countless times and i am absolutely hopeless bot lane cuz if i ditch the lane there goes the tower. so i made sure to ask to never gank bot so he could help the other lanes. But i get games like this basically every time: somebody has to ruin it for everyone.\r\n\r\n-the tank meta: played against 4 ttanks, was impossible to beat an ap cho, ap blitz, hecarim and some other tanks and a vayne.  Tank teams are rising and this is overpowering damage builds. Damage is starting to no longer be necessary as long as you're a big fat huge dude. hence why i play voli and win most the games. should probably just keep doing that\r\n\r\n-idk....\r\n\r\n\r\nI do great top lane yasuo, have currently crushed every lane i've been against, even leblanc, diana, malphite, you name it, vladimir...never mattered...i went 9-0 yasuo, only to end up like 18-15 and lose cuz they fed someone so hard and EVERY teamfight a vi would just dive right for me. There is litterally nothing i can do more to provide help.\r\n\r\n\r\noh btw: I ward my bushes, i ping for help, i ping things i notice, i counter build as soon as needed( qss, last whisper, banshee), i buy correct paths, i am friendly to the team pregame, and give subtle suggestions every now and then such as upgrade trinkets, keep eyes on minimap etc, drop a pink here, great job nami, etc..etc.. I have full brain.com activated when playing and know what towers to take down, at what time, when dragon is good to sneak, who to focus in teamfight, I rarely fail at focusing the right targets in a fight. \r\n\r\n\r\nTLDR: team feeds someone so hard that no matter what my score is, i die once the teamfight happens because it's impossible to penta with everyone focusing you since i'm usually the only fed person or doing \"well\" or considered a big threat. and there's nothing I can do\r\n\r\n\r\n\r\nI'VE DONT PROMO'S 4 FUCKING TIMES just for silver 4...like wtf ?\r\n\r\n\r\ncan someone give me advice, even if i've already heard it, maybe something else will tick ? What is my hope ? do i just hope my team is smart and knows how to make plays ?","replies":[]}