{"poster":"Cheese Pope","date":"2016-03-27T00:58:54.012+0000","title":"Why are we censoring Karthus' face in North America?","subforum":"Story, Art, & Sound","up_votes":220,"down_votes":16,"body":"Karthus&#039; face was censored in China.\n\nhttp://i.imgur.com/4G37xeD.png\n\nKarthus was given a visual update. His other skins were not given a splash update (like many other visual updates).\n\nNow that Riot is &quot;unifying&quot; the art we are getting China&#039;s stupid censorships. Why are China&#039;s censorships being forced upon us in a country where we don&#039;t censor these sort of things?!?!??!?! They are giving us the splash arts where they cover up his face for his skins (the old splash arts) and they are blacking out his current face?!??!?!?! \n\nhttp://i.imgur.com/dD2L7z8.gifv\n\nWHY RIOT, WE DON&#039;T LIVE IN CHINA WHY ARE YOU CENSORING HIS BEAUTIFUL FACE IN AMERICA.","replies":[{"poster":"YCitizenSnipsY","date":"2016-03-27T01:02:15.843+0000","up_votes":85,"down_votes":1,"body":"The real question is why is statue of Karthas being changed, especially to a splash that doesn't even use the statue of liberty's pose. \n\nLike can we also get an Uncle Ryze update where he is just reading from a scroll or something since Iconic poses for something that is being parodied doesn't matter anymore /s","replies":[{"poster":"Monkey D Luffy","date":"2016-03-27T15:40:14.998+0000","up_votes":20,"down_votes":1,"body":"The real question is why they feel like this unification is necessary???","replies":[{"poster":"Velzard of Koz","date":"2016-03-27T16:17:38.625+0000","up_votes":4,"down_votes":0,"body":"To be honest - because many players requested the update. In some cases it seems Riot misunderstood it, but it would be little jerky to make new waves of hatred, because that way chances Riot will read boards and care about those little things will be negated even more. Players were now and then complaining (with many upvotes) that some of chinese slpash is better (more up to date) and if they don't want to waste resources on updating some (namely Pharaoh Nidalee), they can simply use the Chinese one. The only one which looks like ridiculous change is Nightraven Fiora. That literally looks like reverting it to older splash. Even the pose looks like the older slpashs.","replies":[]}]}]},{"poster":"Blue Moon Wolf","date":"2016-03-27T01:21:29.017+0000","up_votes":46,"down_votes":0,"body":"I would have said it was cause they are using the chinese splashes and will eventually update them to the current standard... but then I saw the change to his current splash...\nWTF RITO? HE DOESN'T EVEN HAVE A SKULL FOR A HEAD ANYMORE! WHY IS HE GETTING CENSORED?!\nIf they really wanted to censor some skulls, they should have another look at {{champion:120}} who literally has 4 SKULLS ON HIS TORSO -__-","replies":[{"poster":"General Esdeath ","date":"2016-03-27T01:44:24.080+0000","up_votes":6,"down_votes":5,"body":"It's not about the skull, it's the face of death. It's a Chinese culture thing.","replies":[{"poster":"iamthegoatofwar","date":"2016-03-27T05:06:46.786+0000","up_votes":27,"down_votes":0,"body":"then trust me when I say im shocked they let jhin exist. china does not like the number 4.","replies":[{"poster":"Academy Kayn","date":"2016-03-27T06:26:08.123+0000","up_votes":2,"down_votes":0,"body":"Yeah, but that would be like Candy Crush Saga trying to sue for Copyright of the word Saga. You just can't get rid of the number four, because you don't like it's existence.","replies":[{"poster":"iamthegoatofwar","date":"2016-03-27T06:50:07.346+0000","up_votes":2,"down_votes":1,"body":"...if they own the company can't they basically order them to take jhin out? Only reason i could see them not doing that is the community back lash it could cause.","replies":[{"poster":"KaisadiIIa","date":"2016-03-27T11:14:58.710+0000","up_votes":12,"down_votes":0,"body":"That doesn't work exactly that way. Although Tencent owns RIOT, they don't control nor they don't care about what they do. They only care about profits. They set certain economic goals that have to be met. The way they are met is irrelevant to them. The only situation where I think they would tell off RIOT is if they introduced something very unappropiate like a racist joke within the game.","replies":[]}]}]}]},{"poster":"GreenLore","date":"2016-03-27T11:43:34.149+0000","up_votes":12,"down_votes":0,"body":"But Karthus isn't death.\nIn fact the face of death is seemingly MORE acceptable since riot didn't have to censor the face of grim reaper karthus.\n\nAnd his ingame model isn't censored either,so I don't know why his splash art would need to be censored","replies":[{"poster":"General Esdeath ","date":"2016-03-27T13:30:29.119+0000","up_votes":1,"down_votes":0,"body":"Dude, karthus has a skin where's he's the grim reaper. That's death. And the model isn't art so to them it's not as bad.","replies":[{"poster":"GreenLore","date":"2016-03-27T16:02:45.633+0000","up_votes":6,"down_votes":0,"body":"Yes and said skin went completely uncensored in china,because it is ok to show the face of death as a skull.\nI mean we even get the chinese reaper karthus splash and it looks like this:\nhttps://4.bp.blogspot.com/--FkP-rBCaBg/VvWrcgSOVfI/AAAAAAAAMpk/jl0vzBef0jUsgBJ5tk7-Ec_65_Q25wfHg/s1600/Karthus_Splash_3.jpg\n\n","replies":[]}]}]},{"poster":"Blue Moon Wolf","date":"2016-03-27T02:05:19.464+0000","up_votes":6,"down_votes":0,"body":"Well if that was the case, shouldn't Kindred's faces be cov- oh wait :p","replies":[]}]}]},{"poster":"Astôlfo","date":"2016-03-27T01:28:01.822+0000","up_votes":43,"down_votes":0,"body":"because it looks like graves' cigar","replies":[]},{"poster":"DexterousGecko","date":"2016-03-27T02:17:06.797+0000","up_votes":35,"down_votes":2,"body":"Isn't riot 100% owned by a Chinese company now?","replies":[{"poster":"Draqone","date":"2016-03-27T08:19:30.148+0000","up_votes":11,"down_votes":0,"body":"> [{quoted}](name=DexterousGecko,realm=NA,application-id=6kFXY1kR,discussion-id=wauaxRkl,comment-id=0005,timestamp=2016-03-27T02:17:06.797+0000)\n>\n> Isn't riot 100% owned by a Chinese company now?\n\nI really doubt chinese businessmen care about ideology as long as it doesn't influence their cash balance.","replies":[]}]},{"poster":"GreenLore","date":"2016-03-27T01:16:42.794+0000","up_votes":12,"down_votes":6,"body":"I think it is more along the lines of:\n-China is used to karthus with a hidden face\n-So his face is hidden in shadows even in his new look so that it doesn't look that different.\n-Riot thinks it looks good with the hidden face,so they use it as the standard.\n\n\nLike seriously that shadow doesn't hide that much and the ingame model is unchanged as well,so it kinda fails as a censor anyway.","replies":[{"poster":"Ralanr","date":"2016-03-27T01:33:03.035+0000","up_votes":13,"down_votes":2,"body":"Isn't it because China had a law against showcasing bones?","replies":[{"poster":"AntiSkillshot","date":"2016-03-27T02:37:09.212+0000","up_votes":32,"down_votes":4,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=6kFXY1kR,discussion-id=wauaxRkl,comment-id=00010000,timestamp=2016-03-27T01:33:03.035+0000)\n>\n> Isn't it because China had a law against showcasing bones?\n\nInteresting to know that laws in China when it comes to bones affect people in the US.  Interesting to remember that China gives no fucks about copyright laws in the US.","replies":[{"poster":"Star Guardían","date":"2016-03-28T00:21:30.486+0000","up_votes":2,"down_votes":1,"body":"Chinese laws don't affect companies outside of China. Riot's product is \"sold\" in China therefore they have to adhere to their rules in China. The only reason why it's affecting us is because Riot doesn't want to have a different product for each region. You're also wrong about China not caring about US copyright laws. All the Chinese companies that are multi national and have firms in the US and other countries sure as hell abide by those rules. It's the companies that never expand out of China that blatantly break copyright laws.","replies":[{"poster":"AntiSkillshot","date":"2016-03-28T00:58:29.484+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=JIIMIE,realm=NA,application-id=6kFXY1kR,discussion-id=wauaxRkl,comment-id=0001000000020001,timestamp=2016-03-28T00:21:30.486+0000)\n>\n> Chinese laws don't affect companies outside of China. Riot's product is \"sold\" in China therefore they have to adhere to their rules in China. The only reason why it's affecting us is because Riot doesn't want to have a different product for each region. You're also wrong about China not caring about US copyright laws. All the Chinese companies that are multi national and have firms in the US and other countries sure as hell abide by those rules. It's the companies that never expand out of China that blatantly break copyright laws.\n\nActually, no.  Riot isn't selling a different products for each region.  Every region gets the exact same skin.  It's up to the players preference when it comes to the splashes.  And, clearly, the NA server neither wants the \"Nightraven\" Fiora splash nor the change to Karthus' splash downgrades.\nAnd that's what I was jabbing at when I was talking about copyright laws.","replies":[{"poster":"Star Guardían","date":"2016-03-28T01:12:47.381+0000","up_votes":2,"down_votes":1,"body":"I'm saying that Riot doesn't want to have a different product for any region in anyway possible. They wanto have the same splashes, same lore, same logins, same *everything* for *all* regions. Up until this point part of the product has been different for the regions (splash arts) which is why they're unifying them to be the same.also remember this is a temporary fix until they actually update the splash arts. Also China is losing some of the splash arts they're attached to and love so it isn't a one way street.","replies":[{"poster":"AntiSkillshot","date":"2016-03-28T01:33:33.017+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=JIIMIE,realm=NA,application-id=6kFXY1kR,discussion-id=wauaxRkl,comment-id=000100000002000100000000,timestamp=2016-03-28T01:12:47.381+0000)\n>\n> I'm saying that Riot doesn't want to have a different product for any region in anyway possible. They wanto have the same splashes, same lore, same logins, same *everything* for *all* regions. Up until this point part of the product has been different for the regions (splash arts) which is why they're unifying them to be the same.also remember this is a temporary fix until they actually update the splash arts. Also China is losing some of the splash arts they're attached to and love so it isn't a one way street.\n\nTemporary fixes are worse than just straight up fixing them right off the bat.","replies":[]}]}]}]}]},{"poster":"Cynicatt","date":"2016-03-27T11:55:17.933+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=6kFXY1kR,discussion-id=wauaxRkl,comment-id=00010000,timestamp=2016-03-27T01:33:03.035+0000)\n>\n> Isn't it because China had a law against showcasing bones?\n\nWhen he was visually reworked they literally made sure to design him so that he would be acceptable for China.\nNow, what, they don't even like this? Something that was pretty much made **for** them, and that I'm sure they agreed upon?\n\nThe blackening of his face in his classic splash looks stupid, was obviously hastily done with the burn tool, and is unnecessary.\nAsking why is entirely realistic.","replies":[]},{"poster":"General Esdeath ","date":"2016-03-27T01:43:57.164+0000","up_votes":2,"down_votes":0,"body":"They don't believe in showing the face of death","replies":[]}]}]},{"poster":"The Soulforged","date":"2016-03-27T03:32:35.995+0000","up_votes":18,"down_votes":0,"body":"I thought the point of the karthus VU was to be able to use his art in China...","replies":[]},{"poster":"4th3t0s","date":"2016-03-27T04:46:17.552+0000","up_votes":6,"down_votes":15,"body":"Because they, as a international business, need to cater to universal appeal.  The world doesn't revolve around the USA, get used to it.  They explained this clearly in the S@20 post.","replies":[{"poster":"Zenthon Prime","date":"2016-03-27T05:03:23.724+0000","up_votes":18,"down_votes":3,"body":"I have an idea!  What if we just had slightly different splashes for regions with special laws (aka China and literally nowhere else)?\n\nOh wait.  That's exactly what we have right now.  Never mind a major reason for the direction of the Karthus VU was specifically so that it wouldn't offend China, so why it's censored _at all_ is kinda confusing.","replies":[{"poster":"Leetri","date":"2016-03-27T10:12:54.951+0000","up_votes":4,"down_votes":2,"body":"That's exactly the opposite of what the entire point of this change is, Riot wants the game to look the same no matter where you play it.\nIs it a good change? I have no opinion on that, in some cases it's better and in some it's worse, but it's all about personal taste.","replies":[]}]}]},{"poster":"TygerMaul","date":"2016-03-27T04:03:03.659+0000","up_votes":12,"down_votes":7,"body":"Logged in just to comment on this. Ridiculous when our game must be changed to conform to the standards of COMMUNIST China. The same China that jails political dissidents, limits the amount of children their citizens can have, censors the internet and all around treats its citizens like minions. Lame Riot.","replies":[{"poster":"Igotlazy","date":"2016-03-27T05:10:39.236+0000","up_votes":10,"down_votes":3,"body":"Well in all honesty the birth limits are pretty damn logical considering just how many people live in that Country. China can only hold so many humans you know? Earth has a cap as well and eventually it's possible most populated countries will enforce a limit. ","replies":[]},{"poster":"KaisadiIIa","date":"2016-03-27T11:19:33.788+0000","up_votes":10,"down_votes":4,"body":"Why are you writing propaganda here? First of all, China is not a COMMUNIST country, it's a \"socialist\" one (de facto they are capitalist anyway). Second, I find it stupid that Americans in the XXI century still use \"communist\" as an insult. C'mon, you should respect other people's political views. Finally, the birth limit was necessary.","replies":[{"poster":"LankPants","date":"2016-03-27T11:31:02.160+0000","up_votes":5,"down_votes":3,"body":"Welcome to America, where Bernie Sanders, a completely sane Socialist is somehow just as controversial as Donald Trump, a completely insane far right arsehat, for lack of a better word.","replies":[{"poster":"KaisadiIIa","date":"2016-03-27T12:25:15.906+0000","up_votes":4,"down_votes":1,"body":"Traditional right-wing media in European countries (at least mine) are tagging Donald Trump as a fascist, and his ways to power are seen similar to Hitler's. I sincerely don't know how too many people can support someone like that. Meanwhile some of the Bernie's proposals are considered basic rights in Europe.","replies":[{"poster":"LankPants","date":"2016-03-27T12:52:24.689+0000","up_votes":3,"down_votes":0,"body":">are tagging Donald Trump as a fascist, and his ways to power are seen similar to Hitler's. \n\nI can certainly see that one, I still think Arsehat fits well though.","replies":[]}]}]},{"poster":"It Hertz When IP","date":"2016-03-27T11:32:56.993+0000","up_votes":5,"down_votes":2,"body":"Wasting your time, average US citizen doesn't know the difference between fascism, socialism, and communism.\n\n-A US citizen","replies":[]}]},{"poster":"Subundu","date":"2016-03-27T13:45:42.555+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TygerMaul,realm=NA,application-id=6kFXY1kR,discussion-id=wauaxRkl,comment-id=000d,timestamp=2016-03-27T04:03:03.659+0000)\n>\n> Logged in just to comment on this. Ridiculous when our game must be changed to conform to the standards of COMMUNIST China. The same China that jails political dissidents, limits the amount of children their citizens can have, censors the internet and all around treats its citizens like minions. Lame Riot.\n\nIt's not a question of political ideologism. They own the company. They have more money and they take decisions. Period. That's the american model and one of the most famous american rules, dude...","replies":[]}]},{"poster":"Solaxo","date":"2016-03-27T20:56:14.740+0000","up_votes":6,"down_votes":0,"body":"Because Riot sold their souls to Tencent, their chinese overlords","replies":[]},{"poster":"Hís Lamb","date":"2016-03-27T20:00:26.658+0000","up_votes":4,"down_votes":0,"body":"Correct me if I am wrong, but doesn't one of the splashes they are \"unifying\" have blatant bones/ Skull on it (I think it's the Grim Reaper)?  And if we are to assume that bones are the main concern, I would think that one would be way more offensive.  His current basic splash almost looks less skull-like, and more rotting flesh, while the new Grim splash is as boney as it could get.  I'm just a little confused on the logic...  I don't really see why his current splash needs to be changed, although the change is minimal I suppose.","replies":[{"poster":"Ulquiorra995","date":"2016-03-28T09:55:00.807+0000","up_votes":2,"down_votes":0,"body":"I really, really don't get Riot. First they completely ruin Karthus' Grim Reaper skin by making it nothing like Grim Reaper at all because of China not liking bones... and then they change his splash art into a traditional Grim Reaper - you know, a skeleton. And said skeleton is actually his original Chinese splash.","replies":[]}]},{"poster":"Eeyore","date":"2016-03-27T04:24:33.861+0000","up_votes":4,"down_votes":0,"body":"I was under the impression that Karthus' rework took into account Chinese culture in the first place. His new face is clearly ghoulish, rather than \"possibly a skull\" as it was on his old model. I can only assume from the change to his splash artwork that his VU did not do a sufficient job... but that just makes me feel bad for his splash artist. I think he did a good job of making him look gaunt but still skin...","replies":[]},{"poster":"SpartenA7991","date":"2016-03-27T06:18:51.543+0000","up_votes":6,"down_votes":2,"body":"It isn't being censored, its just getting SPOOKY.\nhttp://orig15.deviantart.net/7d3c/f/2014/252/8/3/2spooky4me_gif__by_noahfan-d7yi8tk.png","replies":[]},{"poster":"Maratsune","date":"2016-03-27T05:39:56.071+0000","up_votes":6,"down_votes":2,"body":"That face update is pretty crappy\nwow\ngg rito\nAlmost as bad as the Karma splash changes","replies":[{"poster":"Draqone","date":"2016-03-27T08:21:18.696+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Maratsune,realm=NA,application-id=6kFXY1kR,discussion-id=wauaxRkl,comment-id=0015,timestamp=2016-03-27T05:39:56.071+0000)\n>\n> That face update is pretty crappy\n> wow\n> gg rito\n> Almost as bad as the Karma splash changes\n\nI like some of the Karma splash changes...","replies":[]}]},{"poster":"Digielf","date":"2016-03-27T10:48:12.212+0000","up_votes":6,"down_votes":3,"body":"i cant believe people complain so much  about the most unimportant details","replies":[{"poster":"Celio Hogane HD","date":"2016-03-27T15:11:46.744+0000","up_votes":4,"down_votes":1,"body":"Racist is real bruh.","replies":[]}]},{"poster":"CasterGilgamesh","date":"2016-03-27T03:36:34.068+0000","up_votes":6,"down_votes":3,"body":"i honestly kinda like the darkness it makes karthus seem more....i dont know it just seems to fit","replies":[]},{"poster":"jama655","date":"2016-03-27T19:22:29.988+0000","up_votes":1,"down_votes":0,"body":"i think there doing it for cohesion sake","replies":[{"poster":"Oberic","date":"2016-03-28T13:17:46.739+0000","up_votes":1,"down_votes":0,"body":"They're doing it because they bow down to China.","replies":[{"poster":"jama655","date":"2016-03-28T23:31:20.187+0000","up_votes":2,"down_votes":0,"body":"to be fair a chinese company does own a large stake of riot games","replies":[]}]}]}]}