{"poster":"Protty","date":"2018-05-07T02:36:08.777+0000","title":"Skin boost, Aram game mode.","subforum":"Miscellaneous","up_votes":1,"down_votes":2,"body":"I have recently played a game of Aram, and to my joy, was given Lux as my random champion. It was then that a fellow lobby member tried to swap with me. I declined the trade and made sure I had the right runes, summoner spells, and most importantly the skin I wanted to play selected. The skin in question was elementalist lux, a very popular skin that is incredibly enjoyable to play. The person that I declined the trade with decided to use a skin boost at the last second of the lobby thus causing the game to auto select a skin I did not want to play. I was unable to change my skin back due to time constraints of me having 2 seconds to register that a skin boost had been purchased and try and swap back to my preferred skin. The play then admitted in the game that they purchased this skin boost vindictively to stop me being able to use the skin I wanted. This may seem a trivial matter but knowing that this is a possibility that a player can take concerns me and makes me less inclined to want to play this particular game mode, which used to be my favourite. I would like to see some change put in place to stop this particular set of events form ever occurring again.","replies":[{"poster":"Leeboes","date":"2018-05-25T14:45:47.913+0000","up_votes":1,"down_votes":0,"body":"who the fk cares","replies":[]},{"poster":"QAPLA","date":"2018-05-07T10:38:41.717+0000","up_votes":1,"down_votes":0,"body":"OMG ban that guy for giving you free BE.\nSkins matter!","replies":[]},{"poster":"Phoed","date":"2018-05-07T06:35:37.332+0000","up_votes":1,"down_votes":0,"body":"LMAO \nhttps://gyazo.com/a8e2927e39f23591bde39bf073c3dccd","replies":[]},{"poster":"Phoed","date":"2018-05-07T06:24:29.377+0000","up_votes":1,"down_votes":0,"body":"He should be punished! Certain skins boost your confidence and with the person taking away your skin, he basically griefed you.","replies":[]},{"poster":"SOOM","date":"2018-05-07T03:37:02.266+0000","up_votes":1,"down_votes":0,"body":"Just take the free boosts and playyour skin in a game after","replies":[]}]}