{"poster":"MissVaanjieee","date":"2019-10-19T03:09:34.889+0000","title":"SERVIDORES CAIDOS EN LAS CHILE","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"Al entrar en selección de campeón va todo bien, pero cuando está finalizando la misma, se queda en \"tu partida está por comenzar\".\r\nAsí, son fácil 5 minutos de  espera, luego te desconecta y no te deja buscar otra partida. \r\nPor lo que veo, son problemas en general en todo el servidor de LAS. Perú, Chile, Argentina, Bolivia son afectados por esta caída \r\ndel servidor. ¿A alguien más le está ocurriendo esto? \r\n\r\n{{sticker:sg-janna}} \r\n\r\nSería bueno que algún Rioter pudiera dar alguna ayuda, o alguna explicación {{champion:32}}","replies":[{"poster":"Mexicola","date":"2019-10-19T03:27:08.705+0000","up_votes":4,"down_votes":0,"body":"Llamó rito y dijo que está todo joya, seguro es que estás usando el wifi o tu proveedor de internet. Noigo Noigo soy de palo tengo orejas de pescado.","replies":[{"poster":"Dojaf","date":"2019-10-19T03:47:59.416+0000","up_votes":1,"down_votes":0,"body":"JA! +10","replies":[]}]},{"poster":"xX TuOniichan Xx","date":"2019-10-19T03:38:53.834+0000","up_votes":1,"down_votes":2,"body":"LAS Chile? eso donde queda? en LAS o en Chile?...El servidor esta en Chile, pero es el servidor para Latinoamerica Sur...No son lo mismo ni es necesario decir donde esta para entender a que server te refieres pues es el foro de LAS...\n\nDicho eso, el server esta colapsado, no es otra cosa, tal vez tu internet o tu pc estén ayudando a agravar el problema por que a mi también me ocurrió algo similar pero tardó 20 segundos en comenzar a cargar, no 5 min...","replies":[{"poster":"Dojaf","date":"2019-10-19T03:49:54.670+0000","up_votes":1,"down_votes":0,"body":"Espera, Espera que el servidor ya no esta en chile xd esta en Mexico que recuerdo Haber leido que pasaron todo para  MEX cuando dieron el anuncio del cierre de sus operaciones en chile.","replies":[{"poster":"El Grando Smokio","date":"2019-10-19T03:56:08.834+0000","up_votes":1,"down_votes":0,"body":"Eso es el equipo que maneja el Esports en LATAM nada que ver asjkdbsdklasñdm ,asdb db db db {p´xd","replies":[{"poster":"Dojaf","date":"2019-10-21T22:25:29.039+0000","up_votes":1,"down_votes":0,"body":"Va que estoy 100% seguro que leí una entrevista en la cual confirmaban esto (la estoy buscando) recuerdo que publicaron el link aquí mismo.","replies":[]}]},{"poster":"xX TuOniichan Xx","date":"2019-10-19T20:21:15.836+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dojaf,realm=LAS,application-id=X54mVVp0,discussion-id=LPpB8AEY,comment-id=00020000,timestamp=2019-10-19T03:49:54.670+0000)\n>\n> Espera, Espera que el servidor ya no esta en chile xd esta en Mexico que recuerdo Haber leido que pasaron todo para  MEX cuando dieron el anuncio del cierre de sus operaciones en chile.\n\nEso es casi imposible, lo que yo se que hicieron fue cerrar las operaciones con respecto a las transmisiones y esas cosas. Lo que tiene que ver con los E-sports y eso. Pero el servidor debe estar en Chile, por dos razones, la primera, si el servidor de LAS esta en MX...Donde esta el de LAN? Honestamente no recuerdo si era México o una parte directa de Estados Unidos, pero no tiene sentido poner dos servidores para latinoamerica en Estados Unidos o México, para eso mejor fusionan ambos y un servidor grande para todo latam. Y la segunda razón...El ping depende de la distancia que recorre la información por internet, y nunca he jugado en LAN, pero te apuesto mi cuenta a que no jugaría con los 18 de ping que he jugado siempre en LAS xD.","replies":[]}]}]},{"poster":"iNGENiO","date":"2019-10-19T03:55:40.555+0000","up_votes":1,"down_votes":0,"body":"Falta que Riot ponga $$ para Rioters que arreglen el LAG y para un server mejor.\n\n$$$$$$$$$$","replies":[]},{"poster":"KRG Dadyx","date":"2019-10-19T03:14:55.770+0000","up_votes":1,"down_votes":0,"body":"si a mi me esta ocurriendo algo parecido, ya que tengo una cola de 20 minutos para TFT y no me llama.","replies":[]}]}