{"poster":"TEMP1398733","date":"2015-03-09T19:20:17.437+0000","title":"Gold+ 5s rankedTeam sucht stronk Jungler","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hi\r\n\r\nIch und mein Kollege Noisyo suchen noch Mitstreiter für unser 5s ranked team.\r\nWir beide haben schon an Erfahrung gesammelt in full Platin Teams. Jedoch haben sich diese aufgelöst aufgrung Unzuverlässigkeiten anderer.\r\n\r\nWenn ihr euch bei uns bewirbt sollte man min auf Gold+ Niveau sein.\r\nGesucht wird:\r\n\r\nJungle\r\n\r\nZiele:\r\n-Bis Ende der Saison min Platin erreichen\r\n-An Turnieren teilnehmen wenn man soweit ist. z.b. Go 4 LOL\r\n-Ab Platin sofern vorhanden mit einem Coach\r\n-SRSLY GAMING! Kein fcking Funteam!\r\n\r\nAußerdem werden wir feste Trainingszeiten haben. (DI,DO,SO)\r\nTrainingsbeginn immer 7 Uhr.\r\nPünktlichkeit ist bei uns oberstes Gebot!\r\n\r\nBei Interesse bewirbt euch im Forum mit einer Antwort.\r\nWenn wir interessiert sind werdet ihr geaddet.\r\nDarauf folgt Bewerbungsgespräch etc.","replies":[{"poster":"EntentionalFeder","date":"2015-03-10T11:27:15.987+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nich bin Linrond, 18 Jahre alt und spiele seit S1 League of Legends, momentan in Platin V. Ich bin seit ca. 2 seasons jungle main und kann daher auch fast jeden jungler der viable ist spielen (Main j4/lee/vi/amumu). Mein letztes Team hat sich aufgelöst weil die Botlane abgewandert ist, daher suche ich ein neues Team, welches länger bestehen bleibt und auch mal bei Turnieren mitmacht.\n\nMfG. Linrond","replies":[]},{"poster":"Morg4nFreeFarm","date":"2015-03-10T10:29:24.351+0000","up_votes":1,"down_votes":0,"body":"Moin,\n\nIch heiße Dominik, bin 23 Jahre und habe Ehrfahrung auf der Jngposition im Teamranked.\n(Leider haben sich diese schnell wieder aufgelöst und suche nun Spieler/ ein Team was sich nicht in den ersten 2 Wochen wieder auflöst)\n\nChamps: Momentane Meta  (j4, Reksai, Rengar, Nida etc.)\n\nBei Interesse einfach melden und wir können dann alles weitere besprechen.\nAnsonsten viel Erfolg in der Season.\n\nmfG Dom","replies":[]}]}