{"poster":"Imagined Reality","date":"2016-09-21T05:13:02.376+0000","title":"Lost my series and am now in Low prority","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"This is basically just a general woe-is-me bitch thread, but if anyone else has had this problem maybe they can lend me a hand. \n\nEssentially I played a few ranked games the night before this happened, and everything was fine, got into my series for gold 3, and won a game, but I had homework due the next day and got off.\n\nThen when I got on today, every time I tried to join a que, I would get through champ select, but the game wouldn't start, the loading screen would crash. This led to my team remaking, and I lost a match in my series. \n\nQue me going to a smurf account I have and testing to see if the same thing continues to happen. I does, but when I close league client and relaunch, the try to connect, I can sorta get into a game, although the loading process takes forever. \n\nAfter a couple of games of it working on my smurf, I go back to my main and what do you know, I can't connect and my series is over with me only playing one game. \n\nI was also put into low priority queing for this. Boo hoo, that sucks. \n\nI figure it might be my PC running slowly, so I've been doing some cleaning up of my pc, and scanning for malware and the works. I also saw a thread suggestion that lolreplay could be doing it, which I didn't have but I did have an old version of LSI that hadn't worked for me a couple times so I gave up launching it, so I just went ahead and uninstalled this.\n\nI've had this problem a few times before, and usually running a repair on the client will work (Roughly 40 minute process for those who aren't aware) for a week or so. But this is a recurring problem, and running a repair every time it happens isn't really optimal. Anyone know what might be causing this issue? Is it something fixable or am I just fucked because my laptop, which has run league just fine for almost 3 years, is just getting old and used?\n\nEdit:\nI have a PC Intel core 17 laptop with a nvidia geforce,  running windows 10 operating system, upgraded from windows 7. 12GB ram, DirectX 12.\n\n I noticed my laptop running a bit slower after a recent windows update, but I also ran a malware scan after the update and cleaned the pc and it was running fine, which was before the games I played the night before. This was also after I already had the problem a few times. I'd rather not go back to windows 7, but the idea isn't completely off the table, but I'd have to be 100% reassured that the problem would be fixed from this.\n\nIt's honestly kind of painful being in low-priority que due to things out of my control. I have never left a game on purpose, regardless of how bad its going or how awful my allies are acting. Two instances, back to back, on my main account, and probably a few more before this where I had the same problem, and now I'm faced with this. \n\nKinda sucks, being punished for something beyond my control.","replies":[{"poster":"Targons Blade","date":"2016-09-22T18:39:04.355+0000","up_votes":1,"down_votes":1,"body":"It certainly sucks when your client crashes for things that aren't immediately under your control. Regardless, a disconnection negatively impacts everyone in the match, regardless of intention. This is why the system treats all disconnections equally and why penalties cannot be modified or removed.\n\nThis issue can be caused by a number of different factors, but I suspect this could be a driver or hardware issue. We've consolidated common fixes for this inside our [Bugsplat & Crash guide,](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes) so I recommend starting there.\n\nLet me know if those steps caused any change.","replies":[]}]}