{"poster":"akkawakka","date":"2018-06-19T08:54:44.416+0000","title":"quanto fa schifo la nuova patch","subforum":"Campioni e gameplay","up_votes":5,"down_votes":12,"body":"ho sempre giocato con l'intento di divertirmi, ho studiato e analizzato i vari champ e gli oggetti. Con questa patch hanno tolto a lol ogni divertimento, non penso che giocherò con la stessa voglia di prima, tutti i ruoli sono stati stravolti e si vede andare in giro sono champ full ad full ap che fanno a gara a chi uccide per primo eliminando ogni aspetto strategico, caratteristica che rendeva lol assai piacevole, per farlo diventare una dannatissima battle royal. E' più divertente Fortnite allora, pessimo lavoro, deludente, che mi fa allontanare ancora di più da un gioco che amavo e che nonostante la community tossica rimaneva il mio preferito. ","replies":[{"poster":"Ringiel","date":"2018-06-19T11:33:57.194+0000","up_votes":7,"down_votes":1,"body":">per farlo diventare una dannatissima battle royal\n\nvero,infatti gli oggetti non si comprano più,ma vanno droppati sulla mappa,e soprattutto non si ressa più se si viene uccisi,oltre al fatto che la mappa 5v5 è troppo piccola per 100 player ... che schifo.","replies":[]},{"poster":"mangialavandini","date":"2018-06-19T15:02:19.196+0000","up_votes":4,"down_votes":0,"body":"> E' più divertente Fortnite allora\n\nSoluzione\n\nGioca a Fortnite","replies":[]},{"poster":"The Fluffy Lamb","date":"2018-06-19T09:36:23.038+0000","up_votes":4,"down_votes":0,"body":"Resisti fino alle prossime patch mi dico. Anche a me la riot ha tolto gran parte dei divertimenti con main jng adc","replies":[]},{"poster":"xBeater98","date":"2018-06-19T23:07:21.595+0000","up_votes":2,"down_votes":1,"body":"Prima i tank buffati,poi gli ADC...\nPrima o poi dovevano buffare i Trolls(e non mi riferisco solo a trundle)","replies":[]},{"poster":"O V T R Λ G E","date":"2018-06-19T09:48:48.306+0000","up_votes":2,"down_votes":3,"body":"Fortnite : League of Legends = Merda : Cioccolata, quindi non paragoniamoli nemmeno, grazie.\n\ncomunque si, il meta fa abbastanza schifo al momento\nche gli ADC andassero nerfati sono il primo a dirlo non ne potevo più ma non voglio che siano levati completamente dal gioco, gli AP in bot sono quanto di più cancerogeno ci possa essere","replies":[{"poster":"Diyoza","date":"2018-06-19T12:25:04.099+0000","up_votes":2,"down_votes":2,"body":"onestamente non sono d'accordo , fortnite è un bel gioco paragonarlo alla merda mi sembra riduttivo e ignorante come commento poi va bhe pensala come vuoi <_<","replies":[]}]}]}