{"poster":"wollace94","date":"2016-07-16T16:19:15.150+0000","title":"Main support cerca compagni ranked","subforum":"Reclutamento","up_votes":1,"down_votes":2,"body":"Salve a tutti evocatori, come dal titolo sono main support {{champion:53}} {{champion:25}} {{champion:48}} , cerco un gruppo che voglia giocare ranked in modo serio, visto che in soloq e difficile se non impossibile trovare giocatori decenti. attualmente sono silver 5","replies":[{"poster":"RobboxoniaGaming","date":"2016-07-17T15:56:13.934+0000","up_votes":1,"down_votes":0,"body":"Ci sono anche io, Main role Top/Mid , ma sto iniziando a mainare adc, visto che me la cavo nel farm :) se vuoi aggiungimi --->RobboxoniaGaming\nS5","replies":[]},{"poster":"Ludwigfasana","date":"2016-07-16T16:53:24.448+0000","up_votes":1,"down_votes":0,"body":"Se vuoi aggiungimi gioco principalmente mid e jungle ma posso andare in tutte le lane senza nessun problema 😄\nSolo una cosa prima di aggiungermi non voglio flame bambinetti e se si sbaglia ammettere i propri errori e ascoltare il team, questo anche da parte mia ","replies":[{"poster":"wollace94","date":"2016-07-16T17:13:55.783+0000","up_votes":1,"down_votes":0,"body":"guarda se ti trovi bene e ti piace giocare adc sarebbe meglio, no nessun flame tranquillo, io sono per il tasto \"mute\" xD e le critiche le accetto specie se costruttive. guarda io mi ricollego stasera per una partita ti aggiungo e ci mettiamo d'accordo per giocare, (magari prima una normal per vedere se ci troviamo a giocare in duo).","replies":[{"poster":"Ludwigfasana","date":"2016-07-16T20:56:33.425+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=wollace94,realm=EUW,application-id=n1bhmWE7,discussion-id=Jy2xs2iy,comment-id=00000000,timestamp=2016-07-16T17:13:55.783+0000)\n>\n> guarda se ti trovi bene e ti piace giocare adc sarebbe meglio, no nessun flame tranquillo, io sono per il tasto &quot;mute&quot; xD e le critiche le accetto specie se costruttive. guarda io mi ricollego stasera per una partita ti aggiungo e ci mettiamo d&#x27;accordo per giocare, (magari prima una normal per vedere se ci troviamo a giocare in duo).\n\nSe L'adc L hai già trovato resto mid jungle se no Adc uso lucian sivir mf e in caso anche altri. Sta sera non riesco a giocare penso domani in tarda mattinata o pomeriggio ","replies":[]},{"poster":"I Jake I","date":"2016-07-16T17:41:01.616+0000","up_votes":1,"down_votes":0,"body":"Adc eccolo qui XD","replies":[{"poster":"wollace94","date":"2016-07-16T17:53:02.968+0000","up_votes":1,"down_votes":0,"body":"perfetto :D aggiungo anche te allora","replies":[{"poster":"I Jake I","date":"2016-07-16T18:14:01.361+0000","up_votes":1,"down_votes":0,"body":"Scrivimi appena mi aggiungi :D vorrei fare 2 chiacchiere :D","replies":[]}]}]}]}]}]}