{"poster":"Nico14","date":"2017-09-30T16:12:29.337+0000","title":"Slowmotion lagg?","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Da un paio di giorni mi lagga in uno strano modo: il ping &egrave; stabile sui 50 ed gli fps anche son buoni, inotrno ai 300, ma il mondo si muove in slowmotion. Ovviamente dopo qualche secondo scatta per recuperare il tempo perso...\r\nRipeto il ping e il resto sono apposto e non varia nei teamfight e nemmeno cambiando la qualit&agrave;/grafica. \r\nSuccede anche a voi? sapete come risolvere?","replies":[{"poster":"Chroniicles","date":"2017-10-02T14:20:56.688+0000","up_votes":1,"down_votes":0,"body":"Ciao! Si tratta quasi sicuramente di packet loss, puoi verificarlo facilmente caricando i log di quella partita nell'[apposito lettore](https://support.riotgames.com/hc/it/articles/209765743-Risoluzione-dei-problemi-di-connessione-Lettore-di-registri).\nLe cause possono essere molteplici, da disturbi al wi-fi a problemi in qualche nodo lungo l'instradamento verso il server!","replies":[]},{"poster":"NIGERUNDAYO JoJo","date":"2017-10-01T11:58:18.016+0000","up_votes":1,"down_votes":0,"body":"Poco fa ho fatto una partita e si è verificato questo problemino di \"lag\"..\nHo inviato un ticket al supporto per saperne di piu, 30 minuti di partita a laggare con ping e fps fissi..","replies":[]},{"poster":"Goeg","date":"2017-09-30T21:47:53.105+0000","up_votes":1,"down_votes":0,"body":"Ciao successe anche a me. Prenditi una giornata, disinstalla e scarica di nuovo. Controlla le tempere cpu a volte sopra i 70/80gradi va\" in sicurezza\" e porta il calo di frame.","replies":[]},{"poster":"NOLIMIT Vladimir","date":"2017-09-30T19:43:00.366+0000","up_votes":1,"down_votes":0,"body":"Pacchetti persi question Mark","replies":[]},{"poster":"AthlonX860","date":"2017-09-30T16:20:11.491+0000","up_votes":1,"down_votes":0,"body":"a volte capita anche a me, però non essendo sempre o frequenti questi lag lascio stare. Controlla che le porte del firewall siano sistemate in modo da fare funzionare LoL (usa questo tool https://support.riotgames.com/hc/it/articles/224826367-Risoluzione-problemi-automatizzata-strumento-di-riparazione-Hextech se non sai come fare) e ti sconsiglio, almeno se come me purtroppo non puoi, di giocare con la connessione wi-fi, la connessione via cavo è molto più efficente per LoL","replies":[]}]}