{"poster":"aaronplusryk","date":"2017-06-11T14:14:20.258+0000","title":"Warum sind manche Seins nicht mehr zu erwerben","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":0,"body":"Hallo Beschw&ouml;rer :),\r\n\r\nKann mir vill jemand sagen wieso manche Skins nicht mehr zu erwerben sind so wie z.B. Gefrorener-Shen, Annie im Wunderland, etc?\r\nVielen dank schonmal im Voraus! :)","replies":[{"poster":"Die Todesfaust2","date":"2017-06-14T13:34:53.889+0000","up_votes":1,"down_votes":0,"body":"Habe Schwarzdorn Morgana und Blade Mistress Morgana und noch viel mehr Skins da ich alle für Jinx besitze alle für Zed (ausser Siegreich Zed) alle für Ahri und noch viel mehr habe und ja unter anderem auch Annie in Wonderland Nightblade Irelia Silverfang Akali Challenger Nidalee also man merkt schon das ich recht viele Skins habe.^^","replies":[]},{"poster":"Bayonetta38","date":"2017-06-12T10:07:39.563+0000","up_votes":1,"down_votes":1,"body":"Ich hatte irgendwann mal mitbekommen das Skins Legacy werden wenn diese unbeliebt sind um ihre Nachfrage zu steigern. Wir Menschen sind ja typisch, wollen immer des was nicht erreichbar ist oder wir nicht besitzen. Glaub deshalb wurde verbannte Morgana und sündige Nascherei Morgana Legacy Skins. Bei mir hat dieser Effekt gewirkt. Ich fand beide Skin hässlich doch nun will ich beide haben. Siegreiche Janna habe ich damals auf meinem alten Acc nie gespielt weil ich Wetterfee hatte und sie besser war von den Animationen her. Jetzt wünsche ich mir nichts mehr als meine siegreiche Janna zurück :(.................... PLS RITO","replies":[{"poster":"Sephi51","date":"2017-06-14T10:33:09.535+0000","up_votes":1,"down_votes":0,"body":"Was heißt zurück, Siegreiche Janna war die Belohnung für das erreichen von Gold in rankeds. Den Skin konntest du weder kaufen, noch verlieren wenn du ihn bereits hattest.","replies":[{"poster":"Bayonetta38","date":"2017-06-14T10:43:28.591+0000","up_votes":1,"down_votes":0,"body":"Zurück im Sinne von meinen alten Acc......\nMir wäre mein Acc eigentlich recht egal ( hatte Ätherflügel Kayle, Endboss Veigar, siegreiche Morgana, Schnitter Soraka, Friedensphönix anivia und weitere solche geilen Skins) nur ich trauere um meine siegreiche Janna und meine Richtspruch Kayle........\nIch würde meine jetzigen Skins alle für diese beiden geben (DJ Sona und Winterwunder Karma die besten die ich habe denke ich, aber sonst sollten schon um die 50 Skins drin sein).","replies":[]}]},{"poster":"INoKami","date":"2017-06-12T10:20:30.014+0000","up_votes":1,"down_votes":0,"body":"Hab tatsächlich sogar verbannte Morgana, weil ich sie irgendwie cool fand, sowohl Splash-Art als auch Ingame.\n\nMittlerweile nur noch Ingame, seitdem sie es geändert haben. Grottenhässliches Splash-Art.\nWir können gerne tauschen, wenn du andere Morgana--Skins hast^^","replies":[{"poster":"Bayonetta38","date":"2017-06-12T10:52:05.375+0000","up_votes":1,"down_votes":0,"body":"Also ich kann dir Schwarzdorn, Geisterbraut und Hexerei Morgana anbieten \n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"aaronplusryk","date":"2017-06-12T14:00:48.474+0000","up_votes":1,"down_votes":0,"body":"Schwarzdorn hätte ich auch gerne :D","replies":[{"poster":"aaronplusryk","date":"2017-06-12T14:03:50.885+0000","up_votes":1,"down_votes":0,"body":"Siegreiche Janna ist z.B. auch ein Skin den ich unglaublich gerne haben würde da er der einer der Schönsten Skins ist den League of Legends entworfen hat. :)))","replies":[{"poster":"Bayonetta38","date":"2017-06-12T14:33:49.744+0000","up_votes":1,"down_votes":0,"body":"Schwarzdorn war in meinem persönlichen Shop dabei. Finde ich ganz ok für ein 1350RP. Den Janna Skin würde ich auch gern wieder haben. Der ist wirklich hammer, nur leider niemehr erwerbbar :((.","replies":[{"poster":"aaronplusryk","date":"2017-06-13T18:04:34.978+0000","up_votes":1,"down_votes":0,"body":"ja ich finde diesen Skin auch einfach nur genial von Janna es ist echt traurig :(((\n\nUnd ja ich habe ja den Sündige Nascherei Skin von Morgana in der Tuhe mal gehabt und mir auch freigeschaltet weil ich ihn einfach mega finde hoffe du bekommst bald auch die Chance ihn in aus einer Truhe zu bekommen  :)","replies":[{"poster":"Bayonetta38","date":"2017-06-14T06:04:28.691+0000","up_votes":1,"down_votes":0,"body":"Momentan brauche ich keinen neuen Morgana Skin mehr. 3 sind genug :). Eventuell der Mondgeist Skin. Der sieht finde ich auch noch super aus.","replies":[{"poster":"aaronplusryk","date":"2017-06-14T09:48:00.927+0000","up_votes":1,"down_votes":0,"body":"ok :) dann hoffe ich das diesen bekommst :)","replies":[{"poster":"Bayonetta38","date":"2017-06-14T09:59:36.242+0000","up_votes":1,"down_votes":0,"body":"Danke hoffe ich auch :D\nAuch wenns unmöglich ist und hoffnungslos ausschaut hoffe ich ebenfalls für die das du siegreiche Janna bekommst :).","replies":[]}]}]}]}]},{"poster":"INoKami","date":"2017-06-12T15:57:49.654+0000","up_votes":1,"down_votes":0,"body":"Ich find halt schade, dass es den für mich schönsten Skin nie wieder geben wird...\n\nNämlich der alte Enchanted Galio.\n520 RP Skin, der mindestens drei Mal so badass aussah wie der 1820er.\n\nDer neue sieht zwar auch nicht schlecht aus, aber der alte... 5 wunderschöne Jahre...\n\n-Worte eines leidenschaftlichen Galio-Mains seit Season 2-","replies":[{"poster":"aaronplusryk","date":"2017-06-13T18:05:28.598+0000","up_votes":1,"down_votes":0,"body":"Das tut mir echt leid und ich kann dich da auch gut verstehen wenn man 2 Season einen Champion spielt und auf einmal wir er und seine Seins bearbeitet :(","replies":[{"poster":"Bayonetta38","date":"2017-06-14T06:03:35.154+0000","up_votes":1,"down_votes":0,"body":"Ja damals wars bei mir mit Karma so. Aber ich finde sie auch noch ok von den Fähigkeiten her nach dem Rework. Nur ihr altes Aussehen fehlt mir. \nR.I.P Fächer..","replies":[{"poster":"aaronplusryk","date":"2017-06-14T09:46:15.156+0000","up_votes":1,"down_votes":0,"body":"och man wie sie hatte früher Fächer :0","replies":[{"poster":"Bayonetta38","date":"2017-06-14T09:58:02.356+0000","up_votes":1,"down_votes":0,"body":"google mal nach der alten Karma. Die wurde von Jahren mal gereworkt. Ich finde sie jetzt nicht hässlich aber früher sah sich einfach besser aus. Da hat sie mit Fächern gekämpft und stand für Ying und Yang. Ihre Fähigkeiten waren naja, fragwürdig ob besser zu heute. Sie hatte halt 2 mal die Ulti als heute nur 1.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Sirrkas","date":"2017-06-11T21:57:07.019+0000","up_votes":1,"down_votes":0,"body":"Manche davon sind nur Legacy Skins, die kommen gelegentlich in den Shop und du kannst die Splitter dazu aus den Lootboxen erhalten. Die beiden, die du genannt hast, sollten auch in diese Kategorie fallen. Wobei du dir den Shenskin erst in einem Video anschauen solltest, ich glaube, der war nicht so besonders und wurde Legacy, weil es im Grunde nur das Niveau eines Chromas war.","replies":[{"poster":"Roxãs","date":"2017-06-12T12:32:30.331+0000","up_votes":1,"down_votes":0,"body":"So ungefähr war es tatsächlich mit dem Shen Skin.\nManche der Legacy Skins sind aber nichts destotrotz echt nice.\nZwar haben die nichts besonderes in der Regel an sich, aber schick sind dennoch manche.","replies":[{"poster":"aaronplusryk","date":"2017-06-12T13:59:07.495+0000","up_votes":1,"down_votes":0,"body":"danke euch beiden für die Information und dann hoffe das ich sie bald mal im Shop vorfinden kann :)","replies":[{"poster":"Roxãs","date":"2017-06-12T16:00:47.149+0000","up_votes":1,"down_votes":0,"body":"Wirst du auf jedenfall, 2 oder 3 mal pro Jahr kommen sie wieder.","replies":[{"poster":"aaronplusryk","date":"2017-06-13T17:58:26.854+0000","up_votes":1,"down_votes":0,"body":"super ich freu mich schon drauf :)","replies":[]}]}]}]}]},{"poster":"aaronplusryk","date":"2017-06-12T14:02:07.210+0000","up_votes":1,"down_votes":0,"body":"Ich danke euch allen aufreden fall für eure Informationen und Aussagen:)\nHoffen wir mal das beste das wir bald alle den Skin den wir haben wollen mal im Shop finden werden :)","replies":[]},{"poster":"INoKami","date":"2017-06-11T14:54:04.175+0000","up_votes":1,"down_votes":0,"body":"Gibt verschiedene Gründe: z.B. gibt es einige Skins nur als Reward für Rankeds (Alle Victorious Skins), dann gab es einige nur zu bestimmten Zeiten, quasi als Sonderangebot (Championship Riven (die alte, nicht die 2016-Variante), dann gab es Skins als Belohnung für Sachen, die man heute nicht mehr machen kann, z.B. \"Wirb einen Freund\" (-> Grauer Warwick, Mittelalter Twitch), dann wiederum gab es Skin-Codes, die man nur auf bestimmten Messen erhalten konnte (PAX Sivir/Twisted Fate...)\n\nNur um einige zu nennen. Hab bestimmt noch was vergessen, das wären so die mir bekannten Gründe.","replies":[{"poster":"aaronplusryk","date":"2017-06-11T21:52:47.236+0000","up_votes":1,"down_votes":0,"body":"vielen vielen dank :) \nfinde nur manchmal sehr traurig das mir  immer die Seins gefallen die es nicht mehr gibt :(","replies":[]}]}]}