{"poster":"Coapon","date":"2016-11-13T11:11:56.070+0000","title":"League of Legends Einstufung -Ausstieg-","subforum":"Hilfe & Support","up_votes":1,"down_votes":2,"body":"So, hiermit steige ich aus League of Legends aus.\r\nEs ist einfach traurig zu sehen, dass man 1 Division niedriger eingestuft wird als letzte Season.\r\n6/10 Gewonnen.\r\nMacht einfach keinen Spa&szlig; mehr, ich spiele in der Einstufung gegen Gold 3 Platin 5 und werde in Bronze eingestuft?\r\nSag mal seit Ihr irgendwie auf den Kopf gefallen?","replies":[{"poster":"P4INF4ME","date":"2016-11-16T16:44:00.553+0000","up_votes":1,"down_votes":0,"body":"Leute, ist es Preseason, die Spiele die ihr jetzt spielt mit eurem Flexi rank, werden darüber entscheiden wie ihr eingestuft werdet. Es ist immer so das man mindestens eine Division niedriger eingestuft wird aber das gibt mir ehrlich gesagt nur noch mehr  anspurn um höher zu kommen. Seht euch mal die ganzen Challenger an, die werden alle Platin eingestuft und ? die heulen auch nicht alle rum. Bin selbst auch Plat 5 gewesen habe 7/10 Flexi rankeds gewonnen und bin in silver 1 gelandet, shit happens aber wie gesagt, PRESEASON !{{item:2009}}","replies":[]},{"poster":"Sirrkas","date":"2016-11-13T13:44:26.005+0000","up_votes":1,"down_votes":0,"body":"Ich verstehe nicht, was daran so schlimm ist, eine Division niedriger platziert zu werden. Vor allem, da gerade mal Preseason ist.","replies":[]},{"poster":"Saufautomat","date":"2016-11-13T11:50:22.739+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nnach den Placement-Matches wird man idr. häufiger niedriger eingestuft, als der vorherige Rang war. Wenn du jetzt ein Spiel gewinnst wirst du aber merken, dass du wahrscheinlich wesentlich mehr LP bekommst, als du verlierst. Das dürfte also das Aufsteigen sehr viel einfacher machen, solltest du auch die Zahl deiner gewonnen Spiele hoch halten können.\n\nIch gehe davon aus, dass das aus dem Grund gewollt ist, dass man nicht durch \"Glück\" alle 10 Spiele gewinnt und dann in Platin V eingestuft wirst, obwohl der Spieler da offensichtlich nicht hingehört, wenn er in der letzten Season Silber war.","replies":[{"poster":"BlackSkyLane","date":"2016-11-13T12:34:02.288+0000","up_votes":1,"down_votes":0,"body":"wenn du gewinnst und nicht jedes game so gestompt wirst das dir der spaß vergeht...","replies":[{"poster":"Alustus","date":"2016-11-13T13:39:23.641+0000","up_votes":1,"down_votes":0,"body":"Wenn du jedes Spiel verlierst dann sollte man auch nicht aufsteigen, denn dann ist man zu schlecht.","replies":[]}]}]},{"poster":"Lucien91","date":"2016-11-13T11:13:02.591+0000","up_votes":1,"down_votes":0,"body":"Bei mir war das auch so ähnlich aber was solls, Riot zockt dir die Zeit deines Lebens ab ;)","replies":[{"poster":"BlackSkyLane","date":"2016-11-13T12:35:04.351+0000","up_votes":1,"down_votes":0,"body":"für mich hats sich auch erledigt mal schaun wieviele das noch so sehen den so machts kein sinn mehr man will ja mal weiterkommen und nicht dauernd von 0 wieder anfangen","replies":[]}]},{"poster":"My real name is ","date":"2016-11-13T12:34:58.347+0000","up_votes":1,"down_votes":0,"body":"Also ich war Platin 4 wurde Gold 5 eingestuft 8W 2L \nMeine frau Platin 5 wurde Gold 3  eingestuft  7W 3L\n\nwie kommt sowas zu stande???  spiele nur gegen Platin Dia  und Sie gegen Platin Gold Silber","replies":[]},{"poster":"Lirkuz","date":"2016-11-13T11:14:01.036+0000","up_votes":1,"down_votes":0,"body":"Kann mich dem Theradersteller nur Anschließen, für mich war das auch einer der letzten Spiele.","replies":[]}]}