{"poster":"Vanguard","date":"2016-11-09T03:58:33.597+0000","title":"Ya no quiero comprar mas Rp.","subforum":"Charlas Generales","up_votes":6,"down_votes":1,"body":"Si, otro post mio sobre la eliminacion de reclutamiento, asi de indignado estoy.\r\n\r\nEsta es otra refleccion: ya no quiero comprar mas rp. Yo soy una persona que pasa mucho tiempo jugando al lol, por lo tanto, trato de comprar rp cada cuanto cuando me gusta una skin, hay una buena oferta, o simplemente quiero probar mi suerte con las cajas(y cuando me sale el manco de adentro y me quiero comprar un champ con rp).\r\n\r\nHace un rato estaba pensando en ir al shopping y comprarme rp por paysafecard para comprarme a tahm kench, el icono de pentakill, y una que otra caja. Pero yo ya no tengo ganas de comprar rp...porque ya no tengo ganas de jugar, no quiero jugar SL.\r\n\r\nY pos nada, queria dejar eso claro por si un rioter de milagro llega a leer, para que quede claro que PIERDEN COMPRADORES.\r\nYo tampoco digo uuuh riot, vas a bancarrota, pero yo no soy el unico discontento con esto obviamente, hay unos cuantos post con mas de 100 ups que lo demuestran, y en los boards de Na ya empezo la revuelta tambien, asi que ta, queria que se sepa que mucha gente va a dejar de comprar rp en toda region sin reclutamiento.","replies":[{"poster":"Jaquileo","date":"2016-11-09T04:11:42.399+0000","up_votes":2,"down_votes":6,"body":"Si no quieres comprar RP, no compres, no estás obligado a comprar alguna cosa con la obligación de Riot, es estúpida la opinión que estás dando siendo que estas en todo tu derecho y libertad de comprar lo que quieras, ahora si ya no quieres jugar, debiste pensarlo un poquito antes, por algo Riot cada semana saca campeones gratis para que los pruebes y ofertas que te pueden interesar, Riot nunca va a perder compradores al ritmo que sacan Skins y es estúpido que digas que ya se están yendo hacia abajo con los ingresos cuando Riot ya se convirtió en una compañía que goza del dinero que ha ganado en su público.","replies":[{"poster":"Biiqo","date":"2016-11-09T04:20:06.072+0000","up_votes":5,"down_votes":0,"body":"A decir verdad, la cantidad de personas discontentas EN EL MUNDO dado que se ha retirado las draft pick de la mayoría de los servidores, es mucha. Generar un movimiento tal en el que todos los que se sientan discontentos con esta elección dejen de comprar RP puede llevar a una pérdida muy grande de dinero para Riot. Y no sólo por el dinero, sino que les haría ver qué es lo que en verdad las comunidades de los diferentes servidores quiere.","replies":[{"poster":"Im Zoe Sorry","date":"2016-11-09T07:17:17.704+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Biiqo,realm=LAS,application-id=v7qsfXsE,discussion-id=wVAGdM1H,comment-id=00000001,timestamp=2016-11-09T04:20:06.072+0000)\n>\n> A decir verdad, la cantidad de personas discontentas EN EL MUNDO dado que se ha retirado las draft pick de la mayoría de los servidores, es mucha. **Generar un movimiento tal en el que todos los que se sientan discontentos con esta elección dejen de comprar RP puede llevar a una pérdida muy grande de dinero para Riot.** Y no sólo por el dinero, sino que les haría ver qué es lo que en verdad las comunidades de los diferentes servidores quiere.\n\nThis.\nMe gusta cuando la gente usa el cerebro para escribir algo con sentido.","replies":[]}]},{"poster":"Vanguard","date":"2016-11-09T04:15:50.186+0000","up_votes":1,"down_votes":0,"body":"Yo no digo que nadie me obliga, digo que lo unico que riot ha conseguido con esto es una respuesta negativa, y eso va a provocar menos compra de rp. Yo no me quejo por no comprar rp ni de haber comprado, me quejo de que no me divierte sl, y que por lo tanto, riot me pierde como cliente, y a muchos mas va a perder, que es lo unico que puede ganar sacando reclutamiento, siendo que es el unico modo de normals que juega mucha gente, y no todos juegan only ranked.","replies":[{"poster":"Jaquileo","date":"2016-11-09T04:22:26.606+0000","up_votes":1,"down_votes":5,"body":"Entonces te explicaste mal, el RP se utiliza para comprar accesorios, aspectos, campeones y nada más! si quieres ganar algo en diversión que tu dinero vaya a Riot, para eso están los Torneos y competencias, cada cual con su tema, de todas formas, pienso que Riot gana más dinero cada día...","replies":[]}]},{"poster":"Omnipaws","date":"2016-11-09T05:17:36.603+0000","up_votes":1,"down_votes":1,"body":"Cuantos años tenes? Este post es para darle visibilidad al tema del Normal Draft no vengas a flashar que le llevas la contra a otros. Si no entendes el contexto no opines y trates de estupido a otros porque asi es como quedas vos.","replies":[]}]},{"poster":"xX TuOniichan Xx","date":"2016-11-09T05:07:28.249+0000","up_votes":3,"down_votes":0,"body":"La gente entra a criticar el post y ni si quiera sabe de que esta hablando...Es mas absurdo que Mexicano votando por Trump {{sticker:zombie-brand-clap}}","replies":[]},{"poster":"Omnipaws","date":"2016-11-09T05:15:33.971+0000","up_votes":1,"down_votes":0,"body":"No sos el unico. Cuando me canse de Blind Pick y vea que no hay normales... seguro termino dejando el juego.","replies":[]},{"poster":"Zaroiy","date":"2016-11-09T04:29:54.357+0000","up_votes":1,"down_votes":5,"body":"que es eso de reclutamiento? y sino quereres comprar rp es tu problema","replies":[{"poster":"Vanguard","date":"2016-11-09T04:35:00.570+0000","up_votes":2,"down_votes":0,"body":"Anda al inicio del foro y te vas a dar cuenta, tambien te recomiendo dar otra leida asi entendes bien mi punto.","replies":[]}]}]}