{"poster":"RatsGod","date":"2017-07-01T14:48:59.574+0000","title":"CLIENT BUG BUT NOT THE GAME","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Good sumonners! I have a strange bug since the new client came out that I can not fix. The problem is that when I am conecting on the client the conexion gets lost every 30 seconds. I will list the list of my problems concerning the client's error of conexion:\r\n\r\n1: I click on button to go in the waiting queue but nothing happens and I recover a message of conexion error that brings me back to the main menu\r\n&nbsp;2: when I succeeded to open the queue to enter a game the timer starts turning forever ... I have already done 22 minutes exactly. When trying to close the queue the game freeze and I have to close everything and re-open\r\n3: when I succeeded to go to the champ select (after at least 1 hour of failed attempt) the timer remains at 0 and I do not enter in the game exept if i restart the client and close all the program link to league Of legend (which remains unlocked even though I close) with task manager (otherwise the game does not restart)\r\n&nbsp;\r\n\r\nI HAVE TO SPECIFY THAT WHEN I SUCCESSFUL ENTERED IN THE GAME NO BUG OF CONEXION OR GRAPHIC SURVIVED. EVERYTHING GOES JUST RIGHT UNTIL I RETURN TO THE CLIENT. I also want to point out that I play on NA for 5-6 years and that the bug is coming with the new client and that I have never experienced any problem of conexion before. (I am in quebec, a French region of North america)\r\n\r\nTHANK YOU FOR HELPING, hoping to be able to replay one day","replies":[{"poster":"Broporo","date":"2017-07-01T21:50:42.810+0000","up_votes":1,"down_votes":0,"body":"Your network might be having a really hard time dealing with the matchmaking servers for some strange reason. Sometimes it's caused by a firewall or antivirus blocking Leagues attempt at connecting with our servers, so double those as well as the rest of your [**network settings**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) and let me know how it helps.","replies":[]}]}