{"poster":"Procul Impetus","date":"2017-08-19T14:22:44.452+0000","title":"Old honor Gift @Riot","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":">We're prepping a small parting gift for those who participated in Honor 1.0. We’ll share more details once Honor is live around the world.\n\n\nso when is this?\n\nSource: https://support.riotgames.com/hc/en-us/articles/115008474148","replies":[{"poster":"Kairoptra","date":"2017-08-19T18:12:09.996+0000","up_votes":1,"down_votes":0,"body":"Well, there are some summoner icons up on PBE that look very reminiscent of the old honor symbols. Before you get all up in a huff about it, this might only be part of the gift as they haven't announced anything about it, plus this is PBE we're talking about so it's all a work in progress.","replies":[{"poster":"PaladinNO","date":"2017-08-19T20:34:25.434+0000","up_votes":1,"down_votes":0,"body":">Well, there are some summoner icons up on PBE that look very reminiscent of the old honor symbols.\n\nWithout looking...these ones?\nhttp://leagueoflegends.wikia.com/wiki/Summoner_icon#Honor","replies":[{"poster":"Kairoptra","date":"2017-08-19T20:45:19.241+0000","up_votes":1,"down_votes":0,"body":"Yep, those would be the ones; right under Cosmonautics Day 2017 and right above Unused, just to make sure you're not talking about the ones in Unused.","replies":[{"poster":"PaladinNO","date":"2017-08-19T20:57:56.712+0000","up_votes":1,"down_votes":0,"body":"Yep, those. I've seen them listed on that page for a long time already.\n\nI just noticed the link went a bit wonky when clicking on it, though it works fine when navigating on the page with it (or just click on the link again, from the address bar, and it should display as intended).\n_Also, horrible to watch how an Intel i7 3770K quad-core is taxed with a 15 % load for an undesirable long period when trying to view that single page..._","replies":[]}]}]}]},{"poster":"Porocles","date":"2017-08-19T15:19:42.931+0000","up_votes":1,"down_votes":0,"body":"Hey there, I feel you with the anticipation but player support doesn't have additional info on this currently.  You'll want to bookmark our [News](http://na.leagueoflegends.com/en/news/) page for now as updates come in.  Hang tight for now!","replies":[]},{"poster":"Procul Impetus","date":"2017-08-19T14:23:43.780+0000","up_votes":1,"down_votes":0,"body":"Been at least month they said and still nothing","replies":[]}]}