{"poster":"Śovereign","date":"2017-02-12T22:07:12.154+0000","title":"PSA: I can't gank your lane if you push it like you're giving birth.","subforum":"Gameplay","up_votes":108,"down_votes":19,"body":"Title.\n\nEdit: Obviously there are cases you can tower dive, but most of the time (atleast in my elo), people LOVE pushing with no health and when they have the disadvantage then complain \"GANK MY LANE\".","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-12T22:39:36.507+0000","up_votes":43,"down_votes":8,"body":"a lot of junglers can gank from over walls and odd angles ...\n\nalso lane ganks is always viable... \n\nand if its a 2  vs 1 and you time your gank right with the wave crashing at the turret you can dive it and kill the enemy or force them off turret and siege turret\n\nnot all ganks have to end as kills, sometimes a wave reset, lane control, pressure, turrets, making the enemy burn summoners, or having to back which denies them gold and experience is just as good as a kill\n\nmaybe you need to realize the game isnt a bout kills. its about objectives and map control and obtaining more gold then your enemy to push your advantage to win the game. kills are just a part of what helps you achieve this \n\nmaybe you might want to reconsider what you think the game is about and how you approach to playing the game","replies":[{"poster":"Spoofghoul","date":"2017-02-13T11:36:42.186+0000","up_votes":12,"down_votes":2,"body":"http://favoritememes.com/_nw/82/30127858.jpg","replies":[]},{"poster":"Brain Errör 404","date":"2017-02-13T02:31:50.538+0000","up_votes":8,"down_votes":23,"body":"You'd think you're a higher rank than bronze ya pleb.\n\nAnd maybe people would like you more if you omitted your ending statements. :)","replies":[{"poster":"KoggyStyle","date":"2017-02-13T12:15:07.892+0000","up_votes":3,"down_votes":9,"body":"aint the worse person i looked up, but gold 4? comon your shiney bronze.","replies":[{"poster":"Brain Errör 404","date":"2017-02-13T14:59:16.057+0000","up_votes":8,"down_votes":3,"body":"Let me correct the misunderstanding here before people think I'm trying to rap on my friend. Sunshine like to come to me and give me a butt load of information and end his statements with, \"But I'm just a bronze pleb. What do I know about the game.\" Here, I'm simply saying, \"With your extensive knowledge, you'd think you would be higher than bronze\" adding pleb as an inside joke.\n\nHe also likes to say how people hate his guts for being so straightforward and not sugarcoating things. So I was simply saying if he stopped making people feel stupid, they'd also stop hating on him. All things considered, I wasn't insulting him. Also in my promos for Plat atm. Thanks~","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T19:20:12.474+0000","up_votes":5,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"KoggyStyle","date":"2017-02-14T13:45:30.335+0000","up_votes":1,"down_votes":1,"body":"grats on plat promos, misunderstandings happen without voice context. tell the dude to play ranked, thats why hes bronze, not enough games played probally.","replies":[{"poster":"Brain Errör 404","date":"2017-02-14T15:16:53.995+0000","up_votes":1,"down_votes":0,"body":"He's not interested in ranked games.","replies":[]}]}]}]},{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T19:17:26.596+0000","up_votes":2,"down_votes":0,"body":"lol now you know how it feels to be me \n\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Brain Errör 404","date":"2017-02-13T20:17:58.284+0000","up_votes":1,"down_votes":2,"body":"Not my fault it's hard to get across the exact meaning behind your words on the net. {{sticker:slayer-pantheon-popcorn}} \n\nOn that note, one more win~~~","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T21:56:09.459+0000","up_votes":1,"down_votes":0,"body":"youre gonna fail and they are all gonna laugh at you...\n\nstarting with me ... ill be laughing 1st {{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"Brain Errör 404","date":"2017-02-13T22:03:30.739+0000","up_votes":1,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/gameplay-balance/8keXIJfN-ah-sweet-sweet-bliss\n\nGet rekt. I even beat a challenger smurf for muh last game. \n\nhttps://na.op.gg/summoner/userName=rockleedaddy","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T22:07:51.889+0000","up_votes":2,"down_votes":0,"body":"well hell dude even the sun shines on a dogs ass sometimes","replies":[]}]}]}]}]}]},{"poster":"serenity7","date":"2017-02-14T00:59:15.848+0000","up_votes":1,"down_votes":0,"body":"\"naut ive seen you on the boards\"","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-14T01:01:50.264+0000","up_votes":1,"down_votes":0,"body":"i dont know what you are talkign about... \n\nlol","replies":[{"poster":"serenity7","date":"2017-02-14T01:51:35.800+0000","up_votes":1,"down_votes":0,"body":"we were just in game i said ive seen you on the boards and your friend said me too im famous. it was remake","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-14T02:09:19.431+0000","up_votes":1,"down_votes":0,"body":"lol im aware of the game\n\nim acting as if i dont ... and as if im not famous on the boards","replies":[]}]}]}]},{"poster":"MinaZer0","date":"2017-02-13T21:28:04.206+0000","up_votes":1,"down_votes":0,"body":"you sound like an analyst or a coach, since you know what you are supposed to do but can't actively implement in-game what you are preaching, well atleast successfully enough to barely be out of bronze.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T22:06:55.160+0000","up_votes":1,"down_votes":0,"body":"actually i did have an account ( dont play it anymore ) where in season 5 i was a mid lane main who made it to gold. \n\ni dont play the game seriously ... to care for rank or to try that hard... i try to play for fun and enjoyment. therefore cuz i dont have the try hard mindset as most rank players i just play around in normals\n\ni havent played rank since season 5... but if you include my 4 accounts and rank games etc i have well over 3500wins in game. \nand just cuz i sometimes dont have the mechanics and physical dexterity in my left hand to be able to play at a higher elo ... dont mean i dont understand the game and what to do... i have a very analytical mind and good at strategy and problem solving . i do understand the game on a higher elo then what i physically can mange to play at... partly due to physical limitations. i have nerve damage in my neck n back, a pinched nerve and it effects my dexterity in my left fingers, hand, arm... i was hit by a drunk driver on an interstate who was traveling at 70mph+ also due to the kind of work i do, (auto tech for a dealership ) alot of time i have real bad fatigue in my left arm due to requirements of work. \n\nand when i do play vs higher level players i typically can hold my own (usually diamonds really stomp me ) but i have played and can usually play with golds and plats no issues. that is if im focus and really try and pay attention which half the time im not, and im typically watching tv at the same time im playing league .","replies":[{"poster":"Papa Andrei","date":"2017-02-13T22:46:47.397+0000","up_votes":1,"down_votes":0,"body":"So with the physical injury in the left hand I got somewhat same deal, tendons all dead as shit due to misbegotten youth, but a game that works well if you have analytical mind and still want that high competitive feeling, try out Atlas Reactor, its basically a 4v4 pvp chess with classes.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T22:53:03.173+0000","up_votes":1,"down_votes":0,"body":"thanks might check it out","replies":[]}]},{"poster":"MinaZer0","date":"2017-02-13T22:13:18.684+0000","up_votes":1,"down_votes":0,"body":"By any chance did you get hit by a car/truck/van that the dealership you work for sells? Would be literal painful irony.\n\nSoo, TLDR you literally said what I just said, but included a paragraph, you are just saying if you had DEX in your hand you could be Dia or whatever, I just hope you sued the drunk driver.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T22:18:52.651+0000","up_votes":1,"down_votes":0,"body":"yea there was a law suit.. after medical bills, paying the car that was totaled and lawyer fees total settlement was close to 90K but due to the fact that i had no insurance at the time most of it went to pay medical bills. i only got bout 8k in pocket ... which i used to by a truck and drove it til 3 years ago... \n\nironically no it was a F150 that hit me... it was late night. 11pmish... raining he hit a concrete divider bounced off of it hit me my car spun i went across 3 lanes... ended up in far left lane facing on coming traffic and the last thing i remember a 18 wheeler tanker truck coming at me ... i hit my head hard had a bad concussion, blacked out. woke up and some how that 18 wheeler missed me. but it did and is fukin my life up. but i cant do anything bout it... just gotta keep on \n\nbut as far as game goes... i dont think even with out the nerve damage.. i could be diamond... i know there is a very very good difference in skill level once you get that high... at best maybe mid plat to be honest","replies":[{"poster":"MinaZer0","date":"2017-02-13T22:23:52.407+0000","up_votes":1,"down_votes":0,"body":"eh, at the end of the day its just a game, it reigns now but this shit won't last forever another game will come along and eventually an immersive brainscanning VR experience that you won't need dexterity in your hand for ;3\nglhf","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T22:32:45.393+0000","up_votes":1,"down_votes":0,"body":"exactly it is just a game... people take to seriously \n\npeople wanna improve and gain rank and while i find it honorable of trying to improve yourself at what it may be... people have turn ranked and their rank to effect their egos and self esteem and self worth... they turn it into a pissing contest. im too old for that shit... i simple dont care ... \n\nand rank what ever it may be ... diamond, gold, bronze its just a way for the game to place people of similar skill level together so players feel they have competitive games and where it is fun and challenging to keep people playing the game more... \n\nif bronze vs diamonds all the time cuz of no separation of skill level, both players are gonna get tired and frustrated with the game\n\nfor the bronze player they will feel defeated and no matter what they do isnt good enough and they dont understand why they cant win. and will just quit playing \n\nfor the diamond players who have no challenge and the games are super easy they have no drive or motivation to play cuz there is nothing rewarding in just pub stomping bad players ( well a few enjoy it  ) and if you didnt have a competitive game vs people of equal/similar skill level you would quickly get bored and quit playing\n\nriot dont want that .. they want every one to get hooked and play as much as possible thinking that everyone can go from bronze to be the next lcs player... and LMAO its not happening ... considering that pro players and caliber skill players are about .00001 % of the player base considering how many people play league and how many pros there are all across all servers. \n\nbut just like casinos they want ya hooked with free shit , let you win a lil to keep you playing while robbing you blind","replies":[]}]}]}]}]},{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T21:55:01.794+0000","up_votes":1,"down_votes":0,"body":"who said im in bronze... never been bronze","replies":[{"poster":"MinaZer0","date":"2017-02-13T22:01:21.566+0000","up_votes":1,"down_votes":0,"body":"and.. I never said you were bronze, reread\n\n>Barely be  _**OUT **_ of Bronze.\n\nIf you have another account or otherwise, has no affect on my statement, simply because that account is \n>Barely out of Bronze\n\nThat was a backhanded compliment, just take it already.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T22:10:24.755+0000","up_votes":1,"down_votes":0,"body":"lol i know what it was ... you are speaking to the king of satire, sarcasm and cynical-ism.\n\nbut you dont have to backhand compliment me , im not a girl you are trying to hook up with.","replies":[{"poster":"MinaZer0","date":"2017-02-13T22:15:15.131+0000","up_votes":1,"down_votes":0,"body":"it was a backhand compliment that I couldn't control, just happened, when I read it back to myself and posted it anyway. LUL","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-13T22:20:19.268+0000","up_votes":1,"down_votes":0,"body":"no worries ... \n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]}]}]},{"poster":"Velgam","date":"2017-02-13T00:59:41.890+0000","up_votes":13,"down_votes":1,"body":"Im sorry, as a top lane main I dont get your title m8, I dont push and my laner can be under my fcking turret all fcking game and my jungler never ganks, but I get fcking tower dived.","replies":[{"poster":"Crede777","date":"2017-02-13T04:27:14.813+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Velgam,realm=NA,application-id=3ErqAdtq,discussion-id=TEpKlHEB,comment-id=0004,timestamp=2017-02-13T00:59:41.890+0000)\n>\n> Im sorry, as a top lane main I dont get your title m8, I dont push and my laner can be under my fcking turret all fcking game and my jungler never ganks, but I get fcking tower dived.\n\nThe problem isn't that you're getting dove.  The problem is that your jungler isn't securing an objective or lane elsewhere on the map.  If top is getting dove, dragon should go to your team.  If your jungler is ignoring you, then he'd best be snowballing another lane.","replies":[{"poster":"Velgam","date":"2017-02-13T09:37:11.565+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Crede777,realm=NA,application-id=3ErqAdtq,discussion-id=TEpKlHEB,comment-id=00040001,timestamp=2017-02-13T04:27:14.813+0000)\n>\n> The problem isn&#x27;t that you&#x27;re getting dove.  The problem is that your jungler isn&#x27;t securing an objective or lane elsewhere on the map.  If top is getting dove, dragon should go to your team.  If your jungler is ignoring you, then he&#x27;d best be snowballing another lane.\n\nThey usually in the jungle farming or giving our enemy team 2x buffs, I ping them for help on an easy kill and this is what some of them say to me: you're a malphite/nasus/darius/pantheon/maokai/sejuani/leona(yes leona top), you dont need ganks.","replies":[]}]},{"poster":"Cowseed","date":"2017-02-13T14:07:03.187+0000","up_votes":2,"down_votes":0,"body":"https://ci.memecdn.com/3768571.gif","replies":[{"poster":"EbonyBladeJ88","date":"2017-02-14T02:41:10.844+0000","up_votes":1,"down_votes":0,"body":"Beat me to it by 13 hours. Darn.","replies":[]}]}]},{"poster":"SaltyKracka","date":"2017-02-12T22:16:37.460+0000","up_votes":13,"down_votes":4,"body":"It's called a tower dive, bro.","replies":[{"poster":"Brain Errör 404","date":"2017-02-13T02:32:13.049+0000","up_votes":12,"down_votes":2,"body":"Not all comps are good for dives.","replies":[]},{"poster":"Escheton","date":"2017-02-13T05:54:47.963+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=SaltyKracka,realm=NA,application-id=3ErqAdtq,discussion-id=TEpKlHEB,comment-id=0001,timestamp=2017-02-12T22:16:37.460+0000)\n>\n> It&#x27;s called a tower dive, bro.\n\nTower dives tend to not be feasable until one gets at least one item. Not to mention it being risky and having no information on reaction times of allies yet making it extra so.","replies":[]},{"poster":"Spaceman5pff","date":"2017-02-13T01:53:53.769+0000","up_votes":6,"down_votes":2,"body":"I honest to god prefer dives to normal ganks if we have even a half decent combo of damage and cc","replies":[]}]},{"poster":"PaladinNO","date":"2017-02-13T05:51:15.485+0000","up_votes":9,"down_votes":0,"body":"And when the jungler do decides to gank, please don't do it when there's the same amount of enemy minions pushing as though there's a new iPhone release.\n\nhttp://newsouthnews.com/wp-content/uploads/2015/09/crazyapplepeople.jpg\n\nLet me waveclear a bit first, and _then_ you can come.\n\n{{champion:117}}  https://8.smash.com/u/2014/12/Rambo-Machinegun-69265.gif","replies":[]},{"poster":"Golden Tager X","date":"2017-02-13T03:02:15.244+0000","up_votes":9,"down_votes":0,"body":"Me when I see all these people saying tower dive\n\n{{champion:12}} {{champion:1}} {{champion:34}} {{champion:268}} {{champion:432}} {{champion:245}} {{champion:3}} {{champion:74}} {{champion:40}} {{champion:59}} {{champion:85}} {{champion:127}} {{champion:89}} {{champion:24}} {{champion:117}} {{champion:90}} {{champion:54}} {{champion:57}} {{champion:82}} {{champion:25}} {{champion:111}} {{champion:14}} {{champion:68}} {{champion:113}} {{champion:61}} {{champion:223}} {{champion:44}} {{champion:412}} {{champion:23}} {{champion:45}} {{champion:8}} {{champion:106}} {{champion:19}} {{champion:62}} {{champion:157}} {{champion:154}}","replies":[{"poster":"Glory ln Death","date":"2017-02-13T16:53:55.071+0000","up_votes":3,"down_votes":0,"body":"Never tower dive a Sion unless you have a major numbers or health advantage. Preferably both.","replies":[]}]},{"poster":"I am Pacman","date":"2017-02-13T02:01:35.452+0000","up_votes":6,"down_votes":0,"body":"Yes you can its called a lane gank. You walk into the bushes while the minions are at the tower and them murder the laner if they step out of it or just dive them if you have the skill and tankyness.\n\nAlso ganks don't have to be about kills, simply blowing flashes or forcing recalls at bad times can severely hamper a lane.  You can lose lane very easily from the jungler ganking and forcing you to lose out on a couple waves.","replies":[]},{"poster":"ValyrianBlade","date":"2017-02-13T03:05:55.964+0000","up_votes":9,"down_votes":4,"body":"> [{quoted}](name=Śovereign,realm=NA,application-id=3ErqAdtq,discussion-id=TEpKlHEB,comment-id=,timestamp=2017-02-12T22:07:12.154+0000)\n>\n> Title.\n\nTower Dive. \n\n\"You're too bad to freeze I can't trust you to follow up on a risky play like a tower dive\"\nFYI many champions are significantly better at poking an enemy under their tower (while their concentrating on difficult last-hitting as the tower pumps out high damage) but not so good at poking an enemy in an even lane (skillshots are blocked by minions, etc...). \nFurther, a successful tower dive denies MUCH more than a successful gank on a frozen lane. I'm pushed and I get ganked and die? I've already cleared the lane so I miss no XP or CS by the time I get back (especially top with TP). I'm pushed with 10 minions under your turret and get a gank to tower dive and kill you? You just got denied 1.5 waves (or 2.5 since the next wave will easily crash as well if you don't have TP), and depending on the jungler or prior pressure maybe the turret. \n\nTower dives are easily one of the best ways to create a huge lead in this game. Why do you think pro players respect them so much that they give up turrets out of fear for a tower dive when they don't have vision or allies nearby?","replies":[{"poster":"NvestmentPlanker","date":"2017-02-13T05:21:33.945+0000","up_votes":2,"down_votes":0,"body":"this. this should not be downvoted at all. higher elo players respect the tower dive and are higher elo because they take the risks. always choosing to play safe will make you stagnate/plateau","replies":[]}]},{"poster":"BeatzBoyFTW","date":"2017-02-13T11:39:34.235+0000","up_votes":4,"down_votes":0,"body":"> PSA: I can't gank your lane if you push it like you're giving birth.\n\nHow did u know I'm a mom? {{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"Ambient Snow","date":"2017-02-13T16:56:56.777+0000","up_votes":3,"down_votes":0,"body":"I don't mind a tower dive if i'm a tank jungler, But man.. half those times its I go in take the tower and my laner sits back killing minions then goes in after I die. \n\nbut what I hate more then lane pushers  who demand ganks\n\nAre people who feed their lane 4 kills then Demand Ganks\n\nits like -.- i'm lvl 4.. and you already fed your lane 2-4 kills.. and you want me to gank them ?\n\nyup cause at lvl 5 I soo want to try and gank a varus with BF sword and last whisper.","replies":[]},{"poster":"Glory ln Death","date":"2017-02-13T16:48:35.209+0000","up_votes":1,"down_votes":0,"body":"But... but aren't towers made of wet saltines? What's stopping you from ganking?","replies":[{"poster":"TequilaZombie","date":"2017-02-13T16:57:04.173+0000","up_votes":2,"down_votes":0,"body":"How many variations of Glory in Death are living  in this forum??","replies":[]}]},{"poster":"Attticus Finch","date":"2017-02-12T22:41:35.606+0000","up_votes":5,"down_votes":4,"body":"\"DUDE JUST TOWER DIVE Xd Xd\n\nDUDE IM TOO BAD TO FREEZE THE WAVE BUT YOU CAN TRUST ME TO FOLLOW UP WHEN  YOU DO THE MOST UNSAFE TYPE OF GANK IN THE GAME Xd Xd\"\n\nWew.","replies":[]}]}