{"poster":"MustardTigerMK","date":"2019-12-20T06:40:24.740+0000","title":"WOW I CAN NOT BELIEVE THIS SYSTEM?","subforum":"Player Behavior","up_votes":1,"down_votes":18,"body":"Game 1\r\nIn-Game\r\nMustardTigerMK: thanks for help guys gw\r\nMustardTigerMK: ill report you for standing there while team is in trouble\r\nMustardTigerMK: i faught 1v1 and lost man i tried to get away\r\nMustardTigerMK: pyke bro\r\nMustardTigerMK: hit something dude\r\nMustardTigerMK: fck\r\nMustardTigerMK: lol\r\nMustardTigerMK: dont take this the wrong way man\r\nMustardTigerMK: but youve hit nothing and i need more\r\nMustardTigerMK: stfu and play you idiot\r\nMustardTigerMK: im not even reading your crying\r\nMustardTigerMK: wow instantly reported\r\nMustardTigerMK: enjoy the ban\r\nMustardTigerMK: you should read the rules my dude\r\nMustardTigerMK: thats like a cardinal sin its instant ban\r\nMustardTigerMK: you realize that right\r\nMustardTigerMK: you honestly ping me after i saved you haha\r\nMustardTigerMK: youre funny man\r\nMustardTigerMK: wow\r\nMustardTigerMK: youre very toxic my dude\r\nMustardTigerMK: i dont even feel bad now for the insta ban\r\nMustardTigerMK: :(\r\nMustardTigerMK: pyke is taking my farm now fyi\r\nMustardTigerMK: hes told me to kill myself and is taking my farm fyi\r\nMustardTigerMK: dont listen to troll hes told me to kill myself now steals farm\r\nMustardTigerMK: also was refusing to help me in lane\r\nMustardTigerMK: ill be reporting him\r\nMustardTigerMK: tell them what you said pyke and ask them what they think it means\r\nMustardTigerMK: irl\r\nMustardTigerMK: lol\r\nMustardTigerMK: you should read the rules pyke even implied and funny word play doesnt save you my dude\r\nMustardTigerMK: pyke told me to log off irl thats very serious i dont think he realizes\r\nMustardTigerMK: whats that mean to you guys?\r\nMustardTigerMK: okay sorry basus\r\nMustardTigerMK: nasus\r\nMustardTigerMK: you realize riot has a chat log right lol\r\nMustardTigerMK: i didnt ask anyone to report you\r\nMustardTigerMK: i told them what you did and thresh voluinteered a report\r\nMustardTigerMK: because he has also seen your actions\r\nMustardTigerMK: lol\r\nMustardTigerMK: sorry olaf\r\nMustardTigerMK: pyke its not being a baby or policing man. its game policy.\r\nMustardTigerMK: ive known a lot of people who have killed themselves\r\nMustardTigerMK: youre playing a kids game and telling someone to do that\r\nMustardTigerMK: im sorry im typing and ruining the game but this guy needs to know that it is serious\r\nMustardTigerMK: you should stop typing and ill stop responding\r\nMustardTigerMK: ill give you one chance to explain what log off irl\r\nMustardTigerMK: means to you pyke\r\nMustardTigerMK: and if the ansxwer is good i wont report\r\nMustardTigerMK: why add irl\r\nMustardTigerMK: its in the chat log donald trump but just keep deny i guess if you cant even admitt your actions\r\nMustardTigerMK: i feel bad for you man\r\nMustardTigerMK: ur muted maybe we can win gl hf everyone\r\nMustardTigerMK: pyke wouldnt help olaf\r\nMustardTigerMK: i watched pyke he stood there took 5 seconds to hook thresh\r\nMustardTigerMK: then used his skills to run away\r\nMustardTigerMK: he wanted to ks but you suddenly killed him\r\nMustardTigerMK: gg\r\nMustardTigerMK: youre reporting me for being bullied\r\nMustardTigerMK: thats nice of you dude lol\r\nMustardTigerMK: actually i only ever typed when dead\r\nGame 2\r\nIn-Game\r\nMustardTigerMK: nah he fine\r\nMustardTigerMK: gotta go after raka dude\r\nMustardTigerMK: you new?\r\nMustardTigerMK: lol\r\nMustardTigerMK: im not trolling\r\nMustardTigerMK: im very far behind\r\nMustardTigerMK: and if you are wondering yes shaco has been useless\r\nMustardTigerMK: but who cares any game is winnable\r\nMustardTigerMK: you want to pick out one person from a 5 person team\r\nMustardTigerMK: down 0 to 17\r\nMustardTigerMK: really dude\r\nMustardTigerMK: because im having a blast being owned 0 to 17\r\nMustardTigerMK: that i was just hoping\r\nMustardTigerMK: someone would be toxic about it\r\nMustardTigerMK: thanks man\r\n\r\n\r\n\r\n\r\nThose are the chat logs shown for me getting a chat restriction (step 1 of about 4 before being banned from the game)\r\n\r\nThe first game yes I will admit I went overboard for sure but the second chat log?\r\n\r\nBTW in the first chat log someone told me to \"log off irl\" so I got super upset, I added him and he says he didnt even get punished....I thought they took that more seriously then chatting too much but anyways.... I guess bots can't pick up on remarks like that.\r\n\r\nOn to the second chat log, \r\n\r\nSomeone was making fun of my support and I defending the person saying nah he fine\r\nThis said support was pinging and verbally telling me it was my fault meanwhile soraka was healing the adc all I said was you gotta hit the raka, then I asked if he was new? lol he was pinging wondering why adc wouldn't die, raka healed thru our dmg and we were behind. Then I got picked on for the whole game while the team went 0-17 like I said in the chat...","replies":[{"poster":"NF Remilia","date":"2019-12-20T07:29:42.377+0000","up_votes":8,"down_votes":0,"body":"You was toxic and got punished , why you are surprised?","replies":[{"poster":"Nightsky Pirate","date":"2019-12-20T07:38:37.286+0000","up_votes":8,"down_votes":0,"body":"I'm surprised OP doesn't see how obvious that is.","replies":[{"poster":"Cind3rkick","date":"2019-12-20T07:44:06.842+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nightsky Pirate,realm=NA,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=00000000,timestamp=2019-12-20T07:38:37.286+0000)\n>\n> I'm surprised OP doesn't see how obvious that is.\n\nPeople always love to play the victim, chances are OP does know but blames the system for not letting him off.","replies":[{"poster":"MustardTigerMK","date":"2019-12-20T08:07:06.802+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Cind3rkick,realm=EUW,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=000000000000,timestamp=2019-12-20T07:44:06.842+0000)\n>\n> People always love to play the victim, chances are OP does know but blames the system for not letting him off.\n\nAt no point did I say I should not have been punished my man. \n\nShow me where I said I wanted to be let off of being punished?\n\nYes I can see parts in the chat log that would lead to a punishment, the circumstances of it surprised me a little bit that someone can imply that I end my life and isn't punished but I am...\n\nBoth people are missing the point here I believe","replies":[{"poster":"Julevi","date":"2019-12-20T08:31:06.609+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MustardTigerMK,realm=NA,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=0000000000000000,timestamp=2019-12-20T08:07:06.802+0000)\n>[...] that someone can imply that I end my life and isn't punished but I am...\n\nHuman-beings will always be more creative, finding endless ways to circumvent the system. If they tell you something problematic and the system can't pick it up please submit a support-ticket so they can manually punish them. \n\nBut never forget: even if they break the rules: that doesn't give you the right to do the same.","replies":[{"poster":"MustardTigerMK","date":"2019-12-20T08:42:43.590+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Julevi,realm=EUW,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=00000000000000000000,timestamp=2019-12-20T08:31:06.609+0000)\n>\n> Human-beings will always be more creative, finding endless ways to circumvent the system. If they tell you something problematic and the system can't pick it up please submit a support-ticket so they can manually punish them. \n> \n> But never forget: even if they break the rules: that doesn't give you the right to do the same.\n\nyeah i know the generic answers already thanks man\n\nI guess I was hoping someone would see the lack of morality in punishing someone who was arguing against someone telling me to kill myself. I get  it that I ended up saying punishable remarks... I get it ... my bad words broke the rules. \n\nI'll be banned in a week watch lol....yay!","replies":[{"poster":"Nightsky Pirate","date":"2019-12-20T09:28:39.064+0000","up_votes":1,"down_votes":0,"body":"Again. I'm surprised you don't see how obvious it is. You're not seeing it. Perhaps you can't, which isn't your fault, and thusly should be removed from the environment anyway, but if you're willfully not seeing it... well, that's bad behavior.","replies":[{"poster":"MustardTigerMK","date":"2019-12-22T00:14:53.176+0000","up_votes":1,"down_votes":0,"body":"I can clearly see why the auto mated system triggered a punishment.\n\nYou're super intelligent, we get it. Thanks for your insight on how you can't believe I don't see it, great addition to the thread.\n\nSorry what should be removed from the environment? Someone who isn't able to understand a situation they're in? That's really nice to say. \n\nIf I'm willfully not seeing it means I know it's bad and I refuse to acknowledge it. \n\nI think what you mean is If I'm willfully not seeing it then my opinions should be removed?\nBut if I am unable to see it for reasons that are not my fault then in that case you want to let me know that it is bad behavior and I should listen to you?\n\n\nI dunno...\n\nI tried.","replies":[{"poster":"Nightsky Pirate","date":"2019-12-23T01:12:21.980+0000","up_votes":1,"down_votes":0,"body":"First, yeah, it's not nice to exclude people, but people who *cannot* interact with others without being toxic should be excluded. I'll fly that banner real high. This is coming from someone who doesn't like bans in the first place.\n\nNow about the rest. Sorry, let me explain. My input is:\n\nI thought anyone... Anyone who doesn't have social problems... could see that what you said was toxic. Yet here you are, making a reasonably worded post, which implies you don't have the degree of social problems I would expect to prevent someone from seeing how that was toxic.\n\nTo you, this means, HEY, THIS IS REALLY OBVIOUSLY TOXIC, YOU FIGURE IT OUT. Kinda like telling a kid they did their math wrong and the answer is right in front of them.\n\nThe part about willfully not seeing it, yeah, you said it. You know it's bad, and you're not figuring it out yourself why. And if you can't figure it out, I think you belong to that aforementioned group of people that should be excluded.\n\nFigure it out and have a nice day. By that, I mean, if you can cease the toxicity, great, and if not, byeeeeeee.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Zyniya","date":"2019-12-20T07:36:34.645+0000","up_votes":6,"down_votes":0,"body":"MustardTigerMK: stfu and play you idiot\nMustardTigerMK: im not even reading your crying\nMustardTigerMK: wow instantly reported\nMustardTigerMK: enjoy the ban\n\nThat's prob good enough to get you the 10 game chat ban right there.","replies":[{"poster":"NF Remilia","date":"2019-12-20T07:43:45.754+0000","up_votes":3,"down_votes":0,"body":"MustardTigerMK: enjoy the ban\n\nThe irony lol","replies":[]}]},{"poster":"MustardTigerMK","date":"2019-12-20T09:07:12.412+0000","up_votes":1,"down_votes":3,"body":"I know you can pick out areas in the chat where I should be punished\n\nThe rules are too strict. I'm being abused and then also being punished. If talking too much is punishable then why not limit everyone to 5 chat ? aka restrict everyone's chat.\n\nWe are not allowed to say a lot so why not just restrict it.....helps the game as a whole in the long run.","replies":[{"poster":"Prandine","date":"2019-12-20T09:25:25.224+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=MustardTigerMK,realm=NA,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=0003,timestamp=2019-12-20T09:07:12.412+0000)\n>\n> I know you can pick out areas in the chat where I should be punished\n> \n> The rules are too strict. I'm being abused and then also being punished. If talking too much is punishable then why not limit everyone to 5 chat ? aka restrict everyone's chat.\n> \n> We are not allowed to say a lot so why not just restrict it.....helps the game as a whole in the long run.\n\nFirst off Reform Cards only show 1-3 recent games as example of the kind of problematic behavior that got you punished, and it does not mean they were the only ones that were problematic.\n\nSecond off \"They started it/were worse\" doesn't work here as everyone is responsible for their own behavior. \n\nThird off talking too much by itself is not the issue (unless you're just spamming but that's beside the point), it's the content behind it that is. You could type 10 lines or 100 lines, but if all or the majority of your chat is dedicated to harassing or flaming someone, egging them on or just in general being a royal pain/nuisance then you're gonna get punished for that.\n\nHeck you even admit that you went overboard in the first game. While the second game is relatively tame, the first game is definitely the most problematic (again by your own admission), as you spend the vast majority of it egging people on, being passive-aggressive, calling for reports (only one is needed) and just in general being a royal pain and an unpleasant nuisance to deal with. Anything positive or helpful just gets lost in the sea of negativity.\n\nIn the future if someone is acting up in chat then just mute them, and if they're acting up by trolling or whatever then just do your best to play around them until the game is over. Regardless don't spend the whole game complaining or harassing them about it or trying to bait them into acting up more as trolls love that (the negative reactions I mean). If you ignore them then chances are they'll shape up on their own since no ones responding to their antics (no audience=no motive) and you don't risk falling with them.","replies":[{"poster":"MustardTigerMK","date":"2019-12-20T09:35:59.710+0000","up_votes":1,"down_votes":3,"body":"What was problematic about chat log #2?\n\nAnd I don't believe I have ever said I should not have been punished..\n\nI only believe the system is too strict and misses the point a lot.","replies":[{"poster":"Prandine","date":"2019-12-21T04:18:51.072+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MustardTigerMK,realm=NA,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=000300010000,timestamp=2019-12-20T09:35:59.710+0000)\n>\n> What was problematic about chat log #2?\n\nThe ones that stand out to me are these: \n\n>MustardTigerMK: and if you are wondering yes shaco has been useless\nMustardTigerMK: but who cares any game is winnable\nMustardTigerMK: you want to pick out one person from a 5 person team\nMustardTigerMK: down 0 to 17\nMustardTigerMK: really dude\nMustardTigerMK: because im having a blast being owned 0 to 17\nMustardTigerMK: that i was just hoping\nMustardTigerMK: someone would be toxic about it\n\nThese feel like passive-aggressive remarks and jabs at your teammates. That said compared to game 1 these are minor and tame.\n \n> And I don't believe I have ever said I should not have been punished..\n> \n> I only believe the system is too strict and misses the point a lot.\n\nYou've never actually specified why you feel it's too strict or misses the point allot though.","replies":[{"poster":"MustardTigerMK","date":"2019-12-22T00:08:17.668+0000","up_votes":1,"down_votes":1,"body":"I get it that if you go off the rules and then read those two chat logs that you would say pretty minor but punish it...just a chat restriction\n\nI lost my honor as well which I had just built up to nearly level 3....\n\nThe idea of seeing a chat log and determining the manor of how I'm speaking without seeing the other people's chat and providing context is absolute insanity.\n\nI don't think you should get a punishment based off a feeling of how the tone of my chat is. There should be tell tale signs like\n\nEat sht you piece of sht garbage player.\n\nI agreed with someone saying shaco was useless in lane as a support....\nPeople were arguing and I said who cares game is winnable \n\nThen I responded to someone calling me out for being shtty and I was just kind of blown away that on a 5 person team losing 0-17 sub 20 minutes game and you pick one person out. I could have a mediocre game and make it last 25+ mins essentially 1v5....so sure I was playing like doo doo but clearly everyone was.\n\n\n\n\nI get it that according to the rules I was in violation, believe me I'm not arguing that. \n\nHowever \n\nSomeone told me to kill myself online...I get it that I can handle this but this guy shouldn't be going around doing that. It's one thing to negatively comment on someone while they negatively on comment you but I think it's another to say something like that, be racist or homophobic whatever. \n\nI understand the he started it bullshit isn't a valid defense however he didn't start an argument, he started me trying to teach him the weight of what he had said. \n\nPeople get clearly bullied online and this system allows people to be bullied, get reported and then get punished. Chat log 2 is the best example they could find of me being toxic because I'm rarely a problem.... This was a one time thing that was set off by someone telling me to kill myself. \n\nAnother thing about chat log 2 is the guy in the freaking game being toxic that I'm responding to sarcastically kind of making fun of the fact he was blaming me in a blow out loss... HE IS THE GUY THAT REPORTED ME?!\n\nOmg I feel like I could vent for an hour on how freaking crazy it is that I could talk with you, argue with you and then report you for something that I fueled/started and punishments get handed out? \n\nAnyways I think it's pretty clear that \n\nA) On paper I broke the rules and deserve beheading\n\nB) In our heart of hearts we all know that those chat logs are thin scrapings of an otherwise squeaky clean chat log that kind of show how out of control strict the system is.\n\n\n1300 games and those are my top 3 worst chat logs....ban coming up.. \n\n\nLots of pings in those two chat logs as well that if were considered would add to how trollish these people were\n\nI feel like someone who gets life for minor theft and I'm sharing a jail cell with a murderer.","replies":[{"poster":"Prandine","date":"2019-12-22T06:09:23.520+0000","up_votes":0,"down_votes":0,"body":"> [{quoted}](name=MustardTigerMK,realm=NA,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=00030001000000000000,timestamp=2019-12-22T00:08:17.668+0000)\n>\n> I get it that if you go off the rules and then read those two chat logs that you would say pretty minor but punish it...just a chat restriction\n> \n> I lost my honor as well which I had just built up to nearly level 3....\n> \n> The idea of seeing a chat log and determining the manor of how I'm speaking without seeing the other people's chat and providing context is absolute insanity.\n\nThe community as a whole and Riot disagree, as 2+ people acting up and causing problems are all at fault for creating a negative environment in the game. Back in the Tribunal when players could vote on which cases to punish/pardon and when the full ally and enemy chat was present context was rarely taken into account as it didn't matter.\n\n> I don't think you should get a punishment based off a feeling of how the tone of my chat is. There should be tell tale signs like\n> \n> Eat sht you piece of sht garbage player.\n\nExcept most cases aren't like this. Most are like your game 1 where they're being overly negative, argumentative, disruptive and unpleasant. The chat is not being used for teamwork, strategy or tactics, it's being used to argue with and harass others.\n \n> I agreed with someone saying shaco was useless in lane as a support....\n> People were arguing and I said who cares game is winnable \n> \n> Then I responded to someone calling me out for being shtty and I was just kind of blown away that on a 5 person team losing 0-17 sub 20 minutes game and you pick one person out. I could have a mediocre game and make it last 25+ mins essentially 1v5....so sure I was playing like doo doo but clearly everyone was.\n\nIf that was the only problematic game you had then I could see a world where you didn't receive a punishment as honestly it's pretty borderline. It's only when it's looked at alongside game 1 that you can see why it might have contributed to your punishment.\n\n> I get it that according to the rules I was in violation, believe me I'm not arguing that. \n \n> However \n> \n> Someone told me to kill myself online...I get it that I can handle this but this guy shouldn't be going around doing that. It's one thing to negatively comment on someone while they negatively on comment you but I think it's another to say something like that, be racist or homophobic whatever. \n\nThere are many examples in the Player Behavior boards alone of people getting straight-up banned for telling others to kill themselves or generally saying things they should know they shouldn't be saying.\n \n> I understand the he started it bullshit isn't a valid defense however he didn't start an argument, he started me trying to teach him the weight of what he had said. \n \n> People get clearly bullied online and this system allows people to be bullied, get reported and then get punished. Chat log 2 is the best example they could find of me being toxic because I'm rarely a problem.... This was a one time thing that was set off by someone telling me to kill myself. \n\nPeople only get punished for chat if they're consistently causing problems in it across multiple games. The IFS may have built-in leniency for the occasional off game or two but it's not indefinite. Consistency X Severity is how the IFS handles handing out punishments, meaning that even offenses that are pretty small and minor can add up over time.\n\nThink of it like a cop pulling you over for speeding and then giving you a speeding ticket after finding out you've been warned before not to, or how they arrest you after finding out you've had multiple speeding violations recently.\n\nIf people would just learn to put their egos and pride aside and actually mute the people acting up in chat rather than argue with them and give them the negative reaction they want then there'd likely be less complaints about it.\n \n> Another thing about chat log 2 is the guy in the freaking game being toxic that I'm responding to sarcastically kind of making fun of the fact he was blaming me in a blow out loss... HE IS THE GUY THAT REPORTED ME?!\n\nHow do you know that he was the one who reported you? In case you forgot you had 3 other people on the team and for all you know any of them could have reported you while he didn't.\n \n> Omg I feel like I could vent for an hour on how freaking crazy it is that I could talk with you, argue with you and then report you for something that I fueled/started and punishments get handed out? \n> \n> Anyways I think it's pretty clear that \n> \n> A) On paper I broke the rules and deserve beheading\n\nNo you don't, so stop exaggerating. as it's not doing you any favors here.\n \n> B) In our heart of hearts we all know that those chat logs are thin scrapings of an otherwise squeaky clean chat log that kind of show how out of control strict the system is.\n\nYou know you say you don't have a problem with the punishment, yet you also argue that the IFS is overly strict when it's really not. Not only that but you only seem to say it's strict solely because of game 2. I'll bet you wouldn't be saying that if it was just game 1, which you already admit you deserved to be punished for. Game 2 may be minor but you can't just tunnel vision on that while ignoring game 1.\n \n> 1300 games and those are my top 3 worst chat logs....ban coming up.. \n\nAgain, Reform Cards only show 1-3 recent games as example of the kind of problematic behavior that got you punished, and it does not mean they were the only ones that were problematic. Also, this wasn't a ban-just a chat restriction, meaning you can still play the game.\n \n> Lots of pings in those two chat logs as well that if were considered would add to how trollish these people were\n\nIf I'm not mistaken (and please someone correct me if I'm wrong here) excessive ping spamming can cause a ban to happen, but it's extremely rare.\n \n> I feel like someone who gets life for minor theft and I'm sharing a jail cell with a murderer.\n\nNo one besides you is saying that you deserve beheading or any such exaggerated nonsense.\n\nAt the end of the day it's just a chat restriction-a slap on the wrist/ticket meant to have you take a look at how your behaving and look at adjusting it so you don't get in trouble again in the future-that's all.","replies":[]}]}]}]}]},{"poster":"Julevi","date":"2019-12-20T09:14:56.744+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MustardTigerMK,realm=NA,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=0003,timestamp=2019-12-20T09:07:12.412+0000)\n>\n>  If** talking too much** is punishable then why not limit everyone to 5 chat ? aka restrict everyone's chat.\n\nTalking too much will only lead to a punishment if it escalates into spam. People usually get punished for the way how they communicate - what they are saying, how they are wording it and so on.","replies":[]}]},{"poster":"Tele II","date":"2019-12-20T23:46:47.669+0000","up_votes":2,"down_votes":0,"body":"You should read the rules man. There are no stipulations that ever permit you to insult other players. Sucks you didnt know that, but thats how it is.","replies":[]},{"poster":"MustardTigerMK","date":"2019-12-20T08:00:13.502+0000","up_votes":1,"down_votes":6,"body":"Wasn't asking to be let off anything my dude. The second chat log is pure BS as a reason to punish someone was my point, they need two games and I think it's a stretch to just make up something to include in your punishment. \n\nHonestly I've seen a lot of suicide and have even considered it myself so to see someone say something like log off irl then go on to deny saying it or acknowledge any wrong doing. I added this guy he hasn't gotten a punishment. How is this system fair at all? Because I said stfu to him typing 10 things in a row that I couldn't even read because I was trying to catch up with farm. He tells me to kill myself and I say wow instantly reported and you think that's punishable? lol You're examples are worse than what Riot gave as a chat log. \n\nIf anything the start of chat log game 1 was where I should be punished... \n\nMustardTigerMK: thanks for help guys gw\nMustardTigerMK: ill report you for standing there while team is in trouble\nMustardTigerMK: i faught 1v1 and lost man i tried to get away\nMustardTigerMK: pyke bro\nMustardTigerMK: hit something dude\nMustardTigerMK: fck\nMustardTigerMK: lol\n\nAnything beyond that was reaction to someone telling me to kill myself. \n\nVictim blaming is real nice by the way there buds.... real 2020 of you my dude. \n\nI didn't even say I shouldn't be punished I just honestly am surprised that chat log 2 was used as an example and that it's okay to tell someone to log off irl then pretend to not have said it after being told how serious it was. The system rewarded someone saying something that should be an instant ban by punishing the person trying to let the person know that something like that shouldn't be said.\n\nThe ban system is broken because of this. The system needs to start looking at cause instead of the effect.","replies":[{"poster":"Julevi","date":"2019-12-20T08:25:22.795+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MustardTigerMK,realm=NA,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=0002,timestamp=2019-12-20T08:00:13.502+0000)The second chat log is pure BS as a reason to punish someone was my point, they need two games\n\nAs far as I know they can punish you based on one game alone. \n \n\n>I added this guy he hasn't gotten a punishment.\n\nThen feel free to submit a support-ticket. \n\n> you think that's punishable?\n\nThat wasn't the only punishable thing in your first chatlog.\n\n\n> If anything the start of chat log game 1 was where I should be punished... \n\nThe card always presents the full chatlog - you can request more insight at support and they will show you which lines can be problematic.\n\n\nEdit: Let's assume the system can detect \"Log off IRL\", here are some examples how easily people can adjust a few things. That makes the whole thing more difficult ...\n\n>* L0GG 0FF IRL\n* L \n    O \n   G\nG  \n\n >  O \n   F\n   F\n\n >  I  \n   R\n    L \n\n> * LRI FFO GGOL\n> * L♥GG ♥FF IRL","replies":[{"poster":"MustardTigerMK","date":"2019-12-20T08:46:07.943+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Julevi","date":"2019-12-20T08:53:09.961+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MustardTigerMK,realm=NA,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=000200000000,timestamp=2019-12-20T08:46:07.943+0000)\n>\n> Wow you're a real POS dude lol...nice one man, you're a big boy eh....real smart... I see what you're doing there, I know nobody else will but that's a dick move buddy. You must love your keyboard.\n\n... what am I doing here? We have nearly weekly the discussion why some things don't get picked up, although these should be instant-ban words. Homophobic slurs for example. And usually people write it in a way the system can't detect it, like the examples I gave you. \n\nThe writing style of the second example was even based on the story of one dude here on boards who claimed that he got banned for the n-word - he told us that he only wrote the letter n in the chat and other teammates made the racial slur out of it. (I hope I remember the story right.)","replies":[{"poster":"MustardTigerMK","date":"2019-12-20T09:05:16.598+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Julevi,realm=EUW,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=0002000000000000,timestamp=2019-12-20T08:53:09.961+0000)\n>\n> ... what am I doing here? We have nearly weekly the discussion why some things don't get picked up, although these should be instant-ban words. Homophobic slurs for example. And usually people write it in a way the system can't detect it, like the examples I gave you. \n> \n> The writing style of the second example was even based on the story of one dude here on boards who claimed that he got banned for the n-word - he told us that he only wrote the letter n in the chat and other teammates made the racial slur out of it. (I hope I remember the story right.)\n\nyou'll continue to deny so I'll have to take your word for it.\n\nthe example you gave doesn't really reflect the story you just told but it doesn't matter.","replies":[{"poster":"Julevi","date":"2019-12-20T09:12:01.246+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MustardTigerMK,realm=NA,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=00020000000000000000,timestamp=2019-12-20T09:05:16.598+0000) \n> the example you gave doesn't really reflect the story you just told but it doesn't matter.\n\nPlease explain that further. I will summarize what I wanted to say: people will always be creative - circumvent the system by adjusting letters or wording it differently but with the same meaning. The system can't pick that up, but a human can take look at it (ticket) and punish them. While the system is struggling with detecting things, like this writing style:\n\nJ \nU \nL\nE\nV\nI\n\na human will easily see the issue. We have cases on boards where people got punished and didn't get a punishment for this style, I guess that depends if someone took a look at it or not.","replies":[]}]}]},{"poster":"Julevi","date":"2019-12-20T08:54:01.071+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MustardTigerMK,realm=NA,application-id=ZGEFLEUQ,discussion-id=AErPjlBN,comment-id=000200000000,timestamp=2019-12-20T08:46:07.943+0000)\n>\n> he denied even saying it.... A human element should look at this, robots get it wrong a lot imo.\n\nTherefore I recommended submitting a support ticket.","replies":[]}]}]}]}]}