{"poster":"R4tV2","date":"2018-07-03T00:04:41.170+0000","title":"Camera Tool","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo Liebes League Team ,\r\nich spiele jetzt seit ca 3 Monaten mit einem Camera Tool in League. Dies allerdings nur , da mein PC sehr schlecht ist, und ich somit die Aufl&ouml;sung runtergeschraibt habe. Jetzt ist allerdings das Problem, das alles sehr nah rangezoomt ist. Deshalb habe ich mir das Camera Tool installiert , um wieder die normale Sicht zu haben.  Ich schw&ouml;re , dass ich das Camera Tool nur so weit eingestellt habe , dass ich so viel wie jeder andere Spieler sehe.\r\nSeit heute kommt aber eine Error-Meldung , die besagt , dass ich ein Overlay oder sowas schliessen muss. Das macht mich sehr traurig , da ich so viel Spass mit dem Game habe aber nicht mit 30Fps spielen m&ouml;chte.\r\nGibt es da irgendeine Chance dies zu blockieren oder ist das Camera Tool verboten? (ist NUR ein Camera Tool nichts anderes)\r\nIch bitte um Ihr Verst&auml;ndniss,\r\nMfg","replies":[{"poster":"Sidia","date":"2018-07-03T00:17:15.635+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nalle 3rd-Party Tools sind nur geduldet, also niemals offiziell supportet. Verboten ist das Kamera Tool, falls du damit Ingame spielst. Für Aufnahmen kannst du dies ohne Probleme verwenden.\n\nMit freundlichen Grüßen\nSidia","replies":[{"poster":"R4tV2","date":"2018-07-03T09:12:12.417+0000","up_votes":1,"down_votes":0,"body":"Ich möchte mir ja damit keine Replays angucken oder sowas ,sondern einfach nur ingame die normale Sicht wieder haben. Denn wenn ich mit der Auflösung 1440x900 spiele ist alles sehr nah an meinen champion rangezoomt und ich sehe weniger, da mein Monitor eine Auflösung von 1920x1080 hat.  Ich bitte darum , dieses Tool weiterhin benutzen zu dürfen , um den vollen Spielspaß zu haben.\nMfg","replies":[{"poster":"MSF Ness","date":"2018-07-03T09:26:22.025+0000","up_votes":2,"down_votes":0,"body":"Der Spielspaß würde nicht lange andauern wenn du für 3rd-Party Tools gesperrt werden würdest allerdings.\n\nIch verstehe natürlich, dass es dem Camera Tool mehr Spaß machen kann, aber bedenke, dass du sobald du ein von uns nicht offiziell unterstütztes Tool verwendest, deinem Konto ein Risiko aussetzt.\n\nIch bin davon überzeugt, dass unsere lieben Wrenchman oder wir als Spieler Support dir noch dabei helfen können, deine Kamera- und Grafikeinstellung im Spiel etwas zu richten, damit es auch dir genug Spaß bringt.\n\nBitte stelle in diesem Fall die Sicherheit deines Kontos über den Spielspaß. Es wäre schade, wenn du dein Konto auf diese Weise verlieren würdest.\n\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"R4tV2","date":"2018-07-03T10:01:35.005+0000","up_votes":1,"down_votes":0,"body":"Nach 5 permanenten Sperrungen wegen Kleinigkeiten kann ich den Spielspaß so wie früher eh nicht mehr haben.^^","replies":[{"poster":"MSF Ness","date":"2018-07-03T10:14:49.114+0000","up_votes":1,"down_votes":0,"body":"Wir sperren keine Konten permanent wegen Kleinigkeiten.\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"R4tV2","date":"2018-07-03T10:44:29.650+0000","up_votes":1,"down_votes":0,"body":"Nein? Deswegen werde ich gebannt wenn ich frage was mein Teammate macht und ihn frage ob er dumm ist? Deswegen werde ich gebannt? Ich weiss nicht ob dus weisst aber man brauch nur 2 Banns für einen Permabann.(solltest du wissen) Und da finde ich sowaskomplett übertrieben. Man schreibt AUS SPASS mit 5er premade dass man intet und wird gebannt? Logic? Ich glaube nicht? Es gibt so viel wo man euch zu Frage stellen müsste.{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"silibum","date":"2018-07-03T11:09:28.801+0000","up_votes":1,"down_votes":0,"body":"Ich beende das hier mal. Wenn Du über Spielerverhalten diskutieren möchtest, dann musst Du das im richtigen Bereich machen: http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de","replies":[]}]}]}]}]}]}]}]}