{"poster":"TiO2","date":"2016-09-26T20:40:25.596+0000","title":"shen laningphase","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hey LEute :)\r\nMir passiert es leider immer das ich in der laningphase mit shen Riesen Probleme gegen meine gegner habe. H&auml;ttet ihr ein paar tipps f&uuml;r mich?","replies":[{"poster":"Megamaexx","date":"2016-09-26T21:20:35.040+0000","up_votes":1,"down_votes":0,"body":"Shen ist ein ganz guter Bully. Kommt dein Gegner zu nah an dich heran, attackiere ihn mit aktiver Q. Notfalls nimm noch deine E, falls du näher ranmusst. \nNutze W, wenn dein Gegner einen Hit auf dich landen will.","replies":[{"poster":"Jisatsu90","date":"2016-09-28T13:45:31.423+0000","up_votes":1,"down_votes":0,"body":"Gegen die meisten Champs kommst du mit Shen sehr gut an.\n\nEinfach mehr trauen und ausprobieren!\n\nDie Q macht nen guten Schaden und mit der E hast du nen ordentlichen Cc Spell.\n\nEntweder du gibst deinem Gegner einen Q autohit oder gehst full-engage mit der\nE-Q-W Kombo.\n\nGrundsätzlich kannst du mit Shen gut traden, hast aber wenig Killpressure da Shen nur einen Hauptdamagespell hat.\nDer E-Schaden ist mMn nicht all zu hoch.\n\nShen passt sehr gut in eine Peelcomp aber obwohl er mein Main ist, muss ich sagen dass es auf der Toplane derzeit weitaus bessere Tanks gibt wenn es um die Solo-Q geht.","replies":[{"poster":"Megamaexx","date":"2016-09-28T13:51:45.876+0000","up_votes":1,"down_votes":0,"body":"Wenn wir schon beim Thema Shen sind: Welche Champions fallen dir so ein, gegen die man nicht als Shen spielen sollte? Ich spiele zwar nicht so oft Top, aber wenn dann meist Shen.\nBisher hatte ich nur schlechte Erfahrungen gegen Garen.","replies":[{"poster":"Jisatsu90","date":"2016-09-28T14:16:20.991+0000","up_votes":2,"down_votes":0,"body":"Champions die ihren Hauptschaden über Spells machen würd ich sagen.\n\nRenekton, Rumble, Darius, Cho'Gath oder Riven z.B.\n\nSo gut Shen gegen auf Autoattack basierten Champs ist so schlecht ist er gegen Caster.\n\nBesonders Caster mit Early sehr viel Schaden können dir das Leben zur Hölle machen.","replies":[]}]}]}]},{"poster":"Awsane","date":"2016-09-26T20:49:54.454+0000","up_votes":2,"down_votes":0,"body":"trau dich mehr, du bist mit shen sehr stark early game","replies":[]}]}