{"poster":"J is my Bae x3","date":"2015-12-21T11:35:05.284+0000","title":"Kann ein Bronze Spieler nicht mehr mit Platin duoq?","subforum":"Hilfe & Support","up_votes":1,"down_votes":2,"body":"Hey Hey,  ich habe eine frage , undzwar habe ich &ouml;fter geh&ouml;rt das ein sagen wir mal Bronze mit Platin nicht mehr duoq spielen kann ? Ist da was dran ? Bitte um Antwort :p","replies":[{"poster":"Fairez","date":"2015-12-21T11:39:33.905+0000","up_votes":1,"down_votes":0,"body":"Hallo,\ndas ist korrekt. Der Unterschied zwischen den Spielern darf nicht größer als eine Klasse sein.\nDas heißt wenn du Bronze spielst, kannst du nur mit Silber zusammen spielen. Wenn du z. B. Platin bist, kannst du nur mit Diamant und Gold zusammen spielen.","replies":[{"poster":"J is my Bae x3","date":"2015-12-21T11:48:28.353+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fairez,realm=EUW,application-id=7hciEY9w,discussion-id=ofEXMFgB,comment-id=0000,timestamp=2015-12-21T11:39:33.905+0000)\n>\n> Hallo,\n> das ist korrekt. Der Unterschied zwischen den Spielern darf nicht größer als eine Klasse sein.\n> Das heißt wenn du Bronze spielst, kannst du nur mit Silber zusammen spielen. Wenn du z. B. Platin bist, kannst du nur mit Diamant und Gold zusammen spielen.\n\nDanke!","replies":[{"poster":"Busty Botter","date":"2015-12-21T13:03:49.591+0000","up_votes":1,"down_votes":0,"body":"Wenn dich die Begründung noch interessiert. Es gab früher Leute die haben sich extra einen B5 Account gemacht um dann ihrem Freund durch die Promos zu helfen zB. War dann D5 auf D4 Promo im Duo mit einem B5 Account. Der mit dem B5 Account hat aber auch einen Low-Dia Main, und so wurden 2 Dia Spieler danke dem B5 Account mit High-Gold bis Low-Platin gematched und haben die Games gestompt und die Promo gewonnen.\nUm eben soetwas zu unterbinden, hat Riot die neue Regelung eingeführt.","replies":[]}]}]},{"poster":"FailerOfWorld","date":"2015-12-21T11:39:53.375+0000","up_votes":1,"down_votes":0,"body":"Seit ziemlich langer Zeit (über ein Jahr glaube ich bereits) kann man nur noch mit Leuten duoQ machen, die höchstens eine Liga unterschied haben. Also kann ein Silber-Spieler mit Gold und Bronze-Leuten duoQ spielen. Willst du mit denem Platin Kumpel spielen muss er entweder einen Smurf benutzen oder ihr spielt normals.","replies":[]}]}