{"poster":"Supp is LlFE","date":"2015-02-23T13:13:41.758+0000","title":"Gold+ Support sucht Community/Team mit klaren Zielen","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo liebe LOL-Community,\r\nzur Zeit suche ich die Gruppierung die am besten zu mir passt. Ich war in S4 so gut wie platin (90points G1) und bin auch gerne dazu bereit einen teamleitenden Posten zu übernehmen.\r\nAlles weitere könnt ihr unten drunter lesen ^_^\r\n\r\nName : Kevin\r\nNick :Dont hurt my ADC\r\nAlter : 24\r\nPosi : Main Support\r\n\r\nEin Text mit weiteren Informationen\r\n\r\nAlso abgesehen von meinen Stammdaten die weiter oben stehen hier noch einiges mehr :\r\nIch komme aus Nordrhein-Westfalen, bin arbeitstätig und ein recht ruhiger Mensch. Ich lasse mich dadurch auch nicht schnell aus der Fassung bringen.\r\nLeague of Legends ist mein Main-Game und der Grund wieso ich heute hier ins Forum schreibe.\r\n\r\nMir ist wichtig, dass :\r\n\r\n- ich mit Leuten spiele, bzw mit Leuten in einem Team bin die auf meinem \"Level\" sind oder drüber\r\n- meine Teammates mit der gleichen Begeisterung LOL spielen wie ich\r\n- mein Team die Trainingszeiten respektiert\r\n\r\nWas könnt ihr von mir  als Spieler erwarten?\r\n\r\nNun gehts also um mich ^^\r\nAlso kommen wir erstmal zu meinem LOL-skill Level usw. :\r\n\r\nIch bin Support ( Main - Support mit Herzblut und ich stehe dazu diese Rolle immer zu bleiben und sie nicht zu wechseln)\r\nMein Ranking in Season 4  : Gold 1 (so gut wie Platin halt )\r\nMein derzeitiges ranking ist Gold. Außerdem  erwarte ich von mir selber am Ende der Season in Platin 3 zu sein.\r\n\r\nIch weiß genau was ich will und was ich dafür tun muss. Ich erwarte von meinn Mitspielern im Ranked - Team eine ähnliche Gesinnung.\r\nNiemals wird etwas unmöglches verlangt, jedoch sollte man immer sein Bestes geben.\r\n\r\nLOL ist mein erstrangiges Hobby, ich spiele seit Season 2 , habe mehr als 3500 normal Games und mehr als 1200 Ranked Games.\r\nIch schaue aktiv LCS ( derzeit Spring Split NA sowie EU) und bin immer über neue Patches usw. informiert.  (außerdem lächtze ich nach DJ Sona , aber das ist eine andere Geschichte :DDD )\r\n\r\nAußerdem traue ich mir zu eine teamleitende Rolle im Clan einzunehmen und werde wahrscheinlich in kürze aktiv auf Twitch.tv streamen.\r\n\r\nIch biete euch also einen aktiven (täglich verfügbar). pflichtbewussten, zielstrebigen Member der euch gerne unterstützt .\r\nDas alles hängt natürlich davon ab wie es mir bei euch gefällt und ob die Stimmung passt.\r\nAußerdem muss nicht alles von heute auf morgen fertig sein, ein passendes Team zu finden brauch natürlich Zeit und ich bin gerne bereit zu warten wenn man merkt das alles in guten Bahnen läuft :)\r\n\r\nBist du an Fun-Spielen, professionellen Spielen oder beides Interessiert?\r\n\r\nAlso ich definiere es mal so , Spaß muss immer dabei sein.\r\nIch bin aktiver Gamer d.h. ich bin darauf fixiert meine Zeit am PC sinnvoll zu nutzen( falls Gaming sinnvoll ist :D) Natürlich gibts immer Chillphasen und ich erwarte auch NICHT  von jedem IMMER spielen zu wollen (mache ich ja auch nicht ^^).\r\nJedoch sollte ein jeder der einem vernümpftigen Team beitritt sich bewusst sein , dass man dies nicht nur tut um eine 5on5 wertung zu haben sondern um mit diesem Team auch was erreichen zu wollen.\r\nDazu gehört ein fest geplantes Training in geregelten Abständen und spontane Games als Gemeinschaft.\r\n\r\nIch bin fest davon überzeugt LOL als mein hobby auszuleben und mein persönliches Ziel für die zukunft ist es mindestens die Diamant-elo zu erreichen.\r\nAlso in eurer Frage wäre ich wohl der professionel gesinnte Spieler.\r\n\r\nDanke und viel Spaß noch.","replies":[]}