{"poster":"san Jellal","date":"2017-09-22T08:19:37.047+0000","title":"letalidad","subforum":"Problemas Técnicos","up_votes":6,"down_votes":1,"body":"quer&iacute;a saber como es que la pasiva &uacute;nica de estos items {{item:3142}} {{item:3814}} {{item:3147}} se acumulan al grado de deletear a un adc de un b&aacute;sico (son mas de 1200 en menos de 0.7s) pero los items para supp {{item:3504}} {{item:3107}} {{item:3222}} no dan un escudo mas de 500 de vida? no se supone que las pasivas son &uacute;nicas?{{sticker:sg-janna}}","replies":[{"poster":"akAiXx","date":"2017-09-22T09:25:31.785+0000","up_votes":2,"down_votes":0,"body":"la letalidad no es una pasiva, es una stadistica que se puede stakear\nsaludos!\n{{champion:121}}","replies":[]},{"poster":"Not Personal","date":"2017-09-22T13:14:31.916+0000","up_votes":1,"down_votes":0,"body":"Si se stackearan, imagiante que si haces esos items tenes un 40% mas de curacion, imaginate una soraka con eso y rostro espiritual, ademas de no morir nunca no deja morir a nadie mas. Y lo que te dijeron abajo, si queres escudos mas fuertes stackea ap y alguno de esos items. O tambien un escudo de janna aumentado al 40%, mas las pasivas de tus maestrias. No muere nunca el adc enemigo ","replies":[{"poster":"Hnk Kenshiro","date":"2017-09-22T13:47:44.825+0000","up_votes":1,"down_votes":0,"body":"El {{item:3065}} solo funciona con las curas recibidas, si soraka lo equipa, no hara más fuerte sus W.\n\nFunciona cuando al que curas lo usa.","replies":[{"poster":"Not Personal","date":"2017-09-22T15:22:43.039+0000","up_votes":1,"down_votes":0,"body":"Acordate que soraka se auto cura con redencion, con q, con r, y tal vez con heal. Cuanto mas dure ella mas dura su team, y cuanto mas se cure mas w puede usar.","replies":[]}]}]},{"poster":"Hnk Kenshiro","date":"2017-09-22T11:57:07.880+0000","up_votes":1,"down_votes":0,"body":"Y si todos los item de letalidad traen AD, y los de curas solo el pebetero.\n\nSi quieres que el escudo sea más fuerte intenta con un rabadon.","replies":[]}]}