{"poster":"Spectre XIII","date":"2017-03-01T06:37:38.714+0000","title":"Ranked Status fehlerhaft? Free Win in der Promotion verursacht Bug?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi zusammen,\r\n\r\nbei mir gab es heute morgen einen seltsamen Bug bzgl. Ranked Solo Queue.\r\nIch stand bei Silber 3 100 LP und hatte einen Free Win, nach einem verlorenen Spiel gewann ich das zweite Spiel und stieg in Silber 2 auf.\r\nDas darauf folgende Spiel habe ich verloren und bekam anschlie&szlig;end die Meldung meine Promotion sei verloren. \r\nDarauf noch ein Spiel verloren und jetzt bin ich wieder Silber 3 mit 50 LP.\r\nJetzt ist die Frage wie es sein kann nach gewonnener Promotion mit Free Win direkt wieder abzusteigen ?","replies":[{"poster":"Homunculi","date":"2017-03-01T07:40:32.257+0000","up_votes":4,"down_votes":0,"body":"Hi,\n\neigentlich sollte das nicht unbedingt möglich sein, aber da du anscheinend bei einem Lose 25 LP verlierst, ist deine MMR noch nicht ganz auf Silber 2 Niveau, spiel weiter, verbessere dich und dann wird das auch was :). Viel Erfolg.","replies":[]},{"poster":"Spectre XIII","date":"2017-03-01T11:34:55.475+0000","up_votes":1,"down_votes":0,"body":"Die Frage ist doch warum nach einer gewonnen Promotion noch die Meldung kommen kann das die Promotion nicht erfolgreich war.","replies":[{"poster":"Homunculi","date":"2017-03-01T13:34:01.144+0000","up_votes":1,"down_votes":0,"body":"Hast du dich vllt. verguckt/verzählt?","replies":[{"poster":"Spectre XIII","date":"2017-03-01T16:13:21.471+0000","up_votes":1,"down_votes":0,"body":"Nein bin mir absolut sicher weil ich war schon seit einigen Tagen in der Promotion und der Client auch angezeigt hat das ich in Silber 2 aufgestiegen bin.\nAuf der Seite op.gg hatte mein Profil zeitweise auch Silber 2.\nUnd ich dachte eigentlich das dies hier immer noch gilt:\nhttps://support.riotgames.com/hc/de/articles/204010760-FAQ-zu-Ranglistenspielen#h3\n>  Nach einem Aufstieg in eine neue Division oder Klasse erhältst du so etwas wie einen „Abstiegsschild“, der dich vor einem Rangabstieg beschützt. Dadurch kann es nicht passieren, dass du eine Serie gewinnst, ein paar Spiele verlierst und dann sofort wieder absteigst. Der Schild beschützt dich für 3 Spiele nach einem Divisionsaufstieg und für 10 Spiele nach einem Klassenaufstieg (3 Spiele für die Meister-Klasse).\n\nDeshalb bin ich ja auch der Meinung das hier etwas verbuggt sein müsste in Kombination mit der Meldung das meine Promotion fehlgeschlagen sei obwohl sie bereits vorbei war.","replies":[{"poster":"Homunculi","date":"2017-03-01T16:46:41.482+0000","up_votes":1,"down_votes":0,"body":"Was mich stark verwirrt, du warst im dem Xerath Spiel(gewonnen) und im MF Spiel (verloren) noch S3, danach im Ziggs Spiel schon S2 o_O und vorher leider auch 5 mal verloren. \n\nEntweder ist das ein Bug bei op.gg, dein Name wurde von mir falsch kopiert oder iwas is da ganz falsch.","replies":[{"poster":"Spectre XIII","date":"2017-03-01T17:13:25.843+0000","up_votes":1,"down_votes":0,"body":"Du musst die NORMAL Spiele ausblenden :>\nhttps://euw.op.gg/summoner/userName=sh1nyo\nLass dir nur die Ranked Solo anzeigen dann sollte der Verlauf deutlicher werden.\nNach dem Xerath Spiel war ich in S2 und nach dem MF Spiel wieder in S3 dann nochmal verloren und jetzt S3 mit 50LP...\nIch bin bei der Pechsträhne mit 6 verlorenen Spielen in Folge aus S2 in S3 abgestiegen weshalb ich nicht auf 0 LP in S3 war und somit nicht viele Punkte gebraucht habe um wieder in die Promo für S2 zu kommen.","replies":[{"poster":"Homunculi","date":"2017-03-02T13:49:08.437+0000","up_votes":1,"down_votes":0,"body":"^^\" ich hab da wohl zu schnell drüber geguckt, bei den verlorenen Spielen.\n\nMelde dein Problem bitte dem Support, es scheint als ob die Freewins momentan verbuggt sind.\n\nEDIT: Gut vergiss es, dass hast du schon getan^^\".","replies":[]}]}]}]}]}]},{"poster":"Spectre XIII","date":"2017-03-01T19:08:04.679+0000","up_votes":1,"down_votes":0,"body":"Ok, Problem \"gelöst\" bzw. die Ursache ist gefunden und ich bin nicht bekloppt. :D\nRiot hat in einem Supportticket geschrieben das eben meine gewonnene Promo \"verloren\" gegangen ist. -.-\n\n> Hallo, \nvielen Dank für deine Anfrage. Heute um ungefähr 3 Uhr hatten wir für kurzem Probleme mit den Servers, die auch zu dem Verlust von LP und Rankedstats geführt haben. Es ist uns leider unmöglich, diese Stats irgendwie wiederherzustellen, das Problem muss aber auch nicht mehr auftauchen. Vielen Dank für dein Verständnis!\nMit Freundlichen Grüßen\nTegrios","replies":[]},{"poster":"Zero000","date":"2017-03-01T17:37:22.589+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sh1nyo,realm=EUW,application-id=7hciEY9w,discussion-id=4yVeIJUH,comment-id=,timestamp=2017-03-01T06:37:38.714+0000)\n> bei mir gab es heute morgen einen seltsamen Bug bzgl. Ranked Solo Queue.\n> Ich stand bei Silber 3 100 LP und hatte einen Free Win, nach einem verlorenen Spiel gewann ich das zweite Spiel und stieg in Silber 2 auf.\n> Das darauf folgende Spiel habe ich verloren und bekam anschlie&amp;szlig;end die Meldung meine Promotion sei verloren. \n> Darauf noch ein Spiel verloren und jetzt bin ich wieder Silber 3 mit 50 LP.\n> Jetzt ist die Frage wie es sein kann nach gewonnener Promotion mit Free Win direkt wieder abzusteigen ?\n\n\nDas hast du vor 11 Stunden geschrieben.\nWenn man deinen Spielverlauf aber ansieht sieht man heute aber nur 5 Spiele, davon hast du nur eines gewonnen. Du kannst die Promo also gar nicht gewonnen haben.\n\n**Edit**: Im Nachhinein habe ich das mit dem \"Freewin\" eventuell falsch verstanden, meintest du damit einen geschenkten Sieg den man erhält wenn man die Promo vorher schon mal verloren hatte? \nDann wäre die einzige Möglichkeit die mir einfällt noch das du die Championauswahl verlassen hast, dadurch eine weitere Niederlage kassiert hast, mit dem einen Sieg wieder in die Promo kamst und die dann wieder verloren hast.","replies":[{"poster":"Spectre XIII","date":"2017-03-01T18:29:00.615+0000","up_votes":1,"down_votes":0,"body":"Hey,\nja ich meinte mit Free Win das ich einen \"geschenkten Sieg\" hatte.\nIch war bereits S2 und hatte eine Pechsträhne und bin deshalb abgestiegen.\nhttps://euw.op.gg/summoner/userName=sh1nyo\nWenn du hier dir meine Ranked Solo Historie anschaust kannst es besser nachvollziehen.\nDie Promospiele sind das verlorene Katarina Spiel und das Xerath Spiel.\nHeißt mit Xerath Spiel hatte ich dann 2/1 in der Promo und bin aufgestiegen.\nAnschließend wieder direkt runter ohne den erwähnte \"Abstiegsschild\" aus dem FAQ für Ranglistenspiele","replies":[{"poster":"Zero000","date":"2017-03-01T18:52:02.019+0000","up_votes":1,"down_votes":0,"body":"Bist du den auch wirklich aufgestiegen? Wie schon gesagt zählt ein verlassen der Championauswahl auch als Niederlage. Somit könntest du vor deinem {{champion:101}}  Sieg schon zwei Spiele verloren haben, nach dem Sieg wieder in der Promo gelandet sein und sie daraufhin wieder verloren haben.","replies":[{"poster":"Spectre XIII","date":"2017-03-01T19:06:14.506+0000","up_votes":1,"down_votes":0,"body":"Ja ist mir bewusst aber ich habe nicht gedodged oder bin afk gegangen.\nHabe die Spiele normal durchgezogen und habe nach dem Xerath Spiel auch die Meldung bekommen mit dem Aufstieg.\nUnd anschließend nach der ersten Niederlage nach dem Aufstieg die Meldung \"Promo verloren\" was mich eben so stutzig werden lassen.","replies":[]}]}]}]},{"poster":"BruceGi","date":"2017-03-01T07:53:22.702+0000","up_votes":1,"down_votes":1,"body":"Ich schätze eher dass es ein Fehler am Clienten ist. Sh1nyo hat eine Silber 4 MMR. Damit kann er nicht mit einem Loose auf 0 LP direkt nach einer gewonnen Promo wieder auf Silber 3 absteigen. Da ist eher eine niedrigere MMR von mehr als einer LIga anstatt einer Division nötig.","replies":[{"poster":"Nycaria","date":"2017-03-01T09:25:53.565+0000","up_votes":1,"down_votes":0,"body":"Das mit der MMR, die eine Liga niedriger ist, ist relavant um von Liga zu Liga abzusteigen. In den Divisionen steigt man wesentlich schneller ab :)","replies":[]}]}]}