{"poster":"Bloody Axe","date":"2016-03-12T17:08:24.936+0000","title":"Shen e la sua vita base.","subforum":"Campioni e gameplay","up_votes":1,"down_votes":3,"body":"Giocando Shen da qualche giorno ho notato che ha qualcosa in meno rispetto ad altri tank della toplane. Quel qualcosa che manca &egrave; la salute, Shen rispetto ad altri champ a mio avviso ha una salute base davvero molto bassa rispetto al ruolo che deve coprire. Che sia per bilanciare il campione? Non me ne intendo molto di bilanciamente ma penso che un p&ograve; di vita base in pi&ugrave; gli spetterebbe, poi vabbe sono solo un utente che esprime la sua. Magari qualcuno che ne sa pi&ugrave; di me potrebbe spiegarmi il perch&eacute; di questa decisione?","replies":[{"poster":"ubercodlegend200","date":"2016-03-12T18:24:26.535+0000","up_votes":2,"down_votes":0,"body":"lo scudo è permacarico se avesse una vita base alta sarebbe insostenibile come cosa devi imparare ad usare lo scudo è il lifesteal della vecchia q praticamente durante i fight","replies":[]},{"poster":"Hype GENERAL ZOD","date":"2016-03-14T13:12:22.675+0000","up_votes":1,"down_votes":0,"body":"Secondo voi che oggetto d'attacco rende meglio su shen? Solitamente lo faccio 5 oggetti tank e 1 att ma nn so se sia meglio{{item:3078}} {{item:3748}} {{item:3025}}  o altro","replies":[]},{"poster":"GreenInch","date":"2016-03-14T07:25:46.251+0000","up_votes":1,"down_votes":0,"body":"Hai uno scudo che si applica ogni 3x2 con tanto di skill che rende invulnerabile mezzo team...ogni skill attiva lo scudo...hai anche bisogno di più  hp?senza offesa ma non hai capito niente^^ per bzuttarlo giu ci vogliono 3 team...\nTi giochi bene le skill sei permascudato...e vuoi anche piu hp di base??","replies":[]},{"poster":"Amillion","date":"2016-03-13T23:24:05.493+0000","up_votes":1,"down_votes":0,"body":"Non diciamo cavolate ! dovrebbe essere nerf ! quale buff , in game se lo build full armatura e resistenza magica con la sunfire{{item:3068}} ti carria un game , se gli aggiungi anche un {{item:3026}} per killarlo ti serve la grazia di padre pio san Gerlando e papa Francesco .. praticamente lui si busca i danni che non subisce nel mentre la sua squadra ti ha killato e ggwp\n\nbisogna nerf ! altro che aumentargli gli hp","replies":[]},{"poster":"Power Mac","date":"2016-03-13T09:47:42.675+0000","up_votes":1,"down_votes":0,"body":"Diciamo che a inizio partita può sembrare relativamente fragile rispetto ad altri, ma perché è anche in grado di fare un minimo di danno rispetto ad altri tank (non tutti, eh) e di ripararsi in altra maniera. Diciamo che sicuramente Shen non è ancora \"finito\", prima del restyling, tra Q e W aveva mezzi molto più immediati per proteggersi e recuperare vita. Di sicuro non ti ci puoi buttare come faresti con un Darius o un Garen, meglio giocare con prudenza per almeno i primi dieci minuti.","replies":[]},{"poster":"kirchhoff","date":"2016-03-12T21:47:43.026+0000","up_votes":1,"down_votes":0,"body":"Perchè si scuda.","replies":[]},{"poster":"TORREro064","date":"2016-03-12T18:11:08.724+0000","up_votes":1,"down_votes":0,"body":"però ha uno scudo che si carica ogni 2 secondi","replies":[{"poster":"Filthyrocker","date":"2016-03-12T21:33:10.851+0000","up_votes":1,"down_votes":0,"body":"> però ha uno scudo che si carica ogni 2 secondi\n\n8","replies":[]}]},{"poster":"Hype GENERAL ZOD","date":"2016-03-12T20:07:03.150+0000","up_votes":1,"down_votes":0,"body":"Scala di 2.2 punti armor a Level mentre altri tank arrivano a4. Ecco cosa gli manca XD prende 73 di vita a livello e 2.2 di armor. Altri tank prendono 90 e 4 armor a livello.","replies":[]},{"poster":"sboboo","date":"2016-03-12T17:33:46.145+0000","up_votes":1,"down_votes":0,"body":"Infatti mi ritrovo con qualcosa del tipo 2500 hp con 2 item difensivi, forse per bilanciare il fatto degli scudi che scalano con la vita.","replies":[]}]}