{"poster":"melior sum","date":"2018-10-12T17:43:22.683+0000","title":"Can you people learn how to lose?","subforum":"Gameplay","up_votes":31,"down_votes":12,"body":"Like, I&#039;m so sick of having to deal with my bot lane going 0/5/0-0/8/0 in the first 15 minutes of the game. It&#039;s like you don&#039;t have a sense of how to play from behind.\r\n\r\nLearn how to fucking tether and get the minions you can, stay under tower, play safer, stop doing trades, stop putting yourself in places that will make you easy to catch, stop giving up after 2 deaths.\r\n\r\nI can&#039;t carry your dumb ass if you become a lane minion and just walk into them and die.\r\n\r\njust fucking farm and stop talking/inting","replies":[{"poster":"OneMustFall","date":"2018-10-12T21:41:36.861+0000","up_votes":22,"down_votes":0,"body":"Sounds to me like your teams are great at knowing how to lose and don't need to learn anything.","replies":[]},{"poster":"AstroFerrari ","date":"2018-10-12T18:56:50.890+0000","up_votes":21,"down_votes":3,"body":"Yes let's try this awesome \"just farm under tower\" strategy where 75% of the top lane roster can just dive you, are manaless, have some passive or ability that negates death or give some kind of shield or are also extremely mobile while also being tanky. Or maybe you allow yourself to get pushed under tower, give up lane priority and your laner roams, you ping it, people die, and people like you still get pissed. There's no winning. \n\nThat whole \"farm under tower\" strat doesn't work when you have to play against these people in lane {{champion:86}} {{champion:266}} {{champion:84}} {{champion:36}} {{champion:122}} {{champion:39}} {{champion:24}} {{champion:240}} {{champion:54}} {{champion:80}} {{champion:92}} {{champion:6}} \n{{champion:23}} {{champion:14}} \nand can still be ass fucked from out of nowhere by these junglers {{champion:154}} {{champion:164}} {{champion:59}} {{champion:141}} {{champion:121}} {{champion:35}}  and there's NOTHING you can do about it cause towers are trash.","replies":[{"poster":"The Oasis","date":"2018-10-12T23:50:37.683+0000","up_votes":7,"down_votes":0,"body":"If they posture for a dive you can always back off your tower and let them zone you.  It sucks, but it beats losing all that farm/exp AND giving your opponent another kill. ","replies":[{"poster":"Anzila","date":"2018-10-13T08:39:48.721+0000","up_votes":1,"down_votes":0,"body":"Or start to back off and get killed by the jungle pincering you, while your jungle is afk in the river bush waiting for scuttle to spawn.","replies":[{"poster":"The Oasis","date":"2018-10-14T22:16:45.892+0000","up_votes":1,"down_votes":0,"body":"That's just a good gank.  Your tower can't and shouldn't protect you against bad play or good junglers.","replies":[]}]},{"poster":"My Waifu Vanilla","date":"2018-10-13T01:56:21.053+0000","up_votes":1,"down_votes":0,"body":"I love when people stay under tower to \"defend it\" and just die and lose the tower anyway, but in this scenario they kick someone off the map for 30+ seconds and get a 300g bonus.","replies":[]}]},{"poster":"Z3Sleeper","date":"2018-10-13T03:54:28.826+0000","up_votes":4,"down_votes":0,"body":"Let's try it bot lane too!\n\n**Gets 4 man tower dived*\\*\n\nWell, that's unfortunate, but they had to use 4 right?\n\n**Gets 3 man tower dived*\\*\n\nWell, that's a bit unreasonable, but I guess since they had lane priority they controlled the vision around our lane so we didn't see it coming.\n\n**Gets 2 man tower dived cuz enemy support is {{champion:12}} *\\*\n\nAight I'm done","replies":[{"poster":"3TWarrior","date":"2018-10-13T17:54:57.599+0000","up_votes":1,"down_votes":0,"body":"you forgot when the opposing laner is caitlyn and does not even need a support to tower dive because her traps are invisible behind towers and her range extends to 1150 if she can get the right shot off","replies":[]}]},{"poster":"Vlada Cut","date":"2018-10-13T16:41:15.635+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=TheBlackFaker,realm=NA,application-id=3ErqAdtq,discussion-id=quHmvxBI,comment-id=0003,timestamp=2018-10-12T18:56:50.890+0000)\n>\n> Yes let&#x27;s try this awesome &quot;just farm under tower&quot; strategy where 75% of the top lane roster can just dive you, are manaless, have some passive or ability that negates death or give some kind of shield or are also extremely mobile while also being tanky. Or maybe you allow yourself to get pushed under tower, give up lane priority and your laner roams, you ping it, people die, and people like you still get pissed. There&#x27;s no winning. \n> \n> That whole &quot;farm under tower&quot; strat doesn&#x27;t work when you have to play against these people in lane {{champion:86}} {{champion:266}} {{champion:84}} {{champion:36}} {{champion:122}} {{champion:39}} {{champion:24}} {{champion:240}} {{champion:54}} {{champion:80}} {{champion:92}} {{champion:6}} \n> {{champion:23}} {{champion:14}} \n> and can still be ass fucked from out of nowhere by these junglers {{champion:154}} {{champion:164}} {{champion:59}} {{champion:141}} {{champion:121}} {{champion:35}}  and there&#x27;s NOTHING you can do about it cause towers are trash.\n\nThe discuasion is about Bot laners, not Top Laners.","replies":[]}]},{"poster":"FOR JUSTICE","date":"2018-10-12T18:03:11.339+0000","up_votes":11,"down_votes":1,"body":"> [{quoted}](name=Not Grouping,realm=NA,application-id=3ErqAdtq,discussion-id=quHmvxBI,comment-id=,timestamp=2018-10-12T17:43:22.683+0000)\n> \n> just fucking farm and stop talking/inting\n\nNot gonna disagree with the post because this IS frustrating, but if it were this simple, we simply wouldnt have 0/8/0 teammates. \n\nHow not to int varies depending on the circumstances. Example, your lane is losing, enemies have pushed you under tower. Because you have no vision control, the enemy jungler can sneak into tribrush to attempt a dive. This cant be avoided because you simply cant know hes there without facechecking, which would also cause instant death. Its a terrible cycle tbh.\n\nOr take just farming, you afk farm and let yourself get pushed in, yielding lane priority and the ability to respond to a teamfight first. The enemy gets fed off of a fight, setting them even farther ahead of you, allowing them to faceroll you under your tower.","replies":[{"poster":"My Waifu Vanilla","date":"2018-10-13T01:57:31.730+0000","up_votes":1,"down_votes":1,"body":"Except that scenario is EASILY stopped by 75g. You should put a control ward there anyway if you are constantly under tower because it makes your jungler have a hell of an easy time ganking since they will know there is no vision and can take the blast cone behind them for free.","replies":[{"poster":"Z3Sleeper","date":"2018-10-13T03:59:21.412+0000","up_votes":4,"down_votes":0,"body":"Can't maintain vision control if you don't have lane priority. All you did was give the enemy 25g.\n\nAlso, most of the time that pink near your turret ain't gonna help you. They'll just go right past it and push you off turret/kill you under turret/kill you as you try to run away from turret.","replies":[]}]}]},{"poster":"Yara0","date":"2018-10-13T04:23:06.101+0000","up_votes":9,"down_votes":1,"body":"\"stay under tower\" LMFAO have you played any bot since season fucking 5? bot is literally the gang bang tower dive lane some seasons more some less but either way staying under tower does shit if 5 people walk up to your tower while it fucking hits the garen with 35 extra armor that tped bot for toothpick damage.","replies":[]},{"poster":"Ionian Vulpix","date":"2018-10-13T04:16:26.283+0000","up_votes":3,"down_votes":0,"body":"As simple and condescending as it sounds, \"Stop Dying\" is the best advice. The longer you live, the more time you have to catch up and punish mistakes.","replies":[]},{"poster":"LeftyRaydy","date":"2018-10-12T19:15:29.421+0000","up_votes":3,"down_votes":1,"body":"A lot of the times I find the mentality of people after a few deaths is that the game is over and they want to surrender or they keep playing like crap. try words of encouragement and helping them out in game.","replies":[{"poster":"FioraWillCarry","date":"2018-10-13T11:20:21.626+0000","up_votes":1,"down_votes":0,"body":"You've clearly never played top lane. 80% of match-ups is decided by a single kill. If you get killed twice.....GG bro. If one of your other lanes is not 5-0 then it's best to surrender. That shit gets out of control very fast and in 5 minutes, that 2-0 Darius would be 10-1 after shitting on your team mates when you're unlucky enough to have utter trash apes for a team.","replies":[]}]},{"poster":"Metal Janna","date":"2018-10-12T19:03:38.948+0000","up_votes":4,"down_votes":2,"body":"2 kills is a lost bot unless you get some help from other lanes ASAP. You have the better mid or jungler? Then you have a chance, but only if you play smart and get a gank or a roam.","replies":[{"poster":"HungryAngry2SPP","date":"2018-10-12T23:29:28.471+0000","up_votes":1,"down_votes":1,"body":"Uhm...nope? It's all about supp, who dis/engages better ~20AD/24%as won't insta win you the lane","replies":[{"poster":"crippler38","date":"2018-10-13T03:15:52.501+0000","up_votes":1,"down_votes":0,"body":"I think he means you instantly kill the turret once the laners are dead, which can happen.","replies":[{"poster":"HungryAngry2SPP","date":"2018-10-13T15:19:27.069+0000","up_votes":1,"down_votes":0,"body":"I did not consider this option, yet i think it depends with which champs they are seiging. If it's tristana/Janna then BB turret.\nA vayne can dmg it, but not destroy, even with 2 kills of gold","replies":[{"poster":"ozzzz666","date":"2018-10-13T15:38:36.955+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HungryAngry2SPP,realm=EUNE,application-id=3ErqAdtq,discussion-id=quHmvxBI,comment-id=0004000000000000,timestamp=2018-10-13T15:19:27.069+0000)\n>\n> I did not consider this option, yet i think it depends with which champs they are seiging. If it&#x27;s tristana/Janna then BB turret.\n> A vayne can dmg it, but not destroy, even with 2 kills of gold\n\nThis is true, but so what? Give the damn turret! ESPECIALLY if it is the outer. I'll give turret in a hot second before I feed the laners. Once that turret is down, if you aren't giving kills, they are MUCH more likely to roam and give you a breather to get some farm.","replies":[]}]}]},{"poster":"Tegash","date":"2018-10-13T06:24:41.112+0000","up_votes":1,"down_votes":0,"body":"They have an Alistar? Pick Lulu and Polymorph the enemy ADC, and suddenly nobody's dealing damage.","replies":[]}]}]},{"poster":"Clockwork Mouse","date":"2018-10-14T04:10:03.212+0000","up_votes":1,"down_votes":0,"body":"I think the issues is that not many people want to play those roles. And they get auto filled. End up playing Lux support and missing every skillshot all game.Might as well have been a 3v5 every game every time. Should just ban Lux I been burnt so many times by this.","replies":[]},{"poster":"ozzzz666","date":"2018-10-13T15:39:56.845+0000","up_votes":1,"down_votes":0,"body":"Because they want those kills. If they aren't getting them from you, they are usually gonna try to go get them somewhere else. I mean, because turret or no turret, why would they roam if they are getting the kills on YOU?","replies":[]},{"poster":"Jeddy017","date":"2018-10-13T10:46:03.462+0000","up_votes":1,"down_votes":0,"body":"I think you might want to reword the title. There's a difference between learning how to play from behind & learning how to lose.\n\nOne involves playing passively & trying to farm as much as you can while not dying, even if you have to give up a tower. Wait for jungle to come around & help. Unless you're top where your jungle never ganks while their jungle camps & tower dives your ass 24/7. Okay, I'm just kidding on that last one...........25% kidding.\nAlso, try roaming to another if possible & if you think you guys can score something (bonus points if you're playing a champ who still can be useful from behind like a tank). Then group up with teammates, who have a lead (hopefully), for objectives or to push a lane.\nOf course, this is all based on the assumption you only gave your lane opponent 1 or 2 kills rather than 5 or 6 & you're still relatively close in CS & not down by 50+ at the 10 minute mark. If you are that far behind, welp, just gotta play extra safe & ride on your teammates back.\nThough, if every lane lost & the jungler is behind, that's a different story.\n\nThe other involves AFK-ing, int feeding like you're an \"all you can eat\" buffet & playing dumb shit like full AP Zed while stealing your teammates farm & spamming your mastery 7 every time. Only to be reported by 4-9 people afterwards.","replies":[]},{"poster":"AggressiveWolf","date":"2018-10-13T07:32:25.525+0000","up_votes":1,"down_votes":0,"body":"Can you learn how to not try to 1v1 the enemy 3/0 Irelia as fucking Malphite?","replies":[]},{"poster":"BeatzBoyFTW","date":"2018-10-13T06:28:18.812+0000","up_votes":1,"down_votes":0,"body":"> Learn how to fucking tether and get the minions you can, stay under tower, play safer, stop doing trades, stop putting yourself in places that will make you easy to catch, stop giving up after 2 deaths.\n\nYasuo players: HUR? WHAH U SEH?","replies":[]},{"poster":"LordGeovanni","date":"2018-10-13T02:39:37.596+0000","up_votes":1,"down_votes":0,"body":"While i agree after their 3rd death they arent giving over any real gold so its not even fair to count that keep that in mind too.","replies":[]},{"poster":"Magi Mayvin","date":"2018-10-12T18:07:21.375+0000","up_votes":4,"down_votes":12,"body":"You do realize that the reason u're bitching right now is probably the same reason u win most of your games as well right?","replies":[{"poster":"Nea104","date":"2018-10-12T22:58:04.745+0000","up_votes":1,"down_votes":0,"body":"People still thinks that the two teams are fair and balanced :P","replies":[]}]},{"poster":"Summonah12369","date":"2018-10-12T22:39:41.157+0000","up_votes":1,"down_votes":0,"body":"I thought this was a post about elo boosters.","replies":[]},{"poster":"MalrothDragonia","date":"2018-10-12T18:09:33.826+0000","up_votes":1,"down_votes":0,"body":"I feel this very hard right now. I think for many, as long as outer turret is up, they don't think it's ok to leave their lane if it becomes too gankable/dangerous, and bc they're behind they don't want to spend gold on control wards bc they think it'll slow them catching up.\n \nWhile when I was in lower elos it was understandable, as the people playing were all pretty low-skill in these areas, it is frustrating to see plat players not know how to play from behind.","replies":[]}]}