{"poster":"Krispy Migraine","date":"2019-10-10T01:18:52.433+0000","title":"new client?","subforum":"Miscellaneous","embed":{"description":"Gyazo is a simple way to share screenshots, GIFs, and replays in seconds. Take interesting and useful captures from games, apps, and sites instantly.","url":"https://gyazo.com/b307fd8071aec037c1d35f338bc3c7a6","image":"https://i.gyazo.com/thumb/1200/b307fd8071aec037c1d35f338bc3c7a6-jpg.jpg"},"up_votes":1,"down_votes":0,"body":"the update and the login screen are the only things that have changed otherwise its still laggy and broken","replies":[{"poster":"Ninox","date":"2019-10-10T04:32:48.721+0000","up_votes":1,"down_votes":0,"body":"It's not a whole new client, it's a new login flow that for now just includes the option to save credentials, but also with some backend stuff which will be worked into things like 2-factor authentication and such: https://na.leagueoflegends.com/en/news/client/client-features/saved-login-credentials-coming-soon?ref=rss\n\n>Starting soon on the PBE and then rolling out worldwide, League will be updated to include saved login credentials. This comes with a redesigned login flow that allows you to skip the login screen most of the time if you store your username and password. The update also has some under-the-hood changes to prepare for additional optimizations to the client in the upcoming years: two-factor authentication, background patching, and yes, one day, support for our next game.\n\n___\n\nClient stability is one of their priority commitments at the moment though: https://nexus.leagueoflegends.com/en-us/2019/04/ask-riot-the-client/\n\n>Our first priority is to fix the problems in champion select, as they’re sometimes causing players to unintentionally dodge games because they’re unable to consistently lock in a champion. Once the work on champ select is done, we’ll move on to improving other areas of the client. We’ll start to roll out our first round of improvements in the next few weeks.","replies":[]}]}