{"poster":"EquiIibriumm","date":"2015-11-14T08:40:38.857+0000","title":"Nerfing Ahri....?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":2,"body":"Experiencing pre bad games against {{champion:103}} and her OP BURST during EARLY games. Its pre sad. I think she needs a nerf to the AP scaling :s","replies":[{"poster":"Zorphiax","date":"2015-11-14T10:36:15.399+0000","up_votes":2,"down_votes":0,"body":"I have to say you can't really nerf Ahri. Because, all Mages have an OP burst but then they are pretty useless for a few seconds afterwards.","replies":[{"poster":"EquiIibriumm","date":"2015-11-15T02:58:37.931+0000","up_votes":1,"down_votes":0,"body":"Wouldnt most mages deal alot mid game and late game rather than early game?","replies":[{"poster":"Zorphiax","date":"2015-11-15T03:18:45.786+0000","up_votes":1,"down_votes":0,"body":"A lot of mages deal over average damage early game and will only suffer in late game if they are low farming, haven't been able to get any kills or objectives. Otherwise they will just stomp all over you if you can't dodge there stun or stare. which leads up to there main damage.","replies":[]}]}]},{"poster":"Olee","date":"2015-11-14T09:39:12.168+0000","up_votes":1,"down_votes":0,"body":"Don't you dare fucking touch my Ahri.\n\nShe's not overpowered at all. She is very strong but she is gated by the fact that she is extremely skillshot reliant.","replies":[{"poster":"EquiIibriumm","date":"2015-11-14T10:59:50.526+0000","up_votes":1,"down_votes":0,"body":"hmm? but her charm pretty much secures everything, she has alot of mobility too. pre op if you ask me.","replies":[{"poster":"Olee","date":"2015-11-14T17:18:59.186+0000","up_votes":1,"down_votes":0,"body":"But you have to HIT the charm first. It is a slow moving skillshot with a loud and fairly long cast animation. \n\nLike if these are your arguments, you might as well start complaining about Leblanc, and Fizz, and Diana....\n\nTrust me, learn to dodge skillshots, learn to play a bit forward but behind minions, be ready for her quick engages, you will be fine.","replies":[{"poster":"EquiIibriumm","date":"2015-11-15T02:57:56.767+0000","up_votes":1,"down_votes":0,"body":"ive done all that. Its just the burst early game that destroys me utterly.","replies":[{"poster":"Olee","date":"2015-11-15T03:32:26.785+0000","up_votes":1,"down_votes":0,"body":"If you are doing these things her burst will be non existent since you won't be getting hit by anything so no you haven't been doing this.\n\nAnd Ahri's burst early game was gutted ages ago wtf. Her E-Q-W does like 40% at levels 3-4","replies":[]}]}]}]}]},{"poster":"DiamondAries","date":"2015-11-14T09:25:18.205+0000","up_votes":1,"down_votes":0,"body":"First off, if it is early game, then its the base damage that needs to be knocked back, not the scaling which affects late game.\n\nSecond, I have had no trouble with Ahri at all. Seems like a regular match up, except she always manages to get away before I kill her...","replies":[{"poster":"EquiIibriumm","date":"2015-11-14T09:58:05.553+0000","up_votes":1,"down_votes":0,"body":"yeah, my bad on that. I was pretty salty while making this so...","replies":[{"poster":"Olee","date":"2015-11-14T17:17:34.758+0000","up_votes":1,"down_votes":0,"body":"That explains the flawed logic then lawl.","replies":[]}]}]}]}