{"poster":"SummerDreamx3","date":"2017-04-16T10:02:19.254+0000","title":"Supporterin sucht Mitspieler :)","subforum":"Clans & Teams","up_votes":2,"down_votes":9,"body":"Hallo :)\r\nIch bin Leonie und spiele Main Support und momentan &uuml;be ich als zweite Rolle Adc.\r\n\r\nMein Lieblingssupporter ist {{champion:412}}  und ich spiele noch eine annehmbare {{champion:40}} .\r\nBin gerade dabei mehrere Champs zu testen, Supporter und Adc&#039;s.\r\nDerzeit bin ich Gold V und mir wird &ouml;fter gesagt mit Potential nach oben :D\r\n\r\nIch suche kein festes Team (da ich &ouml;fter mal auch 1-2 Wochen gar nicht spiele) sondern einfach ein paar nette Leute mit denen man ein paar entspannte Normals spielen kann, um Champs zu testen, oder vielleicht auch das ein oder andere Ranked.\r\n\r\nMeldet euch wenn Ihr Lust habt {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Frisk","date":"2017-04-16T11:46:03.505+0000","up_votes":1,"down_votes":1,"body":"Heya ^-^/\nIch wollte demnächst auch ein paar Adc's und n paar Midlaner testen,\nwürde mich freuen wenn ich ab und zu mitspielen kann, da ich meist allein spiele. v.v\n\nEinfach adden: Lv1 Frisk \nArigatou :D","replies":[{"poster":"Ich bin Toxic","date":"2017-04-16T12:11:24.796+0000","up_votes":2,"down_votes":0,"body":"ihh ein weeaboo.. \n**KAPPA**\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Grinser","date":"2017-04-16T12:46:43.825+0000","up_votes":1,"down_votes":1,"body":"hi Leonie, Bin main alles, spiele seid 6 Jahren, aber nie ranked. wollte dann jetzt endlich mal climben. Bin 23 Jahre alt heirate bald und bin selber auch nicht immer da. aber wenn dann lange :) Meld dich dich einfach mal oder adde mich. Grinser","replies":[]},{"poster":"IhleKing","date":"2017-04-16T10:21:13.186+0000","up_votes":1,"down_votes":1,"body":"hi was geht wäre cool zu wissen wie alt du bist sonst können wir gerne mal spielen","replies":[]},{"poster":"boosted by mom","date":"2017-04-16T16:26:36.332+0000","up_votes":1,"down_votes":2,"body":"Hey Leonie, bin 19 Jahre alt, spiele seit Season 4 und bin derzeit Gold III. Fühle mich eigentlich auf jeder Position, außer der des AD Carrys, heimisch, bin aber im Herzen immer Support Main geblieben, da ich mit dieser Position angefangen habe, damals ernsthaft (ranked) zu spielen. Habe diese Season bisher 136W/125L erspielt und treibe aktuell häufig im Jungle und in der Mitte mein Unwesen. Würde mich sehr über einen guten Support als DuoQ Partner freuen, da meine Games oft an autofilled Supports oder generell schlechten Botlanes scheitern. Wäre aber natürlich auch bei Normals dabei :) \n\nMeine ingame ID ist **boosted by mom**, ich habe dich mal geaddet, kannst dich bei Interesse gerne melden. Teamspeak/Skype sind vorhanden. \n\nGL HF \n- D","replies":[]}]}