{"poster":"OccamsTaser","date":"2016-06-09T00:25:46.657+0000","title":"Is there a filter for names?","subforum":"Player Behaviour","up_votes":2,"down_votes":0,"body":"I was just wondering, is there not a filter for when somebody creates a new summoner name?\r\n\r\nI work in IT, so i know regular expressions are hard to execute for names when you factor in all the stuff you can use to obscure a name (using a v for a u, 4 for a, etc). But yesterday i was playing with a guy called &quot;rapist&quot;. No 4&#039;s for a&#039;s or 1&#039;s for i&#039;s. Just literally &quot;rapist&quot;. Lo and behold, this player was also extremely toxic. What a surprise!\r\n\r\nObviously this player got reported and a few minutes later, during the banning phase of the next game, i got a message that the player i reported got penalized.\r\n\r\nSo i though, great, he&#039;ll likely have to change his name and might even get a ban for a few days. But no. I look at his profile, he played 5 more games (he&#039;s playing right now..), and looking at his history, he continued to be a toxic player (buying all tears, just buying mobi boots, you know the type).\r\n\r\nSo how did he get penalized? Did he just get a chat ban? For having a name like &quot;Rapist&quot;?!","replies":[{"poster":"Ninox","date":"2016-06-12T02:25:21.705+0000","up_votes":1,"down_votes":0,"body":"The best thing you can do is to report them in post game under \"Inappropriate Name\" (and any other appropriate category). They will have their name reviewed, and if it is deemed unacceptable (which in this case it would) they will be given a tempname until they change it.\n\nNo name filter can be exhaustive, and I honestly don't know what kind of system Riot has in place, but I do know that _**reported**_ offensive names are handled pretty quickly. If it isn't reported nothing will happen. \n\nA lot of players tend to not notice summ names, play with them turned off, or just assume someone else who cares more will report it, so it's extra important to report names you feel are inappropriate.","replies":[]},{"poster":"Plutooh","date":"2016-06-10T06:54:25.969+0000","up_votes":1,"down_votes":0,"body":"Agreed, anyone with the term 'Rapist' or anything similar needs to be asked to change their name at their expense.\n\nIf they refuse they are banned until they change it.","replies":[]},{"poster":"Spiral Zetsu","date":"2016-06-09T02:00:31.717+0000","up_votes":1,"down_votes":0,"body":"Why should he receive a chat ban for having the name \"Rapist\"?\n\nRape is a crime. Murder is a worse crime.\n\nShould you be chat banned for having \"Murderer\" in your name?\n\nor \"Killer\"? or \"Assassin\"? or \"Hitman\" or \"Cannibal\"? \n\nThink it through.","replies":[{"poster":"WoadKethunt","date":"2016-06-09T11:42:10.777+0000","up_votes":1,"down_votes":0,"body":"now if his name was RectalPenetrator or something like that then maybe","replies":[]}]}]}