{"poster":"Manyula","date":"2015-09-26T09:53:14.849+0000","title":"Unranked to Plat 5 in 39 games AMA","subforum":"Miscellaneous","up_votes":4,"down_votes":1,"body":"6/4 in provisionals, placed silver 3 skipped silver 2, completed silver 1 promotionals for gold 5, got promoted from 60lp and skipped gold 4, from gold 3 i got promoted from 60lp again and skipped gold 2, gold 1 i got promoted from 32 lp to plat 5. \r\n\r\nPlayed Ashe for 22 of the 39 games, going 20 wins, 2 losses. \r\nPlayed Vayne for 15 of the 39 games, going 10 wins, 5 losses.\r\nPlayed Sivir for 1 of the 39 games, going 0 wins, 1 losses. (400ping game)\r\nPlayed Riven for 1 of the 39 games, going 0 wins 1 losses. (Im bad)\r\n\r\nI solo queued for 34 of the 39 games, winning the 5 games I did duo.","replies":[{"poster":"KidConfucius","date":"2015-09-27T14:38:29.890+0000","up_votes":2,"down_votes":0,"body":"Very good winning streak there , especially for all adc games. just curious how with only 6/4 provs and it placed you mid silver?  yet i went 5/5 for this seasons placements , lost a couple games that really ought to have been comfortable wins due to a few afk/dc's  and it dropped me in mid bronze...it literally dropped me over 400 elo from the previous season finish for those 5 placement losses. Seems like the final division/tier destination after placements can be very random...","replies":[{"poster":"Jink","date":"2015-09-29T20:42:14.616+0000","up_votes":1,"down_votes":0,"body":"ELO:\n\n10 provisionals.\n\nEnd result a score out of 100.\n\nReward system integer of ELO (MMR) calculated against 10 - all other players applying an integer calculation with variants such as things like 13 points gained instead of 10 points if the ELO of your enemies totals higher than your own teams as opposed to rewards of say 7 points if your own teams ELO calculations against a baseline 1200 stoic ELO of \"being placed\" add up to more than the enemy teams total ELO -\n\nFor a variant of +13 where you have won a game against a higher total ELO team your next game will probably employ an integer calculation of 13 -10 plus ELO variant of both teams and reward you with a denomination of halfway between 13 and 10s difference (1.5) and then calculate that against its integer of 10 (plus or minus 3 MMR) so if you then win another game of +13 this would place you at 13+(13-10+1.5) /100 and then add a baseline calculation of 13+13+1.5/3 =x and times this by the variant pool of this being your second game of a 10% variant of 100 and then factor you a value of 20x/100x with x being a calculation of the totals of the ELOs of both games, with integer calculations of other players last 10 games (which is why sometimes it takes like 10 seconds or so to see LP gains during placements - a mathematical system that can be dropped once you have played a larger pool of games such as 10 in which case it can revert to stoic gains systems not based off ELO variants and integers but just the variants) and your win/loss ratio will often be less important than which games you won and which games you didn't and with such a system it is quite easy to see two players both with 5 wins and 5 losses being placed as far apart as Bronze 1 and Gold 5 respectively.\n\nThat's probably not the proper way to explain it or the correct maths but that appears to be roughly how ELO is calculated with many factors all relevant to other players, their recent games (though Riot wont specify if this is true or not it appears to be as it takes ages to calculate LP gains in placements and occasionally does outside of placements too) and your recent games and with a lot of maths behind it - 5 wins 5 losses can mean a total of +60 LP or +0 LP depending on how it rewarded/punished you - relevant to enemies rated skill level or your performance in slightly and probably (thought riot wont specify) more assured wins/losses with games it might place you in and make more impactive calculations from (for example if it put you in a free win game and you lost it could punish you very severely and I believe ELO does things like this occasionally too - to help bring about more solid rating calculations).","replies":[]}]},{"poster":"Olee","date":"2015-09-26T22:03:07.772+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Danklight Vayne,realm=OCE,application-id=Ntey9fRZ,discussion-id=30TXUvhk,comment-id=,timestamp=2015-09-26T09:53:14.849+0000)\n\n> Played Sivir for 1 of the 39 games, going 0 wins, 1 losses. (400ping game)\n> Played Riven for 1 of the 39 games, going 0 wins 1 losses. (Im bad)\n\nI laughed quite hard.","replies":[{"poster":"Manyula","date":"2015-09-26T22:51:23.218+0000","up_votes":1,"down_votes":0,"body":"#gottem","replies":[{"poster":"Olee","date":"2015-09-27T01:15:10.467+0000","up_votes":1,"down_votes":0,"body":"100% guaranteed your Riven is better than mine. At least 109629429410298093210 times better, at LEAST.","replies":[]}]}]},{"poster":"hin jai","date":"2015-09-29T17:49:47.560+0000","up_votes":1,"down_votes":0,"body":"give you 2 more days to hit diamond","replies":[{"poster":"Manyula","date":"2015-10-01T12:04:30.751+0000","up_votes":1,"down_votes":0,"body":"I was working ): and idk if I can do it with 60ping. (At Mother's house, house sitting.)","replies":[]}]},{"poster":"ƒamous","date":"2015-09-26T11:27:52.019+0000","up_votes":1,"down_votes":0,"body":"Why is Ashe so strong currently? I don't get it.. I've seen multiple people carry themselves/spam games as Ashe and win every single one. Maybe I should jump on this bandwagon...\n\nEDIT: I just realised it was your op.gg profile I looked at with the multiple wins as Ashe, good job. :~) ","replies":[{"poster":"Manyula","date":"2015-09-26T20:04:19.659+0000","up_votes":1,"down_votes":0,"body":"On my climb I believe I was the ONLY person to play ashe, not once did I verse her, correct me if im mistaken and you can be bothered checking :3 Not many people play her.","replies":[]},{"poster":"JasonWazza","date":"2015-09-26T12:48:32.829+0000","up_votes":1,"down_votes":0,"body":"Juggernaut meta means less gap closers.\n\nLess gap closers = happy ashe.","replies":[{"poster":"Manyula","date":"2015-09-26T20:03:28.974+0000","up_votes":1,"down_votes":0,"body":"It's not even that though, I ran into a lot of olafs. The only thing i could do was use bork or qss and dodge his axes. Every game riven wasnt banned she was picked. Lee sin/yas were also high picks. Olaf has been the only problem.","replies":[]}]}]},{"poster":"GigaPube","date":"2015-09-26T15:52:30.942+0000","up_votes":1,"down_votes":0,"body":"dis some inspirational shit m8. how many afks, feeders, instalockers, trolls, assassin supports did you go through? i dun wanna go through every match :P  but damn thats a good build on dat ashe","replies":[{"poster":"Manyula","date":"2015-09-26T20:01:29.723+0000","up_votes":1,"down_votes":0,"body":"honestly a few, but i won a few 4v5s with the help of my teammates who were understanding of the game. I also lost a 5v4 I think somewhere in there lmao.","replies":[]}]},{"poster":"SorakaXHealBoT","date":"2015-09-26T16:03:20.047+0000","up_votes":1,"down_votes":0,"body":"ADC God. The next Gosu.","replies":[{"poster":"Manyula","date":"2015-09-26T20:00:33.077+0000","up_votes":1,"down_votes":0,"body":"awh shucks, except im a real grill.","replies":[]}]}]}