{"poster":"Anfik","date":"2018-06-21T21:42:56.142+0000","title":"Problema con gli lp","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"ho un problema, nonostante io abbia un buon mmr (nickname: Anfik ) guadagno a win 15/16 lp e a lose -21, ci&ograve; non capisco perche dato che io abbia un buon mmr al massimo dovrebbe essere al contrario, non &egrave; che influisce anche l&#039;honor? perche dato che sono honor 0 ho paura che ci&ograve; influisca ma non ha senso il comportamento di un player con la sua bravura col gioco. attendo risposte","replies":[{"poster":"Trauja","date":"2018-06-22T00:13:05.736+0000","up_votes":1,"down_votes":0,"body":"Nah, niente honor o altre cose, vuol dire che hai un mmr sotto la media della tua divisione","replies":[{"poster":"Anfik","date":"2018-06-22T01:14:56.514+0000","up_votes":1,"down_votes":0,"body":"Ma non credo proprio che io abbia un mmr inferiore alla media dato che in 20 game ne vinco 14 che non è male per un silverino","replies":[{"poster":"Serie di Taylor","date":"2018-06-22T10:09:57.696+0000","up_votes":1,"down_votes":0,"body":"Negli ultimi 20 games hai questa media. Negli ultimi 86 (cioè tutte le rankeds che hai fatto da un mese a questa parte) il w/r è del 50% netto: 43 vinte e 43 perse. \n\nNon ti affidare troppo all' MMR di siti come op.gg! Se vuoi farti un'idea più chiara semplicemente controlla il rank dei tuoi avversari e come sono andate le loro partite di recente (ad esempio, nell'ultima partita, hai giocato contro gente S5/S4 e un B1 il che si giustifica solo con un MMR nella media/basso)!","replies":[]}]}]},{"poster":"HaIIeIujah","date":"2018-06-21T21:46:33.138+0000","up_votes":1,"down_votes":0,"body":"I siti non sono al 100% affidabili. L'honor non ha influenza, ma il vero MMR può essere ben diverso da quello dato, per esempio da Op.GG. Specie all'approcciarsi delel divisioni V.\n\n(Fonte: il sottoscritto povero disgraziato che nonostante qualche giorno fa avesse MMR \"sopra la media\" secondo Op.GG prendeva 15 LP perché DV is suffering.)","replies":[]}]}