{"poster":"SwaggasaurusREKT","date":"2015-05-04T12:00:44.140+0000","title":"PC Shutdown at the end of every Game.","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Okay so I have an issue with League that only started appearing recently (Last 2 days.)\r\n\r\nAfter every game I play, after the Nexus explosion and just before the Victory/Defeat text appears, my PC shuts down and restarts itself. I did a little bit of surfing on the EUW forums and other people have had this similar problem. It&#039;s almost like the computer overheats and shuts itself down to protect itself, however this is not the case as I&#039;ve monitored temperatures throughout the game and nothing out of the ordinary spikes.\r\n\r\nI&#039;ve checked through Windows 7&#039;s Event Viewer and it shows an Error 41 (Shutdown due to either loss of power source or to protect the hardware). This issue only ever occurs at the end of a game, never at the start, or during the game, no matter the length (I played a 22 minute game, which the PC shutdown at the end of, followed by a ~35 minute game and had the same result.)\r\n\r\nThe thread in EUW was unresolved and was unactive for almost 2 years, I&#039;m hoping other people have had this issue in the OCE region and have come to a solution for it. Please! PC specifications are as follows:\r\n\r\nProcessor: Intel(R) Core(TM) i5-3570K CPU @ 3.40GHz\r\nManufacturer: Intel\r\nSpeed: 3.8 GHz\r\nNumber of Cores: 4\r\n\r\nVideo Card: NVIDIA GeForce GTX 650 Ti\r\nManufacturer: NVIDIA\r\nChipset: GeForce GTX 650 Ti\r\nDedicated Memory: 1.0 GB\r\nTotal Memory: 4.0 GB\r\nRAM: 8.2 GB\r\n\r\nOperating System: Microsoft Windows\r\nService Pack: 1\r\nSize\t64 Bit\r\nEdition: Professional","replies":[{"poster":"Dr3aDnAuGhTz","date":"2015-05-08T03:06:07.941+0000","up_votes":2,"down_votes":0,"body":"If it freezes after the game I can relate, happened to me and its pretty much unexplainable.\n\nDouble check to see if its thrown any kernel power failures, might be something hardware wise fucking up slowly.\n\nIf not start doing some investigating and see if anything you have done lately has affected your system files in a negative way. \n","replies":[]},{"poster":"HORSE OF FORCE","date":"2015-05-07T11:22:02.282+0000","up_votes":1,"down_votes":0,"body":"Queer. \n\nAny chance there are updates that you haven't installed yet? Windows might be triggering its automatic shutdown for those because of League's shutdown for some reason.","replies":[]}]}