{"poster":"Soulless Reaper","date":"2016-07-10T01:49:30.871+0000","title":"@YasuoHaters","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":2,"body":"Right to get this started, someone called me a scripter yesterday. Proof of this &quot;RazorGTX: u need better scripts yas..and a new account ;)&quot;\r\n\r\nI have not put his full name because I have not asked for permission to use that and could be very disrespectful. Now to all those Yasuo haters players out there. If a Yasuo 3v1&#039;s you it does not mean he is scripting. A good Yasuo will out play you, a Good Yasuo player will abuse his Dash and Windwall advantages against a Nami, Caitlyn and Xereath. So please do not call a good Yasuo player a scripter cause he simply out skilled you in a 3v1. my KDA was 24/8/3. I was really fed, now that does not mean since I was fed. I was scripting, I simply abused the Xereaths early game lack of damage, roamed and got a few kills to set me up. So please for all you Yasuo haters. Don&#039;t get salty, I agree you can feel cheated if a Yasuo knows how to abuse his mobility. \r\n\r\nThanks, to all my beautiful Yasuo mains, just remember. You&#039;re simply amazing &lt;3 {{champion:157}} {{champion:157}}","replies":[{"poster":"Requiemsfire","date":"2016-07-10T05:25:31.398+0000","up_votes":3,"down_votes":0,"body":"It's ridiculous how much of an advantage yasuo has against ranged champions let alone those who fully rely on skill shots. \nLook at this way, he has an infinite number of dashes amongst a minion wave granting him insane mobility.\nHis flow grants him a shield automatically which just flat out negates damage and generates in combat. \nNo resource whatsoever.\nDouble scaling crit chance making it viable just to build two crit items and then whatever tanky items or sustain items you want.\n\nAnd finally he is one of the few champions that can actually get a kill simply because your minions were coming to lane. \n\nPut it this way, if I play say for example {{champion:26}} it is not just hard to land my stun it becomes an utter freaking miracle to land my stun on a {{champion:157}} because it's even harder to punish him for a mistake that isn't simply overextending. ","replies":[{"poster":"Soulless Reaper","date":"2016-07-10T05:45:53.984+0000","up_votes":3,"down_votes":0,"body":"That is what makes his kit though, He is built like that like an agile Samurai. That makes Yasuo, Yasuo. Without his Dash and Windwall. He'd be just a normal champ with no unique game style. Like many of the champs in League","replies":[{"poster":"Requiemsfire","date":"2016-07-10T05:49:55.323+0000","up_votes":2,"down_votes":0,"body":"The vast majority of champions have a unique styled attuned to them such as {{champion:202}} or {{champion:136}} . I think its flawed to assume there couldn't have been another direction especially with his crit passive or the fact he generates a shield that absorbs all damage dealt to him in a single hit. \n\nHe's a champion designed with counterplay in mind to his opponents but leaving a number of champions without the same options when against him.","replies":[{"poster":"Soulless Reaper","date":"2016-07-10T06:53:18.590+0000","up_votes":1,"down_votes":1,"body":"Recently the champs have been getting unique gamestyle but all the old champs E.G. {{champion:84}} {{champion:39}} {{champion:27}} {{champion:24}}. But recently the champs are more thought out and seem to be designed better","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-10T07:04:17.987+0000","up_votes":1,"down_votes":0,"body":"{{champion:27}} 's gamestyle, is probably the most unique in the whole game. His entire playstyle revolves around killing people by running away... \n\nThats pretty fuckin unique.","replies":[{"poster":"Soulless Reaper","date":"2016-07-10T07:27:21.569+0000","up_votes":1,"down_votes":1,"body":"Ah. uhmm sure... lmfao","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-10T08:10:24.392+0000","up_votes":1,"down_votes":1,"body":"Name me one other champ who's playstyle revolves around running away from the enemy to kill them, and ill admit I'm wrong and he isn't unique.\n\nRemember you said 'unique' not 'complicated' or 'interesting'.","replies":[{"poster":"Soulless Reaper","date":"2016-07-10T08:50:32.242+0000","up_votes":1,"down_votes":1,"body":"{{champion:163}}","replies":[{"poster":"Talon12","date":"2016-07-10T08:51:21.404+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Soulless Reaper,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=00020000000000000000000000000000,timestamp=2016-07-10T08:50:32.242+0000)\n>\n> {{champion:163}}\n\ntrue that","replies":[]}]}]}]}]}]}]},{"poster":"Talon12","date":"2016-07-10T09:54:39.942+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Soulless Reaper,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=00020000,timestamp=2016-07-10T05:45:53.984+0000)\n>\n> That is what makes his kit though, He is built like that like an agile Samurai. That makes Yasuo, Yasuo. Without his Dash and Windwall. He&#x27;d be just a normal champ with no unique game style. Like many of the champs in League\n\nhis e isnt even that strong, yes he can use it multiple times, but unlike every other dash in the game, any form of cc stops it, every other dash (other than the specified ults like mid taliyah dash) finishes the dash before cc is applied, and his e is good for getting into fight, not out.\n\nHis wall also needs perfect timing, people who throw things into the wall when its already there are just idiots who want to complain.\n\nYasuo broken? Cough irelia.\n\nYas has same if not less damage output as any other adc, only difference is he is bloody melee.","replies":[{"poster":"Soulless Reaper","date":"2016-07-11T07:11:49.228+0000","up_votes":2,"down_votes":1,"body":"Amen to that Talon. Just they're Yasuo haters, what can we do.. They don't understand his mechanics","replies":[]},{"poster":"Lord Sesshomaru","date":"2016-07-11T08:25:25.241+0000","up_votes":1,"down_votes":0,"body":"He's melee yes, and his stats reflect that... Melee defensive stats instead of wimpy Ranged stats. So he's basically an ADC with more HP and resistances, with the ability to build 2 offensive items and the rest tanky, not to mention he has more CC than most adc's will ever dream of, and is wind wall blocks all projectiles. (which would be broken as fuck if you gave it to an adc.\n\nYup... melee is the only difference between him and an adc. Good observation.","replies":[{"poster":"Talon12","date":"2016-07-11T09:37:59.775+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=0002000000020001,timestamp=2016-07-11T08:25:25.241+0000)\n>\n> He&#x27;s melee yes, and his stats reflect that... Melee defensive stats instead of wimpy Ranged stats. So he&#x27;s basically an ADC with more HP and resistances, with the ability to build 2 offensive items and the rest tanky, not to mention he has more CC than most adc&#x27;s will ever dream of, and is wind wall blocks all projectiles. (which would be broken as fuck if you gave it to an adc.\n> \n> Yup... melee is the only difference between him and an adc. Good observation.\n\nOH MY GOD 6 ARMOR MORE THAN ALL THE OTHER ADCS SO BROKEN\n\nHOLY SHIT LESS MAX HP THAN ADCS HOW FUCKING BROKEN IS THIS \n\nHOLY FUCKING LORD 350 LES ATTACK RANGE TOO SO FUCKING BROKEN\n\nHOLY SHIT 1%-3% MORE ATTACKSPEED THAN ADCS OH MY FUCKING GOD GG\n\nOH FUCK HERES THE DOOZY 7-10 MORE AD HOLY SHIT AINT THAT BROKEN\n\nOH HELL YEA THIS EVEN MORE BROKEN BY A MILE, I MEAN, REDUCED CRIT DAMAGE!? HOW FUCKING CRAZY! THATS SO BROKEN\n\n> **compared to average stats of adc's**\n\nthere is no real difference, you just want to complain because you can't accept the simple fact he needs more skill than you can muster, its a no brainer, thats why you stopped \"playing\" him, its because you couldn't.","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-11T19:07:01.183+0000","up_votes":1,"down_votes":0,"body":"6 armour is enough man, i only have 6 arour in my runes and it makes hell of a difference.\n\nStopped playing him because i couldn't? What? \n\nI stopped playing him because there was a Yas in every single damn game, and i was bored to fucking death of Yasuo's everywhere!\nSo i played champs that weren't Yasuo.\n\nBut if you want proof:\n\nhttp://imgur.com/KUAwBHO\n\nThis is my first Yasuo game in probably 6-8 months (played a few hours ago, in the spirit of this argument). Wrecked my lane, our team had no tank (hence the loss) so i was pretty much the only initate for my team, and so in a heavily losing game with no tank, against as fed as fuck Elise and Jhin, without building him efficiently, had atrocious CS, I initiated most of the fights and still came out with 2:1 scoring \n\n(my 8th death was when our nexus is 1 hit, and you flash into a 1v5 just for the hell of it, because you're the only one alive and its not like theres anything else you can do.)\n\n\nSo yea obviously that score isn't the best, but after not playing him for 8 months and in a heavily losing game, its not half bad.\nSo if i can do that after 8 months of no practice, how much skill could he really require?","replies":[]}]}]}]},{"poster":"Lord Sesshomaru","date":"2016-07-10T06:52:55.331+0000","up_votes":1,"down_votes":0,"body":"Braum's 'Unbreakabale' is virtually the same ability as Yasuo's Wind Wall, so wind wall is NOT a unique ability anymore.\n\nand with regards to his dash making him an 'Agile Samurai'. Have you seen a proper samurai? They have huge square plates on their shoulders a skirt made of armour that enveloped 3/4 of their body, helmets that make them almost unable to turn their heads with huge crests on the front, two swords with two sheaths on one side of their body, and a giant fucking flag on their back. They are anything but agile. \n\nThis means that if they wanted Yasuo to feel like a 'Samurai' and not have dashes they have many many more options that can be explored.","replies":[{"poster":"Talon12","date":"2016-07-11T13:11:10.869+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=000200000001,timestamp=2016-07-10T06:52:55.331+0000)\n>\n> Braum&#x27;s &#x27;Unbreakabale&#x27; is virtually the same ability as Yasuo&#x27;s Wind Wall, so wind wall is NOT a unique ability anymore.\n> \n> and with regards to his dash making him an &#x27;Agile Samurai&#x27;. Have you seen a proper samurai? They have huge square plates on their shoulders a skirt made of armour that enveloped 3/4 of their body, helmets that make them almost unable to turn their heads with huge crests on the front, two swords with two sheaths on one side of their body, and a giant fucking flag on their back. They are anything but agile. \n> \n> This means that if they wanted Yasuo to feel like a &#x27;Samurai&#x27; and not have dashes they have many many more options that can be explored.\n\nBut he isnt a samurai, he is a ronin, and most ronin lose the armor in favour of lighter freely moving garb, the ronin he was based off didnt wear much armor, he wore simple cloth that allowed him to move freely, in which he won every duel he was wearing it","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-11T18:52:35.744+0000","up_votes":1,"down_votes":0,"body":"Lol. I never said he was a Samurai.. it was OP that said that.\n\nI know he's a Ronin as does everyone else (except OP apparently)\n\nHe was saying that in order to feel samurai-ish he needed his dash, i merely said that samurai's are not so agile, i never said Yas was a samurai.\n\nNotice how i put 'samurai' in quote marks","replies":[]}]}]}]}]},{"poster":"Lord Sesshomaru","date":"2016-07-10T05:11:59.254+0000","up_votes":3,"down_votes":0,"body":"People seriously think that a Yas 3v1ing is scripting? WTF!\n\nYasuo is EXPECTED to 3v1, when you have 100% crit almost no cooldowns and no mana, if you do anything less than a 3v1, you're shit.\n\nXerath has long cooldowns, all his abilities are skillshots, all of his abilities have a huge delay between casting them and actually dealing the damage, he is very mana hungry and completely immobile and his only defence (the stun) is blocked by the wind wall.\n\nNami has long cooldowns, all her abilities also take ages to hit the target, she is squishy as, has NO damage, and is also mana hungry. ALL of her abilities are blocked by the wind wall.\n\nCaitlin's abilites ALSO take a long time to hit you, she is very mana hungry and her main source of damage is blocked by the wind wall, and she quite immobile.\n\nSo what we have here, are 3 champions where ALL their abilities are impossibly easy to dodge if you have dashes, almost all of their damage (and every single defensive ability) is blocked by the wind wall, you are a tankyish melee champion with 100% crit, infinite dashes, virtually no cooldowns, crazy life steal and no mana.  Seriously.. you are fucking EXPECTED to get that triple...","replies":[{"poster":"Soulless Reaper","date":"2016-07-10T05:59:03.471+0000","up_votes":2,"down_votes":1,"body":"Exactly what I said. But no he's Bronze for a reason and can't take a defeat so he calls someone a scripter to make him feel better and think he's good :)","replies":[]}]},{"poster":"Roguestoney","date":"2016-07-12T20:56:17.664+0000","up_votes":2,"down_votes":0,"body":"You 2 finished already?","replies":[]},{"poster":"WoadKethunt","date":"2016-07-10T02:28:57.056+0000","up_votes":2,"down_votes":1,"body":"yasuo\nskill\n\npick one","replies":[{"poster":"Soulless Reaper","date":"2016-07-10T02:30:38.919+0000","up_votes":2,"down_votes":1,"body":"Yasuo takes skill...","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-10T05:22:18.482+0000","up_votes":2,"down_votes":3,"body":"Ahhh ok i see the confusion here!\n\nYou've heard people say \"Yasuo has a **high** skill ceiling\" and thought 'This means i need skill to play my champ'\nbut what it actually means is 'In order to play Yasuo to his **full potential** you need to be very good.' and thats true.\nbut he also has a very very **low** skill floor. which means you can perform **well enough** with Yasuo even if you're quite bad.\n\nThis means that you need to be Faker to play Yasuo to 100% of his potential, but you can be a vegetable and still play him at 95% of his potential. \n\n(You're an AD champion with no mana, infinite dashes, 100% crit, a passive shield, a wall that blocks 70% of the harmful abilities in the game and an ult that OTHER PEOPLE can activate for you.... Look at that, and tell me the champ is going to be hard... come on, that champion basically plays itself.)\n\nAlso before you call me a 'Yasuo Hater' I was a Yas main since the day he came out till quite recently when a more interesting champ came out. and he's still my go-to AD mid laner.","replies":[{"poster":"Talon12","date":"2016-07-10T06:53:54.886+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=000000000000,timestamp=2016-07-10T05:22:18.482+0000)\n>\n> Ahhh ok i see the confusion here!\n> \n> You&#x27;ve heard people say &quot;Yasuo has a **high** skill ceiling&quot; and thought &#x27;This means i need skill to play my champ&#x27;\n> but what it actually means is &#x27;In order to play Yasuo to his **full potential** you need to be very good.&#x27; and thats true.\n> but he also has a very very **low** skill floor. which means you can perform **well enough** with Yasuo even if you&#x27;re quite bad.\n> \n> This means that you need to be Faker to play Yasuo to 100% of his potential, but you can be a vegetable and still play him at 95% of his potential. \n> \n> (You&#x27;re an AD champion with no mana, infinite dashes, 100% crit, a passive shield, a wall that blocks 70% of the harmful abilities in the game and an ult that OTHER PEOPLE can activate for you.... Look at that, and tell me the champ is going to be hard... come on, that champion basically plays itself.)\n> \n> Also before you call me a &#x27;Yasuo Hater&#x27; I was a Yas main since the day he came out till quite recently when a more interesting champ came out. and he&#x27;s still my go-to AD mid laner.\n\ncough cough needs skillfull stop, 43% winrate in plat+ and an average kda of 9/13/7","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-10T07:01:52.088+0000","up_votes":1,"down_votes":0,"body":"Yea.. in plat..\n\nSo helpful that plat is your example when bronze/silver/gold make up the vast majority of the league community aye.\n\nThats like saying \"Ferrari's aren't that expensive\" which is true if you use the 1%'s like Bill gates as your example, but if you look at the rest of the world, suddenly they become a lot more unobtainable.\n\nIts the same with Yasuo, in plat and above (the 1%'s) people are more capable of playing against him. But in the vast majority of players, anyone can built 2 crit items and 3 tank items and just wander around spamming Q until something dies.","replies":[{"poster":"Talon12","date":"2016-07-10T08:50:59.962+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=00000000000000010000,timestamp=2016-07-10T07:01:52.088+0000)\n>\n> Yea.. in plat..\n> \n> So helpful that plat is your example when bronze/silver/gold make up the vast majority of the league community aye.\n> \n> Thats like saying &quot;Ferrari&#x27;s aren&#x27;t that expensive&quot; which is true if you use the 1%&#x27;s like Bill gates as your example, but if you look at the rest of the world, suddenly they become a lot more unobtainable.\n> \n> Its the same with Yasuo, in plat and above (the 1%&#x27;s) people are more capable of playing against him. But in the vast majority of players, anyone can built 2 crit items and 3 tank items and just wander around spamming Q until something dies.\n\nlol please, find me a yasuo from bronze/silver/gold who doesnt feed 80% of games, go on try","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-10T09:28:27.217+0000","up_votes":1,"down_votes":1,"body":"Skt Yasuo, FWU Thaigga, Talon12\n\nDo i get extra points for 3?\n\nAnd just to mix it up i got you a lvl 7 Yas a lvl 6 Yas and a lvl 5 Yas in that line up (not that its relevant to this argument, but might as well mix it up)\n\ntook me all of 3 mins.","replies":[{"poster":"Requiemsfire","date":"2016-07-10T10:20:50.289+0000","up_votes":2,"down_votes":0,"body":"According to league of graphs statistically Yas does pretty well in diamond and platinum especially since despite his 18% popularity as a pick his win rate remains 49% across all roles. \n\nhttp://www.leagueofgraphs.com/champions/stats/yasuo/diamond","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-10T11:00:12.250+0000","up_votes":1,"down_votes":0,"body":"Perfect! point proven!","replies":[{"poster":"Talon12","date":"2016-07-11T13:22:46.522+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=000000000000000100000000000000000000,timestamp=2016-07-10T11:00:12.250+0000)\n>\n> Perfect! point proven!\n\nProves nothing but the fact three idiots with no armor thought it would be funny to fight a fed yasuo","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-11T18:24:53.512+0000","up_votes":1,"down_votes":0,"body":"How, in any way, does that relate to what i said, and the point i was making?","replies":[{"poster":"Soulless Reaper","date":"2016-07-12T02:18:58.649+0000","up_votes":1,"down_votes":0,"body":"I didn't make this post for kids to start arguing @Lord Sesshomaru","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-12T03:36:01.969+0000","up_votes":1,"down_votes":0,"body":"And the twin towers weren't made to be flown into, but when you build something like that (or mention a champ most of the population has a problem with) it generally attracts the wrong attention.\n\nThats just a given.\n\nPlus it takes two to argue @Soulless Reaper","replies":[]}]}]}]},{"poster":"Requiemsfire","date":"2016-07-11T13:47:02.990+0000","up_votes":1,"down_votes":0,"body":"I think it takes a lot more than statistics to single handedly prove a point however it's apparent to me Yasuo is quite overloaded.\n\nThe ability to dash once per target within a given duration, low cooldowns on abilities, hard CC which in contrast allows him to directly apply his ultimate which deals high amounts of damage which causes Yasuo to specifically ignore armour. He also gains a shield which can negate a large portion of damage once while also scaling twice as much in crit as any champion allowing him always to maintain a degree of relevancy simply because his high power curves. He has a strong early game and scales very well into late game. \n\nThat while Yasuo's weakness being in the form of crowd control does exist and that because of that he is weak against some match ups like {{champion:39}} and {{champion:90}} a huge portion of stuns and snares and even some slows exist as ranged skillshots which is countered by Yasuo's wind wall. \n\n\nFinally, survivability isn't just a measurement of said Yasuo skill but actually also a test of whether or not the player is good in general because a good portion of people can pick up Yasuo and play him a few times and already make \"good plays\" with him just by understanding the basic fundamentals of Yasuo's kit.","replies":[]}]}]}]},{"poster":"Requiemsfire","date":"2016-07-13T17:13:19.434+0000","up_votes":1,"down_votes":0,"body":"Problem with your argument is that if most Yasuo's do in fact feed in the majority of the games they play then his winrate should theoretically much lower but that's simply not true.  You're trying to redirect the point towards the skill of an actual player as if it actually reflects the strength of a champion which is an argumentative fallacy given the statistics and how strong Yasuo actually is.  Personally I wouldn't go around pretending that overextending, misplaying and being killed for a too early of an engage is a reflection of Yasuo's abilities as it actually a reflection of a player's skills and map awareness in general.","replies":[]}]}]}]},{"poster":"Soulless Reaper","date":"2016-07-10T05:57:17.658+0000","up_votes":2,"down_votes":1,"body":"Yasuo takes skill.. No one can just pick Yasuo and expect to understand his mechanics, he has a lot of combo's different mechanics. If you wanna learn champs straight off without any skill and understand their mechanics from level 3 and onwards. Take {{champion:92}} {{champion:11}}. They are perfect examples of non skilled champs :)","replies":[{"poster":"xXAntiMatterXx","date":"2016-07-10T09:56:28.421+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Soulless Reaper,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=0000000000000000,timestamp=2016-07-10T05:57:17.658+0000)\n>\n> Yasuo takes skill.. No one can just pick Yasuo and expect to understand his mechanics, he has a lot of combo&#x27;s different mechanics. If you wanna learn champs straight off without any skill and understand their mechanics from level 3 and onwards. Take {{champion:92}} {{champion:11}}. They are perfect examples of non skilled champs :)\n\nYou are calling yas a skill champ and riven a no skill champ, what is this world comming to","replies":[{"poster":"Talon12","date":"2016-07-11T08:35:13.248+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xXAntiMatterXx,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=00000000000000000002,timestamp=2016-07-10T09:56:28.421+0000)\n>\n> You are calling yas a skill champ and riven a no skill champ, what is this world comming to\n\nno, i do agree with you here, yes riven does need skill, but unlike yasuo, she has much more room for error, seeing as she had spells with low cd, a shield thats 800+ on a 3.6 sec cd, and multiple forms of no miss cc, but to play her well you do need skill for animation canceling.\n\nYasuo is in a similar boat, yes even the worst players can use him, but unlike using riven or zed they will do absolutely nothing but press r if they have a knockup and then proceed to die after doing nothing.","replies":[{"poster":"Requiemsfire","date":"2016-07-13T17:25:40.618+0000","up_votes":1,"down_votes":0,"body":"The key difference between Riven and Yasuo is that if you pick Riven you have to snowball. She is the literal definition of a feast of famine champion where you are rather useless if you're not ahead but if you pick yasuo you scale rather well compared to most laners regardless of how fed you become as long as you CS properly.\n\nIf you pick Riven you literally run the risk of not snowballing and in fact providing nothing for your team except for being a possibly major burden or your snowball and dominate till mid to late game and while not to say that the champion is bad I personally would not pick a Riven unless I really wanted to played her because she is not necessarily an ideal candidate. \n\nAnother thing is that even if Yasuo fell behind he could still scale well into mid game simply because he will most likely reach 100% crit before anyone else and will still be able to deal a lot of damage to a squishy of a given type. His ultimate allows him to fit into team compositions with champions such as malphite, Janna, Rek'sai, Alistar, Nautilus, Velkoz, Xin Zhao, etc whose knock up is much easier to land if you're struggling would be able to uplift the restriction on his ultimate basically suspending them in mid air for a whole second more and dealing heavy damage. ","replies":[]}]}]},{"poster":"Lord Sesshomaru","date":"2016-07-10T06:27:51.957+0000","up_votes":1,"down_votes":2,"body":"Like i said, Yasuo takes skill to play him very well, but to play him just averagely well takes very very little skill.\n\nThe main thing that makes Yasuo more difficult to play is controlling his dash, so lets remove that dash for a minute, \nALL of his other abilities require no skill at all: You place W so you take no damage, spam Q on your enemy until you get a hurricane, hit something with the hurricane, press R and repeat. Thats like Garen level mechanics.\n\nRiven is the same as Yasuo, High skill ceiling (not as high as Yas but higher than many other champs) and very low skill floor, \nTop tier Riven players destroy lanes with animation cancelling and all that, where first time Rivens just press all her buttons in whatever order they want and still do well.\n\nYasuo is an AD champ with 100% crit. get that in your head! No matter what his kit is he will ALWAYS be viable even to first time players.\n\nbecause if you had a Yasuo and an Annie in a room and both players took their hands off the keyboard, Yasuo would win. Thats just a fact, and he would win against ALL AP champs ALL tanks, ALL supports, and Most AD champions.\n\nso if your champ needs so much kill to play, how come can 1v1 almost any champ in the game WITH NO ONE PLAYING HIM!\n\nThis means that before we even think about his abilities, he ALREADY is at an advantage over the other champs.","replies":[{"poster":"Soulless Reaper","date":"2016-07-10T07:08:17.396+0000","up_votes":2,"down_votes":1,"body":"> because if you had a Yasuo and an Annie in a room and both players took their hands off the keyboard, Yasuo would win. Thats just a fact, and he would win against ALL AP champs ALL tanks, ALL supports, and Most AD champions.\n\n\nWell yea.......................... That's obvious, AD is sustain to basic attacks. AP is Burst with abiltys not basic attacks. Every single AD champion would win in a basic attack room... That's a little obvious so really your argument is invalid... Of course Yasuo would win against most, because he has crit. So what? But you don't walk up to someone and basic attack them, that is not how the game is developed","replies":[{"poster":"Talon12","date":"2016-07-11T13:17:43.508+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Soulless Reaper,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=000000000000000000010000,timestamp=2016-07-10T07:08:17.396+0000)\n>\n> Well yea.......................... That&#x27;s obvious, AD is sustain to basic attacks. AP is Burst with abiltys not basic attacks. Every single AD champion would win in a basic attack room... That&#x27;s a little obvious so really your argument is invalid... Of course Yasuo would win against most, because he has crit. So what? But you don&#x27;t walk up to someone and basic attack them, that is not how the game is developed\n\nAll the adcs would win a rightclick fight with yas easy, they are the same thing but ranged and better base everything","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-11T18:43:46.295+0000","up_votes":1,"down_votes":0,"body":"Better base everything? Really?\n\nYou are so delusional about Yasuo mate...\n\n\n\n**Ashe lvl 18:**\nHealth - 1871\nRegen - 14.8\nRanged - 600\nDamage - 95\nAS - 0.658\nArmour - 79\nMR - 30\nMS - 325\n\n**Lucian lvl 18:**\nHealth - 1914\nRegen - 17.2\nRanged - 500\nDamage - 98\nAS - 0.638\nArmour - 75\nMR - 30\nMS - 335\n\n**Ezreal lvl 18:**\nHealth - 1844\nRegen - 15.8\nRanged - 550\nDamage - 97\nAS - 0.625\nArmour - 81.4\nMR - 30\nMS - 325\n\n**Yasuo lvl 18:**\nHealth - 1912\nRegen - 21.8\nMelee - 175\nDamage - 110\nAS - 0.658\nArmour - 82.5\nMR - 30\nMS - 345\n\nHere we have Yasuo, the poster girl for ADC, and two of the current favourites.\nSo from what i can see.. Yasuo wins in every category except range (except Lucian has 2 more HP than he does).\nand its not like he has a shield or anything to block the first attack or two while he walks up to them aye..\n\nSo how again do ADC's have better base everything?\nJust accept it man.","replies":[{"poster":"Talon12","date":"2016-07-12T02:16:36.747+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=00000000000000000001000000010000,timestamp=2016-07-11T18:43:46.295+0000)\n>\n> Better base everything? Really?\n> \n> You are so delusional about Yasuo mate...\n> \n> \n> \n> **Ashe lvl 18:**\n> Health - 1871\n> Regen - 14.8\n> Ranged - 600\n> Damage - 95\n> AS - 0.658\n> Armour - 79\n> MR - 30\n> MS - 325\n> \n> **Lucian lvl 18:**\n> Health - 1914\n> Regen - 17.2\n> Ranged - 500\n> Damage - 98\n> AS - 0.638\n> Armour - 75\n> MR - 30\n> MS - 335\n> \n> **Ezreal lvl 18:**\n> Health - 1844\n> Regen - 15.8\n> Ranged - 550\n> Damage - 97\n> AS - 0.625\n> Armour - 81.4\n> MR - 30\n> MS - 325\n> \n> **Yasuo lvl 18:**\n> Health - 1912\n> Regen - 21.8\n> Melee - 175\n> Damage - 110\n> AS - 0.658\n> Armour - 82.5\n> MR - 30\n> MS - 345\n> \n> Here we have Yasuo, the poster girl for ADC, and two of the current favourites.\n> So from what i can see.. Yasuo wins in every category except range (except Lucian has 2 more HP than he does).\n> and its not like he has a shield or anything to block the first attack or two while he walks up to them aye..\n> \n> So how again do ADC&#x27;s have better base everything?\n> Just accept it man.\n\nmaybe you're blind, maybe deaf, maybe even both AVERAGE ADC STATS, not the three squishiest adcs.","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-12T04:16:31.993+0000","up_votes":1,"down_votes":0,"body":"Deaf? Reading doesn't require hearing...\n\nIn any case the average stats of ADC's are still less than Yasuo's\n\nADC:\nHP average - 1924\n\nArmour average - 78.8\n\nMR average - 30\n\nAD average - 96.6\n\nYasuo:\nHP - 1912\n\nArmour - 82.5\n\nMR - 30\n\nAD - 110\n\nSo apart from having 12 more HP on Average, their stats are LOWER than Yasuo's \nbut 4 extra armour on 1912 is equivalent to 76 extra HP.\nWhich means, Yasuo's Stats are BETTER than the average stats of ADC's","replies":[{"poster":"Talon12","date":"2016-07-12T06:24:04.842+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=0000000000000000000100000001000000000000,timestamp=2016-07-12T04:16:31.993+0000)\n>\n> Deaf? Reading doesn&#x27;t require hearing...\n> \n> In any case the average stats of ADC&#x27;s are still less than Yasuo&#x27;s\n> \n> ADC:\n> HP average - 1924\n> \n> Armour average - 78.8\n> \n> MR average - 30\n> \n> AD average - 96.6\n> \n> Yasuo:\n> HP - 1912\n> \n> Armour - 82.5\n> \n> MR - 30\n> \n> AD - 110\n> \n> So apart from having 12 more HP on Average, their stats are LOWER than Yasuo&#x27;s \n> but 4 extra armour on 1912 is equivalent to 76 extra HP.\n> Which means, Yasuo&#x27;s Stats are BETTER than the average stats of ADC&#x27;s\n\ngood for you, armor's value decreases the more there is of it anyway, youre not calculating armor from 0","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-12T08:08:28.360+0000","up_votes":1,"down_votes":0,"body":"No its not good for me, its just bad for your argument.\n\nYasuo never gets enough armour for 4 armour to be worth less than 12 HP\n\nso any way you choose to do the maths, Yasuo still comes out on top.","replies":[{"poster":"Requiemsfire","date":"2016-07-13T17:21:19.356+0000","up_votes":1,"down_votes":0,"body":"I'm gonna put this in terms of effective health\n\nAccording to the wiki \n\"A unit with 60 armor has 60% more of its maximum health in effective health, so if the unit has 1000 maximum health, it will take 1600 physical damage to kill it.\"\n\nAverage adc according to stats above: 1924 x 1.788 = 3440.112 effective health\nBase yasuo according to stats above:   1924x 1.825= 3489.4 effecitve health\n\nOf course then you factor in his shield and there's a significant difference in actual health considering it blocks like 500 damage. \n\nBut if you wanna talk about who would win in a 1v1, Should really be Yasuo most of the time I reckon especially mid game.","replies":[]}]}]}]}]}]}]},{"poster":"Lord Sesshomaru","date":"2016-07-11T01:53:14.120+0000","up_votes":1,"down_votes":0,"body":"Actually.. most AD champs DO just walk up (or jump up) and basic attack things (Yi, Udyr, Ashe, Jax, Nasus, Twitch, MF (pretty much all ADC's)) Revolve around walking and auto attacking, so.. yea.. that is a big factor of how the game is developed, and Yas just dashes instead of walks (which is faster i might add)\n\nMy point is, that during a fight, you auto attack the enemy at some point right? (if not, then you're clearly wasting an AD champion) and when you do, (probably when Q is on coodlown) Yasuo does all the work, he does what like 400/500 ish damage per attack maybe more? And thats not _you_ doing the damage, its Yasuo being controlled by the computer to swing his sword without you (the player) having to do anything, until your Q is back off cooldown (or you dash to another target to avoid a skillshot) \n\nso all the time between aiming abilities, the computer is helping you out.\n\nMages dont have any of their damage controlled by the computer, the player has to aim every ability.\nYas has to aim 3 abilities, and the computer gets to deal damage as quick as it can when you arent aiming them.\nMages have to aim 4 abilities, and the computer doesn't help at all.\n\nAD champions always have en advantage over AP champions because they are aided by the computer. \n(im not saying AP champions are weaker than AD ones, I'm saying they have a disadvantage.)","replies":[{"poster":"Talon12","date":"2016-07-11T13:24:19.880+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=FjGAIbRv,discussion-id=vMn1azOy,comment-id=0000000000000000000100000000,timestamp=2016-07-11T01:53:14.120+0000)\n>\n> Actually.. most AD champs DO just walk up (or jump up) and basic attack things (Yi, Udyr, Ashe, Jax, Nasus, Twitch, MF (pretty much all ADC&#x27;s)) Revolve around walking and auto attacking, so.. yea.. that is a big factor of how the game is developed, and Yas just dashes instead of walks (which is faster i might add)\n> \n> My point is, that during a fight, you auto attack the enemy at some point right? (if not, then you&#x27;re clearly wasting an AD champion) and when you do, (probably when Q is on coodlown) Yasuo does all the work, he does what like 400/500 ish damage per attack maybe more? And thats not _you_ doing the damage, its Yasuo being controlled by the computer to swing his sword without you (the player) having to do anything, until your Q is back off cooldown (or you dash to another target to avoid a skillshot) \n> \n> so all the time between aiming abilities, the computer is helping you out.\n> \n> Mages dont have any of their damage controlled by the computer, the player has to aim every ability.\n> Yas has to aim 3 abilities, and the computer gets to deal damage as quick as it can when you arent aiming them.\n> Mages have to aim 4 abilities, and the computer doesn&#x27;t help at all.\n> \n> AD champions always have en advantage over AP champions because they are aided by the computer. \n> (im not saying AP champions are weaker than AD ones, I&#x27;m saying they have a disadvantage.)\n\nOh no 400 damage. Others do 800+","replies":[]}]}]}]}]}]}]}]}]}