{"poster":"35denKcYNj","date":"2016-09-10T18:52:33.650+0000","title":"Do you NEVER forfeit? Even in normals? Why?","subforum":"Gameplay","up_votes":75,"down_votes":15,"body":"It&#039;s 25-2, every lane is 3 items behind, our top laner afk&#039;d .. enemy team doesn&#039;t want to push base, instead drag it out.\r\n\r\nSurrender vote failed 3-2\r\n\r\n\r\nEveryone is flaming, not having fun. Why don&#039;t you surrender? what is the mindset you have? is the .00001% chance you have winning mean that much to you? \r\n\r\nthis is 100% out of curiosity, for those people who never surrender in any circumstance.","replies":[{"poster":"Timethief49","date":"2016-09-10T18:54:23.518+0000","up_votes":35,"down_votes":5,"body":"I want to win and I have Seen so crazy throws you won't believe it","replies":[{"poster":"Handy Sandy ","date":"2016-09-10T18:55:09.018+0000","up_votes":3,"down_votes":63,"body":"> [{quoted}](name=Timethief49,realm=EUW,application-id=3ErqAdtq,discussion-id=9Ywfutat,comment-id=0000,timestamp=2016-09-10T18:54:23.518+0000)\n>\n> I want to win and I have Seen so crazy throws you won&#x27;t believe it\n\nThen you don't deserve the win, and next round you're getting matched with better and better people that deserve to win.","replies":[{"poster":"MacDeath","date":"2016-09-10T18:58:55.977+0000","up_votes":52,"down_votes":0,"body":"> [{quoted}](name=ChromaSpell,realm=NA,application-id=3ErqAdtq,discussion-id=9Ywfutat,comment-id=00000000,timestamp=2016-09-10T18:55:09.018+0000)\n>\n> Then you don&#x27;t deserve the win,\n\nWtf how do you want to determine who \"deserves\" to win?\nSeriously how?!","replies":[]},{"poster":"Timethief49","date":"2016-09-10T19:12:48.229+0000","up_votes":36,"down_votes":0,"body":"So if people Start getting cocky while I play Safe and stay concentrated I don't deserve the win? K then","replies":[{"poster":"Rew711","date":"2016-09-11T13:01:32.441+0000","up_votes":1,"down_votes":2,"body":"Its not you that doesn't deserve the win, its just those that don't play it safe every once in a while. \n\nBut if the rest of your team is actually fighting while you sit back and watch.... then that's different. You can't just sit back and hope your team can 4v5 a victory, you are going to need to deal some damage and try and help protect teammates.","replies":[{"poster":"Timethief49","date":"2016-09-11T14:22:26.346+0000","up_votes":2,"down_votes":0,"body":"yeah with concentrating and playing safe i mean staying in base\n{{sticker:zombie-brand-facepalm}}","replies":[]}]}]},{"poster":"Astôlfo","date":"2016-09-10T19:23:03.236+0000","up_votes":5,"down_votes":0,"body":"Why wouldn't he deserve the win?","replies":[{"poster":"Handy Sandy ","date":"2016-09-10T19:49:56.262+0000","up_votes":1,"down_votes":19,"body":"> [{quoted}](name=nep2une,realm=NA,application-id=3ErqAdtq,discussion-id=9Ywfutat,comment-id=000000000003,timestamp=2016-09-10T19:23:03.236+0000)\n>\n> Why wouldn&#x27;t he deserve the win?\n\nIf your team has 2 kills while the enemy team is like 5 levels ahead and has 30 something kills with all towers standing and troll surrenders you don't deserve that win, and shouldn't be matched with people that are better than that.","replies":[{"poster":"JediSenpaiNP","date":"2016-09-10T23:03:08.806+0000","up_votes":13,"down_votes":1,"body":"Enemy team complete early game oriented, your team complete late game oriented. For not winning the early game, but managing to stall until the late game means i deserve to lose? oh, ok, i didn't know late game champions were designed for early game, good stuff.","replies":[]}]}]}]},{"poster":"Pikmints","date":"2016-09-10T21:27:24.336+0000","up_votes":2,"down_votes":0,"body":"I had that mentality about 2 seasons ago, then my tolerance for people in this community dropped ala the \"everyone is flaming\" in the original post. I still force myself to click against surrenders in ranked games, but now the game can get so frustrating that I can't justify the anguish my teammates can provoke in the other modes.\n\nI've won off of someone on the enemy team spontaneously disconnecting late game, I've won off Baron throws, I've won off a teammate backdooring through 3 turrets because we stopped backs while their map awareness was a little too late. I understand that these didn't happen much, but it's become common now for our team's premade Ezreal to ping our jungler non-stop to gank from level 3 onward, our mid lane Heimerdinger thinks he should be camped by our jungler because he uses his turrets as a fall back defense rather than a safe harassing spot, and our top lane 0-3 Nasus has less than 100 stacks at 25 minutes as he's waveclearing with his E and slowing anyone that comes near him because he doesn't need mana.\n\nI used to play this game like there was always hope to win, while I know that there is always still a chance for me to win, hope is much more difficult a word to use.","replies":[{"poster":"Timethief49","date":"2016-09-10T21:30:10.046+0000","up_votes":2,"down_votes":0,"body":"i guess im too lazy to press the surrender button too ^^. but in all honesty when i play league im chilled cause its a game to me. if i would get enraged i wouldnt play it","replies":[]}]}]},{"poster":"Kokiri Star","date":"2016-09-10T19:01:36.723+0000","up_votes":25,"down_votes":0,"body":"why waste time, i'drather start up another game","replies":[{"poster":"Gary B Enkelis","date":"2016-09-10T19:33:47.092+0000","up_votes":3,"down_votes":8,"body":"As someone has said, they may not have time to play another game.","replies":[{"poster":"Drahcir","date":"2016-09-11T06:00:21.283+0000","up_votes":9,"down_votes":0,"body":"yet they have the time to drag out the game they're in?","replies":[]},{"poster":"Mast3rShake","date":"2016-09-11T04:38:20.012+0000","up_votes":4,"down_votes":0,"body":"That makes no sense, because if they do come back in win it will take late late late late game to happen, usually another 20-30 minutes and no one wants to play for another half hour just in case you might in","replies":[]}]}]},{"poster":"JustMyBassCannon","date":"2016-09-10T19:32:26.951+0000","up_votes":23,"down_votes":1,"body":"It depends on the game.\n\nIf most of us are doing alright, but that one idiot feeding top is starting a surrender vote at 20 minutes because they don't want to step the fuck up, I say no. They deserve to live out a lost game, no escape.\n\nIf we're *all* having a relatively terrible game (or if I happen to be the one dragging us down), and *someone else* starts a surrender vote, I'll accept it.","replies":[]},{"poster":"ThePartyLeader","date":"2016-09-10T20:26:31.544+0000","up_votes":22,"down_votes":3,"body":"If you go 0-6-0 in lane and flame someone else I vote no just so you can wallow in your own filth a bit.\nI can't stand people who as soon they have less than a 60% chance at winning they just full tilt and stop caring saying gg surrender at 20. If you wasted my time I'm waisting yours. Only difference is I can still have fun while losing.","replies":[{"poster":"Junkο","date":"2016-09-11T08:14:24.208+0000","up_votes":3,"down_votes":4,"body":"Why? In the end you are only wasting your own time. The flamer will most likely never meet a person like you again, and you will never meet that flamer again. So in the end every time you have a flamer you just waste more and more of your time for no reason.","replies":[{"poster":"Great Ozymandius","date":"2016-09-11T16:18:30.420+0000","up_votes":4,"down_votes":0,"body":"This entire game is a waste of time.  People enjoy lol so they waste their time playing lol.  Sometimes they enjoy winning.  Sometimes they enjoy making dicks suffer.","replies":[]}]}]},{"poster":"Lao Fu the Tiger","date":"2016-09-10T23:19:19.717+0000","up_votes":13,"down_votes":0,"body":"For me, like others have said, it's all about practice.\n\nWhat I learned over the years playing chess with a group of guys was that you don't learn all that much when you're ahead. You learn most when you're behind. It's all about mindset, and this applies to almost every single aspect in life.\n\nHere are three every day random examples:\n\n1. **Chess:** If you're leagues ahead of the other person and already have their queen and both of their rooks, who really cares if you lose your rook to their pawn? You have so many more pieces on the board that it doesn't matter.\n\n2. **Money management:** If you're on your own paying rent, bills, and food, but you have a bank account worth $100,000, taking care of yourself is no sweat. Accidentally run late on a payment and have some extra fees? No problem. Want to throw away money on a dying stock? That's okay. On the other hand, if you live paycheck to paycheck, you'll sure be better at managing a budget in order to manage resources.\n\n3. **Studying:** If you already know the material in a class, studying may not be important. However, you won't learn good study habits either. On the flip side, if you struggle to understand a subject, developing good study strategies will be necessary for success.\n\nAll of these ultimately improve your abilities, but they require work. League is no different. It's not whether you win that game of chess or keep in the black or pass the test. Struggling actually teaches you strategies to survive in the long run, even if it means failing in the short run.","replies":[]},{"poster":"LatetotheRace","date":"2016-09-10T23:59:40.966+0000","up_votes":11,"down_votes":1,"body":"\" .00001% chance\" So you're saying there's a chance...","replies":[{"poster":"Mordepool","date":"2016-09-11T00:36:13.305+0000","up_votes":10,"down_votes":1,"body":"Never Tell me the Odds!!!!","replies":[]}]},{"poster":"Netherlife","date":"2016-09-10T19:47:11.435+0000","up_votes":10,"down_votes":1,"body":"I personally, *very* rarely surrender.  I will _**always**_ decline a surrender vote initiated by a toxic and/or afk player.  I also have seen too many throws happen to just give up easily.  But I'm not unreasonable, if someone that hasn't caused any trouble throughout the game asks me to please accept, then I will... most of the time. The thing I really like to do when playing an obviously lost game, is practice playing while behind.   Work on making some progress on something while staying safe and not giving the enemy more of a lead.  I mean if the game is already lost, that's the perfect situation for self practice.\n\nOften times I will just hit decline and let the rest of the team choose if they want to surrender or keep going.  I leave the power to continue or end a game to someone else.","replies":[]},{"poster":"ChaosThief","date":"2016-09-10T21:15:36.181+0000","up_votes":7,"down_votes":0,"body":"I just don't want to go into a game and say \"hey you know what I'm losing, next game!\" I'd rather stick it out. Even against opponents who are wildly better than you, there's still a lot to learn simply by playing against them and watching what they do. \n\nIt's more of the first reason though for me. I can't just say \"this game is over\" I want to see it over and not just call it early.","replies":[]},{"poster":"Eedat","date":"2016-09-10T23:08:31.425+0000","up_votes":6,"down_votes":2,"body":"http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2284563497/209139549?tab=overview\n\nbecause games like these","replies":[{"poster":"rtbf76109271","date":"2016-09-11T02:01:28.492+0000","up_votes":8,"down_votes":1,"body":"While thats amazing, it's just not worth the time and effort in normals for me. Since 999 times out of 1000 you just lose 15 minutes later than if you gg out. In ranked sure go till nexus is down but never in norms. Fuck that","replies":[]}]},{"poster":"Whashifuk","date":"2016-09-11T08:27:04.658+0000","up_votes":4,"down_votes":0,"body":"Because if you never learn to play a game when your team is behind you'll never get any better at coming back.","replies":[]},{"poster":"Astôlfo","date":"2016-09-10T18:56:28.623+0000","up_votes":5,"down_votes":1,"body":"I'm the person that'd just go with the majority. I wouldn't break a tie.\nBut if it was 3-1, then I'd vote yes, for the sake of the 3 over the 1.\nIf it's 2-2, I'd just leave it be.\n\nHowever, if people were just voting for surrender because of no actual good reason in a perfectly winnable game, then I'd probably refuse it and try to play it out longer if there were player(s) on our team who were doing well enough to potentially carry.","replies":[]},{"poster":"helioseismologis","date":"2016-09-11T16:50:54.453+0000","up_votes":3,"down_votes":0,"body":"I used to never surrender back in DOTA1 and the first few years of LoL, but the past couple years the quality of the player base has become worse, overall. More raging, less teamwork, more idiots, etc. Makes it hard to want to keep playing when you know your team has lost control of itself. \n\nThat said, run with a few rules regarding surrender:\n\n1: I do everything I can to avoid surrendering a ranked match. You're there to compete and test yourself, don't surrender except in the most dire of situations.\n\n2: In normals I will initiate a surrender when it's obvious we are outmatched; whether in skill, farm, or just teamwork.\n\n3: If I'm feeding or having a bad match, I'll apologize and let everyone know that I'll try my best but that since it's my fault I will agree to any surrender the team decides upon but that I won't initiate the surrender. If it's my fault we're losing, I don't have a right to end the game early or tell other players what to do. \n\nBasically, my opinion is that if you try to keep playing a lost cause, especially in normals, you're wasting your time. If the first 20 minutes of the game are easily the most important part of the game, I'd rather play two 20 minute surrenders for the early game practice than one 40 minute shit fest. Ultimately though, if someone is feeding or causing the team to fall behind, that person has no right to an opinion. Either stay and fight because your team is trying to carry you and thinks they can win despite your screw ups, or your team sees no path to victory and wants to end it because of your screw up. \n\nI rarely rage, even when losing I have a pretty calm attitude, but I'll be damned if some moron that went 0-10 mid who refuses to surrender doesn't tilt me a little.","replies":[]},{"poster":"statelesskiller","date":"2016-09-11T10:30:07.419+0000","up_votes":3,"down_votes":0,"body":"http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2287268344/218999933?tab=overview\n\nbecause of games like this. 9.4K GOLD DEFICIT. i won this game by tilting the fuck out of there team. jinx was at one point 4 and 0. she was getting cocky. spam laughing and emoting. so i made it my mission to kill her everytime i see her. every. single. time. no hesitation. and everytime i danced on her corpse in clear view of draven or her buddy velkoz spamming my emote. i started saying random lines consisting of bad bear puns in all chat\n\ni won this game by sheer raw determination. and good playing. i won my lane. there vlad was fucking useless the entire game. and then i murdered everyone on there team\n\ni tilted the fuck out of everyone on there team. one time there fucking velkoz ulted me. i walked straight up to him through the ult and started to dance in it while flashing my mastery 6. didnt even hurt him. he didnt even proc my passive. and then i fucking murdered his jinx because i dont give a shit about no squid monster\n\ni focused on murdering there carries while my wukong focused on protecting my backline. q ghost righteouse glory. i sprinted past all there peel. once vi was inevitably dead from a 4 man focus i AT LEAST killed jinx or draven and now i got backup from my team mates. slowly ground down the enemy team and won the fucking game.\n\nkeep in mind. we lost everything. we lost nexus turrets. this was the WORST case scenario. this game will go down as to my hardest carry that i have every performed for awhile. and im going to use as a example as to why you never surrender","replies":[]},{"poster":"Nixtarma","date":"2016-09-11T03:04:02.895+0000","up_votes":4,"down_votes":1,"body":"I surrender very rarely, but I have a code. It is about honor, and values. I want to be persistent, and to face adversity to the end. With that in mind I have these requirements which must be met for me to surrender:\n1. Tower Clause: At least one enemy tower must be destroyed in every lane.\n2. Perfection Clause: There can be no enemy with no deaths.\n3. Contribution Clause: The least important of the three so far. I want to have an even KDA. If I am the reason we are losing, then I need to learn to play better, and then is the best time to start. If the other two are met, then I will surrender, though.\n4. Revenge Clause: If we are losing because a player is being toxic and horrible, or one becomes toxic and horrible as we lose, and he tries to get us to surrender, I refuse his demands on principle.\n\nHope this helps!","replies":[]},{"poster":"Swiftstrike4","date":"2016-09-10T21:48:34.295+0000","up_votes":4,"down_votes":1,"body":"I only surrender if someone has quit/dc'd or AFK'd or if I am playing with a friend and they don't want to continue playing.\n\nLearning how to play from behind is important in league. It largely separates the players who stay in silver and bronze from those who achieve Gold or higher. Though in extremely high Elo, most players know how to push their leads and comebacks become less common (high diamond).\n\nFor normals it allows you to practice mechanics if you are playing with a new champion. Sometimes I rather keep playing in a game that I am losing because I rather play as a level 11 {{champion:114}}  or {{champion:105}}  or whatever champion, with some items more skills to figure out the strengths of those skills than going all the way back to level 1 with a new game.\n\nI really think that players that want to throw in the towel early are primarily lower Elo players anyways. Most Silver, Low Gold, and Bronze players do not know how to play from behind at all, and playing from behind is important if they plan to improve as a player.\n\nNow I can completely understand from the perspective of a player who doesn't care about improving and plays the game casually for fun. Once they stop having fun, they do not want to continue playing. There are a lot of games I stop having fun in, but I desire improving as a player so I usually keep playing. \n\nTo those players I just say close the client then. If you stop having fun and you do not care about improving just close it and quit complaining. You complaining the entire time is only going to incentivize me to report you. I am less likely to report AFKs because people disconnect from games a lot due to power outages, poor connections, or a computer issue. But if you complain a bunch and THEN disconnect, you bet your ass I am reporting you then.","replies":[]},{"poster":"Milodic Mellodi","date":"2016-09-11T07:47:29.498+0000","up_votes":2,"down_votes":0,"body":"I personally have 5 rules for when to and when not to surrender, which tie in with each other and all must be affirmed for a worthy surrender.\n1) If you don't have a Tank on your team, or your Tank is suffering badly.\n2) If your Jungle cannot do their late-game role correctly (Tank, Assassin, etc), whether it be because they are incapable in skill or had a bad game and cannot buy the items to fulfill their role.\n3) If the obligatory Carry is suffering badly. Even having 1 Carry being successful is enough to win a game, as long as their team can support the Carry.\n4) If your opponents haven't lost a single tower (or they've lost a max of 1 each in a max of 2 lanes) while they have destroyed at least 1 inhibitor. Unless you have a Tower Buster like Tristana or Ziggs, in which case 2 or all of your inhibitors instead; ignore the bit about Tower Busters if your opponents have a successful Split-Pusher like Udyr or Jax.\n5) If your team is not cooperating with you or other members of your team, to the point where your team's lack of synergy is causing 1 or more members of your team to become toxic and unwilling to listen to common sense. Once a team member becomes toxic they become the weak link in your team, and your opponents are wise to feed upon this.\n\nHaving a Tank is obligatory since they're the frontliners that absorb damage for the team, so If they can't build enough to Tank then they're just going to feed opponents or be poor distractions. Having a bad Jungler means that they can't Gank correctly in your opponent's laning phase, which leads to the opponents having an easier time against your team -- especially if the Jungler dies multiple times against the laners. The Carry, whichever lane it belongs to, needs to be in top shape to deal as much damage as possible...if they aren't, they're not going to deal enough damage to give your team the edge. If your towers are behind, your minions will also be behind...if it's gotten to the point where you have close to no chance of pushing the lane correctly while your opponents are free to push other lanes, your team will be distracted trying to defend your Nexus which leaves your team stranded or incapable of pushing. Finally, having a teammate that has no chance of reflecting on their mistakes and actually making an effort will leave your team weakened and your opponents stronger in exchange.\nHope this helped :)","replies":[]},{"poster":"Sozan5","date":"2016-09-11T07:11:56.157+0000","up_votes":2,"down_votes":0,"body":"I never surrender.\n\nThat's just all there is to it, really. I don't even consider surrendering an option. Doesn't matter if I know we cannot possibly win that (hell, I've played a 1v5 game back in Season 3 - though, to be fair... It didn't last 20 minutes). There is no real reasoning behind that.","replies":[]},{"poster":"underscores222","date":"2016-09-11T05:31:29.104+0000","up_votes":2,"down_votes":0,"body":"Some people already touched on these, but this is basically my considerations:\n\nPeople tend to give up too easily or early - a few kills behind won't mean we stay behind - I've won games where we have been down on kills the entire game\n\nPeople like to surrender when the other team is already in the base - game won't last long either way, and I like letting the other team finish it (or chose not to, which we can leverage to a turnaround - seen it happen)\n\nFlamers and trolls - if you don't want to carry your weight and play a team game (or flame and be a bad sport because someone else is doing poorly) I have no respect for you and will not give you an easy way out.\n\n\nIf none of these three conditions apply, I will consider surrendering.  But first, I consider the following:\n\nDo we have a chance at winning a team fight if we play a bit smarter - if yes, communicate strategy to team and attempt team fight.  If fight is lost, consider surrender\n\nCan we hold out until we are strong enough to face them in a fight?  Turtling works to an extent (especially if we have a late game carry)\n\nAt some point, the enemy team will stop getting more ahead, and we can catch up (can't do much more than be 18 and have full build) - if we can survive long enough to get there, does our team comp have a chance at contention\n\nBackdooring is still a thing - can we successfully backdoor an inhib or two to help?\n\n\nAs you can see, there are a lot of considerations before I agree a game is well and truly lost with no contest.  I try to keep things in the reasonable doubt range - not holding out for a long shot.\n\n\nAlso - Never surrender, and never give up (because Galaxy Quest is awesome)","replies":[]},{"poster":"Athenes Lulu","date":"2016-09-11T05:09:08.066+0000","up_votes":2,"down_votes":0,"body":"There is one game that you can always *try* to win: make your nexus explode *twice* by timing when your team /ff's.\n\nCome on, it looks cool man.","replies":[]},{"poster":"LuxannaVeritas","date":"2016-09-11T05:08:58.557+0000","up_votes":2,"down_votes":0,"body":"I almost never surrender. What you have explained in your post is like the most extreme slam-dunk overpower-ment your team can imagine. I would surrender; no point in playing if everyone is more focused on complaining than actually playing the game.\n\nIf my whole team seems tilted, I surrender. If we've gotten 0-2 kills in 30 minutes, I surrender. Both of these instances rarely happen, though.\n\nI don't play to win. I play to learn. Every mistake I make, even if my team is behind, is valuable information. I tell myself, \"You were too far pushed up\" or \"You need better target selections in fights\" and try to keep on improving. And yes, a win is always possible. I've ran from my own dying nexus to the unbroken base of the enemy team after an enemy late game ace, and won off of it. \n\nWinning is nice, but improving is my real goal. Maybe if your team won't surrender next time, try to take away as much information as you can! It may make you feel better!","replies":[]},{"poster":"Wyrmblade","date":"2016-09-11T03:09:33.735+0000","up_votes":2,"down_votes":0,"body":"Surrendering in ranked dumb because there's always a chance they'll throw, but normals is fine.","replies":[]},{"poster":"Theorchero","date":"2016-09-11T00:44:15.311+0000","up_votes":2,"down_votes":0,"body":"Depends a lot on the game.\n\nIf everyone is doing really poorly and team is arguing I'll probably surrender. I usually don't though. I main GP at the moment and he's one of those champions that can hypercarry once they hit late game, and with his retarded wave clear killing super minions from one or two inhibs down is never a problem.","replies":[]},{"poster":"LU Vanilla Rice ","date":"2016-09-11T00:37:04.269+0000","up_votes":2,"down_votes":0,"body":"I will surrender a fair amount in norms if I am with my friends, but I will never surrender in ranked. I have both benefited and been the victim of comebacks.\n\n A normal is not as serious as a ranked, and therefore I believe it's your opinion on whether or not you surrender. As for a ranked, this game matters to everyone, and even *if* you  are down 30 kills, 8 turrets, 3, dragons and a baron, you have to believe that it's possible to come back, because it is. \n\nAs a Diamond player, I can confidently say that teams can throw very easily. It happens more often than you think, whether it's from misplaying their advantage, or by being overconfident and making mistakes. Perhaps it could just be that the late-game comp is able to hold off until they outscale. The point is: Always believe you have a chance. Don't get me wrong; comebacks happens very rarely in these extreme circumstances, but I have been a part of a few. \n\nBesides, the worst case scenario is this: out of 10 games you are insanely behind, you surrender and know you probably wouldn't have won, but could have. Best-case scenario, however is this: out of 10 games you are insanely behind, because you didn't surrender and played an extra 20 minutes intelligently, you win 3-4 games (this is an example), rather than losing all 10 for sure.","replies":[]},{"poster":"balbraaksel","date":"2016-09-11T00:34:47.195+0000","up_votes":2,"down_votes":0,"body":"I vote no when there are flamers because I want to let them suffer longer.\n\nAlso some have the attitude of:\n_Oh I messed up, lets surrender ASAP and try next match again._\nWon't ever vote yes then with that attitude, then I'll have the attitude to waste more of your time so next time you might not want to screw up a match so badly like you did.","replies":[]},{"poster":"Wheatloaf","date":"2016-09-10T23:15:43.648+0000","up_votes":2,"down_votes":0,"body":"You'd be surprised what you can learn from getting shit on every once in a while.","replies":[]},{"poster":"Backup4now","date":"2016-09-10T23:03:32.829+0000","up_votes":2,"down_votes":0,"body":"How can you practice what to do when you're behind (for ranked) when you always surrender when you're behind? I know the OP states that the scenario is an ultra-stomp, but the mentality people have when they're behind of 'i'd rather just start another' often applies to much more winnable ones, like 2-7 with a tower lost 15 minutes in. \n\nWhen you always surrender when you're behind, you'll never learn to come back because you never try to do so. Not surrendering in 'unwinnable' games has led me to become very good at coming back, which has won me more than a handful of games in ranked where the surrender vote just barely fails because of me.","replies":[]},{"poster":"Drugoth","date":"2016-09-10T22:46:21.124+0000","up_votes":2,"down_votes":0,"body":"http://m.quickmeme.com/img/ab/ab3d94ce5782d9078baca6b9ec209bdf0024a701b4dd91180d876f6d31773c37.jpg","replies":[]},{"poster":"HaloDragonX","date":"2016-09-10T20:59:39.090+0000","up_votes":2,"down_votes":0,"body":"To move on with life and play a more quality game. I'd rather have fun then bet on the 1% chance of victory.","replies":[]},{"poster":"MunchCrunchLunch","date":"2016-09-10T19:06:14.568+0000","up_votes":2,"down_votes":0,"body":"sometimes games go bad to the point where they are unfun. basically 0% of the time you are starting at a gray screen\n\nmost of the time people do it to make other suffer. i dont understand it. and i never not surrender to make someone else suffer its ridiculous.","replies":[]},{"poster":"Ok sure but why","date":"2016-09-10T19:02:39.303+0000","up_votes":2,"down_votes":0,"body":"i do better late game\n\nearly ain't as fun as late\n","replies":[]},{"poster":"Nami in Bush","date":"2016-09-11T07:13:57.222+0000","up_votes":3,"down_votes":1,"body":"The game isnt over till the nexus is destroyed.","replies":[]},{"poster":"mslybell","date":"2016-09-11T07:13:28.188+0000","up_votes":3,"down_votes":1,"body":"My way of thinking goes as follows: \"If i'm playing to surrender, why play at all?\" This has prevented me from surrendering and has resulted me in winning many games.","replies":[]}]}