{"poster":"MattSouble","date":"2015-05-03T03:28:50.404+0000","title":"Consejo útil para alejar la xenofobia de tus partidas.","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":1,"body":"Quisiera comenzar aclarando que este no es un discurso de hermandad latinoamericana y que este post no tiene como objetivo principal reducir la toxicidad del servidor, no es m&aacute;s que lo que dice el titulo: consejos &uacute;tiles para alejar la xenofobia de TUS partidas.\r\n\r\nSoy alguien que visita frecuentemente en los foros y siempre me encuentro con gente que se queja de la xenofobia, a mi esto me parec&iacute;a muy extra&ntilde;o por que rara vez me encuentro con esta situaci&oacute;n, decid&iacute; entrar a estos temas y varios muestran sus chats donde han tenido problema y me he dado cuenta que en la inmensa mayor&iacute;a el problema inicia cuando alguien, sin querer, da a entender a trav&eacute;s de alg&uacute;n modismo el pa&iacute;s en donde vive.\r\n\r\nYendo al grano dir&eacute; que el mayor consejo esta en **Hablar neutro**, tan sencillo como suena.\r\n\r\nHablar neutro evitar&aacute; que la gente sepa el pa&iacute;s de donde eres, y esto evitar&aacute; que la gente te insult&eacute; de la nada, que pasa bastante.\r\nEste m&eacute;todo es bastante sencillo de cumplir para un Chileno o un Boliviano, por que ellos conjugan las palabras de manera neutra, para un Chileno basta que evite decir cualquier modismo y ya escribe neutro, no as&iacute; un Argentino que conjuga las palabras de manera diferente, he le&iacute;do una que otra revista Argentina y lo primero que llama la atenci&oacute;n es que las tildes (o acentos) las ubican en lugares diferentes, y por supuesto que en lugar de decir &quot;eres&quot; dicen &quot;sos&quot;, lo mismo para los Uruguayos.\r\n\r\nPara terminar debo advertir que hablar neutro no evitar&aacute; que te flameen si estas jugando mal, pero si te ahorrar&aacute; insultos gratuitos o que justifiquen tus malas jugadas por que naciste en X lugar, que es bastante molesto. Sigan este humilde consejo y se dar&aacute;n cuenta que jugaran partidas mucho m&aacute;s agradables.","replies":[{"poster":"MattSouble","date":"2015-05-03T03:30:55.927+0000","up_votes":4,"down_votes":0,"body":"Resumen: habla neutro.\n\nCuando termine me di cuenta que era innecesariamente largo, pero no quería borrar todo, me había quedado bonito y me daba pena hacerlo.","replies":[{"poster":"Marz","date":"2015-05-03T16:28:04.253+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"MattSouble","date":"2015-05-04T02:04:20.571+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RedStrip,realm=LAS,application-id=PJAKt7ph,discussion-id=1XQZL8tK,comment-id=00000000,timestamp=2015-05-03T16:28:04.253+0000)\n>\n> Jajaja me mató lo último. Voy a intentarlo a ver qué pasa. Igual te digo que hay personas que tienen incorporadísimos los modismos en su forma de escribir y no sabrían ni escribir bien en su propia forma de hablar, mucho menos pedirles que hablen neutro.\n> Es una lástima que sea necesario recurrir a medidas \"preventivas\" para evitar la xenofobia y no se pueda hablar/escribir tranquilo con las formas con las que uno se crió en su región porque te vayan a insultar (obviamente **de forma correcta, no es lo mismo usar modismos que escribir MAL**). Ese tipo de personas tienen la cabeza** vacía**.\n\nLa verdad no lo veo tan mal, si estas en un ambiente internacional debes velar por que todos te entiendan, por ahi he visto uno que otro vídeo y lo que te recomiendan es que no hables, así de simple, lo cual es válido, pero es muy... serio, según yo un videojuego no debe ser serio, a menos que sea Ranked, ese ambiente esta hecho para la seriedad. Además, los extranjeros no tienen por que saber que significan tus modismos, tengo la sensación que expresiones como CTM o wn son puramente ofensivos, pero esto no es del todo correcto, son más bien expresiones.\n\nPor otro lado, este tema lo cree con la intención de ayudar a aquellos que de verdad quieren mejorar su experiencia de juego, no al servidor.  Saludos!","replies":[]}]}]},{"poster":"BeamOeste","date":"2015-05-03T20:02:41.805+0000","up_votes":2,"down_votes":0,"body":"Si te insultan por que sos chileno/argentino        > Mute  ,Solucion efectiva y a jugar","replies":[]},{"poster":"DieOrSovngarde","date":"2015-05-07T06:10:19.791+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"MattSouble","date":"2015-05-09T18:52:28.455+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GoForTheThroat,realm=LAS,application-id=PJAKt7ph,discussion-id=1XQZL8tK,comment-id=0004,timestamp=2015-05-07T06:10:19.791+0000)\n>\n> La solucion esta en los volcanes\n\n¿no es un poco sádico lanzar a los xenófobos a un vólcan? D: !!","replies":[]}]},{"poster":"bruntron","date":"2015-05-04T20:24:51.809+0000","up_votes":1,"down_votes":0,"body":"Lo mas efectivo sabes que es? - te dicen manco  o lo que sea , no le prestas atencion. Queres avisar alguna cosa? apretas la v , arrastras el mouse y haces una señal. Para decirle algo le decis ok , si ,bueno, esta bien, no hagas esto , etc. En resumen No hay que hablar mucho . si flamean , no les contestas y siguen flammeando . MUTE :D","replies":[{"poster":"MattSouble","date":"2015-05-09T18:50:26.236+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bruntron,realm=LAS,application-id=PJAKt7ph,discussion-id=1XQZL8tK,comment-id=0002,timestamp=2015-05-04T20:24:51.809+0000)\n>\n> Lo mas efectivo sabes que es? - te dicen manco  o lo que sea , no le prestas atencion. Queres avisar alguna cosa? apretas la v , arrastras el mouse y haces una señal. Para decirle algo le decis ok , si ,bueno, esta bien, no hagas esto , etc. En resumen No hay que hablar mucho . si flamean , no les contestas y siguen flammeando . MUTE :D\n\nPero eso es después que se presenta la xenofobia en tu partida, aquí estamos discutiendo métodos para evitarla, no enfrentarla. En cualquier caso lo que dices me parece correcto.","replies":[]}]},{"poster":"NuKHunteR","date":"2015-05-05T06:01:08.522+0000","up_votes":1,"down_votes":0,"body":"Solucion: No chatear durante el juego, si queres hacer amigos o preguntarle si en su ciudad hay oxigeno o lo q sea, haganlo fuera del juego... chatear no sirve en el juego, hay pings de aviso para lo basico q se necesita saber","replies":[{"poster":"MattSouble","date":"2015-05-09T18:47:08.863+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NuKHunteR,realm=LAS,application-id=PJAKt7ph,discussion-id=1XQZL8tK,comment-id=0003,timestamp=2015-05-05T06:01:08.522+0000)\n>\n> Solucion: No chatear durante el juego, si queres hacer amigos o preguntarle si en su ciudad hay oxigeno o lo q sea, haganlo fuera del juego... chatear no sirve en el juego, hay pings de aviso para lo basico q se necesita saber\n\nSi, hay ping, es verdad, pero no hay suficientes, con que ping le aviso al junglista que el ADC gasto el destello?, como le digo al mid que salga del arbusto por que el soporte coloco un ward hace poco? Podría tirarle el ping de que salga, pero el mid tal vez  no entienda el motivo y se quedaria de todas formas, regalando una kill.\n\nAdemás, estas discutiendo algo que poco tiene que ver, como digo en el título, en un consejo para alejar la Xenofobia, si es mejor hablar o no hablar en una partida es harina de otro costal.","replies":[]}]}]}