{"poster":"nessfred","date":"2020-01-21T18:59:31.280+0000","title":"Poro Skins","subforum":"Skin- & Champion-Konzepte","up_votes":3,"down_votes":0,"body":"Ich LIEBE Poros aber es gibt keine wirklichen Skins die darauf aufbauen und ich finde dies sollte man nutzen da Poros so einzigartig in LOL sind. Sie haben letztes Jahr Hund vs. Katze gehabt aber noch nie Poros (außer 1 Sejuanie Skin). Meine Ideen dazu wären auf jedenfall ein Braum mit Poro Schild oder das er mit seiner Q-Fähigkeit Poros schießt und seine passive dementsprechend ein Poro bildet. Desweiteren auch Tahm Kench der ein dickes Poro Kostüm trägt (oder Yummi). Bard dessen Helfer Poros sind. Sett der als Weste ein Poro trägt (ähnlich wie bei Yorick mit dem Katzen Kostüm). Oder auch Ornn wo bei der Ult ihm ein riesiger Poro entgegen rennt, hier könnte man noch als Easter Egg einfügen, dass der Poro ein Schnurrbart bekommt sobald  Braum sich im Spiel befindet. \r\nIch würde mich sehr freuen wenn sich jemand meldet und mir seine Meinung dazu mitteilt.","replies":[{"poster":"Zavolta","date":"2020-01-21T19:04:53.154+0000","up_votes":3,"down_votes":0,"body":"Malzahar, der statt Leerlinge ein paar Poros losschickt...\n{{sticker:sg-lux}}\n\nGleiches mit Elise, die sich in einen Poro verwandelt und kleine Poros losschickt...\n{{sticker:sg-lux}} ","replies":[{"poster":"Bobby Bonkers","date":"2020-01-22T02:17:47.286+0000","up_votes":1,"down_votes":0,"body":"Also Snowday Malz ?","replies":[{"poster":"Zavolta","date":"2020-01-22T05:27:02.889+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bobby Bonkers,realm=EUW,application-id=L7E6lhzo,discussion-id=b9OYVWbR,comment-id=00000000,timestamp=2020-01-22T02:17:47.286+0000)\n>\n> Also Snowday Malz ?\n\nHat der kleine Poros? Ich glaube nicht. Außerdem sieht der komisch aus... :)","replies":[{"poster":"GretaStoleMyCar","date":"2020-01-22T08:41:50.548+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Zavolta,realm=EUW,application-id=L7E6lhzo,discussion-id=b9OYVWbR,comment-id=000000000000,timestamp=2020-01-22T05:27:02.889+0000)\n>\n> Hat der kleine Poros? Ich glaube nicht. Außerdem sieht der komisch aus... :)\n\nDie Voidlings sehen bei dem Skin zwar nicht aus wie Poros, aber das könnte man theoretisch per Chroma ändern.","replies":[]}]}]}]},{"poster":"Megamaexx","date":"2020-01-21T21:36:21.981+0000","up_votes":2,"down_votes":0,"body":"Braum hat bereits schon sehr viel mit Poros zu tun und er würde NIE einen Poro als Schild benutzen! Bei seinem Weihnachtsskin sind seine Schlitten ziehenden Helfer Poros und bei seinem Classic Skin kommen auch Poros bei seinen Emotes. \n\nAber allgemein finde ich pororelated Skins nicht schlecht.","replies":[]},{"poster":"Vinmie007","date":"2020-02-05T13:07:59.514+0000","up_votes":1,"down_votes":0,"body":"Viele Winterwunder Skins beziehen sich schon auf Poro\nBei Lulu zum Beispiel ist ihre kleine Fee ein Poro mit Flügeln\nBeim Winterwunder orianna ist ihre Kugel im Design eines Poros \nUnd beim Weihnachtsbraum sind es die Poros die beim Recall seinen Schlitten ziehen.\n\nWas ich sehr schön finde, ist wenn man versteckt einen Poro sieht, auch bei Wintermaps mag ich es, wenn man durch den Jungle geht und hier und da nette Details in Form von z.B. Poros sieht.\n\nAllerdings finde ich es auch gut, wenn man einen ganz offensichtlichen Poro sieht.\nLustig fände ich es z.B. bei Rammus, dass wenn er rollt er zum rollenden Poro wird.\nOder Morsekaiser, dass wenn er in seine 1v1 Welt geht, dass in der Arena viele Poros am Rand sitzen.\n\n\nMal sehen was Riot aus den lebenden Schneebällen noch so macht.\n\nEinen schönen Tag euch noch,\nmit freundlichen Grüßen Vinmie007","replies":[]}]}