{"poster":"Chubacraba","date":"2018-01-06T15:56:16.545+0000","title":"League of Philosophers","subforum":"Spielerverhalten & Moderation","up_votes":7,"down_votes":5,"body":"Egal ob man sich in Foren bewegt, in Youtube oder in Twitch. In vielen F&auml;llen dreht es sich um grob zwei Dinge: Unterhaltung und wie bekomme ich m&ouml;glichst viel Elo. Es scheint eine riesige Nachfrage danach zu geben. Warum ist das eigentlich so? Hat sich keiner mal die Frage gestellt &quot;Warum eigentlich? Warum will ich denn Diamond, Master oder gar Challenger werden?&quot;, was steckt da dahinter dass so viele Leute enorme Mengen an Zeit, Energie und teilweise sogar Geld darin investieren. Was erhofft man dadurch am Ende zu erreichen?\r\n\r\nIch bin jemand, der sich solche Fragen gerne stellt. Schon immer habe &uuml;ber alles m&ouml;gliche nachgedacht, philosophiert, den Kopf zerbrochen. Auch vieles hinterfragt und angezweifelt. Ich bin stets auf der Suche nach neuen Ideen, Anregungen. Und versuche dann auch das gro&szlig;e ganze Ganze zu sehen. Seit ich League spiele mache ich das zunehmend auch mit Bezug auf LoL. Zuerst bei mir selbst, inzwischen auch auf der gro&szlig;en Ebene.\r\nLeider habe ich niemanden mit dem ich dieses &quot;Hobby&quot; so richtig teilen kann. Ich w&uuml;rde gerne Leute kennen lernen, die so wie ich einen leichten Sprung in der Sch&uuml;ssel haben und gerne &quot;outside the box&quot; denken. Ich spiele sogar mit dem Gedanken Videos dar&uuml;ber zu machen. Beispielhafte Themen w&auml;ren:\r\n\r\n- Warum will man eigentlich &quot;climben&quot;? (wie schon oben erw&auml;hnt)\r\n- &quot;Die Kunst des Krieges&quot;  auf LoL &uuml;bertragen.\r\n- Sind Spieler mit einer hohen Elo auch automatisch intelligent(er)?\r\n- Kann man von LoL f&uuml;r das &quot;echte&quot; Leben etwas lernen, und wenn ja - was?\r\n- Wie (mit welchen Methoden) Riotgames, Streamer und Youtuber uns, also die Spieler und Zuschauer, manipuliert.\r\n- Sprachen lernen mit LoL\r\n- Anwendung von Sporttheorien auf LoL bzw den e-Sport im Allgemeinen (z.B. die Ern&auml;hrung und welchen Einfluss die hat)\r\n\r\nw&uuml;rde mich freuen wenn ich den einen oder anderen vielleicht zum nachdenken gebracht oder gar damit angesteckt habe und jetzt ebenfalls Lust hat zu philosophieren. ^^\r\nLasst es mich gerne wissen\r\n\r\nLG Chubacraba","replies":[{"poster":"A Ryze From Dead","date":"2018-01-07T12:33:25.569+0000","up_votes":1,"down_votes":1,"body":">-\"Die Kunst des Krieges\" auf LoL übertragen.\n\nBitte nicht. LoL ist vor allem ein Spiel zwischen Menschen und ich fände es nicht in Ordnung wenn es die Kunst einer grausamen und brutalen Methodik übernimmt. \n\nDie anderen Punkte sehe ich von _Pandeonor_ als gut ausgearbeitet an.","replies":[{"poster":"Nohgolgh","date":"2018-01-07T13:38:12.154+0000","up_votes":5,"down_votes":0,"body":"Dir ist schon klar, dass \"die Kunst der Krieges\" ein bedeutendes Literaturwerk ist? Der Autor Sun Tsu gehört auch heute noch zu den bedeutensten Theoretikern der Strategiegeschichte und dieses Buch findet überall Anwendung, wo man Konflikte gewinnen will (z.B. Politik, Wirtschaft). Es geht weniger um die Brutalität des Gemetzels sondern um die strategische Ausrichtung.","replies":[{"poster":"A Ryze From Dead","date":"2018-01-07T20:09:16.654+0000","up_votes":1,"down_votes":1,"body":"> Dir ist schon klar, dass \"die Kunst der Krieges\" ein bedeutendes Literaturwerk ist?\n\nIch habe den Term \"Kunst des Krieges\" schon öfters gehört, aber nie im Kontext eines Literaturwerkes, verzeih mir. Ich stehe einem Konzept und selbst einer \"Konfliktlösungsstrategie\" jedoch skeptisch gegenüber wenn es \"Krieg\" als etwas Kunstvolles verherrlicht.","replies":[{"poster":"eingew","date":"2018-01-08T08:25:47.024+0000","up_votes":2,"down_votes":0,"body":"https://de.wikipedia.org/wiki/Die_Kunst_des_Krieges_(Sunzi)\n\n\"Verherrlichen\"... der Typ hat 500 vor Christus gelebt. Menschen sind in erster Linie Tiere, die genauso wie Affen und Wölfe Rangkämpfe durchführen und in Rudeln ihr Revier verteidigen und vergrößern. Man kann darüber sicher negativ urteilen, aber man gibt sich damit automatisch der Scheinheiligkeit Preis, waren die Möglichkeiten damals als Pazifist zu leben doch überaus beschränkt, wenn man es mit dem Leben ernst nimmt. Gut, der Mann war Militärstratege, es ist also davon auszugehen, dass er den Konflikt durchaus auch gesucht hat, aber wie gesagt, wenn du diese Kämpfe nicht ernst genommen hast, hast du damals nicht lange überlebt und das galt natürlich auch auf staatlicher Ebene, wer kein gutes Militär hatte, der ging unter.\n\nWir heute haben übrigens in erster Linie eine andere Perspektive darauf, weil die Atombombe seit weniger als 100 Jahren zumindest in Europa Kriege verhindert hat und wir erst durch den Zwang, keine Kriege führen zu können, den Frieden wirklich lieb gewonnen haben. \n\nAber am Ende steht immer noch, dein Urteil ist völlig von den Zwängen der damaligen Zeit befreit.","replies":[{"poster":"A Ryze From Dead","date":"2018-01-08T16:13:15.490+0000","up_votes":1,"down_votes":1,"body":">\"Verherrlichen\"... der Typ hat 500 vor Christus gelebt.\n\nIch versuchte lediglich das Urteil dass ich fällte bevor mir die Existenz des Werkes offenbart wurde zu verteidigen. Zum Werk selbst habe ich mich noch nicht groß geäußert, aber von dem was ich bisher gelesen habe scheint er nicht viel Blödsinn aufgeschrieben zu haben.\n\nEins meiner Hauptbedenken bei \"Krieg auf LoL übertragen\" war, dass LoL Regeln hat. Ein Umgang miteinander, _sportsmanship_. Man könnte argumentieren dass das für den Krieg auch gilt anhand all den verbotenen Waffen und Methoden, aber:\n\n1. An Regeln im Krieg hält man sich nur wenn es eine Gewalt gibt, die diese durchsetzt und die respektiert wird.\n2. Im Krieg damals gab es diese wahrscheinlich noch nicht, daher halte ich es für möglich, dass die Methoden dieses Werkes skrupellos sein können.\n\nSolche Methoden begehre ich nicht in einem Spiel wie LoL zu sehen. Es erinnert mich an zwei Fälle im Forum:\nDer erste war jemand der es als legitime Strategie angesehen hat, den Championselect zu dodgen, wenn jemand aus seinem Team einen Champ mit einer niedrigen Winrate gepickt hat. Er beanstandete den Leaverbuster.\nDer zweite war jemand der sich mentale Schwächen des Gegners und den All-Chat zunutze gemacht hat um ihn zum tilten, ein schlechtes Gewissen zu machen, zum ragen zu bringen etc, also seine Eigen- bzw Teamleistung maßgeblich zu verschlechtern und sah das reuelos als effektive und anzuwendende Strategie an.\n\nFür beide galt wahr und ehrlich eins: \"Sieg ist alles\". Und wie du bereits gesagt hast, wer im Krieg nicht auf den Sieg aus ist, macht es sich extra schwer zu überleben. Aber selbst wenn das so ist möchte ich es zur (und wenn nur moralischen) Legitimierung solcher Strategien in LoL nicht kommen lassen.","replies":[{"poster":"DrunkenRedPanda","date":"2018-01-09T04:41:43.887+0000","up_votes":3,"down_votes":0,"body":"Ich bin persönlich Pazifst, jedoch einigermaßen Geschichtsinteressiert. Dabei bin ich früher oder später auf \"Die Kunst des Krieges\" gestoßen. \n> Die größte Leistung besteht darin, den Widerstand des Feindes ohne einen Kampf zu brechen.\n\nDas ist mein Lieblingszitat aus dem Werk. Ich glaube zudem auch das sich ein paar Taktiken auf LoL anwenden lassen, jedoch in abgewandelter Form. Wahrscheinlich eher als 4 oder 5 Mann Premade Gruppe. Zu dem Teile ich deine Meinung, dass man Krieg nicht Verherrlichen sollte. Du solltest dieses Werk wirklich lesen, es ist auch nicht lang und meiner bescheidenen Meinung nach hochinteressant. Es ist zudem ein Klassiker der Management-Kultur, zumindest laut Wikipedia.","replies":[{"poster":"eingew","date":"2018-01-09T08:33:46.763+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=DrunkenRedPanda,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=000300000001000000000000,timestamp=2018-01-09T04:41:43.887+0000)\n>\n> Ich bin persönlich Pazifst\n\nDas ist man aber auch nur solange man es sich leisten kann :P","replies":[{"poster":"DrunkenRedPanda","date":"2018-01-09T09:04:52.679+0000","up_votes":2,"down_votes":0,"body":"Dann hoffe ich mal, dass ich mir das noch lange leisten kann :P","replies":[{"poster":"Jastol","date":"2018-01-16T11:07:33.620+0000","up_votes":1,"down_votes":0,"body":"Als Pazifist zu leben heißt Unrecht zu akzeptieren. Ich könnte das nicht und das obwohl Ich ein sehr friedliebender Mensch bin. Ich hatte in meinen 30 Jahren auf diesem Planeten erst 2 Schlägereien und musste noch nie eine Waffe verwenden. Aber das ändert nichts daran, dass Ich als Ultima Ratio nicht auch Gewalt anwenden würde. Wenn Ich z.Bsp. mitbekommen würde, dass eine Frau in meiner Nähe vergewaltigt werden würde, dann würde Ich Ihr mit allen Mitteln versuchen zu helfen, Ich denke diese Mittel werden auf jeden Fall leider Gewalt beinhalten. Wegzuschauen würde mich aber Seelisch viel schwerer belasten. Hab in meinem Leben schon oft Zivilcourage bewiesen und zum Glück die Situation bisher immer durch Souveränität lösen können. Aber irgendwann, hoffentlich nie, wird vll die Situation kommen an der das nicht mehr klappt.","replies":[]}]}]}]},{"poster":"eingew","date":"2018-01-09T08:33:03.858+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=A Ryze From Dead,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=00030000000100000000,timestamp=2018-01-08T16:13:15.490+0000)\n>\n> Ich versuchte lediglich das Urteil dass ich fällte bevor mir die Existenz des Werkes offenbart wurde zu verteidigen. Zum Werk selbst habe ich mich noch nicht groß geäußert, aber von dem was ich bisher gelesen habe scheint er nicht viel Blödsinn aufgeschrieben zu haben.\n\nTatsächlich ist dieses Buch so ziemlich das einzige, was man über diesen Mann weiß. Abgesehen davon ist nichts bekannt, auch seine Lebenszeit wird bloß grob geschätzt.\n\n> Eins meiner Hauptbedenken bei &quot;Krieg auf LoL übertragen&quot; war, dass LoL Regeln hat. Ein Umgang miteinander, _sportsmanship_. Man könnte argumentieren dass das für den Krieg auch gilt anhand all den verbotenen Waffen und Methoden, aber:\n> \n> 1. An Regeln im Krieg hält man sich nur wenn es eine Gewalt gibt, die diese durchsetzt und die respektiert wird.\n> 2. Im Krieg damals gab es diese wahrscheinlich noch nicht, daher halte ich es für möglich, dass die Methoden dieses Werkes skrupellos sein können.\n\nKrieg ist in erster Linie durch die Regeln der Physik bestimmt, völlig richtig. Es gibt eben mehr Möglichkeiten und Variablen, als in LoL. \nDie meisten Kriege werden aber auch nach gewissen Regeln der Ehre usw durchgeführt. Nicht in jeder Situation, aber ein gewisses Maß an Zivilisation hat denke ich schon Einfluss auf das Handeln der Beteiligten.\n\n> Solche Methoden begehre ich nicht in einem Spiel wie LoL zu sehen. Es erinnert mich an zwei Fälle im Forum:\n> Der erste war jemand der es als legitime Strategie angesehen hat, den Championselect zu dodgen, wenn jemand aus seinem Team einen Champ mit einer niedrigen Winrate gepickt hat. Er beanstandete den Leaverbuster.\n> Der zweite war jemand der sich mentale Schwächen des Gegners und den All-Chat zunutze gemacht hat um ihn zum tilten, ein schlechtes Gewissen zu machen, zum ragen zu bringen etc, also seine Eigen- bzw Teamleistung maßgeblich zu verschlechtern und sah das reuelos als effektive und anzuwendende Strategie an.\n> \n> Für beide galt wahr und ehrlich eins: &quot;Sieg ist alles&quot;. Und wie du bereits gesagt hast, wer im Krieg nicht auf den Sieg aus ist, macht es sich extra schwer zu überleben. Aber selbst wenn das so ist möchte ich es zur (und wenn nur moralischen) Legitimierung solcher Strategien in LoL nicht kommen lassen.\n\nNaja, ist es falsch einen Gegner der tiltet zu campen? Einen Gegner im Allchat zu provozieren ist natürlich vor allem je nach Wortwahl verboten... aber ihn durch Angriffe ingame psychisch zu schwächen, das ist hinterlistig, aber wieso sollte das falsch sein?","replies":[{"poster":"A Ryze From Dead","date":"2018-01-09T21:38:29.661+0000","up_votes":1,"down_votes":0,"body":">Die meisten Kriege werden aber auch nach gewissen Regeln der Ehre usw durchgeführt. \n\nEhre ist einer dieser \"Regeln\", die von einer Mehrheit anerkannt und durchgesetzt wird. Wer \"unehrenhaft\" kämpft hat sozusagen den global taunt auf sich. Anhand der Sieger unserer Geschichte sehe ich aber nicht wirklich den Wert dieser \"Ehre\" und anderen \"Regeln\". \nIm Gegenteil, solche Regeln sind sogar nützlich für die Sieger die sich nicht dran halten. Aber das kommt der Massenmanipulation schon sehr nahe und das ist ein ganz anderes Thema.\n\n>Einen Gegner im Allchat zu provozieren ist natürlich vor allem je nach Wortwahl verboten... aber ihn durch Angriffe ingame psychisch zu schwächen, das ist hinterlistig, aber wieso sollte das falsch sein?\n\nIch hoffe dich nicht zitieren können zu müssen, daher will ich nochmal an einem Fall von mir sichergehen:\n\nIn einem Spiel hat unser Jayce Toplane den gegnerischen dc'ten Renekton im early getötet. Vorweg, der Jayce war kein herzloser/gnadenloser Typ, eigentlich eher ein netter Mensch und er hatte ernsthafte Reue gezeigt, was sich dann als das Problem herausstellt. \nNachdem die gegenerische Junglerin Eve versucht hatte Renektons Tod wahrscheinlich zu rächen und starb fing sie an Top zu campen. Ich habe nur aus den Augenwinkeln auf der Minimap gesehen wie sich Renekton und Eve gleichzeitig auf der Top um den Jayce schlossen. Doublekill. Der Jayce war auch gar nicht mal so schlecht, er fing an das Spiel zu dominieren und unsere Botlane die wesentlich behind war mitzucarrien. \nDie ganze Zeit über war Eve negativ darüber dass Jayce Renekton einfach getötet hat, aber dann fing sie an Jayce richtig penetrant Schuldgefühle zuzuschieben. Ich erinnere mich nicht mehr an die Worte außer dass sie ziemlich grauenhaft waren ohne zwingend Riot's Regeln zu brechen und dass unser ganzes Team Jayce vor diesen Worten keinen wirklichen Komfort bieten konnte. Die anderen Gegner folgten Eve's Beispiel dann in eher unzivilisierter Weise. \nDer Effekt, war da. Vom zielstrebigen und unerbitternd kämpfenden Jayce wurde einer der planlos durch den Jungle läuft hier und da split pushed und durchgehend sinnlos stirbt. \nUnser gesamtes Team war durch die Machtlosigkeit dieser Situation frustriert und spielte schlechter. Die Gegner erholten sich damit von einem wirklich unhaltbaren Spiel und gewannen nach über 15 Minuten danach.\n\nIch stimme zu, dass dieses Beispiel durch mich schwerwiegender wahrgenommen wird als es ist, da ich es miterlebt habe, aber mein Punkt ist, dass es tatsächlich Leute gibt, die die mentale Schwäche mancher Menschen ausnutzen um ihr Ziel zu erreichen und das mit gutem Gewissen. Sie sind sogar stolz genug um dies als Strategie im Forum in Form eines eigenen Threads zu präsentieren und zu verteidigen.\n\nEinfache Worte können jemanden ernsthaft negativ beeinflussen. [Hier](https://www.youtube.com/watch?v=Iqq1roF4C8s) ein Video falls du gerne ein Video sehen möchtest. Diese Worte zu finden mag nicht trivial sein, aber es zu können und es zu tun halte ich nicht für sonderlich förderlich in einem MOBA.\n\nAuch nur einen Funken Verständnis für dieses Verhalten von einem Emissary zu sehen, würde mich etwas erschüttern.","replies":[{"poster":"eingew","date":"2018-01-10T09:15:03.305+0000","up_votes":1,"down_votes":0,"body":"Nun... Offenbar muss ich anders definieren: Riots Regeln sind in erster Linie zweitrangig. Entscheidend ist, wie du persönlich ein Verhalten beurteilst. Wenn es dein Spielerlebnis absichtlich schlechter macht, dann kannst du deinen Spieler legitim dafür reporten. In diesem konkreten Fall würde ich sagen, dass die Eve, selbst wenn sie strikt betrachtet nach unseren Erfahrungen mit der Chatanalyse vielleicht nicht zwingend bestraft wird, sofern sie Angriffe unter der Gürtellinie in den Chat gepackt hat (und danach hört es sich für mich an), war ihr Verhalten aber dennoch reportwürdig. Ich jedenfalls hätte sie dafür womöglich reported (wobei das natürlich darauf ankommt, was sie konkret gesagt hat).\n\nDer Weg der Beschwörer hat Regeln wie: \"Gebt konstruktives Feedback\", \"Bleibt freundlich\", \"Zeige Demut im Sieg, Anstand in der Niederlage\" und \"Sei entschlossen, nicht aufgebracht\". Auch wenn es sicher keine Vorschrift ist, allen Regeln haarklein zu folgen und immer ein absolut positiver Mitspieler im Chat zu sein (so reicht es schließlich auch völlig, absolut neutral zu sein), so klingt das, was du von der Eve beschreibst, doch schon so, als hätte sie gegen diese Punkte zumindest teilweise verstoßen.\n\nWas Angriffe im Spiel angeht bleibe ich aber dabei: Den Jayce zB als \"Rache\" zu campen, wie die Eve es getan hat, ist völlig legitim. Auch einen Spieler der getiltet ist zu campen ist völlig legitim. Man kann niemanden dafür bestrafen, dass er Champions ausschaltet um die Lane zu snowballen und Tower zu zerstören, um das Spiel zu gewinnen. Psychologische Kriegsführung im Chat dagegen ist höchst grenzwertig und übertritt fast immer Grenzen.\nVerständnis habe ich im übrigen selbst für Mörder. Es gibt allerdings einen massiven Unterschied zwischen \"Verstehen\" und \"angemessen finden\".\nEs ist schwer über die Eve zu urteilen, ohne zu wissen, was sie genau gesagt hat. Angriffe unter der Gürtellinie sind allerdings wie bereits gesagt immer reportwürdig.\n\nAbgesehen davon denke ich, dass der Jayce in erster Linie selbst Schuld ist, egal was Eve gesagt hat, alles, was er getan hat, als er den Toplaner mit DC getötet hat, ist, einen Vorteil zu nutzen um das Spiel zu gewinnen. Wenn ihm das nicht so bewusst war, sollte er an sich selbst arbeiten. Und vor allem hätte er die Gegner muten und sich nicht von dem Flame so demotivieren lassen sollen.\n\nÜbrigens, was die Macht von Worten (oder auch Symbolen) angeht:\n\n> Auch nur einen Funken Verständnis für dieses Verhalten von einem Emissary zu sehen, würde mich etwas erschüttern.\n\nDas ist dann wohl die Macht des Wortes \"Emissary\" kombiniert mit der grünen Einfärbung ^^. Die Symbolwirkung ist doch immer wieder stärker, als ich es selbst einschätze.","replies":[]}]}]}]}]}]},{"poster":"eingew","date":"2018-01-07T17:57:13.784+0000","up_votes":2,"down_votes":0,"body":"Eines der Prinzipien, die darin beschrieben sind, ist übrigens, dass die größte Stärke, die man beweisen kann, darin besteht, einen Konflikt völlig ohne militärische Auseinandersetzung zu beenden und völlig ohne Gewalt seine Position durchzusetzen.\n\nIn LoL geht das natürlich weniger...\n\nNoch dazu hat sich seit der Verfassung des Werkes nicht wirklich etwas geändert. In militärischer Hinsicht funktioniert die Welt noch genauso wie vor tausenden Jahren.","replies":[{"poster":"Nohgolgh","date":"2018-01-08T15:17:38.854+0000","up_votes":1,"down_votes":0,"body":">Eines der Prinzipien, die darin beschrieben sind, ist übrigens, dass die größte Stärke, die man beweisen kann, darin besteht, einen Konflikt völlig ohne militärische Auseinandersetzung zu beenden und völlig ohne Gewalt seine Position durchzusetzen.\n\n>In LoL geht das natürlich weniger...\n\nDer Konflikt wird ja nicht durch irgendeine Hippibotschaft unterbunden, sondern dadurch, dass die Strategie des Gegners unterbunden wird, bevor diese ausgeführt wird. Die zweite Hälfte des Buches beschäftigt sich viel mit Mobilität, Spionage, dem Schmieden von Intrigen und dem Vernichten von Versorgungslinien. So wie ich das Buch lese, geht es eher darum, mit so wenig Gewalt wie möglich so viel Schaden wie möglich anzurichten und die Prinzipien, die zu diesem Effekt führen, werden postuliert. Sun Tsu will die Auseinandersetzung im Wesentlichen kurz und brutal machen und Rahmenbedingungen haben, die sicher stellen, dass du gewinnst. Ziel bleibt aber die vollständige Elemination des Gegners.","replies":[]}]}]},{"poster":"Chubacraba","date":"2018-01-07T19:58:09.662+0000","up_votes":1,"down_votes":0,"body":"Wie es bereits von Nohgolgh gesagt wurde geht es mir nicht darum die Brutalität eines echten Krieges wie in Syrien auf LoL zu übertragen.\n\"Die Kunst des Krieges\" hingegen ist mit das bekannteste Werk für Strategie das es gibt. Und obwohl es vor mehr als 2500 Jahren verfasst worden ist lassen sich erstaunlich viele Prinzipien daraus noch heute anwenden. Und zwar nicht nur im Krieg sondern auch in vielen anderen Bereichen des Lebens. Deswegen bin ich auch so fasziniert davon, dass es eben trotz seines Alters noch so eine Gültigkeit hat. So zum Beispiel das Prinzip \"Wenn du dich und deinen Gegner kennst, brauchst du den Ausgang von 100 Schlachten nicht fürchten\" oder auch \"Alle Kriegskunst beruht auf Täuschung\".\nNatürlich sollte man das nicht wortwörtlich nehmen, sondern versuchen den Sinn dahinter zu verstehen und ihn dann auf das gewünschte Themengebiet zu übertragen.","replies":[{"poster":"A Ryze From Dead","date":"2018-01-07T20:36:42.113+0000","up_votes":2,"down_votes":0,"body":"Unabhängig davon, dass ich mit dem besagten Literaturwerk noch nie in Kontakt gekommen bin stimme ich zu, dass sich viele zwischenmenschliche, gesellschaftliche bzw. soziale Aspekte in der Zeit nicht geändert haben. \n\nUm noch meine beiden Irrtümer offenzulegen:\n\n1. war mir die Referenz zum Werk nicht bekannt und ich dachte es wäre eine Ansammlung von Ideen wie man Krieg zu führen hätte mit dem Ansatz dass dieser etwas erstrebenswertes wäre.\n2. missverstand ich \"übertragen\" im Sinne von implementieren statt vergleichen.\n\nWenn sich das Werk wie du beschrieben auf viele Dinge im Leben anwenden lässt, dann sicherlich auch auf LoL.\nDennoch hielte ich den Titel \"Kunst des Krieges\" als ein wenig irreführend..","replies":[{"poster":"Waldschrat86","date":"2018-01-08T00:01:05.817+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=A Ryze From Dead,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=000300010000,timestamp=2018-01-07T20:36:42.113+0000)\n>\n> Unabhängig davon, dass ich mit dem besagten Literaturwerk noch nie in Kontakt gekommen bin stimme ich zu, dass sich viele zwischenmenschliche, gesellschaftliche bzw. soziale Aspekte in der Zeit nicht geändert haben. \n> \n> Um noch meine beiden Irrtümer offenzulegen:\n> \n> 1. war mir die Referenz zum Werk nicht bekannt und ich dachte es wäre eine Ansammlung von Ideen wie man Krieg zu führen hätte mit dem Ansatz dass dieser etwas erstrebenswertes wäre.\n> 2. missverstand ich &quot;übertragen&quot; im Sinne von implementieren statt vergleichen.\n> \n> Wenn sich das Werk wie du beschrieben auf viele Dinge im Leben anwenden lässt, dann sicherlich auch auf LoL.\n> Dennoch hielte ich den Titel &quot;Kunst des Krieges&quot; als ein wenig irreführend..\n\nKunst ist ein deutsches Wort. Bereits im Althochdeutschen lautete es kunst (Plural kunsti), im Mittelhochdeutschen kunst (Pl. künste). Ursprünglich ist kunst ein Substantivabstraktum zum Verbum können mit der Bedeutung „das, was man beherrscht; Kenntnis, Wissen, Meisterschaft“. Die Redewendung „Kunst kommt von Können“ ist also etymologisch (dem Wortursprung nach) richtig. Zusätzlich wurde „Kunst“ in Lehnbedeutung für den lateinischen Begriff ars benutzt, z. B. im Bildungskanon der Sieben freien Künste, in Lebenskunst, Liebeskunst usw. Kunst bezieht sich in diesem Sinne grundsätzlich auf alles, was Menschen können und was von Menschen gemacht ist. Der entsprechende Gegenbegriff ist Natur, wie in dem alltäglichen Gegensatzpaar natürlich / künstlich.\n\nSeit der Zeit der Aufklärung wird Kunst hauptsächlich in einem engeren Sinne als Oberbegriff der Ästhetik verwendet, der die Kunstgattungen (Bildende Kunst, Darstellende Kunst, Musik und Literatur), und ihre verschiedenen Stile und Strömungen zusammenfasst. Zugehörige Begriffe sind z. B. Kunstwerk, Künstler, künstlerisch.\n\nSagt mal Wiki^^:\n\nhttps://de.wikipedia.org/wiki/Kunst","replies":[{"poster":"A Ryze From Dead","date":"2018-01-08T15:50:21.618+0000","up_votes":1,"down_votes":0,"body":"Ich wünschte jeder würde Sprache eindeutig und unmissverständlich, wie sie in ihren Ursprüngen definiert ist benutzen. Das ist aber leider nicht der Fall, was man an der sich stetig änderen \"Umgangssprache\" und zahllosen Dialekten und anderen Sprachen erkennt.\n\nSelbst wenn man die Bedeutung jedes Wortes in seinem Ursprung einwandfrei kennt ist das noch keine Garantie jemand anderen zu verstehen. Daher spielt Interpretation (und Kontext) auch eine wichtige Rolle. Und wie es der Zufall nun möchte habe ich _Chubacraba_ falsch interpretiert, größtenteils wegen fehlenden Wissen in Literatur welche er als selbstverständlich vorhanden vorausgesetzt hat. Eine Lappalie.","replies":[{"poster":"Waldschrat86","date":"2018-01-09T13:25:35.796+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=A Ryze From Dead,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=00030001000000010000,timestamp=2018-01-08T15:50:21.618+0000)\n>\n> Ich wünschte jeder würde Sprache eindeutig und unmissverständlich, wie sie in ihren Ursprüngen definiert ist benutzen. Das ist aber leider nicht der Fall, was man an der sich stetig änderen &quot;Umgangssprache&quot; und zahllosen Dialekten und anderen Sprachen erkennt.\n> \n> Selbst wenn man die Bedeutung jedes Wortes in seinem Ursprung einwandfrei kennt ist das noch keine Garantie jemand anderen zu verstehen. Daher spielt Interpretation (und Kontext) auch eine wichtige Rolle. Und wie es der Zufall nun möchte habe ich _Chubacraba_ falsch interpretiert, größtenteils wegen fehlenden Wissen in Literatur welche er als selbstverständlich vorhanden vorausgesetzt hat. Eine Lappalie.\n\nSprache war noch nie eindeutig und unmissverständlich^^","replies":[]}]}]},{"poster":"Chubacraba","date":"2018-01-07T21:28:33.618+0000","up_votes":2,"down_votes":0,"body":"Da es sich bei „Die Kunst des Krieges“ um den Titel des Buches handelt wird sich dieser nur schwer umgehen lassen. Denn sollte ich es machen, würden wohl viele nicht wissen, dass eben Sun Tsu’s Werk damit gemeint ist.\nAllerdings hätte ich auch hinzufügen können, dass es sich um ein Buch eben jenes Autors und Philosophen handelt. Mir war nicht bewusst, dass das so zu Missverständnissen führen kann. Tja, man lernt eben nicht aus ;)\n\nKleine Anmerkung:\nEs handelt sich um ein mögliches Thema für Videos, in welchen ich dann natürlich näher erläutern würde, was genau damit gemeint ist.","replies":[{"poster":"A Ryze From Dead","date":"2018-01-07T23:18:25.758+0000","up_votes":1,"down_votes":0,"body":"Ich messe dir keinen Fehler bei, Menschen kommen nunmal aus verschiedenen Welten, was nicht zwingend heißt dass eine von ihnen falsch sein muss.\n\nDas Werk hat jedoch mein Interesse geweckt, ich werde mich diesem unter Umständen widmen.","replies":[{"poster":"Chubacraba","date":"2018-01-08T22:58:50.971+0000","up_votes":1,"down_votes":0,"body":"Freut mich zu hören, es ist zwar recht abstrakt und seltsam geschrieben (naja, für 2500 Jahre ...), aber man kann sich schon das ein oder andere davon ableiten.\nEs gibt das als e-Book kostenlos im Internet (glaube ich), sowie als (leider unvollständige) Hörbuchversion auf Youtube","replies":[]}]}]}]}]}]},{"poster":"SJW GAREN","date":"2018-01-07T13:07:26.793+0000","up_votes":1,"down_votes":0,"body":"Nix für ungut, aber meiner Auffassung nach hat das mit Philosophie so ziemlich gar nix zu tun. \"Warum wollen spieler climben\" ist letztenendes nix anderes als \"Warum sehnen sich Menschen nach Erfolg / Anerkennung / Wettbewerb?\". Und das ist meiner Auffassung nach eher eine Frage, die man einem Psychologen stellen sollte als nem Philosophen.\n\n> [{quoted}](name=Chubacraba,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=,timestamp=2018-01-06T15:56:16.545+0000)\n> - Sind Spieler mit einer hohen Elo auch automatisch intelligent(er)?\n>\n\nKeine philosophische Frage - weiß nicht genau welcher Fachbereich sich mit sowas auseinandersetzt, aber ich vermute mal dass ich auch hier mit Psychologie zumindestens nicht vollkommen daneben liege.\n\n> [{quoted}](name=Chubacraba,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=,timestamp=2018-01-06T15:56:16.545+0000)\n> - Kann man von LoL f&amp;uuml;r das &amp;quot;echte&amp;quot; Leben etwas lernen, und wenn ja - was?\n>\n\nNo.\n\n> [{quoted}](name=Chubacraba,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=,timestamp=2018-01-06T15:56:16.545+0000)\n> - Wie (mit welchen Methoden) Riotgames, Streamer und Youtuber uns, also die Spieler und Zuschauer, manipuliert.\n>\n\nWieder eher Psychologie\n\n> [{quoted}](name=Chubacraba,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=,timestamp=2018-01-06T15:56:16.545+0000)\n> - Sprachen lernen mit LoL\n>\n\nHat definitiv nichts mit Philo zu tun\n\n> [{quoted}](name=Chubacraba,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=,timestamp=2018-01-06T15:56:16.545+0000)\n> - Anwendung von Sporttheorien auf LoL bzw den e-Sport im Allgemeinen (z.B. die Ern&amp;auml;hrung und welchen Einfluss die hat)\n>\n\nDito.","replies":[{"poster":"Chubacraba","date":"2018-01-07T20:10:39.782+0000","up_votes":3,"down_votes":0,"body":"Laut Wikipedia wird Philosophie folgendermaßen definiert:\n\n\"In der Philosophie [...] wird versucht, die Welt und die menschliche Existenz zu ergründen, zu deuten und zu verstehen.\nVon anderen Wissenschaftsdisziplinen unterscheidet sich die Philosophie dadurch, dass sie sich oft nicht auf ein spezielles Gebiet oder eine bestimmte Methodologie begrenzt, sondern durch die Art ihrer Fragestellungen und ihre besondere Herangehensweise an ihre vielfältigen Gegenstandsbereiche charakterisiert ist.\"\n\nIch finde, das passt doch eigentlich ganz gut. Was verstehst du denn unter Philosophie?\n\nMir ist bewusst, dass viele der angesprochen Themen sich gleichzeitig natürlich mit anderen Wissenschaftsbereichen überschneiden, aber sowas ist im allgemeinen eher die Regel als die Ausnahme. Zumal es ja auch so ist, dass lang nicht alle Themen psychologischer Natur sind. Ich versuche auch gar nicht diese in irgendwelche Kategorien zu pressen. Daher schien mir das Ding mit Philosophie am naheliegendsten.","replies":[]},{"poster":"Avorox","date":"2018-01-07T13:37:46.326+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Bobby Barrows,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=0004,timestamp=2018-01-07T13:07:26.793+0000)\n>\n> Keine philosophische Frage - weiß nicht genau welcher Fachbereich sich mit sowas auseinandersetzt, aber ich vermute mal dass ich auch hier mit Psychologie zumindestens nicht vollkommen daneben liege.\n\nDas ist eine Frage für Statistiker, kann man aber auch einfach ganz stumpf mit \"ja\" beantworten.","replies":[{"poster":"Chubacraba","date":"2018-01-07T20:02:24.635+0000","up_votes":1,"down_votes":0,"body":"Das mit einer handfesten Statistik zu Untermauern hätte natürlich einiges für sich. Nur fürchte ich, dass sich sowas nur schwer realisieren ließe. Zudem auch hier wieder die Frage im Raum steht was Intelligenz eigentlich ist. Mir ist die Idee gekommen, als mir von Youtube irgendwelche Videos mit dem Titeln wie \"200 IQ BIG PLAYS\" angezeigt wurden.\nWie kommst du zu der Annahme dies mit einem stumpfen \"Ja\" beantworten zu können?","replies":[{"poster":"Avorox","date":"2018-01-07T20:44:37.198+0000","up_votes":2,"down_votes":0,"body":"Weil das Spiel ziemlich komplex ist und man um wirklich gut zu spielen viel berücksichtigen und planen muss. Das erfordert eben ein gewisses Maß an Intelligenz. Natürlich kann man nicht sagen jemand in Gold ist intelligenter als in Silber aber ich würde behaupten, dass das tendenziell (sofern die Leute auch tatsächlich aktiv spielen, schon in diese Richtung geht.","replies":[]}]}]},{"poster":"eingew","date":"2018-01-07T17:49:09.557+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bobby Barrows,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=0004,timestamp=2018-01-07T13:07:26.793+0000)\n>\n> Nix für ungut, aber meiner Auffassung nach hat das mit Philosophie so ziemlich gar nix zu tun. &quot;Warum wollen spieler climben&quot; ist letztenendes nix anderes als &quot;Warum sehnen sich Menschen nach Erfolg / Anerkennung / Wettbewerb?&quot;. Und das ist meiner Auffassung nach eher eine Frage, die man einem Psychologen stellen sollte als nem Philosophen.\n\nNicht umsonst wird die Philosophie als Grundlage aller Wissenschaften betrachtet. Auch wenn es natürlich auch eine psychologische Frage, so kann man durchaus auch auf Grundlage der Philosophie über Computerspiele nachdenken.","replies":[{"poster":"SJW GAREN","date":"2018-01-07T19:26:15.484+0000","up_votes":1,"down_votes":0,"body":"Erklär mir das doch mal am o. g. Beispiel.","replies":[{"poster":"eingew","date":"2018-01-08T08:12:32.677+0000","up_votes":2,"down_votes":0,"body":"Der Hedonismus ist bspw ein philosophisches Prinzip. Aufsteigen auf einer Rangliste bedeutet doch immer auch, dass man Freude steigert und Leid vermeidet.","replies":[]}]}]}]},{"poster":"Pilze","date":"2018-01-06T23:17:54.117+0000","up_votes":1,"down_votes":0,"body":"Nein Spieler mit einer hohen Elo sind nicht intelligenter als andere, sich haben lediglich mehr Erfahrung als Andere. Sei in LoL oder von anderen Spielen, desweiterem ist nicht für jeden ein Spiel der Mittelpunkt seines Lebens. \nAus einem Videospiel kann man gar nichts fürs Leben lernen, es ist und bleibt ein Spiel was das Leben nun mal nicht ist. Mache ich im Leben einen Fehler kann das unter Umständen einen Menschen das Leben kosten, bei einem Videospiel startet man neu und alle sind zufrieden. \nSporttheorien funktionieren auch nicht insbesondere bei körperlichen Sport. Ich bin Hochleistungssportler ( das nur als Hobby ) und bewege mich dort schon im High End Bereich ( wie man so schön sagt ) bin ich deswegen intelligenter? Nein ich habe einfach mehr Erfahrung als andere, mehr auch nicht. \nEin Videospiel ist und bleibt einfache Logik von 1 und 0, wer viel spielt wird irgendwann Erfolg haben.","replies":[{"poster":"Avorox","date":"2018-01-07T13:41:44.282+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SuppandOrder,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=0002,timestamp=2018-01-06T23:17:54.117+0000)\n>\n> Nein Spieler mit einer hohen Elo sind nicht intelligenter als andere, sich haben lediglich mehr Erfahrung als Andere. \n\nBullshit. Erfahrung kannst du nicht mit Skill gleichsetzen und der macht den Unterschied zwischen lower und Higher Elo aus. Da ein sehr relevanter Teil des Skills in League das Macrogameplay ist und das eben die Fähigkeit beschreibt, die Spielsituation richtig zu analysieren und daraus Entscheidungen für die nächsten Aktionen zu bilden. Intelligenter muss man dafür nicht sein, in dem Punkt hast du Recht. Aber mit der Erfahrung hat das nur wenig bis gar nichts zutun.","replies":[{"poster":"SJW GAREN","date":"2018-01-07T15:24:06.511+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Avorox,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=00020001,timestamp=2018-01-07T13:41:44.282+0000)\n>\n> Bullshit. Erfahrung kannst du nicht mit Skill gleichsetzen und der macht den Unterschied zwischen lower und Higher Elo aus. Da ein sehr relevanter Teil des Skills in League das Macrogameplay ist und das eben die Fähigkeit beschreibt, die Spielsituation richtig zu analysieren und daraus Entscheidungen für die nächsten Aktionen zu bilden. Intelligenter muss man dafür nicht sein, in dem Punkt hast du Recht. Aber mit der Erfahrung hat das nur wenig bis gar nichts zutun.\n\nErfahrung ist denk ich ein Teil dessen, was einen guten Spieler (Spieler mit hohem Skill?) ausmacht, aber nicht alles. Analytische Fähigkeiten und körperliche Fähigkeiten zählen wohl auch mit rein. Und naja, fehlendes Spielverständnis und analytische Fähigkeiten kann man denke ich schon durch Erfahrung kompensieren, zumindestens bis zu einem gewissen Punkt. Statt einer tatsächlichen Analyse der Situation und der möglichen Optionen und Folgen könnte dann beispielsweise ein starres \"Ok, wenn X passiert dann mach ich Y.\" stehen. Optimal ists nicht, aber auch so kann man nach Diamond kommen.","replies":[{"poster":"Megamaexx","date":"2018-01-07T16:44:01.367+0000","up_votes":3,"down_votes":0,"body":"Und dann gibt es Spieler, die jahrelang Bronze sind. Erfahrung sammeln bringt einem nichts, wenn man diese nicht auch verwertet.","replies":[{"poster":"eingew","date":"2018-01-07T17:54:05.059+0000","up_votes":2,"down_votes":0,"body":"This. Da gibt es tatsächlich ebenfalls schon Studien zu, ob zB ältere Menschen bessere Entscheidungen treffen, als junge. Und tatsächlich ist es so, dass sich die Qualität der Entscheidungen kaum Unterscheidet. Wichtig ist weniger, wie viel Erfahrung man gesammelt hat, sondern inwiefern man in der Lage ist, aus ihr zu Lernen und die gemachten Fehler zu korrigieren. Das erfordert Selbstreflexion und Arbeit und nicht jeder Spieler ist gewillt (oder in der Lage) beides effektiv umzusetzen. Da sind einige immer besser als andere und das hat sicherlich auch mit Intelligenz zu tun.\nVor allem wenn es dann um die Kreation neuer Taktiken geht wird nicht jeder gleich erfolgreich sein und anders kommt man mitunter ab einer gewissen Elo womöglich nicht mehr weiter.","replies":[{"poster":"Chubacraba","date":"2018-01-07T20:22:29.267+0000","up_votes":2,"down_votes":0,"body":"Dem kann ich mich nur anschließen. Was jetzt nun dazu führt warum jemand \"low Elo oder \"high Elo\" ist, dafür gibt es die verschiedensten Gründe. Ich kann mir gut vorstellen, dass Intelligenz einer davon ist, aber es gibt eben natürlich auch diverse andere. Wie entscheidend der eine oder der andere für den Erfolg letztendlich sind kann ich nur mutmaßen, dafür bräuchte es wohl eine wissenschaftliche Untersuchung.","replies":[]}]}]},{"poster":"Pilze","date":"2018-01-08T18:09:06.647+0000","up_votes":1,"down_votes":0,"body":"Ich verstehe das schon, man will gerne glauben das man ein besserer oder intelligenter Mensch ist als jemand der anscheinend zu Dumm ist um in der Elo zu steigen. Nehmen wir mich mal, ich spiele das Spiel schon sehr lange habe viel Erfahrungen gesammelt und spiele konstant auf dem Nivea. Reicht mir weil ich persönlich keinen Grund sehe mich jetzt reinzuhängen um mich mit einem high Elo Symbol zu schmücken. Gut jetzt werden andere sagen: Klar würde ich jetzt auch sagen. Gutes Argument. \nIm Berufsleben kontrolliere und Steuer ich eine Anlage die über mehrere Etage geht und so groß ist wie ein mehr Familien Haus, ich habe die gesamte Anlage im Kopf und weiß genau was wo passiert ( nein ich sitze nicht in einer Warte ) und wo Fehler passieren können. Im Sportler Leben laufe ich Ultramarathon, heißt im Klartext ich habe die zulaufene Strecke ( die meist 100 km sind ) im Kopf, jeder Berg, jede Kurve. \nIn beiden Leben muss ich also auf Situation reagieren die ich nicht unbedingt voraussehen kann. Aber ich kann das nicht weil ich so unglaublich Intelligent bin, nein ich habe gelernt und viel Energie in diese Sachen gesteckt. \nLernen und Übung haben rein gar nichts mit Intelligenz zu tun. \nSkill? Was bedeutet das ? Eine angeborene Fähigkeit ein Videospiel zu spielen? Skill entsteht durch eine immer wiederkehrende Situation die man auf verschwinde Art und Weisen gemeistert hat. Man weiß was man machen muss um diese Situation zu seinem Vorteil zu nutzen, mehr ist das nicht.","replies":[{"poster":"Chubacraba","date":"2018-01-08T22:56:31.835+0000","up_votes":1,"down_votes":0,"body":"> Lernen und Übung haben rein gar nichts mit Intelligenz zu tun.\nSkill? Was bedeutet das ? Eine angeborene Fähigkeit ein Videospiel zu spielen? Skill entsteht durch eine immer wiederkehrende Situation die man auf verschwinde Art und Weisen gemeistert hat. Man weiß was man machen muss um diese Situation zu seinem Vorteil zu nutzen, mehr ist das nicht.\n\nSchwierig zusagen, inwieweit Intelligenz etwas mit lernen zu tun hat. Je nach dem, wie man Intelligenz definiert, könnte man zum Beispiel sagen, dass Intelligenz nicht nur, aber auch über die Geschwindigkeit bestimmt, mit der etwas neues erlernt wird.\nDas Skill nicht angeboren ist, sondern erlernt, das denke ich auch. Vielleicht gibt es das ein oder andere das angeboren ist (z.B. die geschwindigkeit mit der unser Gehirn informationen verarbeiten kann), aber im großen und ganzen ist es doch eine erlernte Fähigkeit, die sich aus ganz vielen Teilfähigkeiten zusammensetzt.\n\n> Man weiß was man machen muss um diese Situation zu seinem Vorteil zu nutzen, mehr ist das nicht.\n\nSo würde ich das nicht sagen, da gehört schon mehr dazu. Ich mein, jedes Kind weiß, dass es von Vorteil wäre nicht zu rauchen, und doch tun es Millionen alleine in Deutschland. Mit mangelnder Intelligenz hat das nicht zu tun, Entscheidungen werden am Ende nicht von unserem rationalen Gehirn, dem präfortalen Kortex, getroffen sondern im Limbischen System, dem emotionalen Teil des Gehirn. Wenn also der Präfrontale Kortex sagt \"Rauchen ist ungesund, das sollte ich nicht tun\" hat es nur sehr wenig Macht sich durchzusetzen im Vergleich zu dem \"Rauchen ist angenehm\" des limbischen Systems.\n\nfalls ich hier was falsches von mir gebe, bitte berichtigt mich ^^","replies":[{"poster":"Pilze","date":"2018-01-10T19:20:34.563+0000","up_votes":2,"down_votes":0,"body":"Aber die Frage ist wirklich sehr interessant. Sry  das ich nicht sofort antworten kann, wie gesagt mein Hobby nimmt eine Menge Zeit in Anspruch. \nIch habe mal darüber nachgedacht und erstaunlich doch eine Parallele entdeckt. \nIch habe weiter oben schon mal erwähnt das ich Ultramarathon laufe ( für die nichts damit anfangen können alles über 42 km ). Bei den Läufern stellt sich bei einigen ( eigentlich schon zu vielen ) eine gewisse Arroganz ein weil sie in der Lage sind so weit zu laufen. Beim Start steht man mit den Kurzstrecken Läufer an der Linie und während man wartet fragen einige ( weil sie meist den Laufrucksack sehen ) wie sowas überhaupt zu schaffen ist. Viele ignorieren diese Leute oder antworten nur kurz und knapp ( meist mit herablassenden Antworten ). \nDas gleiche ist hier der Fall. Der der nicht aufsteigen kann ist einfach Blöd. \nWie gesagt ich kann gut verstehen das man sich gerne als etwas besseres oder intelligenter sehen will, als andere. Aber das trifft wirklich nur in 5% der Fälle zu, viele wissen nicht wie sie es schaffen sollen oder können einfach nicht die Ruhe und Geduld aufbringen die für den Erfolg nötig ist. \nAndere wollen einfach nur den Nervenkitzel haben der beim Ranked aufkommt, ob sie jetzt gewinnen oder verlieren ist völlig egal ( so geht es mir ). Klar tut man sein bestes und man wird auch bestimmt schleichend besser, aber wenn es für mehr nicht reicht ist das ok. \nIch glaube bei der ganzen Sache geht es um Anerkennung, ist einfach so das man mit ganz anderen Augen gesehen wird wenn Leute auf Messen oder anderswo erfahren das man Diamond oder höher ist. \nIst bei den Läufern nicht anders, viele sehen Ultraläufer fast schon als Übermenschen an ( das lässt die Brust anschwellen ).","replies":[]}]}]}]}]},{"poster":"eingew","date":"2018-01-07T12:47:18.899+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SuppandOrder,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=0002,timestamp=2018-01-06T23:17:54.117+0000)\n>\n> Aus einem Videospiel kann man gar nichts fürs Leben lernen, es ist und bleibt ein Spiel was das Leben nun mal nicht ist. \n\nAlso nichts für ungut, aber das würde ich auf deine mangelnde Fantasie zurückführen, nicht darauf, dass man aus LoL nichts fürs Leben lernt. Gerade wie man mit demotivierten Menschen umgeht und wie Menschen im Allgemeinen auf Stress reagieren lernt man in LoL sehr gut mMn.\n\n> Mache ich im Leben einen Fehler kann das unter Umständen einen Menschen das Leben kosten, bei einem Videospiel startet man neu und alle sind zufrieden. \n\nUnd das soll verhindern, dass man nichts daraus lernt? Übung macht doch wohl den Meister. Und wenn ich in Computerspielen geübt bin, macht mich das auch im realen Leben leistungsfähiger bei Aufgaben die ähnliche Fähigkeiten beanspruchen (bestes Beispiel wäre da wohl Autofahren). Dadurch passieren mir weniger Fehler, unabhängig davon ob die Konsequenzen jetzt so krass sind, wie du sie dir ausmalst, oder nicht.\n\nNicht umsonst sind auch sowohl Europäer als auch Asiaten mit jeweils einem hochgradig komplexen taktischen Spiel um die Ecke gekommen, welches einem durchaus dabei hilft, Grundlagen der Kriegsführung näher zu legen.\n\nEDIT: Gerade fällt mir noch folgendes ein:\n\nhttps://www.youtube.com/watch?v=FktsFcooIG8","replies":[{"poster":"Pilze","date":"2018-01-08T18:11:58.980+0000","up_votes":1,"down_votes":0,"body":"Was für eine Fantasie? Also wenn du glaubst das du das Leben mit einer Fantasiewelt vergleichen kannst oder du irgendeinem Nutzen aus Videospielen ziehen kannst, dann gute Nacht Zukunft. \nSolltest du aus einem Videospiel tatsächlich etwas lernen können, schlage ich vor du solltest dringend du Schule von vorne Anfangen.","replies":[{"poster":"Phinnie","date":"2018-01-14T22:42:07.578+0000","up_votes":2,"down_votes":0,"body":"Da man die These dann auch analog auf andere Medien anwenden könnte, heißt das im Umkehrschluss, dass man aus Büchern oder Filmen beispielsweise auch nichts lernen kann?\n\nGanz unabhängig davon, was diverse Medien an konkreten Inhalten bieten, sind sie mindestens von einem entwicklungs- und lernpsychologischen Nutzen. Einmal ganz simpel als eine Art Motivation, da man eher gewillt ist sich mit Medien und Themen aus seiner eigenen Lebenswelt zu beschäftigen, besonders im Jugendalter, wo wir dann bei der Entwicklungspsychologie wären. Viele Fachdidaktiker aus der Ethik meinen sogar, dass man im Ethikunterricht immer mit einem lebensweltlichen Problem und am besten einem passenden Medium einsteigt. Aus Videospielen kann man anscheinend zumindest so viel lernen, dass Didaktiker darauf so aufmerksam geworden sind, dass man Videospiele im Unterricht mittlerweile im Lehramtsstudium teilweise schon thematisiert ;) \n\nUmso mehr freu ich mich übrigens über die Frage in dem Thread, um mal den ursprünglichen Verfasser zu loben :D Ich schreibe momentan auch an meiner Bachelorarbeit zum sinnvollen Einsatz von Videospielen im LER-Unterricht (Lebensgestaltung-Ethik-Religionskunde). Spannendes Thema, auch in anderen Fächern und zum allgemeinen auch außerschulischen Lernen ;D","replies":[{"poster":"Pilze","date":"2018-01-16T10:35:36.343+0000","up_votes":1,"down_votes":0,"body":"Du sprichst hier von Fachliteratur und Dokumentation die ich und eine Menge anderer Menschen wohl kaum zu einem normalen Film oder Fantasie Buch zählen würde. \nDas Medien im Unterricht zum Einsatz kommen war schon immer vollkommen normal, sollten aber Videospiele im Unterricht platz bekommen denke ich nicht das League of Legends eines davon wäre. Wohl eher Lernspiele die man wohl kaum mit MMORPG, Shooter, MOBA oder sonst was vergleichen kann. \nDie Frage ist was soll man aus so etwas lernen? Die zwischenmenschliche Beziehung ist bei vielen ohne hin schon vollkommen marode und einige können sich kaum richtig unterhalten. Handwerklich sind einige schon so schlecht die bringen sich sogar mit einem Staubsauger um. \nWas ich einfach damit sagen will und das meine ich wirklich. Sollten irgendwann die Jugendlich oder Kinder aus Fantasiespielen und Büchern oder ähnliches etwas lernen, haben wir ein echtes Problem.","replies":[]}]},{"poster":"Chubacraba","date":"2018-01-08T22:45:42.445+0000","up_votes":2,"down_votes":0,"body":"Aber Hallo natürlich kann man das und das sehr gut! Warum denkst du denn, dass es schädlich sein kann daraus einen Nutzen zu ziehen? Das ist doch eher positiv, wenn man seine Zeit nicht \"verschwendet\". Wer lernen ununterbrochen, jeden Tag, ein Leben lang. So natürlich auch in LoL","replies":[]},{"poster":"eingew","date":"2018-01-09T08:09:57.200+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SuppandOrder,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=000200000000,timestamp=2018-01-08T18:11:58.980+0000)\n>\n> Was für eine Fantasie? \n\nqed?\n\n> Also wenn du glaubst das du das Leben mit einer Fantasiewelt vergleichen kannst oder du irgendeinem Nutzen aus Videospielen ziehen kannst, dann gute Nacht Zukunft. \n> Solltest du aus einem Videospiel tatsächlich etwas lernen können, schlage ich vor du solltest dringend du Schule von vorne Anfangen.\n\nAuch wenn dies gemeinhin als eine der niedersten Formen der Rhetorik gilt, möchte ich dies mit einer Frage beantworten: Warum ist Literatur von Wert?","replies":[]}]}]}]},{"poster":"Mój Imbé","date":"2018-01-06T16:41:02.817+0000","up_votes":3,"down_votes":0,"body":"Mit den Fragen kann man arbeiten {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Pandeonor","date":"2018-01-06T18:05:48.486+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Chubacraba,realm=EUW,application-id=KYnfKGf0,discussion-id=rKBt3E8V,comment-id=,timestamp=2018-01-06T15:56:16.545+0000)\n>\n> \n> - Warum will man eigentlich &amp;quot;climben&amp;quot;? (wie schon oben erw&amp;auml;hnt)\n\nWeil Erfolg angenehmer ist als Misserfolg.\n\n> - Sind Spieler mit einer hohen Elo auch automatisch intelligent(er)?\n\nNicht automatisch im Sinne von \"zwingend\" aber vermutlich tendenziell bzw. im Durchschnitt. Man muss relativ viel im Kopf behalten können, vorausplanen und Makrowissen anwenden können. Ein \"intelligenter\" (tm) Mensch ist _besser_ in der Lage ein komplexes Problem als ganzes zu betrachten. Wer Probleme damit hat muss es in separate Bereiche zerlegen und bearbeiten. Dabei gehen die Betrachtung als ganzes und die Wechselwirkungen verloren. Ich nehme an das Napoleon kein Dummkopf war. \nSchach ist das älteste Kriegsspiel. Man geht allgemein davon aus das gute Schaspieler näherungsweise intelligenter sind. [Und das diese Spielzüge und Spielstände abgespeichert haben]\n\n> - Kann man von LoL f&amp;uuml;r das &amp;quot;echte&amp;quot; Leben etwas lernen, und wenn ja - was?\n\nTeamplay und über das Bann-/Strafsystem als Rückkoppelung auch das man sich zurücknehmen muss. Also grob \"soziale Interaktion\". Dazu noch: aus Niederlagen lernen, Risikoabschätzungen erlernen usw..\n\n> - Wie (mit welchen Methoden) Riotgames, Streamer und Youtuber uns, also die Spieler und Zuschauer, manipuliert.\n\nPft. Hätten die gerne ^^. Die kochen auch nur mit Wasser und haben Null Ahnung. Nichts was über das normale \"Wissen\" der Werbebranche hinausgeht. Eher trial and error.\n\n> - Sprachen lernen mit LoL\n\nNa ja. Englisch vielleicht. Also - einzelne Vokabeln. Da hier auf EUW aber wohl die Englisch-noobs sich unterhalten wird wohl eher Denglisch gelernt ^^. Immerhin einzelne Vokabeln werden wohl gelernt.\n\n> - Anwendung von Sporttheorien auf LoL bzw den e-Sport im Allgemeinen (z.B. die Ern&amp;auml;hrung und welchen Einfluss die hat)\n\nDarüber gibt es Abhandlungen. Habe letztens eine überflogen (war m.E. was mit Ernährung) aber glücklich vergessen (die hatten Koreaner mit/ohne speziellem Essen in ein Lager gesteckt und Performance davor/danach gemessen). Muss nichts brennend interessantes gewesen sein. Halte ich auch für wenig zielführend bzw. Unfug.\n\n \nAnsonsten nochn interessant das es für die Tätigkeit des \"Spielens\" als solches verschiedene Theorien gibt. Von abreagieren über assimilieren, aktivieren....","replies":[{"poster":"Chubacraba","date":"2018-01-06T19:47:21.872+0000","up_votes":2,"down_votes":0,"body":"> Pft. Hätten die gerne ^^. Die kochen auch nur mit Wasser und haben Null Ahnung. Nichts was über das normale \"Wissen\" der Werbebranche hinausgeht. Eher trial and error.\n\nVielleicht ist \"manipulieren\" falsch gewählt und ich hätte besser \"beeinflussen\" sagen sollen, da dies nicht so negativ behaftet ist.\nIch gehe jetzt auch nicht davon aus, dass die jetzt hier die große Manipulationsmaschinerie dahinter ist. Aber auch schon diese allgemeinen Werbetricks haben ja auch schon eine große Wirkung. Zum Beispiel das Prinzip vom Sonderangebot. Egal ob hier oder im Supermarkt, die sind immer, meist zeitlich, begrenzt (\"nur heute, und nur bei Real...\"). Es wird eine künstliche Knappheit erzeugt. Und in uns Menschen ist es verankert, dass wenn etwas nur begrenzt vorhanden ist, dass wir automatisch Angst bekommen zu kurz zu kommen. Dadurch wird das angebotene Objekt gleich begehrenswerter. Dabei spielt es nicht einmal eine Rolle, ob wir den Scheiß, den man uns da andrehen will, überhaupt brauchen.\n\n> Na ja. Englisch vielleicht. Also - einzelne Vokabeln. Da hier auf EUW aber wohl die Englisch-noobs sich unterhalten wird wohl eher Denglisch gelernt ^^. Immerhin einzelne Vokabeln werden wohl gelernt.\n\nIch glaube auch nicht, dass der Chat viel hergibt um sein Englisch aufzubessern. Ich dachte mehr an den Clienten und das Spiel an sich. Wenn man das auf englisch hat schwirren da unzählige Begriffe umher, die man lernen könnte, und da man mit ihnen auch regelmäßig kontakt hat, sie sich auch besser merkt. Ich denke da vorallem an die Dinge, die dein Champion immer vor sich gibt. Gut, bei Gnar jetzt nicht so viel ... aber im allgemeinen denke ich schon, dass man da einige Wörter lernen kann.\n\n> Darüber gibt es Abhandlungen. Habe letztens eine überflogen (war m.E. was mit Ernährung) aber glücklich vergessen (die hatten Koreaner mit/ohne speziellem Essen in ein Lager gesteckt und Performance davor/danach gemessen). Muss nichts brennend interessantes gewesen sein. Halte ich auch für wenig zielführend bzw. Unfug.\n\nMit Ernährung meine ich nicht Steroide für Gamer, sondern mehr so grundlegende Dinge, die oft nicht beachtet werden. Zum Beispiel, dass man regelmäßig trinken sollte, damit das Blut besser zirkulieren kann. Oder dass Zucker zu einer deutlichen schlechteren Konzentration führt, da hier zwar der Blutzuckerspiegel schnell ansteigt aber genauso rapide wieder abfällt. Viel besser sind da so Sachen wie Gemüse oder Vollkornkram, da diese sehr Faserhaltig sind, was zu einem langsamen Anstieg des Blutzuckerspiegels führt, der dann auch nicht so schnell wieder absinkt.\n\n> Ansonsten nochn interessant das es für die Tätigkeit des \"Spielens\" als solches verschiedene Theorien gibt. Von abreagieren über assimilieren, aktivieren....\n\nSowas würde mich interessieren! Ich finde es sehr schade, dass man fast ausschließlich nur so Dinge findet die sich mit dem Micro und manchmal auch Macrospiel auseinander setzen, aber niemand mit dem Spieler an sich, mit der Psychologie dahinter usw. Alles Dinge die enorm unterschätzt werden, ich würde sagen, es gibt inzwischen keinen Fußball Club mehr, der nicht für seine Spieler mindestens einen psychologischen Coach an der Seite hat.","replies":[{"poster":"eingew","date":"2018-01-07T12:42:55.023+0000","up_votes":2,"down_votes":0,"body":"Vielleicht interessieren dich folgende Videos:\n\nhttp://gdcvault.com/play/1017940/The-Science-Behind-Shaping-Player\nhttp://www.gdcvault.com/play/1020389/Enhancing-Sportsmanship-in-Online\nhttps://www.youtube.com/watch?v=a-5yKdpR0kU\nhttps://www.youtube.com/watch?v=nbYQ0AVVBGU\n\nGerade was das Coaching angeht interessiert dich vermutlich auch der Guide hier:\n\nhttp://forums.euw.leagueoflegends.com/board/showthread.php?t=1418213\n\nEinige der Artikel im Volunteerwiki beschäftigen sich ebenfalls mit psychologischen Effekten:\n\nhttp://en.volu-eu.org/library.php","replies":[]}]},{"poster":"Chubacraba","date":"2018-01-06T19:20:28.085+0000","up_votes":2,"down_votes":1,"body":"> Weil Erfolg angenehmer ist als Misserfolg.\n\nDas stimmt! Ich schätze mal, jeder möchte Erfolg haben und Misserfolg vermeiden. Doch was ist Erfolg? Das gewinnen eines Spiels? Eine möglichst hohe KDA? Dafür könnte man ja auch einfach Normal-Games spielen.\nIch denke mal, es geht beim climben, wo das Ziel ist einen möglichst hohen Rang zu erreichen, mehr als nur um das Gewinnen eines Spiels. Viel mehr geht es darum sich mit anderen zu messen, sich zu vergleichen, auch in der Hoffnung sich von diesen abzuheben. Es geht um Prestige, soziales Ansehen. So wie in anderen Sportarten auch, im Fußball etwa, oder früher auf einem mittelalterlichen Tunier. Je besser man war und je weiter man sichen von seinen Mitstreitern und Konkurrenten abheben konnte, desto größer das Ansehen. In gewisser Weise kann man also sagen, dass so ein Challenger Rahmen eine Art Statussymbol ist.\n\n> Nicht automatisch im Sinne von \"zwingend\" aber vermutlich tendenziell bzw. im Durchschnitt. Man muss relativ viel im Kopf behalten können, vorausplanen und Makrowissen anwenden können. Ein \"intelligenter\" (tm) Mensch ist besser in der Lage ein komplexes Problem als ganzes zu betrachten. Wer Probleme damit hat muss es in separate Bereiche zerlegen und bearbeiten. Dabei gehen die Betrachtung als ganzes und die Wechselwirkungen verloren. Ich nehme an das Napoleon kein Dummkopf war.\nSchach ist das älteste Kriegsspiel. Man geht allgemein davon aus das gute Schaspieler näherungsweise intelligenter sind. [Und das diese Spielzüge und Spielstände abgespeichert haben]\n\nHier haben wir das Problem, dass es keine allgemeine Definition von Intelligenz gibt. Und auch im Alltag versteht jeder etwas anderes darunter. Oft versteht man darunter auch eine schnelle Auffassungsgabe, die Geschwindigkeit, mit der Nervenzellen in unserem Gehirn kommunizieren, ein breit angelegtes Wissen, das Lösen von Problemen, oder schlicht, wer im Leben erfolgreich ist. Das sind ja auch alles Dinge die du angesprochen hast. Ich denke mal, wir können durchaus sagen, dass es Erfolg begünstigen kann. Kann aber eben nicht zwingend, wie du schon gesagt hast. Denn zum Gewinnen eines Spiels gehören weit mehr Dinge als die Intelligenz, die ist ein Aspekt von vielen. So wie in der Schule, wo auch nicht zwangsweise die Intelligenten die guten Noten haben.\nZusammengefasst kann man sagen, dass ein \"high-elo\"-Spieler nicht zwangsläufig intelligenter ist als andere und ein Bronze Spieler nicht automatisch dumm.\n\n> Teamplay und über das Bann-/Strafsystem als Rückkoppelung auch das man sich zurücknehmen muss. Also grob \"soziale Interaktion\". Dazu noch: aus Niederlagen lernen, Risikoabschätzungen erlernen usw..\n\nMir ist das bei dem Gedanken gekommen, dass viele Leute Spiele im allgemeinen als nutzlos abstempeln, und Videospiele ganz besonders. War zumindest so in meiner Familie :P Meine Idee war diesem Klischee auf den Grund zu gehen, also nicht nur in Bezug auf LoL sondern mehr im allgemeinen. Soziale Interaktion stimmt grundsätzlich schon, sollte aber etwas eingeschränkt werden. Soziale Interaktion in Computerspielen und allgemein im Internet läuft anders ab als im echten Leben, da man seinen Mitspielern nicht real Zusammen ist sondern nur via Chat, maximal Teamspeak kommuniziert. Da fallen wichtige Sachen wie Körpersprache weg, dadurch ist es auch viel leichter sich misszuverstehen.  Es kommt noch dazu, dass man sich in der Anonymität des Internets bewegt, wirkliche Strafen hat man ja nicht zu fürchten (maximal Chatrestriktion oder Bannen des Accounts, aber das muss man auch erstmal schaffen; und selbst dann kann man einfach einen neuen Account machen). Dementsprechend ist die Versuchung groß das auch auszunutzen.\nWobei es ja nicht so ist, dass assoziales Verhalten keine Folgen hat. Man bekommt ja schon immer wieder im Ladebildschirm gesagt, dass Leute, die sich unsportlich verhalten, auch häufiger verlieren. Scheint leider bei einigen nicht anzukommen :/\nIch schweife ab :D\nIch habe bei der Frage auch an solche Dinge gedacht wie Frusttoleranz, Ausdauer, Auge-Hand-Koordination, Reaktionsvermögen\n\nviel Spaß beim lesen :D, Runde zwei kommt gleich","replies":[]}]}]}