{"poster":"Teemonosaurio ","date":"2016-11-28T04:07:10.582+0000","title":"Mensaje alentador a los bronces...","subforum":"Charlas Generales","up_votes":4,"down_votes":23,"body":"No se gasten loco, no se maten en querer de subir de liga, no se gasten en serio loco porque es re al pedo, me rompi el culo para subir a oro (en otra cuenta, el 3 me dejan publicar en el foro recien Lucas2242), pero no se gasten porque es la misma mierda, ves a los mismos noobs, los mismos trolls y diria que peor todavia. \r\n\r\nRecien jugando una ranked, un boludito que se ve que no tenia nada mejor que hacer a la 1:00 am que ponerse a trollear, 10 min 6 muertes iba... todavia el cara dura decia: &quot;ufff, lo que pega la akali&quot; y mas valeee papaaa mas vale, le das 6 kills y queres que no pegue??!.\r\n\r\nLos mismos mancos que hay en bronce, exactamente igual, estan en oro y platino 0 diferencia hay. \r\nTenes desde el pelotudo troll, desde el pelotudo flamer, desde el fanero de yasuo y lee 0/40 partida por medio, las lineas sin wards, las se&ntilde;as que ignoran, los objetivos que no saben hacerlos, todo igual a bronce.\r\n\r\nIncreible que si hago un registro de mis ultimas 10 partidas, en las 10, minimo hay 4 personas que no saben que maestria usar, desde los zeds con fervor hasta los thresh con fervor, los adcs con maestrias de tanque, los tanques con se&ntilde;or del trueno, por eso les vuelvo a decir, no se maten en querer subir porque se van a decepcionar, es toda la misma mierda oro y platino...","replies":[{"poster":"Mazoku","date":"2016-11-28T04:22:24.238+0000","up_votes":1,"down_votes":5,"body":"Bronce amarillo es casi igual a bronce marron. No hay novedad ahi.","replies":[{"poster":"Teemonosaurio ","date":"2016-11-28T04:24:59.601+0000","up_votes":5,"down_votes":0,"body":"Lo mismo en el verde papu...","replies":[{"poster":"Mazoku","date":"2016-11-28T04:26:45.966+0000","up_votes":1,"down_votes":2,"body":"Platinoob? Na, ahi mejora UN POCO el nivel. Es una liga de transicion que dura hasta diamanco 3 aproximadamente.\n\nBasicamente tenes 3 ligas muy bajas que son la trinidad bronce: Marron, blanco y amarillo. Despues tenes las ligas intermedias que son platinoob y diamanco 5-4-3. Por ultimo encontras las ligas altas que son diamante 2-1, maestro y challenger.","replies":[{"poster":"Teemonosaurio ","date":"2016-11-28T04:28:30.203+0000","up_votes":4,"down_votes":1,"body":"Hasta platinos con rage quit porque fedeaban me tocaron, hasta otros fedeando y diciendo el tipico: laaggg...","replies":[{"poster":"Mazoku","date":"2016-11-28T04:31:33.997+0000","up_votes":2,"down_votes":3,"body":"***","replies":[{"poster":"Teemonosaurio ","date":"2016-11-28T05:26:05.209+0000","up_votes":4,"down_votes":1,"body":"Si?, se ve que sos fanero de algun platino... queres la foto cuando un platino que presumia le jugue un versus que me decia te voy a hacer mierda unranked, con cuenta lvl 1 y le rompi el orto?...\n\nPlatino/Oro= Bronce te duela o no papu ;)","replies":[{"poster":"Mazoku","date":"2016-11-28T05:34:47.973+0000","up_votes":1,"down_votes":1,"body":"No soy fanero de ningun platinoob. Solo digo, si te rompiste el orto para llegar a bronce amarillo claramente no te dan las manos.","replies":[{"poster":"Teemonosaurio ","date":"2016-11-28T05:38:58.010+0000","up_votes":3,"down_votes":1,"body":"Claramente sos boosted o carreado, no sabes lo que es pasar por bronce y plata solo, sin duo papu, nos vemos carreado :*\n\nPD: El que le este dando -1 a lo que dice no se quien es pero me cae bien ya jajaa ojala yo tambien pudiera dar con esta cuenta :c jaja","replies":[{"poster":"Mazoku","date":"2016-11-28T05:42:01.930+0000","up_votes":2,"down_votes":1,"body":"Bronce marron y bronce blanco son las 2 ligas mas faciles de salir. Eso es un dato objetivo, por algo riot penaliza a los eloboosters (gente que agarra una cuenta bajita como la tuya y la sube en 2 toques).\nPero bueno, eso no lo podes saber ya que estas atascado en bronce amarillo todavia jaja.\n\nSinceramente no se lo que es \"romperse el culo para salir de bronce\" cuando tenes promo helper y enemigos que juegan con el monitor apagado.\n\nYo juego solo mayoritariamente por si te interesa saber.","replies":[{"poster":"Zoliza","date":"2016-11-28T06:14:16.801+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mazoku,realm=LAS,application-id=v7qsfXsE,discussion-id=xKze6HoJ,comment-id=000200000000000000000000000000000000,timestamp=2016-11-28T05:42:01.930+0000)\n>\n> Bronce marron y bronce blanco son las 2 ligas mas faciles de salir. Eso es un dato objetivo, por algo riot penaliza a los eloboosters (gente que agarra una cuenta bajita como la tuya y la sube en 2 toques).\n> Pero bueno, eso no lo podes saber ya que estas atascado en bronce amarillo todavia jaja.\n> \n> Sinceramente no se lo que es &quot;romperse el culo para salir de bronce&quot; cuando tenes promo helper y enemigos que juegan con el monitor apagado.\n> \n> Yo juego solo mayoritariamente por si te interesa saber.\n\nNo te parece excesiva tu forma de dirigirte?  Hay eloboost en toda liga no se penaliza porque sea facil subir a gold, sino porque la mayoria paga para subir a gold por las recompenzas es muy diferente.\n\nHablas de bronces marron, blanco y amarillo cuando tenes 1200 ranked jugadas y seguis en platino 3. La season pasada fuiste platino y en esta con esa barbaridad de partidas no llegaste a Diamond 5 siquiera. Estas mas que lejos de ser referente de algo.","replies":[{"poster":"Mazoku","date":"2016-11-28T12:07:20.347+0000","up_votes":1,"down_votes":0,"body":"> No te parece excesiva tu forma de dirigirte? Hay eloboost en toda liga no se penaliza porque sea facil subir a gold, sino porque la mayoria paga para subir a gold por las recompenzas es muy diferente.\n\nMientras mas baja la liga mas facil es salir, justamente por eso el winrate decae y el precio aumenta.\n\n> Hablas de bronces marron, blanco y amarillo cuando tenes 1200 ranked jugadas y seguis en platino 3. La season pasada fuiste platino y en esta con esa barbaridad de partidas no llegaste a Diamond 5 siquiera. Estas mas que lejos de ser referente de algo.\n\nTengo muchos games porque se manejar todas las lineas y practicamente todos los champs al nivel de un platino. Ergo no maineo.\nPor ejemplo, ahora empece a usar heca y tengo maestria 4 y estoy subiendo bastante rapido (1 division por dia).","replies":[]}]}]}]}]}]}]}]},{"poster":"Zoliza","date":"2016-11-28T06:03:23.169+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mazoku,realm=LAS,application-id=v7qsfXsE,discussion-id=xKze6HoJ,comment-id=000200000000,timestamp=2016-11-28T04:26:45.966+0000)\n>\n> Platinoob? Na, ahi mejora UN POCO el nivel. Es una liga de transicion que dura hasta diamanco 3 aproximadamente.\n> \n> Basicamente tenes 3 ligas muy bajas que son la trinidad bronce: Marron, blanco y amarillo. Despues tenes las ligas intermedias que son platinoob y diamanco 5-4-3. Por ultimo encontras las ligas altas que son diamante 2-1, maestro y challenger.\n\nOro 1 y Platino 5 y 4 es la misma mierda, hasta es peor porque esta lleno de gente toxica estancada.","replies":[{"poster":"Mazoku","date":"2016-11-28T12:07:51.807+0000","up_votes":1,"down_votes":0,"body":"En algun lado hay que poner el limite. Y tanto riot como yo acordamos que el bronce termina donde termina el promo helper y comienza el decay de liga.","replies":[{"poster":"Zoliza","date":"2016-11-28T20:23:55.825+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mazoku,realm=LAS,application-id=v7qsfXsE,discussion-id=xKze6HoJ,comment-id=00020000000000010000,timestamp=2016-11-28T12:07:51.807+0000)\n>\n> En algun lado hay que poner el limite. Y tanto riot como yo acordamos que el bronce termina donde termina el promo helper y comienza el decay de liga.\n\nEl decay en platino y diamond es la mentira mas burda que vi en mi vida donde una persona que llego a un elo y no quiere bajar tiene que jugar 8 partidas 1 cada 28 dias durante toda la temporada para no bajar. \n\nIgual acepto tu punto de vista, es low elo, aunque platino para mi tambien lo es.","replies":[]}]}]}]}]}]},{"poster":"exrex","date":"2016-11-28T04:15:17.532+0000","up_votes":2,"down_votes":0,"body":"\"todavia el cara dura decia: \"ufff, lo que pega la akali\" y mas valeee papaaa mas vale, le das 6 kills y queres que no pegue??!.\"\nAh, como me cague de risa,","replies":[{"poster":"Teemonosaurio ","date":"2016-11-28T04:20:08.170+0000","up_votes":2,"down_votes":1,"body":"Te juro que el pibe lo dijo literalmente, pensaba que pegaba ilogicamente cuando la lleno de oro en 10 min...","replies":[]}]},{"poster":"Ziggy Stardust I","date":"2016-11-28T04:34:33.536+0000","up_votes":1,"down_votes":0,"body":"Esto pasa en todas las ligas y no va a dejar de pasar. Hasta en challenger trollean, ahi un monton ni se las toman en serio a las ranked (proplayers)\nLo que si, a medida que subis encontras menos gente asi pero bueno, siempre van a existir. Yo subi porque queria ver hasta donde llegaba, no para que no me toquen trolls o mancos, eso es una batalla perdida ya y lo acepte hace mucho","replies":[{"poster":"Teemonosaurio ","date":"2016-11-28T05:27:57.004+0000","up_votes":2,"down_votes":1,"body":"En challenger, master, no trollean, de diamante 2 para arriba, pueden ir 0/20, que siguen pusheando, siguen ayudando al team, siguen aportando, quieren ganar igual, aca no. Salen 0/20 y se enojan con todos y se van afk o se van autista a una linea sin importarles que esten tirando el nexo ni nada.","replies":[{"poster":"Zoliza","date":"2016-11-28T06:08:04.197+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Teemonosaurio ,realm=LAS,application-id=v7qsfXsE,discussion-id=xKze6HoJ,comment-id=00030000,timestamp=2016-11-28T05:27:57.004+0000)\n>\n> En challenger, master, no trollean, de diamante 2 para arriba, pueden ir 0/20, que siguen pusheando, siguen ayudando al team, siguen aportando, quieren ganar igual, aca no. Salen 0/20 y se enojan con todos y se van afk o se van autista a una linea sin importarles que esten tirando el nexo ni nada.\n\nTe comento que tengo amigos en challenger y veia gente trolleando igual y mas que al ser pocos se conocen todos y si jugan con gente que les cae mal no les importa irse afk o trollear, las de partidas que vi asi son increibles, en una trollea uno a la siguiente juegan de nuevo los mismos y trollea otro porque trolleo el otro en la anterior xD. Hay de todo no te creas todo lo que dicen. \nLa diferencia es que mientras mas subis de elo la gente aprende mas a dejarse carrear por sobre su ego el cual si van mal y ellos no son los que destacan prefieren cagarla y perder la partida a ganarla siendo un personaje secundario en la misma.","replies":[]}]}]},{"poster":"Geeik","date":"2016-11-28T15:54:20.979+0000","up_votes":1,"down_votes":0,"body":"1) Nada que ver, te dice \"alentador\" y es un post super pesimista\n\n2) Te la pasaste bardeando todo el post xD\n\n3) Y bueno... en ninguna liga se está libre de trolls y flamers, que queres...\n\n4) De vuelta, te la pasaste flameando todo el post enterito y decís sobre los flamers xD.\n\nSaludos hermano argentino (no sé, me pareciste argentino xD){{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Mugman Rojo","date":"2016-11-28T15:43:25.266+0000","up_votes":1,"down_votes":0,"body":"yo no se porque me esperaba el tipico que pone \"Que ya no pueden bajar maaas! Saludos :)\"","replies":[]},{"poster":"Sir Crucifix ","date":"2016-11-28T04:44:44.142+0000","up_votes":1,"down_votes":0,"body":"ganan los que mas juegan , aunque seas malo jugando 4 5  rankeds por dias podes terminar tranqui en oro","replies":[{"poster":"Zoliza","date":"2016-11-28T06:05:00.309+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sir Crucifix ,realm=LAS,application-id=v7qsfXsE,discussion-id=xKze6HoJ,comment-id=0004,timestamp=2016-11-28T04:44:44.142+0000)\n>\n> ganan los que mas juegan , aunque seas malo jugando 4 5  rankeds por dias podes terminar tranqui en oro\n\nO podes solo jugar 19 ranked en toda la temporada como yo y dejarla platino 5 (?)","replies":[{"poster":"Capitan Fin","date":"2016-11-28T07:07:27.921+0000","up_votes":1,"down_votes":2,"body":"Lo que dices no tiene lógica fuiste gold 1 en la temporada 5, al jugar las 10 primeras ranked si ganaste mas de 5 ya te posicionan en oro 2, y si ganaste entre de 8 o 10 ya te dejaron en el mismo oro 1 luego si tenes buen mmr en 4 partidas estas en promo y 3 mas para subir, no es la gran cosa,saludos cordiales.","replies":[{"poster":"Zoliza","date":"2016-11-28T15:38:56.797+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=King Of Support,realm=LAS,application-id=v7qsfXsE,discussion-id=xKze6HoJ,comment-id=000400000000,timestamp=2016-11-28T07:07:27.921+0000)\n>\n> Lo que dices no tiene lógica fuiste gold 1 en la temporada 5, al jugar las 10 primeras ranked si ganaste mas de 5 ya te posicionan en oro 2, y si ganaste entre de 8 o 10 ya te dejaron en el mismo oro 1 luego si tenes buen mmr en 4 partidas estas en promo y 3 mas para subir, no es la gran cosa,saludos cordiales.\n\nPrimero es mi smurf y si básicamente juego pocas partidas por temporada,  si quedé oro 1 y subí a platino con 79% de winrate en todas mis cuentas es más de lo que hace la mayoría. Es gracioso que me responda alguien que llora de los troll flammersy afk cuando la cuenta que menos winrate tengo es 65% ,  otra de mis smurf la subi de silver 1 a platino en 42 ranked totales seguro que yo tengo suerte y no me cruzo a todos los Trolls flammers y y afk de los que me hablas no? No es la gran cosa, solo jugué 10 ranked por temporada en esta cuenta y ya tenía más elo que vos, la subi a platino para cambiar un poco de Marco nomás :). Se juega ranked para mejorar y cuando mejoras llega sola la liga, si querés subir solo por un marco o recompensas y pensando que no te va a tocar gente molesta ni rankees.\n\n\nPd: conozco gente Diamond que bajo a silver con las primeras 10 cuando se reinicia la season, lo que define donde quedas es tu mmr no tu liga, por lo que tú conocimiento del sistema es más que pobre. Otro crypost de un pibe que perdió una ranked más, como si nadie en la comunidad nunca hubiese perdido o tocado un troll, un afk o simplemente fue stompeado por gente que jugo mucho mejor. \n\"Saludos cordiales\"","replies":[{"poster":"Capitan Fin","date":"2016-11-28T20:04:35.247+0000","up_votes":1,"down_votes":1,"body":"Es verdad no conozco mucho sobre el juego,hace año y medio juego y así mismo me ves donde estoy con  un gran esfuerzo de mi parte cada día tengo que lidiar con gente sin sentido común, pero aquí estoy con buen mmr y en una liga decente apenes con jugar mi primera season subí de silver 4 a platino 3, porque en la s5 juge mis primeras ranked en octubre y quede en silver así que en una season, \"hice lo que vos isiste en cuanto\"? por lo que veo te llevo 3 season para llegar a platino yo lo hice en una, y si tu escusa es como la de cualquier niño rata \"yo no paso en una computadora\" yo te diría que yo tampoco estoy haciendo 2do de universidad en profesorado de educación física con 18 años,ahora estoy dando los exámenes para pasar a tercero!. saludos cordiales.","replies":[{"poster":"Zoliza","date":"2016-11-28T20:21:27.392+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=King Of Support,realm=LAS,application-id=v7qsfXsE,discussion-id=xKze6HoJ,comment-id=00040000000000000000,timestamp=2016-11-28T20:04:35.247+0000)\n>\n> Es verdad no conozco mucho sobre el juego,hace año y medio juego y así mismo me ves donde estoy con  un gran esfuerzo de mi parte cada día tengo que lidiar con gente sin sentido común, pero aquí estoy con buen mmr y en una liga decente apenes con jugar mi primera season subí de silver 4 a platino 3, porque en la s5 juge mis primeras ranked en octubre y quede en silver así que en una season, hice lo que vos isiste en cuanto? saludos cordiales.\n\n\"isiste\" Es una de mis smurf, te lo tengo que volver a repetir? Tengo 4 cuentas, tengo tu elo con 19 ranked vos jugaste casi 400, creo que ni sumando todas las ranked de todas mis cuentas durante todas las temporadas llego a eso. \n\nCuando se haga el soft reset del proximo parche e inicie la nueva temporada, quiero ver que con tus primeras 10 no bajes de platino y que con mi cantidad de partidas vuelvas a platino de nuevo. Jugue un 10% de todas tus partidas ranked y estoy a dos divisiones de tu cuenta solo con esta. \n\nSi queres nos ponemos a discutir cuando subas a D3 y cuando entiendas bien las cosas de las que hablas, en vez de responderme que lo que digo no tiene logica hablando sin saber. \n\nHa y también subí mi otra smurf de silver a platino 5 en 42 ranked totales. Vos tardaste 400, ahi tenes los numeros de cuanto me costo hacer lo que vos hiciste, realmente nada de esfuerzo, hasta puedo hacerlo de hobbie.\n\nSaludos cordiales.","replies":[{"poster":"Capitan Fin","date":"2016-11-28T23:33:46.203+0000","up_votes":1,"down_votes":1,"body":"3 o 4 season para llegar a ser lo que sos, y tus cuentas no pasan de diamantes, en 4 season jajajajaaajajajajajajaja, en 3 0 4 season no bajo de challenger amiguito, si en una llegue a platino 3, en 1 mas soy challenger, lo único que sabes poner de escusas es soy smurf tengo cuatros cuentas, no vas a tenes 3 o 4 años jugando al lol cualquiera puede agarrar y llevar una smurf a platino en las 10 primeras si sos tan pro, en 3 0 4 años fíjate en la liga que estoy saludos cordiales!","replies":[{"poster":"Zoliza","date":"2016-11-28T23:58:37.939+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=King Of Support,realm=LAS,application-id=v7qsfXsE,discussion-id=xKze6HoJ,comment-id=0004000000000000000000000000,timestamp=2016-11-28T23:33:46.203+0000)\n>\n> 3 o 4 season para llegar a ser lo que sos, y tus cuentas no pasan de diamantes, en 4 season jajajajaaajajajajajajaja, en 3 0 4 season no bajo de challenger amiguito, si en una llegue a platino 3, en 1 mas soy challenger, lo único que sabes poner de escusas es soy smurf tengo cuatros cuentas, no vas a tenes 3 o 4 años jugando al lol cualquiera puede agarrar y llevar una smurf a platino en las 10 primeras si sos tan pro, en 3 0 4 años fíjate en la liga que estoy saludos cordiales!\n\n En 3 años no voy a estar ni jugando lol seguramente, tenes menos compresión lectora que nene de 12 años... Pensar que una persona que juega a lo sumo 40 ranked  en un año es alguien que quiere subir....Es un juego, no pienso en jugar competitivo o vivir de esto. Creo que sumando mis ranked de todas las temporadas no llego a tus ranked de una season, juego por las recompensas y luego juego con amigos para divertirme.\nSi pasas de D5 la proxima temporada llámame asi te felicito, te crees que subir a platino es igual de facil que subir de platino a challenger jajaja lo que te espera \"amiguito\" nos vemo jonny mandale saludos a la jenny y a la jessica ;)\n\n\"Cualquiera puede agarrar y llevar una smurf a platino en las 10 primeras\"  Las palabras se las lleva el viento, mucha boca pocos dientes diría.... mi abuela (?\n\nProfesorado de educación física? Sos de los que veo corriendo y tomando mates todo el día en mi universidad? Pensé que lo hacían por hobbie no que se estudiaba. \n\n18 años y todavía no aprendes a escribir, a que clase de universidad iras.... ","replies":[]}]}]}]}]}]}]}]},{"poster":"CKats Hellville","date":"2016-11-28T05:15:09.157+0000","up_votes":1,"down_votes":0,"body":"Igual, aunque se feo.. es verdad, la gente es mucho mas toxica en gold que en bronze.. y los platinos se creen faker.. Despues estan los tipicos smurf diamond 5 : 0-10 y su clasica frase \"segui la flecha, goldie/platinito\"","replies":[]},{"poster":"rokushoger","date":"2016-11-28T11:11:58.115+0000","up_votes":1,"down_votes":1,"body":"Para, y vos subiste solo para que no te toquen tipos de esa \"especie\" solamente? No subiste por querer progresar? Si es así te equivocaste ampliamente. En todas las ligas hay las mismas \"personas\" molestas, uno tiene que subir porque le gusta/quiere progresar/quiere juego más competitivo/lo que sea pero que sea por vos, no para no encontrarte x tipo de jugador porque eso es imposible, acá y en cualquier juego online pasa lo mismo.","replies":[]},{"poster":"xTm Joe Kelly","date":"2016-11-28T04:14:25.618+0000","up_votes":1,"down_votes":1,"body":"xD :)","replies":[]}]}