{"poster":"Shieldon","date":"2017-05-08T18:45:58.735+0000","title":"Der Moment wo man einen Permaban für Scripts bekommt und nicht weiß wieso","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":1,"body":"Hallo,\r\ngestern wurde mein Account gepermabant wie ich mit erschrecken beim Einloggen feststellen durfte.\r\nDort stand, dass ich meine E-mails checken soll doch ich hatte keine bekommen also schrieb ich den Support an.\r\nNach ein paar Nachrichten teilte dieser mir nun mit, dass ich anscheinend wegen Scripten oder das benutzen von Drittanbietern gebannt wurde.\r\nNun habe ich 1000x Threads dar&uuml;ber gelesen und bin relativ verzweifelt, da diese nicht gut ausgehen.\r\nDie einzigen Programme die ich w&auml;hrend Lol benutze sind TS und Skype. Vor gut einem Jahr besa&szlig; ich mal MK Lol doch deinstallierte es direkt, da ich noch an diesen Tag las, dass es nicht erlaubt sei, da es so etwas einen Jungler Timer f&uuml;r die Gegner gab.\r\nMit Makros kenne ich mich nicht aus und bin mir nicht mal sicher was das genau ist doch ich bin mir sicher, dass ich so etwas nicht benutze, da die einzige Einstellung die ich ver&auml;ndert habe die Belegung der Items von den Zahlen auf a,s,y,x sind.\r\nIch bin der einzige der Zugang an meinen Account hat und an diesen PC hier. Am Wochenende Spiele ich Lol auf dem PC meines Vater doch ich bezweifel, dass er Scripts f&uuml;r Lol hat oder &auml;hnliches.\r\nIch bin nie negativ aufgefallen z.B. wurde ich nie einen Scripter genannt( was Riot wohl anders sieht) oder bekam etwas wie eine Chatsperre f&uuml;r toxiches Verhalten. Im Gegenteil! Fr&uuml;her besa&szlig; ich sogar 2mal eine dieser Ehrenschleifen doch verlor diese, da auch ich mal einen schlechten Tag habe.\r\nNun Frage ich mich, ob ich &uuml;berhaupt noch etwas tun kann bzw. einen neuen PC brauche, da dieser anscheinen ja verseucht ist.\r\nAu&szlig;erdem frage ich mich wieso dieser Account, aber mein Smurf nicht gebannt ist, da es da absolut 0 Unterschiede gibt. \r\nPs. Ich will Riot hiermit nicht auffordern meinen Smurf zu bannen. Aktuell kann ich nicht mehr tuen als solange mit dem Support zu schreiben bis es eine eindeutige Antwort gibt. Ich habe das Gef&uuml;hlt, dass dieses System von Riot einen gleich als Scripter sieht, weill man statt Toplane nun ADC in Soloq spielt, da es sich besser anf&uuml;hlt...\r\nFalls mir jemand einen Ratschlag geben kann oder evt. sogar ein dieser Situation war w&uuml;rde ich mich freuen &uuml;ber eine R&uuml;ckmeldung.\r\n\r\nLiebe Gr&uuml;&szlig;e Shieldon","replies":[{"poster":"eimoH","date":"2017-05-17T19:19:57.510+0000","up_votes":1,"down_votes":0,"body":"Guten Abend,\n\nauch wenn dieser Thread schon seit acht Tagen keine Antwort mehr hat werde ich trotzdem mal was dazu sagen.\nErstmal mit dem System das Riot nutzt habe ich keine tiefere Ahnung davon da ich nicht weiß welche Beweise sie genau anerkennen abgesehen von Videos da sollte es klar sein das sie nicht anerkannt werden, da sie zu leicht editierbar sind und keine Indizien die hilfreich zu einer Rekonstruierung des \"Fehlers\" sind.\n\n* Als erstes solltest du dein System auf Schadware überprüfen, lässt dir das ganze vom Programm protokollieren(als extra Datei bitte speichern) und verschiebst die Schadware in Quarantäne.\n* Als nächstes fertigst du eine dxdiag an. Dazu gibst du einfach bei der Windows-Suche dxdiag dort sollte dann ein blauer Kreis mit gelben Kreuz drin erscheinen bei dem \"dxdiag\" und  \"Befehl ausführen\" steht, dort klickst du dann drauf. Danach wird sich ein Fenster öffnen und dort klickst du auf Alle Informationen speichern gibst der Datei einen entsprechenden Namen unter der du sie auch später wieder findest.\n* Zudem solltest du jede Art von Cheat-Programm oder Tools die auf deinem PC installiert hast die aber nicht im Zusammenhang mit League stehen nennen (auch von Offline-Games) und auch Cheat Engine (obwohl es nicht verboten ist) falls du es genutzt hast.\n* Außerdem könntest du ergooglen ob es mit deiner Grafikkarte in der Vergangenheit schon mal Probleme im Zusammenhang mit League gab oder ob aktuelle Probleme mit dieser Treiberversion vorliegen. Du kannst auch beim Hersteller per Support-Ticket anfragen. Falls dies sich verzögert kannst du den nächsten Schritt vor diesem machen und dann diese Infos falls es welche gibt nachreichen. \n* Die Informationen sendest du danach alle dem Support. Falls es da die Möglichkeit gibt etwas als Anhang zu senden, sendest du alle Dateien als Anhang falls nicht kopierst du die Inhalte der einzelnen Dateien raus und trennst klar ersichtlich die Dateien von einander.\n*Danach erstellst du einen Systemwiederherstellungspunkt um im Falle des Falles den Fehler selber bzw. mithilfe anderer rekonstruieren zu können.\n* Was du noch zusätzlich machen kannst ist das du in einigen Communitys nachfragst ob Leute zu einem ähnlichen Zeitpunkt wegen dem gleichen Vergehen gebannt wurden oder Leute die in der Lage sind dir auf anderem Wege weiter zu helfen. Diesen sagst du dann einfach was sie in das Ticket an den Support alles mit rein tun sollen(leider bekommt man ja bei Riot keine Protokoll-Nr des Scripts was man genutzt haben soll somit lassen sich Leute die vom gleichen \"Fehler\" betroffen sind schwerer identifizieren).\n\n\nMFG Unfamous","replies":[]},{"poster":"Curion","date":"2017-05-09T11:08:54.606+0000","up_votes":1,"down_votes":0,"body":"also ich weiß, dass riot spieler nicht für scripts bannt, wenn sie es vorher nicht überprüft haben. das hört sich hier wirklich sehr komisch für mich an. selbst wenn du 100 mal für scripten reportet wirst, wirst du immer noch nicht gebannt, ohne dass riot einfach mal nachschaut ob du solche programme verwendest. normalerweise hat man doch auch einen grund gegeben wenn man sich auf den gebannten acc einloggt oder?","replies":[]},{"poster":"VeS Ginsej","date":"2017-05-08T19:39:01.161+0000","up_votes":1,"down_votes":1,"body":"> Die einzigen Programme die ich während Lol benutze sind TS und Skype. Vor gut einem Jahr besaß ich mal MK Lol\n\nIch denke genau das reicht aus für deinen Ban. Das System interessiert nicht, wie oft du solche Programme genutzt hast. Es reicht aus, es installiert zu haben.\nEs kann einige Zeit vergehen bis es zum Ban kommt, da diese Drittprogrammbans meist in Wellen kommen soweit ich weiß.\n\nMfG Ginsej","replies":[]},{"poster":"Released Ape","date":"2017-05-08T19:53:36.870+0000","up_votes":1,"down_votes":2,"body":"Anders als VeS Ginsej, denke ich nicht das du für MK Lol gebannt wurdest - vor allem nicht nach einen Jahr. Ich denke die Änderung Belegung wird bei Riot eine gewisse Aufmerksamkeit auf sich gezogen haben und dann haben sie noch ein paar Sachen die mit ihren Muster übereinstimmen gefunden und dann den Bann ausgeführt.\n\nIch kann leider nicht schauen inwieweit du die Wahrheit sagst, aber ich weiß absolut wie schlecht die Politik von Riot bezüglich diesen Thema ist (Null Transparenz). Auch das man direkt verweigert den Ban aufzuheben und so tut als gebe es gar keine Chance den Account wieder zu erhalten (z. B. wegen einen Fehler) ist sehr fragwürdig, diese Fälle sind zwar sehr selten - doch sie sind bereits passiert und Riot hat die Leute dann auch wieder entbannt. Ich kenne keine Spielefirma die ihre Sätze mit \"Der Ban wird unter keinen Umständen aufgehoben\" beendet (natürlich sollten solche Bans nur nach gründlicher Prüfung wieder aufgehoben werden, was in über 99.9 % gerechtfertigter Sperren für Riot wohl nicht rentabel ist - wenn man ins Spielerverhalten Forum schaut und sieht wie viele Leute da extrem lügen kann man das teilweise verstehen).","replies":[]}]}