{"poster":"Narvuntien","date":"2017-03-21T16:01:32.991+0000","title":"What are some good counters to Yasuo?","subforum":"Gameplay","up_votes":17,"down_votes":4,"body":"Other than bans.\r\n\r\nPlaying any kind of skill shot reliant champion against straight up sucks. But he sees zero pro play so clearly he has some glaring weaknesses.","replies":[{"poster":"Tyrone Lannister","date":"2017-03-21T16:14:33.591+0000","up_votes":17,"down_votes":0,"body":"Darius makes Yas his pretty little..... Princess. Keepo","replies":[{"poster":"Troll for Trump","date":"2017-03-22T07:44:01.789+0000","up_votes":5,"down_votes":3,"body":"Darius isn't actually good against Yasuo really except in midgame.\n\nHe's supposed to be good vs Yas early, but ONLY if the yas is bad. Maybe plat/gold, Yasuo's won't be dumb, and realize that Darius's Q will never land on the Yasuo if they aren't dumb.\n\nThere legit isn't any counter for Yasuo. You beat yas based on how good or bad of a Yas he is in comparison to everyone else in the game.\n\nBest solution is permacamp from jg or ban.","replies":[{"poster":"The JigSAW","date":"2017-03-22T14:51:00.139+0000","up_votes":2,"down_votes":1,"body":"As ridiculously broken as Yasuo is, I've still seen Malzahar and Teemo wreck him constantly.  Even the Devil hates Yasuo.","replies":[{"poster":"Prestige AkaIi","date":"2017-03-23T18:09:05.356+0000","up_votes":1,"down_votes":0,"body":"not broken. I don't like him, doesn't make him broken.","replies":[]},{"poster":"Troll for Trump","date":"2017-03-22T23:17:23.957+0000","up_votes":1,"down_votes":0,"body":"I think Malz used to counter him even better, but they've pushed him really far out of mid. Teemo just isn't ever good. The red trinket \"nerfs\" help the matchup, but Teemo still isn't the best counter. Not to mention how bad he is at helping the team.\n\nThe most reliable counters to yasuo are the ones with the most reliable kits. That usually means they're binary or feast/famine. Old WW could easily gank Yasuo. and hunt him down. Tryndamere or Jax can thwack him to death. Old Darius would actually bully him reliably.","replies":[]}]}]}]},{"poster":"Otherworldz","date":"2017-03-21T16:05:33.442+0000","up_votes":12,"down_votes":1,"body":"Malzahar","replies":[{"poster":"Derfel","date":"2017-03-21T22:39:45.315+0000","up_votes":10,"down_votes":0,"body":"Yeah maybe 2 seasons ago when malzahar was still in the game","replies":[{"poster":"Salron","date":"2017-03-21T22:47:39.901+0000","up_votes":1,"down_votes":6,"body":"54% WR against Yas\nhttp://puu.sh/uTGoC/6643f0660b.jpg","replies":[{"poster":"Derfel","date":"2017-03-21T22:54:12.745+0000","up_votes":12,"down_votes":2,"body":"championgg stats are garbage","replies":[]}]}]}]},{"poster":"Valeckserai","date":"2017-03-21T20:31:26.822+0000","up_votes":10,"down_votes":1,"body":"{{champion:30}}  Lane is so easy so long as you know Yasuo's abilities and how to properly play Karthus. Karthus works really well with exhaust, which is one of the things that kills Yasuo's damage the easiest. It's easy to quickly pulse his e to proc his shield when he gets a little too close. His q spam can very easily do a ton of damage to him if you aim it right and remember what minions he's already dashed to. And his windwall is useless against anything buy Karth's auto attacks. Play smartly and don't get a potato for a jungler and the lane is yours.","replies":[{"poster":"TheSingularity","date":"2017-03-23T01:01:04.859+0000","up_votes":1,"down_votes":0,"body":"To add onto lanes that are pretty easy.\n{{champion:240}} Is a more risky pick than karthus however he really slaps yasuo around early and as long as you gain a lead, yasuo will remain on the back foot until mid-late game.\nKled's main tool is his dash, as yasuo can't windwall a champ. So by using beartrap the moment you're on top of him, 9/10 times you'll hook him allowing you to get off all 4 empowered auto attacks+bear traps second proc. Or force him to disengage.\nIf yas happens to windwall you as you Q, you've likely hit him with your E, are now on enemy tower side of the lane and can re activate E to dash back towards your tower.\n\nAdd onto this the combination of surprise attacks {{champion:240}} can pull off with sneaky skarl returns and the innate cockyness of yasuo players, you're in for a great time. Pull it off and it will tilt yas off the face of the earth.\nBut be careful when doing this, be sure to build up your courage with pocket pistol before committing to a fight in which you're RELYING on skarl coming back b4 you die. There is nothing worse than being 2 auto attacks off skarl after you've used all of your W's enhanced AA's only do die before getting him back or while skarls running frantically at you.\n\nKled also has stronger roams than yas, especially since he's able to speed up his jungler for a gank down bot and he's very very good at diving. (As losing skarl automatically resets tower agro onto someone else).\n\nBiggest flaws with this are: If you fail to kill yas, win lane and gain an admirable lead. You will drop of VERY VERY fast as you'll lack item/level advantages which are a necessity against yas' who build phantom dancer. The other side is that yasuo WILL! catch up and he will get to a stage where YOU! will never be able to 1v1 him. \nI usually start losing to {{champion:157}} when he has{{item:3046}}  and {{item:3031}}. That is not many items and so you do not have much time to abuse any lead you may have.\nYou MUST! be proactive, the moment his tower is down, ROAM ROAM ROAM ROAM ROAM! you need to get your team into a position in which they can help the falling off kled crush yasuo. Take all the outter turrets with roams (kled R) and nab them dragons the moment you start losing trades. \nAnd force your team to group either mid or bot for inhib/inner turrets. At this point you should have your core dmg items and a randuins. So it is your job to make yasuo's job as hard as possible in team fights (taking exhaust will ruin his day)\n\n\n\nKled is by far my most successful champ against yasuo. I've won with velkoz, I've won with yorick and I've won with sejuani. But none of them are as good as kled against a yasuo","replies":[]}]},{"poster":"Kirius Dark","date":"2017-03-21T17:08:49.274+0000","up_votes":3,"down_votes":4,"body":"I like {{champion:50}} for it\n\nDoesnt matter if he's dashing all around when you're laying down large AoE puddles in the minion waves. Dont need to aim your ult either, just walk around as he gets pecked to death","replies":[{"poster":"Yaśuo Main","date":"2017-03-21T17:51:43.061+0000","up_votes":8,"down_votes":0,"body":"His E range is literally bigger than Swain snare, that ain't gonna work.","replies":[{"poster":"Kirius Dark","date":"2017-03-21T18:20:59.983+0000","up_votes":1,"down_votes":0,"body":"You know he needs to dash at you to do damage being melee so you throw the snare on yourself to punish everytime he wants to attack you. Much easier to hit than trying to catch him out trying to CS. ","replies":[{"poster":"Yaśuo Main","date":"2017-03-21T18:45:00.904+0000","up_votes":3,"down_votes":0,"body":"I guess you don't understand how Yasuo can easily outplay that. If you are near minions when he E's to you, your snare will NOT hit, because he can dash away. He can also just fake you out, E to a minion very close to you, bait out your snare, and then E to you if you are not standing on the snare. ( if you stand on the snarewhich will get you in a very bad spot considering you are standing still and the snare isn't long, have fun being damaged even more). As I said, that ain't gonna work. Clearly you are not fighting good Yasuo's, as Swains snare isn't even instant cast.","replies":[{"poster":"sirwaterfles","date":"2017-03-22T01:23:25.462+0000","up_votes":2,"down_votes":0,"body":"You are assuming that swain takes the fight on yasous terms.","replies":[]}]}]}]}]},{"poster":"Bootlessly","date":"2017-03-21T17:45:44.084+0000","up_votes":7,"down_votes":0,"body":"Yasuo doesn't see pro play not because of his weaknesses but because of other champions strengths.  The meta Champions for mid are champions who have the ability to one shot squishes without help from their team or having tanking on the enemy team have the ability to body block the damage.  In LCS  Tanks do more then engage team fights.  A good tank will body block skill shots, take ton of turret agro, face check most things to ward other things, and peel for the damage dealer (mainly adc).  But the meta for mid lakers right now are champions that don't let tanks do that.  {{champion:134}} {{champion:112}} {{champion:13}} {{champion:61}} are the top picks because they have the ability to do massive damage even when the tank is in the way.  Yasuo cannot do that.  Yasuo need lots of gold to be viable and a lot of team support.  A behind Yasuo will stay behind in LCS and he doesn't bring anything to the table for team fights if he isn't ahead where Orianna, Syndra, and Victor still bring CC lockdown and shields and peel.  Ryze is the perfect champion for LCS because he brings everything a team needs even when he is behind.  \n\nI hope this helped","replies":[{"poster":"Aptest","date":"2017-03-21T17:58:01.732+0000","up_votes":2,"down_votes":0,"body":"not really i disagree. \n\nYasuo is a second line champion that needs setup from allies to really shine in team fights. Other than that he is a decent duelist and split pusher but in that regard he lacks the ability to survive / delay opponents long time / make TP plays.\n\nIn LCS mid lane is capable of making the plays. To be a second line champion that needs distraction and setup from other team mates, you need to have some redeeming quality that lets you completely troll the other team not just in your lane but also out of it.\n\nYasuo has those troll qualities but they are too gated to being in his own lane. Wheres other \"troll\" champions like Ekko or Fizz or Talon have an easier time trolling the other team.","replies":[]}]},{"poster":"vampirekid13","date":"2017-03-21T22:11:13.600+0000","up_votes":8,"down_votes":1,"body":"the best counters to yasuo are:\n\nbronze\nsilver\ngold.","replies":[{"poster":"Incarceration","date":"2017-03-22T01:30:11.852+0000","up_votes":4,"down_votes":0,"body":"Those are his best matchups.","replies":[]}]},{"poster":"Tychusfindlay919","date":"2017-03-21T23:22:11.193+0000","up_votes":7,"down_votes":1,"body":"{{champion:75}} Wither\n\n{{champion:75}} Become Dust\n\n{{champion:75}} Perish                                               ","replies":[]},{"poster":"Golden Tager X","date":"2017-03-21T22:11:19.325+0000","up_votes":5,"down_votes":0,"body":"{{champion:33}} I heard you like to auto attack.","replies":[]},{"poster":"Bisaknosp","date":"2017-03-21T22:30:45.453+0000","up_votes":6,"down_votes":1,"body":"a mediocre yasuo player can win against every1 late game\nsad","replies":[{"poster":"Yaśuo Main","date":"2017-03-22T01:22:43.786+0000","up_votes":3,"down_votes":0,"body":"I'd say nearly all of Yasuo's matchups are skill matchups in Yasuo's favor except Pantheon.","replies":[{"poster":"Prestige AkaIi","date":"2017-03-23T18:12:05.576+0000","up_votes":1,"down_votes":0,"body":"{{champion:114}} favor","replies":[]}]},{"poster":"Eternal791","date":"2017-03-22T18:57:08.598+0000","up_votes":1,"down_votes":0,"body":"Camille can throw Yasuo in the dumpster mid and late game. Early game however, Yas can be a major pain for her, but that's only early game if she manages to not feed and fall behind. \n\nThis is actually the case with most champs against Camille. Lots of people counter her early game but mid and late game she destroys them.","replies":[]}]},{"poster":"Hovering Hentai","date":"2017-03-21T22:09:05.172+0000","up_votes":1,"down_votes":0,"body":"Xerath can dumpster him but you need to be pretty good with Xerath to do so cos only thing he can block is your auto's and e which is your least damaging spell","replies":[{"poster":"MagikarpIsBoss","date":"2017-03-21T23:01:49.389+0000","up_votes":1,"down_votes":0,"body":"he can block xerath e","replies":[{"poster":"Hovering Hentai","date":"2017-03-22T08:54:46.082+0000","up_votes":4,"down_votes":0,"body":"Read the comment again carefully.......","replies":[{"poster":"MagikarpIsBoss","date":"2017-03-22T19:28:15.896+0000","up_votes":2,"down_votes":0,"body":"I could have sworn you didnt say e. My bad.","replies":[]}]}]}]},{"poster":"RainXBlade","date":"2017-03-22T05:51:42.864+0000","up_votes":4,"down_votes":0,"body":"I might as well answer this as a Yasuo main with some points.\n\n* Anything with targeted damage or CC can kill Yasuo as he is reliant on his E to dodge a lot of stuff and the logic that targeted abilities beat mobility.\n* Build armor. Even a simple Rands can cut Yasuo's damage significantly. \n* Never 1v1 Yasuo while under a minion wave. Just don't.\n* Treat him as an ADC: target him first.\n* If the enemy has additional knockups that Yasuo can capitalize on, take whatever measures necessary to prevent him from ulting from that knock up.\n* The Q is very short and narrow, side step it if you can when dueling him.\n* When Yasuo pops his W or shield, back away, then re-engage, unless if the Yasuo chooses to engage when the circumstances permit.\n* When his shield or W is down, take every opportunity to harass him. Bad Yasuo's will try to take in the damage and life steal out of it while good ones will often back or wait for the downtime of your skills so that he can go in.\n* Do not try to sidestep Yasuo's empowered Q when retreating from him as he can hold on to it while he autoattacks you to death or until you blow your Flash or mobility spell only for him to fire the tornado towards your location. Remember that even with his Q, Yasuo is still reliant on his auto's for his damage.\n\nBut other than that, a good Yasuo is very infuriating to face.","replies":[{"poster":"Disulfiram","date":"2017-03-22T12:05:40.053+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RainXBlade,realm=NA,application-id=3ErqAdtq,discussion-id=WzVyMaoH,comment-id=003a,timestamp=2017-03-22T05:51:42.864+0000)\n>\n> * Never 1v1 Yasuo while under a minion wave. Just don&#x27;t.\n\n{{champion:30}}  doesn't get this :D\n\n(No, seriously, how is Karthus vs Yasuo in lane from the POV of a Yasuo main?)","replies":[{"poster":"RainXBlade","date":"2017-03-22T22:43:45.963+0000","up_votes":2,"down_votes":0,"body":"Karthus's E drains a lot of mana from all stages of the game. I've faced a Karthus once as Yasuo and all I ever did was wait when I go in, the second the enemy Karthus turns on E, I immediately back away w/o giving him time to use his W.\n\nBut other than that, I instantly rush Maw because he has no hard CC to stop me and that all of his damage can feed my shield and proc off Maw's Lifegrip.\n\nKarthus also doesn't have a lot of kill pressure nor lockdown power on Yasuo (unless the Yasuo is really bad) so I can actually play safe and if the Karthus ever maxes E to try to zone me, I'll just max Q and try to land tornados and fish for a good ult. If he maxes Q, I'll actually alternately max Q and E but putting priority into my E so that I'll have mobility but still retain some damage at the same time.","replies":[]}]}]},{"poster":"Asayake 5150glow","date":"2017-03-21T21:29:06.814+0000","up_votes":4,"down_votes":0,"body":"{{champion:114}} {{champion:92}} {{champion:122}} \n\n{{champion:86}} fucks him once he gets Sunfires, DO NOT let him farm or get near minions or else he might outplay the hell out of you.","replies":[]},{"poster":"PhDs Nuts","date":"2017-03-21T23:05:17.391+0000","up_votes":3,"down_votes":0,"body":"You can honestly play Darius mid against him.  If you keep your lane warded, you can just dumpster him.  Go stormraider/ghost and you're still pretty safe.  You can disengage with your E and run if you get ganked.","replies":[]},{"poster":"TyrekGoldenspear","date":"2017-03-22T23:45:55.427+0000","up_votes":2,"down_votes":0,"body":"Well a good Support against him is {{champion:89}}.\n\nSeriously, she touches him and he's a sitting duck for like 5 seconds.","replies":[]},{"poster":"YouGoTownedX","date":"2017-03-22T19:24:53.721+0000","up_votes":2,"down_votes":0,"body":"I believe {{champion:126}} counters yasuo pretty well. seeing as how he can poke yas down with ranged and screw him over with melee. but then again jayce can do that to anyone. Maybe it's just me.","replies":[]},{"poster":"Saljooki","date":"2017-03-22T12:03:18.473+0000","up_votes":2,"down_votes":0,"body":"As a person who plays Yasuo, {{champion:80}} makes every Yasuo player wish they never installed this game.","replies":[]},{"poster":"TakeAGuessNerd","date":"2017-03-22T11:56:55.801+0000","up_votes":2,"down_votes":0,"body":"{{champion:80}}, probably one of the hardest lane for Yas since there is literally no way for Yas to trade properly. Yasuo's reliable damage source are his AA and Q (which is counted as AA); E can only be used so often on a certain target, and ult can only work on knocked target.\n\nPanth's passive prevents AA damage, including Yas' Q. And Panth's W, which is also a stunt, refreshes the passive. Even though he could block Panth's Q with his W, Panth's Q is up more often and Yasuo's W has a long cooldown.\n\nIn short, the only reliable way Yas could fight Panth is by using his E, which has a cooldown on a target. Yasuo's main damage source are countered by Panth's passive. Not to mention, the moment Yas dashes near Panth, Panth could just all in Yas, stunting him with his W.\n\nOh yeah, Pant's passive also blocks the tornado part too.","replies":[]},{"poster":"DemainaNyx","date":"2017-03-22T11:33:02.287+0000","up_votes":2,"down_votes":0,"body":"Depends what lane.  \n\nFiddle is pretty funny cause he dashes forward and you fear him and throw your crow so he can't do anything for a while.  \nLulu is ok cause you just polymorph when he gets in range of anyone important and use ult if he dashes towards someone.  \nMalz is great for point and click suppression until he gets QSS.  \nPoppy is fun cause your Heroic Pressence stops him dashing, then you can ult or wall stun which should be enough for your teammates to kill him.\nVayne is sorta a skill matchup.  If you can stay away from minions, then all you need to do is condemn him away when he dashes in and you'll have the range advantage after that so long as you avoid the tornado.","replies":[]},{"poster":"Oyir","date":"2017-03-21T19:47:11.872+0000","up_votes":1,"down_votes":0,"body":"Best counter is definitely {{champion:80}}","replies":[{"poster":"DonGiovanni","date":"2017-03-21T21:52:42.897+0000","up_votes":1,"down_votes":3,"body":"A decent Yasuo will know better to stay safe and just farm into late game. Yasuo can outscale Pantheon very hard.","replies":[{"poster":"xevi","date":"2017-03-21T22:47:02.313+0000","up_votes":2,"down_votes":1,"body":"{{champion:80}} can starve {{champion:157}} super hard as long as he knows basic wave control. He can roam really well and dive too. Easily the hardest matchup for {{champion:157}}","replies":[{"poster":"DonGiovanni","date":"2017-03-21T22:54:40.357+0000","up_votes":1,"down_votes":0,"body":"And then Yasuo split pushes, outfarms you and comes back end-game and poops on your entire team. And too add to the insult he says: \"GG, EZ\".","replies":[{"poster":"Yaśuo Main","date":"2017-03-22T01:18:42.452+0000","up_votes":2,"down_votes":0,"body":"The best Yasuo overall in the world literally said himself that pantheon is the hardest match up.","replies":[{"poster":"xevi","date":"2017-03-22T02:32:44.275+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Yaśuo Main,realm=NA,application-id=3ErqAdtq,discussion-id=WzVyMaoH,comment-id=00170001000000000001,timestamp=2017-03-22T01:18:42.452+0000)\n>\n> The best Yasuo overall in the world\n\nI never said that  ;)","replies":[{"poster":"Yaśuo Main","date":"2017-03-22T10:27:17.386+0000","up_votes":2,"down_votes":0,"body":"Yeah, I said that.\n\n_checkmate_","replies":[]}]}]}]}]}]}]},{"poster":"ChaoticPinecone","date":"2017-03-22T09:17:26.372+0000","up_votes":2,"down_votes":0,"body":"1. Even the best counters will fail if you mess up the matchup. Know that his Level 1-2 is stronger than even some of his hardest counters. \n2. Toplane - Garen with a Cloth+5 start. Rush a Sunfire or a Randiuns if you arent comfortable in the matchup - you still outdamage him pretty much all game (aside from the aforementioned level 1-2). You can be behind in CS and build full tank and he still cant kill you while you can kill him (unless you get super far behind and Yasuo has 3-4 items while youre sitting on 2 defensive items). Renekton is a easy counter as well, but you do have to keep track of your rage. Darius is a \"semi-skill\" matchup. Darius is heavily favored, but if the Yasuo plays absolutely perfectly they can still win - at least until you get to 3 or 4 items when you can literally just facetank his damage and do nothing but auto/w him and ult. Jax is a \"skill\" matchup that still favors the Jax. Key is the counterstrike. If you dodge some of his autos and get the stun, you win. If he baits out your counterstrike and engages when its down, you lose. Trundle and Irelia are good into Yasuo as well, but you have to know the champion's strengths. Like for Trundle, only fight on your E - dont even try to fight when its down. Irelia has to use her Q resets to get into his range (dont engage directly with the Q, instead Q to a low-health minion near him). \n3. Midlane, I like Swain. E him when he is in range, use your Q to farm. Only go for the W-Q for damage if he dashes into you without a minion wave, cause he will just dash out of that damage. I like Swain because you can rush Rod+Zhonyas to directly deal with his damage without deviating from your champion's core build. If he tries to all-in you, kite back (out if minions so he cant dash) then drop all your abilities - you easily win post 6. Malz is pretty good as well, though the matchup gets more difficult once he gets QSS. Lissandra is good, but you have to be good at landing your W as he is trying to dash into you - if he gets to you before you get the spell off, it could be trouble. You can also pick something like Veigar to AFK farm, but he will still push you in - youll basically be farming under tower and be playing for teamfights. \n4. Take Exhaust. \n5. Outscale. Its weird to think of outscaling a Yasuo since he scales so damn well, but he is kinda like a Tryn - yes his damage scales super well, but his teamfight potential does not (without having proper setup with a Malphite or something). Pick a teamfight monster like Kennan or Annie, survive lane, then be more impactful later in the game.","replies":[]},{"poster":"Malicious Metal","date":"2017-03-21T21:14:35.436+0000","up_votes":2,"down_votes":0,"body":"this guy\n\n-> {{champion:82}}","replies":[{"poster":"xevi","date":"2017-03-21T22:50:14.365+0000","up_votes":1,"down_votes":0,"body":"Not too hard of a matchup. Just bait out Morde q and go back in when it;s on cd. Morde E gives a decent shield if it hits yas but is also easy to dodge when you have a no cd dash.","replies":[]}]}]}