{"poster":"Toyfelchen","date":"2015-07-22T21:22:26.211+0000","title":"new gangplank: diverse probleme mit den fässern und GP's autoangriffen","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"gangplank hat momentan etliche gameplayprobleme mit seinen f&auml;ssern, die ich nicht direkt als bugs bezeichnen w&uuml;rde, die jedch das gameplay an sich extrem frustrierend machen, und eher daf&uuml;r sorgen, dass geplante strategien komplett nach hinten losgehen, und man einfach stirbt, anstatt dass etwas sinnvolles passiert.\n\nzum einen: gangplank greift relativ unkontrolliert f&auml;sser mit autoangriff an.\ner behandelt ein fass wie einen minion, wenn es nach der zielsuche f&uuml;r einen AA geht. \nich habe um meinen turm herum 3 f&auml;sser stationiert, die ich, zum verteidigen gegen minionwellen und gegen gegnerische dives strategisch gut platziert hatte. ich stelle ein viertes fass, doch genau in dem moment, als ich das fass platziere, greift gangplank (ohne mein zutun) eines der f&auml;sser an. alle f&auml;sser gehen hoch. ungenutzt, die strategie war im ..popo.\ndie AA-animation von gangplank ist dazu noch sehr sehr seltsam. sie erinnert stark an garen, hat keinen richtigen anfang und kein richtiges ende. dadurch wird es sehr schwer, zu bemerken, wann der n&auml;chste AA denn nun kommt. steht man dabei zwischen minions, und neben einem fass, wird GP zu 99% sofort das fass angreifen (anstatt der minions), welches dann sinnloserweise explodiert. \n\nl&ouml;sung: solange man das fass nicht explizit anklickt, sollte GP das fass niemals als ziel w&auml;hlen. f&uuml;r den gegner sollte es allerdings wie ein minion-ziel bleiben, da es f&uuml;r ihn auch farm gibt. \n\n\nzweiter \"bug\" was eher ein anzeigefehler, beschreibungsfehler oder sonstwas ist: \nder schaden der f&auml;sser stackt nur bis zu einem bestimmten punkt, was so aber nicht in der beschreibung steht. theoretisch k&ouml;nnte ich also 100 f&auml;sser auf einem fleck stacken, wenn diese hochgehen wird der gegner aber nur von 1 oder 2 dieser f&auml;sser gesch&auml;digt. das sollte auf jedenfall noch mit in die beschreibung, da es f&uuml;r mich irref&uuml;hrend war","replies":[]}