{"poster":"gJoPamela","date":"2018-09-09T12:14:35.390+0000","title":"GAME tabbed random rqus.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey Community ich hab folgendes Problem,\n\nimmer wenn ich ingame bin tabbed das Spiel ganz random mal Anfang mal mitte mal ende des Games eingach raus.\n\nHabe keine neuen Programme runtergeladen.\nSpiele im Vollbildmodus.\nEs passiert v&ouml;llig random, mal 5 min Ingame oder 20 oder 40.\nHabe Windows 10 Problem taucht ungef&auml;hr vor 3-5 Tagen auf.\nNur in League, CS, GTA V, WoW etc funktionieren Vollbildmodus einwandfrei.\n\nHabe kein OfficeBackground Teil und Fokus Assist ist aus.\n\nMit hoffnungsvollen Gr&uuml;&szlig;en\n\nGJO Pamela","replies":[{"poster":"Gin","date":"2018-09-12T23:13:29.238+0000","up_votes":1,"down_votes":0,"body":"Hast du irgendein Programm installiert in dem du Popups hast? Skype? Discord? In Chrome Benachrichtigungen für manche Seiten aktiviert?\n\nSolche Dinge ziehen nämlich den Fokus gerne aus dem Fenster raus.","replies":[{"poster":"gJoPamela","date":"2018-09-13T18:52:29.520+0000","up_votes":1,"down_votes":0,"body":"Skype nein, nicht auf dem PC installiert.\nDiscord wird nicht genutzt und ist seid ca. letztes Jahr Dezember installiert worden, aber die Probleme tauchten erst diesen September auf.\nChrome seid 2015 installiert wird aber nicht genutzt.","replies":[{"poster":"Gin","date":"2018-09-14T07:00:30.802+0000","up_votes":1,"down_votes":0,"body":"Avira, Avast oder irgendein anderes Antivirusprogramm dass gerne unten rechts Benachrichtigungen über Songerangebote einblendet?\n\nAnsonsten probier mal das Spiel im \"Borderless\"-Modus anstatt im Vollbildmodus zu spielen.","replies":[{"poster":"gJoPamela","date":"2018-09-14T15:27:34.277+0000","up_votes":1,"down_votes":0,"body":"- Leider nicht.\n\n- Mag es aber sehr im Vollbildmodus zu spielen.\n\nBin ich der einzige mit solch einem Problem?","replies":[{"poster":"Gin","date":"2018-09-16T22:17:24.998+0000","up_votes":1,"down_votes":0,"body":"Also du bist der erste von dem ich etwas derartiges seit Monaten höre, und es lag bei den Personen die das Problem hatten immer an irgendeinem Programm dass sich in den Vordergrund drängt. \n\nMeistens mit/wegen irgendwelche Benachrichtigungen.","replies":[]}]}]}]}]}]}