{"poster":"warpenguin555","date":"2016-02-07T17:10:25.446+0000","title":"@Riot Repertoir please allow Malzahar to continue to be a good anti-assassin mage after his rework.","subforum":"Gameplay","up_votes":94,"down_votes":9,"body":"A little backstory(tl;dr at the end, turns out not so little after all). \n\nBack in season 3, I was a new player and trying to find a role I liked. For whatever reason i had my heart set on that role being Mid Lane. I had just given up on veigar and was desperately trying to find a new champion to main. So i went into the shop and with some help from my friends I chose a new champion to try to work on. Not Malzahar(not yet anyway), but Katarina, and later on that year i also picked up Yasuo. I was finding some decent success with Kat until i ran into a Malzahar. Malzahar completely left me in pieces all across the rift. Not even kidding, this was probably one of the worst asskickings i received. Every time i had that matchup i was blown out, and whatever confidence i had on Kat at the time was shattered.(rip) Then i finally got Yasuo vs Malzahar, thinking i was going to own his ass and make him pay for all the times I was humiliated before. Yasuo joined Kat in pieces as well. Later i would pick up Lux and have next to no problems with him anymore. But shortly after the rise of assassins (mainly Zed) came. I was so sick and tired of losing game after game after game to those damned assassins, and almost gave up on mid lane completely. I jumped around alot not caring what role as long as it wasnt mid for a while until a bit before the preseason 5 i took another try. It also helped that Rammus was dreadful that preseason so I was kind forced back. Along the way i decided &quot;i havent touched Kat in a while, ill play her.&quot; And the memories of how badly i was always losing to Malzahar resurfaced. I got really excited because im my head &quot;if Malz wrecks Kat, what about Zed? Or Fizz? Or Akali?&quot; and saved up IP to buy him, and when I was almost there he was free. My 1st game was against a LeBlanc who I shat on hard. I felt so amazing. I felt like these assassins needed to fear me, and after fearing them for so long, i played Malzahar almost every chance i could. Even the times i did bad i was still useful because of my ult, which further cemented him as a champion i loved.  Ever since my 1st ranked game with him a while later, he was my go to pick when i didnt have a chance to counterpick. While he isnt my most played champion anymore, he still is my favorite midlaner. I finished out the year in ranked with a 14-6 w/l record and a 70% winrate, only behind gnar for the most amount of games played in ranked. Then around the summer time that same season i took a break from ranked, and decided that i was just going to go full anti assassin champions because of how much I loved Malzahar. I tried alot of them. Felt very useless as Annie until around 30 minutes in, was bored off my ass my Heimerdinger, felt Lissandra was a bit better but i still wasnt a fan, and Anivia was fine but i never really enjoyed her that much, and Gragas mid felt more like i was screwing around than trying to win. Ahri did manage to stick but i already didnt love to use her because i already saw her so much that she became a bit boring. Malzahar is still the only champion i feel i can trust to do well with. What is sacred to me as a Malzahar player is that he can lockdown a threat even when behind and that i no longer have to fear assassins with him. I dont care if you take away his ability to melt tanks or to be played AD(sorry AD Malz players, its just a nonfactor to me). My fear is that he will lose the power to defeat almost every assassin in lane, and that feeling that I had when i 1st played him will be gone forever. And if that happens, i cant say if i would be able to play him again and still enjoy myself.\n\ntd;dr\nGot crushed by malz constantly, moved to Lux, where assassins crushed me, so i took up playing Malzahar and due to past experiences telling me he would be the answer to the assassins and thats how he became my main. If Malzahar loses that ability to still be a good pick vs them or loses the ability to still have an impact even when behind, i doubt i could still play him.","replies":[{"poster":"Derfel","date":"2016-02-07T21:14:10.868+0000","up_votes":7,"down_votes":52,"body":"Yeah right.  You can see from their shitty posts Riot thinks being able to hit Ahri/Zed means MALZ IS THE ONE WITHOUT COUNTERPLAY.  I wouldn't trust rioters to be competent enough to lick the mud off my boots if I scrapped it off for them first don't count on them not fucking him into trash mode.","replies":[{"poster":"RiotRepertoir","date":"2016-02-09T03:48:51.340+0000","up_votes":54,"down_votes":2,"body":"I hope that in the future my shitty posts can live up to the high bar set by Senbei Hakase.","replies":[{"poster":"Nagoh Shan","date":"2016-02-09T04:05:32.195+0000","up_votes":19,"down_votes":1,"body":"http://stream1.gifsoup.com/view8/4875732/ohhhh-o.gif","replies":[]},{"poster":"ADepressedLeona","date":"2016-02-09T10:56:51.704+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=PqEGzvQE,comment-id=00030002,timestamp=2016-02-09T03:48:51.340+0000)\n>\n> I hope that in the future my shitty posts can live up to the high bar set by Senbei Hakase.\n\nhttps://45.media.tumblr.com/e7c6d36ebd3cdcce35db0fcb71e23ea3/tumblr_nv0jtzeBXN1qmtaneo1_500.gif","replies":[]},{"poster":"Deep Terror Nami","date":"2016-02-09T08:41:01.227+0000","up_votes":4,"down_votes":0,"body":"https://i.gyazo.com/563ecf4d48eb49cdc2f85431b9b70c00.png","replies":[]}]},{"poster":"charcharmunro","date":"2016-02-07T21:35:25.907+0000","up_votes":15,"down_votes":6,"body":"In fairness, 1v1-ing Malz without a QSS literally does not have counterplay besides \"survive it\".","replies":[{"poster":"TheWoollyMammoth","date":"2016-02-07T23:30:33.453+0000","up_votes":3,"down_votes":1,"body":"shame its a team game.. with a shit ton of cc. and mercurial...","replies":[{"poster":"charcharmunro","date":"2016-02-08T00:21:01.684+0000","up_votes":5,"down_votes":1,"body":"Hence why I clarified it as \"1v1 without QSS\".","replies":[{"poster":"TheWoollyMammoth","date":"2016-02-08T00:23:55.979+0000","up_votes":5,"down_votes":1,"body":"There are plenty of champs that can kill him 1v1. Try anything with delayed cc. Heck. A good fizz can be terrifying. A good lux is my worst nightmare. The list goes on really.","replies":[{"poster":"charcharmunro","date":"2016-02-08T00:28:03.738+0000","up_votes":3,"down_votes":0,"body":"Eh. Some characters can be annoying like that, true. On the whole, though, he tends to just be like \"Hey, you, stop playing League\" in a 1v1.","replies":[{"poster":"Penta Penguin","date":"2016-02-08T00:46:32.199+0000","up_votes":8,"down_votes":3,"body":"Then you don't 1v1 the Malz dude. Farm, harass, poke, gank, etc. are all your counterplay options. Saying it's not fair that you can't 1v1 malz is like saying it's not fair you can't punch your way through a wall when there's a door next to it.","replies":[{"poster":"charcharmunro","date":"2016-02-08T00:49:04.022+0000","up_votes":7,"down_votes":2,"body":"I'm not saying he doesn't have weaknesses or counterplay. I'm just saying trying to 1v1 him has relatively little counterplay. Why are so many people overanalysing this?","replies":[{"poster":"Penta Penguin","date":"2016-02-08T00:53:39.438+0000","up_votes":6,"down_votes":3,"body":"Well what is the problem... The character's STRENGTH is strong... oh gosh. Why should it have counterplay when other areas of the character have the counterplay? In lane you have to opt in to 1v1 all-in malzahar... now he can Flash on you, but that's his flash gone, and unless he's getting a gank he has to set up W and E before pressing R which gives you time to flash or react.","replies":[{"poster":"charcharmunro","date":"2016-02-08T00:55:46.309+0000","up_votes":2,"down_votes":0,"body":"I'm not even complaining about it. I'm just commenting on it. I barely play mid, anyway and I usually play people who can hang back from him if I have to.","replies":[{"poster":"TheWoollyMammoth","date":"2016-02-08T01:29:14.620+0000","up_votes":9,"down_votes":2,"body":"The problem is that we keep seeing more and more people saying his ult automatically removes any chance to win lane. They treat him like there is no hope of winning against him in lane. When realistically, there is a good chance assuming you opt to using the counter play. Champ select is part of the game. See a Malz? Something that kills him. Are you having trouble killing malz with lux? play a few malz games. figure out what he is weak to. Proceed to kill him. \n\nI've destroyed champs in lane as Malz because nobody even TRIES to counter play. They just rush the standard items to wipe the floor with every champ as they play zed or yas or ahri. and then scream OP when I melt their face in. If you play zed into malz. Merc Scim will get you a decent ad boost AND immunity to cc. as well as mr. Ahri can either time your ult out and charm you. or just stay out of range until she pegs you with a good charm and kills you. If fizz lands an ult on you. you will die. They never even try. The ahri ults into me and tries to kill me. she dies. The zed turret dives me and builds no mr whatsoever. and die. the fizz misses his ult and engages anyway. he dies.  \n\nThen the teamfights and skirmishes role around. Instead of staying behind the maokai and leona, lucian walks right up to me and I ult him. Then he dies. it's not op. its called placing yourself in a REALLY stupid position. Some lee sin main tries to steal dragon or baron. guess who im going to ult the moment I see him.... he never even sees it coming (hue). Lee will scream op. \n\nThe one time I get cocky I'm 7/0/3 and I decide that I want to flash ult the enemy adc. I get chain cc'd by half the roster all at once. I die. the adc doesnt die. I do. Or when I over extend against mid lane and meat a very happy JG poppy. Who proceeds to enthusiastically shove that hammer into my dark void like area.  \n\nYes I will kill you if you have no help at all/ are not ad/have no delayed cc/ are not galio/ don't have any idea how to play against me. But how many champs cant have at least one of those options? \n\nNot to say that you are complaining. But I figured this was as good a spot to put this as any in this thread. Expect me to copy and paste the moment I find another.","replies":[{"poster":"charcharmunro","date":"2016-02-08T01:31:57.109+0000","up_votes":2,"down_votes":1,"body":"Very few ults \"remove the chance to win lane\", now that I'm trying to think of them. Mundo's, maybe.","replies":[{"poster":"Jefftiffy","date":"2016-02-08T02:00:36.728+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=charcharmunro,realm=NA,application-id=3ErqAdtq,discussion-id=PqEGzvQE,comment-id=000300000000000000000000000000000000000000000000,timestamp=2016-02-08T01:31:57.109+0000)\n> \n> Very few ults \"remove the chance to win lane\", now that I'm trying to think of them. Mundo's, maybe.\n\nMalzahar's significantly reduces its. There are very few mids who can actually deal with him post 6. Galio being about the only one I can think of. Why? Because even high ranged mids have to fear the possible flash AIDS silence pool ult combo.\n\nComing from someone who plays Malzahar regularly, the only solution is to not ever get in his range or he will easily kill you if he has his entire combo up. The only other person I can think of is {{champion:1}} if you manage to start your cancer nuke sooner than his.","replies":[{"poster":"INoble KnightI","date":"2016-02-08T16:34:35.125+0000","up_votes":5,"down_votes":0,"body":"I read in a post somewhere that the best way to beat Malz is not to win lane but to win the game.","replies":[]}]}]},{"poster":"TheFirespilter","date":"2016-02-08T02:33:51.467+0000","up_votes":1,"down_votes":0,"body":"Did you not read OP's post? The whole reason he/she plays Malzahar is because he counters assasins.","replies":[{"poster":"TheWoollyMammoth","date":"2016-02-08T02:45:20.886+0000","up_votes":3,"down_votes":2,"body":"Counters. does not mean they instantly lose and have no chance of winning.","replies":[{"poster":"Stevev45","date":"2016-02-08T21:20:57.240+0000","up_votes":3,"down_votes":0,"body":"I play Malz none stop, and still ban zed.","replies":[]}]}]}]}]}]},{"poster":"EfficientDynamo","date":"2016-02-08T03:51:33.200+0000","up_votes":9,"down_votes":3,"body":"I have to disagree, as a Malz main he does have a fair amount of counterplay, especially in lane. He _needs_ to save his E for farming until mid/late game, he has no mobility, and has high CD's and manacosts. He just has _different_ counterplay than playing \"dodge the skillshot.\"","replies":[{"poster":"Thryale","date":"2016-02-09T06:23:42.034+0000","up_votes":5,"down_votes":1,"body":"yes. this.\n\nThere are 2 primary kinds of counter play, Intellectual, and Mechanical.\n\nMechanical Counterplay is the counterplay riot's been emphasizing over the past 3 years or so. Mainly because it's easy to grasp for newer players and it leads to flashy plays and epic high points. (dem LC$ Big Play$ yo) It also rewards a certain gaming demographic that has talents in twitch reactions and second by second judgment making.\n\nIntellectual Counterplay is the counterplay that was more common at league's inception when it was more of a niche game for those just coming off of dota and other popular mmo's. It focuses on timing, positioning, and game knowledge as a whole. There is nothing wrong with this, but it requires more thinking and less reacting. Forethought rather than reflexes.\n\nNow, neither one of these are bad. And in moderation both make league a better game. But they serve two completely different and distinct types of players.\n\nIf we want to use professional play as an example. Faker is an excellent example of the player type that excels with an abundance of mechanical counter play. His reaction times and reflexes are astounding.\n\nHai, on the other hand, is a player that performs much better when there is more Intellectual counterplay present. I say this because Hai is the core of C9, but it's becoming increasingly harder to keep him on the team as mechanical skill of the other teams keeps going up. Hai's decision making and game sense is top tier.\n\n...I've totally lost my train of thought and don't know where I'm taking this anymore. :( But I hope ya'll found it informative at least.","replies":[{"poster":"warmcorntortilla","date":"2016-02-09T21:38:38.258+0000","up_votes":2,"down_votes":0,"body":"This is exactly what I think, too. I enjoy playing champions where I can think my way out of a situation. That is exactly what Malzahar is, and what he forces people to do. When I play against him, I find it to be pretty simple, because his kit doesn't allow him a lot of options. He AFK farms and punishes people hard as hell for trying to kill him. He is like, the ultimate anti-assassin. The kind of people that play assassins tend to be pretty aggressive in lane, and he punishes that really hard, too. All the people that are used to cheesing out early kills on Kats, Yasuos, Zeds and Fizzes are whining about Malzahar because he's the ONE champion that really, really punishes that assassin playstyle.","replies":[]},{"poster":"warpenguin555","date":"2016-02-09T15:00:43.350+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Thryale,realm=NA,application-id=3ErqAdtq,discussion-id=PqEGzvQE,comment-id=0003000000000000000000000000000000010001,timestamp=2016-02-09T06:23:42.034+0000)\n>\n> yes. this.\n> \n> There are 2 primary kinds of counter play, Intellectual, and Mechanical.\n> \n> Mechanical Counterplay is the counterplay riot's been emphasizing over the past 3 years or so. Mainly because it's easy to grasp for newer players and it leads to flashy plays and epic high points. (dem LC$ Big Play$ yo) It also rewards a certain gaming demographic that has talents in twitch reactions and second by second judgment making.\n> \n> Intellectual Counterplay is the counterplay that was more common at league's inception when it was more of a niche game for those just coming off of dota and other popular mmo's. It focuses on timing, positioning, and game knowledge as a whole. There is nothing wrong with this, but it requires more thinking and less reacting. Forethought rather than reflexes.\n> \n> Now, neither one of these are bad. And in moderation both make league a better game. But they serve two completely different and distinct types of players.\n> \n> If we want to use professional play as an example. Faker is an excellent example of the player type that excels with an abundance of mechanical counter play. His reaction times and reflexes are astounding.\n> \n> Hai, on the other hand, is a player that performs much better when there is more Intellectual counterplay present. I say this because Hai is the core of C9, but it's becoming increasingly harder to keep him on the team as mechanical skill of the other teams keeps going up. Hai's decision making and game sense is top tier.\n> \n> ...I've totally lost my train of thought and don't know where I'm taking this anymore. :( But I hope ya'll found it informative at least.\n\nso:\nMechanical is like outplaying and Intellectual is like not standing next to a dying minion that has Malefic Visions. right?","replies":[]}]},{"poster":"Jefftiffy","date":"2016-02-08T04:07:59.482+0000","up_votes":2,"down_votes":5,"body":"> [{quoted}](name=EfficientDynamo,realm=NA,application-id=3ErqAdtq,discussion-id=PqEGzvQE,comment-id=000300000000000000000000000000000001,timestamp=2016-02-08T03:51:33.200+0000)\n>\n> I have to disagree, as a Malz main he does have a fair amount of counterplay, especially in lane. He _needs_ to save his E for farming until mid/late game, he has no mobility, and has high CD's and manacosts. He just has _different_ counterplay than playing \"dodge the skillshot.\"\n\nExcept he has entirely on clicks and once he get's AP his mana costs go out the window. If you ever get double doran's it's really hard to go oom. RoA completely solves his problems.","replies":[{"poster":"EfficientDynamo","date":"2016-02-08T18:58:14.803+0000","up_votes":6,"down_votes":1,"body":"Again, counterplay against Malz is different than the traditional counterplay of avoiding the skillshot. If you want to talk late game once mana isn't as big of a problem, he is medium range and will risk eating some serious poke/CC if he tries to go in and E or R you. And his R is useless unless he knows that he can let it off without retaliation, so its usefulness and power decreases in situations outside of a 1v1.\n\nAlso if he doesn't have enough AP to kill you with his rotation, his CD's give you a fairly large window to retaliate or escape.\n\nHe is certainly strong in skilled hands, but personally I would rather go up against a Malz than a decent Lux or Xerath. At least against Malz I can get close enough to have a chance at hitting them.","replies":[]},{"poster":"Auz the Ripper","date":"2016-02-08T04:27:39.431+0000","up_votes":6,"down_votes":1,"body":"You have obviously never played Malz.\nRoA does not solve his mana problems; it lets him cast his full rotation twice more at maximum. \n850 mana means 8 spells for malz.","replies":[]}]}]}]},{"poster":"doombotMECHA","date":"2016-02-08T12:55:21.689+0000","up_votes":4,"down_votes":0,"body":"truth. when the zed roams, do you as lux roam? HELL NO.\nas zed vs. malz, you try to kill pre-six, then at six you roam for your kills because you don't get to have a faceroll 1v1 verus the entire roster.","replies":[{"poster":"Khâmul","date":"2016-02-08T14:32:36.847+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=doombotMECHA,realm=NA,application-id=3ErqAdtq,discussion-id=PqEGzvQE,comment-id=00030000000000000000000000000001,timestamp=2016-02-08T12:55:21.689+0000)\n>\n> truth. when the zed roams, do you as lux roam? HELL NO.\n> as zed vs. malz, you try to kill pre-six, then at six you roam for your kills because you don't get to have a faceroll 1v1 verus the entire roster.\n\nyou can kill malzhar even if he has his ultimate. the ultimate alone isn't dangerous. His null zone+ the ultimate is dangerous. you can manage to survive with malmortius if you take E+ R. but the null zone is deaaaaadly if you stay for the full duration","replies":[]}]}]}]}]}]}]},{"poster":"Penta Penguin","date":"2016-02-08T00:45:00.303+0000","up_votes":7,"down_votes":2,"body":"Then you don't 1v1 the Malz dude. Farm, harass, poke, gank, etc. are all your counterplay options. Saying it's not fair that you can't 1v1 malz is like saying it's not fair you can't punch your way through a wall when there's a door next to it.","replies":[]},{"poster":"YumaS2Astral","date":"2016-02-07T23:57:14.580+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=charcharmunro,realm=NA,application-id=3ErqAdtq,discussion-id=PqEGzvQE,comment-id=00030000,timestamp=2016-02-07T21:35:25.907+0000)\n>\n> In fairness, 1v1-ing Malz without a QSS literally does not have counterplay besides \"survive it\".\n\nThat's like saying \"if you don't have Zhonya then {{champion:238}} has no counterplay other than survive him\"","replies":[{"poster":"AlwaysByMySide","date":"2016-02-08T00:03:06.288+0000","up_votes":2,"down_votes":11,"body":"> [{quoted}](name=YumaS2Astral,realm=NA,application-id=3ErqAdtq,discussion-id=PqEGzvQE,comment-id=000300000001,timestamp=2016-02-07T23:57:14.580+0000)\n>\n> That's like saying \"if you don't have Zhonya then {{champion:238}} has no counterplay other than survive him\"\n\nOnly Zed's ult actually has counterplay beyond surviving it.\n\nBad comparison.","replies":[{"poster":"TheWoollyMammoth","date":"2016-02-08T00:05:45.474+0000","up_votes":7,"down_votes":1,"body":"so does malz. Any delayed cc or teammates will stop it dead on the spot. and most likely get malz killed. Zed can escape a botched ult. Malz only has the sweet release of death to comfort him.","replies":[]}]},{"poster":"TheWoollyMammoth","date":"2016-02-07T23:59:20.560+0000","up_votes":2,"down_votes":0,"body":"ALL THE THIS!^","replies":[]}]}]}]},{"poster":"RiotRepertoir","date":"2016-02-09T03:47:34.850+0000","up_votes":20,"down_votes":0,"body":"Power against assassins or mobile types is something that I've always felt like people attached to on Malzahar. Posts akin to this one helped me to confirm that. I intend to keep it as a part of his update.","replies":[{"poster":"Thryale","date":"2016-02-09T05:37:16.956+0000","up_votes":5,"down_votes":0,"body":"while yer at it, could you do some tests to see letting malz's E tic every .25 secs instead of every .5 secs feels? It's really annoying to have the caster minions steal my last hits. :/","replies":[{"poster":"RiotRepertoir","date":"2016-02-09T06:09:28.455+0000","up_votes":11,"down_votes":0,"body":"I've actually tried to do some stuff to make last-hitting a little less painful for him. Hopefully it sticks.","replies":[{"poster":"Thryale","date":"2016-02-09T08:11:28.909+0000","up_votes":4,"down_votes":0,"body":"while yer here Rep, would you share some of your insights on what you want to accomplish with malz?\n\nFrom what I see, malz's kit is kinda torn between 2 different playstyles. One the one hand, you've got the shoving poke/harass playstyle with his Q and E, and on the other you have the assassin/burst playstyle with his W+R synergy.\n\nNow, as was mentioned elsewhere, malz also has some anti-assassin qualities as well. (that you plan on keeping) Which of the 2 aforementioned styles do you think best suits this? The really safe harass/poke tends to be looked down upon as it makes laning boring, but the lockdown/burst/assassin tends to feel rather feast or famine if done right and just plain toxic if done wrong. (I know it sounds odd to say something is feast or famine if done right, but either you kill them, or you don't, and if you don't, they kill you)\n\nWhat are your thoughts? I know you plan on keeping his space aids, but what else is gonna stay, and what is up for the chopping block? You don't have to be extremely specific, but as a malz main, I'd really like to hear your thoughts going forward with the rework.","replies":[]}]}]},{"poster":"Rebonack","date":"2016-02-09T03:50:42.079+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=PqEGzvQE,comment-id=0016,timestamp=2016-02-09T03:47:34.850+0000)\n>\n> Power against assassins or mobile types is something that I've always felt like people attached to on Malzahar. Posts akin to this one helped me to confirm that. I intend to keep it as a part of his update.\n\nGlad you're keeping Malz as a guy for shutting down divers.","replies":[]}]},{"poster":"Simpumba","date":"2016-02-07T17:14:09.770+0000","up_votes":14,"down_votes":1,"body":"I hope they keep a good chunk of what he does, I want him to keep his space aids, and that ult. IMO malz is somewhat fine, but he's like velkoz. Easy to catch out and destroy when he ults.","replies":[{"poster":"warpenguin555","date":"2016-02-07T17:15:52.353+0000","up_votes":16,"down_votes":0,"body":"> [{quoted}](name=LetzGetFizzical,realm=NA,application-id=3ErqAdtq,discussion-id=PqEGzvQE,comment-id=0000,timestamp=2016-02-07T17:14:09.770+0000)\n>\n> I hope they keep a good chunk of what he does, I want him to keep his space aids, and that ult. IMO malz is somewhat fine, but he's like velkoz. Easy to catch out and destroy when he ults.\n\nThey already confirmed that Space aids is staying. I think Repertoir already said he's keeping it","replies":[{"poster":"Kaeblen","date":"2016-02-08T02:33:40.753+0000","up_votes":1,"down_votes":0,"body":"have they said anything about keeping his passive (I want it mostly unchanged)?\n\nlink to post?","replies":[{"poster":"Noam Braumsky","date":"2016-02-08T02:55:11.666+0000","up_votes":1,"down_votes":0,"body":"No links, but I think I read somewhere Repertoire wanted to keep some form of voidlings in his kit, not sure if it'll still be the same passive though.","replies":[{"poster":"KarKzz","date":"2016-02-08T09:03:31.997+0000","up_votes":4,"down_votes":2,"body":"You are safe with Repertoir.","replies":[{"poster":"doombotMECHA","date":"2016-02-08T12:34:48.082+0000","up_votes":1,"down_votes":0,"body":"but ad malz is prolly gonna die.\nT_T","replies":[{"poster":"Ez dePaz","date":"2016-02-08T13:07:46.668+0000","up_votes":4,"down_votes":1,"body":"Rep said that he want's to keep it as there really isn't any need to remove it. Ap Malz gains nothing from the Ad scaling so removing it doesn't leave any room for buffs it only kills one of the few off-meta builds left.","replies":[]}]}]}]}]}]},{"poster":"High5","date":"2016-02-07T18:36:08.265+0000","up_votes":3,"down_votes":2,"body":"He's not bad, but highly susceptible to any champ that can get on top of him.  Malz basically needs a team that can cc and keep him safe, which doesn't happen in 90% of solo q.\n\nCool kit, but in the past 1.5 years of meta, it's basically unplayable if Malz has to rely on himself to stay alive.  It's the same reason Cass fell out of the meta.  Different kit, same flaws.","replies":[{"poster":"YumaS2Astral","date":"2016-02-07T22:23:05.379+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=High5,realm=NA,application-id=3ErqAdtq,discussion-id=PqEGzvQE,comment-id=00000001,timestamp=2016-02-07T18:36:08.265+0000)\n>\n> He's not bad, but highly susceptible to any champ that can get on top of him.  Malz basically needs a team that can cc and keep him safe, which doesn't happen in 90% of solo q.\n> \n> Cool kit, but in the past 1.5 years of meta, it's basically unplayable if Malz has to rely on himself to stay alive.  It's the same reason Cass fell out of the meta.  Different kit, same flaws.\n\nI started to use movement speed quintessences and to use {{item:3116}} - This makes Malzahar much more self-sufficient since he can mitigate his lack of mobility.","replies":[{"poster":"IGotScuttleCrabs","date":"2016-02-07T22:42:10.461+0000","up_votes":2,"down_votes":1,"body":"Until you press R. Then he still has the exact same problems. But with less base ap from quints.","replies":[]}]}]}]}]}