{"poster":"KuvinFukinAtya","date":"2014-09-05T21:12:10.133+0000","title":"Phabius, félelem hírnöke","subforum":"Rajongói alkotások","up_votes":1,"down_votes":1,"body":"Ionia szigetén egy kis faluban élt egy kis gyermek Kain.Kain szeretet a hegyekben bóklászni,játszani.Egy nap barátival egy épületre találtak.Az épületből csak úgy sugároztak a sötét energiák. Kain pusztán félelmében elakart menni,azonban társai egyből nevetni kezdtek:\"félős,félős!!!\"kiáltozták.Kain ennek hatására rávette magát hogy bemenjen társaival. A gyerekek szinte versenyt tartottak kimer tovább menni.Míg egy csarnokhoz nem értek,a csarnok tele volt motívumokkal. Közepén egy oltár. A gyerekek kíváncsian vizsgálták a szobrokat,képeket,könyveket.Míg Kain ügyetlenül széttörte az oltárat. A maradványokból sötétség áradt. Rövid idő után teljesen beterítette a csarnokot.Kain a kiuttat kereste mikor valami megérintette aminek érintése teljesen megrémítette.Nem sokkal később egy barátja sikítását hallotta,majd még egyét és még egyét.A félelemtől teljesen leblokkolt. Egyszer csak valamiben megbotlott ,társa volt az holtan,arcáról a rémület tükröződött .A sötétség ellszàlt, maga előtt egy sötét alakot lát.Szíve a torkában dobogott.Nehezen ki csikart egy mondatott:Te ki ki vagy?(A csávó dadog a félelemtől)Az alak pusztán okát mondta meg ami miatt nem ölte meg. Ez pedig az volt mert Kain kiszabadította.Kain ez után hazáig futott. Kérdezték tőle hogy mi történt,elmesélte a dolgokat és kérdezte a falu bölcsétöl hogy ki ez az alak.Megtudta hogy ő Phabius.Egy az 5 halálos démonból, ő a félelem megtestesítője.Ės egyetlen célja testvérei kiszabadítása,hogy együtt elpusztítsák Ioniát. A beszélgetésnek vége szakadt amikor egy jelet lát a gyermeken , viszont már nem tudta végig mondani,hogy mi az. Az árnyékból 2kéz megfojtotta.Ez után Phabius lépet elő,és megtámadta a falut. Az emberek mindent hátra hagyva futottak de elmenekülni senki nem tudott.\r\n\r\n\"Csak netán félsz?\" Phabius. Első találkozásakor Kainel.\r\n\r\nPassiv: ha felmegy a jelzője akkor a közelében lévő összes ellenség 1 secre fierrelve lesz. Töltést spelljeivel és basic attackjával szerezhet.\r\n\r\nQ: Egy vastag tölcsér alakban csap a két szabjával ez ad damaget okoz valamint feerelt egységeken 50/75/100/125/150% plusz damaget okoz. No cost. Cd : 17/14/9/6/4\r\n\r\nW: Egy Hős mögé teleportál és jelet rakrá,a jel (ellenségen) Felerősíti a sebződését és a megijedés időtartalma 20%val nő.Szövetségesen egy buffot add neki 5/10/15/20/25 secre mellyel ha 4szer egymás után ütimeg ugyan azt az ellenfelet akkor az 30/35/40/50/60%val lassul . No cost. CD:20 /18/16/14/12\r\n\r\nE: A közeli megijedt egységekből 30% adt lop 5/8/11/14/17 secre cd:25sec No cost\r\n\r\nR:egy hatalmas árnyékfelhőt idéz egy nagy arénába (graves füst féle)ebben minden champ 50%val lassul csak Phabius nem.Kívülről csak egy nagy fűst felhő láccik ,belül pedig Phabiuson kívül mindenki csak a egy melle basic attacknyi rangen bellűl lát. Ha a championok 2secnél több ideig vannak bent akkor 1,5 secre megijednek. 5/6/7 másodpercig van ott (addig kitombolhatja magát Phabius).\r\n\r\nEz lenne az én kis champem remélem tetszik.Kritikákat és ötleteket várok.:)\r\n\r\nRajz hamarosan érkezik:)","replies":[]}