{"poster":"Pocozon","date":"2017-03-18T09:56:58.722+0000","title":"Riot Miss understands the purpose of my E-mail (Riot Support Is The Worst)","subforum":"[ARCHIVED] Help & Support","up_votes":4,"down_votes":1,"body":"I have sent Riot an E-mail to change my E-mail address for my account because I have lost my E-mail that was responsible for my account, they sent me an E-mail that has **21** questions and I answered it correctly. I've got an E-mail from Riot saying: \n**Greetings Summoner,\nI am very sorry for the inconvenience this may cause you, but only the original creator of an account may request a recovery as the transfer, sale or trade of an account is not recognized.\nAs I have informed you before, account security is something that we take very seriously at Riot. Account sharing of any kind is against our Terms of Use, and any further incidences of sharing will ultimately result in account suspension.\nI apologize if this decision disappoints you, but our decisions have been made to reduce fraud and protect player privacy.\nKind regards\nBlashyrkh12\nPlayer Support Specialist**\n\nThis is a joke, Riot suspended my account for sharing my account while I didn't. Even if you make it clear for Riot, they will miss-understand.\n\n1- They have sent the incorrect 21 questions (They sent me an E-mail for returning my account as if I forgot my password or someone changed it)\n2- They take wrong decisions that makes people quit the Game\n\nSolution: Understand Customer's purpose and bring new staff rather than these staff.","replies":[{"poster":"Porocles","date":"2017-03-18T17:09:41.552+0000","up_votes":2,"down_votes":1,"body":"It sounds like you've had a frustrating experience, but I promise the intent of our account recovery team is to help.  We won't restore an account unless we are absolutely sure- without a shadow of a doubt- that you are the owner.  Even if you did not pass the first time, it's okay to keep trying.  Just reach out in an [account recovery form](https://support.riotgames.com/hc/en-us/requests/new?ticket_form_id=72416) and we'll continue working with you.  Good luck!","replies":[]},{"poster":"Pocozon","date":"2017-03-18T10:01:22.172+0000","up_votes":1,"down_votes":2,"body":"Anyone stands beside me?","replies":[]}]}