{"poster":"Tobbel","date":"2019-02-10T15:04:37.601+0000","title":"Kann man sowas mal eine Strafe erlassen ?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":6,"body":"ich bin gerade in meinen promos zu dia 3. da ich last pick bin und lulu spielen wollte hab ich dem mid angeboten f&uuml;r mich zu picken. das hat er auch gemacht. als ich mit picken dran war hab ich ihm geschrieben was er haben will. keine reaktion ( ein mate schreibt noch lol ). die letzte sekunde l&auml;uft ich pick einfach ahri war aber anscheinend zu langsam.\r\n\r\ndas ist mir komischerweise nicht erst das erste mal passiert. fakt ist das erste spiel wurde direkt als lose abgestempelt weil mein mate 1. afk war oder 2. mir ein lose bescheren wollte. das geht meiner meinung nach gar nicht","replies":[{"poster":"Amycos Cyrus","date":"2019-02-10T15:40:26.659+0000","up_votes":4,"down_votes":0,"body":"Pick niemals für andere, dann passiert sowas nicht XD","replies":[{"poster":"Tobbel","date":"2019-02-10T16:26:06.689+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Amycos Cyrus,realm=EUW,application-id=KYnfKGf0,discussion-id=NEkqMLpj,comment-id=0000,timestamp=2019-02-10T15:40:26.659+0000)\n>\n> Pick niemals für andere, dann passiert sowas nicht XD\n\nja aber ich wurde jetzt quasie dafür bestraft, dass ich was gutes \"vollbringen\" wollte weil mein mate der für mich gepickt hat afk war oder was weiß ich. sowas zählt für mich unter schlechtem verhalten. stell dir vor du bist in den promos zu master hast genau so einen fall ( auch wenn du nicht für andere pickst ) aber WENN du es tun würdest","replies":[{"poster":"Amycos Cyrus","date":"2019-02-10T17:11:49.604+0000","up_votes":3,"down_votes":0,"body":"Das es sich beschissen anfühlt, wegen sowas zu verlieren, kann ich verstehen, aber es ist nun mal so.\n\nIch für meinen Fall vermute auch (keine Ahnung ob es stimmt), dass man nur den Lose bekommt, wenn man selbst nicht pickt. Also passiert nichts, wenn es ein Mate oder ein Gegner nicht rechtzeitig tut.","replies":[]}]}]},{"poster":"PlsLoLMMO","date":"2019-02-10T18:32:52.568+0000","up_votes":2,"down_votes":2,"body":"Nicht für ungut aber ich gönns dir persönlich einfach weil dein profil mir jedes mal aufs neue sagt das du weder Dia 3 noch dia 4 geschweige denn in platin hättest sein dürfen.  Du wirst in fast jedem game von nem dominanten Spieler in deinem Team gecarried und trägst wirklich selbst als Lulu nur gering dazu bei. Trotz auf der Elo op champs lieferst du sehr oft ziemlich schlechte ergebnisse ab , supportest teilweise als support sehr dürftig und auch wenn du nicht wirklich oft stirbst ( was meiner meinung nach der einzige Grund ist das du ne positive winrate hast) bist du fast immer der most worthless Spieler im Team vom Gameplay her aber kannst eben dadurch profitieren das du recht wenig tode hast und einfach op champs auf der Elo spielst.\n\nfinde so etwas geht ebenfalls gar nicht lul aber who cares in dia ist eh der größte random gewürfelte haufen zusammen am spielen lawl .","replies":[{"poster":"Tobbel","date":"2019-02-10T19:20:22.928+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=PlsLoLMMO,realm=EUW,application-id=KYnfKGf0,discussion-id=NEkqMLpj,comment-id=0002,timestamp=2019-02-10T18:32:52.568+0000)\n>\n> Nicht für ungut aber ich gönns dir persönlich einfach weil dein profil mir jedes mal aufs neue sagt das du weder Dia 3 noch dia 4 geschweige denn in platin hättest sein dürfen.  Du wirst in fast jedem game von nem dominanten Spieler in deinem Team gecarried und trägst wirklich selbst als Lulu nur gering dazu bei. Trotz auf der Elo op champs lieferst du sehr oft ziemlich schlechte ergebnisse ab , supportest teilweise als support sehr dürftig und auch wenn du nicht wirklich oft stirbst ( was meiner meinung nach der einzige Grund ist das du ne positive winrate hast) bist du fast immer der most worthless Spieler im Team vom Gameplay her aber kannst eben dadurch profitieren das du recht wenig tode hast und einfach op champs auf der Elo spielst.\n> \n> finde so etwas geht ebenfalls gar nicht lul aber who cares in dia ist eh der größte random gewürfelte haufen zusammen am spielen lawl .\n\nalso erstmal mein lieber plslolmmo hab ich nicht gefragt ob ich wirklich in diese elo gehöre sondern ich habe gefragt ob es nicht angebracht wäre wenn man jemanden bestraft wenn ich so nett bin jemanden sage, dass er für mich picken kann er aber dann wenn ich für ihn picken kann afk geht oder was weiß ich und mir dann quasie ein lose in den promos zugeschrieben wird.\n\naußerdem wird doch immer so schön gesagt, dass wenn man nicht in eine elo gehört man früher oder später droppt. ich halte mich aber schon länger in dia 4 von daher gehör ich wohl doch in die elo. mal davon ausgesehen wo ist lulu bitte ein op champ ? schon mal ihre winrate angeschaut ? \n\nzweitens wenn ich mir deinen acc anschaue bist du weder gerankt hast praktisch gar nix vorzuweisen ( was ich zurücknehme wenn das dein smurf ist oder was weiß ich ). von daher am besten gar nix schreiben wenn das 0 zum thema beiträgt.","replies":[{"poster":"eingew","date":"2019-02-11T07:51:12.115+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tobbel,realm=EUW,application-id=KYnfKGf0,discussion-id=NEkqMLpj,comment-id=00020000,timestamp=2019-02-10T19:20:22.928+0000)\n>\n> also erstmal mein lieber plslolmmo hab ich nicht gefragt ob ich wirklich in diese elo gehöre sondern ich habe gefragt ob es nicht angebracht wäre wenn man jemanden bestraft wenn ich so nett bin jemanden sage, dass er für mich picken kann er aber dann wenn ich für ihn picken kann afk geht oder was weiß ich und mir dann quasie ein lose in den promos zugeschrieben wird.\n> \n> außerdem wird doch immer so schön gesagt, dass wenn man nicht in eine elo gehört man früher oder später droppt. ich halte mich aber schon länger in dia 4 von daher gehör ich wohl doch in die elo. mal davon ausgesehen wo ist lulu bitte ein op champ ? schon mal ihre winrate angeschaut ? \n\nAlso erstmal: Ich finde seinen Vorwurf auch völlig unsinnig, dir schlechtes zu wünschen dafür, dass du von etwas profitierst, worauf du nicht den geringsten Einfluss hast.\n\nDann als zweites... naja so unrecht hat er nicht. Ich weiß nicht, wie es auf Dia aussieht, aber ich sitze im Moment auf 25% Winrate in Platin 3 und habe heute morgen -16 LP für den x-ten Loss in Folge kassiert. Irgendwas stimmt seit der neuen Season mit dem System gehörig nicht.","replies":[]}]}]},{"poster":"Bierbaron Knoppi","date":"2019-02-10T15:59:08.638+0000","up_votes":3,"down_votes":3,"body":"Alles unter D1 ist doch sowieso trash ... deswegen ist es doch egal ob du da LP verlierst oder nicht. Außerdem ist es doch deine Schuld wenn du so etwas anbietest. Pick deinen Champ und gut ist.","replies":[{"poster":"Dreadlord Mike","date":"2019-02-10T16:23:47.852+0000","up_votes":1,"down_votes":1,"body":"die Dia 1 grenze gibt es schon lange nicht mehr tbh. \nEs gibt sowohl von dia 4-dia 1 ziemlich sicke spieler aber natürlich genauso richtig schlechte, die Häufigkeit der \"guten\" Plays wird einfach nur höher.","replies":[]},{"poster":"Tobbel","date":"2019-02-10T16:22:45.895+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Bierbaron Knoppi,realm=EUW,application-id=KYnfKGf0,discussion-id=NEkqMLpj,comment-id=0001,timestamp=2019-02-10T15:59:08.638+0000)\n>\n> Alles unter D1 ist doch sowieso trash ... deswegen ist es doch egal ob du da LP verlierst oder nicht. Außerdem ist es doch deine Schuld wenn du so etwas anbietest. Pick deinen Champ und gut ist.\n\nja sag das mal den rund 90 % der spielern die in der trash elo sind xD inwiefern ist das meine schuld ? ich biete jemanden an für mich zu picken damit mein mate seis top / mid sein match up besser kalkulieren kann. der sinn erschließt sich mir nicht ^^","replies":[]}]}]}