{"poster":"niks welikiq","date":"2016-09-05T19:34:59.379+0000","title":"More Hextech keys pls","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"I wonder can rito do something like a guaranteed key drop like if u havent gotten a key past 9 wins the 10th is GARENteed.pls make it happen cuz i feel like everyone needs kesys to open their chests .For example i play around 10 to 15 games a day 5 to 9 are wins but i havent receved a key in 3 weeks now and im sitting at 8 unopened chests cuz i dont have the keys for them . i dont know if im just incredebly unlucy cuz my friend does get sometimes when we play and i dont but even he has 6 unopedned chests + he hasnt taken all the chests available , so pls make GARENteed key a thing so we can finaly open these chests (and get these champshards).","replies":[{"poster":"Best Kog NA","date":"2016-09-05T19:37:19.858+0000","up_votes":3,"down_votes":0,"body":"I have 4 keys, I need chests at this point lol","replies":[{"poster":"EndlessSorcerer","date":"2016-09-06T01:40:55.408+0000","up_votes":1,"down_votes":0,"body":"I have four chests; I need keys.","replies":[]},{"poster":"WHTFOZ","date":"2016-09-06T01:30:42.051+0000","up_votes":1,"down_votes":0,"body":"i'm in the same boat","replies":[{"poster":"Best Kog NA","date":"2016-09-06T01:33:50.043+0000","up_votes":1,"down_votes":0,"body":"At this point I'm trying to find someone who can consistently get an S rank so I can just play norms with them to get the chests lol....","replies":[{"poster":"WHTFOZ","date":"2016-09-06T01:39:06.903+0000","up_votes":1,"down_votes":0,"body":"Ya got to love that feeling when you think you did really good in a match and get A+{{item:3151}}","replies":[{"poster":"Best Kog NA","date":"2016-09-06T01:40:21.927+0000","up_votes":1,"down_votes":0,"body":"I had to sacrifice my dignity and play non support champs support to get the few chests I've gotten. I don't have a big enough champion pool {{item:3070}}","replies":[]}]}]}]}]},{"poster":"Sukishoo","date":"2016-09-06T01:42:03.444+0000","up_votes":1,"down_votes":0,"body":"You're not supposed to get them THAT often, or else they'd really be just handing everything out for free.  The Keys are what they want you to buy afterall.","replies":[]},{"poster":"Geauxx","date":"2016-09-05T20:51:08.713+0000","up_votes":1,"down_votes":0,"body":"sitting here with about 8 chest... get a few keys in one day, then bam, i might get one key for the rest of the month.","replies":[]},{"poster":"S0kaX","date":"2016-09-05T19:37:15.161+0000","up_votes":1,"down_votes":0,"body":"I see everywhere posts with \"more keys\" meanwhile I'm waiting here with 7 keys and 0 chests :)))","replies":[]}]}