{"poster":"Jambulija","date":"2015-01-29T13:52:22.148+0000","title":"Im sorry Rito but Sejuani can't jungle no more","subforum":"Gameplay","up_votes":8,"down_votes":14,"body":"I dont know about the other tank jungle picks, But I'v tried everything i know and i could not help at all from the jungle with her.\r\n\r\nTried couple of custom games too and reaching lvl 6 is way to late even with some taxing.","replies":[{"poster":"Done25","date":"2015-01-29T21:46:29.217+0000","up_votes":4,"down_votes":0,"body":"Okay, here are a few things you're doing wrong:\n\nDitch the WotA, ditch the Spirit Visage, delay the Rylas.\n\nInstead\n\n1: Rush the Rod of Ages. It gives you the Health and AP you need to power your Flail of the Northern Winds, while also giving you all the mana you will ever need.\n\n2: Grab the Magus Trailblazer. AP helps your clear by boosting that initial HP% hit, which is vital for killing the big creep. The CDR is also great for letting you use your abilities more often.\n\n3: Ionian boots can be used to finish your 40% cdr with the +5 CDR offence mastery.\n\n4: Use flat Armor Quints, the difference they make is staggering.\n\nUse your last three slots as needed.\nRylas, Zhonya, Deathcap, and Abyssal Scepter are great offensive items.\nSunfire Cape, Omen, Banshee's Veil, or Warmogs if you need more raw survivability.","replies":[{"poster":"Jambulija","date":"2015-01-30T00:23:06.261+0000","up_votes":1,"down_votes":0,"body":"Ill try this tnx.","replies":[{"poster":"Done25","date":"2015-01-30T00:30:19.359+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jambulija,realm=EUNE,application-id=3ErqAdtq,discussion-id=Emtqm1Rm,comment-id=00060000,timestamp=2015-01-30T00:23:06.261+0000)\n>\n> Ill try this tnx.\n\nCool, let me know how it goes! :D","replies":[{"poster":"Jambulija","date":"2015-01-30T12:53:51.315+0000","up_votes":1,"down_votes":0,"body":"First of all tnx a lot! \nI had fun again with her even though it was a custom game.\n\nSo it went like this:\nhttps://photos-5.dropbox.com/t/2/AABoFeDbcP3LJ2ALbz4ghgfyLA6nBaEgkhtD-ezJSZWFjw/12/211320854/png/1024x768/3/1422626400/0/2/lol_b.png/CJaA4mQgASACIAMoASgC/53MZA8ZAO0P9S60LkOLcEKVYFKPYmbSAUNeothK7atQ\nmasteries ar all def except for single point in fleet of foot.\n\n \nThis turned out to be a very good build! She got really strong after the 20th min, but my climbing to lvl6 was still a bit slow, but i think i can crank it up a bit more. \nMaybe u have some rune setup in mind?","replies":[{"poster":"Done25","date":"2015-01-30T17:24:17.938+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jambulija,realm=EUNE,application-id=3ErqAdtq,discussion-id=Emtqm1Rm,comment-id=0006000000000000,timestamp=2015-01-30T12:53:51.315+0000)\n>\n> First of all tnx a lot! \n> I had fun again with her even though it was a custom game.\n> \n> So it went like this:\n> https://photos-5.dropbox.com/t/2/AABoFeDbcP3LJ2ALbz4ghgfyLA6nBaEgkhtD-ezJSZWFjw/12/211320854/png/1024x768/3/1422626400/0/2/lol_b.png/CJaA4mQgASACIAMoASgC/53MZA8ZAO0P9S60LkOLcEKVYFKPYmbSAUNeothK7atQ\n> masteries ar all def except for single point in fleet of foot.\n> \n>  \n> This turned out to be a very good build! She got really strong after the 20th min, but my climbing to lvl6 was still a bit slow, but i think i can crank it up a bit more. \n> Maybe u have some rune setup in mind?\n\nAttack speed reds.\nEither flat or scaling armor yellows depending on how safe you want your first clear to be.\nScaling MR blues\nFlat armor quints","replies":[]}]}]}]}]},{"poster":"Retillin","date":"2015-01-29T16:46:28.541+0000","up_votes":2,"down_votes":0,"body":"Well to be honest if you are having problems with her now just drop her for a patch or two. The new gold nerf on jungle items hurts her so bad. Going back after 3 camps and getting trailblazer was okay. But pushing her to 4 without the extra money for more pots just destroys her if you are having problems.\n\nI have played a lot of Sej over the years. Once they took away her Q burst (and moved it to Flail to hurt the AP Sej) her entire jungling identity changed. Start gromp if you can, clear wolves, blue buff, crab and either look for a gank (if possible) or try your luck with the razorbeaks (not a fan of that with her at second level). Try to get mobility boots. You are going to be recalling so much early, that the speed just to get back to farming. She is noting but a full tank now. I am not a fan of any AP on her till 6th item. Try to burn a flash or two early (if they flash just walk away and time it, come back within the next 4 mins for a kill).\n\nBut really, she is not in a strong spot if you try to play her AP or burst tank like she was before the power shift on her.","replies":[]},{"poster":"Venowolf","date":"2015-01-29T14:30:40.702+0000","up_votes":2,"down_votes":0,"body":"I'm main Sejuani, I'l put some hints: First try to back early after make the 450g and go to Ranger Traiblazer,  start with the frog smite him very soon to take the poison armor buff,and then go to the blue golem, now you can kill the Crab or the wolfs, this depend of your remaining hp, when you reach the 450g go the RT jungle item, try to end you colossus enhanced very quickly, and then rush the Frozen heart because the new Sejuani have a lot of sinergy with that item.\n\nWhen you go to gank, try to not waste your Q so early, wait for the reaction of your target, sometimes they uses flash or his escapes early so after that you can uses your Q and then permafrost together with your W to secure the kill.\n\nNow Sejuani best weapon and utility is in team figths, a nice R in a well place can make you not only win team figths, win the game, try always to hit a minimum to 3 targets per R, You can use your Q+R to engage is your position is so far.\n\nIn runes uses magic pen in Mark, Seal of hp per lvl, gylph of mr per level and quinteessence of mov spd (This in jungle).\nYou don't need armor runes because his passive and always present Frozen Heart his armor will be high, Also the Hp per level help you to increase the damage of your W so your clear time it's more faster.\n\nFinaly try to build based on your enemy team: if they don't build MR you can surprise them with a Liandry's and Abyssal Scepter combo, if they have an AD heavy comp uses Sunfire, Frozen, Randuins, Thormail, and the surprise Abyssal Scepter, in heavy AP comps use Banshe, Abyssal and if your support don't have, an Solari, also try always to buy stealth and pink wards, Sejuani can have a lot of utility, you only need know how uses his kit correctly!","replies":[{"poster":"Jambulija","date":"2015-01-29T15:24:02.772+0000","up_votes":1,"down_votes":3,"body":"I never use {{item:3110}} on her, I opt for {{item:3143}} instead....\n\nHere is what i usually build after she was changed: {{item:3264}} , {{item:3065}} ,{{item:3143}} , {{item:3152}} and {{item:3116}} , and I still cant take drake as half-fast as half of the other jugglers on lvl 8, which means i get out of the pit with 30% HP. \n\nI dont think a new Build will help very much.\nIts not fun anymore; I need to race Bristle's ass all over to get to 6 and hope i don't get invaded or counter-jingled, All goes to plan i get to 6 and the support {{champion:16}}  is lvl 8!\n\nThe janglers purpose was supposed to help the top tank or fighter to rise lvls faster and farm with more ease, whilst surprising the enemy team . Now Im afraid to gank pre 6, pre 6 gank - I hope i will hit a lucky moment when ganking and the enemy is in a bad spot coz I cant afford to wait for more than 30 sec in the bush. If i don't gank I get flamed, there is ALWAYS  a lane that flames \"no ganks idiot jung\".\n\nJungling with {{champion:113}}  used to feel like an adventure now it feels like working.","replies":[{"poster":"Lord Dusteon","date":"2015-01-29T17:03:30.873+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jambulija,realm=EUNE,application-id=3ErqAdtq,discussion-id=Emtqm1Rm,comment-id=00010000,timestamp=2015-01-29T15:24:02.772+0000)\n>\n> I never use {{item:3110}} on her, I opt for {{item:3143}} instead....\n> \n> Here is what i usually build after she was changed: {{item:3264}} , {{item:3065}} ,{{item:3143}} , {{item:3152}} and {{item:3116}} , and I still cant take drake as half-fast as half of the other jugglers on lvl 8, which means i get out of the pit with 30% HP. \n> \n> I dont think a new Build will help very much.\n> Its not fun anymore; I need to race Bristle's ass all over to get to 6 and hope i don't get invaded or counter-jingled, All goes to plan i get to 6 and the support {{champion:16}}  is lvl 8!\n> \n> The janglers purpose was supposed to help the top tank or fighter to rise lvls faster and farm with more ease, whilst surprising the enemy team . Now Im afraid to gank pre 6, pre 6 gank - I hope i will hit a lucky moment when ganking and the enemy is in a bad spot coz I cant afford to wait for more than 30 sec in the bush. If i don't gank I get flamed, there is ALWAYS  a lane that flames \"no ganks idiot jung\".\n> \n> Jungling with {{champion:113}}  used to feel like an adventure now it feels like working.\n\n...Why do you get Rylai's or Will of the Ancients? Ancients is only good if you have the mana to spam abilities and the damage to heal off them (and hint, if you only have 2 damage items you don't), and your E already gives a slow while R stuns and Q knocks up. Overall, if you want to be useful build cdr (her W gives massive damage due to the %hp, and more cdr is more R's and more E's for cc and clears) with your tankiness.","replies":[{"poster":"Jambulija","date":"2015-01-29T19:21:25.312+0000","up_votes":1,"down_votes":0,"body":"> Why do you get Rylai's or Will of the Ancients? \n\n{{item:3116}} is a last item i pick up, it busts my AP and my HP , plus not even flash and dash is much help if u try to run from her with that item. What do u suggest instead? banner maybe, does it go well on her?\n\n\nfrom {{item:3152}} i get the CDR and the spell-vamp (I get 20% spellvamp), i think it comes in handy when u are facing multiple enemy's ... like when u try to stop 3 enemy's who are after a team mate and u want to survive them after u help....\n\nAny how  these 2 are my last items, if i get in time to them its no problem they work perfectly for me! Its wrecking time! \nI have problems getting to 6 on time and taking dragon fast enough early game. If my teem is not doing good early game i wont be able to help.","replies":[]}]}]}]},{"poster":"MrSc0tty","date":"2015-01-30T17:31:05.851+0000","up_votes":2,"down_votes":1,"body":"Really? I did great with her last game. \n\nUsing utility masteries I was more than capable of hitting level three, ganking at full hp, clear golems and back with 800g.","replies":[]},{"poster":"exiledFromBadmen","date":"2015-01-29T14:07:27.684+0000","up_votes":2,"down_votes":1,"body":"Did you clear crabs frequently?","replies":[{"poster":"Linna Excel","date":"2015-01-29T16:50:42.910+0000","up_votes":1,"down_votes":0,"body":"They don't fight back, so they are okay if health is an issue.  However the other jungler could see you.","replies":[]},{"poster":"Jambulija","date":"2015-01-29T15:26:14.005+0000","up_votes":1,"down_votes":0,"body":"Yes.... Until i hit lvl 6 i click the mouse like crazy and im mumbling the whole time \"cmon,cmon,cmon\"","replies":[]}]},{"poster":"Venowolf","date":"2015-05-02T00:18:15.301+0000","up_votes":1,"down_votes":0,"body":"That was the people say 3 months ago, now we have Cinderhulk and she can't jungle but now is because she is PERMA BAN!!!\n\nSadly but She can't jungle anymore because all the people fear it.","replies":[]},{"poster":"UnSeenDeath88","date":"2015-01-30T17:42:14.630+0000","up_votes":1,"down_votes":0,"body":"I've been going up against a lot of tanky jung Sejuani's recently they build nothing but tank and destroy.","replies":[]},{"poster":"Anomander","date":"2015-01-29T19:35:23.802+0000","up_votes":1,"down_votes":0,"body":"She can jungle just fine.  Hell she can do a full clear before going back something a lot of non sustain jungles can't do and she can do it without a leash.","replies":[]},{"poster":"Decriptic","date":"2015-01-29T16:55:12.632+0000","up_votes":1,"down_votes":1,"body":"i can jungle sejuani fine","replies":[{"poster":"Jambulija","date":"2015-01-29T19:22:13.316+0000","up_votes":1,"down_votes":0,"body":"Glad to hear","replies":[]}]},{"poster":"GundayMonday","date":"2015-01-29T17:08:43.944+0000","up_votes":1,"down_votes":0,"body":"Yeah it's a little rough now. You're limited to maybe 2 jungle clear paths (depending on your runes/masteries) instead of the 8 you had before the change.","replies":[]}]}