{"poster":"YoungNízzn","date":"2019-01-24T21:56:45.892+0000","title":"Season 9","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Ich muss sagen, ich finde es echt schade was aus Lol geworden ist.... Ich spiele das Spiel nun schon seid &uuml;ber 4 Seasons, aber nachdem ich nach meinem ersten Placement Game nicht mehr mit meinem Duo Partner spielen konnte und ich dann nur noch Teams bekommen habe, wo ich mich teilweise gefragt habe ob die &uuml;berhaupt wissen wo QWER sind, habe ich das Spiel nun entg&uuml;ltig deinstalliert. Das man jetzt nicht mal mehr seine 10 Placement Games mit Leuten die 2 elo unterschied haben, spielen kann finde ich echt nervig!! Ich meine ich kann ja nichts daf&uuml;r das er nun mal Gold geranked wird und ich in bronze lande, nur weil mein erstes Game nicht so gut lief. Ich w&uuml;rde mich echt freuen, wenn es wieder einen Grund f&uuml;r mich gibt Lol runterzuladen z.B. das Spiel mal balancen und nicht so ne schei&szlig;e zu designen wie Akali die mit einem Kill schon locker nen 1vs5 gewinnt, also das ist nun echt nicht balanced!","replies":[{"poster":"Icebergslasher","date":"2019-01-25T10:21:13.923+0000","up_votes":1,"down_votes":0,"body":"was soll ich sagen? 4 placements bis jetzt. 3 mal davon troll.\n\ngerade shaco als support. trashtalked mich als adc. und war nicht mal eine sekunde in der botlane.  jgl schaffts in 30 min nicht einmal in die botlane. und dann werd ich geflamed, dass ich so scheiße spiele. ja klar, 2 v 1 das ganze game. was soll die scheiße wirklich? bin so angepisst. und ich weiß genau, dass der **** shaco keinen ban oder iwas bekommt. und dann wundert sich rito wenn man sauer wird.","replies":[{"poster":"eingew","date":"2019-01-26T07:46:28.830+0000","up_votes":1,"down_votes":0,"body":"Wenn er dich trashtalked brauchst du ihn doch bloß zu melden, das klingt jetzt für mich jedenfalls so, als hätte der Spieler klar eine Grenze überschritten. Hast du dir die Logs hier im Forum mal durchgelesen? Klang das ähnlich wie der Shaco? Dann kannst du dich beruhigt zeigen denke ich.\n\nUnd so als allgemeiner Tipp für deine seelische Gesundheit: Scheu dich nicht den Mutebutton zu benutzen, es ist keine Schande, sinnlosen Spam aus seinem Chatfenster zu verbannen. Außerdem fand ich es hilfreich, mein Mindset zu ändern: Jede Schwierigkeit, auch die der Sabotage, ist nur eine härtere Trainingseinheit und wenn ich sie dieses Mal nicht schaffe, dann wappnet sie mich zumindest für andere schwierige Situationen.","replies":[{"poster":"Icebergslasher","date":"2019-01-27T10:29:22.034+0000","up_votes":2,"down_votes":0,"body":"das ist ein guter ansatz! werd mich beim nächsten mal dran zurückerinnern.","replies":[]}]}]},{"poster":"eingew","date":"2019-01-25T08:26:34.245+0000","up_votes":1,"down_votes":0,"body":"Du spielst nicht mehr, aber findest die 10 Einstufungsspiele kacke? Was denn jetzt? Eingestuft bist du übrigens erst nach 10 Spielen. Du kannst da keine Wunder erwarten, niemand kann deinen Skill erahnen.","replies":[{"poster":"Qbert","date":"2019-01-25T10:32:07.289+0000","up_votes":1,"down_votes":0,"body":"was hältst du davon, wenn jeder seine Elo frei wählen dürfte? Die Spreu trennt sich ja schnell vom Weizen, egal ob nach oben oder unten ... ^^","replies":[{"poster":"Revilous","date":"2019-01-26T08:04:36.381+0000","up_votes":2,"down_votes":0,"body":"Dann wählt jeder diamond aus. Die, die nicht in Dia gehören feeden und haben keinen Spaß und die die in Dia gehören spielen nur mit Feedern und haben keinen Spaß.","replies":[]},{"poster":"eingew","date":"2019-01-26T07:44:31.050+0000","up_votes":1,"down_votes":0,"body":"Oder man wählt einfach Gold+ aus, spielt 1/2 Mal die Season über und kriegt einen kostenlosen Skin, völlig egal, ob man tatsächlich Gold ist. Sorry, aber das klingt für mich mehr nach legalem Boosting als einer vernünftigen Methode, Spieler einzuteilen. Wenn man das macht, dann sollte man denke ich die wählbare Elo auf die Silberdivisionen beschränken. Aber auch dann entzieht sich mir der Sinn. Da wäre es logischer, bei den ersten Placements die Elo aus den Normalgames in die Berechnung einfließen zu lassen.","replies":[]},{"poster":"Veezey","date":"2019-01-25T14:55:07.706+0000","up_votes":1,"down_votes":0,"body":"Dann würde ich einfach die niedrigste Elo nehmen xD","replies":[]}]}]},{"poster":"Reboot Geostorm","date":"2019-01-25T11:37:22.216+0000","up_votes":2,"down_votes":0,"body":"Ich beginne heute Abend damit.  Die neue Klasse Grandmaster gillt anzustreben. \n\nFür mich ein ganz klarer plan:   Yi oder Wukong werd ich spammen in der Midlane und natürlich 9 Mutes im Spiel.  \n\nSo climpe ich am besten!\n\n\nWie immer gilt :\n\nImmer schön den Baron warden! ","replies":[]},{"poster":"German Bird","date":"2019-01-24T23:10:12.334+0000","up_votes":1,"down_votes":0,"body":"Also mate,\nErst mal entschuldige ich mich für meine Rechtschreibung hab echt keinen Bock darauf jetzt zu achten. Um es simpel auszudrücken die Placement games SIND gut \"gebalanced\" wenn du vernünftig ablieferst auch wenn dein team scheise ist bekommst du einen vernünftigen Rang. Lieferst du aber scheise ab bekommst du nen lowen rang und falls du jetzt denkst dass du ja angeblich nicht in die elo gehörst hier eine Faust regel: wenn du nicht in 9/10 games gefeedet bist gehörst irgendwo in die elo manchmal mehr manchmal weniger ansonsten climbst du da sehr schnell raus. Ich hab mir jetzt mal die Mühe gemacht und deinen Acc betrachtet und ich kann dir versichern, dass nicht riot das Problem ist sondern du... und dein Kumpel scheint dann anscheinend einfach besser zu sein. League ist halt ein sehr schweres game und ja ab und zu gibt es zu starke champs aber man kann alles countern bzw. dagegen gewinnen außer der gute alte ap galio in season 8 der war OP XD. Hoffe mal du gibst nicht zu schnell auf ansonsten geb ich dir gerne auch mal par tipps ^^\n\nLG JápS","replies":[]}]}