{"poster":"Izayui","date":"2016-03-13T11:16:21.182+0000","title":"Verbindungsverlust bei Spielen...","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Hey Leute,\nich habe in meinen letzten Spielen so einige kleinere und gr&ouml;&szlig;ere Probleme mit der Verbindung gehabt, wobei ich fast schon zu 100% ausschlie&szlig;en kann dass sie an mir liegen...\nIch habe eine Winserie von vlt. 12 Spielen gehabt (dadurch ist der &Auml;rger umso h&ouml;her) doch ab den Promotion-Games fing der Spa&szlig; an.\n(diese kleineren Probleme zwar schon vorher aber seit 2 Tagen ist es extrem hart so zu spielen)\n\nImmer wieder (so ab 10 Minuten) verliere ich die Connection und manchmal nach 3 Sekunden aber manchmal erst nach 1/2 Min baut sie sich wieder auf.\nAn meiner Latenzzeit kann es nicht liegen - in keinem anderen Game habe ich solche Probleme und mein Ping ist IMMER im Bereich zwischen 25 und 40.\nDesweiteren verstehe ich nicht wie solche direkten &quot;Kicks&quot; zustande kommen - es gibt gnug Leute die durch wei&szlig; der liebe Gott was (downloads oder weitere Nutzer vom Internet) einen Ping in h&ouml;he von 700 und mehr bekommen und NICHT &quot;gekickt&quot; werden.\nDas gr&ouml;&szlig;te Problem daran ist jedoch dass man anschlie&szlig;end f&uuml;r das komplette Spiel verantwortlich gemacht wird und noch reports bekommt (wenn man verliert).\n\n**_Ich w&ouml;llte nun gerne wissen woran das liegt (ich kenne weitere Spieler die das selbe Problem haben) und wie man es l&ouml;sen kann..._**\nEs ist schon &auml;rgerlich dass man wegen sowas seine Serie verliert und damit auch die Chance verliert eine Division zu &uuml;bersringen bzw. die Promotions zu gewinnen...\n\nund wie gesagt das Problem tritt NUR bei LoL auf - sonst nirgends\n\nAchso bevor ich es vergesse - ich habe Verbindungstests und dergleichen mehrmals täglich ausgeführt und bekomme immer eine Latenzzeit wie ichs oben schon gesagt hatte - zwischen 25 und 40ms zu jeder Tageszeit (Morgen , Mittag , Abend , Nacht) und ich spiele NICHT über W-Lan sondern über **direkte Lan-Verbindung**","replies":[{"poster":"legofreak1","date":"2016-03-14T14:54:14.606+0000","up_votes":1,"down_votes":0,"body":"Kannst du bitte Pingplotter im Hintergrund eines Spiels mit Problemen laufen lassen?\n\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> https://www.pingplotter.com/download.html\n> Um ein Log zu erstellen, ladet das Programm bitte runter und stellt es dann folgendermaßen ein:\n> * Trace Interval: 1 second\n> * Focus Time: all\n> * Target Name: 185.40.65.1\n>\n> Startet das Programm dann über den grünen Button oben links und lasst es laufen, während ihr im Spiel seid.\n> Wenn während des Spiels Probleme aufgetreten sind, ist das Log verwertbar und kann folgendermaßen im Forum geteilt werden:\n> * Edit -> Copy as Text\n> * Geht nach [Pastebin.com](http://Pastebin.com)\n> * Fügt das kopierte Log unter \"New Paste\" ein und klickt auf \"Create new Paste\"\n> * Kopiert den Link zum Log auf Pastebin aus der Adressleiste und fügt diesen in euren Forenpost ein.\n>\n> Fügt bitte außerdem das [Netlog](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/X3waeihA-wrenchmens-toolbox-lasungen-zu-bekannten-problemen-und-fehlern?comment=0000) dieses Spiels ein.","replies":[]}]}