{"poster":"HDaniel","date":"2015-06-19T08:58:30.880+0000","title":"A \"pl kid\" flamerek és társaik","subforum":"Általános beszélgetés","up_votes":2,"down_votes":1,"body":"Szerintem k&uuml;l&ouml;n kellene l&eacute;trehozni egy &quot;rasszizmus&quot; kateg&oacute;ri&aacute;t ahol reportolni lehet. Nagyon unalmas m&aacute;r a sok &aacute;rja 10 &eacute;ves, akik azt hiszik, ha egy hal&aacute;llal t&ouml;bbem van mint nekik, vagy b&aacute;rkinek, akkor mindenki lengyel. &Eacute;s ha az lenne? Nem rosszabbak mint m&aacute;s j&aacute;t&eacute;kosok.","replies":[{"poster":"Tetth","date":"2015-06-19T09:35:21.565+0000","up_votes":1,"down_votes":0,"body":"Igazság az hogy de, százalékban igen. Ez nem rasszizmus, ez sztereotípia, bár itt már nehéz dönteni. Én sem szeretem a lengyelezést ne legyen félreértés, de ez még a sértegetés kategóriába is mehet, nem kell új dolog. Ha valaki aggresszív flamer azt meg nyugodtan magyarozhatják. Rasszizmus vagy sztereotípia? :P","replies":[{"poster":"S T U K I","date":"2015-06-19T18:19:34.230+0000","up_votes":1,"down_votes":0,"body":"Westen a franciákat éri ugyan ez a csapás sajna. És a \"vicc\" az hogy tényleg olyanok mint easten a lengyelek. Csak westen nem a \"kto polak\" megy hanem \"tg france dog\" :D","replies":[]}]},{"poster":"Raisen94","date":"2015-06-19T12:44:42.774+0000","up_votes":1,"down_votes":0,"body":"Szerintem a legjobb amit tehetsz az a tiltás és report. Normál módban én nem is figyelem a chatet és nem is nagyon érdekel ki mit ír, vagy pickel az a funolásnak van és gyakorlásnak elég baj, ha ott valaki flamel veri eleget az élet, ha így viselkedik.\nRankeden teljessen más dolog, én ott mindenkinek 1 esélyt adok akárkit szidnak legyen all chat vagy csapaton belűl auto tiltom.\nEnnek több előnye is van, nem tereli el a figyelmed és rankeden minden perc fontos, az írás helyett inkább a játékra fókuszálsz, rage alatti játékos észre veszi nem válaszolsz és rájön, hogy onnantól csak pingel fog neked tudni jelezni, ha valamire szüksége van, \"álltalában az ilyenek nem szokták használni\" , megtanulja használni az írogatás helyett legközelebb előre jelezze mit szeretne.\nMindenkinek ajánlom ezt a módszert 1 kattal meg lehet oldalni és megkíméled magad az egész meccsre, ezért ne csak azokat szelektáld akik neked szólnak, mert ahogyan viselkedik akár te is lehetnél a vita tárgya. \nIlletve ne is írd mute listádra raktad vagy reportolod, mert lehúzza mégjobban a \"csapat szellemet\" és a nyerés felé nem ez az út vezet.","replies":[]}]}