{"poster":"HitLikeKnockback","date":"2017-08-27T15:20:49.893+0000","title":"Welchen midlaner soll ich in bronze zum climben benutzen?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey ich h&auml;nge in bronze 3 fest ich wollt wissen welchen midlaner ich benutzen soll zum climben","replies":[{"poster":"Aseryo Hasagi","date":"2017-08-27T16:37:23.199+0000","up_votes":1,"down_votes":1,"body":"annie vladimir, stumpf aber op, wenn du bissl mechaniken draufhast wäre leblanc auch sehr gut zum climben","replies":[{"poster":"Dreadlord Mike","date":"2017-08-27T20:54:32.532+0000","up_votes":2,"down_votes":0,"body":"Vladimir ist jetzt nicht der einfachste champ und Lb einem Bronzespieler zu empfehlen halte ich auch nicht für besonders weise.","replies":[]}]},{"poster":"ELOW Cronos","date":"2017-08-28T06:47:36.011+0000","up_votes":1,"down_votes":0,"body":"Kurz gesagt: Nimm nem möglichst einfachen AP Champ, der CC und nen Haufen DMG mitbringt.\n\nIch würde dir folgende Kandidaten empfehlen: \n{{champion:1}} , {{champion:45}} , {{champion:99}}.","replies":[{"poster":"NoSwagNoKill","date":"2017-08-29T12:03:59.496+0000","up_votes":1,"down_votes":1,"body":"Die sind alle relativ Gankanfällig. Ist denke ich da keine so eine gute Idee.","replies":[{"poster":"IncStrike","date":"2017-08-31T04:35:10.734+0000","up_votes":1,"down_votes":0,"body":"Doofe Aussage einfach den Nachteil zu nennen und zu sagen das sie deswegen eine schlechte Wahl sind. Alle Helden haben klare Nachteile, was sie aber in Mobilität einbüßen machen sie mit Reichweite und CC wieder gut.\n\nAlle 3 sind TOP, sie sind einfach, sie haben CC und sie machen Schaden ohne das du viel Meschanich verstehen musst.","replies":[]}]}]},{"poster":"Angel Ayume","date":"2017-08-30T23:31:24.171+0000","up_votes":1,"down_votes":0,"body":"Also ich hab Ahri zum climben gespielt. Sie is sehr mobil, hat CC und macht viel Dmg. \nAllerdings muss man sie schon gut können um erfolgreich zu sein. Der CC sowie der Hauptdmgspell sind beides Skillshots.","replies":[]},{"poster":"TheFoxRox","date":"2017-08-28T05:10:38.476+0000","up_votes":1,"down_votes":0,"body":"Ich empfehle eindeutig Lux. Einfach für farmen und nach deiner Q kannst du ne Menge Schaden aus der Distanz machen. Die Ult hat zudem nen geringen cooldown. Und in Bronze kann man Lux auch ez als supp spielen.","replies":[]},{"poster":"Dreadlord Mike","date":"2017-08-27T21:00:30.805+0000","up_votes":1,"down_votes":0,"body":"Erster Tipp den ich dir geben würde ist spiel bitte weniger Champions du hindert dich nur selbst dabei.\nSuch dir maximal 3 pro lane aus und spiele die auf deinen lanes.\nIch würde stark von Champions wie Yasuo, ahri und weiteren Assasins abraten da die viel zu schwer für einen Anfänger sind.\nGenauso sind champs wie taliyah xerath ecc abzuraten.\n\nWenn du Midlane wirklich spielen willst sind diese 2 champs gut für dich : Lux, Annie \nLeichtes kit und leichte mechanics die du nomalerweise nach einigen Spielen schon draufhaben solltest.","replies":[]},{"poster":"RM Heartmeander","date":"2017-08-27T15:41:53.794+0000","up_votes":1,"down_votes":0,"body":"Den, den du am besten kannst.\nDa du Ahri usw. nicht kannst laut op.gg solltest du sie vielleicht erst üben.\nEs bringt nicht's dir einen Champion zu nennen, mit dem du dann in's Renked stürmst, du musst ihn zu erst üben.","replies":[{"poster":"HitLikeKnockback","date":"2017-08-27T16:12:46.860+0000","up_votes":1,"down_votes":1,"body":"Ja ich übe sie emoment und habe eben im ranked mit ihr mein team gecarryt\nDanke für deine Hilfe","replies":[{"poster":"RM Heartmeander","date":"2017-08-27T18:27:55.228+0000","up_votes":1,"down_votes":0,"body":"Wenn du sie übst, solltest du sie aber nicht im Ranked spielen.\nRanked ist nicht da um etwas zu üben.\nDu hast mit ihr von 22 Spielen nur 1/3 gewonnen was etwa 7 Spiele sind.\n\nSuch dir einen mechanisch weniger anspruchsvollen Champ wie Annie.\nDamit kommt man auch leichter rauf wie schon geschrieben da nicht so viele Fehler gemacht werden können.","replies":[]}]},{"poster":"HitLikeKnockback","date":"2017-08-27T16:12:15.994+0000","up_votes":1,"down_votes":1,"body":"Ja ich übe sie emoment und habe eben im ranked mit ihr mein team gecarryt","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2017-08-27T18:10:07.391+0000","up_votes":1,"down_votes":0,"body":"Den ersten Tipp, den man normaler Weise als Bronze Spieler bekommt, ist: Spiele Annie. Und ja, ich spreche da aus Erfahrung, der Spruch ist so alt wie das Ranked System...\n\nDas Problem ist halt: In Bronze musst du noch ganz viele Grundlagen lernen. Sowohl mechanisch als auch taktisch. Nehmen wir einfach mal das Last Hitten von Minions: Bei kaum einen Champion ist das so einfach wie mit Annie. Du verwendest einfach permanent dein Q zum Farmen und kriegst dann dein Mana zurück. Und wenn du das 20 Mal gemacht hast, hast du so viel Gold verdient, als wenn du einen Champion getötet hast.\n\nUnd deine Outplay Combo ist halt so stumpf... Selbst ich konnte damals schon Flash Tibbers landen.\n\nWenn du dagegen mal drüber nachdenkst, wie viele du mit einem Zed im All In verkehrt machen kannst. Was du bei einer Taliyah alles bedenken musst... Wie hart Yasuo generft worden ist...\n\nUnd wenn du dein Kit wirklich beherrscht, fällt es dir dann auch wesentlich leichter auf dein Umfeld zu achten. Und dann überrascht dich das Spiel nicht mehr so häufig, was unfassbar hilfreich ist.","replies":[]},{"poster":"UltimateGPower","date":"2017-08-27T16:10:27.486+0000","up_votes":1,"down_votes":0,"body":"ANNIE","replies":[]},{"poster":"XExEcUtOrX04","date":"2017-08-27T15:27:08.392+0000","up_votes":1,"down_votes":0,"body":"Einen den du spielen möchtest und am besten auch nicht Dauerban ist, bringt nichts dir hier was vorzuschlagen und dabei magst du den Champ nicht.\nTipp: Such dir einen oder zwei Champs aus die du ausgiebig spielen möchtest und spiele dann auch nur diese Champs.","replies":[]},{"poster":"OSaftKiller","date":"2017-08-27T21:05:43.856+0000","up_votes":1,"down_votes":2,"body":"Anivia wenn du das early Lasthiten drauf hast, kannst mit der extrem gut verhindern das die Gegner pushen können. Gewinnst dann alleine dadurch das die Gegner das Game nicht beenden können. :D","replies":[]}]}