{"poster":"darkrage9","date":"2019-10-22T09:54:34.413+0000","title":"Monitor","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":2,"body":"Hi,\r\n\r\nhabe hier nen angebot für einen LG 34UC89G Monitor für 350€ und wollte mal fragen was ihr von dem haltet? Lohnt sich das Geld eurer Meinung nach?\r\nDer Monitor hat G-Sync, 144hz(oc auf 166hz) und ein IPS-Panel. Hört sich so weit für mich sehr gut an.\r\nNun meine Bedenken sind, dass der Monitor bei 34 Zoll \"nur\" eine auflösung von 2560x1080 hat... Habe jetzt öfter gelesen das das zu niedrig sei für die größe andere wiederum meinen das sei vollkommen ausreichend. \r\nIch denke halt mal das ich für den Preis nicht unbedingt was besseres bekomme? Hilfe^^\r\n\r\nLg","replies":[{"poster":"Necromant","date":"2019-10-22T09:59:38.791+0000","up_votes":3,"down_votes":1,"body":"Ich hab einen 4k Monitor als Second. Second mittlerweile, weil ich die 4K nur zum Filme/Video-Edditing nutze. Ansonsten reicht mir mein 2k fürs zocken dicke zu. Musst ja auch sehen, das dein PC mehr zu tun hat umso höher die Auflösung und umso mehr schneller die Bildwiederholung","replies":[{"poster":"darkrage9","date":"2019-10-22T11:04:02.452+0000","up_votes":1,"down_votes":1,"body":"Danke für deine Antwort. Ist der Unterschied zwischen 2560x1080 und 2560x1440 denn sehr hoch? Habe bis jetzt immer nur  mit 1920x1080 (24zoll) gespielt und kenne mich damit leider nicht so aus und weiß daher nicht, ob sich das lohnt.\nMeinst du der oben genannte Bildschirm taugt was? \n\nWarum man hier down voted wird weil man ne Frage stellt versteh ich auch nicht so ganz xD\nFand das Angebot preislich gesehen halt ziemlich verlockend und wollte mich vorher lieber noch einmal informieren.","replies":[{"poster":"Necromant","date":"2019-10-22T11:59:09.196+0000","up_votes":2,"down_votes":1,"body":"Ist halt auch Ultra-Wide, daher das andere Seitenverhältnis.\nNormalerweise  wäre es sonst 2560x1440px. \nIst aber tbh nicht schlimm.\n\nDer Monitor an sich ist ganz fein, musst nur bedenken das du für das \"curved\" sehr viel hinlegst bzw. die sich für das gut bezahlen lassen.\n\nEDIT: WAIT\nDer hat nur n  HDMI input? Sind die deppert? holy ...\nich würde bei ner Auflösung von mehr als 2K &amp; mehr als 60Hz immer nach DisplayPort(DP) schauen.\nHDMI unterstützt erst bei den neusten Generationen diese Auflösung bzw. Wiederholungsrate. Displayport hingegen ist genau für sowas ausgelegt.","replies":[{"poster":"Alustus","date":"2019-10-22T23:04:56.979+0000","up_votes":1,"down_votes":0,"body":"Naja die Unterschiede zwischen DP und HDMI liegen nicht in der unterstützung der Auflösung.\nSowohl alte DP als auch HDMI Versionen sind bei hoher Aflösung nicht zu empfehlen, und sowohl neue HDMI als auch DP Versionen haben keinerlei probleme damit.\n\nDP ist aber mMn zukunftsicherer (keine Lizenzgebühren für Hersteller, wesshalb diese gerne darauf zurückgreifen)\nUnd generell ist DP weniger Störungsanfällig und hat ein paar andere kleinere Vorteile. \n\nEs ist aber nicht so das HDMI schwachsinn ist und/oder man davon abraten sollte.","replies":[{"poster":"Necromant","date":"2019-10-23T06:25:56.022+0000","up_votes":1,"down_votes":0,"body":"Danke für die Erklärung :)","replies":[]}]},{"poster":"darkrage9","date":"2019-10-22T12:29:20.504+0000","up_votes":1,"down_votes":1,"body":"Danke für die Antwort :)\nSo weit ich das gesehen habe hat der auch Display Port bzw. ist auch ein Display Port Kabel dabei. Mich spricht gerade das größere Seitenverhältnis an.\nAlso solange er Display Port hat ist er in Ordnung ansonsten eher nicht? Ich denke mal ich werd ihn mal ausprobieren. Vielen Dank für die Auskunft :)","replies":[{"poster":"Necromant","date":"2019-10-22T12:33:37.383+0000","up_votes":1,"down_votes":1,"body":"Wenn er DP hat, ist alles fein :)","replies":[]}]}]}]}]},{"poster":"Alustus","date":"2019-10-22T23:19:28.445+0000","up_votes":1,"down_votes":0,"body":"Naja die Auflösung ist nicht so toll. (aber auch nicht schlecht)\nEs kommt natürlich darauf an wie weit du vom Display entfernt sitzt und welchen wert du persöhnlich auf die AUflösung legst.\n\nAm besten wäre es wenn du in einem Elektomarkt ähnliche Bildschirme anschaust ( am besten mit deiner Sitzdistanz)\n\n\nIch persönlich würde nicht extra fürs IPS Panel zahlen wenn dann die Auflösung nicht so gut ist, aber wie schon gesagt das ist immer sehr individuell vom Sitzplatz abhängig und natürlich auch von den persöhnlichen Präferenzen, wesshalb du dir selber davon ein Bild machen solltest und daraufhin selber entscheidest.","replies":[]}]}