{"poster":"LeonardoSB","date":"2018-03-08T12:49:54.184+0000","title":"[Guia] Thresh El Carcelero Implacable","subforum":"Guias y consejos","up_votes":17,"down_votes":2,"body":"Bienvenidos invocadores, en esta ocasi&oacute;n vengo a traerles una guia de Thresh, para ver si no omito ningun conocimiento que tengo y hago una guia correcta, sin errores, y con lo fundamental para cualquier persona que quiera aprender a usarlo, o a masterizarlo un poco mas.\n\ncomo es mi primera guia me gustar&iacute;a decirles que si tienen algun dato que me haya pasado por encima, me lo digan en comentarios, y si veo que contribuye en la guia la editar&eacute; y dejar&eacute; su respectivo nombre de invocador en el edit del mismo.\n\nQuisiera empezar diciendo las habilidades del campe&oacute;n, que si bien puede parecer informaci&oacute;n vanal, &eacute;sto no es del todo cierto, puesto que muchas veces omitimos las descripciones.\n\nhttps://ddragon.leagueoflegends.com/cdn/8.5.2/img/passive/Thresh_Passive.png \nCondenaci&oacute;n\nThresh puede cosechar las almas de los enemigos que mueren cerca de &eacute;l. Al hacerlo, obtiene permanentemente Armadura y Poder de Habilidad.\n\nhttps://ddragon.leagueoflegends.com/cdn/8.5.2/img/spell/ThreshQ.png\nSentencia de Muerte\n**Costo**: 80 de Man&aacute;\n**Alcance**: 1075\n**Enfriamiento**: 20 / 18 / 16 / 14 / 12\n\nThresh atrapa a un enemigo con sus cadenas y lo atrae hacia &eacute;l. Si se activa esta habilidad una segunda vez, Thresh se lanza hacia el enemigo.\n\nThresh lanza la guada&ntilde;a, causa 80/120/160/200/240 (+50% Poder de Habilidad) de da&ntilde;o m&aacute;gico y aturde a la primera unidad que alcance, le otorga Visi&oacute;n Verdadera de ella y la atrae hacia s&iacute; durante 1.5 segundo(s).Al reactivar esta habilidad, Thresh se lanzar&aacute; hacia el enemigo afectado.El enfriamiento de Sentencia de Muerte se reduce 3 segundo(s) si alcanza a un enemigo.\n\nhttps://ddragon.leagueoflegends.com/cdn/8.5.2/img/spell/ThreshW.png\nPasaje Oscuro\n**Costo**: 50/55/60/65/70 de Man&aacute;\n**Alcance**: 950\n**Enfriamiento**: 22 / 20.5 / 19 / 17.5 / 16\n\nThresh lanza una linterna que protege del da&ntilde;o a los campeones aliados cercanos. Los aliados pueden hacer clic en la linterna para desplazarse r&aacute;pidamente hacia Thresh.\n\nThresh lanza la linterna a una ubicaci&oacute;n objetivo. Si un aliado hace clic sobre ella, Thresh podr&aacute; atraer a ambos hacia &eacute;l.La linterna otorga un escudo que dura 4 segundo(s) y absorbe hasta 60/100/140/180/220 (+0) de da&ntilde;o para Thresh y hasta un aliado cercano. La cantidad de protecci&oacute;n aumenta con el n&uacute;mero de almas que recolecte Thresh.\n\nhttps://ddragon.leagueoflegends.com/cdn/8.5.2/img/spell/ThreshE.png\nDespellejar\n**Costo**: 60/65/70/75/80 de Man&aacute;\n**Alcance**: 500\n**Enfriamiento**: 9 segundos\n\nLos ataques de Thresh se detienen, infligiendo m&aacute;s da&ntilde;o cuanto m&aacute;s tiempo espere entre ataques. Al activarla, Thresh barre la zona con sus cadenas y derriba a todos los enemigos impactados en la direcci&oacute;n del golpe.\n\nPasiva: Los ataques b&aacute;sicos de Thresh causan de 0 hasta 0 (+0) da&ntilde;o m&aacute;gico adicional, el cual aumenta si no ataca (hasta almas recolectadas m&aacute;s un 80/110/140/170/200% del total de su Da&ntilde;o de Ataque).\nActiva: Causa 65/95/125/155/185 (+40% Poder de Habilidad) de da&ntilde;o m&aacute;gico en una l&iacute;nea que comienza detr&aacute;s de Thresh. Los enemigos alcanzados se ven empujados hacia la direcci&oacute;n del golpe y quedan ralentizados un 20/25/30/35/40% durante 1 segundo(s).L&aacute;nzalo hacia adelante para empujar y hacia atr&aacute;s para atraer.\n\nhttps://ddragon.leagueoflegends.com/cdn/8.5.2/img/spell/ThreshRPenta.png\nLa Caja\n**Costo**: 100 de Man&aacute;\n**Alcance**: 450\n**Enfriamiento**: 140 / 120 / 100\nUna prisi&oacute;n de muros que ralentizan e infligen da&ntilde;o al romperlos.\n\nThresh crea una prisi&oacute;n de muros espectrales a su alrededor. Los campeones enemigos que atraviesen un muro sufrir&aacute;n 250/400/550 (+100% Poder de Habilidad) de da&ntilde;o m&aacute;gico y se ver&aacute;n ralentizados un 99% durante 2 segundo(s), pero romper&aacute;n ese muro. Tras romperse un muro, el resto de los muros no infligir&aacute; m&aacute;s da&ntilde;o y la ralentizaci&oacute;n durar&aacute; la mitad. Un enemigo no podr&aacute; sufrir los efectos de varios muros a la vez.\n\nHasta aqu&iacute; los detalles de sus habilidades.\n--------\n\nBueno Empecemos con la guia de verdad :P, con thresh soy de optar por las siguientes runas:\n\nhttps://puu.sh/zDakl/0f5e5d5e93.png\n\nExplicar&eacute; paso a paso debido al por qu&eacute; de &eacute;stas runas, asi no las copian solo por copiar (para aquellos que quieran un poco mas de explicacion)\n&iquest;Por qu&eacute; usar la rama Valor combinado con Inspiracion?\nPersonalmente a la hora de crear las maestrias, vi muchas MUCHAS combinaciones de parte de otros usuarios, que convengamos, ninguna runa est&aacute; equivocada, puesto que se modifica para el estilo de juego de cada uno, y no se debe fijar un estilo basado en opiniones ajenas, pero como esta guia es para aquellos que busquen una direcci&oacute;n a la cual ir correctamente, valor es la mas completa. tienes resistencias, puedes hacer que tu aliado se cure, te da armadura y resistencia magica (fundamentales con thresh puesto que no escala su armadura, y tener 10 es demasiado op) tenes para ganar vida por cada 8 minions que tu adc tenga o bien, con tu targon OP.\na la hora de elegir valor, es porque realmente consider&eacute; que mi estilo de juego de engagear y salir de posibles emboscadas se amoldaban demasiado con esta rama, por no hablar de si un compa&ntilde;ero no se la juega en salvarte tienes resistencias y maneras de sobrevivir :P\n\n&iquest;y por qu&eacute; inspiracion de segunda opcion?\nPorque considero que esta rama es la que mas utilidad tiene, te hace generar mucho mas oro de lo que la gente normalmente ve y bueno, ese cronorreloj, esas botas, ese mercado del futuro op, etc.\n\ncomo ver&aacute;n en la anterior mi opcion casi siempre es llevar las botas obligatoriamente, no solo te ahorras el ir a base a gastar 300 de oro por movilidad, sino que si te va bien en una partida puedes roamear lo antes posible y hacer un snowball por ti mismo.\nla opcion de Percepci&oacute;n C&oacute;smica la vario dependiendo de la partida, es o percepci&oacute;n cosmica o bien mercado del futuro, todo depende a que minuto de la partida apunto, pero como generalmente las partidas tienden a alargarse esta es la mejor opcion.\n\nahora veamos por qué de cada runa en especifico.\n\nRéplica lo elegi porque bueno, ese daño extra a la hora de hacer un engage es significativamente decente para un trade.\n\nFuente de vida: debido a que cuando estas en el tradeo de daño puedes hacer que tu adc se cure, una porcion minima, pero curacion al fin y al cabo, que por mas que parezca poco es una diferencia en el intercambio.\n\nAcondicionamiento: bueno como ya lo voy a decir en la guia mil veces, al llegar al minuto 10 ganamos este extra de defensa fisica y magica, y ya que es la mejor opcion a la larga, y puesto que una partida dura mas de 10 minutos, considero que es la mejor opción.\n\nCrecimiento excesivo: si te toca un adc que es bueno farmeando, te sale rentable, y sino realmente vas a tener que esperar a late, porque cuando vayas pasando por al lado de todos y los minions mueran, vos ganarás mucha vida y por ende te volverás pasivamente un tank en algun punto de a partida.\n\nCalzado magico, esto es para ahorrarse esos 300 de oros en viajar a la tienda (creo que lo explique mas arriba)  a comprarlos, puedes tener media bota de movilidad hecha basicamente o bien puedes comprarte otros items como una armadura de tela.\n\nPercepción Cósmica: esto para mi es la 2da maestria mas OP del juego, te da 5% de reducción de enfriamiento en las habilidades, +5% de reduccion de enfriamiento + 5% Reducción de enfriamiento en activas y +5% de reduccion de enfriamiento de hechizos, es simplemente op, estamos hablando de que tus atributos maximos serán 45% de reduccion de enfriamiento general (arrancando con 5) eso es casi la mitad de cd, y nuestra Q en nivel maximo la vamos a poder spamear si la pegamos.\n\n\ny hasta aqu&iacute; la explicaci&oacute;n de las runas, obviamente no son definitivas, pueden cambiarse, pero a mi parecer son las mejores opcion de cada rama.\n--------\n\npasemos a Builds, Construcci&oacute;n de Objetos.\n\nveamos, esto es muy...situacional la verdad, podria decirles que comprar todos los objetos esta bien y est&aacute; mal, ninguna guia es acertada a la hora de elegir objetos para buildearse, puesto que cada partida es diferente, cada enemigo juega distinto y cada aliado tiene diferentes errores y virtudes.\n\nPERO, digamos que hay ciertos items que por mas que vayas bien o mal, salgas bien o mal de linea, seguir&aacute;n siendo funcional y seguir&aacute; sirviendo a tu equipo, si juegas bien thresh, puedes hasta carrear partidas con ellos, y no...no es broma.\n\nlos objetos que yo considero que son core para alguien que empieza y no tiene un concepto de todos los objetos existentes en la tienda (como para amoldar su construcci&oacute;n de objetos dependiendo la situacion) es la siguiente:\n{{item:3190}} {{item:3117}} {{item:3401}}  {{item:3075}} {{item:3800}} {{item:3194}} \n\ncon estos items yo creo que tenes un poco de todo, vida, resistencia fisica, magica, un chase increible y vision.\n\ncreo que ya es obvio saber para qu&eacute; sirve cada item, pero lo voy a explicar igual porque por ah&iacute; doy por obvio algo que no es tanto :P.\n\n\n\n{{item:3190}} : Claramente el item por excelencia de soporte, creo que para thresh viene genial, incluso si no es un item muy necesario en la mayoria de los soporte (por no decir que necesita alto buff) pero ya que nuestra armadura no escala, este item no solo nos da armadura sino que tambien un shield (activa) y resistencia magica. Item esencialmente enfocado a peleas de equipo (y mas cuando hay alto quilombo en medio), podemos usarlo para parar un burst (personajes con da&ntilde;o en area brutal, un deleteo a tu adc,etc), parar un engage donde pueden salir todos mal heridos, principalmente para que no seamos todos papelitos frente al enemigo que esta algo feed.\n\n{{item:3117}} : Item especializado para roaming, volver a linea rapidamente, map control, evadir chaseo, etc. la potencialidad de esta botas es mas que nada entrar a wardear a jungla enemiga, wardear todas sus principales zonas, y salir rapidamente, sin darle tiempo al enemigo a procesar lo que hiciste salvo que te vean hacerlas.\n\n {{item:3401}} : Item de soporte esencial para nuevos jugadores de thresh, si no sabes farmear y lasthitear los minions, este item te va a obligar a aprenderlo, el plus de vida (aunque ya no es tanto con los nerf ._.) te va a ayudar a hacer buenos tradeos en linea y hasta ayudarte a recuperar la partida.\n\n{{item:3075}} : con la nueva build de este objeto, lo hicieron ideal para muchos personajes, con vida, resistencia fisica, y devolucion de da&ntilde;o fisico como magico, la hace una muy buena opcion dentro de su build, no solamente por el hecho de que te da armadura (que si...no escala en thresh, dejemos eso en claro, lo voy a repetir las veces que sea necesaria debido a que veo siempre thresh que se arman full resistencia magica y un teemo con un doran se lo solea)\n\n{{item:3800}}: Gloria justiciera, bueno mas de lo mismo, te da armadura (que no escala con thresh) , vida, y lo grandioso de este objeto es que si en tu equipo no tienen algun tipo de iniciaci&oacute;n, puedes hacerlo tu haciendo un slow en area, y engageando con E+R al team enemigo, dejandolo ideal para que tu equipo solo se dedique a usar sus habilidades y ganar las teamfights.\n\n {{item:3194}} :Yelmo Adaptable...yo creo que de los nuevos items este es el menos popular, desconozco el motivo, es especialmente bueno con personajes que te burstean da&ntilde;o magico,  asi que puedes aguantarte esa ultimate de veigar con 1000 de ap y no morir :P. y nada m&aacute;s, si eso no te parece lo suficientemente op, tambien te da una alta cantidad de resistencia magica y vida.\n\n------------\n\nParte de Hechizos de Invocador:\n\nAca vamos a tener todo en claro que uno de los hechizos mas OBVIOS es  {{summoner:4}} , te da un escape facil e instantaneo bajo cualquier circunstancia.\n\nel problema es con el 2do hechizos y aca se dividen en 2 personas:\n\nlos Pro-Extenuaci&oacute;n y los Pro-Ignici&oacute;n.\n\nlos pro-Extenuar llevan la combinaci&oacute;n {{summoner:4}} {{summoner:3}}  y sinceramente no me parece hoy en dia que eso sirva en botlane con un thresh, o por lo menos me parece que por como juego yo (que soy un thresh mas agresivo que otra cosa) no me sirve...\nIgualmente era de jugar extenuar y veamos los atributos que nos brinda este hechizo:\n\nhttps://puu.sh/zDbh8/d70e7b1883.png\n\npara aquellos que no sepan ingl&eacute;s lo traducir&eacute;:\n\nExtenuacion: \nInvocador Nivel 4,\nARAM, Cl&aacute;sica, Tutorial\n\nExtenua un campe&oacute;n enemigo, Reduce su velocidad de movimiento en 30% y su da&ntilde;o inflingido en 40% durante 2.5 segundos.\n\nEnfriamiento 210 segundos (3 minutos y medio)\n\npara aquellos que me digan &quot;no, estas mal, tambien te reduce la armadura y resistencia magica, y velocidad de ataque&quot;\nles voy a pasar el parche el cual ocurrio el nerf a extenuar.\nhttps://puu.sh/zDbo5/e262f31343.png\n\ny por si siguen pensando que es un edit o &aacute;lguna pagina falsa aca tienen el link real :P\nhttps://las.leagueoflegends.com/es/news/game-updates/patch/notas-de-la-version-75#patch-summoner-spells\n\no bien pueden entrar al cliente y ver&aacute;n que la descripcion es la que puse arriba.\n\nbueno los Pro-Ignites llevan la combinacion de {{summoner:4}} {{summoner:14}} , claramente la ventaja de &eacute;ste es fase de lineas y tratar de dejar la botlane lo mas atras posible, dominando la linea, o bien para matar a esa loca de las bananas que es una ambulancia andante.\n\nveamos los detalles de Ignici&oacute;n.\n\nhttps://puu.sh/zDbsA/43bf66e3af.png\n\npor si no entienden ingles les traduzco:\nIncendia a un campe&oacute;n enemigo, haciendo de 70-410 de da&ntilde;o verdadero (dependiendo nivel de campe&oacute;n) a lo largo de los 5 segundos.\nBrinda vision del enemigo, y reduce los efectos de curaciones sobre &eacute;l durante la duraci&oacute;n\n\naca hay algo que no se sabe verdaderamente cuanto es, pero algunos dicen que reduce el 50% de las curaciones, otros un 30%, otros un 70%, la verdad que poco importa, el tema es que reduce las curaciones y puedes matar a un champ con ignicion aunque tenga una soraka al lado.\n\naqui cada uno elija lo que mejor le parezca y bueno, lo normal es elegir extenuar si no estas acostumbrado, para hacerle un extra peel a tu adc.\n\n\n------------\n\nBueno pasemos a Fase de lineas y peleas de equipos.\n\nEsto es complicado les voy a decir la verdad, como main soporte, thresh siendo mi favorito en 3 cuentas, y aun no descubro la funcion de fase de lineas en general.\n\nsupongo que todo depende de tu adc, si quiere jugar agresivo o pasivo, si te tiene fe o no, si la linea enemiga no es mejor que la tuya, etc.\n\nel unico consejo que te puedo dar, es que no gastes mana en una habilidad salvo que: ganes el tradeo (le saques un flash, la mitad de la vida al adc enemigo, extenuar al soporte enemigo y que encima de eso no mueras y quedes con la misma vida que el adc) o bien, asesines a tu objetivo.\nbueno eso y que en caso de no animarte a hacer jugadas tan arriesgadas juega lejos de tu adc y tirale una linterna si ves que se metio en una pelea perdida xD.\n\npara las peleas de equipo sucede otra cosa, muy diferente a los que todos piensan puedes hacer muchas cosas diferentes, tu opcion mas est&aacute;ndar es proteger a tu adc a cualquier precio, pero que ese precio no sea tu vida, de poco sirve que te la jueges por tu adc si encima que das oro tu equipo no logr&oacute; nada con tu muerte, es mejor protejerlo sin morir.\ntrata de ir con el grupo mas grande de personas alrededor del mapa, por ejemplo si vos ves que top y mid van hacia baron, y el jungla y adc van a dragon, fijate cual es tu mejor opcion, cuanto da&ntilde;o tiene el top y mid, si te podes tanquear baron, de caso contrario anda a dragon.\npero si tu top, mid y jungla estan en medio y tu adc en top, quedate en medio...si tu adc se muere no es culpa tuya , es culpa de &eacute;l por overextender, no te mortifiques demasiado por ello.\n\nobviamente si tu adc est&aacute; fuera porque salieron mal de fase de lineas no lo protejas, fijate quien va &quot;carreando&quot; (esta palabra tengo todo un post para dedicarle pero en un futuro ser&aacute;) osea quien es el que mejor va y el que mas da&ntilde;o hace, si se mueve bien y dem&aacute;s, apoyalo sin ser una bacteria, wardea, usa lente revelador, etc.\n\ncomo consejo personal, thresh nunca va a decaer en una partida, incluso si sales mal de linea, sigue jugando seguro de que tu champ no es inutil, tienes ese hook y esa linterna para salvarle el pellejo a alguien, eventualmente vas a conseguir asistencias y por ende remontar en la partida.\n\n---\n\nBueno ahora la parte que para mi es pol&eacute;mica, el tema de counterpicks.\n\nyo voy a nombrar los campeones que YO considero su counterpick debido a enfrentamientos que he tenido.\n{{champion:143}}  obviamente por todo su kit de habilidades, es suficiente que tire una habilidad con bajo coste de mana para interrumpirte tu engage, y/o darte vuelta la partida, en fase de lineas es sumamente complicado y la verdad que la sufris bastante.\n\n{{champion:12}} un alistar bien jugado es capaz de contrainiciarte y ganarte los trades , por no decir que en peleas de equipo si lo juega bien te deja completamente out, a lo insect mode.\n\n{{champion:63}} este es el segundo peor en mi punto de vista, luego de zyra claramente, este peque&ntilde;o campeon de fuego hace que si inicias bien o perfectamente, tira una R y te gana la tf, gg y punto, lo ideal seria agarrarlo en una emboscada o mal parado y deletearlo.\n\ny pocos mas la verdad, si alguno tiene mas tips para este apartado que lo deje en los comentarios y los editar&eacute;, pero personalmente me parecen los top 3 mas hij** de **** para jugarles en contra.\n\n>Nacchitto (LATS)\n - 27 minutes ago\nEsta buena la guia, es basica para los que estan arrancando y precisa. Adhiero con que nunca decae y siempre tiene una utulidad, en lo personal yo lo uso para inciar y despues sacar de problemas a mi adc, a menos que vea que el no es el que carrea. Por ejemplo, si puedo matar 2 carrys enemigos dejando a mi adc tirado, lo voy a hacer, es mas rentable.\n\n---\n\neso fue todo gente, voy a esperar a ver que opinan y conforme vaya leyendolos tendr&eacute; en consideracion para la siguiente guia (si es que la tengo que rehacer bueno)\n\nSaludos\n---\n&Oslash;rbi\n\nAgradecimientos a: Salvor Hardin (enfriamiento de habilidades) y Nacchitto (otro aporte de una manera de jugar thresh), Nabuze (corrección del yelmo adaptable)","replies":[{"poster":"Not Personal","date":"2018-03-08T14:13:03.799+0000","up_votes":3,"down_votes":0,"body":"Esta buena la guia, es basica para los que estan arrancando y precisa. Adhiero con  que nunca decae y siempre tiene una utulidad, en lo personal yo lo uso para inciar y despues sacar de problemas a mi adc, a menos que vea que el no es el que carrea. Por ejemplo, si puedo matar 2 carrys enemigos dejando a mi adc tirado, lo voy a hacer, es mas rentable.\n\nPD: no estoy de acuerdo con alistar, cuando lo tenes domiando a 3sh con la E le cortas completamente el combo y lo haces intuil, lo mismo con cualquiera que tenga un salto como leona, tristana, zac, etc.","replies":[{"poster":"LeonardoSB","date":"2018-03-08T14:38:16.899+0000","up_votes":2,"down_votes":0,"body":"con respecto a lo de tenerlo dominado, yo considero lo mismo, pero me parece que a una persona que anda buscando perfeccionarse con thresh le va a costar demasiado :P aparte cuando hookeas a alguien te tira con la W y we xd","replies":[{"poster":"Not Personal","date":"2018-03-08T15:44:29.776+0000","up_votes":1,"down_votes":0,"body":"Igual, la e se puede tirar durante la q, ya sea cuando la reactivas o dejas enganchado al rival, coincido en que no es facil, pero cuando lo tenes bien automatizado, nunca quedas vulnerable a esas iniciaciones.","replies":[]}]},{"poster":"DinosaurioFumado","date":"2018-03-08T14:36:24.870+0000","up_votes":1,"down_votes":0,"body":"Se puede cancelar la e de leona con la e de thresh???","replies":[{"poster":"Not Personal","date":"2018-03-08T15:43:28.860+0000","up_votes":1,"down_votes":0,"body":"Si señor, todo lo que sea salto y no se vuelva invulnerable se puede interrumpir, otro ejemplo es la q de lee sin. El problema con leona es que tenes que estar bastante atento a la animacion pq una vez que te lo pega tenes que reaccionar MUY rapido.","replies":[]},{"poster":"LeonardoSB","date":"2018-03-08T14:37:33.442+0000","up_votes":1,"down_votes":0,"body":"sep.","replies":[]}]}]},{"poster":"MILFortune","date":"2018-03-08T14:08:24.633+0000","up_votes":3,"down_votes":0,"body":"Buen aporte. Muchos ADC han conocido la linterna gracias a tu guía. No la van a agarrar, de todos modos, porque son ADCs, pero ya saben que existe","replies":[{"poster":"LeonardoSB","date":"2018-03-08T14:10:53.330+0000","up_votes":2,"down_votes":0,"body":"la esperanza es lo ultimo que se pierde :'v","replies":[]}]},{"poster":"Nuke","date":"2018-03-08T15:09:33.539+0000","up_votes":1,"down_votes":0,"body":"Que wena guia lince, Thresh es de esos champs que están para pasar un buen rato. Lo probé con muchas runas, hasta cosecha oscura (Y mete oneshots ricos). Aunque la descripción de las habilidades me parece innecesaria, te doy +1 por dar a conocer este champ tan genial.\n\nhttps://www.youtube.com/watch?v=Px9U7y_5iEQ&feature=youtu.be","replies":[{"poster":"LeonardoSB","date":"2018-03-08T15:23:14.290+0000","up_votes":2,"down_votes":1,"body":"el tema es que no todos saben realmente las descripciones de las habilidades...\n\n y me he encontrado diamantes que no lo saben xD","replies":[{"poster":"Nabuze","date":"2018-03-08T22:16:49.414+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ørbi,realm=LAS,application-id=8sKIclmi,discussion-id=eVwTyBBE,comment-id=00030000,timestamp=2018-03-08T15:23:14.290+0000)\n>\n> el tema es que no todos saben realmente las descripciones de las habilidades...\n> \n>  y me he encontrado diamantes que no lo saben xD\n\nRelee la descripcion del yelmo por favor.\n\"Es especialmente bueno con personajes que te burstean daño magico, o daño fisico\", Deberias cambiar ese fragmento","replies":[]}]}]},{"poster":"strghtouttabush","date":"2018-03-10T00:37:59.446+0000","up_votes":1,"down_votes":0,"body":"+10 y a fav ;v","replies":[]},{"poster":"Salvor","date":"2018-03-08T13:32:49.811+0000","up_votes":1,"down_votes":0,"body":"Justo estoy trabajando en llevarlo a m7.\nVeré en que me aporta tu guía.\n+1\n\nFalta el enfriamiento de las habilidades.","replies":[{"poster":"LeonardoSB","date":"2018-03-08T13:47:39.495+0000","up_votes":1,"down_votes":0,"body":"te recomiendo jugarlo con ignite, desconozco el motivo pero lo saque facilmente a la m7 con ignite :P\n\npd: gracias por notarme lo del cd :P","replies":[]}]}]}