{"poster":"Vérontó","date":"2017-01-23T02:38:40.471+0000","title":"Kassadin","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Sziasztok. Nemr&eacute;g tal&aacute;lkoztam egy {{champion:38}} -al aki mes&eacute;lte milyen j&oacute; volt r&eacute;gen a champ, silence is volt a Q-ra.\r\n\r\n&Eacute;n is hallottam azt a legend&aacute;t, hogy kassa milyen op volt r&eacute;gen... Mikor volt Ő op? Mennyi ideig? Mikor nerfelt&eacute;k &eacute;s mennyire?\r\n\r\nK&iacute;v&aacute;ncsi vagyok a t&ouml;rt&eacute;net&eacute;re.","replies":[{"poster":"ptlg225","date":"2017-01-24T14:12:42.419+0000","up_votes":2,"down_votes":0,"body":"https://www.youtube.com/embed/xSJ4Ea1Pdyk\n\nTalán jó lesz.\nEgyébként én a mostani változatával szerettem játszani, csak jött az assassin rework és a sok manátlan, AD vagy full damage assassinnal  nem tudtam mit kezdeni.  Mert valljuk be nincs egy olyan meccs amikor nem 5-ből 3-an a \"I first mid noob go supp\"-et flamelikbe a chatbe és viszik a megszokott Kata, Zed, Yasuo hármast vagy egyéb full damage assassint midre Talon, Fizz...stb..stb.\nÉn se játszok valami régen, de tényleg megváltozott a játék régebben én is mid-eztem egy kicsit Malzahar, Lux, Kassadin és egyéb mágusokkal, mert én úgy tanultam a mágusoknak a miden a helye, de a mostani full damage assassin metaval egyszerűen nem tudtam mit tenni. Ahogy látom az assassinok véglegesen elfoglalták a midet és teljesen kiszorították onnan a mageket, most már csak azok az egy comboból kill vagy halál karakterek mennek mágusként midre mint  Syndra, Brand vagy  Velkoz.","replies":[]},{"poster":"Vasipari Béla","date":"2017-01-23T11:39:35.563+0000","up_votes":1,"down_votes":0,"body":"Még a reworkje előtt -season 4- volt bitang erős. A Q silencelt (de nem adott pajzso)t, az E jóval többet ütött, a W hasonló volt, csak egy instant burst AA helyett vagy 5 másodpercig kapott onhitet meg manalopást. Az ulti többet sebzett nagyobb volt a range és sokkal spamelhetőbb volt. Ja, és a passzívból is kapott egy rakat attack speedet.","replies":[{"poster":"Vérontó","date":"2017-01-23T12:00:26.521+0000","up_votes":1,"down_votes":0,"body":"Redmercy egyszer mondta, hogy a régi kassadin olyan, volt hogy úgy érezted az egész meccset mintha bármikor meghalhattál volna. Nagyon rossz volt ellene játszani állítólag. Most mondogatják, hogy {{champion:164}} az új Kassadin. Nagyon erős és mobilis. Ezért mert fel bennem az, hog rákérdezek milyen is volt a régi mert a mostani abszolút nem félelmetes.","replies":[{"poster":"Vasipari Béla","date":"2017-01-23T19:39:45.432+0000","up_votes":1,"down_votes":0,"body":"Camille közelében sincs a régi Kassának. 97% banrate még soloqban is","replies":[{"poster":"Vérontó","date":"2017-01-24T13:15:07.060+0000","up_votes":1,"down_votes":0,"body":"Uh azt nem tudtam, hogy Kassának akkora ban rateje volt. Camillenak most valahol 60-70% körül lehet...","replies":[]}]}]}]},{"poster":"ScreamForMeBaby","date":"2017-01-23T11:31:38.328+0000","up_votes":1,"down_votes":0,"body":"Rengeteg Kassadin nerf volt. Mint minden extrém-mobilis hős, őt sem lehet igazán balanszolni. Ha elkapja a fonalat akkor hibát hibára is halmozhat, nem lehet büntetni érte. Viszont hátrányban meg akkor sem nagyon tudsz hasznos lenni ha épp ügyesen is játszod meg a szituációt. A némítás miatt tökéletes counter volt a kombókkal dolgozó hősök ellen ({{champion:55}} , stb). Ugyanezzel a problémával küzd még elég sok hős, lásd a legújabbat : {{champion:245}} . Ha sebzést adsz neki, túl jó assasin, ha cc-t akkor pedig túl jó tank. Ezért elvették tőle inkább mindkettőt. Kassa még annyiban hasznosabb, hogy továbbra is képes ugrabugrálni és viszonylag biztonságosan játszható.","replies":[]},{"poster":"AsD The Dreamer","date":"2017-01-23T08:08:10.562+0000","up_votes":1,"down_votes":0,"body":"Volt egy olyan majd 3 másodperces silence a Q-ján (max rankon) és egy 80%-s AP scalell rendelkező ulti. Amúgy minden rankedon banolták low eloban akárcsak blitzet, amumut, shent és malphiteot.\n\n\n---\nHow can mirrors be real if our eyes aren't real?","replies":[]}]}