{"poster":"Vérontó","date":"2018-09-27T18:17:26.031+0000","title":"VB tokenek","up_votes":4,"down_votes":0,"body":"Sziasztok!\r\n&Ouml;sszesen mennyi vb tokent lehet szerezni ingyen csak a k&uuml;ldikkel?\r\nV&aacute;laszokat előre is k&ouml;sz&ouml;n&ouml;m! :)","replies":[{"poster":"Vérontó","date":"2018-09-27T22:49:32.724+0000","title":null,"up_votes":2,"down_votes":0,"body":"Összeszámoltam. Párszor átellenőrizgettem.\n**_345_**   jött ki.\nEnnyi zsetont tudsz összesen összeszedni. hát majd találjátok ki hogyan osszátok el és mit vesztek belőle.","replies":[{"poster":"Shikaichi","date":"2018-09-28T12:28:24.470+0000","title":null,"up_votes":3,"down_votes":0,"body":"Pont nem jön ki 5 token híján a 350-be kerülő keret + ikon páros, és szerintem ez éri meg legjobban, esetleg a 400-ba kerülő chromák. A gömb borzasztóan túlárazott így, hogy a tényleg biztos tartalom nagyjából ugyanennyibe kerül. Ikon, hangulatjel meg őrszemkinézet nem érdekel.","replies":[{"poster":"Vérontó","date":"2018-09-28T22:33:05.946+0000","title":null,"up_votes":1,"down_votes":0,"body":"Azt akarják, hogy áldozz rá 250 rp-t. Ingyen ők se akarnak chromát meg keretet adogatni.","replies":[{"poster":"Shikaichi","date":"2018-09-29T10:25:46.688+0000","title":null,"up_votes":3,"down_votes":0,"body":"De ez igazságtalan szerintem... Az jobb lenne, hogyha a chromát oké talán nem is, de legalább egy darab keret + ikont fel lehessen oldani, mint eddig is. Aztán aki többet akar az majd vesz tokent még.","replies":[{"poster":"Vérontó","date":"2018-09-29T14:03:03.666+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ikon 250 rp, keretnek meg nincs ára max a csomagból tudod kitalálni. Ez extra amivel pénzt tudnak keresni. Így is elég sok free contentet kapunk.","replies":[{"poster":"Shikaichi","date":"2018-09-29T15:04:51.712+0000","title":null,"up_votes":2,"down_votes":0,"body":"De az előző eventben meg eddig jellemzően mindig ki lehetett nyitni ingyen is legalább egy keretet vagy keret + ikon csomagot, és fura, hogy egy ilyen hosszú eseményen nem fogunk tudni ingyen ennyi tokent gyűjteni. Én nem azt mondom, hogy ne legyen haszon, mert persze valamiből fent kell tartani a játékot még ha ingyenes is, csak ez a rákényszerítés nem tetszik, nem a legjobb marketing fogás. Mert az ember gyűjtögeti 7 héten át a tokeneket, aztán szinte semmi komolyat nem tud kinyitni belőlük. De majd meglátjuk, még nem jelent meg minden feloldható tartalom, lehet majd más jobban megtetszik, ami talán olcsóbb, mint a Kalista keret + ikon. Nem ragaszkodom amúgy hozzá, csak eddig ezt néztem ki. Hátha lesz a Janna skinhez is ilyen, aztán vele most gyakorolok, valószínű, hogy jobban használni fogom.","replies":[{"poster":"Vérontó","date":"2018-10-01T12:14:11.424+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ikont meg wardskint tudsz kivenni.","replies":[]}]}]}]}]},{"poster":"The One ESCANOR","date":"2018-09-28T15:16:38.183+0000","title":null,"up_votes":1,"down_votes":0,"body":"Itt a VB Belépőn van a hangsúly, aki nagyot akar \"zsebelni\" az vegye meg és jól jár :D","replies":[]}]}]},{"poster":"Shirodrake","date":"2018-09-28T03:32:52.889+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én azok felé küldöm előpre is a riszpektet, akik kifarmolják a Kai'Sa skin-t.\n\nNapi 60 zsetont kell gyűjteni érte, ami 5-6 meccs átlagos teljesítménynél. \n\nLehet az ember, játszik, akár 10-15 meccset is egy nap, de ha kötelezően kell napi 5-6 meccset játszanom különben elúszik az az 1650RP akkor az már inkább kényszer, mint szórakozás. \n\nLehet mondani, hogyha nem jött össze a 2500 token, akkor veszel belőle VB gömböket.\n2500 tokenből 8 VB gömböt tudsz venni.\n1650Rp-ból (VB jegy ára) 13 ládát vehetsz. \n\nTehát ha nem a skint  akarod kifarmolni, akkor nem igazán érdemes megvenni. \n\n\nDe azért a Riot-nak is jó az üzleti érzéke ilyen szempontból, mert ha az első 5 héten a 2100 token helyett, csak 1800-at tudtál kifarmolni, akkor az utolsó héten nem biztos, hogy lesz időd, kedved napi 10 meccset játszani az 5 helyett, akkor majd nyulsza pénztárcádhoz, és RP-ért veszel még tokent.\n\nJa hogy azok önmagukban nem vehetők, csak a VB-gömbös csomagban. \nTájékoztatásul 500 Token vásárlásához 6250Rp-t kell költeni. Jó persze jár mellé még 25 VB gömb, de az még mindig zsákbamacska.\n\nSzóval ja elméletben hozzájuthatunk egy 1820Rp-s skint (+390RP a króma) 1650Rp-ből\nDe a gyakorlat szintjén tényleg csak a nagyon elvetemültek vágjanak bele.","replies":[{"poster":"The One ESCANOR","date":"2018-09-28T15:13:20.596+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lehet én vagyok a hülye de ezt a Kaisa skint egész pontosan hol lehet tokenért megvenni ? Mert ha Hextech craftba megyek a tokenre akkor az általános dolgokat dobja ( keretek, VB gömb, ikonok stb...), skint nem :D","replies":[{"poster":"Shirodrake","date":"2018-09-28T16:21:17.218+0000","title":null,"up_votes":2,"down_votes":0,"body":"Valószínűleg, még nem került be a játékba.","replies":[{"poster":"Vérontó","date":"2018-09-28T22:25:37.640+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem benn van csak nem unlockolják. Ez a patch ha vb patch akkor kb november elejéig lesz. (pff) Ugyan azt játsszák el mint az odyssei skineknél. Csak majd megint az lesz, hogy minden skin tiszta bug lesz.","replies":[{"poster":"Shirodrake","date":"2018-09-30T19:41:37.642+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem az a baj, hogy nincs unlockolva, hanem hogy ne, tudod, hogyan néz ki.","replies":[]}]}]},{"poster":"Vérontó","date":"2018-09-28T22:32:06.343+0000","title":null,"up_votes":1,"down_votes":0,"body":"Majd később tudod kivenni.","replies":[]}]},{"poster":"Vérontó","date":"2018-09-28T22:31:44.292+0000","title":null,"up_votes":1,"down_votes":0,"body":"Azon mi 1820 rp? Nem legendary. A rito egy nagyvállalat aminek kell a bevétel a működéshez. Nem adhatnak ők se mindent ingyen (én már 4 skint szereztem sorozatban tök ingyen). Most 250 rp kibírható 1 chromáért (ami 390 rp)meg még kapsz 1 gömböt is meg keretet is.  Ennyibe kerül a legkisebb csomag és így kivehető lesz a chroma.","replies":[{"poster":"Shirodrake","date":"2018-09-30T19:40:25.246+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha veszel egy VB belépőt 1650Rp-nől, hogy mint a szorgos hülye gyerek nekiállj tokeneket farmolni, hogy meg legyen a 2500 token a Kai'sa skinhez akkor szerintem, akkor talán joggal feltételezhetem, hogy az legalább egy 1820RP (legendary) értékű skin... lesz. \nMert hát ugye azt sem tudod, hogy mit veszel.\n\nÉn meg már kb 40 Skin-t szerezem ingyen, na és? Azokat amik tetszettek az évek során már megvettem, szóval már nagyon nem tud izgatni egy újabb random skin. Egyedül már inkább csak a ward skinek érdekelnek, de azokért meg sajnálom a 640RP-t, szóval marad a farmolás.","replies":[]}]}]},{"poster":"Gresident","date":"2018-09-28T16:26:04.025+0000","title":null,"up_votes":1,"down_votes":0,"body":"De am ez a kaisai a boltba is megvásárolható lesz rpért, vagy csak tokenért lesz beszerezhető?\nMert ha boltba is meglehet majd vásárolni, akkor kell a fenének...","replies":[{"poster":"Shikaichi","date":"2018-09-28T16:44:00.725+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem lesz majd RP-ért is, de majd csak az esemény vége felé jelenik meg, van még addig sok idő, hogy a részletek kiderüljenek. Egyelőre igazán azt sem tudjuk, hogy néznek ki a skinek, hiszen PBE-n sincs még fent.","replies":[{"poster":"Shirodrake","date":"2018-09-28T17:55:32.883+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem inkább csak tokenből\n> \n> A Tekintély kiadású hőskinézetek igazán különlegesek: jár melléjük egy spéci chroma, keret, töltőképernyő és vizuális effektusok. A Tekintély kiadású Popsztár Kai’Sa kinézetet a küldetésekből és a vb-belépővel korlátlanul gyűjthető vb-zsetonokkal vásárolhatod meg!\n\nAz meg, hogy  az esemény kezdetén nem tudjuk, hogy mit farmolhatunk ki az plusz egy negatív érzés a részemről. :(","replies":[{"poster":"Shikaichi","date":"2018-09-28T18:09:52.692+0000","title":null,"up_votes":1,"down_votes":0,"body":"Először eléggé megörültem, hogy egybemosták a három eseményt, mert érdekesnek és izgalmasnak tűnt. A valóságban inkább kaotikus...","replies":[]}]}]}]}]}