{"poster":"Omphaloncu","date":"2015-01-28T06:50:53.221+0000","title":"How to win your ranked games!","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Hey there guys! Today I will be talking about how you can win most, if not all of your ranked games! I will be covering the attitudes that you should have, the champs you should play and what you can do to help you out in general. \r\n\r\nFirst off, what attitudes should you be having going into the games? First off if this is your first time playing ranked. Take them slow, maybe play one or two every once and a while then switch to some norms or even another game. But when you do click that 'match me with team mates' button what should you say to them, what will you do if things go wrong. So when you head into solo q or duo q, think positive, and try to be as nice as you possibly can! I really want to stress this point because I know what it is like to have complete dicks on your team, and people that seem like they are trying to lose the game for you. But the best thing is to not rage at them and be nice, because I have had those games plenty of times, and when it seems like you are going to lose, I have actually one them. So the first lesson is to be nice and stay calm if your team starts to not do as well as you want them to do because not every game is going to be perfect. But with your efforts you can try and  make it that way. \r\n\r\nSecond off, try and play your best role, and also have back up roles. Chances are that you will likely not get the role that you desire and you will probably have to play a different role. Have at least two or three roles that you can play, and if you don't get your role try and be nice and as you can and say \"Could I please have this role?\" And if that doesn't work then head back to your back up lane. \r\n\r\nAs I said before when you are in games and things are not going so well try and stay calm, and I think that things to help you do this, are things like music because tbh it's pretty hard to rage when you are listening to some gooooood shit. And if other people on your team are fighting don't join in because you should be playing the game and not typing. \r\n\r\nI hope that this little piece could have helped you and that you get the dream ranking that you want! Peace out and I hope that you have the best ranked games and win most of them.\r\n\r\nOmpha","replies":[{"poster":"Dawaraven","date":"2015-01-28T08:22:07.638+0000","up_votes":3,"down_votes":0,"body":"Playing akali works too.","replies":[{"poster":"Omphaloncu","date":"2015-01-28T09:46:19.184+0000","up_votes":0,"down_votes":0,"body":"She just got nerfed ahaha xD","replies":[{"poster":"Dawaraven","date":"2015-01-28T09:58:22.423+0000","up_votes":1,"down_votes":0,"body":"not yet!1!!111!! spam that akali before new patch comes!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.\nPlay kat once shes nerfed!","replies":[{"poster":"Omphaloncu","date":"2015-01-28T10:35:05.426+0000","up_votes":1,"down_votes":0,"body":"True","replies":[]}]}]}]},{"poster":"Devil God King","date":"2015-01-29T02:21:07.006+0000","up_votes":1,"down_votes":0,"body":"winning at lol is losing at life. False Causation to imply the contra is true","replies":[]}]}