{"poster":"ImZotex","date":"2016-10-19T12:58:58.330+0000","title":"Top oder Jungle ?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Hey, \r\nIch spiele zurzeit nur Midlane, m&ouml;chte aber noch eine 2. Lane spielen (f&uuml;r Draftmode). Jetzt weiss ich nicht ob ich Top oder Jungle spielen soll. Bis jetzt bin ich fast immer auf meine Land gekommen. Was w&uuml;rdet ihr mir Empfehlen(Bitte mit begr&uuml;ndung)?","replies":[{"poster":"Maíko","date":"2016-10-19T14:33:31.898+0000","up_votes":2,"down_votes":1,"body":"Als Midlaner würde ich dir die Toplane empfehlen.\n\nNeben der Midlane ist die Toplane die einzige Sololane im Spiel. \nDie Umstellung von Mid zu Top fällt wesentlich leichter, als sich daran zu gewöhnen mit einen ADC/Supporter gemeinsam auf der Lane zu spielen, oder zu erlernen wie die richtigen Junglepathings sind.\nEbenfalls kannst du ohne Probleme fast den selben Championpool benutzen, da viele der Midlaner auch sehr gut auf der Toplane funktionieren.\n{{champion:84}} {{champion:63}} {{champion:31}} {{champion:245}} {{champion:41}} {{champion:126}}{{champion:43}}  {{champion:38}} {{champion:10}} {{champion:85}} {{champion:127}} {{champion:90}} {{champion:13}} {{champion:8}} {{champion:157}}","replies":[]},{"poster":"Kata Ga Kill","date":"2016-10-19T20:50:39.141+0000","up_votes":1,"down_votes":0,"body":"Spiele alles auser Jungle XD\n\nAnfangs wars Midlane und Toplane, aber mit den dominierenden Range-Toplanern bin ich mit den Tanks auf Support gewechselt bzw. kann ich da auch so manche meiner Midlaner spielen wie:\n{{champion:25}} {{champion:143}} \n{{champion:78}} {{champion:72}}\n\nAuch ADC macht mir spaß den hier gibs keinen großen Müsli wie bei der Toplane, hier bleibt die Rolle Konstant.\n\n---------------------------------------\n\nGenerell spiel da wo deine Champs spielbar sind.","replies":[]},{"poster":"haha weed lol xd","date":"2016-10-19T18:47:33.426+0000","up_votes":1,"down_votes":0,"body":"Wenn du roam Midlaner wie Zed, Katarina, Ahri usw gespielt hast Jungle. \n\nWenn nicht dann Top.","replies":[]},{"poster":"Kien222","date":"2016-10-19T15:26:38.073+0000","up_votes":1,"down_votes":0,"body":"Ich maine selber mid, es kommt halt darauf an welche champions du spielen willst oder kannst\n{{champion:84}} {{champion:245}} {{champion:126}}  usw.","replies":[]},{"poster":"Shacoláde","date":"2016-10-19T13:59:30.805+0000","up_votes":1,"down_votes":0,"body":"Was hab ich gesagt, der eine sagt Top der andere sagt Jungle ^^\nEinfach spielen was dir gefällt ;)","replies":[]},{"poster":"Anónym","date":"2016-10-19T13:53:32.998+0000","up_votes":1,"down_votes":0,"body":"Ich würde dir die Top empfehlen da ich selber auch die beiden Lanes maine und diese sehr simultan sind (1 vs 1) wenn du dich auf der Midlane zurechtfindest wirst du kaum Probleme mit der Toplane haben","replies":[]},{"poster":"HeartÓfDarkness","date":"2016-10-19T13:47:51.090+0000","up_votes":1,"down_votes":0,"body":"Ich würde sagen schau dir die aktuelle meta an, und entscheide was dich mehr interessiert. Auf der Top lane werden eher Off Tanks/Full Tanks gespielt, im jungle kann auf mehr carry champions zurückgreifen. Es kommt im großen und ganzen einfach darauf an, was eher zu deinem spielstil passt, ich zum beispiel spiele lieber jungle und inzwischen eigentlich gar nicht mehr top.","replies":[]},{"poster":"Shacoláde","date":"2016-10-19T13:03:32.088+0000","up_votes":1,"down_votes":0,"body":"WÜrd ADC nehmen.\n\nNe, keine Ahnung was du hören willst. Die, die Top mainen werden dir Top empfehlen, die Jungle spielen Jungle.\nHat alles sein Vor- und Nachteile. Würde das Spielen was mir am meißten Spass macht.\nPunkt aus Ende ;)","replies":[]}]}