{"poster":"LuxannaVeritas","date":"2016-07-31T23:00:21.767+0000","title":"Patch 6.15: Disconnecting from PvP.net","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"OK, here's the skinny. I play LOL on two computers; my laptop is in my bedroom, where my internet signal is stronger. The other computer (a desktop) is in my living room, which still has great internet connection, but is weaker. \r\n\r\nLately, on this patch, I've been disconnecting from the PvP.net after most games I play on my LAPTOP. This is mostly ARAM, bot games, and special game modes because I'm playing on my bed, which isn't the best set-up for me. Afterwards, my IP, champion mastery, and purchases in the shop do not update until I log out, and then log in again. \r\n\r\nI haven't disconnected from the PvP.net on my DESKTOP, which makes no sense. I know it's not the internet connection, because then I would have this problem on the desktop. So this seems to be a laptop issue.\r\n\r\nIf it means anything, I do have low storage, but I'm not running out. \r\n\r\nPlease help! {{champion:32}}","replies":[{"poster":"Targons Blade","date":"2016-07-31T23:51:17.000+0000","up_votes":1,"down_votes":0,"body":"PvP.net disconnections are almost always caused by a poor connection to the servers. Even though you're not having this issue on your desktop, it doesn't mean that your network adapter on your laptop isn't experiencing issues. A good place to start in troubleshooting this is to take a look at the solutions in our [connection guide.](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) \n\nIf you still have PvP.net disconnections after completing that guide, please let me know.","replies":[{"poster":"LuxannaVeritas","date":"2016-08-01T15:14:42.802+0000","up_votes":1,"down_votes":0,"body":"Thanks for the link. I'll try out some of the things on the page.\n\nOne thing; I got an in-game error message for the first time after I disconnected from the PvP.net. It gave me a different link than the one you sent me. \n\nhttps://support.riotgames.com/hc/en-us/articles/201761944\n\nJust a heads up in case the error message needs to be updated with the correct link.","replies":[]}]}]}