{"poster":"HierosGodhead","date":"2016-12-14T15:08:39.445+0000","title":"A Jax Story/Epic, because if I don't, Riot certainly won't either.","subforum":"Player Creations","up_votes":3,"down_votes":0,"body":"I&#039;ve gotten to writing a multichapter story on Jax, origins and all. Now that we know he&#039;s from Icathia there&#039;s a portal to a rich, deep lore that ties in with multiple champions and more, but true to the usual, Jax just gets bent over the table and absolutely found in the alps in regards to Lore. So here, I write another chapter every night and I&#039;ll add them on these forums too. Maybe you&#039;ll like them, maybe you won&#039;t. First chapter will be below this post in case there&#039;s a word limit of some kind. Happy reading!","replies":[{"poster":"HierosGodhead","date":"2016-12-14T15:09:26.717+0000","up_votes":1,"down_votes":0,"body":"PART ONE- THE ICATHIAN MERCENARY.\n\n\nOnce, a long time ago, Icathia had stood tall. A city of wonder, laying in the south part of Runeterra, and a sight that the ancient people had come to see for miles around. The craftsmanship inherent in the buildings was breathtaking, the magic in the air buzzed and crackled at the fingertips of those sensitive to it, and it seemed like the sun always shone over it. \n\nIn the center of this wondrous city was a temple, so big that it shadowed all the buildings around it. It stood as a testament to the people of the city- proud, and tall they stood like their building, full of wisdom and power. All day and night, one could sit nearby and watch as priests and scholars entered and exited the temple, full of zest for learning and teaching. Truthfully, the entire city appeared to revolve around this building. Trade and commerce were nice, but the mystical arts excited everyone young and old.\n\nOf course, such important architecture and knowledge required utmost protection. From dawn to dusk guards were stationed at several points in and around the perimeter. Wielding tri-pronged polearms, their faces were hidden by large dǒuli. One such soldier at the entrance to the temple also wore a large, ornate string of beads around his neck. Jax, as such he was known, was a prodigal guard, renowned for his skill in battle, and wit to spare. None walked away from a fight with him angry despite the assured loss. Assuming they were still walking post-fight. \n\nOn a day like any other, Jax stood guard at the entrance, his shifting weight from foot to foot barely noticeable. The sun was in the middle of the sky and there wasn’t a cloud to be seen, something that made his heavy robes somewhat uncomfortable, but nothing he couldn’t bear. His gaze shifted towards a cowled figure approaching the temple, his grip tightening on the weapon.\n\nBefore he could call out, the cowl was dropped, and Jax lowered his polearm.\n\n“Almost stabbed you Ashram! You should try being a bit more conspicuous with your identity once in a while, might do you some good.”\n\n“I believe that my appearance shouldn’t matter, dear Jax. We all have a distinct aura that you could easily sense if you ever took the time to learn.” Came the response from a voice that sounded like he hadn’t seen sleep in quite a while. Ashram indeed worked hard, day and night. There was always a new breakthrough that he could be on the verge on, and every new discovery brought him the same joy as the first. \n\n“As long as I can beat people senseless, I don’t need to see their aura.”\n\n“There may yet come a time when you can’t solve all of your problems with a weapon, you know. Although now that I think about it, that might be something of a foreign concept to a barbarian like you.”\n\nA short silence ensued as the two sized each other up, before they both burst into laughter and clapped each other on the back. Soon, Jax resumed his position and Ashram gave him a smiling nod before continuing into the temple.\n\nUnbeknownst to the two of them, something had used the distraction to slip past them both. A devious, dangerous shadow that crept along the edges of the temple, avoiding the soldiers so easily it may well have been skipping along. Deeper, deeper into the catacombs of the temple it stole. What it sought lay in the very centre, a secret to all but the most respected and powerful priests.\n\nFor in there lay a terrible, terrible thing. A crack of sorts, a keyhole. And on the other side was a dimension that no sane being should ever see or endure, a place of terrible coldness and darkness, where only the cruellest and most vile things survived. This, the shadow sought.\n\nThe temple had been built specifically to keep locked away this horrible secret. And yet, over time, security waned. The priests believed secrecy worked better than security, and the guards that had once been stationed just outside had been removed. This lax approach meant that the shadow could have walked in, head held high and nobody could have stopped it. \n\nIt entered the room, became one with the shadows. Soon, soft, swift strikes were accompanied by muffled thuds as the priests in the room realised all too late what was about to finally happen. In all honesty, it was perhaps for the best that they were killed. At least they wouldn’t have to endure what was coming. \n\nOutside, Jax felt a shiver run through his body. Wholly odd on a warm day like today. He didn’t like it. Instinct hadn’t once failed him in battle. He scanned the horizon again. Nothing but civilians going about their business. Not a one was even approaching the temple. His eyes narrowed. Something was going to happen, and it was going to happen soon. He just wished he knew what was going to happen. \n\nAll too soon, his question was answered. A black, heavy mist crept out the temple floor, covering his feet in the deadest cold he’d ever felt. He leapt to safety, weapon at the ready. All his battle senses were afire as he scanned every which way for a potential threat, before he turned back to the archway of the temple.\n\nSuddenly, a wave of fog so thick it may as well have been water cascaded out, as high as the doorway itself. Jax was instantly engulfed, fighting to breathe in the damning mist. Unable to see, hear, or breathe, all he could do was feel the cold surround him like it would never go away again. He clutched his weapon tight to his chest, the wood giving him some small comfort as he was tossed around. He felt the changes happen in vivid detail. His fingers grafted together, from five to three thick stumps that curled still around his weapon. His skin wrinkled and tore, dyed a deep hue of purple. His face was completely ruined save for his mouth. His eyes, he felt melt away in their very sockets, the pain causing him to briefly pass out. Yet the mist kept him alive, as though it wanted him to make it through this. \n\nAnd eventually, he made it. Blind, piercingly cold, but alive he fell out of the fog. He could at least listen, but what he heard wasn’t good. Chaos reigned in what was not an hour ago a peaceful, idyllic city. Screams of children rang through the air before they were cut off disturbingly early. \n\nIt was all Jax could do to stay on his feet, stumbling through unfamiliar wreckage. Every so often a feral snarl or scream rang through the air. Some were right next to him, some off in the distance, yet none touched him. It was as though the mist that had given him this new, monstrous form now also protected him from the evil that prowled what was once his city.\n\nIt was all he could do to find a shelter where people still lived, more to convince them that he wasn’t one of the things responsible for so much death and destruction. And so he sat, meditating. While others shook and wailed around him, Jax closed himself off, cross legged with his weapon across his lap as he focussed. He might be blind now, but maybe he could finally make use of what Ashram had tried to teach him. Ashram… most likely dead now. He’d been in the temple when everything had started. Perhaps he’d been changed like Jax? Somehow, he doubted it. If everyone was turned like him, nobody would have died. He pondered on this as he worked on his spiritual senses.\n\nFor Jax, magic had been a waste of time. He was a physical man, born to fight and damned good at it without casting firebolts and lighting thank you very much. Most every magician folded like wet parchment if he gave them a good smack on the head with his polearm anyway. But now, perhaps it could return his senses to him\n\nSlowly, ever so slowly, he began to see something in his mind’s eye. Indistinct blurs, losing form as soon as they came into focus, resembling people. It was working! He concentrated, looking at one form and willing it to become sharper. And so it was. He could even make out facial features. However, this would take him quite some time to master.\n\nAlmost as if on cue, a creature crashed against the entrance to the shelter. The screams that rang out nearly deafened Jax all over again, but everyone became silent as the grave upon the second attack. The door all but exploded inwards, and on the other side of the entrance sat a grotesque being, all sharp teeth and mottled purple exoskeleton. \n\nFor some reason, this thing  Jax could see without any effort. As though directed to it he looked, standing again, weapon in hand. Enough had perished today. It was time for the guard to do his job. Leaping over the wreckage of the door, the polearm stabbed at the creature-\n\n-and shattered like glass. The creature turned to Jax with a look of confusion and anger, convinced that he was one of them. Yet, instinct won out over basic thought. It had been attacked. The only course of action was to attack. It screamed, feral and horrible, before descending on the guard who was desperately looking around for a weapon. Coming up with nothing, he reeled back and simply punched the creature.\n\nAs it happened, blunt force trauma turned out to be a lot more effective. The exoskeleton cracked apart, revealing pulsating flesh within. Jax was shocked at his strength more than anything. What the mist had taken, it had returned tenfold in physical ability. Perhaps more. Heading over to the side of the street, he grabbed an ornate brass lamppost. With a single heave, it was uprooted from the ground, rubble falling at his feed as he turned once more to face the beast. \n\nWithout waiting, Jax leapt forth, bringing the post down in an overhead arc as hard as he could at the beasts head. With a shriek, it fell to the ground, head caved in as though a boulder had beset it from above. Jax panted, looking about. His mental vision was sharpening, He could see the streets, the rubble that once was buildings. He turned to the people, able to make out each of them now. They winced when he looked at them. Not exactly the kindest response to the man who’d just saved them all. Still, he figured he looked pretty horrible. Right now, that was the smallest issue.\n\nCONT-","replies":[{"poster":"HierosGodhead","date":"2016-12-14T15:16:00.832+0000","up_votes":1,"down_votes":0,"body":"CONT HERE-\n\n“All of you, leave, Our city is gone. Don’t stop for valuables or to search for family. Just go. To the north there might be some settlements you can start a new life at, but we can never come back here.”\n\nThe statement shocked everyone. One or two people got moving, but the rest just gaped at him. Irked, he waved the lamppost at them, crashing it down on the ground. \n\n“Are you all deaf?! If you stay here any longer, you die. It’s that simple.”\n\nThat got the message across. People were now scrambling over one another to leave. Jax, however, headed back to the temple. He didn’t know what to expect, but he knew he had to come back. The mist that had burned him with cold now danced around his feet, settled down for the time being. No more beasts exited what was left of the archway. He stepped over some more wreckage and looked around. \n\nIt was dark inside. However, light no longer mattered to Jax. His footfalls rang loud through the ruined catacombs as he searched. Eventually, he found it. The body of his closest friend Ashram. Fear was etched on his face, glassy eyes wide open. Jax passed his hand over Ashrams face, settling it into a more relaxed position in death. He deserved at least that much. He carried the body to a stone slab, setting the body down. He knew the funeral rites of Icathia. \n\nSoon, Ashrams body lay dressed in fine white robes, thin and silky. A clutch of flowers were in his fists. His calm face was hidden under a mask of metal, several holes drilled meticulously through. It was believed that the soul exited through these holes, and without them the diluted soul couldn’t find its way to the next life. Jax now wore the purple robes his friend had once donned. They were as heavy as his guards uniform which now lay forgotten, the purple robes almost disguising his disfigured hands. \n\nHe channeled magical energy into the head of the lamppost. To his surprise, a flame sprang to life in the middle, the shattered glass unable to withhold the steady heat. With grim satisfaction, Jax brought the flame close to Ashrams body, the robe easily catching alight as jax backed off, the flame in the lamp dimming as the other grew.\n\nJax stood guard in the ruined temple for hours as the body burned, not once looking away. In the end, the ashes of what remained were carried on a cool breeze that entered the temple from outside, scattering what was left of his friend on the temple he’d loved. Fitting. On the slab, the metal mask lay, rapidly cooling. Jax turned to the mask now, picking it up. Well, if nothing else, it could stop people from trying to kill me on sight. \n\nHe slipped the mask on under the hood of the robe. Finding his vision unimpaired, he now set off, exiting the temple with the lamppost slung over his shoulder. Ever since his polearm was destroyed, he’d felt a certain attachment to the thing. It felt good in his arms, and that was all he needed. Maybe he’d change weapons again eventually.\n\nFor now, the ex-guard exited the ruins of Icathia, heading north, or so he figured. New cities were on the rise up there, the stories told. Two of them were growing in power and influence faster than any other, and there looked to be conflict in the future. If there was one thing Jax could depend on to exist, it was conflict. Where conflict was, he could find something to do, someone who’d pay him to do what he did best.\n\nEND PART ONE.","replies":[{"poster":"HierosGodhead","date":"2016-12-14T15:17:12.392+0000","up_votes":1,"down_votes":0,"body":"PART TWO- North of Icathia.\n\nThe hardest part of the journey north was the mountain range directly upwards of the ruins of Icathia. He knew of a pass that existed in the middle of the landmass, but Jax wasn’t a man who went around an obstacle, so forward he went. Despite the thick forest and the near-vertical ascent, he traveled as the crow flew north.\n\nWithout the body he now had, he doubted he’d have even scaled half the height he now did as easily as jogging along a downward slope. The robes, thick about his body, proved an effective barricade against the hot, humid climate of the forest, and the biting cold at it’s peak. Ever since he’d changed, he found that there were several things he no longer needed. Warmth was perhaps the biggest. An eternal chill was hidden under his robes, clinging to his skin, and yet he never fell ill. \n\nIn time, he scaled the peak of the mountain he’d climbed, choosing also to ascent to the tallest treetop near to him, looking at the journey ahead. Standing out like a sore thumb was the skull-shaped fortress that almost made him snort derisively. He wondered what kind of idiot chose to live in that thing. Something he’d find out, he was sure.\n\nDestination pictured in his mind, he scaled back down the mountain, picking his way through the near-impassable terrain that now yielded to him. At the bottom, he picked up sight of a group of people, clearly not doing as well as he was. His ability to see magically wasn’t yet perfect, but he recognised people from Icathia. In fact, they all were. Purpose sprang to mind, and he approached the head of the group, where a solitary priest led the way, feet dragging. Wounds covered him, and from the looks of his bag, food was running low. It was a good thing they were about a days march left or he wouldn’t have made it. \n\nHe finally caught up, weapon slung over his back. Instantly, he was met with hostile glares. Unsurprising, he decided. He didn’t quite understand the extent of his transformation, but looking at his hands alone he knew it wasn’t pretty. Still couldn’t see color, though. Maybe that would shed further light on this issue. For now, outlines would do.\n\n“Easy, easy. I was one of the guards at the temple, I’m here to help.” Instantly, he knew he’d made a mistake. Weapons weren’t pointed at him, but the priests look changed from fear to loathing in a heartbeat. “Then you’re a failure. Everything that happened, did so because you failed to do your job. Do you understand the blood on your hands right now? The children, the bystanders? You should be put to the sword for what you’ve allowed to happen. For now, you can make sure nothing happens to us until we reach Noxus, understood?” \n\nJax bit back several comments, He felt immensely defensive, but when he thought about it, he’d been the head guard. He’d let something into the temple, he’d let it do whatever it had done inside there. What, he didn’t know, but it was on his head, his hands. He silently took up post beside the priest, marching with the group. He heard them muttering, felt their gazes pierce his cowl. The most they could see of him were his ruined hands. That alone probably sparked ideas and fears.\n\nThroughout the day they walked, and Jax began to regret choosing to join this ragged band of survivors. He could have marched twice as fast as this throughout the day without stopping for rest, but the elderly and frail amongst the group required stops every hour or less, and the large fortress in the distance refused to come closer at this pace. Even generously, Jax reasoned they wouldn’t reach their destination until halfway through the night at this pace.\n\nAs the sun hung low in the sky, Jax came to the decision that this group would need a nights rest before they made it to the city. His suspicions were confirmed as the priest ordered them to stop and set up camp for the night. He turned to Jax, calling him to the outskirts of their little encampment. “You’re to stand guard. Nobody here is to be hurt. Clear?” Jax nodded, immediately turning away and beginning his patrol. Like warmth, he needed no sleep to effectively function. Though he was sure the priest didn’t know it, and it was something he chose to omit for the time being.\n\nHe’d have preferred the night to be uneventful, but alas, Runeterra had other things in store for the guard. A wolf pack, scenting a convergence of prey, set upon the camp, moving with the night. To the ordinary eye, they were invisible. Jax didn’t have an ordinary eye left, and he picked out their bodies as easily as if they’d attacked in broad daylight. A few swift strikes to the alpha male and the entire pack fled, a lamppost shaped bruise doubtless forming on their leaders haunches. \n\nThe rest of the night, Jax looked up at their destination. It was a large city, perhaps even rivalling Icathia in size. However, the large fortress lacked the artistry that the temple had possessed. It didn’t speak of knowledge and pride, it spoke of untamed ambition and anger, dangerous things to allow to lead the growth of a people. Still, the walls were high and undamaged, and right now that was enough.\n\nAs the sun rose on the group of people, Jax stretched, feeling his joints crack. Had he really stopped moving for so many hours? He made a quick scan of the survivors, but none were missing or hurt. Moreso than they already had been. The priest gave them all what were perhaps supposed to be heartening words, but from what Jax could make out of facial expressions, none of them looked too hopeful about the future. At least they were smart.\n\nWhen the sun was at its Apex in the sky, they finally reached the daunting gates of Noxus. The name was crudely daubed upon a sign nearby, informing all who came near that the city was only for the strong. Jax didn’t doubt his strength, but somehow he doubted that he’d be able to ensure the safe entry of all those with him. Now that he thought about it, none of the survivors possessed real strength. The priest was all but magically incontinent and none of the others possessed magical or physical abilities beyond being able to handle basic tasks. \n\nNonetheless, he stood silent at the gates as the priest approached them, taking a mighty ring of iron in both hands and lifting it up, letting it fall once. The sound had to be modified somehow, the deep thrum that shook everyone to their core wasn’t the sound he’d expected in the slightest. Aside from that, nothing happened. Not immediately, at least. \n\nWhat eventually did happen was the last thing Jax wanted. An ambush, as it happened. A group of soldiers in armor that was burnt black, crude but sharp weapons at the ready. The approached from behind, obviously through a hidden entrance. Obvious to Jax, at least. The priest, suspecting that this was simply a group of bandits, hollered for assistance at the gates and it was all Jax could do to resist beating him silly. This was a test, and an obvious one at that. A test of strength. Unfortunately, nobody but him looked fit to handle them.\n\nFortunately, he felt himself fit to handle all of them alone, and the way they held themselves confirmed that. Poor balance, bad grip, all clustered as a group. They displayed all the markings of a militia that hadn’t yet become a formal military, brutish and undisciplined. Was this really one of the biggest military mights on Runeterra at the moment? If they’d ever visited Icathia there’d be one less threat to the continent, he was sure. \n\nHe took his lamppost and spun it lightly, moving to block their path to the bystanders immediately, before sizing up the man at the head of the pack. He wore no helmet, and his face was probably as disfigured as Jax’s. So reasoned the guard, anyway. They spoke no words, which suited the both of them just fine. All those with a weapon knew what was going to happen, there was no need to exchange worthless pleasantries.\n\nRather than let the militia approach his charges, Jax initiated the fight, leaping forward and striking the leader in the midriff hard, following up with another strike to his head, aiming for the sweetspot just next to the eye where the skull was thinnest, His aim was true, and the man dropped like a sack of bricks.\n\nThe rest of the soldiers didn’t even hesitate. Their comrade fell because he was weak, that was it. This, Jax could appreciate. He found himself surrounded, weapons jabbing at him from all sides, searching for a point of entry. Jax did something he felt was poorly thought out, but the only thing that occurred to him as a way to solve this problem. \n\nThe lamppost spun again and again over his head, knocking aside each strike that came his way. Again and again, Jax remained unharmed, while the soldiers wore themselves out. Not only were they poorly trained, it seemed as though they hardly trained, Probably more used to raiding helpless villages than extended battles. Jax curled what was left of his lip under the mask, hands sliding to the bottom of the brass streetlight as he brought the weapon in an arc around him, Cries of pain rang out and weapons began to hit the ground, some of the false military backing off already, This thing they’d elected to fight with hadn’t taken a single strike from any of them and he was about to retaliate. Strength above all be damned, they liked their concussions as infrequent as possible.\n\nThose who didn’t retreat got some small mercy. A single strike apiece left them all flat on the ground, breathing shallowly. Jax left them there to be tended to by their cowardly allies as he marched to the front of the gate, smacking it a few times with his improvised weapon. This time, the response was near-immediate, the gates swinging open. On the other side, however, was a grim picture.\n\nCONT-","replies":[{"poster":"HierosGodhead","date":"2016-12-14T15:18:05.947+0000","up_votes":1,"down_votes":0,"body":"CONT PART 2 HERE-\n\nThis time, the militia was a lot larger, and looked to be even a little bit disciplined. At the head stood two people, a man who looked too proud not to be the leader, and what was more giant than man. Standing twice as tall even as Jax, he, or maybe even it, looked down past Jax as though he weren’t there, assessing instead the group behind them. Clearly, he didn’t like what he saw, and his fingers twitched about the haft of his weapon. And what a weapon it was. A battleaxe as big as Jax himself, the head wider than him. Every time it shifted, his shoulder was pushed down a tad from the weight. If it wa painful, the giant didn’t show it.\n\n“Greetings, warrior.” The leader was speaking. His voice rang deep, and self-assured. He at least thought he held all the cards right now, Then again, he essentially did, Jax realised. “I am Boram Darkwill, and Noxus is under my command, Your name, if you please.” An order. Normally, Jax would have told this man exactly what he could do with his friends axe, but now wasn’t the time for it. “Jax. We come from what was once Icathia, but it is no more. We seek shelter within your city until we can begin to rebuild what’s left of our city.”\n\nThis, the giant seemed to find amusing. His laugh, malicious and rumbling, was easily picked up by the survivors. Unfortunately, they weren’t all cowed. The priest, it seemed, had had enough of being ignored. Why, Jax couldn’t fathom, He’d made enough mistakes, all he should’ve done now was stay quiet. Yet, he marched to the front of the group and a little further, attempting to square up to the giant. Attempting was the key word here. He might as well have been a starving razorbeak chick staring down a dragon. \n\n“I don’t know what you think is funny, but I must warn you that I control magic strong enough to tear you limb from limb. If you insult my home or its fall again, you’ll find out why no militaries approached Icathia.”\n\nThis did nothing but further amuse the giant, something that should have tipped off the loudmouthed idiot to back off. He didn’t. The giant leaned down to face him, another warning sign. Jax wanted dearly to pull this priest back into the group of survivors, but right now, there were too many factors. Pride, mostly. Of the priest, of Jax and certainly of Noxus. The giant began to speak, his voice a hoarse, guttural growl that nobody struggled to head.\n\n“Icathia? You mean that tiny little village over the mountains? The only reason Noxus never visited is because we were busy with relevant areas, whelp. If we’d sent out a military force, your puny hole would have been in ruins far sooner than now.”\n\nThis, the priest couldn’t abide by, his face turning red as his words caught in his throat. Jax mentally begged the idiot to keep his mouth shut, The giant was shifting his weapon into both hands. He was going to strike, and Jax didn’t know if even his enhanced body could stop it. The priest had diverted his attention to Darkwill, who, in turn, was looking at his cohort. Jax saw that he wasn’t at all going to make him stop, so all he could do was watch the inevitable.\n\nAll too soon, the axe swung, whistling through the air. The priest realised all too late, and barely managed the beginnings of a pitiful scream before he was cleaved in two from head to foot. His body stayed together for a second or two, before it fell two different ways, a sickening mix of innards and fluids falling every other way out. Jax watched it all happen before he looked back up at Darkwill, whos eyes were gazing through the mask with interest. Would the soldier retaliate? His leader had just been killed without remorse, and his people were too terrified to scream. They huddled together like prey animals, certain that their end was near. Right now, it all rested on Jax.\n\nThe masked guard spoke, voice flat and clear. “He deserved it. The idiot tried to call for help when you tested us, and then picked a fight when he couldn’t even fight a sickly child. He was weak. Too weak to survive here. But I ask you to spare those behind me, Make them slaves if you must, but they have suffered enough. There is also something I must discuss with you, of great importance.”\n\nThe giant snorted, immediately starting forward. Jax feared all was lost for those he was bound to protect, but Darkwill held the man back, smoothly talking. “Not now, Sion. Jax is right, they would make for decent slaves. Perhaps the fit children can be trained into squirehood. I’ll not waste what is there to be taken.” Sion, as the giant was apparently called, growled, but fell back into position beside him. Jax could see the bloodlust in him more clearly than the shape of his body. This man was more dangerous than he’d let on so far. However, Darkwill wasn’t done speaking yet.\n\n“As for you, Jax, I’m unfortunately unable to think of a simple solution. You’re too strong to be a simple soldier, but you’ve not proven yourself at all to the people of Noxus, so I can’t simply make you a leader of sorts, the people would riot.” He said it with a straight face, but Jax could feel the cunning smirk hidden underneath. He wasn’t apologetic about this at all, and he’d come to his conclusion before the priest was even dead. “Right now, there’s only two choices you have. Leave Noxus and find somewhere else to call home, or become a fighter in the Fleshing.”\n\nJax didn’t know what the Fleshing entailed, but he knew there was no choice. He couldn’t leave now, Darkwill wouldn’t let the survivors leave with him without a suicidal battle, and Jax couldn’t just leave them at his mercy. No, he had no choice but to discover what this Fleshing was. He approached Darkwill without a hint of caution. He had to. This was a town run on strength. Backing down at all gave his opponent all the power.\n\n“I’ll do it. I don’t know what your Fleshing is, but if you keep my people safe, I’ll do as you ask. As long as I get to talk to you in private as well. This matter is of urgent importance to you, you’ll find. What destroyed Icathia is likely spreading outwards and could well be coming to Noxus.”\n\nDarkwill waved an airy hand, already turning to leave. “All in good time, Jax. For now, it’s time to get you all settled in your new home. Your people will have today and tonight to rest and recuperate, and as of tomorrow they will be given tasks. There will be no mercy shown to anybody. If you aren’t able to do what is asked of you, you will be thrown out and left to the razorbeaks and bramblebacks.” Without even waiting to hear a response, he was gone. Sion approached Jax, a cruel smirk on his face.\n\n“A pity, that I do not partake in the Fleshing. I would love the chance to crush your skull in my hands, as easy as it would be.” Jax met his gaze without flinching. He was big, and he was tough, but he wasn’t the cleanest fighter Jax had ever met. “If you’d ever been in a real battle, you wouldn’t be so keen for another.” Sion growled, low and threatening, more animal than man. His axe shifted again in its grip, but Jax cared little now that his people were safe for now. “Watch your back, whelp. To me, you’re just another corpse for the pile.”\n\nWith that, he turned and left. Jax breathed a sigh of relief, He wasn’t afraid. But as sure as Icathia would never be what it was again, he didn’t fancy going toe-to-toe with that thing. Not until he’d discovered the extent of what he could now do, anyway. He hadn’t yet had the chance to push himself to the limits he wasn’t sure he still had. If nothing else, this Fleshing sounded like a way to test himself. \n\nHe soon found a sign directing him to an Arena within the city. Large and crude, the signs indeed labelled it as the place where the Fleshing took place. Jax walked around the base of the construction until he found a clear entrance. Inside, people were sparse, mostly cleaning for the time being. He approached the man doing the least. Often the one in charge, in his experience. “Hey, I’m supposed to take part in the Fleshing. Mind telling me what it is?”\n\nBoth eyebrows shot up, and it wasn’t because Jax looked weird. “You serious? That’s a punishment, you know. We reserve it for prisoners of war and criminals.” That didn’t surprise Jax in the slightest. Darkwill certainly wasn’t going to force him to scrub lavatories as payment. “Enough dancing around the point. Tell me what I’m going to be doing and be concise about it.”\n\nThe man sucked in a breath through his teeth before speaking again, pushing himself off of the wall to meet Jax’s gaze. “It’s combat. Nothing but endless combat. If you win, you fight more opponents, and you keep doing so until either we run out of people for you to kill or you get killed. Concise enough?” Jax nodded. Everything he’d expected. It didn’t surprise him at all that he was being treated this way. “Just show me where to go, then. I don’t know the first thing about this place right now.”\n\nThe man nodded. Normally he wouldn’t take orders from someone who was about to get themselves killed, but he wanted to see them die for their overconfidence. What kind of idiot didn’t even hesitate at the idea of eternal gladiatorial combat. Or at least, until inevitable death. Waving a hand, he lead the way to the cells where prisoners were kept. No special treatment for idiots in Noxus.\n\nEND PART TWO.","replies":[{"poster":"Krispy Migraine","date":"2016-12-23T08:26:55.366+0000","up_votes":1,"down_votes":0,"body":"Can I add extras?\nwell anyways\n\nJax runs like an idiot and goes to a pub in frejdlord (I don't know how to spell it) and meets gragas. They get drunk and destroy runeterra. \n(This isn't serious).","replies":[]}]}]}]}]},{"poster":"Talon12","date":"2016-12-16T10:25:46.184+0000","up_votes":1,"down_votes":0,"body":"Jax is buddies with gragas. Drinking buddies! Actual lore btw.","replies":[]}]}