{"poster":"DTD ShadowXohoo","date":"2016-01-20T13:11:00.866+0000","title":"Ban-Phase","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":2,"body":"Bin nur ich der Meinung oder f&auml;llt es euch auch gar nicht auf wenn ihr dran seit mit bannen/picken? Mir ist es jetzt im Ranked passiert und anderen schon mehrfach, es kommt ja nicht mal ein Sound oder so etwas und League dr&auml;ngt sich auch nicht wie damals vor wenn man bannen muss. Finde ich echt kacke. Hoffe man bekommt kein lose daf&uuml;r.","replies":[{"poster":"Loki331","date":"2016-01-20T13:33:46.739+0000","up_votes":2,"down_votes":1,"body":"Aufmerksamer sein! Ganz einfach.","replies":[]},{"poster":"13900 IP Broke","date":"2016-01-20T13:13:53.010+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"DTD ShadowXohoo","date":"2016-01-20T13:24:53.302+0000","up_votes":1,"down_votes":3,"body":"Mega Bullshit QQ schon ein ranked deswegen gedodged\nhoffe kriege kein lose","replies":[{"poster":"DTD ShadowXohoo","date":"2016-01-20T13:26:57.606+0000","up_votes":1,"down_votes":3,"body":"Und was grade passiert ist ... alter damals konnte man ja sein champ ausgewählt lassen und muss nicht auf lock in klicken jetzt habe ich das nicht gemacht instant rausgeflogen !?! so ein dreck","replies":[{"poster":"HyperionCH","date":"2016-01-20T13:37:27.313+0000","up_votes":2,"down_votes":1,"body":"Riot hat bereits bemerkt, dass dies bei einigen Spielern passiert (Test in NA und Türkei).\n\nSie werden wohl schauen, wie oft dies passiert und - sollte dies oft passieren - dies wohl patchen.","replies":[{"poster":"Loki331","date":"2016-01-20T13:42:22.426+0000","up_votes":1,"down_votes":0,"body":"Meinst du das aufploppen oder das man extra lock-in drücken muss? Das lock-in ist mit Absicht drin.","replies":[{"poster":"HyperionCH","date":"2016-01-20T14:17:23.197+0000","up_votes":1,"down_votes":0,"body":"Da musst du den TE fragen und nicht mich. Er sprach ja davon. ;)\n\nGem. dessen Beitrag geht es wohl um den Lock-In.\nRiot hat in der Meldung gestern bestättigt, dass dies offenbar öfters vergessen wird und so unabsichtlich \"gedodged\" wird.\n\nOb Riot deswegen eine Änderung macht (z.B. kein Lock-In mehr nötig) ist wie erwähnt nicht entschieden. Jedoch weiss Riot, dass derzeit öfters der Lock-In vergessen wird. Ob sie etwas dagegen tun, werden sie wie erwähnt wohl erst entscheiden, sobald sie genaue Daten haben, wie oft so etwas vorkommt.","replies":[{"poster":"Loki331","date":"2016-01-20T15:49:15.153+0000","up_votes":1,"down_votes":0,"body":"Ich soll den TE über deinen Post fragen?\nDu schreibst \"Riot hat bereits bemerkt, dass dies bei einigen Spielern passiert (Test in NA und Türkei).\" Und ich frage dich, was du mit \"dies\" meinst.","replies":[{"poster":"HyperionCH","date":"2016-01-20T15:59:31.800+0000","up_votes":1,"down_votes":0,"body":"Da ich auf den Beitrag von Lock-In antwortete (ist aber wohl nur in der Diskussionsansicht erkennbar; nicht wenn man chronologische Ansicht hat), ging es um den Lock-In.\n\nWie erklärt:\nDu hast recht, dass Riot die Lock-In Bestätigung verlangt in der CS.\nJedoch hat Riot wie gesagt auch bemerkt, dass der Lock-In teilweise vergessen wird und deshalb alle aus der CS fliegen. \n\nOb Riot dies wieder ändert (auf die frühere Praxis), ist noch nicht bekannt. Riot wird wohl schauen, wie oft dies passiert bzw. ob sich die Spieler vielleicht rasch daran gewöhnen.","replies":[]}]}]}]}]}]}]}]},{"poster":"ClAO KAKAO","date":"2016-01-20T13:14:40.152+0000","up_votes":1,"down_votes":0,"body":"Ja, ich bin jetzt 2mal rausgeflogen, weil ich nicht gemerkt hab dass ich dran bin - 30 min Wartezeit <3 D:","replies":[]}]}