{"poster":"Iceman96eb96","date":"2018-08-27T20:09:17.302+0000","title":"Ciao a tutti quelli che presteranno ascolto.","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"Volevo sapere ed avere dei commenti sul fatto seguente:\"Perchè non si può implementare la possibilità di segnalare i giocatori (Persone) nella selezione dei campioni?\".\r\nP.S: se esistono risposte a questa domanda chiedo scusa a priori per avervi \"preso\" del tempo per leggere quanto scritto in precedenza e nel caso mi aggiornerò.","replies":[{"poster":"Khail the Crow","date":"2018-08-27T20:50:23.948+0000","up_votes":2,"down_votes":0,"body":"Non ne ho idea. Considerato il gran numero di abusi che avviene pre partita, mi sembra una mancanza importante. Più volte ho visto giocatori cominciare a insultare o trollare in champ select con l'obiettivo di forzare uno dei compagni a dodgare, magari perché erano stati autofillati. Le volte che mi è capitato ho sempre tentato di convincere i compagni a procedere con la partita. A volte il troll dodga, a volte te lo tieni in partita e reporti al temine. Sono le uniche due opzioni ed entrambe hanno poco senso, ma questo abbiamo.","replies":[]},{"poster":"Domanda","date":"2018-08-27T20:16:26.376+0000","up_votes":3,"down_votes":3,"body":"Ciao!! Perchè semplicemente non avrebbe senso reportare in champion select quando lo puoi fare benissimo a fine partita in lobby. Devi considerare che se esistesse il report in lobby, il (probabile) ban non sarebbe istantaneo","replies":[{"poster":"RGM Player","date":"2018-08-27T21:39:20.858+0000","up_votes":2,"down_votes":2,"body":"Il problema è quando uno flamma in champ select e qualcuno dodgia, non puoi più reportarlo. In D1+ sarebbe anche una cosa utilissima per reportare chi \"tiene in ostaggio\" la champ select (ad esempio gli bannano il main oppure è stato autoffilato e per non dodgiare lui picka un troll champ, tipo nunu adc con purificazione e ghost, e costringe gli altri a dodgiare).","replies":[{"poster":"Pellah","date":"2018-08-28T08:13:22.053+0000","up_votes":1,"down_votes":1,"body":"Ah, tutto ciò che concerne i dodge ti assicuro che non è visto negativamente dalla maggior parte dei giocatori di elo alto, probabilmente gli altri 4 se si fossero trovati nella sua stessa situazione (autofillato e magari con un altro compagno o due fuori ruolo) avrebbero anche loro dodgiato o fatto la cosa del trollpick. Alla fine il game era probabilmente perso e le persone che in genere fanno la cosa del trollpick dodgiano comunque all'ultimo momento sperando che qualcuno dodgi prima di loro. Magari comincia a darti fastidio quando ti capita 3/4 volte di fila, ma più che altro perché ti alzi l'attesa da 4 minuti + draft a tipo 15/20 minuti di coda + 3/4 draft.","replies":[]}]}]},{"poster":"Iceman96eb96","date":"2018-08-27T23:45:50.894+0000","up_votes":1,"down_votes":1,"body":"Grazie a tutti dei commenti, davvero grazie.","replies":[]},{"poster":"SacreD20","date":"2018-08-27T22:31:24.499+0000","up_votes":1,"down_votes":1,"body":"Probabilmente verrà integrata nella prossimo season, in pratica se uno in champselect si comporta in modo errato, i suoi compagni possono segnalarlo, e con quattro segnalazioni la partita salta, il tutto era spiegato in un video che parlava anche di \"elo dedicato ad ogni ruolo\" non so se l'hai già visto.\nMa non ne sono sicuri, il rioter non era stato molto chiaro, anche perché sarebbe un sistema abusabile.","replies":[]}]}