{"poster":"Shahidism","date":"2016-04-12T01:59:08.449+0000","title":"Random Lag Spikes (6.7)","subforum":"[ARCHIVED] Help & Support","up_votes":5,"down_votes":1,"body":"In games for the past two days ive been getting constant times where randomly everything stops. I can move my guy a little but I can see my health bar go to zero as enemies hit me. This is only a recent problem, and it started ever sense the new patch.","replies":[{"poster":"Gym Leader Zyra","date":"2016-04-12T03:26:49.628+0000","up_votes":1,"down_votes":0,"body":"I'm getting random ping spikes as well during games. And it's not packet loss. observe the ping to your server below. New patch causing me issues and losing ranked because of it.\n\nPinging 104.160.131.3 with 32 bytes of data:\nReply from 104.160.131.3: bytes=32 time=34ms TTL=59\nReply from 104.160.131.3: bytes=32 time=23ms TTL=59\nReply from 104.160.131.3: bytes=32 time=31ms TTL=59\nReply from 104.160.131.3: bytes=32 time=23ms TTL=59\n\nPing statistics for 104.160.131.3:\nPackets: Sent = 4, Received = 4, Lost = 0 (0% loss)\nApproximate round trip time in milli-seconds:\nMinimum = 23ms, Maximum = 34ms, Average = 27ms","replies":[{"poster":"RiotBok","date":"2016-04-12T19:30:49.172+0000","up_votes":2,"down_votes":0,"body":"That is entirely possible that it's not packet loss in your situation, but based on the information given (mostly no mention of ping spikes), I'm still pretty confident that packet loss is the culprit in OPs case. \n\nI'd still recommend going through the initial troubleshooting steps for ping spikes as well, but if it's still happening, [shoot us a ticket](https://support.riotgames.com/hc/en-us/requests/new) (preferably with logs from the time you're experiencing ping spikes)  and we'll take a look at  what's happening :)","replies":[]}]},{"poster":"RiotBok","date":"2016-04-12T03:03:13.489+0000","up_votes":5,"down_votes":4,"body":"Seems like you're experiencing packet loss.  Good way to tell is whether or not you're having ping fluctuations when this is happening.  No ping fluctuations means it's likely packet loss.  Outside of broader server issues, the cause of packet loss is usually a local network issue.\n\nGo ahead and check out our [Connection Troubleshooting](https://support.riotgames.com/hc/en-us/articles/201752664) guide which should help in identifying the problem (or, best case, fixes it :D)","replies":[]},{"poster":"Tg8RCCWpor","date":"2016-04-12T11:25:16.338+0000","up_votes":2,"down_votes":1,"body":"Please I urge everyone to down vote, and report 'RiotBok' for being a bot. \n\nWe want answers, and not your pathetic generic reply. I'm filling out a support ticket as we speak urging Riot to double check your record.","replies":[]}]}