{"poster":"Gazzelle","date":"2019-02-12T05:33:13.044+0000","title":"Desde cuando ser el unico que no fedea del equipo y pedir report pq estan troleando es flamear?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Acabo de jugar una ranked solo practicamente, gane mi linea bote torre y me agrupe con mi equipo para tratar de ganar la partida, pero que pasa, cada uno de mi equipo va 1/8 y yo 4/0, fuerzan tf en desventaja total y perdemos la partida.\r\nTermina la partida y digo que reporten a mi equipo por fedear y me dicen, te vas report por flamer, ok?.\r\nComo es posible que sea el unico que este jugando la partida en mi equipo y sea el unico que reportan, por pedir report?","replies":[{"poster":"SLT Pryde","date":"2019-02-12T07:53:08.919+0000","up_votes":2,"down_votes":0,"body":"Literalmente no sabemos nada mas, la unica \"prueba\" que hay es lo que decis de que \"jugaron mal y yo bien\", no sabemos si les estuviste diciendo cosas durante la partida (algo que nunca nadie dice y tampoco pone pruebas), o si ellos realmente trolleban ya que, una cosa es jugar mal (intear) y otra cosa intear a proposito con el objetivo de joder simplemente {{sticker:sg-ahri-2}}","replies":[]},{"poster":"FL Nordin","date":"2019-02-12T05:34:41.032+0000","up_votes":2,"down_votes":0,"body":"Aunque no lo creas, no es que estés flameando. Simplemente es Actitud Negativa.","replies":[]},{"poster":"Deigex","date":"2019-02-13T01:21:54.860+0000","up_votes":1,"down_votes":0,"body":"Feedear no es reportable, lo reportable es suicidarse bajo la torre enemiga 10 veces \"intencional feeding\" el empezar a pedir report, o molestar a tu equipo es una actitud negativa, no es que porque le digas a un compañero deja de morir, va a magicamente dejar de hacerlo,  además hay veces en las que si vas mal literalmente vas a vivir muriendo y es preferible seguir intentando hacer algo que el intentar estar bajo la 4ta torre farmeando un minion sin aportar nada. Eso diferencia muchas veces a un buen y mal jugador.","replies":[]},{"poster":"RecorcholyS","date":"2019-02-12T23:13:53.902+0000","up_votes":1,"down_votes":0,"body":"Pedir report es motivo de sancion desde el principio de los tiempos amigo","replies":[]},{"poster":"ElCochinoLarryxD","date":"2019-02-12T06:53:59.382+0000","up_votes":2,"down_votes":2,"body":"Desde que el soporte defiende a los trolles y no les puedes decir nada viejo ahora hasta por decir gg wp te pueden banear por \"flamer\" pero anda a reportar a un troll, a un eloboosted por que te dicen una infinidad de cosas para no castigarlo xd aca el flamer es el gran problema y los trolls, afk, y eloboosted son el gran futuro del juego {{sticker:sg-janna}}","replies":[]}]}