{"poster":"GunTool","date":"2016-05-29T22:10:07.079+0000","title":"Chat ausstellen?","subforum":"Spielerverhalten & Moderation","up_votes":5,"down_votes":2,"body":"Hey Liebe Community,\r\nalso meine Frage ist ob man den Chat austellen kann?\r\nIch bin echt nen ziemliches ragekid tbh is traurig aber wahr und so ist es halt was soll ich machen ... 5-6 runden spiele ich v&ouml;llig normal nehm das hin wenn jemand reinschei&szlig;t oder sogar ich selber aber ab dann wirds meist kritisch und kleine dinge bringen mich zum tilten ... jeder kennt die kettenreaktion: du belegst dein Team, dein Team belegt dich, keiner konzentrierst sich mehr aus game =&gt; Game lost GZ ...\r\nIch f&auml;nds nice wenn ich den Chat ausschalten k&ouml;nnte oder evt mir selber die M&ouml;glichkeit nehmen k&ouml;nnte mich am Chat zu beteiligen :)\r\n\r\nIch wei&szlig; jetzt kommt wieder &quot;ja komm Kunde dann halt einfach dein Maul und flame nicht blabla...&quot; aber es ist halt wie es ist und ich will einfach weiter League spielen und wenig motiviert nen perma zu bekommen :)\r\n\r\nlustiger funfact im reallife bin ich keinen meter so sondern komplett ausgeglichen und eher ruhig :D also internetgangster sh&uuml;sh\r\n\r\ndanke f&uuml;r die Hilfe =){{champion:67}}","replies":[{"poster":"Wernicke","date":"2016-05-30T04:25:33.498+0000","up_votes":5,"down_votes":0,"body":"> lustiger funfact im reallife bin ich keinen meter so sondern komplett ausgeglichen und eher ruhig :D also internetgangster shüsh\n\nDas ist kein lustiger funfact, sondern leider traurige Realität. Im echten Leben immer schüchtern in der Ecke stehen und dann im Inet meinen die Anonymität zu nutzen und einen auf dicke Hose machen. Andere Beleidigen als wäre man der ober King, aber wenn man denjenigen im echten Leben gegenüber stehen würde, sich in die Hose machen... Tja^^","replies":[{"poster":"eingew","date":"2016-05-30T09:28:05.152+0000","up_votes":2,"down_votes":0,"body":"Ich würde nach wie vor sagen, dass Anonymität dabei nur geringfügig eine Rolle spielt. Im echten Leben ist man kein King, weil man nicht als solcher behandelt wird. Im Internet... welche Behandlung erfährt man da schon groß? Man liest ein bisschen Text, soweit so gut, aber man kann aktiv dagegen halten, gefühlt ohne jegliche Konsequenz. Man hat keine Mimik, keine Körperhaltung, keine laute Stimme, keine Verachtung, nahezu nichts, was einem irgendwie zeigen könnte, in was für große Fettnäpfchen man tritt. Man sieht einfach die Reaktionen nicht. Selbst wenn man kontra bekommt ist es nur ein bisschen Text.\n\nIch meine... ich weiß ja nicht wie es dir geht, aber ich habe noch nie, wenn ich irgendwo online war, nie in meinem Leben gedacht ich könne tun und lassen, was ich will, weil ich anonym sei. Der springende Punkt ist doch die Konsequenzlosigkeit. Ich kann machen was ich will, weil mir dabei nichts passieren kann.","replies":[]},{"poster":"Lasse Laufen","date":"2016-05-30T10:54:26.252+0000","up_votes":1,"down_votes":0,"body":"Es liegt halt an den Konsequenzen, im Internet kann ja durch so eine Ausdrucksweise nicht vieles geschehen. Wenn ich im RL in meinem Dörfchen so wäre, würde sich das schon verbreiten usw.\nWenn man sich im RL halt sicher wäre das es nur zwischen der Person und einem selber bleibt würde es vermutlich auch anderst aussehen. Zwar nicht so wie im Internet, aber trotzdem anderst.","replies":[]},{"poster":"GunTool","date":"2016-05-30T08:46:15.868+0000","up_votes":1,"down_votes":0,"body":"Ich meine weniger in der Ecke stehen und den Mund halten als einfach nur tiefenentspannt sein =)","replies":[]}]},{"poster":"Darkr3sQ","date":"2016-05-30T04:33:43.899+0000","up_votes":4,"down_votes":0,"body":"Mal ne ganz dumme Frage:\nWürde es Dir helfen, wenn Du einfach nach 4 bis 5 Spielen ne Pause machst und zum Runterkommen einfach was anderes ne zeit lang spielst?","replies":[{"poster":"GunTool","date":"2016-05-30T08:48:27.475+0000","up_votes":1,"down_votes":0,"body":"eig ne coole Idee yau :D\nhast du nen paar Spiele die du empfehlen kannst? :)","replies":[{"poster":"eingew","date":"2016-05-30T09:31:14.919+0000","up_votes":1,"down_votes":0,"body":"Ich würde an dieser Stelle einfach mal einhacken: Nichts kompetitives. Alles, wo dein Team oder du etwas massiv (oder geringfügig) falsch machen kann würde ich weg lassen. Ein guter Singleplayer. Irgendetwas, wo du dich mit niemandem messen musst und nicht beleidigt werden kannst.","replies":[]},{"poster":"Darkr3sQ","date":"2016-05-30T09:21:59.454+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GunTool,realm=EUW,application-id=KYnfKGf0,discussion-id=bIJouig6,comment-id=00040000,timestamp=2016-05-30T08:48:27.475+0000)\n>\n> eig ne coole Idee yau :D\n> hast du nen paar Spiele die du empfehlen kannst? :)\n\nIch selbst bin eher weniger der Spieler. Kommt halt auch immer darauf an, was für Spiele du gerne spielst. Kannst dann ja mal nach dem Genre entsprechend googlen, und schauen ob da was dabei ist...","replies":[]}]}]},{"poster":"χøιυτίση","date":"2016-05-29T22:16:47.557+0000","up_votes":2,"down_votes":0,"body":"Ganz abschalten lässt sich der Chat nicht.\n\nEs gibt erstens die Möglichkeit, am Anfang des Spiels den Befehl \"/mute all\" in den Chat zu schreiben, dann wirst du keine Nachrichten von den Mitspielern und Gegnern im Chat erhalten.\n\nAlternativ kannst du den Chat per Drag-and-Drop aus deinem Bildschirm ziehen (oder zumindest ganz an den Rand des Bildschirms), dann sollte er dich auch nicht mehr stören.\n\nHoffe, dass dir das etwas hilft. Denke einfach daran, wenn du etwas negatives im Chat schreibst, wird meisten auch etwas negatives zurückkommen (also am besten gar nicht erst anfangen zu schreiben und einfach aufs eigene Spiel konzentrieren).  :)","replies":[{"poster":"Living Tempest","date":"2016-05-30T12:40:13.580+0000","up_votes":2,"down_votes":0,"body":"Er muss ja den Chat nicht sehen um etwas zu schreiben, daher wird das nicht helfen. :I\nHab aber selber auch grad so ne Tilt-Phase","replies":[]}]},{"poster":"Lasse Laufen","date":"2016-05-30T10:46:56.936+0000","up_votes":2,"down_votes":0,"body":"Unter den Optionen kannst du zuerst mal den All-Chat ausschalten.\nDanach kannst du das Chat Fenster ganz groß einstellen  (Optionen) und unten Links in eine Ecke ziehen (das man nur noch ein Rahmen-Ecke sieht).\nDann wieder unter den Optionen Chat so klein wie möglich stellen und er ist nicht mehr da.\nZudem alle von Beginn an Muten. Damit müsste dir die \"Freude\" fehlen dich am Chat zu beteiligen.","replies":[]},{"poster":"GameFireAction","date":"2016-05-29T22:24:31.056+0000","up_votes":2,"down_votes":0,"body":"Du kannst den Bereich auf deinem Bildschirm in dem der Chat ist einfach abkleben! :D\nEchte Netzgangsta nehmen dafür Panzertape!\n\nOder deine Entertaste vor dem Game \"ausbauen\" und irgendwo in ein anderes Zimmer bringen.\n\nWenn du so bist, dann bist du so. Du kannst es halt ne Zeit unterdrücken, aber es kommt irgendwann raus.\nIch glaube Psychologisch gibt es da jetzt erstmal keine schnelle Lösung. Es dir Physich einfach nicht möglich machen zu schreiben sollte da aber helfen.","replies":[{"poster":"Lagbeard","date":"2016-05-30T12:12:58.045+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GameFireAction,realm=EUW,application-id=KYnfKGf0,discussion-id=bIJouig6,comment-id=0001,timestamp=2016-05-29T22:24:31.056+0000)\n > Oder deine Entertaste vor dem Game &quot;ausbauen&quot; und irgendwo in ein anderes Zimmer bringen.\n> \n\n\nAlternative dazu: Heftzwecken mit der Spitze nach oben auf die Taste kleben.","replies":[{"poster":"GameFireAction","date":"2016-05-30T12:28:29.230+0000","up_votes":1,"down_votes":0,"body":"Ein echer Rager lässt sich von nem kleinen Stich nicht aufhalten!{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Lagbeard","date":"2016-05-30T18:19:13.791+0000","up_votes":1,"down_votes":0,"body":"Wenn ich dich aufhalten will, reporte ich dich \n{{sticker:slayer-jinx-unamused}}  \n\n#thuglife","replies":[{"poster":"GameFireAction","date":"2016-05-30T22:28:23.706+0000","up_votes":1,"down_votes":0,"body":"Gangsta reporten nicht!{{sticker:zombie-brand-clap}}","replies":[{"poster":"Lagbeard","date":"2016-05-31T07:29:28.986+0000","up_votes":1,"down_votes":0,"body":"Du hast das Prinzip nicht verstanden. RIOT ist nicht di Polizei. RIOT ist der Pate.\n{{sticker:zombie-brand-mindblown}}","replies":[]}]}]}]}]},{"poster":"GunTool","date":"2016-05-30T08:47:57.661+0000","up_votes":1,"down_votes":0,"body":"is eig ne coole Idee :D weil wie gesagt der ganze mute all shizzle hilft mir recht wenig da ich der retard bin der andere flamt ^^","replies":[]}]},{"poster":"InsaneReiberdeus","date":"2016-06-26T18:09:28.791+0000","up_votes":1,"down_votes":0,"body":"/mute all - oder Chatfenster aus dem Bild schieben.","replies":[]},{"poster":"je suis dat boi","date":"2016-05-31T20:59:51.020+0000","up_votes":1,"down_votes":0,"body":"wäre praktisch, dann wäre ich auch nicht permabanned. ich flame nur normalgames, weil ich die härtesten spacken ins team bekomme.\n\nranked  ist nie ein problem, aber normal matchmaking ist komplett kaputt","replies":[]},{"poster":"Snowgen","date":"2016-05-30T18:29:49.087+0000","up_votes":1,"down_votes":0,"body":"Mute direkt alle Spieler oder entferne deine Enter Taste. Müsste helfen","replies":[]},{"poster":"Kyphoxia","date":"2016-05-30T00:15:17.667+0000","up_votes":1,"down_votes":0,"body":"Mute einfach alle Spieler.","replies":[{"poster":"Megamaexx","date":"2016-05-30T04:50:33.982+0000","up_votes":1,"down_votes":0,"body":"Ich glaube er will uns sagen, dass er beginnt und nicht nur reagiert.","replies":[{"poster":"GunTool","date":"2016-05-30T08:46:57.459+0000","up_votes":1,"down_votes":0,"body":"Si si =) und da liegt das Problem ;)","replies":[{"poster":"Megamaexx","date":"2016-05-30T10:15:34.584+0000","up_votes":1,"down_votes":0,"body":"Na dann demontiere deine Enter-Taste ;) \nKann man die nicht umverlegen? Einfach auf eine andere Taste legen und wenn du dann wutentbrannt die Enter-Taste drückst, wirst du bemerken, dass der Chat nicht aktiv wird und bis dahin sollte dich der Verstand wieder eingeholt haben.","replies":[]}]}]}]}]}