{"poster":"CabArg","date":"2018-10-21T21:29:33.482+0000","title":"Rival honorable","subforum":"Comportamiento del jugador","up_votes":29,"down_votes":0,"body":"Ser&iacute;a bueno que vuelva la posibilidad de dar honor a los rivales","replies":[{"poster":"ToxicRunner","date":"2018-10-21T21:34:01.549+0000","up_votes":9,"down_votes":0,"body":"Sería bueno, hay veces que tocan esos rivales que son un amor de persona y que merecen más honor que cualquiera de tu equipo.","replies":[]},{"poster":"NeoGibiky","date":"2018-10-21T21:43:28.646+0000","up_votes":1,"down_votes":4,"body":"Que paso la ultima vez que estaba el honor para el rival? se le daba honor a los trolles por regalar la partida .-. ergo se saco el honor al rival","replies":[{"poster":"schiavoni","date":"2018-10-21T22:03:46.295+0000","up_votes":3,"down_votes":4,"body":"y que tiene de malo? yo le doy honor al 0/42 que al flamer que va 20/2","replies":[{"poster":"Kousac","date":"2018-10-22T02:09:27.937+0000","up_votes":1,"down_votes":1,"body":"Yo también","replies":[{"poster":"SifGreatGreyWolf","date":"2018-10-22T14:27:40.125+0000","up_votes":6,"down_votes":0,"body":"Yo a ninguno, los reporto a ambos","replies":[{"poster":"HarpaX","date":"2018-10-23T02:03:56.571+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]},{"poster":"SpectreChazer","date":"2018-10-21T22:29:14.874+0000","up_votes":1,"down_votes":1,"body":"Depende de la persona. Tu darías rival honorable al troll del team enemigo? Si la respuesta es no, entonces no hay razón para quejarte de su implementación. Además... Tampoco es como si tener mucho honor sirviera de algo, la recompensa es muy poca por llegar a Honor 5 y tardas mucho en alcanzarlo. \n{{sticker:sg-lulu}}","replies":[{"poster":"NeoGibiky","date":"2018-10-21T23:17:03.907+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Kono Dio Da,realm=LAS,application-id=PJAKt7ph,discussion-id=WbhOIsAE,comment-id=00010001,timestamp=2018-10-21T22:29:14.874+0000)\n>\n> Depende de la persona. Tu darías rival honorable al troll del team enemigo? Si la respuesta es no, entonces no hay razón para quejarte de su implementación. Además... Tampoco es como si tener mucho honor sirviera de algo, la recompensa es muy poca por llegar a Honor 5 y tardas mucho en alcanzarlo. \n> {{sticker:sg-lulu}}\n\nSe nota que no conoces la comunidad amigo xD aqui fedean y le dan honor y lo felicitan, aqui todo sea por ganar el \"honor\" no existe hace mucho que nadie juega con honor xD","replies":[{"poster":"Nísta","date":"2018-10-21T23:26:36.620+0000","up_votes":3,"down_votes":0,"body":"Si trolleas intencionalmente entonces es obvio que te va a caer el ban","replies":[{"poster":"Shikuh","date":"2018-10-23T19:17:12.623+0000","up_votes":1,"down_votes":0,"body":"no es como que puedas trollear sin querer...","replies":[{"poster":"Nísta","date":"2018-10-23T20:22:54.612+0000","up_votes":2,"down_votes":0,"body":"Yo tengo en mente dos formas de trollear, uno en el que sea pickear algo poco común pero con intenciones de ganar,\nhttps://imgur.com/a/bfmff0v\n y después tenes al hijo de Trundle que sale 0/17\nhttps://imgur.com/a/mn78gNq","replies":[{"poster":"Shikuh","date":"2018-10-23T22:20:34.366+0000","up_votes":1,"down_votes":0,"body":"A ver, para que quede claro, trollear es siempre una acción intencionada. Las personas que trollean buscan provocar a alguien de forma intencionada. Trollear es trollear, si lo haces, es porque intencionalmente quieres perjudicar a tu equipo de alguna manera.\n\nPickear un champ poco común con intención de ganar no es trolleo ni por donde lo mires. Que te vaya mal en una partida tampoco es trollear. Lo que si es trollear es quedarte en base bailando, correr hasta la base enemiga para que te maten, etc. Hay una intención de por medio, ¿lo entiendes?\n\nMucha gente hoy piensa que perder tu linea es trollear, lo que es suficuente razón para reportar. Es absurdo.","replies":[]}]}]}]}]},{"poster":"HarpaX","date":"2018-10-23T02:06:25.993+0000","up_votes":1,"down_votes":1,"body":"El OP esta hablando de cuando sale un rival honorable de verdad, si nadie se lo merece no le va a dar honor a nadie, obviamente.\nAntes se podia, y le habre dado honor a unos 6 o 7 rivales en toda la temporada. Cuando toca un rival digno es triste no poder mostrarle ese \"respeto\"\n\n\npd: IS THAT A JOJO REFERENCE?","replies":[]}]},{"poster":"Sir Galihud","date":"2018-10-22T00:02:35.995+0000","up_votes":1,"down_votes":0,"body":"Y si los únicos que les pudieran dar honor a los rivales fuesen los de Honor 5? ahí no cambiaría un poco la cosa...?","replies":[{"poster":"Del0reaN","date":"2018-10-22T00:32:11.133+0000","up_votes":2,"down_votes":0,"body":"En realidad no. No creo que cambie mucho ser más honorable.\n\nDe todos modos, una posible solución sería que, si el usuario al que se le entrega honor es reportado justificadamente por su propio equipo, el honor recibido se anule y se lo penalice. Así, se evitaría que usuarios troleen la partida y pidan honor a sus rivales.","replies":[]}]},{"poster":"Nabuze","date":"2018-10-22T15:25:41.621+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NeoGibiky,realm=LAS,application-id=PJAKt7ph,discussion-id=WbhOIsAE,comment-id=0001,timestamp=2018-10-21T21:43:28.646+0000)\n>\n> Que paso la ultima vez que estaba el honor para el rival? se le daba honor a los trolles por regalar la partida .-. ergo se saco el honor al rival\n\nEsta no es ni de cerca la razón por la cual lo sacaron \n{{sticker:sg-miss-fortune}}","replies":[]}]},{"poster":"TheKiller Justin","date":"2018-10-22T14:23:09.057+0000","up_votes":5,"down_votes":0,"body":"+1\nMuchas veces me quedé con las ganas de dar honor a esos rivales que juegan como Dios, que son buenas personas  y amables <3\nA demás ayudaría a que la gente diga menos \"gg izi / ez / easy\" y todo eso, porque si no lo decís es mas probable recibir honor rival :v","replies":[{"poster":"HarpaX","date":"2018-10-23T02:03:15.579+0000","up_votes":3,"down_votes":0,"body":"ComoSiEsasCosasPasaran.jpg\n\nAhora en serio, antes se podia (cliente anterior) y era genial darle honor a los pocos rivales honorables que tocan. \nCasi nunca hay, pero las pocas veces que encuentras uno es triste no poder \"recompensarlo\" o felicitarlo de alguna manera...","replies":[]}]},{"poster":"valennapo3","date":"2018-10-22T12:51:28.130+0000","up_votes":2,"down_votes":0,"body":"te doy mi like \n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Mona","date":"2018-10-22T12:19:35.676+0000","up_votes":2,"down_votes":1,"body":"No va a volver porque fomenta la toxicidad. En Korea se usaba para marcar a alguien \"malo\", si llegabas a tener la banda roja de rival honorable era prácticamente una marca de la muerte.","replies":[{"poster":"CabArg","date":"2018-10-28T13:57:04.602+0000","up_votes":1,"down_votes":0,"body":"No entiendo eso de que lo marcaban. A que te refieres con la banda de la muerte ? \nEn este sistema serviría para subir mas rápido de nivel de honor por lo menos eso pienso yo despues lo de los troles es otra discusión. Porque con el criterio de pensar en eso de los troles se debería sacar los reports entonces porque cuando te cruzas con premades y me pasó que te va mal en una partida y juegas mal entonces terminan reportandote todos","replies":[{"poster":"Mona","date":"2018-10-28T16:45:56.446+0000","up_votes":1,"down_votes":0,"body":"Te daban el honor de rival honorable si consideraban que eras un rival fácil, si te daban mucho recibías la banda, si tenías la banda significaba que eras malísimo y así.","replies":[]}]}]},{"poster":"Urxnium","date":"2018-10-30T00:19:57.726+0000","up_votes":1,"down_votes":0,"body":"Ojalá que lo traigan de vuelta, era hermoso ver que el equipo enemigo iba horrible y como 1 o 2 jugadores trataban de dar vuelta el juego.","replies":[]},{"poster":"Tamanduá Mâluco","date":"2018-10-26T03:15:29.012+0000","up_votes":1,"down_votes":0,"body":"Estaría bueno que vuelva, y que la gente en vez de identificar al enemigo en su propio equipo y pedir report al que fue stompeado, mejor aprenda a aceptar y felicitar que su rival fue mejor, cual apretón de manos después de un encuentro en cualquier otro deporte REAL","replies":[]},{"poster":"Annakiya","date":"2018-10-24T15:49:04.674+0000","up_votes":1,"down_votes":0,"body":"Yo solía darle por ejemplo a los que trataban de ganar a pesar de tener un troll y eso. Es necesario ese honor {{sticker:cass-cry}}","replies":[]},{"poster":"Rick Silence","date":"2018-10-22T00:40:01.098+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]}]}