{"poster":"DeadlyPudding02","date":"2016-08-22T22:11:25.333+0000","title":"Riot please fix your leaverbuster","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I recently got a ban for having my computer crash, but not only did I come back and play in the game but I took two turrets and an inhibitor in a match of ARAM. I feel like i was unfairly punished and would like to see some repercussions.","replies":[{"poster":"rikkuu","date":"2016-08-23T04:27:24.903+0000","up_votes":2,"down_votes":2,"body":"Wow what a brute answer basically telling people ( hey we dont care if your computer sucks we have a system that automatically bans people that it thinks are trolls so sorry dude your out of luck) As if they dont have the power over their own systems that they design to obviously help a victim of a random crash trying to contribute to their community they should really up their customer support because when you think about it league would be nothing with out us and they are so big with all the money they are bringing home they could care less about one complaint to actually ( hey riot i think this could be a issue because I didnt mean to do it why should i be punished) as if we can control technology from its natural random disasters of memory leaks or any type of errors that can occur.\nWELL PLAYED","replies":[{"poster":"Periscope","date":"2016-08-23T13:40:53.978+0000","up_votes":1,"down_votes":1,"body":"> as if we can control technology from its natural random disasters of memory leaks or any type of errors that can occur.\n\nPretty sure you can just buy a new computer. Regardless, being AFK from games negatively impacts it for the other players. Are the other players supposed to share this same sympathy?","replies":[{"poster":"DeadlyPudding02","date":"2016-08-24T02:20:14.074+0000","up_votes":2,"down_votes":0,"body":"i don't have hundreds and hundreds of dollars to throw around for a new computer and someone from that match that i crashed from then came back to said that we won because of my push so i don't think the were affected negatively.","replies":[{"poster":"Periscope","date":"2016-08-24T03:13:58.547+0000","up_votes":1,"down_votes":0,"body":"I definitely sympathize with your plight, but Rikku seemed to take it a step further. I got a mac, which generally isn't kind to disconnects (1-2min relaunch to get back in the match). Hopefully you get your issue figured out.","replies":[]}]}]}]},{"poster":"Targons Blade","date":"2016-08-22T23:45:43.161+0000","up_votes":1,"down_votes":0,"body":"Disconnecting from a match negatively impacts everyone in it, regardless of intent. This is a key reason why the [Leaverbuster system](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ) treats all disconnections equally and why penalties cannot be removed or modified.\n\nIf you're seeing continuous crashes, please give me more details about error messages or what specifically happens so I can assist you in solving it. Let me know if you have any questions.","replies":[{"poster":"DeadlyPudding02","date":"2016-08-23T01:20:03.239+0000","up_votes":1,"down_votes":0,"body":"The crashing problem is not with the game my computer crashes and then i get back in game and still get leaverbusters","replies":[{"poster":"alaskangarcia","date":"2016-08-23T02:41:07.207+0000","up_votes":2,"down_votes":0,"body":"even if your computer crashes once it wont give you a leaver buster for one offence when you get the leaver buster it is cause you also recently disconnected from prior games so the system decides to give you the penalty for the games left","replies":[{"poster":"DeadlyPudding02","date":"2016-08-23T03:11:21.886+0000","up_votes":1,"down_votes":0,"body":"I had not left any games for a month or more so i feel like I'm getting the short end of the stick.","replies":[]}]},{"poster":"Targons Blade","date":"2016-08-23T18:23:24.159+0000","up_votes":1,"down_votes":0,"body":"Can you give me a bit more detail on how/when it crashes? Also do you happen to be running Windows 10?","replies":[{"poster":"DeadlyPudding02","date":"2016-08-24T02:17:41.854+0000","up_votes":1,"down_votes":0,"body":"I am running windows 10 but my laptop is on it's last legs and likes to power down whenever it comes unplugged, (the plug is really loose so it can just fall out some times), or it will just randomly reboot.","replies":[{"poster":"Targons Blade","date":"2016-08-24T16:19:35.650+0000","up_votes":1,"down_votes":0,"body":"Well, I recommend finding a way to secure that power adapter plug so it's less likely to fall out. As for your random reboot issue, do you see any blue screens or other error messages when that happens? Our [Bugsplat & Crash guide](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes) is likely to address the common causes for this, as most of the time the cause is a windows configuration","replies":[{"poster":"DeadlyPudding02","date":"2016-08-24T16:51:35.836+0000","up_votes":1,"down_votes":0,"body":"i don't see any error messages or anything of the sort my computer just restarts itself so i have to wait for it to reboot, as for the power adapter i cant really secure it because the way it plugs in there is a little notch inside of the computer that's messed up so it's like a landmine that i don't want to touch.","replies":[{"poster":"Targons Blade","date":"2016-08-25T15:39:49.056+0000","up_votes":1,"down_votes":0,"body":"Gotcha. So I've had to use a few laptops in a similar state (battery doesn't hold a charge, if AC adapter becomes unplugged, entire PC instantly loses power). The way that I was able to use those and reduce the chances of it losing power due to the plug falling out was to sit the laptop on a solid surface such as a desk or table, then sit the power adapter on the desk right next to the laptop. I used cable ties or velcro strips to wrap up the slack in the cabling, then avoided touching the power adapter like the plague. I know this is a lengthy description, so I've drawn out what I mean using MS Paint below:\n\nhttp://imgur.com/a/3ZK60\n\n\n\nBy the way, did the steps inside the bugsplat & crash guide help at all?","replies":[{"poster":"DeadlyPudding02","date":"2016-08-28T21:04:25.382+0000","up_votes":1,"down_votes":0,"body":"i didn't have to use the bugsplat or crash guides because my computer did a random reboot in the middle of the match so it had no crash guides i was just stuck waiting for it to boot up","replies":[{"poster":"Targons Blade","date":"2016-08-29T18:06:10.920+0000","up_votes":1,"down_votes":0,"body":"I see. Do you know what caused that random reboot? If it wasn't something scheduled like Windows updates, then it was likely a factor either touched on inside the guide or with the power plug's placement, which I showed in the picture.\n\nLet me know if you're still experiencing issues.","replies":[]}]}]}]}]}]}]}]}]}]}