{"poster":"Toxical","date":"2016-10-11T22:38:47.189+0000","title":"ich mache zu wenig schaden als adc :(","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo, \r\nFolgendes Problem.\r\n\r\nWenn ich meine stats mach dem game anschaue ist es ziemlich oft der Fall das ich einfach keinen schaden an gegnern gemacht habe. \r\nAlso vllt. Nen bissel mehr als der Sup...\r\n\r\nIst das Normal bzw. Kommt es &ouml;fter vor das man als ADC so wenig schaden macht bzw. An den man bringt? \r\n\r\nIch versuche auch immer bei den Fights dabei zu sein etc. Deshalb verstehe ich das einfach nicht... Oder soll ich einen mist auf die stats geben?","replies":[{"poster":"Andrej553","date":"2016-10-12T08:31:57.802+0000","up_votes":3,"down_votes":0,"body":"Das wichtigste: Immer Autoattacken! \nDas klingt offensichtlich aber was viele nicht tun: Greif Tanks an. Als ADC kannst du nicht die gegnerischen carries fockusen sondern musst den anderen Tank/Assasin/Bruiser kiten und dabei immer angreifen zwischendurch. Haben diese 1-2 Rüstungsitems hol dir LW.","replies":[{"poster":"CYPHΕR","date":"2016-10-12T11:04:20.034+0000","up_votes":2,"down_votes":0,"body":"Oder um es anders auszudrücken:\n\nAls ADC attackierst du in dem Teamfights immer den Gegner, den du am gefahrlosesten und einfachsten von deiner aktuellen Position aus angreifen kannst (was im Normalfall die gegnerischen Tanks/Bruiser/Assasinen sind die auf dich zustürmen).","replies":[]}]},{"poster":"V3IG4R HQ","date":"2016-10-12T11:35:25.717+0000","up_votes":2,"down_votes":0,"body":"Einen Mist auf die Stats geben? Was hier viele geschrieben haben ist kompletter Unfug. Stats alleine entscheiden keine Spiele, sind aber ein sehr präziser Indikator dafür, wie du dich schlägst im Spiel (kurze + lange Sicht). Dementsprechend ist es gut, dass du dir Gedanken darüber machst. \n\nADC ist eine der schwierigsten, wenn nicht die schwierigste Rolle im Spiel. Ein guter ADC hat enormes Spielknowledge, ist mechanisch stark und bleibt stets abgeklärt. Natürlich sind die meistens Midlaner mechanisch komplexer, aber auch ein sauberer Umgang mit Orbwalking als ADC braucht sehr viel Übung und Timing. Du solltest ausserdem jegliche Champs, deren Spells und Range kennen um abzuschätzen, wo du dich jeweils platzieren musst, um das beste aus der Situation rauszuholen. Fast alle lowelo ADC's machen den Fehler, nicht zu kiten. Sie versuchen von einer Leblanc mit Gapcloser stur und panisch wegzurennen, ohne sie auch nur einmal anzugreifen. In dieser Situation einfach immer wieder mit dem Attackmove einen Shot raushauen und sofort weiterlaufen. Bei LB sollte man unbedingt noch Richtungswechsel einbauen weil Outplay-Potenzial besteht, wenn sie die Skillshots verfehlt. \n\nDa sind wir auch schon bei den zwei nächsten, extremst wichtigen Punkten für ADC's: Der Attackmove und dodgen. Es ist unerlässlich, dass du ein gutes Gespür für dein Movement entwickelst. Wenn dich jeder Blitz-Grab trifft, spielst du die falsche Rolle. \nAuch solltest du auf der Lane wann immer möglich poken.","replies":[]},{"poster":"Zulwar","date":"2016-10-12T06:17:30.997+0000","up_votes":1,"down_votes":0,"body":"Ich würde einen Mist darauf geben.\nDenn was bringt dir das?\nHast du in den Teamfights, das Gefühl denn auch? Das finde ich nämlich wichtiger.\nWenn ja, mach dir Gedanken über deine Itemwahl und schau ob du diese vielleicht optimieren kannst. Manchmal muss man auch nur die Reihenfolge der Items ändern um das Gefühl des mehr Schadens machen zu erhalten.\nWenn du dann immer noch das Problem hast, würde ich sagen, lern besser zu farmen. Denn dein Farm ist wie meiner einfach nur schlecht. Dann hast du mehr Gold in deinen Spielen zur Verfügung und machst somit auch mehr Schaden.\n\nIch fasse mal zusammen.\nbesser farmen = mehr Gold = früher Schaden\ngut Positionieren = weniger Schaden erhalten = mehr Schaden machen\nItems zur richtigen Zeit / Reihenfolge kaufen = früher Schaden\n\nIch hoffe, das das dir geholfen hat.","replies":[]},{"poster":"Der Bauer ","date":"2016-10-12T05:59:19.204+0000","up_votes":1,"down_votes":0,"body":"naja einmal ein mist auf die stats geben und du musst deine items anpassen bzw wenn die Gegner vierl Rüstung haben geht's du auf armor pen haben sie nicht viel Rüstung gehst du auf kritischen treffer {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Freiherr Alex","date":"2016-10-12T05:22:13.037+0000","up_votes":1,"down_votes":0,"body":"Denke es kommt auch Stark drauf an was man Spielt.\nWenn du z.B. Twitch, Kalista oder ähnliche ADC spielt, wo man sich als erstes Item i.d.R. nen AS Item holt (Huricane auf Twitch z.B.) machst du nunmal nicht sehr viel DMG. Das kommt dann erst im Late wo noch nen IE oder ein BT dazu kommt. vielleicht solltest du auch einfach mal andere ADC probieren die du sonst nicht so spielst einfach um mal nen Vergleich zu haben.","replies":[]},{"poster":"D4RKEVA","date":"2016-10-11T23:38:06.406+0000","up_votes":1,"down_votes":0,"body":"Adc ist halt keine einfache rolle\n\nIch als gegenteil habe eigentlich immer schaden in den top 3 des games meist jedoch nr.1 als adc selbst bei looses.\n\n\nKann jetzt nicht nachschauen und müsste eh mehr wissen aber es sollte durch:(alles annahmen)\n-fehlenden harras beim farmen des gegner in der lane \n-\"schlechtes\" positioning\n-an zu wenig fights beteiligt\n-schlechtes nutzen von powerspikes\n-viele tode?\nsowie \nallgemein dein spielverhalten entstehen.\n\nHabe heute mit einem freund als support (er adc) gespielt und fast geheult weil er do viel falsch gemacht hat und schlussendlich war er deutlich behind und hatte weniger dmg als 7 personen im game wobei er eigentlich gar nicht so stark ausm game genommen wurde von den gegnern, das tat er selber :/","replies":[]},{"poster":"Nivoras","date":"2016-10-11T23:00:06.237+0000","up_votes":1,"down_votes":0,"body":"Die Zeiten wo ich noch mehr ADC gespielt habe sind lange her, weil ich vor dem selben Problem stand wie du und einfach keinen Schaden gemacht haben, selbst wenn ich das Gefühl hatte ich hätte gut gespielt, während manche Freunde von mir das ez den Most Dmg im Team hatten wenn sie ADC spielen.\nich war halt auch echt schei*e als ADC, das kann man nicht anders sagen, und damit hing dann wohl auch der Schaden zusammen. \nZuuu sehr würde ich mich aber auch nicht auf den Schaden versteifen, er zeigt natürlich in gewisser Weise an wie viel du zu den Kills tatsächlich beigesteuert hast usw, aber es hängt auch extrem von der Länge des Spiels ab. Bei einem 20 Minuten Spiel, wo eine Vayne nicht komplett ihre Lane zerstört hat, wäre es kein Wunder wenn sie vlt sogar weniger Schaden als eine Nami hat, da sie stark von ihren Items abhängt.\nEs gibt einfach zu viele Faktoren die da mit reinspielen, Spiellänge, Skalierung deines Champs, usw usf. \nDas wäre zumindest die bescheidene Meinung eines Gold-4 Spielers, vlt sagen andere das du unbedingt viel Schaden machen musst. Ich zumindest spiele wesentlich besser, wenn ich nur spiele um die Rolle an sich besser zu spielen, und nicht um gute Stats zu haben, das wirkt sich bei mir dann eher negativ aus, und wenn ich den Champ  oder die Rolle ganz gut kann kommt der Schaden auch irgendwann ganz von alleine denke ich^^","replies":[]}]}