{"poster":"FOCU5 ON IMPROVE","date":"2015-07-09T05:29:45.620+0000","title":"Verdiene ich eine mildere Bestrafung? Was denkt ihr?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":10,"body":"Ich wei&szlig; ich habe mich sehr kindisch verhalten und m&ouml;chte mich hiermit auch bei der Community entschuldigen, obwohl ich gegen dich, du der das gerade liest wahrscheinlich nicht gespielt hab. Trotzdem musstest genau du wahrscheinlich schon unter Spielern wie mir leiden. Das tut mir leid.\n\nDas ist mein Supportticket, was ich nach meinem Ban abgeschickt hab. Die einzige Antwort die ich bisher erhalten hab ist, dass ich wohl im falschen Supportbereich gelandet bin, meine Frage aber gerne weitergeleitet wird.\n\n\n> Hallo Riot,\n\n> ich habe einen 14 t&auml;gigen Bann auf meinem Account bekommen. Wenn ich ehrlich bin, habe ich diesen auch verdient. Leider war ich in meinen letzten Spielen in der Kluft viel zu selten ehrlich. Ich habe meine Mitspieler f&uuml;r meine Fehler verantwortlich gemacht. Bei mir l&auml;uft grade vieles ungl&uuml;cklich und ich habe meine schlechte Laune an den anderen Beschw&ouml;rern ausgelassen, obwohl sie das nicht verdient haben. Au&szlig;erdem bin ich auch sehr pers&ouml;nlich geworden, was mich jetzt echt erschreckt.\nNormalerweise bin ich kein Mensch der sowas zu anderen schreibt oder es ihnen sagt. Ich habe mich immer weiter in meinen Frust gesteigert und vergessen um was es in der Liga eigentlich geht: Um den gemeinsamen Spa&szlig; im Team und am Spiel.\nMit diesem Verhalten habe ich nicht nur mich, sondern auch 4 andere, echte Menschen um ihren Spa&szlig; gebracht. Das wird mir erst jetzt, nachdem ich durch den Bann auf den Boden der Tatsachen zur&uuml;ckgeholt wurde, bewusst. Gerne w&uuml;rde ich mich daf&uuml;r auch noch nach meinem Bann bei den Betroffenen Beschw&ouml;rern entschuldigen, wenn ich bis dahin noch diese Daten einsehen kann.\n\n> Ich m&ouml;chte mit diesem Supportticket keine Aufhebung des Banns erbetteln. &Uuml;bel nehmen werde ich es euch nicht, wenn sich daran nichts &auml;ndert, da der Bann gerechtfertigt ist. Wenn man bedenkt, dass dieses Spiel nicht das einzige war, in dem ich meine Mitspieler beleidigt habe, verdiene ich wahrscheinlich einen noch l&auml;ngeren Bann.\nDa Fragen aber nichts kostet, tu ich es trotzdem: Ist es m&ouml;glich, f&uuml;r jemanden der seine Fehler einsieht und sie bereut die Strafe aufzuheben, oder das Strafma&szlig; zu mindern?\n\n> Jetzt noch ein Lob an euch als Firma und das Tribunal: Ich spiele euer Spiel sehr gerne und verzichte sogar bei  >diesem guten Wetter ungern 14 Tage auf meine Abenteuer in der Kluft der Beschw&ouml;rer.\nDas Tribunal macht seinen Job sehr gut und gr&uuml;ndlich. Auch und gerade weil es mich so schnell getroffen hat, kann ich das beurteilen. Gerade weil ich in dem Gro&szlig;teil meiner anderen Spiele ein eher ruhiger Mitspieler bin, dachte ich das Tribunal w&auml;re wesentlich langsamer und uneffektiver.\nDas soll nat&uuml;rlich aber keine Rechtfertigung f&uuml;r meine Fehler sein.\n\n> Hier mein Chatverlauf vom Spiel des Banns:\n> why did you leave me man\n> come on\n> i didnt go in, they initiated on me because u left me alone\n> no wards needed if they push dude\n> come on\n> stop\n> typing\n> i dont typ\n> STOP TYOPING\n> START PLAYINGH\n> died nearly 2 times cause youre afk\n> #stop warding\n> 2nd gank\n> tank for me\n> ffs\n> lost lane due to lulu\n> 3rd gank bot\n> 4th gank bot\n> need 400\n> cant\n> zac no passive\n> why do you chase like this\n> thats retarded\n> youre retarded\n> u didnt help me anyway\n> 2 deaths because of u\n> cya bot\n> im jungling now\n> hf guys\n> best team ever\n> top and lulu fed him\n> np\n> shes bad\n> y irelia\n> just stay there\n> watching me\n> wp\n> u suck aswell\n> just stay there\n> why would you even move right\n> play irelia if u suck\n> nice idea\n> idiots\n> im jungling\n> now\n> hf\n> cya guys\n> gl 4vs5\n> close\n> cya\n> hands the air cuz i dont care!\n> enjoy\n> gg lulu\n> better leave me alone\n> nooob\n> this lulu\n> so worthless\n> 3 down\n> you call drake\n> retarded trash\n> thx for help\n> gj ww\n> better push botlane\n> gj!\n> was really important to push this lane with 3 guys\n> cancer team\n> initiate 4vs5\n> brilliant\n> :DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD\n> gj guys\n> wp\n> y ill def vs 4\n> np\n> u didnt play well\n\n> Ich hoffe, dieses Ticket wird von einem Menschen gelesen und auch bearbeitet.\n\n> Ich w&uuml;nsche euch einen entspannten und k&uuml;hlen Tag,\nSALATK&Ouml;NIG\n\n\nDa einem ohne League schnell langweilig werden kann wie ihr sicher wisst, interessiert mich eure Meinung. \nSeid ihr froh jemanden wie mich gebannt zu sehen?\nW&uuml;rdet ihr mir nach \"meiner Entschuldigung\" vergeben?\n\nUm euch besser eine Meinung bilden zu k&ouml;nnen hier noch ein paar Infos:\nAu&szlig;er diesem Monat habe ich League of Legends 7 Monate lang nicht gespielt.\nVor ca. 1 Jahr habe ich meiner Meinung nach schon mal einen Ban gehabt, der war aber meiner Meinung nach k&uuml;rzer.\nMeine letzte Chat Restriction d&uuml;rfte auch bald ein Jahr her sein.\nDas Game um das es im Ticket ging, war ein Normal Game.\n","replies":[{"poster":"Patter91","date":"2015-07-09T05:56:25.606+0000","up_votes":17,"down_votes":0,"body":"> [{quoted}](name=SALATKÖNIG,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=,timestamp=2015-07-09T05:29:45.620+0000)\n>\n> Seid ihr froh jemanden wie mich gebannt zu sehen?\n\nJa.\n\n> [{quoted}](name=SALATKÖNIG,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=,timestamp=2015-07-09T05:29:45.620+0000)\n\n> W&uuml;rdet ihr mir nach \"meiner Entschuldigung\" vergeben?\n> \n\nNein.","replies":[{"poster":"Crounty","date":"2015-07-09T06:01:31.939+0000","up_votes":2,"down_votes":0,"body":"+1","replies":[]},{"poster":"Gurkengustav","date":"2015-07-09T15:25:20.287+0000","up_votes":1,"down_votes":0,"body":"no mercy ^^ genauso wie hier [lolflame](http://www.lol.flame.wtf)","replies":[]},{"poster":"iJUKEuQQ","date":"2015-07-13T13:59:04.705+0000","up_votes":1,"down_votes":2,"body":"ich würde dir auch nicht vergeben, alleine schon weil du einer der größten trolle im alten forum warst","replies":[]}]},{"poster":"Humpelstilzche","date":"2015-07-09T06:13:27.291+0000","up_votes":10,"down_votes":2,"body":"Du musst das folgendermaßen sehen: Diese Strafe ist nicht als gerechte Strafe zu verstehen, sondern als ein Weckruf für dich. \"Gerecht\" wäre bei derartigem Verhalten vermutlich ein permanenter Ausschluss aus dem Spiel. In den Chatlogs sind Sachen drin, die einfach GARNICHT gehen und weit über alles hinausgehen was auch nur annähernd akzeptabel ist. Ums drastisch zu sagen: Du hast mit einem solchen Verhalten in der LoL Community nichts verloren. Also, wie gesagt, wenns um Gerechtigkeit ginge, wäre das ein Permaban. Zu deinem Glück ist das nicht das Ziel dieser Strafe. \n\n> Ist es möglich, für jemanden der seine Fehler einsieht und sie bereut die Strafe aufzuheben, oder das Strafmaß zu mindern?\n\nIm Prinzip kann man diese Frage mit \"Ja\" beantworten. Denn das angemessene Strafmaß ist der Perma. Riot gibt aber Flamern standardmäßig die Möglichkeit, dieses Strafmaß zu reduzieren (bzw. komplett zu vermeiden), indem sie den Warnschuss 14-Tage-Bann ernst nehmen und ihr Verhalten dannach grundlegend ändern. Ich weiß dass deine Frage nicht darauf abzielte, aber beantworten kann man sie trotzdem mit: Ja, wenn du deine Fehler einsiehst, kannst du den Perma noch verhindern. \n\n> Würdet ihr mir nach \"meiner Entschuldigung\" vergeben?\n\nDie Erfahrung lehrt uns, dass eine Entschuldigung in Worten nicht viel wert ist. Du kannst die Ernsthaftigkeit deiner Entschuldigung nach Ende des Bans mit Taten belegen und dann kann dir auch vergeben werden....oder auch nicht, je nachdem wie ernst du das nimmst. \nWorte sind nur Schall und Rauch. ZEIG dass du dich gut verhalten kannst, dann gibt dir Riot nochmal eine Chance. Behalte aber im Hinterkopf, dass es die letzte Chance ist.","replies":[{"poster":"FOCU5 ON IMPROVE","date":"2015-07-09T09:54:03.435+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=0002,timestamp=2015-07-09T06:13:27.291+0000)\n>\n> Du musst das folgendermaßen sehen: Diese Strafe ist nicht als gerechte Strafe zu verstehen, sondern als ein Weckruf für dich. \"Gerecht\" wäre bei derartigem Verhalten vermutlich ein permanenter Ausschluss aus dem Spiel. In den Chatlogs sind Sachen drin, die einfach GARNICHT gehen und weit über alles hinausgehen was auch nur annähernd akzeptabel ist. Ums drastisch zu sagen: Du hast mit einem solchen Verhalten in der LoL Community nichts verloren. Also, wie gesagt, wenns um Gerechtigkeit ginge, wäre das ein Permaban. Zu deinem Glück ist das nicht das Ziel dieser Strafe. \n> \n> Im Prinzip kann man diese Frage mit \"Ja\" beantworten. Denn das angemessene Strafmaß ist der Perma. Riot gibt aber Flamern standardmäßig die Möglichkeit, dieses Strafmaß zu reduzieren (bzw. komplett zu vermeiden), indem sie den Warnschuss 14-Tage-Bann ernst nehmen und ihr Verhalten dannach grundlegend ändern. Ich weiß dass deine Frage nicht darauf abzielte, aber beantworten kann man sie trotzdem mit: Ja, wenn du deine Fehler einsiehst, kannst du den Perma noch verhindern. \n> \n> Die Erfahrung lehrt uns, dass eine Entschuldigung in Worten nicht viel wert ist. Du kannst die Ernsthaftigkeit deiner Entschuldigung nach Ende des Bans mit Taten belegen und dann kann dir auch vergeben werden....oder auch nicht, je nachdem wie ernst du das nimmst. \n> Worte sind nur Schall und Rauch. ZEIG dass du dich gut verhalten kannst, dann gibt dir Riot nochmal eine Chance. Behalte aber im Hinterkopf, dass es die letzte Chance ist.\n\nDanke für die konstruktive Antwort.","replies":[]}]},{"poster":"Kaitri","date":"2015-07-09T14:27:48.178+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=SALATKÖNIG,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=,timestamp=2015-07-09T05:29:45.620+0000)\n\n> Da einem ohne League schnell langweilig werden kann wie ihr sicher wisst, interessiert mich eure Meinung. \n\nnein das weiß ich ehrlich gesagt nicht da mein leben sich nicht nur um LoL dreht.","replies":[]},{"poster":"malleusmintaka","date":"2015-07-09T07:38:11.245+0000","up_votes":3,"down_votes":0,"body":"Ich habe schon schlimmeres gesehen, allerdings hättest du nach dem \"stop warding\" von dir dein ganzes Team muten und die Taste für den Chat auf * legen sollen. \nErsteres, damit du nicht siehst, was dein Team schreibt(noch besser am Anfang /mute all) , zweiteres, damit du nicht so leicht in Versuchung kommst etwas zu schreiben.\n\nDenn ab \"stop warding\" wirst du richtig beleidigend, und ja, dafür hast du den Ban verdient, besonders da noch andere Spiele gehabt hast, in denen du ähnliche Chatverläufe hattest. \n\nOb ich froh bin, dass du gebannt bist? Nein, ich bin froh, dass du dein Fehlverhalten eingesehen hast und dich ändern willst. Jeder, der gebannt wird, tut mir leid.\nOb ich dir vergeben würde? Ich würde den Ban nicht aufheben, aber vielleicht meinst du ja etwas anderes damit.","replies":[{"poster":"FOCU5 ON IMPROVE","date":"2015-07-09T09:47:39.926+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=malleusmintaka,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=0005,timestamp=2015-07-09T07:38:11.245+0000)\n>\n> Ich habe schon schlimmeres gesehen, allerdings hättest du nach dem \"stop warding\" von dir dein ganzes Team muten und die Taste für den Chat auf * legen sollen. \n> Ersteres, damit du nicht siehst, was dein Team schreibt(noch besser am Anfang /mute all) , zweiteres, damit du nicht so leicht in Versuchung kommst etwas zu schreiben.\n> \n> Denn ab \"stop warding\" wirst du richtig beleidigend, und ja, dafür hast du den Ban verdient, besonders da noch andere Spiele gehabt hast, in denen du ähnliche Chatverläufe hattest. \n> \n> Ob ich froh bin, dass du gebannt bist? Nein, ich bin froh, dass du dein Fehlverhalten eingesehen hast und dich ändern willst. Jeder, der gebannt wird, tut mir leid.\n> Ob ich dir vergeben würde? Ich würde den Ban nicht aufheben, aber vielleicht meinst du ja etwas anderes damit.\n\nHast vollkommen Recht.","replies":[]}]},{"poster":"On3 Punch Lee","date":"2015-07-09T07:06:00.856+0000","up_votes":2,"down_votes":15,"body":"Nunja... Jeder flamed mal und in dem Chatverlauf seh ich nichts all zu schlimmes das für einen Bann reichen sollte...(eig..) naja ausser das *%%%%%% team* xD Aber wenn ich sowas les find ich das eher witzig als beleidigend ^^","replies":[{"poster":"4 R4nd0m N008","date":"2015-07-09T08:46:23.842+0000","up_votes":6,"down_votes":0,"body":"Direkte Beleidigungen:\n\n* youre retarded\n* u suck aswell\n* idiots\n* retarded trash\n* %%%%%% team\n* u didnt play well\n\nWas mit dir verkehrt ist will ich wohl nicht hinterfragen... wtf...\n\nWie kann man Beleidigungen als ok hinnehmen? Sprichst du deine mutter auch mit \"Idiot\" oder \"behinderter Abfall\" an, weil du das witzig findest? Ich glaube meine würde das gar nicht so lustig finden. Aber wenn das bei dir ganz normales verhalten ist, dann solltest du zu Mitten im Leben und uns unterhalten!","replies":[{"poster":"On3 Punch Lee","date":"2015-07-09T17:48:23.418+0000","up_votes":1,"down_votes":6,"body":"Allein das du auf den Namen *Fiqqa* hörst sollte eig. schon deinen Zustand erläutern, jedoch antworte ich sehr gerne auf deine Frage.\nAlsooo... Nein ich spreche meine Mutter nicht mit solchen Ausdrücken an , 2. Schwarzer Humor gibts nicht nur in reallife sondern auch im Online Bereich.. 3. Ich meide Rtl und den Abfall der dort gezeigt wird :) 4.  Wenn du im reallife als *hur*ns*hn etc. beleiidigt wirst rennst du dann auch direkt vor Gericht oder wie ? Und um dir die Frage vorweg zunehmen , nein ich werde nicht so im Reallife angesprochen danke der Nachfrage =) .\n\nEs muss halt einfach mal verstanden werden das LoL nun einmal ein Ranked bereich hat und man dort gewinnen will , und in JEDEM spiel das auch nur ein wenig Competition beinhaltet , wird geflamed ohne Ausnahme. Das Problem das LoL in dem Bereich hat ist leider das auch recht schlechte Spieler oder um es höflich auszudrücken (Spieler die nicht so viel Zeit am pc verbringen wollen oder können ) sich im Ranked beteiligen und manchmal halt den Lose fordern... wenn auch nicht nur 1 mal pro Tag. Noch dazu sind in LoL so gut wie ALLE Altersgruppen vertreten was das größte aller Probleme aufzeigt...\n\nDie 12 Jährigen heutzutage beleidigen sich untereinander mit den lächerlichsten Beleidigungen die Ihr kennt und wenn sie diese im Online-Game von sich geben, weil sie nicht wirklich wissen das manche das anders Aufnehmen, wird auf der anderen Seite des Computers direkt die Anzeige geschrieben....^^ Wiederum nehmen die etwas älteren /reiferen allein schon sowas wie *haha u idiot^^* was als witz meistens aufgenommen wird , direkt missverstanden in eine herbe Beleidigung xD...^^ Aber darüber könnte ich noch viiiiel mehr schreiben aber ich belass es mal bis hierhin :D\n\nbb","replies":[{"poster":"4 R4nd0m N008","date":"2015-07-10T07:33:20.519+0000","up_votes":3,"down_votes":0,"body":"> 2. Schwarzer Humor gibts nicht nur in reallife sondern auch im Online Bereich..\n\nJemanden als \"behinderten Abfall\" zu bezeichnen ist für dich schwarzer Humor? Interessante Definition von schwarzer Humor, die kenne ich bis jetzt noch von niemandem.\n\n> 3. Ich meide Rtl und den Abfall der dort gezeigt wird :)\n\nDa du Beleidigungen anscheinend sehr lustig findest wäre das der perfekte Sender für dich.\n\n> 4. Wenn du im reallife als hurns*hn etc. beleiidigt wirst rennst du dann auch direkt vor Gericht oder wie ?\n\nNein, der Grund dafür liegt auf der Hand. Es ist viel zu viel Aufwand für einen viel zu kleinen Nutzen. Ich müsste erst zur Polizei, eine Anzeige aufgeben, ein Gerichtsverfahren wird eingeleitet, usw. Was dabei im Endeffekt rauskommt ist unklar. In LoL brauche ich nur auf Report zu klicken und diesen abzuschicken. Und das Flamer gebannt werden bekommt man täglich im Forum mit.\n\n> Es muss halt einfach mal verstanden werden das LoL nun einmal ein Ranked bereich hat und man dort gewinnen will , und in JEDEM spiel das auch nur ein wenig Competition beinhaltet , wird geflamed ohne Ausnahme.\n\nNur weil geflamed **wird** bedeutet das nicht das es erlaubt **ist** und es ist noch lange **kein** Grund um zu flamen. Diese Argumente von wegen \"macht doch eh jeder\" funktionieren leider nicht. Verboten ist verboten. Es lädt auch fast jeder irgendwas illegal im Internet runter. Sollte das deswegen i. O. sein?\n\n> Das Problem das LoL in dem Bereich hat ist leider das auch recht schlechte Spieler oder um es höflich auszudrücken (Spieler die nicht so viel Zeit am pc verbringen wollen oder können ) sich im Ranked beteiligen und manchmal halt den Lose fordern... wenn auch nicht nur 1 mal pro Tag.\n\nDann hast du das Ranked-System nicht ganz verstanden. Deine Teammates sind in etwa genauso gut wie du, gleiches gilt für deine Gegner. Das Argument \"meine Teammates sind schuld\" wird deshalb niemals funktionieren und es wird dir auch niemals jemand glauben. Jeder der sich ein bisschen darüber informiert hat weiß das. Wenn du Games verlierst ist es **deine** Schuld und nicht der/die andere(n) Spieler, der auch noch genauso gut wie du ist.","replies":[{"poster":"Sirrkas","date":"2015-07-10T07:38:59.771+0000","up_votes":2,"down_votes":0,"body":"Da kann ich nur zustimmen.","replies":[]}]},{"poster":"Lance90","date":"2015-07-10T07:58:31.630+0000","up_votes":1,"down_votes":0,"body":"Ja, in Onlinespielen wird viel geflamet, aber es ist doch falsch zu sagen \"naja, ist halt so... gewöhn dich dran\"\n\nKein (!!) Flame ist ok. So einfach ist das.\nWer flamet verhält sich falsch.\n\nIst doch völlig egal ob der Flamer 10 Jahre jung oder 90 Jahre alt ist.\nIst ausserdem egal ob ein anderer angefangen hat, 3 Leute das Spiel verlassen haben, oder ob der Weihnachtsmann die Falschen Geschenke gebracht hat.\n\nFlame ist falsch und wird bestraft.","replies":[]}]},{"poster":"FOCU5 ON IMPROVE","date":"2015-07-09T09:30:25.018+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fiqqa,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=00040000,timestamp=2015-07-09T08:46:23.842+0000)\n>\n> Direkte Beleidigungen:\n> \n> * youre retarded\n> * u suck aswell\n> * idiots\n> * retarded trash\n> * %%%%%% team\n> * u didnt play well\n> \n> Was mit dir verkehrt ist will ich wohl nicht hinterfragen... wtf...\n> \n> Wie kann man Beleidigungen als ok hinnehmen? Sprichst du deine mutter auch mit \"Idiot\" oder \"behinderter Abfall\" an, weil du das witzig findest? Ich glaube meine würde das gar nicht so lustig finden. Aber wenn das bei dir ganz normales verhalten ist, dann solltest du zu Mitten im Leben und uns unterhalten!\n\nIch wohne nicht mehr bei meiner Mutter. \nIch nehme die Beleidigungen nicht als ok hin, bekenne mich schuldig und entschuldige mich.\nIch habe im Ticket geschrieben, dass es nicht meine Art ist so mit Leuten zu schreiben oder zu reden.\nIch finde das nicht witzig, ich bin eher enttäuscht wie wenig ich mich selbst zusammenreißen konnte.\n\nDas steht alles oben in meinem Post, ich glaube du hast den einfach nicht gelesen.\nMit dieser Beleidigung am Ende gesellst du dich auf das Niveau, was ich in dem Spiel angepeilt habe","replies":[{"poster":"malleusmintaka","date":"2015-07-09T09:44:43.355+0000","up_votes":1,"down_votes":0,"body":"Meinst du mit \"retarded thrash\" wirklich \"geistig zurückgebliebener Abfall\" oder hattest du einen Thresh in deinem Team, den du damit beleidigen wolltest?\nDas wäre dann die in meinen Augen schlimmere Version, da du im ersteren ja auch das Spiel als gesamtes meinen könntest.\nRein interessehalber.","replies":[{"poster":"FOCU5 ON IMPROVE","date":"2015-07-09T10:03:30.069+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=malleusmintaka,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=0004000000000001,timestamp=2015-07-09T09:44:43.355+0000)\n>\n> Meinst du mit \"retarded thrash\" wirklich \"geistig zurückgebliebener Abfall\" oder hattest du einen Thresh in deinem Team, den du damit beleidigen wolltest?\n> Das wäre dann die in meinen Augen schlimmere Version, da du im ersteren ja auch das Spiel als gesamtes meinen könntest.\n> Rein interessehalber.\n\nRetarded trash ging an den Warwick in meinem Team -> schlimmere Version.\nKann man sich aber auch denken bei dem restlichen Dünnschiss den ich da abgelassen hab. :D\n\nThresh - der LoL Champion\ntrash - engl. für Abfall","replies":[{"poster":"malleusmintaka","date":"2015-07-09T10:16:07.169+0000","up_votes":2,"down_votes":0,"body":"Mir ist schon bewusst, dasssich Thresh und trash unterschiedlich schreiben, aber das Wortspiel liegt auf der Hand, oder? \n\nIm Gegensatz zu vielen anderen Posts, in denen sich die Spieler über ihre Bans beschweren, hörst du dich so an, als würdest du es tatsächlich bereuen. \nViel Glück beim bessern und in den nächsten Spielen!","replies":[]}]}]},{"poster":"Waldschrat86","date":"2015-07-09T09:40:15.022+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SALATKÖNIG,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=000400000000,timestamp=2015-07-09T09:30:25.018+0000)\n>\n> Ich wohne nicht mehr bei meiner Mutter. \n> Ich nehme die Beleidigungen nicht als ok hin, bekenne mich schuldig und entschuldige mich.\n> Ich habe im Ticket geschrieben, dass es nicht meine Art ist so mit Leuten zu schreiben oder zu reden.\n> Ich finde das nicht witzig, ich bin eher enttäuscht wie wenig ich mich selbst zusammenreißen konnte.\n> \n> Das steht alles oben in meinem Post, ich glaube du hast den einfach nicht gelesen.\n> Mit dieser Beleidigung am Ende gesellst du dich auf das Niveau, was ich in dem Spiel angepeilt habe\n\nIch hab zwar auch die chronologische Ansicht offen, aber ich glaube er bezieht sich auf das Kerlchen direkt über seinem Post(in chronologischer Ansicht).","replies":[{"poster":"FOCU5 ON IMPROVE","date":"2015-07-09T09:45:24.045+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Waldschrat86,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=0004000000000000,timestamp=2015-07-09T09:40:15.022+0000)\n>\n> Ich hab zwar auch die chronologische Ansicht offen, aber ich glaube er bezieht sich auf das Kerlchen direkt übr seinem Post(in hronologischer Ansicht).\n\nDanke für den Hinweis, wenn @FIQQA 's Text nicht an mich ging, dann hab ich auch nix gesagt.","replies":[{"poster":"4 R4nd0m N008","date":"2015-07-09T09:49:56.734+0000","up_votes":2,"down_votes":0,"body":"Nein das ging an GF Orcface. Deinen Post habe ich schon gelesen und deswegen möchte ich dein Verhalten auch nicht weiter kritisieren, da du es einsiehst. Es ging darum das GF Orcface nichts Verwerfliches an deinem Chatlog außer eine Zeile finden konnte und den Rest auch noch lustig findet. Deswegen habe ich mit meinem anschließenden Beispiel auch so maßlos übertrieben.","replies":[]}]}]},{"poster":"PiXeL FuNKY","date":"2015-07-11T22:18:44.458+0000","up_votes":1,"down_votes":0,"body":"Mag zwar sein das du dich entschuldigst das nicht wolltest ändert aber nichts daran das du es getan heisst das heißt du wirst bestarft","replies":[]},{"poster":"Temudschinn","date":"2015-07-09T13:24:19.626+0000","up_votes":1,"down_votes":0,"body":"Sein Post bezog sich nicht auf dich, sondern auf GF Orcface der dein Verhalten als total alltäglich verteidigt hat.\n\nAm besten stellst du auf Diskussionsansicht um, dann sieht man das sofort :)","replies":[]}]}]}]},{"poster":"xxArcanE","date":"2015-07-10T10:41:17.502+0000","up_votes":2,"down_votes":0,"body":"Unfassbar das ich sowas erleben darf! ICH WAR bei einem Freund zuschauen als DU gespielt hast ! ;D\nICH HÄTTE ES NIE für möglich gehalten das mal zu sehen.....\n\nMein Kumpel ist ebenfalls gebannt worden wie du ! Ihr habt es beide sowas von verdient !!!!!!!!\n\nRiot es wird !!! ;D","replies":[]},{"poster":"DieSahnige","date":"2015-07-09T06:18:28.520+0000","up_votes":2,"down_votes":0,"body":"Also ich finde die 14 Tage-Ban auch gerechtfertigt. \nWenn ich mit solchen Leuten wie dir spiele, wird diese direkt gemuted und nach dem Spiel - ob gewonnen oder verloren, reported ^^ Gibt allerdings auch Schlimmeres, wie z.B afk gehen/leaven oder permanent beleidigen .. Das sollte härter \"bestraft\" werden!","replies":[{"poster":"On3 Punch Lee","date":"2015-07-09T07:08:41.237+0000","up_votes":2,"down_votes":13,"body":"Ahja du willst so einen recht harmlosen Spieler reporten und ihm 14 tage bann aufdrücken... und den *schlimmeren leute * warsch. so wie du einer bist , willste nen perm bann aufdrücken oder eine Freiheitstrafe wenn wir schon dabei sind :D","replies":[{"poster":"Humpelstilzche","date":"2015-07-09T07:18:02.558+0000","up_votes":2,"down_votes":0,"body":"Harmlos? Er beleidigt praktisch das ganze Spiel über seine Mitspieler auf ziemlich extreme Weise.","replies":[{"poster":"On3 Punch Lee","date":"2015-07-09T08:12:23.176+0000","up_votes":1,"down_votes":13,"body":"allein  diese Aussage *auf ziemlich extreme Weise*...was ist los mit dir ?","replies":[{"poster":"Humpelstilzche","date":"2015-07-09T09:00:03.646+0000","up_votes":5,"down_votes":0,"body":"Findest du es \"harmlos\" andere Leute als geistig zurückgeblieben,scheiße, Idiot, wertlos, geistig zurückgebliebener Abfall und \"%%%%%%\" zu bezeichnen? Redest du so mit Menschen auf der Straße? In welcher Welt ist das denn harmlos? Wenn du sowas zu Leuten sagst, endest du ziemlich schnell entweder im Krankenhaus oder auf der nächsten Polizeistation. \nWenn das nicht extrem ist, weiß ich nicht was extrem sein soll. Das sind welche der schlimmsten Beleidigungen überhaupt und du findest das harmlos...was zur Hölle? Wenn das für dich harmlos ist, was ist denn dann für dich NICHT harmlos?\nUnd: Verhältst du dich etwa im Alltag so? Sagst du solche Dinge im Alltag zu Fremden und hältst das für normal?","replies":[{"poster":"Babe Itz So Big","date":"2015-07-09T09:41:23.496+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=00030000000000000000,timestamp=2015-07-09T09:00:03.646+0000)\n>\n> Findest du es \"harmlos\" andere Leute als geistig zurückgeblieben,scheiße, Idiot, wertlos, geistig zurückgebliebener Abfall und \"%%%%%%\" zu bezeichnen? Redest du so mit Menschen auf der Straße? In welcher Welt ist das denn harmlos? Wenn du sowas zu Leuten sagst, endest du ziemlich schnell entweder im Krankenhaus oder auf der nächsten Polizeistation. \n> Wenn das nicht extrem ist, weiß ich nicht was extrem sein soll. Das sind welche der schlimmsten Beleidigungen überhaupt und du findest das harmlos...was zur Hölle? Wenn das für dich harmlos ist, was ist denn dann für dich NICHT harmlos?\n> Und: Verhältst du dich etwa im Alltag so? Sagst du solche Dinge im Alltag zu Fremden und hältst das für normal?\n\nHumpel geht enrage??? ;-) *Spaß* \nIch sehe das genauso wie er! Wenn dein Tag nicht läuft, dann lass es nicht an anderen Menschen aus und schon gar nicht in deiner Art & Weise! Solche Menschen wie dich habe ich gefressen und dabei solltest du auch immer bedenken, dass solche Flames das Game nicht besser machen sondern dazu führen, dass die leute gar nicht mehr spielen können, weil sie sich nicht konzentrieren können, abschalten oder einfach bloß absolut verstört sind. Mit deinen Worten kannst du also auch den Tag eines anderen Menschen versauen und eben auch sein Hobby LoL.\n\nDarüber solltest du mal nachdenken! Jeder hat mal miese Games, ob selbstverschuldet oder teamverschuldet ist auch ganz egal. Geh offline, wenn du das nicht akzeptieren oder temporär nicht verarbeiten und dies nur durch blöde und kindische, so wie schnippische und absolut herabsetzende Kommentare zum Ausdruck bringen kannst.\n\nDu sagst du magst LoL, weil es dein Hobby ist. Andere aber auch, doch du verdirbst ihnen den Spielspaß durch permanentes toxisches Verhalten und meinst dann mit einer Entschuldigung ist es getan. Sorry, dem widerspreche ich. Sei froh, dass es nur 14 Tage sind und ändere dein Verhalten grundlegend oder begrüße den Permaban, der dann wohl als einzig richtige Konsequenz verbleibt.\n\nMfG, Yihu","replies":[{"poster":"FOCU5 ON IMPROVE","date":"2015-07-09T09:58:05.332+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yihuli,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=000300000000000000000000,timestamp=2015-07-09T09:41:23.496+0000)\n>\n> Humpel geht enrage??? ;-) *Spaß* \n> Ich sehe das genauso wie er! Wenn dein Tag nicht läuft, dann lass es nicht an anderen Menschen aus und schon gar nicht in deiner Art & Weise! Solche Menschen wie dich habe ich gefressen und dabei solltest du auch immer bedenken, dass solche Flames das Game nicht besser machen sondern dazu führen, dass die leute gar nicht mehr spielen können, weil sie sich nicht konzentrieren können, abschalten oder einfach bloß absolut verstört sind. Mit deinen Worten kannst du also auch den Tag eines anderen Menschen versauen und eben auch sein Hobby LoL.\n> \n> Darüber solltest du mal nachdenken! Jeder hat mal miese Games, ob selbstverschuldet oder teamverschuldet ist auch ganz egal. Geh offline, wenn du das nicht akzeptieren oder temporär nicht verarbeiten und dies nur durch blöde und kindische, so wie schnippische und absolut herabsetzende Kommentare zum Ausdruck bringen kannst.\n> \n> Du sagst du magst LoL, weil es dein Hobby ist. Andere aber auch, doch du verdirbst ihnen den Spielspaß durch permanentes toxisches Verhalten und meinst dann mit einer Entschuldigung ist es getan. Sorry, dem widerspreche ich. Sei froh, dass es nur 14 Tage sind und ändere dein Verhalten grundlegend oder begrüße den Permaban, der dann wohl als einzig richtige Konsequenz verbleibt.\n> \n> MfG, Yihu\n\nHarte Worte. Hast mit allem Recht.\nBloß steht nirgendwo, dass es mit der Entschuldigung getan sein soll.","replies":[]}]},{"poster":"iJUKEuQQ","date":"2015-07-13T14:02:19.378+0000","up_votes":1,"down_votes":4,"body":"nicht harmlos ist: leute auf der straße zu beleidigen\nharmlos ist:krieg in der welt durch seinen konsum zu fördern\nHARDCORE","replies":[]}]}]}]},{"poster":"Sirrkas","date":"2015-07-09T07:32:10.447+0000","up_votes":2,"down_votes":0,"body":"Hast du dir den Chatlog überhaupt angesehen? Wenn man es darauf anlegt, könnte man wohl auch vor Gericht gehen. Der TE hat da aber wohl eher das Glück, dass das kaum einer macht.","replies":[{"poster":"On3 Punch Lee","date":"2015-07-09T08:12:44.992+0000","up_votes":1,"down_votes":15,"body":"Was mit dir verkehrt ist will ich wohl nicht hinterfragen... wtf...","replies":[{"poster":"Temudschinn","date":"2015-07-09T13:22:15.908+0000","up_votes":2,"down_votes":0,"body":"Was mit im verkehrt ist? Er kennt die Gesetze. Ist das jetzt schon schlimm?","replies":[{"poster":"On3 Punch Lee","date":"2015-07-09T17:26:08.543+0000","up_votes":1,"down_votes":7,"body":"Das er das Gesetz kennt ist mir im Prinzip recht egal...sollte sowieso jeder kennen,\nDie Sache ist die, die Art und Weise wie er das von sich gab  zeigt das er anscheinend der Meinung ist, dass man wirklich vor Gericht gehen sollte wegen so einem Verbalen Austausch in einem Online Game...also bitte...\nGenauso gut könnte ein 12 jähriger dich auf diese Art und Weise beleidigen und ziehst vor Gericht, weil du dich so schnell beleidigt fühlst wegen so einem sche***...","replies":[{"poster":"Temudschinn","date":"2015-07-09T21:28:48.574+0000","up_votes":1,"down_votes":0,"body":"Nein, das steht da eigentlich nicht. Ich les da nur rein dass er dem TE sagen will WIE daneben sein Verhalten eigentlich war.","replies":[]}]}]}]}]},{"poster":"DieSahnige","date":"2015-07-09T21:57:59.986+0000","up_votes":1,"down_votes":0,"body":"Was ist denn daran bitte harmlos? Bist wohl auch so 'n Flamer. So jemand hat es nicht anders verdient","replies":[]}]}]},{"poster":"Fcktardmagnet","date":"2015-07-09T09:41:42.210+0000","up_votes":2,"down_votes":1,"body":"Guter Ban. Ich verabscheue Menschen die andere beleidigen.","replies":[{"poster":"FOCU5 ON IMPROVE","date":"2015-07-09T09:51:35.850+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Pl4t1numX,realm=EUW,application-id=KYnfKGf0,discussion-id=NAAxIuph,comment-id=0006,timestamp=2015-07-09T09:41:42.210+0000)\n>\n> Guter Ban. Ich verabscheue Menschen die andere beleidigen.\n\nWow, du **verabscheust** Menschen, die du nicht kennst, weil sie sich in Spielen nicht beherrschen können. Ich weiß das ich 'n echter Penner sein kann :D, aber mit der Einstellung scheinst du auch nicht der netteste Zeitgenosse zu sein. \n","replies":[{"poster":"Fcktardmagnet","date":"2015-07-09T09:58:31.008+0000","up_votes":1,"down_votes":0,"body":"Wer keinen Respekt vor anderen Menschen hat den möchte ich nichtmal kennenlernen, völlig egal ob in einem Spiel oder woanders. \nAnsonsten bin ich ein recht umgänglicher Mensch, hab nen TS Server und dort viele die ich seit 15 Jahren teilweise ausschließlich durchs Gaming kenne. Man kann also durchaus mit mir auskommen, wenn man sich gegenseitig respektiert. \nNicht das ich die Unschuld in Person bin, hatte selbst schon ne Sperre. Allerdings hab ich nie irgendjemanden beleidigt. \nJemand als retarded, noob oder %%%%%% team zu bezeichnen geht einfach gar nicht.","replies":[]}]}]},{"poster":"Iron IV dude","date":"2015-07-09T06:05:49.577+0000","up_votes":1,"down_votes":1,"body":"Vollkommen gerechtfertigt...\nSchade, dass dir das nicht so auffällt, weil du dein Verhalten nun nicht ändern wirst weil \"damn, ich bin teilweise echt Toxic\" sondern \"Pah, schreib ich halt nichts mehr, doofes Reportsystem\" und dich somit anscheinend \"unschuldig\" fühlst..","replies":[{"poster":"FOCU5 ON IMPROVE","date":"2015-07-09T06:11:06.274+0000","up_votes":2,"down_votes":1,"body":"Ich behaupte nirgendwo unschuldig zu sein, ich schreibe sogar vom Gegenteil..\nDer Rest deiner Antwort liest sich auch so als hättest du meinen Post nicht gelesen.\n\nDanke trotzdem für deine Meinung.","replies":[{"poster":"Iron IV dude","date":"2015-07-09T06:24:02.543+0000","up_votes":1,"down_votes":0,"body":"Dein Post liest sich so, als wenn du nicht mit der Strafe einverstanden bist, und diese als zu hart empfindest.\n\nDenke es haben nun aber genug Leute geschrieben, dass es gerechtfertigt, tut mir Leid für dich, besonders im Hinblick auf deiner längeren Pause, aber das du bereits Chatrestrikted warst, macht es nun nicht wirklich besser...\n\nHabe im übrigen auch einen Bann hinter mir, und weiß wie schwer es ist einfach auch mal zu schlucken, aber immer noch besser als Perma-banned zu sein.\n\nDenke du bekommst das hin :)","replies":[{"poster":"FOCU5 ON IMPROVE","date":"2015-07-09T06:33:24.465+0000","up_votes":1,"down_votes":0,"body":"> [...] Wenn ich ehrlich bin, habe ich diesen auch verdient.\n\n> Ich möchte mit diesem Supportticket keine Aufhebung des Banns erbetteln. Übel nehmen werde ich es euch nicht, wenn sich daran nichts ändert, da der Bann gerechtfertigt ist. Wenn man bedenkt, dass dieses Spiel nicht das einzige war, in dem ich meine Mitspieler beleidigt habe, verdiene ich wahrscheinlich einen noch längeren Bann. [...]\n\nKlar bin ich nicht mit der Strafe einverstanden, weil ich spielen will. \nNiemand freut sich über so eine Strafe..\nTrotzdem sehe ich sie nicht als ungerecht an, weil ich weiß das ich zurecht und warum ich gebannt worden bin.\n\nDanke für die netten Worte. :)","replies":[]}]}]}]}]}