{"poster":"DieOrSovngarde","date":"2015-09-12T17:48:09.647+0000","title":"Huracan de Runnan - Mi experiencia","subforum":"Guias y consejos","up_votes":2,"down_votes":0,"body":"Este item veo que los PRO unicamente lo arman para Khalista; he aqui la cuestion que vi en twitch, de forma aleatoria, jugadores de diamante y challenger de diferentes regiones, usando en campeones como Ashe, Jinx, Lucian y Varus; explicando sus motivos:\r\n\r\nSegun entendi es lo siguiente: Para Ashe, suma mas rapido las cargas de la Q y al activarla los proyectiles son en mas cantidad debido a la sinergia de la Q + Huracan ( multiples disparos por la Q + multiples dardos con Huracan), ademas de que la pasiva que congela y genera golpe critico, aumenta con 3 objetivos congelados.\r\n\r\nCon Jinx, sucede algo distinto: Al usa Huracan con la Q activada cada dardo del Huracan aplica golpe por efecto, en cuestion, si la Q misma pega en area, los dardos tambien pegan en area. Observe eso, cuando vi que de 2 Q con una simple doran y una pick axe, mas el huracan, limpiaba una wave de minions.\r\n\r\nCon Lucian sucede que sus ataques dobles por pasiva, se duplican en 2 los ataques de los dardos del huracan.\r\n\r\nVarus, es el menos aplicado, pero gana mas rapido la velocidad de pasiva matando unidades mas rapidos gracias a lo proyectiles del huracan.\r\n\r\nSimplemente, quise plasmar lo que vi. Que opinan? Se aplica? Se prueba? Tiene sentido?\r\n\r\nPersonalmente lo pobre en Ashe y Jinx. A mi, me rindio. Comenten.","replies":[{"poster":"Don KeKeiras","date":"2015-09-12T17:55:06.792+0000","up_votes":6,"down_votes":0,"body":"En varus es el que mas le sirve de todos los que mencionaste, aplica la pasiva en varios objetivos, es decir, dmg x %hp. a varios enemigos al mismo tiempo.","replies":[{"poster":"Krilin Noda Oro","date":"2015-09-12T18:20:54.980+0000","up_votes":1,"down_votes":0,"body":"True","replies":[]}]},{"poster":"CarrilloLalo","date":"2015-09-12T21:36:52.000+0000","up_votes":3,"down_votes":0,"body":"con {{champion:51}}  carga la pasiva cada 2 golpes :)","replies":[]},{"poster":"Benedict","date":"2015-09-13T00:50:02.958+0000","up_votes":1,"down_votes":0,"body":"Hola, yo lo vi en varus en una normal que jugué, lo saco como primer ítem y la pasiva iba como loco, rinde mucho, yo no juego adc muy seguido hace un tiempo lo probe en jinx antes de los nerf y rendia mucho bajabas las torres rapidísimo, en twich supongo que con el veneno debe servir. Pero creo que el Huracan es mas un ítem para hacerse primero, antes que filo o sanguinaria, sino después el mismo personaje lo va dejando inútil a lo largo de la partida cuando va ganando velocidad de ataque, es mi humilde opinión, suerte en las partidas en la grieta !","replies":[]},{"poster":"Krilin Noda Oro","date":"2015-09-12T18:39:34.533+0000","up_votes":1,"down_votes":0,"body":"El problema con el huracan es principalmente que no te da criticos ni movimiento algo que con la mayoria de adc's le ayuda o acostumbramos armar para lograr el burst en el dps. No sabia que el cohete de jinx se llegara a aplicar 3 veces en area, interesante, pero aun asi creo que le rinde aplicar mas criticos considerando que ya tiene el daño en area. \n\n{{champion:429}} {{champion:29}} {{champion:110}} {{champion:96}} \n\nEsos a mi parecer son los unicos que podrian hacer rendir el huracan.","replies":[]},{"poster":"TheFalc","date":"2015-09-12T18:26:42.765+0000","up_votes":1,"down_votes":0,"body":"Es un ítem útil parte los adc con efecto de impacto, es como que si o si te tener que armar rey arruinado, regenerada vida como mundo","replies":[]},{"poster":"Aıejandro","date":"2015-09-12T18:20:11.768+0000","up_votes":1,"down_votes":0,"body":"ahora se esta viendo tristana con arruinado y huracan y tmb jinx con huracan si si rinde.","replies":[]}]}