{"poster":"Märu","date":"2016-12-14T18:55:22.885+0000","title":"Mein League Game startet nichtmehr","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey Leute :) \r\nIch wollte seit langem wieder League spielen jedoch funktionierte es nicht so wie ich es gerne wollte. Nunja kommen wir zum eigentlichen Problem. Championselect l&auml;uft super auch der Client ist gut aber wenn dann das Game aufgebaut werden soll bzw. man ins Game kommen soll, baut sich ein Schwarzer Bildschirm auf ist jedoch ziemlich klein, anschlie&szlig;end komme ich zur&uuml;ck zum Client mit der Anzeige das die Verbindung zum Spiel unterbrochen worden ist.\r\n\r\nIch denke es liegt an meinem neuen Bildschirm, im vergleich zu meinem alten ist dieser ziemlich gro&szlig; und wohlm&ouml;glich sind noch die Einstellungen von der Zeit wo ich meinen alten Bildschirm hatte gespeichert. Dieser versucht nun die alten Einstellungen beim starten zu &uuml;bernehmen jedoch kriegt er es nicht gebacken und schmiert ab. \r\n**Das ist aber nur eine Theorie. **\r\n\r\nMein letztes Spiel war mitte November mit dem alten Spiel und habe somit auch mit dem neuen Patch keine Probleme gehabt. (Eventuell liegt es noch am neuen Clienten) habe es jedoch in beiden Versionen versucht zu starten, aber es klappte nicht. Ich habe das Spiel neu installiert und habe aktuell nur den alten Client aktiv.\r\n\r\nHat jemand Tipps bzw wei&szlig; was ich machen k&ouml;nnte damit ich wieder League spielen k&ouml;nnte?\r\nAndere Spiele wie z.b World of Warcraft und Hearthstone zeigen keine Probleme auf, der umstieg auf den neuen Monitor hat die Grafik und auch die FPS leistung erh&ouml;ht.\r\n\r\nHoffe echt das mir jemand helfen k&ouml;nnte sonst w&auml;re die letzte m&ouml;glichkeit ein neuer PC.\r\n\r\nMit freundlichen und frostigen Gr&uuml;&szlig;en\r\n\r\nM&auml;ru","replies":[{"poster":"Saufautomat","date":"2016-12-14T19:29:54.132+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nbekommst du denn eine Fehlermeldung, nachdem das Spiel abgeschmiert ist?\n\nVersuch mal in der Datei \"C:\\RIOT Games\\League of Legends\\config\\game.cfg\" den Wert von \"WindowMode\" auf \"2\" zu ändern, falls er diesen noch nicht hat.","replies":[{"poster":"Märu","date":"2016-12-14T21:05:45.552+0000","up_votes":1,"down_votes":0,"body":"Danke! Der war auf 0 jetzt klappt es <3 <3","replies":[]}]},{"poster":"Pr0oXy","date":"2016-12-14T19:20:51.987+0000","up_votes":1,"down_votes":0,"body":"Ich weiß nicht ob dir das weiter hilft, aber ich hatte ein ähnliches Problem gestern.\nUnd zwar als der Lol-Client nach der Champ-Select gestartet ist, blieb alles schwarz, bis ich auf den Desktop getabbt bin. Dann hat mit Lol gesagt er hat die Verbindung zum Server verloren und ich musste auf Reconnect drücken. Dann hat alles normal funktioniert...\n\nHeute ist das Problem nicht mehr da, wenn es bei dir ebenfalls so ist würde ich abwarten, muss nicht unbedingt etwas mit deinem Bildschirm oder Setup sein. :)\n\nVG Pr0oXy","replies":[]}]}