{"poster":"JMoormann","date":"2016-07-02T12:54:32.401+0000","title":"@Meddler Has Aatrox officially been Yoricked?","subforum":"Gameplay","up_votes":26,"down_votes":1,"body":"Aka being kept weak intentionally until he gets a rework?\r\n\r\nLooking at his stats at champion.gg:\r\n\r\nTop lane he now has a 47% win rate (54th out of 61 top laners (including &quot;top laners&quot; like Nunu, Shyvana and Xin)), while also having an abysmal 0.6% play rate (49/61, again counting Urgot, Nunu, WW and some others). His average player experience is actually extremely high (8/61), but even the most experienced players can&#039;t win with him.\r\n\r\nThe removal of Devourer has straight up killed his ability to jungle: his win rate dropped from 51% in 6.8 to 43% in 6.9. Currently he has literally the lowest jungle win rate in the game with 45%, while having the second lowest jungle play rate in the game, only above Morde.\r\n\r\nI don&#039;t play him myself, and he is certainly not the best designed champion, but he is not quite Yorick level and could probably use some buffs, unless he indeed got the Yorick treatment.","replies":[{"poster":"Jbels","date":"2016-07-02T13:40:42.603+0000","up_votes":4,"down_votes":3,"body":"If they remove his ability to infinitely sustain in lane, I'll be fine with any rework they go with.","replies":[{"poster":"Pierce The Veal","date":"2016-07-02T15:34:37.781+0000","up_votes":11,"down_votes":2,"body":"> [{quoted}](name=NMF Jbels,realm=NA,application-id=3ErqAdtq,discussion-id=qsmGJUkM,comment-id=0002,timestamp=2016-07-02T13:40:42.603+0000)\n>\n> If they remove his ability to infinitely sustain in lane, I&#x27;ll be fine with any rework they go with.\n\nSo in other words his entire niche?","replies":[{"poster":"Beuhlakor","date":"2016-07-02T15:37:41.544+0000","up_votes":14,"down_votes":1,"body":"> [{quoted}](name=DracoMTA,realm=NA,application-id=3ErqAdtq,discussion-id=qsmGJUkM,comment-id=00020000,timestamp=2016-07-02T15:34:37.781+0000)\n>\n> So in other words his entire niche?\n\nLet's be honest : most of his problems come from that.\n\nHe is paying a huge price in base stats and power on his skills because of his sustain and it also makes him incredibly hard to balance. He is the exact same problem as Old Vlad used to be (don't get me wrong : current Vlad is not balanced, but it is more a problem in his numbers being busted rather than his gameplay).","replies":[{"poster":"morris1","date":"2016-07-03T10:59:26.202+0000","up_votes":1,"down_votes":0,"body":"They could just make him a utility (yes you read that right) bruiser that's actually tanky. Feast and famine champions are very toxic for a lot of people at any given time but Aatrox isn't even that good when ahead.","replies":[]}]},{"poster":"runedara","date":"2016-07-02T19:36:15.240+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DracoMTA,realm=NA,application-id=3ErqAdtq,discussion-id=qsmGJUkM,comment-id=00020000,timestamp=2016-07-02T15:34:37.781+0000)\n>\n> So in other words his entire niche?\n\nThink they would give it more of a Window of power.  Like Vlads Q his w would heal more on champs and less on creeps and a time limit.  His e also feels weird to me it doesn't fit with his kit well.","replies":[{"poster":"Pierce The Veal","date":"2016-07-03T10:48:14.683+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=runedara,realm=NA,application-id=3ErqAdtq,discussion-id=qsmGJUkM,comment-id=000200000001,timestamp=2016-07-02T19:36:15.240+0000)\n>\n> Think they would give it more of a Window of power.  Like Vlads Q his w would heal more on champs and less on creeps and a time limit.  His e also feels weird to me it doesn&#x27;t fit with his kit well.\n\nI hate the term \"window of power\" just as much as the term \"minigame.\" They're thinking so deeply on making counterplay everywhere that it's honestly just making it so every champion has intentional weakness built in with no ability to play around them.","replies":[{"poster":"Angry Monster","date":"2016-07-03T10:52:20.116+0000","up_votes":1,"down_votes":0,"body":"if the champ has no weakness, then how would you fight him? A sustain champ has to have down time at some point or the lane and the game is auto win. \n\nYou have to have 1v1 health and 5v5 health or the kit does not work.","replies":[{"poster":"Pierce The Veal","date":"2016-07-03T10:56:37.587+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angry Monster,realm=NA,application-id=3ErqAdtq,discussion-id=qsmGJUkM,comment-id=00020000000100010000,timestamp=2016-07-03T10:52:20.116+0000)\n>\n> if the champ has no weakness, then how would you fight him? A sustain champ has to have down time at some point or the lane and the game is auto win. \n> \n> You have to have 1v1 health and 5v5 health or the kit does not work.\n\nA sustain champion naturally should not have amazing sustain in lane, or shouldn't have huge ramping sustain.\n\nBut deliberately creating periods of time when a champion can't do what they're supposed to as \"windows of weakness\" is not fun or interesting, and has been distancing me from this game for a while.","replies":[{"poster":"Angry Monster","date":"2016-07-03T11:03:23.373+0000","up_votes":1,"down_votes":0,"body":"happens to tanks all the time.","replies":[{"poster":"Pierce The Veal","date":"2016-07-03T14:18:56.705+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angry Monster,realm=NA,application-id=3ErqAdtq,discussion-id=qsmGJUkM,comment-id=0002000000010001000000000000,timestamp=2016-07-03T11:03:23.373+0000)\n>\n> happens to tanks all the time.\n\nAnd assassins other than Zed, Fizz, Ekko.","replies":[]}]}]},{"poster":"bleufromage","date":"2016-07-03T11:16:25.535+0000","up_votes":1,"down_votes":0,"body":"It's called cc. It's impossible to sustain as aatrox while cc'd. Much like to except aatrox can't go untargatable while dealing shit tons of dmg  to 4 targets at once","replies":[{"poster":"Angry Monster","date":"2016-07-03T11:20:58.928+0000","up_votes":1,"down_votes":0,"body":"That is not 1v1 health","replies":[{"poster":"bleufromage","date":"2016-07-03T13:51:58.286+0000","up_votes":1,"down_votes":0,"body":"Okay I must be stupid what is 1v1 health and what is 5v5 health?","replies":[]}]}]}]}]},{"poster":"macromite","date":"2016-07-03T02:03:24.463+0000","up_votes":2,"down_votes":1,"body":"AA has a window of power. It's during combat, and it only applies if he is in melee range. anything with poke is a good way to beat him up, and anyone who can disable him or force him away works.","replies":[]}]},{"poster":"Battlecast Sona","date":"2016-07-02T20:49:08.070+0000","up_votes":1,"down_votes":0,"body":"the reason aatrox isn't getting changes is the same reason vlad didn't get changes until his rework - the sustain pattern is too good when it's ahead and so it has to be awful intentionally so that it's not oppressive early. They can't just remove lifesteal from the game though like they did with Vlad - it's much harder to gate Aatrox buyable sustain without changing his core identity as a champion.","replies":[{"poster":"Pierce The Veal","date":"2016-07-03T10:46:26.687+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Battlecast Janna,realm=NA,application-id=3ErqAdtq,discussion-id=qsmGJUkM,comment-id=000200000002,timestamp=2016-07-02T20:49:08.070+0000)\n>\n> the reason aatrox isn&#x27;t getting changes is the same reason vlad didn&#x27;t get changes until his rework - the sustain pattern is too good when it&#x27;s ahead and so it has to be awful intentionally so that it&#x27;s not oppressive early. They can&#x27;t just remove lifesteal from the game though like they did with Vlad - it&#x27;s much harder to gate Aatrox buyable sustain without changing his core identity as a champion.\n\nI mean sustain isn't honestly that bad of a thing. It's only Riot's take on sustain that makes it a \"bad\" thing. Honestly I'm of the belief that melee ad carries shouldn't be based on mobility, but sustain, with ranged ad carries being based on kiting, and much less healing through attacking.","replies":[{"poster":"Battlecast Sona","date":"2016-07-03T23:44:37.443+0000","up_votes":1,"down_votes":0,"body":"it's just very hard to tell how effectively you can kill an enemy champ if they have high levels of sustain. This is further exacerbated by Aatrox's passive.\n\nBasically it's not that sustain is bad, it's that all sustain champs will feel like garbage in lane. Having access to high levels of sustain is only really an issue in a 1v1 laning scenario, where you can just hit creeps and get all your health back with no interaction. In the jungle it's balanced by camps not being infinite - you will eventually have to leave your jungle. In lane there's no such balancing mechanic, and so sustain has to be heavily gated. What I'm saying is that the \"easy\" fix would be to make Aatrox not have access to lifesteal from items at all - this would allow the numbers on his passive sustain to be better because they wouldn't become broken immediately when coupled with sustain from items (this is how they fixed Vlad). This ends up being pretty poor though because there are a number of items that Aatrox synergizes with that give lifesteal, and forcing him to build something else pretty seriously limits his item building options (unlike Vlad, who only had WotA).\n\nMelee AD carries will be able to be based on sustain when it doesn't exist on items, and not before. Riot is learning that. Champions that can double dip just end up being way too strong when their numbers are decent and useless when they're not.","replies":[]}]}]}]}]},{"poster":"Rito Staff","date":"2016-07-02T13:14:24.263+0000","up_votes":4,"down_votes":0,"body":"Aatrox graphic design is beautiful. He needs a something something in his kit to make it interesthing but not super popular and obnoxious :p","replies":[]},{"poster":"Blue Moon Wolf","date":"2016-07-02T21:35:23.075+0000","up_votes":4,"down_votes":1,"body":"He is likely the highest on the list for champs to be focused on when they go to work on divers, which will likely come after the Assassin update. there are plenty of divers that need work, but he is very likely the one that needs it the most. We won't know for sure till after the assassin update during preseason, then we would still have to wait around another 6 months after we find out for sure, but the Diver update is high on the class update list and he is the one with the biggest issues out of the diver class, so he will very likely see him get work done then.","replies":[{"poster":"morris1","date":"2016-07-03T10:57:36.428+0000","up_votes":2,"down_votes":1,"body":"TL;DR he will have 45% winrate for another year.","replies":[]}]},{"poster":"Oleandervine","date":"2016-07-03T14:28:04.368+0000","up_votes":2,"down_votes":0,"body":"He can't be Yoricked because unlike Yorick, Aatrox has had skins and has been playable since his release. Yorick was dead on launch, he never received any skins past his two launch skins, and it took him the better part of 5 years to actually have Riot act on him to make him viable. Aatrox just got a skin about 2 years ago with the Bilgewater event, and he's had his ups and downs in play. If anything, he's being Evelynned, since she's seen play, had skins, but has a game breaking mechanic that Riot is forced to keep her in the dumpster for or else it will become a terror.","replies":[]},{"poster":"Abyssphere","date":"2016-07-03T14:44:05.413+0000","up_votes":3,"down_votes":2,"body":"Aatrox players must be the most dramatic of the whole playerbase. Being Yoricked means being ignored basically from the very second you were released - no skins, no buffs, no attention, not even a single week on the free rotation. Aatrox has received skins, he's received balance changes (numerous buffs last year), and he's on the free rotation no less than you'd expect. He is not a hugely favoured champion, no, but loads of champions aren't. There's only one champion in Yorick's state.","replies":[]},{"poster":"Beuhlakor","date":"2016-07-02T15:34:48.078+0000","up_votes":2,"down_votes":1,"body":"At this point, I think that it is quite obvious that Aatrox has ben Yoricked.\n\nIt annoys me because he is the champion that I like the most (mostly because of his graphic design) and I used to main him, but I understand why he is ignored because his gameplay makes him incredibly hard to balance and potentially extremely toxic to play against.\n\nRiot is going to take care of the assassins but when they will rework the Diving Fighter class, I'm pretty sure that Aatrox will be one of the main \"rework\" (probably Cassio-level rework).","replies":[]},{"poster":"Zero Skill Tank","date":"2016-07-02T15:29:08.200+0000","up_votes":2,"down_votes":1,"body":"Aatrox has all the problems Yorick's kit has, except those obnoxious ghouls. If he ever is strong, you can not get rid of him with any reasonable force.\n\nOn top of that, his kit has nothing particularly interesting in it, so it's not likely Riot will find it worth it to do some more serious work on him - like a small rework, along the lines of what Ahri got one day.\n\nThat's sad.\n\nBut also he's not missed.","replies":[]},{"poster":"Wild Geese","date":"2016-07-03T02:14:30.556+0000","up_votes":1,"down_votes":0,"body":"I think Blood Price needs to proc on every hit or every other hit.\nOf course, the scaling could go down on it, but every hit would be better than every 3rd.. the 3 hit mechanic only gives him those sustain windows with the Blood Thirst, but for Blood Price it just limits his damage unless his attackspeed is going at full.","replies":[{"poster":"SSmotzer","date":"2016-07-03T11:12:17.661+0000","up_votes":1,"down_votes":0,"body":"It does proc with every other hit, when he has Rageblade","replies":[]}]},{"poster":"Eedat","date":"2016-07-02T13:00:41.130+0000","up_votes":1,"down_votes":0,"body":"Yeah pretty much","replies":[]}]}