{"poster":"ViperNight","date":"2019-10-14T00:25:09.799+0000","title":"14 day ban?","subforum":"Player Behavior","up_votes":2,"down_votes":4,"body":"so i recently got a 14 day ban for toxic behaviour and yes i have to admit i was being quite toxic. but it wasnt for no reason the duo botlane decided they didnt want to play anymore and wanted to afk in base, they would walk out of base o reset the timer then walk back in. anyway i got really tilted and started flaming them telling him to game end ect. they decided that instead of afking now they would try and stop them from ending and flame me back harder for the remainder of the game. i told everyone to report them for negative attitude and trolling int he lobby and left and within a minute i had a 14 day ban i feel it was unjust but it doesnt matter, ive never been banned never been restricted,\r\n im just wondering what happens when i get unbanned \r\nhow easy is it to get another 14 day ban or is it imidiatley a perma ban","replies":[{"poster":"Imperial Pandaa","date":"2019-10-14T00:28:49.860+0000","up_votes":3,"down_votes":0,"body":"After a 14 day ban, next punishment for verbal infractions is a perm. No matter how trivial it may seem.","replies":[]},{"poster":"MrFawknSunshine","date":"2019-10-14T00:28:30.762+0000","up_votes":2,"down_votes":0,"body":"it dont matter why you are toxic. \n\nverbally abuse/flaming/hate speech etc etc is against the rules\n\nyou broke them and now are punished.\n\nas far as perma ban from this point well consider yourself on really really thin ice and you are a fat boy trying to cross it. \n\nbasically any infraction that is legit will result in perma ban. \n\nso my advice to you going forward do not use chat. do not directly speak to another player via chat. \n\nkeep it generic and on topic of game. \n\njungle top, lets baron. push mid etc like that.","replies":[]},{"poster":"MagicFlyingLlama","date":"2019-10-14T01:08:07.414+0000","up_votes":1,"down_votes":0,"body":"You get this big warning that says you will be permbanned the next time you break any rule, and have to manually type in something like \"i understand\"..","replies":[{"poster":"ViperNight","date":"2019-10-28T06:05:20.196+0000","up_votes":1,"down_votes":0,"body":"What does honour change about reports or getting banned cause my honour just got unlocked","replies":[{"poster":"MagicFlyingLlama","date":"2019-10-30T01:25:02.124+0000","up_votes":1,"down_votes":0,"body":"Honor gets reset on restrictions or bans, to my knowledge. Honor level does not change how reports or punishments behave.\n\nAfter a certain number of \"clean\" games (not an amount of time, and not a fixed number - it seems to depend on how well you perform and honor gained) hextech and honor rewards are unlocked again.","replies":[]}]}]},{"poster":"ViperNight","date":"2019-10-14T00:30:16.276+0000","up_votes":1,"down_votes":1,"body":"also a bit more info and questions \ni had a worlds pass what happens witht that is it gone?\nthe ban was off of 1 game\nif the worlds pass stays on my account do i keep my rewards and or missions","replies":[{"poster":"rujitra","date":"2019-10-14T00:33:20.515+0000","up_votes":1,"down_votes":0,"body":"Your pass will still be active, but you cannot use it during the 14 day suspension. You do not get any extensions to missions or alternative missions - any missions that are time locked (ex: first win of the day) will simply be unobtainable by you.\n\nAny rewards you were able to get before the ban, or after the ban ends (if applicable) will still be yours.","replies":[{"poster":"ViperNight","date":"2019-10-28T06:02:54.217+0000","up_votes":1,"down_votes":0,"body":"Ok thank you","replies":[]}]}]}]}