{"poster":"Partygurke88 ","date":"2017-11-08T15:32:11.427+0000","title":"Wie bekomme ich BE.  also Blaue essenzen? also mit dem neuen update?","subforum":"Allgemeiner Chat","up_votes":4,"down_votes":0,"body":"WIe bekomme ich blaue essenzen?","replies":[{"poster":"Miikâ","date":"2017-11-11T20:50:09.348+0000","up_votes":4,"down_votes":0,"body":"hoffe die ändern das wieder, dass man nach jmd game so 100 BE dann bekommt ...\n{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Anubis1306","date":"2017-11-18T18:02:47.632+0000","up_votes":2,"down_votes":0,"body":"Ich finde ebenfalls, das man zu wenig Essenzen bekommt. Ich fand das vorher mit ep nen gutes System. Das mit lvl-up ist nice und alles. Aber wie soll man denn jetzt groß an weitere Champs kommen ohne vorher gefüllt Jahre zu grinden...oder Echtgeld zu lassen. Ich hab nix dagegen mir meine Sporen zu verdienen. Im Gegenteil.\nAber dennoch. {{sticker:zombie-brand-clap}} \nZudem es unterschiedlich ist, was du an Masse in der Kapsel hast. Es hieß, es sei vereinfacht worden mit der Fusion von EP und den Essenzen. Aber ich sehe das ne wirklich. Gründe waren unter anderem, dass es für Newcomer zu lange dauerte um eben an High-cost Champs zu gelangen. Nun ich finde, das wurde nun nicht grade besser gemacht. Zu dem das Entzaubern der Championsplitter grad mal nen Bruchteil (ca 1/3) an Essenzen bringt.  Und man die ja auch noch für andere Dinge braucht.\n\nKann mir das wer erklären? Andere Sichtweisen?  Vlt hab ich auch nur eine zu eingeschränkte Sicht auf die Dinge hier...{{sticker:sg-zephyr}} \n\nP.S.: Wäre schön wenn das sachlich bliebe und ne gleich einer mit \"Idiot, Moron etc oder Bist du dumm\" um die Ecke kommt;) Nur weil er das ganze besser zu begreifen glaubt.","replies":[]},{"poster":"Mr Bo","date":"2017-11-09T20:44:30.665+0000","up_votes":2,"down_votes":0,"body":"Sind diese Lvl-up Kapseln wirklich der einzige weg an BE zu kommen? Ich habe zwar weder durch lvl-ups selbst, noch über Spiele oder gar gewonnen Spiele Essenzen bekommen, sondern nur in dem ich nach dem lvl-up eine Kapsel in meinem Hextech loot bekam, die ich öffnete und einen Championsplitter heraus bekam, den ich dann entzaubere und bekam ca 900 BE.\n{{sticker:sg-soraka}} \nIch weiß zwar nicht ob man die BE in Zukunft auch für andere Sachen als Champoins oder Championssplitter beutzen kann (wie IP/EP im alten system), aber 900 BE nach ca. 15 games (mit 2 dailys) und einem lvl up kommt mir wenig vor. \n{{sticker:sg-lux-2}} \n\nLG Mr Bo","replies":[]},{"poster":"Serlaya","date":"2017-11-08T15:36:15.570+0000","up_votes":1,"down_votes":2,"body":"Indem du Lvl upst. Du kriegst ne unevrschlossene Kiste in der Loot drin ist.","replies":[]}]}