{"poster":"Zamki","date":"2016-08-20T21:27:11.964+0000","title":"Bullies","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":1,"body":"Ich hatte gerade das warscheinlich schrecklichste Spiel seit ich LoL spiele.\r\n\r\nEs ging von anfang an alles schief was schief gehen konnte, ich muss gestehen das ich auch nicht wirklich gut gespielt habe !\r\nAber das ich dann noch von meinen eigenen 4 Teammates, die im &uuml;brigen auch nicht gerade &uuml;berragend gespielt haben, so heftig geflamed, provoziert und beleidigt werde kann ich echt nicht mehr nachvollziehen.\r\nIch habe versucht ruhig zu bleiben, obwohl ich innerlich immernoch am kochen bin.\r\nDiese Community ist, au&szlig;er weniger ausnahmen, einfach nur grauenvoll !\r\nIch hoffe das solche Spieler zur rechenschaft gezogen werden und Ihren Account auf dauer verlieren.\r\n\r\nWenn sich jetzt Leute fragen was genau ich mit diesem Post bezwecken will: Nichts. Ich will einfach nur etwas Dampf ablassen !","replies":[{"poster":"Snappynator","date":"2016-08-20T21:37:15.884+0000","up_votes":1,"down_votes":0,"body":"Kenne ich leider nur viel zu gut. In League of Legends spielen viele Spieler, die unter 18 Jahre sind, dass heißt, es sind meist Kinder. League of Legends ist für jeden kostenslos Spielbar und wie du dann weißt, wollen die \"noch nicht erwachsene\" Spieler natürlich immer gewinnen.\n\nMein Tipp:\nSuch dir im Community bzw. im Forum einen Team, dann passt das mit den Spielen und dann hast du auch weniger Stress mit den anderen Spielern.","replies":[{"poster":"Humpelstilzche","date":"2016-08-20T21:49:26.119+0000","up_votes":2,"down_votes":0,"body":"> Kenne ich leider nur viel zu gut. In League of Legends spielen viele Spieler, die unter 18 Jahre sind, dass heißt, es sind meist Kinder\n\n15% um genau zu sein, also keinesfalls die Mehrheit. Das Durchschnittsalter der LoL-Community liegt jenseits der 20. \nDarüber hinaus ist mittlerweile erwiesen dass jüngere Spieler in keinster Weise toxischer sind als ältere Spieler. \n\nEs ist natürlich sehr verlockend die bösen pubertierenden Teenager zu beschuldigen, aber sorry, so einfach ist das leider nicht. Bzw, konkreter gesagt: Es ist schlicht und einfach falsch, erwiesenermaßen. Für nähere Infos empfehle ich die Lektüre des wissenschaftlichen Papers \"What's in a name\" zu dem Thema.","replies":[{"poster":"Snappynator","date":"2016-08-21T09:39:12.027+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=KYnfKGf0,discussion-id=EjrgO2K7,comment-id=00000000,timestamp=2016-08-20T21:49:26.119+0000)\n> 15% um genau zu sein, also keinesfalls die Mehrheit. Das Durchschnittsalter der LoL-Community liegt jenseits der 20. \n> Darüber hinaus ist mittlerweile erwiesen dass jüngere Spieler in keinster Weise toxischer sind als ältere Spieler. \n\nOkay. Das hätte ich wirklich nicht erwartet... . xD","replies":[{"poster":"knl","date":"2016-08-22T13:15:58.071+0000","up_votes":1,"down_votes":0,"body":"Ich muss sagen ich bin 13 und flame nie und ja, das Bronze Vorurteil stimmt ,aber ich hatte noch keinen Bann und ragequite nie,\nman also keines falls sagen das jüngere Spieler immer (öfters) Flamen wie der obige post bereits sagt.","replies":[{"poster":"Braín Power","date":"2016-08-23T08:24:04.217+0000","up_votes":2,"down_votes":0,"body":"Hey, jetzt muss ich ja auch noch meinen Mist dazugeben .. Unzwar ich selbst bin auch erst 15 Jahre alt, und Platin V also das mit dem Bronze stimmt schonmal nicht wirklich, und des weiteren kann ich es verstehen dass manchmal Spieler andere Spieler Bullyn, da sie eventuell einen Schlechten Tag hatten oder zu viele schlechte Erlebenisse in kurzer Zeit hatten und dann (ja es ist nicht schön dass sie das Tun) den Frust einfach so auf andere Herauslassen. BTW.. Ich muss sagen ich bin nicht ganz unschuldig ich bin auch oft genug schon Toxic gewesen, und verstehe auch wie sich es anfühlt Gebullyd zu werden UND ich weiß es ist nicht schön doch manchmal kann man es einfach nicht mehr zurück halten\n\nMFG","replies":[]}]},{"poster":"Dela The Rascal","date":"2016-09-17T15:55:14.214+0000","up_votes":1,"down_votes":1,"body":"Die Flamen alle gut egal ob 13 oder 30","replies":[]}]}]}]},{"poster":"Oriius","date":"2016-08-20T21:56:53.329+0000","up_votes":4,"down_votes":4,"body":"Am schlimmsten ist es wenn man ein 2er premade im team hat das sind zu 99% die größten spackos ^^ da kann man beinahe sagen ok ich geh afk .. bringt eh nix xd","replies":[{"poster":"Nohgolgh","date":"2016-08-20T23:44:20.432+0000","up_votes":3,"down_votes":3,"body":"Und damit zwei Unschuldige bestrafen...solche Leute habe ich gern im Team.","replies":[{"poster":"Oriius","date":"2016-08-21T02:06:48.448+0000","up_votes":2,"down_votes":2,"body":"***","replies":[{"poster":"Der Großmugister","date":"2016-08-21T08:54:21.149+0000","up_votes":3,"down_votes":1,"body":"Wenn ich schreibe: Ich würde beinahe sagen, du bist ein A**loch, ist das trotzdem unfreundlich, also bitte...","replies":[]}]}]},{"poster":"Wernicke","date":"2016-08-21T07:47:59.492+0000","up_votes":2,"down_votes":2,"body":"Haste leider Recht! Premades sind leider immer so ne Sache. Man soll ja nicht verallgemeinern, aber meistens endet das leider nicht gut mit premades im team, da diese sich beim kleinsten fehler anderer, oder auch beim eigenen Fehler, aus selbstschutz und Verteidigung, zusammen rotten und andere vollflamen :/","replies":[{"poster":"TeoX796","date":"2016-08-27T23:30:54.124+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Wernicke,realm=EUW,application-id=KYnfKGf0,discussion-id=EjrgO2K7,comment-id=00020001,timestamp=2016-08-21T07:47:59.492+0000)\n>\n> Haste leider Recht! Premades sind leider immer so ne Sache. Man soll ja nicht verallgemeinern, aber........\n\nPEGIDA hat angerufen...sie wollen ich dummen sprüche zurück.....{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"Wernicke","date":"2016-08-28T12:38:22.165+0000","up_votes":1,"down_votes":1,"body":"Dann ma los!! Wird glaub ich Zeit... \nDu kannst übrigens nicht Erfahrungen von anderen Spielern diffamieren mien Jung. Ok, kannst du doch, aber dann biste nicht besser als deine hier aufgeführte Organisation mit denen du dich anscheinend sehr gut verstehen würdest. hf.","replies":[{"poster":"TeoX796","date":"2016-08-28T12:48:15.958+0000","up_votes":1,"down_votes":2,"body":"ist da eine beleidigt XD..gut so\n\ndie Community ist so leicht zu reizenXD{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Wernicke","date":"2016-08-28T15:13:15.206+0000","up_votes":2,"down_votes":1,"body":"Nicht wirklich, aber das mit der Umkehr Taktik solltest du vlt noch mal üben, auch wenn ich dir dadurch jetzt deinen´, jedenfalls von dir so vorgestellten, coolen Abgang inkl \"coolen\" Spruch versaut habe^^ Sry dude ^^\nSoooooo, und jetzt lass ich dir das letzte Wort damit du noch mal mit ner coolen Ansage die Runde hier verlassen kannst ;)\nDu musst ja schließlich noch weg, Verabredung und so ;D","replies":[{"poster":"TeoX796","date":"2016-08-28T15:41:39.272+0000","up_votes":1,"down_votes":3,"body":"wow....bist du cool=)\n\nbitte schick mir ne Anleitung wie ich so \"CooL\" werden kan wie du=)\n\nkleiner....glaubst du wirklich mich juckt es was du denkst oder sagst`?XD\n\nich glaube du schätzt dich zu hoch ein...aber gut was erwarte man von der Deutschsprachigen Community....\n\naber bitte=) mach weiter dan hab ich wenigsten was zu lachen=) bitte bitte=)","replies":[]}]}]}]}]},{"poster":"Dela The Rascal","date":"2016-09-17T15:56:52.344+0000","up_votes":1,"down_votes":1,"body":"Is so !","replies":[]}]}]},{"poster":"Released Ape","date":"2016-08-20T21:45:49.402+0000","up_votes":1,"down_votes":0,"body":"> Wenn sich jetzt Leute fragen was genau ich mit diesem Post bezwecken will: Nichts. Ich will einfach nur etwas Dampf ablassen !\n\nImmerhin bist du ehrlich, der Rest denkt sie würden mit ihren subjektiven Fakten eine Neuheit präsentieren.","replies":[]},{"poster":"CCG Inu XIII","date":"2016-08-27T19:31:33.449+0000","up_votes":1,"down_votes":2,"body":"Lass mich raten: Brony?!","replies":[]}]}