{"poster":"AZEdeluxe","date":"2015-03-03T07:23:17.958+0000","title":"Komme nicht in Renked Game","subforum":"Melde einen Bug","up_votes":2,"down_votes":1,"body":"Habe eben nen ranked gestartet (habe gersten den ganzen Tag gezockt und nichts an meinem PC verändert) und komme nicht ins Game.\r\nDer Bildschirm wurde nach der Champselect schwarz und das LOL Logo war in der MItte, aber anstatt, dass dann die gepickten CHamps gegenübergestellt werden dauert es ne Weile und dann kommt folgende Fehlermeldung:\r\nhttp://fs2.directupload.net/images/150303/yo3l8a9h.jpg\r\n[URL=http://www.directupload.net][IMG]http://fs2.directupload.net/images/150303/yo3l8a9h.jpg[/IMG][/URL]\r\nHabe aber an meiner FW nichts geändert. Habe Sie dann trotzdem mal ausgemacht hilft auch nix. Was zum Geier ist da los? Liegt das an den Wartungen? Danke für die LP -.-\r\nWäre über Hilfe dankbar\r\n\r\nPS: Schaltet mal bitte ne Funktion frei, dass man die Grafik in den Texe einfügen kann und die nicht untendrangehängt wird, oder zumindestens mit codes sichtbar machen kann -.-","replies":[{"poster":"God Usopp","date":"2015-03-03T09:06:01.903+0000","up_votes":1,"down_votes":0,"body":"Kann man nix machen wenn du kein RENKED spielen kannst musst du leider das Spiel deinstallieren #Kappa","replies":[]},{"poster":"AZEdeluxe","date":"2015-03-03T07:38:32.532+0000","up_votes":1,"down_votes":0,"body":"so ein mist da hat man als student einmal frei und möchte zocken und dann das...\necht jetzt riot gg ^^ hahahahahhahaha :(","replies":[]},{"poster":"xxCheatsrichter","date":"2015-03-03T07:36:02.487+0000","up_votes":1,"down_votes":0,"body":"Wartungsarbeiten jeden dienstag.","replies":[]},{"poster":"Kalbasa","date":"2015-03-03T07:31:28.385+0000","up_votes":1,"down_votes":0,"body":"Wahrscheinlich wird das jetzt noch ne weile anhalten und anschließen wird das game komplett gelöscht... hatte das erst letzte woche und nen kumpel auch.. es wird gar nicht erst in der historie  angezeigt als ob es nie stattgefunden hätte... könnte an der wartung liegen","replies":[]}]}