{"poster":"Giunco171","date":"2015-12-03T14:06:41.743+0000","title":"consigli su zed","subforum":"Campioni e gameplay","up_votes":1,"down_votes":2,"body":"(premessa , &egrave; la prima discussioen che apro non sos e e la sezione giusta non rompete su errori grammaticali perche e un cane che scrive k ? ) chi mi da consigli su zed o un video dove un italiano lo spiega bene? lo ho comprato, mi diverte, &egrave; figo, &egrave; swagg ma sono una sega ad usarlo quindiiiiiii qualche main zed here?               \r\n {{champion:238}} {{item:3070}}","replies":[{"poster":"LKV2","date":"2015-12-03T14:49:37.266+0000","up_votes":5,"down_votes":0,"body":"Se giochi in low elo:\nlvl 1 harassi di Q\ndal lvl 2 w+q\ndal livello 3 w (in faccia)+e e quando si muove Q\nse hai harassato bene al lvl 6 W+w+r+ignite+e+q+r e fai il first blood.\nSe perdi la lane al lvl 6 fai finta di andare back e roammi in una delle 2 lane pushate alla morte e vai a fare una kill/assist.\nin teamfight il tuo compito é uccidere UNA persona. scegli il pg squishy piu feedato di tutti: flash (opzionale, dipende da come é messa la gente. flashare da dietro un muro é particolarmente efficace.)+R+ignite+botrk+e+q+r poi scappi ulteriormente con w+w.\ndopo che sei di nuovo safe valuti se andare in melee e uccidere uno a 3 hp di AA oppure stare nella backline e harassare di Q.\n\nP.S. contro gli AP il mangiamagia (insomma la spada che da AD e MR é fortissima. comprala)\nP.S. (2) non pushare come un bimbo speciale la lane se vuoi harassare con W+Q. (Tanto se sei in low elo ti scorderai di wardare e la minimappa sará simile ad un buco nero).Quando l'ombra é in cooldown hai la mobility di un pinguino col mal di stomaco.","replies":[{"poster":"xxHunter2000xx","date":"2015-12-07T08:55:18.994+0000","up_votes":1,"down_votes":0,"body":"Tralasciando che tutto quello che hai detto su zed è giustissimo\nTi meriti tutti i +1 (o almeno il mio) per \" non pushare come un bimbo speciale la lane se vuoi harassare con W+Q\"","replies":[]}]},{"poster":"Polarize","date":"2015-12-03T17:10:47.157+0000","up_votes":2,"down_votes":0,"body":"Rune con ad quints, ar pen red, 5% cdr e mr sulle blue, hp/armor sulle gialle.\n\nMastery 12/18 con il thunderlord e la pen mista.\n\nBuild: prendi la tiamat, ghostblade, malmortius bc finisci hydra e poi vedi.\n\nBoots: ionia, mercury o tabi.\n\nSe nei livelli 1-3 vedi che è il nemico è davvero bravo a schivare le q allora maxa la\nE","replies":[]},{"poster":"Pasticcionex","date":"2015-12-03T14:15:03.094+0000","up_votes":1,"down_votes":0,"body":"Vuoi un consiglio? Non lo usare o almeno non in ranked.\nZed può essere tutto quello che ti pare tranne una cosa, Utile. In early si, spacca poi con le nuove maestrie è op anche in mid game si fa tutti 1 vs 1... Però poi arriva il team fight e lui diventa come un afk, INUTILE, basta che nel team nemico l' adc si compri mercury e l'apc zhonya e l' utilità di zed svanisce, lui muore e morirà sempre nei tf perchè lo stunnano appena divneta targhettabile e dato che praticamente si tuffa in mezzo a 5 ci muore. Se vuoi carryare io telo sconsiglio anche perchè secondo me per giocarlo bene devi proprio spenderci un sacco di tempo, fino ad ora non ho mai visto un zed carryare (nella s5 intendo) anche se si feeddava a palla...Questa è come la penso, Se lo ho in team so che è persa e se lo ho contro sono felice!","replies":[{"poster":"xxHunter2000xx","date":"2015-12-07T08:57:46.620+0000","up_votes":1,"down_votes":0,"body":"Rega siete divertenti xD\nil primo \"Hai nominato un champ che non mi piace quindi skifoooooooooo\"\nil secondo \"Hai insultato il champ che mi piace quindi skifooooooooo\" xD","replies":[]},{"poster":"Giunco171","date":"2015-12-03T15:46:33.567+0000","up_votes":1,"down_votes":0,"body":"cosa non ti e chiaro di \" mi diverte , è figo ed è swagg\" ? io gioco chi mi diverte non voglio fare il pro quindi non mi interessano commenti come il tuo. thx","replies":[{"poster":"Pasticcionex","date":"2015-12-04T09:03:08.107+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Giunco171,realm=EUW,application-id=cAOZwaUi,discussion-id=9VEapPyp,comment-id=00000000,timestamp=2015-12-03T15:46:33.567+0000)\n>\n> cosa non ti e chiaro di \" mi diverte , è figo ed è swagg\" ? io gioco chi mi diverte non voglio fare il pro quindi non mi interessano commenti come il tuo. thx\n\nQuindi ti diverte perdere...Che figo! Non sei l'unico non ti preoccupare","replies":[{"poster":"Giunco171","date":"2015-12-04T09:08:03.895+0000","up_votes":1,"down_votes":0,"body":"Le persone come te non capisco se lo fanno apposta a essere così sfottenti e coglioni o ci sono nati veramente","replies":[{"poster":"Pasticcionex","date":"2015-12-04T09:57:14.907+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Giunco171,realm=EUW,application-id=cAOZwaUi,discussion-id=9VEapPyp,comment-id=0000000000000000,timestamp=2015-12-04T09:08:03.895+0000)\n>\n> Le persone come te non capisco se lo fanno apposta a essere così sfottenti e coglioni o ci sono nati veramente\n\nScusa i perdenti non mi vanno giù molto :(","replies":[]}]}]}]}]},{"poster":"Harambenski","date":"2015-12-03T21:44:25.938+0000","up_votes":1,"down_votes":0,"body":"Aggiungimi ID : S7H Sh0cZ ^^\n\nQuando mi vedi On contattami e vedo come consigliarti .\n\nIo sono Main zed 193k vedo che sai fare e ti do consigli !!!{{sticker:slayer-pantheon-thumbs}} \nBB","replies":[]},{"poster":"One Tax Man","date":"2015-12-03T16:20:18.236+0000","up_votes":1,"down_votes":0,"body":"È forte , anche se difficilotto da giocare \"bene\".\nStarta di Q , al 2 la W contro i ranged o la E contro i melee , ed al 3 quello che non hai messo al 2.\nMaxa R-Q-E-W : rusha la {{item:3142}} che è l'item migliore per snowballare. Visti i recenti cambiamenti io lo preferisco con tanto \"Raw Damage\" ,cioè item che danno un sacco di AD : {{item:3142}}{{item:3036}} ( {{item:3156}} solo se tanto danno AP contro ){{item:3812}} {{item:3074}} {{item:3158}} {{item:3139}} , considera il {{item:3071}} se hanno troppi tank e/o non puoi prendere gli Ionian.\nLa combo ora è cambiata : prima era più efficiente fare WQE , ora visti i cambiamenti è meglio WE e utilizzare lo slow della E per \"mirare\" le Q.\nMettici il Thunderlord e aspetta sempre che sia pronto per fare extra danno.\nDel resto molte cose le imparerai giocandolo.","replies":[]},{"poster":"Tankerous","date":"2015-12-03T15:48:58.597+0000","up_votes":1,"down_votes":0,"body":"Dai un'occhiata a canali Twitch come quello di Zed Is God (granted, non streamma da più di un mese, ma è un inizio).","replies":[]}]}