{"poster":"AleTer","date":"2019-06-26T16:26:58.771+0000","title":"Sono rimasto bloccato nel client","subforum":"Aiuto e supporto","up_votes":2,"down_votes":1,"body":"Ero in modalità spettatore, e come sono uscito, questa si è buggata, facendomi rimanere nel client senza poter fare nulla.","replies":[{"poster":"Dafne616","date":"2019-06-27T04:53:14.102+0000","up_votes":3,"down_votes":0,"body":"Stesso problema, 12 ore dopo\nHo provato ogni soluzione, ma il problema rimane, credo sia il file \"LeagueClientUxRender.exe\" perchè ogni volta che apro il client si apre pure questo. Provando a chiuderlo si riapre da solo, il client fa come se uscissi da una partita ma una volta che rientro nel client mi dice \"sei uscito dal gruppo\" e torno nella home senza poter fare assolutamente niente: non posso creare partite, guardare il profilo, entrare nel negozio etc\nHo provato a loggare con altri account, ma il problema rimane, ho loggato il mio account su un altro pc e lì il mio account worka, posso giocare etc.. quindi non è discorso di account ma di client. \nHo fatto la riparazione completa ma è stata completamente inutile, ho provato a disconnettere internet, sperando in qualche messaggio di errore di connessione da farmi uscire dallo spettatore, niente. \nPer ora ho segnalato il bug, mi resta solo da disinstallarlo e installarlo di nuovo ma spero vivamente di non dover arrivare a tanto, considerato il tempo che ci impiega a aggiornare tutto.\n\nPersonalmente è una cosa altamente irritante, dio caro ancora con questi stupidi problemi di client.\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"AntoCamp","date":"2019-06-28T07:46:28.708+0000","up_votes":1,"down_votes":0,"body":"Stesso problema che va avanti anche il giorno dopo, SCANDALOSO! La Riot questa volta mi ha davvero deluso.\nIeri ho provato ad entrare in partita 6 volte sul mio account e altre 4 sull'account di un mio amico e NIENTE, non posso giocare in alcun modo! Ti consiglio solo di non scomodarti a trovare rimedi perché ho passato il 27 a farlo e ti assicuro che ho fatto davvero di tutto come utente ma NIENTE NIENTE e ancora NIENTE! La situazione rimane la medesima: client buggato (non si vede, ad esempio, il tasto GIOCA) e non mi starta il caricamento partita. GG Riot se volevi fotterci tutti ci sei riuscita!","replies":[]}]},{"poster":"Grindelwałd","date":"2019-06-29T12:08:46.325+0000","up_votes":1,"down_votes":0,"body":"Io ho risolto il problema:\n\nNon so in seguito a quale di queste due operazioni ma ho risolto, ve le elenco entrambe:\n\n1) Avviare un file .bat in modalità spettatore di una partita pregressa e avviare contemporaneamente il client.\n2) Cancellare l'amico, la cui partita eravamo spettatori.\n\nConfermo che la soluzione è la numero 1. Perché purtroppo va ripetuta ogni volta che si avvia il client. Fastidiosissimo. Riot faccia qualcosa.","replies":[]},{"poster":"SirThomas03","date":"2019-06-27T07:51:01.165+0000","up_votes":1,"down_votes":0,"body":"Stesso problema anch'io","replies":[]},{"poster":"XxXHarlockXxX","date":"2019-06-26T16:30:04.506+0000","up_votes":1,"down_votes":0,"body":"anche io","replies":[{"poster":"EUphor1a","date":"2019-06-26T18:48:56.777+0000","up_votes":1,"down_votes":0,"body":"avete risolto in qualche modo?","replies":[{"poster":"XxXHarlockXxX","date":"2019-06-26T19:43:16.884+0000","up_votes":1,"down_votes":0,"body":"assolutamente no,e nessuno si degna di risponderci &lt;3","replies":[]}]}]},{"poster":"TeknoLoL","date":"2019-06-26T17:00:22.380+0000","up_votes":1,"down_votes":0,"body":"niente di nuovo, sei su lol","replies":[{"poster":"XxXHarlockXxX","date":"2019-06-26T17:40:02.793+0000","up_votes":1,"down_votes":0,"body":"lol","replies":[]}]}]}