{"poster":"JohannesBaum","date":"2017-04-03T11:30:45.900+0000","title":"Idee für neuen Champ","subforum":"Skin- & Champion-Konzepte","up_votes":0,"down_votes":1,"body":"Ich pers&ouml;nlich habe vor LoL schon andere MOBAs gespielt und dabei gab es einen Champion der mir besonders gut gefallen hat. Unzwar konnte dieser zwischen Schaden/schadensgeschwindigkeit und Leben wechseln. Abgesehen davon das Ich mir so einen Helden f&uuml;r LoL w&uuml;nschen w&uuml;rde, w&auml;re es au&szlig;erdem mal wieder eine neue Herausforderung f&uuml;r viele Spieler da dieser Champion einfach mal wieder &Uuml;bung bedarf und nicht wie Camille, ein Champ der schon ziemlich stark und nicht allzu schwer zu spielen war.\r\nDenn Ich finde das hat LoL mal wieder n&ouml;tig, eine Herausforderung.","replies":[{"poster":"Angel of revenge","date":"2017-04-06T11:00:03.249+0000","up_votes":1,"down_votes":0,"body":"Meinst du so etwas wie bei Jinx Ihrer Q?","replies":[{"poster":"JohannesBaum","date":"2017-04-06T13:55:00.933+0000","up_votes":1,"down_votes":0,"body":"Nein jinx kann man damit überhaupt nicht vergleichen\nAlso zumindest habe ich mir was anderes dabei gedacht","replies":[]}]},{"poster":"AI Yjuq","date":"2017-04-03T12:47:45.525+0000","up_votes":1,"down_votes":0,"body":"Erinnert mich stark an Morphling aus Dota2: http://dota2.gamepedia.com/Morphling\n\n> **Morph (Agility Gain)**\nMorphling shifts its form, pulling points from Strength and pouring them into Agility. The process is reversible. Additional points in Morph increase the rate of stat change. Passively grants bonus Agility.\n\n> **Morph (Strength Gain)**\nMorphling shifts its form, pulling points from Agility and pouring them into Strength. The process is reversible. Additional points in Morph increase the rate of stat change. Passively grants bonus Strength.","replies":[{"poster":"JohannesBaum","date":"2017-04-06T13:53:52.933+0000","up_votes":1,"down_votes":0,"body":"Ja ich sagte ja das ich den champ aus anderen mobas kenne aber wenn die mal sowas in der art einführen würden wäre das echt cool \nAlso ist meine meinung\nUnd nein jinx ist damit überhaupt nicht zu vergleichen","replies":[]}]}]}