{"poster":"MonsterGirlsFTW","date":"2016-08-30T08:28:58.381+0000","title":"Bug? With Auto-Fill in soloq in lower divisions.","subforum":"Help & Support (OCE)","embed":{"description":"Regardless of the fixes we've rolled out since the beginning of the 2016 ranked season, dynamic queue is still failing to meet player needs. More specifically, it's undermined competitive integrity at the highest levels of play. We're making a number of changes to ranked, starting with these two.","url":"http://na.leagueoflegends.com/en/news/game-updates/competitive/ranked-updates-now-live","image":"https://lolstatic-a.akamaihd.net/global-elements/0.0.31/images/esrb.jpg"},"up_votes":1,"down_votes":0,"body":"Hey guys, \r\n\r\nJust wondering about something. I recently tried for my Gold 2 &gt; Gold 1 Promos. I&#039;d already lost one and won one so I was up and ready to get into playing my final game. I started to queue and, as is now standard, the auto-fill logo popped up notifying me that I would potentially get another role if queue times got too long. \r\n&quot;No worries,&quot; I thought, as I was in promos. I knew that when they&#039;d made the change, they had stated and I quote, &quot; AUTO-THRILLED: When in promo series (between tier or division), players will be guaranteed one of their two selected roles &quot;\r\nWhat then happened was I was given the role of support and, due to being in promos, hesitated to dodge.\r\nLong story short I lost the game and promos, but rather I&#039;m just confused. I thought I wasn&#039;t supposed to be auto-filled when I was in promos. Is this a bug? And if it is, is there any way I can get that lp I lost back?\r\n\r\nThanks for taking your time to read this,\r\n\r\nRoarmulus","replies":[{"poster":"Tele","date":"2016-08-30T09:27:23.353+0000","up_votes":1,"down_votes":0,"body":"That change isn't on live yet unfortunately. If you read the pretext under \"[Autofill](http://na.leagueoflegends.com/en/news/game-updates/competitive/ranked-updates-now-live)\" it says:\n\n+ _\"Players in their promo series will be guaranteed one of the two roles they select **later in this patch**.\"_\n\nSorry :(","replies":[{"poster":"MonsterGirlsFTW","date":"2016-08-30T10:17:07.929+0000","up_votes":1,"down_votes":0,"body":"Ah thanks, didn't notice it.","replies":[]}]}]}