{"poster":"fran128","date":"2017-01-30T05:19:39.047+0000","title":"¿Qué pasó con el Tribunal?","subforum":"Problemas Técnicos","up_votes":5,"down_votes":4,"body":"&Uacute;ltimamente perd&iacute; mis partidas por culpa de los trolls y los flamers y los reporto y veo que Riot no hace nada.  Riot nos dijo que el Tribunal iba a estar como m&aacute;ximo a principios de 2016 y eso no pas&oacute;. Me gustar&iacute;a saber si lo van a poner o no porque este juego cada d&iacute;a se llena m&aacute;s de trolls y flamers y ellos me arruinan las partidas.","replies":[{"poster":"Yrox the Third","date":"2017-01-30T05:23:54.259+0000","up_votes":5,"down_votes":5,"body":"La idea del tribunal fue abandonada hace mucho, y fue lo mejor que Riot ha hecho.\n\nEl sistema de ahora es mucho mejor, pero tiene un problema y es que si se castiga a alguien, solo los que emiten el ultimo report reciben el mensaje de que cierta persona fue castigada, no todos los que reportaron.","replies":[{"poster":"I am reformed","date":"2017-01-30T05:33:53.908+0000","up_votes":4,"down_votes":1,"body":"El único problema que vos le ves a que una máquina determine si una persona merece que su cuenta quede totalmente inutilizada para siempre perdiendo todo lo que tiene, juzgando si su comportamiento estaba o no justificado, evaluando el contexto de la partida, ¿el único problema que vos le ves a eso es que solo a algunos le sale la notificacion de que banearon a alguien?","replies":[{"poster":"Yrox the Third","date":"2017-01-30T05:37:23.386+0000","up_votes":2,"down_votes":5,"body":"Sep, porque ese sistema falla muy pocas veces, de hecho, esa cantidad de veces se pueden contar con los dedos de las manos, el sistema esta hecho para ir comparando los casos del reportado con gente que fue baneada, y si ve similitudes, entonces actua.\n\nY en el caso de que DE VERDAD alguien haya sido castigado injustamente puede comunicarse directamente con Riot por medio del soporte y se le devolvera la cuenta sin problemas (obviamente, despues de que ellos mismos revisen el caso que puede llevar un poco de tiempo).","replies":[{"poster":"I am reformed","date":"2017-01-30T05:52:43.734+0000","up_votes":2,"down_votes":2,"body":"O sea que si 4 personas te trollean la partida, vos los flameas (lo normal, nadie tiene por que quedarse callado mientras le trollean una partida) te reportan los 9 y entonces te banean, ya que te va a comparar con otras personas que flamearon en otras circunstancias, no le podes ir a decir nada al soporte porque vos flameaste y tienen pruebas de ello, si hubiera un tribunal la persona evaluaria que le trollearon la partida y (si tiene 2 neuronas conectadas) no lo sancionaria. Y no me digas que \"por una partida no te banean\" porque tengo pruebas de que sí.\n\nSaludos","replies":[{"poster":"Yrox the Third","date":"2017-01-30T18:03:46.718+0000","up_votes":1,"down_votes":1,"body":">  vos los flameas (lo normal\n\nEse es el tema, NUNCA hay razon para flamear, y que tu lo creas asi no lo hace un hecho, Riot ha dicho muchas veces ya que por el simple hecho de flamear te estas arriesgando a ser castigado.\n\nY no, el sistema no te castiga por una partida aunque te reporten los 9, Riot tambien ha aclarado eso muchas veces, ademas considerando que dices que \"es normal flamear en defensa\" es muy facil concluir que ni siquiera sabes lo que es bien y mal visto a los ojos de Riot.","replies":[]},{"poster":"El Wekereke","date":"2017-01-30T16:15:52.960+0000","up_votes":1,"down_votes":1,"body":"Bueno, flameaste no? qué esperas? Facilmente pudiste haber evitado llegara a eso, reportarlos y que ellos eventualmente reciban su sanción;) Nada justifica el flameo","replies":[]}]}]},{"poster":"Kyousuke","date":"2017-01-30T05:52:39.795+0000","up_votes":1,"down_votes":3,"body":"emm NUNCA esta justificado maltratar a una persona o trollear una partida :D y si queda inutilizada es que anteriormente ya recibiste advertencias y castigos y la maquina te dio esas oportunidades, el programa se mejora cada vez que hay baneos y cada  vez se pule mas y mas, pero no pidas que por \"justificarte\" se te quite el baneo","replies":[]}]}]},{"poster":"I am reformed","date":"2017-01-30T05:24:39.195+0000","up_votes":2,"down_votes":1,"body":"no c bro disculpa","replies":[]},{"poster":"Avispaneitor","date":"2017-01-30T05:35:29.502+0000","up_votes":2,"down_votes":3,"body":"Cuando pusieron el tribunal fue un desastre, espero que nunca mas lo vuelvan a poner.","replies":[]}]}