{"poster":"Adokáh","date":"2019-08-21T00:03:52.607+0000","title":"GG Delay...","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"GG DELAY.. 1ra ranked luego de llegar de la U y perdi automaticamente por el delay del server. \r\n50 a 100 MS + Delay = GG","replies":[{"poster":"AC Wolf","date":"2019-08-21T00:12:52.213+0000","up_votes":1,"down_votes":0,"body":"Hey adokah! :D\n\nque tal bro? ^^\npasaba por aquí para informarle que Riot esta al tanto del problema, y que lo más probable es que haga un seguimiento desde este [Post](https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/dv7fHxEz-desconexiones-y-lag-en-partidas) Aunque al ser un problema externo, es decir de los provedores de internet, no tienen una fecha y hora estimada para solucionarlo D: .","replies":[{"poster":"Adokáh","date":"2019-08-22T00:28:30.378+0000","up_votes":1,"down_votes":0,"body":"Hey Wolf! gracias por pasar bro! ;) y lo siento por la respuesta tardia.. no jugue mas luego de lo ocurrido.\n\nEn cuanto al problema, solo hice este post para dar presencia, ya que no vi ningún aviso en el momento ni al respecto cuando perdí la partida, nuevamente gracias por pasar y un gusto como siempre! &lt;3","replies":[]}]},{"poster":"Era  CL","date":"2019-08-21T00:24:00.080+0000","up_votes":1,"down_votes":0,"body":"acá igual tengo problemas con el lagg del juego... \nme acabo de jugar una ranked.. y fue injugable...  luego le di a iniciar reparación completa del juego.. y nada...continuo con problemas\n\nes mas me  acabo de jugar una normal y es  completamente injugable..  y  en el chat con el resto de personas conectadas a la partida.. eran precisamente los jugadores chilenos los que poseen el problema...\n\nmi Internet del hogar se encuentra bien.. lo revise. y no tengo problema..\nes el juego de league of legends el que esta causando problemas. \n\nporfa solucionen l lo antes posible..\n\n{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"KuszacK","date":"2019-08-21T00:23:04.311+0000","up_votes":1,"down_votes":0,"body":"Podrían poner la alerta en el cliente al menos si ya están al tanto del problema, como para que la gente al menos sienta que están haciendo algo al respecto y deje de entrar a las partidas, así tal cual anuncian sus skin 1 mes antes de que salgan con bombos y platillos podrían poner la misma dedicación en este tipo de eventos no ?","replies":[]},{"poster":"AK Weirdo","date":"2019-08-21T00:16:24.524+0000","up_votes":1,"down_votes":0,"body":"Igualmente aquí, me downgradearon a D4 por culpa de esto.","replies":[]}]}