{"poster":"Xavanic","date":"2017-04-07T19:31:11.055+0000","title":"Can pantheon be given more counterplay?","subforum":"Gameplay","up_votes":17,"down_votes":8,"body":"Outside of playing a ranged champion in top lane...","replies":[{"poster":"AlienPrimate","date":"2017-04-07T19:35:42.826+0000","up_votes":8,"down_votes":2,"body":"Sustain champion?\n\n{{champion:266}} {{champion:31}} {{champion:2}} {{champion:23}} {{champion:48}} {{champion:5}} {{champion:83}} {{champion:154}} {{champion:19}}","replies":[{"poster":"Xavanic","date":"2017-04-07T19:45:16.906+0000","up_votes":4,"down_votes":11,"body":"First of all...who in the fuck would play warwick or zac top...secondly sustain doesn't help you when your sitting under your tower and pantheon is between you and your minions","replies":[{"poster":"Moooose3","date":"2017-04-07T20:15:48.672+0000","up_votes":3,"down_votes":2,"body":"Warwick top is actually played all the time. lol good try though","replies":[{"poster":"Xavanic","date":"2017-04-07T21:21:30.262+0000","up_votes":2,"down_votes":7,"body":"I've played it twice, got banned for trolling because I was playing warwick top...","replies":[{"poster":"Moooose3","date":"2017-04-07T21:23:47.574+0000","up_votes":5,"down_votes":2,"body":"I'm fairly positive that isn't why you were banned.","replies":[{"poster":"Xavanic","date":"2017-04-07T21:28:46.132+0000","up_votes":2,"down_votes":6,"body":"It really was, I am not toxic during my games as it accomplishes nothing, so unless not getting a kill in lane is a bannable offense","replies":[{"poster":"Chønklord","date":"2017-04-07T21:30:39.651+0000","up_votes":3,"down_votes":1,"body":"> I am not toxic during my games as it accomplishes nothing\n\nYou didn't say you didn't use chat at all, though....\n\nWhat's \"not toxic\" to you, most definitely is actually toxic/griefing/harassment, hence your ban.\n\nThere's no way you'd be banned for \"just playing WW top\", unless you combined it with toxic chat and/or intentionally feeding.","replies":[{"poster":"Xavanic","date":"2017-04-07T21:43:06.887+0000","up_votes":2,"down_votes":4,"body":"generally in those games i would go like 4/3 or 3/4, I was never once toxic (I barely even used chat other then to say my team needed to build armor or their over-extending), and I received a ban for negative attitude i believe it was","replies":[{"poster":"Moooose3","date":"2017-04-07T22:10:26.508+0000","up_votes":3,"down_votes":1,"body":"So then you had a negative attitude then and weren't banned for trolling. You might be slow.","replies":[]}]}]}]}]}]}]},{"poster":"CannonLordFreed","date":"2017-04-07T20:12:36.246+0000","up_votes":6,"down_votes":3,"body":"Wanna know a good way to get people to want to help you? By not being a dick to them. It's one thing to ask for help dealing with a champion you struggle with, but to be so rude and disdainful towards someone who offers advice isn't exactly... becoming...","replies":[{"poster":"Xavanic","date":"2017-04-07T21:26:31.342+0000","up_votes":4,"down_votes":5,"body":"I'm not trying to, but this suggestion was outright stupid....my problem with pantheon is when I play a melee champ I can't go near my minions because hes zoning me, generally the outcome is always the same, I enter lane, try to farm, get level 1 ganked by the jungler (resulting in me burning my flash) and from that point on the lane belongs to pantheon","replies":[]}]}]}]},{"poster":"nachocheeseeeee","date":"2017-04-07T21:42:10.342+0000","up_votes":4,"down_votes":0,"body":"His main weakness is that he falls off late game harder than most top laners, but of course at the cost of having one of the most powerful top laning phase. If you manage to survive the early game and avoid giving him kills for him to snowball you pretty much done your job to beat him later. As a {{champion:75}} top, I normally start with Spirit Fire and a {{item:1056}} to get some farm and poke. I know it slows me down from stacking Siphoning Strike, but either way Nasus builds armor with cdr. Pantheon would either have to counter build me to win the lane instead of going the typical lethality build to snowball, but if it gets to a point he can't kill me, since Wither destroys most AD champs, he pretty much becomes irrelevant. I think {{champion:14}} may also do well against him since he can stack HP infinitely but I'm not quite sure on that. I know old {{champion:98}} used to do well against him too, but now I don't know. Maybe {{champion:31}} would be a good option too. He has range and sustain and is more disruptive plus he stacks health making it harder for Pantheon to assassinate. ","replies":[{"poster":"Xavanic","date":"2017-04-07T21:47:06.313+0000","up_votes":1,"down_votes":1,"body":"The problem is when it is a good pantheon he doesn't have time to fall off as their usually ending around the 18-22 minute mark, due to pantheon being so massive due to his unopposed laning phase","replies":[{"poster":"Anidan","date":"2017-04-08T07:31:25.132+0000","up_votes":1,"down_votes":1,"body":"Then what you do is wait for his inevitable rework and support ideas people propose that could elongate the game so your odds of Riot maybe implementing some of them is increased and the games go on long enough for a late-game to exist. \n\nOr you pick champions that attempt to sustain regardless and don't bank on a huge early presence, like the aforementioned Nasus, Sion, Cho'gath... Karma top can also do well against him because she can harass him and she sustains herself fairly well with shields and heals, and with her root she's not bad with a gank either. Even better if she happens upon a blue buff given to her but obviously don't bank on that in top lane. Then you have someone like Swain who has good sustain and can keep himself going and will outscale Pantheon pretty quickly. There's options, they just aren't all the most obvious options. He doesn't like high sustain champions, and he isn't a fan of tanks that scale as the game goes on because they become an insurmountable obstacle to him--bonus points for the scaling tank because his team will probably blame him for not keeping you down.","replies":[]}]}]},{"poster":"PermabannedGaren","date":"2017-04-07T21:59:42.402+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Xavanic,realm=NA,application-id=3ErqAdtq,discussion-id=fFnEydLK,comment-id=,timestamp=2017-04-07T19:31:11.055+0000)\n>\n> Outside of playing a ranged champion in top lane...\n\nDon't bother playing a ranged champion top lane. He beats most of those too. \n\nThe best way to beat Pantheon is with a mage who can harass him and stop him from all-inning them:\n\n{{champion:50}} {{champion:43}} {{champion:68}} \n\nOr a safe laner who can patiently outscale him:\n\n{{champion:54}} {{champion:14}} {{champion:27}} (though Singed it's more like he just proxies his lane and abuses Pantheon's lack of sustain and huge mana costs for his waveclear)\n\nMalphite is probably the counter I use most, since, even with CS lead, once Malphite gets his sunfire cape Pantheon can't 1v1 him. Malphite will stomp all over him.","replies":[{"poster":"Xavanic","date":"2017-04-07T22:04:22.970+0000","up_votes":2,"down_votes":1,"body":"I dunno about the tanks. I never considered swain because i forgot he exists, rumble gets bullied out too hard....and...karma...top?","replies":[{"poster":"PermabannedGaren","date":"2017-04-07T22:31:23.957+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Xavanic,realm=NA,application-id=3ErqAdtq,discussion-id=fFnEydLK,comment-id=00090000,timestamp=2017-04-07T22:04:22.970+0000)\n>\n> I dunno about the tanks. I never considered swain because i forgot he exists, rumble gets bullied out too hard....and...karma...top?\n\nRumble is harder to play into the match-up, but if you play it right you out-push him, constantly harass him, and outscale him.\n\nKarma top is fairly legit, as either a mage or as a cancer tank (I'm serious).","replies":[{"poster":"Ariel the Cruel","date":"2017-04-08T07:23:50.589+0000","up_votes":1,"down_votes":0,"body":"Tank Karma is cancer? Since when?\nAll she brings to the table is the ability to never die. (>_>)","replies":[]}]}]}]},{"poster":"Tusutaki","date":"2017-04-07T21:23:52.209+0000","up_votes":2,"down_votes":1,"body":"Sustain champs.\n\nArmor\n\nTanks\n\nPotions\n\nCC\n\nAnd most of all, picking Pantheon is a counterplay itself.","replies":[{"poster":"Xavanic","date":"2017-04-07T21:35:19.085+0000","up_votes":1,"down_votes":1,"body":"First of all I hate pantheons design, I won't play champs that I dislike the design of (only like 10 champs in the game I won't play) secondly, my problem is the fact then whenever I see pantheon, it generally means I'm gonna get ganked by level 1 or 2, which usually results in pantheon getting a lead and myself being forced to tower hug because of that lead, and with how easy it is to shred armor now a days stacking armor doesn't do much when your behind, as he will just build a BC and last whisper item and make your 6k gold worth of armor equal to about 1.2k gold worth of it.\n\nHe needs to be azir'd until he is reworked as I don't want to have to take a ranged champion top lane just to be able to farm (like legit, darius and riven have more counterplay then pantheon)","replies":[{"poster":"Tusutaki","date":"2017-04-07T22:21:39.953+0000","up_votes":2,"down_votes":0,"body":"So in other words, you just answered your own question. Dont get ganked by lvl 1 or 2. \n\nAnd the thing with Panth is that it doesnt matter if he gets fed and you lose lane. If you pick a tank like champ then you will be fine as you outscale him. He is the literal definition of win lane lose game type of champ. \n\nWhen I say picking Pantheon is a counter play onto itself, I mean that and this is coming from someone who loved Pantheon and played him mid back then.","replies":[]}]}]},{"poster":"TheJakeinator","date":"2017-04-07T19:39:59.977+0000","up_votes":2,"down_votes":1,"body":"yeah it's called armor","replies":[{"poster":"Xavanic","date":"2017-04-07T19:46:53.755+0000","up_votes":1,"down_votes":4,"body":"Nah....when hes level 8 and your level 3 armor isn't gonna help you, have you ever laned against pantheon? once he hits level 3 he can 100-0 you (which just by the nature of his kit and how it works, your prob only level 1 or 2 by this point) and since junglers don't exist anymore, your kinda fucked","replies":[{"poster":"TheJakeinator","date":"2017-04-07T19:59:45.747+0000","up_votes":4,"down_votes":4,"body":"If at any point your laner is 5 levels ahead of you, then you need to delete your account.\n\nHer is a list of melee champions that win vs Pantheon.{{champion:84}} {{champion:266}} {{champion:164}} {{champion:31}} {{champion:122}} {{champion:36}} {{champion:245}} {{champion:114}} {{champion:105}} {{champion:3}} {{champion:150}} {{champion:79}} {{champion:420}} {{champion:39}} {{champion:24}} {{champion:126}} {{champion:54}} {{champion:57}} {{champion:111}} {{champion:2}} {{champion:78}} {{champion:58}} {{champion:98}} {{champion:27}} {{champion:14}} {{champion:223}} {{champion:48}} {{champion:106}}","replies":[{"poster":"Asayake 5150glow","date":"2017-04-07T20:15:35.395+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=TheJakeinator,realm=NA,application-id=3ErqAdtq,discussion-id=fFnEydLK,comment-id=000100000000,timestamp=2017-04-07T19:59:45.747+0000)\n>\n> If at any point your laner is 5 levels ahead of you, then you need to delete your account.\n> \n> Her is a list of melee champions that win vs Pantheon.{{champion:84}} {{champion:266}} {{champion:164}} {{champion:31}} {{champion:122}} {{champion:36}} {{champion:245}} {{champion:114}} {{champion:105}} {{champion:3}} {{champion:150}} {{champion:79}} {{champion:420}} {{champion:39}} {{champion:24}} {{champion:126}} {{champion:54}} {{champion:57}} {{champion:111}} {{champion:2}} {{champion:78}} {{champion:58}} {{champion:98}} {{champion:27}} {{champion:14}} {{champion:223}} {{champion:48}} {{champion:106}}\n\nWTF WHY IS FIORA IN THAT LIST.\n\nThe others, perhaps (although I'd say Darius loses this one due to Panth's passive absolutely fucking his stacks, but Pantheon is the best hard counter to Fiora ever. Playing Fiora against Panth is learning that war isn't dueling.","replies":[{"poster":"Awhegark","date":"2017-04-07T20:21:21.937+0000","up_votes":2,"down_votes":1,"body":"Debatable I have won against pantheon many times with fiora, you can counter his stun with your W.","replies":[{"poster":"Asayake 5150glow","date":"2017-04-07T20:47:37.141+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Awhegark,realm=NA,application-id=3ErqAdtq,discussion-id=fFnEydLK,comment-id=00010000000000000000,timestamp=2017-04-07T20:21:21.937+0000)\n>\n> Debatable I have won against pantheon many times with fiora, you can counter his stun with your W.\n\nOnly if he's dumb enough to not 1) use his stun when Riposte is down, or 2) use his stun in pointblank range where it is literally impossible to react too, although the second one can be mindgamed.\n\nThe fact is Pantheon doesn't need to W in order to win a duel against Fiora unless there is a cannon minion nearby (in which case it won't help much either). If Fiora wants to fight Pantheon early game, she needs to tank his entire minion wave in order to do so, combined with Fiora's only moderate-above average DPS means that's impossible. Especially if Panth is running DFT, although Tlords is fine too.\n\nAnd if she doesn't bully you out early game, or at least zone you, then you will bully her out to the point where she either Ripostes your Q, takes 1/3 of her health in damage, or gives up every last CS.\n\nThe only real counterplay available to either of them is to utilize the cannon minions to proc Panth's passive.","replies":[{"poster":"Awhegark","date":"2017-04-08T01:02:50.809+0000","up_votes":1,"down_votes":0,"body":"I have never seen this happen. I imagine fiora with cloth armor has more than enough armor to make sure pantheon thinks twice before wasting his entire mana bar by level 3. Pantheon Q harrass dosn't work on champions with okay defenses, your mana  would go down so quickly that you will be forced out of lane. Also pantheons W animation is so slow that you can counter it even at point blank.","replies":[{"poster":"Asayake 5150glow","date":"2017-04-08T01:12:18.877+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Awhegark,realm=NA,application-id=3ErqAdtq,discussion-id=fFnEydLK,comment-id=0001000000000000000000000000,timestamp=2017-04-08T01:02:50.809+0000)\n>\n> I have never seen this happen. I imagine fiora with cloth armor has more than enough armor to make sure pantheon thinks twice before wasting his entire mana bar by level 3. Pantheon Q harrass dosn&#x27;t work on champions with okay defenses, your mana  would go down so quickly that you will be forced out of lane. Also pantheons W animation is so slow that you can counter it even at point blank.\n\nWell, that's what happens every single time someone picks Fiora when I wanna play her. Which is kinda often - Fiora's my second main.\n\nPantheon Q harass completely destroys a Fiora without Cloth. Haven't played against one with cloth though. DFT would make it not matter though.\n\nPanth's W is nearly instant at point blank range, you don't know what you're talking about. It's like old Gragas ult - it's cast time is based on distance traveled.","replies":[]}]}]}]}]},{"poster":" Cµpcakke","date":"2018-04-12T23:02:01.628+0000","up_votes":1,"down_votes":0,"body":"(posting on an old comment i know)\n\nFiora does not counter Panteon. His W happenes almost instantly, his passive blocks fioras passive, he can poke her down.","replies":[]},{"poster":"vodrio12","date":"2017-04-08T01:02:10.117+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheJakeinator,realm=NA,application-id=3ErqAdtq,discussion-id=fFnEydLK,comment-id=000100000000,timestamp=2017-04-07T19:59:45.747+0000)\n>\n> If at any point your laner is 5 levels ahead of you, then you need to delete your account.\n> \n> Her is a list of melee champions that win vs Pantheon.{{champion:84}} {{champion:266}} {{champion:164}} {{champion:31}} {{champion:122}} {{champion:36}} {{champion:245}} {{champion:114}} {{champion:105}} {{champion:3}} {{champion:150}} {{champion:79}} {{champion:420}} {{champion:39}} {{champion:24}} {{champion:126}} {{champion:54}} {{champion:57}} {{champion:111}} {{champion:2}} {{champion:78}} {{champion:58}} {{champion:98}} {{champion:27}} {{champion:14}} {{champion:223}} {{champion:48}} {{champion:106}}\n\nwhat? akali?\nas a jax main panth is one of my biggest nigthmares.... hard counter. same playing as irelia!","replies":[]},{"poster":"Xavanic","date":"2017-04-07T20:34:33.196+0000","up_votes":1,"down_votes":2,"body":"All it takes is for pantheon to get a little bit ahead and you might aswell sit under tower (legit only won lane that game because i was playing kennen) but pantheon has too much dominance once he gets ahead, as theirs no real way to outplay him due to his very linear kit, forcing even the most skilled players to tower hug while panth freezes the lane","replies":[]}]}]}]},{"poster":"Mecha MaIphite","date":"2017-04-07T20:29:35.542+0000","up_votes":3,"down_votes":2,"body":"he needs a rework tbh\n\n\"sit under tower with cloth and wait for him to be useless\" is getting old","replies":[{"poster":"Chønklord","date":"2017-04-08T00:58:13.585+0000","up_votes":1,"down_votes":0,"body":"They should change his W to something like Lee Sin's Q","replies":[]}]},{"poster":"VivaLaKitten","date":"2017-04-07T21:31:38.703+0000","up_votes":2,"down_votes":1,"body":"\nhe's a lane bully\n\nhe falls off late game\nhe has a hard time coming back\nand he doesn't fair well in most heavy cc team fights\n\nhe's just a skirmisher / bully\n {{champion:114}} {{champion:104}} {{champion:58}} {{champion:23}} {{champion:157}} {{champion:126}} {{champion:39}}","replies":[{"poster":"Xavanic","date":"2017-04-07T21:39:57.659+0000","up_votes":1,"down_votes":2,"body":"See, {{champion:58}} {{champion:126}} {{champion:122}} {{champion:157}} {{champion:114}} {{champion:104}} {{champion:23}} {{champion:39}} actually feel like you could have done something to outplay their bullying, pantheon literally has no skills shots, plus with his crit and ignite there is no cheesing it away with 20ish hp","replies":[{"poster":"VivaLaKitten","date":"2017-04-07T21:49:22.919+0000","up_votes":2,"down_votes":1,"body":"Renekton's stun is applied by auto attacking\nFiora has crit poking, dashing, and an ability that blocks anything (this depends on the Fiora, not you, that's not counterplay, that's just the Fiora messing up)\nYasuo gets a free poke every two Q's that stuns you \nDarius has bleed that does more damage then ignite (not fully stacked), a spin to poke, a pull, and a slow, as well as a ult with decent range that's nearly immune to cc\nTryndamere has immunity to death\nIrelia can freely jump to you and insta stun\n\nPantheon early game damage is extremely low unless you build full ad on him\nalso, why do you have a problem with pantheon when talon exists?\nTalon does the same thing only HE CAN USE HIS ULT in skirmishes\nas well as having a much easier and faster way to escape","replies":[{"poster":"Asayake 5150glow","date":"2017-04-07T21:57:10.570+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=VivaLaKitten,realm=NA,application-id=3ErqAdtq,discussion-id=fFnEydLK,comment-id=000500000000,timestamp=2017-04-07T21:49:22.919+0000)\n>\n> Renekton&#x27;s stun is applied by auto attacking\n> Fiora has crit poking, dashing, and an ability that blocks anything (this depends on the Fiora, not you, that&#x27;s not counterplay, that&#x27;s just the Fiora messing up)\n\nI don't see how this means there's no counterplay?\n\n> Yasuo gets a free poke every two Q&#x27;s that stuns you \n\nDodgable\n\n> Darius has bleed that does more damage then ignite (not fully stacked), a spin to poke, a pull, and a slow, as well as a ult with decent range that&#x27;s nearly immune to cc\n\nSpin is dodgable, if you have dissengage then it's good. It's dependent on the Darius's skill, though. And your model size.\n\n> Tryndamere has immunity to death\n\nCounterplayable.\n\n> Irelia can freely jump to you and insta stun\n\nShe can jump to you if there's a nearly dead minion near you (if her Q will kill the minion) and she will stun you if her %health is equal to or lower than yours. Renekton can freely jump to you and insta stun. Irelia can't.\n\n> Pantheon early game damage is extremely low unless you build full ad on him\n\nHellll no.\n\n> also, why do you have a problem with pantheon when talon exists?\n\nTrue.\n\n> Talon does the same thing only HE CAN USE HIS ULT in skirmishes\n> as well as having a much easier and faster way to escape\n\nTrue.","replies":[]},{"poster":"Xavanic","date":"2017-04-07T21:54:07.707+0000","up_votes":1,"down_votes":1,"body":"Renekton has to get in melee range in order to even use his stun, and champs like jax/shen can just dodge it, plus its CD is very long early game\nFiora is skill based, \nYasuos q is easy to dodge, plus all his dmg is AA based\nDarius is INSANELY weak to anyone with a mobility skill (kled, renekton, fiora, riven, etc.)\nTryndamere is annoying, but his only dmg comes from aaing, \nIrelia is pretty much the same thing as tryndamere, but a weaker early game","replies":[]}]}]}]},{"poster":"NinjaGuy69","date":"2017-04-07T20:10:56.161+0000","up_votes":2,"down_votes":1,"body":"> Outside of playing a ranged champion in top lane...\n\nSome of the Rioters have already said they intend to rework him when they update the divers. I do agree though that he needs some work done. He's too much of a point-and-click champ, which is why I'm pretty sure they're going to try and make him more mechanically challenging in his eventual update.","replies":[]},{"poster":"FiddlesOnTheRoof","date":"2017-04-07T21:59:42.384+0000","up_votes":1,"down_votes":1,"body":"his counterplay is that he's worthless once whoever you're playing hits level 6","replies":[{"poster":"Xavanic","date":"2017-04-07T22:05:25.202+0000","up_votes":1,"down_votes":2,"body":"sigh, people don't seem to understand the issue im having is once he gets the slightest lead theres no way to outplay him","replies":[{"poster":"Ariel the Cruel","date":"2017-04-08T07:25:19.025+0000","up_votes":1,"down_votes":0,"body":"Sorry, I'm just a filthy support main. And when I do go top, it's with Soraka, Morgana, Lulu, or the like.\n\nBut excluding my odd-ball picks, aren't *most* top lane match-ups like this?","replies":[{"poster":"Akaliholic","date":"2017-04-09T17:26:09.218+0000","up_votes":1,"down_votes":0,"body":"Nope. Panth is especially absurd because his harass is brutal and impossible to avoid and his \"chunk your entire healthbar\" combo is guaranteed. He literally deletes you from the lane if he gets ahead and you are playing one of the many champs that he counters. Cant even farm under turret thanks to his passive allowing him to not even care about your turret.","replies":[]}]}]}]},{"poster":"Ariel the Cruel","date":"2017-04-08T07:28:06.699+0000","up_votes":1,"down_votes":0,"body":"Can Teemo be given *any* counter-play?\n(Not to be confused with counter-build.)\n(Also not to be confused with calling him strong/weak.)","replies":[]},{"poster":"LyingOnLine","date":"2017-04-07T21:56:37.269+0000","up_votes":1,"down_votes":1,"body":"If he had counterplay, he wouldn't be Tumortheon.","replies":[{"poster":"Xavanic","date":"2017-04-07T21:57:48.022+0000","up_votes":1,"down_votes":2,"body":"Alot of people seem to think its as easy as playing a sustain champ or outscaling him....but obviously they haven't played against a decent pantheon","replies":[]}]}]}