{"poster":"Gr33nKillsAll","date":"2015-11-10T15:06:27.151+0000","title":"Welche Combos gibt es`?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hey, ich und n Kumpel wollen zusammen Bot-Lane mainen, ich werde die Supporter Rolle &uuml;bernehmen. Ich weiss das es einige Champion-Combos gibt z.B. {{champion:12}} {{champion:429}} , {{champion:22}} {{champion:111}}  oder auch {{champion:222}} {{champion:223}} . Wir wollen aber eine besondere (nicht zu schwere) die m&ouml;glichst viele andere Combos countern kann. Wir w&uuml;rden uns &uuml;ber einen hilfreichen Kommentar freuen{{sticker:slayer-jinx-catface}}","replies":[{"poster":"lKawaiiNeko","date":"2015-12-09T13:18:00.982+0000","up_votes":1,"down_votes":0,"body":"{{champion:15}} {{champion:25}} funktioniert meiner Meinung nach auch gut. Wenn Morgana ihren Cage trifft, trifft die Sivir Q garantiert.\nAusserdem habt ihr double Spellshield, und damit die Gegner nicht aus der Morgana Ult rausrennen, kann Sivir ulten.","replies":[{"poster":"lKawaiiNeko","date":"2015-12-09T13:18:25.854+0000","up_votes":1,"down_votes":0,"body":"Achja, Braum funktioniert mit allen :p","replies":[]}]},{"poster":"Gr33nKillsAll","date":"2015-12-09T11:50:53.428+0000","up_votes":1,"down_votes":0,"body":"Danke Leute ^^ {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"BallsOfPeel","date":"2015-11-18T10:38:42.295+0000","up_votes":1,"down_votes":0,"body":"Hey, kann nur die Kombination von {{champion:201}} und {{champion:236}} absolut bestätigen. Die Passive von Braum wird durch Lucian so schnell gestacked, dass der Gegner instant stunned ist. Was bei mir und meinem ADC eigentlich auch immer gut funktioniert ist {{champion:89}} und {{champion:18}}. Hier habt ihr die Möglichkeit bei Lvl 2 direkt all-in zu gehen, da Leonas E+Q und Tristanas Bombe + AA unglaublich bursten. {{champion:89}} und {{champion:104}} hatte bei uns auch immer eine gute Synergie, aber ich bin der Meinung du kannst mit deinem Match-Up fast alles gewinnen, wenn ihr a) gut kommuniziert und euch absprecht und b) euren Champ und eure Grenzen kennt. Ist nur meine Meinung, hoffe ich konnte dir helfen :)","replies":[]},{"poster":"Shiro equals","date":"2015-11-10T15:52:55.265+0000","up_votes":1,"down_votes":0,"body":"Welche Kombinationen noch gut funktionieren: {{champion:119}} {{champion:37}} , {{champion:412}} {{champion:429}} , {{champion:201}} {{champion:236}} , {{champion:40}} {{champion:222}} .","replies":[]},{"poster":"Supporter UwU","date":"2015-11-10T15:16:30.217+0000","up_votes":1,"down_votes":0,"body":"Eine ebenfalls starkes Duo z.Zt. ist Jinx, TK.\nJinx, Morgana funktioniert auch gut. \n\n EDIT//: Gerade gesehen das JInx/TK ja schon von dir gelistet wurde. \n\nWie Soris schon sagte, gibt es keine Combo die alles countert. Jedoch hast du aktuell mit Long Range Adcs sehr gut zu tuen und in den botlane matchup entscheidet sogar meist der support pick in welche richtung der favour geht. Jedoch denke ich das es bis DIA Bereich sowieso erstmal mehr auf dein Skillcap ankommt, als die counterplays der champs.","replies":[]},{"poster":"SorisDynasty","date":"2015-11-10T15:11:51.919+0000","up_votes":1,"down_votes":0,"body":"Ein Universal-Rezept gibt es dafür nicht wirklich. Jede der Combos hat Stärken und Schwächen, je nach Matchup. Also direkt countern wird man mit einer gewissen Combo nicht alles, oder möglichst viel können. Irgendwas wird immer da sein, was diese Champions überschattet.\nIch persönlich kann aber nur Kalista+Thresh empfehlen. Die Lane ist ab Stufe 6 extrem sicher, da sich beide Champions gegenseitig retten können. In Teamarbeit hat man auch viel Schaden, aber nicht unbedingt viel Burst und pre6 ist man doch etwas CC-anfällig, wenn man Thresh beschäftigt hält.","replies":[]}]}