{"poster":"Karol PiñeChet","date":"2019-03-19T19:11:09.557+0000","title":"El server anda con una perdida de paquetes del tremendo ortega","subforum":"Problemas Técnicos","up_votes":15,"down_votes":1,"body":"Desde ayer que intento jugar lol de manera decente y el juego anda con un delay horrible que da una experiencia de juego demasiado desagradable como para terminar las partidas, esto no pasa en todas las partidas eso si, normalmente juego con 19 ms y hay algunos games donde anda entre 30 y 45 ms (lo que se supone que debería ser jugable, pero no lo es) investigué para ver si era mi Internet pero efectivamente no era así, comprobé viendo otros juegos y andaba todo normal y hablé con amigos que andan con el mismo problema, tanto en mi ciudad (quilpué) como en otras (santiago), mando esto por acá porque en el soporte responden puros bots y no estoy ni al metro con tener que mandar mil reportes para que no lo pesquen ni uno. Comenten este post para que los rioters (si es que queda alguno con vida) pesqué y por lo menos informe que el server anda horrible. Dejo una linda encuesta para ver cuantos andan así de mal.","replies":[{"poster":"GG2019","date":"2019-03-19T19:19:13.616+0000","up_votes":5,"down_votes":1,"body":"Hola, cual es tu ISP, estamos revisando un problema con VTR","replies":[{"poster":"Bxh7","date":"2019-03-19T19:25:41.934+0000","up_votes":8,"down_votes":0,"body":"Sii, hay hartas personas con Vtr que andan con el mismo problema. ¿Se sabe algo más al respecto? :(","replies":[{"poster":"GG2019","date":"2019-03-19T19:49:24.890+0000","up_votes":5,"down_votes":1,"body":"Hemos detectado lo que parece ser perdida de paquetes en su red, como nuestro juego es muy sensible al lag y la perdida de paquetes, por la naturaleza del tráfico UDP, afecta directamente el juego, ya hemos tomado contacto con ellos, para solucionar la situación.","replies":[{"poster":"Danshid","date":"2019-03-19T20:17:42.041+0000","up_votes":2,"down_votes":0,"body":"Desde ayer que se sabe de la perdida de paquetes, me sorprende que aun no hayan puesto en el cliente este problema {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"GG2019","date":"2019-03-19T20:56:32.087+0000","up_votes":1,"down_votes":1,"body":"Hola, en general en el Cliente se ponen las fallas graves o que afectan a un porcentaje grande del servidor, y de acuerdo a nuestras métricas no lo vimos así","replies":[{"poster":"Karol PiñeChet","date":"2019-03-19T21:09:02.644+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Riot GG,realm=LAS,application-id=X54mVVp0,discussion-id=l8sjbUAP,comment-id=00020000000000020000,timestamp=2019-03-19T20:56:32.087+0000)\n>\n> Hola, en general en el Cliente se ponen las fallas graves o que afectan a un porcentaje grande del servidor, y de acuerdo a nuestras métricas no lo vimos así\n\nEstaría bueno que avisen en el cliente que hay problemas con cierta(s) empresa(s), para que los jugadores que tienen ese ISP en específico no entren directo a jugar partidas clasificatorias, así evitan tener una mala experiencia de juego, no le cagan la experiencia a otros jugadores también y no se pierden puntos gratuitamente.","replies":[]}]},{"poster":"AJ             J","date":"2019-03-19T21:00:16.892+0000","up_votes":2,"down_votes":2,"body":"Si es un problema de un solo proveedor no me parece que amerite ponerlo en el cliente.\n\nSi fuera un problema del server, ahi ya es otra cosa.","replies":[{"poster":"GG2019","date":"2019-03-20T00:00:13.994+0000","up_votes":1,"down_votes":0,"body":"Generalmente ese es el criterio, además tampoco afectaba a todos los clientes de VTR por lo visto y en la mañana estaba mejor.","replies":[]}]}]},{"poster":"Bxh7","date":"2019-03-19T19:50:57.906+0000","up_votes":2,"down_votes":0,"body":"Genial, ¡gracias por la información!","replies":[]},{"poster":"Elixiir","date":"2019-03-19T19:56:43.983+0000","up_votes":1,"down_votes":0,"body":"tienen idea de cuando se soluciona esto?","replies":[]}]},{"poster":"GG2019","date":"2019-03-19T19:55:43.956+0000","up_votes":1,"down_votes":1,"body":"Me podría compartir su archivo netlog de las partidas con problemas\n\nC:\\Riot Games\\League of Legends\\Logs\\GameLogs\\PartidaXXXXX\\FECHAXXX_netlog.txt","replies":[{"poster":"Bxh7","date":"2019-03-19T20:02:24.383+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"GG2019","date":"2019-03-19T20:09:13.106+0000","up_votes":1,"down_votes":1,"body":"no, necesito el archivo, no la dirección en tu computador, lo puedes subir a algún servicio  y compartir?","replies":[{"poster":"Bxh7","date":"2019-03-19T20:17:44.212+0000","up_votes":1,"down_votes":0,"body":"¿Sirve acá? mbf.me/nVq2lv","replies":[]}]}]},{"poster":"GreenKapppa","date":"2019-03-19T21:52:20.810+0000","up_votes":1,"down_votes":0,"body":"https://pastebin.com/U0YYhhnq","replies":[]}]}]},{"poster":"Karol PiñeChet","date":"2019-03-19T20:50:57.598+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot GG,realm=LAS,application-id=X54mVVp0,discussion-id=l8sjbUAP,comment-id=0002,timestamp=2019-03-19T19:19:13.616+0000)\n>\n> Hola, cual es tu ISP, estamos revisando un problema con VTR\n\nTengo VTR pero un amigo que tiene Movistar también anda con estos problemas.","replies":[]}]},{"poster":"NotSaved","date":"2019-03-19T19:49:00.370+0000","up_votes":3,"down_votes":0,"body":"Actualmente yo también estoy experimentando el mismo problema, poseo baja ping alrededor de 19 a 30ms y derrepente me dan unos delay terribles, también soy usuario de VTR como he visto en otros post , pero he probado mi conexión con otros juegos y me anda de maravilla, solamente tengo dramas con el LoL, espero que hagan algo luego D: {{sticker:zombie-brand-clap}}","replies":[]},{"poster":"Lord Bastardo","date":"2019-03-19T19:42:00.411+0000","up_votes":2,"down_votes":0,"body":"Lo mismo que a varios ,injugable de tanto delay y lag , al parecer el problema es con vtr con lso servidores de lol :({{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"Elsa Patito","date":"2019-03-19T19:21:54.847+0000","up_votes":2,"down_votes":0,"body":"esta re mal el server, ya exissten muchos hablando sobre lo mismo","replies":[]},{"poster":"bLaaaK","date":"2019-03-19T19:15:14.744+0000","up_votes":2,"down_votes":0,"body":"Lo triste de esta situcion es justamente lo que dices amigo \" por lo menos informe que el server anda horrible\" ni eso hacen... hay otro post con el mismo tema donde se ha comentado bastante del tema te invito también a que tus amigos comenten para que se difunda mas esto porque no se tu pero yo y otro mas llevamos esta perdida de paquetes  desde jueves pasado!.\n\nhttps://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/kP28ruER-problemas-con-vtr-perdida-de-paquetes-intermitencia-al-jugar","replies":[]},{"poster":"Olíver Sykes","date":"2019-03-19T19:13:21.158+0000","up_votes":2,"down_votes":0,"body":"crei que era el unico","replies":[]},{"poster":"Netero24","date":"2019-03-19T20:10:31.557+0000","up_votes":1,"down_votes":1,"body":"tengo el mismo problema, es mas vinieron los técnicos y dejaron los parámetros de la conexión en buen estado, pero sigo teniendo el mismo problema, lo curioso es que solo ocurre en las ranked duo q , no así en las de reclutamiento o normales , por favor hagan algo al respecto porque esta injugable.\n\ndebería el soporte de riot game hacer un comunicado oficial, porque son varios los usurarios de vtr, que están con el mismo problema, pero todos están en la incertidumbre esperando una solución. y fecha para cuando estará solucionado, porque como dije anteriormente, el problema es solo en las duo q, no así en otras partidas, entonces como sabemos si el problema esta solucionado ?? ir a otra ranked perderla a causa de lo mismo, arruinando la experiencia de juego ?? ","replies":[{"poster":"TheLemonStyle","date":"2019-03-20T09:34:31.557+0000","up_votes":1,"down_votes":0,"body":"https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/UovgYUzA-problemas-con-vtr\n\nComunicado oficial..","replies":[]}]},{"poster":"GG2019","date":"2019-03-20T00:01:13.044+0000","up_votes":1,"down_votes":0,"body":"Por ahora la situación esta mejor, hicimos un arreglo temporal, y trabajamos en la solución completa.","replies":[]},{"poster":"II Thanatos II","date":"2019-03-19T20:45:43.880+0000","up_votes":1,"down_votes":0,"body":"https://mega.nz/#!Lh5WWKLQ!BkUzm5Prs4WpbLsY-wBsvCfz2qSk26EBjaVS0CRxCH8 comparto enlace de net log partida con problemas de delay vtr","replies":[]}]}