{"poster":"Nedduz","date":"2016-03-10T10:46:16.649+0000","title":"Troppi bot","subforum":"Aiuto e supporto","up_votes":2,"down_votes":2,"body":"Salve a tutti, oggi ho notato un gran quantitativo di bot players in game, non s&ograve; s&egrave; qualcuno lo ha notato, ho fatto un match ARAM dove i miei avversari era 4 bot e un player dove abbiamo chiuso la partita in 6:30 circa, poi la partita successiva ho avuto in team 1 bot perdendo miseramente, ora l&#039;ennesima partita con bot, sta situazione sta diventando intellerabile non &egrave; possibile giocare in tale maniera.\r\nOra non s&ograve; s&egrave; &egrave; il posto giusto dove postare questo topic, ma spero che con il vostro aiuto e di tutta la community di LoL segnalando man mano i vari bot in game, il problema si risolva presto.","replies":[{"poster":"Chroniicles","date":"2016-03-10T13:48:30.720+0000","up_votes":1,"down_votes":0,"body":"Di solito è un fenomeno circoscritto a partite in cui i player non hanno il 30. Com'è già stato detto, vengono usati degli automatismi per far muovere il pg quando non sei al pc per poter giocare farmando ip\\exp e portare facilmente gli account al 30.\nCapisco la tua frustrazione, ma tranquillo che quegli account hanno vita breve. Reportali a fine partita!","replies":[{"poster":"LupoManaio","date":"2016-03-26T18:05:34.590+0000","up_votes":1,"down_votes":0,"body":"Non credo che abbiano vita molto breve.\nHo appena fatto un'ARAM con due bot, entrambi con nessun punto maestria, niente rune, nessuna vittoria in normal ma oltre 100 vittorie in ARAM.\nQuindi sono account che \"lavorano\" da un bel pò.","replies":[{"poster":"Chroniicles","date":"2016-03-26T19:06:28.478+0000","up_votes":1,"down_votes":0,"body":"Prima o poi verranno bannati. Non puoi generalizzare sulla base di ciò che è capitato a te","replies":[{"poster":"LupoManaio","date":"2016-03-27T16:25:35.813+0000","up_votes":1,"down_votes":0,"body":"se questi account girano liberi e indisturbati mi pare evidente che la metodologia che utilizzano per individuarli non funzioni.","replies":[{"poster":"Chroniicles","date":"2016-03-27T16:59:29.697+0000","up_votes":1,"down_votes":0,"body":"Se vogliamo instaurare una discussione seria io sono ben disposto, ma queste continue risposte buttate lì perchè hai incontrato 2 account che \"lavorano\" da un bel po' (come se per fare 100 vittorie in aram ci volesse un mese) mi smontano, seriamente","replies":[{"poster":"LupoManaio","date":"2016-03-28T10:55:27.334+0000","up_votes":1,"down_votes":0,"body":"Ne ho incontrati ben più di 2 e tutti con le stesse statistiche.\nConsidera poi il fatto che, la maggior parte delle volte, chi ha in squadra uno o due bot la partita la perde, quindi per arrivare a 100 vittorie probabilmente hanno giocato 400 o 500 game.\n\nComunque al di la delle polemiche una cosa è certa, smetterò di giocare ARAM.","replies":[{"poster":"Chroniicles","date":"2016-03-28T16:21:05.803+0000","up_votes":1,"down_votes":0,"body":"Posso farti una domanda (non fraintendere) sei unranked? Io non ho mai incontrato bot con questo account, mentre con lo smurf mi è capitato una volta in aram intorno al livello 15. Un mio amico giocava moltissime dominion e nonostante fosse gold ne incontrava, sporadicamente.\nIo non mi capacito sul come facciate a incontrarne così tanti arrivati al 30, e lo smurf l'ho livellato quasi solo lì, ho fatto subito le placements e gioco ancora aram... mai risuccesso. Se come dici tu, questi bot perdano così tanti game, avranno un mmr ridicolo... o non è così (ovvero non perdono tutti sti game), o il vostro mmr è bassino e vi matcha con sti tipi, o non giocano sempre da bot ma altri game li fanno da \"umani\" e bilanciano l mmr","replies":[{"poster":"LupoManaio","date":"2016-03-29T14:00:49.935+0000","up_votes":1,"down_votes":0,"body":"Sono unranked.\nEvidentemente ho un mmr simile.\nResta il fatto che il problema non è mio che ho un mmr basso, ma della Riot che non individua una soluzione per eliminare il fenomeno della compravendita di account.","replies":[]}]}]}]}]}]}]},{"poster":"MonkeyCarriesU","date":"2016-03-11T10:33:32.613+0000","up_votes":1,"down_votes":0,"body":"Nel frattempo tu sprechi tempo, reportare a fine partita un fenomeno che la riot non riesce ad impedire è totalmente inutile, ci sono diverse vie per poter negare l'utilizzo dei bot agendo sul codice sorgente del gioco, però, stranamente la riot non sta facendo nulla, attualmente. Mi auguro questo problema possa essere affrontato il prima possibile, altrimenti diventerà altamente controproducente poichè molti account di livello basso verranno spinti ad abbandonare il game trovandosi in ipotetici 1vs4/1vs5 - 5vs1 ecc. Il che abbassa la qualità ed il divertimento del gioco stesso. Mi auguro tu non comprenda male le mie parole.","replies":[{"poster":"Chroniicles","date":"2016-03-11T12:26:18.230+0000","up_votes":1,"down_votes":0,"body":"Ci mancherebbe, capisco benissimo la frustrazione che ne deriva, e tutte le implicazioni negative. Però dire che la Riot non stia facendo nulla è tutt'altro discorso e non lo condivido, tutto qua.\nGli interventi al codice del gioco non possono essere mica fatti alla leggera, non stai mica modificando il progettino per un esame o per il compito a scuola. Giusto per farti un esempio, introducendo un champ nonostante venga tutto testato e ritestato più volte qualche bug esce sempre, e non si tratta di modifiche così importanti come quelle necessarie ad arginare un problema simile. \nA questo aggiungi anche che la Riot, come ogni azienda del mondo, fa le sue scelte tenendo conto anche di risorse limitate e costi... mentre si lavora al problema tamponano bannando il più tempestivamente questo individui.\nSono loro che ci rimettono per primi da tutto questo, ci siamo arrivati noi semplici player vuoi che non se ne siano resi conto loro? evidentemente le tempistiche non permettono di meglio.","replies":[]}]}]},{"poster":"SpiderPork24","date":"2016-03-13T23:45:05.266+0000","up_votes":1,"down_votes":0,"body":"Hai perfettamente ragione, oramai sono giorni che i bot imperversano in ARAM, è veramente uno schifo !!\nMa poi è assurdo: capitano partite dove una squadra ha 3 bot e l'altra 1, almeno fai 2vs2 !!! \nL'aram sta diventando veramente ingiocabile, perdi in maniera ignobile o vinci giocando bendato, veramente ridicolo !!!","replies":[]},{"poster":"OTP REQUIEMBOW","date":"2016-03-10T12:49:33.159+0000","up_votes":1,"down_votes":0,"body":"in che senzo bot? in pvp non puoi trovarti bot contro, come in coop vs IA non puoi trovarti player contro..... cosa intendi per bot player allora?","replies":[{"poster":"Re Sombra","date":"2016-03-10T13:01:54.594+0000","up_votes":1,"down_votes":0,"body":"Ci sono dei programmi per farlo; per far telecomadare l account da pc ; come fai a dire che sono dei bot???","replies":[{"poster":"dentop1","date":"2016-03-10T13:07:57.017+0000","up_votes":1,"down_votes":0,"body":"si vede towerdivano si fanno prendere danni da wave intere la lista e bella che lunga, per esempio non farmano vanno sotto torre ad suicidiarsi cosi a random oppure non usano summoner spells i bot ecc ecc.\nIo ne ho incontrati di bot e anche tanti.\nspero di averti spiegato per bene","replies":[{"poster":"OTP REQUIEMBOW","date":"2016-03-11T16:51:56.085+0000","up_votes":1,"down_votes":0,"body":"non lo sapevo, in 4 anni che gioco a lol non mi è mai capitato di trovarmene in squadra o contro, o magari mi è capitato e li ho presi per idioti XD non so con certezza, ma fatto sta che non li ho mai notati =\\","replies":[]},{"poster":"Nabbomaster","date":"2016-03-10T15:36:26.830+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=dentop1,realm=EUW,application-id=98NGV4Al,discussion-id=bw8hfKnn,comment-id=000000000000,timestamp=2016-03-10T13:07:57.017+0000)\n>\n> si vede towerdivano si fanno prendere danni da wave intere la lista e bella che lunga, per esempio non farmano vanno sotto torre ad suicidiarsi cosi a random oppure non usano summoner spells i bot ecc ecc.\n> Io ne ho incontrati di bot e anche tanti.\n> spero di averti spiegato per bene\n\no diverse amiche che giocano cosi'","replies":[]}]}]},{"poster":"dentop1","date":"2016-03-10T13:03:05.796+0000","up_votes":1,"down_votes":0,"body":"praticamente ci sono degli account controllati da un programma che serve a farli livellare.\nQuesto significa che sono dei bot","replies":[]}]},{"poster":"JStrong","date":"2016-03-10T18:13:17.145+0000","up_votes":1,"down_votes":0,"body":"Anche io ne ho trovati alcuni...","replies":[]},{"poster":"Nedduz","date":"2016-03-10T13:23:03.148+0000","up_votes":1,"down_votes":0,"body":"non so come chiamarli fattoastà che ci sono dei players che iniziano il game e vanno praticamente al suicidio, non rispondono alla chat combattono da soli, e ovviamente vanno a feedare, non so come chiarli comunque sia ne ho beccati parecchi oggi in 4 game ne ho trovato una media di 2 a partita, potete andare a verificare sul mio profilo di gioco la cronologia di partite e vedrete che c'è una partita dove si finisce l'ARAM in 6:30 min e le altre 2-3 successive.\n","replies":[]},{"poster":"Nabbomaster","date":"2016-03-10T15:37:15.150+0000","up_votes":1,"down_votes":1,"body":"rigrazia il cielo che giochi contro i bot, gia' non riesci a vincere contro di loro figuriamoci contro i player normali","replies":[]}]}