{"poster":"ELV kada","date":"2016-11-08T06:30:12.830+0000","title":"Durchdachtes Design","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"RIOT wollte mit Sion einen Champion designen, der dank seiner w F&auml;higkeit mehr Leben als andere Tanks erreichen kann.\r\nJedoch haben die Entwickler dem Champion etwa 500 Baseleben weniger gegeben als anderen Tanks wie z.B Darius.\r\n\r\nDas heisst, dass Sion 250 CS br&auml;uchte nur um seinen Nachteil auszugleichen.\r\n\r\n\r\nWarum hat RIOT Sion diese Stack Mechanik gegeben??","replies":[{"poster":"Die Bohrmaschine","date":"2016-11-08T07:25:46.805+0000","up_votes":1,"down_votes":0,"body":"Hallo LegendBoss007,\nja erstmal hast du Recht. Darius hat, auf Level 18, standartmäßig 379 Leben mehr als Sion auf 18. Damit bräuchte ein Sion 190 CS um auf dein gleichen Wert an leben zu kommen. Dieser Farm ist in den höheren Elobereichen meistens nach spätestens 25 min erreicht. Jedoch gehen die meisten Spiele länger wodurch Sion am Ende wieder mehr Leben besitzt. Dazu kannst du nicht einfach ein Stat eines Charakters mit dem eines anderen vergleichen. Champions haben nen unterschiedlichen Fokus, im Fall von Darius etwa das direkte fighten im 1v1. Sion hingegen ist ein Fulltank der dafür guten CC mitbringt. Stelle dir einfach mal vor Sion würde ebenfalls die 2163 Basisleben haben die Darius hat. Dazu kommt seine Stackmechanik und schon bei 200 CS hätte er 2563 Leben. Viel spaß mit ihm im Late-Game....Soll heißen Champions funktionieren immer nur als Gesamtpaket und nur das Design ihres Gesamtpaketes ist wichtig.\nMit freundlichem Gruß, WalkingWard.","replies":[{"poster":"ELV kada","date":"2016-11-08T11:54:08.114+0000","up_votes":1,"down_votes":1,"body":"Das Ziel von Sion es, dass mehr leben als andere besitzt, sonst wäre die Stack Mechanik nicht eingeführt worden.\nIch finde es aber komisch, dass er 249 CS braucht (Sion hat 498 Leben weniger als Daruis, nicht 379 ^^), um schon nur die Leben von Darius zu erreichen","replies":[{"poster":"Die Bohrmaschine","date":"2016-11-08T12:57:14.183+0000","up_votes":1,"down_votes":0,"body":"Er hat ja auch mehr leben als alle anderen aber eben erst am Ende des Spiels. Hätte er dies von anfang wäre er zu stark da er sicher durchs early-game kommt und im Late-Game alles tankt. Zu den Lebenswerten: Ich habe die Wert aus dem Lolwiki genommen. Sind scheinbar falsche Zahlen angegeben.","replies":[]},{"poster":"GummibaumXYZ","date":"2016-11-08T12:26:53.219+0000","up_votes":1,"down_votes":0,"body":"Hats du dabei auch seine Passive miteingerechnet? Dadurch dass er nicht sofort weg ist, wenn er stirbt hat er ja eine Art \"Zusatzleben\".","replies":[]}]}]}]}