{"poster":"MrTeaHD","date":"2018-04-15T08:14:44.896+0000","title":"System der BE","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hey Guys,\r\nIch finde des BE System an sich sehr gut, nur leider muss man viel spielen um BE zu bekommen. Deshalb w&uuml;rde ich sagen es w&auml;re besser wenn man nach jedem Spiel merklich viele BE bekommt, genau so wie mit IP. Da zum Beispiel wenn man noch nicht alle Champs hat aber welche aufwerten m&ouml;chte muss man die schwere Entscheidung treffen: Neues Champion level oder neuer Champion dies ist nicht immer leicht, daher w&auml;re es besser wenn es nach jedem Spiel BE gibt oder man bekommt DEUTLICH mehr pro Levelaufstieg.\r\n\r\nMfG\r\nMrTeaHD","replies":[{"poster":"Timethief49","date":"2018-04-15T08:38:11.800+0000","up_votes":3,"down_votes":0,"body":"Man bekommt Champs schneller als mit dem alten System. Zusätzlich muss man keine Runen und Runenseiten mehr kaufen, wodruch man  noch mehr Währung zur Verfügung hat.","replies":[]},{"poster":"5 Dunks 1 Darius","date":"2018-04-15T08:21:53.992+0000","up_votes":3,"down_votes":0,"body":"Mit dem neuen System bekommt man schon mehr BE als IP!\nIch verstehe nicht wie sich Leute darüber aufregen, ich sitze immer auf rund 10k BE :o","replies":[{"poster":"SSI CptHaunted","date":"2018-04-15T09:04:13.219+0000","up_votes":1,"down_votes":0,"body":"Ich nicht. Was aber auch daran liegt, dass ich mir die Splitter zum Mastery uppen aufhebe und noch lange nicht alle Champions besitze.\n\nAllerdings bekommt man tatsächlich mehr, es fällt einem nur nicht so auf wenn man nicht 100% entzaubert.","replies":[{"poster":"5 Dunks 1 Darius","date":"2018-04-15T13:59:39.722+0000","up_votes":1,"down_votes":0,"body":"Ich habe auch noch nicht alle Champs aber ich entzaubere trotzdem immer alle Splitter :P","replies":[]},{"poster":"Amycos Cyrus","date":"2018-04-15T11:59:23.937+0000","up_votes":1,"down_votes":0,"body":"Auch ohne das 100% entzaubern fällt die Änderung des Systems sehr ins Gewicht, da die Splitter ja auch noch Rabatte erzeugen, die zusätzlich zu der Erhöhung der Währung (mehr BE als IP) auch noch die Kosten der Champions reduzieren. (~20% Rabatt).","replies":[]}]}]},{"poster":"Nordwolf87","date":"2018-04-16T07:09:31.224+0000","up_votes":1,"down_votes":0,"body":"Ich hab mir idR nur splitter auf wo\n\n1. In absehbarer zeit der champ M6 od M7 wird (sprich aktiv gespielt wird)\n2. Der Champ zu meinen derzeitigen Rollen passt.\n3. Potenziell in absehbarer Zeit gekauft wird.\n4. Er mich interessiert ihn mal zu spielen wen 1-3 erfüllt sind\n\nAlles andere entzauber ich.","replies":[]},{"poster":"Amycos Cyrus","date":"2018-04-15T11:56:19.157+0000","up_votes":1,"down_votes":0,"body":"Ich entscheide mich in der Frage für \"3. Alles bleibt wie es ist\", denn es ist für mich deutlich schneller geworden an Champions zu kommen. (ohne jemals einen Cent investiert zu haben) und eine Erhöhung des BEs würde es in meinen Augen zu schnell machen.\n\nWarum nicht gleich alle Champs kostenfrei machen? XD\n\n___\n\nJedenfalls scheint es überraschend wenig so schwer zu fallen an Champions zu kommen, wie du es schilderst.","replies":[{"poster":"MrTeaHD","date":"2018-04-15T13:54:17.868+0000","up_votes":1,"down_votes":0,"body":"Das liegt daran das ich relativ wenig spiele ungefähr 10 games in der Woche. Es ist schon so das man mehr bekommt als vorher, allerdings spiele ich LoL jetzt seit ca. 2,5 Jahren und mir fehlen immer noch 33 Champs","replies":[{"poster":"Amycos Cyrus","date":"2018-04-15T17:00:00.592+0000","up_votes":1,"down_votes":0,"body":"Habe in 1,5 Jahren 82 Champs freigeschaltet. (Hauptsächlich über die Splitter und Chests.) (Aktuell fehlen somit mir 58)\nUnd durch mein Studium bin ich auch nicht wirklich jemand, der viel spielen kann.\n\nVor allem die Übergangsphase war extrem, da ja Runen etc. refunded wurden. (Was mir über 20k BE eingebracht hatte. XD)","replies":[]}]}]}]}