{"poster":"Meddler","date":"2018-03-09T16:15:33.318+0000","title":"Quick Gameplay Thoughts: March 9","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hey all,\r\n-------------------------------------------------------------------------------\r\n**Usual Disclaimers**\r\n\r\nThese posts will often contain talk about future work we&#039;re doing, or planning to do, that isn&#039;t yet guaranteed to ship. The nature of the work could change or, depending on what we discover, projects mentioned may get put delayed or even stopped. If you&#039;d like to see a Tweet whenever a new one of these posts goes up: https://twitter.com/RiotMeddler\r\n---------------------------------------------------------------------------- \r\n**Syndra**\r\n \r\nWe last talked about Syndra a bit before the AP item changes were coming out. At that point we were avoiding making changes to most AP champs until we&#039;d seen want impact those items had. At this point though we can be fairly confident they didn&#039;t have a meaningful power impact on Syndra. That does leave her arguably in a weak spot. We&#039;ve been reluctant to just straight buff her however, given the degree to which she ends up being a correct pick all the time when somewhat stronger than she currently is. We&#039;re also still seeing her be the correct pick sometimes at her current power level, at least in the hands of experienced Syndra players. She&#039;s also a champion who, when balanced, will need a noticeably sub 50% win rate, looking at her historically, so we don&#039;t think her current win rate is as strong a signal she&#039;s in urgent need of work as it might suggest on many other champs. \r\n \r\nThat&#039;s not to say we won&#039;t take a look at her at some point, ideally finding ways to sharpen when she is or isn&#039;t the correct pick a bit more. At present though we believe other work, both on other champions and systemic elements like items or the jungle, needs to take priority.\r\n \r\nOn a much more specific note one thing I also wanted to check for those of you who&#039;ve played a fair bit of Syndra is your opinion on the current Q passive effect (extended duration) as opposed to the previous effect (increased damage to champions only). The extended duration makes a lot of combos between her skills easier to pull off, which arguably has some positives and some negatives, so figured it would be a good thing to assess at this point.\r\n \r\n----------------------------------------------------------------------------  \r\n**Rageblade, Locket and Wave Clear**\r\n \r\nWe&#039;ve got changes on the PBE right now to Locket, wave clear (minion health in particular) and Rageblade. All of those are on the experimental side, and it&#039;s likely most, or all of them, don&#039;t ship in 8.6 but likely hit PBE again in a later patch cycle. A few notes on each below.\r\n \r\nRageblade - We&#039;re looking to broaden its pool of users somewhat (e.g. melee users, people who currently get screwed by having their Adaptive stat set to AP by its build path) and reduce how much of a single item spike it is early on its current ideal users. Intent is to keep it as a hybrid AD/AP item with a stacking mechanic, though we have also been testing an AD only version to understand what an item in that space looks like.\r\n \r\nLocket - We believe Locket needs to be more contextual (do pick in some circumstances, don&#039;t pick in others). That&#039;s something we&#039;ve been trying to achieve for quite a while now with various changes, but still haven&#039;t gone far enough on. Also trying to make it so its use is more skill dependent/less consistently reliable. The version currently on PBE (DR zone) has some interesting stuff going on, it&#039;s unlikely it ships though given its also got some substantial issues as well.\r\n \r\nWave Clear - We&#039;re also working on reducing wave clear, during lane in particular, though to some extent later in the game as well. That&#039;s targeted at getting more interaction between champions, since minions being around pulls champions closer to each other to CS thereby creating opportunities for aggression. Easy waveclear by contrast leads to easy safe farming and roaming, which then comes at a cost to other lanes or, late game, leads to stalled out low action scenarios unless Baron buff is available. Still experimenting with different directions there. Think it&#039;s much more likely something ships in 8.8 than 8.6 (exception: a nerf to Shiv which removes its bonus damage to minions that probably will be in 8.6).\r\n \r\n----------------------------------------------------------------------------  \r\n**Swain** \r\n \r\nLooks like we probably overbuffed Swain in 8.5. Still assessing him, but suspect we may need to pull some power back (leave him stronger than in 8.4, but not as strong as 8.5). Best guess at present from what we&#039;ve seen so far is that we&#039;d be more likely to reduce his damage/payoff for landing spells than his ability to land them in the first place (which is where a lot of the newly gained power came from). Pre buff Swain was likely too unreliable, so based off current thinking it&#039;s unlikely we&#039;d revert those reliability increases. Need to see some more play before making a call though.\r\n \r\n----------------------------------------------------------------------------   \r\n**Next week: Surveys**\r\n\r\nGot a good question earlier in the week asking about why we don&#039;t survey more, with some suggestions as to things that might be valuable. Was planning to talk about our survey approach today as a result, give you folks a bunch of context on what we currently do and what our thinking there is. Turned out to be a bigger topic than expected, so moving it to the first post of next week. Let me know if there&#039;s anything survey related you&#039;re particularly interested in hearing about and I&#039;ll try and include something about that.\r\n\r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png","replies":[{"poster":"Abyssphere","date":"2018-03-09T16:37:24.004+0000","up_votes":46,"down_votes":4,"body":"Syndra didn't need to be an easier champion, and good Syndras never found themselves in situations without needed spheres before her rework. The Q passive post-rework does barely anything other than lower her R skillfloor, something which has caused endless frustration for the people playing against Syndra, and caused a lot of irritation for Syndra players as we endure being told over and over again that we play a brainless 'press R' champion. Her old Q passive was nothing interesting and I don't care if it comes back, but her current one needs to go no matter what it's replaced with. I have never heard a Syndra main speak positively of it, actually.","replies":[{"poster":"Meddler","date":"2018-03-09T17:27:31.488+0000","up_votes":14,"down_votes":2,"body":"Responding to this as the top Syndra comment at time of writing. Nothing new to add, but comments on the Q passive are much appreciated.","replies":[{"poster":"1meatsqueezer","date":"2018-03-09T20:10:54.145+0000","up_votes":7,"down_votes":0,"body":"Btw, thank you for looking replying to us syndra mains about our champ. Appreciate you looking into it and addressing it for us.","replies":[]},{"poster":"Farxodor","date":"2018-03-09T20:36:53.178+0000","up_votes":5,"down_votes":0,"body":"I agree with both of Abyssphere's points on Syndra's Q.  Making her 6-7 sphere ults easier to access (and available for longer windows) basically requires that you shift power out of her other skills because her ult becomes so powerful. The old passive was better, but not amazing - I'd like to see either it return or something else that specifically rewards players for landing Qs. Also, even if it means nerfing her ult, it would be nice to get some general stat power back into her Q, especially in the early levels, the base damage scaling on her Q is really wonky.\n\nI'll link a Reddit comment I made on Syndra a while ago, where I talked a bit more about my thoughts on these things, and also her passive overall. I would really appreciate it if you gave it a read!\n\n[reddit comment](https://www.reddit.com/r/leagueoflegends/comments/7jhaou/an_indepth_analysis_of_syndras_q_duration_and_her/dr6yqke/)","replies":[]},{"poster":"The Other Keller","date":"2018-03-09T18:18:14.325+0000","up_votes":6,"down_votes":1,"body":"Syndra by far is one of my favorite champs and most played one too. \nI just wish Syndra’s passive could have a bigger feeling of impact to it. \n\nIt’s always just been kind of there, old syndra was just always “oh I’m level 9 this is my power spike, time to deal more damage” \nAnd new one now just keeps the balls out longer. \nI agree with abyssphere in that I don’t care much for either of the Q passives. \n\nIn my opinion the only feel good part of her current passive is her E, because it actually changes the spell rather than giving just extra stats to it. \nThat’s the reason why I was I hyped for the 3 ball grab in the update because it was actually visibly different and interesting albeit way over powered with her E. \n\nI just want a bigger feeling of oomph from her passive.  \nIf you want to keep her skill floor lower (which I think was at least part of the goal with her Mage update) then maybe try to find a way to add skill expression through her passive?","replies":[]},{"poster":"Abyssphere","date":"2018-03-09T21:45:04.496+0000","up_votes":4,"down_votes":0,"body":"Thank you for responding and for keeping Syndra in your thoughts. I think what I can say, leaving out anything else, is that Syndra's passive should never feel like something that Syndra players have to *accept*, or something that actively makes their experience of maining the champion worse. At the moment, dedicated players of the champion feel that they have nothing to gain from her Q passive, but have had to endure many balance issues because of it, and that's really bad. A main shouldn't feel like there's a part of their champion's kit that they just have to endure having, but Syndra's Q passive is nothing to most of us but a reason she's hard to balance and hated by the community.","replies":[]}]}]},{"poster":"Deneviel","date":"2018-03-09T16:49:30.747+0000","up_votes":4,"down_votes":6,"body":"Any plan for {{champion:80}} ? The nerf to {{item:3147}} with no compesation and minion's change won't hit him too hard?","replies":[{"poster":"Closar","date":"2018-03-09T17:22:02.631+0000","up_votes":21,"down_votes":1,"body":"As a top lane melee main, I hope it does and he falls into oblivion even deeper than now. :) :p","replies":[{"poster":"ITakeYoSandwich","date":"2018-03-09T18:33:44.682+0000","up_votes":7,"down_votes":1,"body":"Very this.","replies":[]}]}]},{"poster":"KidTrilogy","date":"2018-03-09T16:30:54.359+0000","up_votes":16,"down_votes":0,"body":"I've been playing Syndra since season 3 and have been able to pull off the 6-7 sphere combo without that unnecessary change. I would have preferred the bonus damage on Q to stay.","replies":[]},{"poster":"PeachyBubbleStar","date":"2018-03-09T16:25:49.860+0000","up_votes":5,"down_votes":10,"body":"Hai Meddler!~ \n\nAny thoughts on Poppy? o.o she seems to be in a bad current state .o.","replies":[{"poster":"Meddler","date":"2018-03-09T16:38:34.188+0000","up_votes":20,"down_votes":2,"body":"Oh, I've got a different take there. I think the most recent changes actually put her into a pretty decent spot, both in regular play and pro. She's getting picked and proving fairly effective without being in must pick territory from what I've been seeing recently.","replies":[]}]},{"poster":"MalrothDragonia","date":"2018-03-09T16:26:07.331+0000","up_votes":8,"down_votes":0,"body":"Hey Meddler, I know you're still working on the ADC thoughts and the direction you're taking, I've had some thoughts on this for a while and wondering if it's anything you've considered, or if my thinking on this is off-base. I'm going to paste what I asked last time:\n\n1) I've often thought of the tankbuster niche as something that should be champion specific, by having mechanics like %health on a kit (like vayne) or heavy defense penetration (wukong, vi,etc.).\n\nIs that a direction you see yourself going as giving an entire class of champion that identity as tank buster is what may have been narrowing the choices?\n\n2) Also, as the premier tower damaging class, I always thought waveclear was an inherent weakness of the [marksmen] class, and specific kits would sacrifice power to gain access to it (sivir, and should be trist but right now she's pretty dominant so it seems she's not sacrificing enough power there) also that shiv and such shore up that weakness so well that it's not really seen as such.\n\nIs waveclear as an adc weakness something you see pushing more for in the future? (potentially, not looking for a commitment)","replies":[{"poster":"Meddler","date":"2018-03-09T16:36:39.921+0000","up_votes":9,"down_votes":0,"body":"Tank busting - we want to ensure there are a range of common picks who can opt into tank busting where needed (Last Whisper line, BotRK etc in the case of Marksmen or Skirmishers for example). Rationale there is that you often won't know in champ select which enemy champions are going to do really well and get a lot of items or who'll get picked later in pick order. If tank busting is primarily delivered via kits that then creates a situation where you either always pick a tank busting champ just in case or run the risk of just having no response if an enemy champion gets really tanky. Some champs being extra strong at tank busting's certainly fine, but shifting towards it not being reasonably available as a baseline creates problems. Longer term we're hoping to get things to a state where you also don't have to rely so much on your marksman as possible tank buster (e.g. skirmishers, juggernauts, maybe some mages being alternatives you could grab in champ select who could opt into that role).\n\nWave clear by contrast is something we think should be more kit specific on marksmen. We'll be toning down Shiv against minions a lot in the next patch (no longer deals bonus damage to minions, slightly lower damage overall) as a starting point on that. Not certain yet on next step after that, depends in part on where the larger wave clear focused changes end up.","replies":[{"poster":"DeathBurst","date":"2018-03-09T16:50:58.412+0000","up_votes":3,"down_votes":0,"body":"So what's the intended use of Statik Shiv? What's the reason ADC should be buying this item? (Honest question here, not trying to be loaded.)","replies":[{"poster":"Meddler","date":"2018-03-09T16:59:19.957+0000","up_votes":6,"down_votes":0,"body":"AOE damage (its champion damage in team fights is unchanged), burst (given its ability to crit especially) and a lesser amount of wave clear. And its stats. Even without the extra wave clear bonus it still offers a lot IMO.","replies":[{"poster":"The Blue Rajah","date":"2018-03-09T17:10:34.074+0000","up_votes":15,"down_votes":1,"body":"Shiv has always seemed a bit too generalist to me, since it can do everything you just mentioned. It’s never the wrong choice, and that’s reflected in its popularity.\n\nAn idea I’ve had floating around for quite a while is that the ability to crit from shiv should be swapped with the quick energized shot charge from rapidfire. It makes more sense to me that the item that does one big hit would be the item you get to amplify your burst. And shiv would still be useful for everything else it does, it would just be less bursty. \n\nRapidfire has become more popular than it used to be, but almost exclusively because it makes your shiv better. Obviously it would need number tuning beyond just swapping the effects, but do you think a change like that would be in the realm of possibility?","replies":[]}]}]},{"poster":"MalrothDragonia","date":"2018-03-09T16:54:08.738+0000","up_votes":1,"down_votes":0,"body":"THANK YOU! I'm very interested in game development and with all the talk about ADC balance this season, these questions have been burning my frikkin brain.\n\nI see what you're saying about making tank busting easily accessible, do you think as champs get changed/new champs come out that moving that skill set so that enough champs have tankbusting capabilities, the game will get to a state where ADCs no longer need to have that identity? or is that not really the plan?\n\nI was excited about the shiv changes. Do you think an item like that is inherently problematic given how strong ADCs are right now? Or is shoring up a champion's weakness through items so strongly a reasonable design?","replies":[{"poster":"Meddler","date":"2018-03-09T17:03:09.347+0000","up_votes":6,"down_votes":0,"body":"I think it's likely to stay part of the ADC identity, we'd like to make it so that other classes can also fill that niche too though. That means ADCs can be less mandatory and opens up the potential to maybe trim back a bit on tank busting from them someday (that bit's fairly speculative though).\n\nI think items need to be able to shore up some of a champion's weaknesses somewhat, otherwise they're not able to do anything but magnify what's already on the kit. I think the issue there is which weaknesses and how much. Dead Man's Plate for example gives some extra mobility to juggernauts, but they're still pretty kiteable, compared to giving them an item with a dash say. Or an item like Tear lets champs like Anivia or Kassadin reduce the amount they're mana gated significantly, but doesn't let them cast infinitely thankfully.\n\nI don't think Shiv's core design (charge it up to chain lightning) is inherently flawed. The exact mechanics on it on the other hand need some work though certainly.","replies":[]}]}]}]},{"poster":"nononthesnake","date":"2018-03-09T17:50:51.860+0000","up_votes":13,"down_votes":0,"body":"The current passive on Dark Sphere makes Syndra arguably difficult to balance since most of her combos (namely the ones with high number of spheres for Unleashed Power) are much easier to access, when instead they were always meant to be a difficult combo to pull off for excellent burst damage as payoff.\nI remember that when this was changed in the MYMU the intent was clearly to make these combos easier to achieve because they were deemed too difficult to do previously, but honestly right now you can do a full 7 spheres Unleashed Power as early as level 9 (with Dark Sphere maxed of course) and 20% cdr, and that's kinda sad compared to before the Mages Update.\nI also believe that the previous Dark Sphere passive was more fun to play with than the current one, and the one she has currently just feels like a way to make her timings more easier to access, which causes problems with her kit, even if I also understand that the \"deal more damage\" passive was put into Force of Will with the true damage. \n\n{{champion:134}} People fear what they cannot understand. {{champion:134}} ","replies":[]},{"poster":"Thighonia","date":"2018-03-09T17:06:38.359+0000","up_votes":4,"down_votes":2,"body":"This is going back a little to ask but why are you guys nefing duskblade but buffing all its users? By your own admissions assassin's aren't in a good spot and if you are just buffing all the users doesn't nerfing the item just make this power neutral? I don't even play these champions I just find it a confusing logic to follow","replies":[{"poster":"Meddler","date":"2018-03-09T17:15:01.325+0000","up_votes":12,"down_votes":0,"body":"A few things on our mind there:\n\n1. At present so much power's wrapped up in Duskblade it makes it harder to tune individual assassins.\n2. Having that much power in an item effect homogenizes its users somewhat (degree to which you're playing Duskblade, rather than your champion, ends up too high).\n3. Duskblade's power kicks in all at once, leading to power curves that spike really hard at one point but don't increase sufficiently pre or post Duskblade for many users.","replies":[]}]},{"poster":"BloodMoonKindred","date":"2018-03-09T16:26:07.429+0000","up_votes":13,"down_votes":1,"body":"Sort of odd question, but do you have any thoughts on the state of Marksman Junglers? (Graves, Quinn, Kindred, Kai'sa maybe?) If it needs to be more specific, than the itemization of them compared to other classes building similar items, such as the crit marksman having a close powerspike to adcs even though their jobs tend to be a bit different.","replies":[{"poster":"Meddler","date":"2018-03-09T17:08:05.853+0000","up_votes":12,"down_votes":1,"body":"I think marksmen jungling will need to be closer to the power curves of other carry junglers than laning marksmen. They've got a farming pattern that's much safer (PVE's reliable), so can't get the same degree of powerspike purely off that that laning marksmen who are taking more risk do. They should be able to make the same sort of impact, but that should require successful actions with risk attached (ganking, invades, objective control), like other junglers. Needing to do those things then likely means they'll need similar power progression to other damage focusd junglers like Yi or Kha'Zix.","replies":[]}]},{"poster":"Blossom Crown","date":"2018-03-09T17:13:54.134+0000","up_votes":10,"down_votes":0,"body":"Hi Meddler, Syndra main here, whilst the current Q passive effect does open up Syndra’s ability to combo, it also reduces her skill cap. Reaching a 7 sphere ultimate is pretty simple once you reach level 9. \n\nThe previous iteration of % bonus damage to champions was much better. It doesn’t affect her waveclear, rewards landing your skill shot and promotes actual sphere management. \n\nI would 100% be up for reverting her Q passive to what it was before.","replies":[]},{"poster":"T8 Speedwagon","date":"2018-03-09T16:23:45.815+0000","up_votes":1,"down_votes":8,"body":"Any thoughts on Kai'sa state? Lots of people demand for a bigger aa range which is reasonable given her mobility gated by high cds.","replies":[{"poster":"Meddler","date":"2018-03-09T16:43:20.251+0000","up_votes":13,"down_votes":1,"body":"I think it's too early to be talking about major changes to Kai'Sa like AA range. Rapidly buffing core parts of a champions kit like that often goes poorly for us when players are still learning someone new and there's a lot Kai'Sa does that's quite powerful. She's also got a fair bit of learning curve, given she's demanding on positioning and her itemization's somewhat unusual (which, for one thing, is resulting in people trying some pretty experimental and often not that great builds at present).","replies":[]}]},{"poster":"MalrothDragonia","date":"2018-03-09T16:24:11.225+0000","up_votes":6,"down_votes":1,"body":"I asked this question in maybe too long a form but, Is waveclear as an adc weakness something you see pushing more for in the future as opposed to tankbusting, and that at present shiv and hurricane do such a good job of shoring up that weakness that it's not really seen as one?","replies":[{"poster":"Meddler","date":"2018-03-09T16:40:52.527+0000","up_votes":8,"down_votes":0,"body":"See reply linked below where I responded to a player called MalrothDragonia who was also asking a very similar question ;)\n\nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/g62V3OZh-quick-gameplay-thoughts-march-9?comment=00090000","replies":[{"poster":"Elewd","date":"2018-03-09T17:17:51.359+0000","up_votes":3,"down_votes":2,"body":"(they are the same person)","replies":[{"poster":"ITakeYoSandwich","date":"2018-03-09T18:30:39.832+0000","up_votes":7,"down_votes":0,"body":"(that is the joke)","replies":[]}]}]}]},{"poster":"Dog of Pavlov","date":"2018-03-09T17:15:06.853+0000","up_votes":7,"down_votes":0,"body":"As a Syndra main this ruined my Friday :(","replies":[]},{"poster":"Plubio","date":"2018-03-09T17:11:09.411+0000","up_votes":7,"down_votes":0,"body":"Hey Meddler, Syndra player here. While I do agree she's not in the worst spot she has been, I think it is time to (again) talk about something that really hinders her gameplay — her movement bug. Syndra's been getting herself blocked with invisible wall since December 2015 and this was never fixed. \n\nNo matter what ping are you playing with or your game settings, she still blocks herself just by walking. Trying to move backwards and forwards or from left to right makes her to do a completely erratic movement, sometimes totally hindering her nature as a no cast times mage. It may seems like a stupid request but she doesn't feel \"smooth\" to play (comparing to some other inmobile mages like Orianna, Malzahar or Anivia) and it would be great if something can be done about that.\n\nEDIT: Actually, I feel like if all her bugs were fixed she would be in a better spot, honestly.","replies":[]},{"poster":"Rumble Kid","date":"2018-03-09T16:56:12.026+0000","up_votes":5,"down_votes":0,"body":"I posted a similar comment on another thread, but since this one looks more specific and I'd like to know Meddler's point of view, I'm going to ask you the same questions about Rumble. Aren't these Rumble buffs going to make him even more ult reliant considering how he already is? Have you guys thought of reverting Q changes you did in 7.12? That patch killed Rumble Jungle and most of all forced Rumble to start E, forced Rumble to wait level 3 to being able to manage heat, removed Rumble possibility to enter Danger Zone lvl 1 which basically means he can't trade with ANYONE before that and he can't setup cheesy early ganks level 1 or 2.\nI can understand Rumble old Q was oppressive for melee champs who needed to give up lot of cs, but Bone Plating and Resolve Tree in general didn't exist back then. Now it's quite common to see people farming while Rumble Danger Zone Q is up after they get their Spectre Cowl, because their Resolve tree + Doran Shield allows them to do so. I do hope Rumble buffs won't be anything Ult related because that's the only thing that is fine with his kit atm.","replies":[{"poster":"Meddler","date":"2018-03-09T17:18:16.730+0000","up_votes":5,"down_votes":0,"body":"Still testing different approaches to Rumble. Version that went in for testing last night looks like this:\n\nNew list:\n\nThe Equalizer (R)\nTotal Damage (over 5s) :: 650 / 925 / 1200 (+150%AP) >>> 700 / 1000 / 1300 (+175%AP)\n\nFlamespitter (Q)\nTotal Damage :: 135 / 180 / 225 / 270 / 315 (+ 110% AP) >>> 150 / 200 / 250 / 300 / 350 (+110% AP)\nDamage to minions :: 75% >>> 70%\n\nAiming to give both some mid game presence and some laning strength back.","replies":[{"poster":"LitoJ","date":"2018-03-09T18:28:43.383+0000","up_votes":6,"down_votes":0,"body":"Hi. I've mentioned this before in some previous threads in the past, especially in regards to Rumble's \"niche\" as an \"ult bot\" but have you considered working more on Rumble's utility or passive rather than his damage? I know no one likes a feast or famine champion, and sadly for a \"complex\" champion like Rumble, that's often what he feels like. Putting in even more damage is completely dancing around the real issues with his flaws and the fact that skill expression with his current kit in current modern times is extremely limited. \n\nWhat if Rumble had something that adhered to his thematic more as a mechanic and tinkerer? What if(somewhat like khazix) Rumble at some points in the game, like if he were to max one his basic abilities, could have the option to upgrade an ability into having one out of two utility effects?\n\nFor example: At Level 5 maxed W - Scrap Shield can be upgraded to have an additonal effect to make up for his limited short range.\nDepending on the player he could choose:\nUpon reaching dangerzone, Scrap Shield removes any and all slows for 1-2 seconds. Or, Upon reaching dangerzone, Scrap Shield gains Fiora's old parry effect for 1-2 second dealing magic damage back to champions who initiated auto attacks.\n\nSimilar to not just khazix but also with the similar thematics that other champions with 'tech' themes have, such as Heimer's ultimate, or even Viktor and his ability upgrades (except Rumble could have two options per basic ability to choose from instead of one per ability). \n\nSomething like this would not break Rumble in the early game as this would focus on the player's decision making skills in the mid-late game and wouldn't just simply rely on Rumble's ability to do damage (especially when he's behind and can't afford to do much damage or get close enough to slow people when his ult is down as well) or his ability to land a decent ultimate and then simply go home cause your job is done and you're kinda useless after that.\n\nI really hope you guys will listen to us mains more and not just band-aid fix him until he gets nerfed again for doing too much damage in pro-play.","replies":[]},{"poster":"FervorRumble","date":"2018-03-09T17:29:02.715+0000","up_votes":3,"down_votes":0,"body":"would really love to see some %hp damage in his kit to strengthen his top lane state, reduce q base damage and add it there so he can damage tanks. Currently, this only strengthens rumble mid and vs top lane squishies.","replies":[]}]}]},{"poster":"loli nukes","date":"2018-03-09T17:37:51.516+0000","up_votes":5,"down_votes":0,"body":"hey meddler about adcs how do you feel about crit build paths vs noncrit build paths and its performance in the bot lane. rageblade witts end is an interesting one however the users are kog'maw who is always pretty special and varus who has been a huge generalist in terms of builds. Ezreal is the only adc really going triforce (sometimes iceborne). Do you think crit should be a huge staple of all adcs with some niches or do you think the builds need to be opened up(the choice between energized are pretty minimum with hurricane users absolutely needing it while others dont). Just wanna hear thoughts","replies":[]},{"poster":"Dog of Pavlov","date":"2018-03-09T17:23:49.057+0000","up_votes":5,"down_votes":0,"body":"I just am amazed that after you guys have taken into account so much as to what other mains were saying (LB revert, Ahri changes, etc.) that you decided that even with Syndra mains arguing that they simply want a revert on the Passive-Q effect, you ignore it. We aren't even asking for that many changes like LB revert and Ahri changes require, but it's a healthy one that gives something while taking something. No Syndra mains are happy with the current state of her, and you just brushed her under the rug again.","replies":[]},{"poster":"Torciv","date":"2018-03-09T17:10:05.032+0000","up_votes":5,"down_votes":0,"body":"Syndra is not currently in his bright moments due to the fact that some champs have taken more advantge of the new item reworks which Syndra can not take the full potential from them. In fact, one of the things that I found more stressful when I play her, is the fact of the cost of mana that her habilities require whereas other champs aren't being affected that much. Currently I need to for sure blue all the game, even on late game cause of the waste of mana that she has, specially in mid game.\nHearing that you were thinking on nerfing even some of the AP runnes of getting mana almost made me cry.{{champion:134}} {{sticker:sg-janna}}","replies":[]},{"poster":"Seviel Vorose","date":"2018-03-09T17:02:24.842+0000","up_votes":5,"down_votes":0,"body":"Hi Meddler! \nI'm a long time **Syndra** main, and i agree with **_almost_** everything you said about her. As i explained [here](https://boards.na.leagueoflegends.com/en/c/gameplay-balance/Xu1PzAvO-an-in-depth-analysis-of-syndras-q-duration-and-her-rs-windows-of-power-by-a-950k-syndra-main), the reason why she is so oppressive when strong, is her current Q passive, which you mentioned. I'll quote a sentence from the post i linked you: \"how can any other part of her kit be buffed, if reaching the peak of her R burst is so easy now?\". She doesn't need huge work, since she already has an identity: very high skill ceiling, niche immobile burst mage with decent dps and a very strong AOE stun.\nWhat she needs is a more skillful way of helping her keeping spheres down.\nSomething like this, for example:\n\nQ: new q passive, something that increases her kit burst without adding too much dps.\nR passive component: sphere's duration is extended by x (1 second?) when they hit an enemy unit (doubled for champions) (this effect can only trigger once per sphere).\n\nThanks for your attention.","replies":[]},{"poster":"JamesIAm","date":"2018-03-09T16:24:47.613+0000","up_votes":3,"down_votes":0,"body":"What are your thoughts on where spellbinder has landed post release? I'm still not seeing it a huge amount, but it feels like it should be pretty strong in certain comps and against certain champs.","replies":[{"poster":"Meddler","date":"2018-03-09T16:40:13.678+0000","up_votes":5,"down_votes":0,"body":"Seems in at least an ok spot? Items that aren't clearly overpowered or extremely appealing tend to take quite a bit longer to assess than champions. That's because, even if they're pretty good, it takes quite a while for player behavior to shift to incorporate their use effectively. \n\nCould hopefully offer more useful thoughts in a few more weeks.","replies":[]}]},{"poster":"DarkNanovor","date":"2018-03-09T17:22:59.982+0000","up_votes":6,"down_votes":1,"body":"Hey Meddler, any thoughts on reverting {{champion:104}}  E back to when it had MR? The compensation buffs on his smokescreen didn't really help at all and his win rate keeps dropping every patches.","replies":[]},{"poster":"Mansana","date":"2018-03-09T16:44:47.315+0000","up_votes":4,"down_votes":0,"body":"Things to note about reveting Q back to bonus damage to champions:\n\n* If it is a full revert, it will make the impact slightly stronger than her current Q at max rank, but will lose power in early game. If I recall correctly there was a reason why you increased the AP ratio when you made the change in the first place in 6.9; removing the bonus damage did feel bad at that point of the game but the compensation was nice. Also wave clear might be an issue since it only applied to champs; assuming she keeps the same AP ratio and base damage then it should be fine. However, if it's a full revert on top of the minion changes that might go through that's more mana to waste since bonus damage does not apply to minions.\n* It will make combos very much harder to pull off because it will decrease your window of opportunity to do certain combos during the laning phase. Yes sphere management is a thing. Giving your opponent more windows of opportunity without being zoned off by 1 sphere is also a thing. Not sure how I feel about it because there are a lot of factors that take place if you remove it, such as wasting more mana to keep spheres in play and keeping pressure.\n\nTL;DR: With the revert, Sphere and Mana management difficulty will increase. Not sure by how much but it will leave room for you to lever her power assuming you take difficulty as a guideline of how you balance champs. I assume tweaking numbers is still a thing, so I will be fine with or without the revert. \n\nEdit: If it does get a revert, _0.05% ap ratio and longer sphere duration_ for _ 20-25 % bonus damage on champs\n_ equates to  around 60 extra damage difference at max rank at 600 ap in exchange for 2 less seconds on sphere duration.\n{{sticker:sg-syndra}}","replies":[]},{"poster":"i like meatloaf","date":"2018-03-09T16:28:01.837+0000","up_votes":1,"down_votes":0,"body":"it sounds like the waveclear changes are more about adjusting waveclear around the first/second item powerspike so affecting waveclear around 10-15 minutes which is kind of affecting midgame, but mostly leaving early game the same, is that accurate?\n\nwaveclear in the earliest minutes of the game is already pretty hard, would hate to see it get harder","replies":[{"poster":"Meddler","date":"2018-03-09T16:31:00.984+0000","up_votes":4,"down_votes":0,"body":"We're targeting a couple of different points in particular. The first is wave clear from level 5 or so onwards (some champs earlier, some later), where at present it's too easy to clear quickly and roam or just play passively. The second is later in the game where sieging without Baron's often just too difficult.\n\nNot trying to make CSing dramatically more difficult early on though, so possible we might need to compensate there to some degree.","replies":[]}]},{"poster":"AlistarMilking","date":"2018-03-09T16:23:20.081+0000","up_votes":2,"down_votes":0,"body":"Hey Meddler! I wanted to mention that Summon: Aery has been bugged for a few patches: it's missing its recall animation it had when Runes Reforged first launched. Any chance the team could get that fixed?","replies":[{"poster":"Sparkle","date":"2018-03-09T16:26:31.150+0000","up_votes":4,"down_votes":0,"body":"I've noticed this as well, I will make sure we have the bug logged. Helicopter tails are important!","replies":[]}]},{"poster":"Ulchete","date":"2018-03-09T16:25:42.003+0000","up_votes":5,"down_votes":1,"body":"As a Syndra main, I used to prefer the 15% extra true damage, which also made landing her Q more important. I remember I still could pull a 7 ball ult to for example land a huge stun, I definitely prefer the extra damage. Is going to be ok anyway tho, I dont really mind (still prefer the extra dmg xD)","replies":[]}]}