{"poster":"Meddler","date":"2018-03-23T16:04:50.858+0000","title":"Quick Gameplay Thoughts: March 23","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hey all,\r\n-------------------------------------------------------------------------------\r\n**Usual Disclaimers**\r\n\r\nThese posts will often contain talk about future work we're doing, or planning to do, that isn't yet guaranteed to ship. The nature of the work could change or, depending on what we discover, projects mentioned may get put delayed or even stopped. If you'd like to see a Tweet whenever a new one of these posts goes up: https://twitter.com/RiotMeddler\r\n---------------------------------------------------------------------------- \r\n**Attack Move Changes on PBE**\r\n \r\nWe're testing out some tweaks to how attack move works when you're using the attack closest to cursor setting (the default). Core of those changes is that we're increasing the distance around the cursor where targets will be checked for substantially before the game then checks for targets near your champion instead (500, instead of 250). There are also some secondary tweaks to how in-range targets will/won't be prioritized over out of range targets (avoiding mention of the details here to see what does or doesn’t get noticed on the PBE). We've been testing those adjustments internally for a while, and playtesters haven't been reporting noticeable differences. That's mainly a good sign (suggests things are just working well behind the scenes). Thoughts from anyone playing on PBE also much appreciated over the next week or so. Changes seem to be working overall, but want to double check that and if nothing else see if there's room for further polish. \r\n \r\n----------------------------------------------------------------------------  \r\n**Balancing some champs for organized teams**\r\n \r\nWe've had long running difficulties with some champs who perform dramatically better for organized teams (pro teams, premade 5s, Clash soon etc) than they do for matchmade solo queue teams. Azir, Kalista and Ryze are the strongest example of that, where their performance for the average player trying them will often look pretty weak if they're in a balanced state for organized teams. One of our goals with champion balance is to ensure they're good choices in a wide range of contexts, so that's not ideal. At the same time though they're still situationally very strong even in solo queue sometimes. \r\n \r\nWe've also put a lot of time into trying to close that gap on those three over the years, with mixed success, given some parts of those champions core identities are tied to the very elements that give them that variance in power by context. For a while, quite possibly a long while at that, we're going to be prioritizing most other champion work over closing that gap as a result. That means Azir, Kalista and Ryze will be balanced for their strong cases (organized play primarily), even if that leaves them quite weak in other contexts (exception: a bit of Ryze work that's already underway and might or might not ship). It's not that we think that's the perfect solution, but that we think the time's better spent on other champions who haven't got that same degree of attention over the years and would benefit a lot from it. \r\n \r\nIf you're someone who likes those champs, but feels you shouldn't play them in solo queue, our apologies. I expect that feels pretty rough and that even if these champs are strong in the right circumstances that doesn't help if those circumstances aren't ones you personally experience. Completely agree there are downsides to this approach, we do think it's the best available trade off for LoL players as a whole though.\r\n \r\n----------------------------------------------------------------------------   \r\n**Midseason**\r\n \r\nA few more midseason bits and pieces worth mentioning:\r\n \r\n*  We've been testing various jungle power level changes and recently concluded that we were better off putting them in midseason, both to take more time to get them right and since they're the sort of wider systemic change that's often better bundled into midseasons or preseasons, especially as we get to the otherwise lower change parts of the year.\r\n* It's likely we do some set up changes for midseason in 8.8 to help validate that they do what we think they do before we pair other changes with them. In particular we're looking at mage mana pools and regen in the first few levels, and how much we might need to increase their early ability to cast more spells to make them better duo laners. That’ll look like changes to base mana and regen, probably paired with a nerf to Doran’s Ring. Nothing too major by itself, but useful to understand what impact it has while we’re still working on other stuff.\r\n \r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png","replies":[{"poster":"VaVahik","date":"2018-03-23T18:52:27.857+0000","up_votes":40,"down_votes":8,"body":"Can you share few words on the state of{{champion:55}}  Katarina? First Rengar and Leblanc get reverts that shorten their kill times, now you release Irelia that feels like she will become my new main instead of Kat and this makes my heart split in half  {{item:3073}} {{item:3073}} \n\nI will just post something I discussed with BelugaWhale during Thunderdome:\n\n>Her win rate dropped to about just 50% right now (And under 50% for any ELO range excluding dia+), while her play rate dropped by at least 2.5 times. Many Kat mains are frustrated about lack of success with her after 8.4, and usually with such play drop rate, her winrate should at least decrease just a litle/even increase , as FOTM players drop her and higher proportion of Kat players are her OTPs.\n---\n>Rengar and LeBlanc got their reverts and we are jelly. Not that we want old kat back (I don't), but we would love some QoL smoother gameplay. Of course, that pair had it most bad after assassin rework. However, once Kat got nerfed and the extra unneeded damage was stripped off her, her design problems became more apparent.\n---\n> We don't think damage is the problem, kat had just superfluous damage ever since preseason 8 gave her domination tree that synergizes perfectly and is pretty flexible within, and we can run any of the 4 secondary trees depending on tastes. We knew she had to be nerfed damage-wise , and we love the ability to adapt that new runes give. It's just reliability/smoothness issues that make Kat feels less enjoyable, regardless of her performance (which we ignored so far , because well, she was OP)\n---\n> Our main problem is dagger falling speed. Since Kat's E Shunpo CD got up, she is more about timing it right in the early game and that's fine, but come lategame, every time you jump on a Tristana/Vayne/Taliyah/Janna etc, you get pushed back and killed before you can even pick the W dagger unless you manage to miraculously predict their skills and Q>E>flash in a direction that makes you fly into your Q dagger.\n---\n> You talked internally about dropping the dagger fall time. Is there any chance you guys talk it back again? Even Faker tried kat in 8.5 and currently he sits at a low win rate. Many Asian Kat OTPs outright stopped playing for a while or reduced the amount of games they play. \n---\n> The change BelugaWhale suggested was to reduce her dagger drop times at levels 6,11 and 16 quite significantly, in exchange demanding to hit two daggers to perform an ult-less kill. She is a Draven of mid lane, and his axes fall distances scale with his MS to account for that. Why can't ours get a similar QoL change? \n---\n> Suggestion: drop the scaling down to 0.55 / 0.60 / 0.65 / 0.7 AP and 0.85 AD, and lower the drop time from flat 1.25 seconds to 1.25 / 1.10 / 0.95 / 0.8 seconds.\n---\n>Since majority of supports/adc defensive options work instantly, this shouldn't be a problem and will keep Katarina's fluid feel from her midgame to lategame, where she still keeps dancing to get multiple daggers off , rather than fishing for unaware enemies or rely on her team's CC to even be able to damage anyone. This feels bad for both Kat players and those unlucky souls that step on a dagger once she gets a few items.\n\nPlease Make Katarina Great Again!\n{{sticker:katarina-love}}","replies":[{"poster":"Brayson","date":"2018-03-23T23:02:40.683+0000","up_votes":15,"down_votes":4,"body":"I cannot support this enough. A large part of what got me invested in Katarina pre rework was the satisfaction of being able to quickly execute your skill commands upon reset in a deadly flourish of knives. The designers did a good job of preserving a lot of that while adding new skill expression, but it feels really bad when you have to sit and wait for your damage after you've used those abilities. It's a real problem in the later stages of the game because she once again returns to her problematic binary playstyle. Either you kill the enemy instantly with a Q E gunblade R (not very fun for the enemy), or you need a second dagger from W; however, the later is a death sentence because of the drop time. Especially against marksmen who are around 2.0 attack speed. In the time it takes your W to land they've already attacked you 3 times with Infinity Edge crits. Needless to say, you're now dead. \n\nI don't know what the appropriate solution to a problem like this would be, but decreasing Katarina's dagger activation period sounds like a step in the right direction. She's totally fine with her damage profile, so maybe compensatory nerfs could be along the lines of Q or W cooldowns being increased to punish a bad play that doesn't result in a kill/ curb her lane pressure. \n\nAll in all, I find it hard to be successful against competent players in the event that a game isn't snowballed. Personally, I prefer longer games that allow for more plays and item fantasies to be completed, but you're not afforded that luxury with Katarina. I hope you consider taking a look into it.","replies":[]}]},{"poster":"Frozen Diva","date":"2018-03-23T16:12:01.505+0000","up_votes":19,"down_votes":4,"body":"So... is there a timeframe for {{champion:127}} now...?\nYes I am annoying. But that's like the fourth iteration of Ahri changes on the PBE right now and still no news about Liss.\n\n","replies":[{"poster":"Meddler","date":"2018-03-23T16:26:31.166+0000","up_votes":9,"down_votes":6,"body":"Nothing definite. I was hoping to target 8.8, that's looking really unlikely though in terms of the amount of time I've been able to put into Lissandra work recently however. I got a good amount of progress and testing in a couple of weeks back, have been pretty slammed since then though, to the extent I've spent more time answering questions about that work than actually working on it I suspect.","replies":[{"poster":"SaltNPetty","date":"2018-03-23T17:43:42.743+0000","up_votes":5,"down_votes":9,"body":"I understand things take time; but we were talking about the changes in 8.4; out of nowhere Ahri jumps in priority to her and has gotten tons of changes and talk/focus. Ahri merch sells better, so she's higher priority.","replies":[{"poster":"Electro522","date":"2018-03-23T17:52:09.625+0000","up_votes":14,"down_votes":1,"body":"Or....it's the fact that Meddler designed Lissandra, and is wanting to work on the changes himself, while also working on all of his other work that his title of \"Lead Gameplay Designer\" entails. He *did not* design Ahri, and thus the changes for her are the result of a different designer of whom has alot more time on his/her hands.\n\nLook at Rengar and LeBlanc.....both of them have had heavy work done to them, and in fact, I'd say LeBlanc has had just as many changes as Ahri in the same amount of time.\n\nYet this seems to have passed your mind when you went straight to the notion that Riot cares about nothing but money. Really easy to think that, isn't it?","replies":[]}]}]}]},{"poster":"Thighonia","date":"2018-03-23T16:35:02.525+0000","up_votes":13,"down_votes":1,"body":"Was wondering if you had thoughts about gunblade. It is an item that seems to suffer from some of the same thing that made you change rageblade and nerf duskblade. Too powerful a spike at first item, Feels like you are playing gunblade rather than the champion. It's users also seem to be very feast or famine in solo queue so i was wondering how healthy you think it is.","replies":[]},{"poster":"Wukong Airlines","date":"2018-03-23T19:18:52.446+0000","up_votes":9,"down_votes":1,"body":"Hey Meddler.  When will {{champion:62}} be seriously addressed and get his kit reworks?\n\nWhy was he a prime candidate in the Diver's rework then canceled then was never prioritized?\n\nAre you waiting for Wukong to reach a certain point in order to give him a gameplay update?","replies":[]},{"poster":"Spideraxe","date":"2018-03-23T16:08:40.749+0000","up_votes":9,"down_votes":2,"body":"Hey Meddler can we get some context behind the rune changes on the PBE, since the Sudden Impact one seems very drastic at 25 seconds","replies":[{"poster":"Meddler","date":"2018-03-23T16:16:34.280+0000","up_votes":8,"down_votes":1,"body":"We're doing a general balance pass on non keystone Runes that are either too dominant or not good enough to pick much. That's still pretty work in progress so expect to see things change a bit more over the next few PBE cycles. Sudden Impact's being looked at because it's pretty dominant in that slot, especially on any champ with really repeatable dashes. Having said that, I believe we'll be pulling that CD increase, at least for now, and testing some other options.","replies":[{"poster":"Frozen Diva","date":"2018-03-23T16:20:57.868+0000","up_votes":2,"down_votes":0,"body":"What are your thoughts on Cheap Shot?","replies":[{"poster":"TomiMan7","date":"2018-03-23T16:31:27.109+0000","up_votes":2,"down_votes":0,"body":"personally i think its weak.","replies":[{"poster":"PowerOfDrainAge","date":"2018-03-23T17:05:11.582+0000","up_votes":3,"down_votes":0,"body":"personally i think it's non existent. If it dealt a good amount of dmg but on like 15s CD many ppl would get it.","replies":[]}]}]}]}]},{"poster":"Wolfearent","date":"2018-03-23T16:19:51.071+0000","up_votes":3,"down_votes":0,"body":"I recall around the time of Varus’ lore update that he may get a new VO? Is that still a thing/with the release of the MF skin are we getting a new VO for her base?","replies":[{"poster":"Meddler","date":"2018-03-23T16:21:50.208+0000","up_votes":6,"down_votes":0,"body":"We're looking to do new VO for MF and Varus at some point, no timeline I know of at the moment though. Won't be an MF general voice update with the skin.","replies":[{"poster":"Illidan is HOT","date":"2018-03-23T16:42:50.174+0000","up_votes":5,"down_votes":0,"body":"If you ever updated her VO would you try to bring back her original actress, the one who voiced GGMF or someone else? Also are there any details you could share with us about not bringing back original MF VA for her ultimate skin? Not hating on her new VA, I got the skin and I love it but I'm just curious. People grew pretty attached to how MF sounds over all these years since her release.","replies":[]}]}]},{"poster":"Solari Fortune","date":"2018-03-23T16:13:12.142+0000","up_votes":6,"down_votes":0,"body":"Any news on the ADC work that was talked about?","replies":[{"poster":"Meddler","date":"2018-03-23T16:19:59.728+0000","up_votes":6,"down_votes":1,"body":"Midseason.","replies":[{"poster":"Solari Fortune","date":"2018-03-23T16:25:59.604+0000","up_votes":5,"down_votes":0,"body":"Any idea of what might be changing or is that STILL in planning phase?\n\nWill the Crit system get a look at? Items? Abilities changed?","replies":[]}]}]},{"poster":"TomiMan7","date":"2018-03-23T16:13:18.330+0000","up_votes":2,"down_votes":5,"body":"Hey\n\nI know its kinda off topic but will you guys change how single target skill shot works? I've heard that the end of these skills shots(blitz Q for example) there is a target finder, a circle if you will, so even if you would have missed the hook, it will jump to a target close by and hit them, even if they would have dodget it.\nThis is very annoying, and promotes bad and skilless gameplay, and me and i'm sure a lot of us would be happy it that would be removed, or tweaked(but mainly removed)\nThoughts?","replies":[{"poster":"Meddler","date":"2018-03-23T16:19:38.714+0000","up_votes":5,"down_votes":0,"body":"A few skills do have circle checks at the end after the line portion of the skillshots finished, usually when the missile itself has a really large appearance on completion (e.g. Nautilus Q). They're very much the exception though, apart from a few cases skill shots are line missiles from start to finish as per their spell indicators. Blitz Q does not have a circle check on its end, so if you're feeling that hits when it shouldn't then that's going to be due to either the width of the missile all the time and/or your champion's hitbox size/position.","replies":[{"poster":"TomiMan7","date":"2018-03-23T16:25:03.614+0000","up_votes":1,"down_votes":6,"body":"https://www.youtube.com/watch?v=xjEkgJO5nhE\n\nHmm I see :)\nIn this case is, adjusting the skillshots size/indicator to match the area where it hits, a posibility making it more clear wheter if its gonna hit or not?","replies":[{"poster":"Meddler","date":"2018-03-23T16:31:19.745+0000","up_votes":9,"down_votes":1,"body":"Biggest issue in that video you link is where Brand's hitbox is relative to his model. His hitbox is a circle around the location his feet are at. Given LoL's camera angle, and with that angle on his body as he runs, there's a difference between where you'd expect him to be and where he is in game terms though. Solves to those are pretty high cost (never let champions lean much, plus draw hitboxes on the ground at all times etc). Could just nerf the width of Blitz Q, I'd argue its reliability profile is about right however at present. Additionally if you go meaningfully narrower you'll also start getting cases of 'this should have hit' where the hitbox/camera angle skew in the other direction (already get some of that, but would see significantly more).","replies":[{"poster":"Naqel","date":"2018-03-23T18:30:49.230+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=A7LBtoKc,discussion-id=EEHXQ3kv,comment-id=0004000000000000,timestamp=2018-03-23T16:31:19.745+0000)\n>\n>draw hitboxes on the ground at all times\n\nI want this as an option at the very least.\nIt's something that would resolve a vast majority of frustration cases, and it really should be something for the player to decide.","replies":[]}]}]}]}]},{"poster":"iPooUnicorns","date":"2018-03-23T17:29:57.269+0000","up_votes":5,"down_votes":0,"body":"Any thoughts on the state of {{item:1402}}/ {{item:1414}} ?\n\nTo me, it feels kind of lackluster aside from the Echo proc, most notably the stats it gives. This might be part of the reason AP junglers that aren't {{champion:28}} {{champion:76}} feel like they're in a really bad spot.\n\nSeeing as how {{item:3285}}  was changed to give CDR instead of movement speed, maybe Runic Echoes could get the same treatment?","replies":[{"poster":"Banbutsu Sozo","date":"2018-03-23T18:53:33.974+0000","up_votes":3,"down_votes":0,"body":"My poor {{champion:60}} :'(\n\n{{item:3070}} {{champion:60}} {{item:3070}}","replies":[]}]},{"poster":"Erdamon","date":"2018-03-23T16:14:54.671+0000","up_votes":5,"down_votes":0,"body":"Hello, are there any other Rumble changes currently in testing to go alongside the Q buff? Or maybe we'll see a different iteration in the following days? While I do like the current direction that the buffs are taking I still think that they could be refined a bit better and I'd like to know what's your and the whole team's take on that","replies":[{"poster":"Meddler","date":"2018-03-23T16:43:33.237+0000","up_votes":5,"down_votes":0,"body":"Still testing the Q buff at present, other changes haven't been working out as well so far (W duration, E recast model, R slow changes etc). Nothing set in stone yet.","replies":[{"poster":"ProfNova","date":"2018-03-23T21:26:12.111+0000","up_votes":2,"down_votes":0,"body":"Have you considered giving rumble a HP buff as for a mele champ who is meant to be in the middle of a teamfight he is a little weak and not really bulky enough to last long enough to deal damage seeing as his 2 main damaging abilitys are damage over time, Most of the time I find i get bursted down to before I can do any decent amount of damage, I have felt that ever since the ryli hp nerf he has not been bulky enough. \n\nAs most ad champions that are mele have access to a lot of hp giving items that also give damage while rumble because of his heat bar is limited in the ap items he can get, for example he can not get rod of ages or abyssal mask because they both give mana, The new morello is nice with the fact that it gives hp but compared to something like black clever and frozen mallet which together give 1100hp while getting a lyandri, ryli and a proto belt will give 900hp so rumble is out tanked with 2 ad items compared to 3 ap items.\n\nThere is also the matter of cooldown reduction as rumble does not benefit from it that much and it is on almost every ap item now it kind of a useless stat for him it is nice being able to cast your ult more often but with his heat bar he is still limited 6 spells max before overheat assuming ult is cast and no cool down of his heat bar. Yes it helps you get to danger zone faster but once there you still have to wait for the bar to drop or overheat. Now im not sure as to how this would work but perhaps when he is in dangerzone with high cdr the bar will drop faster but only when in danger zone or increase the max heat when at max cdr by like 20 allowing 1 extra spell before overheat.","replies":[]}]}]},{"poster":"PowerOfDrainAge","date":"2018-03-23T16:25:27.500+0000","up_votes":7,"down_votes":2,"body":"Any thoughts on Ashe? i believe she could use some love.","replies":[{"poster":"Ariaflux","date":"2018-03-23T19:32:18.444+0000","up_votes":1,"down_votes":0,"body":"I hope so too. As one of the immobile ADC, I feel she doesn't excel in any aspect enough to make her satisfying to play. She is picked for her utility but it's not exactly comparable to the strengths of other immobile ADCs. Even among immobile ADCs, she's only of the 3 ADCs without any form of movement skill at all, along with Kog'Maw and Varus.\n\nI feel like she's one of the champions that Riot likes to keep low for some reason. Is there something inherently wrong in her kit that makes her a problematic champion when strong?","replies":[{"poster":"TomiMan7","date":"2018-03-23T20:07:46.204+0000","up_votes":1,"down_votes":0,"body":"> Is there something inherently wrong in her kit that makes her a problematic champion when strong?\n\nYeah, its called pro play. Ashe is somewhat like ryze/azir she is crap is soloq but strong in pro play.\nShe has 600 range what can be abused in pro play, not so much in soloq, has good poke with W catch potential with R, also with W thanks to the slow.","replies":[{"poster":"Ariaflux","date":"2018-03-23T20:28:14.672+0000","up_votes":3,"down_votes":0,"body":"No, that is not the case at all here. She's not Kalista, where she's very bad in Solo Q but has a strong presence in competitive. Just look at [this page](https://lol.gamepedia.com/Category:Tournament_Champion_Statistics_Pages) and look at all the 2018 Spring / Spring Promotion stats. Ashe does not appear at all in NA/LCK/LPL/LMS and very rarely in EU, while Kalista is played regularly in every single region.","replies":[]}]}]}]},{"poster":"Micbran","date":"2018-03-23T16:09:27.335+0000","up_votes":1,"down_votes":0,"body":"If it’s not so tentative that you have no idea what you’ll do midseason, what have you tested in terms of jungle power changes? And which ones do you think will make it in some form to the actual jungle changes? ","replies":[{"poster":"Meddler","date":"2018-03-23T16:15:00.741+0000","up_votes":3,"down_votes":0,"body":"Similar stuff to what we talked about a while back. Looking at having junglers be less healthy early on (more risk when ganking), somewhat slower leveling first clear or two (shouldn't be ahead of solos), item tweaks etc.","replies":[{"poster":"PrometheS","date":"2018-03-25T17:38:05.365+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=A7LBtoKc,discussion-id=EEHXQ3kv,comment-id=00010000,timestamp=2018-03-23T16:15:00.741+0000)\n>\n> Similar stuff to what we talked about a while back. Looking at having junglers be less healthy early on (more risk when ganking), somewhat slower leveling first clear or two (shouldn&#x27;t be ahead of solos), item tweaks etc.\n\nMundo's not really viable anymore as either a jungler or a top. He hasn't been good top in a long time because he has relatively poor teamfight scaling while also not being a dominant laner. A Maokai is just about as tanky but provides so much more to the team. Sion is another example but has a great engage. Mundo's not doing  enough more damage to really justify the pick over countless other tops. This meta is also more mobile than ever and so it's hard to function vs good players without a gap closer. I love Mundo's spammable Q and don't mind his kit but he needs more raw power to have it work.\n\nAs a jungler, Mundo was a decent pick last season because he could clear fast and get tanky enough to secure map control/objectives early on. Now, it feels like Kha, Jax, Lee etc. all have an easier time destroying him early. His clears are far less safe. It's harder for Mundo to get the gold lead he needs to be tanky enough to have influence. He no longer powerspikes mid game to the degree he needs to merit picking. He was never great early or late (at least vs competent teams) but last season I was nearly unkillable after Ninja Cinder Warmog's and SV. I had until 35-40 minutes to be very strong and generally got gold leads from counterjungling/farming faster. Maybe it's the Cinderhulk nerf and the new runes too but he feels so much weaker even late game.\n\nMy suggestion:\n+4 base armor early - his clear is less safe than ever before \n^^^a big part of what made him viable last season was taking scaling armor + Armor Quints and being relatively tanky early on too\n\nI'm guessing that this isn't quite enough (especially if Ninja Tabi's get nerfed and Cut Down gets buffed) but it's a start and probably brings him to the edge of viability. I was going to suggest buffing his base MS but honestly, I think that 5 more MS along with the clear buff of 4 base armor might make him too strong. I'd have suggested 2 MS but I just don't see you guys work with numbers like 347. ","replies":[]}]}]},{"poster":"nuletic","date":"2018-03-23T18:58:00.500+0000","up_votes":4,"down_votes":0,"body":"What you guys should understand is that the average SQ player doesn't have time to master dozens of champions. Thus, situational picks won't work out as well as comfort picks. That's why really niche champions will not be played much in SQ unless actually OP (or perhaps with a duo to abuse a particular combo/strategy). The roster of this game is already enormous and even just understanding who you're facing is daunting for new players. Generalist champions will always rule SQ because they allow the greatest leverage of champion mastery/time investment.\n\nAs far as balance, I would hope that all champions are balanced objectively based on the highest level of play in pro and SQ. That's true balance. Hand holding low tier players isn't sustainable and nor is it real balance. The problem with balancing for all levels is that 1. it's rarely the champion holding back someone in Silver anyway 2. not having true balance around optimal play will greatly narrow the viable champion pool in high ELO/competitive while also making it impractical for someone to stick to the same champions when climbing.\n\nBTW: These voice chat changes seem to have made duos a bit stronger. I hope the MMR adjustment is reflected. Although, I'm glad there isn't voice chat outside of parties. There are countless reasons for this but mainly, I think it would force others to use it in order to remain competitive. People would certainly use pings less if it existed. Muting others' voice would just cut you off much more from team information. It would also be a larger barrier to entry for people who don't speak English well.","replies":[]},{"poster":"Chazual Fridays","date":"2018-03-23T16:23:11.948+0000","up_votes":4,"down_votes":3,"body":"Hey, Meddler! Been a lurker for a while and just wanted to say I super appreciate these Quick Gameplay Thoughts.\n\nI understand with regard to your point about Azir/Kalista/Ryze that the idea is to leave these champs as is in their weak-in-regular-play/strong-in-pro-play states to allocate resources toward other champions?\n\nAlso, how do you decide which champs to give some love to? Ahri in particular struck me as an odd (but not unwelcome) choice.\n\nCheers and thanks,\n-Chaz","replies":[{"poster":"Meddler","date":"2018-03-23T16:40:48.559+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Chazual Fridays,realm=NA,application-id=A7LBtoKc,discussion-id=EEHXQ3kv,comment-id=0010,timestamp=2018-03-23T16:23:11.948+0000)\n>\n> Hey, Meddler! Been a lurker for a while and just wanted to say I super appreciate these Quick Gameplay Thoughts.\n> \n> I understand with regard to your point about Azir/Kalista/Ryze that the idea is to leave these champs as is in their weak-in-regular-play/strong-in-pro-play states to allocate resources toward other champions?\n> \n> Also, how do you decide which champs to give some love to? Ahri in particular struck me as an odd (but not unwelcome) choice.\n> \n> Cheers and thanks,\n> -Chaz\n\nThat's our thinking on Azir/Kilsta/Ryze yeah.\n\nWhich champs we do work on depends on things like:\n\n* Their current balance state in a range of contexts (different MMRs, regions, solo queue versus organized play etc)\n* Whether we believe there's good opportunity to make frustrating kits less frustrating, unsatisfying kits more satisfying, degenerate kits that lead to non interactive play or exclude other champs from the meta better etc.\n* How much time we've currently got available and the amount of time needed to work on a champion meaningfully\n* Whether a champion has an upcoming VGU soonish (with a year generally) or not\n* Whether someone's got a particular strong idea for improving a champ\n* Etc\n\nAhri was chosen for work because, while she's not underperforming, her range of performance tends to be pretty flat. When she's doing well she struggles to capitalize enough on that lead, so the Ahri player's not as rewarded as they should be. When she's not doing well she's still pretty safe and not paying enough price, so people playing against her aren't rewarded/satisfied enough. That leads to less engaging/interesting games which is something we want to address, particularly on a pretty popular champion who's therefore having that flattening effect on a significant proportion of games played.","replies":[{"poster":"Adalvar","date":"2018-03-23T17:41:52.706+0000","up_votes":4,"down_votes":0,"body":"Kalista is quickly becoming an example of a \"degenerate kit\"...she's filled with counter intuitive and frustrating mechanics. Her W gives her bonus AD, but her passive under cuts it due to her only dealing 90% AD damage on basics. Her infinite dashing mechanics are almost impossible to deal with and her ult is way too strong in not only organized play, but across the board. She need a kit clean up and needs to be stream-lined across the board. \n\nI think the playerbase at large would benefit from having you guys devote some time and resources on Kalista to make her kit work and feel better.","replies":[{"poster":"Keevalroy","date":"2018-03-23T18:01:47.774+0000","up_votes":3,"down_votes":0,"body":"I would argue something more intensive than a clean-up is in order. I'd advocate for a full from-the-ground-up rebuild of the entire kit since the current one simply isn't salvageable in any fashion.  If you try to be careful with it, you run the risk of putting out a fire by lighting a bigger one next to it. A full rebuild also allows for her theme to make sense; a malevolent spirit of vengeance should feel like one instead of a kangaroo on crack.","replies":[]}]}]}]},{"poster":"DeathBurst","date":"2018-03-23T17:02:13.206+0000","up_votes":4,"down_votes":0,"body":"Re: potential nerfs to Doran Ring.\n\nHave you considered the side effect on AP Tanks that sometimes take Doran Ring Top? Thinking of Cho, Mao, Naut, etc.","replies":[]},{"poster":"Lesba Zyra","date":"2018-03-23T23:57:41.878+0000","up_votes":5,"down_votes":1,"body":"@Meddler\nHow about to fix Zyra already? Did you notice that her mid/late game died quickly? And you know what's a problem? Your new 'USEFULL' (kappa) liandry. I know it sounds a little bit rude, but the new liandry is trash tier for Zyra's build now. The old liandry was perfect for Zyra, because of its early magic pene to keep early dmg and for midgame/late there was a dot for poke. Yes. The new mask has 50% less dps as a poke machine. It's usefull only for dot users and Zyra has NO dots at all. Oh yeah, we've got plants. The plants that are one-shotted by everything. \n\nAlso you've said that you wanna keep her also as a midlane champ. So why don't you buff her over that way? just buffing her midlane style? is that so hard to give her scale over creeps? I know she's got extra seeds. That is not enough, since plants are useless in mid/late game. \n\nAnd I am not even joking. I had 100 lp master and more. 62% winrate. Anyway once your patch of the liandry came out, my winrate immediately dropped down and I've been stuck in D3 now. I can't build the liandry anymore. Yeah. I've been trying thousands of builds, like nashoor, wit's end Zyra .etc Everything feels so useless vs HP targets and mobility and you know. Almost against everything.\n\nbtw. I play only MID Zyra from Season 3 till now. And I've never submitted to play supp Zyra, since I think that's heresy. And you, riot company, promised to keep her 2nd role as a mage, as a midlaner. Even her release was about midlane and you know that.","replies":[]},{"poster":"FoxMulder7","date":"2018-03-24T00:35:15.682+0000","up_votes":3,"down_votes":0,"body":"Are you guys planning on buffing or changing something with Syndra? She's so bad right now, 47% win rate and all the pros stopped playing her almost entirely.","replies":[]},{"poster":"DeadlyyKiss","date":"2018-03-23T16:59:07.901+0000","up_votes":3,"down_votes":0,"body":"Hi Meddler, with all the recent changes on the pbe, we all feel that assassins will get definitely weaker, especially Kat' who's gonna get really affected by the nerf of sudden impact and the new locket. First of all, I wanted to know the context behind these changes and if you guys are going to plan anything for certain assassins if these changes hit them too hard ?","replies":[]},{"poster":"ClonieMor","date":"2018-03-23T16:21:21.324+0000","up_votes":2,"down_votes":0,"body":"Hey, Meddler!\n\nAny thoughts about improving Lethal Tempo? \n\nWhat about its effect be continuously active while in combat (after the 1.5s timer, with or without the AS cap), and then enter in CD when you are out of combat? Any other possible ideas?","replies":[{"poster":"Meddler","date":"2018-03-23T16:45:41.144+0000","up_votes":3,"down_votes":0,"body":"It needs work (very narrow set of champs who should ever use it in particular). We've been testing a Keystone that also gives Attack Speed that we thought might make for a good replacement (tentative ship date: midseason). We've come to the conclusion though that it's better off as a separate thing, rather than as something to fill the LT niche, so will need to reasses LT again.","replies":[]}]},{"poster":"Jenks3","date":"2018-03-23T16:31:33.177+0000","up_votes":3,"down_votes":0,"body":"@Meddler\n\nGood morning Meddler!\n\nAny thoughts on how you think the Lee Sin {{champion:64}}  buffs will land? The Reddit and general forum talk I hear is that they will help, but he has lost a lot of utility over the years due to his mobility with wards, so it's difficult to go back to the older, season 1 and 2 style due to the missing utility. \n\nA lot of folks are asking for some kind of \"Stick\" item that will give him some hopping ability without granting vision. Is that something you might look at?\n\nThanks again!","replies":[]},{"poster":"wobaji","date":"2018-03-25T19:43:55.079+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=A7LBtoKc,discussion-id=EEHXQ3kv,comment-id=,timestamp=2018-03-23T16:04:50.858+0000)\n>\n\n> ----------------------------------------------------------------------------  \n> **Balancing some champs for organized teams**\n>  \n> We&amp;#039;ve had long running difficulties with some champs who perform dramatically better for organized teams (pro teams, premade 5s, Clash soon etc) than they do for matchmade solo queue teams. Azir, Kalista and Ryze are the strongest example of that, where their performance for the average player trying them will often look pretty weak if they&amp;#039;re in a balanced state for organized teams. One of our goals with champion balance is to ensure they&amp;#039;re good choices in a wide range of contexts, so that&amp;#039;s not ideal. At the same time \n>  \n> http://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png\n\nHave you guys considered reverting the Corki AD nerf? He's really not performing well and in fact his late game - the reason he's picked - is sub 48% winrate.","replies":[]},{"poster":"aQuixoticKiller","date":"2018-03-24T02:31:39.807+0000","up_votes":2,"down_votes":0,"body":"What about kassadin getting a little bit of compensation from the minon aggro change? Ahri who is and has been doing far better than him is getting mad love, a host of ad champs got love for duskblade nerfs, and still nothing. You guys even passed him over for a other champs for skins on release of his daughter and no audio rework to acknowledge her at all. When I kassadin gonna get anything?","replies":[]}]}