{"poster":"Meddler","date":"2016-04-19T18:39:33.833+0000","title":"Elemental Dragons: What we're doing and why","subforum":"Gameplay","up_votes":124,"down_votes":21,"body":"Hey folks,\n\nOur mid season initial rundown&rsquo;s just gone out ( http://na.leagueoflegends.com/en/featured/mid-season-magic ) and the changes should start hitting the PBE in the next couple of days. One thing we wanted to talk about in more detail was the elemental dragons. One of the skills we believe is important to LoL is responding to varied situations (e.g. enemy team comp, unexpected jungler appearances etc). Our intent is to use different dragon buffs, and to a lesser extent, dragon encounters, to also create situations each team can adapt to and take advantage of. If that&rsquo;s not happening, in particular if it feels like which dragons spawn is too decisive by itself, then we&rsquo;ll look to fix that.\n\n\n**What are elemental dragons?**\n\nInstead of the current 5-buff dragon system, we&rsquo;re changing it to 4 different types of elemental dragons, each of which gives a different buff. The types and order of elemental dragon spawn are randomized (with some restrictions) and it&rsquo;s possible to get multiple stacks of one element (e.g. 2 air dragon kills gives more movement speed than 1 air dragon kill). After 35 minutes, the dragons are replaced by an elder dragon, who gives a consistent buff of his own and amplifies existing buffs when killed.\n\n\n**Why change dragon?**\n\nWe had multiple goals when updating dragon.\n\n* Increase the average value of dragon so it&#039;s more appealing to contest it (drives early conflict in particular) without making it a must do as soon as possible every game. \n* Introduce more game-to-game variation. We want to create different situations to respond to, with the feeling that games are more meaningfully different from each other. There should be different strategic situations to understand and respond to and handling that well is we believe a core skill in LoL. \n* Create additional opportunities to play around dragon as an objective in interesting ways. \n\n\n**Why different buffs/dragons?**\n\nDifferent buffs giving different types of power should lead to teams making somewhat different decisions on a game-to-game basis, depending on which dragons they want, which they get, what their opponents have, etc. With a single line of buffs as a reward (or gold), we&rsquo;re seeing that game states can become very linear, with both teams generally vying for the same objectives again and again. Having a more diverse set of buffs means teams can also mix up their approach to each game. \n\nAir supports split push/rotation play or gives defense against it, water supports poking and gives defense against it, fire adds direct combat power, earth enables easier objective taking. A game where your team has two air buffs and the enemy has two fire buffs, for example, should sometimes feel noticeably different.\n\nThe dragon encounter itself being slightly different per dragon should sometimes create situations where you approach the fight differently, in particular when it is, or could be, a contested dragon. The water dragon, for example, has attacks that slow movement speed, making it harder to disengage from a dragon attempt, while the earth dragon&rsquo;s tougher than the others, so will be a longer fight.\n\n\n**Potential issues**\n\nWhile developing these changes there were some other issues we worked to avoid/will continue to avoid or fix in future development.\n\nThe first of those was that we didn&rsquo;t want randomness (which dragons spawn and in which order) to feel like it was deciding the outcome of the game. What we&rsquo;re after is game-to-game variation, but how you respond to that variation must be what decides the outcome of the game. In order to maintain, that we looked a number of things, in particular:\n\n* The buffs are designed to be appealing to both teams, even if the two are running really different comps. Water, for example, gives poke comps mana to poke harder, or their opponents health regen to resist poke. The exact value of a buff will vary team to team, like blue buff or baron, but it should never feel like dragons spawn are extremely appealing to one team and not worth taking for the other. The Elder Dragon buff also offers universally valued power, both from itself and prior buffs collected, regardless of element. \n* Differences in the dragon fight don&#039;t fundamentally change your ability to do the fight in the first place. You won&#039;t end up unable to do dragon because you didn&#039;t pick the right type of jungler in champ select, for example. Instead, the different dragon combat patterns may influence how you tactically approach a fight, mainly in cases of a contested dragon. \n\nWe also wanted to ensure that the dragon system felt fairly intuitive and strongly wanted to avoid it getting highly complex. To do that we looked at a couple of things.\n\n* Elemental theming of the buffs and the dragons themselves should feel natural (e.g. fire dragon increases damage, air dragon gives speed and itself moves faster, etc).\n* Many of the dragon effects are carried directly over from the previous dragon buffs, which should help with quickly picking up the changes (e.g. %AP/AD, damage to structures, true damage DoT, late game dragon buffing the power of previously acquired stacks, etc)\n\nFinally we also wanted to make the power dragon offers a bit more appreciable.\n\n* Power&rsquo;s therefore shown in more visible ways (e.g. true damage against towers/epic monsters from earth to make it easier to track damage added, versus the prior % amp that got rolled in with all other damage).\n* The way the stacking model results in bonuses sometimes being doubled or tripled down on also concentrates power, making it much more noticeable in some games at least.\n\n\nHopefully this gives some useful context on what we&rsquo;re trying to do and while. If you&rsquo;d like to discuss further please do throw questions in here, would love to talk about this stuff whenever time permits, particularly during the next couple of days as stuff hits the PBE.","replies":[{"poster":"Malicious Metal","date":"2016-04-19T18:46:04.257+0000","up_votes":125,"down_votes":5,"body":"Will Mordekaiser be able to enslave every single Dragon?","replies":[{"poster":"Meddler","date":"2016-04-19T19:44:23.540+0000","up_votes":84,"down_votes":2,"body":"At present Morde gets regular dragons from the standard elemental ones and a bigger dragon with more health for killing the Elder. Looking into variant dragons based off the element killed is on our list of things to look into as possible mid season followup, it won't be in for ship though.","replies":[{"poster":"Malicious Metal","date":"2016-04-19T19:47:56.765+0000","up_votes":57,"down_votes":0,"body":"No Rush, it's no priority but the simple fact that you're considering making Morde get different dragons is awesome itself^^","replies":[{"poster":"Elikain","date":"2016-04-20T01:02:32.336+0000","up_votes":27,"down_votes":1,"body":"Imagine Dragons :^)","replies":[]},{"poster":"RyanTheRat","date":"2016-04-20T00:53:32.640+0000","up_votes":9,"down_votes":1,"body":"If you enslave one dragon, do the others dragoff?","replies":[]}]}]},{"poster":"Big Lincoln","date":"2016-04-19T18:54:22.217+0000","up_votes":34,"down_votes":0,"body":"I'm very curious if they thought about giving him different buffs for which one he nabs\n\nBeing able to move faster with a wind dragon sounds very appealing...","replies":[{"poster":"Malicious Metal","date":"2016-04-19T19:02:48.184+0000","up_votes":27,"down_votes":1,"body":"By the look of it the Elder dragon will be a lot more powerful than the other dragons, meaning that it might just make Morde unstoppable if he snatches one late game.\n\nNot to mention increased Jungling XP....\n\nDamn, my Morde Jungle became so much better!","replies":[{"poster":"Big Lincoln","date":"2016-04-19T19:05:16.862+0000","up_votes":2,"down_votes":0,"body":"Yeah, I just started playing him again after swearing him off post-rework\n\nI can't resist the pull of the Metal :<\n\nAll we need to make his jungle game OP is to give us the W AoE while we're alone.","replies":[{"poster":"kDrakari","date":"2016-04-19T19:11:01.585+0000","up_votes":1,"down_votes":0,"body":"Just take the dragon, then you can put your W on it!\n\nUnless I'm wrong.","replies":[{"poster":"Pierce The Veal","date":"2016-04-19T19:18:06.938+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=kDrakari,realm=NA,application-id=3ErqAdtq,discussion-id=a9gcgfzV,comment-id=00050001000000000001,timestamp=2016-04-19T19:11:01.585+0000)\n>\n> Just take the dragon, then you can put your W on it!\n> \n> Unless I&#x27;m wrong.\n\nPut a point into ult at level 1.\n\nGet dragon. Mwahahahahahaha easy jungling.","replies":[]}]}]},{"poster":"TonyTonyMordecai","date":"2016-04-19T19:38:35.767+0000","up_votes":3,"down_votes":0,"body":"I've heard of people doing it, but now I want to try it.\nWhat do you even build and what order?","replies":[{"poster":"Malicious Metal","date":"2016-04-19T19:46:33.018+0000","up_votes":6,"down_votes":0,"body":"I just get a machete and rush a {{item:3116}} getting a {{item:3706}} early on for the slow.\nFrom there I usually get myself an early {{item:3053}} and eventually build out my {{item:1401}} \nMy last two Items are usually {{item:3742}} and one damage item, usually either {{item:3146}} or {{item:3078}} for the glorious 370 damage sheen procs-","replies":[]}]}]}]},{"poster":"MrBuffington","date":"2016-04-19T19:13:49.277+0000","up_votes":4,"down_votes":0,"body":"Gotta Catch 'Em All","replies":[{"poster":"Malicious Metal","date":"2016-04-19T19:16:50.921+0000","up_votes":30,"down_votes":0,"body":"http://i.imgur.com/GS9822Z.jpg","replies":[]}]},{"poster":"Chaotic Reks","date":"2016-04-19T19:33:45.095+0000","up_votes":10,"down_votes":0,"body":"being able to control every elemental dragon, would that make morde the Avatar?","replies":[]}]},{"poster":"Mag1c","date":"2016-04-19T19:01:42.003+0000","up_votes":24,"down_votes":19,"body":"Please don't introduce randomness into the game in such a significant way. I'm not on board with that: it takes the game farther away from being a controlled, fair environment.","replies":[{"poster":"kile147","date":"2016-04-19T19:26:41.049+0000","up_votes":34,"down_votes":2,"body":"The goal is to introduce tactical decision making more than randomness. Right now you can create a pretty clear order of importance that makes it so that the only tactical decision you need to make is \"are we strong enough to fight/contest this\". The hope with this change is to make it so that you not only have to think about if it's feasible but if it's worth it as well.\n\nOne of the skills that they want to encourage in the game is tactical adaptability, which they are partially inplementing through high level RNG, like the dragons or bard chimes.","replies":[{"poster":"CrazyHollow","date":"2016-04-19T20:20:14.277+0000","up_votes":11,"down_votes":9,"body":"I think this RNG dragon will actually do the opposite. Basically you have to look at the risk vs reward of dragons. In the current meta teams can sack one or two dragons in order to get safe lane for scaling champs and trade turrets. With the introduction to a RNG dragon buff lane swaps will become far more risky. If the enemy team get two of the same dragon you can completely get fucked based on what type they are. This means lane swaps will become far to risky to do so people will draft purely for the lane phase. This means less champion diversity and less strategic diversity as you will be forced to draft comps that can contest early dragons or risk getting snowballed by two early elemental dragons.\n\nTLDR: RNG Dragon = standard lanes are required = less champion diversity = less strategic diveristy","replies":[{"poster":"KatarinaAndFeed","date":"2016-04-19T22:00:13.516+0000","up_votes":16,"down_votes":1,"body":"Ummm.. In solo queue lane swaps were never a thing so there is no problem there as for competetive (LCS) I thought people hated the 3v0 push farm till 25 mins meta if what you are saying is true competetive league will be interesting and full with teamfights again.","replies":[]}]}]}]},{"poster":"biggestbutterX","date":"2016-04-19T19:12:30.669+0000","up_votes":1,"down_votes":0,"body":"I wanna know if the dragon buffs will stack, like they did before, or will one buff replace another?","replies":[{"poster":"Meddler","date":"2016-04-19T19:59:53.140+0000","up_votes":10,"down_votes":1,"body":"Stacking. So you could have one fire, one water and one earth buff. Or two fire. Or three air. \n\nIn any given game only three of the elemental types will ever spawn as well, both to create more cases of multiple stacks of a buff and to give some degree of predictability to the system (once you've seen three types you know the fourth isn't coming).","replies":[{"poster":"steinberg","date":"2016-04-19T20:12:20.229+0000","up_votes":30,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=a9gcgfzV,comment-id=000c0000,timestamp=2016-04-19T19:59:53.140+0000)\n>\n> Stacking. So you could have one fire, one water and one earth buff. Or two fire. Or three air. \n> \n> In any given game only three of the elemental types will ever spawn as well, both to create more cases of multiple stacks of a buff and to give some degree of predictability to the system (once you&#x27;ve seen three types you know the fourth isn&#x27;t coming).\n\nbut how will I master all 4 elements and defeat the fire lord and save the world then?","replies":[]},{"poster":"AMYS GRAVE","date":"2016-04-19T20:49:24.872+0000","up_votes":2,"down_votes":0,"body":"will the elemental dragon despawn at 34:45 like rift herald? will it remain on the field longer if it is currently being attempted?","replies":[{"poster":"Meddler","date":"2016-04-20T00:17:06.159+0000","up_votes":10,"down_votes":1,"body":"Elder Dragon won't replace an existing elemental dragon. It'll instead be the next thing to spawn once a dragon's been killed after 35 minutes. Expectation isn't that Elder Dragon will be an every game thing, in the same way that Dragon 5 isn't an every game thing at present. If it's too rare though we'll look at pulling that spawn time forwards a bit.","replies":[]}]}]}]},{"poster":"Linna Excel","date":"2016-04-19T18:50:04.273+0000","up_votes":26,"down_votes":0,"body":"Shyvana now needs 4 elemental forms and an elder form.","replies":[{"poster":"kDrakari","date":"2016-04-19T19:11:28.034+0000","up_votes":15,"down_votes":0,"body":"Are you sure you want Old Lady Shyvana?","replies":[{"poster":"Sakukei","date":"2016-04-19T20:36:45.324+0000","up_votes":12,"down_votes":1,"body":"well shyvana is like a teen so elder shyvana could be a hot milf.","replies":[]}]},{"poster":"KayleCT","date":"2016-04-19T19:20:13.753+0000","up_votes":7,"down_votes":0,"body":"ultimate skin for shyvana confirmed","replies":[]}]},{"poster":"The Yetii Rider","date":"2016-04-19T19:05:19.561+0000","up_votes":1,"down_votes":3,"body":"So is this being accompanied by a Nunu/Skarner/Trundle nerf? Changes to objectives always impact champions that are very strong at taking those objectives.","replies":[{"poster":"Meddler","date":"2016-04-19T20:00:48.153+0000","up_votes":18,"down_votes":1,"body":"We don't currently have any plans to nerf objective controlling champions. Objective control should be something that's really appealing as a core champion strength and I'd argue at present that Nunu especially, and Skarner to a lesser degree, feel underappreciated, given the low value of dragon compared to its historical state. ","replies":[{"poster":"Retillin","date":"2016-04-19T20:59:17.203+0000","up_votes":20,"down_votes":0,"body":"Is there any thought on reducing Kalista's ability to prevent contestation on objectives then?","replies":[]}]}]},{"poster":"Coranar","date":"2016-04-19T19:20:46.959+0000","up_votes":12,"down_votes":1,"body":"@Meddler,\nWhat would your opinion if the randomized  order of dragons was revealed during champion select? This would allow teams to adapt in champ select and need to have numerous different strategies at hand. Would also eliminate the complaints saying pure RNG dictated an entire game.","replies":[{"poster":"Meddler","date":"2016-04-19T19:47:39.675+0000","up_votes":22,"down_votes":2,"body":"We talked about whether the spawn order should be revealed earlier or not. Our conclusion was that we wanted the strategic adaptation that only partially telegraphed dragon types create. As above we're looking to avoid issues with RNG deciding games by making the buffs relevant regardless of team comp, telegraphing them as soon as the previous dragon is killed and giving a consistent reward (true damage burn from Elder) that's useful to everyone regardless of which stacks you've previously got.","replies":[{"poster":"Sir Nope","date":"2016-04-19T21:02:17.946+0000","up_votes":8,"down_votes":0,"body":"I see both your points, but I suggest a middle ground; reveal the FIRST Dargon to spawn at the champ select for a few weeks, as an experiment. See what players do when they can see whetehr first Dargon is Soargon, Tidegon, Chargon or Terragon. After a few weeks, revert it to its original release and compare the results.","replies":[{"poster":"Meddler","date":"2016-04-20T00:11:34.182+0000","up_votes":13,"down_votes":1,"body":"Hmm, telegraphing first dragon only's an interesting approach that might have some merit. Will put that on the list of responses to look into if it feels like early randomness is deciding too much (versus creating interesting situations where your play is what decides the outcome). ","replies":[]}]}]}]},{"poster":"darkdill","date":"2016-04-19T19:09:05.985+0000","up_votes":12,"down_votes":3,"body":"What happens when you get RNG-screwed by the Dragon spawns?\n\nFor instance, you have a composition that can't siege, but the majority of dragons are Water Dragons. What happens then? Are you punished by the game saying \"you should've picked a better composition\"?\n\nOr what if you ARE a dedicated siege comp, but no Water Dragons spawn? Punished again by the game?\n\nRemember, RNG-screwing and randomness go hand-in-hand.","replies":[{"poster":"Linna Excel","date":"2016-04-19T19:11:11.897+0000","up_votes":15,"down_votes":0,"body":"Wouldn't a non-siege team still benefit from mana and health regen?  Also, if the other team is a siege comp, that would give you incentive to deny them the buffs.","replies":[{"poster":"darkdill","date":"2016-04-19T19:16:28.004+0000","up_votes":1,"down_votes":3,"body":"I'm just saying that getting RNG-screwed is a possibility from this new dragon system. Not super-likely, but certainly possible if your team is depending on that Water Dragon buff.","replies":[{"poster":"Gixia","date":"2016-04-19T20:02:54.101+0000","up_votes":7,"down_votes":0,"body":"They specifically said that the buffs for certain team comps (like siege, split-pushing, etc.) also function as defense against those comps. If a water dragon spawns and you're not running a siege comp but the opponent is, you pick up the buff and it acts as defense against them, or they pick it up and it acts as offense against you. Either way, both teams get value from it, just in different ways. The exception of course is if NEITHER team is running a siege comp and water dragon spawns. Then neither of you really get much value from it, but that's alright because both teams still equally get nothing from it so no team is screwed more than the other one is.","replies":[]}]}]},{"poster":"Riot Axes","date":"2016-04-19T22:49:06.523+0000","up_votes":10,"down_votes":1,"body":"> [{quoted}](name=Yousosmart,realm=NA,application-id=3ErqAdtq,discussion-id=a9gcgfzV,comment-id=000b,timestamp=2016-04-19T19:09:05.985+0000)\n>\n> What happens when you get RNG-screwed by the Dragon spawns?\n> \n> For instance, you have a composition that can&#x27;t siege, but the majority of dragons are Water Dragons. What happens then? Are you punished by the game saying &quot;you should&#x27;ve picked a better composition&quot;?\n> \n> Or what if you ARE a dedicated siege comp, but no Water Dragons spawn? Punished again by the game?\n> \n> Remember, RNG-screwing and randomness go hand-in-hand.\n\nLet's say you're not playing a siege/poke comp, and a bunch of Water Dragons spawn.\n\nIf your opponents are also not playing siege/poke (or other strategies that would amplify the value of Water Dragon), then the value of Water Dragon in that game is reduced - but it's not unfair, it's just a less valuable objective than usual. \n\nIf your opponents are playing siege/poke, then the value is amplified - but the Water buff is good both for a poke comp and for their opponents. Again, if the mana/health regen are correctly balanced, it's not an unfair objective, it's just more valuable than Dragon usually is.","replies":[]}]},{"poster":"2Behold","date":"2016-04-19T19:38:03.853+0000","up_votes":4,"down_votes":1,"body":"I thought the whole goal of Rift Herald was to take attention away from bot lane. I feel these dragons will directly sabotage that goal.","replies":[{"poster":"Meddler","date":"2016-04-19T20:47:50.037+0000","up_votes":13,"down_votes":1,"body":"We want Rift Herald to give top laners something to interact with that, if they choose to contest it, shakes up the laning phase at some point. It's also intended to reward a bit more jungler presence top lane. We don't want it to push dragon to a low relevance state though. To try and achieve both of those goals we'll be shifting Rift Herald to a delayed spawn, never respawns, powerful long term buff model.","replies":[{"poster":"Retillin","date":"2016-04-19T22:29:04.747+0000","up_votes":5,"down_votes":0,"body":"Isn't a 20 min buff just excessive though?","replies":[]}]},{"poster":"Zenthon Prime","date":"2016-04-19T21:17:41.255+0000","up_votes":5,"down_votes":0,"body":"Probably a good thing, because right now teams can just trade dragon/herald, which is a contributor to the horrible early-game meta in competitive play right now.  Making one obviously more powerful and making botlane 2v2s more desirable is the right way to go IMO.","replies":[]}]},{"poster":"Hellioning","date":"2016-04-19T19:08:56.173+0000","up_votes":14,"down_votes":3,"body":"I can't wait to play a mana hungry mage and get nothing but earth and air dragons. That's gonna be fun.\n\nAre you sure that RNG is the best way to do this?","replies":[{"poster":"DoubleTongue","date":"2016-04-19T19:29:43.789+0000","up_votes":3,"down_votes":2,"body":"You should also check the mage item changes going through at the same time...","replies":[{"poster":"Hellioning","date":"2016-04-19T19:33:11.467+0000","up_votes":13,"down_votes":2,"body":"Yes, and they seem to be making mana regen worse. So that's fun.","replies":[]}]}]},{"poster":"Hige","date":"2016-04-19T18:40:59.732+0000","up_votes":2,"down_votes":1,"body":"link isn't working tho D:\n\nedit: just realized this was posted a minute ago :x","replies":[{"poster":"Meddler","date":"2016-04-19T18:44:04.481+0000","up_votes":10,"down_votes":1,"body":"Whoops, had a rogue bracket included in the URL. Thanks!","replies":[]}]},{"poster":"SomethingUnknown","date":"2016-04-19T19:13:45.914+0000","up_votes":7,"down_votes":3,"body":"Please no, randomness can decide if the game is a win or a loss, I get screwed by crit enough as it is.","replies":[]}]}