{"poster":"Meddler","date":"2018-07-13T15:44:31.928+0000","title":"Quick Gameplay Thoughts: July 13","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hi folks,\r\n-------------------------------------------------------------------------------\r\n**Usual Disclaimers**\r\n\r\nThese posts will often contain talk about future work we&#039;re doing, or planning to do, that isn&#039;t yet guaranteed to ship. The nature of the work could change or, depending on what we discover, projects mentioned may get put delayed or even stopped. If you&#039;d like to see a Tweet whenever a new one of these posts goes up: https://twitter.com/RiotMeddler\r\n----------------------------------------------------------------------------  \r\n** Gold Funneling Questions**\r\n\r\n\r\nWhen talking about our changes to address gold funneling earlier in the week I saw quite a few questions that that post didn&#039;t cover cropping up. Figured it would be good to cover them today as a result. Apologies for those of you who&#039;ve read some of this before, likely to be a fair bit of repetition, would rather err on the side of talking too much than too little on this though.\r\n\r\n\r\n\r\n* Why nerf funneling, what&#039;s wrong with another strategy being used?\r\n\r\nWe&#039;re hitting funneling because of what it does to both early game interaction and power curves. It certainly creates some interesting variety of team comps and strategy. It does so by turning mid lane into a low interaction position though, instead of a really active one and by pushing a lot more gold onto champs than they&#039;ve been balanced around. In some cases that holds up fine, in others it removes too much counterplay from playing against them.\r\n\r\n* Why is funneling fine in bot lane then, but not when it&#039;s mid/jungle?\r\n\r\nWhile in both cases there are two champs on one team, with one of them taking all the farm, things are noticeably different. In bot it&#039;s one champ getting all of one gold stream, rather than pushing two gold streams onto a single champ. Additionally bot lane still has a lot of interaction going on, with both sides trading/harassing and at least one side generally looking for kill opportunities. \r\n\r\n* What about Twisted Treeline, funneling has been going on there for a long time\r\n\r\nIt has, and that means changing it&#039;s a pretty substantial upheaval, given it&#039;s so core to how TT&#039;s been played for quite a while. At least in the short term we&#039;ll be keeping these changes that nerf gold funneling on SR only. \r\n\r\n* Why not nerf support gold instead since they&#039;re the problem?\r\n\r\nWe&#039;re seeing funneling create mid laners (or mid funneled junglers) with 50% more gold than the enemy mid at the 15 minute mark. Even if we reduced the amount of gold supports were getting substantially (e.g. 500 less by 15:00) that doesn&#039;t address the core issue here that&#039;s making funneling powerful. That&#039;s not to say supports necessarily are or aren&#039;t in the appropriate place power wise in general, but that for this particular problem we don&#039;t think they&#039;re the primary cause.\r\n\r\n\r\n----------------------------------------------------------------------------   \r\n**Some 8.15 changes**\r\n\r\nSome of the things we&#039;ll be looking at in 8.15 below. As usual some more stuff will be added as we work on the patch and some things will get dropped, either because they&#039;re not ready or because we conclude they weren&#039;t the right direction in the first place.\r\n\r\n* Annie buff - We&#039;re pulling Annie buffs out of 8.14 to take some more time on them for 8.15. First thing we&#039;ll be testing is giving Annie back at least some of the extra AA range she used to have.\r\n* Liandry&#039;s buff - Similarly the Liandry&#039;s buff has also moved to 8.15. Will likely still be exploring ways to make it a better choice for many champs without having to pair it with Rylai&#039;s, while still keeping some degree of CC synergy. Details TBD&gt;\r\n* Gold Funneling and TP nerf followups - Expecting there&#039;ll be some polish needed, putting time aside to do a lot of monitoring of how those changes land at the least.\r\n* Playoffs Balance - Some regions will be playing their Summer Split playoffs on 8.15. We&#039;ll be keeping change pretty low as a result overall, with potentially a targeted nerf or two to really pro problematic champs if needs be (Play off patches are one of the times we prioritize looking at pro balance more than usual). \r\n----------------------------------------------------------------------------   \r\n**Working to update LoL&rsquo;s tooltips**\r\n\r\nFor anyone that missed it yesterday we&rsquo;ve got a gradual project underway to update LoL&rsquo;s tooltips. More details at the link below, this is something where we&rsquo;ll be trying various different approaches in upcoming patches and gathering feedback over time before settling on a final version.  https://boards.na.leagueoflegends.com/en/c/developer-corner/yIBUoyaP-tooltips-update\r\n\r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png","replies":[{"poster":"RenanRein","date":"2018-07-13T16:03:16.420+0000","up_votes":11,"down_votes":9,"body":"What about Irelia Meddler? Her top lane experience isn't enjoyable anymore. Have to stay safe and farm it's not a fun way to play, especially on top lane.","replies":[{"poster":"Meddler","date":"2018-07-13T16:05:40.230+0000","up_votes":13,"down_votes":2,"body":"Likely we have some Irelia buffs, aimed at helping out top in particular, in 8.15. Lot of debate this week over exactly how to do so and how much power we should be adding.","replies":[]}]},{"poster":"Spideraxe","date":"2018-07-13T16:10:32.828+0000","up_votes":5,"down_votes":2,"body":"Hey Meddler will Lissandra skins be getting new particles with her passive","replies":[{"poster":"Meddler","date":"2018-07-13T16:50:10.793+0000","up_votes":9,"down_votes":0,"body":"Yeah, I expect we'll do different versions of the passive visual effects for each skin. Can't just use the standard ice look for the others, would clash horribly.","replies":[]},{"poster":"JonnyBoyy","date":"2018-07-13T16:23:59.386+0000","up_votes":1,"down_votes":4,"body":"I also hope that her classic splash gets a new splash to cope up to the new riot standards","replies":[{"poster":"Frozen Diva","date":"2018-07-13T17:46:48.606+0000","up_votes":6,"down_votes":0,"body":"The classic splash art looks very good and accurate imo.\nThe Bloodstone splash art looks bad (or old) but that's another topic.","replies":[]}]}]},{"poster":"Seviel Vorose","date":"2018-07-13T16:01:48.361+0000","up_votes":9,"down_votes":1,"body":"Hi Meddler. Many of you mentioned potential Syndra buffs, since she's one of the worst performing mid laners, but since then everything has been silent. Can we get any insight? We Syndra mains would really love some informations.","replies":[{"poster":"Meddler","date":"2018-07-13T16:06:43.292+0000","up_votes":6,"down_votes":1,"body":"Thoughts on Syndra to come later today. I need to follow up with the team about their assessment there, she was a possible candidate for a small buff in 8.14 but one we passed on, not sure on exact context though.","replies":[{"poster":"Meddler","date":"2018-07-14T17:55:46.162+0000","up_votes":3,"down_votes":10,"body":"Apologies this ended up being a day later, rather than later in the same day. Ended up being a really busy Friday at work.\n\nShort answer is that the difference in effectiveness for Syndra between pro and normal play is what's making us hesitate on buffs here. She's a bit weak in normal play, but seeing some pro play recently. She's also got a kit that, when she clicks with the current state of pro, can move her up in priority really fast. Going to talk with the designer looking at her next week, see what our plan as a result is. Will then share that back in one of these posts once I've got some direction or details to talk about, rather just a problem statement.","replies":[{"poster":"The Yetii Rider","date":"2018-07-14T18:32:50.261+0000","up_votes":11,"down_votes":0,"body":"Legitimate question time, then. \n\nIf you continuously have to make changes or hold off on changes that hurt the overwhelming 90% of the playerbase because it may cause disruption for the top 10%, why do you balance the two together? At some point the costs to the players will be greater than the benefits of preventing your pro play from descending into predictable madness.","replies":[]},{"poster":"Sir Rouge","date":"2018-07-14T18:47:51.645+0000","up_votes":8,"down_votes":0,"body":"**1:** What was the point in keeping our hopes up that you would buff Syndra if you were gonna say the ''scared of buffing her'' like you have been all season?\n**2:** She is just seeing a bit of pro play right now (with a bad winrate) and it's in bot lane, because even in pro she's pushed out of mid.\n**3:** ''She's also got a kit that, when she clicks with the current state of pro, can move her up in priority really fast.'' You could say the same thing about Cassio, yet have no problem buffing her even when she's performing better than Syndra. Same balance team that lets Zoe croud out other mages in pro play btw.\n**4:** Can you stop saying she's sentitive to buffs with no data supporting that whatsoever? She raised in prority because of the MYMU, not because of simple buffs.\n\n**Lets look at her history:**\nS2: Very weak, even after buffs\nS3: Weak first half, got buffed again, balanced second half\nS4: Balanced until everything around her got nerfed and so became strong\nS5: Lane got heavily nerfed first patch and was weak/balanced for the whole season\nS6: Weak until MYMU (that broke her, thanks balance team), then broken (even though she was only recognized broken about 5 patches after MYMU)\nS7: Got nerfed first patch (was strong instead of broken), balanced towards late s7\nS8: Has been weak for the whole season\n\nSyndra is not super sensitive to buffs, she is super sentitive to broken changes like any champion would be. The only time where she was a problem (mid s6 to mid/late s7) was when you changed her kit in the wrong direction, and now it's completly reverted. Apart from that, she was strong in s4 until they heavily nerfed her Q early game the first patch of s5, and she wasn't even broken in s4, just strong and needed a nerf. Never has she been a problem apart from that.","replies":[{"poster":"Syndracising","date":"2018-07-15T00:19:01.554+0000","up_votes":4,"down_votes":0,"body":"Just to make clear it only took 5 patches after MYMU because she was completely bugged and her ult didn't use spheres that were moved or created right before ult cast.\n\nhttps://plays.tv/video/573b44c24b3c7b85b1/syndra-bug?from=search&search=Syndracising\n\nIf I remember correctly that was the only reason holding her back.","replies":[]}]}]},{"poster":"Dog of Pavlov","date":"2018-07-13T16:09:37.751+0000","up_votes":6,"down_votes":1,"body":"Quite sad to hear, given that even her winrate in pro play season 8 hasn't been great (41.9%): http://www.gamesoflegends.com/champion/stats.php?id=88&season=S8&league=ALL&role=ALL","replies":[]}]}]},{"poster":"Sir Nope","date":"2018-07-13T16:02:33.548+0000","up_votes":5,"down_votes":1,"body":"Two questions:\n\nWhen will we see Akali hit the PBE?\n\nAre any tanks that can jungle being looked at for buffs?","replies":[{"poster":"InTheory","date":"2018-07-13T16:11:32.908+0000","up_votes":7,"down_votes":0,"body":">When will we see Akali hit the PBE?\n\nYes.","replies":[]}]},{"poster":"InTheory","date":"2018-07-13T15:48:42.212+0000","up_votes":8,"down_votes":5,"body":"Hey Meddler, what do you think/have to say about the following statements:\n\n-\tLeague is being changed too fast (too big changes every 2 weeks). You change the game faster than players can adapt to it. \n-\tInstead of giving players time to adapt and find solutions to the game, you throw in your own solutions and just change the game. \n-\tPlease refuse to adapt because they know that things are going to be changed anyway at some point.\n-\tThe more you change things up the more players ask for changes that benefit their own playstyle and picks.","replies":[{"poster":"Meddler","date":"2018-07-13T15:56:21.317+0000","up_votes":11,"down_votes":4,"body":"I think we've changed the game too quickly over the first half of this year, in particular during the midseason period. We've pulled back on change per patch as a result and will be staying at lower change until the end of the year. Will also be avoiding spread out midseasons like we tried this time. Hope was that introducing change more gradually would make it easier to adjust and balance, with no individual patch feeling as large. What it instead did was leave a longer period of time feeling disrupted.\n\nHow much we should change things, versus waiting for players to adapt, is a tough one. Agree it's sometimes the right call, and that we likely act too hastily. At the same time there are usually some things that are just clearly out of line enough that, even if it's possible to play around them, it makes the game worse by having to do so (champs who are overtuned, Ardent Censer when it was so meta defining etc). In those cases I think we should be acting quickly on things, even if it undercuts the potential for innovation and adaptability somewhat.\n\nWhat sort of examples are you thinking when you link rate of change and increased player requests for things that benefit their own play? Seeing some of that certainly with ADCs at present, but that feels pretty appropriate IMO given were, or still are, in rough spots. There are also players who'll argue vehemently that their role/champ needs massive buffs unless it's clearly the strongest in the game, not sure that's linked to rate of change though, given it seems to a constant from many who argue like that.","replies":[]}]},{"poster":"AirKingNeo","date":"2018-07-13T20:56:27.021+0000","up_votes":3,"down_votes":1,"body":"> Liandry's buff - Similarly the Liandry's buff has also moved to 8.15. Will likely still be exploring ways to make it a better choice for many champs without having to pair it with Rylai's, while still keeping some degree of CC synergy. Details TBD>\n\nPeople already buy this item a ton like Orianna. Don't buff the already strong AP items. Buff garbage like ROA.","replies":[{"poster":"Spearsus","date":"2018-07-13T22:40:55.945+0000","up_votes":6,"down_votes":0,"body":"You don't even get the full stacks on ROA anymore before the game ends, feels bad man.","replies":[]}]},{"poster":"Koboldgeomant","date":"2018-07-13T16:30:16.920+0000","up_votes":7,"down_votes":1,"body":"Hi Meddler,\n\nare there any Ivern buffs planned ?","replies":[]},{"poster":"Severla","date":"2018-07-13T16:51:21.327+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=A7LBtoKc,discussion-id=Ekj5nZEm,comment-id=,timestamp=2018-07-13T15:44:31.928+0000)\n> * What about Twisted Treeline, funneling has been going on there for a long time\n> \n> It has, and that means changing it&amp;#039;s a pretty substantial upheaval, given it&amp;#039;s so core to how TT&amp;#039;s been played for quite a while. At least in the short term we&amp;#039;ll be keeping these changes that nerf gold funneling on SR only. \n\n\nBut.. arent the Treeline players wanting it nerfed there, too?\n\nLike every instance I see of them noting it having been there forever are ended with 'and it sucks.'","replies":[{"poster":"MiIf Fortune","date":"2018-07-13T17:46:40.722+0000","up_votes":2,"down_votes":0,"body":"It'll go back to bruiser anti tank mage meta so nothing of value would be gained","replies":[]}]},{"poster":"Blue Comfort","date":"2018-07-13T19:49:23.460+0000","up_votes":6,"down_votes":1,"body":"Planning to make Karma more of a midlane mage than a support? And what about Zyra's plants still being deleted before a fight begins?","replies":[]},{"poster":"Dog of Pavlov","date":"2018-07-13T16:03:03.529+0000","up_votes":6,"down_votes":1,"body":"Hey Meddler,\n\nMultiple tweets/posts talked about Syndra definitely being looked at for buffs. Her playrate is lower than it's ever been (since I can remember before MYMU), her winrate is not great for only mains playing her (even I stopped playing her last month), and her pro-play win rate in season 8 is only 42% according to the website that offers proplay statistics.\n\nThe Syndra mains subreddit had to condense a ton of posts because everyone is just so frustrated that she's been ignored for a potential buff since so long. Back before the item changes, it was stated she was looked at for a buff but the team wanted to \"see where she ended up\" - and her win rate/play rate have gone down quite a lot since then.\n\nWe aren't asking to make her pick/ban status, but when she has that low of a win-rate in pro-play, causes that much frustration for the mains, and has been on the decline for so long now, just a small buff could help (maybe something similar to Ahri/Viktors buffs)!\n\nThanks.","replies":[{"poster":"ImaginesTigers","date":"2018-07-13T16:24:29.456+0000","up_votes":4,"down_votes":1,"body":"A few points:\n\n* Your frustrating is understandable. But Syndra is a champion now who is highly sensitive even to small buffs. Adding a little damage to her Q might be enough to push her back to near ubiquity in the pro scene. Reverting the change to Force of Will would certainly make her priority rise massively. \n\n* As one of the mods on the Syndra Mains subreddit, we are seeing so much frustration coming from other Syndra players right now — you have no idea the amount of comments that are simply unhelpful. People asking for help on Syndra? They're being told not to pick her. That frustration is coming from a sincere place, and Syndra _is_ weak for the majority of the playerbase. \n\n* That said, people acting angrily at Riot for communicating that, yes, she's in a weak spot -- but she is so sensitive to changes that they're taking their time to evaluate what she actually needs. Do you really just want mana reductions? Do you really just want an extra 10 damage here or there, or a slightly increased ratio?\n\nI think Syndra needs _work done_ to her. She needs Riot to give her some developer time. And she will get it, and it's fair to ask -- but considering what she needs to not be permaban status is a real, important consideration.\n\nAlso, Syndra's winrate in pro-play is low, but her presence is still high among players who are confident on her. That is an indicator that they shouldn't push it. Her kit is immensely powerful.\n\nBONUS POINT: Syndra isn't actually that weak. Anecdotally, Syndra players can't even agree on whether or now she's totally weak; her weakness may be due to the _meta_, not just Syndra's kit being weak right now. Champions being less squishy across the board, able to shrug off her crowd control, means she could become 100% P/B in a few months when the meta changes again. Just some food for thought!","replies":[{"poster":"Razorex","date":"2018-07-13T21:42:22.718+0000","up_votes":4,"down_votes":0,"body":"Syndra is not sensitive to buffs at all.\nThe only reason Syndra is as bad as she is now is because of MYMU where Riot ignored us Syndra mains about the changes, and thankfully Riot completely reverted that.\nAfter that Riot for some reason still nerfed her and combined with alot of indirect nerfs (mana changes, runes) she's become one of the worst performing midlaners ever since.\n10% AP ratio on her Q won't make her pick/ban, lowering her insane mana consumptions wont make her pick/ban, Syndra is outclassed in all her strengths. You'd think Syndra would shine in the current meta where damage is at it's highest but she doesn't, because her stats are outdated and overnerfed. 80 mana for an ability you have to use every time you want to use your others, 100 mana for an incredibly small hitbox 25% slow. Her ult has  about a ~1 second window where you can pull a max sphere ult that will cost you over 400 mana. Why even bother with that when you can play any other mage/assassin and do the same but with way less risk.\n\nSyndra **DOESN'T** need a rework. There's nothing wrong with her kit.\nShe's overnerfed and needs some small buffs to her basic abilities, Q is a joke untill some levels and mana costs for both Q and W needs to be decreased.","replies":[]}]}]},{"poster":"ısa","date":"2018-07-13T18:10:47.278+0000","up_votes":7,"down_votes":2,"body":"Hi Meddler,\nAny buffs to Galio?\nI was thinking more anti-mage kinda buffs, like rewarding him for building more magic resist.\nMaybe become the \"rammus of mages\"","replies":[]},{"poster":"Kosmish","date":"2018-07-13T16:25:21.387+0000","up_votes":8,"down_votes":3,"body":"Lol so by \"short-term\" what you really mean is Twisted Treeline is never going to get attention like its always been. K","replies":[]},{"poster":"Salvor Hardın","date":"2018-07-13T15:51:27.594+0000","up_votes":4,"down_votes":9,"body":"Hi Meddler!\n\nI would like to ask you if the Nerf to Conqueror will be on next week's patch, and if not, ask you to at least do a partial nerf to Conqueror for that patch.","replies":[{"poster":"Meddler","date":"2018-07-13T16:01:54.335+0000","up_votes":7,"down_votes":8,"body":"There'll be a nerf to Conqueror in 8.14 (AD 6-35 instead of 10-35). We'll see where it's up to after that before considering possible further changes.","replies":[{"poster":"Salvor Hardın","date":"2018-07-13T16:06:34.259+0000","up_votes":2,"down_votes":3,"body":"Thank you so much for answering Meddler!\n\nGreetings from Argentina! (and the LAS server)","replies":[{"poster":"Meddler","date":"2018-07-13T16:10:17.814+0000","up_votes":7,"down_votes":2,"body":"Hello Argentina and the LAS server!","replies":[]}]}]}]},{"poster":"Spearsus","date":"2018-07-13T21:35:08.126+0000","up_votes":4,"down_votes":0,"body":"Hi Meddler, thanks for existing and creating Syndra, one of my favorite champions to play with <3","replies":[]},{"poster":"JH Barsaiqua","date":"2018-07-13T17:58:00.591+0000","up_votes":4,"down_votes":0,"body":"Hey Meddler, how has your day been going? ^_^","replies":[]},{"poster":"JimmyRevSullivan","date":"2018-07-13T17:50:05.848+0000","up_votes":4,"down_votes":0,"body":"Hey Meddler \n\n\nSince {{champion:36}} is a pretty strong pick right now even after his recent nerf on E i know you guys are looking into more changes in order to balance him so i have a sugestion: How about add scalings into his kit and reduce his base dmg? I mean,Mundo builds full tank because is the best option since he can't really use an offensive item like his juggernaut brothers like Darius so he ends in a pretty tough spot in terms of itemization because his only scaling is laughable and it's not going to be relevant unless you somehow manage to get 1000AP. My idea is basically make Mundo a proper juggernaut and make him build atleast one offensive option in order to keep his dmg relevant instead of smacking people to death with base dmg while also being unkilliable because you build full tank. I suggest ap scalings in order to make Mundo more unique,you know? We have a lot of ad juggernauts but only {{champion:82}} is an proper ap juggernaut so i think Mundo can join him and build things like Liandry(i'm pretty sure liandry was one of his recommended itens for a while :P ) or any other Ap + Health item.\n\nEnglish is not my main language but i hope you can understand what i'm trying to say ^^","replies":[]},{"poster":"Packun Flower","date":"2018-07-13T21:24:03.073+0000","up_votes":5,"down_votes":1,"body":"Hello Meddler,\n\nMay I have your thoughts on the assassin crises in Midlane, namely the dominance of both {{champion:91}} & {{champion:238}}.","replies":[]},{"poster":"Sparr126","date":"2018-07-13T16:18:09.291+0000","up_votes":5,"down_votes":1,"body":"Do you plan some tweaks to ap items that are underperforming?\n\nMainly hextech glp-800,no one build this item,now without the catalist passive.\nArchangel and ludens are always better options.\n\nAnd what about banshee's veil?\nIt has an unappealing path,sitting on a null mantle isn't enought against some heavy ap champ.\nAnd now that luden is a first item,the passive effect is really easy to break.\n\nWhat are your toughts about nullifying orb?Is it possible to make the shield adaptive?\nThe combination of it and hextrinker is totally unfair in a burst/snowballmage(like syndra) vs ad assassin.","replies":[]},{"poster":"The Pizza Bag","date":"2018-07-13T22:56:34.796+0000","up_votes":3,"down_votes":0,"body":"Hey meddler, any news on Zac? Seems to be underperforming and his place in the top Lane is practically dead :c","replies":[]},{"poster":"Ralanr","date":"2018-07-13T18:10:43.797+0000","up_votes":3,"down_votes":0,"body":"Hey Meddler, I've been meaning to ask about the Sion Q buff.  Why are you guys focusing more on his Q than his other abilities?  I know you guys probably don't want to buff up his E, and I guess his W is a bit tricky, but Q max Sion (while hurting) is very unreliable as a playstyle for lane Sion.\n\nMaybe it used to be a thing upon release, but when I started maining him (around season 6) I was told E max was the primary way to go.  This was because his base stats were weak for early melee trades, forcing him to farm and harass from afar.  This was more or less fine until comet (and later the hitbox bug) made it too good.\n\nHave you thought about buffing some base stats instead of targeting his Q?","replies":[]},{"poster":"ShadowParker","date":"2018-07-13T16:57:46.913+0000","up_votes":3,"down_votes":0,"body":"Meddler please have the team look at TT. Now is the perfect time since you’re already looking st the gold funneling strat.\n\nI implore you to please reconsider.","replies":[]},{"poster":"Operator3B","date":"2018-07-13T16:47:53.711+0000","up_votes":3,"down_votes":0,"body":"Hey Meddler, i wanted to know what your opinion was on Syndra. Particularly, are you worried she might become to frustrating to lane against if buffed? For example, her Q is not performing too well according to other players but i wanted to also hear what you think is the cause for her underperforming","replies":[]},{"poster":"Solari Fortune","date":"2018-07-13T16:09:34.720+0000","up_votes":2,"down_votes":1,"body":"Also some time ago I asked bout Leona you guys had noted she still on the radar given her ability to go from \"Oh its a Leona\" to \"Wtf this Leona just solo'd me\" at times\n\nhas that changed at all?","replies":[{"poster":"Meddler","date":"2018-07-13T16:13:25.926+0000","up_votes":3,"down_votes":0,"body":"Nothing planned for Leona right now. We'd wondered if she might become overbearing with the changes in midseason, not seeing her overperform though. Still agree her design tends to be pretty brittle, in terms of ability to go from struggling to dominant off smallish changes. Don't think it's something we need to act on at least at present though.","replies":[]}]},{"poster":"BigVi","date":"2018-07-14T02:04:33.020+0000","up_votes":4,"down_votes":1,"body":"Oh, nice, so you guys are just doing literally nothing to address any of the issues. NICE!","replies":[]},{"poster":"kaemani","date":"2018-07-13T21:03:00.273+0000","up_votes":4,"down_votes":1,"body":"hello, really curious about thoughts on amumu or just tank junglers in general being almost useless in the early game","replies":[]},{"poster":"atlıkarınca","date":"2018-07-13T15:47:40.671+0000","up_votes":4,"down_votes":1,"body":"Is the lissandra pass definite?","replies":[]},{"poster":"Fasmodey","date":"2018-07-13T15:50:00.856+0000","up_votes":5,"down_votes":2,"body":"When can we see mages buffs and Lissandra changes?","replies":[]},{"poster":"Ossify","date":"2018-07-13T15:51:57.915+0000","up_votes":4,"down_votes":7,"body":"Hi Meddler, is there any reason Riot is choosing to nerf the non problematic part of Swains kit and also his most satisfying? \n(His R explosion damage).\nWhy not try and take care of his passive in a duo lane, as in halve the heal by applied allied cc or up the cooldown on his passive?","replies":[{"poster":"Meddler","date":"2018-07-13T16:00:42.759+0000","up_votes":7,"down_votes":3,"body":"We're targeting ult explosion damage because of just how hard it allows Swain to zone while his ult's up. It should certainly hurt, but a 1.35 AP ratio on an AOE ability, even if it takes souls to get there, feels like it's just too hard hitting. That's something that's independent of whether he's being played in a duo lane or not.\n\nIn terms of balancing duo lane versus solo lane play, yeah, with you that the passive would be a good lever if we need to push on that. He gets far more opportunities to use it in most bot lane pairings. Could see lower benefit on allied CC potentially, could also just swap some damage from it to elsewhere, reduce variance in damage output.","replies":[]}]},{"poster":"Reign of Squid","date":"2018-07-14T22:16:34.562+0000","up_votes":2,"down_votes":0,"body":"Hey devs,\nActually, do you think that Sivir has a satisfying kit?\nHer passive feels quite weak with all those stuff which can make the same thing (fleetfootwork, stormrazor, celerity)","replies":[]}]}