{"poster":"Meddler","date":"2017-06-08T17:22:50.957+0000","title":"Quick Gameplay Thoughts: June 8","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Morning all,\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n**Usual Disclaimers**\r\n\r\nThese posts will often contain talk about future work we&#039;re doing, or planning to do, that isn&#039;t yet guaranteed to ship. The nature of the work could change or, depending on what we discover, projects mentioned may get put delayed or even stopped.\r\nIf you&#039;d like to see a Tweet whenever a new one of these posts goes up: https://twitter.com/RiotMeddler\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n**CC Score at end of game**\r\n\r\nWe mentioned this at mid-season, it&#039;s been delayed until now though. Short version is a CC stat at the end of game that reflects how much CC each champion in the game has applied. Should be shipping in the next patch (7.12). We ended up having to get the system rewritten because the original version imposed a higher than appropriate server load (scripted in an inefficient manner).\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n**10 Bans in match made games**\r\n\r\nShould now be live everywhere, or just about to be. Looking at its effects so far they look pretty good, with champ select times down noticeably, dodge rates (deliberate or accidental) no higher than before and annecdotal feedback fairly positive. Still monitoring all of those things though of course.\r\n\r\nIn terms of champion ban rates Yasuo&#039;s has spiked up significantly, other champions look fairly unaffected. Will want to see how that does or doesn&#039;t change over the next couple of weeks and what the trend&#039;s like in other regions (since we&#039;re just looking at NA data for now since that&#039;s where it was initially rolled out). Pick/ban rates can vary dramatically region to region so it&#039;s possible there will be some other high ban rate cases out there, would also expect Yasuo&#039;s ban rate to be significantly lower in at least some NA regions based off historical trends.\r\n\r\nMore thoughts on 10 bans to come soonish.\r\n\r\n-------------------------------------------------------------------------------\r\n**7.13 Balance Changes**\r\n\r\nDetails to come next week, some of the targets we&#039;re considering though are:\r\n\r\nNerfs - Kennen, Fiora, Galio\r\nBuffs - Cho&#039;Gath, Poppy, Gnar, Trundle, Maokai\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n**Existing Keystones Masteries as New Runes**\r\n\r\nOur expectation is that we&#039;ll transfer at least a couple of existing masteries, with some modifications, into the new runes system. We&#039;ve got some in mind already that we&#039;ve been testing, wanted to throw the question open to you folks as well though. Poll below for which of the current keystones you&#039;d be most interested in seeing translated over, also really interested in hearing thoughts as to why though of course.","replies":[{"poster":"SSJ CARROT","date":"2017-06-08T17:34:06.318+0000","up_votes":91,"down_votes":7,"body":"Can you guys please check out sivir..\nshe has lost her entire purpose... 500 range, gets bullied in lane by literally everyone. low base atk speed..so her dps is quite bad, and her utility is  not even that good, ashe/varus has better ultis.","replies":[{"poster":"Fisher No Chains","date":"2017-06-08T17:57:26.906+0000","up_votes":14,"down_votes":2,"body":"I agree that she's bad right now. \nI used to play her a lot in S6 and right now there's no reason to pick her because I don't even enjoy it anymore. Her laning phase is meh and without her ult she provides little to nothing to a team, considering her low range and the fact that she only has a single damage spell.\n\nYet another champ gutted for LCS' sake. :\\","replies":[{"poster":"SSJ CARROT","date":"2017-06-08T18:02:47.931+0000","up_votes":12,"down_votes":6,"body":"yeah, also why is everyone completely ignoring this? like they are buffing champs like poppy/maokai who are right now in a better position then sivir, and CAUSEd more problem in pro play then sivir ever did.\nSeriously can i get a rioters response on sivir.","replies":[{"poster":"Califlower","date":"2017-06-09T06:27:51.562+0000","up_votes":5,"down_votes":1,"body":"Poppy and Maokai are not in a better position than Sivir. Those champions don't win pretty much any matchup in the top lane anymore. They don't get tanky enough and they are just generally not useful when they pop like fucking cherries even though they're tanks.\nWhile Sivir may need a buff, those two also need a buff, I think riot wants to see actually played again.","replies":[]}]}]},{"poster":"RenanRein","date":"2017-06-08T18:05:34.845+0000","up_votes":4,"down_votes":0,"body":"Her bonus As on ricochet was very nice when the values were 40%/60%/80%. I mean, the bonus only lasts for 3 attacks and she has one of the lowest attack speed between all marksman, idk why Riot Nerf this specific thing. If they only revert this change, it would help her a lot.","replies":[]}]},{"poster":"Hellioning","date":"2017-06-08T19:53:02.261+0000","up_votes":20,"down_votes":0,"body":"I don't understand why everyone loves Thunderlord's so much. It's generally just free damage on combos.","replies":[{"poster":"playtestpenguin","date":"2017-06-08T20:17:35.830+0000","up_votes":34,"down_votes":2,"body":"3 hit passives are very satisfying for most players\n\ninsert RiotAugust/Gypsylord/Groovylord meme here","replies":[{"poster":"Hellioning","date":"2017-06-08T20:26:16.689+0000","up_votes":37,"down_votes":0,"body":"Are they really '3 hit passives' when they're things like Lux landing an E and an autoattack or someone not moving out of Make it Rain fast enough?\n\nI can understand the desire for 3 hit combos, but most of them are just using one or two abilities that counts as multiple hits.","replies":[{"poster":"Sexy Jack Rabbit","date":"2017-06-09T00:57:54.670+0000","up_votes":15,"down_votes":1,"body":"Well assuming they would do Runes Reforged correctly these kind of interactions would FINALLY be fixed, and for the better. \nLux not being able to proc TLD with E + AA would leave room to buff her in a more meaningful way.\nSame goes for Morgana and a lot of other abusers.","replies":[]}]}]}]},{"poster":"Cosmic Warper","date":"2017-06-08T17:34:52.199+0000","up_votes":40,"down_votes":3,"body":"Definitely stormraider's as it has a nice high moment and takes some work to achieve, unlike other keystones.","replies":[{"poster":"Malicious Metal","date":"2017-06-08T17:49:01.139+0000","up_votes":14,"down_votes":0,"body":"*jolly hue-ing in the distance*","replies":[]}]},{"poster":"CLdude2013","date":"2017-06-08T17:38:45.582+0000","up_votes":6,"down_votes":3,"body":"So with these keystones am i reading this right as in get rid of mastery keystone and add it into rune keystone instead so effectively you can use both? Cos like it would be cool gettings stormraiders transferred over as you can have an aggressive keystone say thunderlords and combo that with a mobility keystone like stormraiders {{champion:245}} {{champion:121}}","replies":[{"poster":"Meddler","date":"2017-06-08T17:47:23.558+0000","up_votes":19,"down_votes":0,"body":"The new runes system will be replacing both existing runes and masteries. The poll's therefore asking which mastery you'd most like to see stick around in some form.","replies":[{"poster":"Yadid","date":"2017-06-08T18:33:00.474+0000","up_votes":5,"down_votes":1,"body":"Oh geez only one out of 9 key stones? Is it possible to tweak the poll for 3, for each tree? I think that'll give better results based on the classes players use or the most popular in each tree (which can also show clear majorities on the whole). I'd imagine it could provide a more complex roadmap... the again that could be what you're trying to avoid.\n\nClear bias, I dont think stoneborn pact has fully set in and would be overshadowed by longer standing keystones like TLD or Fervor - especially so where only one result is king.","replies":[{"poster":"Meddler","date":"2017-06-08T18:46:46.230+0000","up_votes":6,"down_votes":0,"body":"Going with just a single option here because most interested in which masteries people feel really strongly about, rather than more general which ones they prefer over others.","replies":[{"poster":"Spârky","date":"2017-06-08T19:02:49.244+0000","up_votes":24,"down_votes":1,"body":"I think that Thunderlords just should be excluded because we all know everyone is going to favor it but i'd personally like seeing mages and people that normally go thunderlords switch it up. Also, Thunderlords imo is just lain boring. Same with fervor. They aren't unique enough. They just sorta add damage and thats it. Where like warlords and stoneborn pact are much more interactive and I feel are way more unique and cool for the game!","replies":[{"poster":"Meddler","date":"2017-06-08T19:44:39.388+0000","up_votes":11,"down_votes":1,"body":"If people don't care enough for another mastery to vote for it over Thunderlord's that's pretty informative too.\n\nThanks for the thoughts on damage versus more interactive masteries, with you there's value in offering some optimization opportunities like that. Fervor and TLD do have some, but they're also often very automatic. ","replies":[{"poster":"Mysticman89","date":"2017-06-08T20:12:06.055+0000","up_votes":11,"down_votes":0,"body":"There's probably going to be different representations based on the different populations maining different roles.\n\nStormraiders for example is 'interesting' I think, but as a support main it offers basically nothing to me, and maybe even foils me. Stoneborn pact/windspeakers on the other hand, probably only really attractive to support players (and I guess ivern jg players, maybe nunu uses pact) who are notoriously a minority to begin with, and I'd hate to see supports get the short end of the stick due to not being part of the majority.","replies":[]}]}]}]}]}]}]},{"poster":"edoxbox1","date":"2017-06-08T18:31:01.856+0000","up_votes":2,"down_votes":0,"body":"Nerfs - Kennen, Fiora, Galio\nBuffs - Cho'Gath, Poppy, Gnar, Trundle, Maokai\nWhy ?\nToo strong\\weak ?","replies":[{"poster":"Meddler","date":"2017-06-08T18:52:11.717+0000","up_votes":23,"down_votes":2,"body":"Those are where the darts on the dartboard landed.\n\nSerious answer - yes, the nerfs are to champs we think are too strong, the buffs to those we think are too weak. Details and more thoughts to follow (probably early next week).","replies":[{"poster":"Impish Yordle","date":"2017-06-08T19:10:31.215+0000","up_votes":9,"down_votes":0,"body":"Are general Kennen nerfs planned or nerfs aimed specifically at his on-hit build? His AP build has been in an awkward spot for quite some time now.","replies":[{"poster":"Riot MapleNectar","date":"2017-06-09T01:53:16.161+0000","up_votes":7,"down_votes":0,"body":"We're investigating ways to give him some power back to make sure Kennen is still a viable champion, not necessarily AP, but it's one of the potential things we're talking about!","replies":[]}]}]}]},{"poster":"HOW DO I POPPY","date":"2017-06-08T19:39:40.315+0000","up_votes":5,"down_votes":0,"body":"i saw you're going to nerf kennen, could you try only hitting AD kennen? cause AP is already pretty behind D:","replies":[{"poster":"playtestpenguin","date":"2017-06-08T20:20:52.800+0000","up_votes":15,"down_votes":0,"body":"I don't think there's any scenario where our balance team would nerf AP kennen right now.","replies":[{"poster":"ImpmonCute","date":"2017-06-08T21:02:42.814+0000","up_votes":5,"down_votes":0,"body":"what about buffing him?","replies":[]}]}]},{"poster":"MISTER E","date":"2017-06-09T20:06:52.315+0000","up_votes":15,"down_votes":1,"body":"Fix Rengar already. {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"GreenRaven22","date":"2017-06-09T20:29:57.396+0000","up_votes":2,"down_votes":2,"body":"what is wrong with him...deleted you while you farmed as ADC...\n\nwhat can i say...he is an assasin..\n\nP.S...Life is life ya know{{sticker:slayer-jinx-wink}}","replies":[{"poster":"MISTER E","date":"2017-06-09T20:42:03.886+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=GreenRaven22,realm=EUW,application-id=A7LBtoKc,discussion-id=VLu215QO,comment-id=00f60000,timestamp=2017-06-09T20:29:57.396+0000)\n>\n> what is wrong with him...deleted you while you farmed as ADC...\n> \n> what can i say...he is an assasin..\n> \n> P.S...Life is life ya know{{sticker:slayer-jinx-wink}}\n\n\nWhat are you on about?\n\nI am a Rengar one trick. \n\nHe is an assassin? He got shifted away from being an assassin to being a diver because Riot Games is trying to cover up the fact that they destroyed Rengar.  \n\nWith new Rengar, you can flash away from Rengar when he jumps on you and you will literally take 0 damage/stay grouped and he will basically just become useless. In addition to that you can see him when he ults, and all you need to do is CC him mid air and he will drop from 100-0 real fast. So much for \"counterplay\".\n\nRevertRengarThx","replies":[]}]}]},{"poster":"KnightsKemplar","date":"2017-06-09T01:52:40.724+0000","up_votes":9,"down_votes":0,"body":"Windspeaker's Blessing is really critical for healing supports just because of the healing buff that it gives. I know it doesn't have a lot of votes, but I'm sure I'm not the only support player that thinks it is really important for the support role to have keystones that reinforce/reward a support play-style.","replies":[{"poster":"Rathar Dashing","date":"2017-06-09T13:29:17.354+0000","up_votes":3,"down_votes":0,"body":"I agree, I voted for windspeaker's too. As a support main I kind of have to.\n\nHowever, I would be totally fine with a new mastery that buffed heals/shields in a different way, perhaps shift some of the +10% power into something more special.","replies":[]}]},{"poster":"Spideraxe","date":"2017-06-08T17:26:28.744+0000","up_votes":9,"down_votes":0,"body":"Hey Meddler can I ask if you'll do another State of the Season post with midseason behind us","replies":[{"poster":"Meddler","date":"2017-06-08T17:49:16.536+0000","up_votes":8,"down_votes":1,"body":"Hmm, not sure. The thing that makes me hesitate is that I've been covering the sort of stuff that could go into one of those in these posts generally. Can see some argument for collecting the bigger points together, less sure if it's worth the time versus working on other stuff though (whether other communication or game dev).","replies":[]}]},{"poster":"RavenHusky","date":"2017-06-08T17:44:42.517+0000","up_votes":10,"down_votes":1,"body":">In terms of champion ban rates Yasuo's has spiked up significantly, other champions look fairly unaffected.\n\nSaw that coming a mile away. When everyone has the opportunity to ban a champion, someone is going to want the most hated champ in the game gone. I know a lot of Rioters were expecting the mind game factor (both teams thinking the other will ban him) to keep him in the game, but don't underestimate people's hate for such an unfun lane opponent.\n\nThe only way his ban rate will go down is if he gets put into the basement and later reworked so he isn't as frustrating to play against.","replies":[]},{"poster":"YourSh4dow","date":"2017-06-08T18:15:07.495+0000","up_votes":10,"down_votes":2,"body":"jesus christ dont buff Chogath... like it isn´t enough he does 1000+ true dmg every 40 secs or so and has regurarly 4k hp without even trying that much.","replies":[]},{"poster":"Sw4de","date":"2017-06-08T18:05:44.629+0000","up_votes":4,"down_votes":0,"body":"Thoughts on lethality?","replies":[{"poster":"Meddler","date":"2017-06-08T18:53:17.648+0000","up_votes":7,"down_votes":1,"body":"Some items with Lethality on them are too weak. Planning to work on those in the short to moderate term.","replies":[{"poster":"ProfDrDeath","date":"2017-06-08T19:38:17.024+0000","up_votes":3,"down_votes":0,"body":"Concerning Lethality:\n\nHow much of a difficulty, balance-wise, is the fact that all Lethality items are intrinsically also giving out-of-combat MS? And would that ooC MS be a possible avenue to tune these items?","replies":[{"poster":"Meddler","date":"2017-06-08T19:43:22.659+0000","up_votes":7,"down_votes":0,"body":"That could be a good approach yeah. OOC MS looks like it's probably more snowbally on those items than predicted. Could remove if from some, strengthen it on others to make them easier to balance and more distinct. \n\nHaving said that giving assassins non direct combat power's also got some good arguments for it (more ability to start good fights, less just raw 100-0 potential).","replies":[]}]}]}]},{"poster":"Sun Wu Ryuumoku","date":"2017-06-08T17:25:23.971+0000","up_votes":12,"down_votes":5,"body":">Buffs - Cho'Gath, Poppy, Gnar, Trundle, Maokai\n\nOh God, nooooooooooooooooooooooo.\n\n\nStill nothing about lethality btw","replies":[]},{"poster":"Poppystar","date":"2017-06-08T17:34:47.249+0000","up_votes":16,"down_votes":9,"body":"Yasuo is banned for a reason. If you are concerned about his banrate, something should be done to his kit. I'm totally ok with Yasuo being permabanned. I haven't seen one in months and it has honestly made the game less frustrating.","replies":[]},{"poster":"Rudgy","date":"2017-06-08T21:32:16.382+0000","up_votes":6,"down_votes":0,"body":"In the 7.13 patch changes will you straight nerf kennen as a whole or just AS oriented kennen. If you nerf him as a whole i would suggest to buff ap kennen a little bit, he's not in a very good position right now and if you nerf him I think he will become trash tier.","replies":[]},{"poster":"Yordle Hoardle","date":"2017-06-09T00:00:04.393+0000","up_votes":5,"down_votes":0,"body":"@Meddler \nBefore you nerf AD Kennen and both of his playstyles become unviable, could you consider some quality of life changes for AP Kennen? The initial ult changes were really harsh on him and a bit unnecessary. The whole reasoning behind \"rewarding a good Kennen ult\" seemed like more of a cop out for low elo players who don't know how to play against Kennen ultimates, because the likelihood of someone sitting in your ultimate for a full three seconds is essentially none in almost every game past gold elo. Kennen needs high damage in the initial ticks of his ultimate because he's designed to be played as a burst mage. If you really want to argue that the old ult still did too much damage, then that's fine, but in its current state Kennen's ultimate does NOT do enough initial damage and he's suffering because of it. I can go more in depth into this if needed because I have a lot to say on this, but I think the fact that everyone collectively dropped AP Kennen and his winrate dropped nearly 3 ~ 4 % in one patch says enough.","replies":[]},{"poster":"Wet Dryman","date":"2017-06-08T17:50:49.390+0000","up_votes":5,"down_votes":0,"body":"Any thoughts on Gragas? He seems to grow in popularity in Solo Q's high elo and is top tier in the pro play. Do you think he needs any adjusments?","replies":[]},{"poster":"ImaginesTigers","date":"2017-06-08T17:31:46.566+0000","up_votes":4,"down_votes":1,"body":"Syndra's winrate fell by a lot -- is this something you guys were aiming for? Were your nerfs meant to take her out of the competitive meta?\n\nJust some thoughts on where you think she's at now would be great.","replies":[{"poster":"Meddler","date":"2017-06-08T17:50:05.314+0000","up_votes":5,"down_votes":0,"body":"So far the Syndra nerf looks like around what we were targeting.","replies":[{"poster":"Raxistaicho","date":"2017-06-08T18:25:53.032+0000","up_votes":1,"down_votes":0,"body":"How about the Ahri nerfs, how do you feel about those?","replies":[{"poster":"Meddler","date":"2017-06-08T18:49:32.554+0000","up_votes":3,"down_votes":0,"body":"Same answer, right ballpark at least.","replies":[{"poster":"NineTailedMystic","date":"2017-06-09T02:20:40.505+0000","up_votes":1,"down_votes":0,"body":"If you intend on not bringing back Thunderlord's, Ahri would be heavily affected as it essentially makes up for Ahri's lesser damage compared to other champions in the same class that she used to pay for her mobility. Assuming there's no real replacement in the new Rune system.\n\nI'd assume you guys are already in internal testing for various concepts for new Runes and such, so I'd suggest seeing how she does without an additional burst tool like Thunderlord's. Hopefully it'd bring her back a bit closer to other champions as her win rate still seems fairly high at the moment.","replies":[{"poster":"Vild Asen","date":"2017-06-09T08:49:19.687+0000","up_votes":2,"down_votes":1,"body":"... dude no.. you don't even know what the new runes are yet TLD is trash we need to get rid of because it is boring in comparison to CotC or SS","replies":[{"poster":"NineTailedMystic","date":"2017-06-09T09:18:45.903+0000","up_votes":2,"down_votes":1,"body":"And I find Stormraider's useless and boring. Point being?","replies":[]}]}]}]}]}]}]}]}