{"poster":"Meddler","date":"2017-11-15T17:16:50.269+0000","title":"Quick Gameplay Thoughts: November 15","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Morning folks,\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n**Usual Disclaimers**\r\n\r\nThese posts will often contain talk about future work we&#039;re doing, or planning to do, that isn&#039;t yet guaranteed to ship. The nature of the work could change or, depending on what we discover, projects mentioned may get put delayed or even stopped.\r\nIf you&#039;d like to see a Tweet whenever a new one of these posts goes up: https://twitter.com/RiotMeddler\r\n\r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png\r\n\r\n------------------------------------------------------------------------------\r\n**Game length and snowball**\r\n\r\nSomething we watch closely especially around pre-season is how game time and snowball rates are changing. That&#039;s been particularly important to watch this year given a few changes that have the potentially to create more snowbally and/or shorter games. Those are things like a reduction in catch up XP, Legend/Bounty Hunter runes that are being taken a lot right now, people running very aggressive feast or famine team comps without much of a front line etc. \r\n\r\nAfter the patch went out last week we saw average game times in ranked SR drop by about a minute, which is meaningful. Looking into it we realized patch 7.22 had also introduced a bug into match making where higher MMR players were being stacked on one team inappropriately. We fixed that a couple of days after the patch and then looked at game times again. That showed average game times down 30s versus 7.21, of which 10s comes from minions/monsters spawning quicker (quicker game start).\r\n\r\nSo, game time hasn&#039;t changed too much on average. Having said that though, that&#039;s just one facet of things and lack of much average game time doesn&#039;t mean other things might not have changed significantly. We&#039;re currently looking at a range of other measurements including things like:\r\n\r\n* How snowbally a game is (on average how far through is the game decided?)\r\n* Whether both early game and late game champions are performing appropriately\r\n* How much variation in game length there is (are more games around the average length, or are we seeing more really short and really long games?)\r\n* How game time, snowball etc changes by different skill levels and regions\r\n* Etc\r\n\r\nMore thoughts on stuff like that, and pacing in general, to follow. \r\n\r\n------------------------------------------------------------------------------\r\n**Transcendence**\r\n\r\nTranscendence seems to be getting a lot of conversation at the moment and we&#039;ve been looking at a range of item builds suggested using it. Some seem good, but not out of line, some seem interesting but probably not effective choices. A few look really strong, especially in certain situations (looking at you Malphite), things should have contexts in which they&#039;re really strong sometimes though. Doesn&#039;t seem like the Rune&#039;s inappropriately tuned at present overall, keeping a close eye on it though in case any of the edge cases become really abusive. \r\n\r\n------------------------------------------------------------------------------\r\n**Health Bar update now in 7.24**\r\n\r\nWe&#039;re still working on the health bar update. Based off the number of things we still want to polish and some really useful feedback we&#039;re going to move that back to patch 7.24, rather than 7.23 as we were originally thinking, to get a bit more time to work on it. If you&#039;ve got any further thoughts about how the new bars are looking, particularly after the recent polish to them while they&#039;ve been on PBE, that would be much appreciated.\r\n\r\n------------------------------------------------------------------------------\r\n\r\n**Non LoL: Level Design in Breath of the Wild**\r\n\r\nOccasionally I figure it&#039;s good to post some general game design stuff for people interested in that side of things, even if it&#039;s not LoL related. One thing I was reading recently that I thought was quite insightful was an account of one of the principles the Breath of the Wild team used to build their outdoor world. Link to a summary of that below, courtesy of Robert Yang summarizing Matt Walker&#039;s twitter rundown of a presentation by some of the Breath of the Wild team:\r\n\r\nhttp://www.blog.radiator.debacle.us/2017/10/open-world-level-design-spatial.html","replies":[{"poster":"Queš","date":"2017-11-15T17:44:00.079+0000","up_votes":36,"down_votes":3,"body":"Hey Meddler.\nI wanted to talk about {{champion:83}} .\nRiotMapleNectar stated that his nerf will be pulled soon,so I am happy about this for now.\nBut I wanted to suggest few things about Yorick's balance as a quite high elo Yorick enthusiast since his rework(d1 on a few accounts).\n\nThe thing about {{champion:83}}  is that even now he is pretty mediocore/ok in diamond+ elo (49-51 winrate on average) and any nerf to his trading power will hurt him alot(like base ad nerf).\nHowever,he has high winrate in bronze,silver and gold.\nI am almost certain thats because people do not correctly respond to his midgame splitpush and try to overforce things and lose turrets/inhibitors for free with that new introduced tower push speed.Also maybe this causes alot of Nashors loses after.\nAlso its quite obvious that people in lower ranks probably dont play around his weaknesses and do smth like : tp on creep in lane when Yorick is pushing with his flock or use their mobility spells to jump and trade with him(which leads in easiest combo for him).I ve played on my plat smurf before and even there people do such silly mistakes vs Yorick.\n\nAnyway I wanted to suggest for full Q on buildings revert or :\n1.Let his Q \"unlock\" on buildings when he reaches rank 3 of his ultimate (16 lvl).\n2.Let his Q bonus damage scale with levels on buildings (30% level 1 and like 100% level 18 or smth like that).\n\nAlso I do believe that turrets are kinda weak right now and Demolish rune is strong.Grasp is little overtuned too in my opinion.\nAlso {{champion:164}} {{champion:114}} {{champion:24}} {{champion:39}} {{champion:126}} {{champion:240}} {{champion:92}} {{champion:58}} {{champion:23}} {{champion:19}} {{champion:157}} took a huge hit with Fervor removal(Press the Attack is great,but Fervor was much better against tankier targets and overall IMO).And Yorick always had problems with Fervor bruisers.\n\nTL;DR.\n{{champion:83}} winrate is 50% in diamond + even now.\nDont hurt his ability to trade in lane(like base ad nerf).\nDemolish + Q is too strong combo ,esp. in lower ranks.\nRevert Q changes,buff turrets and look at Demolish and Grasp.\nFervor champions are too weak and they are his natural counters.","replies":[{"poster":"Abyss Watchers","date":"2017-11-15T20:37:25.613+0000","up_votes":2,"down_votes":1,"body":"Forgot to mention {{champion:122}}  there\n\nBut fuck that guy amrite\n\n:(","replies":[{"poster":"Queš","date":"2017-11-15T20:38:36.195+0000","up_votes":5,"down_votes":0,"body":"I didnt mention him because he was kinda easy matchup for {{champion:83}}","replies":[]}]},{"poster":"Arkadije95","date":"2017-11-16T16:12:49.289+0000","up_votes":3,"down_votes":0,"body":"Yea. Leave Yorick alone. He is fine, a little too good at split pushing, but fine.\nWith champions like {{champion:114}} {{champion:31}} {{champion:3}}, cant you just let the poor guy have preseason at least?\nOn a less serious note we all know Yorick was best girl when he got rewoked and they gave him some love with a DEUS VULT skin. So hyped for more, I heard that the new girl {{champion:266}} will be best girl of this season. \nBut seriously Yorick is fine, all he does is split push, its not the most broken mechanic in the game.","replies":[]}]},{"poster":"Momo Biased","date":"2017-11-15T17:21:08.620+0000","up_votes":5,"down_votes":1,"body":"I've seen some discussion around stacking Black Cleavers through the overcapping of CDR on Transcendence. I wanted to know what you thought of that from a game design / game health point of view.\n\nDo you have anything in mind for changes in the way of Press the Attack vs Lethal Tempo? Eg. Nerfing PTA or buffing LT to bring them in line with one another and make the choice a bit more meaningful","replies":[{"poster":"Meddler","date":"2017-11-15T17:23:55.327+0000","up_votes":20,"down_votes":3,"body":"Black Cleaver stacking hasn't looked at all out of line so far. If anything, it's often looking like quite a poor choice, given you're spending quite a lot for that HP/AD and not getting any of the unique benefits other items could be offering you (compare to say a Titanic Hydra instead of an additional BC).\n\nBunch of thoughts on 7.24 balance coming on Friday, Precision keystone balance is one of the things we're focused on for that patch.","replies":[{"poster":"HalcyonDweller","date":"2017-11-15T17:39:41.198+0000","up_votes":2,"down_votes":4,"body":"_Edit 2: If it's as bad as you think, then isn't it a noob trap? I would think that this interaction is OP if good, or a trap if bad, either way it's not good to preserve in the game._\n\nIn my humble opinion, the amount of damage + tankiness that certain characters are getting from stacking Black Cleavers with Transcendence is kind of anti-fun.\n\nI heard some people suggest making the CDR on BC unique, is there any way that could accidentally impact balance elsewhere?\n\n_Edit: for anyone interested in advocating for this to be fixed, I created a post over here:_\n\nhttps://boards.na.leagueoflegends.com/en/c/gameplay-balance/EHIXEzFv-riot-stacking-the-same-item-over-and-over-again-is-not-compelling-gameplay","replies":[{"poster":"Meddler","date":"2017-11-15T20:43:56.961+0000","up_votes":6,"down_votes":1,"body":"I don't think it's any more of a noob trap than stacking PDs or similar approaches. The Rune does imply that getting excess CDR might be a good idea, it's on the player to then jump to not valuing unique effects sufficiently though. \n\nWe could make the CDR on BC unique. So far it doesn't seem to be creating problems however. If there are appropriately balanced situations where getting an additional BC is a good, but not OP choice, wouldn't want to block that sort of good decision making without need to.","replies":[{"poster":"Shadow Hazard","date":"2017-11-15T21:00:20.185+0000","up_votes":1,"down_votes":1,"body":"What problems arise from limiting that out now instead of hoping that it doesn't become a problem?","replies":[{"poster":"Quepha","date":"2017-11-15T21:03:45.816+0000","up_votes":7,"down_votes":0,"body":"Then it feels like Riot is forcing us to use specific builds before we even have a chance to think of something unusual.","replies":[]}]}]}]}]}]},{"poster":"Jubilee Phoenix","date":"2017-11-15T18:07:27.090+0000","up_votes":6,"down_votes":2,"body":"Realquestion, on scale of 1 to 10 what was your injoyment of Breath of the Wild?","replies":[{"poster":"Riot MapleNectar","date":"2017-11-15T19:00:26.490+0000","up_votes":15,"down_votes":2,"body":"I'd put it at a 16. Seriously, that game was amazing. I know there were some criticisms of the storyline, but in general seeing how botw was put together, from the level design, the art, the audio - it felt like a masterpiece to me. I beat it a long time ago but I still run around finishing the random little side quests just because I find travelling across the world they built to be incredibly relaxing and immersive.","replies":[{"poster":"SpecterVonBaren","date":"2017-11-15T20:58:18.595+0000","up_votes":2,"down_votes":0,"body":"What was your own general route through the world? (As in, where did you explore first and where did you end up along the way to the end)","replies":[]}]},{"poster":"Meddler","date":"2017-11-15T20:41:00.829+0000","up_votes":11,"down_votes":1,"body":"It'd be a 9 of 10 for me. Loved an awful lot of what it did, particularly the general roaming the world finding stuff experience. Felt it ran out of new things to offer in the final 1/3 of the game or so though generally, which is the only substantial point I'd have against it.","replies":[]}]},{"poster":"Mysticman89","date":"2017-11-15T17:27:09.782+0000","up_votes":5,"down_votes":1,"body":"Can you share what the average game time actually is? How about standard deviation about that?\n\nIf most games are 20 minutes with a few drawn out 60 minute slug fests dragging the average up to 30, thats a different story than most games being 30 minutes. I know (particularly right now) people have a lot of hyperbolic statements about how we need 10 minute surrender and things are decided super early, but between late game champs and now late game runes (e.g. gathering storm) it'd be interesting to think about whether people might be able to hang in and prevent the enemy from closing out in order for their own strengths to come online.","replies":[{"poster":"Meddler","date":"2017-11-15T17:36:26.002+0000","up_votes":8,"down_votes":1,"body":"Ranked SR:\n\n7.21 - 30.05\n7.22 with matchmaking bug - 28.57\n7.22 with bug fixed - 29.26\n\nThat also includes the -10s from earlier game start too.\n\nI don't have standard deviation to hand, though as above that's something we'll be looking at shortly. Looking at a snowball measure we use games are somewhat more snowbally, but the data being looked at for that includes pre bug fix games, so not putting any weight on the numbers there until we've got those filtered out.","replies":[{"poster":"Solidair3","date":"2017-11-15T18:59:28.828+0000","up_votes":3,"down_votes":1,"body":"How do you guys determine the point at which \"the match is already over\"?","replies":[{"poster":"Meddler","date":"2017-11-15T20:49:21.319+0000","up_votes":10,"down_votes":1,"body":"We use a predictive model that looks at things like gold and XP differences. It equates large enough gaps (based off correlation between a team getting that much a lead and winning in other games) with when in the game it was almost certainly decided. That lets you measure things like what proportion of games are probably over early, probably over mid game, could go either way right until the end etc. It's still pretty approximate of course, but is helpful in understanding how the game has/hasn't changed after a patch.","replies":[{"poster":"Focus The Lexus","date":"2017-11-15T22:26:44.916+0000","up_votes":7,"down_votes":0,"body":"Would love a /dev post with some graphs out of this predictive model. Things like how accurate it is plotted against time until game ended, or a histogram of win probability at 15 minutes before game end.","replies":[]},{"poster":"iWannaBeAFish","date":"2017-11-16T01:45:58.537+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=A7LBtoKc,discussion-id=5yv0tj2J,comment-id=000b000000040001,timestamp=2017-11-15T20:49:21.319+0000)\n>\n> We use a predictive model that looks at things like gold and XP differences. It equates large enough gaps (based off correlation between a team getting that much a lead and winning in other games) with when in the game it was almost certainly decided. That lets you measure things like what proportion of games are probably over early, probably over mid game, could go either way right until the end etc. It&#x27;s still pretty approximate of course, but is helpful in understanding how the game has/hasn&#x27;t changed after a patch.\n\nIs there a stat you can throw out about that?  Just by looking at my last 30 games, win rate after first tower is pretty high.  Definitely feels like games are decided between 12-15 minutes in, and the only hope at winning is the other team fucking up hard","replies":[]}]},{"poster":"Faint of Hearts","date":"2017-11-15T19:31:12.150+0000","up_votes":6,"down_votes":1,"body":"When the Nexus blows.","replies":[]}]}]}]},{"poster":"MakeItEasy4Lolis","date":"2017-11-15T17:24:46.207+0000","up_votes":2,"down_votes":4,"body":"Is it really Malphite a problem with trascendence?\nand if it is why?\nThe real problem is all those assasins buying 4-5 BlackCleavers and having way more AD than those who build a standard build.","replies":[{"poster":"Meddler","date":"2017-11-15T17:30:41.001+0000","up_votes":13,"down_votes":3,"body":"We don't have any current plans to change him, Frozen Heart stacking, in particular how bursty it makes him in combination with his passive, is a risk though. Might be fine, not confident either way yet.\n\nNot seeing anything out of line with BC stacking so far. Possible it will prove to be a problem, but you give up a lot to do so.","replies":[{"poster":"ProfDrDeath","date":"2017-11-15T17:46:09.591+0000","up_votes":1,"down_votes":0,"body":"If Frozen Heart stacking (or Cleaver stacking / anything stacking) is a problem, though, wouldn't it be possible to make the CdR unique?","replies":[{"poster":"Meddler","date":"2017-11-15T17:58:59.415+0000","up_votes":4,"down_votes":1,"body":"If it's just a single item or two out of line, yeah, we could do so. So far, that doesn't look necessary, we'll see how things develop. Also possible the conversion ends up looking too strong in general, though not seeing much evidence of that yet.","replies":[]}]}]}]},{"poster":"OuterRaven","date":"2017-11-15T18:37:38.509+0000","up_votes":8,"down_votes":0,"body":"Thoughts on the current state of bruisers/juggernauts? According to op.gg and champion.gg their winrate dropped by quite a lot. Darius especially.","replies":[{"poster":"Abyss Watchers","date":"2017-11-15T20:39:31.007+0000","up_votes":5,"down_votes":0,"body":"Pretty much everyone who relied a lot of fervor, Tryndamere and Yasuo included. Most of my top matchups started feeling more like weird tank duels lately.","replies":[]}]},{"poster":"waiting for WoW","date":"2017-11-15T17:24:40.756+0000","up_votes":4,"down_votes":1,"body":"Are there any potential buffs to other struggling Phase Rush users like Cassiopeia or Aurelion Sol? I mean besides Taliyah of course.","replies":[{"poster":"Meddler","date":"2017-11-15T17:32:35.417+0000","up_votes":9,"down_votes":1,"body":"We're working on a balance assessment for 7.24 changes at the moment, whole bunch of details about that coming Friday. Considering former Stormraider's users and looking at their performance now is part of that.","replies":[{"poster":"TheBossVeigar","date":"2017-11-15T18:58:43.453+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=A7LBtoKc,discussion-id=5yv0tj2J,comment-id=00060000,timestamp=2017-11-15T17:32:35.417+0000)\n>\n> We&#x27;re working on a balance assessment for 7.24 changes at the moment, whole bunch of details about that coming Friday. Considering former Stormraider&#x27;s users and looking at their performance now is part of that.\n\nWhat do you consider a \"Stormraider's user\"? Do you include Veigar in this group? A lot of Veigar mains used Stormraider's on him.","replies":[{"poster":"Bad Zoe Main","date":"2017-11-16T00:39:35.022+0000","up_votes":3,"down_votes":0,"body":"It's safe to assume \"stormraiders users\" will be determined by internal data.\n\nThey can easily see, for instance, what champions take Stormraiders in what percentage of games.","replies":[]}]},{"poster":"EROTIC RAID BOSS","date":"2017-11-16T19:46:07.395+0000","up_votes":3,"down_votes":0,"body":"Please don't forget that stormraiders was the premiere choice of illaoi and I think maybe darius? It feels significantly worse on her now","replies":[]}]},{"poster":"Riot ShadowStorm","date":"2017-11-15T23:35:25.389+0000","up_votes":4,"down_votes":1,"body":"Have you tried Glacial Augment on Aurelion Sol? I really liked that when I tried it out; plus, going into Inspiration let me get a good amount of ambient MS, which felt really good on him. Here was the page I used:\n\nhttp://na.leagueoflegends.com/en/featured/preseason-update/8300-8351?build=41101248","replies":[{"poster":"waiting for WoW","date":"2017-11-16T01:02:44.611+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot ShadowStorm,realm=NA,application-id=A7LBtoKc,discussion-id=5yv0tj2J,comment-id=00060003,timestamp=2017-11-15T23:35:25.389+0000)\n>\n> Have you tried Glacial Augment on Aurelion Sol? I really liked that when I tried it out; plus, going into Inspiration let me get a good amount of ambient MS, which felt really good on him. Here was the page I used:\n> \n> http://na.leagueoflegends.com/en/featured/preseason-update/8300-8351?build=41101248\n\nI just tried a few games with it on my main account and it is actually a really good rune path. I like how I can get extra mana pots, and get extra duration on Corrupting Potion to. I still prefer Stormraider's Asol but assuming Phase Rush stays in its current iteration, I'll be taking glacial augment on Asol for the next season.\n\nI'm still quite concerned for other champions like Ryze, Taliyah, and Cassiopeia though. I've become quite attached to the stormraider's Cassiopeia playstyle in particular.","replies":[{"poster":"Riot ShadowStorm","date":"2017-11-16T02:23:11.566+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=waiting for WoW,realm=NA,application-id=A7LBtoKc,discussion-id=5yv0tj2J,comment-id=000600030000,timestamp=2017-11-16T01:02:44.611+0000)\n>\n> I just tried a few games with it on my main account and it is actually a really good rune path. I like how I can get extra mana pots, and get extra duration on Corrupting Potion to. I still prefer Stormraider&#x27;s Asol but assuming Phase Rush stays in its current iteration, I&#x27;ll be taking glacial augment on Asol for the next season.\n> \n> I&#x27;m still quite concerned for other champions like Ryze, Taliyah, and Cassiopeia though. I&#x27;ve become quite attached to the stormraider&#x27;s Cassiopeia playstyle in particular.\n\nMy favorite thing about it was that I had enough MS to go with Sorcerer's Shoes instead of Boots of Swiftness, which felt like a meaningful power add.\n\nI'm not involved with any of the balance stuff, so don't have much insight into plans for other Stormraiders users - just chiming in as somebody who plays Aurelion/Taliyah/Ryze somewhat frequently. But FWIW, I've found Phase Rush to feel pretty good on Ryze, and I've found some success with Comet/Glacial Augment on Taliyah. Though, the Taliyah ones do play differently than Stormraiders did, so it isn't really the same thing.\n\nPersonally, I wish these kinds of \"dps mages\" could run some kind of Precision+Sorcery path. Imagine something like this, if you pretend that Press the Attack and Legend: Bloodline also worked for spells:\n\nhttp://na.leagueoflegends.com/en/featured/preseason-update/8000-8005?build=00120138\n\n(or maybe a variant on Fleet Footwork, to get that old Stormraider's feeling)","replies":[]}]}]}]},{"poster":"PBnJelly","date":"2017-11-15T17:30:32.766+0000","up_votes":5,"down_votes":1,"body":"Does Ezreal seem to be in a fair spot after the bugfix, or do you think nerfs will still be appropriate?","replies":[{"poster":"Meddler","date":"2017-11-15T17:43:12.216+0000","up_votes":4,"down_votes":2,"body":"Not sure yet, need a bit more time to assess (it only went out late afternoon yesterday)","replies":[{"poster":"PBnJelly","date":"2017-11-15T17:51:04.876+0000","up_votes":4,"down_votes":0,"body":"I probably should've worded it better.\n\nIn your opinion, do you think this bug was the cause for him being so strong, or is Klepto still the true culprit (or even something else)?","replies":[{"poster":"Meddler","date":"2017-11-15T18:05:15.392+0000","up_votes":7,"down_votes":1,"body":"I suspect the bug was a meaningful amount of power on him. He performs much better with Klepto than most of the other keystones though, so I'd expect him to still be pretty strong using it afterwards. Will need to figure out whether, if he's still too strong, that means we should be tweaking Ez and/or Klepto (reduction in difference in effectiveness between most and least effective users?).","replies":[]}]}]}]},{"poster":"TheGreyBotanist","date":"2017-11-15T17:37:40.690+0000","up_votes":3,"down_votes":2,"body":"What are your thoughts on Marksmen who do not usually get a lot of attack speed, like Miss Fortune? Do you think they have choices as good as Press the Attack or Lethal Tempo? Those two are extremely good on champions like jinx, trist, twitch, etc. \n\nSecond Question: Do you think DFT users are struggling too much? Are there plans to add in a rune or buff those champions if they are? (Example: Rumble)","replies":[{"poster":"PBnJelly","date":"2017-11-15T17:55:42.748+0000","up_votes":5,"down_votes":0,"body":"MF with Aery is super strong (although Aery will probably get nerfed).\n\nI think most Jhins take Aery as well successfully.\n\nBoth can also take Comet and use it well because of their ability to get off random spell damage on enemies in lane (Comet might even be buffed slightly considering many people think it's weak).","replies":[{"poster":"TheGreyBotanist","date":"2017-11-15T18:13:30.180+0000","up_votes":1,"down_votes":0,"body":"Aery is good on her, yes, but as you said it's probably getting nerfed. Comet is unreliable unless jhin secures it with his W root (though the buff could help in that regard)\nCompared to a Jinx using Lethal Tempo though, Aery will get proc'd once, maybe twice if you survive that long. \nFleet Footwork would work well, especially with MF's movespeed, but it's relatively weak compared to a lot of other keystones.\n\nAnd just in general, Aery is good on anyone, lets be real. It's just that crit/attack speed marksmen have better options than Aery.","replies":[{"poster":"Sparkle","date":"2017-11-15T19:47:47.463+0000","up_votes":2,"down_votes":1,"body":"I like Comet on Jihn and MF - the Jhin traps and MF rain make it a lot easier to hit it than on non CC champs. I tried basically every keystone on them before launch (in a ton of states of Aery balance lol), but that one is/was my favorite. I wasn't really sure what path I wanted to play them in since Sorc, Dom and Prec all seemed like good options they're interested in; but after trying them that one stuck out to me as the most fun. I rearrange the other runes a ton, but as of late I've been sticking with Comet for the keystone\n\nThat being said, that's my personal preference as someone who plays like, a medium amount of both of those champions haha","replies":[{"poster":"ShadowParker","date":"2017-11-15T20:01:18.987+0000","up_votes":4,"down_votes":0,"body":"What exactly is the difference between Aery and comet? Comet just feels unreliable compared to aery so why would I ever pick on a champion that doesn't have CC?","replies":[]}]}]}]}]},{"poster":"lil thot","date":"2017-11-16T05:39:39.044+0000","up_votes":4,"down_votes":0,"body":"When is ezreal getting hotfixed? 57% win rate in plat+ while also having a 26% pick rate. ","replies":[]},{"poster":"YourSh4dow","date":"2017-11-16T06:45:17.250+0000","up_votes":3,"down_votes":0,"body":"I would like to get more indicators on runes... like 1/3 of runes dont have a way to tell if they are up and usable or not.","replies":[]},{"poster":"ZaNJeTsU","date":"2017-11-15T17:59:44.783+0000","up_votes":3,"down_votes":0,"body":"Any thoughts or news about Aatrox, after the changes he got huge drop in win rate,http://champion.gg/champion/Aatrox/Top?league=, as an Aatrox main, after preseason I felt like every other champion is stronger than me, and I felt like if I just had my old passive I won't get bursted like that, I thought of using the resolve tree, it worked, but then it's weird to use a tank tree as main tree on a fighter, then I ended up by stopping playing him wishing that you would give us his rework faster, feelsbadman {{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"ProfDrDeath","date":"2017-11-15T17:50:40.740+0000","up_votes":3,"down_votes":0,"body":"Good evening,\n\nfrom the timing of things, 7.23 is shaping up to be on the lighter side, balance-wise. Does that mean we can expect more numerous changes in 7.24?\n\nAlso, does the data show anything regarding the effectiveness of Anti-Armor options? Specifically since Runes Reforged removed the 7% total ArPen from Ferocity. Did that have an impact on tanks?","replies":[]},{"poster":"Shendelzare1","date":"2017-11-15T19:26:46.900+0000","up_votes":4,"down_votes":1,"body":"Will there be any update for LeBlanc?? {{champion:7}}","replies":[]},{"poster":"Ginjor","date":"2017-11-15T17:27:08.640+0000","up_votes":4,"down_votes":1,"body":"Are there still plans for an attack speed Doran's item that I remember reading about or was that scrapped?","replies":[]}]}