{"poster":"iBangTwins","date":"2017-07-03T16:14:39.360+0000","title":"Unfairer Perma","subforum":"Spielerverhalten & Moderation","up_votes":0,"down_votes":20,"body":"Wollte mich beschweren, wurde Permanent gebannt, weil ich Teamates gesagt habe die sollen aufh&ouml;ren zu Trollen. Ich finde das Unfair, dass ich Direkt nen Perma bekomme ohne zu beleidigen, aber nen Talon der entweder nen Troll ist oder Autist st&auml;ndig in 1 vs4 springt und feedet. Ich war nicht mal Toxic, ich habe nur gesagt das ich Reporte wenn er nicht aufh&ouml;rt. Gibt es eine M&ouml;glichkeit entbannt zu werden?. Und &uuml;berhaupt warum werde ich gebannt und diese Trolls nicht? Rito pls....\n( wenn mir einer erkl&auml;rt wie, man screens hier reinkopiert sende ich chatloggs nach um zu beweisen das ich nicht toxic war).   Spiel 1\niBangTwins: ouww bot\niBangTwins: don hu ang?\niBangTwins: open mid\niBangTwins: gj\niBangTwins: lel\niBangTwins: darius...\niBangTwins: again\niBangTwins: buy wards\niBangTwins: i report you blitz\niBangTwins: feed and then wanna surr\niBangTwins: #DARIUS STOP\niBangTwins: what ss bot you noob\niBangTwins: lanephase is over\niBangTwins: look at the map\niBangTwins: and ward your lane\niBangTwins: report darius trolling pls\niBangTwins: 9 x\niBangTwins: he do this extra\niBangTwins: never\niBangTwins: lucky that darius is op\niBangTwins: GG BLITZ\niBangTwins: GG\niBangTwins: YES YOU CAN\niBangTwins: FCKIN FGT\niBangTwins: do it\niBangTwins: gege\nSpiel 2\niBangTwins: why talon\niBangTwins: why fight 2\niBangTwins: talon u suck\niBangTwins: dont blame heca lol\niBangTwins: if u fight 2\niBangTwins: jep\niBangTwins: report talon trolling pls\niBangTwins: no you just suck\niBangTwins: you are behind and think you can win fights\niBangTwins: and we all report you\niBangTwins: and you get banned\niBangTwins: tf reported too\niBangTwins: he said he will keep feeding more\niBangTwins: for what cause you are a kid?\niBangTwins: if i got a teammate that trolls and says in chat he will keep feeding thats no reason to report?\niBangTwins: and you say childish no?\niBangTwins: lol grow up\niBangTwins: i didnt flame any word lol\niBangTwins: talon flamed after his dead cause he got no gank\niBangTwins: yeah\niBangTwins: talon enjoy your ban\niBangTwins: nothing more to say\niBangTwins: muted\niBangTwins: report him trolling\niBangTwins: u see\niBangTwins: haha sure...\niBangTwins: with 1 5 .. 1v4\niBangTwins: sure talon\niBangTwins: and you lie too\niBangTwins: what a nice charakter you have\niBangTwins: like in the game you dont get any chance in rl\niBangTwins: if you be like this\niBangTwins: y mid and top open\niBangTwins: all time\niBangTwins: its like waisted xD\niBangTwins: just let them end\niBangTwins: im there lol\niBangTwins: they wont\niBangTwins: do it kid","replies":[{"poster":"Lotuskobra","date":"2017-07-03T17:52:57.663+0000","up_votes":9,"down_votes":0,"body":"Schade, dass du hier im Forum das gleiche tun musst, wie im Spiel (was auch der Grund ist, warum du deine Strafen zu recht bekommen hast):\n\nDu musst dich wegen allem rechtfertigen, versuchst anderen Dinge zu unterstellen um selber besser dazustehen und behandelst die Personen, die mit dir schreiben, mit keinerlei Respekt. Niemand möchte in League auf einen Spieler treffen, der sich so verhält (ich bezweifle, dass du gerne Faggot, zurückgeblieben, etc. genannt werden möchtest).\n\nDu hast wie jeder andere auch dem Summoners Code und den Riot AGB's zugestimmt, in denen du dich zu Basis-Verhaltensregeln gegenüber anderen Spielern verpflichtest und hast dich daran nicht gehalten, kurzum: du hast die Regeln gebrochen und damit deine Strafe \"verdient\".\n\nWenn du daran Freude hast, beschwer dich im Forum, zeig was für einen starken und unerschütterlichen Charakter du hast, schreib anderen wie schlecht sie sind oder das sie keine Ahnung haben – aber das alles bringt deinen Account nicht zurück! Und wenn du auf deinem nächsten Account so weitermachst, wirst du auch diesen verlieren (vorausgesetzt du änderst deine Einstellung nicht).\n\nRiot hat dir mit mehreren Strafen, inklusive Accountban gezeigt, dass dein Verhalten nicht in Ordnung ist, im Forum bestätigen dir alle, dass dein Verhalten nicht angemessen ist, aber anstatt ein wenig über sich selbst nachzudenken, werden lieber alle anderen in ein schlechtes Licht gestellt – was dir wiederrum nicht weiterhilft.\n\nWenn ich du wäre, würde ich den Chatverlauf nehmen, einem Freund zeigen (muss kein LoL-Spieler sein) und ihm die abgekürzten Begriffe erklären, sofern er sie nicht kennt. Und dann frag ihn mal, ob er gerne so von einem fremden Menschen angesprochen werden möchte!\n\nWenn du dann immernoch der Meinung bist, dass du im Recht bist, die ganze Welt scheiße ist und nur du ungerecht behandelt wurdest, dann darfst du gerne in deiner Seifenblase weiterleben und auf den nächsten Permabann warten.\n\nWenn du stattdessen verstehen möchtest, was falsch läuft und wie du das ganze verbessern kannst, bist du jederzeit willkommen im Forum, damit du dich einerseits informieren kannst und so auf einem neuen Account (wenn dir noch danach ist) zu einem entspannterem und weniger flamenden Spieler wirst.\n\nMfG Lotuskobra","replies":[{"poster":"iBangTwins","date":"2017-07-03T18:18:39.175+0000","up_votes":1,"down_votes":6,"body":"Hahe es ja nen kumpel gezeigt, der zu mir gesagt hat im forum helfen die bestimmt , er war da auch aktiv und meinte auch dass mein chatverlauf kein perna wäre...anhang, habe ihn den text gezeigt er meinte ihr kennt euch sogar.","replies":[{"poster":"Lotuskobra","date":"2017-07-03T18:31:55.574+0000","up_votes":5,"down_votes":0,"body":"Und woher nimmt er diese Informationen? Warum bist du überhaupt der Meinung, dass dieser Chatverlauf keinen Permabann rechtfertigt? Ist dir klar, wie die Bannstruktur/Abfolge in League ist und was Riot damit bezweckt?\n\nHelfen tun wir dir gerne, aber wie sollen wir dass denn, wenn du einfach sagst: mein Perma ist nicht verdient und ich find das nicht in Ordnung. Niemand hier kann deine Strafe auflösen, wenn dann können wir dir nur Tipps geben, wie du dich besser verhalten kannst, weniger (am besten gar nicht) flamest und dir Grundwissen über das Bannsystem vermitteln.\n\nWenn du dafür hier bist, her mit den Fragen, dafür haben alle hier ein offenes Ohr. Wenn du dich unbedingt beschweren willst, schreib dem Support (der dich bei dem Chatverlauf ans Forum weitersenden dürfte, da die Banngründe offensichtlich sind).\n\nUnd so als Basiswissen, denn das scheinen viele nicht zu wissen: Es geht nicht vordergründig darum, wie hart der Flame ist, um einen Perma zu bekommen. Je härter man flamed, desto schneller bekommt man ihn, da man die schwächeren Strafenstufen überspringt und gleich mit einem 14 Tage Bann oder einem Perma gesegnet wird.\n\nTheoretisch kann ich also auch einen Permabann bekommen, wenn ich nach jedem Spiel ein \"EZ NOOBS\" schreibe, dafür reported werde und alle Strafenstufen abklappere, ohne mich zu ändern (10 Spiele CS, 25 Spiele CS, 14 Tagebann, Permabann).\n\nInsofern ist die Aussage, ob der Perma hierfür verdient ist oder nicht schon nicht ganz richtig gestellt. Du musst es mal so sehen:\n\nDu hast mit eventuellen Strafen, die du vorher erhalten hast von Riot gesagt bekommen, dass du etwas ändern musst. Sobald du einmal eine Strafe bekommen hast, bist du für das System ein rotes Tuch, jede weitere Verfehlung, die mehr oder weniger schwer ist und vom System erkannt wird, führt dazu, dass deine Reputation im System sinkt. Machst du aber so weiter wie zuvor, wird auf kurz oder lang der Bannhammer geschwungen.\n\nWenn du dazu inhaltliche Fragen hast, hier die offizielle Seite, die das zusammenfasst, es gibt noch eine von den Grünen Volunteers, aber deren Link hab ich grad nicht parat:\n\nhttps://support.riotgames.com/hc/de/articles/207489286-H%C3%A4ufig-gestellte-Fragen-zum-Sofort-Meldesystem\n\nKönnte gut sein, dass wir uns kennen und schonmal miteinander geschreiben haben, aber ohne Namen klingelt bei mir nix. :/","replies":[{"poster":"iBangTwins","date":"2017-07-03T18:35:32.996+0000","up_votes":1,"down_votes":5,"body":"Woher? Er hat jeden tag mit nem acc namens \"schwarzerbimbo\" alles geflammt und nie ne cs bekommen. Selbst nachdem er den acc bei ebay verkauft hat wird immernoch drauf gespielt. \n\nGibt es keine möglichkeit mehr den acc wieder zu bekommen, denn abgesehen von fggt war es nicht schlimm.","replies":[{"poster":"Lotuskobra","date":"2017-07-03T18:42:52.210+0000","up_votes":4,"down_votes":0,"body":"Wie gesagt, es geht nicht darum, wie hart du flamest, sondern dass du es überhaupt tust. Nach Vorstrafen reicht theoretisch ein \"gg ez\" um einen Perma zu bekommen. Insofern: Nein, es gibt keine Möglichkeit den Account zu bekommen.\n\nDas schwarzerbimbo der alte Trollprinz das nicht als schlimm ansieht ist mir schon klar ;)","replies":[{"poster":"iBangTwins","date":"2017-07-03T18:44:50.540+0000","up_votes":1,"down_votes":4,"body":"Der hat mich erstmal dazu angestiftet hier zu fragen, und hat mir gesagt hier bekomme ich hilfe entbannt zu werden.","replies":[{"poster":"Lotuskobra","date":"2017-07-03T18:51:39.477+0000","up_votes":3,"down_votes":0,"body":"Egal was du von anderen wo, wie und warum abseits des Forums gehört hast:\n\n1. Entbannen wegen Flame passiert in 99,999% der Fälle nicht und wenn dann musst du zum Support.\n2. Du stellst die falschen Fragen: Es geht nicht darum entbannt zu werden, sondern das eigene Verhalten zu hinterfragen und sich zu einem angenehmen Mitspieler zu entwickeln.\n3. Wir können wir hier nur helfen, wenn du mindestes Punkt 2 akzeptierst und dich danach richten willst.\n\nEgal ob ich jetzt getrollt werde oder du einem Troll zum Opfer gefallen bist:\n\nSchwarzerbimbo ist ein kleiner WItzbold, der gerne andere trollt, auf verschiedensten Accounts im Forum spamt und Magerquark anstellt und daran ne Menge Spaß hat.\n\nEntweder du bist es selbst, du hilfst ihm oder du bist das Trollopfer ;)","replies":[{"poster":"iBangTwins","date":"2017-07-03T18:57:05.866+0000","up_votes":1,"down_votes":4,"body":"Wenns eh nicht bringt dann kann man das thema zu machen, spiele mir halt nen smurf hoch.\n\nFalls es euch beruhigt, er rühmt sich damit das er hier mit sämmtlichen acc permagebanned wurde und die Moderatoren angeblich seine Ip haben .\nWie viel dran ist kann ich aber nicht sagen","replies":[{"poster":"Lotuskobra","date":"2017-07-03T18:59:49.366+0000","up_votes":4,"down_votes":0,"body":"Mich persönlich interessiert es nicht, aber jeder wie er lustig ist.\n\nEs wäre schön wenn du auf dem neuen Smurf versuchst weniger negativ zu sein und den Chat nur für positiven spielbezogenen Content nutzt, dann klappt es auch mit dem Account ;)","replies":[{"poster":"iBangTwins","date":"2017-07-03T19:14:13.125+0000","up_votes":1,"down_votes":4,"body":"Aber ich fange bei trolls immer mega an auszurasten, keine ahnung wie ich das hinbekommen soll...","replies":[{"poster":"Lotuskobra","date":"2017-07-03T19:26:46.607+0000","up_votes":5,"down_votes":0,"body":"Wenn du dich selber nicht kontrollieren kannst, dann verbiete dir in den Chat zu schreiben, generell. Du kannst deine Wut gerne an nem Kissen, was du auf den Boden haust auslassen, oder du schaffst dir nen Wutsack an (Ballon mit Sand gefüllt, den du drücken kannst, wenn du merkst, dass du sauer wirst:\n\nIch stell dir mal nen paar Regeln zusammen:\n\n1. Finger weg von der Enter-Taste\n2. Muten von anderen Flamern, sobald auch nur ein \"WHYYYYYY u...\" im Chat steht\n3. Kein Zocken (vor allem Ranked) an Tagen, an denen du schlechte Laune hast.\n4. Mach dir vllt entspannende Musik.\n5. Wutsack oder Kissen nicht vergessen.\n6. Versuch auch in schlechten Spielen Spaß zu haben und was draus mitzunehmen. Man kann nunmal nicht immer gewinnen, mal ist das eigene Team schuld, mal man selbst, mal sind es alle zusammen, so ist das eben. Versuch deine Mechanics zu üben, dein eigenes Spiel zu analysieren und die anderen ihr Ding machen zu lassen.\n\nDas sollte für den Anfang reichen. Wenn du das nen paar Wochen durchgehalten hast, dann solltest du eigentlich merken, dass es auch ohne Flame im Chat geht.","replies":[{"poster":"Homunculi","date":"2017-07-04T06:38:36.351+0000","up_votes":3,"down_votes":0,"body":"Sollte das alles nicht helfen, Reißzwecken auf die Entertaste kleben.","replies":[{"poster":"Sirrkas","date":"2017-07-04T09:37:24.450+0000","up_votes":3,"down_votes":0,"body":"Man könnte sie für das bevorstehende Spiel auch ausbauen.","replies":[{"poster":"Homunculi","date":"2017-07-04T11:05:12.713+0000","up_votes":1,"down_votes":0,"body":"Kann funktionieren, muss es aber nicht. Je nach Tastatur kann das schwerer oder leichter sein^^. \n\nBei den günstigen Modellen, hab ich die Erfahrung gemacht, lässt sich das meistens nur schwer bis gar nicht mehr wieder anbringen.","replies":[]}]}]}]},{"poster":"Undy1ng","date":"2017-07-06T05:17:50.986+0000","up_votes":1,"down_votes":1,"body":"Such dir eine Freundin lass das zocken sein und bekomme dein scheiß Leben auf die Reihe \n\n\nDu bist selber nicht die hellste Leute in lol denk mal daran \n\n\nEs ist nur ein Spiel nicht mehr und in einem Spiel muss man niemanden was beweisen sonst hast derjenige ein echt trauriges Leben","replies":[]}]}]}]}]},{"poster":"Sirrkas","date":"2017-07-03T19:00:37.032+0000","up_votes":1,"down_votes":0,"body":"Der Troll hat dich getrollt. Niemand hier kann dir helfen, dich zu entbannen. Bestenfalls kann man dir hier sagen, an wen du dich dazu wenden kannst, den Support, und dich moralisch dabei unterstützen oder sagen, wie man sich bei Tickets zu verhalten hat. \n\nBei dem Chatlog, den du oben gezeigt hast, glaube ich aber nicht, dass du entbannt wirst.","replies":[]}]}]},{"poster":"Abasin","date":"2017-07-03T18:59:58.202+0000","up_votes":3,"down_votes":0,"body":"> schwarzerbimbo\n\nDas lässt tief blicken. Schau Dir mal seine Beiträge an. Weit entfernt von positiv. Einer unserer Lieblingstrolls der letzten Monate.","replies":[{"poster":"Vogeljunges","date":"2017-07-04T06:43:06.094+0000","up_votes":1,"down_votes":0,"body":"lol... auf jeden Fall.","replies":[]}]},{"poster":"Wernicke","date":"2017-07-03T18:43:25.612+0000","up_votes":2,"down_votes":0,"body":"Doch war es. Und zwar nicht zu knapp. Erschreckend das du wirklich denkst du wärst im Recht. Da kann man nur hoffen dass das absichtliches trollen deinerseits gerade ist.\nUnd Schwarzer... ist wahrlich keine objektive Person zur Beurteilung deines Verhaltens.","replies":[{"poster":"iBangTwins","date":"2017-07-03T18:46:33.454+0000","up_votes":1,"down_votes":2,"body":"Wie gesagt, mein kumpel beleidigt JEDES GAME als autisten, faggots, lacht dir gegner nach toden aus, und wurde NIE gebannt. Selbst nach mehrmaligen inten. Das finde ich unfair.","replies":[{"poster":"Undy1ng","date":"2017-07-06T05:24:49.197+0000","up_votes":1,"down_votes":1,"body":"Dein kumpel ist einfach das beste Beispiel dafür \n\nIm Leben nichts auf die Reihe bekommen in der pause der Schule in der Ecke immer verdroschen wurde \n\n\nUnd im Netz hat er eine große Klappe und ist sich nicht bewusst mit den Konsequenzen \n\n\nOb er noch nie gebannt worden ist weiß am Ende nur rito und er selbst und ich glaube daran sowieso nicht  das sagt er am Ende nur damit andere Spieler denken reports gegen ihn bringen nix da lassen wir es gleich \n\n\nJeder Spieler der sich so verhält wie dein Kumpel wird bestraft früher oder später.... Verlass dich drauf","replies":[]}]}]},{"poster":"Undy1ng","date":"2017-07-06T05:13:24.820+0000","up_votes":1,"down_votes":1,"body":"Hör auf zu träumen Junge.   Du hast Mist gebaut Papi kann dir jetzt nicht mehr helfen zeit mal Verantwortung zu übernehmen.  In deinen chat logs sie man echt was für probleme du hast.  Komm mal klar.  Was denkst du wer du bist ey,  ein möchte gern lol Spieler der nicht ansatzweise kapiert hat wie lol funktioniert muss seinen lächerlichen skill noch dazu benutzen um anderen spielen zu sagen wie es gemacht wird,  die ganzen threds hier mit perma banns sind einfach die geilste da sieht man mal wie ganz klein die flamer werden können \n\n\nUnd nochmal das hier ist ein Forum da sind nur Spieler unterwegs zumindest 99 Prozent \n\n\nWas du tun kannst ist den Support anschreiben und höflich bleiben und fragen ob man das nicht ändern kann sollte es wirklich so sein das du direkt einen perma bekommen hast was ich aber nicht glaube.... Und falls du doch das Glück haben solltest ihn zurück zu bekommen freu dich nicht so sehr,  weil wenn ein flamer aufhören muss mit flamen ist genauso wie ein Raucher das rauchen aufhören muss, es ist nicht leicht \n\n\nUnd du kommst mir nicht so vor als würdest du die geistige Stärke dafür besitzen","replies":[]}]}]},{"poster":"TerrorRaven","date":"2017-07-04T13:30:04.982+0000","up_votes":1,"down_votes":0,"body":"iBangTwins: FCKIN FGT\n\nHomophobie -> gerechtfertigter Permabann","replies":[]}]}]},{"poster":"Käptn Snötnöt","date":"2017-07-04T02:24:49.469+0000","up_votes":3,"down_votes":0,"body":"\"talon enjoy your ban\" haha, jokes on you! xD","replies":[]},{"poster":"iBangTwins","date":"2017-07-03T16:51:20.653+0000","up_votes":1,"down_votes":7,"body":"das war kein Flame, ich habe nur gesagt sie sollen es lassen. ihr seid doch selber nicht besser ihr heuchler","replies":[{"poster":"Nycaria","date":"2017-07-03T16:54:42.496+0000","up_votes":4,"down_votes":0,"body":"> iBangTwins: GG BLITZ\niBangTwins: GG\niBangTwins: YES YOU CAN\niBangTwins: FCKIN FGT\n\nKein Flame? Als was bezeichnest du dann das? \n\nNun wir haben aber keinen Perma kassiert aufgrund von Flame, in der Hinsicht sind wir wohl doch besser ;)","replies":[]},{"poster":"Undy1ng","date":"2017-07-06T05:40:57.463+0000","up_votes":1,"down_votes":0,"body":"Nehmen wir ein Beispiel und zwar mich selbst.  Mit 18 Jahren und vor 6 Jahren zur Season 1 habe ich begonnen League zu spielen.  Es hatte nicht lange gedauert und dachte ich bin so gut ich muss mal bißchen meine Mates beleidigen.  Und siehe da der erste Ban der 2 Ban und der 3 Ban.  Ich erhielt erst 2 Tage dann eine Woche und dann noch den 14 Tage Ban.  Jetzt ist mir bewusst geworden das ich mich mal ganz schnell ändern muss.  Ich änderte mein Ganzes Leben.  Ich suchte mir eine hübsche Freundin,  hab 40 Kilo abgenommen eine tolle Arbeit gefunden und mir wurde klar beweisen muss ich mich jetzt wo anders. In der Beziehung,  auf Arbeit und mit meinem Gewicht.  Was nun in League passierte prallte einfach an mir ab.  Ich wurde so gut das ich in Season 4 Diamond wurde.  Bis heute hab ich auf meinem Main Account keine Strafe mehr bekommen.  Leider wurde ich im Forum perma gebannt mit meinem Main, aber das habe ich mit meinem Verhalten leider selber verbockt.... Aber man kann draus lernen.... \n\nJedenfalls ist es jetzt grad so das ich in letzter Zeit wieder vermehrt die Toxines der Community gesehen habe,  darauf hab ich echt kein bock grad worauf  ich grad mal bißchen Pause mache und eher abends nach der Arbeit meinen monk in diablo 3 Levle \n\n\nDu siehst hier im forum gibt's bestimmt Leute die sind nicht besser als du aber mit Sicherheit die Mehrheit ist es ","replies":[]}]},{"poster":"Wernicke","date":"2017-07-03T16:18:25.211+0000","up_votes":1,"down_votes":0,"body":"> Autist\n\nWas ist das eigentl für eine neue flamemode? Man muss diesen geistigen Dünnschiss ja vermehrt lesen zur Zeit.\nOhne chatlogs zu sehen, wette ich, dass du das auch im Spiel schon mal zu jemanden gesagt hast...\n\nEdit, um doch nochmal was beizutragen:\n\n> Und überhaupt warum werde ich gebannt und diese Trolls nicht? Rito pls....\n\njeder bekommt seine Strafe. Benehmen sich andere ebenfalls daneben werden diese auch ihre Strafe bekommen. Das Riot durchgreift weißt du nun ja selber.\nWann und wie hängt von der flame Vorgeschichte der Spieler ab (also Härtegrad, wie oft, usw...).\n\n","replies":[{"poster":"iBangTwins","date":"2017-07-03T16:35:20.736+0000","up_votes":1,"down_votes":7,"body":"auch interessant das ihr moralapostel direkt sagt verdient ohne zu wissen was los war","replies":[{"poster":"Wernicke","date":"2017-07-03T16:59:49.322+0000","up_votes":1,"down_votes":0,"body":"Das hat nix mit Moralapostel zu tun, sondern mit normalen Umgang mit anderen Menschen.\n\n> Direkt nen Perma bekomme ohne zu beleidigen\n\n*hust*\n\n> FCKIN FGT\n\nDas ist z.B. so rein gar nicht das was man unter normalen Umgang versteht. Das ist sogar ziemlich asozial und gehört auch laut Riot zu der schlimmeren Sorte flame. \nMan sollte vlt nicht halbstark jeden Blödsinn nachplappern den man im Inet sieht.","replies":[{"poster":"iBangTwins","date":"2017-07-03T17:03:14.275+0000","up_votes":1,"down_votes":9,"body":"ich bin mir im klaren das fggt ziemlich homophob ist, aber das hat gerade so Reingepasst, bei so geistig zurückgebliebenen spielern.","replies":[{"poster":"Alekra","date":"2017-07-03T17:10:06.797+0000","up_votes":2,"down_votes":0,"body":"Du bist der geistig zurückgebliebene wenn du nicht andere leute zu respektieren lernst und dich nicht selbst beherrschen kannst.","replies":[{"poster":"iBangTwins","date":"2017-07-03T17:13:59.550+0000","up_votes":1,"down_votes":7,"body":"Tz Alekra, du flammst mich reportet","replies":[{"poster":"Nazawe","date":"2017-07-03T17:33:35.204+0000","up_votes":4,"down_votes":0,"body":"Die Reife besitzt du auf jeden Fall.\nDa muss ich mir nicht mal den Chatlog ankucken um den Bann zu beurteilen.","replies":[]}]}]},{"poster":"XenesisCH","date":"2017-07-03T17:12:10.183+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=iBangTwins,realm=EUW,application-id=KYnfKGf0,discussion-id=pFkOXFLb,comment-id=0000000000030000,timestamp=2017-07-03T17:03:14.275+0000)\n>\n> ich bin mir im klaren das fggt ziemlich homophob ist, aber das hat gerade so Reingepasst, bei so geistig zurückgebliebenen spielern.\n\nBei der perfiden Logik hat der Permaban verdienterweise auch \"gerade so reingepasst\"...\n\n\nBei Homophobie gibt es Nulltoleranz genau wie bei Rassismus.\n","replies":[]}]}]},{"poster":"Pure Cynicism","date":"2017-07-03T16:44:07.832+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iBangTwins,realm=EUW,application-id=KYnfKGf0,discussion-id=pFkOXFLb,comment-id=00000000,timestamp=2017-07-03T16:35:20.736+0000)\n>\n> auch interessant das ihr moralapostel direkt sagt verdient ohne zu wissen was los war\n\nWieso, der Chatlog reicht doch. Du bist das ganze Spiel hindurch nur am Flamen. Niemand will freiwillig mit so jemandem spielen. Also fliegst du raus. Ganz einfach.","replies":[]},{"poster":"Nycaria","date":"2017-07-03T16:42:31.698+0000","up_votes":2,"down_votes":0,"body":"Es gibt zwei Möglichkeiten:\n\n1. Du hattest davor einen 14 Tage Bann und wirst eben darauf hingewiesen, dass jeder noch so kleine Flame zum Perma führen kann -> Perma berechtigt.\n\n2. Du warst richtig toxisch und hat bspw Leuten den Tod gewünscht oder ähnliches -> Sofortiger Perma ist ebenfalls verdient.\n\nBei dir wird es wohl der erste Fall gewesen sein. Was in dem Game passiert ist, spielt keine Rolle. Flame ist und bleibt unerwünscht.","replies":[]},{"poster":"zoriax","date":"2017-07-03T16:57:58.049+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=iBangTwins,realm=EUW,application-id=KYnfKGf0,discussion-id=pFkOXFLb,comment-id=00000000,timestamp=2017-07-03T16:35:20.736+0000)\n>\n> auch interessant das ihr moralapostel direkt sagt verdient ohne zu wissen was los war\n\nWir haben eine Magische Kristallkugel {{item:3112}} \n\nNein wir haben bis jetzt nur noch **NIE** jemanden gesehen,\n der uns nach einen Permabann einen Chatlog gepostet hat wo wir gesagt hätten, \n\"Riot wieso wird der gebannt?\"\n\nMal von der Negativen Stimmungsgemache abgesehen hier die Perlen die dir den Permabann eingebracht haben.\n\niBangTwins: what ss bot you noob----->Keiner möchte gern als Noob bezeichet werden.\niBangTwins: FCKIN FGT-----> Allein dafür kann man Strafstufen überspringen.\niBangTwins: report talon trolling pls----->Report Drohungen führen häufig dazu das man selbst reportet wird\niBangTwins: and you get banned---->Ironie des Schicksals\n\nTut mir leid aber Verdienter Bann in meinen Augen.","replies":[]},{"poster":"Undy1ng","date":"2017-07-06T05:45:09.766+0000","up_votes":1,"down_votes":1,"body":"Nun ja riot macht da kaum Fehler und wegen einem Learn 2 play wirst nicht gleich eine Strafe bekommen also ja wir wissen meistens vorher schon ob gerechtfertigt oder nicht,  auch deine Schreibweise zeigt uns wie geistig du in der Hinsicht flame bist","replies":[]}]}]},{"poster":"dugg","date":"2017-07-04T06:52:37.623+0000","up_votes":2,"down_votes":0,"body":"Ach IBangTwins... wenn ich deinen Chatverlauf so lese und deine Kommentare hier in diesem Thread, dann wird mir klar, dass der Ban mehr als gerechtfertigt ist. Zudem kommt halt leider fehlende Einsicht bei dir hinzu. Solltest du den Post von Lotuskobra nicht berücksichtigen, dann wird dir auch ein Smurf nichts bringen. Dieser wird ebenso schnell gebannt wie dein jetziger.","replies":[]},{"poster":"Jura500","date":"2017-07-09T03:55:52.292+0000","up_votes":1,"down_votes":0,"body":"Habs nur kurz überflogen, aber \"iBangTwins: talon enjoy your ban\" hat dann doch eine gewisse Ironie.","replies":[]},{"poster":"i3IackCat","date":"2017-07-06T10:18:08.247+0000","up_votes":1,"down_votes":0,"body":"Als Asperger Autist bin ich froh dass Leute wie du Permagebanned werden für ihre Straftaten.","replies":[]},{"poster":"XenesisCH","date":"2017-07-03T16:24:15.399+0000","up_votes":1,"down_votes":0,"body":"Dann beweise es und zeig uns dein Chatlog (Printscreen) ;-)","replies":[]},{"poster":"iBangTwins","date":"2017-07-03T16:27:10.605+0000","up_votes":1,"down_votes":2,"body":"Habe ein screen gesendet, sind 5 solcher screens, aber alle den gleichen inhalt da reicht einer","replies":[]},{"poster":"iBangTwins","date":"2017-07-03T16:25:49.153+0000","up_votes":1,"down_votes":2,"body":"[img]http://up.picr.de/29674019rt.jpg[/img]","replies":[{"poster":"iBangTwins","date":"2017-07-03T16:26:15.690+0000","up_votes":0,"down_votes":1,"body":"[img]http://up.picr.de/29674019rt.jpg[/img]","replies":[]}]}]}