{"poster":"driller5","date":"2015-06-25T10:12:40.296+0000","title":"\"Kedves\" Riot!","up_votes":1,"down_votes":5,"body":"&Uuml;dv&ouml;zl&ouml;k mindenkit! \r\nEz a forum elsősorban azt a c&eacute;lt szolg&aacute;ln&aacute;, hogy a Riot (v&eacute;gre) meghallgassa a felhaszn&aacute;l&oacute;k v&eacute;lem&eacute;ny&eacute;t azzal kapcsolatban, hogy milyennek szeretn&eacute;k a j&aacute;t&eacute;kot, illetve milyen &uacute;j&iacute;t&aacute;sokat szeretn&eacute;nek a j&aacute;t&eacute;kosok. A Riot ugyanis nem j&ouml;n r&aacute; arra hogy a j&aacute;t&eacute;kosok igenis sz&aacute;m&iacute;tanak. Unalmasabbn&aacute;l unalmasabb &uacute;j&iacute;t&aacute;sok ker&uuml;lnek be a j&aacute;t&eacute;kba, de abb&oacute;l, amit Mi, felhaszn&aacute;lok, j&aacute;t&eacute;kosok szeretn&eacute;nk abb&oacute;l semmit nem l&aacute;tunk viszont. K&eacute;rek mindenkit, hogyha van valami **&eacute;rtelmes &ouml;tlete**, hogy milyen &uacute;j&iacute;t&aacute;sok ker&uuml;lhetn&eacute;nek be a j&aacute;t&eacute;kba &iacute;rja ide. Viszont k&eacute;rek mindenkit, hogyha **van valami &ouml;tlete**, de m&aacute;r m&aacute;s le&iacute;rta, akkor **id&eacute;zze azt aki előtte le&iacute;rta** &eacute;s  &iacute;rja oda hogy egyet &eacute;rtek, hogyha a Riot esetleg ide t&eacute;ved &aacute;tl&aacute;that&oacute;bb legyen nekik. **URF KAPCSOLATOS T&Eacute;M&Aacute;K INNEN MARADJANAK KI!**  K&ouml;sz&ouml;n&ouml;m.","replies":[{"poster":"M4dr4c","date":"2015-06-25T10:19:02.003+0000","title":null,"up_votes":4,"down_votes":0,"body":"Azt várná az ember, hogy van ötleted is, azért nyitod ezt a témát így.","replies":[{"poster":"driller5","date":"2015-06-25T10:35:24.532+0000","title":null,"up_votes":1,"down_votes":0,"body":"Már írtam, csak sokáig tartott. Gondolom akkor nézeted amikor még nem voltam kész.","replies":[]}]},{"poster":"SS Enforcer","date":"2015-06-25T10:36:09.164+0000","title":null,"up_votes":2,"down_votes":0,"body":"\"Kedves\" Driller5! A Riot, mint cég nem így működik. Nem úgy működik a dolog, hogy valaki kiír a hivatalos fórumra valamit, és akkor azt akkor most implementálni kellene. A Riotnak (ahogy én látom) sok-sok kisebb-nagyobb döntést kellene meghoznia még azelőtt, hogy akár a javaslat koncepciójának első betűit is legépeljék, vagy az első vonalait is meghúzzák. Egyértelmű, hogy a játékos közösség számít, nem is kicsit, de ez nem azt jelenti, hogy vayne láthatatlanságát öt másodpercre kellene növelni mert valaki azt mondta. Nagyon erős és nagyon sok pozitív visszajelzésre van szükség egy ötlettel kapcsolatban. Plusz nagyon számít az, hogy mekkora projektről/változtatásról van szó. Most PBE-n az új HUD kapcsán végre bekerült a játékba az ulti timerek mutatása csapattársaknak. Ezt az ötletet lassan már fél éve vetették fel redditen, és sok-sok hasonló poszt készült ezzel kapcsolatban. Nem kell vele sokat szenvedni, mindenkinek megfelel, fokozza a csapatmunkát, satöbbi. És láss csodát, bekerült. Egy nagyobb mértékű változtatás, mondjuk például az AP itemizáció teljes újraírása már nagyobb falat, de látszik hogy a Riot ezen már az assassin meta óta dolgozott. Ugyan ez van a Bilgewater eventtel, és a lassan bekerülő ranked Teambuilderrel. \n\nMellesleg semmi példát nem hoztál fel a posztodban, amit végképp nem értek. Hogy lehet valaki ennyire elkötelezett egy vélemény mellett, ha nem hajlandó bizonyítani is annak tényszerűségét?","replies":[{"poster":"driller5","date":"2015-06-25T10:47:52.342+0000","title":null,"up_votes":1,"down_votes":0,"body":"Kaptam már egy visszajelzést, hogy rossz az ötletem, de ezt a topicot elsősorban azért hoztam létre, hogy (vannak már ilyen topicok) a felhasználók itt is visszajelzést tudjanak adni.  Nem azt mondtam a Riotnak, hogy LEGYEN ÍGY PONT, ez egy felvetés volt, mivel az afkolás büntetését körszerűsíteni kellene. Továbbá véleményem szerint nem kellet biznyítanom azt hogy erre szükség van, mivel mindenki veszett már játékot (akár rankedet, akár nem) afk miatt. Nem is mondtam hülyeséget szerintem, mivel nem olyansmit mondtam hogy buffolják teemot és tudjon láthatatlanság közben támadni. De ez is egy újabb hely, ahol a játékosok elmondhatják a véleményüket, és majd esetleg eljut a riothoz.","replies":[{"poster":"Szabadkőműves","date":"2015-06-25T12:03:59.019+0000","title":null,"up_votes":3,"down_votes":0,"body":"Az egész fórum egy olyan hely ahol a játékosok elmondhatják a véleményüket, sőt van legalább 100 ilyen téma, de mindenki saját témát akar nyitni mert az övé a nyerő, vagy csak nem használja a keresőt... \n\nA másik, amit M4dr4c is írt, ingyen van, jó is, meg még ajándékokat is kapunk azok is akik nem költenek.\n\nAz afk-ról annyit, hogy amióta baj van a \"szolgáltatókkal\" nagyon elszaporodtak, nekem is van olyan, hogy a játék aszongya helo te most nem mész rankedre, hiába, hogy a töltő képernyőnél tartanék, nem enged be a játék.\n\nSzerinted a Riot nem foglalkozik ezekkel? De igen, sőt a te megoldásodat is biztosan felvetették, és azonnal el is vetették... Ép ésszel stabil és kivitelezhető megoldás kell, nem egy ilyen hasravágok és csirkét eszek tejfölberántottat most azonnal...","replies":[]}]}]},{"poster":"HDaniel","date":"2015-06-25T11:22:28.512+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem pedig ha valaki kiírná  a következőket: \"i go troll, i go feed, mid or feed, get cancer, fck your mother, sister, go to die, noob, %%%%%%\" akkor instabannt kapna. A játék felismerné a mondatszerkezetet és azonnal bannolná. A szándékos feederek meg a mid or feed emberkék így eltűnnének a fenébe, így már gyakran hősválasztásnál is büntethetőek lennének, nem kellene egy már az elején vesztes meccsbe belekezdeni. Ha pedig meccs közben történne, még mindig jobb, ha az embert kidobják és ezért 4vs5 van, mintha direkt megöletné magát. Ha pedig durván káromkodna, akkor azonnali chat bannt kapna, amit a rendszer tudatna is vele.","replies":[{"poster":"Zooty","date":"2015-06-25T12:02:47.706+0000","title":null,"up_votes":3,"down_votes":0,"body":"Szóval ha azt mondom hogy: \"please Riven, don't say *get cancer*, it's offensive and make us unable to focus on the game\", akkor én is bant kapnék? \n\nA mostani rendszer is hasonlóan működik mint a te elképzelésed, csak sokkal körültekintőbb, igyekszik pontos lenni, és csak jogosan bannolni..","replies":[]},{"poster":"driller5","date":"2015-06-25T11:36:13.181+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ezzel egyetértek, és amin ezzel kapcsoltaban a probélma, hogy alapvetően kevés trágár szó van beprogramozva, amit felismer a játék. Továbbá: a játéknak  a csilagozott szavakat is fel kéne ismernie. Ezt egy olyan dolog ami egyáltalán nem lenne nagy fáradság a riot részéről. A másik az, hogy szerintem ha vki kiírja hogy \"I go feed\" az nem probléma, az a probléma, ha valaki tényleg feedel. Rangsorolt játékokba be lehetne építeni egy stat-elemzőt, ami automatikusan bünteti a játékosokat ha a rendszeresen a megfelelőn jóval alul van a statjuk. Például: 15 pontról indulsz, kill vagy assist 2 pont, halál -2 pont, sárkány a csapatban mindenkinek 5 pont, baron a csapatban mindenkinek 10 pont, objektívek mindenkinek  2 pont, győzelem mindenkinek 10 pont. 0-án alul számít rossznak. Így azért még mindig meg kell dolgozni egy rossz statért. Az, hogy ne kezdjünk vesztes meccset szintén jó ötlet. Az lenne jó ötlet szerintem, hogy a feladáshoz hasonlóan működjön (70%-nak kell igenre szavazni), és hogy egy játékos naponta egyszer indíthasson szavazást. **De ezek mind csak példák!**","replies":[{"poster":"HDaniel","date":"2015-06-25T12:03:10.946+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha egyszer beírta, hogy i go feed, az szerintem bant érdemel akkor is ha nem fog feedelni, mert fenyegeti a tárait, és rákényszeríti őket, hogy másképpen játsszanak mit ahogy megvolt beszélve. Nekünk emiatt volt egyszer hogy ezreal, aki adc lett volna, hirtelen úgy döntött hogy ő márpedig mid, de mid már másé volt.... Végül átengedték neki midet, de elcsesztük egész botot, mert szörnyen feedeltek, mivel nem volt adc-nk. Én meg hiába gankoltam.","replies":[]}]}]},{"poster":"Mind The Gap","date":"2015-06-25T11:54:12.151+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez így nem igaz. Szerettünk volna ban lehetőséget Hexakillbe. Megkaptunk? Igen. Itt volt a Csapathét, ahol sok rewardot el lehet(ett) elérni, ingyen kapsz zsákbamacska hőst, ha összekapcsolod a Facebookod a LoL-lal és ikont is szerezhetsz. Tavaly óta 3 havonta megjelenik egy új játékmód. Most is jön ez a Bilgewater stílusú ARAM pálya, mert valamilyen eventet tervez a Riot. Azért ahhoz képest, hogy nem kell pénzt kidobni ahhoz, hogy regisztrálj vagy letöltsd ezt a játékot, nagyon sok ingyen reward is szokott lenni. Mi az, hogy a Riot nem figyel oda a játékosokra? Úgy próbálják balancolni a Riotosok minden patchben(ami persze unalmas neked) a championöket, hogy az a Bronzeosoknak is megfeleljen. Nekem az lenne az ötletem, hogy tiltsák le a patch noteok alatt  a magyarok számára a komment szekciót, mert idegesít az a sok telhetetlen ember, akik mindig csak azt nézik, hogy mi nincs, és nem azt, hogy mi van. Legalábbis az angol nyelvű patch noteoknál nem ilyen formában siránkoznak.","replies":[]},{"poster":"driller5","date":"2015-06-25T10:34:02.220+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én leszek az első aki ír ide. Szerintem ez egy nagyon gyakori probléma. A rangsorolt játékokban való inaktivitás (afkolás) lenne a téma. Játszottam már nem egy rangsorolt játékot úgy, hogy hogy valaki, vagy esteleg 2 ember is kilépett. Ilyenkor az esetek 90%-ban a létszámtöbbletes csapat nyer. Szinte semmit nem lehet tenni ilyen esetekben a verseséggel szemben. De a vesztes csapat tagjai mégis elvesztik a Ligapontjaikat. Szerintem az ötletem mindenkivel szemben nagyon korrekt lenne. Íme: *amyennyiben valaki passzivitást tanúsít egy rangsorolt játékban, mi jelentjük a játékost, őt ezért megbüneteik, de mi ezzel nem leszünk előrébb. Úgy gondolom, hogyha a létszámtöbbletes csapat nyer, akkor kapja meg ami neki jár, viszont a vesztes csapat, akik kevesebben voltak ők nem vesztenének ligapontot, cask az aki kilépett, vagy a többiek csak a fele ligapontot veszítenék el, de aki kilépett ugyanúgy az egészet. Abban a szituációban, ha az a csapat nyer, akik kevesebben vannak, akkor mindenki azt kapja ami járt volna neki, kivéve az aki kilépett, mert ő veszít. De ez eddig is így volt. Ha a két csapatban ugyanannyian vannak, úgy például mindkét csapatban egy-egy ember inaktív akkor csak a két inaktív játékos legyen büntetve, a többi játékos a normál jutalmak és vereségek szerint játszon.*\n**Kérem aki egyet ért velem az a dőlt betűs részt idézze!** Köszönöm.","replies":[{"poster":"M4dr4c","date":"2015-06-25T10:37:21.336+0000","title":null,"up_votes":1,"down_votes":0,"body":"Erről már 1000x volt szó. Nem megoldható, mert visszaélésekre adna lehetőséget. Az AFK-k meg előbb-utóbb leszoknak róla vagy banolva lesznek.","replies":[{"poster":"driller5","date":"2015-06-25T10:41:50.379+0000","title":null,"up_votes":1,"down_votes":0,"body":"A visszaélésben van valami, de ha valaki afkol, és őt bannolják az nekem jó? Semmivel nem vagyok vele előrébb. Eggyel kevesebb afker. De utána jön helyette egy másik, ugyanis még mindig rengeteg ember regisztrál a lolra. Arról nem is beszélve hogy valaki több accounttal játszik. Ha az én ötletem nem is jó,igazán kéne már valami előrelépés.","replies":[{"poster":"M4dr4c","date":"2015-06-25T10:48:50.010+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez nem megoldható, amit te akarsz. Ott tényleg csak a vétkesek büntetése a megoldás, minden más esetben csak nagyobb gondot szabadítunk a nyakunkba a visszaélésekkel. Tűrni kell és majd leszoknak róla.","replies":[{"poster":"driller5","date":"2015-06-25T11:08:36.592+0000","title":null,"up_votes":1,"down_votes":0,"body":"Értem, hogy nem megoldható, amit mondok, de még annyit hozzátennék, hogy úgy goldoltam, hogy nem akkor számít afkolásnak, ha valaki a játékból 5 percet afkol, hanem amikor már a játék végén piros a neve, tehát amikor a mostani rendszer szerint is büntetik. A visszaélést pedig goldolom úgy érted, hogy valaki a  játék utolsó 2 percében kilép, és csak ő veszít a többiekkel meg jófej (pl DuoQ-ban). A másik: én nem tudom azt természetesnek venni, hogy néha (sokszor) afkolnak. A feederekről még szót sem ejtettem.","replies":[]}]}]}]}]}]}