{"poster":"Snakzilla","date":"2017-01-25T16:37:02.685+0000","title":"Ridiculously high ping in normal games after patch 7.2","subforum":"[ARCHIVED] Help & Support","up_votes":11,"down_votes":0,"body":"I play on EUW and since the new patch 7.2 came out last night I've updated my client and I've played 2 normal games. And in both of those games for some reason my ping was constantly high. My ping is usually around 50 but now I'm getting 2000+ ping and it also makes my internet laggy in general. Whatever page I try to load in the browser I use (Chrome), while in a normal game, it takes forever for that page to load.\r\nI've done an internet speed test and everything seems fine. I even went into a custom game with a friend and my ping is normal there.\r\nSo it seems that the only time I'm having any internet problems is when I play a normal game. I haven't tested my ping in a ranked game of course cause that would put my team at a disadvantage instantly if the ping issues were to happen there as well.\r\nI really don't understand what is causing this, I just know that I don't have any of these issues when I play other games.\r\n\r\nHere are links to screenshots of my games:\r\n\r\n1st normal game: https://gyazo.com/ef9a69b983e563c81486b92754f95ac2\r\n\r\n2nd normal game: https://gyazo.com/4064679ba8910fc00dd8e55b8a2358db\r\n\r\nCustom game with my friend: https://gyazo.com/d402a973a056993c79a24ef9f1818713","replies":[{"poster":"Lazypen","date":"2017-01-26T07:49:16.894+0000","up_votes":3,"down_votes":0,"body":"Patch 7.1 I was playing in 63-65 ping\nPatch 7.2 Im up to 101-112 ping\nMy log today.\nhttp://puu.sh/tAGik/f35b81422f.png\nMy Log yesterday \nhttp://puu.sh/tAGm0/f5c8b68396.png","replies":[{"poster":"Snakzilla","date":"2017-01-26T13:25:58.446+0000","up_votes":3,"down_votes":0,"body":"Riot fucked us over with this patch, you and I are not the only ones with this problem from what I saw. Yet they still tell everyone to try troubleshooting their connection as if it's our fault. They just don't want to admit their own fuck up. Hopefully they fix it somehow, soon.","replies":[{"poster":"Rotring07","date":"2017-02-01T10:22:45.090+0000","up_votes":3,"down_votes":0,"body":"exactly same problem here before week (and patch), ping 40-50 now 100-130 , i hope in fix too or just take back last updates","replies":[]},{"poster":"X Armis X","date":"2017-03-19T10:07:49.853+0000","up_votes":1,"down_votes":0,"body":"i gotta same problem since patch 7.5... and just wana ask have they fixed ur laggg issue now... or are u still lagging ? cause u had it 2 months ago... my problem just started","replies":[]}]},{"poster":"BoD Hotwolfdude","date":"2017-12-20T17:57:12.926+0000","up_votes":1,"down_votes":0,"body":"I have no idea of what could it be\nhttps://gyazo.com/056a8815424de0d493bf1c015babf033","replies":[]}]},{"poster":"xBraum","date":"2017-12-14T11:12:50.235+0000","up_votes":2,"down_votes":0,"body":"The hextech repair tool doesn't do shit. My ping every game is 500-8000 ms and its pissing me off. Riot you need to fix this issue ASAP","replies":[{"poster":"BoD Hotwolfdude","date":"2017-12-20T18:10:23.423+0000","up_votes":1,"down_votes":0,"body":"I feel you mate, the ping pisses me off the most.","replies":[]}]},{"poster":"AlAzZoUnY","date":"2017-06-24T16:51:14.479+0000","up_votes":2,"down_votes":0,"body":"when i lock in and go for loading screen , my ping was 600~ {{champion:105}} \nbut when i Alt+F4 \nand reconnect \nit go to 70 \nand i must do that in some of my games .","replies":[{"poster":"BoD Hotwolfdude","date":"2017-12-20T19:10:02.458+0000","up_votes":1,"down_votes":0,"body":"I do the same shit + i restart my laptop just in case, after that my ping goes up to a max of 400 and keeps on bouncing between 50 and 400, i get 50 while i'm dead x)","replies":[]}]},{"poster":"lemontree03","date":"2017-04-30T16:08:52.829+0000","up_votes":2,"down_votes":0,"body":"I have the same problem. I deinstalled and reinstalled all LOL, configured my router as explained.\nThan I experienced some games with my typical ping of 65 ms.\n\nBUT: Sometimes ping increases up to 2500 ms with dcs again. \n\nNo rootcause found on my PC. \nNo change with deactivated or activated Win FW (I have WIN10), no change with activated or deactivated real time virus scanner, no change w/ or w/o configured port forwarding in the router.\nPing on cmd to server is on average 58 ms,.\nPing on game load is typically 65 to 70 ms.\nPing problems started with change to WIN10 first due to unstable WLAN (fixed).\nThan again with Patch 7.2 (I think so).","replies":[]},{"poster":"DeadLy6o","date":"2017-04-02T20:07:48.810+0000","up_votes":2,"down_votes":0,"body":"SAME PROBLEM!!!!!!\n\nHAS SOMEONE FIXED IT YET????","replies":[]},{"poster":"Porocles","date":"2017-01-25T18:31:12.487+0000","up_votes":1,"down_votes":0,"body":"Yeah that ping is pretty high so there could definitely be some network issues getting in the way, or even packet loss failing to properly communicate info between yourself and the game server.  T0XIC MASTER also provided some sound advice, though I recommend running our own [log reader](https://support.riotgames.com/hc/en-us/articles/209765743-Connection-Troubleshooting-Log-Reader) instead to get an overview of your specific issue.  I think this might confirm my suspicions  so let me know what you find out!","replies":[{"poster":"Snakzilla","date":"2017-01-25T21:15:23.676+0000","up_votes":1,"down_votes":0,"body":"I chose one random log from today and here are the results:\nhttps://gyazo.com/b91c41687e26627d2a8d8dfa90a8784d","replies":[{"poster":"Porocles","date":"2017-01-25T21:50:52.622+0000","up_votes":1,"down_votes":1,"body":"Thanks!  The logs that would best work for this are the ones or days you experiences the issue.  This log helps a lot, and paints some more context.  It does look like you've got some pretty severe connection problems to our game servers resulting in a lot of unsteadiness.  I recommend going through every step of the [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to strengthen your connection and get that red line more balanced.  I hope that helps!","replies":[{"poster":"Snakzilla","date":"2017-01-26T14:16:46.000+0000","up_votes":2,"down_votes":0,"body":"I've tried everything and it's not working. I don't mean to be rude and I know you more than likely have nothing to do with patches or anything like that, but you guys at Riot really did it this time. I've asked plenty of people in games vs bots where I was testing my ping and a few of them had the same issue since patch 7.2 came out. There are even a couple posts just like mine here on the boards that are saying the same thing, I'm sure even more people are experiencing this problem but they're just not talking about it for whatever reason. I mean on my post alone there's 3 people saying they have the same issue. Could you please stop pretending that this is our own fault, that our connection sucks and stuff like that and instead address the issue at hand. Nothing like this has ever happened to me before and I know that it's not on my end because like I said this started happening right after the patch and my connection is working fine in any other game that I play","replies":[{"poster":"KaffeDiva","date":"2017-07-14T10:09:51.873+0000","up_votes":1,"down_votes":0,"body":"everything you say is so so true...","replies":[]}]},{"poster":"Astartex","date":"2017-01-26T13:34:52.927+0000","up_votes":2,"down_votes":0,"body":"I tried to run your advice but does not work. My ping is so high that I can not play a normal game, the other players  blame me without understanding that is just the game that lags and now leave buster put me in a low priority queue because of the continuous disconnections. PLs send help...","replies":[{"poster":"Porocles","date":"2017-01-26T17:20:55.376+0000","up_votes":1,"down_votes":1,"body":"We'd like to continue helping you out individually through a [support ticket](https://support.riotgames.com/hc/en-us/requests/new).  Grab our [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) to obtain some logs for our tech team to look at, and attach it to your ticket.  We'll reply back a soon as we can.","replies":[{"poster":"KaffeDiva","date":"2017-07-14T10:11:58.852+0000","up_votes":1,"down_votes":0,"body":"BRo its not working! i send a friend over wich knows alot about pcs, he might discover something il let u know if its my either wrong with something installed league, or just my computer","replies":[]},{"poster":"Snakzilla","date":"2017-01-27T12:34:31.462+0000","up_votes":1,"down_votes":0,"body":"I've submitted a support ticket and downloaded hextech repair tool, when my support ticket was answered I got a reply with the link that takes you to Riot's troubleshooting page, again. So I decided to try forcing my client to repatch which seems like it has solved my ping issues tho my ping is a bit higher than what it used to be. I've played one game so far and it ranged from 45-60 ms. I was feeling skeptic about it at first, I thought the forced repatching wouldn't fix the problem but it seemingly has fixed it, tho at times the game felt a bit clunky as if my abilities weren't going off when I was trying to use them. Anyway here are a couple of network log screenshots from that one game I've played since using the HRT.\n\nhttps://gyazo.com/0a92b2e11779f5005cf01fd7a889bddb\n\nhttps://gyazo.com/c8c60bc43ced0321c96b055a17541ea0","replies":[]},{"poster":"Snakzilla","date":"2017-01-26T17:56:51.025+0000","up_votes":1,"down_votes":0,"body":"I'll give it a shot, I guess I have nothing to lose.","replies":[]}]}]}]}]},{"poster":"Snakzilla","date":"2017-01-25T20:30:21.501+0000","up_votes":1,"down_votes":0,"body":"I forgot to mention I've also tried pinging EUW server by doing the following:\n\nPress the windows key + R(to open the Run menu)\n\nType in \"cmd\" and press enter.\n\nCopy and paste this into the black window using right click and press enter.\nping 104.160.141.3 -t\n\nMy ping averaged at around 30ms, I don't know if that piece of information helps but I just wanted to let you know.","replies":[]},{"poster":"Snakzilla","date":"2017-01-25T20:16:46.710+0000","up_votes":1,"down_votes":0,"body":"I just checked and there are a lot of network logs and I don't know which one to choose. Can I somehow upload the entire folder? What should I do?","replies":[]}]},{"poster":"T0XIC MASTER","date":"2017-01-25T16:46:15.774+0000","up_votes":2,"down_votes":0,"body":"after I updated this new crappy client I was playing in teleport mode. ggwp RITO","replies":[{"poster":"Porocles","date":"2017-01-25T18:32:08.275+0000","up_votes":1,"down_votes":0,"body":"Not really sure what you mean by this.  Can you provide some more specifics and details on your specific issue?  Happy to help!","replies":[{"poster":"WastedBarfer","date":"2017-09-01T09:01:57.112+0000","up_votes":1,"down_votes":0,"body":"I think he was saying like the champion wasn't moving. like, moving turret to turret. it happens to me sometimes. I'm walking (for example) to bot lane, and I clicked on the minimap to the last turret. and then, the video freezes, and I'm standing in base. then I click again to move, BAM, my champion is near the turret. and I need to say, your servers are getting weaker for the amount of players. League of Legends is growing up everyday. so please, I know it's hard, but your fellow players ask you to improve your servers. I'm seeing the difference now. I played with 47ms, now it's 51ms. I mean, it's not a HUGE difference, but still.","replies":[]}]}]},{"poster":"flipskyhit","date":"2017-12-26T15:20:04.540+0000","up_votes":1,"down_votes":0,"body":"I play on EU West and since yesterday I got high ping of 460 - 480 ms consistent and in between server time out also occurs. Same I checked with my internet and it will show 12 - 15 ms around. So please provide any update or fix this issue any how. I wouldn't able to play ARURF since 2 days in row.\nThough I love to play this mode and I can't able to play because of this high ping.\nKindly resolve this issue, if possible by today.\n{{summoner:4}}","replies":[]},{"poster":"TommyFengster","date":"2017-08-18T03:00:01.777+0000","up_votes":1,"down_votes":0,"body":"Alot of players in NA server  are really lucky  with 23 ms ave.  and they call 70-120 ms LAG. I normally have a average ping aroung 76 ms yes i am from the Caribbean if u asked. My highest ping record was just today when this comment was posted  10900+ ms, the spike didnt only just spiked and gone it stayed at around 3400 ms for like a minute or 2. It was crazy. and later when my screen says \"trying to reconnect\" ( We all know that annoying pop-up{{sticker:slayer-jinx-wink}} ). I left and reconnected.\n\nWhen i lag i lag around 340 ms.  Ping spikes and lags are quiet frequent during this update ( patch 7.16 I am new so i don't know any in the past).  But holy Jeeeznuts. We all know what happens after{{item:3340}}s : \n1.Spamming \"LAG,OMG\", \"LAG,300ping\" in chat \n2. Shouts or start hitting stuff  ( for the aggresive types)\n3. Cries or lay down on the bed or bench ( for the softer types}\n4.Or just like me stare at the screen like: 0.o WUT WTF??!!!! \n5.........NAME ONE URSELF\n\n\nEDIT: ow and i did disconnect alot during the patch 6.>< to patch 7.><\nLAG cost me 2 laptopts 16 keyboards 4 monitors and prob the same amount of mouses as cowsep smashed ;-)\n","replies":[{"poster":"BoD Hotwolfdude","date":"2017-12-20T19:06:17.831+0000","up_votes":1,"down_votes":0,"body":"You still havent beated my ping record which is a bit over 16k.\nWhen i lag i lag at +400 ping, my pings moving from 51 (normally) up to 400 then proceeds to move between 270 and 4k. But not in every game.\nSome games (like 1 out of 3) run smoothly, i usually get high ping like this at 11:00, 12:00, 14:00, 16:00 EST and then again every hour. And it keeps going on like that, every SINGLE FRICKING DAY.\n\nI am from Slovenia and i get lower ping on EUW (lowest 49) than on EUNE(lowest 90). If you play {{champion:64}} a lot, you know how much of a difference is 40 ms.\n\nP.S. The new client looks neat, but it's bs, it makes me lag from 2 up to 5x harder than in 2k14. #KMS #TyRITO\nI'd reather have a game where you could see every pixel and have a smooth gameplay than this shit. {{summoner:6}}","replies":[]}]},{"poster":"BoD Hotwolfdude","date":"2017-12-20T18:03:21.911+0000","up_votes":1,"down_votes":0,"body":"Wake me up wake me up inside\ncan't wake up wake me up inside\nSAVE ME\nhttps://gyazo.com/033d1a3a41ec9b9e401608bd66ebd497","replies":[{"poster":"BoD Hotwolfdude","date":"2017-12-20T18:05:43.753+0000","up_votes":1,"down_votes":0,"body":"RITO fix yo damn game :c","replies":[]}]},{"poster":"xamileon","date":"2017-10-25T06:06:31.799+0000","up_votes":1,"down_votes":0,"body":"patch 7.1 fine patch 7.2 ms jump from 63 to 1200 k sometime i get 3 disconnect per game i have stop play rift 5v5 because some players star flames right now i play only aram bud the ms jump many times like mario brothers","replies":[]},{"poster":"GasHs mama","date":"2017-09-09T05:53:23.748+0000","up_votes":1,"down_votes":0,"body":"I am havin the same issue I play in NA my ping is 369 these days #ReportRiot","replies":[]},{"poster":"Xx Itz Alex xX","date":"2017-08-03T21:05:20.284+0000","up_votes":1,"down_votes":0,"body":"my ping normally - 20\nthe last week - 500+","replies":[]},{"poster":"KaffeDiva","date":"2017-07-14T10:03:36.670+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Snakzilla,realm=EUW,application-id=osqw6G4M,discussion-id=LQsEHjZc,comment-id=,timestamp=2017-01-25T16:37:02.685+0000)\n>\n> I play on EUW and since the new patch 7.2 came out last night I&amp;#039;ve updated my client and I&amp;#039;ve played 2 normal games. And in both of those games for some reason my ping was constantly high. My ping is usually around 50 but now I&amp;#039;m getting 2000+ ping and it also makes my internet laggy in general. Whatever page I try to load in the browser I use (Chrome), while in a normal game, it takes forever for that page to load.\n> I&amp;#039;ve done an internet speed test and everything seems fine. I even went into a custom game with a friend and my ping is normal there.\n> So it seems that the only time I&amp;#039;m having any internet problems is when I play a normal game. I haven&amp;#039;t tested my ping in a ranked game of course cause that would put my team at a disadvantage instantly if the ping issues were to happen there as well.\n> I really don&amp;#039;t understand what is causing this, I just know that I don&amp;#039;t have any of these issues when I play other games.\n> \n> Here are links to screenshots of my games:\n> \n> 1st normal game: https://gyazo.com/ef9a69b983e563c81486b92754f95ac2\n> \n> 2nd normal game: https://gyazo.com/4064679ba8910fc00dd8e55b8a2358db\n> \n> Custom game with my friend: https://gyazo.com/d402a973a056993c79a24ef9f1818713\n\nEverything you say, is the same with me. only in league i get this mad ping boost. i have no clue at all what do do either. but your not alone","replies":[]},{"poster":"kinslayer7king","date":"2017-07-05T13:01:55.751+0000","up_votes":1,"down_votes":0,"body":"same problem here i used to have 74 ms ping \nnow its 200 ms \nother online games have a normal ping \nand my internet has no packet loss","replies":[]},{"poster":"bish33","date":"2017-06-24T07:04:27.179+0000","up_votes":1,"down_votes":0,"body":"well i have no choice now just to uninstall the game cos i cant play this game too much laggs and fps drop BB League Of legends","replies":[]},{"poster":"CheesePlaysGames","date":"2017-05-18T19:11:24.384+0000","up_votes":1,"down_votes":0,"body":"Having exactly the same problem on the new patch and new client that's been rolled out, very annoying as I'm trying to get back into League after burning out from ranked frustration, now going to get put off again by ping problems.\n\nSpeedtest ping - highest is 53ms\nLoL ping - 600, average 350\nSwitch tabs open speedtest during game - ping 53 highest.\n\nSo what's going on there? Keeping in mind I used to be living the dream at 21ms ping in League on the old client...","replies":[]},{"poster":"No Kills No Fun","date":"2017-04-20T21:18:49.957+0000","up_votes":1,"down_votes":0,"body":"I've just started experiencing this problem recently. I always play ARAM to see if my ping is ok. It is, but just when I start ranked game it doesn't do under 1k all game sometimes.. EUNE","replies":[]},{"poster":"Sieg Fiend","date":"2017-04-08T22:35:03.822+0000","up_votes":1,"down_votes":0,"body":"i have same problem here i start with 50 ping after 4 mins in game it rises to 4K ping","replies":[]},{"poster":"Slivko","date":"2017-02-09T21:29:25.253+0000","up_votes":1,"down_votes":0,"body":"I think patch 7.3 already came out and I still have the same problems with the ping since this started ocurring after 7.2 I´ve tried customs by myself at least once per day and the ping is still ridiculous riot I respect what you guys are doing and some people might comment a little bit \"offensivly\" but I also see theyre point I cant play with friends and I´ve put a lot of money in skins and I´ve also tried a lot of things from Hextech Repair tool to even completly install the game all over again deleting all files and istall all over again and it didnt fix it. Riot plz do something. Thanks for reading. PS I cant garantee that the problem is in my end with the bad weather and all Im form Portugal EU West.","replies":[{"poster":"X Armis X","date":"2017-03-19T10:08:44.353+0000","up_votes":1,"down_votes":0,"body":"i gotta same problem since patch 7.5... and just wana ask have they fixed ur laggg issue now... or are u still lagging ? cause u had it 2 months ago... my problem just started","replies":[]}]},{"poster":"Slivko","date":"2017-02-10T15:24:35.238+0000","up_votes":1,"down_votes":0,"body":"Appparently the servers are overloaded I tried to login today and was put into queue in the login","replies":[]},{"poster":"Lazypen","date":"2017-01-26T19:05:05.239+0000","up_votes":1,"down_votes":0,"body":"Well after a small update last night my ping was back to normal.","replies":[]},{"poster":"Snakzilla","date":"2017-01-26T15:28:17.031+0000","up_votes":1,"down_votes":0,"body":"I don't know if this will be useful information but I'll give it a try.\n\nCountry: Croatia\n\nISP: Optika Kabel TV d.o.o.\n\nHere's the link to the Tracert file I've gathered following the steps from your support page:\nhttps://drive.google.com/open?id=0B9av4zRGNgy4TkpUMTdBU09acHc\n\nIn case you don't trust the link or whatever, here's the screenshot of the same file: https://gyazo.com/84e4cff94097237f9e94870dffa73ced","replies":[]}]}