{"poster":"Elvarius","date":"2015-02-28T04:27:07.919+0000","title":"New to Leauge, need some advice.","subforum":"Tips & Tricks","up_votes":3,"down_votes":0,"body":"Hello, a few days ago I decided to pick up League of Legends with the intent of eventually mastering it. I've been researching, learning lanes, trying the free champions, and watching videos/streams to learn from. So far I've picked up how to Mid while roaming and ganking, playing top lane, APC and ADC. I've been mostly playing Ashe and Garen and recently bought Annie. My question is what would be the best way to continue progressing in the game? Also, I have a bit of IP saved up and about 400 riot points, what champ would you suggest I buy next? Thanks in advance :)","replies":[{"poster":"Pucking Purrfect","date":"2015-02-28T04:43:43.923+0000","up_votes":5,"down_votes":0,"body":"Save your IP because you are going to need it for tier 3 runes. Farm til lvl 15 with bots I mean Co-op vs Al then start playing PVP. If you can spend real money you can buy RP so you can get champions, skins etc. but if you can't don't worry this game is free to play after all. Thanks to weekly free champion rotation you can try champions and if you like any of them you can buy it with IP or RP.\n\n\nCheck these links out.\n\nhttp://forums.na.leagueoflegends.com/board/showthread.php?t=2154005\n\nhttp://forums.na.leagueoflegends.com/board/showthread.php?t=4311756\n\nAlso, you can get more information from\n\nhttp://www.mobafire.com/\nhttp://www.lolking.net/\nhttp://www.solomid.net/","replies":[{"poster":"Zmuecat","date":"2015-02-28T04:59:24.484+0000","up_votes":1,"down_votes":0,"body":"This is a good place to start.\n\nAlso, go into custom games and practice last hitting on champions you want to play. Only takes about 10 minutes, try to get as close to 100 as you can.\n\nDoing this once a day for awhile, especially before playing, should get you at a fairly good level where buying items is easier. This is a problem a lot of players have, and it's best to start now.","replies":[]}]},{"poster":"Raja Chachki","date":"2015-02-28T05:18:47.853+0000","up_votes":3,"down_votes":0,"body":"Learn how to CS(creep score) by getting the last hit on minions, it is MUCH more important than kills unless the kills are being spoon-fed to you. Learn general builds to ADCs, mages, tanks, and the like that you can work around. Remember about dragon and baron, they are always very important, but I'm not sure if you have the teamwork to do them at your lvl(most people are VERY stupid when beginning the game). If you begin to learn a champion, make sure you learn their abilities, your champion's weaknesses and strengths, remember their passive. TRINKETS ARE IMPORTANT. At your lvl, many people(lvl 1-15) won't even think about the trinket, but it gives you free wards. Place wards around your lane, usually in bushes. \n\nThere is a TON to learn about this game, it is practically impossible to know everything even when playing for a year. I have been playing for almost a year, and I only really started doing well about 2 months ago. Remember this when playing the game, there is a lot that you think you know, but this game is VERY COMPLEX, there is so much to learn. Make sure to skim the boards every few days, look up guides. Oh and watch youtubers or streamers. A good youtuber I know is Tekk(small channel that posts Challenger videos from the likes of OddOne and Sneaky, who are pro players). this really helped me learn the game, I hope you stay with League, it is a very interesting game :)","replies":[]},{"poster":"Shiroi Kitsune","date":"2015-02-28T04:53:54.422+0000","up_votes":2,"down_votes":0,"body":"I would say that experience is the best teacher.  I would recommend just playing as researching only gets you so far.  Try to transition to normal PvP as soon as possible, so you don't become too conditioned to the way that bots play (humans are much more unpredictable).","replies":[]},{"poster":"xxTakeda01xx","date":"2015-03-01T01:39:10.679+0000","up_votes":1,"down_votes":0,"body":"My suggestion would be first to figure out what type of characters you like to play. me personally, i like playing characters that have a decent AOE, like Karma, Morgana, and Nasus. I also like playing a few random characters like Nautilis, Ashe, and Riven. Find out what works best for you when it comes to buying a character. The free rotation characters a re a really good place to start, but after a while your going to realize that there are some characters that don't rotate nearly as much as others. \n\nOnce you have an idea on what your looking for, do a little research. Personally i like to watch the Champion Spotlight on them to get an idea of things like moves, builds, strategies, etc. You can also use mobafire.com when you've gotten a character that you want to expand with to learn different builds and get a better idea on what works best for that character.\n\nAs far as getting better, fortunately from what I've learned and seen, the biggest curve comes from the characters. Learn the characters that you play, then learn what characters counter yours. This will give you the biggest advantage when and if someone tries to counter pick you in a game.\n\nNext is to find people that compliment you and your play style as well as you complimenting theirs. This is a team game, and if there is even one person that doesn't help the team then it makes things much harder. Find players that like to have a good time. understand that there are bad games, and that communicate. Communication is key in a game like this. Learn how to call Barron, how many enemy's in lane, who they are, when, who, and when to take buffs. When to push, when to cover, ward, gank, support etc, etc. The list continues. Only then will you really start to see how great this game can really be.\n\nand\n\nFinally, Learn to let go. Ive played plenty of matches, like today. I know how to play Nautilis in such a way that it compliments my personal play style. But for some reason, i was having a terrible game. No matter how much you practice, there will still be games when it just seems like nothing comes together for you the way you want it to. It happens. Just remember that it is only a game, and the point of playing a game is to have fun. Be kind, be friendly, and have fun.\n\nI hope this helps. And please, by no means think that i am a pro of some kind because im not. But i do understand the value of team work, and ive played with enough great players out there to learn exactly what your trying to learn. Ive played local tournaments in my area and ive played in other eSoprts games online and the lessons are always the same. I hope that this helped at least a little, and if you have any other questions please feel free to ask and ill do everything i can to answer to the best of my ability. \n\nxxTakeda01xx","replies":[]},{"poster":"freeformline","date":"2015-02-28T22:23:18.316+0000","up_votes":1,"down_votes":0,"body":"I like what Hudson Gaga said a lot. Focus on last-hitting well and staying alive and you'll do better than many of your opponents by simply having more gold and experience than them.\n\nYou clearly already know that the Tips and Tricks board is a fair resource to use, and I recommend you take a look at the top and pinned posts that have been put on here. [This](http://boards.na.leagueoflegends.com/en/c/tips-tricks/64VFYEZy-a-guide-to-understanding-the-dynamics-of-bot-lane) is a very good guide to look at once you have the basics down or if you want to learn a bit about supporting. Those basics are, of course: Farming minions (last-hitting gets you gold, attacking otherwise does not), capturing objectives (towers win games, Dragon and Baron help you capture towers, killing an opponent keeps them from defending objectives), staying alive (if you are dead, you cannot gain gold or experience from fights or farming, and cannot challenge objectives), and warding well (warding is a team effort, everyone should upgrade their trinkets, aim for at least twenty wards placed per game). It sounds like you have a will to learn and the drive to actually seek out information, so I'm sure you will do fine on this point.\n\nRight now, you should be looking out for champions you enjoy playing or feel a connection with. Play as many of the free week champions as you can and try different builds until you are happy with a healthy selection of champions, ideally in a variety of roles. The [League Wiki](http://leagueoflegends.wikia.com/wiki/League_of_Legends_Wiki) is an excellent resource for learning about the mathematics of League and the details of different champions and items. It also contains some helpful tips for playing with or against each champion. I recommend using it to learn about the workings of each champion statistic, as there are some subtlties that trip up a lot of new players (hard attack speed cap, soft move speed cap, why resistance is generally preferable to health, why ADCs build armor penetration, which gold item to use on your support in different situations).\n\nMy favorite tips to tell new players are: Focus on keeping yourself alive and challenging objectives rather than accumulating kills. Kills are inherently risky and time consuming, and while they should be taken if the opportunity presents itself, they should hold second priority to objectives. Don't go into fights or challenge objectives when you are not sure you can take them and get out safely, and do not chase into the fog of war unless you are certain of where your target's allies are. Learn to use pings effectively. They are tied to the little exclamation marks on your minimap and to several hot keys worth looking up (I've relegated this knowledge to muscle memory, so I'm actually not sure which combination of keys to use for pinging). Try to develop good map awareness, knowing where your enemies and allies are at all times, knowing where minion waves are and which direction they are pushing in, when Dragon will be up, what your enemies are building, and which of them is the biggest threat. Placing wards can help you immeasurably, but only if you actually look at your minimap to see what they reveal. If you see something important, it is generally worth pinging on the map to make sure your allies see it as well.\n\nI'm not an expert, but I'm happy to help teach you and other new players learn to play the game. I have a low-level account (below level ten) that I use to play with new players without pitting them against people of my level (I usually play things I'm not good at when doing this, to keep things fair). If you'd like, feel free to add me and we can play some time! I'm an unranked support main with some experience in each role and a vision fetish. I use Curse Voice for team calls.","replies":[]},{"poster":"Sirsir","date":"2015-02-28T21:28:41.434+0000","up_votes":1,"down_votes":0,"body":"Don't really buy champs unless you REALLY REALLY sync with them, play your way through all the free rotations first. You need the IP for runes\n\nDon't buy tier 1-2 runes, they are a waste. Maybe pick up the T2 armor ones for jungle practice but I wouldn't recommend it.\n\nOnce you hit level 20 pick up Flat Armor seals, and MR/level glyphs, those go on most pages, especially the armor ones. I suggest building your basic AD page first, since its not useless on anyone. Unless by the time you get there you find you love mages, then start with AP.\n\nOne thing you can do is spend that RP on IP per win boosts once you start playing PvP matches. Alternatively you can save it for a skin since you will eventually be able to get all the IP purchasables anyway. \n\nFor Exp, grind ARAMs, for IP, stick to PvP.","replies":[]},{"poster":"FedAsFuk","date":"2015-02-28T20:56:50.796+0000","up_votes":1,"down_votes":0,"body":"Personally I recommend NOT using Rp for champs, after all you get the IP for them rather quickly just by playing. Save RP for skins you want, maybe a champ you really want right then if it happens to go on sale.","replies":[]},{"poster":"Nick Valentine","date":"2015-02-28T18:43:20.096+0000","up_votes":1,"down_votes":0,"body":"Honestly, if you just click on the chat box and drag it off the screen, you'll stop feeling pressure to improve faster than you can. This is important, you're not going to get better in a day or even a week. Heck for the first 3 months I didn't know how to CD as Ashe.","replies":[]},{"poster":"Space Bum","date":"2015-02-28T15:27:01.495+0000","up_votes":1,"down_votes":0,"body":"You can add me If you want. Been playing since 2010.","replies":[]},{"poster":"KingHarald","date":"2015-02-28T10:48:29.107+0000","up_votes":1,"down_votes":0,"body":"Buy Garen, Ashe, Sivir, Volibear, Ryze, Fizz, and Heimerdinger.\n\nDo not buy Master Yi, Teemo\n\nDo not randomly assign runes or mastery pages: to to lolking.net and find a guide on which ones to choose.\n\nKnow that many players are rude, hateful, and offensive. Know how to temporarily mute them.\n\nOnly one set of boots per game.\n\nMovement Speed Quints are almost always best for beginners.","replies":[]},{"poster":"Elvarius","date":"2015-02-28T09:40:02.260+0000","up_votes":1,"down_votes":0,"body":"Thank you so much everyone for the support and feedback, I'll take everything into consideration and keep trying to improve.","replies":[]},{"poster":"sealust","date":"2015-02-28T07:43:59.073+0000","up_votes":1,"down_votes":0,"body":"I would actually save your IP until you hit lvl 20 so you can buy your T3 runes. They're a huge IP suck and are stupidly necessary for early game in PvP. \n\nAs for champs, I would keep a running list of champs you like to play and start buying them after you get at least one full rune page.","replies":[]},{"poster":"Sirin Gioro","date":"2015-02-28T05:09:31.765+0000","up_votes":1,"down_votes":0,"body":"I wouldn't buy RP yet if I were you, because if I don't like the game I can just uninstall without feeling like \"omg I spent $10 on this game >_>\"\nI think you should play PvP as soon as it's unlocked, and don't get discouraged if you keep losing, because you will (oops).\n\nFor free champions and skins,\nOfficial Free Riot Girl Tristana skin > https://www.facebook.com/leagueoflegends/app_208195102528120\nOfficial Free Unchained Alistar skin > http://youtube.na.leagueoflegends.com/en/youtube/\nOfficial Free Dreadknight Garen skin > http://woobox.com/scrx56\nYou get the champion and the skin.","replies":[]},{"poster":"OhOkYeah","date":"2015-02-28T05:04:31.162+0000","up_votes":1,"down_votes":0,"body":"Honestly, hold off on buying any more champs unless there's another 450ip champ you really like. Simply because you might buy a more expensive champ, then play one of the free ones the next week that you like even more than that one and wish you had the IP back. Also, it's better to save for runes. Tier 3 marks/glyphs/seals for one AD generic page, and one generic AP page. The quints are really expensive so you can use t2 quints until you build up your champion roster. \n\nIf you do this, you'll have two good rune pages and plenty of IP left over to buy champs before hitting 30. Also, stay out of the jungle until you're at least level 25. It's very discouraging because it's quite hard on most champs. If you really want to learn it, get warwick for 450 ip(mastery yi can do it at level 20 too but warwick is better). But even at level 20 with tier 3 runes, the jungle will be discouraging because of it's difficulty. It's amazing how much of a difference it makes at level 30 with full rune page and full masteries for jungling. \n\nThe 400 riot points can be used for whatever you want really. You can wait for a 3150 champ to go on sale, which is probably the best choice since getting IP takes a long time. That or get a skin. I used mine on XP boosts because I had a whole day with nothing else to do and leveling takes forever.","replies":[]},{"poster":"The Chin","date":"2015-02-28T04:58:36.606+0000","up_votes":1,"down_votes":0,"body":"Get warwick and learn to jungle with him {{champion:19}}","replies":[]},{"poster":"fdissht","date":"2015-02-28T04:56:08.910+0000","up_votes":1,"down_votes":0,"body":"The links you were provided with basically sums everything up.\n-Don't rush it, while it'd be nice to be able to master a game straight away, it's quite difficult; especially for a moba game. A key part of MOBA games is know what champion does what, so that means remembering over a hundred champions, their skills, and their interactions with other champions. \n-As stated in the link, mistakes happen, you will get flamed or raged at. Take it calmly and either try to not let it bother you, or try to find some sense in their displeasure (could I've helped? was I over extended? was my map awareness poor?)\n\nTry many things out, make mistakes, and enjoy the game.","replies":[]},{"poster":"Xemeron","date":"2015-02-28T15:54:14.394+0000","up_votes":1,"down_votes":4,"body":"Deinstall the game and run as far away from it as you can, while you still can.","replies":[]}]}