{"poster":"Gli","date":"2016-12-03T05:53:07.165+0000","title":"Recent Ping Spike","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So recently in the past few days I've been getting higher ping than usual. Since the server change I've had a consistent 70-73 ping, but as of just a few days ago I'm getting a steady 93. Earlier my in game connection dropped (nothing else on my computer lost connection, I was in a skype call with perfect connection and check my web browser during the disconnect to see) and when it reconnected me I suddenly had 85 ping until 5 minutes later and it was back to 93, and has been since then.  I've checked everything I possibly can and have restarted my internet and client multiple times. I'm not sure if the ping spike happened before my few day break from the game, but as of sometime between the 25th and 30th of November I've just been getting this lag. \r\n\r\nI don't know if this is something on Riot's end, or if it is because of the new client or something, I remember there being some patching error as I switched to the new client a few weeks back, but can't remember the details on that. I'm not sure if switching back to the old client would help or not, and that would just be a temporary fix to a possibly long term problem depending on what the cause of this issue really is.\r\n\r\nAny help would be greatly appreciated, as with the new ranked season coming soon, I'd like to be able to play with my normal ping.","replies":[{"poster":"Targons Blade","date":"2016-12-07T00:31:19.207+0000","up_votes":1,"down_votes":0,"body":"Latency (ping) issues are often influenced by changes in your ISP routing to the League servers and can affect your latency specifically for League while other games or services are unaffected. I'd recommend working through our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to ensure all local network settings are compatible before we investigate further.\n\nLet me know if those steps caused any change.","replies":[]}]}