{"poster":"Lord SilentEcho","date":"2018-09-06T06:24:50.739+0000","title":"The Cosmic Court","subforum":"FanFiction","up_votes":2,"down_votes":1,"body":"&quot;The Cosmic Court in all infinite glory and might has never faced an evil quite like this&quot; states the stoic Defender Xin Zhoa addressing the court of the Queen of the Cosmos, Ashe.\r\nAshe who is beloved by her subjects ponders about this Dark Star threat that has been plaguing the universe she looks around her council to gauge what response she would take. Kassadin Cosmic Reaver of the court usually is always tasked with the most dangerous of assignments of infiltration is complimenting a plan of attack, meditating in the corner the wise Master Yi the Blade of the Cosmic Court, at home on the battle field as much as the palace garden where he meditates frequently. The Dawn and Dusk of the court are performing for all to see, Rakan dancing and prancing about basking in all the attention with his counter part Xayah putting on a display of deadly pin point knife skills between his movements stunning all that is around until Rakan was turned into random woodland creatues of the surface worlds by their ever playful but equally painful to deal with Enchantress Lulu.\r\nThe Queen say how much action needed to be taking against the Dark Star forces encroaching into her lands lead by the first Dark Star Thresh, who is know to heaven the Stars and absorb their light. Each of these Dark Stars posses a unique threat all to them self, Varus pierces the cores of stars, Cho&#039;Gath with his infinite hungry consumes anything and everything in his path, Khazix always hunting for the ever elusive Kassadin that was seems to shift just out of the reach of his claws, Orianna moving the stars to meet her whims causing untold havoc and Jarvin IV mighty enough to crush the stars themselves.\r\nShe rallied her forces and prepared for this fight that will redefine the very universe itself, she hoped her forces would prevail...but what stars were going to be extinguished weighed heavy on her shoulders...","replies":[]}