{"poster":"Mobius One","date":"2019-02-11T01:41:24.050+0000","title":"¿Banean por decir \"qlo\"?","subforum":"Comportamiento del jugador","up_votes":6,"down_votes":1,"body":"Es que es un modismo chileno pero s&eacute; que lo usan para insultar (no siempre aunque mayor&iacute;a de veces en este juego).\r\n\r\n&iquest;Deber&iacute;a reportar a quienes me dicen as&iacute;? Porque ya son muchos y molestan. Dudo que &quot;tristana qla mala&quot; sea un modismo amistoso.","replies":[{"poster":"Lord Maxlum","date":"2019-02-11T02:20:45.576+0000","up_votes":1,"down_votes":23,"body":"Y si en vez de preguntar si \"qlo\" es baneable o no, mejor te dedicas a mejorar con tristana?","replies":[{"poster":"Mobius One","date":"2019-02-11T02:27:26.097+0000","up_votes":6,"down_votes":0,"body":"Ni siquiera jugué con Tristana, puse un champ de ejemplo. Pero gracias, qué respuesta más amable y coherente.","replies":[{"poster":"Lord Maxlum","date":"2019-02-11T02:29:46.959+0000","up_votes":1,"down_votes":21,"body":"entonces estas poniendo ejemplos que no pasan en la vida real?\n\nQue post tan amable y coherente.","replies":[{"poster":"Mobius One","date":"2019-02-11T03:10:56.156+0000","up_votes":7,"down_votes":0,"body":"Debido a que tenés una falta de comprensión severa, paso a explicar.\n\nEl campeón es meramente hipotético porque no importa lo que vayas o hagas, hay gente que cree que pensamos como ellos, o bien que su manera de pensar es la única correcta en el juego (o sea, creerse el rey del macrogame). \n\nSupongamos, si un jungla te dice \"hagamos baron\" con los 5 vivos y sin visión, sabrás que es muy mala idea y no vas a ir a suicidarte. Pero tu jungla va, lo ven y muere. ¿Qué va a pensar? \"Mi call era perfecta, mi team horrendo no me siguió\". Entonces procede a no aceptar el error, y tratar a los demás de manera denigrante como si nosotros hubiésemos throweado.\n\nEs uno de los TANTOS ejemplos que pude haber puesto, como también en vez de Tristana, cualquier otro champ. Cualquiera que jugase seguido sabe que esto pasa, ¿Cuál champ querés que ponga para que cedas? Veo tu icono de Lulu, entonces te pongo el ejemplo pero con Lulu:\n\n> Dudo que \"lulu qla mala\" sea un modismo amistoso.\n\nDe nada.","replies":[{"poster":"El Bigote Sape","date":"2019-02-11T03:53:56.450+0000","up_votes":4,"down_votes":1,"body":"Obviamante Lord maxlum, es un chileno flamer :p","replies":[]},{"poster":"Lord Maxlum","date":"2019-02-11T03:42:47.901+0000","up_votes":1,"down_votes":9,"body":"quizas si jugaras mejor a Lulu, no te digan nada","replies":[{"poster":"Alba Meira","date":"2019-02-11T14:49:16.745+0000","up_votes":2,"down_votes":1,"body":"Hay chilenos que se enojan por mandarlos a la esquina a ver si hay terremoto, y chilenos que dicen que ; \"malo qlaaa, sapo qllaa wea , eri mali wnn no jugei eta wea mas qlo\" y muchas otras palabra raras, que por proposito tienen insultar de una forma u otra, como te mencione mi ejemplo de mandarlos a la esquina eso seria insulto gravisimo, en cambio las demas cosas que mencione, no lo serian, para ellos a su pensar.","replies":[]}]}]}]}]},{"poster":"Excorpion","date":"2019-02-12T00:34:28.359+0000","up_votes":2,"down_votes":0,"body":"Es válido que venga a preguntar lo que se le dee la gana...","replies":[]}]},{"poster":"TvTLucio22","date":"2019-02-11T02:18:22.123+0000","up_votes":2,"down_votes":1,"body":"ese \"tristana qla mala\" tiene tintes toxicos en mi opinion, por eso lo reporto y que el bot lo decida","replies":[{"poster":"KinGSlayerP","date":"2019-02-12T03:33:47.775+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"TvTLucio22","date":"2019-02-12T05:48:06.704+0000","up_votes":1,"down_votes":0,"body":"Ser homosexual por reportar una expresión que va contra las reglas? Después no se queje de los flammers...","replies":[]}]}]},{"poster":"Excorpion","date":"2019-02-12T00:35:00.326+0000","up_votes":1,"down_votes":0,"body":"SI LO ES !!!","replies":[]},{"poster":"RecorcholyS","date":"2019-02-11T13:25:12.952+0000","up_votes":1,"down_votes":0,"body":"Cualquiera que te diga que no es reportable es porque lo usa de manera despectiva.\n Utilizar modismos en un juego cuando sabes que no todos entienden su significado y tiende a tomarse como un insulto es arriesgado. \nDa lastima la gente que dice que uno tiene que jugar bien con ese champ para que no lo insulten, es como: \n{{sticker:sg-lux-2}}","replies":[]},{"poster":"HarpaX","date":"2019-02-11T03:37:41.792+0000","up_votes":1,"down_votes":0,"body":"Independiente de si dice \"tristana _qla _ mala\" o \"tristana _cualquierModismoEquivalenteDeCualquierPaisLaitno_ mala\" te estan atacando, asi que es reportable.\n\nBaneable no, si no yo estaria permabaneado lol\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Lengz","date":"2019-02-11T23:24:00.509+0000","up_votes":1,"down_votes":1,"body":"Banean gente por decir boludo es que es un modismo argentino usado normalmente para llamar a alguien, por que no a los chilenos por decir qlo?","replies":[]}]}