{"poster":"Mobius One","date":"2015-05-30T06:24:58.992+0000","title":"Rito, Rito, Rito...","subforum":"Comportamiento del jugador","up_votes":65,"down_votes":5,"body":"Hola, s&iacute;, es otro QQ post, pon&eacute; tus memes, ganate tus flechitas arriba, coment&aacute; &quot;reportado lince de las praderas&quot;, dale, dale.\r\n\r\nPero s&oacute;lo vengo a compartir una opini&oacute;n. No creo que Riot la tenga en cuenta (porque lo &uacute;nico que toman en cuenta SIEMPRE tiene que haber dinero de por medio) (a favor de ellos, claro) pero igual la voy a poner.\r\n\r\nA ver, &iquest;En qu&eacute; empiezo? &iquest;Enfermo, mogolico? &iquest;Down de mierda? Aaaah, cuando iba a la escuela, decirle eso a un compa&ntilde;ero era discriminaci&oacute;n, linda suspensi&oacute;n y cagada a cintazos me daban. Pero ojo eh, porque el LoL es en cierta medida, lo que hoy en d&iacute;a es una escuela. Muchos pendejos maleducados, te tratan de &quot;dale flaco&quot;, &quot;movete capo&quot; y el irritante spam de la palabra &quot;dios&quot;. Siempre veo en facebook que todos dicen ser ateos, que Dios no existe, pero es como si es otro &quot;Dios&quot;, est&aacute; presente en todas las personas desesperantes.\r\n\r\nPero hay otro tipo de vocabulario no discriminatorio que tambi&eacute;n irrita. &Eacute;se que TAN deportivo se ve. S&iacute;, el &quot;gg izi&quot;. El gg izi surgi&oacute; hace menos de 2 a&ntilde;os, de hecho se escrib&iacute;a &quot;easy&quot; hasta que se populariz&oacute; y ahora no importa qu&eacute; tan pac&iacute;fica sea la partida: siempre est&aacute; el soberbio poniendo &quot;gg izi&quot; y a veces acompa&ntilde;ado de una lane (gg izi mid, top, bot).\r\n\r\nAhora a lo que voy, no pido que Riot sea una maestra jardinera y le ponga una nota en el cuaderno a los nenes que se portan mal. Porque tenemos presencia de chabones de 25 a&ntilde;os con pelos en los huevos que siguen actuando de manera muy inmadura pero ya es tarde para que alguien los eduque. Porque si sigo relacionando todo esto con el colegio, no podr&iacute;amos agarrar a pi&ntilde;as al bobito ese que putea desde lejos, no, no porque est&aacute;n los amigos atr&aacute;s, sino porque est&aacute; la pantalla.\r\n\r\nEst&aacute; la pantalla, est&aacute;n los AFK&#039;s, est&aacute;n los trolls, est&aacute;n los flamers, est&aacute;n los que por un primera sangre o un gank o 2 ponen &quot;gg&quot; en el chat, porque no tienen ni un m&iacute;nimo de reserva para guardarse sus comentarios y analizar la situaci&oacute;n con calma, NO. SIEMPRE LA CULPA ES DEL OTRO. Y eso es lo que hace que suelten palabras indeseables en el tan comunicativo chat.\r\n\r\nY el BOOM! que me hizo estallar. Claro, el servidor. No s&eacute; c&oacute;mo es la cosa con el pa&iacute;s de mierda donde vivo (disculpen patriotas que nunca cantaron el himno pero se ponen la camiseta en el mundial) de si la infraestructura es pedorra o qu&eacute;. Pero se supone que si vas a brindar un servicio, est&aacute;s en condiciones de hacerlo.\r\n\r\n&iquest;Te devuelven el LP? No.\r\n&iquest;Derrota evitada? No.\r\n&iquest;Se puede reconectar? Claro, despu&eacute;s del minuto 15.\r\n&iquest;GG izi? Obvio, infaltable en el chat.\r\n&iquest;Fair play? AJAJAJA, ABUSO, ABUSEMOS AHORA QUE TIENEN UN AFK!\r\n\r\ntl:dr tenemos una comunidad... desastroza, por no decir otra palabra (a ver si me banean por escribir &quot;huevo&quot;). Pero tambi&eacute;n un servidor, y un filtro de jugadores t&oacute;xicos totalmente incompetentes. Y pueden escribir mil y un post los rojitos delicados, pero del dicho al hecho... hay un laaargo trecho.","replies":[{"poster":"YagoTL","date":"2015-05-30T06:38:20.473+0000","up_votes":20,"down_votes":0,"body":"Totalmente de acuerdo con vos... lastima que acá no se puede expresar una opinión públicamente, ahora por decirle a Riot que solo le importa el dinero te banearan en cualquier momento :| \n\nAunque tengo ganas... no voy a decir nada del server, lo juro.","replies":[]},{"poster":"Koijhy","date":"2015-05-30T06:53:40.577+0000","up_votes":12,"down_votes":0,"body":"Riot: dinero tu sabes que el dinero no lo es todo en el dinero, dinero\n\n\nRito empresa, vos cliente\nriot ya dejo bastante en claro que no hace ni piensa hacer nada, ya sea con el server o con la comunidad mierdera que tenemos, simplemente se limitan a sacar ganancias, mientras siga habiendo giles que gasten rp en un juego como este nada va  a cambiar, desde s2 juego y esto siempre fue igual y va a seguir igual \ngg izi post","replies":[]},{"poster":"Amenotejikara","date":"2015-05-30T07:11:31.309+0000","up_votes":7,"down_votes":0,"body":"Hermano, ¡esto es lo que esperaba ver que alguien se dignara en decir! Realmente tenes en claro como es la sociedad del LoL, al menos, en LAS.","replies":[]},{"poster":"PabloBad","date":"2015-05-30T14:28:24.155+0000","up_votes":3,"down_votes":11,"body":"Amigo, es un juego. Fijate cuanto te afecta y pensá si no se te estará volviendo un problema. \n\n¿Gente tóxica? Se ignora, como en el mundo real. ¿O te pones a escuchar lo que tiene que decir cada persona que toda la bocina en el semáforo?\n¿Perdiste por AFK, trolls y esas cosas? A todos les pasa, ya vendrán partidas mejores. Apuesto mi cuenta a que este post lo escribiste después de una mala partida y en una semana se te olvida. \n\nSaludos. Es un juego no más, no se porque se lo toman tan en serio como para que afecte su estado de animo.","replies":[{"poster":"Ainus Nahalt","date":"2015-05-30T16:51:12.467+0000","up_votes":10,"down_votes":0,"body":"Sabes lo que pasa campeon? hay gente que labura, que tiene una casa, un hijo o dos y tiene que mantener, que juega para \"relajarse\" distraerse, porque juega de que era \"pibe\" y por 30-40 minutos que dura la partida se olvida de los problemas, de tu jefe, de lo rompe pija de tu novia, tu vieja, tu hermana, o no se. Y por culpa de 1 o 2 malos jugadores, troll, afk perdes, te comes todas las gastadas \"gg izi\" y demas, a nadie le gusta que los carguen. Y obvio que a todo el mundo le gusta ganar. Entonces que \"jueguen\" para cagarle la partida al resto te da bronca, uno juega para mejorar. Dejense de joder, si van a hacer perder al resto directamente no jueguen. Pierden tiempo uds y nos hacen perder tiempo a nosotros.","replies":[{"poster":"PabloBad","date":"2015-05-31T01:18:26.737+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Ainus Nahalt,realm=LAS,application-id=PJAKt7ph,discussion-id=9yIXrIGR,comment-id=00050000,timestamp=2015-05-30T16:51:12.467+0000)\n>\n> Sabes lo que pasa campeon? hay gente que labura, que tiene una casa, un hijo o dos y tiene que mantener, que juega para \"relajarse\" distraerse, porque juega de que era \"pibe\" y por 30-40 minutos que dura la partida se olvida de los problemas, de tu jefe, de lo rompe pija de tu novia, tu vieja, tu hermana, o no se. Y por culpa de 1 o 2 malos jugadores, troll, afk perdes, te comes todas las gastadas \"gg izi\" y demas, a nadie le gusta que los carguen. Y obvio que a todo el mundo le gusta ganar. Entonces que \"jueguen\" para cagarle la partida al resto te da bronca, uno juega para mejorar. Dejense de joder, si van a hacer perder al resto directamente no jueguen. Pierden tiempo uds y nos hacen perder tiempo a nosotros.\n\nJustamente amigo. Te lo digo porque no soy un pibe. Tengo 30 años, una empresa a mi nombre y millones de responsabilidades y quilombos como para que un \"izi\" me amargue la tarde. Y mira que soy re calentón, tengo como 7 joysticks de play 2 hechos mierda por eso. \n\nPero realmente es cuestión de darse cuenta que las partidas se pierden o se ganan. Los motivos puden ser miles, pero el resultado es el mismo. Perdés, por un troll, un afk o un smurf en el equipo enemigo, da igual. La cosa es jugar para mejorar. Si ganas es un premio, si no pecho. La próxima será. \n\nA un adulto no le puede molestar perder, de hecho, menos aun por un evento ajeno al juego, como un afk. En ese caso aguanta y perde con dignidad. \n\nSi las gastadas te joden... bueno, que te puedo decir. Es muy poca cosa un pibe en la casa de su vieja que te gaste y te mueva un pelo. \n\nSaludos.","replies":[]},{"poster":"Axitas Alexis 99","date":"2015-05-30T22:48:34.263+0000","up_votes":1,"down_votes":0,"body":"Es simple, hay muchos juegos, personalmente creo que el lol me ha ayudado a comprender que tipos de personas son las que me rodean, y que nunca debo bajar los brazos si quiero cumplir mis objetivos.","replies":[{"poster":"Lannihan","date":"2015-06-01T00:52:55.691+0000","up_votes":1,"down_votes":0,"body":"La visión de LAS es totalmente sumisa, todas opiniones llevan a lo mismo: \"Debemos ignorar lo que pasa dentro del juego para estar bien nosotros\", que mierda, tenemos administración que ignora las peticiones diarias de reportes de troleosy escojen sólo algunas para decir que trabajan.\n\nSegundo, un foro de comportamiento al juegador donde el reporte es baneado. Las cosas estan bien en LAS?, no. Sinceramente da lo mismo ya lo que piense un Rioter o los del soporte porque nunca han estado en una partida diariamente buscando infracciones o trabajando para mejorar el server, sólo se dedican pasivamente a aplicar las normas que les pasan desde NA y nada más porque no existe la proactividad o la capacidad de banear a los jugadores en LAS donde el contexto es otro. Los que juegan en NA o han tocado alguna otra región lo entienden, y se nota la calidad del servidor frente a LATAM, donde tanto la administración y los troles son basura, incluso al mismo nivel.","replies":[{"poster":"Axitas Alexis 99","date":"2015-06-01T23:50:15.382+0000","up_votes":1,"down_votes":0,"body":"Hmmm, pienso que es al contrario, la mayoria de post son quejas, creo que eso representa nuestra personalidad como latinoamericanos, pero no se si la situación sea diferente en otros lados, puede llegar a ser porque a los de otras comunidades si están acostumbradas a ser sumisas por culpa de tantos años de gobiernos(Ok,  dije cualquier cosa y me re fui del tema jaja), personalmente pienso como tú que debemos ser tratados de igual forma y hay cosas que me indignan por mas que a mi no me sirvan(como la vez que publicaron las paginas de runas utilizadas en el MSI en EUW), eso si me enoja puesto que deberíamos reclamar igualdad para todos los svs(cosa que a mi parecer, es casi una realidad) pero si los problemas son en todos los servidores, simplemente no me quejo, porque el lol es gratis y yo decido jugarlo. Además el juego es estadounidense, el capitalismo en persona(pienso muy mal de estos, pero no voy a expresar mi opinion en un juego que nada tiene que ver, y que no involucra a todos los estadounidenses, pues buena gente hay en todos lados), por lo que ya estamos demostrando falta de apoyo a los videojuegos de aca, si es que esos existen jaja, me siento traidor con esas ultimas palabras :/","replies":[{"poster":"Lannihan","date":"2015-06-03T03:10:26.006+0000","up_votes":1,"down_votes":0,"body":"Si sigues en ese punto llegarás a nada. \n\nA lo que quería llegar es que simplemente el server está así porque los usuarios mismos dejan que la administración haga nada, los troles, flammers son los tipos que estan lamiendoles los pies a la administración.\n\nEn fin, LAS no es un servidor decente desde hace ya un año, ya que el nivel en todos los ámbitos están mal evaluados, sólo ellos mismos se dicen que estan bien, y que seguiran mejorando, no se que cosa tienen de bueno que puedan mejorar, porque si muestras el servidor al resto del mundo, a mi me daría vergüenza jactarme de ser de LAS.","replies":[]}]}]}]}]}]},{"poster":"Lynet","date":"2015-05-31T02:27:41.809+0000","up_votes":3,"down_votes":2,"body":"Ahora recuerdo el porque no vengo nunca al foro... \nLo único que puedo decir, es que si te molesta algo in game, existe el botón de mute, gran invento de parte de riot, y si perdiste porque estuviste afk y todo eso, cuando se están cargando las estadísticas, sale un botón que dice saltarse las estadísticas, lo que te permite no leer nada de lo que te quieran poner, las herramienta para evitar a los niños especiales existen.\n\n Ahora como leí en algunas opiniones, si les prestas atención a todo lo que te dicen, estamos mal y mas aun si es dentro de un juego virtual, osea de que estamos hablando xD!.. no se si quedas mas pendejo tu que te prestas para esas tonteras o el niño que te agrede verbalmente o incitando.\n\nAhora con respecto al fairplay, no es problema de los demás jugadores que se caiga un player, no pueden estar esperando a que reconecte por mas de 10 minutos.\n\nLo de derrota evitada te lo acepto, porque el servidor aveces no anda bien, pero mas que problemas del servidor, la mayoria de los casos son los mismos ISP que tienen cada uno, esos mismo ISP son los que anda mal dependiendo del sector en el que se encuentren, darte un ejemplo sencillo, 2 personas con VTR chile, en diferentes sectores donde obviamente están conectados a nodos diferentes, pasa lo siguiente en muchos casos 1 tiene lag desconexiones y el otro no, y este ejemplo es aplicable a todos los ISP  sean chilenos o no, si el server anduviese tan mal, tendríamos a un montón de niñitos llorando todos los días en el foro y un sin fin de post.\n\nEn fin no creo que venga a darme una vuelta al foro por mucho tiempo mas.. suerte con el servidor :D!!!  y \"gg izi\" Bromis :D!{{item:3151}}","replies":[{"poster":"Morumotto","date":"2015-05-31T02:43:16.614+0000","up_votes":2,"down_votes":1,"body":"El comentario mas acertado que he encontrado hasta el momento.","replies":[{"poster":"Ch4puLin","date":"2015-05-31T20:13:38.363+0000","up_votes":3,"down_votes":0,"body":"Qué tiene de acertado?\nQue exista el botón mute no implica que no pida un castigo para la persona que te obligó a usar la herramienta. Existen los juicios, las cárceles, las condenas, dejemos a todos matar, total existe eso. \nPuede no afectarte, a mi no me cambia nada que un nenito ponga easy, lo que si me molesta es que hace 100 partidas que lo pone y no le hacen nada. \nSirDal posteó un comentario mio explicando porqué el ban en el foro, se tomó la molestia de mostrar algo que ya sabía pero cuando le pregunté directamente el motivo por el cual hacen esa diferencia entre el foro y el juego (en el foro una ofensa es ban, en el juego necesitás cantidades grandes de reportes, advertencias, análisis de casos para sancionar) no puso nada. Pierde el tiempo creyéndose el pelado justiciero pero cuando la pregunta es directa y simple la rehuye.\nLo del server, siguen dando explicaciones kilométricas de redes e ISP, y no logran entender que el server no es el aparato físico, es todo el conjunto, dejen de separar los tantos, a los usuarios no les importan esas excusas, juegan LAS no por el hardware de procesamiento. Decile comunidad, área, como te sirva para entender, pero si algo anda mal, le jodés la experiencia a la gente que juega, y si encima el problema afecta a un número cercano al 50%, estás con  un problema serio, que nunca vas a entender si seguís pensando que el server es solamente el aparato físico o su definición de diccionario.\nEn fin, puedo considerar acertado lo del fairplay, le doy eso.","replies":[]}]}]},{"poster":"Kardoz","date":"2015-05-30T19:21:43.577+0000","up_votes":3,"down_votes":0,"body":"AN0n1m8 presidente! - AN0n1m8 presidente! - AN0n1m8 presidente! - AN0n1m8 presidente!","replies":[]},{"poster":"Dassin","date":"2015-05-30T07:07:01.707+0000","up_votes":3,"down_votes":0,"body":"**_Muy,Muy e acuerdo con vos, pero bueno, que se le va a hacer, si no les importa este server, si sacan este server tienen 9 mas de donde sacar guita y es mas, se ahorran quejas._**","replies":[]},{"poster":"Mobius One","date":"2015-06-01T17:39:41.049+0000","up_votes":2,"down_votes":0,"body":"A ver, gente, vamos a ver si entendemos. Puede ser que yo insta-mutee a los 9 de una, pero, ¿Cuál sería el problema ahí? NUESTROS ALIADOS, ELLOS NO MUTEAN, y así son ellos quienes juegan mal y se dedican a hacer tonteras. Con eso se logra un rage en el team (no tuyo si muteaste) en el cual el ambiente es pesado y DESMOTIVA!\n\nComo así también desmotiva saber que tus aliados están enojados (porque por ejemplo, muteás al flamer pero ves a los otros 3 contestándole) ya que van a jugar peor de lo que te va (se roban los monstruos de la jungla, spamean pings, no van a dragón).\n\nComo así también desmotiva saber que tenés a alguien muteado (porque lo primero que se te viene a la mente cuando pasás una mala jugada es \"va a trollear o se va afk\")\n\nY como así también desmotiva perder la poca confianza que deberías tenerle a tu teammate para lograr un buen juego en equipo.\n\nY no escribo esto porque pasé una mala partida, yo ya vengo posteando quejas desde antes, les invito a pasar por mi thread iniciado en el antiguo foro:\n\nhttp://forums.las.leagueoflegends.com/board/showthread.php?t=93181","replies":[]},{"poster":"hi im chito","date":"2015-05-31T01:53:42.284+0000","up_votes":2,"down_votes":0,"body":"no va a faltar el tipico comentario de algún Rioter con copy/paste que te diga '' Lamentamos profundamente que ayas pasado una mala experiencia, recuerda reportar''","replies":[]},{"poster":"Raigiku","date":"2015-05-30T20:55:44.559+0000","up_votes":1,"down_votes":0,"body":"Es verdad a riot le importa solo el dinero por ejemplo SMITE una compañia MOBA pone skins en costo de los puntos obtenidos en el mismo juego y regala gemas (RP) cada 4 veces que te conectes y riot en cambio venden paquetes con distintos colores a un personaje y encima a 520 o 750 RP y lo peor de todo es la comunidad si. Ahora acabo perder mi promo a oro por un troll, por un flamer y por un afk el sistema de riot no sirve. Hasta quitaron el tribunal hace un año para hacer ''mejoras'' A esta empresa no le importa su propia comunidad si esta bien o mal y si le importase harian algo para terminar o solucionar este problema de trolls o flamers hay varios ejemplos es distintos MOBAS con mejores sisteams que este lo peor de todo es que  cuando alguien postea algo asi a riot no le importa nada. Responde a otras discuciones menos a algo como esto.","replies":[{"poster":"MaestraDelEtwahl","date":"2015-05-30T21:36:41.505+0000","up_votes":2,"down_votes":0,"body":"Que asco Mcdonald, solo le importa el dinero por ejemplo Mostaza una compañia de comida rapida da cupos donde podes comer hamburguesas 2x1. En cambio, Mcdonald vende combos carisimos en donde solo cambia el nombre de una hamburguesa a otra y lo peor de todo es la gente de ahí. A esta empresa no le importa si la gente que va esta bien o mal, deberian darnos hamburguesas gratis. Solo les importa vender y no que nosotros nos alimentemos.","replies":[{"poster":"Juancruzhs","date":"2015-05-30T22:51:57.383+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MaestraDelEtwahl,realm=LAS,application-id=PJAKt7ph,discussion-id=9yIXrIGR,comment-id=000d0000,timestamp=2015-05-30T21:36:41.505+0000)\n>\n> Que asco Mcdonald, solo le importa el dinero por ejemplo Mostaza una compañia de comida rapida da cupos donde podes comer hamburguesas 2x1. En cambio, Mcdonald vende combos carisimos en donde solo cambia el nombre de una hamburguesa a otra y lo peor de todo es la gente de ahí. A esta empresa no le importa si la gente que va esta bien o mal, deberian darnos hamburguesas gratis. Solo les importa vender y no que nosotros nos alimentemos.\n\nEs un asco MCDonalds, uno no puede ver el futbol americano en paz porque ya vienen los de el mercado negro a vender armas y lo peor es que al terminar la partida ponen \"GG IZI\"","replies":[]}]}]},{"poster":"LPDU","date":"2015-07-08T06:17:30.417+0000","up_votes":1,"down_votes":0,"body":"Que buen post! Es un juego como todos dicen pero vos jugás para divertirte y para ganar, para subir de división y llegar a ser \"diamond\" como todo el mundo quiere. A mi también me pega en el forro de los huevos tener que bancar un \"gg izi bot\" por culpa de un \"jg\" que no le dieron un buen \"leash\" en sapo y trollea. O por alguien que se pone a jugar una partida y después se le cantan las ganas de bañarse, irse a comer, salir con su novia, etc.\nO por alguien que simplemente esta aburrido y dice bueno trollemos ya que Rito no me banea o no me importa , total es un juego que mas da. No a todos nos importa de misma manera este juego online. Yo antes iba al cyber a jugar al \"Counter Strike\" y decia, \"fua que asco ese juego, nunca lo voy a jugar\". Y después un amigo me hizo jugarlo y me encanto. Desde el año pasado que lo juego y no puedo dejar de jugarlo, no es una adicción ni nada de eso, pero lo juego y me desestresso. \n\n     Perder una \"promo\" por un \"troll\" me revienta, porque él dice que me importa este juego , si no lo juego nunca. Pero vos que lo jugás todos los días, que cada día te esforzás mas por jugar mejor, te calienta bastante.\nComo vos decís acá es todo por el dinero, cuanto te apuesto a que si nosotros pagamos porque baneen ellos van y banean a \"toditos\" los \"trolls\". Pero no, si no hay dinero no hacen nada. \"Por la plata baila el mono\" dice el dicho..\n\n    Se supone que no se puede insultar, pero los Chilenos te dicen \"wn\" \"ql\" \"fome\" y Riot? Se ríe con ellos parece. Ojo eh, vos les decís \"Putos\" y ya te banearon.\n\nDespués de haber escrito este post me van a banear, lo se. Pero bueno.. Bien ahí RIOT!! Seguí baneando a la gente que te tira la posta en los foros y no banees a los que te cagan el juego! Dale, seguí así que vas perfecto!\n\nSALUDOS AN0n1m8 ! \nAtte: LPDU.","replies":[]},{"poster":"Sheblo","date":"2015-07-07T20:58:12.942+0000","up_votes":1,"down_votes":0,"body":"MILES DE PULGARES ARRIBA PARA EL PIBE!!!!","replies":[]},{"poster":"Nikoelzombi","date":"2015-06-28T18:17:18.336+0000","up_votes":1,"down_votes":0,"body":"mira amigo, apoyo todo lo que dices, la comunidad es literalmente y sin ocultarlo una basura y los admin lo son mas, cave decir que a mi otra cuenta (la lvl 30) me banearon del foro por hacer un post no ofensivo de lo que pensaba del porque no beanean gente con los reportes y esas cosas y me banearon por el solo hecho de equivocarme de seccion. se que con el tiempo la gente dejara de jugar league of legends por culpa de la comunidad y se mudara a juegos como smite o hots que la comunidad estan mucho mejores que esta y no les culpo si literalmente rito solo quiere vender y nosotros los clientes le importamos un bledo. jamas escucharan nuestras opiniones y no, cuando dicen que escuchan nuestras opiniones lo inventan para hacernos creer que lo hacen. este juego esta muriendo y es por culpa de los admin que no saben hacer nada util con su poderio y por muchos jugadores flamers, ratas y trolls","replies":[]},{"poster":"lastoneyea","date":"2015-05-30T15:36:02.217+0000","up_votes":1,"down_votes":0,"body":"De acuerdo en lo demas pero...Yo no entiendo para que tienes activado el chat en el team contrario... En que te aporta al juego?. Generalmente el equipo contrario te dirá cosas que te molesten. Mejor desactiva ese chat y juega tranquilo xD {{champion:157}} ","replies":[{"poster":"Mobius One","date":"2015-05-30T17:07:48.840+0000","up_votes":1,"down_votes":0,"body":"Es que a veces es bueno saber que en el team enemigo uno pone \"report xx gg\", te das cuenta que les tocó un flamer y podés usarlo a tu favor (gankear a tal lane para que ragee, matar al jungla, etc.).","replies":[{"poster":"lastoneyea","date":"2015-06-08T02:46:27.348+0000","up_votes":1,"down_votes":0,"body":"si, igual es cierto lo que dices, viéndolo así, puede ayudar... saludos","replies":[]}]}]},{"poster":"Crusshine","date":"2015-06-05T16:41:02.359+0000","up_votes":1,"down_votes":0,"body":"Alguien que piensa.. Estamos todos de acuerdo..","replies":[]},{"poster":"JesúsMeCarrea","date":"2015-06-04T23:12:01.944+0000","up_votes":1,"down_votes":0,"body":"y riot sigue sacando iconos de 260rp, segui reportando lince (piensan ellos).","replies":[]},{"poster":"Muken Greyjoy","date":"2015-06-03T05:06:26.278+0000","up_votes":1,"down_votes":0,"body":">  Muchos pendejos maleducados, te tratan de &quot;dale flaco&quot;, &quot;movete capo&quot; y el irritante spam de la palabra &quot;dios&quot;. Siempre veo en facebook que todos dicen ser ateos, que Dios no existe, pero es como si es otro &quot;Dios&quot;, est&aacute; presente en todas las personas desesperantes.\n> \n\nEres un maestro, te apoyo al 100%","replies":[]},{"poster":"LuciusMagnum","date":"2015-06-02T19:23:43.309+0000","up_votes":1,"down_votes":0,"body":"ningun rojo contesta jajajajaj es tan tóxica la comunidad que hace obviamente que nos enojemos con ellos, muy ineficiente el trabajo que hacen","replies":[]},{"poster":"bESEL","date":"2015-06-02T18:46:28.499+0000","up_votes":1,"down_votes":0,"body":"Loco no puedo estar más de acuerdo. Me encantaron todas y cada una de tus palabras y tenés absolutamente toda la razón. Parece que lo hubiera escrito yo mismo. Esta comunidad es una basura total, y no hay con que darle. O sí, pero nadie tiene ganas de encargarse.","replies":[]},{"poster":"Leon the mutant","date":"2015-05-31T22:59:37.019+0000","up_votes":1,"down_votes":0,"body":"Tal cual. Lo peor es que si le escribis al soporte, te mandan sus copia y pega del \"sistema de reporte\" y de que no pueden darte derrota evitada por problemas locales (cuando se le cae la partida a toda una región) y sobre como estan haciendo un esfuerzo y yadda yadda yadda\n\nLo mismo seria si te respondieran con un mail: \"macho no hinches mas con estas giladas, a nadie aca le interesa\"\n\nPero bue","replies":[]},{"poster":"Darwin","date":"2015-05-31T21:34:41.704+0000","up_votes":1,"down_votes":0,"body":"buenas a todos!, personalmente soy de las personas que tienen muy buena actitud y predisposicion para jugar. Despues de casi 4 años jugando a este juego descubri el boton de la redencion.. se llama MUTE ALL. Desde que consumo compulsivamente ese producto que riot nos brinda de manera gratuita mi vida intra game no puede estar mejor! :D  Es facil.. apenas empieza la partida te fijas el \"estado del arte\"... si hay buena onda.. joya!.. si dicen gg apenas empieza o flamean o demas... mute all! :) y la vida se soluciona... jugas con PAZ. Lo importante es tener en cuenta que es un juego y jugar es lo que hay que hacer... para hablar estan los congresos... \n\nsaludos y aguante {{champion:34}}","replies":[]},{"poster":"xRasH","date":"2015-05-31T21:30:41.116+0000","up_votes":1,"down_votes":0,"body":"logie solo para decirte +10 y a favoritos che jaja; chau{{summoner:4}}","replies":[]},{"poster":"xRasH","date":"2015-05-31T21:29:54.825+0000","up_votes":1,"down_votes":0,"body":"logie solo para decirte +10 y a favoritos che jaja; chau{{summoner:4}}","replies":[]},{"poster":"BOT MID","date":"2015-05-31T19:03:03.460+0000","up_votes":1,"down_votes":0,"body":"NERFEOOO A EKKO :v","replies":[]},{"poster":"Cosmic Ganks","date":"2015-05-30T06:36:54.172+0000","up_votes":1,"down_votes":10,"body":"***","replies":[{"poster":"Mobius One","date":"2015-05-30T07:12:13.106+0000","up_votes":2,"down_votes":1,"body":"Muy bieeeen, comentaste algo para ganar flechitas! Dale, seguí así, pero seguí en Inglés eh, queda más canchero.","replies":[{"poster":"Minatsu","date":"2015-05-31T17:50:26.678+0000","up_votes":1,"down_votes":0,"body":"Borro el comentario yo quiero saber que dijo asi me rio","replies":[]}]}]},{"poster":"ReinhardtVon","date":"2015-05-31T11:52:49.766+0000","up_votes":1,"down_votes":0,"body":"la ultima que ya cansan a 5,4,3,2 vs 1 solos no pueden","replies":[]},{"poster":"GødLîkë","date":"2015-05-31T03:27:38.979+0000","up_votes":1,"down_votes":0,"body":"Les recomiendo que hagan la encuesta que esta en la portada del cliente del juego.","replies":[]},{"poster":"ElPibeDelGranito","date":"2015-05-31T02:55:48.123+0000","up_votes":1,"down_votes":0,"body":"Bien tu post , pero riot dice cosas y no las hace lamentablemente siempre dicen \"gg izi\" , una pena que no hagan nada.{{item:3078}}","replies":[]},{"poster":"NaxoCross","date":"2015-05-31T02:54:35.451+0000","up_votes":1,"down_votes":0,"body":"llora po maricon qlo...............................mentira te amo te atreviste a decir lo que todos nos teníamos guardado en nuestro ser riot de mierda nisiquiera quiere mover un dedo pero te digo altiro que quejándose en un server bajo como es LAS (comparado con los otros) no creo que sirva de mucho.","replies":[]},{"poster":"AleRoss14 ","date":"2015-05-31T02:49:10.080+0000","up_votes":1,"down_votes":0,"body":"Demasiada verdad para un post, la verdad leo los comentarios y veo de Mutear y bloquear al aliado/enemigo, pero de que sirve igual uno no puede ir muteando  a todos el server y ademas es cierto Riot tiene MUCHO PODER y no lo utiliza de modo correcto, solo en sacar skin para hacer dinero y cosas nuevas como el cromo y champs. Lo unico que le falta es una pubilicidad de Coca-Cola hay al abrir el parche. ( jajaja)\n\nY lo del \"gg izi\". Hay que admitir que cuando en el equipo enemigo hya un loquito (flamer troll etc) y lo unico que hace es insultarte a ti y A TU FAMILIA (Y SE VAN MUY A LA MIER*** CUANDO DIGO FAMILIA) esta bueno reprocharle en la cara que fue un verdadero \"GG! izi\" al ganar.\n\nRiot: El dinero es dinero, el dinero hace mas dinero y cuando tienes dinero es dinero! Aprender algo... DINERO!","replies":[]},{"poster":"AleRoss14 ","date":"2015-05-31T02:30:23.904+0000","up_votes":1,"down_votes":0,"body":"La verdad amigo, te pasate. Te felicicito por demostrarlo en el foro aunque como te expresaste, nunca van a hacer nada.\n\nTu Madre se sentiria orgullosa xD. Pero encerio amigo Buen tema!!! \n\nPELEEMOS POR UN LOL MAS \"SANO\" {{item:1075}} \n\n \"Y pueden escribir mil y un post los rojitos delicados, pero del dicho al hecho... hay un laaargo trecho.\" Mi frase favorita. Sos un crack","replies":[]},{"poster":"Yürei","date":"2015-05-31T02:01:24.593+0000","up_votes":1,"down_votes":0,"body":"Ya lo dijeron mil veces esto y la comunidad sigue igual y si te referis al problema de ayer con la fibra optica nada tiene que ver rito ni el patriotismo man, pero por todo lo demas siempre estoy de acuerdo con esa idea aunque nada cambiara para ser sincero","replies":[]},{"poster":"Morumotto","date":"2015-05-31T01:47:17.632+0000","up_votes":1,"down_votes":0,"body":"En varios puntos estoy muy deacuerdo contigo, pero considero que pensar que Riot puede hacer con esos jugadores (partiendo primero por encontrarlos) y sancionarlos de manera inmediata y que no lo hace solo por que se les da la gana es como tapar el sol con un dedo, creo que ha echo un buen trabajo y lo digo por experiencia ya que tambien fuí sancionado (por inactividad) y se nota, lo malo está en que nosotros no nos damos el tiempo de reportar a este tipo de personas (¿como el tribunal va a funcionar si no se confia en el?) y para finalizar el juego se volvió tremendamente popular, con esto tambien la comunidad y la gran cantidad de personas que lo juega por lo mismo y que no le importará en lo absoluto el como se sienta el otro por el tomar cierta actitud inmadura (y se que esto afecta mucho en lo competitivo) pero hay que aprender que no debemos explotar con eso y que existe el bloqueo a tales jugadores, aunque si estoy un poco molesto que a pesar de todo aún se empareje de esta forma...","replies":[]},{"poster":"Escila","date":"2015-05-31T01:02:59.109+0000","up_votes":1,"down_votes":0,"body":"Excelente flaco, +1\nPero asi es riot, el server, la comunidad y no cambiara","replies":[]},{"poster":"BlackFuture","date":"2015-05-31T00:24:51.824+0000","up_votes":1,"down_votes":0,"body":"Toda la razon, siempre que gano nunca falta el del otro team que dice \"izi bot\", \"izi mid\", que quieren demostrar con eso? Pero bueno, es como decis vos, aca nadie se preocupa por nada, hace 2 dias que ando con subidas de ping en el lol y jugando cualquier otro juego online ningun problema. Me alivia saber que aun hay gente que juega tranquilo y por divertirse, y no por joderle la vida al resto. Ojala algun rioter te lea y podamos, entre todos, mejorar nuestor server, porque, al server que vas, decis que venis de LAS y uff.","replies":[]},{"poster":"DkA Darkito","date":"2015-05-30T23:45:40.592+0000","up_votes":1,"down_votes":0,"body":"Yo nunca abuso de alguien que estuvo afk, por dos simples razones: No disfruto en lo absoluto (Qué sentido tiene \"ganarle\" a alguien que no está en igualdad que tú, y lo matas de 3, 4 básicos?  Ninguno), y entiendo la frustración del oponente cuando uno abusa, a mi no me gusta que me lo hagan así que no lo hago, aunque claro, nunca falta el que te molesta con \"Estuvo afk, mátalo 40 veces!\", pero bueno.\n\nEs horrible de repente la comunidad, -no voy a decir que **siempre** porque hay gente que es buena onda y vale la pena también tenerlos en cuenta, sí, son la minoría, pero ahí están- y es decepcionante realmente porque así como se comportan en el juego son muchos fuera del Pc.\n\nY también es una lástima que lo único que podamos hacer es reportar al final de la partida, porque hay algunos que merecen mucho más, no sé si alguno más vio el post hace unos días de uno que mostró a un Fizz totalmente cínico, que insultaba a diestra y siniestra a sus compañeros Chilenos, y por el \"All\" se hacía pasar por Chileno y decía que era él el atacado e inocente, para mí el merece un ban permanente de cuenta, así como todos los que son como él, independiente de la nacionalidad que sea y al país que ataque, porque es inapropiado sea como sea, pero ahí están, jugando como si nada y nosotros esperando que les llegue una sanción.\n\nBueno, voy a dejar hasta acá nada más mi opinión, para no ocupar tanto espacio, suerte a la gente que sabe como comportarse con los demás, y recuerden usar el botón de mute, a veces es bastante útil, que les vaya bien.","replies":[]}]}