{"poster":"Mobius One","date":"2017-09-03T05:51:36.965+0000","title":"¿Sirve fervor de batalla actualmente?","subforum":"Guias y consejos","up_votes":5,"down_votes":0,"body":"Es que para los ranged, aplicar las 8 marcas requiere aplicar 8 b&aacute;sicos... Y como que lleva cierto tiempo acumular las 8 marcas, y eso que beneficio nos da? Pues: 1-8 de AD adicional con cada acumulaci&oacute;n. Supongo que escala con el nivel, as&iacute; que supongamos que estamos a nivel 18... 8x8 64 de ad. Es como un item m&aacute;s, s&iacute;. Pero, &iquest;No se ha terminado la tf para ese entonces? Quiz&aacute;s sirva en el mid game, ya que al principio pegar 8 b&aacute;sicos lleva mucho tiempo adem&aacute;s de que mucho ad no da, y en late, creo que con menos de 8 b&aacute;sicos ya infligir&iacute;as un da&ntilde;o bestial... por lo que el AD adicional mucha funci&oacute;n no cumple. O al menos es mejor su alternativa, sed de sangre del se&ntilde;or de la guerra, ya que con cr&iacute;ticos en late te curas 3/4 de la vida, adem&aacute;s de darte vel de mov para mejor kite...\r\n\r\n&iquest;Qu&eacute; opinan? &iquest;Conviene solo para los mel&eacute; (que les corresponda, claro) ya que acumulan 2 cargas por golpe?","replies":[{"poster":"rokushoger","date":"2017-09-05T14:36:03.136+0000","up_votes":1,"down_votes":0,"body":"Si sirve, pero con campeones muy particulares que buildeen atk speed o como dijeron por ahí lucian que te pega doble tiro.\nActualmente veo mucho mejor opción la otra maestria para mayor sustain.","replies":[]},{"poster":"RodriiB","date":"2017-09-03T14:10:15.864+0000","up_votes":1,"down_votes":0,"body":"Con lucían la stackeas rapidísimo.","replies":[]},{"poster":"ref","date":"2017-09-03T12:03:13.579+0000","up_votes":1,"down_votes":0,"body":"si sirve","replies":[]},{"poster":"WhiteMax","date":"2017-09-03T11:02:51.253+0000","up_votes":1,"down_votes":0,"body":"> Es que para los ranged\n\n{{champion:114}} {{champion:11}} ???\n\nAmm la acumulacion no desaparece al \"instante\" con {{champion:51}}  podes estar pockeando a distancia y mantener la acumulacion.","replies":[]},{"poster":"Ks Erwyn","date":"2017-09-03T06:08:58.089+0000","up_votes":1,"down_votes":0,"body":"como siempre al menos en los melé depende mas de rival y su maestria clave que de ti mismo.\n\nen el caso de los ADC de rango, es mas determinante sobre quien sea tú supp y el del rival. aunque es verdad sed de sangre esta por encima de fervor por actualidad y META","replies":[]},{"poster":"Yupigamer","date":"2017-09-03T06:08:26.104+0000","up_votes":1,"down_votes":0,"body":"Depende del champ en cuestion y de su build por ejemplo, una fiora lo carga si resetea perfecto los autoataques... apenas se tira. Ya que solo necesita   pegar 4 att. Otro ejemplo de champ mele que carga fervor rapido, es darius. Basicamente reseta autoataque y pega muchos basicos para cargar su hemorragia.\n\nEn campeones de rango tambien sirve si los buildeas tirando a velocidad de ataque, ej:{{champion:29}} \n\nPese a todo eso la maestria se queda muy detras en versatilidad, es muy dependiente de un campeon o una build\n{{sticker:fiora-cool}}","replies":[]}]}