{"poster":"Soulwhite96","date":"2016-08-27T23:59:25.260+0000","title":"Guia de Soportes 2014 para principiantes y experimentados (ven siéntate ponte cómodo)","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Hola a todos muy buenas tardes desde mi congelada casa. hoy vengo a como dice el titulo hacer un gu&iacute;a para soportes, esto se debe  a que yo juego de rol soporte y ADC y &uacute;ltimamente note en partidas incluyendo las m&iacute;as el modo de juego de los supp cunado juego de adc son muy extra&ntilde;as a mi manera de ver y comenten errores que no importan y luego errores algo serios y que pueden costar la vida.\r\n\r\nEs por eso que har&eacute; una gu&iacute;a detallada de como ser soporte, como vera dice 2014 y esto se debe a que es toda la experiencia y conocimientos que reun&iacute; en ese a&ntilde;o que jugaba Legue of legend. En 2015 no juegue LOL y reanude en 2016 ademas que es posible que omita alg&uacute;n concepto o informaci&oacute;n que sea necesaria en esta guia, si as&iacute; fuera. Tu comentario sera le&iacute;do sobre que informaci&oacute;n  a agregar y tus opiniones en los que estas de acuerdo o no de acuerdo para discutirlo. dicho esto COMENCEMOS!!\r\n\r\n\r\n1)  UN SOPORTE: es un rol que juega normalmente en bot lane y su funci&oacute;n es ser el sost&eacute;n, la mano derecha del ADC  que demuestra que lo proteger&aacute; y dar&aacute; su vida por ella (o &eacute;l). se dividen en 2 tipos de soportes lo soportes TANQUES y los soportes MAGOS.\r\n\r\nLos &quot;soportes magos&quot; {{champion:40}} {{champion:16}} {{champion:37}} {{champion:25}}  estos son ejemplos. tienen una cantidad de mana y vida moderada y sus habilidades tienden a ser variadas como curar, paralizar, ralentizar, empujar, proteger, etc.  al no tener mucha vida y ser mas afectados por el da&ntilde;o de los rivales. Dependen de sus habilidades para cambiar el balance de la partida aunque esto se ve afectado por el hecho que si dependen de sus habilidades consumir&aacute;n mucho mana que se soluciona con pociones o mejor dicho galletas que viene como maestr&iacute;a para ofrecer mana y vida o items de mana o de regeneraci&oacute;n de vida tambi&eacute;n sirven.\r\n\r\nLos &quot;soportes tanques&quot; {{champion:201}} {{champion:89}} {{champion:53}} {{champion:412}} {{champion:54}} estos son ejemplos. tienen una cantidad mayor de vida y de resistencia m&aacute;gica y defensa (varia seg&uacute;n las runas y maestr&iacute;as) estas cualidades les permite soportar por mas tiempo que los otros soportes el da&ntilde;o de sus rivales y poder empezar ellos las peleas en equipos o peleas en bot lane contra lo otros 2. tambi&eacute;n tienen habilidades para poder paralizar, ralentizar y habilidades para aguantar mas en peleas y poder llamar mas la atenci&oacute;n para que te ataquen y el adc pueda atacarles siendo ignorada (a veces).\r\n\r\n2)FUNCI&Oacute;N DE UN SOPORTE: como soporte vos ayudaras a tu adc a empujar la linea para que pueda farmear tranquilo, sustentarlo de vida, defensa, da&ntilde;o si lo necesita, ofrecerle visi&oacute;n en los arbustos para evitar ataques sorpresas del jungla o de otro jugador de la linea siempre. &iexcl;&iexcl;PERO!! todo esto lo har&aacute;s al ritmo del adc &iquest;A que me refiero con esto? si tu adc juega agresivo jugaras agresivo pero con cabeza no vaya a ser que tanta agresividad y mueran por ello por un error. Y si no juega agresivo no jugaras tan agresivo  esto se debe a que no todos lo adc son jugadores pro asesinos a sangre fria todos tienen su manera de jugar pues somo personas diferentes en una computadora. e notado &uacute;ltimamente que al adc se le exige estar a la altura de un soporte y no al rev&eacute;s y me parece extra&ntilde;o(estu***o para no decir malas palabras) ya que al ser diferentes no puedes exigirle al alguien estar a tu &quot;altura&quot; ella/el tiene su manera de jugar y debes ajustarte a ello, esto no quiere decir que no hagas nada si tu adc este muy pasivo simplemente si llega a pasar eso, desgasta a tu enemigo haciendo que gaste su flash o su extenuar o su health, ignite, mana etc o gasta su vida para que pierda sus recursos y este indefenso y ah&iacute; poder atacar claro marcando al objetivo para que tu adc se de cuenta y acabar con el. Es una manera efectiva de poder acabar con alguien y no tener que hacer de &quot;adc&quot; vos para que tu ADC tenga que matar y dejar de farmear o descuidarse y poder morir. \r\n\r\n3)  LOS WARDS: ES SIMPLE  la diferencia entre bot lane de mid y top lane es que puedes wardear para ver si alguien viene asi tu adc no se tiene que preocupar de posibles ataques sorpresas ya que cuando un pushea se aleja de su torre y tiende a estar mas expuesto uno es por eso que al wardear uno puede anticiparse a retirarse evitando una masacre.\r\n\r\n4) EL CONOCIMIENTO DE LOS CAMPEONES: Esto es algo fundamental en todos los que juegan mid, top, jg, adc, y soporte pero como me especializo en bot lane dire los campeones y sus combos con adc y campeones para contrarrestar a otros campeones refiriendome a soportes claro esta:\r\n\r\n{{champion:201}} {{champion:18}}  hacen buena pareja...digo colegas al luchar en combate esto se debe a que Tristana su E funciona d&aacute;ndole b&aacute;sicos al objetivo mientras la mina que lanzaste se carga y se hace mas fuerte pero con la pasiva de Braum que al atacar a un objetivo con su Q o sus b&aacute;sicos generara 1 de 4 cargas al completar las cargas de Braum en el enemigo se paralizara  por 1.5 segundos y esto combina con la E de Tristana ya que estar&aacute;s paralizandolo y pudiendo completar las cargas de Tristana en el enemigo dandote una muerte segura o que se vaya a base y pierda oro y experiencia ya que estar&aacute;s adelantado en items y habilidades mejoradas ante tus rivales de bot.\r\n\r\notro ejemplo: {{champion:133}}  y{{champion:89}} {{champion:53}} {{champion:40}} {{champion:37}}  Quinn es un adc que en etapa temprana durante la partida es de papel o sea puede sufrir mucho da&ntilde;o debido a su corta distancia en ataque dej&aacute;ndola algo expuesta es por eso que la mejor manera de contrarrestar su desventaja es  usando a Sona que le dar&aacute; vida y un extra de da&ntilde;o de ataque, tambi&eacute;n janna hace lo mismo su ultima habilidad le dar&aacute; vida y su escudo que es la E le dar&aacute; protecci&oacute;n y un extra de da&ntilde;o y si janna si te da un escudo tendr&aacute;s mas da&ntilde;o. Leona puede stunear dejando al enemigo inmovilizado por un tiempo (un buen soporte de leona puede dejar estuneado a un enemigo por 4 segundos) lo cual le brindara a Quinn 4 segundos para hacer mucho da&ntilde;o o blitscrank que atrapa a enemigos dej&aacute;ndolos expuestos para que el adc les cause mucho da&ntilde;o.\r\n\r\nuhh me olvidaba la pasiva de Sona cumple 3 funciones de las cuales solo usan 1 por lo que veo o las usan demasiado\r\n\r\naura azul: la que mas se usa esta pasiva har&aacute; que Sona haga mas da&ntilde;o en su siguiente ataque b&aacute;sico\r\naura verde: la pasiva provocara que en el enemigo que lance su siguiente basico disminuir&aacute; su da&ntilde;o (sirve para enemigos poderosos ya que reduces el da&ntilde;o que hagan)\r\naura rosa: disminuir&aacute; la velocidad de movimiento del enemigo al qeu lance su basico\r\n\r\ny bueno de eso se trata este punto de conocer a tu campe&oacute;n para sacarle el m&aacute;ximo provecho y de tratar de conocer a tu adc para saber que soporte le vendr&iacute;a bien o que soporte necesita contra el enemigo.\r\n\r\n\r\n5) SOMOS SOPORTES NO dios: puede pasar que un adc no tenga reflejos o cometa errores y nosotros tengamos que sacarla de ese error aunque es verdad que tenemos la obligaci&oacute;n de ayudarla no lo vale si nuestra muerte aportara que se feddee el enemigo por ejemplo si somos {{champion:25}}  contra {{champion:53}}  sabemos que si bltiz logra hacer un tiro directo a nuestro adc la atrapa y se la lleva pero podemos usar nuestra E (que tiene un enfriamiento de 13 segundo creo) para anular esa habilidad y tendr&aacute; un escudo por un tiempo contra ataques m&aacute;gicos pero si la atrapa de nuevo bueno ah&iacute; no se puede hacer mucho el adc tiene que ser consciente de que los soportes no estar&aacute;n para sacarla de todo li&oacute; en el que se meta tiene que ser consciente de que movimiento har&aacute;. Si sigue pasando vete a otra linea ayuda al que tenga chance de poder feddearse y que sea consciente y que se joda tu adc por manco. Nah era joda. En serio av&iacute;sale y decidle que tenga cuidado parte de ser soporte es evaluar la situaci&oacute;n y ver si se puede lograr algo o es mejor tener cuidado y esperar.\r\n\r\n6) &quot;SI PUEDES MATARLO LA KILL ES TUYA&quot;: wow wow wow espera lee esto. normalmente puede pasar que est&eacute;s a un tiro de habilidad o un b&aacute;sico o poder tirar flash para matarlo etc. como adc que fui no es lindo que si tenia la posibilidad de matarlo lo mate mi soporte. Si tenes la chance de poder matarlo SOLO si tu adc no puede esta fuera de alcance o muri&oacute; o esta stuneado o lo que sea ll&eacute;vate la muerte al menos no sera en vano y tendr&aacute;s oro y EXP al igual que tu ADC y si no puedes matarlo como dije, mejor que se vaya as&iacute; tenes oro y experiencia mientras tu adc farmea.\r\n\r\n7) APRENDE Y PRACTICA: uno siempre aprende y no debe dar algo por sentado siempre cambiara los items los modos de juego, las habilidades de campeones, las t&aacute;cticas. hay que aprender y esforzarse por mejor y eso es tener actitud positiva y si pierdes aprender de los errores para mejorar saber que sin vos que eres alguien importante en el equipo. puedes lograr lo que sea EL MUNDO ES TUYO ERES EL REY ERES TODO EL MUNDO SE INCLINARA ANTE TI ERES DIO............vale ok pong&aacute;monos serios.\r\nPara buenos jugadores no en habilidad sino en comportamiento ellos siempre consciente o inconscientemente saben que estar&aacute;s para ayudarlos por eso eres Jungla.. digo soporte y eres la piedra angular del equipo. \r\nY bueno que ac&aacute; termina mi libro de guia de soporte y YO humildemente se que como support vos llegaras lejos y cualquier cosa que haya omitido o me faltara decir ponlo en los comentarios y con gusto te responder&eacute;. buena suerte invocador.","replies":[{"poster":"Lunari Red Mask","date":"2016-08-28T00:20:26.111+0000","up_votes":3,"down_votes":0,"body":"Hola\nVoy a aclarar que saltee la parte en que hablabas de cada soporte en particular y que mencionas a sona, por la simple razón de que ya puedo leer in-game las habilidades y que ya las conozco. \nPor lo que escribes se nota que algo sabes de soportes y como suportear. \nClaro que hay que recalcar que hay partes discutibles. Vamos allá: ~~como soporte tu deber es morir por tu adc~~ no, feedearas y no ayudarás en nada muriendo, vive y trata de que tu adc viva, sino, mala suerte y que se joda tu adc. ~~un soporte debe adaptarse a su adc~~ no, un adc siempre se adapta a su soporte porque será el encargado de decidir las calls que le dirán cuando atacar y a tu equipo entero cuando ir a por un dragón, barón. Al ser el soporte el que más tiempo libre para mirar el mapa tiene. ~~wardear es tu deber~~ okey, esto lo escribi yo, no es textual, pero esa era la idea, y es discutible, una {{item:2043}}  solo puedes tener dos en inventario y una en juego y en total solo se pueden tener 4 en el mapa. {{item:2049}}  solo te ofrece 3 wards es deber de todos wardear o hacer el insect (la cosa verde que esta en los rios) porque con tres no es suficiente. Y sí vas a wardear mínimo que te acompañen para que no te embosquen y mueras.\n~~el soporte es soporte del adc~~ No, el soporte suportea a todo su p* equipo, sí tu adc es m* que se *  y que *** XD. Pero ya, sí ves que el que mejor va es el top o el mid o el jungla, trata de hacer lo que dices que haces por tu adc \"a ellos\", los curas, los proteges.  \nEso nomas.\n\nSaludos.","replies":[{"poster":"Soulwhite96","date":"2016-08-28T00:40:56.102+0000","up_votes":1,"down_votes":0,"body":"tenes razón. cuando escribí esto estaba en un momento con algo de emoción y  me deje llevar por algunas cosas y omití agradezco tu respuesta. olvide mencionar qeu esto es lo que aprendí así que esto no seria 100% como ser soporte aun así intento aprender como muchos como muchos.","replies":[{"poster":"Lunari Red Mask","date":"2016-08-28T01:03:25.166+0000","up_votes":1,"down_votes":0,"body":"Cubres todo lo general y vuelvo a mencionar me parece buena guía. Solo que lo discutible siempre lo será. No quiero entrar en debates, así que pondré un ejemplo del lado de la jungla: ¿de quién es el buffo azul?  jajaja, nunca habrá una sola respuesta. Eh saludos y suerte.","replies":[]}]}]},{"poster":"Nombre ofensivo","date":"2016-08-28T00:28:55.064+0000","up_votes":2,"down_votes":0,"body":"mmm, este post ha viajado desde la s4 hasta el 2016","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-28T00:38:41.158+0000","up_votes":1,"down_votes":0,"body":"Lei pociones de mana por ahí xd pero aun no lo termino.","replies":[{"poster":"Nombre ofensivo","date":"2016-08-28T00:46:24.164+0000","up_votes":1,"down_votes":0,"body":"aguanta que aun ni reworkeaban a gangplank","replies":[]}]}]},{"poster":"kipkeior","date":"2016-08-28T03:37:05.079+0000","up_votes":1,"down_votes":0,"body":"¿Por qué Tham Kench no cuenta como soporte?.\n¿Es por el cambio de su daño de R a su pasiva?.","replies":[{"poster":"Soulwhite96","date":"2016-08-28T23:40:41.120+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kipkeior,realm=LAS,application-id=8sKIclmi,discussion-id=RVfP2KJw,comment-id=0003,timestamp=2016-08-28T03:37:05.079+0000)\n>\n> ¿Por qué Tham Kench no cuenta como soporte?.\n> ¿Es por el cambio de su daño de R a su pasiva?.\n\nno creo haber dicho que tham kench no cuente como soporte. se que es un buen campeón pero al no haberlo probado todavía no tengo una respuesta aunque lo e visto y es un buen soporte","replies":[{"poster":"kipkeior","date":"2016-08-29T02:43:11.515+0000","up_votes":1,"down_votes":0,"body":"Ah vale , como no aparecía en la lista de soportes tankes pensé que no lo clasificabas como soporte por el cambio de la pasiva.","replies":[]}]},{"poster":"ArqueroEbrio","date":"2016-08-28T11:00:26.181+0000","up_votes":1,"down_votes":0,"body":"ehhh??? quién dice que no es soporte? {{sticker:zombie-brand-facepalm}}","replies":[]}]},{"poster":"XxlentaoxX","date":"2016-08-28T00:06:01.477+0000","up_votes":1,"down_votes":0,"body":"te chuparia todo el soporte.","replies":[]}]}