{"poster":"Besthunterjk","date":"2016-09-27T18:01:17.771+0000","title":"Illaoi mains 68% Winrate","subforum":"Gameplay","embed":{"description":"LoL Statistics, Builds, Runes, Masteries, Skill Orders, Counters and Matchups for Illaoi when played Top. Statistics include Illaoi's Win Rate, Play Rate and Ban Rate. Counters include who Illaoi Top is Strong or Weak Against.","url":"http://champion.gg/champion/Illaoi","image":"http://ddragon.leagueoflegends.com/cdn/6.19.1/img/champion/Illaoi.png"},"up_votes":63,"down_votes":29,"body":"LEL","replies":[{"poster":"LoLKiru","date":"2016-09-27T18:13:32.383+0000","up_votes":40,"down_votes":2,"body":"As someone who knows and plays with an illaoi one trick regularly, you can really never fight her; even fighting her as a group is risky since she can use Leap of Faith to just spawn multiple tentacles and kill everyone there if she plays it right.\n\nDoes being unable to fight her without some risk make her broken? Quite possibly.\n\nImportant to remember though she has key flaws that can be exploited (most notably lack of mobility) if she didn't have those key flaws, she'd likely see pro play pretty often.","replies":[{"poster":"Zerenza","date":"2016-09-28T00:04:06.967+0000","up_votes":17,"down_votes":3,"body":"Certain Champs are actually really good against her, but most people pick completely wrong against her. I can't tell you how many games i'v played with her against Gnar,Teemo and Quinn. Those are the absolute worst picks into her, not to mention most people don't want to learn how to play against her. It's just like fighting renekton or pantheon both of their early games are extremely powerful(stronger than hers btw)  and people usually play safe and be passive when they fight them.\n\nAs an illaoi main myself i'v found that people will call for help(bad idea) or they'll try and all in me at whatever level, also a bad idea. Her playstyle is reactive, that means she's waiting for you to get out of position and make a bad play so that it gives her the advantage, like fighting under a tentacle which people always do or standing in the middle of her ultimate. Her kit is designed to punish player's for making mistakes and she litterally yells \"Learn!\" at you but people just don't do it. \n\nLastly, a bad illaoi player will build items like Tri-Force and Iceborn first and if they do that you really should just be passive and wait because that player just wasted her massive mid-game power spike that building properly on her gets you.","replies":[{"poster":"DeathBot666","date":"2016-09-28T11:16:20.540+0000","up_votes":7,"down_votes":0,"body":"Personally I find taking nasus is pretty good against her.\n\nHis natural life steal can keep up with the sustain on her tentacles, and since he can stack her tentacles a good nasus benefits more from being made a vessel than the illaoi can.","replies":[]}]},{"poster":"MonkeyMadness","date":"2016-09-28T01:09:10.170+0000","up_votes":4,"down_votes":7,"body":"She requires a ridiculous amount of coordination to bring down, and even then, her massive healing potential doesn't even  make it a guarantee. The only way to beat her is to separate her from her tentacles, but given that she can just ult and spawn up to 5 of them, this is rather impractical. Also, no person with half a braincell that's playing Illoai would allow themselves to be baited to far from their tentacles.","replies":[{"poster":"Zerenza","date":"2016-09-28T01:32:08.732+0000","up_votes":4,"down_votes":1,"body":"Try using champions with stronger early games and just playing safer or champion with silences. You can also just outscale her with champs that tank better than her. I remember going 6/0 against a top lane voli and he outscaled into a better tank so not only did i loose but it was really embarrassing even if he had 20 deaths, he scaled better as a tank.","replies":[{"poster":"Astôlfo","date":"2016-09-28T01:33:07.280+0000","up_votes":11,"down_votes":1,"body":"Illaoi's not even a tank in the first place, she's a juggernaut.","replies":[{"poster":"MonkeyMadness","date":"2016-09-28T02:08:35.866+0000","up_votes":2,"down_votes":14,"body":"Do not gratify this term \"juggernaut\". All juggernauts are tanks by their very definition. Calling them \"juggernauts\" is just Riot's way of justifying the ridiculous damage creep they've been favoring so much this season.","replies":[{"poster":"Astôlfo","date":"2016-09-28T02:11:21.001+0000","up_votes":13,"down_votes":1,"body":"Give me some of that tinfoil, will ya?\nAnd no, they are nothing alike.\n\nBut hey, apples and potatoes are both the same thing because they're both edible.","replies":[{"poster":"MonkeyMadness","date":"2016-09-28T02:53:21.611+0000","up_votes":1,"down_votes":7,"body":"They are both contain lots simple sugars, so in terms of nutritional value, ya pretty much the same thing. Just like tanks and juggernauts. \n\nScienced...","replies":[{"poster":"Awoof","date":"2016-09-28T06:20:21.474+0000","up_votes":5,"down_votes":0,"body":"I'm not sure if it's worth the effort to point out the flaws in this...","replies":[{"poster":"5000000000000000","date":"2016-09-28T06:44:41.309+0000","up_votes":8,"down_votes":0,"body":"All champions do damage and use spells so they're pretty much the same thing","replies":[]},{"poster":"MonkeyMadness","date":"2016-09-28T08:00:28.823+0000","up_votes":1,"down_votes":6,"body":"The point is that all these \"juggernaut\" champs fill the tank role. However, they deal MASSIVE damage, and in some cases have very little counterplay options, or are at least very frustrating to deal with (ie Illaoi). This is rather  unhealthy design, and I believe that Riot is doing this to justify the damage creep and to influence the meta toward faster games with with a more snowbally feel.\n\nAnd we all know that Riot clearly supports the damage creep. So much so that it's become a clear problem with champs like yasuo and ekko.","replies":[{"poster":"Awoof","date":"2016-09-28T11:58:06.848+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=MonkeyMadness,realm=NA,application-id=3ErqAdtq,discussion-id=RvTJAG6g,comment-id=000200030000000000000000000000000001,timestamp=2016-09-28T08:00:28.823+0000)\n>\n> The point is that all these &quot;juggernaut&quot; champs fill the tank role. \n\nNo they don't. They are tanky but usually have very little to no cc/utility and no initiation power. In exchange for that they have the damage when they manage to stay close to you.\n\nDon't get me wrong, I don't like their design either, because either they destroy or are pretty much useless, but they do different things than a tank exactly because of that.","replies":[]}]}]}]}]}]},{"poster":"My Waifu Vanilla","date":"2016-09-28T03:47:18.115+0000","up_votes":6,"down_votes":0,"body":"As is Voli tbh. Voli fits the juggernaut theme much more than a tank since he offers VERY LITTLE peel to help his carries and can get kited to hell and back without Q.","replies":[{"poster":"Ralanr","date":"2016-09-28T11:59:59.157+0000","up_votes":5,"down_votes":0,"body":"Finally someone else says it!","replies":[]}]},{"poster":"Zerenza","date":"2016-09-28T03:28:25.326+0000","up_votes":3,"down_votes":0,"body":"Yeah that's the point, any tank going against her will eventually out scale her. Because she isn't a good tank.","replies":[]}]}]}]},{"poster":"YumaS2Astral","date":"2016-09-27T18:54:54.218+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=LoLKiru,realm=NA,application-id=3ErqAdtq,discussion-id=RvTJAG6g,comment-id=0002,timestamp=2016-09-27T18:13:32.383+0000)\n>\n> As someone who knows and plays with an illaoi one trick regularly, you can really never fight her; even fighting her as a group is risky since she can use Leap of Faith to just spawn multiple tentacles and kill everyone there if she plays it right.\n> \n> Does being unable to fight her without some risk make her broken? Quite possibly.\n> \n> Important to remember though she has key flaws that can be exploited (most notably lack of mobility) if she didn&#x27;t have those key flaws, she&#x27;d likely see pro play pretty often.\n\nAlso lack of hard CC. Her only CC is the slow she gets on someone once you kill their spirit (or they get far enough). Or if she buys {{item:3025}} (I don't see this item very often on her)\n\nThat said, she is one of the most underrated champions in the game, her early game presence is beyond ridiculous (though she certainly falls off late game)","replies":[{"poster":"Zerenza","date":"2016-09-28T00:06:24.639+0000","up_votes":2,"down_votes":0,"body":"Yeah her early game and mid game are her strongest points, most illaoi player's waste her mid game by building things like tri-force and iceborn when those items won't help her at all. She'll just fall off faster so that's why illaoi mains have a high winrate, they also adjust to having to hit people from multiple angles with her tentacles do deal maximum damage and combing correctly, along with animation canceling.","replies":[{"poster":"RocketRelm","date":"2016-09-28T00:41:48.932+0000","up_votes":1,"down_votes":0,"body":"So what items 'would' you call the ones that are best? I've never played her, so I don't know personally.","replies":[{"poster":"Zerenza","date":"2016-09-28T01:25:13.073+0000","up_votes":5,"down_votes":0,"body":"Blackclever, Steraks Gage and Deaths Dance. \n\nBlackclever: Unlike with Trinity Force, you can utilize every stat on this item to maximum efficiency. She doesn't need the attack speed on Tri-Force so it's pretty much useless, she's an AD Caster so she spams her abilities and you can animation cancel to auto attack faster after them anyway. Spellblade also doesn't cover the damage this will give her.\n\nSteraks Gage: Illaoi's biggest weakness early is burst damage, she doesn't have the tank stats that other's have, she starts with a small 30 MR and 40 Armor which in comparison to Shen and other top laner's is very weak. She also has low health, so when team fighting in mid-game this is infinitely better than any resistance item, it will let you live longer so you can get the full utility out of your ult and pretty much no one can 1v1 you after you get this.\n\nDeaths Dance:  You'll gain an extra 15% life steal on all of your tentacle slams, this coupled with your passive makes you nearly unkillable, so when you go in and ult, you won't have to worry about being bursted and if they fed you and you got this before 30 minutes, they pretty much gave you a win.\n\nThe last three items are Boots of Swiftness or Mercury Treads, Spirit Visage(increases healing from all sources) and probably either an armor resistance item that gives health ore another MR item depending on the situation.\n\nMy favorite build is: Black Clever, Steraks Gage, Deaths Dance, Spirit Visage, Randuins Omen and Swifties. \n\nBC and Steraks always first because the mid-game spike with this is incredible then deaths dance and by then you'll most likely win every team fight until you fall off. There have been times i sat in the enemy base from the 20 minute mark and basically farmed champions with this build just because i knew how strong i was compared to them.","replies":[]}]}]}]}]},{"poster":"Meep Man","date":"2016-09-27T18:27:20.317+0000","up_votes":23,"down_votes":2,"body":"I feel like there have been a ton of these kinds of things popping up over the past few months where people complain about a champion's power once mastered. The thing is, how high of a win rate is acceptable if you have mastered a champion?","replies":[{"poster":"Ralanr","date":"2016-09-27T18:30:32.387+0000","up_votes":7,"down_votes":0,"body":"That's a good question.","replies":[{"poster":"Meep Man","date":"2016-09-27T18:37:20.932+0000","up_votes":26,"down_votes":1,"body":"Yeah, I mean, it's obvious a 50% win rate isn't accepted by the community once a champion is mastered since otherwise Azir would be the pinnacle of balance.","replies":[]}]},{"poster":"Astôlfo","date":"2016-09-27T18:31:36.222+0000","up_votes":3,"down_votes":0,"body":"Sample size should be kept in note as well.\nOld Yorick had like 70% winrate for 125+ games as well, except that meant jackshit anyways.","replies":[{"poster":"Vistha Kai","date":"2016-09-27T18:44:59.667+0000","up_votes":12,"down_votes":0,"body":"Whole two people.","replies":[{"poster":"PermabannedGaren","date":"2016-09-28T02:41:11.834+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Vistha Kai,realm=EUNE,application-id=3ErqAdtq,discussion-id=RvTJAG6g,comment-id=000400010000,timestamp=2016-09-27T18:44:59.667+0000)\n>\n> Whole two people.\n\nI didn't know two people made up 7.26% of her playerbase.","replies":[{"poster":"Astôlfo","date":"2016-09-28T03:37:35.543+0000","up_votes":5,"down_votes":0,"body":"Yorick's a her?","replies":[]}]}]}]},{"poster":"Sightless66","date":"2016-09-28T00:18:04.322+0000","up_votes":9,"down_votes":0,"body":"Another question: how reliablle is this data? I know the winrate for 125+ skarner players two patches ago was 67%. Now it is not. Nothing changed with skarner. I also know illaoi's 125+ winrate was only about 60% last month.\n\nSeems to me that maybe people blow this statistic way out of proportion. If it's changing randomly every patch, maybe it means nothing.","replies":[{"poster":"Doseqis","date":"2016-09-28T05:58:40.204+0000","up_votes":1,"down_votes":3,"body":"Like i mentioned from the numbers provided it is around 1000-1500 players averaging this winrate so it is pretty substantial, and 60% winrate is still pretty high for last month.","replies":[{"poster":"Sightless66","date":"2016-09-28T07:29:55.694+0000","up_votes":4,"down_votes":0,"body":"> 1000-1500 players averaging this winrate so it is pretty substantial,\n\nIf it's resulting in a 7% shift in winrate patch by patch despite no changes, then it obviously isn't substantial enough. You show me data with that kind of uncertainty, and my first response is to question the data.\n\n>60% winrate is still pretty high for last month\n\nSure, if I believed that the statistic was accurate. As far as I'm concerned, the variance in the data patch to patch is so great that drawing any conclusions isn't warranted. For all I know, the actual winrate could be a lot less than this (after all, it has been quite a bit lower than 60% too), or even higher, and I have no way of knowing what the truth is. All it shows is that we're not drawing a very good sample.\n\nI think it's a statistic that is better off ignored. The high patch-to-patch variance even on highly-played champions strongly suggests that the stat isn't worth shit.","replies":[]}]}]},{"poster":"My Waifu Vanilla","date":"2016-09-28T03:51:15.421+0000","up_votes":5,"down_votes":0,"body":"Illaoi's problem is she is punishing to those that don't know the match up and don't respect her (and thus can snowball a lead she gains). Also, people love picking stupid things into Illaoi like ranged champions (which are REALLY easy match ups since every E is a guaranteed vessel since they are so damn squishy) which is arguably another factor into her high winrate. Pick Lee Jungle or Gragas and she just falls apart in every teamfight since they are arguably the hardest counter to a champion in the game since Dragon Rage/Explosive Cask quite literally removes Illaoi from every teamfight she gets in and basically turns them into 4v5s.\n\nIllaoi falls off like a brick late game only due to the fact that she loses to any form of hard CC since if she can't W....she can't do anything in teamfights.","replies":[]}]},{"poster":"YoungFarmer","date":"2016-09-27T22:25:31.827+0000","up_votes":15,"down_votes":0,"body":"sion mains 75% winrate lol \nhttp://champion.gg/champion/Sion/Jungle","replies":[{"poster":"Tis a nice day","date":"2016-09-28T00:41:10.399+0000","up_votes":6,"down_votes":0,"body":"And it's at 15-50 games too.","replies":[{"poster":"Astôlfo","date":"2016-09-28T00:44:10.785+0000","up_votes":9,"down_votes":0,"body":"Shhh, logic scares the QQers.","replies":[]}]}]},{"poster":"SlashStriker","date":"2016-09-27T23:06:40.626+0000","up_votes":10,"down_votes":0,"body":"she actually has 50.47%% win rate according to the site","replies":[{"poster":"Irelia Bot","date":"2016-09-28T00:21:02.009+0000","up_votes":1,"down_votes":10,"body":"That 68% is far higher then any \"hard to master\" champs like Azir or LeBlanc for the same number of games played.","replies":[{"poster":"Astôlfo","date":"2016-09-28T00:33:35.843+0000","up_votes":10,"down_votes":1,"body":"Gee, maybe because Azir is trash and far more people play LeBlanc than Illaoi? Sample size is a thing y'know.","replies":[{"poster":"Irelia Bot","date":"2016-09-28T00:40:36.285+0000","up_votes":1,"down_votes":8,"body":"You are defending her because you play her a lot and don't have any constructive changes to offer.","replies":[{"poster":"Astôlfo","date":"2016-09-28T00:42:46.768+0000","up_votes":11,"down_votes":1,"body":"I mean, sure, you're free to pull assumptions out of your ass.\nDon't bother posting in a discussion thread though, if you're not going to make any meaningful points.\n\nI'm defending her because the people that cry about her are just plain bad and don't know how to deal with her, which is honestly sad, although it's a bit hilarious as well.","replies":[]}]}]}]}]},{"poster":"Snowplosion","date":"2016-09-27T22:14:02.857+0000","up_votes":1,"down_votes":0,"body":"Can someone explain this post to me? Please?","replies":[{"poster":"Astôlfo","date":"2016-09-28T00:32:55.262+0000","up_votes":11,"down_votes":1,"body":"Using a miniscule, constantly fluctuating sample size to cry about a champion :P","replies":[{"poster":"Snowplosion","date":"2016-09-28T02:11:04.061+0000","up_votes":1,"down_votes":0,"body":"Thanks. I feel dumb >.<.","replies":[{"poster":"Astôlfo","date":"2016-09-28T02:13:17.311+0000","up_votes":6,"down_votes":0,"body":"No problem.\n\nSure, Illaoi's 125+ games-in-ranked mains have a 68% winrate.\nExcept the number changes constantly because there's so few of them it doesn't make for any significant sample size.\nLike, wow, all 5 of those players can do well.\n\nAnd then you have Nunu's mains at 71% winrate, Galio's at some other 70-something-ish number, Sion at 75%, etc etc.\nNumbers without sample size means nothing :P\nBut people are just venting and QQing here.\n*shrug*","replies":[]}]}]}]},{"poster":"statelesskiller","date":"2016-09-27T20:59:13.053+0000","up_votes":2,"down_votes":3,"body":"a masters player who demoted to gold told me that illaoi was over powered . . . i told him he was stupid. she was as difficult to fight as any other champion. she has skill shots that are slow and highly telegraphed. AND HE WAS PLAYING LEESIN. who is a great counter to illaoi. literally kick her out of her ult and now she loses out on all her damage output\n\nbut then i saw a team fight with her. she was against a heavy dive comp. lucian nautilis nocturne lissandra alistar. i mean DIIIIVE. and she just fucked them. E ult. WWWWWWWWWWWWWW and there where way to many tentacles to dodge. and they came on way to fast\n\ni dont know what to think about her. she can defintly carry games though. any attempt to engage on her team ends with a pentakill with her","replies":[{"poster":"VasilisGreen","date":"2016-09-27T21:20:29.781+0000","up_votes":7,"down_votes":0,"body":"How does one demote from Masters to Gold?","replies":[{"poster":"statelesskiller","date":"2016-09-27T21:49:56.243+0000","up_votes":4,"down_votes":0,"body":"like i said he was pretty stupid. he might have just rank decayed. he had a masters border but he was in gold","replies":[{"poster":"Doseqis","date":"2016-09-28T06:04:48.851+0000","up_votes":2,"down_votes":3,"body":"B-b-b-b-b-b-booosted, but illaoi also leaves a sour taste in your mouth as she is completely bullshit to play against as a melee champ as she just sits top split pushing and killing anyone who dares come top when she has ult and her team gets free objectives while you send 2-3 top just to send her away.","replies":[{"poster":"statelesskiller","date":"2016-09-28T06:11:20.279+0000","up_votes":4,"down_votes":0,"body":"well i mean. most juggernauts are like that. especially her. any fight where YOU COME TO HER is the ones she wins. but if she has to come to you its quite abit harder on her\n\nalso never go near a allow in the few tritentacles zone. 1 tentacle is alot of power. 2 is alot more. 3? dont ever fight a illaoi there.","replies":[]}]}]}]}]},{"poster":"WarlockLaw","date":"2016-09-27T21:12:42.023+0000","up_votes":4,"down_votes":0,"body":"How about we talk about Galio top whose win rate is 100% for those who've played 50-125 games, and drops to a meager 69.72% beyond that.\nhttp://champion.gg/champion/Galio/Top","replies":[{"poster":"Unstoppable Monk","date":"2016-09-27T22:39:52.099+0000","up_votes":1,"down_votes":0,"body":"Probably because they play 1-49 games and seem to lose every time, thus leaving the 17 mainers / 50+ games that play Galio while playing League in a Delorean eating someone else's spaghetti.","replies":[]}]}]}