{"poster":"DragonDeluxe","date":"2018-03-09T22:52:35.706+0000","title":"[DUDA] Clasificación más alta de la temporada anterior","subforum":"Problemas Técnicos","up_votes":4,"down_votes":0,"body":"Hola, tengo una duda en cuanto a algo: si yo estuve en diamante un largo tiempo, y termino la season en oro por inactividad, el marco que me queda de qu&eacute; divisi&oacute;n ser&iacute;a? porque seg&uacute;n leo figura como &quot;clasificaci&oacute;n m&aacute;s alta de la temporada&quot; lo que me da a entender que la de diamante, pero no estoy seguro.\r\n\r\nY esto &uacute;nicamente se cambia una vez al a&ntilde;o que termina la season verdad?","replies":[{"poster":"Naxo Brewmaster","date":"2018-03-09T22:55:45.234+0000","up_votes":1,"down_votes":0,"body":"Diamante porque hasta esa llegaste... es como la S que sacas con el campeon, si primero sacas una S+ y en la ultima partida que jugaste una s-, no te marca la S- te pone la S+... Yo en flex llegue a plata 5 (Subi desde bronce 4 :'v) y luego baje a bronce, pero me dieron el icono de plata...","replies":[{"poster":"Néd Stark","date":"2018-03-11T01:11:36.073+0000","up_votes":1,"down_votes":0,"body":"> Diamante porque hasta esa llegaste... \n\nLo dudo, porque el 2016 fui oro todo el año y justo en octubre-noviembre por problemas personales, me puse a jugar sin saber lo que hacía, solo entraba para olvidarme de la situasión que estaba pasando, en fin, bajé a plata v y no rankié más, al final de temporada me quedé con marco de plata.","replies":[]},{"poster":"Rick Silence","date":"2018-03-09T23:09:32.684+0000","up_votes":1,"down_votes":0,"body":"Pero bajaste a bronce en la pretemporada y terminaste la season siendo plata? O eras plata en la otra cola, en solo q? :3\nOjalá fuera como decís, pero lo dudo mucho.","replies":[{"poster":"Naxo Brewmaster","date":"2018-03-10T18:56:51.012+0000","up_votes":1,"down_votes":0,"body":"en la pre temporada, pero así debería ser, ya que te dice que la clasificación mas alta de la temporada sera tu marco","replies":[{"poster":"Rick Silence","date":"2018-03-10T19:34:20.870+0000","up_votes":1,"down_votes":0,"body":"No, no. Contaba la liga en la que estabas el día que terminó la temporada. La pretemporada solo sirve para el mmr para las partidas de posicionamiento de la temporada siguiente.","replies":[{"poster":"Naxo Brewmaster","date":"2018-03-10T22:38:57.003+0000","up_votes":1,"down_votes":0,"body":"Y yo te dije lo contrario? Lo entendiste mal o yo lo explique mal no sé xD {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Rick Silence","date":"2018-03-11T00:31:29.717+0000","up_votes":1,"down_votes":0,"body":"Sí, yo creo que ambas XD\nBueno, es probable que me deje bajar por inactividad, pues voy a estar ocupada. Así que si a final de año quedo con marco de platino y no de oro, vos tenías razón.\nPero la verdad, me parece muy extraño.... Estás seguro o es trolleo? XD :p","replies":[]}]}]}]}]}]},{"poster":"Diosmo","date":"2018-03-09T23:25:51.627+0000","up_votes":1,"down_votes":0,"body":"En el momento de las 0hs de la fecha que termino la temporada va a ser el marco que te toca. No importa despues si te bajaron en pretemporada.\n\nSi quedaste en diamante cuando cerro la Temporada, ese marco tendrias que tener. Si cuando cerro bajaste a Oro, entonces vas a tener el de Oro.\nAhora tambien tene en cuenta que Solo/Duo y Flex tienen rankings separados por ende vas a tener el marco para cada uno.\nEn normales, ARAM, etc se te va a mostrar el marco mas alto que alcanzaste de las dos mencionadas.","replies":[]},{"poster":"Rick Silence","date":"2018-03-09T23:07:26.344+0000","up_votes":1,"down_votes":0,"body":"Creería que es al momento de terminar la season, pero de las dos colas, solo q y flex, el marco que se muestra en normales es el de la liga más alta.","replies":[]},{"poster":"Champi4UP","date":"2018-03-09T22:58:26.747+0000","up_votes":1,"down_votes":0,"body":"Te pone el marco de Oro y al empezar a jugar nuevamente empezás en Plata u Oro.\n\nDiría que está mal traducido y es: clasificación que estás cuando finaliza la temporada.\n\nSí, cambia una sola vez al año.\n\nExcepto si consideran la cuenta como eloboosteada, ahí le quitan todos los marcos anteriores y no ganás ninguno durante el año.\n\nTengo marquito de Platino 3 que es donde quedé, siendo que llegué a Platino 1 :v hay pocos detalles que lo diferencian.","replies":[{"poster":"Rick Silence","date":"2018-03-09T23:06:01.406+0000","up_votes":1,"down_votes":0,"body":"No, no. Si bajó solo por inactividad va a seguir teniendo mmr de diamante, por lo que probablemente lo coloquen en platino uno","replies":[]}]}]}