{"poster":"StoryDuck","date":"2015-01-08T20:16:42.472+0000","title":"Impossible To Carry (Rant)","subforum":"[ARCHIVED] General Discussion","up_votes":2,"down_votes":1,"body":"It just can't be done.  I call shots with pings I get my adc fatter then Gragas and even with all that...still lose most of my games.  I ward I have a ridiculously good kda my participation is almost always over 50% (Yep I roam often) even 70% for kills but no matter how good I am I'm looking at being demoted from gold 5 to silver (was already demoted from gold 4)....  I do okay other roles but don't enjoy them as much and lets face it people at low elo almost never ward.  I've lost more games in the past 20 games with a 10 kill lead on my team and the enemy is hiding in their base then I won.  What happens?  No idea.  Next thing I know after we winning everyone is getting caught out and dying and my team ends up dying against the enemy team despite being 10k+ gold ahead.  I've literally lost games when I have 0/0/20+.   I find it ridiculous that my kda and participation are so good yet I am getting demoted.  I know there is no love for support mains but this is crazy.  Now this only appears to happen in ranked games....go figure I can play in team builder time and time again and have a 75% win rate until it starts pitting me against diamond and plat players (Soraka, Lulu, Nami, Leona seem to get that a lot).  \r\n\r\nI'll admit I'm not the best at CSing and that's because I HATE IT!  CSing is the most mind numbing boring thing in the game!  I can do alright but I will almost always rush some way to just clear the damn wave and go somewhere else.  However, it looks like I have no choice but to master this stupid skill until such a rank that adc's and the team know better then to try 1v5ing or exploring the enemy jungle without wards or farming wolves while the team is dying or chasing a single support halfway across the map only to die to the newly respawned top laner with TP instead of getting a tower or dragon or baron (seen my adc chase for over 2 minutes more then once).  The next time you wonder where the supports are, take a moment to realize that **YOU CANT CARRY FROM SUPPORT!**  So until Riot allow supports to earn more gold with their items I guess I'm learning a new role out of necessity instead of want. \r\n\r\nPersonally I think supports should get bonus gold for all assist and not just +15 with a talent.  More like +50 or more with a tier 3 support item or perhaps the rank 21 talent in utility.  There will never be a surplus of supports until something changes for them.  Something big.  \r\n\r\nPS: Does anyone know what rank it is when ADC's stop being stupid?","replies":[]}