{"poster":"Keeper of Trees","date":"2014-09-07T13:54:47.924+0000","title":"The Lack of Quality Information About Azir","subforum":"[ARCHIVED] Miscellaneous","up_votes":8,"down_votes":4,"body":"At first when I saw that Azir was announced I was very excited, but I guess I have gotten used to all of the mystery, build-ups, and interactions that Riot has slowly been making more and more prominent with each new champion. At this point Azir has just become a huge letdown for me. It's hard to get excited for someone we know nothing about. He just kind of appeared with very little lore, and there was no discussion about him at all, unlike the last couple champs. I can't even make myself like him because he doesn't seem to meet the standards that you, RIot, have set for all of your champs. He seems like the designers put a lot of effort into making a champ and then someone forgot to make him actually mean anything. He doesn't have good quotes; Gnar has about the same numbers of champs he interacts with, and he is 4 and doesn't speak English. I am guessing you have something planned, but at this point I have little hope for him anymore. Please just tell us something Rito.","replies":[{"poster":"DocRedgrave","date":"2014-09-07T14:16:35.950+0000","up_votes":4,"down_votes":0,"body":"Give it about a week after the next patch comes out. I don't see Riot releasing anything about Azir's lore until then.","replies":[{"poster":"Keeper of Trees","date":"2014-09-07T16:10:07.189+0000","up_votes":1,"down_votes":1,"body":"But he will probably be in the next patch.","replies":[{"poster":"DocRedgrave","date":"2014-09-07T19:09:48.981+0000","up_votes":7,"down_votes":0,"body":"No. I'm actually testing him on the PBE and he's got a multitude of bugs that still need fixing. His Galactic skin sometimes bugs out after he dies and when he respawns he becomes a floating staff. Essentially he turns invisible. There's also the matter that the health bar for his passive turret is missing it's texture.","replies":[]}]}]},{"poster":"Meddler","date":"2014-09-07T22:02:47.253+0000","up_votes":10,"down_votes":3,"body":"There's a bit more about Azir's backstory still to come. We wanted to try switching things up a bit with Azir, hence him turning up on the PBE before all the details about his background, rather than the other way round as we usually do.","replies":[{"poster":"TerraRising","date":"2014-09-07T22:28:26.437+0000","up_votes":8,"down_votes":3,"body":"Seems awfully convenient, given what the Narrative team released a few days ago.\n\nPerhaps Riot didn't want lore fans pooping on more than their big retcon and the awful short lores on the PBE?","replies":[{"poster":"IS12a6435041c36e3214d49","date":"2014-09-07T22:36:49.256+0000","up_votes":3,"down_votes":1,"body":"You know the feeling from Shadow Isles event? \nAt first it's just an introduction with minor stuffs, but when League of Legends will update the site, eventually almost all will be shown and more will come later. \n\nAs for now we will speculate for the information we have been given so far.\n\n\nThere's something I want to say about my thought for {{champion:15}} Sivir's background and the Shurima due to her heritage. (Just a theory)\n\nMy thought is that she existed millenia ago as a Shuriman along with {{champion:101}}  Xerath and the other bestial guardians ( {{champion:75}}  Nasus. {{champion:58}}  Renekton and  [birdface] Azir)\n\nNasus and Azir has Ascension symbol {{item:3069}} {{item:3068}}  (the symbol which shows the new login screen) which means they have ascended as a demigod. Same goes to Renekton and Xerath but they gained some side effects which somehow corrupted them. Xerath proved to be too powerful that he couldn't be defeated, so Azir sealed himself along with Renekton and Xerath into a box, which pretty much caused Shurima to fall in ruin. Almost everyone died during the calamity, but Sivir's mother who wanted to save her daughter, gave her an artifact which will reveal her connection to Shurima, and did put her into stasis form for a millennium. The name of Sivir's mother is {{item:3157}} Zhonya.\n\nNasus weren't trapped by the box which contained Azir, Renekton and Xerath. So he wandered for a millennium on the desert, guarding the ruins of Shurima and the box.\n\nOver the millennium, the stasis has ended for the infant. Eventually she was found by the nomads and got raised. Only thing she has with her was the {{item:3096}} Nomad's Medallion.\n[](http://i.imgur.com/CHqENWf.png)\nCurrently searching for Sand Soldiers and Sun Disc models atm.","replies":[]}]},{"poster":"Garentheon","date":"2014-09-08T21:02:08.296+0000","up_votes":1,"down_votes":0,"body":"I, for one. like the change of pace. It has a bit of mystery to it, which i like. Its leaving us with a bunch of questions like; What is the history between Azir and Xerath? What really did happen between Nasus and Renekton? Why did Renekton go mad? How did Azir become Ascended? Etc.\n\nSome of these question have been answered today. Cant wait for the rest","replies":[{"poster":"Keeper of Trees","date":"2014-09-08T23:33:04.848+0000","up_votes":1,"down_votes":0,"body":"Yeah, he feels much more real now with the Fall of the Empire pages, as do the rest of the Shurimans who were in those pages. Worth.","replies":[]}]},{"poster":"Keeper of Trees","date":"2014-09-08T02:23:00.542+0000","up_votes":1,"down_votes":0,"body":"Why wasn't there a discussion though? They always make the champion feel more fleshed out.","replies":[]},{"poster":"Xenohaz","date":"2014-09-07T22:53:08.792+0000","up_votes":1,"down_votes":0,"body":"Question:\nWill Azir be released before or after the big lore retcon?","replies":[]}]},{"poster":"FatedTitan","date":"2014-09-08T00:50:01.952+0000","up_votes":2,"down_votes":2,"body":"It's because they completely rushed Azir out to coincide with the Shurima event.  He had no teaser.  He had nothing.  All because they wanted him to go with the Shurima update.","replies":[]},{"poster":"FaerKhan","date":"2014-09-07T23:06:35.379+0000","up_votes":4,"down_votes":8,"body":"Don't worry guys, Riot doesn't actually care about lore, and Azir is going to be the only champ with actual canon lore now apparently. Too bad it's all shallow and sounds like it was written by a 5 year old. (incidentally one of their writers  whines like a 5 year old too).","replies":[]}]}