{"poster":"Spartan Cupcake","date":"2015-01-16T01:38:15.559+0000","title":"Receives a leaver buster on first time leave also not my fault league client bug splat","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":1,"body":"OK so I received my first leaving warning and if i leave next game i will be banned also bug splat did it not me so really riot?","replies":[{"poster":"Riot Tantram","date":"2015-01-16T01:49:39.372+0000","up_votes":6,"down_votes":1,"body":"Spartan Cupcake,\n\nThe warning is just that, a warning. You will receive it the first time you are considered a leaver, or an afk. The only reason you get a warning is to say, \"hey .. there's a system in place that will punish you if this becomes a pattern.\" The system has no way of telling whether you did it on purpose, or you suffered some sort of bug. \n\nFear not though! The system does not punish people for an occasional disconnect, it punishes people who exhibit a pattern of leaving and afking. In fact, leaverbuster will never ban anyone. Instead, it will increasing apply a higher level of 'low priority queue' punishment that the player must wait through.\n\nIf you are experiencing a high number of bug splats or disconnects, I would encourage you to resolve the issue before attempting to play more games.","replies":[{"poster":"TheHiddenEye","date":"2016-01-13T10:47:28.890+0000","up_votes":1,"down_votes":0,"body":"yo i was in a game today as jungle and i know for certain that i have not left  a game in more than a few weeks i believe and i got bug splat at 10 min into a team-builder i was playing with some friends i got DC and bug splat and when i reconnect i got kicked for afk so they said we should just surrender because out bot lane fed the surrendered wile i was still connecting again and i got low queue can you change that so if you dc and reconnect you wont get kicked again also i would like if the low queue could be lifted i really am not a leaver","replies":[]},{"poster":"Riftasaurus Rex","date":"2015-02-11T09:33:31.202+0000","up_votes":1,"down_votes":0,"body":"This just is pathetic, i'm going through reading all of the comments posted about leaverbuster and the community is saying the same thing over and over. We are being unjustly punished. Riot's glorified board readers only response is to explain it won't be a problem unless you deserve it, like they have some infallible system of judgment.\n Also why would you punish THE PLAYERS for problems that arise from not fixing YOUR FUCKING GAME. The only reason anybody plays this when you treat the community like this is because video game addiction is extrem. Profiting off of the weakness of society and not caring about them, sounds like the tobacco companies brother.","replies":[]}]},{"poster":"AppleWedgie","date":"2015-01-16T01:59:59.408+0000","up_votes":3,"down_votes":0,"body":"It doesn't punish people for an occasional disconnect, but it does give them a condescending slap on the wrist.","replies":[{"poster":"AgaGaiinz","date":"2015-01-16T02:03:07.284+0000","up_votes":1,"down_votes":1,"body":"its not a slap on the wrist cause eventually you wil get perm banned for it","replies":[]}]},{"poster":"AgaGaiinz","date":"2015-01-16T01:45:35.874+0000","up_votes":2,"down_votes":1,"body":"bro same shit has fucked me over too","replies":[]},{"poster":"Get Rekkkt","date":"2015-01-16T01:54:31.062+0000","up_votes":1,"down_votes":1,"body":"or dont get me wrong\n\nfix your bugsplats and i bet 25-50% of the leave rate drops across NA\n\ninstead of coming up with excuses/blaming others (btw alot going thru this type of situation)","replies":[]}]}