{"poster":"Old Ace","date":"2018-01-16T19:24:45.237+0000","title":"se busca gente con orientación sexual gay para equipo","subforum":"Charlas Generales","up_votes":7,"down_votes":10,"body":"Bueno tal como dice el titulo, es mas que nada para fortalecer el compa&ntilde;erismo en equipo, ademas de tener nuevos duos al jugar ranks\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"DanteV","date":"2018-01-16T19:49:42.904+0000","up_votes":1,"down_votes":6,"body":"no apoyo la homosecualidad pero los comentarios de aca son muy odiosos y pendejos.","replies":[{"poster":"Phaedra","date":"2018-01-16T20:08:21.689+0000","up_votes":5,"down_votes":0,"body":"No apoyo la homosexualidad ¿¿wtf?? quedate tranquilo hermano que ellos te apoyan a ti ;)","replies":[{"poster":"DanteV","date":"2018-01-17T02:32:56.740+0000","up_votes":1,"down_votes":1,"body":"que problema hay con mi opinion??","replies":[{"poster":"Phaedra","date":"2018-01-17T10:58:25.452+0000","up_votes":2,"down_votes":0,"body":"No iba a responder, pero creo que vale la pena. Una persona que no apoye la homosexualidad es una persona retrograda, una persona que no respeta libertades individuales, una persona que cree que sus valores son mejores que los del resto. Nadie te dice que seas homosexual, simplemente que entiendas que una persona con una orientación sexual distinta a la tuya es una persona IGUAL a vos. Por ende, no necesitas decir que no apoyas a alguien por ser homosexual. Lo mas probables es que, al igual que yo, seas heterosexual porque se te impuso socialmente de chico que \"ser p#to esta mal\". Quien sabe que hubiese pasado sin ese adoctrinamiento, quizás ahora estarías apoyando a mas de uno :D","replies":[{"poster":"DanteV","date":"2018-01-17T19:26:29.451+0000","up_votes":1,"down_votes":1,"body":"si, lo escribi mal y se interpreta, respeto a cualquier perdona en su dignidad, pero no apoyo ideologias progresistas del LGTB, Lobby gay, IDG, Feminismo,  que no es igualdad de genero como piensan los desconocidos en el tema al igual que otras ideologias zurdas.","replies":[{"poster":"Phaedra","date":"2018-01-17T21:10:06.087+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Dante V,realm=LAS,application-id=v7qsfXsE,discussion-id=JmtnOpZG,comment-id=00030001000000000000,timestamp=2018-01-17T19:26:29.451+0000)\n>\n> si, lo escribi mal y se interpreta, respeto a cualquier perdona en su dignidad, pero no apoyo ideologias progresistas del LGTB, Lobby gay, IDG, Feminismo,  que no es igualdad de genero como piensan los desconocidos en el tema al igual que otras ideologias zurdas.\n\n\"Ideologias zurdas\" , \"ideologias progresistas\"...say no more","replies":[{"poster":"DanteV","date":"2018-01-17T21:29:10.306+0000","up_votes":1,"down_votes":1,"body":"bueno, si no sabes de los denominados bloques politicos de izquierda, centro y derecha, sus principios y valores en la política actual global nada que hacer.\nhttps://www.youtube.com/watch?v=bUnzdQAGl5k","replies":[{"poster":"Phaedra","date":"2018-01-17T21:34:35.644+0000","up_votes":2,"down_votes":0,"body":"Ahora son bloques políticos? no eran ideologías hace un rato?\n\nNo es  cuestión de ideología progresista o zurda, es cuestión de abrir la cabeza amiguito. Hay neoliberales que son put0s. Que tiene que ver la sexualidad con la ideología política? \n\nTenes la cabeza mas cuadrada que Cacho Castaña","replies":[{"poster":"DanteV","date":"2018-01-18T02:46:13.062+0000","up_votes":1,"down_votes":1,"body":"cuando crescas, conoscas la politica y que implica vas a entender lo que digo","replies":[{"poster":"Phaedra","date":"2018-01-18T03:54:44.680+0000","up_votes":2,"down_votes":0,"body":"Cuando creZca y conoZca? tengo mas años y militancia de lo que imaginás. Igual te aclaro que la edad no es factor determinante, la experiencia de los años aportan una parte, pero sin lectura y sin embarrarte en las temáticas no vas a entender el resto. \n\nAl margen de eso, seguís sin contestarme como influye la ideología política en las sexualidad, seguramente será porque te quedaste sin argumentos. \n\nAbrazo, la dejo acá.","replies":[{"poster":"DanteV","date":"2018-01-18T06:21:17.867+0000","up_votes":1,"down_votes":1,"body":"se puede creecer mentalmente, en ningun momento mencione edad.\nTal ves no estas en enterado, pero los temas valoricos son los principales dentro de la politica, en los temas valoricos entran la sexualidad, o pensas que las protestas contra trump, bloque politico: derecha, del lobby gay, lgtb, feminazis, entre tanto movimientos que tienen, son porque si solamente? protestan porque trump no piensa legislar para ellos, respondiendo a sus demandas que no tienen sentido. \nhttps://www.youtube.com/watch?v=wZQnA6WnneU\nhttps://www.youtube.com/watch?v=pHr4XL4Th_g \nhttps://www.youtube.com/watch?v=cHhf0KhqEU8 \ny pasa en todas partes, si quieres ejemplos busca las noticias y listo, esta lleno","replies":[{"poster":"Phaedra","date":"2018-01-18T15:18:18.744+0000","up_votes":2,"down_votes":0,"body":"Y vos decís que todos los que protestan son zurdos o progres? Eso es lo que venías diciendo al menos. Te repito, nunca viste un tipo de clase alta, de derecha, neoliberal y protestando o marchando por los derechos de la comunidad lgtb? \n\nSi vos hablas de una corriente ideólogica lgtb está bien. Lo que no entendés es que por militar una causa no sos automáticamente  progre o zurdo. Sí, lamentablemente los progres y zurdos defienden mas causas humanitarias que las demás ideologías, pero no por ello tenés que meter a todas las personas que expresen su sexualidad en una bolsa de \"zurdos progres\". \n\nDejá de mirar videos en internet que son mas tendenciosos que el diario mas amarillista del mundo. \n\nY con respecto a que no mencionaste la edad, tu comentario \"cuando crescas, conoscas la politica y que implica vas a entender lo que digo\" creo que se refiere a eso. Que me estabas corriendo por el lado de la edad , o no? Que necesito crecer y conocer. Salvo que justo en este caso e refirieses a crecer intelectualmente. \n\nLa historia dice que los derechos se obtienen luchando, o te pensás que las mujeres pudieron votar porque se sentaron pacíficamente a esperar? No, prendieron fuego todo y gracias a esa lucha hoy son lo que son. \n\nSi en el siglo 21 hay gente que habla de \"homosexuales\" es porque todavía les faltan ganar muchos derechos, como el de no tener que tolerar que algún pibito les diga \"yo no los apoyo\".\n\nTe dejo seguir viendo videos, yo sigo laburando. Te dediqué tiempo de mi \"descanso\", valorá eso. Abzo","replies":[{"poster":"DanteV","date":"2018-01-18T17:23:38.503+0000","up_votes":1,"down_votes":1,"body":"mejor sigue llorando, sin querer ver la realidad como es.","replies":[{"poster":"Phaedra","date":"2018-01-18T17:59:13.784+0000","up_votes":2,"down_votes":0,"body":"Tu respuesta de nenito no hace mas que delatarte. Exitos...","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Little T","date":"2018-01-16T19:52:19.336+0000","up_votes":1,"down_votes":0,"body":"menciona alguno que no diga la verdad\n\n{{sticker:sg-lulu}}","replies":[{"poster":"DanteV","date":"2018-01-17T02:34:07.601+0000","up_votes":1,"down_votes":0,"body":"el juego es para interacturar y compartir, el tipo quera jugar con personas de su mismas ideas o fetiches nose, no veo el problema","replies":[]}]}]},{"poster":"Little T","date":"2018-01-16T19:27:43.407+0000","up_votes":3,"down_votes":0,"body":"pero... khe berga?\ny que tiene que ver la orientación sexual???","replies":[{"poster":"Jınx","date":"2018-01-16T19:29:55.286+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Little T","date":"2018-01-16T19:31:25.524+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lux-2}} \n\nsolamente me llamo la atención el titulo, me pareció completamente \"ridículo\" que busquen gente con X orientación sexual para un equipo... osea... por favor","replies":[{"poster":"Old Ace","date":"2018-01-16T19:35:15.499+0000","up_votes":1,"down_votes":1,"body":"pues ignóralo sino -.-","replies":[{"poster":"Little T","date":"2018-01-16T19:39:31.354+0000","up_votes":2,"down_votes":0,"body":"con esa lógica tendría que ignorar a todos los posts del foro, los que me gustan y los que no... al igual que tenes la libertad de publicar tremenda bobada, yo tengo el mismo derecho a comentar mi opinión...\npuedo hacerte una pregunta? sos homosexual?","replies":[{"poster":"Old Ace","date":"2018-01-17T13:04:31.656+0000","up_votes":1,"down_votes":0,"body":"bi, pero no creo a estas alturas que valla al caso","replies":[{"poster":"Little T","date":"2018-01-17T16:34:07.874+0000","up_votes":1,"down_votes":0,"body":"en realidad si importa, no entiendo por que queres separar a las personas homosexuales de las heterosexuales... y no todos los heterosexuales somos una manga de pusilánimes que insultan a un homosexual cuando tienen la oportunidad...\nyo la verdad soy bastante imparcial en este asunto","replies":[{"poster":"Old Ace","date":"2018-01-18T15:05:38.214+0000","up_votes":1,"down_votes":0,"body":"vos, el resto es otra historia","replies":[]}]}]}]}]}]}]}]},{"poster":"azulwashere","date":"2018-01-16T19:59:39.809+0000","up_votes":2,"down_votes":2,"body":"A mi me parece perfecto. Tiene todo el derecho de poner las condiciones que quiera. Nadie le dice a un diamante que tiene que ver el elo cuando buscan composición para un team (por obvias razones). Si desea que todos sean de una misma orientación sexual, lo puede hacer.\n\nMucha suerte en tu busqueda y que formen un lindo equipo!!","replies":[{"poster":"Little T","date":"2018-01-16T20:03:52.400+0000","up_votes":2,"down_votes":0,"body":"hay una diferencia muy notoria entre \"habilidad de jugador\" y \"orientación sexual\"\ncuando uno hace un equipo buscan mejorar, lograr subir de liga, que todos aporten algo y no ser solamente \"unos carreados\"\nen cambio la sexualidad no tiene nada que ver a la hora de crear un equipo... a no ser que quieras hacer un grupo de X personas para realizar X actividad... y no quiero parecer sucio de mente, pero bueno...","replies":[{"poster":"Old Ace","date":"2018-01-17T13:06:56.561+0000","up_votes":2,"down_votes":0,"body":"el problema esta en que es muy molesto que te critiquen todo el día sin contar el bulling pero bueno no creo que conozcas del tema, como para andar comentando asi","replies":[{"poster":"Little T","date":"2018-01-17T16:31:11.443+0000","up_votes":1,"down_votes":0,"body":"amigo... hoy en día hay bullyng por cualquier cosa, y déjame decirte que hay muy poca gente que hoy en día considera la homosexualidad como \"una enfermedad\"","replies":[]}]},{"poster":"DanteV","date":"2018-01-17T21:30:43.715+0000","up_votes":2,"down_votes":1,"body":"busca personas para divertirse, tal ves jugas solo y no entendes el punto.","replies":[]},{"poster":"azulwashere","date":"2018-01-16T21:03:17.085+0000","up_votes":1,"down_votes":0,"body":"Pero la habilidad no lo es todo. Si es, gran parte de lo que piden. Pero en este caso priorizan el tener algo en común y apoyarse como equipo en una comunidad que claramente les hace burla. \nPriorizan lo que desean priorizar, y si pone las reglas así está bien porque es él o ella el/la que está armando el equipo. \nY si te gusta fantasear con que se juntan para hacer \"x\" actividad... bienvenido seas! Sobre gustos no hay nada escrito y una vieja se comia los mocos :)","replies":[]}]}]},{"poster":"Gabrielitorz","date":"2018-01-16T22:13:04.592+0000","up_votes":2,"down_votes":0,"body":"tengo un amigo main yasuo, no se si es lo que estas buscando","replies":[]},{"poster":"LeonardoSB","date":"2018-01-16T19:56:14.291+0000","up_votes":2,"down_votes":0,"body":"https://i.ytimg.com/vi/L8XPDwzn9gw/hqdefault.jpg","replies":[]},{"poster":"21 Fiora","date":"2018-01-16T19:37:38.045+0000","up_votes":2,"down_votes":0,"body":"Que tiene que ver la orientación sexual en el LoL?","replies":[]},{"poster":"Russells Viper","date":"2018-01-16T19:49:55.898+0000","up_votes":2,"down_votes":1,"body":"yo soi gai","replies":[{"poster":"Avion Maldito","date":"2018-01-17T13:26:33.092+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Russells Viper,realm=LAS,application-id=v7qsfXsE,discussion-id=JmtnOpZG,comment-id=0004,timestamp=2018-01-16T19:49:55.898+0000)\n>\n> yo soi gai\n\nno te molesta si te agrego?","replies":[]}]},{"poster":"Urxnium","date":"2018-01-16T19:44:42.915+0000","up_votes":2,"down_votes":1,"body":"Y qué tiene que ver la orientación sexual en esto? Osea, si eres homosexual bien, pero no te van a pegar por hacer duo con otra persona que no lo sea(:","replies":[{"poster":"Avion Maldito","date":"2018-01-17T13:20:50.242+0000","up_votes":1,"down_votes":0,"body":"De echo conozco a mucha gente que si pagan por algo así, si lo se es raro, pero me da igual allá su vida irónicamente andan en diamante y master","replies":[]}]}]}