{"poster":"Crede777","date":"2017-11-07T20:22:38.074+0000","title":"What Will Be the Optimal Keystone for a DOT Mage?","subforum":"Gameplay","up_votes":3,"down_votes":0,"body":"For mages who traditionally took DFT, what will now be the optimal keystone?  I&#039;m talking about Malzahar, Rumble, Swain, Teemo (AP not on hit), Brand, and Cass.\n\nWhile Swain, Brand, and Cass might be able to land a comet pre-6 (albeit on unreliable stuns/snares/grounding), champs without significant CC early such as Malz, Rumble, and Teemo seem to be kind of lacking.\n\nSpecifically, I'm looking for runes/keystone which would benefit from their DoT abilities and/or amplify their damage in a reliable and optimal way.","replies":[{"poster":"Quepha","date":"2017-11-07T21:43:29.614+0000","up_votes":2,"down_votes":0,"body":"Cassiopeia should probably go phase rush, just like how right now she should probably go stormraider’s","replies":[{"poster":"Khristophoros","date":"2017-11-07T21:50:51.737+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Quepha,realm=NA,application-id=3ErqAdtq,discussion-id=87jajahy,comment-id=0004,timestamp=2017-11-07T21:43:29.614+0000)\n>\n> Cassiopeia should probably go phase rush, just like how right now she should probably go stormraider’s\n\nYou can get 10% speed from Approach Velocity triggered by W or R, then another 4% from the Celerity rune.\n\nI don't know if that's enough but it's something to consider.","replies":[]}]},{"poster":"JustMonika13","date":"2017-11-07T21:55:27.874+0000","up_votes":2,"down_votes":1,"body":"Teemo would enjoy Press the Attack on the Precision tree.","replies":[]},{"poster":"Vekkna","date":"2017-11-07T21:05:08.870+0000","up_votes":1,"down_votes":0,"body":"The final version of Comet looks like Cassio might be the best user in the game. She can easily proc it twice in an all-in. Even if she's just poking with QEE, she gets 50% cooldown.","replies":[{"poster":"Khristophoros","date":"2017-11-07T21:19:24.745+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Vekkna,realm=NA,application-id=3ErqAdtq,discussion-id=87jajahy,comment-id=0003,timestamp=2017-11-07T21:05:08.870+0000)\n>\n> The final version of Comet looks like Cassio might be the best user in the game. She can easily proc it twice in an all-in. Even if she&#x27;s just poking with QEE, she gets 50% cooldown.\n\nAzir with max attack speed can trigger it more rapidly since his soldiers trigger spell-hits.","replies":[]}]},{"poster":"Naqel","date":"2017-11-07T21:03:19.574+0000","up_votes":1,"down_votes":0,"body":"Get Kleptomancy and enjoy hitting your two-item-spike by the time everyone else is still sitting on their components.","replies":[]},{"poster":"Tenth Leper","date":"2017-11-07T20:58:01.287+0000","up_votes":1,"down_votes":0,"body":"Airie hits twice on long dots, so there is that. Teemo(ap) brand, and rumble I would recommend it.\n\nYou could always go glacial on anyone you are going to build the hextech ... ice thingy. Gives you more time to kite them around and amplifies your liandry.\n\nSwain is being relaunched quite soon, so it doesn't matter if nothing fits him anyway.\n\nCass should probably be either electrocute or phase rush. She can proc either really easily.","replies":[]},{"poster":"Titanium70","date":"2017-11-07T20:47:04.527+0000","up_votes":1,"down_votes":0,"body":"Eletrocute, Glacial and Phase Rush as well as Comet are the ones that will work for you. \n\nPhase Rush should be pretty broken on something like Cass and Swain, especially when combined with Presence of Mind. (That's not a snowball.. that's an avalanche hitting the opponent Team!)\n\nGlacial Augment should be a viable choice for Brand and everyone who wants to land combos.\n\nElectrocute is an alrounder. If you feel unable to use something else - use this. Will work. \n\nThe Comet is more specialized because of its delay and CD mechanic, but it seems fine as well.","replies":[]}]}