{"poster":"Fávorité","date":"2016-11-12T22:21:10.776+0000","title":"Camouflage Change - - -  Eve Nerf?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey, \r\nhabe die n&auml;chsten 2-3 Wochen keine Zeit mir den neuen Patch runterzuladen und zu spielen meine Frage daher\r\nhat jemand schon Erfahrungen gemacht inwiefern der Camouflage change Evelynn beeintr&auml;chtigt?\r\n\r\nOder verh&auml;lt sich der Stealth von evelynn von der Range her genau so wie vorher? \r\n\r\nWie genau funktionieren diese neuen Wards? In etwa wie pink wards oder ist die Range drastisch erh&ouml;ht?\r\n\r\nGru&szlig;","replies":[{"poster":"Birgot","date":"2016-11-17T14:08:44.252+0000","up_votes":1,"down_votes":0,"body":"als twitch main komme ich aus dem kopfschütteln nicht mehr raus.","replies":[]},{"poster":"Crounty","date":"2016-11-12T22:32:34.998+0000","up_votes":1,"down_votes":0,"body":"> Oder verhält sich der Stealth von evelynn von der Range her genau so wie vorher?\n\nSoweit ich weiß hat sich nichts an der Range geändert.\n\n>Wie genau funktionieren diese neuen Wards? In etwa wie pink wards oder ist die Range drastisch erhöht?\n\nDie funktionieren wie Pink wards","replies":[{"poster":"0815xand0r","date":"2016-11-12T23:01:28.438+0000","up_votes":1,"down_votes":0,"body":"Im Grunde sind es sogar bessere Pinkwards, da sie andere Wards nicht nur aufdecken, sondern auch deaktivieren (wie Sweeper/Oracle)","replies":[{"poster":"Crounty","date":"2016-11-12T23:07:01.016+0000","up_votes":1,"down_votes":0,"body":"Aber sie decken Champions, die kurz unsichtbar sind nicht auf, sondern nur die Champs, die lange unsichtbar sind.\n\nD.h Champs wie {{champion:35}} {{champion:84}} {{champion:121}} {{champion:91}} {{champion:17}} {{champion:62}}  werden nicht durch das Control Ward aufgedeckt\n\nAber {{champion:107}} {{champion:29}} {{champion:28}} werden aufgedeckt, da sie länger unsichtbar sind","replies":[{"poster":"Thingolian","date":"2016-11-13T18:09:05.088+0000","up_votes":1,"down_votes":0,"body":"Ist aber eigentlich recht fair.\nRengar, Twitch UND VOR ALLEM Evelynn können sich in der Midlane unsichtbar machen und gemütlich zur nächsten Lane rennen, da kann man das eigentlich verstehen","replies":[{"poster":"Crounty","date":"2016-11-13T18:52:42.618+0000","up_votes":1,"down_votes":0,"body":"man kann aber ganz gut around spielen da die meisten spieler nur die büsche warden dann kannst du über die lane ganken","replies":[{"poster":"xXSchätzchenXx","date":"2016-11-14T00:24:16.703+0000","up_votes":1,"down_votes":0,"body":"Naja da kann man echt drüber streiten, Rengar hat jetzt eine echt gutenWarnung bekommen, im Gegensatz zur Saison ist diese gut zu sehen und triggert auch rechtzeitig und mit Sound. Nicht wie in der Saison wo es möglich war das die Warnung erst beim Sprung angezeigt wurde.\nAber vor allem gegen Wu, Alkalie waren pink wards kit die stärksten item, zum countern. Low HP wu will fliehen oder alkalie in die Wolke, Pink ward drauf und ach da ist er ja. Low shaco das selbe. Für diese chars fällt somit eine echte countermöglichkeit weg. Das größte Geschenk war für sie doch sowieso das wegfallen der pink wards als schmuck.","replies":[]}]}]}]}]}]},{"poster":"TerrorRaven","date":"2016-11-13T04:42:25.994+0000","up_votes":1,"down_votes":0,"body":"Für Evelynn hat sich nichts geändert.","replies":[]},{"poster":"SuperplexP","date":"2016-11-12T22:55:24.008+0000","up_votes":1,"down_votes":0,"body":"Eve ist von den Stealth Changes praktisch unberührt geblieben, da die neue Camouflage im Endeffekt die Evelynn Passive auf alle anderen Camouflageverwender anwendet. Sie selbst bleibt damit unberührt.","replies":[]}]}