{"poster":"Raymond Ray","date":"2015-02-05T00:55:13.373+0000","title":"Buster","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello, i am from south korea. And i am live in michigan right now. and i am play lol, it is really fun game thx.\r\nI have some questions. i got a buster. i was playing and my computer was just shut down.... and i got a buster.\r\nI didn't want to leave that game... but i got a buster.\r\nand i wasted my 50 minutes.. i was really upset... can i get some adventage??or something?? should fix this things..","replies":[{"poster":"dArtagnan","date":"2015-02-05T05:08:49.870+0000","up_votes":2,"down_votes":1,"body":"Hey Raymond Ray!\n\nThe first time that you leave a game, you do get a notification asking you to agree not to leave games in the future.  This is only a warning and no penalties are given to your account.  The only way that you can earn a lower priority queue or other penalties is by consistently leaving games in the future.  \n\nAs long as it only occurs rarely due to random technical issues, you don't have to worry about any penalties!","replies":[{"poster":"MechaWarr","date":"2015-02-11T08:58:06.314+0000","up_votes":1,"down_votes":0,"body":"Just had this happen about 15 minutes ago in the middle of an ARAM, PC just up and rebooted on me with no warning and I nearly threw a fist through my monitor when I got the message, thinking I had been penalized. Thanks for the info, dArtagnan!","replies":[]},{"poster":"Riftasaurus Rex","date":"2015-02-11T08:18:37.919+0000","up_votes":1,"down_votes":0,"body":"So everybody that disagrees with you and imply they don't consistently leave but yet have a penalty are liars or are not competent enough to realize they are leaving consistently in riots \"professional\" opinion? The only comments from riot on the leaverbuster system, that is one of the most widely commented on discussions by the \"customers\", all explain that you don't get penalized until you leave consistently and never attempt to look at the problem in any other aspect. I find this to be very alienating and have given up playing league altogether when I was a daily player. The customer is always right in most successful businesses, but when you have addicted client base I guess you don't need to worry much about PR much like tobacco companies but i'm nobodies {{champion:29}} so peace out until I see this issue addressed.","replies":[]}]}]}