{"poster":"HumanPerfect","date":"2017-10-16T08:06:47.155+0000","title":"I think I just discovered the hardest counter to Evelynn in the game","subforum":"Gameplay","up_votes":129,"down_votes":6,"body":"Play Morgana. You have atleast a 2.5 second heads up on who to throw your spellshield on to negate her charm and the brunt of her burst damage. If that still does not make her go screw off then CC her as she walks up, as she is a melee assassin with no gapcloser without using her ult, which she needs to assassinate. \r\n\r\nCongrats, you won. Your lane did not get ganked by Eve and she is now useless in teamfights.","replies":[{"poster":"Ben Sharpio","date":"2017-10-16T11:33:38.158+0000","up_votes":125,"down_votes":4,"body":"but then you have to play morgana","replies":[{"poster":"LegacyDAP","date":"2017-10-17T00:09:14.428+0000","up_votes":3,"down_votes":1,"body":"Implying Morgana is bad or just boring?","replies":[{"poster":"Big Black Croc","date":"2017-10-17T00:59:00.770+0000","up_votes":13,"down_votes":0,"body":"boring ass champion, shes just a Q bot and when she misses Q shes usless af.","replies":[{"poster":"5000000000000000","date":"2017-10-17T03:38:18.281+0000","up_votes":3,"down_votes":0,"body":"The point of this post is that her E is good, but she's still a Q bot lul","replies":[]}]}]}]},{"poster":"LitAF","date":"2017-10-16T08:10:42.045+0000","up_votes":18,"down_votes":0,"body":"Hehe upcoming Morg rework","replies":[{"poster":"Chembaron Yamada","date":"2017-10-16T11:42:03.445+0000","up_votes":37,"down_votes":0,"body":"That will probably still take some time and the shield is too iconic to not get carried over.","replies":[{"poster":"DarkSoul1994","date":"2017-10-16T11:44:39.321+0000","up_votes":19,"down_votes":0,"body":"I'm basically just expecting a VU and a soft-rework on W and R for Morgana.","replies":[{"poster":"Chembaron Yamada","date":"2017-10-16T11:56:45.159+0000","up_votes":33,"down_votes":0,"body":"The passive will most likely get changed as well if you ask me.\nSimply getting spell vamp as a free stat is not really exciting.","replies":[{"poster":"Myozthirirn","date":"2017-10-16T12:40:15.147+0000","up_votes":8,"down_votes":1,"body":"they will just add some healing to Q W or \"new W\" and completly reowrk the passive.","replies":[{"poster":"JRobin31","date":"2017-10-16T18:54:39.610+0000","up_votes":1,"down_votes":5,"body":"Morgana rework: that moment when you see other people trying to make a joke...\nbut the \"joke\" isn't funny...\n\nLike \"Hey guys, I ran into a deer the day with my car, so I got out and saw that it was dead, haha, right?\"\n{{sticker:sg-ahri-1}}","replies":[{"poster":"Glory ln Death","date":"2017-10-16T19:27:11.803+0000","up_votes":11,"down_votes":0,"body":"What are you even talking about?","replies":[{"poster":"JRobin31","date":"2017-10-18T07:23:40.926+0000","up_votes":1,"down_votes":0,"body":"About how _**not funny**_ a Morgana rework would be...\n...\n...\n...","replies":[{"poster":"Glory ln Death","date":"2017-10-18T12:44:46.590+0000","up_votes":1,"down_votes":0,"body":"Reworks aren't supposed to be funny...?","replies":[{"poster":"JRobin31","date":"2017-10-19T08:56:58.017+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LitAF,realm=NA,application-id=3ErqAdtq,discussion-id=E0x07AuT,comment-id=0000,timestamp=2017-10-16T08:10:42.045+0000)\n>\n> Hehe upcoming Morg rework\n\nI'm not the one laughing.","replies":[{"poster":"Glory ln Death","date":"2017-10-19T12:44:48.802+0000","up_votes":1,"down_votes":0,"body":"No one _is_ laughing? People are just talking about potential reworks?","replies":[]}]}]}]}]}]}]},{"poster":"LordRedStone Nr1","date":"2017-10-17T15:00:10.987+0000","up_votes":1,"down_votes":0,"body":"Yeah.\nNasus though.","replies":[{"poster":"Chembaron Yamada","date":"2017-10-17T15:18:21.605+0000","up_votes":1,"down_votes":0,"body":"Another champion with equally boring passive doesn't justify Morgana to keep it, though.\n{{champion:36}} \nLook at his passive, it is literally \"I have more health regen than other guys\". Does it work for his kit? Sure, it does. Is it an interesting and interactive part of it? Hell, no.\n\nJust like I expect Morgana to get a more exciting passive, I expect the same to happen to Dr. Mundo.","replies":[{"poster":"LordRedStone Nr1","date":"2017-10-18T12:25:46.586+0000","up_votes":1,"down_votes":0,"body":"Thats actually what I meant, and I do hope for a rework of both Nasus and Mundo.","replies":[]}]}]}]}]},{"poster":"OverpoweredSoap","date":"2017-10-16T16:27:44.270+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=SatomiKun,realm=EUW,application-id=3ErqAdtq,discussion-id=E0x07AuT,comment-id=00000000,timestamp=2017-10-16T11:42:03.445+0000)\n>\n> That will probably still take some time and the shield is too iconic to not get carried over.\n\ntbh the only thing that's not iconic about Morgana is her passive and W. \n\nThe rest of her kit is generally fine (even if it is annoying to play against, especially as melee champions).","replies":[]}]},{"poster":"Kaìju","date":"2017-10-16T15:42:25.815+0000","up_votes":5,"down_votes":0,"body":"Pretty sure they already mentioned that Kayle will get a full VGU but Morg is getting the visuals and only a small gameplay change because her kit works. Her Q and E are iconic to her kit, her passive, W, and R are pretty whatever.","replies":[{"poster":"Xenomancers","date":"2017-10-16T15:56:11.645+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Kaìju,realm=NA,application-id=3ErqAdtq,discussion-id=E0x07AuT,comment-id=00000001,timestamp=2017-10-16T15:42:25.815+0000)\n>\n> Pretty sure they already mentioned that Kayle will get a full VGU but Morg is getting the visuals and only a small gameplay change because her kit works. Her Q and E are iconic to her kit, her passive, W, and R are pretty whatever.\n\nIf Morg got a new ult - a ranged ult she would be top teir mid without a doubt.","replies":[]}]}]},{"poster":"The Deckowner","date":"2017-10-16T13:36:34.016+0000","up_votes":5,"down_votes":9,"body":"Or just pick any ardent support.","replies":[{"poster":"Yara0","date":"2017-10-16T14:26:21.922+0000","up_votes":28,"down_votes":1,"body":"> [{quoted}](name=The Deckowner,realm=NA,application-id=3ErqAdtq,discussion-id=E0x07AuT,comment-id=0006,timestamp=2017-10-16T13:36:34.016+0000)\n>\n> Or just pick any ardent support.\n\nFun fact Morgana is an ardent support :3","replies":[{"poster":"Xenomancers","date":"2017-10-16T15:04:34.712+0000","up_votes":5,"down_votes":22,"body":"> [{quoted}](name=Yara0,realm=NA,application-id=3ErqAdtq,discussion-id=E0x07AuT,comment-id=00060000,timestamp=2017-10-16T14:26:21.922+0000)\n>\n> Fun fact Morgana is an ardent support :3\n\nfun fact - no shes not. Black shield CD is too high.","replies":[{"poster":"DuskDaUmbreon","date":"2017-10-16T15:34:48.017+0000","up_votes":16,"down_votes":1,"body":"Fun fact: She still can use it. And she can use Stoneborn Pact (combined with Q, R, and possible W>Rylai's) for easy proccing of it.","replies":[{"poster":"SociopathFriend","date":"2017-10-17T00:27:07.392+0000","up_votes":2,"down_votes":0,"body":"Always wondered if Stoneborn worked with Ardent.","replies":[]}]}]}]}]},{"poster":"Mimr","date":"2017-10-16T12:08:24.549+0000","up_votes":19,"down_votes":2,"body":"Simply running away when you see the heart appear above your head works just as well as well... anyone. Unless you're really overextended but at that point any assassin could safely kill you without having to wait 2.5 seconds beforehand. Eve has to meet too many conditions to kill someone (wait 2.5 seconds and then hit Q from outside her frankly huge camouflage reveal zone). If her empowered E gapcloser would cover a bigger distance I guess things would be easier but at the moment I'm really struggling to see how Eve is supposed to kill anyone in a crowded teamfight.","replies":[{"poster":"OyddAWqJ5r","date":"2017-10-16T12:24:41.940+0000","up_votes":10,"down_votes":0,"body":"Oh man I love it when they walk backwards, cuz I'm always behind them when I cast it ;)","replies":[{"poster":"ProfDrDeath","date":"2017-10-16T18:57:50.978+0000","up_votes":2,"down_votes":0,"body":"That means you're in my tower - and, since you're Eve, you will not survive 2.5 seconds of tower focus, even with the peashooters we have.\n\nThat reminds me, I sometimes wish that towers were more like Plants vs Zombies's Pea Shooter. Specifically, the Gatling Peas.","replies":[]}]}]},{"poster":"420 grams","date":"2017-10-16T15:43:53.453+0000","up_votes":12,"down_votes":0,"body":"Or rek sai so you know where she is even when invisible","replies":[{"poster":"DorkunedAuras","date":"2017-10-16T17:55:55.815+0000","up_votes":14,"down_votes":0,"body":"Rek'Sai's always been fantastic against Eve, as the sole champion who can track her without her knowing. Makes her the premier hunter of Eve, assuming you build enough damage to successfully fight her.","replies":[]}]},{"poster":"nm1010","date":"2017-10-16T15:07:11.357+0000","up_votes":10,"down_votes":0,"body":"Morgana hard counters like every assassin in the game, not just eve.","replies":[{"poster":"Jasiwel","date":"2017-10-16T19:20:37.391+0000","up_votes":3,"down_votes":1,"body":"She also counters Corki pretty well as a Support. Black Shield makes it tough to focus down squishies and can catch you out of position trying to kill a carry. If you get too close, Morg ults you, and if you try to keep distance then she zones/Qs you.","replies":[{"poster":"AleksaTeemo","date":"2017-10-16T19:34:22.718+0000","up_votes":2,"down_votes":1,"body":"And leblanc.","replies":[{"poster":"Jasiwel","date":"2017-10-16T23:28:12.692+0000","up_votes":2,"down_votes":0,"body":"Yeah, I can see that one, especially if LeBlanc can't port away from Morg's R. \n\nEdit: It seems someone is downvoting us....","replies":[]}]}]}]},{"poster":"DuskDaUmbreon","date":"2017-10-16T14:40:32.953+0000","up_votes":7,"down_votes":1,"body":"I love playing midlane Morgana into any assassin. She counters every single one. Even Zed, somehow. They just can't do anything against her. Stealth is useless because of her R, you have to have a dash greater than her R's maximum range (nobody does, although Talon can get to somewhere where he will break the range), you pick up RoA as a first item, making you highly durable, you can play passively as fuck and they can't do anything about it, you're the best anti-diver, between your Q, R, and E...\n\nYour only drawback is that your roaming potential is next to nothing. You'll harass them into oblivion between W and DFT, you'll sustain past their poke between your passive and RoA, they can't dive you for a kill, and their jungler pretty much can't do anything to you either...","replies":[{"poster":"Xenomancers","date":"2017-10-16T15:08:38.820+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DuskDaUmbreon,realm=NA,application-id=3ErqAdtq,discussion-id=E0x07AuT,comment-id=0008,timestamp=2017-10-16T14:40:32.953+0000)\n>\n> I love playing midlane Morgana into any assassin. She counters every single one. Even Zed, somehow. They just can&#x27;t do anything against her. Stealth is useless because of her R, you have to have a dash greater than her R&#x27;s maximum range (nobody does, although Talon can get to somewhere where he will break the range), you pick up RoA as a first item, making you highly durable, you can play passively as fuck and they can&#x27;t do anything about it, you&#x27;re the best anti-diver, between your Q, R, and E...\n> \n> Your only drawback is that your roaming potential is next to nothing. You&#x27;ll harass them into oblivion between W and DFT, you&#x27;ll sustain past their poke between your passive and RoA, they can&#x27;t dive you for a kill, and their jungler pretty much can&#x27;t do anything to you either...\n\nShes a pretty great pick into - yasuo (needs tornado knockup to kill you) - fizz (needs ult knockup to kill you) or leblanc (needs to stun you with tether to kill you. Meanwhile you can free farm and if you land Q you can all in them once you get an item and your ult. Her damage is not as good as other mids but once you get {{item:3285}} your harass is pretty good.","replies":[{"poster":"DuskDaUmbreon","date":"2017-10-16T15:32:27.840+0000","up_votes":7,"down_votes":0,"body":"Nah. Don't bother with Luden's. {{item:3151}} and {{item:3116}}, combined with {{item:3027}}, is your damage. Just press W and they lose so much health from that alone. Combine it with a Q (insane base damage), and they lose half their health without you ever being in danger.","replies":[{"poster":"Xenomancers","date":"2017-10-16T15:54:35.803+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=DuskDaUmbreon,realm=NA,application-id=3ErqAdtq,discussion-id=E0x07AuT,comment-id=000800000000,timestamp=2017-10-16T15:32:27.840+0000)\n>\n> Nah. Don&#x27;t bother with Luden&#x27;s. {{item:3151}} and {{item:3116}}, combined with {{item:3027}}, is your damage. Just press W and they lose so much health from that alone. Combine it with a Q (insane base damage), and they lose half their health without you ever being in danger.\n\nThat build has 0 CDR though. I like {{item:3802}}  into {{item:3285}} {{item:3165}} {{item:3157}} then If it goes late game I'll get the {{item:3151}} {{item:3116}}.","replies":[{"poster":"DuskDaUmbreon","date":"2017-10-16T17:04:52.992+0000","up_votes":4,"down_votes":0,"body":"That works. I prefer a tankier build of {{item:3027}} {{item:3158}} {{item:3151}} {{item:3116}} {{item:3065}} and some kind of armor item - usually {{item:3157}}, although I'll take whatever's appropriate to the situation ({{item:3110}} is a good option that gives you even more mana, defense, and puts you at 40% CDR), with 18-12-0 as DFT as my keystone, mana regen quints, and scaling AP, armor, and MR runes. It's a lower damage build, sure, but your CC and durability make up for it. RoA lets you walk around during your ultimate (as opposed to non-RoA builds, which typically require you to have Zhonya's in order to survive the full duration of your ult), and you just end up so damned hard to kill, between your E (Which has a surprisingly high shield value), your CC, and your passive.\n\nIn a more damage oriented build, I'd swap out the two tank items for some combination of {{item:3165}}, {{item:3146}}, {{item:3089}}, {{item:3157}}, and {{item:3135}}. Luden's isn't worthwhile on many people at all anymore (Gunblade is better in nearly every instance for everyone, and Morello and/or RoA give the same AP for cheaper, alongside better stats, and the bonus damage and movement speed can _easily_ be surpassed by a {{item:3100}} - and more frequently!).","replies":[]}]},{"poster":"Mazariamonti","date":"2017-10-16T16:23:21.780+0000","up_votes":4,"down_votes":0,"body":"ah but you have forgotten the key to all Morgana success\n\n{{item:3152}}","replies":[]}]}]},{"poster":"Serika Zero","date":"2017-10-16T15:18:45.357+0000","up_votes":7,"down_votes":0,"body":"your roaming is very strong on morgana, especially when you got ult up.\nher \"problem\" is low AP damage output in the late game.\n\nYou won't be able to kill tanks, and you won't be able to kill the enemy adc, and you won't be able to kill the enemy assassins.\nBut you are able to control the fight and peal and protect your adc.\n\nSo, if your adc is something like Lucian. Morgana isn't to good of a midlaner that game unless you win by 30mins.\nIf your adc is the likes of cait, kog, etc. Morgana mid is good.\n\nSince the anti-diver part means you can protect the adc quite well as a mid laner :)\n\nMorgana's other weakness is that her wave clear takes time, meaning its easy to siege her turrets.","replies":[{"poster":"DuskDaUmbreon","date":"2017-10-16T15:34:04.761+0000","up_votes":3,"down_votes":1,"body":"Your roaming ability isn't what sucks, exactly, but rather the act of roaming itself. You move so slowly compared to everyone else that roaming is nearly impossible.\n\nHer wave clear is also pretty fast, especially if you have {{item:3116}} and {{item:3151}}. Press W, and pretty much everything dies.","replies":[{"poster":"Serika Zero","date":"2017-10-16T15:37:10.499+0000","up_votes":2,"down_votes":1,"body":"i used to main her in s3 and s4\n\nI remember rank 3 W solo clears casters, but that takes 5 seconds.\nAnd sometimes is difficult to W both casters and melee minions (depending on how they end up lining themselves up).\nYou also have to wait for them to stop moving before your \"wave clear\" starts working.\n\nThis is why I'm calling it slow. And easy to siege.\nBecause she needs to wait till minions stop. And then W, and then wait a few seconds for W to kill them.\n\nIn the mean while, your turret takes 3-5 shots. Rise and repeat.\nWhich is what sieging is about :)","replies":[{"poster":"DuskDaUmbreon","date":"2017-10-16T17:10:35.604+0000","up_votes":3,"down_votes":1,"body":"Rank 5 W drops caster minions to where they die to a single auto from you in the time they walk through it. Rylai's means they die in it, and drops melee minions to dying to a couple of autos. Torment+Rylai's means pretty much everything but cannon minions and super minions die, the former of which will die instantly to a Q afterwards, the latter nobody can one-shot.\n\nSure, you have a hard time clearing _large_ waves (when they're large enough that you can't physically encompass all of them in your W), but you clear smaller ones very easily - faster than any champion that isn't a high-tier wave clear champion (such as Sivir or Ahri).\n\nShe has no reason to wait for the minions to stop moving past laning phase, since she maxes W first to farm easily.","replies":[{"poster":"Serika Zero","date":"2017-10-16T17:24:49.399+0000","up_votes":2,"down_votes":0,"body":"that's where we disagree.\n\nYou usually need 2 or more ticks of W to get a kill. And that's 2 or more seconds needed to kill caster minions.\nWhich is more than enough to get hits on the turret and also not enough for them to die while walking towards you.\n\nAlso, in terms of wave clear, Ahri is average or above average.\nMorgana is below average or bad because you need multiple ticks of W to kill minions. And for that, they need to stay in your pool for multiple seconds, and for that, you need them to stop moving, and for that they need to be in front of your turret (or other minions).\nAnd in case the enemy is sieging your turret, they will kill your minions asap, making their wave stop in front of the turret, and because your wave clear is so slow, they get free attacks on turrets. Making you bad at getting sieged.\n\nViktor or Anivia for example are very good.\nRyze is good.\nAnnie is bad, all assasins are quite bad, except Diana which is around morgana's level.\n\n\nOn the polar opposite, when you are sieging the enemy turrets, you are very good as if you land a single Q (even the lv1 one) will set-up a kill in that situation most likely.\nI did main morgana ;)\n\n1 single W tick will never kill minions (including casters). Unless you go in practice mode and give you a full build at the first minute.","replies":[]}]}]}]}]},{"poster":"Terozu","date":"2017-10-16T19:00:31.745+0000","up_votes":2,"down_votes":0,"body":"Kats shunpo is longer than her R.  Whether she has a target or not...","replies":[]}]},{"poster":"Tychusfindlay918","date":"2017-10-16T17:37:58.713+0000","up_votes":6,"down_votes":0,"body":"every bruiser in the game","replies":[]},{"poster":"The Ecdysiast","date":"2017-10-16T17:29:46.545+0000","up_votes":7,"down_votes":1,"body":"Obligatory reminder that a counter pick is not counter play.","replies":[]},{"poster":"WrÆth","date":"2017-10-16T20:45:07.986+0000","up_votes":4,"down_votes":0,"body":"\"I think I just discovered the hardest counter to Evelynn in the game\"\n\nA condom","replies":[]}]}