{"poster":"JinxLaLinda","date":"2015-08-28T04:00:16.896+0000","title":"Por que el fanatismo a Yasuo y Zed?....","subforum":"Charlas Generales","up_votes":6,"down_votes":5,"body":"Cual es el problema de los que juegan normal, TAMBIEN RANKED, con yasuo y zed, y son malisimos con esos champs?, porque veo como que tienen todos maestrias +5, y son conos, nada mas, los destrozas como si nada, y sin embargo los sigo viendo, a que viene tanto fanatismo de esos campeones?, admito que tienen algo que atrae, yo mismo lo senti en un momento, pero como dije una vez en otro post, nunca mejore con ellos, por mas que practique muchisimo con bots, entraba a normal y me desarmaban, un yasuo una vez me empezo a flamear porque lo estaba paliseando con orianna en mid, me reta a un vs, fui con malzahar, lo mataba de un solo combo, aparte que la pasiva el ente del vacio (la ara&ntilde;ita xd) le comia el escudo siempre, y siempre quedaba descubierto, era cuestion de silenciarlo con una Q, y despues lo mataba como queria E, ulti, ulti E, capaz le tiraba una W, sin embargo muy orgulloso decia: &quot;PERO CON UNA SOLA ULTI TE BAJABA LA MITAD DE VIDA ;) &quot;, y el sentido de eso?... que tiene que me bajes la mitad de vida si no me podes matar ni una sola vez? .__.\r\n\r\nPD: Ahora es el momento que todos saltan diciendo: &quot; YO SOY MAIN YASUO &quot;, &quot; SOY MAIN ZED &quot;, mato asi asi asi bla bla bla, y no lo voy a creer. porque en la historia, desde hace 1 a&ntilde;o y medio que juego, ni uno me toco que sea bueno, ni siquiera decente... Tal vez en oro o platino se encuentren los buenos, los demas son basura....","replies":[{"poster":"Szarps","date":"2015-08-28T04:11:58.404+0000","up_votes":2,"down_votes":0,"body":"Te explico, zed y yasuo comparten un par de cosas, pero te lo voy a acortar para hacerlo mas facil, ambos son personajes que hacen mucho snowball (efecto bola de nieve, se consiguen 2 kills y matan a todos), aparte mucha gente (en especial elos bajos) ven un personaje que se mueve mucho (yasuo, riven, zed, kat, etc) y ya asumen que no los pueden agarrar nunca porque ellos no saben como se mueven, como son sus mecanicas y limitar un rango de donde puede llegar a estar. Entonces si son buenos ganan casi por si solos, si son malos se creen que el champion es muy op y lo usan por eso unicamente y despues se frustran porque lo usan para no perder pero tienen mañas y counters muy marcados, y no, en oro no hay todavia buenos de estos y si los hay se esconden abajo de las rocas porque les sacas algo que pueda contra eso y no hacen nada.","replies":[{"poster":"Li Grim","date":"2015-08-28T15:10:07.607+0000","up_votes":1,"down_votes":0,"body":"En platino me tocó contra un Yasuo muy bueno, el usaba su tercera Q justo después de usar E, de manera que yo creyera que el disparo iba circular. y no, me comía todo el tornado, después le pude seguir el juego, pero en team fights se desenvolvía muy bien.","replies":[{"poster":"Szarps","date":"2015-09-01T01:19:58.499+0000","up_votes":1,"down_votes":0,"body":"ah si esos juegos mentales son una de las cosas que hay que hacer para pilotearla, tambien si lo que tiene yasuo es que si no se feedea en early mid en tf siempre tiene chances volver al juego (split pusheando tambien pero con las kills generalmente) El otro dia (en normal) habia un yasuo que no queria ir sup y quedo re atras pero fue robando farm de un lado del otro y yo fui con darius top y si me iba me pusheaba si me quedaba mataba a mi midder (que era un idiota ciertamente) y no me quedo otra, entre que no lo alcanzaba porque jugaba a lo cagon y que se feedeaba de mis mancos no pude hacer nada :/ mi equipo eran entre silver y unranked el otro oro a platino 4 u.u","replies":[]}]}]},{"poster":"o Trafalgar o","date":"2015-08-28T22:09:28.426+0000","up_votes":3,"down_votes":2,"body":"Esos 2 campeones , a diferencia de otros como Malzha , pueden hacer muchas plays , son campeones divertidos , con buena sinergia en sus habilidades , y en buenas manos son geniales. Los 2 son campeones muy dificiles , entonces la gente que se aburre de campeones faciles elije a {{champion:238}} {{champion:157}} . Campeones como  {{champion:238}} {{champion:157}} {{champion:92}}  {{champion:67}} , necesitas muchisimas partidas para ser bueno con esos campeones. No te guies por esa partida que ganaste con {{champion:90}} , ese champ es counter de muchos champ por la ulti , un Zed o Yasuo no tiene muchas posivilidades en contra suya , es un Counter de ellos , es mas que obvio que con una combo de malzha los matas a cualquiera de los 2 , solo con {{item:3140}} podes ganar. Pero la diferencia y lo bueno de usar a campeones como {{champion:157}}  es  que un main yasuo , puede ganar una tf solo , tiene mas mecanicas , mas posibilidades , un Malzha ... no le veo el mismo potencial que un MAIN YASUO.\nPD: Maineo mid , y yo tmb veo yasuo y zed malos continuamente , pero veo a faker y veo que hay gente que los mainea.","replies":[{"poster":"norybb","date":"2015-12-11T23:46:44.459+0000","up_votes":2,"down_votes":1,"body":"{{champion:67}}  dificil y que tiene mecanicas complejas?, jajaj hasta {{champion:81}}  es mas complejo de usar.\nvayne en si esta roto por su w y su ultimate que la hace bastante dura de pillar para la gente que no sabe poner pinks o pickar rengar o lee.","replies":[{"poster":"o Trafalgar o","date":"2015-12-12T01:30:30.550+0000","up_votes":1,"down_votes":0,"body":"Hay que diferenciar las cosas , Vayne feed , o en late es dificil de matar , y es obvio que vas a matar , pero Vayne necesita muchas mas manos que Ezreal para SACAR SU MAXIMO POTENCIAL. Obvio que en late click derecho y mata Vayne , pero hay gente que no necesitan llegar al late. Ezreal si , necesita meter las skillshots , pero no es tan dificil de sacar el 100% de su potencial como con Vayne. Por algo dicen que Draven y Vayne son los ADCs mas dificiles del juego  no te parece ?","replies":[]},{"poster":"Whitesse","date":"2015-12-12T01:25:56.382+0000","up_votes":1,"down_votes":1,"body":"Vayne aunque no paresca tiene mecanicas, y lo que mas importa son TUS mecanicas con el campeon, yo un dia me propuse aprenderla a usar y no llegue ni a maestra 2 de lo dificil que es acostumbrarse a quitear en tf, Una vayne buena se hace la partida sola y es dificl de matar con o sin pink.","replies":[]}]}]},{"poster":"MaxPrice","date":"2015-12-11T22:30:16.605+0000","up_votes":1,"down_votes":0,"body":"tienes toda la razon ESTOY HARTO DE VER ESOS CHAMPS QUE ENSIMA LA GENTE DICEN QUE SON DIFICILES Y POR ESO LO MAINEAN Y NI SIQUIERA SABEN USARLOS, yasuo es patetico, da igual si ganas la linea se hace statik y ya te remonto, al igual que zed, solo tiene UN COMBO y ademas ahora de los ridiculos buff que le dieron y aumentar el oro y nerfear tantisimo el zhonyas le vino de 10 ya lo hace imposbile ganarle linea a un zed.","replies":[{"poster":"Platinum491","date":"2015-12-11T23:56:28.331+0000","up_votes":1,"down_votes":0,"body":"Este es un tema de hace 4 meses, ademas no se como un Yasuo con solo statikk te remonta y Zed tiene muchos combos","replies":[]}]},{"poster":"Gz676","date":"2015-08-28T04:41:23.692+0000","up_votes":1,"down_votes":0,"body":"lo dice alguien que tiene de name jinx la linda? XDXD esta gente te toca en shankid xd","replies":[{"poster":"SJMDmoss","date":"2015-08-29T01:05:34.743+0000","up_votes":1,"down_votes":0,"body":"hijo de odin?","replies":[{"poster":"Gz676","date":"2015-08-30T02:37:14.279+0000","up_votes":1,"down_votes":0,"body":"este tipo sabe.","replies":[]}]}]},{"poster":"LastHope17","date":"2015-08-29T03:06:35.561+0000","up_votes":1,"down_votes":0,"body":"Igual tenias que haberle jugado con otro que no sea malzahar, es su counter, si le ganas con counter no tiene gracia :'v","replies":[{"poster":"JinxLaLinda","date":"2015-08-29T13:50:06.920+0000","up_votes":1,"down_votes":0,"body":"Emm... este caso fue con Akali, hace rato meses vengo jugando con Akali, supuestamente Darius es counter de Akali.... y?, ayer me cruce a un Tahm con un Darius (encima feed) en la jg mia que iban a gankear bot... yo iba a hacer lo mismo claro esta no?, y no me duro ni 2 min... y el Tahm pobre quiso irse con ulti y nada.... En otro post tambien lo dije. la historia del counter, es mentira. es para que se asusten algunos nenes. si ves que un campeon te mata facil 2 veces?, hora de jugar defensivo farmear y listo. Lo de counter es todo mentira. entonces Akali? es counter de zed, yasuo, jayce, annie, malzahar, orianna, diana, ziggs, veigar, ahri?, de todos esos?, porque a todos me los cruce, y todos me dijeron que soy el counter por eso... que raro no? no sabia que Akali era la diosa divina del counter....","replies":[{"poster":"LastHope17","date":"2015-08-29T15:01:52.374+0000","up_votes":1,"down_votes":0,"body":"Maineo Malzahar y siempre me dicen lo mismo por el ulti, ni se les ocurre comprar un fajin para salvarse xD y yo decia porque siempre le juego a yasuos con malzahar y no importa que tan buenos sean, es tirar e e e ulti las otras habilidades tambien, pero la e saca mucho mas","replies":[]}]}]},{"poster":"FrankRAM","date":"2015-08-28T20:46:07.294+0000","up_votes":1,"down_votes":0,"body":"Realmente crees que un yasuo no hace nada? o son todos malisimos? no has visto la lcs?... por otra parte, un zed bien jugado, deletea al adc y sale de la tf.","replies":[{"poster":"JinxLaLinda","date":"2015-08-29T00:32:11.652+0000","up_votes":1,"down_votes":0,"body":"Señor usted deberia aprender a leer, estoy contando mi experiencia \"QUE YO YO YO, YO YOYOYOYOYOYOYOYOYOYO\" no me cruce uno descente... justamente la ultima partida que jugue fue contra un zed, la primera vez al lvl 7 como lo mate?, bajo la torre de el del miedo que tenia, y me fui con 40 o algo asi de vida por lo que me pego la torre etc, si no hubiera tenido tanto miedo apenas entraba me tiraba ulti y me mataba.... pero no, se vuelven boludos con zed y yasuo y se les anula el pensamiento automaticamente...","replies":[]}]},{"poster":"SuperLoky","date":"2015-08-28T20:26:22.906+0000","up_votes":1,"down_votes":0,"body":"Yo personalmente lo que mas juego es yasuo, y le eh ganado a muchas muchas orianas, en cuanto a malza es rompe bolas por eso ni me gasto, pusheo linea y me voy a fedear a otro lado, total en farm siempre le vas sacando ventaja de 40 o 50 minions que es como si lo mataras 2 o 3 veces.","replies":[]},{"poster":"rokushoger","date":"2015-08-28T15:08:29.708+0000","up_votes":1,"down_votes":0,"body":"El fanatismo va porque aunque tu hayas jugado mucho y no hayas podido mejorar, otra gente jugando y PERSEVERANDO en el intento si mejora, pero para eso no hay otra que practicar hasta quemarte los dedos en normal, y mientras no mejoran obviamente son malos.\nLa verdad que tu actitud es un poco altanera, porque por el hecho que tu no hayas podido no significa que otro por ensayo y error no pueda hacerlo.\nEn cuanto a que tienen, supongo que el hecho de la movilidad, ultis vistosos, los combos y outplays que permiten, no se, son \"entretenidos\" de ver cuando se juegan bien.","replies":[{"poster":"JinxLaLinda","date":"2015-08-28T16:03:20.669+0000","up_votes":1,"down_votes":0,"body":"Mira, noto que te falta lectura, porque estoy hablando en base a experiencias que tuve jugando contra esos 2 champs, y no me toco 1, repito solamente 1 que lo use decentemente, no bien, no falta el zed boludo que te quiere pegar de lejos con poca vida con la W, y la apreta de nuevo aparece al lado tuyo sin darse cuenta y una piña y listo, tampoco falta el yasuo desesperado que tira las Q en el aire y ves como caza moscas nomas....","replies":[{"poster":"rokushoger","date":"2015-08-28T16:38:42.556+0000","up_votes":1,"down_votes":0,"body":"Será entonces que estás en una liga/mmr bajo y ves a todos los que todavía no han logrado dominarlo. Yo he visto de todo, desde los que tratan de tirar ulti con zed y se le tiran al tanque, hasta los que te hacen tremendas jugadas y nos los tocas ni en joda.","replies":[]}]}]},{"poster":"Marnie","date":"2015-08-28T15:51:06.090+0000","up_votes":1,"down_votes":0,"body":"Es lo mismo que yo me pregunto, agregaria por ahi alguna vayne o riven xD","replies":[]},{"poster":"ZanahoriaAsesina","date":"2015-08-28T14:47:30.706+0000","up_votes":1,"down_votes":0,"body":"A mi me gusta la risa de Zed esta hecha para spamearse xD","replies":[]},{"poster":"Platinum491","date":"2015-08-28T12:05:51.288+0000","up_votes":1,"down_votes":0,"body":"Por la E de yasuo y Las sombras de zed, son divertidisimos de jugar","replies":[]},{"poster":"Gz676","date":"2015-08-28T09:19:41.173+0000","up_votes":1,"down_votes":0,"body":"lo dice alguien que tiene de nombre jinx la linda ? AJAJAJ op xd","replies":[]},{"poster":"Rehrs","date":"2015-08-28T09:14:32.533+0000","up_votes":1,"down_votes":0,"body":"son entretenidos de jugar como {{champion:268}} {{champion:61}} {{champion:92}} {{champion:4}} {{champion:134}} {{champion:67}} ","replies":[]},{"poster":"Abrezzi","date":"2015-08-28T08:38:28.862+0000","up_votes":1,"down_votes":0,"body":"Uso a Zed y tengo pensado comprarme a Yasuo, el principal motivo es por que es posible deletear a cualquier campeón con un buen combo además tiene una complejidad que me atrae y saber manejarlo es muy difícil.","replies":[]},{"poster":"Kyousuke","date":"2015-08-28T05:34:55.623+0000","up_votes":1,"down_votes":0,"body":"yo uso a zed y la primera razón por que lo compre fue por que me gusto corta XD. por mas que seas bueno o malo si te gusta un champ lo compras y lo usas, por mas que te vaya mal vas a seguir jugando por que te gusta y queres aprender a usarlo y vas a practicarlo. faker no se formo como el mejor sin jugar, no dijo mira un ninja \"pentakill\" lo estudio, analizo y practico para dominarlo. vos dijiste orianna y malza. cuantas partidas jugaste antes de tomarle la mano y aprender a usarlo? lo jugas por que si o por que te gustan? en cuanto pienses eso y respondas vas a entender el por que la gente lo juega a pesar de que le vaya mal","replies":[]},{"poster":"AporroGrantz","date":"2015-08-28T05:03:29.695+0000","up_votes":1,"down_votes":0,"body":"xq son muy entretenidos ( movilidad, mecanicas) , aparte hay que admitir que son los 2 campeones que mas atraen del lol esteticamente xd","replies":[]},{"poster":"lnDiana Jones","date":"2015-08-28T04:40:32.159+0000","up_votes":1,"down_votes":0,"body":"en general siempre que juego normal uso a yasuo pero mas que todo por que es un champ entretenido para jugar, tiene movilidad, no usa mana, y realmente es divertido de usar.\nYa en ranked no uso casi a ninguno de los 2 por que soy malo con ellos y en general igual es facil ganarle la linea","replies":[]},{"poster":"Whitesse","date":"2015-08-28T04:29:51.397+0000","up_votes":1,"down_votes":0,"body":"Nose pero siempre que me toca un Yasuo o Zed en ranked terminan fedeando. 1 de 10 juega bien y carrea.","replies":[]},{"poster":"alop55555","date":"2015-08-28T04:27:33.222+0000","up_votes":1,"down_votes":0,"body":"yasuo y zed no tienen  mana por lo que pueden spamear habilidades sin problemas para crear presion en early \ny uno de los problemas de los magos ap es como manejar mana sin que se te gaste y quedar indefenso \ntambién son muy efectivos farmeando","replies":[]},{"poster":"Ing Mecanico","date":"2015-08-28T04:10:18.114+0000","up_votes":1,"down_votes":1,"body":"Estan rotos esos giles xd el zed te deletea un garen si esta feed y lo vi en una ranked.","replies":[]},{"poster":"kique1","date":"2015-08-28T04:03:29.929+0000","up_votes":1,"down_votes":1,"body":"Level 8 xD","replies":[]}]}