{"poster":"ReniRajix","date":"2016-08-17T21:21:42.671+0000","title":"Champion-Mastery-Emote und Emotes allgemein","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Vorab, ich entschuldige mich f&uuml;r jegliche Rechtschreib- und Grammatikfehler.\r\nIch bin ein sehr einfach zu tiltender Mensch. Ich hasse die funktion der Emotes, es wird nur zum Disrespecten und BMen genutzt und nervt mich immer mehr. Ich versuche einfach nicht mehr zu tilten/ragen, ich versuche es mit allem M&ouml;glichen, ich schalte den all chat aus, ich schreibe nich, ich versuch mich immer zu beruhigen, doch eine Sache kann ich nicht &auml;ndern: Emotes. \r\nWie kommt ihr damit klar? Wie haltet ihr euch ruhig und was macht ihr wenn ihr zu tiltet seid f&uuml;r eine Runde?\r\nIch freue mich auf jede Art von Antwort!\r\nLG Reni  {{champion:121}}","replies":[{"poster":"Sałtyy","date":"2016-08-18T06:27:08.613+0000","up_votes":2,"down_votes":0,"body":"Emotes sind doch voll geil!\nIch mein...wenn dich son Richtig schlechter, Sagen wir mal Yas main killt und das spamt, find ich es immer geil ihn zu fragen, wo er seinen Acc gekauft hat xD","replies":[{"poster":"ReniRajix","date":"2016-08-18T10:18:35.610+0000","up_votes":1,"down_votes":0,"body":"Sowas finde ich auch lustig, aber, stell dir mal vor du wirst gerade richtig weggestompt und das einzige was dein gegner macht is dich zu zonen und auszulachen mit seinen emotes, weil er weiß dass man sowieso nichts gegen ihn machen kann, ob mit jungler oder ohne. :)","replies":[{"poster":"0815xand0r","date":"2016-08-18T12:00:59.318+0000","up_votes":1,"down_votes":0,"body":"Dann ist das halt so. Warum sollte man sich darüber aufregen, wenn man es nicht ändern kann? Das negative Verhalten des Gegenübers ist für mich nie eine Provokation, sondern nur ein deutliches Zeichen dafür, wie schlecht es um diese Person stehen muss, dass sie tatsächlich völlig fremde Menschen versuchen muss durch Emotes runterzumachen. Ich empfinde da fast schon Mitleid.","replies":[{"poster":"ReniRajix","date":"2016-08-18T19:27:20.555+0000","up_votes":1,"down_votes":0,"body":"Ich hab gerade 1 Spiel gespielt, indem der gegn. Mordekaiser nur sein Level 7 Icon gezeigt hat. Ich hab gewusst, dass ich als Fiora das stärkere late habe und habe einfach ruhig weiter gespielt und ignoriert, es hat ziemlich gut funktioniert! :) {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Sałtyy","date":"2016-08-18T13:38:04.091+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ReniRajix,realm=EUW,application-id=Wj1wcocU,discussion-id=536X2FEG,comment-id=00000000,timestamp=2016-08-18T10:18:35.610+0000)\n>\n> Sowas finde ich auch lustig, aber, stell dir mal vor du wirst gerade richtig weggestompt und das einzige was dein gegner macht is dich zu zonen und auszulachen mit seinen emotes, weil er weiß dass man sowieso nichts gegen ihn machen kann, ob mit jungler oder ohne. :)\n\nDann is es halt so, man muss sich von sowas ja nicht \"Provozieren\" lassen, verliert man halt, man muss halt aus seinen Fehlern lernen, so seh ich das halt (Auch wenn ich zudumm bin, um aus meinen Fehlern zu lernen xD)\n\nIch mach einfach Musik an und ez, hatte damit noch nie probleme, selbst wenn ich 0/20 stand :3","replies":[]}]}]},{"poster":"Lux Shieda Kayn","date":"2017-09-19T16:06:19.689+0000","up_votes":1,"down_votes":0,"body":"Schonmal was von /ignore gehört?\nKönnte dir helfen, obwohl ich tilt nicht wirklich verstehe.\nIch meine es ist nur ein spiel das kein einfluss auf dein echtes leben hat.\nUnd wenn du insgesammt leicht tiltest solltest du vielleicht am anfang jeder runde mal /mute all machen, dann bleiben die beleidigungen auf kindergarten niveau dir erspart","replies":[]},{"poster":"HyperionCH","date":"2016-08-18T10:32:11.278+0000","up_votes":1,"down_votes":0,"body":"Ich beachte es einfach nicht.\n\nWenn mich jemand stompt und dann Emotes spamt, zeigt dies höchstens, dass jener Spieler sich nicht so sportlich verhalten kann.\n\nWas soll dies mich kümmern?\nIch verliere wohl das Game, aber vielleicht gewinne ich das nächste. Der Gegner hingegen bleibt ein eher unsportlicher Spieler.","replies":[]},{"poster":"Gang Hei","date":"2016-08-18T10:28:44.271+0000","up_votes":1,"down_votes":0,"body":"Die Emotes (vor allem das Mastery-Emote), werdem tatsächlich von allen die ich kenne als Provokationsmöglichkeit verstanden und manchmal auch so interpretiert. In 1 von 10 Fällen beginnt der provozierte Spieler zu flamen was die ganze Situation noch verschlimmert. Trotzdem finde ich, dass dieses Feature bleiben soll, denn das eigentliche Problem sind die Spieler die sich dadurch provozieren lassen und nicht diejenigen welche die Emotes verwenden.","replies":[]}]}