{"poster":"MHQ V1per","date":"2019-02-04T17:40:34.850+0000","title":"Gold Team sucht Top + Jngl","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Guten Abend,\r\n\r\nwie schon oben erw&auml;hnt suchen wir, f&uuml;r den genannten Elo-Bereich ein Top-Laner sowie auch einen Jungler f&uuml;r kommende Tryouts.\r\n\r\nWir sind ein Gruppe, welches sich als Ziel setzt, nicht nur als Team zu improven, sondern auch abseits der Kluft einen vern&uuml;nftigen Draht zu pflegen &uuml;bt.\r\n\r\nGeplant ist ebenfalls ein stetiges Teilnehmen an kompetitiven Turnieren im Bereich 5o5. Um das jedoch sinnvoll zu verwerten, sowie auch &uuml;berhaupt einen Erfolg zu genie&szlig;en, wird folgendes &quot;gefordert&quot;:\r\n\r\nDiziplin - nicht nur in Hinsicht auf Kritik, sondern auch in Hinsicht auf Erscheinen zu abgemachten Trainingszeiten, welche notwendig sind, um die o.g. Ziele anzupeilen und zu verwirklichen.\r\n\r\nSpa&szlig; am kompetitiven Spiel - nicht jedermanns Sache, da regelm&auml;&szlig;iges Training und tryharden gerne mal in Games m&uuml;ndet, an denen man nicht so ganz Spa&szlig; an dem hat, was man gerade Spielt und man eine gewisse Pflicht hat welches &uuml;ber das Hobbyspielen hinaus geht.\r\n\r\nEigenkritik - zu jedem Improvement z&auml;hlen Fehlern. Diese sind wichtig, um voranzukommen. Tilt sowie Flame ist daher useless und nicht so gern gesehen. \r\nTiltproof - erkl&auml;rt sich glaub ich von selbst.\r\n\r\nTeamf&auml;higkeit - klar.\r\n\r\nNun zu den Bestandsvoraussetzungen:\r\n- Headset mit halbwegs guter Quali\r\n- Im o.g. Elobereich\r\n- Mindestalter - 18 Jahre\r\n\r\nFalls ich Dich mit der Wall of Text noch nicht abgeschreckt habe, erl&auml;utere ich noch einmal kurz die Vorteile des Teams.\r\n\r\nDich erwarten nicht nur reines Teamplay, sonder dank der Unterst&uuml;tzung von Unleashed Gaming, ein professioneller Clan welcher Chancen auf Weiterbildung durch high-elo-Player, sowie auch interne, individuelle Teamunterst&uuml;tzung bietet.\r\n\r\nFalls du Interesse hast, einfach adden. Danke f&uuml;r die Zeit.\r\n\r\nGr&uuml;&szlig;e","replies":[]}