{"poster":"FireBird2013","date":"2017-07-16T21:46:16.157+0000","title":"Unskill and Trollpick back to report reasons","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"We all have had bad games this is definetly true i have 700k xp with Cho'Gath and once i ended up in 0/7 and yes it was a bad game but there are people who don't deserve to play this game at least not on rankeds.\r\n To begin with we all know that Lol is a team based game where every 1 counts.I mean the support is as important as the midlaner or jungler.And every role and lane has different playstyle and every role needs different builds.\r\n For example a lot of people bring lux as a support.Is this a problem?Well it can be a problem only if the specific person starts with a doran's ring.\r\nWhy is this a bad decision?They can not use its passive and won't get any gold.In this situation the guy with the basic midlaner build can not be considered a support so he is definetly a trollpicker.\r\n An other usually made mistake is when you pick champions for lanes which they aren't good on.For example i am sure we all encountered lee sin support.\r\nIt is simply a bad decision which can cost you the game.Another major problem is that people don't consider wards important at all.On a ranked we had a janna support who thought that luden is more important than  sightstone.I was playing with Hecarim jungle and it was about lategame and i ended up buying sightstone in order to keep baron and the elder drake warded.WIth this risky decision i made we ended up winning the game because when they started to baron my ward was there shining so i went in and did a double and stole it.We did a final push and have won the game.\r\n Now there are those guys who spam a lane in the chat they get it and then they end up 2/13.The problem with them is that they don't think this is bad or their fault.It is definetly the junglers fault.People don't know how to play the game maybe the  tutorial wasn't good enough for them but they think that if they are getting ganked by the enemy jungler while they are nearly under THE ENEMY TOWER than that is not HIS FAULT.\r\n So what do they do?\r\nThey keep pushing the lane keep dying then in 0/4 or 0/5 they finally wait up the jungler who will try his best to help him now.If the enemy laner got fed enough than he will do a double and then that lane is definetly lost.The reaction of your laner is typical:Report the jungler.\r\n These kind of players can not be reported for a reason with the current settings.So they will keep up this attitude and will cause a lot of trouble they will keep feeding ending up with 2/13.I don't know where is the fun part in this.Every game was made to be enjoyed so people would have fun that is why we are playing this game.\r\n The current honor system brought a big change but still it isn't enough at least on the EU NE servers.\r\n So i would like it if trollpicking and unskill would be a report reason.\r\nAnd the penalty for this kind of behavior should not be dishonor.\r\nThese people might be trying their best while ending up in 2/13 and they need time to master the champions their mechanics and more.But if they are at lvl 30 they should be prevented from playing ranked if they got reports for unskill or trollpick.They should be mastering their skills first on normal drafts.I mean the first penalty should be 5 won normal drafts game before they could go and play any rankeds.By this time they will change their attitude and learn a lot.\r\nLet me see what you think about this system maybe riot will listen to me and US especially if you support my ideas.","replies":[{"poster":"Aiko Umesawa","date":"2017-07-17T03:03:15.671+0000","up_votes":2,"down_votes":0,"body":"You can't really report someone for being bad at the game.... I mean you used to be able to but it never did anything really... It's simply because if you had one bad game or one bad play in a teamfight that cost you the game, people may report you as \"Unskilled\" and what if someone got banned from the reports because they were \"Bad at the game?\" and troll picks can be off meta picks... for example malphite or orianna support...","replies":[{"poster":"Aiko Umesawa","date":"2017-07-17T03:03:53.151+0000","up_votes":2,"down_votes":0,"body":"Really it would be a pretty toxic environment if people were just banned for being bad...","replies":[{"poster":"FireBird2013","date":"2017-07-17T08:36:48.914+0000","up_votes":1,"down_votes":0,"body":"I am not talking about off meta skills i mean those guys who come with teemo or lee sin support intentionally because they didn't get their prefered role.\nI mean there should be at least a tutorial for each of the roles and it should be obligatory supporting can be fun to if you play it right.","replies":[]}]}]},{"poster":"Broporo","date":"2017-07-17T00:49:07.889+0000","up_votes":1,"down_votes":0,"body":"I can definitely see your passion on this topic, so I'd like to quickly address a couple of these points. Overall though, this type of post would best be suited to [**Client Discussion**](http://boards.na.leagueoflegends.com/en/c/alpha-client-discussion) to get more attention and better feedback.\n\nIncluding \"trollpick\" or \"unskilled\" as a report option doesn't necessarily fit the type of options someone would need for submitting a report. Marking someone as unskilled and looking for them to be punished for their \"lack of skill\" is rather unsportsmanlike and doesn't help them get better whatsoever. As far as a \"trollpick\", that person may very likely have been trying a newer option or is not fully engrossed in the League Meta, and that's okay!","replies":[]},{"poster":"TheViper7911","date":"2017-07-16T22:48:26.926+0000","up_votes":1,"down_votes":0,"body":"The report reasons literally do not matter. No reports are read by humans. The system is automated.\nThe report categories are for internal data use by Riot to refine the system. No matter which ones you check off, the review done by the automated system is exactly the same. So calling for renaming categories does nothing to change the systems behavior.","replies":[]}]}