{"poster":"Nata","date":"2016-03-02T01:11:53.020+0000","title":"Algun main Skarner?","subforum":"Guias y consejos","up_votes":2,"down_votes":0,"body":"Hola. Recien me compre a Skarner y estoy un poco confuso porque no se como se buildea. Ya que todas sus habilidades escalan con AP pero se lo hace AD. Que build me recomiendan? Gracias","replies":[{"poster":"MolotovKiller","date":"2016-03-02T01:21:09.115+0000","up_votes":2,"down_votes":0,"body":"Build? full tank, a lo sumo comprale la Trinity. Por otro lado, se le hace AD por que creo que sus escalados tampoco son la gran cosa, entonces es preferible que tenga AD, aunque no estoy muy seguro.\nPor la build, yo le armo: \n{{item:1401}}  {{item:3742}} {{item:3053}} {{item:3078}} {{item:3111}} {{item:3047}} {{item:3156}} \nAunque todo se lo podes cambiar para que tankee mas. Por ejemplo si tienen mucho daño y un CC excesivo, la banshee o si queres mas daño cambiarle el sterak por otro item de daño, siempre cambia dependiendo la situación, incluso vi algunos con el portal ZZ por las resistencias que da.","replies":[{"poster":"Swag sama","date":"2016-03-02T01:26:46.888+0000","up_votes":2,"down_votes":0,"body":"El {{item:3025}} es bueno con {{champion:72}}, te da mas CC, reducción de enfriamientos y armadura, y como puedes ir espameando la Q, la pasiva lo tienes casi siempre (aun que lo nerfearon en este parche)","replies":[]},{"poster":"Nata","date":"2016-03-02T01:35:43.889+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias a los 2","replies":[]}]},{"poster":"Jherico","date":"2016-03-02T11:12:12.078+0000","up_votes":1,"down_votes":0,"body":"Que buena compra viejo, yo lo uso hasta de support por su e, la build que te dijieron los chicos es la mejor,\ndespues las runas sera otro tema, muchos usan velocidad de ataque yo las genericas ad. suerte pa","replies":[{"poster":"Nata","date":"2016-03-02T22:22:31.431+0000","up_votes":1,"down_votes":0,"body":"Una pregunta. Con hidra titanica iria? Como te da vida y daño y tambien pienso que se lo puede armar offtank","replies":[]}]},{"poster":"Alan Op","date":"2016-03-02T01:47:00.228+0000","up_votes":1,"down_votes":0,"body":"probalo con devorador tambien xD no troll eh para tener mas rapido la Q","replies":[]}]}