{"poster":"Tekke","date":"2015-11-10T08:16:36.727+0000","title":"Season 6 - Heading in the wrong direction?","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":0,"body":"Hey there guys!! My input may or may not mean anything to you guys but the new season approaching seems to have a lot of players feeling.... Disappointed. \r\n\r\nAs much as I love league and new season changes, i can safely say for the first time, league seems unappealing. Many players I have spoken to seem to be very disappointed with how Riot has decided to evolve this fantastic game.\r\n\r\nFirst of all, the changes to adc look rather interesting and add a uniqueness to the the bot lane and to the game composition itself, riot have outdone themselves there.\r\n\r\nBut what they have done to the rest of the game has sparked a lot of negative attention.\r\n\r\nLet&#039;s start with AP champions. As addition to making adc&#039;s stronger, everything AP seems to be getting nerfed. We can see some of our favourite items losing a lot of there power and costing us more to use them. Eg. Zhonyas.\r\nAtm it currently has 100AP and 50 armour, yet next season it&#039;s stats are 80AP and 45 armour.\r\nAs far as being a league player for 3 seasons now, I feel like season 5 has been the most balanced of all seasons. It all just comes down to team compositions, meta and how your team works together. But the changes to this season see a huge impact on making AP champs lose their burst, the only reason they exist. Even the fact that mana potions are removed from the game has dramatically reduced their ability to keep up with the rest of the game. Yes they have improved mana regen and scaling, but some champions rely on that boost in mana for easy money to change a game. Whereas we see adc items with mana gain potential. Too much has gone into improving adc&#039;s as a power play, rather then a team strategic player. I know a lot of players are questioning what riot were thinking (even some of the top players)\r\n\r\nAnother big change we are going to see is the rank que. changing solo/duo que to any amount defeats the whole purpose of team ques? Like what is the point haha.\r\nI understand sometimes people may want to play with multiple people at a time, but it will have a major impact on Elo rankings. With this we will see a huge rise in Elo boosters and players getting carried to ranks they don&#039;t have the skill level to play in on their own. Solo que was simply implemented in league to test how good you are as an individual player, it isn&#039;t meant for teams. That&#039;s why you have ranked teams. \r\n\r\nMany people may be reading this and thinking I&#039;m just some stupid kid ranting about league, but I and many players have a right to speak our mind, and I do speak on behalf of quiet a large group of league players. Yes I don&#039;t know how this season will pan out yet, and yes I am just making assumptions on calculations and release notes, but if things go the way a few of us see it, league may lose a lot of interest from original players.","replies":[{"poster":"SkarSkarSkarner","date":"2015-11-11T03:27:19.360+0000","up_votes":1,"down_votes":0,"body":"I'm struggling just to choose my masteries. Even the generic ones. What last mastery are you supposed to go for a mage page? It seems like you definitely have to make a mastery page for each specific champion now.","replies":[]},{"poster":"The Beauner","date":"2015-11-11T03:21:22.683+0000","up_votes":1,"down_votes":0,"body":"Personally i cant wait for the new changes i think everything looks great and that riot have actually done a decent job balancing everything, a lot of people have misconceptions because they only look at one aspect of the changes rather than the changes as a whole. eg some people are saying \"so many items cost so much more gold now RIP AP champs that need high damage\", without even realizing that riot have pumped so much more gold into the game whether it be passive gold gain, objective gold even farming give you more now.","replies":[]},{"poster":"Nijel","date":"2015-11-11T02:13:19.741+0000","up_votes":1,"down_votes":0,"body":"Too early to say.","replies":[]},{"poster":"Azirious Mistake","date":"2015-11-11T02:12:36.476+0000","up_votes":1,"down_votes":0,"body":"I dont think these item changes fix any problems that markspeople had, ADC is still feast or famine and no amount of skilled play is going to get you back in a game once you fall behind. Also bot lane is STILL an arms race, albeit a bit less because of the changes, additionally I feel like i'm being forced into stacking an unhealthy mechanic that doesn't provide meaningful counterplay and even worse this season, at least when you died before preseason you just accepted it because with that 40% crit chance you know you weren't going to crit a lot, preseason 6 you get roughly 80% crit on a champion and when you die you just feel gimped big time and get salty af because the enemy ADC was more lucky than you and vice versa if you came out on top.\n\n\nWelcome to the League of Crit guys.","replies":[]},{"poster":"Bill","date":"2015-11-10T21:40:46.662+0000","up_votes":1,"down_votes":0,"body":"Too many changes for me :(","replies":[]},{"poster":"Jink","date":"2015-11-10T10:24:28.872+0000","up_votes":1,"down_votes":0,"body":"They're slowly turning the game into ARAM.\n\nThey'll get there one day, then we can all go play Dota.","replies":[]},{"poster":"Project Xayah","date":"2015-11-10T09:24:16.758+0000","up_votes":1,"down_votes":0,"body":"> But what they have done to the rest of the game has sparked a lot of negative attention.\n\nSo you don't see *any* problems with the ADC changes... None... At all...\n\nIf so, please just stop talking now.","replies":[{"poster":"Tekke","date":"2015-11-10T09:33:07.005+0000","up_votes":1,"down_votes":0,"body":"No there are problems with the new adc system. I just said the concept to make adc's unique was a good idea.\nI stated 'Whereas we see adc items with mana gain potential. Too much has gone into improving adc's as a power play, rather then a team strategic player. I know a lot of players are questioning what riot were thinking'","replies":[{"poster":"Project Xayah","date":"2015-11-10T09:38:22.507+0000","up_votes":1,"down_votes":0,"body":"> No there are problems with the new adc system.\n\nI'm not talking about the new ADC \"system\", I'm talking about changes to specific champions.","replies":[{"poster":"Jink","date":"2015-11-10T10:19:36.515+0000","up_votes":1,"down_votes":0,"body":"I like how in Dat Riot Video the Kog has 6 thousand percent attack speed and kills a 3K HP Sion in 3 seconds even tho he only has like 200 AD.","replies":[]}]}]}]}]}