{"poster":"DoubleT","date":"2016-10-06T13:10:26.073+0000","title":"Quando ritorna il tribunale?","subforum":"Discussioni generali","up_votes":3,"down_votes":7,"body":"Basta...mi sono rotto le palle, &egrave; la terza promo che perdo per via di un bambino che va afk dopo aver flammato tutto il team, terza promo che perdo dopo aver portato il vantaggio il team, perch&eacute; uno stupido bimbo del c***o lefta solo perch&eacute; non ha preso una kill in teamfight o perch&eacute; gli hai farmato 3 cs per aiutarlo a pushare.\r\n\r\nBasta...&egrave; ora che si torni ad imbastire un bel tribunale, dove questi giocatori vengano permabannati per IP da questo gioco, non si pu&ograve; continuare cos&igrave;. Niente bot, niente macchine o filtri, semplicemente la community che giudica se stessa, perch&eacute; &egrave; ora di finirla, &egrave; ora di scremare tutta questa gente che non &egrave; in grado do giocare tranquilla una ranked, e che causa sconfitte immeritate a chi invece magari ha fatto tanto per provare a vincere.\r\nPersonalmente credo che si dovrebbe fare cos&igrave;: un bel tribunale in cui un giocatore pu&ograve; postare screen ed in cui gli admin possono verificare i log di game e chat...e si decide. Sondaggi? Uno o pi&ugrave; giudici? Quello che si vuole, ma che sia fatto! Perch&eacute; non &egrave; possibile che io o altri giocatori dobbiamo subire questi atteggiamenti e non essere tutelati in maniera permanente.\r\n\r\nRagequit = permaban\r\nFeeding intenzionale = permaban\r\nFlame continuo per almeno 10 game = permaban\r\nQuesti atteggiamenti in ranked andrebbero puniti in questo modo secondo me, cos&igrave; la gente ci penser&agrave; 2 volte prima di iniziare a rovinare i game altrui. Ovviamente i ban per IP, che sono fattibili ed usati in molti altri contesti.\r\n\r\nSo che magari &egrave; una opinione un po&#039; drastica, ma secondo me &egrave; l&#039;unica per recuperare un po&#039; di decenza in questo gioco, anche se credo non verr&agrave; mai attuato nulla del genere, perch&eacute; comporterebbe per la RIOT avere una community pi&ugrave; pulita ma meno numerosa e quindi meno &quot;spendacciona&quot;.","replies":[{"poster":"Chroniicles","date":"2016-10-06T14:05:39.436+0000","up_votes":4,"down_votes":1,"body":"C'è una cosa che tralasci, una cosa più che evidente: la mole di lavoro.\nIl sistema automatico normalmente punisce i flamer nel giro di 15 minuti. Fanno in tempo a finire un eventuale game ristartato dopo l'infrazione che si trovano chat restricted o l'account bannato... oserei dire piuttosto veloce. Col vecchio tribunale non era assolutamente questa la tempistica, e non tutti i casi venivano poi effettivamente esaminati a dovere.\nSe parliamo di AFK e ragequitter poi la cosa diventa ancora più veloce, perchè quando finisci il game e vedi il nick della persona incriminata in rosso significa che il leaverbuster ha già punito con le code a bassa priorità o il ban per i casi recidivi.\n\nLe punizioni sono già abbastanza severe così come sono, vengono applicate anche se a noi non sempre viene notificato, sei in un evidente _stato alterato _ dovuto alle numerose sconfitte e probabilmente non riesci a metabolizzare il fatto che ban a destra e a manca senza criterio non ti ridaranno quei game\\pl\\promo nè tantomeno eviteranno che in futuro tu no ti imbatta in afk o flamer","replies":[{"poster":"DoubleT","date":"2016-10-06T16:23:32.269+0000","up_votes":2,"down_votes":1,"body":"Beh...il permaban dei flamer degli afk mi permetterà di incontrarne meno dato che verrebbero scremati.\nGli afk vengono puniti? Ah sì? Mi fa un po' sorridere la cosa visto che ne becco almeno 1 nel mio team ogni 2 partite...da tipo un mese!\nNon è solo il fatto di metabolizzare la sconfitta, è proprio che io vedo una certa inefficacia del sistema.\n\nNon ho mai visto feeder o gente che va abitualmente afk bannata, guardo le loro schede e partite e vedo che continuano regolarmente a giocare e a trollare, immaginando che ricevano un ban ogni partita, visto che perdono apposta piuttosto spesso, ne deduco che il sistema non funziona.\n\nA supporto di questa tesi porto anche il fatto che una macchina non può sapere cosa sia un troll, né stabilire quando un giocatore sta giocando intenzionalmente male o semplicemente ha avuto qualche game di bassa qualità.\n\nEcco questi 2 elementi: 1 i feeder e gli afk che incontro continuano regolarmente a giocare per mesi, 2 l'impossibilità di una macchina di poter determinare cosa sia un feeder od un troll dimostrano senza ombra di dubbio che il sistema non funziona.\n\nLa cosa poi è acuita dal fatto che ci sono diversi smurf di gente gold o platino che trollano e rovinano game continuamente per ridersela degli altri bronzi o silver (tanto il loro mani mica viene punito). Questa pratica si è molto acuita nell'ultimo periodo.","replies":[{"poster":"Chroniicles","date":"2016-10-06T18:58:53.977+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=DoubleT,realm=EUW,application-id=MJVj50Jw,discussion-id=6Wu4HvU8,comment-id=00040000,timestamp=2016-10-06T16:23:32.269+0000)\n>\n> Beh...il permaban dei flamer degli afk mi permetterà di incontrarne meno dato che verrebbero scremati.\n\nVengono già _scremati_, sei poco obbiettivo se continui ad affermare il contrario. Giusto per farti un esempio alla portata di tutti (dato che certe statistiche sono tenute segrete) ogni giorno sul forum posta qualcuno che si lamenta di un ban o altri provvedimenti, OGNI GIORNO. E non parlo solo della board italiana, sia chiaro. \n\n> Gli afk vengono puniti? Ah sì? Mi fa un po&#x27; sorridere la cosa visto che ne becco almeno 1 nel mio team ogni 2 partite...da tipo un mese!\n> Non è solo il fatto di metabolizzare la sconfitta, è proprio che io vedo una certa inefficacia del sistema.\n\nQuindi hai ribeccato gli stessi che erano andati afk? Perchè sennò continua a non aver senso quello che dici. Gioco anche io e non ne becco maiI così tanti. Un periodo particolarmente sfortunato può capitare, ma non è la regola. \nInoltre, le punizioni per afk sono commisurate al tipo di infrazione, ti danno la possibilità di non ricascarci e ti sorprenderà quanta gente capisce che non si deve leftare un game dopo che sconta 5 code da 20 minuti per startare una partita\n\n> \n> Non ho mai visto feeder o gente che va abitualmente afk bannata, **guardo le loro schede e partite e vedo che continuano regolarmente a giocare **e a trollare, immaginando che ricevano un ban ogni partita, visto che perdono apposta piuttosto spesso, ne deduco che il sistema non funziona.\n\nquest imho o è abbastanza triste, ma non voglio commentare oltre\n> \n> A supporto di questa tesi porto anche il fatto che una macchina non può sapere cosa sia un troll, né stabilire quando un giocatore sta giocando intenzionalmente male o semplicemente ha avuto qualche game di bassa qualità.\n\nsi può invece. Ma non verranno mai rese pubbliche certe cose, o verrebbero poi raggirate e il lavoro di chi programma questi algoritmi diventerebbe frustrante. \n> \n> Ecco questi 2 elementi: 1 i feeder e gli afk che incontro continuano regolarmente a giocare per mesi, 2 l&#x27;impossibilità di una macchina di poter determinare cosa sia un feeder od un troll dimostrano senza ombra di dubbio che il sistema non funziona.\n\nNessuno verrà mai punito perchè feedda in modo non intenzionale. Dovremmo bannare tutti quelli scarsi? GG \n> \n> La cosa poi è acuita dal fatto che ci sono diversi smurf di gente gold o platino che trollano e rovinano game continuamente per ridersela degli altri bronzi o silver (tanto il loro mani mica viene punito). Questa pratica si è molto acuita nell&#x27;ultimo periodo.\n\nora sorrido io :P ci si lamenta sempre di avere smurf contro, quelli con te invece trollano... ok","replies":[{"poster":"DoubleT","date":"2016-10-10T11:17:44.190+0000","up_votes":1,"down_votes":0,"body":"> Vengono già scremati, sei poco obbiettivo se continui ad affermare il contrario. Giusto per farti un esempio alla portata di tutti (dato che certe statistiche sono tenute segrete) ogni giorno sul forum posta qualcuno che si lamenta di un ban o altri provvedimenti, OGNI GIORNO. E non parlo solo della board italiana, sia chiaro.\n\nAllora i restanti me li ritrovo sempre io? Lo trovo un po' improbabile.\n\n> Quindi hai ribeccato gli stessi che erano andati afk? Perchè sennò continua a non aver senso quello che dici. Gioco anche io e non ne becco maiI così tanti. Un periodo particolarmente sfortunato può capitare, ma non è la regola.\nInoltre, le punizioni per afk sono commisurate al tipo di infrazione, ti danno la possibilità di non ricascarci e ti sorprenderà quanta gente capisce che non si deve leftare un game dopo che sconta 5 code da 20 minuti per startare una partita\n\nA volte ho ribeccato gli stessi, altre volte sono altri giocatori, così per 1 mese. Che ti devo dire...bravo te che non ne becchi così tanti, io ne becco almeno 1 ogni 3 partite nel mio team ed 1 ogni 20 partite nel team avversario.\n\n> quest imho o è abbastanza triste, ma non voglio commentare oltre\n\nNon credo sia triste informarsi su chi gioca con te...e quando vedi che questi prima di giocare con te hanno inanellato mesi di partite perse trollando, feeddando ed andando afk, con regolarità fissa, tutti i giorni...capisci che il sistema non funziona.\n\n> ora sorrido io :P ci si lamenta sempre di avere smurf contro, quelli con te invece trollano... ok\n\nE che ti devo dire...c'è chi incontra gli smurf che carriano tutto il team e chi (come me) incontra gli smurf che oltre a farti perdere ti insultano pure. GG","replies":[]}]}]}]},{"poster":"Sorcio84","date":"2016-10-06T13:32:21.110+0000","up_votes":3,"down_votes":1,"body":"Il tribunale non tornerà mai e la tua idea è stupida, per lo stesso motivo per il quale hanno chiuso il tribunale.\n\nSi avrebbe un giudizio fallato, oppure gente che vota al ban senza nemmeno leggere.\n\nUna macchina ha un giudizio imparziale, nonostante sia impossibilitata a capire l'ironia\n\nSorry per la brutta notizia","replies":[{"poster":"DoubleT","date":"2016-10-06T13:44:26.269+0000","up_votes":2,"down_votes":2,"body":"Una macchina dà un giudizio imparziale in base a cosa? Come fai a stabilire il giudizio critico di una macchina? Quali sono i parametri che vede? Oltre all'ironia una macchina non sa percepire una cosa molto importante, la malizia.\nLa malizia è quel carattere fondamentale che permette a chi vuole violare le regole, di farlo in maniera da non farsi scoprire in modo chiaro e netto.\n\nUna macchina risponde solo se vede certi parametri prestabiliti, una volta che uno li conosce, basta che ci giri attorno e può fregarla in qualsiasi modo...sai invece chi non puoi fregare così? Le persone.","replies":[{"poster":"Dr LouD","date":"2016-10-06T14:02:21.622+0000","up_votes":4,"down_votes":1,"body":"> Una macchina risponde solo se vede certi parametri prestabiliti, una volta che uno li conosce, basta che ci giri attorno e può fregarla in qualsiasi modo.\n\nCerto, hai totalmente ragione, ma dimentichi che questa macchina è sempre in costante sviluppo.\nIl sistema è sempre più affidabile, adesso punisce tranquillamente anche i feeder intenzionali, io stesso ne sono testimone visto che ho reportato un tizio per int feeding e dopo 2 minuti è stato punito.","replies":[]},{"poster":"Sorcio84","date":"2016-10-06T23:30:15.094+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DoubleT,realm=EUW,application-id=MJVj50Jw,discussion-id=6Wu4HvU8,comment-id=00030000,timestamp=2016-10-06T13:44:26.269+0000)\n>\n> Una macchina dà un giudizio imparziale in base a cosa? Come fai a stabilire il giudizio critico di una macchina? Quali sono i parametri che vede? Oltre all&#x27;ironia una macchina non sa percepire una cosa molto importante, la malizia.\n> La malizia è quel carattere fondamentale che permette a chi vuole violare le regole, di farlo in maniera da non farsi scoprire in modo chiaro e netto.\n> \n> Una macchina risponde solo se vede certi parametri prestabiliti, una volta che uno li conosce, basta che ci giri attorno e può fregarla in qualsiasi modo...sai invece chi non puoi fregare così? Le persone.\n\nNel documento di roberto cialdini \"le armi della persuasione\" viene spiegato che la simpatia geneta una variazione nel giudizio.\n\nUn uomo che maltratta una donna , sarà giudicato diversamente in base al fatto che il giudice sia uomo o donna.\n\nSe ripristinassero il tribunale la \"giustizia\" sarebbe abbastanza medievale.\n\n**IMHO**\nCi sarebbero :\n\n- eroi che votano secondo la legge punendo e salvando persone\n- tossici che bannano innocenti e cercano di non far bannare altri tossici\n- gente che vota per bannare deteminate categorie : afk , feeders, ecc.\n\nSi creerebbe una situaziono meno equilibrata di quella attuale.","replies":[{"poster":"DoubleT","date":"2016-10-10T11:19:56.695+0000","up_votes":1,"down_votes":0,"body":"Se così fosse, come dicevo prima, il gioco sarebbe morto da tempo, dato che avrebbe una community di soli giocatori tossici. Invece chissà perché quando c'era il tribunale e la community si autoregolava, l'obiettività non è mai mancata.","replies":[]}]}]}]},{"poster":"Kim114","date":"2016-10-06T13:30:12.040+0000","up_votes":2,"down_votes":0,"body":"Permaban è troppo\nUn ban temporaneo si, ma perma e per ip no","replies":[{"poster":"DoubleT","date":"2016-10-06T13:34:38.912+0000","up_votes":3,"down_votes":1,"body":"Lo dico solo per questi 3 atteggiamenti: flame reiterato, ragequit (anche qui reiterato), feeding intenzionale (anche qui se si vede che viene fatto assiduamente). Ragequit e feeding intenzionale se fatti in maniera costante in pratica sono passibili di trollaggio, il flame reiterato si spiega da sé.\nOvviamente sto parlando di ranked...escludo le normal, questo perché in normal si confonde spesso il trollaggio con la pratica di voler provare build particolari o fare esperimenti (che quindi possono fallire di brutto). In ranked si va nel competitivo, quindi le regole devono essere più stringenti, secondo me.","replies":[{"poster":"Kim114","date":"2016-10-06T13:41:36.424+0000","up_votes":2,"down_votes":1,"body":"Ma se quindi un giorno crasho devo dare addio a LOL per sempre? Col cavolo!","replies":[{"poster":"DoubleT","date":"2016-10-06T16:26:00.334+0000","up_votes":1,"down_votes":0,"body":"No...però se continui a crashare non puoi pretendere di fare ranked se prima non risolvi il tuo problema.\n\nSe io ho dei problemi con internet un giorno o due...non faccio ranked, perché rovinerei il gioco ad altri.","replies":[{"poster":"Kim114","date":"2016-10-06T16:31:06.866+0000","up_votes":1,"down_votes":0,"body":"Io non laggo/crasho mai tranne quando quelli della enel decidono di staccare la corrente alle 5 del pomerigio","replies":[{"poster":"DoubleT","date":"2016-10-06T16:42:04.039+0000","up_votes":1,"down_votes":0,"body":"Guarda, sono messo come te, anche io se crasho è per via di manutenzione.\nCosì come altri qui ed in tutta Europa e nel mondo. La cosa dovrebbe fare insospettire quando diventa frequente.\n\nUn operatore fa in media un test operativo in una determinata zona almeno 1 volta ogni 2 settimane, solitamente nelle ore serali dalle 22 in poi, ma può capitare anche nel pomeriggio...so queste cose perché ho avuto modo di collaborare con chi gestisce queste cose.\n\nSapendo questo, se io vedo che uno mi va afk 1 game su 3 per un mese, giocando 20 game a settimana...qualche sospetto mi viene. Se poi vedo pure le sue build ed i suoi score e vedo che sono delle palesi trollate...allora il sospetto è più che fondato!\n\nSapessi quanti ne ho visti così, che continuano a giocare nonostante tutto, fanno ranked continuamente, venendo reportati, per mesi.","replies":[{"poster":"Kim114","date":"2016-10-06T16:51:55.500+0000","up_votes":1,"down_votes":0,"body":"Ma da quel ch hai detto tu al primo afk , permanente è esagerato","replies":[{"poster":"DoubleT","date":"2016-10-06T18:09:35.261+0000","up_votes":1,"down_votes":0,"body":"Ho poi specificato che parlavo di comportamenti reiterati, gli afk che incontro sono player che lo fanno con una certa regolarità, eppure continuano a giocare, non riscontro alcun periodo di pausa nei loro game.","replies":[{"poster":"Kim114","date":"2016-10-06T18:10:50.385+0000","up_votes":1,"down_votes":0,"body":"ahhhhhhhh\noki","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Dr LouD","date":"2016-10-06T13:25:15.020+0000","up_votes":4,"down_votes":2,"body":"Quindi stai pensando di fare decidere alla community (che ricordo essere composta da BIMBI RAGER AFK come tu stesso gli hai definiti) delle sorti di altri giocatori\n\nLegit","replies":[{"poster":"DoubleT","date":"2016-10-06T13:29:10.423+0000","up_votes":3,"down_votes":2,"body":"Cero che è legittimo, perché se secondo le stime della RIOT gli afk, i troll ed i feeder sono solo il 10% di tutta la community, il restante 90% dovrebbe essere in grado, alla lunga, di cacciare fuori le mele marce.","replies":[{"poster":"Dr LouD","date":"2016-10-06T13:30:44.988+0000","up_votes":2,"down_votes":1,"body":"Davvero lo credi?","replies":[{"poster":"DoubleT","date":"2016-10-06T13:40:18.723+0000","up_votes":3,"down_votes":1,"body":"Ne io né te abbiamo modo di verificare i dati di RIOT Games, però pensa un attimo. Se i bimbi rager, afk e troll fossero la maggior parte dei giocatori, la minoranza abbandonerebbe in poco tempo il gioco e questo morirebbe. Dato che questo non si verifica, questi soggetti devono essere per forza una minoranza.\nOra però bisogna stabilire una cosa: dato che è impossibile avere un contesto perfetto senza rage, afk o troll...quale sarebbe il sistema migliore per limitarli ad una quantità accettabile?\nQuesto sistema non è adatto a rispondere a questa domanda: ad oggi non puoi beccare chi trolla, chi feedda intenzionalmente. In più chi va afk viene punito solo se si vede una certa frequenza stabilita prima, una volta che si conosce la frequenza, si può evitare il ban facilmente. Questo perché tutto viene gestito da macchine e non persone (che servono solo a confermare i giudizi di tali macchine).\nQuesto sistema non controlla le criticità e quindi non è adatto, il sistema migliore è far tornare le persone, la community, ad auto-giudicarsi...perché così alla fine, chi veramente ci tiene al gioco avrà la meglio.\n\n\nSolo che questo ragionamento non tiene conto di una cosa: i soldi. Questo ragionamento crea un contesto migliore, ma limita il guadagno e per questo non verrà mai attuato.","replies":[]}]}]}]},{"poster":"BrioStorm","date":"2016-10-06T13:18:02.744+0000","up_votes":2,"down_votes":1,"body":"Senza leggere tutto il tuo post, rispondo al titolo:\nCredo **MAI** dato che dicono che è lento e non è veramente affidabile.","replies":[{"poster":"DoubleT","date":"2016-10-06T13:27:49.264+0000","up_votes":3,"down_votes":2,"body":"Un tribunale è lento solo se vuoi che sia lento, se per esempio decidi che gli atteggiamenti reportati vengano decisi dalla community tramite sondaggi, puoi farli a tempo e chi passa guarda e mette il voto.\nAffidabilità? E in che modo sarebbe affidabile una macchina che non sa rilevare chi trolla, o chi feedda intenzionalmente o che in caso di afk si riserva una lenta decisione ma che porta quasi sempre ad un nulla di fatto?\n\nQuesto lo dico non per fare una critica a te...ma semplicemente per rispondere alle questioni che hai posto: secondo me le persone, quelle che giocano e quindi conoscono il gioco e la community, sono i giudici migliori. Ad oggi i troll ed i feeder intenzionali sono aumentati a dismisura e non li puoi punire visto che una macchina non può stabilire con certezza dei parametri per cui uno feedda intenzionalmente, e con queste nuove regole anche gli afk hanno molto margine di manovra prima di essere beccati.\n\nCi vogliono delle persone, perché solo dei giocatori riescono a vedere dietro gli atteggiamenti degli altri giocatori, noi tutti riusciamo a capire quando in game uno feedda di proposito o quando trolla, una macchina non può.","replies":[{"poster":"BrioStorm","date":"2016-10-06T14:10:08.495+0000","up_votes":1,"down_votes":0,"body":"Tranquillo, neanche io volevo fare una \"critica\" a te ma ho riportato letteralmente quello che ha detto uno dello Staff in un altro post.","replies":[{"poster":"DoubleT","date":"2016-10-06T16:27:37.341+0000","up_votes":1,"down_votes":0,"body":"Si si certo l'avevo capito ;D","replies":[]}]}]}]},{"poster":"LionHeartV","date":"2016-10-06T14:09:03.152+0000","up_votes":1,"down_votes":1,"body":"il permaban per ip non sarebbe male, anche il multi-account dovrebbe essere sanzionato","replies":[{"poster":"DuckQuack0","date":"2016-10-06T15:56:05.832+0000","up_votes":2,"down_votes":1,"body":"Quindi col tuo ragionamento verremmo bannati io e mio fratello senza aver fatto nulla","replies":[{"poster":"DoubleT","date":"2016-10-06T16:31:02.488+0000","up_votes":1,"down_votes":0,"body":"No se tu e tuo fratello giocate su 2 diversi PC","replies":[{"poster":"DuckQuack0","date":"2016-10-06T17:26:16.136+0000","up_votes":2,"down_votes":1,"body":"Non giochiamo su diversi PC\n\nIn ogni caso, ragionamento senza senso e inutile e non verrà preso in considerazione","replies":[{"poster":"DoubleT","date":"2016-10-06T18:11:43.317+0000","up_votes":1,"down_votes":0,"body":"Non verrà mai applicato solo perché poi ci sarebbero meno giocatori e quindi meno potenziali spendaccioni, è solo questione di soldi, alla RIOT non gliene frega molto della community.","replies":[{"poster":"DuckQuack0","date":"2016-10-06T18:50:36.135+0000","up_votes":1,"down_votes":2,"body":"Alla Riot non frega di opinioni così stupide, senza senso, a cui nessuno ci guadagnerebbe niente\n\nE poi, cosa importa se la Riot guadagna? Tipico di chi si lamenta di tutto\nAnzi, ringrazia a Dio che continuano a mandare avanti un gioco a cui tu probabilmente giochi ogni giorno\n\nIo ci ho speso 20 euro in 5 anni, e stai sicuro che alla Riot non servono né i miei né i tuoi né i soldi di nessun altro per andare avanti\n\nHo 3 amici con fratelli che giocano su uno stesso PC, ma dal tuo intelligente ragionamento verremmo tutti bannati, nonostante fossimo sicuramente più sportivi di te, da quello che scrivi...","replies":[]}]}]}]}]},{"poster":"Linkimaru OP","date":"2016-10-06T14:38:14.726+0000","up_votes":1,"down_votes":1,"body":"Diamo anche la pena di morte dato che si siamo XD\nCon multi account vietato e permaban per Ip se uno viene bannato una volta non potrà mai più ricominciare, bel ragionamento.","replies":[{"poster":"LionHeartV","date":"2016-10-06T16:59:18.913+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Linkimaru OP,realm=EUW,application-id=MJVj50Jw,discussion-id=6Wu4HvU8,comment-id=00050000,timestamp=2016-10-06T14:38:14.726+0000)\n>\n> Diamo anche la pena di morte dato che si siamo XD\n> Con multi account vietato e permaban per Ip se uno viene bannato una volta non potrà mai più ricominciare, bel ragionamento.\n\ncome per la patente a punti basta fare una cosa simile, purtroppo tempi duri richiedono metodi duri xD","replies":[]}]}]},{"poster":"PrinceUsuiTakumi","date":"2016-10-06T15:24:33.658+0000","up_votes":1,"down_votes":0,"body":"solo perché non ha preso una kill in teamfight o perché gli hai farmato 3 cs per aiutarlo a pushare. \n\nHo una vaga idea di come siano andate veramente  le cose ;) \nanyway bronzo 2,sono cose che capitano","replies":[{"poster":"DoubleT","date":"2016-10-06T16:12:57.781+0000","up_votes":2,"down_votes":1,"body":"Beh io un'idea di come sono andate le cose ce l'ho...visto che c'ero...poi cosa sia passato per la sua testa non lo so XD","replies":[{"poster":"DuckQuack0","date":"2016-10-06T18:56:27.491+0000","up_votes":1,"down_votes":3,"body":"Si ma che ti lamenti a fare dei bronzi...\nProprio non capisco gente come te che si lamenta in Bronzo\n\nChi fa le ranked per la prima volta ha molte chance di iniziare dal silver, chi va in bronzo è per una ragione, ed è meglio che non te la dica, per evitare \"si ma io sono forte\", perché nessuno è boostato in bronzo, sono tutti scarsi, è molto diverso, e tu ci sei dentro, non per colpa nostra di sicuro","replies":[{"poster":"DoubleT","date":"2016-10-10T11:27:27.330+0000","up_votes":1,"down_votes":0,"body":"Io non dico di meritare il gold, o il platino, o il challengiur...dico solo che c'è gente che non ha la mentalità per giocare a questo gioco, e che le ranked è meglio che le lasci perdere, per non rovinare il gioco degli altri, tutto qui. Io da support vinco sempre la lane col mio adc, quando posso faccio pure vincere le altre lane, poi cosa accade? Che al primo teamfight perso tutti surrendano o cominciano a flammare.\nCerco di portare calma, cerco di spiegare che non è finita, che siamo feeddati, che se gruppiamo possiamo vincere, che siamo ancora in vantaggio...ma niente, questi tiltano. Punto e basta.\n\nCome fai a giocare con gente simile? Non puoi, e a me gente così capita nel 70% dei casi, ho anche provato in passato a giocare altri ruoli, ma non cambia: vai top? La bot feedda e ragequitta, vai support? Top o mid feedda e ragequitta, Vai giungla? Le altre lane feeddano e ragequittano.\nCome giustamente dici, questo è il bronzo, una lega dove solo pochi sanno giocare o giocare di squadra e che per salire fanno una gran fatica. Basterebbe che ognuno pensasse alla propria lane, giocasse sicuro e concentrato, invece no...si pensa solo a come gli altri possono carriarti il resto non conta.","replies":[]}]}]}]}]}