{"poster":"DoubleT","date":"2016-12-13T11:42:53.802+0000","title":"Domanda semplice","subforum":"Discussioni generali","up_votes":1,"down_votes":5,"body":"Ma quanti nabbi ci sono ancora in giro a fare ranked? No perch&eacute; in 3 ranked di placement ne ho incontrati ben 12! Tutti nel mio team...in 2 game degli afk addirittura. Quando si decider&agrave; la riot a reintrodurre il report per &quot;unskilled player&quot;?\r\nCredo che questo tipo di report serva, per far capire alla gente che non pu&ograve; giocare ranked e rovinare il gioco agli altri senza prima capire come si gioca.","replies":[{"poster":"RVN Trobugno","date":"2016-12-13T11:52:52.952+0000","up_votes":4,"down_votes":0,"body":"Io non sono un Pro ne niente, ma c'è qualcosa che voglio dire. \n1) Siamo tutti ignoranti in tutto. Ognuno ha sempre qualcosa da imparare e migliorare di se stessi sia in gioco che nella vita. Penserai che uno fa qualcosa di sbagliato quando forse sta cercando di fare qualcosa per salvare la partita.\n2) Hai ben presente che ti stai uccidendo da solo? Ho dato una controllata al tuo profilo. S4 Bronzo, S5 Bronzo, S6 Silver. Io è il primo anno che gioco, ma tu non pensi di star sbagliando qualcosa?","replies":[{"poster":"DoubleT","date":"2016-12-13T12:04:41.233+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Trobugno,realm=EUW,application-id=MJVj50Jw,discussion-id=wGTmLf8e,comment-id=0000,timestamp=2016-12-13T11:52:52.952+0000)\n>\n> Io non sono un Pro ne niente, ma c&#x27;è qualcosa che voglio dire. \n> 1) Siamo tutti ignoranti in tutto. Ognuno ha sempre qualcosa da imparare e migliorare di se stessi sia in gioco che nella vita. Penserai che uno fa qualcosa di sbagliato quando forse sta cercando di fare qualcosa per salvare la partita.\n> 2) Hai ben presente che ti stai uccidendo da solo? Ho dato una controllata al tuo profilo. S4 Bronzo, S5 Bronzo, S6 Silver. Io è il primo anno che gioco, ma tu non pensi di star sbagliando qualcosa?\n\n1) Certo hai ragione, ma se dopo tanti tentativi vedi che quello che fai non funziona, non ti devi ostinare a ripetere gli stessi errori.\n2) Non mi sto uccidendo da solo...hai visto i miei piazzamenti nelle scorse season ma hai non sai manco quante ranked ho fatto. Guarda: in S4 ho fatto solo le 10 di piazzamento e mi ha messo B2. In S5 ho fatto le 10 di piazzamento + 16 partite ed ho chiuso B3. La scorsa season è quella in cui ho avuto più tempo per giocare...ho fatto 300 ranked e da B5 sono arrivato a S5.\n\nPoi...ti consiglio di vedere le mie ultime 3 ranked e capirai che di certo il mio team non le ha perse per colpa mia.","replies":[{"poster":"oroora6","date":"2016-12-13T16:26:16.702+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DoubleT,realm=EUW,application-id=MJVj50Jw,discussion-id=wGTmLf8e,comment-id=00000000,timestamp=2016-12-13T12:04:41.233+0000)\n>\n> 1) Certo hai ragione, ma se dopo tanti tentativi vedi che quello che fai non funziona, non ti devi ostinare a ripetere gli stessi errori.\n> 2) Non mi sto uccidendo da solo...hai visto i miei piazzamenti nelle scorse season ma hai non sai manco quante ranked ho fatto. Guarda: in S4 ho fatto solo le 10 di piazzamento e mi ha messo B2. In S5 ho fatto le 10 di piazzamento + 16 partite ed ho chiuso B3. La scorsa season è quella in cui ho avuto più tempo per giocare...ho fatto 300 ranked e da B5 sono arrivato a S5.\n> \n> Poi...ti consiglio di vedere le mie ultime 3 ranked e capirai che di certo il mio team non le ha perse per colpa mia.\n\nbro, 300 ranked da B5 a S5 non è una gran cosa, e poi quasi mai ti troverai un team buono, se vuoi salire devi carryare","replies":[{"poster":"DoubleT","date":"2016-12-13T17:18:09.786+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=oroora6,realm=EUW,application-id=MJVj50Jw,discussion-id=wGTmLf8e,comment-id=000000000000,timestamp=2016-12-13T16:26:16.702+0000)\n>\n> bro, 300 ranked da B5 a S5 non è una gran cosa, e poi quasi mai ti troverai un team buono, se vuoi salire devi carryare\n\nMica ho detto che merito il challengiur XD so che non sono fortissimo...il fatto è che io cerco di carriare, ma anche se sei Faker, non puoi carriare i bot...contro altri giocatori.\nIl mito del \"se sei forte sali\" non esiste, se sei forte giochi bene, e basta...non è detto che vinci, perché se il resto del team non sa giocare, rimani solo tu che giochi bene e perdi.","replies":[]}]}]}]},{"poster":"DoubleT","date":"2016-12-13T14:08:56.928+0000","up_votes":1,"down_votes":2,"body":"E niente...quarta partita e quarta sconfitta di fila, ovviamente sempre nabbi in team, questo giro in 3 erano: top, mid e jungler...è dura giocare 3v5 ma davvero la riot dovrebbe migliorare il reset degli mmr...non è possibile che giocatori bravi riescano a carriare chi gioca senza mani e senza cervello.","replies":[{"poster":"BluCobalto92","date":"2016-12-13T15:25:23.328+0000","up_votes":1,"down_votes":0,"body":"Devo aver capito male....erano 3 nabbi nella tua squadra....quindi essendo in 5 meno 3 nabbi avete giocato 3 vs 5?\nOppure top mid e jungler erano quelli bravi?\nTe giocavi bot immagino","replies":[{"poster":"DoubleT","date":"2016-12-13T17:16:31.638+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BluCobalto92,realm=EUW,application-id=MJVj50Jw,discussion-id=wGTmLf8e,comment-id=00010000,timestamp=2016-12-13T15:25:23.328+0000)\n>\n> Devo aver capito male....erano 3 nabbi nella tua squadra....quindi essendo in 5 meno 3 nabbi avete giocato 3 vs 5?\n> Oppure top mid e jungler erano quelli bravi?\n> Te giocavi bot immagino\n\nLOL XD XD XD ho scritto male...2v5 ovviamente","replies":[{"poster":"Iridya","date":"2016-12-13T18:27:19.603+0000","up_votes":3,"down_votes":0,"body":"è sempre colpa degli altri non preoccuparti","replies":[{"poster":"DoubleT","date":"2016-12-13T20:01:41.746+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Iridya,realm=EUW,application-id=MJVj50Jw,discussion-id=wGTmLf8e,comment-id=0001000000000000,timestamp=2016-12-13T18:27:19.603+0000)\n>\n> è sempre colpa degli altri non preoccuparti\n\nHai visto le mie ranked prima di sparare questa scemenza? Non ho detto che è sempre colpa degli altri...ho detto che in queste partite (peraltro persa un'altra per colpa di bonobo ad una Syndra afk) la colpa certo non è mia! Che colpa ne ho se gli altri non sanno giocare? Che colpa ne ho se in 5 ranked perse su 6 ho trovato 1 afk a partita? Rispondimi...ma con argomenti non con frasi fatte! Dimmi come giochi se nel tuo team sono in 4 a feeddare? Come carry un team che non sa fightare? Come porti alla vittoria una squadra che non sa usare né le mani né il cervello? Come fai a comunicare con gente che non comprende i ping?\n\nTi rendi conto che i giocatori con cui ho giocato, giocano peggio dei bot?","replies":[{"poster":"Iridya","date":"2016-12-13T20:47:43.097+0000","up_votes":3,"down_votes":0,"body":"e tu vuoi farmi credere che in 6 partite la tua season su LoL è finita? vuoi farmi credere che nel team avversario non ci sono mai dei giocatori che giocano male? vuoi farmi credere che giocherai solo con gente che va afk? Ho avuto anche io, come milioni di altri utenti, loosing streaks (l'ultima proprio un paio di giorni fa - 8 loss di fila). E vuoi far credere a un forum intero che tu sei forte e tutto il mondo è nabbo? E su che c'è bisogno di fare una tragedia per una cavolo di loosing streak...ma dai^^\n\nMa che c'è bisogno di guardare le tue ranked? Sinceramente premere due bottoni con Leona e dire che gli altri non sanno giocare mi sembra un po' esagerato. Prenditi un cazzo di carry e fai come fa l'avversario no? Che problema c'è? Fai 10-0 in lane e vinci ...sbaglio?\n\nTi dico che se giochi bene ma non riesci a carriare sei si e no una o due divisioni sopra a quella che ti spetterebbe e prima o poi ci arriverai. Ma pensa a migliorare e a giocare le tue partite piuttosto che frignare sulle board","replies":[{"poster":"DoubleT","date":"2016-12-13T21:26:13.508+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Iridya,realm=EUW,application-id=MJVj50Jw,discussion-id=wGTmLf8e,comment-id=000100000000000000000000,timestamp=2016-12-13T20:47:43.097+0000)\n>\n> e tu vuoi farmi credere che in 6 partite la tua season su LoL è finita? vuoi farmi credere che nel team avversario non ci sono mai dei giocatori che giocano male? vuoi farmi credere che giocherai solo con gente che va afk? Ho avuto anche io, come milioni di altri utenti, loosing streaks (l&#x27;ultima proprio un paio di giorni fa - 8 loss di fila). E vuoi far credere a un forum intero che tu sei forte e tutto il mondo è nabbo? E su che c&#x27;è bisogno di fare una tragedia per una cavolo di loosing streak...ma dai^^\n> \n> Ma che c&#x27;è bisogno di guardare le tue ranked? Sinceramente premere due bottoni con Leona e dire che gli altri non sanno giocare mi sembra un po&#x27; esagerato. Prenditi un cazzo di carry e fai come fa l&#x27;avversario no? Che problema c&#x27;è? Fai 10-0 in lane e vinci ...sbaglio?\n> \n> Ti dico che se giochi bene ma non riesci a carriare sei si e no una o due divisioni sopra a quella che ti spetterebbe e prima o poi ci arriverai. Ma pensa a migliorare e a giocare le tue partite piuttosto che frignare sulle board\n\nNo no assolutamente, non credo che sia finita la mia season, dico solo che sto perdendo delle partite per colpa degli altri ed i dati mi danno ragione punto e basta, ancora adesso vengo dall'ennesima sconfitta per colpa di un team di ritardati mentali che non sa giocare a questo gioco. L'unica vittoria che ho fatto finora è stata grazie ad un team in cui avevo un Lucian scarso, ma almeno con gli altri del team ci si riusciva a coordinare. Tutte le mie sconfitte in queste ranked sono dovute al fatto che il team non mi ascolta, gioca alla cazzo di cane ed a me tocca perdere per colpa degli altri.","replies":[]}]}]}]}]}]},{"poster":"Apokàlypsis","date":"2016-12-13T17:22:28.854+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DoubleT,realm=EUW,application-id=MJVj50Jw,discussion-id=wGTmLf8e,comment-id=0001,timestamp=2016-12-13T14:08:56.928+0000)\n>\n> E niente...quarta partita e quarta sconfitta di fila, ovviamente sempre nabbi in team, questo giro in 3 erano: top, mid e jungler...è dura giocare 3v5 ma davvero la riot dovrebbe migliorare il reset degli mmr...non è possibile che giocatori bravi riescano a carriare chi gioca senza mani e senza cervello.\n\nDiciamo che pickare Leona contro Zyra non è il massimo... in ogni caso prima di criticare e basta dovresti anche chiederti che cosa avresti potuto fare per aiutare meglio la tua squadra. Ti senti soddisfatto della tua partita? Hai fatto errori? Quali? Come potresti migliorarli?\nHai un'intero anno per rankare ma se l'atteggiamento è questo non so quanto in alto potrai arrivare","replies":[{"poster":"DoubleT","date":"2016-12-13T17:43:47.765+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Queen of Balls,realm=EUW,application-id=MJVj50Jw,discussion-id=wGTmLf8e,comment-id=00010001,timestamp=2016-12-13T17:22:28.854+0000)\n>\n> Diciamo che pickare Leona contro Zyra non è il massimo... in ogni caso prima di criticare e basta dovresti anche chiederti che cosa avresti potuto fare per aiutare meglio la tua squadra. Ti senti soddisfatto della tua partita? Hai fatto errori? Quali? Come potresti migliorarli?\n> Hai un&#x27;intero anno per rankare ma se l&#x27;atteggiamento è questo non so quanto in alto potrai arrivare\n\nPickare Leona contro Zyra è la prassi dato che la countero pesantemente a partire dal 6 in poi, bisogna solo giocare safe, ma già a livello 3 puoi ingaggiare e killarla. Autocritica la faccio ad ogni partita, certo ho commesso errori che potevo evitare, ma non determinanti al fine della partita.\nAvrei potuto aiutare di più il team?...Come aiuti 3 lane ed il jungler contemporaneamente se questi feeddano? Se hackerassi certo che potrei aiutare tutti, ma sarebbe barare.\nMi sento soddisfatto della partita? In generale si, perché ogni partita che faccio vinco la lane insieme al mio adc, chiamo gli ss, wardo, pingo gli obiettivi...faccio tutto quello che è nel mio ruolo ed anche di più.\n\nRipeto...ho fatto 4 partite e le ho perse non tanto per i miei errori, che ci sono stati, ma perchè il resto del mio team non sa giocare...e basta guardare gli score per capirlo:\n\nGame 1\nPantheon 5/9   Nasus 15/6 = Pantheon muore 6 volte contro Nasus, e pure Lee Sin tilta e ci muore spesso, ma soprattutto, Lee non fa mai la scelta giusta, sempre lontano dagi obiettivi, sempre tempistiche sbagliate per le gank.\n\nGame 2\nDa dove cominciare?\nTeemo 3/10   Annie 14/5 = Teemo non sa giocare\nTrundle 0/4 = Trundle non sa giocare\nJinx 3/8 = Jinx non sa giocare\n\nGame 3\nOlaf 5/8   Trynda 15/7 = Olaf non sa giocare\nNautilus 3/7  Vi 6/7 = Nautilus non sa giocare\nSenza considerare che il mio team si mette a fare fight nelle strettoie della giungla...e loro hanno Brand, Vayne, Vi e Tryndamere...una teamcomp che può chiuderti e shottarti in poco tempo...ergo, il mio team non sa giocare.\n\nGame 4\nMaster Yi 8/13   Camille 12/9 = Master Yi non sa giocare, inoltre Master Yi è un pessimo pick in questo meta, ed ancora di più contro quella teamcomp\nKayle 12/11    Wukong 19/7 = Kayle non sa giocare, ha usato la sua ulti 4 volte in tutto il game, inoltre Kayle top non è u pick adatto in questo meta, e soprattutto contro questa teamcomp\nSyndra 3/9   Veigar 8/2 = Syndra non sa giocare\nCome vedi altre persone che non sanno giocare, che sbagliano anche a scegliere i campioni e fanno pick out of meta...sperando di vincere.\n\n\nOra dimmi...di fronte a questi dati...cosa avrei potuto fare? Ti rispondo io...Niente! Perché io posso provare a carriare gente che sa giocare, gente che non sa nemmeno come funziona questo gioco, è peggio dei bot.","replies":[{"poster":"Iridya","date":"2016-12-13T21:15:27.316+0000","up_votes":1,"down_votes":0,"body":"cmq se carri gente che sa giocare non è che ci voglia uno scienziato :D al massimo ti carriano loro xd","replies":[{"poster":"DoubleT","date":"2016-12-13T21:27:26.116+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Iridya,realm=EUW,application-id=MJVj50Jw,discussion-id=wGTmLf8e,comment-id=0001000100000000,timestamp=2016-12-13T21:15:27.316+0000)\n>\n> cmq se carri gente che sa giocare non è che ci voglia uno scienziato :D al massimo ti carriano loro xd\n\nLa gente che sa giocare non la devi carriare, semplicemente insieme riuscite a portare a casa la vittoria, oppure se perdete è solo per mero fattore di skill.","replies":[]}]}]}]}]}]}