{"poster":"DoubleT","date":"2017-02-16T15:39:49.167+0000","title":"Skillshots - suggerimento","subforum":"Discussioni generali","up_votes":3,"down_votes":3,"body":"Vorrei suggerire alla RIOT di mettere una sezione allenamento per imparare a conoscere e ad evitare gli skillshots they campioni. Perch&eacute; &egrave; inammissibile che ci siano giocatori che non sanno affrontare i vari: {{champion:53}} {{champion:25}} {{champion:420}} {{champion:103}} {{champion:32}} {{champion:126}} {{champion:157}} ecc...\r\nDovrebbe essere una prerogativa delle meccaniche base di questo gioco imparare cosa &egrave; uno skillshot e come evitarlo. Personalmente sono stanco di non trovare un giocatori che non sanno evitare un singolo skillshot.\r\nVengo flammato ripetutamente dai miei adc perch&eacute; LORO vengono grabbati da Blitz o si beccano una Q di Morgana o una Q di Yasuo...davvero non so che fare, ed il bello &egrave; che ci perdo le partite cos&igrave;...e dato che in bronzo non si possono bannare tutti i champ con skillshots allora sarebbe meglio mettere un&#039;arena dove ci si allena per evitarli.","replies":[{"poster":"wildfox99","date":"2017-02-16T18:37:45.064+0000","up_votes":3,"down_votes":0,"body":"> they campioni\n\ndimmi che lo hai fatto apposta '^^","replies":[{"poster":"DoubleT","date":"2017-02-17T08:07:16.078+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=wildfox99,realm=EUW,application-id=MJVj50Jw,discussion-id=m4TVyHM6,comment-id=0001,timestamp=2017-02-16T18:37:45.064+0000)\n>\n> dimmi che lo hai fatto apposta &#x27;^^\n\nLol non me ne sono accorto...scrivo troppo veloce XD","replies":[]}]},{"poster":"Jeanne dˆArc","date":"2017-02-16T15:57:41.935+0000","up_votes":1,"down_votes":1,"body":"Se in bronzo nessuno sa evitare gli skillshots, gioca tu quei champ così da vincere facile, no? Per il flame ti basta mutarli o reportarli a fine partita, non stare manco a crearti il problema. L'allenamento sarebbe un buon strumento per migliorarsi contro quei champ, ma prima o poi verrai comunque preso da una Q di Morgana o da una E di Ahri, perché non puoi evitarli tutti all'infinito.","replies":[{"poster":"DoubleT","date":"2017-02-16T16:22:56.977+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Chìtoge,realm=EUW,application-id=MJVj50Jw,discussion-id=m4TVyHM6,comment-id=0000,timestamp=2017-02-16T15:57:41.935+0000)\n>\n> Se in bronzo nessuno sa evitare gli skillshots, gioca tu quei champ così da vincere facile, no? Per il flame ti basta mutarli o reportarli a fine partita, non stare manco a crearti il problema. L&#x27;allenamento sarebbe un buon strumento per migliorarsi contro quei champ, ma prima o poi verrai comunque preso da una Q di Morgana o da una E di Ahri, perché non puoi evitarli tutti all&#x27;infinito.\n\nio li gioco e guarda caso nel team nemico tutti evitano i miei skillshots, e sanno come posizionarsi, quando li prendo il mio adc non segue mai, insomma, sono sfortunato.","replies":[{"poster":"IHateTheSmurfing","date":"2017-02-16T19:52:50.753+0000","up_votes":1,"down_votes":1,"body":"Forse perchè non sei buono ad usare gli skillshot?\nA quanto pare abbiamo un non challenger, che conosce il positiong e sa utilizzare gli skillshot.\nMi chiedo perchè non sali.","replies":[{"poster":"Sorcio84","date":"2017-02-16T21:18:48.790+0000","up_votes":1,"down_votes":1,"body":"Perchè è un gioco di squadra e se tu sei zac 9/0 e perdi perche due del tuo team feddano come maiali e si perdono per la mappa, tu non puoi farci niente.\n\nGioco di squadra, basta scaricare sempre la cosa sul singolo.","replies":[{"poster":"IHateTheSmurfing","date":"2017-02-16T21:58:25.801+0000","up_votes":1,"down_votes":0,"body":"Oh, si scusami, se uno non ci \"chiappa\" con gli skillshot è colpa del team...\nPLS, quanto mi dai se porto un account fuori dal bronzo, giocando solo supp?","replies":[{"poster":"Sorcio84","date":"2017-02-17T12:27:52.476+0000","up_votes":2,"down_votes":0,"body":"Sai quanti game in cui ero feddato e ho feddato i miei alleati, preso tutti i draghi, e poi sono andati tutti fuori posizione e sono schiattati e abbiamo perso ?\n\nUno da solo non può carriare tutti i game, servono minimo 2-3 persone che capiscano cosa fare per vincere.","replies":[{"poster":"IHateTheSmurfing","date":"2017-02-17T15:11:19.909+0000","up_votes":1,"down_votes":0,"body":"Quanto mi dai se gioco solo supp e faccio uscire un account fuori dal bronzo(posso portare questo account in b5 senza problemi, se il premio è consistente).","replies":[{"poster":"Sorcio84","date":"2017-02-17T20:47:12.408+0000","up_votes":1,"down_votes":0,"body":"non ti do niente, perchè non c'è niente da dimostrare, è così e basta.\nPoi mettere soldi così, in mezzo a un gioco competitivo , per ste cose è ridicolo.","replies":[]}]}]}]}]},{"poster":"DoubleT","date":"2017-02-17T08:16:11.097+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IHateTheSmurfing,realm=EUW,application-id=MJVj50Jw,discussion-id=m4TVyHM6,comment-id=000000000000,timestamp=2017-02-16T19:52:50.753+0000)\n>\n> Forse perchè non sei buono ad usare gli skillshot?\n> A quanto pare abbiamo un non challenger, che conosce il positiong e sa utilizzare gli skillshot.\n> Mi chiedo perchè non sali.\n\nPremesso che non ho detto che sbaglio tutti gli skillshot, né che ci prendo al 100% (le partite in cui sono deconcentrato le ho anche io) il mio discorso non verteva su di me, ma in generale sui giocatori che non conoscono gli skillshot. Io li conosco e so come evitarli, se parliamo poi degli skillshot dei support più usati...è facile giocando impararne la portata e come evitarli. Vuoi sapere quante Q di Morgana o di Blitzcrank mi becco in un game? 2! Sai quanti ne evito? Almeno 10! Mi pare che farsi colpire 2 su 12 da uno skillshot in partita non voglia dire solamente che l'altro è scarso, ma anche essere bravi a posizionarsi.\n\nOra vuoi sapere gli stessi giocatori quante volte prendono il mio adc? Su 10 tentativi almeno 8 volte! Quindi? Sono scarsi i miei avversari o sono scarsi i miei adc?","replies":[]}]}]}]}]}