{"poster":"spedy","date":"2015-05-27T02:12:53.218+0000","title":"idea campeon","subforum":"Creaciones de la comunidad","up_votes":1,"down_votes":0,"body":"tenia la idea de un campeon, una chica que tenga rol asesino y que use energia, no tiene nombre aun, pero tengo las habilidades.\n\npasiva: despues de usar 3 habilidades, su siguiente AA sera de rango y hara 15(+5 por nivel) mas un peque&ntilde;o porcentaje del da&ntilde;o que haya causado con esas 3 habilidades.\nQ: lanza una marca a un objetivo que causa 40/60/80/100/120 (+25% ap)  de da&ntilde;o magico a un objetivo. si este esta a 250 de rango o mas, puede saltar sobre el y le causa 45/70/95/120/145 (+45% ap). si esta a menos rango, lo golpea y salta hacia atras causandole el mismo da&ntilde;o.\nW: lanza un cuchillo arrojadizo hacia un punto. si golpea a un enemigo, este recibe 80/115/150/185/220 (+65% ap) de da&ntilde;o magico por 5 segundos y aplica una ralentizacion de 15/18/21/24/27% por 1,5s. si el enemigo golpeado tiene el 50% o menos de su vida total, la ralentizacion se multiplica por 1,5.\nE: lanza una lluvia de navajas a una zona circular, los enemigos en el area reciben 30/60/90/120/150 (+35% ap) de da&ntilde;o magico al que le caen encima. los enemigos que se muevan en la zona recibiran 15/28/41/54/67 (+15% ap) de da&ntilde;o magico por segundo.\nR: lanza muchas navajas desde diferentes direcciones a que se cruzen en un punto. cada navaja inflige 40/60/80(50%ap) a los enemigos que golpea, pero las siguientes que golpeen al mismo enemigo causan solo una parte del da&ntilde;o.\n\n\nno se hacer un lore bueno, pero es una guerrera de Kinkou y esta buscando a shen, akali y kennen para ayudarlos a mantener el equilibrio.\ny eso es todo, por favor comenten su opinion y denme criticas constructivas.","replies":[{"poster":"JACKY FANBOY","date":"2015-05-27T02:16:03.399+0000","up_votes":2,"down_votes":0,"body":"es como una mezcla entre {{champion:21}} y{{champion:84}}","replies":[{"poster":"spedy","date":"2015-05-27T03:08:10.332+0000","up_votes":1,"down_votes":0,"body":"la ulti es como la de talon, pero las dagas no la siguen a ella, si no que van recto al punto entre todas.","replies":[]}]},{"poster":"Baron Duki","date":"2015-05-28T01:37:32.823+0000","up_votes":1,"down_votes":0,"body":"Deberias cambiar la e o la r debido a que se parecen un monton. La r se parece a la de {{champion:55}} .\nPodrias cambiar la e por una trampa que realentize, la q quisiera preguntar por que cuando marca puede saltar si en la pasiva no esta.\n\nPD:  Me parece que Riot lo va a nerfear.\nPD2: pone los cooldowns, Riot no lo hara seguro.\n PD3: Aclara si es Cuerpo a Cuerpo o Rango por que sino no sirve (su siguiente AA sera de rango, Por que no le aumentas el alcance al basico? tipo wukong o echo?\nPD4 (Y ultima): Cuanto rango tendra las Habilidades, la r no parece muy convincente","replies":[{"poster":"spedy","date":"2015-05-28T12:26:51.748+0000","up_votes":1,"down_votes":0,"body":"la r esta mas basada en la ulti de talon\nriot probablemente ho vera esto xD\nes cuerpo a cuerpo, por eso la pasiva\nel rango no lo se, mas o menos el de la q de kata, zed o akali","replies":[]}]}]}