{"poster":"Hi iM NeB","date":"2018-07-23T13:31:19.009+0000","title":"JUNGLER CAN YOU HOLD MY LANE ??????????????","subforum":"Gameplay","up_votes":73,"down_votes":5,"body":"ME : Ask riot about this ? worth to get +4 ?\n\nhttps://imgur.com/a/TifaYOF","replies":[{"poster":"oortoomeebreesuu","date":"2018-07-23T14:27:38.527+0000","up_votes":42,"down_votes":5,"body":"quite possibly the worst change to the worst problem. I mean, really, this was their answer?","replies":[{"poster":"saltran","date":"2018-07-23T16:49:51.987+0000","up_votes":11,"down_votes":5,"body":"What answer else was out to gut funnel? I'm all ears.\n\nAs they said it wont last forever but funnel was needed to be adressed right now so I'm honestly glad that they done it.","replies":[{"poster":"iamsmurfing0101","date":"2018-07-23T21:04:57.451+0000","up_votes":9,"down_votes":5,"body":"Revert cancerous changes that led to players funneling in the first place its not hard to track the problem back.","replies":[{"poster":"Dream High","date":"2018-07-24T07:40:48.624+0000","up_votes":4,"down_votes":0,"body":"Which were? Funneling existed well before season 8 changes in 3vs3's. It only becoming popular recently it was possible befire changes like skuttle.","replies":[]}]},{"poster":"oortoomeebreesuu","date":"2018-07-23T17:27:21.390+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=saltran,realm=EUW,application-id=3ErqAdtq,discussion-id=1Wwd8hHj,comment-id=00030001,timestamp=2018-07-23T16:49:51.987+0000)\n>\n> What answer else was out to gut funnel? I&#x27;m all ears.\n> \n> As they said it wont last forever but funnel was needed to be adressed right now so I&#x27;m honestly glad that they done it.\n\nNever said the problem wasn't complex, but it should never have happened.\n\n* Junglers have less incentive to farm their camps than most iterations of the jungle thusfar. \n* Support champ kits by design are so busted that it's more valuable to have two of them than a free farmed / uncontested jungler and a decent farmed 1v2 mid laner. \n*  Funnel comps are running 2 gold items to get 2 sight stones, maximizing the efficiency of sharing a lane and establishing the vision dominance they sought to break up with removal of Tracker's Knife.\n* Kai'sa. \n\nIf you have to do a lot with very little, since they don't wanna disrupt the LC$...\n\nLimiting the second support, not the funneler, is the key to dismantling this non-sense. Slightly less ambient gold stream, and one support item per team, and I think the person sacrificing all their farm would be straight underpowered, rather than just going two relics and legit trolling the system. Now, you might say this invites people to troll in a different way by buying a supp item before someone else can, but I doubt it.\n\nAnd if you wanna cry about how you wouldn't be able to buy relic shield on bot morde and yasuo I will stab you","replies":[{"poster":"SanKakU","date":"2018-07-23T18:42:59.719+0000","up_votes":2,"down_votes":1,"body":"Someone might just troll the support though and buy it before they can.","replies":[{"poster":"oortoomeebreesuu","date":"2018-07-23T19:01:15.395+0000","up_votes":2,"down_votes":1,"body":"I preempted this reply in my post and yet you still had to say it.","replies":[{"poster":"Zero Skill Tank","date":"2018-07-23T20:21:20.626+0000","up_votes":3,"down_votes":0,"body":"Ofc someone had to say that, because 'I doubt it' is just not any answer to the problem.","replies":[]},{"poster":"SanKakU","date":"2018-07-23T19:17:29.224+0000","up_votes":2,"down_votes":2,"body":"You clearly seem to want the support to get trolled.","replies":[{"poster":"oortoomeebreesuu","date":"2018-07-24T01:19:19.142+0000","up_votes":2,"down_votes":0,"body":"That's an interesting way to interpret my post.","replies":[]}]}]}]}]},{"poster":"Light Burner","date":"2018-07-23T17:37:39.505+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=saltran,realm=EUW,application-id=3ErqAdtq,discussion-id=1Wwd8hHj,comment-id=00030001,timestamp=2018-07-23T16:49:51.987+0000)\n>\n> What answer else was out to gut funnel? I&#x27;m all ears.\n> \n> As they said it wont last forever but funnel was needed to be adressed right now so I&#x27;m honestly glad that they done it.\n\nRestraining people for doing well in the jungle is not the \"only\" answer to funneling. Its actually really annoying this is the route taken for so many things. Riot tends to punish players for doing well while helping players who do poorly. One of the most frusturating things to deal with. Examples include enemy champions who are doing poorly are worth less gold, players who are doing well give more gold, the new jungle change to stop funneling, the scaling exp you get from minions when behind to catch up. Its so aggravating to play in the scenario when you're ahead.","replies":[]},{"poster":"TheSingularity","date":"2018-07-23T20:20:00.318+0000","up_votes":6,"down_votes":3,"body":"Revert scuttle changes. The strategy arose immediately after the changes and likely due to the now stupid amount of gold offered by each crab.\nStick a support mid and then you can 2v1 every single crab depriving the enemy jungler of gold and gaining 250 gold every scuttle pair.\n\nShould been an instant revert instead of this mess","replies":[]},{"poster":"AIIan","date":"2018-07-24T05:13:58.746+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=saltran,realm=EUW,application-id=3ErqAdtq,discussion-id=1Wwd8hHj,comment-id=00030001,timestamp=2018-07-23T16:49:51.987+0000)\n>\n> What answer else was out to gut funnel? I&#x27;m all ears.\n> \n> As they said it wont last forever but funnel was needed to be adressed right now so I&#x27;m honestly glad that they done it.\n\nHow many people were impacted by the gold funelling strat ? Now how many people are impacted by this shit ? Yes, it needed fixing, but you don't fix one issue by fucking over everyone else. I would rather have gold funelling than this - especially when, after swearing to high heaven that they don't balance the game around pro-play and absolutely take the fact that 80% of their playerbase is bronze / silver to heart, they then just go and cater specifically to the masters / pros at the expenses of everyone else with those completely unintuitive changes (I mean, we all know they're lying throuh their teeth when they say that, but there's a difference between being a liar and an hypocrite).\n\nHad we held Riot to the kind of standard that any other big gaming company in the world is held to, this shit wouldn't fly. But somehow people still defend them like they're a small indie company. They're not - they make billion of dollars a year and yet they can't handle this ? I shouldn't be surprised - they couldn't handle the Clash, or handle the Solo Q backlash and their own promise to bring it back in a month and not FUCKING NEXT SEASON.\n\nThey keep shitting in the bed and people like you keep defending them, saying that we're lucky that Lord Riot even dared hear us out and fix their shit , so, eh, maybe it's bursting at the seams but at least they tried, amiright fellow board member ? Well fuck no. I expect better and you should expect better too !","replies":[{"poster":"My Waifu Vanilla","date":"2018-07-24T12:22:14.352+0000","up_votes":2,"down_votes":0,"body":"This change arguably affects less people. If you have the most gold in the game as the jungler you are ahead and thus going to have your jungle item finished long before this is going to actually be relevant. The ONLY people this affects are junglers that don't opt for a jungle item which are VERY few.\n\nAnother thing is if you are even ALLOWED to have the most gold on the team as the jungler without being like 3/0 then that breeds another problem since you have the least contested income by far.","replies":[]}]}]},{"poster":"jeanne mulaney","date":"2018-07-24T00:00:46.508+0000","up_votes":2,"down_votes":0,"body":"They have literally stated that this is not their permanent solution and that they don't like it either, but it's literally pretty much the only way to kill funneling quickly and completely.","replies":[{"poster":"Ulquiorra0123","date":"2018-07-24T04:23:19.370+0000","up_votes":1,"down_votes":0,"body":"Stop mid lane from giving shared experience, and stop relic shield from giving shared experience in mid lane. \n\nThe point here is that it was not the best way and not the only way to deal with it. What I just said was thought of on the spot as a solution to funneling in its current form without affecting any position at all. They had 2 months to think of a solution and implemented this. How much do you want to bet that my solution was never even considered and it was a last minute change as it became prominent in pro play xD","replies":[{"poster":"My Waifu Vanilla","date":"2018-07-24T12:23:54.402+0000","up_votes":1,"down_votes":0,"body":"Except that also doesn't address the issue. The original \"boosting strat\" was Kayle top with Yi jungle which.....as the role on Kayle implies....happened in top lane.","replies":[]}]}]},{"poster":"KoKoboto","date":"2018-07-23T16:13:09.961+0000","up_votes":5,"down_votes":4,"body":"Honestly funnelling wasn't even an issue. It was only a huge problem in NA because they're slow and only copy other regions. EU stomps against funnel comps with how they played.","replies":[]}]},{"poster":"Spicy Rice","date":"2018-07-23T15:21:10.944+0000","up_votes":6,"down_votes":4,"body":"It's almost as if you refused to complete your jungle item","replies":[{"poster":"Nøctμrne","date":"2018-07-23T15:59:45.435+0000","up_votes":16,"down_votes":0,"body":"Some junglers have a playstyle where its better to rush another item first, this forces everyone to finish the item. It pretty much prevents us from holding someone's lane entirely, and is removing strategy.","replies":[{"poster":"saltran","date":"2018-07-23T17:54:32.735+0000","up_votes":6,"down_votes":3,"body":"Which is imo good, is bullshit that the jng items are supposed to be good against a though jng minions and yet so many ad junglers just take {{item:3077}}  to clear faster.\n\nThis change forces the junglers to buy the jungle item? Nice, well done Rito.","replies":[{"poster":"BestPudgeNA","date":"2018-07-23T22:48:30.126+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=saltran,realm=EUW,application-id=3ErqAdtq,discussion-id=1Wwd8hHj,comment-id=000600000000,timestamp=2018-07-23T17:54:32.735+0000)\n>\n> Which is imo good, is bullshit that the jng items are supposed to be good against a though jng minions and yet so many ad junglers just take {{item:3077}}  to clear faster.\n> \n> This change forces the junglers to buy the jungle item? Nice, well done Rito.\n\n\"Jungle item is weak\"\n\"Nerfing the jungle item will make the game better\"\n\nPeople actually upvoted this","replies":[{"poster":"Bears Dont Care","date":"2018-07-23T23:03:30.611+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BestPudgeNA,realm=NA,application-id=3ErqAdtq,discussion-id=1Wwd8hHj,comment-id=0006000000000001,timestamp=2018-07-23T22:48:30.126+0000)\n>\n> &quot;Jungle item is weak&quot;\n> &quot;Nerfing the jungle item will make the game better&quot;\n> \n> People actually upvoted this\n\nYeah that made no sense to me either.\nThe method to fix funneling would have been to go back to theS7 jungle or s4 jungle.  If there is a concern about early jungle ganks atlevel 2, then a good method would be to reverse the nerfs on the turrets which have been stacked on them overtime. This would allow a laner a greater safety in the early game, and make early ganking less important.","replies":[]},{"poster":"Z3Sleeper","date":"2018-07-24T01:14:06.835+0000","up_votes":1,"down_votes":0,"body":"Or maybe just make the AD jungle item a tiamat item??? What AD jungler wouldn't want that?","replies":[{"poster":"Need Gold 4 Tent","date":"2018-07-24T15:55:59.279+0000","up_votes":1,"down_votes":0,"body":"I'm all in for that but it's not happening yet, and they're already gutting the machete>tiamat setup. Tryndamere doesn't even want any of the jungle items, he sells off machete later.","replies":[]}]}]},{"poster":"HaIlMonitor","date":"2018-07-23T20:47:55.486+0000","up_votes":1,"down_votes":0,"body":"Why limit a handful of junglers specifically though? I usually agree when it comes to cookie cutter style build for classes, but jungle is wonky because there are champs that cant keep up with out Taimat. I don't see why you would want a jungle meta that only has tanks and graves/kha/Xin?\n\nWell nvm you look  to be an adc main so that is your meta lol.","replies":[]}]}]},{"poster":"420 grams","date":"2018-07-23T17:08:32.830+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Spicy Rice,realm=NA,application-id=3ErqAdtq,discussion-id=1Wwd8hHj,comment-id=0006,timestamp=2018-07-23T15:21:10.944+0000)\n>\n> It&#x27;s almost as if you refused to complete your jungle item\n\nIt's not even 10 mins in. He didn't refuse to get a jungle item, he refused to hack to start the game with extra gold. ","replies":[{"poster":"My Waifu Vanilla","date":"2018-07-24T12:27:10.543+0000","up_votes":2,"down_votes":2,"body":"He has the most gold in the game already so I don't understand why this is an actual complaint. He's already WINNING. Also, that auto attack that killed the creep was a tiamat auto which means he spent 1250g on an item that wasn't the jungle item. He probably COULD have had his jungle item at this point, he just opted not to and wants to complain about it.","replies":[{"poster":"Bears Dont Care","date":"2018-07-24T15:42:10.073+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=My Waifu Vanilla,realm=NA,application-id=3ErqAdtq,discussion-id=1Wwd8hHj,comment-id=000600020000,timestamp=2018-07-24T12:27:10.543+0000)\n>\n> He has the most gold in the game already so I don&#x27;t understand why this is an actual complaint. He&#x27;s already WINNING. Also, that auto attack that killed the creep was a tiamat auto which means he spent 1250g on an item that wasn&#x27;t the jungle item. He probably COULD have had his jungle item at this point, he just opted not to and wants to complain about it.\n\nMany junglers need tiamat for clear speed such as warwick","replies":[]}]}]},{"poster":"Melledoneus","date":"2018-07-23T16:16:43.937+0000","up_votes":5,"down_votes":2,"body":"He's a rebel just for kicks, yeah.","replies":[]},{"poster":"BestPudgeNA","date":"2018-07-23T17:24:51.779+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Spicy Rice,realm=NA,application-id=3ErqAdtq,discussion-id=1Wwd8hHj,comment-id=0006,timestamp=2018-07-23T15:21:10.944+0000)\n>\n> It&#x27;s almost as if you refused to complete your jungle item\n\nI'll make sure to buy a 2600 gold item before my first back every time. Especially on {{champion:427}} cause the Jungle item is really good on him","replies":[{"poster":"My Waifu Vanilla","date":"2018-07-24T12:28:13.882+0000","up_votes":2,"down_votes":0,"body":"Ivern rarely kills lane creeps because he is one of the most inefficient champions at it so this change actually doesn't matter. Ivern also tends to not have the most gold in the game since he makes less gold from Krugs and the crab than every other jungler.","replies":[]}]},{"poster":"SugeMinPikk","date":"2018-07-23T17:37:35.938+0000","up_votes":1,"down_votes":0,"body":"There have historically been several junglers who delay their jungle item or just don't complete it. Most of them are laners first. Trynd and Jax are the first two to come to mind.","replies":[{"poster":"HaIlMonitor","date":"2018-07-23T20:49:26.100+0000","up_votes":1,"down_votes":0,"body":"There is also champs like Noc, WW, Rengar and probably more that do that.","replies":[]}]}]},{"poster":"D2T Undeeds","date":"2018-07-23T14:56:15.756+0000","up_votes":7,"down_votes":0,"body":">We'll be going with a temporary solution as a result that's pretty ugly on the intuitiveness/clarity side, with the intention of replacing it come preseason when it's more appropriate to make larger changes.","replies":[{"poster":"Hi iM NeB","date":"2018-07-23T15:04:17.189+0000","up_votes":8,"down_votes":2,"body":"you mean we have to play like this for 2 months more ? im waiting for a hot fix to it !","replies":[{"poster":"D2T Undeeds","date":"2018-07-23T15:06:51.564+0000","up_votes":2,"down_votes":1,"body":"I'm sure they're still working on it but I don't think there will be any big changes until we're past Worlds patch (September)","replies":[]}]}]},{"poster":"meowwow7","date":"2018-07-23T15:19:51.233+0000","up_votes":4,"down_votes":0,"body":"i wonder since junglers get 10 less gold from minion kills i wonder what happens if {{item:3302}} procs with them around or they proc it","replies":[{"poster":"Mokuto Bunshi","date":"2018-07-23T17:33:02.525+0000","up_votes":3,"down_votes":3,"body":"They cant proc it, riot made it so you cant have jungle and sup items remember?","replies":[{"poster":"SugeMinPikk","date":"2018-07-23T17:38:49.431+0000","up_votes":6,"down_votes":0,"body":"Pretty sure the question was about a support sharing gold with them","replies":[]}]}]},{"poster":"Leonerdo","date":"2018-07-24T01:27:51.781+0000","up_votes":3,"down_votes":0,"body":"The purpose/benefit of junglers holding lanes includes a lot more than gold. Half of the benefit is just wave-management (setting up the wave so the enemy loses minions or your ally gets more when he gets back). Besides, you only lose 60 gold per wave (about half of the gold) and none of the EXP. So holding a lane is still a good idea.","replies":[]},{"poster":"The Space Cowboy","date":"2018-07-23T15:26:30.033+0000","up_votes":4,"down_votes":1,"body":"Now I get to watch my jungle take farm when I’m next to him for +4. Probably while rushing infinity edge 1st item while running font of life and rampant growth. Newb traps abound.","replies":[]},{"poster":"Vlada Cut","date":"2018-07-23T14:22:54.553+0000","up_votes":1,"down_votes":2,"body":"Tbh such junglers are mostly extincted. The ones who are willing to sacrifise jg xp or ganks for deffending the 1st tower.","replies":[{"poster":"Hi iM NeB","date":"2018-07-23T15:17:05.623+0000","up_votes":4,"down_votes":1,"body":"there is no farm to do tho xD","replies":[]}]},{"poster":"Arammus","date":"2018-07-23T13:56:53.666+0000","up_votes":4,"down_votes":1,"body":"i wanted to make a thread like this. but i thought i shouldnt talk bad about riot. that usually goes wrong.","replies":[]},{"poster":"jeanne mulaney","date":"2018-07-24T00:01:42.269+0000","up_votes":2,"down_votes":0,"body":"All of the posts acting like this is the intended, permanent change. In the literal patch notes that introduced it Riot stated this isn't their preferred fix but the only one available in the moment.","replies":[]},{"poster":"KillerShim","date":"2018-07-23T22:18:30.779+0000","up_votes":2,"down_votes":0,"body":"Riot has the philosophy of completely ruining something else in order to fix something completely broken.","replies":[]},{"poster":"iamsmurfing0101","date":"2018-07-23T21:04:25.218+0000","up_votes":2,"down_votes":0,"body":"I will never hold a lane because of this change and i hope my team loses the game and thanks Riot after that :)","replies":[]},{"poster":"SugeMinPikk","date":"2018-07-23T17:35:31.859+0000","up_votes":3,"down_votes":1,"body":"Yeah if I see that debuff, I don't even bother breaking freezes or crashing waves. Fuck that. ","replies":[]},{"poster":"SanKakU","date":"2018-07-23T18:34:11.430+0000","up_votes":2,"down_votes":1,"body":"TBH, Kench probably has the minion sharing income item(unless they prefer a different one for some reason) and isn't full health right now so could be killing the minions instead of Jax. Would Jax get full bounty or reduced? Either way, it would prevent Kench from missing out on gold.","replies":[]}]}