{"poster":"leakinb","date":"2018-07-24T15:49:05.280+0000","title":"Zed is too easy to snowball: That's the problem","subforum":"Gameplay","up_votes":93,"down_votes":21,"body":"In my opinion, {{champion:238}}  is an easy champion but hard to master\r\nAfter you have learnt the basic mechanics (basic use of shadows, energy manipulation etc), you are good to go\r\nYou do NOT need high-skilled mechanics to kill anyone in lane, simple WEQ poke and then {{summoner:14}} or just level 6 all-in will secure a kill\r\nTbh, I believe that {{champion:238}} is just face-rolling champ. I don't feel being outplayed when being killed by level 6 Zed{{sticker:sg-ahri-3}} \r\n\r\nDisclaimer: I have played Zed in mid and I feel like he is just too dominant in laning and too easy to snowball throughout the game","replies":[{"poster":"BALDG1VEN BOOMER","date":"2018-07-24T15:59:38.877+0000","up_votes":46,"down_votes":4,"body":"I'd say it's damage creep.\n\nBack in season 4 Zed would've needed to commit a full combo and maybe ignite just to kill someone.\n\nThese days all he has to do is afk in a bush W E Q, AA. No ult, No Ignite.","replies":[{"poster":"Marothennan","date":"2018-07-24T17:21:05.595+0000","up_votes":21,"down_votes":0,"body":"> [{quoted}](name=205181825,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=0000,timestamp=2018-07-24T15:59:38.877+0000)\n>\n> I&#x27;d say it&#x27;s damage creep.\n> \n> Back in season 4 Zed would&#x27;ve needed to commit a full combo and maybe ignite just to kill someone.\n> \n> These days all he has to do is afk in a bush W E Q, AA. No ult, No Ignite.\n\nIt's funny, really. In season 4 and season 5 I defended Zed and said that he was ok. That's because back then he actually had to hit Q and work a little for his kills but nowadays with all the damage going around all he does is R > E > AA > Ignite if he's not sure you're dead and then Death Mark pops and you're fucked.","replies":[]},{"poster":"Naymliss","date":"2018-07-24T22:05:21.099+0000","up_votes":4,"down_votes":0,"body":"You could also qss his  ult IIRC, so that made it so if you positioned well and zed dove you you still had a chance to live.","replies":[]},{"poster":"Whisper87","date":"2018-07-24T16:29:49.031+0000","up_votes":2,"down_votes":5,"body":"Yeah, I think a nice low key nerf would be just to increase the CD on electrocute by like 5 seconds. I kind of feel like assassins are one and done mostly, so I think ideally it procs only once per skirmish or team fight, even in later stages of game.","replies":[{"poster":"Dog of Pavlov","date":"2018-07-24T18:12:10.636+0000","up_votes":5,"down_votes":0,"body":"Or lower the damage and decrease the cooldown... closer to thunderlords which (while it was a bit problematic on release) was quickly made a decent keystone for mages and assassins. Now it's obviously the best choice for assassins who aren't in combat as often and they get a MUCH higher burst rate.","replies":[{"poster":"Whisper87","date":"2018-07-24T18:15:51.066+0000","up_votes":2,"down_votes":1,"body":"The problem with that was that it was good for repeated, quick trades. While assassins kind of need to be one dimensionally built for all ins. They aren't supposed to be chip away at your hp champs. They are meant to 100-0 you. \n\nI guess my idea is that it's ok for an assassin to 100-0 someone, but they need to be reliant on having their ult and electrocute available to do it, and if they aren't doing well they will need ignite too.","replies":[{"poster":"CppL","date":"2018-07-26T12:16:56.492+0000","up_votes":1,"down_votes":0,"body":"No dude its not fine to 100-0 someone at lvl 2-3...","replies":[]}]}]}]}]},{"poster":"Fresh Kat NA","date":"2018-07-24T20:06:00.595+0000","up_votes":21,"down_votes":0,"body":"{{item:3147}} .. this item is a problem and make alot of champion busted.","replies":[{"poster":"Adrenalinn Rush","date":"2018-07-25T00:12:12.453+0000","up_votes":7,"down_votes":1,"body":"I could go 0/10 in lane but once i get duskblade on zed, wukong, kayn and khazix i can 1 shot anything.","replies":[]}]},{"poster":"Morgana Ultima","date":"2018-07-24T20:53:54.064+0000","up_votes":18,"down_votes":0,"body":"He doesn't need to snowball to win either.  \n\nI regularly destroy Zeds as Morgana even though Zed is Morgana's number 1 hard counter mid.  Zeds will go 0/4 in lane against me.  IT DOESNT MATTER.  They will still just hit R and get a kill on someone at some point and then it begins.  Zed can always one hit kill people and if he dies in the process it doesn't matter because he comes back slightly stronger next time. \n\nSo even if you dunk a Zed and he goes 0/4 the game will be a 4 v 4 because he'll always delete at least one of your teammates even if he dies.  This means that it is impossible to make him irrelevant no matter how hard you stomp him and if he suicide kills your biggest teammate then the enemy team has basically traded their worst player for our best player with zero counter play.  Literally zero counter play outside of getting stopwatch and GA. \n\nYet there are plenty of other champions who do jack shit for damage once they're behind.  Morgana is an example. Lux is an example.  Malzahar is an example. Ahri is an example.  Just about everyone who is a mage for example.","replies":[{"poster":"Smart Girl","date":"2018-07-26T06:15:36.905+0000","up_votes":2,"down_votes":0,"body":"oh hell yeah, you could destroy him in lane but all it takes is him roaming bot you can warn YOUR FUCKING BOT TO THE MOON THEY STILL WILL OVEREXTEND WITH NO FUCKING VISION AND IGNORE ALL YOUR DANGER PINGS... AND THEN SAY \"STOP PINGING ME\" AND THEN DIE BY ZED 2 SEC LATER, ZED GETS A DOUBLE KILL AND NOW HES UNSTOPPABLE ALL IT TAKES THAT'S ALL IT TAKES!!!! AND NOW HES CARRYING AND ALL THAT HARD FUCKING WORK YOU DID TO AVOID DEATH AND OUTPLAY HIM AND JUST NEUTRALIZE HIM IS DOWN THE DRAIN LIKE IT NEVER EVEN MATTERD!!!\n\nsorry it just happens all the time it takes nothing for him....that's why i ALWAYS ban him.","replies":[]}]},{"poster":"ΒIG IRON","date":"2018-07-24T16:45:45.816+0000","up_votes":6,"down_votes":40,"body":"LUL lvl7 talking about game balance wtf is this board? zed is easily on of the worst assasins right now if you deny this you are just delusional","replies":[{"poster":"leakinb","date":"2018-07-24T16:50:44.548+0000","up_votes":29,"down_votes":3,"body":"Yea, >50% WR with 15% PR and nearly 60% BR is the worst assassins right now\n\nSorry I am not a NA nor EU sever player. Don't judge me on that","replies":[]}]},{"poster":"oortoomeebreesuu","date":"2018-07-24T18:00:46.496+0000","up_votes":10,"down_votes":1,"body":"Zed's strength doesn't come from his all in, every assassin has a great all in\n\nWhat other assassins don't have is a free laning phase. Even if you could risk zoning Zed with a positive damage trade, he can Ezreal-style farm against you. Realistically speaking, you simply can't risk the damage reply, he can hit one out of twenty W-Q's and that will just eventually be enough to force you out of lane from a range that you can't contest.","replies":[{"poster":"leakinb","date":"2018-07-24T18:14:09.728+0000","up_votes":9,"down_votes":3,"body":"Yes that's part of my point\nThere is no sacrifice on spamming WEQs in lane as he is energy-based\nHitting one of them has lead to great advantage in laning\nAlso, his poke combo is low-risked, ranged and unlikely to miss due to slow from E\n\nHe can also farm well under his turret thanks to his passive","replies":[{"poster":"TacoComes","date":"2018-07-24T23:44:38.166+0000","up_votes":2,"down_votes":1,"body":"Cant u punish zed for Using his combo cuz its on cd? It depends on the matchup. I can play my champs which are, kat orianna lux and syndra and i would have no problem against him. I dont know what champs yall play but he doesnt feel too difficult to play around. (And im in Plat 2 fyi). \n\nIm pretty sure you could also punish him for trying to use q or e and when he doesnt have energy.\n\nBy level 6 You should have at least 30 bonus armor by then from components from zhonyas.\n\nPersonally I dont see the problem","replies":[]}]},{"poster":"HungryAngry2SPP","date":"2018-07-24T18:42:35.004+0000","up_votes":1,"down_votes":9,"body":"> [{quoted}](name=oortoomeebreesuu,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=0004,timestamp=2018-07-24T18:00:46.496+0000)\n> \n\"from a range that you can&#x27;t contest.\"\n\nYou say{{champion:101}} ?","replies":[{"poster":"Crescent Dusk","date":"2018-07-24T23:31:59.192+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=HungryAngry2SPP,realm=EUNE,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=00040001,timestamp=2018-07-24T18:42:35.004+0000)\n>\n> &quot;from a range that you can&amp;#x27;t contest.&quot;\n> \n> You say{{champion:101}} ?\n\nIf Zed starts 3 pots Xerath won't poke him out of lane and if you force the Xerath to land skills on you away from the wave then you plain outpush him with shuriken clears and by the time you hit lv6 whatever lead/priority he had vanishes.","replies":[]}]}]},{"poster":"Z3Sleeper","date":"2018-07-24T20:49:58.773+0000","up_votes":6,"down_votes":0,"body":"Yeah it takes relatively low skill to execute someone on Zed. But he also has the option of high skill usage that allows multiple kills in a single swoop.\n\nHe needs his base line assassination nerfed while keeping his ability to do multi-enemy outplays.\n\nPretty simple solution, his single target is the issue. Either touch on his passive, base AD or his ult damage.","replies":[]},{"poster":"DemainaNyx","date":"2018-07-24T20:33:47.772+0000","up_votes":6,"down_votes":0,"body":"While I agree that Zed is too easy in lane cause he can bully, all in, and safely farm, my biggest complaint with him is that it doesn't matter what you do to him, because he gets free stats from his ult.  \n\nOh, Zed somehow is 0/6, good job mid/jg.  Well, he just went bot and killed our 7/2 Draven.  Surely that means Zed deserves a Long Swords plus worth of AD because of 1 kill on top of all the other gold he got.  So, he basically just got 2 kills because of that.\n\nNot to mention most AP mids need to rush a seekers just to survive against AD assassins regardless of who's ahead in lane, but most AD assassins don't need to waste money in a hexdrinker even if the mid gets a ton of kills.","replies":[{"poster":"Crescent Dusk","date":"2018-07-24T23:33:48.331+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DemainaNyx,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=000d,timestamp=2018-07-24T20:33:47.772+0000)\n>\n> While I agree that Zed is too easy in lane cause he can bully, all in, and safely farm, my biggest complaint with him is that it doesn&#x27;t matter what you do to him, because he gets free stats from his ult.  \n> \n> Oh, Zed somehow is 0/6, good job mid/jg.  Well, he just went bot and killed our 7/2 Draven.  Surely that means Zed deserves a Long Swords plus worth of AD because of 1 kill on top of all the other gold he got.  So, he basically just got 2 kills because of that.\n> \n> Not to mention most AP mids need to rush a seekers just to survive against AD assassins regardless of who&#x27;s ahead in lane, but most AD assassins don&#x27;t need to waste money in a hexdrinker even if the mid gets a ton of kills.\n\nI've built tabis and even with that and even levels and CS Zed will still do metric shit tons of damage with ult to you on even as something as tanky as Garen.\n\nHe has way too much damage.","replies":[]}]},{"poster":"StoneSparrow","date":"2018-07-24T21:51:05.820+0000","up_votes":7,"down_votes":1,"body":"Hes just better than every champ early game, once he hits lv 3 if you dont have hourglass you have to play so safe. Its not fun to face so i ban him right now","replies":[]},{"poster":"LeftyRaydy","date":"2018-07-24T19:23:55.242+0000","up_votes":4,"down_votes":0,"body":"The problem is electrocute and his passive. if you are 3/4 health and he gets a combo off on you and ignite thats it its over, because of his passive as well. Then he just snowballs. This also is a cause of his other issue is there is no downside for zed to miss a combo in late he just has to wait and farm with Q or poke with Q. He doesnt have mana so its not punishing enough. Zed should have mana as well as all assassins. I mean Talon has mana and somewhat has to be aware of his resources, but Zed and AKali are the only ones (except Kata) who don't use mana. If zed had to use mana his builds would be different as he could not just stack damage and CD. \n\nThis is why a good zed will almost always win lane as he just has to be patient for the right time to attack.","replies":[]},{"poster":"StillHittinLicks","date":"2018-07-24T20:45:03.789+0000","up_votes":2,"down_votes":1,"body":"Isnt that every assassin champion though?...","replies":[{"poster":"Crescent Dusk","date":"2018-07-24T23:35:26.442+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=SmaqqDaddy,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=000f,timestamp=2018-07-24T20:45:03.789+0000)\n>\n> Isnt that every assassin champion though?...\n\nMost assassins need to get in your face to do damage. Zed doesn't have to take that risk and Assassins like Fizz/Ekko/Talon go out of mana if they spam their abilities for waveclear and harass unlike Zed who will never run out of resources.","replies":[]}]},{"poster":"borger","date":"2018-07-24T21:33:59.519+0000","up_votes":6,"down_votes":2,"body":"I say they just remove him from the game, it'd make the game a lot more enjoyable to play!","replies":[]},{"poster":"Raiyza","date":"2018-07-24T18:51:04.393+0000","up_votes":3,"down_votes":0,"body":"Part of it is Duskblade. \n\nUlt + One autoattack + EQ = kill","replies":[]},{"poster":"Anin777","date":"2018-07-24T18:51:49.758+0000","up_votes":3,"down_votes":1,"body":"It's not that Zed is easy to snowball, it's that dmg is too high. Back then you had to hit 3 Qs, Ignite, BoTRK active just to get a kill. But now with everyone and everything doing 10 billion dmg, everyone is easy to snowball.","replies":[]},{"poster":"Hyquiem","date":"2018-07-27T20:30:42.276+0000","up_votes":1,"down_votes":0,"body":"Oooooo JUST GIVE ME THE S5 ZED AGAIN!! Revert Zed god dam it.","replies":[]},{"poster":"KekKaiax","date":"2018-07-25T15:15:18.075+0000","up_votes":1,"down_votes":0,"body":"Zed is a lane bully and an assassin. Same with Darius, Renekton, and Pantheon, they do atrocious damage during lane phase but scale off into late game.","replies":[{"poster":"Crescent Dusk","date":"2018-07-26T04:46:45.191+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KekKaiax,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=001c,timestamp=2018-07-25T15:15:18.075+0000)\n>\n> Zed is a lane bully and an assassin. Same with Darius, Renekton, and Pantheon, they do atrocious damage during lane phase but scale off into late game.\n\nThat's pretty much a lie about scaling. Especially when most games don't go beyond 25 minutes and if you can set your opponent behind early it doesn't matter because you'll be free to split push unchallenged and 1v1 anything that isn't a fed Camille/Fiora/Garen/Yasuo/Tryndamere/Riven.\n\nZed outscales Talon by a mile to begin with, so calling him a champion with fall off is pushing exaggeration. Full build lv18 he still 3 shots most mages, assassins, ADC's, and non-tank junglers.","replies":[{"poster":"KekKaiax","date":"2018-07-27T07:29:32.198+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Crescent Dusk,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=001c0001,timestamp=2018-07-26T04:46:45.191+0000)\n>\n> That&#x27;s pretty much a lie about scaling. Especially when most games don&#x27;t go beyond 25 minutes and if you can set your opponent behind early it doesn&#x27;t matter because you&#x27;ll be free to split push unchallenged and 1v1 anything that isn&#x27;t a fed Camille/Fiora/Garen/Yasuo/Tryndamere/Riven.\n> \n> Zed outscales Talon by a mile to begin with, so calling him a champion with fall off is pushing exaggeration. Full build lv18 he still 3 shots most mages, assassins, ADC&#x27;s, and non-tank junglers.\n\nOk, I’ll go through this piece by piece. \n\nhttps://www.leagueofgraphs.com/rankings/game-durations \nThis shows that most league games averages around 25+ minutes.\n\nA behind zed will not be able to split push effective effectively. If he is behind, he cannot kill anyone that has more gold and items than him if they play smart.\n\nOk, let’s assume it’s late game and everyone is at max items and level. (which is what I hope you’re assuming)\n\nA mage would have already built zhonyas full item build which would make Zed’s burst gone. After that, he could get hard cc’d and get shutdown immediately or go back to his shadow and has no burst potential after that. \n\nAssassin vs Assassin is a skill matchup, one or another gets blown up. \n\nAlmost all ADC’s are fucked by assassins, unless they have a hard cc and peel comp.","replies":[{"poster":"Crescent Dusk","date":"2018-07-27T15:30:09.769+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KekKaiax,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=001c00010000,timestamp=2018-07-27T07:29:32.198+0000)\n>\n> Ok, I’ll go through this piece by piece. \n> \n> https://www.leagueofgraphs.com/rankings/game-durations \n> This shows that most league games averages around 25+ minutes.\n> \n> A behind zed will not be able to split push effective effectively. If he is behind, he cannot kill anyone that has more gold and items than him if they play smart.\n> \n> Ok, let’s assume it’s late game and everyone is at max items and level. (which is what I hope you’re assuming)\n> \n> A mage would have already built zhonyas full item build which would make Zed’s burst gone. After that, he could get hard cc’d and get shutdown immediately or go back to his shadow and has no burst potential after that. \n> \n> Assassin vs Assassin is a skill matchup, one or another gets blown up. \n> \n> Almost all ADC’s are fucked by assassins, unless they have a hard cc and peel comp.\n\nZhonyas does jackshit against Zed except delay the inevitable. By late game he does not need the ult to kill any mage as his WEQ alone can kill most mages, so the mage either eats the WEQ damage or Zhonyas eat and then eats the ult.\n\nSkill match up against other assassins my ass. He has ranged burst and should always get the first strike which is a massive lead in any assassin match up, especially when his ult allows him to reliably dodge a part of another assassin's combo on top of having 2 shadows to juke skills with which is not something most other assassins have.\n\nZed is never behind anyways because he's straight up designed to succeed in lane unless I go the douchebag route and counterpick a Garen onto him midlane.","replies":[{"poster":"KekKaiax","date":"2018-07-27T16:34:16.095+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Crescent Dusk,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=001c000100000000,timestamp=2018-07-27T15:30:09.769+0000)\n>\n> Zhonyas does jackshit against Zed except delay the inevitable. By late game he does not need the ult to kill any mage as his WEQ alone can kill most mages, so the mage either eats the WEQ damage or Zhonyas eat and then eats the ult.\n> \n> Skill match up against other assassins my ass. He has ranged burst and should always get the first strike which is a massive lead in any assassin match up, especially when his ult allows him to reliably dodge a part of another assassin&#x27;s combo on top of having 2 shadows to juke skills with which is not something most other assassins have.\n> \n> Zed is never behind anyways because he&#x27;s straight up designed to succeed in lane unless I go the douchebag route and counterpick a Garen onto him midlane.\n\nIn practice tool, zed's whole combo wqe (at level 18, full item build), it only does 1017 dmg and I've hit everything. This is against a practice dummy with 100 armor and 100 magic resist. Ryze basic armor at level 18 is 72.6. Assuming that he builds zhonyas and other mage health items, he should be able to tank the wqe combo without being bursted or one shot. If zed chooses to go to that shadow, almost all mages have a CC to stop him to get any further. \n \nLet's take talon vs zed matchup as an example. At level 1 and 2, you have a wave clear and more burst potential then Zed does (assuming that you level up q and w). At level 2, you should q, w, auto, to get your passive and electrocute proc'd. At level 3, you should look for a early gank into one of your side lanes because of your heavy roam presence. At level 6, you ult right after Zed ults so he doesn't know where you are. \n\nZed can be behind if you can outplay him. If you're low elo then he is the best low elo stomper, if you do know how to play him.","replies":[{"poster":"Crescent Dusk","date":"2018-07-27T17:05:28.847+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KekKaiax,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=001c0001000000000000,timestamp=2018-07-27T16:34:16.095+0000)\n>\n> In practice tool, zed&#x27;s whole combo wqe (at level 18, full item build), it only does 1017 dmg and I&#x27;ve hit everything. This is against a practice dummy with 100 armor and 100 magic resist. Ryze basic armor at level 18 is 72.6. Assuming that he builds zhonyas and other mage health items, he should be able to tank the wqe combo without being bursted or one shot. If zed chooses to go to that shadow, almost all mages have a CC to stop him to get any further. \n>  \n> Let&#x27;s take talon vs zed matchup as an example. At level 1 and 2, you have a wave clear and more burst potential then Zed does (assuming that you level up q and w). At level 2, you should q, w, auto, to get your passive and electrocute proc&#x27;d. At level 3, you should look for a early gank into one of your side lanes because of your heavy roam presence. At level 6, you ult right after Zed ults so he doesn&#x27;t know where you are. \n> \n> Zed can be behind if you can outplay him. If you&#x27;re low elo then he is the best low elo stomper, if you do know how to play him.\n\nZed with 3 items isn't just doing 1017 damage, that's a load of horsecrap, and you're probably not including electrocute or ignite.\n\nThe Talon example is terrible as well because no assassin should be getting in Talon's Q range at lv2, especially Zed who can last hit from complete safety with Q. There's like virtually zero reason for Zed to ever be in melee with Talon unless you've landed a full WEQ and procced electrocute and can just finish him with an auto+ignite.\n\nIf you roam at 3 as Talon it's a waste of time as by that time you don't even have boots so by the time you get to the side lane the Zed has pinged you missing for a while and in the process of you getting back to your midlane are way behind in xp soak.\n\nIt doesn't matter that the Zed can't see you after you ult after his because the E is point blank and that's all he needs for the mark to finish you off as he would never ult you unless he landed a WEQ combo to erase half your health.\n\nTalon's combo is entirely telegraphed and Zed has way more tools to kite out his passive procs. If any champion were harder for Zed it would definitely be Ekko or Fizz, and Fizz has been gutted by the rework in terms of burst.","replies":[{"poster":"KekKaiax","date":"2018-07-27T20:28:16.396+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Crescent Dusk,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=001c00010000000000000000,timestamp=2018-07-27T17:05:28.847+0000)\n>\n> Zed with 3 items isn&#x27;t just doing 1017 damage, that&#x27;s a load of horsecrap, and you&#x27;re probably not including electrocute or ignite.\n> \n> The Talon example is terrible as well because no assassin should be getting in Talon&#x27;s Q range at lv2, especially Zed who can last hit from complete safety with Q. There&#x27;s like virtually zero reason for Zed to ever be in melee with Talon unless you&#x27;ve landed a full WEQ and procced electrocute and can just finish him with an auto+ignite.\n> \n> If you roam at 3 as Talon it&#x27;s a waste of time as by that time you don&#x27;t even have boots so by the time you get to the side lane the Zed has pinged you missing for a while and in the process of you getting back to your midlane are way behind in xp soak.\n> \n> It doesn&#x27;t matter that the Zed can&#x27;t see you after you ult after his because the E is point blank and that&#x27;s all he needs for the mark to finish you off as he would never ult you unless he landed a WEQ combo to erase half your health.\n> \n> Talon&#x27;s combo is entirely telegraphed and Zed has way more tools to kite out his passive procs. If any champion were harder for Zed it would definitely be Ekko or Fizz, and Fizz has been gutted by the rework in terms of burst.\n\nI've landed everything with the electrocute rune without the ignite damage and it results to 1017 damage. You can go see for yourself.\n\nZed q's cooldown at level 1 is 6 seconds. Every 6 second, zed is able to manage to even 1 or 2 cs with his q. If you managed to zone Zed away from the minions, that's even better since now you have a gold advantage. \n\nYou push lane and you go roam. If Zed pings you MIA, you're making enemy bot/top lane play more safe and missing out on CS. You have roaming presence such as Quinn and Aurelion Sol. You don't even have to do an early gank, all you have to do is be missing from lane and you'll be creating a presence.  \n\nAt level 6, a zed cannot kill you in one combo with just ult e combo if you're full health. If a zed manages to hit both shurikens on you, that is your fault for not being able to dodge. His w is a 22 second at rank 1. If he uses it and he combos you, you should be able to finish him off. \n\nIf you would like to talk more, just add me.","replies":[]}]}]}]}]}]},{"poster":"Daddy Ants","date":"2018-07-25T16:24:03.549+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KekKaiax,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=001c,timestamp=2018-07-25T15:15:18.075+0000)\n>\n> Zed is a lane bully and an assassin. Same with Darius, Renekton, and Pantheon, they do atrocious damage during lane phase but scale off into late game.\n\nDid you mean \"fall off\".\n\nBecause Darius, Pantheon and Renekton fall off like a rock late game.\n\nZed falls off, sure but not by much. ~30 second cooldown ult late game lul.","replies":[{"poster":"KekKaiax","date":"2018-07-27T07:33:58.480+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Antenora,realm=EUW,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=001c0000,timestamp=2018-07-25T16:24:03.549+0000)\n>\n> Did you mean &quot;fall off&quot;.\n> \n> Because Darius, Pantheon and Renekton fall off like a rock late game.\n> \n> Zed falls off, sure but not by much. ~30 second cooldown ult late game lul.\n\nIn late game, mages and adcs have more aoe and damage potential. Zed can only burst one person and might not be able to if the person is building a zhonyas or have hard cc. At late game, people have more resistances and armor to kill him. (etc. locket, knights vow, redemption, etc)","replies":[]}]}]},{"poster":"BrightWîngs","date":"2018-07-25T14:46:41.791+0000","up_votes":1,"down_votes":0,"body":"people complain about {{champion:238}} but forget about {{champion:105}} {{champion:7}} {{champion:107}} {{champion:91}} these champs are all around FAR easier to play and just as effective im no Zed player but i know a champ that take a little bit of a brain when I see one if we are going to be fair snowballing is an all round issue right now","replies":[{"poster":"leakinb","date":"2018-07-27T07:00:37.747+0000","up_votes":1,"down_votes":1,"body":"Tbh, i think they really need no brain to kill squishies in this meta","replies":[{"poster":"BrightWîngs","date":"2018-07-27T15:46:26.536+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=leakinb,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=001b0000,timestamp=2018-07-27T07:00:37.747+0000)\n>\n> Tbh, i think they really need no brain to kill squishies in this meta\n\nNo one does it's called damage creep but Zed as a champion does take skill to play but when you give him too much damage it doesn't matter this applies to everybody NOT JUST Zed","replies":[]}]}]},{"poster":"Shablagoo","date":"2018-07-24T19:39:19.966+0000","up_votes":1,"down_votes":3,"body":"Playing against zed feels like playing against almost every mage in the laning phase as a melee. Getting chucked for my hp every time i go to hit a minion once or always giving free poke after one trade. Zed removes the advatange most mages get as a freebie in lane against most assassins and because of that mages feel frustrated which is understandable but not reasonable.","replies":[{"poster":"Crescent Dusk","date":"2018-07-24T23:47:11.304+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Shablagoo,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=000a,timestamp=2018-07-24T19:39:19.966+0000)\n>\n> Playing against zed feels like playing against almost every mage in the laning phase as a melee. Getting chucked for my hp every time i go to hit a minion once or always giving free poke after one trade. Zed removes the advatange most mages get as a freebie in lane against most assassins and because of that mages feel frustrated which is understandable but not reasonable.\n\nThat's mostly the experience of Fizz or Katarina, though.\n\nBoth Talon and Ekko have really good waveclear with their range abilities and can trade well if they dodge a mage skillshot. Yeah, playing against Karma or Lux will always be frustrating, but you know you roam better than they do and if you catch them in jungle trying to counter your roam away from the safety of their turret they are dead.\n\nZed gets all the perks of being an assassin in 1v1 and then more with safe range, and he scales way better than a Talon or Ekko in damage to boot.\n\nDeath Mark's damage storage is ridiculously OP with the current state of damage.","replies":[{"poster":"Shablagoo","date":"2018-07-25T10:02:26.663+0000","up_votes":1,"down_votes":0,"body":"Are you talking about zed or other assassins? And it isnt like you cant roam too? Isnt that why TF is so successful, same with Sol? Zed was designed to  beat mages thats they his kit is the way it is, because of that people blow him out of proportion when he is decent and even when he is weak. I have trouble against counters too, but my friend thats how the game works. When people buy lots of armor as rengar and survive my burst I am screwed, I have to think of away around it. Also Zed scales better then talon or ekko but not better then mages cmon dont lie now.","replies":[{"poster":"Crescent Dusk","date":"2018-07-25T15:30:12.671+0000","up_votes":1,"down_votes":1,"body":"What is this comment? I was comparing Zed having a totally safe if not oppressive lane compared to Fizz and Katarina who have terrible laning phases, or even the likes of Ekko and Talon who have to risk mage harass to farm CS whereas Zed gets easymode resourceless CS thanks to energy and passive on top of an interminable ability to poke without much cost for failing.","replies":[{"poster":"Shablagoo","date":"2018-07-25T17:38:26.484+0000","up_votes":1,"down_votes":0,"body":"But again, like Talon and Ekko, for mages like Sol and TF they also get harass, poke, and roaming abilites which are better then assassins. Is that not also unfair? And how is Zed not immune to poke? Just because he has a q and e doesnt mean he will never go in close to cs, he still has the chance of getting harass and without w he is even more susceptible. \n\nAnd of course Zed has a good laning phase against mages, he counters them. But does Zed have a good laning phase against Malz? No he gets rekt by him, its the match up you just dont like playng against Zed and again blow him out of proportion","replies":[{"poster":"Crescent Dusk","date":"2018-07-26T00:37:16.129+0000","up_votes":1,"down_votes":0,"body":"Sol and TF have way inferior burst, Sol straight up loses most 1v1's in mid, which is why he's just a push and roam champ. TF has an atrocious laning phase, once again made up for his roaming potential. Ekko and Talon are much better 1v1 champions and have roaming potential on top. Not sure why you're bringing up Sol and TF however when both are hardcountered by Zed and when the comment has always been about Zed being way safer than the other assassins with better damage scaling on top. Stop with the bullshit tangents about mages when the comparison has always been between Zed and the other assassins.\n\nYes, Zed can get poked, but he usually goes resolve and 3 pots so the poke is trivialized and by lv3 no mage will try to poke him because all it takes is one WE without even landing a Q and he already comes out with kill potential with electrocute and ignite if he ports in.\n\nHe's like the Vladimir of assassins, way too safe compared to the other assassins who actually have to risk harass to CS and have a bad early laning phase pre-6 to compensate for their strength post 6 in lane. If Ekko and Talon want to avoid harass, they go out of mana in no time; this is an issue Zed never faces.","replies":[{"poster":"Shablagoo","date":"2018-07-26T03:44:54.873+0000","up_votes":1,"down_votes":0,"body":"I mistook the roaming aspect and thought that you meant that all assassins are better roamers which is not true. But the comparison was actually always about how zed is compared to mages that was my original post, the idea is playing against zed as a mage feels like playing against a mages as an assassin, you have the easy ability to be poked out of lane. When zed is in lane vs other mages they lose this advantage when they expect to win the melee match up but not against zed he can poke just as well as most mages. And mages for some reason think its unfair, when like ive said before,  he is designed to counter mages. \n\nAnd of course he has to go resolve because again even if he has mobility he is still melee so he has the disadvantage of risking dmg when getting close or not having mobility to get out. Its like w having a 20 second cd mains nothing, there is no way to take advantage of it?  \n\nhttps://www.youtube.com/watch?v=ELWIaSiWLGo&t=2s I feel this video needs to be posted for everyone because people just seem to blow his power way out of proportion, Zhonyas stops his ult, you can dodge his q, if he missed them he will lose. And if you constantly push and play better then zed you will win. He for sure doesnt scale better then ekko just because of his ult, have you really played ekko, talon is one thing but not ekko.","replies":[{"poster":"Crescent Dusk","date":"2018-07-26T04:26:53.120+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shablagoo,realm=NA,application-id=3ErqAdtq,discussion-id=VnOY99Gd,comment-id=000a000000000000000000000000,timestamp=2018-07-26T03:44:54.873+0000)\n>\n> I mistook the roaming aspect and thought that you meant that all assassins are better roamers which is not true. But the comparison was actually always about how zed is compared to mages that was my original post, the idea is playing against zed as a mage feels like playing against a mages as an assassin, you have the easy ability to be poked out of lane. When zed is in lane vs other mages they lose this advantage when they expect to win the melee match up but not against zed he can poke just as well as most mages. And mages for some reason think its unfair, when like ive said before,  he is designed to counter mages. \n> \n> And of course he has to go resolve because again even if he has mobility he is still melee so he has the disadvantage of risking dmg when getting close or not having mobility to get out. Its like w having a 20 second cd mains nothing, there is no way to take advantage of it?  \n> \n> https://www.youtube.com/watch?v=ELWIaSiWLGo&amp;t=2s I feel this video needs to be posted for everyone because people just seem to blow his power way out of proportion, Zhonyas stops his ult, you can dodge his q, if he missed them he will lose. And if you constantly push and play better then zed you will win. He for sure doesnt scale better then ekko just because of his ult, have you really played ekko, talon is one thing but not ekko.\n\nEkko is an AP assassin and magic resist has nothing remotely the equivalent of lethality and true damage conversions, so even woth void staff he is not doing damage to someone who has built MR anywhere close to what talon or zed do with lethality and runaan's items.\n\nFurthermore, Zed is not only good against mages. He's good into other assassins period. He beats Talon handily as his shadows and ult can pretty much allow him to deny Talon ever proccing his passive before the Zed bursts the Talon down.\n\nZed shits on Katarina, shits on Talon, shits on Ekko, and because his early lane is stronger than Fizz, who should be countering Zed with his E, Zed handily snowballs on Fizz as well.\n\nThe only types that do remotely well against Zed are aftershock Galio in early game before Zed builds lethality, and Garen/Malphite/Sion mid.","replies":[{"poster":"Shablagoo","date":"2018-07-27T00:19:25.134+0000","up_votes":1,"down_votes":0,"body":"So you think that lethality is better? Are you basing this completely on duskblade? You understand that with lethality as it is you can never get true dmg, even with all three lethality items. Not only that Magic pen doesnt even scale, and in most games lethality never reaches the max amount unless the assassins is way ahead and at that point why, i dont think you can blame the champion for the player doing well.  Also lethality scaling doesnt make assassin have late game, ekko was originally a late game champion to begin with his kit naturally scales.\n\nAlso Talon does not lose to Zed, it is completely left to the player. In fact I can't find any evidence that Zed beats Talon on all the sites they are even, http://na.op.gg/champion/zed/statistics/mid Says here too that Katarina beats zed. The only assassins zed beats are LB, Ekko and Fizz, so idk where you got the bases of you arguments.","replies":[]}]}]}]}]}]}]}]}]}]}