{"poster":"Oinegue","date":"2015-07-02T07:00:17.029+0000","title":"Riot Trollosa","subforum":"Discussioni generali","up_votes":3,"down_votes":0,"body":"Oggi apro il client di lol, fremendo alla sola idea della miriade di champion che desideravo ottenere e BAM!\r\n\r\nEcco che mi arriva quel cesso a pedali di Urgot.\r\n\r\nLa cosa pi&ugrave; terribile &egrave; che &egrave; presente solo il tasto &quot;Fantastico!&quot; quando avrei voluto ritornarglielo indietro!\r\n\r\nMa che sfiga {{champion:32}}","replies":[{"poster":"Nibbio Bianco","date":"2015-07-02T07:08:30.535+0000","up_votes":8,"down_votes":1,"body":"Urgot is love. Urgot is life.","replies":[{"poster":"Oinegue","date":"2015-07-02T07:18:12.261+0000","up_votes":2,"down_votes":0,"body":"Mi stai dicendo che dovrei farmi penetrare da lui? Ma non ha più il corpo dalla vita in giù! ç_ç","replies":[{"poster":"Nibbio Bianco","date":"2015-07-02T07:20:20.393+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Oinegue,realm=EUW,application-id=MJVj50Jw,discussion-id=NBMHzhPJ,comment-id=00000000,timestamp=2015-07-02T07:18:12.261+0000)\n>\n> Mi stai dicendo che dovrei farmi penetrare da lui? Ma non ha più il corpo dalla vita in giù! ç_ç\n\nNo, però da ora in poi potrai ammirare il suo monocapezzolo ogni volta che ti pare.","replies":[{"poster":"Oinegue","date":"2015-07-02T07:21:43.379+0000","up_votes":1,"down_votes":0,"body":"Ma se sfruttassi questo topic per chiederti qualche suggerimento almeno per usarlo bene?","replies":[{"poster":"Nibbio Bianco","date":"2015-07-02T08:00:52.206+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Oinegue,realm=EUW,application-id=MJVj50Jw,discussion-id=NBMHzhPJ,comment-id=0000000000000000,timestamp=2015-07-02T07:21:43.379+0000)\n>\n> Ma se sfruttassi questo topic per chiederti qualche suggerimento almeno per usarlo bene?\n\nmid/adc/top, queste sono le sue lane. build {{item:3042}} {{item:3071}} {{item:3035}} {{item:3110}} {{item:3026}} {{item:3268}} \n\nsummoner spells {{summoner:4}} {{summoner:12}}  o {{summoner:4}} {{summoner:6}} \n\nabilità: Q-E-Q-W-Q-R-Q-W-Q-W-R-W-W-E-E-R-E-E\n\nstarta di {{item:2041}} {{item:2003}} x2 + {{item:2004}} o {{item:1036}} {{item:2003}} x2 {{item:2004}}  \nNella lane farma bene grazie alla possibilità di usare anche la Q per farmare, ma senza prima avere la tear, il tuo primo oggetto, cerca di utilizzare il meno possibile la Q sui minion, Non ti conviene utilizzare la Q prima di avergli dato almeno due punti, perché ha come danni 10+70% ad, che sarebbe circa il tuo attacco base, fai veramente pochi danni se non ce l'hai almeno al 2. Non cercare di fare bullismo fino al primo recall, quando avrai la tear, per ora cerca solo di farmare. Al primo recall prendi la tear, torni nella lane, prendi l'avversario con la E, attivi la w, premi q tre volte sul tuo avversario, perde il 60% degli hp, ed è costretto a recallare, tu continui a farmare, lui torna, si becca di nuovo la combo di urgot e inizia a piangere, visto che non può cercare di contrastarti a causa della passiva OP di Urgot. Se pensi di poter fare una kill flash/ghost ed free kills. Se cercano di gankarti? flash ghost. Hai deciso di portarti il teleport? Puoi recallare non appena fatti 720 gold per tornare in lane direttamente con la tear ed aumentare il tuo potere malefico. Nei teamfights cerca di ultare il carry, anche a costo di ghostare e flashare se si trova malposizionato. La danza della vittoria di Kirby ti consente di fare il bm dopo aver ucciso un avversario in modo disonorevole utilizzando il campione più OP del gioco. Raggiunto il 40% cdr con cuore ghiacciato e black cleaver subito dopo aver colpito un avversario con la E puoi mettere in sequenza una combo di 4 Q, che permasloweranno il nemico, grazie alla w, e ti permetteranno di inseguirlo e magar ianche di tirargli qualche autoattacco, che aumenteranno il tuo dps e ti permetteranno di infliggere il 100% degli hp al tuo avversario, che sarà costretto a vendere la sua build ed acquistare solo tear of goddess. Avendo il marchio blu sulle scarpe, la tua capacità d'ingaggio aumenterà del 20%, avendo a disposizione il flash 60 secondi prima, e con il ghost da 40% movement speed diventerai il chaser perfetto per ogni povero adcarry che cerca di scappare dalle tue grinfie. Vuoi essere cattivo a tal punto da convincere i tuoi nemici che tagliarsi le gambe per sostituirle con dei cosi meccanizzati sia meglio? Bene, al posto della guardian angel puoi prendere la maw of malmortius, o la bloodthirster, in modo tale da aumentare il tuo attack damage e polverizzare ancora prima i tuoi avversari.","replies":[{"poster":"Oinegue","date":"2015-07-02T08:19:42.480+0000","up_votes":1,"down_votes":0,"body":"Afferrato tutto, ma come mai niente hp nella build? al posto del GA non ci starebbe una banshee o che so, qualcosa che dia hp?\n\nE poi un'altra cosa, come mai è necessaria tutta questa penetration, considerando che la E riduce l'armor?","replies":[{"poster":"Nibbio Bianco","date":"2015-07-02T08:54:39.559+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Oinegue,realm=EUW,application-id=MJVj50Jw,discussion-id=NBMHzhPJ,comment-id=000000000000000000000000,timestamp=2015-07-02T08:19:42.480+0000)\n>\n> Afferrato tutto, ma come mai niente hp nella build? al posto del GA non ci starebbe una banshee o che so, qualcosa che dia hp?\n> \n> E poi un'altra cosa, come mai è necessaria tutta questa penetration, considerando che la E riduce l'armor?\n\nScaling molto bassi, quindi su punta tutto sulla penetrazione in modo tale da arrivare ad ottenere un danno molto simile al true damage. Si, puoi anche prendere una banshee come ultimo item, ogni tanto la faccio anch'io, oppure faccio la {{item:3800}}, sopratutto quando lo uso top senza ghost. ","replies":[{"poster":"Oinegue","date":"2015-07-02T09:49:58.363+0000","up_votes":1,"down_votes":0,"body":"Va bien lo provo e poi ti faccio sapere! Grazie per le info!","replies":[{"poster":"Nibbio Bianco","date":"2015-07-02T15:36:03.499+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Oinegue,realm=EUW,application-id=MJVj50Jw,discussion-id=NBMHzhPJ,comment-id=00000000000000000000000000000000,timestamp=2015-07-02T09:49:58.363+0000)\n>\n> Va bien lo provo e poi ti faccio sapere! Grazie per le info!\n\nPrego.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Giovarco","date":"2015-07-02T18:53:50.825+0000","up_votes":2,"down_votes":0,"body":"Io ho comprato Urgot e vorrei riceverlo di nuovo *riflessione di un Urgot main*","replies":[]},{"poster":"6slender6","date":"2015-07-02T17:12:03.278+0000","up_votes":1,"down_votes":0,"body":"Dai guarda che urgot è. Op usalo mid full ad","replies":[]},{"poster":"ubercodlegend200","date":"2015-07-02T08:57:16.033+0000","up_votes":1,"down_votes":0,"body":"Ama il tuo urgot come te stesso","replies":[]},{"poster":"Marshall IX","date":"2015-07-02T08:18:58.666+0000","up_votes":1,"down_votes":0,"body":"io ho ricevuto diana :(","replies":[]}]}