{"poster":"Jumpíng","date":"2016-05-09T22:13:21.245+0000","title":"hextech chest limit/month?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"is there a hextech chest limit per month? came back to lol after a while and opened my free chest and the other 4 i had accumulated, a week later i got my next available chest but it doesnt seem to drop even tho i met all the requirements (had the champ i played, someone got an S , hadnt earn a chest with that champ before, i got no punishments). Is it just bad RNG? (played @ 5 games where i met the requirements)","replies":[{"poster":"Quepha","date":"2016-05-09T23:32:19.063+0000","up_votes":2,"down_votes":0,"body":"The \"someone\" who earned an S has to be within your premade group, not just someone who ended up on your team due to matchmaking.","replies":[]},{"poster":"RiotBok","date":"2016-05-09T23:27:18.055+0000","up_votes":1,"down_votes":0,"body":"There's a few requirements (I think you hit them all), but you can check out the full list on our [Hextech Crafting Guide](https://support.riotgames.com/hc/en-us/articles/207884233-Hextech-Crafting-Guide).\n\nJust to confirm-The only time restriction is the one for chest availability (+1 Chest per week. Can store up to 4 chests at one time).  I took a quick look and I'm not seeing anything suspicious at the moment in your match history, but if there were specific games you were concerned about, we can do a quick look.","replies":[{"poster":"Kürama","date":"2016-05-09T23:35:19.773+0000","up_votes":1,"down_votes":2,"body":"I find the time limitation stupid. Like, I can probably hit 3 S ranks in a week and not hit another S till 2 weeks after. Keep the 4 per month but remove the 1 per week.","replies":[{"poster":"Quepha","date":"2016-05-09T23:45:26.942+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Rineyy,realm=NA,application-id=osqw6G4M,discussion-id=Ota8TOyJ,comment-id=00000000,timestamp=2016-05-09T23:35:19.773+0000)\n>\n> I find the time limitation stupid. Like, I can probably hit 3 S ranks in a week and not hit another S till 2 weeks after. Keep the 4 per month but remove the 1 per week.\n\nthe actual system is more flexible and fits your use case better than what you are asking for...","replies":[{"poster":"Kürama","date":"2016-05-10T01:53:17.187+0000","up_votes":1,"down_votes":1,"body":"It's bugged. You can only earn one chest per week. I got 3 S's in one week with different champs and I only got 1 chest. ","replies":[{"poster":"DeathBurst","date":"2016-05-10T12:16:31.396+0000","up_votes":1,"down_votes":0,"body":"No, you can **store a new chest slot** only 1 per week. If you don't play for 4 weeks, you can then win all 4 chests in a single day. And it's not bugged, can confirm it worked like that for me.\n\nThere is one detail nobody mentioned in this thread (EDIT: oh apparently Quecha did): you need **someone in your premade** (not just your team) to get an S. Maybe that's why you're not getting a chest, despite checking all the other conditions.","replies":[{"poster":"Kürama","date":"2016-05-10T18:28:07.760+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rineyy,realm=NA,application-id=osqw6G4M,discussion-id=Ota8TOyJ,comment-id=0000000000000000,timestamp=2016-05-10T01:53:17.187+0000)\n>\n> It&#x27;s bugged. You can only earn one chest per week. **I got** **I got** **I got** **I** **I****I****I****I****I****I got** 3 S&#x27;s in one week with different champs and I only got 1 chest.","replies":[{"poster":"DeathBurst","date":"2016-05-10T18:38:45.547+0000","up_votes":1,"down_votes":0,"body":"Well, except it worked for other people, so it's more probable that you missed something on your side than there being a bug in the system. That's why I suggested something you could have missed based on the information on the thread. Maybe you should answer to that instead of quoting/repeating yourself and downvoting people trying to help you...\n\nHave you heard about PEBKAC?","replies":[{"poster":"Kürama","date":"2016-05-10T21:03:21.150+0000","up_votes":1,"down_votes":0,"body":"Your tone seemed very much like you were blaming me for the system. I would be happy to explain if you aren't sure. \n\nI'll let it slide, if it happens again I'll report it.\n\nDownvote reverted.","replies":[{"poster":"DeathBurst","date":"2016-05-10T21:28:35.865+0000","up_votes":1,"down_votes":0,"body":"First of all, yeah, I'd very much like an explanation... First paragraph is repeating how the system works with emphasize on the most potentially confusing part + confirmation that it worked for me. Second one is emphasize on another source of confusion, in the required conditions this time, and a suggestion that could be the cause of your issue. How the hell can that be considered putting the blame on you? (Full disclosure, my second post was intended to be much more sarcastic and criticizing, though.)\n\nSecond of all, it's nice of you reverting the downvote, and it's all too rare to see people on these boards admitting their mistake. I do appreciate the effort but I don't really care about a vote. On the other hand, you considered reporting me for that?! That's hugely over-kill / trigger happy, and a report has huge consequences compared to a vote, I don't know if you realize...\n\n\nAnd you still haven't confirmed whether the \"someone\" getting an S was in your premade or not. Purely out of curiosity, I'd like to know it that was the problem or if there is possibly an intermittent bug in the Hextech System.","replies":[{"poster":"Kürama","date":"2016-05-10T22:11:37.446+0000","up_votes":1,"down_votes":0,"body":"Reporting the bug - me not getting a chest when I achieve an S rank, not you.\n\nI played solo and got the S myself.","replies":[]}]}]}]}]}]},{"poster":"Quepha","date":"2016-05-10T02:46:15.479+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Rineyy,realm=NA,application-id=osqw6G4M,discussion-id=Ota8TOyJ,comment-id=0000000000000000,timestamp=2016-05-10T01:53:17.187+0000)\n>\n> It&#x27;s bugged. You can only earn one chest per week. I got 3 S&#x27;s in one week with different champs and I only got 1 chest.\n\nI think it's more likely you just don't understand the system. Either you had already earned chests on those champs previously this season, you didn't have chest drops remaining, or you didn't own the champion","replies":[{"poster":"Kürama","date":"2016-05-10T09:34:48.600+0000","up_votes":1,"down_votes":0,"body":"1. I only play champs I own because I have a fuck ton of IP to waste.\n2. I had 3 chest icons remaining.\n3. I didn't earn chests on those champions previously.","replies":[]}]}]}]}]}]}]}