{"poster":"xXAnorelXx","date":"2015-10-01T04:42:54.417+0000","title":"normal + ranked","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":11,"body":"hi ich musste mit erschrecken feststellen das ich zurzeit nich die geringste chance auf irgendwas hab sei es in ein normal game oder in ein ranked da meine mit streiter entweder denn gegner richtig hart feeden, trollen oder sich wenn es nich gut l&auml;uft afk gehen ( ok und manchmal liegt es auch an mir ich bin ja auch nich perfekt ) aber zu 70% ist das der fall das ich mit ansehen muss wie meine mit streiter alles machen nur nicht spielen und das ist echt zum k**** wie soll ich denn mich hoch arbeiten im ranked wenn ich nich die geringste chance hab da fast immer die anderen lanes gefeedet werden dann zu meiner lane kommen und mich dann auch killn und die kr&ouml;nung ist wenn man den spielern sagt das sie mal schlecht spielen bekommt man daf&uuml;r ein report ich find s pers&ouml;nlich mist denn solche spieler machen einfach nur das spiel kaputt","replies":[{"poster":"Skagerak","date":"2015-10-01T16:51:48.813+0000","up_votes":4,"down_votes":0,"body":"Seid ich mit rankeds angefangen habe habe ich nur feeder afks und trolls in jedem game gehabt.\nIch bin aber so gut das ich trotzdem Diamant bin.","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-10-01T10:20:32.905+0000","up_votes":3,"down_votes":0,"body":"die ersten Spiele, dir mir entgegenspringen, wenn ich dein Profil aufmache... sind: 1-11-2 Yasuo, 0-11-0 Annie, 3-9-1 Yasuo...\n\nKlar, dass sind alles 3 Normals und wenn man in Normals mal einen neuen Champ auswählt, darf man mit dem auch mal verkacken. Gucke dir meine Zed Spiele an, dann merkst du, dass mir das selbst auch passiert...\n\nAber: Nach solchen Spielen zu behaupten, dass ja immer die anderen Schuld sind... Ich sage das mal so: mit der Einstellung wirst du ewig in Bronze IV bleiben. Und das sagt jemand, der selber mal Bronze III war... und damals genau die Einstellung hatte.\nArbeite an deinen Fehlern. Damit hast du garantiert genug zu tun. Und wenn du das tust, wirst du garantiert auch besser. Und wenn du besser wirst, gewinnst du auch mehr Spiele.","replies":[]},{"poster":"Celesil","date":"2015-10-02T09:20:04.184+0000","up_votes":2,"down_votes":0,"body":"Entschuldigt bitte, vielleicht komme ich auch ein wenig gehässig rüber, allerdings, kann mir einer den Beitrag vom TE nochmal ordentlich niederschreiben bzw. erklären wo drum es da geht?\n\nDenn ich bin ehrlich, gelesen habe ich den einen! Satz nicht. Durch die Kommentare kann ich mir nur erraten, das es um \"Jeder ist doof/ schlecht nur ich nicht.\" geht?","replies":[]},{"poster":"Jastol","date":"2015-10-01T07:10:41.812+0000","up_votes":2,"down_votes":0,"body":"Wenn du so spielst wie du schreibst würde es mich nicht wundern wenn viel zu oft du der Grund oder Mitgrund für die Niederlage wärst. Ansonsten kann Ich nur sagen, dass es sich mit der Zeit ausgleicht und jeder auch einfach mal ne Pechsträhne hat. Dazu solltest du auch bedenken, dass mit Patch 5.18 alle Strafen (Chat Restrictions, Banns) zurückgesetzt wurden und die entsprechenden Spieler eine zweite Chance bekommen haben. Leider nutzen nicht alle diese Chance. Diese dürften aber dann auch bald wieder von der Bildfläche verschwinden.\nDen besten Tipp den Ich dir also geben kann ist durchhalten, trainieren und versuchen die eigenen Fehler zu suchen und zu bekämpfen anstelle der Fehler des Teams. Wenn du nämlich jedes Match ohne Feeder und Afkler gewinnst wirst du auch schnell wieder aufsteigen, wenn nicht wirst du ja spätestens wenn du zu tief abgestiegen bist jedes Match gewinnen, egal ob 5vs5 oder in Unterzahl, da du ja besser sein müsstest als die Gegner. Last but not least, denk immer daran, dass die Wahrscheinlichkeit eines Feeders oder Afklers so lange du selbst nichts von beidem machst höher bei gegnerischen Team ist ;).","replies":[]},{"poster":"AirForce Panda","date":"2015-10-01T05:59:03.433+0000","up_votes":2,"down_votes":1,"body":"Addet mich dann helf ich euch gern zumindest bei den Normals :)","replies":[]},{"poster":"Zocker10","date":"2015-10-01T05:22:41.817+0000","up_votes":2,"down_votes":1,"body":"Hi adde mich wenn du lust hast habe das selbe problem wie du","replies":[]},{"poster":"Pumpgun Willy","date":"2015-10-01T12:05:39.415+0000","up_votes":1,"down_votes":0,"body":"Viel gibt es dazu auch nicht mehr zu sagen. Denke du gehörst nicht zu denjenigen, die eine \"safe\" spielweise pflegen, muss man ja auch nicht. Aber sich im Forum über seine Teammates zu beschweren das Sie zu oft feeden, aber selber oft derjenige mit den meisten Toden im Team ist, ist nicht ganz logisch. Ich merke anhand deines Spielverlaufes das du ein Fan von Ignite bist, egal wo egal wie, Hauptsache Ignite, ein Flash hätte sicherlich den ein oder anderen Tod eingespart ;-) \n\nLG","replies":[]}]}