{"poster":"KauzLP","date":"2016-08-04T01:21:12.587+0000","title":"Eure Meinung zur Meta ist gefragt!","subforum":"Champions & Gameplay","up_votes":5,"down_votes":1,"body":"Heyho liebe Community,\r\nWir alle hasslieben ja LoL. St&auml;ndig gibt es &quot;OP-Picks&quot; und die dauerhaften &quot;Noob-Champs&quot;, sowie deren jeweiligen Counter. Auch gibt es ja noch die nebenher lebenden Champs, sowie die On-Off-Champs, die Itemabh&auml;ngien etc.. Diese fallen alle von der Grundstruktur sehr unterschiedlich aus, was das Game unheimlich abwechslungsreich, jedoch auch eine Balance sehr schwer macht. Dieser st&auml;ndige Wechsel spiegelt sich als wohlbekannte Meta im Spiel wieder. \r\n\r\nJetzt w&uuml;rde mich brennend eure Meinung zu der aktuellen Meta interessieren, sowie euer Blick auf das gesamte Konstrukt Meta &uuml;ber die Seasons verteilt. Egal ob ihr der Platin Riven Mainseit Season 2 seid , der sich &uuml;ber die ganzen Tryhard Noobs aufregt oder der komfortable alles Spieler der auch gerne neue Sachen ausprobiert, schreibt mir eure Sicht der Dinge, sowie Vorschl&auml;ge zur Verbesserung der Meta, gerne auch mit konkreten Vorschl&auml;gen, unten rein. :) Lasst uns diskutieren, wie unterschiedlich die Wahrnehmung der Meta in der Kluft ist.\r\n\r\nPS: Ja auch du lieber Teemo Main bist willkommen ;)\r\nPPS: Falls dieser Thread l&auml;nger bestehen bleibt, kann auch der Metashift gerne besprochen werden. :)","replies":[{"poster":"CCG Inu XIII","date":"2016-08-04T12:47:21.917+0000","up_votes":3,"down_votes":0,"body":"Spamme seit S4 {{champion:84}} in High-Plat/Low Dia und komm ganz gut klar...Meta hat mich nie gejuckt und wird mich nie jucken da ich gerne meine eigenen Meinungen über Champs fälle unabhängig von der Meinung vermeintlicher \"Pros\" (wobei hier die LCS und diverse Möchtegern-LCS Spieler gemeint sind).\n\nMeta existiert in den Köpfen der Spieler und das wars dann auch schon wieder mit Meta, was meint man wohl wie neue Picks ans Licht kommen? Non-Meta.","replies":[]},{"poster":"Maexle","date":"2016-08-04T13:01:39.731+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=KauzLP,realm=EUW,application-id=Wj1wcocU,discussion-id=Zr59OI04,comment-id=,timestamp=2016-08-04T01:21:12.587+0000)\n>\n> PS: Ja auch du lieber Teemo Main bist willkommen ;)\n\n\nTeemo-Mains sind willkommen? Sachen gibt´s...\n\n{{champion:17}}","replies":[{"poster":"Sincetia","date":"2016-08-04T23:46:42.383+0000","up_votes":1,"down_votes":0,"body":"Ist echt unglaublich \nNaja n Kumpel spielt zum ersten Mal seit nem halbenJahr wieder LoL und ist zu seinen alten Mains zurückgekehrt\n\n\n\nTeemo u Shaco^^\n{{sticker:zombie-brand-mindblown}}","replies":[]}]},{"poster":"Bluefersan","date":"2016-08-04T04:24:05.781+0000","up_votes":2,"down_votes":0,"body":"abgesehen von meta, finde ich das teamplay zurzeit mehr aus macht als je zuvor. Roaming von support ist enorm wichtig geworden, 3 in der Mitte kill secure. Wo ist der gegnerische jgl, mitte noch down also jgl invade und und und. Kriegt man diese synergien hin ohne viel zu sagen ist das spiel schon gewonnen. Da kommt es eher auf die team zusammenstellung an und nicht mehr so stark auf tanks.\nhabe lieber einen tf der defensiv spielt und gute ultimates landet als einen lb der 1v1 jeden os  aber zu statisch ist und nie die lane verlässt. tank support ist mir auch nicht so wichtig , hab ich ein zilean z.b in team bin ich mir sicherer beim dive von bot turret oder eine janna die mit flash ult den support und adc wegzoned passt auch Hauptsache die Personen können ihre champion spielen und wissen auch wie sie im team agieren müssen.","replies":[]},{"poster":"KauzLP","date":"2016-08-05T02:15:43.925+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für die langen Antworten von euch allen, es ist sehr schön zu sehen das sich Leute über die Meta unterhalten wollen :)\n\n@CCG Inu XIII, @OrangeBubble, @Zovers\nIch finde die Meta betrifft uns alle, selbst die, die sich ehr weniger damit auseinander setzen möchten. Alleine durch das eigene und das gegnerische Team hat man bereits viel mit ihr zu tun (in den meisten Fällen) und als Bonus könnte man noch LCS sehen. Somit bezieht sich die Meta nicht \"nur\" auf den Profi Bereich, auch wenn sie natürlich dort meistens ihren Ursprung nimmt. Ich finde auch die Idee eines One Trick Ponys ja super, vor allem wenn man den Champion gerne spielt. Finde blos dass man dann nicht alles was noch dazu gehört weg lassen sollte :) Ausserdem heißt ja sich mit der Meta auskennen ja nicht das man sie befolgen muss ;) Ich persönlich liebe {{champion:6}}  Top und {{champion:161}}  Mid, die eigentlich nicht in die momentanige Meta passen <3\n\n\nZu der aktuellen Meta mit Bruisern und Caster Supportern muss ich sagen das es sich eigentlich in einer gewissen Weise ausgleicht. Was sich erst einmal komisch anhört sollte man sich zweimal durch den Kopf angehen. Als Caster Support, benötigt man auf der einen Seite jemanden der für einen peelt, was sich auf einer CC/Tank Top(zB {{champion:150}} ) oder Jungler  ({{champion:421}} , {{champion:79}} ) niederschlägt. Außerdem kann eine {{champion:16}} oder {{champion:37}}  solange sie den ersten Engage überlebt, ihr Team extremst verstärken dank ihrem Kit in Kombo mit dem {{item:3504}}  zB. Somit gilt der Caster Support als ein Hauptziel und sollte (fast) immer Priorität Nummer eins für das andere Team sein. \nUnd was eignet sich da besser als ein Bruiser? Die meisten wurden dank des {{item:3078}}  Reworks enorm verstärkt({{champion:39}} , {{champion:120}} , {{champion:157}} ) und können nun mit wenigen Items ohne Probleme eine Backline diven und sehr schwer getötet werden, bevor sie nicht alle anderen nieder gehauen haben. Da kann man die momentane Meta ja schon fast nachvollziehen ;) \n\n\nSollten nun aber ehr die Caster Supporter oder die Bruiser generft werden? \nUnd genau dort würde ich mich für die Bruiser entscheiden! Das Trinity ermöglicht nun das Comeback vieler alter Champions wie auch Irelia, Hecarim oder Jax zu sehen die vor allem im kompetitivem Bereich selten ausgepackt wurden oder auch in der SoloQ selten Anklang fanden an Tanks oder Assassinen die meistens ihre Rolle deutlich besser erledigten (Ich betrachte hierfür nun mal den Bereich ab Platin, untenrum wird sowieso eh alles gepickt :D). Kann man dies jedoch dem {{item:3078}}  zuweisen? Oder doch den einzelnen Champs da diese über die letzten Patches (meistens) kaum angefasst worden und nun mit enormer Stärke präsent sind? Für mich ist der Fall klar. Beide sind schuld. Was sich wie eine schlechte Trennung anhört, ist jedoch leider nervig für uns Spieler. {{champion:39}}  zerstört wahrscheinlich auch noch durch leichte Nerfs am Trinity. Ein {{champion:120}}  fällt dagegen ein bisschen weiter zurück im Vergleich, auch wenn es ihn trotzdem noch durchaus Meta relevant hinterlässt.\n\n\nKonkret würde ich das {{item:3078}}  zum Beispiel um 5 AD bringen und das Movespeed auf 3% verringern, und Irelia, Jax und Xin einer kleinen Kur im Hause Balance zukommen lassen. {{champion:39}}  würde ich den Grundangriffsschaden senken, und einen 0.2er AD Scaling auf die E legen, sobald man stunnt. Dies würde sie nicht nur leicht anspruchsvoller machen, sondern auch eventuell ein offensiveres Build wählen lassen um den fehlenden Schaden auszugleichen. Ähnliche Schritte könnte man sich auch überlegen bei anderen Trinity gestörten :D\n\nUnd @Maexle ich beobachte dich {{champion:17}} {{summoner:2}}  {{item:2050}} \n\nTeilt mir eure Gedanken mit! Vielleicht habt ihr ja auch coole Ideen zur momentanen Meta und wollt diese verbreiten? Oder einfach nur mein wirres Geschreibsel kommentieren? Einfach reinhauen :)\n\nLG und verzeiht meine Schreibfehler, es ist spät ^^","replies":[]},{"poster":"Zovers","date":"2016-08-04T18:53:31.387+0000","up_votes":1,"down_votes":0,"body":"Ich bin einer der Hand voll Spieler, die League nicht wegen dem Rang, sondern wegen dem Spaß am Spiel spielen.\nUnd deswegen spiele ich lieber entspannt meine Normalgames (hab mittlerweile sogar gold mmr in normals !).\nUnd da es mir nur um den Spielspaß geht, spiele ich nur was mir richtig Spaß macht, und am liebsten immer wieder die selben Champions hintereinander, weil ich deren Mechanics dann gut beherrsche.\nZur Zeit spiele ich deswegen immer wenn Ich kann meinen Main {{champion:41}} auf der Midlane mit inzwischen über 126k Championmasterypunkten :)\nMit Änderen der Meta und an Champs, Items muss Ich mich dann anpassen.  \n:)","replies":[]},{"poster":"Alustus","date":"2016-08-04T11:27:32.090+0000","up_votes":1,"down_votes":0,"body":"Ich habe eigentlich keine spezielle Meinung von der Meta.\nIch finde die Changes aber gut da man ansonsten nur ein paar wenige champs sehen würde.\nOP champs sind meist nicht so OP und man kann sie bannen daher stören sie mich nicht extrem (Sicht aus meiner ELO)","replies":[]},{"poster":"Oyasumi Punpun","date":"2016-08-04T03:45:05.975+0000","up_votes":1,"down_votes":0,"body":"Aktuell kommt es mir so vor, als ob Offtank-Builds bzw. Tank-Items zu stark sind. Wenn man sich so anschaut welche Cahmpions in letzter Zeit stark generft wurden, sind darunter Fizz und Ekko die eigentlich Assassins sein sollten, aber mit Tank-Items viel stärker waren und als nächstes wird es Yasuo treffen, der zwar nicht direkt ein Assassine ist, dessen Kit aber auf jeden Fall so gedacht war, dass man Crits und offensive Items baut. Momentan bauen viele aber einfach 0% Crit, gehen auf Trinity & Frozen Mallet und danach Full Tank, einfach weil's effektiver ist.","replies":[{"poster":"Tennoko","date":"2016-08-04T10:22:41.235+0000","up_votes":1,"down_votes":1,"body":"What??? Tank items sind zu stark? Bitte um Auflistung welche Items dass sein sollen. (trinity kein tank item) Bruiser sind im moment bisschen zu stark. Viel zu viel utility Irelia, Yasuo & co. Zwar versucht man das Leben für adc zu erleichtern mit den nerfs der tanks, aber irgendwie wird am falschen Ende herum gebastelt. Bei Supports sind poke champs geuped worden, ob dass jetzt gut oder schlecht ist, ist wohl Geschmackssache.\n\nOverall würden sehr viele Champs eine Überarbeitung benötigen, besonders in Sachen dmg, substain & mobility.\n\nReine Tank items sind eigendlich Randuin, sc etc. wird aber kaum mehr gebaut weil Armorpen., AD, atkspeed, HP besser ist.","replies":[{"poster":"Oyasumi Punpun","date":"2016-08-04T10:39:28.798+0000","up_votes":1,"down_votes":0,"body":"Ja meinte eher Bruiser. Man baut halt ein offensives Item, z.B. {{item:3078}} und geht danach auf Items wie {{item:3068}}, {{item:3026}}, {{item:3742}}, {{item:3053}}. Bestes Beispiel ist da halt Yasuo oder Irelia, die trotzdem noch immensen Schaden raushauen während sie mit über 3000 HP rumlaufen und ohne Probleme das Team diven weil sie nahezu unsterblich sind. Das ist zumindest mein Eindruck als Yasuo-Spieler mit 180k, ich kauf mir {{item:3078}} und geh danach auf {{item:3748}}, das allein macht mich schon so stark, dass ich ohne großes Risiko einfach mal einen Fight engagen und mich auf den ADC stürzen kann.","replies":[]}]}]},{"poster":"Zulwar","date":"2016-08-04T08:03:21.232+0000","up_votes":1,"down_votes":0,"body":"Also ich finde, das es aktuell eine Support-Meta gibt.\n[Auf dieses Spiel beziehe ich mich dabei.](http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2781257590/22211066?tab=overview)\n\nEs war ein Ranglisten Spiel. Das Gegnerteam, ein recht normales Team und bei uns, etwas skurril.\n\nAnfangs lief es ganz gut für uns. Die ersten Kills gingen an Jungle, Top und Mid. Später wurde der ADC gesittet, was aber bei Ashe jetzt nicht so tragisch ist. Die ersten beiden Teamsfights, liefen für uns dann ziemlich schlecht, wodurch unser Gegner alle Tier I und fast alle Tier II Türmen holen konnte.\n\nTrotz dieses herben Rückschlages, konnten wir das Blatt noch wenden und gewannen danach fast jeden Teamfight.\nAber warum, konnten wir dies noch wenden, obwohl wir auf den ersten Blick betrachtet, von Anfang an im Nachteil waren. Keine Tanks und 2 Supporter.\n\nIch denke, dadurch, das wir die 2 besten Heiler in LOL hatten, war unser Durchhaltevermögen so groß, das jeder von uns als Tank betrachtet werden konnte und wir somit den Sieg nur den beiden zu verdanken haben.","replies":[]},{"poster":"Kurisu 1v9","date":"2016-08-04T07:07:48.835+0000","up_votes":1,"down_votes":0,"body":"> Jetzt würde mich brennend eure Meinung zu der aktuellen Meta interessieren, sowie euer Blick auf das gesamte Konstrukt Meta über die Seasons verteilt.\n\nDie Assasinenmeta S3 mit dem Solo-Carry Faktor war extrem geil und spannend anzusehen/zu spielen. Die jetzige Meta ist für den reinen Solo-Q Spieler so lala. Ich hab einfach das Gefühl, selbst wenn man gefeedet ist, dass du nicht mehr 1 v 9 solo carrien kannst, was extrem frustrierend sein kann. \nDie jetzige Meta basiert meiner Meinung nach weniger auf Picks und Mechanics, sondern eher auf Knowlegde , Teamplay und globale Pressure/Präsenz, was  im competitiven Bereich und Teamrank zwar extrem nice ist, da es dem Spiel mehr Tiefe verleit, aber in der Solo-Q komplett suckt, da man sich sein Team nicht aussuchen kann.","replies":[]},{"poster":"Vorzüglich","date":"2016-08-04T04:15:24.061+0000","up_votes":1,"down_votes":0,"body":"Nun die größte Freiheit und Schwierigkeit besteht in meinen Augen im unterschiedlichen \"scaling\" der Champs, sprich im zunehmenden Spielverlauf.\n\naka: \"Early\", \"Mid\" und \"Late Game\" Champs.\n\nDie unterschiedlichen Progress Kurven der (DMG) Werte , Angriffs - Reichweiten sowie zunehmende Mobilität bestimmen das \"balancing\" im Spiel, das irgendwann schlichtweg kippt.\n\nEs ist toll das ich jeden Champ grundsätzlich auf jeder Lane spielen kann und darf,\nnur dies setzt manchmal voraus, das ich das Spiel bis zu einer gewissen Spieldauer gewonnen haben muss oder die \"late Game Champs\" werden schlichtweg übermächtig.\n\nDas war schon immer so und ist wohl auch so gedacht.\n\nDer Balance Gedanke besteht wohl darin zu sagen, das manche Champs sehr lvl abhängig sind andere eher Item Abhängig.\n\nWas Tanks in meinen Augen so gefährlich macht, ist so manches CC Potential.\n\nHatte unzählige Matches wo man einfach \"gestompt\" / überrannt wurde. \n\nGut das es jetzt einen \"Taric\" gibt oder eine Taliyah die je nach Lage, ein/aussperren kann.#\nRyze auch ein gelungen, gutes Beispiel.\n\nSo sollte mächtige CC sein OHNE SCHADEN. (Rito davon gerne mehr)\n\nAber es gibt halt sehr viel CC im Spiel die fast alles kann. \n\nSprich darin besteht das größte Problem meiner Meinung aber CC nerfen die AoE , instant und DMG macht zu nerfen, würde halt viele alte Champs für die meisten unattraktiv machen.\n\nDaher brauchen wir neue Champs, die solche \"OP CC\" von \"unbalanced\" Champ`s etwas entgegen zu setzen haben.\n\nAnders herum traut sich sicher keiner daran, der Aufschrei wäre sicher zu groß.","replies":[{"poster":"Nohgolgh","date":"2016-08-04T04:30:06.514+0000","up_votes":1,"down_votes":0,"body":"Ich verstehe deinen Beitrag bezüglich CC nicht. \nIst nicht die Idee von CC, dass der Schaden draufgekloppt wird, während du nichts machen kannst? So ein Leona Stun oder Morgana-Root sind ohne Followup doch recht ungefährlich. \nOder anders gefragt: Welcher Tank hat denn die massive CC und gleichzeitig den massiven Schaden (ist wirklich eine ernst gemeinte Frage)?","replies":[{"poster":"Vorzüglich","date":"2016-08-04T04:31:28.776+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nohgolgh,realm=EUW,application-id=Wj1wcocU,discussion-id=Zr59OI04,comment-id=00020000,timestamp=2016-08-04T04:30:06.514+0000)\n>\n> Ich verstehe deinen Beitrag bezüglich CC nicht. \n> Ist nicht die Idee von CC, dass der Schaden draufgekloppt wird, während du nichts machen kannst? So ein Leona Stun oder Morgana-Root sind ohne Followup doch recht ungefährlich. \n> Oder anders gefragt: Welcher Tank hat denn die massive CC und gleichzeitig den massiven Schaden (ist wirklich eine ernst gemeinte Frage)?\n\nMalphite z.B.","replies":[{"poster":"Megamaexx","date":"2016-08-04T04:54:22.309+0000","up_votes":1,"down_votes":0,"body":"Massiv CC hat er nicht, nur seinen Ulti Knockup. Ist aber auch ne Ulti und ich denke mal, eine Annie R knallt mehr","replies":[{"poster":"Nohgolgh","date":"2016-08-04T05:16:12.013+0000","up_votes":1,"down_votes":0,"body":"Naja gut, wenn man Malphite auf Ap baut, dann knallt seine Ult schon mehr (100% vs 65% von Annie), aber dann ist er auch nicht wirklich tanky. Und in der Combo macht Annie dann vermutlih doch mehr Schaden.","replies":[]}]},{"poster":"Oyasumi Punpun","date":"2016-08-04T04:49:01.479+0000","up_votes":1,"down_votes":0,"body":"Bei Malphite muss man allerdings dazu sagen, dass er eine Art Burst-Combo hat. Seine Ulti macht zwar soliden Schaden, aber nachdem er seine Spells rausgehauen hat, ist er aufgrund seiner relativ hohen Cooldowns ziemlich useless. Der steht dann halt nur noch sinnlos rum, haut ab und zu mal eine Q und E raus die wenig Schaden machen und im Grunde niemanden wirklich interessieren.\nAlso eine eindeutige Stärke und eine eindeutige Schwäche.","replies":[]}]},{"poster":"OrangeBubble","date":"2016-08-04T04:43:19.875+0000","up_votes":1,"down_votes":0,"body":"\"Sprich darin besteht das größte Problem meiner Meinung aber CC nerfen die AoE , instant und DMG macht zu nerfen,\"\n\nAlso das hat mich ja sofort an Annie erinnert xD","replies":[{"poster":"Nohgolgh","date":"2016-08-04T05:10:58.495+0000","up_votes":1,"down_votes":0,"body":"NEEEEEEEEEEEEEEIN. NICHT ANNIE NERFEN. DIE SPIEL ICH DOCH. :D\n\nAber jetzt mal im Ernst: Annie würde ich nicht unbedingt als Tank bezeichnen. Eher als \"platzt ganz schön schnell, wenn du nicht aufpasst\". Und du musst auch wirklich Schaden bauen, um Schaden rauszukloppen.\n\nGleiches gilt im Übrigen für eine Morgana mit ihrem 110-165% W-Scaling auf AP und 2 CC Spells. ","replies":[]}]}]}]},{"poster":"OrangeBubble","date":"2016-08-04T04:47:25.545+0000","up_votes":1,"down_votes":0,"body":"Ich spielt jetzt seit 4 Season Sona in Ranked, egal ob die stark, schwach oder ganz okay ist, egal ob es Tank Meta oder Utility oder Burst Meta ist, ich mag Sona :3\n\nAnsonsten gehe ich einfach danach, was ich spielen mag *schulterzuck* Alles ist mal in der Meta, eine Zeitlang war Urgot einfach schlichtweg \"op\", weil er eben ein super counter für Assassinen war, als aber die Zeit der Assassinen zu Ende war, war auch Urgot wieder verschwunden :'D\nDaher sollte man sich nicht so ein Kopf machen, außerdem funktioniert das, was die in der LCS machen, eh nicht in SoloQ, höchstens als 5er Premade Team.","replies":[]},{"poster":"Nohgolgh","date":"2016-08-04T04:12:17.025+0000","up_votes":1,"down_votes":0,"body":"Mich tangiert die Meta nur marginal. Man muss sich keine Gedanken über die Meta machen,wenn man nicht in der Meta ist- ein Vorteil der low elo. :D\nIch bin Silber V.\nFür mich gilt: {{champion:103}} mid=55% Winrate, {{champion:1}} mid= 60% Winrate, {{champion:25}} mid=75% Winrate. Und gebannt werden sie in der Regel auch nicht (recht selten mal Ahri). \nAuf der Toplane sind es dann {{champion:33}} {{champion:36}} {{champion:48}} oder wenn ich agressiv sein will: {{champion:80}} und {{champion:39}} . \nIn den seltenen Fällen, wo ich Mal supporte, sind es {{champion:89}} {{champion:12}} {{champion:37}} (wobei ich das in letzter Zeit aufgrund schlechter erfahrungen sein gelassen habe). \n\nDas sind auch so etwa alle Champs, die ich spielen kann (also im Vergleich zu meiner elo). \n\nDementsprechend habe ich nicht so wirklich Ahnung, was die derzeitige Meta ist (der Grund für meinen Post). Vorher war Tank-Meta. Aber ich habe nicht so viele Tanks gesehen. Dann gab es eine {{item:3078}}-Änderung, die ich auf Irelia auch merke (hab das Ding aber schon vorher gebaut) und dann gab es eine Änderung der Support- Gegenstände, totzdem wollen die Leute in meiner elo eher einen Tank-Support. Insofern habe ich Null Plan, was die aktuelle Meta ist, wieso das so ist und wie sich das manifestiert.","replies":[]}]}