{"poster":"Seht","date":"2015-02-11T14:21:04.315+0000","title":"[inLoL.de] Fight of the Legends (SR) & Clash of Fluke (ARAM) Turniere","subforum":"Turniere & Veranstaltungen","embed":{"description":null,"url":"http://cup.ingame.de//tournament.php?gid=36&tid=1634&mode=info","image":"http://www.youscreen.de/dbjsejlc81.jpg"},"up_votes":10,"down_votes":0,"body":"inLoL.de startet zwei Turniere! Fight of the Legends (Summoner's Rift 5v5) und Clash of Fluke (ARAM 5v5) und es gibt Riot Points zu gewinnen!\n\nFight of the Legends\nhttp://cup.ingame.de//tournament.php?gid=36&tid=1634&mode=info\nClash of Fluke\nhttp://cup.ingame.de//tournament.php?gid=36&tid=1635&mode=info\n\nDas Turnier wird international abgehalten, ihr könnt euch also mit vielen Teams messen und zu einer Legende werden! Nur die besten kommen in die höheren Platze und werden damit Riot Points im Wert von 20€ gewinnen können, und zwar sowohl im Summoner's Rift- als AUCH im ARAM-Turnier!\nDas Event wird auch von uns gecastet, und zwar auf Deutsch, denn wir sind eine deutsche Community-Seite. Das ganze wird auf Twitch zu finden sein.\nSchaut einfach mal vorbei, wir haben auch mehr anzubieten. Momentan leider noch keine Guides, aber die Coder arbeiten dran, wir können bald damit rechnen und dann gehen zusätzlich auch endlich die Guides hoch!\nhttp://lol.ingame.de/\n\nWir verlosen außerdem IP-Boosts, falls du Interesse hast findest du die Verlosung hier:\nhttps://www.facebook.com/inLoL.de#\nAußerdem haben wir hier noch eine Reihe von Videos angefangen:\nhttps://www.youtube.com/watch?v=QRcKvHcd2Tc&feature=youtu.be\nMomentan zwar nur die erste Woche, aber das soll sich heute Abend bereits ändern, und wenn das Turnier es hergibt werden wir auch von euch die besten Plays in einem Video zusammenfassen und es hochladen!\n\nInfos:\nCheck-in: 22. + 23.02 - 14:40\nTournament start: 21. + 22.02 - 15:00\nSign-up: Only the teamleader has to sign up","replies":[{"poster":"Sc0tt Sterling","date":"2015-02-21T23:13:16.974+0000","up_votes":1,"down_votes":0,"body":"Bei der bisherigen Resonanz wird das ARAM Turnier wohl nix, oder? :-\\","replies":[]}]}