{"poster":"Shakês Beer","date":"2017-01-11T22:52:22.113+0000","title":"Ekko build Meinugen","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Moin, \r\nich hab ein Tankekko build zusammengebastelt, etwas durchgerechnet und in einem Custom game gegen einen Kumpel getestet und wollte eventuell ein paar Meinungen h&ouml;ren. \r\n\r\n{{item:3030}}  Der HT-GLP ist ein relativ interessantes Item. Wie einige wissen, wird es auch auf Anivia gebaut. Grund?\r\n Man steht kurz wenn man das Item aktiviert. So kann es mit der Q kombiniert werden, oder der E um extra dmg in kurzer Zeit zu verschaffen. Ekko hat ebenfalls eine Q bei der ein kurzes Channeln stattfindet. Durch eine E Q HTGLP Kombination kann extra dmg verursacht werden, was einem Tank zu gute kommt. Au&szlig;erdem bekommt man relativ schnell ganz gute Stats. \r\n\r\n{{item:3151}}  Gegner k&ouml;nnen durch das GLP, der Q, dem E Handschuh verlangsamt werden. Zumal das Item billger geworden ist, verursacht es ordentlich Bonusdmg. Und die Magicpen sowie Stats sind auch nett.\r\n\r\n{{item:3025}} Man kommt so an etwas CDR, Mana und einem Slow und Bonusdmg. Der Slow ist eigentlich das wichtigste. Tankekko wurde beim Assassinupdate generft indem man den Slow vom passiv entfernte. \r\n\r\n{{item:3742}} {{item:3065}} {{item:3111}} Logisch, oder? \r\n\r\nDas Itembuild ist nicht zu teuer, es hat schon dmg, man kann gut fight cleanuppen....\r\nWas meint ihr?","replies":[{"poster":"Belezebell","date":"2017-01-12T16:45:01.699+0000","up_votes":2,"down_votes":1,"body":"Hör bitte einfach auf über Tank-Ekko nachzudenken.. er soll als Ap-Assassin gespielt werden und das soll auch so bleiben, Tank-Ekko ist unbalanced und nervig.","replies":[{"poster":"Shakês Beer","date":"2017-01-12T17:09:28.873+0000","up_votes":1,"down_votes":1,"body":"Jetzt darfst du raten warum ich ihn wiederbeleben will.","replies":[]}]},{"poster":"Adcisusel3ss","date":"2017-01-12T18:20:17.909+0000","up_votes":1,"down_votes":0,"body":"Ich denke anstatt des {{item:3030}} wäre ein {{item:3152}} ein wenig besser weil es einem im early immernoch ein wenig mehr Outplaypotenzial gibt und man mit der CDR und den restlichen Build auch die 40% CDR erreicht. Wobei ich mir nicht sicher bin ob {{item:3078}} ein wenig besser als ein {{item:3025}} ist. Ich denke aber das man evtl auch besser anstatt des {{item:3151}} sich besser ein {{item:3751}} früh gönnt um von der HP und der Aura zu profitieren. Mehr Gedanken würde ich mir eher über einen wirklich guten Keystone für ihn machen da ich finde das keiner wirklich passend für ihn ist.","replies":[]}]}