{"poster":"Shakês Beer","date":"2016-10-04T13:55:52.986+0000","title":"Tanz des Todes auf Darius?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Also wie ihr im Titel lesen k&ouml;nnte geht es heute um das Item &quot;Tanz des Todes&quot; und ich frag mich einfach warum das keiner auf Darius baut. Ich finde sogar da hat jemand mal das Item genommen und mit roter Farbe draufgeschrieben:&quot;Darius :( Nutz mich!&quot; \r\n\r\nAber es macht einfach keiner, zumindest nach den Builds von Mobafire, Lolking etc. Und daf&uuml;r muss es doch einen Grund geben.\r\n\r\nSchauen wir uns doch erstmal das Item an:\r\n{{item:3812}} \r\nDieser Kraftprotz kostet so viel wie eine Hydra, die sowieso fast jeder auf Darius kauft, gibt einem 75 AD, 10% CDR sowie 15% Lifesteal und Spellvamp auf normalen Schaden. Desweiteren ist die Heilrate, wenn ich das richtig verstehe, auf 33% erh&ouml;ht, sofern man Fl&auml;cheneffekte nutzt und zu allem &Uuml;berfluss verursacht man zus&auml;tzlich noch 3 Sekunden extra Blutungsschaden, allein durch das Item. \r\n\r\nDas kann einfach mal so viel mehr als die Hydra. Von den L&auml;cherlichen AOE effekt mal abgesehen. \r\n\r\nUnd richtig gest&ouml;rt wird es wenn wir mal weiter Denken. Nutzen wir nun unsere Q, sch&auml;digen wir alle in einem Umkreis (AoE effekt), geben denen die von der Klinge getroffen werden Blutungen und heilen uns um 12% unseren fehlenden Lebens pro getroffenen Champion (max. 36%).    \r\n\r\nAlso ergibt sich daraus folgendes:\r\n40/70/100/130/160 (+105% zus&auml;tzlicher Angriffsschaden) \r\n75 AD\r\n15% Blutung\r\nPassive:  10 / 15 / 18 / 21 / 24 / 27 (+30% Bonus AD)\r\nRunen, Masterys, Schlag-mich-tot: (x) \r\nOhne Blutungen etc. kommen wir auf ca. 238.75, das ist der Wert von dem der Lifesteal genommen wird.\r\nBei 33% w&auml;ren das 77.8 Leben die wir pro Gegner bekommen. (R&uuml;stung etc. wurde da jetzt nicht mit einberechnet, die juckt bei Vasallen aber sowieso nicht.) Also bekommen wir, wenn wir es Perfekt treffen 6-7*77.8 + 1-5*77.8(+12% des fehlenden Lebens *1-3) Ohne die Rechnung in der Klammer auf: 466.8 - 933.6 (H&ouml;chstwert wurde ohne R&uuml;stung gerechnet, den nicht zu ernst nehmen) okay. GeGe. Das ist ohne die F&auml;higkeitspassive, dass man sich um 12% des fehlenden Lebens heilt, ohne Spirit Visage, ohne Masterys, ohne Spellvamprunen und VORALLEM OHNE:\r\nDie Blutung welche, da bin ich mir nicht so sicher, eventuell auch noch heilt, gibt einen dann f&uuml;r 5 Sekunden eine verst&auml;rkte Regeneration f&uuml;r jede getroffene Einheit. Und dank der 10% CDR vom Tanz des Todes, kann Darius die Permanent aufrecht halten und von einen permanenten Regenerationsbuff profitieren. \r\nWie gest&ouml;rt ist das? \r\n \r\nDas sind Heilwerte, da kommt so ne Hydra alleine nicht dran. Die hat nat&uuml;rlich ganz andere St&auml;rken und Aufgaben und wenn man Lowlife in einer Gegnergruppe sich dreht knackt die diesen Wert locker, aber in der Laningphase und vorallem wenn man dieses Item hat dominiert man einfach um so viel mehr, als wenn man Black cleaver oder eine Hydra hat. Du kannst dich permanent hochheilen oder sogar in den Minions fighten ich meine, Who cares du heilst dich eh mehr als die dir Schaden k&ouml;nnen. \r\n -----------------------------------------------------------------------------------------------------------------------------------------\r\nZur Schadensrechnung von vorhin btw.\r\nMit Blutungen kommen wir auf 315 dmg. Da k&ouml;nnten wir jetzt noch wenn wir lustig noch Deathfires touch dazurechnen (26.5 extra dmg) oder auch favor of battle. \r\n---------------------------------------------------------------------------------------------------------------------------------------------\r\nWie dem auch sei ihr seht es ist eig. ein Wahnsinnig gutes Item und ich verstehe nicht warum man es nicht auf ihn baut. Wisst ihr da mehr?","replies":[{"poster":"M Λ D Λ R Λ","date":"2016-10-04T14:03:28.367+0000","up_votes":2,"down_votes":0,"body":"Du hat du leider etwas falsch verstanden.\n\nBei Flächenschaden heilst du dich nicht 33% statt 15% sondern 33% von 15% also nur 5%.\n\nAußerdem, ich baue nie Hydra auf Darius\n\nmeistens baue ich: BlackCleaver -> Spirit Visage + Deadmans -> Randuins -> GA","replies":[{"poster":"Shadowscreen","date":"2016-10-04T14:06:39.340+0000","up_votes":1,"down_votes":0,"body":"Zudem  verursacht man keinen Blutungsschaden(durch das {{item:3812}})  sondern 15%(?)  des Schadens den man bekommt wird\nanstatt sofort nun per Blutungsschaden abgezogen, damit man noch etwas zeit hat gegen zu heilen.","replies":[{"poster":"Shakês Beer","date":"2016-10-04T14:13:37.934+0000","up_votes":1,"down_votes":0,"body":"ich weiß--- Das mit den Blutungsschaden weiß ich aber wenn ihr euch so sicher seid, danke :)","replies":[]}]},{"poster":"Shakês Beer","date":"2016-10-04T14:06:03.957+0000","up_votes":1,"down_votes":1,"body":"Das  habe ich mir auch schon überlegt ABER: Dagegen spricht, dass beim Hextech Gunblade sowie dem anderen Spellvamp Item die formulierung anders ist. Weshalb ich mir da nicht so sicher wäre.","replies":[{"poster":"TerrorRaven","date":"2016-10-04T14:09:51.724+0000","up_votes":1,"down_votes":0,"body":"Die Formulierung ist anders, aber der Effekt ist der Selbe: Bei Flächenschaden beträgt die Heilung nur 1/3, dass war schon immer so bei Vampierzauber (wäre sonst zu OP).","replies":[]}]}]},{"poster":"Bodycounter","date":"2016-10-06T10:11:33.445+0000","up_votes":1,"down_votes":0,"body":"Du veräppelst mich doch, was gibt es an der Beschreibung misszuverstehen. Oder spiel mit dem englischen Client, die deutschen Tooltips sind oft fehlerhaft beziehungsweise schwach übersetzt. Wahrscheinlich liegt da unser Problem:\n\nUnique: Instantly heal for 15% of **all physical** damage dealt.\n\nArea of effect **physical damage** only heals 5% for every unit affected.","replies":[{"poster":"Shakês Beer","date":"2016-10-06T13:11:42.530+0000","up_votes":1,"down_votes":0,"body":"Joah, das habe ich mittlerweile auch gemerkt.","replies":[]}]},{"poster":"Bodycounter","date":"2016-10-05T12:43:50.415+0000","up_votes":1,"down_votes":0,"body":"Kurze Liste deiner Verständnisfehler:\n\n* Item wirkt nur bei physischem Schaden --> Kein Spellvamp\n* Die Heilung ist bei AoE (also Darius' Q) **auf** (nicht **um**) 33% **reduziert** --> Seine Hauptfähigkeit in Teamkämpfen\n* 15% des **erlittenen Schadens** wird auf **dich** als DoT umgewandelt --> Der DoT geht nicht auf den Gegner\n* Die Heilung durch deine Blutungen (HoT) ist quasi null mit dem Item --> Außerdem unwahrscheinlich auf allen Gegnern full stacked zu sein\n* Ravenous Hydra baut sowieso keiner auf Darius --> Er heilt sich über sein Q in Verbindung mit Spirit Visage\n\nQuellen:\nhttp://leagueoflegends.wikia.com/wiki/Death's_Dance\nhttp://leagueoflegends.wikia.com/wiki/Area_of_effect","replies":[{"poster":"Shakês Beer","date":"2016-10-05T13:28:41.176+0000","up_votes":1,"down_votes":0,"body":"Umm, dir ist schon klar, dass da steht, dass es Spellvamp HAT. Und das kannst du ja auch eben austesten. Beim rest hast du mir nicht geholfen, das war mir mittlerweile auch klar war. Trotzdem sollte Riot die Beschreibung gefälligst ändern. Es ist verwirrend wenn beim Hextech Gunblade steht: AFlächeneffekte nur so einem Drittel effektiv. Und beim Tanz des Todes: Für Flächeneffekte beträgt die effektivität 33%. Wenn man sich das mit den Satz vorne dran gibt, kann man das schnell miss verstehen. Und btw. zum Thema Hydra: Schneller stacks und eventuell, da musst du mir auch garnix sagen ist mir eh egal, heilung von der Q erhöht.","replies":[]}]},{"poster":"Bodycounter","date":"2016-10-05T09:12:44.869+0000","up_votes":1,"down_votes":0,"body":"Du solltest lesen lernen. Wie kann man die Item-Beschreibung denn so missverstehen O.o\n\nGrundsätzlich sind Black Cleaver **oder** Trinity Force (je nach Konstellation des gegnerischen Teams) in Verbindung mit Steraks ausreichend offensive Gegenstände für Darius. Im späteren Verlauf ist es meist wichtiger, lange überleben zu können, als noch mehr Schaden auszuteilen. Insbesondere musst du erstmal deine 5 Stacks aufbauen, danach ist dein Schaden sowieso sehr hoch im Vergleich zu anderen Toplanern. Daher bietet sich Titanic Hydra eher selten als gutes zusätzliches offensives Item an.","replies":[{"poster":"Shakês Beer","date":"2016-10-05T12:12:24.056+0000","up_votes":1,"down_votes":0,"body":"Du solltest die Kommentare lesen, dort habe ich es erklärt. Lesen ist schwer.","replies":[]}]},{"poster":"Maíko","date":"2016-10-04T14:58:01.587+0000","up_votes":1,"down_votes":0,"body":"Da du ja bereits über die Heilung und den Blutungseffekt, der für dich selber gilt informiert wurdest hier noch ein paar weitere Anmerkungen:\n\nZum Thema CDR:\nMit {{item:3071}}  und {{item:3065}}  kommst du bereits auf 30%...was für einen Darius bereits genug ist.\nAnsonsten sind {{item:3190}}  und {{item:3083}} meiner Meinung nach die besseren Items um auf 40% zu gelangen.\n{{item:3190}} Gibt deinem kompletten Team in Teamfights MR, was für ein AP basiertes Gegnerteam sehr schnell das Aus bedeuten kann.\nMit {{item:3083}} kannst du wesentlich besser Splitpushen....du kannst aggresiv vorgehen und sollten die Gegner dich low poken ziehst du dich kurz zurück und beginnst das Spielchen von vorn.\n\nHeilung solltest du eigentlich auch genug haben....mit der Q kannst du dich eh um bis zu 36% deines fehlenden Lebens heilen, was durch die Mastery Runenrüstung und {{item:3065}}  nochmals um einiges verstärkt wird.\n\nItems die Leben geben sind generell Zucker für Darius.\nJe mehr Leben du hast, desto mehr kannst du verlieren...und die Heilung deiner Q basiert nun mal auf deinem fehlenden Leben.\n\nWenn du aber unbedingt  mehr Schaden haben möchtest, würde ich dir zu {{item:3053}}  oder {{item:3748}} raten.\nMit beiden kriegst du einiges an Leben und beide Skalieren mit deinem maximalen Leben, was den Kauf von weiteren defensiven Items wesentlich effektiver macht als wenn du stattdessen ein {{item:3812}} hättest, welches eher mit weiteren offensiven Items skaliert.","replies":[]},{"poster":"Nycaria","date":"2016-10-04T14:14:07.290+0000","up_votes":1,"down_votes":0,"body":"> eine Hydra, die sowieso fast jeder auf Darius kauft\n\nWut Hydra mit Darius ? Black Cleaver und dann tanky bauen o.o ( http://www.probuilds.net/champions/details/Darius )","replies":[{"poster":"Maíko","date":"2016-10-04T14:37:48.660+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SahashiKaya,realm=EUW,application-id=Wj1wcocU,discussion-id=GPKkPMg4,comment-id=0001,timestamp=2016-10-04T14:14:07.290+0000)\n>\n> Wut Hydra mit Darius ? Black Cleaver und dann tanky bauen o.o ( http://www.probuilds.net/champions/details/Darius )\n\nJe nachdem wie das Spiel läuft ist eine Hydra nicht schlecht.\nSeine Fähigkeiten skalieren sehr gut mit AD und wenn er sich im frühen Spiel einen Vorsprung holt kann er so das Spiel sehr gut Snowballen.\n\nIm normal Fall gebe ich dir jedoch recht, dass Darius Grundwerte stark genug sind um nach BC sofort auf Tankitems zu gehen.","replies":[]}]}]}