{"poster":"Sanchiel","date":"2018-07-30T00:35:29.645+0000","title":"Surrend a 15? Si o No?","subforum":"Discussioni generali","up_votes":5,"down_votes":6,"body":"Buonasera, gioco a LoL da tantissimi anni e, come tutti, ho passato molto tempo nella landa degli evocatori a giocare partite in ranked, normal o qualsiasi altra modalit&agrave; sia stata inserita, anche per breve tempo. Nell&#039;ultimo anno mi sono reso conto che la mia esperienza di gioco &egrave; terribilmente peggiorata da quando &egrave; stata inserita la possibilit&agrave; di arrendersi al 15 minuto. Difatti quando ti trovi a giocare con altri 4 perfetti sconosciuti ( cosa che capita molto spesso in SOLO/DUO) la maggior parte delle partite viene decisa nei primi sei minuti, difatti se per un qualsiasi motivo una o pi&ugrave; lane non vanno in maniera splendida qualcuno finisce per decidere di aver gia perso la partita e scrivere in chat il fatidico &quot;FF 15&quot; (b&egrave; speravo almeno parlassero di final fantasy). Dal quel momento in poi gran parte dei giocatori cala fortemente il proprio atteggiamento nei confronti della partita visto che hanno gia deciso che la partita &egrave; persa. Ancora peggio molto volte un giocatore che magari sta solo 0/2/0 decide che la partita &egrave; persa e va AFK rovinando a tutti il divertimento di giocare.\r\nSpero che capiate cosa vuol dire per una persona sederci al pc, perdere quei 5/10 minuti per iniziare una partita e ritrovarsi a giocare una partita in 10 minuti perch&eacute; qualcuno ha deciso che &egrave; persa. Come vi dicevo giocato da diversi hanno &egrave; questo effetto si sentiva molto meno in partita quando il surrend era semplicemente a 20 minuti. Diversamente giocare con 4 amici in flex rimane una bella esperienza, li si vince o si perde ma lo si decide tutti insieme, il pi&ugrave; delle volte. In quei casi il il surrend a 15 ha un impatto molto meno negativo rispetto alle solo/duo.\r\nForse ho parlato troppo di ranked, ma onestamente trovo che anche in normal l&#039;effetto &egrave; simile ma uno lo prende con pi&ugrave; leggerezza dicendo &quot;infondo questa &egrave; una normal&quot;. \r\nB&egrave; questa &egrave; la mia esperienza &egrave; spero cmq che i Rioter non ignorino la mia voce se pur solitaria. Onestamente sono stanco di stare 10 minuti in lobby per poi guastarmi la mia partita giornaliera giocando solo 5 minuti in preda al nervosismo dovuto da qualcuno che non vuole giocare quella partita e ne vuole fare un&#039;altra, vincere piace a tutti, lo capisco ma questo non dovrebbe rovinare l&#039;esperienza di gioco agli altri.\r\nSpero che almeno qualcuno abbia letto tutto :D Buona notte","replies":[{"poster":"Detective Meow","date":"2018-07-30T10:56:48.860+0000","up_votes":2,"down_votes":0,"body":"1) muta tutti\n2) se ranked(quindi ci stai mettendo impegno) assicurati di pickare qualcosa che SAI di poter stompare ed essere utile durante tutte la fasi della partite\n3) sempre in ranked, prendi le prime kill, chiama il jungler eventualmente, e inizia a gankare le altre lanes e prendere obbiettivi, vedrai che il morale della squadra si risolleverà.\n\nIl punto di tutto questo è che spesso ti ritrovi a fare non solo da giocatore, ma anche da badante a ragazzini frustrati e da psicologo, però carriare games significa anche questo: essere il leader e fare in maniera che le cose vadano per il verso giusto.\n\nBuona fortuna :)","replies":[]},{"poster":"SuraKnight","date":"2018-07-30T09:03:17.849+0000","up_votes":3,"down_votes":1,"body":"Non vedo cosa ci sia di male nel surrendare a 15 visto che tutto il team deve essere d'accordo. Parlando di normal, se la teamcomp nemica, rispetto a quella alleata, scala molto meglio in late game, e ha preso un importante vantaggio iniziale, non puoi certo sperare di recuperare la partita, salvo miracoli. Non ci si diverte a giocare una partita che non può che peggiorare e dunque tanto vale surrendere e startarne un'altra.\nIn ranked invece credo che provarci fino alla fine e sperare in un miracolo sia decisamente meglio.\nNon vedo tutta questa differenza con ff15 di adesso e ff20 di prima, anche perchè non capita spesso di surrendare a 15.","replies":[]},{"poster":"LightIsMyPath","date":"2018-07-31T13:57:29.919+0000","up_votes":1,"down_votes":0,"body":"E' anche vero che questo atteggiamento dipende dal fatto che puoi andare talmente tanto sotto nei primi minuti che miracoli a parte la partita è persa. Quando arrivi al 10 sotto di 2/3k Gold ai nemici tanto vale arrendersi, non si può fare nulla in ogni caso. In alcune partite in cui decidiamo l'ff15 nemmeno ci arriviamo al 15 , abbiamo già la base aperta prima","replies":[]},{"poster":"Sanchiel","date":"2018-07-30T11:59:35.276+0000","up_votes":1,"down_votes":0,"body":"Ho letto degli spunti interessanti. Il problema non è quando il surrend va a buon fine, il problema è che se uno o due giocatori al minuto 5 o 6 decidono che vogliono fare il surrend a 15, giocheranno fino al minuto 15 a perdere, a quel punto se, come sempre, il surrend fallisce la partita spesso va in tragedia con gente che si urla contro in chat o che sta ferma in base o che si fa i gran fatti suoi. Purtroppo non tutti siamo psicologi altrimenti gli manderei sarei felice di perdere ogni partita e mandare loro il mio numero :) \nInizialmente non ci trovavo nulla di male nel surrend a 15 ma mi sono resto conto che ha innescato delle meccaniche mentali nelle persone che hanno già deciso l'esito della partita al minuto 6/8. Vi ricordo che non siamo tutti pro e che quindi non sappiamo se la tua composition scala bene rispetto all'altra, senza contare che dall'altra parte potrebbe esserci chiunque che potrebbe sapere o no come giocare il proprio champ. Questo ultimo fattore immagino cambi salendo di elo.","replies":[{"poster":"SuraKnight","date":"2018-07-30T12:19:59.058+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sanchiel,realm=EUW,application-id=MJVj50Jw,discussion-id=QuZgK6Yp,comment-id=0004,timestamp=2018-07-30T11:59:35.276+0000)\n>\n> Ho letto degli spunti interessanti. Il problema non è quando il surrend va a buon fine, il problema è che se uno o due giocatori al minuto 5 o 6 decidono che vogliono fare il surrend a 15, giocheranno fino al minuto 15 a perdere, a quel punto se, come sempre, il surrend fallisce la partita spesso va in tragedia con gente che si urla contro in chat o che sta ferma in base o che si fa i gran fatti suoi. Purtroppo non tutti siamo psicologi altrimenti gli manderei sarei felice di perdere ogni partita e mandare loro il mio numero :) \n> Inizialmente non ci trovavo nulla di male nel surrend a 15 ma mi sono resto conto che ha innescato delle meccaniche mentali nelle persone che hanno già deciso l&#x27;esito della partita al minuto 6/8. Vi ricordo che non siamo tutti pro e che quindi non sappiamo se la tua composition scala bene rispetto all&#x27;altra, senza contare che dall&#x27;altra parte potrebbe esserci chiunque che potrebbe sapere o no come giocare il proprio champ. Questo ultimo fattore immagino cambi salendo di elo.\n\nA me la situazione non sembra cambiata per quei 5 minuti. Se uno decide di surrenderare che sia a 15 min o a 20 avrá lo stesso atteggiamento. \nPer quanto riguarda le team comp basta conoscere quali sono i campioni che scalano in late e quali no, credo siano le basi del gioco e che chiunque abbia giocato più di 3 game o visto qualche partita competitiva sappia. Le cose da pro sono ben altre xD","replies":[{"poster":"Sanchiel","date":"2018-07-30T12:31:45.080+0000","up_votes":1,"down_votes":1,"body":"Tra il 15 e il 20 non cambia molto è vero, ma tra il 6 e il 15 cambia tutto!\nQuando il surrend era a 20 i giocatori riuscivano a capire abbastanza  bene tra il minuto 15 e 20 l'andamento della partita, adesso questa analisi personale del giocatore viene fatta tra il minuto 6 e il minuto 10. Intanto hai già passato più tempo tra coda pick e start del game che a giocare :) E poi credo che buona parte delle volte sia ancora troppo presto per capire come possa andare la partita. Il surrend a 15 a portato ai giocatori e decretare la fine al minuto 8 :) Ovviamente ci sono delle eccezioni come ci sono anche partite che sono già perse ai pick.","replies":[{"poster":"SuraKnight","date":"2018-07-30T14:38:03.127+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sanchiel,realm=EUW,application-id=MJVj50Jw,discussion-id=QuZgK6Yp,comment-id=000400000000,timestamp=2018-07-30T12:31:45.080+0000)\n>\n> Tra il 15 e il 20 non cambia molto è vero, ma tra il 6 e il 15 cambia tutto!\n> Quando il surrend era a 20 i giocatori riuscivano a capire abbastanza  bene tra il minuto 15 e 20 l&#x27;andamento della partita, adesso questa analisi personale del giocatore viene fatta tra il minuto 6 e il minuto 10. Intanto hai già passato più tempo tra coda pick e start del game che a giocare :) E poi credo che buona parte delle volte sia ancora troppo presto per capire come possa andare la partita. Il surrend a 15 a portato ai giocatori e decretare la fine al minuto 8 :) Ovviamente ci sono delle eccezioni come ci sono anche partite che sono già perse ai pick.\n\nNon so come ragionano gli altri, ma io se surrendo a 15 vedo la situazione al minuto 15 non al minuto 8 xD","replies":[]}]}]}]},{"poster":"Sorcio84","date":"2018-07-30T06:33:03.329+0000","up_votes":1,"down_votes":0,"body":"Trovare un intero team che suka e surrenda è un caso limite, non dovrebbe essere troppo frequente.","replies":[]},{"poster":"Darkinknight","date":"2018-07-30T10:54:36.921+0000","up_votes":2,"down_votes":2,"body":"L'ff 15 è la cosa piu inutile mai inserita,dato che richiede il consenso di 5 su 5. Da quando è stata inserita in piu di 1000 game l'ho visto funzionare 1 sola volta.\nSe uno decide che il game è perso,lo fa a prescindere che possa tentare l'ff(che non otterra mai il consenso di 5 su 5) al 15 o al 20.\nSe i player imparassero a surrendare i game palesemente persi ogni tanto (o se la riot implementasse la maggioranza e non la totalità) si eviterebbe una marea di flame e di frustrazione","replies":[]}]}