{"poster":"Ankylorex","date":"2018-06-13T19:39:19.370+0000","title":"Malphite Rework","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Guten Tag, liebe League Spieler umd Spielerinnen. Ich m&ouml;chte gerne wissen welche Meinungen ihr zu einem Malphite Rework h&auml;ttet. Ich spiele jetzt in letzter Zeit ziemlich oft Malphite umd mir ist aufgefallen, dass nicht nur komplett h&auml;sslich aussieht sondern auch extrem stumpf ist xD. Bitte teilt eure Meinungen. Bin schon sehr gespannt... hiffe wirklich auf ein Rework (da er auch sehr alt ist).\r\nLG Ankylorex","replies":[{"poster":"EinfachBalo","date":"2018-06-14T07:39:30.133+0000","up_votes":2,"down_votes":0,"body":"Mir gefällt Malphite so, wie er ist. Und wenn er auch noch ein Rework bekäme, wäre der letzte gute alte Champ auch gestorben.\n\nIch bin dagegen.\n\nMFG\nEinfachBalo","replies":[]},{"poster":"OPChampsSucks","date":"2018-06-13T23:35:38.247+0000","up_votes":2,"down_votes":0,"body":"rework ? och ne dann haste einen der letzten unberührten champs auch noch vernichtet .\n\nlieber nicht","replies":[]},{"poster":"DieErsteNummer1","date":"2018-06-13T20:16:27.656+0000","up_votes":3,"down_votes":2,"body":"Malphite ist noch einer der letzten Champions die noch nicht zerstört wurden. Wäre gegen ein Rework.","replies":[]},{"poster":"SuckThisFist","date":"2018-06-14T22:47:44.068+0000","up_votes":1,"down_votes":0,"body":"Denke nicht das er bald eins bekommt, seine Pick und Winrate sind ganz solide.\n\nSein Kit ist eigentlich auch in Ordnung, aber ein Visuelles Update könnte er vertragen.","replies":[]},{"poster":"Hakkuu","date":"2018-06-13T19:46:36.467+0000","up_votes":1,"down_votes":0,"body":"Wird früher oder später kommen, aber nicht in naher Zukunft, weil erstmal andere Reworks geplant sind. Namentlich sind das Aatrox, Akali und Nunu. (https://support.riotgames.com/hc/de/articles/202294884-Zeitplan-f%C3%BCr-Champion-Aktualisierungen)\n\nBis das darauffolgende rauskommen wird, wird es wahrscheinlich 2019 sein","replies":[{"poster":"SheenYou","date":"2018-06-13T20:47:07.632+0000","up_votes":1,"down_votes":0,"body":"2019 xD wenn der Aatrox rework fertig ist werden direkt den nächsten würfeln und Malphite ist auch hoch sein kit ist auch sehr alt.","replies":[{"poster":"Hakkuu","date":"2018-06-14T21:12:56.277+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bathomy,realm=EUW,application-id=Wj1wcocU,discussion-id=V0Jd49l6,comment-id=00000001,timestamp=2018-06-13T20:47:07.632+0000)\n>\n> 2019 xD wenn der Aatrox rework fertig ist werden direkt den nächsten würfeln und Malphite ist auch hoch sein kit ist auch sehr alt.\n\nNot sure if trolling or just stupid {{sticker:sg-lux-2}} \n\nDie nächsten 3 Reworks sind schon zu 100% bestätigt. Und wenn man sich anschaut in welchen Abständen Champs gereworked werden, würde ich meine MMR drauf verwetten, dass es nicht mehr dieses Jahr passieren wird. Mach doch einfach die Augen auf und les","replies":[]}]},{"poster":"Ankylorex","date":"2018-06-13T20:02:17.860+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Meinung!","replies":[]}]},{"poster":"mondmann97","date":"2018-06-14T03:00:44.761+0000","up_votes":1,"down_votes":0,"body":"Ich dachte immer das seine Schulter sein Kopf wäre, selbiges dachte pro Yorik rework. Ja sein inGame Skin sieht scheiße aus.\nGameplay technisch finde ich ihn aber \"solide\". Es gibt combos, die Fertigkeiten unterstützen sich gegeneitig und mit der Ult kann man auch viel bewegen.\nSpaß macht er mir persöhnlich nicht, aber das gilt für sehr viele anderen Champions auch^^","replies":[]},{"poster":"Amycos Cyrus","date":"2018-06-13T20:28:35.652+0000","up_votes":1,"down_votes":0,"body":"Ich finde, dass sein Kit recht gut ist, jedoch hätte ich nicht gegen ein visuelles Rework, da er leider nicht mehr (designtechnisch) in das Spiel zu passen scheint.","replies":[]}]}