{"poster":"Dark Zany","date":"2015-12-01T14:45:51.476+0000","title":"Pathing Issues","subforum":"Report a Bug","up_votes":7,"down_votes":0,"body":"There are a few issues I&#039;ve been running into relating to pathing.\r\n\r\n1. I&#039;m not sure if it is just me but minions seem to body block me a LOT more in lane than I&#039;m used to... they didn&#039;t use to form a solid wall before. I used to be able to walk between melee minions or ranged minions but now they stand so close that they are a solid wall.\r\n\r\n2. The newish gateways that we can walk through on the wall of our bases... the ones that don&#039;t allow enemy champions to walk through but allows friendlies through... well these seem to be having some weird issues where when you walk through them directly there is nothing wrong, but when you walk through them at an angle you will do a weird zigzag... that zigzag has gotten me killed many times as I try to run from enemies... I also get some kills there when I camp/siege enemy base as it is super easy to land a stun there because in effect the zigzag movement that the champions have to go through means that they are slowed for a split second allowing the chaser to land their CC. VERY ANNOYING.\r\n\r\n3.  In midlane, there are 2 bushes on either side then there are the two rivers. those two bushes can be warded from on top of the &quot;ledge&quot; ... well from the top side this is fine and it is easy to do so. However when I&#039;m from the bottom side of the map... and I&#039;m trying to ward the &quot;long bush&quot; that separates mid lane from the river with the dragon... and I&#039;m trying to ward it from the ledge on my side, so that I am not face checking the bush... well I have trouble warding there. It creates a major pathing issue where when I try to place my trinket ward there, the pathing forces me to walk ALL THE WAY AROUND the wall and into lane or into river to ward into the bush... I can&#039;t seem to ward the bush from the ledge south of the bush... pathing almost always forces me to walk all the way around... and that&#039;s a real headache, when I KNOW there&#039;s a jungler in that bush... that&#039;s the whole idea of NOT walking into that bush and warding it from the ledge... so that&#039;s a pain and I hate mid laning from the bottom side of the map as a result since top side mid laner can ward both sides with no problems from behind the ledge/wall but bottom has pathing issues that force me to walk around.","replies":[{"poster":"TheSeltzerBaron","date":"2015-12-02T03:39:47.493+0000","up_votes":1,"down_votes":0,"body":"The pathfinding is markedly worse than it was before the patch although it does do the same stupid things it did before. There are times where I will click to the left or right relative to my character and they move in the absolute opposite direction. I've been killed many times because I clicked one direction and the champ went another. Unit collision is almost hilarious in how bad it is. I got stuck on a minion and a broken turret and my champ just stood there jerking back and forth rapidly. It's horrible.\n\nWhen I click left, I want my champ to go left or not go at all, When I click right, I want my champ to go right or not at all. Get what I mean? Clicking should at least optionally define where the champ should move to in a straight line. For as often as players click I think they can figure out how to steer their champs without an algorithm trying to think for them.","replies":[]},{"poster":"moonstones","date":"2015-12-01T22:50:46.695+0000","up_votes":1,"down_votes":0,"body":"Hey Dark Zany! \n\nWe've heard your feedback, as well as others regarding the pathing issues! Riot Reinboom wrote up a [post](http://boards.na.leagueoflegends.com/en/c/developer-corner/EWLnAleN-follow-up-pathing-aka-minion-blocking-update) regarding the changes being made. Hope this clears some things up!","replies":[]},{"poster":"LOL Spammer","date":"2015-12-01T20:57:55.232+0000","up_votes":1,"down_votes":0,"body":"It has to do with the fact that they changed the code this year to try to improve pathing but it was a failure and ended up just making it worse. I have a feeling eventually they will go back to the old code.","replies":[]},{"poster":"Methode","date":"2015-12-01T19:39:35.099+0000","up_votes":1,"down_votes":0,"body":"I have been having issues with that too, missing cs because my champion wants to autopath around minions randomly","replies":[]},{"poster":"FarRockBF","date":"2015-12-01T16:00:34.860+0000","up_votes":1,"down_votes":0,"body":"I made a similar thread and it was deleted for not being in the GAMEPLAY section.\n\nGo Rito!","replies":[]},{"poster":"Gesteppie","date":"2015-12-01T15:42:22.489+0000","up_votes":1,"down_votes":0,"body":"The first one is due to the fact champions no longer have a \"buffer\" zone around them. They used to have a %15 collision buffer around them. This is why minions seems to be making more of these impregnable walls. \n\nThe second one, I experience it all the time, and it has killed me many a time too -_-","replies":[]}]}