{"poster":"AdamWest","date":"2016-02-25T23:02:46.110+0000","title":"Perfektes Nami Build für SoloQ","subforum":"Champions & Gameplay","up_votes":2,"down_votes":9,"body":"Yo, yo also Masteries nat&uuml;rrlich 0/21/9 sch&ouml;n die mana reg perks mitnehmen, und den heal buff am Ende. Runen, ja die Runenfrage... meine is im Moment Rot: Magic/Armor Pen (variable: Magic Pen w&auml;re wohl auch ok), Gelb: HP pro Lvl (sollte schon sein), Blau: Mana Reg per Lvl (variable: Mana Reg Fix geht auch) Siegel: Im moment Magic Pen (Wenn vorher auf Magic Pen geht kann man wahrscheinlich auch 2 Siegel variabel halten).\r\n\r\nSkills: h&ouml;chste Priorit&auml;t = Heal, moderate Priorit&auml;t: Bubble oder Buff (Der Buff ist aber schon hilfreicher)\r\nStart Item: 4x Feenamulet oder wie die Dinger heissen...\r\nCore Build: Die Weihrauchschleuder, Kelche, Boots...\r\n\r\nF&uuml;r mehr Vision kann man noch das Augenitem dazwischen schieben, mehr Leben ist immer gut...\r\nWorum gehts?\r\nNaja ganz einfach... Nami geh&ouml;rt zu den 4 Support Champs mit der h&ouml;chsten Mana Reg aller Champs. Und mit den Runen, Mastery + Items hat sie eine Mana Reg von &uuml;ber 4,2... mit Flat Mana Reg Blues kommt man wahrscheinlich auf &uuml;ber 5,.... Somit kann man fast non stop sein Ding durchziehen. Euer ADC kann nicht dodgen? Kein Problem, neverending Heals, fast zumindest... Durch den Kelch und die Weihrauchschleuder werdet ihr nie oom sein. Viel habt ihr auch zu bieten, eure Heals und Buffs werden eure Teammates schneller machen, ihnen einen slow gew&auml;hren, ihre magic und armor res erh&ouml;hen, sie heilen, theoretisch ihren Attackspeed um 15% erh&ouml;hen und 30 Magic Dmg pro AA f&uuml;r 6 Sek. Durch den H&uuml;pfheal das ganze auf bis zu 3 Teammates dazu nen 4ten durch den Buff und das ganze Team ist versorgt. Garnicht mal so schlecht wenn euer Team gut ist. SoloQpech wenn ihr ein schlechtes erwischt, shit happens... und CC hat sie auch ;)\r\n\r\nDeswegen naja... in der SoloQ kann man sie wohl kaum effektiver spielen, deswegen siehe &Uuml;berschrift und so...","replies":[{"poster":"Spicavius","date":"2016-02-25T23:44:54.810+0000","up_votes":2,"down_votes":0,"body":"Rote Runen: Hybrid Pen\nGelbe Runen: Leben Flat\nBlaue Runen: Manareg flat (würde ich sagen^^)\nLila Runen(Essenzen): Rüstung Flat\n\n{{item:3303}} + {{item:2031}} +{{item:3340}}   (Btw was zum Henker ist das für ein Item? {{item:3460}} {{item:3461}}  \"Goldene Überlegenheit\"  \"Nutze dieses Schmuckstück um dich zu einer der Kampfplattformen zu teleportieren. Kann nur von der Beschwörerplattform benutzt werden.\" Habe noch nie von diesem Item und dem Effekt gehört. O.o  )\n\nals Item würde ich ungefähr diese ITems kaufen.  {{item:3098}} {{item:2049}} {{item:3117}} {{item:3050}} ({{item:3190}} oder {{item:3504}} oder {{item:3222}}  meistens passt aber eher {{item:3222}}  oder {{item:3190}} besser ins Team als {{item:3504}} ) und natürlich {{item:3341}} .\n\n{{item:3098}}  würde ich zu {{item:3092}}  aus bauen, wenn ich {{item:3050}}  habe.  {{item:2049}}  baue ich immer als letztes zu {{item:2045}}  aus, wenn ich gerade Gold übrig habe oder über biegen und brechen mehr Leben haben **muss**\n\nAlso würde das Fullbiuld bei mir in den meisten Spielen so aussehen.\n{{item:3092}} {{item:2045}} {{item:3050}} {{item:3222}} {{item:3190}} {{item:3117}} {{item:3341}} \n\nIn diesem Itembiuld ist im Grunde alles enthalten.  Rüstung, Fähigkeitsstärke, Magieresistenz, Leben, Manareg ohne Ende und extrem viel Utility für den ADC / für das Team.","replies":[{"poster":"Sirrkas","date":"2016-02-26T20:10:42.699+0000","up_votes":1,"down_votes":0,"body":"{{item:3460}} \nWar das Trinket für Ascencion/Aufstieg. Der Spielmodus auf Dominion, bevor Azir erschien. Der äußere Ring war nicht betretbar, stattdessen hat man sich mit dem Trinket auf eine von 3 Platformen (die auf Dominion einzunehmenden Türme) teleportiert.","replies":[]}]},{"poster":"Alustus","date":"2016-02-25T23:35:35.408+0000","up_votes":2,"down_votes":0,"body":"{{item:2045}} {{item:3092}}  sind pflicht, der rest wird situationsbedingt gekauft je nachdem wie das Spiel verläuft und was man braucht.\n\n({{item:3060}} ,{{item:3190}} ,{{item:3009}} ,{{item:3158}} ,{{item:3222}} ,{{item:3050}} ,{{item:3143}} {{item:3110}} )\n\nzum thema skills, ist auch komplett matcup ahängig und Spielstil\n\n> Yo, yo also Masteries natürrlich 0/21/9\n\nmeinst wohl 0/18/12 wäre mir neu das man wieder 21 punkte in einen tree machen kann.","replies":[]},{"poster":"AdamWest","date":"2016-02-26T18:49:50.469+0000","up_votes":1,"down_votes":1,"body":"Naja einige scheinen hier überlesen zu haben das sich um SoloQ, also nix mit ranked handelt... ;)\nWozu Goldregenation? Wenn mein ADC durch meinen perma support seine kills hollt habe ich meine Goldgeneration.\nVision ist zwar nett aber in SoloQ haben taktische items mehr wumms als strategische, meiner Meinung nach...\nAnstatt zu meckern einfach mal ausprobieren... Rüstungssiegel sind dabei auch ok... der fokus liegt sowieso eher auf der manareg.\nSeitdem ich Nami so spiele bekomme ich von meinem carry schon ziemlich oft eine teamplayehrung.\nAm Anfang schreiben viele... was zum teufel ist das den für ein build, troll oder was? Aber dann geben sie doch zu das, dass es garnichtmal so schlecht ist wenn man sie dann anschreibt. \nNami ist eine Meerjungfrau oder sowas in der Art also halb humanoid und halb fisch und fische schwimmen und bewegen sich und dass sollte auch Nami tun sie ist einfach ein pewpew char und das geht nur wenn man mana hat, yeehaa...\n\nvielleicht unranked, aber schon seit der open beta dabei ;) ","replies":[{"poster":"Sirrkas","date":"2016-02-26T20:12:09.863+0000","up_votes":1,"down_votes":0,"body":"Soloqueue ist, wenn man alleine Rankeds spielt.","replies":[]}]},{"poster":"Sirrkas","date":"2016-02-26T20:06:49.535+0000","up_votes":1,"down_votes":0,"body":"Da ist so viel falsch, ich weiß gar nicht wo ich anfangen soll. Ich glaube erstmal an den Basics. Nami kann nicht 3 Teammates heilen. Sie heilt maximal 2 Teammates und verletzt einen Gegner.\n\nDie Magicpen brauchst du nicht, wenn du die anderen Buffen willst. Vor allem nicht, weil der E die Verbündeten Magieschaden verursachen lässt und deshalb deine MPen ignoriert. \n\nWenn du deinen Heal erhöhen willst, wären AP viel besser, da der W gleich 2 AP-Skallierungen hat. Einmal für Schaden/Heilung und einmal für den Abzug, der mit steigenden AP abnimmt und sogar positiv werden kann. \n\nZudem würde kein anständiger Support ohne Golditem auf die Lane gehen und den Sightstone ignorieren.","replies":[]},{"poster":"Wolkenfuß","date":"2016-02-26T15:23:52.750+0000","up_votes":1,"down_votes":0,"body":"{{item:3092}} {{item:2045}} {{item:1327}} {{item:3222}}  und jeh nach dem was anliegt {{item:3050}} ,{{item:3143}} oder{{item:3105}} ,{{item:3110}}.\nIch spiele fast nur Nami. runen habe ich movemend speed 2 mal 1 mal ap, amor, magic resist, und leben. \nwenn mein adc nichts kann, kann ich trozdem die botlane gut alleine carryn.Hab von b4 bis g5 fast nur nami gespielt. Kannst ja mal auf mein Profil schauen. Ich hab extra 2 runen seiten nur für sie. Und nein er ist nicht bronze XD ich hab nachgeschaut er ist unranked ","replies":[]},{"poster":"ok muted","date":"2016-02-26T00:17:13.871+0000","up_votes":1,"down_votes":0,"body":"Geht doch einfach auf Probuilds und schaut nach =DD","replies":[]},{"poster":"Bemte","date":"2016-02-26T00:06:34.560+0000","up_votes":1,"down_votes":0,"body":"@Adam: und damit kommst du tatsächlich klar? Du hast keine Goldgeneration wenn du mit 4x Amulett startest.\nDu hast keinerlei Deff in deinen Runen, gehst also extrem schnell down.\nAußerdem: wie willst du den Heal auf 3 Mates kriegen? Hast du dir schonmal durchgelesen, wie der springt?^^\nWenn du Dauerheal willst, solltest du eher Soraka oder vllt. sogar Sona spielen, die können tatsächlich ordentlich heilen. Aber Nami kann höchstens zwei aus dem Team heilen, und auch das nur falls die gerade beide neben einem Gegner stehen.\nAlso wenn du damit tatsächlich gute Erfolge im Ranked hast wundert mich das...","replies":[]},{"poster":"LordOfHell90","date":"2016-02-26T00:40:33.687+0000","up_votes":1,"down_votes":1,"body":"Wenn dass das perfekte Namibuild ist, fressen ich meine Tastatur","replies":[]},{"poster":"Chri","date":"2016-02-26T08:19:26.790+0000","up_votes":1,"down_votes":3,"body":"xD der typ is einfach genial  mastery 0/21/9 is das season 5 oder was\n\nbesser bronze5 namis build soory aber das is echt schrott ","replies":[]}]}