{"poster":"Caosu","date":"2016-04-17T03:24:22.270+0000","title":"Este mensaje va para todo invocador que alguna vez flammeo.","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":0,"body":"Hoy tuve una mala partida, muy mala dir&iacute;a yo, quien quiera es bienvenido a ver mi historial no me importa, pero lo que quiero dar es un consejo de vida. Si ves que tu aliado esta siendo campeado y stompeado, &iquest;no podrias en vez de flammearlo hacer roaming? &iquest;gankearlo? &iquest;poner algun centinela para que pueda ver de antemano que le van uno o varios enemigos? La gente del elo en el que me encuentro (oro) se cree superior, pero no es m&aacute;s que igual que los platas en forma de pensar, ven m&aacute;s importante el score que objetivos, y aun as&iacute; ans&iacute;an llegar a challenger, yo me pregunto, &iquest;Pueden llegar a challenger si se centran en criticar a los dem&aacute;s y no mirar sus errores, en flammear antes que ayudar, en hacer de esta comunidad una mierda (que por cierto ya lo es) antes que tratar de cambiarla por dentro de a poquito? Si realmente ans&iacute;an llegar al high elo entonces miren gu&iacute;as, streams, pidan consejos a pros por twitter, practiquen mucho, despu&eacute;s de cada partida miren sus errores con Lolreplay (si es que sigue existiendo, si no grabenlas con algun programa y verifiquen sus errores de cualquier manera). aprendan de como juegan los dem&aacute;s, no se crean el n&uacute;mero uno, simplemente creanse igual al oponente y demuestrense a si mismo que pueden ganarle, no infravaloren a nadie, porque cualquiera los puede superar con el correr del tiempo. Pero lo m&aacute;s importante, para no flammear a nadie es no tener espectativas, no esperes que tu team juegue bien porque te puede defraudar. \r\n\r\nAntes de entrar en cola piensen bien como comportarse antes una persona que feedeo, &iquest;realmente vale la pena flammearlo para que su desempe&ntilde;o baje? &iquest;o es mejor apoyarlo, ayudarlo y lograr que la partida se de vuelta? Despu&eacute;s de haber le&iacute;do esto est&aacute; en sus manos seguir flammeando o parar de flammear para hacer que tu meta del high elo se encuentre m&aacute;s cerca de t&iacute;.","replies":[{"poster":"Gig GOD OF DEATH","date":"2016-04-17T05:56:59.701+0000","up_votes":3,"down_votes":0,"body":"Al que empieza a **flamear** o dice cosas inapropiadas siempre lo muteo, si me toca de nuevo ese jugador o si la toxicidad ha sido alta sera blockeado, si no estoy en promo, me salgo, esto se hace como dijiste vos por la **baja del desempeño y las ganas de jugar, que generan los insultos y la actitud negativa in-game, por mas que el flameo no sea a ti**, y la persona que flamee sea la mejor de ese game o la peor justificándose porque no lo gankearon que puede ser verdad o no, por mas que intente proteger diciendo **\"deja de buscar el error del otro no lograras nada - Si insultar lo único que lograras sera que bajen los ánimos de jugar\"** entienden o no cambian.\n\n**Puede que sean mejor jugadores algunos, pero tu querido amigo mio eres mejor persona eso es lo importante, por mas que ganes o pierdas te soportaste a esa persona, haciéndolo entender o ignorándola, respetando a tus compañeros y llevándolos a la merecida victoria o derrota.**\n\n>Dos de mis errores era decir insultos leves (era muy difícil provocarme como para insultar, igual de seguro alguno lo habré flameado por sacarme de quicio pero no por jugabilidad sino por insultar o buscar el error constantemente, pero de seguro lo habré insultado como un campeón eso si) y el molesto gg ez/easy que se considera como conducta antideportiva/actitud negativa en 2014 también sin embargo cambie y continuaron insultos leves, eso significa que era una toxicidad leve-media o media ¿a quien quiere que le digan eso? continuaron los insultos pero a partir de principio de año del 2015 se acabo.\n\n**A medida que va pasando el tiempo los jugadores cambian pero los que no cambian ese tipo de conducta a la larga sufren consecuencias, sinceramente ya me da igual lo que digan, la única razón por la que interfiero es para que mi equipo para que no se pongan a desperdiciar tiempo escribiendo, peleándose entre si, bajando lo mencionado anteriormente al principio y buscando errores no de forma constructiva, llevándonos a la derrota.**\n\n**Recuerden los enemigos están del otro lado**, pero ayer me toco una Annie que le daban todos los stuns y nos insultaba siendo de nuestro equipo, le dije \"Gracias por tu opinión\" ¿que pensaste?** insultando se pierde mas de lo que se gana **no le iba a decir lo del pergamino de Ryze, aparte me da risa, te tiene que dar igual la victoria o derrota, la tenes que pasar bien sino tomate receso/pausa de este juego de 2 meses para volver a disfrutarlo antes que flamear.\n\nLobo: Insultos, insultos bli bla bluh\nOveja: El Bardo y Annie hacen un Bar-nie... \nLobo: ¡Los chistes arruinan la caza!\nOveja: Caza y mutea todo lo que apetezca...\n\nPD: Marque para que lean lo mas importante.\n\nATTE Gig G.O.D","replies":[]},{"poster":"Jeremías 17 5","date":"2016-04-17T04:01:50.125+0000","up_votes":3,"down_votes":0,"body":"Lo que hago jugando jg, por ejemplo, es cuando voy a una linea (top, mid o bot), después de gankear dejo un ward o hago el cangrejo, así dejo un poco de visión en el rió y posiblemente evitar un gank del jg enemigo. Después que mi team sea listo o no para aprovechar esa visión, es problema de ellos. Lo mismo cuando juego supp, trato de wardear la jg del enemigo, y así tener visión global de donde esta el jg enemigo, evitando un gank en bot o sacandole presión a los laners para hacer un all-in. Como Top laner, siempre pido un deep ward  (ward en el bush mas alejado de nuestra torre) en bot así poder hacer un tp en la espalda de los enemigos. Entre otras cosa.\n\nHace 2 años deje de jugar porque ya me ponía mal jugando (era bastante mas competitivo en general que ahora), ahora 2 años después me hago menos problemas por un juego. Al final de la partida, reporto a quien tenga que reportar y listo, aunque aun me encabrono un poco, mas que nada con los trolls. Pero si, es mejor tratar de ayudar que insultar. Por ejemplo, me toco un vs en top contra Graves, yo siendo Fizz,  como veía complicada la linea jugaba safe y le pedía ayudar al laner, caso que me fedie y pude ayudar a otras lineas a stompear. Insultar a tu jg porque no te gankea, o a tu mid porque murió, o a la bot por perder la linea, etc no sirve de nada, no los ayudas sino todo lo contrario, los llegas a poner mas nervioso y terminan jugando peor.","replies":[]},{"poster":"Silver000","date":"2016-04-17T03:35:28.682+0000","up_votes":2,"down_votes":0,"body":"yo solo puedo pensar \"no hay necesidad de flamear\"","replies":[{"poster":"Caosu","date":"2016-04-17T03:39:14.658+0000","up_votes":1,"down_votes":0,"body":"está perfecto lo que dices pero y si en vez de pensar \"no hay necesidad de flammear\" pensas \"Le está llendo mal tengo que ayudarlo capaz que mejora y podemos ganar\"","replies":[{"poster":"Silver000","date":"2016-04-17T03:54:40.397+0000","up_votes":1,"down_votes":0,"body":"no, eso es lo que pienso cuando me flamean a mí, siendo el caso (muy raro cabe aclarar) de que no sea yo al que le esta yendo muy mal o no me daria cuenta o ayudaria en lo que se que no empeoraria la situacion (osea no mucho)","replies":[]}]}]},{"poster":"Beonor","date":"2016-04-29T15:58:51.726+0000","up_votes":1,"down_votes":0,"body":"Hola, yo también subi a oro hace poco (lo era la season pasada),y me costó bastante volver jeje.. para mi sorpresa, me encontré con jugadores con un escaso nivel de razonamiento, a comparación de los que me crucé desde plata, que pareciera que jugaran con mas ganas de ganar. Lo que me encuentro, son \"personas\" con alto grado de soverbia, es más, juego duo con un amigo con el cual hablamos de la \"maldicion del platino\", en varias partidas nos meten un platino, que suele ser el que mas trolea.. si no le gusta alguna jugada que hiciste o un item que armaste, se va afk, juro que hace unos días, el platino que nos tocó, se fue afk porque el mid ayudandolo a sacar el red, sin querer se lo robó. Es cierto lo que decís de que te flamean por todo, están gankeando de a 3 en tu linea, e inevitablemente moris, porque te cae un tf, un malph y un voli.. te rajan a puteadas y cuando preguntas porque no ayudan entonces te responden: compra wards...\nLamentablemente la unica solucion es jugar con 4 premades más.. cuesta conseguirlos pero es la unica solucion viable que veo.. jugar con amigos de confianza, que si perdes te chupa un huevo..","replies":[]},{"poster":"Sakura Star","date":"2016-04-18T10:56:56.540+0000","up_votes":1,"down_votes":0,"body":"Intento pero a veces me es inevitable y mas cuando me tocan 4 -1 chilenos encima que comienzan a escribir de una manera que parece que en su vida fueron al colegio(lol y me trage los puntos aproposito).\nIntento no hacerlo, pero a veces me mata...\nAunque de ves en cuando mandar al corno a alguien cuando venis frustrado y este tiene ganas de pelear, mal no viene...\nNah pero ya evito directamente bloquearlos y mas cuando arrancan con el :V en el texto de lo que dicen....\n{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Næstum Dauður","date":"2016-04-17T18:13:09.163+0000","up_votes":1,"down_votes":0,"body":"La wea {{champion:17}}","replies":[]},{"poster":"ZperKS","date":"2016-04-17T05:39:35.900+0000","up_votes":1,"down_votes":0,"body":"a mi me flammearon por ser argentino en una partida lleno de chilenos. Es un cancer esta comunidad...","replies":[{"poster":"kriosensei","date":"2016-04-17T07:28:54.946+0000","up_votes":1,"down_votes":0,"body":"También pasa al revés, se ve continuamente esa rivalidad, que a mi parecer, es sin sentido, ¿por qué no podemos tener un juego limpio? hay que cambiar la forma de pensar de la gente, no buscar el error, buscar el cómo ayudar.{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"juaxon133","date":"2016-04-17T04:27:39.433+0000","up_votes":1,"down_votes":0,"body":"Estoy totalmente de acuerdo flamer no sirve de nada, te enojas vos y haces que tu equipo se desconsentre lo mejor si ves que le esta yendo mal o te esta yendo mal a ti solo muteas a todos y juegas calmado sirve mucho :P`{{champion:32}} {{summoner:11}} {{item:3116}}","replies":[]},{"poster":"Mrainofshadow","date":"2016-04-17T03:43:56.965+0000","up_votes":1,"down_votes":0,"body":"Caosu Sempai","replies":[{"poster":"Caosu","date":"2016-04-17T03:48:31.360+0000","up_votes":1,"down_votes":0,"body":"no lo hago solo por mí, lo hago por todos <3","replies":[]}]}]}