{"poster":"FNC Sneaky","date":"2014-07-27T05:41:05.721+0000","title":"Lulu, Nami, or zyra for a support against morg (my main)","subforum":"Champions & Skins","up_votes":2,"down_votes":0,"body":"I need help deciding on a new support. Its pretty much come down to these three. i would add braum but his ban rate is 2 high and im mainly getting this new support to play against morgana when i cant play her\r\n\r\n                           Add me on league is you have any tips after you post\r\n                                                                                 -Zexy Killah","replies":[{"poster":"NUT IN ME PLEASE","date":"2014-07-27T16:47:14.428+0000","up_votes":2,"down_votes":0,"body":"{{champion:117}} Lulu right now is an okish spot, her mana costs are deadly  and she has crap sustain (potions) and shes viable for a niche pick, such as thresh. Her disengages are good atm, I'll recommend her to you if you need/want somebody who doesn't want to fight and/or need a poke champ.\n**PROS**: Hella Poke, much disengages. Has a shield and cc with Q, W, and ULT and a health restore with her ultimate.\n**CONS**: Hella mana costs. No sustain.\n**TYPE OF LANE**: Poke, Protect the ADC, Disengage.\n**WHAT I BUILD THAT WORKS**: Frostfang (DONT UPGRADE. KEEP IT FOR THE EXTRA GOLD INCOME.)>Sighstone>Mobiity boots>Athenes >Void Staff>Locket of the I.Solari>Banner of Command/Morello/Frozen heart. Sell Frostfang to buy ascension. If game is long build AP.\n**MAX ABILITIES**: Max Q for the poke, or E if you need to protect yourselves. W next for the longer duration in disablement. E next. Put points in R whenever you can. *Note is works best for support Lulu\n.*\n{{champion:267}} Nami is pretty strong right now, I use her but shes getting nerfs on pbe hence why shes good. She has a stun, heal, poke, and hard/soft cc. She has mana problems, but buy a tear and you'll be set. I would prefer her if you need an all around support.\n**PROS**: Has hard/soft cc in form of Q, E, and ult. Has a heal. Also can poke quite well, but not as good as others. At level 6 you can become a kill lane to some extent.\n**CONS**: Her mana costs are high early. She is a jack of all trades, master of none. Her Q stun is somewhat hard to land if you don't play her often. Ult and Q are deceiving.\n**TYPE OF LANE**: \"Poke\", Protect the ADC, \"Kill\", \"Heal\", Disengage.\n**WHAT I BUILD THAT WORKS**: Frostfang (DONT UPGRADE. KEEP IT FOR THE EXTRA GOLD INCOME.)>Tear> Sightstone,> Mobility Boost>A. Staff>Frozen Heart>Locket of the Iron Solari. Sell Frostfang and buy Ascension. If the game is long, buy Iceborn Gauntlet and sell it from Frozen Heart. \n**MAX ABILITIES**: I like to max W for the heal and poke, but you need mana for that. You can max E next if you want to have alot of poke and cc and not fear death. Max E/W next. Then Q because her Q isn't worth putting points in so early. Put points in ult whenever you can. \n\n{{champion:143}} Zyra is also strong, she has hella poke, and she has great kill potential with her snares of death. She can disengage pretty well if you know how to use her ult and plants correctly. She basically has no mana problems if you poke with your plants and you have a spellthief. The only downside is she is hella slow and getting caught will end you. Her health is lacking. So if you want to get her i would recommend getting an early sightstone. Poke with her plants early.\n**PROS**: POKE. I CANT STRESS THIS SHE HAS POKE FOR DAYS. Somewhat ok disengages that takes skill/knowledge of her plants and ult. She can become a kill lane as well her E.\n**CONS**: Squishy. Somewhat difficult if you don't know her. Slow movement speed. Mana costs are high if you spam abilities, not plants. No sustain.\n**TYPE OF LANE**: Poke. Kill. \"Protect the ADC\".\n**WHAT I BUILD THAT WORKS**: Frostfang (DONT UPGRADE. KEEP IT FOR THE EXTRA GOLD INCOME.). Sighstone>Chalice>Swiftness Boots>Haunting Guise>Athenes>Ryalis>Torment. Sell Frostfang for Ascension. If the game is long I suggest building AP.\n**MAX ABILITIES**: I like to max my E for the longer snare duration. Then my plants for cdr, and then my Q. Put points in ult whenever possible. *Note this works best for support Zyra*.","replies":[{"poster":"FNC Sneaky","date":"2014-07-27T20:12:25.942+0000","up_votes":1,"down_votes":0,"body":"Thanks this way pretty helpful.","replies":[{"poster":"NUT IN ME PLEASE","date":"2014-07-27T20:44:10.910+0000","up_votes":1,"down_votes":0,"body":"Cool! Glad I could help. I main support, sooo...yeah lol. Have you found one you liked yet?","replies":[{"poster":"FNC Sneaky","date":"2014-07-28T17:35:32.089+0000","up_votes":2,"down_votes":0,"body":"Nami... shes freaking great","replies":[{"poster":"moonstones","date":"2014-07-28T19:00:49.302+0000","up_votes":1,"down_votes":1,"body":"These are all really good points. \n\nI actually main Nami support right now. Her heal is great because it does damage, and can bounce back to heal. One thing to note ~ she does become less successful, imo, if you're not able to land the bubbles. It takes a bit of getting used to. I tend to build her a bit differently than most. Then again, I tend to build my supports AP. >__> I agree with Frostfang / Sightstone. I tend to grab Liandry's a lot with her. Again, it's more of my play style, but of course, build to suit your team. Most people I play with are used to me not going 'convential build' support, haha.\n\nZyra is a close second for me. She's got some awesome CC, and her poke is amazing. She's a little more intricate, but nothing that can't be picked up after a game or two.","replies":[{"poster":"NUT IN ME PLEASE","date":"2014-07-29T03:00:44.870+0000","up_votes":1,"down_votes":0,"body":"{{item:3151}}? That works? And in what situations would you pick it up. .-.","replies":[{"poster":"Hyrum Graff","date":"2014-07-29T18:45:20.614+0000","up_votes":1,"down_votes":0,"body":"Liandry is great for poke supports, since it deals appreciable damage even if you have no other AP items :D","replies":[]},{"poster":"FNC Sneaky","date":"2014-07-29T03:33:54.311+0000","up_votes":1,"down_votes":0,"body":"i have liked that item on her alot. I like the ap build more on supports also","replies":[]}]}]}]}]}]},{"poster":"Hyrum Graff","date":"2014-07-29T18:44:20.398+0000","up_votes":1,"down_votes":0,"body":"I agree with your analysis, but not your builds :P","replies":[]}]},{"poster":"Zarkkast","date":"2014-07-27T05:46:49.218+0000","up_votes":1,"down_votes":0,"body":"Karma.","replies":[{"poster":"FNC Sneaky","date":"2014-07-27T05:53:09.898+0000","up_votes":1,"down_votes":0,"body":"What makes u pick her over the other three. Ive seen her game play and it seems if u miss a q you can lose fights easy","replies":[{"poster":"Zarkkast","date":"2014-07-27T05:58:20.857+0000","up_votes":1,"down_votes":0,"body":"Se offers a lot of harass while the others not so much (Lulu, maybe). With Nami and Zyra it's pretty easy to get countered by Morgana cause of the spell shield, Karma doesn't rely on the cc to be a good support and she can harass like no other support can. Morgana doesn't offer sustain to her adc like many other supports do and her spellshield has a really long cooldown, if you manage to go aggressive denying the enemy farm and poke a lot (making sure to ward and not to get binded) you'll win the lane and Karma's the best for that in my opinion. She also has a slow and a speed boost in case Morgana tries to go balls deep and ult. I guess you could go with Lulu, but Karma offers more (pre 6 at least) than Lulu.","replies":[{"poster":"FNC Sneaky","date":"2014-07-27T06:01:39.438+0000","up_votes":1,"down_votes":0,"body":"Any build tips or anything you have on her. Or like  a pro to watch to check out how they play her. i like that she has poke because thats really useful throughout the laning phase, but does she maintain into the mid/late game?","replies":[{"poster":"Zarkkast","date":"2014-07-27T06:05:52.167+0000","up_votes":1,"down_votes":0,"body":"Well, there's this: http://www.lolking.net/guides/134927 \n\nI suggesting looking for more guides on Lolking, Mobafire and such.\n\nhttps://www.youtube.com/watch?v=bMIsUHJ7w9I\n\nShe definitely maintains her poke depending how you build her. She probably the support that offers the highest dps.","replies":[{"poster":"FNC Sneaky","date":"2014-07-27T06:06:45.786+0000","up_votes":1,"down_votes":0,"body":"thanks!","replies":[{"poster":"Hyrum Graff","date":"2014-07-29T18:53:02.943+0000","up_votes":1,"down_votes":0,"body":"Karma main here. Add me in client and I can talk builds and stuff.\n\nMorgana is still one of the more annoying supports for me to face, but that's just because I'm really good at getting hit by Q's (same with TF's Q).\n\nIf, unlike me, you *can* dodge her q, Karma is a good counter to morg because, unless you're super far behind, her q wipes out morg's shield in pretty much one hit, so you can q-w and still root morg or her adc, even if she shields. Your shield also helps you avoid q's, or survive if you get hit by one. You can also use q to harass from a distance where you have plenty of time to see Q's coming and react (unless you're me, in which case you react by walking into them).","replies":[]}]}]}]}]}]}]},{"poster":"Serpents Embrace","date":"2014-07-27T08:27:38.255+0000","up_votes":1,"down_votes":0,"body":"Lulu support is suffering right now because of the nerfs to solo lane Lulu, so I'd avoid it until it gets addressed. She has good poke but no sustain and is easily bursted if snared while poking.\n\nNami is pretty okay against Morgana, but not amazing. Morg E can nullify her Q's primary targets, but Nami's AoE CC means Morgana can't shield everyone on her team.  Her passive kind of helps dodging Qs, also, but not by much.\n\nZyra would probably be my suggestion against Morg of those given. Her ultimate is an amazing counter-initiate, so if Morgana tries to use her ultimate she's putting herself at a lot of risk. She could use shield on herself, but the knock-up would get her allies. She could shield the ADC or her teams main DPS/assassin but then anyone she fails to stun could swoop in to kill them while the rest of the team is disabled. And high magic damage poke in lane can remove a black shield before you lay out a snare, assuming Morgana isn't leveling it.\n\nMy best success against Morgana in lane has been Soraka. If Morgana does land a snare and you're not too out of position her W heals for a lot and the armor bonus will mitigate the enemy ADC's follow up. Additionally, she can silence caster ADCs when Morgana does land a snare to avoid a lot of damage, or she can silence Morgana while she's getting in to position to snare. But then in team fights Morgana is more effective than Soraka so it's a mixed bag also.","replies":[{"poster":"FNC Sneaky","date":"2014-07-27T20:13:18.666+0000","up_votes":1,"down_votes":0,"body":"I think ive narrowed it down to zyra or nami but ill have to try soraka sometime. i own her and shes not to hard to play","replies":[{"poster":"Serpents Embrace","date":"2014-07-27T23:40:18.035+0000","up_votes":1,"down_votes":0,"body":"I think it'd be worth a shot, I've had a pretty easy time with her versus Morgana in lane.\n\nI think the only issue is that over-all Soraka isn't very strong and she's not capable of making plays. So you might want to make sure that you already have a strong initiator on your team when you pick her, since you won't be able to start fights like most other supports would.","replies":[{"poster":"Hyrum Graff","date":"2014-07-29T18:47:34.323+0000","up_votes":1,"down_votes":0,"body":"IMO, soraka's so weak right now, she's not worth playing at all.","replies":[]}]}]}]},{"poster":"GildedCreed","date":"2014-07-29T03:35:08.204+0000","up_votes":1,"down_votes":0,"body":"I use {{champion:412}}  against {{champion:25}} . It's simple really. You play mind games with his Q. Because of how it looks when it winds up and that it can fire in a different direction from where he's facing. What you do is you position to Q the ADC, but you instead aim for {{champion:25}}  or whomever's camping one of the river bushes, which makes her waste her spell shield on the ADC.\n\nAfter that, you're free to {{summoner:3}} /{{summoner:14}} (depending on which summoner you choose) the ADC when the shield runs off or is broken with enough damage. It would make her have to use her shield wisely and wait for when the Q is mid-flight before shielding someone, and when there's lots of things going on (like in a team fight), ain't nobody got time for that.\n\nAnother counter to her would be {{champion:89}} since her E goes through the champ and hits the last one it touches, and then pulls her in to them. Plus her W's shield, depending on itemization, could be enough to shred the spell shield.\n\nI've used these fairly often against {{champion:25}} if she pops up in a draft/ranked game as a counter, and about 90% of the time she doesn't make enough gold to build her core item, the {{item:3157}}. But yeah, you'd want to run {{summoner:14}}  on support {{champion:412}} if you're going against {{champion:25}} so you can damage her shield (since you're not going for the kills, it's mainly used to reduce healing, so you'll want to use it as you're going in to lower the HP recovered in a team fight/skirmish).\n\nBut out of those three champs, none of them are able to counter her. I've destroyed{{champion:117}} as {{champion:25}}. {{champion:143}} doesn't even stand a chance, since her root moves too slow to be of any real use aside from \"in your face\" lock-downs. {{champion:267}} is ehh, I've played {{champion:267}} a lot and she's not great against her, nor is she outright bad.  {{champion:25}} can punish {{champion:267}} if she misses her bubble, and the spell shield can stop all of her skills aside from her damage boost and the heal's rebounding. You'd have to punish her before she punishes you. You're better off with a Tanky-AD support, since they can soak the damage/roots. But {{champion:201}} isn't that great either, once you mess up a few times, she'll know you aren't able to fully block all her damage with Unbreakable. Besides, she can always use her pool and a{{item:3116}} to slow you down and possibly make you waste summoners to defend your ADC.","replies":[]},{"poster":"Hiphoppopatomus","date":"2014-07-27T06:40:35.633+0000","up_votes":1,"down_votes":0,"body":"In my opinion, thresh is always a good pick up in support, regardless of enemy support.  Maxing hook first your Hook comes up faster than Morgana's black shield and if you play it like some people, you can go for the AP GP/10 item and have early game AP runes to kill the shield in one hook, allowing you to follow up with flays.  Though to be honest I feel thresh is more useful later when he can build tankier rather than AP.  But in general Thresh gives a ton of mid/late game pick potential as well as having one of the most OP skills in the game (lantern).   Definitely have to be willing to look beyond the lane matchup.  Also, if you just walk up and flay towards yourself, Morgana won't have time to react and will likely black shield whomever you flayed, allowing you to hook the other.  Then she may start black shielding instinctively as you walk up, allowing you to bait the shield and get free hooks.   \n\nThere's a reason thresh is one of the most, if not THE most, picked supports in the LCS. He just brings SOOO much to a team.","replies":[{"poster":"FNC Sneaky","date":"2014-07-27T07:00:29.021+0000","up_votes":1,"down_votes":0,"body":"I own and play thresh along with leona and i dont think hes that great. Most adc's that i deal with dont know how to work with him correctly. Yes his kit is well set for a team but if you cant get past the laning stage you can easily lose the game. Also anyone who actually plays morgana wont spell shield his flay, that would be pointless most of the time. spell shield the hook and let him re q so the thresh comes to your adc then snare his adc and ult. they both end up dieing and that thresh made it happen. Don't get me wrong hes a great support but not one i would ever by choice play against a morgana that has any idea of how to play her","replies":[{"poster":"Hiphoppopatomus","date":"2014-07-27T07:17:28.254+0000","up_votes":1,"down_votes":0,"body":"If your ADC is getting hit by a binding everytime you go in, then your ADC is bad.  No offense.   \nYou should also be much tankier early game than Morgana.  And your auto attack harass is much more potent.  Since morgana doesn't have much of an answer to you auto attacking from the minion line.  \n\nIf Morgana doesn't Spell shield your flay then that's a free slow and damage you just got on the enemy and allows you to land some auto's as well as possibly your ADC. Though you say they don't work well with him.  And just because you land a hook doesn't necessarily mean you have to ride it to the enemy.  Sometimes it's better just to pull the enemy in a bit then flay as many people as you can that are near towards yourself and towards your ally rather than putting both of you at risk.","replies":[{"poster":"FNC Sneaky","date":"2014-07-27T20:14:02.168+0000","up_votes":1,"down_votes":0,"body":"ill just have to try thresh out against or find a better adc or something.","replies":[]}]}]}]},{"poster":"TenderTouches","date":"2014-07-27T10:25:56.615+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"FNC Sneaky","date":"2014-07-27T20:12:47.113+0000","up_votes":1,"down_votes":0,"body":"Because i only need one lol. atleast for now","replies":[]}]}]}