{"poster":"Giorno 6Giovanna","date":"2019-10-31T11:11:34.047+0000","title":"Miért kapok ennyi autofillt?","up_votes":3,"down_votes":5,"body":"Tegnap délután supportot kaptam amit lejátszottam. Utána mentem 3 gamet még aznap a szurdokban amiből az egyik remake volt és most megint supportot kaptam. Hát ne b...a már meg a k....va isten. Valaki egy hónapban nem kap ennyiszer én meg 24 óra alatt kétszer. A  riot pofátlanságának legyen már határa. És igen a riot egy rohadtul pofátlan cég. Hogy merészel ilyen szar rendszert kiadni a kezei közül????? Miért kell belekényszeríteni valakit egy ki------szott JÁTÉKBAN olyanba amit nem akar??????? Erre valahogy senki nem tud értelmes választ adni, azon kívül hogy töröld le. Képzeld nem fogom letörölni. Amíg ip bannt vagy idegösszeroppanást nem kapok addig nem fogom letörölni!!!!!!!!!!!!! És mindenki mindig a riotot védi, mert adnak ingyen skineket. Tudjátok mit!? Dugják fel maguknak az ingyen skineket. Én nem skineket akarok, hanem egy normális rendszert. 4 meccsenként autofillt kapni rohadtul nem az. A matchmaking szintén nem. Mindenki mondja, hogy rankeden jó. Aha, akkor biztos azért volt hogy Silver1-esként platosokkal játszottam soloq rankeden. Vegyék el az összes skinemet amiért nem fizettem,  de csináljanak már egy normálisan átgondolt rendszert könyörgöm. Követelem, hogy a riot csináljon egy olyan funkciót hogy autofill kikapcsolás. Aztán dönthessek én, hogy gyorsan kapok meccset, de az lehet support is vagy várjak 10 percet minden game előtt, de akkor azt kapjam amit akarok. Mert 10 percet várni jobb, mint aztán fél órát szopni, mert muszáj fél órát szopni, mivel hiába van 13 perc alatt 25+ killes különbség akkor sem hajlandó valamelyik retardált feladni, mert neki van 2 killje. Aztán lehet törölni a posztomat meg védeni azt az inkompetens bandát. Úgysem értetek máshoz.","replies":[{"poster":"ScreamForMeBaby","date":"2019-10-31T17:45:16.066+0000","title":null,"up_votes":2,"down_votes":1,"body":"Az autofill nem megkerülhető, mivel: \n\nAkkor nem lenne játék. Nem akar minden ötödik ember supportolni. Szerintem még csak minden tizedik sem. Tehát ha nem lenne autofill (ami amúgy egy idős a játékkal, szóval nem is értem a problémát ilyen szemszögből) akkor nem tudnál játszani sem, mert nem lenne meg az ötödik tag.\n\nPersze, klassz lenne ha lenne elég support player. De amíg a playerek 90%-a olyan mentalitású, mint te, addig marad az autofill, vagy az, hogy nem játszol. Pont.","replies":[{"poster":"Max Stirner","date":"2019-10-31T18:22:14.667+0000","title":null,"up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ScreamForMeBaby,realm=EUNE,application-id=VFnq5EbB,discussion-id=1p3VTxYh,comment-id=0001,timestamp=2019-10-31T17:45:16.066+0000)\n>\n> Az autofill nem megkerülhető, mivel: \n> \n> Akkor nem lenne játék. Nem akar minden ötödik ember supportolni. Szerintem még csak minden tizedik sem. Tehát ha nem lenne autofill (ami amúgy egy idős a játékkal, szóval nem is értem a problémát ilyen szemszögből) akkor nem tudnál játszani sem, mert nem lenne meg az ötödik tag.\n> \n> Persze, klassz lenne ha lenne elég support player. De amíg a playerek 90%-a olyan mentalitású, mint te, addig marad az autofill, vagy az, hogy nem játszol. Pont.\n\nVagy széttrollkodod az autofil mecseket. Amíg ilyen a report-bann rendszer, addig ez sem egy elhanyagolható válasz az autofilra.","replies":[{"poster":"Erwylh","date":"2019-10-31T21:29:19.595+0000","title":null,"up_votes":2,"down_votes":0,"body":"Akkor valószínűleg ezért >70% a winratem supportttal, mert az enemy support mindig széttrollkodja az egészet.","replies":[]},{"poster":"ScreamForMeBaby","date":"2019-10-31T18:29:46.871+0000","title":null,"up_votes":2,"down_votes":0,"body":"Szét is szokták, igen. Alapból hülyeség volt kiszedni a call-ordert, meg alapból sok hülyeség van, ami a mostani rendszerig  vezetett. Report-bann rendszer nélkül meg végképp kaotikus az egész.","replies":[{"poster":"Knight Thyme","date":"2019-11-01T01:03:02.214+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nah, legalább a support mainek napját ne rontsd el :3 \n\na call order és a pick order mindig sok vitát generált.","replies":[]}]}]}]},{"poster":"Forest Tea","date":"2019-10-31T12:33:42.329+0000","title":null,"up_votes":2,"down_votes":2,"body":"Én mindig fill-elek, mert tudom hogy vannak olyan emberek mint te, és sosem panaszkodok a saját ösvényemre.\nLehetnél rugalmasabb.\n\n**Top** - Gondolom neked ez a szerep is megfelelő lenne. ( Ugyan az mint a mid )\n**Mid** -  Szerintem te ezen az ösvényen vagy a legtöbbet, ha ilyeneket írsz.\n**Jungle** - A te stílusodnak ez lehet nehezebb lenne.\n**ADC/Bot** -  Nyugis a játékmenet ott, kikéne próbálnod. ( Feltéve ha van supportod aki érti a dolgát, mert ha nem akkor jönnek majd a szavak megint. )\n**Support** - Itt van ez, amivel a legnagyobb bajod van. Nem szereted segíteni a csapatot, ezért nem szereted ezt a szerepet. Mit is kellene egy supportnak csinálnia, miért nem szereted? :\n\n- Wardoznia kell\n- Segítenie kell a csapattársakon \n- Önfeláldozó\n- Nem ölheti a minionokat\n- Csak akkor ölhet ellenséget, ha biztos hogy amúgy elszaladna / véletlen\n\nSzerintem a supportok rendkívűl jók, és nélkülük nem igazán lenne teljes a játék. Gondolom panaszkodtál már a support-ra mert rossz volt. Nah és pont ez az, amiért sokan nem szeretik a supportot, mert mindig szidják őket ha valamit nem jól csinálnak. Addig nem leszel tökéletes a saját ösvényeden, ameddig nem tudsz az összesen csapatként működni. Azt javaslom hogy kezd a dzsungellel, mert habár neked nehéz lenne, de még se kötelező egyből segítened a csapatnak. Lehet szidni fognak hogy rosszul játszol, de miért is találták fel a némítást? Vannak a játéknak hibái az tény, de pont az ilyen játékosok miatt mint te. Én se vagyok valami szent, azt se mondom hogy nem kaptam már **14** nap bant. Talán nem fogod elolvasni ezt, talán megse érted, lehet rosszul fogalmazok, de a hibádat **ne hárítsad másra**.","replies":[{"poster":"Giorno 6Giovanna","date":"2019-10-31T15:47:26.838+0000","title":null,"up_votes":2,"down_votes":1,"body":"Kezdjük ott, hogy top az elsődleges lanem aztán a mid.  A supportolás egyszerűen nem az én stílusom, mivel valami random adc-vel kell együttműködnöm, aki az esetek nagytöbbségében azt se tudja, hogy hol van. Én mage supp-okat szoktam vinni, ha nagyon muszáj.  Wardolni szoktam, pokeolom az enemy-t, szóval nem azt mondom hogy mindent jól csinálok, mert az hülyeség, de megteszem amit tudok.  De sokszor ez az adc-nek nem elég. Elviszek egy miniont véletlen, low hp-n nem követem őt a halálba, 0 manával nem követem őt, véletlen elviszek egy killt na akkor elkezd ott nekem okoskodni. És én nehezen viselem, ha egy lengyel kis köcsög osztja nekem az észt. Vagy mikor simán túlélném, de b---szik healelni, na azt szeretem a legjobban vagy ő magára nem healel, hanem inkább engem flamel. Oszt ha már ott tartunk hogy muteolni kell, akkor úgyis matt van bot lanen, mert az fixen szar lesz utánna. Plusz a rendszer se segít rá az ilyen gamekre. Nagyon sokszor premade bot ellen vagyunk, enemy tryhardol mintha az élete múlna rajta. Ilyen otp tresh, morgana, blitz van ellenünk, hát az is egy rémálom szokott lenni. Néha ez elmenne, de az hogy nekem naponta akár KÉTSZER supportolnom kell, az kurvára nem járható út. Nem az én stílusom, nem szeretem és ennyi az egész. Továbbra is hülyeség, hogy a játék rám kényszeríti a szarságait.  A rendszer egy darab kula és a riot \"szakembereit\" utcasepréssel nem bíznám meg.","replies":[{"poster":"Jack Eron","date":"2019-11-01T08:06:42.716+0000","title":null,"up_votes":2,"down_votes":1,"body":"Részben igazad van, de a random adcdet is értsed meg. Ha nem hagyományos supportot viszel, akkor legtöbbször édeskevés leszel ahhoz, hogy megvédd. Attól, hogy pokeolsz még nem feltétlen segítesz rajta, ráadásul mivel full ap leszel, ezért nem egy-két miniont, hanem idővel a fél wavet fogod elvinni egy-egy spellel. \n\nA tryhardot te is felejtsd el, hülyeség. Akkor hoz main az ember, amikor kedve tartja. Az pedig, hogy a legjobbat adja magából egy stratégiai csapatjátékban, hogy a bánatba lenne már tryhard? Teljesen logikus döntés, ami a csapat javát szolgálja.\n\nAz adck pedig nem hülyébbek az átlagplayernél. Minden ösvényen vannak idióták. De supportként legalább rálátást biztosíthatsz, és te védelmezheted a teamet. Az egyik legfontosabb role. Most mondhatjuk, hogy az adc-k általában idióták, akkor a toposok általában sosem jönnek le segíteni, a midesnek csak a kill kell és nem ad senkinek belőle, a jungeles pedig csak free killért jön a halálotok után, vagy csak farmol. Az egyetlen lehetőség ami marad, hogy töröld le ezek után.\n\nVagy... (népszerűtlen ötlet) próbálj meg megtanulni minden lanen játszani? Az még sosem ártott meg senkinek.","replies":[]}]}]},{"poster":"Pentasteal Sona","date":"2019-11-19T08:23:46.444+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mindeközben az Overwatchban mindenki azért rinyál hogy miért nincs autofill, damage hőssel 10-30 perces sorok vannak egy 6-10 perces játékért. Na ezért van autofill.","replies":[]},{"poster":"kiskeni","date":"2019-11-07T21:53:23.425+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mert zöld az egér és mint szódás a lovát az arany köves bárány attilán\n_bocs, nincs már lélekjelenlétem olyan szinten belemenni a témába, mint ahogy terveztem, szóval ennek majd később megint nekifutok :D_","replies":[]}]}