{"poster":"CyaInAbyss","date":"2017-07-25T16:42:21.085+0000","title":"Platin Midlaner sucht ein Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo, ich bin 20 Jahre alt, derzeit Platin V in SoloQue, Platin IV in der Flexque und leidenschaftlich gerne auf der mittleren Lane unterwegs.\r\nSpiele bereits seit Saison 1 mit Verz&ouml;gerungen.\r\nSeit Saison 1 war mein Main Kennen in der mittleren Lane und dann auch immer &ouml;fters auf der oberen Lane. (gesch&auml;tzt 1000 Games).\r\n\r\nMomentan spiele ich selbst gerade viel SoloQue und trainiere Orianna, Ahri, Malzahar, Kassadin. Leblanc und Talyah sollen noch dazukommen.\r\nAuch habe ich Erfahrung auf den anderen Lanes.\r\n\r\nMeine Einstellung und mein Denken:\r\nIch spiele meine Lane so, dass ich versuche keinen Farm zu verpassen und Druck aufzubauen, ab und zu schau ich auch Challenger Spielern zu um mich selbst zu reflektieren. Ich mache in Solo Que Matches immer Dmg und trotzdem gib ich mir bei jedem Teamfight der verloren wird die Schuld; &quot;was habe ich falsch gemacht, ich h&auml;tte den Team fight irgendwie gewinnen k&ouml;nnen.&quot; Also sehe ich dort mein Verbesserungspotenzial.\r\nVon einem Team erwarte ich Ehrgeiz und strategisches Denken, dass man sich abspricht wo man seine Pinkwards hinplatziert etc.\r\nUnd auch &ouml;fters in eingespielten Team Compositionen Teamfight Strategien festigt.\r\n\r\nSelber habe ich fr&uuml;her jeden Morgen eine Stunde in einem freien Game ohne Masteries/runen ge&uuml;bt Last Hitts zu treffen.\r\n(heute mittlerweile weniger, will aber vorallem wegen des neuen Trainingsmode der dazugekommen ist wieder damit beginnen).\r\nIch &uuml;berlege auch dar&uuml;ber nach einen Midlane Coach beizurufen, weiss nur noch nicht woher ich den am besten nehme, da ich mir noch eine Kreditkarte zulegen m&uuml;sste.\r\n\r\nFalls ihr f&uuml;r ein Team einen Midlaner sucht bin ich gerne bei einem Tryout dabei.\r\nSchreibt mich gerne ingame an &quot;Suddendeath Incl&quot; = Suddendeath incL\r\n\r\nFreundliche Gr&uuml;sse","replies":[]}