{"poster":"lucky8093","date":"2016-12-29T12:32:15.987+0000","title":"Account gelöscht","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":22,"body":"Hallo wegen einen Report gegen meinen Freund aus Spa&szlig;  ( Beleidigung  ) wurde sein acc zuerst perma gebant und jetzt scheinbar komplett gel&ouml;scht.\r\n\r\nIch finde es eine FRECHHEIT da er schon &uuml;ber 150&euro; in dieses Spiel investiert hat \r\nUnd m&ouml;chte entweder Schadensersatz  ( Betrag in &uuml;ber 150&euro; H&ouml;hen ) oder diesen Account wieder haben.\r\nFalls Sie und in zur&uuml;ckgeben sage ich das danach kein Report mehr reingehen wird! Und wenn dann akzeptieren wir diesen Fehler!","replies":[{"poster":"ybirion","date":"2016-12-29T12:36:42.854+0000","up_votes":12,"down_votes":0,"body":"*facepalm*","replies":[{"poster":"Rucking Fiot","date":"2016-12-29T12:41:59.898+0000","up_votes":3,"down_votes":0,"body":"same","replies":[{"poster":"Mi3zekatze","date":"2016-12-29T22:01:42.404+0000","up_votes":1,"down_votes":0,"body":"Same","replies":[]}]},{"poster":"lucky8093","date":"2016-12-29T12:45:01.926+0000","up_votes":1,"down_votes":7,"body":"?","replies":[]}]},{"poster":"Vogeljunges","date":"2016-12-29T17:18:24.640+0000","up_votes":8,"down_votes":1,"body":"Dafuq i just read?!?!    .....o.O\n\nLese ich das richtig? Dein Freund wird gebannt und du willst 150€ haben... Gibst du ihm die dann auch??\n\n...lol ne mal ganz im Ernst... immer wenn man denkt, man hat hier schon alles gesehen kommt einer, der noch ne Schippe drauf legt...\n\n\nVERDAMMT!!! ICH LIEBE DIESES FORUM!!! <3 <3 <3 <3 \n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Mi3zekatze","date":"2016-12-29T21:59:41.579+0000","up_votes":1,"down_votes":1,"body":"xD hahahah m8 my day :D","replies":[]},{"poster":"MSF Deadshot","date":"2016-12-29T18:54:26.718+0000","up_votes":1,"down_votes":1,"body":"echt so haahahha","replies":[]}]},{"poster":"Sałtyy","date":"2016-12-29T15:23:58.374+0000","up_votes":4,"down_votes":0,"body":"Was ist das bitte für ein Deutsch?\nKommt nur mir das dumm vor?\n\n\n\nAchja nur so nebenbei, lernt mal AGB lesen ^^","replies":[]},{"poster":"Darkr3sQ","date":"2016-12-29T13:42:38.955+0000","up_votes":3,"down_votes":0,"body":"Zuerst einmal: RIOT sperrt einen Account nicht einfach so, weil er reportet wurde. Bevor ein Account gesperrt wird, wird auf Fehlverhalten geprüft, und nur wenn Fehlverhalten vorliegt wird gesperrt. Dein Freund sollte eigentlich einen Chatlog erhalten haben. Darüber hinaus wird ein Account nur bei extremen Beleidigungen, homophobischen oder rassistischen Äußerungen direkt Perma gebannt. Dein Freund sollte vorher also mindestens nen 14 Tagesbann gehabt haben, in dem sogar angekündigt wurde, dass der nächste Bann permanent ist, wenn er nicht ab sofort die Beleidigungen vollständig einstellt.\n\nAls nächstes: Das hier ist ein Community-Forum. Hier wirst Du von RIOT keine Antwort erhalten. RIOT kannst du über den Punkt Support ganz oben auf der Seite erreichen. Wenn es ein Bann wegen Beleidigungen - also ein rechtmäßiger Bann - war, wirst Du allerdings dort auch keine Aussicht auf Erfolg haben. Vor Allem nicht, wenn Du die Anfrage an den Support genauso aggressiv wie hier schreibst. Bei RIOT heißt Perma tatsächlich auch Perma.\n\nZu guter Letzt: Dein Freund hat das Geld nicht in LOL investiert. Er hat sich dafür RP gekauft, und für diese RP hat er sich dann Skins oder Champs oder Booster geholt. Wenn Du in etwas investierst, dann erwartest Du, dass Du auch Geld wieder zurückbekommst. Dies trifft auf LOL nicht zu. Er hat nicht in LOL investiert, sondern er hat sich in LOL RPs gekauft. Sonst würde ich ja auch in einen Supermarkt investieren, wenn ich mir dort etwas kaufe.\nWenn Dein Freund wegen Beleidigung perma gebannt wurde, dann hat er gegen die AGB verstoßen, die er einmal bei der Erstellung des Accounts und bei jedem Update aufs Neue akzeptiert hat. Dort steht auch drin, dass RIOT bei Fehlverhalten - wozu Beleidigen zählt - den Account permanent sperrt. Das Geld, was in den von RIOT geliehenen Account - auch das steht in den AGB - gesteckt wurde, ist mit der permanenten Sperrung auch weg. Dein Freund hat in diesem Fall auch kein Anrecht auf Schadensersatz. Welcher Schaden ist ihm denn entstanden? Er hat RP für Echtgeld gekauft, und RIOT hat ihm diese RP auf den Account übertragen. Keiner hat Deinen Freund gezwungen Echtgeld in das Spiel zu stecken.","replies":[{"poster":"clair de lune289","date":"2016-12-29T13:54:15.477+0000","up_votes":4,"down_votes":1,"body":"aber ich hab doch in das Essen beim Supermarkt investiert, es hat mir nicht sonderlich geschmeckt deshalb verlange ich jetzt mein investiertes Geld zurück. {{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Megamaexx","date":"2016-12-29T14:18:38.058+0000","up_votes":4,"down_votes":0,"body":"Nur, wenn du das Essen zurückgibst - in welcher Form auch immer! Kotz dich aus ;)","replies":[]}]}]},{"poster":"dNiW","date":"2016-12-30T16:38:57.416+0000","up_votes":3,"down_votes":0,"body":"Du machst einen Fehler, regst dich dann darüber auf und Andere sollen für \nDeinen Fehler büßen.\nIn welcher Welt lebst DU?\n\nIch schmeiße meiner Nachbarin auch keinen Wasserkocher an den Kopf und will dann das mein Kumpel das Schmerzensgeld bezahlt.\nDafuq ich weiß warum die Rechten, Trump und anderes passiert, wenn sowas frei rumläuft.","replies":[]},{"poster":"Megamaexx","date":"2016-12-29T14:56:03.574+0000","up_votes":4,"down_votes":1,"body":"Hey, 150€, so viel hab ich auch schon fast in LoL gesteckt. Ach ne, Moment... bei mir ist da irgendwo ne 0 mehr...\n\nAber nun zum eigentlichen Thema. Er wurde nicht gebannt, weil du ihn reportet hast. Er eure gebannt, weil sein Verhalten (wiederholt) als toxisch erkannt wurde. \n\nSchadensersatz kann man nur fordern, wenn Schaden entstanden ist. So könnte Riot rein theoretisch von jedem Spieler, der sich nicht an die AGBs hält und dadurch deren Geschäft in ein schlechtes Licht rückt, Schadensersatz verlangen. Wobei das eher ein Fall für Risikofreunde wäre und man verdammt gut argumentieren müsste, aber ich schweife ab.\nEs ist kein Schaden entstanden. Er hat RP für den Account gekauft. Diese RP wurden dem Account gutgeschrieben. Alles andere hat nichts mehr mit dem Geld zu tun.\n\nSollte dein Freund psychische Schäden dadurch erhalten haben, könnt ihr Riot ja auf Schmerzensgeld verklagen. Dann bezahlen die ihm bestimmt den Psychiater.\n\nÜbrigens zum Thema “Account wiederhaben“, der Account hat ihm nie gehört, der war nur gemietet. Steht auch irgendwo in den AGBs. Dort steht auch, dass sie sich das Recht vorbehalten, die Nutzungsrechte jederzeit und ohne Grund zurückzuziehen, nur falls tatsächlich Klagen kommen wegen unbegründeter Sperrung.\nWürde man Geld für die Miete zahlen, könnte man sich das zumindest anteilig holen, aber man zahlt ja nix.\n\nAlso egal, wie sehr du hier rumwetterst, es sind alles vergeudete Mühen.","replies":[]},{"poster":"XOFree","date":"2016-12-29T22:16:37.349+0000","up_votes":2,"down_votes":8,"body":"also warum auch immer und bla bla bla ist hier recht uninteressant,  es ist nun mal so das riot oder usa firmen allgemein nicht einfach für etwas \"geld einstreichen kann\" und dann egal aus welchen grund!  sagt \"ne ist nicht\" das geht mit dem deutschen gesetz nun mal nicht...\n\nklag doch! ich kann dir sagen es wird zu 100 % außergerichtlich geregelt werden! das ist so sicher wie das amen in der kirche!\n\nps: nervt mich nicht mit der man hätte zugestimmt -.- oder was auch immer! es ist wie es ist! 0€ acc sind scheiß egal! aber sobald man € investierst hat sieht die sache ganz anderes aus!","replies":[{"poster":"Waldschrat86","date":"2016-12-30T15:07:17.917+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=UltraDivus,realm=EUW,application-id=KYnfKGf0,discussion-id=c35kg289,comment-id=000a,timestamp=2016-12-29T22:16:37.349+0000)\n>\n> also warum auch immer und bla bla bla ist hier recht uninteressant,  es ist nun mal so das riot oder usa firmen allgemein nicht einfach für etwas &quot;geld einstreichen kann&quot; und dann egal aus welchen grund!  sagt &quot;ne ist nicht&quot; das geht mit dem deutschen gesetz nun mal nicht...\n> \n> klag doch! ich kann dir sagen es wird zu 100 % außergerichtlich geregelt werden! das ist so sicher wie das amen in der kirche!\n> \n> ps: nervt mich nicht mit der man hätte zugestimmt -.- oder was auch immer! es ist wie es ist! 0€ acc sind scheiß egal! aber sobald man € investierst hat sieht die sache ganz anderes aus!\n\nKannst ja mal dein Handy, PC whatever, wofür du bezahlt hast, aus dem Fenster werfen und dann zum Hersteller gehen und den Neuwarenwert verlangen. Viel Erfolg, mehr als sie dir denVogel zeigen komm da außergerichtlich nicht rum.","replies":[{"poster":"XOFree","date":"2016-12-30T18:01:26.403+0000","up_votes":1,"down_votes":7,"body":"menschen wie du sind der grund warum ttip und ceta zustande kommen...\n\nin diesem sinne \"blinden\" rutsch ins neue jahr und viel spaß auf der weide...","replies":[{"poster":"Waldschrat86","date":"2016-12-31T16:59:28.013+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=UltraDivus,realm=EUW,application-id=KYnfKGf0,discussion-id=c35kg289,comment-id=000a00010000,timestamp=2016-12-30T18:01:26.403+0000)\n>\n> menschen wie du sind der grund warum ttip und ceta zustande kommen...\n> \n> in diesem sinne &quot;blinden&quot; rutsch ins neue jahr und viel spaß auf der weide...\n\nAha, weil ich in nem Forum sage, dass du BS schreibst, kommen diese Abkommen zustande. Äh ja.\n\nWie weit ist die Sammelklage von dem anderen Schlaumeier mitlerweile? \n\nOder die Welle von Redditposts, wo die ganzen Gebannten berichten, dass sie easy Geld zurück bekommen hätten.\nOh die gibt es ja gar nicht, warum nur? \n\nMach doch, mach doch, mac doch oder willst du selbst an CETA und TTIP schuld sein?\n{{sticker:zombie-brand-facepalm}}","replies":[]}]}]},{"poster":"DontKillMySoraka","date":"2016-12-30T09:57:53.521+0000","up_votes":3,"down_votes":0,"body":"bist du der mit dem Anwalt-onkel??","replies":[]}]},{"poster":"Noru Dali","date":"2016-12-29T23:36:49.361+0000","up_votes":2,"down_votes":0,"body":"Ich schmeiß mich weg XD\n\nGeil.\n\n\nEinfach WOW.\n\nIch liebe das spielverhalten forum.","replies":[]},{"poster":"Die Bohrmaschine","date":"2016-12-29T12:42:21.094+0000","up_votes":3,"down_votes":1,"body":"Soll das nen schlechter Troll sein?","replies":[]},{"poster":"lucky8093","date":"2016-12-29T12:38:03.363+0000","up_votes":1,"down_votes":10,"body":"Und wenn nichts von den 2 Sachen passiert Vermögen wir sie wegen Kinder abzocke!\n* sein acc hieß champpro","replies":[{"poster":"SeaHorseCalamity","date":"2016-12-29T13:57:57.273+0000","up_votes":4,"down_votes":0,"body":"Wenn man gepermabannt wurde hat man sich wohl trotz mehrmaliger Aufforderung sein Verhalten zu ändern (und beigelegter Ansage, was weiteres Fahlverhalten für Konsequenzen hat) dazu entschieden, weiterhin negativ aufzufallen.\nBei extremen Fällen kann man auch deutlich schneller gebannt werden, aber die meisten gehen wohl aufgrund von häufigen Fehltritten.\n\nDie Leute werden hier nicht generell abgezockt, sondern aussortiert.\n\nDiejenigen, die sich über Wochen und Monate unanständig verhalten und auf keinerlei andere Strafen/Warnungen achten, werden halt durch permanenten Ausschluss aus der Community bestraft, da sie sich offensichtlich nicht um deren Wohlbefinden kümmern.\n\nIch weiß leider die Vorgeschichte nicht (Die darfst du gerne nachreichen , aber wenn man sich nicht wie ein normaler Mensch benehmen kann, dann hat das natürlich konsequenzen.","replies":[]},{"poster":"Vogeljunges","date":"2016-12-29T17:21:00.502+0000","up_votes":3,"down_votes":0,"body":"Such mal ein bisschen im Forum, vor ein oder zwei Monaten war hier mal einer, der wollte Riot verklagen. Ich empfehle euch, da mitzumachen... ganz ehrlich!!","replies":[{"poster":"Antiqui","date":"2016-12-29T23:45:23.408+0000","up_votes":1,"down_votes":0,"body":"Oh ja, der Thread wird bei mir in ewiger erinnerung beliben!!!\n\nHmm, wir sollten einen \"Thread des Jahres\" küren, ich weiß welcher meine Stimme bekommen würde ^^","replies":[{"poster":"Darkr3sQ","date":"2016-12-30T07:45:32.889+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Antiqui,realm=EUW,application-id=KYnfKGf0,discussion-id=c35kg289,comment-id=000100030000,timestamp=2016-12-29T23:45:23.408+0000)\n>\n> Oh ja, der Thread wird bei mir in ewiger erinnerung beliben!!!\n> \n> Hmm, wir sollten einen &quot;Thread des Jahres&quot; küren, ich weiß welcher meine Stimme bekommen würde ^^\n\nIch wäre mir da nicht sicher. Der Thread mit dem Anwaltslehrling hätte auch Potential dazu.","replies":[{"poster":"Antiqui","date":"2016-12-30T15:42:50.491+0000","up_votes":1,"down_votes":0,"body":"Das ist genau der Thread ^^","replies":[{"poster":"clair de lune289","date":"2016-12-30T15:46:35.009+0000","up_votes":1,"down_votes":0,"body":"ich denke den Thread werden die meisten Forenuser ,die im Topic Spielerverhalten unterwegs sind, nicht so schnell vergessen.\n\nMeine Stimme hätte der Thread jedenfalls.","replies":[]}]},{"poster":"Sirrkas","date":"2016-12-30T10:12:27.736+0000","up_votes":1,"down_votes":0,"body":"Ich glaube, das war der gleiche Thread.","replies":[]}]}]}]},{"poster":"gamerman3000","date":"2016-12-29T14:32:25.881+0000","up_votes":1,"down_votes":0,"body":"Man darf im Forum keine Namen nennen. Es bringt hier niemandem was zu wissen wie der Account heißt, und wen du den nicht rausnimmst kannste nen Forenban kassieren.","replies":[{"poster":"D4RKEVA","date":"2016-12-29T16:38:07.882+0000","up_votes":1,"down_votes":1,"body":"Man darf namen nennen\n\nNAMING UND SHAMING ist verboten ja aber nur im negativen bezug\n\n\nWenn jemand scheeibt OMG GAMERMAN3000 IST DER COOLSTE ER HAT MICH SO HART GECARRIED\n\nDann wird den niemand belangen außer du beschwerst dich vllt persönlich :P","replies":[]}]},{"poster":"antitomatexd","date":"2016-12-29T13:32:03.217+0000","up_votes":1,"down_votes":0,"body":"http://euw.op.gg/summoner/userName=champpro wenn er gelöscht wäre würde mann diesen Account doch nicht mehr sehen oder?","replies":[{"poster":"Megamaexx","date":"2016-12-29T14:58:48.917+0000","up_votes":1,"down_votes":0,"body":"Da op.gg eine externe Seite ist, ist es dennoch möglich, dass er dort gelistet ist/bleibt. Du müsstest direkt in die Riot API schauen. Wenn er dort raus ist, ist sein Account tatsächlich weg. Wird aber nie geschehen^^","replies":[]}]},{"poster":"MSF Deadshot","date":"2016-12-29T18:54:52.095+0000","up_votes":1,"down_votes":0,"body":"vermögen? hahaha ach du ***","replies":[]}]},{"poster":"Mi3zekatze","date":"2016-12-29T21:58:37.593+0000","up_votes":1,"down_votes":0,"body":"Von wem ist der gebannte Account wohl von dir oder deinem Freund ;) \nSherlock Homes sagt nicht von deinem Freund","replies":[]},{"poster":"lucky8093","date":"2016-12-29T12:53:33.730+0000","up_votes":1,"down_votes":4,"body":"NEIN DAS SOLL KEIN SCHELCH TERMIN TROLL SEIN!","replies":[{"poster":"Die Bohrmaschine","date":"2016-12-29T13:02:24.412+0000","up_votes":2,"down_votes":0,"body":"Made my day. Thanks.","replies":[]},{"poster":"Waldschrat86","date":"2016-12-29T13:08:33.804+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=lucky8093,realm=EUW,application-id=KYnfKGf0,discussion-id=c35kg289,comment-id=0003,timestamp=2016-12-29T12:53:33.730+0000)\n>\n> NEIN DAS SOLL KEIN SCHELCH TERMIN TROLL SEIN!\n\nDann verrate doch mal, warum jemand den Schaden, den er durch seine Taten verursacht und du durch Report erst möglich gemacht hast, ein anderer tragen sollte?\n\nIhr seid Trolle oder süß ;)","replies":[]},{"poster":"CoGa Skyrora","date":"2016-12-29T12:55:18.352+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=lucky8093,realm=EUW,application-id=KYnfKGf0,discussion-id=c35kg289,comment-id=0003,timestamp=2016-12-29T12:53:33.730+0000)\n>\n> NEIN DAS SOLL KEIN SCHELCH TERMIN TROLL SEIN!\n\nSieht aber sehr stark nach einem aus.","replies":[]}]}]}