{"poster":"ChiefBoiRd2","date":"2019-09-22T01:08:10.006+0000","title":"Permanent ban after 1 game","subforum":"Player Behavior","up_votes":1,"down_votes":10,"body":"So I had just recently came back from a 14 day ban ( my first one) and had decided to play a few games now that I was unbanned again. \r\nAfter playing one game in which my teammates  did the typical blame and curse out jg I simply  laughed it of and told them that I was going to report them. After that I straight up just got banned.  Is there anyway to contact riot to somehow get my account back. I don't think I did anything that was ban worthy.","replies":[{"poster":"PEEWEE78368","date":"2019-09-22T15:23:49.723+0000","up_votes":3,"down_votes":0,"body":"If you said nothing wrong you would have already shared ur chat logs with us you OBVI dont want to because you know hy lol. Ur BAN is 100% Justified. I got PERM ban 1 time and  i will never again ever open my mouth in a match i learned after that lol.","replies":[{"poster":"ChiefBoiRd2","date":"2019-09-22T17:27:16.072+0000","up_votes":1,"down_votes":2,"body":"So ur saying that sharing my chat logs will get me unbanned? If not then I don’t really see a point in doing it.","replies":[{"poster":"InsaneWind","date":"2019-09-22T18:09:25.720+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChiefBoiRd2,realm=NA,application-id=ZGEFLEUQ,discussion-id=nPEfU6tf,comment-id=00040000,timestamp=2019-09-22T17:27:16.072+0000)\n>\n> So ur saying that sharing my chat logs will get me unbanned? If not then I don’t really see a point in doing it.\n\nShowing chat logs shows us what you said and shows us wither or not the story you present to us is accurate or not, that is the point to sharing it.","replies":[]},{"poster":"PEEWEE78368","date":"2019-09-23T11:32:32.925+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ChiefBoiRd2,realm=NA,application-id=ZGEFLEUQ,discussion-id=nPEfU6tf,comment-id=00040000,timestamp=2019-09-22T17:27:16.072+0000)\n>\n> So ur saying that sharing my chat logs will get me unbanned? If not then I don’t really see a point in doing it.\n\nAnd now we know why this idiot is ban lol. Dude wont even  share is LOGS lol bye enjoy ur perm ban","replies":[]}]}]},{"poster":"LaceUpXX","date":"2019-09-22T01:43:58.632+0000","up_votes":4,"down_votes":1,"body":"chat logs or it didn't happen","replies":[]},{"poster":"KFCeytron","date":"2019-09-22T01:10:26.085+0000","up_votes":3,"down_votes":2,"body":"So, it has come to this: someone displayed misbehavior in a LoL match in flagrant disregard for the game's rules, ToS, EULA, and Summoner's Code. That's unfortunate, and I'm sorry you had to deal with it. If this misbehavior happened in chat (including emotes or ping) and they don't respond positively to a _single, courteous, constructive request to focus on the game_, your best option is to mute that player. Submit a report after the match. This is equivalent to dealing with a noisy person in a library by asking them to keep it down and then notifying library staff and moving to another area.\n\n_Do not respond with misbehavior of your own!_ If you do that, your teammates may mute and report _you_, and those reports would be valid. This is equivalent to dealing with a noisy person in a library by getting into a shouting match with them. Just because someone else started it doesn't justify you in continuing it. I'm sure you're familiar with the \"s/he started it\" trope, where two children get into an argument or fight and then try to claim innocence of any wrongdoing by claiming that they didn't instigate it. As any parent, teacher, or other supervisor of children will tell you, that excuse doesn't fly. When Dad is trying to drive you to Disneyland and your annoying brother starts making faces at you as he's previously been told not to, you should calmly ask him to stop, and then, if that doesn't work, calmly notify your parents of the problem. Making faces at him or shouting at him has never been a good way to get him to stop, and it makes you just as guilty of that as he.\n\nRiot doesn't care who started it. Someone else's misbehavior does not justify your own.\n\nFrom [Riot's support knowledgebase](https://support.riotgames.com/hc/en-us/articles/207489286-Instant-Feedback-System-FAQ-):\n\n> * Simply speaking, retaliation is not an acceptable or justifiable behavior. An argument between two players can easily create a negative experience for the rest of the players in the game with you. Regardless of the other player’s actions, this does not justify your own behavior. You alone are responsible for your actions within the game.If you encounter a toxic player like this, the best option is to simply report their behavior and move on.\n> * Reports are a vital piece to the puzzle. If you are not sure of what sort of behavior is reportable take a look at the [Reporting a Player FAQ](https://support.riotgames.com/hc/en-us/articles/201752884-Reporting-a-Player)\n\nIf you misbehave but a teammate or opponent does or says something even worse, you should definitely report them after the match, just as someone reported you for your own misbehavior. Yes, that's certainly possible. Reports are not a limited resource. Any time someone believes that another player violated LoL's behavioral standards, they can report that player. Punishments are similarly not limited: if more than one player in a game merits a punishment, they can both get a punishment. This can happen even if the players in question were antagonizing each other. The IFS doesn't need to weigh the severity of all reported players' actions and then \"award\" the \"winner\" with a punishment; it's not a contest.\n\nThink of it like dealing with a noisy person in a library: ask them to keep it down, and then notify library staff and move to another area if that doesn't work. If you get into a shouting match with them, you're just as likely to be removed, even if you weren't shouting _quite_ as loudly as they were. The goal is a quiet library.\n\nYour opinion of the rules is of zero relevance. When a cop stops you for going 40 in a 25 zone, you can claim \"I think the limit should be 45 here\" all you want. You're still getting a ticket. If a librarian asks you to keep your voice down while you use the facilities, shouting that libraries should be loud will simply get you escorted out. If you go to a friend's house who insists that you remove your shoes while you're in their home, \"that's a stupid rule and I do what I want\" will lose you a friend. If you are using someone else's services, facilities, equipment, etc., you abide by their rules or you deal with the consequences. If you think the rules should change, that is a completely different conversation (and I wouldn't give a plugged nickel for your chances at convincing Riot to change their rules to allow behavior like yours).\n\nFrom [Riot's support knowledgebase](https://support.riotgames.com/hc/en-us/articles/360024051193-Understanding-Different-Ban-Types-FAQs):\n\n> We work with the overall community and within our own company guidelines to identify what disruptive behavior is and what the consequences for those behaviors should be. We understand that it can be difficult to know where the line is, which is why we provide chat logs and we have a few tiers in the ban process in order to allow for you to learn and grow.\n\nYou weren't punished for misbehaving in one game. You were punished for misbehaving in _one more_ game, in a consistent pattern of negative behavior that breaks the game's rules. Additionally, the reform card doesn't always show all the logs that led to your punishment: it randomly selects up to several logs. You might see three logs, but you also might see as few as one, even for players whose punishment stems not from a small number of egregious infractions but rather from dozens of instances of mild toxicity. The purpose of the reform card is to tell you how to reform, so it shows you an example of the behavior that prompted your punishment and explains that such behavior is inappropriate and should be avoided if you want to maintain an account in good standing.\n\nUsually, one transgression by itself wouldn't be enough to bring such a punishment to an otherwise clean account, but the IFS works on an escalating punishment system. Breaking a minor rule, like engaging the team in useless arguments, has a minor punishment: a chat restriction. Breaking that same rule over and over again, however, doesn't prompt an endless series of chat restrictions. The severity of the punishment ramps up over time, because the goal is to eliminate the punished player's willingness to break the game's rules. If two chat restrictions don't stop the useless arguments, the system will increase the punishment to a 14-day suspension and deliver a very clear message that the continued rule-breaking is becoming a serious issue and any further instances will result in a permaban. Again, the point is to put a stop to this misbehavior. If a player is more interested in repeatedly breaking the rules than in maintaining access to their account, they'll lose access to their account.\n\nOf course, it's possible to break major rules, like cheating, threatening people, or using chat for hate speech, and skip punishment tiers so that a clean account ends up with a 14-day suspension or even a permaban.\n\nFrom [Riot's support knowledgebase](https://support.riotgames.com/hc/en-us/articles/207489286-Instant-Feedback-System-FAQ-):\n\n> **PUNISHMENTS GENERALLY FOLLOW A BASIC ESCALATION PATH:**\n> \n> * First Offense: 10 Game Chat Restriction\n> * Second Offense: 25 Game Chat Restriction\n> * Third Offense: Two Week Suspension\n> * Fourth Offense: Permanent Suspension\n> \n> However, it is possible to skip to a Two Week or Permanent suspension based on the severity of the behavior in the game. Excessive negative behavior can result in a Two-Week or Permanent suspension at any time without having a chat restriction on the account.\n\nFrom [Riot's support knowledgebase](https://support.riotgames.com/hc/en-us/articles/201752884-Reporting-a-Player):\n\n> Do not threaten or repeatedly tell a player you will report them. Doing so can encourage players who are already negative to continue their behavior. Whether they know they are being reported or not has no bearing to whether the system will act on them. But most importantly, repeatedly threatening or arguing with a negative player can end up derailing the game for everyone else and then open yourself up to reports and possible disciplinary action as well. Avoid negative thoughts and useless chatting with poor performing teammates! Focus on victory by muting the offending player and then reporting them at the end of the game.\n> \n> Do not ask other players in the match to report the offending player. It only takes one report for our systems to review a game. Additional reports will not do anything for the offending player; however as mentioned above, it could open yourself up to a report of your own; especially if you are derailing the match by constantly demanding reports of other players.","replies":[{"poster":"ChiefBoiRd2","date":"2019-09-22T01:23:46.779+0000","up_votes":1,"down_votes":6,"body":"But for Chat longs it only shows one game. One game in which my teamates are cursing me out.   Talking shit and being quiet in a library are two different things also.  If anything its like walking into the library sneezing and getting kicked out for doing so. I did mute them and I did reported them. Guess it's my fault for saying that I would report them though\" something I had been chat res for b4\". I literally did nothing but repeat the threat sent towards me and laughed them off. Guess thats worthy of being permanently banned for.","replies":[{"poster":"KFCeytron","date":"2019-09-22T01:41:08.212+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ChiefBoiRd2,realm=NA,application-id=ZGEFLEUQ,discussion-id=nPEfU6tf,comment-id=00010000,timestamp=2019-09-22T01:23:46.779+0000)\n>\n> But for Chat longs it only shows one game. One game in which my teamates are cursing me out.   Talking shit and being quiet in a library are two different things also.  If anything its like walking into the library sneezing and getting kicked out for doing so. I did mute them and I did reported them. Guess it's my fault for saying that I would report them though\" something I had been chat res for b4\". I literally did nothing but repeat the threat sent towards me and laughed them off. Guess thats worthy of being permanently banned for.\n\nI already answered the \"only one game\" topic. Please reread the post.\n\nScreaming that you intend to report your teammates, and probably encouraging others to do the same, throughout the match, isn't an involuntary biological response like sneezing. It's harassment, and you specifically chose to engage in that behavior - as you say, it is indeed your fault. I'm glad you can recognize that. Yes, permabanning players who refuse to follow the rules under any circumstances is a worthwhile action to take if the goal is a better community.","replies":[{"poster":"ChiefBoiRd2","date":"2019-09-22T01:46:11.667+0000","up_votes":1,"down_votes":4,"body":"Thats not what I meant with the sneezing analogy. And I did scream anything. They told me to stfu wish death upon family members ect and all I responded with was ur being reported. I literally just got back from the 14 day how could there be more than one game already...?","replies":[{"poster":"KFCeytron","date":"2019-09-22T01:51:03.903+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChiefBoiRd2,realm=NA,application-id=ZGEFLEUQ,discussion-id=nPEfU6tf,comment-id=0001000000000000,timestamp=2019-09-22T01:46:11.667+0000)\n>\n> Thats not what I meant with the sneezing analogy. And I did scream anything. They told me to stfu wish death upon family members ect and all I responded with was ur being reported. I literally just got back from the 14 day how could there be more than one game already...?\n\nI already answered the \"someone else was worse\" topic. Please reread the post.\n\nYou got a 14-day suspension that told you the next instance of misbehavior would result in a permaban. You say you've been chat restricted for calling for reports before, so you know that's considered misbehavior. And then the first thing you do when you get back is... call for reports. And now you are permabanned.","replies":[{"poster":"ChiefBoiRd2","date":"2019-09-22T02:06:26.247+0000","up_votes":1,"down_votes":6,"body":"Wasnt saying SOME1 ELse Was wORSe im saying I wasnt screaming that im going to report some1 i simply responded.  When I say 1 game in referring to after I got the 14 day not before.  I said it about what 3 times. Saying youll report some1 3 times is worth a ban right? Gotcha i completely understand thanks for the help. Ill just ignore every1 and everything from now on.","replies":[{"poster":"KFCeytron","date":"2019-09-22T02:14:13.878+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ChiefBoiRd2,realm=NA,application-id=ZGEFLEUQ,discussion-id=nPEfU6tf,comment-id=000100000000000000000000,timestamp=2019-09-22T02:06:26.247+0000)\n>\n> Wasnt saying SOME1 ELse Was wORSe im saying I wasnt screaming that im going to report some1 i simply responded.  When I say 1 game in referring to after I got the 14 day not before.  I said it about what 3 times. Saying youll report some1 3 times is worth a ban right? Gotcha i completely understand thanks for the help. Ill just ignore every1 and everything from now on.\n\nYes, after you've been told repeatedly to stop that misbehavior, engaging it it _yet again, immediately after finishing your last punishment_, is an extremely good justification to permaban you. You will indeed be ignoring other players in game from now on, because you won't be in game with them at all, due to being permabanned.","replies":[{"poster":"ChiefBoiRd2","date":"2019-09-22T02:29:13.274+0000","up_votes":1,"down_votes":5,"body":"Yes because that was my one and only account lol . Like I said  I get it ill just ignore everyone everything  if I int I int. If I get banned ill just make another one lol.  Repeatedly isnt 1 game just saying.","replies":[]}]}]}]}]}]}]}]},{"poster":"Tele II","date":"2019-09-24T04:17:08.343+0000","up_votes":1,"down_votes":0,"body":"Calling for reports is against the rules, but I doubt you would get punished for that alone. If youre truly curious why you got punished, post your chat logs and I will without judgement towards you personally, judge the contents of the log alone and tell you where you crossed the line into punishment territory. I understand if you dont want to, but that sort of hinders anyone's ability to help you understand why you got punished. File a support ticket, and someone with Riot will explain it to you. That way you dont gotta deal with a bunch of virtue signalling strangers online. ","replies":[]},{"poster":"Sukishoo","date":"2019-09-22T01:10:11.143+0000","up_votes":1,"down_votes":0,"body":"What did the chat log show of the game(s) that come back from the ban?  Cause anything can lead to a permaban if it is justified when returning from a 14 day ban as you're on thin ice then.\n\nYou can contact Support though https://support.riotgames.com/hc/en-us and see what they have to say about it.","replies":[]},{"poster":"StevAyce","date":"2019-09-22T03:39:33.184+0000","up_votes":1,"down_votes":5,"body":"There is a reason that so many people soft inters now.. Riot just makes the issues worse. https://www.youtube.com/watch?v=VnfxGrPRYr8","replies":[{"poster":"ChiefBoiRd2","date":"2019-09-22T08:27:37.710+0000","up_votes":1,"down_votes":4,"body":"Oh ok I see why I was banned. When the yuumi was insulting my family and just saying all kinds of random shit she said cock and I responded with “ cock? Lol”. I didn’t know that was ban able ..... lol oh well.  That and the combination of telling her that I would report. Guess that’s worth a perma ban...","replies":[]}]}]}