{"poster":"SecretAgentAhri","date":"2018-02-20T22:56:21.661+0000","title":"The State Of Ahri","subforum":"Gameplay","up_votes":1,"down_votes":5,"body":"To Riot Games, and Ahri mains.\r\n\r\nSince the beginning of S3 I started Playing this Beautiful and Wonderful game League of Legends.\r\nAhri was the champ that sparked the game for me. \r\nRiot I love what your doing to the game making it fresh every patch, and to be honest League of Legends is a game I will play until the end.\r\nNow i feel its time for Ahri to get some sort of a change because I feel like she does not provide anything to the team.\r\nIn my opinion Ahri should get a new effect to her passive No changes to the healing part to the passive.\r\nQ needs new effect as well as a buff to the movement speed and damage.\r\nW is something I believe Needs a complete change overall or a HUGE BUFF the spell is Boring, and is the only thing I think in her kit that can be replaced with something New and cool.\r\nE is totally fine but maybe you can add a new on hit effect to it, and buff.\r\nR is totally fine as well but it also can use a buff and new effect.\r\nBut yeah if one day yall decide to do a full rework on ahri which to be honest she will Never need. She is awesome the way she is and one of the most iconic characters in your game.\r\nHere is a poll down below please comment I want to know what yall think.\r\nPS. I Love You RITO {{champion:103}} {{champion:103}} {{champion:103}}","replies":[{"poster":"Kaioko","date":"2018-02-20T22:59:11.729+0000","up_votes":5,"down_votes":1,"body":"You're literally asking for a buff on all her abilities.\n\nAhri is currently one of the healthiest mid laners with being well balanced and being able to do different builds and use different runes without abusing any. For the first time in a while she's actually not oppressive to the game. They need to NOT TOUCH HER.","replies":[{"poster":"SecretAgentAhri","date":"2018-02-20T23:07:24.610+0000","up_votes":1,"down_votes":2,"body":"She is healthy and not healthy at the same time","replies":[{"poster":"Kaioko","date":"2018-02-20T23:12:36.179+0000","up_votes":2,"down_votes":1,"body":"Can you elaborate on what is causing her to be unhealthy? Also her W really isn't that boring compared to over 50% of the abilities that exist in League","replies":[{"poster":"SecretAgentAhri","date":"2018-02-20T23:19:45.748+0000","up_votes":1,"down_votes":1,"body":"Yes and No but Ahri W is something i think should be like kai sa rockets but goes everywhere i really love the kaisa rockets","replies":[]}]}]},{"poster":"SecretAgentAhri","date":"2018-02-20T23:04:23.742+0000","up_votes":1,"down_votes":2,"body":"YES and No but for real tho W is Boring","replies":[]}]},{"poster":"MagicFlyingLlama","date":"2018-02-20T23:13:59.105+0000","up_votes":2,"down_votes":1,"body":"Buffs would be broken, not to mention all of this would be absurd.\n\nHer winrate is fine, what needs to happen is a power shift - most likely Q speed being removed.","replies":[{"poster":"SecretAgentAhri","date":"2018-02-20T23:17:23.794+0000","up_votes":1,"down_votes":2,"body":"they wont be broken its just a buff or new effect is something I think can spice her up a bit thats all. she does not need a nerf just a tiny buff tweak","replies":[]}]},{"poster":"AM Trick","date":"2018-02-20T23:01:14.417+0000","up_votes":2,"down_votes":3,"body":"I'm going to say yes, she does need some changes, shes no longer the healthiest mid there is, as shes fallen down the the spectrum that would label a champion bad, also kaioko, if you hadn't read, they're reworking her W, removing her speed up on q, and doing something to her passive. change is coming, just be patient","replies":[{"poster":"SecretAgentAhri","date":"2018-02-20T23:06:13.170+0000","up_votes":1,"down_votes":1,"body":"I dont think the q speed needs to be removed that will place her down with ryze.","replies":[{"poster":"AM Trick","date":"2018-02-20T23:11:43.713+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ECKOSNSD27,realm=NA,application-id=3ErqAdtq,discussion-id=EWIEvbYc,comment-id=00010000,timestamp=2018-02-20T23:06:13.170+0000)\n>\n> I dont think the q speed needs to be removed that will place her down with ryze.\n\nI'm telling you what riot's doing, not what has to be done lol","replies":[]}]}]}]}