{"poster":"Illion","date":"2015-10-29T06:34:24.856+0000","title":"Große Änderungen erwarten euch Beschwörer","subforum":"Champions & Gameplay","embed":{"description":"Preseason 2016 is right around the corner and large batch of changes are headed to the PBE soon, including oodles of marksman champion & item changes, new masteries, changes to vision and support items, the introduction of the Rift Herald, and more! Continue reading to check out the dev blog on all the upcoming chnages!","url":"http://www.surrenderat20.net/2015/10/preseason-2016-crests-horizon.html","image":"http://1.bp.blogspot.com/-EoYb4P3_2yA/VEQi5z7xVlI/AAAAAAAAEuY/UAV0IzYbpdQ/s640/sitethumb-harrowing.jpg"},"up_votes":16,"down_votes":1,"body":"Guten Morgen,\r\n\r\ndie Riotler haben scheinbar &uuml;ber Nacht die kommenden &Auml;nderungen f&uuml;r die Pre Season angek&uuml;ndigt. Das ganze scheint noch sehr experimentel zu sein und wird wohl bald auf die PBE treffen. \r\nDie Leute von Surrender@20 haben das ganze sehr sch&ouml;n zusammen gefasst, falls ihr des englischen m&ouml;chtig seid k&ouml;nnt ihr da ja mal durchlesen. \r\nDa ich grad etwas Zeit auf der Arbeit hab und noch nix dazu im Forum gefunden habe fasse ich mal ein paar Sachen zusammen.\r\n\r\nDie gr&ouml;&szlig;te &Auml;nderung erwartet die ADCs. Jeder einzelne Sch&uuml;tze erh&auml;lt eine &Uuml;berarbeitung. Man will Ihnen bestimmte Rollen geben. Einige ADCs erhalten besodere Zuwendung in Form von Anpassungen ihrer Mechaniken.\r\n\r\n**Caitlyn**: Erh&auml;lt neue Mechaniken die ihre passive in Interaktion mit den Skills &ouml;ffter ausl&ouml;sen soll.\r\n**Miss Fortune**: Ult scaliert besser und kann jetzt critten. Zudem bekommt sie eine &quot;Love Tap&quot; Mechanik die Schaden bei wechselnden Zielen erh&ouml;ht.\r\n**Kogi:** Verdoppelt nun mit W den gesamten AS und kann somit auch das Cap f&uuml;r AS sprengen. AD wird aber daf&uuml;r auf 60% reduziert.\r\n**Corki: **Passive und alle Skills f&uuml;gen nun magischen Schaden statt True DMG zu. Zudem erh&auml;lt er alle 5 min eine besondere Bombenladung die mehr DMG macht. \r\n**Quinn**: Die R hat kein CD mehr und kann eingesetzt werden um sich schneller &uuml;ber das Schlachtfeld zu bewegen. F&uuml;gt allerdings keinen Schaden mehr bei erneuter aktiviert zu.\r\n**Graves:** Basic Attaks feuern mehrere Salven, jeh n&auml;her man dran ist desto mehr DMG. Q erh&auml;lt ein Rework.\r\n\r\nAuch s&auml;mtliche anderen ADCs erhalten Anpassungen an DMG und kleineren Mechaniken. Zudem werden, &auml;hnlich wie bei den Anpassungen der Mage Items, die ADC Items eine Anpassung erhalten.\r\n\r\n\r\n**Der n&auml;chste Punkt sind die Masteries: **\r\nDiese werden stark vereinfacht. Es wird wohl 3 Stufen geben in denen man sich jeweils f&uuml;r 1 Meisterschaft entscheidet. \r\nWer WoW gespielt hat als die Masteries ge&auml;ndert wurden, wei&szlig; was uns erwartet. \r\n\r\n**&Auml;nderungen am Vision System:**\r\n\r\nRiot will das Vision Game mehr auf die gesamte Gruppe lagern als nur auf die Supports. Das tuen Sie indem Sie die Upgrades f&uuml;r die Trinkets kostenlos raushauen, zudem soll es ein LvL 3 Uprgade f&uuml;r den Sightstone geben. \r\nZudem verschwinden die Gr&uuml;nen Wards aus dem Spiel, und die &quot;Leichen&quot; der gefallenen Wards werden auf der Map verweilen um das Wardverhalten zu studieren. \r\n\r\n**Neues Objectiv im Norden:**\r\n\r\nRiot m&ouml;chte das Top Laner nicht mehr so isoliert auf der Top Lane leben und spendiert uns ein neues Ziel das auf der Nord H&auml;lfte des Rifts eingenommen werden kann. \r\nDazu krabbelt der Rift Krabbler in den Baron Pit und verwandelt sich in einen gro&szlig;en b&ouml;sen Rift Krabbler. Wird dieser erlegt gibt er ein Single Target Buff der den DMG des Buff Tr&auml;gers um 10% erh&ouml;ht und die Minions um ihn herum Baron-artig verst&auml;rkt. Diese erhalten dann einen Attack Buff, die devensiven Werte bleiben aber gleich. \r\n\r\n**Zudem will Riot noch die Start Items anpassen.**\r\n\r\nDas sind die &Auml;nderungen die uns in der Pre Season erwarten. Ich pers&ouml;nlich bin sehr gespannt und freue mich. \r\n\r\nLG","replies":[{"poster":"Ender Chest","date":"2015-10-29T10:34:49.370+0000","up_votes":3,"down_votes":0,"body":"Ich bin zwar nicht der Typ, der schnell auf neues umgewöhnt, allerdings sind die Änderungen vielversprechend.\nIch freue mich wie immer auf die neue Season!","replies":[]},{"poster":"Victors Demon","date":"2015-10-29T12:35:36.522+0000","up_votes":1,"down_votes":0,"body":"Endlich bekommen die ADC mal ein bisschen Aufmerksamkeit...\nWar ja schlimm mit den ganzen Juggernauts gefühlt Vayne als einzige wirklich sinnvolle adc zu haben, und das nur wegen den Silberbolzen.\n\nAber... mal ehrlich, warum wird einem sowas hier nicht von nem offiziellen gesagt?","replies":[{"poster":"Lady Yunalesca","date":"2015-10-29T12:58:46.861+0000","up_votes":2,"down_votes":0,"body":"Uhm sie haben ja auch einen offiziellen post gemacht in dem sie die großen Änderungen vorstellen.Und die Einzelheiten kann man immer auf den Seiten lesen,was aber halt alles erstmal noch nichts endgültiges ist.","replies":[]}]},{"poster":"Acelyte","date":"2015-10-29T10:08:52.512+0000","up_votes":2,"down_votes":0,"body":"das wird eine lange preseason mit viel umgewöhnung :O\nvieles klingt erstmal sehr interessant, aber man muss erstmal wieder so vieles ausprobieren und testen. wird ne ganze weile dauern bis sich da was einpendelt.\n\nich werde sicherlich alles schon im vorfeld aufm PBE testen :D","replies":[]},{"poster":"Imaqtone","date":"2015-10-29T07:01:36.642+0000","up_votes":2,"down_votes":0,"body":"Als Adc main für mich sehr praktisch!!","replies":[]},{"poster":"Lord Vilich","date":"2015-10-29T09:13:36.731+0000","up_votes":2,"down_votes":1,"body":"Pls no tanky adcs, thx alot","replies":[]},{"poster":"Veezey","date":"2015-10-29T17:01:52.725+0000","up_votes":1,"down_votes":0,"body":"Wie immer immer freue ich mich extrem auf die Preseason :D","replies":[]},{"poster":"Ereldra","date":"2015-10-29T12:52:56.665+0000","up_votes":1,"down_votes":0,"body":"Wer wie ich neugierig auf  die neuen Items ist - gibt schon die ersten Bilder von einigen neuen Sachen und Änderungen vom Testserver. Natürlich alles unter Vorbehalt, aber so als Eindruck:\nhttp://imgur.com/a/lCnx5\nhttp://puu.sh/l1t5A/f5b309790a.jpg\nhttp://puu.sh/l1sov/1392f01001.jpg\nhttp://puu.sh/l1sG1/132184bcea.png\nhttp://puu.sh/l1tUx/9598271ed9.jpg\nhttp://puu.sh/l1sXh/8c39d070cb.jpg\nhttp://puu.sh/l1rPf/eb1e4b5463.jpg\n\n-------------------\n\nNachdem ich so alles durchgelesen habe, und auch die Diskussionen und Antworten der Dev's gelesen habe... ich bin irgendwie skeptisch. Meine einzigen beiden ADC's waren Tristana und Ashe; die Änderungen bei Trist finde ich komplett blöd (mehr Schaden auf dem Rocket Jump, aber adfür kein Q/E Reset mehr? Ist doch unsinnig, wer jumpt denn als Tristana in einem Teamfight auf die Gegner für den dmg?). Und bei Ashe seh ich das auch eher als Nerf; okay, Q hat keinen Cooldown mehr, aber man kann sie nicht mehr frühzeitig aktivieren, wenn man sie wirklich braucht, und die W gibt keinen Stack mehr... ich find es eigentlich so schon schwer genug, den Focus aufzuladen um die Q zu aktivieren, das ist jetzt eher noch schwerer. Die Änderungen von der Passiven sollen ja auf +/- 0 rauskommen. Und dafür kriegt sie nen doppelten Slow bei Crits... naja^^\n\nWas mir noch mehr Sorge macht, ist, wie sich die neuen Items auf nicht ADC's auswirken. Ich meine... Deaths Dance auf Riven? Gute Güte. Heftiger Lifesteal und dann die Passive, die Burst-Schaden vermindert - also das einzige, womit man RIven kleinkriegen konnte? \nIch habe etwas die Befürchtung, dass die Items zu sehr auf ADC's ausgerichtet wurden, aber etwas vergessen wird, wie Melee-AD Champs wie Riven, Yasuo, Zed usw. davon profitieren könnten...\n\nNunja, wir werden sehen, wie das alles wird, aber als hauptsächlicher Midlane-Mage-Spieler hab ich bei den ganzen Änderungen irgendwie ein etwas mulmiges Gefühl, dass die Änderungen zu sehr AD-Champions bevorteilen werden. Hoffen wir mal das beste^^","replies":[]},{"poster":"Crash0104","date":"2015-10-29T09:06:06.219+0000","up_votes":1,"down_votes":0,"body":"wow danke das du das alles zusammen gefasst hast ich Persönlich freue mich auf Season 6 weil ich ersst seit anfang season 5 spiele","replies":[]}]}