{"poster":"DeadChixDonSayNo","date":"2015-12-26T23:06:13.023+0000","title":"Nerft Jax endlich -.-","subforum":"Champions & Gameplay","up_votes":4,"down_votes":14,"body":"Bitte Rito ernsthaft jetzt du kannst gegen Jax nichts  machen au&szlig;er vl vor minute 20 das spiel beenden aber das ist unm&ouml;glci du kannst jax das early soviel versauen wie du willst sobald er rageblade hat ist das game over man kann einfach nichts machen solbald er devourer und ragblade hat -.- also bitte nervt rageblade Jax oder schei&szlig; devourer das game war 1000 mal besser als es noch kein devourer gab aber ja man siehts es euch einfach an das ihr zu geldgeilen s&auml;cken werdet und keine ideen mehr habt -.-","replies":[{"poster":"LordOfHell90","date":"2015-12-27T13:31:08.908+0000","up_votes":2,"down_votes":0,"body":"Pick Trundle und lass Jax heulen oder Pack CC auf ihn, Exhaust usw. Jax ist alles andere als OP","replies":[]},{"poster":"D4RKEVA","date":"2015-12-27T09:57:21.741+0000","up_votes":3,"down_votes":1,"body":"Selbst mit devourer und rageblade ist er kein free\nWin.\n\nJax ist sehr leicht vorhersehbar und ein adc+supp können ihn relativ leicht töten","replies":[]},{"poster":"Sakunosuke Oda","date":"2015-12-29T12:51:20.589+0000","up_votes":1,"down_votes":0,"body":"Malphite und dein Jax kann nichts mehr machen","replies":[]},{"poster":"achmedsender","date":"2015-12-26T23:50:21.722+0000","up_votes":1,"down_votes":3,"body":"Das Problem ist glaub eher das Rageblade. Wenn Riot mal Lust hat es endlich anständig zu nerfen ist Jax auch wieder OK (immer noch anstrengend dagegen zu spielen aber da ist er nicht der einzige).\n\nMeine Nerf-Vorschläge an Rageblade\n\n1. Man braucht mehr Stacks um die Passive zu aktivieren (bzw. Melee-AA zählen nicht doppelt)\nund/oder\n2.Die Stats (Attackspeed/AD/AP) reduzieren\nund/oder\n3. Grundschaden der Passiven um ca. 10 Schaden verringern\n\nAm besten fände ich eine Kombo aus 1. und 3.\n\nSonst ist Jax eben wie früher, anfangs weak und danach godlike im 1v1, aber im teamfight trotzdem gut weggepeelt. \nDazu kommt dass er doch nicht ganz so ein Noobchampion ist, solange er eben nicht den brachialen Schaden hat um alles wegzuknüppeln. Früher kam er daran eben nur durch gutes Spielen, jetzt einfach mittels Rageblade.","replies":[]}]}