{"poster":"ScandalouSoul","date":"2017-10-03T14:41:16.096+0000","title":"Problemi di ping help please :(","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Da un paio di mesi a questa parte ho problemi con il ping in certi orari (nel pomeriggio) sono telecom attualmente con una 20 mega e nel pomeriggio raggiungo persino 4000 di ping... Faccio svariati speedtest e mi risulta sempre sotto i 40 di latenza ma in game sale a dismisura e non riesco davvero a capirne il motivo. Non ho nulla in download o che possa disturbare la rete, vi prego aiutatemi :(","replies":[{"poster":"Chroniicles","date":"2017-10-03T16:47:58.504+0000","up_votes":1,"down_votes":0,"body":"Ciao! Se pinghi con lo speedtest di Ookla una destinazione \"vicina\", è plausibile che ci sia una discrepanza di risultati con il ping che hai ingame, senza escludere un problema ;) il modo giusto è pingare da prompt il server con questo comando:\n> ping 104.160.141.3 -n 10\n\nGiusto a titolo informativo :D \nper il resto, se ti succede sempre intorno la stessa fascia oraria, controlla che non siano programmati aggiornamenti sul pc o altri dispositivi collegati alla rete","replies":[]},{"poster":"mangialavandini","date":"2017-10-03T14:57:47.710+0000","up_votes":1,"down_votes":0,"body":"Ciao,\nProva a spulciare qua e la tra le guide Riot ogni tanto, troverai sicuramente qualcosa al caso tuo.\nPer questa volta ho fatto io con una piccola ricerca di 2 min, in caso ricorda sempre di guardare su \"aiuto e supporto\" nella voce a sinistra del forum, dove sicuramente troverai post inerenti al tuo problema.\n\nhttps://lagreport.euw.leagueoflegends.com/it/\n\nAllora, questo fantastico sito è stato creato da Riot stessa, ti analizza la tua connessione avuta nell'arco di 20 game (credo), dandoti una valutazione generale. Poi ti da utili consigli su come migliorarla o semplicemente risolvere il problema, con ulteriori spiegazioni se ti interessasse capire cosa stai facendo oltre che  a farlo e basta.\n\nSpero di esserti stato di aiuto, buona serata evocatore.","replies":[{"poster":"ScandalouSoul","date":"2017-10-03T15:05:00.004+0000","up_votes":1,"down_votes":0,"body":"Ti ringrazio! Purtroppo sono nuovo del forum e sono dal cellulare quindi è un po' scomodo ma vedrò :)","replies":[{"poster":"mangialavandini","date":"2017-10-03T15:13:34.023+0000","up_votes":1,"down_votes":0,"body":"Di nulla, se hai perplessità rispondimi pure sotto questo commento\n\nah, quel procedimento fallo dal pc non da cellulare, in quanto va a calcolare il ping dal punto i cui hai eseguito le partite, se lo fai da cellulare non avrà effetto.","replies":[]}]}]}]}