{"poster":"krylo","date":"2015-01-22T13:50:57.844+0000","title":"LF Players to form a Team. Pref. rank Gold or Higher","subforum":"Team Recruitment","up_votes":2,"down_votes":0,"body":"IGN: Krylo \n\nHi, I finished Plat 3 last season. I've had an interest in this game since Season 2 and I'd like to finally start a team.\n\nIt would help if you could voice chat, but this is not a requirement atm. \n**There is no rank requirement.** If you are serious about improving, I'd love to help you no matter what rank. Gold or higher is only more preferable.","replies":[{"poster":"Vatler","date":"2015-01-25T12:09:51.402+0000","up_votes":1,"down_votes":0,"body":"Hey im adc/ supp main i finished g4 last season. Id love to join a ranked 5's team.\nThanks.\nIGN: Vatler","replies":[{"poster":"krylo","date":"2015-01-27T00:06:16.727+0000","up_votes":1,"down_votes":0,"body":"Added :) pm me in-client","replies":[]}]},{"poster":"Eradar","date":"2015-01-25T05:38:08.772+0000","up_votes":1,"down_votes":0,"body":"Hey, at the end of last season I was Plat 5. Been playing this game since season 1 but really played more for fun rather than ranking all the time. I'd like to join the team and experience team ranked and take more interest in ranked games than before. I'm a support main but able to play any role. \nIGN: Eradar","replies":[{"poster":"krylo","date":"2015-01-26T23:55:54.281+0000","up_votes":1,"down_votes":0,"body":"I've added you :)","replies":[]}]},{"poster":"Shke","date":"2015-01-25T09:26:42.478+0000","up_votes":1,"down_votes":0,"body":"hi I am an AD main, only finished at silver 1 last season but I believe I am more capable then that, hopefully will consider me {{champion:429}}","replies":[]},{"poster":"Froggy GG","date":"2015-01-24T06:58:34.872+0000","up_votes":1,"down_votes":0,"body":"Hey, also looking for a team. Was Gold V last season, can go anywhere. IGN: Froggy GG","replies":[]},{"poster":"Dogma","date":"2015-01-23T01:13:31.054+0000","up_votes":1,"down_votes":0,"body":"Hi mate! I looking for a team, i'm closed last season gold2 and now I'm gold 3 support main. add me Dogma.","replies":[{"poster":"krylo","date":"2015-01-23T01:20:22.884+0000","up_votes":1,"down_votes":0,"body":"Done is done :)","replies":[]}]},{"poster":"Buttsubushi","date":"2015-01-22T16:39:50.084+0000","up_votes":1,"down_votes":0,"body":"So you seem pretty damn serious if you've played from season 2 and have waited until now to start a ranked team...\n\nWell i guess,\nI finished bronze 1 last season and i have been playing from pre-season 4. I main adc and support, and can play some junglers and top laners. I'm more of an objective focused player rather than a kill focused. I main Jinx, tristana, vayne, thresh, morgana, zilean, tryndamere (AD and AP). I have played some games in ranked 5's but none really passed the provis games.\n\nI study at uni full time.","replies":[{"poster":"krylo","date":"2015-01-23T01:10:52.037+0000","up_votes":1,"down_votes":0,"body":"Awesome\nAdd me and PM me in-client so we can talk :)","replies":[]}]}]}