{"poster":"m1nx","date":"2015-07-26T20:10:09.746+0000","title":"Solo/Duo getrennt?!","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Gr&uuml;&szlig;t euch,\r\n\r\nmir gehts heute mal um etwas, was mich schon seit l&auml;ngerem st&ouml;rt und zwar das solo und duo zusammen spielen. Ich selber spiele haupts&auml;chlich solo daf&uuml;r ist die Option solo ja auch da, doch leider kann man auch als duo spielen und bisher hab ich die Erfahrung gemacht das ich st&auml;ndig wenn ich gegen duo leute spiel verliere! denn wenn ich was aus LoL gelernt habe ist, das 2 eingespielte das ganze spiel drehen k&ouml;nnen. Nat&uuml;rlich ist mir bewusst das mein dann auch ein duo hat, dennoch ist mir das relativ egal, es geht ums prinzip das ich es solo spieler einfach nur unfair finde wenn man sich als duo anmelden kann, deshalb bin ich daf&uuml;r das dass abgeschafft wird bzw. getrennt wird, es nervt einfach nur! und das argument ich k&ouml;nne doch auch duo spielen lass ich nicht gelten, wenn ich mich solo anmelde erwarte ich auch nur solo spieler und nix anderes.\r\n\r\nmfg M1nx","replies":[{"poster":"Take Snickers","date":"2015-07-26T20:19:08.575+0000","up_votes":5,"down_votes":0,"body":"Wie möchtest du mit \"nur-duo-Spielern\" ein 5er Team zusammenbekommen? :D","replies":[{"poster":"Fermi Paradox","date":"2015-07-26T20:25:50.055+0000","up_votes":1,"down_votes":0,"body":"genau diese Frage ist mir auch in den Kopf gekommen...x'D","replies":[{"poster":"Bergelmir32","date":"2015-07-26T22:44:22.029+0000","up_votes":1,"down_votes":0,"body":"Hexakill ... Ranked ...\nhuehuehue","replies":[]}]}]},{"poster":"m1nx","date":"2015-07-26T21:06:43.553+0000","up_votes":1,"down_votes":1,"body":"ja ich glaube das lässt sie auch extra blöd umsetzen, ist halt trotzdem frustrierend, gerade wieder eins gespielt und wieder verloren das is doch nich normal.","replies":[{"poster":"Fermi Paradox","date":"2015-07-26T22:04:20.623+0000","up_votes":3,"down_votes":0,"body":"Nun ja, laut Matchmaking-System hast du jedes Mal, wenn zwei Duo-Partner im gegnerischen Team sind, auch welche in deinem Team, so unfair ist es jetzt auch nicht.\nKann halt sein, dass deine Duo-Leute versagen und die Gegner zusammen richtig abgehen. Kann aber auch umgekehrt sein.\nMatchmaking ist auch immer ein kleines Glücksspiel^^","replies":[]}]},{"poster":"Danny89","date":"2015-07-27T14:33:09.366+0000","up_votes":1,"down_votes":0,"body":"Du findest, du verlierst wegen DuoQ im Gegnerteam. Ich finde, ich verliere wegen DuoQ im eigenen Team.\n\nIch mag die DuoQ Funktion auch nicht, aber sie wird sehr sicher nicht geändert. Sie hält auch niemanden \"wirklich\" auf (Dia1 und höher abgesehen, wenn dann LCS/Challengerseries Duo Botlane oder Mid/Jungle Duos die Spiele halt alleine entscheiden), da das Matchmaking (wieder bis auf Dia1 und höher) fast ausschließlich DuoQs mit DuoQs matcht. Ergo haben beide Teams welche.\n\nZusätzlich solltest du vielleicht wissen, dass DuoQs immer niedriger (Ausnahme: Dia1 und höher) in der Elo/MMR sind als alle anderen im Spiel. Solltest du ja also stompen können, wenn du besser bist.\n\nIch bin by the way Diamant 3, fast 2. Also keine Ausrede von \"aber in niedrigeren Ligen hat das mehr Einfluss, ich komm deswegen nicht hoch\" - nein, hat es nicht, im Gegenteil: Weniger. Unterschied ist lediglich wenn, wie erwähnt, LCS/Challengersieres Duos ihr Unwesen in der Solo/DuoQ treiben.","replies":[{"poster":"m1nx","date":"2015-07-27T15:30:29.337+0000","up_votes":1,"down_votes":0,"body":"das stimmt so nicht, ich hab schon welche als duo gehabt die in der elo deutlich höher sind, das ist sogar sehr häufig der fall, außerdem gibt es ja noch smurf accounts, das hat also nix zu sagen.","replies":[{"poster":"Danny89","date":"2015-07-27T17:39:13.086+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=m1nx,realm=EUW,application-id=ip27PlEH,discussion-id=jT6rfyYO,comment-id=00030000,timestamp=2015-07-27T15:30:29.337+0000)\n>\n> das stimmt so nicht, ich hab schon welche als duo gehabt die in der elo deutlich höher sind, das ist sogar sehr häufig der fall, \n\nDie Informationen nimmst du woher? Woher willst du die Elo/MMR deiner Mitspieler wissen? Außer du kennst natürlich das Ligasystem in und auswendig (http://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo) und hast PRO DUO, was du dem unterstellst, zahlreiche Vergleiche gemacht um ihre Elo/MMR halbwegs plausibel schätzen zu können.\n\n\n> [{quoted}](name=m1nx,realm=EUW,application-id=ip27PlEH,discussion-id=jT6rfyYO,comment-id=00030000,timestamp=2015-07-27T15:30:29.337+0000)\n>\n> außerdem gibt es ja noch smurf accounts, das hat also nix zu sagen.\n\nDas ist so wie: \n\n\"Aus Äpfel kann man so viel machen. Sie schmecken zusätzlich gut und sind gesund\"\n\n\"Boah ist das Wetter schlecht\" <<< Das hat absolut nichts mit Äpfel zu tun. Nicht mal der Birnenverglich wäre ansatzweise heranzuziehen, so weit ist dein Kommentar über \"Smurfs\" vom Thema entfernt.\n\n\n\n\nIch bin froh, dass ich das schon als Zitat rumliegen habe:\n\n\"ad 4. \"Smurfs\": Irrelevant. Leute, die für Smurfs in Frage kommen, müssen mindestens Platin oder höher sein. Das sind nicht mal 15% aller Spieler. Das heißt: 85% der Spieler kommen als \"realer Smurf, der low Elo Spiele carryn kann\" nicht mal ansatzweise in Frage. Dann ist die nächste Frage: WIESO sollte jemand dieser 15% smurfen? Ich habe viele High Elo Leute in der Friendslist. Da smurfen viele überhaupt gar nicht. Ich selbst hab keinen einzigen Smurf (würde auch unter die 15% fallen). Natürlich kenne ich auch Leute, die smurfen. Aber wen interressiert 1er von 37.500 (2.500.000 Rankedspieler Eu-W, davon 15% sind 375.000 und von diesen vielleicht 10% die smurfen... obwohl ich nicht glaube, dass auch nur ansatzweise 10% von den in Frage kommenden Spielern Smurfs hat. Das wäre 1 von 10. Wieso sollte jemand Smurfs haben? Wie gesagt, ich selbst hab keinen einzigen und spiele seit 3 Jahren ausschließlich in Diamant. Und die meisten, die ich kenne, haben auch keine Smurfs. Ich kenne wen, der hatte 8 Smurfs. Der zählt dennoch nur als 1 Spieler!) Spielern? Du wirst den so gut wie nie in nem Spiel haben. Objektiv gesehen. Subjektiv gesehen ist das nur eine von vielen Ausreden von Low Elos bzw. \"die Schuld zu verlieren bei allen / allem anderen, nur nicht bei sich selbst suchen\"\"","replies":[{"poster":"m1nx","date":"2015-07-27T17:52:54.183+0000","up_votes":1,"down_votes":1,"body":"so ein müll, es ist fakt das man sich smurfs acc. machen kann wie man lustig ist und warum sollte es die spieler daran hintern das nicht zu machen? gibt halt leute die es genießen lowis zu killen, obwohl ich mich jetzt nicht unbedingt gleich als low bezeichnen würde. Außerdem beschäftige ich mich nicht mit jedem kleinen mist in LoL, das interessiert mich auch nicht, es ist eben nur eine feststellung das ich oft gegen duos verliere und naja meine duos anscheint immer zu schlecht sind, was irgendwie auch komisch ist.","replies":[{"poster":"Danny89","date":"2015-07-27T18:03:33.551+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=m1nx,realm=EUW,application-id=ip27PlEH,discussion-id=jT6rfyYO,comment-id=0003000000000000,timestamp=2015-07-27T17:52:54.183+0000)\n>\n> so ein müll, es ist fakt das man sich smurfs acc. machen kann wie man lustig ist und warum sollte es die spieler daran hintern das nicht zu machen? gibt halt leute die es genießen lowis zu killen, obwohl ich mich jetzt nicht unbedingt gleich als low bezeichnen würde. Außerdem beschäftige ich mich nicht mit jedem kleinen mist in LoL, das interessiert mich auch nicht, es ist eben nur eine feststellung das ich oft gegen duos verliere und naja meine duos anscheint immer zu schlecht sind, was irgendwie auch komisch ist.\n\nEntweder du hast meine Texte nicht gelesen\n\nOder du verstehst sie nicht\n\nOder du willst sie nicht wahrhaben\n\nOder dich \"interessiert das System sowieso nicht, weil du dich nicht mit jedem \"kleinen Mist in LoL\" beschäftigst\".\n\n\n\nEgal was die Antwort ist, es führen alle zum selben Ergebnis: \"QQ mimimimimi QQ, die bösen DuoQs und die Smurfs verhindern, dass ich aufsteige\". \n\nSowohl DuoQs als auch Smurfs sind irrelevant für DEIN Aufsteigen, wenn du dich informieren würdest (d.h.: Die Texte durchlesen und den Links folgen)","replies":[]}]}]}]}]},{"poster":"NG Drakuboy","date":"2015-07-26T22:14:32.188+0000","up_votes":1,"down_votes":0,"body":"Musst drauf hoffen dass die DuoQ auf die Bot geht. Die feeden dann immer.","replies":[]}]}