{"poster":"Lemon Jhin","date":"2018-10-10T16:08:26.493+0000","title":"perma ban forzato e mancato supporto","subforum":"Aiuto e supporto","up_votes":1,"down_votes":6,"body":"perma bannato per una chat privata, per via di un report da parte di un avversario che ha reportato l&#039;intera nostra squadra di flame.\r\nquesta &egrave; la mia chat di quella partita:\r\n\r\n[1:12] [All] Fiora: singed pls non mi fare il culo \r\n[8:59] Fiora: ti ha usato la W durante il fear? \r\n[9:11] Fiora: si \r\n[14:37] [All] Fiora: io voglio sta ultima S.... \r\n[14:42] [All] Fiora: per la mastery. \r\n[17:41] Fiora: 4 top lol \r\n[17:43] Fiora: che colpo \r\n[19:47] Fiora: 3 top \r\n[26:22] Fiora: kaisa la stupro se mi leveta singed di dosso \r\n[27:37] Fiora: se gruppassimo? \r\n[27:43] Fiora: e andiamo dritti mid? \r\n[33:18] Fiora: possiamo vincerla pls? \r\n[33:54] Fiora: prima ne abbiamo uccisi 3 \r\n[33:57] Fiora: tu e ww eravate in jgl \r\n[35:53] Fiora: oooho \r\n[36:08] Fiora: OOOOOH \r\n[38:12] Fiora: madoona \r\n[38:18] Fiora: DAII \r\n[39:42] Fiora: OOOH \r\n[39:44] Fiora: FIOI \r\n[39:49] Fiora: POTEVATE FINIRLA ORE FA.\r\n\r\n\r\nsono stato reportato da un avversario per flame che a quanto pare non accettava il fatto di aver perso e per chiss&agrave; quale motivo. notare che l&#039;unica frase globale che si possa ritenere boh &quot;offensiva&quot; era la prima &quot;singed pls, non mi fare il culo&quot; palesemente un modo scherzoso e slang del tutto normale.\r\n\r\ndopo essere stato reportato da quell&#039;avversario per &quot;flame&quot; la riot ha deciso di controllare altre chat, di cui l&#039;emittente del report non era a conoscenza e che di certo non era coinvolto in alcun caso. e bannarci in 3 di noi, perci&ograve; che ci siamo scritti nella lobby, 2 di noi 14gg io permanentemente. Una chat privata nostra di noi 5, che per quanto possa essere stata squallida e infantile, era riservata a noi 5! nessuno &egrave; stato offeso, non c&#039;era alcun diverbio, solo parole al vento tra di noi per farci 4 risate.\r\n\r\n\r\ndetto questo dopo essermi consultato con il &quot;TEAM DI SUPPORTO&quot; per una intera settimana, essi si rifiutano di venirci incontro, continuando a dirmi che me la sono cercata, e che non leveranno il ban per qualsiasi ragione al mondo, dopo che io c&#039;ho speso molti soldi e moltissime ore.\r\n\r\n\r\nUn ban forzato, da parte di un player palesemente tossico che non accetta le sconfitte, che decise di trollare avendo successo grazie alla stessa RIOT che insiste nell&#039;affermare che fa di tutto per punire persone del genere^\r\n\r\nLa realt&agrave; &egrave; che in questo caso, come per altri molto probabilmente, lei stessa &egrave; stata complice di un TROLL abusando del suo potere e utilizzando elementi INCOERENTI alle ragione del report, per punire 3 persone colpevoli solo ed esclusivamente di divertimento e comunicazione.\r\n\r\nQuindi pensateci bene prima di spendere quei 5 euro, dato che a quanto sembra che quando decidano di chiudere un account, lo fanno e basta.\r\nSbattendosene di cosa tu possa aver perso con la chiusura di quell&#039; account. rispondendoti, DOPO TEMPI LUNGHISSIMI, anche giorni nei casi dei loro &quot;MERITATI GIORNI DI RIPOSO&quot; le stesse solite cose. alternandosi giorno per giorno da un supporter all&#039;altro, perch&eacute; deve essere stancante iniziare un ticket e tenerselo per s&eacute; fino alla finale risoluzione&hellip; servono almeno 5 Persone diverse, con 5 opinioni diverse ma che comunque danno le stesse risposte inutili.\r\n\r\nritenendo il loro sistema valido e super efficace. \r\nc&#039;&egrave; da domandarsi allora, a cosa diavolo servono loro, se ci&ograve; che decide il sistema &egrave; legge. il sistema non sbaglio, loro sono li per ripeterlo e ripeterlo all&#039;infinito. \r\nLo chiamavano SUPPORTO.\r\n\r\nUn perma bannato, vittima di abusi da parte di una compagnia che va rivalutata professionalmente.","replies":[{"poster":"FireM1nd","date":"2018-10-10T16:40:55.214+0000","up_votes":6,"down_votes":2,"body":"AHH KUESTE KASTE E I LORO GOMBLODDI!!\n+++ KUELLO KE NN TI DICONO +++\n\nEhh.. niente da fare, mate. I ban per flame non vengono mai rimossi, è la politica aziendale. Anche perché generalmente il soggetto ha diversi avvertimenti prima di arrivare al provvedimento finale. Oltretutto,  guardando la chat,  che tu fossi in compagina di amici o meno, c'è sia un po di Spam,  sia un po di toni indirettamente aggressivi, che vanno a rientrare comunque nella categoria del flame (come da descrizione nella scheda di report a fine partita).","replies":[{"poster":"Lemon Jhin","date":"2018-10-10T17:05:16.429+0000","up_votes":1,"down_votes":2,"body":"[38:12] Fiora: madoona\n[38:18] Fiora: DAII\n[39:42] Fiora: OOOH\n[39:44] Fiora: FIOI\n[39:49] Fiora: POTEVATE FINIRLA ORE FA.\n\nnon è offensivo, non era flame solo una sincera constatazione che il game poteva finire molto prima, è stato prolungato per una 15 di minuti perché il team non si era rifiutato di colpire il nexus.  e comunque il report è stato inviato da uno della squadra avversaria, che non ha letto nulla riguardante quella chat, poiché le uniche cose che ho scritto in global erano:\n\n [All] Fiora: singed pls non mi fare il culo\n[14:37] [All] Fiora: io voglio sta ultima S....\n[14:42] [All] Fiora: per la mastery.\n\n\nfine. mi hanno bannato senza una accusa reale.\n\nrispetto il tuo commento, ammetto che in passato ho flammato ed ero un po tossico, ma sempre contro coloro che mi flammavano o mi intavano le ranked, solo perché auto fillato o stupidaggini varie.\nalla fine la maggior parte dei ban è rifilata alla gente che ha le palle di rispondere ai REALI TOXIC PLAYERS, che tutt'ora girano indisturbati in questo gioco. \ndopo il ban di 14gg ho rigato dritto, e trovarmi l'account bloccato dopo 2 mesi dall'ultimo warning, per via di false accuse da parte di una persona stressata del team avversario che utilizza il bottone report a random per reportare chiunque perda la laning phase, e non negatelo perché è pieno di questa gente. la bot perde finisce 1/4 bisogna reportarle per inting… che ragionamente è?\n\nIo ho perso l'account per via di un false report, perché una persona ha letto questo:\n\n[All] Fiora: singed pls non mi fare il culo\n[14:37] [All] Fiora: io voglio sta ultima S....\n[14:42] [All] Fiora: per la mastery.\n\n\ne m'ha reportato perché si è ritenuta offesa… PER COSA doveva essersi ritenuta offesa^.\nha poi avuto ragione da parte della riot, perché in lobby ridendo e scherzando abbiamo utilizzato un linguaggio infantile.\nchi mi ha reportato non ha idea di cosa abbiamo scritto in lobby per tanto non può assolutamente ritenersi offeso.\ndimmi dov è la giustizia in tutto questo.","replies":[{"poster":"FireM1nd","date":"2018-10-10T23:48:54.331+0000","up_votes":4,"down_votes":0,"body":"Mate..  non dico mica che sia giusto. Dico solo che loro stanno semplicemente applicando le norme contrattuali che hai accettato cliccando \"ACCETTA\". Punto. Poi magari si, si può anche dire che in questo caso abbiano avuto un po troppo zelo, ma.. cioè, non cambia molto..","replies":[{"poster":"Lemon Jhin","date":"2018-10-11T00:00:39.685+0000","up_votes":1,"down_votes":1,"body":"V. Trasmettere o comunicare qualsiasi contenuto CHE VENGA RITENUTO OFFENSIVO, ivi compreso un linguaggio che risulti illegale, dannoso, minaccioso, ingiurioso, persecutorio, diffamatorio, volgare, osceno, sessualmente esplicito od opinabile a livello razziale, etico o altro.\n\nquesto è la norma che avrei violato^\nlinguaggio che venga ritenuto offensivo… dato che nessuno dei presenti si è ritenuto offeso, non vedo perché io adesso dovrei essere tutt'ora bannato.\nhanno applicato una punizione, forzata. \nnessuno di noi ha reportato l'altro per ciò che è avvenuto nella lobby. \nla squadra avversaria c'ha reportato per flame INESISTENTE. \nIl sistema ha utilizzato elementi incongruenti per applicare una punizione SLEALE e FORZATA.","replies":[]}]}]}]},{"poster":"mangialavandini","date":"2018-10-11T08:23:44.765+0000","up_votes":2,"down_votes":1,"body":"Daje ora stai esagerando, stai palesemente facendo vittimismo.\n\nTi riassumo quanto incoerente è il tuo modo di fare ora:\n\nHai calpestato PER SBAGLIO (visto che ti piace QUESTO metodo di scrittura, usiamolo)\n\nTi difendi dal fatto che non valutano, coff coff... è una macchina che controlla..coff...non sentimenti ma solo REGOLE\n\nQuando sei in palese torto, oltre a negarlo lo contesti pure e quando non ti danno il lecca lecca consolatorio (sban), ulteriormente fai una CAMPAGNA  CONTRO LA RIOT, su..un sito dedicato ad esso, furbo.\n\nè chiaro pulito e semplice, NON SCRIVERE NELLE CHAT RIOT, FRASI O PAROLE CHE NON SONO CONSENTITE, non viene contato il contesto ma il puro significato della parola che essa può dare, sai perchè? perchè ogni persona reagisce in maniera diversa ad una parola anche se possa sembrare innocente, non si può valutare solo il peso della conversazione è altamente stupido e controproducente, quindi : pinco pallo e pallino SAI di non poterlo dire e allora tu che fai?\n\nEi pallo come sta pallino? \n\nSi è una domanda semplice ed educata, \nMA\nNON puoi permettertelo, diavolo è così difficile come concetto? lo capisci bene non lo capisci sei fuori.","replies":[{"poster":"Bearer of doom","date":"2018-10-11T17:50:49.221+0000","up_votes":3,"down_votes":0,"body":"Grazie a Dio qualcuno ha risposto intelligentemente. La situazione è questa Riot ha ragione tu hai torto. Poi non puoi tirare fuori la storia dei soldi che ci hai lasciato, è stupido! -_-\" League of Legend è un gioco free ti play e se tu decidi di lasciarci dei soldi è una tua scelta, nessuno ti ha obbligato.","replies":[]}]},{"poster":"Pellah","date":"2018-10-11T07:06:56.846+0000","up_votes":5,"down_votes":2,"body":"1) Pensa se davvero 2 (o più) giocatori si flammassero a vicenda, venissero bannati e poi andassero al Support a dire \"it was just a prank, siamo amici xdxd\". La RIOT come dovrebbe accertarsene?\n\n2) La chat è fatta per condividere informazioni e organizzare tattiche piuttosto che cazzeggiare, c'è chi trova questi comportamenti in chat fastidiosi. Conta inoltre che su lol ci sono pure giocatori molto giovani a cui farebbe meglio evitare di leggere certi termini...\n\nPotevate passarvi discord o ts per cazzeggiare, a scrivere in chat lo avete fatto a vostro rischio e pericolo. \n\n3) Se sei stato permabannato hai già violato un paio di volte le regole quindi non fare tanto la povera vittima che le tue cose le hai fatte Mr. \"vittima di abusi\".","replies":[{"poster":"dragonskiller49","date":"2018-10-11T17:23:16.954+0000","up_votes":3,"down_votes":4,"body":"La chat di LoL non serve a niente se non per creare flame o cercare ragazze o fare delle battute che non fanno ridere","replies":[{"poster":"Pellah","date":"2018-10-11T17:36:57.599+0000","up_votes":4,"down_votes":2,"body":"Hai una buona memoria allora te che i timer delle spell li ricordi a memoria, fortunato te :P","replies":[{"poster":"dragonskiller49","date":"2018-10-11T17:50:35.502+0000","up_votes":2,"down_votes":2,"body":"puoi spiegare? xD","replies":[{"poster":"Pellah","date":"2018-10-11T18:01:21.440+0000","up_votes":3,"down_votes":2,"body":"La chat è uno strumento utilissimo per registrare le spell avversarie:\n\n1) Top laner nemico flasha\n2) Usi il ping sul flash\n3) quando recalli guardi il timestamp della chat per capire quando il nemico ha flashato\n4) Aggiungi 5 minuti e scrivi in chat (ipotizzando che l'ha usato al minuto 5:15 tu segni il 10:15).\n\nCosì hai lì il tuo bel promemoria \"Top f 1015\" (senza due punti per far più veloce) e sai esattamente quando riavrà il flash oltre che informare i compagni di squadra :)","replies":[{"poster":"ITP MENNY","date":"2018-10-11T20:14:06.157+0000","up_votes":1,"down_votes":1,"body":"Over 200 iq","replies":[]}]}]}]}]}]},{"poster":"dragonskiller49","date":"2018-10-10T17:18:25.114+0000","up_votes":4,"down_votes":2,"body":"scusa ma non penso che puoi essere bananto se scrivo tra gli amici a meno che la persona non faccia uno screenshot e manda il ticket, perchè io quando perdo addo i nemici e flammo :/","replies":[{"poster":"King Puleg","date":"2018-10-11T11:59:57.871+0000","up_votes":2,"down_votes":3,"body":"Honor 5 meritato 2.0 per il giustiziere della landa.","replies":[{"poster":"dragonskiller49","date":"2018-10-11T16:21:47.467+0000","up_votes":2,"down_votes":1,"body":"Scusami, ma se io riesco ad essere furbo non mi faccio bannare l'account sono cosi veloce ad insultare nel friend lsit che i nemici al posto di fare lo screen shot mi rispondono, cosa vuoi che ti dica se non : me lo sono meritato questo honor 5?","replies":[]}]},{"poster":"Ringiel","date":"2018-10-11T11:00:24.719+0000","up_votes":1,"down_votes":0,"body":"la chat in game viene salvata,anche se scrivi in wisp,mentre se ci chatti dopo necessita di screen","replies":[]}]},{"poster":"Axiom Sama","date":"2018-10-10T18:27:23.439+0000","up_votes":3,"down_votes":2,"body":"Ciao a tutti, io ero in partita con loro, so che la mia testimonianza non vale molto, ma in effetti si trattava solo di una partita che casualmente contava molti italiani in entrambi i team, non so niente effettivamente del passato del giocatore in questione e non siamo amici in gioco, ma tutte le cose scritte in chat non erano da intendersi come flame. Ogniuno più o meno si stava divertendo scrivendo varie cose (anche se forse un pò esagerate) in chat ma non erano da intendersi come offese a nessuno, reputo solo che la squadra nemica (sconfitta) essendo sicuramente composta di premade abbia fatto un report di gruppo contro la nostra squadra. Io mi sono astenuto dallo scrivere per quasi tutto il game come mio solito e per questo non sono stato punito, ma anche i miei compagni hanno ricevuto un ban temporaneo forse non giustificato data la natura scherzosa della chat durante e prima della partita.","replies":[{"poster":"Lemon Jhin","date":"2018-10-10T18:37:53.841+0000","up_votes":1,"down_votes":1,"body":"soprattutto puniti per la chat utilizzata PRIVATAMENTE da noi, all'interno dalla lobby. \nnoi scrivevamo, noi leggevamo. NESSUN ALTRO, se nessuno tra noi ha reportato l'altro perché ritenutosi offeso perciò che è avvenuto nella lobby (conversazioni infantili ma pur sempre amichevoli e pacifiche), vuol dire che evidentemente non c'è stato alcuno scontro/litigio/o motivo di flame da parte di chiunque.\nio di ciò che hanno scritto loro nella lobby, non ho reputato nulla di ciò, per quanto mi riguarda offensivo perciò per me il loro ban è stato un ingiustizia, spetta a loro decidere se il mio di linguaggio, sia o non sia stato per loro sgradevole, anche se la conferma la ho già avuta.","replies":[{"poster":"ITP MENNY","date":"2018-10-11T20:17:03.384+0000","up_votes":1,"down_votes":0,"body":"Amici amici poi ti rubano la bici, ci sarà stato qualche \"traditore\" che ora si nasconde per la vergogna, cmq m8 io sono da parte riot non puoi lamentarti solo perché ci hai speso soldi se ti hanno bannato 2 motivi ci sono, 1 hai, nel tuo modo, offeso che sia ironico o no questo lo sai solo tu. 2 avete scherzato nella chat del party, qualcuno ha fatto lo screen e lo ha inviato alla riot non è difficile m8 xD nuovo account is coming","replies":[]}]}]},{"poster":"traitorsqt v2","date":"2018-10-10T18:06:31.270+0000","up_votes":3,"down_votes":3,"body":"è giusto cosi..fai meno il galletto con gli amici","replies":[{"poster":"Lemon Jhin","date":"2018-10-10T18:16:21.048+0000","up_votes":3,"down_votes":2,"body":"ecco la gente come te, è 1000 volte più tossica della gente che risponde a coloro che realmente insultano e trollano nelle partite. E non mi stupirebbe scoprire che tu ne faccia già parte.\nEvita di commentare in certi modi con il solo scopo di creare scontri casuali, perché non è per questo che io ho creato il post.","replies":[{"poster":"traitorsqt v2","date":"2018-10-10T18:32:39.835+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Lemon Jhin,realm=EUW,application-id=98NGV4Al,discussion-id=UzlPoYMF,comment-id=00020000,timestamp=2018-10-10T18:16:21.048+0000)\n>\n> ecco la gente come te, è 1000 volte più tossica della gente che risponde a coloro che realmente insultano e trollano nelle partite. E non mi stupirebbe scoprire che tu ne faccia già parte.\n> Evita di commentare in certi modi con il solo scopo di creare scontri casuali, perché non è per questo che io ho creato il post.\n\ninfatti mi sono beccato la ban chat da 10 games per colpa di premade come voi che istigano trollano etc..comunque se sei stato bannato un motivo c è..se perma ancora di piu! (se posti link aspettati commenti di ogni genere)","replies":[{"poster":"Lemon Jhin","date":"2018-10-10T18:43:06.132+0000","up_votes":1,"down_votes":2,"body":"non abbiamo istigato, né trollato. se hai preso la chat restrict è perché come me in passato hai avuto il fegato di rispondere a chi realmente comincia il flame, o a chi gioca con lo scopo di rovinare il game altrui. noi non abbiamo, ripeto, né flammato, né trollato, né istigato nessuno.","replies":[]}]}]}]},{"poster":"qOoOp","date":"2018-10-11T16:19:14.169+0000","up_votes":2,"down_votes":1,"body":"Perdonami ma non capisci il permaban?\nLo so, è difficile... \nRileggi la chat che hai postato, e vai al minuto [26:22]: che leggi?\nAnche se in maniera scherzosa (e questo è il dramma) hai incitato una violenza.\nRingrazia che non ti hanno arrestato!\nLe parole hanno un peso, e ci sono conseguenze.","replies":[]},{"poster":"CasualNoobITA","date":"2018-10-11T18:59:54.837+0000","up_votes":1,"down_votes":0,"body":"Se avessi iniziato un nuovo account invece di lagnarti , ora potresti di nuovo rankare .","replies":[]}]}