{"poster":"mtgriffin1","date":"2016-09-25T02:26:16.644+0000","title":"Game Crashes when load into a game","subforum":"[ARCHIVED] Help & Support","up_votes":5,"down_votes":0,"body":"This has been happening ever since the new patch and I updated Windows 10 to the latest firmware. I will load into a game first 15 seconds are fine and then BOOM, LoLClient.exe has stopped working or whatever the name of the program is. It closes the game and then I have to click reconnect to get back in game, and I can actually play before minions spawn, and I am good for the rest of the game no crashes. It is kind of annoying for this to happen every game. Anyone have any suggestions? {{item:3070}}","replies":[{"poster":"RazørRay","date":"2016-09-26T06:13:04.267+0000","up_votes":3,"down_votes":0,"body":"After Windows 10 update on my Alienware Alpha with built-in NVIDIA chip I can no longer load games. It doesn't even make it to the loading screen for me just makes the client disappear then the League logo shortly followed by the client reappearing with bugsplat and reconnect button. After the update though my Alien FX and NVIDIA software didn't seem to be running in the bottom right. So not sure what the issue is but another of my game works fine and everything else seems to be working just fine. I tried a system restore to before the update, but that did not work. I think I may try the previous build feature. Also, repairing and re-installing League did not work either.","replies":[]},{"poster":"Demacian Saint","date":"2016-09-25T13:55:40.930+0000","up_votes":2,"down_votes":0,"body":"Yeah can't join at all. Won't even get into the loading screen. Just says there was a bugsplat. Pretty sure the new firmware broke something and won't let us play now.","replies":[]},{"poster":"Jenex","date":"2016-09-25T04:14:02.422+0000","up_votes":2,"down_votes":0,"body":"Same issue is happening to me. Tends to be between 40 seconds to 60 seconds into the game.  =/ thankfully I've bee playing support, but being behind for level 2 in botlane is horrible.","replies":[]},{"poster":"bumpdaddy","date":"2016-09-26T20:34:23.760+0000","up_votes":1,"down_votes":0,"body":"I also had this problem, 40-60seconds.  Super Lag, then unkown error and league would close.   \n\nI did end up uninstalling Plays.TV, as it was the only program I could think of that is opening new processes while I am in game.   I have not had the problems in the 3 games since then.   (Small sample size) \n\nDo you guys have Plays.TV installed?  Mine might be just a coincidence that it stopped happening when I uninstalled it.\n\nFor Reference: \nCPU: Intel (R) Core(TM) I5-5200  2.20GHz\nGPU: Nvidia Gforce 940M\n16Gb RAM","replies":[{"poster":"bumpdaddy","date":"2016-09-27T05:16:39.301+0000","up_votes":1,"down_votes":0,"body":"About 10 games after uninstalling plays.tv and no problems.  Unless riot also made a change around the same time??","replies":[]}]},{"poster":"Targons Blade","date":"2016-09-25T18:56:20.602+0000","up_votes":1,"down_votes":0,"body":"Since other players are seeing this issue as well, I'd like to see if there are any common elements at play here. Can you give me a list of your system specs (CPU, GPU, Memory, Monitor Resolutions and Refresh rates)? \n\nThe suggestion that *Gigglestomp* gave for rolling back is a good step to take that will help us figure out if this is specifically a part of a recent windows update, but there may be another workaround, much like there was with the fairly recent issues with the Xbox Game Bar after the Windows 10 anniversary update.","replies":[{"poster":"mtgriffin1","date":"2016-09-25T23:05:52.381+0000","up_votes":1,"down_votes":0,"body":"CPU: Intel Core 15-4430 CPU @ 3.00GHz, Quad Core\nGPU: NVIDIA GeForce GTX 750 Ti\nRAM: 8 GBs\nMonitor Res: 1600x900 \nRefresh: 60 hertz","replies":[{"poster":"Targons Blade","date":"2016-09-26T15:21:14.273+0000","up_votes":1,"down_votes":0,"body":"Thanks for providing those specs. I took a look into this and spoke with some of our tech dudes. They mentioned that a number of issues have been popping up with these symptoms that could be caused by two potential Windows 10 features. As a quick check, I recommend disabling both features to see if either one was causing the issue.\n\nThe first is the Xbox game bar, which had a feature update for Game DVR. [This guide](http://www.tenforums.com/tutorials/8637-game-bar-turn-off-windows-10-a.html) will help you disable it temporarily. The second is called SmartScreen, which is a security feature that comes with Windows. You can find instructions on how to disable it [here.](https://support.microsoft.com/en-us/kb/930168)\n\nLet me know if either of those helped at all.","replies":[{"poster":"Hingedmosquito","date":"2016-09-27T16:19:33.221+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Targons Blade,realm=NA,application-id=osqw6G4M,discussion-id=hOPA8Vo8,comment-id=000600000000,timestamp=2016-09-26T15:21:14.273+0000)\n>\n> Thanks for providing those specs. I took a look into this and spoke with some of our tech dudes. They mentioned that a number of issues have been popping up with these symptoms that could be caused by two potential Windows 10 features. As a quick check, I recommend disabling both features to see if either one was causing the issue.\n> \n> The first is the Xbox game bar, which had a feature update for Game DVR. [This guide](http://www.tenforums.com/tutorials/8637-game-bar-turn-off-windows-10-a.html) will help you disable it temporarily. The second is called SmartScreen, which is a security feature that comes with Windows. You can find instructions on how to disable it [here.](https://support.microsoft.com/en-us/kb/930168)\n> \n> Let me know if either of those helped at all.\n\nIs there any chance that you guys @RIOT are doing something that will patch to make these features work with the game?","replies":[]}]}]},{"poster":"Viphira","date":"2016-09-26T05:42:09.998+0000","up_votes":1,"down_votes":0,"body":"Could any of these 3 updates be a cause for this ? (It's just a screenshot of the latest updates) \nhttps://gyazo.com/ab3aad1e3754195969ef01c0339d0b05","replies":[]},{"poster":"AEthura","date":"2016-09-26T01:02:56.435+0000","up_votes":1,"down_votes":0,"body":"OS: Windows 7 Home Premium\nCPU: Intel(R) Core(TM) i5-2390T CPU @ 2.70GHz (4 CPUs), ~2.7GHz\nGPU: AMD Radeon HD 6450\nRAM: 8 GB\nMonitor Resolution: 1920 x 1080\nRefresh Rate: 60 Hertz","replies":[]}]},{"poster":"AEthura","date":"2016-09-25T18:57:09.548+0000","up_votes":1,"down_votes":0,"body":"I've actually been getting this for the last few days as well, but I have not updated my OS, and I'm actually still using Windows 7. It has been happening between 45 - 60 seconds after the game starts. There is no error or bugsplat message, but a windows message saying that the client is not responding appears. It only happens during that time frame and it has only happened once per game, after which I can play normally. Fortunately, I haven't been playing ranked since this started, so there hasn't been much issue. I'm not sure if it's just a matter of needing to update certain software, Adobe Air for example, but having a solution to this would be great.","replies":[]},{"poster":"Gigglestomp","date":"2016-09-25T15:37:32.096+0000","up_votes":1,"down_votes":0,"body":"This happened to me as well. The update was huge, and it broke SkyUI in Skyrim(Can no longer see what is equipped), it broke league of legends (bugsplat when entering rift- non recoverable), and it broke Microsoft edge (Opens hundreds of windows when i try to open one).\n\nTo fix do this: Hit the 4 square windows button in the bottom left. Start typing \"Reset this PC\". Rollback to previous build.\n\nComputer will restart and then everything works. I came here to post about the fix then saw your post.","replies":[{"poster":"mtgriffin1","date":"2016-09-25T17:49:26.506+0000","up_votes":1,"down_votes":0,"body":"Thanks I will try it. Hopefully either Riot will come and fix this or Microsoft will have to come out with another update fixing all affected software.","replies":[]}]},{"poster":"Vombat","date":"2016-09-25T16:58:42.843+0000","up_votes":1,"down_votes":0,"body":"between 40 and 60 seconds of game I dc and then reconnect again. after that everything runs smooth.\nThe trick with previous build on windows doesn't work for me","replies":[]},{"poster":"Strik3z","date":"2016-09-25T04:59:00.403+0000","up_votes":1,"down_votes":0,"body":"Same, and once in a blue moon, when I attempt to reconnect after this, my keybinds won't work and I have to reload again :/","replies":[]},{"poster":"Zoshiro","date":"2016-09-25T17:02:59.571+0000","up_votes":1,"down_votes":1,"body":"It is sad that they have no fix for this, when it is causing 1000s of people to not play. I wish they would just all uninstall for a year and teach Riot a lesson. Pathetic they can be so incompetent.","replies":[]}]}