{"poster":"Luxtopia","date":"2019-12-15T12:22:53.433+0000","title":"¿Cómo es que este sistema matchea un challenger 600lp en un game de diamante low?","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"En serio, pregunto, porque es lo que acaba de pasar. Un jungla autofill de diamante contra un main jungla challenger 600lp, que divertido. \r\n\r\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Polohit","date":"2019-12-15T13:01:06.997+0000","up_votes":2,"down_votes":0,"body":"Te acaban de poner un master en el equipo, no se que te quejas.\n\nP.D.: El jungla autofilled sos vos XD dodgea?","replies":[{"poster":"Luxtopia","date":"2019-12-15T13:19:25.697+0000","up_votes":1,"down_votes":1,"body":"Si, un master que se murió dos veces y ya se quería ir afk, solo volvió a intear y ya si dc. Estaba con 99lp y gano mas de lo que pierdo, podía perder y así todo seguir a un win de promo, me puedo defender de jungla pero no cuando tengo un master que no te cubre la jungla y para cuando subis el lee te hizo toda la jungla del blue. Obvio acá gana el mas pillo pero si tu Talon se come el gank mas obvio aún teniendo wardeado y verlo venir desde cangrejo entonces ya esta instalose.\n\nPD: El \"master\" se paso toda la partida escribiendo y no jugó nada. La verdad el rango muchas veces vale poco y nada, porque la comunidad es un asco de por si.","replies":[{"poster":"Polohit","date":"2019-12-15T14:35:01.368+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Luxtopia,realm=LAS,application-id=v7qsfXsE,discussion-id=ELE23y92,comment-id=00000000,timestamp=2019-12-15T13:19:25.697+0000)\n>\n> Si, un master que se murió dos veces y ya se quería ir afk, solo volvió a intear y ya si dc. Estaba con 99lp y gano mas de lo que pierdo, podía perder y así todo seguir a un win de promo, me puedo defender de jungla pero no cuando tengo un master que no te cubre la jungla y para cuando subis el lee te hizo toda la jungla del blue. Obvio acá gana el mas pillo pero si tu Talon se come el gank mas obvio aún teniendo wardeado y verlo venir desde cangrejo entonces ya esta instalose.\n> \n> PD: El \"master\" se paso toda la partida escribiendo y no jugó nada. La verdad el rango muchas veces vale poco y nada, porque la comunidad es un asco de por si.\n\nEso no te enseña que mirar la liga no significa que sepa jugar o no?\n\nAntes que nada, no despotriques. Osea me refiero a que yo a vos no te puedo enseñar a jugar, vos jugas 1000 u una veces mejor que yo, pero si podemos aplicar el razonamiento juntos. El challenger cumple la misma funcion del master, capaz se re fedea capaz la re tira.\n\nEs igual en cada juego, a mi me toca con gente pro y no hago nada, me re carrean, me toca con gente peor que yo (si los hay) y nada hago lo que puedo.\n\nEs asi el juego, tampoco es ah no yo juego tal cosa bien tengo que estar challenger. Las bolas, tenes que tener un poco de todo. \n\nAdemas si ves gente que juega un campeon y llega a challenger ahi tenes una pista, el que juega un solo campeon bueno no es, no puede serlo. Porque al margen de que existen lso bans en lol y cuando vas a competitivo seguro te banean  el main, lo mas importante es que el juego cambia todo el tiempo, entonces en un parche tu unica carta puede rendir solo en hierro y ya estas out.\n\nEs un jeugo largo y amplio hay que jugarlo con eso en mente siempre, no jugas por la partida si no por la suma de todas. osea asi lo entendi yo.","replies":[{"poster":"Luxtopia","date":"2019-12-15T16:19:59.334+0000","up_votes":1,"down_votes":0,"body":"A ver, si entiendo lo que dices, y obviamente el flaco jugó mejor su rol y stompeo por ahí. Tuve una partida basura pero tampoco fue enteramente mi responsabilidad, pero aún dejando todo eso de lado, del mismo modo que no se puede jugar un oro con un diamante (a menos que sea un duo medio raro y se estire un poco el emparejamiento), un challenger con 600lp no debería poder ser emparejado con diamantes 4.\n\nUn diamante con mmr por el piso perdiendo mil seguidas hasta y puede quedar jugando con oros 1, pero un challenger con 600lp no creo que venga de mala racha para ser emparejado con diamantes low. Eso es claramente una falla del sistema de emparejamiento. Es como emparejar diamantes con platas.","replies":[{"poster":"Polohit","date":"2019-12-15T16:35:22.573+0000","up_votes":1,"down_votes":0,"body":"Bien, osea vos le tiras la culpa de perder la partida al emparejamiento, cuando el problema es que vos eras autofilld y tu \"me defiendo en la jungla fue salir 0/6\"\n\nQue no te lo critico, pero si por cada derrota vas a hacer ese analisis vas a seguir teniendo partidas asi. \n\nEn tu lugar y no digo que debas pero lo que yo haria es mirar la partida. Te gano por esto, por esto y por esto, y de ahi sacas que podes hacer vos que pudiste evitar y listo. \n\nLa prox el chall 600 lp podes ser vos.","replies":[{"poster":"Luxtopia","date":"2019-12-15T16:56:32.286+0000","up_votes":1,"down_votes":0,"body":"La partida fue simple, el top master no cubrió la jungla, se hizo todo mi blue side, saco ventaja de nivel un lee que la tenía clara y se comieron todos los ganks habidos y por haber. si fuera que el tipo venia mal o igual y la carreo vale de algo pero si estuvo en ventaja todo el game muy didáctico no es, mas cuando es por un error tan básico como cubrir las entradas de la jungla al inicio.\n\nSali 0/7 pero podría haber terminado 0/2 y ya, total la partida estaba perdida y el kda me vale para poco la verdad, preferí tratar de hacer algo a quedarme en base llorando como el master, si total ya estaba perdida había que arriesgar. La verdad no entiendo a la gente que cuida el KDA como si le fueran a dar un premio al final de la season.  Prefiero arriesgarme y quizas ganar una partida saliendo 2/5 pero cumpliendo mi papel y contribuyendo a quedarme en base al 1/2 \"si total esta perdida\" y perder seguro. El kda no te da lp, y prefiero mil veces terminar con un kda de mierda y ganar a perder sin jugar pero será solo cosa mia eso supongo. Capaz mi razonamiento esta errado al pensar que el kda no te da lp ni mmr y tampoco influye en cuanto ganas o pierdes de los mismos.","replies":[]}]}]}]},{"poster":"VenganceZ","date":"2019-12-15T14:24:17.765+0000","up_votes":2,"down_votes":0,"body":"Primera vez? Ayer jugué con un diamante 1 y 3 platinos, el adc era un Jhin que era otp talón y el tipo jugaba con un miedo que no te cuento, se tiraban 4 vs 5, 3 vs 5, y cuando le pingueas que vas a gankear se quedan atrás. Aunque debo decir que el mid y el soporte eran de fiar. Pero cuando tenés un autofil (más si es otp de algún campeón) es re jodido.","replies":[]}]}]},{"poster":"JeremiasArg","date":"2019-12-15T20:32:22.142+0000","up_votes":1,"down_votes":0,"body":"supongo que es por el mmr.","replies":[]},{"poster":"Aegis","date":"2019-12-15T15:14:59.244+0000","up_votes":1,"down_votes":0,"body":"Ahora también ocurre en ranked? Porque en las normales sucede todo el tiempo pero si ya hasta en ranked está desbalanceado es una locura","replies":[]}]}