{"poster":"ElAndynwn","date":"2016-04-11T02:36:37.879+0000","title":"Recomendaciones para conseguir una S con Olaf","subforum":"Guias y consejos","up_votes":4,"down_votes":0,"body":"Bueno esto va para los mains olaf {{champion:2}} ... como consigo una S para la artesania hextech?\r\n\r\ny para los mains yorics que estan casi extintos va la mima pregunta para ese champ {{champion:83}} ...\r\n\r\ndesde ya muchas gracias :D","replies":[{"poster":"Ks Erwyn","date":"2016-04-11T03:01:34.312+0000","up_votes":3,"down_votes":1,"body":"La verdad tengo jubilado a mi amado Olaf, entre top y Jg tiene el peor win rate del juego, y con razón, nerf a la titanica, el meta actual no lo beneficia para nada, ademas de cierta dependencia de una compo. de equipo que potencie sus incursiones a la back lane enemiga son poco comunes y requieren de buena coordinación. \n\nPor ahí lo único bueno es que no tiene reales problemas contra los ekko tankes,rammus y naut de Top ya que se fuma sus CC, pero contra ciertos colosos la pasa realmente mal...","replies":[{"poster":"support girl uwu","date":"2016-04-11T12:14:52.646+0000","up_votes":1,"down_votes":2,"body":"Un meta de tanques ''no beneficia para nada'' a un campeón que stompea en 1v1, se basa en el daño verdadero, y tiene sustain y poke en linea? \nCon un Olaf con black cleaver + tanky te soleas a lo que sea.","replies":[{"poster":"Ks Erwyn","date":"2016-04-11T18:41:40.910+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=BIoodRain,realm=LAS,application-id=8sKIclmi,discussion-id=Uj6K7Ytb,comment-id=00000002,timestamp=2016-04-11T12:14:52.646+0000)\n>\n> Un meta de tanques &#x27;&#x27;no beneficia para nada&#x27;&#x27; a un campeón que stompea en 1v1, se basa en el daño verdadero, y tiene sustain y poke en linea? \n> Con un Olaf con black cleaver + tanky te soleas a lo que sea.\n\nMe refería mas al macrojuego y al juego en equipo, ademas el meta cambio ligeramente a compos de Tf contra compos de asedio, Olaf podra ser muy bueno en linea contra ciertos pick, pero y luego? \n\nEl meta no se rige por quienes lo componen (tanques ,asesinos, carrys) si no por la estrategia preestablecida que se genera por sus componentes........","replies":[{"poster":"support girl uwu","date":"2016-04-11T21:13:53.717+0000","up_votes":1,"down_votes":2,"body":"Preguntó por sacar S en Olaf, nunca dijo que tiene planeado entrar a la LCS porque lo ficho TSM de top y va a usarlo ahí. \n\nEn soloq y más todavía en las no hay ninguna ''estrategia''... A menos que te toquen 10 challengers, y cosa que no pasa casi nunca ni aunque estes en challenger, la gente no es tan inteligente de ponerse a planear una estrategia para que los 5 le hagan counter a Olaf.\n\nSi ganas linea, salís 9-1, stompeas al top y al jungla, y late tenes 4 lvls y 2 items arriba del adc, no van a poder hacer nada si matas al adc de 3 Q y una E, y si te quedas en top y haces un 1v3 menos. \n\nY hablas que ''después de lane no sirve'', si Olaf no sirve después de lane, que le queda a campeones como Garen, Darius, Pantheon, Teemo, etc. etc. etc., son mucho mas inutiles que Olaf después de la fase de lineas en cuanto a posibilidad de counter, sin embargo, con cualquiera de esos champs subís fácil a diamond.\n\nOlaf no estará op pero es más que viable y si lo aprendes a usar un poco es imparable, si te parece que es dificil ganar con Olaf no sé que pasara si llegas a jugar Rumble, Yorick, Morde, o un top de esos que de verdad la pasa mal en esta meta.","replies":[{"poster":"Ks Erwyn","date":"2016-04-12T00:00:14.328+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=BIoodRain,realm=LAS,application-id=8sKIclmi,discussion-id=Uj6K7Ytb,comment-id=0000000200000000,timestamp=2016-04-11T21:13:53.717+0000)\n>\n> Preguntó por sacar S en Olaf, nunca dijo que tiene planeado entrar a la LCS porque lo ficho TSM de top y va a usarlo ahí. \n> \n> En soloq y más todavía en las no hay ninguna ''estrategia''... A menos que te toquen 10 challengers, y cosa que no pasa casi nunca ni aunque estes en challenger, la gente no es tan inteligente de ponerse a planear una estrategia para que los 5 le hagan counter a Olaf.\n> \n> Si ganas linea, salís 9-1, stompeas al top y al jungla, y late tenes 4 lvls y 2 items arriba del adc, no van a poder hacer nada si matas al adc de 3 Q y una E, y si te quedas en top y haces un 1v3 menos. \n> \n> Y hablas que ''después de lane no sirve'', si Olaf no sirve después de lane, que le queda a campeones como Garen, Darius, Pantheon, Teemo, etc. etc. etc., son mucho mas inutiles que Olaf después de la fase de lineas en cuanto a posibilidad de counter, sin embargo, con cualquiera de esos champs subís fácil a diamond.\n> \n> Olaf no estará op pero es más que viable y si lo aprendes a usar un poco es imparable, si te parece que es dificil ganar con Olaf no sé que pasara si llegas a jugar Rumble, Yorick, Morde, o un top de esos que de verdad la pasa mal en esta meta.\n\n\nNo! concuerdo en todo, de echo Olaf debe ser el Top que hace mas años que uso, así que hablo de el con propiedad, por eso se cuales son sus debilidades y potencial, lo goze en la S1/S2 cuando era dios y lo sufro ahora que comparativamente esta muy por detrás de otras opciones.\n\nSobre el meta, creeré que sabes de que se trata el metagame o que es lo que lo define, el meta game o estrategia prestablecia de juego entre 5 desconocidos, es un heramientas que orienta y facilita a estos 5 que crear una compo. equilibrada que potencie y fortalezca las debilidades y fuerte de sus campeones, luego esta la estrategia de composiciones, asedios, team fight, chase.\n\nSabemos que en YoloQ la gente es retardada y solo juega lo que se le canta, pero a partir de cierto nivel o division, esto cambia y mejora, comparar soloQ con competitivo es un error, ya que en el ámbito profesional, ellos moldean el meta mientras que en yoloq EL META rige a los usuarios en mayor medida que a los profecionales.\n\nLa mayor debilidad de Olaf recae en sus dependencias, algo que en soloQ es mas sencillo de explotar que en competitivo, un Rumble siempre ofrecerá algún tipo de utilidad a su team en circunstancias adversas, pero si, tanto Yorick como Morde por lo des-actualizados mecánicamente  o por lo incompatible de sus Kit ya sea con un meta u otro estan fuera de toda consideración.","replies":[{"poster":"support girl uwu","date":"2016-04-12T01:56:49.116+0000","up_votes":1,"down_votes":1,"body":"Yo soy D1 y me empareja con varios challengers por partida y la gente sigue sin seguir el meta, me siguen tocando Graves adc que fedean, jgs que se van afk si mueren 3 veces seguidas, annies adc, que curiosamente ganan linea stompeando y etc. Así que supongo que sí los top 10 del server entran a este post los comentarios del meta le serán utiles, para todo el otro 99,99% no creo.\n\nRanked jugando soloq es y va a ser stompear linea, con Ekko top tank lo vas a hacer mucho mas FÁCIL que con un Olaf, pero si lo haces con Olaf porque practicaste y se te da el champ vas a carrear igual que si lo hicieras con cualquier champ. Se spamean tanks porque es mas fácil ser útil con un tank, pero no significa que si usas bien otro champ no puedas ser igual o más util en soloq. Con Renekton full tank para ser útil en una tf tenes que apretar R y tankear hasta cansarte, con Renekton full AD, podes ser igual o más util metiendo W's de 1k+ de daño y oneshotear a 3 squishys, pero hacerlo va a ser 1 millón de veces mas dificil que siendo tank y aguantando mientras tu team pega, pero si podes y sabes usarlo AD, vas a carrear.\n\nY tampoco tiene mucho sentido decir ''use olaf desde la s1'' porque podrás ser el #1 olaf del mundo y estar en el top 5 de la ladder por 5 seasons seguidas, pero te cambian los daños, los items, y las maestrias y tu conocimiento del champ y cálculos te van a servir de poco y nada. Tenes como ejemplos varios players que maineaban X champ hace 3 seasons y eran dios, y ahora son players regulares tirando a malos con esos champs (the rainman con teemo, druidroid con singed, etc.) \n\nAdemás según lolking estuviste stuck en plata toda la season pasada xD, nunca voy a entender la gente que son unos maestros estrategas, conocedores del meta y saben como ganar cada partida con picks, pero están estancados y no llegan ni a diamond o master que con un mínimo de skill si tenes tanto conocimiento en las subís en 1 mes máximo, no entiendo de que te sirvió usar Olaf desde la s1 si no pudiste salir de plata xD. \n\nY tampoco se por qué se te dio por desvirtuar tanto el tema xD que fue una simple pregunta, como ser un mejor Olaf, respuesta: practicar unas cuantas partidas, sacar black cleaver + randuin + visage con grasp de keystone y stompear.  Nunca preguntó sobre su winrate, su funcionalidad en competitivo, si lo usabas desde s1 o no, etc. etc. etc.","replies":[{"poster":"Ks Erwyn","date":"2016-04-12T08:23:16.408+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BIoodRain,realm=LAS,application-id=8sKIclmi,discussion-id=Uj6K7Ytb,comment-id=000000020000000000000000,timestamp=2016-04-12T01:56:49.116+0000)\n>\n> Yo soy D1 y me empareja con varios challengers por partida y la gente sigue sin seguir el meta, me siguen tocando Graves adc que fedean, jgs que se van afk si mueren 3 veces seguidas, annies adc, que curiosamente ganan linea stompeando y etc. Así que supongo que sí los top 10 del server entran a este post los comentarios del meta le serán utiles, para todo el otro 99,99% no creo.\n> \n> Ranked jugando soloq es y va a ser stompear linea, con Ekko top tank lo vas a hacer mucho mas FÁCIL que con un Olaf, pero si lo haces con Olaf porque practicaste y se te da el champ vas a carrear igual que si lo hicieras con cualquier champ. Se spamean tanks porque es mas fácil ser útil con un tank, pero no significa que si usas bien otro champ no puedas ser igual o más util en soloq. Con Renekton full tank para ser útil en una tf tenes que apretar R y tankear hasta cansarte, con Renekton full AD, podes ser igual o más util metiendo W's de 1k+ de daño y oneshotear a 3 squishys, pero hacerlo va a ser 1 millón de veces mas dificil que siendo tank y aguantando mientras tu team pega, pero si podes y sabes usarlo AD, vas a carrear.\n> \n> Y tampoco tiene mucho sentido decir ''use olaf desde la s1'' porque podrás ser el #1 olaf del mundo y estar en el top 5 de la ladder por 5 seasons seguidas, pero te cambian los daños, los items, y las maestrias y tu conocimiento del champ y cálculos te van a servir de poco y nada. Tenes como ejemplos varios players que maineaban X champ hace 3 seasons y eran dios, y ahora son players regulares tirando a malos con esos champs (the rainman con teemo, druidroid con singed, etc.) \n> \n> Además según lolking estuviste stuck en plata toda la season pasada xD, nunca voy a entender la gente que son unos maestros estrategas, conocedores del meta y saben como ganar cada partida con picks, pero están estancados y no llegan ni a diamond o master que con un mínimo de skill si tenes tanto conocimiento en las subís en 1 mes máximo, no entiendo de que te sirvió usar Olaf desde la s1 si no pudiste salir de plata xD. \n> \n> Y tampoco se por qué se te dio por desvirtuar tanto el tema xD que fue una simple pregunta, como ser un mejor Olaf, respuesta: practicar unas cuantas partidas, sacar black cleaver + randuin + visage con grasp de keystone y stompear.  Nunca preguntó sobre su winrate, su funcionalidad en competitivo, si lo usabas desde s1 o no, etc. etc. etc.\n\nBah, exponía mi opinion, lo mio nuca fue un atake como parece se volvió lo tuyo, yo no fui quien empezó con esto o desvirtuó el post, fuiste tú, no suelo recaer en desprestigiar al resto para darle valor o mas verdad a mi palabra, lo que sé, se basa mucho en la experiencia de haber jugado el juego desde que existe casi, y conocimiento de sobra, habilidad hasta cierto punto, en EUW solo llegue hasta platino 1 jugando solo 3 vs 3 con una sola cuenta aun mas vieja, nunca me gusto rankear no lo disfruto y lo hice aquí en la S3, solo para ayudar a un amigo D4 estancado, en esa época que podias abusar del sistema haciendo duo con gente muchas divisiones de diferencia, tras eso no rankee nunca mas , ni lo pretendo.\n\ncuando hable sobre el meta y cuanto puede o no influir en la divisiones, solo dije que mejora, y nada mas, tú malinterpretaste el resto.\n\ncuando hablo sobre mi conocimiento sobre Olaf lo hago desde el punto de vista de haber vivido cada cambio ya sea de meta como de poder que a pasado él y el juego en general, es notorio con el inclusive a través del tiempo se ha vuelto hasta mecánicamente des-actualizado, aun así me encanta, es uno con los que mas me divierto, por que eso hago, juego para divertirme... y profundizando sobre lo que comente sobre Olaf, solo hable de su actualidad, sabiendo que otros darán las respuestas genéricas sobre builds y dando link a paginas de guias y su buen o mal consejo dentro del todo, respetable y luego habrá otros que entraran a solo atacar la opinión del resto mientras escupen xD como si hicieran menos agresivo lo que escriben....","replies":[]}]}]}]}]}]},{"poster":"La corrupción","date":"2016-04-11T03:22:31.613+0000","up_votes":2,"down_votes":0,"body":"la verdad me sorprendio que desde el buff a sivir no se la combinara con olaf, en todo caso lo uso una vez soaz al principio de la lcs, en top me parece un champ que sigue bien, en la jungla es de lo peor, lo siento mains olaf :C","replies":[]},{"poster":"GameMode","date":"2016-04-11T10:56:21.569+0000","up_votes":1,"down_votes":2,"body":"Olaf en top lane es imparable.","replies":[]}]},{"poster":"KarmaUnder","date":"2016-04-11T03:22:41.123+0000","up_votes":2,"down_votes":0,"body":"y S se consigue igual con todos los champs, farmea bien, juga bien","replies":[]},{"poster":"EdwardNewgate12","date":"2016-04-11T11:00:05.403+0000","up_votes":1,"down_votes":2,"body":"no es muy dificil, es uno de los champ con mas early del juego, en level 3 es casi imposible el pvp","replies":[]}]}