{"poster":"Kny Franco","date":"2016-03-25T10:45:11.126+0000","title":"Ayuda para armar PC GAMER!","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Estoy armando una computadora gamer y tengo algunas dudas, quiz&aacute; alguno de ustedes que sabe de computadora me pueda ayudar. No solo la quiero para jugar LoL, la quiero para juegos copados como Skyrim full, GTA 5 full (o alta), lo nuevo de assasin&#039;s y juegos que vallan saliendo. Bueno, esta es la compu que tengo en mente:\n\n* Gabinete: **Corsair Spec 03** \n* RAM: 2 **Kingston Ddr3 4gb Hyper Fury 1866mz**\n* Procesador: **Vishera Fx X8 9370**\n* Placa madre: **Gigabyte Ga-970a-ds3**\n* Disco rigido: **Western Digital Caviar Black 1tb**\n* Fuente: **Sentey Xpp725**\n* Placa de video: **Ati Radeon R7 370 4gb**\n\nMi mayor duda es la placa de v&iacute;deo porque creo que podr&iacute;a comprar una mejor pero el problema es que no se cual combinar&iacute;a bien con todo esto sin tener que pagar una fortuna (esa placa sale 4200$ y hasta 6000$ estiro). El procesador me gusta mucho y me pareci&oacute; justo el precio por lo que es, la fuente creo que es suficiente, el disco r&iacute;gido es un ca&ntilde;o, las rams est&aacute;n buenas, el gabinete tiene buenos coolers y se ve c&oacute;modo pero la placa madre tambi&eacute;n no se si me conviene una mejor. Que opinan ustedes? Vale la pena 17148$ por esta maquina o le pongo un poco mas? Correr&aacute;n los juegos mas pesados? Ayuda!!!\n\nEDIT: Y asi que les parece? \n\nMother: MSI 970 Gaming AMD AM3+(970 Gaming)\nGabinete: Corsair Spec 03\nProcesador: CPU AMD FX 8350 X8 4.2Ghz Vishera AM3+(FX8350)\nMemoria Ram: 8192 MB en 2 módulos DDR3 (1 x Memoria Kingston DDR3 8GB 1600Mhz 2x4gb HyperX) \nPlaca de Video: Placa de Video MSI GTX960 Gaming 4GB DDR5(Gaming) \nDisco Rígido: 1000GB (Disco Rígido WD 1TB Sata 3 6.0Gb/s Caviar Blue) \nMedio Ópticos: Grabadora de DVD RW SATA 24X Asus \nFuente:\tFuente Sentey MBP650-HS 650W 80 Plus Bronze","replies":[{"poster":"Rymparek","date":"2016-03-25T14:05:33.898+0000","up_votes":2,"down_votes":0,"body":"Sólo dile que la amas y que quisieras hacerla feliz esta noche, ella sabrá que hacer. Ami siempre me funciona\nAhora ve, lince.","replies":[{"poster":"Kny Franco","date":"2016-03-25T15:00:32.368+0000","up_votes":1,"down_votes":0,"body":"Jajajajaja :') Me hiciste el día y la discusión en el foro xd","replies":[{"poster":"Rymparek","date":"2016-03-30T17:48:29.281+0000","up_votes":1,"down_votes":0,"body":"Que amargado, le cambio el título jajaja","replies":[{"poster":"Kny Franco","date":"2016-03-31T09:05:20.171+0000","up_votes":1,"down_votes":0,"body":"Te juro que no se lo cambie o.O De echo lo intente cambiar y no pude , no se como, solo puedo editar el cuerpo de la discusion y lo deje así o.O Riot fuiste tu ?","replies":[]}]}]}]},{"poster":"support girl uwu","date":"2016-03-25T12:11:43.051+0000","up_votes":1,"down_votes":0,"body":"Los FX 9xxx son la cosa mas en sobreprecio y que menos vale la pena comprar del mundo, un i5 4460 que es lo mas bajo de la gama de i5 saca los mismos fps o más en algunos juegos que el fx 9590 que es un supuesto ''tope de gama'' de AMD, para lo único que vale la pena pensar en AMD hoy en día es para APU's. (o un fx9590 si entras a competencias de overclocking o cosas así, pero para gaming,diseño, renders, etc. Intel>AMD.\n\nEsa fuente no es ni 80plus, en 6 meses con mucha suerte muere si lo pones a ese FX, lo mejor es una de 500-600w y 80plus.\n\nMeterle una 370 a un procesador caro no tiene sentido, un pentium barato con una placa de vídeo de gama media-alta siempre va a rendir mucho mejor que un FX 9590 a 7ghz con extreme overclocking pero con una 370, que rinde bastante menos que una GTX 950, que de por si es gama media-baja. \n\nYo armaría: mother ASUS H81 que está unos $800-1000.\ni5 4590 $4500 y es el mejor balance de procesador para gaming no extremo, rinde igual que un FX 9590 con overclock y con el disipador de serie ya sirve.\n2 rams de 4GB  cualquier marca y modelo (rinde igual de 1333mhz a 2400mhz si no estas usando integrada, y los ''disipadores'' son solamente para que queden ''lindas'') $900-$950 las 2.\nCualquier fuente de 500-600w 80 plus. (preferiblemente xfx o evga) \nCualquier disco rigido de 1tb, todos rinden lo mismo, WD yo prefiero blue, los black hacen mucho ruido. SSD no le veo mucho sentido, osea, si tenes un i7 6700K y 2 GTX 980 en SLI te creo, pero a una pc gama media meterle un ssd me parece que podrias usar esos $1000 y algo en la placa y sacar mucho mas potencial.\nY todo lo que te sobre en placa de vídeo, que es lo que influye un 80%+ en gaming, una GTX 950 ya rinde bastante más que la 370 que decís, pero con lo que ahorras armando algo balanceado te sobran como $7000-$8000 para placa de vídeo si pensas gastar 17k, con $5000 compras una 960 y con $8000 una 970 y ahí si corres todo en ultra.","replies":[{"poster":"support girl uwu","date":"2016-03-25T12:12:42.109+0000","up_votes":1,"down_votes":0,"body":"AMD no cambia la arquitectura de procesadores hace como 10 años, solamente le mete mas y mas ghz para llegar a números altos y eso no significa que vayan a rendir mejor, ahí se ve como en gaming un i5 que cuesta la mitad pasa al ''mejor'' FX. \nhttps://www.youtube.com/watch?v=JFqQdrs5wEU","replies":[{"poster":"ZeNch","date":"2016-03-25T14:25:28.353+0000","up_votes":1,"down_votes":0,"body":"Que AMD no cambia la arquitectura es mentira... que la cambie poco es otro tema, en los vishera agrego un monton de instrucciones cambio controladores de memoria etc.\nque intel sea mejor no lo niego pero termina siendo mas caro, un 8320 es un muy buen micro para una pc gamer (aunque a una pc gammer economica con un fx6350 le basta) lo que importa es invertir en placa de video sin generar cuello de botella (y un micro de 6 nucleos en adelante no lo produciria a menos que le metas una combinacion de 4 placas jajaja pero ahi podrias costear otro micro)\n\nQue pasa los mothers amd son mas baratos que los intel, tenes que tener en cuenta a la plataforma entera. y vos estas comparando un cpu de 4 lucas con uno de menor valor (8350) los 9xxx no los cuento por que si son sobreprecio nada mas.\n\nA que me enfoco? que si no tenes tope de gasto anda por intel... pero si tenes un tope anda por amd (8320 maximo asi no pagas el sobreprecio del resto al pedo).\n\nObvio que yo prefiero intel, pero no lo costearia.","replies":[{"poster":"support girl uwu","date":"2016-03-30T00:23:17.224+0000","up_votes":1,"down_votes":0,"body":"Un i5 4460 te cuesta $3600 en ML, un mother intel para ese procesador $999 (asus H81). \nUn fx 8350 abajo de $3680 no hay nada en ML, un Asus M5a97 sin LE (los LE no traen disipadores y cuestan $100 menos) que es lo mínimo para un FX 8xxx, tampoco hay nada abajo de $1700.\nMother + micro intel= 4599\nMother + micro amd= 5380 \n\nNo soy un genio matemático pero creo que Intel en argentina es mas barato que AMD. Y sí, el mother H81 es ''gama baja'', pero en Intel lo único que cambia en mothers gama alta-baja es la cantidad de puertos (en micros sin overclock) porque los i5 no consumen nada por ende calientan menos, un FX 8350 te consume la vida y calienta como perra, así que sin un mother con TDP de 125W, y disipadores en la parte del northbridge (donde va el procesador) no podes meterlo o sube a 90C°.","replies":[{"poster":"ZeNch","date":"2016-03-30T02:14:04.231+0000","up_votes":1,"down_votes":0,"body":"1 no sabes buscar precios 3595 en una publicacion el fx 8350 (igualmente yo aclare que hay sobrepresio lo ideal es el 8320 que sale 3200 o su version E $2800 por si queres un consumo low (y ahorrarte 200 mangos en un mother mas chico y tener un buen rendimiento igualmente aunque algo inferior claro solo por unos mhz)\n2 busca m5a78l-m es de 140w 1039 pesos (de tdp 95w hay a setecientos y pico para el 8320E)\n\nEl problema de los calentones como decis vos es por encima del 9xxx el 8320 que yo recomiendo o el 8350 su disipacion es correcta respecto a su disipador de fabrica (excepto que en tu habitacion no baje de 35c ambiente). los DRM que seguro es a lo que te referis calientan si haces overclock en voltaje de fabrica no mientras no tengas una habitacion como la que mencione\n\nSin contar que claramente estas dejando de lado los gustos del comprador (quiere un mother gaming) dicho esto no importa el precio... aunque comprar un mother gaming ? yo la verdad le armaria una pc totalmente distinta la distribucion de $$$.\nPara mi los mothers gaming y las versiones tipo sabertooth y similares son para overclockers que de verdad esten preparandose para lo que sea, el no cambiara disipador por ende no es rentable. hay mothers con mismo chips pero sin esos sobreprecios.\nLa verdad es como fue toda la vida, le pones una lucesita y ya es mejor que la pc que te vendian en el local anterior.\n\n\nEn conclusion: Intel vs AMD como dije me tiro por AMD hasta el 8320 luego de eso iria por intel.\n\nIntel mejor rendiemiento por nucleo (Quizas en juegos es mas util segun el uso que le des a la pc)\nAMD mejor rendimiento cuando se hace multitarea\n\nEn MI caso que tengo la pc prendida 24/7 con overclock prefiero AMD por que yo no solo juego hago uso intensivo de varias tareas a la vez (incluyendo maquinas virtuales/juegos/exploradores/musica/ofimatica todo a la vez a veces incluso) y el AMD nunca me fallo de esa manera, Intel le daria mejor resultado con juegos tal vez (tampoco la pavada...) pero perderia rendimiento general si es de hacer 20 cosas a la vez.\nAgrego que AMD soporta 1866 de ram mientras intel 1600 en ese micro segun lei (hablo sin OC obviamente)\nAMD tambien tiene mucha mas cache (en todos) y esto hace que tenga una mejor administracion de memoria ram... SIN EMBARGO esto solo se aprovecha haciendo dual chanel o doble dual chanel (ya que son 2 canales los que usa amd) incluso agrego que si no se tiene minimo 8gb ram terminara siendo inutil alardear de que le supera ampliamente en cache ya que tenerla y no darle uso no seria worth.\n\nEspero que esto deje en claro por que a MI opinion elijo siempre AMD hasta el cpu que dije.","replies":[{"poster":"support girl uwu","date":"2016-03-31T03:37:44.378+0000","up_votes":1,"down_votes":0,"body":"Ponele un m5a78l-m  a un 8320 a 4ghz (porque si dejas el 8320 a 3.5ghz no te rinde ni como un i3) y disfruta de una chimenea casera, porque el northbridge te va a reventar cuando suba a 110C° (mira benchmarks y testeos de los mothers sin disipadores en el northbridge con un FX 8320 sin E, que hay como 20 en google y deleitate, además que el chipset no solo afecta temperaturas sino también rendimiento, hasta un FX6350 empieza a rendir mal en esos mothers, que están diseñados para phenom y modificados para ''AGUANTAR'' fx para marketing, pero no estan hechos para eso). El 8320E está mas cerca de competir contra un i3 de los ''altos'' a un i5 de los bajos, ya el 4460 le saca 10 fps en muchos juegos. \n\nY en tu comparación estas metiendo temas que no tienen nada que ver xD, en lo único que ''gana'' AMD es en que soporta 1866+ de ram (que administra bastante peor que los intel) y en el ''cache'' que tampoco se llega a usar, le ponen 999999 de caché para que suene ''poderoso'' pero en la vida real nunca vas a usar tanto caché con la potencia que tienen esos CPU. Y las velocidades de RAM solamente afectan tareas/programas súper específicos, y si estas ahorrando en procesador, no vas a gastar extra en rams de 2300... por otro lado, en renders con Premiere y etc Intel sigue siendo mas rápido que AMD.\n\nY si vas a hacer tareas hiper complejas con programas de edición avanzados, 4K y etc. cosa que se noten los ''8 núcleos'' del FX, dudo mucho que vayas a preocuparte de ahorrar en un i5 4460 o un FX8320E, sino que vas a ir por un i7 que ya está fuera de competencia de AMD, nadie que trabaje con la pc se va a poner a ahorrar en procesador, ni mucho menos comprar una versión ''E'', que igualmente, esto tiene poco y nada que ver con gaming, que es lo que pregunta el post.","replies":[{"poster":"ZeNch","date":"2016-03-31T14:27:28.216+0000","up_votes":1,"down_votes":0,"body":"Le estas hablando a un usuario de un horno de 110 grados... ah no espera, no es un horno y no son 110 grados.\n\niddle\nCPU 20c\nPuente norte 19c\nTemperatura general del sistema 34c (mi cuarto es un horno y le da el sol casi todo el dia) (Aunque supongo que el medidor debe estar cerca de la grafica por que igual me parece bastante para ser un calculo del sistema general con mi refrigeracion)\n\nY en Full (prime95 y similares) ningun componente pasa los 50c... Excepto los VRM que llegan a 100 (tiene de limite 115c) pero eso es por que Gigabyte no hizo bien su trabajo para el overclock.\n\nEl cpu es de 3.6 y esta en 4.2 24/7 (no apago la pc) llega a 4.4 estable pero no quiero estar al borde con las temperaturas de los VRM, No tengo ninguna otra limitacion ni de cpu ni refrigeracion para continuar solo de mother, Mis memorias de 1600mhz 9/9/9 las tengo en 1600mhz 7/8/7   =D.\n\npd: Los VRM son los que se encargan de controlar que al CPU le llegue el voltaje correcto en el momento correcto sin desperdiciar energia ni dejandolo con menos de la que precisa. Estas mierdas siempre calientan en todos los mothers pero casi nadie lo mide ya que solo en ambiente de overclock se los lleva a un limite. Sin overclock creo que los VRM en full llegaban a 75c pero repito que su funcionamiento correcto es hasta 114c en 115c ya hay problemas (estube estudiando la posibilidad de hacer una disipacion especial para los VRM pero ando con pocas ganas de todo.\n\nYo lo que me referia con la version E es si querias ahorrar a nivel energetico para ir por un mother mas economico pero no es el caso el usuario busca un mother gammer incluso (gasto inutil ya que con tener el ultimo chipset y capacitores solidos el resto es malgasto... excepto que venga con un mejor chip de audio pero... meh.\nY como dije yo al armar una pc gammer haria esto:\nVeo el presupuesto:\nelijo placa de video\nmother ultimo chipset sea amd o intel\nagrego procesador\nram ponerle 8gb (velocidad ideal 1600 en ddr3 y 2133 en ddr4 ya que no estan pensadas para overclock)\ndisco (si es muy buen presupuesto un ssd para el sistema)\nlectora opcional\nGabinete Mid tower con buena refrigeracion\nFuente Thermaltake <3 del wattage que haga falta (wattage calculator de outervision es muy util! =D )\nDe ahi en mas miro si sobra dinero y vario la placa de video o cpu el resto comunmente no lo cambio.\n\nIgual te digo que si ibas por un cpu del socalo 1151 te iba a dar la razon ya que tiene soporte DDR4 (aunque el valor es mas elevado) yo HOY en dia si me cambio de micro iria por el i7 6700 (sin la K por que no me da el presupuesto =c ) y un mother con z170 y ddr4. Pero sigo ahorrando para la moto y si lo hago no llego mas xD","replies":[{"poster":"support girl uwu","date":"2016-04-01T22:05:25.483+0000","up_votes":1,"down_votes":0,"body":"Viste las pruebas de las DDR4? xD Fueron la peor decepción después de Mantle. DDR4 no tendría ni que ser una opción para gaming, por el hecho que, para empezar, no está pulida, y la dif entre 1333mhz de ram con mala latencia, a 2300mhz con latencia perfecta, y una ram de último nivel, no llega a ser medio fps. \n\ni7 para gaming también son otro gasto inecesario, cuesta casi el doble de un i5, y rinde basicamente igual, porque el HT no está pensado para gaming, sino para diseño pesado y renders. \n\nLo de la temperatura lo dije poniendo un mother con TDP de 95W y chipset 760G (en vez de 970+) en un 8320 oceado para que rinda como un 8350, además no solo pasa por la temperatura (que si llega a 120C° el northbridge), sino por fps, donde en AMD hay diferencia, y MUCHA, entre esos chipsets en FX. (casi 20 fps a veces).\n\nhttp://www.taringa.net/comunidades/serviciotecnico/8790921/Benchmark-Motherboard-para-un-Fx-8320.html\n\nAhí hay benchmarks de justamente lo que digo.\n\nY las fuentes thermaltake no son muy recomendables, son caras, es un 50-50 que te salga algo bueno o malo, y las únicas rescatables son las tt smart, pero empeoraron la calidad ahora, Seasonic, EVGA y XFX son mucho mejores en cuanto a fuente, Coolermaster, Sentey y Thermaltake están bastante atras.","replies":[{"poster":"ZeNch","date":"2016-04-01T22:14:23.151+0000","up_votes":1,"down_votes":0,"body":"1 el comentario era para una pc mia quien te dijo q era solo gammer? trabajo con al pc y mas arriba comente el uso que le daba.\n2 las thermaltake son de las mejores fuentes... aunque en realidad cualqueira que supla la necesidad de la pc y tenga el 80 bronce silver plus gold sirve.\n3 las memorias ddr no tienen (en mi pc) la intencion de ganar fps si no velocidad de ejecucion de maquinas virtuales. por eso en pc gammer como dije si es ddr3 usaria 1600 mhz no hay mucha dif de $ y es worth.\nsi es ddr4 es otro tema ya que compraria segun el rpesupuesto la que el controlador de memoria en el cpu tome como maxima ( 2133 aprox).\n\nEn mi caso me beneficio de menores timmings (latencias) pero overclockear las memorias tiende a ser suerte y mucha dedicacion, probar testeos de estabilidad, benchmarks, uso real. Prefiero mis rams de 1600 a 7-8-7 que a 1866 con 9-10-9 (que se lo bancan aunque aumentando un pelin el voltaje)\nIgual agrego que hay un limite, en 1250mhz con 6-6-6 no tengo una ganancia la verdad.\nNi mas es mejor ni menos es mejor, es buscar el punto justo segun el uso que le des a la pc... si es para juegos dejala de fabrica si sos un loco por el oc subi mhz si buscar rendimiento en aplicaciones de diseño/maquinas virtuales o cualqueir cosa que requiera emulacion o compresion, hay que buscar el punto justo.\n\nMezclaste lo que comente para mi pc con lo del tema del gamming./","replies":[{"poster":"support girl uwu","date":"2016-04-07T06:16:08.689+0000","up_votes":1,"down_votes":0,"body":"El tema se llama ''Ayuda para armar PC GAMER'', es un foro de lol, es obvio que iba a pensar que hablabamos de una pc óptima para el gaming y no para el uso de virtualbox y etc. xD","replies":[{"poster":"ZeNch","date":"2016-04-07T12:33:59.977+0000","up_votes":1,"down_votes":0,"body":"pero la respuesta que hiciste fue respecto a mi comentario y en mi comentario explique cosas segun mi punto de vision y el uso que yo le doy a la pc y es por eso que defiendo siertas tecnologias.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Kny Franco","date":"2016-03-25T12:36:10.956+0000","up_votes":1,"down_votes":0,"body":"Osea, directamente no me recomendas comprarme las cosas AMD?","replies":[{"poster":"support girl uwu","date":"2016-03-30T00:16:19.032+0000","up_votes":1,"down_votes":0,"body":"En APU's (procesador con placa de video integrada) si tenes muy bajo presupuesto sí, en todo lo demás, no.","replies":[]}]}]},{"poster":"Hayato","date":"2016-03-31T14:45:07.854+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kny Franco,realm=LAS,application-id=v7qsfXsE,discussion-id=v8H5jZXL,comment-id=,timestamp=2016-03-25T10:45:11.126+0000)\n>\n> Estoy armando una computadora gamer y tengo algunas dudas, quiz&aacute; alguno de ustedes que sabe de computadora me pueda ayudar. No solo la quiero para jugar LoL, la quiero para juegos copados como Skyrim full, GTA 5 full (o alta), lo nuevo de assasin&#039;s y juegos que vallan saliendo. Bueno, esta es la compu que tengo en mente:\n> \n> * Gabinete: **Corsair Spec 03** \n> * RAM: 2 **Kingston Ddr3 4gb Hyper Fury 1866mz**\n> * Procesador: **Vishera Fx X8 9370**\n> * Placa madre: **Gigabyte Ga-970a-ds3**\n> * Disco rigido: **Western Digital Caviar Black 1tb**\n> * Fuente: **Sentey Xpp725**\n> * Placa de video: **Ati Radeon R7 370 4gb**\n> \n> Mi mayor duda es la placa de v&iacute;deo porque creo que podr&iacute;a comprar una mejor pero el problema es que no se cual combinar&iacute;a bien con todo esto sin tener que pagar una fortuna (esa placa sale 4200$ y hasta 6000$ estiro). El procesador me gusta mucho y me pareci&oacute; justo el precio por lo que es, la fuente creo que es suficiente, el disco r&iacute;gido es un ca&ntilde;o, las rams est&aacute;n buenas, el gabinete tiene buenos coolers y se ve c&oacute;modo pero la placa madre tambi&eacute;n no se si me conviene una mejor. Que opinan ustedes? Vale la pena 17148$ por esta maquina o le pongo un poco mas? Correr&aacute;n los juegos mas pesados? Ayuda!!!\n> \n> EDIT: Y asi que les parece? \n> \n> Mother: MSI 970 Gaming AMD AM3+(970 Gaming)\n> Gabinete: Corsair Spec 03\n> Procesador: CPU AMD FX 8350 X8 4.2Ghz Vishera AM3+(FX8350)\n> Memoria Ram: 8192 MB en 2 módulos DDR3 (1 x Memoria Kingston DDR3 8GB 1600Mhz 2x4gb HyperX) \n> Placa de Video: Placa de Video MSI GTX960 Gaming 4GB DDR5(Gaming) \n> Disco Rígido: 1000GB (Disco Rígido WD 1TB Sata 3 6.0Gb/s Caviar Blue) \n> Medio Ópticos: Grabadora de DVD RW SATA 24X Asus \n> Fuente:\tFuente Sentey MBP650-HS 650W 80 Plus Bronze\n\nEsta no te gusta? Es lindo bicho\nhttp://www.mundofix.com/categorias/pcs-y-notebooks/pcs-de-escritorio/pc-intel-i5-4440r938081tb-detalle.html","replies":[]},{"poster":"Tecnicomando","date":"2016-03-25T11:40:45.043+0000","up_votes":1,"down_votes":0,"body":"Realmente no me termina de juntar/pegar esa config, no es mala pero ya me an traido muchos fx con problemas de temperatura estos ultimos años... yo armaria por ese valor algo asi\n\nTarjetas de Video\tASUS GTX 950 (STRIX-GTX950-DC2OC-2GD5-GAMING)\nProcesadores\tIntel Core i5-4440 (BX80646I54440)\nPlacas Madre\tMSI B85M-E45\nMemorias Ram\tKingston HyperX Fury Black HX316C10FB/4 (1 x 4GB | DIMM DDR3-1600)\nMemorias Ram\tKingston HyperX Fury Black HX316C10FB/4 (1 x 4GB | DIMM DDR3-1600)\nDiscos Duros y SSD\tWestern Digital Blue 1 TB WD10EZEX\nFuentes de poder\tEVGA 500W (100-W1-0500-KR) (500 W)\nGabinetes\tSentey Stealth GS-6008\n\no en amd  cabiando solo esto \n\nTarjetas de Video\tMSI R9 380 (R9 380 2GD5T OC)\nProcesadores\tAMD FX-8320 (FD8320FRHKBOX)\nPlacas Madre\tASUS M5A97 LE R2.0\nSi o si CoolerMaster Ventilador CPU M/Socket Hyper T4\n\nel gabinete es opcional, la fuente te va sobrada y la cpu y gpu te sobran para jugar lo que quieras\n\nYo me voy por el amd ya que le saco rendimiento al overclock y amdcrosfire,ademas tedra buena disipacion de temperatura...\n\nSi no tienes idea de overclock o meter mano, el intel ...\n\n\nMe situo en el mercado establecido, no en mercadolibre y esas basuras que venden partes ultraviejas como actuales y costosas, y por ultimo puedes comprar en chile ya sea mediante un viajecito o por despacho( alguien de aca te manda o la tienda te lo envia)\n\n\n\nsalu2","replies":[{"poster":"Kny Franco","date":"2016-03-25T12:05:59.726+0000","up_votes":1,"down_votes":0,"body":"Si es que aunque yo ahora no sepa nada después voy a aprender, la computadora mas o menos la arme con un amigo que me fue diciendo diferencias entre marcas y eso, yo toda mi vida tuve Intel y Nvidia de echo mi notebook es una Asus N56vb tiene un i3 y una Nvidia de 2gb y anda perfecta, y eso que es un i3 pero bueno, el procesador no me da para juegos mas pesados. Preferi AMD porque creo que se ajustaria mas a lo que yo quiero en esta pc y ademas me cabe la onda de aprender. Asi que voy a seguir por la rama de AMD:\n\nLa placa de video que me recomendaste esta saladita, pero de enserio es buena? De cualquier forma recupero la plata porque el procesador es mas barato. La placa madre la habia visto pero me parecio mejor la que habia encontrado, me gusta la marca Gigabyte y muchos amgios mios me la han recomendado (aunque obviamente es Asus). El procesador de enserio es tan malo? Buscando sus caracteristicas me parecio bastante bueno, en que es malo? Y gracias por el cooler, ahi lo voy a buscarlo :)","replies":[{"poster":"ZeNch","date":"2016-03-25T14:30:54.836+0000","up_votes":1,"down_votes":0,"body":"Asus y gigabyte son marcas buenas pero asus en algunos modelos es histerico con las configuraciones doble dual chanel de memorias que es algoq ue no vas a hacer uso.\nRespecto a overclockear tenes que leer mucho y tener CUIDADO y PACIENCIA, los voltajes en manual y subir de a poco guardando las configuraciones a medida que veas que funcionan con los test de stress. Conoci gente que cago mother asi jajajaja.","replies":[{"poster":"Kny Franco","date":"2016-03-25T14:58:23.982+0000","up_votes":1,"down_votes":0,"body":"Y asi? Fue a la conclusión que llegue después de tanto googlear y recibir opiniones. En esta pc tengo 1685$ y me parece que esta bastante bien\n\nMother: MSI 970 Gaming AMD AM3+(970 Gaming)\nGabinete: Corsair Spec 03\nProcesador: CPU AMD FX 8350 X8 4.2Ghz Vishera AM3+(FX8350)\nMemoria Ram: 8192 MB en 2 módulos DDR3 (1 x Memoria Kingston DDR3 8GB 1600Mhz 2x4gb HyperX)\nPlaca de Video: Placa de Video MSI GTX960 Gaming 4GB DDR5(Gaming)\nDisco Rígido: 1000GB (Disco Rígido WD 1TB Sata 3 6.0Gb/s Caviar Blue)\nMedio Ópticos: Grabadora de DVD RW SATA 24X Asus\nFuente: Fuente Sentey MBP650-HS 650W 80 Plus Bronze","replies":[{"poster":"ZeNch","date":"2016-03-25T16:43:44.868+0000","up_votes":1,"down_votes":0,"body":"Me parece una muy buena opcion asi, saque el calculo de la fuente con una calculadora de watts y sirve (ya que tiene la certificacion de 80)\nPor mi parte si fuera hecha para mi le sacaria la lectora de cd/dvd y con ese dinero me compro un pendrive XD pero eso ya es gusto personal lo importante es lo otro.\n\nNo saque la cuenta de dinero y eso pero haciendo incapie en los componentes me gusto mas... yo deberia cambiar mi placa de video mmm pero quiero una moto... pero la placa pero la moto ahhhhhhhhhhhhhhhhhhhhhhh... =c","replies":[]}]}]},{"poster":"Tecnicomando","date":"2016-03-25T15:13:09.518+0000","up_votes":1,"down_votes":0,"body":"La idea de la config que te di es que no necesites nada por los proximos 3 años y si vas a cambiar algo, solo sera la gpu ya sea agregando una segunda o cambiandote por una mejor...\n\nEl cpu no es malo, pero te lo pongo asi, tienes un motor de formula 1 y lo montas en un chasis de lada,hacer una config para ese cpu es saladisima ,mejor algo balanceado a tu presupuesto con miras a que dure... aca te dejo builds mas economicas pero en realidad no les veo mucho futuro ,no son malas,pero son mas bien modestas a lo que estabas posteando\n\n\nTarjetas de Video\tASUS GTX 750 Ti (GTX750TI-OC-2GD5)\nProcesadores\tIntel Pentium G3250 (BX80646G3250)\nPlacas Madre\tMSI H81M-E33\nMemorias Ram\tCrucial CT51264BA160B (1 x 4GB | DIMM DDR3-1600)\nDiscos Duros y SSD\tWestern Digital Blue 500 GB WD5000AAKX\nFuentes de poder\tEVGA 400W (100-N1-0400-L1) (400 W)\nGabinetes\tSentey CS1-1382 Plus\n\namd\n\n\nTarjetas de Video\tSapphire R7 250 (11215-00-20G)\nProcesadores\tAMD FX-6300 (FD6300WMHKBOX)\nPlacas Madre\tECS A960M-MV\n\naca puedes jugar de todo, no full ni mediocre,bien...\n\nNada de hacer overclock,lo armas y a jugar ; precios mas aterrizados un pc gamer en toda regla , basico, no pro como el que querias, pero funcional, en ambos casos, si vas  a mejorar algo , el gabinete por algo mas barato y duplicar la ram\n\n\nsalu2","replies":[]}]}]},{"poster":"Exit","date":"2016-03-25T10:48:57.941+0000","up_votes":1,"down_votes":0,"body":"en invierno te va a correr bien, porque vas a tener una estufita alado y en verano bueno xd jaja","replies":[{"poster":"Kny Franco","date":"2016-03-25T11:00:03.722+0000","up_votes":1,"down_votes":0,"body":"Por? El gabinete viene con 3 coolers y tiene espacio para 6 ventiladores, las ram sistema de refrigeración y bueno los sistemas de refrigeración que traen cada una de los componentes. No es suficiente? Debería ponerle mas coolers de los 3 que trae?","replies":[{"poster":"Rivu","date":"2016-03-25T11:48:11.430+0000","up_votes":1,"down_votes":0,"body":"un cooler es un accesorio estético prácticamente, por lo menos los de fábrica. Para una pc gamer, más como esta, le tenes que poner refrigeración líquida, que te va a salir un par de lucas, pero se te arregla el tema de la temperatura","replies":[{"poster":"ZeNch","date":"2016-03-25T14:35:33.808+0000","up_votes":1,"down_votes":0,"body":"para el cpu serie 9xxx SI aunque hay algunos de aire que son bestias que pueden servirle... pero termina costando similar a un kit liquido facil de instalar.\nCon el cpu serie 8xxx si no overclockea el de stock sirve.\nLos ventiladores en el gabinete (bien colocados) no estan colocados para refrigerar estan hechos para generar flujo de aire de forma estrategica considerando que el calor sube y teniendo en cuenta las salidas de aire del gabinete.\n\nSiempre combiene de adelante hacia atras y de abajo hacia arriba pero hay gabinetes que pueden tener variacion. el cooler lateral depende, si el ambiente de tu cuarto es muy fresco (por ejemplo si vivis con aire acondicionado todo el dia) quizas combiene meter, caso contrario sacar para erradicar el calor de las placas de video sin que llegue a hacer el trayecto hacia arriba pasando por el procesador)","replies":[]}]}]}]},{"poster":"ZeNch","date":"2016-03-25T10:57:24.657+0000","up_votes":1,"down_votes":0,"body":"Y que disipador para el procesador? recorda que esos procesadores de AMD vienen sin ventilador en la caja. (el FX8320 tiene menos velocidad pero es buenisimo, trae ventilador son 8 nucleos a 3.6 creo) y la diferencia de precio compra una mejor placa de video... igual esa esta linda.","replies":[{"poster":"Kny Franco","date":"2016-03-25T11:06:05.349+0000","up_votes":1,"down_votes":0,"body":"Es que ese procesador me pareció excelente para una computadora gamer. Hay otros que están buenos pero estoy yendo a AMD solo porque quiero algo mas creado específicamente para videojuegos, sino me hubiera ido por Nvidia xd No había buscado coolers gracias por decirme, pero no se cual necesitaría para ese procesador, tenes alguno que puedas recomendarme?","replies":[{"poster":"ZeNch","date":"2016-03-25T14:10:44.971+0000","up_votes":1,"down_votes":0,"body":"necesitas uno que minimo disipe 200W mi recomendacion es que vayas por un procesador mas chico (trabajo de la informatica desde 2009) tengo el FX8320 (es AMD) y es muy buen micro (obvio que le puse refrigeracion liquida y lo overclockie pero por hobbie no por necesidad) vos vas a sacar mas provecho a una mejor placa de video que a un procesador IDENTICO que solo tiene 600 o 800mhz mas.\n*estarias comprando un cpu con las mismas instrucciones y tecnologia pero con un poco menos de velocidad (los juegos no te van a exigir tanto... 8nucleos a 3.6 sobran ese es de 4.4 ... yo el mio lo tengo a 4.4 =P pero es otro tema) que te va a salir mas barato, no vas a tener que comprar un cooler (que son caros no son los chiquitos son esas bestias de 2 coolers de 12cm + disipador).\nesa plata la podes invertir en placa de video donde SI vas a notar mayor diferencia en juegos.","replies":[]}]}]}]}