{"poster":"Mistro","date":"2016-09-02T18:23:56.932+0000","title":"Basta Yasuo!","subforum":"Discussioni generali","up_votes":75,"down_votes":24,"body":"Facciamo sentire il nostro odio verso gli Yasuo e indiciamo uno sciopero generale! Sono stanco di trovarlo in ogni partita e vederlo continuamente pushare top, per non parlare dell'ego di questi giocatori che sanno solo flammare! Eliminiamo questa cellula malata all'interno del meta con un enorme nerf! Se siamo in tanti possiamo ottenere qualcosa! Si astengano dal commentare i main Yasuo che non hanno voce in capitolo.","replies":[{"poster":"wildfox99","date":"2016-09-02T20:20:51.320+0000","up_votes":9,"down_votes":0,"body":"wow,da uno che scriveva \"basta yasuo\" mi sarei aspettato una valanga di -1 {{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Mistro","date":"2016-09-02T20:22:23.500+0000","up_votes":2,"down_votes":1,"body":"E' perché non è solo una lamentela causata da una bruciatura di culo, ma una questione seria","replies":[]}]},{"poster":"StitchedClone","date":"2016-09-02T18:31:14.422+0000","up_votes":9,"down_votes":1,"body":"poi quando li hai in team fanno schifo, ma quando li hai contro sono i main yasuo koreani che con 200 hp ti outplayano tutto il team e finiscono il game da soli","replies":[]},{"poster":"Kazushi San","date":"2016-09-02T20:47:47.079+0000","up_votes":7,"down_votes":0,"body":"io direi di picchiare direttamente chi lo usa e gg","replies":[{"poster":"Kim114","date":"2016-09-02T21:02:28.245+0000","up_votes":1,"down_votes":1,"body":"E ucciderei che lo maina","replies":[{"poster":"Mistro","date":"2016-09-02T21:05:56.270+0000","up_votes":2,"down_votes":0,"body":"Cercare di non andare OT. Rimaniamo seri per una volta","replies":[]}]}]},{"poster":"Kim114","date":"2016-09-02T18:41:23.172+0000","up_votes":8,"down_votes":1,"body":"VOGLIAMO LA GIORNATA IN CUI YASUO NON PUÒ ESSERE PICKATO","replies":[]},{"poster":"Térence Fill","date":"2016-09-03T01:13:44.177+0000","up_votes":2,"down_votes":0,"body":"Ciao Mistro,\nti rispondo da ex giocatore in quanto, causa la mia scarsa sopportazione di molti random player, ho disinstallato il gioco qualche settimana fa.\n\nIo ho giocato Season 4-5 e parte della 6 (Main Mid, 80% dei game con dei Mage), e l'unica patch che mi è parsa realmente bilanciata fra TUTTI I CHAMPION è stata la penultima rilasciata in Season 5, dove solamente Garen si ritrovava con un po' di vantaggio in early game ma di tutti gli altri Champion, Item compresi, a mio avviso non si poteva dire veramente nulla. Dopo due patch hanno rivisitato sia i talenti, che gli item (prima ADC-Assassin, poi Mage) rimescolando nuovamente le carte. A mio avviso, non ce n'era bisogno. Ma la RITO sono loro, non io, quindi evidentemente hanno pensato fosse meglio così.\nQuesto per dirti che, secondo me, BALANCE e LOL sono, e probabilmente resteranno, due rette parallele. La compensazione di questo sbilanciamento viene spesso colmata nel momento del ban/pick ad inizio game: banno il Champion che mi countera e cerco di counterare il mio avversario in lane.\n\nPer quanto riguarda Yasuo..\nUltimamente vedevo molti Summoner buildare il {{item:3046}} quando, considerando la possibilità di shiftare fra i minion con la Q, secondo me avrebbe più senso startare con lo {{item:3087}} (che per altro dalla Season 6 ha un bonus danni maggiore sui minion, quindi si aumenta il push già elevato di Yasuo). E per il recupero di un po' di atk speed vanno bene anche le {{item:3006}} associate a quest ultimo.\n\nSegui di {{item:3031}} , {{item:3072}} , {{item:3812}} (che ha una passiva che può essere vista anche come \"difensiva\") e chiudi di {{item:3026}} (tanto Yasuo ha i CD bassi, quindi tempo di resuscitare ti ritrovi col 100% crit e una valanga di lifesteal, quindi può anche funzionare come last item).\n\nIo farei questa build, non quella che si vede ultimamente, e giocherei Yasuo Mid, perchè di fatto in late game non può fare da front line come un vero Top laner.\n\nPer questo penso che la maniera migliore per nerfare Yasuo sia in maniera \"indiretta\", ovvero nerfando gli item che builda anzichè il Champion stesso.\nIo, personalmente, nerferei lo Statik E BASTA: per il costo che ha permette troppo push in early a Champion come Yasuo e Tryndamere. La differenza è che Tryndamere è counterabile come pochi altri, mentre Yasuo ha un set di abilità che, se associate a un paio di mani, ti portano direttamente al Diamond (perchè questa è la verità, e non mi dite che vale per tutti i Champion, perchè mi duole informarvi che non è così).\n\nIo modificherei solo questo. Ed appoggio il tuo post.","replies":[{"poster":"Mistro","date":"2016-09-03T06:26:39.252+0000","up_votes":2,"down_votes":0,"body":"Apprezzo l'impegno che hai messo nello scrivere la tua opinione ma non giocando da un po' non puoi neanche immaginare la frustrazione di trovarsi Yasuo in ogni singola partita che non sia Draft, che ti costringerà a giocare nello stesso identico modo delle partite precedenti. Lo statikk è a posto, tanto non ne ha bisogno per fare waveclear, anzi il danzatore fantasma offre migliori statistiche quali la velocità di inseguimento e i danni ridotti che condannano il nemico a morte sicura. Se potessi decidere cosa cambiare andrei a modificare la E, che ha lo stesso potere di zoning di una Lux in quanto avvicinarsi un attimo ai minion per farmare significa dare la possibilità a Yasuo di scattarti incontro e iniziare la sua danza di morte. Per esempio dargli una ricarica più alta, che si azzera uccidendo l'unità verso cui si scatta. Anche la sua combo EQ manca di counterplay, non si può cercare di schivare il tornado se il tornado viene lanciato da sotto di noi, e Yasuo ha anche la possibilità di farla su dei minion per poi flasharci addosso facendo venir fuori quelle combo quasi da glitch che sanno fare lui e Riven.\nLa build full AD non viene più usata, per il semplice fatto che gli bastano due strumenti per arrivare al 100% di critico che gli permettono di buildarsi difesa e diventare una forza inarrestabile in teamfight e in 1v1.\nC'è un problema di fondo in questo meta, cioè del tank = fonte inuccidibile di alti danni, ma Yasuo ne è il massimo esponente e offre poche possibilità di counterplay.","replies":[{"poster":"kernel panic","date":"2016-09-03T09:25:03.751+0000","up_votes":5,"down_votes":0,"body":"Il phantom dancer dovrebbe essere reso ranged only, come il runann. \n\nQuell'item sui melee è completamente broken, sopratutto su quelli com trynda e yasuo che abusano di tutte le stats che offre.","replies":[{"poster":"Heavenly Yasha","date":"2016-09-05T09:09:14.856+0000","up_votes":2,"down_votes":0,"body":"Lo dissi anche io tempo fa e venni flammato. La PD è un item per aiutare i ranged a kitare meglio, soprattutto quelli a basso range, non vedo perchè la passiva funzioni anche sui melee come Yasuo che già sono broken in 1v1.","replies":[]}]}]},{"poster":"kernel panic","date":"2016-09-03T04:52:27.724+0000","up_votes":2,"down_votes":0,"body":"E' proprio il phantom dancer che rende yasuo forte.\n\nUn item che ha una passiva che ti fa prendre  il 12% di danno in meno lol. Ma stiamo scherzando.\n\nUno yasuo che build pd, trinity e mallett è difficilissimo da tirare giù 1v1.","replies":[]}]},{"poster":"OrangeSummons","date":"2016-09-02T20:21:02.623+0000","up_votes":5,"down_votes":3,"body":"Ma per usare decentemente Yasuo servono le mani... gli Yasuo di cui vi lamentate tanto spesso non sono i main, sono gli stessi che poi si lamentano della forza di ogni champion di questo cavolo di gioco.","replies":[{"poster":"wildfox99","date":"2016-09-02T20:59:21.863+0000","up_votes":4,"down_votes":0,"body":">Ma per usare decentemente Yasuo servono le mani... \n\n\n\n\ncome giochi tu,senza mani? {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"LT Darker","date":"2019-04-09T09:27:41.148+0000","up_votes":1,"down_votes":0,"body":"Se ti interessa 😂 un player del NA che gioca {{champion:412}} elo master usa i piedi 😂😂😂","replies":[]}]}]},{"poster":"BeastLikeTxcci","date":"2016-09-02T18:57:14.970+0000","up_votes":4,"down_votes":0,"body":"Mi sta proprio sulla minchia","replies":[]},{"poster":"Sky Striker Ace","date":"2016-09-03T09:20:19.133+0000","up_votes":1,"down_votes":0,"body":"E siamo a +27. Il forum è strano, eh?\nNormalmente ci sarebbero stati perecchi downvote.","replies":[{"poster":"Kim114","date":"2016-09-11T14:55:14.584+0000","up_votes":3,"down_votes":0,"body":"+47\nun caso?","replies":[]},{"poster":"Vileblood Pyke","date":"2016-09-03T13:18:31.100+0000","up_votes":3,"down_votes":1,"body":"Yasuo o lo ami o lo odi.\n\nEvidentemente il forum è pieno di gente che lo odia.","replies":[]}]},{"poster":"P R O Void Omen","date":"2016-09-08T11:02:34.464+0000","up_votes":3,"down_votes":0,"body":"Io devo dire che yasuo è un champ che mi piace molto. Sia come concept che come gameplay. Però è un champ stupido. Non ha senso trovarlo in ogni game quando la gente può tranquillamente pickare champ più divertenti e meno macchinosi. Q>E>AA>E>Q>E>AA>E>Q>R PENTAKILLA, E CHE CAZZO. La situazione è così disperata che ho deciso di pickare quasi sempre campioni che lo counterano. Sono disposto persino a giocare azir top in ranked pur di stuprarlo malamente. È una cosa che non sta ne in in cielo ne in terra che un SINGOLO champ si fatto tutto il game da solo contro un team di premade su TS  con un team di nabbi","replies":[]},{"poster":"Ultan","date":"2016-09-02T23:41:18.781+0000","up_votes":4,"down_votes":1,"body":"Yasuo non è da nerfare o reworkare o bilanciare....yasuo va DELETATO. Doppio critico, mobility no sense, ulti usabile praticamente sul 90% delle spell di tutti campioni (Può ultare sulla E di Vayne, oppure sulla q di maokai ahahah) da un range altrettanto ridicolo e ovviamente ha un cd di 30-40sec ahah, passiva della ulti ancora più ridicola (armor penetration a caso per 15 sec tipo),  il tornado che si attiva ogni 2 q che a sua volta ha 2 sec di cd ahah, per non parlare che il tornado procca danni on hit (grasp, statik, ecc), una barriera che blocca  pure gli auto attack...uno scudo nella passiva che si carica in base a quanto si muove yasuo ahahaha che ovviamente grazie alla bilianciatissima E e davvero basso, sul serio deletate sto coso","replies":[{"poster":"wildfox99","date":"2016-09-03T19:26:36.430+0000","up_votes":3,"down_votes":0,"body":">armor penetration a caso \n\n\"solo\" il 50% di penetrazione\n\n>ha 2 sec di cd \n\ncirca un secondo e mezzo se non erro\n\ne ti dimentichi che lo scudo di passiva si riattiva quando ulta\n\n{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Firenheit","date":"2016-09-02T20:50:14.409+0000","up_votes":3,"down_votes":0,"body":"Non è Yasuo, sono i bambini. \n\nGenji vi saluta!\nhttps://www.youtube.com/watch?v=Mc_5WXqRUFY&ab_channel=FineLeatherJackets","replies":[]},{"poster":"DeathGun95","date":"2016-09-02T19:00:11.452+0000","up_votes":4,"down_votes":4,"body":"secondo me il vostro unico problema e che non sapete giocarci contro 1 ,2 se dobbiamo parlare di un nerf gigantesco con lo scopo di non farlo piu usare tanto vale toglierlo anche se ci sono tank che fanno piu danno degli adc e non dovrebbe essere cosi in quanto se sei tank escludi il danno....a sto punto al posto di nerfare yasuo nerfate gli item ...","replies":[{"poster":"Mistro","date":"2016-09-02T19:02:33.098+0000","up_votes":3,"down_votes":1,"body":"Yasuo è un campione che al di là degli strumenti ha troppe cose a disposizione: sustain, scudi, mobilità, poke in lane, e una passiva più che sleale. Non ci si può saper giocare contro con tutte queste premesse","replies":[{"poster":"Hiziap","date":"2016-09-02T19:16:01.857+0000","up_votes":3,"down_votes":1,"body":"la passiva è troppo sleale,concordo","replies":[{"poster":"Mistro","date":"2016-09-02T19:42:41.357+0000","up_votes":2,"down_votes":0,"body":"Non parlo solo dello scudo, piuttosto del ridicolo 10% in meno di danni critici che DOVREBBE compensare alla doppia probabilità di colpo critico","replies":[{"poster":"Hiziap","date":"2016-09-02T20:27:15.059+0000","up_votes":3,"down_votes":0,"body":"hai ragione, sono completamente d'accordo lol. Io aumenterei i danni critici almeno al 30-35%","replies":[]}]}]}]},{"poster":"kernel panic","date":"2016-09-03T04:48:29.047+0000","up_votes":2,"down_votes":0,"body":"55% winrate con 11% di playrate. Quando un champ ha queste stats è broken. Punto.","replies":[]}]},{"poster":"Evil Pshyke","date":"2016-09-02T18:37:36.070+0000","up_votes":4,"down_votes":1,"body":"Io sono costretto a giocare solo Draft per bannarlo,altrimenti me lo trovo in ogni game,sia con il main account,sia con lo smurf livello 23,sia con lo smurf livello 10 e anche inferiore,è una cosa assurda.Trovo già noioso Yasuo come champion per il suo kit dato che continua a spammare Q ed E a non finire oltre ad avere neanche 30 secondi di cooldown sulla ulti,trovarselo in ogni game rende noioso proprio giocare  a LoL dato che su più di 130 champion mi trovo sia con che contro sempre lo stesso,e in questo modo ogni game è quasi uguale a quello precedente","replies":[{"poster":"Mistro","date":"2016-09-02T18:41:37.144+0000","up_votes":1,"down_votes":0,"body":"Sono completamente d'accordo, mi ritrovo nella stessa situazione. La Riot parlava di \"Rendere ogni partita unica\" sin dall'aggiornamento dei tiratori, ma questa cosa di Yasuo gli sta sfuggendo di mano","replies":[{"poster":"Loverfield","date":"2016-09-02T18:50:30.421+0000","up_votes":3,"down_votes":2,"body":"Si ma.. con tutti sti Yasuo che avete avuto contro... ancora non avete imparato a tenerlo a bada?\nIo non lo trovo nemmeno un problema ormai... Infatti preferisco bannare champion che in late game possono fare più danni di un assassino che ormai si builda bruiser per campare di più. (Preferisco bannare Kog'Maw, Vayne, Vladimir)","replies":[{"poster":"Neekron","date":"2016-09-02T19:43:02.415+0000","up_votes":3,"down_votes":0,"body":"Non è solo una questione di saperlo tenere a bada, non solo almeno. È anche una questione di diversità. Non è una cosa molto gradevole beccare yasuo nel 90% dei game, che sia nel tuo team o nel team nemico, un po' come lee sin un po' di tempo fa (non so se sia ancora così). Diventa pesante avere yasuo sempre e comunque, specialmente se giochi mid o top. Come è già stato detto, la riot ha detto di voler rendere ogni partita unica, ma al momento avere yasuo sempre contro rende le partite un po' meno uniche, aggiungi il fatto che yasuo non sia proprio il picco del bilancio ed ottieni la formula della rottura di palle. Va bene che un campione piaccia, ma non quando quel campione piace E viene giocato perché forte. Ormai pure io so giocare contro yasuo, ma diciamo che il \"che palle\" parte quando lo vedo pickato nel team nemico. E come già detto dall'autore, soffre della sindrome di vayne, quindi due terzi degli yasuo player sono tossici abbastanza da farti stare male","replies":[]},{"poster":"kernel panic","date":"2016-09-03T04:50:31.247+0000","up_votes":2,"down_votes":0,"body":"Ma con tutti i  kog maw e le vayne che hai avuto contro ancora non hai imparato a tenerli a bada?\n\nSinceramente preferisco bannare un champ che non ha cd, ha uno scudo, free crit, e che pur se si builda tank shotta chiunque.\n\n(Preferisco bannare Yasuo)","replies":[]}]}]}]},{"poster":"FyXarF","date":"2016-09-03T09:33:31.009+0000","up_votes":2,"down_votes":4,"body":"Allora gente, non possono nerfare un champ solo per il low elo.\nYasuo a master/challenger non esiste","replies":[{"poster":"Seamus83","date":"2016-09-04T17:19:35.271+0000","up_votes":1,"down_votes":2,"body":"difficile usare un exaust + CC!? lo Azzeri proprio","replies":[{"poster":"OverZStreak","date":"2016-09-10T23:36:10.545+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Seamus83,realm=EUW,application-id=MJVj50Jw,discussion-id=EAQE3iZa,comment-id=001b0000,timestamp=2016-09-04T17:19:35.271+0000)\n>\n> difficile usare un exaust + CC!? lo Azzeri proprio\n\nFidati non basta. Se quel cc è uno skillshot te lo disintegra e se una ulti di malphite il suo team volendo mentre cerchi di prendere yasuo che scatta nel tuo team ti ammazza.","replies":[]}]}]},{"poster":"InsidePr0","date":"2016-09-04T20:30:04.032+0000","up_votes":2,"down_votes":0,"body":"Concordo pienamente","replies":[]},{"poster":"OverZStreak","date":"2016-09-04T16:25:34.811+0000","up_votes":2,"down_votes":0,"body":"Ottiene uno scudo camminando, full tank fa danni come un assassin, raddoppio dei critici con la passiva. Direi che è bilanciato, no?","replies":[]},{"poster":"MisterOffice","date":"2016-09-04T13:04:53.082+0000","up_votes":2,"down_votes":0,"body":"http://puu.sh/qZyW9/4963a1be53.jpg  \n\nNe riparliamo quando cambia qualcosa","replies":[]},{"poster":"Ruvio95","date":"2016-09-02T18:51:19.967+0000","up_votes":2,"down_votes":0,"body":"Ha bisogno di un pesante nerf su ogni spell, compresa passiva, fa schifo! \nL'unico modo per evitarlo è fare le draft","replies":[{"poster":"Kim114","date":"2016-09-02T21:06:31.629+0000","up_votes":1,"down_votes":0,"body":"Mettetegli almeno l'energia così smette di spammare caso","replies":[{"poster":"Mistro","date":"2016-09-02T21:08:36.960+0000","up_votes":2,"down_votes":0,"body":"Non penso sia possibile, significherebbe togliere lo scudo che è uno degli elementi caratteristici di Yasuo.","replies":[]}]},{"poster":"Hiziap","date":"2016-09-02T19:15:19.710+0000","up_votes":2,"down_votes":1,"body":"Sono d'accordo!!!!!!!!!","replies":[]}]},{"poster":"Mytlix","date":"2016-09-02T20:25:19.635+0000","up_votes":2,"down_votes":0,"body":"http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2824718915/221991090?tab=overview\n\nTipico tutti e 2 mastery lvl 7 ma il yasuo nemico fa easy tripla il nostro invece fatica a last hittare con yasuo... so sad!","replies":[]},{"poster":"Nice Doggo","date":"2016-09-02T18:53:21.458+0000","up_votes":2,"down_votes":0,"body":"La cosa triste è   che ultimamente (essendo main supp) sto cercando di imparare a farmare e cercare di fare qualcosa di buono con ahri (prossimamente anche con ez) ma imparare i vari match up mi risulta impossibile... idem farmare... in normal no draft becco solo yasuo o zed... c'è mio oddio ma variate un po'  (rimedio con le draft... ma finire mid è raro, meglio ctrl-v mid) vabbo.\nPenso che yasuo sia il champ più giocato dopo... teemo?","replies":[]},{"poster":"Evlok","date":"2016-09-02T20:46:25.209+0000","up_votes":3,"down_votes":1,"body":"Oh ma ora la voglio avere la voce in capitolo (e non sono main Yasuo, anzi sono uno schifosissimo support main Thresh che sa fare niente per aiutare il team).\nMa questa moda di stare a sparlare dei main Yasuo finirà mai? E non si ferma nemmeno ai main, ma anche ai poveri cristiani che lo vogliono imparare e anche ad altri champ ugualmente \"op\". Ci rendiamo conto? Io la trovo esagerata sta cosa, e stiamo parlando di un champ che è counterato da mezzo mondo. E non vale nemmeno la pena bannarlo in Bronzo e Silver che sicuramente non sarà utilizzato al massimo, quindi andate di free elo se ve lo trovate contro. Sprecare un ban su Yasuo, Zed (che ha un winrate bassissimo, più basso di Zilean) etc. quando ci sono Master Yi, Jax e altri che fanno buchi in quell'elo. Voglio dire, azionate il cervello.","replies":[{"poster":"Mistro","date":"2016-09-02T20:55:39.556+0000","up_votes":3,"down_votes":1,"body":"Yasuo = flamer non è un meme o un luogo comune, è un dato di fatto. Ma non è questo il punto principale. Il flame è un fattore secondario dovuto al fatto che il giocatore viene carriato dal personaggio e dà la sensazione di essere più bravi degli altri","replies":[]}]},{"poster":"Lichstein","date":"2016-09-02T18:28:54.818+0000","up_votes":3,"down_votes":1,"body":"Concordo IN PIENO","replies":[]},{"poster":"Kim114","date":"2016-09-15T16:09:51.733+0000","up_votes":2,"down_votes":1,"body":"Questa conversazione è entrata nella lista delle discussioni più accese, un caso?","replies":[]}]}