{"poster":"AlexIchKing","date":"2018-09-02T18:56:05.723+0000","title":"League of Legends Clan im Neuaufbau sucht dich! [ChaosClubGermany]","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Herzlich Willkommen zu der Vorstellung des ChaosClanGermany,\n\ndu sucht nach einem Clan der dir eine Grundlage gibt mit deinen Freunden, Kollegen, Mitstreitern und vielleicht auch Familie auf der Kommunikativen Ebene TeamSpeak zu agieren?\n\nDu suchst nach einem Bereich der dir nicht nur Perspektiven in League of Legends sondern auch in anderen Games gibt?\n\nDu willst ein Teil einer Gemeinschaft / eines Clans werden der dich auf die unterschiedlichsten weisen unterst&uuml;tzt oder m&ouml;chtest gerne andere Spieler unterst&uuml;tzen?\n\nDu m&ouml;chtest mit zu einem gut wachsenen Competitive Clans gehören?\n[](https://www.chaosclan-germany.de/)\nDann schau dir an was wir dir bieten und was unsere Erwartungen an dich sind!\n\nWas wir dir bieten:\n\n1. Einen TeamSpeak wo ihr eure Trainingszeiten durchf&uuml;hren k&ouml;nnt\n2. Einen geordneten Ablauf mit unterschiedlichen Bereichen, wo ihr euch selber kreativ einbringen k&ouml;nnt\n3. Eine Gemeinschaft die f&uuml;r einander da ist\n4. Einen F&uuml;hrungszweig, welcher eure Anmerkungen und W&uuml;nsche aufnimmt, umwandelt und respektiert\n5. Chancen um zum Teamleiter oder dessen Stellvertreter und/oder Ratsmitglied aufzusteigen\n6. Weiterhin gibt es außerhalb der Teams noch die Möglichkeiten als Teamsupporter oder Trainer zu aggieren oder in unserem Social Media Bereich aktiv mitzuwirken\n7. Trainer um deinen Individuellen Spielstil weiter nach vorne zu bringen\n\nWas wir erwarten:\n\n1. Du ben&ouml;tigst einen League of Legends Account und bist aktive auf diesem Ingame\n2. Du bringst Freude und Spa&szlig; am Spiel mit\n3. Du bist respektvoll im Umgang mit anderen Menschen\n4. Du besitzt TeamSpeak mit einem funktionierenden Headset\n\nBewerben könnt ihr euch jeder Zeit gerne auf unserem TeamSpeak Server: ChaosClan-Germany.de\nAuf unsere Homepage https://www.chaosclan-germany.de/\n\noder ganz einfach Ingame an mich wenden.\n\nMit besten Grüßen\nGetSnipedHD/Alex","replies":[{"poster":"AnzuAyano","date":"2018-09-03T00:06:19.725+0000","up_votes":1,"down_votes":0,"body":"Leider scheint euer TS etwas veraltet da man beim einloggen direkt geklickt wird wenn man sich bei euch vorstellen will, mit der Meldung : Server is to old for This command","replies":[{"poster":"AlexIchKing","date":"2018-09-03T12:23:45.276+0000","up_votes":0,"down_votes":0,"body":"Es tut mir leid wenn es problematiken mit TeamSpeak Server gerade gibt ich werde mir das gerne heute abend anschauen. Gerne kannst du mich solange unter meiner E-Mail Adresse. g.alex12@gmx.de kontaktieren. Ich schaue mir den Fehler heute abend dann an. \n\nBeste Grüße\nGetSnipedHD","replies":[]}]},{"poster":"AlexIchKing","date":"2018-09-02T20:06:54.844+0000","up_votes":1,"down_votes":0,"body":"Ich bin am 03.09.2018 wieder ab zirka 22Uhr auf dem TS ansprechbar","replies":[]}]}