{"poster":"Riot MapleNectar","date":"2017-09-27T20:35:41.741+0000","title":"Janna Hotfix Context","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hey folks!\n\nAs you&rsquo;re reading this, we just finished deploying a balance hotfix for Janna as follow-up on our changes to her on 7.19. The goals for the initial changelist were pretty simple, if a Janna wants to win lane, she has to interact and engage with her lane opponents in ways she didn&rsquo;t have to before. We wanted to make playing as Janna feel more rewarding when played well while giving her opponents the opportunity to actually outplay her in lane, instead of just watching her sitting behind her ADC and shielding their way through lane.\n\nBefore shipping, we took the deliberate approach of not over nerfing Janna considering that we were working on reshaping Ardent Censer in parallel to her kit changes. We judged that a world where both her and the item were nerfed substantially to be a worse world, and planned our changes to that. At the end of the day, we concluded that she had the potential to be strong on release, but firmly believed that when properly tuned, the direction of this new play pattern would result in a Janna that was healthier for League. In light of that, we made plans to quickly follow up based on her day one metrics if need be, which is why we&rsquo;ve pushed out our balance hotfix to her today. We&rsquo;ll also continue to be pay attention to both to her and Ardent Censer closely for the new few weeks.\n\nUltimately, with how hot of a topic Janna has been recently, you might be wondering why we didn&rsquo;t just hold off on Janna for another patch, or why we shipped her like this. To us, it felt more valuable to put a change out we were far happier with directionally than leave her in her current state for another two weeks. It&rsquo;s important to note that the extra time of internal playtesting likely wouldn&rsquo;t have resulted in a drastic increase in confidence in this changelist, especially not when compared to the millions of games we can get from around the world in a matter of hours once we go Live. So, if you&rsquo;re a Janna main (or enthusiast, or someone who just bopped her in lane), feel free to let us know what you think about her changes!\n\nThe changes that we shipped an hour and a half ago:\n\n**Base Stats**\nBase Movement Speed :: 335 >>> 320\nBase Health :: 525 >>> 500\nBase Mana :: 409.52 >>> 350\n\n**Zephyr (W)**\nCost :: 40/50/60/70/80 >>> 50/60/70/80/90","replies":[{"poster":"Shadow Blinkèr","date":"2017-09-27T21:51:18.415+0000","up_votes":29,"down_votes":4,"body":"I don't get it, why would she engage more by being squishier? Wouldn't that make her play even more passive?","replies":[{"poster":"Terozu","date":"2017-09-28T01:19:27.398+0000","up_votes":9,"down_votes":2,"body":"Not when she also has a safer range and more poke damage.","replies":[{"poster":"Serika Zero","date":"2017-09-29T09:21:34.769+0000","up_votes":9,"down_votes":4,"body":"not when she has more cooldown on her trading tool (shield).\nif she uses W she loses auto attack damage lololol\nand Q is better to be kept as a double tap spell right now.\n\nSo, she will not play more aggressive when her cooldowns are longer and she's squishier. If anything, she will play more PASSIVE. Riot' changes make janna less aggressive and less interactive and less interested in combat.\nWhich is funny, but that's the opposite of what they want.\nAnd its just a lovely proof about how stupid the balance team is.","replies":[{"poster":"Terozu","date":"2017-09-29T15:20:01.160+0000","up_votes":3,"down_votes":3,"body":"Except gameplay has proven theyre more aggressive, they dont have to W when they can auto, shield isnt a trading tool its for protection, and its called risk vs reward.  Currently the reward is higher.","replies":[{"poster":"Serika Zero","date":"2017-09-29T15:27:01.003+0000","up_votes":2,"down_votes":1,"body":"shield is a trading tool because it gives you extra auto attack damage and negates damage the enemy can do back to you.\n\nresulting in a net positive trade...\nyour extra auto attack damage at lower levels thx to this buff is lower than 10 (lv 1 shield)","replies":[{"poster":"Terozu","date":"2017-09-29T18:57:22.453+0000","up_votes":3,"down_votes":1,"body":"Id prefer using it on the adc, youre an enchanter you can take those couple of autos and hang back.  You dont need to shield yourself.  Unless your Janna adc.  In which case it should be set to self cast.","replies":[{"poster":"Serika Zero","date":"2017-09-29T19:38:02.606+0000","up_votes":3,"down_votes":2,"body":"why cast it on the adc in the first place?\n\nlike you said, you are janna.\nYou can play forward and harass the enemy every time your shield is up without taking damage.\nAnd if the enemy fancies any sort of engage, you are playing the queen of disengage.\n\nThe way to play janna in lane used to be:\nsit in a brush (usually), or in lane. And every time your shield is off cooldown, go trade with the enemy ad and support. With your adc supporting you or just farming.\nAnd you'd win every trade because extra ad and shield negating any damage on you. And because you would preferably start your trade when the enemy ad goes for a last hit.\n\nThat's how janna would play aggro in lane, even when her range was shorter than that of most adcs.\nNow your range is higher and you do a bit of extra damage per auto attacks without shielding yourself due to the new thing based on movement speed.\nBut, unlike before. Now you are going to have less of a trade window (due to E cd) than before.\nTbh, its stupid to go forward and trade with the enemy adc when they can just return the damage and even more on top of it.\n\nAnd your shield will shield for less. So, you are even less interested in taking trades.\nThat's why, every single player that actually understands janna is telling you people. These changes will make good janna player be WAY MORE PASSIVE. The polar opposite of what you want.\nThe bad ones might be a little more active, but that would be to their detriment. Until they understand that now your job is to stand behind your adc all early game long as your cd on your main trade tool (shield) is stupidly high.","replies":[]}]}]}]}]}]},{"poster":"hhaavviikk","date":"2017-09-28T06:34:27.208+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=Shadow Blinkèr,realm=EUW,application-id=A7LBtoKc,discussion-id=gikJEw03,comment-id=000c,timestamp=2017-09-27T21:51:18.415+0000)\n>\n> I don&#x27;t get it, why would she engage more by being squishier? Wouldn&#x27;t that make her play even more passive?\n\nnone of the changes made sense really, they gave her extra damage so they want her to play aggresive, but then they add 8 seconds to the shield, and since janna doesn't buy lifesteal she will lose out on any trade 100% without the shield, but with the shield being on such a long cooldown it isn't feasible to use it for harras\n\nedit; also why nerf her base ms? it's like way back when garen had 20 less armor/'mr but ''it's ok cuz his W gives armor/mr'' it makes it so the bonus isn't actually a bonus","replies":[{"poster":"Boxxy MorningWd","date":"2017-09-28T08:37:07.854+0000","up_votes":3,"down_votes":0,"body":"I think you didn't read all the changes. She does have 8% bonus MS from her passive. Her MS lvl 1 is higher than before.\nShe does have more HP at early level. She now outrange some adc and got more attack speed and damage (thanks to her passive).\n\nHer poke is clearly safer than before even without a shield. As for a trade inlane, this kit rewards active player (at the stake of taking risk) and is really intended at punishing passive shield Janna while not being punishing at all after 9. It really improve interaction with Janna on every side of the lane (ally will like your poke / presence, enemy will have more chances to outplay you).\n\nThis is clearly an Up and what a Up! Will be nerfed through.\n\nI think you misunderstand what aggressive means for an enchanter like Janna. She is not and will never be an all-in character like Leona.","replies":[{"poster":"Kloqdq","date":"2017-09-28T13:41:23.677+0000","up_votes":1,"down_votes":0,"body":"> She now outrange some adc \n\nShe is equal to about 90% of marksmans. Only Sivir and Lucian have 500-525 range. Most have 550+","replies":[{"poster":"Boxxy MorningWd","date":"2017-09-28T14:38:16.488+0000","up_votes":2,"down_votes":1,"body":"Here all ADC under 550 (even if abilities may change this state), excluding all junglers/top:\n{{champion:222}} {{champion:96}} {{champion:236}}  {{champion:15}} {{champion:498}} \n\nAnd all ADC at 550 (same as Janna):\n{{champion:42}} {{champion:119}} {{champion:81}} {{champion:202}} {{champion:429}} {{champion:21}} {{champion:29}} {{champion:18}} {{champion:67}} \n\nSaying \"Some\" isn't an understatement (3 out of 17 adc = 17.6%).\n\nI'm excluding Kindred, Graves, Quinn and Urgot on my stats for obvious reasons but we can take notes that Janna outrange all of them.\n\nEDIT : Adc with more than 550 with favourable context are :\n{{champion:22}} {{champion:51}} {{champion:222}} {{champion:29}} {{champion:18}} {{champion:96}} {{champion:110}} \nIt is 7 out of 17 = 41.1%. Not really most of them and it's even conditional for 4 of them...  (Trist passive, Kog W, Jinx Q, Twitch R)\n(Varus actually is at 575 range which is more than 550 but not that significant.)","replies":[{"poster":"Kloqdq","date":"2017-09-28T15:00:52.818+0000","up_votes":2,"down_votes":0,"body":"Even the ones who are under 550 cheat it while some means. Really Janna is just on par with everyone in bot lane's range now.","replies":[]}]}]}]}]}]},{"poster":"Raxistaicho","date":"2017-09-27T21:24:26.461+0000","up_votes":39,"down_votes":16,"body":"Jee, whodathunk that buffing Janna across the board and giving her a nerf that goes away at level 9 to compensate wasn't a smurt move.","replies":[{"poster":"Glory ln Death","date":"2017-09-27T23:12:25.798+0000","up_votes":18,"down_votes":6,"body":"People who understand that her core item was also getting a pretty decent nerf simultaneously. And, like they said, they anticipated that they would have to hit her again in a hotfix - they were waiting for it.\n\nBetter to go lighter than you think is needed and end up needing to do more than to go to far without meaning to.","replies":[]},{"poster":"TheHappyReaperz","date":"2017-09-28T03:31:43.634+0000","up_votes":4,"down_votes":1,"body":"It's like my dentist always says, it's easier to add more than needed to a tooth, then sand it down later, then to not add enough, and have to add more later.","replies":[{"poster":"I am Razgriz","date":"2017-09-28T11:53:21.723+0000","up_votes":2,"down_votes":2,"body":"Doesn't really work for League. A change had to be made regardless and a hotfix nerf or buff are the same weight. Not equivalent to adding or sanding down for a dentist.","replies":[{"poster":"TeCoolMage","date":"2017-09-29T12:15:06.485+0000","up_votes":1,"down_votes":1,"body":"Actually hotfix buffs are better than hotfix nerfs. Being OP annoys 5 of the enemy team in every single game she appears in, being UP annoys the minority who refuse to change champs for a bit. Hence needing a buff is better than needing a nerf.","replies":[{"poster":"I am Razgriz","date":"2017-09-29T14:31:03.900+0000","up_votes":2,"down_votes":0,"body":"It annoys everyone on their team as well when you pick an UP champ. It annoys everyone when you ban someone who doesn't need it or when you do ban them because they HAVE to. There's a lot more facets to this than you mentioned and they roughly equal out.","replies":[]}]}]}]}]},{"poster":"Mârty","date":"2017-09-27T21:25:56.611+0000","up_votes":26,"down_votes":10,"body":"Why not just straight up remove the part of her passive that gives allies bonus movement speed for moving towards her?\n\nIt's the most boring part of her kit, and a ton of free power that players generally don't think about. She doesn't need it, that part of her power budget should be invested into more fun parts of her kit.\n\nNow that she has a passive which gives her flat MS and bonus damage, the ally movement speed is unnecessary.","replies":[{"poster":"MileySylås","date":"2017-09-28T05:25:08.027+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=Janna Mechanics,realm=NA,application-id=A7LBtoKc,discussion-id=gikJEw03,comment-id=0009,timestamp=2017-09-27T21:25:56.611+0000)\n>\n> Why not just straight up remove the part of her passive that gives allies bonus movement speed for moving towards her?\n> \n> It&#x27;s the most boring part of her kit, and a ton of free power that players generally don&#x27;t think about. She doesn&#x27;t need it, that part of her power budget should be invested into more fun parts of her kit.\n> \n> Now that she has a passive which gives her flat MS and bonus damage, the ally movement speed is unnecessary.\n\nI always try to take advantage of this passive and it's very strong paired with the passive of Talisman of Ascension aka old Captain enchantment. \nIt feels great chasing down a lone, fleeing enemy with my team behind me as I lead because I know they cannot outrun a constant 16% movement speed buff on my team as we steadily close the gap and then I use a Zephyr to seal their fate. \nIt also adds to Janna's potential to save teammates that are trying to escape. Once I get in range of them fleeing towards me, casting a shield on them and charging up a Howling Gale, my ally can now outrun their enemies to safety to the sanctuary that is Janna. Even if I miss my Q the movement speed will still help and that's my major concern.\n\nNow if anything were to change if they removed the ally bonus speed from her passive, I would hope that they keep the ally haste somewhere on her kit. I wouldn't enjoy it if I were as swift as the wind but my teammates were terribly slow and unable to keep up with me. \nThey could make the shield also give the speed buff like Karma, but that would lessen Karma's impact on the game as a support. They could make her ult give a speed buff, but it's almost contradictory because Janna is trying to remain in place channeling a heal but also enabling her allies to run ahead and engage on the enemy, leaving her ult or flee from her enemies but still not taking advantage of the healing.\n\nI'd rather have the movement speed scaling damage on W be converted to an increased slow % for more utility because outside of lane, the bit of extra damage won't be as valuable.","replies":[]}]},{"poster":"Fütanari","date":"2017-09-27T21:11:56.514+0000","up_votes":6,"down_votes":42,"body":"So make her worse then you already made her? ok","replies":[{"poster":"PraiseTheSupp","date":"2017-09-27T21:20:06.604+0000","up_votes":28,"down_votes":1,"body":"She was better. 59% winrate.","replies":[]}]},{"poster":"Keithioapc","date":"2017-09-27T23:45:04.650+0000","up_votes":14,"down_votes":3,"body":"The move speed thing makes me sad because I considered being speedy part of Janna's identity.\n\nI've played hundreds of games of Janna, and some of my fondest memories are escaping fights at ~1 HP while enemies chase me but Janna is too speedy.","replies":[{"poster":"Xyltin","date":"2017-09-27T23:53:22.235+0000","up_votes":10,"down_votes":1,"body":"She is still speedy. You have 345.6 MS without your W which is a melee MS amount (335-355 is melee, 325-340 ranged).\n\nYou probably forgot that you now get the 8% passive MS on top of your normal MS which was not the case before 7.19.\n\nOnly later on, when you have W at rank 3+ you will actually have less MS. At rank 5 W active you have +8%, +10% and 320 base + boots instead of +17% , 335 base and boots. But also keep in mind that you only los the 10% MS now and not the full 17% you lost before. The 8% passive are permanent.","replies":[]}]},{"poster":"CS Practice","date":"2017-09-27T22:51:32.922+0000","up_votes":7,"down_votes":2,"body":"My idea with how to fix the current ardent censer meta is not to nerf every support that can abuse ardent censer, but instead to just put a cooldown on the ardent censer buff so that it can't be procced over and over  in a short period of time. Making Janna have to be more engage oriented not only changes her for the worse but it's kind of against the whole idea of Janna, a weak in combat support that has to use all of her abilities to enable others whilst staying safe. She was never meant to be front line as her entire kit is based around disengaging. Q peels W peels R peels E negates damage. The bigger problem with the nerf to Janna is that her win rate is only so substantially high because of the meta. Her win rate always shoots through the roof around worlds every year. After worlds the meta almost always shifts and creates a dynamic where she's played very rarely. The best route to take would honestly be to nerf ardent censer substantially or change the way champions can interact with shields. Karma's shield was nerfed heavily because of it's power, now Janna's shield is being nerfed cooldown wise because if it's power in conjunction with ardent censer (as well as her entire kit being perfect to abuse the item), now with her nerfs lulu and soraka (maybe even taric, because he can keep the ardent buff up forever so long as he has the mana and cdr for it) will climb to the top until they are eventually nerfed. It's unhealthy to allow one item to determine whether or not champions should be buffed. Especially sense the only reason the sustain and negate supports are so popular currently is because of how strong one item is.","replies":[{"poster":"Redesignated","date":"2017-09-28T01:25:17.206+0000","up_votes":5,"down_votes":0,"body":"They're _not_ nerfing every support that uses Ardent Censer. They specifically chose to change Janna because she needed to be interactive during laning, as opposed to having an optimal use case of never taking risks. Do I think these adjustments succeeded in that? Not really. Core problems that cause her to be hyper-passive are still there. Some neat ideas got added on to her, but she still doesn't really want to do much other than play back and avoid conflict. Having an entire kit dedicated to disengage and protection like you said lends her to that.\n\nArdent Censer meta exists because, up until this patch, it gave on-hit healing to allow ADCs to skip any form of lifesteal in their build (thus allowing streamlined attack speed + crit builds that spiked _very_ early and had low trade-off), and the other enchanter items are bad {{item:3222}}, bad to have early due to repeated nerfs {{item:3107}}, or mediocre on the majority of the roster {{item:3174}}. One aspect of that has been fixed already, but I doubt Ardent Censer will stop being a first-buy so long as its competing items give so little actual competition.\n\nArdent Censer itself is mostly fine now, you just have no reason not to be rushing it.\n\nIt's also worth remembering, Windspeaker's Blessing is getting removed soon — which is 10% Heal/Shield Power and free Armor and Magic Resistance to people you heal/shield — so further nerfs to Ardent before the Runes update hits are pretty ill-advised. Enchanters as a whole are going to lose a significant amount of power from its removal.","replies":[]}]},{"poster":"Ibuki Suika","date":"2017-09-28T03:55:40.317+0000","up_votes":6,"down_votes":1,"body":"I just dont understand why her movespeed was made below the \"minimum\". Before the boots rework years ago the slowest you made any champ ever no matter what was 300, then you took 25 speed from boots and put it on champs base speed, this made 325 the lowest movespeed. I think Janna's speed should be at that, not below it.","replies":[]},{"poster":"Vermonster","date":"2017-10-10T23:55:04.468+0000","up_votes":4,"down_votes":0,"body":"what a shit change... You gutted her movespeed so she's gonna get hit by more poke, and gutted both her health and mana while increasing the mana cost of her w.  Basically, has no ability to sustain herself in lane now.  I like how you pretend you didn't want to nerf her too hard and were being careful yet you gutted her entire laning phase immensely the same patch that you plan on reducing the mana from her starting item.  No reason to ever pick Janna over Lulu anymore since lulu and every other support received the same buff from ardent censor but no nerfs.  The movespeed nerf is ridiculous, basically just gutting the champions core for no reason.  Yea she gets fast end game but all she does is disengage, shield and heal, that movespeed was part of her core build for a reason.  Her early game is so weak now its ridiculous.  Her e cd is already ungodly long, you basically just lose lane now if your opponents are even the slightest bit competent in laning phase.  \n\nI waited a few days to post this to make sure I was seeing the same thing with her game to game.  As soon as Ardent Censor gets nerfed Janna will be gone from the game thanks to Riots inability to balance. {{item:3070}} {{champion:40}}","replies":[]},{"poster":"BloodyVampir","date":"2017-09-28T05:43:04.335+0000","up_votes":4,"down_votes":0,"body":"Please give her the movement speed back. You are just destroying her core identity with this nerf and its unnecessary because you just stole Jannas uniqueness imo.\nIt always felt nice to be the fastest champ on the rift whivh actually played a big part in Jannas role.\n\nPS: Fix her Star Guardian face splash ingame","replies":[]},{"poster":"Sheldons","date":"2017-09-28T04:00:26.691+0000","up_votes":5,"down_votes":1,"body":"this is enraging. I really noticed the movespeed change before reading this hotfix, i was like \"what the fuck why am i SO SLOW.\"\n\nthis is actually aggravating because jannas identity is being a speedy support who can outrun an ally so you can shield them.\nNow as your ally is chasing a kill you are so fucking slow and will only catch up to shield if they stop to fight.","replies":[]},{"poster":"Xyltin","date":"2017-09-27T23:59:46.698+0000","up_votes":1,"down_votes":2,"body":"Any plans for Ardent?\n\nAfter a day I would expect you also seeing that it was not a nerf (probably not a buff either), but mostly a neutral change. A good one, shifting more power towards the support, but still too strong, especially in the early game. How about going down to 18-35% AS/On hit dmg and 50 AP\n\nAnother option would be 13.75 - 35% AS/on hit dmg (12.5 + 1.25 x lvl). At lvl 6 (the earliest you get this item) it would be at 20 instead of 24, which is a decent nerf but not a too large one.\n\nA small tip for people after the Janna nerf: Taric with Ardent. People talked about Lulu now having the buff or Janna or speedy bananas, but Tarics passive, Q CD and constant AAing can be pretty annoying.\n\nLulu and Karma seem to be the only 2 champs that suffered from the Ardent change (a bit strange, but makes sense for Lulu, she gives her passive towards the ADC anyways and Karma, as nice as her AA CDR is, it probably is too risky in most cases and not too impactful).","replies":[{"poster":"Redesignated","date":"2017-09-28T01:12:23.797+0000","up_votes":6,"down_votes":2,"body":"Don't hit the AP on Ardent, it's one of _two_ items enchanters get any access to that provides it, and why aggressive enchanters have any viability. The other aggressive option {{item:3174}} isn't even good on the vast majority of aggressive enchanters that would otherwise consider it.\n\nChanges have not been out long enough to just go \"oh, Ardent's still too strong, nerf it.\"The problem people had with Ardent before this patch was how it hardlocked ADC builds into crit + attack speed and enabled them to skip a lifesteal item for survivability, which made ADCs that had difficulty using those builds worse. The on-hit healing is gone. It still synergizes heavily with attack speed, but it no longer allows ADCs to just sustain off of minion waves infinitely through every trade that doesn't kill them.\n\nIf Ardent is somehow _still_ too strong (which I doubt), adjust the scaling factors so they're not as high early on and maybe throw an extra 25% mana regen at it, or just give enchanters an actual reason to consider getting {{item:3107}} {{item:3222}} {{item:3174}} first again so it's not the de facto choice. Redemption's been nerfed hard and given a weird amplified scaling so it's bad unless you already have Forbidden Idol upgrades, and Mikael's is just trash on everybody not named Soraka. You never have a reason _not_ to get Ardent Censer first because your other options are just bad to have early, if not in general.\n\n**Edit** And on the note of enchanters as a group, Windspeaker's Blessing is getting toasted with the Runes update — which means you're losing an overall 10% Heal/Shield Power and the bonus Armor and Magic Resistance to heals/shields. The entire class is getting nerfed soon, I'd rather we not undertune more of their items than we already have.","replies":[]}]},{"poster":"vhearts","date":"2017-09-27T21:04:33.142+0000","up_votes":3,"down_votes":21,"body":"uh... how about telling us what the hotfix was.","replies":[{"poster":"Abyssphere","date":"2017-09-27T21:28:37.762+0000","up_votes":9,"down_votes":0,"body":"It's right there.","replies":[]}]},{"poster":"kpxjt093Rj","date":"2017-10-11T00:23:45.472+0000","up_votes":3,"down_votes":0,"body":"i don't  understand you want Janna to play aggressive  but you lower her base health, mana and damage and  increased mana cost\nhow to be more aggressive with this changes I don't understand.... like u lower her base health so she can be stronger ?","replies":[]},{"poster":"nınth","date":"2017-10-10T20:13:19.167+0000","up_votes":3,"down_votes":0,"body":"The tailwind passive damage nerf is just too much. You want Janna to play aggressive, but you've lowered her base health, base mana, and damage -- then increased her mana costs. Come on, now. I'd love for Janna to be more than a shield'n peel drivethru, but you can't say one thing and then do the exact opposite. As it stands, she won't be drafted over Lulu.","replies":[]},{"poster":"Emestie","date":"2017-09-28T05:07:54.182+0000","up_votes":4,"down_votes":1,"body":"Why to nerf her MS when it's her identity? It's how nerf Soraka's heal... oh wait.\n\nAA power is a thing now. This is what should be hotfixed not MS. Janna is supposed to be safe we don't need another 320ms Soraka.","replies":[]},{"poster":"Schwarzi1","date":"2017-09-30T21:50:25.713+0000","up_votes":2,"down_votes":0,"body":"Janna is useless until 6 now.{{champion:32}} {{item:3070}}","replies":[]},{"poster":"SirPurrr","date":"2017-09-29T02:43:44.801+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Maple Nectar,realm=NA,application-id=A7LBtoKc,discussion-id=gikJEw03,comment-id=,timestamp=2017-09-27T20:35:41.741+0000)\n>\n> Hey folks!\n> \n> As you&amp;rsquo;re reading this, we just finished deploying a balance hotfix for Janna as follow-up on our changes to her on 7.19. The goals for the initial changelist were pretty simple, if a Janna wants to win lane, she has to interact and engage with her lane opponents in ways she didn&amp;rsquo;t have to before. We wanted to make playing as Janna feel more rewarding when played well while giving her opponents the opportunity to actually outplay her in lane, instead of just watching her sitting behind her ADC and shielding their way through lane.\n> \n> Before shipping, we took the deliberate approach of not over nerfing Janna considering that we were working on reshaping Ardent Censer in parallel to her kit changes. We judged that a world where both her and the item were nerfed substantially to be a worse world, and planned our changes to that. At the end of the day, we concluded that she had the potential to be strong on release, but firmly believed that when properly tuned, the direction of this new play pattern would result in a Janna that was healthier for League. In light of that, we made plans to quickly follow up based on her day one metrics if need be, which is why we&amp;rsquo;ve pushed out our balance hotfix to her today. We&amp;rsquo;ll also continue to be pay attention to both to her and Ardent Censer closely for the new few weeks.\n> \n> Ultimately, with how hot of a topic Janna has been recently, you might be wondering why we didn&amp;rsquo;t just hold off on Janna for another patch, or why we shipped her like this. To us, it felt more valuable to put a change out we were far happier with directionally than leave her in her current state for another two weeks. It&amp;rsquo;s important to note that the extra time of internal playtesting likely wouldn&amp;rsquo;t have resulted in a drastic increase in confidence in this changelist, especially not when compared to the millions of games we can get from around the world in a matter of hours once we go Live. So, if you&amp;rsquo;re a Janna main (or enthusiast, or someone who just bopped her in lane), feel free to let us know what you think about her changes!\n> \n> The changes that we shipped an hour and a half ago:\n> \n> **Base Stats**\n> Base Movement Speed :: 335 &gt;&gt;&gt; 320\n> Base Health :: 525 &gt;&gt;&gt; 500\n> Base Mana :: 409.52 &gt;&gt;&gt; 350\n> \n> **Zephyr (W)**\n> Cost :: 40/50/60/70/80 &gt;&gt;&gt; 50/60/70/80/90\n\nGive me back my AP Kog. It's why I purchased the champion. I wanted one truly godly late game poke mage. He has so much counterplay via split pushing, engages, dodging, shields, heals, stealth assassinations etc. Why was he gutted after being viable as AP for so many seasons. I want AP Kog FULLY supported for every ELO bracket like he deserves to be. He has a completely different playstyle and attracts different players than AD Kog. He's not a gimmick like AP trist was. His whole kit has AP ratios and makes sense with AP. I don't even care if his winrate isn't good since he's actually difficult to play well but it feels like he's not even good for people who put a ton of work into him. AP Kog was supposed to be the late game terror of the rift with godly poke + burst late. Idk what you need to do but that .2 AP E nerf was total BS... in the same patch as the Rylai's nerf too. He wasn't even played competitively at that point and nor was he picked or banned almost at all in ranked. I'm really annoyed by this. I purchased Kog SOLELY because I loved his AP playstyle. At least with shit like trist she's still somewhat similar in how her kit works but my champion was basically deleted.\n\n\nAP Kog late was the ONLY surgical poke champion with solid DPS vs tanks due to W, fantastic burst if he can get picks and decent poke from a crazy range (the most fun and difficult aspect of the champion). Ziggs and Xerath are just not for the same thing. Xerath has conditional crazy range but no DPS vs tanks. Ziggs has pretty bad range relative to both since his Q almost never hits if it bounces more than once and even in that case, it would just be blocked by tanks. His late game is alright but nothing special. He's just very different and also a champion I enjoy. No one does what AP kog did and AP kog himself now doesn't seem to do enough late game for how easy he is to shut down early, dive, etc. He's only really decent if you have a ton of CC to get them lower and keep abilities chained on them. For example, if you have a malphite who can ult. and then you clean up, that works fine assuming the game is somewhat even. \n\nAgain, if you do not want to support AP kog exactly as his kit is now, think of ways it can work while keeping those late game fantasy elements fully alive. Just never nerf his range/ability to chain ult. and damage. His ult. is already nothing like what it used to be. This is the reason I like the champion. Hell, I'll even take a hit somewhere else to make this ability as strong as possible. For example, perhaps its AP ratio can be weaker at 6 and then grow at 11, 16.","replies":[]},{"poster":"Newerthian","date":"2017-09-27T21:43:13.186+0000","up_votes":3,"down_votes":1,"body":"Completely out of context but I'm curious as to how maple nectar would taste like.","replies":[{"poster":"Soludea","date":"2017-09-27T22:53:20.643+0000","up_votes":2,"down_votes":0,"body":"Really sweet, it is after all, sugar... In a different form.","replies":[]}]},{"poster":"Neyfthys","date":"2017-09-29T12:52:40.397+0000","up_votes":4,"down_votes":2,"body":"Janna was my main. but i think they changed her  to a whole new character , and i dont like her game play now. probably need to find a new main champion now\n\nfor me janna was all about being best peeler / defender- yes that might mean that some of her game play felt a bit boring , but oh man when enemy charges at you there was no one better than janna to save your assss :P so i was picking her when i saw enemy was choosing charging all in champions  and good peel was needed.\n\nNow jana is made into poking champion like sona , meeh , in that case id rather have sona with faster and easier poke \n\n sorry just my opinion\n I think we should have more varierty in champions  and if some are a bit passive in lane let them be so , you take which one u need to counter ur lane \nsome are pokers , some are damage , some are cc , some are peelers - dont really need all to be doing same thing ()","replies":[]},{"poster":"WorthlessSupport","date":"2017-09-28T17:25:51.856+0000","up_votes":4,"down_votes":2,"body":"I dont feel like Janna even needed those hot fixes.\n\nI play in D1 and people still dont even try to punish her E CD and dont even try trading at all.\n\nI won lanes 1v2 vs Janna with my ADC being pretty much afk farming.\n\nYou guys should put up a loading tip stating that Janna E has a huge ass CD and watch her winrate drop.","replies":[]},{"poster":"Pheor","date":"2017-09-28T06:39:42.378+0000","up_votes":4,"down_votes":2,"body":"Janna is not supposed to be played as a champ who jumps in and engages. Thats why you have leona.\nId rather see ardent censer be removed from the game altogether rather than see these nurfs on Janna. \n\n\nShe was my support main. Not playing her anymore. \n\ncheers","replies":[]},{"poster":"I INT ON HERE XD","date":"2017-09-28T05:40:50.180+0000","up_votes":4,"down_votes":2,"body":"Filthy Janna main here to say: As long as the items I use aren't nerfed (ardent, redemption, locket), Janna won't be nerfed. Janna is a slave to their adc, so nerfing Janna stats and not stats that are applied to their adc/team is meaningless (in my opinion)","replies":[]},{"poster":"Lucifer","date":"2017-09-27T22:20:11.591+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Maple Nectar,realm=NA,application-id=A7LBtoKc,discussion-id=gikJEw03,comment-id=,timestamp=2017-09-27T20:35:41.741+0000)\n>\n> Hey folks!\n> \n> As you&amp;rsquo;re reading this, we just finished deploying a balance hotfix for Janna as follow-up on our changes to her on 7.19. The goals for the initial changelist were pretty simple, if a Janna wants to win lane, she has to interact and engage with her lane opponents in ways she didn&amp;rsquo;t have to before. We wanted to make playing as Janna feel more rewarding when played well while giving her opponents the opportunity to actually outplay her in lane, instead of just watching her sitting behind her ADC and shielding their way through lane.\n> \n> Before shipping, we took the deliberate approach of not over nerfing Janna considering that we were working on reshaping Ardent Censer in parallel to her kit changes. We judged that a world where both her and the item were nerfed substantially to be a worse world, and planned our changes to that. At the end of the day, we concluded that she had the potential to be strong on release, but firmly believed that when properly tuned, the direction of this new play pattern would result in a Janna that was healthier for League. In light of that, we made plans to quickly follow up based on her day one metrics if need be, which is why we&amp;rsquo;ve pushed out our balance hotfix to her today. We&amp;rsquo;ll also continue to be pay attention to both to her and Ardent Censer closely for the new few weeks.\n> \n> Ultimately, with how hot of a topic Janna has been recently, you might be wondering why we didn&amp;rsquo;t just hold off on Janna for another patch, or why we shipped her like this. To us, it felt more valuable to put a change out we were far happier with directionally than leave her in her current state for another two weeks. It&amp;rsquo;s important to note that the extra time of internal playtesting likely wouldn&amp;rsquo;t have resulted in a drastic increase in confidence in this changelist, especially not when compared to the millions of games we can get from around the world in a matter of hours once we go Live. So, if you&amp;rsquo;re a Janna main (or enthusiast, or someone who just bopped her in lane), feel free to let us know what you think about her changes!\n> \n> The changes that we shipped an hour and a half ago:\n> \n> **Base Stats**\n> Base Movement Speed :: 335 &gt;&gt;&gt; 320\n> Base Health :: 525 &gt;&gt;&gt; 500\n> Base Mana :: 409.52 &gt;&gt;&gt; 350\n> \n> **Zephyr (W)**\n> Cost :: 40/50/60/70/80 &gt;&gt;&gt; 50/60/70/80/90\n\nAgree with Janna Mechanics. Seems weird you keep hitting her damage (by nerfing her MS again, you're now nerfing her damage and her \"shtick\" of being the \"fast\" champion) when the main issue seems to be her passive combined with Ancient Coin.  It's granting Janna's allies ~20% bonus move speed for Janna just existing. That is a ridiculous amount of invisible power that should be allocated elsewhere. I'd like this power budget to be allocated to her offensive or playmaking parts of her kit.  Coin in general is still way too strong in comparison to frost queen's and relic shield. Far better rewards (more gold, better passive) for far less risk. I'd suggest talking with some high elo support mains at Riot like Jinxylord to get an idea on how best to approach coin going forward. \n\nI'd like to see Janna's shield duration looked at as well (and perhaps every shield support). A shorter length shield better rewards a well timed shield. It might be also worth nerfing her late game shield length. Something like 16-15-14-13-12 might be more appropriate for her shield CD, so that Janna still does need to make meaningful shield decisions late game. With 45% CDR, shield has effectively no cooldown late game. That's a huge part of her problem, to be honest. \n\nI'd also caution over-nerfing her right away. People need time to figure out that Janna needs to be punished early game now, where she is exceedingly weaker in lane. \n\nI also do think that having dialogue with the community would be good... You were pretty much silent until now about the Janna changes, and there was a lot of useful feedback that could have been collected from Janna mains on how to best approach her.","replies":[]},{"poster":"Rework Quinn","date":"2017-09-27T22:04:57.559+0000","up_votes":8,"down_votes":6,"body":"{{sticker:sg-janna}}","replies":[]},{"poster":"TeCoolMage","date":"2017-09-29T12:33:25.041+0000","up_votes":2,"down_votes":1,"body":"To people complaining about Janna being aggressive now, not about being passive or being aggressive, it's about lane interaction and engaging.\n\nShe can't play aggressively now simply by Eing the ADC whenever it's up as they auto attack and then throwing in a few autos herself, and she can't play passive by instant Qing everything and Eing all damage. Now she can play passively by setting up good Qs and only taking trades when there's a clear advantage while holding onto her abilities when the enemy has big spells off cooldown, and play aggressive by choosing to use all her abilities to really set up a good Q, chase them down with W, give the ADC damage with E, and so on.\n\nRiot misjudged the changes thinking that making Janna more difficult would in turn make her weak, but when they increased the reward she got for playing well it was clear they overcompensated.\n\nFor people who still don't understand: look at 'passive' late game mages in mid lane. Against a melee matchup, or when an equal range ability is on cooldown they still take opportunities to auto and harass, and even use their disengage CC to engage and combo. Passive is not braindead negation, it's responding to the enemy rather than trying to elicit a response, and Janna has always been capable of both.\n\ntangent: It annoys me how some enchanter mains believe it's a divine right to ensure all lane interaction and influence they have is put on the shoulders of the ADC (and in exchange they deal with the more 'subtle' things like timing when they press their buff button), then complain that if their ADC is not good they lose. That's not passive play, that's just being annoying.","replies":[]},{"poster":"Support Position","date":"2017-09-29T01:23:08.416+0000","up_votes":2,"down_votes":1,"body":"Her E is what need nerfs. Reduce the damn shield already, its even worse than before -.- the damn champ just needs a full scale rework tbh. Her shield is WAY too overpowered and \"that's the only good thing about her kit\" time to make that the worst thing about her kit. Rework her. Thanks.","replies":[]},{"poster":"Solidair3","date":"2017-09-28T15:02:58.848+0000","up_votes":2,"down_votes":1,"body":"I think the base MS is uncalled for, fine with the other changes, though.","replies":[]}]}