{"poster":"Mãge","date":"2014-10-15T00:03:44.915+0000","title":"Hi, I'm Cardi! And I have a TON of ideas (new champion suggestion)","subforum":"Concepts & Creations","up_votes":6,"down_votes":3,"body":"**Hi everyone! **First I think I'll do a small introduction because I'd like to get acquainted with you (yes you there, fellow player), on League if we're not already friends as a small token of gratitude for your taking the time to read this. I'm Cardi, I'm 18, live all the way on the east coast of the U.S. in NYC, and I'm a full-time League of Legends player (for the most part ><), because I love the game a ton! Well, actually, it's also because I study full-time on my own, and I absolutely love games! Whether it's paper and pencil games in my first and second grade after-school study programs, new forms of tag and hide-and-seek at the park with my elementary school peers, a real-life imitation of an MMO in middle school or some variation of commonly enjoyed card games on the train with friends during high school, I've always enjoyed creating new forms of play with everyone around me. I love games, and I've been playing them my entire life. And ever since I got into League of Legends, I've been inspired by the game design approaches of the designers at Riot, the whole transparency with patch notes, balance points, and reasons behind changes - all of it. I can't help but draw new ideas from inspiration, and I'd hate for my work to be kept in secret, so I'll be posting my new champion ideas and rework ideas over time starting today. I hope you'll enjoy at the very least some of them in the process! Let's get started~\r\n\r\nFor this idea,I was inspired by my favorite champion in the League, Leblanc, when designing this champion. I hope you like it (and I hope you don't think the name is corny c;).\r\n\r\n**-Incblane, the impostor**\r\n\r\nSo for starters, I imagine Incblane to be this champion who wields a staff, similar to Leblanc, but uses it in a completely different way. Instead of casting sigils from his staff, he strikes his opponents directly with cursed magic. In other words, he has somewhat a Kayle-esque feel to him while in combat against other champions (when he uses his Q, for example), but retains the kind of physique and magic you'd expect from a caster most of the time (his basic attacks are projectiles).\r\n\r\n**-Executor (Passive):** Incblane's attacks against targets with less than 12% health deal 10% of the target's maximum health as bonus true damage. Does not affect jungle monsters.\r\n\r\nNow, this passive is useful for guaranteeing a finish on targets with low health. There isn't a lot of diversity to it, but it can be countered by shields and heals. It's just a little boost for Incblane to finish off his targets, since he is an assassin.\r\n\r\n**-Reemergence (Q):** Incblane vanishes in a puff of smoke, becoming for a brief duration (moving into range of true sight or dealing damage will reveal him early). When he reappears, his next basic attack within one second (becomes a non-projectile swing) deals bonus magic damage.\r\n\r\nCooldown: 6 seconds\r\nInvisibility duration: 0.9/1.0/1.1/1.2/1.3 seconds\r\nMagic damage: 95/130/165/200/235 + 0.7 AP\r\n\r\nThis ability is the bread and butter combat ability of his kit. He can rush into trades unseen by the enemy before unleashing a powerful magical hit on his opponent, but can also use it to trick enemies or make a deceptive escape. The one second limit on his attack allows enemies to kite him to avoid his damage and acts as a form of counter play against his otherwise high damage, unavoidable attack.\r\n\r\n**-Illusory spike (W):** Incblane summons a cursed sword at the target location after a 0.75-second delay, dealing magic damage upon arrival in a small radius. Then, the sword remains for six seconds and increases magic damage taken by targets within its radius (slightly larger than the first). Re-activating this ability when the sword is active will destroy the sword and teleport Incblane to the sword's location. The sword's duration is refreshed each time it's moved, and this ability's cooldown begins when the sword is destroyed.\r\n\r\nCooldown: 14/13/12/11/10 seconds\r\nSword health: 100/150/200/250/300 + 0.6 AP\r\nMagic damage: 50/85/120/155/190 + 0.6 AP\r\nMagic damage increase: 12/15/18/21/24%\r\n\r\nNow this ability is more interesting. It's a sword that has health and the potential to block anything a minon can block, all while dealing damage and offering team-wide utility. However, it can be dodged because of the delay, and doesn't increase damage unless the enemy stays within it. Since it also acts as Incblane's escape mechanic, a team can respond by first destroying his sword or re-locating it (in the case of syndra or other champions with knockbacks) in order to limit his escape options. In the end, it's an all-useful ability with a lot of counterplay potential both for Incblane against his opponents, and Incblane's opponents against him.\r\n\r\n**-Ghastly Chains (E):** Incblane sends forth a very limited-range chain that latches onto the first unit it hits, dealing magic damage over time if the unit is an enemy champion (cooldown begins upon casting the chain). If the unit remains within the short range of the chain for 2 seconds, the chain locks, triples in its tether range, reveals the unit chained (even if stealthed), and lasts indefinitely. Incblane can re-activate ghastly chains when it is locked onto a unit to pull it towards him.\r\n\r\nCooldown: 12/11/10/9/8 seconds\r\nMagic damage over 2 seconds: 100/150/200/250/300 + 1.0 AP\r\n\r\nThis ability is super unique - it can hit stealth wards. It also lasts indefinitely, so Incblane can keep it latched onto his sword or an allied minion to block abilities. It also lets him pull enemies toward him when they are just about to escape, even from a very long range, given he can keep them within the short range of the ability long enough for it to lock onto his target. That means there is a huge incentive for his opponents to get OUT of the range of this ability, because it deals massive damage over time and pretty much guarantees your death (super long-range Blitzcrank pull anyone?).\r\n\r\nNOW FOR MY FAVORITE. BE WARNED - this ability is text-heavy.\r\n\r\n**-Impersonate (R) Range: 500**\r\n**Passive:** Every ten seconds, Incblane gains bonus true damage on his next attack that quadruples if he is within 150-range of his target.\r\n**Active: **Incblane stealths himself and the target champion for one second. He can re-activate this ability within the one second to switch places with his target (or he can decide not to). When both targets are revealed (if one is revealed, the other is as well) he takes the form of the enemy champion for eight seconds. While he is disguised as the enemy champion, both he and the champion he copied can be targeted by both teams (and their structures), and neither champion is able to grant vision (by wards or champion placement) to their team or recall. Attacking, using items, or using any ability while disguised will end this ability's effects early. (Killing allied champions affected by impersonate will grant gold to the enemy Incblane).\r\n\r\nPassive true damage bonus: 30/50/70 + 0.1 AP\r\n\r\nNow THIS is the definition of the impostor. Incblane has every incentive to close the distance to his targets, and every tool in his kit to achieve that. Incblane's ultimate can act like a mini-urgot ult because of its short range, but turns him into the champion he chooses to switch (or not switch) with. Both champions then have equal oppotunity to be targeted by both teams, making it super confusing in the right situations. And the rest, I'll leave up to your imagination. What can YOU accomplish when you're disguised as the enemy team?\r\n\r\nThanks for reading! Be sure to leave me a comment or two and tell me what you think if you liked this! :^)\r\n\r\nYours Truly,\r\nCardi","replies":[{"poster":"Reslust","date":"2014-10-15T00:19:57.143+0000","up_votes":3,"down_votes":0,"body":"He seems kind of over powered. His passive should build off of his attack damage and enemy max health.","replies":[{"poster":"Mãge","date":"2014-10-15T00:27:26.281+0000","up_votes":2,"down_votes":0,"body":"> He seems kind of over powered. His passive should build off of his attack damage and enemy max health.\n\nNumbers can always be tweaked ^~^","replies":[]}]},{"poster":"JedenVojak","date":"2014-10-15T05:04:29.381+0000","up_votes":2,"down_votes":0,"body":"Passive - His passive should not be true damage, should not be % of max health, current health maybe, not max, and it needs to have a cooldown. This is literally, \"If you go to 12% health, you die in one auto attack\". That's a no no.\n\nQ - I'm not sure if the invisibility on this lasts long enough, but stealthing and bopping your enemy with your staff is kinda cool.\n\nW - A post that blocks shots and ups magic damage vs the target, while also doing damage. This skill does too much, pick 2 of those things, throw out the other.\n\nE - This is very much like Karma's tether except it lasts forever. No.\n\nR - This ability is actually really spiffy; the active is quite tricksy and powerful. The passive needs to go - or at the very least, it should be magical damage, and the number should only be * 2 in melee range.","replies":[]},{"poster":"MrBuffington","date":"2014-10-15T02:04:19.209+0000","up_votes":2,"down_votes":0,"body":"Hi Cardi! I think you have some great ideas here, I would suggest also in the future looking into [Sir ArmaMalum's Concept Contests and the MCCC](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/sitp98cg-ccc-reminder-october-ccc-and-mccc), both are champion concept contests that run monthly. Unfortunately I don't believe either contest is still accepting submissions for this month, but from what I understand, contests run about every month and can be a great way of exploring new concepts for inspiration as well as getting connected with fellow concept creators.\n\nCheers!","replies":[{"poster":"Mãge","date":"2014-10-15T04:15:05.143+0000","up_votes":1,"down_votes":0,"body":"> Hi Cardi! I think you have some great ideas here, I would suggest also in the future looking into [Sir ArmaMalum's Concept Contests and the MCCC](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/sitp98cg-ccc-reminder-october-ccc-and-mccc), both are champion concept contests that run monthly. Unfortunately I don't believe either contest is still accepting submissions for this month, but from what I understand, contests run about every month and can be a great way of exploring new concepts for inspiration as well as getting connected with fellow concept creators.\n> \n> Cheers!\n\nThanks!","replies":[]}]},{"poster":"Rito Jericho","date":"2014-12-31T03:59:23.245+0000","up_votes":1,"down_votes":0,"body":"He DOES seem rather over-powered. I mean, between his passive and his ult, that is quite a bit of True Damage. His kit seems okay in my opinion, but you may want to double-check a couple things. I'm not ENTIRELY sure, but I think you may have actually missed a word or two somewhere (**** this miserable excuse that I have to call a \"memory\"). Also, I'm honestly just not to sure about his ult in general. Being able to be attacked by BOTH teams? It just seems to be way to risky for my taste. But, I'm not exactly the best to give this complaint seeing as I'm somewhat of a defensive player most of the time (even when I play ADC. I know, I'm an idiot in that case. You don't have to say it).\n\nAnyway, if you'd be so kind, I'd like you to check out one of my own champion ideas and maybe provide feedback. Gaius the Rogue General (though due to a typo I'd made when I first posted him, the discussion labels him as the \"Rouge General\").","replies":[]},{"poster":"Dylanor","date":"2014-12-30T22:07:35.801+0000","up_votes":1,"down_votes":0,"body":"Could i post a link to this champion on my page?","replies":[]}]}