{"poster":"Yukî","date":"2016-12-26T01:28:01.945+0000","title":"Servidor de LAS en puro mal funcionamiento.","subforum":"Problemas Técnicos","up_votes":2,"down_votes":1,"body":"No puedo creer la cantidad de veces que ha dejado de funcionar la selecci&oacute;n de campeones por un supuesto &quot;Error de conexi&oacute;n&quot; Mi &uacute;ltima partida, todos mis compa&ntilde;eros (incluyendome) ten&iacute;an lag, arriba de 200 ms. No soporto que nadie haga una mierda con nuestro servidor. Esto puede presentar m&aacute;s de una queja, yo s&oacute;lo hablo como usuario pero me estoy cansando, tengo bastante paciencia, pero s&eacute; que muchas otras personas no.","replies":[{"poster":"Yukî","date":"2016-12-26T03:36:28.580+0000","up_votes":1,"down_votes":0,"body":"No lo dijiera si pasara por mi wi-fi o por mi pc, pero es que... ¿tan idiota se puede ser? Si lo digo es porque son errores que antes no estaban en el lol, que ahora joden más que nunca. Mucha mierda en las que llena al foro.","replies":[]},{"poster":"DeiiiVidcraCK","date":"2016-12-26T01:41:07.379+0000","up_votes":1,"down_votes":0,"body":"puede ser el cliente que usas\na mi el alfa me anda lag en la selección y me elije cualquier cosa como si fuera al azar por eso juego la de legado y tambien si tenes poca señal (muchos ms) puede ser tanto tu wifi como tu pais ya que el sv esta en chile de ultima tu pc es una mierda como la mia conseguí trabajo y comprate algo desente","replies":[{"poster":"Yukî","date":"2016-12-26T03:34:53.309+0000","up_votes":1,"down_votes":0,"body":"¿Que mi pc es una mierda? Tal vez no me quejaría si tuviera una pc de mierda, pero lamento decirte que pareces retrasado mental sin saber de lo que hablas. El lol me corre a 120 fps y siempre tengo 30 ms, y me quejo cuando algo no está bien, que el lol pasa de siempre andar a 30 ms a todos tener lag en mis últimas partidas y que ande para el culo el cliente del legado que siempre usé y nunca falló de esta forma es intolerable. A idiotas como vos es que no se les puede explicar.","replies":[]}]},{"poster":"ZperKS","date":"2016-12-26T01:39:54.984+0000","up_votes":1,"down_votes":0,"body":"Te pensas que les importa? lamentablemente no","replies":[]}]}