{"poster":"Ghost Shadow26","date":"2016-03-13T03:23:50.230+0000","title":"¿Cuando Sale el 6.6?","subforum":"Charlas Generales","up_votes":1,"down_votes":4,"body":"Buenas Invocadores/as, quisiera preguntarles cuando sale el Parche 6.6 de LOL, es que la 6.5 me vino llena de Bug, ahora ya ni puedo jugar se queda tildado en escaneando archivos (1) y de ah&iacute; no pasa y despu&eacute;s de un rato se cierra y me sale el BugSplat.\r\n\r\nAlgo parecido me paso en la 6.2 que no me deja entrar en el juego, despu&eacute;s de darle al Ejecutar se quedaba en negro y no me dejaba entrar en Sesi&oacute;n, Lo raro con esta es que si pude jugar despu&eacute;s de actualizar al 6.5 pero al d&iacute;a siguiente (el Jueves) se quedo tildado en escaneando archivos y no puedo jugar mas, me gustar&iacute;a que arreglasen eso de los parches, que &uacute;ltimamente sale mal o se bugean despu&eacute;s de salir y la verdad que cansa, uno no puede jugar todo el d&iacute;a y cuando se hace un tiempo para jugar no te deja. \r\n\r\nAdemas de cuando jugas te tocan Troll u Flammers que te tiran la partida, a los AFK los entiendo puede que se le fue la luz/Internet, se le muri&oacute; el perro o algo, pero los flammers (HASTA JUGANDO CON BOTS) te bardean como si fuera la ultima partida de sus vidas, como si fueran challenger y son nivel 10, por que ven al Barba o Coolifegame (entre otros) se creen  profesionales...\r\n\r\nMe fui del tema... perd&oacute;n lo principal que quiero saber es cuando sale la 6.6 \r\n\r\nGracias! {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Lemon Roots ","date":"2016-03-13T03:33:23.716+0000","up_votes":2,"down_votes":0,"body":"Una buena solución seria reinstalar el lol, y si al hacerlo no resuelve tus problemas, te recomiendo que le mandes un ticket al soporte para ver en que te pueden ayudar.\nRespecto al parche 6.6, Saldría de acá en 2 semanas o 3(raras veces ocurre), y como de costumbre, la actualización podría ser el Miércoles o Jueves.","replies":[{"poster":"Ghost Shadow26","date":"2016-03-13T03:42:54.917+0000","up_votes":1,"down_votes":0,"body":"Si, pero vi que muchos tenian ese error, y aunque lo reinstalasen no se solucionaba, pero lo raro es que si se hubiera dañado post actualizacion no me habria dejado jugar pero si jugue.\nAdemas descargarlo de vuelta me jode demasiado todo el dia solo para descargar la base, despues con la actualizaciones uff olvidate xD","replies":[{"poster":"Antaloor","date":"2016-03-13T03:54:43.674+0000","up_votes":1,"down_votes":0,"body":"Tambien podrias pasar el Ccleaner para hacer una limpieza, yo lo reinstale y seguia el error pase el ccleaner y el error se fue. Luego cuentame si te funcionó :) saludos","replies":[]}]}]},{"poster":"skysoul fenrir","date":"2016-03-13T03:44:24.684+0000","up_votes":1,"down_votes":0,"body":"ojala en el parche que viene ademas de agregar al tio aurelio le den un rework o buff a los champ que ya estan olvidados :v","replies":[{"poster":"danye15000","date":"2016-03-13T05:27:04.823+0000","up_votes":1,"down_votes":0,"body":"{{champion:3}} {{champion:113}} {{champion:8}} ? no se a estos hace tiempo no los veo {{sticker:zombie-nunu-bummed}}","replies":[]}]},{"poster":"lucpro","date":"2016-03-13T04:48:49.251+0000","up_votes":1,"down_votes":0,"body":"salen en 2 semanas mas o 3 como siempre aurelion sol capas que salga en el parche 6.7 :V","replies":[]},{"poster":"Pablove90","date":"2016-03-13T04:21:32.528+0000","up_votes":1,"down_votes":0,"body":"♦ Ejecutalo en modo administrador\n♦ Revisa el antivirus si no se chorio algun archivo que a algunos le paso\n♦ Proba borrar el ultimo parche (SOLO EL ULTIMO) y lo vuelve a descargar solo (busca en youtube)\n♦ Pi tampoco sirve busca en youtube que un tutorial te dice de borrar unos archivos y algunoos les sirvio (paso parecido al anterior pero no es)\n\nexperimenta antes de borrar completamente el game \nhacete amigo de google y youtube","replies":[]}]}