{"poster":"Ghost Shadow26","date":"2016-04-19T17:58:18.616+0000","title":"Propongo un \"Nuevo Cooperativo Vs IA\"","subforum":"Charlas Generales","up_votes":2,"down_votes":4,"body":"_**Buenas Invocadores:**_ {{champion:51}} \n\nDe que va el post?, Simple: **que pongan una nueva dificultad a los bots**. a que me refiero:\n\nCuando jugamos cooperativo contra los bots, es relativamente facil, o sea, cuando ya le bajas la vida al bot este se va bajo torre o backea aunque tengas igual o menor vida que el, y siempre **SIEMPRE**!, backean en el mismo lugar y es mas facil de matar que el cangrejo de JG {{champion:36}}\n\nPropongo: Bot (Dificil): Los bots te persiguen por todo el mapa y si estas bajo de vida aunque estes bajo torre entren y te maten, tengan maestrias, que haya un JG que gankee, etc. como si estuvieras jugando contra personas de verdad, por que salir de intermedio y querer jugar PVP es una diferencia **ABISMAL**, nada que ver. asi no te comes insultos y agravios de tus compa&ntilde;eros.\n\nBueno, eso era todo (este post va mas que nada para los que recien empiezan, asi no tiene que sufrir aprendiendo a jugar), me gustaria leer que piensan al respecto ^^\n\n**Saludos!**{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Misery Business","date":"2016-04-19T18:32:07.598+0000","up_votes":3,"down_votes":0,"body":"Creo que seria complicado programar un bot jg, siempre seguiria las mismas rutas, el mismo patron, seria un saco de oro con patas, en lo demas estoy de acuerdo.","replies":[]},{"poster":"BUSCANDO A JORGE","date":"2016-04-19T18:13:29.898+0000","up_votes":2,"down_votes":0,"body":"Los bots no son para eso, los bots son para acostumbrase a las mecanicas basicas del juego.","replies":[{"poster":"Ghost Shadow26","date":"2016-04-19T18:17:37.857+0000","up_votes":2,"down_votes":1,"body":"Cierto, pero las builds, el lenguaje, las posiciones, las estrategias seria mejor aprenderlas ahi que en el PVP con insultos de por medio.","replies":[{"poster":"Tutancadead","date":"2016-04-19T18:57:43.773+0000","up_votes":2,"down_votes":0,"body":"Pero los bots no crean nada des eso. Eso lo cran los jugadores. No la vas a aprender contra bots.","replies":[]}]}]},{"poster":"DanielGarrita","date":"2016-04-19T18:49:40.279+0000","up_votes":1,"down_votes":0,"body":"si, igual aburre que cuando juegas con bot al minuto 15 ya tienen casi todas las torres tiradas.","replies":[]},{"poster":"jasun sofia30","date":"2016-04-19T18:36:30.161+0000","up_votes":1,"down_votes":0,"body":"practicamente deseas un pvp sin insultoss xd por lo que entendi","replies":[{"poster":"Ghost Shadow26","date":"2016-04-19T18:40:26.956+0000","up_votes":1,"down_votes":0,"body":"En teoria Si, por que ser nuevo en un juego y que te insulte de arriba a bajo te quita la ganas de jugar, ademas si jugas contras bots no tenes la presion de que estas compitiendo contra alguien sino mas bien, vas aprendiendo y mejorando en el juego","replies":[]}]}]}