{"poster":"zachi2","date":"2016-08-12T02:12:32.956+0000","title":"windows 10 anniversary update causing bug splat -updated","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"* Im seeing this alot on the boards now, so im assuming i would probably need to run repairs on the game? Otherwise is this now a compatibility issue with windows 10? \n\nPS. i've also heard this anniversary update is pretty poopy\n\n-updated- tried ot repair my game and i still get a bugsplat","replies":[{"poster":"Chrepto","date":"2016-10-01T09:09:04.637+0000","up_votes":3,"down_votes":0,"body":"i finaly fixed it !!!!\ni hope this works for you guys\n-type \"xbox\" in your windows search\n-click on it and sign up if you have to\n-when you are in the xbox app click on the settings (the gear thingy) in the app\n-go to dvr games\n-disable the dvr recording thing\nafter that just go in to a custom game and try if it works\nseems like after the windows update the recording dvr thing was automaticly on and messed up with league files or something\nhope i was helpful :)","replies":[{"poster":"El Mefisto","date":"2016-10-28T01:44:54.357+0000","up_votes":2,"down_votes":0,"body":"Thank you my friend it really helped :D Ireccomend that methode to you all guys :D Thank you again man :D","replies":[]},{"poster":"SpaceFrog","date":"2016-12-26T10:28:29.172+0000","up_votes":1,"down_votes":0,"body":"Thanks. Was tearing out my \"hair\" trying to figure this one out. Was working fine this morning. Then I take my PC to my mates house and it stopped working.\n\nBloody Shwandows 10!","replies":[]}]},{"poster":"Porocles","date":"2016-08-12T20:25:08.980+0000","up_votes":1,"down_votes":0,"body":"This could be for a few reasons like an issue with the Windows update, outdated drivers, or corrupted game files.  As a first step, please go through our [game crash](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes+) guide to get you back in game.  This should get you fixed up, but let me know if you have issues afterwards!","replies":[{"poster":"zachi2","date":"2016-08-16T21:15:00.517+0000","up_votes":2,"down_votes":0,"body":"posted another link since it seems like theres alot of this going on and nothing getting done with it. updated drivers, repaired the game, checked direct x,  clean booting windows,  .netframework 3.5 is installed and i reset the graphics settings.   At this point, i dont even know if unistalling, reinstalling will fix it\n\nhttp://imgur.com/a/fABPl#0OtlBnr\n\nheres the bug splat report. Not blaming riot, but it seems like windows 10 and league just have a hate hate relationship","replies":[{"poster":"Ðμß","date":"2016-12-12T19:47:11.428+0000","up_votes":2,"down_votes":0,"body":"I have the same issue and it still do not work for me with all your tips !\nI need help guys\n","replies":[{"poster":"LovePop","date":"2017-02-28T18:42:54.276+0000","up_votes":1,"down_votes":0,"body":"I finally fixed mines. I just had to do a factory reset. \n*it also made my computer a little bit more faster.","replies":[]}]}]},{"poster":"DragnDave","date":"2016-09-27T18:34:25.429+0000","up_votes":1,"down_votes":0,"body":"Done all this, still nothing but bug splats right after Champ select. Have even done the clean uninstall and reinstall and no change.","replies":[]},{"poster":"Destinys Blade","date":"2016-08-26T12:44:36.749+0000","up_votes":1,"down_votes":0,"body":"I've done every single thing on the guide AND i uninstalled and reinstalled league and i'm still getting this bug splat issue. I'm not sure what I can do to fix this at this point.","replies":[]}]},{"poster":"DragnDave","date":"2016-09-23T23:06:26.281+0000","up_votes":2,"down_votes":0,"body":"Same issue. I've done literally everything I can and nothing is working. It lets me log in but as soon as I try to start a game it will bugsplat back to the main league screen. I've uninstalled completely and reinstalled. Did everything on the Riot checklist and still nothing.","replies":[]},{"poster":"Salem The Caz","date":"2017-11-13T19:54:38.642+0000","up_votes":1,"down_votes":0,"body":"I've just fixed it and just recorded a video that how can you fix it to, 99% works, here is the link on YOUTUBE: https://youtu.be/t99sfM3IDoQ","replies":[]},{"poster":"SALEEM FAROOQ","date":"2017-09-24T04:19:06.303+0000","up_votes":1,"down_votes":0,"body":"bugsplt","replies":[]},{"poster":"Cranyos","date":"2016-10-16T10:25:41.696+0000","up_votes":1,"down_votes":0,"body":"I have the same problem..bugsplat after i did the last update on win 10...\nI wanna ask the staff of LoL..i report the problem with bugsplat and they punish me with 10 min ? this is normal.? \nI dint go afk...beucause i want to..i just did try to see if problem is resolved...i try repair...and ifcourse i wanna see if the game work..i get an error with bugsplat evry time...and i get PUNISH for tryng to play...i think not..\nI am playng this game over 3 years..but this SUCKS..\nsorry for bad english\ntnx...","replies":[]},{"poster":"Knalltuetchen123","date":"2016-09-30T16:54:27.427+0000","up_votes":1,"down_votes":0,"body":"ok after discussing the problem with the support over a few days, i completly deleted the X-box app and the issue seems to be fixxed. \n\ni just googled:\"delete x box app\" and did it like they desbribe, with microsoft power shell. \n\nhopfully it will help you too.","replies":[]},{"poster":"Knalltuetchen123","date":"2016-09-23T16:16:06.395+0000","up_votes":1,"down_votes":0,"body":"is there any fix to that topic meanwhile?","replies":[]},{"poster":"Flarre","date":"2016-08-23T12:39:17.567+0000","up_votes":1,"down_votes":0,"body":"I have the exact same issue for more than 2 weeks now. The exact same bugsplat report. \nI don't blame riot for the issue but I blame them for not dealing with it. All I see for 2 weeks now is \"please go through our game crash guide\" answers. Can you please understand that this is not an issue with someones personal computer that can be dealt with the usual way. This is a NEW issue that came with the windows 10 update that needs to be looked into seperately and whatever is in that guide of yours can not fix it. Please. I'm not such a lol junkie but I want to play a bit and I can't play for 2 weeks now...","replies":[]},{"poster":"Legendary BigB","date":"2016-08-12T04:59:45.104+0000","up_votes":1,"down_votes":0,"body":"I also am getting bug splat entering into any game after updating Windows 10 Anniversary. I Updated my graphics card and also ran repair and tried running as administrator and still bug splat.","replies":[]}]}