{"poster":"versusgiants","date":"2015-11-15T10:51:40.511+0000","title":"VEXATION-GAMING // sucht aktive Spieler!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"http://vexation-gaming.tk\r\n\r\n**About Us:**\r\nVexation Gaming sucht nach l&auml;ngerer Zeit wieder freundliche, teamf&auml;hige, humorvolle und anpassungsf&auml;hige Spieler.\r\nWir bestehen schon seit geraumer Zeit und suchen jetzt die passenden Mitspieler um uns f&uuml;r die kommende Season zu Wappnen . Wir legen gro&szlig;en Wert auf erwachsenes aber dennoch humoristisches Verhalten welches zu unserer freundlichen und famili&auml;ren Atmosph&auml;re innerhalb des Teams beitr&auml;gt.\r\n\r\n**Folgende Positionen sind bisher besetzt:**\r\n**Coach:** VEX compleX\r\n**Support:** VEX versusgiants\r\n**ADC:** ShoXz\r\n**MID:** _//WIRD GESUCHT//_\r\n**TOP:** _//WIRD GESUCHT//_\r\n**JUNGLE:** _//WIRD GESUCHT//_\r\n\r\n**Was suchen Wir?**\r\nWir suchen eine Mid-Lane, einen Jungler und eine Top-Lane mit einem Mindestalter von 16 Jahren. Wir wollen somit kindisches Verhalten weitestgehend ausschlie&szlig;en. Nat&uuml;rlich ist dies selbst in dem genannten Alter nicht immer der Fall, aber wir sind gewillt auch j&uuml;ngere Mitglieder bei uns aufzunehmen, sofern das Verhalten entsprechend passt.\r\n\r\nFlames und zu dieser Kategorie zugeh&ouml;rige Dinge werden bei uns nicht tolleriert. Flames zerst&ouml;ren den Spielfluss und das Team-Klima. Das ELO-Ranking der sich bewerbenden Spieler ist bei uns zweitrangig, da wir gr&ouml;&szlig;eren Wert auf Ausbauf&auml;higkeit, Taktikverst&auml;ndnis, Aktivit&auml;t und Freundlichkeit legen.\r\n\r\n**Unsere Ziele**\r\nNat&uuml;rlich hat jedes Team auch seine Ziele. Wir wollen uns gemeinsam so gut wie m&ouml;glich auf die bevorstehende Season vorbereiten um einen guten Start ins Team-Ranking zu gew&auml;hrleisten. Sp&auml;tere Ziele sind das Erreichen der n&auml;chst h&ouml;heren Division / Liga, Cup Teilnahmen und Liga Teilnahme.\r\n\r\n**Euer Weg in das Team**\r\nIhr m&uuml;sst den ersten Schritt machen! Stupide Antworten unter dem Post, sowie Bewerbungen die nur in Stichpunkten formuliert sind werden ignoriert. Am Besten schreibt ihr einen Unserer, sich am Ende dieses Posts befindende, Spieler an und erz&auml;hlt ausf&uuml;hrlich Dinge die ihr f&uuml;r wichtig haltet. Wenn euer schriftliches Interesse uns anspricht, werden wir euch zu einem Teamspeak Gespr&auml;ch einladen. \r\n\r\n\r\nWir freuen uns auf Euch!\r\n\r\n\r\n**Ansprechpartner:**\r\nVEX versusgiants *(Support)*\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\n\r\nMarvin **&quot;VEX versusgiants&quot;** T&ouml;lke\r\n*Vexation-Gaming - One Step Ahead*","replies":[{"poster":"ƒangzı","date":"2015-11-15T10:56:32.564+0000","up_votes":2,"down_votes":0,"body":"Bin leider erst im März 2016 16 Jahre alt... Habe aber die geistige Reife ..\nFlame nicht usw.. bei genaueren Fragen adde mich einfach Ingame \"Pessac EUW\"\n\n\nHeadet sowie TS³ vorhanden =)\n\nElo: Gold\nBevorzugte Lanes: Toplane\nChamps: Alle","replies":[]},{"poster":"Vladimirus","date":"2015-11-15T14:15:40.159+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nich finde das, was ihr angegeben habt gut. Würde gerne bei euch versuchen mit zu machen um zu schauen, ob wir sync werden, können als Team.  \nKleine Info zu mir, bin 21 Jahre alt. Spiele LoL seit 1 Season und in Season 5 spiele ich hauptsächlich in SoloQ Toplane, sofern es möglich ist.\nBin in gerade SoloQ P5, aber da ich im August große Lose Serie hatte war ich von P2 hart runtergefallen und in Teamrank(5v5) bin ich P4 mit Baylife Squad da war ich mehr der Allrounder im Team, weil das Team so wollte. \n\nDa das Team in letzter Zeit kaum lust/Zeit hat konnten wir leider nicht mehr beim  3. Battleground Turnier teilnehmen. Was ich persönlich schade finde, weil aktuell sind wir auf Platz 73 und das hätte man ausbauen können. Aber egal.\n\nAlternativ kann ich auch andere Rolle spiele, falls vergeben oder halt vielleicht sogar besser für das Team ist.\nMir Persönlich ist es wichtig, das Shotcalls beachtet werden und das man bei Problem im Team eine Lösung suchen sollt. Statt zu sagen ja wir lassen nächste Runde jemand anderes spiele und wir lass dich auf die Ersatz/Strafbank erstmal.\n\nAnsonsten falls ich eure Interesse geweckt habt könnt ihr mich jederzeit adden, da ich eh nach neuen Teams/Gruppe/Clans suche, da ich keine lust mehr hab auf SoloQ.\n\nMfG\nVladimirus","replies":[]},{"poster":"ha gotem xd","date":"2015-11-15T12:10:53.529+0000","up_votes":1,"down_votes":0,"body":"Heyho\nZu mir: \n\n- 16 Jahre alt\n-Platin2/3\n-Jungler\n-Großer Championpool\n-Teamerfahrung\n-Kritikfähig\n\n\nHabe schon in einigen Teams mitgespielt als Jungler, höchste Teamelo war d4.\nShotcaller qualitäten vorhanden.\n\nIngame name : Rêmy","replies":[]},{"poster":"ShoXz","date":"2015-11-15T11:47:05.093+0000","up_votes":1,"down_votes":0,"body":"Bitte noch ein Jungler ;)","replies":[]},{"poster":"ShoXz","date":"2015-11-15T11:31:25.169+0000","up_votes":1,"down_votes":0,"body":"#Push","replies":[]}]}