{"poster":"Peanut Tutu","date":"2018-09-03T14:58:04.594+0000","title":"Team sucht noch eine Botlane (Gold  Bereich)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Unser Team sucht noch **Verst&auml;rkung auf der Botlane**. Wenn ihr schon zu zweit seid und euch untereinander kennt, w&auml;re das nat&uuml;rlich perfekt, aber wir schauen uns nat&uuml;rlich erst jeden an nachdem wir beurteilen..\r\n\r\n**Also fang ich einfach mal mit den Kriterien an, die ihr erf&uuml;llen solltet:**\r\n\r\n- Mindestens 17 sein und auch sprachlich nicht zur&uuml;ckgeblieben wirken^^\r\n- Ein gutes headset und einen League f&auml;higen Rechner haben\r\n- Es ist wichtig mit kritik umzugehen und nicht gleich schlechte Laune zu haben\r\n-&gt; Aber am wichtigsten ist uns, dass ihr Humorvoll seid und auch ohne League zu unserem Team passt.\r\n**\r\nAlso was k&ouml;nnen wir euch bieten:**\r\n\r\nEs wird warscheinlich nicht sehr anders sein als bei anderen Teams, also denke ich mal es ist selbstverst&auml;ndlich, dass wir einen Teamspeak haben, worauf wir kommunizieren und auch von diesem &quot;Clan&quot; supportet werden. (Support im Gedanken an Coaching, Turnier einladungen etc) und sp&auml;ter nat&uuml;rlich acuh sponsoring..\r\n\r\n**Was wir denken, was uns ausmacht:**\r\n\r\nBei uns soll man nicht nur ingame gut sein und dort auch richtig handeln k&ouml;nnen. Wir freuen uns dar&uuml;ber, wenn man auch mal &uuml;ber andere Themen reden kann und sich auch auf einer anderen Ebene die nicht League of Legends hei&szlig;t kennen zu lernen. **Also wenn ihr keine Freunde dieser Art eines Team seid, brauchst ihr es hier nicht versuchen :)\r\n**Uns sind Humorvolle Gespr&auml;che sehr wichtig und wir wollen Spa&szlig; beim spielen haben und etwas erreichen, ansonsten w&auml;re es doch nicht das gleiche, oder?\r\n\r\nIch hoffe dieses Prinzip gef&auml;llt dir/euch :)\r\n\r\nAlles weitere w&uuml;rden wir gerne privat kl&auml;ren, also falls du/ihr Interesse habt, added mich doch einfach mal und wir schauen wie es wird.\r\n\r\nDanke f&uuml;rs lesen, und einen sch&ouml;nen Tag!\r\n{{sticker:sg-kiko}}","replies":[]}