{"poster":"FluffyBananaTree","date":"2017-07-30T15:49:12.883+0000","title":"Beware of Feeding \"Smurfs\"","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2560758002/218163495?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":0,"body":"Hey guys. I just played with a player called ---- who in queue claimed to be \"smurf\". When stated that no one cared, he proceeded to run Cleanse &amp; TP Teemo bot because of my \"attitude\". This forced someone to dodge, rightfully so, and I had the misfortune of queuing up with him again. He once again claimed to be a smurf in chat- and again, no one could care less. If your life is so sad that you have to smurf in silver elo to feel better about yourself, or claim to be one to feel like you are something, good for you. Just play the game. He then ran Cleans &amp; TP bot Yasuo, stated in chat that he wanted to teach me a lesson, TPed top as game started and fed the lane, lied in all chat that I took top when  I was assigned support to try to have me reported, and continued to grief all game. To be honest I don't mind playing out games like that because I want to have pieces of {{champion:17}} s like him reported and permabanned from the community and unfortunately  RIOT \"AHEM\" ONLY HAS THE REPORT SERVICE AFTER THE GAME IS OVER and NOT DURING CHAMP SELECT FOR PEOPLE WHO TROLL TO MAKE OTHER PEOPLE DODGE. Riot really needs better player report system and please PLEASE, if this guy IS a smurf, get this guy's accounts all permabanned. His account name is ---- and his behavior suggests that this wasn't the first time he did this. Thanks Rito. If not, whats wrong with you Rito.","replies":[{"poster":"Broporo","date":"2017-07-31T00:31:17.448+0000","up_votes":1,"down_votes":0,"body":"Thanks for the heads up! In the future, do just as you did and mute them so that they can't provoke you into being toxic as well. Sending those reports is undeniably the best way to flag their account for investigation, and we have ways of finding any other smurfs someone might have as well.\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"FluffyBananaTree","date":"2017-08-11T13:26:04.735+0000","up_votes":1,"down_votes":0,"body":"Awww, thank you Rito! You do care! <3 <3 <3","replies":[]}]}]}