{"poster":"Lunar ArcS","date":"2019-05-24T07:26:22.471+0000","title":"This is going to be very angry and very rude but i need to get this off my chest, youve been warned","subforum":"Rant","up_votes":1,"down_votes":0,"body":"Why the fuck do low elo shitters not want to get carried like i dont fucking get it\r\nLike i camp their stupid SHITTY LANES and help them. What do they do? CRY\r\nTHEY CRY AND BITCH BECAUSE THEY CANT HANDLE SOMEONE NOT DOING PERFECTLY.\r\nLike my mental is fucking booming at these gold trashcans sitting their rage inting and afking because they just cant handle that we scale.\r\nLike the last THREE ranked games, they couldnt handle just not inting and just playing safe and SCALING. i dont fucking understand why you IDIOTS CANT JUST FUCKING SIT THERE AND LET ME CARRY U FUCKING ASSHOLES. put your FUCKING EGO DOWN and let me win you stupid fucks. you are the SOLE reason you lose your games. it's not your teams, it's not the enemy teams. it's YOUR STUPID FUCKING MENTALITY .\r\n\r\nThank you for allowing me to get my anger out. I want to disclaim that not all low elo players are like this and im sure most of you are very nice and great, but sometimes some of you make my head come off and i have to refrain from typing bc im trying to be a reformed egirl gn","replies":[{"poster":"Execra Bill","date":"2019-05-29T11:10:20.758+0000","up_votes":1,"down_votes":0,"body":"Lol. I feel your pain. I got tired of doing the carrying, so I do/play/build/say whatever the hell I want, and make a new account when I wear out my welcome. It's my petty way of getting back at Riot for not doing more to keep smurfs/re-tards out of my games.","replies":[]},{"poster":"Krystorr","date":"2019-05-25T01:20:10.715+0000","up_votes":1,"down_votes":0,"body":"You've got some bad luck mane. i'm only silver but I don't see very many people like that...","replies":[]},{"poster":"ScatterTheWeak","date":"2019-05-24T16:33:01.987+0000","up_votes":1,"down_votes":0,"body":"Maybe you are part of the problem and you just dont realize it. :)","replies":[{"poster":"Lunar ArcS","date":"2019-05-24T16:58:15.423+0000","up_votes":1,"down_votes":1,"body":"Hiding behind a low level account to say that? How shocking :p","replies":[{"poster":"ScatterTheWeak","date":"2019-05-24T18:56:28.730+0000","up_votes":1,"down_votes":0,"body":"What. LOL. This is the only account I use. Why would i hide behind a low level account? Wouldnt it be more ideal to hide behind a high level account so that your opinion is more valid. I feel like being on a low level account would make my opinion less valid. Also it was pretty obvious that i was being sarcastic in my comment to you. LOL. Why are you so defensive? Low mental? Also while we are asking questions why call yourself an egirl? Is that a humorous way of letting people know your a girlgamer to gain sympathy for your post? -thinking-","replies":[]}]}]},{"poster":"Sea Slug Menace","date":"2019-05-24T09:24:08.586+0000","up_votes":1,"down_votes":0,"body":"LOL oh shit I thought it was a girl when i heard low elo shitters\n\n\nthis is so fucking funny, I actually have games where I just let myself be carried, it does wonders for climbing","replies":[{"poster":"Lunar ArcS","date":"2019-05-24T16:57:49.502+0000","up_votes":1,"down_votes":0,"body":">LOL oh shit I thought it was a girl when i heard low elo shitters\n\nI'm predictable sorry :/","replies":[]}]}]}