{"poster":"Uzyal","date":"2019-03-14T01:12:55.163+0000","title":"Perma Ban for no reason?","subforum":"Player Behavior","up_votes":1,"down_votes":0,"body":"I received a ban on my account and the email said it was for using malicious software or modifying the client. I have had my account for a very long time but only really log into it when my wife or cousin wants to play. I do not share my account with anyone nor have I actually logged into it for awhile ( few months). Is there a way that I can see when/where my account was logged into to possibly get my account back? Thank you for responding.","replies":[{"poster":"KFCeytron","date":"2019-03-14T01:19:27.386+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Uzyal,realm=NA,application-id=ZGEFLEUQ,discussion-id=frE8GRtA,comment-id=,timestamp=2019-03-14T01:12:55.163+0000)\n>\n> only really log into it when my wife or cousin wants to play. I do not share my account with anyone\n\n{{sticker:sg-lux-2}}","replies":[{"poster":"Uzyal","date":"2019-03-14T01:25:13.224+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=ZGEFLEUQ,discussion-id=frE8GRtA,comment-id=0001,timestamp=2019-03-14T01:19:27.386+0000)\n>\n> {{sticker:sg-lux-2}}\n\nI am not a huge moba fan, I only really play when one of them wants me to play with them. Not sure what you were confused about.","replies":[{"poster":"Elite4Runner","date":"2019-03-14T01:31:29.502+0000","up_votes":1,"down_votes":0,"body":"They think you are saying that you log in so that your wife or cousin can play on your account. I was confused by that at first too, but I understand what you meant was that you would log in to play with them (they have their own accounts)","replies":[{"poster":"Uzyal","date":"2019-03-14T01:32:44.944+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Elite4Runner,realm=NA,application-id=ZGEFLEUQ,discussion-id=frE8GRtA,comment-id=000100000000,timestamp=2019-03-14T01:31:29.502+0000)\n>\n> They think you are saying that you log in so that your wife or cousin can play on your account. I was confused by that at first too, but I understand what you meant was that you would log in to play with them (they have their own accounts)\n\nExactly","replies":[{"poster":"MrFawknSunshine","date":"2019-03-14T01:54:53.002+0000","up_votes":2,"down_votes":0,"body":"submit a support ticket. posting here on the boards wont help you","replies":[]}]}]},{"poster":"KFCeytron","date":"2019-03-14T02:36:49.473+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Uzyal,realm=NA,application-id=ZGEFLEUQ,discussion-id=frE8GRtA,comment-id=00010000,timestamp=2019-03-14T01:25:13.224+0000)\n>\n> I am not a huge moba fan, I only really play when one of them wants me to play with them. Not sure what you were confused about.\n\nAh; with \"wants to play\" rather than \"wants to play _with me_,\" I thought you meant that you log in to give a friend an account to play on. Never mind, then.","replies":[]}]}]},{"poster":"StSnowball","date":"2019-03-14T02:41:25.672+0000","up_votes":3,"down_votes":0,"body":"If you truly didn't do anything wrong then just create a support ticket on the LoL website (under support tab) and explain the situation etc. they can verify whether your suspension was justified or not. they also have a live chat so you can speak with an actual employee from riot to try and solve this mess. If your account was banned by mistake they will fix it in no time! good luck :)","replies":[]},{"poster":"Uzyal","date":"2019-03-14T22:03:05.982+0000","up_votes":1,"down_votes":0,"body":"Yeah i finally figured out how to check the game history and saw the four summoner games. If you look at the match history from when i actually play i exclusively play ARAM games. I put in a support ticket two days ago and have yet to hear back from Riot. I know nothing will come from posting on the forums and was more just looking for further suggestions. Cant figure out how to talk to a live rep about the issue because its not an option on this type of support ticket. I didn't want to put in a false ticket just to speak to someone immediately.","replies":[]},{"poster":"Tele II","date":"2019-03-14T22:01:18.993+0000","up_votes":1,"down_votes":0,"body":"Submit support ticket about it. We cant help you.","replies":[]},{"poster":"Sukishoo","date":"2019-03-14T03:11:38.425+0000","up_votes":1,"down_votes":0,"body":"> nor have I actually logged into it for awhile ( few months)\n\nI see 4 URF matches from yesterday, so someone has been using it.  \n\nUnfortunatly though, when ever they say that the account was banned for using malicious software it's unlikely they will reverse the action. \n\nBest thing to do though is create a support ticket and see what they say.","replies":[]},{"poster":"Elite4Runner","date":"2019-03-14T01:18:34.927+0000","up_votes":1,"down_votes":0,"body":"To answer your question, .. No, there is not a way for you to see when and where your account has been logged in from. \n\nRiot can though.","replies":[]}]}