{"poster":"Fortiis","date":"2015-06-12T17:36:56.054+0000","title":"I have a question.","subforum":"[ARCHIVED] Miscellaneous","up_votes":1,"down_votes":0,"body":"I'm not trying to show off or anything at all because I do not feel like I have any room to say that I am skilled at this game. However, LoL is my first MOBA that I have ever played and I started playing this game consistently around March, placed into Gold V from promos in late April, and despite my aversion from ranked, feel like I am far ahead mechanically and strategically than the typical player in their first season. I'm just curious as to how quickly people have picked up this game.","replies":[{"poster":"moonstones","date":"2015-06-12T18:02:17.653+0000","up_votes":2,"down_votes":0,"body":"Hiya Fortiis! \n\nFor the amount of time you've been playing - placing in Gold is pretty sweet! It seems you've picked up the game rather quickly! Which roles have you been playing? \n\nI've been playing the game since 2010, and didn't play ranked for the first couple of seasons. In the 2013 season, I was Silver, last year, I was Gold, and this year, I'm Plat. I'm a support main, so hard carrying isn't my strong point. I used to be a mid main, but now it's my secondary support. \n\nI think there's a lot of factors that go into how well/quickly people climb, and I think a solid understanding of the game is a really important first step. After that, it's about finding a champion/role that works for you. Personally, I think players who can play several roles in ranked are overall more successful because it means you have a better shot at everyone getting a role they're at least comfortable in, and someone is less likely to get stuck in the role they're least comfortable in. (For me, that's jungle.)","replies":[{"poster":"Fortiis","date":"2015-06-12T18:10:16.065+0000","up_votes":1,"down_votes":0,"body":"I appreciate the response! I main ADC (Kalista op lol) and I usually duo with my friend who is learning the game as well so we can improve together and critique each other from game to game. I'm trying to learn top and support now and steadily improve my game over the summer when I have the ability to play frequently. Good luck to you and maybe some day we will meet on the Fields of Justice!","replies":[{"poster":"moonstones","date":"2015-06-12T19:59:39.859+0000","up_votes":2,"down_votes":0,"body":"Nice! I actually duo with a Kalista main. I play Nami with her, and it's a pretty strong lane, IMO. \n\nIf you can ADC, support isn't too bad to learn 'cause you're pretty familiar with how the game works. It's less about lane knowledge at that point, and more about learning the limitations of the support you're playing, and knowing who pairs well.\n\nGood luck! :3","replies":[]}]}]},{"poster":"disregardable","date":"2015-06-12T18:57:36.185+0000","up_votes":1,"down_votes":0,"body":"My one year anniversary is in 8 days, and I'm still Bronze 5. /shrug. Everyone is different.","replies":[{"poster":"Fortiis","date":"2015-06-12T19:54:12.304+0000","up_votes":1,"down_votes":0,"body":"I have many friends in the same situation, many of whom I think are better than myself, it goes differently for everyone I guess.","replies":[]}]},{"poster":"rtbf221146393","date":"2015-06-12T17:48:16.163+0000","up_votes":1,"down_votes":4,"body":"I got to diamond 2 in my first season. Gold is not impressive at all...","replies":[{"poster":"Vistha Kai","date":"2015-06-12T18:18:22.191+0000","up_votes":1,"down_votes":0,"body":"But you are afraid to comment from your main, eh?","replies":[{"poster":"rtbf221146393","date":"2015-06-12T18:22:28.033+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Vistha Kai,realm=EUNE,application-id=cIfEodbz,discussion-id=sxVMjpMi,comment-id=00000001,timestamp=2015-06-12T18:18:22.191+0000)\n>\n> But you are afraid to comment from your main, eh?\n\nI would comment on my main if it wasnt permabanned.","replies":[{"poster":"Vistha Kai","date":"2015-06-12T18:33:25.389+0000","up_votes":2,"down_votes":0,"body":"Then don't forget to tell me once you will be able to play ranked.","replies":[{"poster":"rtbf221146393","date":"2015-06-12T18:35:43.859+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Vistha Kai,realm=EUNE,application-id=cIfEodbz,discussion-id=sxVMjpMi,comment-id=0000000100000000,timestamp=2015-06-12T18:33:25.389+0000)\n>\n> Then don't forget to tell me once you will be able to play ranked.\n\n???\n\nThis is my main http://euw.op.gg/summoner/userName=riven+lovejoy\n\nThis was my main before transferring to EUW: http://eune.op.gg/summoner/userName=riven+the+exiie (it still has d2 mmr probably)","replies":[]}]}]}]},{"poster":"Fortiis","date":"2015-06-12T18:11:47.290+0000","up_votes":1,"down_votes":0,"body":"Thanks! It's nice to get some perspective :)","replies":[]}]}]}