{"poster":"PotatoScredder","date":"2019-08-27T10:29:20.151+0000","title":"Why adc are broken","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"First of all *broken* means too weak or too strong.\nThe word for too strong is overpower, not broken. \n\nAdc have either been OP AF so much so that the entire game has been centered around them for half of lol history.\nThen when they were weak they were so weak that you just dont see them. \n\nWhy is that?\nIt's because of their items. \n\nEvery champ has strong points or weakness. \nAdc weakness:\nSquishy,generally have no cc and escape. \nStrong in : dps, range. \n\nHow is it that adc are either op or useless/bad?\n\nSupports can cover a marksman weakness which means they are an absolute unit and count more as any other 2 champs smashed together. \n\nThis means that, when adc do damage the game completely surronds the bot lane.\nSince you want to stop them from reaching that OP AF point. \nIf they dont do high damage then why waste a spot for him, when you can get another mage(what happen in the adc nerfer meta that lasted for 2 weeks but adc main make it seems like it was an entire year). \n\nThen why is it that I think their items are the problem and not the existance of the support role? \n\nSupport are the problem infact but its not ok to just  delete 1/5 of the game\n\nLets see why other roles dont have this problem and how other lanes play first. \nLets say you are against an assasin mid lane as a mage, what do you do? \nYou can build zhonia to save yourself in fight and banshee to negate their engage,they have the option of changing their item depending on the matchup and still be mage and do damage whit their spells. \n\nAdc dont have options, you either build crict or you build no crict for the defence and you can survive but be useless anyway. \n\nWe already have items that give resistance and AD,but items that give resistence and crict rate?\n\nOn of the main reason you dont often see adc building those resistance items is because they just dont have damage whitout the crict rate and buffing the AD of resistence items means you are buffing both assasins and bruiser. \n\nWhy not have crict rate and resistence item at this point? \nNo crict= no damage then give them that crict rate\nThat has no ad which means bruiser and assasin cant really abuse those items either and adc are triding their AD for the resistence.","replies":[{"poster":"liberodaniele","date":"2019-08-27T11:51:57.723+0000","up_votes":2,"down_votes":1,"body":"First of all this is the italian forum, quindi ben venga l'italiano e abbasso l'inglese :P\nSecondariamente hai ragione nel discorso, per come è fatto il gioco (ad alto livello) gli adc saranno sempre o troppo forti o troppo scarsi, in base a quanto vengono buffati/nerfati gli oggetti. Al giorno d'oggi esiste anche un oggetto difensivo che da critico ( {{item:3046}} ) e sinceramente mi sembrerebbe stupido aggiungerne altri, anche perchèè un meta in cui gli adc sono già abbastanza forti.","replies":[{"poster":"PotatoScredder","date":"2019-08-27T13:25:53.526+0000","up_votes":1,"down_votes":0,"body":"Me ne sono accorto dopo,che era quello italiano ho selezionato inglese ed e restato in italiano :(\nComunque no, intendo semplicemente un item che da solo crict e resistenze, non uno shield. ","replies":[{"poster":"Luckynanix","date":"2019-08-27T14:39:48.537+0000","up_votes":1,"down_votes":0,"body":"Perché dovresti fare un item da critico che ti dà resistenze? Quando l'idea dell'adc è un champ che fa DPS ma che è molto fragile.","replies":[{"poster":"PotatoScredder","date":"2019-08-29T09:01:21.576+0000","up_votes":1,"down_votes":0,"body":"Perche chiaramente non e buono per il gioco questo ruolo","replies":[{"poster":"Luckynanix","date":"2019-08-29T09:29:15.634+0000","up_votes":1,"down_votes":1,"body":"Ma cosa vuol dire? Capisci che quello che dici non ha senso? Perché sarebbero inutili? Perché hanno bisogno di oggetti? Inoltre non tutti gli ADC buildano crit (vayne per esempio  ad inizio anno prendeva {{item:3153}} e {{item:3124}} e poi andava full tank).\nNon esistono item difensivi per ad {{item:3026}} {{item:3072}} cosa sono? ADC con escape ne esistono a bizzeffe così come quelli con utility.\nCome ruolo è quello che richiede le meccaniche maggiori non per i campioni ma per kiting, positioning ferming e le varie tecniche di push e freeze.\nDetto ciò un adc mediocre è inutile mentre un buon ADC è una parte importante del team.\nSe giochi ADC e ti lanci per primo in mezzo a cinque nemici o ti fai sempre prendere fuori posizione cambia ruolo.","replies":[{"poster":"PotatoScredder","date":"2019-08-29T15:42:36.335+0000","up_votes":2,"down_votes":0,"body":"1.Quando si parla di qualsiasi cosa si parla della maggiorparte.\nPer questo prima sistemi la maggiorparte dei adc e poi guardi i casi speciali. \n2.Non hai capito un %%%%%\n3.No rileggendo il tuo commento ho capito che non hai seriamente capito il commento originale, rileggilo, se non capisci l'inglese capisco(ho sbagliato a postare infatti) ma se non capisci e continui a scrivere paragrafi c'e qualcosa che non va qui. ","replies":[{"poster":"Luckynanix","date":"2019-08-29T16:04:55.819+0000","up_votes":1,"down_votes":1,"body":"1. Gli ADC da crit non sono la maggior parte sono ben distribuiti in ADC on hit e crit (con i casi speciali di Draven e MF.\n3. Tu vuoi un item da critico che dia resistenze perché gli ADC sono fragili (come è giusto che sia ma vabbè è un altro discorso) e io ti ho spiegato come esistano item che danno risorse difensive agli ADC e anche modi per non esporti al danno di un assassin.\nSe le mie risposte non ti vanno a genio allora non si capisce di cosa ti lamenti. Ti lamenti perché sono troppo forti? Perché sono troppo deboli? Per he dipendono da item? Perché sono fragili? \n> [{quoted}](name=PotatoScredder,realm=EUW,application-id=cAOZwaUi,discussion-id=yEmX7VZt,comment-id=0000000000000000,timestamp=2019-08-29T09:01:21.576+0000)\n>\n> Perche chiaramente non e buono per il gioco questo ruolo\n\nCosa dovrebbe voler dire questa tua frase?","replies":[{"poster":"Luckynanix","date":"2019-08-29T16:05:49.176+0000","up_votes":1,"down_votes":1,"body":"Non si capisce di cosa ti lamenti prova a spiegarti meglio","replies":[]}]}]}]}]}]},{"poster":"vondarck","date":"2019-08-27T14:58:01.610+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PotatoScredder,realm=EUW,application-id=cAOZwaUi,discussion-id=yEmX7VZt,comment-id=00000000,timestamp=2019-08-27T13:25:53.526+0000)\n>\n> Me ne sono accorto dopo,che era quello italiano ho selezionato inglese ed e restato in italiano :(\n> Comunque no, intendo semplicemente un item che da solo crict e resistenze, non uno shield.\n\nPessima idea, se lo fai SA kayn/rengar e amici ne possono abusare","replies":[]}]}]},{"poster":"Kailar","date":"2019-08-28T12:42:03.125+0000","up_votes":1,"down_votes":0,"body":"A gioco corretto gli adc difficilmente si trovano nella posizione di fare molti danni, nella maggior parte delle situazione sarebbe molto facile punirli, il problema è che si usa sopratutto in solo q creare team con pochissimi hard cc, se pensate di dover stunnare master yi per ucciderlo e non fargli prendere penta, non avete mai giocato contro una buona tristana, se credete che Katarina sia molto pericolosa in fight, per via dei suoi blink e reset non avete mai giocato contro una Kai'sa decente. Gli adc ad elo intermedio sono un problema, perché loro imparano a giocare e a posizionarsi decentemente, mentre le uniche persone che vogliono colpirli sono gente poco più tankosa di un mage, un adc contro un team senza cc mid late game fa quadrakill prima di essere ammazzato.","replies":[]},{"poster":"V3LK0ZMAST3R","date":"2019-08-27T16:48:08.327+0000","up_votes":1,"down_votes":0,"body":"Semplicemente non dovrebbero esistere item che danno sia un quantitativo spropositato di Ad che critico, in modo che la lane (e spesso il game) non sia già finita solo perché uno dei due ha preso un paio di kill early; dalla controparte poi gli item tank finché non danno una minchia di hp sono totalmente inutili per contrastare un hypercarry già solo con un paio di item. Semplicemente il problema é che ora come ora gli adc (in meta) fanno troppi troppi danni con un paio di item, eliminando tutta la fase del game in cui dovrebbero scalare, diventando ingestibili verso tutti senza distinzioni già dopo pochi minuti. Esatto il punto forte dovrebbe essere il dps, ma attualmente il loro dps é molto simile a un burst for second.\nCreare item che danno sia crit che resistenze é totalmente inutile come counterplay per un adc behind verso un altro adc, proprio perché l'armor senza hp é molto debole e optare per un item che non da ad quando già sei indietro é un suicidio. Differentemente risulterebbe molto forte per un adc avanti che contrastare gli attuale unici counter,gli assasin.","replies":[]},{"poster":"vondarck","date":"2019-08-27T12:12:52.940+0000","up_votes":1,"down_votes":0,"body":"Personalmente il discorso è più complesso, alcune sinergie coi support sono troppo forti e eliminano motle debolezze sia dei support che degli ADC (imho)\nEliminerei le sinergie difensive degli adc (tipo l'elmo cura solo il support e non mitiga indanni dell adc)","replies":[]},{"poster":"Dr LouD","date":"2019-08-28T08:48:37.024+0000","up_votes":1,"down_votes":1,"body":"L'unico problema di questo gioco sono i support con troppa utility e allo stesso tempo di una facilità imbarazzante (si yuumi e Janna, sto pensando a voi)\n\n","replies":[]}]}