{"poster":"Crett","date":"2015-01-19T17:50:03.594+0000","title":"The CROWNING moment of your favorite champions","subforum":"Memes & Games","up_votes":6,"down_votes":0,"body":"I see two little monkeys attacking my inhibitor turret thinking they got the god danged game in the bag\r\nI stealth\r\nI walk right up to their faces and suddenly,\r\n{{champion:29}} \r\n\"It's ME!!\"\r\nThen I start screaming out loud \"RUN AWAY, RUN, RUN FROM ME RUN FOR YOUR LIFE!??!\" and they both get chunked to like 10 HP while running and eventually die 6 seconds later from poison\r\n\"fking twtich\", one of them said. At the time I thought it was really funny.","replies":[{"poster":"femmé","date":"2015-01-20T02:17:02.885+0000","up_votes":4,"down_votes":0,"body":"{{champion:119}}  every moment is a crowning moment","replies":[]},{"poster":"A Superb Villain","date":"2015-01-19T19:50:50.367+0000","up_votes":3,"down_votes":0,"body":"Entire enemy team hopes to set up a bush gank in the wrong bush.\n\n{{champion:45}}\n\"YOU'VE FALLEN RIGHT INTO MY TRAP!\"\n\nPop the carry, let my team clean up the mess.","replies":[]},{"poster":"Doom Brownies","date":"2015-01-20T22:17:48.237+0000","up_votes":2,"down_votes":0,"body":"Enemy:\nI'M GETTING AWAY!  YAAAAY!\n\n{{champion:99}} lolno.","replies":[]},{"poster":"DevilishMetal","date":"2015-02-05T20:01:01.838+0000","up_votes":1,"down_votes":0,"body":"{{champion:412}}  Building AD and oneshotting their adc. Satisfaction level over 9000.","replies":[]},{"poster":"Spooky Spooker","date":"2015-02-02T22:11:47.802+0000","up_votes":1,"down_votes":0,"body":"As {{champion:119}}  (not my fav but nothing to special with vi).\n\nUlts {{champion:110}} \n{{champion:110}} [All]: Lol Draven ultis like a n00b\npresses R*axes come back\n{{champion:119}}  has slain {{champion:110}} for a double kill\n{{champion:119}} [All]: What were you saying?","replies":[]},{"poster":"amonkeybutt","date":"2015-02-02T20:10:33.913+0000","up_votes":1,"down_votes":0,"body":"{{champion:74}} Not my favorite, but worth sharing.\n\nI set up some towers in dragon pit, just by myself, waiting for the dragon to spawn. All of a sudden like 4 people jump in from all sides that aren't my team mates.\n\nUlt turret goes up and I scream \"WELCOME TO THE DONGER'S DEN!\"  popped a quad right there.\n\nIve done too much shit with {{champion:103}}  to remember off of the top of my head.","replies":[]},{"poster":"toxicpanda36","date":"2015-01-26T20:36:48.116+0000","up_votes":1,"down_votes":0,"body":"Some people starts dissing me as a horrible player. I go up to 4 enemies alone and say-\n{{champion:11}} WHAT DID U JUST SAY TO ME!??!?!\n*10 seconds later* QUADRA KILL!!!!\n{{champion:11}} Dats wut i thought","replies":[]},{"poster":"What Is Smite","date":"2015-01-23T04:26:01.589+0000","up_votes":1,"down_votes":0,"body":"{{champion:114}}  enemy team think's they catch me out 1v3, I turn on them and all you hear is \"Triple Kill\" followed by chat messages of \"yea fiora's definitely not broken\" and all this after the nerf to her ultimate. So let me ask you: Is this a Challenge?","replies":[]},{"poster":"Finkypop","date":"2015-01-22T20:48:48.405+0000","up_votes":1,"down_votes":0,"body":"Channeling a {{champion:21}} ultimate. The laugh, the giant dramatic cone of bullets - and if it hits all of them and you get a multi kill it's even better.","replies":[]},{"poster":"Jubbinaut","date":"2015-01-22T20:29:37.124+0000","up_votes":1,"down_votes":0,"body":"I swear, my favorite moment as {{champion:15}}, I didn't really even **do** anything.\n\nOur team was behind, though I was managing decently, something like 1/1/6 (greedy jungler). I'd been farming like a beast, though, about 100 CS ahead of the next-highest player on either team.\n\nWent back to base after clearing a lane, picked up Shiv, and noticed we were dancing in mid getting ready for a fight, so I headed that way. Before I managed to get past the inner lane turret, the fight starts 5v4, and while my team's holding their own, it's a little iffy. So I ult, fly down the lane, Q as I get close - chunking their front line - and get off like 2 autos with my W. And somehow, between the burst on the Q, the bouncing blades, and the shiv proc, I picked up a triple.\n\nThey surrendered a couple minutes later (still with a gold and turret advantage), and I felt like a badass.","replies":[]},{"poster":"Mecha MaIphite","date":"2015-01-22T19:54:37.450+0000","up_votes":1,"down_votes":0,"body":"{{champion:91}} on ARAM, got poked down to like 200 hp. I told my team I was going to suicide so that I would be back by the time they needed me rather than getting aced. So I go in and suddenly DOUBLE KILL.","replies":[]},{"poster":"Maximum Zilean","date":"2015-01-22T15:44:55.944+0000","up_votes":1,"down_votes":0,"body":"Perfectly kiting the enemy team as {{champion:268}}. Not easy at all, but insanely rewarding. \n\nOr trapping all 5 enemies in the baron pit while I kill them all without them being able to fight back. Again,{{champion:268}}","replies":[]},{"poster":"It That Kills","date":"2015-01-22T06:38:49.083+0000","up_votes":1,"down_votes":0,"body":"{{champion:90}} when assassins and {{champion:157}}  think they can win, al they can hope for is to survive. or that sweet 5 man silence that wins my team the fight. or even better when {{champion:86}} melts away on my pool.","replies":[]},{"poster":"Blue Collar Bear","date":"2015-01-21T09:20:09.465+0000","up_votes":1,"down_votes":0,"body":"I headbutted {{champion:77}} into my team as {{champion:12}} \n\nThey were doing dragon.","replies":[]},{"poster":"ThatAutofillSupp","date":"2015-01-21T09:13:30.380+0000","up_votes":1,"down_votes":0,"body":"Flash hooked  a sona who was fed at max range as thresh and won the game :D","replies":[]},{"poster":"DIRU","date":"2015-01-21T06:19:58.321+0000","up_votes":1,"down_votes":0,"body":"The 2nd 1v5 penta I did with {{champion:157}}","replies":[]},{"poster":"zangager","date":"2015-01-21T02:18:03.848+0000","up_votes":1,"down_votes":0,"body":"Four champs running away, all with low health, thinking I can't catch them.\n\n{{champion:56}} DARKNESSSSSSS!!\n\nQuadra kill.\n\nTheir ally comes in to help.\n\nW>E>Q>AA>AA>Q> PENTA KILL!","replies":[]},{"poster":"Vauren","date":"2015-01-20T19:02:40.611+0000","up_votes":1,"down_votes":0,"body":"Getting avenging double kills as {{champion:89}}  after the enemy bot lane kills my adc. Also, executing sick jukes and escapes with Zenith Blade to dodge skill shots headed my way by jumping behind them, stunning them, then running away getting the minion wave between us to avoid further skill shots while saving my adc through the cc and distraction I provide.\n\nCan't forget about being a hidden tank carry as {{champion:106}}  where I run in and the enemy adc says \"You know a tank is op when they do carry damage.\" after I bit their head off :P","replies":[]},{"poster":"SlimyDan","date":"2015-01-20T00:39:03.954+0000","up_votes":1,"down_votes":0,"body":"Well this probably isn't my crowning moment but the other day as I was playing {{champion:62}}  jungle I had gotten kind of fed. I was farming top jungle and saw that {{champion:92}} was starting to push so I decided that since I hadn't gone to kill her in a while I go pay her a visit.\nI came to lane and she started dashing away so I flashed, E'd, and unloaded all my powers on her. I then started heading down to mid and I found {{champion:35}}  and {{champion:55}}  hiding in the triangle bush. I immediately unloaded all my powers but without my ult I wasn't able to kill them so I cloned and ran to the bush near Krugs at low health and then turned around and E,Q'd Shaco and killed Katarina in an auto attack war for a solo 1v3.\n\nLater on in that same game I killed 3 people inside their base with all the inhibitor turrets up but I had some assistance from Soraka standing over the wall healing me and Rumble probably fired some rockets from over the wall.","replies":[]},{"poster":"Embertine","date":"2015-01-20T00:05:03.769+0000","up_votes":1,"down_votes":0,"body":"I was playing {{champion:102}} \nMe and two others were really low on health and had just broken an inhibitor. Three of the enemy team respawned and after a quick trade me and my team mates know there is no way we can win that fight and so we retreat. The three enemy team members chase us up middle lane, (we were on purple team at the time,) and are gaining on us. At that point I'm thinking, \"Fuck it, it's better I died then all three of us.\" So I ulted back into the three pursuing enemies and begin rapidly mashing my abilities, knowing full well I'm about to die. But to my surprise I hear TRIPLE KILL! and see that I'm standing alone atop three dead bodies! The other two guys see this and were like, \"Holy shit!\" We went back with the minions and broke the last two towers and finally ended the game.","replies":[]},{"poster":"Decrit","date":"2015-01-19T23:48:30.327+0000","up_votes":1,"down_votes":0,"body":"They were running in the jungle, and stacked together with not so much health.\n\nI pity those fools {{champion:82}} \n\nI flash in from the tree wall, i ult the carry, use my Q + E to deal absurd chunks of damage in an area and generating shield. The carry dies, i get his ghost. I keep the fight for a bit and i am about to lose, but then i pop Zhonya {{item:3157}} and while i am in stasis the ghost clears up the enemy.\nWhen i get back from stasis i already made 3 victims, the last duo standing with a sour surprise: ghost autoattacks procced spellvamp and shield generation, allowing me to recover a lot of health.\n\nThe have no time to run. No time to despair.\n\nPENTAKILL","replies":[]},{"poster":"2000boxes","date":"2015-01-19T19:16:32.973+0000","up_votes":1,"down_votes":0,"body":"when the planets aligned and i got a zed pentakill taking advantage of a team that couldn't keep track of where i was","replies":[]},{"poster":"asktiks","date":"2015-01-19T18:51:47.999+0000","up_votes":1,"down_votes":0,"body":"getting turret dived by talon as azir, desperately blind casting W and Q somewhere with 10 hp left and blindly stabbing talon in the face while hes invisible with both soldiers \n\nhilarious but we all know I would have died if it weren't for luck lol","replies":[]},{"poster":"Blue Moon Wolf","date":"2015-01-19T18:47:29.614+0000","up_votes":1,"down_votes":0,"body":"\"two little monkeys\" eh... {{champion:62}}","replies":[]},{"poster":"IceKingChernobog","date":"2015-01-19T18:02:52.351+0000","up_votes":1,"down_votes":0,"body":"me playing {{champion:29}}  and managing to 1v3 a vayne, leona, and a talon and walked away with 15 health remaining","replies":[]},{"poster":"Mega MilkJugs","date":"2015-01-19T17:58:45.355+0000","up_votes":1,"down_votes":0,"body":"When someone treads on my shroom while running away with 5 hp its pretty hilarious","replies":[]},{"poster":"Toby Flenderson","date":"2015-01-19T23:58:04.133+0000","up_votes":1,"down_votes":3,"body":"Getting a penta with {{champion:157}} as i was getting yelled at by my parents because we had to leave i finished the game pissed at my parents happy with the game i threw my headsets down and yelled lets go! My mom was pissed my friends laughed at me cuz I was all pissy about my parents but then excited about a shitty penta with the easiest champ to get it with","replies":[]}]}