{"poster":"xFixonaro","date":"2017-10-19T12:28:15.855+0000","title":"Ständig Freundschaftsanfragen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo,\nseit gut einer Woche bekomme ich nahezu jeden Tag 2-3 Freundschaftsanfragen von Accounts mit denen ich noch nichts zu tun hatte.\nDiese Accounts sind meistens lvl 10-20 und nie wieder on nachdem sie mich geaddet haben.\nHat einer einer Idee woran das liegen k&ouml;nnte?","replies":[{"poster":"MrSnowy","date":"2017-10-19T14:12:29.370+0000","up_votes":1,"down_votes":0,"body":"Ablehnen ist nicht so effektiv wie Blocken. Solche Spammer sind immer mit der block am besten zu bekämpfen und man hat dann in der Regel viel schneller ruhe.\nWie RM schon schrieb waren es früher schon solche FAs, die sind heute auch noch vermehrt unterwegs, dass ist aber wie immer kurz vor Season ende, damit sie die Accounts schnell auf anderen Seiten für Cash verkaufen können. ^^","replies":[{"poster":"xFixonaro","date":"2017-10-19T14:29:35.434+0000","up_votes":1,"down_votes":0,"body":"ok danke für den tipp :^))","replies":[]}]},{"poster":"RM Heartmeander","date":"2017-10-19T12:59:40.136+0000","up_votes":1,"down_votes":0,"body":"Einfach ablehnen diese Anfragen.\nEs gab früher mal ne Zeit, da hattest du jeden Tag mehrere Anfragen von level 1-10 Acc (eher level 1) die Spambots waren.\nHast du sie angenommen, haben sie dir ne Nachricht geschickt entweder mit Boostingangebot oder ein Scamlink.\nAm besten einfach auf op.gg nach dem Namen suchen und da sieht man recht fix, ob es sich um nen Spieler oder Bot handelt.\n\nIch schätze mal entweder hast du irgendwo in nem Forum mal deinen Beschwörernamen geschrieben oder es ist so wie bei diesen Telefonumfragen.\nIrgendeinen Namen eingeben und wenn der annimmt, kommen noch mehr.\nBzw. an sich kann man auch einfach auf op.gg irgend nen Namen eingeben und schauen ob er exestiert und dann FA schicken.\n\nIch z.B. nimm keine Anfragen an wenn die nicht level 30 sind oder ich hier im Forum was geschrieben hab. (und ich schaue meistens nach ob einer unter 30 auch wirklich spielt)","replies":[{"poster":"xFixonaro","date":"2017-10-19T14:29:03.017+0000","up_votes":1,"down_votes":0,"body":"ok danke für den tipp :^)","replies":[]}]}]}