{"poster":"wolfdota","date":"2019-10-14T22:00:54.299+0000","title":"rework forajido para Graves","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"En realidad los aspectos High Noon están buenos, pero si a estos campeones les pusieron sombrero e incluso algunos arden en llamas.\r\ncreo que el primer forajido y vaquero del LoL ( Malcolm Graves) se merece un poco de cariño en su base skin . algo así como un sombrero por lo menos o un reworrk visual a la altura de los demás high noon skins.\r\n\r\nmi humilde opinión. creo que no le costaría nada, mas que tiempo a @riotgames.\r\ny a muchas personas les encantaría.\r\nsi es verdad que la compañía le interesa el pensamiento de la gente ese debería ser su paso a seguir en la linea de high noon skins.","replies":[{"poster":"diabetín","date":"2019-10-14T23:08:24.157+0000","up_votes":1,"down_votes":0,"body":"que hay de jarvan y vayne matadragones?","replies":[{"poster":"wolfdota","date":"2019-10-15T01:16:10.208+0000","up_votes":1,"down_votes":0,"body":"a diferencia de graves y los skin de forajidos, los matadragones todos tienen armadurao vestimenta completa. no como graves que para verse verdadero outlaw o forajido no lleva ni sombrero y en algunos server ni el habano.\n\nashe cowboy, tiene mas pinta de vaquero que graves, ni que decir de lucian.","replies":[{"poster":"diabetín","date":"2019-10-15T01:34:17.747+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=wolfdota,realm=LAS,application-id=v7qsfXsE,discussion-id=O7uu4FgZ,comment-id=00000000,timestamp=2019-10-15T01:16:10.208+0000)\n>\n> a diferencia de graves y los skin de forajidos, los matadragones todos tienen armadurao vestimenta completa. no como graves que para verse verdadero outlaw o forajido no lleva ni sombrero y en algunos server ni el habano.\n> \n> ashe cowboy, tiene mas pinta de vaquero que graves, ni que decir de lucian.\n\nlucian? hablas de la skin, cierto? porque el aspecto base es completamente diferente al de un forajido xd\nigual graves no necesariamente es un vaquero, recuerda que es de aguasturbias, realmente deberia tener mas pinta de marino que de cowboy\nPD: ni idea de que ashe tenia una skin de cowboy","replies":[{"poster":"wolfdota","date":"2019-10-15T18:28:19.506+0000","up_votes":1,"down_votes":0,"body":"Si, lo digo por las skin. pues la excusa que no le hacen una skin forajido a graves es porque supuestamente ya es uno. pero ni sombrero tiene. y muy cierto lo que decís que graves es de aguas turbias. paro aun asi tiene una skin de  pirata (aguas turbias) con twisted fate y otros mas. \nrecuerdas el trundle clasico le hicieron rework y ahora parece del frejord. eso mismo pudieran hacer con graves, pero solo rework visual. y hacerle honor al primer outlaw de lol.","replies":[]}]}]}]},{"poster":"Vąletõ Jõestąr","date":"2019-10-14T23:24:01.831+0000","up_votes":1,"down_votes":0,"body":"Yo quiero un lee sin delantero de boquita","replies":[]}]}