{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2017-07-11T05:48:23.446+0000","title":"The OPL returns this weekend","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Nurd","date":"2017-07-11T10:32:49.618+0000","up_votes":4,"down_votes":0,"body":"#FreeTyler1","replies":[]},{"poster":"Tempered in Salt","date":"2017-07-12T10:57:38.873+0000","up_votes":1,"down_votes":0,"body":"OCE teams are bad, OPL is a Meme and the communication and coordination among players is laughable compared to higher tier teams overseas (legit why do you think there are only 5 comments in this comment section). I mean did you see how Dire Wolves performed at MSI?, heard that one of the players didn't even talk with his team the entire game.)\\ Start talking, schemeing and putting all the info together to pull a winning strat. Eyes out for opportunities and know when to cut losses. Legit if you mic check a team during a game you should hear everyone relaying info to each other about what they see and know, 5 pairs of eyes are better than 1. Seriously, step up your game because we're still the laughing stock of the LOL esports landscape.","replies":[{"poster":"Dimensjon","date":"2017-07-13T06:06:31.042+0000","up_votes":2,"down_votes":0,"body":"mate, I scouted you on op.gg yo0ur bronze 5.... your opinion is fare but to be honest how you are coming accross is pretty shit mate, I am not saying any better than you at this game, tbh im worse but camon obviously overseas has better teams but it is all about opportunity and this was OCE's first world wide event so dont be to harsh... :p","replies":[{"poster":"Tempered in Salt","date":"2017-07-14T05:37:29.288+0000","up_votes":1,"down_votes":0,"body":"1st off, I don't play ranked much but if you check my mmr it's well above average\r\n2nd fair point maybe i'm too harsh... they're not really used to the international stage and I'll grant merit that dire wolves had some good games\r\n3rd (Most important note here) Ok now that OCE has a taste of the international stage the have no excuses. The know now what it's like and they know what they have to do. Any screw ups now cannot be attributed to anything else. I'm just simply highlighting the obvious in what they should probably do... step up their game and start some proper team coordination and communication.\r\n\r\nDidn't want to start a rage or anything it's just that I'm tired of OCE being known as one of, if not the worst sever on the world with bad esports players.\r\n","replies":[]}]}]},{"poster":"Kane128","date":"2017-07-12T00:06:53.692+0000","up_votes":1,"down_votes":0,"body":"{{item:3060}} ","replies":[]},{"poster":"zDemonio","date":"2017-07-11T09:19:14.927+0000","up_votes":1,"down_votes":0,"body":"ez DW","replies":[]},{"poster":"Heff","date":"2017-07-11T07:49:35.696+0000","up_votes":1,"down_votes":2,"body":"{{champion:69}} ","replies":[]}]}