{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2019-02-05T23:52:31.231+0000","title":"Patch 9.3 Notes: Lore Edition ","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Lunar Lúx","date":"2019-02-06T03:47:35.788+0000","up_votes":1,"down_votes":14,"body":"when are you gonna make point and click ults non-existent? COUGH COUGH {{champion:1}} {{champion:90}} {{champion:26}} {{champion:91}} {{champion:238}} {{champion:30}}  etc","replies":[{"poster":"CheeseToasty","date":"2019-02-06T04:07:06.586+0000","up_votes":11,"down_votes":0,"body":"My guy, annie ult isn't point and click, but more importantly, how would you implement some of the point and click ultimates instead? lets look at zil. if his ult was a skillshot it would strictly feel worse to play as zil, or on the same team as zil. In a frantic fight there few things as disappointing as a wiffed ulti, and you can add to that the anger at watching an ally dodge your ult because they also had to dodge the cho gath rupture at the same location. How about karthus, how would you mechanically remake his ult without changing the theme of the champion? currently the r cast channel makes sense with his banshee like nature singing the dirge of his foes. if we preserve the current functionallity and change it instead to a global ulti with either linear or circular skillshots, and perhaps give 5 charges so he can hit each champ, we basically have a ezreal or xerath ulti, but in a way that gives up the unique nature and thematic of karthus' ult. To change the point and click ults in many cases would require a complete rework of many ultimates, and in many cases a rebalancing of kits, as typically point and click spells are less powerful than their skillshot counterparts as a means of balancing their reliability. ","replies":[{"poster":"XXDragonForceXX","date":"2019-02-06T08:05:12.448+0000","up_votes":2,"down_votes":1,"body":"annies is a skill shot tho, it can be missed","replies":[]}]},{"poster":"Brucinator","date":"2019-02-07T00:17:23.712+0000","up_votes":3,"down_votes":0,"body":"If those ulti's are the biggest thing you have to complain about regarding game balance, you're really not paying attention to the game state are you? lol","replies":[]},{"poster":"iPatch","date":"2019-02-07T05:02:58.363+0000","up_votes":2,"down_votes":0,"body":"Yep, let's make Zilean's ult a skill shot so that you can miss the teammate or hit another teammate who doesn't need it.","replies":[]},{"poster":"Andrei","date":"2019-02-07T07:05:11.925+0000","up_votes":1,"down_votes":0,"body":"Yiikes. I know riots balance team isn't great but I dont think advice from what I'm guessing is a bronze tier player will help them much.","replies":[]}]},{"poster":"Airstunned","date":"2019-02-06T03:08:33.063+0000","up_votes":1,"down_votes":2,"body":"{{sticker:sg-ezreal}} ","replies":[]}]}