{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2014-12-17T05:04:06.592+0000","title":"Player Behavior Design Values: Reform","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Joerick","date":"2014-12-18T05:21:02.607+0000","up_votes":5,"down_votes":1,"body":"If you want better behavior in ranked, then make the cons of playing with trolls, jerks, or people who are just bad less permanent. Every season everyone who is in Bronze, Silver and maybe Gold should have their ELO erased, or at least ignored for their new provisionals. \r\n\r\nMy logic? My first provisionals I won 4/10 and got Bronze 1, I lost a lot that year as I was still learning and I had a lot of bad luck with who I was placed with and against. The following year I won 6/10 and got Bronze 4. That is why \"ELO-hell\" is real; it's because good players suffer consequences that carry over from year to year for bad teams or just bad luck.\r\n\r\nI don't think the higher ranks need it since Platinum, Diamond and up don't have to deal with \"I start Blue with {{champion:107}} because I need mana, the bar starts empty.\" (actual quote from Bronze ELO)","replies":[{"poster":"Trcarter","date":"2014-12-18T12:43:09.310+0000","up_votes":3,"down_votes":0,"body":"First time i have ever logged in to upvote something!! that quote is gold!!!\r\n","replies":[{"poster":"Joerick","date":"2014-12-24T20:30:02.854+0000","up_votes":3,"down_votes":0,"body":"Actually, it's Bronze. XD","replies":[]}]},{"poster":"rishd","date":"2015-01-07T06:43:23.728+0000","up_votes":1,"down_votes":0,"body":"*\"If you acknowledge that Elo-boosting exists, then it is impossible for \"ELO-hell\" to exist\"*\r\n-imls (lastshadow9)\r\n\r\ngit gud m8","replies":[]}]},{"poster":"Skif","date":"2014-12-18T01:16:47.768+0000","up_votes":5,"down_votes":1,"body":"I think you guys need to have a look at CS:GO system, they are doing a good job against trolls and afks, like reconnecting time, when a player doesn't reconnect after 3 min he gets banned for some period of time. \r\nYou do have similar thing when somebody leaves during champ select but why don't you have that punishment during/after the game?\r\nThanks","replies":[{"poster":"QuantumAura","date":"2014-12-18T09:10:08.545+0000","up_votes":0,"down_votes":1,"body":"This isnt in my opinion a good idea because sometimes windows 8 can happend and its like 'I see your playing league, how bout i update your pc' then youd get a ban? Or if you just have a short circuit and it cuts out for a second, a ban? Seems its a bit harsh. But i do think the leaver buster system does need to get fixed with people staying in spawn and yelling at team but not actually quitting, but avoiding leaver buster cause they move.","replies":[{"poster":"Trcarter","date":"2014-12-18T12:45:47.694+0000","up_votes":2,"down_votes":0,"body":"Easy fix for game trolls that dont do anything but rages... check games that if movement is detected but no damage inflicted for anything then ban them for the night\r\n\r\nso sick of trolls\r\n\r\nand afk... to deal with afks - if no data for 3 mins during a game... send auto ping and if no response then you know its a crash but if ping received back then ban them for afk.\r\n\r\nalso sorry about my spelling and gramma... im an old man\r\n","replies":[]}]},{"poster":"GDragonSteal","date":"2014-12-18T05:58:37.851+0000","up_votes":2,"down_votes":0,"body":"I agree","replies":[]}]},{"poster":"PremAutopsy","date":"2016-05-02T13:23:59.427+0000","up_votes":1,"down_votes":0,"body":"So its ok to troll in unranked games then?","replies":[]},{"poster":"Cireric","date":"2015-01-26T05:48:18.592+0000","up_votes":1,"down_votes":0,"body":"i have a question about the chat restrictions if you have been restricted from chat and then you play the 14 games and someone else reports you for offensive language once do you get restricted from chat for 14 more games because currently that has happened to me and im sick of it","replies":[]}]}