{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-04-06T05:19:56.008+0000","title":"State of the Season: Coming up on mid-season","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Wheelibin","date":"2016-04-06T20:50:37.890+0000","up_votes":26,"down_votes":1,"body":"What does Riot think about how many tanks are often just being able to outright out-damage bruisers and carries, despite building little to no damage items at all?\r\n\r\nAs it is, TK is able to assassinate lone carries by himself without building any damage whatsoever. \r\n\r\nIs this a design philosophy? That tanks shouldn't rely on utility and teamwork, but raw stats?","replies":[{"poster":"Bong Warder","date":"2016-04-06T22:07:17.445+0000","up_votes":8,"down_votes":8,"body":"***","replies":[{"poster":"Domnomnomify","date":"2016-04-06T22:38:25.428+0000","up_votes":7,"down_votes":4,"body":"_deleted_","replies":[]}]},{"poster":"CookieButtLav","date":"2016-04-07T19:27:34.834+0000","up_votes":1,"down_votes":1,"body":"{{item:3035}} {{item:3156}} {{item:3147}} {{item:3142}} \r\n:)","replies":[{"poster":"xXFa2eScOpErXx","date":"2016-04-11T06:54:51.069+0000","up_votes":1,"down_votes":0,"body":"WHY {{champion:238}} WHY!","replies":[]}]}]},{"poster":"4dakill","date":"2016-04-07T02:01:25.078+0000","up_votes":11,"down_votes":1,"body":"Lets be honest,\r\nStar Guardian {{champion:136}} \r\nHow have Riot not seen this yet","replies":[]},{"poster":"Corehog","date":"2016-04-06T23:46:55.833+0000","up_votes":7,"down_votes":0,"body":"I've had this thought on towers for a while, why don't they do True Damage?\r\n\r\nIt would be nice to feel like diving is a great risk but with a great reward. As they are currently, towers feel more like an inconvenience to a diver, rather than a risk. \r\n\r\nAnd if not True Damage, why do towers only do Physical Damage and no Magic Damage? \r\n\r\nAgain, if towers did both Physical and Magic damage, the risk would be greater, but that's the whole point of diving.","replies":[{"poster":"Aryana","date":"2016-04-07T01:25:14.902+0000","up_votes":7,"down_votes":0,"body":"That would be great if they implemented something like that, i see so many tanks with tons of armor just tanking turrets for their team. Perhaps rather than changing the damage types towers should get reinforced by the presence of allied champions?","replies":[{"poster":"BadTurnip","date":"2016-04-10T11:06:22.682+0000","up_votes":2,"down_votes":0,"body":"I particularly love the idea of champions strengthening towers. That would be more interesting as to do that, it might mean abandoning a lane to save another but it could be very fruitful too.","replies":[]}]},{"poster":"Kiwi DoFFa","date":"2016-04-07T09:51:19.636+0000","up_votes":5,"down_votes":0,"body":"added magic damage for sure... teams just build armour and then its dont even notice tower taking 7-8 hits still buckets of health left.. there would be far more strategy and questions asked b4 diving a tower... get kill quick get out or you will be outplayed... i guess im saying towers arent respected anymore... and they should be, 2v1 bot you should feel safe under your tower at full health. or whats the point in having a tower?\r\n","replies":[]},{"poster":"The Mark Show","date":"2016-04-07T15:51:38.827+0000","up_votes":4,"down_votes":0,"body":"Vote physical and magic damage from turrets for president!","replies":[]}]},{"poster":"Tomo7182","date":"2016-04-06T22:51:56.513+0000","up_votes":5,"down_votes":2,"body":"Illioas late game is weak????? She is the 1v5 champion that builds pure tank and still gets a pentakill and takes 0 damage when she gets a 5 man ult.","replies":[{"poster":"Unload The Toad","date":"2016-04-07T06:38:39.110+0000","up_votes":3,"down_votes":0,"body":"if you play Illaoi into even a remotely good team this will never happen, she is just too easy to kite and run away from, she needs flash to go in plus a hundred other factors that make her just straight up weak late game","replies":[{"poster":"iFlay","date":"2016-04-07T08:23:19.658+0000","up_votes":1,"down_votes":0,"body":"And CC counters her... She can't ult if her keyboard is \"broken\" by a Leona or nautilus. {{champion:89}} {{champion:111}} {{item:3070}} ","replies":[{"poster":"Numemon","date":"2016-04-07T12:35:40.916+0000","up_votes":1,"down_votes":0,"body":"Correct me if I'm wrong but I thought they changed her ult so that hard CC can no longer cancel it?","replies":[{"poster":"TLC Prés4ge","date":"2016-04-09T06:05:53.001+0000","up_votes":1,"down_votes":0,"body":"Yeah but if they hard cc she can't W and that is what gives her damage.","replies":[]}]}]}]}]},{"poster":"z3ro","date":"2016-04-07T03:32:48.951+0000","up_votes":3,"down_votes":0,"body":"Still waiting on yorick rework","replies":[]},{"poster":"Cucked by      S","date":"2016-04-07T01:22:51.652+0000","up_votes":3,"down_votes":0,"body":"What are your thoughts on Swain? I'd really like to know if you plan on buffing him/modifying him. Maybe even a rework?\r\n\r\nIf you can't do anything like that, maybe buffing his early game would help as he's way too weak early and gets crushed by most champs.","replies":[]},{"poster":"nicholaswells100","date":"2016-04-07T12:10:12.952+0000","up_votes":4,"down_votes":1,"body":"Riot i honestly think you should add a replay system. Through the use of a replay system implemented into League of Legends players could have a look at their mistakes, share replays to teach friends and have the ability to save the replays. \r\n\r\nIn addition, you also need to add a training system where the new players can learn skills( eg. CSing, the laning phase, input buffering, kiting).\r\n\r\nLastly i think Riot should add more maps since we are stuck with the normal summoners rift. i know that there are other maps but we need another good one like summoners rift.","replies":[]},{"poster":"NoxPegasus","date":"2016-04-06T23:34:25.419+0000","up_votes":4,"down_votes":1,"body":"I feel like this years april fools event wasn't handled that well on riots side of thing, URF even though it's coming in the rotating game mode is something that has been tradition since league was pretty much new weather it be talk about it as a joke on the rift into a story about a manatee being hunted down by warwick and turned into a suit which was sold as a skin for 50 rp and had all the proceeds go to charity, into the gamemode itself which was loved by all. When it was announced that urf mode was not going to be on april 1st I and many other people thought it was a joke like how every other urf game mode has been previously announced in some wacky unbelievable way then when the time comes and there's really no urf mode of course everyone is going to be upset. however the no urf mode isn't what has annoyed me the most, what has annoyed me is the lack of damage control there was for the hundreds of thousands of people pissed off at riot for their decisions, there was not 1 riot reply to anything about urf on april, not 1 thread on reddit about it from a rioter just complete  ignorance for the player base. I feel that much more could have been done about this situation and more communication between company and customer would have been well appreciated considering how much of a commotion was caused.\r\n\r\nrant over.\r\nall in all, pretty good season I'm happy with these recent reworks and champs that have been released and I am having alot of fun playing with the most recent and most unique champion yet Aurelion Sol. gg rito{{champion:136}} ","replies":[{"poster":"Krausy13","date":"2016-04-07T12:31:44.250+0000","up_votes":2,"down_votes":1,"body":"QQ\r\n\r\nURF has only been around the last 2 years. They're still doing it, but re-releasing it on April Fools just feels a bit stale. Personally I couldn't care less. It's fun yes, but after a while, it just starts to feel boring. ","replies":[{"poster":"Adolf Pickler","date":"2016-04-09T13:21:25.955+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure what they meant by URF being around since basically the beginning was the Urf the Manatee April Fools, not just the gamemode.","replies":[]}]}]},{"poster":"Swade","date":"2016-04-06T19:42:13.597+0000","up_votes":6,"down_votes":3,"body":"So is Riot happy with the state of Last Whisper? It feels so worthless and is one of the reasons tanks are broken.","replies":[]},{"poster":"the true Viper","date":"2016-04-07T03:08:30.693+0000","up_votes":1,"down_votes":2,"body":"I get that you guys are tying to spice things up and all that. I play {{champion:1}}. I can tell you that she is fine. She get caught out like the rest of them and with the last changes she is only a power house late game. Even then can get smashed by most champions. {{champion:63}} {{champion:268}} {{champion:84}} {{champion:122}} to name a few. The AP ratios are perfect and the Tibbers runs faster with her shield is great. Build {{champion:1}} For CC or tank or plain boom. Of course you have to give up things to play her each way but that's the beauty of this game break the meata and it just might work. Mostly no but some times it works. {{champion:1}} Is in a good spot right now. perfect not overly squishy or tank and you need a decent amount of AP to blast someone into oblivion. I'm talking at least 400 plus. If you have let her get to that point It's your own fault. Also with her short range she has to get damn close to do it. If It an't broke don't try and fix it. {{champion:134}} Is in need of some TLC  for sure the others I'm not so sure about","replies":[{"poster":"BUFF TAHM KENCH","date":"2016-04-07T05:59:57.068+0000","up_votes":3,"down_votes":0,"body":"Annie is not really in a good spot right now. Sure, in balance terms she's fine, but in feel she needs some changes. It doesn't feel good when Annie flash combos your entire team, there isn't enough combo potential and there's literally no skill involved on her end. It also feels bad for Annie when she is forced to use flash defensively, as it is pretty much required to get your abilities off.\r\n\r\nHonestly I'm really excited about the mage updates, pretty much every update so far has successfully made champs stronger while still keeping the reason why they're fun intact.","replies":[{"poster":"the true Viper","date":"2016-04-08T05:27:27.394+0000","up_votes":1,"down_votes":0,"body":"OK you got me there. Yeah {{champion:1}} can flash end somebody but so can a few others. Late game of course. She is a Mage. After those spells are on cool down see is a sitting duck. I have been blown to bits by {{champion:1}} {{champion:161}} {{champion:63}}. Yes it feels unfair but she needs to get close. Riot nerfed her range so she can't jut haha tibbers from lets say the other side of dragon pit's wall. Yes it would to be good to see some more peel in her kit. I feel it would either destroy her or put her is the same league as {{champion:55}}. Before they nerfed her. And we don't want another one of those. Running over the rift. One {{champion:55}} is bad enough thanks","replies":[]}]},{"poster":"SupportThreshold","date":"2016-04-07T14:17:59.355+0000","up_votes":1,"down_votes":0,"body":"annie on any midlaner, tibbers stun nuke at lvl 6 and %99 of JG will gank + camp for free kills, she is so broken, you hug tower take one auto then nuke the whole team with {{item:3285}}, {{item:3003}} and {{item:3157}} if they Qss the stun early.","replies":[{"poster":"the true Viper","date":"2016-04-08T05:18:22.080+0000","up_votes":2,"down_votes":1,"body":"That's 8k worth of items there. If she's got that she has done more than tower hug.","replies":[]}]},{"poster":"iFlay","date":"2016-04-07T08:16:35.917+0000","up_votes":1,"down_votes":0,"body":"{{champion:1}} Annie has nearly the biggest auto attack range in the game other than {{champion:51}} and {{champion:18}} doesn't she? Correct me if I am mistaken. Haven't played since patch 6.1, getting back into league now.","replies":[{"poster":"the true Viper","date":"2016-04-08T05:30:07.756+0000","up_votes":1,"down_votes":0,"body":"They nerfed it about a patched or so ago. So she can't nuke you from faraway and made AD {{champion:1}} a distant bad dream.","replies":[]}]}]},{"poster":"ninjanomikz","date":"2016-04-07T00:34:03.087+0000","up_votes":3,"down_votes":3,"body":"God this game is getting boring, worst part is they're not even giving us solo que I started out this season playing a tonne of games now it's like once a week maybe","replies":[{"poster":"Aryana","date":"2016-04-07T01:23:33.510+0000","up_votes":2,"down_votes":0,"body":"what are you talking about when you say \"they're not even giving us solo que\"? you can easily just queue up for ranked games by yourself. is there something i'm missing here?","replies":[{"poster":"A is for Atlas","date":"2016-04-07T02:08:01.968+0000","up_votes":3,"down_votes":2,"body":"Queuing by yourself into a potential 2-4 man premade is not an accurate representation of a player's individual skill.\r\n\r\nAlso people who queue together are generally less likely to assist any of their teammates that aren't in their premade, and tend to gang up on them in chat if they're not doing well.","replies":[{"poster":"Krausy13","date":"2016-04-07T12:27:12.885+0000","up_votes":2,"down_votes":0,"body":"It's a team game. Why does it need to be a representation of individual skill? It needs to be a representation of how well you can fit into and work as a part of a team to achieve the objective.","replies":[{"poster":"ninjanomikz","date":"2016-04-08T09:08:23.806+0000","up_votes":2,"down_votes":0,"body":"how the fuck is queing up with 4 other people who are all playing together and I have no idea who they are team play? ","replies":[]},{"poster":"I Like Peaches","date":"2016-04-08T11:08:18.690+0000","up_votes":1,"down_votes":0,"body":"Sorry Ninjanomikz, but that's on you if you've got no one to play with. It's ultimately a team game and always has been.","replies":[]}]},{"poster":"Aryana","date":"2016-04-07T02:46:50.801+0000","up_votes":1,"down_votes":0,"body":"Fair enough thanks for the clarification","replies":[{"poster":"ninjanomikz","date":"2016-04-08T09:08:50.958+0000","up_votes":1,"down_votes":0,"body":"What that dude said about yolo que","replies":[]}]}]}]}]},{"poster":"Arka","date":"2016-04-07T00:04:54.599+0000","up_votes":2,"down_votes":2,"body":"I think the death timers need to be long late game, so you have time to get objectives like baron or 5th dragon after getting 1 or 2 picks, but I agree that you should not be able to strait up win the game after team wiping then clearing an entire lane of towers and inhibs during their death timers.\r\n\r\nWhat if killing inhib and nexus towers lowered the death timers on the enemy teams? So if you team wipe and you have a bunch of towers to push through you will get through some but not all of them, before the enemy team has spawned.","replies":[{"poster":"ProfessorFunk","date":"2016-04-08T06:12:16.428+0000","up_votes":2,"down_votes":0,"body":"Ohhh I like your thinking.\r\n\r\nWhat about that losing your inhibitor raises your death timers slightly? Playing into the whole 'what are they inhibiting..'\r\n\r\nWould make them a way more meaningful objective to take and defend. Or would it be too much that they're already pumping out super minions, to add longer timers on top would be kicking you when you're down?\r\n\r\nThoughts anyway... ","replies":[{"poster":"TLC Prés4ge","date":"2016-04-09T06:11:17.291+0000","up_votes":1,"down_votes":0,"body":"That is a really good idea except when you lose all 3 inhibs, if you leave base you get crushed by winions.","replies":[]}]}]},{"poster":"L K","date":"2016-04-07T03:53:47.207+0000","up_votes":2,"down_votes":2,"body":"nerf ekko pls","replies":[{"poster":"Pappa Nut","date":"2016-04-07T10:59:37.508+0000","up_votes":2,"down_votes":1,"body":"no pls ekko is love ekko is life\r\ni have been using tank ekko since the beginning of the season and now all the youtubers are saying how broken he is so now he'll be nerfed :'c\r\n","replies":[]},{"poster":"I Am Pyro","date":"2016-04-07T07:14:56.807+0000","up_votes":2,"down_votes":1,"body":"Nope. {{champion:245}} Is bae","replies":[{"poster":"KappaFish","date":"2016-04-11T04:21:17.190+0000","up_votes":1,"down_votes":0,"body":"I got {{champion:245}} in the free champion thing and mained him for a few weeks. TBH he is a bit strong but a metric crapton of skill is needed to do the maximum ammount of damage.\r\n\r\nYes he might need a little nerf to his Passive and R damage but other than that he is fine the way he is.\r\n\r\n_Hekko is luv, Hekko is lief_","replies":[]}]},{"poster":"FaZeRunemove","date":"2016-04-07T07:14:40.930+0000","up_votes":2,"down_votes":1,"body":"agree","replies":[]}]},{"poster":"ReverseForward","date":"2016-04-06T19:32:01.166+0000","up_votes":2,"down_votes":1,"body":"First comment! :3 {{champion:83}} rework plz","replies":[]},{"poster":"Akemi Fire","date":"2016-04-11T08:07:14.823+0000","up_votes":1,"down_votes":0,"body":"Have you ever thought to undermine {{champion:245}} {{champion:104}} {{champion:105}} ?These champions are too op.I think they have seriously affected the balance of the game it can weaken them.","replies":[]},{"poster":"Terbalt","date":"2016-04-11T01:42:36.397+0000","up_votes":1,"down_votes":0,"body":"Okay, so I think you need to work on turret target acquisition. I've lost count of how many times I've been under tower being harassed or engaged by enemies who are completely within turret range, and staying there, and the turret continues to target minions. I've also lost count of how many times I've been continuously attacked by towers whilst being well and truly outside of tower range (standing on the other side of the heal relic pad on Howling Abyss as Ezreal, for instance).","replies":[]}]}