{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-07-25T18:39:42.451+0000","title":"Rotating game mode queue now live!","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"uwu Daddy uwu","date":"2016-07-29T02:32:29.932+0000","up_votes":10,"down_votes":1,"body":"i genuinely don't understand how Riot can't see how annoyed players are getting that Urf is never on the rotating game mode queue, it's what the vast majority wants so why isn't it being put into the queue? you ask for feedback and then ignore it.","replies":[]},{"poster":"N4R","date":"2016-07-30T01:29:13.839+0000","up_votes":6,"down_votes":0,"body":"until they put URF back to rotation I will stop playing this game.\r\nOverwatch  and POE are now daily routine.\r\n","replies":[]},{"poster":"F0xes","date":"2016-07-29T05:50:30.201+0000","up_votes":6,"down_votes":0,"body":"Where is URF? Where's DOOM BOTS. Instead of being \"random\" each week, we should be able to vote for the game modes. There should be a weekly poll.","replies":[{"poster":"ShadowEvelynn","date":"2016-08-01T04:07:49.875+0000","up_votes":2,"down_votes":0,"body":"'Rotating' is what it's called, why is it suddenly RANDOM; game mode Que?\r\nJust saying but we should have seen URF again, I can't see why they are so stubborn in not changing one of the upcoming weeks into URF, then putting all their game modes in an order and leaving it that way, no 2 weeks of this or no weeks of that.","replies":[]},{"poster":"BurningAvalanche","date":"2016-07-30T12:52:32.587+0000","up_votes":2,"down_votes":0,"body":"I don't mean this to be rude but knowing the community, URF would be chosen every week :/","replies":[]},{"poster":"Exi","date":"2016-07-29T15:05:02.923+0000","up_votes":2,"down_votes":1,"body":"Doom bots is still being worked on, it is a code heavy mode and needs to be updated for new champs, reworks etc.","replies":[]}]},{"poster":"Olli","date":"2016-07-29T06:20:29.873+0000","up_votes":7,"down_votes":1,"body":"Absolute Joke of a company. Released Ascension 4 times in 2 months. Asks for Feedback, doesn't listen. Don't release URF and wonder why player volume is low on the weekend like; \"Hurr durr why don't they like Nexus Siege\" Idiots.","replies":[{"poster":"Devils Advocate","date":"2016-07-29T19:51:20.731+0000","up_votes":1,"down_votes":6,"body":"Cause OCE is full of spoilt kids who whinge when they dont get what they want, but you know. Not all of us want URF all the time. ","replies":[{"poster":"fakersenpai101","date":"2016-07-30T00:31:17.750+0000","up_votes":6,"down_votes":0,"body":"that does not make sense. not giving us urf because we want urf? i don't get it riot would make WAY more money if they included urf a bit more because more people would play on weekends rather than go play overwatch or pokemon go and especialy when quite a bit of youtubers are quiting league.\r\n","replies":[]},{"poster":"Ramjo","date":"2016-07-29T22:51:32.660+0000","up_votes":6,"down_votes":0,"body":"we get it, you dont like urf. stop acting like it isnt the most popular game mode though.","replies":[]}]}]},{"poster":"fakersenpai101","date":"2016-07-30T00:27:57.017+0000","up_votes":5,"down_votes":0,"body":"rito u ask for feedback and we give you feedback and you ignore it.....\r\nmost people just want urf and doombots","replies":[]},{"poster":"Ramjo","date":"2016-07-29T02:55:58.743+0000","up_votes":6,"down_votes":1,"body":"F U Riot, this is the stupidest game mode. you tried to make a worse game mode with nexus siege but failed just...\r\neveryone wants to play URF and you just keep irritating players by not even including it in the rotation at all.\r\nwhy you keep ignoring your player base totally confuses me","replies":[{"poster":"Devils Advocate","date":"2016-07-29T19:49:21.408+0000","up_votes":1,"down_votes":2,"body":"not everyone wants to sandbox 10champs with no CD's","replies":[{"poster":"Ramjo","date":"2016-07-29T22:44:20.888+0000","up_votes":5,"down_votes":0,"body":"sorry for my use of the word 'everyone' and replace it with 'most' so you can stop feeling like the minority is being misrepresented","replies":[]}]}]},{"poster":"Ghostill","date":"2016-07-30T07:37:09.633+0000","up_votes":4,"down_votes":0,"body":"Yo Riot Why No URF?????{{item:3070}} ","replies":[]},{"poster":"Flamewalker","date":"2016-07-30T01:03:10.979+0000","up_votes":4,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}} we want urf badly\r\n","replies":[]},{"poster":"WolfxFish","date":"2016-07-30T06:27:45.644+0000","up_votes":3,"down_votes":0,"body":"Just want to play some urf laddddd","replies":[]},{"poster":"Thomaster35","date":"2016-07-29T05:41:55.797+0000","up_votes":5,"down_votes":2,"body":"I want URF as well, and i do believe that it is overdue for its next rotation, but i think riot is trying to give players an experience with different gamemodes that they may have missed instead of just one game mode every week. {{sticker:zombie-nunu-bummed}} ","replies":[{"poster":"Ramjo","date":"2016-07-29T22:46:38.347+0000","up_votes":3,"down_votes":0,"body":"we have had ascension and one for all 3 times since the last urf. the issue isnt that its not urf every week, the issue is that riot have stopped including it in the rotation at all.","replies":[]}]},{"poster":"SmoothMoonBeast","date":"2016-08-04T20:59:01.585+0000","up_votes":2,"down_votes":0,"body":"Does anyone else hate One for All?","replies":[]},{"poster":"Sloth Almighty","date":"2016-08-07T09:33:56.460+0000","up_votes":1,"down_votes":0,"body":"\"We’re looking for your feedback as we go, so let us know.\"\r\n\r\nEvery rotating game mode, I come here and read the feedback. A large majority of comments always ask when urf is coming, why is urf not here, why is the queue not rotating rather picking the ones least popular....\r\n\r\nThis is your feedback Riot. Not every one loves URF, not everyone loves One for All, not every one loves poro king, hexakill, nexus seige.. That is why a rotating game mode should be exactly that. Rotate all the game modes, without playing 1 mode more than twice without going through the whole queue. Then everyone can be happy getting the modes they like.\r\nThis is your feedback, not just from 1 player, but a majority of players.","replies":[]},{"poster":"Yuck Fi","date":"2016-08-01T11:58:13.481+0000","up_votes":1,"down_votes":0,"body":"why poroking,hexakill,definetly not accension,nexus siege why\r\njust make a voting system and whatever one gets picked gets to be rotation\r\nthen when the weekend is over, just make another voting system and make sure that the game that was voted last week can't be voted again for 3 more weeks","replies":[]},{"poster":"Flamewalker","date":"2016-07-30T01:04:53.544+0000","up_votes":1,"down_votes":0,"body":"1. {{item:2050}} what is this item?\r\n","replies":[]},{"poster":"BoredHouseWife","date":"2016-07-31T22:48:47.161+0000","up_votes":1,"down_votes":1,"body":"Poro King should be a permanent game mode. It's a bit annoying that it's only available between 11 am - 3 am because my friends and I wake up super early and we are not happy that we can't play it and have to wait till 11 am. Just saying.","replies":[]},{"poster":"Flyedlice","date":"2016-07-30T17:36:30.064+0000","up_votes":2,"down_votes":2,"body":"He everyone :)\r\n\r\nJust a quick thank you to \"Riot\"  I love Poro King mode!\r\n\r\nAs a former Rift only player of several hundred games and former scoff at Aram players,  I got bored of ward, ward clear, check baron & ping ping ping..\r\n\r\nEventually lead to a casual Aram, then oh! this is actually epic! Full on carnage non stop, oh the blood lust :3   The Poro King different mode adds a little spice to this mode. \r\n\r\nI'd love Poro King as full time feature map and not only a time based one. I don't understand how this would be only time based feature.  Something, something player numbers?  Well more variety more players? right?..  Have to admit only one mode does get stale after awhile.\r\n\r\nEnjoying P.K while I can  :)","replies":[]},{"poster":"FrankTheStar","date":"2016-07-30T07:32:46.346+0000","up_votes":1,"down_votes":1,"body":"lmao nemesis draft. where the teams pick each other support characters and the worst champions in the game. FUN FUN FUN FUN","replies":[]},{"poster":"iPatch","date":"2016-07-29T22:44:28.497+0000","up_votes":1,"down_votes":1,"body":"Nemesis Draft! ","replies":[]},{"poster":"TheDeathlyCow","date":"2016-07-29T07:39:33.421+0000","up_votes":1,"down_votes":1,"body":"Nemesis draft!!!!!!!","replies":[]}]}