{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-08-05T03:53:13.054+0000","title":"Riot Pls","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Dyl","date":"2015-08-05T22:07:40.017+0000","up_votes":9,"down_votes":0,"body":"You spelled _Rito_ wrong :/","replies":[{"poster":"AHQ Ziv","date":"2015-08-05T22:12:24.232+0000","up_votes":1,"down_votes":0,"body":"Yes, they did ;)","replies":[{"poster":"Saphixia","date":"2015-08-05T23:38:12.766+0000","up_votes":1,"down_votes":0,"body":"Dont worry its a common spelling mistake\r\n","replies":[]}]}]},{"poster":"BadLuckFollowsMe","date":"2015-08-05T23:31:08.214+0000","up_votes":6,"down_votes":2,"body":"Reading through the \"What's next\" list and the focus list.\r\nWhere\r\nIs\r\nDominion\r\nAnd\r\nTwisted Treeline.\r\nSeriously, in the recent Q&A someone asked, Riot gave an answer that was basically \"When the community gives us enough feedback about it, we'll think about it\", and then proceeds to blatantly ignore everyone else.\r\nI'm getting really sick of this.\r\nThere IS feedback, somebody asks every bloody day. There is NO OTHER server that doesn't have full queue options, and we've been going for years. This is NOT beta anymore.\r\nI don't want \"Oh yeah sure, we'll think about it.\" I want to know WHY it hasn't happened, WHAT'S stopping it from happening, and WHAT we can do to make it happen.\r\nI'm sick of the constant lack of respect, we deserve information not dodges.\r\n\r\nTHERE'S your \"Riot pls\".","replies":[{"poster":"Sephyre3","date":"2015-08-06T04:49:17.158+0000","up_votes":5,"down_votes":0,"body":"No matter how I answer this it's going to be a disappointing one. I wish I could say 'we're turning them all on right now' but I can't.\r\n\r\nTwisted treeline is not in a place where we can expand it beyond the current availability yet. It's healthy as it is, but it has not grown to the point of further expansion. Ranked Twisted Treeline has stricter population requirements than Normal 3v3 and again is not currently in a place where we can open it.\r\n\r\nIt is the same for Dominion, etc. If we do get to a place where we can open it, we'll announce it on the boards, and we have passionate Rioters fighting for each and every mode in every evaluation meeting but at the end of the day it's about going through the numbers and making sure the queue would be a healthy experience. Right now it would not be but hopefully in the future it will.","replies":[{"poster":"Microwave","date":"2015-08-06T18:33:46.383+0000","up_votes":1,"down_votes":2,"body":"\"lets just shove new event based skins at players to make more money\" \r\n\"TT/dominion? what are they?\"\r\n\"lets not make sandbox mode because we are worried players might get too good at the game\"\r\n\r\nim not even sure if you guys know **exactly** why there wont be a sandbox mode, all these vague statements and no clear explanation...do you guys even know what the risks are of having sandbox mode?","replies":[{"poster":"MrRadioactuveS","date":"2015-08-07T01:42:56.078+0000","up_votes":3,"down_votes":0,"body":"Sorry but if you really think that you are a fool. 1. no one is forcing you to buy new skins they release 2. its not that easy, you try making a game with 60 million+ players and making them all happy 3. they diddnt want to put in a sandbox mode because they diddnt want people to spend all their time in sandbox but rather playing the game and learning in the game. sandbox mode leads to people making this one \"fool proof\" strategy that \"wins every time\" and are convinced that it will win every time and wont change and lear like you  were intended to. feel free to disagree but that is my opinion on the matter.","replies":[{"poster":"dera era","date":"2015-08-14T04:28:32.045+0000","up_votes":1,"down_votes":0,"body":"Well they could make sandbox in different levels instead of chucking you on summs rift with unlimited gold and cdr. They could put you in a situation that is fixated and very limited to it's variety but not it's potental. That way when people go on. They learn what they want to. Get out and go try it in a norm game or if they do love sandbox enough to stay there.. It get's boring and mundane after awhile and won't hog all the traffic from norms.","replies":[]}]},{"poster":"Zorphiax","date":"2015-11-09T21:15:55.181+0000","up_votes":1,"down_votes":0,"body":"You can't just say \"Hey we want dominion and TT and doom bots and all the special game events. Otherwise you will just make que timers go like from 1-5 minutes like they are now for low elo Summoners, to 20-40 minutes like they already are for challenger Summoners.","replies":[]}]},{"poster":"Chicken4dinner","date":"2015-08-09T09:06:06.617+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sephyre,realm=OCE,application-id=pEj6Ee6n,discussion-id=ap5Ec9LU,comment-id=000b0001,timestamp=2015-08-06T04:49:17.158+0000)\n>\n> No matter how I answer this it's going to be a disappointing one. I wish I could say 'we're turning them all on right now' but I can't.\n> \n> Twisted treeline is not in a place where we can expand it beyond the current availability yet. It's healthy as it is, but it has not grown to the point of further expansion. Ranked Twisted Treeline has stricter population requirements than Normal 3v3 and again is not currently in a place where we can open it.\n> \n> It is the same for Dominion, etc. If we do get to a place where we can open it, we'll announce it on the boards, and we have passionate Rioters fighting for each and every mode in every evaluation meeting but at the end of the day it's about going through the numbers and making sure the queue would be a healthy experience. Right now it would not be but hopefully in the future it will.\n\nI am going to break this down because you guys use a lot of words where there only needs to be like 5 or 6, \n\nYou are saying that our population of players in oce is not large enough to support dominion and twisted treeline","replies":[]}]},{"poster":"DominatorV4","date":"2015-08-06T01:51:22.187+0000","up_votes":2,"down_votes":0,"body":"Yeah, I totally agree with this, its been two goddamn years, where are they?","replies":[]}]},{"poster":"RiftWarden","date":"2015-08-05T21:38:58.099+0000","up_votes":3,"down_votes":0,"body":"if rito made a campaign mode, like there's so much lore, y no campaign; Rito Pls","replies":[{"poster":"Buttsubushi","date":"2015-08-06T05:49:18.585+0000","up_votes":4,"down_votes":0,"body":"Play the Strife campaign, it is free on Steam. Then you will see just how awkward and terrible what you suggested is.","replies":[]},{"poster":"lanceiman9","date":"2015-08-06T07:47:05.914+0000","up_votes":1,"down_votes":0,"body":"I think that is a great idea and would love to see it happen. Rito pls","replies":[]}]},{"poster":"Wolfie","date":"2015-08-05T20:09:23.945+0000","up_votes":4,"down_votes":0,"body":"Riot pls.","replies":[]},{"poster":"Minpin04","date":"2015-08-05T20:50:36.329+0000","up_votes":4,"down_votes":2,"body":"Riot your amazing. BEST GAME COMPANY","replies":[{"poster":"ChocoboKick","date":"2015-08-06T07:12:52.960+0000","up_votes":3,"down_votes":0,"body":"Not the best but one of the best. They are pretty neat how they actually listen to the fans. They are pretty cool.","replies":[]}]},{"poster":"SupportThreshold","date":"2015-08-05T20:34:17.280+0000","up_votes":3,"down_votes":2,"body":"just make AllforOne and Urf a once a weekend a month thing and i'd be happy, \r\nalso can you guys update the ping system and say add these to it, Ult up in 5,10,30 second timers in smaller windows next to it, enemy ult down and have it targetable on a specific champ including friendlies, have a ping for bush warded, just work with that for now, really hope you guys do this it'd make the game so much more fun and smooth give the players what they deserve, a change from the toxic players who berate them about failing an engage or being out of place in a teamfight, also with the original ping system maybe add a feature to ping \"move here\" or \"careful\" rather the pings themselves (similar to Smite and Dota 2), i don't know why you guys haven't done this yet, but i'd dream of they day you announce it, much love <3 \r\n\r\nNerf {{champion:11}} :^)","replies":[{"poster":"FraggingBard","date":"2015-08-06T04:35:03.749+0000","up_votes":3,"down_votes":0,"body":"There's only so much you can do with pings and we're really at the limit; any more pings and there's just too many to sort out. The next step is voice chat where you can just tell people \"Yi Ult Down\".\r\n\r\nA lot of people have either Teamspeak or Skype, so rent a TS server for a few dollars a month and paste that and your Skype name into chat. A lot of people will join in, especially in Ranked.\r\n\r\nThat and get really good at typing \"ult5\" into chat. :P","replies":[{"poster":"Penny13","date":"2015-08-08T06:40:59.604+0000","up_votes":1,"down_votes":0,"body":"Why pay for Teamspeak when Curse Voice exists?","replies":[]}]},{"poster":"AHQ Ziv","date":"2015-08-05T22:14:15.056+0000","up_votes":2,"down_votes":0,"body":"If there's gonna be a million pings instead of just pinging in 4 directions everyone's probably gonna miss the ping they're going for, unless u wanna spend 20 seconds pinging instead of helping team.","replies":[]},{"poster":"Saphixia","date":"2015-08-05T23:38:56.893+0000","up_votes":2,"down_votes":1,"body":"this is the bronziest post i have ever seen","replies":[]},{"poster":"Chicken4dinner","date":"2015-08-09T09:02:59.090+0000","up_votes":1,"down_votes":0,"body":"Just ping to be careful in a bush where it is warded","replies":[]}]},{"poster":"Ekrah","date":"2015-08-05T20:24:48.103+0000","up_votes":2,"down_votes":0,"body":"?","replies":[]},{"poster":"funkyfrog123","date":"2016-12-30T11:35:36.700+0000","up_votes":1,"down_votes":0,"body":"{{champion:5}} nerf the %%%%\r\n","replies":[]},{"poster":"TheOrangeYoshi","date":"2016-04-24T05:28:57.457+0000","up_votes":1,"down_votes":0,"body":"Honestly why cant rito just collab with a creator of a replay software (lsi or skinspotlight) and just implement that system into the game. ","replies":[]},{"poster":"Skaarl Pls","date":"2016-03-14T11:10:21.076+0000","up_votes":1,"down_votes":0,"body":"I know this post is old, and my comment probably wont be noticed. I just really hope they do consider or ATLEAST try make sandbox a thing, realease it on PBE or make it a thing like Urf for all i care! With the removal of dominion and the map itself custom games now feel almost useless. I can see your points but opening it to the servers for maybe even a weekend would be great. Before dominion was removed Hide and Seek was a game. Now try that on ARAM, Twisted Treeline or even Summoners Rift. It isnt the same, the madness can last for ages. You add 5 friends to the game start a skype call and bam, league suddenly has another gamemode.. Created by the community. Since its removal there is still custom ideas but its honestly not the same. Now add a sandbox mode.... You'll have people making sooo many different fun gametypes you wouldnt believe it. Hide and seek will be reborn, even those who loved dominion might get a chance at recreating it in a updated version. Basically add a summoners rift with no walls, maybe monsters with the option of removal (same goes for turrets, inhibs, minions and maybe even the nexus.) and allow players to actually expierience a \"Custom game\". Honestly its a great idea adding a Rotating queue for unique gamemodes such as All41 but bring back custom games, they honestly have potential. Sure keep your featured gamemodes and I understand adding this could ruing things like URF but these gamemodes is what makes the game truly fun. Back to the topic of making maps..  I personally could see these types of messing with game stats or champion stats to be hilarious. Replace baron with who? Gromp. add 500 damage per auto, (Significant range since nerf) 600 armour and magic resist 10000 health (Buffs such as 40% less damage from champions or maybe even a corrosive attack and watch as 5 people fight to kill one of leagues basic monsters! I really hope Riot sees potential in what would bring back custom games and who knows what the community can find .{{item:3060}} ","replies":[]},{"poster":"Thats my girl","date":"2015-11-10T23:53:00.838+0000","up_votes":1,"down_votes":0,"body":"can anyone tell me isnt rank down on 11th right? And the rank still up now, so what if i play can i still get the diamond tier?","replies":[]},{"poster":"IAMLeonox","date":"2015-11-10T05:19:23.411+0000","up_votes":1,"down_votes":0,"body":"permanent yi ban in bronze #ritopls\r\n","replies":[]},{"poster":"dera era","date":"2015-08-14T04:29:05.614+0000","up_votes":1,"down_votes":0,"body":"Can you guys at least consider three different things for the nostalgia?? Firstly Please bring back the very first and very original ARAM map if not for only a special event because I really want to be on that once again... Second of all Can you think about an option to change between the two hud's?? =/ And thirdly an option to change maps??? I don't want to have to resort to unstable 3rd party programs just to get the feeling I first got when playing league.\r\n\r\nAlso I think that in regards to the \"sandbox\" mode NOT being the way to go to try something before you unlock it... I think you should be allowed to TRY out a new champ for only a couple of hours but you can only do that once every week or it gets refreshed when new f2p's come in.... So if someone \"tries\" ekko out and then the next day the f2p rotation changes, Then they can \"try\" out another person for the 1-5 hour period that you guys can decide on (I'm not good with numbers) And then they'd have to wait till the NEXT f2p rotation to \"try\" another person.... Just something to think about. ","replies":[]},{"poster":"death flame","date":"2015-08-13T03:50:28.853+0000","up_votes":1,"down_votes":0,"body":"can you update the classic skins and splash arts of {{champion:83}} {{champion:3}} {{champion:6}} {{champion:82}} {{champion:33}} {{champion:96}}","replies":[]},{"poster":"Tainted fox","date":"2015-08-09T23:29:20.844+0000","up_votes":1,"down_votes":0,"body":"you know if {{item:3041}} and {{item:3141}} were banned in bot games i wouldn't be so mad about the lack of sandbox\r\n\r\nbot games last for 20 mins because of these items. this doesn't give me enough time to practice anything in bot games","replies":[]},{"poster":"GoodLoLGamer101","date":"2015-08-07T11:10:14.799+0000","up_votes":1,"down_votes":0,"body":"Alright... Listen UP! this is not to riot but Ill get to riot in a minute, First off People who expect riot to do every little thing they want ... well there gonna need Jesus for that. But If you take a minute back and just read what your posting is really sad... Riot is not one of the best but is the best and it's because they listen to us and they keep the game interesting at at every level possible and you think  it's not good enough. Riot sometimes you do mess up ... we all do! but that gives no reason for all these people who enjoy and love the game to come and say you force us to buy skins... Since when Riot force anyone to buy 1 skin... they make them and post them expecting there fans to like them and buy them. SO you people out there who expect Riot to make over 60 MILLION People HAPPY at ONCE then FUCK OFF because Riot is one of the best community iv seen and its people like you who think its not good enough and think you can talk in a way to people who in a way have to put up with you on comments everyday .... whether its good or bad. Only once I did I see someone saying Thank you Riot in these Comments. Have some Respect for the people who work and put hours of there time making something even YOU cant make. Although there getting paid Riot does more then they should to keep YOU happy.","replies":[]},{"poster":"SulkyJoe","date":"2015-08-06T13:55:00.309+0000","up_votes":1,"down_votes":0,"body":"I think this video is something Rioters need to see\r\nhttps://www.youtube.com/watch?v=_tdrx3Fohmc\r\n\r\nI love how Riot is trying to be more open with what they are doing, but they need to make sure they don't have multiple Rioters, on multiple platforms (of social media), making contradicting points which just makes things even more confusing about what they are doing than before.","replies":[]},{"poster":"Essy","date":"2015-08-06T08:29:03.577+0000","up_votes":1,"down_votes":0,"body":"Blah blah blah...Your suggestion is going down the drain. Here we give u more skins and chroma skin give me your money and we update champion that look good to look worse don't worry rito games do this under control{{champion:114}} ","replies":[]},{"poster":"itsJono","date":"2015-08-06T04:53:05.116+0000","up_votes":1,"down_votes":0,"body":"Thanks for this, no really, thanks. It feels great being connected, knowing what's going on and a promise to do so more frequently is perfect. It makes me want to jump on more blogs and comment on more articles to do similar: communicate. I know how this works, it's not MY game or anyone else's; it's Riot's. I am a fan, I admit it, and if you have to take longer to do something or have to shelve a project for whatever reason, I/we understand. Some of my favourite memories are playing this game with my friends and just because of that, I owe you plenty. To Banksy, ScuttleChris and the entire Riot team, Oceania and worldwide, cheers for the work you do and good luck for the future. ^^","replies":[]},{"poster":"Korpsenale","date":"2015-08-06T01:36:19.019+0000","up_votes":1,"down_votes":0,"body":"i loved the {{champion:32}} song ..it was just amazing, and i doubt many people read this but im totally cool with what you guys are doing behind scenes and ..well visable scenes, ciao","replies":[]},{"poster":"eLoQuEnCe","date":"2015-08-05T21:56:59.462+0000","up_votes":1,"down_votes":0,"body":"fioras abilities arent showing up in the champion overview ","replies":[]},{"poster":"Kaaboose","date":"2015-08-05T20:25:51.254+0000","up_votes":1,"down_votes":0,"body":"Loved the DBZ reference in the Sandbox Mode section.","replies":[]},{"poster":"eBROgie","date":"2015-08-05T22:54:55.649+0000","up_votes":1,"down_votes":1,"body":"{{champion:157}} ","replies":[]},{"poster":"Tharna","date":"2015-08-05T22:34:11.145+0000","up_votes":1,"down_votes":1,"body":"can we get an offline mode though? no ip/rp gains or anything like that just straight up start game play bots. maybe even throw lan in to just play with friends locally.","replies":[]}]}