{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-01-13T05:12:36.002+0000","title":"Patch 5.1 notes","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"PvtRyan69","date":"2015-01-15T00:56:47.821+0000","up_votes":13,"down_votes":3,"body":"Thank You Riot For no nerfing {{champion:238}}  and nerfing {{champion:421}} ","replies":[{"poster":"Dezzter","date":"2015-01-15T06:29:54.583+0000","up_votes":1,"down_votes":34,"body":"except they did nerf Rek'Sai if you actually read...","replies":[{"poster":"Ramjo","date":"2015-01-15T07:03:41.759+0000","up_votes":22,"down_votes":0,"body":"*and* if **YOU** actually read he is thanking them for **NERFING** reksai and **NOT** nerfing zed. Trying to belittle someone for something you actually do(or dont do) makes you a hypocrite","replies":[]},{"poster":"Rapid","date":"2015-01-16T01:40:42.750+0000","up_votes":2,"down_votes":2,"body":"Fucking idiot braindead as fuck","replies":[{"poster":"BluEye2","date":"2015-01-20T09:39:44.881+0000","up_votes":1,"down_votes":0,"body":". >.<","replies":[]}]}]}]},{"poster":"The Ascended ZxH","date":"2015-01-14T23:42:38.828+0000","up_votes":3,"down_votes":7,"body":"naut was already having a bad time with his first clear why make it harder to start better late games ok but why reduce his early really hard","replies":[{"poster":"DumpmasterDarius","date":"2015-01-14T23:53:18.438+0000","up_votes":8,"down_votes":0,"body":"You know it is a buff still{{champion:111}} ?","replies":[{"poster":"Icy lock","date":"2015-01-15T00:39:19.866+0000","up_votes":1,"down_votes":9,"body":"Not really, i mean, for him to make up for 215 health that he loses at max level of his shield, naut needs approximately 10000 (TEN THOUSAND!!!!{thats like what, 5 warmogs or something?) total health and if i'm not mistaken, that's not going to happen in many games. This just puts naut further and further into a hole and his early game is going to be worthless, with his late game been weaker? I dunno what riot is thinking.","replies":[{"poster":"Gehirn","date":"2015-01-15T00:47:08.320+0000","up_votes":13,"down_votes":0,"body":"It's 17% of max health at max level, so he only needs 1265 base health to get the 215 back, a bit more than that is required if we remember the previous 15% bonus health multiplier. But I believe his shield should be stronger at all levels.","replies":[]},{"poster":"IphStich","date":"2015-01-15T02:23:01.930+0000","up_votes":5,"down_votes":0,"body":"I don't know what math youre doing... But Naut gets more shield than he does previously at levels 1 / 6 / 10 / 13 / 15 based purely on his base health and health per level. And that doesn't even factor in any of the bonus health he should be buying and the extra 2% he gets from that (a 13% increase!).\r\n\r\nIt does seem like a nerf to his early game, it really isn't. If anything it buffs his early and late game, while slightly nerfing his mid game.","replies":[{"poster":"DumpmasterDarius","date":"2015-01-15T04:00:00.893+0000","up_votes":5,"down_votes":1,"body":"Like I said it was a buff... some people skipped math at school Lol {{item:3151}} {{item:3070}} {{item:3070}} ","replies":[]}]}]}]}]},{"poster":"plodof","date":"2015-01-15T06:58:33.988+0000","up_votes":5,"down_votes":0,"body":"I love how there are no comments on the crazy Evelynn{{champion:28}} buff","replies":[{"poster":"d13sel","date":"2015-01-15T13:48:46.905+0000","up_votes":6,"down_votes":0,"body":"Thats cos noone saw it coming","replies":[]}]},{"poster":"Komqr","date":"2015-01-15T04:27:14.605+0000","up_votes":6,"down_votes":0,"body":"Hi,\r\n\r\nSome people are saying that pantheon needs to be nerfed, however i totally  disagree. I have seen many people (that are high leveled) play him but still lose (miserably). I was that same when i started but now i wreck (finally after like 3 months)\r\n\r\nI have been playing him for a few months and i would like for you to consider making him look a bit more realistic (e.g: his feet look like big boxes, the metal doesn't really look like metal nor does the skin look like skin).\r\n\r\nPlease consider doing the same for other older champions.\r\n\r\nThanks.\r\n(Sorry for being rude)","replies":[]},{"poster":"Noop","date":"2015-01-15T00:05:29.936+0000","up_votes":6,"down_votes":6,"body":"The IE change to marksman also nerfs Yasuo! With the standard 5 percent crit runes used on Yasuo, IE + Shiv doesn't give 100 percent crit chance only like 91 percent. I thought Yasuo at this point was balanced maybe even slightly weak considering his (arguably) high skill cap, how easy it is to gank and/or dive him and how many counter picks are available. In my eyes this change is a nerf to Yasuo that he didn't deserve.","replies":[{"poster":"Daburukiru","date":"2015-01-15T05:22:15.924+0000","up_votes":7,"down_votes":1,"body":"I agree! Why nerf {{item:3031}} and buff {{item:3046}} ? That makes no sense!","replies":[{"poster":"tasteofbludz","date":"2015-01-15T07:02:27.139+0000","up_votes":3,"down_votes":0,"body":"i agree.\r\n","replies":[{"poster":"Captain Peaches","date":"2015-01-15T23:57:37.903+0000","up_votes":4,"down_votes":0,"body":"Hello {{item:3087}} {{item:3046}} {{champion:11}} ","replies":[]}]}]},{"poster":"White Boii","date":"2015-01-15T05:39:20.625+0000","up_votes":8,"down_votes":4,"body":"Oh he does deserve it when he can go from 0/10 to 17/10 the instant he finishes his {{item:3087}} and {{item:3031}} and can just 3 shot any other champ at that point I think its kinda ridiculous that when you're a mid laner whos tried there best to keep him shut down all game and succeeded in doing so, just for him to finish 2 items and fling all your hopes and dreams in your face.","replies":[{"poster":"Noop","date":"2015-01-15T06:18:58.846+0000","up_votes":4,"down_votes":2,"body":"If that was the case they wouldn't have given him a buff last patch. If a Yasuo goes 0/10 then there is an ENORMOUSLY HUGE window to close out the game, the enemy team is at fault if they don't. If he ends 17/10 then he either he outplayed the enemy team on a godlike level or the enemy team outplayed themselves and threw on a godlike level and that's all there is to it.","replies":[]}]},{"poster":"Jetstream Yasuo","date":"2015-01-15T09:03:02.701+0000","up_votes":2,"down_votes":0,"body":"So true","replies":[]}]},{"poster":"AIi","date":"2015-01-14T21:34:32.219+0000","up_votes":1,"down_votes":6,"body":"so DFG isin't getting removed? o_o thanks riot :D <3 (No Sarcasm) :D","replies":[{"poster":"Bababooie","date":"2015-01-14T22:17:45.017+0000","up_votes":5,"down_votes":0,"body":"Still getting removed, just in a later patch. (Probably 5.2/5.3)","replies":[{"poster":"BLACKWOLF1234","date":"2015-01-15T02:37:22.474+0000","up_votes":5,"down_votes":0,"body":"NOOOOOOOOOOOOOO","replies":[]}]},{"poster":"Sobriquet","date":"2015-01-15T02:31:53.300+0000","up_votes":1,"down_votes":0,"body":"Patch 5.2 was said to remove DFG, so don't get your hopes up yet <\\3","replies":[{"poster":"Superdoughnut33","date":"2015-01-20T12:07:26.613+0000","up_votes":1,"down_votes":0,"body":"Bu-but veigar burst would never be the same without the overkill :'(","replies":[]}]}]},{"poster":"Daburukiru","date":"2015-01-15T05:16:51.363+0000","up_votes":3,"down_votes":3,"body":"WHY THE HELL ARE YOU NERFING {{champion:37}} ?! Leave Sona alone and nerf people who actually NEED a nerf I.e {{champion:105}} , {{champion:55}} , {{champion:238}} , {{champion:92}}.\r\n\r\nAnd {{champion:25}} needs to be fixed. Her black shield should be made so it blocks only one form of CC instead of all kinds, as well as her Q hitbox needs to be fixed. I've been out of reach from Morgana's snares often and it just grazes the side of my champion and I get snared. The hitbox is deceptive. ","replies":[{"poster":"White Boii","date":"2015-01-15T05:34:02.250+0000","up_votes":7,"down_votes":2,"body":"They are nerfing {{champion:37}}  because (as she may be squishy) her damage start game far exceeds pretty much every other bot lane so the enemy team just has to sit there and deal with the half hp shes dishing out every time she hits a passive. But I do agree with your list of nerfs, especially with {{champion:105}}  but you forgot to add {{champion:84}} ......\r\n","replies":[{"poster":"Daburukiru","date":"2015-01-15T05:40:41.155+0000","up_votes":6,"down_votes":3,"body":"I absolutely hate assassins with a passion. Particularly they always ALWAYS ALWAYS snowball and dominate a game. Assassins should be made to one shot only a single champion, not take an entire team down. And With {{champion:84}} and {{champion:105}}  and {{champion:55}} all of them need a rework. Reset champs like Kat and Akali are too ridiculous, especially since Kat already has low CD and no mana cost, and Akali has low energy costs and resets. and Fizz's E just allows him to spam it and dodge everything especially with 40%CDR like I've seen most Fizz's get -_- Also {{champion:92}} and {{champion:2}} 's damage scaling is far too ridiculous and OP as they can mop the floor with any 1v1 duel and can't be countered unless by ranged champions and/or mages. Also, I really can't wait for the {{champion:114}} rework because she's just too ridiculous and made to stomp people similar to{{champion:11}} \r\n\r\nYeah you can say \"CC *insert assassin here* and you can kill them\" but first, people in Solo Queue don't choose champs with CC, because they want to be the hero. Second, you spend so much time focusing the assassin that they can kite, juke and bait your team into focusing them while their team kills off every one you. And finally, a good assassin will know how to avoid CC and position themselves so that the CC has already been used and mop the floor with your team","replies":[]},{"poster":"ibohydrates","date":"2015-01-20T00:05:40.942+0000","up_votes":1,"down_votes":0,"body":"I like how the guy complaining about assassins name is \"forgot 2 zhonyas\"","replies":[]}]},{"poster":"BrbDoingWraiths","date":"2015-01-15T05:24:38.731+0000","up_votes":5,"down_votes":1,"body":"So you are saying you just don't know how to deal with assassins?","replies":[]},{"poster":"Superdoughnut33","date":"2015-01-20T12:18:17.816+0000","up_votes":1,"down_votes":0,"body":"i agree with your nerfs. But i can't say the same for Morg. I agree that her q needs to be fixed because its is annoying and deceptive, but her black shield is perfectly fine. The shield only blocks cc when its up. this isn't like a sivir or noc spell shield where it stops 1. if she does put her shield up, if your a zed or yas, you only need to worry about your death mark, knockup and slow from shadow. otherwise, it does nothing. you can wait for the shield to run out, or wait for your ap teammate(s) to take care of the shield.","replies":[]},{"poster":"Superdoughnut33","date":"2015-01-20T12:17:53.292+0000","up_votes":1,"down_votes":0,"body":"i agree with your nerfs. But i can't say the same for Morg. I agree that her q needs to be fixed because its is annoying and deceptive, but her black shield is perfectly fine. The shield only blocks cc when its up. this isn't like a sivir or noc spell shield where it stops 1. if she does put her shield up, if your a zed or yas, you only need to worry about your death mark, knockup and slow from shadow. otherwise, it does nothing. you can wait for the shield to run out, or wait for your ap teammate(s) to take care of the shield.","replies":[]}]},{"poster":"Dezzter","date":"2015-01-15T06:29:23.553+0000","up_votes":4,"down_votes":0,"body":"The changes to abyss aura mean if you get Soraka now you better have a reroll.","replies":[]},{"poster":"Qarkvandit","date":"2015-01-15T03:25:18.071+0000","up_votes":4,"down_votes":0,"body":"Having double smite will be really helpful now. Avoiding awkward situations when you've just used {{summoner:11}}  on the chickens and your team wants to do dragon\r\n","replies":[]},{"poster":"Evilordanger","date":"2015-01-16T04:30:31.508+0000","up_votes":3,"down_votes":0,"body":"NOOOOOOooooo..\r\n{{champion:238}} \r\nPlease don't circumcise Zed.\r\n{{champion:238}} ","replies":[]},{"poster":"NOT TODAY ZURG","date":"2015-01-15T01:41:25.606+0000","up_votes":2,"down_votes":2,"body":"Of all the champs that desperately need nerfing (Yasuo, Panth, Katarina, Lee Sin, Master Yi, Riven, etc) you nerf Sona.. AGAIN? And for what? Plus Syndra who didn't even need it. And Kalista's passive? Riot said that they couldn't change abilities and passives and such when asked to change a champs ability. This whole patch is just nerf and it's so disappointing. All my favourite champs do worse in the game because someone out there played them well and so Rito is like \"well, hey there, aren't you OP\" and nerf them into the floor. But no, they can give Yas's Q a 4/4/4/4/4 sec* CD on all ranks who was already overpowered. Lets just say I won't be playing as often as ever if it keeps going like this.","replies":[{"poster":"Soulhoarder","date":"2015-01-15T03:28:35.875+0000","up_votes":3,"down_votes":0,"body":"Stop being such a sook about it, nerfing is for champions that you CANT stop, that have such an edge on other champions, they didnt nerf sona that hard just her consistent damage after her q","replies":[{"poster":"NOT TODAY ZURG","date":"2015-01-15T06:12:44.914+0000","up_votes":3,"down_votes":0,"body":"Any champ is unstoppable if they get fed enough so don't tell me that crap.","replies":[]}]}]},{"poster":"Just4DaLawl","date":"2015-01-15T00:08:02.775+0000","up_votes":2,"down_votes":1,"body":"Wtf another sona nerf, why may i ask?????","replies":[{"poster":"HORSE OF FORCE","date":"2015-01-15T02:05:48.979+0000","up_votes":3,"down_votes":0,"body":"It's not gonna really do much, the base damage of the Q particle is unchanged, and that's what deals the most damage of the entire spell. It's more about nerfing the consistent damage she gets afterward.","replies":[]}]},{"poster":"Divoid","date":"2015-01-15T01:37:58.285+0000","up_votes":2,"down_votes":5,"body":"{{champion:37}} Sona nerfed. why? She is already one of the slowest champs.\r\n~~**********~~\r\nThis patch doesnt address her major failing- Mana consumption.\r\nThe mana costs for a full support Sona are the highest in the game.\r\nSimply cast heal twice and see your mana just dwindle.\r\n~~**********~~\r\n{{item:3070}} This makes her more reliant on items that almost any other champ. No other champ MUST have items just to fulfil their basic functions.","replies":[{"poster":"Ramjo","date":"2015-01-15T07:11:00.991+0000","up_votes":4,"down_votes":0,"body":"> No other champ MUST have items just to fulfil their basic functions.\r\n\r\nAlot of champs(Most AP Casters) need mana regen items, try throwing 2 bombs as ziggs, try playing lux(mid or support), place more than 1 mushroom with teemo, use swain ult for more than 5 sec....","replies":[]},{"poster":"CJ Entus The Shy","date":"2015-01-15T02:07:41.659+0000","up_votes":1,"down_votes":1,"body":"Draven and sona are the most powerfull combo let alone sona's sustain in lane is crazy as old soraka so do take note that if you main sona you are pretty much unstoppable\r\n","replies":[{"poster":"Divoid","date":"2015-01-15T04:08:21.663+0000","up_votes":3,"down_votes":1,"body":"been stopped often enough.","replies":[]}]}]},{"poster":"Holland","date":"2015-01-15T02:51:53.987+0000","up_votes":4,"down_votes":1,"body":"Since riot made jungling so much more fun why not try making support fun? Like having new affects with the support items.","replies":[{"poster":"Qarkvandit","date":"2015-01-15T03:27:08.807+0000","up_votes":2,"down_votes":1,"body":"END GAME FANTASY!","replies":[]}]},{"poster":"Kas","date":"2015-01-15T07:34:02.549+0000","up_votes":5,"down_votes":2,"body":"Bring back zeds fast shadow animation while you are doing the balance...if LB can flash in and flash out in a blink of an eye why cant zed...too many deaths due to slow shadow animation please riot...","replies":[]},{"poster":"Tsundere Yasuo","date":"2015-01-18T00:16:28.281+0000","up_votes":2,"down_votes":0,"body":"RIP DeathFire Grasp 2009-2015 In Patch 5.2 This Item will be remembered for the Best AP Item. {{item:3128}} ","replies":[]},{"poster":"DeFy Excalibur","date":"2015-01-15T20:59:36.342+0000","up_votes":2,"down_votes":0,"body":"Riot needs to visual update {{champion:31}} and {{champion:38}}'s they look really out of date with the new summoners rift","replies":[]}]}