{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-01-13T01:25:35.595+0000","title":"Champion Update: Shen","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Pattycakes","date":"2016-01-13T21:08:15.343+0000","up_votes":35,"down_votes":14,"body":"As a Shen main I am also very disappointed at this... \r\nThe big blade is silly and the weird energy blade is just not him. \r\n\r\nAll up, as a fan of Riot and League of Ledgends, you have really let me down. ","replies":[{"poster":"President Garen","date":"2016-01-14T06:50:07.700+0000","up_votes":34,"down_votes":4,"body":"Shen is one of my favourite champions to play because his gameplay is simplistic and the skill in being a good shen player comes from observation and picking the right time to use your abilities. it feels like riot is trying to shut out an entire demographic of players who enjoy champions that are simple to play, easy to learn but hard to master. This spirit dagger spits in the face of his current gameplay, it forces him to play aggressive to get the best effect out of his abilities. removing his Q and Ki strike pretty much makes him an easy target to bully in lane and takes away his ability to farm waves without getting his teeth kicked in by other top laners and damns him to the jungle where he can't really do much aside from afk farm and counter gank as his standard ganks are horrifically telegraphed and predictable or as a support that can't do anything for for his ADC unless the enemy makes a really bad decision and decides to all in your adc for no reason. These changes are poorly thought out and will mean the death of the champion, it feels like your just trying to slap some \"cool moves\" onto shen just to make him more appealing to people who prefer to play carries with flashy abilities who in my experience suck at playing tanks anyway. you are taking a champion that belongs to one demographic of players and panning him off to another demographic who probably won't even enjoy playing him even after the changes. I actually feel like I deserve my money back for my skin at this point because when I bought the skin it was to show my dedication to the champion and this reworked shen is not the thing I paid for nor is it even remotely close. Taric is up next on the rework list and he is currently my most played champion as he excells in the current meta and has always been one of my favourites, if you murder him like you've done to shen then I'm taking a break from league for a year or two until riot sorts their shit out and stops experimenting like crazy and trying to fix things that aren't broken. I'd be more than happy to see this dagger mechanic in game but not on shen, not in a million years on shen. Riot is going too far to put mechanics where they don't belong, this sort of ability is something that suits a bruiser a lot more than it does a tank.","replies":[{"poster":"CosmicSakura","date":"2016-01-14T16:27:39.846+0000","up_votes":9,"down_votes":1,"body":"I totally agree you basically summed up my anger towards this so called \"update\".","replies":[]},{"poster":"Captain JlZZ","date":"2016-01-15T13:27:36.963+0000","up_votes":2,"down_votes":1,"body":"Hahaha indeed they broke his legs and ripped of his arms, but I assure you most champion update has proven to bring in some bs broken mechanic/scaling to the champ. For instance he can now protect his allies with his w!(But yes he'd probably drop dead at start of the fight due to having no spell protection, but save your ADC, why not? Even if he is like 0-11!). Besides that I damn agree with that huge sword being out of place... He's a ninja not a {{champion:86}}  >.>;;; But don't waste your breath complaining to rito, they'll never really care about anything else other than your wallet, just like how they didn't put my name on the nautilus reef even after scoring enough points on ocean week. ","replies":[{"poster":"Wood5NZL","date":"2016-01-16T04:30:00.563+0000","up_votes":6,"down_votes":0,"body":"Lol maybe coz your names Captain Jizz xD","replies":[]}]},{"poster":"Wood5NZL","date":"2016-01-16T04:31:40.547+0000","up_votes":5,"down_votes":2,"body":"Agreed\r\nAm I playing {{champion:98}}  Or {{champion:61}} \r\n\r\nI'm playing {{champion:61}}  Apparintly.","replies":[]},{"poster":"DragRiper","date":"2016-01-16T01:32:35.786+0000","up_votes":4,"down_votes":2,"body":"the current Shen is fine\r\n       ","replies":[]},{"poster":"princess mickey ","date":"2016-01-14T09:05:31.668+0000","up_votes":4,"down_votes":3,"body":"i agree to riot pls dont rework shen ","replies":[]}]},{"poster":"Zeds Death Mark","date":"2016-01-14T00:24:39.510+0000","up_votes":17,"down_votes":13,"body":"1 Shen main out of the whole OCE server, guess we should keep him the same just for you as you are apparently the only one that actually likes him, c'mon man don't dislike riot for trying to please a broader range of people than just the people that play him, even if unsuccessful they still tried and people that dont play him at all probably will like him because they wont be able to even compare new shen to the old shen so i think this is a good choice and looks alright","replies":[{"poster":"Nahsti","date":"2016-01-14T01:50:40.197+0000","up_votes":10,"down_votes":3,"body":"I want my Scorpion and Sub Zero skin back, I'm also an OCE Shen main. This spirit sword is retarded.","replies":[]},{"poster":"Talon12","date":"2016-01-14T11:55:03.552+0000","up_votes":5,"down_votes":1,"body":"i like him currently.","replies":[]},{"poster":"King Shinobi","date":"2016-01-14T09:26:50.889+0000","up_votes":5,"down_votes":2,"body":"there are alot of Shen Mains on the OCE server dude. dont need to be like that.","replies":[]}]},{"poster":"pinksheep","date":"2016-01-14T04:04:18.425+0000","up_votes":13,"down_votes":12,"body":"you are just mad because they added abilities which require skill and thought to use","replies":[{"poster":"King Shinobi","date":"2016-01-14T09:28:51.999+0000","up_votes":4,"down_votes":3,"body":"to be honest, its harder to master Shen as he is currently you need patients and great timing to pull of his abilities to their fullest. \r\n\r\nyou should 1v1 me or any other Shen Main and see how well you do.","replies":[{"poster":"oOo0oOo0oOo0oOo","date":"2016-01-14T15:45:40.633+0000","up_votes":2,"down_votes":10,"body":"> to be honest, its harder to master Shen as he is currently you need patients and great timing to pull of his abilities to their fullest.\r\n\r\nSo exactly what this re-work is like, with more timing and more mastery required?\r\nFace it, this is objectively a more complex and interesting character design for a champion that has been static since his inception, if you don't like changes, move out of the way because you're playing the wrong game ","replies":[{"poster":"King Shinobi","date":"2016-01-15T06:55:05.957+0000","up_votes":8,"down_votes":0,"body":"sorry, let me re-word, \"don't try to fix what isn't broken.\" he was fine the way he was. (except Models.)","replies":[]}]},{"poster":"ScrumptiousHD","date":"2016-01-15T04:29:38.028+0000","up_votes":1,"down_votes":2,"body":"That's ridiculous, that's like asking a non-Vel'koz main to 1v1 a Vel'koz main, on top of that you haven't had a chance to play the new Shen, let alone master him so how would you be able to make a judgement?","replies":[{"poster":"King Shinobi","date":"2016-01-15T06:55:52.871+0000","up_votes":4,"down_votes":0,"body":"ill try him, but not going to hold my breath. Shen is awesome the way he is.","replies":[]}]}]}]}]},{"poster":"King Shinobi","date":"2016-01-14T09:23:55.995+0000","up_votes":12,"down_votes":1,"body":"Riot... I have been around since you first launched, My first ever Character i played was Shen and bought, He has been and still is my all time favorite, i mean, look at my fricken name lol! \r\n\r\nTo this day Shen is still a force to be reckoned with so why are you changing his kit SOOOOO much?? that big Blade looks and feels awkward. at first i was excited but after seeing the ability changes not so much.\r\n\r\nHis sustainability has completely gone, and no more heals for the team or himself. \r\n\r\nIf you think his self shield is going sustain him your wrong. no more team heals???? seriously?? His Vaporal Blade was one of his most Iconic abilities...  it made Shen Shen... if you Maxed out HP only you'd have a major heal benefit for your team, if you played AP it would cause great Damage oh and no more poking, i mean, if that blade thing was like Azir's Soldiers that you could send to a point and position some where rather than just calling it to yourself maybe it might work, (make it smaller, and keep to his duel wielding!) \r\n\r\nPlease rethink this....\r\n\r\n\r\nill give him a go but....... i may lose all faith in this Current riot who are trying to please the newbies and forsaking those who got you here in the first place.... \r\n\r\nAnd yes I've paid alot to your company maybe not much in terms of others or total company profit, but, its surly been more than i could afford personally.\r\n\r\n  \r\non a side note. \r\nHis new models are Sick! :)","replies":[{"poster":"FlareM8","date":"2016-01-15T08:34:32.325+0000","up_votes":3,"down_votes":0,"body":"exactly\r\nupvote this \r\nwe need to show riot they made the wrong decision before they release his update\r\n","replies":[]}]},{"poster":"Tele","date":"2016-01-13T19:34:18.694+0000","up_votes":11,"down_votes":4,"body":"I dunno Riot... Shen was my main,and I think he didn't need a rework this big. The random sword looks awkward in lane. He has no healing now, so the out-sustain days are over. I'm kinda sad, you've cut some cool stuff from his kit.\r\n\r\nI'll be fair though and wont judge too hard until he is out. Looks like he might be able to jungle now? So that's cool.","replies":[{"poster":"SenorBatman","date":"2016-01-13T20:40:29.492+0000","up_votes":8,"down_votes":0,"body":"umm shen has always been able to jungle idk what ur going on about ","replies":[{"poster":"Roguestoney","date":"2016-01-13T23:57:20.451+0000","up_votes":3,"down_votes":1,"body":"Probably means he has never been anywhere near a top tier jungler...","replies":[]}]},{"poster":"SkepticSquid","date":"2016-01-13T22:10:55.348+0000","up_votes":2,"down_votes":23,"body":"***","replies":[{"poster":"The Forge God","date":"2016-01-13T22:59:54.877+0000","up_votes":16,"down_votes":2,"body":"Your acutally so dumb xD. It says:  Shen recovers a flat portion of ENERGY whenever he deals damage with Twilight Assault or Shadow Dash. ","replies":[]}]},{"poster":"Estyss Eon","date":"2016-01-14T00:55:42.211+0000","up_votes":3,"down_votes":1,"body":"Yeah. Fair enough this is Riot's character, but as far as I'm aware, Shen is or heavily based on a Ninja. Ninjas don't usually have big hulking swords, they're Spies. They use smaller blades - so they can draw them quickly, quietly and easily to strike - like original Shen. These blades would look less strange scaled down like half their size. Otherwise I think visually these models are quite fantastic.","replies":[]}]},{"poster":"P1gmyPie","date":"2016-01-13T20:35:53.037+0000","up_votes":8,"down_votes":0,"body":"{{champion:44}} u next >:3","replies":[]},{"poster":"HellFire1","date":"2016-01-13T20:42:17.919+0000","up_votes":9,"down_votes":1,"body":"Shen was the 1st champion i ever changed. I agree he needed a change but mainly just his w. His q was a nice poke tool. I wish he still had a decent ranged poke ability or sustain though. Rip Shens vsing {{champion:150}} and {{champion:8}}. R.I.P\r\nHe looks kinda shit tbh. The sword makes you focus on too many things. And if he has 2 smallish swords on his back, why is he using one big one. Assassins dont use big, heavy blades. He isnt even an assassin anymore. I cri evryteim {{item:2049}} {{item:3070}} ","replies":[{"poster":"Maraudaur","date":"2016-01-13T23:58:19.893+0000","up_votes":2,"down_votes":2,"body":"Might find this useful\r\n\r\nhttp://i.imgur.com/9TJQYaQ.png","replies":[{"poster":"FlareM8","date":"2016-01-15T09:02:43.263+0000","up_votes":3,"down_votes":0,"body":"please riot dont do this many devoted players are on the line here\r\n\r\n","replies":[]}]},{"poster":"TheEverydayWiz","date":"2016-01-13T21:12:43.373+0000","up_votes":3,"down_votes":0,"body":"Shen's not an assassin; he is untainted judgement, an unyielding force that strikes down those who remove balance whether they are \"good\" or evil. His looks as well as those of Akali and Kennen are definitely based on ninjas but it's not stated in his lore that he is an assassin.","replies":[]}]},{"poster":"not Azza","date":"2016-01-14T05:45:30.897+0000","up_votes":7,"down_votes":0,"body":"I personally hate this rework so much...I dislike the whole spirit sword thing and the only thing that shen needed was the W cause everything else was fine.\r\nI personally also hate the look of new shen as I bought the scorpion skin for the old shen and he looks awesome but with the new look he looks like sh*t with the scorpion skin.\r\nYou let me down riot!","replies":[]},{"poster":"MAXXDAAWESOME","date":"2016-01-14T00:14:25.440+0000","up_votes":7,"down_votes":1,"body":"I am a shen main and i am so sad this is happening i like him how he is and If your going to change him don't get him that stupid blade thing. Riot plz don't do this :D{{item:3070}} \r\n","replies":[]},{"poster":"Bhelliom","date":"2016-01-15T06:17:25.309+0000","up_votes":5,"down_votes":0,"body":"Just wanna clarify for peeps, his W doesnt require an ally to function, it drops a zone, if an ally is in it, or enters it, it activates immediately, otherwise it waits 2 seconds, then triggers anyway. So you can use it in a solo lane, taunt, drop zone, pull Q through enemy, deal buttloads of damage while youve got a shield and cant be hit by auto's.\r\n\r\nHis q btw as it stands on the PBE, empowers each of his autos to deal 7.5% of the targets MAX hp on each attack (22.5%) at rank 5, meaning he can lay the hurt on you regardless if you are a tank or squishy, im thinkin liandrys torment might be interesting. Oh it also empowers your autos even if you dont hit an enemy with it (just empowers more and makes you attack 50% faster if you do)\r\n\r\nHis E (the dash taunt) gains bonus damage scaling off your bonus hp aswell, so it actually hurts now aswell as taunts.\r\n\r\nAlso his shield on his passive scales off bonus hp aswell!\r\n\r\nI like this rework because he's actually tankier and makes for a better tank (has 3 ways to forcibly protect his allies now instead of 2) hes tankier now especially late game as his new passive ties a shield that scales off hp to every single one of his abilities, with enough hp and proper timing, they cant burn through your shield before it refreshes, not only does this mean they need to focus you ( thus taking attention off your allies) to burn through your shield, but you are also mitigating said aggro.\r\n\r\nFurther more, since he now does max hp scaling damage (scales higher with ap) they cant ignore you either, making you an even more effective tank.","replies":[]},{"poster":"Drgoon","date":"2016-01-15T13:30:29.612+0000","up_votes":4,"down_votes":0,"body":"In all honesty, I think Riot should bring out a vote for either keeping old Shen or reworking him. Its obvious that some people are liking the new Shen but also obvious that some people prefer him the old way.","replies":[]},{"poster":"socksOdoom","date":"2016-01-15T11:47:04.231+0000","up_votes":4,"down_votes":0,"body":"Why are you doing this Riot? Shen doesn't need a rework. He's fine. Stop screwing with everything. Ugh. I am actually angry. Don't change him. Look at the comments. Nobody likes it. His kit is perfectly fine, except for maybe his W, which just needs tweaking. Seriously Riot, don't do this. R.I.P{{champion:98}} \r\n\r\n\r\n{{item:3070}} ","replies":[]},{"poster":"Cloudy342","date":"2016-01-14T03:49:56.750+0000","up_votes":4,"down_votes":0,"body":"Logged in just to say... WHY? R.I.P. Shen Passive, Q and W. Rip AP Shen.","replies":[]},{"poster":"Bomber678","date":"2016-01-14T00:38:41.147+0000","up_votes":5,"down_votes":1,"body":"Visual update: Looking cool. Dunno what's with the second, smaller sword?\r\nAbility rework: Not sure how this'll pan out, but cautiously optimistic\r\nAnimations changes: Not graceful enough anymore. He's swinging that sword around like a barbarian, not a ninja. Where are the swift, precise sword strikes befitting an elegant ninja?","replies":[]},{"poster":"FlareM8","date":"2016-01-15T08:28:50.331+0000","up_votes":3,"down_votes":0,"body":"riot you dissapointed me the old shen was unique with his healing q but youve taken that ruined his sheild his sustain and youve ruined our day you took what made him best the ability to not care about poke or high damage the ability to put your life on the line for the sake of your team you have ruined shen and if you do the same to taric you will betray the leage community taking away unique mechanics and replacing them with rubbish bogus abilities that dont go in conjunction with the ones you tweaked slightly shen was a tank but now hes just a failure bruiser\r\nyou havge the chance to make the update just visual riot i have played your game for years being a big fan i know how the community feels about this all youve done is targeted tanks and the very few that are still viable in this dark adc meta you are 'reworking' to make them more 'suitable' to the current standards of the game\r\ni hope you see what i have wrote and consider shen taric and all the tank main who are probably gonna quit seeing that your reworking shen ad taric riot please just dont let us down","replies":[]},{"poster":"Dirge of Tox","date":"2016-01-15T02:07:48.687+0000","up_votes":3,"down_votes":0,"body":"I thought he was gonna look like this... \r\n\r\nhttp://apollo-na-uploads.s3.amazonaws.com/1426927091387/image.jpg","replies":[]},{"poster":"Enkairin2","date":"2016-01-14T13:33:00.405+0000","up_votes":2,"down_votes":0,"body":"I think the {{champion:98}} mains just want the blade to be smaller.\r\nfor once people want a smaller blade....{{item:1038}} {{item:1042}} ","replies":[{"poster":"Enkairin2","date":"2016-01-14T13:38:49.867+0000","up_votes":3,"down_votes":0,"body":"I better update the porn website adds, click here for a shocking secret to a smaller {{item:1042}} !","replies":[]}]},{"poster":"leonux","date":"2016-01-14T01:18:58.899+0000","up_votes":4,"down_votes":1,"body":"Still waiting for a Yorick rework...","replies":[{"poster":"I Like Peaches","date":"2016-01-14T10:06:44.343+0000","up_votes":2,"down_votes":0,"body":"1 at a time. Taric, Yorixk, warwick and Nunu. And Galio!","replies":[]}]},{"poster":"HelloImCam","date":"2016-01-28T01:23:37.606+0000","up_votes":2,"down_votes":0,"body":"Surgeon Shen is wearing **CROCS**. F*cking hell, Vel Koz wearing boots next?","replies":[]},{"poster":"Water Is Wet","date":"2016-01-15T20:20:01.268+0000","up_votes":2,"down_votes":0,"body":"\r\nIs it just me or does yellow jacket shen look badass?\r\n","replies":[]},{"poster":"BowserFromSonic","date":"2016-01-14T05:31:58.441+0000","up_votes":2,"down_votes":0,"body":"{{champion:83}} Your turn soon son... ","replies":[]},{"poster":"Lt TitanKain","date":"2016-01-13T19:32:09.314+0000","up_votes":2,"down_votes":0,"body":"surgeon shen... WHAT ARE THOSE??!?","replies":[]},{"poster":"SudsMcDuff","date":"2016-01-14T15:16:10.684+0000","up_votes":3,"down_votes":1,"body":"playing since season 2 and this is the ugliest change i've seen. also seems really boring and the obvious telegraphing is only going to make it worse.\r\n.. also the first thing to ever make me comment. ","replies":[]},{"poster":"NukDatJuke","date":"2016-01-13T21:56:04.727+0000","up_votes":4,"down_votes":2,"body":"The rework made the skins look way WAY better.\r\nRito trying to get us to buy Shen's skins smh.\r\nwp rito wp","replies":[]}]}