{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2017-04-07T04:56:54.736+0000","title":"New Client Rollout - Phase 2","subforum":"The News Hour","up_votes":0,"down_votes":1,"body":"[ÜRES]","replies":[{"poster":"FlamingPedoBearZ","date":"2017-04-10T03:43:15.403+0000","up_votes":13,"down_votes":0,"body":"My laptop is bad so I cant use new client, please don't remove legacy client :'(","replies":[{"poster":"Mindstar","date":"2017-04-10T06:09:18.697+0000","up_votes":9,"down_votes":5,"body":"What kind of laptop do you have? What happens when you try and use the updated client?","replies":[{"poster":"Kayle Minogue","date":"2017-04-10T12:34:31.067+0000","up_votes":11,"down_votes":0,"body":"I think he is talking about his CPU not being able to run the client without losing frames, even with the low spec mode the client still feels unusable for people with low end PC's.","replies":[]},{"poster":"Eskidon","date":"2017-04-13T09:58:51.177+0000","up_votes":2,"down_votes":0,"body":"Mine is just very lagged into and out of champ select ... normal games I am almost always support due to this.","replies":[]},{"poster":"Mashiro Shina","date":"2017-04-13T00:48:30.284+0000","up_votes":2,"down_votes":0,"body":"Yeah, the biggest problem is after the game, it takes FOREVER for the client to bring up scores, stats, mastery and IP.","replies":[]},{"poster":"Exclusive Thøt","date":"2017-05-02T19:40:30.206+0000","up_votes":1,"down_votes":0,"body":"Why do you keep suggesting this? it's more useless than the low-spec mode, it does nothing to help.","replies":[]}]}]},{"poster":"Trin","date":"2017-04-09T23:52:33.147+0000","up_votes":2,"down_votes":31,"body":"***","replies":[{"poster":"StealthDude","date":"2017-04-10T02:33:30.457+0000","up_votes":25,"down_votes":5,"body":"stop advertising your shitty discord server","replies":[]}]},{"poster":"Devilursh","date":"2017-04-10T05:18:06.454+0000","up_votes":4,"down_votes":1,"body":"um i have a question? when is riot going to fix the pregame lobby ? cos at the moment the client takes ages to get into the lobby, some people call and it doesnt show up in chat, i know cos its happened to me, and for those who have a slightly slower pc then everyone else, they are forced into sup roles for 85% of their games. riot pls fix. #extremelydissappointedwithriot\r\n","replies":[{"poster":"Akaloli","date":"2017-04-10T05:29:50.961+0000","up_votes":8,"down_votes":0,"body":"Now that everyone is using the beta client, they'll all have the same problem. Failing that, try turning on low-spec mode for a smoother experience.\r\n\r\n{{sticker:slayer-jinx-catface}} ","replies":[{"poster":"xXTechMasterXx","date":"2017-04-10T23:06:56.199+0000","up_votes":2,"down_votes":0,"body":"I had the same problem a while back, a simple reinstall fixed it however.","replies":[]}]}]},{"poster":"Synrosu","date":"2017-04-10T05:22:16.406+0000","up_votes":9,"down_votes":3,"body":"I personally like the new 'hextech' style and futuristic feel of the new client. league of legends has been around for ten years and it's always great to see when features improve or features that are added. It may be a shame for some people that the legacy client is being removed but it's always good to move forward over the years as league of legends becomes a better game.","replies":[{"poster":"captainnaysmith","date":"2017-04-11T04:14:16.675+0000","up_votes":4,"down_votes":0,"body":"not everyone computer can handle the new client. i get 5 seconds to pick a champ if my pick get banned. Masteries cant be selected, if i dc it wont reconnect","replies":[]}]},{"poster":"ASIS","date":"2017-04-10T01:40:33.554+0000","up_votes":13,"down_votes":7,"body":"Awesome, so we are being forced to use an unfinished client that doesn't even have item sets yet... Oh how I love riot right now...","replies":[{"poster":"Mindstar","date":"2017-04-10T06:11:43.147+0000","up_votes":10,"down_votes":4,"body":"We're confident that the updated client is ready to go - if we weren't we wouldn't be rolling it out.\r\n\r\nThere has been a lot of discussions and feedback around item sets - and we've certainly heard the message.  They won't be in the upgraded client initially but they will be worked on in the future.   In the mean time you will still be able to use third party sites and the API to keep your sets up to date!\r\n\r\nCheers\r\nMindstar","replies":[{"poster":"You Pawn","date":"2017-04-10T21:10:41.176+0000","up_votes":4,"down_votes":4,"body":"Once again a Riot employee just ignores all the suggestions all of have made here.\r\n\r\nWho cares about you guys telling us how to make our Client better, what the F*** do you lot know about making games. That's it we wont be asking you guys anything anymore just use the client or F*** off gees.","replies":[{"poster":"Gehirn","date":"2017-04-11T00:25:39.757+0000","up_votes":7,"down_votes":2,"body":"We know you want item sets. I want item sets. Thing is that you and I are the extreme outliers.\r\n\r\nItem sets was initially not prioritized as a feature because almost nobody used it. We've certainly changed that to at least being a feature we will ship in the new client eventually, but getting the client working for all players is still a **higher priority as it affects more players**. Unfortunately this does involve moving more players over to the new client so that we can continue to work out the kinks.","replies":[{"poster":"captainnaysmith","date":"2017-04-11T04:16:52.640+0000","up_votes":2,"down_votes":0,"body":"one thing about the new client i dont like is how much lag I get, that the reason I loved about the old client, no lag, it gotten better but it almost unusable sometimes","replies":[]}]},{"poster":"You Pawn","date":"2017-04-11T08:14:52.577+0000","up_votes":3,"down_votes":2,"body":"Agent Mindstar how much do they pay for the shitt you just said{{sticker:slayer-jinx-unamused}} ","replies":[]}]}]}]},{"poster":"Project Xayah","date":"2017-04-10T02:10:07.349+0000","up_votes":4,"down_votes":5,"body":"Before anyone decides to complain about being forced into the client update, you should know that Riot considers OCE the \"test\" server. It's the sole reason we get patches before other servers, because Riot uses OCE as a way to find bugs faster.\r\n\r\nYou're whining will not change how Riot views OCE.","replies":[{"poster":"Gehirn","date":"2017-04-11T00:21:46.618+0000","up_votes":6,"down_votes":2,"body":"OCE was the first to join the client alpha test last year so it made sense to be the first to fully transfer to the new client.\r\nSome other servers will be following closely behind.\r\n\r\nYes this does involve being the ones who have to bear the brunt of problems sometimes, but Riot OCE did not allow the change to being the first to patch/first to get features on the premise that we would be considered \"the test server\".\r\nIf anyone in Riot starts believing that, we'd need to have some serious conversations about why that's NOT allowed to be the case.\r\nPatching first, at the time we do so, actually gives teams around the world much more capability to assist if things go wrong, and quickly follow up on a fix or revert.\r\n\r\nWe get the newest features first, and most of the time there are no problems. So for now we consider it a net positive gain that we are usually first in line for new stuff.","replies":[]}]},{"poster":"IDragonSlayer","date":"2017-04-10T05:33:45.309+0000","up_votes":3,"down_votes":1,"body":"I can't even call my roles because it wouldn't let me type because it freezes and before i get in in the lobby and when i pick a champ it freezes again so i couldn't pick a rune and mastery. the background moves but it wont respond. this is all on low spec mode. it uses up too much CPU for a game client i reckon.{{summoner:3}} ","replies":[{"poster":"DEADLY RANGA","date":"2017-04-10T12:16:57.334+0000","up_votes":3,"down_votes":1,"body":"You may need a new pc sounds like your running on a potatoe","replies":[{"poster":"TheOfficalKing","date":"2017-04-11T08:56:20.906+0000","up_votes":2,"down_votes":1,"body":"No one said a newer pc would be needed to play an ugly game. there is no sound reason why the legacy client should be removed. Im also on a potato, i am poor and need food not a pc that'll cost 400 at the cheapest.","replies":[{"poster":"DEADLY RANGA","date":"2017-04-11T10:57:00.261+0000","up_votes":2,"down_votes":1,"body":"Well I'm sorry to hear that you are not in a positive financial state maybe you should focus on that instead of investing time in video games they are a luxury not a necessity.  ","replies":[{"poster":"Ryestorm","date":"2017-04-12T01:04:56.318+0000","up_votes":3,"down_votes":0,"body":"Money should not be an obstacle when trying to enjoy a game that you could play before. By requiring the players to spend more money to play the exact same game is not fair. So you cannot bring the argument of \"spend less time on games\" when the previous client worked before to suit the needs of players computers. \r\n\r\nI honestly liked the old client more, simpler, faster and less ping.\r\nI understand why Riot decided to force the upgrade, running two clients would require much more energy. But when it stops a large amount of people from playing the game, it is not fair to those who cannot afford to upgrade, whether it be for reasons in our out of there control.\r\n\r\nThese are just my thoughts on the matter, feel free to comment back and I will give my view again. ","replies":[]}]},{"poster":"The lnquisition","date":"2017-04-11T13:10:09.240+0000","up_votes":2,"down_votes":0,"body":"There should at least be an option instead of using the new shit client, my computer doesnt even have any issues with it I just fucking hate it learn to leave things as they were Riot instead or trying to \"Improve\" cause you just keep ruining the game over and over ","replies":[]}]}]},{"poster":"Kaaboose","date":"2017-05-01T03:24:59.205+0000","up_votes":1,"down_votes":0,"body":"Turn on low spec mode. It helps a LOT\r\n","replies":[]}]},{"poster":"Kirito sao 73","date":"2017-04-10T12:12:54.118+0000","up_votes":2,"down_votes":0,"body":"What about the stats for normals? while they seemed meaningless not having them shows how usefull they were","replies":[{"poster":"Gehirn","date":"2017-04-11T00:01:11.669+0000","up_votes":2,"down_votes":0,"body":"Hey there, can you give me an example of some of the stats for normal games that are missing in the new client?","replies":[{"poster":"Spixie","date":"2017-04-11T01:17:56.332+0000","up_votes":1,"down_votes":0,"body":"All of the stats for normals, no wins nothing. You can't see anything to do with normals on your profile.","replies":[{"poster":"Gehirn","date":"2017-04-11T08:28:51.576+0000","up_votes":3,"down_votes":0,"body":"I understand, thanks for the feedback. I've passed it on to the new client team.","replies":[]}]}]}]},{"poster":"Asai Fubuki","date":"2017-04-10T14:51:17.738+0000","up_votes":3,"down_votes":0,"body":"speaking of updates and stuff, will you bring back the live spectator thing that was taken out quite some time ago, i did always find it fun to just put games on in the background. without a streamer and what not.\r\nif you aren't planning to bring it back, tis all good, just inquiring.","replies":[{"poster":"DiabloWolf","date":"2017-04-10T23:32:54.131+0000","up_votes":1,"down_votes":2,"body":"I think they got rid of it because of ghosting and stuff ","replies":[{"poster":"Asai Fubuki","date":"2017-04-11T08:18:31.252+0000","up_votes":3,"down_votes":0,"body":"if you ghosted with a 3 minute delay, that's magical.\nit was merely just an option to spectate random players who weren't on your friends list, ranked, normals, arams.\nit wasn't literally live .-.","replies":[]}]}]},{"poster":"Ravishing Dawn","date":"2017-04-10T06:17:32.220+0000","up_votes":2,"down_votes":2,"body":"great, now i will have to quit league because every time i try the new client, it doesnt let me get into champ select. thanks rito :))))","replies":[{"poster":"Gehirn","date":"2017-04-11T00:10:13.140+0000","up_votes":4,"down_votes":1,"body":"If you're having a serious problem trying to get into game with the new client, do try a full repair, otherwise please lodge a support ticket as finding and fixing these problems for everyone is a priority.\r\nsupport.riotgames.com","replies":[]}]},{"poster":"XeMurder","date":"2017-04-10T10:11:37.397+0000","up_votes":2,"down_votes":0,"body":"Will I be able to get over 15FPS on the new client (compared to 40 on the old)?\r\nOr will you just ignore that it has shit performance, even with \"low-spec\" mode?","replies":[{"poster":"Gehirn","date":"2017-04-11T00:04:29.372+0000","up_votes":4,"down_votes":1,"body":"I can get 80 FPS on my 4 year old PC without low spec mode. Have you tried the \"Close client during game\" option? It's available on the same settings page as low spec mode. Though, it will make the client have to load up after each game which will take 20-30 seconds.","replies":[]}]},{"poster":"Indigoism","date":"2017-04-10T22:41:05.380+0000","up_votes":5,"down_votes":7,"body":"IM SO PISSED. STOP FORCING THE NEW CLIENT ON US WE DONT FRICKEN LIKE IT","replies":[{"poster":"DiabloWolf","date":"2017-04-10T23:30:37.719+0000","up_votes":5,"down_votes":1,"body":"YOU don't like it, for me it's amazing and easy to use. This will allow riot to update one client and get more out to the public instead of minuscule updates for both clients.","replies":[]}]},{"poster":"Yeah I IELTS 777","date":"2017-04-11T12:28:25.418+0000","up_votes":2,"down_votes":0,"body":"First, change region from OCE to NA and switch to legacy client, and change region back in legacy client. -To anyone still want to use the old one :)","replies":[]},{"poster":"Xenorai","date":"2017-04-10T08:34:44.411+0000","up_votes":3,"down_votes":1,"body":"The new client is great, it has a clean-looking setup and everything\r\nMy only problem is after a game ends, it takes forever to get to the post-game lobby\r\nIt is ridiculously slow for me and it gets really annoying\r\nIs there a setting for this to be faster? Or is it like this always?","replies":[{"poster":"TitusBlackwell","date":"2017-04-10T08:40:49.492+0000","up_votes":2,"down_votes":1,"body":"Check your client options, and see if you have the option to close the client while playing selected (I think it used to be tied into low-spec mode, but now it's its own option) It's for people like me running it on a glorified graphics calculator who get crippled by having the client chugging along in the background :P","replies":[]}]},{"poster":"Waiben","date":"2017-04-10T03:10:38.422+0000","up_votes":4,"down_votes":2,"body":"I don't understand the ideology behind Riot. Why not just remake the legacy client? In terms of design wise IMO there's nothing really wrong with it. I feel like the problem here is that Riot are FORCING users to use a client they don't want to. What they don't understand is the reason the majority of users dislike the new client is because it looks and feels way too different.","replies":[{"poster":"i8u2manytimes","date":"2017-04-10T08:18:00.427+0000","up_votes":3,"down_votes":1,"body":"to be fair, this was said about the hud in-game at least 50 times, I don't think it will be as bad as you say since we adjusted to that quickly\r\n","replies":[]},{"poster":"DiabloWolf","date":"2017-04-10T23:36:10.733+0000","up_votes":2,"down_votes":1,"body":"They can't remake the legacy without using the same old tech the new one is built of newer programs that allow for more features, yes people seem to not get the performance on it, but this allows for riot to see this and change it further as they can actually see how it's going instead of only the people who liked the new client Int'l using it ","replies":[]}]},{"poster":"Thanos","date":"2017-04-10T06:21:06.645+0000","up_votes":3,"down_votes":1,"body":"{{summoner:31}} ","replies":[]},{"poster":"PurrfectMistake","date":"2017-04-10T09:52:56.035+0000","up_votes":6,"down_votes":10,"body":"For all you people complaining of problems with the client, here's how to fix it:\r\n\r\nStep 1: Throw out your pc\r\nStep 2: Get a new / better one\r\nStep 3: Profit\r\n\r\nNow stop complaining about riot working on their game. If your pc is THAT trash you can't handle the client without low-spec mode, then you shouldn't play games on that pc. Simple as that. Just be happy you CAN play league on your potato computer.\r\n\r\nGrow up and stop complaining. <3","replies":[{"poster":"XeMurder","date":"2017-04-10T10:07:59.057+0000","up_votes":3,"down_votes":2,"body":"How about you grow up and accept most people can't just get a new computer?","replies":[]}]}]}