{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2019-09-17T15:00:06.245+0000","title":"Join Us Oct. 16th to Celebrate 10 Years of League","subforum":"The News Hour","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"FallenFreaK","date":"2019-09-18T06:40:11.150+0000","up_votes":24,"down_votes":2,"body":"Riot is now at its peak because of TFT, not because of league of legends. League of legends is starting to lose popularity, hasn't been any new content since the Odyssey event. They have said they are basically not making any PVE events because it takes up too many resources, and for some reason have removed rotating game modes. And on top of that removing twisted treeline. So all we are left with is ranked, and norms. Riot has lost it honestly. They are a money making company and not a game developer, and if you think tft is their game your wrong, its a cope of DOTA's Autochess. And another thing I loved about League was the lore and skins that attached to that lore. Now they release skins like its candy store. Riot needs to look itself in the mirror and listen to its playerbase. I absolutely adored this game, but its going down the drain. Heartbreaking really. {{sticker:sg-soraka}} {{sticker:sg-shisa}} ","replies":[{"poster":"TheBioB","date":"2019-09-18T12:01:39.930+0000","up_votes":1,"down_votes":0,"body":"I completely agree! If managed correctly TFT should not soak up resources. Just keep the same team on League, they did amazingly a year ago. And add new staff to work on TFT. [Don't half ass 2 things. Whole ass 1 thing.](https://www.google.com/url?sa=i&amp;source=images&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwihrt6kqdrkAhXi7HMBHVi4AN4QjRx6BAgBEAQ&amp;url=%2Furl%3Fsa%3Di%26source%3Dimages%26cd%3D%26ved%3D%26url%3D%252Furl%253Fsa%253Di%2526source%253Dimages%2526cd%253D%2526ved%253D2ahUKEwiwypieqdrkAhVX7HMBHX5bAVIQjRx6BAgBEAQ%2526url%253Dhttps%25253A%25252F%25252Fgiphy.com%25252Fgifs%25252Fmaid-in-manhattan-LwdtMSGiQ0Ako%2526psig%253DAOvVaw0yQSWP0xaq17Rxzw1uwVGS%2526ust%253D1568894402393246%26psig%3DAOvVaw0yQSWP0xaq17Rxzw1uwVGS%26ust%3D1568894402393246&amp;psig=AOvVaw0yQSWP0xaq17Rxzw1uwVGS&amp;ust=1568894402393246)","replies":[{"poster":"TheBioB","date":"2019-09-18T12:11:26.248+0000","up_votes":3,"down_votes":0,"body":"\r\nAnd I 1000% agree with PvE being amazing! The should NOT get rid of it! Investing time into PvE as a big thing would be incredible since compared to other PvE games like WoW. League has better graphics, controls, diversity and mechanics. These games did well, League would dominate this genre without a doubt. But that's a dream that will never happen espcially considering they're not even releasing a small-scale PvE game mode this year.","replies":[]}]},{"poster":"SlyMoose","date":"2019-09-19T05:21:12.938+0000","up_votes":2,"down_votes":0,"body":"Amenn brother, I agree\r\n","replies":[]},{"poster":"Snurt","date":"2019-09-18T09:08:55.276+0000","up_votes":2,"down_votes":0,"body":"the worst thing is that the current systems are inefficient at making money, tft isnt monetised properly, every mercch thing they release is limited edition and most of their consistent merch is not that great. Seriously like the little legends system isnt effective for making money just because you have to gamble if you could just buy them or roll the dice it would be more money making. also not putting tft on mobile. Like if they were good at making money then we might have a better game","replies":[]}]},{"poster":"blazindaily","date":"2019-09-17T20:35:28.898+0000","up_votes":15,"down_votes":0,"body":"Just wondering by chance would we be able to change the logo back in settings like the mouse cursor?","replies":[{"poster":"Shifter02","date":"2019-09-18T10:51:47.894+0000","up_votes":3,"down_votes":0,"body":"And the old launcher, collection tab and update screen too...","replies":[]}]},{"poster":"LynnbDsW","date":"2019-09-17T15:33:10.230+0000","up_votes":12,"down_votes":1,"body":"Let me be one of the first to say that new logo has a lot to live upto.\r\n\r\nWondering if it ever will","replies":[]},{"poster":"ROBB1E","date":"2019-09-18T02:04:20.337+0000","up_votes":12,"down_votes":3,"body":"Yo Riot - wanna maybe focus on the game instead of introducing an awful Logo change that doesn't represent the game at all and instead looks like a WordArt abomination? 10th Anniversary is meant to be big and this already sounds disappointing. \"lets talk about preseason and TFT\"? No-one gives a damn about it, just do it. And if you have 8 million concurrent players in League, how about you listen to them and actually make some changes people wanna see? Esepcially with the coming patch where you're basically making top laners screech in agony.","replies":[]},{"poster":"TheBioB","date":"2019-09-18T01:56:19.160+0000","up_votes":8,"down_votes":0,"body":"Okay Riot! You promised me a really special event for the 10th anniversary. You haven't done anything interesting since Odyssey: Invasion was released. \r\n\r\nI guess TFT was interesting until I realized I would have to spend hours relearning the game each patch (patches that seem to happen every 2 weeks) - which I do not have time for. \r\n\r\nI decided to quit League until this anniversary event because there was nothing interesting happening. It better be better than 1 rotating game mode (we used to get game modes all the time). And a TFT patch we most people don't care about.","replies":[]},{"poster":"Darked","date":"2019-09-18T06:42:26.400+0000","up_votes":7,"down_votes":0,"body":"New Logo is actually terrible, please do a whole reversion thankyou &lt;3","replies":[]},{"poster":"SlyMoose","date":"2019-09-19T05:20:46.374+0000","up_votes":5,"down_votes":0,"body":"What is there to celebrate ya dogs, give us rotating game modes and give us back normal urf back. Bro I've been playing this game since about season 3, this game has just gotten worse and worse.","replies":[]},{"poster":"Shifter02","date":"2019-09-18T10:57:34.346+0000","up_votes":5,"down_votes":0,"body":"Could we please begin to revert back to season 8/7, probably the most eventful time and the log in screens most dynamic period. Having more game modes after the 10th anniversary would be great as it would show more support into league, not TFT...","replies":[]},{"poster":"Felain","date":"2019-09-18T01:12:27.580+0000","up_votes":4,"down_votes":0,"body":"I think I prefer the original League logo, it will always have a place in my heart. ;w; The new one just doesn't have the same feel to it. T.T","replies":[]},{"poster":"FallenFreaK","date":"2019-09-18T06:41:46.555+0000","up_votes":6,"down_votes":2,"body":"And to comment on this 10 year anniversary, its pathetic. If they don't pull something awesome out of the bag then there is gonna be SO many disappointing fans and players. Including me","replies":[]},{"poster":"Just wait Alan","date":"2019-09-17T23:19:02.124+0000","up_votes":6,"down_votes":2,"body":"We wanna URF!!!!","replies":[]},{"poster":"Neroyh","date":"2019-09-18T04:59:12.516+0000","up_votes":3,"down_votes":0,"body":"If it ain't broke there isn't any need to change it rito","replies":[]},{"poster":"imkk","date":"2019-09-17T16:08:30.948+0000","up_votes":4,"down_votes":1,"body":"Urf?","replies":[]},{"poster":"Ray Bloom","date":"2019-09-17T21:52:34.391+0000","up_votes":5,"down_votes":2,"body":"Haha riot go and put lux in background of logo. Is this a sign of yet another lux skin.","replies":[]},{"poster":"Call me AAKAA","date":"2019-09-18T08:22:30.009+0000","up_votes":3,"down_votes":7,"body":"lot of em raging c*nts here hating on the game, demanding shiet like they paid for the access to it. its riots shiet. its free. appreciate what you get mates.","replies":[{"poster":"Snurt","date":"2019-09-18T09:10:06.091+0000","up_votes":5,"down_votes":0,"body":"im more pissed that actually spending money on this game feels like shit","replies":[]}]},{"poster":"Raddy26","date":"2019-09-23T04:43:47.704+0000","up_votes":2,"down_votes":0,"body":"I've said it before but ill say it again. Season 9 has been an abomination! listen to your \"8 million concurrent players\" Riot and fix some stuff we have been asking for ALL SEASON. Also the new login, collection menu and logo aren't doing much for you. \"if it isn't broken don't fix it\" take that advice guys.  ","replies":[]},{"poster":"Green Out","date":"2019-09-19T12:52:30.326+0000","up_votes":2,"down_votes":0,"body":"It's been a long ride, 10 years of playing League of Legends... I tell you the graphics back in those days... I thought my eyes were going to rot playing those pixelated champions.. I remember leaving a comment during closed beta. I'll play it if you change the graphics.. 10 years, here I am leaving yet another post.\r\n\r\nGood job Riot, you did a heck of a good job to keep us players interested with new gimmicks and whatnots it's not easy to create such a big user database and you should be proud of it.\r\n\r\nIf there was anything you could do, please, please please buff teemo, and ban him from ranked.\r\n","replies":[]},{"poster":"Todday","date":"2019-09-18T22:09:51.210+0000","up_votes":2,"down_votes":0,"body":"TFT is killing your game. Not in the way that that more people enjoy TFT but that you think TFT is going to last and your putting too much resources into it and doing nothing to keep LoL healthy ","replies":[]},{"poster":"MinusPlus","date":"2019-09-18T21:39:09.861+0000","up_votes":2,"down_votes":0,"body":"{{sticker:sg-soraka}} ","replies":[]},{"poster":"Stince","date":"2019-09-18T04:06:17.409+0000","up_votes":3,"down_votes":1,"body":"The hate tho oof...","replies":[{"poster":"durandle","date":"2019-09-23T14:30:02.218+0000","up_votes":1,"down_votes":0,"body":"it really feels like eternals was the breaking point for most of the player base","replies":[]}]},{"poster":"Djuel","date":"2019-09-17T15:32:40.610+0000","up_votes":3,"down_votes":2,"body":"Cool Beans","replies":[]},{"poster":"de64","date":"2019-09-17T20:18:33.904+0000","up_votes":2,"down_votes":1,"body":"pgogers","replies":[{"poster":"GrimBubbles","date":"2019-09-19T05:24:34.205+0000","up_votes":1,"down_votes":0,"body":"poggers ","replies":[]}]},{"poster":"knightwik123","date":"2019-09-17T15:35:39.692+0000","up_votes":2,"down_votes":1,"body":"Is there going to be any sort of reward or msiions for players to receive to commemorate the anniversary) ","replies":[{"poster":"knightwik123","date":"2019-09-17T15:36:01.188+0000","up_votes":1,"down_votes":1,"body":"missions*","replies":[]}]},{"poster":"XD44556","date":"2019-10-17T09:54:03.049+0000","up_votes":1,"down_votes":0,"body":"lol","replies":[]},{"poster":"Beetle Blast","date":"2019-09-22T06:30:02.175+0000","up_votes":1,"down_votes":0,"body":"please for the love of god, do not change the logo to...whatever that is. I get whoever made this has impressive Microsoft Word Art skills, but that does not look like a logo for the \"most popular game on pc\".\r\n\r\nIf it ain't broke, don't fix it.","replies":[]},{"poster":"12YearOldIndian","date":"2019-09-17T20:03:03.388+0000","up_votes":1,"down_votes":3,"body":"dunkey","replies":[]},{"poster":"ManuNz","date":"2019-09-18T03:35:15.492+0000","up_votes":4,"down_votes":9,"body":"Why are people hating on riot? Just suck it up and enjoy what they have to present.\r\n ","replies":[]}]}