{"poster":"Kerpłunk","date":"2017-08-14T17:48:13.009+0000","title":"Jungla en AR URF","subforum":"Charlas Generales","up_votes":2,"down_votes":3,"body":"ustedes que opinan?\r\nrinde un jungla en AR URF o no?\r\nya me tocaron varias partidas en AR URF donde a los que les toca champs jungla,se ponen castigo y se van a junglear...levean mas lento y no rinde en nada ya que el 90% de los que juegan AR URF van 2 en Top,2 en Bot y 1 en Mid...\r\nmi opinion es que no rinde en nada y no lo digo por decir,sino porque todas las partidas que me tocaron asi...se perdieron por tener &quot;un jugador menos&quot;","replies":[{"poster":"Mayushi","date":"2017-08-14T17:52:57.016+0000","up_votes":1,"down_votes":0,"body":"obvio q no rinde... tampoco rinde objetivos como baron o drag, si los haces te hacen backdoor terrible y te botan la base en 15 segundos, ya perdi muchas asi xD","replies":[{"poster":"Mr ØwO","date":"2017-08-14T18:01:45.597+0000","up_votes":3,"down_votes":0,"body":"Pero si el baron y los dragones se hacen a los mucho en 10 segundos xD\n\n-La lechuza dormilona-\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"LCA","date":"2017-08-14T18:16:01.435+0000","up_votes":1,"down_votes":0,"body":"segun yo si rinde ir con un jg, pero sin smite y dejar en linea a alguien que sea de bastante rango.","replies":[]}]},{"poster":"Kerpłunk","date":"2017-08-14T18:52:08.058+0000","up_votes":1,"down_votes":0,"body":"los drake,heraldo y baron solo los hago si la line esta pusheada.ya que con el poco cd que hay lo haces muy rapido...pero otra cosa diferente es ponerse a farmear en la jg y dejar a un solo champ de tu team contra 2...","replies":[]}]},{"poster":"lordeman10","date":"2017-08-14T21:24:49.964+0000","up_votes":1,"down_votes":0,"body":"aprovecha el farm de la jg, pero no intentes junglear como si fuera una normal porque no funciona así\n\nyo siempre que puedo pusheo la linea y me voy a limpiar algún campamento","replies":[]},{"poster":"Lucio22","date":"2017-08-14T19:16:56.037+0000","up_votes":1,"down_votes":0,"body":"o sea, me puedo drogar y llegartelo a entender si sos shyvanna (por la pasiva fea que le dieron que tiene que hacer dragons), pero en lineas generales, diria que no rinde","replies":[]},{"poster":"rokushoger","date":"2017-08-14T18:27:02.693+0000","up_votes":1,"down_votes":0,"body":"A mi gusto no, 2 champ contra uno con esos cd imposibles y oro aumentado por segundo con lo que no necesistas comprar es demasiado para 1 solo campeón.","replies":[]}]}