{"poster":"SleazySam","date":"2017-01-30T06:33:13.300+0000","title":"Ich bin toxic, holt mich hier raus.","subforum":"Spielerverhalten & Moderation","up_votes":15,"down_votes":7,"body":"Hallo,\r\n\r\nlustiger Titel, aber eigentlich doch ziemlich ernst gemeint. Ich hab es bisher in meiner LoL-Laufbahn auf 2 Permabans und 2 weitere 2 Wochenbans geschafft. Ich sollte glaub ich einfach ein Hobby daraus machen. Ich bin ein sehr emotionaler Spieler. L&auml;uft ein Spiel gut, bin ich der gl&uuml;cklichste Mensch der Welt, l&auml;uft ein Spiel schlecht bin ich einfach todes toxic! Ich habe schon alles versucht: Kissen schlagen, aufstehen und rumlaufen, schreien (mein Mitbewohner findet letzteres garnicht cool), usw. usw. Ich habe mir sogar jetzt &uuml;berlegt, vllt einfach alle Matches aufzunehmen und eine lustige YouTube-Serie zu machen, in der ich mich &uuml;bertrieben aufrege. Aber alles in allem habe ich ein echtes Problem damit. Ich fand bisher gemessen an dem System, das Riot hat jeden Ban gerechtfertig: Ich w&uuml;rde mich selber auch Bannen ^^. (Ob das System an sich Sinn hat, dar&uuml;ber reden wir einfach mal nicht :D) Deshalb brauche ich eure Hilfe, Ideen oder was auch immer, damit ich nicht meinen 3. und 4. Account jetzt in den Permaban treibe. \r\n\r\nDanke schonmal und mfG\r\n\r\nSleazySam","replies":[{"poster":"Humpelstilzche","date":"2017-01-30T08:18:19.979+0000","up_votes":13,"down_votes":0,"body":"> Ich habe schon alles versucht: Kissen schlagen, aufstehen und rumlaufen, schreien\n\nIch kann dich beruhigen, denn das ist keinesfalls \"alles\". Das ist im Prinzip eine einzige Methode, nur verschiedene Formen davon. Und du musst dich auch nicht wundern oder schlecht fühlen, weil das nicht funkioniert hat, denn die Methode \"den Ärger rauszulassen\" ist trotz seiner Popularität totaler Unsinn und kann garnicht funkionieren. Die Methode basiert auf der sogenannten Dampfkessel-Theorie von Konrad Lorenz, ein Psychologe der Anfang des 20. Jahrhunderts aktiv war. \nDiese Theorie besagt, dass sich im Menschen eine nicht weiter definierte \"aggressive Energie\" bildet, die man, ähnlich wie bei einem Dampfkessel, gelegentlich ablassen muss, damit es nicht zum Überdruck kommt und man \"explodiert\". \nDiese Theorie war relativ populär ist es bis heute. Sie wurde allerings schon vor langer Zeit experimentell überprüft und für falsch befunden. Seine Aggressionen rauszulassen indem man aggressive Handlungen (wie z.B. ein Kissen schlagen) durchführt verringert die spätere Aggression in keinster Weise. Im Gegenteil sorgen derartige Handlungen eher dafür, dass aggressive Gefühle über einen noch längeren Zeitraum künstlich aufrecht erhalten werden. \n\nLong story short: Aggressionen rauslassen funktioniert nicht und kann es sogar noch schlimmer machen. Aggressionen müssen verarbeitet, nicht rausgelassen werden. \n\n>  Ich habe mir sogar jetzt überlegt, vllt einfach alle Matches aufzunehmen und eine lustige YouTube-Serie zu machen, in der ich mich übertrieben aufrege.\n\nDas würde ich nicht empfehlen. Wäre zwar vlt (je nach Humor) lustig, aber würde deinem Ziel weniger aggressiv zu sein eher schaden. Denn auch hier ist es ähnlich wie oben beschrieben mit den aggressiven Handlungen: So zu tun als wärst du wütend, verstärkt deine tatsächliche Wut eher und erhält sie künstlich aufrecht. Nicht zuletzt kann das ständige \"in Aggressionen schwelgen\" auch zu gesundheitlichen Problemen führen. Menschen die oft und lange aggressiv sind, bekommen gerne mal Probleme mit dem Magen oder dem Herz, ganz zu schweigen von den psychischen Auswirkungen. \n\nSo, jetzt zu den Sachen die tatsächlich funkionieren.  \n\n\n1. Pausen\nDas klingt nicht sehr innovativ, ist aber vermutlich die beste aller Methoden die du finden wirst. Diese Methode lässt sich biologisch begründen und lässt sich außerdem durch Riots empirische Forschung bestätigen. \nBiologisch betrachtet sind Pausen deshalb super, weil Aggression sehr viel mit Hormonen zu tun hat. Ärgerst du dich, wird dein Körper mit diversen Chemikalien geflutet. Einige davon verlfiegen in wenigen Sekunden wieder, einige aber auch nicht. D.h. selbst wenn du Aggressionen emotional verarbeitet hast (dich also z.B. selbst irgendwie beruhigt hast und dich nicht mehr ärgerst), schwimmen nach wie vor irgendwelche Substanzen durch deinen Körper, die mit der aggressiven Reaktion zu tun haben und dich dünnhäutiger, also anfälliger für weitere Aggressionen machen. Der Abbau dieser Hormone beansprucht einfach Zeit und lässt sich nicht beschleunigen. Bei einigen Hormonen dauert es nur ein paar Minuten, bei einigen etwa 20 Minuten, bei manchen sogar Stunden bis sie vollständig abgebaut sind. \nPausen von mehreren Stunden sind sicherlich zu viel verlangt, aber zumindest eine 10-minütige Pause nach einem frustrierenden Spiel kann wahre Wunder bewirken. Wichtig ist dabei nur, dass du in diesen 10 Minuten irgendwas anderes machst, also dir nach Möglichkeit in dieser Zeit nicht darüber den Kopf zerbrichst, was dich im letzten Spiel so geärgert hat. Zock irgendwas anderes, les irgendwas, koch dir nen Kaffee oder sowas oder tu sonst irgendwas, was dich für 10 Minuten beschäftigt. \nWie bereits erwähnt legt auch Riots Forschung nahe, dass diese Methode funktioniert. Denn die haben rausgefunden, dass Toxicitiy hauptsächlich von den Spielern kommt, die (häufig durch bloßen Zufall) mehrere frustrierende Spiele hintereinander haben. D.h. dieses \"stapeln\" von frustrierenden Spielen ist tatsächlich ein wesentlicher Faktor. Dementsprechend wirkungsvoll ist es, das mit Pausen zu verhindern. \n\n2. Die SivHD-Methode\nIch weiß nicht ob diese Methode in der psychologischen Therapie ein Namen hat, aber ich hab sie mal dem Youtuber benannt, der sie in einem Video mal sehr gut vorgestellt hat. Im Endeffekt geht es dabei um das, was ich vorher gesagt habe: Seine Aggressionen verarbeiten. Und zwar indem man rational darüber nachdenkt und sich überlegt, welche Auswirkungen das frustrierende Ereignis in einem Jahr haben wird. In LoL ist es nämlich in aller Regel so, dass das was passiert absolut überhaupt keinen Einfluss auf dein Leben in einem Jahr haben wird. Es ist einfach komplett irrelevant, nichts ändert sich. Dementsprechen sinnlos ist es, sich darüber groß aufzuregen. Hier das Video, das ich dringend empfehle anzusehen: [How to never rage again](https://www.youtube.com/watch?v=vVtmV0FzW_0)\n\n3. Mentalität ändern\nBei dieser Methode geht es darum, das Problem an der Wurzel zu packen, d.h. etwas gegen die Ursache zu tun. Denn der Grund warum man sich in LoL überhaupt ärgert, ist, dass man frustriert wird. Und Frustration ist nichts anderes als das Gefühl, dass man hat, wenn selbstgesteckte Ziele nicht erreicht werden. Dementsprechend kannst du viel ändern indem du deine Ziele änderst. \nViele toxische Spieler machen einen kleinen Fehler bei ihrer Zielsetzung: Sie sind sehr stark darauf fokussiert, aufzusteigen. Das mag erstmal nicht so verkehrt klingen, ist aber problematisch. Denn wer aufsteigen als Ziel hat, der will unbedingt jedes Spiel gewinnen, denn jedes verlorene Spiel entfernt einen etwas mehr vom Ziel aufzusteigen. Dementsprechend frustrierend ist eine Niederlage, was natürlich insofern problematisch ist, da man in League 50% seiner Spiele verliert, völlig egal wie gut man ist. \nDiese Frustration kann man ändern, indem man sein Ziel ein kleines bisschen ändert, und zwar dahingehend, dass das Ziel ist besser zu werden. Das Ergebnis in Bezug auf den Rang ist gleich oder sogar besser. Spieler die sich nicht darauf fokussieren aufzusteigen, sondern darauf fokussieren besser zu werden, steigen genauso schnell oder sogar schneller auf. Sie haben aber ein viel kleineres Problem mit Niederlagen, da Niederlagen keineswegs dem Ziel besser zu werden widersprechen. Man kann auch besser werden, wenn man verliert. In einer harten Niederlage lernt man mehr als wenn man den Gegner ohne Gegenwehr wegstompt. \n\n\nWenn du diese 3 Methoden nutzt, ist der der Erfolg im Prinzip garantiert. Vielleicht nicht sofort; sich zu ändern geht nicht von jetzt auf gleich, aber wenn du dich von gelegentlichen Ausrutscher nicht demotivieren lässt und dich weiter darum bemühst etwas gegen dein Problem zu tun, solltest du Erfolg haben. Den schwersten Schritt hast du sowieso schon hinter dir, denn du WILLST weniger toxisch sein. Das ist im Prinzip schon die halbe Miete.","replies":[{"poster":"ElBeutel","date":"2017-01-30T23:01:55.129+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=KYnfKGf0,discussion-id=vAjOXJLL,comment-id=0004,timestamp=2017-01-30T08:18:19.979+0000)\n>\n> Ich kann dich beruhigen, denn das ist keinesfalls &quot;alles&quot;. Das ist im Prinzip eine einzige Methode, nur verschiedene Formen davon. Und du musst dich auch nicht wundern oder schlecht fühlen, weil das nicht funkioniert hat, denn die Methode &quot;den Ärger rauszulassen&quot; ist trotz seiner Popularität totaler Unsinn und kann garnicht funkionieren. Die Methode basiert auf der sogenannten Dampfkessel-Theorie von Konrad Lorenz, ein Psychologe der Anfang des 20. Jahrhunderts aktiv war. \n> Diese Theorie besagt, dass sich im Menschen eine nicht weiter definierte &quot;aggressive Energie&quot; bildet, die man, ähnlich wie bei einem Dampfkessel, gelegentlich ablassen muss, damit es nicht zum Überdruck kommt und man &quot;explodiert&quot;. \n> Diese Theorie war relativ populär ist es bis heute. Sie wurde allerings schon vor langer Zeit experimentell überprüft und für falsch befunden. Seine Aggressionen rauszulassen indem man aggressive Handlungen (wie z.B. ein Kissen schlagen) durchführt verringert die spätere Aggression in keinster Weise. Im Gegenteil sorgen derartige Handlungen eher dafür, dass aggressive Gefühle über einen noch längeren Zeitraum künstlich aufrecht erhalten werden. \n> \n> Long story short: Aggressionen rauslassen funktioniert nicht und kann es sogar noch schlimmer machen. Aggressionen müssen verarbeitet, nicht rausgelassen werden. \n> \n> Das würde ich nicht empfehlen. Wäre zwar vlt (je nach Humor) lustig, aber würde deinem Ziel weniger aggressiv zu sein eher schaden. Denn auch hier ist es ähnlich wie oben beschrieben mit den aggressiven Handlungen: So zu tun als wärst du wütend, verstärkt deine tatsächliche Wut eher und erhält sie künstlich aufrecht. Nicht zuletzt kann das ständige &quot;in Aggressionen schwelgen&quot; auch zu gesundheitlichen Problemen führen. Menschen die oft und lange aggressiv sind, bekommen gerne mal Probleme mit dem Magen oder dem Herz, ganz zu schweigen von den psychischen Auswirkungen. \n> \n> So, jetzt zu den Sachen die tatsächlich funkionieren.  \n> \n> \n> 1. Pausen\n> Das klingt nicht sehr innovativ, ist aber vermutlich die beste aller Methoden die du finden wirst. Diese Methode lässt sich biologisch begründen und lässt sich außerdem durch Riots empirische Forschung bestätigen. \n> Biologisch betrachtet sind Pausen deshalb super, weil Aggression sehr viel mit Hormonen zu tun hat. Ärgerst du dich, wird dein Körper mit diversen Chemikalien geflutet. Einige davon verlfiegen in wenigen Sekunden wieder, einige aber auch nicht. D.h. selbst wenn du Aggressionen emotional verarbeitet hast (dich also z.B. selbst irgendwie beruhigt hast und dich nicht mehr ärgerst), schwimmen nach wie vor irgendwelche Substanzen durch deinen Körper, die mit der aggressiven Reaktion zu tun haben und dich dünnhäutiger, also anfälliger für weitere Aggressionen machen. Der Abbau dieser Hormone beansprucht einfach Zeit und lässt sich nicht beschleunigen. Bei einigen Hormonen dauert es nur ein paar Minuten, bei einigen etwa 20 Minuten, bei manchen sogar Stunden bis sie vollständig abgebaut sind. \n> Pausen von mehreren Stunden sind sicherlich zu viel verlangt, aber zumindest eine 10-minütige Pause nach einem frustrierenden Spiel kann wahre Wunder bewirken. Wichtig ist dabei nur, dass du in diesen 10 Minuten irgendwas anderes machst, also dir nach Möglichkeit in dieser Zeit nicht darüber den Kopf zerbrichst, was dich im letzten Spiel so geärgert hat. Zock irgendwas anderes, les irgendwas, koch dir nen Kaffee oder sowas oder tu sonst irgendwas, was dich für 10 Minuten beschäftigt. \n> Wie bereits erwähnt legt auch Riots Forschung nahe, dass diese Methode funktioniert. Denn die haben rausgefunden, dass Toxicitiy hauptsächlich von den Spielern kommt, die (häufig durch bloßen Zufall) mehrere frustrierende Spiele hintereinander haben. D.h. dieses &quot;stapeln&quot; von frustrierenden Spielen ist tatsächlich ein wesentlicher Faktor. Dementsprechend wirkungsvoll ist es, das mit Pausen zu verhindern. \n> \n> 2. Die SivHD-Methode\n> Ich weiß nicht ob diese Methode in der psychologischen Therapie ein Namen hat, aber ich hab sie mal dem Youtuber benannt, der sie in einem Video mal sehr gut vorgestellt hat. Im Endeffekt geht es dabei um das, was ich vorher gesagt habe: Seine Aggressionen verarbeiten. Und zwar indem man rational darüber nachdenkt und sich überlegt, welche Auswirkungen das frustrierende Ereignis in einem Jahr haben wird. In LoL ist es nämlich in aller Regel so, dass das was passiert absolut überhaupt keinen Einfluss auf dein Leben in einem Jahr haben wird. Es ist einfach komplett irrelevant, nichts ändert sich. Dementsprechen sinnlos ist es, sich darüber groß aufzuregen. Hier das Video, das ich dringend empfehle anzusehen: [How to never rage again](https://www.youtube.com/watch?v=vVtmV0FzW_0)\n> \n> 3. Mentalität ändern\n> Bei dieser Methode geht es darum, das Problem an der Wurzel zu packen, d.h. etwas gegen die Ursache zu tun. Denn der Grund warum man sich in LoL überhaupt ärgert, ist, dass man frustriert wird. Und Frustration ist nichts anderes als das Gefühl, dass man hat, wenn selbstgesteckte Ziele nicht erreicht werden. Dementsprechend kannst du viel ändern indem du deine Ziele änderst. \n> Viele toxische Spieler machen einen kleinen Fehler bei ihrer Zielsetzung: Sie sind sehr stark darauf fokussiert, aufzusteigen. Das mag erstmal nicht so verkehrt klingen, ist aber problematisch. Denn wer aufsteigen als Ziel hat, der will unbedingt jedes Spiel gewinnen, denn jedes verlorene Spiel entfernt einen etwas mehr vom Ziel aufzusteigen. Dementsprechend frustrierend ist eine Niederlage, was natürlich insofern problematisch ist, da man in League 50% seiner Spiele verliert, völlig egal wie gut man ist. \n> Diese Frustration kann man ändern, indem man sein Ziel ein kleines bisschen ändert, und zwar dahingehend, dass das Ziel ist besser zu werden. Das Ergebnis in Bezug auf den Rang ist gleich oder sogar besser. Spieler die sich nicht darauf fokussieren aufzusteigen, sondern darauf fokussieren besser zu werden, steigen genauso schnell oder sogar schneller auf. Sie haben aber ein viel kleineres Problem mit Niederlagen, da Niederlagen keineswegs dem Ziel besser zu werden widersprechen. Man kann auch besser werden, wenn man verliert. In einer harten Niederlage lernt man mehr als wenn man den Gegner ohne Gegenwehr wegstompt. \n> \n> \n> Wenn du diese 3 Methoden nutzt, ist der der Erfolg im Prinzip garantiert. Vielleicht nicht sofort; sich zu ändern geht nicht von jetzt auf gleich, aber wenn du dich von gelegentlichen Ausrutscher nicht demotivieren lässt und dich weiter darum bemühst etwas gegen dein Problem zu tun, solltest du Erfolg haben. Den schwersten Schritt hast du sowieso schon hinter dir, denn du WILLST weniger toxisch sein. Das ist im Prinzip schon die halbe Miete.\n\nHumpel,\n\nwenn du schon (und dies ist jetzt nicht böse gemeint, ich halte dich eigentlich für Intelligent) mit deinem 3. Semester Psychokenntnissen ankommst, dann mach es doch bitte richtig. Frustration mit anderen Spielern solltest du nicht nur mit den Spielerzielen in Zusammenhang bringen. Zwar kann man da durchaus ansetzen, aber da hört es lange nicht auf und erklärt auch bei weitem nicht alles. \"Spieler spielen um sich mit anderen zu messen, sie wollen sich beweisen, über anderen stehen\" ist der Standartsatz aus jeder pseudo Doku über uns Gamer ist nur oberflächlich und unwürdig. Es ist Spielern teilweise egal, ob sie ein Spiel gewinnen. Eines der beiden Teams muss ja eh verlieren. Vielmehr freuen sich manche über ein spannendes, enges Spiel und sind froh am Ende etwas gelernt zu haben. Wenn man nun jemanden im Team hat, der der Beschreibung homo sapiens sapiens nicht im Geringsten gerecht wird und durch permapings, feeden, beleidigen, surrendern, afk etc. am Nervenkostüm nagt, hat das nicht zwingend etwas mit meinen Erwartungen zu gewinnen zu tun. Ich freu mich sogar ein Spiel zu verlieren, in dem ein Mitspieler ununterbrochen \"easy\" schreibt, sein LVL 7 zeigt und nach jedem kill am Tanzen ist. Ich denke Punkt 3 sollte eher in Richtung Hemmschwellen für Frustration ändern gehen. Lasse ich es zu das ein mir Unbekannter mich im Chat beleidigen kann? Wie gehe ich mit Niederlagen um? Was mache ich, wenn icn tatsächlich einen riesen Bock geschossen habe? Ich werde im Chat verbal aufs Äußerste beleidigt, aber Reports und das Reportfeedback zeigen mir, der Spieler wurde bestraft. Hier kann man eher ansetzen. Pausen können helfen, sind aber nur kurzfristige Lösungen und können auch zu mehr Stress führen. Wichtig ist immer daran zu denken, das Menschen unterschiedlich sind. Wenn es Person A gut tut, laut zu fluchen und Person B seinen Wutball gegen die Wand zu schleudern ist beides vollkommen in Ordnung. Ach und bei Lorenz wär ich auch vorsichtig. Nur weil seine These nicht mehr 100% unterstützt wird, ist nicht automatisch nichts dran. Siehe Darwin. Seine Theorie ist im GANZEN wissenschaftlich nicht mehr haltbar,dient jedoch weiter als Grundlage und wegweisend.","replies":[{"poster":"Humpelstilzche","date":"2017-01-31T07:16:38.542+0000","up_votes":1,"down_votes":0,"body":"> aber da hört es lange nicht auf und erklärt auch bei weitem nicht alles\n\nHab ich auch nicht gesagt. Ich hab lediglich den Nachteil einer Sieg-Orientierung beschrieben, was selbstverständlich nicht bedeutet, dass es die einzige Quelle der Frustration ist. \nDiese 3 Tips sind weder allgemeingültig noch vollständig. Glaub mir, wenn jemand weiß wie komplex die Gründe für Aggression in League sind, dann bin ich das, ich hab mich jahrelang damit beschäftigt. \nAber diese 3 Tips bilden meiner Meinung nach eine gute Basis. Sie sind simpel, einfach umzusetzen und haben eine relativ hohe Aussicht auf Erfolg. Es gibt bestimmt Leuten denen mit diesen Tips nicht geholfen ist, keine Frage. Wie gesagt, das ist keineswegs vollständig. \n\n>  Wenn es Person A gut tut, laut zu fluchen und Person B seinen Wutball gegen die Wand zu schleudern ist beides vollkommen in Ordnung\n\nJa. Ist beim TE aber nicht der Fall. \n\n> . Ach und bei Lorenz wär ich auch vorsichtig. Nur weil seine These nicht mehr 100% unterstützt wird, ist nicht automatisch nichts dran. \n\nNicht automatisch, nein. Aber im Fall diese Theorie ist es halt so, dass der Kern der Theorie (aggressive Energie baut sich auf und kann abgelassen werden, woraufhin dann die aggressive Energie geringer ist) schlicht und einfach falsch ist. Das wurde empirisch getestet und stimmt schlicht und einfach nicht. Lorenz war sicherlich trotzdem ein wichtiger Forscher und hat bestimmt mit dem einen oder anderen Recht gehabt...mit dieser Grundidee aber nicht.\nBei deinem Beispiel Darwin ist es im Prinzip genau anders rum. Bei dem ist die Grundidee seiner Idee korrekt, auch wenn nicht alle Details stimmen.","replies":[]}]},{"poster":"Vargnyr","date":"2017-02-01T01:38:19.276+0000","up_votes":1,"down_votes":0,"body":"Sind wirklich gute Optionen, die du hier offen legst, allerdings finde ich, ist das größte Wutproblem in league eher die ignorante Lernresistenz mancher Mitspieler. Ich für meinen Teil, habe unglaublich starke Schwierigkeiten, wenn jemand null Einsichten hat, dass sein Verhalten nicht ok ist. Worauf ich oft als flamer betitelt werde.\n\nBeispiel: Aram (ist ja nur ein fun mod)\n\nRandom Spieler meint mit 100% hp und 98% mana sich die Heilung zu sichern. Ich und einige mates haben low hp und ich spreche ihn darauf an. Reaktion ist meist sowas wie: Dude relax its aram oder als Alternative stfu noob.\nIch brauche glaube ich nicht zu erläutern, was daran ein \"fun mod\" sein soll. Selbiges auch mit Spielern, die sowie hier als auch in Normalen Spielen oder auch mal Rankeds, rumstehen, mana und cd sparen nur um sich die lasthits zu sichern. Ich mein ok bei Assas mag das ja im early sinn machen, aber irgendwann sollte man bei 17/3 oder so dann auch mal anfangen dafür zu arbeiten, aber nein \"lass die deppen ruhig die arbeit machen und ich warte auf meine lasthits und counter damit mein eigenes team aus\". \n\nDas schlimme daran ist nur, dass die meisten dieser Spieler, oft Gold oder sogar höher sind.\nBei Beleidigungen kann ich mich nur oft drüber amüsieren, weil ich oft schon sehe, dass sie nix anderes können, und Sätze die fiktive Tätigkeiten mit meiner Mutter beinhalten, nehme ich schon lange nicht mehr ernst. Zumal da das reporten auch nicht schwer ist (kann man ja alles lesen).\nAber ich finde, dass es nicht nur die treffen sollte die beleidigen, sondern auch die, die ihr eigenes Team ignorieren oder sogar auflaufen lassen/sabotieren. Es ist nun mal ein Teamspiel und natürlich gibt es auch mal Runden, in denen man allein viel erreicht, aber im Endeffekt, braucht man teamwork. \n\nOft habe ich auch schon matches gehabt wo ich total gefüttert habe, aber nicht weil ich es drauf angelegt habe, oder es selber verrissen habe. Das sind dann Spiele, bei denen z.B. der Jungler zu mir (top lane) kommt, den gegner pingt, ich engage und er wegrennt und ich dadurch den fight und nach einer weile vlt sogar die lane verliere. In anderen Situationen, bekommt man vlt garkeinen gank, oder mein favorite, er kommt immer dann, wenn ich in der base bin und füttern ihn am besten noch und lässt mich dann mit dem allein auf der lane. Später hab ich dann die schlechten Stats und es heisst, es wäre ja mein fail. \n\nKeine Ahnung wie andere das sehen, aber so etwas regt mich immens auf.\n\nAlso für alle die vlt ähnlich denken, es gibt genug von uns, aber ich finde es nur zum teil toxic, denn jene, die so ein gameplay hinlegen und dann auch  noch so tun, als wäre nichts, sind die waren toxic player.","replies":[{"poster":"Awsane","date":"2017-02-01T11:52:29.360+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mortrak,realm=EUW,application-id=KYnfKGf0,discussion-id=vAjOXJLL,comment-id=00040001,timestamp=2017-02-01T01:38:19.276+0000)\n>\n> \n> Oft habe ich auch schon matches gehabt wo ich total gefüttert habe, aber nicht weil ich es drauf angelegt habe, oder es selber verrissen habe. Das sind dann Spiele, bei denen z.B. der Jungler zu mir (top lane) kommt, den gegner pingt, ich engage und er wegrennt und ich dadurch den fight und nach einer weile vlt sogar die lane verliere. In anderen Situationen, bekommt man vlt garkeinen gank, oder mein favorite, er kommt immer dann, wenn ich in der base bin und füttern ihn am besten noch und lässt mich dann mit dem allein auf der lane. Später hab ich dann die schlechten Stats und es heisst, es wäre ja mein fail. \n> \n> Keine Ahnung wie andere das sehen, aber so etwas regt mich immens auf.\n\n\n\nIch habe früher selber viel Toplane gespielt, mir sind  die Situationen oft genug wie oben beschrieben selber passiert und ich war eine ganze Zeitlang genau der selben Meinung wie du gerade\n\ndann habe ich mich coachen lassen und festgestellt das die meisten Fälle tatsächlich mein Fehler war und zwar der, das ich die Intention meines Mitspielers falsch verstanden habe\n\nwenn z.b. dein jgler Toplane ist wenn du Base bist und du dich darüber wunderst warum er gerade jetzt toplane ist und davor noch nie gegankt hat und gibt es fast immer genau 2 Gründe dafür\nentweder er wollte toplane ganken und du bist zu früh base gegangen oder aber er wollte nie toplane kommen ist aber gezwungen dort hinzugehen weil er deffen muss und/oder dort sonst farm verloren geht, weil du eben nicht gerade auf der lane bist\n\nauch bei ganks habe ich mich oft gewundert was mein jgler tut, aber meisten hat er gewartet bis der Gegner engaget und wenn ich es getan habe, ist der Gegner oft weggelaufen, weil es für ihn offensichtlich ist, wenn ich ihn angreife so aggressiv, dass mein jgler da ist und mein jgler kam dann nicht hinterher, \noder er hat den anderen jgler gesehen oder den gank für nicht machbar gehalten oder noch auf einen cooldown gewartet, seitdem warte ich bis mein jgler initative zeigt (also mich pingt und/oder agressiv auf die lane geht) bevor ich irgendetwas agressives auf der lane machen\n\nmeistens ist der ping auf den Gegner vom jgler auch eher so ne frage (können wir den? in Kurzform oder bereite dich vor geht gleich los) als eine direkte all in  Aufforderung \n\n\nhoffe konnte dir helfen","replies":[]}]}]},{"poster":"ninju7su","date":"2017-01-30T07:17:27.366+0000","up_votes":4,"down_votes":0,"body":"Als erstes: Ich kann den Downvote nicht verstehen. Das Forum ist zum diskutieren jeglicher Themen da und hier braucht jemand offenkundig gute Ratschläge.\n\n**Zum Thema:** Es ist schön, dass du ein leidenschaftlicher Spieler bist. Das ist etwas sehr Gutes. Wenn du allerdings beleidigend wirst, zieht das logischer Weise Probleme mit sich. \n\n**Zuerst zu den Folgen:** Wenn eine Situation schief läuft und du ausfallend wirst, zerstörst du damit die Moral. Nicht nur, dass du dich selbst in einem logisch aufgebauten Spiel in eine Emotionale gelenkte Handlung bringst, was langfristig zu schlechten Entscheidungen führt, auch dein Team wird sich von deiner Meinung anderer Mitspieler abschotten. Menschen bekommen einen Tunnelblick um sich nicht zu stark zu belasten. Das heist jeder spielt zusehens alleine, was in einem Teambasierten Spiel die Lose-Ratio extrem erhöht. Weiter geht es damit, dass nicht nur du nicht mehr zu ihnen durchdringst, sondern auch die Mitspieler untereinander das Vertrauen ineinander verlieren. Du schickst also bildhaft gesprochen jeden auf eine einsame Insel und dann sollen Sie zusammen ein Boot bauen. Klappt nicht! Du machst dich selbst zu einem extrem schlechten Spieler. \n\n**Zu der Ursache:** Zorn entsteht immer dann, wenn Menschen etwas nicht begreifen können und das was ihnen wiederfährt negativ ist. Ich will nicht sagen, dass du zu dumm bist denn jeder ist mal zonrig, aber es ist schwer sauer auf jemanden oder etwas zu sein, dessen Situation oder dessen Umstände man gänzlich versteht. Beispiel: Wenn dich jemand scheinbar grundlos versetzt bei einem Treffen, wird man sauer. Das der Typ vielleicht schwere Probleme im Leben hat, aus Scham, Angst oder einem Unfall oder weis Gott was noch nicht kommen kann und darüber nicht sprechen möchte, würde einem den Zorn nehmen, da man versteht, was der Grund für sein Fernbleiben ist. \nWorauf ich hinaus will ist folgendes: Ich glaube, du siehst nur ein Teil des Problems wenn etwas schief geht. Verssuch vielleicht dir darüber klar zu werden, warum die Situation entstanden ist. Vielleicht hätte man die Situation verhindern können. Du lernst du auf jedenfall etwas für das nächste mal. Versuch jeden Fehler als Chance zu sehen, Dinge besser zu machen und zu begreifen. Wenn du keine Fehler siehst, spielst du mit dem Anspruch perfekt zu sein. Kurz und Knapp: Werd dir darüber klar, warum Situationen passieren die dich sauer werden lassen und finde einen Weg, wie du auf sowas beim nächsten mal reagierst (Spieltechnisch). Wenn dir das gelingt, bist du maximal Fassungslos über das Unverständniss deines Teams gegenüber dem Spiel. Aber du wirst weniger sauer/toxisch und lernst etwas. \n\nAnsonsten halt die klassiker:\n1. /mute all\n2. positive Musik\n3. Spiele mit einem Freund, der dein gejammer erträgt, dann brauchst du den Chat nicht spammen.","replies":[]},{"poster":"MilliDieFrau","date":"2017-01-30T07:22:14.497+0000","up_votes":3,"down_votes":0,"body":"Vielleicht mal eine Runde Abstand zum Spiel nehmen. Mal einen, zwei Monate was anderes spielen. Dann ganz locker und ungezwungen ein Match durchziehen, dann wieder einen Tag Pause. So mach ich das immer, wenn ich irgendwo nicht weiter komme.\n\nIch vermute mal, da du ja auch schreibst, dass du glücklich bist, wenn es gut läuft, du zu sehr aufs Gewinnen fixiert bist. Spielst du nur Rankeds oder auch was anderes? ARAM vielleicht? \n\nDu musst irgendwie deinen Spaß am Spiel wiederfinden, klar, Gewinnen ist super, aber es kann auch lustig sein, wenn man verliert. Über seine eigenen Fehler lachen, wenn jemand anderes anfängt zu flamen, muten oder.. auch lachen. \n\nEs ist halt \"nur\" ein Spiel. Spiele sollen Spaß machen. :)\n\nViele Grüße,\nMilli","replies":[]},{"poster":"Staatsanwalt","date":"2017-01-30T07:48:59.935+0000","up_votes":2,"down_votes":0,"body":"Du darfst dich nicht so Emotional damit beschäftigen. Verloren? OK, nächste Runde. Feeder? Ok, versuche ich trotzdem zu gewinnen.\n\nSobald du es schaffst, deine Emotionen zu beherrschen wird auch dein Spiel automatisch besser und du gewinnst öfter.\n\nIch brülle aber auch rum, wenn die Leute bei H1Z1: KotK einfach mal nen 180 noscope 2-Tap machen :D\n\nEdit. Achja spiele was anderes, ohne menschliche Gegenspieler, was meinst du, wie ruhig dein Gemüt werden kann :D\n","replies":[{"poster":"xSyruSx","date":"2017-01-30T20:41:36.251+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Staatsanwalt,realm=EUW,application-id=KYnfKGf0,discussion-id=vAjOXJLL,comment-id=0003,timestamp=2017-01-30T07:48:59.935+0000)\n\n> Edit. Achja spiele was anderes, ohne menschliche Gegenspieler, was meinst du, wie ruhig dein Gemüt werden kann :D\n\nSolange es nicht Dark Souls ist :D. Da kann das Gemüt, je nach Bossgegner oder Gegnermob, sogar noch weiter explodieren.","replies":[{"poster":"Staatsanwalt","date":"2017-01-31T10:07:11.680+0000","up_votes":1,"down_votes":0,"body":"Du hast recht, es gibt Ausnahmen :D","replies":[{"poster":"Vargnyr","date":"2017-02-01T01:10:26.673+0000","up_votes":2,"down_votes":0,"body":"Zur not einfach ein botgame machen und sie einfach mal so richtig heavy weghämmern XD einfach nur um seiner aggro Ausdruck zu verleihen.","replies":[]}]}]}]},{"poster":"Noru Dali","date":"2017-01-30T19:46:35.441+0000","up_votes":1,"down_votes":0,"body":"Sry aber pvp ist dann nichts für dich.\nUnd nach 2 permabann immer noch nicht zu raffen das die Com. und Riot dich nicht hier haben möchte versteh ich auch nicht.\nUnd mein gott selbst wenn du in der pupertät oder sonst was bist, ist das keine entschuldigung.\nAber mach was willst kannst ja weiter dich im kreis bewegen account erstellen-flamen-bannen-acvount erstellen...\n\nNett das viele hier ratschläge dir erteilen aber ich würds lassen da es dich anscheind zu viel stresst.\n\n\nBtw ein Spiel ist da um spaß zu haben und wenn es dich dich stresst und du nur leute anpöbelst würd ich mir mal was neues suchen.\nSpiel doch was chilliges .\nIch empfehl dir Final Fantasy 10 remake.\nBeste story ever ,kein pvp und eines der besten FF titeln.\nOder mass effect :)\n\nOu oder amerika von oben. Übelst chillig und man lernt was. \n\nViel Glück noch und BB :)","replies":[{"poster":"eingew","date":"2017-01-30T19:51:33.519+0000","up_votes":1,"down_votes":0,"body":"> Ou oder amerika von oben. Übelst chillig und man lernt was.\n\nGoogle sagt das ist ne Fernsehserie? Wo ist da der Zusammenhang? :D","replies":[{"poster":"Noru Dali","date":"2017-01-31T03:45:22.562+0000","up_votes":2,"down_votes":0,"body":"Klar ist das ne fernsehserie.\nAber kanns nur empfehlen wenn man gestresst is.\nOder zum einpennen is es auch klasse XD","replies":[]}]}]},{"poster":"iIIOotsutsukiIIi","date":"2017-01-30T19:42:01.759+0000","up_votes":2,"down_votes":0,"body":"Hallo mein Freund dies hier mein 6ter Account und ich hatte einen 14 Tage bann auf dem Acc aber jetzt bekomme ich wieder Chests nach 4 Monaten! :D\nAlso wenn du flamest oder flamen willst dann beleidige deine Mates einfach nicht, sondern mach ihnen klar dass es ein Ranked ist und es um Punkte geht, anstatt sie mit die on ebola etc. zu beleidigen\nViel Glück :D","replies":[]},{"poster":"FuryFøx","date":"2017-01-30T16:30:52.386+0000","up_votes":2,"down_votes":0,"body":"Ich persönlich werde (fast) nie wirklich Toxic, also kann ich dir wahrscheinlich keine Tipps geben, wie du Flaming vermeiden kannst. Ich erzähle dir einfach von meinem Mindset in LoL(und anderen Spielen):\n\n1. Spaß hat oberste Priorität, auch im Ranked. Natürlich sollte man ranked ernster nehmen als Normals, schließlich will ich auch aufsteigen, ABER ich tryharde nie so viel, dass ich 100% gewinnen muss, wenn ich mich nur aufs gewinnen konzentriere, dann macht es einfach nicht so viel Spaß.\n\n2. Wenn du einen Flamer im Team hast ignoriere ihn einfach, meistens sehen sie ihre Fehler ein wenn sie ihre Aufmerksamkeit nicht bekommen, die sie wollen.\nWenn sie flamen/beleidigen dann kann man sie einmal darauf hinweisen und wenn sie weiter machen muten.\n\n3. Sei offen für neues, ich habe selbst einige nicht-meta picks(z.B.  Thresh/Bard jungle) ausprobiert. Gib ihnen eine Chance sich zu bewähren. Wenn du sie niedermachst, spielen sie automatisch schlechter\n\n4. Wenn ich doch mal wütend werde, dann lasse ich es nicht am Chat aus. Ich mache eine Pause/spiele ne runde Overwatch etc. Wenn du nach einem Spiel, was dich tilted direkt ein neues startest, dann ist dir das letzte noch zu sehr in Erinnerung, dadurch bis du beim nächsten nicht sofort dabei, machst Fehler und wirst noch aggressiver.\n\nIch muss zugeben, dass ich es nicht immer schaffe objektiv zu bleiben und manchmal zu emotional werden, aber mit diesem Mindset passiert mir das relativ selten.\n\nNoch ein Tipp: Spiel mit Freunden, die mit deinem Flame umgehen können. Im TS zu flamen wird keinen Bann nach sich ziehen.","replies":[]},{"poster":"SilvaxStar","date":"2017-01-30T11:51:39.852+0000","up_votes":2,"down_votes":1,"body":"Du steigerst dich in das Spiel viel zu sehr rein. Nichts für ungut, aber wenn du nicht mit dem verlieren umgehen kannst solltest du nicht lol zocken, denn das gehört dazu. Außerdem, je aggressiver du wirst, desto schlechter spielst du letzten Endes. Das Problem liegt nicht immer bei den anderen. Verschwende keine Zeit mit flamen oder Wutausbrüchen. Wie gesagt, wenn du dich nicht im Griff hast solltest du nicht mit anderen zusammen spielen. Sorry","replies":[{"poster":"SleazySam","date":"2017-01-30T14:27:28.879+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Christyxx,realm=EUW,application-id=KYnfKGf0,discussion-id=vAjOXJLL,comment-id=0008,timestamp=2017-01-30T11:51:39.852+0000)\n>\n> Du steigerst dich in das Spiel viel zu sehr rein. Nichts für ungut, aber wenn du nicht mit dem verlieren umgehen kannst solltest du nicht lol zocken, denn das gehört dazu. Außerdem, je aggressiver du wirst, desto schlechter spielst du letzten Endes. Das Problem liegt nicht immer bei den anderen. Verschwende keine Zeit mit flamen oder Wutausbrüchen. Wie gesagt, wenn du dich nicht im Griff hast solltest du nicht mit anderen zusammen spielen. Sorry\n\nDas ist die erste Antwort, bei der ich sage: was soll das? 1: Mir geht es nicht ums verlieren. Ich gewinne gerne und viel natürlich wer tut das nicht. Aber ich rege mich auf wenn spiele absichtlich zerstört werden oder auch einfach weggeschmissen. Eine gute Niederlage nach einem ausgeglichenen Spiel ist mir auch recht. Deshalb passt das schonmal nicht zum Beitrag. Dass ich schlechter werde, wenn ich mich mehr aufrege habe ich selber auch schon genannt, also redundante Informationen. Das Problem liegt nicht immer bei den anderen... Hab ich das irgendwo behauptet? Ich sehe das Problem laut Post ganz offensichtlich bei mir :)! Verschwende keine Zeit mit flamen und Wutausbrüchen. Ok guter Tipp: Sag doch auch dem Alkoholabhängigen bitte, er soll einfach aufhören zu trinken! (Bevor du jetzt kommst mit: \"Wenn du dein Problem mit einer Sucht vergleichst, muss es schon echt schlimm sein!\" Ich hab dieses Beispiel nur zur leichten Veranschaulichung der Nichtigkeit deines Tipps genannt). Du bist ein typischer inhaltsloser Forumsposter :D Ich will dir nicht zu nahe treten, aber ich bin mir sicher dieser Kommentar von Captain Obvious hat niemandem geholfen. Trotzdem Danke dafür :)","replies":[{"poster":"Atsùra","date":"2017-01-30T17:29:27.537+0000","up_votes":1,"down_votes":0,"body":"Naja, wenigstens zeigst du ja jetzt den Willen dich zu ändern (hast du vorher wahrscheinlich schon auch aber du wusstest nicht wie). Das du dich an das Forum wendest, zeigt das aber auf jeden Fall, andere jammern nur rum, dass sie ja angeblich gaaaar keine Schuld haben.\n\nHalt dich an die Tipps von Humpelstilzchen, den Recht hat der gute Herr/die gute Dame. Und nen Versuch is es definitiv wert. Viel Glück und möge dein Kopf mit dir sein.{{item:2050}}","replies":[{"poster":"eingew","date":"2017-01-30T19:15:50.298+0000","up_votes":1,"down_votes":0,"body":"In diesem Fall lässt der männlich klingende Name tatsächlich auf sein Geschlecht schließen ;).","replies":[]}]}]}]},{"poster":"SleazySam","date":"2017-01-30T07:46:58.481+0000","up_votes":2,"down_votes":0,"body":"Danke schonmal für die ersten Antworten! Da ist schon viel wahres dabei. Ich würde auch nicht sagen, dass ich dumm bin zumal ich in keinem anderen Spiel so agiere und reagiere :D. Die Situationen, die mich am meisten aufregen, sind die in denen ein Teammate mich ignoriert, absichtlich feedet (wirklich absichtlich, nicht einfach ein schlechtes Spiel hat) und abgehobene Spieler, die selber garnicht in meine Elo gehören sondern natürlich eigentlich mindestens mal Master sein sollten :D #Imsmurfing \nIch geb einfach mal so ein Beispiel worüber ich mich aufgeregt habe:\nIch botlane Vayne\nMein Support Bard: trollt, weil er autofilled wurde und eigentich Mid/Jungle wollte\nJungle: Sion, hat ihn nie gespielt und weiß, dass Bard trollt, ignoriert meine Lane aber vollständig. Wir haben gegen Sona, Ezreal gespielt die sind auch mit einem Troll relativ gut gankbar. \nMidlane: GP hat gut gespielt und war still. Er war einfach ein overall guter Spieler\nTop: Illaoi stirbt FB und noch 2 mal, gewinnt dann aber die Lane und rastet von da an völlig aus. Dauerhafter Flame und Trashtalk.\nDazu kam noch, dass ich einige Missplays gemacht habe, dauerhaft geganked wurde, weil Bard geinted hat und unsere Lane wurde dadurch dann völlig auseinander geböllert. \nIch habs sogar geschafft, nicht zu flamen, aber ich war unglaublich tilted. Das Problem sehe ich aber darin, dass so ein Game in letzter Zeit keine Ausnahme ist. Ich habe jeden Tag mindestens 3-4 solcher Games und die Emotionen stauen sich bei mir. Ich bin auch niemand der beleidigend wird, aber ich Capslocke dann irgendwann die Missplays meiner Mitspieler und ignoriere dabei oft meine Eigenen, bzw. mache mehr von diesen, weil ich einfach sauer und unkonzentriert bin. Alles in allem ist es einfach ein Teufelskreis...\nZum 2.  Kommentar: Ja du hast recht, der Spaß geht oft verloren, aber das ist ja kein Einzelfall (falls ihr Videogamedunkey kennt wisst ihr was ich meine, der hats ja zu genüge behandelt). Ich mag das Game unglaublich gerne, aber ich spiele zum gewinnen und quasi 95% ranked. Mir wird auch oft vorgehalten, dass ich Spielern keinen Spaß im Ranked gönne, aber das würde ich so nicht unterschreiben. Ich finde man sollte schon einen unterschied machen, ob man Spaß im Ranked hat, oder AP Talon mid ausprobiert, weil Hey ey ist nur ein Spiel!! Warum machst du sowas aber im Ranked? :D Machs doch im Normal! Also Nein, ich bin für Spaß beim SPIELEN! Das ist ja der inbegriff eines Spiels, ABER wenn du ranked spielst nimms bitte einfach ernst. \n\nMfG\n\nSleazySam","replies":[{"poster":"ninju7su","date":"2017-01-30T08:02:56.990+0000","up_votes":2,"down_votes":0,"body":"Was bei mir sehr geholfen hat und dir vielleicht auch helfen kann: Stell dein Mindset um. Spiel nicht um zu gewinnen oder eine Liga zu erreichen. Spiele ausschließlich ranked um besser zu werden. Damit meine ich nicht, dass du Champs ausprobieren sollst, sondern einen guten Champ pickst und mit dem noch besser werden willst. Das ändert dein Ziel von \"Gewinnen\" zu \"Lernen\". Abgesehen davon, das du so tatsächlich mehr lernst, hat es auch einen psychologischen Aspekt. \n\nDu kannst auch in einer Niederlage, sehr viel lernen und so ein Spiel im privaten gewinnen. Das heißt auch, dass dir kein anderer aus deinem Team, deinem Ziel in die quere kommen kann. Das reduziert deine Anfälligkeit für Zorn. Du kannst immernoch deinen Focus darauf legen, alternative Taktiken zu üben, für Situationen wo man behind ist. Oder ganz banal, übe das Lasthitten (geht immer). Wie geht man mit nem ZZ-Rot richtig um? Versuch dir anzugewöhnen wirklich alle 5 Sek auf die Map zu schauen. Versuch jede Bewegung des Gegners auf der Map zu Pingen. Arbeite einfach an dir, die Liste könnte man nahezu endlos fortsetzen.","replies":[]},{"poster":"Iriní","date":"2017-01-30T08:22:44.424+0000","up_votes":1,"down_votes":5,"body":"Wenn dich sinnlose Niederlagen, die sich schon in der CS abzeichnen so tilten, dann leave einfach. Kostet dich zwar LP, spart aber Nerven und MMR. Und weil dein MMR nicht sinkt, bekommst du die verlorenen schnell LP wieder rein.\n\nLeider kommen dann die Ich-Trolle-bei-Autofill Spieler komplett ungestraft davon, aber da bei Riots System nur die schlimmsten 1-2% gebannt werden, kann man sich eine Menge leisten, bevor es knallt.","replies":[{"poster":"MilliDieFrau","date":"2017-01-30T09:02:55.606+0000","up_votes":1,"down_votes":1,"body":"Das.. ist eine unglaublich schlechte Idee. Aus diversen Gründen.","replies":[{"poster":"Iriní","date":"2017-01-31T10:20:00.180+0000","up_votes":1,"down_votes":1,"body":"Vielen dank für diese detaillierte Antwort mit so vielen stichhaltigen Argumenten. Da muss ich dir natürlich zustimmen.","replies":[{"poster":"eingew","date":"2017-01-31T11:05:18.320+0000","up_votes":1,"down_votes":0,"body":"Naja, einen Grund hast du ja selbst genannt: Die Trolle kommen ungestraft davon. Das ist also keine Lösung, sondern eine Unterstützung für das Problem. Man gibt sich ethisch und moralisch dem Kleingeist geschlagen, *obwohl* man es besser weiß und könnte. Ich halte ja sonst nicht viel von \"Ehre\" und so einem Quatsch, der die Leute dazu bringt, den bescheuertesten Müll zu machen, aber in diesem Fall wäre es zumindest aus meiner Sicht zumindest auf mich selbst bezogen irgendwie feige, zu leaven, um jemanden mit einem so lächerlichen Drohmittel auch noch eine Genugtuung zu verschaffen.\n\nIst nur meine Sicht. Die bezieht sich aber auch primär auf mich selbst, wenn andere ihre Prioritäten da anders setzen kann ich sie dafür sicher nicht verurteilen.\n\nZudem ist simple Mathematik ebenfalls ein Grund dafür, das Spiel trotzdem zu starten. Mit einem potentiellen Troll ins Spiel zu gehen senkt natürlich die Siegchancen. Aber geringe Siegchancen sind immer noch höhere Chancen auf mehr LP, als gar keine Siegchancen, die ich mit einem Leave eingehe. Das wiegt natürlich bei den ersten 3 LP nicht gerade schwer, sollte aber in einer Promo zumindest in betracht gezogen werden.\n\nAbgesehen davon sollte die MMR normalerweise so einen Loss verkraften. Heute zum Beispiel hat mein PC beim ersten Versuch, in mein morgendliches Ranked zu starten, gespinnt und ich kam einfach nicht ins Spiel, wodurch mein Team das Remakesystem genutzt hat. Ich hab also deutlich an LP und MMR verloren - was aber kaum ein Problem darstellt. Im Gegenteil, durch die daraus resultierenden schlechteren Gegner ist es für mich leichter, einen solideren Aufstieg hinzulegen. Lange Win-Streaks sind nämlich, denke ich, deutlich ungesünder für die MMR, weil sie meistens dicht von langen Loss-Streaks gefolgt sind, was den Aufstieg schwieriger macht. Ab und zu ein unverdienter Loss zwischen den Wins macht es leichter, sich an das steigende Level des MMs anzupassen und den langwierigen Aufstieg einfach stabiler zu gestalten.","replies":[{"poster":"Iriní","date":"2017-01-31T13:03:20.501+0000","up_votes":1,"down_votes":0,"body":"Es sind aber 20 Minuten, die keinen Spaß machen und die man sich absolut sparen kann. Eigentlich sogar noch länger, da man den LP und MMR Verlust beim Verlieren mit zusätzlichen Spielen aufholen muss. Der LP Verlust durchs Leaven hingegen ist nur kurzfristig, da die LP-Änderungen nach dem Spiel vom MMR abhängt und das beim Leaven nicht fällt.\n\nUnd das mit der simplen Mathematik stimmt so nicht, da wie oben gesagt, die LP Anzeige nur kosmetisch ist und das MMR wirklich zählt. Genauso halt ich es für ein Gerücht, dass nach langen Win-Streaks lange Lose-Streaks folgen, zumindest wenn man nicht getiltet weiterspielt. Sich ans MM anpassen kann man viel besser, in dem man überlegt, warum man denn nun gestorben ist oder der Spielzug fehlgeschlagen ist, während man fast nichts lernt, wenn man von gefeedeten Gegnern einfach nur überrollt wird oder das Spiel nach 15 Minuten zu Ende ist, weil die anderen Teammitglieder auf Grund des Trolls open mid machen.","replies":[{"poster":"eingew","date":"2017-01-31T20:19:56.661+0000","up_votes":1,"down_votes":0,"body":"> Es sind aber 20 Minuten, die keinen Spaß machen und die man sich absolut sparen kann.\n\nInwiefern? Ist ein gewonnenes 4v6 etwa kein Motivationsfaktor für dich? Wieso wirfst du so leicht die Flinte ins Korn, in einem Spiel, in dem es genau darum geht: Eine Herausforderung zu meisten und möglichst viel Skill zu zeigen?\n\n> Eigentlich sogar noch länger, da man den LP und MMR Verlust beim Verlieren mit zusätzlichen Spielen aufholen muss.\n\nNaja, mit genau einem. Und wie gesagt macht es längere Loss-Streaks unwahrscheinlicher, was vielleicht nicht zwingend Zeit, aber doch zumindest mehr Frust spart.\n\n> Der LP Verlust durchs Leaven hingegen ist nur kurzfristig, da die LP-Änderungen nach dem Spiel vom MMR abhängt und das beim Leaven nicht fällt.\n\nJain. Also ja, du hast eigentlich zu 100% Recht. Aber du missachtest den Faktor, dass bei gesunkener MMR die Gegner leichter werden und das ein besseres Sprungbrett für mehr gewonnene Spiele und noch mehr LP bietet.\n\n> Und das mit der simplen Mathematik stimmt so nicht, da wie oben gesagt, die LP Anzeige nur kosmetisch ist und das MMR wirklich zählt.\n\nSpätestens am Ende der Season in den Promos ist aber leider exakt diese Kosmetik das entscheidende, um an die Belohnungen zu kommen. Selbst wenn das nicht deine Hauptmotivation ist, so kann man sich das doch zumindest als netten Bonus abholen, oder nicht?\n\n> Genauso halt ich es für ein Gerücht, dass nach langen Win-Streaks lange Lose-Streaks folgen, zumindest wenn man nicht getiltet weiterspielt.\n\nNaja, das hängt vermutlich wirklich davon ab, wie viel man spielt. Und von der Konstanz, die man dabei im Spiel zeigt. Da man aber nach einem Loss meistens demotivierter ist, folgen auf verlorene Spiele eben oft noch mehr davon. Die Sache ist halt die, dass lange Winstreaks zu deutlich besseren Mitspielern und Gegnern führen und das wiederum macht es einfach wahrscheinlicher, dass man früher oder später nach so einer Winstreak eben nicht nur eines, sondern gleich mehrere Spiele verliert.\n\n> Sich ans MM anpassen kann man viel besser, in dem man überlegt, warum man denn nun gestorben ist oder der Spielzug fehlgeschlagen ist, während man fast nichts lernt, wenn man von gefeedeten Gegnern einfach nur überrollt wird oder das Spiel nach 15 Minuten zu Ende ist, weil die anderen Teammitglieder auf Grund des Trolls open mid machen.\n\nAlso würdest du sagen ein erhöhter Schwierigkeitsgrad führt selbst bei erhöhter Motivation, Konzentration und Anstrengung nicht zu einem erhöhten Lerneffekt?","replies":[{"poster":"Iriní","date":"2017-01-31T22:49:37.258+0000","up_votes":2,"down_votes":1,"body":"> Aber du missachtest den Faktor, dass bei gesunkener MMR die Gegner leichter werden und das ein besseres Sprungbrett für mehr gewonnene Spiele und noch mehr LP bietet.\n\nDas ist falsch. Denn sobald man Spiele gewinnt, steigt das MMR wieder und die Gegner werden wieder besser.\n\n> Inwiefern? Ist ein gewonnenes 4v6 etwa kein Motivationsfaktor für dich?\n\nZuerst möchte ich noch erwähnen, dass dies mein Vorschlag an den TE ist, der in solchen Situationen schnell demotiviert ist und zum Flamen neigt und kurz vor seinem nächsten Perma steht. Dann ist das einfach die Sache nicht wert, wenn man das mit ein paar Minuten warten vermeiden kann. Denn das MM System sollte es vermeiden, dass die Spiele so unbalanciert sind, dass man 4 zu 6 gewinnt bzw. es eben höchst unwahrscheinlich machen. Zum Vergleich, in den sechs Spielen, in denen bei mir diese Saison jemand disconnected ist, hat nur einmal das Team in Unterzahl gewonnen. Wenn dann einer den Gegner auch noch hilft statt nur nichts zu tun, sieht es noch mal wesentlich schlechter aus.\n\n> Also würdest du sagen ein erhöhter Schwierigkeitsgrad führt selbst bei erhöhter Motivation, Konzentration und Anstrengung nicht zu einem erhöhten Lerneffekt?\n \nDamit man etwas lernt muss der Schwierigkeitsgrad angemessen sein. Dein Grundschullehrer hat dir vermutlich auch keine lineare Algebra beigebracht.","replies":[{"poster":"eingew","date":"2017-02-01T12:19:55.147+0000","up_votes":1,"down_votes":0,"body":"> Das ist falsch. Denn sobald man Spiele gewinnt, steigt das MMR wieder und die Gegner werden wieder besser.\n\nAber wenn man *nur* gewinnt, muss man nach weniger Spielen mit stärkeren Gegnern klarkommen, was schneller zu einer Überforderung führt. Dafür hast du doch selbst argumentiert, dass man sich nicht gleich überfordert:\n\n> Damit man etwas lernt muss der Schwierigkeitsgrad angemessen sein. Dein Grundschullehrer hat dir vermutlich auch keine lineare Algebra beigebracht.\n\nNicht ganz richtig.\n \nDu sprichst [davon](https://de.wikipedia.org/wiki/Yerkes-Dodson-Gesetz) (was übrigens mit linearer Algebra nur bedingt bis gar nichts zu tun hat):\n\nhttps://c1.staticflickr.com/5/4073/4910244454_e208f6d255_b.jpg\n\nDas heißt nämlich nicht, dass man nichts lernt, wenn der Schwierigkeitsgrad zu hoch ist - nur dass wir Menschen zu faul sind, uns mit allzu schweren Sachen zu beschäftigen und dabei schnell an Motivation und vielleicht sogar die Nerven verlieren und versuchen, den Frust am Gegenüber auszulassen (siehe dein Zitat?)...\n\nAbgesehen davon missverstehst du meine Auffassung. Ich habe kein Problem damit wenn irgendjemand leavt. Ich denke nur, dass es sinnvoller ist, es nicht zu tun. Jeder andere kann das halten wie er will. Es hat ja auch nicht jeder die Motivation wählen zu gehen, auch wenn das sinnvoller wäre. Offenbar habe ich es bei der Argumentation dabei zu weit getrieben, deine defensive Haltung spricht ja nicht mehr für einen weiterhin sachlichen Stil... Schade. Ich hätte gerne noch Argumente statt diese nervigen Überlegungen über die Person des Gegenübers gehört. Aber schon okay... ich bin es wohl mittlerweile gewöhnt. Offenbar ist nahezu niemand an tatsächlichen Diskussionen interessiert, sondern beschäftigt sich lieber damit, wo er am besten Angriffe auf das eigene Ego vermuten kann. \n\n> Zuerst möchte ich noch erwähnen, dass dies mein Vorschlag an den TE ist, der in solchen Situationen schnell demotiviert ist und zum Flamen neigt und kurz vor seinem nächsten Perma steht. Dann ist das einfach die Sache nicht wert, wenn man das mit ein paar Minuten warten vermeiden kann. Denn das MM System sollte es vermeiden, dass die Spiele so unbalanciert sind, dass man 4 zu 6 gewinnt bzw. es eben höchst unwahrscheinlich machen. Zum Vergleich, in den sechs Spielen, in denen bei mir diese Saison jemand disconnected ist, hat nur einmal das Team in Unterzahl gewonnen. Wenn dann einer den Gegner auch noch hilft statt nur nichts zu tun, sieht es noch mal wesentlich schlechter aus.\n\nDas ist völlig richtig.\n\nAber wenn man sich tilten lässt sollte man natürlich nicht nur den Triggern aus dem Weg gehen, das ist schließlich keine langfristige Lösung. Aber eine angemessene Möglichkeit für den Übergang. Ein guter Tipp.","replies":[]}]}]}]}]}]}]}]},{"poster":"eingew","date":"2017-01-30T11:44:27.778+0000","up_votes":2,"down_votes":1,"body":"Nichts für ungut, ich mag Dunkey auch, seine Videos sind durchaus lustig... aber das dort gezeigte stellt kein objektives Spiegelbild der Community dar. Die Ausschnitte, in denen man den Chat sieht, zeigen deutlich, dass er sich ziemlich viel Mühe gibt, die \"bösen Tilter\" in genau diesen Tilt zu versetzen. Dabei werden sicherlich auch einige geradezu euphorisch darauf anspringen, manche muss er vielleicht gar nicht provozieren, aber im Endeffekt ist es ein negativer Einfluss von seiner Seite, der oft genau diese Stimmung ausmacht, die er in seinen Videos darstellt.\n\nAbgesehen davon: Wie redest du mit Trollen? Redest du überhaupt mit ihnen? Erfahrungsgemäß kann man viele davon überreden, doch vernünftig zu spielen. Am besten du benutzt mehrere Ansätze, zum einen kannst du darauf hinweisen, dass absichtliches Feeden von Riot mit zweiwöchigen und permanenten Bans bestraft wird, und ob sie sich von der Aktion einen Nutzen versprechen, der diesen Preis wert ist. Zum anderen kannst du sie fragen, warum sie dich (und deine unschuldigen Teammates) dafür bestrafen wollen, dass sie Autofilled wurden. Schließlich tragt ihr keine Verantwortung dafür, sollt aber jetzt trotzdem die Konsequenzen ausbaden?\n\nSollte all das nichts helfen, würde ich ihn einfach muten. Die beste Möglichkeit, jemanden der Aufmerksamkeit will, zu bestrafen, ist, ihm genau diese zu verwehren. Das Team macht das leider nicht immer so effizient, aber sollte jemand von denen auch zu viel Aufmerksamkeit wollen, ebenfalls muten. Man spart sich viel Frust, wenn man seinen Chat möglichst von solchem Spam freihält.","replies":[{"poster":"Iriní","date":"2017-01-31T10:35:21.381+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=vAjOXJLL,comment-id=00020002,timestamp=2017-01-30T11:44:27.778+0000)\n>\n> Abgesehen davon: Wie redest du mit Trollen? Redest du überhaupt mit ihnen? Erfahrungsgemäß kann man viele davon überreden, doch vernünftig zu spielen. Am besten du benutzt mehrere Ansätze, zum einen kannst du darauf hinweisen, dass absichtliches Feeden von Riot mit zweiwöchigen und permanenten Bans bestraft wird, und ob sie sich von der Aktion einen Nutzen versprechen, der diesen Preis wert ist. Zum anderen kannst du sie fragen, warum sie dich (und deine unschuldigen Teammates) dafür bestrafen wollen, dass sie Autofilled wurden. Schließlich tragt ihr keine Verantwortung dafür, sollt aber jetzt trotzdem die Konsequenzen ausbaden?\n> \n\nDas habe ich alles probiert, die Antwort auf mögliche Strafen ist immer, dass es nur ein Smurf Account oder der eines Freundes ist und ich ihn auch gerne Reporten darf, da das ihm aus obigen Gründen am Allerwertesten vorbeigeht.\n\nAuf Argument das Argument, warum ich auch getrollt werden soll, kommt meist mit der Person, die er trollen will kann man sowieso nicht gewinnen. Wenn er ordentlich spielen würde, ändere das nichts. Ich hätte halt Pech und sollte am besten denjenigen auch Reporten, damit der gesperrt wird und nicht weitere Spiele ruinieren kann. Vollkommen verzerrte Wahrnehmung, aber was soll man machen?","replies":[{"poster":"eingew","date":"2017-01-31T10:57:33.919+0000","up_votes":1,"down_votes":0,"body":"Akzeptieren und auf die Schnauze fallen lassen. Viele geben sich da gerne so geplant und kaltblütig, aber entlarven sich durch ihre impulsiven Handlungen schnell als tatsächlich gar nicht so überlegt. Und selbst wenn er Riot ausgespielt hat, dann können wir tatsächlich nichts tun und müssen ihn wohl oder übel gewähren lassen.\n\nIch würde vielleicht sonst in der Situation noch zu guter Letzt hinzufügen, dass der \"schlechte\" Teammate nicht umsonst auf dieser Elo ist und es ziemlich feige ist, ihm die Schuld dafür zu geben, dass eigentlich jemand völlig anderes das Arsch ist, was das Spiel versaut und sich hinter dieser fadenscheinigen Behauptung versteckt, aber dadurch nur eine sich selbst erfüllende Prophezeiung schafft. Aber zugegebenermaßen ist das etwas, was womöglich eher noch mehr Trotz hervorruft.","replies":[]}]},{"poster":"SleazySam","date":"2017-01-30T14:35:35.742+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=vAjOXJLL,comment-id=00020002,timestamp=2017-01-30T11:44:27.778+0000)\n>\n> Nichts für ungut, ich mag Dunkey auch, seine Videos sind durchaus lustig... aber das dort gezeigte stellt kein objektives Spiegelbild der Community dar. Die Ausschnitte, in denen man den Chat sieht, zeigen deutlich, dass er sich ziemlich viel Mühe gibt, die &quot;bösen Tilter&quot; in genau diesen Tilt zu versetzen. Dabei werden sicherlich auch einige geradezu euphorisch darauf anspringen, manche muss er vielleicht gar nicht provozieren, aber im Endeffekt ist es ein negativer Einfluss von seiner Seite, der oft genau diese Stimmung ausmacht, die er in seinen Videos darstellt.\n> \n> Abgesehen davon: Wie redest du mit Trollen? Redest du überhaupt mit ihnen? Erfahrungsgemäß kann man viele davon überreden, doch vernünftig zu spielen. Am besten du benutzt mehrere Ansätze, zum einen kannst du darauf hinweisen, dass absichtliches Feeden von Riot mit zweiwöchigen und permanenten Bans bestraft wird, und ob sie sich von der Aktion einen Nutzen versprechen, der diesen Preis wert ist. Zum anderen kannst du sie fragen, warum sie dich (und deine unschuldigen Teammates) dafür bestrafen wollen, dass sie Autofilled wurden. Schließlich tragt ihr keine Verantwortung dafür, sollt aber jetzt trotzdem die Konsequenzen ausbaden?\n> \n> Sollte all das nichts helfen, würde ich ihn einfach muten. Die beste Möglichkeit, jemanden der Aufmerksamkeit will, zu bestrafen, ist, ihm genau diese zu verwehren. Das Team macht das leider nicht immer so effizient, aber sollte jemand von denen auch zu viel Aufmerksamkeit wollen, ebenfalls muten. Man spart sich viel Frust, wenn man seinen Chat möglichst von solchem Spam freihält.\n\nBezüglich Dunkey kann ich nur sagen, dass ich das auf das Bansystem ansich bezogen habe. Es gibt kaum ein anderes Spiel in dem Flame ein Grund für eine Sperre ist und das unterstütze ich bis heute nicht in League. Es muss andere Möglichkeiten geben einen Spieler dafür zu bestrafen. Und wenn das nicht geht, ist es offensichtlich ein Spiel, was einfach zu Toxic macht. Titel wie CSGO oder sonstiges kommen prima ohne Sperren für flame aus. Und auch die Situation beim Spielen mit Freunden kann ich 1 zu 1 unterschreiben. Sobald der kompetitive Aspekt eine Rolle spielt, fängt man selbst untereinander an, sich zu aufzuregen, wenn es mal nicht läuft. Unter berücksichtigung des Systems wurde er zurecht gebannt, da bin ich ganz bei dir. ABER das System ist schlichtweg Müll! Es sollte nicht möglich sein einen Spieler permanent zu Sperren. (Ganz klar abgesehen bei rassistischen Äußerungen oder Drohungen!)","replies":[{"poster":"eingew","date":"2017-01-30T19:24:17.310+0000","up_votes":1,"down_votes":0,"body":"Hm. Ich glaube RocketLeague (nehme ich jetzt einfach mal als Beispiel, weil das halt mein meistgezocktes Onlinespiel nach League ist) hat (trotz seines Meldesystems) keine Strafen für Flame... aber es kommt trotzdem nicht ohne aus. Die Stimmung in den Spielen ist mitunter schlichtweg ekelhaft. Ich kenne ja aus LoL die ganzen negativen Kommentare, aber da ist es mir irgendwie egal... in RocketLeague dagegen fängt es auf Dauer tatsächlich an mich zu tilten, weil es einfach auf so einem behinderten Niveau abläuft... darüber wollte ich gar nicht reden. Will sagen: Ich finde es super, dass etwas gegen Flame getan wird und ich glaube nicht, dass irgendein Spiel tatsächlich ohne diese Systeme auskommt. Die Leute haben sich nur eher damit arrangiert (oder profitieren sogar davon :P ). \n\nAber prinzipiell hast du Recht, Strafen sind eigentlich nicht unbedingt die beste Methode um für ein besseres Benehmen zu sorgen. Lob und positive Verstärkung bringt viel deutlichere Ergebnisse im Verhalten. Entsprechend sollte Riot eher für positives Verhalten belohnen, als für negatives zu bestrafen, leider wird ersteres viel zu wenig durchgeführt (was womöglich auch verkaufstechnische Gründe hat).\n\nDie Sache ist halt die, dass das, was aktuell permanent gebannt wird, nur die absoluten Extremfälle sind. Und selbst die, die nur eine CR bekommen, haben das ganze schon hart ausgereizt (immerhin haben nur circa 5% der Spieler überhaupt eine Strafe). Also ich meine... ich glaube nicht, dass die Strafen in League zu stark sind, im Gegenteil, um hier überhaupt aufzufallen muss man sich schon ziemlich was leisten.","replies":[]}]}]}]},{"poster":"Mi3zekatze","date":"2017-01-30T19:39:23.634+0000","up_votes":2,"down_votes":1,"body":"Ich war auch mal toxic aber ich habe verstanden das es nur EIN Spiel ist und es keinen Grund gibt sich zu beschweren weil mein Midlaner in EINEM Spiel feedet. Es stört mich nicht mehr so wie früher, ist halt nen verlorenes Game was solls. Man kann nicht immer erwarten das alles perfekt läuft.\n\nDas einzige was mich tilted sind die die das Spiel absichtlich sabotieren. Sowas sollte direkt mit einem Permabann bestraft werden. 9 anderen aus reiner Willkür 20m zu nehmen ist einfach nur s*. Sowas ist super blöd und ich suche noch nach einem enttiltungsmittel gegen solche ach so erwachsenen lustigen coolen und manchmal auch witzigen Erwachsenen ;)","replies":[]},{"poster":"EvilDeBeagle","date":"2017-02-16T14:43:39.135+0000","up_votes":1,"down_votes":0,"body":"Tja, ich paffe während eines Rankeds 5-6 Kippen weg. Bin deswegen die Ruhe selbst. Wobei man bei mir bei der Anzahl der Kippenstümmel bestimmen kann, wie zufrieden ich mit meiner Leistung und die Mitspieler zufrieden war.  Früher habe ich 1 Laptop und 2 Tastaturen beim LoL spielen Kaputtgehauen.\nSo bewältige ich meine dunklen Neigungen. Wobei ich dir abrate mit dem Rauchen anzufangen. Wie jeden anderen. \n**RAUCHEN IST SCHLECHT**","replies":[]},{"poster":"Vapertank","date":"2017-02-06T17:52:19.099+0000","up_votes":1,"down_votes":0,"body":"Ich hab Löcher in den Putz geschlagen wegen dem Game... Tastaturen zerstört... Meinen Schrank eingetreten etc. \n\nDie Community, die Meta und jedes einzelne Rework werden mit jedem Patch und jeder Season nur noch toxischer , dümmer und sind einfach nicht gut für das Spiel. Und wenn ich schon von meinem Leben getiltet jeden Tag um 18 Uhr nach Hause komme dann wird es nur noch schlimmer wenn man versucht in League aufzusteigen und dann einfach nur noch eine Clownfiesta nach der nächsten sieht.","replies":[]},{"poster":"OPChampsSucks","date":"2017-01-30T19:10:44.932+0000","up_votes":1,"down_votes":0,"body":"Bin auch in etwa so drauf ich glaub ohne dauerrage würd das game mir kaum noch spaß machen. Ich brauch diese aufregung damit ich einigermaßen gut spielen kann. und ganz ehrlich bei einigen Teams kann man einfach nichtmal unter pilleneinfluß ohne zu ragen durch ein game kommen","replies":[{"poster":"eingew","date":"2017-01-30T19:54:49.089+0000","up_votes":1,"down_votes":0,"body":"> Bin auch in etwa so drauf ich glaub ohne dauerrage würd das game mir kaum noch spaß machen. \n\nAlso das klingt.... irgendwie als wäre es zwischen extrem seltsam, extrem ungesund und extrem paradox angesiedelt.\n\nNichts für ungut. Ich meine nur... ragen um Spaß zu haben? Macht das einen nicht kaputt? Ich hätte da gar nicht die Motivation, mich noch mal in die Queue zu setzen, wenn ich das Spiel so sehen würde. Warum verbringt man seine Zeit damit?","replies":[]}]},{"poster":"eingew","date":"2017-01-30T11:49:42.541+0000","up_votes":1,"down_votes":0,"body":"Auch wenn das jetzt nach einer lächerlichen Methode klingt, aber Meditation ist ziemlich effektiv, was ein ruhigeres Gemüt angeht. Tatsächlich gab es sogar schon Studien exakt dazu, man konnte zum Beispiel nachweisen, dass Menschen, die öfter meditieren, besser darin sind, aggressive Personen zu beruhigen, weil ihre Ausstrahlung einfach mehr Ruhe vermittelt.\n\nUnd das ist ja nicht mal ein kompliziertes Vorgehen, es reicht im Prinzip sich einfach nur 10 Minuten hinzusetzen und nichts zu tun.","replies":[]},{"poster":"SleazySam","date":"2017-01-30T08:46:48.265+0000","up_votes":1,"down_votes":0,"body":"@Humpelstilzche vielen Dank schonmal für den ausführlichen Kommentar. Das hilft mir wirklich weiter. Ich habe eigentlich mit viel schlechterer Resonanz gerechnet, weil ich ja schon ein heikles Thema anspreche. Aber soviele Menschen sind hier echt hilfsbereit. Das ist super. \nIch habe ein einziges Problem mit deinen Vorschlägen. Meine MMR auf meinem Main ist total zerstört. Ich habe am Anfang der Season 28 aus 30 Games verloren, wurde dann auch aus Gold wieder in SIlber runtergeranked. Ich kam dann nochmal hoch, war 2 mal in der Promo zu Gold IV und hab seit dem quasi nur verloren. Ich bekomme für einen Sieg ca. 14 LP und für eine Niederlage ca. -23. Das ist insofern problematisch, dass ich das Gefühl habe, das nicht mehr fixen zu können. Ich glaube deshalb immer mehr und mehr zu verlieren unabhängig von meiner Leistung und das lässt mich schon mit einem schlechten Gefühl ins Match starten. Das größte Problem sind dabei auch die Spontanreaktionen, denn meine allgemeine Wut habe ich eigentlich ganz gut im Griff. Viele der Tipps beherzige ich schon jetzt. Ich spiele ein Game und schaue danach erstmal eine halbe Stunde YouTube oder Twitch, um mich völlig abzulenken. Aber theoretisch müsste mir in dem Moment, wo ich denke:\"Warum stirbt mein Jungler in 10 Minuten 6 mal!?\", schon jemand die Tastatur rausstöpseln :D Es ist einfach das spontane Problem... und ich will den Account weder verlieren noch weiter meine MMR zerstören (falls es noch schlechter geht ^^)!","replies":[{"poster":"eingew","date":"2017-01-30T11:46:28.531+0000","up_votes":1,"down_votes":0,"body":"Das fühlt sich nur so zerstört an, weil deine MMR aktuell unterhalb deiner angezeigten Liga ist. Das kannst du ganz leicht fixen, entweder indem du öfter gewinnst und damit deine MMR auf ein normales Maß hebst, oder indem du weiter verlierst, irgendwann steigst du dann automatisch auf deine eigentliche Elo ab, die zu einem normalen +/-20 LP Gain passt.\n\nIm Prinzip: Einfach weiter spielen. Und gib nicht so schnell auf! Dieser zusätzliche Schwierigkeitsgrad sollte dich nicht direkt die Flinte ins Korn werfen lassen. Ich meine... dafür ist ein Wettkampf wie das Ranked doch da, um sich mit ebenbürtigen Spielern zu messen. Wenn du dich dafür anstrengen musst, ist das doch willkommen, das ist doch der Sinn des Kräftemessens.","replies":[]}]},{"poster":"Craíd","date":"2017-01-30T08:59:26.400+0000","up_votes":1,"down_votes":1,"body":"Kenn ich willkommen in meiner welt :)","replies":[]}]}