{"poster":"Alba Meira","date":"2020-01-10T23:28:04.215+0000","title":"Eloboost respaldado por riot...","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":0,"body":"Hace un mes aproximadamente, envie unos reportes de cuentas que antes de que termine la temporada comenzaron a utilizar campeones que **nunca habian usado en ranked**, de repente de main soporte 100% pasaron a asesino en mid o top con campeones que tenian un kda fatal o que utilizaron 5 veces maximo en normales. ¿Milagros? o ¿Eloboost?, quien sabe... quiza se iluminan unos dias antes, cambiando incluso de lugar los echizos de invocador, se acordaron que se podia comprar centinelas de control y demas cosas...\r\n\r\nComo sea, el echo es que pude sacar captura de chat en el cliente del juego ( agregados a amigos con otra cuenta ) tanto del eloboosteado y del elobooster. \r\n\r\nTodos siguen sin ninguna sancion y con sus recompensas, otros fueron eloboosteados no solo una temporada, si no dos... Necesitan una supuesta investigacion de mas de 1 año ellos, cuando yo en 1 dia pude sacar mas informacion con evidencias claras de eloboost. \r\n\r\nNo puedo subir capturas porque lo borran al post, pero tengo todas las capturas y aun asi no hacen nada.  \r\n\r\nMuy flojos los supuestos investigadores.","replies":[{"poster":"Un Alma Más","date":"2020-01-10T23:34:00.542+0000","up_votes":3,"down_votes":0,"body":"Y no les conviene banearlos porque son muchos. La respuesta es: $$$$$$.\nYa estaba claro desde hace tiempo, lo confirmaron ayer cuando apareció el mensaje de servidor de que había problemas al cargar RP, pero ni se inmutaron a decir algo sobre los problemas del cliente...\n\n!Un Saludo!","replies":[{"poster":"Alba Meira","date":"2020-01-11T05:50:54.176+0000","up_votes":1,"down_votes":0,"body":"O sea, pude hacer que el elobooster y el eloboosteado me dijieron por chat que si hicieron eso... ¿Que mas pruebas hay? \"si estuve jugando en la cuenta...\" y muchas mas evidencias... \n\nEs como Valve con los cheats...","replies":[]}]},{"poster":"KŸRØ","date":"2020-01-17T01:09:31.359+0000","up_votes":1,"down_votes":0,"body":"Para que realmente hagan un baneo por elo-boost, esa persona tiene que estar usando una cuenta con diferente IP por lo tanto algo que no es de su \"propiedad\" ademas tiene que ser abusivo, por ejemplo saltar de bronce hasta oro en 1 o 3 días, porque honestamente no te banean “rápido” por mas ticket que hagas al soporte, ya dejaron abandonado este server a su suerte.\n\nEl sistema solo  banea rápido por ser toxico y un troll muy agresivo que se suicida 20/30 veces por partida.\n\nPero si haces elo-boost en duo o una premade de booster y ellos usan cuentas de su propiedad (smurf)  no los banean jamás, por más que lo digan en el chat o mandes un ticket al soporte, no va pasar nada, NO está rompiendo las reglas y la gran mayoría de booster tienen como 10 cuentas random propias para elo-boostear, asi funciona el mercado negro del boost.\n\nLa mayoría que bostean no son de elo muy alto y los encontras entre plata y platino \"trabajando\", a partir de diamante está lleno de gente que gana dinero/skin o favores con el boost, lo se muy bien por experiencia, es fácil burlar la hipocresía de riot games.\n","replies":[]},{"poster":"Mitsuri Kanroji","date":"2020-01-11T00:27:56.528+0000","up_votes":1,"down_votes":0,"body":"Quizas no los banean por falta de pruebas, aunque yo creo que no debe haber gente revisando reportes y esas cosas en LAS, o si las hay son muy pocas. Quizas el jugador que estas reportando haya creado esta cuenta secundaria para probar partidas como soporte y luego juega en su rol principal en lo cual juega bien. En caso de que no sea esto, supongo que antes de banearlo deberian pensar en estas cosas y buscar suficientes pruebas para que no sea un mal baneo. Sigo creyendo que es que no hay gente a cargo de estas cosas, como no hay gente en el foro de su propio juego {{sticker:sg-lux-2}}","replies":[{"poster":"Alba Meira","date":"2020-01-11T05:51:54.108+0000","up_votes":1,"down_votes":0,"body":"Hay pruebas al 300%, es como captar por camara a un asesino a cara descubierta, encontrar evidencia en su casa, ropa, arma.. ah pero nono dejenlo libre que falta evidencia, es un ejemplo similar a lo que sucede aqui.","replies":[]}]},{"poster":"Pandora Journey","date":"2020-01-10T23:33:08.748+0000","up_votes":1,"down_votes":0,"body":"Publicalo en el foro de Reddit, quizás te dan más bola. Es una lástima que acá no se haga una verg4. Por eso somos el peor server de LOL {{champion:32}}","replies":[]},{"poster":"Mahler3599","date":"2020-01-11T00:29:28.463+0000","up_votes":1,"down_votes":1,"body":"Hechizos*","replies":[]}]}