{"poster":"Alba Meira","date":"2019-09-01T03:26:28.621+0000","title":"Lo que faltaba...","subforum":"Comportamiento del jugador","up_votes":10,"down_votes":2,"body":"Que se ofendan los trolls porque no los podes carrear, y encima peor aun que se ofendan porque uno se enoja de que se mueran tantas veces. En serio ¿Juegan a morir? No entiendo como no pueden pensar un poquito a la hora de jugar. Algunos ejemplos de las ultimas partidas:\r\n{{champion:22}} 1/11, No se luego como mato, de buitre solamente. Se ofendia porque el equipo le decia que dejase de morir. \r\n{{champion:3}}  0/12 , \"Sorry tim mala partida bro\". toda la partida tirandose hacia delante aproposito dejandose matar.\r\n{{champion:89}}  0/11 Culpando toda la partida al JG por su falta de habilidad.{{champion:157}}  0/19 \"No estoy dejandome matar\" Toda la partida peleando sabiendo que pierde hasta el 1 vs 1 contra un minion. \r\n{{champion:61}}  1/15 \"Trolea porque no le dieron blue\"\r\n{{champion:238}} + {{champion:81}}  3 asesinatos 26 muertes entre los dos , Reportando al jungla toda la partida. \r\n\r\nSubiria imaginen, pero seguro tiran el post aunque tache los nombre. Saque screen de todas las partidas, en todas se dejan matar aproposito. \r\n Lo peor es que se enojan si luego al que le dieron ventaja mata a alguien del equipo facilmente, echandole la culpa al que iba 0/0/0 en los primeros minutos de partida. \r\n\r\nLa verdad es que son impune a cualquier sanción. Solo banean a los que escriben. Luego voy a subir las imagenes con el minuto y cuantas veces se mueren para vean que no miento. \r\n\r\nY como siempre dicen ustedes; \"Si no ganas es porque no queres\" Seguro que si.","replies":[{"poster":"ŽËÜŠ","date":"2019-09-01T05:44:34.642+0000","up_votes":1,"down_votes":0,"body":"puff a mi me acaba de salir un teemo supp 0/10/1 muriendo de forma intencional y diciendo en el chat general que por favor lo reportaramos que queria un permaban cada vez peor este servido definitiva mente me voy a BR aunque no me ande del 100 pero aya por lo menos intentan jugar y divertirse","replies":[{"poster":"Alba Meira","date":"2019-09-01T15:51:40.180+0000","up_votes":3,"down_votes":0,"body":"Ahh pero seguramente para riot, vos le arruinaste la experiencia. Que se le va a hacer.","replies":[]}]},{"poster":"ALLMUTEFULL","date":"2019-09-01T23:13:26.328+0000","up_votes":2,"down_votes":1,"body":"yo no me olvido mas de un varus que me decía \"yorick qlo si no la carreas te reportamos todos\" ya que era el único que había ganado línea. igual perdimos pero fue muy bizarro un troll amenazandote para que lo carrees","replies":[]},{"poster":"Spiroz V2","date":"2019-09-01T14:55:30.009+0000","up_votes":1,"down_votes":2,"body":"y mira,aca estoy viendo tu perfil,yo creo que todos tenemos partidas malas,como tu k6 3/10 de hace unas 5 horas,o tu jax 1/5 de hace unas 4 horas,hace 4 dias el 0/8 con tresh,el 2/6 con kaisa,etc,no te estoy diciendo troll,tampoco me lo pareces,pero si te quejas de los compis,yo te veo a vos con el winrate del 45% que va a terminar en plata o mas bajo,no se para quien es la queja.\nAl post no te lo tiran si no posteas las fotos con nombre,pasa que rito no quiere que se forme la cadena de odio por un tipo que salio 0/10 de forma accidental,son cosas que pueden pasar.como por ejemplo en la partida con k6,moriste 1 vez cada 3 minutos y medio (en promedio claro) y creo que mataste por que eras asesino,incluso fuiste el que menos daño aporto en la partida,si no tranquilamente podrias haber salido 0/10 y la gente pensaria que sos troll...o bueno,asi es como lo haces ver.\nTe doy un consejo final,fijate como explayas la situacion a una persona que al parecer,se frustra por morir,o por como piensen sus compis,como es el caso de ashe.\n\n\"Se ofendia porque el equipo le decia que dejase de morir.\" y me parece totalmente logico,osea,imaginate que yo tengo cancer y que alguien venga y me diga,bueno curate...\n\nno cuesta nada decir,che ashe,no tenes movilidad,trata de jugar un poquito mas atras,de ultima juga en torno a nosotros asi te podemos protejer mejor..","replies":[{"poster":"Alba Meira","date":"2019-09-01T15:59:25.816+0000","up_votes":1,"down_votes":0,"body":"https://imgur.com/ut9zdkx\n\nAhi tiene señora, ni 10 minutos = 12 muertes, tranqui que no llego a 1000 de vida y ya me deletean, pero vamos, es mi culpa. Ah lo olvidaba, oriana echandome la culpa porque segun ellos, yo les manejo el teclado y mouse, por eso murieron. Logica. \nPd: Fidd 1.250.000 puntos de maestria.","replies":[{"poster":"Spiroz V2","date":"2019-09-02T06:33:45.460+0000","up_votes":1,"down_votes":0,"body":"meh","replies":[]}]},{"poster":"Alba Meira","date":"2019-09-01T15:50:51.334+0000","up_votes":1,"down_votes":0,"body":"Creo que te falta entender la parte en la que mi team otorga ventaja temprana al enemigo, le tiran primera torre minuto 6:37. Igual siempre me banco a los super animos que tiene lamentablemente :C \"mala partida\" y cada cosa que pasa escriben wp y gj, incluso cuando van 0/17 minuto 14:00 como una lux hace poco.\n\nAhora, ¿Cual es el secreto para que no me maten los enemigos que obtuvieron ventaja de los que tuvieran \":C mala partida sory\" ?\nSupongo que siempre hay que proteger al troll,no vayamos a arruinarle la experiencia, segun riot y algunos,  toda la razón.","replies":[{"poster":"Spiroz V2","date":"2019-09-02T06:30:36.978+0000","up_votes":1,"down_votes":0,"body":"claramente no es tu team,los estas re basureando,si fueran tu team,pobre de vos,para no tener 2 dedos de frente y empezar a jugar con otras personas diferentes.\n\nigual no es protejer al troll,vos te podes tomar las cosas como se te canten el orto,yo igual,que se yo,la idea es no romper los huevos por boludeces.","replies":[]}]},{"poster":"Windwall on CD","date":"2019-09-01T23:11:33.040+0000","up_votes":1,"down_votes":0,"body":"El winrate si bien da una idea de la habilidad no te define. Yo tengo 47% y estoy en Gold III en soloQ y vengo subiendo. Hay gente que aun sabiendo que el match-up lo pierde sigue intentando ganar un vs desde champ select (por exagerar) lo piedre. Es cuestion de cabecita, y si no te da, no vengas a arruinarle las partidas al resto","replies":[{"poster":"Spiroz V2","date":"2019-09-02T06:29:19.676+0000","up_votes":1,"down_votes":0,"body":"y si no te da,no podes jugar ? bueno,dijiste casi lo mismo,que feo bro.","replies":[]}]}]},{"poster":"FPX DOUinb","date":"2019-09-01T19:52:29.892+0000","up_votes":1,"down_votes":0,"body":"Si solo banean a los que escriben, ¿para que escribir?. El que es pelotudo lo va a ser siempre, por más que se lo repitas o le cagues la cabeza a patadas no va a cambiar, solo se están jugando la cuenta por hacer entender a alguien que nunca va a pensar.","replies":[]},{"poster":"Danimilz","date":"2019-09-01T06:57:36.437+0000","up_votes":1,"down_votes":0,"body":"Es las que esperas, es un servidor que no tiene nivel alguno y una pesima comunidad.","replies":[]},{"poster":"LoLCounter","date":"2019-09-01T03:46:21.967+0000","up_votes":1,"down_votes":2,"body":"La realidad es que el juego empareja según tu  lugar de procedencia y país.\nSi en tu capacidad económica podes quemarte 180 dolares al mes en el juego Chino.\nUna semana mas tendrás un  reset de DATA en servidores .\nY tendrás por 30 días en una sorpresa el mejor emparejamiento en partidas por 25-40 días .  No es tan seguro como un \neloboost comprando algo para tu cuenta y jugando firme.","replies":[{"poster":"Alba Meira","date":"2019-09-01T15:52:32.077+0000","up_votes":1,"down_votes":0,"body":"Y si, pero al final me dio 1 kilo de pan, yo le pedi 1 kilo de papa. Y el cartero me dejo la boleta en otra casa y no pude pagar.","replies":[]}]}]}