{"poster":"Best Aatrox NA","date":"2015-12-14T21:31:36.125+0000","title":"Aatrox Rework v5.0","subforum":"[ARCHIVED] General Discussion","up_votes":3,"down_votes":1,"body":"Decided to take some advice from people on how to better rework Aatrox.\n\nBiggest Changes:\n-Swapped R and Passive\n-The Darkin Blade now silences himself instead of nullifying his own healing\n-Blood in the Air is now an active ability that is not based off of how much damage he deals but how much he heals, and permanently grants him attack speed.\n-Passive&#039;s permanent ally buff was removed in favor of a slightly stronger overall teamfight impact.\n-Q now has range scalings based off of lifesteal and AP\n-E lifesteal scaling was removed and now heals based off of missing health \n-Shitty ability names now included\n-Probably something else I forgot\n\nObviously it is not possible to truly test the balance of something until it is actually in game, so please take my numbers with a grain of salt as I&#039;m just another casual league of legends player who happens to like Aatrox&#039;s concept.\n\nPassive\nPassive: Eternal Lust (A.K.A. Self Destruct): Upon dying, Aatrox makes a final stand, entering a stasis for 3 seconds and absorbing 20/23.5/26.5/30% (+50% Lifesteal)(+2% AP) of all nearby neutral and enemy units current HP in magic damage over the 3 seconds. After absorbing health for 3 seconds, Aatrox explodes and dies in a shower of blood that rages on for 4 seconds, granting nearby allies 5/7.5/10/12.5% bonus movement speed and 10/15/20/25% bonus attack speed. This effect is increased by 1% for every 1 Fury that Aatrox has built up. If The Darkin Blade is active while Aatrox dies, this bonus movement speed and attack speed is also doubled. Additionally, Aatrox heals nearby allies for 25/30/35/40% (+25% of Lifesteal) of their missing health over the 4 seconds.\n\nQ\nCooldown: 16/14/12/10/8\nQ: Not so Fast (Lol what a shitty name): Aatrox&#039;s extends his sword, granting his next auto attack 250/275/300/325/350 (+100% Lifesteal)(+15% AP) bonus range and piercing the target, pulling himself and his target towards eachother.\n\nW\nCooldown:24/22/20/18/16\nW: Blood In the Air: Passive: Aatrox empowers his blade, granting him 20/25/30/35/40% bonus attack speed.  (Directly stolen from Nocturne W)\nActive: Nearby allies are reinvigorated by Aatrox&#039;s thirst for blood, healing for 30/35/40/45/50% of the health that Aatrox gains from lifesteal.\n\nE\nCooldown: 10/9/8/7/6\nE: Blade of Torment: Aatrox rears back and pierces targets in a line, dealing 70/110/150/190/230(+60% bonus AD) (+60% AP) magical damage and heals for 7.5% of his missing health. Aatrox steals 18/21/24/27/30% movement speed from champions hit for 2/2.25/2.5/2.75/3 seconds.\n\nR\nPassive: While in normal form, Aatrox passively generates Fury every 1.5 seconds. In both normal and enraged forms, his basic attacks also each generate 2 Fury.\nActive: The Darkin Blade (WTF THESE NAMES): After reaching 100 Fury, Aatrox can activate The Darkin Blade to overcome himself with rage, silencing himself but gaining 20/30/40% tenacity, 40/50/60% bonus attack speed and dealing 3/4/5% (+7.5% of Lifesteal) (+ 1% of AP) of enemy&#039;s max health in magical damage for 10 seconds.","replies":[]}