{"poster":"Xedrek","date":"2017-05-06T04:09:02.590+0000","title":"The Poor Poor Twisted Fate","subforum":"[ARCHIVED] Miscellaneous","up_votes":1,"down_votes":0,"body":"The chronicles of Derek's bad Twisted Fate game \r\n-be me, support main tired of playing support \r\n-goes mid and picks a good all around pick, Twisted Fate \r\n-game about to start up and all of a sudden \r\n-BUGSPLAT \r\n-restart league client twice before in game \r\n-timer is at 0:48, nothing missed , no big deal \r\n-decide to go Doran's Shield because was reworked, seems good \r\n-makes small mistake in mid against Annie, Die \r\n-whatever.jpeg \r\n-i can roam \r\n-Varus has gotten his tower bot lane and come mid, which means no roam. \r\n-i go top to get some farm as its been a minute in a half since I've had a minion in my own lane (fk Varus), and enemy Miss Fortune has the wave frozen up to her tower because no more bot\r\n-Walking top with a saunter in my step, our Tryndamere respawns and teleports top \r\n-I'm pretty upset at that, I type \"Wtf trynd\" in chat. \r\n-i feel his keyboard isn't working properly at this point because he doesn't respond. he also fed their top Blitzcrank 5 kills \r\n-only logical explanation \r\n-I'm the second jungler now because our Sejuani doesn't like taking her camps, what a gentle soul \r\n-get chunked by camp, catch half minion a wave, now half health, base. this is the life I live now \r\n-!!!!!!!!!!!! \r\n-random hook from blitz on my flank, killed in 2 seconds. Their blitz is 8/1 now \r\n-i notice we are losing almost every fight, even if we have all the members. \r\n-i assume we don't have any damage. i was wrong. no sightstone on our Sona \r\n-Frost Queen's Claim and Lichbane. I want her items so bad \r\n-i see Sejuani has a ruby crystal in her inventory \r\n-i ask her to build a sightstone for us because we don't have one \r\n-\"Why don't you build one?\" I think she is r%%%%%ed at this point. We mustn't make fun of the disabled \r\n-i go to finish my abyssal scepter at this point when I remember something and my mind is numb with contempt at myself and riot games \r\n-abyssal isn't an AP item anymore. And the new banshee's veil builds out of just a null magic mantle, not a negatron cloak \r\n-minutes later a sell my negatron cloak for a book and a null magic. My family was already poor enough without this setback. \r\n-i glance at the scoreboard, a terrible mistake \r\n-Tryndamere is 1/11 at this point... make that 1/12 as he sacrifices himself, because I guess the game got too quiet \r\n-after several years of this, and several surrenders posed by me we finally get aced for like the 6 time (probably actually accurate) \r\n-we surrender as we are about to lose our home \r\n-i unfriend the person who added me to this terrible game \r\n-i'm am a shadow of what I once was","replies":[{"poster":" Milla Jovovich","date":"2017-05-06T04:18:46.489+0000","up_votes":2,"down_votes":0,"body":"I actually read all of this.\n\nWhy am I like this.meme","replies":[]},{"poster":"MagicFlyingLlama","date":"2017-05-06T04:14:30.630+0000","up_votes":1,"down_votes":0,"body":"Wat.","replies":[]}]}