{"poster":"X3lth","date":"2016-08-17T16:10:06.436+0000","title":"[Championkonzept] Spirit - Der Beschützer der Schwachen","subforum":"Skin- & Champion-Konzepte","up_votes":7,"down_votes":2,"body":"**Spirit - Die Besch&uuml;tzerin der Schwachen (Support) **\n\n**Passive**: Spirit kann sich an einen Verb&uuml;ndeten Champion heften (besitzt keinen eigenen K&ouml;rper) und ihm zus&auml;tzliche Stats geben, sowie ihm Buffs verleihen. \nSollte der Champion, an dem Spirit gebunden ist, sterben, bleibt Spirit f&uuml;r 5/3/2 Sekunde an der Stelle bestehen und ist unverwundbar. W&auml;hrend dieses Zustandes ohne einen Vertragspartner, kann sie von einem Verb&uuml;ndeten Champion eingesammelt werden und ist an diesen gebunden. Sollte Spirit nicht aufgesammelt werden, wird ihr Unverwundbarkeit aufgehoben und erh&auml;lt sie eine Lebensanzeige sowie ihre Resistenzen und kann get&ouml;tet werden  Vertragspartner k&ouml;nnen alle 30 Sekunden gewechselt werden (kleine Reichweite).  \n\n**Q - Gabe der Engel:** Kosten: 60/80/100/120/140 Mana | Cooldown: 15/13/11/9/7 Sekunden pro Ladung\nSpirit heilt ihren Vertragspartner in H&ouml;he von 20/30/40/50/60 +25% F&auml;higkeitsst&auml;rke pro Ladung, maximal 60/90/120/150/180 +75% F&auml;higkeitsst&auml;rke. Zudem wird bei Ausf&uuml;hrung der Cooldown von _Kraft der Gefallenen_ um 1/2/3 Sekunden (pro Ladung) verringert und Bewegungsgeschwindigkeit von 10/20/30/40/50 +10% F&auml;higkeitst&auml;rke erteilt.\n\n**W - Seelensprung:** Kosten: 150/170/190/210/230 Mana | Cooldown: 30 Sekunden auf allen R&auml;ngen \nSpirit l&auml;dt einen Seelensprung auf um sie und seinen Vertragspartner &uuml;ber eine Distanz zu teleportieren _(Zac E Mechanik) _. \nW&auml;hrend des Aufladens wird die Bewegungsgeschwindigkeit des Vertragspartners, proportional zur Weite des Sprunges, verringert.\nAuf Rang 5 erh&auml;lt diese F&auml;higkeit einen Auflademechanismus. Allerdings hat die F&auml;higkeit nach jeder Ausf&uuml;hrung einen Cooldown von mindestens 5 Sekunden (nicht von Cooldownreduction beeinflussbar).\n\n**E - Kraft der Gefallenen:** Kosten:  55/60/65/70/75 Mana | Cooldown: 20/18/16/14/12 Sekunden\nVerst&auml;rkt die n&auml;chsten normalen Angriffe ihres Vertragspartners f&uuml;r 1/2/3/4/5 Sekunden, wodurch diese Gegner f&uuml;r 0.5 Sekunden um 5/10/15/20/25 % +5% F&auml;higkeitsst&auml;rke % verlangsamen und zus&auml;tzlich 25/40/55/70/85 +20% F&auml;higkeitsst&auml;rke magischen Schaden verursachen.\n\n**R - Segen der Geisterwelt:** Kosten: 150/200/250 | Cooldown: 120/100/80 Sekunden\nSpirit betet zur Geisterwelt und entfernt alle Debuffs und Massenkontrolleffekte von seinen Vertragspartner und macht den Vertragspartner f&uuml;r 1.5/2.5/3.5 Sekunden immun gegen Massenkontrolleffekte. Zudem bekommt er Bewegungsgeschwindigkeit in H&ouml;he von 20/50/80 &uuml;ber diesen Zeitraum. W&auml;hrend _Segen der Geisterwelt_ aktiv ist kann _Seelensprung_ nicht eingesetzt werden und der Vertragspartner nicht gewechselt werden. \n\n_Passive:_ **Spirits Stats** (welche sie durch ihre Items erhält) werden zum Teil auf seinen Vertragspartner &uuml;bertragen (Golderwerb nur durch {{item:3069}} und Assists m&ouml;glich):\nLeben: 15% \nMana: 10% \nR&uuml;stung: 20% \nMagieresistenz: 20%\nAngriffsgeschwindigkeit: 50% \nAngriffsschaden: 20%\nFähigkeitsstärke: 15 %\nCrit. Chance: 50%\n\n\n\n\nIch wollte mit diesem Championkonzept mal etwas neues einbringen. Es mag eventuell so scheinen als ob Spirit OP sein k&ouml;nnte aber bedenkt, dass ein kompletter Champion im Spiel &quot;fehlt&quot;.\nSchreibt eure Meinung gern in die Kommentare und scheut nicht vor Verbesserungsvorschl&auml;gen. {{sticker:slayer-pantheon-thumbs}}  \nMfG Xelth","replies":[{"poster":"Xipiz700","date":"2016-08-19T17:39:22.592+0000","up_votes":2,"down_votes":0,"body":"Hallo! :3\nGenerell gute Idee. Nur ist er mMn zu abhängig und kann nur durch gute Koordination gespielt werden, dazu würde er sich sehr langweilig anfühlen, da du  im Prinzip nur paar Tasten drücken musst. Daher sollte er auch einen eigenen Körper besitzen und nur wenn er will sich an seinen Partner hängen. Das sollte dann so im Verhältnis wie Gnar/Megagnar sein. \n-Braucht komplettes neues Kit für die nicht verbundene Variante\n    -Vorschlag: Fähigkeit die es dem ADC ermöglicht zu engagen um dann von der Geistform zu profitieren = Fähigkeit die zb. mit AA den Gegner verlangsamt\n    -Möglichkeit in Körperform seine Geistform zu stärken zb. Cooldown zurüksetzung durch treffen einer Fähigkeit\n-Fähigkeiten etwas schwächen zb. Nur massive Zähigkeit bei Ult anstatt Immunität\n    - Die W schwächen durch \"nur\" Lauftempo + Zähigkeit statt Sprung\n\nWeißt du was ich meine? Der Spieler soll auch das Gefühl haben auf etwas hinzuarbeiten, um dann zb. einen stärkeren Einfluss zu haben.\nHoffe dir helfen meine Vorschläge! Freue mich auf deine Antwort! :3\nMfG Xipiz700\nP.S: Helfe dir gerne bei Überarbeitungen{{summoner:31}}","replies":[{"poster":"X3lth","date":"2016-08-19T18:01:59.948+0000","up_votes":1,"down_votes":0,"body":"Gute Idee mit der 2. Form! {{summoner:30}} \nDas lässt eine große Chance für Überarbeitungsmöglichkeiten {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"H3nt4i K4m3n","date":"2016-08-17T16:29:34.488+0000","up_votes":1,"down_votes":1,"body":"der wäre sowas von op als supporter, auch wenn einer fehlt . ich sag nur kog maw der cc immun im lategame knapp 120-150 dmg pro schuss extra gibt zuzüglich der atk speed und crit chance XD. penta secured.","replies":[{"poster":"X3lth","date":"2016-08-17T18:23:06.230+0000","up_votes":2,"down_votes":0,"body":"Eine starke Kombo definitiv aber nur im Lategame. Im earlygame allerdings extrem anfällig da er keinen Supporter zum peelen hat, nur einen schwachen Heal. Wenn man es falsch spielt ist das Spiel in den ersten 20 Minuten vorbei, weil der gegnerische Adc 10/0/0 steht.","replies":[{"poster":"X3lth","date":"2016-08-17T19:17:02.702+0000","up_votes":2,"down_votes":0,"body":"Außerdem bekommt er Critchance nur wenn Spirit diese auch selber kauft, da ihre Werte entscheidend sind. Zum Beispiel: Spirit hat 30% Critchance. Der Adc bekommt nur 15%. Du hast durch das Weiterreichen deiner Stats eine Menge Variabilität. Da du als Supporter eher wenig Gold zur Verfügung hast ist es wahrscheinlicher, dass du Tank baust und ab lvl. 6 deinem Adc defensivere Stats zukommen lässt. Es ist situativ zu entscheiden mit welchen Stats du deinen Adc ausstattest. Habt ihr ein Gegnerisches Team mit Hardengage (zb {{champion:54}} ; Knockup ist eine CC die nicht abgebrochen werden kann btw) würde sich der Itemweg mit Leben und Resistenzen lohnen. Habt ihr allerding ein Jungler mit viel CC und einen Toplaner der Peelen kann, würde sich die Damagelastige variante mehr lohnen. Sicher wäre es auch sinnvoll eine Kombination dieser Wege zu gehen.","replies":[]}]}]},{"poster":"Punya ku","date":"2016-08-20T00:19:04.497+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Xipiz700","date":"2016-08-20T10:06:56.052+0000","up_votes":1,"down_votes":0,"body":"Kein Problem ^^. Ich denke die Idee mit dem Mechasuit ist cool, aber eher schwer zu Balancen (stell dir nen Kogmaw mit Dauerfeuer vor -.-). Dazu wäre er dann in SoloQ unspielbar. Denke die Grundidee wird sein, dass Spirit sich aufgibt um seinen ADC oder Verbündeten zu helfen, nützlich wäre dann ein Ping der signalisiert, dass man hilfe braucht: STRG + Rechtsklick auf Spirit oder sein Porträt über der Map. \nMfG Xipiz700 {{summoner:31}}","replies":[]}]},{"poster":"CG IkeBGud","date":"2016-08-19T14:25:47.072+0000","up_votes":1,"down_votes":0,"body":"{{champion:245}} {{summoner:32}} {{item:3642}} {{sticker:slayer-pantheon-popcorn}} {{sticker:zombie-nunu-hearts}} {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}