{"poster":"DaddyForDollars","date":"2017-06-15T07:47:07.061+0000","title":"So about the whole blood draw question.","subforum":"[ARCHIVED] General Discussion","up_votes":1,"down_votes":17,"body":"I&#039;m confused. You can&#039;t tell me on this board that honestly no one here either is or WAS in medical or even knows someone or knows OF somebody who is in medical that works.\n\nThe medical field is literally the biggest fucking field in the whole world and you guys are telling me NO ONE out of the massive amounts of people on these boards knows OF someone who is a phlebotomist for the BIGGEST fucking corporations that draw blood. Either LABCORP or Quest diagnostics. Literally probably the only places you guys go to, \neven if they aren&#039;t they are still the biggest. On top of that, a lot of people will get entry level medical jobs (CNA, phlebotomist) while they save money to go to school for the real jobs they want just like you nerds do for IT. So you guys should know this or know someone who does.\n\n\nAll i need to know is if labcorp has syringes or not. Cause i had a lady who drew my blood and she acted real fucking weird and i&#039;m worried she did something. Also, no, i can't call them and ask if she did anything. Even if she did they won't discuss anything at all over the phone. So please don't be dicks to me here guys. It&#039;s true, it&#039;s SO unlikely she&#039;d randomly do something, but who knows. There&#039;s a lot of crazy people (like me) nowadays and all i know was that lady was weird asf and assembled all the  blood draw tools out of my line of sight and wouldn&#039;t talk to me. She also drew my blood incorrectly, she didn&#039;t use a tournequit and no, she wasn&#039;t new. I called and apparantly shes been there for like 2 years. So yeah, it&#039;s all weird. And i had really bad bruising and i never do &quot; oh dude, that&#039;s cause she did it wrong! no shit! what ELSE did she do wrong?&quot;  That&#039;s what you guys are here for!\n\nI called them and the supervisor at the location i went to said they DID have syringes. Spoke to a different supervisor he said &quot;no. it&#039;s a company  wide policy. we don&#039;t carry/ need them. we only use vacutainers. period.&quot;\n\nAnother manager acted weird and then said that they only use vacutainers.  Another lady said they only use vacutainers. My ex however said that they could have syringes for people who have IV&#039;s or for ports( idk what that means). However, idk why someone with an IV would be going into labcorp, they would be at a facility. I&#039;m just confused by the varying answers. The reason this matters is cause the lady clearly didn&#039;t know how to draw blood (or could&#039;ve theoretically did something intentionally) with a syringe she could inject. With a vacutainer it would be impossible for her to give me anything. I know this sounds crazy but it&#039;s a very simple question and should be a straightforward answer. Someone has gotta know this.\n\n Please.","replies":[]}