{"poster":"DaddyForDollars","date":"2017-05-12T01:46:59.753+0000","title":"Does absence make the heart grow fonder or help it move on?","subforum":"[ARCHIVED] General Discussion","up_votes":2,"down_votes":7,"body":"I&#039;m hearing some mixed things. With my current girlfriend/ ex i&#039;m trying to fix things with i&#039;ve been purposely not talking to her. For a while this kinda worked but i don&#039;t know if you start to do the same thing with people they start to catch on. Like empty threats after a while start to not work at all.\r\n\r\nSo that means it has to be a serious threat( threat in a sense that i actually stop talking to her) it&#039;s just really hard.\r\n\r\nI was with this girl for close to 4 years and i know the whole &quot;plenty of fish in the sea&quot; yada yada but she geniunely felt like the one. She doesn&#039;t even see me as a human anymore. She sees me as this &quot;artistic&quot; replace r with u kid that sits at home and plays videogames and doesn&#039;t have a good job(i don&#039;t).\r\n\r\nShe doesn&#039;t care that i actually like her. It&#039;s all about my goals (i.e how much money i can make) it just all feels so fake. It really hurts me. I thought we had something serious and it feels like i&#039;ve wasted all this time. She&#039;s so stubborn nothing i try works. If i ignore her i feel like she&#039;s just gunna either move on or not talk to me.\r\n\r\nThe thing is she wants to talk to me but it&#039;s only if i &quot;change&quot; but she doesn&#039;t care about me changing at this point. It&#039;s just some vague shit she says so she can go long periods without talking to me and then if i say ONE wrong thing it&#039;s &quot;you didn&#039;t change. bye.&quot;   She complains about coming to my house because it&#039;s too far and then drives 15 minutes away (my house is only 7 minutes away from hers) to go eat food with a coworker. So she not only drives further but also spends money on food?\r\n\r\nShe constantly ignores me and everything i say it feels like it doesn&#039;t matter. Even when i try to be reasonable she sees it as a &quot; manipulation ploy&quot; now mind you, i cheated on this girl, twice. And she took me back. But she was younger back then. I don&#039;t know if she&#039;s just grown up and realized it&#039;s a waste of time? The problem is i have ACTUALLY changed this time but i don&#039;t know if i caused too much damage at this point.\r\n\r\nIt just... really sucks and hurts. Yes i messed up badly, but i have geniunely  changed. But now what? I move on? It&#039;s just hard. She&#039;s always been around, she&#039;s completely learned to be without me. It all feels so..robotic... so inhumane.","replies":[]}