{"poster":"She Loves Me","date":"2017-12-31T14:51:57.485+0000","title":"Former Diamond ADC Main- My Thoughts","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"I used to main AD but after being bored of the &quot;meta&quot; picks of tristanal and twitch etc. I just couldn&#039;t be bothered playing it anymore. \r\n\r\nAfter a long season of inting offrole i did end up getting diamond before season end playing AD again, but gone back to the inting offrole picks pre season, been demoted to plat 3 or so.. (obviously my toplane is not on par with my AD skills)\r\n\r\nI just recently started playing trist again and it just seems so broken? How do people struggle on this champion, how do peoiple even go negative on this bs champion? She is so smooth, cancels CC with her W etc... i juyst dont get how people can lose with her.","replies":[{"poster":"gangsha1ger","date":"2018-01-01T00:22:11.232+0000","up_votes":1,"down_votes":0,"body":"Do you mean, how do people lose lane as a Tristana? Because in OCE people lose game for a variety of reasons, it might not be to do with the ADC so much.\nAs for lane, there are some matchups that Tristana might have trouble into. Or perhaps the bot lane are just poor at map awareness and get ganked a lot. \n\nOr possibly your opponents are just rabbits and you are stomping them. There are a lot of poor adcs out there currently (especially in Diamond 5). Keep stomping them until you find the reason :)","replies":[{"poster":"She Loves Me","date":"2018-01-09T14:37:25.227+0000","up_votes":1,"down_votes":0,"body":"There is no reason, trist is unbeatable and no, i didnt mean just lane i meant game. She carries so hard :^)","replies":[]}]},{"poster":"Funsocks","date":"2017-12-31T15:49:30.185+0000","up_votes":1,"down_votes":0,"body":"So there's a few things at play here, from my perspective.\n\nThe first is the matchmaking. She's simply a good pick if you're on your own for the reasons you described. Sivir is similarly capable and versatile.\n\nNext is her versatility. Most ADCs typically fall into either the hard engage and trade, win or lose (Draven, Miss Fortune, Caitlyn) or hypercarry lategame (Twitch, Vayne, Jinx) categories. There are obvious adjustments to need to make to suit the lane, but those characters are generally better off either aggressively trading or playing very passively and farming. Both Sivir and Tristana are very good at switching modes in this regard. Tristana is very good at trading because of the threat of her e, her attackspeed boost and her follow up with her jump and reset, but can also quite comfortably farm the lane on the back foot, rely on her passive and use of her jump to escape. Similarly, Sivir can also use her ult in a daring charge and follow-up with her spellshield or stay back and keep the enemy at bay with ricochet and Q when they stick their noses out, using her E and ult to escape particularly aggressive junglers. If you main either champion, and assuming there isn't an enemy assassin fed to shit or some very undesirable gameplay outcome, you usually have a fairly decent chance of having an impact in the game, regardless of if it's victory or defeat. Compare this to, say, a Twitch who hasn't snowballed's impact in the early and midgames. You just have a lot more options, and your playstyle can accommodate roaming at points in the game that can be crucial for ADCs, the very early game.\n\nTo answer your final question (statement?), it's a lack of understanding of the fundamentals. A lot of players don't really look too deeply into the established meta itself. For example, a very good adc might not be able to define precisely what the \"Trading stance\" is, even though they use it all the time. Just having that understanding of a core game principal, for one, gives you something specific to practice at and gauge improvement, but secondly and perhaps more importantly, allows you to understand when to do it. Which matchups is it appropriate to aggressively trade with and where should you stand based off that and the selections in lane. Without a solid grounding the the fundamentals of the meta and WHY it's established the way it is, you may very well become very individually good and a mechanical god, but you'll falter when it comes to macro plays and an understanding of the broader perspective. Why build orders exists and just how tight and down to the line bot lane can be. There are undeniably boosters and people in even your division who might very well be quite good, but don't understand the bigger picture. That's how people lose with her.","replies":[{"poster":"She Loves Me","date":"2017-12-31T15:55:39.750+0000","up_votes":1,"down_votes":0,"body":"LOL","replies":[]}]}]}