{"poster":"ZohZe","date":"2017-09-18T21:56:24.847+0000","title":"Better punishment for abusive players","subforum":"General Discussion","up_votes":4,"down_votes":3,"body":"Why on earth are permanent bans a thing for aggressive chat? A player chatting aggressively can just be muted by the other players if they don't like how he plays. A player chatting aggressively is still trying to win the game. A player chatting aggressively obviously enjoys the game and likes to be competitive. On the other hand, nothing can be done in a game in response to a player who is intentionally feeding, a boosted player, or an afk player. Yet the same punishment is still enforced. So why is a player who chats aggressively punished by permanent bans? This makes absolutely no sense.\r\nLike I said before; an aggressive player can be muted by all other players. It's as simple as that. A click of a button taking literally one second. That's all it takes in-game for players to counteract the negative effects of aggressive chat. So why is something that can be solved by others in one second punished by a permanent ban?\r\n\r\nI can guarantee you that over 70% of people that play league of legends have more than one account. So a permanent is not in the slightest preventing a player who chats aggressively from playing your game. They are still in the community and don't change at all - they will continue to be aggressive and competitive. Once again this only takes one second in-game for other players to fix if they don't like it. So why is aggressive chat punished by a permanent ban? No matter how many times someone reports a toxic player and that player is banned, there will always be more toxic players. It is a part of every game. This is partly due to most people having multiple accounts.\r\n\r\nYou have got to be kidding if you think a permanent ban is the best solution to an aggressive player. I can tell you that from experience a toxic player will always be toxic unless their chat privileges are taken away. I have been permanently banned and have had chat restrictions. After experiencing both of these things, I can tell you that the more effective solution to an aggressive player is chat restrictions. Knowing that I couldn't communicate with my team, I didn't get so wound up by things i couldn't control. However a 2 week or permanent ban only irritates people, and me like every else will just jump on one of our other accounts and keep playing - however this time even more irritated because of the ban.\r\n\r\nAnother point to raise is that there are different kinds of flamers however they are all punished the same. I admit I occasionally flame, however I only go so far as to call my team useless and make a point to never to get too personal. All the while I am still trying to win the game. However this is given the same punishment as a player who will tell people to kill themselves and just give up on trying to win the game altogether. I, as well as most people I assume, have been on the receiving end of these types of players. There are different kinds of flamers, however they are all punished the same.\r\n\r\nSo I suggest to you; instead of a permanent ban, a permanent chat ban for aggressive players should be implemented as it would be much more effective. This would allow the restricted players to develop a different mentality about playing games (I know it would for me), as they are unable to communicate with their team and their whole focus would be on winning the game, and not on abusing their team mates. This in turn would increase the standard of the LoL community immensely by preventing negative chat and abuse, allowing for a more pleasant experience for all players. By permanently banning players you aren't helping them at all, but rather aggravating them further. A permanent chat ban not only helps the team but the individual who would otherwise be aggressive in-chat.\r\n\r\nSo to recap: \r\n-aggressive chat is easily prevented in game by a click of a button\r\n-most players have multiple accounts and so permanently banning one of them doesn't in the slightest prevent that person from playing\r\n-there are different kinds of flamers, some less severe than others however all are given the same punishment\r\n-no matter how many times a person reports a negative player and that player is banned, there will always be more negative players (this mostly due to most players having multiple accounts) \r\n-a permanent chat ban would be much more effective; increasing the standard of the LoL community and helping the otherwise aggressive player to play differently with a different focus\r\n\r\nIf you really want to help aggressive players and improve the standard of the LoL community, a permanent ban is not the way to go. A permanent chat restriction would be a much more effective punishment for this behaviour. I understand that negative chat should not be a part of any game and creates a negative experience however it is and always will have a part in every game. Even in physical sports tempers are high and players abuse each other (I know this as I have played rugby league at a national level and where the stakes are high so are emotions). You can also see this in MMA pre-fight conferences where the fighters are abusing each other in front of crowds. However they are not reported or banned. It is part of the game.","replies":[]}