{"poster":"DarkinPrime","date":"2017-02-20T23:16:00.739+0000","title":"Biggest Pet Peeve Discovered....people chiming in in chat during the game","subforum":"Player Behavior","up_votes":1,"down_votes":13,"body":"When you are typing to you jungler and having a dispute and the support or adc chime in with their unsolicited 2 cents.\r\n\r\nSeriously, if the conversation doesn&#039;t apply to what you are doing in your lane at that point just keep your mouth shut and let them sort it out instead of saying something that is going to aggravate one of them, and probably make them type back to you, get them unfocused, possibly tilted, along with drawing you into a back and forth distracting everyone.","replies":[{"poster":"420 grams","date":"2017-02-20T23:26:48.902+0000","up_votes":5,"down_votes":0,"body":"Let me guess; you started feeding, blamed your jungler, someone in bot agreed with the jungler, and so you got more mad and fed more.","replies":[{"poster":"DarkinPrime","date":"2017-02-21T00:54:25.522+0000","up_votes":1,"down_votes":3,"body":"Sure, when the jungler waits until 13 minutes in to start ganking, I take issue with that.\n\nAND IM CORRECT TO DO SO. I don't need a feeding support at bot to start attacking me for it.","replies":[]}]},{"poster":"Limmie","date":"2017-02-21T00:15:45.944+0000","up_votes":4,"down_votes":0,"body":"Lanes aren't self contained, everything that happens in the game affects everybody else. They have just as much right to chime in as you. If you don't like what they have to say mute them.","replies":[{"poster":"DarkinPrime","date":"2017-02-21T00:53:10.944+0000","up_votes":1,"down_votes":1,"body":"Saying to just mute them is unrealistic. Just because they say something stupid doensnt mean you necessarily want to not hear what they have to say later in the match, which could be important.","replies":[{"poster":"Limmie","date":"2017-02-21T03:00:28.103+0000","up_votes":2,"down_votes":0,"body":"Mute them for a while then unmute them later, or just ignore them.","replies":[]}]}]}]}