{"poster":"Henraaa","date":"2017-05-21T18:26:18.252+0000","title":"Ranking System","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":5,"body":"Wieso wird man so **absolut hirnrissig eingeranked **? Ich habe heute 30 LP innerhalb von 2 Spielen verloren. Ich war beide male** gefeedet **hab auch pro Spiel ein S- bekommen, das Problem war, dass im ersten Game der **ADC von Beginn an AFK** war ( Remake bescheuerterweise trotzdem nicht m&ouml;glich)  und im zweiten Game war der **Toplaner nach einiger Zeit AFK**. Also wieso wird man in Ranked Games aufgrund seiner oft feedenden/afk Mates eingeranked **statt aufgrund seiner eigenen Leistung **??? In FlexQ ist das ja noch verst&auml;ndlich da es dein Team ist aber in Solo/DuoQ spielt man nun mal oft mit irgendwelchen geboosteten Vollidioten(sry f&uuml;r die Ausdrucksweise, ist aber nun mal so, Gr&uuml;&szlig;e gehen raus an den tollen 3/15/2 Rengar nach 50 Minuten). Also erkl&auml;rt mir den Grundgedanken dieses meiner Meinung nach extrem dummen einrank System.","replies":[{"poster":"Sirrkas","date":"2017-05-21T21:14:07.147+0000","up_votes":2,"down_votes":0,"body":"Weil die Leute dann auf Stats statt auf Sieg spielen würden, was einige eh schon machen. Dadurch würde das aber nur verschlimmert. Dann steht da dein ADC hinter dem gegnerischen Nexus und versucht noch ein paar Kills zu kriegen, weil der gegnerische Support da noch steht und wenige Leben hat, statt die Nexustürme zu zerstören und das Spiel zu gewinnen.","replies":[{"poster":"Henraaa","date":"2017-05-21T21:43:16.157+0000","up_votes":1,"down_votes":1,"body":"Natürlich, aber um das zu machen muss man schließlich kurz vor dem Sieg sein, d.h. in der Position kommt es auf selbe hinaus. Und ich meine mit meinen Aussagen auch nicht, dass die KDA alles entscheidet. Letzendlich funktioniert das Bewertungssystem ja auch nicht nur über die KDA sondern auch über Wards, dmg an champs/türmen, farm usw. und wenn man danach nicht eingerankt wird, heißt es ja dass riot sich selbst die Spielerbewertung nicht zutraut, da sie ja offensichtlich ungenau ist, da fragt man sich dann schonmal wieso man Lvl 6/7 Masterys nur mit S Rängen bekommen kann und nicht einfach (so wie man halt auch die Elo bekommt) durch Wins/Looses.","replies":[{"poster":"Sirrkas","date":"2017-05-21T21:59:09.785+0000","up_votes":2,"down_votes":0,"body":"Da gibt es auch noch mehr Sachen. Ein Toplaner könnte zum Beispiel seine Lane stompen und mit ihm wärt ihr in der Lage, jeden Teamfight locker zu gewinnen. Er mischt sich in Kämpfe aber nur dann ein, wenn er sich sicher sein kann, nicht zu sterben und leichte Kills zu bekommen. Wenn das nicht möglich ist, farmt er weiter Minions. Der könnte dann durchwegs auf der Toplane sein und da Minions abfarmen, weil die Gegner merken, dass er die Lane nicht verlässt, zwingen sie euch zu einem Teamfight und gewinnen den. Als sich ihm 2 in der Toplane in den Weg stellen, bleibt er auf Abstand, während die anderen 3 eure Mitte pushen und den Inhib nehmen. \n\n\nAndere würden statt wichtige Ziele zu nehmen, vielleicht Zeit verschwenden Kills hinter her zu rennen, die sie nicht kriegen können. Einen möglichen Sieg für einen Baron oder Drachen opfern, weil man den für die Statistik mitnehmen will, der spielt da ja sicher auch rein. Auf Selbstaufopferung verzichten, die dem Team geholfen hätten, das Spiel zu entscheiden, um den eigenen Tod zu vermeiden.\n\n>da fragt man sich dann schonmal wieso man Lvl 6/7 Masterys nur mit S Rängen bekommen kann und nicht einfach (so wie man halt auch die Elo bekommt) durch Wins/Looses.\n\nVermutlich, damit sich diese Stufen nicht so bedeutungslos anfühlen, wie die bis Stufe 5. Bis Stufe 5 muss man ja nur spielen. Ob 50 Siege oder 400 Niederlagen, das macht keinen Unterschied. Irgendwann ist man Stufe 5. Danach muss man zwar nur ein paar richtig gute Spiele für 6 und 7 haben, aber man kann zumindest nicht einfach durchgehend schlecht sein, um aufzusteigen.","replies":[]}]}]},{"poster":"Allerbester Biss","date":"2017-05-21T18:56:40.318+0000","up_votes":1,"down_votes":0,"body":"Und wieso kommen manche Dia und Plat?\nErklär mir das bitte","replies":[{"poster":"Henraaa","date":"2017-05-21T21:37:00.527+0000","up_votes":1,"down_votes":0,"body":"Leute die auf solchen Niveau spielen brauchen kein/nicht viel Glück, da sie oft das Zeug zum Solo Carry haben. Ich jedoch bin nun mal derzeit Bronze 3 und ich bezweifle, dass ich auf Plat/Dia Niveau komme, dass Ding ist nur, dass ich nun mal nicht Solo Carryn kann, wie gern ich es auch können wollen würde. Aber dass ich nicht in Bronze 3 gehöre merke ich daran, dass ich absolut solide spiele. Als Azir Main (Ich weiß dass Azir Offmeta ist) bin ich so gut wie in jedem Spiel gefeedet, es gibt gegen gewisse Gegner (Zed, Kassadin) nun mal noch Probleme da ich Azir noch lange nicht gemeistert hab, aber mit anderen Champions hat man es schwer gegen mich. Du darfst dir gerne meinen Spielverlauf ansehen, du wirst viele gute KDAs und selten schlechte KDAs sehen (vorallem auf Azir und Gnar).","replies":[{"poster":"Allerbester Biss","date":"2017-05-21T21:49:49.935+0000","up_votes":1,"down_votes":0,"body":"Ich kann gerne auf deine Kda und was weiß ich gucken aber es sagt nur etwas aus ob DU GEWINNST und OB DU DER CARRY WARST\n\nSonst ist alles egal\nUnd in Bronze 3 musst du nicht besonders gut sein um alleine zu carryn\nMit Azur ist das schwerer als mit anderen aber vl liegt es auch am Champ xD\n\nIch will dir Azir nicht ausreden aber Probier mal andere Champs die früher schon ordentlich Schäden machen können ","replies":[]}]},{"poster":"Namlesshero","date":"2017-05-21T19:10:31.754+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Allerbester Boss,realm=EUW,application-id=ip27PlEH,discussion-id=UEwIsQRQ,comment-id=0000,timestamp=2017-05-21T18:56:40.318+0000)\n>\n> Und wieso kommen manche Dia und Plat?\n> Erklär mir das bitte\n\nPures Glück ich sags dir ^^","replies":[{"poster":"Allerbester Biss","date":"2017-05-21T19:56:29.795+0000","up_votes":1,"down_votes":0,"body":"Auf jeden Fall :p","replies":[]}]}]}]}