{"poster":"General Of Death","date":"2016-07-03T10:23:14.596+0000","title":"Match History Error","subforum":"Help & Support (OCE)","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"http://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/139081747/200497361","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":0,"body":"Anyone know if there is a problem with the match history page? For some reason I&#039;m not able to check any of my history matches that I&#039;ve played. When I click on _&quot;View on the web&quot;_ It opens a new tab, but then the page is just blank without being able to see the history of the match. Also tried opening up the page using a different browser, but it was the same. It&#039;s been like that for a while now, so it&#039;s not a new error. Also is anyone else experiencing such error and you know how to fix it? Thanks for replying.","replies":[{"poster":"SephirothSG","date":"2016-07-03T12:00:28.637+0000","up_votes":2,"down_votes":0,"body":"Hey there,\n\nCould you please visit [this](http://matchhistory.oce.leagueoflegends.com/cdn-cgi/trace) URL and paste the output in a reply so I can forward this issue to the live services team to be looked in to.\n\nPlease also remove your IP address from the output before posting.","replies":[{"poster":"General Of Death","date":"2016-07-03T12:47:40.304+0000","up_votes":1,"down_votes":0,"body":"Hey, thanks for replying back. Here's the output without the IP address.\n\nfl=84f6\nh=matchhistory.oce.leagueoflegends.com\nts=1467549715.333\nvisit_scheme=http\nuag=Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/46.0.2486.0 Safari/537.36 Edge/13.10586\ncolo=PER\nspdy=off\nhttp=http/1.1\nloc=AU","replies":[{"poster":"SephirothSG","date":"2016-07-04T07:41:30.717+0000","up_votes":1,"down_votes":0,"body":"There's people currently looking into this now, check the match history page again in a couple of days, let me know if it's still not working.","replies":[{"poster":"General Of Death","date":"2016-07-23T12:18:29.704+0000","up_votes":1,"down_votes":0,"body":"Hey SephirothSG,\nJust letting you know that it is still not working. I also wrote you a comment 13 days ago that it was still just a blank page and that it wasn't showing anything.","replies":[{"poster":"SephirothSG","date":"2016-07-23T21:21:26.382+0000","up_votes":1,"down_votes":0,"body":"Sorry, because the comment you left wasnt a reply j wasn't notified of it.\n\nCould you please load the URL linked above for me again and ensure that Colo is the same as last time?\n\nCan you also tell me what browser you're using, thanks.","replies":[{"poster":"General Of Death","date":"2016-07-26T14:21:56.486+0000","up_votes":1,"down_votes":0,"body":"Hey SephirothSG,\n\nJust letting you know that Match History is working on Google Chrome now. Tried with a few different match history links and it seems to be working. However, the issue is still the same on Microsoft Edge, which is the browser I use more often. I also checked the URL linked above and the Colo is the same as last time. Thanks","replies":[{"poster":"SephirothSG","date":"2016-07-27T06:45:32.306+0000","up_votes":1,"down_votes":0,"body":"Oh, yes.\n\nMay I recommend you to stop using Microsoft Edge? This browser has a lot of incompatibility issues with many sites, leagues match history being one of them.","replies":[]}]}]}]}]}]}]},{"poster":"General Of Death","date":"2016-07-10T05:52:12.864+0000","up_votes":1,"down_votes":0,"body":"Hey SephirothSG just letting you know that Match History Page is still not working. I checked it a few days ago, and it wasn't working. I checked it again today and it was the same.","replies":[]}]}