{"poster":"Digidoxs","date":"2018-11-01T01:30:38.366+0000","title":"Clash. Un acierto para League of Legends.","subforum":"Charlas Generales","up_votes":18,"down_votes":0,"body":"La verdad, que esperaba que Clash sea &quot;mas peor&quot; (As&iacute;, bien mal dicho) pero la verdad, me sorprendio en todos sus aspectos. Fue din&aacute;mico, el sistema para ver los pick&#039;s del enemigo esta excelente, el sistema de bans como en competitivo es una ricura. La verdad, Clash es un acierto para League of Legends. Para los que nos gusta competir con amigos.\r\n El unico feedback &quot;negativo&quot;, al equipo enemigo se le cayo uno por 3 minutos de partida, y no pudimos tirar /pause.","replies":[{"poster":"Agent Edgar Ross","date":"2018-11-01T01:59:14.190+0000","up_votes":7,"down_votes":0,"body":"Yo consegui equipo unos diez minutos antes de todo y la verdad fue hermoso; era el mismo que la primera vez de Clash que no se pudo jugar por los problemas. La experiencia, las partidas, los equipos fue 10/10. La primera partida la perdimos por culpa mia y seguimso adelante con positividad y pudimos ganar la segunda. Riot creo que tiene una mina de oro con este sistema la verdad, es un GRAN soplo de aire fresco","replies":[]},{"poster":"Shadow of Sae ","date":"2018-11-01T02:53:59.975+0000","up_votes":3,"down_votes":0,"body":"Yo estoy muy muy conforme con el clash... Pero sinceramente la hora no me beneficia en nada. A las 8 de la tarde no puedo jugar como ya que me anda a 200 ms o más por que mi Internet es así, ☹️","replies":[]},{"poster":"zOrigenS2","date":"2018-11-01T01:56:28.195+0000","up_votes":3,"down_votes":0,"body":"una pregunta cuantos dias se puede jugar clash solo hoy o mañana tambien?","replies":[{"poster":"Kaset","date":"2018-11-01T01:59:02.649+0000","up_votes":2,"down_votes":0,"body":"Solo era hoy. Recuerda que era solo un día de prueba.","replies":[{"poster":"HarpaX","date":"2018-11-01T18:40:34.187+0000","up_votes":1,"down_votes":0,"body":"El mio tambien murio\n{{sticker:zombie-nunu-bummed}} \nMe lo cagó FNC xd","replies":[]}]}]},{"poster":"LTR Nothing","date":"2018-11-01T01:36:26.922+0000","up_votes":3,"down_votes":0,"body":"Opino de la misma manera, me encantó el nuevo sistema Clash y aunque a muchos les dio errores lo cual es normal ya que esta en Beta por mi parte lo disfrute mucho junto con mi team:)","replies":[]},{"poster":"The God Flen","date":"2018-11-01T19:26:10.525+0000","up_votes":1,"down_votes":0,"body":"Entiendo que hayan deshabilitado el remake y pause por temas de tiempo, ya que son dos partidas seguidas y para la segunda partida tienen que ir emparejando equipos que hayan terminado la primera partida, pero a mi parecer deberian implementar estos dos comandos para la segunda partida ya que es la ultima.","replies":[]},{"poster":"NeLord","date":"2018-11-01T01:51:06.147+0000","up_votes":1,"down_votes":0,"body":"por suerte pude jugar las 2 partida pero la ultima nos toco contra un diamante, siendo platas. decir que tuvieron un jugador con problemas de conexión y casi fue pareja pero el diamante la carreo feo fue muy desnivelante en oro, farm y daño tanto a campeones como objetivos. ahí es cuando perdió la gracia","replies":[]},{"poster":"Nerfeadozx","date":"2018-11-01T01:35:58.751+0000","up_votes":1,"down_votes":0,"body":"muy cierto","replies":[]},{"poster":"MyClowSupport U","date":"2018-11-01T01:35:58.415+0000","up_votes":2,"down_votes":5,"body":"Bueno, yo lo negativo que le veo es que no pude jugar.Ninguno de los 10 participantes logro conectarse por un error de riot y creo que ganaron ellos por minions.","replies":[]}]}