{"poster":"Adrenilyn","date":"2016-11-14T03:25:57.919+0000","title":"OMG, I'm stuck with a Bronze V noob that does't know how to click normal!!!  WHY","subforum":"Gameplay","up_votes":1,"down_votes":6,"body":"Seriously.  I&#039;ve been on many many forums, many many PvP formats and all I hear is you suck this, you suck that.  Like honestly, this is the worst community WW.  People that think there LCS players that aren&#039;t even in Challenger are hilarious to me.  I&#039;m a B5 and PROUD OF IT.  I&#039;ll continue to play ranked to try and improve my rank til I no longer want to play LoL.  Stop acting like your so godlike.  If you are making money off LoL then more power to ya.  I&#039;m proud of LoL players that can do this, but so sick and tired of people who act like there gods of LoL who know nothing of the step up from a lower league to higher one.  These people are ignorant.  Riot change your matchmaking because honestly it&#039;s aggravating with what I have to deal with on a daily basis.  I&#039;m B5.  I&#039;m tired of certain people who think there gods gift to LoL, who aren&#039;t anything in actual Pro play, making my game play miserable.  TY FIX IT","replies":[{"poster":"18 NAKED COWB0YS","date":"2016-11-14T03:27:38.892+0000","up_votes":1,"down_votes":0,"body":"who exactly are you angry at.\n\nlcs players?\nriot?\ngodlike-ego players?\n\nseems like you're just angry at yourself more than anyone else.","replies":[{"poster":"Adrenilyn","date":"2016-11-14T03:59:32.449+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ANJell 1004,realm=NA,application-id=3ErqAdtq,discussion-id=zlj7gzBz,comment-id=0000,timestamp=2016-11-14T03:27:38.892+0000)\n>\n> who exactly are you angry at.\n> \n> lcs players?\n> riot?\n> godlike-ego players?\n> \n> seems like you&#x27;re just angry at yourself more than anyone else.\n\nno not really.  seems like your one of those players who think your god and can carry the world on your shoulders.  Please.","replies":[{"poster":"18 NAKED COWB0YS","date":"2016-11-14T04:02:16.782+0000","up_votes":1,"down_votes":0,"body":"because i play league?\n\nyou got me.","replies":[{"poster":"Adrenilyn","date":"2016-11-14T04:05:30.248+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ANJell 1004,realm=NA,application-id=3ErqAdtq,discussion-id=zlj7gzBz,comment-id=000000000000,timestamp=2016-11-14T04:02:16.782+0000)\n>\n> because i play league?\n> \n> you got me.\n\nIf you where apart of a decent Korean team then maybe, maybe I would respect your comment.  But other then that.  NOPE","replies":[{"poster":"18 NAKED COWB0YS","date":"2016-11-14T05:01:26.246+0000","up_votes":2,"down_votes":0,"body":"so because i play league i think im a god?\n\nshut the fuck up please.","replies":[{"poster":"Adrenilyn","date":"2016-11-15T15:39:32.462+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ANJell 1004,realm=NA,application-id=3ErqAdtq,discussion-id=zlj7gzBz,comment-id=00000000000000000000,timestamp=2016-11-14T05:01:26.246+0000)\n>\n> so because i play league i think im a god?\n> \n> shut the fuck up please.\n\nThe ignorance of the LoL Community.  Honestly, not a Pun but LoL at the ignorance of LoL Community.  Riot get your community right.  This type of player has the flex muscles of being one of those E-Thugs.  Straight Gansta.  \n\nHonestly, why do you want a Bronze 5 player in your Diamond Flex game.  You make my point even more valid.  I should not have to face Diamond if I am bronze to advance.  Regardless of this new way.  Wow, it's like hypocrites fly everywhere around this forum.","replies":[]}]}]}]}]}]},{"poster":"420 grams","date":"2016-11-14T04:19:22.966+0000","up_votes":1,"down_votes":0,"body":"It's a competitive game, so people play for the win, not money or chance to go pro. I play basketball and I don't plan to ever go pro, but that doesn't mean when I do play I want my team mate to pass the ball to the other team. People want to play a competitive fair game, and it's not fun when one player is giving the ball up.","replies":[{"poster":"Adrenilyn","date":"2016-11-14T04:21:37.926+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=yerteenagedream,realm=NA,application-id=3ErqAdtq,discussion-id=zlj7gzBz,comment-id=0008,timestamp=2016-11-14T04:19:22.966+0000)\n>\n> It&#x27;s a competitive game, so people play for the win, not money or chance to go pro. I play basketball and I don&#x27;t plan to ever go pro, but that doesn&#x27;t mean when I do play I want my team mate to pass the ball to the other team. People want to play a competitive fair game, and it&#x27;s not fun when one player is giving the ball up.\n\nseriously, seriously.  you sound just like me but don't wanna admit it.  Come on Now.  I know how to play Basketball and that bs you tried to compare has nothing to do with it.  Come on now\n\nnot trying to be ignornant, but read the first post pls and re-read ur words","replies":[{"poster":"420 grams","date":"2016-11-14T04:30:26.047+0000","up_votes":1,"down_votes":0,"body":"I read it, still don't see how it's irrelevant though. \n\nIt's OK if you can't carry. It's OK that you're improving. But dying once for every like 3 mins tells me that it's not that you're trying to improve or playing to win, but that you're getting mad for whatever reason and keep running in and dying. Yeah, people get mad and are mean. It's not right, but you can't change that. If it really bothers you, mute everyone before you even leave fountain. But when you get mad and throw a game, everyone, most likely including yourself, has a bad time.","replies":[{"poster":"Adrenilyn","date":"2016-11-15T15:46:59.845+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=yerteenagedream,realm=NA,application-id=3ErqAdtq,discussion-id=zlj7gzBz,comment-id=000800000000,timestamp=2016-11-14T04:30:26.047+0000)\n>\n> I read it, still don&#x27;t see how it&#x27;s irrelevant though. \n> \n> It&#x27;s OK if you can&#x27;t carry. It&#x27;s OK that you&#x27;re improving. But dying once for every like 3 mins tells me that it&#x27;s not that you&#x27;re trying to improve or playing to win, but that you&#x27;re getting mad for whatever reason and keep running in and dying. Yeah, people get mad and are mean. It&#x27;s not right, but you can&#x27;t change that. If it really bothers you, mute everyone before you even leave fountain. But when you get mad and throw a game, everyone, most likely including yourself, has a bad time.\n\nRead my lips.  and I wish you could read what I post in games on Ranked.  I never have a bad time.  I always point out when somebody gets the best of me.  I enjoy my time in League.  I enjoy the game.  I don't care if I win or lose as long as I have fun.  To me, this game is all about fun.  In which I have.  But it's not just about me.  It's sad that a Diamond player has to have me on there team.  I suck, Trying to improve...but we all start somewhere.  I play maybe 50-75 games a year.  It's not just me suffering with the Flex thing.  It's the Higher ups.  Why should they lose cause I'm nowhere near there level.  DO YOU NOT UNDERSTAND THE SKILL DIFFERENCE FROM EVEN BRONZE TO SILVER.  And Then so ON.  Say it's 1 Diamond plus 4 bronze vs 3 Diamond and 2 Gold.  Is that fair to that 1 Diamond player.  HELL NO.  And he is sitting there crying and moaning because the rest of us are garbage. GTFO here.  This Flex is the worse implemented type of matchmaking ever.","replies":[{"poster":"The Sword Saint","date":"2016-11-15T16:03:44.370+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Adrenilyn,realm=NA,application-id=3ErqAdtq,discussion-id=zlj7gzBz,comment-id=0008000000000000,timestamp=2016-11-15T15:46:59.845+0000)\n>\n> Read my lips.  and I wish you could read what I post in games on Ranked.  I never have a bad time.  I always point out when somebody gets the best of me.  I enjoy my time in League.  I enjoy the game.  I don&#x27;t care if I win or lose as long as I have fun.  To me, this game is all about fun.  In which I have.  But it&#x27;s not just about me.  It&#x27;s sad that a Diamond player has to have me on there team.  I suck, Trying to improve...but we all start somewhere.  I play maybe 50-75 games a year.  It&#x27;s not just me suffering with the Flex thing.  It&#x27;s the Higher ups.  Why should they lose cause I&#x27;m nowhere near there level.  DO YOU NOT UNDERSTAND THE SKILL DIFFERENCE FROM EVEN BRONZE TO SILVER.  And Then so ON.  Say it&#x27;s 1 Diamond plus 4 bronze vs 3 Diamond and 2 Gold.  Is that fair to that 1 Diamond player.  HELL NO.  And he is sitting there crying and moaning because the rest of us are garbage. GTFO here.  This Flex is the worse implemented type of matchmaking ever.\n\nYou don't seem to understand that the flex queue is a new queue, meaning those ranks you keep mentioning don't matter to the system because it assumes everyone started the season unranked. It doesn't matter if you were bronze or challenger last season, you all start in the same games this season and over the course of a few months it will all shake out and people will be matched up better as they get properly sorted out. When that happens you won't be dealing with 'bronze vs diamond' or anything like that anymore. If you don't like dealing with it in the meantime then just stop playing ranked until people are properly sorted in the new queue.","replies":[]}]}]}]}]},{"poster":"Adrenilyn","date":"2016-11-14T04:07:29.160+0000","up_votes":1,"down_votes":0,"body":"Even the game RIFT has better Match Matching.  and that, that is such a Sad statement.\nsorry Riot.  But it's the truth","replies":[]},{"poster":"Adrenilyn","date":"2016-11-14T04:06:30.666+0000","up_votes":1,"down_votes":0,"body":"TSM I R sorry, you fit in that Korean team category.  Fan Boy for life","replies":[]},{"poster":"Adrenilyn","date":"2016-11-14T04:04:06.805+0000","up_votes":1,"down_votes":0,"body":"But can we agree.  This Flex thing needs changed.  You can't tell me if ur Silver, Gold, Diamond and you get stuck with me as B5 that you are not pissed.  Hard carry isn't what it use to be.  But be for real.","replies":[]},{"poster":"Adrenilyn","date":"2016-11-14T03:52:55.690+0000","up_votes":1,"down_votes":0,"body":"Angry at nobody.  I suck period.  Its report you this, report you that.  blah blah blah.  Flex needs fixed","replies":[{"poster":"BakedLotion","date":"2016-11-14T03:57:07.055+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Adrenilyn,realm=NA,application-id=3ErqAdtq,discussion-id=zlj7gzBz,comment-id=0003,timestamp=2016-11-14T03:52:55.690+0000)\n>\n> Angry at nobody.  I suck period.  Its report you this, report you that.  blah blah blah.  Flex needs fixed\n\nyou're reported","replies":[{"poster":"Adrenilyn","date":"2016-11-14T04:02:09.673+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BakedLotion,realm=NA,application-id=3ErqAdtq,discussion-id=zlj7gzBz,comment-id=00030000,timestamp=2016-11-14T03:57:07.055+0000)\n>\n> you&#x27;re reported\n\nAWESOME","replies":[]}]}]},{"poster":"Adrenilyn","date":"2016-11-14T03:56:06.885+0000","up_votes":1,"down_votes":0,"body":"Magic.  I don't troll, i don't have illusions of grandeur.  I just want to play ranked game where i could possibly rank up and not here the sobbing of people who think there so dang good when thats not the case.  Please watch the differences of Leagues.  Please learn your not as good as you think you are until your challenger.  The skill cap from league to league is different.  THis flex is seriously questioning why Riot allows such ignorance in this game\n\nbtw the please part isnt meant for you magic.  no idea how your skills are.  just refrencing.  ","replies":[]},{"poster":"MagicFlyingLlama","date":"2016-11-14T03:42:53.509+0000","up_votes":1,"down_votes":0,"body":"Sorry, this is what happens in B5. People cant fall any lower, so you get myriad kinds of trash, trolls and kids with massive delusion and ego problems.\n\nI suggest you just play normals games for practice. It will help you improve faster in a less stressful environment and you will be matched with overall better players, and help you get out of the MMR trashpile quickly, when you start playing ranked again.","replies":[]},{"poster":"PirateKingNikki","date":"2016-11-14T03:28:02.657+0000","up_votes":1,"down_votes":0,"body":"Mute them. Focus on improving not what they are saying in chat. 9/10 if they are just flaming they will have nothing important to say anyway.","replies":[]},{"poster":"Adrenilyn","date":"2016-11-14T04:19:28.820+0000","up_votes":1,"down_votes":1,"body":"On the east coast and gotta wake the kids up in the am.   Flex ranking needs changed period.  If I'm gonna join players that qued as 2-3 then it should be Bronze.  Not Gold, Diamond.  Why make their experience hell.  THowing us all in together is dumb.  Yes I get what Riot is trying to do, but your not doing it right.  If there's 3 Diamonds and 2 bronze vs 2 silver and 3 bronze what do u think is gonna happen.  Diamonds are gonna roll over everybody..  And if the bronze players feed then ur gonna get report after report after report.  Get this thing set right.  I shouldn't have to play silver+ in Flex.  It should be Bronze so I can play people on my level.  Honestly doesn't Riot know the HUGE leap from league to league.  It's unreal","replies":[]}]}