{"poster":"PoLac","date":"2016-04-10T15:00:02.924+0000","title":"Dropeos de las llaves","subforum":"Charlas Generales","up_votes":2,"down_votes":12,"body":"Hola buen tardes tengo una opini&oacute;n  Porque el drop de las llaves est&aacute;n bajo  es muy pero muy complicado conseguir llaves yo jugue mas  30 partidas el viernes  y de esas 30 partidas solo me dieron una fragmento de llave Lo veo mal el drop de las llaves igual que de las cajas lo veo muy mal porque una sola caja te tarda 6 d&iacute;as y 20 horas en que te un solo cofre y luego tenes que esperar  los mismo d&iacute;as para que te den una caja   me parece una falta de respeto va eso pienso yo capas que me estoy equivocando Por ejemplo lo que pienso yo es que riot puso mas la artesan&iacute;a para que la comunidad gaste mas en comprar  y los que no tenemos forma de pago con tarjetas o  no le gusta cargar con rapi pago y las dem&aacute;s formas  no me parece bien porque si yo pienso la artesan&iacute;a es algo bueno para los que no puedo cargan rp por X raz&oacute;n  pero tampoco es justo que riot le baje dr&aacute;sticamente el drop de llaves  pero lo mejor que pueden hacer es  que puedas conseguir fragmentos de llaves  y que tengas un limite de poder hacer 3 llaves hasta que se regeneren todos los cofres o algo por el estilo  Esta es mi opini&oacute;n comparta su opini&oacute;n  Gracias por tomarse el tiempo en leer este post","replies":[{"poster":"SweetCandy3","date":"2016-04-10T15:34:01.541+0000","up_votes":3,"down_votes":0,"body":"No entendi nada para la proxima usa comas.","replies":[{"poster":"PoLac","date":"2016-04-10T16:51:37.593+0000","up_votes":1,"down_votes":3,"body":"Lee otra vez  gracias","replies":[]}]},{"poster":"Kyo Hatori","date":"2016-04-10T15:14:34.285+0000","up_votes":3,"down_votes":0,"body":"No se porque te quejas, media vez que puedes conseguir skins sin dinero no pensarás que tiene que ser fácil. La empresa tiene que ganar dinero amigo jaja. \n\nFElices Pesadillas\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"PoLac","date":"2016-04-10T16:43:08.784+0000","up_votes":1,"down_votes":1,"body":"te entiendo lo que me queres decir pero tampoco es la cosa que te lo pongan difícil  ami me importa muy poco los cofres pero es tema es mas por las llaves antes estaba bien el dropeo ahora esta jodido conseguir una solo fragmento de llave","replies":[{"poster":"Kyo Hatori","date":"2016-04-10T17:01:43.850+0000","up_votes":2,"down_votes":0,"body":"Ummm insisto, no entendés el punto. Antes si no recargabas no tendrias nunca skins. Ahora te  dan una posibilidad, aunque baja, de obtenerlas gratis. Tené en cuenta que la empresa no gana nada poniendolo gratis, lo hace de piolas que son. Si encima pusieran que fuera facil de conseguir las llaves, la gente dejaria de comprar skins, la empresa tendria falta de dinero, el servicio se vendria abajo, olvidate de los splash arts, videos, eventos, y juego en general. \n\nOsea, dejate de quejar de que salgan pocos fragmentos y andate a laburar y comprate los rp. \n\nUn saludote ;D","replies":[{"poster":"PoLac","date":"2016-04-10T19:49:51.857+0000","up_votes":1,"down_votes":0,"body":"en primer lugar :en eso tenes razon \nla segunda razón:trabajo\nla tercera :no me interesa comprarme Skin\ny si digo esto porque hay demasiada gente que se recontra queja por el drop de las llaves y no vi ningun post  en el foro  y decidí poner uno","replies":[{"poster":"Kyo Hatori","date":"2016-04-12T19:37:40.807+0000","up_votes":1,"down_votes":0,"body":"Ah ta bien, entonces como me dice mi vieja, si te gusta la pelusa aguantate el durazno . . . . (o era al revés, si te gusta el durazno aguantate la pel . . .) bueno como sea :v","replies":[]}]}]}]},{"poster":"Klozer","date":"2016-04-10T15:18:41.589+0000","up_votes":2,"down_votes":1,"body":"Exactamente pienso lo mismo que vos.. Encima que le regalan skins gratis se quejan... xD.. Compra Rp y solucionado el tema men.. Saludillos","replies":[{"poster":"PoLac","date":"2016-04-10T16:46:45.470+0000","up_votes":1,"down_votes":1,"body":"es fácil decir eso que los padres le dan para recargar RP la cosa es como dije  nose si leiste que hay gente que por X razón no puede cargar Rp  y con este modo nuevo de artesanía puede llegar a tener skin  pero esta muy pero muy bajo el conteo de fragmentos de llaves  aver si me entendes  ahora","replies":[]}]}]},{"poster":"Hellking","date":"2016-04-10T18:06:31.991+0000","up_votes":2,"down_votes":0,"body":"Mira para empezar.... Aprende cosas basicas del legunaje... usa comas y puntos ayudan mucho a la comprensión. \nComo segundo punto queria decirte entiendo que te sientas molesto, pero la empresa simplemente NO puede regalarte cosas, ella tiene que sustentarse mediante algo, tiene que generar ingresos para ellos, al fin y al cabo tienen empleados a los que tienen que pagar y seguramente como todas las empresas una cuota que debe pagar todos los meses, ahora piensa que los fragmentos de llave te los dieran cada partida... cada 4 partidas tendrias para abrir 1 cofre, y mas o menos con 3 cofres te puedes sacar una skin de 975 rp para conseguir esa cantidad de rp en chile son $5.000 pesos, ahora pensemos en lo que pides, quieres que salgan mas cofres por lo que entendi y que el drop de llaves aumente.... , piensa que MUCHA gente juega LOL y que MUCHA gente recarga para comprar skins, imaginate que esa gente no tengas que recargar más porque ahora tiene la artesania que con un poco de suerte le puede tocar una skin bonita, que le guste y que le acomode... ¿ imaginas donde llegaria a parar el juego ? yo creo que si fuera asi como tu lo planteas un poco más tendriamos que pagar por jugar... MI pregunta es la siguente.... ¿ alguien te obliga a comprar skin ?, jugaste quizas dos temporadas sin recargar y yo creo que sin ninguna queja, porque AHORA que riot te da una forma de conseguir una skin/campeon/icono/ward te quejas ?, ¿no te basta con que ya te lo esten regalando? y bueno para el colmo dices que te parece una falta de respeto, perdon amigo tengo que discrepar de tu opinion la encuentro muy equivocada porque al fin y al cabo ''A CABALLO REGALADO NO SE LE MIRAN LOS DIENTES'' \nMuchas gracias por leer :)","replies":[{"poster":"PoLac","date":"2016-04-10T19:45:28.736+0000","up_votes":1,"down_votes":1,"body":"Si mira te entiendo lo que vos me queres decir y esa frase la usa mis  abuelos volviendo al tema ami no me importa las cajas las llaves  me importa poco  los skin y todas esas cosa porque ami  los skin lo me hacen mejor jugador  yo hablo porque veo a mucha personas que se re contra quejan porque el drop de las llaves y creo que tienen razón y lo comprobé porque pregunte a casa a los 20 amigos que tengo del lol y me dicen que el drop de las llaves estas bajas","replies":[{"poster":"Hellking","date":"2016-04-11T19:21:02.007+0000","up_votes":1,"down_votes":0,"body":"Es que es más que OBVIO que tienen que estar bajas, sino tendrias cualquier skin yo tengo 2 cofres guardados que no he podido abrir por eso mismo y loco, de verdad no me estoy quejando ni nada, es más estoy agradecido, porque es GRATIS.el drop de llaves baja esta bien y no deberia cambiarse, la mayoria de la gente piensa igual que yo.","replies":[]}]}]},{"poster":"tomastrack","date":"2016-04-10T16:12:20.844+0000","up_votes":1,"down_votes":0,"body":"peor es nada, a todos ademas nos dieron una skin prácticamente gratis junto con la salida de la artesanía ademas y esto esta pensado para que mientras jugamos y mejoramos en el lol nos den algún tipo de recompensa y como ya dije peor es nada u.u","replies":[{"poster":"PoLac","date":"2016-04-10T16:51:12.727+0000","up_votes":1,"down_votes":1,"body":"Si el ante año pasado te daban un skin si no tenias el pj te daban el pj con la skin cosa creo no  tampoco no estoy desconforme  como dijiste vos    tomastrack: además y esto está pensado para que mientras jugamos y mejoramos en el lol nos den algún tipo de recompensa y como ya dije peor es nada u.u  Si eso es verdad de mejorar pero para tener un fragmento de llave  necesitas  por lo minimo jugar 15 partidas para que te drop un fragmento solo de llave lo ves justo a eso","replies":[]}]}]}