{"poster":"Lucrexio","date":"2015-08-15T02:54:37.631+0000","title":"Porque se le sube la E a Shyvana?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Que tal gente, quiero hacerles una pregunta respecto a Shyvana, y es porque se sube la E luego de la W? porque estuve viendo las descripciones y no encuentro que aumente da&ntilde;o que hace de vida m&aacute;xima como la W de Vi u otros, en cambio si subis la Q por ejemplo si le sube el da&ntilde;o que aplica.\r\nEs por el CD? por el da&ntilde;o m&aacute;gico?\r\n\r\nSaludos y gracias!","replies":[{"poster":"kique1","date":"2015-08-15T05:03:02.421+0000","up_votes":2,"down_votes":0,"body":"Shyvana lanza una bola de fuego que causa 60/100/140/180/220 (+60% Poder de Habilidad) de Daño Mágico a todos los enemigos a los que alcanza, además de debilitarlos durante 5 segundos. Los ataques básicos de Shyvana contra objetivos debilitados infligen un 2.5% de su Vida máxima como Daño Mágico (100 como máximo contra monstruos).\nForma de Dragón: Aliento de Fuego envuelve con llamas a todas las unidades situadas en una zona cónica frente a Shyvana.\n\n\nSe sube porque es más worth que subirse la Q, ya que ésta sólo te aumenta un poco el crítico, en cambio subiéndote la E obtienes mayor daño base de la habilidad y puedes limpiar más rápido.","replies":[]},{"poster":"Nira","date":"2015-08-15T03:32:53.655+0000","up_votes":1,"down_votes":0,"body":"Creo que es porque cuando un enemigo tiene la E marcada el tiempo de W dura mas , aparte creo que cuando tiene la amrca de la E le bajas daño por % de vida . Creo .\n Saludos!","replies":[{"poster":"Tipazo Humilde","date":"2015-08-16T18:49:44.944+0000","up_votes":1,"down_votes":0,"body":"la w no dura más,eso son los básicos los que aumentan la duración","replies":[{"poster":"Nira","date":"2015-08-16T19:09:48.517+0000","up_votes":1,"down_votes":0,"body":"Ahhh, gracias por aclararme la duda men :D","replies":[]}]}]},{"poster":"Tipazo Humilde","date":"2015-08-16T18:51:10.136+0000","up_votes":1,"down_votes":0,"body":"yo soy main shyvana y subo más la w y empiezo con esa habilidad porque en los intercambios vuelas cabezas,yo solo subo la e una vez para marcarlos porque el daño que sube es muy poco comparado con la w y la q tiene muy poco enfriamiento","replies":[]},{"poster":"ZanahoriaAsesina","date":"2015-08-15T03:16:03.206+0000","up_votes":1,"down_votes":0,"body":"Tengo entendido que una Teamfight rinde más la E por el AoE más el Debuff y el daño por % vida máxima.","replies":[{"poster":"Lucrexio","date":"2015-08-15T03:40:55.457+0000","up_votes":1,"down_votes":0,"body":"O tendre bugeado yo, porque siempre que le he subido, el daño de vida máxima era 2% (o 2.5) no me acuerdo bien, en todos los niveles.","replies":[{"poster":"ZanahoriaAsesina","date":"2015-08-15T03:49:17.448+0000","up_votes":1,"down_votes":0,"body":"2.5 creo que era!","replies":[]}]}]},{"poster":"Bienzahar","date":"2015-08-15T03:03:39.589+0000","up_votes":1,"down_votes":0,"body":"porque hace más daño","replies":[]}]}