{"poster":"Nano Saggion","date":"2016-11-29T03:59:10.633+0000","title":"Consultas sobre Emparejamiento","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":0,"body":"Buenas, quer&iacute;a hacer una consulta a quien lea esto. &uacute;ltimamente me esta pasando que me tocan equipos bastante raros, soy un humilde oro 5 y oro 4, as&iacute; que pienso que mis compa&ntilde;eros deber&iacute;an ya tener un par de conceptos sabidos. Por ejemplo en la partida que jugu&eacute; reci&eacute;n yo era top, tire TP a bot, matamos a 2 (estaban el jg y el mid) y el resto corren, nosotros eramos 3 o 4 con bastante vida, incluido el jg. Que se supone que hay que hacer? O dragon o torre... El mid se fue a mid, el jg backeo y yo me qued&eacute; como un nabo pegandole al dragon, obviamente me tuve que ir.\r\n&iquest;Qu&eacute; est&aacute; pasando? &iquest;Por qu&eacute; me tocan estos emparejamientos? Entiendo que no siempre se gana, pero hay ciertas cosas que uno piensa que ya deber&iacute;an pasar y no pasan, al menos en mi equipo, porque en los otros siempre se mueven juntos y cumplen objetivos.\r\n\r\nDesde ya gracias al que lea y conteste, y si tienen ganas agreguen para armar alg&uacute;n team (aunq sea para normales)\r\n\r\nNano","replies":[{"poster":"9081913DEL1","date":"2016-11-29T12:55:35.171+0000","up_votes":2,"down_votes":0,"body":"Cuestion de logica. Para subir al principio bastara con espamear partidas. No hay cosas sabidas. Hay gente que sube jugando solo mid y sin interesarse en el resto de los posibles objetivos del juego, por ejemplo.\n\nEl emparejamiento se basa en las reglas del mmr. No hay metrica real que diga que tal persona sabe x o y o z sobre tal tema por estar o no en una liga.\n\nEl otro equipo, es una cuestion de percepcion, pero ten en cuenta que al menos en las flex, puedes jugar con varias personas, asique es logico que lo hagan. Que tu estes jugando en solitario no significa que el enemigo tambien. En esencia es un juego de equipo.\n\nPor ultimo, la toma de decisiones es un aspecto personal a mejorar. Es lo que define los elos. Que sepas significa que mejorara tu elo en algun momento. El resto tomo decisiones de su elo. Es normal que los oros traten de farmear o volver a base, estan aprendiendo a farmear por un lado y a capitalizar el oro por otro no tienen todavia la nocion tactica. Digamos estan entre jugar bien y saber para que hacen la jugada. Al menos asi lo veo en esa liga.\n\nSaludos.","replies":[{"poster":"Nano Saggion","date":"2016-11-29T17:53:33.741+0000","up_votes":1,"down_votes":0,"body":"Gracias por leer y contestar. Si, es posible que esté pasando algo de eso, también puede ser simplemente una mala racha, que siempre hay. Y también lo más importante, puede ser que simplemente no esté haciendo las cosas tan bien como pensaba, pero bueno, realmente necesitaba contarlo para sacarme un poco la bronca que tenia guardada.\n\nDe nuevo, gracias por leer! Nos vemos!","replies":[]}]}]}