{"poster":"KT Nixh","date":"2016-04-20T19:01:24.558+0000","title":"No pickeen mas a Vayne, sépanlo, no son buenos.","subforum":"Guias y consejos","up_votes":2,"down_votes":17,"body":"No llegan a late, pierden en mid game solo por que pickean a vayne. Vayne merece ser permaban solo para que no juegue en tu team. \n\nEs incre&iacute;ble la cantidad de rankeds que pierdo  por tener una Vayne en mi team, eso que soy platino me imagino en bronza lo que debe ser. \n\nSi hago un porcentaje de las rankeds que perd&iacute; por vayne deben ser el 90%. \n\nUseless Vayne.","replies":[{"poster":"Li Grim","date":"2016-04-20T19:41:35.708+0000","up_votes":8,"down_votes":1,"body":"¿Qué haría una persona normal?:\n\n-Veo muchas Vayne aliadas que tienen problemas en mi equipo, me concentraré en ayudarlas, si soy jungla hago una carpa en bot, si soy mid, pushearé la linea para hacer roaming, si soy top, me pongo tp y le digo al supp que ponga un ward en el bush más lejano de nuestra torre, y si juego supp, le diré que juguemos defensivos y que farmee bajo torre mientras yo le ayudo y le protejo del pockeo enemigo y le golpeo los minions par que ella de el last hit.\n\n\nTÚ: Me quejaré en foro, haré un crypost pensando que eso solucionará mi situación.","replies":[]},{"poster":"Main Troll","date":"2016-04-20T19:16:52.447+0000","up_votes":6,"down_votes":0,"body":"en parte tenes razon, pero q hiciste vos para ganar la partida? ya se!! quejarte en los foros de tener una vayne en tu team!!!!\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"KT Nixh","date":"2016-04-20T21:03:07.359+0000","up_votes":1,"down_votes":8,"body":"Jajaja!! . Decime algo que me sirva no excusas fáciles, mira mi historial. Bye, pegá esa respuesta en otro tema.","replies":[{"poster":"Main Troll","date":"2016-04-20T22:39:07.386+0000","up_votes":3,"down_votes":0,"body":"no lo habia visto... y ahora q lo veo entiendo todo, vas solo jg, no podes criticar un campeon o una posicion si solamente t la pasas jugando d jg :S","replies":[]}]}]},{"poster":"SnowHorse","date":"2016-04-20T20:31:22.856+0000","up_votes":4,"down_votes":0,"body":"la orgullosa bronza de corazón que logro salir de bronce sabe que se tiene que carrear sola y no contar con los demás (si te ayudan, mejor)\n\nvayne es un hipercarry, no sera que le están haciendo exceso de foco y no la cubren? \n\ntambién pensa que en algun momento como uno deja de jugar con bots para jugar con gente uno tambien tiene que dejar las normales y jugar ranked para seguir mejorando con un champ\n\nno se puede ganar todas las partidas, la diferencia real la haces haciendo ese \"extra\" que de deja dar vuelta una partida que viene medio mal parida... todos ganamos isi cuando nos toca un equipazo y perdemos cuando todas las lineas van 0/8/0 en el minuto 10\n\nte mire partidas, en general no te va mal\ncuando jugas de sup no compras muchos items de sup, no vi un {{item:3050}} , no vi un {{item:3222}} \n\ntambién te vi que jugas mucho tank, es uno de lo problemas del rol que te gusta, vas a prestar mucha atención a los dps porque por mas bien que jugues si tus dps no pegan estas medianamente limitado\n\n\nyo cuando jugaba ranked por ejemplo era bueno en top con malphite, pero al final para empezar a subir de división empece a jugar dps en mid y top, y realmente con menos habilidad y peor manejo de champ obtube mejores resultados","replies":[]},{"poster":"BOT Yásuo","date":"2016-04-20T20:14:31.645+0000","up_votes":2,"down_votes":0,"body":"Pero pero...\n\nGosu senpai...\n\n\n\nLmao, en serio, es fácil jugar con Vayne, tenes que protegerla y no tiene que hacerse el Rekkles el chabón, si no intentas hacer plays y lo jugas como un adc normal es de o mejor que hay.","replies":[]},{"poster":"TheFalc","date":"2016-04-20T19:36:23.042+0000","up_votes":2,"down_votes":0,"body":"a menos que en serio sean buneos, soy main support y a veces juego con compañeros mios que la mayoria son main adc, y cuando usan a vayne me hacen feliz el dia","replies":[]},{"poster":"PornStar Vi","date":"2016-04-20T19:15:20.794+0000","up_votes":2,"down_votes":0,"body":"Yo soy bronza y te digo que no hay nada mejor que jugar ADC y que te toque contra una Vayne, es casi linea ganada","replies":[]},{"poster":"BUSCANDO A JORGE","date":"2016-04-20T19:46:04.722+0000","up_votes":2,"down_votes":1,"body":"No consideres porque sos platino iv sos platino, eso todavia es oro.","replies":[]},{"poster":"Avarøsan","date":"2016-05-09T17:33:56.959+0000","up_votes":1,"down_votes":0,"body":"Amigo, pase lo que pase, no hagas post de ese modo, vos debes hacer algo en la partida que marque la diferencia, y sino te gustan las vaynes de este server, pásate a otros servers como NA pero posiblemente si lo haces, digas que es imposible jugar contra un vayne porque juega increíble, no digo que sea tu culpa, pero si yo dodgeara siempre que me toca una vayne en bronce por lo menos lo haria cada 1 mes, no se de que te quejas, también te aviso, que UNA sola vayne lo haya hecho en una partida porque el enemigo de ella le ganaba, no significa que TODAS las vaynes lo hagan, tenlo en cuenta maquinola. -1.","replies":[]},{"poster":"rokushoger","date":"2016-04-21T11:24:06.663+0000","up_votes":1,"down_votes":0,"body":"Para para, pusieron un requerimiento ahora que para elegir un champ tenés que ser bueno con él? Donde está eso en los terminos de uso? Aparece en algún reglamente o estatuto?","replies":[]},{"poster":"Silver000","date":"2016-04-21T01:12:17.968+0000","up_votes":1,"down_votes":0,"body":"un ardido","replies":[]},{"poster":"Neoburstx","date":"2016-04-20T20:23:54.910+0000","up_votes":2,"down_votes":2,"body":"baneala{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Nutria Deliciosa","date":"2016-04-20T19:45:53.834+0000","up_votes":1,"down_votes":1,"body":"Y tenes razon","replies":[]}]}