{"poster":"KT Nixh","date":"2016-05-16T21:38:51.238+0000","title":"¿Por que banean a vayne ?(Platino)","subforum":"Charlas Generales","up_votes":12,"down_votes":7,"body":"Digo, por que aveces veo que banean a  Vayne y nose por que . Yo banear&iacute;a a Vayne &uacute;nicamente para no tenerla en mi team.\n\nCasualmente es un champ que nunca quiero en mi team, y  vengo de perder, por eso vengo  a desquitarme al foro para que les de un poquito de bronca a todos los Gosus, FanBoys de Vayne en LAS.\n\nt&iacute;pica Vayne:\n\n* Por mas que lo jueguen horrible lo siguen jugando.\n* con Winrate menor al 50% la mayor&iacute;a.\n* Sin ayudar en objetivos por estar afk farm en bot por que el 80% de las partidas pierden la linea y mueren en early.\n* fameo 30 minutos bot, primera TF con el team le ponen 1 pink y muere primero.\n\nEst&aacute; a la altura de Riven y Yasuo como vende-partidas. \n\n47% de win rate el 3 peor ADC del meta.\n\npor un LOL sin vayne {{champion:17}}","replies":[{"poster":"Hwaxinghz","date":"2016-05-17T00:04:44.522+0000","up_votes":9,"down_votes":0,"body":"Se banea por una razón tan simple que la resumiré en 2 objetos:\n\n{{item:3124}} {{item:3153}} ==Insta GG","replies":[{"poster":"LastHope17","date":"2016-05-17T02:55:13.565+0000","up_votes":6,"down_votes":0,"body":"+1 cabezasos al teclado! \nBetter nerf Irelia","replies":[]},{"poster":"Ode to dark","date":"2016-05-17T01:28:03.841+0000","up_votes":1,"down_votes":0,"body":"Agree.","replies":[]}]},{"poster":"LGBT Valentina","date":"2016-05-17T00:06:58.252+0000","up_votes":4,"down_votes":0,"body":"Nunca te bases en el win rate del champ para hablar, en muy pocos caso se puede hacer\nVayne, es justamente uno de los que el win rate no tiene nada que ver\n\nSimple: Fanboy y en si, es un pick BASTANTE fuerte por el guinso (que termino siendo mejor en los adc, que en los mele con el cambio), no llega al nivel de lucian, pero es un pick fuerte\n\n\nCausas del ban realmente, es que el 70% de las vayne ni saben kitear con la Q y se banea por miedo que te caiga esa en tu team, es como el zed. Lo baneas por miedo por que te cae el malo, mismo con lee-ahri-fizzm etc","replies":[]},{"poster":"Dildo de Moria","date":"2016-05-16T23:01:27.876+0000","up_votes":3,"down_votes":0,"body":"Debe ser porque es una campeona popular y cansa verla siempre, me entendes? Por ejemplo, en mi caso SIEMPRE voy a banear a Zed me da igual que esté con 20% de win rate, siempre lo voy a banear porque me pudrió verlo en todas las partidas, si no está en el equipo contrario está en el tuyo hasta de soporte, sinceramente cansa.","replies":[]},{"poster":"TraitusFS","date":"2016-05-16T21:50:47.277+0000","up_votes":3,"down_votes":0,"body":"Buenas, Soy main ADC, Diamante 5 actualmente y yo te diría que el ban Vayne no es taaan malo... (quiero aclarar que no es un champ que use frecuentemente)\nCon solo llegar a late ya puede carrear... Y es mejor sacarte ese prejuicio de \"si mainea tal champ es de esta forma\" porque no te ayuda en nada...\nDe todas formas no creo que sea un ban prioritario, menos ahora que hay tantos campeones OP... pero si banear Vayne deja \"tranquilos\" a tus compañeros, eso vale la pena.","replies":[]},{"poster":"Jota312","date":"2016-05-16T21:48:57.827+0000","up_votes":3,"down_votes":0,"body":"Por que es un pick popular , por que al llegar a late tiene un daño exagerado.","replies":[]},{"poster":"JustoxGames","date":"2016-05-17T10:58:52.717+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Messhaco10,realm=LAS,application-id=v7qsfXsE,discussion-id=6VsL7qsH,comment-id=,timestamp=2016-05-16T21:38:51.238+0000)\n>\n> Digo, por que aveces veo que banean a  Vayne y nose por que . Yo banear&amp;iacute;a a Vayne &amp;uacute;nicamente para no tenerla en mi team.\n> \n> Casualmente es un champ que nunca quiero en mi team, y  vengo de perder, por eso vengo  a desquitarme al foro para que les de un poquito de bronca a todos los Gosus, FanBoys de Vayne en LAS.\n> \n> t&amp;iacute;pica Vayne:\n> \n> * Por mas que lo jueguen horrible lo siguen jugando.\n> * con Winrate menor al 50% la mayor&amp;iacute;a.\n> * Sin ayudar en objetivos por estar afk farm en bot por que el 80% de las partidas pierden la linea y mueren en early.\n> * fameo 30 minutos bot, primera TF con el team le ponen 1 pink y muere primero.\n> \n> Est&amp;aacute; a la altura de Riven y Yasuo como vende-partidas. \n> \n> 47% de win rate el 3 peor ADC del meta.\n> \n> por un LOL sin vayne {{champion:17}}\n\n\n-\"Por mas que lo jueguen horrible lo siguen jugando\"                                                                                  Eso no creo que pase.\n-\"con Winrate menor al 50% la mayoría.\"                                                                                                  Hay campeones Con Peores Winrates.\n\"Sin ayudar en objetivos por estar afk farm en bot por que el 80% de las partidas pierden la linea y -mueren en early\" \nCreo que tienes mucha mala suerte con el matchmaking. \n Las vayne que me tocan a mi Carrean.","replies":[{"poster":"TeamSayori","date":"2016-05-18T05:09:10.993+0000","up_votes":1,"down_votes":0,"body":"Sobre el primer punto que dice \"por mas que la jueguen horrible la siguen jugando\" es bastante cierto... y no es algo unico de vayne XD","replies":[]}]},{"poster":"MrAres","date":"2016-05-17T02:13:52.804+0000","up_votes":1,"down_votes":0,"body":"Cual es el peor adc del meta?","replies":[{"poster":"Hexplosivo","date":"2016-05-17T03:10:09.026+0000","up_votes":1,"down_votes":0,"body":"Nunca va más lejos de Urgot, Corki, Twitch, Tristana... y Vayne está por ahí también, como dice el OP.","replies":[{"poster":"Branacar","date":"2016-05-17T16:06:34.324+0000","up_votes":1,"down_votes":0,"body":"Corki, Twitch y Tristana son picks fuertes, aunque no tanto como Lucian. El peor adc del meta actual es miss fortune, no es un pick débil, pero entre los ADC es el que menos se adapta al meta. (Sin contar Urgot que no es tan ADC que digamos)","replies":[{"poster":"TeamSayori","date":"2016-05-18T05:03:58.445+0000","up_votes":1,"down_votes":0,"body":"Sirvir, kog, ashe y jinx estan por ahi\nMiss esta ahi nomas, con 50% y bajando, el peor es kalista 45% justo debajo de urgot","replies":[]}]}]},{"poster":"Hexplosivo","date":"2016-05-17T03:10:33.197+0000","up_votes":1,"down_votes":0,"body":"Nunca va más lejos de Urgot, Corki, Twitch, Tristana... y Vayne está por ahí también, como dice el OP.","replies":[]}]},{"poster":"Chela Lover","date":"2016-05-17T10:48:38.754+0000","up_votes":1,"down_votes":0,"body":"Me vengo haciendo la misma pregunta desde hace rato, la verdad yo tampoco lo entiendo. Mucha gente justifica el ban por su late, pero son pocas las partidas que se definen en late. Además es muy mala en fase de lineas, se le puede hacer mucho bullying y dejarla atras facilmente.","replies":[]},{"poster":"eyzttEN","date":"2016-05-17T10:16:07.941+0000","up_votes":1,"down_votes":0,"body":"Estoy en platino y no la baneo, es más! Casi siempre me toca contra vaynes y mis adc siempre ganan bot xD. Y ni pegan en late (pickeo siempre diana) con 1 rylai ya Vayne no sirve jaja.","replies":[]},{"poster":"Lygnus dwarf","date":"2016-05-17T03:39:22.828+0000","up_votes":1,"down_votes":0,"body":"Yo odio a lee sin, cuando le ago permaban se enojan :v","replies":[]},{"poster":"VodDoo","date":"2016-05-17T02:32:52.349+0000","up_votes":1,"down_votes":0,"body":"Me dieron ganas de jugarlo, fue mi primer main y ahora la tengo olvidada.","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-05-16T23:17:33.240+0000","up_votes":1,"down_votes":0,"body":"Es más marcado con algunos campeones, como lee o shaco, para mi solo son utiles los primeros 13 min de jugo, luego estorban.","replies":[{"poster":"Ode to dark","date":"2016-05-17T01:28:26.533+0000","up_votes":1,"down_votes":0,"body":"Nunca has jugado varias partidas con Shaco cierto? xd","replies":[{"poster":"Hnk Kenshiro","date":"2016-05-17T01:45:12.502+0000","up_votes":1,"down_votes":0,"body":"La verdad era para molestar un poco al creador del post, pero no funciono :p\nPrefiero un shaco que un lee si sabe usar su invisibilidad, aunque los he estado viendo poquito.","replies":[{"poster":"Ode to dark","date":"2016-05-17T02:02:46.281+0000","up_votes":1,"down_votes":0,"body":"De esos soy yo :D\nAunque debo practicar un poquito porque volví luego de un tiempo sin jugar y estoy manqueando un poco xD\nPero sigo teniendo ciertas mecánicas cortesía de Shaclone y Pinkward :D","replies":[]}]}]}]},{"poster":"Manu Carba","date":"2016-05-17T00:47:27.395+0000","up_votes":1,"down_votes":0,"body":"Si no la usa un tipico bronce V manco, Vayne tiene un DPS increible en late. En cuestiones de segundos si no la tocas, te borra a cualquier tanque.","replies":[]},{"poster":"Tsuyeon","date":"2016-05-16T23:31:21.923+0000","up_votes":1,"down_votes":0,"body":"el 15%(quiza menos) de los vayne players son muy buenos y ganan instantaneamente las partidas, por lo que se banea por las dudas q te toque en contra uno de esos buenos jugadores de vayne y tambien se banea para que ese 85% q juegan a vayne por ser ratitas de gosu no toque en tu team y te cague la partida.","replies":[]},{"poster":"StormKiller","date":"2016-05-16T22:55:39.793+0000","up_votes":1,"down_votes":0,"body":"Mira en varias palabras que mencionaste estas en lo cierto pero recuerda que siempre estan los que juegan bien con un campeon y otros que no. \nMi punto es que no todos los problemas son por vayne si no por otro campeon que no hayas mencionado.\n\nY a mi parecer no entiendo porque siguen habiendo vayne tan malas en division como platino. \nVayne es un campeon que carrea muy facilmente con farm vayas 0/7 teniendo 300 farm min 30 (Lo necesario de ADC Platino) Ya estaras mucho mas armado y fedeado por lo tanto debes tomar en cuenta que una kill vale 14 de farm - Minions especificamente. \n\nAsi que no tomes como desventaja tener una vayne en tu equipo si no como cualquier campeon mas. Me despido invocadores! {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"AÐC IN 2K17","date":"2016-05-16T22:43:20.200+0000","up_votes":1,"down_votes":0,"body":"Vayne esta el top 3 de ADC con menor winrate, pero no significa que no sea eficaz en manos medianamente decentes. Todo depende de la composicion enemiga y la del equipo en el que juege esa vayne tambien. Si se pickea en una buena comp, es un hypercarry increible, anti tanks y mejor 1v1 de carry's, si tenes una buena vayne en tu team, la peeleas y es gg","replies":[]},{"poster":"Main Sandwichs","date":"2016-05-16T22:33:31.933+0000","up_votes":1,"down_votes":0,"body":"no haz visto a una vayne con la nueva guinsoo.... ahora puede darte la pasiva con 2 basicos de enves de 3... a un tank lo castras de una.... vayne es una perfecta adc anti tank si la armas rapido con velocidad de ataque e items de daño gracias a su pasiva de la W.... los demas necesitan armarse penetracion de armadura para darles tanto como ella... xD aunque prefiero un twitch xD","replies":[]},{"poster":"Hellcore","date":"2016-05-16T21:54:57.521+0000","up_votes":1,"down_votes":0,"body":"uuuff bien jugada revienta a cualquiera la vayne... cuantas vaynes decentes hay ? ni idea poquisimas...\nEse daño verdadero sirve monton cuando te salen tankes duros como Voli mundo garen etc...\nrequiere mucha practica.","replies":[]},{"poster":"killed101","date":"2016-05-16T21:44:01.245+0000","up_votes":1,"down_votes":0,"body":"En ligas bajas recomiendo banearla por los puntos que pusiste pero en elos altos las vaynes ya son bastantes decentes","replies":[]},{"poster":"Guilson","date":"2016-05-17T16:17:00.507+0000","up_votes":1,"down_votes":1,"body":"Yo lo uso porque me gusta usarla, igual si no sé usarla, me vas a prohibir por eso? (No me refiero a banearla, me explico no?)","replies":[]},{"poster":"Yitán","date":"2016-05-17T05:44:25.665+0000","up_votes":1,"down_votes":1,"body":"creo que se banea por estar en solo QQ, ya que es el adc con mayor destaque en el 1 vs 1 y en jugadas individuales, la veria inutil en un team premade, pero en solo QQ es lo mejor para carrear solo","replies":[]},{"poster":"BUSCANDO A JORGE","date":"2016-05-16T22:14:45.384+0000","up_votes":2,"down_votes":4,"body":"No sabia que platino v contaba como platino, pense que contaba como oro todavia.","replies":[]}]}