{"poster":"Eternal791","date":"2017-03-10T20:37:53.985+0000","title":"Who's the real monster? Urgot or Warwick?","subforum":"Story, Art, & Sound","up_votes":3,"down_votes":0,"body":"Urgot and Warwick. Both these champions struggle with retaining their humanity, but which one has become the real monster?\r\n\r\nWarwick was transformed into an animal who is always angry and goes into a murder frenzy whenever he smells blood or gets hurt. However, he tries to mainly hunt criminals, showing at least some humanity via a wish to not harm the innocent. On the other hand, he has no control over who he kills once he goes into a blood frenzy. \r\n\r\nUrgot is the mind killer. He&#039;s ugly, horrifying and mentally twisted. He&#039;s a mishmash of dead flesh and machine; visually, he&#039;s the stuff of nightmares. Every moment of his undeath is excruciating and filled with hate for everyone and everything. The only thing that drives him is revenge. He doesn&#039;t kill because he finds it fun or cause he needs to, but because he&#039;s angry at the world.","replies":[{"poster":"Ebonmaw Dragon","date":"2017-03-10T20:40:57.882+0000","up_votes":4,"down_votes":0,"body":"Singed is the real monster.","replies":[{"poster":"Eternal791","date":"2017-03-10T20:51:22.187+0000","up_votes":1,"down_votes":0,"body":"True. I wonder if he'll be the one who helped create Urgot's body instead of Stanwick Piddly.","replies":[{"poster":"Grimm Howl","date":"2017-03-10T21:56:24.392+0000","up_votes":1,"down_votes":0,"body":"I think Singed is more into the chemical aspect of Zaun science. He did forge Warwick's claws and pumps because he's more focused on the use of chemtech. From what we've seen of Urgot's leaked model, he doesn't seem to be full of tubes, except for the possible respirator on his mouth. \nAs much as Viktor is for the advancement and glorious evolution, he may have a hand in Urgot's mechanical legs. As to why Viktor might attach/replace his arm with a belted machine gun/grenade launcher is yet to be seen. \nStanwick could still be in Zaun, and responsible also. I can't recall if he's been mentioned in the updated lore yet. \n\nThen again, Urgot could be completely changed lore wise to being born/raised in Zaun instead of a Noxian corpse delivered to Zaun. That way, Urgot and his augmentations make him a possible candidate as a Chem Baron, running the Zaun underground, etc.","replies":[{"poster":"Eternal791","date":"2017-03-10T22:09:18.847+0000","up_votes":1,"down_votes":0,"body":"Piddly is mentioned in Victor's new lore but I though he was from Piltover now. \n\nAs for him being born and raised in Zaun, I personally hope not. I like him as a Noxian. However I am fine with the possibilty that Zaun, being allied with Noxus, gave him the role of chem baron to allow him to keep a close eye on the infiltration of Piltover. Though honestly, as long as they keep his appearance and personality scary as all hell, I'll be fine with whatever they do with his lore.","replies":[{"poster":"Grimm Howl","date":"2017-03-10T22:25:41.613+0000","up_votes":1,"down_votes":0,"body":"He was? Damn, how'd I miss that. Maybe I read to many of the lore stories in one day when they all came out, haha. \n\nI don't play Urgot much, I never got attached to him. I like the scary monstrosity vibe he has though. I just never liked his kit and mixed identity. His passive says Zaun, his E says Noxian. His appearance always looked more Zaun than Noxus, but of course that was after he was a resurrected corpse. \nLore wise, I'd like him to feel different from Sion. Sion was a great military soldier who could decimate armies. So was Urgot, but Urgot's body wasn't as durable as Sion's. \n\nUrgot eventually gets cleaved in two, and his body wasn't in good enough shape for necromancy to have any affect on. His remains are picked up by Stanwick, and BAM! The horror that is Urgot. \n\nSion is resurrected through a sort of blood ritual that Vladmir and the Order of the Black Rose perform on his tomb. So that would be two war heros of Noxus brought back from the dead (Through through somewhat different means) IF Urgot manages to retain that bit of his lore. \n\nThat's the only reason I'd like Urgot to have one specific home or another. Noxus isn't technologically advanced enough to have such  mech spider legs, machine guns, and grenade launchers. With how Zaun and Piltover are now both two halves of a whole city-state, with Piltover stacked on top of Zaun. I don't see how Noxus would manage to get Urgot into Zaun to begin with. I'm confident in the fact that Noxus probably has spies everywhere in the different territories of Valoran, but still you'd need to get Urgot's hulking mess into Piltover first. Something that Noxus hasn't managed to do yet.","replies":[{"poster":"Eternal791","date":"2017-03-10T22:49:03.694+0000","up_votes":1,"down_votes":0,"body":"I'm sure there's other ways into Zaun than through Piltover. They're probably more dangerous ways (given the cliffs and chemicals in Zaun) but still ways in. While it wouldn't solve him getting in as Noxian/Zuan chem baron, maybe someone from Zaun went to Noxus to make him a new body. \n\nI honestly think he could stay undead and Noxian and still feel different than Sion, depending on how they execute it. Though right now, Sion was a front line soldier and was brought back as a front line soldier, while Urgot was a front line soldier and was brought back as more of a tank/back line artillery guy than a soldier. \n\nAnyway, I just find having split origins to be more interesting and unique than being only from one place or another. While he could surely be cool either way, most champions in the game were born and raised in the place they're aligned with. As far as I'm aware, some of the Shadow Isles champions are the only ones who are from one place originally but are aligned with another. But yeah, his current execution of his mixed identity isn't very good, but I think it can be if they go that route with the rework.","replies":[{"poster":"Grimm Howl","date":"2017-03-11T01:08:03.812+0000","up_votes":1,"down_votes":0,"body":"Yeah, I get it. I look forward to what is to come. The next new champion will be released before Urgot's VGU, so we have quite a bit in the future.","replies":[]}]}]}]},{"poster":"Oleandervine","date":"2017-03-10T23:02:59.405+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Howling Carnage,realm=NA,application-id=6kFXY1kR,discussion-id=ZvWoeyyP,comment-id=000000000000,timestamp=2017-03-10T21:56:24.392+0000)\n>\n> I think Singed is more into the chemical aspect of Zaun science. He did forge Warwick&#x27;s claws and pumps because he&#x27;s more focused on the use of chemtech. From what we&#x27;ve seen of Urgot&#x27;s leaked model, he doesn&#x27;t seem to be full of tubes, except for the possible respirator on his mouth. \n> As much as Viktor is for the advancement and glorious evolution, he may have a hand in Urgot&#x27;s mechanical legs. As to why Viktor might attach/replace his arm with a belted machine gun/grenade launcher is yet to be seen. \n> Stanwick could still be in Zaun, and responsible also. I can&#x27;t recall if he&#x27;s been mentioned in the updated lore yet. \n> \n> Then again, Urgot could be completely changed lore wise to being born/raised in Zaun instead of a Noxian corpse delivered to Zaun. That way, Urgot and his augmentations make him a possible candidate as a Chem Baron, running the Zaun underground, etc.\n\nThat is a fan theory and hope, and most likely not ever going to be cannon. Urgot is, and always will be Noxian, it is core to his being. \n\nHowever, he can still be the product of Zaunian engineering, as Noxus wouldn't be above employing reckless science to preserve the life of one of their greatest. If you consider that Singed may have a larger part in the creation of Urgot as an abomination for Noxus, it makes total sense as to why he, against all sound logic, didn't get a lore update in the Piltover/Zaun event. Such a perceived oversight at that time was bizarre and strange, especially considering how integrated Singed was in Warwick's new lore. But if you can see the possibility of his involvement with Urgot's creation, you can understand that they would want to delay his lore for Urgot's re-release.\n\nWhat the Warwick lore teasers and stories with Singed set up, however, was Singed's propensity for engaging in heavy body augmentation through technology and his elixirs. If you consider how Warwick looks now, with a metal limb and a chemical pump in his back, it brings to mind the way Urgot looks, which can further push Singed towards being the Zaunian who engineered Urgot. I would dare say that even further correlation to Singed's involvement with Urgot is also the fact that Warwick's design team leaked and eventually quickly announced that Urgot was their next champion. ","replies":[{"poster":"Grimm Howl","date":"2017-03-11T00:51:08.841+0000","up_votes":1,"down_votes":0,"body":"Could you clearify what you were specificng as a fan theory? From what I wrote, Viktor being involved in Urgot's creation, to Urgot being a Zaunite in his rework was all fan theory.\nThe only thing that's cannon really is that Singed works with Chemtech. He crafted that mechanical skeleton to replace the arm that fell off of Warwick because WW's regenerative abilities allowed it to be used as a blueprint for his tissues to regrow over it. The pumps in WW's back were used to inject his body with the chemicals needed to transform him from Man into Beast. \n\nI'd validate delaying Singed for the Urgot relaunch if he had been the only one, Twitch was delayed too though. In Viktor's lore he augments people in hopes of saving their lives, for the Glorious Evolution, and from what we've seen of his creations. His designs look more similar to how the Urgot's model legs looked.","replies":[]},{"poster":"Eternal791","date":"2017-03-10T23:11:54.535+0000","up_votes":1,"down_votes":0,"body":"I didn't even think about the possibility of Singed getting his lore update with Urgot's rework. But if he is responsible for making Urgot's new body, it makes perfect sense. Another thing is that Warwick died when Singed transformed him. Maybe Urgot's resurrection won't even be related to necromancy like Sion's, but purely from chemtech.","replies":[{"poster":"Oleandervine","date":"2017-03-10T23:17:55.688+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Eternal791,realm=NA,application-id=6kFXY1kR,discussion-id=ZvWoeyyP,comment-id=00000000000000020000,timestamp=2017-03-10T23:11:54.535+0000)\n>\n> I didn&#x27;t even think about the possibility of Singed getting his lore update with Urgot&#x27;s rework. But if he is responsible for making Urgot&#x27;s new body, it makes perfect sense. Another thing is that Warwick died when Singed transformed him. Maybe Urgot&#x27;s resurrection won&#x27;t even be related to necromancy like Sion&#x27;s, but purely from chemtech.\n\nUrgot may also not necessarily be dead in his update when he's brought to Zaun. He could be gravely ill, or just generally at death's door.","replies":[{"poster":"Eternal791","date":"2017-03-11T00:34:31.211+0000","up_votes":1,"down_votes":0,"body":"True and I have thought of that. While I really like my undead, I would be fine with him being augmented to survive an illness or severe injury. As long as he's horrifying and badass I'm fine.","replies":[]}]}]}]},{"poster":"Ebonmaw Dragon","date":"2017-03-10T22:14:23.823+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Howling Carnage,realm=NA,application-id=6kFXY1kR,discussion-id=ZvWoeyyP,comment-id=000000000000,timestamp=2017-03-10T21:56:24.392+0000)\n>\n> Stanwick could still be in Zaun, and responsible also. I can&#x27;t recall if he&#x27;s been mentioned in the updated lore yet. \n\nHe was mentioned in the lore of Viktor","replies":[{"poster":"Grimm Howl","date":"2017-03-10T22:30:56.487+0000","up_votes":1,"down_votes":0,"body":"I realized that now. I went back to skim for his name. My bad, it slipped my memory. QQ","replies":[]}]}]}]}]},{"poster":"Golden Tager X","date":"2017-03-11T04:00:56.611+0000","up_votes":1,"down_votes":0,"body":"{{champion:45}}","replies":[{"poster":"Eternal791","date":"2017-03-11T06:49:52.726+0000","up_votes":1,"down_votes":0,"body":"I don't know. I don't think Veigar even compares to Urgot. Sure he's evil and monstrous but in a laughable way really.","replies":[]}]},{"poster":"reaperteaser","date":"2017-03-10T22:30:11.734+0000","up_votes":1,"down_votes":0,"body":"obligatory {{champion:17}} post","replies":[{"poster":"Eternal791","date":"2017-03-10T22:55:24.229+0000","up_votes":1,"down_votes":0,"body":"I hate Teemo so much. He is the only true monster in League.","replies":[]}]}]}