{"poster":"GamerLegendDawn","date":"2015-08-06T11:50:40.421+0000","title":"Arcade Riven","subforum":"Concepts & Creations","up_votes":8,"down_votes":0,"body":"I for one am glad they made an arcade riven skin. But what I don&#039;t like is that the splash is shared with blitzcrank. If a skin is going to be 1350 they should have there own splash. Ex. Dragonblade Riven. Also I think the design of the skin could&#039;ve been a bit better. Overall its a great skin tho. Waited a long time for it.","replies":[{"poster":"moonstones","date":"2015-08-06T16:23:57.250+0000","up_votes":7,"down_votes":3,"body":"Hey GamerLegendDawn,\n\nEach splash is a case by case basis, and for Battle Boss Blitzcrank and Arcade Riven, we felt that a good composition for their splash would be to pit them against each other in some kind of fighting game. \n\nWe did something similar with the Pool Party skins - not because we were 'lazy', but rather, we felt these skins works well in a group setting, and we could give each champion a bit more personality, rather than a stagnant pose.","replies":[{"poster":"FirexSaber","date":"2015-08-06T16:35:33.374+0000","up_votes":5,"down_votes":0,"body":"Just curious if you've seen the feedback suggesting that you add a VS between the two like how they have in fighting games and if you're considering it. \nSomeone made this, for instance: http://a.disquscdn.com/uploads/mediaembed/images/2354/8196/original.jpg\n\nJust a little thing thematically that would fit- although I could understand if you think it would cover too much of the character art- the characters are really well done in this splash.","replies":[{"poster":"moonstones","date":"2015-08-06T17:05:01.585+0000","up_votes":6,"down_votes":0,"body":"I have! \n\nI'm still in the process of collecting feedback to relay to the team, but it's on the list! :]","replies":[{"poster":"Arkantasa","date":"2015-08-07T15:28:40.536+0000","up_votes":1,"down_votes":0,"body":"Change Riven's face? Pretty please? (eyes & nose)\nAlso blitzcrank's model colors (not the vfx) are a bit... boring :/ but that's just me. still getting both of these anyway but yeah.","replies":[]},{"poster":"Dr Birdie","date":"2015-08-06T21:03:17.833+0000","up_votes":1,"down_votes":0,"body":"I think that would be a really great idea.\n\nPersonally, I had no idea they were facing off, until someone pointed it out to me. I thought they were on the same side, rushing the same enemy.\n\nHowever, I think the art work itself is rather beautiful regardless. \n\nOn a side note. The way Riven has that helmet visor and ponytail, really reminds me of Onion Knight, the protagonist of Final Fantasy 3, as he is portrayed in Disidia. Is this an intentional nod or just by coincidence. [Link to a picture](http://img3.wikia.nocookie.net/__cb20101219074028/finalfantasy/images/5/56/Dissidia_OnionKnight.png)\n\nP.S. Third time writing this comment. Kept accidentally closing the tab when trying to link the pic. :(","replies":[]}]},{"poster":"Seyunx","date":"2015-08-06T17:10:01.964+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FirexSaber,realm=NA,application-id=A8FQeEA8,discussion-id=NUcVXEMy,comment-id=00010000,timestamp=2015-08-06T16:35:33.374+0000)\n>\n> Just curious if you've seen the feedback suggesting that you add a VS between the two like how they have in fighting games and if you're considering it. \n> Someone made this, for instance: http://a.disquscdn.com/uploads/mediaembed/images/2354/8196/original.jpg\n> \n> Just a little thing thematically that would fit- although I could understand if you think it would cover too much of the character art- the characters are really well done in this splash.\n\nLets be honest, riven wins that matchup any day.","replies":[{"poster":"VikingRaid","date":"2015-08-07T04:34:02.984+0000","up_votes":1,"down_votes":0,"body":"Not if it's full AP Blitz and he manages to catch her. Late game that is","replies":[]}]}]}]},{"poster":"Shadr2369","date":"2015-08-06T14:05:40.985+0000","up_votes":2,"down_votes":1,"body":"Riot has become lazy nowadays and their splashes include multiple champions of the same theme.","replies":[{"poster":"Dr Birdie","date":"2015-08-06T21:12:01.561+0000","up_votes":2,"down_votes":0,"body":"Actually, I don't think it has anything to with laziness. The combined splashes are up to the same quality as all of their other recent splashes.\n\nI would say it is more \"smart from a marketing standpoint\" than anything. Think about it. By having all of the skins of a theme in the same splash, they are essentially advertising all of the skins of that theme to anyone who only bought the one they bought because they like the theme. Making them want the rest of them, to have the whole collection. Sort of a \"gotta catch em' all\" mentality.\n\nThat being said it doesn't feel anything like advertisement because of the high quality of the splash itself. \n\nAnd before anyone comments I am not trying to make Riot out to be money-grubbing. Skins are essentially their biggest form of income until worlds rolls around.","replies":[]}]},{"poster":"KnighRrider","date":"2015-08-06T18:39:47.314+0000","up_votes":2,"down_votes":0,"body":"I don't think Riot is being too \"lazy\" with their skins, but what would REALLY blow me away is if they made a SECOND splash with just the champion selected, along with a splash of all the champions themed!","replies":[]},{"poster":"S2C2Xd9KOy","date":"2015-08-07T11:47:08.899+0000","up_votes":1,"down_votes":0,"body":"I like the splash. I like the skin in general, with exception of her blade and her Wind Slash.... just think her sword looks really boring and potential is being wasted.","replies":[]},{"poster":"lilgangstapony","date":"2015-08-06T19:45:45.996+0000","up_votes":1,"down_votes":0,"body":"When is the skin actually available to buy?","replies":[]},{"poster":"2ManyJons","date":"2015-08-07T06:19:28.041+0000","up_votes":1,"down_votes":1,"body":"No words can express how mad this makes me.\n\nI wont say Riven is my favorite champ, but I do like her. She's fun to play, has an interactive kit, and has pretty cool skins. When I saw that she was getting an Arcade skin I got super excited. I have always imagined Riven making a great toplaner to complete the Arcade team. Now I've seen her model and her abilities and I'm over the moon about her, then I see this crap splash.\n\nFor a 1350 skin, one that I've wanted for so long, to finally come out and have to share a garbage splash with the champion I HATE THE MOST, it's frankly insulting. Dragon Blade has an insanely good splash, Miss Fortunes new skin has an AMAZING splash. I was hoping to get an awesome splash (like, Dragon Slayer Panth or Night Hunter Rengar level awesome) for Arcade Riven to use as my comp Background, but now that its a poop split with one of the worst champs in league, I pretty much have almost lost interest.","replies":[]}]}