{"poster":"TheItalianViking","date":"2014-12-14T00:04:11.366+0000","title":"Hecarim is fun...but needs a buff.","subforum":"Gameplay","up_votes":4,"down_votes":4,"body":"He's a solid jungler early levels (good sustain), has decent pre-6 ganks, and his ganks only get better from there. However, it seems like his usefulness kind of mid-late game. I think everybody can agree that Hecarim needs some help, but how? If you take a look at anything Hecarim related, he is a fighter first, tank second. He simply does not put the damage out, and while he can chase being able to 1v1 somebody else is not very common.\r\n\r\nWhat if we used his passive more efficiently by adding a movement speed passive to his ult? Every time he connects an enemy champion with Rampage he gains +5% movement speed for the next 6 seconds, maxing out at +25% movement speed. Or, you could just raise his scaling. That would work too. :P\r\n\r\nBut seriously, buff our Party Horse.","replies":[{"poster":"Anomander","date":"2014-12-14T00:04:51.976+0000","up_votes":1,"down_votes":1,"body":"Hecarim mid went 11/1 in a pro game......","replies":[{"poster":"TheItalianViking","date":"2014-12-14T00:07:30.526+0000","up_votes":1,"down_votes":0,"body":"Link?","replies":[{"poster":"Poorly Dressed","date":"2014-12-14T00:23:27.574+0000","up_votes":2,"down_votes":0,"body":"Try to look for FSN vs. CA game 4, maybe it's online tomorrow","replies":[]}]},{"poster":"Kowe The Ewok","date":"2014-12-14T00:34:05.308+0000","up_votes":1,"down_votes":1,"body":"11/4.\n\nHe stole his carry a tripple kill - and anybody can snowball with that. Ironically he barely managed to to carry his team even while he had 11 kills. They even were pushed into their own base at some point.\n\nImagine thes ekills would hav been on any champion who could actually make use of it.......","replies":[]}]},{"poster":"EarthDeity","date":"2014-12-14T00:10:46.373+0000","up_votes":2,"down_votes":1,"body":"As someone who does very well with hecarim, I don't find his damage low at all. Just a triforce for damage, followed by sunfire, and his damage output becomes extremely respectable. At that point, you can safely build full tank. Hecarim is full of CC, and deals most of his damage in an AOE, this is why his output feels low in a 1v1. I think that that's fine. Nobody expects {{champion:32}}  to kick ass 1v1!","replies":[]},{"poster":"Clad in Plaid","date":"2014-12-14T01:00:45.232+0000","up_votes":1,"down_votes":0,"body":"> he is a fighter first, tank second.\n\nWhat are you talking about, we all know Hecarim is the de facto best assassin in the game.","replies":[{"poster":"Anomander","date":"2014-12-14T03:09:39.894+0000","up_votes":1,"down_votes":0,"body":"Full ad hecarim  with homeguard. teleport......  Sonic crit boom.................","replies":[]}]},{"poster":"Kuroi86","date":"2014-12-14T02:40:58.132+0000","up_votes":1,"down_votes":0,"body":"Q: Alter cooldown to 4/3.75/3.50/3.25/3\nW: Raise healing cap vs monsters by 20 points at each level.\nE: Take 30% ms off of the active and give it a passive that gives him a permanent ms boost equal to 10%/15%/20%/25%/30%\n\nPick one, any one, it would be a major buff to the herald of the Shadow Isles.","replies":[]},{"poster":"junglerboy16","date":"2014-12-14T01:14:18.935+0000","up_votes":1,"down_votes":0,"body":"I think the best buff they could give him would be remove/raise the silly  cap he has on healing from minions for his aura of dread. His biggest problem right now is that he cannot really survive well in the jungle as far as I have seen. If they gave him a little help, he could be a great junglier again. Riot is just a bit tentative about Hecarim buffs because when hecarim is REALLY strong, he basically turns into the team fight version of Udyr: super fast, hard to escape, high damage, and amazing split pushing OR team fighting. I would like to see more of the pony in the jungle again.","replies":[]},{"poster":"Rinky Dinky","date":"2014-12-14T01:14:11.484+0000","up_votes":1,"down_votes":0,"body":"Hecarim is fine. Alot of the champions people say need buffs do not need them. EX: Hecarim and Sivir","replies":[]}]}