{"poster":"Ayato Kirishìma","date":"2016-09-14T21:37:06.979+0000","title":"Tastiera meccanica e mouse per LoL","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"Salve, come da titolo sto cercando una tastiera meccanica e un mouse per LoL.\r\n\r\nFascia di prezzo per la tastiera non sopra i 200 &euro; mentre per il mouse 100&euro;.","replies":[{"poster":"x A N D R E","date":"2016-09-16T05:35:16.979+0000","up_votes":1,"down_votes":1,"body":"Ma la tastiera cinese da 5€ no eh, dovete proprio fare gli shopponi","replies":[{"poster":"Floppyz","date":"2016-09-16T08:52:09.471+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=andre4170,realm=EUW,application-id=MJVj50Jw,discussion-id=s4ogqnWi,comment-id=0004,timestamp=2016-09-16T05:35:16.979+0000)\n>\n> Ma la tastiera cinese da 5€ no eh, dovete proprio fare gli shopponi\n\nNon è questione di fare gli _shopponi_, le tastiere non sono mica tutte uguali, oppure tu quando devi acquistare qualcosa prendi sempre quella che costa meno, per non fare lo _shoppone_? E come mai non prendi quella che costa meno di tutte?","replies":[{"poster":"x A N D R E","date":"2016-09-18T05:27:14.645+0000","up_votes":1,"down_votes":0,"body":"Era una provocazione e ci siete cascati come dei polli","replies":[{"poster":"Floppyz","date":"2016-09-18T07:21:01.932+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=andre4170,realm=EUW,application-id=MJVj50Jw,discussion-id=s4ogqnWi,comment-id=000400000000,timestamp=2016-09-18T05:27:14.645+0000)\n>\n> Era una provocazione e ci siete cascati come dei polli\n\nChe simpatico! :)","replies":[]}]}]},{"poster":"Ayato Kirishìma","date":"2016-09-16T14:21:07.556+0000","up_votes":1,"down_votes":0,"body":"Non penso che con 5€ tu compra una tastiera meccanica, la qualità si paga, a quel prezzo che dici tu non penso trovi il top ( o roba decente)\n\nPersonalmente per una cosa che mi serve cerco la qualità e non il risparmio, se volevo comprarmi una tastiera a 5€ non stavo qui sul forum a chiedere consigli. {{sticker:zombie-brand-mindblown}} ","replies":[]}]},{"poster":"Easlay","date":"2016-09-15T14:38:44.033+0000","up_votes":2,"down_votes":0,"body":"tastiere: razer paghi 100 per avere 20, steelseries (almeno le apex membrana) fan pena, quindi eviterei pure le meccaniche (e io adoro la steelseries, mi piange il cuore sapere che la apex fa pena, è troppo bella ç_ç)\n\nconsiglio mio, dato che ce l'ho e mi trovo da dio: CM storm quickfire ultimate (prezzo 100€ circa) - switch brown.\nPerò dovresti provarne un paio al tatto per vedere con quali switch ti trovi meglio (vai in qualsiasi negozio di pc decente e le hanno fuori d'esposizione appunto per provarle)\n\n\n\nmouse: io ho lo steelseries sensei (il wireless, ma giusto perchè beccai a 100 grazie ai fnatic, contro i 180 che costa attualmente, anche se adesso sta a 130 per sconto temporaneo), ma anche il rival è ottimo","replies":[]},{"poster":"Ultan","date":"2016-09-14T22:50:03.352+0000","up_votes":1,"down_votes":0,"body":"Tastiera:\nhttps://www.amazon.it/Razer-RZ03-01221300-R311-Blackwidow-Chroma-Tastiera/dp/B00REG4FZO/ref=sr_1_4?ie=UTF8&qid=1467971213&sr=8-4&keywords=blackwidow+chroma\n\nMouse:\nhttps://www.amazon.it/Razer-Mamba-Tournament-Mouse-Gioco/dp/B00ZU1Z7DE/ref=pd_bxgy_147_img_2?ie=UTF8&psc=1&refRID=0V8V55GXCWD8069FGQ4N","replies":[{"poster":"Ayato Kirishìma","date":"2016-09-15T00:55:13.409+0000","up_votes":1,"down_votes":0,"body":"Ho dimenticato di dire che Razer non la comprerò mai, paghi la marca ma non i materiali.","replies":[{"poster":"Floppyz","date":"2016-09-15T07:51:48.662+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ayato Kirishìma,realm=EUW,application-id=MJVj50Jw,discussion-id=s4ogqnWi,comment-id=00000000,timestamp=2016-09-15T00:55:13.409+0000)\n>\n> Ho dimenticato di dire che Razer non la comprerò mai, paghi la marca ma non i materiali.\n\nSono d'accordo su razer.\n\nDai un'occhiata a queste tastiere:\n\nhttp://www.coolermaster.com/peripheral/keyboards/triggerz/\nhttp://www.roccat.org/it-IT/Products/Gaming-Keyboards/Ryos-Series/Ryos-MK-Pro/\nhttp://www.corsair.com/en-us/corsair-gaming-k95-rgb-mechanical-gaming-keyboard-cherry-mx-red-ch-9000220-na\nhttp://www.corsair.com/en-us/k70-lux-rgb-mechanical-gaming-keyboard-cherry-mx-red-na\nhttp://gaming.logitech.com/it-it/product/g910-orion-spectrum-rgb-gaming-keyboard\nhttp://gaming.logitech.com/en-us/product/g810-orion-spectrum-rgb-gaming-keyboard\n\nMouse:\nhttp://gaming.logitech.com/it-it/product/g502-proteus-spectrum-rgb-gaming-mouse\nhttp://gaming.logitech.com/it-it/product/moba-gaming-mouse-g302\n\nMi raccomando controlla bene i layout prima di acquistare la tastiera.","replies":[{"poster":"Ayato Kirishìma","date":"2016-09-16T11:08:46.518+0000","up_votes":1,"down_votes":0,"body":"Molto probabilmente prenderò la trigger z! \nConoscete qualche sito dove posso pagarla poco e con il layout italiano??","replies":[{"poster":"Floppyz","date":"2016-09-16T11:18:02.430+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ayato Kirishìma,realm=EUW,application-id=MJVj50Jw,discussion-id=s4ogqnWi,comment-id=0000000000000000,timestamp=2016-09-16T11:08:46.518+0000)\n>\n> Molto probabilmente prenderò la trigger z! \n> Conoscete qualche sito dove posso pagarla poco e con il layout italiano??\n\nEh, è quella su cui puntavo anche io da tempo.\n\nLa trovi qui (non so ancora per quanto) a 100 euro (compresa spedizione mi pare) con gli switch brown e layout ita: http://www.eprice.it/tastiere-COOLERMASTER/d-5354253","replies":[{"poster":"Ayato Kirishìma","date":"2016-09-16T11:31:35.596+0000","up_votes":1,"down_votes":0,"body":"E' affidabile quel sito? Non ho mai fatto acquisti li, comunque io avevo una logitech G510 e volevo puntare su una meccanica, anche se è molto comoda quella che uso adesso.\n\nMentre per quanto riguarda il mouse ho quello che hai linkato tu, il g502 ma vorrei cambiarlo","replies":[{"poster":"Floppyz","date":"2016-09-16T11:37:46.786+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ayato Kirishìma,realm=EUW,application-id=MJVj50Jw,discussion-id=s4ogqnWi,comment-id=000000000000000000000000,timestamp=2016-09-16T11:31:35.596+0000)\n>\n> E&#x27; affidabile quel sito? Non ho mai fatto acquisti li, comunque io avevo una logitech G510 e volevo puntare su una meccanica, anche se è molto comoda quella che uso adesso.\n> \n> Mentre per quanto riguarda il mouse ho quello che hai linkato tu, il g502 ma vorrei cambiarlo\n\nIo ci ho comprato diverse volte, anche se non recentemente. Ho anche fatto un RMA e a parte un po' di lentezza è andata a buon fine.\n\nTutte le tastiere che ti ho linkato sono meccaniche (oltre che buone IMHO). Se non ne hai mai provata una ti suggerirei di farlo, visto che hanno un feeling piuttosto diverso da quelle a membrana, oltre al fatto che sono molto più rumorose.\n\nPer il mouse vedi tu, io è da quando acquisto da me che mi affido a Logitech senza aver mai avuto problemi, ma è anche vero che ci sono pure altri produttori decenti. Io ho giustappunto il G502 e mi ci trovo benissimo, arrivando da un G5 (che peraltro funziona ancora). :P","replies":[{"poster":"Ayato Kirishìma","date":"2016-09-16T11:55:32.928+0000","up_votes":1,"down_votes":0,"body":"Io con il G502 mi trovo un po' scomodo, sarà che non uso il tappetino e a volte mi si resetta la velocità del puntatore.. \nTu usi un tappetino specifico?\nPer la tastiera meccanica ho provato i tasti di una razer in un negozio della mia città ma comunque non la comprerei mai, mi piace il feeling, l'unica pecca che hai detto anche tu è che sono rumorose, ma no problem. {{sticker:slayer-jinx-catface}} ","replies":[{"poster":"Floppyz","date":"2016-09-16T12:53:43.307+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ayato Kirishìma,realm=EUW,application-id=MJVj50Jw,discussion-id=s4ogqnWi,comment-id=00000000000000000000000000000000,timestamp=2016-09-16T11:55:32.928+0000)\n>\n> Io con il G502 mi trovo un po&#x27; scomodo, sarà che non uso il tappetino e a volte mi si resetta la velocità del puntatore.. \n\nMa sei una bestia! Rovini i piedini del mouse.\n\nPeraltro il software Logitech che ti danno insieme ha proprio una funzione che calibra il mouse sulla base del mousepad che ci metti sotto, proprio per evitare qualsiasi problema.\n\n> Tu usi un tappetino specifico?\n\nIn realtà ne va bene praticamente uno qualsiasi (magari non quello che davano con Topolino qualche anno fa), io uso un Roccat Taito: http://www.roccat.org/en-US/Products/Gaming-Mousepads/Taito-Series/Taito/\n\nPrima di quello avevo comprato un razer nonricordo ma col G5 se facevo movimenti molto bruschi non li registrava, quindi l'ho regalato. Prima ancora avevo uno steelseries molto carino, con una simpatica retina di gomma da applicare sotto per inchiodarlo praticamente alla scrivania, che però con gli anni ha cominciato a fare le gobbe (era di quelli rigidi tipo plastica). O.o\n\nLe caratteristiche che dovresti considerare per un pad sono la scorrevolezza del mouse, le dimensioni e l'altezza. Evita poi pad che riesci a spostare sulla scrivania senza doverli sollevare.","replies":[{"poster":"Ayato Kirishìma","date":"2016-09-16T14:18:55.258+0000","up_votes":1,"down_votes":0,"body":"Giocare con il tappetino non mi è mai piaciuto.. però vedo può essere molto utile e comunque si, hai ragione, i piedini sono rovinati e la gommina è abbastanza consumata.\nEcco perchè ho deciso di ricomprare un mouse e cercare un tappetino, ultimamente non scorre sulla scrivania e più che altro non faccio un movimento di polso ma la parte inferiore del mouse rimane praticamente ferma e muovo solo la parte superiore precisamente dove è attaccato il filo a destra e sinistra.\n\nRiguardo il tappetino avevo visto questo http://gaming.logitech.com/it-it/product/cloud9-cloth-gaming-mouse-pad ma mi sembra un pochino troppo grande\n\nPer quanto riguarda la tastiera credo di essermi convinto a prendere la trigger z visto che anche un mio amico la possiede e me ne ha parlato molto bene.\nOra devo solo vedere se cambiare anche il mouse, magari potrebbe scorrere bene su un tappetino apposito visto il problema del gommino..\n\nRiguardo il software del mouse io non sapevo nulla, ora mi informo","replies":[{"poster":"Floppyz","date":"2016-09-16T16:28:31.949+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ayato Kirishìma,realm=EUW,application-id=MJVj50Jw,discussion-id=s4ogqnWi,comment-id=0000000000000000000000000000000000000000,timestamp=2016-09-16T14:18:55.258+0000)\n> non faccio un movimento di polso ma la parte inferiore del mouse rimane praticamente ferma e muovo solo la parte superiore precisamente dove è attaccato il filo a destra e sinistra.\n\nTi consiglierei di leggere la parte riguardo highsenser/lowsenser, potrebbe farti scoprire cose che non sai: http://www.hwupgrade.it/forum/showthread.php?t=1551433 :P\n\n> \n> Riguardo il tappetino avevo visto questo http://gaming.logitech.com/it-it/product/cloud9-cloth-gaming-mouse-pad ma mi sembra un pochino troppo grande\n\nGuarda bene le dimensioni e (anche sulla base del discorso highsenser/lowsenser) non prendere qualcosa che non useresti, o peggio ancora per cui non avresti lo spazio.\n\n> Per quanto riguarda la tastiera credo di essermi convinto a prendere la trigger z visto che anche un mio amico la possiede e me ne ha parlato molto bene.\n\nPoi fammi sapere che son curioso pure io :P\n\nTieni anche conto che diversi swtich danno diversi feedback: quella che ti ho linkato ha degli cherry mx brown, ma quella del tuo amico potrebbe avere degli cherry mx di un altro colore. Qui trovi una buona panoramica degli switch cherry mx: http://www.keyboardco.com/blog/index.php/2012/12/an-introduction-to-cherry-mx-mechanical-switches/\n\n> Ora devo solo vedere se cambiare anche il mouse, magari potrebbe scorrere bene su un tappetino apposito visto il problema del gommino..\n\nSe i gommini non sono completamente andati (se ci passi il dito devono risultare talmente lisci da sembrare quasi bagnati o fluidificati) vedrai che con un mousepad il mouse sarà **molto** più preciso.\n\n> Riguardo il software del mouse io non sapevo nulla, ora mi informo\n\nIl software è questo: http://support.logitech.com/it_it/software/lgs ti consiglio di installarlo, perché a parte poter regolare bottoni, DPI e macro, puoi proprio creare dei profili automatici per ogni gioco con i relativi binding dei tasti.\n\nA parte questo, se pigi il quinto tasto in basso vedrai che ti fa regolare il mouse in base alla superficie su cui poggia, il funzionamento è piuttosto intuitivo.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"l  Ferox  l","date":"2016-09-15T08:52:34.061+0000","up_votes":1,"down_votes":0,"body":"Io ho il Mamba Tournament ed è una meraviglia ... poi i gusti son gusti ^^","replies":[]}]}]},{"poster":"Dr LouD","date":"2016-09-15T10:37:26.672+0000","up_votes":1,"down_votes":0,"body":"Ho la logitech G910 Orion Spark da 1 anno e Razer Deathadder Chroma (non sono nemmeno io simpatizzante Razer ma quando l'ho provato sembrava che l'avessero disegnato sulla mia mano, posso stare con la mano sul mouse 10 ore di fila senza il minimo fastidio) da 2 e vanno ancora una bomba\n\nUnica nota la Orion Spark ha dei tasti con una forma un po particolare che danno un feeling strano a primo impatto, quindi se puoi provala prima se hai in mente di acquistarla","replies":[]},{"poster":"JRobich","date":"2016-09-15T08:48:21.142+0000","up_votes":1,"down_votes":0,"body":"di mouse ho avuto il razer naga hex.. 70 euro si è rotto cosi senza motivo ora ho questo:\n\nhttps://www.amazon.it/Patuoxun-Precisione-Professionale-Pulsanti-Programmabili/dp/B00YREG2LQ/ref=sr_1_18?ie=UTF8&qid=1473929157&sr=8-18&keywords=mouse+gaming\n\n25 euro una bomba è perfetto... super consigliato\n\nper la tastiera non lo so io gioco con il nostromo della razer...","replies":[]}]}