{"poster":"the raging blade","date":"2016-08-24T14:53:56.151+0000","title":"does riot never fix their bugs","subforum":"Player Behaviour","up_votes":1,"down_votes":5,"body":"so when i do not afk one game and they just put me in the low priority for other feeders just does feeding and give false report, what is the solution, dun fking say it depends on time, what time?i did not even afk that game? when you team me with people afk since 3 or 4 min why they dunt enjoy what i enjoy, or is it just u play with friends so u can frame people up as u like? riot staff members r so dickhead to answer these questions and ban my support account cause i show no respect to them( which they deserve nil) so can any riot people here can send the message back so they can have some self reflection?\n\nand also i will make other team mates suffer for all the game i am in low pri-q cause i am punished for what i did not do, so go let them suffer with me is a good idea","replies":[{"poster":"Tele","date":"2016-08-25T03:53:21.863+0000","up_votes":3,"down_votes":0,"body":"**Riot** support are trying to help you with your problem, they don't deserve your misdirected abuse. The people you talked to probably had nothing to do with your AFK punishment.\n\nVery sad to hear you treated them that way.","replies":[{"poster":"LUPIN lll","date":"2016-08-25T11:31:36.307+0000","up_votes":1,"down_votes":0,"body":"Tele, I love you.","replies":[{"poster":"Tele","date":"2016-08-25T11:38:56.716+0000","up_votes":2,"down_votes":0,"body":"I'm gaining your trust quickly now >:D","replies":[]}]},{"poster":"the raging blade","date":"2016-08-25T10:33:53.258+0000","up_votes":1,"down_votes":0,"body":"they never use hand written answer to answer my questions they just copy and paste\n\nand when i ask for a good answer they ban me and forbidden me from send ticket, so good are they. need me to show all their copy pasted answers?","replies":[{"poster":"Tele","date":"2016-08-25T11:23:16.226+0000","up_votes":1,"down_votes":0,"body":"> they **never** use hand written answer to answer my questions\n\n+ [You've posted](http://boards.oce.leagueoflegends.com/en/c/player-behaviour/PYOaNtAn-you-should-be-able-to-report-people-from-champ-select?comment=0005) a few of their hand written responses on the boards yourself.\n\n There's no excuse to be disrespectful. \n\nI'll be as honest as I can. I want to help, but you have to completely tone down the aggression. It's been out of hand for a while now.","replies":[{"poster":"the raging blade","date":"2016-08-27T14:04:08.989+0000","up_votes":1,"down_votes":0,"body":"so how many? need me show ya?","replies":[]}]}]}]},{"poster":"Sloth Almighty","date":"2016-08-25T00:40:18.789+0000","up_votes":1,"down_votes":0,"body":"I can see why you chose this handle","replies":[]}]}