{"poster":"OverCode","date":"2019-05-08T09:14:42.725+0000","title":"Emparejamiento disparejo","subforum":"Problemas Técnicos","up_votes":4,"down_votes":0,"body":"Hace ya un tiempo he estado jugando harto, pero hace unas semanas que me ha estado emparejando con niveles 40, 50 hasta platinos, oros y niveles de 100 hacia arriba. Desde que soy nivel 27 que me ha estado emparejando así y no sé si es por algún problema de riot o que se yo pero es molesto, quita todas las ganas de jugar. Ahora soy nivel 30 por si las dudas, no sé si eso afecta en algo pero aún lo encuentro muy injusto.\r\n\r\nSeria super que arreglaran esto luego, y si no tienen forma de hacerlo pues supongo que no seré ni el primero ni el ultimo en tener una queja así.\r\n\r\nPrimera vez que publico algo.","replies":[{"poster":"SofiGamer2006","date":"2019-05-08T09:24:21.120+0000","up_votes":1,"down_votes":0,"body":"Que hayan jugado mas no significa que sean mejores.","replies":[{"poster":"OverCode","date":"2019-05-08T09:41:09.028+0000","up_votes":1,"down_votes":1,"body":"pero aún así debería emparejarme con niveles iguales o cercanos a los míos, no?","replies":[{"poster":"LUCÏA HIRIART","date":"2019-05-08T16:14:59.212+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OverCode,realm=LAS,application-id=X54mVVp0,discussion-id=U9RETkMw,comment-id=00000000,timestamp=2019-05-08T09:41:09.028+0000)\n>\n> pero aún así debería emparejarme con niveles iguales o cercanos a los míos, no?\n\nel nivel no tiene nada que ver con la liga bro, puede un men ser lvl 30 y ser platino, o un lvl 400 y ser bronce, por lo tanto el level no tiene nada que ver con la liga y si te emparejan con bronces es por 2 razones.\n1. el bronce esta en una muy buena racha  por lo cual su mmr es alto.\n2. tu mmr esta muy bajo por lo cual te emparejan con gente de liga mas baja, pero me abalanzo mas al punto 1, ya que yo también  e jugado con bronces 1 estando oro 3 lo cual lo mas común es que sean smurfing casuales o simplemente aumentaron su nivel de juego \n{{sticker:sg-ezreal}} ","replies":[]},{"poster":"Çhino","date":"2019-05-08T11:39:59.601+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OverCode,realm=LAS,application-id=X54mVVp0,discussion-id=U9RETkMw,comment-id=00000000,timestamp=2019-05-08T09:41:09.028+0000)\n>\n> pero aún así debería emparejarme con niveles iguales o cercanos a los míos, no?\n\nNo le hagas caso. Cuando pasa eso usualmente es cuando jugas con algun amigo que esta en premade con un lvl bajo (menor a 30 sin rankeds) entonces te emparejan con personas parecidas en cuanto a elo de tu amigo. Sino no estas en premade seguramente justo dio la casualidad que pasa lo que mencione ahi arriba pero con personas random. Rankeando las 10 primeras se soluciona ya que el juego sabe que elo sos","replies":[]},{"poster":"SofiGamer2006","date":"2019-05-08T10:10:28.470+0000","up_votes":1,"down_votes":0,"body":"No.","replies":[]}]}]},{"poster":"Sergius","date":"2019-05-08T19:37:20.887+0000","up_votes":1,"down_votes":1,"body":"Si venis a este foro a que te escuchen, estas errado, la mayoría escriben huevadas sin saber. Y si ... El algoritmo de RIOT de emparejamientos está roto. \"Empareja mal\", Es una queja a nivel internacional. \nSe entiende que están trabajando en resolverlo, pero no estoy seguro.\nEn este foro vas a leer huevadas como \"Que hayan jugado mas no significa que sean mejores.\" o otras como \"el nivel no tiene nada que ver con la liga bro...\".\nY mientras tanto a un bronce lo empareja con un patino o a un plata 1 con un oro 1.\nEl sistema de elos es pésimo, a un bronce 1 lo debe emparejar con un bronce 1 y así en todas las ligas. Pero bueno. RIOT cree que sabe más que cualquier otro juego.\nSi analizas, en cualquier liga deportiva los de un nivel juegan con los del mismo nivel hasta superarlo, y así pasan al siguiente nivel. \nEjemplo: Un cinto amarillo de taekuondo pelea con un cinto amarillo y no con uno verde que es malo como verde.\nEntonces el cinto amarillo, cuando sea verde va a pelear con ese cinto verde que es malo y tal vez pierda o gane, dependiendo de su experiencia.\n\nEsto está hecho para los que avanzan muy rapidamente. Ej: las cuentas smurf de los diamantes o maestros. Para que no rompan mucho las bolas dentro de las ligas mas bajas. Es decir, para que un jugado avanzado que se hizo una cuenta nueva pueda llegar rapidamente a su liga (DIAMANTE, RETADOR, ETC).\n\nMi opinion es que deben ir al modelo tradicional y las cuentas deben estar vinculadas con un gmail, para que todas las cuentas de la misma persona estén dentro del mismo elo, y no esten jodiendo por el mundo eloboosteando (jugando partidas en cuentas de amigos para subirlas a un elo que no es el del propio usuario de la cuenta) o smurfeando (Cuentas pitufo, son sub cuentas de gente que juega en ligas superiores y las quieren llevar a su liga).\n\nA esto hay que sumarle la problemática de fin de temporada en la que todos los oros y diamantes dedican gran parte de su tiempo a subirle las cuentas a amigos para que obtengan sus beneficios de fin de temporada.\nPero vas a notar luego de este post como un monton de nabos escribin huevadas sin saber... cosas que escuchan por ahí. \n\nSaludos y por lo que a mi respecta, estas en lo correcto.","replies":[]}]}