{"poster":"Boosted Proxor","date":"2016-08-29T21:33:56.900+0000","title":"Enimal Coaching Crew - kostenfreies Coaching? Ja!","subforum":"Streams & YouTube","embed":{"description":"Twitch is the world's leading video platform and community for gamers. More than 45 million gamers gather every month on Twitch to broadcast, watch and chat about gaming. Twitch's video platform is the backbone of both live and on-demand distribution for the entire video game ecosystem.","url":"https://www.twitch.tv/xoynuzi","image":"https://static-cdn.jtvnw.net/jtv_user_pictures/xoynuzi-profile_image-e8130dd393bb8e16-300x300.jpeg"},"up_votes":5,"down_votes":1,"body":"Hallo Beschw&ouml;rer!\r\n\r\nSch&ouml;n, dass du diesen Beitrag gefunden hast, ich bringe dir hier eine einfache Methode n&auml;her eine h&ouml;here Wertung zu erreichen, als du derzeit hast.\r\nUm den Beitrag &uuml;bersichtlicher zu gestalten habe ich ein Inhaltsverzeichnis f&uuml;r dich erstellt:\r\n\r\n**1. Wie funktioniert unser Coaching?**\r\n   1.1 Grundinformationen\r\n   1.2 Limitierungen\r\n**2. Wo kann man sich anmelden?**\r\n   2.1 Anmeldung f&uuml;r Coaching\r\n   2.2 Anmeldung als Coach\r\n**3. Wie ist uns die Idee gekommen?**\r\n\r\n_______\r\n\r\n\r\n**1. Wie funktioniert unser Coaching?**\r\n   1.1 Grundinformation\r\nDas Grundprinzip ist relativ einfach: Leute die h&ouml;her platziert sind helfen denjenigen welche niedriger platziert sind. Wie ich bereits erw&auml;hnt habe ist das ganze kostenfrei und ihr habt gr&ouml;&szlig;ten Teils keine Einschr&auml;nkungen. \r\nWir erwarten allerdings von denjenigen die unseren Coaching-Service erhalten, dass sie sich den Stream von unserem Broadcaster &quot;XoYnUzi&quot; zumindest einmal anschauen. Es wird niemand dazu gezwungen sich den Stream anzuschauen, allerdings ist dieser auch sehr hilfreich um h&ouml;here Wertungen zu erreichen. Den XoYnUzi (oder auch &quot;Eni&quot;) ist ehemaliger Top 10 Challenger &amp; ehemaliger FNC-Academy Jungler.\r\n\r\n   1.2 Limitierungen\r\nAuch wenn unser Coaching-Service vollst&auml;ndig kostenfrei ist gibt es einige Limitierungen:\r\nIm Zeitraum von 7 Tagen, darf eine Privatperson maximal 9 Einheiten erhalten.\r\nEin Verlust an Elo ist unabh&auml;ngig von unserem Service, da wir eure Wertung nicht aktiv beeinflussen.\r\nAllgemein ist sich an unser Regelwerk (welches ihr auf unserem TeamSpeak&sup3; Server findet) zu halten.\r\nWir fordern Selbsteinsch&auml;tzung &amp; Kritikf&auml;higkeit.\r\n____\r\n**2. Wo kann man sich anmelden?**\r\n   2.1 Anmeldung f&uuml;r Coaching\r\nF&uuml;r eine Einheit Coaching kann man sich einfach &uuml;ber Skype (Enimal Coaching Service) anmelden. Alternativ gibt es auch die M&ouml;glichkeit einfach auf unserem TeamSpeak Server (xoynuzi.kyobinoyo.de) vorbei zu schauen und spontan nach einer Einheit zu fragen. \r\nFragt am Besten bei einem Admin nach, ob er euch einen Termin geben kann oder ob derzeit ein Coach Zeit hat.\r\n\r\n   2.2 Anmeldung als Coach\r\nSolltet ihr Platin oder h&ouml;her sein gibt es ebenfalls die M&ouml;glichkeit selber Coach zu werden.\r\nDie Anmeldung als Coach ist etwas komplizierter: Als erstes meldet ihr euch am TeamSpeak bei &quot;Florian ● Proxor&quot;.\r\nFalls er nicht online ist k&ouml;nnt ihr ihn ebenfalls &uuml;ber Skype kontaktieren (Enimal Coaching Service).\r\nDanach sollt ihr euch vorstellen, ihr solltet hier bei zumindest Stichworte haben oder direkt eine Bewerbung senden. Ihr weist dann eure Elo vor, nun wird sich die Leitung beraten ob ihr passend seid. Bitte werdet nicht b&ouml;se wenn ihr trotz eurer Elo nicht als Coach angenommen werdet, es geht nicht nur um die Wertung die ihr erreicht habt sondern auch viel um euer K&ouml;nnen als Coach.\r\n____\r\n**3. Wie ist uns die Idee gekommen?**\r\nNun wie ich bereits erz&auml;hlt habe sind wir eine recht gro&szlig;e Community von verschiedenster Elo und wir wollten einem verzweifeltem Spieler helfen eine bessere Wertung zu erreichen. Wir haben gemerkt wie gut das funktioniert und wollten uns auch anderen als Coaches anbieten. Gerade weil ich tats&auml;chlich schon als Coach t&auml;tig war, habe ich viel Erfahrung und dachte mir wir k&ouml;nnen einigen Leuten damit eine Freude machen und auch unseren netten Broadcaster Eni unterst&uuml;tzen, der auch &ouml;fter bei Summoners-Inn als Caster/Analyst ist.\r\n\r\n_____\r\n\r\nSolltet ihr noch Fragen haben, stellt diese gerne in den Kommentaren oder via Skype. Feedback ist auch immer erw&uuml;nscht!\r\n\r\nGru&szlig; Florian | Proxor","replies":[]}