{"poster":"YellowFish","date":"2016-11-13T12:05:44.715+0000","title":"WHERE IS THE TRIBUNAL FOR OCE !?!?!?!?!?","subforum":"Player Behaviour","embed":{"description":"Before introducing the Tribunal in OCE, we need to make sure the system is optimally equipped with features to ensure it can combat unsportsmanlike behavior in game. We know that the Tribunal is a powerful way for the community to decide what behaviors are acceptable during a League of Legends match.","url":"http://oce.leagueoflegends.com/en/news/game-updates/player-behavior/tribunal-oce","image":"http://oce.leagueoflegends.com/sites/default/files/styles/wide_medium/public/upload/kayle_splash_0.jpg?itok=1j6peV6D"},"up_votes":3,"down_votes":3,"body":"Its been 2 years and still nothing.........","replies":[{"poster":"Worrior697","date":"2016-11-19T03:22:05.597+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YellowFish,realm=OCE,application-id=T8eq2lFQ,discussion-id=HivEpYfx,comment-id=,timestamp=2016-11-13T12:05:44.715+0000)\n>\n> Its been 2 years and still nothing.........\n\nEver since I started playing this game I have hated players like you.\nI showed back on the NA forums. IF YOU JUST BAN EVERYONE YOU GET 85% PUNISHMENT RATIO!!\n\nThen when you call players like out on your own crap and say you just want mommy to get revenge on this player. You all cry the same thing.\n\" No it is stop players like this and that from doing it \"\n\nFace facts. Tribunal didn't work. You only want revenge some player who had a bad game and you made it even worst for them by raging and acting like a tool.\nBut think you are some how in the right even thou if you read anything on the forums. Ragers and the one that raged them both get ban.\n\nYou would be here crying about how this player did this to you and that player did this.\nI will give you the best tool you have to not have to deal with  the ones you want ban.\n\nStep 1: Press and hold tab\n\nStep 2: Click the little speaker icon\n\nStep 3: Report\n\nStep 4: Make a coffee or tea \n\nStep 5: Rub one out\n\nIf you follow the steps. You won't care about them by the time you finish step 5. I can bet you aren't even thinking about them either.\n\nMuch love.","replies":[]},{"poster":"MF Support","date":"2016-11-13T13:38:38.750+0000","up_votes":1,"down_votes":0,"body":"Riot games, Spending money on Drugs, Alcohol and pointless Cosmetic client updates instead of fixing the damn game.","replies":[]},{"poster":"YellowFish","date":"2016-11-13T12:06:05.349+0000","up_votes":1,"down_votes":0,"body":"BUMP","replies":[]}]}