{"poster":"Le P00","date":"2016-07-20T20:56:53.471+0000","title":"Cassiopeia W Nerf","subforum":"Champions & Gameplay","up_votes":2,"down_votes":7,"body":"Ich habe gerade mit Katarina gegen eine Cassoi auf der mitte gespielt mit meinem Kumpel WW im Jungle und wir haben uns dar&uuml;ber aufgeregt das die W von Cassio Katas E WW Ult und so blockiert und das so 100% aller Assassins gecountert werden.\nDas ist nicht gut f&uuml;r die ballance des spiels da dieser effekt nicht von QSS entfernt werden kann","replies":[{"poster":"BlackSugaRose","date":"2016-07-20T21:15:20.633+0000","up_votes":5,"down_votes":0,"body":"Warum sollte das nicht gut für die Balance sein?\nRiot hat eine neue Mechanik eingeführt, die hoher Mobilität von Champions entgegenwirken soll, gerade um mehr Möglichkeiten zu schaffen.\nCountern heißt jedoch nicht, den Gegenpart komplett nutzlos zu machen!\nChampions mit hoher Mobilität, wie beispielsweise Assassins, konnten immer nach dem selben Prinzip agieren. \nAus dem gefühlten Nichts auf den Carry jumpen, ihn töten und im schlimmsten Fall direkt wieder wegspringen. \nViele Möglichkeiten, dem zu entkommen, gab es nie wirklich. Natürlich die ein oder andere, aber gerade jetzt wird das auch auf andere Champions ausgeweitet.\nWie bereits gesagt bedeutet das aber nicht, dass Assassins plötzlich nutzlos sind. Aus dem Feld kann man schließlich rauslaufen (weshalb QSS darauf auch nicht funktioniert, es ist ein Feld, das auch nach Aktivierung bestehen bleibt), warten bis die W auf Cooldown ist oder ähnliches.\nEine gute Cassiopeia hat so die Möglichkeit mit Assassins fertig zu werden. Andersherum kann ein guter Assassin aber auch immernoch Cassiopeia ausschalten.\nUnd um zum Titel des Threads zu kommen; Einen Nerf auf der W von Cassiopeia würde ich als eher überfüssig bewerten. Cassiopeia hat auf der Midlane (also der Lane, auf der sie hauptsächlich auf Assassins trifft) eine Winrate von 51,66% (Platin+, Quelle: champion.gg).\nDiese Winrate bewegt sich noch im absolut normalen und verkraftbaren Bereich und spricht eindeutig dagegen, dass sie gerade besonders stark oder gar op ist.","replies":[]},{"poster":"Pandaphiri","date":"2016-07-21T07:37:54.914+0000","up_votes":2,"down_votes":0,"body":"rofl.da muss aber jemand mad sein weil seine tollen assassinen mal blockiert werden die sonst alles mit faceroll platt machen. d","replies":[]},{"poster":"leonthefirefly","date":"2016-07-21T07:16:32.751+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Le P00,realm=EUW,application-id=Wj1wcocU,discussion-id=yRBJ6d4U,comment-id=,timestamp=2016-07-20T20:56:53.471+0000)\n>\n\n> Das ist nicht gut f&amp;uuml;r die ballance des spiels da dieser effekt nicht von QSS entfernt werden kann\n\nmade my day^^.\nich würde einfach mal behaupten das ist nicht gut für die Umwelt^^\nwieso sollte das balance technisch ein problem sein? Meiner meinung nach eine der best gelungensten und interesantesten Fähigkeiten die Rito geschaffen hat =)","replies":[]},{"poster":" 4 sec too late","date":"2016-07-20T21:03:35.217+0000","up_votes":2,"down_votes":0,"body":"Es ist die W und man kann einfach raus laufen","replies":[]},{"poster":"Uranbrennstab","date":"2016-07-21T09:53:49.193+0000","up_votes":1,"down_votes":0,"body":"Warum bist du nicht mit Flash oder Warpjump über das Feld bzw bevor es da war?  Ich meine das hat ne Animation und  Misslespeed, da kann du dir vorher nen Kaffee kochen. Dann stehst du eben ein bisschen vor ihr aber Kata hat ja gut range auf ihren spells. Wenn WW nicht komplett geboosted war, dann hat er selbstverständlich über die Flanke angegriffen und deswegen musste Cassio sich entscheiden, wen sie zoned da ihr selbstverständlich nicht aus der selben Richtung angegriffen habt.","replies":[]}]}