{"poster":"WuSen","date":"2016-04-11T21:39:45.454+0000","title":"Mi avete bannato l'account per la 2° volta perchè mi sono difeso da flamers.","subforum":"Aiuto e supporto","up_votes":4,"down_votes":8,"body":"Sono 4 anni che gioco a lol, 4 anni. Ed in questi anni non &egrave; mai esistita (controllate pure) una sola partita in cui io abbia trollato o feedato intenzionalmente o sia andato afk. MAI. \r\nHo sempre e solo risposto difendendomi o chiesto educatamente aiuto o parlato con il team (se c&#039;&egrave; una chat andr&agrave; pure usata). Io non lo so come diavolo funzionino i ban, IO SO SOLO CHE STASERA SONO STATO BANNATO PERMANENTEMENTE PER LA SECONDA VOLTA PERCHE&#039; NEL MIO ULTIMO GAME HO FATTO 0 2 0 con annie (partita conclusa 4 4 6) e il supp, il jung ed il top mi hanno coperto di insulti andando mad e perdendo il game, IO HO RISPOSTO SEMPLICEMENTE DI SMETTERLA e al decimo stfu noob (perdonatemi se non sono budda) ho perso le staffe. IO ADESSO DICO, IN QUESTI ANNI GIOCANDO A QUESTO GAME HO VISTO E SUBITO COSE COME :\r\n\r\n3 afk in una ranked promo\r\n\r\nGente che si divertiva a suicidarsi senza motivo\r\n\r\nfeeders, troll di ogni genere\r\n\r\nE TANTE, TANTE ALTRE COSE ORRIBILI PER CHI IN QUESTO GIOCO LE RANKED LE PRENDONO SERIAMENTE ( in quanto ranked e non normal ) E SI ASPETTEREBBERO UN MINIMO DI IMPEGNO ED ONESTA&#039; da PARTE DEI COMPAGNI DELLA PROPRIA PARTITA. \r\n\r\nORA IO DICO, SONO STATO BANNATO PERMANENTEMENTE 2 VOLTE ED IN ENTRAMBI I CASI PER PERSONE CHE HANNO FATTO STRONZATE, FLAMMATO PER PRIMI, FEDDATO E SONO STATI LIBERI DI REPORTARMI SENZA ALCUN SENSO SOLO PERCHE&#039; erano premade, o semplicemente perch&egrave; chiedevo o scrivevo educatamente qualcosa. \r\n\r\nHO SEMPRE RISPOSTO AGLI INSULTI DOPO, SEMPRE (CONTROLLATE PURE) e mai ripeto, MAI, INIZIATO AD INSULTARE O TROLLATO UNA PARTITA, MAI.\r\n\r\nIo non so nemmeno pi&ugrave; cosa dire, so gi&agrave; cosa mi verr&agrave; risposto e mi viene da ridere, perch&egrave; la fottuta verit&agrave; &egrave; che &egrave; una community impregnata di ragazzini di 16 anni viziati come principi che non hanno il minimo senso dell&#039;educazione, di responsabilit&agrave;  o del rispetto verso il prossimo.\r\n\r\nNon vi chiedo di essere sbannato perch&egrave; so bene che non accadr&agrave; e da un lato forse &egrave; meglio cos&igrave;, visto che avevo speso un sacco di soldi (PERCH&eacute; questo gioco mi piaceva) per entrambi e non intendo farmi rubare ancora un solo euro. Perch&egrave; se il sistema di bann potesse parlare ora sarebbero fuori dai coglioni quei 4 idioti che mi hanno flammato tutto il game e non io, loro ora si stanno facendo un&#039;altra rank ridendo ed insultando qualche altro povero cristo che o si prende dei calmanti o verr&agrave; bannato come il sottoscritto.\r\n\r\nE&#039; una strage, lasciate liberi i polli e sparate ai falchi, complimenti.\r\n\r\nFate qualcosa non tanto per me ma per i giocatori onesti in futuro, perch&egrave; cos&igrave; &egrave; davvero uno schifo, sembra di vivere le invasioni barbariche di nabbi e troll incontrastati. Credetemi non scherzo, non ho MAI preso sotto gamba una partita, MAI feddato, MAI TROLLATO. MAI.\r\n\r\nBANNATO PERMANENTEMENTE 2 VOLTE, PERCHE&#039; MI SONO DIFESO.\r\n\r\nGG.","replies":[{"poster":"SirZeel","date":"2016-04-11T22:13:09.480+0000","up_votes":3,"down_votes":0,"body":"Se la prima volta ti hanno bannato per motivo X, perché hai commesso di nuovo l'azione X?","replies":[{"poster":"WuSen","date":"2016-04-11T22:26:56.146+0000","up_votes":1,"down_votes":0,"body":"Giusta osservazione amico mio, e la risposta è che non c'è l'ho fatta a farmi sputare in faccia ed insultare senza motivo o da persone che avevano palesemente torto. E' come se ti tampono la macchina tu esci e mi dici \"scusa ma cosa fai? \" ed io inizio ad imprecare ad insultarti e chiamo i carabinieri, e loro cosa fanno? arrestano te? Metaforicamente è successa la stessa cosa.","replies":[{"poster":"SirZeel","date":"2016-04-11T22:29:47.624+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=WuSen,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=00010000,timestamp=2016-04-11T22:26:56.146+0000)\n>\n> Giusta osservazione amico mio, e la risposta è che non c&#x27;è l&#x27;ho fatta a farmi sputare in faccia ed insultare senza motivo o da persone che avevano palesemente torto. E&#x27; come se ti tampono la macchina tu esci e mi dici &quot;scusa ma cosa fai? &quot; ed io inizio ad imprecare ad insultarti e chiamo i carabinieri, e loro cosa fanno? arrestano te? Metaforicamente è successa la stessa cosa.\n\nArrestano entrambi, in teoria.\nPurtroppo l'unico modo per difendersi da certa gente è mute&report.","replies":[{"poster":"WuSen","date":"2016-04-11T22:36:16.640+0000","up_votes":1,"down_votes":0,"body":"E perchè dovrebbero se io ti ho tamponato e ti ho offeso solo perchè giustamente mi hai chiesto che ho fatto? i carabinieri dovrebbero portar via a me e tutelare te.\n\nComunque anche se li ignori o non rispondi ti reportano, ti reportano. Quindi paradossalmente non viene bannato qualcuno che senza scrivere una sola parola in chat (che se esiste andrebbe usata per comunicare) inizia a fiddare e trollare non verrà mai bannato perchè non ha scritto nulla? capisci l'idiozia della cosa? ci vuole per forza qualcuno \"cosciente\" che gestisca la cosa.","replies":[{"poster":"SirZeel","date":"2016-04-11T22:38:01.748+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=WuSen,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=0001000000000000,timestamp=2016-04-11T22:36:16.640+0000)\n>\n> E perchè dovrebbero se io ti ho tamponato e ti ho offeso solo perchè giustamente mi hai chiesto che ho fatto? i carabinieri dovrebbero portar via a me e tutelare te.\n\nInsultare è un reato. Se lo faccio perché provocato o perché sono stronzo, continua a rimanere reato.","replies":[{"poster":"WuSen","date":"2016-04-11T22:44:26.421+0000","up_votes":1,"down_votes":0,"body":"Mi dispiace non la penso così, se per legittima difesa è giusto difendersi, anche verbalmente.\nE' giusto essere educati quanto non esserlo quando si riceve un'ingiustizia per primi e senza aver fatto alcun che per causarla.\n\nE' meglio essere guerrieri in un giardino che giardinieri in guerra. \n\nNon ti sto dando contro ma semplicemente dicendo che per quanto la visione della community o la politica che sta tentando di perseguire è un'utopia. Perchè se non rispondi ti reportano e si incazzano lo stesso perchè li ignori, se rispondi di reportano, insomma, è inevitabile.","replies":[{"poster":"SirZeel","date":"2016-04-11T22:48:35.157+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=WuSen,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=000100000000000000000000,timestamp=2016-04-11T22:44:26.421+0000)\n>\n> Mi dispiace non la penso così, se per legittima difesa è giusto difendersi, anche verbalmente.\n\nAmico mio, io posso anche essere d'accordo con te, ma qui non stiamo parlando di opinioni.\nQuello che ti sto dicendo io è come funziona la legge, indipendentemente dal proprio credo personale.","replies":[{"poster":"WuSen","date":"2016-04-11T23:11:20.166+0000","up_votes":1,"down_votes":0,"body":"Parli come se la legge non la facessero le persone, io non ho detto che non ho sbagliato, avrei potuto stringere i denti ed ingoiare la merda dicendo che era buona. Ma non ci riesco, non ci riesco a subire qualcosa e pagare io, non è giusto. Questa \"legge\" come la chiami tu non è sensata ne giusta, ma una decisione fatta alla veloce ed economica. so bene che cambia poco e che ormai sono bannato ma, amen, so di non aver fatto niente di male, a parte difendermi, siamo persone non macchine. \nQuel che so è che dopo 4 anni che gioco mi son visto bannare due volte ed in entrambi i casi i report che ho ricevuto sono stati praticamente tutti fatti da parte di persone che per un motivo o per un altro volevano avere ragione pur avendo sbagliato, o fare le prepotenti o più semplicemente trollare.\n\nIo non ho mai trollato, mai andato afk, mai flammato per primo, la mia \"colpa\" è stata di aver perso la pazienza dopo la quarta cazzo di rank che trovavo qualcuno afk, un troll che si divertiva, o qualsiasi altri diavoleria siano in grado di combinare questa orda di ragazzi senza rettitudine, perchè è un gioco siamo tutti daccordo, non c'è problema, non sono questi i problemi nella vita. \n\nMa c'è una legge (e questa non è umana) che dice \"come in alto così in basso\", si capisce come è fatta una persona anche dalle piccole cose, e questo gioco è intriso di pezzi di merda che andrebbero presi a pedate nel culo perchè si divertono a fare incazzare gli altri, poi li reportano, ed il programma di ban come un cieco obbedisce.\n\nSapevo che la fortuna fosse bendata, non la giustizia.","replies":[{"poster":"Kopoo","date":"2016-04-12T07:43:08.149+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WuSen,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=00010000000000000000000000000000,timestamp=2016-04-11T23:11:20.166+0000)\n>\n> Parli come se la legge non la facessero le persone, io non ho detto che non ho sbagliato, avrei potuto stringere i denti ed ingoiare la merda dicendo che era buona. Ma non ci riesco, non ci riesco a subire qualcosa e pagare io, non è giusto. Questa &quot;legge&quot; come la chiami tu non è sensata ne giusta, ma una decisione fatta alla veloce ed economica. so bene che cambia poco e che ormai sono bannato ma, amen, so di non aver fatto niente di male, a parte difendermi, siamo persone non macchine. \n\nE' qui che sbagli, tu non devi subire e pagare, ti bastava semplicemente mutare chi ti stava insultando e reportarlo a fine partita. Tu non ti ritroveresti con l'account permabannato, mentre lui sì.\n\n> Quel che so è che dopo 4 anni che gioco mi son visto bannare due volte ed in entrambi i casi i report che ho ricevuto sono stati praticamente tutti fatti da parte di persone che per un motivo o per un altro volevano avere ragione pur avendo sbagliato, o fare le prepotenti o più semplicemente trollare.\n\nIl sistema non conta il numero di report, possono anche segnalarti in 200, ma se non hai infranto il regolamento non vieni punito. E se permetti, per esserti fatto permabannare per 2 volte, qualcosa avrai sicuramente combinato.\n\n> Io non ho mai trollato, mai andato afk, mai flammato per primo, la mia &quot;colpa&quot; è stata di aver perso la pazienza dopo la quarta cazzo di rank che trovavo qualcuno afk, un troll che si divertiva, o qualsiasi altri diavoleria siano in grado di combinare questa orda di ragazzi senza rettitudine, perchè è un gioco siamo tutti daccordo, non c&#x27;è problema, non sono questi i problemi nella vita. \n\nTi capisco e mi dispiace, anche a me certe volte capita di perdere la pazienza, ma dopo 3 e passa anni di gioco, ho capito che non ne vale la pena. Se qualcuno mi infastidisce, cosa che per fortuna capita raramente, lo ignoro, oppure gli mando un \":)\" in chat o una risata col champion.\nSe rispondi al loro flame, fai solamente il loro gioco e, come in questo caso, quello che ci rimette sei tu.\n> Ma c&#x27;è una legge (e questa non è umana) che dice &quot;come in alto così in basso&quot;, si capisce come è fatta una persona anche dalle piccole cose, e questo gioco è intriso di pezzi di merda che andrebbero presi a pedate nel culo perchè si divertono a fare incazzare gli altri, poi li reportano, ed il programma di ban come un cieco obbedisce.\n\nCome ti ho già scritto, tu stesso hai ammesso di aver flammato, il motivo per il quale lo hai fatto non ha importanza, hai comunque infranto il regolamento e il sistema prevede una punizione.\n\n> Sapevo che la fortuna fosse bendata, non la giustizia.","replies":[{"poster":"WuSen","date":"2016-04-12T09:00:11.368+0000","up_votes":1,"down_votes":0,"body":"Hai ragione ed infatti so bene che non avrei dovuto reagire, probabilmente non vado bene per questo gioco ma credimi, sono una brava persona, un giocatore onesto e mi sono impegnato tanto. Dopo la 10° rank rovinata (perchè te la rovinano letteralmente) per troll, afk, feed, gente che leava appena fa 0 1 0, gente che non ganka e ride e ti lascia morire.. e tutto il resto, E NON CONTENTI TI INSULTANO LORO, io le prime due o tre partite ho resistino ma poi non ho retto, errore mio.. ma per me è fondamentale chi comincia a trattare male qualcuno, perchè se no non si fa distinzione tra legittima difesa ed aggressione. Io accetto di essere stato bannato e mi prendo le mie responsabilità, sto solo dicendo come la penso e che secondo me questa è stata un'ingiustizia, perchè dovrebbero bannare i maleducati ed i troll, non chi si incazza per colpa loro, dovrei esser stato protetto e  non bannato, va bene mutare la gente, ma che tolgano la chat allora.. che senso ha?","replies":[]}]}]}]}]},{"poster":"kernel panic","date":"2016-04-12T06:51:41.566+0000","up_votes":1,"down_votes":0,"body":"Dovresti imparare meglio la legge.\n\nPer l'ingiuria, poichè questa è la fattispecie dell'\"insulto\", non è previsto l'arresto nè tantomento il fermo se non ricordo male.\n\nIn più credo che il reato di ingiuria sia stato dequalificato a mero illecito civile, quindi come tale puoi rivalerti solo tramite un azione civile.","replies":[{"poster":"SirZeel","date":"2016-04-12T12:37:32.041+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tempus Frangit,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=000100000000000000000001,timestamp=2016-04-12T06:51:41.566+0000)\n>\n> Dovresti imparare meglio la legge.\n> \n> Per l&#x27;ingiuria, poichè questa è la fattispecie dell&#x27;&quot;insulto&quot;, non è previsto l&#x27;arresto nè tantomento il fermo se non ricordo male.\n> \n> In più credo che il reato di ingiuria sia stato dequalificato a mero illecito civile, quindi come tale puoi rivalerti solo tramite un azione civile.\n\nSicuramente è come dici tu, non ho studiato legge e non ne so niente,\nVedo però che non hai afferrato il concetto.","replies":[]},{"poster":"Floppyz","date":"2016-04-12T07:36:57.849+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tempus Frangit,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=000100000000000000000001,timestamp=2016-04-12T06:51:41.566+0000)\n>\n> Dovresti imparare meglio la legge.\n> \n> Per l&#x27;ingiuria, poichè questa è la fattispecie dell&#x27;&quot;insulto&quot;, non è previsto l&#x27;arresto nè tantomento il fermo se non ricordo male.\n> \n> In più credo che il reato di ingiuria sia stato dequalificato a mero illecito civile, quindi come tale puoi rivalerti solo tramite un azione civile.\n\nÈ stata depenalizzata in questi ultimi mesi (un po' come la bestemmia), e ad oggi quindi costituisce unicamente illecito civile ex art. 4, comma 1 lettera a, del D.Lgs n. 7 del 15 Gennaio 2016). **Viene punita quindi con la semplice sanzione pecuniaria**.\n\nTornando al topic, io posso capire la frustrazione per aver ricevuto una punizione avendo reagito a delle provocazioni, ma come ti hanno già fatto notare, il punto è proprio questo: **hai reagito**.\n\nPer tornare quindi agli esempi, se tizio mi tampona, e non contento dopo mi fa pure saltare per aria l'auto (GTA docet), e io per rappresaglia faccio lo stesso con la sua, _incredibilmente_ le forze dell'ordine ci sbattono entrambi in galera, visto che **siamo entrambi rei**.\n\nÈ poco logico? Se vuoi. Non ti piace? Va bene. Ma il diritto, almeno in occidente, **funziona così: chiunque vìoli le regole viene punito**, e nulla da diritto ad alcuna rivalsa diretta su chi ha violato i propri diritti, per questo ci sono gli organi competenti (la giustizia e le forze dell'ordine nell'esempio che ho fatto, e Riot nel tuo caso), **non puoi farti giustizia da solo**, perché non siamo nel far west, e se lo fai comunque vieni punito, com'è normale che sia.","replies":[{"poster":"WuSen","date":"2016-04-12T09:06:02.324+0000","up_votes":1,"down_votes":0,"body":"Ragazzi era una metafora non scherziamo per cortesia, le metafore servono apposta per rappresentare situazioni logiche simili. \n\nRipeto io mi tengo il ban e mi prendo le mie responsabilità, ma avrei dovuto essere tutelato e non bannato, perchè non fanno che il programma rileva IL PRIMO che scrive qualche insulto, adesso sarei stato ancora dentro e sarebbero stati bannati loro. \n\nIo capisco cosa intendi ed hai ragione, ma chi tutela me come giocatore da decine e decine di ranked piene di persone che si divertono letteralmente a stuzzicarti o farti dispetti portando la partita a diventare praticamente 40 minuti di tortura cinese.. questo per 4 o 5 volte di fila. Che ripuliscano il gioco da sta gente, e non da quelli come me che REAGISCONO. Prima loro, poi se mai quelli come me, che rispondono al fuoco, magari sbagliando, ma rispondono, non iniziano a sparare.","replies":[]},{"poster":"kernel panic","date":"2016-04-12T08:55:49.017+0000","up_votes":1,"down_votes":0,"body":"Allora ricordavo bene.\n\nAlla fine è l'esempio che hanno portato che è sbagliato.\n\nAnche il concetto di legittima difesa secondo me molti lo confondono, ma vabbeh :D","replies":[]},{"poster":"WuSen","date":"2016-04-12T08:55:15.727+0000","up_votes":1,"down_votes":0,"body":"Ragazzi era una metafora non scherziamo per cortesia, le metafore servono apposta per rappresentare situazioni logiche simili.","replies":[]}]}]}]},{"poster":"kernel panic","date":"2016-04-12T06:49:43.885+0000","up_votes":1,"down_votes":0,"body":"Esempio del cavolo. Per un tamponamento e degli insulti non arrestano nessuno :D","replies":[]}]}]},{"poster":"AnDGames","date":"2016-04-12T10:46:34.708+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WuSen,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=00010000,timestamp=2016-04-11T22:26:56.146+0000)\n>\n>  ...come se ti tampono la macchina tu fai manovra e lo ritamponi per ripicca...\n\necco il paragone corretto","replies":[]}]}]},{"poster":"Frattaglia","date":"2016-04-12T07:23:57.251+0000","up_votes":1,"down_votes":0,"body":"Ci potresti copiare la mail che ti è arrivata?\n\nE comunque il discorso che fanno gli altri è valido... se due litigano e si picchiano (si insultano) vengono fermati entrambi. Ti hanno già bannato una volta per questo motivo, dovresti aver imparato a mutare i cretini invece di abbassarti al loro livello.","replies":[{"poster":"WuSen","date":"2016-04-12T09:10:21.834+0000","up_votes":1,"down_votes":0,"body":"Vero, e mi prendo le mie responsabilità, ma devo diventare disumano io e non provare emozioni anche se ho ragione? o sarebbe più ragionevole creare un sistema dove il primo stronzo che insulta, SOLO IL PRIMO CHE COMINCIA, venga cacciato a calci in culo?\n\nA me sembra così naturale, è normale difendersi, e ripeto DIFENDERSI, dopo che vedi che per la 4° ranked di fila non trovi un team normale, che vinca o perda non importa, ma almeno normale.","replies":[{"poster":"Frattaglia","date":"2016-04-12T09:42:43.869+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WuSen,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=00080000,timestamp=2016-04-12T09:10:21.834+0000)\n>\n> Vero, e mi prendo le mie responsabilità, ma devo diventare disumano io e non provare emozioni anche se ho ragione? o sarebbe più ragionevole creare un sistema dove il primo stronzo che insulta, SOLO IL PRIMO CHE COMINCIA, venga cacciato a calci in culo?\n> \n> A me sembra così naturale, è normale difendersi, e ripeto DIFENDERSI, dopo che vedi che per la 4° ranked di fila non trovi un team normale, che vinca o perda non importa, ma almeno normale.\n\nSai cosa succede quando rispondi? Spesso si crea un'escalation.\n\nEsempio\nTizio 1 (quello che inizia): sei un nabbo\nTizio 2 (quello che risponde): sei un coglione\nTizio 1 : mavaffanculo\nTizio 2: insulti vari sulla mamma\n\nCome fai a dire che il secondo non è in torto quanto il primo? \nNel mondo reale, se tiri un pugno a uno, anche se non sei stato tu a iniziare e l'altro te ne ha tirato un altro prima, la polizia ferma entrambi. \n\nQuindi si, se rispondi finisci nel torto quanto chi ha iniziato.\n\np.s. idiot, moron e \"report my team\". Ti hanno già bannato un account, l'avresti dovuto capire no?","replies":[{"poster":"WuSen","date":"2016-04-12T09:49:04.519+0000","up_votes":1,"down_votes":0,"body":"Nel mondo reale se sto passeggiando e uno mi da un cazzotto senza motivo ed arriva la polizia e ci trova che facciamo a pugni ferma entrambi ok, ma dopo testimonianze ed indagini se capisce che non ho fatto nulla per ingaggiare un litigio e mi stavo facendo i cavoli miei perdonami ma mi lasciano andare e tengono il malintenzionato dentro, non me.","replies":[{"poster":"Floppyz","date":"2016-04-12T10:59:08.070+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=WuSen,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=0008000000010000,timestamp=2016-04-12T09:49:04.519+0000)\n>\n> Nel mondo reale se sto passeggiando e uno mi da un cazzotto senza motivo ed arriva la polizia e ci trova che facciamo a pugni ferma entrambi ok, ma dopo testimonianze ed indagini se capisce che non ho fatto nulla per ingaggiare un litigio e mi stavo facendo i cavoli miei perdonami ma mi lasciano andare e tengono il malintenzionato dentro, non me.\n\nÈ diverso: se ti menano e non ti difendi finisci male, se invece ti insultano e li muti non succede niente.\n\nPer tenere il tuo esempio, è come se quello ti desse un cazzotto, e tu avessi un pulsante per addormentarlo istantaneamente (e poi chiamare la polizia), ma anziché usarlo, lo prendi a tua volta a cazzotti.\n\nScommettiamo che la prima cosa che fa la polizia è portare via anche te, perché potevi far finire tutto semplicemente pigiando quel bottone, mentre **hai scelto**, per vendetta, spirito di giustizia o quel che vuoi, di rendergli la pariglia?","replies":[]},{"poster":"WuSen","date":"2016-04-12T09:49:30.158+0000","up_votes":1,"down_votes":0,"body":"Ho capito, certo che capisco, ma non è giusto.","replies":[]}]}]},{"poster":"WuSen","date":"2016-04-12T09:28:28.925+0000","up_votes":1,"down_votes":0,"body":"Ecco la mia chat, dove puoi notare chiaramente che prima di scrivere qualunque cosa ho scritto \"dont worrie\" \"stop flame\" e il primo insulto che mi scappa è im 1 3 idiots perchè i furboni in 3 mi stavano insultando ed andando mad, mi hanno schiacciato psicologicamente per tutto il game, e ripeto, semplicemente perchè ho fatto 0 2 0 contro lb ed avevo annie mid, a fine partita ero 4 4 6 e non 0 10 0. Non avevano alcun motivo, sono stato bannato permanentemente per essermi difeso, DIFESO.\n\n\nwtf\ncan i?\nty\nguys i need help mid\ndont worrie\nshe tp\nnever\nstop flame\ni pinged\njarvan next time come pls\nthey were 3\nno lol just say \"yes sry\"\nlol\nim 1 3 idiots\nim not 0 7 0\nstop blame me and use brain\nyou are not doing better\ni do\ni just miss 1 ss top\ni said you to come when you see bot 1 vs 4\n1 vs 3\ni got stun and he cc\nwe can 2 vs 4\n3\ni pinged\nshe roam idiot\nstop be brainless and look yoursefl\nim 1 3 1 moron\nnot 0 80\nis me now?\nreport\nfu\ngnar not me\nand you all fuking flame me\nwhere is adc?\npls report my full team for flame all time and toxic ty\nyeah\ni just ask where you are\nduring teamfight\nand you flame\nsee??\nyou continue\nand the truth were that you are not with team too\nill just will do my best and ill stop talk, next time when your mid fall in 0 2 0 dont flame and help\nim ok\nthis toxic boy <3\nnice move jarvy :3","replies":[{"poster":"WuSen","date":"2016-04-12T09:34:53.178+0000","up_votes":1,"down_votes":0,"body":"\"l'account  è  stato sospeso permanentemente dopo un'indagine approfondita sui comportamenti in gioco nelle recenti partite a League of Legends.\"\n\nAvessero \"APPROFONDITO ATTENTAMENTE\" si sarebbero accorti che sono stato aggredito ed ho subito io un maltrattamento da parte di giocatori indisciplinati, non il contrario.","replies":[]}]}]}]},{"poster":"Dr LouD","date":"2016-04-11T23:33:38.738+0000","up_votes":3,"down_votes":1,"body":"Quindi in 4 anni non hai ancora capito che i flamer si mutano al primo di stfu noob?","replies":[{"poster":"WuSen","date":"2016-04-11T23:36:38.919+0000","up_votes":1,"down_votes":0,"body":"Fatto, ti reportano cmq.","replies":[{"poster":"Keìron","date":"2016-04-12T05:37:05.432+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=WuSen,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=00030000,timestamp=2016-04-11T23:36:38.919+0000)\n>\n> Fatto, ti reportano cmq.\n\nse ti reportano ma tu non hai fatto nulla per il sistema quei report valgono zero. E comunqur tu hai reportato i 3 flamer di quella partita?","replies":[{"poster":"WuSen","date":"2016-04-12T09:15:18.200+0000","up_votes":1,"down_votes":0,"body":"Certo ma sono permabannato, il game avrebbe dovuto constatare che effettivamente sono stato aggredito per primo e che mi sono semplicemente difeso cercando di farli ragionare e rassicurandoli, non hanno ascoltato ed ho passato 40 minuti sotto una pioggia di ping ed insulti, anche un santo si sarebbe incazzato.","replies":[{"poster":"Whommy","date":"2016-04-12T10:50:04.254+0000","up_votes":2,"down_votes":0,"body":"Non dovevi abbassarti al loro livello, al primo flame si muta e reporti a fine partita.\nSe sei arrivato al perma come ti hanno già detto questo \"errore\" lo hai fatto spesso...","replies":[]}]}]},{"poster":"Dr LouD","date":"2016-04-11T23:39:14.056+0000","up_votes":2,"down_votes":0,"body":"E quindi? Report con valore 0\n\nE comunque non dire \"fatto\" se tu stesso hai ammesso di aver perso le staffe al decimo stfu noob\n\nVuol dire non solo che non li hai mutati, ma ti sei abbassato al loro livello\n\nChi flamma,anche di risposta, è nel torto","replies":[{"poster":"WuSen","date":"2016-04-12T09:13:41.023+0000","up_votes":1,"down_votes":0,"body":"Ripeto non la penso così, chi si difende si sta difendendo, se non volevano insulti bastava essere educati come ho inizialmente tentato di fare io. Loro hanno iniziato a creare questa situazione fottendosene altamente, e loro dovrebbero essere puniti, non chi si difende.","replies":[{"poster":"Dr LouD","date":"2016-04-12T10:09:12.396+0000","up_votes":1,"down_votes":0,"body":"Loro saranno sicuramente puniti\n\nEd è sicuro anche il fatto che essendo un permaban, non è la prima volta che hai questi atteggiamenti. Tra l'altro bannato per ben 2 volte\n\nRispondendo all'offesa ti dimostri solo stupido quanto chi offende.\n\nNon hai mai pensato che le persone hanno questo atteggiamento unicamente per provocare, e tu come un pollo ci caschi sempre? Non pensi che è più dignitoso ed intelligente ignorare questi comportamenti e lasciarli parlare da soli?","replies":[]}]}]}]}]},{"poster":"Floppyz","date":"2016-04-12T09:25:37.399+0000","up_votes":1,"down_votes":0,"body":"Vedi, non è questione di non provare emozioni, ma non devi reagire, perché se reagisci ti prendi il rischio di essere punito, e mi sembra pure che questo concetto ti sia ben chiaro, quindi si tratta solo di avere autocontrollo.\n\nPeraltro in questo caso, non puoi neanche parlare propriamente di difesa, perché per difenderti sarebbe stato sufficiente mutarli, invece sei passato al contrattacco, che è una cosa diversa.\n\nSe ti fossi limitato a segnalare quei giocatori (sì lo so, è difficile perché a volte ti fanno proprio ammattire), tu di sicuro non saresti stato punito, mentre loro sì (questo non vuol dire che non siano stati comunque puniti).\n\nIl problema è che in società e nei giochi, si accettano delle regole, che spesso prevedono, come dicevo prima, che tu non ti faccia giustizia da te, anche se hai ragione, ma ti rivolga agli enti preposti, che attraverso determinati strumenti risolvono il problema alla radice.\n\nÈ come se qualcuno ora ti insultasse qui sul forum: se rispondi agli insulti vi beccate entrambi un ban appena i moderatori se ne accorgono, se invece lo segnali il ban se lo becca solo l'altro :)\n\nPensaci su.","replies":[{"poster":"WuSen","date":"2016-04-12T09:32:48.874+0000","up_votes":1,"down_votes":0,"body":"Hai ragione non sono riuscito a trattenermi, e lo so, accetto il ban, l'unica cosa amara, davvero amara da dover accettare è il fatto che NON ho iniziato io. Questo è molto importante per me, e ripeto, io capisco tutto perchè ovviamente per te sono un estraneo, ma credimi se mi conoscessi ora saresti incazzato anche te, perchè non me lo merito davvero. Grazie per avermi risposto..","replies":[{"poster":"Floppyz","date":"2016-04-12T09:43:56.114+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=WuSen,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=000b0000,timestamp=2016-04-12T09:32:48.874+0000)\n>\n> Hai ragione non sono riuscito a trattenermi, e lo so, accetto il ban, l&#x27;unica cosa amara, davvero amara da dover accettare è il fatto che NON ho iniziato io. Questo è molto importante per me, e ripeto, io capisco tutto perchè ovviamente per te sono un estraneo, ma credimi se mi conoscessi ora saresti incazzato anche te, perchè non me lo merito davvero. Grazie per avermi risposto..\n\nGuarda, anche se non ti conosco, io capisco quello che stai dicendo e di certo non ti giudico come persona, sulla base di una chat di LOL.\n\nHo solo astratto la questione, puntualizzando che (come quando due fratellini litigano e i genitori li beccano) non importa chi ha iniziato: chi vìola il codice degli evocatori viene punito, anche se sta solo rispondendo a tono a gente che lo insulta per un'ora. Questo vuol dire che sei costretto a leggerli e subire? Assolutamente no: al primo insulto gli chiedi di piantarla, al secondo li muti e li segnali, e questi o cominciano a rigare dritto o si ritrovano loro con un bel permaban.\n\nTutto qui, non è mia intenzione infierire visto che già perdere l'account dev'essere un bel colpo.","replies":[]}]}]},{"poster":"Chroniicles","date":"2016-04-12T07:41:05.251+0000","up_votes":2,"down_votes":0,"body":"Ciao, è sacrosanto che in caso tu subisca abusi da altri player tu debba difenderti. Il problema è che lo hai fatto nel modo sbagliato. Se come nel tuo caso qualcuno ti importuna ripetutamente rovinando la tua esperienza di gioco, puoi mutarlo e reportarlo a fine game... non sei in alcun modo legittimato a metterti a flammare anche tu. Il fatto che abbia iniziato qualcun'altro non ti rende migliore di loro e il primo ban avrebbe dovuto fartelo capire.\nInoltre, un ban permanente non viene preso alla leggera, avrai sicuramente ricevuto altre punizioni prima di questa e non hai comunque corretto il tuo comportamento.\nSe reputi che il tuo comportamento non sia stato così tossico, postaci gentilmente la chat log della partita (arrivata via mail con l'avviso di ban) così che possiamo farti una valutazione più accurata su quanto accaduto","replies":[{"poster":"WuSen","date":"2016-04-12T08:54:00.165+0000","up_votes":1,"down_votes":0,"body":"Certo ecco a te, basta leggere per capire.\n\nwtf\ncan i?\nty\nguys i need help mid\ndont worrie\nshe tp\nnever\nstop flame\ni pinged\njarvan next time come pls\nthey were 3\nno lol just say \"yes sry\"\nlol\nim 1 3 idiots\nim not 0 7 0\nstop blame me and use brain\nyou are not doing better\ni do\ni just miss 1 ss top\ni said you to come when you see bot 1 vs 4\n1 vs 3\ni got stun and he cc\nwe can 2 vs 4\n3\ni pinged\nshe roam idiot\nstop be brainless and look yoursefl\nim 1 3 1 moron\nnot 0 80\nis me now?\nreport\nfu\ngnar not me\nand you all fuking flame me\nwhere is adc?\npls report my full team for flame all time and toxic ty\nyeah\ni just ask where you are\nduring teamfight\nand you flame\nsee??\nyou continue\nand the truth were that you are not with team too\nill just will do my best and ill stop talk, next time when your mid fall in 0 2 0 dont flame and help\nim ok\nthis toxic boy <3\nnice move jarvy :3","replies":[{"poster":"WuSen","date":"2016-04-12T09:19:12.933+0000","up_votes":1,"down_votes":0,"body":"Come puoi leggere la mia conversazione non inizia con \"stfu\" or \"noob\" or \"i fuck your mother noob\" o qualsiasi altro insulto, rispondo DOPO e ripeto DOPO che vedo che ho davanti delle capre che hanno deciso di rendermi la vita un inferno nel game. (0 gank, pingaggio infernale, spam di insulti ad ogni minimo errore). Mi sono difeso, ma loro erano tutti insieme e mi hanno bannato, ora ti assicuro che se ci fosse stato un arbitro o un elemento esterno ad osservare la partita io adesso sarei stato onorato e non bannato, credimi.","replies":[{"poster":"WuSen","date":"2016-04-12T09:23:25.539+0000","up_votes":1,"down_votes":0,"body":"is me now?\nreport\nfu\n\nQui praticamente sono andati in paranoia nevrotica perchè ero 0 2 0 in early game ed hanno perso un teamfight bot (dove io non ero presente). Hanno iniziato ad insultarmi dicendo che era colpa mia comunque, e che mi avrebbero reportato. Ora dico, son tenuto come giocatore a dover sopportare ore ed ore di imbecilli simili porgendo l'altra guancia o il gioco dovrebbe tutelarmi? invece di bannare persone praticamente senza capire alcuna situazione. Io voglio solo far riflettere su questo, non sono stupido lo so che avrei dovuto non reagire secondo le regole, ma che regole sono? va punito il primo stronzo che comincia a trollare, insultare, feddare, e non la vittima che con più o meno pazienza cerca di difendersi.. dai.","replies":[]}]}]}]},{"poster":"Darkinknight","date":"2016-04-12T00:39:14.956+0000","up_votes":2,"down_votes":0,"body":"Povero programmatore del tasto mute..tanto lavoro per nulla 😞","replies":[{"poster":"WuSen","date":"2016-04-12T09:12:33.385+0000","up_votes":1,"down_votes":0,"body":"TAnto vale che tolgono la chat.","replies":[{"poster":"Darkinknight","date":"2016-04-12T22:58:16.316+0000","up_votes":1,"down_votes":0,"body":"Puoi semplicemente mutare tutti a inizio partita se non sei in grado di farlo quando ti offendono..pure a me quando mi flammano rispondo a tono,o muto,dipende se la partita è fattibile vincerla..ma se ricevessi una punizione saprei che è colpa mia..non avendo preso nemmeno una chat ristretta so che per ora posso permettermelo,ma se fossi a rischio ban mute all inizio game lo farei obbligatoriamente..la legittima difesa ( per come poi avrai notato in italia non viene manco applicata come dovrebbe ma va beh) non fa testo a queste situazioni..il tizio non ti ha accoltellato,o picchiato..non eri in una situazione di pericolo che giustificasse la legittima difesa..un figlio di biip che fa i biip,non ti mette in pericolo..ergo la tua reazione (pure comprendendola) non è giustificabile","replies":[]},{"poster":"Dr LouD","date":"2016-04-12T10:10:35.839+0000","up_votes":1,"down_votes":0,"body":"La chat serve per direttive di gioco, non per fare le ochette del corso e punzecchiarsi a vicenda\n\nQualsiasi uso della chat oltre quello di dare indicazioni esclusivamente di GIOCO è punibile come abuso della chat, c'è l'apposito report","replies":[]}]}]},{"poster":"Demigod Summoner","date":"2016-04-11T22:32:50.956+0000","up_votes":2,"down_votes":1,"body":"> Ed in questi anni non è mai esistita (controllate pure) una sola partita in cui io abbia trollato o feedato intenzionalmente o sia andato afk. \n\nTi sei perso il meglio del gioco!","replies":[{"poster":"WuSen","date":"2016-04-11T22:46:44.160+0000","up_votes":1,"down_votes":0,"body":"Probabilmente hai ragione.","replies":[]}]},{"poster":"AnDGames","date":"2016-04-12T10:44:55.933+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WuSen,realm=EUW,application-id=98NGV4Al,discussion-id=H9vk7ute,comment-id=,timestamp=2016-04-11T21:39:45.454+0000)\n>\n> \n> HO SEMPRE RISPOSTO AGLI INSULTI\n> \n\nQuindi lo sai perchè sei stato bannato. \nOra dipende da te: o ti adatti o ciao e al prossimo ban.","replies":[]},{"poster":"TheAntuanello","date":"2016-04-12T08:43:24.423+0000","up_votes":1,"down_votes":0,"body":"Se ti hanno bannato due volte io credo che te lo sia meritato. Capisco una volta ma due, dai è impossibile. Fatti un terzo account, cosa ti devo dire?","replies":[{"poster":"WuSen","date":"2016-04-12T09:12:09.538+0000","up_votes":1,"down_votes":0,"body":"La prima volta è stata per cause uguali a quella che ho descritto. \nLa seconda ho cominciato tentando di non rispondere a nessuno, \nma credimi dopo 4 o 5 ore che ti trovi tutto sto schifo addosso e tutta sta gente che insulta io non sono gesù.\n\nPoi oh, a me non sembra tanto ovvio trattare chi e' difeso come chi ha aggredito, anzi il perma ban me lo sono preso io perchè i furbetti erano tutti daccordo.","replies":[]}]}]}