{"poster":"Omnom1202","date":"2018-03-22T23:41:56.605+0000","title":"Jogos permaban?","subforum":"Segítség és támogatás","up_votes":3,"down_votes":13,"body":"Sz&oacute;val, ma perma bannt kaptam &eacute;s nem igaz&aacute;n &eacute;rzem hogy jogosan kaptam bant mivel a k&eacute;t chatlogban amit hozz&aacute; fűztek nincs se flamel&eacute;s se semmi bomlaszt&oacute; (vagyis nem hiszem h az flamel&eacute;s h megmondom a Rivennek hogy semmit se csin&aacute;lt &eacute;s maradjon cs&ouml;ndbe &eacute;s ne basztassa szerencs&eacute;tlen ahrinkat aki pr&oacute;b&aacute;lt neki seg&iacute;teni de ő ink&aacute;bb torony alarr kioktarra az enemy trundlet h broken champekkel ne j&aacute;tszom, vagy amikor a jax&uuml;nk le autist&aacute;zik meg hasonl&oacute;k mert nem sokat &eacute;rt&uuml;nk 3v2be boton majd &iacute;rom neki h bant fog kapni ha folytatja a flamel&eacute;st plussz végig spammelte a chatet hogy trollkodunk boton majd viccből kiírtam h run it down de nem futottam le mert ha lefutottam volna azért kaptam volna bant)\n\nGame 1\nOmnom1202: WAT\nOmnom1202: THE FUCK\nOmnom1202: U STAND THERE\nOmnom1202: WHAAAT\nOmnom1202: THIS IS LOW GOLD\nOmnom1202: WHAT\nOmnom1202: never seen it in gold or lower elo\nOmnom1202: im just suprised\nOmnom1202: chill\nOmnom1202: i need 300 gold cause shyv took my red\nOmnom1202: and now i can buy my items\nOmnom1202: so i can kill shyv/fizz\nOmnom1202: im gonna camp mid\nOmnom1202: wait\nOmnom1202: omg\nOmnom1202: i need xp\nOmnom1202: u go in 2v1\nOmnom1202: what u want\nOmnom1202: winnable\nOmnom1202: im gonna gank bot\nOmnom1202: no\nOmnom1202: NO\nOmnom1202: HE GONNA GO\nOmnom1202: see?\nOmnom1202: report her\nOmnom1202: tipycal riven writing or afking\nOmnom1202: yea\nOmnom1202: look at bot\nOmnom1202: im gonna gank them so we dont loose 🙂\nOmnom1202: yea\nOmnom1202: stfu riven\nOmnom1202: u lost in 1v1\nOmnom1202: report Riven\nOmnom1202: for flaming and inting\nOmnom1202: flaming for the whole game\nOmnom1202: and doing literally nothing\nOmnom1202: if u flame im not gonna gank\nOmnom1202: Ahri went up\nOmnom1202: u was afk\nOmnom1202: 🙂\nOmnom1202: and thats why im still gold\nOmnom1202: cause of riven\nOmnom1202: (players)\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: QQ\nOmnom1202: Q\nOmnom1202: QQ\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: Q\nOmnom1202: LET ME FUCKING JUMP ON YOU\nOmnom1202: so toxic\nOmnom1202: HAHAH\nOmnom1202: ANY GANKS\nOmnom1202: u died in the first five mins\nOmnom1202: and ahri went to help you\nOmnom1202: u were standing under tower\nOmnom1202: u know that u gonna get banned?\nOmnom1202: its easy to blame others and hard to blame your self 🙂\nGame 2\nOmnom1202: no\nOmnom1202: tank\nOmnom1202: report Ahri jax Velkoz for flaming\nOmnom1202: troll premades\nOmnom1202: XAXA\nOmnom1202: getting camped on bot and u want us to not int\nOmnom1202: haha\nOmnom1202: well\nOmnom1202: riot will know the cure\nOmnom1202: ban u\nOmnom1202: im not inting not trolling\nOmnom1202: u r flaming\nOmnom1202: 1/1 adc\nOmnom1202: nah fam\nOmnom1202: oh shiet\nOmnom1202: splitpushing and farming??\nOmnom1202: ohno\nOmnom1202: ofc bro 🙂\nOmnom1202: im done with league of legends\nOmnom1202: im gonna run it down like T1\nOmnom1202: im trolling\nOmnom1202: sorry bro\nOmnom1202: jax says im trolling\nOmnom1202: Im not trolling at all\nOmnom1202: jax just Shittalking\nOmnom1202: yea please\nOmnom1202: im not trolling\nOmnom1202: 🙂\nOmnom1202: report jax","replies":[{"poster":"Nemin","date":"2018-03-23T14:25:33.008+0000","up_votes":6,"down_votes":2,"body":"Három ember írt neked több mint fél oldalas kommenteket. Én erre már nem fogok időt fordítani. Ha még mindig nem érted miért kaptál véglegest olvasd végig ismét ezeket.\nA fórummal kapcsolatban pedig, ha nem leszel hajlandó emberszámba venni a másikat, úgy nem leszel itt jóban senkivel se.\n---\n\n**A témát lezártam.**","replies":[]},{"poster":"Complex VN","date":"2018-03-22T23:50:18.004+0000","up_votes":9,"down_votes":3,"body":"Jogos.","replies":[]},{"poster":"Mind The Gap","date":"2018-03-23T08:58:12.489+0000","up_votes":6,"down_votes":3,"body":"Nem csak flamelésre lehet tiltást kapni. Egyébként itt van a [Terms of Use](https://eune.leagueoflegends.com/hu/legal/termsofuse#section5), amit elvileg elolvastál mielőtt elfoglaltad a játékba való regisztrációt.\n\n>#5.1. Trollkodhatok, sértegethetek, provokálhatok, fenyegethetek, zaklathatok másokat a Riot Szolgáltatások használata során? (Nem. Ha megteszed, az kitiltást vonhat maga után.)\n>\nA Riot Szolgáltatások használata során Ön köteles betartani az Ön lakóhelye szerinti ország hatályos jogszabályait és előírásait. Ezenkívül a Riot Szolgáltatások használatára vonatkozó, egyéb szabályoknak is meg kell felelnie („**Magatartási kódex**”). A Magatartási Kódex szabályait a teljesség igénye nélkül állítottuk össze, és fenntartjuk a jogot arra, hogy bármikor módosítsuk ezeket, továbbá, hogy a Riot Szolgáltatások integritásának és szellemének védelme érdekében megtegyük a szükséges büntető intézkedéseket, ami a felhasználói fiók megszüntetését is magában foglalhatja, tekintet nélkül arra, hogy a kifogásolt magatartás konkrétan szerepel-e tiltottként a szabályzatban. Kérjük, hogy a Magatartási Kódex mellett az Idézők kódexét is tanulmányozza át, mert ez további szabályokat fogalmaz meg a játék közbeni irányadó viselkedést illetően.\n>\nPéldák a büntető intézkedést maga után vonó magatartásra:\n>\n- Valaki olyan természetes személynek, üzleti vállalkozásnak vagy jogi személynek – beleértve a Riot Games alkalmazottját is – adja ki magát, vagy olyan módon kommunikál, hogy úgy tűnjön, mintha a Riot Games nevében nyilvánulna meg;\n- Saját maga vagy más felhasználó azonosítására alkalmas adatokat oszt meg a Weboldalon, illetve a Játék során;\n- Más felhasználót zaklat, háborgat vagy fenyeget a Játék során;\n- A Riot Gamesnek a Weboldalhoz, a Játékhoz és/vagy a Szoftverhez fűződő bármely szerzői jogát, védjegyét, szabadalmát vagy az annak egyéb tulajdonosi jogaira vonatkozó figyelmeztetéseket eltávolítja, megváltoztatja vagy elrejti. Ezenkívül tilos az olyan tartalmak küldése is, amelyek sértik vagy csorbítják mások jogait, ideértve a szabadalmakat, védjegyeket, üzleti titkokat, szerzői jogokat, a magánélet védelmének jogát, személyiségi jogokat vagy egyéb jogokat is;\n**- Sértőnek minősíthető tartalmat továbbít vagy közöl, ideértve a jogellenes, bántó, fenyegető, becsmérlő, zaklató, gyalázkodó, közönséges, obszcén, pornográf, nyíltan szexuális tartalmú, vagy a különböző embertípusok szempontjából, etnikailag, illetve más módon kifogásolható nyelvezet alkalmazását;**\n- Olyan vírust, sérült adatot, trójait, billentyűleütés-naplózó robotprogramot, programférget, „időzített bombát”, törlőprogramot vagy más olyan számítógépes programozási rutint magában foglaló tartalmat továbbít, vagy ennek továbbítását megkönnyíti, amelyet rendszer-, adat- vagy személyi információ károsítására, hátrányos megzavarására, titokban történő elfogására vagy adatbányászatára, eltávolítására vagy kisajátítására szántak és/vagy amely ténylegesen végre is hajtja ezt a károkozást;\n- Akár személyes, akár kereskedelmi célból kéretlen üzenetekkel zavarja a csevegőt azáltal, hogy a társalgás menetét a hozzászólásai ismétlésével megszakítja;\n- Részt vesz olyan cselekményben, amellyel becsapja a Játék bármely más felhasználóját, ideértve a megtévesztést vagy pszichológiai manipulációt is;\n- Külső fejlesztésű, illetéktelen programokat használ, úgymint pl. „mod”, „hack”, „cheat”, „script”, „bot”, „trainer”, illetve automatizáló programokat, amelyek bármilyen célból, bármely módon kapcsolatba lépnek a Szoftverrel, beleértve bármely idegen, illetéktelen programot, amely a Szoftver és a Riot Games közötti kommunikációt elfogja, emulálja vagy átirányítja, illetve bármely idegen fejlesztésű, illetéktelen programot, amely a Szoftver által a Játékkal kapcsolatos adatok tárolására használt memóriaterületek kiolvasásával a játékról információt gyűjt;\n- Ha a Játék olyan területeihez vagy Játékszerverekhez fér hozzá, vagy próbál hozzáférni, amelyek még nem hozzáférhetők a nyilvánosság számára;\n- Idézőjének olyan nevet választ, amely megtévesztően azt sugallja, hogy kapcsolatban áll a Riot Gamesszel, a személyazonosításra alkalmas adatokat tartalmaz, vagy sértő, gyalázkodó, közönséges, obszcén, pornográf vagy a különböző embertípusok szempontjából, etnikailag, illetve más módon kifogásolható. Nem használhat helytelenül írt szavakat vagy alternatív helyesírást annak érdekében, hogy kijátszhassa az Idéző nevével kapcsolatos fenti korlátozást. A Riot Games az Ön értesítése nélkül módosíthatja a jelen rendelkezést sértő neveket, ugyanakkor további büntetőintézkedéseket is tehet, amely a szabályok ismételt megszegése esetén a fiók megszüntetését is magában foglalhatja;\n- Éles játékmenet során kijelentkezik vagy kilép a Játékból. A Riot Games automata Leaverbuster® rendszere folyamatosan nyomon követi ezeket az adatokat, és ideiglenesen kitiltja azt a felhasználót, akinek az esetében úgy ítéli meg, hogy az illető túl sokszor lépett ki játék közben. Ha az adott fiók később továbbra is rendszeresen kilép az éles játékból, az ideiglenes kitiltás időtartama is hosszabb lesz; vagy\n- Egy másik személy adataival jelentkezik be a Játékba, hogy „felturbózza” az illető státuszát vagy rangját.\n\n(Fent adtam egy kisebb segítséget, hogy mit kellene főképp olvasni)\nNekem személy szerint a QQ-k szúrtak szemet (nem mondhatod, hogy nem provokáció), továbbá...\n\n>Omnom1202: WAT\nOmnom1202: THE FUCK\nOmnom1202: U STAND THERE\nOmnom1202: WHAAAT\nOmnom1202: THIS IS LOW GOLD\nOmnom1202: WHAT\nOmnom1202: never seen it in gold or lower elo\n---\nOmnom1202: stfu riven\nOmnom1202: u lost in 1v1\nOmnom1202: report Riven\n\nLáthatod, ahelyett, hogy abba hagytad volna a veszekedést és lenémítottad volna őket, folytattad. Véleményem szerint igen, jogos.","replies":[{"poster":"Storiaron","date":"2018-03-23T13:23:54.466+0000","up_votes":3,"down_votes":1,"body":"Nem azért bannolták, mert flamelt, hanem mert 14 napos ban után frissen visszatérve, mikor a bot még **kiemelten** figyeli a chat tevékenységet, kezdett el flamelni.\n\nGondolom az eredeti 14 napos ajándék csomagot pedig egy keep yourself safe szöveggel érte el. Nyakamat teszem rá.","replies":[{"poster":"Omnom1202","date":"2018-03-23T13:30:04.198+0000","up_votes":1,"down_votes":6,"body":"Kill your selfet nem írtam sose , egyeszerűen nem igazán tetszett az elo boosted talon statja és gondoltam beavatom ebbe a csodálatos játék communityába és elmondtam neki hogy egy feeder %%%%%%ed trash shit :) De mint látod itt már nem flameltem és innen max a stfu számít elvileg flamelésnek  (nem igazán értem hogy miért de mind1)","replies":[{"poster":"Storiaron","date":"2018-03-23T13:33:44.918+0000","up_votes":3,"down_votes":1,"body":"**mert 14 napos ban után frissen visszatérve, mikor a bot még kiemelten figyeli a chat tevékenységet**","replies":[{"poster":"Omnom1202","date":"2018-03-23T13:36:04.593+0000","up_votes":1,"down_votes":6,"body":"Elolvastad egyáltalána  chat logot vagy bármelyik másik válaszomat? nem érted h nem flameltem egyáltalán? semmit se inzultálásból írtam!","replies":[{"poster":"Omnom1202","date":"2018-03-23T13:37:10.941+0000","up_votes":1,"down_votes":5,"body":"Se a modi se a support nem válaszolt még arra hogy ha PEGI 12es a játék akkor a káromkodás miért nem megengedett :)","replies":[{"poster":"Afelers","date":"2018-03-23T13:45:39.847+0000","up_votes":3,"down_votes":1,"body":"Mert az a játék tartalmára vonatkozik, annak a contentjére, aka néhányan lenge öltözetben vannak, vagy olyan szavakat használnak stb. PEGI 12 ezt jelenti, nem azt, hogy itt élheted ki magad és viselkedhetsz úgy, hogy édesanyádnak már rég le kellett volna kevernie egy pofont.","replies":[{"poster":"Omnom1202","date":"2018-03-23T13:46:41.388+0000","up_votes":1,"down_votes":6,"body":"Ebben a communityben tényleg nem tud olvasni senki?","replies":[{"poster":"Omnom1202","date":"2018-03-23T13:54:07.817+0000","up_votes":1,"down_votes":6,"body":"support írja: \" a fórumon sajnos nem értettek veled egyet a játékosok, hiszen ők is offenzívnek vélték a dolgot\"\nMit csináltok? Idejöttök elolvassátoka  címet \"ÖÖÖÖ MEGINT EGY KURVA TOXIC SZAR MEHET A DOWNVOTE ÉS AZ H MEGÉRDEMELTED\" aztán lelép... elolvasni nem olvas el semmit :) Teljesen érthetőn leírtam és csak a 100% igazságot írtam","replies":[{"poster":"Afelers","date":"2018-03-23T14:16:56.431+0000","up_votes":4,"down_votes":0,"body":"Te pedig továbbra sem veszed észre, mit csináltál, mint ahogy általában a \"toxic szar\" játékosok, akik azt hiszik, csak akkor vagy toxic, ha trágárkodsz. Egy egyszerű stfu-ra egyébként nem kapsz rögtön permát, szóval nagy valószínűséggel volt 14 napos bannod vagy valami korábban, ami az utolsó figyelmeztetés. Mivel a rendszer úgy látta, hogy utána is folytatod, nem hallgattál a figyelmeztetésre, kénytelen volt megtenni a következő lépést.\n\nEgyébként te folyamatosan azt az egy stfu-ot hangoztatod, mikor\n\n>Omnom1202: see?\n>Omnom1202: report her\n>Omnom1202: tipycal riven writing or afking\n>Omnom1202: yea\n>Omnom1202: look at bot\n>Omnom1202: im gonna gank them so we dont loose\n>Omnom1202: yea\n>Omnom1202: stfu riven\n>Omnom1202: u lost in 1v1\n>Omnom1202: report Riven\n>Omnom1202: for flaming and inting\n>Omnom1202: flaming for the whole game\n>Omnom1202: and doing literally nothing\n>Omnom1202: if u flame im not gonna gank\n>Omnom1202: Ahri went up\n>Omnom1202: u was afk\n>Omnom1202: and thats why im still gold\n>Omnom1202: cause of riven\n\nconstant blaming\n\n>Omnom1202: report Ahri jax Velkoz for flaming\n>Omnom1202: troll premades\n>Omnom1202: XAXA\n>Omnom1202: getting camped on bot and u want us to not int\n\nreport calling, threatening with intentional feeding\n\n>Omnom1202: im gonna run it down like T1\n>Omnom1202: im trolling\n>Omnom1202: sorry bro\n>Omnom1202: jax just Shittalking\n>Omnom1202: report jax\n\nitt is report calling, threatening with intentional feeding\n\nEz mind flame-elés függetlenül attól, hogy trágár szavakat használsz vagy sem. Ezért bannoltak, nem azért a nyamvadt stfu-ért.","replies":[]}]}]}]}]},{"poster":"Storiaron","date":"2018-03-23T13:39:56.501+0000","up_votes":3,"down_votes":1,"body":"Gyakorlatilag az egész meccsrt azzal töltötted, hogy reportokat kértél másokra és azzal fenyegetőztél hogy lefutod miden. Őszintén örülök, hogy permáztak, jó látni, hogy néha azért működik a rendszer.","replies":[{"poster":"Omnom1202","date":"2018-03-23T13:41:05.324+0000","up_votes":1,"down_votes":5,"body":"tanulj meg olvasni aztán irogass hülyeségeket :) csak 10x írtam le de akkor ne  olvasd el :)\na report kérés hol flamelés? hmm?\nna jólvan kapod a ctrlc ctrlv-t hogy örülj \nMid lanerünk beállt ebbe a bokorba:  https://cdn.discordapp.com/attachments/195463568089546752/426662924786991105/unknown.png\nÉn meg csodálkoztam hogy beállt és írtam neki hogy low gold eloban sose láttam még ilyet hogy maguktól beálltak oda! Nem nem hazudok tényleg ez volt! És ha flamelésből írtam volna ki ez a post meg se született volna mivel akkor érteném hogy miért bannoltak ki :)\nEdit: Omnom1202: WAT\nOmnom1202: THE FUCK\nOmnom1202: U STAND THERE\nOmnom1202: WHAAAT\nOmnom1202: THIS IS LOW GOLD\nOmnom1202: WHAT\nOmnom1202: never seen it in gold or lower elo\nOmnom1202: im just suprised\nNem offensive kontextusban írtam de valszleg a rendszer offensivenek észlelte\nmeg amúgy is ez nem flame hanem dícséret\nMajd rivenünk végig basztatta a trundlet hogy broken a champje meg nem fair... legvégül ahrit is elkezdte flamelni én meg megvédtem mivel szerinte ő miatta vesztettünk hogy meghalt mert a trundle megölte....és erre írtam h stfu riven erre írta hogy nem gankeltem írtam hogy 1v1ben halt meg és nem az én hibám! És persze hogy kiírom hogy report XY for XY hogy ha afkolt flamelt és feedelt (igaz nem intelt)\na Q spam bedig az hogy vaynenünket megmentem majd elkezdem spammelni hogy Q hogy rá tudjak ugrani de ő nem ő nem áll meg egy másodpercre jaxeztem....\nVelkoz top ahri mid aki rögtön elkezdte basztatni az enemy pantheont hogy megfog dögleni meg hasonlók. Jax a lobby óta flamelt engem hogy basszam meg a kurva anyámat hogy trollkodok... és most nem azért... de nem volt világos hogy szarkazmus volt hogy lefutok? jax irogatta hogy trolkodok intelek... erre írom hogy im done with league of legends im gonna run it down like t1 (első idézet videogamedunkey második meg egy általános meme mivel tyler1 elég sokszor lefutott régen), Persze hogy kiírom hogy report jax... vagy azis flamelés? xD végig flamelt mindenkit!","replies":[{"poster":"Storiaron","date":"2018-03-23T13:41:47.466+0000","up_votes":3,"down_votes":1,"body":"Burn.","replies":[]}]}]}]}]}]}]},{"poster":"Omnom1202","date":"2018-03-23T09:15:25.622+0000","up_votes":3,"down_votes":8,"body":"Ó igen és minek van chatfilter ha bannolnak flamelésér? :{{sticker:vlad-salute}}","replies":[{"poster":"Mind The Gap","date":"2018-03-23T09:24:11.280+0000","up_votes":6,"down_votes":2,"body":"Nem azért rakták be, hogy majd a 13 éves kis Jancsi flamelni tudjon, az biztos. Alap cenzúra, attól még nem megengedett sérteni. Továbbá kicenzúrázza a nem sértő és nem is személyre irányuló erős kifejezéseket is (lásd: “bocsi srácok, ezt el_hmhm_sztam”) -- erre önmagában nem kapnál büntetést, csak ha mást sértenél vele.","replies":[{"poster":"Omnom1202","date":"2018-03-23T09:33:33.019+0000","up_votes":3,"down_votes":8,"body":"PL.: minden játékba a \"\"\"\"\"\"%%%%%%\"\"\"\"\"\" Szót kicenzúrázzák és nem kapsz bant akárhányszor írod... (nem látod nem fáj) És ugye  ha én ezt írom: fuck you u fucking piece of shit bitch, ez neki így jelenne meg  **** you u ****ing piece of **** **** (nem látom nem fáj) És ezért nem is bannolnának más játékban de itt igen.... Ha nem lenne általánosan chat filter akkor ugye nem lenne ezzel baj de mivel van és van rá lehetőség hogy ki/be kapcsoljam :D PEGI 12 rated a játék káromkodni nem szabad a a női test szépségét a riot szeretettel pakolja ki szemünk elé :D Titles rated 12+ have been assessed to be suitable for gamers above the age of 12. May contain graphic violence towards fantasy characters, non-graphic violence towards humans or animals, explicit sexual descriptions or images (nude people in a sexual context, although not necessarily explicit in content), and mild swearing.","replies":[{"poster":"Mind The Gap","date":"2018-03-23T09:41:26.452+0000","up_votes":5,"down_votes":2,"body":"Nem-e? Ha nekem írna valaki olyat, amit kicenzúrázna a játék, akkor szerintem nem asztronómiai okokból csillagozná ki a játék. Simán tudnám továbbra is, hogy azért cenzúrázta ki, mert valami nem elfogadhatót írt az emberke. Éppen csak azt nem tudnám, hogy melyik szót. És ennyiben kimerül a cenzúrázás funkciója. Csak annyi, hogy csökkenti a negatív élményt, de nem védhető ki teljesen. Szerintem iskolában, egyetemen, munkahelyen, de szerintem még a 650-es járaton sem díjaznák az emberek, hogy ha azt mondanád, hogy: “Te k...” A lényeg, hogy a szövegkörnyezetről még kiderül, hogy sérteni akart XY (nagy eséllyel legalábbis), csak gyáva volt kimondani az egész szót, hogy rá tudja kenni arra, hogy ő nem mondta ki teljesen a szót.\n\nA női test szépsége pedig hogy releváns a témához? Most nem arról beszélünk, hogy tiltást kaptál a játékban használt nyelvezet miatt? A női test szépsége pedig egyébként sem sért meg senkit.","replies":[{"poster":"Omnom1202","date":"2018-03-23T09:45:20.862+0000","up_votes":2,"down_votes":8,"body":"Pegi 12 rated a játék... Gravesnek cigije van nem probléma minden nő úgy néz ki Mint Mia Khalifa Reskinje... de ha csúnya szavakat mondasz akkor jön a bannhammer.. és mellesleg nem szidásra használtam a szavakat... nézd meg a másik választ amit a bannal kapcsolatba írtam neked \nTitles rated 12+ have been assessed to be suitable for gamers above the age of 12. May contain graphic violence towards fantasy characters, non-graphic violence towards humans or animals, explicit sexual descriptions or images (nude people in a sexual context, although not necessarily explicit in content), and mild swearing.","replies":[{"poster":"Mind The Gap","date":"2018-03-23T10:04:17.970+0000","up_votes":4,"down_votes":2,"body":"A játékban használt nyelvezet azért más, mert azzal valós veszekedéseket lehet generálni. Lehet, hogy Pegi 12 ([Adatvédelem szerint azok játszhatnának csak, akik betöltötték a 13-at (VI. pont)](https://eune.leagueoflegends.com/hu/legal/privacy) .), de a játék elemei kitaláltak. Egy játékban történő konfliktus két ember (vagy több) között pedig valódi.\n\nMivel nem voltam ott, nem láttam a két szememmel az eseményeket. Mindenestre, még akkor sem tűrhető el a visszaszólás a [játékostámogatás](https://support.riotgames.com/hc/en-us/articles/207489286#h2q2) szerint, ha nem te kezdted.","replies":[{"poster":"Omnom1202","date":"2018-03-23T10:12:24.459+0000","up_votes":2,"down_votes":6,"body":"Értem Én :D Persze valós a konfliktus de a játékBAN zajlik nem IRLben ... egy playert 40 percig ismerek majd soha többet nem látom akkor nem mindegy hogy válunk el? Meg most nem azért :) az a hülye aki felakasztja magát mert flamelik egy  játékban vagy az aki flameli... persze mindenki azt mondja az aki flameli de ha mindent a szívére vesz az ember a nyugdíjas kort nem fogja  megélni ): 2 évvel ezelőtt refluxos lettem a sok stress miatt ami ért engem (magán ügy) És akkor rájöttem hogy sokkal könnyebb leszarni azt aki flamel, basztat stb... csak sajnos egy idő után elpattan a húr és muszáj visszaírni :)","replies":[]}]},{"poster":"nr1Red","date":"2018-03-23T09:59:12.608+0000","up_votes":3,"down_votes":2,"body":"Ember!!! Einsten mondta hogy minden relatív, azaz nézőpont kérdése. Hidd el, a legtöbbünk nem lát Mia Khalifákat a női lol karakterekben, nem izgul fel rájuk. De ha meg mégis, akkor se érdekel amúgy meg senkit.","replies":[{"poster":"Omnom1202","date":"2018-03-23T10:01:41.405+0000","up_votes":2,"down_votes":7,"body":"hmm most azt hiszed hogy megfogtál de nem :D én nem azt mondtam hogy Felizgulok rájuk :D azt mondtam hogy minden női csemp aki az Hourglass Woman alapján lett elkészítve (vékony csípő hosszú comb nagy mellek nagy segg) ugyan olyan  mint Mia khalifa :D","replies":[{"poster":"nr1Red","date":"2018-03-23T11:02:09.719+0000","up_votes":1,"down_votes":1,"body":"Azt én sem mondtam hogy Te felizgulsz rájuk. De mivel hogy pornósztárhoz hasonlítod a karaktereket, nyilván arra gondolsz hogy azok izgatóak lehetnek. De ez senkit nem érdekel és amúgy sincs semmi köze a bannodhoz.","replies":[{"poster":"Omnom1202","date":"2018-03-23T11:12:04.937+0000","up_votes":1,"down_votes":6,"body":"Persze hogy nincs köze :D én kérdeztem valamit (amellett hogy írtam hogy mire írtam a low gold elo-t) \n Mr Modi arra válaszolt... te meg beszáltál a buliba... mellesleg ezt a példát én azért írtam hogy legyen mihez hasonlítani a női karakereket :) Én ezt a Pegi 12 korhatár besorolásra írtam mivel explicit sexual content van a játékban meg Cigije gravesnek akkor Káromkodni miért nem lehet főleg ha van chat filter... \nEdit: Káromkodni lehet de az automatikus ban rendszer vagy nem tudom minek hívják inzultációnak fogja fel mint az tapasztaltam párszor","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Omnom1202","date":"2018-03-23T09:02:34.842+0000","up_votes":2,"down_votes":7,"body":"Akkor neked is leírom: Mid lanerünk beállt ebbe a bokorba:  https://cdn.discordapp.com/attachments/195463568089546752/426662924786991105/unknown.png\nÉn meg csodálkoztam hogy beállt és írtam neki hogy low gold eloban sose láttam még ilyet hogy maguktól beálltak oda! Nem nem hazudok tényleg ez volt! És ha flamelésből írtam volna ki ez a post meg se született volna mivel akkor érteném hogy miért bannoltak ki :)\nMajd rivenünk végig basztatta a trundlet hogy broken a champje meg nem fair... legvégül ahrit is elkezdte flamelni én meg megvédtem mivel szerinte ő miatta vesztettünk hogy meghalt mert a trundle megölte....és erre írtam h stfu riven erre írta hogy nem gankeltem írtam hogy 1v1ben halt meg és nem az én hibám! És persze hogy kiírom hogy report XY for XY hogy ha afkolt flamelt és feedelt (igaz nem intelt)\na Q spam bedig az hogy vaynenünket megmentem majd elkezdem spammelni hogy Q hogy rá tudjak ugrani de ő nem ő nem áll meg egy másodpercre jaxeztem....","replies":[{"poster":"Omnom1202","date":"2018-03-23T11:57:34.267+0000","up_votes":1,"down_votes":5,"body":"Akkor most folytathatnák esetleg ezzel a postal kapcsolatban a beszélgetést? \nMivel szerintem még mindig jogtalan a ban... az egyetlen offensive \"beszólás\" a stfu riven  de ga az bannable akk szerintem nagyon sok mindenkit kibannolnának.\nEdit: Omnom1202: WAT\nOmnom1202: THE FUCK\nOmnom1202: U STAND THERE\nOmnom1202: WHAAAT\nOmnom1202: THIS IS LOW GOLD\nOmnom1202: WHAT\nOmnom1202: never seen it in gold or lower elo\nOmnom1202: im just suprised\nNem offensive kontextusban írtam de valszleg a rendszer offensivenek észlelte\nmeg amúgy is ez nem flame hanem dícséret","replies":[]}]}]},{"poster":"nr1Red","date":"2018-03-23T00:37:12.073+0000","up_votes":3,"down_votes":2,"body":"Tényleg nem érted?","replies":[{"poster":"Omnom1202","date":"2018-03-23T00:53:51.210+0000","up_votes":3,"down_votes":7,"body":"Persze hogy nem értem :) support ugyan azt a sablon szöveget tolja újra és újra... ez nem flamelés... nem mondtam h jajj te bronzos kutya kussoljál vagy bármi mást... szimplán elmondtam hogy elég lesz... a másik pedig az flamelés ha kiírom hogy troll premades? Velkot top ahri mid aki intelt/flamelt... meg azt kiírom hogy report vagy azt h ha folytatja bant kap?\nEdit: “literally doing nothing” ül a torony alatt míg megkúr minket 2v1 be a fed trundleje :) mit írjak? Ügyes vagy? :,D","replies":[{"poster":"nr1Red","date":"2018-03-23T08:38:38.009+0000","up_votes":5,"down_votes":3,"body":"Figyelj, nem azért kaptad a bannt mert csúnyán beszéltél. A probléma a mentalitásoddal van. Abban hogy az amit ide bemásoltál szerinted nincs semmi rossz. Azt írod hogy nincs semmi flame benne, hogy nem írtál semmi bomlasztót. Pedig DE. Az egész bemásolt chatlogod egy nagy \"shittalking\" flame cunami, csak hogy a te szavaiddal éljek.\nKifejtem hogy miért is gondolom így.\n\nGame1:\nRögtön azzal nyitsz hogy \"WAT THE FUCK\" csupa nagybetűvel, már csak ez a kezdés is eléggé véleményes. Utánna \"THIS IS LOW GOLD\"...nyilván itt az egyik csapattársadat minősíted, igaz nem alpári módon de szintén kiabálva csupa nagybetűvel...flame! És most jön a legviccesebb! \nBeírod előbb ezt:\n\"Omnom1202: stfu riven     \nOmnom1202: u lost in 1v1      \nOmnom1202: report Riven      \nOmnom1202: for flaming and inting\"\nMajd kb közvetlen utánna beírsz 20db Q betűt egymás alá. :D Érted az iróniát?\nVégül zárod a soraidat egy kis szapulós flameléssel.\n\nGame2:\nItt szinte azzal kezdesz hogy egyből 3 csapattársadat akarod reportolni és \"troll premades\"-nek nevezed őket! \nAmi vicces is annak tükrében hogy ebben a játékban épp te vagy premadeben a fentebb megszólaló barátoddal, így ezt csak a barátodnak írhattad.\nMost szerinted ez tényleg nem bomlasztó? Aztán arról flamelsz hogy te bizony nem vagy troll, aztán meg bevallod hogy mégis csak trollkodsz és megmagyarázod hogy azért mégsem vagy mindig troll. Végül egy laza \"report Jax\" befejezted a pályafutásod.\n\nSzóval ez a chatlog a flamelés és a bomlasztás iskola példája. Lehet hogy nem írsz csúnyán, nem küldesz el benne senkit a picsába de attól az még flame és bőven a bomlasztó kategória. Meg kell értened hogy ezt a játékot nem egyedül játszod. Amikor indítasz egy játékot akkor kapsz magad mellé 4 másik játékost, 4 különböző személyt, egyéniséget és valószínűleg 4 különböző nézőpontot is. És ha valamelyik csapattársad nem úgy játsza a játékot ahogy éppen te magad elvárod akkor nem az a megoldás hogy elkezded chat-be oltani. Fogd fel hogy a saját csapattársadat nem éri meg semmilyen szinten oltani. Te szereted ha megszólnak egy hibád miatt? Nyilván te is ideges leszel, ami kihat a játékodra ahogy az is ugyanúgy kihat a játékra ha mások általad vélt hibáin idegeskedsz.\n\nUi.: Mivel azt nem látom hogy a többiek mit írtak neked, de azt elhiszem hogy ők sem voltak különbek. De a flame-re nem flammel kell válaszolni! Az nem mentség hogy \"dehát a másik is miket írt már\"...ahogy rád is, úgy rájuk is le fog csapni a bann kalapács.\nJavaslom hogy változtass a mentalitásodon, ne keresd mindenkiben a hibát, ne szólj meg soha senkit ha hibázik és muteold azt aki beszól neked!","replies":[{"poster":"Omnom1202","date":"2018-03-23T08:55:05.293+0000","up_votes":3,"down_votes":5,"body":"1. Mid lanerünk beállt ebbe a bokorba: https://cdn.discordapp.com/attachments/195463568089546752/426662924786991105/unknown.png\nÉn meg csodálkoztam hogy beállt és írtam neki hogy low gold eloban sose láttam még ilyet hogy maguktól beálltak oda! Nem nem  hazudok tényleg ez volt! És ha flamelésből írtam volna ki ez a post meg se született volna mivel akkor érteném hogy miért bannoltak ki :)\nMajd rivenünk végig basztatta a trundlet hogy broken a champje meg nem fair... legvégül ahrit is elkezdte flamelni én meg megvédtem mivel szerinte ő miatta vesztettünk hogy meghalt mert a trundle megölte....és erre írtam h stfu riven erre írta hogy nem gankeltem írtam hogy 1v1ben halt meg és nem az én hibám! És persze hogy kiírom hogy report XY for XY hogy ha afkolt flamelt és feedelt (igaz nem intelt)\na Q spam bedig az hogy vaynenünket megmentem majd elkezdem spammelni hogy Q hogy rá tudjak ugrani de ő nem ő nem áll meg egy másodpercre jaxeztem....\n2. Velkoz top ahri mid aki rögtön elkezdte basztatni az enemy pantheont hogy megfog dögleni meg hasonlók. Jax a lobby óta flamelt engem hogy basszam meg a kurva anyámat hogy trollkodok... és most nem azért... de nem volt világos hogy szarkazmus volt hogy lefutok? jax irogatta hogy trolkodok intelek... erre írom hogy im done with league of legends im gonna run it down like t1 (első idézet videogamedunkey második meg egy általános meme mivel tyler1 elég sokszor lefutott régen), Persze hogy kiírom hogy report jax... vagy azis flamelés? xD végig flamelt mindenkit!","replies":[{"poster":"nr1Red","date":"2018-03-23T09:37:57.919+0000","up_votes":3,"down_votes":2,"body":"Most saját magamat idézném; \"Az nem mentség hogy \"dehát a másik is miket írt már\"\"\nIgnorálni kell mások toxicus viselkedését, ahelyett hogy olajat locsolnál a tűzre. \nÚjra csak az javasolnám hogy változtass a mentalitásodon, ne keresd mindenkiben a hibát, ne szólj meg soha senkit ha hibázik és muteold azt aki beszól neked!","replies":[]},{"poster":"Omnom1202","date":"2018-03-23T08:56:52.348+0000","up_votes":3,"down_votes":8,"body":"Ui: nagyon örülnék ha érvelnél is és nem csak Downvotolnátok a postomat :)","replies":[]}]}]}]}]},{"poster":"Omnom1202","date":"2018-03-23T13:59:00.132+0000","up_votes":2,"down_votes":5,"body":"Gratulálok Mindenkinek aki downvotolta az összes commentem és a postot :) Ez a MAGYAR league of legends community vagyis EZ A leauge of legends community! egyáltalán nem segítőkész és rögtön megy a downvote ha valami nem tetszik :) Nem hiszem hogy bármelyik őtök is játszik ezzel a játékkal nap mint nap vagy ha játszik akkor nem rankedezik :) Nem értitek ti hogy mi megy az meg a másik hogy Else olvassátok amit írtam és rögtön megy az inzultálás és a flamelés? :D Hogy megérdemeltem stb? Láthatóan nem flameltem egyszerűen az automatikus ban rendszer Félre értett retek sok cuccot :) \nhttps://cdn.discordapp.com/attachments/195463568089546752/426741630339514368/29138226_208555836581225_495268179_n.png","replies":[{"poster":"Complex VN","date":"2018-03-23T14:14:18.210+0000","up_votes":2,"down_votes":1,"body":"\"its easy to blame others and hard to blame your self :)\"","replies":[{"poster":"Omnom1202","date":"2018-03-23T14:16:10.872+0000","up_votes":1,"down_votes":5,"body":"Köszi haver látom te is tudsz olvasni de még mindig ugyan azt hajtod","replies":[{"poster":"Omnom1202","date":"2018-03-23T14:21:17.334+0000","up_votes":1,"down_votes":6,"body":"Meg amúgy is.... Óvodában vagyunk? Senki nem tud olvasni meg egy Stfu-zól megsértődik... De ez hogy is jön ide? A LOL community a világ legszarabb online communityje... És nem nem a magam fajták miatt hanem az inter feed trash szarok miatt akik bronzba valók de valahogy még diamondba is vannak És nagyon sok még flamel is :) Bannoljanak ki cheatelésért, trollkodásért  de ne egy fuckért vagy stfu-ért :D \nÉletemben először segítséget kérek a lol communitytől és mit kapook? Mindent csak nem segitséget...","replies":[{"poster":"Sylasi Elvtárs","date":"2018-03-23T14:24:25.825+0000","up_votes":1,"down_votes":0,"body":"Azt hiszed a Fuck-ért lettél kihajítva. Nem. Kaptál figyelmeztetést, nem egyet. Légy sportszerű, ne szidd a társaidat. Erre folytattad tovább. Nyilván a 14 napos kitiltást és az előző felhasználód permabanját is egy fuck-ért kaptad, igaz? Megkaptad a lehetőséget, hogy megembereld magad, ezzel nem éltél, most megérkezett a büntetés.","replies":[]}]}]}]}]}]}