{"poster":"John 6","date":"2017-11-11T15:00:42.189+0000","title":"[SUGERENCIA] Mejorar el sistema de recompensas actual","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Buenas, pens&eacute; que ser&iacute;a copado &quot;combinar&quot; el sistema de recompensas con los niveles de honor. Que las recompensas tras subir de nivel sea mejor (O tenga un % a ser mejor) para aquellos jugadores con nivel de honor m&aacute;s alto y, por el contrario, que penalize a aquellos jugadores con malas conductas (Nivel 0-1).\r\nPor ejemplo (Los valores pueden variar):\r\n**Honor 0 y 1:** 20% de probabilidad de recibir un frag. de campe&oacute;n con valor bajo (Como Yi o Malphite)\r\n**2: **Al azar\r\n**3: **15% de obtener un frag de campe&oacute;n, o dos, cuyos valores sean mayores o iguales a 3150 EA\r\n**4: **25% de obtener un frag de campe&oacute;n, o dos, cuyos valores sean mayores o iguales a 4800 EA\r\n**5:** 50% de obtener un frag de campe&oacute;n, o dos, cuyos valores sean mayores o iguales a 6300 EA\r\n\r\nOtra opci&oacute;n posible seria un bono de exp. al final de cada partida. Por lo tanto, los jugadores H5 ganar&iacute;an un 150% EXP; H01 un 80% EXP y; H2 el 100% etc.\r\n\r\nEn mi opini&oacute;n, esto ser&iacute;a, por un lado, un incentivo para promocionar las buenas conductas y castigar aquellos comportamientos ofensivos, y, por otro lado, el reconocimiento y merecida recompensa a aquellos jugadores que se comportan de manera adecuada.","replies":[{"poster":"Mugsy","date":"2017-11-11T15:03:12.759+0000","up_votes":1,"down_votes":2,"body":"Sos vivo, queres eso porque seguramente tenes honor 5 , espero que te caiga un ban asi tengas honor 0 y te metas tus teorias por la oreja.","replies":[{"poster":"John 6","date":"2017-11-11T15:14:11.958+0000","up_votes":1,"down_votes":0,"body":"Como mencioné, es una forma de recompensar a los jugadores que tienen una actitud positiva y educada y castigar a quienes no. Creo que es lo mejor para toda la comunidad promocionar el buen comportamiento.","replies":[]},{"poster":"Urxnium","date":"2017-11-11T15:54:40.891+0000","up_votes":1,"down_votes":1,"body":"Vaya hijo de pvta eres.","replies":[]}]},{"poster":"El Impostor","date":"2017-11-11T15:01:59.441+0000","up_votes":1,"down_votes":0,"body":"Sabes que el honor se resetea cuando comience la temporada verdad?","replies":[{"poster":"John 6","date":"2017-11-11T15:12:45.991+0000","up_votes":1,"down_votes":0,"body":"Si, pero eso no quita que uno pueda volver a subir, si se lo merece claro.","replies":[]}]}]}