{"poster":"Stealth Cat","date":"2015-07-04T06:45:17.203+0000","title":"Rengar","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Hallo liebe Community, \r\ndiese Frage richtet sich vor allem an andere Rengar Spieler, was macht ihr wenn ihr gecounterjungled werdet? Also hier meine ich nicht diese Tipps warden und Lanes fragen ob sie helfen, da ich nicht einmal dazu kam Sicht aufzubauen. Der gegnerische J4/Liss warteten einfach irgendwo in einem Geb&uuml;sch, und wenn ich dann vorbei gelaufen bin, nachdem ich ein Camp gemacht habe bekam ich direkt J4 Knockup&gt;Liss Snare&gt;Liss Ult oder J4 Ult und war tod. Oft war es auch nur der Jarvan, da ich jedoch als Rengar relativ low werde im jungle konnte er mich jedes Mal easy t&ouml;ten. War f&uuml;r meine Mates und mich ziemlich moralsenkend.\r\nMFG E5 Rekhyten","replies":[{"poster":"Ηastur","date":"2015-07-04T10:00:19.256+0000","up_votes":1,"down_votes":0,"body":"Schweres Ding. Ich hab mir Rengar neulich geholt und genau das selbe erfahren. Sogar son blöder Farmyi hat bei meinem Blue auf mich gewartet und mich gekillt. Und J4s Level 2 ist ohnehin saustark.\nIch hab meine Jungleroute jetzt mal umgestellt und mach erst komplett bot, dann nen back, dann erst top oder gehe direkt (vorsichtig) counterjunglen, wenn ich frühe Agression erwarte. Je mehr der Gegner aufs early geht, desto berechenbarer wird er. Du kannst deinen Mates sagen sie sollen warden und da sein, wo er nicht ist (wenn du ihn siehst).\n\nDas eigentliche Problem kann ich aber auch nicht lösen. Mehr als schnell weg, bzw Hilfe von den Lanes bekommen hat bei mir bisher kaum etwas gebracht. Habs aber selbst auch mal mit Rengar gemacht und so mehrfach easy firstblood geholt zwischen Redbuff und Toplane vom Gegner. Du könntest als drittes Camp die Wölfe machen und smiten, dann bekommst du zumindest schon einmal sicht. Den Freeward am Beginn effizient platzieren, so dass du beim clearen auch nicht gestört wirst, ohne dass du es kommen siehst und/oder deinem Top/midlaner sagen sie sollen sich bereit machen zu helfen, wenn du in deinen Topjungle gehst, bzw bei Zeiten (Minute 2) deine Jungleeingänge warden. Viel ist das eigentlich nicht was ich sagen kann, werd das Thema mal im Auge behalten, weil ich das wie gesagt selbst erlebt habe und Rengar zu Beginn n ziemliches Opfer is was das angeht.\nAus nem Guide als sichere Route benannt: https://www.youtube.com/watch?t=163&v=iXxsUlv0BbA\n\nmfg","replies":[{"poster":"AyRe CoNteMpT","date":"2015-07-04T20:10:06.148+0000","up_votes":2,"down_votes":0,"body":"rengars erste schwachstelle ist der lvl 2 invade beim redbuff und wenn du danach recallst, auch seine einzige. \n\ndu kannst zb folgendes machen:\n\nkruggs smite -> ward red--riverbush (der auf der andren seite der wall des redbuffs) -> take wraith -> take red mit zweitem smite. das schaffst du mit einer potion wenn dein rune und mastery setup gut is. -> recall -> buy trailblazer -> clear blue jungle\n\ndu hast zwar hiermit nur eine potion, aber nach dem clear trotzdem full hp und lvl 4, womit du stark ganken oder wieder in deinen red jungle clearen kannst.","replies":[{"poster":"Ηastur","date":"2015-07-04T22:33:23.292+0000","up_votes":1,"down_votes":0,"body":"Hab ich seit dem auch schon paar mal genau so gespielt und es macht sich gut. Selbst ohne Potion kommt man glaub ich durch, mit ist man sicherer und mit der zweiten kann man sogar gleich ganken gehen.\nDanke nochmal für die Bestätigung der Spielweise.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-07-04T22:52:59.588+0000","up_votes":1,"down_votes":0,"body":"denk trotzdem dran verschiedene junglerouten zu haben und auch nach zufallsprinzip auszuwählen. unpredictable zu sein is MEGA wichtig mit rengar. du kannst zb auch gromp starten und den top jungle nehmen und dann toplane ganken gehen bzw auf der redside eben red starten (alles ohne pull).\n\nrengar kann alles machen solange er den gegner unvorbereitet erwischt.","replies":[{"poster":"Ηastur","date":"2015-07-05T10:57:08.617+0000","up_votes":1,"down_votes":0,"body":":D Kommt Zeit kommt Rat. Ich glaub Üben is einfach das wichtigste bei ihm. Getestet hab ich einiges, das von dir beschriebene war bisher aber immer die Poblemlosere Variante.\n\nWenn wir hier schon mal plauschen noch ne Frage:\nOneshotrengar, oder Bruiser? Bzw wann welchen? Ich hab mal das Kindlegem nach dem ausgebauten Smite gebaut und bin danach erst wieder auf Schaden gegangen. Bringt leben und Abkliingzeit. Und man wird im schlimmsten Fall nicht selbst geoneshottet.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-07-05T11:46:00.301+0000","up_votes":2,"down_votes":0,"body":"ich mag bruiserbuilds sehr gerne auf fast allen champs. bruiser heißt für mich 1 defensives item für jeden resistenztyp, zb randuins + maw. das is alles an defense was du brauchst. (oder thornmail + banshees, oder whatever du halt für die situation brauchst)\n\nmehr als ein resistenzitem pro typ is too much fürn bruiser. wenn du zb tiamat ghostblade randuins gehst, kannst du immernoch locker jeden adc duelieren und fast oneshotten, bist aber in skirmishes und teamfights viel flexibler.\n\nallerdings würde ich dir raten, selber sehr viel mit builds zu experimentieren. das machst du am besten indem du 20 games das selbe build spielst und danach guckst, was du verbessern kannst, es verbesserst und dann wieder 20 games das spielst (oder 10 wenn du nich soviel zeit investieren willst).\n\nnur dadurch kannst du das build in den verschiedensten situationen testen und merkst vielleicht, wo du wann was verbessern kannst.","replies":[]}]}]}]}]}]},{"poster":"Mognei","date":"2015-12-18T09:31:01.394+0000","up_votes":1,"down_votes":0,"body":"Zuerst lässt du dich nicht Counter ganken sondern  du Counter gankst selber es ist egal was für eine  Seite du bist du startest immer untern weil du mehr hilfe bekommst  also  als erstes Crucks/Groump  danach den Buff der jeweiligen seite und danach zur Krabbe  und dann zum gegenerischen Buff wo du dann auf den Gegner wartest (klappt in 90% der fälle silber-Plat)","replies":[{"poster":"Stealth Cat","date":"2015-12-18T12:57:03.449+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mognei,realm=EUW,application-id=Wj1wcocU,discussion-id=Bdd1F0Pa,comment-id=0002,timestamp=2015-12-18T09:31:01.394+0000)\n>\n> Zuerst lässt du dich nicht Counter ganken sondern  du Counter gankst selber es ist egal was für eine  Seite du bist du startest immer untern weil du mehr hilfe bekommst  also  als erstes Crucks/Groump  danach den Buff der jeweiligen seite und danach zur Krabbe  und dann zum gegenerischen Buff wo du dann auf den Gegner wartest (klappt in 90% der fälle silber-Plat)\n\nNun, danke, aber ich habe das vor 6 Monaten gefragt, mittlerweile bin ich DIA IV Rengar Main, und weiß was ich zu tun habe. :)","replies":[]}]},{"poster":"AyRe CoNteMpT","date":"2015-07-04T07:03:29.853+0000","up_votes":1,"down_votes":0,"body":"kauf mehr pots um nich low zu werden und spiel unberechenbarer. \nrengar ist ein jäger. um als jäger erfolgreich zu sein, musst du unberechenbar sein. mach nicht jedes game das gleiche und nimm nicht die gleichen junglerouten. überleg dir folgendes: was denkt der gegner, was für dich jetzt die optimalste jungleroute ist?\ndu hast top gegankt und recallst? dann wird dein top jungle wohl leer sein und du gehst jetzt nach dem recall in den bot jungle. klar wird er dort auf dich warten. stattdessen gehst du jetzt einfach in seinen top jungle oder nochmal top ganken über die lane. mach sachen, die keiner erwartet. nur so machst du beute. das ist rengar.","replies":[{"poster":"Stealth Cat","date":"2015-07-04T07:25:46.709+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KUNSTFEHLA,realm=EUW,application-id=Wj1wcocU,discussion-id=Bdd1F0Pa,comment-id=0000,timestamp=2015-07-04T07:03:29.853+0000)\n>\n> kauf mehr pots um nich low zu werden und spiel unberechenbarer. \n> rengar ist ein jäger. um als jäger erfolgreich zu sein, musst du unberechenbar sein. mach nicht jedes game das gleiche und nimm nicht die gleichen junglerouten. überleg dir folgendes: was denkt der gegner, was für dich jetzt die optimalste jungleroute ist?\n> du hast top gegankt und recallst? dann wird dein top jungle wohl leer sein und du gehst jetzt nach dem recall in den bot jungle. klar wird er dort auf dich warten. stattdessen gehst du jetzt einfach in seinen top jungle oder nochmal top ganken über die lane. mach sachen, die keiner erwartet. nur so machst du beute. das ist rengar.\n\nAhm, was Rengar ist ist mir schon klar, hab bald 500 Games mit dem insgesamt. Ich hab mir schon immer 4 Pots gekauft bzw. ich kam nicht dazu Topjungle zu machen und dann zu ganken, nach dem ersten Camp war fast immer der J4 da, egal wo ich gestartet habe, meine Laner haben zwar auch schon Pinks gekauft, aber deren Midlane+Jungle haben mich einfach die ganze Zeit getötet.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-07-04T07:40:29.026+0000","up_votes":1,"down_votes":0,"body":"dann waren das entweder hacker oder du hast irgendwas gehörig falsch gemacht.\nspätestens nach dem zweiten kill hättest du checken müssen dass die alles gewarded und es auf dich abgesehen haben. dann geh einfach in SEINEN jungle, möglichst ohne durch deinen durchzugehen, oder gank 3 mal hintereinander hardcore mit ult und flash und allem instantly. ult flash bola instagib. wie gesagt, du musst unberechenbar sein.\nwenn du in deinen jungle gehst und er schon auf dich wartet, bist du wohl einfach zu berechenbar.","replies":[{"poster":"Stealth Cat","date":"2015-07-04T07:58:07.558+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KUNSTFEHLA,realm=EUW,application-id=Wj1wcocU,discussion-id=Bdd1F0Pa,comment-id=000000000000,timestamp=2015-07-04T07:40:29.026+0000)\n>\n> dann waren das entweder hacker oder du hast irgendwas gehörig falsch gemacht.\n> spätestens nach dem zweiten kill hättest du checken müssen dass die alles gewarded und es auf dich abgesehen haben. dann geh einfach in SEINEN jungle, möglichst ohne durch deinen durchzugehen, oder gank 3 mal hintereinander hardcore mit ult und flash und allem instantly. ult flash bola instagib. wie gesagt, du musst unberechenbar sein.\n> wenn du in deinen jungle gehst und er schon auf dich wartet, bist du wohl einfach zu berechenbar.\n\nEr hat auf Level 2 angefangenzu counterjunglen, Buffs hab ich sowieso nicht bekommen, da ich keine Timer hatte, und wenn ich hinkam waren die weg. In seinen Jungle war mir etwas zu riskant, da alle gegnerischen Lanes gewonnen haben, und ich nicht wusste ob sie dort auch so viel gewardet haben. Aber danke für die Hilfe, denke ich bin wirklich etwas berechenbar bei meiner Jungle Route.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-07-04T18:11:30.616+0000","up_votes":1,"down_votes":0,"body":"was heißt auf level 2? wie lief denn dein jungle?\n\ncamp -> buff -> anderer buff, aber war weg -> typ steht im busch und killt dich?","replies":[{"poster":"Ηastur","date":"2015-07-04T18:17:03.287+0000","up_votes":1,"down_votes":0,"body":"Camp -> Buff -> typ killt wärend, oder schon bevor man den anderen Buff macht vermute ich.","replies":[{"poster":"Stealth Cat","date":"2015-07-04T19:54:17.576+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=uberleber,realm=EUW,application-id=Wj1wcocU,discussion-id=Bdd1F0Pa,comment-id=000000000000000000000000,timestamp=2015-07-04T18:17:03.287+0000)\n>\n> Camp -> Buff -> typ killt wärend, oder schon bevor man den anderen Buff macht vermute ich.\n\nGolems>Red \nRed war gewarded, er stand hinter dem Buff, in dem Gebüsch zum River, als ich Buff auf ~300 Leben hatte hat er EQ-Combo gemacht, währenddessen Red gesmited (vermutlich smiteless start) und mich mit 1 oder 2 Schlägen getötet nach/während dem Knockup.","replies":[]}]}]}]}]}]}]}]}