{"poster":"FloOrWeed","date":"2017-04-19T00:23:06.944+0000","title":"A que se deben los 117 dias? jajajaja","subforum":"Charlas Generales","up_votes":1,"down_votes":18,"body":"A que se debe que el ban que me dieron en una cuenta sea de 117 dias y no de 14?, osea wtf? jajajajajaja","replies":[{"poster":"Excalibeer","date":"2017-04-20T14:20:15.089+0000","up_votes":10,"down_votes":1,"body":"Pense que te referías a la cuenta FloOrWeed.  Si es la cuenta Lëgolas, te pido disculpas, el ban tenía que ser permanente, no 117 días.  \n\nAhora está arreglado, gracias.\n\n-Excalibeer","replies":[{"poster":"Naxoo 7u7","date":"2017-04-20T17:27:32.164+0000","up_votes":1,"down_votes":0,"body":"Tryhard!","replies":[]},{"poster":"Charlôtte","date":"2017-04-20T15:27:57.053+0000","up_votes":1,"down_votes":0,"body":"Uff... Durísimo...","replies":[]},{"poster":"FloOrWeed","date":"2017-04-20T15:37:35.261+0000","up_votes":1,"down_votes":2,"body":"Jajaja tranquilo lince intergalactico, esta hace como 1 mes asi, me surgio la curiosidad, si me importara hubiera preguntado al instante jajajaja","replies":[]}]},{"poster":"Teemo Stahp Pls","date":"2017-04-19T00:26:06.714+0000","up_votes":2,"down_votes":0,"body":"Por lo menos no fue un permaban {{sticker:slayer-pantheon-thumbs}} {{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"EXDOTEROQL","date":"2017-04-19T01:13:07.095+0000","up_votes":1,"down_votes":2,"body":"es mas aburrido esperar 20 minutos antes de cada partida y todo por no querer pelear y quedarse bajo torre en una partida injusta en aram ve mi historial termine 1-1-0 creo?,  y yo era {{champion:56}}  contra 2 soportes y 3 tiradores que ascoo riot me da {{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"FloOrWeed","date":"2017-04-19T00:30:23.421+0000","up_votes":1,"down_votes":2,"body":"Pero a vos no te causa curiosidad? jajaja a mi si...","replies":[]}]},{"poster":"Desaroll","date":"2017-04-19T00:26:40.670+0000","up_votes":2,"down_votes":1,"body":"¿En que cuenta? Así pueden mirarlo.","replies":[{"poster":"FloOrWeed","date":"2017-04-19T00:29:58.749+0000","up_votes":1,"down_votes":7,"body":"Lëgolas, que yo sepa los voluntarios no cuentan con permisos de manipular cuentas jajaja","replies":[{"poster":"Desaroll","date":"2017-04-19T00:31:42.468+0000","up_votes":2,"down_votes":1,"body":"Por eso dije \"pueden\" ;-)\n\nPuedo pasarle el caso al rioter que decida mirar, pero necesito un nombre >_<\n\nSuerte!","replies":[{"poster":"FloOrWeed","date":"2017-04-19T00:34:57.912+0000","up_votes":1,"down_votes":10,"body":"Jajajaja tranquilo maquina, nadie te salta al cuello jajaja\n\nAdemas alguna vez en la vida un rioter o algo se retractaron a cerca de un ban?, no jaja entonces?, ademas que me da igual, solo me dio curiosidad por que fueron 117 dias y no 14 nada mas...","replies":[{"poster":"reboxer","date":"2017-04-19T01:12:14.193+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"FloOrWeed","date":"2017-04-19T01:14:30.578+0000","up_votes":1,"down_votes":1,"body":"Tranquilo maquina, que fue hace 1 mes esto pero hoy me acorde y me dio curiosidad jajajaja, si estas preocupado por mi ya tengo otras cuentas lvl 30, asi que tranquilizate lince jaja","replies":[]}]},{"poster":"Desaroll","date":"2017-04-19T00:46:20.608+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=FloOrWeed,realm=LAS,application-id=v7qsfXsE,discussion-id=mklhdp5A,comment-id=0001000000000000,timestamp=2017-04-19T00:34:57.912+0000)\n>\n> Ademas alguna vez en la vida un rioter o algo se retractaron a cerca de un ban?, no jaja entonces?\n\nDe hecho sí, hubo un caso en que Excali desbaneo a alguien que vino por foro... Era un caso raro, pero existió, así que nunca descarto la posibilidad xD\n\nAquí está (Gracias Google xD): https://boards.las.leagueoflegends.com/es/c/charlas-generales/jshEqjmL-baneo-injustificado\n\nPor el mismo motivo se lo pasé, me llama la atención la cantidad de días. Si fue error humano o de sistema, mejor que lo corrijan antes que hayan otros casos.\n\nAhí ya se lo dejé, si lo ve te responde ;-)\n\nSuerte!","replies":[{"poster":"FloOrWeed","date":"2017-04-19T00:50:27.148+0000","up_votes":1,"down_votes":7,"body":"Correccion, se que hubo cientos de casos de desbaneo, solo por pagos fraudulentos que despues terminaron en el pago correspondiente. \n\nEse solo fue un caso extremo, no creo que haya otro similar, lo mio fue por flameo, como te dije, no pido desban nunca me humille tanto para rebajarme a que me quiten el ban, solo es curiosidad, lo mismo que vaya la policia a tu casa y te diga, señor lo arrestamos, y por dentro te sale: \"jajaja por que me arrestan?\" es obvio que uno quiere saber, yo se el motivo, pero no porque los 117 dias jajaja","replies":[]}]}]}]}]}]},{"poster":"Zevko","date":"2017-04-19T01:07:33.167+0000","up_votes":1,"down_votes":0,"body":"sacale screen jaja wtf..","replies":[{"poster":"FloOrWeed","date":"2017-04-19T01:12:56.164+0000","up_votes":1,"down_votes":0,"body":"http://imgur.com/a/qEpfO\n\nJajajaja lo bueno es que ya paso 1 mes casi we jajaja faltan 2 mas y listo B-)","replies":[{"poster":"Zevko","date":"2017-04-19T01:40:47.153+0000","up_votes":1,"down_votes":0,"body":"a nada q ver jajaja, manda soporte y que te den una expliacion de porque no son 14 dias, almenos no es permanente igual XD","replies":[{"poster":"FloOrWeed","date":"2017-04-19T01:44:05.310+0000","up_votes":1,"down_votes":0,"body":"Naaa mucha paja, tardan una banda en contestarte y solo leen el titulo, lo digo por experiencia, como cuando me hicieron hacer 300 test, pruebas y demas cuando pregunte por que tenia tantos ms, me afirmaron al 100% que era la ruta que elegia mi distribuidor de internet.\n\nDespues formatee la pc y volvi a los 32 ms, osea wtf?, no era la ruta?, ahi te das cuenta que \"hacen\" como que investigan pero contestan siempre lo mismo...","replies":[{"poster":"Zevko","date":"2017-04-19T05:10:35.154+0000","up_votes":1,"down_votes":0,"body":"van a tardar mas de 117 dias en responderte jajaja?","replies":[]}]}]},{"poster":"EXDOTEROQL","date":"2017-04-19T01:26:25.247+0000","up_votes":1,"down_votes":0,"body":"no god please no no god noooooooooooooooooooooooooo , hahahaha","replies":[]}]}]},{"poster":"EXDOTEROQL","date":"2017-04-19T01:00:51.823+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"FloOrWeed","date":"2017-04-19T01:04:41.462+0000","up_votes":1,"down_votes":0,"body":"No voy a entrar en discucion si el sistema es justo o no, pero que tiene fallas, las tiene, y miles jaja","replies":[{"poster":"EXDOTEROQL","date":"2017-04-19T01:17:16.230+0000","up_votes":1,"down_votes":2,"body":"hermano , yo creo que deberian quitar ese sistema de baneos leavebuster eso es lo que tiene cagado el juego y lo otro es la ridicula obsesion de querer se profesional jugando al lol?, porfavor quien quiere jugar como los guatones que salen en internet , lol es un simple juego nada mas y porque alguna gente que se cree mas que los demas estamos asi, dime que sacas con sacar maestrias como lo hacen algunos en mi otra cuenta tengo a la mayoria de los campeones comprados con maestria 7 y no ano sacando maestria como idiotaa creyendose mas que los demas y la gran mayoria que hace eso son niñas ratas, por eso deje dejare de jugar ya no es agradable jugar al lol , almenos no como era antes , recuerdo que antes nos agarrabamos pal webeo en el chat general y nos agarrabamos a garabatos como retardados mentales xd y eso es lo que hace entretenido el juego le guste a quien le guste uno es como es y no voy a ser como riot quiere que seamos unos mansitos jugadores  lameculos , riot te caga a la primera oportunidad y te aplica su sancion, cuanta gente a perdido dinero por invertir en sus cuentas y luego son baneadas?piensen en eso cabros, ami jamas me han baneado solo esta cuenta ahorita tengo cola de baja prioridad de 20 minutos y todo por quedarme detras de la torre sin poder hacer nada tratando de pelear contra rangos {{sticker:zombie-brand-facepalm}} ","replies":[]}]}]}]}