{"poster":"unlikelychanceZ","date":"2015-05-16T04:20:45.035+0000","title":"Fix Zilean's entire kit with 1 easy change.","subforum":"Gameplay","up_votes":73,"down_votes":27,"body":"The Q after casting rewind becomes a targeted ability.","replies":[{"poster":"EMOFRATPARTY","date":"2015-05-16T15:57:58.944+0000","up_votes":18,"down_votes":0,"body":"Buzzfeed writers are taking over the boards!","replies":[]},{"poster":"Aria Valkyrie","date":"2015-05-16T09:43:15.107+0000","up_votes":18,"down_votes":0,"body":"I think less of making it a targeted ability, and rather making it auto-lock on a target with a bomb, like with urgot's kit. have the first be a skillshot, and the second auto-lock stun. i think that would help the kit be more. . . a kit.","replies":[]},{"poster":"Bethor Kookalian","date":"2015-05-16T05:38:51.945+0000","up_votes":22,"down_votes":19,"body":"OP Claims to have idea to fix Zilean's kit.  Proceeds to re-add the broken part of Zilean's kit back in.","replies":[{"poster":"ZPIN2WIN","date":"2015-05-16T06:23:30.650+0000","up_votes":18,"down_votes":8,"body":"Have you tried double bombing an ally?\n\nI didn't think so.\n\nHave you seen a {{champion:26}} land double bombs in a 1v1?\n\nI didn't think so.\n\nWill {{champion:26}} bully in lane with this change?\n\nNot unless you're a potato.\n\nThe proposed change is ironic, but then again every champion needs some sort of reliability to their damage. Even {{champion:432}}, a champion with 1 damage spell like Zilean gets a thick skillshot and an auto attack modifier. Same for {{champion:37}}, she got reworked and kept her Q, which you can't really do anything beside step out of her range to avoid damage.\n\nI'm in for this change.","replies":[{"poster":"Bethor Kookalian","date":"2015-05-17T05:35:41.892+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ZPIN2WIN,realm=NA,application-id=3ErqAdtq,discussion-id=Zxo374WM,comment-id=00030000,timestamp=2015-05-16T06:23:30.650+0000)\n>\n> Have you tried double bombing an ally?\n> \n> I didn't think so.\n\nNope, but only because I don't play Zilean.  I'm perfectly capable of doing this.\n\n> [{quoted}](name=ZPIN2WIN,realm=NA,application-id=3ErqAdtq,discussion-id=Zxo374WM,comment-id=00030000,timestamp=2015-05-16T06:23:30.650+0000)\n> \n> Have you seen a {{champion:26}} land double bombs in a 1v1?\n> \n> I didn't think so.\n\nYes, all the time, well, within the very rare games I've seen a Zilean in.\n\n> [{quoted}](name=ZPIN2WIN,realm=NA,application-id=3ErqAdtq,discussion-id=Zxo374WM,comment-id=00030000,timestamp=2015-05-16T06:23:30.650+0000)\n> Will {{champion:26}} bully in lane with this change?\n> \n> Not unless you're a potato.\n\nHe'll bully -more- with this change, and in a way that's not very healthy, and it has absolutely nothing to with tubers.\n\n> The proposed change is ironic, but then again every champion needs some sort of reliability to their damage. Even {{champion:432}}, a champion with 1 damage spell like Zilean gets a thick skillshot and an auto attack modifier. Same for {{champion:37}}, she got reworked and kept her Q, which you can't really do anything beside step out of her range to avoid damage.\n> \n> I'm in for this change.\n\nI'm against the change cause I'd like to see power added to his kit elsewhere, in ways that make him more interesting to play against, not less.\n\nBard's Q has a very thin projectile unless you hit a target, and a very short but thick secondary projectile for the stun.  In otherwords, *VERY* unreliable.\n\nAnd Sona.....patron saint of bad example, here, no?  She's had lots of her power funneled away from her damage and burst and massive range auras and into her new snuggle zones, all while Riot admitted that the aforementioned parts of her kit weren't great places for power.","replies":[]},{"poster":"insaiyanbacca","date":"2015-05-16T21:55:01.581+0000","up_votes":2,"down_votes":2,"body":"i have seen zil land double bomb 1v1 ive done it ive also double bombed an ally it isnt hard just learn how to hit a skillshot","replies":[]},{"poster":"Solidair3","date":"2015-05-16T13:04:58.895+0000","up_votes":5,"down_votes":14,"body":"I do all of those things all the time. try being a little predictive dude.","replies":[]},{"poster":"fred loue","date":"2015-05-16T10:11:52.149+0000","up_votes":4,"down_votes":16,"body":"I have seen it and done it.\n\nQ -> E enemy -> W -> Q  Repeat until everyone targets you and then R before they can kill you.\n\nAlso landing 2 on any entity causes the aoe stun. Try doing it on your stun/taunt team diver like {{champion:32}}  or {{champion:3}}. His W is almost a root except people will still try to full run instead of throwing anything back at you. Use it.\n\nAs for {{champion:432}} Q vs {{champion:26}} Q? Zilean can throw his Q over minions and has more range while trying to shoot bards Q thru minions is hard because they need to be right by the minion since hitting a minion cuts the range past it down to a sliver.","replies":[]}]},{"poster":"poo23face","date":"2015-05-16T21:22:39.428+0000","up_votes":10,"down_votes":5,"body":"You fucking retarded dipshit. Zilean's exact problem right now is that he lost all reliability, the problem of the kit is lack of reliability. Of course it is a good solution.\n\nBack in the day, Zilean could've bullied lane harder than {{champion:1}}. And guess what? People didn't complain about that. Even {{champion:50}} could've beaten Zilean in a point click war.\n\nAs a mage, having 1 Q out of 3 be reliable won't break a champion. Leblanc's Q->W is essentially point click, nothing is being done. Zed's W->E is essentially point click, stop being retarded. A combo oriented spell is allowed to be guaranteed.","replies":[]}]},{"poster":"Chaotic Reks","date":"2015-05-16T04:48:31.661+0000","up_votes":10,"down_votes":1,"body":"or after the first cast","replies":[{"poster":"Rew711","date":"2015-05-16T15:23:04.670+0000","up_votes":2,"down_votes":1,"body":"or allow his E to give a bonus and take away 2/4/6/8/10% AS. It would make sense, since he slows or speeds up time.","replies":[]}]},{"poster":"ImperialKain","date":"2015-05-16T07:03:47.543+0000","up_votes":9,"down_votes":1,"body":"Or just make it a targeted ability once the enemy gets to close, something like how bard's 'w' because targeted when cast on a ally. This would stop enemies from just diving him because they have the mobility to dodge his slow 'q' and that hard to hit stun. I still think that a champion with one damage skill should be more reliable than what they gave him.","replies":[{"poster":"qetzel","date":"2015-05-16T13:42:41.291+0000","up_votes":1,"down_votes":7,"body":"They would have to keep the range at something stupid like 200 units for that. Otherwise we go right back to the start.","replies":[]}]},{"poster":"YOU BEEN WARNED","date":"2015-05-16T04:29:37.520+0000","up_votes":8,"down_votes":1,"body":"I like it, so basically W will work like a stance changing ability.","replies":[]},{"poster":"Spacesuit Spiff","date":"2015-05-16T21:59:16.718+0000","up_votes":4,"down_votes":0,"body":"Amusing, since he would be effectively rewinding to his old Q","replies":[]},{"poster":"THESuperStuntMan","date":"2015-05-16T21:31:52.802+0000","up_votes":4,"down_votes":0,"body":"It really wouldn't fix him. He'd still be bad.","replies":[]},{"poster":"OyddAWqJ5r","date":"2015-05-16T14:15:27.277+0000","up_votes":2,"down_votes":0,"body":"Or just let him detonate unattached bombs by throwing another bomb on it. Then you can QWQ in an open area to try and stun all surrounding enemies.","replies":[]},{"poster":"LankPants","date":"2015-05-16T10:20:24.284+0000","up_votes":2,"down_votes":0,"body":"If a target with a bomb on them is in the bombs lock on range it prioritises them over other targets.\n\nWouldn't 100% fix Zil but it makes a lot of sense.","replies":[]},{"poster":"CoolKnightST","date":"2015-05-16T14:46:22.153+0000","up_votes":1,"down_votes":1,"body":"What if whe add an throwback (when near the bomb) & a throwup (when the bomb is attached) to the Q.\n\n But my favorite change would be on the E that would return a targetted enemy champion back to his original location where he was 2.5 seconds ago. The animation can let him walk backwards (bit like fear but now with a solid location). Would also be really powerfull against tp plays.","replies":[{"poster":"Ariel the Cruel","date":"2015-05-16T23:33:21.462+0000","up_votes":2,"down_votes":1,"body":"They tried that idea, but then someone went and stole the ability for them self.\nRumor has it, there's a suspect hiding in the PBE.","replies":[]}]},{"poster":"551202","date":"2015-05-16T13:56:34.316+0000","up_votes":1,"down_votes":6,"body":"or just give him a visual upgrade, its what he need the most right now.","replies":[]},{"poster":"TNHA Baritone","date":"2015-05-16T20:34:59.495+0000","up_votes":1,"down_votes":7,"body":"His rework makes him need more skill. The most disappointing part of his Kit is the nerfs to his ult. Other wise I'm good with the changes.","replies":[]},{"poster":"Solidair3","date":"2015-05-16T13:04:20.668+0000","up_votes":1,"down_votes":7,"body":"That would be way too powerful, he'd have to lose the aoe stun.\n\nHis kit is fine, just practice with it","replies":[]},{"poster":"MadDoughnutz","date":"2015-05-16T04:49:49.716+0000","up_votes":3,"down_votes":14,"body":"I'd be happy with simply more range on Zilean's Q. Say 50-100.\n\nHe already has powerful zoning in lane with it, and it's a skillshot that's not too hard to land. Adding range gives him more power AND safety.","replies":[{"poster":"Saianna","date":"2015-05-16T06:35:48.920+0000","up_votes":4,"down_votes":2,"body":"Are you sure you are talking about Zilean?\n\nCause your post somehow fits Zeds description more...","replies":[]}]}]}