{"poster":"L0u","date":"2017-12-06T19:09:25.317+0000","title":"League Display Error (urgent pls help)","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"When i try to open League Displays, it instantly opens a bugsplat error message.\r\nI've tried everything but it still doesnt work!\r\n{{sticker:sg-shisa}} \r\nPlease help!","replies":[{"poster":"Porocles","date":"2017-12-06T19:18:18.292+0000","up_votes":2,"down_votes":0,"body":"I'd like to help, but when you say everything Id on't know what that means.  ><  Unless your drivers might be having issues, I'm betting the app didn't install properly and causing a failure to load.  See if reinstalling might help here and update your drivers with our [crash](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes+) guide.","replies":[]},{"poster":"Riot wuddaheq","date":"2017-12-13T00:01:10.632+0000","up_votes":2,"down_votes":0,"body":"Hey there! \n\nDo you by chance have any non English or special characters in your computer username? Originally we had not accounted for players who may have special characters in their computer username (e.g. D@NK M3M3S). We've fixed this particular issue so that it works with all usernames. While we understand this may be a hassle, you’ll need to [download a fresh version of the app](http://na.leagueoflegends.com/en/featured/league-displays) from and perform a clean install.\n\nIf this doesn't work, let us know and we'll try and work through this with you! You can check the [FAQ ](https://support.riotgames.com/hc/en-us/articles/207525756))for updates as we'll try to post solutions for different bugs as they come in.","replies":[{"poster":"Electro522","date":"2017-12-13T00:36:56.247+0000","up_votes":2,"down_votes":0,"body":"Hello wuddaheq!\n\nMind if I ask if it will ever be possible to make the animated screen savers your wallpaper? I only use a laptop, so, I never get a screensaver. Besides, who wouldn't want the awesome animations as their backdrop?","replies":[{"poster":"Riot wuddaheq","date":"2017-12-13T00:47:59.647+0000","up_votes":2,"down_votes":0,"body":"We don't currently have a solution that doesn't compromise performance. If we find something that works we'll be sure to let you know!","replies":[]}]}]},{"poster":"Battalion","date":"2017-12-13T07:34:16.997+0000","up_votes":1,"down_votes":0,"body":"As Porocles stated; it's very difficult to diagnose a problem with \"everything\" is going wrong. If that is the case, I suggest you find shelter before the aliens try beaming up your house. Likewise, if you have tried everything, then I would suggest writing memoirs for a profit. \n\nBad jokes aside. Much of can be solved regarding applications can be fixed using the inbuilt repair feature; the League of Legends client also has this feature. You can find this feature under the settings menu on the launcher before you are asked to log in. If you cannot get to that menu before the client crashes then you need to use a fresh install. Go to your control panel and delete your program that way (right click and uninstall from the control panel programs menu). Restart your computer and then download the latest offered client from the League of Legends website. \n\nIf this doesn't help. Then I would suggest contacting Player Support. If you're getting bug-splat you should have the option to send in your crash reports; do so. \n\nHope everything works out for you. \n\n{{sticker:slayer-pantheon-popcorn}}\n\n\nEdit: I didn't see that I was a week late to this topic. My apologies on the necro.","replies":[]}]}