{"poster":"Pycckuu007","date":"2017-01-12T21:11:46.370+0000","title":"BOOSTING JOB","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"Hi there people I have one question, I was playing a game the other day in low silver and this player was just too good ( he was playing zed at the time) long story short is I got carried but felt sorry for the enemy team, this dude had 20 kills and 4 deaths. So I decided to check his account out and he had only wins in the match history and all the scores were about the same as in the game that I have played with him, so I used Op.gg to look him up and he has 27 wins and 2 losses at the moment so My Question is, how do i report this player for boosting and what do Riot do about it? his name is [REMOVED] and here&#039;s the op.gg link [REMOVED]","replies":[{"poster":"SEKAI","date":"2017-01-12T21:33:51.116+0000","up_votes":3,"down_votes":0,"body":"He mains, Riven and Yasuo AT THE SAME TIME?? Wow the guy is already obnoxious. Punish, PUNISH!!1!!!\n\nBut really, when you see someone very close to 100% win rate (and actually so when they're playing their main champs), I think it isn't exactly wrong to suspect that there might be fouls involved. The fact they rose to Silver1 from Silver4 within a month when previously they've been stagnating in Silver4 and Silver5 for 3 months aren't really helping his case; not to mention he also made a jump from Bronze4 all the way to Silver5 within a month too, when before he dropped from Bronze2.\n\nIdk, my suspicion is rising. The chances of being either a smurf or boosted is getting more likely.\n\n....................\n\nEDIT\n\nNew update: This guy completed 2 promos in a row from Silver4 100LP and was already on Silver2 73LP between 10/1/17 and 11/1/17, this guy literally nearly climbed 2 full divisions in a single day, then another right after that. So they didn't actually rise from Silver4 to his current Silver1 within a month (like I initially thought), but within 2 to 3 days.\n\nhmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm\n\nAnd really, it couldn't be that they'd decayed, since there is no decaying in Gold and below afaik.","replies":[]},{"poster":"Neosinf","date":"2017-01-12T21:25:26.345+0000","up_votes":1,"down_votes":0,"body":"Well that's really presumptuous.\n\nCould be that his account decayed to the fetid depths of elo hell where you currently preside, and it's taking him 30 games to rise above the mire.\n\n[REMOVED] at least deserves a chance to explain himself. You probably feel worse after posting here, as if you feel you've betrayed modern society with it's fair justice system.\n\nATONE AND SEEK REPENTANCE.","replies":[{"poster":"Mortis Ex","date":"2017-01-14T03:59:51.953+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Neosinf,realm=OCE,application-id=T8eq2lFQ,discussion-id=8y5yQLRa,comment-id=0000,timestamp=2017-01-12T21:25:26.345+0000)\n>\n> Well that&#x27;s really presumptuous.\n> \n> Could be that his account decayed to the fetid depths of elo hell where you currently preside, and it&#x27;s taking him 30 games to rise above the mire.\n> \n> [REMOVED] at least deserves a chance to explain himself. You probably feel worse after posting here, as if you feel you&#x27;ve betrayed modern society with it&#x27;s fair justice system.\n> \n> ATONE AND SEEK REPENTANCE.\n\nElo Decay does not occur for players in Bronze, Silver, and Gold.","replies":[]},{"poster":"Pycckuu007","date":"2017-01-12T21:32:14.109+0000","up_votes":1,"down_votes":0,"body":"well he was silver last season and the season before that and now he is climbing and already near gold, its impossible to have wins only and carry every game when you are silver on your main.","replies":[{"poster":"Fearfulcheez","date":"2017-01-13T09:20:28.115+0000","up_votes":1,"down_votes":0,"body":"You can get better overnight in someways and I have got my smurf from sliver 1 to gold 3 in a day however check if his sums are switched for a clue if he is bossred. also if he plays alot of normals between ranked sessions mabye he just got better and climbed himself. and trust me carrying every game at sliver is not hard games take so long if you can punish a mistake hard enough and with 40min+ games you can you will climb.","replies":[]}]}]}]}