{"poster":"Eromisu","date":"2016-08-11T13:50:45.959+0000","title":"I'm Banned for the third time in a row","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"as I said, the client always crashes... and that lead me to loosing points in ranked and also being banned for the next 5 matchmaking. am so tired of this Riot. Fix your client.","replies":[{"poster":"Porocles","date":"2016-08-11T15:43:33.930+0000","up_votes":2,"down_votes":0,"body":"Assuming by ban you mean the lower priority queue, the only way to recover is through consistent play without interruption.  The best way to make that work is by resolving whatever is causing you to crash.  I'd like to help if you figure that out, but I need more information on the issue you're experiencing.  For example, what do you mean exactly by crash?  Are you receiving any error messages and what does it say?  What is happening exactly just before it happens?  Let me know!","replies":[{"poster":"Eromisu","date":"2016-08-11T20:29:48.743+0000","up_votes":1,"down_votes":0,"body":"Thanks for the reply,\nwhat happen is actually the game client process in task manager is working. but i got nothing. there's one time i only heard re-spawning sound and comments, yet, the app is not opened. and when i reconnected... my team already remade the match.","replies":[{"poster":"Porocles","date":"2016-08-11T20:36:11.606+0000","up_votes":1,"down_votes":0,"body":"Thanks for the follow up.  If you are hearing game sounds but can't see the game then you may be having an issue with your game failing to render properly.  I recommend going over our [game crash](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes+) guide as a first step to rule out any driver, hardware, or game file issues.  Let me know if you have any issues afterwards!","replies":[{"poster":"darkdill","date":"2016-08-11T20:38:49.894+0000","up_votes":2,"down_votes":0,"body":"Also, when you're testing to see if things have been fixed, use Custom Games, not Normals, Ranked, ARAM, etc. You don't get punished for leaving Customs.","replies":[]}]}]}]}]}