{"poster":"t3emo2016","date":"2016-04-12T04:49:39.723+0000","title":"Hextech","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Hilfe habe ausversehen skin pulverisiert der wohl irgendwie legend&auml;r war also kann ich den nicht irgendwie wieder bekommen ? :(","replies":[{"poster":"Günther OhMad","date":"2016-04-12T07:57:57.697+0000","up_votes":1,"down_votes":2,"body":"leider macht der support nichts mit hextech sachen... ich hatte an anfang einen fehler begannen und die reroll funktion benutzt (welche ich swachsinnig finde), da ich gedacht habe man kann keinne permanenten skins für championss bekommen die man nicht hat.... ich hatte um das zurücksetzten meines accs gebeten, mit der mitteilung diese Funktion nie wieder zu benutzten.... aber das support hilft da leider nicht... nichtmals bei fehlern ddie passieren weil das system zu neu war... dann bestimmt erst recht nicht wenns ein persöhnlicher fehler war, und nicht aus unwissenheit bei neuerungen.... tut mir leid, aber der ist wohl weg... ich sittzt jetzt aauch auf einen permanenten skin für einen champion den ich nicht haben will weil ich ihn schlecht finde UND er teuer ist","replies":[{"poster":"HiiiiiPower","date":"2016-04-12T08:15:55.907+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Günther OhMad,realm=EUW,application-id=7hciEY9w,discussion-id=xTzUp19Z,comment-id=0002,timestamp=2016-04-12T07:57:57.697+0000)\n>\n> leider macht der support nichts mit hextech sachen... ich hatte an anfang einen fehler begannen und die reroll funktion benutzt (welche ich swachsinnig finde), da ich gedacht habe man kann keinne permanenten skins für championss bekommen die man nicht hat.... ich hatte um das zurücksetzten meines accs gebeten, mit der mitteilung diese Funktion nie wieder zu benutzten.... aber das support hilft da leider nicht... nichtmals bei fehlern ddie passieren weil das system zu neu war... dann bestimmt erst recht nicht wenns ein persöhnlicher fehler war, und nicht aus unwissenheit bei neuerungen.... tut mir leid, aber der ist wohl weg... ich sittzt jetzt aauch auf einen permanenten skin für einen champion den ich nicht haben will weil ich ihn schlecht finde UND er teuer ist\n\nEs ist so unfassbar was für eine Heulsuse  du bist. Überall beschwerst du dich über die Random Werkstatt. Ich persönlich würde es cool finden, wenn Riot dir diese Funktion permanent wegnehmen würde, da du eh nur herummoserst wie scheiße das doch alles ist und du ja auf Skins hockst, deren Champ du nicht besitzt oder Skins die du gar nicht haben möchtest...Unfassbar einfach. Wie kann man nur so undankbar sein?","replies":[{"poster":"Günther OhMad","date":"2016-04-12T10:26:47.990+0000","up_votes":1,"down_votes":2,"body":"ersten mal galt dieser post der information weil ja einige meinten vielleicht dem support melden und zweitens beschwere ich mich nicht über die hextech weerkstatt ssondern nur über das rerollen.... und wenn die mir das wegnehmen würden wäre mir das auch scheiss egal.... aber ich seh ja dein niveu, wo du schon andere Leute beleidigen musst, weil sie ihre Meinung sagen, und deshalb ist mir das relativ egal....","replies":[{"poster":"HiiiiiPower","date":"2016-04-12T10:46:25.512+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Günther OhMad,realm=EUW,application-id=7hciEY9w,discussion-id=xTzUp19Z,comment-id=000200000000,timestamp=2016-04-12T10:26:47.990+0000)\n>\n> ersten mal galt dieser post der information weil ja einige meinten vielleicht dem support melden und zweitens beschwere ich mich nicht über die hextech weerkstatt ssondern nur über das rerollen.... und wenn die mir das wegnehmen würden wäre mir das auch scheiss egal.... aber ich seh ja dein niveu, wo du schon andere Leute beleidigen musst, weil sie ihre Meinung sagen, und deshalb ist mir das relativ egal....\n\nNIVEU...Oh Günni, oh Günni...Und da steht auch keine Beleidigung, sondern die Wahrheit, aber die kannste halt nicht ab.\n\nDu meinst die Rerollfunktion sei sinnlos, was ist daran sinnlos? Du rollst 3 Skinsplitter weg und bekommst dafür dann einen perma (wofür du keine Essenzen mehr benötigst, finde ich fair, du findest es doof und unfair), es zwingt dich ja keiner zum Rerollen. Besitzt du den Skin nicht, kannst du diesen sogar erneut zum Rollen oder Eintauschen verwenden.","replies":[{"poster":"Günther OhMad","date":"2016-04-12T11:26:10.054+0000","up_votes":1,"down_votes":0,"body":"ich werde diese funktion auch nichtmehr nutzten... ich hab mich bloss aufgeregt das nicht drqauf hingewiesen wurde das man neuerdings \"skins\" bekommen kann für champions die man nicht hat... und weil ich deshalb etwas verschwendet habe... das ging vorher nähmlich nicht wie du weisst... und hier wollte ich mich nicht beschwereen sondern informieren","replies":[]}]}]}]}]},{"poster":"dugg","date":"2016-04-12T05:18:55.382+0000","up_votes":2,"down_votes":0,"body":"Das ist dann wohl PP. Schreib den Support an, entweder sich machen es oder nicht.","replies":[]},{"poster":"Freiherr Alex","date":"2016-04-12T05:06:03.598+0000","up_votes":1,"down_votes":0,"body":"was weg ist ist weg...da musst du wohl nächstes mal mehr aufpassen...\nwünsche dir viel glück bei deinen nächsten kisten :)","replies":[]}]}