{"poster":"RedOpticToxin","date":"2020-02-25T01:00:19.526+0000","title":"The League Police","subforum":"Player Behavior","up_votes":1,"down_votes":0,"body":"Not Riots fault by any means but it's sad to see that the biggest problem with this game is the community toxicity of all forms (hard inting, afk, soft inting, intentionally poor item builds, etc.). If the real world did not have a police force then everyone would commit crime which is currently what is happening on this game. The Fix is a police force online that monitors bans and acts as the judge, jury, and executioner. Dont try to tell me that it is hard to identify inting vs playing poorly we all know thats simply not true.","replies":[{"poster":"zPOOPz","date":"2020-02-25T01:01:52.960+0000","up_votes":4,"down_votes":0,"body":"The real world does have a police force (multiple agencies in fact) and yet everyone would STILL commit crimes every single day so not sure what your point is.\n\nThink of it like stopping speeders.  Sure cities can deployed all its police force to sit on the highway and people would slow the fuck down when driving by them.  But the sheer numbers of drivers (player base) and the sheer number of highways (games played per day) make it impractical to be able to have enough police force (employees) to monitor every speeders/road (players/games).","replies":[{"poster":"RedOpticToxin","date":"2020-02-25T01:07:23.484+0000","up_votes":1,"down_votes":3,"body":"World has police = significantly less crime. World without police = significantly more crime. Same goes for league. Ban system here is garbage and needs to be reformed it doesnt penalize inters at all so people are more likely to commit these acts because they know they can get away with it.","replies":[{"poster":"zPOOPz","date":"2020-02-25T01:08:58.813+0000","up_votes":5,"down_votes":1,"body":"https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/uQo7TeYZ-having-a-poor-performance-counts-as-intentional-feeding\n\n\"doesnt penalize inters at all\"","replies":[{"poster":"RedOpticToxin","date":"2020-02-25T01:15:14.272+0000","up_votes":1,"down_votes":7,"body":"Thats unfortunate, however if there was a mediator looking over your ban then you would have been innocent because they could have analyzed your game and saw that you were trying very hard despite the circumstance.","replies":[{"poster":"zPOOPz","date":"2020-02-25T01:29:21.371+0000","up_votes":3,"down_votes":0,"body":"didn't really read the thread did ya?","replies":[]}]}]},{"poster":"TrulyBland","date":"2020-02-25T10:15:32.392+0000","up_votes":1,"down_votes":0,"body":"So, since you're talking about \"significantly more\" and \"significantly less\", might I ask what you are actually comparing the current state of LoL to?\n\nBecause for all you know it could be true that there are \"significantly less\" inters than if the current system was not in place.","replies":[]}]}]},{"poster":"iBuild","date":"2020-02-25T01:18:01.635+0000","up_votes":3,"down_votes":0,"body":"Ok. What's your solution? I swear if you say Tribunal I will... Walk away. :)","replies":[{"poster":"NF Remilia","date":"2020-02-25T09:57:26.186+0000","up_votes":1,"down_votes":1,"body":"Dont mention Tribunal please! That thing was so slow that the offender will play for few seasons....will get married have kids, their kids will go to school and then his case will be open for review... Blah!","replies":[]}]},{"poster":"Tele II","date":"2020-02-25T06:47:59.609+0000","up_votes":2,"down_votes":0,"body":"Now think of all the resources it takes to have a police force and judicial branch of the government.","replies":[{"poster":"Nightsky Pirate","date":"2020-02-25T06:57:40.832+0000","up_votes":2,"down_votes":1,"body":"I blame you for making me think of a League Behavior Police Force theme song complete with animated dance sequence. Of course Caitlyn was in it, I'm not uncouth.\n\nReally, though, it wouldn't be some grand expense to work toward something better, learning from the lessons of the past. The answer (you can't stop toxicity) wasn't wrong, the question was (how do you stop toxicity).","replies":[]}]},{"poster":"Posui Gart","date":"2020-02-25T10:16:11.524+0000","up_votes":2,"down_votes":1,"body":"> Dont try to tell me that it is hard to identify inting vs playing poorly we all know thats simply not true.\n\nBut it is. Unless someone is literally running it down or picking smite on support and stealing jungle camps from ally jungler, it might as well be playing bad.\nAlso I don't really want humans to make decisions, they are usually too subjective.","replies":[]},{"poster":"shh im hiddens k","date":"2020-02-25T04:01:04.328+0000","up_votes":1,"down_votes":4,"body":"we need the tribunal back -- riot doesn't do anything, the only thing they care about is the people who flip out on the people who afk/int (hard or soft)/troll/spam ping","replies":[]}]}