{"poster":"Durbatuluk","date":"2017-05-04T20:28:53.938+0000","title":"Teoría sobre el MSI","subforum":"Esports","up_votes":1,"down_votes":0,"body":"Y s&iacute;... termin&oacute; el MSI para LATAM y al final Isurus es un asco, Virtus Pro unos chotos y Lyon unos pechos fr&iacute;os. Encima, el ganador del grupo termin&oacute; sin lograr la gran haza&ntilde;a y qued&oacute; relegado a jugar contra el perdedor de FW - SUP, que est&aacute;n jugando en este momento. FW est&aacute; stompeando a m&aacute;s no poder, y lo m&aacute;s probable es que SUP, el ganador del temido grupo A termine jugando con GAM a ver quien entra por la puerta de atr&aacute;s al cielo.\n\n.\n.\n.\n.\n.\n\nAc&aacute; es a donde introduzco mi teor&iacute;a:\n\n&iquest;Y qu&eacute; si Virtus Pro no es tan choto?\n&iquest;Y qu&eacute; si Isurus no juega tan mal?\n&iquest;Y qu&eacute; si Lyon la rompi&oacute; toda pero los Marines son un equipazo?\n**&iquest;Y qu&eacute; si el grupo A no era tanto como lo inflaron y el grupo B era realmente el _grupo de la muerte_?**\n\nDe hecho, toda la informaci&oacute;n que ten&iacute;amos antes de que empezara todo era muy sin&eacute;rgica con esta propuesta; donde Isurus ven&iacute;a con una preparaci&oacute;n internacional relativamente piola, Lyon estaba en un gran momento y Virtus Pro era un equipo al que hab&iacute;a que temer. Ojo, sab&iacute;amos que GAM ten&iacute;a a Optimus y a Levi, pero como ganaron tan invictos en su torneo, no conoc&iacute;amos realmente su rendimiento ante alguien que juegue (internacionalmente) bien, y no se esperaba una locura de ellos.\n\n> Alguien me podr&aacute; decir que Lyon gano casi sin perder un game (hasta Isurus gano bastante holgado) y de la misma forma no sabr&iacute;amos como se desenvolver&iacute;a en la escena internacional, pero la realidad es que a Lyon lo vemos jugar absolutamente todas las semanas y no nos perdemos ni un minuto de sus grietas, mientras que de Vietnam... bueno, m&aacute;s que lo que nos cuenten dudo que sepamos algo (no creo que ni Skyshock ni Nosfehh ni Rafamaik hayan visto **todos** los partidos de GAM... y si lo hicieron no fue con el enfasis que lo hacemos con nuestros equipos de LAS/LAN). Por esto me parece que nuestras predicciones internacionales muy probablemente sean mas precisas para Lyon que para los Marines.\n\nYo creo que Virtus Pro era un gran equipo, que se choc&oacute; contra Lyon, que est&aacute; hecho una bestia. A su vez creo que el le&oacute;n Mexicano se complic&oacute; con los Marines porque simplemente eran el mejor equipo que las regiones &quot;wildcard&quot; tienen para ofrecer.\nHasta donde sabemos, a TSM le cost&oacute; un huevo ganar esa serie* , y GAM sali&oacute; del grupo B con UNA win m&aacute;s que Lyon. Isurus es un buen equipo que simplemente se llev&oacute; puesta esta topadora de League of Legends.\n\n*: (y nadie me puede discutir que en el game 3 si GAM quer&iacute;a se iba de la base, hac&iacute;a Nashor y pusheaba 1-3-1 para ganarla)\n\n> Como un agregado, tambi&eacute;n creo que el stomp de FW sobre SUP habla mucho de lo que hubiera sido mezclar los equipos de los grupos A y B. De hecho no creo que FW sea superior a TSM como muchos dicen, y creo que a pesar de que el desempe&ntilde;o de los dos en el mundial fue medio croto, Team Solo Mid tiene un **techo** bastante m&aacute;s alto que Flash Wolves.\n\nLo m&aacute;s copado de todo a mi consideraci&oacute;n es que dentro de poco vamos a ver GAM - SUP, y ah&iacute; realmente va a haber un par&aacute;metro tangible que nos permita comparar el grupo A contra el B. De m&aacute;s est&aacute; decir que creo (y espero) que GAM pasee a SUP en un lindo 3-0, 3-1.\n\nDesde ya que todo lo que escrib&iacute; es una opini&oacute;n personal que muy probablemente sea una pelotudez... Es m&aacute;s... Si Supermassive le gana a los Marines 3-0 soy un boludo. Pero si te cabe algo de lo que digo o te parece que soy un gil me encantar&iacute;a que lo comentes.\n\nY bueno, no me queda m&aacute;s que decir que no solo creo que TSM no hubiera stompeado a Lyon, sino que creo que hubiera sido un **GRAN** partido que me hubiese encantado ver, pero bueno... La pr&oacute;xima ser&aacute;...\n\n_Gracias por leer._\n_Argentina + Chile = &lt;3_        \n_LAS + LAN = &lt;3_","replies":[{"poster":"EsteNoEsSinged","date":"2017-05-05T04:43:22.965+0000","up_votes":1,"down_votes":0,"body":"GAM perdonó a TSM en el tercer game que es el mejor de usa. De hecho casi lo estompea ( no me gusta graves jungla, y creo que perdieron mucha ventaja por eso, lo sacaron en todos los games que perdieron, muy predecible en late y ser impredecible es clave con mayor razon cuando ya se hacen mas tankes y no puedes deletear). Si sacaban otro jg yo creo que ganaban facil. \nEn mi opinión FW es muy superior a TSM le hacen la pelea a equipos koreanos. TSM hace jugadas buenas pero se mueve demasiado lento comparado a Flash Wolves que son unas maquinas de la agilidad y se nota que hacen las cosas con holgura dentro de los milisegundos que tienen disponibles en cada jugada.\nTSM le hubiera ganado a Lyon en mi opinion pero Lyon habria sacado por lo menos una partida adelante\nEn cuanto al proximo encuentro, te doy casi firmado que GAM stompea a SUP, demostraron ser mejores que NA y eso ya es bastante.\nPara finalizar decir que si GAM hubiera estado en el grupo A y SUP en nuestro grupo, SUP quizas salia ultimo en el grupo, esta muy a nuestro nivel. Y en ese caso habria ganado Lyon el grupo\nPero esperemos a ver que pasa. Saludos!","replies":[{"poster":"Durbatuluk","date":"2017-05-07T14:41:10.016+0000","up_votes":1,"down_votes":0,"body":"La realidad es que lo que propones es muy cierto; va a estar divertido ver como salen TSM-FW y FW-GAM.\nLo que pones al final es exactamente lo que decía, Que lindo hubiera sido no tener a GAM en el grupo.\nGracias por leer y comentar, saludos.","replies":[{"poster":"EsteNoEsSinged","date":"2017-05-09T03:19:48.165+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Durbatuluk,realm=LAS,application-id=Ky2nrTjR,discussion-id=AmhO5Xtg,comment-id=00000000,timestamp=2017-05-07T14:41:10.016+0000)\n>\n> La realidad es que lo que propones es muy cierto; va a estar divertido ver como salen TSM-FW y FW-GAM.\n> Lo que pones al final es exactamente lo que decía, Que lindo hubiera sido no tener a GAM en el grupo.\n> Gracias por leer y comentar, saludos.\n\nSi, si es exactamente lo que tu decias porque te encontraba la razón xd. Quizas no somos tan malos y en eso tuvo mucho que ver el muy buen nivel de GAM. Si no hubiera estado GAM en nuestro grupo quizas las cosas habrian sido muy diferentes","replies":[]}]}]}]}