{"poster":"Óde To Sleep ","date":"2015-02-26T02:38:21.748+0000","title":"reembolso","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"llevo mas de dos horas esperando a que me devuelvan el rp de un reembolso (dj sona) y todavia no hacen nada. porfavor solucionen este problema ,gaste mucho rp por dj sona para quedar en nada ??","replies":[{"poster":"RiotDesrtPaladin","date":"2015-02-26T04:57:26.082+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=like it 0,realm=LAS,application-id=X54mVVp0,discussion-id=H365Euc7,comment-id=,timestamp=2015-02-26T02:38:21.748+0000)\n>\n> llevo mas de dos horas esperando a que me devuelvan el rp de un reembolso (dj sona) y todavia no hacen nada. porfavor solucionen este problema ,gaste mucho rp por dj sona para quedar en nada ??\n\n\nSaludos,\n\nRevisando tu cuenta no ha sido reembolsada DJ Sona y no se uso un rembolso.\n\nPuedes intentarlo de nuevo?","replies":[{"poster":"Arizen07dubakin","date":"2015-03-07T19:13:04.825+0000","up_votes":1,"down_votes":0,"body":"Hola amigo me podrias ayudar yo si tenia un problema parecido y es q me compre dj sona a penas salio la reembolse por q no me dio los iconos y dije me la reembolso luego de eso no estaba la skin ni los rp me aparece un error como dice el amigo arriba me sorprendi en ver q no era el unico, tiene q ser un error de ustedes yo perdi mas de 2000 rp luego de eso mi madre me dio para comprarmela denuevo pero no es justo q por un error de ustedes se pierda tanta plata si puedes ver mi cuenta y tienen el registro veran q la compre dos veses estaria muy agradecido si me ayudaras de antemano gracias","replies":[]},{"poster":"Óde To Sleep ","date":"2015-02-26T16:57:04.086+0000","up_votes":1,"down_votes":0,"body":"es que ese es el problema ahora no puedo reembolsarla me sale no reembolsable y ya no la puedo ocupar mas y solo tengo los iconos hasta me sale que me la puedo comprar denuevo :/ porlomenos devuelvanme a dj sona si quieres revisa mi cuenta y todo ya no la puedo usar y no la puedo reembolsar es raro y me preocupa","replies":[]}]},{"poster":"Óde To Sleep ","date":"2015-02-26T17:19:57.367+0000","up_votes":1,"down_votes":0,"body":"es q porlomenos devuelvanme a dj sona es lo mismo","replies":[]},{"poster":"Óde To Sleep ","date":"2015-02-26T02:53:11.334+0000","up_votes":1,"down_votes":0,"body":"porlomenos diganme que van a tratar de hacer algo para tranquilizarme pls {{champion:83}}  \n\nme desilucionan {{item:3151}} \n","replies":[]}]}