{"poster":"jabk","date":"2018-12-04T22:33:21.512+0000","title":"Es posible conseguir la skin de jax pax","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"Quiero saber si es posible conseguir la skin de jax pax por cajitas","replies":[{"poster":"pl4yer","date":"2018-12-18T08:26:48.182+0000","up_votes":1,"down_votes":0,"body":"si la quieres hacete creador de contenido, Riot esta tan desesperado por marketing que se las esta dando. Literalmente esta escupiendo en la cara de los jugadores mas veteranos...\n\nNice Riot, nice....","replies":[{"poster":"jabk","date":"2018-12-19T16:41:47.504+0000","up_votes":1,"down_votes":0,"body":"Primero no vi el comentario antes o si no respondia y lo otro llendo a lo que dijiste yo lo puse por el tema que estaba entre amigos y pensamos en la skin mas raras nomas y  nos preguntamos sobre si se conseguia y ase unos dias atras nomas me entere lo de los creadores de contenido y en parte de rito algunas skin no debian estar como la de jax pax y algunas otras de unos eventos como la de riben de campeonato de antes y asi con atras skin pero llendo al tema esta bien que los creadores de contenidos tengan algo asi pero las skin raras no tenian que darle nomas para mi pensamiento.","replies":[{"poster":"kurø","date":"2020-01-19T09:30:38.691+0000","up_votes":1,"down_votes":0,"body":"espero que durante el año que pasó desde que escribiste esto hayas aprendido a escribir bien:)","replies":[]}]}]},{"poster":"I WAS IN ALPHA","date":"2018-12-05T03:26:21.135+0000","up_votes":1,"down_votes":0,"body":"No, ya que es una skin de edicion limitada","replies":[]},{"poster":"Shirotani","date":"2018-12-04T23:43:11.091+0000","up_votes":1,"down_votes":0,"body":"No, no se puede.","replies":[{"poster":"jabk","date":"2018-12-05T03:22:04.863+0000","up_votes":1,"down_votes":0,"body":"ok, el tema es que con un amigo despues de ver en el foro una persona que saco una lista de las skins mas raras para su criterio pensamos si esa se podia conseguir por cajas porque la unica manera era si la compraste en un evento hace muchos años atras y solo algunas cuentas tienen y seria algo de suerte si te sale en una caja","replies":[]}]}]}