{"poster":"AzorAha","date":"2019-10-16T04:45:22.386+0000","title":"Deberian hacer un juego tipo clash royale pero de LoL para movil","subforum":"Charlas Generales","up_votes":2,"down_votes":7,"body":"Asi 1 vs 1 seria mucho mas entretenido que esta basura de TFT que mierda mas aburrida.","replies":[{"poster":"We0nolo","date":"2019-10-16T04:48:44.859+0000","up_votes":4,"down_votes":0,"body":"No {{champion:31}}","replies":[]},{"poster":"Excorpion","date":"2019-10-16T04:47:38.696+0000","up_votes":2,"down_votes":0,"body":"Men, anunciaron como 20 juegos XD muchos de ellos mobiles XD\nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/K2aMEQaI","replies":[{"poster":"AzorAha","date":"2019-10-16T04:54:35.147+0000","up_votes":1,"down_votes":2,"body":"El de cartas parece interesante porque tiene pinta de ser 1v1 y no de 5 v 5 donde dependes de lo que hagan unos desconocidos, estos juegos en equipo ya cansan con tanto afk y trol","replies":[]}]},{"poster":"SeanFelices","date":"2019-10-16T04:51:28.664+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=AzorAha,realm=LAS,application-id=v7qsfXsE,discussion-id=2Vk2l64A,comment-id=,timestamp=2019-10-16T04:45:22.386+0000)\n>\n> Asi 1 vs 1 seria mucho mas entretenido que esta basura de TFT que mierda mas aburrida.\n\nTe faltó pedir nerf para la misma lista de campeones que siempre publicas.\n\nQue raro.\n\nSaludos .","replies":[]},{"poster":"TvTLucio22","date":"2019-10-16T07:25:55.966+0000","up_votes":1,"down_votes":1,"body":"...\n\nClash royale apenas es mejor juego que pokemon go (que NO es un juego, es una app), es de las cosas más chotas que podes hacer y, de alguna forma, copo el mercado... Es decir, los casuales no saben identificar un juego decente de algo como el clash royale...\n\nLa próxima pedi aunque sea un juego medio pelo...","replies":[{"poster":"WhiteMax","date":"2019-10-16T10:10:13.545+0000","up_votes":1,"down_votes":0,"body":"Ibas bien hasta que empezaste a comparar 2 juegos que para nada se parecen entre si. Encima que el clash royale tiene 27M de jugadores y el pokemon 12M (como el 40% de lo que tiene Clash Royale).","replies":[{"poster":"TvTLucio22","date":"2019-10-16T14:37:59.470+0000","up_votes":1,"down_votes":0,"body":"En realidad, iba a que los 2 son \"juegos\" bastaaaaaaante malos y que no se deberían usar de ejemplo, salvo si se trats de demostrar que el público casual va a comprar cualquier pelotudez","replies":[{"poster":"WhiteMax","date":"2019-10-16T17:52:03.813+0000","up_votes":1,"down_votes":0,"body":"Uno es p2w o p2f, como prefieran decirle. Y el otro es Casual pero solo se puede jugar en paises donde haya seguridad.{{sticker:sg-lulu}}\n\n> salvo si se trats de demostrar que el público casual va a comprar cualquier pelotudez\n\nLos juegos de movil que hay que pagar para poder jugar es una pesima tactica de ventas, ahi tenes de ejemplo Mario Run, que solo llego a 1M y algo, siendo que hablamos de un juego de Nintendo. La idea es que metan las cosas de pago como algo opcional y tentar al jugador a que los compre (la tactica actual es con los pases de temporada/meses y/o skins).","replies":[]}]}]}]},{"poster":"Zindro","date":"2019-10-16T15:09:15.126+0000","up_votes":1,"down_votes":0,"body":"A este tipo no le basta con sacar 6 juegos nuevos, qué desagradecido...","replies":[]}]}