{"poster":"ShowterX","date":"2016-02-21T18:36:25.246+0000","title":"jhin consigli","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"salve a tutti!!! volevo chiedervi se qualcuno sa darmi qualche consiglio su come giocare jhin... soprattutto come evitare che la sua 0 mobility mi faccia crepare contro qualsiasi champ...ha una mobility pari a 0.. &egrave; possibile giocare un champ del genere? qualsiasi consiglio sar&agrave; pi&ugrave; che apprezzato!!!","replies":[{"poster":"Jack0fA11Trad3s","date":"2016-02-21T23:23:51.150+0000","up_votes":1,"down_votes":0,"body":"-come prima abilita prendi la w\n-tieni d'occhio il numero di colpi\n-i primi 3 colpi usali sui minion il 4 sui campioni avversari\n-impara a prevedere dove si trovera il tuo avversario quando usi la w o la r, anche se è al di fuori del campo visivo\n-la r ha un bonus danni per i campioni feriti quindi usala come finisher\n-il vero scopo di jhin e portare terrore, quando l'avversario vede che attivi la r si spaventa e di solito scappa, usa questa tecnica per guadagnare tempo in caso di bisogno\n-la e marchia i nemici, combinala con la w se devi scappare\n-cerca di non combattere da solo ma di supportare gli attachi di alleati da corpo a corpo","replies":[{"poster":"ShowterX","date":"2016-02-22T14:32:59.404+0000","up_votes":2,"down_votes":0,"body":"ok grazie mille!!! solo una cosa... non si dovrebbe aumentare prima la q?","replies":[{"poster":"Ucr0niA","date":"2016-02-22T14:45:57.933+0000","up_votes":1,"down_votes":0,"body":"Si che si dovrebbe aumentare prima la Q, visto che in early è fatta apposta per pulire i minion mentre ricarichi.","replies":[{"poster":"ShowterX","date":"2016-02-22T18:23:00.678+0000","up_votes":1,"down_votes":0,"body":"ok grazie:D","replies":[]}]}]},{"poster":"1Baltazar1","date":"2016-05-27T23:39:49.681+0000","up_votes":1,"down_votes":0,"body":"io lo uso molto jhin: normalmente uso i primi due colpi sui minion, col terzo marchio il bersaglio, con la w lo stunno, se sono abbastanza vicino gli piazzo una trappola alle spalle così appena si libera è rallentato e col quarto colpo (che ha danni da esecuzione=critici) lo finisco.\nSe sei abbastanza rapido il nemico va giù come un birillo.","replies":[]}]},{"poster":"Nabbomaster","date":"2016-02-21T22:17:10.427+0000","up_votes":1,"down_votes":0,"body":"a me pare abbia piu' mobility lui di jinx e ashe","replies":[]},{"poster":"Law1Rz","date":"2016-02-21T19:14:10.824+0000","up_votes":1,"down_votes":0,"body":"dovresti provare prima a giocare champ con poca mobilità ma senza il problema dei 4 colpi, almeno prendi confidenza (ashe, miss fortune, jinx)","replies":[{"poster":"ShowterX","date":"2016-02-21T19:21:50.416+0000","up_votes":1,"down_votes":0,"body":"ho provato a giocarli ma non mi sono mai piaciuti xD","replies":[]}]},{"poster":"ShowterX","date":"2016-02-21T19:21:21.962+0000","up_votes":1,"down_votes":0,"body":"ho buildato più as e critico e devo dire che la differenza si sente moltissimo!!ho giocato molto bene in questa partita! grazie dei consigli... prima non davo molto peso alla passiva che scala anche con as.-., ora che ho visto meglio è molto interessante e forte!! e se la usi il problema di mobilità non si pone quasi più!! grazie a tutti per i consigli!!!","replies":[]},{"poster":"x A N D R E","date":"2016-02-21T18:38:08.895+0000","up_votes":1,"down_votes":0,"body":"Devi tenere d'occhio i tuoi alleati, appena puoi devi bloccare i nemici con la w.\nLa mobility ti viene data dai critici, compra quelli","replies":[{"poster":"ShowterX","date":"2016-02-21T18:40:47.329+0000","up_votes":1,"down_votes":0,"body":"grazie mille per il consiglio!! vedrò di buildarlo più critico!!!","replies":[{"poster":"x A N D R E","date":"2016-02-21T19:13:38.753+0000","up_votes":1,"down_votes":0,"body":"Come item fatti il frammento d'infinito, l'archibugio e il predatore d'essenza","replies":[]}]}]},{"poster":"Best Player Iraq","date":"2016-02-21T19:01:50.671+0000","up_votes":1,"down_votes":0,"body":"Quoto andre4170. In aggiunta se ti può aiutare builda gli swiftness. Non è da tutti ma se sai giocare è tendenza farli su campioni come ashe, jhin, mf. Calcola però la perdita di 30% di ats.","replies":[]}]}