{"poster":"BIEBER6","date":"2018-03-19T19:32:52.272+0000","title":"Que pasa si juego zed supp?","subforum":"Guias y consejos","up_votes":8,"down_votes":4,"body":"Lo que pasa es que llevo casi 1 a&ntilde;o sin poder ser m6 con zed y ya tengo una pieza, pero cuando voy a mid ago arto farm, kills, asist,  dragones torretas y no me dan la s y no se que hacer para ganarla en mid pero si lo juego supp mejor y solo ago asist me daran s porque en supp es mas facil conseguir la s. Que creen?","replies":[{"poster":"Claw","date":"2018-03-19T19:42:56.267+0000","up_votes":6,"down_votes":1,"body":"No te la darían porque ser supp es mas facil, te la darian por el sistema para dar nota. El sistema detecta tu desempeño en partida y lo compara con miles de otros desempeños de otros jugadores, depende como quedes es la nota que te dan. Si juegas un campeon que no se suele usar en una linea, el sistema no tiene muchos registros de esos desempeños, por lo que probablemente te dé una nota alta si lo haces medianamente bien. Por eso es facil sacar S con campeones nuevos por ejemplo. Te recomiendo que lo hagas con amigos, que ya sepan lo que vas a hacer y no se ofendan por eso. O lo que puedes hacer es tomarte eso como un reto y mejorar con zed en mid, piensa que será mas dificil ser M7 y es un buen desafio, mucha suerte.\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"SKT T1 Bank","date":"2018-03-19T19:49:48.085+0000","up_votes":4,"down_votes":1,"body":"Y mira, hacelo en normales, o con un equipo predefinido. Porque no pensas para nada en la partida y estas en plan solo de conseguir tu dichosa pieza, desvirtuando el juego en si.\n\nJuntate con 4 mas y trata de hacer esa S.\n\nSuerte!\n\n**SKT T1 BANK**","replies":[{"poster":"se dice miau","date":"2018-03-20T00:00:37.779+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SKT T1 Bank,realm=LAS,application-id=8sKIclmi,discussion-id=avEyhXi5,comment-id=0003,timestamp=2018-03-19T19:49:48.085+0000)\n>\n> Y mira, hacelo en normales, o con un equipo predefinido. Porque no pensas para nada en la partida y estas en plan solo de conseguir tu dichosa pieza, desvirtuando el juego en si.\n> \n> Juntate con 4 mas y trata de hacer esa S.\n> \n> Suerte!\n> \n> **SKT T1 BANK**\n\n+1\ny me fije tu ultima partida y realmente tienes un farm malisimo (129 en 34 min, osea deberias tener al menos 280-300 en ese minuto) y es el principal problema, y creeme aunque lleves de supp no la sacaras asi de facil como crees, solo farmea mejor y ya :/","replies":[]}]},{"poster":"exrex","date":"2018-03-19T19:41:22.945+0000","up_votes":6,"down_votes":3,"body":"Sale report.","replies":[]},{"poster":"StąrDust","date":"2018-03-19T20:35:04.279+0000","up_votes":1,"down_votes":0,"body":"No solamente toman el KDA para las calificaciones, si no también los objetivos (wards/pinks colocados/destruidos, farm, daños a torres/enemigos/dragones/barons, etc.)","replies":[]},{"poster":"Tur1nTur4mb4r ","date":"2018-03-19T20:05:11.500+0000","up_votes":1,"down_votes":0,"body":"A mi me paso lo mismo con {{champion:8}} jajajajajaj no podia sacar la ultima S. Con {{champion:37}}  llegue a M7 a los 60000 pts creo, con {{champion:8}} a los 160000 jajajaja terrible frustacion tenia.\nPor lo que vi en tus partidas te esta faltando farm, para que te des una idea a la media hora de juego no deberias tener menos de 200. Proba con eso, tarta de priorizar el farm sobre las kills. De ultima en alguna partida que esten holgados anda a pushearte una linea que este descuidada, roba jg en el late, etc","replies":[]},{"poster":"Inward360","date":"2018-03-19T19:43:42.469+0000","up_votes":1,"down_votes":1,"body":"mientras ayudes al equipo, si te reportan no cambiara mucho. Segun riot, puedes ir a cualquier linea con cualquier champ.","replies":[]}]}