{"poster":"AsD The Dreamer","date":"2015-02-09T19:06:14.249+0000","title":"Korhatár","subforum":"Általános beszélgetés","up_votes":3,"down_votes":1,"body":"Rendben tehát a lényegre térek. Nem kéne valahogy a korhatárt valamennyire komolyabban venni?  Jó most speciel nekem is a legjobb ötlet ami eszembe jut az az, hogy valami teszt féleséget kell megcsinálni. Miért is ajánlom? Tessék röhögjetek egy jót íme itt egy beszélgetésem egy random sráccal aki rám köszönt persze nem tudtam, hogy ki az. Csak erős idegzetűeknek! (Még ha törlik is a témát akkor is megérte mert aki törölte az legalább elmosolyodott (talán)).\n[7:50] savvina1: hi\nwhere is u form\n[7:50] AsD The Dreamer: wowowo\nslow down man\nwho the hell are you?\n[7:51] savvina1: i freund\n[7:51] AsD The Dreamer: okay but\nwhere have me met?\n[7:52] savvina1: at lol\n[7:52] AsD The Dreamer: well i know tha\nbut\nwhen?\n[7:53] savvina1: i dont knuw\ngaem?\n[7:53] AsD The Dreamer: okay\nthen answering to your first question\nI am from Hungary\n[7:54] savvina1: im hungry too\nnow i eat fud\n[7:54] AsD The Dreamer: ah gee\nHUNGARY IS A COUNTRY\nNOT HUNGRY\nHUNGARY\n[7:55] savvina1: where that\n[7:55] AsD The Dreamer: and where are you from?\n[7:55] savvina1: usa\nis that on usa\n[7:55] AsD The Dreamer: well\nyou are one tough cookei aren't ya?\nokay\nhow old are you?\n[7:55] savvina1: 9\ni thing\n[7:55] AsD The Dreamer: okay so let me give you an advice kid\nfor your birthday\nask for an english teacher\nokay\nthen\ndo you have any brother?\nolder brother?\n[7:56] savvina1: no i have older mom\n[7:56] AsD The Dreamer: who said you should start this game?\n[7:57] savvina1: inreten\n[7:57] AsD The Dreamer: but who?\n[7:57] savvina1: interner*\n[7:57] AsD The Dreamer: okay kid\nthen i am gonna warn you to keep a low profile\nthis game is for those players\n[7:58] savvina1: whi\n[7:58] AsD The Dreamer: who are 13 or older\n[7:58] savvina1: im alust 13\n[7:58] AsD The Dreamer: and you are \nokay\nso \n[7:58] savvina1: in 5 yiars\n[7:58] AsD The Dreamer: yea\nokay\nso \nlast time you said you are 9\n9+5=14\n9+4=13\n[7:59] savvina1: 9+5= 12 idiut\n[7:59] AsD The Dreamer: okay\nis your mommy or daddy home?\nuhm\nyou know what?\ntell somebody\nto come here\nsomebody\nwho can speak\nEnglish\n[7:59] savvina1: i go i hev to fed my ded\nbuy buy\n[8:00] AsD The Dreamer: merry mother of god why the hell are you playing this game?\n[8:01] savvina1: cuz i cen \nu racest\nfak u\n[8:01] AsD The Dreamer: okay","replies":[{"poster":"Gabesz00","date":"2015-02-09T20:35:58.771+0000","up_votes":5,"down_votes":0,"body":"Hááát öööö izééé...\nMost mondjam azt hogy a a a az az én úr isten ki kell mondanom az én generációm hülye mint a %%%%!!!!!\nÉn mindig is kora vén voltam és a felsőbb osztályokba jártam mert nem bírtam elviselni az osztálytársaimat. Először azt akartam írni hogy ne szúrj ki az olyanokkal mint én és ne legyen szigorúbb a korhatár, de a teszt ötlet nagyon tetszik. Habár ezt is ki lehet játszani, de ki tudja? Ettől függetlenül nem kell azonnal lenézni ezt a korosztályt mert van még remény (remélem) és először adni kell nekik egy esélyt. Amúgy elismerésem, mert hihetetlen önfegyelemmel nem küldted el a pics@ba ezt a kis hülyét :D {{item:2010}}","replies":[]},{"poster":"LordMágus","date":"2015-02-09T19:17:20.359+0000","up_votes":4,"down_votes":0,"body":"Mi a franc?! :O\n\nIlyenek még léteznek?","replies":[{"poster":"AsD The Dreamer","date":"2015-02-09T19:21:55.222+0000","up_votes":3,"down_votes":0,"body":"Még nem haltak ki! Gyorsan! A karantént!\nVagy fejlesszük őket tovább és legyenek a szolgáink! {{champion:112}} ","replies":[{"poster":"LordMágus","date":"2015-02-09T19:36:29.693+0000","up_votes":1,"down_votes":0,"body":":D\nCsatlakozni fognak hozzánk\n\n\n\n\n\n\n\nAz egy dolog, hogy be lesznek drótozva.","replies":[{"poster":"AsD The Dreamer","date":"2015-02-09T19:39:32.852+0000","up_votes":1,"down_votes":0,"body":"Szép is lenne. :D","replies":[]}]}]}]},{"poster":"Dædalus","date":"2015-02-09T23:37:18.490+0000","up_votes":4,"down_votes":1,"body":"Az én tippem az, hogy meg lettél trollkodva :)","replies":[{"poster":"ITheSolidI","date":"2015-02-10T05:40:01.764+0000","up_votes":2,"down_votes":5,"body":"Üdv. Nem kívánok komolyabban beleszólni(nem a fenét, mert kissé zavar), de az ilyen témák komolyan nagyobb prioritást élveznek mint a hibajelentések/segítségkérések/problémákkal kapcsolatos topicok? Nyilván nem én döntöm el hogy ki mihez szólhat hozzá, de könyörgöm egy rakat olyan topic van ami konkrétan értetek kiált, és hamarabb látni egy ilyen trollos (jóformán jelentéktelen) topicnál piros nicket? Elkeserítő...","replies":[{"poster":"M4dr4c","date":"2015-02-10T09:24:20.923+0000","up_votes":1,"down_votes":0,"body":"Ez lehet valami Riotos belső szabály, mert az angol fórumon is ez a jellemző. :D","replies":[{"poster":"Kadegrow","date":"2015-02-10T12:48:31.107+0000","up_votes":1,"down_votes":0,"body":"Akkor hülye szabály. Én is csomó dolog mellett kiálltam mellettük és soha nem írtak sehova se. Akár rajongói alkotást írtam, akár ötletet, akár igazságot amin változtatni kellene vagy játékbeli nehezítés ami növelte volna a csapatmunka erejét és nehezebb lett volna a játék ami azt jelképezi, hogy nem 20 perces meccsek lennének, de sehova nem írtak. Nem jöttek még rá, hogy a játékos az első.","replies":[{"poster":"Szabadkőműves","date":"2015-02-20T11:33:47.350+0000","up_votes":2,"down_votes":0,"body":"Elnézést, de szerintem örülnünk kellene, hogy ingyenesen játszhatjuk ezt a játékot. És, mellé ingyenes szolgálatot kapunk akik azon vannak, hogy mindenki kedvére tegyenek.\n\nNem egyénekről van itt szó, hanem a közösségről, és ezt teszik előtérbe.","replies":[{"poster":"Kadegrow","date":"2015-02-20T12:54:09.998+0000","up_votes":1,"down_votes":0,"body":"Az, hogy ingyenes csak egy előny és hátrány is. Részben ilyen fejjel inkább adok ki pénzt, hogy nyugodt körülmények között tudjak játszani. Én is így álltam hozzá ahogyan te most leírtad nekem és ennek örülök is, hogy te még így látod. Közel 1 éve lesz már, hogy elkezdem írni a problémákat és azokra javaslatokat írtam ki. Van tapasztalatom a tervezői székből így személyem szerint csak azokat írom le amik már máshol működtek és működnek is.\nDe tudod ezekre semmiféle választ nem kaptam. Pedig úgy ahogy most te én is kiálltam mellettük.\nNem az a gond, hogy nem fogadnak el külsőből sok ötletet, hanem az, hogy nem látunk változást.\nHa látunk is azok is fél év elteltével.\n\nA mindenki kedvére az kicsit túlzás. Olyan nincs, hogy mindenki kedvére mert ezzel árulják el magukat, ha ilyet mondanának.\nEgy helyes cég a normális és tisztelettudó játékosokat nézi. Te amit elírtál abban benne van az is aki feljön és : easy, izi, izi pizi-t ír és piszkál mindenkit. Őt miért kell nézni? Ez a gond, hogy jelenleg itt tartunk és teli van ilyen játékosokkal. És mivel minden második meccsel találkozok ilyenekkel azé lehet feltételezni, hogy az EUNE 50%-a ilyen egoista emberke aki sokat képzel magáról és piszkált mindenkit. Egy céget nem az ilyen emberek teszik sikeressé.\n\nAmit te leírtál annak az egyik legfontosabb kelléke a kapcsolattartás.\nAmi itt nincs. Leírom a problémám Riot Daednak és kitörlni azzal a kifogással, hogy nem oda tartozik?\nMinden ügyintézésüket az önkénteseinek köszönhetik akiket én tiszteletben is tartok és velük vitatok meg minden egyes ügyet. De sajnos ők nem tudnak ítélkezni és jelenti a Riotnak, hogy ez meg ez van itt.\nEgyszer nyugtatáskélnt azt írták le nekem, hogy a többi ország szerverein ennyire se foglalkoznak a játékosokkal, mint itt.\nHol ott az előtérbe helyezés és az, hogy a kedvükre tegyenek?\n\nMegfog változni a véleményem, de ahogyan nekik leírtam neked is leírom, hogy azért tenni is kell.\nNem azért írok ilyeneket, hogy utálom őket, hogy szemetek stb...., hanem szeretek ezzel játszani és egy sikeres cég lenne, ha nem szúrták volna így el ennyire. Muszály néha valakit piszkálni, hogy felébredjen.\n\nJelenleg a Riot kb. be van sz----va a HOTS-tól. Jelenleg most a Riot a sikerüket és a felhívást magukra az LCS-vel próbálják.\nJó belátás mert amint vége lett a VB LCS-nek most jött az EU és ezen kívül a többi szervereken is megy, mint pl.: USA.\nPersze hatásosabb mert 1000x több bevétel és jobb nézettség + népszerűség jön be. Csak a a gond, hogy minden nerfet újítást az LCS-re készítenek amit sokszor ki is fejeznek. És mivan a játékosokkal akik meg szenvednek? Azon részeken dolgozik egy kis rész és majd kész lesznek.\n\nBocsánat, hogy ilyet mondok, de amíg kezdők voltak és sok mindent egyben csináltak a kevés ember miatt, akkor többre jutottak, mint most mikor már odáig eljutottak, hogy több szerverük van és minden részleget már szétbírnak osztani.\n\nNekem nem LCS kell, se szinkron, se magyar kommentátor stb... nekem egy normális közösség kell játékon belül.\nÉs persze egy bugmentes játék mert egyre több bug és egyre több hack látható.\nAmíg ennyi hibája van a Riotnak addig nem lesz újra olyan véleményem, mint neked.\nPróbáltam olyan lenni és bíztam bennük még eleinte, de rájöttem, hogy levegő vagyok. Amíg ez így van és nem csak velem addig a véleményem nem fog változni.","replies":[]}]}]}]},{"poster":"Zooty","date":"2015-02-10T12:51:44.473+0000","up_votes":2,"down_votes":0,"body":"Ezekre vagyunk mi, ezermesterek, illetve a játékostámogatás, akik annyira nagy prioritást adnak az általad említett dolgoknak, hogy személyre szabottan nyújtanak támogatást nektek.\nAz a baj, hogy ti a Riotra úgy tekintetek, mint valami nagy homogén massza, ahol mindenki ugyanúgy, mindent csinál, ami lolhoz kötődik. Holott mindenkinek megvan a maga szakterülete és munkaköre, és például Daedalus nem fog technikai segítséget nyújtani, mert őneki nem az a dolga...\nHibajelentésekkel/segítségkérésekkel/problémákkal kapcsolatos dolgokkal a játékostámogatáshoz lehet fordulni!","replies":[{"poster":"ITheSolidI","date":"2015-02-10T14:09:28.371+0000","up_votes":1,"down_votes":0,"body":"Nos elég szépen és érthetően leírtad a ti oldalatokról nézve is a dolgot, ezért köszönet illet, én csupán a saját szemszögemből írtam le a témát. Részemről (kissé önzőn) a [saját topicomból](http://boards.eune.leagueoflegends.com/hu/c/segitseg-es-tamogatas/5P4y5MP5-attempting-to-reconnect) indultam ki, amiben leírtam két eddig számomra ismeretlen problémát [értem ez alatt, hogy a fórumon sem találkoztam még velük], és máig nem érkezett rá semmiféle reakció eltekintve attól az egy fórumtárstól, aki szintén találkozott a hibával. A Riotra magára én nem feltétlen tekintek úgy, ahogyan Te azt leírtad, nyilván nem fog mindenki ugyan úgy időt áldozni minden egyes munkaterületre, de nyilván megérted Te is, hogy jobb olyan topicokban látni Riot-os hozzászólást, ahol tényleg szükséges, mint egy troll-os topicban. Ez az, ami felütötte kissé a fejem, és emiatt írtam kissé talán meggondolatlanul a fentieket.","replies":[{"poster":"Zooty","date":"2015-02-10T14:59:26.087+0000","up_votes":1,"down_votes":0,"body":"Jelenleg gondok lehetnek a kapcsolattal, erről van is egy [fórumtéma](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/lNfzEoE7-raomaalom-ismeretlen-hiba) kiakasztva felülre. Ha véleményed szerint nem emiatt áll fent a probléma, és a [támogatási oldalon](https://support.riotgames.com/hc/hu/articles/201752664-A-kapcsolati-hib%C3%A1k-elh%C3%A1r%C3%ADt%C3%A1sa) se találtál semmi használhatót, nyugodtan írj a [játékostámogatásnak](https://support.riotgames.com/hc/hu/requests/new), ők tudnak legjobban segíteni.\nIgyekszem mindenkinek válaszolni itt a fórumon, de sajnos néha én is elsiklok egy-egy téma felett, ezért elnézést kérek.","replies":[]}]}]}]},{"poster":"AsD The Dreamer","date":"2015-02-10T14:02:14.537+0000","up_votes":1,"down_votes":0,"body":"Ez az sikerül végre visszaszólni egy Riotosnak amit szoktak mondani!\n\n\"Görgess lejjebb kérlek mert volt erről szó\" Egy ezermester, nagykövet akárki.","replies":[]}]},{"poster":"Tazsam","date":"2015-02-09T21:11:33.608+0000","up_votes":1,"down_votes":0,"body":"Ha ez nem troll akkor a világra tényleg ráfér már a vérátömlesztés.","replies":[{"poster":"Szabadkőműves","date":"2015-02-20T11:37:47.465+0000","up_votes":1,"down_votes":0,"body":"Most kocka nyelven, jó lenne ha kiadna az evolúció egy 1.1-es Brain Updatet. \n:P","replies":[]}]},{"poster":"AsD The Dreamer","date":"2015-02-10T14:48:41.536+0000","up_votes":1,"down_votes":0,"body":"Íme találtam 1-1 bizonyítékot ami bizonyítja, hogy trollkodik meg bizonyítja azt, hogy 9 éves.\n9 éves: Ez a \"buy buy\". Hát ha trollkodnék még akkor se rontanám el a \"bye bye\"-t.\nTrollkodik:Kicsit össze van zavarodva a korával kapcsolatban és, hogy először azt állítja, hogy 9+5 az 13 utána meg azt, hogy 12. Lehet, hogy csak elgépelte.","replies":[]},{"poster":"Jaedanz","date":"2015-02-10T08:58:15.852+0000","up_votes":1,"down_votes":0,"body":"Inkább az az elkeserítő, hogy te ezt elhitted, pedig lerí, hogy csak trollkodik veled :(","replies":[{"poster":"AsD The Dreamer","date":"2015-02-10T14:02:09.238+0000","up_votes":1,"down_votes":0,"body":"Kérlek görgess lejjebb mielőtt hozzászólsz. Kösz.","replies":[]}]},{"poster":"M4dr4c","date":"2015-02-09T23:08:26.865+0000","up_votes":1,"down_votes":0,"body":"Korhatárnak nincs sok értelme, valami tesztnek még talán-talán, de biztos nekiállnának a válaszokat megkeresni az élelmesebbek. ;)\n\nAmúgy a szomszédom ég eddig se terjedne szerintem, pedig van vagy 60.","replies":[]},{"poster":"Shirodrake","date":"2015-02-09T22:18:15.177+0000","up_votes":1,"down_votes":0,"body":"Ez tök aranyos, szegény gyerek csak ismerkedni akar. Valószínűleg annyi fogalma van, hogy egy ez egy online játék, amit az emberek a világ minden tájáról játszanak és gondolta tök jó lehet játék által ismereteke szerezni. \n\nAz első kérdésére a ki a 3,14csa vagy stílus helyett válaszolhattál volna udvariasabban is. \nTe álltál le egy 9 évessel \"vitatkozni\". \n\n(Ha troll, akkor a felső rész stornó.)\n\nSzerintem hülyeség a korhatár, mert:\n\nHa kitiltjuk az óvodát, kivel szemben mutatjuk meg, hogy tudunk éretten (is) viselkedni?\nHa olyan az értelmi szintje, akkor marad bronz/silver-ben.  Ha valaki azt mondja hogy miattuk ragadt ott ő is, akkor így járt.  Egyébként meg csak ostoba kifogás,\nHa pedig az az \"óvódás\" értelmes és feljebb tud jutni, akkor kapja meg az esélyt rá.","replies":[]},{"poster":"Brăd","date":"2015-02-09T19:33:06.486+0000","up_votes":1,"down_votes":0,"body":"Ezt úgy hívják ,hogy \"Trollkodás\".","replies":[{"poster":"AsD The Dreamer","date":"2015-02-09T19:37:50.339+0000","up_votes":1,"down_votes":0,"body":"Van benne logika. De nem biztos. Bizonyíték ide vagy oda mind a kettő lehet. Tehát nem biztos, hogy trollkodik. Kinézném a mai gyerekekből.","replies":[]}]}]}