{"poster":"AsD The Dreamer","date":"2015-06-30T13:56:59.153+0000","title":"Tank jungler","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Ti tank junglernek kit aj&aacute;nlotok? Ki most aki tank junglerk&eacute;nt nagyon meg&aacute;llja a hely&eacute;t? &Eacute;n Zacen meg Rammuson &eacute;s Maokaion gondolkodtam.\r\nAki m&aacute;r van &eacute;s tankk&eacute;nt viszem az J4 (aki eg&eacute;sz j&oacute;l bev&aacute;lt) illetve Skarner (szint&uacute;gy.)","replies":[{"poster":"AsD The Dreamer","date":"2015-06-30T15:44:45.047+0000","up_votes":1,"down_votes":0,"body":"Thx a kommentekér m8-k. :^) . Sejuanival még úgy s3 közepe fele játszottam toposként. Ha free lesz kipróbálom. Először szerintem Zacet veszem meg. Utána majd hezitálok Vi és ~~Sonic~~ Rammus között. Gragas azon kábé 10 champ közé tartozik akikkel még nem játszottam. Ha free lesz őt is kipróbálom.\n\nCserébe élvezzetek egy pár Shrekes cipőt. Mivel mindenki szereti Shreket.\n\nhttp://media.lolusercontent.com/api/embedly/1/image/resize?url=http%3A%2F%2Forig02.deviantart.net%2F780e%2Ff%2F2014%2F205%2F7%2F2%2Fshrek_________shoes_by_tispleasedplz-d7s4hfv.jpg&key=a45e967db0914c7fb472fd4381e6c85b&width=425","replies":[{"poster":"Tetth","date":"2015-06-30T15:58:51.574+0000","up_votes":2,"down_votes":0,"body":"http://i.ytimg.com/vi/HrauDWZCbzc/hqdefault.jpg","replies":[]}]},{"poster":"S T U K I","date":"2015-06-30T14:17:49.796+0000","up_votes":2,"down_votes":0,"body":"Vi a legjobb. Tankként és Fighterként is megállja a helyét, és ha jól játszol vele és jól buildeled elpusztithatatlan :)","replies":[]},{"poster":"Zooty","date":"2015-06-30T20:25:35.364+0000","up_votes":1,"down_votes":0,"body":"Akivel szeretsz játszani. \nHa jól játszol, akkor bármivel képes vagy nyerni.. \n\nÉn személy szerint nem igazán izgatom magam olyanokkal, hogy mi jelenleg a meta, illetve kik a mostani OP hősök. \nA fent felsoroltak közül bárki megállja a helyét. Próbáld ki mindet, és amelyik tetszik, arra gyúrjál rá!","replies":[]},{"poster":"Marginaldefeat","date":"2015-06-30T20:05:32.305+0000","up_votes":1,"down_votes":0,"body":"P:S Ugyan egyik se tankos ( ill Shy lehet az  de nem full tank) de Shyvana és Diana az uj patch után kb god tier kategória :)","replies":[]},{"poster":"Vasipari Béla","date":"2015-06-30T19:43:09.439+0000","up_votes":1,"down_votes":0,"body":"Gragas: Szuper rajtaütések, brutál sustain (Hp pot nélkül full clear), és nagyon sokoldalú csapatharcban, illetve ha van egypár killed, ap-ra is lehet húzni, és nem is túl nehéz\nSejuani: Hasonló Gragashoz, csak kicsit rosszabb sustainnel, és kevésbé sokoldalú, viszont kezdeményezésben aduász\nNautilus: Sejuani 2\nHecarim: Carry jungles, nem túl könnyű vele gankelni, viszont ha elég farmhoz jutsz vele, nem túl sok minden állithat meg (használj teleportot, hogy segíts átvészelni az ösvényeseknek az időt, amíg nincsenek itemeid, és bázisvédővel amúgy is brutális)","replies":[]},{"poster":"Marginaldefeat","date":"2015-06-30T15:30:26.181+0000","up_votes":1,"down_votes":0,"body":"Sejuani+ Nautilus :) De ilyen kisebb szinten még Leona sem rossz, csak elején fájdalmasan szarul tisztogat, ala Shen.","replies":[]},{"poster":"Tetth","date":"2015-06-30T15:00:56.198+0000","up_votes":1,"down_votes":0,"body":"Szerintem rammus. Nagyon idegesítő, és a base damage-e sem elhangyagolható, gondolom ezt te is észrevetted. :D Bár takony sokkal inkább meta. Mao inkább top mint jungle, szerintem. De remélem bármelyiket is választod, nem csak hp-t fogsz neki építeni hanem jó mértékű védelmet is.","replies":[]},{"poster":"FAJAhun","date":"2015-06-30T14:24:04.415+0000","up_votes":1,"down_votes":0,"body":"Írok ahhoz a 3-hoz amit te említettél mert első szempont, hogy neked tetszenek a hősök és szeressé velük játszani és gondolom hasonló okok miatt választottad őket.\nZac: egyik kedvenc jungelesem, nagyon ajánlom.\nRammus: a legtankosabb a háromból, ha full tankot akarsz akkor őt ajánlom. Ha ap rammust  akarsz (és ez alatt nem full ap-t hanem tankhoz képest ap-sat értek természetesen) akkor nehéz vele játszani. Ahogy nézem a már kipróbáld tankjaid tank mellett ad-sek így neked most ap-s kéne, hogy kiegészítse a választékot. \nMaokai: már S3-ban elkezdtem vele junglerezni de azóta szinten minden patch ami őt vagy a jungle tárgyakat érintette azt eredményezte, hogy egyre jobb top-os de egyre rosszabb jungeles lett. Ma már ritkán játszok vele jungelben akkor is a régi idők emlékéért.\nÖsszeségében szerintem zac, esetleg rammus.","replies":[]},{"poster":"Tazsam","date":"2015-06-30T14:21:31.565+0000","up_votes":1,"down_votes":0,"body":"Illetve senki sem említette Chot, pedig full tankra építve is elég komoly dmg-e van és ha felstackeled akkor nem egyszerű felrobbantani.","replies":[]},{"poster":"Tazsam","date":"2015-06-30T14:21:28.330+0000","up_votes":1,"down_votes":0,"body":"Vi és rek is jók az erdőben de végjátékban egyik sem az a tipikus betonfal, mindkettő inkább fighter. Ilyen erővel tryndát is mondhatnám és az tényleg elpusztíthatatlan ( 5 másodpercig:) ).","replies":[]},{"poster":"Tazsam","date":"2015-06-30T14:16:56.858+0000","up_votes":1,"down_votes":0,"body":"- Rammust akkor ajánlom ha ad heavy az enemy, akkor egyértelmű favorit (tipikus példa ha topon ad tank van boton adc és midre bepickelnek egy zedet/yasuot)\n- Zac ritka mint a fehér holló én is régóta szemezek vele de még nem vettem meg, valahogy mindig volt más karakter aki épp megtetszett\n- Mao akkor jó ha egy embert kell elkapni (lane fázisban gankelni). Véleményem szerint van nála jobb választás\n\nAkiket még felvehetnél a listára és nem hiszem, hogy megbánnád:\n- Amumu, ha ap tank kell mert ad heavy a ti csapatotok (esetleg malphite bár szerintem nem az erdőbe való). Az ultija bármikor bármelyik csapat harcot képes megfordítani\n- Sion, fura de működni szokott nálam és ha beindul a vonat....\n- Shen, op gankek ha ráérzel a tauntra és az ulti miatt akkor is gankelhetsz ha a közelben sem vagy, cerébe fájdalmasan lassan farmol az erdőben\n- Sejuani cc cc cc mondtam már, hogy van cc-je is?\n- Gragas a nagy dagadt kullancs, ha rá mászol valakire akkor szívhatod a vérét elmenni nem fog tudni\n- Shyvana, jó cc hiányában kissé hanyagolt de megbízható\n\nHa mazochista hangulatban vagyok én simán kipickelem singedet is az erdőbe de mondjuk az már nem egészséges.","replies":[]},{"poster":"Norb Cena","date":"2015-06-30T14:11:14.584+0000","up_votes":1,"down_votes":0,"body":"Gragas, Sejuani, Rek'Sai még mindig a 3 legjobb. Maokai inkább topra jó (a W-én nagyon kicsi a range és az MS-e is kevés ezért nem a legjobb ganker).","replies":[]}]}