{"poster":"Lucifer Z","date":"2019-09-17T12:46:59.799+0000","title":"Verjährung","subforum":"Spielerverhalten & Moderation","up_votes":6,"down_votes":5,"body":"Hallo zusammen,\r\n\r\nseit heute bin ich aktiv im Forum. Ich spiele aber seit Season2 Hecarim Release.\r\n\r\nJetzt bin ich 21 und damals war ich 14. Ich kann mich erinnern, dass ich ein oder zweimal eine Chat-Sperre/Einschränkung hatte und einmal 1 Woche gebannt war. Das war mit 15 ~ Jahren. \r\n\r\nIch bin natürlich älter und reifer geworden. Sowas würde mir nicht mehr passieren.\r\nSollte ich aber trotzdem mal - aus welchen dummen Gründen auch immer (flamen sollte man NIE) - wegen flame geahndet werden, kommt dann eine lebenslange Sperre auf mich zu, oder sind diese alten Strafen \"verjährt\"?\r\n\r\nAngst habe ich nicht, es würde mich trotzdem mal interessieren.\r\n\r\nVG\r\nLucifer","replies":[{"poster":"AudreyrJmEb","date":"2019-09-17T13:00:18.159+0000","up_votes":1,"down_votes":1,"body":"außerdem bist du lvl 118 also musst du in letzter Zeit ja sowieso viel gespielt haben? Bist du toxic geworden oder wieso kommt die Frage jetzt aufeinmal?","replies":[{"poster":"Lucifer Z","date":"2019-09-17T13:17:06.767+0000","up_votes":4,"down_votes":0,"body":"Ich habe in der tat seit dieser Saison wieder sehr viel gespielt. Eine Ermahnung, Verwarnung oder Sonstiges kam aber nicht.\nDa ich heute mal viele Forenbeiträge und Themen gelesen habe und sehr viele Leute eine \"Entbannung\" wollen, hat mich das Ganze mal interessiert. Als \"Kind\" war ich eben ein toxischer Idiot.","replies":[{"poster":"Angel Ayume","date":"2019-09-17T13:23:13.644+0000","up_votes":6,"down_votes":1,"body":"Man kann nach einer Strafe reformed werden, wenn man in sehr vielen Spielen sich anständig benommen hat. Heißt, dass man mit der Zeit in den Strafstufen runter geht. \nDa Zeit bei Riot aber immer in gespielte Spiele gerechnet wird, kann niemand sagen, ab wann man tatsächlich als reformed gilt. Auch die Spiele werden womöglich variieren, da manche nicht immer gleich neutral sind. Manche sind immer noch zwischendurch toxisch, aber nicht genug um wieder bestraft zu werden, das System merkt sich das aber trotzdem, wenn man reportet wird. \n\nNach der Umstellung vom Tribunal auf das jetzige System haben alle Spieler eine weiße Weste bekommen. Das muss irgendwo bei 2015 gewesen sein. Es ist also gut möglich, dass du trotz der Strafen eine weiße Weste hast.","replies":[{"poster":"ITroll4Fun","date":"2019-09-17T19:24:02.003+0000","up_votes":2,"down_votes":5,"body":"Du musst \"\" verwenden, Flamer können nicht reformed werden. Es gehört zur unserer barbarischen Natur. Wenn man nichts schreibt heißt lange es nicht, dass man sich verändert hat. Das ist wahrscheinlich auch der Grund wieso Riot anscheinend denkt, dass die Community besser geworden ist. \nMan kann doch seine Toxozität und Frust über \"unlucky\" Mitspieler anders rauslassen, man muss doch nicht immer chatten.","replies":[{"poster":"Tickle My Donger","date":"2019-09-18T19:18:57.395+0000","up_votes":2,"down_votes":0,"body":"Not true! Ich war auch mal toxic af, und es hat zwar erst einen perma Bann gebraucht durch den ich viele Skins verloren habe, aber jetzt Schreibe ich fasst nichts mehr ausser relevante Infos. #reformed","replies":[{"poster":"ITroll4Fun","date":"2019-09-19T11:30:38.060+0000","up_votes":1,"down_votes":0,"body":"Wenn ein Malph feedet und dabei Rüstung gegen AP-Dmg stackt, wie reagierst du? Ich meine damit deine Reaktion und nicht das Geschriebene.","replies":[{"poster":"Tickle My Donger","date":"2019-09-19T12:07:42.259+0000","up_votes":2,"down_votes":0,"body":"Gar nicht, kann als Supp sowieso nicht drauf reagieren da ich keinen impact habe auf sowas. Ich denk mir meinen Teil, und fertif. Next game. Zumal sowas in Gold kaum vorkommt, dann doch eher Leute welche die Mitte runterennen, und die report ich dann einfach.","replies":[]},{"poster":"LootAndPillage","date":"2019-09-26T14:03:45.069+0000","up_votes":1,"down_votes":0,"body":"Ich ärgere mich, schreibe aber nichts dazu. \n\nAuch ohne Regeln gegen flaming wäre in internetchats mit Trollen streiten für mich Lebenszeitverschwendung.","replies":[]}]}]},{"poster":"Angel Ayume","date":"2019-09-17T20:07:46.356+0000","up_votes":3,"down_votes":1,"body":"Du es soll auch Spieler geben die durchaus kapieren, dass das was sie machen unnütz ist. ^^","replies":[{"poster":"ITroll4Fun","date":"2019-09-17T20:30:41.957+0000","up_votes":1,"down_votes":4,"body":"Ich verstehe es auch, dass meine toxische Reaktion nicht nützlich ist, aber ich bin doch trotzdem \"toxisch\", wenn ich einen 0 7 Midlaner habe. Ich sage meine Meinung nur aus einem Grund nicht, es besteht noch ne Gefahr für ne Permastrafe, danach mache ich weiter und der Kreis beginnt von neu. Das ist doch nicht der Sinn des \"Reformens\"? Und ich bin zu 100000000% mir sicher, dass ich keine Ausnahme bin.","replies":[{"poster":"Angel Ayume","date":"2019-09-17T20:41:02.413+0000","up_votes":2,"down_votes":1,"body":"Hab auch nie behauptet, dass du eine Ausnahme wärst ich sage nur, dass es auch Spieler gibt, die reformen. Sprich ihre toxische Art ablegen. Aber ob du nun toxisch bleibst oder nicht macht für deine Mitspieler keinen Unterschied solange du nicht im Chat toxisch bist. \nDu, wenn es danach geht, dann bin ich auch toxisch, denn ich beleidige meine Mitspieler und auch mal die Gegner in einer Tour. Aber eben nur für mich oder eben im TS wenn ich Premades habe. \nIch würde das aber niemals einem Spieler an den Kopf werfen, nicht, weil ich eine Strafe fürchten würde sondern, weil es sich nicht gehört und ich das eben als Kind so beigebracht bekommen habe. Sei höflich und respektvoll deinen Mitmenschen gegenüber.","replies":[{"poster":"ITroll4Fun","date":"2019-09-17T21:20:17.684+0000","up_votes":1,"down_votes":3,"body":"Daran habe ich meine Zweifel, dass es ihnen nichts ausmacht. Angenommen die guten Summoner hier haben Recht und ich trolle mit dem Teemosupp, also eine andere Art gegenüber meinen Mates \"toxisch\" zu werden. Also führt Riots \"Verbesserung\" zur Verschlechterung des Klimas in der Community. Ich finde jedenfalls, dass es nicht besser geworden ist, seit der Season 3. Obwohl jetzt schon, ich spiele ja ohne ingame Chat.\n\nDa sind wir halt im selben Boot, so wurde es mir auch beigebracht. Aber mir wurde es beigebracht auch die Wahrheit zu sagen und nennen wir mal das AugeumAuge -Prinzip, was eigentlich veraltet ist. Und wenn ich etwas als \"ungerecht\"/falsch ansehe werde ich  mein Mund aufmachen. Du wahrscheinlich auch?","replies":[{"poster":"Angel Ayume","date":"2019-09-17T21:45:02.091+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RitoFkedUp,realm=EUW,application-id=KYnfKGf0,discussion-id=nRwP6HA3,comment-id=00040000000000000000000000000000,timestamp=2019-09-17T21:20:17.684+0000)\n>\n> Daran habe ich meine Zweifel, dass es ihnen nichts ausmacht. \n\nWem sollte das nichts ausmachen, deinen Mitspielern? Wenn du im Chat nicht toxisch bist, woher sollen sie bitte wissen, dass du ein toxischer Spieler bist und einfach nur den Bann fürchtest und deswegen nicht den Chat nutzt? Für deine Mitspieler macht es also keinen Unterschied, warum du den Chat nicht benutzt, Hauptsache ist, du machst es nicht. Was die Gründe für dich selbst sind, sind völlig irrelevant. \n\nZudem, woher sollen sie wissen, dass...\n\n> Angenommen die guten Summoner hier haben Recht und ich trolle mit dem Teemosupp, also eine andere Art gegenüber meinen Mates \"toxisch\" zu werden. Also führt Riots \"Verbesserung\" zur Verschlechterung des Klimas in der Community.\n\n... du Teemo Supp pickst, damit du NICHT toxisch bist? Sie wissen es nicht richtig. Und was diesen Umstand betrifft bist du wohl da eher eine Ausnahme. Ich kann mir nicht vorstellen, dass es allzu viele Spieler gibt, die einen \"Troll\"-Pick spielen, nur damit sie nicht mehr toxisch sind. Ich kann mir nicht mal vorstellen, dass der Pick da irgendwas ändert und nur der Pick dazu führen würde, dass du nichts im Chat schreibst. ^^\nAber Riots System führt nicht zur Verschlechterung, denn warum auch? Du bist nicht mehr toxisch, dein Pick ist zwar gewöhnungsbedürftig und mag manchen auch ein Dorn im Auge sein, aber er ist zum einen nicht verboten und zum anderen bist du nicht toxisch. Was also soll das Klima verschlechtern? Dein Pick? Nicht jeder hat damit ein Problem... Du kannst mir nicht erzählen, dass du in JEDEM Game Spieler hast, die dich deswegen im Chat ankeifen. ^^ \n\nVorallem, kannst du das ja nicht mal wissen, denn...\n\n> Ich finde jedenfalls, dass es nicht besser geworden ist, seit der Season 3. Obwohl jetzt schon, ich spiele ja ohne ingame Chat.\n\n... wie du selbst sagst, hast du den Chat deaktiviert. Und nur, weil sie evtl. mal was in der Champselect sagen, heißt das nicht, dass sie das im Ingamechat auch tun. \n\n> \n> Da sind wir halt im selben Boot, so wurde es mir auch beigebracht. Aber mir wurde es beigebracht auch die Wahrheit zu sagen und nennen wir mal das AugeumAuge -Prinzip, was eigentlich veraltet ist. Und wenn ich etwas als \"ungerecht\"/falsch ansehe werde ich  mein Mund aufmachen. Du wahrscheinlich auch?\n\nIch bin ein sehr ehrlicher und auch direkter Mensch. Ich sage oft das was ich denke. Viele Menschen kommen damit nicht zurecht und ich habe nicht selten schon unbedacht die Gefühle der Menschen verletzt, das sind aber Menschen die mir entweder nahe stehen oder eben solche, die ich kennengelernt habe, wo eine Freundschaft enstehen könnte. Sprich, keine Wildfremden wie solche, die ich auf der Straße treffe oder Ingame.\nAber ich verletze sie nicht, weil ich ihnen Beleidigungen an den Kopf geworfen habe sondern einfach, weil ich schlichtweg ehrlich war. \nIch weiß aber auch, wann ich den Mund aufmachen sollte und wann es besser ist den Mund zu halten. Natürlich bin ich auch ein Mensch und nicht unfehlbar. Wie gesagt gab es auch Situationen in denen ich Menschen unbedacht verletzt habe. Aber im Gegensatz zu den Flamern tut mir mein Verhalten sofort leid und ich entschuldige mich. Meine Intention ist einfach nur die ehrliche Meinung und nicht das beleidigen und fertig machen und auf Fehler rumtanzen wie Flamer das gerne tun. \n\nWenn ich wie ein Flamer wäre, dann würde ich wohl auch meine Meinung im Chat auslassen und ihnen diese unter die Nase reiben. Aber wie gesagt habe ich gelernt mich Fremden gegenüber entsprechend respektvoll zu benehmen und das schließt die Ingamespieler nun mal mit ein. \n\nDu sagst, du hast es auch beigebracht bekommen, aber dann frage ich mich, wieso du dich dann nicht auch so benimmst/benommen hast, wie man es dir beigebracht hat.\nDu sagst selbst, dass du ein Flamer warst. Du warst also alles andere als respektvoll zu anderen Menschen. \nEhrlichkeit ist gut und schön, aber man sollte auch wissen, wann man ehrlich sein sollte und wann eben nicht. \nUnd ingame hat eine Ehrlichkeit nach dem Motto \"raushauen, wie scheiße einer ist\" eben nichts zu suchen. Das ist toxisch und unhöflich und eben nicht respektvoll... \n\nDu hast dann wohl einfach nicht gelernt, wie man respektvoll ist. {{sticker:zombie-brand-clap}}","replies":[{"poster":"ITroll4Fun","date":"2019-09-26T16:12:25.814+0000","up_votes":1,"down_votes":0,"body":"Oh sorry habe wohl deine Antwort übersehen.\n\n>Wem sollte das nichts ausmachen, deinen Mitspielern? Wenn du im Chat nicht toxisch bist, woher sollen sie bitte wissen, dass du ein toxischer Spieler bist und einfach nur den Bann fürchtest und deswegen nicht den Chat nutzt?\n\nMan kann auch durch seine Spielweise toxisch sein, findeste nicht? Zum Beispiel permanent ein Off-Meta-Pick spielen? Oder siehste das als nicht toxisch an? Die Mehrheit meiner Mitspieler, die das Vergnügen hatten, werden dir bestimmt widersprechen.\n\n>Du sagst, du hast es auch beigebracht bekommen, aber dann frage ich mich, wieso du dich dann nicht auch so benimmst/benommen hast, wie man es dir beigebracht hat.\n\nVerstehe ich nicht. Gute Erziehung und Nerven aus Stahl sind zwei verschiedene Sachen  oder denkste ich werde gleich bei jedem ersten Fehler/insult toxisch? Und zweitens, bin ich \"toxisch\" und nicht beleidigend, jedenfalls nehme ich es als Beleidung wahr, sondern als eine übertriebene Hyperbel oder Sarkasmus bzw, fast schon Zynismus.\n\nAus Interesse wie haste dir eiserne Nerven angelegt? Vielleicht probieren ich die Methode aus.\n\nWenn ich meine Toxizität rauslasse bin ich respektlos? Kann sein, aber dennoch greife ich den Spieler persönlich an, also nur ihn für sein schlechtes Spiel. Das finde ich, gehört zu einem kompetitiven Spiel wie League.","replies":[{"poster":"Angel Ayume","date":"2019-09-26T17:16:03.237+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CptOnDuty,realm=EUW,application-id=KYnfKGf0,discussion-id=nRwP6HA3,comment-id=0004000000000000000000000000000000000000,timestamp=2019-09-26T16:12:25.814+0000)\n>\n> Oh sorry habe wohl deine Antwort übersehen.\n\nNicht schlimm.\n\n> \n> Man kann auch durch seine Spielweise toxisch sein, findeste nicht? Zum Beispiel permanent ein Off-Meta-Pick spielen? Oder siehste das als nicht toxisch an? Die Mehrheit meiner Mitspieler, die das Vergnügen hatten, werden dir bestimmt widersprechen.\n> \n\nJapp, ich finde das nicht toxisch. Toxisch wird es erst, wenn du auch absichtlich scheiße spielst und das Game bewusst negativ manipulierst. Solange du mit deinem Teemo Support ordentlich spielst und dein bestes gibst und für einen Sieg spielst ist nichts toxisches da dran. \n\nIch hatte schon oft Support Teemos im eigenen Team. Natürlich schaut man erst mal skeptisch und würde sich lieber einen Champ wünschen der auch tatsächlich ein Support ist. Ich würde diesem Spieler aber nie absichtliche Manipulation vorwerfen, wenn ich sehe, dass er dennoch versucht zu gewinnen... \n\n\n> Verstehe ich nicht. Gute Erziehung und Nerven aus Stahl sind zwei verschiedene Sachen  oder denkste ich werde gleich bei jedem ersten Fehler/insult toxisch? Und zweitens, bin ich \"toxisch\" und nicht beleidigend, jedenfalls nehme ich es als Beleidung wahr, sondern als eine übertriebene Hyperbel oder Sarkasmus bzw, fast schon \n\nIch habe keine Nerven aus Stahl. Bei weitem nicht. Du kannst gern mal meinen DuoQ Partner fragen, wie ich mich manchmal verhalte, wenn ich ingame bin. ^^ \n\nEs ist aber ein Unterschied zwischen \"sich über etwas aufregen\" und \"sich aufregen und andere verbal im Chat dafür niederzumachen\". ;) \n\n> \n> Aus Interesse wie haste dir eiserne Nerven angelegt? Vielleicht probieren ich die Methode aus.\n> \n\nHab ich nicht. Aber ich sage mir immer wieder, dass andere auch Fehler begehen und ich diese Fehler nicht ändern kann. Niemand ist fehlerfrei, weder ich, noch meine Teammates. Und in meiner Elo passieren eben einige Fehler. Was passiert ist, ist passiert. Es hat keinen Zweck sich darüber aufzuregen, denn ich kann die Situation nicht ändern. Was ich aber machen kann ist, dass bestmögliche aus dieser Situation rauszuholen. Dafür muss ich aber nun mal einen kühlen Kopf bewahren. Wenn ich tilte ist mein Hirn benebelt von Wut und ich handele nicht so, wie es am besten wäre.\n\nWenn mein Jungler ein Arsch ist und vor meiner Nase den Blue wegsmited obwohl ich mein halbes Mana dafür aufgebraucht habe diesen low zu hauen, rege ich mich auf, aber ich kanns nicht ändern, ich schimpfe kurz über ihn und nehme es dann eben so hin. \nAber ich würde den Teufel tun und dasselbe dann bei ihm machen oder ihn einfach sterben lassen, obwohl ich ihn retten könnte. Warum sollte ich das tun? Ich spiele doch für mich. ICH möchte gewinnen, ICH möchte Elo machen, ICH möchte climben. \nWenn mich andere darin behindern, weil sie ihre Emotionen nicht unter Kontrolle haben, dann mache ich es nicht besser indem ich es ihnen gleich tue. \nAlso gehe ich hin und rette meinem Jungler den Arsch und töte mit ihm zusammen den Gegner, anstatt ihn elendig verrecken zu lassen, nur weil ich sauer auf ihn bin, weil er mir kurz vorher den Bluebuff genommen hat. \n\nUnd im Chat würde ich ihn erst recht nicht niedermachen. Erst recht nicht, wenn er einfach kacke spielt. Jeder spielt mal kacke, Fehler passieren, sie machen das ja nicht absichtlich. Sie regen sich wahrscheinlich noch selbst über sich auf, sind wütend auf sich selbst, ja vllt sogar frustriert. Wieso sollte ich sie dann noch mit Füßen treten für einen Fehler, den sie nicht absichtlich begangen haben? Außerdem stehe ich nicht in der Position ihn zu tadeln. Das wäre die Aufgabe eines Coachs und der bin ich nicht. Ich bin irgendein random der mit ihm zusammen gematched wurde. Der auf meinem Niveau spielt. Ich habe gar nicht das Recht ihn zurechtzuweisen. \n\nAußerdem weiß ich, dass das für die Situation nichts bringen würde. Ich würde es nur schlimmer machen. Der Spieler würde noch mehr tilten, er würde vllt anfangen im Chat zu flamen und wäre noch mehr abgelenkt. Ich will doch das Spiel gewinnen, ich will doch LP bekommen. Wieso sollte ich dann absichtlich dagegen arbeiten? \n\n> Wenn ich meine Toxizität rauslasse bin ich respektlos? Kann sein, aber dennoch greife ich den Spieler persönlich an, also nur ihn für sein schlechtes Spiel. Das finde ich, gehört zu einem kompetitiven Spiel wie League.\n\nJa bist du. Sobald du den Spieler dafür flamest bist du respektlos. Auch wenn du ihm nicht direk Beleidigungen an den Kopf wirfst. Man kann auch ohne Beleidigungen beleidigend sein. \nUnd ihn verbal nieder zumachen, weil er einen oder mehrere Fehler begangen hat finde ich nicht respektvoll...","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Me vs You","date":"2019-09-17T21:43:35.203+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lucifer Z,realm=EUW,application-id=KYnfKGf0,discussion-id=nRwP6HA3,comment-id=00040000,timestamp=2019-09-17T13:17:06.767+0000)\n>\n> Ich habe in der tat seit dieser Saison wieder sehr viel gespielt. Eine Ermahnung, Verwarnung oder Sonstiges kam aber nicht.\n> Da ich heute mal viele Forenbeiträge und Themen gelesen habe und sehr viele Leute eine \"Entbannung\" wollen, hat mich das Ganze mal interessiert. Als \"Kind\" war ich eben ein toxischer Idiot.\n\nBeschimpf dich nicht selber als Idiot, weil diese Selbstpsychologie nicht funktioniert, es wird kein Riotboss kommen und sagen \" oh er sieht sich als Idiot, das bedeutet er ist reif, komm der bekommt eine goldene Weste\" .\nDu bist immer bei denen registriert, die haben deinen Verlauf und Punkt.\nWenn du jetzt flamest wie ein Monster, dann schauen die deine History an und handeln demnach.\nDein Account wird beim flamen auffällig und so wie man Riot kennt gibt es dann keine Gnade.\n\n{{champion:10}} Justice","replies":[{"poster":"Lucifer Z","date":"2019-09-18T06:08:26.075+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Me vs You,realm=EUW,application-id=KYnfKGf0,discussion-id=nRwP6HA3,comment-id=000400000001,timestamp=2019-09-17T21:43:35.203+0000)\n>\n> Beschimpf dich nicht selber als Idiot, weil diese Selbstpsychologie nicht funktioniert, es wird kein Riotboss kommen und sagen \" oh er sieht sich als Idiot, das bedeutet er ist reif, komm der bekommt eine goldene Weste\" .\n> Du bist immer bei denen registriert, die haben deinen Verlauf und Punkt.\n> Wenn du jetzt flamest wie ein Monster, dann schauen die deine History an und handeln demnach.\n> Dein Account ist auffällig und so wie man Riot kennt gibt es auch keine Gnade.\n> \n> {{champion:10}} Justice\n\nSelbstpsychologie ist Selbsterkenntnis und keine Projektion an Andere. Ich glaube nicht, dass hier jemand von Riot mitliest. Ich beschimpfe mein junges Ich als Idiot, weil das nun mal so ist. Selbstreflexion hat übrigens mit Reife ebenfalls nichts zu tun. \n\nDanke für die Antwort. So habe ich das vermutet. Zum Glück bin ich kein Flamer und brauche mir nie Sorgen zu machen. Ansonsten wäre eine Strafe so oder so verdient!\n\nEdit: deine Antwort ist falsch. Man wird bei gutem Verhalten zurückgestuft. Bitte gebe solche Informationen in Zukunft nur weiter, wenn du dir sicher bist!","replies":[{"poster":"Me vs You","date":"2019-09-18T14:32:19.858+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lucifer Z,realm=EUW,application-id=KYnfKGf0,discussion-id=nRwP6HA3,comment-id=0004000000010001,timestamp=2019-09-18T06:08:26.075+0000)\n>\n> Selbstpsychologie ist Selbsterkenntnis und keine Projektion an Andere. Ich glaube nicht, dass hier jemand von Riot mitliest. Ich beschimpfe mein junges Ich als Idiot, weil das nun mal so ist. Selbstreflexion hat übrigens mit Reife ebenfalls nichts zu tun. \n> \n> Danke für die Antwort. So habe ich das vermutet. Zum Glück bin ich kein Flamer und brauche mir nie Sorgen zu machen. Ansonsten wäre eine Strafe so oder so verdient!\n> \n> Edit: deine Antwort ist falsch. Man wird bei gutem Verhalten zurückgestuft. Bitte gebe solche Informationen in Zukunft nur weiter, wenn du dir sicher bist!\n\nHm, habe zwar nie gesagt, dass es keine Zurückstufung gibt aber O.K., merke ich mir für die Zukunft, danke. {{champion:222}}","replies":[]}]},{"poster":"eingew","date":"2019-09-18T04:21:15.163+0000","up_votes":2,"down_votes":1,"body":"Das ist schlicht falsch und da gibt es auch genügend Beispiele für. Wenn du dich ausreichend besserst, kannst du Strafstufen absteigen.","replies":[{"poster":"Me vs You","date":"2019-09-18T14:26:29.009+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=nRwP6HA3,comment-id=0004000000010000,timestamp=2019-09-18T04:21:15.163+0000)\n>\n> Das ist schlicht falsch und da gibt es auch genügend Beispiele für. Wenn du dich ausreichend besserst, kannst du Strafstufen absteigen.\n\nHabe nie das Gegenteil behauptet.\nIch sagte nur, es wird nach dem was er tut gehandelt. Wenn er nun flamed, die das im Verlauf sehen, dann wird danach gehandelt.\nUnd unsere Verläufe kann man bestimmt auch in einer Art History nachsehen, auch nur wahr.","replies":[{"poster":"eingew","date":"2019-09-20T04:06:28.660+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Me vs You,realm=EUW,application-id=KYnfKGf0,discussion-id=nRwP6HA3,comment-id=00040000000100000001,timestamp=2019-09-18T14:26:29.009+0000)\n>\n> Habe nie das Gegenteil behauptet.\n> Ich sagte nur, es wird nach dem was er tut gehandelt. Wenn er nun flamed, die das im Verlauf sehen, dann wird danach gehandelt.\n\nWenn eine Strafe weit zurück liegt und er sich laut System gebessert hat, dann aber doch wieder flamed und dies in seiner \"History\" - seinem Log - zu sehen ist, wird er dennoch \"nur\" die niedrigere Strafstufe erhalten, so als wäre er das letzte Mal nicht bestraft worden.","replies":[]}]},{"poster":"Lucifer Z","date":"2019-09-18T06:14:58.087+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=nRwP6HA3,comment-id=0004000000010000,timestamp=2019-09-18T04:21:15.163+0000)\n>\n> Das ist schlicht falsch und da gibt es auch genügend Beispiele für. Wenn du dich ausreichend besserst, kannst du Strafstufen absteigen.\n\nDanke!","replies":[]}]}]}]}]},{"poster":"Veezey","date":"2019-09-17T12:59:42.625+0000","up_votes":4,"down_votes":0,"body":"Bevor das neue System kam hat sowieso jeder eine weiße Weste bekommen. Wenn du seitdem nichts angestellt hast, wird dir auch so schnell nichts passieren. Außer du schreibst sowas wie kys oder ähnliches.","replies":[]},{"poster":"AudreyrJmEb","date":"2019-09-17T12:51:05.853+0000","up_votes":4,"down_votes":0,"body":"Falls in den letzten 6-7 Jahren wirklich stille war wirst du nicht sofort einen perma ban kassieren falls du mal toxic werden würdest. Kriegst zumindest ne CR Vorwarnung.","replies":[{"poster":"ITroll4Fun","date":"2019-09-17T19:26:14.894+0000","up_votes":1,"down_votes":1,"body":"Das skalliert doch nicht mit der Zeit, sondern gespielten Spielen, Leider spreche ich aus Erfahrung, RIP smurf account.","replies":[]}]},{"poster":"00 M4ddin 00","date":"2019-09-17T13:28:29.266+0000","up_votes":2,"down_votes":0,"body":"Wenn du in den Jahren nicht gespielt hast dann ist das für das System so als hättest du gestern die Strafe bekommen. \n\nDas System rechnet in spielen nicht in zeit. Und schon garnicht in inaktiver zeit ^^","replies":[{"poster":"OT Riku","date":"2019-09-18T04:27:29.732+0000","up_votes":3,"down_votes":0,"body":"Eigentlich nicht, da seine sperre bestimmt vor den IFS war und jeder da mit einer weißen Weste vom neuen System behandelt wurde.\n\nKann mich aber auch irren.","replies":[{"poster":"Izaya Kumiho","date":"2019-09-18T13:13:55.511+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OT Riku,realm=EUW,application-id=KYnfKGf0,discussion-id=nRwP6HA3,comment-id=00060000,timestamp=2019-09-18T04:27:29.732+0000)\n>\n> Eigentlich nicht, da seine sperre bestimmt vor den IFS war und jeder da mit einer weißen Weste vom neuen System behandelt wurde.\n\n\nWie man aus dem Redpost hier lesen kann:\n\n>One last note: because of the scope of these changes, all chat and ranked restrictions will be reset and past restrictions won’t count against you in the new system. Everyone’s slate is wiped clean (for these restrictions), so this is a great time to turn over a new leaf. \n>\n>https://boards.na.leagueoflegends.com/en/c/gameplay-balance/Boqd81O0-upcoming-upgrades-to-chat-restrictions\n\nBzw, jein. Es sind halt nur die Chat restrictions gewesen. Wir reden hier von einem Tempbann, my bad. \nDas war mir da entfallen ;O","replies":[]}]}]},{"poster":"PHUB Silphi","date":"2019-09-17T12:58:14.752+0000","up_votes":1,"down_votes":9,"body":"mach doch einfach einen neuen account?","replies":[{"poster":"Megamaexx","date":"2019-09-17T13:33:15.077+0000","up_votes":5,"down_votes":0,"body":"Wäre der Tipp nicht erst ratsam, wenn sein Account gebannt wäre?","replies":[]}]},{"poster":"MidlaneGod115","date":"2019-09-17T12:54:42.255+0000","up_votes":2,"down_votes":0,"body":"Fordere es nicht heraus :D","replies":[]},{"poster":"QiYaNaOtPbm","date":"2019-09-20T05:24:19.201+0000","up_votes":1,"down_votes":0,"body":"Ich beschreib es so wie es mir damals in Season 4 erklärt wurde\nDu startest mit einer Grauen weste sprich wenn du was machst mit nem lvl 10 Acc wirst du eher bestraft als ein lvl 30 der nichts gemacht hat und dann ein mal was macht \nwenn du jetzt zbs Season 5 einen 14 tage bann bekommst und dann aber ein jahr ca nichts passiert was schwer ist da man nach einen 14 tage bann eine sehr fleckige weste hat \"verjährt \" das und du könntest in Season 6 statt ein Lifetime bann wieder 14 tage bekommen Hoffe die antwort hilft dir :)","replies":[]},{"poster":"Sihari","date":"2019-09-17T13:04:26.000+0000","up_votes":1,"down_votes":0,"body":"Ich glaube die Zeit für das Strafsystem wird in aktiver Spielzeit gemessen, weswegen deine Pause nichts bewirkt haben könnte.\nWas aber sein kann ist, dass während der Umstellung des Strafsystems von Tribunal auf Instantfeedback ein Reset vorgenommen wurde und du damit wieder eine reine Weste hast... Ich meine mich zumindest vage an irgendetwas in der Richtung zu erinnern. Ich weiß aber leider auch nicht mehr, wie lang diese Umstellung schon her ist und ob das für dich überhaupt relevant ist.","replies":[]}]}