{"poster":"H3ntaiPrincess","date":"2018-01-19T19:43:05.701+0000","title":"Sexismus in der League Community~","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":15,"body":"Hey! \r\nWie ihr sehen k&ouml;nnt, an meinem Nutzernamen (H3ntaiPrincess) bin ich ein M&auml;dchen, Girl, Woman (oder wie Leute uns mystische Kreaturen auch nennen: Egirls.)\r\nSo, die neue Season hat gestartet, ich dachte mir so HEY ab ins Ranked!\r\nUnd dann began es, sowohl ich Champselect, als auch ingame wurde ich permanent beleidigt. \r\n&quot;Oh hey, youre an EGirl go and play support.&quot; oder &quot;Hey can you send me nudes&quot; (was irgendwo wahrscheinlich als spa&szlig; gemeint war, trotzdem.) oder &quot;oh you are a girl, thats why youre so bad.&quot; \r\nIch muss sagen, selbst als ich 1/2/182 stand, mein restliches Team nur noch rein gerannt ist und starb wurde ich geflamt das ich wohl als &quot;EGIRL&quot; keine Augen h&auml;tte und wohl zu viel geblasen h&auml;tte f&uuml;r den Skin mit dem ich spielte. \r\nIch verstehe es irgendwie, wenn man flamt weil man bis zum geht nicht mehr getilted is und einem dann mal &quot;U suck&quot; raus rutscht. Das ist wohl irgendwann, mal jedem passiert. \r\nIch muss dazu sagen, ich beteilige mich recht wenig am Chat, meistens konzentriere ich mich auf mich selbst und wenn ich jemand f&uuml;r schlecht halte, sage ich das nur zu mir selbst und nicht zu demjenigen selbst. Denken, darf man ja was man will. \r\nAber wieso, wird man in der League Community derma&szlig;en angegriffen, nur weil man ein M&auml;dchen ist? \r\nUnd wenn man sie reportet, bekommen sie dann mal hier einen 2 Tage oder 2 Wochen ban, von dem sie nichts lernen.\r\nIch finde es erschreckend, das Frauen in dieser Community scheinbar wirklich f&uuml;r soooo viele nur beleidigt werden k&ouml;nnen.\r\nUnd ich will nicht meinen Benutznamen &auml;ndern, damit man mein Geschlecht nicht mehr beleidigt.\r\nGeht es anderen Frauen auch so? Wie geht ihr damit um?\r\nMich w&uuml;rde au&szlig;erdem sehr interessieren, was genau Riot Games davon h&auml;lt wie Frauen in der League of Legends Community da stehen. c:\r\n(Und als letztes: Das, ist kein Hate oder sonst was gegen Riot Games, aber ich f&auml;nde es mal gut wenn wir alle uns zusammen setzen k&ouml;nnten und vielleicht finden wir ja eine L&ouml;sung. Alles immer auf Rito zu schieben, bringt uns da auch nicht weiter. Und bereits das Honor System, war ein guter Schritt um solche Dinge zu verhindern. (: ) \r\n~H3 {{sticker:sg-ahri-2}}","replies":[{"poster":"LegendaryXenon","date":"2018-01-19T20:55:10.828+0000","up_votes":12,"down_votes":0,"body":"ist h3ntaiprincess wirklich so ein weiblicher Name?\n\nhätte dahinter eher einen introvertierten nerd mit seltsamen Fantasien vermutet{{sticker:zombie-brand-clap}}","replies":[{"poster":"hi im seb","date":"2018-01-19T21:59:32.956+0000","up_votes":6,"down_votes":0,"body":"https://imgur.com/gallery/P0p2N","replies":[]}]},{"poster":"Prod0x","date":"2018-01-19T20:25:39.869+0000","up_votes":10,"down_votes":3,"body":"Du willst die Aufmerksamkeit weiblich zu sein mit deinem Namen, dann leb mit den Konsequenzen.\nFrauen ziehen sich kurze Sachen an \"OHH DIE GAFFEN MICH AN,MIMIMI\"\n\nLächerlich was in den Medien propagiert wird.","replies":[{"poster":"LegendaryXenon","date":"2018-01-19T20:53:02.793+0000","up_votes":5,"down_votes":5,"body":"Selten so ein dämliches Argument gelesen. Gaffen ist auch bei knapper Kleidung nicht weniger widerlich.\n\n","replies":[{"poster":"Nohgolgh","date":"2018-01-19T21:36:24.796+0000","up_votes":9,"down_votes":0,"body":"Sich wie eine Nutte zu kleiden ist dann auch widerlich...oder wie in dem Fall einen pornographischen Namen zuzulegen. \n\nWer sich knapp kleidet, muss damit rechnen, dass über diesen Menschen ein entsprechendes Urteil gebildet wird und die Person muss mit den Reaktionen anderer Menschen klarkommen.","replies":[{"poster":"LegendaryXenon","date":"2018-01-20T07:34:31.136+0000","up_votes":3,"down_votes":7,"body":"Es gibt Unterschiede zwischen \"nuttig\" und sexy. \nEine Frau, die knapp bekleidet ist, ist kein Freiwild.\n\nEs ist eine Stilfrage, ob man da permanent hingaffen muss oder ob man sich zivilisiert benimmt.\n\nScheinbar platzt hier einigen die Hose, sobald eine ansatzweise hübsche, sexy bekleidete Frau erscheint.\n\n(Nicht speziell auf dich bezogen)","replies":[{"poster":"eingew","date":"2018-01-20T15:23:05.820+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=LegendaryXenon,realm=EUW,application-id=KYnfKGf0,discussion-id=jtxEsgBW,comment-id=0004000000000000,timestamp=2018-01-20T07:34:31.136+0000)\n>\n> Es gibt Unterschiede zwischen &quot;nuttig&quot; und sexy. \n> Eine Frau, die knapp bekleidet ist, ist kein Freiwild.\n\nInwiefern macht angaffen eine Frau zum Freiwild?\n\n> Es ist eine Stilfrage, ob man da permanent hingaffen muss oder ob man sich zivilisiert benimmt.\n> \n> Scheinbar platzt hier einigen die Hose, sobald eine ansatzweise hübsche, sexy bekleidete Frau erscheint.\n> \n> (Nicht speziell auf dich bezogen)\n\nDer Mensch ist doch ein Augentier\nSchöne Dinge wünsch ich mir\n\nDer Starrer und die Angestarrte triggern exakt denselben Effekt und leben exakt dieselbe menschliche Natur aus. Keinem wird dabei geschadet, keiner wird dabei zu irgendetwas gezwungen.","replies":[{"poster":"hi im seb","date":"2018-01-20T19:00:23.328+0000","up_votes":2,"down_votes":0,"body":"DOCH DU \nDU BIST NICHT SCHÖN\nNEIN","replies":[{"poster":"Waldschrat86","date":"2018-01-20T19:28:07.395+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sebtional,realm=EUW,application-id=KYnfKGf0,discussion-id=jtxEsgBW,comment-id=000400000000000000000000,timestamp=2018-01-20T19:00:23.328+0000)\n>\n> DOCH DU \n> DU BIST NICHT SCHÖN\n> NEIN\n\nMorgenstern erscheine ^^","replies":[{"poster":"hi im seb","date":"2018-01-20T19:41:26.365+0000","up_votes":2,"down_votes":0,"body":"https://78.media.tumblr.com/04fee3f7330c3b048a328f31baea81a1/tumblr_miot7sCHU01rlvsp0o1_500.gif","replies":[]}]}]}]},{"poster":"Nohgolgh","date":"2018-01-20T22:34:06.859+0000","up_votes":2,"down_votes":0,"body":">Es gibt Unterschiede zwischen \"nuttig\" und sexy.\nEine Frau, die knapp bekleidet ist, ist kein Freiwild.\n\nNatürlich gibt es Unterschiede zwische nuttig und sexy. Die Unterscheide äußern sich auch und die Reaktionen sind durchaus unterschiedlich. Eine Frau in einem passenden langen Kleid kann durchaus attraktiv sein, ohne nuttig rüberzukommen. Nur sind die dann eben oft nicht sonderlich knapp bekleidet. Auch das ist letztlich eine Stilfrage. \n\nUnd wer redet denn hier von Freiwild? Niemand hat das Statement gemacht, dass man Frauen begrapschen oder gar vergewaltigen darf, weil diese knapp bekleidet sind. Aber das Betrachten von Frauen ist etwas anderes. Wer sich beispielsweise in einem öffentlichen Raum aufhält, der hat kein Recht, dass man von anderen nicht betrachtet wird. Und eine Person hat generall kein Recht, dass man sich über sie kein Urteil bildet und dementsprechend handelt, solange die Persönlichkeitsrechte gewahrt bleiben. \n\nDazu kommt aber noch etwas weiteres: Nämlich, dass Frauen sich attraktiv kleiden, um Männern zu gefallen. Männer wählen Partner nämlich durchaus nach Kriterien der Attraktivität und Jungendhaftigkeit. Der einzige Unterschied zwischen dem gewollten Betrachtetwerden und dem Empfinden des Begafftwerdens ist derjenige, dass die Frau ein Interesse an einem Mann, nicht aber an dem anderen Mann hat. Und Frauen sind in der Partnerwahl deutlich selektiver als Männer. In deinem Stammbaum befinden sich wesentlich mehr weibliche Vorfahren als männliche. Ursache ist, dass es nur eine relativ geringe Anzahl von Männen sich mit einer großen Anzahl Frauen fortpflanzen konnte, während die anderen Männer keine Nachkommen zeugen konnten. Auch heute ist deine Chance verheiratet zu sein und/oder viele Partner zu haben als Mann DRASTISCH höher, wenn du einen hohen sozioökonomischen Status hast. \n\nhttp://www.ijsrp.org/research-paper-1013/ijsrp-p2225.pdf\n\nWenn aber der einzige Unterschied für das Empfinden der Frau nicht die Handlung ist, sondern derjenige, der sie ausführt, dann ist dein Begafftwerden gar nicht so leicht von einem gesunden sexuellen Interesse am anderen Geschlecht zu unterscheiden.\n\nZudem ist die Kritk am nuttigen Verhalten keine ausschließlich männliche. Im Gegenteil. Für einen Mann gibt es doch primär kaum etwas besseres als eine Frau, mit der man schlafen kann, ohne weitere Verantwortung übernehmen zu müssen. Dass diese Frau langfristig kein guter Partner ist, steht auf einem ganz anderen Blatt. Das Problem liegt doch eher bei den Frauen, deren \"Marktwert\" durch die schwerere Zugänglichkeit im Verhältnis zu den leicht zugänglichen Frauen sinkt und die damit ihren Vorteil des hohen Selektionsdruckes gegenüber Männern verlieren. \n\nhttps://allesevolution.wordpress.com/2013/06/16/frauen-bewerten-schlampen-schlechter-und-wollen-nicht-mit-ihnen-befreundet-sein/\n\n(Primärquellen finden sich auf der Website). \n\nAngesprochen wird das ganze auch hier irgendwo in der Mitte des Videos, wo es um die sexuelle Verwiirung generell geht. \n\nhttps://www.youtube.com/watch?v=mQqySz8Ihho\n\nUnd das, weil es einfach nur witzig ist. \n\nhttps://www.youtube.com/watch?v=rei9QnM_2xM","replies":[{"poster":"eingew","date":"2018-01-21T08:25:08.461+0000","up_votes":1,"down_votes":0,"body":"Das erste Video habe ich mir jetzt nicht angesehen, aber vielleicht eine Sache, die mir beim zweiten Video eingefallen ist:\n\nDie Schwierigkeit, die man vor der Entdeckung des Vaterschaftstest hatte, hat sich in vielen Kulturen darin ausgewirkt, dass man eine matrilineare Erbfolge benutzt hat. Dh, dass die Verwandten der Mutter immer wichtiger für das Kind waren, als die des Vaters, weil beim Vater eben gar nicht mal so sicher war, ob er tatsächlich der Vater ist, bei der Mutter dagegen besteht ja kein Zweifel (oder zumindest ist dieser deutlich geringer). Deshalb hatte man früher auch die anderen Verwandtschaftsbezeichnungen (Oheim, Muhme,.. statt Onkel und Tante), die vermutlich in erster Linie ausgestorben sind, weil sich die Gesellschaft aufgrund des technischen Fortschritts so entwickelt hat, dass man auf diese Erblinie nicht mehr so viel Acht geben muss.","replies":[]}]}]}]},{"poster":"Prod0x","date":"2018-01-19T22:16:00.568+0000","up_votes":3,"down_votes":0,"body":"Ja das bekommst du von den Medien so propagiert und im gleichen Zug ist es immer mehr okay \"nuttig\" rumzulaufen.\nKinder mit 12 reden mittlerweile über Sex und andere Dinge.\n\n**DA IST DER FEHLER!** Aber ich bin eh durch mit der Gesellschaft.\nNoch 10 Jahre mit dieser aufgesetzten mainstream Meinung und man kann in den Nachbarstaaten Asyl beantragen.\n\nMänner folgen letzendlich nur den natürlichen sexuellen Reiz, ich möchte keine Belästigung schön reden, aber wenn Frauen sich knapp bekleiden, sind sie teilweise sicherlich selbst schuld.\n\nHatet mich ruhig","replies":[{"poster":"LegendaryXenon","date":"2018-01-20T07:26:21.138+0000","up_votes":1,"down_votes":6,"body":"Ich hate dich dafür tatsächlich, da wir keine Tiere sind. Zwar gucke ich sicherlich auch, aber ich gaffe nicht.\nAuch eine Frau muss sich in der heutigen Welt frei bewegen und anziehen dürfen, so rückständig sollten wir nicht mehr denken. Dass du durch mit der Welt bist, ist schade, jedoch erscheint es mir paradox, dass du dich über sie stellst. Du bist schließlich genau so ein behaftetes Zahnrädchen in einem System, dass sicherlich besser funktionieren könnte.\n\nWenn man bullshit redet und mit \"hated mich ruhig\" kommt, ist an dieser Stelle aber eh alles gesagt.","replies":[{"poster":"Miniphiri","date":"2018-01-20T09:44:37.074+0000","up_votes":5,"down_votes":0,"body":"menschen sind Tiere und zwar Säugetiere. Auch wir unterliegen natürlichen Trieben auch wenn Menschen wie du scheinbar davor versuchen die Augen zu verschließen. Klar wir haben mehr vernunft und co aber das ändert nichts daran das wir ausreichend natrüliche Triebe haben: der überleben, nahrung,reproduktion, sicherheit usw. \n\nGerade der Trieb zur Reproduktion wird durch äußerliche Reize sehr beeinflußt wie auch allgemein in der Tierwelt. Wer sich dann noch beschwert das welche gaffen, wohlgemerkt nur gaffen und nicht anfassen usw. , hat zum einen keine ahnung und zum anderen natürliche reize zur visuellen Stimulation genutzt. \n\nbevor du also andere beschuldigst bullshit zu reden: beschäftige dich erst mal mit dem thema.","replies":[{"poster":"LegendaryXenon","date":"2018-01-20T13:16:26.780+0000","up_votes":1,"down_votes":5,"body":"Triebe kann man aber durch zivilisiertes Verhalten im Zaum halten. Natürlich registriert man Frauen, die sich sexy kleiden. Es ist für mich trotzdessen eine Stilfrage.\nFür mich bist du eben widerlich, wenn du dich da nicht beherrschen kannst und mit deinen Trieben argumentierst, einfach nur primitiv.","replies":[]}]}]}]},{"poster":"Miniphiri","date":"2018-01-19T23:09:59.680+0000","up_votes":2,"down_votes":0,"body":"sich kanpp und sexy zu kleiden ist mit der absicht verbunden aufmerksamkeit zu erregen . wenn man dann jammert ist ein was ersichtlich: man ist zu dumm für die welt","replies":[{"poster":"LegendaryXenon","date":"2018-01-20T07:31:12.391+0000","up_votes":1,"down_votes":4,"body":"Wenn man sich bis zu einem gewissen Grad sexy kleidet und belästigt wird, sagt das nur eins: Frauen bewegen sich scheinbar nicht so frei in unserer Gesellschaft, oder zumindest nur so frei, wie es die Triebgesteuerten gern hätten. \nIhr habt als Unbekannte nicht darüber zu richten und nicht das Recht zu gaffen, schlimm dass so ein Denken in einer zivilisierten Gesellschaft existiert.","replies":[{"poster":"Veezey","date":"2018-01-20T10:05:13.540+0000","up_votes":2,"down_votes":0,"body":"Man hat kein recht zu gaffen? Also soll man mit geschlossen Augen rumlaufen oder wie soll man das verstehen?","replies":[{"poster":"LegendaryXenon","date":"2018-01-20T13:13:34.596+0000","up_votes":1,"down_votes":5,"body":"Gaffen und gucken im Sinne von bemerken sind für mich unterschiedlich. Ich finde Typen einfach ekelhaft, die sich da nicht beherrschen können.","replies":[{"poster":"Veezey","date":"2018-01-20T19:54:53.833+0000","up_votes":4,"down_votes":0,"body":"Also, wenn ich eine sexy Dame bemerke sollte ich direkt wieder wegsehen? Ab wann ist es denn gaffen und wo hört das gucken auf? \nFrauen kleiden sich nicht ohne Grund sexy ein. Sie wollen bemerkt werden. Wenn ein Typ sich jetzt ein Rosa Tutu anzieht, dann wird er sicherlich auch erwarten, dass in alle angaffen werden.","replies":[]},{"poster":"Miniphiri","date":"2018-01-20T14:35:35.946+0000","up_votes":2,"down_votes":0,"body":"achja als wenn Frauen nicht hemmungslos gaffen können . Sry aber euer geschlecht ist da dann genauso ekelhaft um es mit deinen Worten auszudrücken .","replies":[]}]}]},{"poster":"eingew","date":"2018-01-20T15:33:25.132+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=LegendaryXenon,realm=EUW,application-id=KYnfKGf0,discussion-id=jtxEsgBW,comment-id=0004000000020000,timestamp=2018-01-20T07:31:12.391+0000)\n>\n> Wenn man sich bis zu einem gewissen Grad sexy kleidet und belästigt wird, sagt das nur eins: Frauen bewegen sich scheinbar nicht so frei in unserer Gesellschaft, oder zumindest nur so frei, wie es die Triebgesteuerten gern hätten. \n\n?\n\nFrauen, die sich möglichst knapp oder schön kleiden *leben frei ihren Trieb aus*. Das nennt man Balzverhalten. \n\n> Ihr habt als Unbekannte nicht darüber zu richten und nicht das Recht zu gaffen, schlimm dass so ein Denken in einer zivilisierten Gesellschaft existiert.\n\nAber sicher hat jeder Mensch das Recht darüber, sein persönliches Urteil über jeden seiner Mitmenschen zu fällen wie er es will und seine Handlungen entsprechend auszurichten. Umgekehrt hat kein Mensch das Recht dazu, die körperliche oder geistige Selbstbestimmung seiner Mitmenschen einzuschränken. Mit einem persönlichen Urteil tust du das aber keineswegs.\n\nOder anders gesagt, wenn du Leute nicht nach dem Aussehen oder ihren Usernamen beurteilen willst, ist das *deine* Entscheidung. Jeder sonst hat die Freiheit dazu, genau das zu tun.","replies":[]}]},{"poster":"Titanium Dragon","date":"2018-01-21T18:14:11.543+0000","up_votes":1,"down_votes":1,"body":"Das ist doch Unsinn. Ich ziehe in Ägypten im Urlaub auch Tanktops an, nicht weil ich Aufmerksamkeit oder so will, sondern weil es den Verhältnissen entsprechend ist und ein TShirt zu warm wäre. Aber bleiben wir bei den Frauen: Hast du nicht in Erwägung gezogen, dass sie sich in gesagter Kleidung schön fühlen? Dürfen sie sich nicht schön fühlen, ohne dass irgendwelche Leute denen irgendnen Bullshit an den Kopf werfen?","replies":[]}]}]}]},{"poster":"Megnok","date":"2018-01-20T10:10:16.143+0000","up_votes":7,"down_votes":0,"body":"Also, ich spiel nu seit 5 jahren Lol, und ich wurde NIE wegen meines Geschlechts blöd angemacht. Aber das mag auch daran liegen dass ich nicht jedem Hinz und Kunz im Internet auf die Nase binde dass ich Brüste habe. Wenn man die Aufmerksamkeit in dieser Richtung haben will und drauf hinweißt, sei mit dem namen oder einfach so im Chat, dann hat man in meinen Augen auch schon kein recht mehr sich über dumme Sprüche aufzuregen.\n\nDas ist wie mit den Flamern in Lol. Man kann sie muten und reporten, und gut ist. Man kann sich aber auch künstlich über sie aufregen, sich provozieren lassen und selbst noch nen Ban abgekommen und sich dann lauthals drüber beschweren. hat für mich dann genauso viel Gewicht, nämlich gar keins weil selber Schuld.","replies":[]},{"poster":"Qbert","date":"2018-01-22T06:03:46.160+0000","up_votes":6,"down_votes":0,"body":"...jetzt hat schon die Sexismusdebatte ein Spiel, welches FSK 12 ist, erreicht?\nIch lehne mich mal aus dem Fenster und sage dir, es liegt am Namen. Du suggerierst hier der Zielgruppe (die, sind wir mal ehrlich, hauptsächlich pubertierende Männchen ist), dass du eine Weibchen bist ... was erwartest du da?\nWas ich so in den Kommentaren lese und auch durch meine Freundin bestätigen kann ... wenn die Leute nicht OFFENSICHTLICH darauf hingewiesen werden, vermuten sie hinter dem Spieler kein Weibchen.\nDieser Nick steht ungefährt auf dem selben Level wie im Bikini an einen Strand voller 16-jähriger Typen zu gehen ... das macht Frau nicht freiwillig.\nDer gesunder Respekt gegenüber dem anderen Geschlecht kommt erst mit dem Alter ... wenn das \"Hahnengehabe\" abgeklungen ist ... ist leider so.\n\nAlso ich kann dir nur empfehlen, nimm einen anderen Nick oder lerne solche dummen Kommentare zu ignorieren. Ich kenn dich nicht, aber ab einem bestimmten Attraktivitätsgrad erlebst du so etwas auch im realen Leben.\n\nHier nun eine Sexismusdebatte vom Zaun zu brechen, ist aufgrund des Alters der Zielgruppe(ich gehe davon aus, dass diese den Großteil der Spieler stellt) absolut übertrieben und auch unnötig.","replies":[{"poster":"Time2Whine","date":"2018-01-22T09:51:58.063+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=KYnfKGf0,discussion-id=jtxEsgBW,comment-id=0010,timestamp=2018-01-22T06:03:46.160+0000)\n>\n> Dieser Nick steht ungefährt auf dem selben Level wie im Bikini an einen Strand voller 16-jähriger Typen zu gehen ... das macht Frau nicht freiwillig.\n\nGenau das ist das passende Argument! Meine Frau sagt auch immer, dass wenn attraktive Frauen sich über Typen beschweren die sie angraben oder betatschen, sie aber in Hotpants in denen der halbe Arsch rausfällt und kurzem Oberteil mit riesem Auschnitt in die Disko o.ä. gehen sie einfach selber Schuld haben. Frauen die sich so verhalten oder sich so anziehen provozieren, auch wenn ich antatschen nicht für gut heiße, solches Verhalten der männlichen Bevölkerung und wollen diese Aufmerksamkeit auch bekommen. Frauen wissen i.d.R. ganz genau was sie tun müssen um die Männer rumzukriegen und da kann man mir auch nicht erzählen, dass sie sich dann unschüldig tun.\n\nWenn ich dann den Nick vom TE lese denke ich mir genau dasselbe. Er geht zwar nicht ins sexischtische, aber er deutet schon eine Richtung an und wenn dann einer von dummen Sorte den Namen liest kann ich mir gut vorstellen dass dann ein dummer Spruch kommt.\n\nAn den TE: Nimm dir solche dummen Kommentare nicht zu herzen. Mute solche Leute und reporte sie am Ende des Spiels, wenn es wirklich unter die Gürtellinie geht, für Hetzreden. Sexismus steht bei Riot auf einer Stufe mit Rassismus, Homophobie etc.","replies":[{"poster":"Qbert","date":"2018-01-22T09:56:10.423+0000","up_votes":2,"down_votes":0,"body":"Ja, es gibt eben immer zwei Seiten einer Medaille ... was einige Frauen aber gerne vergessen.\n\nAuf der einen Seite wollen und können Sie hier Ihren Körper zeigen ... das ist legitim und oft auch wirklich hübsch anzusehen. Auf der anderen Seite jedoch vergessen sie, dass nicht jeder Mann die Grenzen kennt und dann eben körperlich wird ... es gibt ja sogar Frauen die beschweren sich, dass sie angeschaut werden ... das finde ich dann schon extrem abstrus.","replies":[{"poster":"Time2Whine","date":"2018-01-22T10:13:07.349+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=KYnfKGf0,discussion-id=jtxEsgBW,comment-id=001000000000,timestamp=2018-01-22T09:56:10.423+0000)\n>\n>.....es gibt ja sogar Frauen die beschweren sich, dass sie angeschaut werden ... das finde ich dann schon extrem abstrus.\n\nSolange man nicht körperlich wird ist anschauen vollkommen legitim und Beschwerden darüber komplett lächerlichsowie bei einem attraktiven Outfit umso lächerlicher. Jeder hat das Recht sich ein Bild über den anderen Menschen zu machen.","replies":[{"poster":"Qbert","date":"2018-01-22T10:34:23.208+0000","up_votes":1,"down_votes":0,"body":"na das sag mir mal, wenn ich bei dir wieder über die Toilettenwand schiele *hehe*","replies":[{"poster":"Eibert Rümmel","date":"2018-01-22T10:42:14.085+0000","up_votes":1,"down_votes":0,"body":"als ob du drüberkucken könntest.... du schaust doch unten durch :P","replies":[{"poster":"Qbert","date":"2018-01-22T10:46:18.637+0000","up_votes":1,"down_votes":0,"body":"das kommt ganz auf meine Ambitionen drauf an ... sind diese hoch, kletter ich, sind diese nicht so hoch, schiele ich von unten rein und laufe Gefahr entdeckt zu werden >:(","replies":[]}]}]}]}]}]}]},{"poster":"MeMyselfandBaal","date":"2018-01-20T02:23:42.219+0000","up_votes":3,"down_votes":3,"body":"Als jemand, der mit einer bekennenden Feministin verwandt ist... verwende ich mal ihre Worte: Warum sollte es in LoL anders sein als in der Wirklichen Welt...\n\nUnd ja, wenn du dich \"da draußen\" genau so präsentierst wie hier mit deinem Namen, wirst du auch \"dort\" regelmäßig Probleme bekommen... Warum sollten gerade die Abgründe des Internets ein besserer Ort sein?\n\nWas mich ja schon wieder triggert... sind die \"Mit deinem Namen hast du es doch proviziert\" Gelaber... Also wieder der Wortlaut meiner Schwester: Man muss sich doch als Frau sexy kleiden können, ohne dass einem gleich Männer an den Arsch grapschen... \nVor allem... macht das mal als Mann... also als ich letztens mit nem WaifuRapist zusammen spielen durfte, war der total entsetzt, dass ich ihn darauf hin geschrieben habe, dass ich ihn dafür Reporte... weil ich Vergewaltigungsanspielungen in LoL (oder sonst irgendwo) halt nicht lustig finde... Der sollte diese Reaktion viel häufiger provozieren als unsere Prinzessin hier, war aber trotzdem völlig verwundert, dass ich das als unangebracht empfand... und hat mich als Feminist beschimpft... Glaubt mir, ich kenne Feministen, ich bin weit davon entfernt einer zu sein... aber ich nehme Probleme halt wahr und ignoriere sie nicht...\n\nOder... ihr nutzt eure Körpermaße inklusive Schwanzlänge als Summonername... also um nen Beispiel zu nehmen, auf das man häufiger trifft... glaubt ihr, dass da irgendjemand \"angemessen\" drauf reagiert? Also mit einem \"There's no way your dick is that big!\" oder \"Nette Bewerbung für nen Schwulenporno\"... irgendwas würde einem schon einfallen... also wenn man das als Frau machen würde und sich 90-60-90 nennt...","replies":[{"poster":"Veezey","date":"2018-01-20T09:33:04.194+0000","up_votes":3,"down_votes":3,"body":"Wenn man Leute schon für WaifuRapist reportet, dann versteht man ja gar keinen Spaß.","replies":[{"poster":"MeMyselfandBaal","date":"2018-01-20T10:12:21.021+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=Veezey,realm=EUW,application-id=KYnfKGf0,discussion-id=jtxEsgBW,comment-id=000d0000,timestamp=2018-01-20T09:33:04.194+0000)\n>\n> Wenn man Leute schon für WaifuRapist reportet, dann versteht man ja gar keinen Spaß.\n\nbei Vergewaltigern... nope. Das ist ziemlich genau die Stelle, bei der der Humor von mir aufhört und ich eingreife... Auch wenn es sich um die Vergealtigung von fiktiven Charakteren handelt...\nWas wir definitiv nicht brauchen, ist mehr \"Rape Culture\"... Also dass Solche Dinge in irgendeiner Form bagatellisiert oder gesellschaftlich akzeptiert werden. \n\nAn sonsten... reporte ich Namenstechnisch eigentlich nzr Dinge, die im Chat instant einen 14 Tages Bann auslösen würden, aber irgendwie durch den Filter gerutscht sind... an sonsten kann jeder machen, was er will...","replies":[{"poster":"Jinx1967","date":"2018-01-20T16:52:16.053+0000","up_votes":5,"down_votes":0,"body":"> Was wir definitiv nicht brauchen, ist mehr \"Rape Culture\"... Also dass Solche Dinge in irgendeiner Form bagatellisiert oder gesellschaftlich akzeptiert werden. \n\nKönnen wir diesen armseligen Begriff bitte bei den Amis lassen?","replies":[{"poster":"Veezey","date":"2018-01-20T20:00:04.033+0000","up_votes":6,"down_votes":0,"body":"Man sollte so einige Begriffe bei den Amis lassen^^","replies":[]}]},{"poster":"Veezey","date":"2018-01-20T10:33:45.179+0000","up_votes":3,"down_votes":2,"body":"Wenn ich mich Hawaitoast nenne, macht mich das ja auch nicht zu einem Hawaitoast. Ich finde man sollte nicht alles so eng sehen und es mit Humor nehmen.","replies":[{"poster":"MeMyselfandBaal","date":"2018-01-20T10:48:08.321+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Veezey,realm=EUW,application-id=KYnfKGf0,discussion-id=jtxEsgBW,comment-id=000d000000000000,timestamp=2018-01-20T10:33:45.179+0000)\n>\n> Wenn ich mich Hawaitoast nenne, macht mich das ja auch nicht zu einem Hawaitoast. Ich finde man sollte nicht alles so eng sehen und es mit Humor nehmen.\n\nDu gestehst aber damit öffentlich ein (oder erweckst zumindest den Eindruck), dass du Hawaitoast gut findest... jetzt wende das mal auf Rapist an...","replies":[]}]}]}]},{"poster":"eingew","date":"2018-01-20T15:54:15.549+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=KYnfKGf0,discussion-id=jtxEsgBW,comment-id=000d,timestamp=2018-01-20T02:23:42.219+0000)\n>\n> Was mich ja schon wieder triggert... sind die &quot;Mit deinem Namen hast du es doch proviziert&quot; Gelaber... Also wieder der Wortlaut meiner Schwester: Man muss sich doch als Frau sexy kleiden können, ohne dass einem gleich Männer an den Arsch grapschen... \n\nImmer diese *Männer*.\n\nDer Name ist nicht mit der \"sexy Kleidung\" vergleichbar, die bei 95% der Frauen gemeint ist, wenn sie von \"sexy Kleidung\" reden, die sie in der Öffentlichkeit und außerhalb von spezifischen Kontexten, für die diese spezifische Kleidung geschaffen ist, gemacht ist. \nAbgesehen davon sind die meisten Kommentatoren hier offensichtlich pragmatischer und nicht idealistischer Natur. Das führt natürlich dazu, dass man konkret andere Vorschläge gibt. Falsch sind diese dadurch aber nicht.\nKleider *machen* eben Leute, sonst wären Kleider nicht einmal sexy. Man sollte sich eben der Gefahren bewusst sein, denn durch puren Idealismus verschwinden die nicht. Entsprechend macht es zB Sinn in einen Club mit festen Regeln und entsprechenden Ansprechpartnern zu gehen. Oder den Mutebutton und den Reportbutton zu benutzen.\n\n> Vor allem... macht das mal als Mann... also als ich letztens mit nem WaifuRapist zusammen spielen durfte, war der total entsetzt, dass ich ihn darauf hin geschrieben habe, dass ich ihn dafür Reporte... weil ich Vergewaltigungsanspielungen in LoL (oder sonst irgendwo) halt nicht lustig finde... Der sollte diese Reaktion viel häufiger provozieren als unsere Prinzessin hier, war aber trotzdem völlig verwundert, dass ich das als unangebracht empfand... und hat mich als Feminist beschimpft... Glaubt mir, ich kenne Feministen, ich bin weit davon entfernt einer zu sein... aber ich nehme Probleme halt wahr und ignoriere sie nicht...\n\nDas war kein \"macht das mal als Mann\". Oder ist ein Vergewaltiger für dich das Äquivalent zu einer \"HentaiPrincess\"? Wäre das nicht eher \"HentaiPrince\"?\n\n> Oder... ihr nutzt eure Körpermaße inklusive Schwanzlänge als Summonername... also um nen Beispiel zu nehmen, auf das man häufiger trifft... glaubt ihr, dass da irgendjemand &quot;angemessen&quot; drauf reagiert? Also mit einem &quot;There&#x27;s no way your dick is that big!&quot; oder &quot;Nette Bewerbung für nen Schwulenporno&quot;... irgendwas würde einem schon einfallen... also wenn man das als Frau machen würde und sich 90-60-90 nennt...\n\nEben.","replies":[]}]},{"poster":"Alekra","date":"2018-01-19T20:31:15.408+0000","up_votes":7,"down_votes":1,"body":"Es hat eher mehr mit Flamen als mit ernst gemeinter Sexismus zu tun. Flamer versuchen alles gegen dich zu verwenden und wenn du ihnen so eine Information gibst lassen sie es dich spüren ;)","replies":[]},{"poster":"Abasin","date":"2018-01-22T11:45:36.736+0000","up_votes":6,"down_votes":1,"body":"> Wie ihr sehen könnt, an meinem Nutzernamen (H3ntaiPrincess) bin ich ein Mädchen, Girl, Woman (oder wie Leute uns mystische Kreaturen auch nennen: Egirls.)\n\nNein, können wir nicht. Ich bevorzuge auch weibliche Charakternamen. Was an Deinem Namen allerdings auffällt, ist dieser subtile Verweis auf ein sexuelles Subgenre japanischer Comic-Kultur. Dass so etwas natürlich provoziert, sollte auch Dir klar sein. Kurz gesagt, bei so einem Summonernamen muss man damit rechnen, dass man von der Seite angemacht wird. Da jetzt die Mimose raushängen zu lassen, finde ich schon recht unverfroren. {{sticker:sg-shisa}}","replies":[]},{"poster":"Nivoras","date":"2018-01-20T01:12:14.742+0000","up_votes":4,"down_votes":0,"body":"Ehrlich gesagt frage ich mich wie es kommt, dass dir solche Vorfälle so gehäuft passieren und mir in 3 Jahren LoL nicht ein einziges Mal?\n Selbst wenn es sich im Spiel aus Spaß ergibt dass ich sowas wie \"Boost for Nudes btw\" oder \"gimme skins ima cute egrill\" schreibe, dann gehen die meisten entweder trotzdem davon aus, dass ich männlich bin und trolle oder beachten es nicht weiter/machen den Spaß mit. \nInsofern scheint Sexismus kein allzu verbreitetes Problem zu sein wenn man sich angemessen verhält und Humor versteht ^-^ \n\nDu musst deinen Namen ja nicht änder aber get. fkin. over. it. Das ist das Internet, was erwartest du denn von den Leuten? Ich kann nicht glauben dass ausschließlich du mit den Leuten gematched wirst die \"ach so sexistisch\" sind, entweder du übertreibst halt oder du bist halt der Grund dafür.\n\nAaandererseits ist es halt auch, zumindest in meinen Augen, so, dass Namen die \"princess\", \"Lady\" oder \"Miss\" enthalten geradezu danach schreien, dass sie eine Beleidigung wollen. \nUnd ganz ehrlich, ich bin auch genervt wenn ich besagte Namen in meinem Team habe. Weil zu 80% dieselbe Art an Weibern dahinterhockt, auf welche ich nicht weiter eingehen will, aber sagen wir, sie sind die reale Verkörperung vieler Klischees die sie nur bestärken und nähren.\n\nWenn Leute dich verletzen wollen, dann werden sie immer etwas nehmen, dass dich von der breiten Masse unterscheidet, was in LoL eben durchaus das Geschlecht ist. Nur damit kann die Beleidigung eines x-beliebigen Fremden überhaupt einen Effekt erzeugen, wenn es auf irgendetwas persönliches anspielt. Als Beispiel, niemand würde in einer Firma einer Branche, die ca. gleichbesetzt ist, auf die Idee kommen mit Sexismus ernsthaft beleidigend zu werden abgesehen von typischem Machogehabe, weil es keinen Grund gibt das Geschlecht dort als Beleidigung einzusetzen. Andersrum, würde ein Junge... keine Ahnung, \"Abenteuer auf dem Reiterhof\" gerne spielen, dann müsste er sich dafür wahrscheinlich ganz schön was anhören.\n\nDas hat auch eigentlich nichts mit Sexismus der Person, die beleidigt, an sich zu tun, er verwendet lediglich Sexismus um den geünschten Effekt zu erzielen, ob dies nun seine eigene Meinung wiederspiegelt oder nciht. Viel zu Vieles auf dieser Welt ist Sexismus (NEIN, nicht der \"Gender Pay Gap\" der existiert nicht, ich meine *echten* Sexismus wie in vielen östlichen Ländern), aber die Beleidigungen eines völli Fremden im Internet gehört denke ich nicht dazu. \nUnd wer diese Angriffsfläche bereitwillig bietet, obwohl er beim Thema Sexismus/Beleidungen allgemein so empfindlich ist, ist selber Schuld, anders kann man das nicht sagen. \n\n->Pro Tipp: Falls du auf (persönlich werdene) Beleidigungen empfindlich reagierst, dann so wenig im Internet über sich Preis geben wie nur möglich, dann hast du das Problem nicht.\n\n> **EDIT**: Noch was, ich will Sexismus nicht beschönigen aber in Zeiten von Feministen die in unseren Gefilden  schon lange nicht mehr für Gleichberechtigung kämpfen und wo wirklich alles ofeensive ist, muss man auch mal runterkommen und nicht alles so super ernst nehmen was man hört. \n> Zudem: Du kannst nicht die ganze Welt zu einem anderen Verhalten zwingen, es wird immer Leute geben die dich beleidigen, das kann man nicht ändern. Anpassung ist hier das Stichwort.\n> \n\nWall of Text die du wahrscheinlich nicht lesen wirst, aber w/e at least I tried","replies":[]},{"poster":"7deadLeeSlnz","date":"2018-01-19T23:22:53.591+0000","up_votes":4,"down_votes":0,"body":"Vorab, ich spar mir Kommentare über deinen Namen. Jeder kann (mehr oder weniger nachvollziehbare) Gründe haben für seinen Namen, muss dann aber auch mit den Konsequenzen leben.\n\nDie einfachste Lösung gg. frauenfeindliche Kommentare ist, dich nicht als Frau erkennen zu geben. Das heißt in Erwägung ziehen deinen Namen zu ändern oder nicht in Chat zu schreiben, dass du weiblich bist ( warum auch immer man das tut). \nFlamer finden immer einen Weg andere Spieler in irgendeiner Weise zu belästigen, dass du weiblich bist spielt da eher eine Nebenrolle.","replies":[]},{"poster":"Eibert Rümmel","date":"2018-01-22T10:45:40.844+0000","up_votes":3,"down_votes":0,"body":"Sind Hentai nicht diese gezeichneten Pornos?","replies":[{"poster":"5weeds","date":"2018-02-06T14:11:46.370+0000","up_votes":2,"down_votes":1,"body":"Ach Eibert.\nHentai ist doch so viel mehr!\nHentai ist nicht stupide Pornographie. Es ist eine Liebeserklärung. Eine Liebeserklärung an die weibliche Anatomie.\nKaum ein Gedicht vermag das Ausmaß unserer reinen liebe gegenüber dem Erscheinungsbild einer Frau zu erfassen, wie ein geschmackvoller SEINEN KOMIKKU, oder das Artwork erst-klassischer Hentai Künstler.\n\nDas es zumeist als Fap-vorlage benutz wird, tja...","replies":[{"poster":"Veezey","date":"2018-02-06T20:53:57.561+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]}]}]},{"poster":"Angel Ayume","date":"2018-01-19T22:48:59.955+0000","up_votes":3,"down_votes":0,"body":"Wurde in meinen 3 Jahren LoL erst zwei Mal wegen meines Geschlechts angegriffen und bei meinem Namen kann man schon auf die Idee kommen, dass ich weiblich bin. Das eine Mal war es von 3 Premades ingame gewesen und das andere Mal war es damals in einem öffentlichen Chat im alten LoL-Client. \nNatürlich ist es nie schön, wenn es Spieler gibt die glauben, dass Frauen schlechtere Gamer sind oder sich nur boosten lassen oder in die Küche und nicht an den PC gehören. \nIngame würde ich diese Person einfach muten, mir wegen sein primitives Denken ins Fäustchen lachen und ihn am Ende des Games reporten. ^^ \nAußerhalb des Games würde ich da wahrsch. schon eher diskutieren, bin einfach ein diskussionsfreudiger Mensch :D Aber wenn ich merke, dass ne Diskussion nichts bringt, ignoriere ich ihn und beende das Gespräch und lache mir dennoch ins Fäustchen. \n\nWas du dir vor Augen führen musst: Flamer WOLLEN dich beleidigen, ihnen ist jedes Mittel recht. Und da sie wissen, dass Frauen gerne sehr empfindlich darauf reagieren, wenn man sie wegen ihres Geschlechts angreift, dann werden sie das tun, da es in ihren Augen die beste Form ist eine Spielerin anzugreifen. \nUnd wenn sie vermuten, dass du weiblich bist, dann nutzen sie diese \"Schwäche\" aus und beleidigen dich wegen deines Geschlechts.","replies":[]},{"poster":"Nycaria","date":"2018-01-19T22:31:34.837+0000","up_votes":3,"down_votes":0,"body":"Man kann sich auch anstellen...\n\nGanz ehrlich diesen Flame spezifisch gegen Frauen hab ich noch nie erlebt. Ab und zu mal ein dummer Kommentar von jemandem oder Adds nach einem Game schon, allerdings wurde ich noch nie wegen meines Geschlechts geflamet.","replies":[]}]}