{"poster":"EwSd5ojIpk","date":"2016-11-03T17:31:42.079+0000","title":"Just want to know what exactly triggered a perma ban here....","subforum":"Player Behavior","up_votes":2,"down_votes":18,"body":"I just received a permaban, I would love you to explain how is this permaban worthy. \nI know the permaban was issued by a bot.\nP.S. I just got my account back from a 2-week ban 2 days ago. Then I deserved it, but this...\n\nGame 1 \nHakaishin: ty for gank real nice.. \nHakaishin: ty really.. \nHakaishin: ff 20 \nHakaishin: wanna open? \nHakaishin: no? \nHakaishin: so better waste time? \nHakaishin: you do nt have a life/ \nHakaishin: yes it is \nHakaishin: open \nHakaishin: bye \nHakaishin: throw? \nHakaishin: AHHAHAHAHHAA \nHakaishin: how can we throw \nHakaishin: i wont stop \nHakaishin: PLS JUST OPEN \nHakaishin: dont waste fking time \nHakaishin: on a lost game \nHakaishin: everyone feeds \nHakaishin: hahahaha sure \nHakaishin: better chat \nHakaishin: rofl \nHakaishin: totally not lost \nHakaishin: wp \nHakaishin: why not? \nHakaishin: your buddy ww fucked me over with his godlike gank \nHakaishin: ? \nHakaishin: why are you 0 5 2? \nHakaishin: first time? \nHakaishin: why dont you focus on yourself \nHakaishin: you got smashed bot \nHakaishin: 2v2 \nHakaishin: no ganks \nHakaishin: AHHAHA \nHakaishin: sure AHHAHAHA \nHakaishin: every lane lost \nHakaishin: if you thinks so \nHakaishin: then you dont deserve better \nHakaishin: and that is why you died 5 times? \nHakaishin: right \nHakaishin: hehe xD \nHakaishin: instead of chat \nHakaishin: better help your ap \nHakaishin: once again wp ww \nHakaishin: that will help him being less bad \nHakaishin: xD \nHakaishin: gj team! \nHakaishin: we can definitely win! \nHakaishin: lmao \nHakaishin: vote no we can win! \nHakaishin: lul \nHakaishin: how? \nHakaishin: i am positive \nHakaishin: xD \nHakaishin: i even vote no on surr \nHakaishin: gj team! \nHakaishin: good job! \nHakaishin: wp \nHakaishin: ik we can win because i am positive! \nHakaishin: xD \nHakaishin: ult you lul? ahri you are fking useless \nHakaishin: oh its ashe \nHakaishin: good job ashe! \nHakaishin: ashe god! \nHakaishin: i ult who i need \nHakaishin: ww pentakiru \nHakaishin: i trust \nHakaishin: just stall but we need turrets \nHakaishin: keep baron warded \nHakaishin: care they might go baron \nHakaishin: i shoujld \nHakaishin: bot \nHakaishin: you all ded \nHakaishin: cloud \nHakaishin: dont lose the game for it now \nHakaishin: lolk they desperate \nHakaishin: AHHAHA \nHakaishin: ye sure i take \nHakaishin: whatever you say \nHakaishin: i sell my items now \nHakaishin: and go thornmail \nHakaishin: banshee \nHakaishin: d baron calls \nHakaishin: i go banshee and some armor item \nHakaishin: i can splitpush bot \nHakaishin: nice \nHakaishin: well \nHakaishin: my fault \nHakaishin: i clear \nHakaishin: ?? \nHakaishin: all def ashe only shot \nHakaishin: back off \nHakaishin: nash i guess \nHakaishin: engage \nHakaishin: we need \nHakaishin: WHY \nHakaishin: let elder \nHakaishin: LET \nHakaishin: def 2 min \nHakaishin: ok regroup i got zhon \nHakaishin: elder almost gone \nHakaishin: 40 sec \nHakaishin: leggo \nHakaishin: end \nHakaishin: GG\n\nGame 2 \nHakaishin: i can let him push \nHakaishin: mid is free now \nHakaishin: FFS \nHakaishin: LOL CHILL? \nHakaishin: how much more pings do you need? \nHakaishin: you didnt even see what ppened? \nHakaishin: mid no summs \nHakaishin: and pushing \nHakaishin: and you let im free farm \nHakaishin: ff \nHakaishin: just ff dont waste time PLS \nHakaishin: no summs mid \nHakaishin: pushing \nHakaishin: you dont gank \nHakaishin: free farm \nHakaishin: gg \nHakaishin: you should do smth \nHakaishin: you are the jungler \nHakaishin: hAHAHHAA \nHakaishin: only thing you can do \nHakaishin: Kappa 2 5 2 \nHakaishin: just like he did \nHakaishin: when i needed help \nHakaishin: ... \nHakaishin: ... \nHakaishin: ... \nHakaishin: .. \nHakaishin: you cant ank \nHakaishin: all you gcan write \nHakaishin: .. \nHakaishin: .. \nHakaishin: ... \nHakaishin: ... \nHakaishin: ... \nHakaishin: ... \nHakaishin: .. \nHakaishin: ... \nHakaishin: ... \nHakaishin: ... \nHakaishin: wp \nHakaishin: ... \nHakaishin: my fault you go in like that \nHakaishin: xD \nHakaishin: leona is the best \nHakaishin: challenger \nHakaishin: why is there a jungler farming mid rn? \nHakaishin: i ulted viktor so we dont get insta fuc.ked \nHakaishin: and you split \nHakaishin: genius \nHakaishin: no no let elise talk \nHakaishin: she knows best \nHakaishin: blame everybody \nHakaishin: does 0 ganks \nHakaishin: just report the toxic shi.t \nHakaishin: dat cait \nHakaishin: well you and malph chased \nHakaishin: op block \nHakaishin: wp \nHakaishin: .. \nHakaishin: ... \nHakaishin: ... \nHakaishin: ... \nHakaishin: ... \nHakaishin: right lise? \nHakaishin: nono elise knows everything \nHakaishin: dat cait \nHakaishin: suicide every fking time \nHakaishin: YOU RAN INTO HIM \nHakaishin: she suicided LUL \nHakaishin: the almighty annoying botlane duo continues \nHakaishin: in the next episode of DBZ \nHakaishin: if cait positioned well that fight was an ace for us \nHakaishin: WP \nHakaishin: she told well again \nHakaishin: she did well \nHakaishin: cait again \nHakaishin: wp cait \nHakaishin: she done well again \nHakaishin: every fight?","replies":[{"poster":"Zach Sandwhich","date":"2016-11-03T17:33:56.005+0000","up_votes":6,"down_votes":2,"body":"Both games it looks like you get three minutes in then want to ff. Your constantly being passive aggressive to your teammates. \n\nPermanent Deserved. Now I wait for Riot Tantram to post.","replies":[{"poster":"EwSd5ojIpk","date":"2016-11-03T17:35:48.400+0000","up_votes":1,"down_votes":8,"body":"So what exact message triggered the bot to permaban me? Writing FF? Or sarcasticly saying wp to my teammates?","replies":[{"poster":"venomous frost","date":"2016-11-03T17:39:43.699+0000","up_votes":7,"down_votes":2,"body":"constant negative behaviour over the course of weeks/months. This in itself will not get you a permaban, this added up with all your other recent punishments due to negative behaviour will get you banned.\n\nalso, saying people have no life is a personal insult, and in way way contributes anything to the game. And i didn't even read further than that line.","replies":[{"poster":"EwSd5ojIpk","date":"2016-11-03T17:45:59.567+0000","up_votes":1,"down_votes":8,"body":"so the bot seen  have and no life in the same message and triggered itself? ahaahahha","replies":[{"poster":"venomous frost","date":"2016-11-03T17:48:14.043+0000","up_votes":5,"down_votes":0,"body":"no, the bot triggered because of your negative behavior, and saw you already had a 2 week ban, so the next punishment is permaban.","replies":[{"poster":"EwSd5ojIpk","date":"2016-11-03T17:53:46.962+0000","up_votes":1,"down_votes":11,"body":"its a bot that triggers on certain phrases. there were no phrases like this here","replies":[{"poster":"Riot Tantram","date":"2016-11-03T18:43:12.081+0000","up_votes":18,"down_votes":0,"body":"The IFS uses machine learning. It does not simply look for the presence of words or phrases. It is able to evaluate your history and determined that you are someone who, despite multiple warnings, continues to ruin the games of others. The entire contents of your chat is negative. You are constantly threatening to give up, blaming others, and trash talking.\n\nThis type of behavior is not acceptable.\n\nThe fact that you were fresh off a penalty without attempting to improve was taking into account for your punishment level.","replies":[]},{"poster":"DrCyanide","date":"2016-11-03T18:24:42.381+0000","up_votes":7,"down_votes":0,"body":"You do realize you've contradicted yourself, right?\n\nIf bans are by a bot that triggers on certain phrases, and those phrases aren't here, then you're not banned. \n\nBut you are banned, which means either the phrases are present, or the bot uses something beyond phrases to establish punishment, or you weren't banned by a bot but rather by a human.","replies":[]}]}]}]}]},{"poster":"Arthastheiceking","date":"2016-11-03T17:42:32.709+0000","up_votes":2,"down_votes":4,"body":"***","replies":[{"poster":"EwSd5ojIpk","date":"2016-11-03T17:43:07.729+0000","up_votes":1,"down_votes":4,"body":"that was my bet also","replies":[]}]}]},{"poster":"Great Muta","date":"2016-11-04T02:07:38.724+0000","up_votes":1,"down_votes":1,"body":"I think someone's getting a passive-aggressive woody here. I'm seeing toxicity and it looks to be coming from you.","replies":[]}]},{"poster":"Deep Terror Nami","date":"2016-11-03T17:39:20.672+0000","up_votes":9,"down_votes":1,"body":"Like Unholy said, consistently negative and passive-aggressive behavior towards your teammates, spamming (...), threatening with reports. Just overall unsportsmanlike conduct.\n\nIf you're wondering why this was a permaban instead of a chat restriction or 14 day ban, it's because punishment is done by escalating through 4 tiers;\n\n* 10 game chat restriction\n* 25 game chat restriction\n* 14 day account ban\n* Permanent account ban\n\nYou move up a step each time you're punished, making the incentive to improve your behavior stronger each time. Extremely toxic behavior can result in skipping steps, but typically you just move up one step at a time. If you have received a 14 day ban already, then a permaban was naturally the next step if you continue to show such behavior.","replies":[{"poster":"EwSd5ojIpk","date":"2016-11-03T17:41:35.380+0000","up_votes":1,"down_votes":9,"body":"These games here should have been flagged as false reports because I said nothing that should trigger the punishment","replies":[{"poster":"Deep Terror Nami","date":"2016-11-03T17:48:11.629+0000","up_votes":8,"down_votes":0,"body":"Do you still not see what about your behavior is unsportsmanlike?","replies":[]},{"poster":"AeroWaffle","date":"2016-11-03T18:06:14.201+0000","up_votes":7,"down_votes":0,"body":"It doesn't take a genius to see the chat was practically oozing with negative sarcastic overtones. And that's the manual review.\n\nA bot would have likely seen;\n\nHakaishin: ff 20\nHakaishin: wanna open?\nHakaishin: no?\nHakaishin: so better waste time?\nHakaishin: you do nt have a life/\nHakaishin: yes it is\nHakaishin: open\nHakaishin: bye\nHakaishin: throw?\n\nand the\n\nHakaishin: ...\n\nspam.\n\nYou were off your ban only two days ago, by your own admission. **_Two days_**. And already you were behaving poorly. The only thing that seemed to change between now and then was you attempted to hide your poor behavior with sarcasm. You didn't actually stop behaving poorly.","replies":[]},{"poster":"AzureDragoon","date":"2016-11-03T18:20:17.939+0000","up_votes":5,"down_votes":0,"body":"Nothing \"false\" about them. Game 1, one of the first things you typed is \"ff 20\",  you constantly belittle and insult your team mates, and in both games, make mentioning of what sounds like you intentionally surrendering your lane. \n\nI'm also sure the game where you intentionally fed 0/26/2 on Nunu didn't help your case: http://matchhistory.euw.leagueoflegends.com/en/#match-details/EUW1/2890401287/228325465?tab=overview\n\nThere's \"having a bad game\" and then there's \"obvious trolling by only buying Mobi-boots and running down mid for every single one of your deaths\"","replies":[]}]}]},{"poster":"YOU LOST LMAO","date":"2016-11-03T18:07:58.990+0000","up_votes":1,"down_votes":13,"body":"This shouldn't be perma ban worthy at all, it was just mild toxicity but we all know for a FACT that you hear this level of toxicity everygame.\nhowever yours was mild, shouldn't be perma ban.\nI suggest you not post this on here because this side of the forums consists of little 14 year old kids who cant take bad Mannering without crying,fact.\nRiot will look down on you for the dumbest bad manners, such as \"ur dumb\"  boom perma ban.\n\nYour type of toxicity is the one I have to deal with, I get to that level of toxicity quite often because it is hard to keep a cool when your team is as troll as a teemo/ivern/lulu troll pick.\n\nI'm currently doing a 2 week ban because I said \"report janna for calling me the N word\" ( I spelled out the N word completely ingame )\n\nand the little 14 year olds kids on the forums logic is like    oh 'pls report' is way more toxic than 'N word' , ur ban is well deserved, heres a downvote...\n\nkids these days are getting out of hand.\n\n.\n.\n.\n\nAll of the above are FACT.","replies":[{"poster":"AeroWaffle","date":"2016-11-03T18:12:20.429+0000","up_votes":7,"down_votes":0,"body":"Are you talking about this ban;\nhttp://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/uzpQ5BgL-perma-banned\n\nBecause a Rioter slam dunked you.\n\n> [{quoted}](name=Riot Tantram,realm=NA,application-id=ZGEFLEUQ,discussion-id=uzpQ5BgL,comment-id=0003,timestamp=2016-11-02T21:00:15.339+0000)\n>\n> 4 games were given as evidence. Game 3 didn&#x27;t &#x27;trigger&#x27; your penalty.\n> \n> Janna also never said %%%%%%. In fact you are the only person in that game that used that word. You were just trying to get Janna reported.\n\nYou're hardly a trustworthy source of anything other than bullshit.","replies":[{"poster":"YOU LOST LMAO","date":"2016-11-03T18:15:31.478+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=AeroWaffle,realm=NA,application-id=ZGEFLEUQ,discussion-id=thyXbjo1,comment-id=00020000,timestamp=2016-11-03T18:12:20.429+0000)\n>\n> Are you talking about this ban;\n> http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/uzpQ5BgL-perma-banned\n> \n> Because a Rioter slam dunked you.\n> \n> You&#x27;re hardly a trustworthy source of anything other than bullshit.\n\nAm I talking about that ban, you tell me. What ban does it look like I'm talking about?\n\nMy goal is not to make myself a trustworthy source to you personally.","replies":[{"poster":"AeroWaffle","date":"2016-11-03T18:20:50.922+0000","up_votes":7,"down_votes":1,"body":"In game, you lied about Janna saying the N-word, to get her reported.\n\nYou lied about it on the forum, to get sympathy.\n\nWhy would _**anyone**_, not only me, trust anything you say? You're the perfect example of a troll that people don't want in their game.","replies":[{"poster":"YOU LOST LMAO","date":"2016-11-03T18:28:29.762+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=AeroWaffle,realm=NA,application-id=ZGEFLEUQ,discussion-id=thyXbjo1,comment-id=0002000000000000,timestamp=2016-11-03T18:20:50.922+0000)\n>\n> In game, you lied about Janna saying the N-word, to get her reported.\n> \n> You lied about it on the forum, to get sympathy.\n> \n> Why would _**anyone**_, not only me, trust anything you say? You&#x27;re the perfect example of a troll that people don&#x27;t want in their game.\n\nI honestly don't care if people don't trust me, my goal isn't for people to trust me.\nI honestly don't care.\nyou are just being hypocritical \n.\n.\n.\nlook at you, you're unranked because you spend all time bashing people in forums and not having fun because you make yourself have to deal with trolls over the internet. \nand we all know that absolutely no one wants you in their games for being unranked, that is FACT.\nwe both know you have read those posts \"why am I getting matched with unranked players\".\nyou hear that? yeah they are talking about you. Who? YOU.","replies":[{"poster":"AeroWaffle","date":"2016-11-03T18:33:04.021+0000","up_votes":5,"down_votes":0,"body":"You seem to be using \"FACT\" for a lot of things that are OPINION.\n\nHow am I being hypocritical? I'm discussing behavior. You're questioning my skill. Those are not the same thing.","replies":[]},{"poster":"TheSequelsRBad","date":"2016-11-03T19:29:41.911+0000","up_votes":3,"down_votes":0,"body":"It is not a fact, because from what I have seen I would rather get queued with AeroWaffle than with you. Just saying.","replies":[{"poster":"midnight oil24","date":"2016-11-04T14:30:47.937+0000","up_votes":1,"down_votes":0,"body":"Exactly. I'd rather get paired with a someone who isn't ranked but isn't toxic then someone like that guy.","replies":[{"poster":"NevermoreOfRaven","date":"2016-11-05T14:28:03.219+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=midnight oil24,realm=NA,application-id=ZGEFLEUQ,discussion-id=thyXbjo1,comment-id=0002000000000000000000010000,timestamp=2016-11-04T14:30:47.937+0000)\n>\n> Exactly. I&#x27;d rather get paired with a someone who isn&#x27;t ranked but isn&#x27;t toxic then someone like that guy.\n\nYa but can't you mute that guy that is flaming? I really don't understand why people say someone being toxic in game is a super big problem like you can mute whoever is flaming. You don't like what they are saying then don't listen. I must have a thick skin because to me some of these complaints seem trivial like he made me feel bad in game and it ruined my game. Well did you play competitive and to your best extent? Then you know that and no one can tell you what you did since you did your best. Then ignore him but don't make the mistake i did and tell the where they can place that comment (its not in a polite place i can assure you) There are always people that will ruin your game (also applies to the real world) and its up to you how much of an impact they can have. ( do mind me that trolling in game-play is different beast entirely and is much worse in my opinion since it actually clearly affects the outcome of the game and you have no choice on ignoring it (similar to physical violence in the real world). \n\n\n\n\nThe solution to your ban problem: \nI for one learned my lesson of firing back since riot is polices chat so much that even misinterpreted statements can get you banned. \nI think I'm gonna do what my friend does that also got a 2-week ban for having a backbone did and just say okay welp using discord you don't like it too bad I'm muting all of you at the start of the game.  If riot wants to police chat so much i'm gonna do my best to isolate myself from it. I would also suggest those that object to these kind of broad reaching bans to do the same. Gonna start saying \"no text chat only discord\" on every lobby and let the rest of them that don't fall through the cracks and just say they can talk through pings. If you don't want to receive a ban tell them to join a non policed chat and that they can either use the discord or hit the bricks and you are muting them at start. I even prepared a copy paste statement if you want to do this. \n\n\n\"Hello, i object to riots policies on chat so i will not be using their chat service and muting all of you at the start of the game so please join my discord and no install is required just copy and paste the link\"\n\nThen paste your discord link before or after this statement or both. There no ban for being flamed and firing back, simple web link for those interested in communicating and you just up'ed your chances of winning by about 30% since you can communicate faster than if you aren't using a voice chat program. And the best part is you don't have to beheld to anything since there is no record and you can feel free to do as your please since they willingly consented to an outside non-policed chat. \n\n\nDisclaimer:\nDon't like what i said then feel wrote to not reply with criticism as i will ignore comments as i will soon be ignoring everything you say in text chat to me in game while the rest of us are talking and communicating i a much better fashion i might also add (possibly cursing at each other in discord and possibly having fun with the game despite that).\n\n\nPS and if such activities start to be ban worthy then ill just laugh hysterically as i walk out the door facing the other moba games.  ","replies":[]}]}]}]}]}]}]}]},{"poster":"midnight oil24","date":"2016-11-04T14:27:36.730+0000","up_votes":1,"down_votes":0,"body":"So let me get something straight: When your jungle was having a hard time, you told them to focus on farming to gain levels. Then, when they were doing that, you got mad at them for not ganking? Why are people always like this? The Jungle has other lanes to focus on, and if it becomes clear that you have lost the lane, the jungle will just help out the other lanes.","replies":[]}]}