{"poster":"Lunari Red Mask","date":"2018-05-02T10:17:12.877+0000","title":"¿Cómo desbloquear honor cuando se es tóxico ?","subforum":"Off-topic y temas personales","up_votes":2,"down_votes":3,"body":"Pues eso, tengo un tiempo libre para postear esta cosa, la verdad nose como exponerlo. Me da bastante igual los negativos. Uno es t&oacute;xico porque es  la costumbre, pero no de un modo que no permita jugar. De repente te tocan esos team donde o te spamean pings que los tenes que mutear o donde se ofenden por cualquier causa &quot;x&quot; y no te ayudan durante un juego. No es la primera ni la ultima vez que me pasar&aacute; y s&eacute; que a muchos de ustedes les pasar&aacute; igual. \r\nEl punto es que mi t&oacute;xicidad va del lado defensivo de la cuesti&oacute;n, no es un t&oacute;xiqueo adrede en contra de la gente ,sino un &quot;vamos, muevanse&quot;.\r\nEs una comunicaci&oacute;n de fuerza mayor que uno sin medirse hace para intentar ganar una partida que sabes ya esta perdida. Y lo que me ha pasado que es el motivo del post es lo siguiente:\r\nDe tener deshonor por toda una temporada, quiz&aacute;s 3 meses. Van y me quitan el deshonor y me dan nivel 1. Hoy mismo. Y juego dos partidas y me ponen en deshonor y con bloqueo de chat por t&oacute;xicidad. Dos partidas que perd&iacute;.\r\nCosa que llevo como 20 cajas de hextech, 0 llaves por el honor, sin ganas de poner un peso por este juego lleno de t&oacute;xicos como yo XD. \r\nTal vez nunca llegue a abrir ninguna caja...\r\nOpiniones?\r\nYo leo todo, hecho negativos al que se pase de vivo y con tal es un foro, se esta para charlar.","replies":[{"poster":"DIOS TUTI","date":"2018-05-02T10:25:42.243+0000","up_votes":3,"down_votes":0,"body":"dejando de toxiquear.","replies":[]},{"poster":"Lunari Red Mask","date":"2018-05-03T03:21:24.854+0000","up_votes":1,"down_votes":0,"body":"Bueno, gracias por los consejos. Supongo que ya ingeniaré una forma de ganar honor nuevamente. Y más tarde sí me funciona, me pondré a actualizar el post. \nO hacer uno nuevo. \nSaludos.","replies":[]},{"poster":"Nabuze","date":"2018-05-02T14:30:22.339+0000","up_votes":1,"down_votes":0,"body":"El sistema de honor se inventó como premio y motivación para que te portes bien pero tú no quieres portarte bien así que te lo quitan y además si sigues incumpliendo las reglas tendrás que ponerte de nick 6tacuenta","replies":[{"poster":"Lunari Red Mask","date":"2018-05-03T03:20:09.504+0000","up_votes":1,"down_votes":0,"body":"Excepto que son 7. Uso más mi 5ta.","replies":[]}]},{"poster":"Mazer Rakham","date":"2018-05-02T16:49:20.022+0000","up_votes":1,"down_votes":0,"body":"Cuando se te vaya la sanción, mandá un ticket pidiendo que te den un \"ban de chat voluntario\". Te lo van a dar por una cantidad de partidas y no te afecta el honor.\nFuente: https://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/KTasodV3-para-flamers-existe-el-baneo-de-chat-voluntario","replies":[]},{"poster":"rokushoger","date":"2018-05-02T13:17:50.914+0000","up_votes":1,"down_votes":0,"body":"Creo que es un poco como dice la misma palabra, no puedes tener honor si te comportas de forma tóxica. Para volver a tener honor tenés que primero terminar tu sanción, luego de eso no ser tóxico en las partidas y luego de un tiempo que te mantengas en buen comportamiento te empezará a subir de honor.\n\nSaludos!","replies":[]},{"poster":"Defg45333","date":"2018-05-02T10:38:12.495+0000","up_votes":1,"down_votes":0,"body":"Estás buscando una respuesta que ya sabés xD\nDijiste que después de 3 meses te quitaron el deshonor, y que en 2 partidas te le dieron de vuelta.\nSabés perfectamente lo que tenés que hacer, dejá de toxiquear en el chat...\n\nBtw el sistema se vuelve más sensible al flameo si ya fuiste sancionado antes (o eso tengo entendido basado en lo que leído en este foro durante mucho tiempo), si no te controlas, no solo no vas a abrir una caja en tu vida, si no que te van a dar permaban.","replies":[]}]}