{"poster":"Lunari Red Mask","date":"2015-12-18T01:00:21.386+0000","title":"L칩gica de los reportes.","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Resulta que a diario la gente escribe un cry post de mala forma e insultando a todo el mundo porque se indigna de la clase de jugadores que le tocan en el juego. Se espera un m&iacute;nimo de 40 minutos para hacer valer nuestra opini&oacute;n al reportar. Y al menos en mi caso nunca he logrado nada. Sin embargo y atentos ac&aacute; :\r\nRespondes un tema de foro de buena forma  y cualquiera puede ir  a marcarlo como ofensivo. Segundos despu&eacute;s te encuentras con que tu contenido ha sido eliminado  y siquiera se han tomado la molestia de leer el tema. \r\nGG, riot. Dat logic!.","replies":[{"poster":"Red Blood","date":"2015-12-18T03:53:57.962+0000","up_votes":1,"down_votes":0,"body":"Me paso, pero bueno riot te puede banear por lo que acabas de escribir si quiere. Muchos pasan horas jugando sin saber que si a riot se le canta la gana de banearte lo hace y no podes decir nada porque en realidad no es tu cuenta. Es de ellos... GG","replies":[]},{"poster":"Roussil","date":"2015-12-18T01:07:06.063+0000","up_votes":1,"down_votes":0,"body":"a mi me permabanearon por poner \"rp gratis\" en el titulo y unas 3 o 4 palabras en mayuscula...cuando en el post aclare que era una broma (y ni siquiera lo puse en discusion general, estaba en offtopic) acto seguido me encuentro con unos post con contenido ofensivo e insultos y tardan como 10 minutos en borrarlos..a mi ni siquiera me mandaron advertencia q.q","replies":[{"poster":"Lunari Red Mask","date":"2015-12-18T01:10:13.482+0000","up_votes":1,"down_votes":0,"body":"Exactamente, eso es a lo que apunto con el tema, la verdad es que no tienen respeto.","replies":[{"poster":"Roussil","date":"2015-12-18T01:12:48.906+0000","up_votes":1,"down_votes":0,"body":"y ahora hay un post de uno que pone el link del rp trucho y ni siquiera lo borran (obviamente lo adjunte al ticket del soporte), no es nada en contra del chabon, pero me da bronca que me den permaban a mi por algo MUCHO menor xD","replies":[{"poster":"Gig GOD OF DEATH","date":"2015-12-18T01:28:52.474+0000","up_votes":1,"down_votes":0,"body":"Hay cosas que se aprenden por las malas, ya le tocara,  cuando te toque algo peor que el permaban como a mi, por lo menos no tendr치s que pasarle la cuenta a tu nieto como me paso  ...\nhttp://imgur.com/IxrDuOW","replies":[]},{"poster":"edu855","date":"2015-12-18T01:15:31.760+0000","up_votes":1,"down_votes":0,"body":"asi como reclaman en el foro deverian banear a los que flamean en el juego :c y a los ni침os chicos que joden ranked T-T","replies":[{"poster":"Roussil","date":"2015-12-18T01:16:53.461+0000","up_votes":1,"down_votes":0,"body":"igual in game es mas complicado :p hay mas cosas a considerar, pero por lo menos el foro tendria que estar mejor administrado","replies":[{"poster":"beornottochi","date":"2015-12-18T01:24:44.452+0000","up_votes":1,"down_votes":0,"body":"HOLA ME LLAMO NAHUEL, -espera al Hola nahueeeel -\nme cuesta admitirlo pero... SOY UN BANNEADO!, hasta ma침ana a las casi 24 horas! \nla razon? escribir 1 post que decia que queria hablar con un chileno en el foro OFF TOPIC, ya que no aportaba nada a la comunidad.\nufff esto de banneados anonimos es duro!\n-se sienta-{{sticker:zombie-brand-clap}}\n(mientras escribia esto con otra cuenta me banearon la cuenta por 2 semanas por postear con otra cuenta)","replies":[]}]}]}]}]}]}]}