{"poster":"CalyN","date":"2016-06-21T11:37:37.452+0000","title":"Abbiamo bisogno di un coach disposto a seguirci","subforum":"Reclutamento","embed":{"description":"Salve ci chiamiamo Team Kasai siamo un gruppo di amici che hanno deciso di sfruttare la passione per un videogioco (league of legends) per creare una community improntata in uno spirito competitivo...","url":"http://teamkasai.weebly.com","image":"http://i3.ytimg.com/vi/itz7va-JtWg/hqdefault.jpg"},"up_votes":2,"down_votes":5,"body":"Salve sono l&#039;Amministratore della community Team Kasai e stiamo reclutando personale, Abbiamo bisogno di:\r\nCoach disposto a seguirci (nessun limite di elo) con ampia conoscenza del gioco.\r\nPlayers di qualsiasi elo disposti a mettersi in gioco e a divertirsi.\r\n\r\nPagina Faceboock\r\nhttps://www.facebook.com/firelyon295/","replies":[{"poster":"matteo00gm","date":"2016-06-25T14:24:26.048+0000","up_votes":1,"down_votes":0,"body":"main supp gold 3 sono interessato, ho mainato blitz per scalare fino a gold 3 ma ora ho capito di aver bisogno di maggiore influenza in team fight perciò sto imparando bene braum janna thresh alistar e karma. Aggiungetemi su lol se posso esservi utile (matteo00gm) ho ts skype e curse","replies":[]},{"poster":"goccioletribù","date":"2016-06-21T19:58:59.820+0000","up_votes":1,"down_votes":0,"body":"se state cercando anche dei giocatori io sarei interessato, per qualsiasi cosa aggiungetemi su lol: Moonlight930","replies":[{"poster":"CalyN","date":"2016-06-22T11:39:14.822+0000","up_votes":1,"down_votes":0,"body":"dimmi il ruolo","replies":[]}]},{"poster":"Jahesh Ønfroy","date":"2016-06-26T13:24:52.915+0000","up_votes":0,"down_votes":0,"body":"Mi propongo come coach, credo di avere una conoscenza abbastanza ampia del gioco, anche se sono meccanicamente scarso :P \nSono attualmente silver 1, a mia difesa volevo dire che i coach dei team più importanti sono anche gold etc.\nPosso utilizzare skype e discord. (Li utilizzo sul telefono per problemi alla scheda audio)\nSono anche disposto a cambiare nome non è un problema addatemi se volete parlarne","replies":[]}]}