{"poster":"FNC Hiryu","date":"2019-01-24T23:44:11.328+0000","title":"Se me desconecta el juego al minuto 6 en todas las partidas ¿HACK?","subforum":"Problemas Técnicos","up_votes":2,"down_votes":1,"body":"Todas las partidas que jugue hoy tanto rankeds como normales al minuto 6 se me desconecta el juego y aparece el mensaje de reconectando. \r\nDudo que sea mi conexión porque el inicio y el resto de la partida me anda perfecto sin ninguna desconexion, solo entre los minuto 6 y 9 donde se conecta y se desconecta cada rato. \r\nEs posible que sea algún tipo de hack?","replies":[{"poster":"xxxRONINxxx","date":"2019-04-15T06:16:41.536+0000","up_votes":1,"down_votes":0,"body":"aun no hay solución a ese problema? siempre me pasa al rededor del minuto 6 y cerca del minuto 9... aveces se me frezea la pantalla y debo reiniciar (por lo menos solo me toma 15 seg) pero así no me animo a rankear.... si hay alguna solución o tienen idea de que puede ayudar avisen..{{champion:222}} ","replies":[{"poster":"FNC Hiryu","date":"2019-04-17T20:10:17.259+0000","up_votes":1,"down_votes":0,"body":"Yo mande un ticket al soporte y no me solucionaron nada. Simplemente espere un mes creo y se solucionó solo supongo que por los parches. Igual yo probaría reinstalandolo aver si te funciona. Suerte bro","replies":[]}]},{"poster":"M4NU31","date":"2019-04-03T12:42:49.362+0000","up_votes":1,"down_votes":0,"body":"Yo creo que es por parte del servidor, a mi también me pasa dentro de los primeros 10 minutos","replies":[]},{"poster":"WakingTheDemon9","date":"2019-01-29T20:34:19.858+0000","up_votes":1,"down_votes":0,"body":"Todavia no hay solución a esto??","replies":[]},{"poster":"Your Slayer","date":"2019-01-26T22:17:04.785+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa que al minuto 8 no solo se desconecta, si no que luego de unos segundos de reconexion se me freezea la pantalla y luego me tira pantallazo azul. Sigo sin encontrar la solucion","replies":[]},{"poster":"cripi a 2Lukas","date":"2019-01-25T01:14:40.187+0000","up_votes":1,"down_votes":0,"body":"ese fue el primer error luego paso a un lag de min 6 un bajon extremo de fps que suele durar un minuto o incluso un minuto y medio, no tiene solucion por lo que se","replies":[]},{"poster":"Zolrrak","date":"2019-01-25T01:04:56.620+0000","up_votes":1,"down_votes":0,"body":"Me pasa en pantalla de carga de jugadores, carge al 100% pero despues de un buen rato se cierra y aparece la pantalla de reconectar e intento reconectar muchas veces y vuelve a pasar, todo esto en mi 1ra ranked, lo intente todo, asta reinicie computador pero ya era tarde, mi team tiro remake, ahora tengo derrota por abandono (rehecha), sin ningun sentido, todo me andaba bien. frustracion total, lo peor es que e hecho post acerca de esto y ni una ayuda, para rremate siempre aparecen los gente diciendo que nunca les a pasado esto, no entiendo para que comentan si no las pasa algo asi, son ni un aporte y pareciera que estan defendiendo que pasen estos problemas, es como que fueran ellos.","replies":[]},{"poster":"FNC Hiryu","date":"2019-01-25T00:10:47.136+0000","up_votes":1,"down_votes":0,"body":"Gracias por la ayuda a esas 60 personas que entraron","replies":[{"poster":"RobleKill","date":"2019-01-25T00:14:53.015+0000","up_votes":1,"down_votes":0,"body":"es que nadie sabe man xd","replies":[{"poster":"FNC Hiryu","date":"2019-01-25T00:29:31.531+0000","up_votes":1,"down_votes":0,"body":"Que buena comunidad que tenemos en lol","replies":[]}]}]}]}