{"poster":"Gretta Thunberg","date":"2016-02-27T13:30:16.410+0000","title":"Basta del gg izi","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":0,"body":"Riot plssss me borra mi foro por que estaba en charlas generales pero no hace nada contra esta gente que cada vez que puede dice gg izi, viejo? para que? existe la necesidad? recien en una partida 5 vs 4 gente de mi equipo diciendo gg izi? para que no entiendo y aparte uno les dice que es reportable y dicen:\r\nNo decir izi no es reportable riot has algo educa a la gente del lol plzzz ense&ntilde;a no todos ven los foros pero todos ven el launcher, pon algo ahi respecto a este tema, mucha gente lo dice por que no sabe que es reportable si se supiera creeme que disminuiria la tasa de gente flamer.\r\nGracias.\r\nPD: cada vez la comunidad es peor, para que decir izi es innecesario haz algo riot","replies":[{"poster":"Sir Crucifix ","date":"2016-02-27T15:25:59.874+0000","up_votes":4,"down_votes":0,"body":"Cuando caigan baneos como en el mklol van a cambiar las cosas","replies":[]},{"poster":"Zstardust","date":"2016-02-29T02:36:40.150+0000","up_votes":1,"down_votes":0,"body":"Es cierto, pareciera que lo ponen solo por inercia, o solo porque si o quizás no saben bien lo que en realidad significa. A veces después de una partida de 60 minutos ponen \"izi\" y uno queda como \"o.O . . en serio? una partida de una hora y decís que fue fácil? de ser tan fácil porque no ganaron antes?\"\nPersonalmente, el GG no me molesta. Si el que pierde pone GG es simplemente reconocer que la partida fue divertida y la paso bien mas allá de haber ganado o perdido.","replies":[{"poster":"Mazer Rakham","date":"2016-02-29T04:12:33.982+0000","up_votes":1,"down_votes":0,"body":"Es que el problema no es el GG es el \"izi\". Todos (o la gran mayoría, al menos) sabemos que GG significa good game y es un reconocimiento. Pero si es acompañado por un \"izi\" es una burla.","replies":[{"poster":"Gretta Thunberg","date":"2016-02-29T13:59:24.550+0000","up_votes":2,"down_votes":0,"body":"exacto y a veces mira como contaba en el post mi equipo eramos 5 y el otro equipo 4 y y no falta el tontito de mi equipo que escribe gg izi no esta la necesidad, no existe","replies":[]}]}]},{"poster":"Neoburstx","date":"2016-02-27T14:04:40.999+0000","up_votes":1,"down_votes":0,"body":"cual te molesta mas:\n1.- cuando lo dicen por chat /all\n2.- cuando lo dicen por chat de equipo","replies":[{"poster":"Gretta Thunberg","date":"2016-02-29T00:13:54.209+0000","up_votes":2,"down_votes":0,"body":"para mi los dos son igual de molestos me refiero a que por ejemplo gana el equipo rival y sale el gg izi de la nada y molesta, y de la misma manera cuando alguien de mi equipo lo dice por el all de las dos formas es igual de molesto","replies":[]},{"poster":"Mazer Rakham","date":"2016-02-27T20:39:28.523+0000","up_votes":2,"down_votes":0,"body":"Para mí, los dos son molestos y reporto al que lo diga, sea de mi equipo o enemigo.","replies":[{"poster":"Yazzy","date":"2016-02-29T01:46:52.530+0000","up_votes":1,"down_votes":0,"body":"En el chat de tu equipo pueden decir \"Eh, ese del otro equipo es malísimo, está re izi\" y no es sancionable, sólo es sancionable si se lo dice directamente en el chat de /all o en el chat post-partida.","replies":[{"poster":"Mazer Rakham","date":"2016-02-29T04:05:44.081+0000","up_votes":1,"down_votes":0,"body":"Nadie dice  \"Eh, ese del otro equipo es malísimo, está re izi\", todos dicen \"gg izi\", \"izi top/bot/mid/jg\" en tono de burla, por ende, es sancionable.","replies":[]}]}]}]},{"poster":"Stay in Tower","date":"2016-02-27T14:37:43.136+0000","up_votes":2,"down_votes":0,"body":"es molesto, pero lo mejor es ignorarlo, es gente que no vale la pena","replies":[{"poster":"Mazer Rakham","date":"2016-02-29T04:06:41.124+0000","up_votes":1,"down_votes":0,"body":"Para mí, lo mejor es reportarlos. Menos gente tóxica en el server.","replies":[]}]},{"poster":"Akaliciamela","date":"2016-02-27T14:14:20.693+0000","up_votes":2,"down_votes":0,"body":"Lo que me molesta que lo digan en /all cuando ganan, no les van a dar PI extra, ni ningun otro premiio, solo lo hacen para hacer enojar y burlarse.\nPero lo que más me molesta es el gg izi cuando pierden dicen cosas como; GG izi TOP, Izi mid, etc. No entiendo porque lo dicen, si dicen eso no les daran el cartel de  victoria de vuelta. Es una gran molestía esos tipos de jugadores.\nGracias.{{champion:41}} {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"GroomyB","date":"2016-03-01T03:49:12.885+0000","up_votes":1,"down_votes":0,"body":"Es normal en esa gente que se creen muy como decirlo ''Estupidos'' porque ciertamente lo son, ay partidas que son easy en su normalidad muchas pero ay otra que no como tu lo dijiste duran 30 o 1 hora a mas y dicen izi o easy me gustaria un sistema de reportes para eso solo que riot se toma el tiempo en los graficos campeones y bugs que no arregla la comunidad hasta cuando...","replies":[]},{"poster":"DieOrSovngarde","date":"2016-02-27T16:04:03.521+0000","up_votes":1,"down_votes":0,"body":"Deberian tener un sistema como Valve, que tene prohibidas algunas palabras","replies":[{"poster":"Mazer Rakham","date":"2016-02-29T04:09:39.922+0000","up_votes":1,"down_votes":0,"body":"Están prohibidas muchas palabras, pero siempre encuentran la forma de decirlo de otra manera, si no es easy es izi, eezi, isi, alguna forma de decirlo encuentran. Y no se puede prohibir cada palabra nueva que aparezca. Solución: Report. Como dijeron en otro comentario: Cuando empiecen los baneos masivos como con el mklol van a cambiar. Pero a muchos les da paja reportar.","replies":[]}]},{"poster":"YellowMark","date":"2016-02-28T16:39:20.605+0000","up_votes":1,"down_votes":0,"body":"Yo en Realidad Pienso que eso es una burla al equipo, siempre hay dos o tres que dan todo al equipo, gente que por mas de que se le insulte juega lo mejor que puede, gente que ni experiencia basta en el juego posee y aun asi trata de jugar como un plata oro o platino, gente que vino solo al juego sin consejos de nadie y totalmente de nadie viene a dar todo, para mi esos jugadores son los que deben tener los bordes respectivos, aunque por mas de que nosotros nos quejamos tambien solemos hacer eso almenos una o dos veces, pero estoy muy de acuerdo con la frase que dijo esta persona: (_Stay In Tower_)\n> [{quoted}](name=Stay in Tower,realm=LAS,application-id=PJAKt7ph,discussion-id=UwrFlp5p,comment-id=0004,timestamp=2016-02-27T14:37:43.136+0000)\n>\n> es molesto, pero lo mejor es ignorarlo, es gente que no vale la pena\n\nAdemas yo suelo quitar en ciertos momentos el chat /all, asi que deberias hacerlo, es lo mas facil q esta al alcance.\n\n{{sticker:slayer-pantheon-thumbs}} \nRespetos A Toda la comunidad y a Riot\n_YellowMark_","replies":[]},{"poster":"Twisted Feeder","date":"2016-02-28T01:34:40.092+0000","up_votes":1,"down_votes":0,"body":"Yo con mi Riven pongo GGTOP{{champion:92}}","replies":[]}]}