{"poster":"Gretta Thunberg","date":"2017-09-22T05:22:28.117+0000","title":"Un toxico nace o se hace?","subforum":"Comportamiento del jugador","up_votes":18,"down_votes":3,"body":"Uno nace toxico o el juego lo vuelve toxico? \r\n\r\nEs una pregunta que nunca me habia hecho hasta hoy, jugue una partida en donde me toco jg y la tristana hizo el tipico ragekit perdimos y en el intento de ya no perder tiempo tiraba surrender, la vayne estaba feedeada y mi equipo no queria tirar el surrender y el otro equipo tampoco queria terminarla por que querian KDA. 30 minutos perdidos. \r\n\r\nLuego entro a otra partida y ahora el jg se fue afk y de verdad ya ni me dieron ganas de jugar esa partida se que estuve mal no me gusta perder pero ya dos afks en partidas distintas me toco un poco lo que tu sabes. \r\n\r\nintento no ser toxico pero a veces siento que la comunidad me saca un poco de quizio","replies":[{"poster":"FurchiDC","date":"2017-09-22T05:55:20.738+0000","up_votes":10,"down_votes":1,"body":"Buena pregunta, y es un punto importante que discutimos. \n\nExisten dos tipos de personas negativas: \n\n* Los **activos**: Por algun evento en su vida son así, son una pequeña minoría, muy raro que te cruces con uno. Son personas que se comportan negativamente porque sí, por placer a dañar al otro. Claramente tienen problemas psicológicos.\n\n* Los **reactivos**: Se hacen, son la gran mayoría de las personas negativas, y es más común que te cruces con uno. Son personas normales, que han sufrido algún evento que los hace comportarse así. Doy ejemplos para explicarme mejor. \nAlguien se pelea con su novia, entra a jugar de mal humor, juega mal sin querer por su depresión y cuando lo flamean por jugar mal los flamea de vuelta.\nAlguien tuvo un día horrible en el trabajo, el jefe lo trató mal, le salió mal un negocio, chocó con el auto o lo que sea, entra a jugar una partida para despejarse, pero con la mente negativa y estresada. Ante cualquier insulto, o persona jugando mal reacciona negativamente flameando, o lo que sea.\n\nLa primera clase de personas no se puede reformar mediante sanciones, tienen vuelta atrás pero es más complicado, y son una minoría. En cambio la segunda clase de personas PUEDE REFORMARSE mediante advertencias y sanciones que remarquen de qué forma se están comportando negativamente. De esa forma se pueden enfocar en resolver ese problema, y una vez resuelto y reformado es un jugador valioso, ya que se va a comportar neutral o positivo.\n\nAlgo que remarcar es que el segundo tipo, los reactivos, no suelen comportarse negativamente siempre, sino cuando sufren estos eventos que los ponen en ese estado. A veces nos cruzamos con uno de ellos, y pensamos \"¿cómo puede ser que a un jugador como éste no lo baneen?\" y es que solo recibió reportes ese día, en esa partida sola, y luego se comportó normal. Entonces sabiendo que el sistema te sanciona cuando sos constantemente negativo, sabemos que a este individuo no lo va a sancionar. Y no debería ya que no es una constante amenaza para la comunidad. En cambio si sigue siendo negativo todos los días en varias partidas, y se lleva reportes constantemente, ese jugador terminará sancionado, primero temporal y luego permanente si no reflexionó sobre su comportamiento anteriormente. Luego de perder la cuenta, tendrá que hacerse una nueva y no volverá a comportarse negativamente a menos que quiera volver a perderla.\n\n[](http://.)\n[](http://.)\n\n* Por si no le encuentran sentido, el post fue editado luego de la respuesta de Pandita. Gracias por las aclaraciones :D.\n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[{"poster":"Korben","date":"2017-09-22T14:03:47.198+0000","up_votes":11,"down_votes":1,"body":"No diría que 'nacen' así. Digamos que hay personas que disfrutan hacer pasar un mal rato al resto, o que ese es su objetivo cuando juegan. Pero son los menos. \n\nTampoco es que no tengan vuelta, simplemente que lograr eso no es algo que nos corresponda hacer.","replies":[{"poster":"iNGENiO","date":"2017-09-22T14:19:41.476+0000","up_votes":3,"down_votes":3,"body":"Exploren un poco el impacto del descenso de ligas en un buen jugador.\n\nTengo un amigo, que juega muy bien. Realmente lo hace bien.\nEstaba en ligas muy altas. pero empezó a trabajar y a estudiar. Y le queda poco tiempo para el juego.\nAhora bien. Con el reset de ligas. Para que se entienda lo voy a poner con ejemplos.\n\nPaso de diamante. A oro.\n\nQue le ocurre?\n\nSiente que sus compañeros juegan muy mal comparado con el. Entonces, se enoja mucho con su team, porque realmente hay diferencia de mecánicas y de visión de juego global con el resto. El sabe que ellos no están a su nivel. Lo cual es cierto.\n\nEsto genera que se enoje mucho. Ya tuvo muchas sanciones y esta al borde del permaban.\n\nPero no le ocurre si juega en grupo con gente de su mismo nivel en el lol.\n\nYo sin duda creo, que el impacto del reset de ligas de fin de año, hace que muchos jugadores se vuelvan muy inestables porque están con compañeros que sienten que no juegan a su nivel y empiezan a discutir, donde uno piensa que algo esta bien y el otro no. Y genera muchas peleas.\n\nEl reset de ligas trae mucho problemas año a año.\n\nEs como si uno llegara al final de carrera de la facultad y de golpe tenes que volver a primer año y lidear con los mismos problemas que ya superaste.\n\nQue sucede, cuando ocurre el reset, muchos siguen jugando, y suben rapido de liga y no se siente el cambio. Pero otros pueden recien empezar a jugar mucho despues y se siente duro el impacto.\n\nMe gustaría que explores un poco de eso Panda cuando puedas. Siento que a muchos les pasa esto. Y se genera muchos problemas.\nEs como poner a un universitario en 1er grado de jardín. No todas las personas les cae bien. Esta quien lo toma con calma. Y esta a quien los nenes del jardín los vuelven loco.\n\nUpdate: entiendo la estrategia de bajar a todos de liga, para que vuelvan a jugar desesperados y jueguen mas y mas para volver a su liga. Como estrategia de la empresa para mantener jugadores activos. Es buena. Pero genera este tipo de impacto negativo en cuanto a la convivencia. ","replies":[{"poster":"Korben","date":"2017-09-22T14:47:12.804+0000","up_votes":6,"down_votes":1,"body":"Creo que hay varios puntos interesantes ahí.\n\nLo primero es que, independiente de cómo jueguen los demás, eso no puede ser 'justificación' para la conducta propia. Digo, por más que algunas situaciones sean frustrantes, la manera de afrontar eso depende de uno. No digo que sea lo más sencillo de la vida, pero así como uno pone de su parte para mejorar en el juego, también debería poner de su parte en temas de conducta. \n\nAhora, respecto del reset de ligas, yo no tengo tan clara la fundamentación detrás de eso. He visto sistemas distintos en varios juegos, pero me imagino que debe haber un motivo para que sea así. Pero sí estoy seguro que no tiene que ver con que estén desesperados y jueguen más, sino que más con 'actualizar' o 're-ordenar' la distribución del MMR de manera que refleje lo que ocurre en la nueva season, y no esté fuera de fecha. Es como... que ser platino hace 2 años, no es lo mismo que ser platino hoy.  \n\nIndependiente de eso, entiendo un poco la frustración. Pero también entiendo que si realmente tu MMR es muy superior a la liga en que estás, no te debería costar tanto carrear y subir más  o menos rápido. Siempre y cuando te enfoques en eso, y no en lo 'mal que juegan tus compañeros'.  Si sus compañeros no están a su nivel, sus oponentes tampoco. \n\nTambién tienes que pensar también que alguien que tiene más tiempo para invertir jugando y mejorando, tiene una ventaja frente a alguien que tiene tiempo limitado, y eso es natural.","replies":[{"poster":"FrankRAM","date":"2017-09-22T18:01:19.900+0000","up_votes":1,"down_votes":0,"body":"Personalmente encuentro que los jugadores de Elo bajo juegan MUCHO mejor a cuando yo empece (S4) el bronce de ahora tranquilamente podria ser oro en s4. me gusta muchisimo eso. La toxicidad ya no tanto","replies":[]},{"poster":"Locked ULIvE","date":"2017-09-22T17:58:22.994+0000","up_votes":1,"down_votes":0,"body":"Creo que se refiere que el nivel de plata, en general es muy malo, por que se parte con la premisa que un jugador unranked es plata, quizás alguno y mucho pasa, que un jugador sin experiencia queda en estas ligas medias y no en bronce. Aunque este sistema beneficia a gente con cuentas secundarias subir rápido. Y frustrar gente que juega mucho en plata y no sube. Al subir esta cuenta de bronce 4 a ,oro 4 se ve la evolución de jugadores y como cambia el flameo y las actitudes de los jugadores. (vamos a platino esta season <3 )","replies":[]},{"poster":"Gretta Thunberg","date":"2017-09-22T16:23:10.549+0000","up_votes":1,"down_votes":0,"body":"y ustedes como empresa ponen de su parte para mejorar el juego? juego cada dia y cada dia veo toxicos, reporto y pareciera que no funciona, reporto a cada persona que dice izi y eso el sistema lo ve o solamente hace la vista gorda.\n\nPor que mejorar el sistema de honor si no mejoran el sistema de retroalimentacion no soy experto pero segun yo estos dos deberian ir de la mano no pueden mejorar uno y dejar el otro en el olvido.","replies":[]},{"poster":"TheBoss2190","date":"2017-09-22T15:55:57.220+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Panda,realm=LAS,application-id=PJAKt7ph,discussion-id=ZhWasmca,comment-id=0002000000000000,timestamp=2017-09-22T14:47:12.804+0000)\n>\n> Creo que hay varios puntos interesantes ahí.\n> \n> Lo primero es que, independiente de cómo jueguen los demás, eso no puede ser &#x27;justificación&#x27; para la conducta propia. Digo, por más que algunas situaciones sean frustrantes, la manera de afrontar eso depende de uno. No digo que sea lo más sencillo de la vida, pero así como uno pone de su parte para mejorar en el juego, también debería poner de su parte en temas de conducta. \n> \n> Ahora, respecto del reset de ligas, yo no tengo tan clara la fundamentación detrás de eso. He visto sistemas distintos en varios juegos, pero me imagino que debe haber un motivo para que sea así. Pero sí estoy seguro que no tiene que ver con que estén desesperados y jueguen más, sino que más con &#x27;actualizar&#x27; o &#x27;re-ordenar&#x27; la distribución del MMR de manera que refleje lo que ocurre en la nueva season, y no esté fuera de fecha. Es como... que ser platino hace 2 años, no es lo mismo que ser platino hoy.  \n> \n> Independiente de eso, entiendo un poco la frustración. Pero también entiendo que si realmente tu MMR es muy superior a la liga en que estás, no te debería costar tanto carrear y subir más  o menos rápido. Siempre y cuando te enfoques en eso, y no en lo &#x27;mal que juegan tus compañeros&#x27;.  Si sus compañeros no están a su nivel, sus oponentes tampoco. \n> \n> También tienes que pensar también que alguien que tiene más tiempo para invertir jugando y mejorando, tiene una ventaja frente a alguien que tiene tiempo limitado, y eso es natural.\n\nObviamente cualquier mal comportamiento no está justificado. Simplemente existe en el ecosistema del juego como algo Natural simplemente por que no existe algun tipo de castigo o limite para reformarlos. Y si, yo no creo que la solución es banear tóxicos,(a los trolls si) sino que antes intentar reformarlos de alguna manera más real y que la solución no sea echar unas partidas contra bots...\nNo tengo la capacidad creativa como para decirles que hacer para reformar a la gente, pero seguro que a alguno de ustedes se les va a ocurrir algo :p","replies":[]},{"poster":"iNGENiO","date":"2017-09-22T15:06:04.993+0000","up_votes":1,"down_votes":0,"body":"Entiendo tus reflexiones.\n\nBueno justamente como punto interesante, es que pasa exactamente lo que dijiste, al tener rivales que no son de su nivel tampoco, carrea fácilmente las partidas y el enojo no viene por parte de si gana o no las partidas. \n\nYa que por mas que gane, suele tener problemas. Y como también claramente uno no puede ganar todas las partidas por mas que tengas un muy buen rendimiento.\n\nEl problema es la convivencia dentro de la partida con gente que no hace lo que el espera que hagan. O mejor dicho, ya sabe que no van a hacer lo que el desearía o que sabe que harían otros de nivel superior.\n\nEntonces se torna un entorno malo para todos los jugadores que tiene de compañeros. El sabe que es superior. Y sabe que puede ser el que vuelque la partida. Y también tiene la sensación de que HACE ganar a los otros y si no, no ganarían si el no estuviera en la partida.\nLo simpático, es que en el fondo tiene un poco de razón. Entonces es difícil tratar de hacerlo tranquilizar muchas veces.\n\nEl reset de ligas, es todo un tema. O si queres ponerlo de otra manera.\nVolver al juego luego de 1 año por ejemplo. Seria el mismo efecto.\n\nOtro ejemplo de esto mismo es cuando un jugador de ligas altas entra con su smurf, vas a ver que por mas que gane la partida, sufre y muchas veces hace sufrir. Hay muchos jugadores quejándose de los que son smurf y no les dan bola o importancia en la partida porque se creen superiores.","replies":[]}]},{"poster":"Quinntakill","date":"2017-09-23T14:07:14.153+0000","up_votes":1,"down_votes":0,"body":"Pero si es super fácil carrear una partida en gold aunque tus compañeros la intenten tirar a la basura xd","replies":[]},{"poster":"Gretta Thunberg","date":"2017-09-22T16:17:06.150+0000","up_votes":1,"down_votes":0,"body":"Eso creo que tiene una solucion, cuando llega el reset te dan como de 30 puntos y pierdes 11 en 4 partidas ya estas en promo y de igual manera te puedes saltar de division","replies":[]}]},{"poster":"FurchiDC","date":"2017-09-23T08:00:37.934+0000","up_votes":1,"down_votes":0,"body":"Las personas que disfrutan de hacer pasar un mal rato al resto no nacen así... buen punto para reflexionar. ¿Cómo llega alguien que no nació así a comportarse de esa forma?\n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[]},{"poster":"Gretta Thunberg","date":"2017-09-22T16:14:22.588+0000","up_votes":1,"down_votes":0,"body":"Amigo rioter llevo jugando hace mucho tiempo juegos online, y este es el primer videojuego con el que tengo una actitud negativa y lo mejor es que no es por el juego, el juego me encanta pero la comunidad es horrible.\n\nQue si no es un autolocker, es un zed supp 0/9 no por que sea el mejor zed supp de las, si no que por que el no sabe ocupar ningun supp sabiendo que le puede tocar la posicion.\n\nsi no es un toxico que culpa a todo el team de todo, es un afk","replies":[]}]},{"poster":"iNGENiO","date":"2017-09-22T14:07:24.971+0000","up_votes":3,"down_votes":2,"body":"\"Buena pregunta, y es un punto importante **que discutimos**.\"\n\nCon quien lo discutís?","replies":[{"poster":"FurchiDC","date":"2017-09-23T07:55:54.798+0000","up_votes":1,"down_votes":0,"body":"Con otros Voluntarios, Excalibeer y Panda.\n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[]}]}]},{"poster":"rokushoger","date":"2017-09-22T13:00:05.847+0000","up_votes":7,"down_votes":2,"body":"Ninguna de las dos.\n\nNadie es tóxico porque ser tóxico no es una característica, simplemente es una reacción en un momento determinado que puede ser causada por estrés, ansiedad, etc, y puede no ser específicamente generada por el lol sino que el estrés de las partidas de lol desencadenan lo que se venía gestando por problemas de la vida diaria.\n\nEn este entendido no es que se nazca o se haga, sino que se reacciona de forma tóxica.","replies":[{"poster":"Gretta Thunberg","date":"2017-09-22T16:28:21.815+0000","up_votes":3,"down_votes":0,"body":"No estoy de acuerdo contigo, hay gente que entra a un juego unica y exclusivamente a perjudicar a los demas, sin motivo o alguna reaccion,  te piden adc no les dejas y sacan teemo jg y a trolear, son muy pocos pero desgraciadamente me han tocado.\n\nO la otra vez una akali que empezo a trolear sin motivo alguno y a parte a flamear desde el minuto 2 sin que nadie le dijiera nada. \n\nQue pasa que hay otras ocaciones donde ya jugaste una partida que pudiste haber ganado pero tu adc se fue afk al minuto 8, obviamente te tilteas si yo entro a jugar es para relajarme un momento, por que me gusta el juego pero ya perfecto perdemos, entro a otra partida y el jg afk, dices para que seguir jugando no tiene sentido mejor espero el surrender y ya esta.\n\nhay una gran diferencia, yo no habia tenido un mal dia para nada solamente queria jugar y ironicamente el juego no me dejo jugar.","replies":[{"poster":"rokushoger","date":"2017-09-22T16:46:05.730+0000","up_votes":1,"down_votes":1,"body":"A ver, no se malentienda lo que voy a decir, ni estoy de acuerdo con ellos, ni del lado de ellos. Habiendo aclarado eso cuando tu dices \" te piden adc no les dejas y sacan teemo jg y a trolear\", eso para ellos en realidad es una especie de afrenta, y su troleo es una reacción a eso. \n\nObviamente eso es una \"hipersensibilidad\" dado que lógicamente no es tu intención el insultarlos ni nada así, pero esa \"hipersensibilidad\" tiene siempre un respaldo atrás que puede no tener que ver con lol, y que en general tiene que ver con algún tipo de frustración en su vida diaria. Tal vez esa persona puede que esté sufriendo algún tipo de problema que escapa de su control, y por tanto cuando entra al lol y le surje un problema (como por ejemplo no tener la linea que quiere) automáticamente trata por todos los medios de tener ese control que no tiene en su vida. Tal vez esa persona es buena gente en su vida, o incluso tal vez si le dabas la linea era un jugador más dispuesto a ganar, pero en ese momento fue tóxico (no te lo tomes como que te hecho la culpa, para nada, solo te digo como puede ser que piensa esa persona).\n\nEl resultado es que sea como sea es casi 100% seguro que esa persona tiene algún motivo de fondo por el que entra e insulta o trolea, y que puede no tener que ver con la partida en sí.\n\nPor eso digo, no hay personas que SON tóxicas, sino personas que EN DETERMINADO MOMENTO ACTUARON DE FORMA TÓXICA.\n\nPor ejemplo en tu caso, tu dices que \"no te dejaron jugar\", y que por eso te tilteas y te madeas verdad? Te calificas como mala persona? Si idealmente la partida hubiese sido tranquila, aún así flamearías? Porque bajo tu definición con que insultes una vez ya sos una persona tóxica! Pero la realidad es que tu reaccionaste a un estímulo, en este caso, a otra persona que se portaba de forma tóxica.\n\nLa toxicidad es como un resfriado, si no te cuidas te contagias, y contagias al resto con el que estés en contacto y no tome precauciones, pero no estás resfriado siempre, y puede curarse teniendo ciertos cuidados.\n\nSaludos!","replies":[]}]},{"poster":"Korben","date":"2017-09-22T14:15:10.237+0000","up_votes":3,"down_votes":1,"body":"Claro, yo estoy más de acuerdo con esto.","replies":[]}]},{"poster":"AJ             J","date":"2017-09-22T05:37:01.748+0000","up_votes":4,"down_votes":0,"body":"Yo empece a sentir los sintomas de toxicidad cuando me preocupaba un poco mucho por ganar. Esperas algo de los demas cuando tenes que preocuparte por tu propio juego.\n\nCuando cambie mi punto de vista de **\"¿Por que no hacen esto?\"** a **\"¿Por que no hice esto?\"** deje de tener una tentacion de hostilidad hacia terceros. ~~Ahora soy sobreexigente conmigo mismo, no todo se puede.~~","replies":[{"poster":"Gretta Thunberg","date":"2017-09-22T05:49:57.439+0000","up_votes":1,"down_votes":0,"body":"SI pierdo por que el equipo enemigo es mejor su composicion o solamente jugaron mejor en el 5 vs 5 perfecto me queda un mal sabor de boca obvio pero pasa, cuando es por un afk simplemente no lo tolero por que podrias haber ganado esa partida y la vas a perder no importa cuando lo intentes por que se van afks cuando feedean y aparte te dejan con uno menos. para que esforzarse en una partida asi si de todas formas perderas? acaso no es mejor aceptar que ya se perdio la partida y no perder tiempo en vano? y entrar a otra sin afks","replies":[{"poster":"Mazer Rakham","date":"2017-09-22T14:03:41.660+0000","up_votes":1,"down_votes":1,"body":"Incluso con afks se puede ganar. Ahora no estoy jugando por un tema personal, pero hace una o dos semanas atrás me toco una partida en la que el Nasus del team enemigo estaba feed y nuestra Sivir iba y volvía a cada rato (prácticamente se pasó media partida en base o más). Sin embargo, se pudo ganar. Cuestión de ver el juego de otra forma, de buscarle la vuelta, de ir por objetivos y no kills, de esperar el error enemigo.","replies":[{"poster":"Gretta Thunberg","date":"2017-09-22T16:29:41.013+0000","up_votes":1,"down_votes":0,"body":"No es la idea carrear a alguien que se va afk por que lo matan amigo, no seria mejor que riot se pusiera los pantalones y mejorara el sistema? ","replies":[{"poster":"Mazer Rakham","date":"2017-09-22T17:11:28.907+0000","up_votes":1,"down_votes":0,"body":"Entonces tu idea es jugar a perder? La persona que se va AFK recibe su castigo. Peor wque hayAFK no quiere decir que tengas que irte vos tambien y asi perjudicar a las otras personas.","replies":[{"poster":"Gretta Thunberg","date":"2017-09-22T17:21:18.138+0000","up_votes":1,"down_votes":0,"body":"para que jugar una partida donde sabes que vas a perder no por que el equipo rival sea mejor si no por que solamente tienes un afk mejor esperar al surrender y jugar otra :D","replies":[{"poster":"Mazer Rakham","date":"2017-09-22T17:23:14.747+0000","up_votes":1,"down_votes":0,"body":"Tu actitud es derrotista y eso te lleva a perder, no el que haya o no afk. Se juega hasta el final, no sabes si ganas o perdes hasta que caiga el nexo. Pero ya con tu forma de pensar uno se da cuenta: Sos de los que al menor error ya tira surrender.","replies":[]}]}]}]}]}]}]},{"poster":"TheBoss2190","date":"2017-09-22T14:36:54.316+0000","up_votes":3,"down_votes":0,"body":"Un jugador nace y/o se hace\n\nLet me explain bro:\n\nEsta el jugador que NACE en un ambiente agresivo, tener una vida complicada, ser simplemente un psicópata o un niño que en casa los papas no lo quieren y tranquilamente le guste jugar lol para descargarse, precisamente, no jugando bien, sino que el juego da para otro tipo de diversión que sólo ellos disfrutarian...\n\nY se HACE tóxico por que este comportamiento impulsado, por la gente mencionada anteriormente, es contagioso y genera cierto tipo de estrés y odio recíproco entrando en un ciclo sin fin de toxicidad.\n\nLlegamos hasta el punto que cualquier cosa que ocurra o suceda ya es \"la gota que revalsa el vaso\" y algunos reaccionan ignorando y otros entrando en el ciclo.\n\nResumen: se hace y se nace xdxd","replies":[]},{"poster":"LeonardoSB","date":"2017-09-22T05:29:15.838+0000","up_votes":2,"down_votes":0,"body":"se hace.\n\nSaludos!","replies":[]},{"poster":"iEban","date":"2017-09-22T12:47:32.240+0000","up_votes":2,"down_votes":1,"body":"No creo que el juego tenga la culpa de que haya gente que se lo toma como si fuese algo tan importante, puedo entender la competitividad y que cuando se intenta ganar no esta bueno que tu equipo este jugando mal, pero de ahí al punto donde la gente se pone a insultarse y estar media partida leyendo a dos inmaduros pelearse, no creo que el juego sea el culpable de que los nenes sean nenes. De cualquier edad eh, no me cabe eso de decir \"de quince años\", jugué con cada uno de quince que es todo un señor y hay cada grandulón de 25 que parece prepuber que no se puede creer.","replies":[{"poster":"Gretta Thunberg","date":"2017-09-22T16:30:58.591+0000","up_votes":1,"down_votes":2,"body":"El juego no tiene la culpa el sistema si por ser tan ineficiente","replies":[]}]},{"poster":"The Fall of Troy","date":"2017-09-24T01:31:25.523+0000","up_votes":1,"down_votes":0,"body":"jugando lo suficiente se hace, ponte que te tocan 4 retrasados en tu team que literal no sirven para nada mas que fedear y escribir \"k\" en vez de \"que\" y 5 en el otro espameando la risa y el baile a tal punto que desarrollan túnel carpial al terminar la partida diciendo gg izi, cualquiera se enoja ahora ponte que ocurre todos los días en ranked c:","replies":[]},{"poster":"faster51","date":"2017-09-22T20:35:03.592+0000","up_votes":1,"down_votes":0,"body":"para qué quieres saber eso? \nla pregunta sería: cómo evado o transformo un tóxico?","replies":[]},{"poster":"Mecaniks","date":"2017-09-22T17:20:20.584+0000","up_votes":1,"down_votes":0,"body":"Quizas esta historia la escuchen mas de una vez al dia pero es la realidad:\nYo trabajo 8 horas de mi dia, soy programador, estudiante de ingenieria en computacion, buen novio y sobretodo amante de los juegos online.\nHace unos 3-4 años juego al lol, debido a toda mi actividad que ya detalle, mi dia se detalla en un monton de tareas hasta que tengo mi tiempo libre y ahi decido gastarlo claramente en el lol, lo cual me permite solo jugar quizas 1 o 2 partidas con suerte 3 por dia y aveces ni eso. Te podras imaginar que uno lo hace como valvula de escape y poder divertirse... Hay dias que decis para que m*** estoy perdiendo el tiempo en este juego, te toca gente que te trollea flamea lockea etc... tenes dos chances: la primera es ser un toxico, la segunda es seguir. Obvio que frustra y mucho, no me siento un jugador con habilidad, pero tampoco me siento un jugador muy malo, obviamente tengo partidas malas como toda la gente y se entender eso. Pero hay gente que no entiendo a que juegan o que pretenden del juego, piensan que por insultar me van a salir manos o le van a salir manos al malo del team, cuando en si el malo aca no son mas que nada ellos dando tanta negatividad al punto de llegar a perder partidas que estaban ganadas. \n\nAntes de ayer, es decir el miercoles jugue una partida en la cual me toco support.. Lo cual no me enoja ya que el comodin es asi aveces te toca. Me sorprende que la gente que este en oro, te trollee una partida porque le toco support.. pero pasa. En mi caso fui Lulu uno de mis mains, mi adc era una vayne(malisima) pero una vayne al fin, sabia que si llegabamos a late ganariamos. Primer jugada maokai jg nos gankea y me raja a puteadas porque \"no le di\" escudos, claramente no se que penso que era urf o que pero ta se nos complico mucho. La puteada que me comi por algo que era imposible que hiciera, ya que ya le habia dado escudos... pero bueno eso pasa siempre y hay que sobrellevarlo..... La pregunta es Por que? porque tengo que soportar que ese tipo de personas me hable mal luego de un dia entero de cosas y lo que quiero es distenderme y que una persona que no se ni quien es ni que se cree te raje puteando te trollee etc. al final ganamos porque? porque vayne con todo mi peel nunca murio y mato a todos.. Claramente el mejor jugador de la partida fue vayne que no sabia ni posicionarse pero ta tenia el daño. Maokai calladito tipico de toxico flammer.\n\nNo se escribi mucho, ya no se ni que puse. Saludos \nnos vemos en la grieta","replies":[{"poster":"Gretta Thunberg","date":"2017-09-22T17:56:31.167+0000","up_votes":1,"down_votes":0,"body":"Tienes mucha razon a mi tampoco me gusta jugar support pero siempre esta la posibilidad asi como que te toque jg,top,mid etc.\n\ny claro vayne es vayne tiene un daño ridiculo sin mucho pero con un afk es dificil hacer frente","replies":[]}]},{"poster":"Treant del DOTA","date":"2017-09-22T16:58:19.991+0000","up_votes":1,"down_votes":0,"body":"Te lo resumo. Los que jugamos juegos online donde exista rivalidad y un chat. Somos todos así. Los niños rata de ahora que arrancan a jugar al LoL y las reglas estú***** que pusierion los Rioters que el chat es solo para gente que le gusta las flor3s y los pajaritos convierte a está comunidad en jugadores y/o personas con poca chispa y gracia en la vida.","replies":[]},{"poster":"TaliyahTrump SSG","date":"2017-09-22T06:59:57.527+0000","up_votes":1,"down_votes":1,"body":"El juego los crea, si en una partida en la que alguien se va afk tu das todo de ti para ganar y aun asi despues de 50 o 60 minutos pierdes igual y te frustas, en la siguiente partida tu equipo empieza mal y tu diras no voy a perder otra hora de mi vida para terminar mal otra vez y te iras tu esta vez. Un circulo vicioso del cual el unico responsable es es el juego en si.","replies":[{"poster":"Gretta Thunberg","date":"2017-09-22T16:31:39.313+0000","up_votes":1,"down_votes":0,"body":"exacto a eso voy para que despues quede sin sancion","replies":[]}]},{"poster":"Uli con azúcar","date":"2017-09-22T16:08:56.767+0000","up_votes":1,"down_votes":0,"body":"Se hace, más precisamente el lol te hace tóxico. Tengo 22 años meta viciar con videojuegos y este es el primero que logró ponerme de mal humor, y repetidas veces","replies":[{"poster":"Gretta Thunberg","date":"2017-09-22T16:31:19.209+0000","up_votes":1,"down_votes":0,"body":"concuerdo contigo","replies":[]}]},{"poster":"MILFortune","date":"2017-09-22T15:45:08.612+0000","up_votes":1,"down_votes":0,"body":"nadie nace sabiendo hablar o escribir, que son las herramientas que usa el tóxico (y normalmente, cualquier otro ser) para expresarse. Así que no es una cuestión de ADN si no de formación","replies":[]},{"poster":"TeamSayori","date":"2017-09-22T05:56:29.823+0000","up_votes":1,"down_votes":0,"body":"bajo determinados casos un toxico se hace (que lo sea antes de jugar lol es otra cosa)","replies":[]}]}