{"poster":"Gretta Thunberg","date":"2017-03-29T19:36:55.637+0000","title":"Duda sobre bann e ip","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":1,"body":"Alguien sabe si riot games al momento de bannear a una persona registra su ip.\r\n\r\na lo que voy es que por ejemplo a mi me bannean por toxico perma bann, nada me impide crearme una nueva cuenta y seguir haciendo lo mismo y asi sucesivamente.\r\n\r\ny mi pregunta es. RIot previene este tipo a actitudes con un banneo de ip, al fin y al cabo esa es la manera de riot de saber si un perma bann se creo otra cuenta para seguir siendo toxico eso seria saludos","replies":[{"poster":"Desaroll","date":"2017-03-29T19:39:47.946+0000","up_votes":3,"down_votes":0,"body":"Hayo!\n\nEl baneo por IP no es efectivo contra individuos, a menos que la regi칩n tenga IPs est치ticas, cosa que no se cumple en LAS.\n\nEn la regi칩n, la mayor칤a de las IPs cambian reiniciando el m칩dem.\n\nPor eso no se lo implementa.\n\nPero tengo entendido que est치n trabajando en un modo de banear de forma m치s permanente que el ban de cuenta ;-)\n\nSuerte!","replies":[{"poster":"Ray06","date":"2017-03-29T19:44:10.609+0000","up_votes":1,"down_votes":0,"body":"Pero eso es imposible no??","replies":[{"poster":"Desaroll","date":"2017-03-29T19:48:41.656+0000","up_votes":1,"down_votes":0,"body":"Es imposible hacer un sistema que bloquee a la persona de forma irremediable (Por ahora), pero si puede hacerse que sea m치s dif칤cil que reiniciar el m칩dem.\n\nSuerte!","replies":[{"poster":"9081913DEL1","date":"2017-03-29T19:50:58.484+0000","up_votes":1,"down_votes":0,"body":"Se puede banear el dispositivo ;).\nSaludos!.","replies":[{"poster":"Desaroll","date":"2017-03-29T19:57:54.642+0000","up_votes":1,"down_votes":0,"body":"Hay problemas legales al hacerlo directamente (En varios pa칤ses exigen que sea opcional el brindar informaci칩n del dispositivo), adem치s de problemas t칠cnicos de definir \"dispositivo\".\n\nEn una PC, 쯈ue hardware tom치s como \"dispositivo\"?\n\n쮼l procesador? 쯃a ram? 쯃a placa madre? 쮼l conjunto?\n\nSuerte!","replies":[{"poster":"9081913DEL1","date":"2017-03-29T20:12:37.308+0000","up_votes":1,"down_votes":0,"body":"Si si, lo se solo puntualizaba que se podia m.m\n\nEn cuanto a que parte del hardware,  lo que he practicado yo es a la madre, sin disco duro y placa madre no hay pc. \nPero el disco, siempre puedes comprar obtener uno, aunque parezca lo logico porque alli va lol lo mas eficiente es la placa, no son baratas. Ni te pondrias a renovar la pc solo para volver a flamear xD.\n\nSaludos!","replies":[{"poster":"Gretta Thunberg","date":"2017-03-29T20:31:35.041+0000","up_votes":1,"down_votes":0,"body":"la verdad es que si alguien se compra una nueva placa para solo volver a flamear no tendria un problema a la mente si no lo siguiente","replies":[]}]}]}]}]}]},{"poster":"Quemaito y Suae","date":"2017-03-30T02:47:16.275+0000","up_votes":1,"down_votes":0,"body":"Soy invencible","replies":[]},{"poster":"Gretta Thunberg","date":"2017-03-29T20:03:50.021+0000","up_votes":1,"down_votes":0,"body":"espero que riot tenga un sistema magico para detectar a estas personas que no cambian de mentalidad y les ponga perma bann antes de que empiecen a rankear","replies":[{"poster":"Desaroll","date":"2017-03-29T20:09:24.564+0000","up_votes":1,"down_votes":0,"body":"Ser칤a genial, pero tenemos lo que est치 ;-)\n\nY lo que est치 funciona mejor mientras m치s reportes halla, as칤 que nunca olvides reportar ;-)\n\nSuerte!","replies":[{"poster":"Gretta Thunberg","date":"2017-03-29T20:30:20.459+0000","up_votes":1,"down_votes":0,"body":"siempre reporto espero tu igual","replies":[{"poster":"Desaroll","date":"2017-03-29T20:31:51.536+0000","up_votes":1,"down_votes":0,"body":"游녨","replies":[]}]}]}]}]},{"poster":"9081913DEL1","date":"2017-03-29T19:55:13.831+0000","up_votes":4,"down_votes":1,"body":"En tu caso, te explico.\nPuedes ser baneado por flamear, crearte una cuenta y seguir flameando, y asi suscesivamente.\n\nEn tal caso cada vez que recibes un ban, perdes todo lo que adquiriste, tu unica diversion es crear cuentas donde sabes lo mismo que un lvl15 o menos en cada partida, jamas agarras la idea competitiva del juego, no te haces de amigos.\n\nGastas Horas y horas logrando NADA.\n\nPara peor lo que haces es equivalente a robar, ir preso y salir para volver a ir preso. No solo la actitud es inexplicable en si, te arruinas lo mas preciado que es tu propio tiempo. \n\nSaludos!","replies":[{"poster":"Teemo de peluche","date":"2017-03-29T22:10:02.545+0000","up_votes":1,"down_votes":0,"body":"Eu pa, afloja un poco, edita el post y saca lo de tratar de estupido a cada rato al usuario, porque voy a hacer 30 post todos los dias de como tratas a la gente teniendo el nombre amarillo mostrando esto, calmate si? :)","replies":[{"poster":"9081913DEL1","date":"2017-03-29T22:39:02.416+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Teemo de peluche,realm=LAS,application-id=PJAKt7ph,discussion-id=1wepat67,comment-id=00030001,timestamp=2017-03-29T22:10:02.545+0000)\n>\n> Eu pa, afloja un poco, edita el post y saca lo de tratar de estupido a cada rato al usuario, porque voy a hacer 30 post todos los dias de como tratas a la gente teniendo el nombre amarillo mostrando esto, calmate si? :)\n\nLa actitud de flamear hasta ser baneado y crear otra cuenta para seguir hasta ser baneado nuevamente es estupida en si. Cumple la definicion de estupidez. Es un caso hipotetico. por supuesto que no lo estoy insultando, me parece mas que claro.\n\nSaludos!","replies":[{"poster":"Teemo de peluche","date":"2017-03-29T22:52:25.960+0000","up_votes":1,"down_votes":0,"body":"Son varios los que piensan que el amarillo con paint se les subio a la cabeza, hay varios post donde dicen los demas usuarios tenes que contestar asi?, de forma prepotente y asquerosa, se estan pasando de la raya y les va a traer problemas eso, te repito, modifica tu post, porque en 15 lo subo nomas, porque a mi me dijeron modera tu actitud, por decir \"bobo\" nomas :)","replies":[{"poster":"9081913DEL1","date":"2017-03-30T09:24:32.383+0000","up_votes":1,"down_votes":0,"body":"Si lo que quieres es debatir expresion agrega in game. Siempre estoy abierto a explicar.\n\nMe parece clara la diferencia entre hablar de una actitud hipotetica y tratar despectivamente a alguien. \n\nPero si la palabra te pone sensible no te preocupes se quita.\n\nLo de amarillo, yo que tu busco el resto de mis respuestas veras tranquilamente que son exactamente las mismas siempre. Un color no cambia una logica como un nick mejor no cambia la habilidad.\n\nSaludos!","replies":[]}]}]}]},{"poster":"Gretta Thunberg","date":"2017-03-29T20:01:52.450+0000","up_votes":1,"down_votes":0,"body":"pero es que al menos si el banneo fuera en plan inmediato o no se demorara tanto desde detectar hasta el perma bann seria worth pero el tipo va a vivir flameando y arruinandole la partida a los demas, y que pasa cuando ignoras a un flamer? pues trolea una verdadera pena que exista gente asi","replies":[{"poster":"Axlbg","date":"2017-03-29T20:12:07.812+0000","up_votes":1,"down_votes":0,"body":"De todos modos el sistema funciona. La mayor칤a se va calmando con los ban y si no te conforma eso vuelve a leer lo de arriba que tiene mucha raz칩n.","replies":[]}]}]},{"poster":"IRanger","date":"2017-03-29T20:00:25.890+0000","up_votes":1,"down_votes":0,"body":"ehhh si pueden pero tendrian que banear el hardware ID de las PC ya que la IP en latinoamerica es dinamica eso quiere decir reinician el router y les da otro numero de IP en cambio norteamerica es IP estatica la mayoria","replies":[{"poster":"Desaroll","date":"2017-03-29T20:04:02.083+0000","up_votes":1,"down_votes":0,"body":"S칩lo como dato, aunque en NA es est치tica, el ISP te la cambia si llamas y lo pides (La mayor칤a).","replies":[]}]},{"poster":"Axlbg","date":"2017-03-29T19:43:12.132+0000","up_votes":1,"down_votes":0,"body":"En la mayor칤a de los casos (casos comunes) la idea es banear la cuenta solamente, la posibilidad de crearse otra est치 abierta.","replies":[]},{"poster":"Ray06","date":"2017-03-29T19:39:33.844+0000","up_votes":1,"down_votes":0,"body":"Solo te banean la cuenta no la IP","replies":[]},{"poster":"Zinc","date":"2017-03-29T20:01:56.335+0000","up_votes":1,"down_votes":1,"body":"Me poregunto quien fue el que extendio el mito del \"bande IP\"\n\nIp dinamicas, cambian x si solas.","replies":[]}]}