{"poster":"Gretta Thunberg","date":"2017-01-31T11:49:40.661+0000","title":"Riot y supps","subforum":"Charlas Generales","up_votes":4,"down_votes":6,"body":"Riot viejo por que tienes que dejarle supp a alguien que no quiere ser supp? como adc me perdujica por que juegan sin ganas trolean se rien cuando mueres viejo a mi me da lo mismo esperar 1 dia entero si es necesario para que me toque alguien que de verdad sabe ser supp enserio pero porfis riot saca el comodin no es posible que este pasando esto gente si ganas de ganar solo por que le toco supp? enserio?\n\nRIot tienes el rol de supp super subestimado como para dejarselo a cualquier persona siendo que este es un rol mas importante muchas veces que el top o el mid por que es el que hace engage y desengage y dejarselo a alguien que no sabe mi pijas del rol o que simplemente no juega bien por que el queria kills y le toco supp es un insulto para el rol.","replies":[{"poster":"Mioen","date":"2017-01-31T12:59:48.897+0000","up_votes":7,"down_votes":0,"body":"Vuelvete main soporte.\n:D\n\nhttps://files.ctctcdn.com/184ce165201/a7aec23a-40a9-4bb1-96ea-97c2158da3fd.jpg\nPero en enserio, hace 4 seasons jugaba ADC y pase a soporte. Y el rol es puro amor, tenes un monton de soporte que te ayudan y somos los mas amigables a la hora de crear post :D \nYa enserio, pasar de un rol a otro por que no te gusta como juegan los demas es no tratar de comprender a los demas jugadores que empiezan en el rol y no les tiene paciencia y lo dejan.\n------\nSoporte es un rol super incomodo al principio, no puedes imponer un estilo de juego propio ya que tienes que adaptarte al Carry que te acompaña. Mas comprension para aquellos que no jugaron mucho el rol.\nSin contar que se sacrifica mucho el manejo de mecanicas, por aprender a leer el mapa y ser mas comunicativo con el equipo.\n\nSe puede tener un estilo propio de soporte(SI), el tema es que se consigue con el tiempo, y aun asi tu prioridad en lineas es la comodidad con tu carry.\n\nYo te quiero motivar a que dejes ADC que ya hay muchos y pases a este increible rol con grandes recursos y de mas utilidad. Un team puede ganar sin un ADC, pero sin un soporte es mas dificil.\n\nTus aliados en los campos de batalla serian estos.\n{{item:3107}} {{item:2049}} {{item:3401}} {{item:3092}} {{item:3069}} {{item:3190}} {{item:3222}} {{item:3060}} {{item:3050}} {{item:3143}} {{item:2303}} {{item:2301}} {{item:2302}} {{item:2045}} {{item:3114}} {{item:2055}} {{item:3364}} {{item:3800}} {{item:3504}} {{item:3116}} \n\nLa gran mayoria son activas, de gran utilidad y de mayor impacto que el daño.","replies":[{"poster":"Gretta Thunberg","date":"2017-01-31T19:01:04.381+0000","up_votes":2,"down_votes":0,"body":"es que no me gusta la linea asi como no me gusta top o jg pero espera que no me guste no significa que no dare todo de mi por intentar ganar, mi main rol es adc y de segundas viene supp por que? cuando me toca jugar supp juego como a mi me gustaria que me suportearan no lo hago mal pero es que la linea no me gusta como tambien no me gusta top o jg","replies":[{"poster":"Tutancadead","date":"2017-02-01T03:01:23.266+0000","up_votes":1,"down_votes":0,"body":"Que conciencia a casi toda la comunidad no le gusta.\nQue subestimado lo tiene la comunidad no?","replies":[{"poster":"Gretta Thunberg","date":"2017-02-01T05:35:32.628+0000","up_votes":1,"down_votes":0,"body":"es que no me gusta osea siempre me han gustado los personajes ranged con daño, antes jugaba metin2 y era arquero pero era el unico personaje que me gustaba, habian chaman, mago y guerrero y el arquero lejos es cosa de gustos.\n\nno me gusta el rol pero tampoco me disgusta siento que el rol puede cambiar el rumbo de la partida un buen o mal supp puede decidir si un equipo gana o pierde, si tengo que ir supp por el comodin o en normales voy el problema es que algo que me da mucha rabia es que si voy supp y pasa algo en top la culpa la tiene el supp y eso me da mucha rabia enserio me tiltea.\n\nRealmente no juego supp por que no me considero lo suficientemente bueno no tengo esa vision de juego y nose si podria llegar a desarrollarla, en top me pasa lo mismo intento jugar en normales para en ranked si me toca no ser una bosta peor igual lo soy y de jg tampoco tengo esa vision de ver el gank en cada linea y tal, de ADC me siento comodo es una linea que me gusta, tengo casi todos los rangos grabador en mi mente cuando juego me falta mucho pero muuuuuuucho.\n\nde supp soy regular ya que conozco la linea y a los carrys si voy con blitz y tengo una vayne de enemigo se que fijo todos los ganchos iran hacia ella y que tengo que tirarlos cuando gaste la q para asi gastarle el flash si dejo a vayne atras en late sera solo un carga para su equipo","replies":[]}]}]}]},{"poster":"WhiteMax","date":"2017-01-31T15:06:42.288+0000","up_votes":2,"down_votes":0,"body":"\" a mi me da lo mismo esperar 1 dia entero\" si claro jajaja seguro no aguantas ni los 20 min del leave booster si ponerte a mirar cosas en internet.\n\nSi te toca con gente que no sabe ir esa linea por algo estan en bronce, tu tienes la opcion de carrear la partida o dodgear si vez que en seleccion dicen que no saben ir.","replies":[{"poster":"Gretta Thunberg","date":"2017-01-31T19:07:43.597+0000","up_votes":2,"down_votes":0,"body":"Por suerte nunca he estado en leaver buster, si me dices espera 20 min y te toca un supp que sea support yo los espero lamento decepcionarte","replies":[]}]},{"poster":"Elmito Guapeton","date":"2017-01-31T16:10:56.078+0000","up_votes":2,"down_votes":0,"body":"yo soy buen sup pero aveces el enemigo es mejor que yo o yo ando malo. entiendes? lo que decis esta mal. seguro sos de esos adc vayne que  lloran cuando un blit erra una Q  . o por que no te salvo con la ulti de zilean o no te como  o si t como cuando quiera por que creo q es momento de salvarte   con la W de tahm kench.. me das verguenza ojala no me toque contigo ... por invocadores como vos tengo que jugar sup por que los niños ratas como tu. no saben ir ese rol","replies":[{"poster":"Gretta Thunberg","date":"2017-01-31T19:04:04.703+0000","up_votes":1,"down_votes":1,"body":"viejo yo se jugar de supp me ha tocado ir soporte en rankeds y lo hago sin problemas, todos podemos tener malas partidas pero si apenas entras en la partida el tipo dice alguien me cambia supp es un a clara muestra de que el tipo no esta ni ahi con el rol, tu puedes fallar todas las q que quieras con blitz y no te dire nada por que blitz es mas que una q, pero si me molesta no tener dominio del campeon, si usas nose a bardo no te puedes quedar atras tienes que pockear con la pasiva constatemente para hacer daño y usar la pasiva del filo de la reyna","replies":[]}]},{"poster":"Liliths","date":"2017-01-31T12:04:23.052+0000","up_votes":3,"down_votes":2,"body":"No te sientas especial, el comodin automático simplemente rellena el Rol que falta y punto, no es culpa de Riot que la gente no quiera jugar un rol que es aburridisimo y sin satizfaccion alguna, casi nunca me toca comodin y cuando me ha pasado me ha puesto como mid.\n\nPersonalmente, para que quiero ir soporte y depender de mis compañeros, tener 0 satizfaccion y 0 reconocimiento.. Cuando puedo ir con un Tanque random y tener un daño decente, una dureza que me hace casi inmortal y la capacidad de iniciar teamfights, manejarme en ellas y poder \"matar\", diras que las kills no importan, pero NADIE vé cuando un suport tiene 20 asistencias, pero si cuando otro tiene 10 Kills.","replies":[{"poster":"Gretta Thunberg","date":"2017-01-31T12:09:39.353+0000","up_votes":2,"down_votes":3,"body":"wtf? cito esto \"no te sientes especial\" especial de que viejo? el rol de soporte es tan o mas importante que otras lineas para que quieres satisfaccion o reconocimiento si puedes jugar bien y ganar? ohhhh espera tu eres de esas personas que necesitan todo el tiempo que les digan que lo estan haciendo bien para creer que de verdad lo estan haciendo bien? asi como existen mains en todas las lineas riot deberia incentivar el querer jugar supp y no poder a cualquier persona que ni ganas tiene.","replies":[{"poster":"WhiteMax","date":"2017-01-31T15:09:18.650+0000","up_votes":2,"down_votes":0,"body":"Eso ya lo hacen, desde hace meses han hablado de mejorar el Rol y hacerlo mas \"divertido\" para que la gente la juegue, ya vez el item \"redencion\" que todos lo usan ahora.","replies":[{"poster":"Gretta Thunberg","date":"2017-02-01T05:27:39.280+0000","up_votes":1,"down_votes":0,"body":"si item que nerfearon siendo que hay objetos y campeones mas rotos hasta habilidades","replies":[]},{"poster":"Liliths","date":"2017-01-31T22:43:16.131+0000","up_votes":1,"down_votes":0,"body":"Desde hace años*","replies":[{"poster":"WhiteMax","date":"2017-01-31T23:07:24.505+0000","up_votes":1,"down_votes":0,"body":"Desde hace meses porque hace años no hicieron nada jajaja.","replies":[{"poster":"Tutancadead","date":"2017-02-01T03:05:27.673+0000","up_votes":1,"down_votes":0,"body":"llevan años diciendo eso. Sin demasiado logros.","replies":[]},{"poster":"Liliths","date":"2017-01-31T23:21:48.959+0000","up_votes":1,"down_votes":0,"body":"Esta mucho mejor que antaño, pero no es suficiente :'v","replies":[]},{"poster":"Liliths","date":"2017-01-31T23:15:40.287+0000","up_votes":1,"down_votes":0,"body":"Hicieron un monton, el rol es mucho mejor antaño. Pero no es suficiente.","replies":[]}]}]}]}]},{"poster":"Mazer Rakham","date":"2017-01-31T16:24:13.827+0000","up_votes":1,"down_votes":0,"body":"Suelo jugar supp y me siento mucho mejor sabiendo que ayude a dar vuelta una TF, que impedí un gank, que salvé a la mayor parte de mi team, que inicié una TF en el momento justo, que la visión que yo puse en el mapa sirvió para mucho mas que el solo top que esta media hora de la partida tratando de tirar la primera torre o midlanner que se la pasa persiguiendo la kill para morir en el intento, incluso que el ADC que se cree que puede ir sólo 1vs5 (mains Vayne hablo de ustedes). Quien reconoce a un buen supp? aquellos que aprecian realmente el trabajo que hacemos y se dan cuenta de la importancia que tenemos. Esos que no les importa un ks que podría haber sido triple, cuadra o penta, mientras que la ventaja haya sido para tu team. Aquellos que pudieron escapar con 10 de vida por una curación y un poco de velocidad de movimiento. Los que notan que no te robaron ese dragón o barón gracias a un stun, ralentización o ulti.  Que tu no lo veas no quiere decir que el resto de las personas tampoco lo hagan. Pero bueno, se nota la mentalidad de \"me importa un carancho la visión yo sólo voy por la kill\"","replies":[{"poster":"Gretta Thunberg","date":"2017-01-31T19:06:48.037+0000","up_votes":1,"down_votes":0,"body":"yo igual he jugado de supp y he salvado culos pero yo no espero el reconocimiento por que? no lo hize solo el adc se posiciono bien, el asesino supo hacer el focus el top aguanta y mato una tf no se gana por 1 personas si no por las 5, no por que no me den reconocimiento voy a trolear y decir dime que lo hize bien o no juego? viejo si yo se que lo hice bien pos me basta y si ganamos genial","replies":[{"poster":"Mazer Rakham","date":"2017-01-31T22:42:41.793+0000","up_votes":1,"down_votes":0,"body":"Emmm, en muchas ocasiones no. Ponele, me han tocado ADC que los salvas por poco, porque se mandan 1 vs 2 (o mas) sin visión y con una fase de línea pésima, los cuales pensas: ¿¿En serio, no vez que estas a mano del Blitz que se acaba de meter en el bush al lado tuyo??. Es obvio que no se gana por una sola persona pero no por eso hay que menospreciar al supp como lo hace este tipo. Ya que si no fuera por los soporte, muchos se olvidan de la visión, por ejemplo. Y a lo que iba es que hay gente que reconoce a los supp, no como dice este tipo que NADIE RECONOCE el trabajo de un supp. Que no te aparezca un cartel que diga con bombos y platillos \"Pentassist\" no quiere decir que no sea valorado y reconocido. Un gj, un ty, dos siglas que generalmente aparecen en el chat cuando gracias al supp salio una buena jugada o alguien pudo escapar, eso es muchisimo mas de lo que podría pedir y ni siquiera hace falta. Porque yo se que ese Jhin  pudo sacar una doble gracias a mi, que mas a allá de haber errores en el gank el jg no murió o que pudimos hacer un Dragón a tiempo por la seguridad que te da la visión. Y esas cosas hacen que el rol de soporte sea, a mi entender, uno de los mas importantes, sino el mas. Aparte de ser divertido y darte la satisfacción de haber hecho un buen trabajo cuando sabes que lo que hiciste estuvo bien.","replies":[{"poster":"Gretta Thunberg","date":"2017-02-01T05:26:28.208+0000","up_votes":1,"down_votes":0,"body":"a eso va el tema en ningun momento menosprecie a los soportes ni el rol ni nada es mas si a mi me toca un supp bueno yo agredezco enserio por ejemplo hoy me toco un thresh que no era soporte el tipo se quedo a backear en un bush y murio solo por que estaba aburrido por que el no pidio soporte ganamos gracias al jarvan que me dejo alguna kills por que yo estaba mal en ningun momento lo flamee por que a pesar de que estaba aburrido pegaba buenos ganchos, despues el me empezo a flamear lo mutee y segui y intentaba calmar al j4 que estaba tilteadisimo.\n\ny con respecto a esto \" Y esas cosas hacen que el rol de soporte sea, a mi entender, uno de los mas importantes, sino el mas.\" amigo yo estoy completamente de acuerdo contigo es un rol tan importante que no cualquiera deberia jugarlo, quiza si bien para ser support se deja un poco de lado las mecanicas con ciertos campeones no digo con todos es necesario tener una vision de juego distinta, creeme que si tu ejemplo pones a un main azir a jugar de suport probablemente no de una por que? tiene manos esta claro usa a azir pero jugar se support ya no es una cosa de manos es cosas de tener esa vision que probablemente no tendra por eso digo que no cualquiera puede ir supp y el propio riot subestima el rol poniendo a cualquier gil en esa posicion.\n\nyo tengo suerte soy un suport medio regular, ya que conozco la linea de bot y tal pero hay gente que no tiene ni putisima idea en serio","replies":[{"poster":"Mazer Rakham","date":"2017-02-01T16:00:44.059+0000","up_votes":1,"down_votes":0,"body":"Creo que no entendiste, el comentario principal iba dirigido a Liliths","replies":[{"poster":"Gretta Thunberg","date":"2017-02-01T21:21:19.635+0000","up_votes":1,"down_votes":0,"body":"ahhh bueeeee disculpa pero esa es mi opinion","replies":[{"poster":"Mazer Rakham","date":"2017-02-02T00:16:42.322+0000","up_votes":1,"down_votes":0,"body":"Np, suele pasar que uno se equivoque. Mas o menos tenemos la misma idea de lo que es ser soporte. Lo que yo decía es que el usuario anterior menosprecia a los soportes. Sobre todo con eso de que no hay satisfacción ni reconocimiento en el rol.","replies":[]}]}]}]}]}]}]}]},{"poster":"9081913DEL1","date":"2017-01-31T12:15:39.129+0000","up_votes":2,"down_votes":1,"body":"Riot como toda empresa y como cualquier entidad de hecho, trata de contentar a la mayoria.\nLa mayoria no quiere esperar un dia entero para una mera partida, porque lo ven asi, como una partida mas.\n\nSaludos.","replies":[{"poster":"Gretta Thunberg","date":"2017-01-31T12:19:21.889+0000","up_votes":2,"down_votes":1,"body":"te entiendo pero viejo algo de criterio no? si le das un plano de un avion a un mono para que lo arme cuando se va a tardar? obviamente es un ejemplo pero a lo que quiero llegar es que riot deberia nose enseñar a que el rol de supp no como lo pintan todos hay que tener manos es mas para jugar de supp hay que ser bastante inteligente y ver lo que otros no ven por eso no se lo puedes dejar a cualquiera","replies":[{"poster":"9081913DEL1","date":"2017-01-31T12:28:29.515+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ammaru,realm=LAS,application-id=v7qsfXsE,discussion-id=Oxiuljy4,comment-id=00020000,timestamp=2017-01-31T12:19:21.889+0000)\n>\n> te entiendo pero viejo algo de criterio no? si le das un plano de un avion a un mono para que lo arme cuando se va a tardar? obviamente es un ejemplo pero a lo que quiero llegar es que riot deberia nose enseñar a que el rol de supp no como lo pintan todos hay que tener manos es mas para jugar de supp hay que ser bastante inteligente y ver lo que otros no ven por eso no se lo puedes dejar a cualquiera\n\nRiot no puede saber quien es mas monkey a la hora de ser soporte si tienen una linea main.\nPor eso deberian tener al menos dos offrolls viables.\n\nYo soy \"Decente\" en los 4 offrolls y soy un excelenter top. Para una liga menor a diamante por lo menos deberian tener 2 offrolls. Lo malo es que RIOT no puede obligar a hacer eso sin sacar echar gente a la vez.\n\nSaludos.\n\nP.D.: Juega en equipo y problema resuelto (?)","replies":[{"poster":"Gretta Thunberg","date":"2017-01-31T12:44:07.292+0000","up_votes":2,"down_votes":1,"body":"entonces si riot no sabe quien es buen o mal soporte no deberia dejarle supp a cualquiera a eso voy, si riot no puede obligar a la gente a que juegue todas las lineas no deberia dejarle a cualquiera support, por algo uno pide la linea que quiere ir yo no tengo problema soy main adc pero me ha tocado, top que es mi peor linea, jg que tambien no soy muy bueno y supp que ahi me manejo mejor pero aun asi no voy a trolear ni nada tengo mis picks e intento ganar si no es la linea la partida entonces yo de verdad espero lo mismo hacia a mi.\n\nPD: En solo q no puedo jugar en equipo","replies":[{"poster":"Americans","date":"2017-01-31T13:16:12.900+0000","up_votes":2,"down_votes":0,"body":"Sos bronce 2, si bien puede ser que te toquen soportes malos, vos tambien cometes errores, si no no estarias ahi. Concentrate en tus errores y no en tu equipo y vas a subir.","replies":[{"poster":"Gretta Thunberg","date":"2017-01-31T19:09:42.212+0000","up_votes":1,"down_votes":0,"body":"sisisis cometo errores como cualquiera pero yo tengo dominio de los campeones, me refiero a alguien que no usa a blitz va a tirar la q y la va a fallar y todo el tiempo lo mismo pero un main no si ve que esta fallando la q va a sonear amenazar con la q y va a iniciar con la e y despues la q a eso me refiero","replies":[]}]}]}]}]}]},{"poster":"Maycoltf2","date":"2017-01-31T12:05:12.931+0000","up_votes":1,"down_votes":1,"body":"Si te tocan personas que no saben jugar soporte , deberías tu asegurar jugar ese rol o buscate un duo para que sea tu soporte.","replies":[{"poster":"Gretta Thunberg","date":"2017-01-31T12:10:51.646+0000","up_votes":2,"down_votes":1,"body":"viejo no, por que cuando a mi me toca ir supp lo hago y voy con todas las ganas para ganar y nisiquiera pongo supp me toca por el comodin y voy entonces yo espero de verdad lo mismo para mi o no?\n\ny tampoco quiero un duo ya que de que sirve si el adc se feedea si un hecarin 0/5 igual te revienta actualmente como va el meta a mi no me conviene tener de supp un premade, prefiero que mi premade valla mid o top o jg y asi hay 2 feeds en el equipo yo solo pido supports decentes que si van bardo pockeen con la pasiva de bardo y no se queden atras riendose por como mueres, que se tiran la ulti a ellos mismo en vez de intentar salvar al carry eso pido gente con ganas de jugar support no gente que ya le da lo mismo perder cuando juegan de supp","replies":[{"poster":"Mazer Rakham","date":"2017-01-31T16:13:20.595+0000","up_votes":1,"down_votes":0,"body":"Si tenes un duo bot, aseguras tu línea, sabes cómo juega y tu dúo sabe cómo jugas vos. Sabes que si se cometieron errores fueron eso, errores, no trolleadas de un tipo enojado porque no quería ir supp. Tenes mejor comunicación, mas coordinación y le aseguras a un supp tener un buen ADC al cual proteger y hacer peel.","replies":[{"poster":"Gretta Thunberg","date":"2017-01-31T19:11:43.880+0000","up_votes":1,"down_votes":0,"body":"entiendo pero de que sirve ya pasada la fase de linea que yo vaya feed si un heca puede matarme facilmente, ten en cuenta que actualmente en este meta los adc son bosta, y si yo como adc soy el unico feed creeme que no le doy ninguna seguridad a mi equipo prefiero que mi premade sea mid top o jg asi ya hay 2 feeds o almenos que se yo 1 darius feed que pesa 10 veces lo que un adc feed a menos que sea vayne","replies":[{"poster":"Mazer Rakham","date":"2017-01-31T22:26:05.821+0000","up_votes":1,"down_votes":0,"body":"Con saber posicionarse un ADC feed hace maravillas, sobre todo si el  resto del team lo protege. Un Draven feed es un dolor de cabeza para cualquiera, por ejemplo","replies":[{"poster":"Gretta Thunberg","date":"2017-02-01T05:39:52.439+0000","up_votes":1,"down_votes":0,"body":"si pero yo intento sacar carrys o con burst, {{champion:22}} {{champion:29}} o con rango {{champion:222}}  por que  claro yo puedo confiar en el posible kiteo o posicionamiento pero yo no se si me equipo me va a defender prefiero ir a lo seguro.\n\npor ejemplo con la rata me hago invisible con la ult deleto a el supp y adc rival y muero pero ei es worth dejo a mi equipo sin daño y utilidad y un posible 4 vs 3","replies":[]}]}]}]}]}]},{"poster":"Tutancadead","date":"2017-02-01T03:09:52.863+0000","up_votes":1,"down_votes":0,"body":"Amigo estas viendo alreves el problema.","replies":[{"poster":"Gretta Thunberg","date":"2017-02-01T05:40:18.075+0000","up_votes":1,"down_votes":0,"body":"Por que?","replies":[{"poster":"Tutancadead","date":"2017-02-01T11:34:50.891+0000","up_votes":1,"down_votes":0,"body":"El problema no es que Riot los subestime.\nEl problema son los jugadores.","replies":[{"poster":"Gretta Thunberg","date":"2017-02-01T12:24:04.667+0000","up_votes":1,"down_votes":0,"body":"el problema es que riot quiere que esperemos lo menos posible con gente que no sabe jugar el rol, main supp hay y gente que los juega sin ser main tambien entonces por que no esperar? por que yo dudo que mejorando el rol o haciendole el rework mas gente  empieze a jugar supp, ya le hicieron un rework a zyra que quedo rotisima en la linea de bot y siguen habiendo los mismos main supp rito tiene que hacer algo mas","replies":[{"poster":"Tutancadead","date":"2017-02-01T13:23:55.126+0000","up_votes":1,"down_votes":0,"body":"Zyra fue un rework para ir mid (rework de magos). Que siga rindiendo en la lina de support da que pensar sobre los otros support.\n\nPero ese no es el tema aqui. El tema aqui. El tema principal es que cerca del 90% de la comunidad no quiere ir support. Lo que se traduce en colas lo suficientemente largas para llenar el foro de post quejándose de lo largo. Por lo que no es algo \"viable\" esperar al Support.\n\nSobre el Rework en la linea. Ya lo hizo una ves. Personalmente fue un desastre pero no se si rindió mucho.\nHay que cambiar mucho de la lógica de la lina de Support. Realmente tiene MUCHOS errores. Básicamente la linea es como jugar otro juego  (¿Que hago mientras mi adc farmea?¿Por que festejan las Kill y yo no puedo tener kills?¿Si es importante farmear por que yo no?¿Me puedo fedar?)","replies":[{"poster":"Gretta Thunberg","date":"2017-02-01T13:49:24.688+0000","up_votes":1,"down_votes":0,"body":"un supp si se feedea viejo, con asis si te gusta el rol de suport sabras que las kills te sirven pero no tanto, por eso los items de supports son relativamente baratos, el farm es para el adc ya que los items de daño cuestan mucho mas que los supports, ten en cuenta que si adc no farmea bien se queda atras muy rapido.\n\nlas asistencias son las kills de los supp, y el feed se ve en la utilidad que puedes dar a tu equipo el rol es demaciado importante viejo en serio por eso a mi parecer cualquier persona no deberian de asignarle support ten en cuenta que el support puede decidir una tf.\n\ncon respecto a los del 90% riot tiene que hacer algo mas que un rework, si mejoran a los supp solo los main supp se veran beneficiados por lo que esta muy bien pero no llegara mas gente motivada al rol, ten encuenta que cuando empiezas a jugar te hacen un tutorial con ashe de como farmear, tener kills y como botar torres entonces eso debe cambiar","replies":[{"poster":"Tutancadead","date":"2017-02-01T15:18:55.727+0000","up_votes":1,"down_votes":0,"body":"El support no se feda. Juege bien o mal, se termina armando igual.\n\nDe lo que te hablo es precisamente del Tutorial. El Tutorial te enseaña como \"NO ser support\" y que Ser support esta mal. Por que todo lo que te enseña es lo que el support no hace.\nEl juego sigue el Tutorial en gran medida.","replies":[{"poster":"Gretta Thunberg","date":"2017-02-01T21:20:04.910+0000","up_votes":1,"down_votes":0,"body":"por eso rito tiene que incentivar de alguna manera a que le gente juegue mas de supp, viejo si yo empiezo a jugar lol y me ponen a ashe cuando juegue contra usare a ashe es por inercia eso","replies":[{"poster":"Tutancadead","date":"2017-02-01T21:58:19.012+0000","up_votes":1,"down_votes":0,"body":"Eso sí ignoramos que el juego festeja las rachas de asesinatos y las contabilidades. Cuando el support se supone que no mata.","replies":[]}]}]}]}]}]}]}]}]}]}