{"poster":"Gretta Thunberg","date":"2018-06-19T00:14:10.232+0000","title":"Hipercarrys","subforum":"Jugabilidad, balance y narrativa","up_votes":15,"down_votes":1,"body":"Cuando riot hace unos meses escribio un post sobre que queria darle mas &quot;oportunidad&quot; a la botlane no pense que iban a dejar tan pero tan mal a los hipercarrys.\r\n\r\nYo sabia que los hipercarrys no estaban bien pero ahora dejaron de hacer su trabajo, las builds son muy caras y a los tanks los curas literal, tienes que salir 10/0 de la linea para poder hacer algo. Por que les molestaba tanto el da&ntilde;o de los adc? si todos los bruiser con su item core ya deletean, osea la trinidad.\r\n\r\nAcaso antes de nerfear a todos los hipercarrys se dieron cuenta el da&ntilde;o que aplica camille con el da&ntilde;o verdadero de la q? o que campeones como irelia o aatrox solo necesitan 2 items de da&ntilde;o y los demas tanks para reventar? acaso eso eso es balance? \r\n\r\nTankes haciendo da&ntilde;o? por que riot si no tienen items de da&ntilde;o solo defensas.\r\n\r\nY como dije antes los adc ahora no bajan tankes que esa era su principal caracteristica. gracias riot espero de todo corazon que como compa&ntilde;ia no seas tan egolatas como para no admitir su error.","replies":[{"poster":"ed9 ","date":"2018-06-19T00:30:21.191+0000","up_votes":9,"down_votes":2,"body":"Yo sigo sin entender por que le bajan el daño a los adc (que se supone que es su función), pero no a los tanques/colosos.\n\nTienen todos ítems de vida/resistencias y aún así te meten terrible daño.\n\nEncima que vos no los podes bajar, ellos te matan a vos teniendo 0 ítems de daño. Ridículo. {{champion:14}} {{champion:36}} {{champion:516}} ","replies":[{"poster":"DIOS TUTI","date":"2018-06-19T00:33:35.400+0000","up_votes":11,"down_votes":1,"body":"> [{quoted}](name=ed9 ,realm=LAS,application-id=xQmJPO8F,discussion-id=3VI0MVYn,comment-id=0001,timestamp=2018-06-19T00:30:21.191+0000)\n>\n> Yo sigo sin entender por que le bajan el daño a los adc (que se supone que es su función), pero no a los tanques/colosos.\n> \n> Tienen todos ítems de vida/resistencias y aún así te meten terrible daño.\n> \n> Encima que vos no los podes bajar, ellos te matan a vos teniendo 0 ítems de daño. Ridículo. {{champion:14}} {{champion:36}} {{champion:516}}\n\nson los 3 que quedaron rotos XD, los demas no sirven mas.","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T01:48:01.087+0000","up_votes":1,"down_votes":0,"body":"Darius no es denominado tank si no coloso pero su itemizacion es muy parecida, tiene sustain, daño y aguante\n\nLos bruiser obtienen su power spike con un item en top, en jg su power spike empieza con el item de jg ya seas ad o ap","replies":[]}]}]},{"poster":"Hide on Manteca","date":"2018-06-19T04:31:46.603+0000","up_votes":7,"down_votes":0,"body":"me parece que buffear a los hypercarrys de critico dejaría al juego en exactamente el mismo meta anterior en la que el juego se decide por que botlane esta mas feed.\n\nel problema no es que los adc estén débiles, porque en números  deberían de pegar mas a full build a un tanke, el problema que estamos en una meta de early, los juegos se deciden en 15-24m y se terminan en 27-38m dependiendo del elo, no podes hacer buena un rol que se supone es rey en late, tener tambien un buen early-mid, porque le quita totalmente el sentido a todos los campeones de early-mid, así es como era la meta anterior, 3 tanques + arden sup y el adc que con 2 items deleteaba de 2 basicos.\n\nahora las cosas cambiaron, todas las lineas tienen el mismo impacto en el juego, no es que bot ya no sirve, ES QUE ESTABAN ROTOS, si no me crees a mi, dopa y gran parte de jugadores de d+ acuerdan con lo mismo.\n\nen este momento bot es muy parecido a lo que siempre fue top lane, yo como main top me acostumbre a saber que en mi linea pueden haber tankes, bruisers, magos, adc y una que otra soraka ap, pero no me quejaba ya que sabia que yo podía pikear lo que se diera la gana también, los adc deberían hacer lo mismo, entender a counterpickear una composición de bruiser-sup,  el juego no debe orbitar a un solo rol, no es sano, sean asesinos, adc o tankes.\n\nademas, en bot siempre eran 3 pick que estaban fuertes y el resto de adc eran injugables: miss-jhin-varus con la letalidad, cait-trist-twitch con el critico, varus, kog y kaisa con el on-hit, y ahora adc con spikes de un item , así siempre funciono el meta de bot.","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T19:36:28.604+0000","up_votes":1,"down_votes":0,"body":"Una cosa es intentar \"abrir\" la botlane para otros campeones o la otra es nerfear de tal manera el critico que ya es injugable, por que mejor no hicieron las cosas bien y eliminan el critico y lo reemplazan por otra estadistica exclusiva para tiradores? \n\nSi me hablas de meta quiza no todos eran god tier, pero si es verdad que ashe era jugable con la build de utilidad y era bastante decente, lo mas bajo diria yo que era lucian por el poco rango pero todos los tiradores eran una opcion. ahora ni eso jugar un hypercarry es como trolear asi tal cual.\n\nhoy teniendo hoja del rey, recuerdos de lord y cimitarra no podia bajar al rammus rival, es mas me bajaba mas rapido la vida a mi que a el, entonces donde esta el verdadero problema? por que de aguantar vaya que si lo hacia pero a cambio yo despues de pegarle 5 segundos quedaba con 50% de la vida teniendo dos item de robo de vida.\n\nEntonces ahora sin hipercarrys como quieren que bajemos a los tanks si tampoco nerfean estos?","replies":[{"poster":"Hide on Manteca","date":"2018-06-20T01:07:35.027+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=BabyGr00t,realm=LAS,application-id=xQmJPO8F,discussion-id=3VI0MVYn,comment-id=00090000,timestamp=2018-06-19T19:36:28.604+0000)\n>\n> 1) Una cosa es intentar &quot;abrir&quot; la botlane para otros campeones o la otra es nerfear de tal manera el critico que ya es injugable, por que mejor no hicieron las cosas bien y eliminan el critico y lo reemplazan por otra estadistica exclusiva para tiradores? \n>  \n> 2 )Si me hablas de meta quiza no todos eran god tier, pero si es verdad que ashe era jugable con la build de utilidad y era bastante decente, lo mas bajo diria yo que era lucian por el poco rango pero todos los tiradores eran una opcion. ahora ni eso jugar un hypercarry es como trolear asi tal cual.\n> \n> 3) hoy teniendo hoja del rey, recuerdos de lord y cimitarra no podia bajar al rammus rival, es mas me bajaba mas rapido la vida a mi que a el, entonces donde esta el verdadero problema? por que de aguantar vaya que si lo hacia pero a cambio yo despues de pegarle 5 segundos quedaba con 50% de la vida teniendo dos item de robo de vida.\n> \n> 4 )Entonces ahora sin hipercarrys como quieren que bajemos a los tanks si tampoco nerfean estos?\n\n1: no es in-jugable, ahora ie esta especializado en matar tanques, ya no es super eficiente como primer item y contra todo el mundo\n\n2: perdona pero para los juagdores de elo alto de korea ( y esto lo podes chequear vos mismo en op.gg) los casi todos los adc de critico tienen un wr de 50% y se siguen jugando, si fuera trollear nadie los tocaria.\n\n3: se llama counter-pick, si rammus no puede tanquearse el daño de un adc lo suficiente para matarlo seria un completo fracaso debido a que es su funcion primaria como tanque anti-ad \n\n4: llegando a late-game, comprando 3 items de critico YA HACES MAS DAÑO, la pasiva del 15% de daño verdadero en critico es mejor que el 50% de daño critico extra si el enemigo tiene mas de 150 de armadura (maokai a lv 18 tiene 107 sin items), asi que si no matas a los tankes a esa altura del juego el trabajo lo estas haciendo mal vos.","replies":[]},{"poster":"Marcset","date":"2018-06-19T21:58:57.053+0000","up_votes":2,"down_votes":0,"body":"Pero si rammus es un campeon pensado específicamente para hacer eso, antes era exactamente lo mismo, ponerte a pegarle a un rammus siendo adc era querer morir, mas si te comias el taunt","replies":[]}]}]},{"poster":"Nabuze","date":"2018-06-19T04:36:38.348+0000","up_votes":4,"down_votes":1,"body":"Los adc no estaban bien, la funcion de estos es hacer daño por segundo pero lo que hacian anteriormente era burstear que es el trabajo de un asesino.\nAhora los adc pertenecen al late, el que no lo juega es porque quiere ganar en early pero si la partida dura lo suficiente para que escalen pegan muy bien los adc.\nDe igual forma ya estan viendo formas para que no se sienta tanto que sean tan de late, van a ir buffeando items de a poco para no dejar que los adc vuelvan a ser lo unico viable en bot, si te gusta mucho el rol de ttirador de momento juga draven, kaisa, ezreal, kogma, lucian esos andan bien por ahora.\npor mas que odiemos que los tanques peguen, pegan porque si no pegaran nadie les prestaria atencion.\n\nNo te quejes de los pobres bruisers que estuvieron fuera del meta por 4 meses y los adc llevan solo 1 parche estando mal y ya estan viendo como ayudarles :/.\nLas demas lineas sufrimos infinidad de cambios y nos adaptamos en torno a esos cambios pero los botlaners le nerfean o le mueven el meta y se ponen en actitud derrotista como si se les viniera el mundo abajo, y esos directores tecnicos o no se que sean de los equipos profesionales en vez de poner en la banca a sus tiradores profesionales hasta que se acomode el parche y meter jugadores que hayan practicado lo que esta en el meta anteriormente nooo ponen al pobre tirador profesional a jugar jannas o magos.\n\nAntes de este cambio drastrico todo giraba en torno al adc (por varias season) ahora es lo opuesto pero a se va acomodar no te preocupes van solo 1 o 2 parches ","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T19:47:09.940+0000","up_votes":1,"down_votes":2,"body":"Amigo usa a caitlyn o jinx en una partida ranked a ver si te atreves a perder.\n\ny veras lo que te digo, si quisiera usar bruiser seria top o jg y no adc, por algo me gusta jugar de adc por que encuentro que tienen algo diferente al resto, mas mecanicas y kitear. \n\nA los adc los dejaron inutiles literal, de que te sirve un filo del infinito contra un yi? y de que te sirve tener dos objetos de criticos con el filo si al sumar todo te dan 120% de critico cuando el cap es 100% aparte de que le subieron el oro a estos objetos por que si, no dan ninguna estadistica mas. amigo piensa en todos los baches que existen. \n\nTe doy algunos.\n\nNerfean el critico pero no nerfean el randuim. hipermega nerf para los adc \n\nCosto de oro mayor sin ninguna alguna otra estadistica. \n\nNuevo item el cual te da un critico cuando dejas de atacar, teniendo en cuenta que los adc atacan en rafaga que sentido tiene?\n\nFilo, paso de ser core o situacional, totalmente inviable de primer item, la receta es muy incomoda, el hecho de armarse con dos espadon no te da lugar a improvisar cuando tienes que backear antes.\n\nEnserio piensalo, si no usa a un cait o jinx en rankeds y te daras cuenta","replies":[]}]},{"poster":"Este NoEs Suareh","date":"2018-06-19T01:09:25.477+0000","up_votes":2,"down_votes":0,"body":"Así estamos, no voy rankear con este meta en la botlane. Con estos cambios ridiculos que hubo la midlane y botlane son cualquier cosa, supuestamente para favorecer la diversidad pero ahora un par de estrategias nuevas dominan esas lanes y solo unos pocos champs normales en esas lanes son viables.","replies":[{"poster":"Jeremías 17 5","date":"2018-06-19T18:56:01.941+0000","up_votes":2,"down_votes":0,"body":"Taric/Yi, Karthus/Nunu, Kayle/Yi, Lulu/Twitch... Asco dan esas combinaciones. Totalmente antifun y toxicas.","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T19:39:23.151+0000","up_votes":1,"down_votes":0,"body":"Son composiciones para ganar partidas al minuto 15, Bang (tirador de SKTT1) lo dijo en 50 partida jugabas con este \"nuevo\" meta el sabe cuando una partida se acaba en el minuto 15, llega un punto en el que el yi tiene tanto farm y tanto nivel que deletea y sabes que la partida esta perdida.\n\nPor alguna razon riot ve normal que un yi tenga 200 de farm al minuto 11 pero le molestan los hipercarrys","replies":[]}]},{"poster":"Doca","date":"2018-06-19T01:47:51.012+0000","up_votes":1,"down_votes":0,"body":"yo no estoy jugando rankeds y es mas, soy main sup y adc, pero ahora estoy jugando jg para poder carrear","replies":[]}]},{"poster":"Uli con azúcar","date":"2018-06-19T01:39:26.929+0000","up_votes":1,"down_votes":0,"body":"Es por el competitivo. Los tiradores dominaban demasiado.","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T04:27:56.479+0000","up_votes":2,"down_votes":0,"body":"Riot deberia saber que competitivo no es igual a solo q, obviamente una botlane va a dominar por sobre otra si el duo es mejor que el otro.\n\nPero en solo q es totalmente distinto, el 80% de la veces juegas con un soporte que no conoces y asi tienes que sacar la linea adelante","replies":[{"poster":"Squealer","date":"2018-06-19T08:21:55.470+0000","up_votes":1,"down_votes":0,"body":"A riot le importa 3 carajos el solo Q, lamentablemente.","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T19:37:27.376+0000","up_votes":1,"down_votes":0,"body":"La verdad es que si es una real pena, es increible que siendo su juego no sepan que entre el competitivo y el solo q existe una galaxia de diferencia","replies":[]}]}]}]},{"poster":"LGBT Valentina","date":"2018-06-19T01:17:19.268+0000","up_votes":4,"down_votes":2,"body":"Hyper carry?\n\nSi los game terminan al min 7-10. ¿Que hablas de 40+ min? xD","replies":[]},{"poster":"Patriicio rey","date":"2018-06-19T00:20:05.296+0000","up_votes":2,"down_votes":1,"body":"A mi me sigue pareciendo igual los hypercarrys, hoy mismo jugue una ranked, nos gankearon entre 4, nos mataron y nos tiraron la torreta asique perdimos la línea, llego el late (yo era vayne) y me hice un Penta obviamente posicionandome bien atrás, desde mi punto de vista veo igual el juego jugando con vayne","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T00:29:12.742+0000","up_votes":1,"down_votes":0,"body":"Obvio vayne con la build de hora no es tan critico dependiente pero otros hiper carrys si","replies":[]}]},{"poster":"Unbanned Bastard","date":"2018-06-19T00:57:56.993+0000","up_votes":1,"down_votes":4,"body":"Yo creo que el balance de ahora está bien, por el siguiente motivo.\n\n¿Qué es lo que Riot ha estado intentado desde la salida de gnar/ekko aproximadamente?\n\nLo que Riot quiere es flexibilidad a la hora de jugar tanto lineas como campeones, y aunque todavia no lo logren van por un buen camino. Es cosa de ver un poquito al pasado en el primero rework de los adc (Preseason 6) y ver como cambió ese parche todo el meta, dejando de lado por completo a los tankes e incluso incorporando a graves a la jungla y dejandolo obsoleto de adc, ahora lo que me preocupa a mi es ¿Que pasará con los hipercarrys? Yo personalmente creo que Riot tiene algo planeado, no sé el que pero algo debe tener algo en mente, si me preocupa pero me gusta el meta actual por poder jugar lo que quieras donde quieras casi de forma literal.\n\nSaludos :)","replies":[{"poster":"RNGesus","date":"2018-06-19T02:24:23.202+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=El Tatán,realm=LAS,application-id=xQmJPO8F,discussion-id=3VI0MVYn,comment-id=0002,timestamp=2018-06-19T00:57:56.993+0000)\n>\n> Yo creo que el balance de ahora está bien, por el siguiente motivo.\n> \n> ¿Qué es lo que Riot ha estado intentado desde la salida de gnar/ekko aproximadamente?\n> \n> Lo que Riot quiere es flexibilidad a la hora de jugar tanto lineas como campeones, y aunque todavia no lo logren van por un buen camino. Es cosa de ver un poquito al pasado en el primero rework de los adc (Preseason 6) y ver como cambió ese parche todo el meta, dejando de lado por completo a los tankes e incluso incorporando a graves a la jungla y dejandolo obsoleto de adc, ahora lo que me preocupa a mi es ¿Que pasará con los hipercarrys? Yo personalmente creo que Riot tiene algo planeado, no sé el que pero algo debe tener algo en mente, si me preocupa pero me gusta el meta actual por poder jugar lo que quieras donde quieras casi de forma literal.\n> \n> Saludos :)\n\neso de la flexibilidad nunca va a existir mientras existan mejores campeones que otros, la gente siempre va a buscar lo mas fuerte y eso es lo unico que se va  a jugar.","replies":[{"poster":"Unbanned Bastard","date":"2018-06-28T02:21:55.121+0000","up_votes":1,"down_votes":0,"body":"Sé que te respondo tarde pero no estuve en mi casa.\n\nVerás, existen diferencias entre el metagame y la flexibilidad, uno es lo que más rinde y lo otro seria las cosas que se pueden hacer. Mirando la bot lane ahora mismo son viables un montón de campeones y combinaciones pero como siempre y en todas las lienas existe el meta, osea los champs más fuertes que otros.\n\nLa flexibilidad existe a la par que el meta, al menos por ahora.","replies":[]}]},{"poster":"Doca","date":"2018-06-19T01:50:14.204+0000","up_votes":1,"down_votes":0,"body":"claro, pero por lo menos para mi y para la mayoria de los profecionales (no es que me este comparando XD) es horrible este meta, lo dijo bang sin ir mas lejos","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T20:01:10.578+0000","up_votes":1,"down_votes":0,"body":"Es horrible por que primero.\n\nRiot te obliga a jugar algo que no te gusta, por que dejaron inutiles a los campeones que te gustan.\n\nSegundo.\n\nLos soportes en mid hacen que el yi tenga 200 de farm en el minuto 11 con 2 y medio listos y sacando 3 o 4 niveles al otro equipo, sabes que esa partida la vas a perder al minuto 15 por que el yi es imparable que hermoso meta","replies":[]}]},{"poster":"Gretta Thunberg","date":"2018-06-19T01:54:20.186+0000","up_votes":1,"down_votes":0,"body":"Exacto pero a eso voy, riot te dice que abrira la botlane a todos los campeones pero nerfea de tal manera a los adc para que no puedas ocuparlos","replies":[]}]},{"poster":"EsPawnJota","date":"2018-06-19T13:00:26.285+0000","up_votes":1,"down_votes":0,"body":"Veo mucha gente aca diciendo que los tanques estan muy fuertes. La verdad no se de donde lo sacan, lo que esta fuerte son los bruisers, los tanques estan completamente inutiles en mi opinion (salvo ornn y mundo).\n\nIrelia esta rota del culo, ese champ saca trinidad y olvidate de tu team.\n\nVlad saca dos items y tu backline no existe mas.\n\nA parte siempre tengo un alistar metido en el orto ahroa si quiero jugar adc, gracias a los nerfs a los enchanters. \n\nLiteralmente si no jugas Ez, Lucian o Kaisa te la debo porque te deletean en 0,00002 segundos.","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T19:56:06.375+0000","up_votes":1,"down_votes":0,"body":"Exactamente eso es lo que pienso, irelia esta super broken pero no la tocan, yi de teoria es dps, pero una q te saca la mitad de la vida, entonces wtf riot, o balanceas todo el game de una o no haces nada y dejas todo roto por que de verdad aburre tener que usar bruiser en bot","replies":[{"poster":"EsPawnJota","date":"2018-06-19T22:33:17.618+0000","up_votes":1,"down_votes":0,"body":"U si yi es otro, con esa Runa nueva que le deja estaquear el guinsoos rapidisimo te evapora el hdp.","replies":[]}]}]},{"poster":"Arsig","date":"2018-06-19T05:47:52.471+0000","up_votes":1,"down_votes":0,"body":"Yo aproveche este parche para divertirme con amigos probando combos y nos reimos bastante , siempre pasa algo en el meta , hay momentos que los tanques estan fuertes , otros momentos que los bruisers , otros los asesinos , magos , etc etc , van cambiando con los parches y seguro que riot ya lo solucionara pronto como siempre pasa.\nY si la caga , pero este nerf a los tiradores fue porque anteriormente el que tenia la mejor bot lane solía ganar las partidas , sin que las demas lineas tuvieran tanto impacto , pero si , la cagaron con el nerf tan tan bestia , pero como ya dije es cuestión de tiempo para que lo arreglen , yo aprovechare a seguir probando combos raros en bot , han probado leona + Ornn? son como 6 stunes seguidos jajajajajaja , suerte compañero {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T19:58:33.818+0000","up_votes":1,"down_votes":0,"body":"Yo a mi team le propuse la cochinada de probar yi+taric pero tenemos miedo de morir de vih Kappa","replies":[]}]},{"poster":"Jaime Lannisterr","date":"2018-06-19T12:04:40.475+0000","up_votes":1,"down_votes":0,"body":"Lol, no se que juegas pero yo no veo que los ADC estén completamente nerfeados como marcas, simplemente le cortaron ese mal chiste de que se vaya solo por la linea y se haga una penta con dos básicos. Si los que jugaran ADC ahora dejaran de ir solos y fueran acompañados por el equipo, además de que tengan un buen posicionamiento, tendrían el mismo impacto que antes. ¿Te quejas por qué no podes matar de dos básicos? Ve y juega con tu equipo, después de todo un ADC es Daño por Segundo (DPS) no BURST por segundo.","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T19:56:53.317+0000","up_votes":1,"down_votes":0,"body":"Te invito a que juegues caitlyn ;) veras como bajas a los tanks Kappa","replies":[]}]},{"poster":"Mascheranox","date":"2018-06-19T01:28:47.879+0000","up_votes":1,"down_votes":0,"body":"ya no se puede suportear bien a los adc, los deletean muy facil","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T01:48:58.322+0000","up_votes":1,"down_votes":0,"body":"SIempre se ha podido deletear facil a los adc, la diferencia es que antes podias bajar a los tanks,","replies":[{"poster":"Mascheranox","date":"2018-06-19T13:16:16.556+0000","up_votes":1,"down_votes":0,"body":"antes tenias mas item para suportear ahora no hay casi nada","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T19:54:21.580+0000","up_votes":1,"down_votes":0,"body":"Y antes los adc hacian daño lo cual hacia mas facil suportear igualmente, la botlane es de dos","replies":[]}]}]}]},{"poster":"Visoka","date":"2018-06-19T16:21:41.930+0000","up_votes":1,"down_votes":0,"body":"Tanta gente alegando que no son capaces de matar a un tanque con un adc con 2 ítems... lo único que me imagino al leer eso es que ni siquiera saben kitear LUL\n\nLos hypercarry con sus 3+ ítems siguen reventando en late, que ahora no bursteen como antes es otro tema, además el nuevo filo da daño verdadero (tank meta lul), el tema es que casi cualquier otro tipo de champ llega antes a un power spike decente y según yo jugar con una bot de bruisers o tanques con una cadena de cc igual era viable antes del 8.11 porque esos champs siempre han tenido mas daño y stats base que un adc promedio, pero obviamente se tomaba jugar esto como troll (draven debe ser de los mas hard counters de las bots melee).\nYo con los cambios a los ítems de crítico ya soy feliz, he jugado varios mobas y en todos esta 'mecánica' da problemas.\nSi buffan a los adc de críticos sus daños base-habilidades, etc me pareciera correcto mientras no vuelva el filo anterior.\n\nPD: Y si, los tanques tiene mucho daño base, como toplaner es horrible cuando vas con un bruiser (que no sea darius) y por X motivo el tanque obtiene alguna ventaja... no le puedes hacer 1v1 hasta que tu tengas 2 ítems xD","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T19:53:43.671+0000","up_votes":1,"down_votes":0,"body":"A eso voy, si una irelia o camille con trinidad ya revientan campeones que problemas tienen con los adc? en este juego todo esta desbalanceado pero por alguna razon siempre riot carga la balanza contra los tiradores ni idea por que.\n\nEl filo del infinito es una real caca principalmente por la receta, aparte de que te sirve el daño verdadero contra un asesino? o un yi que ahora es meta de nada, es un item que obligatoriamente se tiene que sinergizar con otro o si no pierdes la mitad del item, que otros campeones tienen este problema? o acaso camille tiene que comprarse la hydra voraz para utilizar la pasiva de la trinidad?","replies":[]}]},{"poster":"Jeremías 17 5","date":"2018-06-19T18:52:15.342+0000","up_votes":1,"down_votes":0,"body":"Lo primero que deberían nerfear, antes que nada, son las Tabis de Ninja. Es un item demasiado barato, demasiado bueno y extremadamente roto vs campeones de autoataque. Un tanque con Tabis ya se puede tanquear a los ADC, y los ADC no le hacen ni cosquillas por casi el mismo precio de compra de las tabis (Picacha y una espada larga). Después es balancear el tema de los items de vida/resistencia, si da vida que no de 50/55/60/70/80 de armadura/mr. Porque de por si la vida ya te hace algo tanky, agregale a eso la reducción de daño de la armadura/MR y tenes un campeón con 150 de armadura y 2000 de vida con 2 items. Y por ultimo, reducir el daño base de los tanques en mid/late game, así obligarlos a comprar algo de daño para mantenerse sin ser ignorados o que su utilidad no sea el daño sino el CC.","replies":[{"poster":"Gretta Thunberg","date":"2018-06-19T19:48:49.637+0000","up_votes":1,"down_votes":0,"body":"El tema es que riot hace tiempo ya viene en contra de los tiradores y es una realidad.\n\nSi hoy en dia se estan usando magos, bruiser y tanks en la botlane no es por que seas mejores, es por que riot dejo totalmente inutilizables a los hipercarrys","replies":[]}]},{"poster":"RNGesus","date":"2018-06-19T02:19:23.989+0000","up_votes":1,"down_votes":0,"body":"Es horrible, si en el team enemig hay 2 tanks o mas y tu adc es un hypercarry perdistes automaticamente la partida, solo sirven estos {{champion:21}} {{champion:81}} {{champion:145}} {{champion:236}}  , si pickeas otra cosa estas trolleando y queres perder.","replies":[{"poster":"DIOS TUTI","date":"2018-06-19T09:00:02.878+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Protocinturonga,realm=LAS,application-id=xQmJPO8F,discussion-id=3VI0MVYn,comment-id=0008,timestamp=2018-06-19T02:19:23.989+0000)\n>\n> Es horrible, si en el team enemig hay 2 tanks o mas y tu adc es un hypercarry perdistes automaticamente la partida, solo sirven estos {{champion:21}} {{champion:81}} {{champion:145}} {{champion:236}}  , si pickeas otra cosa estas trolleando y queres perder.\n\ncualquier cosa.","replies":[]},{"poster":"Gretta Thunberg","date":"2018-06-19T04:26:07.114+0000","up_votes":1,"down_votes":0,"body":"La verdad es que tienes toda la razon.\n\nHoy pickee a cait queriendo pensar que no estaban taaaaaaan mal, sali de linea 3/0 y con farm bastante bueno, pero al atrox rival no lo tocaba, no tenia ningun item defensivo y le curaba lo mismo a la irelia y que te digo de ornn a ese si que le daban escudos mis basicos. Me parecio increible ver que no tenia daño.\n\nBueno daño tenia por los item pero no pegaba","replies":[]}]},{"poster":"Sir Crucifix ","date":"2018-06-19T01:12:23.122+0000","up_votes":1,"down_votes":0,"body":"ayer creo fui VI daño por supuesto asi con vida , y el otro saco un ornn y me reventaba , le saque  hoja del rey para curacion y lastimarlo , no el tipo tranqui me mataba con WARMOG , Gente !!! un ornn con warmog haciendo el mismo daño y mas que yo con trinidad y hoja del rey","replies":[{"poster":"Doca","date":"2018-06-19T01:47:01.282+0000","up_votes":1,"down_votes":0,"body":"la warmog solo te regenera vida fuera de combate, y la hoja del rey hace daño en funcion de la vida maxima del objetivo, no mete ningun tipo de sangrado/corta curaciones\n\npor cierto que te maxeaste? por que si te maxeas la W no deberias de tener mucho problema (no se te no recuedo bien como funcona la W de VI, hace tiempo q no la juego)","replies":[{"poster":"New Misaya ","date":"2018-06-19T06:26:49.716+0000","up_votes":1,"down_votes":0,"body":"el max de vi es q+w si hay 2 o 3 tank q+e si son todos blanditos","replies":[]}]}]}]}