{"poster":"Gretta Thunberg","date":"2017-04-17T19:25:56.657+0000","title":"Enserio Riot?","subforum":"Charlas Generales","up_votes":1,"down_votes":13,"body":"Estoy a una partida pero viejo a una partida de llegar a la promo para oro v y me tirar al yasuo supp troll? Wtf riot enserio wtf","replies":[{"poster":"Rebkans","date":"2017-04-17T19:29:33.237+0000","up_votes":4,"down_votes":0,"body":"Y que tiene que ver Riot con tu mala suerte?","replies":[{"poster":"Gretta Thunberg","date":"2017-04-17T19:31:46.813+0000","up_votes":1,"down_votes":8,"body":"que mala suerte loco? si riot es el encargado de emparejar ayer estaba igual a 1 de la promo y me empareja con un darius 0/7 un teemo afk farming (jg9 y flamer","replies":[{"poster":"Rebkans","date":"2017-04-17T19:33:55.376+0000","up_votes":4,"down_votes":0,"body":"Te emparejan con gente de tu mismo elo. Ahora, que ellos decidan trollear o irse afk, es mala suerte","replies":[]}]},{"poster":"Gretta Thunberg","date":"2017-04-17T19:35:21.316+0000","up_votes":1,"down_votes":6,"body":"que mala suerte? por que indirectamente tengo yo la culpa de que la gente entre a ranked sin saber jugar support? cual es mi responsabilidad si riot no maneja bien el asunto de las lineas","replies":[{"poster":"Rebkans","date":"2017-04-17T19:58:09.284+0000","up_votes":3,"down_votes":0,"body":"Flaco, ni vos ni Riot tienen la culpa de que esa gente entre a las rankeds sin saber jugar y que empiece a trollear. Es algo que ocurre en todas las divisiones y es cuestion de suerte toparse con uno o no.","replies":[]}]}]},{"poster":"WhiteMax","date":"2017-04-17T19:54:16.070+0000","up_votes":2,"down_votes":1,"body":"Es mala suerte.\n\nJ-D-T.","replies":[]},{"poster":"Asazuh","date":"2017-04-17T21:12:09.372+0000","up_votes":1,"down_votes":0,"body":"Que queres que hagan los de Riot pá?\nEllos tienen un sistema automatico de baneos que solo banean a los jugadores que son constantemente toxicos y se llevan muchos reports.    \n Si te toca un AFK cola de 20 mins.\n Si te toca un troll Riot no puede hacer nada porque detecta que es noob y no troll.\n Si te toca un feeder te la bancas y listo pá, mancos hay por todos lados.\nRiot no puede hacer nada.\nSi son tóxicos solo reportalos, si son constantemente tóxicos recibiras el glorioso cartelito de que ha sido castigado. Suerte ;)","replies":[]},{"poster":"Imagine Cannons","date":"2017-04-17T21:10:59.892+0000","up_votes":1,"down_votes":0,"body":"Riot no controla si el flaco decide trollear o no.","replies":[]},{"poster":"Nuke","date":"2017-04-17T19:52:42.047+0000","up_votes":1,"down_votes":0,"body":"Con todo respeto, este es absurdo. Hechale la culpa a Riot de todo lo que quieras, hasta por los toxicos... ¿Pero vas a culpar a Riot porque a un troll se le ocurrio ir Yasuo supp? No tiene la culpa en lo absoluto.","replies":[]},{"poster":"Shion Archimago","date":"2017-04-17T19:33:47.487+0000","up_votes":1,"down_votes":0,"body":"mejor q salga ahora y no en mefio de la promocion xd","replies":[{"poster":"Gretta Thunberg","date":"2017-04-17T19:34:24.327+0000","up_votes":1,"down_votes":3,"body":"en la promo igual salen y x2","replies":[]}]},{"poster":"Daiku","date":"2017-04-17T19:30:56.431+0000","up_votes":1,"down_votes":0,"body":"Cosas que pasan capo, no sos el unico","replies":[]}]}