{"poster":"Carralar","date":"2018-10-05T20:00:34.715+0000","title":"Yasuo is since 51 patches one of the MOST BANNED champions","subforum":"Gameplay","up_votes":77,"down_votes":13,"body":"This is just RIDICILOUS","replies":[{"poster":"Ætheist","date":"2018-10-05T20:01:51.038+0000","up_votes":76,"down_votes":4,"body":"Yasuo could be actual garbage and he'd probably STILL be one of the most banned champions.","replies":[{"poster":"ValyrianBlade","date":"2018-10-05T20:06:26.912+0000","up_votes":63,"down_votes":9,"body":"> [{quoted}](name=Ætheist,realm=NA,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=0000,timestamp=2018-10-05T20:01:51.038+0000)\n>\n> Yasuo could be actual garbage and he'd probably STILL be one of the most banned champions.\n\nWhich serves the point that people don't like playing with him in the game.\n\nWhich supports the arguments to gutter him until he gets reworked.\n\nEven if he's the most fun champion in the game to play AS, if he's awful to play against, there's a problem.","replies":[{"poster":"Frosted Tips","date":"2018-10-05T20:09:14.270+0000","up_votes":7,"down_votes":44,"body":"I think people just don't play the right champions into him. Try playing {{champion:36}} type champions or {{champion:58}} type champions and have fun dumpstering the {{champion:157}}","replies":[{"poster":"abca98","date":"2018-10-05T21:08:54.870+0000","up_votes":10,"down_votes":24,"body":"> [{quoted}](name=LeAnime,realm=NA,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=000000000000,timestamp=2018-10-05T20:09:14.270+0000)\n>\n> I think people just don&#x27;t play the right champions into him. Try playing {{champion:36}} type champions or {{champion:58}} type champions and have fun dumpstering the {{champion:157}}\n\nIt's almost like people who complain about Yasuo play champions that have trouble against him.","replies":[{"poster":"xRoyalty","date":"2018-10-05T22:43:12.453+0000","up_votes":30,"down_votes":5,"body":"> [{quoted}](name=abca98,realm=EUW,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=0000000000000001,timestamp=2018-10-05T21:08:54.870+0000)\n>\n> It's almost like people who complain about Yasuo play champions that have trouble against him.\n\nno its just hes unfun as hell to play against and overloaded","replies":[{"poster":"BugsLivesMatters","date":"2018-10-06T10:34:26.919+0000","up_votes":7,"down_votes":3,"body":"Idk man, with abominations like {{champion:84}} {{champion:39}} {{champion:142}} and {{champion:164}}  running around, yasuo doesn't even feel that bad to play against. But yes, he is annoying to deal with at times.","replies":[{"poster":"xRoyalty","date":"2018-10-06T13:17:29.503+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=BrendoRockLee,realm=OCE,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=000000000000000100000000,timestamp=2018-10-06T10:34:26.919+0000)\n>\n> Idk man, with abominations like {{champion:84}} {{champion:39}} {{champion:142}} and {{champion:164}}  running around, yasuo doesn't even feel that bad to play against. But yes, he is annoying to deal with at times.\n\nyet yasuo is clearly hated more than all of them, personally id rather play against all of those than yasuo all the time. And clearly most people would which is why yasuo is banned so much.","replies":[{"poster":"BugsLivesMatters","date":"2018-10-06T15:10:51.174+0000","up_votes":4,"down_votes":0,"body":"For sure, i can definitely understand why he is hated so much. His kit, by it's very nature, is pretty overloaded. \n\nBut as a jungle main, I absolutely detest those 4 champs because they are nearly impossible to gank unless they completely screw up their abilities.","replies":[{"poster":"GodlyBane","date":"2018-10-06T17:03:39.519+0000","up_votes":2,"down_votes":3,"body":"AHA see! even a jg main said it,  Yasuo is easy to gank. (i think its what people always leave out when they think \"Yasuo\")","replies":[{"poster":"Morticianjohn","date":"2018-10-06T18:54:48.478+0000","up_votes":6,"down_votes":0,"body":"A good yasuo is very difficult to gank. I don't even mind yasuo but there are almost always escape routes through minions or scuttle even if he flashes. Plus the knock up and wind wall means that while he is not the most difficult to gank he is certainly not among the easiest","replies":[{"poster":"BugsLivesMatters","date":"2018-10-06T23:21:19.498+0000","up_votes":2,"down_votes":1,"body":"He isn't \"easy\" to gank, but compared to akali, camille and zoe, he certainly feels like it lol","replies":[{"poster":"Votable Jester","date":"2018-10-07T05:20:00.367+0000","up_votes":3,"down_votes":0,"body":"What makes him easier to gank than Zoe?\n\nZoe can only cc one person.  Or is it that if you flash engage and fail to kill her before she picks up your flash she generally gets away?","replies":[]}]}]}]}]}]}]}]},{"poster":"xRoyalty","date":"2018-10-05T22:44:54.381+0000","up_votes":1,"down_votes":14,"body":"> [{quoted}](name=abca98,realm=EUW,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=0000000000000001,timestamp=2018-10-05T21:08:54.870+0000)\n>\n> It&#x27;s almost like people who complain about Yasuo play champions that have trouble against him.\n\nso, you have to play a tank if you want to win lane","replies":[{"poster":"SociaI Justice","date":"2018-10-06T00:52:26.865+0000","up_votes":9,"down_votes":1,"body":"you don't win lane with a tank against  yasuo lmao","replies":[]}]},{"poster":"3TWarrior","date":"2018-10-06T21:20:49.212+0000","up_votes":2,"down_votes":1,"body":"like almost every mage and marksman in the game?","replies":[{"poster":"abca98","date":"2018-10-07T10:08:55.384+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=3TWarrior,realm=NA,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=00000000000000010002,timestamp=2018-10-06T21:20:49.212+0000)\n>\n> like almost every mage and marksman in the game?\n\nYes. That's why he has such a high banrate.","replies":[]}]}]},{"poster":"ValyrianBlade","date":"2018-10-05T20:51:08.087+0000","up_votes":25,"down_votes":3,"body":"> [{quoted}](name=LeAnime,realm=NA,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=000000000000,timestamp=2018-10-05T20:09:14.270+0000)\n>\n> I think people just don't play the right champions into him. Try playing {{champion:36}} type champions or {{champion:58}} type champions and have fun dumpstering the {{champion:157}}\n\nThe problems with that argument are:\nI pick first half the time\nAnd\nI may only have a certain pool of Champions for mid lane, which are generally selected to support my team comp in some way. Renekton and Mundo don't do the job of a mid laner, so there's no reason to have them in that pool.\n\nAt the end of the day though, it's not that I can't beat yasuo with Ahri. I can, and often do. It's that I find it annoying to watch him misplay after misplay after misplay, and yet I don't get fed off of it and know he'll outscale me. It's annoying to watch him dash around everywhere making it hard enough to hit skillshots on him, then when charm is going to land he can windwall it, and when I've already got that cooldown he has a passive shield to absorb my burst, and when I've poked that shield already he still has enough base stats and mobility to survive and escape and still deny me the kill unless I have my ult up to chase or get a gank. \n\nLike who else gets that many safety mechanics? With his level of mobility, he shouldn't need any of them. Honestly I'd rather see yasuo be able to dash through allies and allied minions, then get rid of his shield and wind wall. Give him unconditional mobility and take away all the training wheels and see what he can do.","replies":[{"poster":"10 fps","date":"2018-10-06T16:55:10.223+0000","up_votes":2,"down_votes":0,"body":"You also forget that tower shots do not break his shield, his ultimate gives him a free shield and the shield decays when popped.","replies":[]}]}]},{"poster":"Tomoe Gozen","date":"2018-10-06T20:33:26.335+0000","up_votes":1,"down_votes":1,"body":"It actually doesn't mean that.\nZed is also one of the most hated champs when he's in the meta and then when there's no assassin in the mid lane, then Zed is fine because people didn't see him for (what seems like) an eternity. And then it's back to the \"OP easy garbage\" when he emerges once more.\n\nSomeone not liking playing with/against a specific champion isn't at all a good indicator that they need a rework. If we did that, you could find a problem with any champion that bothers some group of players and then the entire roster of 140+ champs would feel like a huge rework pile Riot would need 50 years to go through.","replies":[{"poster":"ValyrianBlade","date":"2018-10-07T10:36:45.073+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Tomoe Gozen,realm=EUNE,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=000000000002,timestamp=2018-10-06T20:33:26.335+0000)\n>\n> It actually doesn&#x27;t mean that.\n> Zed is also one of the most hated champs when he&#x27;s in the meta and then when there&#x27;s no assassin in the mid lane, then Zed is fine because people didn&#x27;t see him for (what seems like) an eternity. And then it&#x27;s back to the &quot;OP easy garbage&quot; when he emerges once more.\n> \n> Someone not liking playing with/against a specific champion isn&#x27;t at all a good indicator that they need a rework. If we did that, you could find a problem with any champion that bothers some group of players and then the entire roster of 140+ champs would feel like a huge rework pile Riot would need 50 years to go through.\n\nIt kind of does... There's a difference between some complaints on the boards, and a champion being the most banned in the game for over 3 years...","replies":[]},{"poster":"3TWarrior","date":"2018-10-07T00:17:28.726+0000","up_votes":2,"down_votes":0,"body":"not really.  There's a difference between whining posts and champs who just crush the spirit of the game\n\nif yasuo were released when almost every champion had a skill-shot ability as their main point of damage, he would have become permaban status like kassadin because he shuts down two classes at once...\n\nnow every champion is becoming \"unique\" without thought of what consequences there might be for releasing such a feature","replies":[]}]}]},{"poster":"BestPudgeNA","date":"2018-10-06T02:14:36.185+0000","up_votes":9,"down_votes":1,"body":"> [{quoted}](name=Ætheist,realm=NA,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=0000,timestamp=2018-10-05T20:01:51.038+0000)\n>\n> Yasuo could be actual garbage and he'd probably STILL be one of the most banned champions.\n\nPerhaps that says something about his toxic bullshit kit IDK.","replies":[]},{"poster":"saltran","date":"2018-10-05T20:18:35.969+0000","up_votes":5,"down_votes":4,"body":"As a MF player can confirm LUL","replies":[{"poster":"Hexs Fortune","date":"2018-10-06T00:04:47.514+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=saltran,realm=EUW,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=00000001,timestamp=2018-10-05T20:18:35.969+0000)\n>\n> As a MF player can confirm LUL\n\nPlay garen into yasuo. The ultimate catharsis.  {{sticker:garen-swing}}","replies":[]}]}]},{"poster":"Quiet Dude","date":"2018-10-05T20:34:38.210+0000","up_votes":39,"down_votes":10,"body":"If he wasn't an overloaded Mary Sue champion, I doubt he'd be banned so much. That's what happens when a dev tries to put his League fanfic character in the game.\n\n\"This is my champion, Certainl- uh, Yasuo.\"\n\n\"What does he do?\"\n\n\"Everything other champions do, but better.\"","replies":[{"poster":"Academy Kayn","date":"2018-10-06T05:57:53.034+0000","up_votes":7,"down_votes":6,"body":"Just saying, but that isn't a Mary Sue. A Mary Sue (Or Gary Stu in Yasuo's case) is a character that warps the story around themselves. Each and every other character somehow relates, interacts, and is dependent on this character for everything. While Overpowered/Does too many things is a common trait of *a* Mary Sue, that alone does not make one. You're mixing Gameplay and Story terms just to insult someone. S'kinda rude. \n\nJust saying.","replies":[{"poster":"Wyrmblade","date":"2018-10-06T06:04:02.306+0000","up_votes":12,"down_votes":2,"body":"But that's a perfect analogy to how he is in gameplay. He warps everything to be about him.","replies":[]},{"poster":"Thefrostyviking","date":"2018-10-06T09:46:27.140+0000","up_votes":10,"down_votes":2,"body":"Except Yasou truly does warp a good portion of the map around himself.\n\nA good yas cant be beaten by a ranged champ that relies on a projectile of some kind, so to beat him you need constant jungler assistance,  and his own jungler will be there too.\n\nAnd you cant leave him because if he gets fed there is hell to be paid, and if he is on your team and falls behind too far then he almost doesnt exist for the coming 10 minutes......but at least he scales so well that he gets back quickly if given the chance. \n\n\nThen in teamfights he has so much wombo potential that both teams have to watch out for him and move with him, if you dont then losing is almost overwhelmingly certain.\n\nSo to put it simply....a champ that from a very early point becomes extremely difficult to deal with in lane to the point of warping the junglers routes around himself and in teamfights have both teams moving around him......how is he not a nearly perfect Gary sue again?","replies":[]}]}]},{"poster":"AMADEUSdotEXE","date":"2018-10-06T02:17:08.503+0000","up_votes":15,"down_votes":1,"body":"Thats because his kit is toxic in general. Noone wants to fight him, half your teams yasuo feed etc.","replies":[]},{"poster":"EGGGGGGGGGGGGGGS","date":"2018-10-06T01:44:59.007+0000","up_votes":14,"down_votes":1,"body":"no matter how bad or how good yasuo is windwall is infuriating to play against and that's the only reason why I ban him... every game.","replies":[{"poster":"LilxPaprika","date":"2018-10-06T07:32:17.346+0000","up_votes":3,"down_votes":0,"body":"^this, especially for certain ultimates (oorn)\n\nid ban braum too but he's not as annoying, idk why\nmaybe you can't carry as much as support (for average joe at lower elo perhaps)","replies":[{"poster":"Z3Sleeper","date":"2018-10-06T08:21:46.392+0000","up_votes":13,"down_votes":1,"body":"Cuz Braum blocking stuff still affects him (does damage/CC) and it's both smaller and dependent on his positioning.\n\nBasically, Unbreakable is balanced, that's why.","replies":[]},{"poster":"3TWarrior","date":"2018-10-07T00:25:18.161+0000","up_votes":5,"down_votes":0,"body":"braum only blocks one projectile and everything else does 50% damage and still applies effects\n\nbraum is also designed as a tank and has features of a tank\n\nyasuo is a carry that starts off tanky and ends up slightly weaker than a bruiser yet with insane glass cannon damage and targeted crowd control while having the ability to protect his entire team at once","replies":[{"poster":"Thilmer","date":"2018-10-07T13:53:23.048+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=3TWarrior,realm=NA,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=000d00000001,timestamp=2018-10-07T00:25:18.161+0000)\n>\n> braum only blocks one projectile and everything else does 50% damage and still applies effects\n> \n> braum is also designed as a tank and has features of a tank\n> \n> yasuo is a carry that starts off tanky and ends up slightly weaker than a bruiser yet with insane glass cannon damage and targeted crowd control while having the ability to protect his entire team at once\n\nI don't really understand why an hipercarry with massive mobility and damage also has that massive level of utility: press W to make half the enemy team useless during 4 seconds.\n\nIt would be a busted ability even in a tank support or similar; it simply has no sense in a champion like Yasuo.","replies":[{"poster":"3TWarrior","date":"2018-10-07T18:38:48.629+0000","up_votes":2,"down_votes":0,"body":"I do not know.  There have also been numerous fixes proposed by the community over the years, but Riot has not commented","replies":[]}]}]}]}]},{"poster":"Hügö","date":"2018-10-05T22:35:29.480+0000","up_votes":15,"down_votes":2,"body":"Riot: Can't see anything wrong with it.","replies":[]},{"poster":"Hong Kong Annie","date":"2018-10-05T23:58:07.301+0000","up_votes":12,"down_votes":1,"body":"Honestly he would be alot less of a problem if his windwall didn't originate from his character model and instead came from the tip of his sword. The way it works now is just complete BS and is to forgiving to the Yas player.","replies":[]},{"poster":"Thilmer","date":"2018-10-06T14:06:17.809+0000","up_votes":11,"down_votes":2,"body":"Yasuo has been one of the most banned champions since his reléase.\n\nHis kit has an absurd amount of tools and no clear weak points, been toxic from a start. \n\nHow was he released with this skillset is one of the greatest misteries of League for me, but my theory is that CertainlyT can ignore concepts like \"counterplay\" or \"game balance\" because he is some kind of hindu sacred cow that no one can touch anyway, so he keeps making this horrendously overloaded champions with passives in every skill, stupidly low CDs, etc.","replies":[{"poster":"3TWarrior","date":"2018-10-07T00:27:49.754+0000","up_votes":5,"down_votes":0,"body":"it does have weak points, but the problem is, if the yasuo learns to cover them, there is no way to conceivably punish them unless you have insane early game spam or meet him in his rarely played top-lane position\n\notherwise, all aspects of the game revolve around the yasuo and whether or not they mess up, yet even when they mess up, you have to attack them in a specific pattern or else they negate up to 500 points of damage from your burst or worse still can negate your engage entirely with windwall","replies":[]}]},{"poster":"ThıghConnoısseur","date":"2018-10-06T17:12:30.796+0000","up_votes":4,"down_votes":6,"body":"we are still complaining about yasuo? seriously???","replies":[{"poster":"BlackEyesBlue","date":"2018-10-06T17:27:57.955+0000","up_votes":12,"down_votes":4,"body":"> [{quoted}](name=Kobynsayshello,realm=NA,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=001e,timestamp=2018-10-06T17:12:30.796+0000)\n>\n> we are still complaining about yasuo? seriously???\n\nBecause literally nothing has been done to fix the many, long standing, valid complaints about him?\n\nHow now fancy pants? :P","replies":[]}]},{"poster":"Tychusfindlay918","date":"2018-10-06T00:36:03.633+0000","up_votes":3,"down_votes":24,"body":"sucks to be bronze and not understand his kit I guess.","replies":[{"poster":"Beerstein","date":"2018-10-06T01:48:56.758+0000","up_votes":14,"down_votes":1,"body":"> [{quoted}](name=Tychusfindlay918,realm=NA,application-id=3ErqAdtq,discussion-id=ffBqOsEP,comment-id=000c,timestamp=2018-10-06T00:36:03.633+0000)\n>\n> sucks to be bronze and not understand his kit I guess.\n\nPeople understand it fine. I don't think you understand how MMR works. Someone who always plays yas will play into equal chance to win opponents, still doesn't make him fun to play against. Windwall is just a frustrating spell at any level of play. In fact, the higher you get the better at utilizing it people are. If anything he's more bearable the lower you are. A bronze player is almost as likely to place it on the wrong side of him as the right one.\n\n51 patches as one of the most consistently banned champions is a problem no matter the reason for the ban.","replies":[]}]},{"poster":"IG Ziko","date":"2018-10-06T12:44:28.905+0000","up_votes":7,"down_votes":2,"body":"That windwall is so awful to have on a hypercarry champion.","replies":[]},{"poster":"Sacred Math","date":"2018-10-06T07:50:27.442+0000","up_votes":8,"down_votes":3,"body":"Remove his shield passive and give him mana.\n\nHis kit is just obscenely stacked. Ridiculous mobility, a lot of range on his ulti, no resources, double passive, crazy crit passive, crazy damage, wall that can block ultis...\n\nMajority of other champions' kits just don't measure up, even if his numbers are tuned down","replies":[{"poster":"CasterGilgamesh","date":"2018-10-07T12:38:49.293+0000","up_votes":2,"down_votes":0,"body":"No remove his double crit passive keep the shield and make his wind wall have a damage thresh hold that it breaks from also maybe change his dashes to be more noticeable but not infinite","replies":[]}]},{"poster":"MadNoff","date":"2018-10-05T21:21:27.789+0000","up_votes":9,"down_votes":4,"body":"Hes just overloaded is all. Yasuo is like a dude with four balls (golf) and two cocks (fowls)","replies":[{"poster":"Śhunpo","date":"2018-10-06T03:11:21.005+0000","up_votes":4,"down_votes":0,"body":"He's the kind of guy to pick Fox in Melee and then say \"nah he's bad\" or picking Gil in Street Fighter 3 and then saying \"I see nothing wrong with this\".","replies":[]}]},{"poster":"Add92","date":"2018-10-06T07:08:38.265+0000","up_votes":5,"down_votes":1,"body":"I ban yasuo's because I dont want a yasuo on my side . \nFor some reasons the ally yasuo is hot garbage , and enemy yasuo is god","replies":[]},{"poster":"Ozzie Storm","date":"2018-10-06T16:13:19.604+0000","up_votes":6,"down_votes":2,"body":"permabanned and always will till they change his kit. Zoe was deemed overpowered so she was gutted, the same should apply to yas.","replies":[]}]}