{"poster":"White Wolf180","date":"2015-08-23T22:40:05.701+0000","title":"Why is everyone so mean to me for being new?","subforum":"Tips & Tricks","up_votes":140,"down_votes":9,"body":"Im level 14 new to the game still, ive been told to get cancer and die, ive been told to go kill myself, ive been told many different horribly mean things but i dont understand why? Im still trying to learn the game and yet people are such jerks to me? How am i supposed to learn anything in this kind of environment? Why cant people just be nice and help me learn instead of being such a jerk? Or i get people against me who are lvl 30 with full runes, more masteries and have been playing a ton longer then i have, yet when they beat me instead of helping me learn what i did wrong they try to trash talk and rub it in my face. What is with this community? ","replies":[{"poster":"Mountain Warden","date":"2015-08-23T23:06:35.225+0000","up_votes":56,"down_votes":1,"body":"I'm completely confident that the majority of players are pretty decent folks. But even if only 10% of league players are assholes on short fuses, that means you'll hit one about every game on average. And it only takes one toxic player to change the atmosphere of a game from fun to unpleasant. Just ignore the trolls and do your best.\n\nBy the way, a lot of people forget that once you've reached the ranking appropriate to your skill level, your win rate will be around 50%. That means you'll loose about half your games. Loosing isn't the best feeling in the world, but it's part of the game.","replies":[{"poster":"White Wolf180","date":"2015-08-23T23:11:45.406+0000","up_votes":16,"down_votes":0,"body":"i dont mind losing. Sure i wanna win but i wont flip out. And its usually more then one person being mean to me if i do bad. If i die a lot then if im lucky it wont be most in the game being mean :/ i wish i had your luck in finding 9 nice people in every game","replies":[{"poster":"Mugoi Oni","date":"2015-08-24T18:10:58.690+0000","up_votes":1,"down_votes":0,"body":"They're right dude. Just keep on doing your thing. \nThose players will always be around, but you'll definitely be meeting loads of really super cool nice folk too.\nAnd the dudes that hate on you probably have nothing left to enjoy than heckling new players.\n\nI know how it feels to be hated on as a noob... (still hated on even now) but It got a lot better along the way.\nJust give it time and enjoy the game. :)","replies":[{"poster":"White Wolf180","date":"2015-08-24T18:17:52.982+0000","up_votes":5,"down_votes":0,"body":"ok :) thank you a lot ^_^ i do enjoy the game itself a lot","replies":[]},{"poster":"Awesomeisme2","date":"2015-08-31T23:27:31.733+0000","up_votes":2,"down_votes":0,"body":"Lol, I started playing lol 1 1/2 years ago and I fed, I tried to get better but I still get hated for \"not making that play\" or \"feeding the support\" but honestly find someone you enjoy playing with and have fun, mute all the jerks, report them if you have to, after all it's supposed to be fun right?","replies":[]}]},{"poster":"Death by Kayn","date":"2015-08-24T03:21:30.882+0000","up_votes":5,"down_votes":0,"body":"You can add me as well and play with me whenever I'm on. I dont play too seriously in normals, but I'll give you pointers","replies":[]},{"poster":"Mystagent","date":"2015-08-23T23:13:12.149+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=White Wolf180,realm=NA,application-id=WEuoGbmp,discussion-id=gmw26cRu,comment-id=00020000,timestamp=2015-08-23T23:11:45.406+0000)\n>\n> i dont mind losing. Sure i wanna win but i wont flip out. And its usually more then one person being mean to me if i do bad. If i die a lot then if im lucky it wont be most in the game being mean :/ i wish i had your luck in finding 9 nice people in every game\n\nJust mute him and move on. No way your getting through to that person.","replies":[]}]}]},{"poster":"Mystagent","date":"2015-08-23T22:52:12.617+0000","up_votes":17,"down_votes":1,"body":"The League community always has a stick up its ass. You don't win lane and win the game cause they can't they will flame ALL DAY. Just mute them and move on and learn from every game. If you go 12 12 9 in a game, find out why you died 12 times and fix it, if you go 0 12 5 again find out why you die and fix it. That way no one will start to flame. The only reason they get mad is cause they are not good enough to carry.  Don't mind them and just play whatever you want whenever","replies":[{"poster":"White Wolf180","date":"2015-08-23T22:53:13.539+0000","up_votes":11,"down_votes":0,"body":"thankyou ^_^ i like playing rengar most he my favorite champion so far {{champion:107}}","replies":[{"poster":"Corrupto123","date":"2015-08-24T09:28:14.093+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=White Wolf180,realm=NA,application-id=WEuoGbmp,discussion-id=gmw26cRu,comment-id=00000000,timestamp=2015-08-23T22:53:13.539+0000)\n>\n> thankyou ^_^ i like playing rengar most he my favorite champion so far {{champion:107}}\n\nyou'll be fine, don't worry","replies":[]}]}]},{"poster":"ArkenStorm","date":"2015-08-24T01:07:21.207+0000","up_votes":13,"down_votes":0,"body":"Make extensive use of the mute button. Trust me, that makes the game so much more fun. First time somebody says something you don't like, mute button. Sounds childish, but the point of the game is to have fun, and you want to have fun grinding to level 30 right? Trust me on this one.","replies":[{"poster":"Zenthon Prime","date":"2015-08-24T01:28:38.037+0000","up_votes":6,"down_votes":0,"body":"I mute after a single toxic comment.  If over three toxic players are in a game I /muteall and unmute specific players I know aren't toxic.  Works for me, at any rate.","replies":[]}]},{"poster":"White Wolf180","date":"2015-08-24T03:17:15.002+0000","up_votes":11,"down_votes":0,"body":"Thank you everyone for all the replies and advice. I half expected people to be mean here. Thank you im glad theres nice people :) makes me feel better. I added those who asked me too :D hope to play with you soon","replies":[{"poster":"Hyrum Graff","date":"2015-08-24T14:46:43.197+0000","up_votes":10,"down_votes":0,"body":"> [{quoted}](name=White Wolf180,realm=NA,application-id=WEuoGbmp,discussion-id=gmw26cRu,comment-id=0013,timestamp=2015-08-24T03:17:15.002+0000)\n>\n> Thank you everyone for all the replies and advice. I half expected people to be mean here. Thank you im glad theres nice people :) makes me feel better. I added those who asked me too :D hope to play with you soon\n\nI think the community comes through a little better on the forums, because the 10% assholes can get downvoted to oblivion and drowned out, whereas in-game, one toxic player can often send other players into a mood where they're toxic, too.\n\nI have a couple pieces of advice:\n\n1. As others have said, mute, mute, mute. Do it as soon as the person makes a negative comment, even if it's not about you. It's just not worth the risk of them ruining your game and you can always unmute them. Some people will say how that's bad because of communication but\n  - That's not really important until high level play (at least gold) - before then all you need are pings.\n  - Most people who are toxic don't have anything valuable to say anyway.\n  - Even if they did, it's not worth getting your game ruined for a small advantage in coordination.\n2. Play in groups. In the post-game screen, anybody who was nice to you, *especially in games where there was a mean person,* add them as a friend. Now instead of going solo queue you can play with a couple people you know will be nice. Don't be afraid to remove them if they aren't always nice.\n  - Even if you can't find a group of 5 nice people, knowing you'll have somebody or a couple somebodies who will  who will have your back is super nice. \n3. Do your part. Report the jerks. If someone is getting yelled at in your game, let the jerk know that's not okay. They may turn their attention to you, so be ready to mute them and remind your teammate that they can do the same.\n4. Don't engage. If someone's just raging at you, or one of your teammates, (almost) never talk to the rager. You'll almost always end up acting defensive, which just paints a bigger target on you. Instead, focus on keeping your positive teammates positive. \"You haven't muted him yet?\" or \"Hey, don't yell at my teammate\" <- (said to a positive petson who was about to start yelling at a rager) gets your message across just as effectively.\n\nYou're welcome to add me (I may ask who you are if I forget your summoner name from this thread) and I'll find a way to play with you and teach you a bit :)","replies":[{"poster":"rinsujo","date":"2015-08-25T15:57:52.438+0000","up_votes":2,"down_votes":0,"body":"The biggest reason the community is nicer on the boards is because Boards draws the people who are heavily invested in enjoying the game, rather than those who are invested in climbing the ranked ladder - not to mention because it's a lower pressure environment, you're also removing the stress that causes toxicity in game to begin with.  At least that's what I suspect. \n\nAnd to the newbie - don't sweat it. We were all new once, even if assholes forget what it's like. Best bet is to find friends and play with them - makes the experience much more enjoyable.","replies":[]}]},{"poster":"A Miss Fortune","date":"2015-08-24T14:34:54.758+0000","up_votes":4,"down_votes":0,"body":"Can I just say that eventually you WILL get into a game with a group of amazing people on both your side and the enemy side.\n\nSome games are just hilarious and people do stupid-funny stuff. Like my entire team (almost all of which were melee) built Runaan's Hurricane (a Ranged only item). Or if not for doing stuff like that people are just hilarious and really friendly in all chat. I think while the community can have some of the most toxic, rude, arrogant people in the gaming community, it also can have some of the most friendly, funny, and well mannered people in the gaming community too.","replies":[]},{"poster":"Aevo 55","date":"2015-08-24T15:07:39.058+0000","up_votes":2,"down_votes":0,"body":"Boards is your safe haven from trolls. WELCOME!!!","replies":[]}]},{"poster":"Lugg","date":"2015-08-23T23:19:43.724+0000","up_votes":5,"down_votes":1,"body":"It's like a fraternity. You have to go through a gauntlet of abuse to be accepted. \n\nI personally don't like it, but that's how it is.","replies":[{"poster":"White Wolf180","date":"2015-08-23T23:24:20.415+0000","up_votes":3,"down_votes":0,"body":"whens the abuse stop","replies":[{"poster":"Ixaxxar","date":"2015-08-23T23:25:12.960+0000","up_votes":9,"down_votes":1,"body":"when you win the lcs","replies":[{"poster":"White Wolf180","date":"2015-08-23T23:27:58.987+0000","up_votes":10,"down_votes":0,"body":"then why do people beat up on lcs players","replies":[{"poster":"The Mighty Flea","date":"2015-08-24T01:37:19.018+0000","up_votes":4,"down_votes":0,"body":"Because they are jealous that they are asking money playing a video game.","replies":[]}]}]}]}]},{"poster":"Galewings","date":"2015-08-23T23:13:45.998+0000","up_votes":7,"down_votes":0,"body":"Hey there fellow aspiring summoner,\n\nAs someone who was also a very new player at one point (I've been playing for around a year on and off though frankly I still am very, very bad) I know how harsh  a lot of the player base is, not just to new players, but just anyone in general (though new players get picked on worse for the fact that they're new).\n\nThey do it for multiple reasons, all of them very wrong: \n\n1.) They've been flamed many times before and some people can't deal with it and turn that frustration on others whenever they can.\n\n2.) They get fed and very ahead of the new players easily simply because they are more experienced and then feel like they were gods all along.\n\n3.) When it's your teammates who do it, it's because they simply assume new players will have the same amount of knowledge as they do and find the fact that they make mistakes people who they regularly play with wouldn't normally do unacceptable and instead of trying to give tips to the player and encourage improvement, they flame them and only make things worse.\n\nAs someone who's been through this I know this can turn people away from the game for good. Or at least make you doubt in yourself and put your mood down. What you can do, is simply try to ignore them and focus on your own game. If they keep their bad attitude up, you can hit the tab button, mouse over their champion portrait and hit the \"mute\" button and report them for \"negative attitude\" or \"Verbal Abuse\" at the end of the game If they are a problem, the system will eventually punish them and attempt to correct their behavior.\n\nI should also say, never let all the toxcity get to your head. Not only can it affect your performance but it can also frustrate you and lead you into being toxic yourself. It really does happen, I've let it get in my head before and I have been toxic myself to other toxic players harassing me. I try not to do it and whenever I come close to it I think of the old quote: \"Never let an Idiot drag you to his level for he will beat you with experience\".\n\nLastly, I'd like to say that if you really, really like this game then don't give up on it It really can be fun at times and when you can tell you've improved as time passes on it feels pretty nice!\n\nI'm not the best player around, but feel free to add me in game if you want and I'll play games with you if I can and try to help you out with the game as far as what little game knowledge I have!","replies":[]},{"poster":"MohawkBird","date":"2015-08-24T00:21:07.075+0000","up_votes":6,"down_votes":1,"body":"Because smurfs need to feed their ego.","replies":[]},{"poster":"redniwediS","date":"2015-08-23T22:55:21.545+0000","up_votes":4,"down_votes":0,"body":"Your best bet is to try and meet people.  I was lucky enough to meet a few people through friends, and I've played the last few seasons with them.  PUGs are just too much of a grab bag to reliably have a good experience, but if you meet some nice people you'll have fun playing for years.\n\nI don't know if the boards here are a good way to try and meet people if you don't know anyone IRL who plays, but Reddit can be pretty good sometimes.","replies":[]},{"poster":"TouchpadExpert","date":"2015-08-24T06:40:17.948+0000","up_votes":2,"down_votes":0,"body":"I played bots until I hit level 30. In that environment you're more likely to meet players around your skill level and people who know how to play who are more willing to teach newer players.\n\nI know beginner bots is probably too easy but at your summoner level intermediate bots might actually be a worthy challenge to you. At your summoner level you usually will get 1-2 teammates who feed horrendously so it will still feel like a PvP game. So you will still be in a position where you will need to carry some dead weight and it can be a good learning experience. There are some hacks you can pull to cheat the game into winning if you cannot out-muscle the bots. Split pushing is your friend.","replies":[{"poster":"White Wolf180","date":"2015-08-24T07:03:16.702+0000","up_votes":2,"down_votes":0,"body":"i only ever played bots like 3-4 games haha but sure ill try that out :D thank you. If nothing else it could help me work on my mechanics with rengar","replies":[{"poster":"TouchpadExpert","date":"2015-08-24T14:52:21.875+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=White Wolf180,realm=NA,application-id=WEuoGbmp,discussion-id=gmw26cRu,comment-id=001b0000,timestamp=2015-08-24T07:03:16.702+0000)\n>\n> i only ever played bots like 3-4 games haha but sure ill try that out :D thank you. If nothing else it could help me work on my mechanics with rengar\n\nI only recently started playing PvP maybe 3 months ago. Played bots for 2+ years. You don't have to stay in bots as long as I did but playing bots did wonders for my mechanics. Heck, I play on a touchpad and my mechanics are more refined than a lot of the people I meet in solo queue. Bots are great at teaching you mechanics, timing and how to dodge skill shots effectively. But they do make you learn some bad habits. Like chasing for kills, going places that aren't warded and cheap tricking the AI via ambushes because they never learn from mistakes.\n\nIf you do play intermediate there are some tricks. Like in the loading screen you can predict where each bot will go based on where their portrait is. Read from left to right and say Bottom, Top, Middle, Bottom, Top. So if the bots are as follows: Ezreal, Blitzcrank, Vladimir, Sona & Lux you won't be caught off guard by seeing Lux and Blitzcrank in the top lane. At 11:00 the bots do a lane swap. One of the top laners (or bottom laners) will roam into mid lane. You can make a pick off if you plan for this. The bots won't ult unless there is a kill to be had. They won't ult unless you have under 20% hp, so if Karthus bot is in the game back whenever you have 1/3 of your health. Late game the bots will group up in whatever lane has been pushes the hardest. If top lane is at inhibitor tower and mid lane and bot lane are still at the outer towers the bots will 5 man group at top and neglect mid lane and top lane. In PvP you want to rush top lane but in bots you actually want to play passively top lane and shove in mid lane and bottom lane. The bots will split up once one of the other lanes has been pushed in as hard as top lane was. And bots still play like Bronze tier players, they would much rather 5 man pursue a low health champion than defend their Nexus from winions.","replies":[]}]}]},{"poster":"x Zoidberg x","date":"2015-08-24T08:25:39.447+0000","up_votes":3,"down_votes":0,"body":"I'm level 15 if you wanna play with me.  I'm not new at all but I'm nice and will give you any advice you'd want.","replies":[]},{"poster":"Archon X","date":"2015-08-24T12:04:22.184+0000","up_votes":1,"down_votes":8,"body":"play vs bots until you learn how to play.","replies":[{"poster":"MVDuneCats","date":"2015-08-24T14:32:36.672+0000","up_votes":5,"down_votes":0,"body":"The learning is never done.","replies":[]}]},{"poster":"CKwoka26947","date":"2015-08-26T22:53:37.614+0000","up_votes":2,"down_votes":0,"body":"Usually people get angry when you do something really really obvious bad thing and they tell you to stop and you are like DURRRRR and keep doing it.  Even if its unranked you are wasting peoples' time because you basically superfed the enemy and now everyone has to wait to FF.","replies":[]},{"poster":"Bandit King Z","date":"2015-08-25T01:50:01.019+0000","up_votes":1,"down_votes":0,"body":"Mute, report, try your best to not let it get to you. My first couple games playing had me feeling so low. I joined for the sake of the game, and right out the gate at level 1 I had the worst people giving me shit.","replies":[{"poster":"Bandit King Z","date":"2015-08-25T01:53:02.624+0000","up_votes":1,"down_votes":0,"body":"Oh also add me if you want. I'm sub par at best but I have fun playing. Honestly, at level 29, I played a LOT of co-op vs AI and ARAM due to just not wanting to deal with toxicity but recently realized I'm letting them cheat me out of not only my enjoyment of the full game, but a genuine opportunity to learn and get good at pvp.","replies":[{"poster":"White Wolf180","date":"2015-08-25T22:55:55.969+0000","up_votes":2,"down_votes":0,"body":"id love to add you and play with you sometime :D","replies":[{"poster":"Bandit King Z","date":"2015-09-02T23:58:44.536+0000","up_votes":1,"down_votes":0,"body":"Wow sorry, I'm so behind on this, but hell yeah! Shoot me an add, or adversely I can once I'm done patching. Just been so bogged down with work lately.","replies":[]}]}]}]},{"poster":"Rune Mage6ix9ine","date":"2015-08-25T21:21:52.506+0000","up_votes":2,"down_votes":0,"body":"i feel ya. same thing happens to me, even at high levels. even as good players, they do it if you die, just from trying to learn a new champion. i literally just bought my first ADC champion, Varus, and i'm still learning it, and just about every game i do there's this one guy that says unninstall league go kill yourself ect. what you want to do is A. Mute them. B there will be people in your games who stand up for you, friend them, and as you progress adding friends, you will get to the point you can have your whole team always be your friends until you get to the ranked games. other than that it's just ignore people.","replies":[]},{"poster":"DartFeld","date":"2015-08-25T16:23:30.176+0000","up_votes":2,"down_votes":0,"body":"I was told many times to uninstall when I started. Ignore the haters and keep learning. And yes, there are decent folks out there. Most memorable for me (I don't remember his name) was a guy that I got killed. He was recalling in a bush and I was being chased, so I ran through there and they found him :P he wasn't happy, but wasn't rude about it either. I told him I was new and still learning how everything works. He was completely cool after that and had no issues with my fuck ups. He even started to just give me advice. He didn't tell me what not to do (like saying \"that was dumb, don't do X thing\") but told me what I should have done instead. for example\"dont chase low health past this point, just go back to lane when they get too far into fog.\" Or \"you should have recalled when you were that close to dying.\" \n\nPay attention everyone. People like this make a HUGE difference to new players. Be this person, not the guy that tells new players how shitty they are. New players are inexperienced.  They are not bad players yet.","replies":[{"poster":"XVI Jake IVX","date":"2015-10-20T08:07:06.718+0000","up_votes":1,"down_votes":0,"body":"Those people inspire me more and more on my guide to come the MOST untoxic league of legends player and be the most helpful player. Enjoy the upvote.","replies":[]}]},{"poster":"dr lichdeath","date":"2015-08-25T12:57:15.240+0000","up_votes":2,"down_votes":0,"body":"rule number 1 always mute everyone \nthis is a game of trolls and toxics\nyou can only start to unmute while doing ranked and getting gold? at least\noption2 u leave the chat open and just mute the toxics giving a bit more chance to the not so toxic people\noption 3 u leave everyone unmuted but u report everyone who flames and stay silent","replies":[{"poster":"XVI Jake IVX","date":"2015-10-20T08:08:46.042+0000","up_votes":1,"down_votes":0,"body":"Option 4 you can compliment the toxic ,and trolls and hope they change ,and if they don't than mute them or keep saying Good job and stuff.","replies":[]}]},{"poster":"Gorgannan","date":"2015-08-25T06:37:22.105+0000","up_votes":2,"down_votes":0,"body":"I had such a nice time 1-30 that I feel bad.\n\nAdd me in game, I'm Gold 2 on my main but I can grab a smurf to play with you. I'll show you the ropes.","replies":[]},{"poster":"blkKalameet","date":"2015-08-25T02:32:29.166+0000","up_votes":2,"down_votes":0,"body":"Because it's the end of summer and all the kiddies are upset about having to go back to school. Seriously tho,  summer is the worst time to play this game because there's children that will cry that you didn't let them carry. \n\n\nSome tips I can offer tho, practice csing. Load up a custom game,  and practice gettingr every minion in every wave before the 5min mark. Then practice just last hitting the minions without losing one. Do this with all the champions you are interested in playing,  and then practice forcing the lane to freeze or push the way you want while playing against a bot.  Being able to get those things down will help you a lot. \nThen focus on poking a bot down while not losing cs, or \ntaking too much poke back. \n\nEarly laning mechanics are extremely important for every player to know,  and can make such a large difference in a game. \n\nIf your interested in what to build on a champ check out lolking, solomid,  and other guides. They will even help You figure out How to set up a rune page and masteries. \n\nLastly. Do NOT worry about the runes tell you can buy lvl 3 ones. Otherwise you will just be wasting ip on things you will never use. \n\nFeel free to add me, or just message me if you have any questions.","replies":[]},{"poster":"JedenVojak","date":"2015-08-25T00:58:17.694+0000","up_votes":2,"down_votes":0,"body":"It's because people want to try and make it a game about skill instead of just a room full of guys punching each other.","replies":[]},{"poster":"Rivertrance","date":"2015-08-24T18:45:56.955+0000","up_votes":2,"down_votes":0,"body":"League is a huge knowledge dump. There are so many things to learn that it can take a long time to figure out half the stuff you need to know to preform well. Feel free to add me in game. I love helping new players out.  Good luck on the rift summoner.","replies":[]},{"poster":"Lexy Kitten","date":"2015-08-24T11:00:36.089+0000","up_votes":1,"down_votes":0,"body":"If you ever want someone friendly you can add me. I have helped a few others and I always try to be nice. Sometimes trolls do get under my skin but eh. I also have a lot of friendly friends (which almost sounds redundant).\n\nI'm a level 30 though so I don't know if you want to tag along for that skill level.","replies":[{"poster":"White Wolf180","date":"2015-08-24T15:36:20.863+0000","up_votes":2,"down_votes":0,"body":"i dont mind playing against level 30s. Its the playing against someone with such a huge advantage over me and then having to rub it in my face if they beat me that i dont like","replies":[]}]},{"poster":"FizzyDemonz","date":"2015-08-24T02:53:49.375+0000","up_votes":2,"down_votes":0,"body":"I'm actually surprised that i haven't had too many toxic people in my games lately. I love playing support and had to deal with a LOT of harass and abuse early on like lvl's 10-20 but now im almost lvl 30 and i just dont find it much....","replies":[]},{"poster":"KVbqbFsC8e","date":"2015-08-25T06:30:46.975+0000","up_votes":3,"down_votes":1,"body":"Welcome to the Internet.","replies":[]},{"poster":"XVI Jake IVX","date":"2015-10-20T08:04:19.069+0000","up_votes":1,"down_votes":0,"body":"Hey Buddy if you want you can play with me ,and I can teach you some stuff. I can also help you get in an attitude that Riot Lyte would love :3 ","replies":[]}]}