{"poster":"Mastro Polentaio","date":"2015-04-30T11:54:11.095+0000","title":"Nocturne","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"popolo dei top jungler a me!\r\nda quanto non si vede un nocturne nella landa? me lo consigliereste da comprare, &egrave; aviabile?","replies":[{"poster":"CallMeSamurai","date":"2015-04-30T12:25:11.797+0000","up_votes":3,"down_votes":0,"body":"tutto è accettabile. tutto è possibile da giocare...dipende sempre da te. da il giocatore. non ti dirò il solito discorso \"beh si sono campioni migliori...\" \"beh nel meta attuale....\" \"dipende dal team\". io ti dico si compralo è divertente a me piace molto.","replies":[]},{"poster":"Blehic","date":"2015-04-30T13:24:25.994+0000","up_votes":2,"down_votes":0,"body":"io lo trovo assurdamente forte in mid e in late game ma devi saperlo usare perchè in early fatica molto a gankare fino a quando non sblocca la R a quel punto è l'inferno per gli avversari basta che lo bildi giusto e in team fight grazie alla R sorpassi i tank avversari e uccidi con pochi colpi l'adcarry o l'apcarry avversario oltre che grazie alla W pari una abilità nemica che insieme al velo della banshe par ben due abilità di fila che sia uno stun o uno slow è il mio champ preferito e lo trovo anche esteticamente fantastico te lo consiglio vivamente ma te lo dico non è facile da usare è il mio main{{champion:56}} :)","replies":[{"poster":"Tronjheim97","date":"2015-05-01T12:38:16.383+0000","up_votes":1,"down_votes":0,"body":"woooooooooooooooooooooooooor","replies":[{"poster":"Blehic","date":"2015-05-01T18:04:03.261+0000","up_votes":1,"down_votes":0,"body":"trooooonnnnnn","replies":[]}]}]},{"poster":"Annielated","date":"2015-04-30T21:58:15.739+0000","up_votes":1,"down_votes":0,"body":"Niente si crea, nulla si distrugge ma tutto è #viabile.\nPerciò se ti piace compralo e giocalo, anche se top per me è meglio che jungler :o","replies":[]},{"poster":"Mastro Polentaio","date":"2015-04-30T13:28:26.997+0000","up_votes":1,"down_votes":0,"body":"grazie tosi.. esaustivi e concisi ( avete spiegato bene e con poche parole.. ma la prima frase suona meglio :P )","replies":[{"poster":"ßL4CKH0L3","date":"2015-04-30T20:24:41.109+0000","up_votes":1,"down_votes":0,"body":"secondo me i jungler come nocturne sono fuori da questa meta senza contare che senza ult le sue gank non sono proprio niente di che..\noltretutto non è affatto tra i junglers più facili da usare e anche se lo buildi bruiser con omen e corazza spirituale resta comunque abbastanza squishy","replies":[]}]}]}