{"poster":"NightDemonLight","date":"2018-09-22T19:32:16.228+0000","title":"You can't insult in English, but you can in other languages.. Why?","subforum":"Player Behavior","up_votes":4,"down_votes":1,"body":"Seriously, I don&#039;t understand why I can&#039;t get insulted with English words, but I can get insulted with **other languages** words.\r\n\r\nThis is beyond being **careless**, I think Riot already knows that its community isn&#039;t only made from English people, then why didn&#039;t this get fixed?\r\nWhy can&#039;t people tell me to fuck off in English but they can in any other languages?\r\n\r\nIs this what Riot wants? I mean, English is used a lot and I understand why they filtered English, but what about other languages?\r\n\r\nYou can basically evade the system by just using your native language since the words won&#039;t be censored, but what&#039;s worst is that I&#039;ve noticed that some words aren&#039;t censored in-game but, in the post-game chat these words are censored.","replies":[{"poster":"AJStarhiker","date":"2018-09-22T21:26:55.622+0000","up_votes":5,"down_votes":0,"body":"The system uses a machine learning system. If you use an insult from a minority language for a region, there's a good chance the other players won't recognize the insult and therefore don't report it. And without reports the system used *in that region* won't learn to trigger on it.\n\nTo complicate things further, some words used to insult may have completely innocent uses--sometimes even within the same language.","replies":[]},{"poster":"EvilDustMan","date":"2018-09-22T20:07:36.344+0000","up_votes":5,"down_votes":0,"body":"You can still report them and they will get punished.","replies":[{"poster":"Saezio","date":"2018-09-22T20:48:31.475+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EvilDustMan,realm=NA,application-id=ZGEFLEUQ,discussion-id=OEhtai81,comment-id=0001,timestamp=2018-09-22T20:07:36.344+0000)\n>\n> You can still report them and they will get punished.\n\nNah they won't. You think riot has people debunking what way I type greek in the Roman alphabet?","replies":[{"poster":"EvilDustMan","date":"2018-09-22T21:50:55.028+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Saezio,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=OEhtai81,comment-id=00010000,timestamp=2018-09-22T20:48:31.475+0000)\n>\n> Nah they won&#x27;t. You think riot has people debunking what way I type greek in the Roman alphabet?\n\nIt has come to the boards several times, where people type something in another language and people just press google translate.","replies":[{"poster":"Saezio","date":"2018-09-22T22:41:38.536+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EvilDustMan,realm=NA,application-id=ZGEFLEUQ,discussion-id=OEhtai81,comment-id=000100000000,timestamp=2018-09-22T21:50:55.028+0000)\n>\n> It has come to the boards several times, where people type something in another language and people just press google translate.\n\nYou cannot use google translate because my language uses another alphabet normally. But there is a romanized way to \"type\" Greek which is of course not a real language but just a way for Greeks to speak with the roman alphabet online google translate wouldn't catch 20% of what someone typed. Imagine if someone typed the \"sound\" of Chinese (Mandarin?) words with roman characters . would that be translatable by google? (maybe because Mandarin is way more used globally than Greek but you get the point)\nExample : μαλάκας = malakas (wanker)","replies":[{"poster":"EvilDustMan","date":"2018-09-23T01:30:05.011+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Saezio,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=OEhtai81,comment-id=0001000000000000,timestamp=2018-09-22T22:41:38.536+0000)\n>\n> You cannot use google translate because my language uses another alphabet normally. But there is a romanized way to &quot;type&quot; Greek which is of course not a real language but just a way for Greeks to speak with the roman alphabet online google translate wouldn&#x27;t catch 20% of what someone typed. Imagine if someone typed the &quot;sound&quot; of Chinese (Mandarin?) words with roman characters . would that be translatable by google? (maybe because Mandarin is way more used globally than Greek but you get the point)\n> Example : μαλάκας = malakas (wanker)\n\nhttps://www.google.com/search?q=malakas&oq=malakas&aqs=chrome..69i57j0l3.1307j0j4&client=ms-android-verizon&sourceid=chrome-mobile&ie=UTF-8\n\nRemember they adjust to every language.","replies":[{"poster":"Saezio","date":"2018-09-23T01:52:53.457+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EvilDustMan,realm=NA,application-id=ZGEFLEUQ,discussion-id=OEhtai81,comment-id=00010000000000000000,timestamp=2018-09-23T01:30:05.011+0000)\n>\n> https://www.google.com/search?q=malakas&amp;oq=malakas&amp;aqs=chrome..69i57j0l3.1307j0j4&amp;client=ms-android-verizon&amp;sourceid=chrome-mobile&amp;ie=UTF-8\n> \n> Remember they adjust to every language.\n\nYeah that was the most common and known word in the greek language though ;)\nAnd frankly, I don't see riot employees running that procedure for every report xD","replies":[]}]}]}]}]}]},{"poster":"Jo0o","date":"2018-09-22T20:35:48.963+0000","up_votes":3,"down_votes":0,"body":"I haven't seen this to be true. Had a few folks complaining about their restrictions/bans for stuff in other language last week, if memory serves.","replies":[]},{"poster":"Tyaisurm","date":"2018-09-22T20:10:47.157+0000","up_votes":3,"down_votes":0,"body":"Creating an \"omni-filter\" for all possible variations would need too much work, and removing chat would just be easier alternative. It would also be problematic, since many things would be evaded by using creative alternatives, which in turn would need to be censored as well. And if the previous would happen, multiple completely normal words would possibly get censored as well, since many words have different meanings.\n\nAnyway. Problems with creating multilingual filters imo:\n- language is not binary, and meanings of words would clash with each other\n- work hours used to develop solution to this is too valuable\n- different characters and combinations (like Ä or Å) cause more variation and problems\n- variations created by mixing two or more languages creates even more problems (like talking in weird english-spanish mixture)","replies":[]},{"poster":"Silent Gravity","date":"2018-09-22T21:52:23.874+0000","up_votes":2,"down_votes":0,"body":"The chat filters have no bearing at all on if chat is punishable or not. The chat filters are only there for the people who want to have it enabled. If the chat filters were on, and applied to all the different ways to phoneticize every language, then an extreme amount of regular typing in any language would be difficult to understand because of excessive %%%%% blocking everything. \n\nFor example, you would be unable to type any word that used　\"ぐ\" because it sounds like racist slang in another language. That would severely hamper communicating in Japanese.\n\nIf there is a specific insult that you would appreciate being added to the in-game filter, I would suggest creating a support ticket to ask for that to be added.\n\nThe IFS functions all over the world. It can read, understand, and punish toxic communication in any language. The IFS is informed by reports, and curated by humans.\n\nI've specifically seen it punish racist slang expressed in Vietnamese (it surprised me that it was detected), and regular insults in Polish, Chinese, French, and Russian.","replies":[]},{"poster":"DrCyanide","date":"2018-09-22T20:12:10.811+0000","up_votes":1,"down_votes":0,"body":"EU problems.","replies":[{"poster":"DearPear","date":"2018-09-22T20:20:04.049+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DrCyanide,realm=NA,application-id=ZGEFLEUQ,discussion-id=OEhtai81,comment-id=0003,timestamp=2018-09-22T20:12:10.811+0000)\n>\n> EU problems.\n\nNot really. Every language is detected by the IFS so really OP don't know shit.","replies":[]}]},{"poster":"breakordoom444","date":"2018-09-22T20:06:37.000+0000","up_votes":1,"down_votes":1,"body":"An insult is only an insult if one chooses it to be.\n\nIf I'm on the Chinese servers, and someone calls me a retard in polish, I'm not gonna understand it, so I won't take offence.\n\nbut since English is the main language in this region of the world, English is the only language regarded.\nand even if riot was to look into these cases, the chances of someone telling someone to fuck off in English is A LOT more likely then in Chinese, so it would be a waste of time for a pointless goal.\n\nand plus, if you were.... from a remote region in Iceland and I call you a dumbass in Italian, you wouldn't understand it, and thus you wouldn't care.","replies":[{"poster":"R107 Games","date":"2018-09-22T20:24:03.606+0000","up_votes":2,"down_votes":1,"body":"^^ also anything is offensive if one chooses it to be","replies":[]},{"poster":"Saezio","date":"2018-09-22T20:46:36.407+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=breakordoom444,realm=NA,application-id=ZGEFLEUQ,discussion-id=OEhtai81,comment-id=0000,timestamp=2018-09-22T20:06:37.000+0000)\n>\n> An insult is only an insult if one chooses it to be.\n> \n> If I&#x27;m on the Chinese servers, and someone calls me a retard in polish, I&#x27;m not gonna understand it, so I won&#x27;t take offence.\n> \n> but since English is the main language in this region of the world, English is the only language regarded.\n> and even if riot was to look into these cases, the chances of someone telling someone to fuck off in English is A LOT more likely then in Chinese, so it would be a waste of time for a pointless goal.\n> \n> and plus, if you were.... from a remote region in Iceland and I call you a dumbass in Italian, you wouldn&#x27;t understand it, and thus you wouldn&#x27;t care.\n\nWell us that live in Europe are familiar with swear words in English French Italian German POLISH because if we are gamers  for 10 years(let's say) playing different games you get to learn all kind of sexy ass insults. So we understand a great deal of it and although it is nice to know what they are saying I am always pretty sceptical when I report with the description \"Check this guys chat, if you can't get it translate from croatian (or whatever language)\" because I am fucking 100% sure none sees it.","replies":[]},{"poster":"SonicAF","date":"2018-09-22T20:37:04.800+0000","up_votes":1,"down_votes":2,"body":"> An insult is only an insult if one chooses it to be.\n\nWhich is one of the reasons there should be no chat moderation.","replies":[]}]},{"poster":"Drugoth","date":"2018-09-22T22:06:45.904+0000","up_votes":1,"down_votes":0,"body":"Who cares, just report them.\n\nI believe it's good enough that the profanity filter for NA censors english words, after all, >90% of the population speaks english on the NA server...","replies":[]}]}