{"poster":"Gabesz00","date":"2015-02-09T17:10:07.386+0000","title":"Kérnék egy reportot LOL ACADEMY","subforum":"Segítség és támogatás","up_votes":1,"down_votes":0,"body":"Sziasztok! Mielőtt bárki megijedne nem teljesítmény miatt kérném kedves \"seraphr\" reportját hanem mert szolgáltatást akart nekem nyújtani szó szerint:  LOL ACADEMY\r\n  We carry you out of elo hell\r\nNos mivel végül is az accountomat kéri hogy felhúzzon mit tudom én melyik divisionbe ezért mihamarabb kérném a játékból végleges tiltását!\r\nElőre is köszönöm!","replies":[{"poster":"M4dr4c","date":"2015-02-09T17:14:19.561+0000","up_votes":2,"down_votes":0,"body":"És ezt miért ide írod? Támogatás fül és nyiss egy új ticketet és írd meg nekik. Itt az egyik legkisebb esélye, hogy olvassa valaki, aki tehet érte. ;) Max a modik tudják továbbítani nekik.","replies":[{"poster":"Gabesz00","date":"2015-02-09T17:33:21.256+0000","up_votes":1,"down_votes":0,"body":"Ó hát köszi :D\nAzért ezt jó lesz itt hagyni figyelmeztetésül!","replies":[]}]},{"poster":"Tazsam","date":"2015-02-09T22:01:58.992+0000","up_votes":1,"down_votes":0,"body":"Mea culpa, még egy ilyen és pozitívvá változik a véleményem.","replies":[]},{"poster":"Tazsam","date":"2015-02-09T18:05:27.830+0000","up_votes":1,"down_votes":0,"body":"Kb. egy éve hasonlóért írtam a supportnak, akkor %%%%%%%-t hirdettek ingame chaten. Kaptam egy választ, hogy miképpen vigyázhatok az accomra. Vissza is írtam, hogy nem kellenek tanácsok köszönöm szépen, nekem az kell, hogy az ilyeneket gyomlálják ki a játékból akár válasz nélkül. Erre jött egy válasz, hogy mennyire vagyok elégedett a supporttal. Tiszteletből nem válaszoltam.\n \nSzóval tapasztalatom szerint sajnos teljesen felesleges írni a supportnak ilyen ügyben. Egyszerűen tedd fel blacklistre és írj ide a fórumra pont ahogy tetted, hogy én is tilthassam :)\n\nTudom hogy tilos nevesíteni a fórumon de a múlt példája azt mutatja, hogy még mindig ez a hatékonyabb módszer, ha meg valaki visszaél ezzel akkor így jártunk, egy potenciális baráttal kevesebb, marad még elég.","replies":[{"poster":"Gabesz00","date":"2015-02-09T21:38:54.377+0000","up_votes":1,"down_votes":0,"body":"Nekem egy teljesen kulturált választ adtak! Elmeséltem nekik mindent, és például örömmel vették hogy kiírtam fórumra mert ezzel is figyelmeztettem \"Idéző társaimat\". Nem utolsó sorban pedig iszonyat jó fej volt Rapali (ő válaszolt a levelemre[megjegyzem max. egy órán belül]), és végül is felkerült a fekete listájukra a LOL ACADEMY, és nyomozás indul ellenük. Úgy hogy én teljesen meg vagyok velük elégedve {{item:2010}}","replies":[]}]}]}