{"poster":"Volvaif","date":"2016-02-03T09:53:20.074+0000","title":"Ping ottimo, lag continuo","subforum":"Aiuto e supporto","up_votes":3,"down_votes":1,"body":"Salve,\nda un paio di giorni riscontro questi strani problemi&igrave;:\n\n- Dalla selezione dei campioni i miei messaggi arrivano sempre in ritardo, anche se sono in stanza da 30 secondi i messaggi arrivano 5/6 sec. dopo. \n\n- Durante il caricamento degli evocatori, si blocca tutto e per entrare in partita devo chiudere e riaprire il client, se sono fortunato riesco ad arrivare in lane con i minion.\n\n- **Il problema maggiore** per&ograve; si presenta durante il game. Nonostante avessi un ping di 60 stabile con 150 FPS medi, ogni 2/3 minuti mi scrive &quot;**TENTATIVO DI RICONNESSIONE* che dura circa 20/30 secondi, nei quali ovviamente succede di tutto. \n\nNon so pi&ugrave; dove sbattere la testa, questa cosa si presenta a tutte le ore, mattina/pomeriggio/sera/notte.\n\n\nGrazie in anticipo. Buona giornata.\n\n\nEDIT: Ho eseguito la riparazione del client. Non è cambiato nulla.","replies":[{"poster":"Chroniicles","date":"2016-02-03T09:57:45.265+0000","up_votes":5,"down_votes":0,"body":"Ciao, i tuoi mi sembrano proprio i sintomi di una connessione che perde pacchetti.\nSegui queste linee guida per identificare di preciso il problema però: https://support.riotgames.com/hc/it/articles/201752664-Risolvere-i-problemi-di-connessione\nFacci sapere se riesci a venirne a capo","replies":[{"poster":"Volvaif","date":"2016-02-03T12:15:47.160+0000","up_votes":1,"down_votes":0,"body":"Grazie per le risposte tempestive, proverò il consiglio. Sono collegato via cavo.","replies":[]}]},{"poster":"SpideyPizza","date":"2016-02-03T09:59:47.962+0000","up_votes":4,"down_votes":0,"body":"prova a seguire questi consigli:\n\n- fai un ping verso 8.8.8.8 ,controllando cosi lo stato generico della rete\n- aggiorna i driver, cosi eviti problemi dedicati al software\n- controlla con antivirus, antispiware problemi dedicati allo sniffing \n- controlla gli aggiornamenti software del tuo sistema operativo\n\n\nquesti problemi li ha anche su altre applicazioni?","replies":[]},{"poster":"Ringiel","date":"2016-02-03T10:15:25.292+0000","up_votes":3,"down_votes":0,"body":"mica giochi con il wifii?se è così prova a vedere se con l'ethernet cambia qualcosa","replies":[]},{"poster":"Volvaif","date":"2016-02-03T13:54:14.801+0000","up_votes":1,"down_votes":0,"body":"Ho fatto un test durante il gioco. Mentre mi scriveva \"tentativo di connessione\" lanciavo ping verso 8.8.8.8 e non riscontravo problemi.\n\nA fine partita ho lanciato due ping continui verso l'italia e verso l'estero ed ho perso circa il 3% di pacchetti in circa 250ping verso quest'ultimo. Ho contattato il mio gestore e monitoreranno la mia connessione per due giorni e facendo il classico reset del modem.","replies":[]},{"poster":"Volvaif","date":"2016-02-03T21:44:09.255+0000","up_votes":0,"down_votes":0,"body":"Aggiornamento.\n\nIl \"classico\" reset del modem sembra aver funzionato, problemi spariti. Grazie a tutti per la collaborazione, spero di non dover riesumare questo post.","replies":[]}]}