{"poster":"Big Lincoln","date":"2018-04-20T09:14:06.978+0000","title":"i don't feel like we're far off from the game being great","subforum":"Gameplay","up_votes":6,"down_votes":4,"body":"- top is not terrible anymore, fighters are coming back into relevance for &gt;most&lt; ELOs that the majority of us are ever going to play in\r\n- mid lane is going to lose its focus on monster waveclear mages, hopefully will reopen the lane\r\n- bot lane is going to receive huge changes in midseason (allegedly, for cynics) that will break marksmen monopoly on their place in bottom. hopefully not without allowing them to head into other lanes as well; mid changes might already have that covered\r\n- new items in the pipe for fighters\r\n\r\nMy only major issues with the game now is the jungle and the generosity of CC. i have high hopes for mid-season","replies":[{"poster":"nelogis","date":"2018-04-20T09:27:09.627+0000","up_votes":2,"down_votes":0,"body":"We still need to find a solution for high elo fighters, or not even that, we could just nerf tanks and stuff like Gnar, that would fix a lot of things.\n\nAnd maybe NOT buff Kennen.\n\nThough yes, the ADC update looks promising.... we shouldn't say that it won't be a problem.\nYou never know, Riot hasn't been known for their great changes lately, so the solution to ADC might be further away than we expect.\n\nPlus Riot needs to stop blancing around pro play, I don't mind balancing around challenger SoloQ or whatever but not pro-play.\n\nIf you want to balance around pro-play then everyone who plays the game needs a voice chat with every team member.\nSo we can communicate like the pros to play like the pros because the game is balanced around the pros.","replies":[]},{"poster":"OP Garen Support","date":"2018-04-20T11:48:12.455+0000","up_votes":1,"down_votes":0,"body":"Until Garen becomes viable again with all the jungler pressure and cancer true damage dealing champs going there. Top wont stop being horrible :P","replies":[]},{"poster":"Kelg","date":"2018-04-20T10:51:39.700+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Big Lincoln,realm=NA,application-id=3ErqAdtq,discussion-id=5whppyvm,comment-id=,timestamp=2018-04-20T09:14:06.978+0000)\n>\n> - bot lane is going to receive huge changes in midseason (allegedly, for cynics) that will **break marksmen monopoly on their place in bottom**. hopefully not without allowing them to head into other lanes as well; mid changes might already have that covered\n\nnever gonna happen","replies":[]},{"poster":"Sahn Uzal","date":"2018-04-20T10:15:51.166+0000","up_votes":1,"down_votes":1,"body":"What's up with the Downvotes on this thread lol","replies":[{"poster":"Big Lincoln","date":"2018-04-20T10:16:49.290+0000","up_votes":1,"down_votes":2,"body":"im too smart for boards","replies":[]}]}]}