{"poster":"0TP Flyrai","date":"2018-09-30T12:08:57.210+0000","title":"Leavebuster für Update! :....(","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey{{champion:105}} , mein Name ist Flyrai und da ich nicht weis wo ich mich melden soll schreibe ich es einfach hier rein. \r\n\r\nMein Name ist Ingame 0TP Flyrai und ich habe gerade 5x 20 Minuten Leavebuster bekommen weil mein Computer oder irgendwas ein update gemacht hat! Denn dadurch hat sich mein Computer neugestartet und ich habe versucht das update zu umgehen. Das dauerte ver.... 10 MINUTEN{{champion:9}}. Dann hat mein Team surrendert und mich wahrscheinlich wegen &quot;AFK&quot; reported{{summoner:11}} ! Ich habe einfach keine Lust meine Zeit mit warten zu verbringen, Ich spiele dieses Spiel h&auml;ufig und auch gerne und 5x 20 Minuten sind einfach zu viel! {{champion:32}} \r\n\r\n\r\nHoffe das ich irgendwie diesen Leavebuster wieder weg bekomme au&szlig;er zu warten.{{sticker:sg-zephyr}} \r\n\r\n\r\nDanke f&uuml;r die Hilfe vorab.","replies":[{"poster":"legofreak1","date":"2018-09-30T12:18:30.090+0000","up_votes":1,"down_votes":0,"body":"Deinen Mitspielern und dem Leaverbuster ist es egal, weswegen du nicht am Spiel teilnimmst. Das Ergebnis ist immer dasselbe: Dein Team hat einen Nachteil. Deswegen wird nicht zwischen technischen Probleme und tatsächlichen, unausweichlichen Ereignissen differenziert, der Leaverbuster besitzt aber Toleranzen, bevor man erstmalig eine Strafe erhält. Damit wird sichergestellt, dass man sich um technische Probleme kümmern kann oder nicht bestraft wird, wenn man sich plötzlich und unvorhersehbar um wichtigere Dinge kümmern muss. Das bedeutet aber auch, dass man sich um die Einsatzfähigkeit seiner Hardware kümmern muss und man selbst dafür verantwortlich ist, dass der PC auch funktioniert. Updates in Windows kannst du planen und vor dem Spiel oder beim Herunterfahren des PCs ausführen lassen, dann kommen diese nicht plötzlich während des Ladebildschirms.","replies":[]}]}