{"poster":"IG ToXiC","date":"2017-06-17T19:23:05.388+0000","title":"Falsche Bildschirmauflösung crasht Game?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich habe das Problem, dass ich ingame versehentlich eine falsche Bildschirmaufl&ouml;sung benutzt habe, welche das Spiel zum abst&uuml;rzen brachte, nun kann ich keine Runde mehr starten da das Spiel st&auml;ndig vor dem Loadingscreen abst&uuml;rzt und die Bildschirmaufl&ouml;sung sich (mir bekannt) nur ingame &auml;ndern l&auml;sst. Gibt es einen Weg die Bildschirmaufl&ouml;sung f&uuml;r den Ingame-Screen auch au&szlig;erhalb des Spiels zu &auml;ndern, wenn ja wie? und wie finde ich heraus, welche Bildschirmaufl&ouml;sung f&uuml;r meinen Monitor am besten geeignet ist? Bitte dringen um Hilfe, um weitersuchten zu k&ouml;nnen, vielen Dank im Voraus :)","replies":[{"poster":"TerminatorTPK","date":"2017-06-30T21:50:23.805+0000","up_votes":1,"down_votes":0,"body":"Ich habe das Problem ich habe alles gemacht was gesagt worden ist und in die Dateien gegangen aber der Witz ist, dass es schon die richtigen einstellungen waren aber es trotzdem nicht klappt.","replies":[]},{"poster":"IG ToXiC","date":"2017-06-18T09:37:40.178+0000","up_votes":1,"down_votes":0,"body":"Vielen dank für deine Antwort, leider half dies nur 1 Spiel lange, nach diesem hatte ich wieder das selbe Problem, dass ich nach der Champselect Blackscreen bekam anstatt in den Loadingscreen zu kommen und ich ständig den PC neu starten muss, um ins Spiel zu kommen, was oft zu spät ist da mein Team schon beim Remake ist wenn ich zurückkomme, DirectX9 neuzuinstallieren funktioniert nicht, da dies anscheinend nicht mit meiner Windows 10 Version kompatibel ist.","replies":[{"poster":"recon","date":"2017-06-18T16:03:00.188+0000","up_votes":1,"down_votes":0,"body":"Klick beim nächsten Mal auf \"Antworten\" unter meinem Beitrag, dann bekomme ich eine Benachrichtigung ;)\n\nDas was du jetzt beschreibst ist aber ein komplett anderes Problem, oder sehe ich das falsch?\nLösche die **game.cfg** nochmals und zusätzlich auch die **PersistedSettings.json** im selben Ordner.","replies":[]}]},{"poster":"recon","date":"2017-06-17T20:04:04.557+0000","up_votes":1,"down_votes":0,"body":"Das kannst du in der Datei **game.cfg** machen. Diese befindet sich im Ordner **Config** in deinem League of Legends Ordner.\n\nFolgende Werte müssen angepasst werden:\n> Height=1080\nWidth=1920\n\n Die richtigen Werte findest du, wenn du einen Rechtsklick auf deinen Desktop machst und dort auf Bildschirmauflösung gehst.\n\nFalls das nicht klappt, kannst du die besagte **game.cfg** einfach löschen. Das setzt dann alles auf Standard zurück.","replies":[]}]}