{"poster":"Bezai","date":"2017-10-13T23:15:09.319+0000","title":"¿No era mas facil?...","subforum":"Comportamiento del jugador","up_votes":6,"down_votes":2,"body":"Despues de dos meses sin jugar, volvi un poco, no esperaba ni un cambio en la comunidad, dos meses no hacen milagro.\r\nSimplemente para descansar de tanta toxicidad me puse a jugar otros juegos.\r\n\r\nBueno, obviamente no volvi de la mejor manera, tengo partidas malas, partidas buenas.\r\nPero hasta ahora no habian flameado tanto, ni una partida me habia hecho doler la cabeza como antes.\r\n\r\nPero la de recien, volvio a lo mismo, a hacerme doler la cabeza.\r\n\r\nDesde la seleccion de campeon diciendome que pickear en una normal, o sea, desde cuando los demas deciden lo que juego?, un jhin, teemo y galio los tres flameando en la seleccion de campeon.\r\n\r\nEl teemo siguio 10 min de partida, el jhin desde el min 1, hasta el final hasta el min 48 siguio flameandome.\r\n\r\nAhora yo me pregunto, iba bastante bien yo, termine 28/4, podiamos ganar la partida facilmente, incluso con soraka afk desde el min 15, que no se se debe haber enojado por el pick tambien porque me ignoro toda la partida nunca me curo ni nada.\r\n\r\nPodriamos haber ganado, pero galio, teemo y jhin, estaban sumamente centrados en alejarse de mi, en vez de ir conmigo y dejar que los carree o intente carrearlos, yo me pregunto, no era mas facil callarse y jugar conmigo en vez de estar atacandome toda la partida?, si se juntaban conmigo ganabamos, era asi.\r\n\r\nPero no, era mejor insultar a muerte al twitch jg que tratar de ganar, da mas gusto, llena mas, es mejor que ganar o no?...\r\n\r\nIncluso en unos de sus cientos o miles de: &quot;report twitch %&amp;%$&amp;&quot; del jhin, el teemo dijo: &quot;yo le doy honor&quot; y, en ese entonces el jhin se puso a flamear al teemo, pero el teemo aunque sea se habia calmado, me ignoraba igual eh, porque les decia acompa&ntilde;enme al baron que estan ahi haciendolo o algo y se iban todos para el lado contrario y despues los 3 me tiraban se&ntilde;as encima.\r\n\r\nUna pena, me pregunto por que eligieron perder en vez de ayudarme, pero bueno, otra vez parece que a dejar el lol un par de meses porque esto realmente hace doler la cabeza, tengo la nuca a pedazos del dolor...\r\n\r\n\r\nhttps://imgur.com/a/48753\r\n\r\nNi eso hacia el galio, le pedia por favor que se compre botas y ni eso.\r\nYo las vendi en el ultimo back a ver si podia baitear con el angel pero ni llegue a salir de base que ya habian ganado...","replies":[{"poster":"LaReinaPingüino","date":"2017-10-14T00:05:10.301+0000","up_votes":5,"down_votes":0,"body":"Yo que tu los reporto al soporte, era premade, \n\n\nY no te preocupes, ellos cláramente tienen problemas mentales. Para jugar lol  no te piden requisitos y muchos sociópatas se meten, tú no te rebajes a su nivel y nunca olvides reportar. Además yo que tú anoto sus nombres de invocador para dodgear si te toca con ellos otra vez","replies":[{"poster":"Bezai","date":"2017-10-14T00:11:19.261+0000","up_votes":2,"down_votes":0,"body":"Mucho trabajo ir al soporte y seguramente no reciban ni un castigo.\n\nY como supiste que eran premades?, y tranquilo o tranquila, nunca me rebajo a su nivel, quiero conservar mi honor intacto jaja xD","replies":[{"poster":"TeQuiLa66","date":"2017-10-14T00:30:44.379+0000","up_votes":3,"down_votes":0,"body":"> Mucho trabajo ir al soporte y seguramente no reciban ni un castigo.\n\n\nIntentalo. Yo Reporte a dos personas por xenofobia, y si recibieron su Respectivo castigo, si tu no crees en el Soporte es una cosa.","replies":[]},{"poster":"Mergueler","date":"2017-10-14T01:54:56.654+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bezai,realm=LAS,application-id=PJAKt7ph,discussion-id=hTifgWdE,comment-id=00020000,timestamp=2017-10-14T00:11:19.261+0000)\n>\n> Mucho trabajo ir al soporte y seguramente no reciban ni un castigo.\n\nEs más o menos el mismo trabajo que hacer este post, con la diferencia de que el reporte puede ayudar a que los penalicen y mejore elambiente del juego y este post simplemente te sirve a vos para ventilar tu frustración.","replies":[]},{"poster":"LaReinaPingüino","date":"2017-10-14T22:36:31.209+0000","up_votes":1,"down_votes":0,"body":"Porque me han pasado cosas así con premdes \"especiales\". Y porque esa actitud de ellos es demaciado estúpida, entonces es poco probable que alguien vea a un tipo haciendo eso y piense: \"buena idea, haré lo mismo\" a menos que sean premade","replies":[]}]}]},{"poster":"iTargaryen","date":"2017-10-14T01:58:19.262+0000","up_votes":1,"down_votes":1,"body":"Perdón si ofendo por lo que voy a decir, pero es gente enferma, gente que no razona, si ya de por sí son así no sirve seguirles la corriente ni menos calentarte.. esta bien que te parece injusto, pero (y no por hacerme el malo ni nada) yo ya estoy tan acostumbrado que desde hace tiempo nadie ha logrado frustrarme, desde los llamados \"trolls\" (que de trolls no tienen nada) hasta los tóxicos, la verdad no hay mejor cosa que cerrarle el orto a gente así, ya sea devolviéndoles el insulto pero bien puesto o terminando mejor que ellos.\nY otra cosa, aunque muchos no me crean, no hay cosa que más odien este tipo de persona que ignorarlas, realmente, si sabés como llevarles la corriente sin arrastrarte, vas a lograr que ellos mismos se frustren.\nEn fín, no te dejes llevar por uno o dos pelotudos detrás de una pantalla.","replies":[{"poster":"iTargaryen","date":"2017-10-14T02:43:07.193+0000","up_votes":1,"down_votes":1,"body":"y otra cosa, ya me ha pasado varias veces lo del caso tuyo y la verdad me parece una de las cosas situaciones más estúpidas por las que pase por juegos, porque si vamos al caso, ¿te imaginas en la vida real alguien gritandote \"TE HUBIESES COMPRADO -X- AUTO O -X- COSA, PELOTU##\" y que se te ofenda por algo así?, me parece algo tan estúpido ya de pensarlo, \npero lo primero que tenés que hacer es ponerle \"chupame bien la punta de la cho## y limpiame toda la ricota\" y elegir LO QUE SE TE CANTE EL QUINTO FOR## DE LAS PELOTAS. Es así de simple, al otro no le importa lo que vas a elegir, lo que te gusta o lo que sea, solamente uno puede recibir bien cosas así cuando no TE FORRE## y te escriban bien, así como vos no dijiste nada y simplemente elegiste algo que querés usar, el otro puede decirte lo que quiera siempre y cuando sea RESPETANDO LOS GUSTOS DEL OTRO sin insultar, sin presionar al otro y sin creerse el centro del universo.\n\nEs que es algo básico, creo que no hace falta ni modales ni educación para saber algo así, pero realmente es algo que poco debe importarte. Y si, muchos me van a decir tóxico por decir lo que acabo de poner arriba, pero; si el otro no me respeta, me insulta y me acosa ¿porqué encima tengo la obligación de no escribir nada y hacerme el que no leo? Una cosa es ignorar, que como ya dije antes, es lo mejor que podés hacer, y otra cosa es pasar de largo y hacer como que no paso nada y recién reaccionar al final de la partida (que no digo que esta mal). A lo que quiero llegar, podés devolver el insulto pero SIEMPRE intenta no rebajarte al otro porque si no te convertis en uno más, y si puede ser que me contradiga con lo que dije, pero creanme que no hay mejor cosa que encima de devolerle el insulto a alguien tóxico y maleducado, ignorarlo.\n\nPerdon por las mayúsculas, solo quiero dar mi opinión y hacerle entender a la gente algunas cosas sobre el tema.","replies":[{"poster":"Fetgod","date":"2017-10-14T06:17:00.363+0000","up_votes":1,"down_votes":0,"body":"Nah\nno son gente enferma,son idiotas que les gusta ver como los demas lloran arruinandoles la partida.\nasi es el 50% de las rankeds por lo que veo en los foros,no hay ningun dia en que alguien haga un blog sobre un flamer.","replies":[]}]}]},{"poster":"WhiteMax","date":"2017-10-14T00:03:58.513+0000","up_votes":1,"down_votes":0,"body":"A mi cuando me pasa eso  les digo claramente \"si era tan importante X campeon lo hubieras pickeado tu, aparte segun tu historial eres muy malo con el campeon que acabas de pickear\", ya que en general las cosas son asi.\n\nY ya dependiendo de si es una normal o rankeds tomo decision, si es ranked pues pickeo lo que necesite el equipo, solo pickeo lo  que piden si \"de verdad\" es el campeon necesario (y me banco la mala suerte de que me emparejen con ellos). Y si es una normal los ignoro rotundamente, me da igual si la composicion es mala, no juego para \"solo ganar\" sino para pasar el rato o practicar campeones.","replies":[]},{"poster":"ZanahoriaAsesina","date":"2017-10-13T23:23:15.980+0000","up_votes":1,"down_votes":0,"body":"Y si ellos no te seguían... ¿no era mejor segurilos?  Pregunta sincera.","replies":[{"poster":"Bezai","date":"2017-10-13T23:38:46.974+0000","up_votes":1,"down_votes":0,"body":"Sinceramente yo tambien me sorprendo jajaja, porque para mi parecia logico pero cada uno piensa a su manera.\n\nA quien iba a seguir?, a los que me les acercaba y se alejaban o se ponian a tirar back?, a los que me vendian?, o iba a seguir un ratito a cada uno porque hasta de ellos mismos se separaban iba uno por cada carril...\n\nNo podia seguir a nadie, ademas que iba demasiado mal, no aportaban mucho que digamos, sin contar que era yo el que salia de la Q y deleteaba 3, no ellos, la logica es que ellos me sigan a mi y me ayuden...","replies":[]}]},{"poster":"Tortuguita","date":"2017-10-14T00:22:19.282+0000","up_votes":1,"down_votes":3,"body":"Es una normal , ni te molestes xD","replies":[]}]}