{"poster":"RmLMero","date":"2015-09-14T08:26:34.964+0000","title":"Änderungswunsch für Leona","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Hallo Riot als erstes m&ouml;chte ich euch sagen das ihr super Arbeit leistet, ich spiele lol jetzt schon seit Jahren und auch wenn ich mal ne Pause brauche komme ich immer wieder auf das Spiel zur&uuml;ck.\r\n\r\nIch habe eine kleine Bitte an euch und hoffe das ihr wenigstens mal dar&uuml;ber nachdenkt. Ich habe mir Leona damals mit als ersten Champ gekauft und liebe es mit ihr zu spielen aber leider ist sie einer der Champs die man nur auf einer Position sehen will n&auml;mlich als Supporter. ich spiele zwar gern mal den Support aber haupts&auml;chlich f&uuml;hle ich mich im Dschungel oder Top am wohlsten und darum habe ich die bitte das man Leona wenigstens f&uuml;r die Toplane interessanter macht.\r\n\r\nIch glaube das man dies schon durch eine kleine &Auml;derung am passiv erreichen kann, indem sie \r\n1. das passiv selber ausl&ouml;sen kann (wo ich ehrlich gesagt nie verstanden habe warum das nicht geht) und\r\n2. das man den schaden des passivs mit z.B. den leben oder der ap skalieren l&auml;sst \r\n\r\nAn den F&auml;higkeiten selber gibt es nichts zu meckern und mir ist vollkommen klar das sie durch das massive cc schon sehr stark ist aber f&uuml;r etwas anderes als Support ist das nicht gut genug und darum wird man quasi zum Support mit ihr gen&ouml;tigt und das obwohl das Sternchen bei ihr im Teamersteller neben tank steht. \r\n\r\nDies trifft &uuml;brigens auch auf andere Champs zu und ist meiner Meinung nach auch der Grund warum man im Teamersteller Ewigkeiten auf nen Supporter warten muss.\r\nWenn man die Supporter etwas st&auml;rker macht und die Abh&auml;ngigkeit vom adc etwas senkt wie z.b. bei Anni, Lux, Tahm und Zyra dann w&uuml;rden die Spieler auch diese Position gerne spielen. Leider ist es so das man nichts machen kann wenn man mit dem adc nicht zusammen spielen kann egal aus welchem Grund!\r\nBei den oben genannten Champs kauft man einfach selber Schadens Items und kann so das spiel auf der bot noch drehen aber mit z.B. Leona kann man nichts ohne dd im Schlepptau ausrichten ausser Stun und Beine in die Hand :(. \r\n\r\nSo jetzt habe ich euch genug zugelabert und hoffe das ich wenigstens eine Anregung geben konnte auch wenn mein Wunsch nicht realisierbar sein sollte.\r\n\r\nIch bedanke mich noch mal f&uuml;r eure gute arbeit und hoffe das es noch lange weiter geht.","replies":[{"poster":"TheUnknown98","date":"2015-09-14T08:30:28.864+0000","up_votes":1,"down_votes":1,"body":"Nee das muss jetz nicht sein. Ich finde Leona ist als Support vollkommen ausreichend. Leona muss man nicht auf der Toplane spielen wollen, da gibts genug champs die besser auf die Top passen. Meiner Meinung nach ist sogar der Schaden von dem Eclipse zu hoch, damit hab ich schon so einige Kills geklaut :/","replies":[{"poster":"Alustus","date":"2015-09-14T08:42:30.525+0000","up_votes":1,"down_votes":0,"body":"Man kan sie btw. jetzt schon gut top spielen, wobei viele matchups nicht gut sind.\n\nJungle geht sie auch (ist am anfang aber sehr langsam und somit leicht zu counterjunglen)\n\n\nLeona ist super so wie sie ist.\nMan kann es nur schlechter machen wenn man sie ändert.","replies":[{"poster":"Corvis Rex","date":"2015-09-14T09:50:40.240+0000","up_votes":1,"down_votes":0,"body":"Warum sollte sie denn nur EINE Lane bekommen? Und ein dutzend andere Champs mehrere Lanes?","replies":[{"poster":"Alustus","date":"2015-09-14T10:05:54.664+0000","up_votes":1,"down_votes":0,"body":"Sie kann auf mehren lanes gespielt werden.\n\nUnd ist sogar damit erfolgreicher Spielbar als die viele andere Champs welche \"nur auf auf einer Lane gut sind)\n\nGerade Mid und Bot gibt es viele champs die nur dort ein sehr gutes ergebniss abliefern.\n\n{{champion:103}} {{champion:12}} {{champion:32}} {{champion:22}} {{champion:53}} {{champion:432}} {{champion:201}} {{champion:51}} {{champion:122}} {{champion:119}} {{champion:9}} {{champion:86}} {{champion:150}} {{champion:104}} {{champion:40}} {{champion:89}} {{champion:99}} {{champion:11}} {{champion:111}} {{champion:56}} {{champion:58}} {{champion:113}} {{champion:98}} {{champion:27}} {{champion:72}} {{champion:44}} {{champion:254}} {{champion:115}} {{champion:26}} {{champion:91}} {{champion:21}} \n\nSind alles Champs die man nu auf \"einer lane spielen kann\"\n(mir ist durchaus bewusst, dass man diese auch auf anderen lanes spielen kann, aber man sieht sie dort kaum bis gar nicht, so wie bei leona)\n+dann gibt es noch champs die man im moment prinzipiell kaum spielen kann.\n{{champion:78}} {{champion:6}} {{champion:83}} ....\n\nMid Laner/Top laner/Jungler gehen oft gut zu vermischen da die lanes ähnlich sind.\n","replies":[{"poster":"BloodyVampir","date":"2015-09-14T11:46:07.713+0000","up_votes":1,"down_votes":0,"body":"Poppy kann man spielen.","replies":[{"poster":"Alustus","date":"2015-09-14T12:14:21.404+0000","up_votes":1,"down_votes":0,"body":"Man kann alle Champions Spielen.\nMan kann auch alle diese Champions auf anderen lines spielen.\n\nAußerdem habe ich kaum gesagt. \n\nFakt ist in den meisten matchups ist sie eine schlechte wahl und man muss vieles mit skill ausgleichen. Es hat einen Grund warum sie aus der f2p rotation genommen wurde und demnächst auch ein Rework ala Sion bekommt(also vom ausmaß).","replies":[{"poster":"BloodyVampir","date":"2015-09-14T12:31:15.615+0000","up_votes":1,"down_votes":0,"body":"Ich weiß. Aber trotzdem ist sie besser als manch andere Champ in der Kluft. Sie ist in gar nicht so viele Matchups eine schlechte Wahl.","replies":[{"poster":"Alustus","date":"2015-09-14T12:53:13.847+0000","up_votes":2,"down_votes":0,"body":"Hm die meisten Toplane Meta champs sind stark gegen sie. \nDen vorteil den man aber mit ihr hat, dass viele das matchup nicht gut kennen und teilweise auch unterschätzen.\n\nIst zumindest mM.","replies":[]}]}]}]},{"poster":"Bergelmir32","date":"2015-09-14T11:59:32.336+0000","up_votes":1,"down_votes":0,"body":"Urgot kann man kaum spielen, warum denn das? Ist ja nicht so das an ihm was verändert wurde seit dem er kurz so populär war das schon wieder das üblichen \"OP pls nerf\" Geheule los ging.","replies":[{"poster":"Alustus","date":"2015-09-14T12:19:37.493+0000","up_votes":1,"down_votes":0,"body":"Er passt kaum in die meta.\n\nDas heißt nicht das man ihn nicht spielen kann, aber in den meisten teamcombos passt er nicht rein.\nDie stärke ist ganz okay aber er erfüllt nicht die aufgaben welche momentan von einem Toplaner/Adc/Midlaner gefragt sind.\n\nÄhnlich(wobei der Vergleich hinkt) wie Yorick welcher einer der stärksten lanebullys ist, und auch sicher nicht schwach.\nAber es gibt champions die die selben aufgaben wie er sie hat besser erfüllen.\n\nEs gibt momentan mMn keinen CHampion der unspielbar oder richtig schlecht ist.\n\nAußerdem ist er ziemlich langweilig zu spielen (zumindest empfinden es viele so), was auch erklärt warum er nach dem Hype ziemlich schnell wieder in der verdammniss versunken ist.","replies":[{"poster":"haha weed lol xd","date":"2015-09-15T06:23:01.777+0000","up_votes":1,"down_votes":0,"body":"Passt kaum in die Meta ? \n\nIceborn Core. Meta ? Check! \nFrozen Heart Core. Meta? Check! \nKann kiten. Meta? Check!\nArmorschred. Meta? Check! \n\nDie Meta ist sehr Juggernaut und Kitelastig. Deswegen kommen viele Champions die langsame aber dafür CC-lastige Skills haben wieder zurück. Die Präsenz der mobilen Toplaner und Jungler verschwindet so langsam. \nDer gute Jeremy hat diesbezüglich ein Video gemacht, wo er Lux als Beispiel Midlaner benutzt: \n\nhttps://www.youtube.com/watch?v=aRVaIfviW10","replies":[{"poster":"Alustus","date":"2015-09-15T06:59:09.270+0000","up_votes":1,"down_votes":0,"body":"> Kann kiten. Meta? Check!\n\nWo den? er ist einer der langsamsten champs.\nHat eine geringe Range (was kiten schwer macht außer man heißt vayne)\n\nDiese Aufgabe erfüllen andere Champs einfach im moment besser.\n\nWie gesagt das heißt nicht dass er schlecht ist","replies":[{"poster":"haha weed lol xd","date":"2015-09-15T10:37:45.211+0000","up_votes":1,"down_votes":0,"body":"Seine Q hat eine geringe Range ?\nDie jetzige Juggernaut Meta ** ist ** langsam. \nDeswegen scheinen Lux und Zyra gerade aus dem Untergrund, da sie zwar starke Kits haben aber ihre Skills relativ langsam sind. \nDavor konnte die mobilen Champs das einfach ausweichen. Juggernauts hingegen essen einfach Skillshot nach Skillshot. \n\nUrgot mit Iceborn Q und triggert das Slowfield mit einem AA. Zusätzlich kann sein Schild + Q noch verlangsamen. Und mit seinen Core Items hat er früh seine 40 % CDR erreicht. ","replies":[]}]}]}]}]},{"poster":"haha weed lol xd","date":"2015-09-15T06:19:25.348+0000","up_votes":1,"down_votes":0,"body":"Poppy kann man sowas von spielen im Moment :D","replies":[{"poster":"Alustus","date":"2015-09-15T07:51:57.697+0000","up_votes":1,"down_votes":0,"body":"Hat keiner das gegenteil behauptet ;)\n\nAber oftmals gibt es stärkere alternativen. Du kannst mit jedem champion Challanger werden-","replies":[]}]}]}]}]}]},{"poster":"Alustus","date":"2015-09-14T08:35:55.702+0000","up_votes":1,"down_votes":0,"body":"Mal vorweg Leona ist gerade sehr stark und balanced.\n\nWarum sollte man sie also ändern? Es kann eigentlich fast nur schlechter werden.\n\n\nAußerdem ist Leona Jungle/Top durchaus spielbar.(AD)\nUnd auch mid gegen manche matchups (AP) stark (z.B.: Nida)\nUnd im verhältniss besser als Lux support.\n\n\n> Leider ist es so das man nichts machen kann wenn man mit dem adc nicht zusammen spielen kann egal aus welchem Grund!\n\nIst mit jedem Support so.\nAußerden ist Leona weniger vom Adc abhängig als andere Supporter.\nAnnie ist nur weniger abhängig wenn sie feed bekommt.\nAnsonsten ist es ziemlich useless wen man jemanden mit ihr stunnt und dein Adc nichts macht.\n\n\nBei dir hört es sich ja so an als wäre leona einer der schlechteren Supps.\nObwohl sie gerade im SoloQ einer der stärksten Supps ist wenn nicht der stärkste.\n\nDie meisten Profi Spieler empfehlen Leona nicht ohne grund um die ladder zu climben.\n\n\n\nEdit:\n\n> 1. das passiv selber auslösen kann (wo ich ehrlich gesagt nie verstanden habe warum das nicht geht) und\n> 2. das man den schaden des passivs mit z.B. den leben oder der ap skalieren lässt\n\nDie Passive wird durch jede fähigkeit ausgelöst, wie willst du sie anders auslösen? Wäre dan ja keine Passive sondern eine Aktive.\n\n> Schaden verursachende Fähigkeiten lassen Gegner 3,5 Sekunden lang im Sonnenlicht erstrahlen. Treffen Verbündete Champions diese Ziele, wird die Beeinträchtigung entfernt und sie erleiden zusätzlichen magischen Schaden.\n\n\nWenn du den W meinst wo ihr schild explodiert\n\n> Erhält 3 Sekunden lang zusätzlich 20/30/40/50/60 (+20% der zusätzlichen Rüstung) Rüstung und 20/30/40/50/60 (+20% der zusätzlichen Magieresistenz) Magieresistenz. Endet die Wirkung, erleiden nahe Gegner 60/110/160/210/260 (+40% Fähigkeitsstärke) magischen Schaden und Leona behält ihre zusätzliche Rüstung und Magieresistenz für weitere 3 Sekunden.\n\nDieser Skaliert bereits auf Ap.","replies":[{"poster":"Bergelmir32","date":"2015-09-14T10:23:01.172+0000","up_votes":1,"down_votes":0,"body":"Ist jetzt nicht so schwer zu verstehen was der TE meint: Sie soll den Schaden den die Passive verursacht selber auslösen können und dieser sollte eine Tanks angemessene Skallierung bekommen.","replies":[{"poster":"Alustus","date":"2015-09-14T10:37:12.748+0000","up_votes":1,"down_votes":0,"body":"Ah zu schnell drüber gelesen ;)\n\n","replies":[]}]}]}]}