{"poster":"CallmeJeeeesus","date":"2016-05-11T19:25:00.085+0000","title":"ADC DMG an Tanks","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo liebe Forenmitglieder,\r\nich m&ouml;chte heute mal den DMG von ADCs an Tanks etwas in Frage stellen. Erst k&uuml;rzlich spielte ich eine Runde Maokai auf full Tank nat&uuml;rlich. Meine Stats waren etwa 280 armor und 4500 leben. Der gegnerische ADC ein Draven mit fullbuild war in der lage mir bis zu 1k aa zu geben, was ich doch etwas &uuml;bertrieben finde. Wo genau ist f&uuml;r mich der Sinn wenn ich Tank baue und in ca. 3 s sterbe. Ich war in diesem Spiel nicht in der Lage ordentlich in Teamfight reinzuspringen weil ich kurz darauf das Gras nurnoch von unten sehen konnte. Ich finde die neue erh&ouml;hte Armorpen. von 45% etwas &uuml;bertrieben und wollte fragen wie ihr dazu steht?\r\n\r\nLG Krieger0602","replies":[{"poster":"Headbeatz","date":"2016-05-11T21:31:22.188+0000","up_votes":4,"down_votes":0,"body":"Oh gott und ich als adc beschwer mich immer weil ich von nem gragas mit 1 dmg ittem gekillt werde oder weil ein kha mich onehitet aber wehe der adc macht mal dmg dann heist gleich OP","replies":[{"poster":"Marcus Phillida","date":"2016-05-12T09:33:15.808+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Headbeatz,realm=EUW,application-id=Wj1wcocU,discussion-id=b0Z4fEG1,comment-id=0003,timestamp=2016-05-11T21:31:22.188+0000)\n>\n> Oh gott und ich als adc beschwer mich immer weil ich von nem gragas mit 1 dmg ittem gekillt werde oder weil ein kha mich onehitet aber wehe der adc macht mal dmg dann heist gleich OP\n\nSo siehts aus...","replies":[]},{"poster":"CallmeJeeeesus","date":"2016-05-12T08:26:28.562+0000","up_votes":1,"down_votes":1,"body":"Du baust aber als ADC auch nicht full tank ;)","replies":[]}]},{"poster":"Doo ","date":"2016-05-11T19:41:06.032+0000","up_votes":1,"down_votes":0,"body":"Draven schreddert auch alle tanks mit seinen AA. Eben einen Lucian supportet welcher 18/3 stand und der machte kaum DMG an einen Full-Tank Maokai.","replies":[{"poster":"CallmeJeeeesus","date":"2016-05-11T20:10:18.901+0000","up_votes":1,"down_votes":0,"body":"Das stimmt schon aber wofür genau baut man Tank wenn man mit ca 5 aa tod ist ?","replies":[{"poster":"BlackSugaRose","date":"2016-05-11T20:56:53.547+0000","up_votes":3,"down_votes":0,"body":"Versuch doch mal das ganze aus einer anderen Perspektive zu sehen. Der einzige Champion der wirklich in der Lage ist einen Fulltank zu töten ist der ADC des Teams, gleichzeitig ist der ADC der, der nunmal gefocust wird. Wenn man nun also ADC spielt, von allen Seiten bedroht wird und für den Schaden an einigen Zielen verantwortlich ist, kann das schon ganz schön schwer werden 5 Autoattacks rauszukriegen. Jetzt denk dir nochmal ein Frozen Heart (also noch weniger Autoattacks in der gleichen Zeit) ohne gar Thornmail (noch mehr Schaden auf den ohnehin schon verdammt leicht zu tötenden ADC). Hinzu kommt CC von Maokai und vermutlich auch anderen.\nWenn man sich alle Faktoren vor Augen führt ist der Schaden definitiv gerechtfertigt, denn wenn ein Fullbuild ADC deiner Meinung nach einen Tank nicht töten können sollte.. wer dann?\nUnd zu der Frage \"Wieso baut man überhaupt Tank\": Würdest du das nicht tun, würde Draven dich mit etwas Glück auch mit einem Autoattack töten. (Ich weiß schon warum ich ungern gegen Draven spiele xD)","replies":[{"poster":"CallmeJeeeesus","date":"2016-05-11T21:30:02.999+0000","up_votes":1,"down_votes":0,"body":"Da hast du schon recht :D aber trotzdem finde ich Draven da etwas krass. Meine Meinung, den wenn ich in einem Teamfight als Tank platze kann ich meine Rolle nicht wirklich erfüllen.","replies":[{"poster":"Balmung","date":"2016-05-11T22:27:50.740+0000","up_votes":1,"down_votes":0,"body":"Sei doch eher froh, dass Draven 5 Autoattacks auf dich verschwenden muss.\n\nDeinen ADC und/oder Midlaner hätte er womöglich in der gleichen Anzahl Hits 2x getötet.\n\nCarries sind eben Carries - sie SOLLEN im Lategame den Dmg drücken, der anderen fehlt. Wenn ich mir nen Maokai vs Gragas oder so etwas im Lategame ansehe...jede Kneipenschlägerei ist schneller vorbei.","replies":[{"poster":"CallmeJeeeesus","date":"2016-05-12T08:29:12.476+0000","up_votes":1,"down_votes":0,"body":"Ich soll als Tank froh sein wenn ich 2-3 Sekunden im Kampf überlebe? (mit der Maokai ult)\nStimmt zwar das mein ADC oder Midlaner 2shot wäre aber als Tank ist man eigentlich doch etwas länger im Kampf.","replies":[{"poster":"Balmung","date":"2016-05-12T11:44:00.689+0000","up_votes":1,"down_votes":0,"body":"Im absoluten Lategame: Ja.\n\nAls Maokai zerlegst du einen ADC bis schätzungsweise 4 Items sobald du einen W auf ihn gesetzt bekommst, ohne jegliche Gegenwehr.\nEs ist teils schon traurig wie schnell ADCs platzen, obwohl ein \"Tank\" mit einem Dmg-Item auf ihnen hängt...im Late sollten sie sich schon rächen können ;P","replies":[{"poster":"CallmeJeeeesus","date":"2016-05-12T13:16:17.063+0000","up_votes":1,"down_votes":0,"body":"Können sie auch :D aber ich wüsste nicht wann ein Maokai einen ADC so krass zerlegt. Ich finde trotz einem{{item:3027}} macht Maokai sehr wenig Schaden. Meiner Meinung nach mit der DMG schwächste Tank. (Dafür andere Vorzüge)","replies":[]}]}]}]}]}]}]}]},{"poster":"Corvis Rex","date":"2016-05-12T12:45:15.869+0000","up_votes":2,"down_votes":0,"body":"Es ist eher andersrum. Die Tanks oder Tanky Champions sind zurzeit op. Ein Ekko mit 0 DMG Items burstet alles down und nimmt 0 Schaden. Eine Fiora schafft mit 2 kills Vorsprung locker ein 2v1, obwohl sie mehr auf Tank baut. Irelia das selbe. Lee Sin als Tank shottet dich direkt weg. usw...","replies":[{"poster":"CallmeJeeeesus","date":"2016-05-12T13:14:01.064+0000","up_votes":1,"down_votes":1,"body":"Das stimmt aber ich spreche hier ein genaues, oben genanntes Beispiel an. Maokai->Draven 3s kill","replies":[{"poster":"Corvis Rex","date":"2016-05-13T13:14:28.023+0000","up_votes":1,"down_votes":0,"body":"Maokai dasselbe. Hab noch nie mit einem Mao tank gegen einen ADC verloren. :)","replies":[{"poster":"CallmeJeeeesus","date":"2016-05-13T17:18:54.823+0000","up_votes":1,"down_votes":0,"body":"Ich weis ja nicht wo du mit Maokai den DMG nimmst um einen fullbuild Draven so schnell zu töten.","replies":[]}]}]}]},{"poster":"HHaie tabbian","date":"2016-05-11T19:26:40.247+0000","up_votes":2,"down_votes":1,"body":"Ich als main adc Spieler finde eher, dass man zu wenig dmg an tanks macht ;) Kommt immer auf den Blickwinkel an.","replies":[]},{"poster":"Avor Ashkeno","date":"2016-05-12T17:16:23.180+0000","up_votes":1,"down_votes":0,"body":"Auch wenn der Adc den Tank killt, wenn dann ein Assassine kommt ist es aus mit den adc, auch wenn ich mit meinen derzeitig einzigen Tank schon einige adcs erledigt habe. Sonst spiele ich selber hauptsächlich adcs und hab Draven auch schon ausprobiert und ich finde ihn nicht so stark wie z.B.: eine Miss Fortune oder den Lichtschützen oder auch Jhin.","replies":[]},{"poster":"Nalren","date":"2016-05-12T07:22:32.268+0000","up_votes":1,"down_votes":0,"body":"And of course, Draven counters everyone!","replies":[{"poster":"Nalren","date":"2016-05-12T07:30:19.506+0000","up_votes":1,"down_votes":0,"body":"Ich sehe aber auch, dass Draven ein Plat 3 Spieler war, der unter Silber Spielern war. Dass der alles zerschreddert ist jetzt nicht so überraschend, das wäre auf allen anderen Positionen wohl ähnlich gewesen.\n\nDein Build ist jetzt gegen Draven auch nicht optimal, es fehlt das wichtigste Item (Thornmail), statt der Bubble z.B.\n\nGenerell ist der Schaden von ADCs an Tanks sicher nicht zu hoch, dieses eine Spiel war ein extremer Fall.","replies":[{"poster":"CallmeJeeeesus","date":"2016-05-12T08:27:39.070+0000","up_votes":1,"down_votes":0,"body":"Da hast du recht, aber Platin gibt ihm auch keinen höheren DMG. :)","replies":[{"poster":"D4RKEVA","date":"2016-05-12T12:40:05.023+0000","up_votes":1,"down_votes":0,"body":"Aber mehr knowledge -> dadurch snowballed er was auf draven free win ist.\n\n\nAchja es sind 45% bonus armor pen(ca 100 base armor werden nicht ignoriert)","replies":[]}]}]},{"poster":"CallmeJeeeesus","date":"2016-05-12T08:28:01.947+0000","up_votes":1,"down_votes":0,"body":"yes","replies":[]}]},{"poster":"Marcus Phillida","date":"2016-05-12T09:31:23.392+0000","up_votes":1,"down_votes":0,"body":"Ich sag nur eins: {{champion:67}} + {{item:3124}}...","replies":[]},{"poster":"TerrorRaven","date":"2016-05-11T19:41:11.047+0000","up_votes":1,"down_votes":0,"body":"Das ist der Job vom einem ADC. Sehr viel Schaden machen. Und ein Full-Build-ADC macht nun mal viel Schaden, auch Draven. Außerdem durchdringt der Letzte Atemzug und seine Ausbaustufen nur Bonusrüstung und nicht wie früher die gesamte.","replies":[]}]}