{"poster":"StattrakP90","date":"2016-02-08T00:33:55.193+0000","title":"My Account has been permanently suspended","subforum":"Player Behaviour","up_votes":1,"down_votes":4,"body":"Alright. I&#039;ll be honest, I can get quite toxic. However, on the account in question that has been permanently suspended (AKA, the account I&#039;ve spent countless hours and a lot of money on) I&#039;ve just been permanently suspended. A 14 day suspension (which I&#039;ve had before) I can understand, and it gave me an opportunity to take a break from the game and cool down, and what not. For the next few weeks coming back, I was fine, calm and collected. \n\nHowever, seeing lower ELO players that I&#039;m in with making the same mistakes over and over again really just chaps my kakkies, which was probably what pushed me to flaming these specific players in this game I was in that triggered the ban. It wasn&#039;t all flaming either, it was me very specifically telling them what they should, and shouldn&#039;t be doing. Anyways, I wouldn&#039;t be complaining about this ban at all, however, it&#039;s just the sheer amount of money I&#039;ve spent on this account that&#039;s posing the issue for me right now.\n\n I don&#039;t believe, regardless of how toxic the player is, that the tribunal system should be allowed to create a permanent suspension of an account to the point where they can no longer access any of the things they&#039;ve bought on said account. It&#039;s ridiculous. I&#039;m not going to make any promises and say &quot;ooh, if you unban me, I promise I won&#039;t get angry and flame anyone again&quot; because I know even if I were to tell you that I was telling the truth, I doubt it would make a difference here. What I&#039;m wondering though, is if there is any way to get my money back at least. If there isn&#039;t, there&#039;s gonna be a serious issue here. Someone&#039;s behavior does not entitle you to their money. On a permanent ban, you should be fully refunded. That is all.","replies":[{"poster":"LemonHunter","date":"2016-02-08T01:30:46.490+0000","up_votes":2,"down_votes":0,"body":"As others have stated, no, there is zero chance you can get any form of refund.  As Trinity Force had quoted from the T&Cs that you agreed to outlines that. Yes, you aren't buying a tangible item, so you don't have anything to hold from the money you have spent, but you have paid that money to enhance the service that Riot Games are providing to you. By agreeing to their T&Cs, using the service and then going against those T&Cs, they have every right to terminate your use of the service.\n\nAlso another note, by talking to your team in the game, letting them know what they could be doing better to win the game and improve their skills. That's great!  I find it helps when someone helps me understand mechanics of a champ I'm playing against so I can get better. However, I feel you didn't just help them out. I'm assuming there were a lot of swear words used and personal attacks against the players. This is not on and no one wants that kind of behaviour in this community, hence the reports that lead to your ban. Maybe take this into account if you are to continue playing League.\n\nPermanent suspension (in my opinion) is something that is needed for players who simply aren't changing their ways. As you mentioned in your post, the 14 day suspension gave you time to step away from the game, look back at your actions and hopefully change how you interact with other players in the community, however since that behaviour wasn't changing and wasn't showing signs of changing, removing toxic players from the community is something that is needed.\n\nI hope you can look back at this and change your ways. There is no need to flame people and abuse them if they aren't playing to your standards. And if someone is being toxic towards you, the safest best is to avoid so you don't fall back into old habits.","replies":[{"poster":"StattrakP90","date":"2016-02-08T06:44:45.515+0000","up_votes":1,"down_votes":0,"body":"It simply does not make sense for there to be such a thing as a perma-ban in League of Legends, a free to play game. You're completely right! Maybe some people just won't change their ways... However, this doesn't stop them from making a new account, and repeating the process all over again. The two week suspensions are a brilliant idea, but having a perma ban system just to spite a toxic player who's gonna create a new account, who will now be even more salty because he's lost all his shit..? I feel like that's just RIOT shooting themselves in the foot.","replies":[{"poster":"LemonHunter","date":"2016-02-08T07:04:29.029+0000","up_votes":1,"down_votes":0,"body":"No, you're correct, it doesn't stop them from making another account and continuing to be a toxic player, however permanent bans are something that I feel are needed, not only in League, but all games/services like this. And they exist in a large majority of them as well. I know if I were in a situation that I was getting warnings and 14 day bans, I would 100% make sure I do what I can to continue playing knowing that there is a risk of a permanent ban that will make me lose all of the skins I have purchased for my account. If there were only 14 day bans and nothing beyond that, there is almost no punishment for people who break the T&Cs that they agreed to when signing up.","replies":[]}]}]},{"poster":"Gaslight","date":"2016-02-08T01:08:51.954+0000","up_votes":2,"down_votes":0,"body":"> YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE RIOT POINTS SYSTEM AND THE VIRTUAL ITEMS YOU ACQUIRE HAVE NO MONETARY VALUE AND CANNOT BE REDEEMED FOR CASH. NO REFUNDS WILL BE MADE FOR THE PURCHASE OF RIOT POINTS OR FOR VIRTUAL ITEMS OBTAINED USING RIOT POINTS\n\nYou agreed to this mate, so no, you cannot get a refund.\n\nhttp://na.leagueoflegends.com/en/legal/termsofuse","replies":[]},{"poster":"Ben Folds","date":"2016-02-08T00:53:52.636+0000","up_votes":2,"down_votes":0,"body":"Spending money on the game does not entitle you to special privileges. You should be conscious of your actions in respect to how much you value your account. Rules still apply across the board, that's why they're rules.\nOn the note of full refund, what about the 'portion' of the product you've already used? If you ever used the champ you paid for, or the skin you paid for, how does that factor into a 'full' refund?\n{{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"SqueakierEel","date":"2016-02-10T11:53:47.162+0000","up_votes":1,"down_votes":0,"body":"To simply put it, that's why the system is designed that way.\nIf for example you didn't invest any money into the account and it was banned all you would be losing is game statistics which you can easily get over, create a new account and continue to flame. Where is if the account has more value over it you have a higher chance of correcting your ways and becoming a better summoner.\n\nYou also need to keep in mind the people you are with are your own MMR, though they are making mistakes it isn't entirely their fault, they can't see their own mistakes just like you cant see your own mistakes, in which you require to get past the poor behavior which has led to you being banned multiple times.","replies":[]},{"poster":"Reported4Verbal","date":"2016-02-10T08:20:17.829+0000","up_votes":1,"down_votes":0,"body":"Yo  dude,\n\nI am sincerely sorry to hear that mate. It really sucks.\n\nBut keep in mind the box (aka contract) you ticked/signed when creating the account stated that you had read, and agree to comply with the EULA. \n(end user licence agreement.)\n\nhttp://oce.leagueoflegends.com/en/legal/eula\n\nIt states that you do not own the account. Riot owns your account and they could perma ban the oldest accounts right now if they wanted to without reason.\nThey reserve the right to do whatever they want to the account.\n\nit also states that there are no refunds on purchases and you do not purchase content and own it. You purchase a licence to use the content for the remainder of your account's life.\n\nSorry to be the bearer of bad news dude :(\n\nThat's how the cookie crumbles. :(","replies":[]},{"poster":"Kizx","date":"2016-02-08T01:01:08.547+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"StattrakP90","date":"2016-02-08T01:22:12.105+0000","up_votes":1,"down_votes":1,"body":"No need to be a %%%% buddy, fighting fire with fire is never a good idea.","replies":[]}]},{"poster":"Drizzles","date":"2016-02-08T01:28:11.643+0000","up_votes":1,"down_votes":0,"body":"Hell no, you're using a free product that has a ToS (Terms of Service) Upon using said service and paying for additional products you're agreeing to further conditions within their EULA and ToS, wether you chose to read it or not.\n\nEvery time there's an update and you have to click accept again, you're reaffirming your acceptance.\n\nBy doing so, you're accepting that they may permanently ban you without refund.\n\nWhen you purchase a lotto ticket and you lose, do you ask for a refund because you didn't get the payout?\n\nI think if your dumb enough to get yourself permanently banned, you probably deserve it.   It's not often people get permabanned in league.","replies":[]},{"poster":"StattrakP90","date":"2016-02-08T01:17:43.854+0000","up_votes":1,"down_votes":0,"body":"Alright, noted. Thank you everyone for the feedback, I should have been more aware I guess.. A shitty outcome for what was a shitty person. That's all I needed to know.","replies":[]}]}