{"poster":"IIIAce","date":"2016-03-06T19:12:52.270+0000","title":"Dunkmaster Spieler toxic...","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":10,"body":"Hi Leute, ich wette jeder hat schon einmal einen Darius Spieler mit dem Dunkmaster Skin gesehen die immer: ,,get dunked&quot; schreiben. es regt mich so hart auf verstehe es einfach nicht jeder der diesen Skin besitzt schreibt es wenn ich von seiner ult get&ouml;tet werde, langsam reicht es aber auch... PS: Hab diese Frage schon einmal gestellt aber bl&ouml;der weise war dunkmaster falsch geschrieben bzw Autokorrektur halt ;)","replies":[{"poster":"Im a Papaya","date":"2016-03-06T19:21:02.628+0000","up_votes":4,"down_votes":0,"body":"Ich hab den Skin auch und bin kein schlechter Darius aber ich hab mir angewöhnt auf der Lane kein BM zu betreiben weil ich weiß wie es ist die Lane zu verlieren und dann auch noch provoziert zu werden.\nAber der Skin und der Champ verleitet dich dazu böse zu sein.... wer sonst schreit \"**To easy !!!**\" wenn er jemanden killt und flüstert dir zu wie stark du bist ? Das gleiche kannst du über Draven sagen der schön brav \"Draven big plays\" ruft wenn er tötet.","replies":[{"poster":"TheUnknown98","date":"2016-03-07T14:27:33.911+0000","up_votes":3,"down_votes":0,"body":"Draven+Darius die toxischen Brüder :D","replies":[]}]},{"poster":"Abasin","date":"2016-03-07T14:21:59.313+0000","up_votes":5,"down_votes":1,"body":"...und irgendwann wird man dafür reported, dass man sein Gegenüber gekillt hat..\n\nMan kann es mit seiner Empfindlichkeit auch deutlich übertreiben. {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"TeoX796","date":"2016-03-08T23:40:29.686+0000","up_votes":1,"down_votes":0,"body":"Irgendwann?\n\nMan wird heute schon wegen viele kills Reportet.....","replies":[{"poster":"Abasin","date":"2016-03-09T06:13:47.775+0000","up_votes":3,"down_votes":0,"body":"Nice sind auch die Leute die im ARAM \"Why you focus me????\" ins Allchat setzen.{{sticker:slayer-jinx-wink}}","replies":[{"poster":"TeoX796","date":"2016-03-09T07:47:18.518+0000","up_votes":2,"down_votes":0,"body":"XDDD ok das hat ich \"noch\" nichtXD","replies":[]}]}]}]},{"poster":"OSaftKiller","date":"2016-03-06T20:49:14.555+0000","up_votes":3,"down_votes":0,"body":"Was ist daran so schlimm? Finde ich besser als get rekt.\n\nDas ist wenigstens keine anzügliche Sprache, finde es viel mehr sogar lustig gedunked anstatt gerekt zu werden.:D","replies":[]},{"poster":"eingew","date":"2016-03-06T19:54:38.213+0000","up_votes":4,"down_votes":1,"body":"Muten und reporten würde ich sagen. Spart viel Frust, wenn man das mit dem muten möglichst früh macht.","replies":[{"poster":"GankMeOrLose","date":"2016-03-12T20:30:40.614+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=vzibEnmE,comment-id=0002,timestamp=2016-03-06T19:54:38.213+0000)\n>\n> Muten und reporten würde ich sagen. Spart viel Frust, wenn man das mit dem muten möglichst früh macht.\n\nKann man das reporten? Ich denke das zählt doch eher zu trashtalk oder? Ich habe den Skin auch und schreibe am anfang des spiels immer \"IT'S DUNKINGTIME\" oder \"TIME FOR SOME DUNKS\" und jedesmal wenn ich jemanden ulte \"GET DUNKED\". ist das so schlimm?","replies":[{"poster":"eingew","date":"2016-03-13T08:01:13.068+0000","up_votes":2,"down_votes":0,"body":"Man *kann* alles reporten. Prinzipiell bist du die einzige Person die Entscheidungsgewalt über die eigenen Reports verfügt. Das System ist darauf ausgelegt, dass jeder das meldet, was er selbst beeinträchtigend in seiner positiven Spielerfahrung findet. Wenn du dich durch ein \"get dunked\" angegriffen fühlst, dann gibt es niemanden, der dir den Report dafür verbieten kann.\n\nIch habe mal hier im Forum eine Diskussion über einen Garen gelesen, der nach Kills gerne \"DEEEEEEEEMAAAAAAAAAAACIAAAAAAAAAAAA!!!!!!!!\" in den Chat gepackt hat. Da war man viel eindeutiger als hier der Meinung, dass das kein angemessenes Verhalten ist.\nOb es also tatsächlich bestraft wird weiß ich nicht, die Community scheint sich da nicht prinzipiell einig zu sein (wobei das Forum ja eh nicht zwingend repräsentativ ist) und ich kenne leider auch keinen Fall der das eine oder das andere beweisen würde.\n\nPrinzipiell würde ich aber sagen, es ist sowieso nicht wichtig. Das was mir sauer aufstößt reporte ich. Wenn andere dabei finden ich bin eine kleinliche Mimose, dann ist das so. Dafür gibt es andere die gar nicht reporten. So lange du vor dir sicher bist, dass ein Report gerechtfertigt ist, dann ist er das auch. Erst wenn die Masse ein Problem mit deinen Reports hat, hat das eine tatsächliche Auswirkung hinsichtlich des Reportgewichts für dich. Aber dann werden die Spieler auch nicht bestraft und du hast auch nichts falsch gemacht.\n\nWas ich sagen will, das System ist nicht darauf ausgelegt, dass man sich fragt, was von dem was man reportet jetzt auch tatsächlich bestraft wird. Es ist darauf ausgelegt, dass man schlicht und einfach seine Meinung vertritt. Bestraft wird dann, wer der Masse missfällt.\n\nWie ein Geschworenengericht mit massig Geschworenen, die sich an keine Gesetze halten müssen, außer dem des eigenen Gewissens.","replies":[]}]}]},{"poster":"Untouchable ProX","date":"2016-03-06T19:36:05.037+0000","up_votes":3,"down_votes":5,"body":"Ich lese dein Thread, finde aber keine Frage.\n\nWer sich provozieren lässt ist selbst Schuld.\nWenn man die Lane verkackt und dann noch Mad wird, kann der Darius doch machen was er will.\nWenn er einfach besser gespielt hat, dann ist das halt so.","replies":[{"poster":"Pandaphiri","date":"2016-03-10T11:07:19.035+0000","up_votes":4,"down_votes":0,"body":"ach und die leute die mit absoicht provozieren sind dann unschuldsengel?","replies":[{"poster":"Untouchable ProX","date":"2016-03-10T11:25:46.683+0000","up_votes":1,"down_votes":2,"body":"Wenn dich einer auf der Straße provoziert und du ihn eine gibst, bist du selbst Schuld wenn du bestraft wirst.\nDu hast immer die Möglichkeit den anderen zumuten (aus dem Weg zugehen).\n\nUnd ja, die leute die Emote spamen oder im all chat ''gg/WP'' schreiben, haben nichts verbrochen.\nSie verspotten dich. Steh drüber oder sei kindisch und reg dich auf und geb ihn genau das was sie wollen.","replies":[{"poster":"Pandaphiri","date":"2016-03-10T11:38:59.267+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TX XerXes,realm=EUW,application-id=KYnfKGf0,discussion-id=vzibEnmE,comment-id=000100000000,timestamp=2016-03-10T11:25:46.683+0000)\n>\n> Wenn dich einer auf der Straße provoziert und du ihn eine gibst, bist du selbst Schuld wenn du bestraft wirst.\n> Du hast immer die Möglichkeit den anderen zumuten (aus dem Weg zugehen).\n> \n> Und ja, die leute die Emote spamen oder im all chat ''gg/WP'' schreiben, haben nichts verbrochen.\n> Sie verspotten dich. Steh drüber oder sei kindisch und reg dich auf und geb ihn genau das was sie wollen.\n\ndu bist bestimmt auhc einer diese Gesitreichen spieler die im spiel dann total überheblich sind wenn se gewinnen, den anderen runtermachen und dann sagen \"hey steh doch drüber\" ganz ehrlic: ich hoffe du bekommst nen ban fürs forum und fürs spiel.","replies":[{"poster":"Untouchable ProX","date":"2016-03-10T11:54:17.745+0000","up_votes":2,"down_votes":4,"body":"Dein geistreicher Kommentar zeigt eher dass du hier nicht hingehörst.\nDU kannst weder mit Kritik umgehen noch mit Provokation.\n\nSowas wie du ist der Grund warum ich erfolg im Rank hab. \nAnfänger die sich einfach ausspielen lassen und dann durch ihr eigene unruhige immer weiter Fehler machen.\nIch freue mich, dass solch Spieler wie du, sich herzlich darüber ärgern dass sie selbst so schlecht spielen.\n\nUnd, nein. Ich werde sicherlich kein Bann bekommen.\nBin nicht so ein toxic player wie du. Bekomme eher die ''freundlichen'' Spieler Belohnungen und Scherpen :)\n\nAchja, und wp Bronze1 mit negativer W/L ist echt ein guter score.","replies":[{"poster":"Pandaphiri","date":"2016-03-10T12:16:26.931+0000","up_votes":2,"down_votes":1,"body":"genau du bist so viel besser grad mit deinem verhallten ^^ sieht man sehr gut. du bist nämlich einer dieser leute die andere mit absicht provozieren und sich dann für was besseres halten weil die sich drüber ärgern ^^ lass dir eines gesagt sein: so was ist in keinem fall besseres verhallten wenn man andere ärgert oder sich drüber freut und vielleicht sogar noch die ärgernden unterstützt.\n\ndu denkst du bist besser? Reduzierst mich aber auf meine W/L score? genau mein Freund du bist eindeutig ein Paradebeispiel von guter Erziehung auch wenn ich es eher Arroganz nennen würde.","replies":[{"poster":"Untouchable ProX","date":"2016-03-10T12:29:48.859+0000","up_votes":2,"down_votes":2,"body":"Ahja okay.\n1. Ich bin weder dein Freund, noch will ich dies jemals werden.\n2. Genoss ich wohl bessere ''Erziehung'' als du (siehe Rechtschreibung).\nZudem, hast du mir nicht gerade den ''bann gehofft''?\nIch behaupte lediglich, Menschen die keine Selbstkontrolle haben lassen sich provozieren.\nSowie du.\n\nDu redest als wärst du selbst etwas ''besseres''.\nSpielst ingame aber schlecht und flame'st im Forum mit einer grottigen Rechtschreibung.\nIch nehme eher stark an, dass du  versuchst dein missglücktes Spiel durch unnötige Forumkommentare zu kompensieren.\nUnd um deine Frage zubeantworten ob ich besser sei, definitiv.\nErfolgreich job - ja.\nSpiel - ja.\nIch nenne dies nicht Arroganz, sondern Realität.\nVielleicht ist die frische Luft etwas besser für dich, als hier im Forum sinnlose Kommentare zu posten.","replies":[{"poster":"Pandaphiri","date":"2016-03-10T12:41:56.243+0000","up_votes":2,"down_votes":1,"body":"Für die Leute die Arroganz ausüben erscheint sie oft nicht als Arroganz auch wenn sie es ist. Alleine das du nun an meiner Rechtschreibung anfängst zu mäkeln ist ein weiterer Beweiß dafür den du auch mit deinen Worten zuvor nicht besser dastehen lässt","replies":[{"poster":"Untouchable ProX","date":"2016-03-10T13:18:55.643+0000","up_votes":2,"down_votes":2,"body":"Rechtschreibung und sowohl auch die Grammatik. :)","replies":[]}]}]}]},{"poster":"GankMeOrLose","date":"2016-03-12T20:35:08.872+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=TX XerXes,realm=EUW,application-id=KYnfKGf0,discussion-id=vzibEnmE,comment-id=00010000000000000000,timestamp=2016-03-10T11:54:17.745+0000)\n>\n> Dein geistreicher Kommentar zeigt eher dass du hier nicht hingehörst.\n> DU kannst weder mit Kritik umgehen noch mit Provokation.\n> \n> Sowas wie du ist der Grund warum ich erfolg im Rank hab. \n> Anfänger die sich einfach ausspielen lassen und dann durch ihr eigene unruhige immer weiter Fehler machen.\n> Ich freue mich, dass solch Spieler wie du, sich herzlich darüber ärgern dass sie selbst so schlecht spielen.\n> \n> Und, nein. Ich werde sicherlich kein Bann bekommen.\n> Bin nicht so ein toxic player wie du. Bekomme eher die ''freundlichen'' Spieler Belohnungen und Scherpen :)\n> \n> Achja, und wp Bronze1 mit negativer W/L ist echt ein guter score.\n\nWollte Upvoten bis ich den vorletzten absatz gelesen habe. Nicht cool.","replies":[]}]}]}]}]}]},{"poster":"SorisDynasty","date":"2016-03-09T00:34:27.419+0000","up_votes":2,"down_votes":0,"body":"Falsch gewettet. Ich hatte das noch nicht.","replies":[]},{"poster":"AI Yjuq","date":"2016-03-07T19:02:53.221+0000","up_votes":2,"down_votes":0,"body":"Hey, versuch es mal ein wenig mit Humor zu sehen. Ich selber lasse auch schon mal solche Sprüche raus, aber wenn versuche ich das im positiven Sinne. Wenn ich z.B. ein garen gegen Darius Matchup habe, kommt meist sowas zu Beginn des Spieles von mir:\n\n\"Extend the hand of Noxus, pull back a stump.\" oder\n\"Darius, you are a butcher, not a general.\"\n\nDas sind halt die 2 Taunts die Garen zu Darius sagt, schreib ich schon mal gerne in den Chat, aber auch schon mal eigene Kreationen:\n\n\"I keep the victory for Demacia and destroy you and Noxus.\"\n\nund anderes, ich sehe sowas eben als Angriff auf den Champion, nicht auf den Spieler der den Champion steuert. League ist ja in erster Linie an Game. Selbst wenn ich mir Sprüche von meinen Gegenüber anhören \"muss\", meist freue ich mich für Ihn dass ich Ihn ein Spiel bereiten kann was Ihn auch Freude bereitet. In deinem Beispiel könnten einige Spieler sich halt darüber freuen dass sie dich gerade vielleicht in einem schwierigen Play gekillt haben.\n\nSollte das allerdings natürlich wiederholt in einem Game auftreten, einfach muten. Ansonsten teil doch auch selber mal so ein paar Kleinigkeiten aus, es heitert einem zumindest selber auf, und wenn du Glück hast und es geschickt anstellst geht dein Gegenüber darauf ein und spielt ein wenig mit dir im Chat, dann sollte es aber eher um die Backgrounds der Champions gehen und nicht an den \"Skill der Spieler\".\n\nIch sag nur GG :D","replies":[]},{"poster":"zuckerman","date":"2016-03-08T11:49:24.873+0000","up_votes":3,"down_votes":1,"body":"OH watch out OP got dunked","replies":[]},{"poster":"FrankerX","date":"2016-03-07T14:18:00.642+0000","up_votes":3,"down_votes":1,"body":"weißt du was mich aufregt? leute die sagen \"blöde autokorrektur\" bzw \"war wegen Ak. falsch geschrieben\" DANN STELL DIE SCHEIßE AUS WIE SCHWER IST DAS FÜR MANCHE???","replies":[]},{"poster":"Pandaphiri","date":"2016-03-10T11:03:12.736+0000","up_votes":3,"down_votes":3,"body":"aha...get dunked zu schreiben ist also Toxic. ganz ehrlich: da gibts schlimmeres wie zum beispiel ganzen leute die ez. Oh ja merkt keiner das man damit \"easy\" meint. report jeden der das am ende vom spiel schreibt weil das ist wirklich toxic","replies":[]}]}