{"poster":"IIIAce","date":"2015-08-07T18:52:00.262+0000","title":"Was haltet ihr von Malzahar?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hi Leute wollte mir extra noch Malzahar mit RP kaufen aber ich wei&szlig; nicht ob es sich lohnt: ist er gut? Macht er Spa&szlig;? Hat man das gef&uuml;hl das er kein damage macht?","replies":[{"poster":"Noxempire","date":"2015-08-08T10:38:51.071+0000","up_votes":1,"down_votes":0,"body":"Generell kauf dir keine Champs mir RP ,ist nicht wirklich effizient wenn du mal bedenkst das du genasusogut einen malz Skin statt ihm selbst haben könntest. \nDa mich das aber kaum was angeht kommen wir zu Malzahar selbst.\n\nWenn es dir gefällt einen Lanebully zu spielen mit eher schelcht verfehlbaren Fähigkeiten und mit angenhmen CC zu spielen dann kauf ihn dir. Seine Passive ist ganz witzig fält aber kaum ins Gewicht, aber wenn es dir gefällt kleine Begleiter zu haben kauf ihn dir. Wenn du einen starken 1v1er haben willst dann kauf ihn dir.  Wenn deine Elo sehr hoch kauf ihn dir nicht, da kommen deine Gegner nämlich auf die Idee {{item:3140}} zu kaufen oder {{item:3222}} und countern deine Ult bzw. sie können deine Fähigkeiten einfach dodgen. \n\nEs geht vorallem darum was dir gefällt! Gefällt dir ein Leerenmagier mit Persischer Anlehnung? Wenn ja KAUF IHN. (Aber mal wirklich spar die 4800 zusammen das dauert nicht so lange, dann haste auch nen coolen skin für ihn  ;P)","replies":[{"poster":"SorisDynasty","date":"2015-08-08T11:15:30.871+0000","up_votes":2,"down_votes":0,"body":"Kleine Korrekturen:\nSeine Passive ist ehrlich gesagt extrem stark, wenn die Voidlinge in einer Combo mit raufhauen. Richtig eingesetzt, hauen die alleine deinen Gegner auf Level 2 bereits low. Sie sind starke Laningtools, wenn man weiß, wie man sie zu benutzen hat.\nUnd Mikaels wirkt NICHT gegen Malzahar-Ult. Nur QSS, GPs W, Alistar Ult und Olaf Ult. Ansonsten Malzahar CC'n, damit man die Ult abbrechen kann, also CC richtig timen oder auf Teammates hoffen.","replies":[{"poster":"Locratorix","date":"2015-09-30T19:59:37.565+0000","up_votes":1,"down_votes":0,"body":"Außerdem ist die Passive mega hilfreich beim farmen wenn man sowieso so schlecht farmen kann wie ich :D","replies":[{"poster":"SorisDynasty","date":"2015-09-30T21:27:42.717+0000","up_votes":1,"down_votes":0,"body":"Jap, kenne ich. ^^ Wobei Voidling + E zusammen doch gerne mal Lasthits ruinieren für mich. Sehr oft. Aber dafür spiele ich ihn auch nicht häufig genug, um das richtig zu lernen mit dem Kalkulieren.","replies":[]}]},{"poster":"TGOxBl4ck","date":"2015-09-30T20:02:25.348+0000","up_votes":1,"down_votes":0,"body":"gibt es auch nicht irgendwie eine Mana passive bei ihm ?","replies":[{"poster":"SorisDynasty","date":"2015-09-30T21:26:55.848+0000","up_votes":1,"down_votes":0,"body":"Die liegt auf seinem E und gehört zur Aktiven. Wenn das Ziel stirbt, während es unter dem Effekt vom E liegt, bekommst du Mana zurück. Nach 5-6 Creeps hast du die Manakosten vom Skill zurückerstattet bekommen. Es ist dabei irrelevant, ob du den Lasthit bekommst - es muss nur sterben.","replies":[]}]}]}]},{"poster":"W0RN","date":"2015-08-07T22:06:06.447+0000","up_votes":2,"down_votes":1,"body":"Malzahar kein Damage? Spielen wir das gleiche Spiel?","replies":[]},{"poster":"JG Stitch","date":"2015-08-10T20:16:31.724+0000","up_votes":1,"down_votes":0,"body":"Malzahar ist etwas eigen, wie ich finde, doch vermutlich seine größte Stärke ist, dass er unterschätzt wird. Ich persönlich spiele ihn sehr gerne. Das Prinzip ist nicht allzu kompliziert, aber dennoch gibt es eben Dinge die man beachten sollte, wie angesprochen bereits die Ult. \nDie Ulti kann wirklich stark sein, aber man sollte immer bedenken, dass man selbst sich in dieser Zeit nicht bewegen kann, also immer mit Bedacht verwenden.\nInsgesamt ist der Schaden von ihm, wie ich finde ziemlich hoch und das auch sehr früh, allerdings ist er oftmals, um einen Gegner zu töten stark Comboabhängig. Gelingt einem Q,E,W,R (+Passive) ist er im 1vs1 nahezu nicht zu stoppen. Nicht allzu robuste Midlaner halten es meist nicht stand und auch manch Tank muss schlucken. Leider ist er eben Unmobil, doch das kann man durch Aufmerksamkeit zum Teil ausgleichen.\nSolltest du im low Elobereich spielen, dann ist Malzahar pures Gold und funktioniert meistens : )","replies":[]},{"poster":"Schesam","date":"2015-08-07T18:55:20.766+0000","up_votes":1,"down_votes":0,"body":"Malzahar ist ein starker Lane-Bully hat hat sehr gute Scalings+ Grundwerte. Soll heißen er haut richtig viel Schaden raus, aber hauptsächlich als DoT. Zudem hat er starken CC mit dem Silence auf der q und dem Supress auf der Ulti. Sein Problem ist nur, er farmt mit der E und so pusht er automatisch und weil er zudem sehr unmobil ist ist er relativ leicht gankbar. Aber viele unterschätzen seinen DMg, wdurch man sowas auch gut turnarounden kann.\n\nEr ist nicht schlecht und kann auch gut carrien, sit aber unmobil und muss so auf gute Vision und Positioning achten.","replies":[]},{"poster":"FollowMeDown","date":"2015-08-10T22:50:53.198+0000","up_votes":2,"down_votes":2,"body":"Nichts der Splasher gehört in die Dönerbude und nicht in die Kluft !","replies":[]},{"poster":"Allmaron","date":"2015-08-07T19:34:40.477+0000","up_votes":1,"down_votes":2,"body":"Also zu Malzahar kann ich dir als erfahrener Midlaner folgendes sagen:\n\nPros:\n-Pusht super gut\n-Sehr starkes 1 vs 1\n-Kann jede Lane gewinnen \n-Keine wirklichen Hardcounter\n-Einfach zu spielen\n-Guter Midgamedmg\n\nCons:\n-Schwach gegen CC\n-Wennig dmg wenn er behind fällt\n-schwach gegen hardengage\n-Dmg und range sind im Lategame ultrabad\n-Ult in tfs nutzlos\n-Einfach zu Ganken","replies":[{"poster":"SorisDynasty","date":"2015-08-07T22:55:10.235+0000","up_votes":1,"down_votes":1,"body":"Okayyyy. Wait a moment. Malzahas Lategame Schaden soll \"ultrabad\" sein? Es gibt kaum einen besseren Magier, der TANKS niederbursten kann mit einer vollen Combo, als ihn. Entsprechend ist sein Schaden alles andere als \"ultrabad\".\nEin Call of the Void kann einem Squish im Lategame mehr als 50% des Lebens abziehen. Zu oft habe ich Doppel- bis Triplekills beim Zurückkiten ohne Ult gemacht, weil die Gegner immer wieder Zauber abbekommen haben. Und das auch ohne abartig gefeedet zu sein.\nDie Ult in TFs ist auch eher situationsbedingt. Sie ist nicht nutzlos, nur schwer einzusetzen. Im Zweifelsfall nutzt du sie simpel, um für deinen ADC diese Irelia, die ihn anspringt, umzubringen.\n\nDas als kleine Korrektur. Der Rest stimmt im Groben. Wobei die Range auch nicht \"ultrabad\" ist, sondern im gesunden Maß. Mehr wäre viel zu stark auf ihm.","replies":[]}]}]}