{"poster":"WhiteShadøw","date":"2017-03-19T17:20:18.772+0000","title":"¿Programas para jugar en otras regiones con un ping \"bajo\"?","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Hola!, quiero preguntarles lo siguiente: \r\n&iquest;Alguien conoce alg&uacute;n programa para jugar en otras regiones con un ping decente? Hablo de programas como wtfast y similares, estoy un poco cansado de la comunidad de esta regi&oacute;n, gente que quiere dar honores a los afks en vez de reportarlos (se que no se puede) y reportarte por tener una mala partida, aunque ese no es el tema de este post. \r\nOtra pregunta, el WTFast funciona bien? vale la pena pagar?\r\nGracias :D","replies":[{"poster":"Mioen","date":"2017-03-20T03:28:22.311+0000","up_votes":1,"down_votes":0,"body":"Bien.\n\nSi quieres pasarte a otro servidor podrías probar en el de BR, ya que por la cercanía podrías llegar a tener igual ping o un poco más.\n\nSi piensas pasarte a un servidor como el de NA, trataría de aprender el idioma ya que  muchos te reportarán por negarte a comunicarte, también puedes llegar a pasar un mal rato si es encuentras a alguien con un carácter xenófobo debido al problema de algunos.\nY programas como WTFast si mal no escuché solo mantienen estable tú conexión, por lo que tú ping será igualmente alto.\n\nY la más sencilla, Usa el filtro de idioma. Mute a las personas que te molestan o simplemente minimiza el tamaño del chat.","replies":[]},{"poster":"NickW","date":"2017-03-19T17:42:25.981+0000","up_votes":1,"down_votes":0,"body":"Primero quería aclarar que los reports por motivos falsos como \"tener una mala partida\" no son válidos.\nSegundo, programas como WTFast sirven para estabilizar la ruta, tomando el camino más corto usualmente para no tener ping de más.\nSin embargo, el ping usual que tendrás no depende de la estabilidad, sino de la distancia entre tu PC y el servidor donde está alojado el juego.\nEn el caso de NA por ejemplo, el servidor está en EEUU y tendras entre 120 y 180 ms constantes por la distancia de nuestra región a su servidor, a diferencia de los menos de 100 ms que tendrías en LAS, donde su servidor está en Chile. En EUW los ms serían aún mayores, dado que la distancia es mayor.\nPor supuesto, queda en vos decidir si aceptas jugar así o no.\nSaludos!","replies":[{"poster":"WhiteShadøw","date":"2017-03-19T17:49:16.695+0000","up_votes":1,"down_votes":0,"body":"Se que no son válidos, pero algunas veces te tiltea que todos digan \"report x, el afk hace más que él\" y todo porque el afk es alguien importante como el jungla o el support.\nPor cierto, me parece un buen ping, pero conoces algún programa que te haga jugar con un ping decente?\nGracias por responder c:","replies":[{"poster":"NickW","date":"2017-03-19T18:04:59.622+0000","up_votes":1,"down_votes":0,"body":"Jaja, obvio. Por eso siempre se recomienda que te resbale lo que te digan, sino esto es injugable lamentablemente.\nLamentablemente es lo que te dije. El ping básico, por decirlo de alguna manera, va a ser ese, porque depende de la distancia de donde estás vos al servidor donde juegues, no depende para nada de tu conexión a Internet.\nLa única forma de bajarlo es...bueno, irte a vivir a EEUU jaja.\nSi te parece un buen ping ese podrías probar a ver como te va la ruta en una smurf rápida. Si tenes muchos saltos a lo mejor podes usar uno de esos programas como WTFast, que lo que hacen es conectarte a alguna ruta de menor tráfico, que de más estabilidad a los ms, o a alguna ruta más corta, pero no va a cambiar mucho de lo que te dije.\nEsos programas sirven más cuando hay problemas de conexión en la zona y cosas así.\nSaludos!","replies":[]}]}]},{"poster":"Vaendrys","date":"2017-03-19T17:21:31.519+0000","up_votes":1,"down_votes":0,"body":"Casi todas las regiones son iguales. En todos lados hay demasiados boludos sueltos.","replies":[{"poster":"WhiteShadøw","date":"2017-03-19T17:24:45.953+0000","up_votes":1,"down_votes":0,"body":"Cierto, pero latinoamérica tiene una población mucho mayor de jóvenes que en NA, por lo tanto, tenemos más chicos de 13-16 que se ponen a insultar o a irse afk por cualquier cosa.\nLa población en NA es un poco mayor y un poco más madura (un poco).","replies":[{"poster":"Vaendrys","date":"2017-03-19T17:37:07.437+0000","up_votes":1,"down_votes":0,"body":"Casi todos te van a decir taco taco si se enteran que sos de LAS.\nNo es tan diferente :v","replies":[{"poster":"WhiteShadøw","date":"2017-03-19T17:43:58.326+0000","up_votes":1,"down_votes":0,"body":"Y si me pongo TrumpIsMySenpai? ahi nadie sospecha c:","replies":[]}]}]}]}]}