{"poster":"armstrong1818","date":"2016-08-29T09:37:02.787+0000","title":"Nach Windows Update: ingame 6000 ping","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo!\r\nNachdem sich mein PC vor zwei Tagen aktualisiert hat: Windows Update: Version: 10.0.14393 Build 14393 habe ich ingame jedesmal 6000 ping und h&ouml;her. Liegt bestimmt nicht an meiner Wlan-Verbindung. \r\nHat jemand eine L&ouml;sung f&uuml;r mein Problem bzw. hat jemand das selbe Problem? Habe LoL schon &#039;repariert&#039;, hat jedoch nichts verbessert. Im Internet habe ich bislang auch keine L&ouml;sung f&uuml;r mein Problem gefunden.\r\nBin f&uuml;r jeden Vorschlag dankbar!","replies":[{"poster":"Humpelstilzche","date":"2016-08-29T11:57:39.747+0000","up_votes":2,"down_votes":0,"body":"> Liegt bestimmt nicht an meiner Wlan-Verbindung.\n\nDas kannst du unmöglich ausschließen, ohne es getestet zu haben. Und ich sag das als jemand, der jahrelang gezwungen war Wlan zu verwenden. Wlan hat ungefähr drölf Fantastillionen Nachteile und kann zu ebenso vielen Problemen führen, die häufig recht schwer zu identifizeren und noch schwieriger zu fixen sind. \n\nAnsonsten würde ich den Ratschlägen von Alustus folgen und eventuell auch mal checken, ob Windows dann wenn du diesen hohen Ping hast, zufällig gerade Updaten herunterläd, was bei einer frischen Win10-Installation ja durchaus möglich ist, zumal Win10 einen dafür auch nicht um Erlaubnis bittet.","replies":[]},{"poster":"Alustus","date":"2016-08-29T09:57:50.637+0000","up_votes":1,"down_votes":0,"body":"Generell würde ich bei den Win einstellungen oder bei Router bzw. Treiber den Fehler vermuten.\n\nRouter mal 10 Minuten ausschalten.\nEventuell Ports für LoL öffnen.\nNetzwerkkartentreiber deinstallieren und neu laden.\n\nLoL komplett neu installieren.\nFirewall und Internetoptionen prüfen.\n\n\nDas Update alleine macht zumindest keine Probleme.\nDaher denke ich dass sich vllt die Win Einstellungen verändert haben oder Treiber geschrottet wurden bzw. sich diese nicht mit der neuen Win Version vertragen.","replies":[{"poster":"armstrong1818","date":"2016-08-29T20:04:00.555+0000","up_votes":1,"down_votes":0,"body":"Okay ich habe den Router neu gestartet, meine Treiber aktualisiert und die Firewall aus- und eingeschaltet --> hilft alles nichts. \nWas vielleicht auch noch wichtig wäre ist, dass ich im Loadingscreen einen normalen Ping von 41 habe, sobald ich jedoch ingame bin er erst nach 2-3 Minuten auf 6000- 15000 geht. Außerdem habe ich nachgeschaut und herausgefunden, dass mein PC in den letzten 2 Tagen nachdem das Hauptupdate installiert wurde im Hintergrund 4 weitere Updates durchgeführt hat.\nZu meiner Internet-Verbindung: Ich kann alle Internetseiten ganz normal öffnen, normal Youtube-Videos schauen, sowie Twitch streamen, alles ohne Probleme. \nBin echt schon ratlos..","replies":[{"poster":"armstrong1818","date":"2016-08-29T20:19:58.206+0000","up_votes":1,"down_votes":0,"body":"Was vielleicht auch noch hilfreich sein könnte ist, dass meine Fps von früher ca. 120 auf ca. 230 gesprungen sind.","replies":[]}]}]},{"poster":"Clown Fiesta xo","date":"2016-08-29T14:46:39.924+0000","up_votes":1,"down_votes":0,"body":"Hatte so ein ähnliches Problem nach dem Windows updatet gucke mal in dem Thema http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/64rvfElT-nach-championselect-blackscreen-und-fehlermeldung","replies":[]},{"poster":"thefire7","date":"2016-08-29T10:44:27.997+0000","up_votes":1,"down_votes":0,"body":"Auf Lan umwechseln. Wlan ist eine sehr unzuverlässige Verbindung.","replies":[]}]}