{"poster":"TheLittleSister","date":"2017-08-06T08:21:38.943+0000","title":"ALTER VS NEUER TALON!","subforum":"Champions & Gameplay","embed":{"description":"In diesem Video werden wir klären welcher Talon besser ist. Es erwarten euch sowohl Gameplayszenen als auch anschauliche Stichpunkte von den verschiedenen Fähigkeiten, Vergleiche sowie durchgehend meine Meinung dazu. :) Ich hoffe es gefällt euch, es war etwas aufwendiger als erwartet :D","url":"https://www.youtube.com/watch?v=ZvWUlCAik2Y","image":"https://i.ytimg.com/vi/ZvWUlCAik2Y/hqdefault.jpg"},"up_votes":1,"down_votes":0,"body":"Hall&ouml;chen Leute, ich habe ein recht aufwenidges Video gemacht, wo ich den alten Talon mit dem neuen vergleiche.\r\nW&uuml;rde mich freuen wenn ihr mal reinschaut und mir Feedback da l&auml;sst, ob es qualitativ mit gr&ouml;&szlig;eren Youtubern mithalten kann.\r\n\r\nLiebe Gr&uuml;&szlig;e und danke :)","replies":[{"poster":"Smiter","date":"2017-08-06T09:41:10.630+0000","up_votes":1,"down_votes":0,"body":"Also: Ich finde die Idee sehr gut, die Gameplays die du eingespielt hast waren auch zum richtigen Zeitpunkt und haben veranschaulicht was du meinst. Mir ist nur aufgefallen das es auf dauer etwas langweilig wirkt, also mein Tipp, versuch alles so schnell wie möglich auf den Punkt zu bringen, sonst verliert das Video an Spannung. So wie es jetzt ist, ist das Video ein Informationsvideo, das man sich nicht anschaut weil es so spannend un cool gestaltet ist, sondern weil es Informationen enthält. Leider interresieren sich die meisten Leute nicht für Informationsvideos, also wenn du weiter solcher Videos machst (Würde ich mich sehr freuen) versuch es kurz zu halten und die wichtigsten Informationen einzuarbeiten.","replies":[{"poster":"TheLittleSister","date":"2017-08-07T17:32:21.423+0000","up_votes":1,"down_votes":0,"body":"Hey, danke für dein Kommentar. Ich habe selbst schon darüber nachgedacht als das Video fertig war.\nAlso ich kann sehr gut verstehen was du meinst ^^ Für's nächste Video habe ich mir vorgenommen\nalles ein wenig kompakter zu gestalter und weniger künstlich zu klingen :)","replies":[]}]}]}