{"poster":"G00seEggs","date":"2019-01-01T22:49:46.106+0000","title":"If you have a file, Tab or anything named Cheat Engine","subforum":"Report a Bug","embed":{"description":"Or even typing in your Notepad... Reddit post: https://www.reddit.com/r/leagueoflegends/comments/aayvu4/lol_reads_your_browser_tabs_is_this_a_gross/ ➤ Music: Zero-project - Infinity (Visit http://www.zero-project.gr/ for more!) ➤ Send me your replays here: vandiril88@gmail.com ➤ Become a member/sponsor: https://www.youtube.com/channel/UCZ-oWkpMnHjTJpeOOlD80OA/join ➤ Follow me on Twitch, Twitter, Facebook, Discord and Subreddit! http://www.twitch.tv/vandiril https://twitter.com/vandiril https://www.facebook.com/Vandiril https://discord.gg/Vandiril https://www.reddit.com/r/vandiril/ I'm part of the official League Partner Program with Riot Games.","url":"https://www.youtube.com/watch?v=F9rBzKJxbOk","image":"https://i.ytimg.com/vi/F9rBzKJxbOk/hqdefault.jpg"},"up_votes":2,"down_votes":6,"body":"The last thing I want to do is get banned but humor me on this one. I have a second screen that auto plays YouTube when I am playing norms and this video came up... A game ended and another one started while this video was playing. The tab of my Chrome Browser is listed as &quot;If you type of &quot;Cheat Engine&quot; ..... \r\n\r\nI wasn&#039;t really listening to the video but it actually caused my next game to crash every time it started loading. During the reload time I started listening to the video. The Tab alone is named something that is caught with their anti cheat scan. I have other random crashes, I wonder what other name combinations cause this.\r\n\r\nSimply having something on my machine with Cheat Engine causes a crash, think I am joking? Open a training session 6-15 seconds into the game it will crash.","replies":[{"poster":"Hotarµ","date":"2019-01-02T00:18:08.606+0000","up_votes":4,"down_votes":0,"body":"This has been brought up 6+ times in the past few days.","replies":[]},{"poster":"KFCeytron","date":"2019-01-02T00:32:46.929+0000","up_votes":3,"down_votes":0,"body":"This board is for bug reports, not for obviously intended features that you discovered a few days after they became news.","replies":[]},{"poster":"GreenKnight","date":"2019-01-01T22:54:43.355+0000","up_votes":2,"down_votes":1,"body":"It's been brought up multiple times, let's wait until Rioters are back from break, ok?","replies":[]},{"poster":"Timethief49","date":"2019-01-02T12:36:00.442+0000","up_votes":1,"down_votes":0,"body":"But i have CE in my Computer, had it running for other stuff Düring League, and it didnt Crash. What am i doing wrong?","replies":[]},{"poster":"No Threshold","date":"2019-01-02T05:09:49.750+0000","up_votes":1,"down_votes":1,"body":"wtf, so they're monitoring all your actions??  I havent played LoL in a while but this brought me back just to check this lol.","replies":[{"poster":"KFCeytron","date":"2019-01-02T05:22:39.138+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=No Threshold,realm=NA,application-id=LqLKtMpN,discussion-id=Fho8f6rg,comment-id=0003,timestamp=2019-01-02T05:09:49.750+0000)\n>\n> wtf, so they&#x27;re monitoring all your actions??  I havent played LoL in a while but this brought me back just to check this lol.\n\nNo, they're monitoring the names of running processes, like any program can easily do. If the phrase \"cheat engine\" is somewhere in that list, the program terminates. There's no indication that it's phoning home or storing anything in any way.","replies":[]}]}]}