{"poster":"Deugemo","date":"2016-02-20T10:35:50.018+0000","title":"APH Gaming ASD Cerca jungler","subforum":"Reclutamento","embed":{"description":"APH Gaming ASD annuncia ufficialmente l'inizio delle selezioni per il ruolo di jungler per la sezione di League of Legends. Il team APH Gaming T1, che ha recentemente partecipato alla Nexus Fall League ed è tuttora in corsa per le LGP Pro Series, è alla ricerca di un componente per sostituire il jungler uscente nelle competizioni future.","url":"http://www.aphgaming.com/aph-gaming-cerca-jungler/","image":"http://www.aphGaming.com/wp-content/uploads/2016/02/APH-Gaming-selezione-jungler.jpg"},"up_votes":2,"down_votes":1,"body":"APH Gaming ASD annuncia ufficialmente l&rsquo;inizio delle selezioni per il ruolo di jungler per la sezione di League of Legends. Il team APH Gaming T1, che ha recentemente partecipato alla Nexus Fall League ed &egrave; tuttora in corsa per le LGP Pro Series, &egrave; alla ricerca di un componente per sostituire il jungler uscente nelle competizioni future.\r\n\r\nImpegnata sui tre principali titoli competitivi del momento, con il team di CS:GO costantemente all&rsquo;opera in numerosi eventi e la sezione di Hearthstone in attuale costruzione, APH Gaming intende fornire al proprio team di LoL i migliori elementi possibili: non solo qualit&agrave; individuali ma anche la capacit&agrave; di sapersi confrontare in gruppo e sapersi coordinare per gli obiettivi comuni.\r\n\r\nSono ulteriormente richiesti impegno e dedizione, oltre alla disponibilit&agrave; ad allenarsi in determinate fasce orarie e ad essere presenti per gli eventi competitivi. APH Gaming ha intenzione di investire tempo e risorse su League of Legends, esigendo rispetto reciproco.\r\n\r\nSe pensate di possedere le giuste caratteristiche, vi invitiamo a compilare la domanda di selezione che trovate al seguente indirizzo: [Apply Jungler Team APH League of Legends](http://www.aphgaming.com/reclutamento-league-of-legends/).\r\n\r\nAl pi&ugrave; presto verr&agrave; annunciata la deadline per l&rsquo;apply. Vi aspettiamo numerosi.\r\n\r\nAPH Gaming ASD\r\n\r\nPer saperne di pi&ugrave;: [APH Gaming ASD](https://www.facebook.com/profile.php?id=749807328371808&amp;ref=ts&amp;fref=ts), [APH Gaming T1](https://www.facebook.com/profile.php?id=186810788330818&amp;ref=ts&amp;fref=ts)","replies":[]}