{"poster":"omegaarab","date":"2017-11-20T04:41:29.241+0000","title":"SHACO IS VIABLE AGAIN AND I LOVE IT","subforum":"Gameplay","up_votes":4,"down_votes":5,"body":"The way i currently use shaco is take harvest, after first clear and a sucessful gank i get first back tiamat. i then rush duskblade, start picking up kills around the map and keep farming. after dblade i go my other burst tiems to finish the build statick-gunblade-ie-finsh machete into runich echoes( get defensive botos and seel tiamat to finish gunblade) with some harvest stacks and ur tiems u casn just q around back stab use ur burst tiems e and theyre dead. harvest fits shaco really well, to the point mid and late he is probably the best assassin in the game. he will have 1 second fast burstiwndow, and not ult reliant to kill. this will probably be sleeper op next ranked season. even against tanks and heavy ap i can find sucess going adaptive helm merc treads wits end an full dmg after, against tanks and bruisers u can go tri-titanic-bloodrazor-guinsoos and no one will be able to 1v1 u and ur cone slapping them with dps at the same time rlly fast, even the best of 1v1 champs\n\ndark harvest is the oomph assassin shaco needed, and it plays really well on him if you build and play right\n\nfrom, a talon main\n\nrunes-harvest,sudden impact, eyeball collector, relentless hunter\nlegend alacricty coup de grace\n\nfinal build- duskblade, gunblade , statick shiv, infinity edge, runic echoes, merc or tabi","replies":[{"poster":"z63XnLCMwX","date":"2017-11-20T04:59:01.087+0000","up_votes":1,"down_votes":0,"body":"I run electrocute. Will try to see which is better.","replies":[{"poster":"omegaarab","date":"2017-11-20T05:04:41.030+0000","up_votes":1,"down_votes":0,"body":"dark harvest does more dmg than electocute and its instant dmg applied as soon as u q and aa someone, gibbing them enough to die to e if u backstabbed","replies":[{"poster":"Zerdun","date":"2017-11-20T05:26:48.066+0000","up_votes":2,"down_votes":0,"body":"FWIW : dark harvest does more than electrocute after it is stacked. It also does more damage if champions/jungle mobs/cannon minions die near you during fights due to 'resets'. Electrocute does more damage @ earlier levels. I'm not 100% certain on when DH takes over Ele numerically but last i checked that is how it works.","replies":[{"poster":"Need Gold 4 Tent","date":"2017-11-20T06:08:40.736+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zerdun,realm=NA,application-id=3ErqAdtq,discussion-id=4zQZEzVa,comment-id=000100000000,timestamp=2017-11-20T05:26:48.066+0000)\n>\n> FWIW : dark harvest does more than electrocute after it is stacked. It also does more damage if champions/jungle mobs/cannon minions die near you during fights due to &#x27;resets&#x27;. Electrocute does more damage @ earlier levels. I&#x27;m not 100% certain on when DH takes over Ele numerically but last i checked that is how it works.\n\naccording to someone's calculations which I forgot the source, a standard assassin build (so it includes the AD from the scalings) for DH will only catch up to electrocute at ~400+ stacks","replies":[{"poster":"Zerdun","date":"2017-11-20T07:39:34.006+0000","up_votes":1,"down_votes":0,"body":"I can be sad that it needs the stacks to be that high right?","replies":[{"poster":"Need Gold 4 Tent","date":"2017-11-20T08:06:05.535+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Zerdun,realm=NA,application-id=3ErqAdtq,discussion-id=4zQZEzVa,comment-id=00010000000000010000,timestamp=2017-11-20T07:39:34.006+0000)\n>\n> I can be sad that it needs the stacks to be that high right?\n\nThe upside to it is that it is a resetting proc, so if you have a resetting assassin, you're looking at like 4 to 5 procs per teamfight as opposed to electrocute's one. Don't forget if it's a teamfight in the middle of minion waves, you're also looking to get random stacks off cannons that happened to be there and dead allies too.","replies":[{"poster":"Zerdun","date":"2017-11-20T13:58:52.117+0000","up_votes":1,"down_votes":0,"body":"I knew you got them from enemy champions and errant cannon/jungle mobs but your own team mates proc the effect too?\n\nPretty legit","replies":[]}]}]}]},{"poster":"omegaarab","date":"2017-11-20T05:37:54.410+0000","up_votes":1,"down_votes":0,"body":"also it has the plus of being instant, woch allows u to gib people based only on ur basic ability cds as harvest works with ur q dblade aa instantly of stealtu, the other items add burst and u can e to finish, killing somone in one second faster than zed, talon or any ap assassin with electorcute","replies":[{"poster":"Zerdun","date":"2017-11-20T07:38:51.181+0000","up_votes":1,"down_votes":0,"body":"Not for nothing but some champs can proc Ele nearly instantly as well. Its only two spells and an auto so some kits can probably apply that in literally 2 seconds or less.\n\nAnother 'downside' of DH is how it requires a cannon / jungle mob or champion dying before the fight. not to mention needing 150 stacks build up time to really get it going with the 5 minute buff duration. \n\nConsidering that you're looking to push as much upfront burst as possible (your looking to literally 1 shot). DH is probably more effective for your build but electrocute is probably just as effective if you can consistently proc it.","replies":[]}]}]}]}]},{"poster":"Hentai Lewds","date":"2017-11-25T09:36:25.883+0000","up_votes":1,"down_votes":0,"body":"let me fix for you the build . {{item:3147}} , {{item:1041}} , {{item:3117}}  .","replies":[]},{"poster":"Fowus","date":"2017-11-20T04:42:38.830+0000","up_votes":1,"down_votes":0,"body":"dank harvest","replies":[]}]}