{"poster":"Trollmanship","date":"2016-08-04T10:53:10.138+0000","title":"Just had the joy of playing against post-rework cass","subforum":"Gameplay","up_votes":2,"down_votes":2,"body":"Level 6 and is already faster than me with tier 1 boots, easily outranges short-medium range champions all game and cannot be engaged on at all because of ult after 6, rushes a rylais and immediately becomes 100% invincible against melees and other short-medium range champions with no ability to engage on her OR escape from her if you get hit by a single one of her [near-instant-cast] abilities. Swifties don&#039;t even help.\r\n\r\nAm I missing something or is there literally no counterplay to this champion at all if you pick something that doesn&#039;t outrange her?","replies":[{"poster":"lilpokfluf","date":"2016-08-04T11:40:04.766+0000","up_votes":2,"down_votes":0,"body":"You need either range or a second person to help.  And if you care about winning the game don't all rush her from one side so you don't All get stunned.  She is extremely squishy regardless of build and is very easy to stun if she is trying to deal consistent dmg","replies":[{"poster":"Blåbæret","date":"2016-08-04T11:47:24.751+0000","up_votes":2,"down_votes":1,"body":"She's no more squishy than the typical mid laner, can people stop using this arguement? Rylai's also gives her 400 HP.\n\nCurrently, Cassiopeia is invincible in lane. There's nothing you can do. Just ban her.","replies":[{"poster":"Dynikus","date":"2016-08-04T12:44:26.009+0000","up_votes":1,"down_votes":0,"body":"You say that like the typical mid laner isn't extremely squishy. \nshe's basically an ADC that happens to use AP.","replies":[]},{"poster":"Votable Jester","date":"2016-08-04T11:56:01.658+0000","up_votes":1,"down_votes":0,"body":"Or poke her out of lane\nOr hard push the lane and roam\nOr freeze it where she's overextended and spam jungle ganks","replies":[]}]}]},{"poster":"Votable Jester","date":"2016-08-04T11:35:51.259+0000","up_votes":1,"down_votes":0,"body":"Well yeah, she'll beat up on those few champions that cannot outrange, outmaneuver, or outburst her, but that's a pretty limited pool at that point.  Almost all teams have at least 2 champions that have those advantages over her, which should be plenty to take her down.","replies":[]}]}