{"poster":"lennart2422","date":"2016-10-10T12:41:53.820+0000","title":"Wann wird ein Championkonzept oder ein Skinkonzept von Riot übernommen?","subforum":"Skin- & Champion-Konzepte","up_votes":4,"down_votes":1,"body":"Wenn ich sehe, das selbst der meistgeupvotete Skin mit 500 Upvotes nicht von Riot &uuml;bernommen wird, dann frage ich mich was denn &uuml;berhaupt von Riot &uuml;bernommen wird... Wisst ihr es? Wenn nicht, dann upvotet bitte diesen Thread, sodass riot es eventuell sieht und eine Antwort darauf gibt.","replies":[{"poster":"Evenrider","date":"2016-10-10T16:02:23.929+0000","up_votes":1,"down_votes":0,"body":"http://leagueoflegends.wikia.com/wiki/Champion_skin/Skin_themes\nWenn du unter dem Reiter \"Other\" schaust, gibt es dort die Überschrift \"Proposed by the Community\". Das wären zumündest schon mal eine recht hohe Anzahl an Skins.","replies":[]},{"poster":"Nycaria","date":"2016-10-10T15:13:32.750+0000","up_votes":1,"down_votes":0,"body":"Meinst du diesen Skin http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/aOywzAeo-skin-idea-sea-witch-nami ?\n\nEs gibt Deep Sea Nami,der geht doch relativ in diese Richtung :)","replies":[]},{"poster":"Spicavius","date":"2016-10-10T12:54:27.516+0000","up_votes":1,"down_votes":0,"body":"Gefrier-Brand wurde damals von Riot umgesetzt. Es war nämlich eine Community Idee (so wie ich es mitbekommen habe).\n\nElise als Champ war mal in den Vorschlägen zu Champions drin. Hat 2 Jahre gedauert bis sie den umgesetzt haben (zwar in abgeänderter Form aber dennoch in diese Richtung).\n\nMan könnte noch viele andere Beispiele nennen, die ich aber auch nicht auswendig weiß. Riot hat schon viele gute Ideen der Community übernommen.","replies":[]},{"poster":"Shacoláde","date":"2016-10-10T12:50:24.456+0000","up_votes":1,"down_votes":0,"body":"Es gibt Skin- Championkonzepte die Monate bis Jahre dauern bis sie umgesetzt werden.\nIn Season 2 wurde damals bekannt das Riot an nem Drachenchamp rumdockert und hat jetzt bis Season 6 gedauert bis er\nmir Aurelion rausgekommen ist.\nBei den Skin geht es zwar deutlich schneller, aber auch nicht von heute auf morgen.\nIch kann mich noch an einen Beitrag (ich glaub aus dem alten Forum) erinnern, dass sich Riot and Skin- und Championkonzepte der \nCommunity orientieren, mehr aber auch ned. \nDenn die Ausarbeitung eines Skins ist echt nicht grad ohne.\nWenn Sie dann alle Skins die upvodes bekommen in Betracht ziehen würde, wäre das zu aufwendig um das umsetzen zu können.\nIch kann dich verstehen, aber ich glaub nie das eine Skinidee 1 zu 1 aus diesem Forum, Riot umsetzen würde.\nVorallem weil die deutsche Communitiy auch nicht wirklich die Größte ist.","replies":[]}]}