{"poster":"Cuttack","date":"2015-06-14T15:05:54.809+0000","title":"[Championkonzept] Hover Mud – Ein Schlammklumpen","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":3,"body":"Yo Yo Bois, ich war jetzt sehr lange nicht ihr im Forum und hatte es eigentlich auch nicht vor, gerade wenn ich dieses wieder mal richtig ekelhafte Design seh, aber ich hatte gerade 1 Idee f&uuml;r 1 Konzept, das ich schon f&uuml;r ziemlich dope halte und deswegen auch irgendwie poste wollte. Also geb ich mal wieder ein wenig von mir zum besten; dabei handelt es sich um das uneheliche Kind von Super Meat Boy und der Drecksackblase aus Spongebob, irgendwo zwischen Spielerei mit der 2D-artigen Spielperspektive und einem recht einzigartigen Konzept f&uuml;r Mechanik. \n\n**Hintergrund** (Einfach als kleine Einf&uuml;hrung, ich freestyle irgendwas zusammen)\n\nHover Mud hatte nie die ganz gro&szlig;en Ziele. W&auml;re es nach ihm gegangen, h&auml;tte er einfach eine Schulausbildung abgeschlossen, eine Ausbildung im Einzelhandel gemacht und sich mit Familie und Einfamilienhaus eine wunderbar spie&szlig;b&uuml;rgerliche Kleinstadtidylle aufgebaut. Leider schob die Realit&auml;t recht schnell zwischen ihn und seine Tr&auml;ume von b&uuml;rgerlichen Leben, geregelten Arbeitszeiten und einem kleinem Auto, dass er sich mit einer Ratenzahlung durch seinen sicheren Job bestimmt h&auml;tte leisten k&ouml;nnen, denn Hover Mud hatte eine problematische Eigenheit. Im Gegensatz zu der frappierenden Mehrheit seiner Mit-Menschen, war er ein strahlungsaktiv mutierter Klumpen brauner Schleim aus Schlamm, Dreck und F&auml;kalien. Und obwohl er seine kommunikativen F&auml;higkeiten und seine freundliche und loyale Arbeitsmoral f&uuml;r den Arbeitsmarkt durchaus als ansprechend einsch&auml;tzte, tat er sich doch schwer, ohne Arme und Beine einen k&ouml;rperlichen Job annehmen zu k&ouml;nnen oder als &uuml;belriechendes und Schlammspuren hinterlassendes Ungeheuer eine Stelle im Verkauf oder in der Kundenbetreuung zu ergattern. \nSo musste er lernen: Radioaktive Schlammklumpenmonster werden in der Gesellschaft r&uuml;cksichtslos diskriminiert: 3% aller befragten Passanten in seiner soziologischen Feldstudie antworteten auf die Frage, ob sie ihn f&uuml;r eine Stelle im Gro&szlig;handel einstellen w&uuml;rden ohne gro&szlig;e Bedenkzeit mit \"Nein\". Die &uuml;brigen 97% begannen bereits panisch die Flucht zu ergreifen, als sie Hover Mud auf den Stra&szlig;en bemerkt hatten. Diese Ungerechtigkeit sollte sein baldiges Dasein entschieden pr&auml;gen, denn mithilfe von staatlichen F&ouml;rdermitteln gr&uuml;ndete er die Stiftung \"Gegen Unterdr&uuml;ckung von Schleimmonstern aller Art e.V.\", die nach jahrelanger Arbeit nun schon zwei Mitglieder z&auml;hlt; neben Hover Mud selbst reihte sich auch der Liga`sche Champion Zac in seine Gruppierung ein, der auf dem Arbeitsmarkt &auml;hnlich ersch&uuml;tternde Erfahrungen mit Alltagsrassismus und Diskriminierung machen musste. \nUm seine Arbeit nun weiterhin zu finanzieren jobbt der kleine, braune Klumpen Schleim und Schlamm nun halbtags als Champion in der Liga der Legenden. Aber nur vor&uuml;bergehend &ndash; denn sobald er einen besseren Job gefunden hat, wird er sich mit diesem Vorlieb nehmen. Also schreibt er weiter Bewerbungen. Doch diese landen meistens schon beim Lichtbild des Bewerbenden auf dem Seitenstapel. \n\n**Gameplay-Konzept\n**\n\n_Ich w&uuml;rde Hover Mud als einen Fulltank-Support konzipieren, der selbst weder eigenes Lauftempo noch Angriffsschaden besitzt. Als Champion ist er immerzu darauf angewiesen, an W&auml;nden, Strukturen, Verb&uuml;ndeten oder Gegner zu kleben und dadurch entweder dezenten Schaden oder eine Menge Utility ins Spiel zu bringen. Funktionieren soll das ganze durch folgende F&auml;higkeiten:\n_\n**Passiv: Cliffhanger**\n\nHover Mud besitzt weder eigenes Lauftempo, noch eigenen Angriffsschaden. Er ist weder in der Lage, sich selbstst&auml;ndig zu bewegen, noch eigenm&auml;chtig normale Angriffe auszuf&uuml;hren. Seine Bewegung erfolgt durch die Spr&uuml;nge der Q, allerdings kann er sich nur an einer Wand oder an einem Gegner haftend aufhalten.\nAll seine regul&auml;ren F&auml;higkeiten besitzen ein Level 0, so dass er sie nicht erst erlernen muss, um sie zu Benutzen, allerdings f&uuml;gen sie auf diesem Level keinerlei Schaden zu. \n\nBemerkung: _Auch zus&auml;tzliches Lauftempo wird ihm nicht angerechnet, durch Rechtsklick kann man ihn nicht bewegen. Zur Bewegung ist er auf seine Q-F&auml;higkeit angewiesen. Ich werde die Werte der F&auml;higkeiten mit dem Level 0 folgenderma&szlig;en darstellen: (0|1|2|3|4|5). Sprich die erste Zahl beschreibt nicht den Wert auf Level 1, sondern auf Level 0._\n\n\n**Q: Raft**\n\nKosten: Keine\nCD: 8 Sekunden\n\nHover Mud springt eine kleine Distanz und f&uuml;gt dem ersten Gegner, auf den er trifft ((0|35|50|75|90|110) + 10% von Hover Muds zus&auml;tzlichen Leben) physischen Schaden zu. \n\nSollte er einen Gegner treffen, bleibt er an diesem unbefristet haften und reduziert seine Resistenzen um (0|10|12|14|16|18)% und f&uuml;gt ihm (0|1|1,3|1,5|1,7|2)% von Hover Muds maximalen Leben pro Sekunde als magischen Schaden zu. Nachdem er einen Champion verlassen hat, kann er ihn f&uuml;r die n&auml;chsten 15 Sekunden nicht mehr anhaften.\n\nTrifft er einen Verb&uuml;ndeten, haftet er diesem an und erh&ouml;ht dessen R&uuml;stung und Magieresistenz je um (0|5|10|15|20|25)% von Hover Muds R&uuml;stung oder Magieresistenz. Au&szlig;erdem f&auml;ngt er (0|20|25|30|35|40)% des eingehenden Schaden als absoluten Schaden ab. \n\nTrifft Hover Mud auf keine Einheit, wird der Sprung soweit ausgeweitet, dass er ihn zur n&auml;chstliegenden Wand bef&ouml;rdern wird. Die Abklinkzeit wird in diesem Fall auf zwei Sekunden zur&uuml;ckgesetzt.\n\nHover Mud kann bis zu 3 Aufladungen von Raft speichern und es, falls der Cooldown 3 mal geladen hat, 3 mal mit geringer Verz&ouml;gerung casten, um genug Mobilit&auml;t zu bieten. \n\nBemerkung: Die Reichweite des Sprungs entspricht etwa der von Renektons Slice and Dice. \n\n\n**W: Dirt Bomb**\n\nKosten: Keine\nCooldown an der Wand: (10|5|4.5|4|3.5|3) Sekunden\nCooldown am Gegner: (/|25|24|23|22|21) Sekunden\n\nAn einer Wand haftend: Hover Mud bombardiert ein kleines Gebiet mit Dreck, sodass er in einem kleinen Gebiet  (0|50|80|120|150|180) + 5% des maximalen Lebens als physischen Schaden verursacht, getroffene Gegner f&uuml;r 1,5 Sekunden um 15% verlangsamt und eine Matschpf&uuml;tze hinterl&auml;sst.\nDiese Matschpf&uuml;tze wird f&uuml;r seine Q-F&auml;higkeit als Wand gewertet, so dass er sie zur zus&auml;tzlichen Mobilit&auml;t und als Zoningtool benutzen kann. Diese Pf&uuml;tze bleibt 30 Sekunden bestehen\n\nAn einem Gegner haftend: Hover Mud wird eine Sekunde unmarkierbar, absorbiert dem anivisierten Ziel 5% seines aktuellen Lebens und erh&ouml;ht in dieser Zeit jeglichen Schaden auf dem Gegner um 100%. Er wird um 20% des Schadens, den das Ziel in dieser Zeit erleidet, geheilt. In dieser Zeit kann er weiterhin seine Q- und seine E- F&auml;higkeit benutzen. Diese F&auml;higkeit ist auf Level 0 nicht nutzbar.\n\n**E: Slam**\n\nKosten: Keine\nCooldown: 3 Sekunden\n\nHover Mud schl&auml;gt um sich und f&uuml;gt in einer geringen Umgebung um sich herum (50|75|100|135|170|200) +  (0|6|7|8|8|10)% seines zus&auml;tzlichen Lebens als magischen Schaden zu. Sollte er an einem Gegner haften, ist der Schaden zwar halbeirt, der Gegner wird daf&uuml;r aber zus&auml;tzlich um (0|20|25|30|35|40)% verlangsamt. \n\n**R: Be the Blob**\n\nKosten: Keine\nCooldown: (150|135|120) Sekunden\n\nHover Mud kanalisiert 5 Sekunden (Sollten keine Gegner in 400 Einheiten Reichweite sein halbiert sich dieser Wert) und transformiert sich f&uuml;r die n&auml;chsten (5|6|7) Sekunden zu einem gigantischen Super-M&uuml;llmonster, das sich eigenm&auml;chtig bewegen kann. Sein Lauftempo wird dann von 0 zu 50% der Summe seiner Magieresistenz und R&uuml;stung (mindestens 200) bestimmt und er kollidiert nicht mit Gegnern. Sollte er in diesem Zustand einen Gegner erfassen, wird dieser bis zu 2 Sekunden in Vince Super-M&uuml;llmonster-K&ouml;rper gefangen,erleidet (150|300|450) + 5% von Hover Muds maximalen Leben als magischen Schaden und werden hinter Vince aktueller Position mit f&uuml;r 5 Sekunden um (30|40|50)% verminderten Resistenzen wieder ausgeschieden.\n\nIn dieser Form werden seine F&auml;higkeiten vor&uuml;bergehend deaktiviert und jegliche Haftung an gegnerischen Champions aufgehoben. \n\n\n\nYo yo yo, d&uuml;rfte erstmal alles sein. Was haltet ihr so davon?","replies":[{"poster":"The fabulous Oak","date":"2015-06-14T15:47:13.857+0000","up_votes":1,"down_votes":0,"body":"Die Idee ist eine neue, finde ich interessant.\nJedoch finde ich die Q auf Verbündete etwas zu stark. Das ist sozusagen eine abgewandelte Orianna-E. Doch die besitzt die nötigen \"Nerfs\", um nicht OP zu sein. z.B. dass man in der Nähe sein muss und der Ball mit dem Q wieder weg ist. Ob man da nicht in die Richtung noch was ausdenkt?\n\nDie Geschichte ist interessant, ob das aber in die LoL-Welt passt ...\n\nDie E ist doch garnicht möglich, wenn der doch keine Hände/ Füße hat, wie soll der dann um sich schlagen? Wäre dann vielleicht wie die W von Zac denkbar.\n\nUnd außerdem denke ich, dass Zac sich lieber nicht öffentlich zeigen sollte, wo der doch immer noch von Zhaunianern (?) gesucht wird, so wie ich die Lore verstanden habe.\n\nSo meine Gedanken :)","replies":[]}]}