{"poster":"Dædalus","date":"2014-04-15T12:59:17.037+0000","title":"A Riot Games magyarokat keres!","up_votes":11,"down_votes":10,"body":"http://imgur.com/x3fWfla\n\nSziasztok!\n\nMivel még nem vagyunk teljes létszámban a magyar csapatban a Riotnál, közben pedig rengeteg nagyszerű javaslatot kaptunk tőletek már a PBE fórumon és nagyon aktívak vagytok itt is, arra gondoltunk, mindenképp jó ötlet lenne feltenni a kérdést, hogy nincs-e kedvetek csatlakozni hozzánk. Igen, magyarokat keresünk a Riot Games-hez!\n\n**Hoppá! Mik a feltételek?**\n\nMivel már itt vagytok, és velünk együtt dolgoztok a játék jobbá tételén, valószínűleg már kívül-belül ismeritek azt; ez eleve egy hatalmas jó pont. Emellett a kiváló minőséget és a játékosokat kell minden áron szem előtt tartani, folyamatosan fejlődni kell, és soha nem szabad megalkudni semmivel, ami nem tökéletes. Jessz!\n\n**Ez így nagyon szépen hangzik, de pontosan milyen képességekre van szükség?**\n\nTöbbféle pozícióra is keresünk embereket, és mindegyikre más képességek kellenek. Egy a közös mindegyikben: anyanyelvi szinten kell tudnod magyarul, és legalább felsőfokon angolul, emellett pedig hibátlanul, vagy majdnem hibátlanul kell tudnod írni mindkét nyelven. No meg imádnod kell a LoL-t és a játékosokat, de erről már beszéltünk. Minden nyílt pozíció pontos leírását megtalálod a [riotgames.com/careers](http://www.riotgames.com/careers?location%5B%5D=11&search=&offices=1246&depts=) oldalon.\n\n**Hogyan néz ki a munka?**\n\nKomolyan vesszük a dolgokat, ezért mindegyik rendes, napi 8 órás állás, annak rendje és módja szerinti fizetéssel. Ha úgy gondolod, jó vagy, tudnál nekünk tanítani egyet s mást, és te is ugyanolyan komolyan veszed a játékokat és a szórakozást, mint mi, jelentkezz! \n\n**Hol fogok dolgozni?**\n\nA Riot Games európai irodája Dublinban, Írországban van. Neked is ide kell költöznöd majd, ha szeretnél velünk dolgozni, és ha van kedved a világ minden tájáról érkező munkatársakkal felrúgni a korlátokat mint nap. Ne aggódj, a költözésben segítünk!\n\n**Hogyan tudok jelentkezni?**\n\nMinden állásra angol nyelvű önéletrajzzal és motivációs levéllel kell jelentkezni a *careers-eu@riotgames.com* címen. A tárgyhoz ne felejtsétek megadni, hogy pontosan melyik állásra is külditek a pályázatot!\n\nHa bármi egyéb kérdésetek van, tegyétek fel itt, mi pedig igyekszünk mi hamarabb válaszolni!\n\nTalálkozunk Dublinban? ;)","replies":[{"poster":"Tomas Torquemada","date":"2014-11-10T00:45:18.984+0000","title":null,"up_votes":5,"down_votes":14,"body":"Előbb vágatnám  le a farkamat, egy déli nigger, rozsdás, bozót vágó késével, mint hogy a rájotnak dolgozzak!\n\nAttól eltekintve, hogy a pénz olyan magas szinten érdekli őket, hogy azért áttaposnak, mindenen és mindenkin. Ezt az egészet még olyan szépen be is csomagolják k, hogy azok a kiskölykök, akik még a mikulásban is hisznek, azok boldogan adják nekik a piros kis csizmájuk tartalmát.\n\nAz egészhez még jó pofát is vágnak és csak azt irtják ki, aki nem felel meg az izlésüknek.","replies":[{"poster":"Zooty","date":"2014-11-10T21:20:46.164+0000","title":null,"up_votes":21,"down_votes":1,"body":"Szeretettel meghívlak téged dolgozni a Riot-hoz!!\nKérsz egy bozótvágó kést, vagy van nálad?:)","replies":[{"poster":"Sydarian","date":"2015-08-16T11:56:33.466+0000","title":null,"up_votes":2,"down_votes":0,"body":"VERY BIG LIKE XDXDXDXDXDXDXDXDXDXDXDXDXDXDXDXDXDXDXDXDXD","replies":[]}]}]},{"poster":"xXMaaciiXx","date":"2014-05-14T14:15:20.751+0000","title":null,"up_votes":2,"down_votes":13,"body":"Ez nagyon szép, s nagyon jó, de mivan a fizuval? napi 8 órát dolgozunk, mennyi a fizetés?","replies":[{"poster":"Dædalus","date":"2014-05-15T12:46:02.041+0000","title":null,"up_votes":21,"down_votes":2,"body":"Fizukkal így nem dobálózunk bele a nagyvilágba, és az a tanácsom, ha bármilyen állásinterjúra mész (nem feltétlen a Riothoz, bármi más lehet), te se így kezdd a dolgot, mert biztosan kampó. Ne a fizetés miatt jelentkezz semmilyen állásra sem, bár elhiheted, a Riotnál azért rendben van a dolog.\n\nA felvétel úgy megy, hogyha minden interjún és teszten megfelelsz, és a cég úgy látja, hogy szeretne téged a soraiba, akkor kapsz egy ajánlatot, ahol a fizetésedtől kezdve az egyéb juttatásokig minden megtalálható. Ekkor tudod azt mondani, hogy vagy elfogadod azt, vagy köszönöd szépen a bizalmat, de neked ez kevés, aztán tárgyaltok.\n\nAzelőtt igényeket jelezni, meg belemenni a fizetésbe, mielőtt a cég egyáltalán érdeklődést mutatna feléd, a világ legtöbb felvételi procedúráján nagyon rosszul jön ki, és ez nálunk sincs másképp.","replies":[]}]},{"poster":"JollyJ0keR","date":"2014-04-22T09:06:48.643+0000","title":null,"up_votes":2,"down_votes":0,"body":"tudom, hogy mi hiányzik ebből a játékból és mivel lehetne jobbá tenni, csak a felső fokú angol nem stimmel. De mivel évek óta ismerem ezt a játékot és játszom is vele.így szinte minden pontját ismerem.erősségeit,apróbb hibákat felfedeztem,bejelentettem. stbstb. Na de sebaj én annak is örülök ha figyelembe veszik az észrevételeim, esetleg az ötleteim fórumokon. Van egy két ötletem. :D","replies":[{"poster":"Dædalus","date":"2014-04-24T22:23:23.078+0000","title":null,"up_votes":6,"down_votes":1,"body":"A felsőfokú angol kell azért a munkához, mert az irodában rengeteg különféle nemzet dolgozik, úgyhogy a nap 98%-a angolul megy. Aztán arról nem is beszélve, hogy Dublinban lakni is kell, bevásárolni menni, bankszámlát nyitni, stb, amihez mind tudni kell angolul ugye.\n\nViszont nagyon szívesen vesszük az észrevételeid a fórumon, mert nekünk is ugyanolyan fontos, hogy a lehető legjobb legyen a magyar LoL, mint neked, és tudjuk, hogy nem mindig a mi ötleteink lesznek a legjobbak, sőt :)","replies":[{"poster":"kennychao","date":"2014-05-02T13:29:53.800+0000","title":null,"up_votes":1,"down_votes":0,"body":"Daedalus, te hogy tanultad az angolt? Milyen módszerrel tanultál/gyakoroltál? Meg neked milyen szereped van a csapatban?","replies":[{"poster":"Dædalus","date":"2014-05-09T16:20:36.506+0000","title":null,"up_votes":8,"down_votes":0,"body":"Anglisztika szakos voltam az ELTÉ-n, aztán a Riot a negyedik cég, ahol megfordulok, és alapból angolul megy minden kommunikáció. Előtte egy svéd IT cégnél, egy olasz koncertszervező cég német franchise-ánál, meg egy dubaji rendezvényszervezőnél dolgoztam.\n\nA Riotnál jelenleg én felelek a LoL magyar honosításáért, úgy ahogy van. A szinkronhangoktól kezdve az összes szövegig és minden fordításig az én felelősségem az egész történet. Mivel még keresünk embereket szép számmal, egy csomó másért is én vagyok a felelős, de a hivatalos történet szerint a honosítás a szakterületem. Szóval ha hülyeséget találtok bárhol a fordításban, én vagyok a felelős -- de cserébe hallgatok rátok, és a jó ötletekre! ;)","replies":[{"poster":"sajti9","date":"2014-07-17T14:25:55.379+0000","title":null,"up_votes":3,"down_votes":0,"body":"én annie passzivjánál láttam rossz fordítást mert ugy van irva hogy minden 4. spell kábít nem úgy hogy minden 4. spell után kábít a következő vagy valami ilyesmi{{champion:222}}","replies":[]}]}]}]},{"poster":"devifiu","date":"2015-03-05T09:49:33.102+0000","title":null,"up_votes":1,"down_votes":0,"body":"Detto az angolom az kevés lenne ehhez :D\nBiztos megértenénk egymást az emberekkel, de néha találgatni kéne mit akarok vagy én gondolkoznék azon amit mondanak :D\nÚgy hogy JollyJ0keRrel mi itt segítünk :D","replies":[]}]},{"poster":"Tettike","date":"2014-04-22T06:37:09.460+0000","title":null,"up_votes":3,"down_votes":2,"body":"Kedves Daedalus. Az emelt szintű angol érettségi is megteszi, mint felsőfokú angol tudás?","replies":[{"poster":"Dædalus","date":"2014-04-24T17:40:06.324+0000","title":null,"up_votes":6,"down_votes":0,"body":"Erre a választ csak te tudod. Mi itt nem kérünk semmilyen papírt, viszont az egy pillanat alatt kiderül az interjúk folyamán, hogy van-e olyan jó szinten az angolod, képes lennél egy angol nyelvű irodában dolgozni. Mivel itt körülbelül harminc nemzetből dolgoznak emberek, mindenkivel angolul kell beszélni írásban és szóban is. Ha úgy érzed, menne a dolog, jelentkezz, a papír nem számít!","replies":[]},{"poster":"Anvilhammer","date":"2014-04-22T08:17:05.072+0000","title":null,"up_votes":2,"down_votes":0,"body":"Tudtommal, az csak középszintű nyelvvizsgát ad","replies":[{"poster":"Clawlancer","date":"2014-04-22T08:43:43.974+0000","title":null,"up_votes":2,"down_votes":0,"body":"Igen, felsőfokú (emeltszintű) angol érettségi +60%-os teljesítmény esetén egy középszintű nyelvvizsgát is kapsz. Viszont fontos tudni, hogy az nem akkreditált, így csak Magyarországon ismerik el, ezért a Riot Games valószínüleg el sem fogadná azt.","replies":[{"poster":"Grim Dequ","date":"2014-04-22T10:34:17.749+0000","title":null,"up_votes":5,"down_votes":0,"body":"Külföldön nem nézik egyik nyelvvizsgát se, ha tudsz tudsz, ha nem akkor nem.\nA papírt meg lehet venni a piacon is :D","replies":[]}]}]}]},{"poster":"Hi im Ghost","date":"2014-04-22T09:45:03.276+0000","title":null,"up_votes":3,"down_votes":0,"body":"{{champion:74}}:    Kéne csinálni egy lengyel szerver!\n{{champion:74}}\nÉn minden játékost szeretek! (Nem troll-t játékost!) ezért van ez a reakcíóm amikor meglátom a \"játékos\" nevében a \"PL\" jelzést: {{item:3070}}{{item:3070}}{{item:3070}} \n  ","replies":[{"poster":"NieR 9S","date":"2014-05-24T00:30:44.966+0000","title":null,"up_votes":2,"down_votes":0,"body":"nagyon de nagyon egyetértek a véleményeddel. Nem tudom mennyi erő befektetésre lenne szükség nekik egy külön szervert csinálni, de ez tényleg már nagyon kiboritó amit elm\núvel 1-1 kedves lengyel \"barátunk\". Tudom ...minden game carriezhető és szemelőtt kell tartan a main objective-eket... de ha jól is játszassz, teamwork megvan a részedről de ők folyton cask soloba tolják és feedelnek .Agy nélkül játszák ezt a játékot trollpicktől flamelésig feedelésig mindent elkövetnek hogy az ember játékélményét a béka segge alá rontsák. A stábnak lehet nem akkora probléma, de a játékosoknak igenis az és nem mi vagyunk az elsők GhostRaider00 val akik ezen az állásponton vannak. Szóva ha valamilyen módon lehet ezen minimális változtatásokat létrehozni nagyon örvendenénk neki.","replies":[{"poster":"EGC Shred","date":"2014-05-24T02:18:40.695+0000","title":null,"up_votes":3,"down_votes":0,"body":"[kép](http://i.imgur.com/KjlxEUj.gif)\n\n\nAz a baj, hogy ha lenne külön egy lengyel szerver, akkor EUNE kb üres lenne, és ez nem vicc. Így is feleannyian vagyunk mint Westen, és a szerver játékosainak igen nagy hányadát a lengyelek teszik ki.\n\nEgyébként személy szerint semmi bajom a lengyelekkel, sokakkal önszántamból játszok már elég rég óta, a barátlistám közel fele tutira lengyel. Minden nemzet játékosai között vannak rossz játékosok. A lengyelek között azért ennyien, mert ők sokan vannak. Minél több játékos, annál több rossz játékos. Egyszerű matek.\n\nEgyébként meggyőződésem, hogy a hozzáállásod megváltoztatása sokat segítene abban, hogy ne csak elviselj más játékosokat, hanem élvezd a ranked meccseket, függetlenül attól, hogy kikkel sorsolt össze a matchmaking. Én is rengeteg olyan játékot nyertem már meg, ahol közel biztos volt a vereség, és még több olyan vesztettem el, amiből rengeteget tanultam, de végül mégis vereséggel végződött, de a vereség ténye cseppet sem zavart, mert jó játék volt.\n\nBelinkelnék most két korábbi hozzászólást amit nem olyan régen én követtem el, a bennük lévő tippek sokat segíthetnének a te helyzeteden is.\n\n[Hozzászólás #1](http://community.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/t2E0sTT0-elo-hell-ranked-eune?comment=00000000)\n\n[Hozzászólás #2](http://community.eune.leagueoflegends.com/hu/c/segitseg-es-tamogatas/Xav6V10d-skill-fail-meg-a-tobbi-ill-mar-megint-elohell?comment=0002)\n\n\nU.I.: Amúgy nem gyengén offtopic ez az egész beszélgetés, jó lett volna, ha ezt máshol beszéljük meg.\n\nÜdv.: \n\nShred","replies":[{"poster":"Sh3k4R","date":"2015-03-22T05:49:39.519+0000","title":null,"up_votes":3,"down_votes":0,"body":"Én csak annyit toldanék hozza, hogy azért mert látod a \"pl\" jelzést egy játékos nevében nem kell kiakadni, ha jó játékos nem lesz bajod vele, de ha rossz akkor nem kell \"lefikázni\" inkább tippeket adni neki vagy támogatni. {{champion:110}}","replies":[]},{"poster":"NeoKevin","date":"2015-08-23T15:11:07.299+0000","title":null,"up_votes":1,"down_votes":0,"body":"most komolyan mi a bajotok a lengyelekkel nem értem :D","replies":[]}]}]}]},{"poster":"Reloadead","date":"2014-06-04T19:43:52.601+0000","title":null,"up_votes":1,"down_votes":0,"body":"Sziasztok!\n   \nA héten frissíteni fogom az önéletrajzomat és jelentkezni fogok a *Player Support Coordinator* pozícióra. Jelenleg Lengyelországban dolgozom egy multinál (Budapesti céget támogatunk), ahol látszólag ugyanolyan vagy nagyon hasonló feladatokat végzünk nap mint nap, mint amelyekről a leírás első bekezdésében is olvasni lehet.\n   \nA kérdésem a következő:\nHa a tapasztalatom releváns, motivált és mobilis vagyok, a LOL-t pedig egyszerűen imádom és naponta játszom, akkor van arra esély, hogy az önéletrajz-búvárok nem dobnak félre első körben csak azért, mert az a  bizonyos releváns munkatapasztalat még alig hosszabb fél évnél?\n   \nÜdv,\nReloadead","replies":[{"poster":"iSPZ","date":"2014-06-04T19:55:28.562+0000","title":null,"up_votes":3,"down_votes":0,"body":"Erre biztosat senki sem tud mondani, esetleg az \"önéletrajz-búvárok\". Azt mondom, esély az mindig van rá, benne van, de nem ez az egyetlen és legfőbb szempont, hogy mennyi munkatapasztalat van. Sok esetben \"semmi köze\" az adott munkakörre jelentkezőnek a betöltendő állásra, mégis megkapja mert valami \"megtetszett\" benne. Nem ez az egy ok miatt fognak dönteni, amennyiben \"felkelti\" az érdeklődésüket akár egy mondat is az önéletrajzban, akkor nem hagynak békén, ami jó lehet! Amennyiben 3-4 hét után nem érkezik semmi válasz az nem jó, de nem is rossz, próbálkozni mindig lehet és kell is! Ha az első nem sikerült, a harmadik lehet fog! Én mindenesetre sok sikert kívánok!","replies":[]}]},{"poster":"Bandibo","date":"2014-11-10T22:05:38.439+0000","title":null,"up_votes":1,"down_votes":0,"body":"Arra lennék kíváncsi, hogy ez előreláthatólag milyen távú munkát jelentene? Félreértés ne essék, nagyon szeretem a LOL-t az első évad óta még brand megjelenésétől játszok, de 5-10 év múlva már nem biztos hogy tartani fogja a népszerűségét. Továbbá érdekelne hogy pontosan milyen pozíciókra keres a RIOT célzottan magyar munkatársat, mivel az állásajánlatok szerintem 90%-át bármilyen nemzetiségű ember betöltheti. Egy közeli ismerősöm jelenleg kinn dolgozik Dublinban, így nagyon vonzó az állásajánlat, de ha feladom az itteni életem és munkám tudni szeretném, hogy mik a távlati lehetőségek.","replies":[{"poster":"iSPZ","date":"2014-11-10T22:14:57.473+0000","title":null,"up_votes":2,"down_votes":0,"body":"A témában ott van egy [link](http://www.riotgames.com/careers?location[]=11&search=) ahol már beállított keresővel kiadja a jelenleg még betöltésre váró pozíciókat (pirossal szedve a magyar érdekeltségűeket, mellette zárójelben ott van ez is), valamit [itt](http://boards.eune.leagueoflegends.com/hu/c/hivatalos-bejelentesek/9Xe2v3AQ-a-riot-games-magyarokat-keres?comment=00320000) hozzászólás formában is külön-külön bemásoltuk őket, itt megnézheted ezt a hozzászólást.\n\nAz, hogy milyen távú ez a munka... na ezt nem fogja tudni megmondani Neked senki, azt hiszem. Ezt rengeteg dolog befolyásolhatja, csinálhatnak más játékot, kitalálhatnak valami újat, más irányba elmehetnek, bármi... valószínűleg még hosszú jövő áll a Riot előtt.","replies":[]}]},{"poster":"MrsCarolyne","date":"2014-06-18T18:59:07.008+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szép napot ! \n\nEgy olyan kérdésem lenne, hogy az angol ( azon kívül persze, hogy \"felsőfokú\" ) tudást az mennyire veszik szigorúan? Tehát ha a szókincsem nagy, de a nyelvtannal kicsit hadban állok. ( Nem olyan szinten ahogy azt Ön most hiszi.) A második kérdésem pedig arra irányulna, hogy ha beküldöm az önéletrajzom + motivációs levelet, akkor mennyi idő után kapok visszajelzést ?\n\nKöszönöm válaszát","replies":[{"poster":"iSPZ","date":"2014-06-18T20:31:25.104+0000","title":null,"up_votes":2,"down_votes":0,"body":"\"... anyanyelvi szinten kell tudnod magyarul, és legalább felsőfokon angolul, emellett pedig hibátlanul, vagy majdnem hibátlanul kell tudnod írni mindkét nyelven.\"\n\nFontosnak tartják, szem előtt van a dolog érthető okokból, ott minden angolul megy, még ha a magyar munkatársak az anyanyelvükön is kommunikálnak egymással, mindig nem kérheted meg hogy írjon már egy hivatalos levelet ami jó lenne ha nyelvtanilag is helyes lenne. Gondolom ha lenne időd, neki esnél abból kiindulva, hogy a szókincsed jó biztos vagyok benne azt a nyelvtant is helyre lehetne rázni, magyarral nincs baj, ezt ebből a pár sorból is észre lehet venni.\n\nMint írtam már korábbi hozzászólásokban, elég lassú sajnos a felvételi procedúra, rengeteg jelentkezés érkezik be. Amennyiben felkelti az érdeklődésüket akkor ezerrel jelentkeznek, ez legfeljebb 3-4 hét.\n\n(Remélem ezzel is minden kérdésedre megkaptad a választ, egyelőre. Megjegyezném Ezermester vagyok nem aktakukac aki az önéletrajzokat bújja, de ezek így vannak amiket leírtam, aztán sok sikert!)","replies":[]}]},{"poster":"Csuty","date":"2014-04-23T12:03:58.858+0000","title":null,"up_votes":1,"down_votes":1,"body":"Esetleg önkéntesnek lehet jelentkezni? Jelenleg érettségizni fogok, és szeretnék tovább tanulni, de szeretném fejleszteni az Angol tudásomat is, és nagyon szivesen segítenék amiben csak tudok.","replies":[{"poster":"Dædalus","date":"2014-04-23T12:15:29.419+0000","title":null,"up_votes":2,"down_votes":0,"body":"Jelentkezni konkrétan nem lehet, de ha elég aktív, pozitív, és segítőkész vagy folyamatosan, egyáltalán nem kizárt, hogy előbb-utóbb megkeresünk. Jó példa erre iSPZ és Necron Lord esete is, ők se jelentkeztek külön, csak nagyon jók voltak :)","replies":[{"poster":"NesThaesis","date":"2014-04-24T07:02:25.703+0000","title":null,"up_votes":3,"down_votes":1,"body":"A magyar pbe fórumra fellehetne jutni valahogy? Zárt most ugye a pbe szerverre a regisztráció ezért nem tudok regisztrálni. A fórumról a regisztráció pedig a normál regisztrációra dob át.","replies":[]}]}]},{"poster":"Thaesis","date":"2014-04-22T12:15:16.342+0000","title":null,"up_votes":1,"down_votes":0,"body":"Már kb 1000x jelentkeztem, mindig frissítem az önéletrajzomat és újból és újból elküldöm. A pozíciókra mind megfelelek mégsem kaptam még választ az utóbbi 2 évben.\n\nPedig nagy álmom válna valóra, ha végre felvennének.","replies":[{"poster":"iSPZ","date":"2014-04-22T12:25:40.719+0000","title":null,"up_votes":2,"down_votes":0,"body":"Sajnos nem túl gyors a felvételi procedúra de igyekeznek és mindent megtesznek, hogy gördülékenyebben menjen.","replies":[{"poster":"Thaesis","date":"2014-04-22T12:33:21.222+0000","title":null,"up_votes":1,"down_votes":0,"body":"te valami mod vagy itt amúgy ?:)","replies":[{"poster":"iSPZ","date":"2014-04-22T12:34:39.779+0000","title":null,"up_votes":2,"down_votes":0,"body":"Ha ráviszed a felhasználónevemre az egeret megláthatod, \"Ezermester\" vagyok.","replies":[{"poster":"Thaesis","date":"2014-04-22T12:37:35.933+0000","title":null,"up_votes":2,"down_votes":0,"body":"Az addig oké csak nem tudtam, hogy ezzel vannak megjelölve a \"nagyobb privilégiumú\" emberek. Tényleg bármit megtennék, hogy megkaparintsak egy ilyen állást, nagyon régóta vágyom rá már évek óta, hogy bekerülhessek, már azóta küldözgetem és frissítem az önéletrajzomat, mióta évekkel ezelőtt legelőször felkerültek a ( hungarian ) megjelölésű állások. Nagyon vágyom rá, amúgy is külföldön szeretnék elhelyezkedni, de ha még ráadásul annál a cégnél is sikerülne, ami a kedvenc játékomat készíti, az már egy álom lenne.","replies":[]}]}]}]}]},{"poster":"heroes4ever","date":"2015-12-30T16:13:52.812+0000","title":null,"up_votes":1,"down_votes":2,"body":"Szép és jó de emiatt ki megy Dublinba?","replies":[{"poster":"M4dr4c","date":"2016-01-07T13:48:51.341+0000","title":null,"up_votes":2,"down_votes":0,"body":"Bárki, aki normális körülmények között akar normális fizetésért dolgozni?","replies":[]}]},{"poster":"Erik112","date":"2015-11-17T17:58:35.389+0000","title":null,"up_votes":1,"down_votes":5,"body":"Ez a csicska %%%% [Riot] felfüggesztettek a kibaszott karimat úgy hogy az e-mail címen sincs ott hogy mi a kecit csináltam és sehol nincs de a legjobbb az az hogy minimum 60.000Ft költöttem ebbe a %%%%s játékba baszzákmeg!!!!!!!! -.-","replies":[{"poster":"M4dr4c","date":"2015-11-18T01:18:25.293+0000","title":null,"up_votes":3,"down_votes":0,"body":"A hozzászólásod alapján jogosan tették valószínűleg. De ez amúgy se idevaló.","replies":[]}]},{"poster":"LIKEGO","date":"2015-09-27T11:01:50.710+0000","title":null,"up_votes":1,"down_votes":0,"body":"Riot Games szeretnék egy kérdést intézni hozzátok miért van az hogy ha nem vagyok passiv és  nem lépek ki a játékból mért kapok büntetést???","replies":[{"poster":"Vágottszemu","date":"2017-09-17T06:18:02.306+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mert kilépsz xD","replies":[]}]},{"poster":"Mitsuharu","date":"2016-07-27T05:36:42.581+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lenne egy kérdésem : minden rendben van amit írtatok, csak azt hogy értsem hogy segítetek  költözködésben?","replies":[]},{"poster":"Sky Fighter Hun1","date":"2015-12-12T13:02:14.868+0000","title":null,"up_votes":1,"down_votes":0,"body":"{{champion:161}} {{summoner:14}} {{item:3083}} {{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Lyrik89","date":"2015-11-17T11:42:37.089+0000","title":null,"up_votes":1,"down_votes":0,"body":"Üdv Daedalus!\n\nTöbb kérdés is felmerült bennem a jelentkezéssel kapcsolatban, az egyikre lentebbi hozászólásodban választ is kaptam ami azonban újabb kérdést vetett fel...\n\nSzóval egy recruitment team foglalkozik a jelentkezésekkel; a helyzet az hogy volna egy referencia munkám amit csatolnék de csupán a magyarok tudnák azt értékelni. Természetesen angolul is képes vagyok hasonló munkákat csinálni de ez már magyarul született meg és úgy érzem elveszne a szépsége és értéke ha átdolgoznám angolra. Ilyen esetben van rá esély hogy a recruitment csapat, névtelenül természetesen, kikérje a véleményeteket?\n\nA következő dolog az lenne hogy a levélben a megpályázott pozíciót is meg kell jelölni, ezzel nekem két gondom van. Egyrészt a képességeim több pozícióra is megfelelőek valamint én is minél több fronton szeretném segíteni a Riotot. Másrészt sajnos az életem úgy alakult hogy a képzettségem minimális, messze alul múlja azt amire valóban képes és alkalmas vagyok. Természetesen örömmel tanulok meg bármit ami segít hogy parlagon heverő képességeimet a League of Legends szolgálatába állíthassam, de így 27 évesen úgy vélem jobb volna ha eközben már aktívan a Riotnál dolgozhatok. Egyszerűen elpazarolt időnek érezném ezek beszerzését előre majd utánna jelentkezni és anyagilag se tudom kivitelezni, sajnos az erre való időmet elpazaroltam arra hogy 'normális' munkám legyen amikben sose tudtam kihozni magamból azt amire valóban képes vagyok. Egyébként előnye is van ennek; a Riot pont abba az irányba fejlesztheti a képességeim és tudásom amire igazán szükség van nálatok (és biztos vagyok benne hogy bőven megérném a befektetést... de ezt majd a motivációs levélben taglalom). Befogadnak szerinted olyan jelentkezést amiben a pozíció eldöntése a Riotra van hagyva, amolyan multitasker-ként jelentkezést?\n\nTöbben írták hogy mintha a megadott mail cím inaktív lenne... utánna járnál hogy akkor most él-e még vagy a recruitment csapat átváltot csak a Riot honlapon keresztüli jelentkezésekre?\n\nVálaszodat előre is köszönöm!","replies":[]},{"poster":"luvBrr","date":"2015-10-27T07:50:12.545+0000","title":null,"up_votes":1,"down_votes":0,"body":"sziasztok . én arról szeretnék érdeklődni, hogy ez a munka a későbbiekben is elérhető lesz??, olyan 5-7 év múlva?? a választ előre is köszönöm a riot munkatársaitól!!! :)","replies":[{"poster":"Zooty","date":"2015-10-27T14:31:35.257+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez majd 5-7 év múlva kiderül.. Előre semmi sem biztos.","replies":[]}]},{"poster":"Mind The Gap","date":"2015-10-05T18:26:03.860+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hmmmmmm, milyen vicces lenne már, ha a Riotnál lehetne ledolgozni az érettségihez szükséges 50 óra \"önkéntes szolgálatot\". :P","replies":[{"poster":"Bubi a Cica","date":"2015-10-06T10:44:53.953+0000","title":null,"up_votes":1,"down_votes":0,"body":"Azt ugyen nem, de a gyakornokságot lehet egyetmista/főiskolás korodban: http://www.riotgames.com/careers/99270","replies":[]}]},{"poster":"Jeffreyke","date":"2015-09-16T09:57:16.961+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az angol tudásról papír kell vagy elég az interju-n beszélgetni angolul?","replies":[{"poster":"Bubi a Cica","date":"2015-09-17T12:01:51.196+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mindegyik pozícióhoz kell írnod egy motivációs levelet angolul, illetve egy angol nyelvű CV-t, abból már eléggé ki fog tűnni, hogy mennyire megy.\n\nBizonyos pozíciók aztán külön teszteket igényelhetnek.\n\nElég gyakorlott álláskereső vagyok, és biztosan mondhatom, hogy az állások 95%-ánál senkit nem érdekel a papír (a nyelvről). Le fogják tesztelni azt a szintet, ami kell nekik.","replies":[]}]}]}