{"poster":"Σ G O","date":"2019-09-28T20:06:31.284+0000","title":"Axxial Gaming!","up_votes":20,"down_votes":1,"body":"A képek magukért beszélnek...Ilyen hozzáállással nem értem hogyan kapnak bármi nemű támogatást a Riot-tól...Ha szerinted sem érdemlik meg kérlek nyomj rá az upvote-ra, hogy minél többen lássák! \n-1.: https://prntscr.com/pc91lm\n-2.: https://prntscr.com/pc91n5\n-3.: https://prntscr.com/pc91of\n-4.: https://prntscr.com/pc93uj\n\nUI.: Nem az első \"botrányuk\" lenne már! Például akik más magyar versenyen is részt vesznek és a fülükbe jut, azokat szintúgy eltiltják...Szerintem ez nem jogos! Nem ez kell a népszerűséghez!","replies":[{"poster":"NorvaTheOne","date":"2019-09-30T17:45:03.468+0000","title":null,"up_votes":3,"down_votes":0,"body":"Tekintettel a körülöttük kialakult botrány után, aminek megvolt a maga visszhangja(kitiltották őket az összes League of Legends Hungary csoportból) én alapból megfontolnám, hogy egyáltalán jelentkezek-e a kupáikra. A probléma ott kezdődik, hogy az emberek a Free RP reményében elmennek és támogatják ennek a személyiségzavaros embernek a tevékenységét, mert amíg ingyen RP-hez van lehetőségük jutni, addig why not? Vannak csapatok, akik anonim profillal vesznek részt a bajnokságaikon, hogy a másikon(ami sokkal színvonalasabb) is lehetőségük legyen játszani és ez szomorú. A Riot Games ebben a tekintetben tehetetlen, mert ez nekik is bevétel és nyilván nem fognak megfosztani egy h*lyét attól, hogy RP-re költse a pénzét. Egyénileg szervezett versenyekről van szó a Battlefy versenyoldal keretein belül, innentől kezdve nem okolhatod a Riot Games-t, legfeljebb a Battlefy-on jelentheted őket és toborozhatsz embereket, hogy tegyék meg ugyanezt. \n\nEzenkívül amit tehetsz, hogy messziről elkerülöd őket és nem veszel részt az általuk meghirdetett kupákon, hanem helyette a Triple Media E-Sport kupáin veszel részt és erre buzdítod a barátaidat, ismerőseidet is. Egyrészt azért, mert ha ott nyersz, biztosan megkapod a versenyért járó jutalmadat(nem úgy, mint az Axxial esetében, ahol konkrétan csak baitelik az embereket, hogy monopol helyzetet kialakítva minél többen vegyenek részt a kupáikon egy bizonyos ideig). Sokszor volt már rá incidens, hogy az emberek hónapokig vártak az RP-re, majd az RP kiutalásának megtagadása érdekében kifogásokat keresve \"diszkvalifikálták\" a csapatokat(más kérdés, hogy akkor még Hungarian Gamers néven futottak, de tekintettel a rengeteg botrányra, ami körülöttük zajlott, a főszervező kénytelen volt nevet váltani). Másrészt amíg résztveszel az általuk megszervezett versenyen, támogatod azt, amit képviselnek. És a helyzet az, hogy az embereket egyáltalán nem fogja érdekelni, hogy kik szervezik a kupát, amíg bedőlnek a fals ígéreteknek és az esetek 95%-ában sorsolásoknál is belsős emberek kerülnek ki a győztes kalapból(na vajon miért?), versenyek esetében pedig \"60 napos késéssel kell számolni az RP kiutalását tekintve\", ha pedig nem tudják kiutalni, rákerülsz a black listre, valamilyen fals indokkal kizárnak a részvételből, és tiltólistára kerülsz a Facebook oldalakon is. \n\nPiramisjáték az egész, bízván abban, hogy esetleg felkarolja őket egy nagyobb szervezet tekintettel a monopolhelyzetre, amit próbálnak kialakítani. És amíg vannak versenyzők, addig ennek nem is lesz vége.","replies":[]},{"poster":"Zoes wet pantsu","date":"2019-09-29T11:04:30.091+0000","title":null,"up_votes":5,"down_votes":7,"body":"Erre csak annyit hogy ha nem adottak a feltételek a competitív játékhoz, akkor ne játssz. Senkit nem érdekelt, hogy azért nem vagy ott mert elment az áram vagy épp a halott hörcsögödet gyászolod. A tényen, hogy a csapatod miattad került hátrányba/lett diszkvalifikálva nem változtat. A te felelősséged biztosítani, hogy ott legyél a játék egésze alatt, ha ez nem megy akkor az egyéni probléma. Amikor jelentkeztél akkor elfogadtad a szabályokat, amibe valószínűleg le van írva milyen büntetés szabható ki ha kilépsz.\nCsak bónusz, hogy ha a te oldaladról van a probléma akkor legalább ne állj neki fesztiválozni, hogy \"HÁH AMÚGY SE AKAROK RÉSZT VENNI QQ\", mert nem dedóban vagy. Már csak azért sem mert akivel beszéltél teljesen korrektül járt el, nem az ő hibája, hogy megszegted a szabályokat.","replies":[{"poster":"The One ESCANOR","date":"2019-09-29T12:00:14.580+0000","title":null,"up_votes":1,"down_votes":1,"body":"Maradjunk annyiban hogy az Axxial Gaming adminja helyesen járt el, de elég lett volna egyszer leírni hogy kitiltják a srácot és utána nem adni alá a lovat és egy kisebb vitát indítani ez miatt.","replies":[{"poster":"Knight Thyme","date":"2019-09-30T07:56:32.523+0000","title":null,"up_votes":3,"down_votes":0,"body":"Jó, hát lehetne futni pár kört, hogy mennyire igényesen fogalmazott az Axxialos emberke. Azért, ahol üzlet van, pénz van, ott elvárja az ember, hogy elütések és helyesírási hibák nélkül tudjon valamit megfogalmazni.","replies":[]}]},{"poster":"Funnyboy44","date":"2019-09-30T18:06:14.406+0000","title":null,"up_votes":1,"down_votes":3,"body":"Van egy olyan érzésem, hogy te meg a kedves szervezet talpnyalója vagy, ugyanis nem a játékos hibája a hirtelen áramszünet. Nem lehet ellene mit tenni, így nem tudja biztosítani, hogy ne történjen meg. Tedd magad ebbe a szemszögbe. Elmegy az áram, tudtál róla, hogy bekövetketik? Nem. Tudsz ellene tenni? Nem. Akkor hogy tudod \"biztosítani, hogy ott legyél\"? Vagy a másik példa, hogy valamelyik hozzátartozóval történik valami. Lehet, hogy te ilyen igazi nolifer vagy, de ha egy normális ember hozzátartozójával történik valami, akkor otthagyja a játékot. Ezeket úgy hívják, hogy véletlenek, amik ellen senki nem tud semmit sem tenni. Tehát jó lenne, hogyha nem talpnyalóként gondolkodnál mielőtt írsz, hanem normális emberként.","replies":[{"poster":"Knight Thyme","date":"2019-09-30T18:55:13.846+0000","title":null,"up_votes":2,"down_votes":1,"body":"Mert a cserbenhagyott 4 játékos álláspontját nem képviselheti? Velük senki se törődik itt. Ők aztán miről tehettek?","replies":[]},{"poster":"Zoes wet pantsu","date":"2019-09-30T21:39:30.518+0000","title":null,"up_votes":2,"down_votes":1,"body":"Nem talpnyaló vagyok, életembe nem hallottam még erről a szervezetről, teljesen le is szarom őket. Viszont senkit nem érdekel ingame hogy mi a bajod, vagy ott vagy vagy nem. A körítés meg a kifogások nem változtatnak a tényeken. Ha valaki kompetitív játékra adja a fejét, az vegye tudomásul, hogy nincsenek kifogások.","replies":[]}]}]},{"poster":"ßruce Łee Sin","date":"2019-09-29T18:37:12.968+0000","title":null,"up_votes":3,"down_votes":0,"body":"Nagyon sokra tartjak magukat,írtam már enis nekik","replies":[]},{"poster":"Knight Thyme","date":"2019-09-29T08:55:53.807+0000","title":null,"up_votes":3,"down_votes":0,"body":"Elvonatkoztatva a játékszervezővel való problémádtól, egy szünetmentes táp sok kellemetlenségtől megment. Szerintem érdemes belefektetni.","replies":[{"poster":"Σ G O","date":"2019-09-29T10:17:17.718+0000","title":null,"up_votes":3,"down_votes":0,"body":"Nem a \"játékszervezővel\" (legyen bármi is az) van problémám, hanem azzal amit csinálnak és ahogyan csinálják...Nameg ugye pontosan amiatt fogok szünetmentes tápra beruházni, hogy Lolozhassak :D Eltaláltad barátom!","replies":[{"poster":"Knight Thyme","date":"2019-09-30T07:48:38.913+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ne értsd félre, nem vádoltalak a helyzet miatt, bár ha versenyezni akarsz, lehet, akkor megért volna ennyi befektetést.\n\nDe a szünetmentes táp nem csak a LoL miatt hasznos, hanem minden mást védesz vele, amit a számítógépen csinálsz. Munka, más játékok, hobbik. Sőt, ha rosszabb minőségű elektromos hálózat van kiépítve felétek, akkor bizony megeshet, hogy pár hónap vagy max egy év alatt \"megesz\" pár gépalkatrészt, ha nincs egy szünetmentesed, ami felfogja a terhelést.","replies":[]}]},{"poster":"Gregori","date":"2019-09-30T19:02:36.195+0000","title":null,"up_votes":1,"down_votes":0,"body":"De az az internetet nem fogja megóvni, nem? Mert akkor nem vagyunk beljebb.","replies":[{"poster":"Knight Thyme","date":"2019-09-30T19:49:40.248+0000","title":null,"up_votes":2,"down_votes":0,"body":"Attól függ. Nekem az egész hálózat szünetmentesen van, tehát a modem áramellátása se szakad meg. Egy helyi áramszünetet fennakadás nélkül meg tudok úszni. Persze attól függ, meddig tart, ha épp a játék elején üt be, akkor kifuthatok az időből vele. De van időm tájékoztatni a csapatot. :(\n\nMondjuk én meg tudom oldani, hogy a UPC leállása esetén a mobilnetemet megosszak a gépemmel, de a tartalék internet már csak hab a tortán.","replies":[]},{"poster":"Zefr4el","date":"2019-12-09T09:00:57.250+0000","title":null,"up_votes":1,"down_votes":1,"body":"Szerintem nem 5percet hiányozhatott :D D:DD ha így kellett tenniük","replies":[]}]}]},{"poster":"Shikaichi","date":"2019-09-28T20:12:00.891+0000","title":null,"up_votes":1,"down_votes":0,"body":"Már nem kapnak támogatást tőlük, ugyanis egyelőre nincs lehetőség erre, úgyhogy saját magukat pénzelik.\nAmúgy nekem is hasonló véleményem van róluk, hogy nem így kéne népszerűségre szert tenni. Bár ez szerintem idővel inkább visszásan fog elsülni, és nem fognak részt venni az emberek a versenyeiken.","replies":[{"poster":"Σ G O","date":"2019-09-28T20:15:55.912+0000","title":null,"up_votes":3,"down_votes":0,"body":"Tegnapi napon beszéltem velük, ugyanis már egy hónapja várom az RP nyereményem...Ott azt mondták, hogy a Riot-os kolléga aki az RP-t küldi el van utazva és azért késik...Szóval akkor felmerül a kérdés...Még hazudni is képesek?","replies":[{"poster":"Shikaichi","date":"2019-09-28T20:55:13.045+0000","title":null,"up_votes":3,"down_votes":0,"body":"Nem tudom... Azt hiszem, mikor volt ez a más versenyre járók kitiltása botrány, akkor volt említve a vezetőjük által, hogy Arwyll segített neki tisztázni az RP-ket és majd küldi az érintetteknek. Csak azért gondolom, hogy ebben lehet ráció, mert a két érintett fél valóban ismerősek Facebookon, de hogy tényleg így történt e, arról persze nincs dokumentáció.\nHivatalosan a Riot jelenleg nem ad támogatást az amatőr versenyszervezőknek, amiket kihasználva ők is támogatást kértek. Ha most megnézed a \"[Közösségi versenyek](https://events.eune.leagueoflegends.com/hu/)\" részt az oldalon, akkor nincs egy darab sem kirakva és felül egy szöveg figyelmeztet, hogy most szünetel az egész.","replies":[{"poster":"Σ G O","date":"2019-09-28T21:06:11.057+0000","title":null,"up_votes":3,"down_votes":0,"body":"Valaki nem mondd itt igazat...Vagy a Riot vagy pedig az Axxial...Szerintem az utóbbi...De amit csinálnak az akkor sem jogos!","replies":[]}]}]}]},{"poster":"Lord Malthael","date":"2019-09-30T06:51:25.322+0000","title":null,"up_votes":1,"down_votes":1,"body":"Téma kapcsán egyiknek se adok igazat. \nRiotnak ezt kellene csinálni, amit Axxial Gaming tett. \nAxxial Gaming csapat a saját pénzééből fizet másoknak, igy jogosan kezelik a büntetést.De! és most jön a de.\nHa nem kamuzol , és egyszer fordult elő, akkor ezt az 1 .évet nyugodtan 1-2hétre csökkenhetik .\nBüntetés jogos, de nem 1.évre . ","replies":[{"poster":"Knight Thyme","date":"2019-09-30T07:57:12.670+0000","title":null,"up_votes":2,"down_votes":1,"body":"Igazából attól függ, kit kérdezel erről. Ha a másik 4 játékos nyilatkozna, lehet ők az 1 évet is kevésnek tartják.","replies":[]}]},{"poster":"Zefr4el","date":"2019-12-09T09:06:59.305+0000","title":null,"up_votes":1,"down_votes":0,"body":"Suli következő évében mehetsz :D addig spórolhatsz szünetmentesre :D","replies":[]}]}