{"poster":"ForresTrump","date":"2017-07-01T09:47:49.917+0000","title":"\"Basta del elo Boost\"","subforum":"Off-topic y temas personales","embed":{"description":null,"url":"https://www.facebook.com/Ssponw/?ft[tn]=k&ft[qid]=6437732691036546920&ft[mf_story_key]=6337339569914708497&ft[ei]=AI%403a82001cf5d391ea54f27435675bc00c&ft[fbfeed_location]=1&ft[insertion_position]=1&ft[ordinal_position]=2%3A1&__md__=1","image":null},"up_votes":6,"down_votes":0,"body":"Creo que estas personas deber&iacute;an recibir una sanci&oacute;n muy severa ya que al posicionar a jugadores en ligas que no corresponden a su habilidad perjudica la experiencia de juego de muchos jugadores.","replies":[{"poster":"ZanahoriaAsesina","date":"2017-07-01T12:11:20.554+0000","up_votes":2,"down_votes":0,"body":"El problema es que Riot no tiene poder sobre las páginas que ofrecen eloboost, pueden investigar y todo eso pero no pueden castigar a nadie sino hasta que se rompan las reglas dentro del juego.\n\nSi ves algún nombre dentro de la página, envía un mensaje a Soporte con una captura de pantalla.","replies":[]},{"poster":"Nuke","date":"2017-07-01T15:30:02.221+0000","up_votes":3,"down_votes":1,"body":"A ver amigo. Este post con todo respeto lo veo muy inutil, obviamente Riot esta en contra del eloboost y combate contra el todo el tiempo. ¿De verdad crees que es necesario un post diciendoles algo tan obvio? No creo que sea de mucha ayuda.\nAun asi, admiro tu buena voluntad.\n\n¡Un saludo!","replies":[{"poster":"Cris300","date":"2017-07-01T19:01:59.450+0000","up_votes":1,"down_votes":0,"body":"te apoyo, los que deberia dar rito en maxima prioridad es a los trolls y afks, ademas somos el 2do server con mas trolls y afks y se deberia de solucionar, osea, si a un troll lo reportan todos o una de dos:\n\n1-lo ponen en cola de baja prioridad\n2-lo banean 1 dia","replies":[]}]},{"poster":"Kanan","date":"2017-07-01T18:08:32.018+0000","up_votes":1,"down_votes":0,"body":"Pero no se preocupen cn los elobosteados si te tocan en ranked ellos bajan osea no van a subir de liga","replies":[]},{"poster":"Poisoned Mayhem","date":"2017-07-01T16:47:48.590+0000","up_votes":1,"down_votes":0,"body":"Para mi el método que tiene Riot para lidiar contra el Eloboost es muy efectivo , porque yo tenia un amigo que era silver II y que no podía subir mas. En un momento le cae una suspension por flamer (bien merecida) , y cuando vuelve a jugar  (unas 2 semanas desde que vuelve) empezó a subir divisiones muy rápido, de silver 2  a oro 3 en un par de días, y yo pensaba - bueno habrá mejorado y pudo superarse a si mismo, pero si llega a platino V seguramente sera eloboost- y mis dudas fueron aclaradas por que cuando entre a su historial solo jugaba 1 champ (típico de los eloboostings) y llego a platino V , bueno que una vez estando ahy ya era bastante obvio el eloboost y ademas el no jugaba mas rankeds por miedo a descender.\n Bueno hoy 1/07/2017 su mejor amigo me dice que a el (hablo del que subió a platino V) lo habían permabaneado por supuesta mente \"flamer\" y el le dijo a su amigo que solo había flameado 1 vez al contrario y lo banearon (una total mentira para ocultar su eloboosting).\nbueno esa es mi historia de confianza en que Riot sabe detectar eloboost. {{sticker:slayer-pantheon-thumbs}} GG riot","replies":[]}]}