{"poster":"Atisch2","date":"2016-02-01T02:03:00.707+0000","title":"Jhin, Welche Lanes ?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"auf welchen lanes würdet ihr jhin empfehlen?","replies":[{"poster":"Enio","date":"2016-02-01T17:30:41.560+0000","up_votes":1,"down_votes":0,"body":"Sieht der Gegner die Jhin Ult, außer die Geschosse?","replies":[]},{"poster":"Ηastur","date":"2016-02-01T11:31:25.723+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/AwfWNEBs-jhin-der-virtuose-rollenverteilung","replies":[]},{"poster":"Atisch2","date":"2016-02-01T03:05:40.391+0000","up_votes":1,"down_votes":0,"body":"jo hätte auch normal bot gesagt, hab nur mehrfach von top und mitte gehört und irgendwie klang das merkwürdig wenn man sich seine spells usw anguckt","replies":[{"poster":"Shadow l Eagle","date":"2016-02-01T10:55:52.464+0000","up_votes":1,"down_votes":0,"body":"Jhin ist Mid Laner / ADC hab ihn im PBE sehr oft und gern genommen :P","replies":[]}]},{"poster":"XCaitultedjfkX","date":"2016-02-01T02:19:23.749+0000","up_votes":1,"down_votes":0,"body":"naja da es ein adc ist würd ich mal stark botlane vermuten xD.\nseine range erlaubt es ihm aber glaube ich auch in der mitte gegen viele zu lanen top ebenso.\nhat halt kein escape was ihn wieder zur botlane bringt^^.\nmit ner leona jhin lane is es glaube ich gg \nist auf ner duo lane zu stark als das man ihn solo spielen sollte.\nnaja hab ihn bis jetz nur gesehen mal abwarten.\njungle müsste man mal versuchen ich selbst halte nich so viel von jungle adc aber er hat ja wenigstens ordentlich cc.\nfazit : alles ist möglich trozdem würd ich eher bot empfehlen.","replies":[{"poster":"dugg","date":"2016-02-01T07:56:24.591+0000","up_votes":1,"down_votes":0,"body":"Ich würde ihn als Bot- und Midlaner  sehen. Es gibt diverse PBE-Videos auf der Midlane ist er echt stark. Seine Range und sein Schaden ist enorm. Er hat keine Escape-Fähigkeiten so wird er auf niedrigem Spielniveau wohl eher viel auf der Botlane zu sehen sein. \n\nFür mich fällt er als Jungler raus, obwohl ich ihn auch hier schon gesehen habe. Da er aber keinerlei Gapcloser hat, kann schnell vor ihm fliehen. Das einzige was ihn im Jungle noch stark macht, ist seine Range der W und seiner Ulti. Hier kann man aus zweiter Reihe schießen und einer Lane einen Vorteil verschaffen. \n\nTop fällt komplett weg, da er gegen Meeles ziemlich schwach sein kann.","replies":[{"poster":"Shadow l Eagle","date":"2016-02-01T10:54:05.873+0000","up_votes":1,"down_votes":0,"body":"naja würde ich nicht sagen er kann die leute Slowen + Stunen","replies":[]}]}]},{"poster":"h4Rpyy","date":"2016-02-01T04:09:21.720+0000","up_votes":1,"down_votes":0,"body":"Er wurde für die Botlane gemacht, allerdings kann man ihn auch sehr gut in der Mitte spielen.","replies":[]},{"poster":"XCaitultedjfkX","date":"2016-02-01T02:45:20.099+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=vdwZ9DpzRKc\nkannst dir das mal anschauen der geht mid schon ab^^","replies":[]},{"poster":"Foxedge","date":"2016-02-01T11:15:15.726+0000","up_votes":1,"down_votes":1,"body":"Man kann ihn vermutlich auf jeder Lane Spielen. Es ist selten, dass ein Champ nur auf einer oder zwei Lanes funktioniert. Der Rest hängt am Spieler selbst.","replies":[]}]}