{"poster":"ElBarriñeiro","date":"2018-02-07T08:25:36.864+0000","title":"horario de league of legends LAS","subforum":"Problemas Técnicos","up_votes":4,"down_votes":1,"body":"quisiera saber cual es el horario que utiliza LoL en el servidor de LAS ya que la mayoria de las veces que se pone en mantemiento el servidor no se a que hora terminará y tengo mucha curiosidad por eso. Si alguien sabe cual es la diferencia de horario entre el servidor y Chile (Santiago) porfavor que e lo diga estaria muy agradecido\r\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"ESTOYANOINSPIRA","date":"2020-01-02T13:04:38.320+0000","up_votes":1,"down_votes":0,"body":"parese que nadie save los horarios... {{sticker:zombie-brand-clap}}","replies":[]},{"poster":"Ufaaaaaaaaaa","date":"2018-02-07T08:40:13.041+0000","up_votes":1,"down_votes":0,"body":"No se entiende demasiado lo que preguntas. El servidor está en santiago de chile y como tal, tiene esa hora. Los mantenimientos no son tan frecuentes (veo que eres nuevo) pasa que en estos dias hubo 2 mantenimientos casi pegados. Para saber cuando hay, puedes ver en este mismo sitio o en el cliente de juego, en la parte superior un ciculo con un \"!\", haciendo click ahí puedes información respecto a mantenimientos o cosas que funcionan mal (también puedes ver [ésta pagina](http://status.leagueoflegends.com/#las), también en el foro puedes ver posts [como éste](https://boards.las.leagueoflegends.com/es/c/charlas-generales/da03NVKA-actualizando-a-parche-83-madrugada-de-07feb2018-390mb) que se encuentran a la izquierda buscando en el \"Red Tracker\". El mantenimiento se espera que dure hasta las 8AM, aunque a veces puede pasar que vuelva antes.","replies":[{"poster":"LightDagger","date":"2018-02-07T08:57:47.589+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ufaaaaaaaaaa,realm=LAS,application-id=X54mVVp0,discussion-id=AhmzN8Ym,comment-id=0000,timestamp=2018-02-07T08:40:13.041+0000)\n>\nPara saber cuando hay, puedes ver en este mismo sitio o en el cliente de juego, en la parte superior un ciculo con un &quot;!&quot;, haciendo click ahí puedes información respecto a mantenimientos o cosas que funcionan mal\n\nQue se encuentra al lado de \"JUGAR\" {{sticker:sg-ahri-2}}","replies":[]}]}]}