{"poster":"Marlboro Silver","date":"2017-11-13T16:39:01.813+0000","title":"Ayuda con FPS","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Hola, bueno, resulta que hace unos 2 a&ntilde;os tengo mi notebook y al jugar lol tenia entre 180-200 fps, y con el cambio de launcher me baj&oacute; considerablemente a unos 80 fps, e intent&eacute; con lo del cliente cerrado mientras juego y nada, y ahora hace una semana no me sube de 60, les adjuntar&eacute; una imagen de mis especificaciones.\nTengo una A10, una R7 M260 2GB y una 7620G 768MB\nPd: AMD no me pemite actualizar el controlador.\n\nhttps://imgur.com/a/mdfj0","replies":[{"poster":"Ingratitud","date":"2017-11-13T17:17:34.527+0000","up_votes":2,"down_votes":0,"body":"Hola Marlboro Silver, como estas? Pueden ser muchas cosas, lo que lleva a una caída de FPS. \n\nEjemplo: yo tenia un problema igual de caída a 20 - 40 FPS  en mi notebook, eso que llevo 2 años jugando con ella al LOL, al inicio tenia los FPS en 120.\nYo recurrí a Soporte al Jugador, en mi caso sucedió que  tenia claros problemas de pérdida de paquetes, era normal que yo tuviera ese tipo de problemas de FPS, puesto que mi procesador no cumple con los requisitos mínimos del juego (~~El procesador mínimo requerido es de 2 GHz y el mio es de 1.7 GHz~~). Anteriormente me funcionaba bien el juego pero debido que el juego está constantemente creciendo, mi procesador no podía funcional también con el juego. \n\nAun así el agente de soporte, me ayudo a optimizar mi PC, para poder ejecutar mejor el LOL y aumentar mis FPS durante el juego.\n\n* Me recomendaron bajar los gráficos del juego al mínimo (~~Se que suena obvio pero vale aclarar~~)\n* Luego que Realizara un arranque limpio ya que debido a que tenia  varios procesos ejecutándose que podrían causar problemas, bajar el rendimiento de mi notebook.\n* También que ajustara las definiciones de mi antivirus y spyware para no tener problemas durante la ejecución del juego.\n\nPor eso Marlboro Silver, mi recomendación es que te comuniques con soporte técnico. Ellos pueden ayudarte con tu problema de bajos FPS de LOL. Actualmente tengo 60 - 80 FPS, durante el juego, después de la ayuda de soporte.\n\nHay dos formas de comunicarte con soporte:\n\n1. Puedes Chatea en vivo con Soporte del LOL, están  las 24 horas disponibles todos los días de la semana para problemas técnicos como el tuyo.\nMira el tutorial de Riot Gaby para contactar el chat de soporte. [Más info](http://las.leagueoflegends.com/es/news/game-updates/player-behavior/chatea-en-vivo-con-soporte):\nhttps://www.youtube.com/watch?v=FFQZQXVIgvQ\n\n1. O también puedes escribir un mensaje a soporte técnico a la antigua.\nPuedes mandar tu solicitud por aquí: \nhttps://support.riotgames.com/hc/es-419/requests/new\n\n{{sticker:slayer-jinx-catface}} \n\nEspero que puedas solucionar tu problema Marlboro Silver.","replies":[{"poster":"GodotAR","date":"2017-11-13T21:37:34.580+0000","up_votes":2,"down_votes":0,"body":"che pero si a un 90% del mundo que juega lol le paso que desde el nuevo parche tiene perdida de fps desde el nuevo parche no creo que sea un detalle exento a la actualizacion en si misma .","replies":[]}]},{"poster":"heroinfather","date":"2017-11-13T17:14:32.265+0000","up_votes":1,"down_votes":0,"body":"Pq nadie lee el foro","replies":[]}]}