{"poster":"Vanessa VanCleef","date":"2017-07-17T17:04:03.257+0000","title":"¿tiene algun castigo usar el barbalol?","subforum":"Charlas Generales","up_votes":3,"down_votes":5,"body":" queria saber si el barba lol era sancionable,prefiero saber  antes de usarlo y no ser baneada","replies":[{"poster":"ref","date":"2017-07-17T17:41:11.030+0000","up_votes":2,"down_votes":0,"body":"Si escuchar su voz te parece un castigo entonces si.","replies":[]},{"poster":"ILovePoniess","date":"2017-07-17T17:42:20.943+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Vanessa VanCleef","date":"2017-07-17T18:10:05.696+0000","up_votes":1,"down_votes":1,"body":"denunciado,despedite de tu mensaje lince","replies":[{"poster":"Janchu19","date":"2017-07-17T18:28:24.133+0000","up_votes":1,"down_votes":0,"body":"jajajaj lince logan?","replies":[]}]}]},{"poster":"Hnk Kenshiro","date":"2017-07-17T17:14:48.409+0000","up_votes":1,"down_votes":0,"body":"No lo están \"Persiguiendo\" pero claro te pueden banear por ello sin ninguna duda.","replies":[{"poster":"Lord Maxlum","date":"2017-07-17T17:15:26.991+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Hnk Kenshiro","date":"2017-07-17T17:19:33.898+0000","up_votes":1,"down_votes":0,"body":"Me gustaba mucho wooxy, pero no era divertido tener skin y que los demás no se sintieran pobres :(","replies":[{"poster":"Mioen","date":"2017-07-17T18:18:54.350+0000","up_votes":1,"down_votes":0,"body":"Compañerismo OP.","replies":[]}]}]}]},{"poster":"Da Tauren","date":"2017-07-17T18:09:32.070+0000","up_votes":1,"down_votes":0,"body":"Quoteo respuesta del rioter amante de la cerveza de raiz.\n\nEnlace original: https://boards.las.leagueoflegends.com/es/c/charlas-generales/3RF8F3sW-preguntas-frecuentes-sobre-baneos-recientes?comment=0000\n\nSi me lo preguntas, no arriesgaria mi cuenta por ningun motivo.\n\n\n> \n> \n> 1) ¿Qué programas de terceros hay permitidos?\n> \n> El contestar esta pregunta requiere saber exactamente qué hace cada programa existente, incluyendo futuras versiones, y sus efectos en el LoL. Entenderás que esto es imposible, por lo que no tendrás una lista definitiva de programas “permitidos”.\n> Para poder decidir qué puedes y no puedes hacer con el LoL necesariamente tienes que entender exactamente qué hace cada programa que quieres usar y entender los términos de uso del LoL, y el riesgo lo asumes individualmente. En caso de dudas o incertidumbre, la respuesta por defecto es “ninguno”.\n> \n> Lo que sí te podemos decir es que programas que no te den una ventaja ni cambien la experiencia en juego para ti, y especialmente otros jugadores, en general no los estamos castigando, sin embargo no están exentos de riesgo pues es posible tener problemas técnicos con ellos como desconexiones de partidas, lag, bugsplat y cualquier otro tipo de incidencia, por lo que de estar en esta situación lo primero que debes hacer es desinstalarlos para ver si así desaparece el problema.\n> \n> Recuerda que eres responsable de todos los problemas derivados de violaciones de los términos de uso, aunque sean leves y conozcas muchas personas que hagan lo mismo sin problema.\n> \n> 2) ¿Puedo haber sido suspendido erróneamente?\n> \n> No se conocen casos de baneo erróneo por este motivo. Solo se ejecuta la suspensión después de varios niveles de verificación y, si bien cada región tiene bastante autonomía, la detección y castigo de trampas es realizada centralmente por los equipos de seguridad.\n> \n> Los programas habituales de un PC (como navegadores, antivirus, reproductores de música, etc.) no pueden ser tomados como uso de scripts erróneamente. Eventos improbables del juego, como esquivar o asestar habilidades de manera intencional o de manera involuntaria (por ejemplo, con Blitz tiro una Q a un arbusto sin visión y agarro a un Teemo) no pueden provocar un falso positivo de uso de scripts en el sistema.\n> \n> Los algoritmos de reconocimiento de scripts son muy complejos y están evolucionando a diario para adaptarse a la propia evolución de los scripts, por lo que no puedo darte detalles sobre cómo funcionan exactamente por motivos de seguridad (además que en soporte no tenemos acceso al detalle de los mismos).\n> \n> 3) Yo no he usado ningún programa de terceros.\n> \n> Me temo que nuestra verificación nos confirma el uso de scripts en tu cuenta. Si estás seguro de no haber sido tú mismo, entonces debes tener en cuenta las siguientes posibilidades:\n> \n> Has descargado un programa que interfiere con el LoL pensando que hacía una cosa permitida y dicho programa hacía también algo no permitido (seas consciente o no de ello, hayas hecho uso o no de ello).\n> \n> Has compartido o prestado tu cuenta y el otro jugador usó los programas no autorizados sin tu consentimiento o permiso.\n> \n> Alguien ha obtenido tu contraseña y sin tu consentimiento entrado a tu cuenta y hecho uso de estos programas.\n> \n> En todos estos casos la cuenta ha jugado con ventaja y consideramos justificada la suspensión. Ten en cuenta además que compartir la cuenta está en contra de los términos de uso para evitar situaciones como esta que son desagradables tanto para los jugadores como para nosotros. También es tu responsabilidad mantener tu nombre de cuenta y contraseña confidenciales y protegidas de otras personas. No diferenciaremos entre alguien al que le pasas tu contraseña voluntariamente y alguien que dices te “robó” la contraseña de alguna forma mal intencionada.\n> \n> 4) ¿Puedes darme más detalles o pruebas de que he usado scripts?\n> \n> Lamentablemente por motivos de seguridad no entregamos este tipo de información a los jugadores para evitar la ingeniería inversa y que los hackers encuentren nuevas formas de explotar el sistema con facilidad.\n> \n> 5) Ha sido un hacker.\n> \n> Como dueño de la cuenta eres el único responsable de las acciones realizadas con la misma. Esto mismo lo puedes leer en nuestros términos de uso que has aceptado al crear la cuenta.\n> Puedes ver los términos de uso aquí:\n> \n> http://las.leagueoflegends.com/es/legal/termsofuse\n> \n> 6) Ha sido un amigo sin mi autorización.\n> \n> Desafortunadamente, compartir datos de acceso de cuenta, intencional o accidentalmente, es contra nuestros términos de uso, por lo que no puedo ayudarte con este problema dadas las circunstancias. Si te diriges a nuestros términos de uso, podrás leer lo siguiente:\n> \n> Términos de Servicio de League of Legends:\n> \n> http://las.leagueoflegends.com/es/legal/termsofuse\n> \n> Lo siento por cualquier inconveniente, pero los problemas relacionados con la seguridad de la cuenta es algo que tomamos muy en serio, y con lo que se necesita ser extremadamente precavido.\n> \n> 7) ¿Puedo ser suspendido por jugar en un ciber/ordenador que tenga esos programas instalados aunque no los use?\n> \n> Sí, pero es difícil. Cuando tienes un cliente de LoL con una trampa instalada es bastante evidente y activarla requiere conocimiento e intención, además un ciber afectaría cientos de jugadores, no tenemos precedente de algo así.\n> Dicho eso, si sospechas que un ciber tiene instalado programas prohibidos nos puedes avisar mediante soporte.\n> \n> 8) Solo utilizo el MKLoL y he sido suspendido permanentemente.\n> \n> No hemos aplicado suspensiones permanentes por MKLoL, si has sido suspendido permanentemente definitivamente se trata de otro programa bastante más “tramposo”.\n> \n> 9) ¿Por qué son tan severos con la sanción? ¿Por qué no hay avisos?\n> \n> Hay programas que gatillan advertencias primero (como el MKLoL) mientras que otros baneos temporales o permanentes en la primera detección, dependiendo de la gravedad de la ventaja o vulneración que hace.\n> \n> Si es un script para auto-dodge, bot o un hack de la espada del rey arruinado (son algunos ejemplos, pero hay otros), el ban es inmediato e irreversible, pues esos programas solo pueden ser utilizados intencionadamente y para obtener una ventaja injusta. No necesitas un aviso que esto es una falta grave.\n> \n> -Excalibeer","replies":[]},{"poster":"Mioen","date":"2017-07-17T18:08:02.124+0000","up_votes":1,"down_votes":0,"body":"https://youtu.be/JauXaK3_v5I?t=59\n\nCito:\n>Muchos me van a preguntar solamente, ¿Barbakhan es legal?\n-Claro que es ilegal.\n\nXD Saludos","replies":[]},{"poster":"Salvor","date":"2017-07-17T17:58:20.182+0000","up_votes":1,"down_votes":0,"body":"Y pa que quieres usar eso? jaja salu2\n\nFuera de broma, yo personalmente no arriesgaría mi cuenta por nada, no creo que un rioter venga a darte respuesta, no especifican sobre tal y cual programa, si el sistema lo detecta fuiste.\nVale la pena el riesgo? para mi no.","replies":[]},{"poster":"Vanessa VanCleef","date":"2017-07-17T17:44:20.160+0000","up_votes":1,"down_votes":0,"body":"mi hermano me dice que no instale nada hasta que un rioter no me diga que no hay problema ¿ustedes que dicen?\npd:dudo que me conteste un rioter","replies":[]},{"poster":"Murzy","date":"2017-07-17T17:32:46.888+0000","up_votes":1,"down_votes":0,"body":"Excelente!! la verdad no modifica tu forma de juego ni te da ventaja contra tus enemigos, yo no veo por que no instalarlo... \n\nSaludos.-","replies":[]},{"poster":"Vanessa VanCleef","date":"2017-07-17T17:11:49.081+0000","up_votes":1,"down_votes":1,"body":"lo que hace el programa es modificar la voz del narrador por la voz del youtuber barbakahn y con narrador me refiero al que dice:bienvenidos a la grieta del invocador,te han matado etc","replies":[{"poster":"rokushoger","date":"2017-07-17T17:23:15.327+0000","up_votes":1,"down_votes":0,"body":"Como dije, es bajo tu propio riesgo usarlo. Si estás segura que solo hace eso, y que además en el futuro no le van a agregar ninguna función prohibida, entonces probablemente no te baneen, pero el riesgo siempre está.","replies":[]}]},{"poster":"Hwaxinghz","date":"2017-07-17T17:17:21.116+0000","up_votes":1,"down_votes":0,"body":"Yo no usaría programas de terceros.\n\nSegún las políticas de Riot, todos los programas de terceros son ilegales.","replies":[]},{"poster":"rokushoger","date":"2017-07-17T17:08:19.088+0000","up_votes":1,"down_votes":0,"body":"Como todo programa de terceros, lo que te debo contestar es \"úsalo bajo tu propio riesgo\".\nNingún programa de terceros que modifique el cliente es legal (no se si este lo hace o no), de hecho, lo dice en los términos de servicio que aceptaste al crear tu cuenta.\nNo obstante Riot no está baneando por modificaciones que sean meramente estéticas y/o no te den alguna ventaja competitiva (de nuevo, desconozco que hace ese programa).\nEl tema radica es que quiza el día de mañana ese programa incluya funciones no permitidas, o las tiene ahora sin que tu lo sepas, y si te cae un ban por eso, no puedes reclamar (ba, poder podés, pero no vas a lograr nada).\n\nSaludos!","replies":[]},{"poster":"Vanessa VanCleef","date":"2017-07-17T17:32:49.590+0000","up_votes":1,"down_votes":2,"body":"si,el barba solo le modifico su voz y dijo que esa era la version final y que no hiba a hacer nada mas","replies":[]}]}