{"poster":"MatichØ","date":"2015-12-22T16:06:40.551+0000","title":"Meta Actual","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"Sinceramente estoy en un dilema... el juego hasta ahora solo me hab&iacute;a dado asco por la comunidad, los flamers y AFKs . Son cosas que a la larga uno deja pasar ya que no corresponden al juego mismo, pero hoy me acabo de dar cuenta que al actual Meta es una real basura. Como es posible que las partidas no duren mas de 25 minutos que todo el que se lleve una kill stompee las partidas hasta el surrender del rival... simplemente hay un des balance total en muchos aspectos de cada partida. Espero que solo sea la pre temporada, de no ser as&iacute; no creo que juegue al lol este a&ntilde;o... \r\n\r\nQue les parece el actual meta?\r\n\r\n{{champion:111}} {{champion:62}} {{champion:5}}","replies":[{"poster":"Support Sempai","date":"2015-12-22T16:20:28.154+0000","up_votes":3,"down_votes":0,"body":"El año pasado muchos se quejaban de lo mucho que duraban las partidas , ahora se quejan de que duran muy poco. Quien los entiende :v","replies":[{"poster":"Are You Oky","date":"2015-12-22T16:26:00.410+0000","up_votes":1,"down_votes":0,"body":"son mas indesisivos nadie los puede entender","replies":[{"poster":"ZeNch","date":"2015-12-22T16:28:39.864+0000","up_votes":1,"down_votes":0,"body":"como la gata flora que cuando se la ponen grita y cuando se la sacan llora","replies":[{"poster":"Adheliøs","date":"2015-12-22T17:31:54.944+0000","up_votes":2,"down_votes":0,"body":"{{champion:114}} {{item:3073}}","replies":[]}]}]}]},{"poster":"Phantom Blak","date":"2015-12-22T16:21:17.145+0000","up_votes":2,"down_votes":1,"body":"el meta actual esta bien, ya aburria despues de 3 años jugando partidas de mas de 40 minutos","replies":[]},{"poster":"Ks Erwyn","date":"2015-12-22T21:21:02.895+0000","up_votes":1,"down_votes":0,"body":"No me gusta del todo el meta, creia aun amas protagonismo de los ADC, peor comparado al fustrante meta tanke, es mil veces mejor, ahora todos pegan mas.","replies":[]},{"poster":"Main Troll","date":"2015-12-22T17:03:54.960+0000","up_votes":1,"down_votes":0,"body":"lo q esta mal son los jugadores actuales, no el meta... los matan 2 o 3 veces y tiran la tipica \"gg surrender a los 20\"... cero ganas d jugar, d aprender, d pasar un rato jugando... solo quieren ganar saliendo 20/0 y la cosa no es asi","replies":[]},{"poster":"Ryuushin","date":"2015-12-22T16:52:14.472+0000","up_votes":1,"down_votes":0,"body":"si a vos te gusta que las TF's duren 2 minutos porque hay 4 tanques en cada lado y no tengan la fuerza para derribar torretas asunto tuyo, además las partidas terminan a los 20 mins por gente que tiene la re poca voluntad de ganar y se rinde fácilmente, las partidas pueden seguir durando 40 o 50 mins, pero si te rendis, obvio que no","replies":[]},{"poster":"ZeNch","date":"2015-12-22T16:20:28.352+0000","up_votes":1,"down_votes":0,"body":"es pretemporada, patience","replies":[]}]}