{"poster":"Gunbreaker","date":"2017-05-17T21:51:16.931+0000","title":"COSMIC RUINS ICON Not Unlocking","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So I've definitely done at least 5 or so games of the Dark Star gamemode, equalling to around 60 or so kills per all games. I haven't gotten the icon for getting 33 kills. @ Riot employees help me out here","replies":[{"poster":"Leviãthan","date":"2017-05-17T22:26:00.157+0000","up_votes":1,"down_votes":0,"body":"me too i got more than 40 kills in dark star mode still no icon :')","replies":[{"poster":"Porocles","date":"2017-05-17T22:32:50.851+0000","up_votes":3,"down_votes":0,"body":"So it looks like we're still distributing all the Dark Star icons, which is why some players may not see them yet.  My bad!  Give us until the 29th to roll them all out to everyone, per the [Dark Star page](http://na.leagueoflegends.com/en/page/learn-more-about-dark-star-2017).  Hang tight!","replies":[{"poster":"Flemman","date":"2017-05-18T06:09:24.108+0000","up_votes":1,"down_votes":0,"body":"can't wait to the mission assets to go live, time to enjoy event achievement icon during those event :D","replies":[]}]}]},{"poster":"Porocles","date":"2017-05-17T22:15:13.341+0000","up_votes":2,"down_votes":0,"body":"I looked through your Dark Star matches and was able to determine that you met the requirements.  I've added the icon to your account.  Grats!  :D\n\n-- It actually looks like we're still rolling these icons out.  Some players may see them before others, but we're not done giving out these goodies.  Per the [Dark star page](http://na.leagueoflegends.com/en/page/learn-more-about-dark-star-2017), give us until 5/29/17 11:59 PM PT to roll them out to everyone.  Thanks!","replies":[{"poster":"Gunbreaker","date":"2017-05-18T18:40:27.160+0000","up_votes":1,"down_votes":0,"body":"Yeah, I read that it was the 29th after posting. Just kinda concerned as I unlocked the Corruption Icon, yet I did the 33 kills before I actually did the premade game with friends.\n\nThanks for unlocking it anyways though, know the ones I was premade with haven't gotten theirs just yet either.\n\n{{sticker:slayer-jinx-catface}}","replies":[]}]}]}