{"poster":"Sakox","date":"2016-09-13T10:59:40.772+0000","title":"Domande per chi gioca supp","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Ciao a tutti ho delle domande per supp da farvi, io gioco principalmente supp e mi e sorto un dubbio, 1 quali sono i calzari che dovrebbe usare un supp i mobility o i swiftness? (io uso i secondi principalemente)  2 per supp tank e  meglio usare face of the Mountain, talisman of ascesion oppure eye of the equinox? (ultimamenye usavo eye)  Grazie in anticipo","replies":[{"poster":"Kim114","date":"2016-09-13T11:33:55.753+0000","up_votes":1,"down_votes":4,"body":"per un tank io faccio{{item:3401}} {{item:2045}} {{item:3009}} {{item:3341}} \npoi finisco la build, con tank vari \nse la partita dura molto, solo team fight, vendo {{item:2045}} per {{item:3190}}","replies":[{"poster":"Campanello","date":"2016-09-13T11:41:01.955+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Kim114,realm=EUW,application-id=MJVj50Jw,discussion-id=AE4tAEyA,comment-id=0000,timestamp=2016-09-13T11:33:55.753+0000)\n>\n> per un tank devi farti {{item:3401}} {{item:2045}} {{item:3009}} {{item:3341}} \n> poi finisci la build, con tank vari \n> se la partita dura molto, solo team fight, vendi {{item:2045}} per {{item:3190}}\n\nwut? Allora parto dicendo che non c'è un oggetto che va bene sempre. Quando gli avversari hanno molti slow sono meglio le swiftness, quando invece non hanno troppi slow oppure si vuole roammare molto si fanno le mobility. \nPer un tank support si fa il{{item:3401}} contro gli assassin per dare protezione ai carry, {{item:2303}} questo si fa quando i carry non hanno bisogno di uno scudo e infine il {{item:3069}} si fa se si è un po indietro e si vuole dare mobilita al team, oppure in comp particolari con champion come kennen o malphite da ingaggi pesanti","replies":[]},{"poster":"Zedant","date":"2016-09-13T15:44:10.656+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-unamused}}","replies":[]}]},{"poster":"NicogenFTW","date":"2016-09-13T12:48:13.801+0000","up_votes":1,"down_votes":0,"body":"Scusa se non posto le immagini di riferimento, sono da cellulare.\n\nDa quando hanno fatto i cambiamenti nella season 6 con la sightstone a sole 3 cariche ho iniziato a completare quasi sempre l'item che da le stats più 4 cariche (eye of equinox e corrispettivi blu e giallo).\nLa scorsa season invece upgradavo quasi sempre il tier 3 dell'item da support per l'attiva.\nI mobi boots onestamente non mi sono  mai piaciuti, sebbene posso capire che su alcuni supp che roammano molto potrebbero essere buoni.\nCiononostante tendo sempre a fare swift oppure lucidity (soprattutto per il 15% summ spells cd reduction).\nA volte se devo essere il beefy frontliner e sono avanti (se ad esempio sto usando nauti e sono fed) faccio a seconda se il team sia pesantemente ap o ad, i mercs o i ninja :)","replies":[]},{"poster":"Thao","date":"2016-09-13T12:34:42.713+0000","up_votes":1,"down_votes":2,"body":"fai schifo e punto xD\nluv u <3","replies":[{"poster":"Sakox","date":"2016-09-13T16:55:07.115+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Thao,realm=EUW,application-id=MJVj50Jw,discussion-id=AE4tAEyA,comment-id=0001,timestamp=2016-09-13T12:34:42.713+0000)\n>\n> fai schifo e punto xD\n> luv u &lt;3\n\nmerdaccia xD","replies":[]}]}]}