{"poster":"Canastus","date":"2015-09-19T18:04:45.966+0000","title":"I realize that 5.18 is the Worlds patch, but could you please look into Cassie for 5.19?","subforum":"Gameplay","up_votes":85,"down_votes":27,"body":"http://i.imgur.com/dDrPvT3.jpg\n\n**I&#039;m not asking for revolutionary changes** since you&#039;re currently busy enough with handling the huge mess which the Juggernaut project left behind. But it&#039;s been over half a year now since you actually did anything for this champion (that includes her nerfs aswell) despite promises of resuming your work on her someday. \n\nNow please don&#039;t tell me you&#039;re simply going to forget about that just because the guy who made this promise did abandon the rework later to do work on Fiora. **Don&#039;t you see the massive breach in trust between her playerbase and those who seek to maintain it?** You aren&#039;t exactly acknowledging her existence, too,  you know (new Cass skin when?).\n\nLook, I&#039;m not asking you to revamp the rework right now (after all we still want our POISON-mage back for season 6) - all I&#039;m asking for is a more viable Cass who actually stands a chance in this hell of a meta. \n\n**Would it be too much to ask for a revert on some of those older nerfs** which affected her mana-costs and/or sustain? Or maybe consider changes ala Lee Sin more recently to create a champion who is a lot **more accessible and more forgiving to play as** while keeping a high skill-ceiling? I&#039;d love to see your take on that.\n\nPlease give it a thought. {{champion:69}}","replies":[{"poster":"TurquoiseYoshi","date":"2015-09-19T18:25:11.744+0000","up_votes":5,"down_votes":24,"body":"Honestly, all she needs is to make her Q easier to hit. Because she's actually in a decent spot if you are able to start spamming her E.","replies":[{"poster":"Academy Kayn","date":"2015-09-19T18:44:22.928+0000","up_votes":27,"down_votes":0,"body":"Her Q is already pretty easy to hit. As long as you have a sense of leading, it's not that hard to land.","replies":[{"poster":"TurquoiseYoshi","date":"2015-09-19T19:38:02.395+0000","up_votes":3,"down_votes":5,"body":"Well then there isn't that much to do for her. As long as you understand that you have to go Poison -> Twin Fang -> Twin Fang -> Twin Fang, she isn't that bad.","replies":[{"poster":"HadesBlades","date":"2015-09-20T13:49:21.861+0000","up_votes":4,"down_votes":0,"body":"Except her mana pool is so bad early doing that would make you waste half if not 3/4 of your mana pool. Not only that but she actually has to walk up to you to get into E range, leaving her open to ganks. Cassio was meant to be, and I wish they would make her, a DPS mage that focuses more on poison rather her E machine gun. :P My two cents.","replies":[]}]}]},{"poster":"Bouncemaster Zac","date":"2015-09-19T19:46:40.028+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=TurquoiseYoshi,realm=NA,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=0002,timestamp=2015-09-19T18:25:11.744+0000)\n>\n> Honestly, all she needs is to make her Q easier to hit. Because she's actually in a decent spot if you are able to start spamming her E.\n\nHer Q is already easy to hit considering it can spawn directly under the target and has minimal wind-up. And if she lands just one, she can 100-0 people at level 2 by just hammering her E key until it breaks. She's not weak.","replies":[{"poster":"TurquoiseYoshi","date":"2015-09-19T20:16:28.803+0000","up_votes":3,"down_votes":2,"body":"I agree that she isn't weak. She maybe just needs a little tweak to make it easier to start spamming that E. I always like to compare her to ADCs, as those are who she is most like. ADCs don't need much setup to start spamming AAs, so she shouldn't need as much setup to start spamming Fangs.","replies":[{"poster":"Bouncemaster Zac","date":"2015-09-19T20:17:39.445+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=TurquoiseYoshi,realm=NA,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=000200010000,timestamp=2015-09-19T20:16:28.803+0000)\n>\n> I agree that she isn't weak. She maybe just needs a little tweak to make it easier to start spamming that E. I always like to compare her to ADCs, as those are who she is most like. ADCs don't need much setup to start spamming AAs, so she shouldn't need as much setup to start spamming Fangs.\n\nExcept her Es are far more impactful than an ADCs autos at every stage of the game, so yes, they should be harder to set up.","replies":[{"poster":"TurquoiseYoshi","date":"2015-09-19T20:19:34.354+0000","up_votes":6,"down_votes":1,"body":"The poison also wears off, and her E doesn't crit. \n\nYour turn.","replies":[{"poster":"Bouncemaster Zac","date":"2015-09-19T20:25:09.625+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=TurquoiseYoshi,realm=NA,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=00020001000000000000,timestamp=2015-09-19T20:19:34.354+0000)\n>\n> The poison also wears off, and her E doesn't crit. \n> \n> Your turn.\n\nScoring the poison deals damage, gives her a burst of movespeed, and gives her 3 seconds during which her e has no cooldown. At level 2, if Cass lands her Q, for the next three seconds she becomes the AP equivalent of an ADC with a Pickaxe and max attack speed. _Level 2._ The only thing that prevents it from being completely broken (the way it used to be) is that it will run her completely out of mana. Of course being oom doesn't mean much when she just got a free kill against any lane opponent with no defensive abilities, and if they _do_ have defensive abilities she just forced them to back. Except {{champion:3}} . She loses _really_ hard to {{champion:3}} .\nEDIT: Also, the poison _doesn't_ wear off if she alternates her Q and W.","replies":[{"poster":"TurquoiseYoshi","date":"2015-09-19T20:55:51.718+0000","up_votes":3,"down_votes":1,"body":"At level 2, it's very easy for her lane opponent to just leave if Cassio wants to fight.","replies":[{"poster":"Bouncemaster Zac","date":"2015-09-19T21:02:55.808+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=TurquoiseYoshi,realm=NA,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=0002000100000000000000000000,timestamp=2015-09-19T20:55:51.718+0000)\n>\n> At level 2, it's very easy for her lane opponent to just leave if Cassio wants to fight.\n\nExcept it isn't, due to that 30% speed boost. If they're as immobile as she is, and a lot of mages are, she'll catch them.","replies":[{"poster":"The Queen Viper","date":"2015-09-19T21:52:53.254+0000","up_votes":4,"down_votes":1,"body":"It's 20% ... and you need to hit your Q first.","replies":[{"poster":"Bouncemaster Zac","date":"2015-09-19T21:55:41.941+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=Snąke on bush,realm=EUW,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=000200010000000000000000000000000000,timestamp=2015-09-19T21:52:53.254+0000)\n>\n> It's 20% ... and you need to hit your Q first.\n\n30%. And landing the Q isn't hard. It spawns directly under the target with no cast time and a minimal visual windup before detonating. Landing Cassie's Q isn't any more difficult than landing Karthus's Q.","replies":[{"poster":"The Queen Viper","date":"2015-09-19T22:02:54.353+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Tekkaras,realm=NA,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=0002000100000000000000000000000000000000,timestamp=2015-09-19T21:55:41.941+0000)\n>\n> 30%. \n\nThe movement speed bonus from Q is 20%.\n\nhttp://leagueoflegends.wikia.com/wiki/Cassiopeia\n\n\n\n> [{quoted}](name=Tekkaras,realm=NA,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=0002000100000000000000000000000000000000,timestamp=2015-09-19T21:55:41.941+0000)\n>\n> And landing the Q isn't hard. It spawns directly under the target with no cast time and a minimal visual windup before detonating. Landing Cassie's Q isn't any more difficult than landing Karthus's Q.\n\nMaybe, however the mid lane is short as it is ... so it's not hard to back away so that Cass can't reach you.","replies":[{"poster":"Bouncemaster Zac","date":"2015-09-19T22:06:06.387+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=Snąke on bush,realm=EUW,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=00020001000000000000000000000000000000000000,timestamp=2015-09-19T22:02:54.353+0000)\n>\n> The movement speed bonus from Q is 20%.\n> \n> http://leagueoflegends.wikia.com/wiki/Cassiopeia\n> \n> Maybe, however the mid lane is short as it is ... so it's not hard to back away so that Cass can't reach you.\n\nSo you have to vacate your lane and lose cs to prevent getting instagibbed at level 2.","replies":[{"poster":"Rundus1","date":"2015-09-20T21:51:49.271+0000","up_votes":2,"down_votes":0,"body":"Btw, the only people really threatened by Cass early are immobile melees and stupid immobile people.  Anyone with a dash (most people nowadays) are fine.  Mages have so much range that if she walks close enough to get them with q she not only takes minion aggro, but is extremely susceptible to ganks and is basically giving them a free shot for any and all abilities.  Xerath?  eqw.  Azir?  She shouldn't even try it.  Ziggs?  eqw auto.  Against them she has to play safe and try to q when she can for poke, because going in like you suggest will get her killed or severely out-traded by the immobile people.  She almost fairs better early against mobile people, because if she can get her q off and one e before they dash away, she's won the trade.  And don't even get me started on how she fairs level 2-3 vs early gank junglers like Shaco or Gragas if she ever tries that q-e-e-e on a backliner mage.  If she moves into the middle for just a second or two she'll probably need to flash if Shaco's there, and Gragas might just kill her before she can with his body slam stun buying them a second to mong her.  Her early game is nothing special.","replies":[]},{"poster":"Abyssphere","date":"2015-09-20T17:44:50.445+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Tekkaras,realm=NA,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=000200010000000000000000000000000000000000000000,timestamp=2015-09-19T22:06:06.387+0000)\n>\n> So you have to vacate your lane and lose cs to prevent getting instagibbed at level 2.\n\nThe poison lasts 3 seconds. It's not hard to back off a bit for that long.","replies":[{"poster":"Bouncemaster Zac","date":"2015-09-20T18:43:12.145+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=MotherTeresa1910,realm=NA,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=0002000100000000000000000000000000000000000000000001,timestamp=2015-09-20T17:44:50.445+0000)\n>\n> The poison lasts 3 seconds. It's not hard to back off a bit for that long.\n\nYou're missing the point. She can just sit up on the wave and threaten you with her Q. If you get close to farm, she Q-EEEEEEEEEEEs you. She's one of the champs who can bully a lane just by standing in it.","replies":[]}]},{"poster":"TenSlashTen","date":"2015-09-20T05:31:57.515+0000","up_votes":6,"down_votes":4,"body":"WHo the fuck dies to cass level 2 anymore?\nher base stats were fucking gutted AND her scalings.\n\nLOL\n\nShe could use all her amna and you'd still be above 20% assuming yuo even know how to chug a single potion.\n\nHer early game was shit on by riot completely.\n\n\n","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"1 800 MID LANE","date":"2015-09-19T23:58:26.205+0000","up_votes":18,"down_votes":0,"body":"The reason she's \"weak\" is because she's so ridiculously unforgiving. She doesn't have a huge skillcap overall, in my opinion, outside of the fact that if you accidentally miss your E and hit an un-poisoned target, you're useless. That's what makes her \"hard.\"\n\nA lot of why people hate playing her is that all she seems to be good for is an E key stress test. She doesn't bring much to the table that some other midlaner doesn't already, and that other one is probably better for it.\n\nEDIT: Rework, please.","replies":[{"poster":"Rundus1","date":"2015-09-20T21:56:06.309+0000","up_votes":1,"down_votes":0,"body":"She brings one of the highest DPS to teamfights in the game if she isn't put down early or taken down fast (I believe she's somewhere between 2nd and 5th best DPS lategame (Karthus is up there too if he plays his cards right)).  The problem is that she has little she can do to keep the people who destroy her at bay other than ult, so she becomes depended on flash-ulting or other engage and peel to start teamfights or get people off her.  If she can stay at the edge of a fight and just be Cass, she'll destroy your entire team.  All she has to do is kill the mobile carries and have fun with the rest.  The problem is that that's not easy to accomplish, and getting her to the point where she can do that is no easy feat.","replies":[{"poster":"1 800 MID LANE","date":"2015-09-20T23:24:01.193+0000","up_votes":2,"down_votes":0,"body":"There are a lot of \"ifs\" in that statement that hardly justify not bringing someone else.","replies":[]}]}]},{"poster":"I Main Swain","date":"2015-09-20T03:43:28.227+0000","up_votes":8,"down_votes":0,"body":"i like how before you click on the post it just shows a zoom in on cassiopeias boobs","replies":[{"poster":"Canastus","date":"2015-09-20T10:51:06.500+0000","up_votes":4,"down_votes":2,"body":"If only Riot would give us some *fanservice* once in a while like they always do for Ahri. \n\nHow about a new skin?","replies":[{"poster":"yay nibbers","date":"2015-09-21T05:47:40.417+0000","up_votes":2,"down_votes":0,"body":"Finally, someone else who thinks so. It feels like the Boards are overrun with \"muh sexism\" idiots. I like all the cool skins that have been coming, but it would be cool for some good old _League of Boobies_ skins.\n\nOn a related note, Cass definitely needs a new skin","replies":[]}]}]},{"poster":"Sasogwa","date":"2015-09-19T22:12:42.787+0000","up_votes":9,"down_votes":1,"body":"Cass is completely balanced.\n_**However**_, her kit doesn't reflect her identity well. She's not a poison mage, she's a lategame E minigun hypercarry. That's why I think she should get a rework, once again. I mean, she didn't even need a rework back then she was fine :/","replies":[]},{"poster":"Haunt","date":"2015-09-19T22:38:52.142+0000","up_votes":13,"down_votes":6,"body":"Would it be too much for the mana sustain and sustain back? Yes. Yes it would. It made her not have to think about her mana or health (Mainly mana) since she had unlimited supply of it, so long as minions were there. \n\nYou're literally asking for reverts to the nerfs that they gave her because she was too strong. Notice what happened when we reverted Elise's nerfs and made it so her E stuns for a decent amount early game. She went RIGHT back to the top of the ladder.\n\nAnd before you say Elise isn't permabanned right now, it's only because of the 5 recent reworks all being too strong and filling up those ban slots and then someone else for the free ban.\n\nShe's not even close to being bad. But whatever I guess, downvote me and move on to the delusional people that agree with you because they have no idea of what strengths Cass has. Shes rewarded by good positioning and great kiting. Land your shit and you'll do damage, don't spam as much in lane before your team so you don't go oom. Learn to manage your mana and HP.","replies":[{"poster":"sp441","date":"2015-09-20T06:25:40.273+0000","up_votes":5,"down_votes":2,"body":"Don't change the fact that she's a boring version of Urgot.","replies":[]}]},{"poster":"LVL 5 PORO","date":"2015-09-19T23:11:41.431+0000","up_votes":2,"down_votes":7,"body":"I think Cass needs few, if any, changes. She's pretty powerful. She just requires excellent positioning and the ability to survive until late game.","replies":[{"poster":"Oerba No Naja","date":"2015-09-19T23:54:16.514+0000","up_votes":7,"down_votes":0,"body":"ability to survive until late game ? \nyou mean depushing wawes with her no dmgs poison ?","replies":[]}]},{"poster":"CasterGilgamesh","date":"2015-09-19T18:16:24.118+0000","up_votes":9,"down_votes":4,"body":"riot just hates cass at least they dont hate her like {{champion:28}} {{champion:38}} {{champion:37}} {{champion:26}} {{champion:421}} {{champion:29}}","replies":[{"poster":"Angelofchaos16x","date":"2015-09-19T20:35:38.817+0000","up_votes":3,"down_votes":0,"body":"Karma says Hello","replies":[]}]},{"poster":"TenSlashTen","date":"2015-09-20T05:33:34.037+0000","up_votes":5,"down_votes":1,"body":"Rework was a complete joke.\nRevert rework.\nKeep E refreshing sooner on poisoned target.\nproblem solved.","replies":[]},{"poster":"Lapis x3","date":"2015-09-20T15:59:56.029+0000","up_votes":2,"down_votes":1,"body":"There has got to be a reason why Riot keeps ignoring Cass, maybe they're going to do an immobile mage update soon? \n\nI mean, there really aren't many immobile mages to update like Cass, but Syndra, Ryze and possibly Azir/Nidalee could use some help.\n\nBut if Riot just doesn't know what to do with Cass, then that's ridiculous. Reverting some of the nerfs that came along with her rework (*cough* Miasma Damage *cough*) would be a good start...","replies":[{"poster":"ARequestOfDeath","date":"2015-09-20T18:50:21.881+0000","up_votes":3,"down_votes":0,"body":"nidalee immobile?","replies":[]}]},{"poster":"SpecterVonBaren","date":"2015-09-19T21:15:00.426+0000","up_votes":3,"down_votes":0,"body":"Cass will be fine friend, Skarner is going to keep her company.","replies":[{"poster":"Canastus","date":"2015-09-20T14:49:34.973+0000","up_votes":1,"down_votes":0,"body":"Skarner was heavily buffed, though. Can't say the same about Cass.","replies":[{"poster":"SpecterVonBaren","date":"2015-09-20T16:43:11.654+0000","up_votes":3,"down_votes":0,"body":"His gameplay has the exact same problems Cass does. There is nothing about their kits that is inherently special or interesting and neither brings something unique to their team, the only time they're worth considering being picked is when their numbers are so high that they just melt through people.\n\nSkarner was plenty strong before, the rework did not buffs him, it made him generic and dependent on numbers.","replies":[]}]}]},{"poster":"Electric Grandma","date":"2015-09-20T07:32:37.058+0000","up_votes":3,"down_votes":0,"body":"I honestly don't care if she's strong or not. What I cared about when they first announced this god forsaken rework was the fact that they took away her poison-mage identity and made her into a machine gun. I loved her identity as the poison mage. She was amazing at whittling down tanks late game and such. I dunno, I just hate the direction they took her. She's not a snake, she's a E-smashing machine gun :/","replies":[]},{"poster":"Oerba No Naja","date":"2015-09-20T00:03:06.345+0000","up_votes":3,"down_votes":0,"body":"the best buff i can wish for her is to reduce her passive to 400 stack instead of 500 .\nnothing more \nor\na 0.5 ratio on her q and  better base dmg on her w \nthen cassio would be perfectly fine","replies":[]},{"poster":"Snaketits","date":"2015-09-19T21:48:40.453+0000","up_votes":3,"down_votes":0,"body":"Dat thumbnail ( ͡° ͜ʖ ͡°)","replies":[]},{"poster":"General Esdeath ","date":"2015-09-19T18:42:23.220+0000","up_votes":1,"down_votes":0,"body":"Why isn't she played much? I think she's really good.","replies":[{"poster":"High5","date":"2015-09-19T19:39:19.069+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=AngusBoomPants,realm=NA,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=0005,timestamp=2015-09-19T18:42:23.220+0000)\n>\n> Why isn't she played much? I think she's really good.\n\nYeah, as a mid carry, she's really not in a bad place compared to other immobile champions. The issue is more around team comps.  \n\nI look at Cass like I look at Jinx.  Late game carries that can be awesome if your team protects them and wards for them.  If you expect a high damage, immobile champ to fend for themselves, then that's as much a team problem as it is a champion problem.","replies":[]}]},{"poster":"Frostwoman","date":"2015-09-19T18:37:00.434+0000","up_votes":2,"down_votes":7,"body":"I honestly hated Cass when she was broke a couple months back.","replies":[{"poster":"Canastus","date":"2015-09-19T18:40:52.710+0000","up_votes":9,"down_votes":4,"body":"A couple of months? That was over half a year ago.\n\nDo you think it's okay for her to remain forgotten like this whereas every other immobile mage is receiving some form of help right now?","replies":[{"poster":"UltraSceptile","date":"2015-09-20T15:02:28.446+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Canastus,realm=NA,application-id=3ErqAdtq,discussion-id=xX6YAB5X,comment-id=00040000,timestamp=2015-09-19T18:40:52.710+0000)\n>\n> A couple of months? That was over half a year ago.\n> \n> Do you think it's okay for her to remain forgotten like this whereas every other immobile mage is receiving some form of help right now?\n\nThey should just nerf all the broken mages, ie azir and viktor and ahri.","replies":[]}]}]},{"poster":"BigPooStorm","date":"2015-09-20T20:40:10.097+0000","up_votes":1,"down_votes":1,"body":"Yea as someone who plays top lane I'm fine with her not being played at all. If they buff her again she'll once again become an obnoxious lane bully that also hyperscales into the late game. No thanks.","replies":[{"poster":"Leu07","date":"2015-09-21T02:11:39.846+0000","up_votes":2,"down_votes":0,"body":"she is very vulnerable to ganks if she goes top lane though. Early game junglers like {{champion:60}} , {{champion:421}}  and {{champion:5}}  can f*ck her over.","replies":[]}]},{"poster":"OperationDEEZ1","date":"2015-09-20T06:01:33.197+0000","up_votes":2,"down_votes":0,"body":"Every patch the cassio mains ask them to look at cassio\nthey never do","replies":[{"poster":"Canastus","date":"2015-09-20T11:33:12.581+0000","up_votes":3,"down_votes":1,"body":"Doesn't mean I won't give up trying, though. Sooner or later they'll have to listen.\n\nConstantly occupying the frontpage might be the best way to achieve that.","replies":[]}]}]}