{"poster":"Canastus","date":"2014-11-05T13:58:02.301+0000","title":"About Cassiopeia and the recent PBE changes","subforum":"Gameplay","up_votes":90,"down_votes":12,"body":"Since [Stashu's thread](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/zuL472BJ-cassiopeia-plans) has disappeared entirely from the radar, I'll have to bring up my concerns in a different manner. I'd like to address the recent Cass changes on the PBE in this thread in hopes of raising awareness about what's really going on.\n____________\n**EDIT: It turns out they had the audacity to raise the stackcap on her passive from 400 to 500 (!) without even telling us. This is an outrage.**\n\nStashu, I've seen [your changes on the PBE](http://www.surrenderat20.net/2014/11/114-pbe-update.html) and I must say I'm very disappointed. I expected far more from you after all those weeks of waiting, meanwhile Cassiopeia will remain in a very questionable state until season end (still no changes in 4.19). That's almost 3 months of playtime denied by your rework alone so far.\n\nI'll explain to you exactly why your poison-changes are inefficient at raising her viability. My primary issue are her gutted ratios (0.8 -> 0.45) since you didn't fix them with this change. By slapping a multiplicator on them (25% up to 50%) you hardly make them any better, they're still vastly inferior. And why do you insist on nerfing her flat damage? Let me give you a mathetical example of what to expect ingame:\n\n>**starting conditions (in this specific order)**\n40 AP (0.45) / Q rank 1 - 65 damage; 50% total damage increase (max bonus applied)\n____________\n18 dmg (from 40 AP) + 65 dmg = 83 dmg + 50% (41.5 dmg) = **124,5 poison damage**\nQ (45, rank 1) + E (30, rank 1) x2 = **105 mana spent**\n____________\n____________\n**best possible conditions (in this specific order)**\n200 AP (0.45) [most likely amount once Q fully leveled] / Q rank 5 - 225 damage; 50% total damage increase (max bonus applied)\n____________\n90 dmg (from 200 AP) + 225 dmg = 315 dmg + 50% (157,5 dmg) = **472,5 poison damage**\nQ (65, rank 5) + E (35, rank 2 [lowest possible if Q leveled]) x2 = **135 mana spent**\n\nThat's a lot of mana spent on merely poking someone, and that's already an unrealistic scenario considering that **you'll never get the full damage** after applying your Q since **one poison-tick will already be wasted** once your E arrives. With the second E, you'll only get the full 50% bonus on the third poison-tick.\n\n**These numbers cannot be achieved, no matter how good you are.** The reward appears horrendously low compared to what you'd get with pre-rework Cass (and that without even getting into E-range):\n\n>**starting conditions (in this specific order)**\n40 AP (0.8) / Q rank 1 - 75 damage\n____________\n32 dmg (from 40 AP) + 75 dmg = 83 dmg = **107 poison damage**\nQ (35, rank 1) = **35 (!) mana spent**\n____________\n____________\n**best possible conditions (in this specific order)**\n200 AP (0.8) [most likely amount once Q fully leveled] / Q rank 5 - 235 damage\n____________\n160 dmg (from 200 AP) + 235 dmg = **395 poison damage**\nQ (75, rank 5) = **75 (!) mana spent**\n\nNow those are some great solid numbers and they only require you to cast a single ability while keeping your distance, and it's a lot cheaper aswell. Just landing another Q would make your changes pale in comparison, and it'd get EVEN cheaper thanks to her old passive. \n\nOh, and it doesn't require you to mark every single poisoned victim with your E which would only make you waste even more mana and time. Let's face it, it'll take a lot more to make her as good as before, you're just not trying hard enough.\n\nYou need to stop taking something away from her to justify any \"improvements\" - if a champion is underpowered, you should keep adding until they're up to par and NOT remove something they already had before. I fear her laning phase will be even worse after those changes since you took away her sustain in exchange for such an inefficient bonus to her poison-damage.","replies":[{"poster":"5G8Nri0B54","date":"2014-11-05T18:28:57.434+0000","up_votes":26,"down_votes":0,"body":"Here's a highlight of the problems that most people seemed to have missed. \n\n\nThe newest set of changes **nerfed her Q and put even MORE focus into her E, the COMPLETE OPPOSITE OF WHAT WE WANTED.**\n\n\nNotice how she is even MORE reliant on spamming her E on poisoned targets now! Except now she is encouraged a little more to switch between targets.....which is less than practical when you consider even in the old Cassiopeia, not everyone can get poisoned, and the moment a poisoned champion and a non-poisoned one gets too close, it becomes a helluva lot less fun to use that E.\n\n\nHer E should never have been the focus of her kit, NEVER. If they reworked her, they should have loaded her power into her Q+W's. Her E, rather than being a machine gun ability, should have just been an execute that inflicts damage based on missing health. THAT makes more sense for Cassiopeia, not what we got now.\n--------------------------------\nAsides from that, her changes still do not fix...\n\n-the fact that she is still a single-target damage only mage\n-the fact that she is still going the hyper-carry route\n-the fact that her Passive is STILL a frustrating chore that can be countered by simply playing Passively","replies":[]},{"poster":"Quepha","date":"2014-11-05T14:51:20.388+0000","up_votes":6,"down_votes":32,"body":"i actually like the changes, i know they're not as good as old cassiopeia but it still sounds like she'll be frightening enough in lane to not have the enemy just ignore your damage.\n\nalso, won't a 50% boost to base damage mean that maxing Q would now give you more damage in trades in certain situations than E max?","replies":[{"poster":"Neo Cyrus","date":"2014-11-05T14:55:07.663+0000","up_votes":24,"down_votes":3,"body":"Until you realize you do squat, you still have a chore of a passive which doesn't add anything (only removes), and you realistically can't engage unless your mana pool is magically tripled.","replies":[{"poster":"Quepha","date":"2014-11-05T15:04:40.662+0000","up_votes":5,"down_votes":3,"body":"> Until you realize you do squat, you still have a chore of a passive which doesn't add anything (only removes), and you realistically can't engage unless your mana pool is magically tripled.\n\nso you think she's better off without this poison amplification change?","replies":[{"poster":"Solumindra","date":"2014-11-05T15:15:42.372+0000","up_votes":20,"down_votes":0,"body":"I think she is better on live than PBE because of the removal of the sustain on killing a unit. Yes. I will not be able to stay in lane for more than a couple minutes at best because the spells still cost too much mana, and I am completely reliant on hitting E 1000 times to do any amount of damage. Cass needs mana sustain, or her old passive back. This WILL NOT work.","replies":[]},{"poster":"Serpents Embrace","date":"2014-11-06T23:41:57.015+0000","up_votes":6,"down_votes":0,"body":"Yes, she is.\n\nIt's fake power. 25% extra poison damage *can* sound nice in theory, so do a lot of the changes to the kit rework. But they do very little, and much was taken to insert them. \n\nYour poison begins ticking immediately. Twin Fang has a cast time, and a flight time. You will never enhance the first tick of poison **but** can't cast Twin Fang until they're already poisoned. Then, you're only increasing the damage of the Poison abilities by 25%. Please note that the nerfs to the Q and W's base damage and scaling are *still* in effect. You're raising low damage by 25% per stack - it's still going to be pretty low. Percentages are only impressive if the numbers they enhance are already high.\n\nSo yes, she is definitely better off without this change, because it's nothing but placation. It's another weak attempt at trying to make it look like tools are being added to her kit for what was stripped away **and** comes with yet another nerf to her base damages.","replies":[]}]}]}]},{"poster":"Grand Eleven","date":"2014-11-05T16:52:06.126+0000","up_votes":16,"down_votes":1,"body":"Hmm .... I'm bummed.\n\nIn the last thread Stashu posted, Morello popped in and mentioned that Twin Fang would also reset poison duration which would have changed the landscape A LOT.  I then got in a short debate with Stashu on the very topic which made it seem like it _Wasn't_ happening.  Looks like the later was the case ... which sucks.  These latest round of changes are basically an illusion ... they shift damage around in a way that it is still gated identically and thus her playstyle and over-budgeted \"E\" are still the focus of her kit.\n\nLook on the bright side:  at least it hit the PBE this time!?","replies":[{"poster":"Solumindra","date":"2014-11-05T16:54:09.883+0000","up_votes":10,"down_votes":0,"body":"It hit PBE last time, people will tell him it fixes nothing, then it will go live, then 3 months later they will still be lying about trying to fix this mess.","replies":[]}]},{"poster":"Morello","date":"2014-11-05T19:27:06.149+0000","up_votes":11,"down_votes":48,"body":"Some thoughts on this:\n\n* You should just add if it's weak: No - this is a poor approach. Additive mechanics is not how to power someone up or make their pattern \"better.\" Making it do what it needs to do and focusing the power in the places that matter is. \n* The math makes sense to a degree. We wanted the poison model so we can make her feel more poisony, but it should do high damage as a result. There's some ways to fix it if needed, but I think this concern is valid and we'll discuss.\n* Are you mostly worried about power?","replies":[{"poster":"Wertilq","date":"2014-11-05T19:36:06.336+0000","up_votes":17,"down_votes":1,"body":"Biggest issue I have with current Cassio is that she have very uninteresting counter-play it got even worse with remake, with more power being added to her E, and removed from rest of her kit. Her play pattern is very similar to that of urgot, hit any ability and then a torrent of massive damage is sent your way.\n\nShe just isn't fun to play against, now that she is slightly undertuned she is not seeing overly much action, but if she ever get popular she is not among the interesting champs to play against.","replies":[{"poster":"Abyssphere","date":"2014-11-05T20:07:50.177+0000","up_votes":17,"down_votes":2,"body":"> Biggest issue I have with current Cassio is that she have very uninteresting counter-play it got even worse with remake, with more power being added to her E, and removed from rest of her kit. Her play pattern is very similar to that of urgot, hit any ability and then a torrent of massive damage is sent your way.\n> \n> She just isn't fun to play against, now that she is slightly undertuned she is not seeing overly much action, but if she ever get popular she is not among the interesting champs to play against.\n\nThis is a really good point. Right now this isn't a problem but as much as Cass is more interactive now in the sense that she's no longer a lane bully and has to get up close to people, a question has to be posed: if Cass is ever made viable, will people actually get any enjoyment out of facing such a linear champion? She's basically \"hit poison and then use an avalanche of Twin Fangs or die\" and that can't be much more fun to play against than Urgot, can it? Before the rework, there was a bit more depth to her - she could hide back and use Q, or W, and there was a real danger of her rushing in and murdering you with Twin Fang, but you could attempt to outplay all of this. Now you only have to stop her Twin Fang assault and she's lost. Is there counterplay? Yes, but both the play and counterplay are too linear to be very healthy or fun...\n\n@Morello, my main concerns for Cass are as so:\n\n- Power: just a fundamental thing to be concerned about. Being underpowered is never good - you can't have fun with a champion you can't win with, especially if you end up feeling bad for the people on your team having to put up with you. Similarly, having power poorly distributed throughout a kit is bad. Miasma should not feel entirely useless outside of \"the Twin Fang enabler that maybe lasts a bit longer\". Twin Fang's poison debuff is really good, but both Miasma and Noxious Blast could do with not feeling worthless when not buffed by Twin Fang.\n- Clunkiness: Cass has a lot of potential QoL changes that a lot of people will have mentioned already. The biggest one being the ability to move while casting. This is especially noteworthy on her Q - what's the point in a speed boost while kiting if you have to stop moving to use it (and hope it hits)? Quite risky, quite a poor reward. \n- Complexity: This is possibly my biggest concern at this stage. While the Twin Fang changes in this PBE are largely something I support, the feeling of her kit going around in circles is coming for me. Twin Fang makes her poison better, but needs her poison to make it better. You end up having to do WEEQ just to get decent damage on your Q and it's... bizarre. Complication is fine, high skill caps are fine, but Cass's kit feels like she's trapped in a spider web or something. It's overloaded but it's not overloaded with different abilities, just with different conditions and restrictions. It's a bit headache-enducing and Cass could do with going more back to basics.\n\n\nI very much appreciate the care being put into the changes but between the unwillingness to actually make her more powerful (any new power she's given is compensated for with something being taken away) and the fact that Cassiopeia being fun/good doesn't seem to be on the horizon, it's getting quite frustrating. :( The one thing about the PBE changes I'm very much in favour of is the change to Aspect of the Serpent, but if the thresholds have really been increased to compensate for the changes then even that is worthless. The biggest problem for this rework in a balance sense is that it is apparently essential for every strength she has to be compensated for with a nerf elsewhere and I wish you guys would reconsider on that. It's like compensating for Kalista's passive by making it impossible for her to move outside of using it.","replies":[]}]},{"poster":"Starlighte","date":"2014-11-05T19:30:20.772+0000","up_votes":18,"down_votes":1,"body":"> * Are you mostly worried about power?\n\nShould we not be worried about power? After the initial (rushed) release of Cass, and then her systematic ignoring until just recently (several months) why shouldn't we be worried about her power? Isn't that an area where we SHOULD have little faith in this rework, since the ball was dropped so heavily?","replies":[{"poster":"Morello","date":"2014-11-05T19:35:39.840+0000","up_votes":8,"down_votes":38,"body":"It's the question of what I should care about learning; pattern-wise, it seems right (playstyle and feel), but if the power's off, that's the easiest thing to adjust. \n\nI can understand the circumstances make it feel \"ignored\" when it just got bisected by the craziness of Worlds time. The idea would be to tune Casseo to right if she wasn't, and I think reworks don't need to solve balance on launch but \"balancability.\" I'd like Cass to be CLOSER to the mark on launch at least, but if it's a little off, it's easy to pivot on in 4.21.\n\nI think the core underlying concern is \"can Casseopia function and be useable?\" I think that has validity and we have time to get the numbers tuning right. We just needed to get what we had in to get localization ready.","replies":[{"poster":"Starlighte","date":"2014-11-05T19:40:30.644+0000","up_votes":15,"down_votes":0,"body":"> It's the question of what I should care about learning; pattern-wise, it seems right (playstyle and feel), but if the power's off, that's the easiest thing to adjust. \n> \n> I can understand the circumstances make it feel \"ignored\" when it just got bisected by the craziness of Worlds time. The idea would be to tune Casseo to right if she wasn't, and I think reworks don't need to solve balance on launch but \"balancability.\" I'd like Cass to be CLOSER to the mark on launch at least, but if it's a little off, it's easy to pivot on in 4.21.\n> \n> I think the core underlying concern is \"can Casseopia function and be useable?\" I think that has validity and we have time to get the numbers tuning right. We just needed to get what we had in to get localization ready.\n\nWe've been saying the playstyle is miserable for months, but Stashu seemingly made it apparent that the stacking passive was NOT up for significant changes even though that was the number one thing on everyone's list to get rid of.\n\nWe would tell you what is problematic pattern-wise, but we're kinda feeling totally blown off now.\n\nLook her ratios were gutted to make room for her passive as a hypercarry, but that just doesn't happen every game. It's not a matter of \"superior play will reward you\" it is just a matter of \"am I getting camped or not\" For the same reason other champions have had certain things gutted from their kit, Cass honestly shouldn't have this passive. It not only conflicts with your design values of clarity and not overloading tooltips with information *thus forcing your opponent to look at a wiki everytime they play you* but it also is just a poor design to begin with. If you want to gate Cass players' damage, gate it in mana or in functionality of the kit. Don't gate it with a passive that can't be unlocked except in ideal circumstances.","replies":[{"poster":"Morello","date":"2014-11-05T20:22:28.773+0000","up_votes":8,"down_votes":39,"body":"I'm interested in, mostly, if these changes address the pattern concerns. That's the hard part to pivot on.\n\nRE: \"How long it's been.\" I understand that sucks. But that can't do much to effect today's world - I think it's pretty consistently hammered on but not valuable to reaching anything valuable. \n\nThe primary intractable goal, gameplay-wise, of Casseopia, is to change her power curve from lane bully to [not lane bully]. That's the part that's non-negotiable because it's the unhealthy pattern with the type of kit she has. I think a lot of people (Veigar comparisons) miss this point, and I can't say much but \"sorry guys.\" \n\nOther than that, nothing else is non-negotiable. Some things are harder to change if they need VFX or animation support, but the above reason is also why we won't \"revert\" Cass. The passive is a chore - OK - then how can we make it satisfying? What specifically makes it a chore (I've not been in all the threads, so forgive my ignorance to what's been said in its entirety)? Knowing what sucks, rather than it sucks, will help me understand the pattern issues with this stuff.","replies":[{"poster":"PhoenixSlayer13","date":"2014-11-05T20:34:11.725+0000","up_votes":10,"down_votes":0,"body":"> The primary intractable goal, gameplay-wise, of Casseopia, is to change her power curve from lane bully to [not lane bully]. That's the part that's non-negotiable because it's the unhealthy pattern with the type of kit she has. I think a lot of people (Veigar comparisons) miss this point, and I can't say much but \"sorry guys.\"\n\nMorello, it'd be very, *very* helpful if you expanded on *why* this is an unhealthy pattern for her kit.  Might help us understand just why Cass was brought up for changes.","replies":[{"poster":"Morello","date":"2014-11-05T22:19:21.643+0000","up_votes":11,"down_votes":17,"body":"Casseopia's Q + EEEEE pattern on her kit combined strangling zone control with huge punishment for getting hit by any poison. Since Cass will hit poisons (and needs to) to succeed, the E damage being strong early is \"get hit by Q, get wrecked if you're near.\" The only reasonable dueling option is to not engage, pretty much ever, unless to dunk Cass down in lane via ganks.\n\nThis is the nature of unhinged targeted damage that starts high. While the E is low-range, it's also forgone if any situation outside of \"is too far away\" exists. If Cass is good, she'll push you out of lane with near certainty, and being good against her was \"never fight her at the point in the game where dueling matters.\" It mirrors a lot of toplane problems.","replies":[{"poster":"exe3","date":"2014-11-05T22:30:14.429+0000","up_votes":6,"down_votes":0,"body":"That explains why the early game E damage needed to be hit with a level scaling ratio but what about the Q and W damage?","replies":[{"poster":"Morello","date":"2014-11-05T22:31:47.382+0000","up_votes":8,"down_votes":14,"body":"W damage is via \"this spell is strong and Cass has insanity wave clear.\" Q, I'll have to ask Stashu :P","replies":[{"poster":"Thryale","date":"2014-11-05T22:47:38.141+0000","up_votes":11,"down_votes":0,"body":"But morello, the problem with W now is that it's so weak, it practically heals the enemy that's standing in it (during the laning phase)!\n\nBefore, this was cass's premiere zoning tool. On par with Ziggs' minefield (maybe slightly weaker) But now it can't do it's job at zoning due to it's non-existant dmg and the fact that a simple slow field means nothing in the league of gap closers.\n\nIn order to give cass back some more effective zoning potential, and perhaps give her some safety in lane, do you think we could give her Miasma an MR shred, since you seem completely opposed to making it do any real dmg?\n\nLike, have it shred X amount of mr per second tic of miasma poison, and have the mr shred debuff fall off 2 secs after not being poisoned. Any E's applied will refresh the duration. (just spitballing here, not all of this has to go together)\n\nBut her W needs **something** to make it feel like an effective zoning tool, rather than a waste of mana/feeling like a noob trap.","replies":[]},{"poster":"Riot Stashu","date":"2014-11-05T22:45:44.728+0000","up_votes":10,"down_votes":14,"body":"Yeah! Let's talk more about this. Okay, here's the basic idea: When Q is strong by itself, it's range and dodgeability profile make it such that the Cassiopeia player will *only* want to Q (hanging back and Q'ing will be the dominant strategy). Well, this is a bit of an exaggeration, but that's the basic idea (we don't want another Ziggs, basically). \n\nIt's true that skillshots are more interactive than targetted abilities, assuming all else equal, but when Q is strong at that range, I'd argue that it's less interactive than E overall. Most opponents will only have options against the Q spell ('dodge it'), but not against Cassiopeia herself. \n\nWith these changes, Q first is weaker as a poke spell, and stronger as a 'fishing' spell. When Cassiopeia lands a Q she wants to go on, she can take advantage of the MS boost to get in the riskier E range (where her opponents have options). *Then* E transforms Q back into a powerful DPS spell, with the poison amp debuff,  and becomes a much more meaningful skillshot to land (no longer a fishing tool, now a core DPS tool) but only after Cassiopeia put herself at risk for it.","replies":[{"poster":"Thryale","date":"2014-11-05T22:55:15.130+0000","up_votes":12,"down_votes":0,"body":"Karthus. Karthuskarthuskarthus.\n\nAlso, Cass is the original ziggs, so how is that really fair that he gets to take her spot as the poke champ? But I digress.\n\n\nHonestly, if the E debuff you have planed lasts longer than say 2 or 3 secs, I can see an interesting play pattern form in lane. Q > dash... er, run up > EE > run back > Q poke > debuff wears off > repeat.\n\nI feel that if the E debuff lasts like 5 or 6 secs then that will go quite a ways to give cass's laning phase a bit more power without making her completely non-interactive like you claim her old self to be.","replies":[{"poster":"MakersF","date":"2014-11-05T23:16:45.238+0000","up_votes":6,"down_votes":0,"body":"The mana requirement though...","replies":[]}]},{"poster":"The Queen Viper","date":"2014-11-05T23:00:21.823+0000","up_votes":7,"down_votes":0,"body":"> Yeah! Let's talk more about this. Okay, here's the basic idea: When Q is strong by itself, it's range and dodgeability profile make it such that the Cassiopeia player will *only* want to Q (hanging back and Q'ing will be the dominant strategy). Well, this is a bit of an exaggeration, but that's the basic idea (we don't want another Ziggs, basically). \n\nAnd? Does it somehow surprise you that a low mobility squishy mage wants to hang back and poke before going in for the kill? Seriously? That's de facto the safest and the logical way to play her unless you give her a reliable mobility/re-positional tool. If Cass could dash all over the place like the new Kalista, hanging back and maximizing the Q potential wouldn't be an issue.\n\nTo put it simply: Currently Cass cannot really afford to play any differently, otherwise you would put her into an unnecessary risk.","replies":[{"poster":"Riot Stashu","date":"2014-11-05T23:36:16.668+0000","up_votes":4,"down_votes":16,"body":"Yeah I see the argument here (and in the post before it).\n\nBasically,\n1- Cass is a low mobility mage\n2- Low mobility mages can only function with low-risk abilities\n3- Therefore, Cassiopeia's viability will entirely depend on the strength of her Q/W, regardless of her other abilities\n\n3 might be a bit of a strong claim, but I think that's the general idea.\n\nI follow, but I think that ultimately, it's possible to give champions tools which make taking risks worth it. For example, if Q gave Cassiopeia the full 30% ms from rank 1, slipping in and out of E range would be a lot more appealing. Extreme example, and something we're unlikely to do, but that's the idea. Alternatively, if Cassiopeia had a strong chance of killing the opponent in short range, that, too, might work.\n\nThere may also be other reasons. If the reward for taking a risk is stacking the passive, but that reward is not appealing enough, or the risk is just too high, we can likely manage the factors in this equation to find that sweetspot where the risk is worth it. I think these changes bring us closer, but we may not be there yet.","replies":[{"poster":"Cuix","date":"2014-11-06T00:05:03.780+0000","up_votes":15,"down_votes":0,"body":"Why would Cassi be a risk-taker, though? That's not her character. She's the kind of gal who tweaks things in the background, steadily and subtly gaining power and bringing down her targets. She does not rush in to fight. You need to pay more attention to her character, not just her raw power.","replies":[]}]}]}]},{"poster":"Canastus","date":"2014-11-05T22:46:50.087+0000","up_votes":12,"down_votes":1,"body":"Cass after the rework has no waveclear at all, after all you made sure to gut the ratios on her poison. The only reliable tool to farm with is her E and that only works on single targets as we all know. A shoved up wave in front of her tower is still troublesome for her to clear, especially in the early game, since she has high cooldowns on her poison abilities thus making it harder to even trigger the E-reset that she needs so much.\n\nMeanwhile someone like Zed who isn't restricted by manacosts can harass & farm with ease from safe distance while sustaining forever thanks to lifesteal items. This is downright broken and you should seriously look into nerfing that - he should be an assassin and not a farming machine. At least champions like Fizz and Leblanc are limited in that regard.","replies":[]}]}]},{"poster":"Quepha","date":"2014-11-05T22:59:37.479+0000","up_votes":7,"down_votes":0,"body":"> This is the nature of unhinged targeted damage that starts high.\n\nlucian","replies":[]}]}]},{"poster":"Nefas","date":"2014-11-05T20:25:34.148+0000","up_votes":17,"down_votes":0,"body":"Her passive begs her to be a lane bully. She needs to poke to get stacks but if that poke doesn't do any damage, her passive will never *not* be a chore, because it won't feel rewarding. This is the problem with her passive and your stance on her lane presence.\n\nEDIT: I guess you were asking how it can be made satisfying and I honestly do not think it can be. I think it is fundamentally flawed. Her passive does not suit her kit whatsoever.","replies":[{"poster":"AHeroNamedHawke","date":"2014-11-05T20:49:03.002+0000","up_votes":2,"down_votes":7,"body":"> Her passive begs her to be a lane bully. \n\nHow does that make any sense?\n\nWhile the numbers are currently somewhat lowballed a champion that hyperscales shouldn't also be a lane bully\n\nWhy do you think they just got finished nerfing Yasuo for 15 patches","replies":[{"poster":"Quepha","date":"2014-11-05T20:51:58.540+0000","up_votes":12,"down_votes":0,"body":"> How does that make any sense?\n> \n> While the numbers are currently somewhat lowballed a champion that hyperscales shouldn't also be a lane bully\n> \n> Why do you think they just got finished nerfing Yasuo for 15 patches\n\nthat's kinda his point, cassiopeia makes for a terrible lane bully but your passive says \"fight all the time or i will do nothing for you\"","replies":[]},{"poster":"Nefas","date":"2014-11-05T20:55:04.650+0000","up_votes":6,"down_votes":0,"body":"Her passive wants her to be a late-game hyperscaling champ that relies on lane bullying by poking with Q and W for poison stacks. My point is that that is a contradiction if you don't want her to be a lane bully.\n\nEDIT: Either she is able to bully, which means getting stacks feels good because you do enough damage to bully and trade, or she isn't able to bully, which means she can't trade, can't survive lane, can't get stacks, and therefore can't have a hyperscaling late game. Late game hyperscaling champs shouldn't be bullies and vice versa, so why do they insist on a hyperscaling passive on a champ with a poke-based kit? Either the poke will be terrible or the hyperscaling will be non-existent if she is to not be game-breaking.","replies":[]}]}]},{"poster":"Sparrow89","date":"2014-11-05T21:30:53.385+0000","up_votes":12,"down_votes":0,"body":"> I'm interested in, mostly, if these changes address the pattern concerns. That's the hard part to pivot on.\n> \n> RE: \"How long it's been.\" I understand that sucks. But that can't do much to effect today's world - I think it's pretty consistently hammered on but not valuable to reaching anything valuable. \n> \n> The primary intractable goal, gameplay-wise, of Casseopia, is to change her power curve from lane bully to [not lane bully]. That's the part that's non-negotiable because it's the unhealthy pattern with the type of kit she has. I think a lot of people (Veigar comparisons) miss this point, and I can't say much but \"sorry guys.\" \n> \n> Other than that, nothing else is non-negotiable. Some things are harder to change if they need VFX or animation support, but the above reason is also why we won't \"revert\" Cass. The passive is a chore - OK - then how can we make it satisfying? What specifically makes it a chore (I've not been in all the threads, so forgive my ignorance to what's been said in its entirety)? Knowing what sucks, rather than it sucks, will help me understand the pattern issues with this stuff.\n\n\nI can't speak for anyone else, but for *me,* I think I've deduced down the two main dissatisfying points that end up resulting in the passive feeling like a \"chore\" from my perspective. They kinda blur into each other, but feel like the points are distinct.\n\n1. Someone else articulated this, it just resonated with me, in that they said **the new passive feels like Riot stuck a 60 minute timer on Cass until she's \"fully baked,\" and by landing Q's & E's, and harvesting minions, you can reduce that by a few seconds each time.** With the changes to the passive, so it automatically ticks every 6 seconds & you can't get stacks from minons or E spams... I feel like this has further *reinforced* this specific tone of a monotonous waiting game, and I've gotta work my ass off to reduce that time as much as possible, or I'll be stuck playing a half-powered champion.\n\n2. I don't feel like the passive was made for the character, or the player, to \"use,\" or make interesting and unique. Rather, it *feels* like it's **solely** a \"lever\" that's been installed to control the gate of her power, which I as a player have to grind through. **It just feels, literally, like a chore which has been imposed.** I think this is furthered by the fact that my stacks *reach a limit,* meaning at a certain point in the game, I'm no longer \"benefiting\" from it, while other stacking champions have no cap. While their \"chore\" might be tedious, they can continuously benefit from engaging with it throughout the game, while when Cass reaches her cap it's like **\"FINALLY!!!! I don't have to deal with that shit anymore!!!\"** But then I feel jipped that I'm not continuing to benefit from keeping enemies poisoned or w/e\n\nJust a question, why could you just have her AP stats scaling with lvl like E is currently? Wouldn't this be just as effective a method for gating her early game power, without resorting to this generally ill-received passive, and also make all her other numbers easier to tune since they wouldn't be so volatile.\n\nAlso, having you explain your perspective about the dif between Veigar & Cass was really enlightening, and I can agree with you that the lane-bully power of Pre-Work Cass combined with her kit had too much potential for OPed-ness. \n\nI'm interested to try out these changes you've made to the PBE, can't wait till they go live to try them out now.\n\nAlso, sryy for all the sour grapes that are around. Cass seems to be a particularly challenging champion to rework / balance. Thanks for following up :)","replies":[{"poster":"Morello","date":"2014-11-05T23:33:41.884+0000","up_votes":6,"down_votes":3,"body":"Interesting - it feels very artificial that it doesn't cap - that I can totally see. If it's a part of the game, it should be a key part you keep managing to optimize and grow in power (Breakpoints and later scaling granular power)...this makes sense. \n\nWe're tight on getting under the gate, but I'll see what this looks like. Good post.","replies":[{"poster":"Teslalyte","date":"2014-11-06T12:54:44.513+0000","up_votes":4,"down_votes":0,"body":"Possible solution #1:\n\n- Remove the cap.\n- Allow AP scaling from the stacks, similar to Thresh. Maybe something like 0.25 AP per stack (4 stacks = 1 AP).\n- Decrease the power of each break point to compensate for the above AP scaling. Less CDR, maybe even less AP% gain as well.\n\nThis will accomplish a few things:\n\nPros:\n- The \"grind\" to each break point will be softened by steady power gains.\n- With no cap, players won't feel the gain is artificial. There's always more power to find.\n\nCons:\n- Potential OP effect if game goes on too long. (Is this a Con?)\n- Might encourage players to ignore team efforts in favor of more farming. (I've seen Nasus and Veigar players both do this, though that is more of a player skill issue.)\n\n\n\nPossible solution #2:\n\n- Change the passive system to one where her stacks are \"spent\" when you gather enough.\n- Change the numbers a bit. Each break point costs 130 stacks. (Numbers could be tweaked.)\n-- 130: +10% AP and 25% CDR\n-- 130: +10% AP and E Heals on hit.\n-- 130: +10% and (new effect, longer during/more dps on Q, mana redux/gains?)\n- Allow players to choose which upgrade they get once they reach 150 stacks.\n- Maybe spin that whole \"Ascendancy\" angle you guys have been toying with in her lore.\n\nPros:\n- Gives the players meaningful choice, and could allow them to adjust their play style based on their opponents.\n- Gives reliable gains based on the time spent to get them.\n- Allows for another possibility of giving her a power boost.\n- Each break point will feel strong on it's own.\n\nCons\n- Still a time-based increase with no gains in between, but the \"cap\" is less obvious.\n- Maybe too similar to champions like Kha'Zix or Victor.\n\n\nI'm sure you guys discuss this stuff all the time, but it would be cool if you considered something like this.","replies":[]}]}]}]}]},{"poster":"Solumindra","date":"2014-11-05T19:38:30.693+0000","up_votes":15,"down_votes":0,"body":"To be fair, we have waited 3 months....We would like a viable champion before 2015....","replies":[{"poster":"Circuit Bear","date":"2014-11-05T19:43:12.274+0000","up_votes":11,"down_votes":0,"body":"Or a character we enjoy playing, not taking one and making them into a Veigar clone without the stun for defense cause you know.. Cass still has the glaring flaw of turning around when she ults. .","replies":[]}]}]}]}]},{"poster":"Martyrofsand","date":"2014-11-05T16:12:14.945+0000","up_votes":3,"down_votes":22,"body":"People need to accept the oldd Cassio Q poke playstyle is not coming back.  Riot has said this over and over again and these changes are riot trying to meet you half way by making poisons relevant again on the individual targets you are hitting with your E.  \n\nThe only real problem with the PBE Cass changes is the removal of the mana refund on her E when it kills a unit as with that being removed and her poison damage lowered her wave clear just took a pretty rough hit.   Yay for people complaining about something that didn't need to be changed.","replies":[{"poster":"chumbler","date":"2014-11-05T16:21:01.444+0000","up_votes":26,"down_votes":4,"body":"> People need to accept the oldd Cassio Q poke playstyle is not coming back.  Riot has said this over and over again and these changes are riot trying to meet you half way by making poisons relevant again on the individual targets you are hitting with your E.  \n\nWe shouldn't have to accept a bad rework done on a false premise. There was nothing at all wrong with old Cass unless you accept Riot's stupid, bad, and extraordinarily narrow definition of counterplay. This rework is flat out trash and is unsalvageable.","replies":[{"poster":"Daen","date":"2014-11-05T18:23:50.140+0000","up_votes":8,"down_votes":4,"body":"Right so, a few things to address here.  **Disclaimer: I'm not saying the rework is successful***.\n\n>There was nothing at all wrong with old Cass unless you accept Riot's stupid, bad, and extraordinarily narrow definition of counterplay.\n\nCassiopeia's pre-rework lane dominance (way back in the day) was a bit overbearing.  It was really frustrating to play against her because she suffered from the Rocket Grab/Javelin Toss problem.  You could dodge her poison all day long, but if she happened to hit one and sped up to meet you with her movespeed boost, she would do a huge amount of damage for very little cost.  If an enemy tried to retaliate, she could just ult them when they turned around and drop even more damage.\n\nI know this hasn't been the case for a long time, but her base mechanics made this pattern the norm.  From a counterplay standpoint, a play pattern where you snowball out of control when you land a skillshot (without meaningful cost) isn't necessarily healthy.  A much more healthy pattern for her would be a situation where landing a skillshot (Q) allows for some free poke through E, but her primary damage is locked down to the skillshot DoT.\n\n>This rework is flat out trash and is unsalvageable.\n\nNow that's just doomsdaying.  From what I've gathered, the main two fantasies players want to fill through Cassiopeia are true DoT and sustained poke.  I think this is awesome, and neither pre-rework nor post-rework has really nailed it.  Pre-rework filled the roles of dominance and punishment, post-rework fills the roles of...umm...I guess...ascension and sustained burst.\n\nPersonally, I think the following could be kinda cool:\n\nQ: Longer cooldown (maybe 8 seconds) and higher damage (all DoT, no burst)\nW: Utility, not necessarily important to her rotation\nE: Slightly lower burst and slightly lower cooldown, but after x TF casts (maybe 2) on a poisoned target the Q cooldown is refunded\nR: No reason to change\n\nHer optimal rotation would become the following:\n\nWQEERQEE\n\nHer Q Dot would be her main source of damage, and E's primary function would be to either add extra sustained damage between casts or refund the Q DoT cooldown entirely.  A good Cass player would be consistently whittling down the opponent, and her optimal rotation would be both strong and a little risky.\n\n---\n\nAnyway, I haven't thought this through a ton so if I'm way off base let me know.","replies":[{"poster":"Zigglo","date":"2014-11-05T23:33:24.396+0000","up_votes":1,"down_votes":0,"body":"I would like to put out that I'm really missing the mana restore on E. It was just fun and rewarding for me to top myself off after clearing a minion wave. Please bring it back... Pretty please!","replies":[{"poster":"Zigglo","date":"2014-11-05T23:51:56.345+0000","up_votes":2,"down_votes":0,"body":"On the subject of her passive I think one of the big reasons as to why it feels a bit un rewarding is not the reward itself but how much you can accelerate the granting of said reward by making good played ie winning lane. As it stands there are no bonuses for kills or assists this can lead to a scenario where it actually can be more benefital in tearms of power gain to let your lain opposition live so you can poison them and get the last stacks you need for your bonus rather that get the kill.","replies":[{"poster":"Riot Stashu","date":"2014-11-06T02:00:03.950+0000","up_votes":4,"down_votes":12,"body":"Yeah we've spoke a lot about this. I think this runs into a lot of the same problems of \"Hey, I'm not supposed to be a lane bully, but I'm supposed to kill them?\" and \"Well, I wanted to do that anyway, so that's nothing new.\" Which are complaints about the current passive. \n\nBut I think you're 100% right about her not having enough actions to feel like she's growing her strength. Any other ideas?","replies":[{"poster":"Hellioning","date":"2014-11-06T02:08:00.612+0000","up_votes":5,"down_votes":0,"body":"This is in response to \n>Yeah this is a popular sentiment, totally reasonable. My idea here is that if Cassio is crafty and takes smart trades, or lands well placed Q's from a distance (note, passive does not encourage her to come into E range for stacking), that she'll be able to get there. This depends on her not being total trash in the lane, which may be where she is on live. Basically, she could not be a lane bully while still having a lane presence. We went too far there.\n\nbecause I can't get to that post for some reason.\n\nAnyone, do realize that 'smart trades' are basically impossible to make against any good player in mid. It's different from bot lane, where someone can be stuck in their attack animation to get a minion. Instead, mages can use autos to farm and save their abilities to kill your face. They also rely more on levels than gold, so one missed CS is a bit less important to them. You don't want to make 'smart Qs from a distance' very damaging, so even if I do land them, if I don't follow up with E, it feels really bad.\n\nYou seem to be trying to be using bot lane mechanics and gameplay in order to balance a mid champion. They are rather different beasts, and what's good in one lane might be bad for another.","replies":[{"poster":"Riot Stashu","date":"2014-11-06T02:20:14.899+0000","up_votes":6,"down_votes":15,"body":"Pretty insightful stuff here, and I agree generally. In fact, I based my claims on these ideas.\n\nHere's what I mean: Cassio uses her Q's to try to hit enemy champions. They are low cost to Cassio, as they have substantial range and can be used through the minion wave (they are not blocked), and have a low CD. Q's that land do damage and build your passive, which are already good things. More importantly, however, Q gives you MS to decided whether or not you want to trade. If the lane opponent is someone like Ahri, hopefully this MS empowers you to trade with her, now having increased ability to dodge her skill shots.\n\nThis is what I mean by smart trades. One thing that has gone largely undiscussed is that her Q ms is lower than it used to be. Honestly, I think this was just a huge mistake. If anything, the rank 1 ms should probably be higher than it used to be. I'll meditate on this a bit more, but I definitely want Cassiopeia to be empowered to trade efficiently with her opponent if she lands a Q. I think the MS will enable this against many mids (and, consequently, has hurt her trading ability since being nerfed), and also give her a soft bump to safety. \n\nTLDR; Landing a Q should enable follow up with E's, and winning a trade should require follow up with E's. If this is not the case, I suspect MS will help it get there, allowing Cassio to dodge her opponents abilities. If this is not the case, well then it's probably a damage issue, or just a bad matchup.","replies":[{"poster":"5G8Nri0B54","date":"2014-11-06T02:28:43.340+0000","up_votes":5,"down_votes":0,"body":"> Q's that land do damage and build your passive, which are already good things.\n\nHere's the problem, it isn't. Landing her Q is **only a good thing upon the 75th, 200th, and 400th stack**...\n\nHave you read about my suggestion on how to compromise between keeping this Passive and salvaging it to atleast make it satisfying?\n\n\n(also, a lot of good that bit of movespeed will do against Zed, Talon, Yasuo, Leblanc, Fizz, etc.)\n--------------\nIronically enough, a similar sentiment could go towards farming and earning gold. Gold is useless unless spent. But whatever it is that separates earning gold to buy stuff and building up stacks to eventually get power boosts at very specific milestones, it's hurting your rework.","replies":[{"poster":"Riot Stashu","date":"2014-11-06T02:51:55.574+0000","up_votes":3,"down_votes":14,"body":"I've read your suggestions. Definitely stuff to think about. \n\nJust real quick though, about the consistent build-up model: \n\nWe tried it, extensively. In fact, this was our first idea, and we were super excited about it. We like the idea that the Cassiopeia player can constantly feel like their working towards their goal, constantly gaining power, and this seemed to fit right in. However, versions where she slowly incremented her power just didn't feel good. They offered gradual and imperceptible power increases to abilities which were nowhere near as visceral as Siphoning strike, or any of Veigar's abilities. That moment where you hit a turret for half of its hp as Nasus or when you 1-shot a bruiser as Veigar are just so satisfying (and... sometimes problematic) that they almost provided a tiered feeling of power growth. However, having Miasma do imperceptible yet powerful damage to a whole team just wasn't popping for anyone who played on that version. \n\nThe idea is that with tiered bonuses, the power increases become much more noticeable and appreciable, and really hit that feeling of ascending to power (and also show her opponents that she has become more threatening). It seems clear that the current bonuses just don't offer that feeling of power, and thus aren't satisfying. I suspect that since it's also just been weak since launch and that it's still missing audio feedback, the satisfaction of it has actually been underexpressed, and that, though it has problems, it is at least a little more satisfying than people have been experiencing. \n\nThat said, I'm definitely looking to improve it, and I've found some pretty good ideas in this thread.\n\nI know I haven't responded to you much Ginga, but I've been reading your [numerous] posts ever since the GD thread. I appreciate how dedicated you are to getting Cassiopeia in a good place, thanks for hanging around.","replies":[{"poster":"Quepha","date":"2014-11-06T04:04:22.446+0000","up_votes":9,"down_votes":0,"body":"> I've read your suggestions. Definitely stuff to think about. \n> \n> Just real quick though, about the consistent build-up model: \n> \n> We tried it, extensively. In fact, this was our first idea, and we were super excited about it. We like the idea that the Cassiopeia player can constantly feel like their working towards their goal, constantly gaining power, and this seemed to fit right in. However, versions where she slowly incremented her power just didn't feel good. They offered gradual and imperceptible power increases to abilities which were nowhere near as visceral as Siphoning strike, or any of Veigar's abilities. That moment where you hit a turret for half of its hp as Nasus or when you 1-shot a bruiser as Veigar are just so satisfying (and... sometimes problematic) that they almost provided a tiered feeling of power growth. However, having Miasma do imperceptible yet powerful damage to a whole team just wasn't popping for anyone who played on that version. \n> \n> The idea is that with tiered bonuses, the power increases become much more noticeable and appreciable, and really hit that feeling of ascending to power (and also show her opponents that she has become more threatening). It seems clear that the current bonuses just don't offer that feeling of power, and thus aren't satisfying. I suspect that since it's also just been weak since launch and that it's still missing audio feedback, the satisfaction of it has actually been underexpressed, and that, though it has problems, it is at least a little more satisfying than people have been experiencing. \n> \n> That said, I'm definitely looking to improve it, and I've found some pretty good ideas in this thread.\n> \n> I know I haven't responded to you much Ginga, but I've been reading your [numerous] posts ever since the GD thread. I appreciate how dedicated you are to getting Cassiopeia in a good place, thanks for hanging around.\n\ndidn't your internal testers also say dots weren't as rewarding as direct damage and didn't the terrible first pass e reset glitch make it past them? maybe the relatively smal subset of cass players have a better appreciation for incremental bonuses and damage over time than your testing team who i suspect are composed of players from all over lol's playerbase instead of the ones that like cass.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"TenSlashTen","date":"2014-11-05T14:53:30.577+0000","up_votes":20,"down_votes":5,"body":"yeah another gutted non meta pick.\nrito gaymes","replies":[]},{"poster":"Neo Cyrus","date":"2014-11-05T14:36:00.459+0000","up_votes":21,"down_votes":7,"body":"When I saw the new rework on the PBE I just gave up, 3 months of waiting for what appears to be an even worse version. Cass is dead, BGnore. In b4 Cobra gives some hypothetical scenario which he can pull off what no one else can where Zeus imbues his Cass play with the power of the gods and somehow he manages to win a game at 900 Elo below where he belongs and therefore declares it theoretically viable, which it's not.\n\nAt this point regardless of the motives it should be obvious he wants to keep Cass in trash tier along with Urgot and Diana or at best super niche/almost never picked tier \"which is perfectly fine\" (it's not). The aim is obviously to hit the bare minimum of \"this champion can be played without being a 100% loss\".\n\nMy advice is move on, it's abundantly clear there are zero intentions of making Cass a threatening champion viable by any reasonable definition, let alone a hyper carry (somehow by cutting out all her damage, genius).","replies":[]}]}