{"poster":"Batotsu","date":"2016-02-20T01:29:55.777+0000","title":"Ao shin Vs Aurelion Sol","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Despu&eacute;s de tanto tiempo en espera, no pude creer que sacaran a ao shin... y aun menos pude creer que le pusieran de nombre Aurelion sol. Por eso mismo decid&iacute; hacer esta encuesta, con el &uacute;nico fin de ver de una vez por todas, si el nombre que debe quedarse en el campe&oacute;n es Ao shin o Aurelion sol.\r\n\r\nSi tienen algo que decir sobre este repentino cambio de nombre, por favor d&eacute;jelo en los comentarios :D\r\n\r\n*Reaccion a Aurelion Sol*\r\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"KarmaUnder","date":"2016-02-20T01:53:06.286+0000","up_votes":4,"down_votes":0,"body":"la verdad q ao shin suena mas como dragon, y tambien suena mas como oriental, aurelion sol parece el nombre de un rey griego ._.","replies":[]},{"poster":"RectoDePerro","date":"2016-02-20T05:19:30.331+0000","up_votes":1,"down_votes":0,"body":"Mira seguramente cambiaron las habilidades y el nombre Ao Shin estaba relacionado a un dragón de trueno/relámpago o algo así. De seguro el nuevo campeón no es de esa temática por lo que si es que se queda el nombre no tendría mucho sentido. Además ni se a visto el nuevo campeón y ya andan criticando, como quieren que rito comparta información de en lo que trabajan lo cual podría llegar a ser algo al final si se ponen a joderlos cada vez que hay cambios. Por que por lo que recuerdo desde un principio se dijo que podrían haber cambios.\n\nSaludos","replies":[{"poster":"Batotsu","date":"2016-02-21T20:05:54.610+0000","up_votes":2,"down_votes":0,"body":"Error mio, es el substituto de Ao shin...","replies":[]},{"poster":"Batotsu","date":"2016-02-20T06:21:22.059+0000","up_votes":2,"down_votes":0,"body":"Acabo de investigar un poco mas, este campeón no es ao shin, pero momentáneamente es el dragón que saldrá en la grieta. Pese a todo seguiré con todo esto, con la intención de que no se anuncie su cancelación, o de que no se vuelva a hablar del tema por este nuevo dragón...","replies":[]}]},{"poster":"jesus1024","date":"2016-02-20T03:15:18.437+0000","up_votes":2,"down_votes":0,"body":"el nombre es muy largo e inutil. tardas mucho en escribir aurelion y encima agregarle el \"sol\", hasta que lo escribis te roban el red y te matan.","replies":[{"poster":"Fiky","date":"2016-02-20T03:36:31.748+0000","up_votes":2,"down_votes":0,"body":"hasta que escribas Twisted Fate ya terminó la partida, se pueden buscar sobrenombres, Aure, listo... no digo que sea bueno pero dale, es una queja un tanto fuera de lugar","replies":[]}]},{"poster":"nazareno 567","date":"2016-02-20T03:17:06.485+0000","up_votes":2,"down_votes":0,"body":"creo que aurelion esta bien,pero el sol esta de mas\n\nsin embargo me quedo con ao shin\n\n\n\n\n\nPD:si el nombre llegara a ser aurelion sol(cosa que es muy probable) un rioter dijo que habria como skin secundaria este no es ao shin","replies":[]},{"poster":"MariniZro","date":"2016-02-20T01:41:30.124+0000","up_votes":2,"down_votes":0,"body":"Me hubiese gustado mas algo como \"Aurelion\" solamente ._. Ese \"Sol\" es medio al pedo -.-","replies":[{"poster":"Batotsu","date":"2016-02-20T01:44:33.089+0000","up_votes":2,"down_votes":0,"body":"El problema que me dio a mi, es que después de esperar a un campeón llamado Ao shin, quede con la expectativa de Ao shin, ademas de que su nombre quedo como una leyenda del dragón que nunca salio.\nEntonces que me cambien el mito con Aurelion sol, me dejo bastante mal y.y","replies":[]}]},{"poster":"LyghtSh","date":"2016-02-20T02:17:44.521+0000","up_votes":2,"down_votes":1,"body":"Me gusta aurelion sol, es como el tio aurelio el de toda la vida, pero claramente me quedo con Ao Shin porque me gusta mas y yo lo estuve mencionando desde hace 3 años como Ao Shin","replies":[]},{"poster":"Ahristócrata","date":"2016-02-20T11:02:46.327+0000","up_votes":1,"down_votes":0,"body":"Aurelio Luna","replies":[]},{"poster":"Gig GOD OF DEATH","date":"2016-02-20T03:15:26.726+0000","up_votes":1,"down_votes":0,"body":"Y yo pensando que Morello se lo había llevado...\n http://i.imgur.com/Yn361nK.jpg","replies":[]},{"poster":"Pablove90","date":"2016-02-20T02:07:48.005+0000","up_votes":1,"down_votes":0,"body":"nose el nombre que sea.. pero que le pongan alas y le den de comer un poco viejo.. eso que vimos parece mas un pichon de lagartito que un dragon ... media pila rior... un dragon sin alas.... {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Batotsu","date":"2016-02-20T02:13:53.147+0000","up_votes":1,"down_votes":0,"body":"Creo que es porque mezclaron al dragon occidental con el oriental, el cual es muy largo y delgaducho :P\n{{sticker:zombie-brand-clap}}","replies":[]}]},{"poster":"Masta 4to","date":"2016-02-20T02:44:43.584+0000","up_votes":1,"down_votes":1,"body":"me gustan los dos D: no se que decir","replies":[]}]}