{"poster":"Akali is SO HOT","date":"2016-11-05T22:56:51.468+0000","title":"My final thoughts on the Akali Rework","subforum":"Gameplay","up_votes":26,"down_votes":2,"body":"I&#039;ll probably make another thread if anything else changes drastically or after the patch hits live, but this will probably be my last one concerning the rework as a whole.\n\nIt&#039;s good that you made her passive more interactive than just a stat stick like her current passive is, but making a champion with a clunky auto attack animation have to auto attack for full benefit of part of their kit is very bad design.  The least you could do for her is speed up her animation a little bit or maybe give her extra attack speed for two auto attacks if her passive is off cooldown, after ulting, or something else.  I still feel that making the damage come before the heal is a better idea because an assassin wants to get all of their burst off at once rather than in awkward intervals which this setup is effectively doing to her.\n\nI&#039;m happy that you gave her back the 8 second duration at all ranks, but the blink and being forced to place it on top of yourself 100% needs to go.  The ability already gives utility with its ms buff and ms slow against enemies and any mobility on top of that is very unnecessary.  It feels really clunky and out of place in her kit and having to place it on top of yourself takes away so many things that she can currently do with her shroud.  I still haven&#039;t seen any context as to why you are adding this to her shroud in the first place and why you think it is necessary and that really bothers me.  If there is anything you need to think about reverting in this rework it is definitely that change.  It completely changes the way she plays and feels really terrible to use.  [Here is the thread](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/vxq9B2lj-i-very-much-dislike-the-changes-to-akalis-shroud-and-think-they-should-be-reverted-heres-why?sort_type=recent) I made talking about why I think it is very out of place in her kit and why it should be reverted.  Almost every Akali player I have talked to is really upset about this change and most agree that it needs to go.\n\nHer E change is just a flat out nerf which is pretty lame.  I don&#039;t really care about this change too much because true Akali players can adapt to nerfs like this that she gets all the time so whatever.  Maybe if you are feeling generous you could reduce the energy cost at max rank so it&#039;s not as much of an energy sink, but if not then I&#039;m fine with the change.\n\nThe second most important thing in this rework is the nerf to her ult.  Making it two seconds at max rank feels really clunky.  Another thing that&#039;s bad about this change is that you are making an assassin with an already slow assassination window even slower at doing her job.  With AP assassins being completely shafted in new, cool itemization and with supports getting new tools to play with to make ADCs even harder to kill this will just weaken Akali even further.  The base damage nerf I can deal with, but cutting the ratio in half is a little too extreme.  Akali doesn&#039;t get much AP early on in the game anyway so it&#039;s not like her ult is going to be doing a ton of damage when she hits level 6.  This again is just a flat out nerf to Akali.\n\nOverall, after a lot of testing on PBE, all of these changes make Akali feel much clunkier than she currently is.  The changes just really have made an already slow bursting assassin even slower which makes doing her job even harder.  The nerfs to her damage and ratios means her damage is much lower and if she doesn&#039;t have the damage to kill her target then there is no point in playing her as an Assassin when you could just go Bruiser/Tank instead and actually stay alive long enough to make use of her passive.  I&#039;ve had very little success as AP Assassin Akali on PBE and much more success as Bruiser/Tank Akali which is very disheartening considering she is supposed to be played as an Assassin and that is the most fun way to play her.\n\nBasically, after playing her a ton on PBE, my suggestions are:\n-Speed up her auto attack animation or give her some sort of buff to help her get her passive off more effectively\n-Make the damage portion come first in her passive to not split up her burst\n-**Remove the shroud blink and forcing her to place it on top of herself**\n-At least partially revert the ratio nerf on her ult\n-Make her ult cooldown 2/1.75/1.5 seconds instead of 2 seconds at all ranks\n\nIf this many people are  upset or against these changes to Akali (Shaco as well and Fizz to some extent) then maybe listening to the community and especially their mains would be a good idea because they generally have a good idea of how the changes will affect her gameplay.  Akali is a very delicate champion balance wise and these changes really feel like they are screwing everything up.  Thanks for reading.","replies":[{"poster":"Penns","date":"2016-11-05T23:19:51.861+0000","up_votes":10,"down_votes":1,"body":"I dont play Akali but I probably wouldnt like the changes either. \nI cant agree with \"already slow assassination window\" tho, with Gunblade and thunderlords ready her burst is like insane.\n\nOne thing that I think will be fun is walking up to a wall acting like you want to W over it and then using W to blink away from the wall.","replies":[{"poster":"Akali is SO HOT","date":"2016-11-06T01:24:01.621+0000","up_votes":6,"down_votes":5,"body":"Compared to other Assassins she has very low burst.  She can really only start 1 shotting you when she gets rolling/gets a lot of her items which won't be until much later in the game.  Until then she needs at least 2 rotations to kill you which is a lot slower than a lot of Assassins and gives you a lot of time to react.  These changes make her burst even slower which gives her enemies too much time to react tbh.  I've had a lot more success as bruiser akali because I can't assassinate people really well at all because of her low burst on pbe","replies":[{"poster":"MEMEME670","date":"2016-11-06T04:26:08.172+0000","up_votes":2,"down_votes":8,"body":">Compared to other Assassins she has very low burst. She can really only start 1 shotting you when she gets rolling/gets a lot of her items which won't be until much later in the game. Until then she needs at least 2 rotations to kill you which is a lot slower than a lot of Assassins and gives you a lot of time to react.\n\nThis is true, but you're ignoring the huge buff shroud being fully invisible is, and the fact that she has fairly large + low cooldown (stack based) mobility to allow her to get to her target. \n\nFully invisible is a HUGE buff. It might as well be invulnerability + cc immunity in 90+% of scenarios, and that's Kayle ult + Morg e (albeit in a small area, but your threat range is that area + your ult range, which is a very good range).\n\nAdditionally, you say you don't like her W because it feels weird. It's a new thing, of course it'll feel weird, that's not a reason it's bad. It's a buff to her, added mobility is basically always a buff. You'll have to learn to use it correctly, but that's to be expected with any change. \n\nIn your other thread you talk about things being aimed at casuals as opposed to akali players, and while wanting mastery of a champion to be rewarding, changes that are easy for newer players to use are not inherently bad because of that. You also mention how the new w dash was hard for you to use well, and how that's bad (even though that's the kind of thing that favours akali players over casuals).\n\nOverall, even if she does have too low damage or some other thing, I don't think much of your reasoning holds water at all.","replies":[{"poster":"Akali is SO HOT","date":"2016-11-06T06:04:56.541+0000","up_votes":4,"down_votes":2,"body":"The immunity to pink wards isn't actually that huge of a buff for Akali especially for Akali mains.  She isn't in her shroud for very long in fights to begin with so it's not like she's getting 8 straight seconds of stealth.  Not to mention that because of the changes her shroud is going to almost always be placed in awkward positions because you can't control where you want it to go which means, unless you are in the perfect spot to place down your shroud, she will have even less incentive to stay in her shroud.\n\nThe blink added to her shroud is most certainly not a buff.  I can say with certainty that her shroud is much weaker now with that added to it.  In exchange for a stupid gimmicky blink she loses:\n-The ability to place it where she wants\n-Vision dashing\n-Peel for her team\n-An extra escape with the movement speed buff by placing it in front of her\n\nThere's more, but those are the main ones.  Not being able to place it where she wants just by itself is an absolutely **huge** nerf.  The small gimmick she gets with this change is both a huge nerf to the shroud and unnecessary.  It's being tacked on for no good reason.  She doesn't need it and it has no place in her kit.  The way her shroud works like it does now is fine.  There's no need to add anything new to it if it's fine the way it is right now.\n\nChanges geared more towards casual players are very bad when they are made at the expense of a champion's main player base.  Riot even said they would cater more towards Akali players than they would casual players and, so far, most of these changes are doing exactly the opposite of what they said they would do.\n\nIf there is one thing that should be pulled it is definitely this shroud change.  I've been playing her a lot on PBE and I can see with certainty this is not the way to go with her shroud and it really ruins how she uses it.","replies":[{"poster":"MEMEME670","date":"2016-11-06T06:28:26.272+0000","up_votes":2,"down_votes":8,"body":">The immunity to pink wards isn't actually that huge of a buff for Akali especially for Akali mains. She isn't in her shroud for very long in fights to begin with so it's not like she's getting 8 straight seconds of stealth.\n\nKayle ult doesn't last very long, and it's still insanely powerful. They aren't exactly the same, but still, being able to disengage from combat on command, especially on someone who uses skills as opposed to autos for damage, is one of the best utilities in the game, (see: zhonyas).\n\n>Not to mention that because of the changes her shroud is going to almost always be placed in awkward positions because you can't control where you want it to go which means, unless you are in the perfect spot to place down your shroud, she will have even less incentive to stay in her shroud.\n\nSo just position well? Seems like it heavily favours akali players over casuals.\n\n>The blink added to her shroud is most certainly not a buff. I can say with certainty that her shroud is much weaker now with that added to it. In exchange for a stupid gimmicky blink she loses:\n>-The ability to place it where she wants\n>-Vision dashing\n>-Peel for her team\n>-An extra escape with the movement speed buff by placing it in front of her\n>\n>\n>There's more, but those are the main ones. Not being able to place it where she wants just by itself is an absolutely huge nerf. The small gimmick she gets with this change is both a huge nerf to the shroud and unnecessary. It's being tacked on for no good reason. She doesn't need it and it has no place in her kit. The way her shroud works like it does now is fine. There's no need to add anything new to it if it's fine the way it is right now.\n\nYou had yet to say \"the tradeoff of the blink for the loss of these things is bad\" in your previous posts. And I don't think looking at just one ability like that is fair. The champs whole kit got changed, sure maybe the shroud got nerfed, but obviously Riot then intends to buff other parts of her to make up for it. \n\nAlso, how does she lose the extra escape? Isn't that given to her in the form of a dash?\n\n\n>Changes geared more towards casual players are very bad when they are made at the expense of a champion's main player base. Riot even said they would cater more towards Akali players than they would casual players and, so far, most of these changes are doing exactly the opposite of what they said they would do.\n\nI don't at all agree with this. Again, you complained about the dash being hard to use, which seems like the exact opposite of this 'changes should be hard to master' stance you have here.\n\n\n>If there is one thing that should be pulled it is definitely this shroud change. I've been playing her a lot on PBE and I can see with certainty this is not the way to go with her shroud and it really ruins how she uses it.\n\nWith certainty? Really? You're plat 5? I can say with certainty you have a solid amount to learn about the game in most if not every aspect, and I'm not trying to be mean, but I just don't believe without an insanely strong mastery of the game you can really even pretend to know how changes will work out that well.","replies":[{"poster":"Hinagiku33","date":"2016-11-06T13:19:16.914+0000","up_votes":7,"down_votes":0,"body":"I'm going to guess that you don't actually play Akali, which is why any of these changes look even remotely good to you.\n\nIf you played Akali, you would know that her W has a cast time. This cast time was kept with the changes, so Akali's dash is on a delay which makes it basically useless for dodging any fast-moving skillshots. For slow-moving skillshots, it's a lot easier to just walk out of the way and not risk getting hit before the dash goes off.\n\nAkali's W grants movement speed to her while she is in the shroud. Being able to place her shroud in front of her means that Akali can grant herself a nice MS boost to escape. There's still a slight delay on the shroud appearing, but it doesn't actually stop her from running away so it works.\n\nAkali's W also slows enemies so being able to place it behind her lets her slow enemies that are trying to chase her. \n\n*The OP (and basically every Akali player testing her on the PBE) have said that she is \"clunky\" which is NOT the same thing as \"mechanically difficult\".* It looks like you like to play Janna. Imagine if Riot changed Janna so that she rooted herself while her Q tornado was charging. People that hate Janna could easily say \"this makes her difficult to master\" and say the change is good. You would probably say \"no, this just makes her clunky to play\". The OP is saying the change is like that - it adds nothing to her gameplay, so there is nothing to \"master\", and just makes her feel slower and clunkier. \n\n***When all of the Akali mains are saying the changes are terrible, and all of the casuals that don't play Akali think they are kind of interesting or okay, then Common Sense would suggest that the changes favor casuals and are bad for Akali mains.***\n\nAlso it's pretty rude to bring rank into this when you don't play the champion yourself. You could be Master or Challenger, but if you don't actually play Akali then your rank doesn't make you right.","replies":[{"poster":"MEMEME670","date":"2016-11-07T00:38:28.523+0000","up_votes":1,"down_votes":3,"body":">I'm going to guess that you don't actually play Akali, which is why any of these changes look even remotely good to you.\n\nYou're misinterpreting my stance here. I'm simply arguing that, even if the numbers are way off on some things (which I don't know if they are or aren't), the direction for the change is perfectly fine, and she'll receive buffs if appropriate after she comes onto the live environment and gains excessive ingame testing. Thus, such overblown reactions have no place.\n\n\n\n\n>If you played Akali, you would know that her W has a cast time. This cast time was kept with the changes, so Akali's dash is on a delay which makes it basically useless for dodging any fast-moving skillshots. For slow-moving skillshots, it's a lot easier to just walk out of the way and not risk getting hit before the dash goes off.\n>\n>Akali's W grants movement speed to her while she is in the shroud. Being able to place her shroud in front of her means that Akali can grant herself a nice MS boost to escape. There's still a slight delay on the shroud appearing, but it doesn't actually stop her from running away so it works.\n>\n>Akali's W also slows enemies so being able to place it behind her lets her slow enemies that are trying to chase her.\n>\n>The OP (and basically every Akali player testing her on the PBE) have said that she is \"clunky\" which is NOT the same thing as \"mechanically difficult\". \n\nOkay. I'm not seeing the issue here, unless you mean to say she now roots herself while casting W and she didn't before, or that she now roots herself longer than she did before.(Although, the usage I'm used to of cast time is specifically that time a character roots themselves when casting spells, i.e. Syndra's Q has a delay but no cast time.) If this is the case, I could see it being reasonable to want that removed, yeah. \n\n>It looks like you like to play Janna. Imagine if Riot changed Janna so that she rooted herself while her Q tornado was charging. People that hate Janna could easily say \"this makes her difficult to master\" and say the change is good. You would probably say \"no, this just makes her clunky to play\". The OP is saying the change is like that - it adds nothing to her gameplay, so there is nothing to \"master\", and just makes her feel slower and clunkier. \n\nI just play whatever's good, but that's irrelevant here. I see you trying to paint me as someone who hates Akali (although this could be unintentional), but I don't know why you would do that. I'm not being unreasonable here or insulting the people I'm talking to, so I don't see why you would. \n\nI think that your analogy isn't extremely good, but that's not all that important here either honestly. What is important is that you're saying people think adding a dash adds nothing to her gameplay, which is very obviously false. Mobility is a very strong and often fairly complex thing to add to a character. Quick example, Ezreal's E is at least 50%, possibly more, of his complexity as a champion. Mastery of his E is one of the quickest and easiest ways to differentiate a good vs bad Ezreal player. \n\n>**When all of the Akali mains are saying the changes are terrible, and all of the casuals that don't play Akali think they are kind of interesting or okay, then Common Sense would suggest that the changes favor casuals and are bad for Akali mains.\n**\n\nThis just isn't true. The PBE has inherent bias, and not nearly as good matchmaking due to less people on it. I don't claim to know exactly how the PBE playerbase is biased, but as proof of concept, here's one way it could possibly be. In theory, the PBE could be biased to people who inherently dislike change, and thus want to give feedback on it to make sure it's something they're okay with (whereas people who are more accepting of change may feel that things will be okay in the end, and not feel a need to sign up.), and it could be biased towards less competitive players, as competitive players may want to spend their time in ranked as opposed to a different server, and are more likely to simply switch champions if a champion becomes bad.\n\nThese biases may not be the exact ones the PBE displays, but I'm certain the PBE displays some notable bias, if not a very significant amount. And I'm almost certain you understand that the boards (and reddit) display some heavy bias of their own. (remember [this](https://www.youtube.com/watch?v=evjn7_tMRd4)?)\n\nAdditionally, people inherently dislike change and naysayers tend to speak louder than people who are okay with changes, so those are another two reasons to not take this criticism at face value.\n\n>Also it's pretty rude to bring rank into this when you don't play the champion yourself. You could be Master or Challenger, but if you don't actually play Akali then your rank doesn't make you right.\n\nYou missed my point. My point wasn't that they're definitely wrong because you're 'only' plat 5. My point was that they can't be certain of anything, especially the full effects on such a complex game of such a big change (consider that in addition to skillset changes, there are item changes that will interact with her as well). They could be right, yeah, but I think certainly is pushing the envelope quite a bit.","replies":[]}]},{"poster":"Akali is SO HOT","date":"2016-11-06T15:11:24.327+0000","up_votes":4,"down_votes":1,"body":"Yeah basically this:\n\n> [{quoted}](name=Fiora All Night,realm=NA,application-id=3ErqAdtq,discussion-id=JpLL4mJf,comment-id=000000000000000000000000,timestamp=2016-11-06T13:19:16.914+0000)\n>\n> I&#x27;m going to guess that you don&#x27;t actually play Akali, which is why any of these changes look even remotely good to you.\n> \n> If you played Akali, you would know that her W has a cast time. This cast time was kept with the changes, so Akali&#x27;s dash is on a delay which makes it basically useless for dodging any fast-moving skillshots. For slow-moving skillshots, it&#x27;s a lot easier to just walk out of the way and not risk getting hit before the dash goes off.\n> \n> Akali&#x27;s W grants movement speed to her while she is in the shroud. Being able to place her shroud in front of her means that Akali can grant herself a nice MS boost to escape. There&#x27;s still a slight delay on the shroud appearing, but it doesn&#x27;t actually stop her from running away so it works.\n> \n> Akali&#x27;s W also slows enemies so being able to place it behind her lets her slow enemies that are trying to chase her. \n> \n> *The OP (and basically every Akali player testing her on the PBE) have said that she is &quot;clunky&quot; which is NOT the same thing as &quot;mechanically difficult&quot;.* It looks like you like to play Janna. Imagine if Riot changed Janna so that she rooted herself while her Q tornado was charging. People that hate Janna could easily say &quot;this makes her difficult to master&quot; and say the change is good. You would probably say &quot;no, this just makes her clunky to play&quot;. The OP is saying the change is like that - it adds nothing to her gameplay, so there is nothing to &quot;master&quot;, and just makes her feel slower and clunkier. \n> \n> ***When all of the Akali mains are saying the changes are terrible, and all of the casuals that don&#x27;t play Akali think they are kind of interesting or okay, then Common Sense would suggest that the changes favor casuals and are bad for Akali mains.***\n> \n> Also it&#x27;s pretty rude to bring rank into this when you don&#x27;t play the champion yourself. You could be Master or Challenger, but if you don&#x27;t actually play Akali then your rank doesn&#x27;t make you right.\n\nAnd yeah if you're gonna bring up rank in an argument it probably shouldn't be against someone who is in the top 8% in NA lol.  Maybe against someone whose Bronze or Silver, but definitely not Plat.","replies":[{"poster":"MEMEME670","date":"2016-11-07T00:13:35.670+0000","up_votes":1,"down_votes":2,"body":">And yeah if you're gonna bring up rank in an argument it probably shouldn't be against someone who is in the top 8% in NA lol. Maybe against someone whose Bronze or Silver, but definitely not Plat.\n\nYou missed my point. My point wasn't that you're definitely wrong because you're 'only' plat 5. My point was that you can't be certain of anything, especially the full effects on such a complex game of such a big change (consider that in addition to skillset changes, there are item changes that will interact with her as well). You could be right, yeah, but I think certainly is pushing the envelope quite a bit.","replies":[{"poster":"Akali is SO HOT","date":"2016-11-07T00:48:55.376+0000","up_votes":3,"down_votes":0,"body":"I've tested the changes out my self on PBE so I think I know what I'm talking about when I'm making my arguments about this rework for Akali.  I've played this game and Akali since Season 3 so I think I can say that I know a little bit about how changes affect champions.","replies":[{"poster":"MEMEME670","date":"2016-11-07T00:51:50.541+0000","up_votes":1,"down_votes":0,"body":"I don't believe I've ever disagreed with this. I just think saying you're certain of something that is as big of a change as you did is far out of near anyone's league. \n\nI have champions I've been playing since basically the start of open beta, and I still wouldn't say I certainly know how such changes are going to work out, unless they're maybe completely isolated (and this one is the opposite of that, bundled with significant champion and item changes.)","replies":[]}]}]}]},{"poster":"Irelia Bot","date":"2016-11-06T19:40:51.236+0000","up_votes":2,"down_votes":0,"body":"Since you play supports a lot of the time let me provide you with an example of what the kind of nerf akali got would look like on Soraka.\n\nSay they took a quarter second off soraka's self heal landing while reducing the radius by 20% and made her heal for allies have a longer cooldown at all ranks and the heals applied over a 1.5 second period.\n\nThat is basically what they did to akali and it makes her less of a threat at all parts of the game.\n\nIt would make Soraka more \"interesting\" and allow enemies to have \"counter play\" in getting there damage off before a heal was fully applied. but at the price of the champ getting gutted.","replies":[{"poster":"MEMEME670","date":"2016-11-07T00:11:51.069+0000","up_votes":1,"down_votes":2,"body":"This is the same kind of thing they did with raka back when they originally changed her. I was fine with it then and I'd be fine if they did something like that now. Some of the reasons for this I'm aware don't apply to the people upset with akali (a big one being that I would just play whatever support was good), but the biggest reason I'd be okay with it is because I know Riot would be trying to balance her, so after the changes if she was too weak they'd buff her in some way.","replies":[]}]}]},{"poster":"Nik Nikerson","date":"2016-11-06T19:31:10.472+0000","up_votes":1,"down_votes":1,"body":">-The ability to place it where she wants\n-Vision dashing\n-Peel for her team\n-An extra escape with the movement speed buff by placing it in front of her\n\nI'm not so sure this is a bad thing. When an ability has too much utility, it eats up too much of the champion's allotted power budget. Cutting back on the overall utility allows Riot a little more wiggle room to mess with her numbers if and when she needs to be buffed.","replies":[{"poster":"Akali is SO HOT","date":"2016-11-06T20:49:30.015+0000","up_votes":3,"down_votes":0,"body":"For everything they're taking away from her they aren't really adding anything.  Her new passive is inferior to her current passive and E and Ult just got straight up nerfs.  The only true buff she got out of this was immunity to pinks and that itself isn't even that big of a buff.  The change will help bad Akali players use her shroud's invisibility as a crutch, but good Akali players already know how to play around pink wards so this isn't exactly huge.\n\nI would gladly take current shroud that is revealed by pink wards over this lame new gimmicky ability they're trying to call Twilight Shroud.","replies":[]},{"poster":"DeathTheHorseman","date":"2016-11-06T20:29:28.598+0000","up_votes":3,"down_votes":0,"body":"Akali lost 20% DPS in 1 sec window\n\n28% DPS in 3 sec window\n\n34% DPS in 5 sec window.\n\nAkali has a shroud that is by all means worse than what is on live except for the Invisibility part.\n\nSo \n50% Utility on W lost \n+ a THIRD OF HER DPS LOST \n= Angry mains...\n\nIt's a gutting there is no other explanation.\n\nI don't need a flashy blink that has pathetic range (250) and literally puts you on the edge of your shroud after a horrible 0.25 sec cast time.\n\nOld W is better even if it has decaying MS.\n\nDid i Mention she lost her sustain because the bloody passive is wasted if you AA someone with full HP and goes on a 4sec cooldown while leaving you WITH ZERO sustain as a squishy melee ?\n\n\n_**\n\nOh wait I didn't so the bill is:\n\n# A third of DPS nerf +  50% W nerf + No sustain for the first 4 sec of any fights (guess if this is a nerf or not) = Git Rekt \n\nMains are now outraged (not just angry) and about to quit league...\n\nDid I mention RIOT BLATANTLY LIED TO US HERE ON THE BOARDS THAT AFTER THE ASSASSIN UPDATE AKALI WILL BE STRONGER IN HIGH ELO???","replies":[]},{"poster":"Irelia Bot","date":"2016-11-06T19:47:05.609+0000","up_votes":2,"down_votes":0,"body":"they took damage and utility away which is why akali players are hating this change.","replies":[]}]}]}]},{"poster":"ShaolinToilet","date":"2016-11-06T08:14:20.568+0000","up_votes":4,"down_votes":0,"body":"Imagine if you were malicious metal and all your threads got 100 upvote no matter what. Then maybe riot would look.","replies":[{"poster":"Akali is SO HOT","date":"2016-11-06T15:07:42.473+0000","up_votes":5,"down_votes":1,"body":"Yeah that would be great lol.  Maybe if Akali gets a Mordekaiser skin it will work.","replies":[]}]}]}]},{"poster":"umbraˉ","date":"2016-11-06T20:40:28.947+0000","up_votes":4,"down_votes":0,"body":"Lmfao after this Akali is gonna be the 1st weakest champ in the game and is gonna be in dire need of MASSIVE buffs.","replies":[{"poster":"Akali is SO HOT","date":"2016-11-06T20:44:28.567+0000","up_votes":4,"down_votes":0,"body":"Same with Zed","replies":[]}]},{"poster":"The Yetii Rider","date":"2016-11-06T19:19:29.159+0000","up_votes":1,"down_votes":4,"body":"Twilight Shroud gives her 8 seconds of pure invisibility with no counter all game. It doesn't need the extra utility of granting vision or going where ever you want it to.","replies":[{"poster":"DeathTheHorseman","date":"2016-11-06T20:44:58.749+0000","up_votes":3,"down_votes":0,"body":"You do realise that 60% of the damage abilities in the game can hit you even if you are invisible?\n\nAll you need to do to kill akali in her shroud is dump 2k AoE damage inside. (which is not that hard)","replies":[{"poster":"The Yetii Rider","date":"2016-11-06T23:06:56.192+0000","up_votes":1,"down_votes":0,"body":"It is for a top laner.","replies":[{"poster":"DeathTheHorseman","date":"2016-11-07T00:07:45.893+0000","up_votes":1,"down_votes":0,"body":"Impliying that the top laner needs to sit inside the shroud and get hit by her without retaliating....\n\nDude with these DPS nerfs changes her dueling power is gone.\n\nShe barely wins most duels unless she is ahead.\n\nThis new shroud is an insult because it's literally a 250 AoE around you invisibility which is a joke you can't do crap with it unless by some chance you are against a champion who has no AoE damage abilities and has no brain so he decides to stick around inside the pitiful range of your shroud so Akali can trade only when her Q is up.","replies":[{"poster":"The Yetii Rider","date":"2016-11-07T00:40:06.335+0000","up_votes":1,"down_votes":1,"body":"And the old shroud gave her map mobility, chasing and escape potential, it allowed her so much area to roam around when she was near a bush...\n\nAnd that still wasn't healthy.\n\nThey need to nerf Akali until they can VGU her. Leaving her stealth at 8 seconds when there's no pink wards is risky enough.","replies":[]}]}]}]}]},{"poster":"Rhal95","date":"2016-11-07T15:07:49.119+0000","up_votes":1,"down_votes":1,"body":"I can understand why you are upset. They change and nerf the things you like most about your 'bae' but you may just have to change your playstyle and mindset about her to continue being successful with her.\n\nWhen you think about Akali what comes to mind?\n\n* Hybrid Assassin\n* Gapcloser\n* Sustain (lifesteal and shroud)\n\nAkali is usually seen building mostly AP with the exception of maybe Gunblade.\nThis isn't hybrid. \nMaybe this isn't how the new Akali should be build.\nMaybe the new Akali needs more AD then AP. \nMaybe she will finally be a true hybrid instead of a AP assassin with a bit of AD (40 to be exactly. Not many players build much more then Gunblade).\n____________________________________________\n\nYou see the E changes as a flat nerf but did you look at it from the view of a more AD focused build?\nyou get better scalings (+0.1 on AP and +0.1 on AD but changed to bonus AD) and better base damage.\n\n\"But bonus AD is much worse than total AD\" you might say. \nYes and no. \nOf course it is worse if you have the same scalings but if you calculate the increased base damage in you get no loss of damage there.\n\nFormula used: Total AD * ratio + skill damage\n\nOld at level 18: 113 * 0.6 + 130 = 197,8\n\nNew at 18: needed bonus AD * 0.7 + 190 = 197,8\n\nif we solve for the needed bonus AD we get.. 11.\n11 bonus AD at level 18 to get the same damage. Remember that every single point of AD after the first 11 scale better.\nThat is really doable don't you think?\n\nBut lets see how this is early game.\n\nOld at level 1: 58.4 *0.6 + 30 = 65,04\n\nThe new Akali got 70 base damage rank one. \n\nSo the E got buffed. NICE!\n\nYou might say \"But Rhal, the Cooldown got nerfed!\"\nTo what I say why do you even bother? You get a CD reduction if you kill anything with it and your ult got longer CD too. Besides that old Akali cant spam her E because of energy problems. I don't see a nerf here.\n____________________________________________\n\nOkay next point. \nYou say the two hit passive annoys you. Well, yes it should. It slows her burst window but this is the whole point of the assassin rework.\nFizz need to wait 2 sec to apply his increased W dmg.\nTalon got his blink removed, his W slowed and his main dmg now lies on the second instance of W combined with Q.\nKatarina needs to activate her daggers for full damage.\nLeBlanc again needs to wait before applying all her damage.\n...and so on.\n\nEvery single Assassin got his combos delayed so there is more counter play to it. \n____________________________________________\n\nLet's take a look at a combo from Akali.\n\nYou camp in a bush and some idiot walks into you. \nYou get a free Q AA E before they flash away. You simply R AA and complete your combo with that. Enemy dead. You win.\n\nIn lane this is more difficult but Akalis laning phase was never really good.\nYou can Q R AA for a hard to avoid combo. But remember that this combo is almost full AP reliant and AP Akali got nerfed in favour of hybrid Akali.\nSo you ignore the Q part of your combo so your enemy gets less time to react. \nYou attack a minion to restore some health and then jump on them to do AA E. \nWith this combo you deal\n\n(50 per rank in ult + 25% AP) + (5+5per level +50% AP +50% bonus AD) + (40 + 30 per rank in E + 50% AP + 70% bonus AD) + (base AD + bonus AD) = combo damage.\n\nLet's assume you have a Gunblade (80AP + 40AD) and are lvl 11 with E maxed.\n(I have no idea if this is a viable calculation but I think one item at 11 should be really possible.)\nyou would deal\n\n(100 + 20) + (65 + 40 + 20) + (190 + 40 + 28) + (86.5 + 40) = 629.5 damage. \n\nThis is without Q damage, thunderlords and Gunblade active. You may not be able to oneshot people but you can inflict a lot of damage on a combo that is hard to avoid. \nBesides that you can do this combo every 4 seconds (passive).\n\nOld Akali with same items, stats and combo would deal 666 damage.\nSo a dmg loss of about 35. \nNot too bad.\n\nBut you see that even with HALF the base damage on ult you can deal almost the same combo damage because of that buffed E + Passive.\n____________________________________________\n\nMy advice for you and all the other guys flaming at the reworks: deal with it. Riot is thinking about what they are doing even if it doesn't look like it sometimes. You will have to change your playstyle and your itembuilds but the reworked champions will not get pushed into non-existance by it. Just wait till it goes live and see how other people deal with it. \n\nI will try to read the important improvements you mentioned out of your hate-filled post.\n\n* Attack speed\nAkali already has a very high base attack speed but it feels very slow and clunky because of the animation. This is a important change which should be made. \n\n* Possibility to play her tank\nTime will show how badly it will be but right now I don't see a big problem. Her shroud can no longer be used to slow enemys from a distance and her overall stickyness got reduced. Maybe some more bonus AD ratios? ;)\n\n* Ult damage and CD\nSee above, more focus on AD makes ult damage less important.\nLowered stickyness with ult can be compensated with slows from shroud, Gunblade, Protobelt...\nWe have all those items and Akali can build those. Think about Draktharr + Abyssal + Gunblade + Ghostblade + Protobelt.\nThis will be insane.\n\n* Overall clunkyness \nThis may be because of your AP focused builds and playstyle. After all she got reworked and you have to learn to deal with the changes. If she still feels bad some weeks after the live release Riot may have to take a look at this.\n\n* Complains from the mains\nThis is a dangerous topic. Of course do mains know their champs the best but this is also a disadvantage. Mains are often not very flexible when it comes to big changes like this. They see changes they try to play it just like they used to. With smaller buffs/nerfs this is mostly not a problem because it doesn't change the playstyle of a champ. The reworks on the other hand require you to relearn your champ to some degree which is not a good thing for a main as one plays worse while learning.\n____________________________________________\n\nI know that I can't convince you to like the rework but please give it some time before you judge it. In the meantime you can do your best to play her in a way she becomes viable and then continue tilting all the ADCs :)\n\nAs you may have noticed I'm not really an Akali main. I just try to take a neutral look at things before judging them.\nI think Riot did a good job with the reworks and I'm excited for the preseason. \n\nGreetings\nRhal","replies":[{"poster":"Are","date":"2016-11-07T18:17:25.878+0000","up_votes":2,"down_votes":0,"body":"** \"I'm not really an Akali main\"**\n\n1) She's an AP burst assassin, though she has some AD ratios. She has a total of 1.966 AP ratio. She has .6 AD scaling, on ONE skill. There is no reason to be building AD for damage. The only AD items she'd buy are gunblade and maybe a Scimitar against certain teams.\n\nNew Akali has a 1.3 bonus AD ratio, 0.5 on her passive which has a 4 second cooldown with the damage coming second, and 0.7 on her E, which got it's cooldown tripled. If you're looking for burst, AD is NOT the way to go. 629 damage is about half someone's HP at level 11, which isn't very good for \"burst\" with first item. It's OKAY damage. She shouldn't settle for half baked burst.\n\nAlso, E changes are a flat out nerf because in team fights, you most likely won't be killing someone with E, so the CD stays 3 seconds, which is a lost of on demand damage from 1 second cd. Because it deals relatively the same damage on AP Akali, this is a straight up nerf. Current E is also better for AD Akali too, since it allows her to deal out damage continuously, but since it no longer has a 1s CD, AD Akali dps is getting nerfed.\n\n2) Two hit passive is clunky. Akali already had a large bursting window. Unless she's ridiculously ahead, she can not one shot someone with one rotation. As team fights go, a perfect rotation is hard to achieve, so she usually follows the Q>R>AA>E>wait CD (4s)>Q>AA format which takes AT LEAST 4 seconds, which is a long time for an assassin. At current, Akali's FULL burst (3 rotations) takes a minimum of 12 seconds, and you won't even be able to complete it perfectly most of the time (Q>wait>R>AA>Q>AA / repeat 3 times)\n\n3) If she IS becoming a hybrid assassin going the way you're talking about, we have reason to be angry because she's being drastically changed for someone who's getting a \"minor rework\". Even after this rework, AD is not the optimal build and Q max is still better than E max. There isn't any reason to NOT be using Q for damage.\n\nHere is Akali's perfect rotation (Assume we attack a minion first for damage on auto)\n\nQ1 > R after Q CD > AA + 2nd passive > Q2 > AA\n\n(260 + 72) + (100+20) + 85 + (60 + 40 + 20) > (260 + 72) + 85 = 1075\n\nIt's a 446 damage difference, which is extremely significant. AD Akali is not, and will not do more damage than AP Akali, even after this rework.\n\n4) We're trying to voice out our opinions to avoid another Mordekaiser from happening. There was a ton of noise stirred up from the Mordekaiser mains, but Riot would not listen. They also got told to \"wait and try\" the rework when it comes out. They didn't like it, and only the diehard Mordekaiser fans stayed behind. Akali is getting nerfed A LOT, and is losing a ton of skill (rip shroud mechanics) and clutch, so there is reason to be angry. Her playstyle is changing a decent amount too since she's gated much more by CD.","replies":[]}]},{"poster":"Teridax68","date":"2016-11-07T00:45:29.524+0000","up_votes":2,"down_votes":0,"body":"This is good feedback, and I both agree with the points and like the way this is presented. Akali does need some gameplay changes, but her W honestly feels like the ability that needed the fewest, if any at all. Its blink just doesn't work all that well on her, and takes power from her other abilities. Her E especially needs to be made more interesting, since it's currently just an energy dump with a fairly unsatisfying payoff, and changing her passive could have been a good opportunity to improve her Q as well, since its mark component now has the same gameplay and effect as her second empowered auto. I think her new passive could be great with a few adjustments to its numbers and her autoattack animations, but otherwise her other changes don't really feel like they're going in the right direction for her. Akali's main issue is that she's an assassin that plays and often builds like a bruiser, and extending her kill time isn't going to help with that.","replies":[]},{"poster":"Sassmast3r","date":"2016-11-06T15:56:03.650+0000","up_votes":1,"down_votes":0,"body":"May I ask you about your first point regarding her passive? You stated that you aren't satisfied with the fact that she has to autoattack for that part of her kit and that she has a clunky animation for her autoaattacks. What I'm not understanding is, if Akali already has to AA now (since E no longer procs it) to detonate her Q mark, doesn't the passive damage instance happen simulatneously with her Q detonation? Why wouldn't you want this? This is tremendously more damage on an ability that's already strong. Putting the heal on the second AA makes it so that Akali players cannot enjoy sustain during an assassination, but still get to enjoy it in the laning phase when they're AAing to farm all the time and need it desperately.","replies":[{"poster":"Akali is SO HOT","date":"2016-11-06T16:08:48.924+0000","up_votes":3,"down_votes":1,"body":"Well since the heal comes first the passive damage will never coincide with her Q proc unless you auto attack a minion first to get the heal out of the way which will be much harder to do mid and late game.  Even after playing her multiple seasons I still whiff my auto attacks sometimes when I'm trying to do a Q proc which is very frustrating so making it so she has to auto attack even more for damage is something they need to consider because of how slow her animation is.  Speeding it up or giving her some sorta AS buff for two auto attacks (similar to Sivir) or something to help her more reliably proc it would be nice.","replies":[{"poster":"Sassmast3r","date":"2016-11-06T16:38:29.256+0000","up_votes":1,"down_votes":0,"body":"Oh! I thought the damage came first, my bad. I like the AS buff idea actually, but they'd probably rather wait until they're ready to give her a VGU and make her AAs much more fluid. What if they made the damage happen first, however? Do you think that would be a bit fairer or do you think that would be way too much damage happening at once and that it would become toxic?","replies":[{"poster":"Akali is SO HOT","date":"2016-11-06T17:24:39.373+0000","up_votes":1,"down_votes":0,"body":"Her burst is already much weaker on PBE so it wouldn't be overpowered or anything if her damage came first","replies":[]}]}]}]},{"poster":"Zepper","date":"2016-11-06T16:06:05.685+0000","up_votes":2,"down_votes":1,"body":"Upvote for good feedback","replies":[]},{"poster":"Jesus Is My King","date":"2016-11-06T04:35:56.396+0000","up_votes":2,"down_votes":1,"body":"you got my vote, well said.","replies":[]},{"poster":"Akali is SO HOT","date":"2016-11-08T18:04:29.466+0000","up_votes":1,"down_votes":0,"body":"b","replies":[]},{"poster":"Cobra1066","date":"2016-11-07T01:39:08.582+0000","up_votes":1,"down_votes":0,"body":"As an Akali main,(although not as good as you) I agree with you on e and r changes although I prefer the old passive as it gives Akali that feeling  of unlimited potential that made me play her over a year ago. The shroud changes are OK with me as they seem to make her less kiteable pre 6.","replies":[]},{"poster":"GULAG 4 U","date":"2016-11-06T13:39:58.672+0000","up_votes":1,"down_votes":0,"body":"Meanwhile I'm just sitting here.... not understanding anything... cause I've never played akali...","replies":[]},{"poster":"Limmie","date":"2016-11-06T11:27:25.052+0000","up_votes":1,"down_votes":0,"body":"I agree. Keep the nerfs if you must, but absolutely revert the changes to her W. Nobody needs that stupid dash and nobody wants it.","replies":[]}]}