{"poster":"Akali is SO HOT","date":"2017-01-19T22:05:55.652+0000","title":"I don't know why so many people treat this game like it's life and death","subforum":"Gameplay","up_votes":48,"down_votes":20,"body":"This game has basically 0 impact on your life unless you&#039;re in the top 0.1% of the playerbase and get recruited to a pro team which most people are not.  If you are only playing to win, then that means you are only having fun about 50% of the time.  Losing a game isn&#039;t the end of the world.  Going into a game with the goal of winning is a good thing, but if that&#039;s all that matters to you then you shouldn&#039;t be playing a game like this.  I&#039;d rather enjoy spending 20 - 40 minutes of my life having fun, rather than stressing out about winning the game.  If someone is trolling or flaming you does it really matter?  You only have to deal with them for another 20 minutes and then you can move on and get into another game.  Getting mad about it and crying won&#039;t solve the problem and will just waste your time.\r\n\r\nEnd rant.","replies":[{"poster":"Jax Jungle","date":"2017-01-19T22:13:55.463+0000","up_votes":10,"down_votes":9,"body":"You are wrong. A lot of us devote a majority of our time and life to this game. It effects you if all you do is play this game.","replies":[{"poster":"DrCyanide","date":"2017-01-19T22:22:12.417+0000","up_votes":21,"down_votes":2,"body":"You can dedicate time and effort to something without treating it like it's life and death.\n\nCould you imagine a pianist who told other people they should cut their fingers off and burn their piano over a few missed notes during a recital? That's the type of behavior some people take with League. It doesn't matter how much time or effort you put in, that type of attitude is unhealthy.\n\nContrast it with someone like Voyboy. You can put in time and effort into the game and still be chill when things don't go your way.","replies":[{"poster":"Melledoneus","date":"2017-01-20T03:18:48.215+0000","up_votes":6,"down_votes":0,"body":"Dyrus is a better example.\n\nLiterally took naps during LCS games and poured red bull into his water bottle to stay awake.","replies":[]},{"poster":"Asayake 5150glow","date":"2017-01-19T22:46:20.197+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=DrCyanide,realm=NA,application-id=3ErqAdtq,discussion-id=aI5E0EUQ,comment-id=00030000,timestamp=2017-01-19T22:22:12.417+0000)\n>\n> You can dedicate time and effort to something without treating it like it&#x27;s life and death.\n> \n> Could you imagine a pianist who told other people they should cut their fingers off and burn their piano over a few missed notes during a recital? That&#x27;s the type of behavior some people take with League. It doesn&#x27;t matter how much time or effort you put in, that type of attitude is unhealthy.\n> \n> Contrast it with someone like Voyboy. You can put in time and effort into the game and still be chill when things don&#x27;t go your way.\n\nThat type of person probably exists, and has nothing to do with how people treat League.\n\nAt least... it probably doesn't...","replies":[{"poster":"Melledoneus","date":"2017-01-20T03:19:30.984+0000","up_votes":2,"down_votes":0,"body":"That person does exist. We call them 'crazy.'","replies":[]}]},{"poster":"Jax Jungle","date":"2017-01-19T22:24:27.872+0000","up_votes":2,"down_votes":1,"body":"I Didnt say im extremely immature with insults to people for mistakes. Im simply saying League is a huge part of my life and i get irritated when people dont try as hard as they can","replies":[{"poster":"DrCyanide","date":"2017-01-19T22:27:41.353+0000","up_votes":2,"down_votes":0,"body":"I think the OP is referring to those people who are immature and insult others for their mistakes. Being irritated is fine.","replies":[]}]},{"poster":"Troll for Trump","date":"2017-01-20T04:06:48.993+0000","up_votes":3,"down_votes":2,"body":"> Could you imagine a pianist who told other people they should cut their fingers off and burn their piano over a few missed notes during a recital? \n\nIn a duet for a formal competition? Definitely, yes.","replies":[{"poster":"DrCyanide","date":"2017-01-20T04:13:55.191+0000","up_votes":2,"down_votes":1,"body":"The recital isn't significantly more important than the 300 or so others you're doing that year either. No significant prizes for performing well either, the most you'll get is a jacket.\n\nUnder those circumstances, which mirrors Ranked rather well, there's no need for that.","replies":[{"poster":"Troll for Trump","date":"2017-01-20T04:22:59.367+0000","up_votes":2,"down_votes":1,"body":"If you're doing a lot of them, then you have  a image you need to build up.\n\nIf you aren't doing a lot of them, it's weighed much more heavily.","replies":[]}]}]}]}]},{"poster":"ZILLAGULA","date":"2017-01-19T22:12:00.478+0000","up_votes":10,"down_votes":11,"body":"It's a competitive game for christ's sake. You're supposed to be serious about it.","replies":[{"poster":"Akali is SO HOT","date":"2017-01-19T22:13:13.990+0000","up_votes":17,"down_votes":2,"body":"Being serious about a game doesn't mean you have to treat it like life and death.","replies":[{"poster":"Surfer Ashe","date":"2017-01-20T04:26:29.473+0000","up_votes":1,"down_votes":0,"body":"Nobody except the extreme .1% do.","replies":[]}]}]},{"poster":"Big Lincoln","date":"2017-01-19T22:08:13.667+0000","up_votes":16,"down_votes":2,"body":"i just want to play the champs i like without feeling like i'm being a detriment to my team just for picking them\n\nthat's all i complain about","replies":[{"poster":"Akali is SO HOT","date":"2017-01-19T22:12:42.926+0000","up_votes":5,"down_votes":2,"body":"Same :^) {{champion:84}}","replies":[{"poster":"Big Lincoln","date":"2017-01-19T22:15:07.548+0000","up_votes":2,"down_votes":1,"body":"{{champion:106}} {{champion:86}} {{champion:30}} {{champion:223}} \n\n:^(","replies":[{"poster":"Akali is SO HOT","date":"2017-01-19T22:17:32.087+0000","up_votes":3,"down_votes":2,"body":":^^) {{champion:163}}","replies":[]},{"poster":"TequilaZombie","date":"2017-01-20T09:10:46.186+0000","up_votes":1,"down_votes":0,"body":"To be honest, in an season that has everyone blowing up in seconds, I can see how Karthus might be a strong pick.","replies":[]}]},{"poster":"Flitchee","date":"2017-01-20T09:48:36.275+0000","up_votes":1,"down_votes":0,"body":"I'm replying to this as in a way of getting to speak with you directly. I will never flame someone, but i do get angry when I lose in ranked because someone decides that they want to fuck around and have a good time. I don't find this game fun to play from a casual perspective. I'm a competitive guy, and I want a competitive atmosphere which is why i play ranked primarily. When somebody decides they want to come into a game, and just have fun, I'm okay with that, as long as them just having fun doesn't put a hamper onto what I primarily want to do, which is have fun and win games. I'm not okay with it when people come in, don't give a flying fuck and fuck around with no intentions of doing anything useful. Just my two cents.","replies":[]}]},{"poster":"Cryo00","date":"2017-01-20T00:15:21.966+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure that unless you are super high elo, you can play all the champions in the game and do fine.","replies":[{"poster":"Troll for Trump","date":"2017-01-20T04:07:31.141+0000","up_votes":2,"down_votes":0,"body":"It's the opposite. Picks are more important in low elo, while high elo has a ton of onetricks","replies":[]}]},{"poster":"Saewin","date":"2017-01-20T16:44:53.145+0000","up_votes":1,"down_votes":0,"body":"{{champion:31}} NOMNOMNOMNOMNOM","replies":[]}]},{"poster":"Bladerunner7777","date":"2017-01-20T00:18:28.504+0000","up_votes":6,"down_votes":1,"body":"I HATE Riot so much, they don't know how to balance their game!!! Imbeciles!!!\n\nThat's why I've been playing for 2+ years!","replies":[]},{"poster":"Ralanr","date":"2017-01-19T22:08:56.573+0000","up_votes":6,"down_votes":1,"body":"I just want to do stuff in the game without feeling entirely useless. That's all.","replies":[{"poster":"midnight oil24","date":"2017-01-19T22:15:25.359+0000","up_votes":2,"down_votes":0,"body":"That's how I used to feel. Then I started playing jungle and felt better about myself. Mostly because I wasn't just farming in lane. It was a placebo, tbh.","replies":[{"poster":"Jax Jungle","date":"2017-01-19T22:16:56.140+0000","up_votes":2,"down_votes":1,"body":"only  thing you have to worry about is that when a game goes south you have to worry about everyone blaming the jungler(just my past experiences with jg main) maybe not everyone","replies":[{"poster":"Karunamon","date":"2017-01-19T23:10:32.992+0000","up_votes":3,"down_votes":0,"body":"People blame positions other than support when things go south? {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Spice POWAH","date":"2017-01-20T04:13:02.537+0000","up_votes":2,"down_votes":0,"body":"here's how to blame people:\n\nSupport- blame mid for no MIA\nADC- blame support for not helping enough\nMid: blame jungler for not counter-ganking\nTop: blame ADC for feeding\nJungler: blame top for not rotating","replies":[{"poster":"R1NGW0LF","date":"2017-01-20T16:33:35.765+0000","up_votes":1,"down_votes":0,"body":"wrong sir I blame everyone for not pinging, even myself, a lot could be avoided if communication on teams was better.\nand when I say that I don't mean ping the same thing 80 times in a row just ping a couple and i'll look, the 80 times thing makes me not look more often as it feels like spam.\n\n{{champion:16}}","replies":[]}]}]}]}]},{"poster":"Bladerunner7777","date":"2017-01-20T00:17:01.723+0000","up_votes":2,"down_votes":0,"body":"uhh\n\nhttp://i0.kym-cdn.com/photos/images/newsfeed/000/744/952/c65.jpg\n\nI don't know what else you want","replies":[]},{"poster":"Melledoneus","date":"2017-01-20T03:21:29.472+0000","up_votes":1,"down_votes":0,"body":"Not to be that guy, but don't you play two of the strongest and most influential tanks in the game?\n\nNot to say top lane is still really cut-off from everything as always, so it doesn't matter.","replies":[{"poster":"Ralanr","date":"2017-01-20T03:47:27.188+0000","up_votes":1,"down_votes":0,"body":"I don't play them all the time.","replies":[{"poster":"Melledoneus","date":"2017-01-20T03:59:50.234+0000","up_votes":1,"down_votes":0,"body":"Who do you feel useless with?","replies":[{"poster":"Ralanr","date":"2017-01-20T04:56:50.962+0000","up_votes":1,"down_votes":0,"body":"Kled, and Supports that aren't Braum. \n\nAlso whenever I'm jungle.\n\nBeen on a massive losing streak since last week. ","replies":[{"poster":"Melledoneus","date":"2017-01-20T05:37:42.127+0000","up_votes":1,"down_votes":0,"body":"Whenever I'm on a losing streak, I just play my main or try something I don't usually do. That's how I discovered my love for Jhin, Yorick, and Tahm.\n\nAlso, it helps to duo with someone who knows what they're doing.","replies":[{"poster":"Ralanr","date":"2017-01-20T12:10:21.816+0000","up_votes":1,"down_votes":0,"body":"That's why I'm playing Kled. I also play Darius a little.","replies":[{"poster":"Melledoneus","date":"2017-01-20T22:26:48.422+0000","up_votes":1,"down_votes":0,"body":"No Sion?","replies":[{"poster":"Ralanr","date":"2017-01-20T22:28:55.707+0000","up_votes":1,"down_votes":0,"body":"Recently I ran into the issue where my ranked games don't need another tank. \n\nAnd I tilt more when I lose with a champion I'm good with.","replies":[{"poster":"Melledoneus","date":"2017-01-20T22:41:44.512+0000","up_votes":1,"down_votes":0,"body":"Ah. Try with one of the juggerpushers like Yorick or Illaoi. If you learn them you can basically divide and tilt their team.\n\nIt'd also be worth learning other roles so you're not pigeonholed into top/supp.","replies":[{"poster":"Ralanr","date":"2017-01-20T23:12:48.029+0000","up_votes":1,"down_votes":0,"body":"I have been picking up Yorick, but sometimes I manage to fuck up my Q so much that I hit another minion instead of last hitting a low health one.  Or hit the enemy laner.\n\nIt's embarrassing.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Spaceman5pff","date":"2017-01-20T16:03:12.225+0000","up_votes":4,"down_votes":0,"body":"Geez, you know your Graves threads really had me thinking that this game was the most important thing in your life.\n\nhttps://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcSvucfwCiql_EdMZ87ciq5fiYZ85YaZqqnBnt6mQlMhJPJBrbTvn2Ft1g","replies":[]},{"poster":"Ok sure but why","date":"2017-01-20T00:45:01.691+0000","up_votes":4,"down_votes":1,"body":"it's less fun when you go 17/1 and riot says \"oh man you only got 200 cs, B-\" just to make you feel like shit","replies":[{"poster":"idontgiveabother","date":"2017-01-20T02:06:13.068+0000","up_votes":4,"down_votes":1,"body":"towers\nwards\nobjectives\nmore objectives\nassists\n\nNot to sound like an ass but they do exist for a reason, the game isn't just based around your mechanical prowess","replies":[]}]},{"poster":"MrWasjig","date":"2017-01-20T12:00:02.376+0000","up_votes":2,"down_votes":0,"body":"Simple answer. Passion and investment. \n\nThink about it, are there any other activities you partake in that get you steamed up if you fail? Like I said, passion and investment. It can make something feel like the most important thing in the world, _**especially **_ in the heat of the moment. \n\nChances are most people once they've calmed down after the fact, look back at themselves and realise \"Phew, I got really worked up there\" and have a little laugh at themselves....well that's what I do anyway :P","replies":[]},{"poster":"Irelia Bot","date":"2017-01-20T09:05:45.220+0000","up_votes":2,"down_votes":0,"body":"Once you escape the realms of victory at all costs because nothing else matters you have truly found the only way to defeat League.","replies":[]},{"poster":"NoGodsNoMasters","date":"2017-01-20T09:03:45.323+0000","up_votes":2,"down_votes":1,"body":"Because the game is a very competitive one.  On top of that, the time invested into getting half-way decent at the game is not insubstantial.  When someone invests their time into something, it's a deep seated human need to see a reward for time invested:  See: Relationships, Careers (IE: raises for performance, seniority, etc) because OUR time is limited on larger scale.  \nOn the other side of your argument, if you want people to not take it seriously maybe there shouldn't be ranked?  There is a serious element to the game, it's part of what makes it popular.","replies":[]},{"poster":"Shadowz","date":"2017-07-25T10:11:42.310+0000","up_votes":1,"down_votes":0,"body":"Speaking from experience people who flame and complain because they are losing (especially if they are complaining in a normals), dont have much going on in their lives, It boggles my mind on how winning or losing a game effects you in real life, why does a rank matter to you so much?, will you show your rank to people in real life and expect them to praise you?? In reality no one gives a fuck (and your not getting laid anytime soon). People who complain and flame, play the game the whole day and try to justify their no lives by winning a game on league. If you wanna be competitive do in something productive so you you can actually move on in life. Oh yea and all these cocky no life silver kids in normals, im pretty sure their all like ages 13 - 16 with no lives after school something like that.","replies":[]},{"poster":"Chembaron Yamada","date":"2017-01-21T09:47:17.210+0000","up_votes":1,"down_votes":0,"body":"{{champion:203}} Because it is, my friend.\n\nSerious note: Flaming doesn't help and many people really exaggerate (just had one guy today who said he wishes me to die in real life.... it was a normal game). Sure, you can get mad in that game. I am mad too, if I get a leaver/afker for the 3rd time in a row. But you just should complain in front of your monitor, not in chat. I do that as well, I can vent a bit and don't affect anyone. Then I just report the actual flamers after the match and move on.","replies":[]},{"poster":"Revali","date":"2017-01-20T03:05:36.613+0000","up_votes":1,"down_votes":0,"body":"a lot of people are this way about any game that has a competitive scene, people play to win\n\nthey don't give a shit if they're enjoying the game or not, they only like seeing that victory screen, and will do anything to get it.\n\n\noverwatch has toxic shitheads the same way, hell even Isaac has people like that who go for the leaderboards on the daily runs.","replies":[]}]}