{"poster":"schiavoni","date":"2018-10-21T18:55:49.172+0000","title":"razas?","subforum":"Jugabilidad, balance y narrativa","up_votes":3,"down_votes":0,"body":"porque en universo si vas a colecciones estan los vastayas y los darkin?\r\n\r\nreitero, los vastaya estan bien, pero los darkins no eran humanos? o entonces porque no cuentan a todos los asendidos?\r\n\r\no es que despues del ataque de los targonianos les hicieron otra raza?","replies":[{"poster":"VikingoATR","date":"2018-10-21T21:56:11.406+0000","up_votes":2,"down_votes":0,"body":"tenes a los bk y al dark lord tmb pero t recomiendo los sm subis mas rapido","replies":[{"poster":"KarmaUnder","date":"2018-10-21T22:09:11.256+0000","up_votes":1,"down_votes":0,"body":"pero si no tenes una elf como que no esperes pvpear bien...","replies":[{"poster":"Vipher Tormentor","date":"2018-10-22T13:31:36.225+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KarmaUnder,realm=LAS,application-id=xQmJPO8F,discussion-id=E0ALiAT5,comment-id=00010000,timestamp=2018-10-21T22:09:11.256+0000)\n>\n> pero si no tenes una elf como que no esperes pvpear bien...\n\nno se pero a mi dame un MG y destrozo anos(? {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"CamaleonaBugeada","date":"2018-10-21T20:51:46.525+0000","up_votes":1,"down_votes":0,"body":"Pensalo así, los Darkin son \"parásitos\" que toman el cuerpo de un humano para conseguir su verdadera forma, es decir, los darkin son el \"huesped\" y los humanos son el \"host\", actualmente conocemos la existencia de 4 Darkin aunque estaba confirmado que eran 5 los que quedaron luego de la masacre: \n1-Aatrox, la espada de los oscuros, pudo dominar por completo a su host, y actualmente ya no queda nada del humano que un día fue (puede haber cambiado el lore con el rework, pero así era).\n2-Rhaast, la guadaña de los oscuros, aún está luchando con Kayn, quien es su host, Kayn intenta someter su poder y usarlo para si, Rhaast intenta tomar el control por completo del cuerpo y recuperar su verdadera forma.\n3-Varus, el arco de los oscuros, el caso más raro, ya que Varus había sido sellado en un estanque, pero en la guerra de Ionia, Valmar y Kai, dos cazadores y amantes cayeron en este estanque (uno de los 2 había sido herido de muerte por un ataque noxiano), Varus, una los guerreros cayeron, tomó de sus cuerpos sus partes y creó el suyo propio, sin embargo, al ser tres mentes en el cuerpo de una (la de los amantes y la suya propia) Varus aún no ha logrado tomar el control por completo y desarrollar todo su potencial. (Si conoces Ben10, sería algo así como AlienX, aunque Varus tiene un poco más de poder que Ben, reseña friki, si, pero efectiva si la captas)\n4-La hermana de Varus, no se sabe nada de ella, solo fue nombrada.\n5-No se sabe nada acerca del 5to.\n\nCreo que no era precisamente lo que preguntaste, pero bueno, me inspiré xD\n\nSee ya{{sticker:slayer-jinx-wink}}","replies":[{"poster":"schiavoni","date":"2018-10-21T21:25:14.521+0000","up_votes":1,"down_votes":0,"body":"entiendo a lo que quieres llegar pero uno nace con una determinada raza y listo, no se puede cambiar, a menos que la obra divina te cambie, cosa que no explica porque no agregan a los otros asendidos, o porque no agregan otras razas? los tipos de las islas de las sombras? yordles? o cualquier otro","replies":[{"poster":"CamaleonaBugeada","date":"2018-10-21T21:50:34.296+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=schiavoni,realm=LAS,application-id=xQmJPO8F,discussion-id=E0ALiAT5,comment-id=00000000,timestamp=2018-10-21T21:25:14.521+0000)\n>\n> entiendo a lo que quieres llegar pero uno nace con una determinada raza y listo, no se puede cambiar, a menos que la obra divina te cambie, cosa que no explica porque no agregan a los otros asendidos, o porque no agregan otras razas? los tipos de las islas de las sombras? yordles? o cualquier otro\n\nAhí está el problema, Aatrox, Rhaast y Varus, no son el bicho ese, son el arma, Aatrox es la espada, esa es su raza.\n\n¿Por qué no están aún los Yordles, Criaturas del Vacío, la raza de Skarner, y los dragones (ver lore de Shyvanna)? Por que estos lores aún no están del todo desarrollados en el nuevo Universo, cuando hagan un cambio importante a alguno de estos personajes o introduzcan algún nuevo campeón, aparecerán.\n\nOtra raza que falta, y que pronto tendremos más conocimientos es la de los Ángeles, es decir, las hermanas Kayle y Morgana, las cuales tienen confirmado Rework para la siguiente season.\n\nSee ya{{sticker:slayer-jinx-wink}}","replies":[]}]}]}]}