{"poster":"Yeniboi","date":"2016-11-15T00:42:18.004+0000","title":"Why is ashe 33% of the adcs I seen in silver and below","subforum":"Gameplay","up_votes":2,"down_votes":4,"body":"Seriously, like. Whats the draw? \r\n\r\nAm I in the elo that doesn&#039;t watch youtube or care about meta picks?\r\n\r\nNot down putting the pick I&#039;m seriously curious.","replies":[{"poster":"Iridocyclitis","date":"2016-11-16T06:47:42.616+0000","up_votes":1,"down_votes":0,"body":"She's a really strong pick considering that her kiting skills are amazing with that passive and it takes almost no ability to kite with her as long as you can avoid the skillshots. I play Ashe just because she's a solid pick that I have an easy time with therefore a stable pick in ranked for scrubs like me. Although other ADC's are meta right now, players should play who they feel comfortable rather than a completely awkward skill set. It also so just happens that Ashe is a fairly beginner adc.","replies":[]},{"poster":"DemainaNyx","date":"2016-11-16T06:02:53.137+0000","up_votes":1,"down_votes":0,"body":"Ashe is a utility carry.  If you fall behind early, you still carry a ton of utility in her kit to still be useful to your team.  Most other carries require damage to be useful, but with Ashe if you can land an ultimate, it's almost a guaranteed kill if someone follows it up.  \n\nHaving engage is so important.  As an ADC you normally have to wait for your support or top laner to do something or pray your mid lands a stun and the others follow up.  Meanwhile, you're standing there waiting for this to happen, which may never happen.  At least by having CC in your control, you can initiate a fight when you see fit instead of waiting for someone else to grow some balls and go in, which is what most other ADCs have to do.","replies":[]},{"poster":"Requiemsfire","date":"2016-11-16T03:25:55.197+0000","up_votes":1,"down_votes":0,"body":"Ashe is a good pick in general with plenty of utility in her kit, her major downside is that she is immobile like a few other adc's  and is a little more vulnerable.","replies":[]},{"poster":"Kr1sys","date":"2016-11-16T03:25:23.521+0000","up_votes":1,"down_votes":0,"body":"she's cheap and her ult can start or end teamfights, something that low elo players find it hard to decide which is needed.","replies":[]},{"poster":"iLLp","date":"2016-11-15T01:04:41.649+0000","up_votes":1,"down_votes":4,"body":"because she attracts trash","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-11-15T01:21:59.686+0000","up_votes":2,"down_votes":1,"body":"says the mundo player who dont know why a full crit build cait kills him","replies":[{"poster":"iLLp","date":"2016-11-16T03:22:17.266+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=MrFawknSunshine ,realm=NA,application-id=3ErqAdtq,discussion-id=oVgZKn2l,comment-id=00060000,timestamp=2016-11-15T01:21:59.686+0000)\n>\n> says the mundo player who dont know why a full crit build cait kills him\n\nSo just because someone can go full damage means i should be blown up?\n\nyet assassins just got nerfed for the same thing? \n\ndon't give me that shit","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-11-16T03:23:48.033+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=o f u c k,realm=NA,application-id=3ErqAdtq,discussion-id=oVgZKn2l,comment-id=000600000000,timestamp=2016-11-16T03:22:17.266+0000)\n>\n> So just because someone can go full damage means i should be blown up?\n> \n> yet assassins just got nerfed for the same thing? \n> \n> don&#x27;t give me that shit\n\nyou still have no clue why you die to adcs do you ?","replies":[]}]}]},{"poster":"Drehirth","date":"2016-11-15T03:10:45.709+0000","up_votes":1,"down_votes":0,"body":"out of all the times people got mad at me when playing ashe none have ever called me trashe and you have also missed this opportunity so shame on you.","replies":[]}]},{"poster":"Limmie","date":"2016-11-15T02:58:18.119+0000","up_votes":1,"down_votes":0,"body":"She has a lot of utility so she's one of the few ADCs that can still be relevant even when behind. It's a good choice if you're not confident that you're gonna win lane.","replies":[]},{"poster":"Stick In Mudd","date":"2016-11-15T01:28:59.009+0000","up_votes":1,"down_votes":0,"body":"I see Ashe, every time I pick Jhin. Such a fun lane.","replies":[]},{"poster":"Luigrein","date":"2016-11-15T01:02:32.415+0000","up_votes":1,"down_votes":0,"body":"I think part of it might be safety?  By which I don't necessarily mean laning safety but rather relevance safety.  If I'm playing Ashe and I fall behind the other ADC, I know I can still meaningfully contribute vision and CC even if my damage is lacking.  Obviously it would be BETTER if I also had damage, but having a good side of utility ensures I can contribute to a team fight from behind.\n\nOr for a non game play angle, she's very cheap to unlock as a permanent addition to your roster, which can be an important selling point for people who are trying not to spend real money on the game.  Even if now they have more IP than they know what to do with, Ashe may still be a comfort pick from when it was an issue.","replies":[]},{"poster":"Sona Ping","date":"2016-11-15T00:46:06.728+0000","up_votes":1,"down_votes":0,"body":"No, that means that Ashe is meta for your bracket of play.  As a side note, she is also strong enough to get a nerf recently.\n\nAnd a reason she is is popular among new players, is well... simply because playing with her comes at the price tag of 450IP.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-11-15T00:47:20.483+0000","up_votes":1,"down_votes":0,"body":"strong enough to be nerfed? WHAT? \n\n48.28% win rate http://na.op.gg/champion/ashe/statistics/adc","replies":[{"poster":"Sona Ping","date":"2016-11-15T00:54:14.088+0000","up_votes":1,"down_votes":0,"body":"That's the _current_ win-rate.  She received nerfs on patches 6.17, 6.18, and 6.20.","replies":[]}]}]},{"poster":"1wolfpack","date":"2016-11-15T00:46:16.241+0000","up_votes":1,"down_votes":0,"body":"she is cheap to buy with IP, i believe they use her as one of the practice champions in their tutorials.\nand she looks like a strong ranged champion based on her overall look.","replies":[]},{"poster":"Miror B","date":"2016-11-15T00:44:37.715+0000","up_votes":1,"down_votes":0,"body":"Ashe has cc literally built into her auto attacks. Even if you whiff arrows constantly (which few of them do, due to the fact that even a point-blank hit stuns people and silver/bronze is full of people who want to land that \"450ft homerun\"), literally all you need to do is right click people and you can help your team no matter how awful you are.","replies":[]},{"poster":"oSEXYPLATYPUSo","date":"2016-11-15T00:43:45.117+0000","up_votes":1,"down_votes":0,"body":"hmm aoe damage, slow, vision scales great into late game, utility , simple kit and an ult that has a hard cc","replies":[]},{"poster":"Tyrone Lannister","date":"2016-11-15T00:43:44.478+0000","up_votes":1,"down_votes":0,"body":"Her ult is engage","replies":[]},{"poster":"Rock MD","date":"2016-11-15T01:08:54.088+0000","up_votes":1,"down_votes":1,"body":"The lower in elo you are the slower the trickle down meta is.\n\nSo things that are top tier but get nerfed to trash won't stop seeing picks/bans until like 3-ish months after.\n\nOn a side note Ashe isn't bad at all.","replies":[]}]}