{"poster":"UltradestroyerX","date":"2018-03-19T14:26:18.329+0000","title":"Was ist der Sinn??? (Jungle-Krabbler)","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":13,"body":"Leute \\o/ \r\n\r\nWelchen Sinn macht es, wenn man als Mitspieler nur im Jungle rumkriecht und einem das sonstige Spiel schnurzpiepegal ist? Erst dachte ich ja man w&uuml;rde durch das Killen von Monstern im Jungle mehr angerechnete Monster bekommen und somit mehr EP. Also probiere ich das aus... aber das stimmt wohl nicht. Gut... man levelt seine F&auml;higkeiten wohl relativ schnell. Und man bekommt auch etwas Gold. Aber welchen Sinn macht das nur im Jungle zu campen?\r\n\r\nBitte habt doch auch mal ein Herz f&uuml;r die, die auf den Lanes spielen \\o/ Vor allen Dingen im PVP \\o/ \r\n\r\nWas &uuml;brigens auch unglaublich nervig ist: Der Jungler camped da so am Rand herum und sieht, dass ein Monster auf der Lane low an Health ist. Sein Mitspieler hat auch noch genug Leben. Da kommt der Jungler aber aus dem Jungle gekrabbelt und klaut einem den Kill. In solchen Momenten w&uuml;rde ich mir w&uuml;nschen es gebe eine F&auml;higkeit die &quot;Mitspieler abschlachten&quot; heisst (und mit der man sein eigenes Leben aufladen kann *tr&auml;um*)","replies":[{"poster":"Amycos Cyrus","date":"2018-03-19T23:33:27.509+0000","up_votes":5,"down_votes":0,"body":"Der Jungler ist wie der Support. Er KANN eine aggressive Funktion besitzen (entsprechend dem Poke-Support), jedoch kann er auch Tank- bzw. Engage-Funktionen besitzen. (entspricht den Tank-Support) und als Letztes kann er noch eine positionsspezifische Sonderfunktion (entspricht dem Heal/Shield-Support) einnehmen. Counterjunglen, Sichterzeugung, das sichern von Lanes etc.\n\nJungler haben jedoch alle die Funktion das Team um fehlende Komponenten zu ergänzen, die durch die Lane-Meta nicht möglich sind. (Splitpusher, Tank, Off-Tank, Supporter, Carry etc.)\n\n> Welchen Sinn macht es, wenn man als Mitspieler nur im Jungle rumkriecht und einem das sonstige Spiel schnurzpiepegal ist? \n\nDem Jungler ist das Spiel nicht schnutzpiepegal. Er agiert genauso als Teil des Teams wie ADC Support Midlaner und Toplaner. Jeder hat seine Funktion, die nur er erfüllen muss/kann.\n\n > Erst dachte ich ja man würde durch das Killen von Monstern im Jungle mehr angerechnete Monster bekommen und somit mehr EP.\n\nJgl-Monster geben (dank Smite-Item) mehr EXP als Lane-Vasallen. Alle Camps sind 4 CS wert. Alles in allem habt der Jungler jedoch nicht die Funktion das höchste Level zu haben. (Meist ist er in der Mitte. Niedriger als Top und Mid, aber höher als ADC und Sup.)\n\n> Gut... man levelt seine Fähigkeiten wohl relativ schnell. Und man bekommt auch etwas Gold. \n\nWenn man nur farmt: Ja! (Deshalb gibt es \"Farmer\"-Jungler, die zu Beginn des Spiels nicht viel machen. (Yi etc.) Jedoch ab einem gewissen Item-Set + Level extrem rasieren)\nJe häufiger ein Jungler jedoch gankt, desto mehr EXP, die er haben könnte gehen ihm verloren + er reduziert auch die EXP der Lane die er gankt. (EXP-Sharing) Dies führt dazu, dass ein Jungler eher gezielt gankt, wenn er es überhaupt tut.\n\n> Aber welchen Sinn macht das nur im Jungle zu campen?\n\nEs eröffnet die Möglichkeit statt einer High-Skaling-Lane (also Solo-Lanes, die schneller leveln, da sie keinem EXP-Sharing unterworfen sind) drei derartige \"Lanes\" zu unterhalten. (Top Mid und Jgl).\nDie einzigen 2 Positionen, die EXP-Sharing betreiben sind Sup und ADC. (Sup ist \"unwichtig\", es ist hierbei sogar sinnvoll teilweise nur zu roamen, um den ADC \"zu leveln\"; ADC hat durch sein starkes Item-Skaling + seinen Autoattack-Fokus nicht die Notwendigkeit durch Level an Stats und Fähigkeiten zu gelangen.)\n\n> Bitte habt doch auch mal ein Herz für die, die auf den Lanes spielen \\o/ Vor allen Dingen im PVP \\o/\n\nWie schon gesagt, das hängt von den Champions auf der Lane, dem Jungler selbst und dem gegnerischen Jungler ab und kann durch temporäre Ereignisse (Drachen etc.) stark beeinflusst werden.\n\n> Was übrigens auch unglaublich nervig ist: Der Jungler camped da so am Rand herum und sieht, dass ein Monster auf der Lane low an Health ist. Sein Mitspieler hat auch noch genug Leben. Da kommt der Jungler aber aus dem Jungle gekrabbelt und klaut einem den Kill. In solchen Momenten würde ich mir wünschen es gebe eine Fähigkeit die \"Mitspieler abschlachten\" heisst (und mit der man sein eigenes Leben aufladen kann träum)\n\nDas ist wirklich kleinlich. XD\nOb du nun ein Minion mehr oder weniger an Gold hast, ist häufig egal und dank dem EXP-Sharing von Vasallen erhälst du sogar gut die Hälfte der EXP.","replies":[]},{"poster":"TheFoxRox","date":"2018-03-19T15:49:19.861+0000","up_votes":3,"down_votes":0,"body":"1. Auch wenn der jgl den kill nimmt: Du kannst dafür ne Menge farmen. win-win.\n\n2. Gäb es keinen Jungler, sondern stattdessen 2 auf der Lane, hättest weniger Gold und würdest langsamer leveln.","replies":[]},{"poster":"Nycaria","date":"2018-03-19T14:32:02.068+0000","up_votes":3,"down_votes":0,"body":"Beschwerst du dich gerade dass es die Jungle Position gibt oder missverstehe ich das einfach nur?","replies":[{"poster":"Vogeljunges","date":"2018-03-20T07:27:13.036+0000","up_votes":1,"down_votes":0,"body":"ja, weil er die Position des Junglers missversteht :D","replies":[]}]},{"poster":"SuicidePlank","date":"2018-03-19T14:30:52.887+0000","up_votes":2,"down_votes":0,"body":"Leicht salty mein Freund? Lass mich raten, in deinem letzten Game ist der Jungler einmal auf die Lane gelaufen und hat 'nen Minion genommen. Übrigens, wenn alle Lanes reingepusht sind und die Lane wenig Ganksetup hat, ist es besser einfach nur zu (counter)-junglen.","replies":[{"poster":"UltradestroyerX","date":"2018-03-19T15:01:55.968+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Laufplanke,realm=EUW,application-id=KYnfKGf0,discussion-id=me2ZWqLi,comment-id=0000,timestamp=2018-03-19T14:30:52.887+0000)\n>\n> Leicht salty mein Freund? Lass mich raten, in deinem letzten Game ist der Jungler einmal auf die Lane gelaufen und hat &#x27;nen Minion genommen. Übrigens, wenn alle Lanes reingepusht sind und die Lane wenig Ganksetup hat, ist es besser einfach nur zu (counter)-junglen.\n\nSalty? Samma \\o/ Leckst Du gerade an meiner schwitzigen Hand rum, oder was??? \n\nJa, genau :( Er hat das rote Zauberkapuzenminion abgeknallt, das gerade richtig low und kurz vor dem krepieren war. Ich hab noch gesagt: LASS ES DURCH! ES MUSS ZUR GROSSMUTTER! Aber, Du kannst bestimmt erraten, dass der Typ den Warwick gespielt hat. Und da ging das dann nicht. Zum Schluss, als wir dann in der Enemy-Base ankamen haben sich die Minions bitterlich gerächt. Und die Ashe hat ihm die Wampe aufgeschlitzt, paar Wackersteine vom Turm reingekloppt. Und zack hat man ihn den Inhibitor runter geschmissen. Was meinst Du wie überrascht ich war heraus zu finden, dass das also ein ziemlich tiefer Brunnen ist?! So langsam komm ich der Wahrheit auf die Schliche!","replies":[{"poster":"SuicidePlank","date":"2018-03-19T15:25:58.131+0000","up_votes":2,"down_votes":0,"body":">  In solchen Momenten würde ich mir wünschen es gebe eine Fähigkeit die \"Mitspieler abschlachten\" heisst \n\n'Ich bin nicht salty, nur dumm'\n\nWarum genau du jetzt nach einem ziemlichen QQ-Thread solche Kommentare ablässt, weiß ich leider nicht :)","replies":[]}]}]},{"poster":"Noxempire","date":"2018-03-19T14:50:07.298+0000","up_votes":2,"down_votes":0,"body":"Da du anscheinend neu im Spiel bist, hier eine Erklärung; \n\nEs ist wichtig die Jungl Camps zu clearen, da man sonst die XP die man von den Jungl Monstern bekommt nicht genutzt wird. Spielt man bspw. Duo Top Lane bekommen beide nur die Hälfte aller XP.","replies":[]},{"poster":"colonel cranc","date":"2018-03-19T14:44:58.510+0000","up_votes":1,"down_votes":1,"body":"eh\nja also ja\nstimme dir da zu\nMhm","replies":[]}]}