{"poster":"Tjarven","date":"2016-05-06T08:58:19.672+0000","title":"Werden Spieler die auf Deutsch beleidigen weniger gebannt?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":5,"body":"Ich habe in den letzten Tagen wieder einige Leute reporten m&uuml;ssen,da sie die ganze Zeit nur beleidigt haben und diese Spieler wurden auch locker 10 St&uuml;ck bestraft (Es kam immer das Pop-Up auf).Diese Spieler haben alle auf Englisch beleidigt.Nun gab es auch Spieler die auf Deutsch beleidigt haben und diese wurden anscheinend nicht bestraft,da sie danach immer noch Spiele absolvieren konnten.\r\nNun ist meine Frage ob das System &uuml;berhaupt die Deutschen Beleidigungen genauso gut wie die Englischen erkennt?","replies":[{"poster":"Humpelstilzche","date":"2016-05-06T09:08:40.659+0000","up_votes":2,"down_votes":0,"body":"Die PB Systeme verstehen alle Sprachen die halbwegs häufig gesprochen werden. Die deutsche Community ist eine der größten weltweit, d.h. die PB Systeme verstehen das genauso gut wie englisch.","replies":[{"poster":"Sakunosuke Oda","date":"2016-05-06T09:30:02.678+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=KYnfKGf0,discussion-id=B8VpLB8a,comment-id=0000,timestamp=2016-05-06T09:08:40.659+0000)\n>\n> Die PB Systeme verstehen alle Sprachen die halbwegs häufig gesprochen werden. Die deutsche Community ist eine der größten weltweit, d.h. die PB Systeme verstehen das genauso gut wie englisch.\n\nWas du noch hinzufügen musst das die PB Systeme intelligent sind also auch neue Schreibweisen entdecken und die dann auch sperren :p","replies":[{"poster":"eingew","date":"2016-05-06T09:57:22.255+0000","up_votes":2,"down_votes":0,"body":"Nur so nebenbei und n bisschen Offtopic: Ich finde der Begriff \"Intelligenz\" wird im Bezug auf Programme viel zu freizügig verwendet. :D Ich meine, derartige Programme schaffen schon deutlich mehr als manch andere und manche KIs schaffen auch mehr als ein Mensch es kann oder je können wird... aber das ist dann doch eher eine sehr spezifische Effektivität, die da zum Vorschein kommt, als Intelligenz an sich.","replies":[{"poster":"DerPunkt","date":"2016-05-06T17:28:31.904+0000","up_votes":2,"down_votes":0,"body":"Um hier mal dazu zu Senfen. Es geht hier nicht nur um Intellekt. Es geht viel mehr um das wichtige Wort \"verstehen\".\n\nDas System selber versteht nicht nur halbwegs jede Sprache, sondern alle toten, existierend und jemals kommenden Protosprachen. \nLiegt daran, dass verstehen, hier ein sehr klein gefasster Bereich ist, wenn man überhaupt davon sprechen kann. Was das system im Endeffekt macht, ist die Chatverläufe reporteter Spieler zu analysieren, Die werden mit den von anderen Verglichen, daraus folgert man, dass bestimmte Zeichenstränge, Wortstränge und Phrasierungen, als Reportgrund gewertet werden. hat das System diese oft genug festgestellt, wird es wenn es so etwas findet aktiv.\n\nStellt sich die Frage, wie sachen wie GJ, oder GG oder Hallo nicht gebannt werden. Denn die sagen ja auch flamer häufig. Jaaa das System schaut sich nicht nur Worte an, zu nächst wurde es mal sicherlich mit beleidigungen gefüttert, anhand derer es bestimmte Raster erkannt hat, die zu Flamern passen, wie eben beschrieben. Gleichzeitig, schaut es sich aber auch alles andere an. Sprich Verläufe neutraler Spieler und geehrter Spieler (daher ist das Ehrungs system auch recht wichtig, ohne dass wir es direkt merken) anhand dessen kann es sehen welche Worte neutral und welche Positiv sind. So erkennt das System im Endeffekt welche Flamer sich gebessert haben oder gar seid einiger Zeit positiv zum Spiel beitragen.\n\nToll wie simpel das ist? Oder einfach nur dinge anschauen und verleichen, in nem maßstab von millionen. Kann kein mensch, aber um einen PC zu bauen der unserer Gehirnkapazität entspricht bräuchten wir trotzdem alle rechner dieser Welt. Und dann ist der Speicher noch nicht mit drin :D \n\nDaher zum Thema intelligenz. Es kommt tatsächlich darauf an was man macht. Wir können dinge aus Kontexten begreifen. Rechner können dinge sehr schnell mit einander vergleichen.","replies":[]},{"poster":"Humpelstilzche","date":"2016-05-06T10:44:09.034+0000","up_votes":2,"down_votes":0,"body":"Auf Kommentar wie diesen passt find ich immer der folgende Satz:\n\n\"Die Frage ist nicht ob Maschinen denken können, sondern ob wir es können\".\n\nWas Denken oder Intelligenz überhaupt ist, ist keinesfalls geklärt und man macht es sich ein wenig zu leicht wenn man die Intelligenz von Maschinen abstreitet, ohne die selben Maßstäbe an den Menschen anzulegen. \n\nMenschen haben z.B. auch sehr spezifische Fähigkeiten, während wir in zahlreichen anderen Bereichen von Tieren übertroffen werden. Wenn also Maschinen nicht intelligent sind weil sie nur in bestimmten Bereichen effektiv sind, sind auch Menschen nicht intelligent.","replies":[]},{"poster":"hshtagniemehrcdu","date":"2016-05-06T10:04:12.834+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=B8VpLB8a,comment-id=000000000000,timestamp=2016-05-06T09:57:22.255+0000)\n>\n> Nur so nebenbei und n bisschen Offtopic: Ich finde der Begriff &quot;Intelligenz&quot; wird im Bezug auf Programme viel zu freizügig verwendet. :D Ich meine, derartige Programme schaffen schon deutlich mehr als manch andere und manche KIs schaffen auch mehr als ein Mensch es kann oder je können wird... aber das ist dann doch eher eine sehr spezifische Effektivität, die da zum Vorschein kommt, als Intelligenz an sich.\n\nSkynet und die Zylonen widersprechen.","replies":[]}]}]}]},{"poster":"hshtagniemehrcdu","date":"2016-05-06T09:17:40.899+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tjarven,realm=EUW,application-id=KYnfKGf0,discussion-id=B8VpLB8a,comment-id=,timestamp=2016-05-06T08:58:19.672+0000)\n>\n> diese wurden anscheinend nicht bestraft,da sie danach immer noch Spiele absolvieren konnten.\n\nDu erkennst keine Chat-Restrictions.\nAlleine deswegen ist das stalken anderer Accounts nur sehr eingeschränkt \"nützlich\"","replies":[]}]}