{"poster":"Merkabah","date":"2015-10-07T19:20:34.229+0000","title":"¿Cuál es su skin de Thresh favorita?","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"Hola. {{champion:412}} \r\n\r\nMe encanta Thresh, lo juego bastante y me considero decente con &eacute;l. Ahora que todas sus skins est&aacute;n disponibles para comprar, me preguntaba cu&aacute;l de ellas era mi preferida... &iquest;cu&aacute;l es la de ustedes? {{champion:412}}  {{champion:412}} {{champion:412}}\r\n\r\n\r\n{{champion:429}}","replies":[{"poster":"nifu","date":"2015-10-08T14:27:41.088+0000","up_votes":1,"down_votes":0,"body":"soy muy manco con el. pero me gusta mucho el campeon. tengo todas menos terror profundo.","replies":[]},{"poster":"rokushoger","date":"2015-10-08T11:30:14.704+0000","up_votes":1,"down_votes":0,"body":"Obviamente luna de sangre, mi ícono lo dice por si solo ajjajja","replies":[]},{"poster":"PH0ENIX","date":"2015-10-08T00:28:02.458+0000","up_votes":1,"down_votes":0,"body":"Me acuerdo cuando me compre la 1ra skin y fue de Thresh luna de sangre, la verdad me encanta Thresh amo el personaje y en todas las partidas que juego con el me va bien en la bot lane! ... Pero mi Skin favorita es la de Campeonato que ya la tengo :)","replies":[]},{"poster":"Sir Crucifix ","date":"2015-10-07T20:54:55.153+0000","up_votes":1,"down_votes":0,"body":"A mi me gusta la ssw , no me gustan Los equipos de la lcs y esos noobs , pero el skin Blanco de tresh me gusta","replies":[]},{"poster":"martincarp","date":"2015-10-07T19:56:09.505+0000","up_votes":1,"down_votes":0,"body":"Definitivamente la de campeonato, la compré el primer día que salió allá por octubre del 2013. Recuerdo que cuando salió había empezado a jugar con Thresh hace un par de semanas y me sentía super cómodo con él, y justo le sacaron el aspecto y fue como \"GRACIAS RITO, TE AMO SIR DAL!!11!1!\".","replies":[]},{"poster":"JACKY FANBOY","date":"2015-10-07T19:36:30.303+0000","up_votes":1,"down_votes":0,"body":"me gusta la de SSW de hecho la tengo, y antes de comprarme la de luna de sangre o submarino, la de campeonato ya que habra que esperar mucho para conseguirla","replies":[]},{"poster":"Curtedz","date":"2015-10-07T19:43:23.546+0000","up_votes":1,"down_votes":1,"body":"Tengo todas las de Thresh, la de SSW y la de Campeonato tienen una buena animación de \"Retorno a Base\". Es un buen campeón y sus mecánicas me gustan, te recomiendo la de SSW tambien o la de Campeonato.","replies":[]}]}