{"poster":"i r d pro","date":"2015-04-03T20:36:12.415+0000","title":"Mi hanno rubato l'account e devo pagare 2600 RP per riaverlo!!??!! aiutatemi a capire.","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"1 mese e mezzo fa ho provato ad accedere nel mio account ma mi diceva che era stato spostato in un altra regione , immediatamente come da regola ho contattato il supporto che fornisce la riot games, dopo una lunga conversazione siamo arrivati alla conclusione che il mio account &egrave; stato spostato in turchia e per riportarlo in ew ovest devo pagare 2600 RP , con la giustificazione che IO SONO RESPONSABILE DELLA SICUREZZA DEL MIO ACCOUNT e che se uno entra nel mio account e mi sposta di regione .... io devo pagare.\r\nMi sono informato e sulle condizioni d&#039;uso  c&egrave; scritto che io sono responsabile soltanto di &quot;MANTENERE LA PRIVACY DELLE MIE CREDENZIALI DI LOGIN&quot; (paragrafo numero &quot;III&quot; punto &quot;C&quot;)\r\n,cosa che io ho fatto ovviamente, ... e non che io sono responsabile della sicurezza del mio account, che &egrave; molto ben diverso .\r\nal momento della registrazione , al settaggio del username e della password , il sistema mi disse che la mia password era forte come tipo di combinazione  e la mia e-mail era stata confermata per la mia sicurezza .\r\nio ho fatto tutto il possibile che la riot games mi potesse offrire a livello di sicurezza ,\r\n\r\nquindi non credo proprio che la sicurezza dell&#039; account sia mia responsabilit&agrave;\r\ne sulle condizioni non c&egrave; niente riguardo la sicurezza dell&#039;account ma soltanto sul fatto di non condividere le proprie credenziali di login cosa che in questo caso non deve essere presa in considerazione perch&egrave; io non MAI condiviso il mio username o password  a NESSUNO.\r\n\r\n\r\nCREO QUESTA DISCUSSIONE SOLTANTO PER CAPIRE BENE SE DAVVERO IO SONO RESPONSABILE O E&#039; RESPONSABILTA&#039; DELLA RIOT GAMES GARANTIRE LA SICUREZZA DI UN ACCOUNT DOVE E&#039; POSSIBILE SALVARE UNA CARTA DI CREDITO.\r\n\r\naspetto risposte, vorrei sapere cosa ne pensate a riguardo ,sia a livello di regolamento sia morale.","replies":[{"poster":"Polarize","date":"2015-04-03T21:33:25.046+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/KjJ16EMR-account-rubato-in-turchia\n\n\n\nWe are onto something?\nMhmhmhmh\nSgamo","replies":[{"poster":"SirZeel","date":"2015-04-03T21:38:20.690+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Xaviness,realm=EUW,application-id=98NGV4Al,discussion-id=E0uj8gAw,comment-id=0002,timestamp=2015-04-03T21:33:25.046+0000)\n>\n> http://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/KjJ16EMR-account-rubato-in-turchia\n> \n> \n> \n> We are onto something?\n> Mhmhmhmh\n> Sgamo\n\nMe scemo.\nMe non capisce.\nMe spieghi?","replies":[{"poster":"Polarize","date":"2015-04-03T21:41:17.487+0000","up_votes":1,"down_votes":0,"body":"Niente, vedo gombloddi e macchinazionyh ovunque.\nSecondo me è la stessa persona.\nIo metto le basi, voi mettete i cervelli.","replies":[{"poster":"i r d pro","date":"2015-04-03T22:07:17.208+0000","up_votes":1,"down_votes":0,"body":"per quale motivo scusa?","replies":[{"poster":"Polarize","date":"2015-04-03T22:25:28.603+0000","up_votes":2,"down_votes":0,"body":"1) il tempi descritti nei 2 thread coincidono\n2)il tizio del thread da me linkato sembrava abbastanza idiota, ha capito che ha fatto una stronzata e adesso sta cercando di recuperare i soldi buttati\n3)quali sono le probabilità che 2 account di 2 italiani vengano rubati nello stesso periodo in(o portati, se è vero) in turchia?\nE che tutti e due i proprietari vengano a scrivere sul forum?\n\nPs: mi sto divertendo a fare il forumdetective\nPss:ci dai il nome dell'account? Per il bene superiore.","replies":[{"poster":"i r d pro","date":"2015-04-03T22:35:53.868+0000","up_votes":1,"down_votes":0,"body":"1) Intendi che io sarei voluto andare in Turchia per arrivare challenger però mi sono accorto che ero una pippa e vorrei tornare indietro? Comunque OK te lo posso mandare in privato il nome dell account\n\n\n2)E se lui fosse quello che mi ha spostato l ACC in Turchia e ora che io sono riuscito a rispostare in EW però temporaneamente bannato e lui cerca di riprenderlo così? \n\n3) comunque credo che basti un moderatore che controlla i miei ip di gioco e quello di colui che me la spostato a meno che non sia riuscito a mascherarlo con un tipo di hack a noi sconosciuto evidentemente\nHo fatto una piccola ricerca e ho letto che al tempo esisteva un hack che permetteva di entrare nella account di uno attraverso il proprio browser e da li poterlo spostare di regione o di spenderli RP come succede nel video che ho postato nel commento quello non so se lascia tracce a livello di IP se fosse così avremmo risolto.","replies":[]}]}]}]}]}]},{"poster":"Nabbomaster","date":"2015-04-03T21:15:09.777+0000","up_votes":2,"down_votes":0,"body":"come il 100% della gente a cui succcedi ti sarai loggato su uno di quei siti dove promettono rp gratis, o ti sei beccato un keylogger o un parete amcio a cui l'hai detto avra' fatto altrettanto","replies":[{"poster":"i r d pro","date":"2015-04-03T21:26:00.335+0000","up_votes":1,"down_votes":0,"body":"evidentemente 99%","replies":[]}]},{"poster":"Elles93","date":"2015-04-03T20:49:15.561+0000","up_votes":2,"down_votes":2,"body":"Ciò che importa è che tu sia tornato in possesso del tuo account.\nNon so cosa tu abbia fatto per farti violare l'account, tuttavia è solo tua responsabilità mantenere la segretezza delle tue informazioni.\nNessuno può scoprire le tue credenziali a meno che tu non le dica o venga attratto in un tentativo di phishing.\nChiunque entra in possesso del tuo account e spende i tuoi IP/RP lo fa in modo permanente: la Riot non restituirà mai i punti spesi, nè se sei tu a spenderli, nè se è uno scammer.\nCiò che dici, cioè che devi spendere 2600 RP per riaverlo, non corrisponde a verità. Il supporto ti farà rientrare in possesso del tuo account gratuitamente, ma per riportarlo nella regione d'appartenenza devi spendere ulteriori RP. Nel frattempo potrai giocare insieme ai Turchi.","replies":[{"poster":"SirZeel","date":"2015-04-03T20:58:21.835+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Elles93,realm=EUW,application-id=98NGV4Al,discussion-id=E0uj8gAw,comment-id=0000,timestamp=2015-04-03T20:49:15.561+0000)\n>\n> Nessuno può scoprire le tue credenziali a meno che tu non le dica o venga attratto in un tentativo di phishing.\n\nEcco, io vorrei che questo mito venisse sfatato.\nLa Riot non gestisce un sistema di sicurezza tanto perfetto; esistono, sono esistiti ed esisteranno persone in grado di rubare account altrui senza che nessuno gli abbia fornito le credenziali d'accesso. A prescindere che questo particolare utente abbia fornito i suoi dati o meno, è ora di smetterla di credere che la Riot sia meglio della ESET.\n\n> [{quoted}](name=Elles93,realm=EUW,application-id=98NGV4Al,discussion-id=E0uj8gAw,comment-id=0000,timestamp=2015-04-03T20:49:15.561+0000)\n>\n> Chiunque entra in possesso del tuo account e spende i tuoi IP/RP lo fa in modo permanente: la Riot non restituirà mai i punti spesi, nè se sei tu a spenderli, nè se è uno scammer.\n\nFalso anche questo.\nPiù volte, a detta di utenti, sono stati restituiti IP/RP spesi da i ladri di account.","replies":[{"poster":"Jay Kenton","date":"2015-04-04T07:28:05.376+0000","up_votes":2,"down_votes":1,"body":"> esistono, sono esistiti ed esisteranno persone in grado di rubare account altrui senza che nessuno gli abbia fornito le credenziali d'accesso.\n\nSai come? Hackerando non tanto i database Riot, bensì quelli di un sito collegato tipo, chessò, Lolking. La gente usa stesso username e pass quindi...\n\nRecentemente per dire hanno hackerato Twitch...","replies":[]},{"poster":"Elles93","date":"2015-04-03T21:16:04.344+0000","up_votes":2,"down_votes":2,"body":"Fosse così semplice allora verrebbero rubati facilmente tutti gli account di tutti gli streamer più famosi di LoL. In realtà no, non c'è modo di conoscere la tua combinazione di credenziali senza avere il tuo indirizzo IP.\nPer quanto riguarda la seconda cosa, mi risulta che vengano restituiti solamente quando le operazioni illecite sono palesi, cioè quando un account viene svuotato dei suoi IP comprando rune fino a esaurimento IP.","replies":[{"poster":"SirZeel","date":"2015-04-03T21:18:41.370+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Elles93,realm=EUW,application-id=98NGV4Al,discussion-id=E0uj8gAw,comment-id=000000000000,timestamp=2015-04-03T21:16:04.344+0000)\n>\n> Fosse così semplice allora verrebbero rubati facilmente tutti gli account di tutti gli streamer più famosi di LoL. In realtà no, non c'è modo di conoscere la tua combinazione di credenziali senza avere il tuo indirizzo IP.\n> Per quanto riguarda la seconda cosa, mi risulta che vengano restituiti solamente quando le operazioni illecite sono palesi, cioè quando un account viene svuotato dei suoi IP comprando rune fino a esaurimento IP.\n\n1) Dove hai letto nel mio post che io abbia scritto che sia \"così semplice\"?\n2) Questo entra in contraddizione con quanto hai scritto poco sopra, ovvero: \"Chiunque entra in possesso del tuo account e spende i tuoi IP/RP lo fa in modo permanente: la Riot non restituirà mai i punti spesi, nè se sei tu a spenderli, nè se è uno scammer.\"","replies":[{"poster":"Elles93","date":"2015-04-03T21:27:10.589+0000","up_votes":2,"down_votes":2,"body":"Il fatto delle rune è l'unica eccezione.\nE se non è così semplice, perchè mai uno dovrebbe impegnarsi per rubare un account così invece di uno famoso e pieno di contenuti?","replies":[{"poster":"SirZeel","date":"2015-04-03T21:33:05.717+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Elles93,realm=EUW,application-id=98NGV4Al,discussion-id=E0uj8gAw,comment-id=00000000000000000000,timestamp=2015-04-03T21:27:10.589+0000)\n>\n> Il fatto delle rune è l'unica eccezione.\n> E se non è così semplice, perchè mai uno dovrebbe impegnarsi per rubare un account così invece di uno famoso e pieno di contenuti?\n\nPer lo stesso motivo per il quale i ladri vengono a casa mia a prendersi 2.000€ di roba invece di andare da Johnny Depp a prendersi qualche centinaio di migliaia di dollari.\n\nA parte che la premessa \"Se non *fosse* così semplice\" non si collega in nessun modo logico alla conseguenza che hai scritto.\nNon vedo come la semplicità della cosa possa farmi cambiare bersaglio.\n\nTuttavia.\n\nLo capisci che se qualcuno è tanto idiota da rubare l'account a uno che fa gli LCS, in mezz'ora la situazione è tornata come prima?\nSolo un cretino potrebbe pensare che sia una buona idea rubare l'account di uno famoso e pieno di contenuti.\nGiusto un deficiente potrebbe ipotizzare di fare una cosa del genere.\nDeve essere un decerebrato per aver avuto questo pensiero.","replies":[]},{"poster":"i r d pro","date":"2015-04-03T21:39:05.186+0000","up_votes":1,"down_votes":0,"body":"Anche loro secondo te hanno condiviso le proprie credenziali o volevano rp gratis da un sito non uffciale?","replies":[]},{"poster":"i r d pro","date":"2015-04-03T21:34:48.020+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=s0bWg5-8X8E  guardati questo... poi ne riparliamo tentativo di cambiare regione ... solamente che lui era in gaming","replies":[]}]}]},{"poster":"Jay Kenton","date":"2015-04-04T07:28:53.962+0000","up_votes":1,"down_votes":0,"body":"> Fosse così semplice allora verrebbero rubati facilmente tutti gli account di tutti gli streamer più famosi di LoL.\n\nIn effetti una volta è successo e la Riot ha sistemato le cose per loro.","replies":[]}]}]},{"poster":"i r d pro","date":"2015-04-03T21:03:36.430+0000","up_votes":1,"down_votes":0,"body":"purtroppo io non sono tornato in possesso del mio account , è vero che è mia responsabilità mantenere segrete le mie informazioni ma io ti posso assicurare che non le ho condivise con nessuno ,se no non sarei \"indignato\" di quel che è successo ,me ne sarei assunto le mie responsabilità  e credo che l'account sia stato spostato quando ancora il trasferimento in turchia era ancora gratis.\n\nil punto è che se io ho fatto tutto il possibile che riot games offre a livello di sicurezza e non ho condiviso le mie informazioni come faccio io ad essere responsabile di ciò che è successo?\nP.S. : non posso entrare in turchia mi dice che la combinazione username e password sono inesistenti .","replies":[{"poster":"Elles93","date":"2015-04-03T21:14:27.070+0000","up_votes":2,"down_votes":3,"body":"Allora la cosa è ancora più grave, perchè non ti sei accorto di essere stato aggirato.\nEsistono mille metodi diversi per rubarti l'account, ma tutti si basano su un concetto simile: ti mandano un link, tu ci clicchi, si apre un sito uguale a quello di LoL, tu inserisci le tue credenziali e il gioco è fatto: te l'hanno rubato.\nProbabilmente stai usando il supporto nel modo sbagliato: devi seguire [questo](https://support.riotgames.com/hc/it/articles/201751694-Recuperare-il-tuo-account) procedimento, includendo tutti i dettagli utili. Ti consiglio di usare il supporto in lingua inglese, sono più celeri e io mi sono sempre trovato bene.\nRicordati, ovviamente, di specificare che il tuo server iniziale era euw e ora è quello turco.","replies":[{"poster":"i r d pro","date":"2015-04-03T21:25:33.138+0000","up_votes":1,"down_votes":0,"body":"Conosco perfettamente le tipologie di raggiro , e credimi di certo non vado a inserire le mie credenziali in un sito non sponsorizzato ufficialmente da riot games.","replies":[]}]}]}]},{"poster":"anagoor","date":"2015-04-04T07:28:50.406+0000","up_votes":1,"down_votes":0,"body":"> Hai provato a entrare con le tue credenziali in Turchia?\n\n> P.S. : non posso entrare in turchia mi dice che la combinazione username e password sono inesistenti .\n\nsecondo me ci ha provato","replies":[]},{"poster":"BluFoxer","date":"2015-04-04T06:15:51.678+0000","up_votes":1,"down_votes":0,"body":"Guarda io la vedo così: se hai skin e/o molti champ importanti su quell'account, se ci hai speso tempo e fatica io ti consiglio di pagare gli rp, tanto saranno sui 25 euro credo, non è una spesa cosi mastodontica per account fatto bene.\n{{champion:9}} ","replies":[]},{"poster":"Frattaglia","date":"2015-04-03T23:35:17.916+0000","up_votes":1,"down_votes":0,"body":"Allora prima di tutto devi scrivere al supporto dicendo che vuoi riavere l'accesso al tuo account, poi vedrai come spostarlo.\nTi faranno una marea di domande per avere la certezza che sia tuo.\n\nUna volta che l'avrai riottenuto dovrai chiedere di annullare le ultime operazioni che ha fatto il tuo account.\n\nHai provato a entrare con le tue credenziali in Turchia?","replies":[{"poster":"i r d pro","date":"2015-04-04T00:59:21.354+0000","up_votes":1,"down_votes":0,"body":"ho già scritto e vuole questi 2600 RP non a cause delle mie informazioni l unica giustificazione è stata che era mia responsabilità la sicurezza del mio account\n\nnon riuscivo ad entrare in turchia con le mie credenziali \nattualmente l'account si trova in ew  temporaneamente bannato fino al pagamento di 2600RP se no posso ritrasferirlo in turchia.","replies":[]}]},{"poster":"Judge Drakoo","date":"2015-04-03T23:41:31.974+0000","up_votes":1,"down_votes":0,"body":"Se ti hanno rubato un account tuo (creato da te e con cui giocavi te) il supporto giocatori ti aiuterà a recuperarlo, chiedendoti informazioni personali che solo tu potrai fornire. Non so risponderti sullo spostamento di server, sono tutte questioni che solo il supporto giocatori può controllare e risolvere.","replies":[{"poster":"i r d pro","date":"2015-04-04T00:45:19.987+0000","up_votes":1,"down_votes":0,"body":"ho già contattato il supporto giocatori ma continuano a dirmi che se voglio avere il mio account senza modificazioni (ovvero in ew ovest)\ndevo pagare 2600 RP nonostante avessi dato tutte le informazioni non ha accettato la mia richiesta , dando come giustificazione NON l'invalidità dei miei dati personali ma dicendo che era mio dovere mantenere la sicurezza del mio account nonostante ,come sopra citato, io avessi fatto tutte le procedure di sicurezza previste da riot games.","replies":[]}]}]}