{"poster":"Dodop","date":"2017-11-26T20:40:43.488+0000","title":"NA LCS: il sistema di franchising e i mega-investimenti","subforum":"Esport","up_votes":5,"down_votes":0,"body":"Salve a tutti ragazzi del forum, sono Dodop, un player amatoriale di LoL attualmente gold elo, ma particolarmente interessato alla parte competitiva di questo gioco.\r\nCon questo post volevo proporre una nuova rubrica basata sull&#039;Esport di LoL, a scopo informativo ma anche basata sul dibattito e sul pensiero della community riguardo ad alcuni argomenti legati al competitive, la cui continuazione e frequenza dipender&agrave; ovviamente dal vostro interesse.\r\n\r\nIn questa prima &quot;puntata&quot; della rubrica vorrei parlare dei cambiamenti a livello competitivo avvenuti in questa pre-season, in particolare della rivoluzione del sistema di LCS avvenuta in Nord America. Per chi non avesse seguito l&#039;ambiente competitivo post-Worlds (con l&#039;ennesima delusione dei team NA), il circuito LCS americano, d&#039;accordo con la Riot, ha deciso innanzitutto di inserire un budget minimo di ingresso per la lega (escludendo di fatto societ&agrave; economicamente pi&ugrave; deboli come Team Dignitas e Immortals), dopo aver rifiutato la richiesta di migrazione da parte di alcuni team europei tra cui i G2, per poi trasformare la lega in un franchise stile NBA, abolendo cio&egrave; ogni sistema di retrocessione (le leghe inferiori come l&#039;ex NA CS diventeranno campionati a parte). In questo modo quindi soltanto le societ&agrave; pi&ugrave; stabili economicamente potranno rimanere nella prima divisione.\r\nAlcuni dei team rifiutati dalla Riot sono stati sostituiti da societ&agrave; della massima serie di basket nord americana (**100 Thieves**, fondato dai Cleveland Cavaliers, **Clutch Gaming**, fondato dagli Houston Rockets, **Golden Guardians**, fondato dai Golden State Warriors) e il gigante Optic Gaming, il team rivelazione della stagione competitiva di Call of Duty.\r\nCon questo mega cambiamento gireranno molti pi&ugrave; soldi nel campionato NA LCS e ovviamente gli stipendi ai player saranno molto pi&ugrave; alti (gi&agrave; erano pi&ugrave; alti prima rispetto all&#039;EU, ora la differenza sar&agrave; abissale), e questo denaro ha gi&agrave; fatto gola a diversi giocatori europei: PowerOfEvil ad esempio, da vincitore della votazione europea degli All-Stars come midlaner a traditore dell&#039;Europa con il passaggio agli Optic Gaming; Zven/Mithy, la bot lane pi&ugrave; forte di Occidente, che hanno sposato il progetto TSM, non soddisfatti dei nuovi investimenti dei G2, ma non solo.\r\n\r\nE voi che cosa ne pensate? Preferite il sistema classico con le retrocessioni o il franchising? Siete d&#039;accordo con giocatori come PoE o rinuncereste ai soldi per rimanere in un campionato pi&ugrave; solido per quanto riguarda il livello di gioco come quello europeo?\r\nFatemi sapere e ovviamente ogni tipo di feedback riguardo a questa serie &egrave; ben accetto :)","replies":[{"poster":"Apostasis","date":"2017-11-26T23:12:58.425+0000","up_votes":1,"down_votes":0,"body":"Anzitutto, bella iniziativa! Ce ne vorrebbero di più...\nSecondo me la tua idea di sviluppare una/delle rubriche è molto interessante e se curata nel modo giusto può avere del potenziale( penso avresti dovuto menzionare che molto probabilmente anche l'EULCS adotterà un sistema simile nel 2019 e le proteste europee per me avrebbero avuto bisogno di più copertura, manca la faccenda degli H2K per esempio, ma per essere solo il primo tentativo comunque mi sembra curato abbastanza bene, anche se magari si sarebbero potuti apportare diversi miglioramenti, ma molto dipende anche del tipo di format che vuoi impostare).\nSpero se ne interessi abbastanza gente da farti continuare :)\nOra, per rispondere alle tue domande: \n-    Io sinceramente preferisco il sistema \"classico\"(che poi è classico per noi europei abituati dagli sport tradizionali, soprattutto il calcio) perché lo trovo più interessante da seguire e competitivo, ma oggettivamente questo sistema fornisce molta più libertà ai team(oltre che stabilità economica), anche per quanto riguarda eventuali esperimenti con i giocatori, a tale proposito se non sbaglio ora tutti i \"titolari\" devono avere un sostituto regolarmente affiliato al team, poi c'è da capire la faccenda degli Academy Teams...\n-   Considerando la brevità ed il \"rischio\" di una carriera negli esport non potrei mai biasimare un giocatore per aver scelto di andare dove guadagna di più, anche se detesto vedere un secondo esodo, inoltre ora dovrebbe diventare molto più competitiva la lega americana, non che già non lo fosse, ma se il TSM non supera i gruppi neanche quest'anno{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Dodop","date":"2017-11-26T20:42:40.697+0000","up_votes":1,"down_votes":0,"body":"Probabili roster team NA LCS 2018: https://lol.gamepedia.com/2018_Preseason_Roster_Swaps/North_America/Rumored_Rosters\n\nProbabili roster team EU LCS 2018: https://lol.gamepedia.com/2018_Preseason_Roster_Swaps/Europe/Rumored_Rosters","replies":[]}]}