{"poster":"Shiro Only Top","date":"2015-05-06T14:16:00.218+0000","title":"Main ADC-Semi Top sucht ernstes Team  (Platin V)","subforum":"Clans & Teams","embed":{"description":"Check your Summoner statistics, MMR, realtime spectate and using powerful global LoL Charts!","url":"http://euw.op.gg/summoner/userName=Lmpression","image":"http://sk2.op.gg/images/logo/l102_small.png?2"},"up_votes":2,"down_votes":0,"body":"Heyho,\n\nIch bin Lukas, 17 Jahre und suche ein Team.\n\nIch spiele seid knapp Season 1 LoL und fing mit Rankeds Season 2 an.\nIn letzter Season habe ich dann eine Elo bzw ein Ranking von Platin 2 erreicht.\nDa ich bis vor 1 Monat eine relativ lange Pause hatte (RL probleme, Motivation etc)\nHab ich wieder angefangen aktiv zu spielen. Mittlerweile maine ich Adc, mit relativ gutem Erfolg (siehe Op.gg) Innerhalb einer Woche konnte ich von meinen Einstiegspielen (Gold V) auf Platin V hochspielen, und bin immer noch motiviert dabei weiter zuspielen. Wie ich sagen w&uuml;rde \"Maine\" ich keinen bestimmten Adc kann aber trotzdem relativ dezent alle momentan Meta Adcs spielen. Falls kein Interesse an der Adc Position besteht kann ich immer noch Toplane spielen. Ich kenne noch relativ viele Lanematchups und mir ist es eigentlich fast egal welchen Champion ich spiele, hauptsache ich habe mit meinem ganzen Team erfolg.\n\nMittlerweile habe ich aber auch wieder lust auf ein Team, mein vorheriges, mit dem knapp 4Monate zusammen gespielt hab hat sich irgendwann aufgel&ouml;st weil einfach die Zeit, Motivation etc fehlte. Dabei haben wir in versch. Turnieren etc mitgespielt, hab also auch im Team und Turnier Bereich bereits Erfahrung. In dem Team habe ich selber aber Top gespielt.\n\nNaja gelaber hin oder her.\n\nIch suche ein Team was lang zeit motiviert und aktiv ist.\nFeste Trainningszeiten festlegt\nFeste Positionen hat\nGewisse Reife, ich will mit keinen Kiddys spielen die am Ende nur rumschreien und sich nicht konzentrieren.\nEvtl Turnier teilnahme (Erfahrung auch gegen h&ouml;here Gegner sammeln)\nBitte Keine Silber-Bronze Spieler (Nur hohes Gold-Platin)\n\nFalls wer interesse hat kann mich gerne ingame adden. Entweder auf meinem Main lmpression (Bitte denken das das I eigentlich ein kleines L ist) oder auf meinem Smurf Traey.","replies":[{"poster":"Shiro Only Top","date":"2015-05-06T18:20:55.868+0000","up_votes":2,"down_votes":0,"body":"Push++","replies":[]},{"poster":"Traey","date":"2015-05-07T07:34:49.942+0000","up_votes":1,"down_votes":0,"body":"Bester Mann :D","replies":[]}]}