{"poster":"Nice2MeetU","date":"2016-06-27T19:22:07.792+0000","title":"Duda artesanía hextech","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola, tengo un problema/duda, resulta que tenia 3 skins para hacer el remake por una skin que no tenga. Tenia a fizz supergalactico, a dj sona y una de gragas no recuerdo bien cual, gragas barril algo, resulta que cambio estos 3 y me dan la skin &quot;volibear se&ntilde;or del trueno&quot; y 100 esencias naranjas... O sea cambi&eacute; 2 skins legendarias (creo que dj sona y fizz supergalactico son ya que me aparecian como unos iconos raros al lado de cada skin, uno una bola naranja y el otro una especie de icono parecido a la maestria 4 de champ) y me dieron una skin medio pelo y que encima no tengo al champ... Puede esto ser posible? O deber&iacute;an darme una skin de alg&uacute;n champ que no tengo y ya activada directamente? Porque ya he hecho un cambio anterior y me dieron una skin de fiora directamente sin tener que cambiarla por esencias....","replies":[{"poster":"lordeman10","date":"2016-06-27T22:26:22.038+0000","up_votes":1,"down_votes":0,"body":"cuando le das click derecho dice bien claro.. Transformar en permanencia de aspecto aleatoria\n\nel que no lo vea es porque está borracho o no quiere verlo","replies":[]},{"poster":"Kukaplanero","date":"2016-06-27T21:15:37.268+0000","up_votes":1,"down_votes":0,"body":"Totalmente posible, yo te recomendaría conservar las skins legendarias que no desees convertir en permanentes para desencantarlas en esencia cuando obtengas alguna skin que sí desees quedarte","replies":[{"poster":"Nice2MeetU","date":"2016-06-27T21:35:36.318+0000","up_votes":1,"down_votes":0,"body":"Y hasta ahora me lo dicen, pues orale.","replies":[]}]},{"poster":"AuroraExecution","date":"2016-06-27T20:37:33.474+0000","up_votes":1,"down_votes":0,"body":"Te puede tocar cualquier clase de skin. Hasta garen comando por mas que la tengas.","replies":[]},{"poster":"VAK Bruno","date":"2016-06-27T19:46:52.076+0000","up_votes":1,"down_votes":0,"body":"No te ofendas pero lo que has echo es una idiotes , por falta informacion , por mas que sean 3 skin definitivas y las juntas no te va a tocar otra igual te puede tocar hasta teemo tejon , si no tienes al champ , la skin quedara en la artesania hasta qye lo consigas","replies":[]},{"poster":"Rolando Magic","date":"2016-06-27T19:24:54.731+0000","up_votes":1,"down_votes":0,"body":"Se, por algo es azar","replies":[]}]}