{"poster":"Nice2MeetU","date":"2016-05-16T20:07:15.377+0000","title":"Consulta","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola gente, quer&iacute;a hacer una serie de preguntas sobre mec&aacute;nica de items y ultis..\r\n\r\nCon respecto al Zhonyas, que ultis no estar&iacute;an funcionando con &eacute;l? V&eacute;ase morgana, fiddle, etc...\r\n\r\nEl muro del viento de Yasuo, que habilidades no es capaz de evitar? Aparte de los proyectiles de las torretas...\r\n\r\nEn estos items para top:\r\nComo funciona exactamente el &quot;Baile de la muerte&quot;{{item:3812}} rinde su robo de vida? Y como funciona este...\r\n\r\nLa &quot;Hidra Voraz&quot;{{item:3074}} , como funciona su robo de vida? Rinde esto o mejor hacer el Baile de la muerte.\r\n\r\nComo funciona el robo de vida del {{item:3146}} ??\r\n\r\nSi me acuerdo algo m&aacute;s consulto, muchas gracias.","replies":[{"poster":"Yrox the Third","date":"2016-05-16T20:19:52.865+0000","up_votes":1,"down_votes":0,"body":"El Zhonya bloquea todo, sin excepcion, solo puedes morir durante un Zhonya si lo usas mientras estas en la pasiva de Sion.\n\nEl Muro de Yasuo bloquea todo, excepto ataques de Torretas y {{summoner:32}} \n\n{{item:3812}} Cuando recibes daño, el 15% de este daño no llega inmediatamente, lo recibiras como \"daño de sangrado\".\nOsea, si un ataque te hace 100 de daño, recibiras 85 de daño instantaneamente, y recibiras los 15 puntos de daño restante en los siguientes 3 segundos.\nSu robo de vida es cuando haces daño Fisico, a diferencia del robo de vida normal que es cuando haces ataques basicos.\n\n{{item:3074}} Su life steal funciona como cualquier otro objeto, sin embargo sera 50% efectivo en sus pasivas y activas.\nOsea, si tienes 12% de robo de vida, la pasiva y activa del objeto (osea, los \"daños en area\") solo te curaran el 6% del daño hecho.\n\n{{item:3146}} Cualquier daño que hagas, sea fisico, magico o verdadero, te curara.","replies":[{"poster":"Nice2MeetU","date":"2016-05-16T20:39:35.493+0000","up_votes":1,"down_votes":0,"body":"A que te referis con si estás en la pasiva de Sion? Mi pregunta era con respecto a poder usar el zhonyas junto a algun ulti, véase ulti de morgana, ulti de fiddle, o sea usarlo y activar zhonyas, cancela el ultimate de estos? Ejemplo ulti morgana+zhonyas.\n\n\nY con el muro de Yasuo, he visto que no bloquea ulti de lux, ulti de velkoz, puede ser?","replies":[{"poster":"Yrox the Third","date":"2016-05-16T20:42:38.835+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=jntH76,realm=LAS,application-id=v7qsfXsE,discussion-id=qTtlW5UX,comment-id=00000000,timestamp=2016-05-16T20:39:35.493+0000)\n>\n> A que te referis con si estás en la pasiva de Sion? Mi pregunta era con respecto a poder usar el zhonyas junto a algun ulti, véase ulti de morgana, ulti de fiddle, o sea usarlo y activar zhonyas, cancela el ultimate de estos? Ejemplo ulti morgana+zhonyas.\n> \n> \n> Y con el muro de Yasuo, he visto que no bloquea ulti de lux, ulti de velkoz, puede ser?\n\nAh, eso es distinto.\nEl Zhonya cancela tus \"canalizaciones\" pero no las habilidades, por ejemplo, si usas el Zhonya mientras estas canalizando el ulti de Fiddlestick, el ulti se cancela, sin embargo si lo usas despues de canalizarlo el ulti seguira.\n\nEl Muro de Yasuo bloquea todos los PROYECTILES, cosas como el ulti de Lux, el Ulti de Vel'koz, la Q de Xerath y cosas asi NO SON PROYECTILES.","replies":[{"poster":"Nice2MeetU","date":"2016-05-16T21:06:13.306+0000","up_votes":1,"down_votes":0,"body":"Claro, ahí lo comprendí, entonces en ese caso, como es que se utiliza el zhonyas con Morgana, ya que estoy empezando a usarla y siempre vi que ultean y activan zhonyas para usar ulti, esto no sé si es que cambió con los últimos parches, pero estuve intentando hacer ulti de morgana + zhonyas y se me cancelaba, no entendí la mecánica de esto.\n\nY con el muro de Yasuo también me mareo, ya que el ulti de Ezreal si lo cancela, pero no el ulti de velkoz o lux... Como distinguís un proyectil de un spell que si atraviesa el muro?\n\nGracias por contestar igualmente, me ayudo a entender varias cosas.","replies":[{"poster":"Yrox the Third","date":"2016-05-16T21:29:28.133+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=jntH76,realm=LAS,application-id=v7qsfXsE,discussion-id=qTtlW5UX,comment-id=0000000000000000,timestamp=2016-05-16T21:06:13.306+0000)\n>\n> Claro, ahí lo comprendí, entonces en ese caso, como es que se utiliza el zhonyas con Morgana, ya que estoy empezando a usarla y siempre vi que ultean y activan zhonyas para usar ulti, esto no sé si es que cambió con los últimos parches, pero estuve intentando hacer ulti de morgana + zhonyas y se me cancelaba, no entendí la mecánica de esto.\n> \n> Y con el muro de Yasuo también me mareo, ya que el ulti de Ezreal si lo cancela, pero no el ulti de velkoz o lux... Como distinguís un proyectil de un spell que si atraviesa el muro?\n> \n> Gracias por contestar igualmente, me ayudo a entender varias cosas.\n\nEs que el ulti de Morgana no es canalizacion, sin embargo, debes estar cerca de los campeones enemigos afectados para que queden con el CC.\n\nEs facil diferenciar un proyectil de algo que no es un proyectil, la diferencia es que los proyectiles puedes ver su trayectoria, por ejemplo, la Q de Lux, la Q de Ziggs, los ataques basicos a distancia (excepto Azir, Thresh y Vel'koz) o cosas asi, las otras cosas serian habilidades que no tienen trayectoria, osea, golpean todo el recorrido, como la Q de Xerath o el ulti de Lux, estas habilidades golpean toda la trayectoria inmediatamente.","replies":[{"poster":"Nice2MeetU","date":"2016-05-16T22:29:01.490+0000","up_votes":1,"down_votes":0,"body":"Muchísimas gracias, fue de mucha ayuda todo.\n\nLo que no me quedo claro es si realmente se cancela o no el ulti de morgana, ya que no sé si es que yo la utilicé mal, pero queriendo hacer el otro día ulti+zhonyas se cortaba el ulti, no stuneaba a nadie no sé si es un cambio implementado en los últimos parches el que ya no se pueda ultear con morgana mientras activas zhonyas. {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Yrox the Third","date":"2016-05-16T22:32:34.925+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=jntH76,realm=LAS,application-id=v7qsfXsE,discussion-id=qTtlW5UX,comment-id=000000000000000000000000,timestamp=2016-05-16T22:29:01.490+0000)\n>\n> Muchísimas gracias, fue de mucha ayuda todo.\n> \n> Lo que no me quedo claro es si realmente se cancela o no el ulti de morgana, ya que no sé si es que yo la utilicé mal, pero queriendo hacer el otro día ulti+zhonyas se cortaba el ulti, no stuneaba a nadie no sé si es un cambio implementado en los últimos parches el que ya no se pueda ultear con morgana mientras activas zhonyas. {{sticker:zombie-brand-mindblown}}\n\nEl ulti de Morgana funciona asi, tiene \"3 pasos\".\n\n1) El ulti SOLO se puede activar si hay campeones enemigos cerca.\n\n2) Cuando activas el ulti, \"marcas\" a todos los campeones enemigos cercanos. (En este momento, puedes usar Zhonya).\n\n3) Luego de un tiempo, todos los campeones marcados al principio quedaran \"stuneados\" (no es un stun, solamente no se como se dice \"Bind\" en español, pero es un CC adonde no te puedes mover pero puedes usar habilidades o ataques basicos), sin embargo, si se alejan mucho de ti se quitaran la marca, y los campeones enemigos que se acerquen mucho a ti mientras estes tirando el ulti NO seran marcados.","replies":[]}]}]}]}]}]}]}]}