{"poster":"Kjarudi","date":"2016-08-01T16:54:04.133+0000","title":"5n5 Team sucht symphatischen TOP-Laner - zur Not auch ADC","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Moin und Hallo,\r\n\r\nderzeit sucht unser Team nach einem Mitstreiter, um im 5on5 etwas Spa&szlig; haben zu k&ouml;nnen.\r\nN&auml;here Infos findet Ihr in den Folgenden Punkten :)\r\n\r\nZu Uns:\r\n\r\nUnser Team besteht zur Zeit aus 4 Personen (Jan, Steven, Patrick und Kathi) im Alter von 20-26 Jahren - Studierend bzw Berufst&auml;tig.\r\nIn erster Linie geht es uns darum, ohne Flame aber mit sinnvoller Kritik unseren Spa&szlig; zu haben und weiter aufzusteigen. Derzeit sitzen wir zwischen Gold 4 und Gold 1. Derzeit spielen wir Sonntags, Montags und Mittwochs jeweils ab 20 Uhr bis einer weg muss. \r\n\r\nZu Euch:\r\n\r\nIn allererster Linie suchen wir Charakterlich passende Leute - lieber verkraften wir 1-2 fails als &#039;nen asozialen J&auml;hrigen rager im TS sitzen zu haben.\r\nDas Niveau von Gold+ solltest du im Solo/Duo-Ranked allerdings erreicht haben, gerne auch mit Erfahrungen aus vergangenen Seasons.\r\nBeim Alter wollen wir gerne mit Erwachsenen Leuten zusammenspielen, einfach aus Erfahrung des verhaltens der Kids nach einer Reihe verlorener Games oder berechtigter konstruktiver Kritik. Ganz wichtig: Ihr seid Herr Eurer Internetleitung, Eures Lebens und Eurer Zeiteinteilung - wir k&ouml;nnen kein &quot;Mach aus, es gibt Abendessen&quot; gebrauchen ;)\r\n\r\nDie Infos zusammengefasst:\r\n\r\n    TOP / ggf. ADC gesucht\r\n    Gold+ Liga\r\n    18++ Jahre\r\n    Netter Charakter!!\r\n    Kritikf&auml;hig und gerne auch Kritik austeilend\r\n    Interesse an kurzweiligen Abende\r\n\r\nNun hoffe ich, das wir noch ein passendes F&uuml;nftel zu unserem Team zusammentreiben k&ouml;nnen.\r\n\r\nWir wollen Heute (01.08.) um 20:00 Uhr ne runde zocken und w&uuml;rden uns freuen, wenn wir mit einem von Euch starten k&ouml;nnen. \r\n\r\nBei interesse added mich bitte direkt Ingame: Kjarudi","replies":[{"poster":"wTc Phantom","date":"2016-08-01T19:32:41.468+0000","up_votes":1,"down_votes":0,"body":"hätte Interesse, add ist raus :)","replies":[]},{"poster":"Just Quale","date":"2016-08-01T17:16:17.044+0000","up_votes":1,"down_votes":0,"body":"also ich hätte lust bin adc/top main wobei ich auf der troplane meist tanks spiele :D","replies":[]}]}