{"poster":"Lynnette","date":"2015-12-19T16:18:07.253+0000","title":"InPanic Esports sucht zuverlässige Mitglieder für Führungspositionen!","subforum":"Clans & Teams","up_votes":2,"down_votes":2,"body":"**Einen wundersch&ouml;nen guten Tag, LoL - Community,**\n\ndurch Umstrukturierung unserer Clan-F&uuml;hrung und Regelwerk suchen wir momentan, zus&auml;tzlich zu unserer schon eingesessenen Leaderschaft, Verst&auml;rkung. Wenn du Spa&szlig; und Interesse daran hast, eine F&uuml;hrungsposition oder Verantwortung innerhalb eines Clans zu &uuml;bernehmen und diesen wachsen zu sehen, bist du in diesem Thread genau richtig !\n\n**Kurz &uuml;ber uns:**\n\nAuch wenn wir uns gern als ein Multigaming-Clan betiteln bestehen momentan unsere zwei Hauptgruppen aus League of Legends und Counterstrike:GO, allerdings sind wir auch stetig auf der Suche, nach Member die noch andere Games, wie z.b. Hearthstone, Diablo 3, Minecraft, Rocket League, COD oder &auml;hnliches spielen.\n\nInPanic Esports ist zudem ein stetig wachsender Clan mit eigenem Teamspeak, einer gut zusammengebauten Leaderschaft und deren Manager, sowie guten strukturierten Clan-Richtlinien. In unserem Ts bietet es sich immer an, neue Leute kennen zulernen, die gerne mit euch LoL zocken, aber vielleicht auch andere Interessen an Games teilen. Zudem haben wir in LoL wie aber auch in CS:Go fast jede Skillgruppe abgedeckt, womit sich w&uuml;rdige Mitspieler, ggf. auch w&uuml;rdige Gegenspieler zum trainieren, finden lassen. Oder die euch noch ein zwei andere Tipps geben k&ouml;nnen, um euren Skill noch zu erh&ouml;hen.\n\nUnser Clan besteht mittlerweile seit 6 Monaten und kann durch die Erfahrung der Leaderschaft und dem k&uuml;rzlich neu eingef&uuml;hrten System von sich behaupten besser strukturiert zu sein, als manch andere.\nZus&auml;tzlich sind wir momentan eine Analyse- und Couchingabteilung am aufbauen, die aktiven Ranked-Teams in unserem Clan mit Auswertung von Replays unterst&uuml;tzen.\n\n**Wir suchen/du solltest mitbringen:**\n\n- Freundlichkeit\n- Zuverl&auml;ssigkeit\n- Aktivit&auml;t\n- Mindestens ein Alter von 18 Jahren\n- ( _optional_ ) Erfahrung\n\n**Offene Positionen des Managements in unserem Clan:**\n\n_Event Manager_\n\n- Event-Planung: Events, wie interne Turniere, Interne Spa&szlig;-Events (FindTheTeemo, Aram-Trinkspiel, Hide&amp;seek), externe Events (planen eines Events mit anderen Clans oder eventuell einer eigenen Liga)\n- Mit den Team Managern in Kontakt bleiben um die Internen Rankend-Teams bei Externen Turnieren anzumelden \n\n_Server Manager_\n\n- Wartung und Reparatur unsere aktuellen Servern, wie Homepage/Ts/Minecraft Server etc.\n\n_Marketing Manager_\n\n- Sponsoren-/ Partnersuche \n- Werbung f&uuml;r &ouml;ffentliche Clan-Events (Turniere)\n\n_Team Manager_\n\n- Team-Betreuung: Absprache mit dem Teamleader halten, ihnen zur Seite stehen und ihnen, bei eventuellen Suchen, helfen\n- Aufbau einer Coaching/Analyseabteilung\n\n**Analysten / Coachs**\n\nZus&auml;tzlich, falls eins der oben genannten Aufgaben eines Managers nicht zuspricht, sind wir vermehrt auf der Suche nach _Analysten und Coachs_, die unseren aktiven Ranked Teams zur Seite stehen und mit ihren League of Legends Wissen auf Fehler und Verbesserungen hinweisen. Vielleicht aber auch, sofern die Zeit besteht, Einzelsitzungen mit jeweiligen Mitgliedern eines Ranked Teams durchf&uuml;hren und aktiv dabei helfen, ihre Spielweise zu verbessern.\n\n**Du willst dich bewerben:**\n\nWir haben dein Interesse erweckt und/oder du hast noch eventuelle Fragen? Du kannst jederzeit auf unseren Teamspeak-Server ( IP: ts.inpanic-esports.de ) vorbei schauen und einen unserer Leader anschreiben, oder InGame dich bei **IPE Anarion** melden. \n\nWir w&uuml;rden uns sehr &uuml;ber deine Teilnahme freuen und w&uuml;nschen ansonsten noch einen wundersch&ouml;nen Morgen/Mittag/Abend !","replies":[]}