{"poster":"Lynnette","date":"2016-08-13T20:08:33.969+0000","title":"Platin 5 Mid Laner sucht aktives Ranked Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"**Heyho Leute,**\r\n\r\nda ich in letzterzeit ziemlich viel allein gezockt hab und die Ranked Teams wieder aktiv geschalten worden sind, h&auml;tte ich wieder bock auf ein Team. \r\n\r\n_Kurz zu mir:_\r\n\r\n- Alter: 20+\r\n- Erfahrung: seit season 1 dabei und von da an auch mehrere Teams durchlaufen, auch genug Erfahrung im Bereich Clanbeitritten etc. \r\n- Main Posi: Mid seit Ende Season 3, davor war ich Main Top, aber mitlerweile z&auml;hle ich eher ADC als meine sec Rolle\r\n- Main Champions: Ahri + Viktor\r\n- Sonstiger Championpool: Malzahar,Anni, Lux, Ekko, Anivia, Aurelion Sol, Zilean (Welche ich noch gern angehen w&uuml;rd: Karthus, Fizz, Twisted Fate - sorry wenn jemand hier LB erwartet, aber ich hasse sie :D)\r\n- Ingame: Recht ruhig, meistens nur am sprechen, wenn es n&ouml;tig ist. Tiltmeter ist bei mir ziemlich hoch, es muss schon sehr scheisse laufen, dass ich einfach aufgebe\r\n- Ansonsten auch ein geselliger und ruhiger Mensch\r\n\r\n_Was f&uuml;r ein Team such ich? _\r\n\r\n- Nur high gold aufw&auml;rts teams, so scheisse das auch klingt, aber ich w&uuml;rde gern mit Leuten auf dem selben Niveau spielen, oder h&ouml;her, wenn diese mich reinnehmen\r\n- Uhrzeiten sind egal, ich bin flexibel und kein schichtarbeiter\r\n- Clanbeitritt habe ich auch kein Problem mit, allerdings mit gezwungenen Clan-Tag\r\n- Am liebsten ein doch schon erfolgsorientiertes Team mit einer gewissen strenge und wissen was sie tun, allerdings kann ich mich gern auch mit einer chilligeren Gruppe anfreunden, solange sie ingame sich wenigstens anstrengen.\r\n\r\nWenn du bis hier hin gelesen hast, freut mich das sehr ! Wenn ich eurem Team beitreten kann mit diesen Eigenschaften, w&uuml;rde ich es begr&uuml;&szlig;en hier drunter ein Thread lesen zu k&ouml;nnen, mit Datum und Uhrzeit, wann ich auf ein TS kommen soll f&uuml;r Tryouts oder Bewerbungsgespr&auml;ch, oder du addest mich einfach &quot; _Yukiuindo_ &quot; bei LoL direkt und wir k&ouml;nnen Quatschen sobald wir beide online sind :)\r\n\r\nAllen anderen w&uuml;nsche ich frohes schaffen ! \r\n\r\nMFG Yukuindo aka Ferdi","replies":[{"poster":"Hi im Elísa","date":"2016-08-14T02:09:30.085+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Lynnette","date":"2016-08-14T10:02:23.013+0000","up_votes":1,"down_votes":0,"body":"hey :) Bei mir kam leider bisher noch keinerlei addung an D:","replies":[]}]}]}