{"poster":"Zoteb","date":"2019-10-29T21:21:36.461+0000","title":"¿Por qué la skin victoriosa se da a partir de Oro?","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"Si la temática de la skin tiene que ver con un premio por llegar a ese Elo, por qué me tienen que premear por llegar a Oro? Si sigo siendo malísimo","replies":[{"poster":"AJ             J","date":"2019-10-29T22:57:44.344+0000","up_votes":2,"down_votes":0,"body":"Porcentualmente, gran parte de los usuarios son plata para abajo. No a todos les interesa jugar bien este juego.\nLa recompensa de final de temporada tambien es una forma de incentivar a los usuarios a jugar el jueguito. Ya sabes, generar tráfico y mantenerse relevantes como medio de entretenimiento.\n\nSi solo se diera una recompensa relevante a los 15% de los usuarios que juegan bien, la mayoría ni se esforzaría en grindear PL.\n\nPara mí, tendrían que ofrecer recompensas relevantes de oro para arriba, y que sean cada vez mejores.\n\n______________\n\nEj;\nHierro - 1000 Esencia azul.\nBronce - Esencia naranja.\nPlata - Más esencia naranja y tal vez un orbe.\nOro - Skin + Esencia naranja.\nPlatino - Skin + Más esencia naranja + Orbe.\n\nY así, se entiende.","replies":[{"poster":"Zoteb","date":"2019-10-30T00:00:17.314+0000","up_votes":1,"down_votes":0,"body":"Hasta que cambiaron el sistema del Elo, los que sólo les interesaba la skin victoriosa, se tryhardeaban las 10 provisionales antes de que se terminara la temporada, quedaban en Oro 0 PL y listo.","replies":[]}]},{"poster":"Excorpion","date":"2019-10-29T22:11:09.289+0000","up_votes":2,"down_votes":0,"body":"El corte de promedio, es de plata... siempre ha sido así... por eso el corte de destaque es desde oro.\n---\n\nEspera, estuviste en bronce, y crees que es lo mismo que haber llegado a oro ???","replies":[{"poster":"Zoteb","date":"2019-10-29T22:26:30.371+0000","up_votes":1,"down_votes":0,"body":"Reconozco haber mejorado desde que salí a Bronce, hasta haber llegado a Oro. Pero, el \"buen\" nivel de Oro, es un nivel que me acabo cuestionar tras ver un Malphite Oro 3 que, yendo negativo, se seguía armando AP. ...y te estoy hablando de un actual Oro que también fue Oro.","replies":[{"poster":"Excorpion","date":"2019-10-29T22:42:37.066+0000","up_votes":1,"down_votes":0,"body":"O sea, son iguales a bronces ???","replies":[{"poster":"Zoteb","date":"2019-10-29T23:57:24.624+0000","up_votes":1,"down_votes":0,"body":"Prácticamente sí. Lo único que cambia es el conocimiento sobre el campeón. 7 de cada 10 partidas se terminan cerrando por error del rival, más que por conocimiento del juego.","replies":[{"poster":"ZökLeV","date":"2019-10-30T01:51:08.181+0000","up_votes":1,"down_votes":0,"body":"en diamante tambien es igual,si ninguno de los dos equipos cometiera errores la partida seria eterna,ademas bronce no es igual a oro..en eso se basa el juego,en buscar el error del rival para sacar ventaja","replies":[]},{"poster":"Tenori Taiga","date":"2019-10-30T00:06:13.402+0000","up_votes":1,"down_votes":0,"body":"En realidad lo que mas define la liga es el macrojuego y la toma de decisiones . Muchos jugadores de elo alto dicen que la diferencia entre un diamante 1 y un master es la toma de decisiones y no las mecanicas individuales.\nAunque paresca chiste hay gente en plata o en oro que tienen mecanicas individuales de diamante, pero no saben farmear, siguen la kill, no sacan objetivos, sobreextienden etc. \nAsi como pequeña curiosidad","replies":[]}]}]}]}]},{"poster":"vivakayn","date":"2019-10-29T23:25:53.481+0000","up_votes":2,"down_votes":1,"body":"todos sabemos que en LAS de bronce a platino no hay diferencia","replies":[]},{"poster":"Kyousuke","date":"2019-10-29T21:36:03.254+0000","up_votes":1,"down_votes":0,"body":"porque ya no sos TAAAN malo, si la dieran por arriba de platino o diamante sería exageradamente exclusiva","replies":[{"poster":"Zoteb","date":"2019-10-29T21:51:12.415+0000","up_votes":1,"down_votes":0,"body":"Tan malo a consideración de quién? Si se sabe que, el buen nivel de juego, empieza en Diamante 1. En la S7, me acuerdo que te daban el ward victorioso a partir de Plata y el champ a partir de Oro. Y ahora que lo pienso, no sería una mala idea que el ward lo den a partir de Oro, y el champ a partir de Diamante. Porque, las cosas como son. Para un Diamante, un Oro es lo mismo que un Bronce.","replies":[{"poster":"Kyousuke","date":"2019-10-30T00:34:24.397+0000","up_votes":1,"down_votes":0,"body":"realmente no, soy diamante y no considero que sea igual un bronce que un oro\nse que tras ese nivel hay muchas partidas, esfuerzo y conocimiento. Tampoco es que piense que oro sea la mejor liga, pero es superior al principiante y es un paso a lo que sigue","replies":[]}]}]},{"poster":"Llona15","date":"2019-10-29T23:02:34.980+0000","up_votes":1,"down_votes":0,"body":"según yo es para fomentar a los jugadores a mejorar, esto es debido a que mas del 50% de los jugadores actuales son plata o mas bajos.","replies":[]}]}