{"poster":"Zoteb","date":"2018-08-14T18:44:33.006+0000","title":"Este juego no cambia más.","subforum":"Problemas Técnicos","up_votes":6,"down_votes":6,"body":"Riot, sinceramente, no me sorprende que tu juego se est&eacute; muriendo. Pon&eacute;s el modo Flexible de partidas Clasificatorias, metes campeones nuevos, reworkeas otros, pon&eacute;s un sistema de Honor, pens&aacute;s poner como un sistema de Clasificatorias para cada rol o algo as&iacute;, y sab&eacute;s cu&aacute;l es el principal problema de tu juego? Lo mierda que es el servidor tanto en comunidad como en conexi&oacute;n!\r\nCon la comunidad, pusiste el tema del Honor para &quot;premiar&quot; a los jugadores decentes en cuanto a comportamiento, pero no tuviste en cuenta que a la comunidad le da completamente igual que des una skin como recompensa de buen comportamiento. Porque sab&eacute;s muy bien que no les da para nada igual que le banees la cuenta por toxicidad. Por qu&eacute; no te pens&aacute;s m&aacute;s la idea de un castigo para los t&oacute;xicos, en lugar de una recompensa por el buen comportamiento?\r\nAh, pero no te olvides de la calidad de conexi&oacute;n del servidor (no te pido 9 MS constantes y permanentes como en KR, pero tampoco puede ser que se te caiga una vez por parche), eh! Porque estoy completamente seguro de  que, el d&iacute;a que se limpie la comunidad, se cae el servidor y no se levanta hasta que te pidamos a las puteadas que lo levantes, como lo har&iacute;a la parte t&oacute;xica de la comunidad.","replies":[{"poster":"Hyeer","date":"2018-08-14T19:02:01.526+0000","up_votes":6,"down_votes":0,"body":"Hablas de toxicidad y se nota a leguas que eres re toxico. Tanto te cuesta esperar un par de horas? porque pareces un drogadicto con síndrome de abstinencia.\n\nSaludos invocador.","replies":[{"poster":"Zoteb","date":"2018-08-14T19:24:48.239+0000","up_votes":1,"down_votes":2,"body":"Dónde dije que no soy tóxico? Soy tóxico, sí, pero no constantemente. Mi punto es que considero más fácil que los constantemente tóxicos dejen el juego tras banearlos permanentemente y viéndose obligados a empezar de 0, que intentar \"convertir\" a un rager tratándo de ilusionarlo con sorprendentes recompensas por reconsiderar un cambio de actitud.\n\nNo, no me cuesta nada esperar un par de horas, pero es que tampoco es el principal problema la desconexión del servidor. No me quejo de la reciente caída, me quejo de muchos factores que actúan como evidencia frente al hecho de que el juego se está muriendo. Entre tantos, el de la poco confiable calidad de conexión del servidor.","replies":[{"poster":"Hyeer","date":"2018-08-14T19:49:17.504+0000","up_votes":5,"down_votes":0,"body":"Te respondería, pero alguien que aboga por una comunidad limpia y se considera toxico, ah disculpa, toxico, pero no constante. No merece mas palabras que estas.\n\nSaludos","replies":[{"poster":"Blaknight","date":"2018-08-14T22:45:29.955+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Aztlán,realm=LAS,application-id=X54mVVp0,discussion-id=6GXxKiTT,comment-id=000300000000,timestamp=2018-08-14T19:49:17.504+0000)\n>\n> Te respondería, pero alguien que aboga por una comunidad limpia y se considera toxico, ah disculpa, toxico, pero no constante. No merece mas palabras que estas.\n> \n> Saludos\n\nrekt","replies":[]}]}]},{"poster":"DizzyJuicy","date":"2018-08-14T20:04:31.617+0000","up_votes":1,"down_votes":0,"body":"\"Drogadicto con sindrome de abstinenca\"\nTú no serás su pariente no? AntiTóxico :)","replies":[{"poster":"Hyeer","date":"2018-08-14T20:12:31.040+0000","up_votes":2,"down_votes":0,"body":"La verdad, es que tienes razón, la analogía es bastante cruel. Me disculpo.","replies":[]}]},{"poster":"Erise","date":"2018-08-14T19:41:42.369+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Aztlán,realm=LAS,application-id=X54mVVp0,discussion-id=6GXxKiTT,comment-id=0003,timestamp=2018-08-14T19:02:01.526+0000)\n>\n> Hablas de toxicidad y se nota a leguas que eres re toxico. Tanto te cuesta esperar un par de horas? porque pareces un drogadicto con síndrome de abstinencia.\n> \n> Saludos invocador.\n\nE 100RTO","replies":[]}]},{"poster":"Dekμ","date":"2018-08-14T19:36:25.342+0000","up_votes":2,"down_votes":0,"body":"estaria de acuerdo... si pasara en NA xd. Los de LAS son subditos inutiles, no hacen ningun cambio agarran los que hacen los ponen en el juego y dejan el peor servidor posible mientras se llenan los bolsillos de plata","replies":[]},{"poster":"Danshid","date":"2018-08-14T19:00:08.689+0000","up_votes":2,"down_votes":0,"body":"\"pero tampoco puede ser que se te caiga una vez por parche\"\n\nNa, se suele caer cuando meten cosas nuevas y grandes (urf optimizado para nuevo cliente, ofa, clash y este nuevo modo), a veces nomas se les caen los servers (en feriados comunes en muchos paises), pero suelen arreglarlo en unas horas, y tampoco quiero ser el abogado del diablo aqui, porque riot como la gran empresa que es, deberia invertir en los servers de regiones que no sean Na.\n\nPero tampoco es culpa de riot las, es culpa de riot como empresa, asi que habria que ir a putear a los foros de na","replies":[]},{"poster":"Christoph","date":"2018-08-14T19:04:20.510+0000","up_votes":3,"down_votes":1,"body":"Lleve sus gaseosas, panes con hot dog, el bardo le cansara.\nLleve sus gaseosas, panes con hot dog, el bardo cansa","replies":[]},{"poster":"DanteMOBALegend","date":"2018-08-15T14:45:44.369+0000","up_votes":1,"down_votes":0,"body":"Capo el problema sos vos y la gente como vos que vive bardeando y quejándose de todo en vez de disfrutar el juego que es claramente lo que no haces porque se nota que no te gusta si no no te estarías quejando de todo.\nEn conclusión la mejor solución es que te vayas del juego si tanto te molesta la comunidad,servidor,que se caiga todos los parches(cosa que debe de pasar si no como carajo lo actualizan además que clase de juego no se cae en cada parche todos los juegos necesitan un mantenimiento).\nY si respondes tratando de contradecirme te informo que no leí todo el post pero ley una buena parte y leí todos los comentarios.","replies":[{"poster":"Zoteb","date":"2018-08-15T15:24:42.353+0000","up_votes":1,"down_votes":0,"body":"No sé vos, pero yo no le veo el sentido a disfrutar de perder. Perdes una partida Normal y \"me chupa un huevo, es una Normal\". Perdes una Clasificatoria y \"me chupa un huevo, esta es mi Smurf\". Tan mal está querer ganar?\n\nCon tu línea de pensamiento, ni me caliento en gambetear y meter goles en fútbol, pero me cago de risa tras cagar a patadas al otro equipo. Amigo, cuál es tu manera de disfrutar de un juego? Romperle las bolas a los demas?","replies":[{"poster":"DanteMOBALegend","date":"2018-08-15T15:52:29.239+0000","up_votes":1,"down_votes":0,"body":"Yo personalmente juego al fútbol y me importa ganar pero podés quedarte con distintas cosas después del partido que te hayan gustado y no necesariamente andar quejándose como un necio de que perdiste y echarle la culpa al equipo y al tecnico que en el caso del lol le echas la culpa a la comunidad de ser mala cuando vos no sos ni de cerca un ejemplo positivo y le echas la culpa al técnico que vendría a ser riot porque se cayó un servidor que tranquilamente puede pasar todo el tiempo porque si no hubiera margen de error no estarías jugando a esto porque es imposible.","replies":[{"poster":"Zoteb","date":"2018-08-15T16:22:16.228+0000","up_votes":1,"down_votes":0,"body":"Bueno, bien por vos. Felicitaciones. A mi me cuesta pensar las cosas estando caliente, y mucho más viniendo de perder 9 partidas seguidas. Que seguro que algo mal habré hecho. Si no cometiera errores, sería el número 1 en Corea.\n\n...qué se yo, será que soy mal perdedor, será que no me conformo ni siquiera con empatar y no veo que me estoy equivocando.","replies":[]}]}]}]},{"poster":"HealthierShark","date":"2018-08-15T12:37:49.820+0000","up_votes":1,"down_votes":0,"body":"Se queja de nuevas implementaciónes al juego\nSe queja de la comunidad cuando es tóxico\nExiste el soporte (Pero seguramente lo usa lo banean a él por tóxico)\nTodos lo que dice esta mal\nOtro Cry post normal","replies":[{"poster":"Zoteb","date":"2018-08-15T13:35:06.078+0000","up_votes":1,"down_votes":0,"body":"\"Otro Cry post normal\". Sería una situación más entendible si se tratara de una Clasificatoria? Me parece que tampoco aplicaría, porque sea contra Bots, Normal, ARAM, o Clasificaria, sigue siendo un juego.\n\"Se queja de la comunidad cuando es tóxico\". Es verdad que es lo mismo que quejarse de los delincuentes cuando también se es, pero \"sólo por necesidad\", pero te aseguro que no soy comparable bajo ningún punto con la parte constantemente tóxica de la comunidad. Porque son realmente escasas las situaciones en las que se llega a ver mi comportamiento tóxico.\n\nYo te pregunto, tras haber estado 5 veces en una situación de 3 v 2 en contra, cuya ventaja la dió el Jg, no te parece que es normal que me enoje tras que su Pantheon me ultea bajo torre y me mata mientras mi Warwick farmea el red?\n \nTras estar cansado de pasarme la partida farmeando e igual perder, me voy a la Jg, en donde, a mi parece, tengo que ayudar más que farmear. Mi Top Laner se va AFK y me tengo que ir a cubrir la línea. Obviamente que pierdo la partida.\n\nEl cliente no me carga la pestaña post partida, yo me salgo y vuelvo a entrar, y resulta que hay problemas en el servidor.\n\n\nEstás jugando un partido, sos el arquero, te meten gol, por lo terminas perdiendo el partido, y el defensor no ayudó por estar atándose los cordones en lo que al delantero rival se le ocurre encarar para tu arco. Si vos podés mantener la calma y/o directamente no te hace enojar, te felicito. Pero eso no quiere decir que esté mal enojarse tras la derrota.","replies":[]}]},{"poster":"Bot Murloc","date":"2018-08-14T20:59:21.980+0000","up_votes":1,"down_votes":0,"body":"Joven, le sugiero que deje de usar \"Tu juego se está muriendo\" porque League of Legends o como vulgarmente se lo llama \"LoL\", tiene muchos años de vida y si no es el MOBA más jugado actualmente, es uno de los MOBAs y juegos más jugados por el momento.\n\nLe deseo muy buenas tardes, joven.","replies":[]},{"poster":"Main Cocina S3","date":"2018-08-14T19:06:07.723+0000","up_votes":1,"down_votes":0,"body":"aguante el modo flex careta","replies":[]},{"poster":"Ã i z e n","date":"2018-08-14T19:00:08.750+0000","up_votes":1,"down_votes":0,"body":"El juego es cómo es, nadie te está obligando a jugarlo, es más me parece que con tu ausencia, por lo visto, el server estaría un poco mejor.","replies":[]},{"poster":"1ainz ooal gown ","date":"2018-08-14T18:48:09.227+0000","up_votes":1,"down_votes":1,"body":"komo lo zupo :0","replies":[]}]}