{"poster":"UnisonUnited","date":"2017-03-02T18:39:12.580+0000","title":"Server ips","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I wanted to create a league club at my school. My school has Programm that blocks certain server ips. I ll need some ips to remove League from the restricted list. For example the authentication to the client doesn't work.","replies":[{"poster":"Porocles","date":"2017-03-02T18:48:55.657+0000","up_votes":1,"down_votes":0,"body":"I can't really support trying to bypass security to play League.  :X I do think having a club would be super cool, though, and I recommend talking to your school about it.  Let them know what you want to do, and how this program is getting in the way.  They may be able to work something out with you.  Good luck!","replies":[{"poster":"UnisonUnited","date":"2017-03-02T19:23:56.011+0000","up_votes":1,"down_votes":0,"body":"I already talked to them about it. The Problem is, they cant just delete the whole blocked list. They need to know what exactly has to be removed.","replies":[{"poster":"Porocles","date":"2017-03-02T19:28:21.457+0000","up_votes":1,"down_votes":0,"body":"Our [connection](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#wq8)guide has a list for port forwarding.  We don't have a list of addresses to offer, but that should do the trick!\n\nOtherwise, have your Campus IT hit us up in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) or support@riotgames.com with their school email address.  We'll be happy to take a closer look!","replies":[{"poster":"UnisonUnited","date":"2017-03-02T19:36:17.333+0000","up_votes":1,"down_votes":0,"body":"thanks","replies":[]},{"poster":"UnisonUnited","date":"2017-03-07T17:45:57.286+0000","up_votes":1,"down_votes":1,"body":"Can you give me the IP addresses of the server EU-West? Then  the administrator at school can put them on the white list and hopefully LoL is working.","replies":[]}]},{"poster":"UnisonUnited","date":"2017-03-02T19:26:05.105+0000","up_votes":1,"down_votes":0,"body":"Could you explain me how League does the authentication of the passwords and username to connect to the client?","replies":[]}]}]}]}