{"poster":"dragenborn117","date":"2015-11-15T20:01:59.984+0000","title":"Saison Belohnungen","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":3,"body":"Hallo,\r\nWie w&uuml;rdet ihr es finden wenn man je nach elo auch mehrere Siegreich Skins bekommen w&uuml;rde z.B. das man mit Gold den Siegreich Sivir Skin bekommt,mit Platin den Sivir Skin und den Siegreich Skin der vorherigen Saison bekommt usw.Eure meinung w&uuml;rde mich sehr interesieren!","replies":[{"poster":"dragenborn117","date":"2015-11-15T20:28:37.753+0000","up_votes":1,"down_votes":0,"body":"Wenn man neu in Lol ist und Herausforderer kommt dann hat man nicht alle skins verdient,aber wenigstens ein paar.","replies":[{"poster":"Balmung","date":"2015-11-15T20:51:43.834+0000","up_votes":2,"down_votes":0,"body":"Und wenn man \"alt in LoL ist\" und Challenger erreicht hat man nichts verdient?\n\nSorry, es gibt so oder so nur eine Hand voll Skins die man nicht mehr erhalten kann. Fast alle Skins sind irgendwann kaufbar, wenigstens ein paar sollten wirklich als \"Belohnung\" für gewisse Leistung vergeben werden. (als ob Gold eine \"Leistung\" wäre.)","replies":[]}]},{"poster":"dragenborn117","date":"2015-11-15T20:25:18.404+0000","up_votes":1,"down_votes":2,"body":"Man kann es ja noch ändern das man jede zweite höhere elo den skin der vorsaison bekommt.Nicht jeder hat so früh angefangen mit LOL wie Dyrus obwohl man vieleicht besser ist als er und ich finde man kann das dan halt wieder nach holen.","replies":[{"poster":"CooL Ice Tea","date":"2015-11-16T09:38:36.252+0000","up_votes":1,"down_votes":0,"body":"Warum ? Wenn du zu spät bist, bist du zu spät. \n\nIch fänds auch schön wenn ich eine Pip Boy Edition für Fallout 4 bekommen habe. Ich war zu spät. Nur weil ich das Spiel auf höchster Stufe durchspiele werde ich die auch nicht bekommen.\n\nMeine Mutter hätte auch gerne einen Golf 1 Cabrio. Nur weil Sie auf dem Nürburgring die Bestzeit in einer Season fährt wird sie das Cabrio nicht bekommen.\n\nMein Freundin hätte auch gerne die Engelsflügel in Diablo 3. Nur weil Sie Deamon Hunter Rank 1 ist wird sie die Flügel nicht bekommen.","replies":[]}]},{"poster":"willmitspielen12","date":"2015-11-15T20:07:04.995+0000","up_votes":1,"down_votes":0,"body":"Unfair, weil das den Wert der Victorious Skins drastisch verändern würde. Dann würde ja jeder Challenger mit Victrious J4 rumlaufen, den iwi nur 10% aller Lol spieler höchstens haben. Außerdem, statistisch gesehen wird man ja besser je länger man spielt. Heißt im Endeffekt: Wenn jz ein Bronze5ler iwi 5-10 Jahre lol spielt und Challenger ist, kriegt er die Victorious Skins von der Zeit in der er sie noch nicht verdient hatte.","replies":[]}]}