{"poster":"RaaKaDaSH","date":"2017-11-09T12:45:05.471+0000","title":"Sobre la cantidad y calidad de las nuevas páginas de runas.","subforum":"Jugabilidad, balance y narrativa","up_votes":4,"down_votes":0,"body":"Antes, con las dos p&aacute;ginas de runas gratis, pod&iacute;amos armar una para campeones AD y otra para campeones AP, con runas que beneficiaran a cualquier campe&oacute;n AD o AP respectivamente (de hecho, creo que esa habr&aacute; sido la raz&oacute;n para que las gratuitas fueran dos y no solo una) y luego tener una p&aacute;gina de maestr&iacute;as para cada campe&oacute;n, ya que era justamente en las maestr&iacute;as donde estaba la mayor variedad y posibilidad de personalizaci&oacute;n seg&uacute;n el gusto y/o estilo de juego de cada uno y para cada campe&oacute;n en particular, y esas eran gratis y sin l&iacute;mite.\r\n\r\nAhora que las antiguas runas y maestr&iacute;as se encuentran combinadas en las nuevas RUNAS REFORJADAS, esto no es posible, y siento que mantener esa cantidad de solo dos p&aacute;ginas de runas se queda corto, muy corto. Adem&aacute;s noto que las predeterminadas no est&aacute;n armadas con las mejores runas de cada rama, y habr&iacute;a una gran desventaja entre usar estas y usar personalizadas.\r\n\r\nSe supon&iacute;a que con estos cambios sustanciales en el juego, se nivelar&iacute;a a quienes juegan hace muchos a&ntilde;os con los m&aacute;s nuevos y ya no ser&iacute;a indispensable invertir dinero en comprar runas y p&aacute;ginas de runas para poder estar a la altura necesaria competitivamente, (si no recuerdo mal, esto se dec&iacute;a) pero siento que pasa exactamente lo contrario.\r\n\r\nEsto provoca que tengamos que ir gastando las esencias que vayamos ganando en p&aacute;ginas de runas en lugar de en campeones y esto impacta en forma negativa la jugabilidad y las posibilidades de progreso en el juego de quienes no llevamos aqu&iacute; desde la beta, como tantos otros. \r\n\r\nS&eacute; que quienes llevan jugando esto desde hace muchos a&ntilde;os y ya tienen muchos (o todos) los campeones, no ver&aacute;n mucho sentido en esto que digo, pero lo cierto es que yo siento que a la mayor&iacute;a, este cambio nos perjudica y mucho. (Para entender lo que planteo, imaginen que con el sistema antiguo, solo hubi&eacute;semos tenido dos p&aacute;ginas de maestr&iacute;as...) \r\n\r\nY no, no creo que armarlas durante la selecci&oacute;n de campe&oacute;nes sea una opci&oacute;n pr&aacute;ctica, ya que obliga a hacerlo r&aacute;pido y sin poder leer con detenimiento la gran cantidad de opciones y combinaciones que pueden armarse para cada campe&oacute;n y las posiblidades de interacciones entre las ramas primaria y secundaria (ni aunque las conoci&eacute;ramos a todas de memoria y al detalle) y esto provoca un desbalance aun mayor al que ten&iacute;amos antes, entre las personas nuevas (o relativamente nuevas como yo) y los veteranos del juego, y entre quienes gastan o han gastado dinero real en p&aacute;ginas de runas y quienes no pueden darse ese lujo.\r\n\r\nPor lo menos, as&iacute; lo veo yo. {{champion:201}} \r\n.\r\n.\r\n.\r\n.\r\n.\r\n\r\n\r\n_&quot;Con libertad no ofendo ni Teemo&quot;_","replies":[{"poster":"Cambur Delbarrio","date":"2017-11-09T12:53:54.722+0000","up_votes":2,"down_votes":1,"body":"bueno, cuando se comento sobre las nuevas runas, yo me tome la molestia de leer lo que hacia cada runa. Para cuando llego esta pre-temporada ya puedo arreglarmelas con solo 2 paginas, en caso de que necesite editar algunas.\n\nPuedo ahora gastar dinero en desbloquear campeones con mas seguridad ahora, porque antes yo simplemente dependia de esas runas que costaba 1 pi, y como la gente flameaba por el hecho que no tenia runas de grado 3 jaja\n\nahora la cantidad de paginas disponibles depende de cuantas paginas de runas hallas comprado, yo no compre ninguna asi que tengo 2","replies":[{"poster":"RaaKaDaSH","date":"2017-11-09T14:10:35.089+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cambur Delbarrio,realm=LAS,application-id=xQmJPO8F,discussion-id=9kwEoxEb,comment-id=0001,timestamp=2017-11-09T12:53:54.722+0000)\n>\n> bueno, cuando se comento sobre las nuevas runas, yo me tome la molestia de leer lo que hacia cada runa. Para cuando llego esta pre-temporada ya puedo arreglarmelas con solo 2 paginas, en caso de que necesite editar algunas.\n> \n> Puedo ahora gastar dinero en desbloquear campeones con mas seguridad ahora, porque antes yo simplemente dependia de esas runas que costaba 1 pi, y como la gente flameaba por el hecho que no tenia runas de grado 3 jaja\n> \n> ahora la cantidad de paginas disponibles depende de cuantas paginas de runas hallas comprado, yo no compre ninguna asi que tengo 2\n\nYo antes tenía una página de runas para AD y una para AP. Y tenía unas cuantas páginas de maestrías (ADC, AP, Tank, Supp AP, Supp Healer, Supp Tank, JG AD, JG AP, JG TANK y un par más específicas para algunos campeones) Y con esto entraba, elegía campeón y jugaba, nada más.\n\nHoy tengo dos páginas con las que no puedo hacer esto. Me veo obligado a aprender todo de memoria, a que todos perdamos tiempo de comunicación con los compañeros durante selección de campeón armando las runas, a que mientras armamos las runas no podamos ir viendo lo que va eligiendo el otro equipo y pensando la composición de nuestro propio equipo y los posibles counters, etc.\n\nDigo todo esto, porque se venía anunciando que ahora iba a ser más fácil y todos íbamos a tener acceso a lo mismo sin necesidad de pagar nada. Y noto lo contrario, nada más.","replies":[]}]},{"poster":"Aêthêriâl","date":"2017-11-09T16:39:53.875+0000","up_votes":1,"down_votes":0,"body":"Y bueno tendrías que poder comprar paginas de runas, después de todo, tenes las 5 predeterminadas y las 2 personalizadas. Ahora porque son nuevas, pero con el tiempo vas a poder aprendertelas de memoria y hacerlas rápido.\nNo sé hace cuanto jugás, pero ya las maestrias/runas habían sufrido un cambio, y las primeras de verdad que eran un desastre y difíciles de aprender. (o al menos que recuerdo que me tomó mucho tiempo) \n\nhttps://i.gyazo.com/ab18f2c63f11b9a542f4e0f669917fc4.png","replies":[]},{"poster":"1Nimeryos","date":"2017-11-09T12:55:36.946+0000","up_votes":1,"down_votes":0,"body":"Y si probas armar la página de runas después de seleccionar el campeón? Tenes creo que 30 segundos si no me equivoco o 25. Tiempo de sobra para (Si ya leíste previamente que hace cada una o medianamente tenes un conocimiento) armar las runas para la partida. Casi todos los pro player armaban las maestrías al momento.","replies":[{"poster":"RaaKaDaSH","date":"2017-11-09T13:54:57.606+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=1Nimeryos,realm=LAS,application-id=xQmJPO8F,discussion-id=9kwEoxEb,comment-id=0002,timestamp=2017-11-09T12:55:36.946+0000)\n>\n> Y si probas armar la página de runas después de seleccionar el campeón? Tenes creo que 30 segundos si no me equivoco o 25. Tiempo de sobra para (Si ya leíste previamente que hace cada una o medianamente tenes un conocimiento) armar las runas para la partida. Casi todos los pro player armaban las maestrías al momento.\n\nSí, es lo que voy a hacer para los 4 o 5 campeones que más juego, pero habiendo ya más de 130...\n\nO será que yo soy de esos a los que les gusta leer bien las descripciones de todo, habilidades, runas, objetos, pasivas, etc, y no entrar a un web X que me diga qué runas tengo que usar ni que build debo hacerme. \n\nCuando las probé en el PBE, podías crear cualquier cantidad de páginas, y yo estuve mucho (muuucho... XD) tiempo leyendo todo con detenimiento y armando una para cada campeón de los que suelo utilizar, haciendo distintas combinaciones de rama primaria y secundaria, probando en modo entrenamiento más o menos cómo andaba cada una, etc...\n\nMi punto es que antes eran dos páginas de runas y libres de maestrías. Y ahora que tenemos runas y maestrías todo en uno, se mantuvo la peor opción de las anteriores (dos).\n\nCalculo que con el tiempo las iremos conociendo a fondo y podremos armarlas en selección de campeón en unos segundos, y es por esto mismo que no creo que mucha gente vaya a comprar páginas como antes, con lo cual el hecho de tener solo dos, va a ser solo una molestia en la que nadie gana: Rito no va a recaudar millones :P vendiendo páginas de runas, y nosotros vamos a encontrarnos con la molestia de tener que armarlas antes de cada partida.","replies":[]}]},{"poster":"2801","date":"2017-11-09T12:48:05.016+0000","up_votes":1,"down_votes":0,"body":"Es un tema, hay runas que se adaptan muy bien a todos los campeones, pero es un tema de elección... sobre lo que yo estuve pensando es que tal vez añadan nuevas runas ya que esto es una pre-temporada o un poco de tiempo en la selección de campeón extra más todavía debido a que cuesta saber que runas encajan con el campeón, por lo cual lleva tiempo, bastante tiempo, pero todas sirven.","replies":[]}]}