{"poster":"DarkxAxngel","date":"2016-11-05T12:41:11.028+0000","title":"Mapvorschlag : Tag / Nacht Zyklus","subforum":"Champions & Gameplay","up_votes":4,"down_votes":0,"body":"Hey es w&auml;re doch bestimmt toll wenn es bei LoL ein Tag nacht Zyklus geben w&uuml;rde.\r\nMan k&ouml;nnte bestimmte Easter Eggs zu verschiedene Zeiten einbauen usw.\r\nVlt. k&ouml;nnte man auch immer an einem 31 im Monat um 0:00 Uhr 10+- Minuten wenn man ein Spiel startet auf der Halloween map landen (;\r\n\r\nEs m&uuml;sste nicht mal ein richtiger Zyklus sein sondern eher mehr 5 Karten f&uuml;r 5 Tageszeiten (Morgend&auml;mmerung (mit Tau?), Tag , Abendd&auml;mmerung , Nacht, Vollmond).\r\n\r\nIch liebe LoL und sein Artwork und w&uuml;nsche mir mehr Varitionen damit es mehr Abwechslung gibt.\r\nWas haltet ihr von der Idee? &Uuml;ber verschiedene Wettermaps w&auml;re auch toll.","replies":[{"poster":"simon22","date":"2016-11-05T13:16:43.847+0000","up_votes":1,"down_votes":0,"body":"Fände ich auch super. Dann könnte man auch irgendwelche Tiere zu irgendeiner Urzeit rumlaufen lassen oder so. Also so ähnlich wie in Majoras Mask.","replies":[{"poster":"DarkxAxngel","date":"2016-11-12T17:09:31.470+0000","up_votes":1,"down_votes":0,"body":"Genau auf sowas wollte ich hinaus, verschiedene Sachen , zu verschieden Zeiten, mit verschiedene Events.","replies":[]}]},{"poster":"gyyyr","date":"2016-11-05T14:29:29.878+0000","up_votes":1,"down_votes":0,"body":"Denkst du an einen Tag / Nacht Zyklus wie in DotA 2(oder Minecraft, Sims, Sim City, ...)? Also dass es einfach über die dauer eines Spiels immer wieder Tag und Nacht wird?\nOder denkst du an einen Tag / Nacht Zyklus wie z.B. in Pokemon, der sich an der Uhrzeit im echten Leben orientiert?\n\nbei zweitem musst du einfach noch bedenken, dass es einige Server gibt die mehrere Zeitzonen abdecken.","replies":[{"poster":"DarkxAxngel","date":"2016-11-12T17:08:29.949+0000","up_votes":1,"down_votes":0,"body":"Eher wie bei Pokemon, der von der Serverzeit ausgeht. Es sollte nicht ein fließender Wechsel sein sondern eher aus ein paar Maps bestehen, damit am Anfang nicht zu schwer wird das zu Realisieren. Z.b von 1 Uhr Morgens bis 8 Uhr Morgens ist die Morgendämmerung map Spielbar. Es wäre aber auch toll wenn die Maps zufällig, oder es wird per Zufall bestimmt von einen der Zeiten der Spieler die momentan sich in der Championauswahl befinden.","replies":[]}]},{"poster":"byteemotv","date":"2016-11-05T21:09:53.536+0000","up_votes":1,"down_votes":0,"body":"Deinen vorscglag finde ich gut. Du warst kreativ. Die meisten wollen nur tag nacht. Deine idee ist besser","replies":[]},{"poster":"Doo ","date":"2016-11-05T14:27:46.017+0000","up_votes":1,"down_votes":0,"body":"Und dann hätte man die Möglichkeit Champs zu entwickeln die mit dieser Mechanik arbeiten. \nÄhnlich wie bei Dota2, Nightstalker. Also dann Champs die zum Beispiel bei Nacht bestimmte Fertigkeiten erhalten, oder verstärkte Fertigkeiten. Wer Nightstalker von Dota kennt weiß was ich meine.","replies":[{"poster":"Fudo Levis","date":"2016-11-05T19:56:03.915+0000","up_votes":1,"down_votes":0,"body":"Das wäre echt mega cool. Zum beispiel ein Nocturne","replies":[]}]}]}