{"poster":"Darkfoe703","date":"2016-11-09T04:45:06.210+0000","title":"Selección Oculta - Reclutamiento Normal","subforum":"Charlas Generales","up_votes":70,"down_votes":5,"body":"La noticia de hoy me ha sentado p&eacute;simamente y, no solamente a m&iacute;; recorr&iacute; los foros de otras regiones, al menos las que puedo entender:\nhttp://imgur.com/a/60dbS\nDesde la creaci&oacute;n del **Team Builder** y, el posterior lanzamiento de **Normal Reclutamiento**, no he vuelto a jugar Selecci&oacute;n Oculta. Es de lo peor del juego. &iquest;C&oacute;mo tuvieron la **ingenuidad** de creer que alguno de esos sistemas triunfe o prospere, si jam&aacute;s retiraron o suspendieron temporalmente la selecci&oacute;n t&oacute;xica? Parece rid&iacute;culo, cas&iacute; que su destino siempre fue fracasar.\nSi lo que quieres RIOT, es recabar datos, yo te los voy a dar. **Voy a subir capturas de cada vez que me trolleen** (o se lo hagan a alguno de los participantes del lobby) en Selecci&oacute;n Oculta, en res&uacute;menes semanales. Lo har&eacute; no solo en el foro, sino tambi&eacute;n en Soporte. Quiz&aacute; no sea la gran cosa pero me tomar&eacute; el tiempo de hacerlo, y** espero que m&aacute;s invocadores lo hagan**. Es una l&aacute;stima porque realmente me gusta este juego, pero algunas decisiones de la compa&ntilde;&iacute;a me parecen realmente absurdas.\n\n\nAqu&iacute; adjunto la [**petici&oacute;n**](https://www.change.org/p/riot-games-we-want-riot-games-to-give-back-draft-pick-for-all-servers) que hizo el invocador **AresC**\n\nSaludos.\nDarkfoe703 {{champion:37}}","replies":[{"poster":"Atöm ","date":"2016-11-09T09:15:59.803+0000","up_votes":13,"down_votes":1,"body":"Juego desde finales de la S2 y la verdad es que en esos tiempos la diferencia entre Selección Oculta y Reclutamiento era bastante mínima, ya que solo resaltaba el hecho de que una persona podía hacer 3 bans por lado. Ahora la diferencia entre un sistema y otro es totalmente abrumador, ya que de antemano puedes escoger tus dos líneas más fuertes y eliminar una que no deseas jugar, lo que genera que cada jugador parte con una línea predefinida (reduciendo las peleas y toxicidad entre jugadores por ir una línea), los 3 últimos jugadores se reparten los bans para no ver campeones fuertes, sin contar que ahora en el nuevo cliente la animación en el sistema de pickeo es mucho mejor, y varias características más que se pierden con la Selección Oculta y que solo serán disponibles al jugar Clasificatorias, lo que considero totalmente injusto.\n\nEntiendo que al implementar ahora dos tipos de colas diferentes de Clasificatorias (Solo/Duo y Dinámica) los jugadores se dispersen en colas distintas , lo que hará que el número de jugadores se reparta aún más, pero podrían perfectamente eliminar de las colas Normales la Selección Oculta y mantener la Selección Reclutamiento, debido a las innegables ventajas que esta última posee por sobre la otra.","replies":[{"poster":"LoLGas5","date":"2016-11-10T14:56:43.097+0000","up_votes":2,"down_votes":0,"body":"Amigo, es algo que casi todos vemos pero Riot es un poco ciego.","replies":[]},{"poster":"Darkfoe703","date":"2016-11-09T15:05:30.221+0000","up_votes":2,"down_votes":1,"body":"Gracias por el apoyo :)\n\nSaludos","replies":[]},{"poster":"Font","date":"2016-11-11T02:46:58.703+0000","up_votes":1,"down_votes":1,"body":"De hecho no creo que puedan eliminar las Normales de Seleccion Oculta, a mucha gente le molestaria eso tambien (como a mi, que me gusta entrar a una normal y no tener q perder 30 min en baneos y seleccion de campeones, ya que para eso estan las clasificatorias)","replies":[]}]},{"poster":"Majora","date":"2016-11-10T08:03:46.997+0000","up_votes":6,"down_votes":0,"body":"El tema cental acá es la Cola Flexible. \n\nComo ya había leido respuestas de rioters quienes literalmente dijeron \"Los que quieran jugar draft, que jueguen la CF, es más competitiva que las normals, pero menos que las Clas SoloQ.\"\n\nY acá es donde algunas cosas empiezan a hacer ruido, constantemente atribuyen este cambio a que quieren mantener una cola 《SALUDABLE》 (Habría que preguntarles en todo caso, que entienden y que encierran dentro de este termino.)\n\nSi nosotros entendemos como 《SALUDABLE》 a mantener una competitividad justa, donde cada quien juega lo que quiere sin necesidad de tener una PC y un internet rápidos, el Draft es la opción más OBVIA.\n\nEl problema es que el Normal Draft le hace una injusta competencia a la CF. Si leyeron las novedades de la Temporada 7 Riot Games está ansioso de que juguemos la CF, hasta incluso van a dar el aspecto victorioso a quienes alcancen Oro en esta Cola (Tirando abajo todos los esfuerzos de los SoloQ)\n\nNo es raro? Dijeron que la T6 fue un error por la Cola Dinamica... y ahora la Cola Flexible es exactamente lo mismo (Y reemplazo las Normal Draft)\n\nMiremoslo, tenemos 3 colas, una Clasificatoria SoloQ, una Clasificatoria Flex y una Normal Draft (Cuyas estas dos ultimas son EXACTAMENTE IGUALES).\n\nSu estrategia es esa, que juguemos así... y nos arrinconaron a todos los servers menos a tres a jugar y testear su Cola Flexible.\n\nBlind trae más problemas, todos los que jugamos constantemente, los conocemos. Pero ya eligieron hacernos pagar ese precio. Su CF a costa de un juego sano.\n\nCon respecto a la respuesta sobre los \"beneficios\" que andan copypasteando algunos de letras amarillas: TODO LO QUE ENUMERAN, TODOS ESOS BENEFICIOS, NO SON NUEVOS DE LA COLA FLEXIBLE, YA ESTABAN EN EL DRAFT.\n\nA quien se haya tomado la molestia de leer hasta acá, muchas gracias.","replies":[{"poster":"Darkfoe703","date":"2016-11-10T21:50:47.843+0000","up_votes":1,"down_votes":0,"body":"Gracias a vos por pasar y dar tu opinión :-)\n\nSaludos","replies":[]}]},{"poster":"AdaggioOP","date":"2016-11-09T05:24:25.613+0000","up_votes":6,"down_votes":1,"body":"Voy a hacer lo mismo. Son un asco riot","replies":[]},{"poster":"Ranpage","date":"2016-11-09T15:32:47.555+0000","up_votes":1,"down_votes":14,"body":"Yo e jugado blind pick de siempre y solamente veo por mes 1 o 2 personas que trolean hasta un máximo de 6  se que en reclutamineto te encuentras 1 cada 3 meses porque una vez me toco uno haci  cuando jugué reclutamiento de repente pero lo que no entiendo que yo creo que por lo menos los que juegan reclutamiento 70% de la gente no se le ni a ocurrido jugar blind pick y apenas no vio que esta reclutamiento se fue a decir que me tocan puros troll que son puros ratas los que juegan blind pick y blablá y lo peor que se quejan de un juego que es COMPLETAMENTE GRATUITO y que si lo dejas no pierdes nada excepto si invertiste dinero hay si pero fue tu decisión si no te jugasta el juego o como funciona te puedes ir simplemente y volver a jugarlo si quieres pero lo que también encuentro PEOR es que lo colaran en 1 semana de nuevo porloemenos y aun haci hayn un foro bardo COSMICO","replies":[{"poster":"Darkfoe703","date":"2016-11-09T15:40:51.503+0000","up_votes":7,"down_votes":0,"body":"Amigo, primero que nada, me cuesta entenderte sin puntos ni comas. Segundo, yo juego desde antes del modo reclutamiento (obviamente Blind Pick) y no hubo caso, la mejora de la experiencia que supuso el Team Builder en adelante para mí fue impresionante. Y por último, no sé a qué caso viene lo del juego gratuito. No he mencionado jamás algo relacionado con el dinero, ni la posibilidad de dejar el juego en caso de que bla bla bla, como si de un berrinche se tratara.\n\nSaludos","replies":[{"poster":"LoLGas5","date":"2016-11-10T15:11:08.615+0000","up_votes":2,"down_votes":0,"body":"El team builder fue un fracaso total pero fue el paso previo al exito del nuevo modo ;)\nY lo otro que no entiendo ¿que tiene que ver que el juego sea gratuito? Nos pueden poner cualquier mierda solo porque sea gratuito o.O","replies":[]}]}]},{"poster":"ChronoGrandpa","date":"2016-11-09T21:45:45.545+0000","up_votes":3,"down_votes":0,"body":"firmado y a spammear por los post de rioters :v\n\n(acabo de mandarlo al canal de youtube de riot games en mensaje)","replies":[{"poster":"Darkfoe703","date":"2016-11-10T00:21:09.229+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ElTatoX,realm=LAS,application-id=v7qsfXsE,discussion-id=pVlrlvm9,comment-id=0007,timestamp=2016-11-09T21:45:45.545+0000)\n>\n> firmado y a spammear por los post de rioters :v\n> \n> (acabo de mandarlo al canal de youtube de riot games en mensaje)\n\nGracias :-)","replies":[]}]},{"poster":"ThePunkRocker","date":"2016-11-09T18:07:26.140+0000","up_votes":4,"down_votes":1,"body":"que nos den el pase a br gratis, no puede ser que hagan esta terrible manqueada, yo no juego rankeds me estresan prefiero divertirme en normales y el sistema de baneos y el sistema de elegir el rol que querias ir era perfecto ahora tengo que bancarme los instalock , las ratas, los zed yasuoo riven darius sup, las puteadas desde seleccion de champ... naaa esto es joda ya","replies":[]},{"poster":"Hwaxinghz","date":"2016-11-09T17:46:17.423+0000","up_votes":2,"down_votes":1,"body":"Ya escribí sobre el tema, también, y le doy +1 a todos los posts de este tipo porque NO PUEDE SER que tengamos que fumarnos partidas en donde veamos mínimo 3 asesinos del lado enemigo y sin chances de contraarrestarlos (con bans por ejemplo) ya que pueden ser randoms. Como ADC me quedo bastante frustrado.","replies":[{"poster":"Darkfoe703","date":"2016-11-09T18:08:02.994+0000","up_votes":2,"down_votes":0,"body":"Gracias, gracias a todos de verdad, por pasar y leer. Esto es también una invitación. Riot quiere datos de como van a ser las cosas, bueno, démosle esos datos. Serán sus datos contra los nuestros.\n\nSaludos","replies":[]}]},{"poster":"Futishh","date":"2016-11-09T17:46:33.678+0000","up_votes":2,"down_votes":1,"body":"Estoy totalmente de acuerdo con lo que dices, no solo eso hay veces que un campeón se repite en muchas ocasiones (Yasuo, Zed, Vayne cof cof) y esta cola permite banearlos para ver mas diversidad de campeones. Saludos c:","replies":[]},{"poster":"LoLGas5","date":"2016-11-10T14:59:59.541+0000","up_votes":1,"down_votes":0,"body":"Y deberian hacer otra petición para que quiten definitivamente la selección oculta como cola normal.","replies":[]},{"poster":"Renekor","date":"2016-11-09T18:24:58.955+0000","up_votes":1,"down_votes":15,"body":"Hola, vengo a darle negativos a todos los del post","replies":[]}]}