{"poster":"EnteKlaert","date":"2017-01-24T01:12:12.411+0000","title":"Nicht schon wieder oder?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":8,"body":"Warum kriege ich zurzeit wieder die Feeder ab? Muss man echt aufh&ouml;ren mit lol?\r\n\r\nMein letztes Garen Game gegen einen Darius (er hat in mich reingepickt) war eine tolle Seju am Start....\r\n\r\nSie pingt das sie mir helfen will und auf Toplane kommt... Dann passiert das... Sie macht erstmal ganz in Ruhe den Blue dann die W&ouml;lfe und Chattet noch neben bei mit ihrem Mate.\r\n\r\nAlles sch&ouml;n und gut aber dann wenn man richtig ist am verlieren ist und als Garen schon gedived wird sollte man doch vllt checken das er Hilfe braucht oder? \r\n\r\n\r\nOder manche andere Games ... Ich stehe echt gut habe viele Kills und wenig Tode und Cs ist halt so SIlber Niveau :D\r\nIch probiere dann auch meist andere Lanes zu feeden aber es scheitert zurzeit immer die m&uuml;ssen einfach richtig rein sucken und alles hoch feeden an den Gegnern was geht... \r\n\r\nIch weiss ich bin auch nicht der beste und ich feede auch mal aber ey nach 0/2 spiele ich richtig safe und die engagen dann noch 1v2 ...\r\n\r\nWas soll man da denn bitte machen? Freiwillig gleich abranken oder muss man echt aufh&ouml;ren mit League?\r\n\r\nMir macht das Spiel spa&szlig; aber wenn gef&uuml;hlt dein Team aus 10-12 J&auml;hrigen ohne Verstand besteht und das Gegner Team aus Gold Leuten hat es einfach keinen Sinn und zerst&ouml;rt mit den Spielspa&szlig;...\r\n\r\nW&uuml;rde mich &uuml;ber &gt;&gt;Hilfreiche&lt;&lt; Tipps freuen \r\n\r\n\r\nUnd nochmals ich bin kein Challenger und mache auch noch ziemlich viele Fehler aber es nervt einfach... und ich kann es einfach nicht mehr...\r\n\r\n\r\nMfg Ente","replies":[{"poster":"MeMyselfandBaal","date":"2017-01-24T05:22:20.332+0000","up_votes":7,"down_votes":1,"body":"Also ganz ehrlich: Wenn ich in einem Matchup so weit zurück falle, dass ich in nem 1vs1 Towerdive getötet werden kann... dann suche ich die Schuld nicht beim Jungler.\n\nUnd ja, es gibt ungünstige Matchups (wobei ich auf der Toplane keine Ahnung habe, wer da gegen wen wie gut ist). Aber keines dieser ungünstigen Matchups ist sooo schlecht, dass du garantiert Hilfe brauchst um nicht frühzeitig zu sterben.\n\nGanz ehrlich... in dem beschriebenen Szenario hätte ich als Jungler auch gedacht \"Leck mich doch!\" Die wird vielleicht einfahc 45 Sekunden im Voraus gedacht haben. Wollte halt erst noch fix den Blue machen und sagte dir \"Ich komm gleich, mach so lange keine Dummheiten\"... und dann machst du Dummheiten und beschwerst dich über den Jungler... ja GeGe.\n\nDu willst einen hilfreichen Tipp haben: Frage dich nicht nach einem Tod, wo dein Jungler war. Frage dich, was du falsch gemacht hast.","replies":[{"poster":"Sophie973","date":"2017-01-24T09:21:07.110+0000","up_votes":2,"down_votes":0,"body":"Frage auch nicht was du Falsch gemacht hast, sondern finde eine Lösung, wie du es hättest BESSER machen können. Also:\nFrage dich nicht nach einem Tod, wo dein Jungler war\nFrage dich was du hättest besser machen können.","replies":[]},{"poster":"EnteKlaert","date":"2017-01-24T12:03:02.613+0000","up_votes":2,"down_votes":1,"body":"Ich glaube du hast es nicht so wirklich verstanden... Ein Darius hat mich nicht alleine gedived sondern der Shaco kam auch dazu.. und der war nur paar Meter von Seju entfernt!","replies":[{"poster":"MeMyselfandBaal","date":"2017-01-24T12:23:20.316+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=EnteKlaert,realm=EUW,application-id=Wj1wcocU,discussion-id=OezVUv46,comment-id=00030001,timestamp=2017-01-24T12:03:02.613+0000)\n>\n> Ich glaube du hast es nicht so wirklich verstanden... Ein Darius hat mich nicht alleine gedived sondern der Shaco kam auch dazu.. und der war nur paar Meter von Seju entfernt!\n\nÄhm... ja, das habe ich wohl falsch verstanden. Hauptsächlich, weil du Shaco jetzt zum ersten Mal erwähnst und deine Story gerade um 180 Grad gedreht hast. Oder seit wann ist der Bluebuff nur \"ein paar Meter\" entfernt. \n\nDas Ergebnis bleibt dasselbe: Hättest du Shaco nicht kommen sehen können? Kann man nicht ahnen, dass der den Jungle schneller cleared und mit seinem mächtigen Level 3 Gank kommt? (Ich kann das, ich banne deswegen Shaco... und wenn ich wirklich gegen ihn spielen muss, spiele ich erst Mal sehr vorsichtig.) Hätte ein besser platziertes Ward die ganze Situation verhindert? Wie kann ich es verhindern, dass ich nach dem einen Gank 1-8 gehe?\nAlles Dinge, mit denen ich mich eher beschäftigt hätte, als mit den Fehlern, die der Jungler vielleicht auch gemacht hat.\n\nDeine \"Ich war ganz bestimmt absolut unschuldig und der Jungler hat mir das Game versaut\" Einstellung ist die sicherste Variante nicht besser zu werden.","replies":[]},{"poster":"AmazingJX","date":"2017-01-24T19:41:36.586+0000","up_votes":1,"down_votes":0,"body":"Ein shaco?  Warding?  Tank?  Du musst lernen das Spiel zu verstehen dann gewinnst du alleine und benötigst gar nix... Als Tipp niemals garen zuerst picken das ist echt dämlich","replies":[]}]}]},{"poster":"Nohgolgh","date":"2017-01-24T04:23:31.754+0000","up_votes":2,"down_votes":0,"body":">Warum kriege ich zurzeit wieder die Feeder ab? Muss man echt aufhören mit lol?\n\nDieser Teil passt überhaupt nicht zum Rest der Story. Haben sie gefeedet oder dir nur nicht geholfen?\n\n>Mein letztes Garen Game gegen einen Darius (er hat in mich reingepickt) war eine tolle Seju am Start....\n\n>Sie pingt das sie mir helfen will und auf Toplane kommt... Dann passiert das... Sie macht erstmal ganz in Ruhe den Blue dann die Wölfe und Chattet noch neben bei mit ihrem Mate.\n\nJa, Jungler in der low Elo können ziemlich zum Kotzen sein. Also wie eigentlich alle anderen Rollen auch. Beim Jungler merkt man es nur am schnellsten, weil sie den meisten Impact im Spiel haben. Ich finde übrigens den Garen-Pick nicht sonderlich stark, weil er Matchups hat, die er schnell verliert und im Late gegenüber den \"richtigen\" Tanks and Impact verliert. Bessere Picks sind (meiner Meinung nach) Poppy, Maokai, Nautilus, Nasus, Trundle und Kayle, weil diese sowohl dem Team helfen können, als auch einfach splitpushen können, wenn dieses richtig schlecht ist. Diese Champs haben auch das Potential, die Lane zu gewinnen (wobei Nasus und Maokai länger brauchen, als der Rest).  Etwas situativer, aber immer noch solide, sind Darius, Irelia und Mundo. Grundsätzlich sollte man nie davon ausgehen, dass Leute auf deiner Elo dir beim Climben helfen können. \n\nUnd ich falle auch häufiger auf einen zu frühen Ping des eigeen Junglers herein und gehe dann hart rein. Aber um fair zu bleiben, man sieht den eigenen Jungler auf der Map und sollte durchaus auch im Kopf behalten, wo der sich gerade befindet. \n\n>Alles schön und gut aber dann wenn man richtig ist am verlieren ist und als Garen schon gedived wird sollte man doch vllt checken das er Hilfe braucht oder? \n\nWenn du Garen spielst und deine Lane verloren hast, kann es Sinn machen jemandem, der noch nicht behind ist, zu helfen. Warum sollte der Jungler jemandem helfen, der bereits gezeigt hat, dass er im Lanematchup behind fällt? Dazu kommt, dass Jungler vom Decisionmaking den härtesten Job haben. \n\n>Oder manche andere Games ... Ich stehe echt gut habe viele Kills und wenig Tode und Cs ist halt so SIlber Niveau :D\nIch probiere dann auch meist andere Lanes zu feeden aber es scheitert zurzeit immer die müssen einfach richtig rein sucken und alles hoch feeden an den Gegnern was geht... \n\nHab ich auch schon getan und oft stellt es sich als falsche Strategie heraus. Wenn du jemandem Ressourcen zuschiebst, der nicht carrien kann, anstatt selbst zu carrien, dann reduzierst du deinen Impact. Wenn ich besipielsweise Ahri Midlane spiele und meine Botlane nach acht Minten dreimal gestorben ist, ich aber selbst im Vorteil bin, dann roame ich nicht zur Bot. Abhängig davon, wie gut mein Toplaner steht, fällt dann die Entscheidung zwischen den Turm einreißen und auf der eigenen Lane weiter Druck zu machen oder aber zur Top zu Roamen, dort ein Play zu machen und hoffentlich den Turm zu kriegen. Oftmals hilfst du deinem Team mehr und setzt dich weniger behind, wenn du Aggro auf dich ziehst, als wenn du ein Play mit einem Mitglied, das weit behind ist, forcierst. \n\n>Ich weiss ich bin auch nicht der beste und ich feede auch mal aber ey nach 0/2 spiele ich richtig safe und die engagen dann noch 1v2 ...\n\nErstmal: 0/2 kann passieren. Zweitens: gut ist es trotzdem nicht. Gerade gegen Champs mit viel Snowballpotential kann so etwas verheerend sein. \n\n>Was soll man da denn bitte machen? Freiwillig gleich abranken oder muss man echt aufhören mit League?\n\nEine dritte Option wäre, besser zu werden. \n\n>Mir macht das Spiel spaß aber wenn gefühlt dein Team aus 10-12 Jährigen ohne Verstand besteht und das Gegner Team aus Gold Leuten hat es einfach keinen Sinn und zerstört mit den Spielspaß...\n\nDeine Mitspieler und Gegner werden aus den gleichen Spielerpool gezogen. Sicher kann man mal pech haben und sogar aufgrund schlechter Teams 1-2 Divisionen verlieren, aber dann steigt die Winrate drastisch an. Ebenso fällt die Winrate drastisch ab bei nur 1-2 Divisionen über der Elo. \n\n>Würde mich über >>Hilfreiche<< Tipps freuen\n\n>Und nochmals ich bin kein Challenger und mache auch noch ziemlich viele Fehler aber es nervt einfach... und ich kann es einfach nicht mehr...\n\nWähle Champions mit einfachen Mechaniken, mit denen du genug Übung hast, um jedes Matchup mindestens überstehen zu können (für die Mitte: Ahri, Lux, Morgana) oder die sehr einfach die Fehler der Gegner ausnutzen können (für die Mitte: Annie, Malzahar). Diese Champs sollte mit dem Team spielen können, wenn dieses vorne ist, aber nicht auf dieses angewiesen sein. \n\n[Hier](http://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/5BJ4yNEE-gegen-cho-gath-gewinnen-und-ranked-carrien?comment=000000000000) habe ich einen längeren Post geschrieben und die zweite Hälfte davon könnte dich vielleicht interessieren oder dir weiterhelfen.","replies":[{"poster":"EnteKlaert","date":"2017-01-24T12:09:07.044+0000","up_votes":2,"down_votes":1,"body":"Naja danke dir auf jedenfall ich werde keine feeder lane mehr Kills geben daher sie eh nicht carryn werden :P Danke dir!","replies":[]},{"poster":"5weeds","date":"2017-01-24T10:32:58.815+0000","up_votes":1,"down_votes":0,"body":"Wunderschöner Kommentar ^^\nDanke dafür :3","replies":[]}]},{"poster":"Serlaya","date":"2017-01-24T02:40:27.259+0000","up_votes":2,"down_votes":3,"body":"/mute all und Reporten. Vielleicht nach ner Loosing Streak 2 oder 3 Tage Pause machen. Das hat mr bei nem riesigen Drop (D2 auf D4) geholfen.","replies":[{"poster":"Megamaexx","date":"2017-01-24T10:04:52.109+0000","up_votes":2,"down_votes":0,"body":"Das löst nicht die Probleme, die er angesprochen hat. Einen nicht gankenden Jungler zu muten, hat keinerlei Effekt.\nEin Reportgrund ist das auch nicht. \n\nEinen schlechten Spieler zu muten, der den Chat nicht nutzt, ist ebenso sinnfrei.\nAuch hier fehlt der Reportgrund. \n\nAlso muten und reporten sorgt nicht dafür, dass man fähigere Mitspieler bekommt oder man schlechtere Spieler carrien kann.","replies":[]}]},{"poster":"0815xand0r","date":"2017-01-24T10:30:50.566+0000","up_votes":1,"down_votes":0,"body":"Du sagst also im Endeffekt, dass du nicht perfekt bist und Fehler machst, aber wenn andere Spieler auf deinem Niveau Fehler machen, ist das plötzlich dermaßen dramatisch?","replies":[{"poster":"EnteKlaert","date":"2017-01-24T12:08:05.567+0000","up_votes":1,"down_votes":1,"body":"Ich verstehe es aber nicht... wenn man schon 0/2 steht warum geht man dann immer noch in? Wenn man weiss es schafft man nicht -.- Die denken sich Yolo! Und gehen dann all in","replies":[{"poster":"0815xand0r","date":"2017-01-24T12:54:51.657+0000","up_votes":1,"down_votes":0,"body":"Wenn du einen Fehler machst, denkst du dir dann auch vorher, dass das jetzt richtig dumm sein wird, was du vorhast? \nEs heißt nicht umsonst, im Nachhinein sei man klüger. \nDiese Spieler wissen eben nicht, dass es dumm ist, was sie Vorhaben und glauben auch mit diesem Rückstand ein 1v1 gewinnen zu können. \n\nMenschen machen Fehler, weil sie glauben, dass es kein Fehler sei. Da sind deine Mates nicht anders als du.","replies":[]}]}]},{"poster":"spvcevvitch","date":"2017-01-24T03:49:37.570+0000","up_votes":1,"down_votes":0,"body":"Tipps dafür gibt es keine, man kann nichts für die Fehler die andere begehen.\nSie müssen aus ihren Fehlern lernen, vielleicht solltest du sie darauf freundlich hinweisen auch wenn es oft schwer ist nett zu bleiben.\nWenn nicht such dir ein paar Leute mit denen du Spielen kannst.\nLg. Wine","replies":[]}]}