{"poster":"Sinisterblade27","date":"2017-09-13T21:23:48.169+0000","title":"League ban problems ?","subforum":"Player Behavior","up_votes":0,"down_votes":4,"body":"I got ban today I got to check email because it told me to check, but when I get into email there no riot mesege.IDK WHAT THE HECK IS HAPPENING, I MY BEING TROLLLED, IS THIS SERIOS, IDK. Riot games can you guys please check my acount to see if I really did something rong because as far as I&#039;m comseren I didn&#039;t do anything rong, shore I did leave 1 game because my ms was over 1000 but I didn&#039;t get reported and yerstoday I think it was yerstoday I was gave some key fragment for keeping it up sport man ship. RIOT GAME IF I DID SOMETHING RONG IM SORRY. But riot you guys need to know that pple have been sending me a mesege that acts like a RIOT GAME mesege, it says that your acount will be bean after your game, I got troled with this text 3 times. Btw if use gping to ban some one at least give the money back if youre not giving the acount back. I feel like I&#039;m being to gresive with you riot RN but it is the awful truth.","replies":[{"poster":"Squidwards House","date":"2017-09-13T21:25:34.752+0000","up_votes":1,"down_votes":0,"body":"am i allowed to slap you with a dictionary? my brother just facepalmed at your post and its his 2nd year learning english.","replies":[{"poster":"Sinisterblade27","date":"2017-09-13T21:27:28.607+0000","up_votes":1,"down_votes":0,"body":"I'm sorry I'm just really pised by the ban I got btw spanish is my 1 st language I'm learning English","replies":[{"poster":"Chermorg","date":"2017-09-14T00:42:55.783+0000","up_votes":1,"down_votes":0,"body":"Que tengas mucho suerte en tus estudias de Ingles!\n\nOn a serious note, your English is very good, especially because you were probably distressed when writing it. As Ulanopo said, you're fine and the person who said that was being mean :(","replies":[]},{"poster":"Ulanopo","date":"2017-09-13T22:29:49.429+0000","up_votes":1,"down_votes":0,"body":">I'm sorry I'm just really pised by the ban I got btw spanish is my 1 st language I'm learning English\n\nRelax. You're doing fine.","replies":[]}]}]},{"poster":"Selegun","date":"2017-09-13T21:39:08.178+0000","up_votes":1,"down_votes":0,"body":"Double check your spam folder in email and make sure you dont have any extra folders to partician emails to.  If nothing shows up there is a link at the bottom of this page for support.  I recommend submitting a ticket to see if there is anything they can show you about your ban.  This process can take a while so don't feel discouraged.  (My last ticket took 2 days as it was submitted on a weekend.)","replies":[{"poster":"Sinisterblade27","date":"2017-09-13T21:45:31.289+0000","up_votes":1,"down_votes":0,"body":"THX YOU SO MUCH","replies":[{"poster":"Selegun","date":"2017-09-13T23:27:10.215+0000","up_votes":1,"down_votes":0,"body":"No problem, hope you find out whats going on!","replies":[]}]}]},{"poster":"YerroFever","date":"2017-09-13T21:47:19.151+0000","up_votes":1,"down_votes":0,"body":"If you log in and the game interface says you're banned and you cannot play the game, then you're banned. If you got a whisper from someone on your friends list, then no, your friend is playing a mean joke on you.\n\nYou will get a confirmation email later. It isn't always done at the same time. Sometimes the emails are delayed by a few days.","replies":[]},{"poster":"Friendly Ram","date":"2017-09-13T21:46:00.821+0000","up_votes":1,"down_votes":0,"body":"please copy paste the card you get when you try and log into your account and i can try and direct you.","replies":[]},{"poster":"Sinisterblade27","date":"2017-09-13T21:34:41.471+0000","up_votes":1,"down_votes":0,"body":"IM SO SORRY i wrote down rong a lot of thing in that post my 1st language isn't English I'm learning English","replies":[]},{"poster":"Lippen27","date":"2017-09-13T21:31:00.134+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sinisterblade27,realm=NA,application-id=ZGEFLEUQ,discussion-id=7KKPRAsa,comment-id=,timestamp=2017-09-13T21:23:48.169+0000)\n>\n it says that your acount will be bean after your game,","replies":[{"poster":"Sinisterblade27","date":"2017-09-13T21:33:54.742+0000","up_votes":1,"down_votes":0,"body":"Will be ban I meant that I'm really sorri","replies":[]}]}]}