{"poster":"JVIGNAU3","date":"2018-08-10T00:11:47.146+0000","title":"Porque Halo no recibio un pedazo de mapa????","subforum":"Charlas Generales","embed":{"description":"Síguenos en Instagram: Ness: https://www.instagram.com/ness_el_mel... Halo: https://www.instagram.com/arte_de_hal... Recuerda también seguirnos en: https://www.facebook.com/paratarados https://twitter.com/GuiaParaTarados","url":"https://youtu.be/Jz02-aHNn9o","image":"https://i.ytimg.com/vi/Jz02-aHNn9o/hqdefault.jpg"},"up_votes":55,"down_votes":12,"body":"Halo y Ness hacen contenido del universo del LoL hace unos a&ntilde;os dedicando parte de su vida para ampliar la comunidad del LoL, ademas de que le gusta eso. Pero me parece muy injusto que a pesar de esto no le den un minimo reconocimiento. Piensen mas en la comunidad.","replies":[{"poster":"Jhin el Virtuoso","date":"2018-08-10T00:42:02.888+0000","up_votes":21,"down_votes":3,"body":"Para quienes no saben quien es Halo,o el canal llamado \"Guia para tarados\",es un canal de Youtube donde 2 usuarios suben contenido,la gran mayoría sobre League of Legends,llevan almeno 3 años subiendo contenido y hace 2 de esos años se abrió una sección llamada \"LoL Universo\",donde subían teorías,historias,cómics etc...todo lo que era lore.\n\n¿Cual es el problema?\n\nHace unas semanas,luego de publicar el mapa oficial de LoL,se entregaron posters que eran mas que nada un trozo del mapa del juego,siendo enviados a gente la cual subía lore y/o contenido aparte de gameplays del juego y a la \"guia para tarados\" le dieron nada mas ni nada menos que un leído,tanto por Twitter como por otras redes sociales,ante esto Halo (uno de los creadores de contenido del canal) entro en angustia y en forma de reclamo decidió anunciar el cierre de \"LoL Universo\",por lo que muchos de sus fans están posteando reclamos por lo que paso,por el poco o nulo reconocimiento que recibió.\n\neso.\n{{champion:202}}","replies":[]},{"poster":"Nuke","date":"2018-08-10T15:32:29.748+0000","up_votes":10,"down_votes":1,"body":"Weeee\nMiren en este comentario voy a ser seguramente muy redundante y voy a escribir bastante, es dificil expresar mi opinión al respecto pero voy a hacer un intento:\n\n¿Cerró la serie por un pedazo de mapa? Amigo, para mi el tipo simplemente se excusó con ello, para que sus fans molesten a Riot posteando 100000 veces que le den un mapa para que vuelva la serie y de paso tener una razón para cancelarla. \n\nTampoco me parece correcto esa sucia protesta de cerrarle a sus fans esa sección. Osea, no digo que esté mal cerrarla, pero hacerlo a forma de protesta... A ellos (los fans) les importa un bledo su pedazo de mapa (a la mayoría por lo menos), los fans solo quieren la serie y lo hacen solo por ello. Seguro si Halo se hubiera quejado, pero no hubiera cancelado la serie no tendría ni 1/4 del apoyo que tiene y es triste pensar que mucha gente seguramente se queja disfrasándose de justicieros cuando realmente solo están llorando porque le quitaron un dulce. \n\nEsto me parece algo malo desde Halo (porque ahora van a estar hinchandole las pelotas a Riot durante meses seguro, Y ÉL LO HIZO CON ESA INTENCIÓN) y desde sus fans, porque jo, tuvo que quitar la serie para que le den bola, osea... Sean mas solidarios con el tipo que necesita cerrar su serie para que volteen a ver. Si no lo hacía, como digo, no tendría ni 1/4 del apoyo que tiene.\n\nA él no le dieron un pedazo del mapa. Ok, pero ¿De esta forma espera solucionarlo? ¿Con quejas de insultos y amenazas hacia Riot de parte de sus fans? No señor xD, eso va a hacer que Riot tenga aún menos ganas de darte el mapa. Y si lo hace, va a ser con mala gana, ¿Vos creés que te va a ver bien Riot después de todo este lío? Eso es como insultar a un tipo que juega mal para que juegue mejor, desde mi punto de vista. Riot hace algo mal, y vos le protestás cerrando una serie que a los fans le encantaba, obviamente estás buscándo un escándolo ahi. Podrías simplemente hacer una petición más pacífica, hablando tranquilo y amable sin alterar a los fans y, quizá no consigas lo que querés, pero es mucho mas honorable que esto xD... Que tampoco creo que consigas algo con esto.\n\nQuiero cerrar con esto:\n\n**Asi, con tantas jodid*s quejas por CUALQUIER COSA cada que Riot quiere hacer algo por la comunidad, va a llegar el momento donde dejen de hacerlo, ahi si que los quiero ver llorar. **","replies":[{"poster":"Nísta","date":"2018-08-11T00:45:34.766+0000","up_votes":1,"down_votes":0,"body":"Pensé por un momento que estaba bien lo que hizo como protesta, pero leyéndote me la pensé dos veces y cambié de parecer. +1","replies":[]}]},{"poster":"Riot Nebo","date":"2018-08-10T23:37:55.385+0000","up_votes":11,"down_votes":2,"body":"Hola chicos\n\nEsta iniciativa también se realizó para creadores de contenido de Latam.\n\nUno de estos creadores fue Poppy Noticiera y [PBE of Legends](https://www.facebook.com/pg/PBEofLegends/posts/?ref=page_internal), quien lleva años colaborando en su fanpage y también en el foro. Por ahora hay otro creador de Latam que también lleva años publicando contenido referente a historias y lore de League of Legends (aún no ha hecho su publicación). \n\nEl proceso fue en colaboración con el equipo de Central encargado del mapa de Runaterra, las regiones presentaron sus postulaciones y central seleccionó a un par por cada región.\n\nHalo y Ness estaban (junto a mas creadores) en esa postulación, pero no fueron seleccionados, pero eso no significa que no fueran tomados en cuenta. \n\nEsta es una de las primeras colaboraciones que hacemos con Creadores de Contenido de Latam y sabemos que hay muchas personas que hacen este tipo de contenido en todo el mundo, pero lastimosamente no podemos seleccionar a todos (me encantaría poder seleccionar a muchos).\n\nUn abrazo,","replies":[{"poster":"Nísta","date":"2018-08-10T23:47:33.927+0000","up_votes":2,"down_votes":0,"body":"¿Y qué pasó con Coolifegame? ¿Jota? ¿Catacroquer?","replies":[{"poster":"Riot Nebo","date":"2018-08-11T00:11:00.050+0000","up_votes":7,"down_votes":0,"body":"Ellos son de España, yo no tengo información sobre ellos, lo lamento :(","replies":[{"poster":"Nuke","date":"2018-08-11T01:52:00.495+0000","up_votes":2,"down_votes":0,"body":"Ostia :/","replies":[{"poster":"Sir Crucifix ","date":"2018-08-14T20:40:09.371+0000","up_votes":2,"down_votes":0,"body":"No se dice ostia , se dice pucha!","replies":[]}]}]}]},{"poster":"IvVicious","date":"2018-08-11T00:24:40.616+0000","up_votes":1,"down_votes":0,"body":"Tengo una pregunta, ¿cuál es el punto de darle un reconocimiento sobre **NARRATIVA** a alguien que crea contenido sobre **JUGABILIDAD**?\n\n\n~~Qué coincidencia que uno de los creadores beneficiados sea amarillo, ¿no?~~","replies":[{"poster":"Riot Nebo","date":"2018-08-11T00:28:44.291+0000","up_votes":6,"down_votes":1,"body":"Hola\n\nPresumo que el contenido de jugabilidad, lore, narrativa, novedades y el animo de mantener informada a la comunidad fue un factor decisivo.\n\nEl reconocimiento no era por solo hacer cosas del Lore de League.\n\nLo del amarillo creo que Central no sabe incluso que es voluntario, entonces no influye en nada, porque básicamente vieron el contenido de su fanpage y canal.\n\nUn abrazo,","replies":[]}]},{"poster":"Naruto 2010","date":"2018-08-11T02:13:24.885+0000","up_votes":3,"down_votes":0,"body":"No le den nada a HALO y al otro, se hacen los ofendidos ahora y dicen que dejaran de hacer por no recibir reconocimiento. Estuvieron bien al no darles anda, se demostro que no les interesaba tanto como pintaban.\nBien hecho RIOT","replies":[]},{"poster":"Hnk Kenshiro","date":"2018-08-11T00:32:41.726+0000","up_votes":2,"down_votes":1,"body":">Uno de estos creadores fue Poppy Noticiera y PBE of Legends, quien lleva años colaborando en su fanpage y también en el foro.\n\n\nAmmm, si miramos su perfil del foro sus últimos 5 comentarios tienen meses y alcanzan el año de antigüedad.\n\n\nY en su página lo que mayormente se ve son las mismas noticias de lol que se publican en la página pero las sube un poco antes.\n\n\nOsea, ningun problema con poppy, y habrá quienes quieran enterarse primero que nadie sobre la información, ¿Pero el mejor creador de contenido nominado fue alguien que únicamente hace un copy paste de las noticias?","replies":[{"poster":"Riot Nebo","date":"2018-08-11T00:41:15.627+0000","up_votes":5,"down_votes":3,"body":"Hola Kenshiro\n\nCreo que el contenido de Poppy es mantener informada a la comunidad, como lo hace un medio de comunicación.\n\nOjo, que no quiero que desvirtúes mis palabras y digas que el contenido de Halo y Ness no es de calidad o es replicar el lore, de hecho consumo bastante el contenido de ellos y conozco su canal hace años, valoro bastante su labor. Como dato curioso, ellos son de la misma ciudad de donde vengo yo y también son colombianos, entonces falta de conocimiento sobre ellos, su labor y lo que han hecho no fue.\n\nAbrazos,","replies":[{"poster":"TalonHex","date":"2018-08-11T02:04:29.997+0000","up_votes":1,"down_votes":1,"body":"Muchas gracias por tomarse la molestia de atender nuestro reclamo creo que con que se hubiera informado  que se había postulado a ciertos creadores de contenido no hubiésemos malentendido la situación agradecemos mucho el que nos explicaras la situación \n\nUn abrazo para ti tambien\n{{sticker:sg-kiko}}","replies":[]}]}]},{"poster":"lixian25","date":"2018-08-14T20:28:48.107+0000","up_votes":1,"down_votes":0,"body":"> Esta es una de las primeras colaboraciones que hacemos con Creadores de Contenido de Latam y sabemos que hay muchas personas que hacen este tipo de contenido en todo el mundo, pero lastimosamente no podemos seleccionar a todos (me encantaría poder seleccionar a muchos).\n\npodrian hacer un post explicando como funciono el sistema y los seleccionados para realizarlo. tambien alguna mencion para los que no pudieron tener su trozo de mapa y SI SE PUEDE algun premio menor como un funko o algo asi. no se, es una idea nomas","replies":[]},{"poster":"Nikuusky","date":"2018-08-13T06:26:48.611+0000","up_votes":1,"down_votes":0,"body":"pero lastimosamente no podemos seleccionar a todos (me encantaría poder seleccionar a muchos).\n> Un abrazo,\n Una asquerosa gestión tienen en riot games si es así espero de corazón que la poca comunidad activa de este juego muera junto con el juego","replies":[]}]},{"poster":"TalonHex","date":"2018-08-10T00:33:28.921+0000","up_votes":7,"down_votes":2,"body":"#HaloYNess LOL\nVamos riot que esta pasando????\nHablas con la comunidad solo cuando te interesa?\nHoy no, queremos respuestas queremos que reconozcas el trabajo de aquellos que hacen todo por nada y siguen no importa nada.","replies":[]},{"poster":"Teisuken","date":"2018-08-10T00:37:14.871+0000","up_votes":8,"down_votes":3,"body":"Me parece muy deprimente que a personas como Halo que trabaja duro para traer contenido de su video juego sin fallarnos semana a semana no reciba reconocimiento de parte de ustedes señores de Riot, yo he dejado de jugar su vídeo juego por que no me gustan del todo las decisiones que han tomado con el balance(eso y que lastimosamente la comunidad desmotiva) pero con esto menos ganas me dan de jugar la verdad.\n\n{{sticker:zombie-brand-clap}} \nNo es solo un pedazo de mapa, si no el gesto del reconocer el trabajo de alguien.","replies":[]},{"poster":"Kobaah","date":"2018-08-10T00:14:15.467+0000","up_votes":5,"down_votes":1,"body":"Halo se merece un pedazo de mapa, como minimo, RECONOCIMIENTO. ESO ES LO QUE TE FALTA RIOT GAMES, EN VES DE LLAMAR A WILLYREX, AQUI ESTA SU VERDADERA COMUNIDAD.","replies":[]},{"poster":"LC Yare YareDaze","date":"2018-08-10T00:13:53.894+0000","up_votes":6,"down_votes":2,"body":"Venia a por lo mismo. Espero que se lea este foro.","replies":[{"poster":"Faker Mapüche","date":"2018-08-10T02:06:49.713+0000","up_votes":3,"down_votes":1,"body":"Hay que spamear mucho para que los rioters vengan, una pena pero así funciona aquí {{sticker:zombie-brand-clap}}","replies":[]}]},{"poster":"EdxxEdxx","date":"2018-08-10T01:19:10.735+0000","up_votes":10,"down_votes":6,"body":"Soy benevolente más no tonto. Riot ha estado tomando decisiones horrorosas, y he visto cosas que me han hecho irritar a niveles astro galácticos.\n\nSaben, me encanta que los juegos hoy en día tengan este auge, hay muchos desarrolladores y empresas de videojuegos, salen joyas cada tanto y la comunidad de jugadores los retribuye, aquellos que pocos recursos tienen acuden a la propia comunidad, les dicen \"Hey, miren, tengo este proyecto con esta idea, ¿Me ayudan?\" y la gente les dona el dinero para completarlo.\n\nPero todo lo bueno trae algo malo. Este auge hizo de los videojuegos un negocio a gran escala, y cada vez más veo empresas grandes tomar decisiones dignas de un magnate ignorante que no ha tocado un videojuego en su vida, más sí los billetes que le dan los mismos. Siempre vi y viví el mundo de los juegos como algo muy lejos de la vida real. Siempre que pisaba un juego era como pisar un nuevo mundo donde no eras nadie y podías ser quien quisieras. Tristemente ahora veo cada vez más videojuegos en donde al pisarlo ya eres alguien definido: Una billetera andante lista para vaciarse en nuestros 43 métodos de micro transacciones, muchas pay2win incluso, otras en forma de secuelas de glorias pasadas. Auténticas joyas que ya no dejan descansar en paz y terminan arruinándolas.\n\nEstoy hablando de todo en general, no de Riot.\n\nPero hablando de Riot, hace ya un tiempito están tomando malas decisiones, frías e **indignas de un jugador** a mis ojos. Gente, qué puedo decir, estoy demasiado en desacuerdo con cómo está llevando a cabo Riot sus planes y su estrategia. Intento ver ambas partes, una se escuda en que dichas acciones atraerán nuevos jugadores y por ende saldrán beneficiados, otra se siente despreciada. Como dije, soy benevolente más no tonto, y, por sobretodo, soy un jugador más. Soy un jugador, no un empresario que busca dinero. No puedo estar de parte de aquellos que creen que saldrán beneficiados, no cuando su \"beneficio\" es a costa de la salud del juego.\n\nDejo un +1 al post. Me gustaría que esto fuese un tirón de orejas para Riot. \n\n\"_Las intenciones no hieren. Las acciones sí_\" - Un jugador cuyo nick ya no recuerdo (D:)","replies":[]},{"poster":"Matox","date":"2018-08-10T00:33:18.761+0000","up_votes":3,"down_votes":0,"body":"video no disponible\nalgun resumen?","replies":[{"poster":"Lil Hysteria","date":"2018-08-10T00:39:23.724+0000","up_votes":3,"down_votes":0,"body":"El llorando diciendo que le dedico casi 2 años de su vida a eso y ni siquiera le responde los twits que les manda preguntando el porque","replies":[{"poster":"lixian25","date":"2018-08-14T20:14:45.178+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Omega4674,realm=LAS,application-id=v7qsfXsE,discussion-id=dMBpa64I,comment-id=00060001,timestamp=2018-08-10T00:39:23.724+0000)\n>\n> El llorando diciendo que le dedico casi 2 años de su vida a eso y ni siquiera le responde los twits que les manda preguntando el porque\n\nporque te lo dice todo en el video, escuhalo bien","replies":[]}]},{"poster":"Kobaah","date":"2018-08-10T00:37:13.588+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Matox,realm=LAS,application-id=v7qsfXsE,discussion-id=dMBpa64I,comment-id=0006,timestamp=2018-08-10T00:33:18.761+0000)\n>\n> video no disponible\n> algun resumen?\n\nhalo decia que dedico gran cantidad de tiempo y esfuerzo para universo, sin siquiera tener una pizca de reconocimiento por parte de Riot, que no le hayan entregado una parte del mapa y si a un youtuber que nisiquiera habla del lore fue la gota que rebalso el vaso","replies":[]}]},{"poster":"alta abo","date":"2018-08-10T00:33:46.272+0000","up_votes":3,"down_votes":0,"body":"no entiendo nada, el video no esta disponible \n\n{{sticker:sg-lux-2}}","replies":[{"poster":"Lil Hysteria","date":"2018-08-10T00:38:08.001+0000","up_votes":3,"down_votes":1,"body":"Lo puso en invisible mas tade dijo que hiba a subir unos mejor echo explicando todo\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Jomba","date":"2018-08-10T00:37:13.579+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=alta abo,realm=LAS,application-id=v7qsfXsE,discussion-id=dMBpa64I,comment-id=0008,timestamp=2018-08-10T00:33:46.272+0000)\n>\n> no entiendo nada, el video no esta disponible \n> \n> {{sticker:sg-lux-2}}\n\nLa cosa es que Halo tomo la decisión de dejar los vídeos de universo Lol ya que le parece una injusticia que se haya tomado tanto tiempo en hablar e informar sobre el lore del lol y su contenido y no sea reconocido por riot, mas específicamente un tema de que riot al parecer se puso a regalar trozos de mapa de runaterra y ni tomaron en cuenta a Halo, eso fue lo que entendí.","replies":[]}]},{"poster":"Lil Hysteria","date":"2018-08-10T00:37:10.167+0000","up_votes":5,"down_votes":2,"body":"WTF RIOT PORQUE NO LE DIERON UN PEDAZO DE MAPA A HALO QUE SUBIO DURANTE CASI 2 AÑOS UNIVERSO NI SIQUIERA UN MENSAJE NADA MADRE MIA{{sticker:zombie-brand-facepalm}} y lo peor de todo es com,o siempre lo que estamos diciendo ahora se lo van a pasar por el ***** y listo","replies":[{"poster":"WhiteMax","date":"2018-08-10T12:33:41.536+0000","up_votes":2,"down_votes":0,"body":"O el mensajito de: lo sentimos, lo haremos ahora y \"excusa elaborada\".","replies":[]}]},{"poster":"Jomba","date":"2018-08-10T00:28:06.971+0000","up_votes":5,"down_votes":2,"body":"También estoy de acuerdo, Halo ha dedicado mucho tiempo para intentar ampliar la comunidad a travez de mostrar lo increible que puede ser el lore  y me parece injusto que después de tanta promoción al juego con su contenido artístico y narrativo y  teniendo tanta gente que lo ve no sea reconocido ni un poco por riot, y que en vez de eso le den menciones e iconos a youtubers los cuales algunos no tienen nada que ver con el juego o no lo han jugado nunca es vergonzoso, Halo era y sigue siendo un gran aporte a la comunidad.","replies":[]},{"poster":"TH3SH4WD0W FT","date":"2018-08-10T00:16:27.303+0000","up_votes":5,"down_votes":2,"body":"Estoy totalmente de acuerdo, yo tambien hare una publicacion para avisarle a riot sobre esto. No puede ser que un youtuber dedicando años de su vida con cientos de miles de visualizaciones, que nos ayudaba a comprender mejor el universo de league of legends deje por ser insignificante ante los ojos de esta compañía.\nNo los culpo pero podrían fijarse en youtubers que si suben contenido de lol en vez de tratar de promocionar lol con youtubers que solo juegan una partida","replies":[]},{"poster":"Tur1nTur4mb4r ","date":"2018-08-11T02:40:22.738+0000","up_votes":2,"down_votes":0,"body":"Por lo que leo recibió el duro golpe de la realidad. Me sorprende que la gente que hace estas cosas piense que va a trascender o que van a ser reconocidos. Todos tienen sus 15' minutos de fama, como warhol lo dijo, pero no seamos tan ilusos de pensar que tenemos una importancia para una empresa. A lo mejor no cumplían los requisitos que otros si lo hicieron. Ahora cerrar una sección en forma de protesta cagandote en la gente que lo ve es una falta de respeto a sus seguidores. La vida es así y este no es ni por asomo el peor de sus reflejos, es increíble esta sociedad extra sensibilizada que no se le puede hacer \"daño\" que ya hacen un berrinche","replies":[]},{"poster":"Isaina","date":"2018-08-10T12:32:09.514+0000","up_votes":3,"down_votes":1,"body":"Entiendo que riot no se haya dado cuenta del canal de Halo por el cambio de canal, riot no es fan de halo para saber estás cosas, por eso estoy acá, para que vean todo lo que hizo Halo.\nEl lleva varios años subiendo contenido de lol, tiene toda una sección dedicada al lore, es el único youtuber de habla hispana que habla incluso de los multiversos, quien más hace eso? Por favor pido que lo tomen en cuenta y le den aunque sea una tarjeta de reconocimiento agradeciendo todo su esfuerzo \n{{sticker:sg-ahri-2}}","replies":[]},{"poster":"Broken Styles","date":"2018-08-10T02:31:54.648+0000","up_votes":3,"down_votes":1,"body":"Para empezar, quien es? Y que es eso de tener un pedazo de mapa?\n{{sticker:sg-lux-2}}","replies":[]},{"poster":"AxElL93","date":"2018-08-10T01:44:10.560+0000","up_votes":3,"down_votes":1,"body":"aca nunca lo escucharan en euw si","replies":[]},{"poster":"KH4D4 Jhin","date":"2018-08-10T00:54:09.436+0000","up_votes":3,"down_votes":1,"body":"por lo menos agradecer a halo y ness por el apoyo al universo lol seria muy feo que el haciendo publicidad a su pagina no le agradecen nada .","replies":[]},{"poster":"HiroGhost","date":"2018-08-10T00:53:45.710+0000","up_votes":3,"down_votes":1,"body":"Menos mal que riot escucha a su comunidad y la reconoce.... ultimamente se manda cagadas a nivel estratrosfericos dedico un año entero subiendo videos sobre el lore del este juego y ellos no fueron capaces de ni siquiera reconocer su trabajo {{sticker:zombie-brand-clap}} {{sticker:zombie-brand-facepalm}} {{sticker:sg-ahri-1}} {{sticker:sg-shisa}}  QUE QUIERES QUE TE DIGA RIOT....","replies":[]},{"poster":"James Northrend","date":"2018-08-10T00:34:56.407+0000","up_votes":4,"down_votes":2,"body":"el se lo merece !!\n\n{{sticker:sg-shisa}}","replies":[]},{"poster":"Teemoshenko","date":"2018-08-10T00:34:04.625+0000","up_votes":4,"down_votes":2,"body":"​#MapaParaHalo, ya denle su jodido mapa, que se lo merece mas que nadie {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Zephie","date":"2018-08-10T03:18:52.148+0000","up_votes":5,"down_votes":3,"body":"No sé. Per se siempre me pareció super inmaduro llorarle a RIOT por reconocimiento (que vamos, algunos igual ganan dinero por un contenido que no es de \"ellos\"). \n\nVeía a Halo, pero después de su vídeo me decepcionó.\n\nSe entiende por qué no le dieron el pedacito de mapa; no tenía tantos suscriptores ni visitas como otros y varios de sus vídeos iban del plan subjetivo y en uno que otro criticaba a Riot de gratis. \n\n\nDespués, cuando en su directo llorando porque no le dieron un poster no se decidía entre si lo que hacía era por amor, o que el lore en realidad era una mierda y él lo promocionaba y prácticamente Riot debía agradecerle porque el lore era taaaaan malo (pero después decía que era bueno y que le gustaba (?) me quedó claro que era una persona bastante inmadura.","replies":[{"poster":"TheQuietFox","date":"2018-08-10T21:58:23.269+0000","up_votes":1,"down_votes":0,"body":"En parte estoy con lo que decis deberiq darle igual que le den o no el reconocimiento y que lo hace por amor a lore y a sus fans que lo apoyan pero bueno el ya tomo su desicion la cual no me parece la correcta.","replies":[]}]},{"poster":"MrQuimio","date":"2018-08-10T00:27:28.958+0000","up_votes":5,"down_votes":3,"body":"la verdad desiluciona mucho el camino de mierda que esta tomando Riot siendo que el juego pierde popularidad y reconocimiento , que se porten tan como el orto  con alguien que en sus vídeos nos muestra la grandeza oculta del lol como es toda la historia de UNIVERSO de una forma entendible para nosotros .","replies":[]},{"poster":"Visoka","date":"2018-08-10T11:20:23.708+0000","up_votes":3,"down_votes":2,"body":"Riot siendo riot","replies":[]},{"poster":"Teemoshenko","date":"2018-08-10T02:51:44.597+0000","up_votes":3,"down_votes":2,"body":"Hicieron llorar a Halo, y Ness tambien lloro, todos lo vimos, fue horrible {{sticker:sg-janna}}","replies":[]},{"poster":"Este NoEs Suareh","date":"2018-08-10T02:09:15.977+0000","up_votes":3,"down_votes":2,"body":"+1 a esto, un asco lo de Riot","replies":[]},{"poster":"ToxicRunner","date":"2018-08-10T01:47:33.303+0000","up_votes":3,"down_votes":2,"body":"Es demasiado tarde como para darle un mapa. Y es triste es uno de los pocos creadores de contenido decente que se dedica a analizar y teorizar sobre el Lore de lol.\nPero ya saben, la gente está más interesada en jugadores que gritan y flamean para dar \"gracia\".\n{{champion:32}}\n\n\nEdit. La gente y riot.","replies":[]},{"poster":"Nightsoul","date":"2018-08-13T05:09:06.963+0000","up_votes":1,"down_votes":0,"body":"Quiero imaginar que  si no  lo incluyeron en este seguramente estara en otro aunque ya de por si me sorprende o mejor dicho me decepcione que seguramente el mejor contenido de historia del universo de su bendito juego no alla tenido un minimo reconocimiento justamente cuando dan algo que tiene que ver con el universo, es cierto que no pueden estar todos pero los que han nombrado la verdad no los conozco . como la mayoria aqui , seguramente son muy buenos pero vamos todos aqui sabemos que excluir a halo fue un error","replies":[]},{"poster":"Roxguel","date":"2018-08-10T19:24:18.772+0000","up_votes":1,"down_votes":0,"body":"El video ya no esta disponible.\n¿Alguien, 20 horas después, tiene idea qué está pasando?","replies":[]}]}