{"poster":"Khalïfa ","date":"2017-09-02T01:18:15.322+0000","title":"Ab wann gilt man als reformiert?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":1,"body":"Hallo ich hatte einen 14 Tage Bann bis zum 30.8 und habe gestern eine Nachricht erhalten in der steht das ich wieder Truhen &amp; Schl&uuml;ssel erhalten kann.\r\nHeisst das das ich nun reformiert bin und meine Season-Rewards erhalten werde?","replies":[{"poster":"MrSnowy","date":"2017-09-02T06:02:15.188+0000","up_votes":1,"down_votes":1,"body":"Da würde ich lieber drauf warten was Riot dazu schreibt wenn es soweit ist. Letztes jahr war es so das man 6monate keine Sperre haben durfte. Also wenn es dieses jahr genauso ist halte ich das für sehr fraglich. Aber man weiß ja noch nicht ganz genau wann die Season-Rewards zugeteilt werden.","replies":[{"poster":"GummibaumXYZ","date":"2017-09-02T10:19:21.394+0000","up_votes":1,"down_votes":0,"body":"Sie haben schon was dazu geschrieben https://support.riotgames.com/hc/de/articles/115011781068-Wer-bekommt-2017-Ranglistenbelohnungen-","replies":[{"poster":"Khalïfa ","date":"2017-09-04T14:49:55.406+0000","up_votes":1,"down_votes":0,"body":"In dem Post steht das Leute die ''ab'' dem 22.8 gebannt werden kriegen keine Belohnungen,ich wurde am 16.8 gebannt also trifft es nicht auf mich zu oder?","replies":[{"poster":"GummibaumXYZ","date":"2017-09-04T17:06:46.603+0000","up_votes":1,"down_votes":0,"body":"Den Text würde ich auch so verstehen. Es gibt aber noch die Möglichkeit, dass es darum geht wie lange du nach dem 22.08. noch gesperrt warst. Und da wären es am 30.08. mehr als 7 Tage gewesen. Ich meine mich zu erinnern, dass es letztes Jahr darum ging bis wann man gebannt war, aber kann auch sein, dass ich mich irre und wie gesagt, den Text würde ich auch so verstehen, dass es um das banndatum und nicht um das Ende des Banns geht.","replies":[{"poster":"Khalïfa ","date":"2017-09-04T20:34:00.423+0000","up_votes":1,"down_votes":0,"body":"Ja,letztes Jahr ging es darum bis wann man gebannt war \n''Spieler, die in den letzten drei Monaten vor Ende der Saison (ab dem 7. August) für sieben Tage oder länger gesperrt waren, erhalten in diesem Jahr keine Belohnungen.''\nHoffentlich bekomme ich noch vor Season-Ende mit ob ich Belohnungen bekomme oder nicht","replies":[]}]}]},{"poster":"MrSnowy","date":"2017-09-02T11:27:47.757+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GummibaumXYZ,realm=EUW,application-id=KYnfKGf0,discussion-id=7KK9Mjwk,comment-id=00000001,timestamp=2017-09-02T10:19:21.394+0000)\n>\n> Sie haben schon was dazu geschrieben https://support.riotgames.com/hc/de/articles/115011781068-Wer-bekommt-2017-Ranglistenbelohnungen-\n\nAhh super, danke dir. Das habe ich dann überlesen! :) -Man kann ja nicht überall seine Augen aufhalten- x)","replies":[]}]},{"poster":"Mischaa","date":"2017-09-02T09:16:13.205+0000","up_votes":1,"down_votes":0,"body":"3monate","replies":[]}]},{"poster":"Schlachtenhorn","date":"2017-09-02T07:26:11.991+0000","up_votes":2,"down_votes":2,"body":"Auch wenn das Spät kommt aber, der nächste Bann wird ein Permabann sein wenn das die Frage war.\nSeasonrewards wirst du meines Wissens nicht erhalten da diese voraussetzen das man nicht gebannt war.\nIch könnte mich Irren aber du solltest ab sofort wesentlich zurückhaltender mit den Account umgehen.","replies":[{"poster":"clair de lune289","date":"2017-09-02T11:52:58.023+0000","up_votes":1,"down_votes":0,"body":"ich finde es immer sehr unterhaltsam wenn sich die frisch aus dem Bann kommenden Spieler sich sorgen um ihre Belohnungen machen,wen sie sich doch erstmal sorgen um den ACC machen sollten.","replies":[{"poster":"Schlachtenhorn","date":"2017-09-02T13:23:30.649+0000","up_votes":1,"down_votes":0,"body":"Ich finde das auch recht seltsam wenn Leute das offensichtlichste Ausblenden und dann nachher einen mimimi Thread mit \"Rito give me Account back Please\" öffnen weil sie den letzten Warnschuss ignorieren.","replies":[]}]}]},{"poster":"MrSnowy","date":"2017-09-02T10:00:40.200+0000","up_votes":1,"down_votes":0,"body":"Okay wenn es 3 Monate sind dann ist hier die A-Karte vorhanden. Ich mein Mitleid haben kann man  nun nicht (Sry dafür) Aber man bekommt sowas leider nicht umsonst.","replies":[]}]}