{"poster":"Lerondil","date":"2016-05-04T09:39:16.457+0000","title":"Torri di burro, perché non introdurre un campione/oggetto carpentiere?","subforum":"Discussioni generali","up_votes":16,"down_votes":2,"body":"La patch 6.9 introduce elementi profondamente_ game changing_, ho letto le note solo una volta (probabilmente male) ed ho gi&agrave; tante domande, curiosit&agrave;, dubbi  su come il gioco evolver&agrave; nei prossimi mesi. In questa discussione vorrei parlare delle torri, gi&agrave; notoriamente fatte di burro, che con la 6.9 hanno ricevuto una ulteriore riduzione della loro salute di base. Voi direte: si ma ora hanno armatura e resistenza magica! Peccato per&ograve; siano anche soggette ad entrambe le penetrazioni. Inoltre, leggendo leggendo, viene fuori che Ziggs le potr&agrave; istantaneamente demolire con la W (sotto una certa percentuale di salute) e che il Drago Elementale della Terra ne faciliter&agrave; la caduta. \r\n\r\nPovere torri! \r\n\r\nEsistono gi&agrave; diversi campioni che hanno abilit&agrave; orientate all&#039;abbattimento-torri e che fanno dell&#039;hard pushing un marchio di fabbrica (Heimerdinger, Tristana, Azir, per citarne tre...), di contro i campioni che hanno abilit&agrave; specifiche di difesa-torri sono pochissimi e poco efficaci (lo scudo-torre di Janna &egrave; debolissimo, la ulti di Bard &egrave; uno spreco se usata cos&igrave;, non me ne vengono in mente altri...), quindi vi chiedo... non pensate sarebbe carino inserire un nuovo campione (magari un support ad elevatissima mobilit&agrave;) che abbia la capacit&agrave; di riparare o potenziare le torri? Potrebbe avere una forte propensione al _roaming _(come Bard) e skill che, ad esempio, curano le torri oppure conferiscono (temporaneamente) alle torri effetti speciali (proiettili incendiari o che esplodono causando danno aoe, proiettili che stunnano, proiettili che respingono, ecc...). Secondo me sarebbe un elemento innovativo di arricchimento del gameplay e porterebbe nuovi elementi strategici nella Landa. Il campione carpentiere, costruttore, architetto, insomma secondo me c&#039;&egrave; anche ampio margine di inserimento di un champion simile a Piltover o Bandle City, che ne dite?  \r\n\r\nUna alternativa potrebbe essere quella di inserire degli oggetti Hextech, dedicati ai support, che conferiscano abilit&agrave; attive di riparazione, difesa o buff delle torri. Ma mi sembra un&#039;opzione gi&agrave; meno divertente.","replies":[{"poster":"BeardSergio","date":"2016-05-04T10:20:14.372+0000","up_votes":3,"down_votes":3,"body":"Sono concorde con Fratta.\nPreferisco sucare a bestia per 20 minuti che giocare una partita da 60 minuti o più.\nSi tratta comunque di una questione di gusti e tempo, non avendone molto libero preferirei che le partite durassero meno in modo da poterne fare di più","replies":[{"poster":"Ste the ripper","date":"2016-05-04T10:30:57.172+0000","up_votes":10,"down_votes":2,"body":"Io invece trovo frustrante l'attuale sistema, non so come cambierà, ma al momento attuale non era divertente, arrivavi a 30 minuti in cui un singolo errore in tf ti poteva far perdere 4 torri, inib e nexus.\nNon era divertente stare in equilibrio 30 minuti e poi perdere così di botto, sono contento infatti della diminuzione dei timer di respawn, una sconfitta dovrebbe arrivare passo dopo passo, svantaggio dopo svantaggio ( a meno che non sia un fight a 55 minuti, in quel caso lo accetto), non che a 30 minuti fai un errore più importante e ti puniscono talmente hard che sembra vengano a casa tua a picchiarti di persona.","replies":[]},{"poster":"XxShido91xX","date":"2016-05-04T12:33:35.503+0000","up_votes":2,"down_votes":0,"body":"Ok meno, ma neanche vedersi cadere la prima torre al 4 minuto....è una cosa abbastanza oscena sinceramente :/","replies":[]},{"poster":"Lerondil","date":"2016-05-04T10:43:25.378+0000","up_votes":2,"down_votes":0,"body":"Però introdurre degli elementi di potenziamento attivo di singole torri potrebbe riequilibrare partite in cui ad esempio una lane viene interamente persa troppo presto, si potrebbe ad esempio rendere più difficile da abbattere l'ultima torre (grazie all'intervento del carpentiere o di un oggetto apposito). Non è detto che si passi da 20 a 60 minuti, ci sono 40 minuti di infinite possibilità nel mezzo. :)\n\nPoi, per dire, una partita vinta in 20 minuti (da subito sbilanciata) mi da molta meno soddisfazione di una partita persa in 60 (che si presuppone sia stata equilibrata e avvincente).","replies":[]}]},{"poster":"BeardSergio","date":"2016-05-04T11:09:50.223+0000","up_votes":1,"down_votes":5,"body":"Questione di gusti. Preferisco partite più brevi che lunghe 60 minuti.\nIl fatto che se perdi 1 tf ti sfondano metà base ci sta perfettamente, basta guardare altri sport tipo il calcio: sbagli un passaggio nella tua area e ti piazzano il goal. Non importa che tu abbia giocato bene 10 minuti fa. \nQuesta direzione non mi dispiace e mi permette di fare più partite,provare più cose e perdere più velocemente.\nMi rimane solo il dubbio su come possano reagire a questi tempi accorciati i campioni da late","replies":[{"poster":"Darkinknight","date":"2016-05-04T12:45:59.721+0000","up_votes":5,"down_votes":0,"body":"Non so che calcio guardi tu ma appunto prendi un goal,non 15..se sono 8-0 e gli avversari fanno una bella azione al 85',diventa 8-1 non 8-9 e fine partita","replies":[]},{"poster":"Liorenato","date":"2016-05-04T12:48:18.173+0000","up_votes":3,"down_votes":0,"body":"Ma nel calcio, subire un gol perchè la tua difesa ha sbagliato, non è come perdere 2 torri ed un inibitore per colpa di un teamfight.\nUna volta che le squadre tornano entrambe in gioco, la squadra senza torri ed inibitore è gravemente svantaggiata e più incline a perderne altre.","replies":[{"poster":"BeardSergio","date":"2016-05-04T13:12:30.704+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Lioboss,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=00060003,timestamp=2016-05-04T12:48:18.173+0000)\n>\n> Ma nel calcio, subire un gol perchè la tua difesa ha sbagliato, non è come perdere 2 torri ed un inibitore per colpa di un teamfight.\n> Una volta che le squadre tornano entrambe in gioco, la squadra senza torri ed inibitore è gravemente svantaggiata e più incline a perderne altre.\n\nBeh chi va in vantaggio deve avere un vantaggio altrimenti rimane un gioco infinito se tutti hanno sempre le stesse possibilità di vittoria per tutta la partita indipendentemente dall'andamento.\nNel caso ci fosse un appianamento delle possibilità allora sarebbe solo un vantaggio per chi sta perdendo e non per chi è in vantaggio.","replies":[{"poster":"Liorenato","date":"2016-05-04T13:16:49.716+0000","up_votes":3,"down_votes":0,"body":"Ma nel calcio questa meccanica non esiste, quindi è inutile paragonarli tra loro.\nComunque è ovvio che uno svantaggio nel perdere un teamfight ci deve essere, si sta solo opinando sul fatto che questi svantaggi siano troppo pesanti troppo presto in partita.","replies":[{"poster":"BeardSergio","date":"2016-05-04T13:20:59.455+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Lioboss,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=0006000300000000,timestamp=2016-05-04T13:16:49.716+0000)\n>\n> Ma nel calcio questa meccanica non esiste, quindi è inutile paragonarli tra loro.\n> Comunque è ovvio che uno svantaggio nel perdere un teamfight ci deve essere, si sta solo opinando sul fatto che questi svantaggi siano troppo pesanti troppo presto in partita.\n\nInfatti io sto dicendo che,secondo mio gusto personale, preferisco svantaggi un po' più decisi.\nSe vinco 2 teamfight mi aspetto di essere molto vicino alla chiusura della partita, salvo mega abilità dell'altra squadra, non che possono recuperare senza sudare 7 camice.","replies":[{"poster":"LionHeartV","date":"2016-05-05T06:02:19.970+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=BeardSergio,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=00060003000000000000,timestamp=2016-05-04T13:20:59.455+0000)\n>\n> Infatti io sto dicendo che,secondo mio gusto personale, preferisco svantaggi un po&#x27; più decisi.\n> Se vinco 2 teamfight mi aspetto di essere molto vicino alla chiusura della partita, salvo mega abilità dell&#x27;altra squadra, non che possono recuperare senza sudare 7 camice.\n\nche brutta mentalità, e poi ci chiediamo perché il meta attuale faccia schifo :/","replies":[]},{"poster":"Liorenato","date":"2016-05-05T06:16:33.408+0000","up_votes":2,"down_votes":0,"body":"Se l'obbiettivo della Riot è far durare meno le partite, non è con il timer del respawn altissimo che il problema si risolve, sta nella loro abilità di game-designer trovare un modo che sortisca lo stesso effetto, ma che non sia frustrante per entrambe le squadre.","replies":[]},{"poster":"kernel panic","date":"2016-05-05T05:05:26.629+0000","up_votes":2,"down_votes":0,"body":"Si ma una cosa è vincere un teamfight al 40, un'altra è vincere un teamfight al 25 e vederti tirare giù due torri e 1 inibitor, e nel frattempo prendono pure un baron.\n\nNon so se te giochi toplane, ma è diventata ridicola. Se muori da una gank dopo i 5-6 minuti, ti prendono la torre.","replies":[{"poster":"LionHeartV","date":"2016-05-05T06:03:32.457+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tempus Frangit,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=000600030000000000000000,timestamp=2016-05-05T05:05:26.629+0000)\n>\n> Si ma una cosa è vincere un teamfight al 40, un&#x27;altra è vincere un teamfight al 25 e vederti tirare giù due torri e 1 inibitor, e nel frattempo prendono pure un baron.\n> \n> Non so se te giochi toplane, ma è diventata ridicola. Se muori da una gank dopo i 5-6 minuti, ti prendono la torre.\n\nper questo sono tutti main lee sin {{champion:64}} o shaco {{champion:35}} ","replies":[]}]}]}]},{"poster":"Floppyz","date":"2016-05-04T13:20:19.249+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BeardSergio,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=000600030000,timestamp=2016-05-04T13:12:30.704+0000)\n>\n> Beh chi va in vantaggio deve avere un vantaggio altrimenti rimane un gioco infinito se tutti hanno sempre le stesse possibilità di vittoria per tutta la partita indipendentemente dall&#x27;andamento.\n> Nel caso ci fosse un appianamento delle possibilità allora sarebbe solo un vantaggio per chi sta perdendo e non per chi è in vantaggio.\n\nTipo a calcio balilla... L'ULTIMA VALE TUTTO!","replies":[{"poster":"Skydago","date":"2016-05-04T13:46:35.679+0000","up_votes":1,"down_votes":0,"body":"Hahahaha\nQuanti ricordi mi fai sempre sentire vecchio :')","replies":[{"poster":"Floppyz","date":"2016-05-04T13:48:08.667+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skydago,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=00060003000000010000,timestamp=2016-05-04T13:46:35.679+0000)\n>\n> Hahahaha\n> Quanti ricordi mi fai sempre sentire vecchio :&#x27;)\n\nBasta che non rulli, perché sennò ti faccio sentire quant'è calda la traversa della porta... Prova... senti...","replies":[{"poster":"Skydago","date":"2016-05-04T13:56:47.523+0000","up_votes":2,"down_votes":0,"body":"_Si stava meglio quando si stava peggio._","replies":[]},{"poster":"Skydago","date":"2016-05-04T13:58:30.474+0000","up_votes":1,"down_votes":0,"body":"P.s. io sono quello che infrangeva le regole e rullava fisso haha\n\nE che metteva le magliette davanti alla porta per pagare più partite al prezzo di una.","replies":[{"poster":"Floppyz","date":"2016-05-04T14:36:19.759+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skydago,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=0006000300000001000000000001,timestamp=2016-05-04T13:58:30.474+0000)\n>\n> P.s. io sono quello che infrangeva le regole e rullava fisso haha\n> \n> E che metteva le magliette davanti alla porta per pagare più partite al prezzo di una.\n\nNoi ci mettevamo i sacchetti delle patatine dentro la porta, oppure c'era una persona per lato che alzava il tavolo appena la palla entrava in porta...\n\nIn qualche caso funzionava pure la moneta o la stecca del ghiacciolo per tenere la leva tirata :P\n\n...Scusate l'OT da momento amarcord...","replies":[{"poster":"Skydago","date":"2016-05-04T14:58:08.436+0000","up_votes":1,"down_votes":0,"body":"Penso che capiranno, chi non ha mai fatto queste cose al biliardino con gli amici?","replies":[]}]}]}]}]}]},{"poster":"Darkinknight","date":"2016-05-04T13:38:49.223+0000","up_votes":2,"down_votes":0,"body":"Io sono d'accordo che se chi sta in svantaggio riesce a vincere un tf,prendersi un baron ecc possa anzi debba venire premiato..dato che stava pure in svantaggio.. Ma premiato è diverso da \"in un minuto faccio tutto quello che hai fatto tu in 35 minuti e forse pure chiudo,solo perche ho  ~~avuto culo~~ fatto una bella azione contro le tue 15","replies":[]}]}]},{"poster":"Ste the ripper","date":"2016-05-04T13:34:08.957+0000","up_votes":3,"down_votes":0,"body":"Partiamo da alcuni presupposti:\n1. A elo silver lo snowball non è capitalizzato come può esserlo in plat, quindi parliamo di un fenomeno molto più radicale\n2. Il calcio è profondamente diverso da lol, lol per arrivare alla vittoria si basa PREVALENTEMENTE su eventi cumulativi, il calcio su eventi PREVALENTEMENTE sporadici ( tant'è che seppur raramente può vincere anche la squadra che fa 1 solo tiro in porta dopo 90 minuti passati a far catenaccio con il 10% possesso palla)\n3. Ok, prendersi un gol, ma come ti ha detto hellknight lo stesso identico gol vale punti diversi a seconda del minuto in cui lo fai? Se fai gol al 90 vale  come 3 gol al minuto 10? \n4. Non hai capito l'andamento \"di questa direzione\", i cambiamenti fatti in questa patch vanno esattamente nel senso opposto, tendono a rendere lo snowball meno selvaggio, tendono ad allungare leggermente le partite per evitare che un solo tf sia troppo importante in mid game.","replies":[]},{"poster":"Hell88","date":"2016-05-04T11:52:05.015+0000","up_votes":1,"down_votes":0,"body":"dillo a vayne...o potenzi i campioni da late game o il roster di champ utili si assottiglia parecchio.se metti le torri di burro devi abbassare molto il timer morte...non è possibile che un tf andato male a 30 minuti equivalga a sconfitta certa.","replies":[]},{"poster":"Subundu","date":"2016-05-04T19:16:10.436+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BeardSergio,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=0006,timestamp=2016-05-04T11:09:50.223+0000)\n>\n\n> Mi rimane solo il dubbio su come possano reagire a questi tempi accorciati i campioni da late\n\nQuesto è uno dei motivi per cui l'accorciamento dei tempi non mi piace molto. Uno dei pilastri di league era la possibilità di impostare una strategia in base all'early o al late e quindi pickare di conseguenza. \n\nPer come la vedo io se piano piano si riduce sempre più la durata dei match, i pg che devono scalare diverranno progressivamente inutili. La riot dovrà quindi intervenire per bilanciarli e renderli più forti già dall'inizio.\n\nQuesto secondo me diminuisce la diversità del gioco, lo rende meno strategico e un pò più vicino ad un picchiaduro 5v5.","replies":[]}]},{"poster":"Darkinknight","date":"2016-05-04T10:56:33.797+0000","up_votes":3,"down_votes":0,"body":"L'idea del champ non è affatto male,ma per lo scopo vedrei meglio su un oggetto..o proprio dei buff fatto bene alle torri per tagliare la testa al toro..fino ad ora death=ciao torre,ciao torre al 10=ciao farm,= il tuo avversario a 10 minuti rompera a tutte le altre lane senza problemi..oppure arrivi nel late,stravinci 35 minuti ma gli altri non si sbilanciano e difendono bene,perdi un tf e ti vanno giu tutte le torri + inibitor+ nexus senza bisogno nemmeno dei minion (e spesso manco dei tank)..senza contare i dive pre 6 dove il proiettile della torre piu che un danno è un effetto speciale","replies":[]},{"poster":"Ucr0niA","date":"2016-05-04T19:38:22.048+0000","up_votes":4,"down_votes":2,"body":"http://vignette3.wikia.nocookie.net/teamfortress/images/d/d8/Engineer.png/revision/latest?cb=20150127180519\n\n(Che poi seriamente parlando, tempo fai mi feci il CuBo quadro per ideare un campione in pieno stile pagina da Wiki, che si basava tra le altre cose sul agevolare la lane phase dei suoi alleati tramite una forma di cura, il tutto non venne preso molto in considerazione, col senno di poi non so se lo rifarei:\nhttp://boards.euw.leagueoflegends.com/it/c/campioni-e-gameplay-it/6L63lXwk-nuovo-campione-rob )","replies":[{"poster":"Lerondil","date":"2016-05-04T20:05:10.934+0000","up_votes":4,"down_votes":1,"body":"Cavoli!!! Hai fatto un gran lavoro, minuzioso e credibile, complimenti!! :)\nPoi, al di là del fatto che il progetto sia stato preso in considerazione o meno, ti dico, vale sicuramente la pena averlo realizzato (ti sarai divertito/a a inventarlo, no?) e poi Zyra petalosa è un tocco di classe che va tramandato! :D","replies":[{"poster":"Ucr0niA","date":"2016-05-04T20:32:57.578+0000","up_votes":3,"down_votes":1,"body":"Bah, non che vada di certo fiero del quote di Zyra, lo inserii giusto perchè era il periodo di tale fenomeno mediatico e quindi decisi di buttarcelo in mezzo.\nDetto ciò mi ha divertito fare la gif, ma il carico di lavoro che cose del genere hanno richiesto è stato assurdo, e molti dettagli credo non verranno mai notati, ad esempio pur non avendo dato delle stats per rendere verosimile i suoi valori, gli hp e il mana riportati in gif sono quelli di un Tahm a pari condizioni di jung, il nemico in questione è Tahm, poichè costui è nemico degli Yordle, razza amica di Rob (pertanto il nemico del suo nemico, è suo nemico, da lore).\n\nComunque rileggendo ora, non sono neanche certo che molti passaggi come gli intrecci tra le skill siano chiarissimi al lettore.","replies":[]}]},{"poster":"Demigod Summoner","date":"2016-05-05T07:21:02.062+0000","up_votes":3,"down_votes":4,"body":"Troppo complesso, LoL è un gioco userfriendly in tutti i suoi aspetti","replies":[{"poster":"Ucr0niA","date":"2016-05-05T14:22:11.976+0000","up_votes":3,"down_votes":3,"body":"Eh già, mica so mai stati fatti campioni \"complessi\", tipo Rumble o Draven (che poi a ben vedere il mio concept funziona come Heimerdinger)","replies":[{"poster":"Demigod Summoner","date":"2016-05-05T17:33:51.855+0000","up_votes":2,"down_votes":4,"body":"Da quando Rumble(spamspamspam) o Draven(AA Ascia AA Ascia) sono complessi?","replies":[{"poster":"Ucr0niA","date":"2016-05-05T17:35:44.824+0000","up_votes":3,"down_votes":3,"body":"Va bene, non capisci una fava, sto sprecando il tempo.","replies":[{"poster":"Demigod Summoner","date":"2016-05-05T17:37:14.656+0000","up_votes":2,"down_votes":3,"body":"Un altro espertone, interessante","replies":[{"poster":"Ucr0niA","date":"2016-05-05T17:44:17.180+0000","up_votes":3,"down_votes":3,"body":"Se per te Rumble è \"spam spam spam\" non c'è veramente nulla di cui discutere con uno che confonde Rumble con Yorick.","replies":[{"poster":"Demigod Summoner","date":"2016-05-05T17:48:12.685+0000","up_votes":3,"down_votes":3,"body":"Espertone level 9000","replies":[]}]}]}]}]}]}]}]},{"poster":"zYaichi","date":"2016-05-04T09:50:48.869+0000","up_votes":1,"down_votes":0,"body":"Ci sono troppe cose che distruggono facilmente le torri più che un oggetto o campione carpentiere servirebbe buffare le torri e farle ritornare come quelle della s5\nComunque sarebbe di sicuro innovativo qualcosa che interagisca con le torri e magari con il campo di gioco come già fa bard che non si limiti a spostarsi da una parte all'altra della mappa","replies":[{"poster":"Floppyz","date":"2016-05-04T10:01:11.296+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=zYaichi,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=0000,timestamp=2016-05-04T09:50:48.869+0000)\n>\n> Ci sono troppe cose che distruggono facilmente le torri più che un oggetto o campione carpentiere servirebbe buffare le torri e farle ritornare come quelle della s5\n> Comunque sarebbe di sicuro innovativo qualcosa che interagisca con le torri e magari con il campo di gioco come già fa bard che non si limiti a spostarsi da una parte all&#x27;altra della mappa\n\nC'è una cosa del genere su HOTS... Chissà cosa ne pensa Riot di questa possibile interazione con le strutture.","replies":[{"poster":"Frattaglia","date":"2016-05-04T10:13:28.228+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Ciack,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=00000000,timestamp=2016-05-04T10:01:11.296+0000)\n>\n> C&#x27;è una cosa del genere su HOTS... Chissà cosa ne pensa Riot di questa possibile interazione con le strutture.\n\nChe le partite tornerebbero a durare 60 minuti di media, cosa che la Riot non vuole...\n\nChe poi c'è Azir che ritira su le torri, eh.\n\nIo le renderei solo un po' più robuste (buona l'idea di buffare armatura e resistenza magica, ma non gli avrei tolto tutta quella vita), ma niente di più.","replies":[{"poster":"Floppyz","date":"2016-05-04T12:51:31.464+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=000000000000,timestamp=2016-05-04T10:13:28.228+0000)\n>\n> Che le partite tornerebbero a durare 60 minuti di media, cosa che la Riot non vuole...\n> \n\nNon necessariamente, mica serve fare una roba sbilanciata che ricostruisce le torri.\n\nMolto banalmente si potrebbe fare un oggetto che le ripara standoci vicino, o che le scuda, o le cura con un HOT _on use_... Ci sono tanti modi, e alcuni di questi non allungherebbero la partita, ma garantirebbero una maggior resistenza della torre ad attacchi molto leggeri, che ad oggi la buttano giù, anche nei primi minuti.","replies":[]},{"poster":"Lerondil","date":"2016-05-04T10:47:15.025+0000","up_votes":2,"down_votes":0,"body":"Però vuoi mettere l'elemento di novità/strategia del poter diversificare gli effetti di attacco di una singola torre adattandoli (temporaneamente) alle diverse situazioni? Più ci penso più mi sembra che il campione carpentiere sarebbe una bella _new entry_. :)","replies":[]}]}]}]},{"poster":"Sìrjohn","date":"2016-05-04T12:49:21.516+0000","up_votes":2,"down_votes":0,"body":"Mi ricordo che heimerdinger curava le torri solo standogli vicino, non so se è ancora così dopo il rework che subì tempo fa....\n\nPerò un champ con una bella chiave inglese che si mette a riparare non è male come idea \n\n+1","replies":[]},{"poster":"Wolfrighten","date":"2016-05-04T10:40:36.982+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lerondil,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=,timestamp=2016-05-04T09:39:16.457+0000)\n>\n> La patch 6.9 introduce elementi profondamente_ game changing_, ho letto le note solo una volta (probabilmente male) ed ho gi&amp;agrave; tante domande, curiosit&amp;agrave;, dubbi  su come il gioco evolver&amp;agrave; nei prossimi mesi. In questa discussione vorrei parlare delle torri, gi&amp;agrave; notoriamente fatte di burro, che con la 6.9 hanno ricevuto una ulteriore riduzione della loro salute di base. Voi direte: si ma ora hanno armatura e resistenza magica! Peccato per&amp;ograve; siano anche soggette ad entrambe le penetrazioni. Inoltre, leggendo leggendo, viene fuori che Ziggs le potr&amp;agrave; istantaneamente demolire con la W (sotto una certa percentuale di salute) e che il Drago Elementale della Terra ne faciliter&amp;agrave; la caduta. \n> \n> Povere torri! \n> \n> Esistono gi&amp;agrave; diversi campioni che hanno abilit&amp;agrave; orientate all&amp;#039;abbattimento-torri e che fanno dell&amp;#039;hard pushing un marchio di fabbrica (Heimerdinger, Tristana, Azir, per citarne tre...), di contro i campioni che hanno abilit&amp;agrave; specifiche di difesa-torri sono pochissimi e poco efficaci (lo scudo-torre di Janna &amp;egrave; debolissimo, la ulti di Bard &amp;egrave; uno spreco se usata cos&amp;igrave;, non me ne vengono in mente altri...), quindi vi chiedo... non pensate sarebbe carino inserire un nuovo campione (magari un support ad elevatissima mobilit&amp;agrave;) che abbia la capacit&amp;agrave; di riparare o potenziare le torri? Potrebbe avere una forte propensione al _roaming _(come Bard) e skill che, ad esempio, curano le torri oppure conferiscono (temporaneamente) alle torri effetti speciali (proiettili incendiari o che esplodono causando danno aoe, proiettili che stunnano, proiettili che respingono, ecc...). Secondo me sarebbe un elemento innovativo di arricchimento del gameplay e porterebbe nuovi elementi strategici nella Landa. Il campione carpentiere, costruttore, architetto, insomma secondo me c&amp;#039;&amp;egrave; anche ampio margine di inserimento di un champion simile a Piltover o Bandle City, che ne dite?  \n> \n> Una alternativa potrebbe essere quella di inserire degli oggetti Hextech, dedicati ai support, che conferiscano abilit&amp;agrave; attive di riparazione, difesa o buff delle torri. Ma mi sembra un&amp;#039;opzione gi&amp;agrave; meno divertente.\n\nAppoggio la tua idea non per il fattore che le torri sono diventate quasi inutili, più che altro per l'innovazione e l'originalità che potrebbero essere introdotte :)","replies":[]},{"poster":"Keìron","date":"2016-05-04T10:39:10.324+0000","up_votes":2,"down_votes":0,"body":"ma nessuno ha letto che ora le torri hanno 66% di riduzione danno?","replies":[{"poster":"Bloody Axe","date":"2016-05-04T12:49:14.844+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Keìron,realm=EUW,application-id=MJVj50Jw,discussion-id=xXgfb3K1,comment-id=0003,timestamp=2016-05-04T10:39:10.324+0000)\n>\n> ma nessuno ha letto che ora le torri hanno 66% di riduzione danno?\n\nSenza minion nelle vicinanze.","replies":[{"poster":"Lerondil","date":"2016-05-04T13:20:36.120+0000","up_votes":1,"down_votes":0,"body":"Quindi _posteriore _ significa  _senza minion nelle vicinanze_?","replies":[]}]},{"poster":"Lerondil","date":"2016-05-04T12:01:12.013+0000","up_votes":1,"down_votes":0,"body":"Ho riletto le note e ho notato che la riduzione danno a cui ti riferisci è relativa al  _bonus posteriore delle torri_. Che significato ha quel _posteriore_?","replies":[]}]},{"poster":"Ste the ripper","date":"2016-05-04T10:25:26.995+0000","up_votes":2,"down_votes":0,"body":"Le torri ora sono meno importanti, danno meno gold e ci sono obiettivi neutrali più forti, inoltre nel complesso le torri sono più difficili da abbattere in early ( tanto in late andavano giù comunque in fretta) e fanno più danni.\nOra a livello lcs non si vedranno più quei continui scambi di corsia e a livello basso ( cioè dal gold medio in su) non si vedranno più i dive ignoranti a livello 4, inoltre una singola morte early su gank non comporterà la perdita della torre.\nNon ho voglia di farti i conti, ma se li provi a fare vedrai che è così :)","replies":[]},{"poster":"35cm","date":"2016-05-05T00:11:06.291+0000","up_votes":2,"down_votes":1,"body":"In merito alle torri ci sono dei champion che possono per così dire bloccarne i danni.. ci manca il carpentiere e poi Mosconi incoming {{sticker:zombie-brand-clap}} ","replies":[]}]}