{"poster":"Fl1pptheSc1pp","date":"2019-06-24T09:31:57.978+0000","title":"Yorick guide","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo,\r\nMöchte gern Yorick besser spielen weil mir der champ schon Spaß macht aber irgendwie bekomme ich im early relativ viel aufs maul\r\n\r\nHab jetzt immer resolve + inspiration gespielt\r\nLiegt da der Fehler \r\n\r\nUnd wie sollte ich mich verhalten in der lane \r\n\r\nZu seinem E ist es besser es weiter weg von einen zu Carsten so als poke spell oder nur im fight\r\n\r\nÜber Hilfe würde ich mich freuen \r\n\r\nIGN Fl1pptheSc1pp","replies":[{"poster":"DontKillMySoraka","date":"2019-06-24T11:49:46.681+0000","up_votes":2,"down_votes":0,"body":"Für Itembuilds und Runen kannst du auf champion.gg oder probuilds.net schauen :)","replies":[]},{"poster":"Amycos Cyrus","date":"2019-06-24T12:58:59.947+0000","up_votes":1,"down_votes":0,"body":"> Hab jetzt immer resolve + inspiration gespielt\nLiegt da der Fehler\n\nDiese Runen sind halt nicht sonderlich Early-Dominant. Dafür geben sie ihm im späteren Spiel mehr Möglichkeiten. Für Dominanz im frühen Spiel lohnt sich Conquerer.\n\n> Und wie sollte ich mich verhalten in der lane\n\nKlassischerweise ist man recht zurückhaltend auf der Lane, bevor man Level 6 hat. Ab dann hat man in den meisten Matchups einen enormen Vorteil, sodass man auch vergleichsweise viel in Vision investieren muss, um den Push sicher durchzubekommen.\n\nAbseits der ersten 5 Level kannst du \"eigentlich\" machen was du willst, du solltest nur versuchen die Ult am Leben zu erhalten.\n\n> Zu seinem E ist es besser es weiter weg von einen zu Carsten so als poke spell oder nur im fight\n\nNur im Fight! Yorick halt absolut keine Mana-Probleme, jedoch kann man sie sich sehr einfach bescheren, wenn man die E zum poken nutzt. Ab und zu kann man sie nutzen, allerdings sollte man auch aktive Ghule besitzen, sodass sich die hohen Kosten lohnen.","replies":[{"poster":"Necromant","date":"2019-06-25T06:16:21.357+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Amycos Cyrus,realm=EUW,application-id=Wj1wcocU,discussion-id=yhOcfzLs,comment-id=0002,timestamp=2019-06-24T12:58:59.947+0000)\n>\n> Diese Runen sind halt nicht sonderlich Early-Dominant. Dafür geben sie ihm im späteren Spiel mehr Möglichkeiten. Für Dominanz im frühen Spiel lohnt sich Conquerer.\n\nnot rly :D","replies":[{"poster":"Amycos Cyrus","date":"2019-06-25T12:11:54.553+0000","up_votes":1,"down_votes":0,"body":"Warum?\nResolve skaliert sehr stark mit Items, da du recht viele prozentuale Buffs bekommst. (Sowas wie Boneplatting lohnt sich auf Yorick nicht wirklich) und Inspiration ermöglicht dir lediglich, dass du entweder die Lane etwas angenehmer spielen kannst (und kompensiert damit Resolve) oder der Tree spart die Gold.\n\nConquerer gibt dir Sustain, der durch den hohen Base-Damage von Yorick recht gut im Early agieren kann, sowie durch Yorick recht leicht ausgelöst werden kann. Die verbleibenden Runen von Precision erlauben dir entweder Resolve zu imitieren (Tenacity und Overheal) oder sie stärken dich in der Offensive (Lifesteal und Coup de Grace) Ich persönlich bin auch ein recht großer Freund von Last Stand, da Yorick recht recht gut verhindern kann, dass ein Gegner nach einem Trade disengagen kann. Dadurch bekommst du einiges an Schaden geschenkt, allerdings skaliert Yorick mit Precision nicht wirklich gut (Abseits von Tenacity und Triumph) sodass du den Tree wegschmeißen kannst, wenn die 30 Minute anrückt.","replies":[{"poster":"Necromant","date":"2019-06-25T12:16:00.112+0000","up_votes":1,"down_votes":0,"body":"Das unterscheidet sich dann wohl von Yorick z.B. gegenüber Bruisern.\nDa nimmst Conq fürs Scalling mit und Grasp für die Lane.","replies":[{"poster":"Amycos Cyrus","date":"2019-06-25T12:43:34.124+0000","up_votes":1,"down_votes":0,"body":"Ich für meinen Teil finde auf nahe zu allen Bruisern (vor allem aber den Juggernauts wie Darius und Yorick) Conquerer deutlich Laneorientierter. Denn abseits von ein paar Ausnahmen (wie Illaoi, die jedoch Klepto bevorzugt) ist es für diese Champions lohnenswerter ein Item wie Deathdance für den Sustain zu nutzen, weil ihr Schaden im wesentlichen nicht AoE ist (und somit nicht die verringerte Heilung aus derartigen Ressourcen erhält.\nConquerer bringt für das Skaling in meinen Augen nahe zu nur etwas, wenn ihre 8% Heilung (die eben nicht bezüglich auf AoE verringert wird.) die bessere Alternative ist. Grasp heilt dich nämlich auch (zwar für einen definierten Wert und nicht abhängig von deiner erbrachten Leistung) und die permanente Steigerung des Lebens ermöglicht dir ein offensiveren Itemweg.\nAls letztes ist noch anzumerken, dass vor allem Trinity-Träger nicht wirklich viel aus Conquerer machen, da die 5 Stacks der Rune in den meisten Trades bereits viele Shen-Progs mit sich gebracht haben und somit in der Phase der Heilung und des True-Damage das meiste Pulver verschossen ist.\n\nAuf der anderen Seite haben wir bei den Skirmishern genau das Gegenteil. (e.g. Irelia und Fiora) bei ihnen kompensiert der gesamte Resolve-Tree (mit Boneplatting etc.) die Problematik, dass vor erreichen einer gewissen Itemsituation der Champion über ernste Defizite verfügt. Und da diese Champions deutlich aggressiver bauen und über eine Möglichkeit verfügen sowohl hohe Mobilität und geringe Abklingzeiten miteinander zu verbinden ist Conquerer hier als eine Art Letzter Atemzug + Heilung zu verstehen. Die Rune ist zwar weiterhin nicht sonderlich nützlich gegen Champions, die keine Resistenzen bauen, jedoch macht sie es ebenso schwieriger gegen sie vorzugehen, da weder Flucht (dank Mobillität), Cooldown-Tracking (dank geringer Abklingzeiten) noch Resistenzen (dank Conquerer) funktionieren. Auf der anderen Seite blüht Conquerer bei ihnen so seht auf, da Skirmisher (e.g. Yasuo) vergleichsweise viel Schaden über Fähigkeiten machen, die mit Grasp überhaupt nicht interagieren (Weil Grasp auf Normale Angriffe angewiesen ist)\n\n____\n\nIn Summe ist es meine Sicht der Dinge. Natürlich kann ich auch falsch liegen, jedoch habe ich diese Erfahrung gemacht.","replies":[]}]}]}]}]},{"poster":"Necromant","date":"2019-06-24T10:21:50.753+0000","up_votes":1,"down_votes":1,"body":"Das Leute des googlens Müde sind ...\n\nhttps://www.youtube.com/results?search_query=yorick+guide\nhttps://www.youtube.com/results?search_query=yorick+vs+","replies":[{"poster":"Fl1pptheSc1pp","date":"2019-06-24T11:04:03.801+0000","up_votes":1,"down_votes":0,"body":"Auf google hab ich auch schon geschaut aber die sind oft monate oder jahre alt und weiß nicht was sich bis jetzt an den champion bzw Runen geändert hat","replies":[{"poster":"Necromant","date":"2019-06-24T11:40:20.177+0000","up_votes":1,"down_votes":0,"body":"Ich seh da bei Youtube welche mit 2 Wochen+","replies":[]}]}]}]}