{"poster":"Contrast HERO","date":"2018-07-25T00:39:20.147+0000","title":"Idea de campeón en base al nuevo mapa de Runaterra.","subforum":"Creaciones de la comunidad","up_votes":7,"down_votes":0,"body":"Bueno gente, debido a que estuve viendo el nuevo mapa que Riot sac&oacute; sobre Runaterra, se me ocurri&oacute; una genial idea de campe&oacute;n cuando revis&eacute; a Aguas Turbias.\r\nSer&iacute;a una campe&oacute;n basado en la Harpon Mistress que presenta Aguas Turbias en la secci&oacute;n &quot;Monster Hunting&quot;, el cual ser&iacute;a de rango y que est&aacute; enfocado en el Da&ntilde;o de Ataque, m&aacute;s no est&aacute; basado en ser un campe&oacute;n con velocidad de ataque, si no de ataques lentos pero poderosos (como {{champion:202}} ) y usa man&aacute;.\r\nSin mas espera, les presento a Madge, La Cazadora de Bestias Marinas.\r\nhttps://imgur.com/a/ukQXDGP  (La imagen est&aacute; sacada de la Harpon Mistress del mapa de Runaterra, no es la imagen del campe&oacute;n que quiero presentar y tan solo es para que se hagan una idea).\r\n\r\nPasiva: Arp&oacute;n Volatil\r\nEl trabuco de Madge est&aacute;n complementado con devastadora p&oacute;lvora de Aguas Turbias. Cada ataque b&aacute;sico inflige un 20% del da&ntilde;o como da&ntilde;o m&aacute;gico en &aacute;rea al rededor del objetivo. Cada 3 ataques, Madge lanzar&aacute; un arp&oacute;n cargado con una poderosa bomba, que inflige da&ntilde;o extra al objetivo y un 80% del da&ntilde;o como da&ntilde;o m&aacute;gico en &aacute;rea al rededor del objetivo.\r\n\r\nQ: Rata del Muelle (Ground Targeting)\r\nMadge podr&aacute; lanzar a gran distancia una rata del muelle de Aguas Turbias para que luche por ella, infligiendo da&ntilde;o f&iacute;sico.\r\nInicias con una sola acumulaci&oacute;n de Rata del Muelle, que podr&aacute; ser mejorada hasta 3 acumulaciones a medida que subas la Q de nivel. Solo pueden haber 3 ratas invocadas y no se podr&aacute; invocar otra a menos que alguna muera.\r\n\r\nW: Pescado Podrido (Ground Targeting)\r\nMadge lanza un pescado podrido que inflige da&ntilde;o m&aacute;gico en un &aacute;rea peque&ntilde;a y ralentiza. Si una Rata del Muelle se encuentra cerca de un pescado Podrido, aumentar&aacute; su velocidad de movimiento y se dirigir&aacute; al pescado para consumirlo, recuperando porci&oacute;n de su vida.\r\nSi el pescado podrido cae arriba de un campe&oacute;n enemigo, se quedar&aacute; pegado en el, sufriendo da&ntilde;o m&aacute;gico por segundo y siendo ralentizado hasta que se desprenda. Los pescados se pueden acumular.\r\nInicias con una sola acumulaci&oacute;n de Pescado Podrido, que podr&aacute; ser mejorada hasta 3 acumulaciones a medida que subas la W de nivel.\r\n\r\nE: Codicia (Ground Targeting)\r\nMadge lanza un peque&ntilde;o saco con Serpientes de Plata que se romper&aacute; al impactar el suelo, soltando todas las monedas en un &aacute;rea. Los campeones enemigos que se encuentren cerca, ser&aacute;n obligados a moverse hacia el &aacute;rea hasta un determinado tiempo. En ese lapso, no podr&aacute;n atacar ni usar habilidades.\r\n\r\nR: Sin Cabos Sueltos (Skillshot)\r\nMadge prepara un poderoso arp&oacute;n con p&oacute;lvora especial, seguido de un disparo explosivo que inflige da&ntilde;o f&iacute;sico al primer campe&oacute;n enemigo impactado y un 50% del da&ntilde;o como da&ntilde;o f&iacute;sico en &aacute;rea. Al explotar, el proyectil dejar&aacute; una gran nube de p&oacute;lvora alrededor del campe&oacute;n, cegando a todos los enemigos que se encuentren adentro del &aacute;rea.\r\nSi una o varias Ratas del Muelle entran a la nube de p&oacute;lvora, parte de su da&ntilde;o de ataque b&aacute;sico ser&aacute; infligido como da&ntilde;o verdadero hacia campeones enemigos.\r\n\r\n---------------------------------------------------------------------------------------------\r\nBueno. Como pueden ver, Madge es una campeona basada en las habilidades en &aacute;rea y en realizar combos con sus Ratas del Muelle, siendo demasiado &uacute;til tambi&eacute;n en las peleas en equipo, gracias a su da&ntilde;o en &aacute;rea y a su R, que causa gran da&ntilde;o y act&uacute;a como una especie de W de Graves mejorada.\r\nSe le pueden aplicar varios combos, como aprovechar Codicia para atinar Pescados Podridos y que una gran cantidad de Ratas inflijan da&ntilde;o a los campeones enemigos, o conseguir ganks efectivos con el Crowd Control de su E.\r\nLa linea ideal para usar a Madge se los dejo a ustedes, yo pensar&iacute;a que servir&iacute;a bien como ADC, sin embargo su kit de habilidades tambi&eacute;n se ve &uacute;til para junglear y gankear con su E o R.\r\nPara que no estuviera demasiado roto, pueden ver que no tiene ninguna habilidad de desplazamiento o algo parecido, por lo que se ver&aacute; obligada a jugar con cautela y recibir protecci&oacute;n por parte de sus aliados.\r\nY bueno, eso es todo. Me gustar&iacute;a que opinen sobre el concepto de este campe&oacute;n y si les gustar&iacute;a ver alguna habilidad (si no es que todas) plasmada en alg&uacute;n campe&oacute;n nuevo.\r\nMuchas gracias por leer.\r\n{{sticker:slayer-pantheon-thumbs}} \r\n\r\nPD: imagen de una rata de muelle (tambi&eacute;n sacada del mapa de Runaterra):\r\nhttps://imgur.com/a/LBYFfZY","replies":[{"poster":"bluerising","date":"2018-07-25T14:13:05.438+0000","up_votes":2,"down_votes":0,"body":"Me gusta la idea aunque si ves el mapa las ratas y los cazadores son de zonas muy diferentes, asi que la idea del champ en si, si te enfocas en la idea de las ratas no seria muy buena descripcion y viceversa en tal caso de los cazadores.\n\n* **Pasiva:**Si en vez de 80% del daño magico lo haces en acorde con la VM adicional o el impacto critico creo que seria mejor.\n* **Q:**Aqui podrias trabajar con los cuernos que usan en la zona de los cazadores, que haga sonar y otorge VM a los aliados en el area o DA, algo que se te ocurra, o como dice en el lore, que auyente a los aliados, algo como el fear de ww o Volibear.\n* **W:**Podrias volver a usar el cuerno para que cumpla otra funcion, podrias dar una puñalada o algo que utilice mas herramientas de un cazador.\n* **E:**No se me ocurre nada, pero implementar algo mas que lanzar una bolsa de monedas y tal estaria bien.\n* **R:**Aqui se me ocurre una idea como montar un craken o algo por el estilo y lanzarte a los champs enemigos lanzado tu arpony dejando en el lugar donde activaste la R, una vez impactado tener cierto tiempo para volver adonde dejaste caer (no se como se llama donde esta depositado el arpon).","replies":[]},{"poster":"FallenDemonX","date":"2018-07-25T03:56:29.265+0000","up_votes":2,"down_votes":0,"body":"Hay ideas interesantes pero algunas cosas quizá no estén muy balanceadas o ya están en el juego.\n\n\n*  **Pasiva:** Sacando el hecho de que es la Q de Jinx pero sin limitaciones, es básicamente la pasiva de Caitlyn. La idea de un tirador caster de control con daño sostenido y burst ocasional queda un poco nulo con una pasiva que escala con Velocidad de Ataque. Ademas no me parece que encaje con el lore que usen explosivos en todos los arpones. Igual la idea de preparar un arpón poderoso esta muy bien, quizá si pudieses idear algo mas interesante, como que se base en skills o alguna interacción con posicionamiento (como el Aislar de Kha Zix). \n\n\n* **Q:** En esencia los zombies de Yorick. Junto con la W son casi lo mismo (con la E de Yorick). Sin embargo esta bueno que se sienta mas como una jauría de caza que una horda random como los zombies o los bichos de Malza\n\n\n*  **W:** Eso de que cure las ratas esta bueno, ayuda a dar una identidad diferente a los summons. \n\n\n* **E:** Creo que hay una skill en WoW que hace algo así. Un charm en un AoE targeteado es interesante, supongo que siendo relativamente fácil de esquivar seria una skill bastante viable.\n\n\n* **R:** No hay mucho que decir, es una skill simple pero funcional. Quiza un poco muy parecida a la W de Graves pero con menos efectos y mas enfocada al daño.\n\n\nTiene una base interesante, estaría bueno algo mas descarrilado. Ya tenemos tiradores convencionales para dar y regalar pero esto podría ser algo mucho mas divertido y unico.\n\n\nEspero ver mas de ti en el futuro! {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Contrast HERO","date":"2018-07-25T13:14:07.800+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FallenDemonX,realm=LAS,application-id=J0mxKtkB,discussion-id=jd7JiHjQ,comment-id=0000,timestamp=2018-07-25T03:56:29.265+0000)\n>\n> Hay ideas interesantes pero algunas cosas quizá no estén muy balanceadas o ya están en el juego.\n> \n> \n> *  **Pasiva:** Sacando el hecho de que es la Q de Jinx pero sin limitaciones, es básicamente la pasiva de Caitlyn. La idea de un tirador caster de control con daño sostenido y burst ocasional queda un poco nulo con una pasiva que escala con Velocidad de Ataque. Ademas no me parece que encaje con el lore que usen explosivos en todos los arpones. Igual la idea de preparar un arpón poderoso esta muy bien, quizá si pudieses idear algo mas interesante, como que se base en skills o alguna interacción con posicionamiento (como el Aislar de Kha Zix). \n> \n> \n> * **Q:** En esencia los zombies de Yorick. Junto con la W son casi lo mismo (con la E de Yorick). Sin embargo esta bueno que se sienta mas como una jauría de caza que una horda random como los zombies o los bichos de Malza\n> \n> \n> *  **W:** Eso de que cure las ratas esta bueno, ayuda a dar una identidad diferente a los summons. \n> \n> \n> * **E:** Creo que hay una skill en WoW que hace algo así. Un charm en un AoE targeteado es interesante, supongo que siendo relativamente fácil de esquivar seria una skill bastante viable.\n> \n> \n> * **R:** No hay mucho que decir, es una skill simple pero funcional. Quiza un poco muy parecida a la W de Graves pero con menos efectos y mas enfocada al daño.\n> \n> \n> Tiene una base interesante, estaría bueno algo mas descarrilado. Ya tenemos tiradores convencionales para dar y regalar pero esto podría ser algo mucho mas divertido y unico.\n> \n> \n> Espero ver mas de ti en el futuro! {{sticker:slayer-pantheon-thumbs}}\n\nMuchas gracias por tu opinión, la voy a tener en cuenta para futuras ideas de campeones c: {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Madge","date":"2019-01-26T17:52:27.981+0000","up_votes":1,"down_votes":0,"body":"xD sería precursora del nombre jajaja!","replies":[]}]}