{"poster":"Hunter6957","date":"2015-05-26T05:58:57.935+0000","title":"Who is the better Support?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":2,"body":"I&#039;m just wondering what you opinions are on who are the best supports (for bot lane) out of {{champion:1}} , {{champion:43}}  and {{champion:117}} . Rate first, second and third. These are the main three I am wondering out. Thanks.\r\n\r\nI am asking of this from you guys to see who I should practice more when I play with friends.","replies":[{"poster":"JnrSoldier","date":"2015-06-04T03:02:07.508+0000","up_votes":1,"down_votes":0,"body":"{{champion:117}} , {{champion:43}} and then {{champion:1}}","replies":[]},{"poster":"teletubbie","date":"2015-05-26T09:20:13.747+0000","up_votes":1,"down_votes":0,"body":"Um I think Lulu, Karma and then Annie. \n\nI still think best supps atm are Nautilus, Janna, Thresh","replies":[]},{"poster":"Vote 1 Trump","date":"2015-05-26T08:49:55.781+0000","up_votes":1,"down_votes":0,"body":"{{champion:44}} {{summoner:32}} {{champion:81}}","replies":[]},{"poster":"Ghazan","date":"2015-05-26T08:26:51.733+0000","up_votes":1,"down_votes":0,"body":"i love karma cus she can be played aggressively or defensively (my thing is max q if winning lane and e if losing) and it usually results in a good outcome. she has a slow which can become a better slow with her ult, a point and click root which can self heal with ult and then a shield that gives ms too AND can shield a bunch of teammates if theyre close with ult. her ult has a pretty low cd and can lower with spells and aa plus late game if u decide to build her full ap she can be strong af i love her so much {{item:3070}} {{champion:43}} \n","replies":[]},{"poster":"Project Xayah","date":"2015-05-26T08:07:52.808+0000","up_votes":1,"down_votes":0,"body":"{{champion:133}}, {{champion:133}} and {{champion:133}}.","replies":[]},{"poster":"Hunter6957","date":"2015-05-26T06:38:39.526+0000","up_votes":1,"down_votes":0,"body":"Thanks guys for the information. I do play other supports but I am trying to expand my playstyle at the moment, that's all. And I am aware they are not the best in the current Meta.","replies":[{"poster":"Hunter6957","date":"2015-05-26T08:05:46.132+0000","up_votes":1,"down_votes":0,"body":"I also play a bunch of other supports such as {{champion:412}} , {{champion:25}} ,  {{champion:53}} , {{champion:201}} , {{champion:89}} , {{champion:37}}  and {{champion:267}}. Just trying to expand my playstyle.","replies":[]}]},{"poster":"BarryButcher","date":"2015-05-26T07:43:26.663+0000","up_votes":1,"down_votes":0,"body":"Annie can Solo an ADC even when she is played Support. If you think you need to solo carry, shes a good pick. But she is an agressive laner, you need to take advantage of her power and deal damage, not play passively.\n\nKarma a good poke support. Can provide the whole team with shields is all round pretty useful. I don't know how her rework coming out next patch effects her ability to support so I would put a pin in her and wait to see if she's still a good support after the changes.\n\nLulu is good. Provides some poke, cc, and a very usefull Ult. She's a \"pokey\" version of Janna. Does more damage but provides less peel.\n\nIMO, when I play support, I like playmakers. Usually going with Blitzcrank or Thresh over most others. So I would say from those 3, i would say the order it as you have it. Annie, Karma then Lulu.","replies":[]},{"poster":"Yasei Doubutsu","date":"2015-05-26T07:25:17.061+0000","up_votes":1,"down_votes":0,"body":"I main support.\nNow personally I like Braum and a few others.\n\nAnnie is a kill lane so if you have an ADC that can use a good stun well then shes good. How ever she doesn't offer as much Peeling as Karma and Lulu.\n\nKarma and Lulu are both poke champions.\nPoke with Q harass when you can etc.\n\nHow ever Lulu provides Great CC as well, a Transform. and an AoE knock up.\nShe also has a speed boost and so on.\n\nSo I would rate Lulu as the highest unless your going for Kill Lane Bot Lane, in which case Annie is pretty good.","replies":[]},{"poster":"Sephyre3","date":"2015-05-26T06:27:31.388+0000","up_votes":1,"down_votes":0,"body":"Personally I think Lulu can be tough to master, a slight positioning mistake and you get punished pretty hard. But a good Lulu will change the entire game. I'd say it has the toughest learning curve of the 3 as a support.\n\nAnnie is for all-out aggression, I really struggle with her.  She can dominate teamfights but if you push the envelope too much in lane you'll bring a world of pain onto you. \n\nKarma is more of an all rounder than the other two, I would probably say that she feels a little weaker than the others right now, but that may be due to the fact I am terrible at aiming empowered abilities.\n\nDepends on your playstyle really, do you want more aggression, go annie, do you want precise control go lulu, do you want to poke and run fast, try karma. They all have their advantages.\n\nI've also been beaten by all of them in lane recently =(","replies":[]},{"poster":"span","date":"2015-05-26T06:22:35.373+0000","up_votes":1,"down_votes":0,"body":"depends on the team comp. i think lulu and annie fit in really well with the current meta.","replies":[]}]}