{"poster":"Temp 89989998","date":"2016-03-23T22:46:52.753+0000","title":"ex diamond player, terzo account permaban bla bla bla rifamo che non cero.","subforum":"Discussioni generali","up_votes":7,"down_votes":8,"body":"http://i.imgur.com/Q5C7ADc.jpg\r\n\r\nscusate, colppa mia non ho specificato.\r\n\r\nnon ho insultato nessuno del mio team, perch&egrave; infatti abbiamo vinto.\r\n\r\nho scritto trash al team avversario perch&egrave; una volta riconnesso mi hanno babysittato e gankato a livello 1-2-3 diverse volte per cercare di prendere kills e vincere (parliamo di elo plat4) quindi no bronze logic qui perfavore.\r\n\r\nil fatto che abbia scritto diamond non significa che mi merito sconti alla pena o che me la tiro, voglio solo far notare che gioco dalla season1 e che mi sono fatto la gavetta bronzo 5 &gt; silver 4 &gt; gold 3 &gt; diamond5 nelle season 1-2-3-4 e che ho visto il gioco mutare, promuovendolo pubblicamente e reclutanto almeno una quarantina di giocatori, motivo per cui avevo tanti account con cui livellare e spiegare il gioco\r\n\r\nla chat che vedete &egrave; tutta /all indirizzata a gente che stava facendo di tutto, e potendo anche cheating pur di vincere quel game, erano sotto di 10k, e uno di loro aeva problemi di internet come il sottoscritto, ci siamo riconnessi entrambi a 10 minuti, la differenza &egrave; che noi abbiamo lasciato farmare in pace il loro kayle, ma loro mi hanno devastato 3v1 (v1 perhc&egrave; ho detto al mio support di non stare con me botlane che ero una causa persa, ma di andare mid a snowballare con yasuo)\r\n\r\nho pensato, io sono sivir, mi chiudo sotto torre e faccio waveclear, ma ovviamente non potevo sapere che mi avrebbero gankato sotto torre 3 volte... sbeffeggiato in all chat dicendomi che l&#039;antisportivit&agrave; &egrave; di casa su league, onestamente &egrave; tipo la prima partita in anni dove mi disconnetto e non riesco a giocare magari la seconda.... ed ho sempre lasciato farmare il mio laner fino a che fosse ad un punto accettabile per lui o finch&egrave; non ha provato a killarmi col jungler.\r\n\r\n\r\nil nick temporaneo invece, &egrave; perch&egrave; avevo la tag &quot;skt t1&quot; \r\n\r\nsi sono un fanboy di merda, mi piace faker, non sono main mid, ma nella season 3-4 creai questo account perch&egrave; seguivo molto gli lck\r\n\r\nnon sapevo fosse vietato di regola, e tuttora sono sbalordito visto la quantita incredibile di gente che mette tag simili, persino giocatori famosi e streammers hanno smurf come &quot;skt t1 madlife&quot; ad esempio... \r\n\r\nper quanto riguarda il &quot;far perdere le partite&quot; come ho detto sono crashato in questa partita e basta, per il resto ho giocato 3 game, vinti 3 oggi, e prima non avevo tempo per lavoro, oggi era il mio giorno libero a lavoro ed ho deciso di sprecarlo a farmi permabannare, ho ancora 2 account ma onestamente mi schifa loggarli. \r\n\r\nho dedicato anni tempo e risorse a giocare a lol, perch&egrave; oltre ad essere un gioco per me &egrave; una passione ed un sogno irrealizzbile, quello di diventare giocatore professionista o streammare, ma ahim&egrave; sono nato in italia ed entrambe le cose sono quasi impossibili, oltretutto sembra che il mio cap sia diamond, non ho il talento per andare oltre e con gli anni la passione si affievolisce, ne ho 24, e quando ne avevo 16 mi facevo immersioni nel gioco molto migliori e non mi stancavo mai di giocare, ora anche provandoci ad un certo punto della giornata dico BASTA perch&egrave; mi passa la voglia\r\n\r\n\r\nma ricevere sospensioni permanenti per BOIATE simili &egrave; ridicolo, spesso infatti ricevo minacce di morte io e la mia famiglia sulla chat di lol, gente che mi aggiunge e mi dice che dovremmo morire accoltellati e altro, e io vengo bannato per ste cazzate ? senza contare che ho scovato 4 accounts farmer che bottano dalla mattina alla sera in 2 giorni di gioco sul mio quinto account che &egrave; livello 12 e che corrono mid a fare 0-30 (ma non per feedare, farmano ip ed exp probabilmente per vendere account unranked a qualcuno o servizi eloboosting) \r\n\r\nli ho reportati, screennnati, e nomi salvati, e indovinate ? sono ancora li che fanno questa cose 12 ore al giorno, in questo esatto momento. \r\n\r\nne avrei altre di cose da dire ma tanto so che &egrave; una perdita di tempo, perhc&egrave; la gente non riescie ad accettare che esista un tasto MUTE ma non un tasto &quot;match me with no feeders or trolls&quot; \r\n\r\npreferirei 1000 volte un flamer ad un feeder o ad un troll, perch&egrave;? perhc&egrave; con 1 tasto elimino il problema. \r\n\r\ncon un feeder invece no, tanto sappiamo che preme no sul surrender, e via 40 minuti del mio tempo buttati \r\n\r\n&quot;si ma il tempo su un videogioco &egrave; cmq buttato&quot; CAZZATE io investo il mio tempo in una cosa che mi piace, ho delle aspettative che RARAMENTE vengono soddisfatte perch&egrave; tutti i game sono pieni di trolls feeders e gente che flamma 10 volte me ma per qualche ragione mi ritrovo comunque permabannato, invece il tizio che locka jungler in diamond sfotte tutti in chat ancora in champion select, e dimentica di prendere smite, viene invaso nella jungla e killato e ci insulta tutti e ragequitta, lui &egrave; ancora li che gioca. non c&egrave; giustizia in questo gioco, ne gratitudine per quello che io e molti altri giocatori facciamo nel promuovere league of legend in nazioni sottosviluppate come l&#039;italia, andando in internet ponts e parlandone al titolare, organizzare sere streaming degli lcs, far venire gente nuova e spiegargli il gioco, queste cose la riot non le vede, e non gli frega un cazzo,  non ho mai chiesto una medaglia o un premio, a me bastava giocare, e se possibile che mi venisse rimossa sta cristo di chat che tanto &egrave; inutile. \r\n\r\nse anche esistesse una remota possibilit&agrave; di essere sbannati, probabilmente mi schiferebbe uguale giocare a questo punto. \r\n\r\nse ancora c&egrave; qualcuno che ha voglia di parlarne mi faccia sapere.","replies":[{"poster":"Darth Ponzius","date":"2016-03-23T22:53:41.671+0000","up_votes":2,"down_votes":1,"body":"Si bel discorso ma il punto è un altro: se è il tuo terzo account permabannato non vuoi farti due domande? senza considerare che per arrivare ad un permaban non basta quella sola partita ma servono un bel po' di infrazioni. E non regge neanche il discorso \"gli altri flammano, gli altri sono bot etc e loro non vengono puniti\", perchè non puoi sapere che fine facciano quelle persone in seguito e anche perchè tutto ciò non giustifica tutto il flame e la tossicità che ti ha portato a perdere il terzo account. è inutile fare questi discorsi se poi non si riesce a fare un attimo di mea culpa e capire che al terzo permaban il problema non sta nella riot, ma in te stesso.","replies":[{"poster":"Temp 89989998","date":"2016-03-23T23:02:01.205+0000","up_votes":2,"down_votes":1,"body":"1° il mio primo account è stato bannato per violazioni dei termini del summoner cod,e ho flammato e sono stato punito, il secondo account non direi di essermi meritato un permaban, e questo è il terzo. la logica è che giocando diverse ore consecutive e venvendo costantemente flammato arrivi ad un punto dove tilti e scrivi qualcosa di troppo, succede 2 volte, e ti becchi uno strike, a 3 strikes permaban. direi che un anno è lunghino e che succeda che qualcuno ti flammi e che tu gli risponda, nenahce in modo troppo offensivo, solo scendendo al suo livello, è sufficiente che succeda un paio di volte. \n\n\n\n2° sai esiste un sito che si chiama OPGG dove puoi tenere sotto controllo statistiche kda e partite, nonchè registrarle, li veid anche se una persona che fa uso di programmi di tere parti per mesi sta ancora giocando, ancora bottando, etc. \na dir la verità esistono anche altri siti ma era per dirne uno.","replies":[{"poster":"LightIsMyPath","date":"2016-03-24T00:05:44.471+0000","up_votes":2,"down_votes":0,"body":"> la logica è che giocando diverse ore consecutive e venvendo costantemente flammato arrivi ad un punto dove tilti e scrivi qualcosa di troppo, succede 2 volte, e ti becchi uno strike, a 3 strikes permaban. direi che un anno è lunghino e che succeda che qualcuno ti flammi e che tu gli risponda, nenahce in modo troppo offensivo, solo scendendo al suo livello, è sufficiente che succeda un paio di volte.\n\nCiao :) io gioco da un po' piu' di un anno, e com'e' giusto che sia data la mia esperienza sono in bronzo, quindi in 99 game su 100 c'e' flame a non finire, spesso anche gente che trolla o che gioca in maniera improponibile. Gioco anch'io molte ore al giorno. Io non sono mai stata punita in nessun modo, neanche una chat restricted, ed ho ricevuto soltanto 2 volte l'avviso di \"hai molti report\", entrambi nel periodo in cui stavo provando nuovi champ e quindi feeddavo come i disperati ( mi avranno reprtato per intentional feeding lol ).\n\nSemplicemente si puo' non flammare, fallo e vedrai che non avrai da lamentarti. E non sono nemmeno una che promuove il \"muta tutti\" , basta esprimersi civilmente e se gli altri non lo fanno sono loro in torto e secondo me passano pure da ridicoli...","replies":[{"poster":"Temp 89989998","date":"2016-03-24T15:28:02.471+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=labarso,realm=EUW,application-id=MJVj50Jw,discussion-id=KR4VvwoH,comment-id=000100000000,timestamp=2016-03-24T00:05:44.471+0000)\n>\n> Ciao :) io gioco da un po' piu' di un anno, e com'e' giusto che sia data la mia esperienza sono in bronzo, quindi in 99 game su 100 c'e' flame a non finire, spesso anche gente che trolla o che gioca in maniera improponibile. Gioco anch'io molte ore al giorno. Io non sono mai stata punita in nessun modo, neanche una chat restricted, ed ho ricevuto soltanto 2 volte l'avviso di \"hai molti report\", entrambi nel periodo in cui stavo provando nuovi champ e quindi feeddavo come i disperati ( mi avranno reprtato per intentional feeding lol ).\n> \n> Semplicemente si puo' non flammare, fallo e vedrai che non avrai da lamentarti. E non sono nemmeno una che promuove il \"muta tutti\" , basta esprimersi civilmente e se gli altri non lo fanno sono loro in torto e secondo me passano pure da ridicoli...\n\ntranquillo, io giocavo dalla season1, hai tempo per cambiare opinione, diamo tempo al tempo, quando un giorno avrai un perma fammi sapere se la pensi uguale.","replies":[{"poster":"LightIsMyPath","date":"2016-03-24T15:49:36.503+0000","up_votes":4,"down_votes":0,"body":"Il fatto è che io comportandomi così non avrò mai un permaban, non avrò nemmeno un ban temporaneo, e probabilmente non prenderò mai una chat restricted.  Per avere 3 permaban hai preso 12 punizioni differenti ( a meno che in uno di questi tu non abbia flammato a dei livelli talmente gravi da portare subito al ban, ma dalla chat che hai postato suppongo non sia così). 12/5 : 2 ed una frazione a season, quindi stando al tuo ragionamento io avrei già dovuto prendere 2 chat ristrette e dovrei essere sulla buona strada per il primo ban temporaneo , visto che gioco da poco più di una season. Il fatto che non sia così dimostra che il tuo ragionamento non è corretto, o meglio lo e' solo applicato ad un comportamento  come il tuo. Cambiando comportamento la frequenza di punizioni per season si può abbassare, fino ad arrivare a 0.\n\nIn parole povere se cambi comportamento non ti puniscono più. E' così difficile afferrare questo concetto?","replies":[{"poster":"Temp 89989998","date":"2016-03-24T22:31:07.511+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=labarso,realm=EUW,application-id=MJVj50Jw,discussion-id=KR4VvwoH,comment-id=00010000000000020000,timestamp=2016-03-24T15:49:36.503+0000)\n>\n> Il fatto è che io comportandomi così non avrò mai un permaban, non avrò nemmeno un ban temporaneo, e probabilmente non prenderò mai una chat restricted.  Per avere 3 permaban hai preso 12 punizioni differenti ( a meno che in uno di questi tu non abbia flammato a dei livelli talmente gravi da portare subito al ban, ma dalla chat che hai postato suppongo non sia così). 12/5 : 2 ed una frazione a season, quindi stando al tuo ragionamento io avrei già dovuto prendere 2 chat ristrette e dovrei essere sulla buona strada per il primo ban temporaneo , visto che gioco da poco più di una season. Il fatto che non sia così dimostra che il tuo ragionamento non è corretto, o meglio lo e' solo applicato ad un comportamento  come il tuo. Cambiando comportamento la frequenza di punizioni per season si può abbassare, fino ad arrivare a 0.\n> \n> In parole povere se cambi comportamento non ti puniscono più. E' così difficile afferrare questo concetto?\n\nsi è difficile, e come ho detto, tranquillo arriverà il tuo giorno.","replies":[{"poster":"LightIsMyPath","date":"2016-03-25T00:26:58.252+0000","up_votes":2,"down_votes":1,"body":"Vabbe' fai come vuoi tanto ci rimetti tu mica un altro xD disprezzare le regole tanto da esser sordi a proprie spese non fara' cambiare le regole ne' indispettire chi le ha fatte, l'unico che ci rimette sei tu, in qualunque ambito. E' come se un ladro dicesse ad uno che non ruba \" stai tranquillo, tanto arrivera' anche per te il giorno dell'arresto\" \"\"ma io non rubo\" \"tranquillo ti arresteranno\". Pero' se vuoi infrangere le regole sempre e comunque nessuno puo' impedirtelo, sappi solo che le conseguenze le subirai, almeno la maggior parte delle volte, sempre e solo tu.\n\nPs: tranquillo no pls, sono una ragazza {{sticker:slayer-jinx-catface}} in bocca al lupo se continui su Lol fino al quarto, o su altri giochi.","replies":[]}]}]}]},{"poster":"Power Mac","date":"2016-03-24T12:03:41.620+0000","up_votes":2,"down_votes":1,"body":"Spero che chi ha scritto il post legga il commento di labarso. \nTutti quelli che insultano come ossessi o si comportano male, dicono \"ma io non ho fatto nulla\": ti assicuro che se chiedessi a chi è oggetto dei tuoi, inutili, sfoghi, non risponderebbe così.\nPoi le lamentele sui gank non le capisco proprio: tutti lo farebbero, mi sembra la cosa migliore da fare per avere uccisioni gratis. Sul serio sei platino e ti stupisci? In guerra tutto è lecito, si dice, no?\n\nVisto che vieni costantemente bannato, prova ad evitare di scrivere qualsiasi cosa che non siano ss, ping o consigli. Ti assicuro che è possibilissimo. Non ho mai ricevuto restrizioni di chat o quant'altro: eppure a volte, sbagliando, litigo con persone che mi irritano, ma sempre senza esagerare o insultare mai (in medio stat virtus).\n\nInfine, Temp, rileggi un attimo quello che hai scritto in inglese: ma davvero ti pare una discussione rispettosa dell'altro? Internet è degenerato per un motivo molto semplice: non si trattano le altre persone come se fossero fisicamente presenti dinnanzi a noi. Tu parleresti mai ad un tuo conoscente, o ancora peggio, uno sconosciuto, in quel modo? Spero proprio di no, altrimenti ti mancherebbe la benché minima educazione. Senza offesa, è, tra l'altro, il tipico inglese da manuale del \"novice flammer\": poche frasi, stereotipate, sgrammaticate, con insulti che leggi ovunque da parte degli individui più propensi al litigio e all'offesa gratuita; è un linguaggio che si dovrebbe evitare di acquisire e diffondere a mio giudizio...","replies":[{"poster":"LightIsMyPath","date":"2016-03-24T12:55:33.829+0000","up_votes":1,"down_votes":1,"body":"Bhe' divare un tizio al livello 3 e' veramente da persone tristi... io di solito gioco mid e quando mi torna l'avversario all'1 dopo una disconnessione gli scrivo che avremo una farming lane finche' lui non decide che ha recuperato abbastanza... \n\nSostanzialmente tu farmi, io non cerco ti ucciderti ne' di pokkarti, se sai che usero' aoe per farmare spostati... ( ricordo di aver involontariamente attirato un affamatissimo jungler in lane dopo che il tf nemico si era preso in faccia una E ed una ulti di {{champion:99}}  fatte per pushare la wave prima del recall xD), io roammero', se tu mi segui considerero' finito l'accordo perche' vuol dire che puoi combattere, se ti fai gankare idem.. Mi sembra un buon compromesso tra l'essere sportivi e l'evitare di mettere in svantaggio il proprio di team per una disconnessione altrui ( un mid afk farming sarebbe uno svantaggio xD ).\n\nDetto questo non c'e' bisogno di dirgli \"you are thrash\".. \"very correct player\" \"thanks for letting me back in game mate\" \"you are sad\" e simili rendono lo stesso messaggio, se non migliore, et voila', lo si e' detto in maniera civile, senza flammare e quindi non siamo reportabili.. senza contare che non siamo scesi al livello dell'altro.","replies":[]}]},{"poster":"Floppyz","date":"2016-03-24T07:54:05.232+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=labarso,realm=EUW,application-id=MJVj50Jw,discussion-id=KR4VvwoH,comment-id=000100000000,timestamp=2016-03-24T00:05:44.471+0000)\n>\n> Ciao :) io gioco da un po' piu' di un anno, e com'e' giusto che sia data la mia esperienza sono in bronzo, quindi in 99 game su 100 c'e' flame a non finire, spesso anche gente che trolla o che gioca in maniera improponibile. Gioco anch'io molte ore al giorno. Io non sono mai stata punita in nessun modo, neanche una chat restricted, ed ho ricevuto soltanto 2 volte l'avviso di \"hai molti report\", entrambi nel periodo in cui stavo provando nuovi champ e quindi feeddavo come i disperati ( mi avranno reprtato per intentional feeding lol ).\n> \n> Semplicemente si puo' non flammare, fallo e vedrai che non avrai da lamentarti. E non sono nemmeno una che promuove il \"muta tutti\" , basta esprimersi civilmente e se gli altri non lo fanno sono loro in torto e secondo me passano pure da ridicoli...\n\nThis.","replies":[]}]}]}]},{"poster":"SirZeel","date":"2016-03-23T22:51:29.346+0000","up_votes":3,"down_votes":4,"body":"Tanto ti richiudono anche questo.\nLEL.","replies":[{"poster":"Temp 89989998","date":"2016-03-23T22:54:38.957+0000","up_votes":3,"down_votes":2,"body":"quello lo hanno chiuso perchè la gente si scannava nei commenti non per il post in se, sono quasi sicuro che a riot non importi di me o di quello che posto finchè non insulto nessuno, ma potrei sbagliarmi, magari la riot vuole insabbiare i ban a caso, e chiude i posts, perchè tanto nelle mail spiegazioni non le danno.","replies":[{"poster":"NiraBlade","date":"2016-03-24T05:25:40.763+0000","up_votes":6,"down_votes":2,"body":"Y, ti è stato chiuso perché i commenti stavano degenerando. \n\n> magari la riot vuole insabbiare i ban a caso, e chiude i posts\n\nWut? Complottismo!?! Dov'è la parte delle scie chimiche? 😂😂😂","replies":[{"poster":"Temp 89989998","date":"2016-03-24T15:23:39.261+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=NiraBlade,realm=EUW,application-id=MJVj50Jw,discussion-id=KR4VvwoH,comment-id=000000000001,timestamp=2016-03-24T05:25:40.763+0000)\n>\n> Y, ti è stato chiuso perché i commenti stavano degenerando. \n> \n> Wut? Complottismo!?! Dov'è la parte delle scie chimiche? 😂😂😂\n\nsi infatti ironizzavo, sapevo che era per come stava degenerando in flamwar","replies":[]}]},{"poster":"Hell88","date":"2016-03-23T23:02:48.675+0000","up_votes":2,"down_votes":3,"body":"togli il quasi davanti al sicuro","replies":[]}]}]},{"poster":"EASY WIN GET IT","date":"2016-03-26T00:23:33.575+0000","up_votes":3,"down_votes":0,"body":"un iidiota in meno, grazie riot\npeccato che ogni 1 bannato, c'è ne stanno altri 5 che stanno ancora giocando","replies":[]},{"poster":"Saypher","date":"2016-03-24T14:57:22.354+0000","up_votes":1,"down_votes":1,"body":"a me fa ridere solo che si lamenta del fatto che la gente non muti chi insulta per non leggere, quando lui potrebbe benissimo urlare allo schermo insulti ai player, famiglia, avi e progenie, senza digitare nulla ed evitarsi certi ban (come faccio io nelle giornate no).","replies":[{"poster":"Temp 89989998","date":"2016-03-24T15:28:44.671+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Saypher,realm=EUW,application-id=MJVj50Jw,discussion-id=KR4VvwoH,comment-id=0007,timestamp=2016-03-24T14:57:22.354+0000)\n>\n> a me fa ridere solo che si lamenta del fatto che la gente non muti chi insulta per non leggere, quando lui potrebbe benissimo urlare allo schermo insulti ai player, famiglia, avi e progenie, senza digitare nulla ed evitarsi certi ban (come faccio io nelle giornate no).\n\na me fa ridere che se uno usa hack in partita e lo chiamo stronzo lui continui a giocare e io mi becchi i permabans. ah e mi fai ridere anche tu.","replies":[{"poster":"Saypher","date":"2016-03-24T15:34:24.158+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Temp 89989998,realm=EUW,application-id=MJVj50Jw,discussion-id=KR4VvwoH,comment-id=00070000,timestamp=2016-03-24T15:28:44.671+0000)\n>\n> a me fa ridere che se uno usa hack in partita e lo chiamo stronzo lui continui a giocare e io mi becchi i permabans. ah e mi fai ridere anche tu.\n\nseriamente, se tu lo chiami stronzo cosa cambia? a parte il fatto che te rischi il ban, pensi seriamente che lui legga quello che scrivi e dica fra se: \"forse ha ragione e dovrei cambiare e diventare un uomo migliore\"?\n\nE' solo tempo perso, come pensandoci è tempo perso quello che sto buttando via io per risponderti che tanto non cambierai idea.","replies":[{"poster":"Detective Meow","date":"2016-03-24T18:03:24.597+0000","up_votes":2,"down_votes":0,"body":"Saypher ti ha detto un pò le cose come stanno, non si tratta di ragionamenti bronzei come hai detto nel tuo post, ma di attitudine, se ti prendi 3 permaban vorrà pur dire qualcosa.\nSe qualcuno (come affermi) sta attivamente utilizzando hack per vincere, flammarlo non ti farà vincere il game e (indovina un pò) ti fa passare dalla parte sbagliata. \nL'unica è aspettare la fine partita e riportarlo per utilizzo di programmi di terze parti e hacking (c'è la funzione apposita come sicuramente sai, e lasciar fare a chi di competenza: dopotutto il suo account non sparirà in una nuvola di Chanel n°5 perchè gli hai elencato le numerosi doti da trapezzista della madre).\nSiamo su internet figliolo, nessuno con un minimo di cervello si offende per una persona totalmente random che gli ricorda di esser stato un errore di tempi presi male, anzi, a maggior ragione, se hackando sta salendo la classifica praticamente si ritrova con LP gratis e un tizio in meno (te) da sfidare, oltre il danno pure la beffa, sta a te se dargli il 100% della soddisfazione.","replies":[{"poster":"Temp 89989998","date":"2016-03-24T22:34:22.065+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Saets,realm=EUW,application-id=MJVj50Jw,discussion-id=KR4VvwoH,comment-id=0007000000000000,timestamp=2016-03-24T18:03:24.597+0000)\n>\n> Saypher ti ha detto un pò le cose come stanno, non si tratta di ragionamenti bronzei come hai detto nel tuo post, ma di attitudine, se ti prendi 3 permaban vorrà pur dire qualcosa.\n> Se qualcuno (come affermi) sta attivamente utilizzando hack per vincere, flammarlo non ti farà vincere il game e (indovina un pò) ti fa passare dalla parte sbagliata. \n> L'unica è aspettare la fine partita e riportarlo per utilizzo di programmi di terze parti e hacking (c'è la funzione apposita come sicuramente sai, e lasciar fare a chi di competenza: dopotutto il suo account non sparirà in una nuvola di Chanel n°5 perchè gli hai elencato le numerosi doti da trapezzista della madre).\n> Siamo su internet figliolo, nessuno con un minimo di cervello si offende per una persona totalmente random che gli ricorda di esser stato un errore di tempi presi male, anzi, a maggior ragione, se hackando sta salendo la classifica praticamente si ritrova con LP gratis e un tizio in meno (te) da sfidare, oltre il danno pure la beffa, sta a te se dargli il 100% della soddisfazione.\n\nguarda, non ho mai offeso pesante ne usato parolacce ne scritto in lingua che non fosse inglese...\n\nse devo essere permabannato per i \"ggwp ff at 20\" e \"stop feeding ffs\" o al limite massimo \"noob\" o in questo caso ilt rash riferito a gente ridicola che chiaramente infrange lei stessa il summoner code, a me mi frega un cazzo di continuare a provarci.","replies":[{"poster":"Detective Meow","date":"2016-03-26T15:00:11.509+0000","up_votes":2,"down_votes":0,"body":"Acqua in bocca durante i game.\nPunto.","replies":[]}]}]}]}]}]},{"poster":"Zanarkand III","date":"2016-03-24T10:09:40.234+0000","up_votes":2,"down_votes":1,"body":"Scusa se te lo dico ma se il tuo sogno è irrealizzabile è solamente perchè hai un attitude pessima per essere diamond, non perchè vivi in italia. Con questo tipo di comportamenti non si arriva assolutamente a diventare un giocatore professionista e mi meraviglia anche che tu sia Diamond. Dopo 5 anni di lol ti meravigli se dopo esserti disconnesso ti divano in 3? sei serio? e dopo flammi pure come un bronzo? è questo il modo in cui ti impegni per rendere realizzabile il tuo sogno? beh allora non ti meravigliare se è irrealizzabile, tralaltro per PERMABANNARTI l account questo non è sicuramente l unico game in cui generi flame e chaos... magari invece di incolpare la rito o l' italia col prossimo account ti farai un esame di coscienza e manterrai un atteggiamento da persona matura","replies":[{"poster":"Temp 89989998","date":"2016-03-24T15:30:41.434+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DTR Zanmato,realm=EUW,application-id=MJVj50Jw,discussion-id=KR4VvwoH,comment-id=0005,timestamp=2016-03-24T10:09:40.234+0000)\n>\n> Scusa se te lo dico ma se il tuo sogno è irrealizzabile è solamente perchè hai un attitude pessima per essere diamond, non perchè vivi in italia. Con questo tipo di comportamenti non si arriva assolutamente a diventare un giocatore professionista e mi meraviglia anche che tu sia Diamond. Dopo 5 anni di lol ti meravigli se dopo esserti disconnesso ti divano in 3? sei serio? e dopo flammi pure come un bronzo? è questo il modo in cui ti impegni per rendere realizzabile il tuo sogno? beh allora non ti meravigliare se è irrealizzabile, tralaltro per PERMABANNARTI l account questo non è sicuramente l unico game in cui generi flame e chaos... magari invece di incolpare la rito o l' italia col prossimo account ti farai un esame di coscienza e manterrai un atteggiamento da persona matura\n\nio ho incolpato mestesso per non essere in grado di realizzare queste cose, non sono in grado di salire oltre perchè quello è il massimo che posso fare, se leggi ho scritto così infatti. \n\nperò l'italia non aiuta eh, ci sarà un motivo se non ci sono giocatori italiani in scena competitiva ;) prova a chiedere a pablo trincia.","replies":[]},{"poster":"Temp 89989998","date":"2016-03-24T15:24:54.298+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DTR Zanmato,realm=EUW,application-id=MJVj50Jw,discussion-id=KR4VvwoH,comment-id=0005,timestamp=2016-03-24T10:09:40.234+0000)\n>\n> Scusa se te lo dico ma se il tuo sogno è irrealizzabile è solamente perchè hai un attitude pessima per essere diamond, non perchè vivi in italia. Con questo tipo di comportamenti non si arriva assolutamente a diventare un giocatore professionista e mi meraviglia anche che tu sia Diamond. Dopo 5 anni di lol ti meravigli se dopo esserti disconnesso ti divano in 3? sei serio? e dopo flammi pure come un bronzo? è questo il modo in cui ti impegni per rendere realizzabile il tuo sogno? beh allora non ti meravigliare se è irrealizzabile, tralaltro per PERMABANNARTI l account questo non è sicuramente l unico game in cui generi flame e chaos... magari invece di incolpare la rito o l' italia col prossimo account ti farai un esame di coscienza e manterrai un atteggiamento da persona matura\n\nsi difatti dimmi quanti italiani ci stanno agli lcs, tanti vero?","replies":[]}]},{"poster":"Ucr0niA","date":"2016-03-24T11:58:32.439+0000","up_votes":4,"down_votes":3,"body":"Cosa leggo in questo post?\nNulla, il dannatissimo nulla, aria fritta condita con: niente assoluto.\n\nSi parla di divisioni, si parla di ambizioni in game, di altro ancora, e sai quanto di questo è inerente col tuo ban?\nNiente ancora, esatto.\n\nMi tocca ancora leggere di gente che posta una singola chat e chiede se \"è da ban!?\", quando per un permaban servono mesi e mesi di flame intenso, siete come uno che reduce da un omicio multiplo viene preso mentre fa una rapina a un minimarket e poi grida \"L'ergastolo per un furto?\"\n\nTi sei fatto permabannare 3 account, come ti ho già detto, ciò è sintomatico di una irriducibile attitudine al flame.\nPer 3 volte avrai ricevuto chat restricted, per 3 volte avrai ricevuto il ban di 15 giorni, già due volte il permabann e nonostante ciò hai continuato a flammare, sei irrecuperabile.\n\nPersonalmente puoi anche essere la promessa del videogaming italiano, io non ti voglio nella mia stessa chat.","replies":[{"poster":"Detective Meow","date":"2016-03-24T18:05:29.560+0000","up_votes":1,"down_votes":0,"body":"Il niente, appunto.\nLacrime che sgorgano da un ego forse troppo grande per ammettere che l'errante possa essere se medesimo.","replies":[]}]},{"poster":"Temp 89989998","date":"2016-03-25T15:31:46.642+0000","up_votes":2,"down_votes":1,"body":"vorrei vedere il pensiero di una persona che scrive qui ora se loggasse ora e si trovasse permabannata a caso \"gnegnegne ma io non vengo permabannato perchè non infrango le regole\" eh si è perchè scrivere gg wp surrender at 20 è tanto grave\n\ntranquilli che basta una votla, un giorno loggherete e uno di voi sarà permabannato e cambierà opinione da bianco a nero, magari nel suo chat logg ci sarà un \"gg ez\" inteso come ezreal e non easy ma sarà permabannato, e poi capirete. non sono io che sono di marmo siete voi e sto regolamento che promuove il trolling e il feeding e punisce a caso.","replies":[]},{"poster":"Temp 89989998","date":"2016-03-25T15:27:34.250+0000","up_votes":2,"down_votes":1,"body":"gente che parla a caso pensa a caso  ;) mi passa la voglia di esistere.","replies":[]},{"poster":"Hell88","date":"2016-03-23T23:11:49.304+0000","up_votes":3,"down_votes":3,"body":"il problema ormai è che il tribunale è automatizzato,manca totalmente il fattore umano che può fare la differenza ad interpretare le situazioni.mentre sta schifezza che c'è ora và a rullo.se ti becchi una premade a cui stai sulle palle ti becchi 4 report e sei fregato.Era molto meglio prima ma a quanto pare gli costava troppo in ip e l'han tolto (almeno io credo) e ora ci becchiamo sto schifo.","replies":[{"poster":"Menfrix","date":"2016-03-24T08:51:54.363+0000","up_votes":2,"down_votes":1,"body":"non è stato tolto tanto per gli ip, quanto per il fatto che veniva abusato, infatti moltissimi casi venivano valutati tutti come colpevoli o innocenti (indifferentemente) senza un effettiva valutazione per ricevere i premi.\ncomunque il tuo ragionamento è un arma a doppio taglio poichè potresti avere la sfiga di beccarti i giudici che valutano il tuo caso tutti bacchettoni e beccarti una sanzione per aver scritto qualcosa che altri arbitri avrebbero valutato diversamente.\nCon questo sistema, oltre ad arrivare ad una valutazione del comportamento in pochi giorni al contrario dei diversi mesi che ci volevano, tutti vengono valutati col medesimo metro di giudizio.","replies":[{"poster":"Detective Meow","date":"2016-03-24T18:10:28.391+0000","up_votes":1,"down_votes":0,"body":"Vero, prima quando chi partecipava al tribunale, guadagnava IP bonus, molti erano tendenti a cliccare su colpevole o non, senza leggere la chat, per il proprio tornaconto personale, senza il minimo problema che quella persona magari era stata riportata ingiustamente ( chi se ne frega non lo conosco mica).","replies":[]}]}]},{"poster":"wellyT93","date":"2016-03-24T00:31:19.878+0000","up_votes":1,"down_votes":0,"body":"Io di solito sono il primo giustizialista verso i flamer pesanti, i tossici ecc... , ma leggendo questi log sinceramente io non avrei bannato, il perma poi lo trovo fuori luogo.\nComunque una bella chat restrict di ALMENO 100 games l'avrei data di sicuro. ","replies":[{"poster":"Detective Meow","date":"2016-03-24T18:06:50.481+0000","up_votes":1,"down_votes":0,"body":"Bisogna anche vedere se questa è la sua prima chatlog reportata, o una delle tante.\nNon si permabanna per una chat andata male (può capitare a tutti) ma diamine se ci vuole per chi su 100 partite ne passa 99 a dare testate agli altri.","replies":[{"poster":"Temp 89989998","date":"2016-03-24T22:32:12.944+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Saets,realm=EUW,application-id=MJVj50Jw,discussion-id=KR4VvwoH,comment-id=00030000,timestamp=2016-03-24T18:06:50.481+0000)\n>\n> Bisogna anche vedere se questa è la sua prima chatlog reportata, o una delle tante.\n> Non si permabanna per una chat andata male (può capitare a tutti) ma diamine se ci vuole per chi su 100 partite ne passa 99 a dare testate agli altri.\n\nquesto è uno screen di tutta la mail, nella mail postano tutti i casi di report, solitamentre 3 games per una punizione sospensione/ban o perma, ma in questo caso è un eccezzione","replies":[]}]}]},{"poster":"Lee Pugno Divino","date":"2016-03-24T08:26:13.713+0000","up_votes":2,"down_votes":3,"body":"Dalle immagini non ritengo che il caso sia da permaban, effettivamente è una punizione un pò severa.\nEd ecco perché io non dico una parola in chat, ma aspetto la fine della partita, visto che la chat post partita non è controllata C:","replies":[]}]}