{"poster":"Bmason13","date":"2016-09-16T03:03:31.905+0000","title":"Leaver Buster","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I don't know if it was specified, but I have had some computer problems and they resulted in me having leaving two games today, which i may have even lost LP. On top of that i have a 5 Game Low Priority Queue. Although it may help trolls, when the problem comes to a surprise to me as well then it's a double whammy. \r\n  I have been stuck in Bronze the whole season because of people here and there playing ranked and not knowing how to play competitively, which is no reason for me to be upset, because there is no set level for B5 players and theres only 1 way of really figuring out if you are ready to play, is by playing. \r\n  So, I know what its like when people leave a game and I am thankful of the /Remake option added recently, which happened to be one of the games i missed out on, and the other was as soon as the game was about to load. it actually shut my computer down earlier today and windows had to repair. \r\n  When I returned from work my computer was running on desktop, so I thought everything was okay. Maybe it was my fault that i had not tried to play a custom game first to see if the game would run, but I don't believe that the punishment Fits the crime. The second time I even tried to connect with a different computer and it would not connect.","replies":[{"poster":"Porocles","date":"2016-09-16T18:12:21.112+0000","up_votes":1,"down_votes":0,"body":"It sucks to hear that you've had some computer issues that caused you to leave, but [leaverbuster](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ) treats all leaves equally.  All leaves still creates negative experiences for others and will only apply an LPQ after multiple leaves.  While it's not something we can remove from an account, I'm happy to help troubleshoot whatever is causing you to leave.  Let me know because playing without issues is the only way to restore your standing with the system.","replies":[]}]}