{"poster":"Janna best Waifu","date":"2019-09-11T14:04:59.756+0000","title":"solten mehr spieler reports persönlich beim support melden?","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":3,"body":"Huhu, Janna hier \nin letzer zeit hab ich die besonders harten fälle direkt beim suppport gemeldet, dort auch mit ein paar riot mitarbeiter gechattet, welche sich bedankt haben. Nun würd ich gerne eure meinung wissen. Schreibt ihr auch öfters persönliche tickets an das Support team oder nutzt ihr nur die ingame funktion?\n\n\nBesonders spannend fand ich ein fall, wo ich der spieler auch noch einen Beschwörernamen hatte der gegen die nutzungs bedingungen verstößte, und ich somit Life im Client gucken konnte wie riot ihn aufgefordert hat seinen namen zu ändern... Lustiger weise hat er einfach 1 buchstabe rausgedrückt..\n\n{{sticker:sg-janna}} \n wobei der name trotzdem noch gegen die Nutzungsbedingungen ist, wird spannend. Riot hat sich nochmals bedankt und meint härtere Strafen anzupreisen.\n\nhttps://cdn.discordapp.com/attachments/466523540368392193/621345087875579924/unknown.png\n\n\n**Mich würd mal gern intressieren wie ihr das so macht? Nur ingame melden oder nutzt ihr auch den support? Wenn ja, dürfte euch der Blitzcrank Bot sicherlich auch bekannt vorkommen, was ist eure Statistic? Wie viele Reports pro Spiele sendet ihr?**\n\n_______________________\nHier mal meine ^^\n\n\nhttps://cdn.discordapp.com/attachments/466523540368392193/621343775607881738/unknown.png\n\n{{sticker:sg-zephyr}}  Das sind jedes Spiel ca 3 leute .\n\nhttps://cdn.discordapp.com/attachments/466523540368392193/621344022044344323/unknown.png","replies":[{"poster":"AudreyrJmEb","date":"2019-09-12T06:21:16.904+0000","up_votes":4,"down_votes":0,"body":"Die \"bedanken\" sich weil es ihr fucking Job ist, die müssen freundlich sein.\n\nNormale reports reichen aus.","replies":[]},{"poster":"Izaya Kumiho","date":"2019-09-11T15:05:52.187+0000","up_votes":2,"down_votes":0,"body":">in letzer zeit hab ich die besonders harten fälle direkt beim suppport gemeldet, dort auch mit ein paar riot mitarbeiter gechattet, welche sich bedankt haben.\n\nEin einziger Report löst bereits eine Überprüfung aus, wollte ich einfach mal so angemerkt haben ._.'\n\n>Mich würd mal gern intressieren wie ihr das so macht? Nur ingame melden oder nutzt ihr auch den support? \n\nMan sollte eher dann zum Support gehen, wenn man vergessen hat, einen Spieler nach dem Game zu reporten.\nDas System läuft in den **meisten Fällen** ziemlich gut. \nDaher reicht es, wenn du einfach nur das Knöpfchen drückst.\n\n","replies":[{"poster":"Cenâreth","date":"2019-09-12T10:29:51.354+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Izaya Kumiho,realm=EUW,application-id=KYnfKGf0,discussion-id=UVpgbGvQ,comment-id=0003,timestamp=2019-09-11T15:05:52.187+0000)\n>\n> Ein einziger Report löst bereits eine Überprüfung aus, wollte ich einfach mal so angemerkt haben ._.'\n> \n\nDachte ich Anfangs auch scheint aber anscheinend nicht der Fall zu sein. Seitdem ich es über den Riot Support regle, geht es viel besser.","replies":[{"poster":"Izaya Kumiho","date":"2019-09-12T12:13:27.168+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=KYnfKGf0,discussion-id=UVpgbGvQ,comment-id=00030000,timestamp=2019-09-12T10:29:51.354+0000)\n>\n> Dachte ich Anfangs auch scheint aber anscheinend nicht der Fall zu sein. Seitdem ich es über den Riot Support regle, geht es viel besser.\n\nUnd was genau lässt dich glauben, der Button würde nicht ausreichen?\n\nDie Privatsphäre von jedem Spieler ist sehr wichtig.\nDaher wirst du auch nie ein Instantfeedback zu einem Report bekommen mit genauen Angaben. \nDas Pop-up kann übrigens auch von einem Report stammen, der Monate her gewesen ist. \nAlso wirst du auch da nicht sagen können: \"_Das muss XY gewesen sein, der nun eine Strafe dank mir hat >:D HA!_\"\n\n\n\nAuch der Playersupport sagt dir nicht, ob diese Person bestraft wird und was für eine Strafe XY erhalten wird. Die bedanken sich und überprüfen das eben.","replies":[{"poster":"eingew","date":"2019-09-13T05:48:24.629+0000","up_votes":1,"down_votes":1,"body":"Der psychische Effekt ist ein anderer, wenn einem ein Mensch schreibt und sich bedankt, als wenn eine Maschine den Report annimmt.\n\nEiner der Hauptgründe, warum viele das Tribunal vermissen (mich eingeschlossen) und es sich für viele Spieler eher angefühlt hat, dass gegen Flame vorgegangen wird, als es das heute tut.\nEinfach weil man selbst aktiv etwas gegen Flame tun konnte. Dass man selbst handelt, ist eine völlig andere Erfahrung, als wenn man bloß jemanden melden kann und dann ein automatisiertes System den Rest übernimmt. Auch wenn letzteres unterm Strich deutlich mehr bringt.\n\nDeshalb fand ich die Idee auch immer toll, dass man die Chatanalyse als Spieler selbst in einem \"Tribunal\" überprüfen kann und selbst eine Einschätzung zu den Fällen abgeben kann. Am besten kriegt man danach dann gezeigt, wie das Tribunal sich entschieden hat. Das würde das beste aus beiden Systemen verbinden, man hätte die Geschwindigkeit der Chatanalyse und den psychischen Effekt, dass etwas getan wird vom Tribunal.","replies":[{"poster":"Izaya Kumiho","date":"2019-09-13T11:25:35.813+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=UVpgbGvQ,comment-id=0003000000010000,timestamp=2019-09-13T05:48:24.629+0000)\n>\n> Der psychische Effekt ist ein anderer, wenn einem ein Mensch schreibt und sich bedankt, als wenn eine Maschine den Report annimmt.\n\n\nHach ja, die guten copy'n'paste Antworten wirken wie üblich Wunder.\nhueheuehuehe\n\n{{sticker:sg-lulu}}","replies":[]}]}]},{"poster":"BlackSugaRose","date":"2019-09-12T10:43:48.808+0000","up_votes":2,"down_votes":0,"body":"Was genau bringt dich denn zu der Annahme? Wieso sollte das nicht der Fall sein und inwiefern \"geht es viel besser\"?","replies":[]}]}]},{"poster":"Veezey","date":"2019-09-11T18:14:31.690+0000","up_votes":1,"down_votes":0,"body":"Wo nehmt ihr eigentlich diese ganzen toxic Leute her?","replies":[{"poster":"eingew","date":"2019-09-12T05:38:09.688+0000","up_votes":1,"down_votes":1,"body":"Ich sehe du spielst keine Rankeds ^^.","replies":[{"poster":"Veezey","date":"2019-09-12T18:27:53.013+0000","up_votes":1,"down_votes":0,"body":"Nicht so viele, aber auch da ist Flame und Co. eher selten.","replies":[{"poster":"eingew","date":"2019-09-13T05:42:58.422+0000","up_votes":1,"down_votes":1,"body":"Bei mir ist es nicht so selten. Kann schon verstehen, dass der TE sagt er meldet viele Spieler, mache ich selbst auch.\n\nVielleicht ist unsere Toleranzschwelle aber auch einfach unterschiedlich hoch.","replies":[{"poster":"Veezey","date":"2019-09-13T11:00:04.527+0000","up_votes":2,"down_votes":0,"body":"Das kann schon sein. Ich übersehe aber auch manchmal Flame xD","replies":[]}]}]},{"poster":"Cenâreth","date":"2019-09-12T10:30:46.346+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=UVpgbGvQ,comment-id=00060000,timestamp=2019-09-12T05:38:09.688+0000)\n>\n> Ich sehe du spielst keine Rankeds ^^.\n\nSagt nichts aus, hatte in meinen letzten 10 Normals knapp 90 toxische Spieler.","replies":[{"poster":"eimoH","date":"2019-09-12T10:59:01.556+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=KYnfKGf0,discussion-id=UVpgbGvQ,comment-id=000600000000,timestamp=2019-09-12T10:30:46.346+0000)\n>\n> Sagt nichts aus, hatte in meinen letzten 10 Normals knapp 90 toxische Spieler.\n\nein witzbold. {{sticker:sg-miss-fortune}} \n\ndas mit dem zählen solltest du aber nochmal üben btw.","replies":[]}]}]}]},{"poster":"XenesisCH","date":"2019-09-11T17:42:22.312+0000","up_votes":2,"down_votes":0,"body":"Es gibt eigentlich nur eine Situation, wo ich mir vorgenommen habe den Support zusätzlich zu benachrichtigen und der ist wenn jemand absichtlich das Spiel sabotiert, da der Feederbuster meiner Meinung nach einfach nicht gut funktioniert. Bisher kam aber so ein Fall nicht mehr vor. Der letzte war als Neeko noch ziemlich neu war und neben mir halt noch jemand Neeko spielen wollte. Da ich aber zuerst picken durfte, habe ich sie natürlich ausgewählt. Der andere hat dann angekündigt, dass er das Spiel sabotieren wird. Dies hat er auch ganz offensichtlich (die Gegner hatten sogar einen Afk'ler und wir haben das Spiel trotzdem ohne Chance verloren) getan, aber trotzdem wurde er nie bestraft dafür (ich hab sein Profil für eine Weile beobachtet).","replies":[]},{"poster":"Necromant","date":"2019-09-11T14:37:59.936+0000","up_votes":2,"down_votes":0,"body":"Ob ich jetzt n Ticket schreibe und da vom Blitzcrank-Bot ne antwort bekomme oder ob einfach inGame auf Report klicke und es ein Bot bearbeitet, macht für mich teils keinen Unterschied :D","replies":[{"poster":"Angel Ayume","date":"2019-09-11T14:43:29.592+0000","up_votes":1,"down_votes":1,"body":"Na ja, du hast beim Ticket ja die Möglichkeit einen Menschen anzufordern und quasi direkt zu bitten, dass sich dies ein Mensch anschaut.","replies":[]}]},{"poster":"Angel Ayume","date":"2019-09-11T14:35:43.541+0000","up_votes":3,"down_votes":1,"body":"Selten. Für Flaming oder so ist ein Report per Ticket nicht nötig, weil der Bot dafür gut genug ist. \nIch schicke wenn dann nur ein Reportticket, wenn es sich um Trolling handelt, ich mir aber sicher bin, dass der Feederbuster dies nicht erkennen kann, weil es doch zu individuell ist. Da dies aber selten vorkommt, sind auch meine Tickets entsprechend selten.","replies":[]},{"poster":"eingew","date":"2019-09-12T05:47:43.708+0000","up_votes":2,"down_votes":1,"body":"Ich glaube das hält dich eher auf, als dass es dich voran bringt. Der Support braucht eher länger als kürzer als die Chatanalyse um ein Spiel zu überprüfen und wird nur selten einen Fehler korrigieren können.","replies":[]},{"poster":"HairyAsianWife","date":"2019-12-03T14:43:09.444+0000","up_votes":1,"down_votes":0,"body":"Ist bei mir unterschiedlich wenn jemand mental wird nutze ich die Mutefunktion und Fall hat sich erledigt,nicht mein Problem.\n\nWenn sich ein Spieler dazu entschlossen hat bewusst Spiele zu sabortieren geht ein schönes Replay raus an den Riotsupport,\naber auch nur dann wenn es wirklich extrem ist,manche Spiele kann man trotz Sabotage immer noch gewinnen also renn ich jetzt\nnicht bei jedem Vorkommnis zum Riotsupport.\n\nErst nach einem Spiel reporte ich Flamer,weil Diese es nicht lassen können es auch im Endscreen zu tun und wenn es zu krass wird report ich ihn über die Ingame Funktion bei besonders speziellen Fällen geht auch mal ein Screenshot raus an den Riotsupport.\n\nDenn das Ding ist: Der Ingame Chatverlauf wird ebenfalls überprüft,was bedeutet du selbst musst dir das nicht geben,daher lieber die Mutefunktion verwenden.","replies":[]},{"poster":"ZNranger","date":"2019-10-07T09:11:57.449+0000","up_votes":1,"down_votes":0,"body":"Hallo @all!\nIch glaube das Reports und ähnliches so gut wie nichts bringen.\n\nEin Paar Beispiele :\nIm chat ist oft zu lesen wie Easy, noob, EZ, isi, izi u.s.w \nich habe jeden dieser Gamer reported und ... nicht mal eine Antwort von RIOT bekommen.\n\nJemand hat meine tote Mutter beleidigt!\nDa reagiere ich sehr empfindlich! Ich habe diesen gemeldet und Support Ticket aufgemacht. und was ist passiert? \nDer Gamer spielt laut op.gg weiter und ... den Seelischen Schmerz habe ich erlitten.\nRIOT macht nichts ...\n\nFu.. you oder Idiots zu schreiben gehört wahrscheinlich zum guten Ton.\n\nIch würde es Gut finden wenn der Chat abgeschaltet werden würde. \nOder richtiges ehrliches Feedback was dem Gamer passiert ist.\n\nOder die Strafen drastisch erhöhen!\nBeispiel: Beim ersten mal Easy schreiben: der Gamer muss 5 Botgames machen dann hat er das Recht wieder auf Normls/ranked.\nder zweit, Dritte verdoppelt die Strafe. 10, 20, 40, 80, 160, 320 usw. Das Problem das dieser Gamer dann ab einer gewissen Grenze wieder mal Easy schreibt erledigt sich dann. Keiner hat Bock auf so viele Botgames.\n\nVG","replies":[]},{"poster":"Jennifer420","date":"2019-09-15T10:05:05.022+0000","up_votes":1,"down_votes":0,"body":"nein weils absolut sinnlos ist","replies":[]},{"poster":"00 M4ddin 00","date":"2019-09-12T05:23:51.627+0000","up_votes":1,"down_votes":0,"body":"Also ich reportet sehr viel ^^ \n\nTickets schreibe ich nicht so viele aber wenn dann kann ich danach zuschauen wie die Spieler gebannt wurden :D oder sie sind alle danach für 2 wochen in Urlaub gefahren aber das glaub ihr nicht ^^' \n\nTickets schreib ich auch oft wenn Leute in der CS trollen und ich dann Dodge damit da ne Strafe kommt. \n\nUnd in manchen Fällen reportet ich und schreib nochmal dazu ein extra Ticket :)","replies":[]},{"poster":"BlackSugaRose","date":"2019-09-11T16:14:13.524+0000","up_votes":1,"down_votes":0,"body":"Hey fellow Janna Main! {{champion:40}} \n\nDer gute Blitzcrank Bot hat mir auch vor kurzem meine Report Statistik mitgeteilt und ich kam zu dem Zeitpunkt auf 16 Meldungen/20 Spiele.\n65 ist da schon ordentlich!\nIch nutze Support Tickets nur sehr selten. Eigentlich nur, wenn es aus irgendeinem Grund nicht möglich war, den Report im Client abzuschicken.\nAlso wenn ich vergesse zu reporten oder wenn das schlechte Verhalten in der Championauswahl stattgefunden hat, welche dann jemand verlassen hat.\nOder aber wenn ich der Meinung bin, dass es sich um einen sehr ungewöhnlichen Fall gehandelt hat, bei dem ich ein paar mehr Zeichen brauche, um die Situation zu erklären.\n\"Normale\" Verstöße werden auch recht gut vom automatisierten System erkannt.\n\nLiebe Grüße\nBlackSugaRose","replies":[]},{"poster":"need elo police","date":"2019-09-11T14:43:51.156+0000","up_votes":1,"down_votes":0,"body":"Ganz ehrlich, diese Community ist es nicht wert um sich so viel Mühe zu geben. Solange man nicht irgendwie Challenger Niveau spielt oder so sieht man die Typen doch eh nicht mehr. Natürlich sehe ich genug Leute die sich unter aller Sau benehmen, aber wenn ich da jeden beim Support direkt melde komme ich ja gar nicht mehr zu etwas anderem.\n\nDie werden nach dem Spiel reportet und gut ist. Da habe ich meinen Job getan und dann will ich auch nur noch möglichst schnell diese Spieler vergessen.","replies":[]}]}