{"poster":"no way 4 silas","date":"2015-03-05T15:12:47.884+0000","title":"League of Legends sucht nach verbindung trotz vollerinternetverbingdung","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich hab das Problem das wenn ich lol starte alles gut läuft bis ich im game bin, dann läuft garnihts mehr es sucht immer nach Verbindung obwohl ich vollen w-lan empfang habe ich weiß nicht mehr weiter und habe deswegen schin ne 40 min leavebuster Warnung. Bitte helfen !!!!","replies":[{"poster":"chakib121020","date":"2015-03-05T16:17:21.421+0000","up_votes":1,"down_votes":0,"body":"bei mir ist das auch wenn man ein spiel starten möchte das es nicht funkzioniert weil das an der Firewall liegt aber selbst wen ich die ausschallte geht das nicht was einer was ich da machen muss","replies":[{"poster":"chakib121020","date":"2015-03-05T16:22:38.232+0000","up_votes":1,"down_votes":0,"body":"und noch ne frage man kann ja das spiel reparieren aber dadurch wird was gelöscht ka was das ist könnt ihr mir sagen was das ist","replies":[{"poster":"Rkoturdo Ndo","date":"2015-03-05T17:54:18.310+0000","up_votes":1,"down_votes":0,"body":"Heya\nTastenbelegungen und Itemsets. Aber wegen deinem Firewallerror mach mal folgendes:\n> Versuch mal deine Kommandozeile aufzurufen. Dazu klickst du das windows Zeichen und gibst cmd ein. Auf das gefundene Ergebnis rechtsklickst du und führst es als Admin aus. Dann gibst du ein:\n> netsh int ip reset und klickst auf enter und dann\n> netsh winsock reset (wieder auf Enter)\n> dann den PC neustarten, schau ob es klappt. \n\nMfG Rkoturdo","replies":[]}]}]},{"poster":"no way 4 silas","date":"2015-03-05T15:34:37.852+0000","up_votes":1,"down_votes":0,"body":"Wów dass nenn ich mal ne rctig gute antwort danke","replies":[]},{"poster":"Yaxtee","date":"2015-03-05T15:23:21.917+0000","up_votes":1,"down_votes":0,"body":"Hey du :)\nKannst du Testweise mal eine Lan Verbindung herstellen?\nAuch wenn dir volles Wlan angezeigt wird, heißt das nicht unbedingt, dass das reicht.\nLad außerdem mal bitte ein Tracert hoch :)\n\n>**6. Tracerts erstellen**\n\n>Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n>Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n>Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download: http://www.pingplotter.com/downloads/pngplt_std.exe\n>1. Das 'Trace Interval' sollte auf '1 second' eingestellt werden.\n>2. Die 'Address to Trace' ist in unserem Fall 185.40.65.1\n>3. trace starten\n>4. Es wird jetzt jede Sekunde ein tracert durchgeführt. Während Pingplotter im Hintergrund läuft, kann man ein Testspiel in LoL starten um zu testen ob Probleme auftreten.\n>Sollte es Verbindungsprobleme geben, geht es mit Schritt 5 weiter. Gibt es keine Verbindungsprobleme sind die tracerts vermutlich nutzlos.\n>5. Sollten Verbindungsprobleme aufgetreten sein, müssen die tracerts abgespeichert werden. File -> Export to textfile... http://fs1.directupload.net/images/141125/hmj3jxtl.png\n>6. Samples to Export: All Samples http://s14.directupload.net/images/141125/tn9c75t4.png\n>7. 'Export...' Speichert die Textdatei am besten auf dem Desktop oder an einem Ort wo ihr diese auch wieder findet.\n>8. Datei im Forum hochladen wenn ihr eure Antwort erstellt\n\nAnhand der tracerts kann man häufig die Fehlerquelle finden, wenn es sich bei den Verbindungsproblemen um Paketverlust oder einen hohen Ping handelt","replies":[]}]}