{"poster":"Ahlzar","date":"2016-09-15T22:47:00.459+0000","title":"Cerco...","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Dei buoni teamm8s per fare delle duo o dynamics. Premetto subito una cosa: non voglio persone minorenni (non ce l&#039;ho con voi ragazzi, ma la maggior parte statisticamente appartiene alla categoria bimbinutella); voglio persone che il &quot;toxic&quot; non sanno nemmeno dove sia di casa; delle persone con le quali, PRIMA DI TUTTO, bisogna divertirsi; delle persone che SONO DISPOSTE ad imparare e ad insegnare, discutendo anche dopo il game (mentre si aspetta la Q) dei propri errori e di quelli degli altri; delle persone che ridono, scherzano e non prendono il gioco n&egrave; ESTREMAMENTE sul serio n&egrave; ESTREMAMENTE come &quot;intrattenimento&quot;; delle persone mature, sia al livello sociale che relazionale; delle persone NON ESPERTE ma NEMMENO alle prime armi; delle persone che VOGLIONO RANKARE con seriet&agrave;, professionalit&agrave; e spasso tra coetanei. \n\nIl mio nick &egrave; quello del Post, sono Gold V e vorrei salire in compagnia, con le caratteristiche sopra elencate. Chiedo disponibilit&agrave; di utilizzo di TeamSpeak magari... Per me sarebbe l&#039;ideale. \n\nP.S. \"Maino\" jungler e adc, ma posso sopperire anche ad una eventuale scopertura del midlaner.\nFatevi avanti! :D","replies":[{"poster":"calufe","date":"2016-09-16T08:00:36.113+0000","up_votes":1,"down_votes":0,"body":"Ciao, io sono nuovo di lol se non ti crea problemi evere un neofita nel gruppo aggiungimi","replies":[]},{"poster":"Khaludian","date":"2016-09-16T07:04:38.018+0000","up_votes":1,"down_votes":0,"body":"Se non ti schifa sto oscillando tra s2 e s3 ma vorrei arrivare gold come la scorsa season 19 anni e ts quindi np fate vobis","replies":[]},{"poster":"rallerman","date":"2016-09-15T23:09:13.375+0000","up_votes":1,"down_votes":0,"body":"Se ti interessa aggiungimi pure su lol sono s1, ex p5 con un altro account, ho 18 anni e ho anche ts aggiungimi pure se vuoi ^^","replies":[]}]}