{"poster":"Tobinho","date":"2015-08-09T06:15:55.725+0000","title":"Espada de lo oculto... sirve? si, no, por qué","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Un amigo me dijo que pruebe el item Espada de lo Oculto ( {{item:3141}} ) con Draven para divertirme. Resulta que las partidas que lo us&eacute; no me fue tan bien (excepto las que jugu&eacute; con &eacute;l porque es diamante xD). Entonces me puse a pensar si es que este item en verdad serv&iacute;a y si es as&iacute;, &iquest;por qu&eacute;?. Adem&aacute;s, &iquest;por que item deber&iacute;a reemplazarlo? Pienso que ocupa lugar en mi build, porque si es que no me quedo a falta de sustain, me quedo a falta de protecci&oacute;n o de probabilidad de cr&iacute;tico. &iquest;Alguien usa ese item cotidianamente y le va bien? Creo que no es de utilidad...\r\n\r\n\r\n\r\n_Ac&aacute; la informaci&oacute;n del item, para el que no lo conoce...:_\r\n\r\n{{item:3141}}Espada de lo Oculto\r\nCosto: 1400 (1040)\r\n+10 Da&ntilde;o de Ataque\r\n\r\n**Pasiva &Uacute;NICA: Otorga +5 de Da&ntilde;o de Ataque por acumulaci&oacute;n (y 5 acumulaciones la primera vez que se compra). Otorga 2 acumulaciones por muerte o 1 acumulaci&oacute;n por ayuda (m&aacute;ximo de 20 acumulaciones). Al morir se pierde la mitad de las acumulaciones. Con 20 acumulaciones, otorga +20% de Velocidad de Ataque adicional.**","replies":[{"poster":"Dithir","date":"2015-08-09T07:28:22.881+0000","up_votes":4,"down_votes":0,"body":"Es un item que uno se armaria en caso de estar muy feed, como el mejai, si tienen una buena racha y no mueres son 120 de daño adicional, que es demasiado para un item que solo te costo 1400.\nPero para una partida estandar donde moriras cada tanto no le veo mucha utilidad, ya que no se aprovecha todo su daño, en esos casos puede hasta llegar a ser una molestia. No lo recomendaria como parte de una build si no mas que como un item situacional cuando vas carreando","replies":[]},{"poster":"SrPepeGalleta","date":"2015-08-09T10:22:09.035+0000","up_votes":2,"down_votes":0,"body":"Solo se usa si eres \"Vincent Draven\"\n\nhttps://www.youtube.com/watch?v=oj4HeYcSL0o","replies":[{"poster":"000 Cuyi 000","date":"2015-08-09T14:11:42.348+0000","up_votes":1,"down_votes":0,"body":"Alto campeo, ni de base podían salir XD","replies":[]}]},{"poster":"Cpt Miau","date":"2015-08-09T19:22:28.207+0000","up_votes":1,"down_votes":0,"body":"Con 20 cargas da 110 de ad y 20% de velocidad de ataque, es un item para esas partidas en las que vas 10/0 y los matas a todos sin mucho esfuerzo, si quieres ocupar este ítem, cosa que debes hacer solo en partidas muuy especificas, reemplaza el item defensivo por este","replies":[]},{"poster":"Desolase","date":"2015-08-09T19:08:18.195+0000","up_votes":1,"down_votes":0,"body":"Se lo considera item de Snowball, efecto bola de nieve junto a mejias. Es un item para rushear en early cuando consideras que vas a dominar la lane que tenes enfrente.  El fin práctico de comprar ese item es que te mentaliza para conseguir acumulaciones para que la espada se haga más fuerte no tenes que morir, (el item stackea con kills y asistencias) es decir es necesario que ayudes pero no necesariamente que matés, lo que es vital es que no mueras. No morir es ya de por si una ventaja le sacas farm, experiencia y nivel al contrincante, sumale a esa ventaja las acumulaciones que se van dando en ese item y ahí tenes el snowball (una avalancha de poder progresivo jaja XD) yo soy fan de mejias no tanto de de esta espada pero son excelentes items para aprender a jugar y comprar wards para que el jungla no me saque los 10 stacks que tanto me costo conseguir :P\nItems de KDA perfecto. Es un item que demanda la excelencia :) (ahhhh se emocionaba el loco)","replies":[]},{"poster":"FlatLife","date":"2015-08-09T17:32:18.210+0000","up_votes":1,"down_votes":0,"body":"Yo lo uso cuando juego ADC con personajes que no son necesariamente para esa posiciones, con {{champion:16}} {{champion:412}} {{champion:37}} {{champion:90}} , me suele ir bien con ellos cuando armo este item, eso si, hay que ser cuidadoso y tratar de no morir","replies":[]},{"poster":"Swimpool","date":"2015-08-09T07:54:59.703+0000","up_votes":1,"down_votes":0,"body":"{{champion:107}}  Says Hi","replies":[]}]}