{"poster":"JnglPowaaa","date":"2015-07-22T17:16:42.516+0000","title":"Bann wegen DC","subforum":"Hilfe & Support","up_votes":1,"down_votes":2,"body":"Hallo User und Hallo Riot\r\n\r\nHabe heute wieder das selbe Problem wie gestern. Ich starte das Game und im Loadingscreen verliere ich die Verbindung und kann nicht mehr reconeccten ( versuche es nun seit ca 30 minuten). Da dieses Problem jzt schon zum zweiten mal auftritt gibts ja jzt auch nen Bann von 5 minuten f&uuml;r 5 Games. Echt toll sowas das man nichts daf&uuml;r kann aber gebannt wird.\r\n\r\nMan beachte die Screens Internetverbindung ist vorhanden usw...\r\n\r\nHat vlt jemand die selben Probleme oder kann man gegen den Bann was machen?","replies":[{"poster":"Neh28","date":"2015-07-22T21:29:29.506+0000","up_votes":1,"down_votes":1,"body":"Mein LoL ist während des Lade screens abgestürtzt und ich konnte die Verbindung nicht Wiederherstellen. Somit hab ich ne 20 Minuten sperre bekommen","replies":[{"poster":"JnglPowaaa","date":"2015-07-23T10:50:01.893+0000","up_votes":1,"down_votes":0,"body":"war be mir gestern 2 mal der fall hab jzt lol nochmal neu heruntergelafen mal schauen ob es jzt funktioniert","replies":[]}]},{"poster":"JnglPowaaa","date":"2015-07-22T17:27:54.042+0000","up_votes":1,"down_votes":1,"body":"so nächstes game gestartet und schon wieder der selbe müll gg","replies":[{"poster":"HellFlameZz","date":"2015-07-22T17:32:09.226+0000","up_votes":1,"down_votes":0,"body":"Wieso fängst du direkt nach einem Spielabsturz wegen deinem Internet/League of Legends ein neues Spiel an? Ich persönlich würde erstmal nach der Ursache des Problems suchen.\n\nLG\nHellFlameZz","replies":[{"poster":"JnglPowaaa","date":"2015-07-22T17:35:07.396+0000","up_votes":1,"down_votes":1,"body":"Wieso weil vor 2 stunden noch funktioniert hat. Mit meinem internet is alles ok und sonst auch muss an riot liegen. mir geht es nur auf den keks das man wegen sowas nen bann kassiert","replies":[{"poster":"Patter91","date":"2015-07-22T21:33:19.922+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JnglPowaaa,realm=EUW,application-id=7hciEY9w,discussion-id=s4MFlaRK,comment-id=000000000000,timestamp=2015-07-22T17:35:07.396+0000)\n> muss an riot liegen.\n\nWarum? Weil DU und NUR DU Probleme hast? Weißt du überhaupt grundlegend, wie das Internet funktioniert oder warum nimmst du dir heraus zu sagen, nur, weil dein PC eine Verbindung anzeigt, dass es nicht deine Verbindung sein kann?","replies":[]}]}]}]}]}