{"poster":"Lautaro7u7 12349","date":"2018-11-26T19:47:45.487+0000","title":"Zoe Esta Rota","subforum":"Jugabilidad, balance y narrativa","up_votes":4,"down_votes":7,"body":"Zoe esta rota juegue con el campeon que juegue esepto con malza el crepusculo esta roto no es posible que al minuto 10 te de una q y te sque la mitad de la vida me vengo a quejar para que riot aga algo aunque se que no va a hacer nada... Pero es que asta de soporte te Oneshotea eso esta verdaderamente roto mis quuejas arraigan a que siempre me aparecen zoe`s en mis partidas y es frustrante que en el minuto 10 te aga mierda con una abilidad eso que no hablamos de las demas porfavor aganle un rewok por que no hay otra manera de que no este roto porque todo su da&ntilde;o arraiga desde su q ya se pero aganle un rework loco les deseo suerte invocadores ;v    {{champion:142}} {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"zMiSTiK","date":"2018-11-26T20:37:12.681+0000","up_votes":5,"down_votes":0,"body":"Amigo, si vieras todos los nerfs que le cayo, el champ ya casi no es viable, sus habilidades son muy esquivables (si sabes dodgeaer) y realmente si te da una e no te manda al free fire como antes. Y pedir un nerfeo ahora? es en serio? que sigue? nerf a riven? nerf a kindred? xDDd.","replies":[]},{"poster":"schiavoni","date":"2018-11-26T21:35:05.840+0000","up_votes":4,"down_votes":0,"body":"hablare en tu idioma para que me entiendas\n\n\nZO3 n0 est4 rot4 ia qu3 su vnica abilid4d que ac3 dano es su Q","replies":[]},{"poster":"Zindro","date":"2018-11-29T16:19:04.404+0000","up_votes":2,"down_votes":0,"body":"Zoe es como el antiguo Nunu, o muy fuerte o muy débil.","replies":[]},{"poster":"DarkestBlood4","date":"2018-11-29T16:15:19.131+0000","up_votes":2,"down_votes":0,"body":"Sin ofender, pero {{champion:142}} a sido demasiado nerfeada (Tanto que seria mejor un bufeo de su Q ya que le han quitado demasiado daño), el pedir que la nerfeen aun más es dado a que o bien no sabes jugar contra ella (Y te lo digo de buena forma) o que no te esfuerzas en evitar sus habilidades (Ya que es solo saber sus movimientos o ponerse a una distancia segura cubriendote con unos minions, ya que su unico ataque de area es la Q cuando golpea a un enemigo)\n\nPor favor, evitense pedir nerfeos innecesarios que solo arruinarian a  los campeones, los trabajadores de Riot son los que más saben del juego y perfectamente saben que nerfear o buffear\n\nTe recomiendo de buena forma que aprendas a jugar contra ella\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Rgnrok","date":"2018-11-26T20:54:48.605+0000","up_votes":1,"down_votes":0,"body":"aprende a jugar","replies":[]},{"poster":"KarmaUnder","date":"2018-11-26T20:26:20.853+0000","up_votes":1,"down_votes":1,"body":"El problema esta en su stun, es muy problematico ...","replies":[]}]}