{"poster":"schlueppaxXD","date":"2017-05-26T14:11:15.879+0000","title":"Permannent Ban","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":11,"body":"Guten Tag,\r\n\r\nleider wird mir im Support nicht wirklich weitergeholfen.\r\n\r\nIch habe vor 3 Wochen einen 2Wochen Ban bekommen wegen 1 Spieles ohne Vorwarnung, also ich hatte davor noch nie eine Restriction oder &Auml;hnliches.\r\nUnd diese Woche direkt den permanenten Ban wegen 1 Spieles hinterher.\r\n\r\nHier das was ich geschrieben habe:\r\n\r\nGame 1\r\nschlueppaxXD: :(\r\nschlueppaxXD: takke care twisted 6\r\nschlueppaxXD: said it\r\nschlueppaxXD: ...\r\nschlueppaxXD: well\r\nschlueppaxXD: vi\r\nschlueppaxXD: 2nd blue for him\r\nschlueppaxXD: 2nd gank\r\nschlueppaxXD: you wann start doing something`?\r\nschlueppaxXD: 20 cs lead...\r\nschlueppaxXD: at least be here for counter gank\r\nschlueppaxXD: i have pressure...\r\nschlueppaxXD: 3rd\r\nschlueppaxXD: you lose a winning lane\r\nschlueppaxXD: well\r\nschlueppaxXD: i goinf afk\r\nschlueppaxXD: holycrab\r\nschlueppaxXD: ?\r\nschlueppaxXD: man\r\nschlueppaxXD: what u think i should do?\r\nschlueppaxXD: ?\r\nschlueppaxXD: :D\r\nschlueppaxXD: wtf\r\nschlueppaxXD: bye\r\nschlueppaxXD: faggot seriously\r\nschlueppaxXD: :D\r\nschlueppaxXD: jo\r\nschlueppaxXD: junge\r\nschlueppaxXD: sie verliert meine lane\r\nschlueppaxXD: 3 blues\r\nschlueppaxXD: 4 ganks\r\nschlueppaxXD: ohne ieine hilfe back xD\r\nschlueppaxXD: ich hatte 3 vison wards\r\nschlueppaxXD: kann die vison auch nicht aufrecht erhalten wenn der jungler andauernd kommt\r\nschlueppaxXD: faggot\r\nschlueppaxXD: idc\r\nschlueppaxXD: never loose mid control\r\nschlueppaxXD: ist einfach dumm\r\nschlueppaxXD: 4v1^^\r\nschlueppaxXD: idc\r\nschlueppaxXD: ich selbst\r\nschlueppaxXD: xD\r\nschlueppaxXD: Ich sag auch nicht das er schuld ist das ich sterbe\r\nschlueppaxXD: aber glaubst du allen ernstes\r\nschlueppaxXD: :D ja\r\nschlueppaxXD: in dem du nicht auch aushilfst\r\nschlueppaxXD: junge stay in gol\r\nschlueppaxXD: easiest fucking gank\r\nschlueppaxXD: inmobil wie schie&szlig;e\r\nschlueppaxXD: ^^\r\nschlueppaxXD: So und was mache ich dagegen?\r\nschlueppaxXD: du genie\r\nschlueppaxXD: wenigstens diene ich noch als bait\r\nschlueppaxXD: Ist einfach dumm\r\nschlueppaxXD: ich hatte meine Lane gewonnen\r\nschlueppaxXD: neiin\r\nschlueppaxXD: soviel zu gewonnen\r\nschlueppaxXD: xD\r\nschlueppaxXD: Sicher^^\r\nschlueppaxXD: Es lag nicht daran das der Twisted &uuml;berall sein konnte\r\n\r\nIch bestreite nicht das ich daf&uuml;r aufjedenfall eine Strafe verdient habe und mich in diesem so wie auch in dem anderen Spiel ziemlich daneben benommen habe.\r\n\r\nMit der Phrase &quot;Faggot&quot; die ich in beiden Spielen benutzt habe, war mir eigentlich gar nicht wirklich klar was ich ausdr&uuml;cke.\r\nIch w&uuml;rde es ein Bisschen mit den Ausdr&uuml;cken Kurwa oder Cyka Blyat in CS-Go vergleichen.\r\nIch sage nicht das Unwissenheit vor Strafe sch&uuml;tzt, jedoch finde ich einen permanenten Bann etwas &uuml;berzogen.\r\n\r\nIch kann verstehen das damit die Community nur zu einem Besseren gef&uuml;hrt werden soll.\r\nWas ich auch sehr Wert sch&auml;tze, da mir im Grunde die Community auch wenn man es jetzt hier jetzt nicht gleich rauslesen kann sehr am Herzen liegt.\r\n\r\nJedoch muss ich leider sagen, dass ich mich absolut ungerecht behandelt und sehr hilflos in diesem Thema f&uuml;hle.\r\nIch kann nicht glauben zu den 0.006% sich am schlechtesten benehmenden League of Legends-Spieler zu geh&ouml;ren.\r\nUnd das 2 Spiele bei &uuml;ber 1000 Spielen so ins Gewicht fallen sollen.\r\n\r\nIch habe deshalb um eine detailierte Begr&uuml;ndung und Stellungsnahme gebeten. \r\nDie mir aber leider immer wieder verwehrt wurde.\r\nLeider habe ich den Text des vorangegangenen Spiels nicht mehr um Ihn auch hier zu posten.\r\nDesweiteren, habe ich auch nur eine Email bekommen &uuml;ber R&uuml;ckmeldungen auf meine Supportanfrage und nicht zwecks des Permanenten Bannes.\r\n\r\nEs tut mir sehr Leid mich aus verschiedenen Gr&uuml;nden so sehr daneben benommen zu haben.\r\nWas mein Verhalten nat&uuml;rlich nicht entschuldigt.\r\nLeider konnte ich mich auch nicht direkt bei den betroffenen Personen entschuldigen, da ich jeweils nach dem Spiel direkt gesperrt war.\r\n\r\nMeine Frage, ist dieser Bann unter diesen Umst&auml;nden tats&auml;chlich gerechtfertigt?\r\nUnd wenn Ja, habe ich keine Chance eine genauere Begr&uuml;ndung daf&uuml;r zu erhalten?\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\n\r\nschlueppaxXD","replies":[{"poster":"Darkr3sQ","date":"2017-05-26T15:18:22.353+0000","up_votes":6,"down_votes":0,"body":"Als Begründung für den Bann hattest Du ja die Chatverläufe erhalten.\nFaggot ist nun einmal ein Begriff, der Homophob (ich nenne es eher Schwulenfeindlich) ist. RIOT greift bei solchen Sachen - Homophob, rassistisch, extrem Toxisch - sehr hart durch. Da ist dann der Beginn der 14 Tagesbann. Und dabei ist es für RIOT unerheblich, ob Du weißt was etwas bedeutet oder nicht. Wenn Du nicht die Bedeutung von einem Wort kennst, benutze es einfach nicht.\nIn der Nachricht im Client zum 14 Tagesbann wurde Dir eindeutig mitgeteilt, dass weiteres Fehlverhalten - hier ist dann die Härte des Vergehens eigentlich irrelevant - zu einer Permanenten Sperrung führt. Du warst weiter toxisch und hast nun die Quittung bekommen.\nDer Grund, weswegen Folgebanns so schnell verteilt werden ist, dass mit einem Bann dein \"Ruf\" auf 0 gesetzt wird. Du hast also 0 positive und 0 negative Spiele für die Chatanalyse. Jetzt wanderst Du natürlich deutlich schneller über die Reportschwelle, da bei z.B. 2 gespielten Spielen, ein Report in einem Spiel  gleich mal eine Reportquote von 50 % ausmacht. Demzufolge wird geprüft und wenn Fehlverhalten - was bei Dir unzweifelhaft vorhanden ist - festgestellt wird, wird die nächste Strafstufe ausgesprochen. Bei Dir war das nun mal der Perma.","replies":[{"poster":"TheGratefulDead","date":"2017-06-01T04:48:23.875+0000","up_votes":1,"down_votes":0,"body":"Ein Faggot ist ein Blasinstrument, nicht? Und glaube auch eine Ansammlung von Stöcken, wie ich als Kind immer gehört habe.\n{{champion:36}} Me smart.","replies":[]},{"poster":"schlueppaxXD","date":"2017-05-26T15:37:23.714+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=R3sQ,realm=EUW,application-id=KYnfKGf0,discussion-id=gyIKBXpL,comment-id=0004,timestamp=2017-05-26T15:18:22.353+0000)\n>\n> Als Begründung für den Bann hattest Du ja die Chatverläufe erhalten.\n> Faggot ist nun einmal ein Begriff, der Homophob (ich nenne es eher Schwulenfeindlich) ist. RIOT greift bei solchen Sachen - Homophob, rassistisch, extrem Toxisch - sehr hart durch. Da ist dann der Beginn der 14 Tagesbann. Und dabei ist es für RIOT unerheblich, ob Du weißt was etwas bedeutet oder nicht. Wenn Du nicht die Bedeutung von einem Wort kennst, benutze es einfach nicht.\n> In der Nachricht im Client zum 14 Tagesbann wurde Dir eindeutig mitgeteilt, dass weiteres Fehlverhalten - hier ist dann die Härte des Vergehens eigentlich irrelevant - zu einer Permanenten Sperrung führt. Du warst weiter toxisch und hast nun die Quittung bekommen.\n> Der Grund, weswegen Folgebanns so schnell verteilt werden ist, dass mit einem Bann dein &quot;Ruf&quot; auf 0 gesetzt wird. Du hast also 0 positive und 0 negative Spiele für die Chatanalyse. Jetzt wanderst Du natürlich deutlich schneller über die Reportschwelle, da bei z.B. 2 gespielten Spielen, ein Report in einem Spiel  gleich mal eine Reportquote von 50 % ausmacht. Demzufolge wird geprüft und wenn Fehlverhalten - was bei Dir unzweifelhaft vorhanden ist - festgestellt wird, wird die nächste Strafstufe ausgesprochen. Bei Dir war das nun mal der Perma.\n\nDas ist so nicht richtig Faggot kann genauso gut Schweißpaket bedeuten.\nUnd ich wollte den Jenigen nicht aufs übelste beleidigen.\n\nWas mir wie schon gesagt sehr Leid tut. \nLeider hatte ich auch nicht die Möglichkeit mich zu entschuldigen.\n\nAlso deiner Meinung nach ist es mit diesen 2 Aussetzern getan?\nIch war wirklich sehr frustriert an diesen beiden Tagen und habe dadurch, wie du auch schon geschrieben hast, absolut nicht nachgedacht.\n\nTrotzdem bin ich sehr traurig das ich dadurch als einer der schlechtesten Menschen in League of Legends dargestellt werde.\n\nWas ich eher schlimmer finde als den Bann an sich :(","replies":[{"poster":"Darkr3sQ","date":"2017-05-26T22:34:20.801+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=schlueppaxXD,realm=EUW,application-id=KYnfKGf0,discussion-id=gyIKBXpL,comment-id=00040000,timestamp=2017-05-26T15:37:23.714+0000)\n>\n> Das ist so nicht richtig Faggot kann genauso gut Schweißpaket bedeuten.\n> Und ich wollte den Jenigen nicht aufs übelste beleidigen.\n> \n> Was mir wie schon gesagt sehr Leid tut. \n> Leider hatte ich auch nicht die Möglichkeit mich zu entschuldigen.\n> \n> Also deiner Meinung nach ist es mit diesen 2 Aussetzern getan?\n> Ich war wirklich sehr frustriert an diesen beiden Tagen und habe dadurch, wie du auch schon geschrieben hast, absolut nicht nachgedacht.\n> \n> Trotzdem bin ich sehr traurig das ich dadurch als einer der schlechtesten Menschen in League of Legends dargestellt werde.\n> \n> Was ich eher schlimmer finde als den Bann an sich :(\n\nAbsolut technisch gesehen kann es auch Reisigbündel, Frikadelle aus Innereien oder Reisbündel heißen. Oder Du hast das Instrument Fagott falsch geschrieben.\nViele eher ist es aber, dass damit Schwuler, Schwuchtel, Tunte oder warmer Bruder gemeint war. Denn mal ganz ehrlich: Als Du Faggot schriebst, hattest Du die Intention, den Empfänger zu beleidigen. Und das geht nun einmal nicht mit den erstgenannten Begriffen. \nFakt ist: Faggot ist Schwulenfeindlich, und hier fährt RIOT eine ganz klare Linie. Hier beginnt es mit einem 14 Tagesbann oder in ganz extremen Fällen mit einem Perma. Und Aussetzer hin oder her. Du hast ganz klar, und mit dem von Dir gewählten Ausdruck sogar deutlich, gegen die von Dir akzeptierten Nutzungsbedingungen verstoßen. RIOT hat Dir mit dem 14 Tagesbann einen Schuss vor den Bug gesetzt, den Du offenbar nicht ernst genommen hast. Von daher: Ja, in einem extremen Fall - und Schwulenfeindlich, ob unwissentlich oder nicht, gehört dazu - ist es mit zwei Aussetzern getan.\nUnd ganz ehrlich: Auch wenn Du Dich im Nachhinein bei der Person entschuldigst, macht es den Schaden nicht wieder gut. Es ist zwar eine nett gemeinte Geste von Dir, aber trotzdem sollte man, bevor man etwas ausspricht, sich der Auswirkung bewusst sein.\nWenn Du an den Tagen selber merkst, dass Du sehr frustriert bist, weshalb spielst Du dann ein kompetitives Spiel, bei dem Du davon ausgehen musst dass Deine Mitspieler und Du Fehler machen? Das nächste mal, wenn Du merkst dass Du frustriert bist, solltest Du dann eventuell ein Spiel spielen, bei dem Du nicht auf andere Spieler angewiesen bist.","replies":[]}]}]},{"poster":"ΔRC RΔFUNZΞL","date":"2017-05-26T15:05:42.809+0000","up_votes":3,"down_votes":0,"body":"also homophobie ist eine der wenigen sachen die zum instant 2wochen/permabann führt du hast des öfteren \"faggot\" benutzt ich denke mal beim 2 wochen ban war es das gleiche als ist der ban verdient","replies":[]},{"poster":"Nycaria","date":"2017-05-26T14:14:19.577+0000","up_votes":3,"down_votes":0,"body":"Du hattest davor schon den 2 Wochen Bann und schreibst trotzdem noch ohne deinen Kopf zu benutzen? Sorry selbst schuld^^ Es sollte jeden bewusst sein,dass nach dem 2 Wochen Bann nach jedem noch so kleinen Flame der Perma folgen kann.","replies":[{"poster":"schlueppaxXD","date":"2017-05-26T14:54:10.825+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Keep the Control,realm=EUW,application-id=KYnfKGf0,discussion-id=gyIKBXpL,comment-id=0000,timestamp=2017-05-26T14:14:19.577+0000)\n>\n> Du hattest davor schon den 2 Wochen Bann und schreibst trotzdem noch ohne deinen Kopf zu benutzen? Sorry selbst schuld^^ Es sollte jeden bewusst sein,dass nach dem 2 Wochen Bann nach jedem noch so kleinen Flame der Perma folgen kann.\n\nMit dieser Antwort beantwortest du nicht meine 2te Frage.\n\nIch kann durchaus verstehen, dass man sich gewisse Vorurteile bildet wenn man den Begriff \"Permaban\" oder den obrigen \"Chatausschnitt\" durchliest.\n\nJedoch ist ein abfertigen von Beiträgen und eine vorschnelle Antwort selten die richtige Wahl.","replies":[{"poster":"Meemoy","date":"2017-06-01T05:51:58.963+0000","up_votes":1,"down_votes":0,"body":"Du hast geflamed und wurdest dafür gebannt. Unabhängig von dem Wort Faggot ist fast dein ganzer Chatverlauf toxisch gegen deinen Jungler. Da du vorbestraft bist, geht es dann sehr schnell.","replies":[]}]}]},{"poster":"Der Großmugister","date":"2017-05-27T22:20:19.873+0000","up_votes":2,"down_votes":1,"body":"Du bist kein schlechter Mensch! Jedenfalls gehe ich, auf Grund dessen, was ich hier gesehen habe, nicht davon aus.\nIch glaube zwar, dass du sehr wohl wusstest, dass \"Faggot\" soviel wie \"Schwuchtel\" heißt, wieso solche Beleidigungen aber so fatal für die gesamte Gesellschaft sind, wissen die wenigsten.\n(Hier habe ich das mal versucht zu formulieren, falls es dich interessiert: https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/EI52Rtno-fk-this-system?comment=0005 )\n\nBei Statistiken muss man sich immer fragen, was wollte die Person, die sie erheben ließ beweisen? In Riots Fall kann man wohl davon ausgehen, dass man zeigen wollte, dass die Community in Wahrheit nicht so übel ist wie ihr Ruf.\nDementsprechend wurden die Daten auch sicher auf dieses Ziel hin beschafft. Wie wurden sie also berechnet? Wahrscheinlich hat man jeden, jemals erstellten Account - egal wie weit er bespielt wurde - ins Verhältnis zu solchen gesetzt, die, auf Grund von Flame, permanent gebannt wurden.\nWenn man an die ganzen Accounts denkt, die auf Lvl 2 vor sich hinmodern, kommt da bestimmt eine erhebliche Masse zusammen.\n\nZusätzlich dazu, kommt es mir so vor, als würde Riot erst seit ein paar Wochen oder Monaten, so hart gegen Schwulenfeindlichkeit vorgehen, bei Fehlverhalten, mit dem man keiner Minderheit schadet, werden bestimmt noch immer 80 Augen zugedrückt, bevor es mal die erste Strafe gibt.\n\nDu gehörst also sicher nicht zu den 0,0wasweißich06 schlimmsten Prozent der Community, du gehörst zu den schlimmsten 20 Prozent der aktiven Level 30er Accounts, denn egal wie sehr man es sich schön zu reden versucht, im Durchschnitt hat man immer einen Spieler im Team, der sich, auf welche Art auch immer, daneben benimmt. Ist man selber auch negativ, erhöht sich diese Zahl sogar noch weiter.\n\nDas war der - hoffentlich - aufmunternde Teil.\nFakt bleibt auch, dass du toxisch warst! Du hast nicht nur deinen Mitspielern geschadet, sondern auch - in einem winzigen Maßstab - allen Homosexuellen.\n\nDa du dich aber eindeutig dafür schämst, dass du zu dieser Art Mensch gehör(s)t (hast), bin ich mir sicher, dass du es schaffst dich zu ändern. Das bringt dir zwar deinen Account nicht zurück, hilft dir aber der Mensch zu werden, der du wahrscheinlich sein möchtest.\nBeobachte dich weiter, denke immer, wenn du jemanden beleidigen willst, an das Gefühl zurück was du hattest, als du die Meldung zum Permabann gelesen hast, dann wirst du es sicher schaffen, dich langfrstig zu ändern und dich nicht nochmal einer negativen Umgebung anzupassen.\nSollte das passieren, war dein Account ein geringer Preis für diesen Wandel.","replies":[]},{"poster":"Martensitic","date":"2017-05-29T18:57:53.407+0000","up_votes":1,"down_votes":0,"body":">Ich sage nicht das Unwissenheit vor Strafe schützt, jedoch finde ich einen permanenten Bann etwas überzogen.\n\nWas du überzogen findest und was nicht, ist in diesem Zusammenhang völlig irrelevant.\n\nEs heisst nicht ohne Grund \"Strafe\" und nicht \"Wunschbuffet\".\n\nHier gelten die Regeln die der Betreiber aufgestellt hat.\nEine dieser Regeln lautet: Ausdrücke wie \"Faggot\" führen zu sofortiger Eskalation des Punishments auf 14day ban -> Permaban.\n\nOb diese Regeln einzelnen in den Kram passen oder nicht, kann sowohl Riot als auch der Community egal sein.","replies":[]},{"poster":"schlueppaxXD","date":"2017-05-28T08:43:53.354+0000","up_votes":1,"down_votes":1,"body":"Mittlerweile muss ich auch sagen das dieser Bann föllig Gerechtfertigt ist ich hab den 2 Chatlog erhalten der zu der 2 Wochensperre geführt hat.\nAuch wenn ich das Ganze nicht selbst geschrieben habe sondern ein Freund von mir bin ich doch verantwortlich was auf meinem Konto passiert.\nUnd jedem ist sicherlich auch bekannt das Accountsharing eigentlich verboten ist.\n\nSchade finde ich nur das ich keine Email-Benachrichtung bekam und das Ganze nicht schneller regeln konnte und somit einen permanenten Bann verhindern hätte können.\nNaja war zwar mein 2.Acc aber trotzdem sehr schade darum.\n\nAber Genugtuung dürfte wenigstens sein, dass sich die Community hoffentlich bald bessert und Riot auch in Zukunft bei Anderen Delikten härter durchsteigt.\n\nIch bedanke mich für eure Aufschlussreichen Beiträge und Antworten und wünsche euch weiterhin viel Spaß bei League of Legends.\n\nMit freundlichen Grüßen\n\nschlueppaxXD","replies":[{"poster":"clair de lune289","date":"2017-05-28T12:41:40.329+0000","up_votes":1,"down_votes":0,"body":"selbst wenn du nicht wegen Flame gebannt worden wärst,wäre dein Acc jetzt dennoch weg.\nAccsharing ist verboten und wird mit Perma bestraft.","replies":[]}]},{"poster":"Revilous","date":"2017-05-27T19:35:18.968+0000","up_votes":1,"down_votes":0,"body":"Nach nem 2 Wochen Bann musst du halt jedes Spiel dich fragen, was in deinem Chatlog drinne stehen wird, falls du gepermabannt wirst. Wenn du nur \"gl hf, gj, gj, gj ,wp, ggwp\" schreibst, wirst du sicher keine Permabannnachricht bekommen mit diesem Chatlog^^\n\nJetzt ist es natürlich zu spät. Deinen Account wirst du 100% nicht wieder bekommen aber wenn du das Spiel liebst dann kannst du dir einen Neuen erstellen und dich versuchen zu verbessern.\n\nDein Bann ist komplett gerechtfertigt, wegen \"faggot\". Die meisten Gepermabannten wurden übrigens gepermabannt wegen \"fag\" oder \"faggot\" nehme ich an, da ich in viele Chatlogs hier im Forum sowas lese. Du wirst vom Support keine tollen Antworten bekommen, da sie viele Anfragen wegen Permabanns bekommen und diese einfach direkt abhacken. Permabanns werden wie gesagt nie aufgehoben. Du bekommst schon eher ein längeres Gespräch mit einem freundlichen Supportmitarbeiter, wenn du 5 RP haben willst.^^","replies":[{"poster":"clair de lune289","date":"2017-05-28T12:38:53.562+0000","up_votes":1,"down_votes":0,"body":"und je nach Laune des Mitarbeiters und Freundlichkeit deiner Anfrage hat das sogar eine bedeuten höhere Chance auf Erfolg.\nWobei ich mir das,da wir jetzt das hextecsystem haben, nicht mehr ganz so sicher bin.","replies":[]}]},{"poster":"schlueppaxXD","date":"2017-05-27T10:58:22.322+0000","up_votes":1,"down_votes":1,"body":"Ich dachte das es sowas wie Holzkopf heißen würde, was Holzbündel nahe kommen würde. \nLetztendlich ist das auch egal ich sehe schon das ich hier nur auf Abneigung stoße.\n\nAber wenn man Menschen im Internet so abfertigt wie ihr das gerade tut ist man kein bisschen besser als jeder Flamer.\n\nWenn man dieses Wort weglässt ist es zwar immer noch sehr heftig geblamed und geflamed was absolut unangebracht war, was wenn wir aber ehrlich zu uns selbst sind so ziemlich jeder schon einmal geschrieben hat.\n\nUnd was ich mir Tag täglich in diesem Spiel anhören durfte weswegen ich leider auch mal etwas sehr über die Strenge geschlagen habe.","replies":[{"poster":"Sirrkas","date":"2017-05-28T00:17:55.721+0000","up_votes":1,"down_votes":0,"body":">Wenn man dieses Wort weglässt ist es zwar immer noch sehr heftig geblamed und geflamed was absolut unangebracht war, was wenn wir aber ehrlich zu uns selbst sind so ziemlich jeder schon einmal geschrieben hat.\n\nNein. Zum Beispiel habe ich noch nie den Chat genutzt, um zu flamen. Ich verstehe auch nicht so recht, warum man das macht. Klar, da gibt es so ein bisschen Genugtuung, weil man seinen Frust an anderen auslassen kann, aber sinnvoll fand ich das noch nie. Vor allem dann, wenn man so etwas Wildfremden schreibt. Bei Freunden kann man das noch als Scherz ansehen, weil die anderen genau wissen, man schreibt das nur und meint es nicht so. Fremde wissen aber nicht, ob man damit witzig sein will oder beleidigen möchte.","replies":[]},{"poster":"Darkr3sQ","date":"2017-05-27T13:11:19.769+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=schlueppaxXD,realm=EUW,application-id=KYnfKGf0,discussion-id=gyIKBXpL,comment-id=0009,timestamp=2017-05-27T10:58:22.322+0000)\n>\n> Ich dachte das es sowas wie Holzkopf heißen würde, was Holzbündel nahe kommen würde. \n> Letztendlich ist das auch egal ich sehe schon das ich hier nur auf Abneigung stoße.\n> \n> Aber wenn man Menschen im Internet so abfertigt wie ihr das gerade tut ist man kein bisschen besser als jeder Flamer.\n> \n> Wenn man dieses Wort weglässt ist es zwar immer noch sehr heftig geblamed und geflamed was absolut unangebracht war, was wenn wir aber ehrlich zu uns selbst sind so ziemlich jeder schon einmal geschrieben hat.\n> \n> Und was ich mir Tag täglich in diesem Spiel anhören durfte weswegen ich leider auch mal etwas sehr über die Strenge geschlagen habe.\n\nEs hat nichts mit abfertigen zu tun. Wir bewerten anhand Deines Chatlogs. Und was im Chatlog steht, hast Du nunmal geschrieben.\nUnd wo stößt Du auf Abneigung? Wir haben nun einmal eine andere Meinung bezüglich Deiner Bestrafung als Du. Es wird Dir sogar noch geschrieben, weshalb wir anderer Meinung sind als Du. Das nennt sich Diskutieren. Für so etwas - wenn es nicht ausfallend wird - ist ein Forum da.\nUnd bei einem Ausdruck - vor allem in einer anderen Sprache als der Muttersprache - mache ich mir doch zumindest mal die Mühe und Google kurz danach, was es bedeutet, bevor ich es einfach blind nachmache.\n\nUnd ob Du es glaubst oder nicht: Wenn mich jemand \"genervt\" hat, habe ich ihn schlicht und ergreifend ignoriert und nach dem Spiel stillschweigend reportet. Darauf eingehen bringt keinem was. Im Gegenteil: Es lenkt Dich von Deinem Spiel ab und schaukelt die Situation nur hoch.\n\nUnd zu Deinem letzten Satz:\nIch lese und höre jeden Tag so viel über Einbrüche und andere Verbrechen. Da ist es dann doch nur logisch, dass ich auch über die Strenge schlage.\nNur weil es dir anderen machen, macht es das nicht gleich richtig. In so einer Situation hilft es Dir ungemein, die Person stillschweigend zu muten, und gar nicht darauf einzusteigen. Das ärgert den Flamer deutlich mehr, da er nicht sein Ziel Dich zu triggern erreicht.","replies":[]}]},{"poster":"schlueppaxXD","date":"2017-05-27T14:46:40.538+0000","up_votes":1,"down_votes":1,"body":"Was will ich damit sagen, selbst wenn ich mir jetzt einen neuen Acc mache und damit spiele und dort die Friendlyflag bekomme, würde ich dieses Recht nicht zurück bekommen.\nObwohl das doch eigentlich eindeutig beweisen würde das ich mich gebessert habe oder nicht?","replies":[{"poster":"hshtagniemehrcdu","date":"2017-05-27T17:55:28.297+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=schlueppaxXD,realm=EUW,application-id=KYnfKGf0,discussion-id=gyIKBXpL,comment-id=000b,timestamp=2017-05-27T14:46:40.538+0000)\n>\n> Was will ich damit sagen, selbst wenn ich mir jetzt einen neuen Acc mache und damit spiele und dort die Friendlyflag bekomme, würde ich dieses Recht nicht zurück bekommen.\n> Obwohl das doch eigentlich eindeutig beweisen würde das ich mich gebessert habe oder nicht?\n\nDas Problem ist, dass sich der weitaus größte Teil der Leute, die einen Perma erhalten, nicht bessern.\nDa hat Riot mal ein Experiment gemacht...\nAlso wollen sie nicht, dass die Permanent gebannten neue Accounts erstellen.\nUm diesen Anrezi möglichst gering zu halten, wirst du den alten Account also nicht mehr wiederbekommen.\n\nNach einem Perma soll man sich nicht mehr \"bessern\", man soll gehen.","replies":[]}]},{"poster":"schlueppaxXD","date":"2017-05-27T14:27:17.710+0000","up_votes":1,"down_votes":0,"body":"Das habe ich damit zwar nicht Ausdrücken wollen, aber zeigt eindeutig wie überzeugt du von der Bewertung eines Menschen über einen Chatlog bist.\n\nIch habe nie gesagt das es in irgendeiner Weise richtig war was ich getan habe.\nIch habe lediglich gesagt, dass dann eigentlich schon um einiges mehr Leute permanent gebannt werden hätten müssen.\nUnd ich somit einen permanenten Bann nicht nachvollziehen kann.\n\nWäre dies von Riot schon immer so gehandhabt worden, hätte ich damit kein Problem.\n\nIch hab auch kein Problem damit, dass man mir das Recht nimmt das Konto zu benutzen.\nAber wenn man mir dieses Recht nimmt dann mit den richtigen Aussagen.\nIch habe gesagt ich bezweifle zu den 0.006% zu gehören.\nWomit die Aussage warum man dieses Recht entzieht, nichtig ist.\n\n--> Hätten wir gar kein Grund zu diskutieren und das Spiel wäre auch um einiges weniger Cancer im Chat, wofür ich absolut auch bin :)","replies":[]},{"poster":"Sirrkas","date":"2017-05-26T23:11:45.659+0000","up_votes":1,"down_votes":0,"body":">Ich bestreite nicht das ich dafür aufjedenfall eine Strafe verdient habe und mich in diesem so wie auch in dem anderen Spiel ziemlich daneben benommen habe.\n\nNach einem 2 Wochenbann bedeutet das einen Permabann.\n\n>Mit der Phrase \"Faggot\" die ich in beiden Spielen benutzt habe, war mir eigentlich gar nicht wirklich klar was ich ausdrücke.\n\nHier trifft dann wohl \"Unwissenheit schützt vor Strafe nicht\" zu. \n\n>Ich sage nicht das Unwissenheit vor Strafe schützt, jedoch finde ich einen permanenten Bann etwas überzogen.\n\nDu hattest bereits einen 2 Wochenbann und trotzdem geblamt, scheinbar gedroht afk zu gehen und beleidigt. Was hättest du denn verteilt, wenn der nicht hilft? Nochmal 2 Wochen bannen?\n\n>Leider habe ich den Text des vorangegangenen Spiels nicht mehr um Ihn auch hier zu posten.\n\nKann es sein, dass du in dem anderen Spiel auch oft \"Faggot\" verwendet hast? Das gilt als Homophobie und deshalb ist da ein 2 Wochenbann ohne Vorstrafen möglich. \n\n>Meine Frage, ist dieser Bann unter diesen Umständen tatsächlich gerechtfertigt?\nUnd wenn Ja, habe ich keine Chance eine genauere Begründung dafür zu erhalten?\n\nBerechtigt ist er, ja.\nDas mit der Begründung, das hängt davon ab, was du dir darunter vorstellst.","replies":[]},{"poster":"Abasin","date":"2017-05-26T21:02:37.126+0000","up_votes":1,"down_votes":0,"body":"> Mit der Phrase \"Faggot\" die ich in beiden Spielen benutzt habe, war mir eigentlich gar nicht wirklich klar was ich ausdrücke.\n\nNatürlich nicht. Ist ja nicht so, dass man so etwas nachschlagen kann. Ist auch nicht so, dass wir alle hier auf so eine blödsinnige Ausrede nicht reinfallen.","replies":[]},{"poster":"Wernicke","date":"2017-05-26T16:35:42.483+0000","up_votes":1,"down_votes":0,"body":"Vlt hier auch noch mal:\nEs ist etwas suboptimal dich hier ans forum zu wenden wo Spieler wie du und ich sind und eben keine Riot MA. Denn es ist so, dass Riot nur ausführende Kraft ist und das ausführt was von der community angestoßen wird. Die community hat dich reported um Riot damit zu zeigen das sie dich nicht mehr in ihren Reihen haben möchte.\n\nNaja, davon mal ganz abgesehen wurde dir ja schon viel erläutert bezüglich faggot usw und das man mit bestimmten Dingen Strafstufen überspringen kann. \nMan sollte halt nicht alles blind nachplappern was andere halbstarke im anonymen Inet ablassen ^^","replies":[{"poster":"schlueppaxXD","date":"2017-05-26T16:46:37.091+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wernicke,realm=EUW,application-id=KYnfKGf0,discussion-id=gyIKBXpL,comment-id=0006,timestamp=2017-05-26T16:35:42.483+0000)\n>\n> Vlt hier auch noch mal:\n> Es ist etwas suboptimal dich hier ans forum zu wenden wo Spieler wie du und ich sind und eben keine Riot MA. Denn es ist so, dass Riot nur ausführende Kraft ist und das ausführt was von der community angestoßen wird. Die community hat dich reported um Riot damit zu zeigen das sie dich nicht mehr in ihren Reihen haben möchte.\n> \n> Naja, davon mal ganz abgesehen wurde dir ja schon viel erläutert bezüglich faggot usw und das man mit bestimmten Dingen Strafstufen überspringen kann. \n> Man sollte halt nicht alles blind nachplappern was andere halbstarke im anonymen Inet ablassen ^^\n\nDiese Lektion musste ich wohl auf die harte Tur lernen :/\nAber mein Vater hat immer schon gesagt so lernt man am Besten...","replies":[{"poster":"Wernicke","date":"2017-05-26T16:49:51.648+0000","up_votes":1,"down_votes":0,"body":"Naja, so lange du das ernst meinst und das wirklich einsiehst, kannste dir ja einen neuen Acc erstellen und zeigen das du auch anders kannst :)\nIch meine, auf 30 lvln ist jetzt auch kein Weltuntergang, und der ein oder andere Skin wird bestimmt auch im Laufe der Zeit wieder dazu kommen. iwo schade um den alten Acc, falls du viele Skins usw hattest, aber ja, das ist jetzt nun mal so.","replies":[{"poster":"schlueppaxXD","date":"2017-05-26T17:02:22.271+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wernicke,realm=EUW,application-id=KYnfKGf0,discussion-id=gyIKBXpL,comment-id=000600000000,timestamp=2017-05-26T16:49:51.648+0000)\n>\n> Naja, so lange du das ernst meinst und das wirklich einsiehst, kannste dir ja einen neuen Acc erstellen und zeigen das du auch anders kannst :)\n> Ich meine, auf 30 lvln ist jetzt auch kein Weltuntergang, und der ein oder andere Skin wird bestimmt auch im Laufe der Zeit wieder dazu kommen. iwo schade um den alten Acc, falls du viele Skins usw hattest, aber ja, das ist jetzt nun mal so.\n\nDu hast dir das Ganze wohl nicht so genau durchgelesen :)\nIch hab bereits einen 2.Acc.\nEs ging mir viel mehr darum wie schnell man als schlechter Mensch gilt. \nUnd das man eigentlich als Spieler absolut machtlos ist...\n\nKlar kann man jetzt sagen hätte, Wette, Fahrradkette...und klar kann man im Internet das Ganze auch schwer beurteilen.\n\nJedoch sehe ich mich immernoch nicht als einen typischen Flamer oder einen schlechten Menschen, was für mich ziemlich gleichzusetzen ist wenn die Folge ein Permabann ist. \nZumindest sehe ich die Bestrafung in dieser Rangordnung an.\nUnd wenn tatsächlich ein Bann so schnell geschieht und Gerechtfertigt ist, verwundert es mich das die Prozentzahl immernoch bei 0.006 liegt.\n\nAlso ich bin schon irgendwo sehr enttäuscht, klar in erster Linie von mir selbst, aber auch irgendwo von dem Mitgefühl des Supports oder der Community. \n\nTja, das Leben ist kein Ponnyhof mit dieser Schmach muss ich jetzt wohl leben.","replies":[{"poster":"Wernicke","date":"2017-05-26T17:35:33.462+0000","up_votes":1,"down_votes":0,"body":"Naja, soll Riot jetzt jeden Fall individuell behandeln? Das geht einfach nicht. Man stelle sich nur mal vor mit wievielen Fällen Riot es tagtäglich zu tun hat.\nIwo MUß Riot eine Grenze setzen. Sie MÜSSEN  Strafstufen setzen. Ohne ein einheitliches System, wäre das eine Arbeit die man sich gar nicht vorstellen möchte. \nRiot hat sich eben dafür entschieden bestimmte Inhalte stärker zu betrafen, dazu gehört nun mal z.B. Homophobie. Und das Riot das macht, finde ich ehrlich gesagt auch gut so. \nWenn du mich fragst, sollte Riot gleich eine Strafe aussprechen sobald man auch nur ein mal Noob sagt^^ Aber da bin ich eben bisschen extrem und das tut jetzt auch nix zur Sache ;)\n\nIch glaub dir, dass du im real life anders bist. Das ändert aber eben nix daran wie du dich im Inet gibst. Und im Inet bist oder warst du eine Drecksau ;) und wirst mit anderen negativen Spielern deines Kalibers gleich gesetzt.\nRiot sieht sowieo nur das was du im Inet machst und schreibst, und können auch nur das bewerten.\n\nRiot verteilt ja im normalfall auch nicht sofort permas, es gibt immer Vorwarnungen in Form von anderen Bestrafungen. Generell setzt Riot immer mehr darauf Spieler nicht geich zu bannen sondern geben ihnen chance sich zu bessern.\nDas ist z.B was, was mir sauer aufstößt, da ich wie oben schon gesagt sehr für härtere Strafen bin. Riot aber nicht!\nNur bei besonderen Härtefällen, und ein solcher warst du leider. Auch wenn dir nicht bewusst war as du geschrieben hast. Wie gesagt sieht Riot nur das was du geschrieben hast und nicht was du dir dabei denkst oder eben auch nicht denkst oder ob du weißt was das bedeutet usw... \n\nUnd Mitgefühl der community?\nNun es ist ja so, das Riot eigentl nur ausführende Kraft ist. Die community ist es die die dich nicht mehr in ihren Reiehn haben wollte und nicht mehr mit dir spielen wollte. Das haben sie Riot mit ihren reports klar gemacht und Riot musste dementsprechend handeln. \n\nUnd ob das mit der angegeben Prozentzahl alles so stimmt lasse ich auch mal so dahin gestellt. Ich weiß das Riot das angibt, aber ich glaube nicht das diese Zahl stimmt  ;)","replies":[]},{"poster":"Shadir","date":"2017-05-27T07:08:20.625+0000","up_votes":1,"down_votes":2,"body":"Du bist ja auch ein schlechter Mensch, ein Flamer.","replies":[]}]}]}]}]},{"poster":"Mornexa","date":"2017-05-26T15:48:49.669+0000","up_votes":1,"down_votes":0,"body":"Unwissenheit schützt vor Strafe nicht.\nDer Bann ist berechtigt, nach dem 14 Tage bann hättest du dich informieren müssen.\nJetzt nach dem perma ist es leider zu spät, der Bann bleibt permanent da ist Riot eisern.\n\nDir bleibt nichts übrig als daraus zu lernen und evtl einen neuen Acount zu erstellen.","replies":[{"poster":"schlueppaxXD","date":"2017-05-26T16:19:55.213+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mornexa,realm=EUW,application-id=KYnfKGf0,discussion-id=gyIKBXpL,comment-id=0005,timestamp=2017-05-26T15:48:49.669+0000)\n>\n> Unwissenheit schützt vor Strafe nicht.\n> Der Bann ist berechtigt, nach dem 14 Tage bann hättest du dich informieren müssen.\n> Jetzt nach dem perma ist es leider zu spät, der Bann bleibt permanent da ist Riot eisern.\n> \n> Dir bleibt nichts übrig als daraus zu lernen und evtl einen neuen Acount zu erstellen.\n\nHm ich hab noch einen Smurf-Acc mit ca 15.Champs auch dort hatte ich noch nie eine Restriction. \nAber wenigstens weiß ich jetzt genauer was zu der Strafe geführt hat. \nJedoch finde ich 2 Aussetzer trotzallem eine schnelle Bestrafung.\n\nKann aber verstehen das man mir hier genauso wenig entgegenkommen mag nach dem lesen des Chatausschnittes :(\n\nIch kann versichern das ich solch ein Benehmen nie wieder an den Tag legen werde.\n\nMir ging es eigentlich auch viel weniger um den Acc als um den Umgang mit meiner Persönlichkeit und die Tatsache das ich als ein schlechter Mensch dargestellt werde.\n\nEs ist allerdings immer schwer aus dem Internet zu urteilen :(\n\nVllt adden mich die betroffenen Personen ja doch noch auf meinem Smurf und ich kann mich wenigstens bei diesen entschuldigen.","replies":[]}]},{"poster":"rip john shelby","date":"2017-05-26T14:50:09.651+0000","up_votes":1,"down_votes":0,"body":"Eher wurden die Spieler, die von dir beleidigt wurden, ungerecht behandelt als du.","replies":[{"poster":"schlueppaxXD","date":"2017-05-26T14:54:45.182+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shiny Nuffi,realm=EUW,application-id=KYnfKGf0,discussion-id=gyIKBXpL,comment-id=0002,timestamp=2017-05-26T14:50:09.651+0000)\n>\n> Eher wurden die Spieler, die von dir beleidigt wurden, ungerecht behandelt als du.\n\nDas habe ich nicht verneint! Ich habe es sogar bestätigt.","replies":[]}]},{"poster":"schlueppaxXD","date":"2017-05-26T14:24:51.329+0000","up_votes":1,"down_votes":0,"body":"Ich sage ja auch nicht das eine Strafe nicht berechtigt ist, meine Frage war ob der Permabann unter diesen Umständen berechtigt ist.\nUnd ich denke jeder hat mal eine harte Woche oder wird eben auch durch gewisse Umstände im Spiel oder Privat sehr gereizt, natürlich ist es blöd das ich ein sehr impulsiver Mensch bin und meinen Frust hier leider an meinen Mitspielern ausgelassen habe.\n\nZwischen dem Permaban und dem 2 Wochenban lagen über 20 Spiele. \nWas man absolut als wenig Bedrachten kann. \nJedoch lagen zwischen keiner Restriction oder Ähnlichem und dem 2 Wochenbann über 4 Jahre, also ich weiß nicht wie du das so im Verhältnis sehen kannst.\n\nNatürlich ist es einfach über Menschen zu Urteilen wenn man diese nicht persönlich kennt. \nOder man Ähnliches nicht selbst erlebt hat.","replies":[]}]}