{"poster":"CaptainMårvelous","date":"2016-05-03T19:05:25.802+0000","title":"Hey, Riot (And specially @Thermal Kitten)","subforum":"Story, Art, & Sound","embed":{"description":"This is the voice for the new champion Taliyah in English. Voiced by: Erica Lindbeck https://twitter.com/ericalindbeck Note: The Voice might not be final, you never know what tweaks Riot might make to it.","url":"https://www.youtube.com/watch?v=27DZZk5JYIo","image":null},"up_votes":1,"down_votes":0,"body":"(Zenon threw you under the bus. Sorry! D: )\r\n\r\nSo, Taliyah&#039;s VO is cool but...well, lacking. Not in a style sense but in a sheer length sense.\r\n\r\nAs an example: Aurelion&#039;s VO is around 30 (!!!) minutes long. The longest to date.\r\nhttps://www.youtube.com/watch?v=qRRofGLTsv8\r\n\r\nJhin&#039;s VO is just shy of 21 minutes.\r\nhttps://www.youtube.com/watch?v=QwQ3i9L0j74\r\n\r\nAnd so I don&#039;t spam links:\r\nIllaoi VO - 16 minutes.\r\nKindred VO- 18-ish minutes.\r\nTaric VO- 16 minutes\r\n\r\nSo, it feels like League&#039;s finally been getting these longer VOs...and then Taliyah kinda goes back a few minutes. It feels odd. Aren&#039;t we aiming for longer VOs? Was Taliyah&#039;s voice just not meshing well?","replies":[{"poster":"Riot ShadowStorm","date":"2016-05-03T20:57:38.789+0000","up_votes":6,"down_votes":0,"body":"As a few people mentioned already, Taliyah speaks her lines much faster than some of the others (Aurelion Sol in particular). This video is also missing some lines specifically for her launch skin, so there are some more out there. All in all, we recorded a similar number of lines for both her and Aurelion Sol.\n\nThat said, \"more lines with every champ!\" isn't necessarily our goal. We want to use VO to reinforce the character; our pompous space dragon is going to be a bit more wordy, and Taliyah is going a little more, well, down to earth.\n\nOne other thing this video doesn't show is that we have some new _types_ of lines for Taliyah. She has the usual \"taunt an enemy\" lines, but also some different kinds of interactions. Try telling her a joke!","replies":[{"poster":"CaptainMårvelous","date":"2016-05-03T21:13:41.669+0000","up_votes":1,"down_votes":0,"body":"Ah, alright. Thank you for explaining it to me!","replies":[]}]},{"poster":"LordHippoman","date":"2016-05-04T07:08:48.276+0000","up_votes":2,"down_votes":0,"body":"Taliyah seems like she's a lot more direct and to the point with what she says.  Jhin's verbose as hell, and he's really breathy because it sounds like he's adoring the sound of his own voice (Have I mentioned how thematically solid Jhin is?  It's great.)  Same goes for Aurelion Sol.  He's better than these mortals, and he knows it, and he's going to be cocky about it by using a lot of big words.","replies":[]},{"poster":"Beyond Legends","date":"2016-05-03T19:52:09.076+0000","up_votes":1,"down_votes":0,"body":"Well Taliyah talks really really fast. I think she has the amount if line as other champion, but she deliever them faster hence Why her video is shorter.","replies":[]},{"poster":"Embertine","date":"2016-05-03T19:49:45.903+0000","up_votes":1,"down_votes":0,"body":"Well if you pay attention the the pauses between lines in each voice over, you will notice that for Taliyah's the pauses are very short in comparison to the others. This helps speed up the video without cutting anything out.","replies":[]},{"poster":"Pyrodinium","date":"2016-05-03T19:49:06.337+0000","up_votes":1,"down_votes":0,"body":"We will need confirmation on this. A champion or skin not always goes to the PBE with their full voiceover, and the rest of their lines are added on subsequent patches (happened on Mecha Sion most recently, I seem to recall).","replies":[]},{"poster":"Wulf Helhammer","date":"2016-05-03T19:09:27.678+0000","up_votes":1,"down_votes":0,"body":"I noticed that too (although I couldn't tell if he just shortened the time gap between lines). Though it could be because of her release skin, which (supposedly) has a lot more interactions then other recent champions","replies":[]}]}