{"poster":"CaptainMårvelous","date":"2016-10-10T06:41:10.580+0000","title":"@ Riot- Update on the Ban phase/draft changes for Preseason?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"A while ago, Riot talked about the idea of expanding the ban-count as well as implementing a captains/snake style draft. (I don&#039;t have the link but I think it was on reddit or something.)\r\n\r\nI was curious if we could have an update on that. Out of everything, I actually consider any changes made to the pick/ban phase as being one of the most major changes (if not THE most major change) made to League in the game&#039;s history.","replies":[{"poster":"Meddler","date":"2016-10-10T19:15:57.121+0000","up_votes":6,"down_votes":0,"body":"Increased number of bans is something we're still planning to look into after the pre-season. Pick/Ban changes are dependent on the new client, so we'll be looking into them once that's more widely available.","replies":[{"poster":"CaptainMårvelous","date":"2016-10-10T21:00:15.175+0000","up_votes":1,"down_votes":0,"body":"Thanks for the info.\n\nDoes this mean we'd see more bans JUST BEFORE Season 7 or SOMETIME DURING Season 7? I only ask because both situations could have a huge effect on ranked.","replies":[{"poster":"Meddler","date":"2016-10-10T23:42:50.588+0000","up_votes":2,"down_votes":0,"body":"Sometime during next year's season would be most likely. Timing might be a bit different for ranked/normal draft versus tournament play though. We've been talking about whether tournament draft should have somewhat different pick/ban rules to regular draft, given the context's pretty different (in one case you're an organized team who've scouted your opponents, in the other you're usually a group of strangers put together against unknown opponents). If we decided to go for slightly different approaches for each of those two contexts possible they might be released at separate times (each would need to be developed independently, might not make sense to sit on one set of changes until the other's also ready).","replies":[]}]},{"poster":"Venedictos","date":"2016-10-10T21:02:12.698+0000","up_votes":1,"down_votes":0,"body":"How about shifting to a system more akin to Captain's Draft? I'm pretty sure it will work wonders for diversity in pro play and would make P&B a way more strategic experience compared to the current \"ban the most op champs, pick whatever got through and then round out your comp\"","replies":[]}]},{"poster":"Swiftstrike4","date":"2016-10-10T19:33:37.618+0000","up_votes":2,"down_votes":0,"body":"I am pretty excited about additional bans. I am tired having to ban new champions and letting strong champions go through. 10 picks and bans is great with how much the champion pool as expanded. Also giving a ban to each play is really nice.","replies":[]},{"poster":"Tormentula","date":"2016-10-10T21:50:21.651+0000","up_votes":1,"down_votes":0,"body":"I really hope this doesn't extend how long champion select is and the dodge rate from afk banners. It already takes me over 30 minutes just to find and start a normal game on adverage.","replies":[]},{"poster":"Hyperiön","date":"2016-10-10T19:27:41.256+0000","up_votes":1,"down_votes":0,"body":"1 positive thing to come out of getting more bans (potentially)\n\nYasuo will never ever be played, ever again.\n\nTime to delete him!","replies":[{"poster":"Great Muta","date":"2016-10-10T20:54:54.281+0000","up_votes":1,"down_votes":0,"body":"Yep, you'll never see him again.","replies":[]}]}]}