{"poster":"CaptainMårvelous","date":"2018-07-25T15:10:27.526+0000","title":"HOLD UP (From Ryze's Story)","subforum":"Story, Art, & Sound","up_votes":25,"down_votes":1,"body":">Finally, in the **Noxii** territories where Ryze was born, the first cataclysmic blow was struck in what would eventually be known as the Rune Wars.\n\n>The earth fell away beneath them, the bedrock itself seeming to retch and squeal, while the sky above them recoiled as if mortally wounded. They looked back upon the valley where the rival armies had stood, and beheld insanity&mdash;destruction on a scale so massive that it defied all physical sense. The buildings, the people, all were gone, and the ocean, once a day&rsquo;s journey to the east, now rushed to meet them.\n\nhttps://puu.sh/B2STc/9141a09871.png\n\nIs Noxus&#039;s bay the location of the World Rune&#039;s explosion????","replies":[{"poster":"Crimson Anam","date":"2018-07-25T15:19:22.896+0000","up_votes":5,"down_votes":0,"body":"This is an important revelation if true. Can a Rioter possibly chime in?","replies":[{"poster":"Riot Scathlocke","date":"2018-07-25T15:52:38.585+0000","up_votes":31,"down_votes":0,"body":"Wouldn't you rather we gave you such confirmation or denial in cool stories, rather than definitely-not-canon board posts?","replies":[{"poster":"Chromatic Eagle","date":"2018-07-25T17:34:55.313+0000","up_votes":5,"down_votes":0,"body":"Why not both?","replies":[{"poster":"Riot Scathlocke","date":"2018-07-25T18:43:13.103+0000","up_votes":18,"down_votes":0,"body":"That's like giving someone a TL;DR of a newly released movie, then expecting them to be surprised when they watch it.\n\nI approve of trailers, not spoilers! :-P","replies":[{"poster":"DrCyanide","date":"2018-07-25T18:44:52.246+0000","up_votes":5,"down_votes":0,"body":"> I approve of trailers, not spoilers! :-P\n\nThere's a difference anymore?","replies":[{"poster":"Riot Scathlocke","date":"2018-07-25T18:52:16.572+0000","up_votes":17,"down_votes":0,"body":"Well, I must admit the art of making interesting trailers seems to have been abandoned by the movie industry, in favor of social media auto-play clips...\n\nBut, then again, people follow \"recipe hack\" videos and call themselves chefs, so what do I know? [grumble, grumble]","replies":[{"poster":"Frontline Fury","date":"2018-07-26T02:26:00.061+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Scathlocke,realm=NA,application-id=6kFXY1kR,discussion-id=NIBdYtps,comment-id=000200000000000000000000,timestamp=2018-07-25T18:52:16.572+0000)\n>\n> Well, I must admit the art of making interesting trailers seems to have been abandoned by the movie industry, in favor of social media auto-play clips...\n> \n> But, then again, people follow &quot;recipe hack&quot; videos and call themselves chefs, so what do I know? [grumble, grumble]\n\nHaha.\n\nThe future is now old man.","replies":[{"poster":"Riot Scathlocke","date":"2018-07-26T15:51:01.936+0000","up_votes":5,"down_votes":0,"body":"{{sticker:sg-zephyr}}","replies":[]}]}]}]}]}]},{"poster":"kile147","date":"2018-07-25T21:18:11.991+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DrCyanide,realm=NA,application-id=6kFXY1kR,discussion-id=NIBdYtps,comment-id=00010000,timestamp=2018-07-25T15:29:26.440+0000)\n>\n> Adding to that: \n> https://boards.na.leagueoflegends.com/en/c/story-art/h1O2atTN-bioluminescence-i-summon-you-because-of-map?comment=0000\n> \n> Using that as a metric, it&#x27;s about 15 days journey to get from the capital of Noxus to the sea (walking, anyway). &quot;A day&#x27;s journey&quot;, assuming you&#x27;re walking, would be maybe the distance of one of those tiny islands at the mouth of the river. \n\n\nCould you perhaps confirm if the \"1 Day Journey\" Metric is accurate/canon and if the 15 journey measurement based on the map is also accurate?\n\nSo you wouldn't necessarily be confirming or denying the fact itself, just confirming what facts we have been given can be considered canon and what facts can be considered flavor or artistic license.","replies":[{"poster":"Riot Scathlocke","date":"2018-07-26T01:40:37.621+0000","up_votes":7,"down_votes":0,"body":"It's canon when Riot publishes it in a product. That's standard.\n\n(Board posts by Rioters, AMAs, Twitter etc - that stuff is \"soft canon\", weighted depending on how lore-focused said Rioter's role is) :-)\n\nIn this case, Bioluminescence's calculations helped us plot out SOOOOO MUCH of the map. I'd always go to her for a rough idea of distances and such!","replies":[]}]},{"poster":"Robert Smith","date":"2018-07-25T18:25:35.605+0000","up_votes":3,"down_votes":0,"body":"Wait so Graves vaping isn't canon?","replies":[{"poster":"HonestJohnTheCon","date":"2018-07-25T18:52:26.302+0000","up_votes":6,"down_votes":0,"body":"It's canon in the same way that Teemo being Satan is canon.","replies":[]}]},{"poster":"ImaginesTigers","date":"2018-07-26T17:13:08.180+0000","up_votes":2,"down_votes":0,"body":"I think the issue here is that a lot of people just think threads are going to be left dangling forever—there's still so much we don't know about new champions (not even necessarily old ones), and it doesn't always feel like answers are coming. So, people want you to chime in, yeah, because they care about the world, and don't have enough faith that they're going to get answers in the near future.","replies":[{"poster":"Riot Scathlocke","date":"2018-07-26T17:51:17.336+0000","up_votes":3,"down_votes":0,"body":"Well, I'd hope you are all starting to see the New Way Of Doing Things (TM) regarding lore... and that we are actually picking up themes and continuing them from update to update, story to story.\n\nThis is still the first 6 months. Just wait til you see all the cool stuff we're working on right now. :-)\n\n(Also, \"near future\"? What's your rush?) :-P","replies":[{"poster":"Blood Magicks","date":"2018-07-26T18:05:33.024+0000","up_votes":1,"down_votes":0,"body":"As a fan who's seen Riot's lore workings on the inside I have to say this \"New Way\" is what restored my hopes for League from rock bottom to a solidly high level. \n\nPS I finally had the chance to read \"From the Ashes\" (busy week) and I have to say it's my favourite League story in terms of characterisation. \nNot to mention how glad I am we finally have an insight into how magic works.\nI also can't not praise the use of language now that I'm talking about the work. Get the author to write more League!!","replies":[]}]},{"poster":"Chromatic Eagle","date":"2018-07-26T18:15:49.998+0000","up_votes":1,"down_votes":0,"body":"This. Still a bit burnt on the growing pains of the retcons, that we're still in the middle of (Freljord, Bandle City, etc.).","replies":[]}]}]}]},{"poster":"HonestJohnTheCon","date":"2018-07-25T15:15:57.917+0000","up_votes":8,"down_votes":0,"body":"Not that entire area, because that's way more than a day's journey. But I'd wager that at least a part of it is the location of the World Rune's explosion.","replies":[{"poster":"DrCyanide","date":"2018-07-25T15:29:26.440+0000","up_votes":1,"down_votes":0,"body":"Adding to that: \nhttps://boards.na.leagueoflegends.com/en/c/story-art/h1O2atTN-bioluminescence-i-summon-you-because-of-map?comment=0000\n\n> So, if a small military force, marching, were able to take a perfectly direct route from the capital of Noxus to the capital of Demacia, in fair weather, over partially paved roads, then it'd take that small marching force approximately 127 days. Or over 4 months.\n\nUsing that as a metric, it's about 15 days journey to get from the capital of Noxus to the sea (walking, anyway). \"A day's journey\", assuming you're walking, would be maybe the distance of one of those tiny islands at the mouth of the river. \n\nSo if you're looking for a place that *might* fit better, check the inlet next to the mountain on the east. The bay, or \"ocean\" is to the east of it, but there's a small circular cutout that would take roughly \"a day\" to traverse.","replies":[]}]},{"poster":"Loborcs","date":"2018-07-25T15:15:34.424+0000","up_votes":2,"down_votes":1,"body":"It's a possibility.  But I think the explosion was not that big so maybe one of the smaller bays in the coast?","replies":[]},{"poster":"Frontline Fury","date":"2018-07-26T02:28:24.034+0000","up_votes":1,"down_votes":0,"body":"That’s a really good catch. It seems to match up with the surrounding area","replies":[]}]}