{"poster":"CaptainMårvelous","date":"2015-11-27T18:20:16.690+0000","title":"Rapidfire Cannon and Stakkik Shiv have a unique feature.","subforum":"Gameplay","up_votes":74,"down_votes":9,"body":"Compared to other items which share similar effects, they&#039;re the only two items that work in tandem with each other rather than overwrite the other.\n\nAs examples:\n\n* {{item:1402}} {{item:3100}} {{item:3078}} {{item:3025}} Do NOT all stack, as the spellblade effect is unique. **(EDIT: People have corrected me in saying that while the damage doesn't stack, the AoE effects do)**\n* {{item:3074}} {{item:3748}} Do NOT stack, but you&#039;re free to swap between the two.\n* {{item:3068}} {{item:1401}} Do NOT stack, even though the damage effect is different between champions and monsters.\n* {{item:3004}} {{item:3003}} Technically stack but you have to finish one tear before the other can begin stacking.\n* {{item:3060}} {{item:3190}} Do NOT stack unless on different champions.\n* {{item:3056}} {{item:3512}} Do NOT stack\n* {{item:3094}} {{item:3087}} DO stack, get the full effect form both and both charge under one energize effect. (It won't charge faster but it'll combine the two charges)\n\nI know the list of champions who can use both is likely limited to, say, Vayne and Tristana but it&#039;s frustrating that these items don&#039;t have consistency. Can we make the energized effect unique so you have to decide between having long-range poke or wave-clear. If anything else, I&#039;d just do it for the sake of consistence.\n\nWell\n\nWe COULD make it so that all the other effects aren&#039;t unique...","replies":[{"poster":"Void Nargacuga","date":"2015-11-27T18:29:44.216+0000","up_votes":10,"down_votes":1,"body":"Some effects like Spellblade being able to stack could get crazy stupid. Or at least my thoughts on how they calculate damage adding up on say they would.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-27T19:30:58.919+0000","up_votes":16,"down_votes":0,"body":"Actually, they do stack in one sense: the highest damage is dealt. So for example if you stack iceborn and Triforce you'll deal the highest (Triforce) to the main target and the highest (iceborn because it's the only one) to the AoE.","replies":[{"poster":"Void Nargacuga","date":"2015-11-27T19:32:51.299+0000","up_votes":17,"down_votes":1,"body":"That is true. But with {{item:3094}} & {{item:3087}} both of them get the bonus magic damage bonus without overwriting each other at all. I think that is what CaptainMårvelous is trying to say I think.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-27T19:38:24.913+0000","up_votes":4,"down_votes":0,"body":"If we wanted to be consistent with how the others are managed, we'd probably have to make the two stacks synchronous, and have the empowered auto be both longer range and static, but only dealing 100 (and not 200) bonus damage.\nHowever, I'm not certain how much syncing them up would actually side-effect buff, and if the reliability would make up for the damage loss.","replies":[{"poster":"Void Nargacuga","date":"2015-11-27T19:40:27.772+0000","up_votes":1,"down_votes":0,"body":"I haven't tried buying both but I wouldn't be surprised if it gets both bonus effects from Shiv and Cannon sine Energized isn't a unique passive. That kinda scares me now that I think about it... *shudders*","replies":[{"poster":"Kuroi86","date":"2015-11-28T04:36:27.416+0000","up_votes":5,"down_votes":0,"body":"{{item:3094}} {{item:3087}} {{item:3078}} {{item:3031}} {{champion:51}}","replies":[{"poster":"Can U AD See Me","date":"2015-11-28T05:24:42.099+0000","up_votes":6,"down_votes":0,"body":"Someone on cait trap while cait has both of them charged up!! Worse than teemo","replies":[{"poster":"Void Nargacuga","date":"2015-11-28T06:31:34.484+0000","up_votes":1,"down_votes":0,"body":"And then use her net to get ANOTHER guaranteed Head-shot. Followed by her ult... I pity the poor fool..","replies":[]}]},{"poster":"Void Nargacuga","date":"2015-11-28T04:56:48.932+0000","up_votes":5,"down_votes":0,"body":"http://cdn.meme.am/instances/62281003.jpg\n\nSeriously this was BASICALLY my thought when I saw that build.\n\nThough it was: That is horrible! I like it!","replies":[]}]},{"poster":"FrickendaChicken","date":"2015-11-28T19:02:32.962+0000","up_votes":1,"down_votes":0,"body":"The effects just kinda happen. You gain the increased range on the shot, and then the damge goes off and Shiv procs all at once.","replies":[]}]}]}]}]}]},{"poster":"5000000000000000","date":"2015-11-27T18:30:49.798+0000","up_votes":3,"down_votes":5,"body":"Riot already knows this. It was in the patch note when they were released. They didn't do anything about it because they both occupy the same item slot on ADC build (crit/attack speed).\nIt's always Big damage item>Boots>Crit/AS>Lifesteal>%arpen>Defensive.\nTaking two crit/AS items mean that you're giving up something almost necessary in return.","replies":[{"poster":"WalkingInACircle","date":"2015-11-27T19:45:20.240+0000","up_votes":10,"down_votes":3,"body":"{{champion:222}} {{item:3006}} {{item:3031}} {{item:3087}} {{item:3094}} {{item:3508}} {{item:3072}} \n\n\"Defense\"?","replies":[{"poster":"chipndip1","date":"2015-11-27T22:30:06.748+0000","up_votes":2,"down_votes":13,"body":"> [{quoted}](name=WalkingInACircle,realm=NA,application-id=3ErqAdtq,discussion-id=QF0twEPu,comment-id=00020001,timestamp=2015-11-27T19:45:20.240+0000)\n>\n> {{champion:222}} {{item:3006}} {{item:3031}} {{item:3087}} {{item:3094}} {{item:3508}} {{item:3072}} \n> \n> \"Defense\"?\n\nSeriously, who on Earth is telling Jinx players to build ER when she's not a damn caster?","replies":[{"poster":"Sire Hippington","date":"2015-11-27T22:39:06.017+0000","up_votes":13,"down_votes":1,"body":"20a%crit+65ad is the highest possible dps item in that situation, simple as that.\nAnd ifnite mana never hurts.","replies":[{"poster":"ForgiveColour","date":"2015-11-28T05:02:36.294+0000","up_votes":1,"down_votes":14,"body":"no just no LMAO. Why would you want ER ON JINX WHY???????????????????????????????? I rather have you swap it out for a  scimitar. Do you have any idea the stats that {{item:3031}} {{item:3087}} {{item:3094}}  gives you? How did you even get upvoted WTF","replies":[{"poster":"Can U AD See Me","date":"2015-11-28T05:29:14.785+0000","up_votes":2,"down_votes":0,"body":"Frankly, I find it a bit difficult to use item actives other than the trinket so if I'm in a sticky situation I just press all number keys and therefore if rather have ER than mercurial. Er would nicely reduce e and r would down.\nEdit: ER's cooldown reduction would mainly affect E and R. Jinx is Illuminati conformed","replies":[{"poster":"ForgiveColour","date":"2015-11-28T05:39:27.034+0000","up_votes":1,"down_votes":3,"body":"Why would you waste an item slot... ie+shiv+fire cannon is already 80% crit you dont need 100%. Cdr for jinx e and r is pretty bad because as a jinx you want to be safe as possible so you would want a qss instead of a lower cd trap because late game teamfights is very explosive. If you find it hard then practice ","replies":[{"poster":"WalkingInACircle","date":"2015-11-28T05:42:41.248+0000","up_votes":3,"down_votes":1,"body":"Hell yes I think 100% crit is worth it.","replies":[{"poster":"ForgiveColour","date":"2015-11-28T06:50:14.736+0000","up_votes":1,"down_votes":3,"body":"no it isnt unless youre yasuo","replies":[{"poster":"Can U AD See Me","date":"2015-11-28T09:59:50.387+0000","up_votes":2,"down_votes":0,"body":"Why is 80% better than 100 % crit then?","replies":[{"poster":"ForeverLaxx","date":"2015-11-28T11:31:15.973+0000","up_votes":2,"down_votes":0,"body":"Don't bother arguing with the kid. He's convinced himself that \"his build\" is the best one so just let him keep thinking that. Nevermind the fact that everyone else is consciously forgoing defensive tools in favor of exploding things to death because they might have a team that can keep them safe, making defensive tools less useful.\n\nIt's almost like you can build to suit the situation. As much as Riot seems to want to keep removing that as a viable option, some champions can still manage to have a little variety in their item builds.","replies":[{"poster":"ForgiveColour","date":"2015-11-28T18:19:26.566+0000","up_votes":1,"down_votes":3,"body":"Post on your main kid. In what situation is ER on jinx better than {{item:3139}} {{item:3102}} {{item:3036}} {{item:3153}}. Not even pros in lcs goes 100% pure on item build because hurdur i got a team to bail me out. the situation is that you get cc for once in late game and you dont have a qss but hurdur 600dmg rocket you will die instantly without doing shit","replies":[{"poster":"ForeverLaxx","date":"2015-11-28T22:52:59.534+0000","up_votes":2,"down_votes":1,"body":"\"Post on your main\" he says. Why? So you can pretend you understand my skill level by looking up my summoner name? I could tell you that I've been playing this game since before Vlad's release. I could tell you that I was the first advocate and pioneer of the Warmog's Vlad build way *way* back before Warmog's got buffed, putting me ahead of the curve. I could tell you that I don't bother with ranked play on this game because of the plethora of people who intentionally throw the game when they know you're on a promotion series or placement matches.\n\nI could tell you a lot of things. What I'm going to tell you instead is that I don't care what you build or what \"the pros\" build because I understand why pros build a certain why and I understand why you care so much about what they build. Pros build that way because they're playing with other people at that same skill level, which means safety is not guaranteed, nor is it even a reasonable expectation. When you're playing soloqueue with a bunch of people at *your* skill level, I'm sure you could get away with a 100% offense build and get your job done.\n\nBut I'm sure that will go over your head. I won't be responding to your posts further, as it's very clear you lack critical thinking and reasoning.","replies":[{"poster":"ForeverLaxx","date":"2015-11-29T06:10:08.512+0000","up_votes":1,"down_votes":0,"body":"Don't bother. He has no arguments that can stand on their own, which is why he tries to dragged ranked level into the discussion. The fact of the matter is, I used to play ranked and I quit way back in Season 2 because it was the same shit as Normal but in a different wrapper. Anyone claiming otherwise is just delusional. I don't need to play ranked to deal with the \"mid or feed\" kids who feed regardless. As far as the game state is currently, I almost exclusively play Aram because I got tired of the constant headaches normal/rank would throw my way.\n\nHe lacks the cognitive function that allows him to recognize a situation and build accordingly. Why bother building defensive items when the enemy team has never gotten close enough to you to warrant it? Build more offense and put that pressure on harder. It's not really a difficult concept for most people, but he's lost in his \"my build is the best, so deal with it\" mentality that plagues so many people who can't think for themselves and believe a ranked rating to be some kind of measure of knowledge.","replies":[]},{"poster":"ForgiveColour","date":"2015-11-29T05:38:23.678+0000","up_votes":1,"down_votes":0,"body":"I assume this is supposed to be replied to me\n\n1. He is the one that started to derail the discussion. I had legit points and arguments in every single one of my post before he started to get into this\n2. People that says i dont play ranked because of trolls gets no respect from anyone. If youre good you can carry. \n3.  \"I can see you building stuff like Ap on riven and be like omg thats a preference item build\" Is it that hard to comprehend this sentence?\n4. How can he talk about ranked when he doesnt even play it? Its like kids talking about politics when they dont know shit","replies":[]},{"poster":"Can U AD See Me","date":"2015-11-29T04:34:37.745+0000","up_votes":1,"down_votes":0,"body":"So you counter the argument by calling him a \"bronze v\" that's the most immature way someone can respond to a rational argument. Also, I'd like to see a screenshot where he build \"AP\" on riven","replies":[]},{"poster":"Can U AD See Me","date":"2015-11-29T04:33:40.835+0000","up_votes":1,"down_votes":0,"body":"\n","replies":[]}]}]}]}]}]}]},{"poster":"Can U AD See Me","date":"2015-11-28T10:00:26.755+0000","up_votes":2,"down_votes":1,"body":"As I said, I rarely use item actives in sticky situation, also, 100% crit would garuntee those sweet sweet 5 man 600 damge q rockets","replies":[{"poster":"ForgiveColour","date":"2015-11-28T18:04:00.938+0000","up_votes":1,"down_votes":2,"body":"so you are telling me you die in every sticky situation because you dont know how to cleanse off the cc that got put on you? Why are you even arguing when you die before you even do damage? The point of adc is to be safe and dish out as much dps as possible that means you dont build retarded especially for jinx","replies":[{"poster":"Can U AD See Me","date":"2015-11-29T04:29:35.281+0000","up_votes":1,"down_votes":0,"body":"I'm telling you that I do not find it easy to click a number button and thus rarely succeed when I try. Also, no I don't die before I do damage, im not a brusier or juggernaut, I stay at backline just as a adc should. I always stay in motion and avoid the CC rather than cleanse it, given her awesome Q range and infinite mana with ER and 100% crit thus recovering mana every autoattck and 30%cdr, you can spam max range w and q while staying away from the fray and still doing aoe 600 damage crit and just recking them and yet surviving . that is the key. Not get CC'd at all. Also, in case is get cc'd (which happened very very rarely) I always buy boots of swiftness and only buy berserks if my team has a nice peel and thus remain safe.","replies":[]}]}]}]}]},{"poster":"Calculus","date":"2015-11-28T07:50:19.766+0000","up_votes":4,"down_votes":1,"body":"***","replies":[{"poster":"Can U AD See Me","date":"2015-11-28T10:01:35.497+0000","up_votes":2,"down_votes":0,"body":"Exactly what I want to say","replies":[]}]}]}]}]}]},{"poster":"RespectPlus","date":"2015-11-27T19:44:21.102+0000","up_votes":2,"down_votes":0,"body":"vayne dont need arpen, so she builds both","replies":[{"poster":"Dalanin","date":"2015-11-27T20:07:26.426+0000","up_votes":1,"down_votes":1,"body":"Bt is defensive tho","replies":[{"poster":"My Waifu Vanilla","date":"2015-11-28T09:34:28.822+0000","up_votes":1,"down_votes":0,"body":"And worse in every way to scimitar","replies":[{"poster":"Dalanin","date":"2015-11-28T16:02:52.920+0000","up_votes":1,"down_votes":0,"body":"i wouldn't say worse, they both got different moments to build but yea Merc scimmy is op with that debuff remover and movespeed boost","replies":[]}]}]}]}]},{"poster":"Erockandroll","date":"2015-11-27T19:48:11.023+0000","up_votes":6,"down_votes":1,"body":"{{item:3094}} Unique Passive : Fire Cannon\n\n{{item:3087}} Unique passive : Shiv Lightning\n\n{{item:2015}} Unique passive : Energized strike. (yes, even the component item.)\n\nSo they are unique passives, but are completely different unique passives. Which is why they stack. (and trigger off the same energy system.) \n\n\nSomething else worth mentioning. The Energize passive itself isn't unique. So stacking the items make them Energize faster. \n\n\n> [{quoted}](name=5000000000000000,realm=NA,application-id=3ErqAdtq,discussion-id=QF0twEPu,comment-id=0002,timestamp=2015-11-27T18:30:49.798+0000)\n>\n> Riot already knows this. It was in the patch note when they were released. They didn't do anything about it because they both occupy the same item slot on ADC build (crit/attack speed).\n> It's always Big damage item>Boots>Crit/AS>Lifesteal>%arpen>Defensive.\n> Taking two crit/AS items mean that you're giving up something almost necessary in return.\n\nWith everything I've just mentioned. Those two combined can be enough DPS. Especially on someone who scales well with AS. You don't even need to Rush IE anymore. Especially when you get enough base damage form a BF sword and combined that with these AS/Crit items. It's also worth mentioning that Mercurial Scimitar now has LS, so you can take care of your LS and Defensive item with one item slot. The option for building both is their, and it's effective.","replies":[]},{"poster":"CrazedPorcupine","date":"2015-11-28T10:16:55.617+0000","up_votes":3,"down_votes":0,"body":"For the first, It actually takes all the possible interactions for the spell blades.\nDamage: it picks the highest damage spellblade proc (Generally between TF and LB)\nSide Effects: AoE Slow applies, as does teh AoE damage against Neutral monsters. And the Mana return. All those do trigger, since those are all unique effects per spell blade.\n\nas for {{item:3003}} {{item:3004}} : If you have both, you gain 8 mana per spell cast, once every 8 seconds, (double stacks). As soon as one is done, the other immediately starts stacking.\n\nAs for the Legion Aura's. They do stack, but only for the two people holding them and they must be separate people holding them.","replies":[]},{"poster":"JedenVojak","date":"2015-11-28T04:48:52.530+0000","up_votes":1,"down_votes":0,"body":"I think everything should stack, even with itself.\n\nUsed to be a time you could actually do this build:\n{{item:3068}} {{item:3068}} {{item:3068}} {{item:3068}} {{item:3068}} {{item:3020}}","replies":[{"poster":"LordForrest","date":"2015-11-28T05:44:14.160+0000","up_votes":3,"down_votes":0,"body":"Oh god, {{champion:32}} and {{champion:86}} i remember these days","replies":[{"poster":"Auz the Ripper","date":"2015-11-28T15:55:08.386+0000","up_votes":1,"down_votes":0,"body":"Nah, it was all about {{champion:29}} \n\nDat invisible burn","replies":[{"poster":"junglerboy16","date":"2015-11-28T20:00:11.232+0000","up_votes":1,"down_votes":0,"body":"{{champion:28}} was worse tbh, since she used to stay stealthed even when right next to you.\n\nYou'd just see your health start going down.\n\nBy about 200 per second...","replies":[]}]}]}]},{"poster":"junglerboy16","date":"2015-11-28T19:53:33.788+0000","up_votes":2,"down_votes":0,"body":"> {{item:1402}} {{item:3100}} {{item:3078}} {{item:3025}} Do NOT all stack, as the spellblade effect is unique.\n\n***WRONG***\n\nThis is probably the biggest misconception in League of Legends. They do in fact stack, and there are specific rules for how they do so.\n\n* In terms of damage applied, they have this priority: {{item:3100}} >{{item:1402}} >{{item:3078}} >{{item:3025}} >{{item:3057}} \n* In terms of secondary effect, {{item:3025}}'s and {{item:1402}}'s AoEs and extra effects (slow for IBG, mana restore for Runeglaive) stack completely with any and all other spell blade effects.\n\nIn fact, this set of interactions behaves ***IDENTICALLY*** to the way the effects of Statikk Shiv and RFC stack. They share the same named passive, but since the bonus effects do different things, they apply together. Statikk Shiv and RFC actually function exactly as they should.\n\n{{item:3074}} and {{item:3748}} don't stack because they serve the same exact function (on-hit melee AoE waveclear) and are interchangeable.\n\n{{item:3068}} and {{item:1413}} don't stack because they are virtually identical on top of sharing a named passive, the stronger effect takes priority, just like with Spellblade's unique damage modifier.\n\n{{item:3003}} and {{item:3004}} stack 100%, but the Tear of the goddess passive doesn't stack for the sake of balance (otherwise you could technically stack 6 tears at once, which would be broken as hell on a certain purple mage...)\n\n{{item:3105}}/{{item:3060}}/{{item:3190}} do not stack because they are literally identical passives. This is the same as with a Zhonya's active being unique, not in any way like RFC/Shiv or the Spellblade passives.\n\n{{item:2053}}/{{item:3512}}/{{item:3056}} same as with Locket and co.\n\n**TL;DR: RFC and Shiv work as intended, you are actually just comparing apples and oranges with the other item passives.**","replies":[{"poster":"CaptainMårvelous","date":"2015-11-28T20:59:51.268+0000","up_votes":1,"down_votes":0,"body":"Well in that case this is even further inconsistant:\n\nAs you mentioned, spellblade effects apply the most damage and then the side-effects...so, with that in mind, shouldn't the hydra duo apply the most damage first followed by the titanic damage behind the target and the ravenous damage alongside the target? (Barring the spaghetti code not imploding from such a complex function)\n\nShouldn't the sunfire/cinderhulk combo do it's cinderhulk damage to monsters and the sunfire damage to champions?\n\nShouldn't the manamune stack from autos while the archangels stacks from spells at the same time?\n\nAgain, my point is less about \"Look at all these different items\" and more so \"let's get some consistency between them\". I may be arguing apples and oranges but I'd like for both of them to be a fruit rather than the apple being a fruit and the orange being a vegetable.","replies":[{"poster":"junglerboy16","date":"2015-11-28T21:54:51.013+0000","up_votes":1,"down_votes":0,"body":"Excellent questions!\n\nAs far as I'm aware, the {{item:3748}}/{{item:3074}} interaction is because they are interchangeable and probably has something to do with that aspect of their design, because you're right, one would think that the two passives should work that way. This one seems to be the least consistent passive interaction of everything you've mentioned.\n\nIn regards to {{item:3068}}/{{item:1413}}, I'm pretty sure that actually is already the case. I may be totally wrong, but that *should* be how those two interact.\n\nWhen you have both {{item:3004}} and {{item:3003}}, they actually *do* function that way. There is still the same static cooldown between stacks which is shared between both items as well as tear (2 charges every 8 seconds), but auto attacks proc the manamune version of the stack (+4 mana on attack or ability use) and Archangels procs for abilities (+8 mana on ability use). Again, you can only stack one tear at a time (so only 2 charges every 8 seconds, instead of potentially 12 charges every 8 seconds if you built 6 tear items), but the enhanced stacking mechanic means you stack each individual tear slightly faster than normal. Ironically enough, you can see this function in action during the \"Ultimate Bravery\" Showmatch between EU and Asia from a few days ago in the wildcard tournament. The Riven was given the black card build and had to go {{item:3158}}>{{item:3003}}>{{item:3004}}>into several other weird items. While he had both items built, you could actually watch each of them proccing individually for separate things (manamune proccing off of AAs, Archangel's proccing off of ability casts).","replies":[]}]},{"poster":"delonix","date":"2015-11-28T20:47:03.604+0000","up_votes":1,"down_votes":0,"body":"+1 for awesome explanation. On top of this, it's probably good for the game to have items that work differently.","replies":[]}]},{"poster":"CoolKnightST","date":"2015-11-28T09:58:32.978+0000","up_votes":2,"down_votes":0,"body":"{{item:3087}} & {{item:3094}} shouldn't stack. I find it pretty strange for example on Vayne you build {{item:3087}} {{item:3094}} over {{item:3094}} {{item:3046}}","replies":[]},{"poster":"Gubaguy","date":"2015-11-28T03:05:07.358+0000","up_votes":2,"down_votes":2,"body":"{{item:3153}} {{item:3146}} <-- those unique, yet identiacal, actives stack.","replies":[{"poster":"Ratbert","date":"2015-11-28T04:39:21.087+0000","up_votes":1,"down_votes":0,"body":"They're not identical.\nOne steals ms, the other does not.\nOne is magical, one is physical.","replies":[]}]}]}