{"poster":"CaptainMårvelous","date":"2017-05-05T05:00:12.685+0000","title":"Yet Another Zac Thread","subforum":"Gameplay","up_votes":5,"down_votes":1,"body":"Albeit this one aims to be a bit constructive within the framework and less \"Riot is shit, this update is shit revert everything\". Just so we're clear, Zac is one of my most played champions. Third highest mastery, albeit I'm not exactly great on him. \n\n#Some Thoughts on the Win-rate Drop\n\nWhile it is indeed true that Zac lost a lot of damage, I don't think this is the sole contributor to Zac's lost winrate. Out of all the tank updates, his was the most \"complex\" in terms of changes. Sejuani had changes and Maokai had changes but neither really had the difficulty altered to the degree that Zac's was. Now, while this might be a bit blunt, I'll be honest: Zac has always struck me as a very easy champion. Sure, he could do cool things but I'm not going to pretend Zac was the height of skill. Generally his play pattern was leap into a teamfight, pop ult to disrupt as much as possible and then spam Q/W until E came back up. \n\nComparatively, while weaker right now, new Zac requires more pre-planning and in-fight decision making. Let's say (number-wise) new Zac was on-par with old Zac. Would he be functionally the same? I don't personally think so. In my mind, new Zac requires a lot of planning and even in great scenarios, you can fuck up your ult such as pulling a Fiora into your Miss Fortune yes that happened to me and boy did I feel dumb. So on one hand, while he is different, I feel his overall difficulty has increased. The numbers don't help, sure, but the difficulty went up quite a bit.\n\n(Also resistances went up and overall HP went down. Zac loves him so HP though.)\n\n#Tweaking Zac\n\nThat aside, I want to focus on the kit. As it's unlikely that Riot will revert the rework (as shown by the only truly \"reverted\" rework being Kog'maw), I'll be focusing on ways/possibilities to make new Zac FEEL better and perhaps do better overall. While what I propose might be drastic, considering it a jumping off point and speculation rather than \"Here is my concrete #1 plan to make Zac's gooey thickness the splooge monster he was always meant to be\"\n\n##Q\n\nThis ability, when I heard about it on the leak, seemed fucking awesome. Holy shit I can be spiderman and slam fools together. It doesn't help that Riot's preview showed the best possible scenario. Here are some problems with the ability IMO:\n\n* It doesn't truly \"slam\" targets together but tug them toward each other.\n* Feels sluggish due to Zac's AAs and the awkward nature of them.\n* Low Damage.\n* Wonky skillshot with a self root.\n* Crap for jungle clear/single target.\n\nWhile the idea is awesome, Riot's implementation was about as sloppy as one of my patented \"Jump over a wall but don't because you hit the edge you fucking idiot\" plays. Instead, here are some possibilities to make stretching strikes FEEL better overall:\n\n* Make his next auto an empowered AA. Deal bonus damage to the target you hit. (Possibly reset AA timer)\n\nNothing more to it. Give it some more damage and a bit of harrassment power if you're in a 1v1. An AA reset would also make it feel a tad better to use.\n\n* Make targets actually slam together.\n\nHave Zac actually tug two targets to the midpoint. This would further enforce Zac's power as a \"Get back here\" tank. To compensate, have the tether range go up by level so it's easier to escape until Zac puts points into it.\n\n* Bigger targets, bigger damage, more blobs.\n\nWhy does slamming a Galio into Teemo do the same amount of damage as mashing together Bard and Sona? It'd give Zac a bit of power and make it less obvious for the frontline. In addition, if your slam hits a certain number of targets? Make an extra blob or two appear.\n\n##R\n\nAgain, a cool skill, but a bit too sluggish to use. Riot really overestimated the usefulness of this skill. Yes, you can pull a champ over a wall, but you're losing a ton of damage from the original ult. E also suffered so you can't E -> R for an insta-nunu-gib. So same as Q, this ability:\n\n* Hard to use effectively\n* Too easy to dash/flash out of.\n* Doesn't disrupt teamfights nearly as well as the previous ult\n* Less blobs.\n* The range kinda sucks despite the power. (Only useful in tight corridors)\n\nSo, as before, some possible ideas:\n\n* Play up the adhesive angle.\n\nInstead of a slow, have Zac's ult make a sticky trap that grounds all targets within it. While it's easier to run out of, it removes the dash/flash ez pz aspect of escaping Zac. Alternatively, if that's too much, have it only apply for a rank 3 Zac ult in the same way Darius ult unlocks at rank 3.\n\n* No seriously, play up the adhesive angle.\n\nWhat if Zac could slam enemies he's bouncing with against a wall, rooting/sticking them to it? Again, it's only great if you're in tight corridors or close a lane wall but it gives Zac's situational power a few more situations to use them on.\n\n* Make a splash.\n\nThe more enemies Zac has, the biggest the damage. After all, a five man cannonball makes a way bigger splash than one guy. (Unless it's Gragas vs. 5 yordles.) Alternatively, enemies picked up and dropped create more blobs.\n\n* Come with me if you want to live.\n\nAnd as a major alternative, let Zac pick-up allies. \"But what about ry-\" No. Stop that. Bad. Zac's wouldn't travel as far and also have the chance to bring along enemies. But Zac being able to give his team jungle utility by serving as a quick escape after a botched dragon fight could do wonders. Also, more situations to use his ult in more ways.\n\n#Wrap-Up\n\nDo I think the rework is an utter absolute failure? No. And that's totally not because I got a ton of fist shekels transferred to my account because I really want that new Cait skin and Tryndamere has me on his payroll.\n\nHowever, I do think it was handled sloppily. Not to the extent of Malzahar getting a passive that is so powerful in every single situation that it makes everything about him change, but it's certainly no Sion. While I think it's too early to call for a reversion, Riot -really- needs to look into making Zac feel better and have more chances to be cool. Zac can bounce back from this but every patch it takes for that to happen, more Zac mains are going to be frustrated.\n\nNow I need to go talk about how Sejuani is a masterpiece. Those dark star skins aren't buying themselves on a substitute teacher salary.","replies":[{"poster":"TheHappyReaperz","date":"2017-05-05T05:09:16.300+0000","up_votes":3,"down_votes":0,"body":"What I don't get about the new Zac Q, is why they didn't just make it two skillshots. You have none of the problems of weird autos, or strange damage application, and the skill can actually do something decent, because you have the opportunity to dodge it.","replies":[{"poster":"CaptainMårvelous","date":"2017-05-05T05:11:41.528+0000","up_votes":2,"down_votes":0,"body":"My assumption is that because of the way the skillshot is coded (You're technically \"rooted\" for a second and then you throw your arm), a double-skillshot wouldn't work well. Alternatively, give it some consistency so that even if you miss, you have a chance to salvage your bonobo play and throw a minion at the dude.","replies":[]}]},{"poster":"broccoflauer","date":"2017-05-08T01:13:01.777+0000","up_votes":1,"down_votes":0,"body":"Zac rework is a JOKE. You can't do anything; inane impractical Q and R, rest of his kit is dragged down into obsolescence. Did they even test out this travesty in applied gameplay or just fold their arms and say AAAYYYYYYYYYYYY wacky Zac thematic clarity!!!\n\nWorst champ in the game now.","replies":[]}]}