{"poster":"JimmyNtheKudos","date":"2016-05-13T19:44:54.380+0000","title":"The most I've seen people unhappy over the overall game","subforum":"Gameplay","up_votes":103,"down_votes":12,"body":"I&#039;ve been playing since Season 4, and I&#039;ve noticed that this is probably the time were people have complained the most about the game as a whole. Yes, the boards never cease to complain about specific champions or changes, but people kept on playing.\r\n\r\nNow, it&#039;s not a complaint about a specific change or champ, it&#039;s about the game itself not being fun to play. I think this says A LOT about the current state of the game.\r\n\r\nJust an observation I wanted to share!","replies":[{"poster":"JESUSSAYSNO","date":"2016-05-14T20:23:29.670+0000","up_votes":12,"down_votes":1,"body":"The game has too many free stats thrown in our face right now. s5 dragon changes, current dragon changes, and the new mastery system give WAAAAAY too many stats without much player effort. Due to the inate power level of any given champion due to these external systems, the game is extremely prone to snowballing. \n\nTanks play like bruisers did in s4 in terms of damage output and the amount of time they could tank damage. Bruisers are along the lines of Melee adcs. Melee adcs fall over with a stiff wind but can delete a 2k health target in 2 seconds. \n\nThe overall pacing of the game is fucked. \n\nRiot's design philosophy where 'the draft doesn't matter' is fucking bullshit as well. A lot of riot's early champions were designed around the draft format and being useful in some situations and garbage in others. Riot is choking these champions out, reworking them and nerfing them into the ground when they become meta due to their prey becoming strong. Look at malphite and Ramus. both of these champions are situational anti-AD tanks. Instead of letting the meta play its course (ie letting their counters be found, buffing said counters or nerfing the champion if need be), riot just outright nerfs them.\n\nUltimately, the game isn't based around champions anymore, this is a team based brawler. And that's not something I signed up for. I dropped dota for league because I wanted faster gameplay and more individually dynamic gameplay. All the aspects I liked about league are being stripped away and being left with aspects that make the game unfun, frustrating, and downright stupid in a lot of cases. \n\nEkko is the face of the game right now. Why? He's completely and utterly balanced in riot's current system. He's a jack of all trades, master of none. This is the game that riot's taking steps to make, where individual champions don't matter, but the jack of all trades kind of champions, who don't have defined strengths or weaknesses shine, and those who have niche pick conditions are nerfed into the ground.","replies":[]},{"poster":"deadlychuck","date":"2016-05-14T21:56:23.755+0000","up_votes":9,"down_votes":1,"body":"Riot keeps lowering the skill ceiling and rising the skill floor.\n\nChampions just have scripted answers in their kits to different things. There was a discussion a while back that i recall on the forums (not the boards forum days), when the devs were talking about the input vs output gameplay. \n\nA champion should have good input and good output gameplay. To elaborate, a champion should require a good amount of player input, to have a good amount of gameplay output.\n\nLet's take the reworked malzahar as an example, because as an ex-malz main i've been thinking about it a lot. They removed a lot from his kit's input, and gave him more kit output than he previously had. His passive is now actually passive, where as before you would keep count or watch the stacks, then a good player could control his voidling with auto attacks for extra value. His W use to have an important amount of positioning power as a zoning too, which has been replaced with 100% automated voidling vomit. His Q animation was sped up, so it takes even less prediction to actually land, and now it extends the duration of your E for free. \n\nThe new design team has stopped giving a rats ass about the input value of the game, and only cares about the output value. It's like driving a fast sports car that dampens the G-forces, rides smooth, and isn't manual. Yeah, you're going fast, but you don't get the sensation of doing so.","replies":[{"poster":"Gulma","date":"2016-05-15T06:14:52.733+0000","up_votes":1,"down_votes":0,"body":"Yep, malz was a very skill oriented champ. I could never get his combos off perfectly","replies":[{"poster":"deadlychuck","date":"2016-05-15T10:40:55.067+0000","up_votes":2,"down_votes":0,"body":"His ability to combo was just one aspect of his kit, and was unreliable during a team fight. Yes it needed to be nerfed. Though riot didn't need to completely destroy his identity in the process. \n\nAD malz actually required skill, and there was a large difference between a good AP malz and a bad AP malz. Now i can play 20 games on the new malz and still have not improved in the slightest. That's to say, that i'm not playing poorly or even losing, it's that by the end of the first game i had basically mastered this completely new champion. Despite his kit feeling nothing at all the same, and having completely different farming and fighting patterns.\n\nBesides, if you thought that all there was too successful malzahar play was E,W,R, combo for a kill. Then you wouldn't have made it past silver playing him. The depth of skill of the champion was substantially larger than it is now, and his current kit is mechanically flawed to forever dominate or be useless.","replies":[]}]}]},{"poster":"TruckFump2016","date":"2016-05-13T21:14:49.368+0000","up_votes":8,"down_votes":25,"body":"I feel like competitiveness and the tryhard nature of the players is to blame.\n\nEven in norms people get super mad about things like \"ks\" and off meta picks.\n\nAll they do is talk shit about who is winning and losing. There is no friendly banter/competition. \n\nJust a bunch of children talking crap to each other and spamming \"?\" in all. I feel like the average age of any random league player has significantly dropped since season 4.","replies":[{"poster":"Micbran","date":"2016-05-13T23:46:35.902+0000","up_votes":6,"down_votes":1,"body":"Agreed. You see the same shit in the featured game modes, modes designed for fun. People just spam what's most OP and win. Where's the fun in that?","replies":[{"poster":"Lady Hammerlock","date":"2016-05-14T04:36:56.083+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Micbran,realm=NA,application-id=3ErqAdtq,discussion-id=agJdB4sI,comment-id=00000000,timestamp=2016-05-13T23:46:35.902+0000)\n>\n> Agreed. You see the same shit in the featured game modes, modes designed for fun. People just spam what&#x27;s most OP and win. Where&#x27;s the fun in that?\n\nNo fun at all,URFS filled with tryhards,one for all is filled with tryhards,People in Ascension just pick assassins but normally its the least tryhard filled environment,Poroking is just broken done","replies":[{"poster":"Ulquiorra995","date":"2016-05-16T02:53:49.691+0000","up_votes":1,"down_votes":0,"body":"It's an endless chain. Tryhards pick OP champions, stomp people who just want to have fun - then those people start picking OP champions in order to have a chance and the cycle continues.\n\nBut again, the players are to blame. Same as in Smite's featured game modes - the mode is fun for a day or two until people figure out what's OP and start spamming it. The only remedy would be implementing random pick in those modes. Or bringing back Nemesis draft. Hell - even combining those seems like it'd be hilaroius. I'd play the shit out of Nemesis Ascension.","replies":[{"poster":"Crossette","date":"2016-05-16T02:58:28.370+0000","up_votes":1,"down_votes":0,"body":"I've been wanting Nemesis HexaURF for All since all four of them were made.\n\nToo bad Riot's not going to let us have ANY fun here. :v","replies":[]}]}]},{"poster":"Kubox","date":"2016-05-14T17:53:56.600+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Micbran,realm=NA,application-id=3ErqAdtq,discussion-id=agJdB4sI,comment-id=00000000,timestamp=2016-05-13T23:46:35.902+0000)\n>\n> Agreed. You see the same shit in the featured game modes, modes designed for fun. People just spam what&#x27;s most OP and win. Where&#x27;s the fun in that?\n\nWhile I agree that there's nothing fun about facing the same OP champs over and over (especially in featured game modes), you can't really blame the players.\n\nWinning is a naturally fun thing to do.","replies":[]}]},{"poster":"LankPants","date":"2016-05-14T05:32:01.406+0000","up_votes":10,"down_votes":0,"body":">I feel like competitiveness and the tryhard nature of the players is to blame.\n\n>Even in norms people get super mad about things like \"ks\"\n\nThat's not being competitive, that's being an arsehat. As people get better they start to understand that who gets the kill isn't that important.","replies":[{"poster":"Aazzlano","date":"2016-05-14T21:36:36.713+0000","up_votes":2,"down_votes":0,"body":"I disagree with that last part. I mean I never complain and actually I don't mind if the other person gets the kill when I gank, but it DEFINITELY does matter who gets the kill. I mean getting the enemy champion dead over not getting them is important of course, but to say that it's not important who the actual kill goes to is just flat out wrong. The person who is best suited to take the bulk of the gold varies game to game, and even kill to kill, but correct gold distribution is incredibly important. That's why supports aren't supposed to take CS, because the class/role is taken into the game because they can function on low income, to maximize the actual gold generated on your team. A support with one more full item isn't going to make as big of a difference as the adc with one more full item, in most situations. Of course a kill doesn't get you a full item, but like I said there is a reason supports don't last hit.","replies":[]}]},{"poster":"Swordfish","date":"2016-05-14T17:35:30.757+0000","up_votes":2,"down_votes":3,"body":"they should do it like korea and only allow people that have an ID card to play aka that are more mature than the 12 yo brats","replies":[{"poster":"Gulma","date":"2016-05-15T06:22:05.586+0000","up_votes":2,"down_votes":0,"body":"and lose a bulk of their playerbase? riot is already bleeding enough as is.","replies":[]}]}]},{"poster":"Academy Kayn","date":"2016-05-14T23:07:54.789+0000","up_votes":2,"down_votes":1,"body":"To be fair, this is the most we've seen the Vocal Majority complain about the game. A very small percentage of players actually use the League Boards.","replies":[{"poster":"Gulma","date":"2016-05-15T06:11:42.533+0000","up_votes":4,"down_votes":0,"body":"so let's assume the ones that don't absolutely love all the changes. \n\nHINT : It's not just people who use boards that are annoyed. most of my friends list have quit (probably they got bored at some point in time) they never made a post about it.","replies":[]}]},{"poster":"Blåbæret","date":"2016-05-14T21:01:58.584+0000","up_votes":2,"down_votes":0,"body":"LoL is giving me a WoW déjà vu, and we all know how that game eventually went down the drain.","replies":[{"poster":"Keevalroy","date":"2016-05-15T03:37:05.175+0000","up_votes":4,"down_votes":0,"body":">and we all know how that game eventually went down the drain.\n\nRiot is acting like Blizz was in 2010, and the game started going downhill, and that was six years into the game's development as well...déjà vu indeed.","replies":[{"poster":"Gulma","date":"2016-05-15T06:15:19.299+0000","up_votes":3,"down_votes":0,"body":"don't forget runescape","replies":[{"poster":"Keevalroy","date":"2016-05-15T14:02:20.488+0000","up_votes":2,"down_votes":0,"body":"Didn't play - not my place to speak.","replies":[]}]}]}]},{"poster":"TheFlamerino","date":"2016-05-14T03:13:18.235+0000","up_votes":6,"down_votes":2,"body":"I am starting to hate it, ranked is a fkin joke, trolls and 60 cs at 25 minutes are rampant in silver 2-3... basically 80% the games are doomed. Funmodes and aram ftw until rito fixes the piece of stinking crap matchmaking they have. It's disgusting how the game is right now.","replies":[{"poster":"A Miss Fortune","date":"2016-05-14T12:38:40.845+0000","up_votes":4,"down_votes":0,"body":"I can't be the only one that notice the increase in toxicity of the game. The last games I've been playing I've encountered unreasonably toxic players. Just ended a game where the Fiddle blamed everyone on the team for dying, basically if you were on the opposite side of the map farming it was your fault he died.","replies":[{"poster":"ADepressedLeona","date":"2016-05-14T13:59:50.216+0000","up_votes":4,"down_votes":1,"body":"I've been playing since S1 and that's nothing new.","replies":[{"poster":"OmegaMilton","date":"2016-05-14T21:36:15.437+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=UndyneUndying,realm=NA,application-id=3ErqAdtq,discussion-id=agJdB4sI,comment-id=000100000000,timestamp=2016-05-14T13:59:50.216+0000)\n>\n> I&#x27;ve been playing since S1 and that&#x27;s nothing new.\n\nI've been playing since season 0 and yeah, it's not new, but it is FAR more rampant now than it has ever been. To the point where it is now the rule and not the exception. An example of the contrast between now and then:  I used to add about 1 - 3 people to my friends list a week because many of the people i played with were not only pleasant to play with (and sometimes against)  but genuinely gave an effort, and I'm not the type to send and accept friend requests left and right on anything. Since around 2012, I can count the amount of new people I've added to the list on one hand. In short, everyone sucks now _in every sense of the word._ Also since about that time, I hardly ever see any of those old players on my friends list log in anymore and it makes me sad. It also makes me yearn for past LoL greatly. The only fun I can muster out of this game anymore comes from ARAM and a few of the rotating game modes.","replies":[]}]}]}]},{"poster":"Gorgannan","date":"2016-05-14T09:36:22.033+0000","up_votes":4,"down_votes":0,"body":"I just want S3 with the new Rift.","replies":[{"poster":"Gulma","date":"2016-05-15T06:17:16.400+0000","up_votes":2,"down_votes":0,"body":"wish there was an s2 or s3 version of league...","replies":[]}]},{"poster":"Crayon Puppet","date":"2016-05-15T01:48:36.477+0000","up_votes":6,"down_votes":2,"body":"Riots not balancing the game for balance, they are balancing the game to sell skins.  Skins sales are the companies btm line so ultimately it is reflected in game design.  Every patch updates primary goal is to sell as many skins as possible without making the game seem particularly unfair for any particular group of the player base.  Ekko is a skin sale tactic its just what it is, how many 1000s of players bought a cheap ekko skin because he's so strong in the meta and looks cool.  They have 100+ champions and a new release champion every month to figure out how to sell you skins for new art they have created. \n\nTLDR  Balance isn't about Balance its about selling art in a gaming format","replies":[]},{"poster":"Dr W","date":"2016-05-15T23:07:42.813+0000","up_votes":3,"down_votes":0,"body":"Dynamic Q is killing this game","replies":[{"poster":"Keevalroy","date":"2016-05-16T03:34:55.691+0000","up_votes":3,"down_votes":0,"body":"A lot more than Dynamic is killing the game, but this is indeed a big part of it.","replies":[]}]},{"poster":"Anags","date":"2016-05-15T16:23:20.989+0000","up_votes":2,"down_votes":3,"body":"People have actually made thesense accusations before. Pretty much anytime a preseason occurred that changed the game significantly.  Basically, every jungle change.  This is nothing new. It happened last season as well.\n\nI mean do you really think the ....I'm quiting league because the game is no longer fun posts are new lol. Also, posts such as that and this are pointless.\n\nIf a game isn't fun for you that's when you move onto something else. It's a pretty natural thing.","replies":[{"poster":"Crossette","date":"2016-05-16T03:02:53.318+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Anags,realm=NA,application-id=3ErqAdtq,discussion-id=agJdB4sI,comment-id=001b,timestamp=2016-05-15T16:23:20.989+0000)\n>\n>  Pretty much anytime a preseason occurred that changed the game significantly.\n>  a preseason\n\n\nThat's why people have complained about the shitty balance in the game WELL past the preseason.\n\nThere are some extremely popular streamers and LCS players that barely want to do this anymore.","replies":[]},{"poster":"Ulquiorra995","date":"2016-05-16T03:00:03.440+0000","up_votes":1,"down_votes":0,"body":"But we are past midseason now. And honestly, it's hard to believe. In my head with all the shit flying around it still feels like preseason. Then MYMU hits and I'm like \"Wait, what? MID season already?\".\n\nAnyway, playing since season 1 and I agree that the fun part of the game has hit rock bottom while frustration has increased exponentially. Hell, I've had more balances and fun games in DotA's ability draft - which is a game mode broken by default and plagued by tryhards to all hell. I have yet to see another game veteran who actually likes these changes. Still haven't fully quit - but have grealy reduced the time I spent playing: from someone who played 3-5 games a day went to 1-2 a day, then to 1-2 every few days and now I rarely even play 3 games a week. Unless something changes real soon Rito is losing another player who supported them almost since the beginning.","replies":[{"poster":"Gorgannan","date":"2016-05-16T16:48:51.331+0000","up_votes":1,"down_votes":0,"body":"I've been playing Warcraft to get my oldschool fun fix. LoL isn't hitting that sweet spot. Every new champion is more \"anti-fun\" to play against than fun to play, which Riot said they'd never do.","replies":[]}]}]},{"poster":"NowTHISIsPodrcng","date":"2016-05-14T08:17:43.869+0000","up_votes":7,"down_votes":4,"body":"I honestly think that the reason that the game is going down hill is because theyre going for a more \"diverse\" style of champs, but theyre going too far with it. When you do this, you venture into areas of unbalaned OPness that isn't relateable to any other champ. For example, the invincible ults are very special but honestly broken af. I don't even feel like I deserve the win when my team goes liss/taric/kindred because in the team fights it's impossible to kill us. I don't think that we're better than the other team, I just think that we have uncomparably OP ults to give credit too. Also, veigar. WTF was up with that rework? You took his point and click ult with a huge ass stun and buffed it even harder.  I don't enjoy the new champs, I think that they're weird and un original. Kindred was great until you threw his ult in there. How boring and game breaker of an ult is that? How does that add to the game? It doesn't. Also, the reworks. Poppy is boring to play now, shes bland. Doesn't feel very rewarding to play her anymore. But GRAVES. BRING THE OLD GRAVES BACK PLEASE! I still have him as my highest mastery champ yet I've played maybe 10 games with the reworked graves since that happened. Riot, I'm hating your game. I don't play it often anymore and don't really have any desire to go up in rank. It feels less than ever about skill and more of the champs you pick. While I used to pick champs that I had fun with but weren't the best, I could still win. I still could rank up with them if I could really try and out play. Now though, it's like I lose every game I go a champ I enjoy. But then I pull out the OP shits like veigar, viktor, kindred etc and it's a free win. I really suggest you get a new balancing team in Riot. Fire or move who ever is leading these projects. These huge updates you do don't make the game better at all. They're ruining it. Each time I enjoy the game less and less. Not because i'm not used to it and its weird, but because you had so much potential and fell face first into the dirt. You could have balanced so many things but chose not to. I'm frankly pretty much done with league, after 5 years of playing.","replies":[{"poster":"Supreme Senpai69","date":"2016-05-14T19:37:44.545+0000","up_votes":3,"down_votes":0,"body":"They didn't buff Veigar's ult. \n\nHis old ult:     Magic Damage: 250 / 375 / 500 (+ 100% AP) (+ 80% of target's AP)\nHis new ult:   Minimum Damage: 175 / 250 / 325 (+ 75% AP)\n                      Maximum Damage: 350 / 500 / 650 (+ 150% AP)\n\nLet's just take the average of the minimum and maximum damage, which becomes 262 + 112% AP damage when used now. It used to be 250 + 100% AP + 80% of target's AP. On average, it deals 12 more damage + 12% more AP, which is negligible, but it no longer does the 80% target AP damage, which was insane. \n\nThe ult was changed so that it could be used against AD champions and so AP champions didn't lose lane just because Veigar was level 6. His passive got buffed, his ult got nerfed.\n\nHis stun isn't really huge, either. Only the walls stun. You have to physically make contact with those walls to be stunned. Good players are never stunned by it so in teamfights it's usually used like an Anivia wall. Which is great, don't get me wrong, but his stun isn't OP whatsoever.","replies":[{"poster":"Aazzlano","date":"2016-05-14T21:41:41.743+0000","up_votes":1,"down_votes":0,"body":"Why are you taking the average? You don't Ult a full health target, so why is that even included in the range? The Ult was buffed if you aren't just randomly throwing it out whenever.","replies":[{"poster":"Supreme Senpai69","date":"2016-05-15T18:02:55.684+0000","up_votes":3,"down_votes":0,"body":"Because if you're using your ult at a 33% HP target, they're basically already dead no matter what you do. If it's a 1v1, then sure the ult is still awesome. But in teamfights it's literally just a way to steal kills or do a minor chunk of damage before you die/leave the fight due to low HP.","replies":[]}]},{"poster":"NowTHISIsPodrcng","date":"2016-05-19T23:51:08.919+0000","up_votes":1,"down_votes":0,"body":"A point and click 1300 ult late game on a tank is op in my opinion. It doesn't require skill, and does way too much damage. I've been making a montage of how stupid it is late game and it really should have been changed. I just see potential for real  change and they just modify it. It's not a rework at all. I felt in the past that going an AD champ would counter veig, but now it does me no good to do so. They took out that counter play and it frankly ruined him. \n\nHis wall is stupid because theres no clear defining wall of it. I feel like the borders of it extend a bit past where I think it should. Its a huge model for a simple stun. That's what is irritating to me.","replies":[{"poster":"Supreme Senpai69","date":"2016-05-20T07:31:05.953+0000","up_votes":2,"down_votes":0,"body":"Eh? Veigar isn't a tank","replies":[]}]},{"poster":"Crossette","date":"2016-05-16T03:01:17.161+0000","up_votes":1,"down_votes":0,"body":"I'm going to ignore your ult math for a second and put in my piece on Veigar.\n\nLeaving the farming with Q for AP? Fine.\n\nMaking it so ANY ABILITY HE LANDS ALSO GIVES HIM AP? Not fine.\n\nI got 100 AP from passive alone in 15 minutes.\n\nWith Morellonomicon and Rabadon's, I had like 700 at the 25 minute mark.\n\nThat's a problem.","replies":[{"poster":"Supreme Senpai69","date":"2016-05-17T00:09:44.064+0000","up_votes":1,"down_votes":0,"body":"His new passive is VERY powerful late game. His old passive was better early/mid because it gave a lot more mana sustain. Now until you build a tear, you go out of mana crazy fast. Good news is that once you have tear and maybe a Catalyst, your mana problems are gone. While 100 stacks in 15 minutes seems like a minor exaggeration, especially so with having a Deathcap at 25 minutes, if there's a problem with Veigar, it's with the new items and not his new kit imo.\n\nWith the new passive he's encouraged to actually fight his lane opponent instead of sitting a mile away farming with Q. He's pretty weak early game and has no mobility, so fighting is dangerous for him. I think the new passive was a good idea, and if not for the item changes, losing his old passive would really hurt and make up for the epic gains of the new passive.","replies":[]}]}]}]},{"poster":"Aheadatime","date":"2016-05-14T21:14:59.218+0000","up_votes":3,"down_votes":0,"body":"I've been playing since early season 2 and have been noticing the same trend. This season, too much has changed, and the changes have been too drastic. Dynamic Q, mid-season bananza, vision changes, etc. Too much, too fast. I haven't played ranked in weeks.\n\nAnd to all of those saying \"leage of cleavers, league of warmogs\", these were temporary things. The other 99% of the game surrounding these outliers was enjoyable at the time, unlike the current situation. Too much in unenjoyable right now, and that's a big problem. I went from playing a ranked game or two a day to playing one norms every day or two. This game just feels meh right now.","replies":[{"poster":"Crossette","date":"2016-05-16T03:05:51.426+0000","up_votes":1,"down_votes":0,"body":"I actually enjoyed season 5 to a point.\n\nThis season is either \"pick a champion that can be tanky, build X item, win the game as long as the enemy that also has X item doesn't kill you\"\n\nFirst it was IBG, then SFC, then sated devourer, now it's rageblade.\n\nI honestly feel like Riot is changing shit just for the sake of changing it, but it's causing more balance issues.\nVlad, Malz, Brand and Veigar are WAY too strong right now, no matter who I ask.\nThey pretty much made Cass, Swain, and Vel terrible to play.\nZiggs is ok at least.","replies":[]}]},{"poster":"Tufio","date":"2016-05-14T09:19:18.432+0000","up_votes":6,"down_votes":3,"body":"You don't say.\n\nRemoval of ranked.\nRandom reworks and balance out the window","replies":[]},{"poster":"Rand0mH3r0X","date":"2016-05-15T03:39:14.248+0000","up_votes":2,"down_votes":1,"body":"This post has 0% to do with gameplay, and more your perception of other people's perception of this game.","replies":[{"poster":"Gulma","date":"2016-05-15T06:08:31.956+0000","up_votes":2,"down_votes":0,"body":"well, maybe there should be a category for that?","replies":[]}]},{"poster":"CenRyX","date":"2016-05-14T21:45:12.196+0000","up_votes":2,"down_votes":0,"body":"Game sucks rite now,short :\n1. So many changes (also patches are so long ).\n2.Ranked sucks with dynamic queue.\n3.Matchmaking in normals is so good ( a team full of silvers vs mixed team of diamonds and plats./FF should be reduced to 10 mins).\n4.Unbalanced champs every patch and unnecessary nerfs especially to items.","replies":[]},{"poster":"Darkinlegend","date":"2016-05-14T20:13:18.359+0000","up_votes":3,"down_votes":1,"body":"You are correct but people at Riot are too arrogant to care about what the players think. They just want to push their agenda.","replies":[]},{"poster":"TotalJerk","date":"2016-05-14T20:47:37.837+0000","up_votes":1,"down_votes":0,"body":"You don't remember early season 5?","replies":[{"poster":"BluePolarizer","date":"2016-05-16T19:11:59.632+0000","up_votes":1,"down_votes":0,"body":"You could ban warwick, can you ban dynamic queue?","replies":[]}]}]}