{"poster":"I HAMPSTER","date":"2017-12-29T11:16:52.183+0000","title":"why refuse surrender 4v5?","subforum":"Player Behavior","up_votes":5,"down_votes":2,"body":"people baffle me.\r\n\r\njust got out of a normal game where our zoe had to leave at around 20 mins.  no big deal right?  its just normals and we were losing anyway 14-24 so we can just ff and get a fresh start in a different game.\r\n\r\nbut nope.  surrender vote fails 2-2.  remember this is not a dc that might return.  zoe actually said 'sorry guys i have to go'.  they are voting to not surrender a 4v5 in a game we were already losing pretty badly 5v5.  \r\n\r\ni know from experience not to try to reason with these people.  it just makes them dig in their heels.  so no comment, ill just try to play safely and see what happens.  as you can imagine it doesnt get better.  12 minutes later 3 more surrender votes have failed and they finally end the game 19-37.\r\n\r\ni really cant fathom what these people are thinking.  it actually blows my mind.  why would anyone want to waste their time like that in a lost 4v5 game when you could use that time to get into a fresh game?  \r\n\r\nfree time is a valuable thing to me.  and so i want to maximize my fun whenever i have some of it.  but apparently some other people have a different strategy.  can anyone explain it to me?  is it some weird video game honor thing?  or am i getting trolled somehow?  i just want to make some sense of it.","replies":[{"poster":"SuicideAw","date":"2017-12-30T00:44:03.392+0000","up_votes":4,"down_votes":0,"body":"Just leave the game when people try to vote no.","replies":[]},{"poster":"Brotha","date":"2017-12-29T23:09:19.496+0000","up_votes":4,"down_votes":0,"body":"Op I normally won't surrender a 4v5 if we outscale them or they're starting to throw prior to a surrender vote going through. That said I too hate being held hostage in a game that is clearly over. It's unfair to everyone that we have an afk, but it's also unfair that two players want to give up an already lost game but the other two (probably a premade) want to keep the pain train rolling. When you have an afk like that players who do not wish to continue should have the right to leave, and those who want to continue playing should be free to do so.","replies":[{"poster":"I HAMPSTER","date":"2017-12-29T23:46:18.916+0000","up_votes":1,"down_votes":0,"body":"yeah man.  we didnt outscale them.  they had vayne, yasuo, and veigar.","replies":[]}]},{"poster":"Zezockary","date":"2017-12-29T11:20:14.708+0000","up_votes":4,"down_votes":0,"body":"Idk, I actually enjoy playing 4v5's, but I will usually surrender one if most of the people on my team want to, or if I am like grinding for wins on an event.","replies":[]},{"poster":"SoundChaosDebug","date":"2017-12-29T11:25:25.317+0000","up_votes":6,"down_votes":2,"body":"If I can only get in 1 game for the day and it ends up 4v5 I'd vote no just to play a game.","replies":[]},{"poster":"kattzkitti","date":"2017-12-29T11:19:01.154+0000","up_votes":4,"down_votes":5,"body":"They do it because they know it pisses people off, yet they won't suffer any kind of account action over it.","replies":[{"poster":"o brigid o","date":"2017-12-29T13:35:20.306+0000","up_votes":6,"down_votes":3,"body":"this assumption is ignorant and a bit self-centered to say the least.\n\npeople might be learning new champions, and want to use the rest of the match for practice. people might not have time to play another full game after and want to enjoy the time they have left for the next 10-15 minutes before work or school or whatever. people might genuinely want to try their best to see how well they can do in a losing situation. there are so many reasons they might not want to surrender, the least of which is just to piss off a stranger who initiated the vote. believe it or not, people tend to play league to enjoy the game.\n\nnot everything done counter to your own wishes is done just to piss you off. you're not that special, and most strangers aren't going to go that far out of their way to bother you in such a trivial fashion. the world (and the intentions of strangers) doesn't revolve around you.\n\nthey don't want to surrender for whatever reason and, as it is a vote, they have every right to vote whichever way they please.","replies":[{"poster":"Ekitaih","date":"2017-12-29T13:44:48.758+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Psychicgammarays,realm=NA,application-id=ZGEFLEUQ,discussion-id=KaRcBVpR,comment-id=00000001,timestamp=2017-12-29T13:35:20.306+0000)\n>\n> this assumption is ignorant and a bit self-centered to say the least.\n> \n> people might be learning new champions, and want to use the rest of the match for practice. people might not have time to play another full game after and want to enjoy the time they have left for the next 10-15 minutes before work or school or whatever. people might genuinely want to try their best to see how well they can do in a losing situation. there are so many reasons they might not want to surrender, the least of which is just to piss off a stranger who initiated the vote. believe it or not, people tend to play league to enjoy the game.\n> \n> not everything done counter to your own wishes is done just to piss you off. you&#x27;re not that special, and most strangers aren&#x27;t going to go that far out of their way to bother you in such a trivial fashion. the world (and the intentions of strangers) doesn&#x27;t revolve around you.\n> \n> they don&#x27;t want to surrender for whatever reason and, as it is a vote, they have every right to vote whichever way they please.\n\nWell worded. I completely agree. If I were in the situation where I was learning a new champ, I would want to play it out. Not to piss anyone off, but to learn the champ better. I have a good bit of free time, but on days that I work (I work 12 hour shifts) I'd want to continue the game because I'd only have the chance to play that one.\nOP, I pose this question to you. I get that your time is valuable. But so is everyone else's. So why is yours more special than theirs? Why should they conform to what you want? As Psychicgammarays states, it's a vote. So it's their choice to continue the game as well as yours.","replies":[{"poster":"I HAMPSTER","date":"2017-12-29T20:03:26.779+0000","up_votes":2,"down_votes":0,"body":"my time is not more special than theirs.  everyone's free time should be valuable.  i just dont understand why anyone would want to spend it getting stomped into the dirt 4v5.  \n\nthere is not that much you can learn about your champion when the enemy khazix is so fed that he can jump out of nowhere and 1 shot you.    which he was doing to everyone including our full ap warwick and full ap amumu.  \n\nhaha the more i look over that game the worse it actually was.  i believe you could learn much more in a new game with a fair chance.","replies":[]}]},{"poster":"I HAMPSTER","date":"2017-12-29T20:07:30.472+0000","up_votes":1,"down_votes":0,"body":"you are sometimes right i am sure but i have heard people admit they are doing it because 'you fed them.  im not letting you leave without paying the price'","replies":[{"poster":"o brigid o","date":"2017-12-29T20:42:18.495+0000","up_votes":1,"down_votes":1,"body":"i promise you 9 out of 10 people are not out to get you when they vote no. the occasional \"i'm not letting you leave\" vote is the exception to the rule.\n\nand when that happens, just try to have fun and enjoy it for what it is... a video game. if it really upsets you, once the game has concluded take a break and walk away so you don't bring your tilt into the next match.","replies":[]}]}]},{"poster":"I HAMPSTER","date":"2017-12-29T11:25:05.782+0000","up_votes":2,"down_votes":2,"body":"thats kind of the feeling i got.  but they dont even know me and they are throwing away their own time too....","replies":[{"poster":"kattzkitti","date":"2017-12-29T12:21:22.897+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=I HAMPSTER,realm=NA,application-id=ZGEFLEUQ,discussion-id=KaRcBVpR,comment-id=00000000,timestamp=2017-12-29T11:25:05.782+0000)\n>\n> they are throwing away their own time too\n\nThey aren't though, they're having fun knowing that it's pissing you off.","replies":[]}]}]},{"poster":"Zezilian","date":"2017-12-29T13:27:28.963+0000","up_votes":3,"down_votes":0,"body":"I just won a game 4v5, where one of my players was trolling in all possible ways because we didn't have a jungler. Dude was afk at first, then started inting and then massive flaming like \"you won... but your mom is losing her battle with ******\" or \"plus your dead mother's corpse rotting with ******\".\nAnd we still won  53 kills to 38 :D\n\nps. yeah, got instant feedback about our toxic 5th player's punishment. ","replies":[]},{"poster":"FooDang","date":"2017-12-29T12:35:35.166+0000","up_votes":3,"down_votes":1,"body":"If its my last game of the day Im not going to surrender bro.","replies":[]},{"poster":"Mindspeaker","date":"2017-12-29T12:57:00.524+0000","up_votes":3,"down_votes":2,"body":"Some people realize this is just a video game  ( even in ranked) and have _**fun simply Playing the game during the match**_ no matter  if it is a win or lose \n\neven if  the outcome is a steam roll win or loss.\n\nAlso no retreat no surrender ever once and a while you can actually turn a loss into a win.\n\n*#*alwaysvoteno","replies":[]},{"poster":"YerroFever","date":"2017-12-29T20:44:07.233+0000","up_votes":2,"down_votes":1,"body":"I won a 3v5 once...\n\nEDIT: thus why I don't like surrendering in general.","replies":[]},{"poster":"Best Vi Earth","date":"2017-12-30T10:18:11.517+0000","up_votes":1,"down_votes":0,"body":"to be fair i almost won a 3v5 and we were 3v5 the whole game. but generally i would always surrender during those times. i value my time. the big thing you have to look at is player skill and evaluate carefully if you are better than the other team by far go for it. if your equal or doing worse then always surrender those.","replies":[]},{"poster":"ZenaSpiritdragon","date":"2017-12-30T00:54:58.117+0000","up_votes":1,"down_votes":0,"body":"Usually when I refuse to surrender in a 4v5 is because we're winning even without the 5th person... but then a surrender vote isn't often called for in those games. I've been in two 4v5 games this week that we actually pulled through and won, so that's why I wouldn't necessarily always vote to surrender. It's different if we're losing badly though, then sure I'll vote to.","replies":[]},{"poster":"emanon dupits","date":"2018-07-20T05:12:52.129+0000","up_votes":1,"down_votes":1,"body":"because riot wont make it simple majority, stop spending money on them until they fix it.","replies":[]},{"poster":"Jo0o","date":"2017-12-29T14:14:24.599+0000","up_votes":1,"down_votes":2,"body":"Much of the time where I'm losing, I can rationalize it as luck, lag, or one-time mistakes. For better or for worse, I believe that I'm a good skillshot away from winning a given fight. If that's the case, sure, I'm probably not down to surrender unless the odds are truly overwhelming.","replies":[]}]}