{"poster":"FireFoxe","date":"2015-09-25T23:23:17.203+0000","title":"How does one get to a Riot Employee","subforum":"Concepts & Creations","up_votes":5,"down_votes":7,"body":"Alright so I have an idea for a Christmas {{champion:39}} Skin, but I cannot draw to save my life. I do not want to ask someone to draw it as they may take credit for the idea. I am wondering if there was any way to contact or be contacted by a Riot Employee that handles skin ideas and submit it that way. Otherwise I may have to contact an outside source and possibly the idea.\r\n\r\nFireFoxe (NA Server)","replies":[{"poster":"Kindlejack","date":"2015-09-26T07:28:19.184+0000","up_votes":5,"down_votes":0,"body":"Posting ideas in Skins & Champion Concepts is a pretty good way to get noticed. As a concept artist on the skins team I am often trawling through to see what players are coming up with.","replies":[{"poster":"Darkman1770","date":"2015-09-27T23:54:13.155+0000","up_votes":1,"down_votes":0,"body":"ever thought why is there not been a champion that turns into a werewolf or a champions that recovers health by mauling its fellow champions theres isnt one which is why there should be a champion that can sprint in a combat only way or be able to increase its teeth there is warwick but what if warwick was revamped like this were his ult is turning him into a werewolf with new abilities a bit like jayce and in another form he is a giant cyclops which isn't in the game currently and have him shoot lasers from his eyes whatever be honest these are champion idea's we don't have so comment bellow and share your views. who would want this idea","replies":[]}]},{"poster":"FireFoxe","date":"2015-09-26T15:10:31.995+0000","up_votes":1,"down_votes":0,"body":"I'll try their Twitter thanks\n\nand in reply to kindlejack, I don't really want to post the idea out in the open... lol cause then it could be forgotten and someone will come along and scoop it right up if its a half decent idea","replies":[{"poster":"Kindlejack","date":"2015-09-26T17:02:04.914+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=FireFoxe,realm=NA,application-id=A8FQeEA8,discussion-id=JeE2yjNX,comment-id=0002,timestamp=2015-09-26T15:10:31.995+0000)\n>\n> I'll try their Twitter thanks\n> \n> and in reply to kindlejack, I don't really want to post the idea out in the open... lol cause then it could be forgotten and someone will come along and scoop it right up if its a half decent idea\n\nOkay I understand, but to be clear when I say I'm a concept artist on the skins team that means my job is to come up with ideas for skins and then design them. So if you want to talk about skin ideas then I'm your guy.","replies":[{"poster":"Køí","date":"2015-09-27T18:42:57.966+0000","up_votes":1,"down_votes":0,"body":"So if I draw up a skin or champ concept can I send an email to you personally? Cuz in that way I'd be sure it's been viewed by a Riot employee.","replies":[{"poster":"Kindlejack","date":"2015-09-29T07:03:30.044+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Akira Heroga,realm=NA,application-id=A8FQeEA8,discussion-id=JeE2yjNX,comment-id=000200000003,timestamp=2015-09-27T18:42:57.966+0000)\n>\n> So if I draw up a skin or champ concept can I send an email to you personally? Cuz in that way I'd be sure it's been viewed by a Riot employee.\n\nFeel free to email it to me. I can't promise a reply because I get a lot of email but I will definitely see it >:D","replies":[{"poster":"Køí","date":"2015-09-30T03:20:01.629+0000","up_votes":1,"down_votes":0,"body":"Thank you for replying and i understand as riot members you guys receive a lot, but its good to know you'd check our ideas :) thanks again","replies":[]}]},{"poster":"FireFoxe","date":"2015-09-27T19:57:06.254+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Akira Heroga,realm=NA,application-id=A8FQeEA8,discussion-id=JeE2yjNX,comment-id=000200000003,timestamp=2015-09-27T18:42:57.966+0000)\n>\n> So if I draw up a skin or champ concept can I send an email to you personally? Cuz in that way I'd be sure it's been viewed by a Riot employee.\n\nRiot probably looks at all the posts eventually, I mean this was my first post on the forums ever and it was answered within a day. So if you post it'll probably be seen. I mean I just have an idea but no drawing skills what so ever, and I'm a paranoid ******* who doesn't want someone to draw my idea up and post as their own. I just want to know if my idea is plausible and have it drawn up if so.","replies":[{"poster":"Køí","date":"2015-09-28T00:21:44.842+0000","up_votes":1,"down_votes":0,"body":"It's just I see a ton of awesome artwork and ideas and only a few get feedback from employees so it kinda makes me wonder whether all the others are seen at all. But I suppose you're right that they probably do look through most and comment on ones they like.","replies":[]}]}]},{"poster":"Fateborn","date":"2015-09-26T20:41:42.395+0000","up_votes":1,"down_votes":0,"body":"So you saw my Glitch Mordekaiser skin concept as well?","replies":[{"poster":"Kindlejack","date":"2015-09-27T01:07:34.981+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fateborn,realm=NA,application-id=A8FQeEA8,discussion-id=JeE2yjNX,comment-id=000200000001,timestamp=2015-09-26T20:41:42.395+0000)\n>\n> So you saw my Glitch Mordekaiser skin concept as well?\n\nI did","replies":[]}]},{"poster":"Nicorus ","date":"2015-09-26T17:38:39.601+0000","up_votes":1,"down_votes":0,"body":"Can we get a fancy doorman Braum?","replies":[]},{"poster":"TerraRising","date":"2015-09-27T03:46:18.051+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Kindlejack,realm=NA,application-id=A8FQeEA8,discussion-id=JeE2yjNX,comment-id=00020000,timestamp=2015-09-26T17:02:04.914+0000)\n>\n> Okay I understand, but to be clear when I say I'm a concept artist on the skins team that means my job is to come up with ideas for skins and then design them. So if you want to talk about skin ideas then I'm your guy.\n\nWell, I've been suggesting skins for Yorick for past four years... No luck, though.","replies":[]}]}]},{"poster":"FireFoxe","date":"2015-09-26T18:59:29.048+0000","up_votes":1,"down_votes":0,"body":"Your just who I was looking for, I must have read that too fast; I didn't notice you were a apart of that team. Is there a way to privately message you? That wold be wonderful.","replies":[{"poster":"Kindlejack","date":"2015-09-27T01:09:28.583+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=FireFoxe,realm=NA,application-id=A8FQeEA8,discussion-id=JeE2yjNX,comment-id=0003,timestamp=2015-09-26T18:59:29.048+0000)\n>\n> Your just who I was looking for, I must have read that too fast; I didn't notice you were a apart of that team. Is there a way to privately message you? That wold be wonderful.\n\nhttp://sunnykoda.deviantart.com/ is me, otherwise you can email me from my website: http://sunny-koda.com/","replies":[{"poster":"Caytheles","date":"2015-09-27T10:20:53.117+0000","up_votes":1,"down_votes":0,"body":"You were responsible for SG Rumble? YOU ARE MY HERO, Do you plan on making more Super Galaxy skins? plz plzplzplz they would sell almost as much as the Project skins.","replies":[{"poster":"Kindlejack","date":"2015-09-29T07:02:40.001+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Caytheles,realm=NA,application-id=A8FQeEA8,discussion-id=JeE2yjNX,comment-id=000300000002,timestamp=2015-09-27T10:20:53.117+0000)\n>\n> You were responsible for SG Rumble? YOU ARE MY HERO, Do you plan on making more Super Galaxy skins? plz plzplzplz they would sell almost as much as the Project skins.\n\nSuper Galaxy and Neon Strike are kind of our nod to anime. I love anime and I'm certainly not alone in that respect. Will we see a Prison School Talon? Probably not. But I am sure we will see some more anime inspired skins in the future!","replies":[{"poster":"Caytheles","date":"2015-09-29T07:55:47.691+0000","up_votes":1,"down_votes":0,"body":"Thank you for the Reply!!! , (also nice Prison School add, but i think Fiora has that one already) \n\nJust afew that i think might work.\n\nS.O.X Twisted Fate (underwear on the Head)\n\nSchoolgirl Yorick (Gakkou Gurashi!)\n\nPart Time Azir (Devil is a Part Timer) \"The Order has been Made!!!\"\n\nShinigami Riven (Bleach) (Black kimono,  Normal Katana, Ult turns it into a Greatsword and her ult is basically Getzuga Tensho)\n\nElementalist Janna (Legend of Korra) Maybe an ultimate skin.\n\nI am not the Biggest Anime fan, due to my short memory of everything. but just afew i thought were nice.","replies":[]}]}]},{"poster":"COWmanLord","date":"2015-09-27T01:37:28.934+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kindlejack,realm=NA,application-id=A8FQeEA8,discussion-id=JeE2yjNX,comment-id=00030000,timestamp=2015-09-27T01:09:28.583+0000)\n>\n> http://sunnykoda.deviantart.com/ is me, otherwise you can email me from my website: http://sunny-koda.com/\n\nSince you took the time to reply to a players post I just have to ask.\n\nDoes it ever stress you guys out how much crap ends up about how much people hate everything or by now have you just kind of accepted that the internet is where people go to rage and you can never satisfy everyone? I know even I get pissed sometimes reading all the that comments and they aren't even directed at me.\n\nEither way thanks for taking the time to respond to this guy and answer his question. Even if sometimes reddit and the forums act like riot does nothing for players, at least most know they do (or they just don't really care either way and just feel mild appreciation from time to time:P)","replies":[{"poster":"Kindlejack","date":"2015-09-29T07:00:00.543+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=COWmanLord,realm=NA,application-id=A8FQeEA8,discussion-id=JeE2yjNX,comment-id=000300000000,timestamp=2015-09-27T01:37:28.934+0000)\n>\n> Since you took the time to reply to a players post I just have to ask.\n> \n> Does it ever stress you guys out how much crap ends up about how much people hate everything or by now have you just kind of accepted that the internet is where people go to rage and you can never satisfy everyone? I know even I get pissed sometimes reading all the that comments and they aren't even directed at me.\n> \n> Either way thanks for taking the time to respond to this guy and answer his question. Even if sometimes reddit and the forums act like riot does nothing for players, at least most know they do (or they just don't really care either way and just feel mild appreciation from time to time:P)\n\nI'm going to be honest; yes of course it does! We care so much about players and we are players ourselves, so when people have concerns we often share them and can easily get really caught up in player reactions. When I feel something about our game and then I read people who feel the same I feel like I need to get up and do something about it right away, but that's not always productive. We always make sure we are getting context on decisions, understanding the problem spaces and trusting in each other first. It's so important for the health of the company that we make sure we have all the data and insights and trust before we go leading a crusade.\n\nIt can also be disappointing when people spread misinformation or just don't have the information to really understand what is happening. I have to be careful of how I word things on the boards because I don't want what I say to be misinterpreted or accidentally say something I don't intend to imply. I want to provide as much context as I can but sometimes I can't help as much as I'd like to. Sure I knew the Bildgewater event was coming and there would be some awesome lore soon, but I wasn't in a position to tell lore fans and assuage their frustration before the event. That's a difficult part of my job - being on the inside with all the information but also being a player and a part of the community.\n\nWhen it comes to negative feedback I always try and find the positive in it by identifying the real problem underlying the frustration so we can address it. The way I see it players wouldn't bother posting if they didn't care a lot. I really appreciate that they obviously do!","replies":[]}]},{"poster":"EvilMerodach","date":"2015-09-27T09:56:31.709+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kindlejack,realm=NA,application-id=A8FQeEA8,discussion-id=JeE2yjNX,comment-id=00030000,timestamp=2015-09-27T01:09:28.583+0000)\n>\n> http://sunnykoda.deviantart.com/ is me, otherwise you can email me from my website: http://sunny-koda.com/\n\nCan I make this my summoner icon/splash art/a giant image of it pop up when everyone on my team hits level 9? ..and change bottom text to '*Upgrade* Your Trinket'\n\nhttp://orig05.deviantart.net/9d69/f/2014/198/d/e/lol_propaganda__jinx_is_doing_her_part_by_sunnykoda-d7r682m.jpg\n\n\nAlso:\n\nhttp://img10.deviantart.net/e549/i/2010/199/5/8/colossus__crab_by_sunnykoda.jpg\n\nFeatured Game Mode!!1one!\n\nScuttler's Revenge\n\nSort of like Doom Bots of Doom, with a touch of Poro King, but with that thing on the doom bot's side.","replies":[]}]}]},{"poster":"Darkman1770","date":"2015-09-27T23:56:51.255+0000","up_votes":1,"down_votes":0,"body":"ever thought why is there not been a champion that turns into a werewolf or a champions that recovers health by mauling its fellow champions theres isnt one which is why there should be a champion that can sprint in a combat only way or be able to increase its teeth there is warwick but what if warwick was revamped like this were his ult is turning him into a werewolf with new abilities a bit like jayce and in another form he is a giant cyclops which isn't in the game currently and have him shoot lasers from his eyes whatever be honest these are champion idea's we don't have so comment bellow and share your views. would anybody want this","replies":[]},{"poster":"FireFoxe","date":"2015-09-27T14:58:02.313+0000","up_votes":1,"down_votes":0,"body":"Thanks Kindle, I will take you up on those once I have time since I'm busy in College.\nYou may get spammed from posting those so you can take them off if you need too I don't want to be the cause of spam or pointless complaints, this topic already has gone off topic in my opinion as it was about contacting.  :p","replies":[]},{"poster":"nightsharks","date":"2015-09-25T23:45:42.408+0000","up_votes":1,"down_votes":0,"body":"Talk to their twitter @riotsupport, they answer every single tweet within a few hours usually. I'm sure they can be much more helpful than the general playerbase :)","replies":[]}]}