{"poster":"mid Phil","date":"2016-04-28T22:22:15.862+0000","title":"3 Eingespielte Mates suchen + 2 für Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey!\r\nWir zwischen 22-23 Jahren suchen noch 2 f&uuml;r ein teamaufbau. \r\n\r\nDaf&uuml;r suchen wir einen ADC und einen Jungler. Ihr solltet mindestens 18 sein und Gold Elo spielen. \r\n\r\nBevorzugt suchen wir einen jungler der eher Tank jungler spielt! \r\nDer ADC sollte jeden ADC vorweisen k&ouml;nnen. \r\n\r\nIhr solltet kritikf&auml;hig und lernwillig sein. Wir sind meist von MO--DO abends online + Wochenende. Freitag und Samstag Abend eher selten. \r\nDer jungler sollte auch shotcaller Qualit&auml;t besitzen. \r\n\r\nBei Interesse am besten adden UND hier drunter Posten da ich eventuell erst ab Montag wieder online bin. [umzug] \r\n\r\nMit freundlichen Gr&uuml;&szlig;en \r\n\r\nGottke","replies":[{"poster":"Mipha","date":"2016-04-29T05:46:58.439+0000","up_votes":3,"down_votes":1,"body":"Hallöchen,\n\nwenn du möchtest kannst du dir ja gerne Mal unsere Forum Werbung anschauen:\n\nhttp://boards.euw.leagueoflegends.com/de/c/clans-teams-de/MKbf17v7-magic-mirror-a18-multigaming-community-sucht-dich\n\nWir sind eine neu Gegründete ü18 Multigaming Community und haben einen Altersdurchschnitt von ca. 22 Jahren.\nBei uns findest du neben einem aktiven Forum außerdem täglich genug Mitspieler/innen für ein paar gemütliche Runden durch die Kluft.\n\nFalls du Fragen hast kannst du dich gerne an mich wenden.\n\nLiebe Grüße\nmôonchild","replies":[]},{"poster":"AI Ottobiersack","date":"2016-04-30T15:06:46.646+0000","up_votes":1,"down_votes":0,"body":"Hier haben sich aj schon einige gemeldet.\nIch hoffe es ist noch ein platz frei :D\nIch könnte die Rolle des ADC übernehmen\n\nmfg q2G Jimin","replies":[]},{"poster":" shoxZs","date":"2016-04-29T13:05:01.270+0000","up_votes":1,"down_votes":0,"body":"Hey ;) also ich war seaon 4 und 5 Gold http://www.lolking.net/summoner/euw/20279460 hier mein LoLking profil\ndieser account wurde aber perma gebannt wegen \"Illegal Programm using\", hatte zwar immer nur OBS und TS3 open aber das erkläre mal dem Support ^^\n\nnundenn hatte zum glück noch ein anderen account der ist nun allerdings bronze 1 erst, ich werde den so gut wies geht hoch ranken ;)\nhttp://www.lolking.net/summoner/euw/20677462 hier das lolking profil dazu ;) da sieht man auch das ich ADC main bin und auch gut bin\n\nzu meiner person:\nich bin 21 Jahre jung heiße Kevin und komme aus dem schönen Sachsen ;)\nmeine Online Zeiten sind unterschiedlich aber normal bin ich jeden tag online außer ich kann nicht wegen arbeit, das wird aber vorher rechtzeitig gesagt von mir ;)\nich würde gern mal wieder ein paar kleine cups spielen und einfach mal wieder das team Feeling haben\n\nIn Teams wo ich schon gespielt habe: Vexation Gaming, Die Krassen 5, Play4Victory\n\nwenn ihr also noch interesse an einem Main adc since season 1 habt dann meldet euch und addet mich IGN: CxYxBxExR\n\n\nMFG","replies":[]},{"poster":"play a faya","date":"2016-04-29T13:00:47.012+0000","up_votes":1,"down_votes":0,"body":"Hab dich mal geaddet.\nIch bin Main Jungle, meine zweite Rolle ist Support.\nEure Anforderung der tanky Jungle Champs kann ich glaub ganz gut erfüllen (Udyr, Trundle, Shyvanna, Amumu, Gragas, Volibear gehören alle zu meinen Champion Pool).\n\nBin übrigens auch 23, bevorzugte Spielzeiten sind ab ca. 17 Uhr. Wenn ihr mal probe zocken wollt, einfach ingame anschreiben :-)","replies":[]},{"poster":"Pearli","date":"2016-04-29T05:53:56.824+0000","up_votes":1,"down_votes":0,"body":"Hi,\n\nKannst mich ja mal adden. Hatte Lust wieder mal adc zu spielen. Bis jetzt sind die gängigen adc vorhanden (wer spielt schon draven)","replies":[]},{"poster":"Terrorrocky187","date":"2016-04-29T05:53:17.378+0000","up_votes":1,"down_votes":0,"body":"Hab dich mal geaddet, bin Main Adc und würde es mit euch mal versuchen.","replies":[]},{"poster":"NGC Polyxena","date":"2016-04-29T05:41:41.804+0000","up_votes":1,"down_votes":3,"body":"Guten Morgen Gottke,\n\nfalls ihr neben der reinen Teamsuche auch Interesse daran hättet euer Team innerhalb einer Community aufzubauen würde ich euch gerne dazu einladen euch unsere Vorstellung anzusehen:\n\n[★ Nerds Go Casual | ü18 Multigaming Community lädt zum Zocken ein ★](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/sQr3vvV9-a-nerds-go-casual-a18-multigaming-community-laadt-zum-zocken-ein-a) \n\nWir sind bisher noch ein recht überschaubares Trüppchen von ca. 55 Mitgliedern mit einem Altersdurchschnitt von 23 Jahren. Interesse an Teams ist bei uns durchaus vorhanden nur fehlt es meist an Leuten, die bereit sind ein Team aufzubauen und zu leiten. \n\nSolltet ihr neben unserer Vorstellung und den Informationen auf unserer Homepage noch Fragen haben könnt ihr euch gerne an mich wenden.\n\nLiebe Grüße\nP0lyxena | Julia","replies":[]}]}