{"poster":"Raumschiffmann","date":"2018-11-06T23:42:20.714+0000","title":"Danke für dieses Spiel Riot...","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":6,"body":"Ich wei&szlig; gar nicht genau, wie ich die letzten Monate und deren Spielerfahrung in Worte fassen soll. Dies ist mein erster POst im Forum seit 3 oder 4 Seasons. Ich wei&szlig; nicht genau wie lange ich bereits spiele. Ich biin 34 und das Spiel hat mir immer mega viel Spa&szlig; gemacht, da ich immer mehr dazulernen konnte. Am Anfang wusste ich nat&uuml;rlich dass ich ein harter Noob bin aber ich habe mich viel mit dem Spiel befasst. Ich habe irgendwann gelernt dass farmen wichtig ist, also habe ich mir kleine Tabellen gemacht in denen ich meine Fortschritte aufgeschrieben habe. Dann habe ich gelernt dass Obj. wichtig sind. Beim laufen angreifen etc. In der letzten Season habe ich mir sogar meinen Silberrahmen verdient was f&uuml;r mich ziemlich nice war. Mittlerweile w&uuml;rde ich aber sagen, dass ich recht gut geworden und ich habe viel Arbeit in das SPiel gesteckt und vor allem mehrere 100 Euro. \r\n\r\nDas heisst irgendwie bin ich schon ein wenig h&auml;ngen geblieben an dem Spiel und mein gro&szlig;es Ziel war zum Ende der Season Gold zu erreichen, was mit meinem Veigar locker drin gewesen w&auml;re. Ich hatte bei einer MENGE matches &uuml;ber 70% winrate und bin somit auch schnell aufgestiegen bis Silber 1. Aber die letzten Monate macht mich Riots Spielsystem nur noch fertig. Ich muss mich zusammenreissen nicht ausfallend zu werden...\r\n\r\nIch bin in den letzten 2 Wochen, von Silber 1 bis auf Silber 5 runtergerutscht weil ich - ich wei&szlig; viele Leute in dieser Sommunity behaupten dass - in 8 von 10 Spielen mindesten 4 mal AFK Leute im Team habe 2 mal heftige Trolls und in 7 von 8 F&auml;llen Feeder die nach 12 minuten 0/6 stehen. \r\n\r\nWIe oben schon beschrieben habe ich sehr viel getan um besser in dem Spiel zu werden aber ich bin kein Platin Smurf und ich wei&szlig; nicht wie man ein Spiel in dem dein Mitspieler seinem Gengner mit 6/0 ins Spiel snowballen l&auml;sst solocarried. Ich kann es einfach nicht, daf&uuml;r bin ich nicht gut genug. Aber muss man mir dann von Silber 1 bis Silber 5 ausschlie&szlig;lich schlechte Teams geben. DIe statistikseiten zeigen mir bei jedem SPiel an Teammatching f&uuml;r mich worst. Und mit jedem Spiel rutscht meine geheime Riot Punktezahl weiter in den Keller. Ich werde mittlerweile nur noch gef&uuml;hlt mit wooddivision gematched. Meine Gegner hingegen haben den 7/0 lee sin nach 6 Minuten. oder den 18/2 Yasuo und ich immer den 0/7 lee Sin oder 2/18 Yasuo.\r\n\r\nin Silber 3 bin ich auf 4 rerutscht, habe mich direkt hochgecarried auf 3 um dann in den n&auml;chsten 4 Spielen, ungelogen 3 Spiele AFK hatte und eins troll und zack wieder 4. Das ist mir 6 mal passiert. Sofort aufgesteigen und 6 mal wieder abgestiegen ohne auch nur einen hauch einer chance irgendwie gegen den Feed anzugehen. \r\n\r\nIch wei&szlig; das jetzt wahrscheinlich die ganzen diamond gold und platin Spieler wieder ihre KOmmentare ablassen, die meiner Meinung nach einfach total realit&auml;tsfremd sind. Wenn ich nicht besser bin geh&ouml;re ich in die Liga und das gegnerische Team hat die sogar noch schlechtere Chancen auf Feeder weil du ja in deinem bist. Ja ja kennen wir alles. Nat&uuml;rlich w&uuml;rdet ihr in den gleichen Spielen mit Afk trotzdem gewinen....weil ihr Highelo seid. \r\n\r\nVersetzt euch mal in die Lage eines Spielers wie mich der bei jeder Umfrage von Riot nur noch sagen kann. Mein Spielerlebnis ist so schlecht wie es &uuml;berhaupt nur geht. Das Spiel ist nur noch frustrierend, weil im ranked gef&uuml;hlt ausschlie&szlig;lich Leute unterwegs sind denen es scheiss egal ist das die Season bald vorbei ist und man noch sein ziel erreichen will. VOr ein paar spielen picked einer Ivern first time und sagt: mir doch scheiss egal wenn ich feede, was meinst du warum ich Ivern picke, weil mir das Spiel scheiss egal ist...und steht 0/7\r\n\r\nin den letzten 10 SPielen hatte ich 6 mal Trolls. Ein paar konnten wir zu zweit gewinnen. \r\n\r\nIhr werdet mir sagen, wenn das Spiel doch keinen Spa&szlig; macht warum spielst du es dann? Weil ich sehr viel Geld und Zeit in dieses Spiel investiert habe und ich nichts anderes habe! &Uuml;ber Jahre hat mich dieses SPiel gepackt und hat mir freude bereitet, dazu kommt dass ich mir ein Ziel gesetzt habe und zwar Gold zu werden. Ich habe gestern Nacht bis 4 Uhr am Rechner gesessen, den ganzen Tag versuche ich mein Ziel noch irgendwie zu erreichen, weil ich doch Silber 1 war (und das ohne Probleme) aber jedes Spiel wird schlimmer, jeder Tag wird schlimmer und es macht mich nur noch fertig. Ich bin gereizt und rage nur noch und kann mich kaum konzentrieren weil jedes neue Spiel nur M&uuml;ll ist. Und das Ziel r&uuml;ckt immer weiter weg und die Stimme im Kopf sagt einfach nur du bist scheisse du bist du zu kacke f&uuml;r das Spiel. Und das alles ausgel&ouml;st durch diese unfaire MAtchmakingsystem und das System bei dem jedes kleine schlimme Wort sofort bestraft wird aber Trolls Leuten wie mir die einfach nur Spa&szlig; und f&uuml;r sich ein wenig Erfolg auf niedrigem Lvl haben wollen die komplette Freude am Spiel nehmen. Ich sitzte hier seit Tagen umsonst. Ich bin mittlerweile Silber 5 mit 10 Punkten...\r\n\r\nUnd ja ich Spiele auch jedes Spiel schlechter mittlerweile von einem 70% Veigar der in allen Bereichen SS hatte, sei es farm, Schaden, Obj, Sichtwetung und Roam auf einen ragelastigen toxischem Spieler der jegliche Freude an diesem Spiel verloren hat und das meine ich so wie ich es sage, bedingt durch RIOTs System. \r\n\r\nIch spiele im &uuml;brigen auf anderen Acc ab und an mit Kumpels die Platin oder Dia sind und kann da Ok mithalten. Nat&uuml;rlich sind die Welten besser aber Bronze 1 oder Silber 5 ist absolut ungerechtfertigt. \r\n\r\nEigentlich wollte ich mir dem Post einfach mal alles von der Seele reden. Die letzten Wochen in diesem Spiel sind zum ***** und ich hoffe, dass es vielleicht ein Mitarbeiter von Riot durch zufall sieht und beim n&auml;chsten Meeting, sich f&uuml;r die kleinen Leute einsetzt. Ein Spiel sollte einem nicht das Gef&uuml;hl geben dass man scheisse ist. \r\n\r\nLiebe Gr&uuml;&szlig;e und sorry f&uuml;r die vielen Rechtschreibfehler und fehlenden Satzzeichen.","replies":[{"poster":"Jinx1967","date":"2018-11-07T01:55:39.021+0000","up_votes":10,"down_votes":1,"body":"Wirf mal einen Blick auf dein op.gg: http://euw.op.gg/summoner/userName=Raumschiffmann+\n\nVon deinen sieben meist gespielten Champs hat nur einer eine positive Winrate und das ist Veigar. Alles andere kannst du schlichtweg nicht spielen. insbesondere sowas wie ne 27% Winrate auf Tryndamere ist schon eine Kunst.\n\nWenn wir in deine History blicken, dann sehen wir auf dem Weg zu Silber 1 enorm viele Wins mit Veigar. Und deine Losses jetzt sind überwiegend anderne Champs. Du bist praktisch ein Veigar Onetrick und genauso musst du dich auch sehen. Du kannst nicht ernsthaft mit deinem Main climben und dann erwarten, dass du das Skilllevel mit andernen Champs ebenfalls halten kannst.\n\nUnd bevor das hier in irgendwelche Elohell Diskussionen ausartet: In deinen letzten 56 Games hast du genau mit einem einzigen Champ eine positive Winrate und das ist selbstverständlich Veigar. Ist es Zufall, dass das genau der Champ ist, mit dem du auch geclimbt bist? Haben dich die ganzen Trolls genau in diesen Games verschont? DIe Wahrheit ist, dass du mit anderen Champs deutlich schlechter bist. Und wärst du selbstkritisch genug, wäre dir das schon längst aufgefallen. Also vielleicht nochmal hinterfragen, wer in deinen letzten 50 Games wirklich das Problem war. Ich sage ja nicht, dass du nicht  ein wenig Pech gehabt haben kannst in letzter Zeit, aber mehr auch nicht.\n\nIch wette mir dir, dass wenn du nur noch Veigar spielst, du in kürzester Zeit wieder Silber 1 bist.\n\n>  und ich hoffe, dass es vielleicht ein Mitarbeiter von Riot durch zufall sieht und beim nächsten Meeting, sich für die kleinen Leute einsetzt. \n\nDas ich verstehe ich absolut nicht. Denkst du Riot detected irgendwie Trolls und Afkler und wirft die in deine Games, um dir den Spielspaß zu rauben? Zu welchem Zweck? Das ist nun wirklich absurd. Riots Matchmaking hat absolut nichts damit zu tun.","replies":[]},{"poster":"ELOW Cronos","date":"2018-11-07T08:23:41.433+0000","up_votes":5,"down_votes":0,"body":"Du solltest dich vielleicht mal etwas objektiver betrachten.\n\nDu kannst laut OP:GG nur einen einzigen Champion spielen: Veigar\nDu spielst momentan in Ranked alles bis auf Veigar.\nErgo:\n\nDas du verlierst hat nichts mit Trollen, Feedern oder AFKs zu tun, sondern mit deiner Championauswahl und wahrscheinlich einer ordentlichen Portion Tilt.\n\nNaja diese Season musst du (so wie ich) deine Ziele wohl im Sand vergraben. Aber Kopf hoch. Nächste Season einfach mehr Veigar und weniger andere Champs/Rollen spielen, dann klappt das auch mit Gold.","replies":[]},{"poster":"Lasse Laufen","date":"2018-11-07T07:35:53.898+0000","up_votes":1,"down_votes":0,"body":"Spiel einfach nächste Saison, irgendwie sind nurnoch komische Leute unterwegs.\n\nHabe im Moment auch nur Games bei denen einer meiner Teammates, oder ein Gegner stark gefeedet ist.\n\nEs ist jedoch so, auch wenn du nicht carryst steigst du auf. Du musst nur konstant besser sein als dein Lane-Gegner. Man muss nicht jedes Game carryn und einen positiven Score haben. Es reicht wenn du nur einen besseren als dein Gegenspieler hast, auch wenn beide eher bescheiden sind.","replies":[{"poster":"Raumschiffmann","date":"2018-11-07T09:51:53.126+0000","up_votes":1,"down_votes":0,"body":"Das werde ich versuchen zu verinerlichen und mir für die nächst Saison vorzunehmen. Wenn man nur noch hardtried kommt auch nur Müll bei rum. Siehe mein Op.GG xD","replies":[{"poster":"Lasse Laufen","date":"2018-11-07T10:31:47.970+0000","up_votes":4,"down_votes":0,"body":"Wenn ich mir dein OP.GG anschaue ist es recht einfach:\n\nNächste Saison entspannt Veigar spielen und Gold kommen. \n\nKannst ja auch die Saison versuchen, musst nur Veigar durchspammen und darfst nicht flamen/ tilten.","replies":[{"poster":"Sirrkas","date":"2018-11-07T10:54:19.325+0000","up_votes":3,"down_votes":0,"body":"Könnte mit nicht mal mehr einer Woche Zeit schwierig werden. Sieht mir aktuell nach einer S5 MMR aus. Vor dem Absturz hätte es mit ein wenig Glück noch eher geklappt.","replies":[{"poster":"Raumschiffmann","date":"2018-11-07T13:26:52.717+0000","up_votes":2,"down_votes":0,"body":"Ich habe auch mit diesem Thread die Realität anerkannt xD\n\nWenn ich heftig wäre würde ich es in ner Woche vielleicht schaffen aber da ich diesen THread verfasst habe bin ich nicht heftig \n\n{{sticker:sg-zephyr}}","replies":[]}]}]}]}]},{"poster":"Sirrkas","date":"2018-11-07T10:24:23.125+0000","up_votes":4,"down_votes":0,"body":">Ich weiß das jetzt wahrscheinlich die ganzen diamond gold und platin Spieler wieder ihre KOmmentare ablassen, die meiner Meinung nach einfach total realitätsfremd sind. Wenn ich nicht besser bin gehöre ich in die Liga und das gegnerische Team hat die sogar noch schlechtere Chancen auf Feeder weil du ja in deinem bist. Ja ja kennen wir alles. Natürlich würdet ihr in den gleichen Spielen mit Afk trotzdem gewinen....weil ihr Highelo seid.\n\nDas wären nicht realitätsfremde Kommentare. Einzelne Spiele können durch Glück oder Pech entschieden werden. Auf deine grob 600 Rankeds bedeutet deine Winrate von etwas weniger als 50 % eben, dass du nicht nach Gold gehörst. \n\nPotential nach oben hast du noch. Du könntest dir etwa angewöhnen, jedes Spiel wenigstens 1 oder 2 {{item:2055}} zu kaufen und zu nutzen.\n\n>Versetzt euch mal in die Lage eines Spielers wie mich der bei jeder Umfrage von Riot nur noch sagen kann. Mein Spielerlebnis ist so schlecht wie es überhaupt nur geht. Das Spiel ist nur noch frustrierend, weil im ranked gefühlt ausschließlich Leute unterwegs sind denen es scheiss egal ist das die Season bald vorbei ist und man noch sein ziel erreichen will. VOr ein paar spielen picked einer Ivern first time und sagt: mir doch scheiss egal wenn ich feede, was meinst du warum ich Ivern picke, weil mir das Spiel scheiss egal ist...und steht 0/7\n\nHier könnte es auch sein, dass du deinem Rang einen zu hohen Wert beimisst. Wie wäre es, wenn du, statt auf Gold abzuzielen, eher die Steigerung deiner Fähigkeiten in den Vordergrund setzt? Vorteile davon wären, du bist nicht so frustriert, wenn du nicht aufsteigst und du steigst nebenbei auf, da deine gesteigerten Fähigkeiten das von selbst machen. Vorausgesetzt natürlich, du wirst dabei besser. \n\nBei dem was du so über Leute beschreibst, die sagen, \"mir doch egal, wenn ich feede\" frage ich mich, was davor vorgefallen ist. Ebenso zu den AFKlern. Du hast ja schon gemeint, du musst dich zusammenreißen um nicht ausfallend zu werden. Kann es sein, dass du wenigstens ein paar stichelnde Kommentare vorher abgelassen hast, die deine Mitspieler zu solchen Aussagen und Handlungen bewegen? \n\nWenn ich etwa gerne Soraka spielen würde und First Pick bin, wäre das letzte was ich brauche, jemand der mir vorwerfen will, dass ich auf Soraka nur verlieren und sterben kann. Ebenso wird es dem Ivern ergehen. Und wenn du ihm dann sagst, sein Pick ist nutzlos, wird ihn das am ehesten zu einer Trotzreaktion bewegen. Wie etwa dir zu sagen, dass es scheiß egal ist, wenn er 0/7 das Spiel beenden sollte.\n\nWobei man bei deinem Jinx Spiel mit 2/11/1 jetzt sicher nicht die ganze Schuld auf den Jungler abschieben kann. Ja, der Ivern hat 0/10/3 gespielt. Aber ihr alle hattet Tode in dem Bereich. Höchstens dem Xerath kann man da zugestehen, sich über unfähige Mitspieler aufregen zu dürfen, wenn wir nur nach KDA gehen.\n\nWobei du laut op.gg sogar schon in Minute 3 und 4 gestorben bist. Iverns erster Tod war bei Minute 5. Ich an deiner Stelle wäre also vorsichtiger, wenn ich anderen vorwerfen möchte, sie wären Feeder und unfähig.\n\n>in den letzten 10 SPielen hatte ich 6 mal Trolls. Ein paar konnten wir zu zweit gewinnen.\n\nSiehe dein Spiel mit Ivern, bei dem du Jinx warst. Nach deiner Beschreibung oben von Ivern, kann ich dir leider nicht mehr glauben, dass du richtige Trolle erkennen kannst bzw. selbst besser warst.\n\n>Über Jahre hat mich dieses SPiel gepackt und hat mir freude bereitet, dazu kommt dass ich mir ein Ziel gesetzt habe und zwar Gold zu werden. Ich habe gestern Nacht bis 4 Uhr am Rechner gesessen, den ganzen Tag versuche ich mein Ziel noch irgendwie zu erreichen, weil ich doch Silber 1 war (und das ohne Probleme) aber jedes Spiel wird schlimmer, jeder Tag wird schlimmer und es macht mich nur noch fertig.\n\nDas klingt so, als wäre dieses verbissene \"ich muss Gold werden\" dein eigentliches Problem. Du steigerst dich da zu sehr rein. Jede Niederlage ist für dich eine herbe Enttäuschung. Obendrein übertreibst du es auch noch mit dem Spielen. Ich kann mir gut vorstellen, dass die Mischung aus zu lange am Stück spielen und sich zu sehr von Niederlagen mitnehmen einer der größten Gründe dafür ist, dass du gerade so viele Niederlagen hast. \n\nDie Niederlage schadet deiner Motiviation und die vielen Spiele bis spät in die Nacht, werden nicht gerade dafür sorgen, dass du noch sonderlich konzentriert bist. Obendrein scheint es mir so, als würdest du dadurch auch anfälliger dafür werden, zu flamen. Was dann am Ende vielleicht sogar deine Seasonbelohnungen kosten kann, wenn du jetzt noch eine CR erhältst. \n\n>aber jedes Spiel wird schlimmer, jeder Tag wird schlimmer und es macht mich nur noch fertig. Ich bin gereizt und rage nur noch und kann mich kaum konzentrieren weil jedes neue Spiel nur Müll ist. Und das Ziel rückt immer weiter weg und die Stimme im Kopf sagt einfach nur du bist scheisse du bist du zu kacke für das Spiel. Und das alles ausgelöst durch diese unfaire MAtchmakingsystem und das System bei dem jedes kleine schlimme Wort sofort bestraft wird aber Trolls Leuten wie mir die einfach nur Spaß und für sich ein wenig Erfolg auf niedrigem Lvl haben wollen die komplette Freude am Spiel nehmen. Ich sitzte hier seit Tagen umsonst. Ich bin mittlerweile Silber 5 mit 10 Punkten...\n\nDas bestätigt ja meine Mutmaßungen. Ich denke eher, dass nicht das Matchmaking schuld ist, sondern eben du selbst. Du machst es dir unnötig schwer. Deine Einstellung zum Spiel ist es, warum es dir nicht mehr gefällt, du in Rage verfällst und gerade am absteigen bist. Es ist nichts schlimmes nicht Gold zu sein. Meine ersten beiden Seasons habe ich auch in Silber im Solo/Duo abgeschlossen. \nWenn du aktuell noch nicht nach Gold gehörst, wäre es besser für dich, das erst mal zu akzeptieren. Schieb den Fokus lieber auf Selbstverbesserung. Such dir ein paar gute Guides, schau deine Replays an und vielleicht hilft dir sogar ein Coach ein wenig. Wenn du erst an dir selbst arbeitest, wird es viel einfacher nächste Season dann Gold zu erreichen.\n\n>Und ja ich Spiele auch jedes Spiel schlechter mittlerweile von einem 70% Veigar der in allen Bereichen SS hatte, sei es farm, Schaden, Obj, Sichtwetung und Roam auf einen ragelastigen toxischem Spieler der jegliche Freude an diesem Spiel verloren hat und das meine ich so wie ich es sage, bedingt durch RIOTs System.\n\nNein, durch dich selbst. Nicht Riot will dich toxisch machen. Du selbst willst toxisch sein, weil du frustriert bist. \n\n>Ich spiele im übrigen auf anderen Acc ab und an mit Kumpels die Platin oder Dia sind und kann da Ok mithalten. Natürlich sind die Welten besser aber Bronze 1 oder Silber 5 ist absolut ungerechtfertigt.\n\nUnd? Ich hatte auch schon Spiele gegen Dia gewonnen. Wurde von Diaspielern für tolle Spielzüge als Support gelobt oder durfte mir anhören, dass andere Supporter absolut unfähig in meinem Bereich sind, Lasthits unter dem Turm vorzubereiten. \n\nDas heißt alles aber nicht, dass ich Dianiveau habe. Im Ranked würde es sicher wieder anders aussehen. Da strengt sich dann der Diagegner wieder richtig an. Habe ich gut an einem Mitspieler gesehen. Der war damals selbst Dia. Im Normal mit den Bronze bis Goldspielern hat er dann die unmöglichsten Fehler gemacht, weil er da einfach gierig wurde. Läuft alleine wenigstens 2 Gegnern in den ungewardeten Jungle hinterher und stirbt, weil da plötzlich 3 stehen. Da hat er selber drüber gelacht und gemeint, er spielt Müll zusammen. Wenn das auch nur einigermaßen repräsentativ für andere Diaspieler ist, werden die meisten wenigstens ein paar Divisionen niedriger im Normal spielen. Wodurch es dann für einen Goldspieler, der sich anstrengt, wiederum einfacher wird, sie zu besiegen.\n\n>Eigentlich wollte ich mir dem Post einfach mal alles von der Seele reden. Die letzten Wochen in diesem Spiel sind zum * und ich hoffe, dass es vielleicht ein Mitarbeiter von Riot durch zufall sieht und beim nächsten Meeting, sich für die kleinen Leute einsetzt. Ein Spiel sollte einem nicht das Gefühl geben dass man scheisse ist.\n\nDann nimm deine Niederlagen doch einfach nicht mehr zu ernst.","replies":[{"poster":"Raumschiffmann","date":"2018-11-07T10:42:15.930+0000","up_votes":4,"down_votes":1,"body":"Hey, \n\ndanke dass du so viel Arbeit in deine Antwort gesteckt hast. Ich habe den Thread aus Frust eröffnet und war vorher der festen Überzeugung dass diese Community nur noch Mist ist. Aber Leute wie du belehren mich eines Besseren.\n\nWas du sagst trifft sehr gut zu und danke für den guten Rat. In der Zeit in der ich mich NUR darauf konzentriert habe mit Veigar besser zu werden - sprich - besser farmen, obj. bekommen und einfach meine Fähigkeiten bin ich nebenbei von Bronze 5 bis Silber 2 ohne Probleme und mit SPaß. Mein Ziel Gold zu werden weil ich so nah dran war ist zu festgesetzt. Ich wurde aber schon so oft geflamed dass ich 3 oder 4 Jahre spiele und immer noch Silber bin, dass mich das sehr verletzt hat. Deswegen versuchge ich es zu erzwingen. \n\nWas ich aber noch sagen muss, ich habe in den letzten Wochen durchgehend /mute all gemacht, damit ich meine Mitspieler nicht ansticheln kann. bei dem Ivernspiel war ich selber mist aber das war nur ein Beispiel. Ich rage dann natürlich irgendwann aber immer erst nachdem schon alles verloren ist und ich keinen Einfluss mehr auf das verlorene Spiel habe. Dann löse ich den muite auf und raste vollkommen aus.  Das ist etwas an dem ich jetzt arbeite. \n\nAber der aller Beste Tipp scheint für mich zu sein. Mach eine Pause von dem Spiel. Die habe ich denke ich dringend nötig. Danke für dieses unfassbare gute Feedback!!!\n\nDanke!!!","replies":[{"poster":"Sirrkas","date":"2018-11-07T10:46:49.278+0000","up_votes":2,"down_votes":0,"body":"Mein Post ist vermutlich noch länger geworden, seit du ihn gesehen hast.\n\n>Ich wurde aber schon so oft geflamed dass ich 3 oder 4 Jahre spiele und immer noch Silber bin, dass mich das sehr verletzt hat. Deswegen versuchge ich es zu erzwingen.\n\nDas ist wirklich nichts verwerfliches. Nur grob ein Drittel erreicht Gold und höher. Es gibt auch Leute, die seit Season 1 spielen und noch immer Silber oder Bronze sind. Wenn dir andere vorhalten wollen, dass du bisher nie Gold erreichst hast, ist das deren Problem. \n\nAlleine wenn du die Leute aus deinem letzten Spiel ansiehst. Taric seit S3 Silber. Camille seit S3 Bronze und gerade so das zweite mal dabei eine Season in Silber 5 abzuschließen. Der Lucian bleibt seit S4 auch auf der Stelle und pendelt zwischen S4 und B1.\n\nDann dir noch viel Erfolg diese und nächste Season. ","replies":[{"poster":"Awsane","date":"2018-11-07T16:04:02.873+0000","up_votes":2,"down_votes":0,"body":"> Wenn dir andere vorhalten wollen, dass du bisher nie Gold erreichst hast, ist das deren Problem.\n\nWenn dir die Leute wichtig sind ist es auch dein Problem. Und machen wir uns mal nix vor, es gibt einige Personenkreise in denen dein LoL Rang sehr wichtig für deine soziale Stellung ist, auch wenn es nur ein Hobby ist. Gerade wenn man aktiv auch versucht besser zu werden.\n\nDas ist so, als ob man Langzeit Student ist und sich deine Freunde darüber lustig machen, dass man nix gebacken bekommt. Oder Jahrelang ein Hobby macht und in diesem Hobby trotz Anstrengung im vergleich zu anderen schlechte Leistung abliefert, dann wird man auch belächelt werden in den meisten fällen.\n\nAber natürlich wünsche auch ich viel Erfolg.","replies":[]}]},{"poster":"Heavenly Sir","date":"2018-11-07T16:14:38.437+0000","up_votes":1,"down_votes":0,"body":"Emissare sind keine normalen Spieler es sind GÖTTER!\n\nDeswegen sind deren Antworten auch so gut :)","replies":[]}]}]},{"poster":"Angel Ayume","date":"2018-11-07T00:21:02.525+0000","up_votes":3,"down_votes":1,"body":"Ich glaube nicht, dass du wirklich so tief gehörst, denn du hast ja eigentlich bereits bewiesen, dass du es durchaus nach Silber 1 schaffen kannst.\n\nIch glaube eher, dass du einfach zu schlecht gespielt hast, weil du getiltet warst oder bereits mit einem schlechten Gefühl ins Ranked gegangen bist.\n\nIrgendwann kam bei dir der Punkt, wo du bei zwei Toden einer Lane gedacht hast \"nicht schon wieder. Na das kann ja nichts werden\". Somit hast du automatisch selbst schlechter gespielt weil dich das getiltet hat.\n\nDein Problem scheint ganz klar dein Mindset zu sein.\nTilt, Frust, Wut, Verzweiflung. Führt alles dazu dass du schlechter spielst und das wiederum hat dich absteigen lassen.\nDas du mal Feeder oder auch mal nen Afkler hattest will ich nicht anzweifeln. Aber ich Zweifel sehr stark daran, dass du in jedem zweiten Game einen Troll oder Afkler hattest und die Schuld für deine Silber 5 Misere. \nEin Mitspieler der mal feedet kommt öfter vor, aber der ist nicht automatisch ein Troll oder gar ein Inter und auch nicht zwangsweise der Grund für den Lose.\n\nKonzentrier dich nur auf dich, ignoriere die KDA deiner Mates, toleriere ihre Fehler, immerhin sind sie keine Challenger. Du machst auch Fehler und es ist okay, also ist es das auch bei deinen Mates.\nEin Mate feedet? Okay. Dann muss ich eben fetter werden als der Gegner.\n\nEs liegt an dir ob du es vor Seasonende wieder nach Silber 1 schaffst (jenachdem wie viel Zeit du hast um zu spielen).\n\nEins noch zum Schluss. Das Matchmaking ist völlig in Ordnung. Es matched dich mit Leuten die deiner MMR entsprechen. Da ist nichts unfair oder falsch dran. Sind da Flamer drin oder sonstige toxische Spieler kann das Matchmaking nichts dafür. Auch Riot kann nichts für das Verhalten mancher Spieler. ","replies":[{"poster":"Raumschiffmann","date":"2018-11-07T09:57:20.192+0000","up_votes":1,"down_votes":0,"body":"DAnke für das Feedback, ja du triffst es zu 100%. Ich denke auch dass irgendwann der Moment gekommen ist in dem ich innerlich getillt bin. Ich mache schon extra /mute all aber wenn der 7/0 Lee nach 12 Minuten in die mitte kommt und mich einfach zerstört ist der Finger so locker. \n\nIch werde im nächsten Jahr einen neuen Char zusätzlich lernen aber am meisten werde ich wohl an meinem Mindset arbeiten müssen. Danke","replies":[{"poster":"Angel Ayume","date":"2018-11-07T11:13:14.922+0000","up_votes":3,"down_votes":0,"body":"Wenn der 7/0 Jungler kommt und dich in der Mitte tötet, dann hast du ganz klar einen Fehler begangen. Schiebe das nicht auf deine Mates. \nDu kannst zwar nichts dafür, dass der Lee 7/0 steht, wenn du an ihm keinen Kill abgegeben hast aber du kannst was dafür, wenn er dann 8/0 steht. ^^ \nHast du bedacht, dass er ganken könnte? Hast du dran gedacht zu warden, damit du ihn rechtzeitig siehst? Und wenn ja, hast du dann auch die Map gut genug im Auge behalten? Wenn du nicht weißt, wo der gegnerische Jungler sich aufhält, dann gehe immer davon aus, dass er in deiner Nähe ist. Halte dich dann zurück mit dem pushen, lass deinen Gegner reinpushen und farme nah am Tower. \nVersuch die Fehler immer bei dir zu suchen. \n\nIch gebe dir ein Beispiel aus einem meiner Games. \nIch spiele auch Midlane. Ich hatte eine Le Blanc als Gegner. In der Lane hab ich ihr 2 Kills gegeben, weil ich schlecht gespielt habe. Natürlich hatte ich da keine Chance mehr gegen sie. Am Ende des Games stand sie 17/x ich selbst hatte ihr bis zum Ende nur diese 2 Kills gegeben. Die restlichen Kills hatte sie von meinen Mates. \nMeine Toplane x/11, Jungle und Bot sind im early zwar ahead gekommen, haben mit ihrem Feed aber nichts angefangen und haben sich letztendlich auch von der Le Blanc killen lassen und ihr somit noch mehr Feed gegeben. \nNun frage ich dich, wer ist Schuld daran, dass das Game verloren ging? Ich, die am Ende nur 2/5 stand und kaum noch Kills abgegeben hat, die Toplane mit ihren 11 Toden und dem Feed an Le Blanc oder die Bot und Jungle die trotz early Pressure nichts damit angefangen haben? \nIch als Selbstkritiker sage, dass ich Schuld daran bin. \nHätte ich der Le Blanc nicht die 2 Kills gegeben, hätte sie nicht snowballen können, wäre bei einem Roam vllt selbst gestorben anstatt Kills zu holen, weil sie nicht die entsprechenden Items hatte, ich wäre nicht so behind gefallen und hätte mein Team besser unterstützen können. \n\nDer Support meinte am Ende im Chat \"Its Lost, Mid differenz\". In diesem Moment hat mich das natürlich echt aufgeregt, weil was kann ich dafür, wenn die Top so viele Kills abgibt, die Bot und Jungle nichts anstellt. Ja, ich kann nichts dafür, das sie gestorben sind. Aber das es erst so weit gekommen ist, dafür kann ich sehr wohl was. Letztendlich war mir das klar. \n\nAlles was du tust oder nicht tust, jeder Tod von dir, jeder Kill hat eine Auswirkung auf das Game. Stirbst du hat das immer negative Auswirkungen für euch, außer in Ausnahmefällen, zB. wo du dich für das Team opferst und ihr dadurch safe den Baron bekommt, oder die Gegner vom Backport aufhältst und dein Team dadurch finishen kann. Manche Auswirkungen sind weniger schlimm, andere können fatal sein und wieder andere wirken sich erst im Laufe des Spiels aus, so wie die Le Blanc die einfach snowballen konnte. \n\nVersuche ebenfalls so zu denken und die Fehler deiner Mates sind weniger schlimm. ^^ \nMache nur nicht den Fehler und tilte dann wegen dir xD Biste gestorben? Okay passiert. Dann schau nach dem Game diesen Tod an und überleg was du falsch gemacht hast und im nächsten Game begehst du diesen Fehler nicht erneut. \nSpiele einfach um dich zu verbessern anstatt für den Climb. \n\nViel Glück in der Kluft und beim erlernen eines neuen Champions. ^^ \n(Preseason eignet sich dafür immer gut finde ich)","replies":[{"poster":"Raumschiffmann","date":"2018-11-07T13:29:45.406+0000","up_votes":1,"down_votes":0,"body":"Weißt du was schade ist. Ich war vor dem Ende der Season auch so. Ich habe den Fehler immer bei mir Gesucht um besser zu werden. Dieser krasse Absturz hat nur das schlechteste in mir zum Vorscheingebracht. Trotzdem sollte Riot Troller bestrafen :)","replies":[{"poster":"Angel Ayume","date":"2018-11-07T13:33:15.921+0000","up_votes":2,"down_votes":0,"body":"Sicher sollten sie Trolle bestrafen. Aber die Frage liegt oft bei der Definition. \nViele bezeichnen Spieler schon als Troll nur weil sie einem Call nicht folgen, oder einfach ein paar Fehler gemacht haben oder gar ein anderes Itembuild als gewöhnlich spielen. \nDas ist aber kein Troll. ^^ \n\nDie Frage ist, was für dich Trolling ist.","replies":[{"poster":"Raumschiffmann","date":"2018-11-07T15:17:52.678+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=LWVxApJI,comment-id=00010000000000000000,timestamp=2018-11-07T13:33:15.921+0000)\n>\n> Sicher sollten sie Trolle bestrafen. Aber die Frage liegt oft bei der Definition. \n> Viele bezeichnen Spieler schon als Troll nur weil sie einem Call nicht folgen, oder einfach ein paar Fehler gemacht haben oder gar ein anderes Itembuild als gewöhnlich spielen. \n> Das ist aber kein Troll. ^^ \n> \n> Die Frage ist, was für dich Trolling ist.\n\nIch kann es auch nicht ab wenn Leute direkt nach Troll schreien, weil jemand nicht nach der Meta baut oder Soraka Top spielt. Ich finde das schöne an LoL ist seine Vielfalt. Das man jeden Charakter auf so viele unterschiedliche Arten spielen kann. UNd jede hat mal bad Games. Für mich ist Trollen wirklich jemand wie der Nunu ADC der nach 5 Minuten einfach zu mir in die Mid kommt mir die Lane wegnimmt und danach nur noch unserem JUngler folgt um ihm alle lasthits auf junglecamps zu nehmen. SOwas z.B.","replies":[{"poster":"Angel Ayume","date":"2018-11-07T15:42:22.695+0000","up_votes":2,"down_votes":0,"body":"Okay. ^^\n\nJa im Falle von Nunu würde ich auch klar sagen, dass er trollt. Aber willst du, dass er bestraft wird, dann wird ein Report allein wohl nicht genügen. \nDa wird schon eine Ticketmeldung nötig sein. \n\nHatte mal so nen Fall. Ein Thresh der ganz klar getrollt hat, durch Zufall hab ich den bei op.gg gefunden. Hat man schon am Itembuild erkannt, viele Tode etc. Aber er hat auch Spiele gewonnen, vllt war das der Grund weswegen er nicht automatisch gebannt wurde. Ich weiß es nicht. \n\nIch hab ihn dann aber per Ticket beim Support gemeldet. Mit Screenshot und zusätzlichem Link zu seinem op.gg Profil. \n3 Tage nachdem ich das Ticket erstellt hatte, hat der Spieler keine Spiele mehr gespielt obwohl er vorher jeden Tag mehrere Games mit seinem Troll-Thresh absolviert hat. Ich bin mir ziemlich sicher, dass der Spieler gebannt wurde. \n\nWir alle wissen, dass der Feederbuster leider nicht besonders gut ist, was unter anderem daran liegt, dass er nicht ordentlich lernen kann (ist ein selbstlernendes Programm) aufgrund der vielen Falschreports. Deswegen ist es notwendig bei solche Dingen den Support direkt per Ticket drauf hinzuweisen, damit sich das ein echter Mensch ansehen kann. \n\nIm Falle vom Thresh hat es scheinbar gut geklappt.","replies":[{"poster":"Raumschiffmann","date":"2018-11-07T15:47:21.818+0000","up_votes":2,"down_votes":0,"body":"Ok das war mir noch nicht klar, dass man da Tickets schreiben kann. Darauf werde ich dann in Zukunft zurückgreifen. Weil wie gesagt feed und so ist eine Sache aber anderen absichtlich das Spiel versauen, da wird ne Grenze überschritten.","replies":[{"poster":"Angel Ayume","date":"2018-11-07T15:48:17.634+0000","up_votes":2,"down_votes":0,"body":"Absichtlich ist ja auch nicht erlaubt. ^^ \nAber kommt ja zum Glück nur sehr selten vor.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"00 M4ddin 00","date":"2018-11-07T08:01:32.219+0000","up_votes":1,"down_votes":1,"body":"Ja also ich schreib dir mal wie es mir dieses Jahr ergangen ist :) \n\n---------\n\n\nHab meine Platzierungs spiele gestartet mit 4 Wins. Dann ein paar Tage später weiter gespielt und plötzlich stand es 4w / 11 los .... Dann erstmal enttäuscht aber S3 gekommen.\nDarauf hin weiter gespielt Mitte mit morgana und ahri :) Und nach so 60 games Silber 1 mit 98 lp und 66% Win rate insgesamt :) dachte ich mir ja geil Gold ist gleich da .....\n\nTja falsch gedacht quasi am Stück verteilt auf mehrere Tage zurück auf S2 mit 0 lp gefallen. Hab games verloren wo ich mit akali (vor rework) 11/0 steh und eins mit twitch ! Auch 11/0 und konnte nichts drauß machen. Hab sogar noch Screenshots davon.\n\nAlso hart getiltet etwas pause gemacht und weiter gespielt bin dann wieder Silber 1 gekommen und wieder bei 96lp also ein Win.... Und wieder back auf S2 0lp .... Das Spiel hasst mich also wieder hoch gespielt S1\n\nInsgesamt war ich 13 mal zwischen 86 und 98 lp also einen Win entfernt von der Promo zu Gold!\n\nBis es dann endlich mal geklappt hat nach über 200 games und dann obwohl ich meiner Ansicht nach mit den 66% Win rate schön rein aus Prinzip hätte in Gold kommen sollen. Aber nicht wenn das Spiel einen hasst^^ \n\n\n------ \n\nJetzt bin ich auf flex Q mit Freunden umgestiegen spielen da meisten zu 3 und bin da am Wochenende auch Gold 5 gekommen :)","replies":[{"poster":"Raumschiffmann","date":"2018-11-07T09:54:58.857+0000","up_votes":1,"down_votes":3,"body":"Krass, ja das Gefühl hatte ich auch mit der Achterbahnfahrt. FÜr mich ist es denke ich auch besser mir ein Team für die nächste Saeason zu suchen. Ich funktioniere viel besser im Team und man umgeht viele Trolls. Ich habe halt nur leider keine Freunde die LOL spielen das ist mein Problem. xD\n\nDanke für das Feedback!","replies":[{"poster":"Qbert","date":"2018-11-07T10:07:35.217+0000","up_votes":3,"down_votes":0,"body":"Ich kann Maddin da nur beipflichten, gönn dir eine Pause.\nMir erging es nämlich ähnlich, Seasonbegin -> Gold1 eingerankt, straight hoch bis Plat1 Promo, dann straight runter über mehrere Wochen bis ich auf Gold3 gefallen bin ... hochgekämpft bis Gold2 und frustriert eine Pause gemacht, ich glaube etwa Februar - Oktober... jetzt habe ich mich noch entspannt auf Platin 5 hochgespielt und beende damit meine Saison.\n\nEine Pause tut gut. Du gewinnst wieder Lust am Spiel und einen gewissen Abstand, den du absolut nötig hast!\nIch bin in etwa in deinem Alter .... wir alten Männer müssen zusammen halten! Also, gönn dir! :D","replies":[{"poster":"Raumschiffmann","date":"2018-11-07T10:45:19.086+0000","up_votes":1,"down_votes":2,"body":"Danke, ja das müssen wir in der Tat. Und was einfach der aller beste Rat bei meinem Problem ist - Gönn dir eine Pause.\n\nDanke dafür - die habe ich mehr als nötig und mit vorranschreitendem Alter sollte es größere Ziele als Goldplacement geben {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"4 For Maggie","date":"2018-11-07T13:10:17.812+0000","up_votes":2,"down_votes":0,"body":"> Danke dafür - die habe ich mehr als nötig und mit vorranschreitendem Alter sollte es größere Ziele als Goldplacement geben \n\nJa. Der beste Pokemontrainer aller Zeiten zu werden! <3","replies":[{"poster":"Angel Ayume","date":"2018-11-07T13:15:49.849+0000","up_votes":2,"down_votes":0,"body":"Jaaaaa wäre ich gern. Leider hab ich vom kompetetiven Play keine Ahnung und mir passende Pokemon dafür zu züchten bin ich tatsächlich zu faul und nich geduldig genug. \nAber eigentlich wollt ich das schon immer machen :D","replies":[{"poster":"Mjölnir Kind","date":"2018-11-07T13:45:05.132+0000","up_votes":2,"down_votes":0,"body":"Was habe ich für tausende Eier ausgebrütet um Pokemon kompetitiv spielen zu können xD","replies":[{"poster":"Angel Ayume","date":"2018-11-07T13:58:58.837+0000","up_votes":1,"down_votes":0,"body":"Warst du erfolgreich? :D","replies":[{"poster":"Mjölnir Kind","date":"2018-11-07T14:02:19.887+0000","up_votes":2,"down_votes":0,"body":"Naja xD\nAber das kämpfen mit selbst gezüchteten Pkmn war gleich viel schöner, weil du dann richtig stolz drauf warst xD","replies":[{"poster":"Angel Ayume","date":"2018-11-07T14:09:49.008+0000","up_votes":1,"down_votes":0,"body":"Ja klar :D Das wäre ich auch. Ich würde heute auch immer noch gerne einsteigen. Aber mir ist das einfach zu aufwendig :< Und fertige Pokemon tauschen find ich dann auch wieder doof D: \n\nMit erfolgreich meint ich eig. ob du es geschafft hast, kompetetiv sinnvoll nutzbare Pokis zu züchten :D","replies":[{"poster":"Mjölnir Kind","date":"2018-11-07T14:10:58.620+0000","up_votes":1,"down_votes":0,"body":"> Mit erfolgreich meint ich eig. ob du es geschafft hast, kompetetiv sinnvoll nutzbare Pokis zu züchten :D\n\nAchso, ja klar ich hab mich ja nicht zum Spaß hingesetzt und habe täglich ne ganze Box voller Eier ausgebrütet xDD","replies":[{"poster":"Angel Ayume","date":"2018-11-07T14:17:39.970+0000","up_votes":1,"down_votes":0,"body":"Nice. :D Deine Ausdauer hät ich gerne :D \n\nMachst du das immer noch oder hast es mittlerweile aufgegeben? \nWenn ja wieso? Interesse an Pokemon verloren oder einfach das Interesse am kompetetiven Play?","replies":[{"poster":"Mjölnir Kind","date":"2018-11-07T14:20:48.442+0000","up_votes":1,"down_votes":0,"body":"Naja um im kompetetiven Play UpToDate zu sein musst du halt auch die aktuellen Pokemon Spiele spielen. Ab Sonne/Mond bzw. Ultra Sonne/Mond wurde es mir zuviel ^^' und nur für Pkmn will ich mir keine neue Konsole kaufen xD\nWäre X/Y und Alpha Saphir noch im Hype würde ich denk ich schon noch züchten wollen :D","replies":[{"poster":"Mjölnir Kind","date":"2018-11-07T14:47:44.246+0000","up_votes":1,"down_votes":0,"body":"Muss ich mal angucken :P","replies":[]},{"poster":"Angel Ayume","date":"2018-11-07T14:40:00.100+0000","up_votes":1,"down_votes":0,"body":"Also ich spiel zurzeit mit OT Riku PokeOne. \nDas man da Mitglied sein muss um irgendwo hin zu kommen wäre mir neu o.o\nGibt auch Lootboxen wo du Echtgeld-Währung rausbekommst. Musst also nicht unbedingt payen um etwas zu erhalten. Es dauert halt nur wesentlich länger :D","replies":[]},{"poster":"Mjölnir Kind","date":"2018-11-07T14:25:52.279+0000","up_votes":1,"down_votes":0,"body":"Irgendein Pokemon Online Dings hab ich mal gespielt.\nAber dort musste man irgendwie Mitglied durch Geld werden und zahlen um an bestimmte Orte zu kommen. Das war nicht wirklich suuuuuuper :p","replies":[]},{"poster":"Angel Ayume","date":"2018-11-07T14:23:39.930+0000","up_votes":1,"down_votes":0,"body":"Wie wärs mit nem Pokemon MMO. o.o \nAllerdings weiß ich immer noch nicht, ob man da züchten kann q.q \nAber man kann zumindest Eier haben :D Aber woher weiß ich auch nicht .__.","replies":[]}]}]}]}]}]}]}]},{"poster":"4 For Maggie","date":"2018-11-07T13:24:58.657+0000","up_votes":1,"down_votes":0,"body":"Ja c.c Wenn man richtig gut züchten will ist das schon aufwendig! Und komplexer als man denkt. Vor allem wenn man tatsächlich gewisse Dinge forced wie gute Stats, ein bestimmtes Wesen oder eine passive. Sogar das Geschlecht! xD\n\nVorgenommen habe ich mir das auch öfters. Aber umgesetzt niemals xD","replies":[{"poster":"Angel Ayume","date":"2018-11-07T13:35:36.274+0000","up_votes":1,"down_votes":0,"body":"Ja ist so. :( \nVorgenommen hab ich mir das auch ein paar Mal. Sogar angefangen. Aber nicht beendet weils mir dann doch zulang gedauert hat :/","replies":[{"poster":"4 For Maggie","date":"2018-11-07T13:42:19.045+0000","up_votes":1,"down_votes":0,"body":"Das ist eben das nervigste. Da will man ein paar Eier brüten und muss gefühlte drölf Milliarden Schritte laufen bis es endlich schlüpft.\n\nWenn man das MAL nebenher gemacht hat ging das eigentlich. Es gab ja auch Tricks wie \"das Ei an erste Stelle setzen\" um das ganze etwas zu beschleunigen. Aber das ganze 'bewusst' zu machen, war wirklich anstrengend.\n\nAusnahmen habe ich zum Beispiel bei Evoli gemacht oder halt mal aus Spaß fünf kleine Pichus ausbrüten lassen ^^ Ein Team voller kleiner Baby Pokemon. Nicht worth xD wenn man sie nicht trainiert ... Das sind Spielerein nach der Liga :D","replies":[{"poster":"Angel Ayume","date":"2018-11-07T13:46:58.436+0000","up_votes":1,"down_votes":0,"body":"Hab das mit Evoli auch mal gemacht, weil ich unbedingt nen Shiny wollte mit guten Werten. \nIch hab viele Tage gebraucht um überhaupt mal nen Evoli mit einigermaßen guten Werten zu bekommen. Nen Shiny war nicht einmal dabei xD \nAllein wie viele Stunden ich damit verbracht hab D: \nUnd ich hatte noch nen Trick genutzt in X/Y\nIn einer großen Stadt gabs so nen Turm um den man rumlaufen konnte. Fahrrad, Bewegungspad mit einem Stück Papier eingeklemmt und man konnte ohne was zutun einfach im Kreis fahren ohne irgendwo anzudocken. Ziemlich cool eigentlich und recht einfach. Aber dennoch nervig.","replies":[]}]}]}]},{"poster":"Raumschiffmann","date":"2018-11-07T13:25:23.040+0000","up_votes":1,"down_votes":0,"body":"Ich habe grad tatsächlich den Basketball geschnappt und bin raus gegagnen, draussen hat sich das Ding aber in nen Smogmog verwandelt. Draussen ist es zu gefährlich für alte Pokemontrainer \n{{sticker:zombie-brand-mindblown}}","replies":[]}]}]}]},{"poster":"4 For Maggie","date":"2018-11-07T13:07:09.808+0000","up_votes":1,"down_votes":0,"body":"*Sich die beiden alten Männer ausführlich vorstellt*\n{{sticker:sg-poppy}}","replies":[{"poster":"Qbert","date":"2018-11-07T13:11:39.424+0000","up_votes":2,"down_votes":0,"body":"komm du mal in unser alter\n\nhttp://images6.fanpop.com/image/photos/36100000/League-of-legends-image-league-of-legends-36169809-800-596.jpg","replies":[{"poster":"Angel Ayume","date":"2018-11-07T13:14:32.338+0000","up_votes":1,"down_votes":0,"body":"Hey. Wir sind doch noch nicht alt D: \nNun mach mal halblang. Du tust ja so als wären wir im Alter meiner Oma (80+) T___T","replies":[{"poster":"Qbert","date":"2018-11-07T13:20:52.837+0000","up_votes":1,"down_votes":0,"body":"du meinst eher so:\n\nhttps://static.lolwallpapers.net/2016/11/58315d8199171.jpg\n\n?","replies":[{"poster":"Angel Ayume","date":"2018-11-07T13:23:08.742+0000","up_votes":1,"down_votes":0,"body":"Dann wären wir aber die rechten Poros. xD","replies":[{"poster":"Qbert","date":"2018-11-07T13:28:47.405+0000","up_votes":1,"down_votes":0,"body":"naja, sind wir ehrlich, so ein Mittelding:\n\nhttps://img00.deviantart.net/a534/i/2015/169/a/c/braum_poro_by_captaintanuksan-d8xs498.jpg","replies":[{"poster":"Angel Ayume","date":"2018-11-07T13:34:16.193+0000","up_votes":1,"down_votes":0,"body":"Ich bin NICHT alt. Und ein Mittelding bin ich auch nicht T___T \n\nBetitel mich nicht als mittelmäßig. Da werd ich traurig {{sticker:sg-soraka}}","replies":[]}]}]}]}]}]}]}]}]}]}]}