{"poster":"Nashira99","date":"2015-07-27T01:58:45.983+0000","title":"Verbindungsprobleme","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Seit einiger Zeit passiert es mir das w&auml;hrend ich spiele diese meldung kommt >>Verbindung wird hergestellt<< oder >> Verbindung wiederherstellen<<. kein plan was genau da steht :D . passiert ja manchmal wenn der ping zu hoch ist. aber bei mir gehts nicht mehr weg und ich kann erst wieder weiter spielen wenn ich mich neu einlogge. das passiert meisten nach 2-4 spielen. Erstes spiel funktioniert einwandfrei, manchmal lagg es dort aber auch schon. dann passierts entweder im n&auml;chsten spiel oder es lagg so sehr das ich schon bescheid wei&szlig; und lieber kein n&auml;chstes spiel anfange.... und nach dem neu einloggen laggts immer noch. ich hab auch schon den IP-Helper und die Firewall abgeschaltet wie riot es mir geraten hat. hat beides nichts gebracht. hat oder hatte jemand vielleicht das selbe problem und hat schon eine l&ouml;sung gefunden? w&auml;re euch wirklich sehr dankbar. hatte schon 2 mal den LeaverBuster und nicht wirklich bock auf einen dritten...\nmanchmal wenn ich dann LoL minimiere kommt auch eine meldung in der so was steht wie das die verbindung zum server nicht hergestellt werden konnte und dann noch irgendwas mit meiner firewall. aber an der kann es ja nicht liegen da mir das gleiche ja auch bei ausgeschalteter firewall passierte","replies":[{"poster":"Fastforward","date":"2015-07-27T11:06:37.236+0000","up_votes":1,"down_votes":0,"body":"Das gleiche Problem habe ich ebenfalls. Auch eine neu Installation des Spiels hat keine Veränderung gebracht. Habe auch keinerlei Firewalls aktiviert. Falls jemand ne Lösung des Problems hat wäre cool.","replies":[{"poster":"Nashira99","date":"2015-07-27T12:35:43.069+0000","up_votes":1,"down_votes":0,"body":"Ich kanns grad nicht besser ausdrücken :D aber wer ist denn dein Internetanbieter? Ich hab zum beispiel 1&1. hab schon überlegt ob es an denen liegt da ich früher bei telekom war und da lief alles","replies":[{"poster":"yclick","date":"2015-07-27T13:00:02.887+0000","up_votes":1,"down_votes":0,"body":"Ich habe dasselbe problem und bin bei KD (ipv6). Nur die Nützung von einem VPN erlaubt mich zu spielen. Also hat das definitiv mit der Verbindung zu tun... (router setup/dns/routing...)\n\nKD und 1&1 benutzen beide die Netzwerk von Vodafon... Vielleicht gibts da was...","replies":[{"poster":"Nashira99","date":"2015-07-27T13:24:44.655+0000","up_votes":1,"down_votes":0,"body":"Na super.... ich kenn mich nicht so gut aus. was genau ist ne VPN? :D","replies":[{"poster":"yclick","date":"2015-07-27T13:34:06.898+0000","up_votes":1,"down_votes":0,"body":"Das ist ein Software (z.B. SecurityKiss). Das macht ein \"Tunnel\" zwischen dein Computer und ein Server, und den Server verbindet sich für dich...","replies":[{"poster":"Nashira99","date":"2015-07-27T13:43:18.767+0000","up_votes":1,"down_votes":0,"body":"und das hilft? ist das denn auch sicher wegen viren und so ein kack? :D","replies":[{"poster":"yclick","date":"2015-07-27T14:40:37.560+0000","up_votes":1,"down_votes":0,"body":"Sicher ist es. Problem ist die kostenlose VPN sind oft langsam, und es ist nicht ideal zum Spielen... Ich hab es probiert nur um das problem finden zu können... Jetzt weiss ich dass ich 100% das es von der Verbindung kommt. (In meinem fall). Wenn du auch sicher sein will dass deine Verbindung schuldig ist, kannst du securitykiss herunterladen und probieren... Aber wie gesagt zum Spielen ist das wirklich nicht ideal... (wegen den ping)","replies":[{"poster":"Nashira99","date":"2015-07-27T16:46:29.023+0000","up_votes":1,"down_votes":0,"body":"ok. Gut zu wissen danke :) hoffentlich meldet sich noch jemand der eine andere lösung gefunden hat :D","replies":[{"poster":"yclick","date":"2015-07-27T17:35:00.714+0000","up_votes":1,"down_votes":0,"body":"Das ist ja keine \"Lösung\", das erlaubt aber leute wo sich einigemaße auskennen, das Problem zu finden... Hoffen wir...","replies":[{"poster":"Nashira99","date":"2015-07-27T17:49:53.674+0000","up_votes":1,"down_votes":0,"body":"es zu finden wird aber auch nicht viel bringen :D wenn es tatsächlich nur  an der internetverbindung liegt dann kann man es nicht ändern. außer sich einen neuen anbieter zu suchen.","replies":[{"poster":"yclick","date":"2015-07-27T18:43:00.467+0000","up_votes":1,"down_votes":0,"body":"Net unbedingt... Das kann an ipv6 liegen oder etwas in der Konfiguration vom Router... Wer weisst...","replies":[{"poster":"yclick","date":"2015-07-28T07:51:58.973+0000","up_votes":1,"down_votes":0,"body":"Heute funktioniert es ohne VPN... Warum? Keine Ahnung ^^","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}