{"poster":"benja69lol","date":"2017-11-27T23:15:03.885+0000","title":"¿Podrian hacer esto por favor?...","subforum":"Charlas Generales","up_votes":6,"down_votes":9,"body":"Cada vez que sale un champ, cambian la voz, o una skin con voz nueva crean un post, hilo como quieran decirle que se llama: &quot;DETRAS DE...&quot;\r\n\r\nTodo bien, no me molesta, lo que me molesta es que pongan la imagen de quien es la que hace las voces de &quot;portada&quot;, o sea el que quiere ver la imagen, que tengan que entrar al link y listo, yo no quiero enterarme, porque apenas pongo noticias aparece de entrada y no me interesa, no quiero saberlo.\r\n\r\nYa van como 30 campeones que no se, por ahi Ahri guardiana estelar, se supone que es un champ &quot;sexy&quot; su tono de voz y todo, pero despues te aparece ahi la imagen de &quot;DETRAS DE AHRI http://www.diario4v.com/u/fotografias/m/2015/12/4/f960x0-13754_13772_0.jpg &quot;\r\n\r\nO sea, wtf?, no me queria enterar de eso, ahora me da asco el champ, sigan poniendo la imagen, no la pongan de entrada, hay personas que no se quieren enterar de quien hizo la vos, o pensar que su champ main le gusta por la voz le parece simpatica y despues aparece Roberto Carlos ex actor xxx haciendo la voz de Annie, y no da viejo....","replies":[{"poster":"Gig GOD OF DEATH","date":"2017-11-28T00:08:58.092+0000","up_votes":3,"down_votes":0,"body":"Esperaba otra cosa, y al final me termino matando el post fue original sin duda con la imagen, sinceramente me da igual no esta mal pero si muestran a quien habla a varios como dijiste quizás afecte.","replies":[]},{"poster":"Monokai","date":"2017-11-27T23:21:43.374+0000","up_votes":3,"down_votes":1,"body":"tranquila histérica!","replies":[{"poster":"benja69lol","date":"2017-11-28T00:55:54.342+0000","up_votes":1,"down_votes":0,"body":"Se ve que necesitas atencion, asi que el ban del foro te va a dar la atencion que estas pidiendo a gritos. Un cordial saludo!.","replies":[{"poster":"Zafphlyn","date":"2017-11-28T02:09:03.797+0000","up_votes":2,"down_votes":1,"body":"y lo dice el que se llama benja 69 equis dé","replies":[{"poster":"benja69lol","date":"2017-11-28T06:15:45.869+0000","up_votes":1,"down_votes":0,"body":"Elemental mi pequeño saltamontes, elemental es que a corta edad, los niños creen saber todo y hablan sin argumentos, no tiene nada de malo, estimula la imaginacion.\n\nEsta cuenta no es mia, es una mas de las tantas cuentas estafadas que tengo, como 1neko2, que te podes fijar, lo digo libremente en el foro que la cuenta la robe, simplemente que a riot no le interesa, asi que, sigue estimulando tu imaginacion pequeño saltamontes...","replies":[{"poster":"Zafphlyn","date":"2017-11-28T14:43:35.608+0000","up_votes":1,"down_votes":0,"body":"que raro... un niño rata que se piensa que es hacker... y llama niño a los demás...","replies":[{"poster":"benja69lol","date":"2017-11-28T21:40:54.258+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJA, me mata que no podes robar ahora, que para los niños es todo \"hacker\" jajaja, a ver... copia mi respuesta anterior y marca la parte en la que diga \"soy hacker\"...\n\nO es que no te da?, va si... no te da es obvio, no te llega el agua al tanque jajaja","replies":[{"poster":"Zafphlyn","date":"2017-11-28T23:27:16.195+0000","up_votes":1,"down_votes":0,"body":"\"No te llega el agua al tanque\"\nhttps://imgur.com/AbX4azo","replies":[]}]}]}]}]}]}]},{"poster":"Russells Viper","date":"2017-11-27T23:16:24.630+0000","up_votes":1,"down_votes":0,"body":"qjjaa<zdasda","replies":[]}]}