{"poster":"Golem Master","date":"2017-06-18T02:35:19.894+0000","title":"Bots im Coop vs. AI","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich wei&szlig; dieses Thema wurde schon in einigen anderen Forenbeitr&auml;gen beschrieben aber es frustriert mich grade sehr.\r\nIch war in zwei Spielen hintereinander mit 4 Bots im Team die so schlecht sind das sie auf den gegnerischen Turm zurennen und darunter sterben.\r\nWenn ich das Spiel dann verlassen will werde ich aber erst f&uuml;r f&uuml;r weitere Spiele erstmal gesperrt. \r\nEine Chance das Spiel zu gewinnen habe ich aber nicht und es macht auch keinen Spa&szlig; wenn die Gegner so gefeedet werden. \r\nIch werde also daf&uuml;r bestraft das Riot es schon seit Monaten nicht schafft diese Bots aus Coop vs. AI rauszuwerfen.\r\nDas finde ich sehr Schade.","replies":[{"poster":"Kaorî","date":"2017-06-18T11:56:04.903+0000","up_votes":1,"down_votes":0,"body":"Spiel einfach Jinx. ^^ Große Reichweite mit der Q, super Waveclear und mit der Ult nen Executer.\nUnd doch, die Farmbots machen etwas -> Aggro auf sich nehmen. ^^ Außerdem farmen auch die Riotbots keine CS, die attackieren einfach die Minions, ohne Rücksicht auf Lasthits.\nZu Beginn von S7 habe ich nur Botgames gezockt, hab mittlerweile bestimmt an die 250 Mittelschwere Botgames hinter mir und da waren genug Spiele dabei, wo ich auf mich allein gestellt war.\nHab halt immer Jinx gespielt, oder Katarina. ^^ Q in die Gegner, reinspringen, R drücken, Zhonyas drücken, mit der E rausjumpen und die Überlebenden rauskillen.","replies":[]},{"poster":"Nycaria","date":"2017-06-18T09:13:36.700+0000","up_votes":1,"down_votes":1,"body":"Die Frage ist warum du afk gehst anstelle das Game einfach zu finishen? Gegen Bots zu gewinnen ist nun wirklich nicht schwer, komplette Anfänger vielleicht mal ausgenommen, warum machst du es also nicht einfach? \n\nKlar die Bots sind nicht cool und es nervt mit Bots im eigenen Team zu spielen, aber wenn ich mich zwischen Bots und Leaverbuster entscheiden müsste... einmal Bots bitte ;)","replies":[{"poster":"HyperionCH","date":"2017-06-18T09:31:09.732+0000","up_votes":1,"down_votes":0,"body":"Wie beim anderen Beitrag erwähnt stehen die Farmbots oft nur herum (farmen also gar nicht) und wenn sie sich bewegen, dann zum gegnerischen Turm und feeden. Sie sind also wesentlich schwächer als die Riot-Bots.\nIm späteren Verlauf des Games sind dann die Riot-Bots zu fünft und stark gefeedet in der Midlane und pushen durch. Da ist es wirklich nicht einfach, alleine (die 4 Farmbots werden nicht einmal die Minions angreifen, sondern nur herumstehen) die Türme zu verteidigen.\n\nSpieler mit einem Skill-Level werden möglicherweise auch mit 4 Farmbots gewinnen. Es wird aber wohl auch für dich nicht einfach.\nDu kannst es ja einmal testen. Es wird sicherlich einige Games dauern, aber du wirst recht schnell 3-4 Farmbots im Team kriegen und ab 3 wird es doch etwas härter und ab 4 schwer. Bei 4 Farmbots werden bis hohes Silber die meisten Spieler wohl verlieren und in diesem Skill-Level sind 2/3 aller Spieler.\nIch bin deshalb gepannt, wie du dies einschätzt (solltest du dies einmal testen und auch 3-4 Farmbots kriegen), wenn man in solche Games spielen muss.","replies":[{"poster":"Nycaria","date":"2017-06-18T10:18:27.447+0000","up_votes":1,"down_votes":0,"body":"Ich hab die letzten Tage einige Botgames gespielt unter anderem auch mit 3 bzw 4 Farmbots gegen mittlere Bots und gewonnen ;) Es ist also durchaus machbar, sofern man nicht einfach stumpf in die Gegner rennt und stirbt.\n\nWenn du mir nicht glauben solltest, einfach mal Bananaofdarkness auf Op.gg suchen, in einem oder zwei meiner Jinx Games hatte ich mehrere Bots.","replies":[{"poster":"HyperionCH","date":"2017-06-18T10:22:43.202+0000","up_votes":1,"down_votes":0,"body":"Du bist ja auch Platin (auch wenn dein smurf möglicherweise nicht Platin ist -> denn mit diesem Account hast du nicht gespielt).\nWie gesagt sind 2/3 der Spieler skillmässig in Bronze und Silber. Da wird es auch ohne hineinrennen schwierig, weil die Farmbots nur sterben und auch keine Türme verteidigen.\n\nHast du eine Match-History? Mich würden die Stats interessieren, die man als Platinspieler gegen 4 Farmbots erspielt.","replies":[{"poster":"Nycaria","date":"2017-06-18T10:26:25.930+0000","up_votes":1,"down_votes":0,"body":"https://euw.op.gg/summoner/userName=Banana+of+darkness Das Letzte Game war mit 3 Bots und einem Anfänger.\n\nEs geht beim spielen mit Farmbots weniger um Skill, sondern mehr darum sich einpushen zu lassen, farmen und eben die eigenen Bots als Meatball zu nutzen. Da ist die eigene Elo nicht relevant.","replies":[{"poster":"HyperionCH","date":"2017-06-18T10:40:36.690+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Keep the Control,realm=EUW,application-id=7hciEY9w,discussion-id=kydQGZIe,comment-id=00010000000000000000,timestamp=2017-06-18T10:26:25.930+0000)\n>\n> https://euw.op.gg/summoner/userName=Banana+of+darkness Das Letzte Game war mit 3 Bots und einem Anfänger.\n> \n> Es geht beim spielen mit Farmbots weniger um Skill, sondern mehr darum sich einpushen zu lassen, farmen und eben die eigenen Bots als Meatball zu nutzen. Da ist die eigene Elo nicht relevant.\n\nHast du noch ein Game mit 4 Farmbots?\nMit 3 Farmbots komme ich grundsätzlich auch klar, wenn der andere menschlicher Spieler ansatzweise etwas drauf hat (und ich bin derzeit Bronze ;) ).\n\nDu musst aber auch biem letzten Game zugeben, dass es nicht einfach war. Das Game dauerte immerhin 36 Minuten (für einen Platinspieler + einem Anfänger). Normalerweise ist man hier ja klar unter 20 Minuten Spielzeit, wenn man mindestens 2 erfahrene Spieler im Team hat + 3 Anfänger (und erfahren bedeutet nicht Platin-Skill).\nIn deinem Game warst dein Team auch zwischenzeitlich über 10k Gold in Rückstand. Selbst wenn die Riot-Bots den Goldvorsprung nicht gut ausnutzen können, ist dies für viele Spieler in Bronze und Silber doch ein Problem (nach meiner Erfahrung fehlt es vielen Spielern an Erfahrung, wie man mit Rückstand gut spielt). Du als Platinspieler kannst natürlich wesentlich besser damit umgehen, wenn schlechte Gegner einen grossen Itemvorsprung haben.\n\nHinzu kommt, dass man fast nur ADC spielen kann. Denn die Objectives müssen ja sehr rasch down gehen, wenn die Chance dazu da ist (OK, Ziggs geht auch noch). Dies schränkt natürlich auch sehr ein, was man in Botgames überhaupt picken kann.","replies":[{"poster":"Nycaria","date":"2017-06-18T10:48:16.961+0000","up_votes":1,"down_votes":0,"body":"An sich war es doch relativ einfach. Abgesehen von einem Flash Tibbers des Annie Bots in mein Gesicht (das tut echt weh :( ) war das Game simpel. Ich hab nur ein Weilchen gebraucht um meine Items zusammen zu farmen, da ich nicht sonderlich gut im Lasthitten bin. \n\n4 Farmbots hatte ich irgendwann auch mal, allerdings war das nur gegen die einfachen Bots, die sollte wirklich jeder mit ein bisschen Grips 1v5 machen können ^^\n\nWas die Picks angeht hast du wohl recht, mit ADCs ist es definitiv am Einfachsten, aber prinzipiell sollte es mit jedem Champion gehen, der Schaden macht.","replies":[{"poster":"HyperionCH","date":"2017-06-18T11:05:31.295+0000","up_votes":1,"down_votes":0,"body":"Du hattest aber trotzdem immerhin 8.5 CS/Min.\nKlar, du bist sicherlich auch geroamt und hattest somit Farm aus mehreren Lanes. Jedoch wird wie gesagt ein Bronze/Silber Spieler auch mit Roaming nicht an 8.5 CS/Min. kommen. Und genau deshalb bezweifle ich, dass ein Low-Elo Spieler hier erfolgreich ist.\nDenn stell dir vor, du hättest nur 7 CS/Min. hingekriegt. Dann hätte es doch spürbar länger gedauert, an die Items zu kommen. In dieser zusätzlichen Spielzeit hätten die Riot-Bots selbst auch mehr Gold gefarmt und können auch viel mehr Druck auf die Türme machen (auf mehreren Lanes -> und man kann ja nur an einer einzigen Lane sein).\n\nHard-CC ist eigentlich das grösste Problem. Wenn die Riot-Bots dies haben (Annie, etc.) wird es wirklich schwer, da man keine Unterstützung von den Mates und selber kann man keinen DMG drücken, weil man gestunt ist.\n\nIch denke deshalb schon, dass die meisten Spieler in Low Elo (bis hohes Silber) ein Botgame verlieren (auf mittlerer Stufe), wenn sie 4 Farmbots ingame haben.\nDu hattest mit 3 Farmbots (und einem ADC, der im Late die Objectives schmelzen lässt) immerhin fast 40 Minuten gehabt. Bei 4 Farmbots wäre es ja noch länger geworden und ein einziger Death von dir nach 40 Minuten Spielzeit kann bereits entscheidet sein (da wie gesagt die Farmbots wirklich nichts deffen).\n\nZudem denke ich: auch wenn es für dich \"relativ einfach\" war, so war es doch um einiges schwieriger (doppelte Spielzeit als üblich) und ich bezweifle, dass dies Spass machte. Für schlechtere Spieler ist so etwas noch frustrierend und wie dies für wirkliche Anfänger ist, können wir beide wohl nicht einmal ansatzweise einschätzen.\nEine rasche Banwelle ist deshalb aus meiner Sicht dringend nötig.","replies":[]}]}]}]}]}]}]}]},{"poster":"Kaorî","date":"2017-06-18T03:06:39.851+0000","up_votes":1,"down_votes":0,"body":"Also wenn du gegen Bots verlierst, deren Handlungen man immer vorhersehen kann, da es eben Bots sind, machst du selbst was falsch. o.o\nSelbst wenn die gefeedet sind; es sind Bots, die können mit dem Feed sowieso nichts anfangen. Einfach von hinten anschleichen und oneshotten.\n\nIch freu mich immer über solche Teams, weil dann das Spiel wenigstens nicht nach 10 Minuten over ist.","replies":[{"poster":"HyperionCH","date":"2017-06-18T09:24:45.477+0000","up_votes":1,"down_votes":0,"body":"Kannst du ja einmal testen, indem du selber ein paar Botgames spielst und wenn du mit 4 Bots im eigenen Team spielst, bin ich auf das Ergebnis gespannt. ;)\n\nDie Farmbots sind wirklich sehr, sehr, sehr, sehr schlecht und im Vergleich zu den Riot-Bots auf der Gegnerseite sehr schwach.\nDie Farmbots farmen eigentlich gar nichts (also keine CS und deshalb keine wirklichen Items gekauft), stehen oft nur herum, bis sie sich entscheiden, in den Turm zu rennen und den Gegner somit zu feeden.\n\nIn TF ist dies dann nicht anders. Ich bin gespannt, wie du dann aussiehst, wenn du alleine einen Turm gegen 5 gefeedete Gegner verteidigst. Denn wie gesagt: deine Mates (aka Farmbots) werden rein gar nichts tun (nicht einmal Autoattacks auf die Minions, um die Wave zu clearen).\n\nMit 3 Farmbots im Team ist es bereits recht schwer (Support sollte man gar nicht spielen), selbst für erfahrene Spieler (hier müssen beide menschliche Spieler bereits erfahren sein). Mit 4 Farmbots im Team werden aus meiner Sicht die meisten Spieler bis hohes Silber verlieren. Aber wie gesagt: kannst du selber einmal testen. Sollte nicht allzu lange dauern, bis du 3-4 Farmbots kriegst.\n\nDas Problem was ich auch sehe: der Modus ist besonders für Anfänger gedacht (und nur sekundär für Spieler, die nur den Tagessieg oder nur chillen möchten). Dieses Problem frustiert sehr stark und es kann wohl kaum im Interesse von Riot sein, dass sie Anfänger auf diese Art frustieren und diese dann nicht mehr LoL spielen. Schliesslich sind dies potentielle RP-Käufer.","replies":[]}]}]}