{"poster":"Victory or Death","date":"2016-04-12T18:06:16.570+0000","title":"(2° parte) Mientras tanto, en las oficinas de Riot... xD","subforum":"Charlas Generales","up_votes":27,"down_votes":6,"body":"tocan temerosamente la puerta\r\nManager: &iexcl;Adelante!\r\nSteve: Umm... &iquest;me llam&oacute;, jefe?\r\nManager: Steve! Querido amigo, toma asiento.\r\nSteve: &iquest;Que necesita jefe?\r\nManager: Ver&aacute;s Steve, te has vuelto bastante conocido. Y quer&eacute;mos aprovechar tu nueva fama para progresar. Notamos que tu contacto con el publico es notable, y quer&eacute;mos escuchar de ti nuevas propuestas.\r\nSteve: &iexcl;Oh! &iquest;Enserio jefe? &iexcl;Que... Que alegr&iacute;a! Em... Bueno... Hay varias cosas que hacen falta, la gente espera mucho tener una recompensa por las maestrias de campe&oacute;n...\r\nManager: Maestr&iacute;as de campe&oacute;n. Hecho. Ya est&aacute;n en el servidor. La gente obtendr&aacute; su maestr&iacute;a con un bonito show de 1.5 segundos de lucecitas y sonidos. Perfecto.\r\nSteve: Pero eso es igual que desbloquear una nueva divisi&oacute;n en ranked se&ntilde;or... la gente espera algo m&aacute;s con las maestr&iacute;as, alguna skin....&iquest;Que tal los Aspectos de Cr--?\r\nManager: &iexcl;SKINS! &iexcl;Me encanta vender skins! &iquest;Que idea para skins nuevas tienes?\r\nSteve: &iquest;...Skins nuevas? Em... yo no me refer&iacute;a a eso... Pero bueno, ahora que lo menciona, hay algunos champs que necesitan skins. &iquest;Por ejemplo, Zac?\r\nManager: Ya hay gente trabajando en Cromas para Zac, Steve. Eso nos cubrir&aacute; un par de a&ntilde;os con &eacute;l.\r\nSteve: Um... Bueno... Tambi&eacute;n estar&iacute;a bueno darle una skin a otro campe&oacute;n muy demandado, como Ze--\r\nManager: &iexcl;EZREAL!\r\nSteve: &iquest;Qu&eacute;?\r\nManager: &iexcl;Eres un genio Steve! Haremos una skin para Ezreal.\r\nSteve: Pero... Se&ntilde;or... &iquest;No cree que tiene ya demasiadas skins?\r\nManager: &iexcl;Pues claro! &iquest;No dijiste tu que es el champ m&aacute;s demandado? Merece otra skin. Pero que sea de 750 RP, as&iacute; ahorramos trabajo.\r\nSteve: Se&ntilde;or... yo me refer&iacute;a a otro champ... a un asesino...\r\nManager: &iexcl;Shaco! Hecho. Skin de 750.\r\nSteve: A un mid laner...\r\nManager: &iquest;Syndra? Hecho.\r\nSteve: Alguien que no usa man&aacute;...\r\nManager: &iexcl;Mordekaiser! Listo.\r\nSteve: &iexcl;No se&ntilde;or! &iexcl;El champ que yo me refiero es Z-...!\r\nManager: Momento Steve. Ya son demasiadas skins. &iquest;Nos quieres matar de trabajo? Es m&aacute;s, haremos un Splash Art en conjunto para ahorrar esfuerzos.\r\nSteve: Se&ntilde;or... la gente est&aacute; esperando skins espectaculares, que tengan dedicaci&oacute;n...\r\nManager: &iquest;Y que sugieres Steve?\r\nSteve: Em... No lo s&eacute;... Hacer skins con m&aacute;s efectos... que tal si incluimos diamantes en la nueva skin de Syn--\r\nManager: Efectos. Est&aacute; bien. Haremos que la daga de Shaco sea de color rojo, pero lo descontaremos de tu sueldo.\r\nSteve: &iexcl;Pero se&ntilde;or, la gente---!\r\nManager: Ya basta Steve. Es mucho por hoy. Ahora ve a trabajar, el tiempo es venta de RP.","replies":[{"poster":"Pyke dé Limon","date":"2016-04-12T18:41:33.233+0000","up_votes":7,"down_votes":0,"body":"Pero esto no es de cuando salieron los skins de naipes?","replies":[]},{"poster":"Razek Fury","date":"2016-04-12T18:33:44.611+0000","up_votes":6,"down_votes":0,"body":"te van a ir a buscar los del FBI por infiltrar conversaciones privadas de riot...","replies":[]},{"poster":"Dildo de Moria","date":"2016-04-12T19:22:59.699+0000","up_votes":7,"down_votes":2,"body":"Cambiaría el Ze... por un Zy... (Zyra)","replies":[{"poster":"JACKY FANBOY","date":"2016-04-12T19:48:25.938+0000","up_votes":5,"down_votes":0,"body":"es un comentario viejo de otro usuario","replies":[]}]},{"poster":"HornBore","date":"2016-04-13T02:42:08.823+0000","up_votes":4,"down_votes":0,"body":"Esto se lo afanaste a un pibe que hizo este comentario hace varios meses","replies":[{"poster":"ManuJG","date":"2016-04-13T09:06:58.411+0000","up_votes":2,"down_votes":0,"body":"Lo había hecho yo... es más, acá está el post original http://las.leagueoflegends.com/es/news/game-updates/features/la-maestria-de-campeones-ahora-esta-en-vivo\n\nSolo hice 2 que volvió a postear este chico, me pone contento que aun se acuerden de estos coments xD","replies":[]}]},{"poster":"TheeBoneless","date":"2016-04-13T05:09:43.721+0000","up_votes":1,"down_votes":0,"body":"me imagino a Steve algo parecido a Guybrush Threepwood hablando con Lechuck version humana.... ajajjaja","replies":[]},{"poster":"Cejas","date":"2016-04-13T00:49:48.685+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJAJAJAJAJAJAJAJAJAJA\nAMIGO, ME ALEGRASTE LA TARDE! Y LA NOCHE!\nEstaba en la facultad cursando en el gabinete de sistemas y se me dio por entrar al foro (si, tuve un descanso, y si no lo tenia igual iba a entrar al foro), la cosa es que cuando lei tu primer post me rei muchisimo y ahora ni te digo jajaja.\nGRACIAS!!!!!! y segui jaja","replies":[]},{"poster":"TheBeastOfARAM","date":"2016-04-12T18:29:10.697+0000","up_votes":1,"down_votes":0,"body":"Esto es excelente jajajajajajajaja","replies":[]},{"poster":"chidarakeno","date":"2016-04-13T00:09:52.863+0000","up_votes":1,"down_votes":3,"body":"Querido Riot:\n\nYa se van a cumplir casi 5 años en los que e sido parte de tu comunidad, al principi jugando en NA de vez en cuando porq no tenia pc, menos para comprarme alguna SKIN.\nFue pasando el tiempo y tuve la suerte de conseguirme una computadora que me permitia jugar League of Legends en sus mas bajos requisitos y con un modem el cual me daba un lag imprecionante y pero nunca abandone este juego.\nMe consegui un trabajo estable, un buen sueldo, novia e inclusive soy el padre de na niña hermosa, pero nunca deje de jugar a este juego.\nCon el tiempo fui amasando una pequeña (gran) cantidad de SKINS (unas 140), todos los campeones y todas las runas (con exsepcion a las de regeneracion de energia !quien necesita eso? XD); DE las cuales si riot me regalo 5 es mucho.\nAhora bien porque un jugador veterano como yo que a gastado Cientos de DOLARES en el juego disfruta MUCHO PERO MUCHO MENOS \nla PRIMERA COSA que riot pone como sistema \"GRATUITO\" que ni gratuito porq ya e gastado bastante en la ARTESANIA HEXTECH que un jugador que recien empiesa o que nunca puso un centavo de DOLAR en su juego?\nME EXPLICO Y EN RESUMEN: !Porque a mi que e gastado muchisimo de mi bolsillo me tocan cosas que ya tengo, sean campeones o skins pero a alguien que le importo mierda el juego o recien empiesa puede disfrutar al 100% la experiencia sin tener que estar pensando ?\n                                                                                                              \"\"que no sea repetido que no sea repetido\"\"\nAlmenos que a los que tenemos todos los campeones se nos permita cambiarlos por escencia de aspecto.\n\nAgreguenme chidarakeno","replies":[]}]}