{"poster":"doomguy2003","date":"2019-09-14T15:14:44.361+0000","title":"porque no sacan mas skins ´´ridiculas´´","subforum":"Charlas Generales","up_votes":9,"down_votes":0,"body":"No les pasa que ven las nuevas skins, y les aburre un poco que siempre sea la misma temática ´´épica´´ o ´´gloriosa´´?, no se si me explique bien pero bueno\r\nA mi me gustaría que saquen mas skins absurdas y divertidas como: Dunkmaster{{champion:122}}, Draven Draven{{champion:119}}, Surprise party fiddlesticks {{champion:9}}, etc","replies":[{"poster":"ToxicRunner","date":"2019-09-14T15:40:38.276+0000","up_votes":2,"down_votes":0,"body":"A la gente no le gusta.\n\nSolo mira como se quejaron con Dunkmaster Ivern (que pára mí es buenísima skin)","replies":[{"poster":"Mugman Rojo","date":"2019-09-14T16:18:08.501+0000","up_votes":7,"down_votes":1,"body":"No es eso, es que la skin no encaja para nada con el campeon, osea  podrian sacar ivern falopero traficante y le encaja bien , es mejor si la dunkmaster fuera para illaoi ya que esta SI encaja","replies":[]},{"poster":"Mona","date":"2019-09-14T17:29:20.473+0000","up_votes":1,"down_votes":0,"body":"Lo que decis es cierto pero el ejemplo es malo, en el caso de Ivern se quejaron porque no le sacaron nunca una skin y cuando le sacan una es de una temática que poco pega con el campeón en ese contexto.\nSkins como la de april fool's de Galio dan un mejor ejemplo, donde la idea esta buenísima, pero evidentemente la gente no la compra y por lo tanto no se hacen skins de ese estilo","replies":[]},{"poster":"Delightful Agony","date":"2019-09-15T01:22:15.617+0000","up_votes":1,"down_votes":1,"body":"Siempre discuti con un amigo este tipo de cosas. Lo absurdo es la eleccion de Riot para las skins. Dunkmaster es una tematica buenisima pero pesima aplicada a Ivern, como dijieron Illaoi, Demacia, o propia Noxus. No podes presentarme la tematica con un Darius todo pijudo, badass que tiene las manos en fuego con un palo que literalmente no mata a nadie. Lo mismo que Ekko,o Heimer. No podes hacer a Ekko con tematica de Harrowing si es un humano con tecnologia, hacelo Mecha, Hextech, Blindaje Belico (Battlecast), no se algo que tenga que ver. Heimer lo mismo, como planteas a un cientifico que pone dragones? Zyra podria ir por el mismo lugar pero tiene un poco mas de \"\"\"\"logica\"\"\"\" cuando planta las semillas como huevo, pero igual. Con esto no me refiero a que cada skin tiene que ser de una manera u otra si o si, sino que las skins que no son populares, muchas veces tienen que ver con la pesima eleccion de la compania y no de los jugadores (mas alla de los mains). Cazador Nocturno de Rengar, se olvidaron esa tematica? Con tantos reworks(mayores y menores) a asesinos? El tema es que van a lo seguro y solo les importa $$$.","replies":[]}]},{"poster":"vivakayn","date":"2019-09-14T15:23:51.848+0000","up_votes":3,"down_votes":0,"body":"eso para el aprils fools \n\neste año fue el de gatos y perros, que lo bueno o malo de las skins quedaron eclipsadas por la implacable reputacion de los VS anteriores y la decepcion de este año","replies":[]},{"poster":"La Tanga de Jinx","date":"2019-09-14T21:16:49.084+0000","up_votes":2,"down_votes":0,"body":"Me parece que riot últimamente se enfoca en las temáticas seriamente para que puedan vender pases y puntos de prestigio, como fué el tema de Arcade, Proyecto, Guardianas Estelares, etc.\nLas skin troll o chistosas las van a dejar supongo para el april fools o cuando terminen de sacar para todas las temáticas (Sigo esperando mi Urgot Guardiana Estelar pero por la histiria e importancia que le andan dando a las guardianas no van a sacar una skin troll así)","replies":[]},{"poster":"Borriic III","date":"2019-09-14T21:16:42.643+0000","up_votes":1,"down_votes":0,"body":"#Todos olvidan lo mas importante MANATIES\n\nbien pudiera ser un kled montaurfs, un urfkai o cosas asi, despues de todo la mascota del juego es un adorable manati llamado URF y ya se extraña algo de su tematica y realmente, urf da para todo, cualquier champ lo podes imaginar con una piel de manati, un manati mascota o una espatula y rinde... hasta draven .-.","replies":[{"poster":"Flánn","date":"2019-09-14T23:38:39.066+0000","up_votes":1,"down_votes":0,"body":"Lo que pasa es que la piel de URF ya la tiene warwick así que le sacaría protagonismo ya que fue el quien lo mató uwu.","replies":[{"poster":"Borriic III","date":"2019-09-15T22:35:18.093+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Flánn,realm=LAS,application-id=v7qsfXsE,discussion-id=ZZigJQ2x,comment-id=00050000,timestamp=2019-09-14T23:38:39.066+0000)\n>\n> Lo que pasa es que la piel de URF ya la tiene warwick así que le sacaría protagonismo ya que fue el quien lo mató uwu.\n\npero existe URF el namiti xd, estaria bueno mas URFs por ahi","replies":[]}]}]},{"poster":"Flánn","date":"2019-09-14T23:32:17.762+0000","up_votes":1,"down_votes":0,"body":"dije algo que ya dijo otro por no leer las respuestas antes así que bueno.","replies":[]},{"poster":"Agaard Jum Sai","date":"2019-09-14T20:13:57.672+0000","up_votes":1,"down_votes":0,"body":"No","replies":[]},{"poster":"ProyectAdventure","date":"2019-09-14T16:52:38.392+0000","up_votes":1,"down_votes":0,"body":"hace rato estaba pensando en una skin para kled en donde este montando a willump y una de nunu donde este montando a skaarl por alguna razon","replies":[]}]}