{"poster":"doomguy2003","date":"2020-02-06T02:57:56.379+0000","title":"´´BASHERHUNTER´´ yo te invoco!","subforum":"Charlas Generales","up_votes":5,"down_votes":1,"body":"Este post va dirigido al usuario BASHERHUNTER\r\n¿Cual es tu main, y porque te gusta? ¿que tipo de skin te gustaria que le sacasen? crees que el meme de ´´orgullo peruano´´ esta bueno?","replies":[{"poster":"BASHERHUNTER","date":"2020-02-06T05:14:47.009+0000","up_votes":4,"down_votes":1,"body":"Hola!\nDiria que Yasuo, pero en realidad tengo tres mains: {{champion:157}}, {{champion:11}} y {{champion:77}}.\nMaineo a Yasuo porque me gusta su lore, que a pesar se siempre buscar hacer el bien pocos aprecien su trabajo, aspecto, caracter, habilidades, es un champ para carrear y con el que puedes hacer buenas jugadas o remontar y porque es \"elegante\", por ejemplo Fiora es elegante mientras Trundle u Olaf son algo mas brutos en caracter y estilo.\nQuisiera una skin que fuese ambientada en un futuro no muy lejano, donde Yasuo seria un justiciero por ejemplo.\n\nMaineo a Maestro Yi ya que tambien me gusta su lore, su estilo de combate parecido al de un ninja pero con el honor y elegancia de un samurai, es un champ para carrear y remontar, bueno tomando objetivos como mis otros main y que a pesar de ser algo \"sencillo\" puede hacer outplays.\nMe gustaria que le sacaran una skin estilo \"ninja nictibio\", que no parezca muy humano y de algo de miedo.\n\nMaineo a Udyr porque me gusta que comparta cierto aire espiritual como mis otros main, saber que es una persona algo fria y distanciada del resto pero correcta y de buen corazon, la idea de ser un cambiapieles me encanta, es de los mejores splitpushers y duelistas del juego como los otros main, pero por desgracia no tiene tanta capacidad de carrear ya que no es muy bueno en tf estilo aram.\nMe gustaria una skin de Proyecto tal vez o una con una tematica \"oscura\" donde él sucumbe a los espiritus de su interior.\n\nEn general son champs que estan \"aislados\" y no tienen casi gente de confianza a pesar que siempre se esfuerzan por hacer lo correcto, lo cual refleja un poco mi situacion ya que gente simpatica con quien jugar conozco menos de 10 ya que cuesta encontrar gente amistosa.\nOjala eso cambie pronto.\n\nNo conozco ese meme, si me lo enseñan por favor recien podre opinar.\n\nSuerte!!\n{{sticker:vlad-salute}}","replies":[]}]}