{"poster":"ButtholeSplatter","date":"2014-12-18T09:44:22.460+0000","title":"(IDEA FOR RANKED QUEUE) False Pick","subforum":"Gameplay & Strategy","embed":{"description":"League Of Legends: Oceanic Region. 2,550 likes · 1 talking about this. A Friendly Page Full of Memes, Info, Prizes and Comps for the Oceanic LoL...","url":"https://www.facebook.com/LoLOceanicRegion?ref=bookmarks","image":"/api/embedly/1/image/resize?url=https://fbcdn-profile-a.akamaihd.net/hprofile-ak-xaf1/v/t1.0-1/c0.0.200.200/p200x200/1511614_706609646092603_6720195806199088723_n.jpg?oh=5d1eb7f3524b6419c8edad430f212cf0&oe=54FBD2CB&__gda__=1429755500_7577d33aab84459f2472ba364097e9f7&key=a45e967db0914c7fb472fd4381e6c85b&width=425"},"up_votes":1,"down_votes":0,"body":"**I have an idea. Its called *False Pick*.**\r\n\r\nImagine you are in the champion select of a ranked game, and you've just completed the ban phase **(where both teams only have 2 bans)** and now you're onto the picking phase. You are the team captain **(which doesn't really mean much at the moment)**. Imagine if second pick is selecting a mid lane champion, but you are afraid that they are going to get counterpicked. So you use your teams False Pick, which is where you can pick a mask champion that appears to be your pick. \r\n\r\nAn example in case I havent explained it properly;\r\n\r\n2nd pick select Akali, team captain chooses to use the mask pick and picks Katarina. The enemy team will see that Katarina has been locked in, when really it's Akali. Katarina then disappears from all players champion select pools, as the mask pick acts as a 3rd ban. The champion that you actually select disappears from the selection pool as well, but if the champion **(In this case Akali)** is *searched in the Search Bar*, they will come up grey-ed out, the standard for if a champion is picked.\r\n\r\nI think this would add an entire new level of strategy to the game** before** you've even **entered the Rift**.","replies":[{"poster":"ButtholeSplatter","date":"2014-12-21T23:25:28.419+0000","up_votes":1,"down_votes":0,"body":"bumpityswag","replies":[]},{"poster":"Knuuckles","date":"2014-12-18T10:27:34.028+0000","up_votes":1,"down_votes":0,"body":"it's not a horrible idea but alot! of people have specific rune and masteries set up for certain matchups unless you get 20 seconds or so at the end to see the 'false picked' champion, but still pre game is where 50% of strategies and game play is made and i doubt something so drastic to pre game would happen","replies":[{"poster":"ButtholeSplatter","date":"2014-12-18T10:29:11.616+0000","up_votes":1,"down_votes":0,"body":"That is true, perhaps when the picks have all been selected the mask is dropped and the true pick is revealed? It wouldnt change the champion but it would allow you to change your masteries and rune setups and adapt your game.","replies":[{"poster":"Knuuckles","date":"2014-12-18T10:31:30.664+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ButtholeSplatter,realm=OCE,application-id=FjGAIbRv,discussion-id=ET8FY7QQ,comment-id=00000000,timestamp=2014-12-18T10:29:11.616+0000)\n>\n> That is true, perhaps when the picks have all been selected the mask is dropped and the true pick is revealed? It wouldnt change the champion but it would allow you to change your masteries and rune setups and adapt your game.\n\n\ni do agree it would bring a different perspective on the game but i think it would honestly do more worse than good with our modern day trolls\ni.e. you fals pick katarina and the opponent picks malzahar, then the malz finds out its actually a gangplank which counters him completely and becomes frustrated and starts to abuse or afk","replies":[{"poster":"ButtholeSplatter","date":"2014-12-18T10:34:09.001+0000","up_votes":1,"down_votes":0,"body":"Mmm but if they're that troll-ish that they get mad and afk because they're counterpicked, theyre most likely going to get mad and afk anyway.","replies":[]}]}]}]}]}