{"poster":"Fischmac","date":"2017-04-05T10:42:25.385+0000","title":"Trollen und Reporten","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":9,"body":"So ich hatte gerade ein tolles Spiel im Ranked, es fing alles damit an dass wir in der Champselection waren und dort einen Fiddlesticks main hatten der nat&uuml;rlich auch fiddlesticks gehovert hat. Unser support dachte sich dann &quot;sind wir mal witzig und bannen dem seinen Fiddlesticks weg&quot; daraufhin hat der Support dann MF support mit ghost und flash gespielt und ist ab dem anfang des games in die MIdlane gegangen und hat dort versucht unserem Midlaner den Farm zu stealen. soweit so gut fing ihr Itembuild an, Mobiboots danach dann die coin ausgebaut, mit phantom dancer uns statiks, und dann immer sch&ouml;n in 4 - 5 gegner laufen um die weiter zu feeden , gefolgt von Spampings (die man ja tollerweise nicht muten kann).\r\n\r\nDie Frage die ich mir jetzt stelle ist , wieso muss ich f&uuml;r so ein game noch LP verlieren wenn es so eindeutig ist dass sie trollt. Am besten wird sie erst gar nicht bestraft weil es sich um eine ausnahme handelt?\r\n\r\nIch darf ja leider nicht das Spiel hier rein posten sonst k&ouml;nntet ihr euch gerne selbst ein Bild machen und wenn ich mit solchen Spielern zusammen spielen muss und dann noch daf&uuml;r etwas verliere im Ranked, vergeht mir leider wirklich die Lust an League.","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2017-04-05T11:48:54.626+0000","up_votes":10,"down_votes":0,"body":"du hast dieses jahr erst 2 rankeds gemacht und keins davon war mit einer mf im team lol","replies":[{"poster":"5weeds","date":"2017-04-05T11:53:03.055+0000","up_votes":6,"down_votes":0,"body":"https://imgflip.com/s/meme/Futurama-Fry.jpg\n\nVerdächtig","replies":[]},{"poster":"Fischmac","date":"2017-04-05T14:22:53.842+0000","up_votes":1,"down_votes":1,"body":"Nennt sich zweit account, und bevor ich hier wieder angemacht werde weil ich sowas schreibe wie \"ey guckt euch meine match history an, das und das game die mf hat getrollt\" schreibe ich es direkt mit einem unbeteiligten account","replies":[{"poster":"eingew","date":"2017-04-05T21:45:19.314+0000","up_votes":2,"down_votes":0,"body":"Wieso angemacht? Die Forenregel lautet \"Naming und Shaming\".\n\nWenn ich mich über mein wirklich bescheidenes Ranked heute morgen beschwere, habe ich dann irgendwelche Namen genannt oder explizite Spieler geshamed? Nein. Tatbestand nicht erfüllt, Freispruch.\n\nAber schön, dass du zumindest dir zuliebe einen moralischen Anspruch an den Tag legen willst.","replies":[]}]}]},{"poster":"Vogeljunges","date":"2017-04-05T10:59:57.904+0000","up_votes":3,"down_votes":0,"body":"Ist halt Pech, kommt aber doch verhältnismäßig selten vor, dass Leute so abdrehen... \n\nHatte gestern auch mal wieder das Erlebnis mit einem Toplane Garen, zu dem unser Jungler zu Beginn sagte, dass er ihn nicht ganken kommen wird weil er so miese Stats mit Garen hat und sich lieber auf die anderen Lanes konzentriert - war eigentlich scherzhaft gemeint. Der Garen hat wirklich mies gestartet, stand nach kurzer Zeit 0-3 und bekam auf einmal nen Reisser, schrieb \"Here you damn Jungle, i will make u loose\" und ist dann die nächsten 20 Minuten einfach nur in die Gegner gerannt - ohne dass davor oder danach jemand was zu ihm gesagt hatte. DIe fiese Bemerkung des Jungler und sein schlechter, selbst verschuldeter Start haben ihn so hart getriggert, dass er einfach entschieden hat, alle sollen jetzt das Spiel verlieren...\n\nDummerweise haben wir aber gewonnen :D \nDer Garen stand 0-23, hat dem Gegner ziemlich schnell pro Death nur 10 Gold gegeben und ich fand es echt bemerkenswert, dass der sich nicht anfängt zu langweilen beim reinrennen, sterben, deathtimer abwarte, wieder reinrennen... aber er hats durchgezogen das komplette Spiel. Hat sich dann Reports eingefangen und wird bestraft wenn er solchen Unfug weiterhin betreiben sollte... Zu seinem Unglück hat er auch noch die ganze Zeit im all-chat versucht, dem Gegner Hinweise zu geben was wir grade machen - womit bei der Reportüberprüfung zweifelsfrei nachvollziehbar ist, dass er das alles mi Absicht tat und nicht irgendwie das schlechteste Spiel seines Lebens gemacht hat.\n\nDu siehst, es kann auch anders laufen.\n\nIm Übrigen war es seit langer langer Zeit das erste Mal, dass ich mal wieder einen \"richtigen Troll\" in meinem Team oder beim Gegner gesehen habe.","replies":[{"poster":"SSI CptHaunted","date":"2017-04-05T11:05:19.460+0000","up_votes":5,"down_votes":0,"body":"Wenn man die Leute auch unbedingt dazu provozieren muss...man sollte sich vor Augen halten, dass \"Scherz\", Ironie, Sarkasmus usw in geschriebener Sprache in vielen Fällen nicht einwandfrei zu erkennen ist und somit fehlinterpretiert werden kann.","replies":[{"poster":"Vogeljunges","date":"2017-04-05T11:10:48.407+0000","up_votes":2,"down_votes":0,"body":"Klar, ohne diesen dummen Spruch wäre es ja nie soweit gekommen, den unser Jungler gemacht hat. \nAls Garen dann loslegte, war ich auch darüber echt sauer, dass so ein Quatsch Auslöser einer Niederlage werden wird... Letztendlich Glück gehabt, dass der Gegner es nicht auf die Kette bekommen hat, diesen Vorteil zu nutzen.","replies":[{"poster":"Fischmac","date":"2017-04-05T11:30:49.781+0000","up_votes":1,"down_votes":1,"body":"Naja bei mir kommt es irgendwie recht häufig vor dass leute auf die support posi kommen und dann anfangen zu trollen weil sie kein bock haben support zu spielen, die matchhistory der mf ist ganz normal und nur das game schlägt raus , es wurde nichts geschrieben bevor sie dem fiddle main fiddle weg gebannt hat und dann hat sie auch fast nur auf französisch geschrieben ... also nur weil sie support bekommt hat sie ein recht darauf zu trollen? finde dann sollte riot die auch direkt bestrafen und nicht erst nachdem sie das regelmäßig machen, erst recht im rankend , wäre es draft pick oder so gewesen hätte ich ja nichts gegen gesagt, aber ranked ist es halt einfach ärgerlich wenn leute denken nur weil sie autofill support bekommen direkt trollen zu können , ich spiele auch normal support wenn ich geautofilled werde, zwar nicht überragend aber ich spiele es normal ...","replies":[{"poster":"BlackSkyLane","date":"2017-04-05T23:02:19.512+0000","up_votes":1,"down_votes":0,"body":"was gemacht gehört ist einfach das wenn man eine lane hat nur champs spielen kann die für diese position auswählbar sind dan hört sich das trollen endlich auf, kann deinen frust verstehn den selten ist sowas nun nicht wirklich jedes 2te game bisher.","replies":[{"poster":"manial fly","date":"2017-04-08T07:36:26.377+0000","up_votes":1,"down_votes":0,"body":"Nun das kann man auch nicht machen es gibt auch genug Leute die \"exotische\" Picks machen und damit trotzdem sehr erfolgreich sind. \nFind es teils auch bescheiden wenn man von seinen Teammates schon in der Championselect geflamed wird nur weil man einen Champ spielt der ihnen nicht passt.","replies":[{"poster":"BlackSkyLane","date":"2017-04-11T19:08:09.096+0000","up_votes":1,"down_votes":0,"body":"sicher würde es gehn, *exotische picks hin oder her* ich spiel auch kein shaco auf top nur weil es iwo mal gespielt wurde und ich den champ nicht kann. sry späte aw aber rl geht vor:)","replies":[]}]}]},{"poster":"eingew","date":"2017-04-05T21:50:06.812+0000","up_votes":1,"down_votes":0,"body":"Riot hat aber kein Bestrafungssystem, sondern ein Reformationssystem. Rechenleistung darauf zu verschwenden, jemanden zu bestrafen, nur damit der sein Verhalten *in keinster Weise* ändert ist halt völlig verschwendet. Der einzige, der davon profitieren würde, ist der Gekränkte, der sich verletzt fühlt und dessen Wunsch nach Rache oder \"Gerechtigkeit\" nun ignoriert wird, aufgrund der simplen Tatsache, dass es absolut nichts bringt, der MF mit überflüssigen Strafen die Laune zu verderben.\n\nAußer vielleicht ihren Frust zu steigern und damit ihr Potential für negative Taten wie absichtliches Versauen von Spielen zu steigern...","replies":[]}]}]}]}]},{"poster":"StormbringerLoki","date":"2017-04-05T10:53:21.550+0000","up_votes":2,"down_votes":0,"body":"Also erstmal hilft ein Int-Report natürlich ~~nicht~~ auf jeden Fall ;) \nSieh es mal so, in einem Game sind 9 Randoms und natürlich du selbst (hoffe ich mal, sonst wäre es ja accountsharing :P ). \nDas bedeutet, die Chance, dass ein Leaver/Troll in deinem Team ist, wenn es einem in einem Game gibt, beträgt theoretisch also 4/9, im Gegnerteam 5/9. Auf lange Sicht gesehen hast du dadurch also eher einen Vor- als einen Nachteil, deswegen ist es auch okay, wenn man dafür dann haltLP abgezogen bekommt, man bekommt ja dadurch auch welche zurück (und theoretisch mehr).\n\nDein Loki","replies":[{"poster":"eingew","date":"2017-04-05T21:54:31.332+0000","up_votes":1,"down_votes":0,"body":"Nicht nur theoretisch. Die Wahrscheinlichkeit dafür, dass es anders kommt, ist tatsächlich dermaßen gering, dass ich in meinen nunmehr circa 3 Jahren Aktivität im Forum mit einem gigantischen Haufen ziemlich genervter Spieler über zig Situationen ingame nicht einen gesehen habe, der tatsächlich mehr *wirklich echt absichtliche* Feeder im eigenen als im gegnerischen Team hatte.\n\nUnd selbst wenn einer auftauchen sollte, wahrscheinlich gibts gar nicht genug Feeder, als dass es ihm wirklich auffallen würde.\n\nDie einzigen, die es tatsächlich gab, waren solche, die seltsamerweise immer besonders schlechte Teams hatten... seltsamerweise sind die aber auch im Forum selbst nicht gerade durch motivierendes Verhalten aufgefallen.","replies":[]}]},{"poster":"Released Ape","date":"2017-04-05T23:13:39.086+0000","up_votes":1,"down_votes":0,"body":"Und jetzt komplett unvoreingenommen wie oft denkst du passiert das uns? Es kommt oft vor das jemand in Support autofilled wird und dann gibt es **grob** 2 Möglichkeiten:\n\n1. Fallen kaum aus, fragen eventuell welchen Support man möchte oder haben bereits 1-2 Support Picks in der Hinterhand. Spielen eventuell ihre Champions etwas schlechter als Support Mains es tun in Relation zu der Elo.\n\n2. Er zeigt es dem ganzen Team \"I am autofilled supp, gg riot\" - diese Spieler zeigen in der Regel ein deutlich negativeres Verhalten und sind leicht zu \"triggern\". Denn in ihren Augen sind sie bereits genug geschädigt - da sie Autofilled sind und supporten müssen - da reicht eine Kleinigkeit, die kann auch vollkommen subjektiv sein (Ihm gefällt ein Team pick nicht -> trollt los , weil jemand nach einer Lane fragt -> trollt los, ...) manchmal kann man das entschärfen und gut zureden. Und manchmal merkt man schon an der Ausdrucksart, das hier das Kosten/Leistungsverhältnis niemals aufgehen wird.\n\nExotische Picks kommen in beiden Fällen vor. Das ist von Spieler zu Spieler unterschiedlich. Warum man dafür LP verliert? Die Frage kann dir hier keine so richtig beantworten, aber es gibt ein paar Ansätze warum es so ist (Dauerhafter Anstieg, negative Fälle werden durch positive Fälle ausgeglichen, etc.). Im Umkehrschluss dürftest du keine LP bekommen, wenn ein Gegner trollt - würde das dir auch passen? Natürlich will man negatives Verhalten möglichst aus League verbannen - nur ist das gar nicht so einfach (du kannst dich gerne in die Thematik mehr einlesen, gerne auch von LoL losgelöst).","replies":[]},{"poster":"Shacoláde","date":"2017-04-05T10:56:32.351+0000","up_votes":1,"down_votes":1,"body":"Ich kann deinen frust verstehen.\n\nDafür hast du 2 Möglichkeiten:\nVor dem Game dodgen, wenn du weist das es warscheinlich darauf hinauslaufen wird und die -3LP mitnehmen.\noder: Einfach Reporten und die Niederlage, ohne Geflame oder Reportaufrufe fertig spielen.\nWenn du an der Situation nicht ändern kannst ist es nicht von Vorteil sich drüber aufzuregen.\nEr bekommt seine Strafe schon, fertig!","replies":[]}]}