{"poster":"GosiKill","date":"2016-05-23T18:56:04.547+0000","title":"Gente para jugar premade [Importante entrar]","subforum":"Reclutamiento","up_votes":2,"down_votes":2,"body":"Bueno la voy hacer corta amigos no quiero que me critiquen mi post ni nada y no me digan que no se carrear. por que es ilogico...\r\nEra oro 1 ... jugue las 10 partidas gane 8 pero como tenia mas perdidas q ganadas quede plata 1,, ahora soy plata 4 y no gano 1 partida por mas bien que juegue por mas objetivos que haga y cuando hacerlos siempre voy a perder por que me tocan 4 personas que juegan por jugar y no aportan en nada solo mueren y si siempre me tocan SIEMPRE, ya estoy muy cansado de dejar todo en cada partida para perder por la gente asi que bueno busco gente piola q quiera rankear y subir lo mas rapido posible, vale aclarar que soy un dios no me agrando ni nada pero tengo la confianza para decir q soy muy bueno para el elo en cual me encuentro no merezco estar aca pero bueno solo no se puede, asi que bueno el q quiera jugar me dejan su nick o me agregan \r\ntengo mic,ts3, y skype para mejor comunicacion \r\n\r\nPD: no vale mirar el historial ni los kda ya que tengo pocas partidas y son muy rancias  ..\r\n\r\njuego todas las lineas . MAIN ADC","replies":[{"poster":"mansatula","date":"2016-05-23T19:15:30.595+0000","up_votes":3,"down_votes":0,"body":"El sistema no esta mal, ese es tu lvl de juego y nada mas...\n\nYo con esta cuenta gane 7,perdi 3 y quede oro4(era oro5 )\n\nY ahora jugue otra donde solo me salieron platinos, igual gane y jugue contra una main lb\n\nhttp://imgur.com/pB0H4dG\n\nNo creo ser especial,ni nada solo juego mi campeon y ya","replies":[{"poster":"GosiKill","date":"2016-05-24T11:46:59.369+0000","up_votes":1,"down_votes":0,"body":"y que tiene q ver?? no entiendo tu respuesta amigo yo era oro 1 pero como jugaba ranked siempre tenia mas perdidas q ganadas y me dejaron plata 1 ganando 8 partidas y ahora juego con gente basura no entiendo tu respuesta bien al pedo","replies":[{"poster":"mansatula","date":"2016-05-26T16:06:52.662+0000","up_votes":1,"down_votes":0,"body":"Puedes subir por fuerza bruta,(cantidad de partidas)...\n\nEso no significa que el sistema este mal,\n\nEl sistema es simple,  premia la habilidad dando lp y empujando al player a la siguiente liga y detiene ,frena al jugador con habilidad baja,simple\n\nademas estas 99 Wins 125 Losses,win rate negativo, el sistema te va jalar para llevarte a tu nivel de habilidad","replies":[]}]}]},{"poster":"Casandra Lange","date":"2016-05-23T18:59:37.842+0000","up_votes":1,"down_votes":0,"body":"Te puedo supportear pero soy una humilde plata 5, no soy la reencarnación de ninguna deidad.","replies":[{"poster":"GosiKill","date":"2016-05-24T11:48:35.991+0000","up_votes":1,"down_votes":0,"body":"probemos amgia ahi te agregue!","replies":[]}]},{"poster":"RaResz","date":"2016-05-23T19:02:37.566+0000","up_votes":1,"down_votes":0,"body":"No te recomiendo hacer premade (a menos que sean pros y no necesiten de los otros para ganar).\nMi experiencia haciendo dúo es que siempre (y digo siempre) te va a tocar en tu equipo gente que es peor que del otro lado.","replies":[{"poster":"GosiKill","date":"2016-05-24T11:48:11.386+0000","up_votes":1,"down_votes":0,"body":"gracias por el consejo amigo pero si hago premade es con gente que carrea como yo que sabe jugar de verdad. no voy hacer duo con gente q no sabe jugar aparte mi intencion no es hacer duo si no jugar de a 3 minimo","replies":[]}]},{"poster":"Queseyo2","date":"2016-05-23T19:09:20.258+0000","up_votes":1,"down_votes":0,"body":"Hola actualmente soy unranked, juego a la madrugada todos los dias un par de partidas si te interesa agregame.\n\nMaineo mid","replies":[]}]}