{"poster":"SecretWindow","date":"2017-08-22T10:14:58.321+0000","title":"hermoso troleo riot","subforum":"Charlas Generales","up_votes":2,"down_votes":9,"body":"venia en racha de victorias, empiezo las promos, perdi las 2 porque los team mates que me diste eran totalmente impresentables, de lo peor de lo peor :)))))\r\n\r\nsegui troleando con tu sistema injusto","replies":[{"poster":"9081913DEL1","date":"2017-08-22T10:28:08.016+0000","up_votes":1,"down_votes":0,"body":"En estos dias estuve siguiendo un streamer de la zona, y en 16 horas llego a platino 3 creo por ahi.\n\nSi el sistema fuera por lo que alguien no sube, no podria haber llegado ahi, no crees?\n\nEs una cuestión de tomarse las cosas con el enfoque correcto. Creeme.\n\nSaludos y suerte invocador!","replies":[{"poster":"Deigex","date":"2017-08-22T11:22:54.955+0000","up_votes":1,"down_votes":0,"body":"El tema es que los jugadores que hacen este tipo de reclamo son los que tienen un nivel promedio para la liga en la que se encuentran y no marcan diferencia en una partida. Por ejemplo cualquier jugador diamante alto sube a diamante 5 sin esfuerzo porque además de jugar bien mecánicamente están acostumbrados a otro nivel de macro game y rotaciones, además de saber identificar los errores cometidos por el equipo enemigo y la capacidad de responder con facilidad frente a esas situaciones. \n\"Trollear\" me gustaría analizar su promo pero no postea desde su cuenta.","replies":[{"poster":"DpR","date":"2017-08-22T12:00:21.181+0000","up_votes":1,"down_votes":0,"body":"Muy bien dicho amigo, pero no solo es eso, toda la partida tambien depende de jugar en equipo, por muy pro que sea uno jugar con 9 es muy difícil por no decir imposible,\n\n:)","replies":[{"poster":"9081913DEL1","date":"2017-08-22T12:56:34.317+0000","up_votes":2,"down_votes":0,"body":"Ambos tienen razon, es un juego de equipo.\n\nCreo que todos los que ya pasaron los primeros peldaños coincidimos en que la clave esta en centrarse en lo que hace uno, a fin de cuentas es lo unico que podemos controlar todas las partidas.\n\nSaludos!","replies":[]}]}]}]},{"poster":"DpR","date":"2017-08-22T10:59:42.787+0000","up_votes":2,"down_votes":0,"body":"El sistema amigo no sabe como va a jugar cada uno, el sistema empareja a los que tienen el mismo MMR :)","replies":[]},{"poster":"Gannicüs","date":"2017-08-22T14:26:48.763+0000","up_votes":1,"down_votes":0,"body":"En este servidor si no sos un flammer toxico al cual no le importa nada no la pasas bien, es mas, si intentas subir, ser buen compañero y ayudar a tu equipo lo unico que conseguis es tener mas muertes intentando salvar a tus compañeros que discuten entre ellos y se van afk o se ponen a escribir en lugar de jugar, muchos te van a decir que no podes carrear o que es tu culpa pero es muuuuy facil hacerse el super jugador moralista si nunca jugaste en elos bajos donde la gente hace duo para entrar a ranked a molestar a los demas, y pobre de vos si estas en promo y los trolls se enteran! jajajaja este server es un chiste, un blooper tras otro","replies":[]}]}