{"poster":"Koramix","date":"2016-07-29T22:47:09.143+0000","title":"Unbalance Matchmaking","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":3,"body":"Hallo,\r\nich bin zurzeit Silber 1 und spiele fast keine Ranglistenspiele. Gerade eben habe ich mein erstes Ranked nach 5 Monaten gemacht und was bekomme ich wieder als Gegner? Nat&uuml;rlich Platin 4 oder bessere! Wie soll man sich da noch hoch spielen wenn man jedes mal von solchen Leuten zerrissen wird?\r\n\r\nIch hoffe Riot macht mal was dagegen!","replies":[{"poster":"Doomsday Judge","date":"2016-08-04T14:55:35.390+0000","up_votes":1,"down_votes":0,"body":"Vielleicht versuchst du zuerst das System zu verstehen bevor du dich darüber beschwerst?\nPrinzipiell ist es gut, wenn du gegen höher gerankte Spieler antreten musst, denn das bedeutet, dass dein MMR (aka Elo, Matchmaking Rating) höher liegt als deine aktuelle Liga-Platzierung. Das bringt einige angenehme Effekte mit sich:\n1. du bekommst pro Sieg mehr LP\n2. du verlierst pro Niederlage weniger LP\n3. im Bezug auf 1. und 2. steigst du mit 50:50 Win-Loss-Ratio auf\n\nGanz ehrlich: Richtig spielen lernst du nur gegen bessere Gegner. Wie willst du jemals auf deine Fehler aufmerksam werden und sie ausbessern, wenn deine Gegner sie nicht erkennen und punishen? Da liegt das Problem im Low-Elo. Die Spieler machen ständig Fehler deren weder sie noch ihre Gegner sich bewusst sind. Genau solche Schwächen wird aber ein guter Spieler sehen und ausnutzen, um dich zu besiegen.\nEs sollte nicht dein erstrangiges Ziel sein, im Ranking aufzusteigen, sondern dein persönliches Spiel, deinen Skill, zu verbessern. Spielst du besser als der Durchschnitt deiner Mitspieler, wirst du zwangsläufig auch aufsteigen. Du kannst nicht erwarten, besser zu werden, wenn du nicht bereit bist, dich spielerisch weiterzuentwickeln. Das erfordert Reflektion und vor allem die Fähigkeit, eigene Fehler zu erkennen und die Verantwortung dafür zu übernehmen, statt die Schuld auf andere zu schieben. Natürlich gibt's Spiele, die man unverdient verliert, aber auch solche, die man unverdient gewinnt, genauso wie Losing- oder Winning-Sprees. Die einzige Konstante und Einflussgröße in deinen Spielen, die du beherrschen kannst, bist du selbst, nicht deine Teammember oder deine Gegner. Also arbeite an dir und du wirst aufsteigen!","replies":[]},{"poster":"SeaHorseCalamity","date":"2016-07-30T10:40:54.493+0000","up_votes":1,"down_votes":0,"body":"Das kann nunmal passieren, wenn du einegute MMR hast und der Platinspieler eine sehr schlechte.\nIst mit Sicherheit ein Einzelfall, da dafür 2 Leute eine MMR haben müssen, die stark von ihrer Elo abweicht.\nFalls das des öfteren Vorkommt und du so oft Gewinnst wie verlierst wirst do aufsteigen.\nFalls es öfter vorkommt und du jedes Spiel verlierst wirst du in der MMR sinken, bis du wieder bezwingbare Gegner bekommst.\n\nIm Allgemeinen ist es ein gutes Zeichen für den Aufstieg, wenn du sehr starke Gegner bekommst, da das System dich dann mit diesen in einen Topf wirft -> Du bekommst viel mehr Punkte für nen Sieg als du durch eine Niederlage verlierst.","replies":[]},{"poster":"Bocherto","date":"2016-07-29T23:00:44.661+0000","up_votes":1,"down_votes":1,"body":"Übrings wenn du Aufsteigen möchtest und folglich denkst höher spielen zu können ist es doch kein Problem gegen sowas anzutreten.","replies":[]},{"poster":"Coinﬂip Jungler","date":"2016-07-29T22:58:53.900+0000","up_votes":1,"down_votes":1,"body":"1. hattest du auch einen platin2 Spieler im Team und 2. ist das wohl das erste mal das das vorgekommen ist :)\n\nSpiel doch einfach weiter rankeds :)","replies":[]}]}