{"poster":"Saythes","date":"2015-10-02T08:42:57.832+0000","title":"Riot Merchandise price","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Hey guys! \r\nSo I&#039;m Australian, and I have recently caught my eye on the new &quot;Championship Thresh&quot; figure from the Riot store. It says it&#039;s 30 U.S dollars, but does that mean we have to pay that currency ($42.50 here) or actual $30 AU currency? I got a little bit confused as it is the OCE merch site and the currency is in U.S dollars. Also, paying $42.50 is a little pricy for a statue that size. I don&#039;t even think that covers shipping bills... \r\n\r\nPlease tell me! I wanna decide if I&#039;m going to buy that statue.","replies":[{"poster":"Tele","date":"2015-10-02T09:09:31.463+0000","up_votes":1,"down_votes":0,"body":"Shipping is $10 by the way. It's in US dollars, you can tell because in the right hand top corner it has \"US$\"","replies":[{"poster":"Saythes","date":"2015-10-02T09:16:46.017+0000","up_votes":1,"down_votes":0,"body":"So it's $52 dollars for a little statue... Rip off dude! Those POP figure you get from EB games are almost as good quality and are $10-15... And there about the same size and quality!","replies":[{"poster":"Tele","date":"2015-10-02T09:53:16.984+0000","up_votes":1,"down_votes":0,"body":"Lets not forget it comes with a limited edition Championship Thresh skin worth around $10. Pop Vinyl's are actually AU $18. So taking that into account;\n\n52 - 10 = 42 (for the skin)\n\n42 - 10 = 32 (it's unfair to include shipping, since Pop Vinyls would also cost this much to ship)\n\nSo the actual Thresh figure is worth $32. that's $14 more than a Pop Vinyl. You can consider the extra price for, scarcity (due to it being available for a limited time), the fact that it's Thresh and that the Thresh figure is 0.75 inches taller than your average Pop Vinyl. \n\nThat's the price of intellectual property :D","replies":[{"poster":"Saythes","date":"2015-10-02T16:09:20.859+0000","up_votes":1,"down_votes":0,"body":"Well I never said I order my POP figures online :p, plus they are actually $15 here, 10 when they go on sale (Christmas, big sale etc...) \nAlso, shipping still does count, you still paying for shipping, which adds onto the statues price!","replies":[{"poster":"Tele","date":"2015-10-02T21:54:36.223+0000","up_votes":1,"down_votes":0,"body":"Maybe your store is more generous with their prices but [here](https://ebgames.com.au/loot-204499-Guardians-of-the-Galaxy---Dancing-Groot-Pop-Vinyl-Bobble-Head-Figure-Loot) it has a standard AU$18 price. It doesn't matter if you order them on-line or not, since Thresh is only available on-line we need to make a direct comparison. If you wish you could fly to Riot Merchandise HQ in California and I'm sure they'll sell you a Thresh figure minus the shipping.\n\nIf you ordered a Pop Vinyl from America it would also be $10 shipping, it's unfair to complain about shipping just because it's not available in stores here.","replies":[]}]}]}]}]}]}