{"poster":"Saythes","date":"2015-07-02T08:32:26.938+0000","title":"Was your free champion the one you wanted?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"I love you riot, there was 3 champs I wanted very badly, one being I would jump over the moon if I got it, and I got one of those 3 champs outta like the 60 more champs I needs unlock...\n\nThose champs included\nReksai ( was the main one I wanted)\nIrelia (was coming in 2nd)\nAnd Ekko (was coming in 3rd)\n\nAnd am happy to say I got Irelia! It wasn&#039;t Reksai, but it was one I wanted really badly... Thanks riot!!!\n\nSo who&#039;d you get? Was it the one you wanted, or one you didn&#039;t want? Comment away!","replies":[{"poster":"DrMattie","date":"2015-07-06T02:42:47.194+0000","up_votes":1,"down_votes":0,"body":"I got Guardian Of The Sands Skarner.","replies":[]},{"poster":"csm","date":"2015-07-05T06:22:42.571+0000","up_votes":1,"down_votes":0,"body":"Got Prom queen annie on this account, orianna on my smurf, can't complain.","replies":[]},{"poster":"Project Xayah","date":"2015-07-05T03:55:59.258+0000","up_votes":1,"down_votes":0,"body":"On this account, I got Fizz. I don't like Fizz... Thanks Rito...","replies":[]},{"poster":"TeCoolMage","date":"2015-07-05T00:54:17.370+0000","up_votes":1,"down_votes":0,"body":"I got Lissandra, I would've preferred another champ (I only play male / non human / non gragas champs because 99% of them need something to eat while the 1% eats too much, Lissandra isn't too bad tho.), like Bard, Azir, or Rammussss!\n\nBut I remembered I only play one champ. Oh well. I'm kinda paranoid, if I get _just_ enough champs to qualify for everything (I think it's 16 for team builder?), would it be better than having all champs since my chance of getting one I specialize in is higher? Is it possible to disable champs?","replies":[]},{"poster":"ShuffledPancake","date":"2015-07-02T09:11:41.841+0000","up_votes":1,"down_votes":0,"body":"I think alot of people got azir, everyone i asked said azir (and i got him), but they also said no one will get one less then 560 rp so there isnt a gamble lel","replies":[{"poster":"Saythes","date":"2015-07-02T09:57:06.726+0000","up_votes":1,"down_votes":0,"body":"Ugh, and I though azir free week was annoying.. Now everyone owns him... (P.S, Azir main, due to his uncommoness, but not anymore) but still, congrats on getting him, he's really good in the right hands :D","replies":[]}]},{"poster":"Istehz","date":"2015-07-02T09:03:59.693+0000","up_votes":1,"down_votes":0,"body":"Still haven't received my skin (I own all champions)","replies":[]},{"poster":"Lumer","date":"2015-07-02T09:00:53.051+0000","up_votes":1,"down_votes":0,"body":"Still waiting on mine.\nI only have a few champs left, so I'm pretty sure I am getting a skin.\nI hope its for Braum or Syndra","replies":[]},{"poster":"Erøse","date":"2015-07-02T08:48:09.021+0000","up_votes":1,"down_votes":0,"body":"I really wanted 3 champs badly and it was:\nAzir (1st choice)\nGnar(2nd choice)\nRengar(3rd choice)\n\n\nand.....I got azir :D","replies":[]},{"poster":"DragonOfTheVoid","date":"2015-07-02T10:09:58.502+0000","up_votes":1,"down_votes":2,"body":"fucking bard bard wtf riot get your shit in work bard can be good but im shit at him bad ults go take a magical Jerne and die cos they all there gg riot I quit ","replies":[]}]}