{"poster":"diaLUL","date":"2017-09-19T20:01:55.661+0000","title":"YourShop reset","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo,\r\n\r\nIch wollte mir heute einen reduzierten Skin beim YourShop kaufen, nun wurden diese aber alle gererollt\r\nIch w&uuml;rde gerne wissen ob man die die man davor kaufen konnte, jetzt immernoch kaufen kann?\r\nDanke im vorraus.\r\n\r\nFreundliche Gr&uuml;&szlig;e\r\nDiaLuL","replies":[{"poster":"TossAGankToBot","date":"2017-09-19T20:46:49.631+0000","up_votes":1,"down_votes":0,"body":"Hatte Warringkingdom Azir,und jetzt? Dumme Skins die keiner gebraucht. Wollte grade den Supp anschreiben,da ich den Thread erst vorhin gefunden habe. GG Riot,bis Januar warten,wieder unnötige 1350rp,so wärens 675 gewesen. Denkt mal nach bevor ich sowas macht. Ich will nicht wissen wie viele angepisst vor ihrem Pc sitzen.","replies":[{"poster":"Gin","date":"2017-09-20T08:23:30.993+0000","up_votes":1,"down_votes":0,"body":"Es gab einen Bug durch den manche grundlos Skins wie Frozen Ezreal, Riot Tristana und ähnliches in ihrem Shop hatten.\n\nDeswegen hat Riot den Fehler behoben, die Shops disabled, und musste diese neu generieren lassen. (Weil manche Spieler besagte Skins im Shop hatten.)\n\nAber weil Riot Riot ist, geben die dir die Möglichkeit immer noch die Angebote aus dem alten Shop zu kriegen wenn du nachfragst.\n\nWenn du 6 komplett neue Skins beim zweiten Mal hast, hast du sogar 12 Angebote.\n\nIst also die beste Lösung für alle. Und den Support deswegen anzuschreiben ist jetzt auch nicht sonderlich schwer ^^\n\nDie sind dort immer freundlich, und das sollte innerhalb von 24h erledigt sein.","replies":[{"poster":"Qbert","date":"2017-09-20T08:27:26.930+0000","up_votes":1,"down_votes":0,"body":"Gab es nicht bisher bei (fast) jedem \"Dein Shop\"-Spezial einen Reset? Mir war so ... was ist da los? :D :P","replies":[{"poster":"Gin","date":"2017-09-20T08:30:50.894+0000","up_votes":1,"down_votes":0,"body":"Die haben die Auswahl der Skins angepasst, so dass diese eher auf Champions treffen die du gerne und häufig spielst.\n\nUnd dort ist denen dann eventuell ein Fehler passiert.\n\nWas und ob das die Ursache war, weiß ich nicht. Aber Riots Lösung für das Dilemma finde ich ziemlich vernünftig.","replies":[]}]}]}]},{"poster":"Crux","date":"2017-09-19T20:04:24.978+0000","up_votes":1,"down_votes":0,"body":"Hey.\nselbes Problem.\nHatte die Winter-Ori um 500rp im Shop, jetzt ist sie weg.\nSitze mit der PSC hier, will aber keinen der neuen Skins.\nIst schon dezent sche**e.","replies":[{"poster":"Gin","date":"2017-09-20T08:18:56.370+0000","up_votes":1,"down_votes":0,"body":"Das gleiche wie ich den anderen oben geschrieben habe:\n\nDen [Support](https://support.riotgames.com/hc/de/requests/new) deswegen kontaktieren.","replies":[]}]},{"poster":"diaLUL","date":"2017-09-19T20:10:41.943+0000","up_votes":1,"down_votes":0,"body":"Ich denke dass ich dir ein wenig helfen kann,\nunter dem ursprünglichen post auf der Lol seite habe ich folgendes gefunden:\n\nIf you write it in to Player Support, we will honor the deal. They have a record of the first set of offers we displayed to everyone.\n Pabro  - about 22 hours ago\n\nich habe ein Ticket im Support bereich von Riot gemacht und hoffe jetzt dass die mir weiterhelfen können. Ich denke du solltest das gleiche machen.","replies":[{"poster":"Dagnos iol","date":"2017-09-19T20:41:52.648+0000","up_votes":1,"down_votes":0,"body":"Hey ich hab des selbe problem das alles bei mir einfach schlechter wurde und ich wollt jz fragen was du genau gemacht hast (versteh \"ticket\" nich). Es wär halt schon geil wenn ich die alten skins wieder bekommen könnte.","replies":[{"poster":"Gin","date":"2017-09-20T08:18:06.398+0000","up_votes":1,"down_votes":0,"body":"Den [offiziellen Support](https://support.riotgames.com/hc/de/requests/new) deswegen anschreiben. \n\nAka ein Ticket erstellen.","replies":[]}]}]}]}