{"poster":"Ism","date":"2016-06-10T13:39:39.705+0000","title":"\"Cosas típicas\" cuando juegas","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":1,"body":"Buenos d&iacute;as, me gustar&iacute;a informar y que me puedan explicar una cuesti&oacute;n de las Clasificatorias, sobre como podes evitar que alguien seleccione un campe&oacute;n que no es acorde a determinado rol, o como le har&iacute;an entender a un compa&ntilde;ero de equipo que esta cumpliendo mal dicho rol. Esto viene a que jugu&eacute; una Clasificatoria y perdimos, no fue porque el equipo enemigo tuviera algo que no pudiera evitarse, detenerse o &quot;aniquilar&quot;. No, el problema provino del mismo equipo en el que estaba, mi raz&oacute;n de queja, no es que  me involucren con gente &quot;mala&quot; como muchos dir&iacute;an, mi queja/problema/inquietud seria como jugadores que est&aacute;n acostumbrados a ese modo, que comparten mi misma liga, inventen tantas jugadas torpes.\r\n Por ejemplo: el adc que me toco en esa partida es Bronce I, una Miss Fortune con Skin y maestria 6, todos cre&iacute;mos que seria muy bueno, salio de linea 1/7; el jungla siendo plata V selecciono a yasuo, le robaron jungla, y no gankeaba completamente bien, porque no sabia como entrar a las lineas; el mid tambi&eacute;n plata V con 3 personajes con maestr&iacute;a 6, perdi&oacute; linea, no lo culpamos por perder linea a todos nos pasa, pero en momentos de pelear en equipo, no gastaba el mana para intentar ganarla; el top jugaba muy bien, pero siempre estaba solo, insultaba y todo lo que le suced&iacute;a era nuestra culpa, seg&uacute;n su l&oacute;gica TODOS eramos malo, a excepci&oacute;n de &eacute;l. \r\n Alguien podr&iacute;a explicarme, si tengo un buen comportamiento mientras juego, juego lo mejor que puedo, ayudo y cumplo bien mi rol, el porque debe tocarme gente que se comporte o juegue de este modo? Podr&iacute;an explicarme por favor como se supone que funciona ? Porque creo que a todos nos a pasado que alguna vez alguien en nuestro team ha ido mal o hizo algo que no deb&iacute;a o simplemente encontr&oacute; divertido provocar una derrota a todo su equipo. Si alguien quisiera dar una buena opini&oacute;n o contar una experiencia, adelante. Desde ya si se han tomado la molestia de leer, muchas gracias.","replies":[{"poster":"Summer Nights","date":"2016-06-10T15:15:42.860+0000","up_votes":2,"down_votes":0,"body":"Tu actitud por más buena que sea no tiene nada que ver con tu nivel de juego, toda esa gente que mencionas tiene el mismo nivel de juego que vos, por eso te emparejan así. Soución = mejorar, subir, dejar atras a esos players.","replies":[]},{"poster":"Nyán","date":"2016-06-10T16:54:38.752+0000","up_votes":1,"down_votes":0,"body":"¿Quieres que Riot te haga un emparejamiento especial y que sepan cuáles son los flamers y cuáles son los que tienen buena actitud? ¿Quieres tratamiento diferenciado por portarte bien?\n\nHay mucha gente como tú. No van a poder hacer eso. Simplemente meten a todos a una cola, flamers, tóxicos, AFKs, smurfs, gente buena onda, y emparejan a partir del MMR, que no está ligado a tu comportamiento. \n\nSiempre hay gente con el coeficiente intelectual menor a 50 o alguien tilteado. Estarías pidiendo un milagro si quieres que no te toquen en ninguna partida, y tú razón? \"Porque no soy flamer\". Yo tampoco soy flamer, de hecho intento levantarles el ánimo si piensan que no vamos a ganar (a veces funciona), pero no me quejo de los tóxicos y tampoco los uso como excusa de por qué no subo, por qué mi vida no es perfecta, etc. En un juego con tantos jugadores, es normal encontrarse con este tipo de gente. Puedes salir a la calle y no es sorpresa que te encuentres con gente parecida a la de tu ranked. \n\n**Es imposible tener 100% de winrate**. Acepta tus derrotas y mira qué aprendiste o qué practicaste en ella (si no fuiste jg o supp, practicaste tu farmeo). No te concentres en los juegos individuales, míralo de más lejos. Sobre tu primer punto, no puedes controlar a las demás personas. Concéntrate en tí mismo y te ahorras el tilteo, la frustración. \n\nSi te crees superior a ellos, sube, porque estás en su misma liga en este momento. No digo que más arriba no te encuentres con ellos, pero podrás demostrar que tienes un nivel mayor de juego.","replies":[{"poster":"Ism","date":"2016-06-19T22:00:17.848+0000","up_votes":1,"down_votes":0,"body":"El problema no es el ser \"mejor\"/\"peor\" o simplemente, como dijiste, tener bajo CI. Si es todo aleatorio, y venís ganando y por perder 1 o 2 todo se derrumba y siempre toca, y siempre alguna que otra vez hay una mala partida que te va muy feo, pero 4 seguidas porque ya 2 de el equipo eligen cualquier cosa para ir, creo que queda en la cabeza de c/u","replies":[]}]},{"poster":"Conejito Feliz","date":"2016-06-10T17:32:42.746+0000","up_votes":1,"down_votes":0,"body":"Desde cuando tener maestría te hace bueno en ranked?. Yo tengo maestría 5 con tresh y ni me acordaba. Hace 1 año que no lo usaba y no pego un gancho ni que me paguen.\n\nLo único que no entiendo que haces jugando support en bronce. Si sos bueno podes carrear pero con algo como zyra o la antigua cassio...pero si tenés las mecánicas para carrear desde sup con esos campeones, anda mid y es mas fácil...","replies":[{"poster":"Ism","date":"2016-06-19T21:55:17.142+0000","up_votes":1,"down_votes":0,"body":"Si pongo \"Mid\" como primario y \"Sup\" secundario, voy sup igual; prefiero caer en la idea e ir sup, pero gracias","replies":[]}]},{"poster":"Lince Salvaje","date":"2016-06-10T14:02:37.438+0000","up_votes":1,"down_votes":0,"body":"Lo de campeones no acordes a su rol... eso no te voy a dar la razon por el echo de que yo siempre voy top con algun supp.\n{{champion:201}} {{champion:223}} {{champion:412}} {{champion:44}} ..\nTodos estos los uso  AD, Tank full vida, full critico, y tank ad.\ny son campeones con el rol de soporte..\n\nDespues que la gente tenga maestría 6 no significa nada, Todos conseguimos una s en normales.\nSimplemente te toca gente mala, a todos nos pasa","replies":[{"poster":"Br1bkn","date":"2016-06-12T00:57:35.889+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lince Salvaje,realm=LAS,application-id=PJAKt7ph,discussion-id=h2WunarY,comment-id=0000,timestamp=2016-06-10T14:02:37.438+0000)\n>\n> Lo de campeones no acordes a su rol... eso no te voy a dar la razon por el echo de que yo siempre voy top con algun supp.\n> {{champion:201}} {{champion:223}} {{champion:412}} {{champion:44}} ..\n> Todos estos los uso  AD, Tank full vida, full critico, y tank ad.\n> y son campeones con el rol de soporte..\n> \n> Despues que la gente tenga maestría 6 no significa nada, Todos conseguimos una s en normales.\n> Simplemente te toca gente mala, a todos nos pasa\n\nel otro dia en una ranked un nasus de mi team perdió contra un Braum top, bien usados hacen harto ajajaj","replies":[{"poster":"Ism","date":"2016-06-19T21:52:36.705+0000","up_votes":1,"down_votes":0,"body":"Son personajes que cuyo rol secundario es para ir top, es como decir que Tahm no puede ir jungla, un personaje como Soraka, Talon, Morgana; como los harías rendir en la jungla ?","replies":[]}]}]},{"poster":"Wait IamStunned","date":"2016-06-10T18:25:59.320+0000","up_votes":1,"down_votes":0,"body":":v , te falto usar el :v hermano","replies":[]}]}