{"poster":"Snake150","date":"2015-07-12T02:01:01.068+0000","title":"Championvorschlag: Kanjo, der Hexendoktor","subforum":"Skin- & Champion-Konzepte","up_votes":3,"down_votes":2,"body":"Kanjo ist von der Gr&ouml;&szlig;e her ein kleines maskiertes humanes wesen mit einen Zauberstab. Er ist ein Meister der Voodoomagie und als supporter gedacht.\r\nEr lebt auf einen H&uuml;gel wo er gerne mit Zauberspr&uuml;chen Experimentiert. Er beherrscht die Menschliche Sprache nicht ganz er spricht in etwa so &quot;Du sein mir im Weg&quot;, er ist Menschen gegen&uuml;ber Sch&uuml;chtern deswegen tr&auml;gt er eine Maske.  \r\n\r\n**Passiv Auferstehung:** Alle 60 Sekunden falls Kanjo stirbt kehrt sein geist in seinem K&ouml;rper zur&uuml;ck und stirbt nicht. Er wird mir wenig Leben wiederbelebt. Der Vorgang dauert eine Sekunde.\r\n\r\n**Q Abschw&auml;chung:** feurt ein magischen Skillshot ab, wenn er ein gegnerischen Champion trifft verringert er 3 sekunden lang sein Angriffstempo und verlangsamt ihn.\r\n\r\n**W Zufalls Totem**: er kann einen von 4 totems platzieren (Ein zuf&auml;lliges Totem wird erscheinen). Sonlang ein Champion in der n&auml;he des Totems  steht bekommt er einen zus&auml;tlichen Effeckt.\r\n\r\nTotem des Feuer: Normaler Schaden und Magischer Schaden wird erh&ouml;ht.\r\n\r\nTotem des Windes: Bewegungstempo wird erh&ouml;ht.\r\n\r\nTotem des Wassers: Lebensregeneration wird erh&ouml;ht.\r\n\r\nTotem der Erde: R&uuml;stung und Magieresistenz wird erh&ouml;ht.\r\n\r\nDas Totem verschwindet nach Zwei Minuten. Zudem kann er nur ein Totem benutzen. Beschw&ouml;rt er ein anderes Totem verschwinet das erste sofort.\r\n\r\n**E Schmerz entziehen:** Kanjo w&auml;hlt ein Verb&uuml;ndeten Champion aus n&auml;herer Distanz aus. Jeder Schaden den der Ausgew&auml;hlte Champion erleidet wird stadessen auf Kanjo &uuml;bertragen, das gilt jedoch nich f&uuml;r Verlangsamung, stun silence usw. die dauer liegt bei 2 sekunden\r\n\r\n**R Seele Verbinden **Kanjo w&auml;hlt ein Gegnerischen Champion aus einen Mittleren Radius aus. Er verwandelt sich 6 Sekunden lang in eine Strohpuppe das die gestalt des Ausgew&auml;hlten gegnerischen Champions aninmmt. Jeder Schaden den Kanjo erh&auml;lt wird auch dem Ausgew&auml;hlten Champion zugef&uuml;gt.\r\n\r\n**Spielweise:** auf der botlane kann Kanjo sein Totem setzten um einen zus&auml;tzlichen effeckt f&uuml;r alle Verb&uuml;ndete in der n&auml;he und sich zu erhalten. mit seiner Q schw&auml;cht er den Gegnerischen Champion ab. Zudem kann man seine E und R kombinieren z.B. falls der Gegner einen Verb&uuml;ndeten Champion angreift kann er den schaden des Verb&uuml;ndeten auf sich lenken und gleichzeitig seine R auf den gegner setzen wodurch er seinen Verb&uuml;ndeten besch&uuml;tzt und sich selber schaden zuf&uuml;gt und dank seiner R bekommt der gegner und Kanjo den Schaden statt sein Verb&uuml;ndeter. \r\nFalls Kanjo dabei sterben sollte rettet ihn seine Passive F&auml;higkeit Auferstehung.","replies":[{"poster":"Zauselbart2","date":"2015-07-12T06:18:06.044+0000","up_votes":1,"down_votes":0,"body":"Hey,\nmeiner Meinung nach ist das gar keine so schlechte Idee.Jedoch könnte an den Fähigkeiten noch etwas experimentiert werden.Hätte mal eine Frage:Nimmt Rito auch Championvorschläge an ? Denn mir fließen lauter Ideen über den Kopf!","replies":[{"poster":"Stiv1234","date":"2015-07-12T08:15:19.283+0000","up_votes":2,"down_votes":0,"body":"Übernehmen tun sie meines Wissens keine, aber z. T. inspirieren sich Designer hier. Ich glaube mal gelesen zu haben, dass Brand aus nem Communityvorschlag hervorgegangen ist. Ich denke aber, dass das Unterforum hauptsächlich dem Austausch unter der Community dient.","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2015-07-12T08:21:43.959+0000","up_votes":1,"down_votes":0,"body":"alle 60 Sekunden die Passive von Aatrox? Bei dem hat sie einen Cooldown von 3 Minuten (so weit ich weiß).\n\nOh und \"Zufall\" ist immer ganz schlecht in einem gebalancten Team. Wenn das richtige Totem dir den Teamfight (gegen Fiddles Ulti) gewinnt, das falsche aber nicht und du keinerlei Einfluss darauf hast, welches gesetzt wird, ist das suboptimal.","replies":[]}]}