{"poster":"Keixt","date":"2017-09-27T04:56:10.506+0000","title":"Troll en High Elo LAS(Master-Challenger)","subforum":"Charlas Generales","up_votes":37,"down_votes":8,"body":"Apartir de Diamante 1 te empiezan a tocar los mismo jugadores de siempre, poco a poco los conoces, hay uno en particular que siempre trollea a mi parecer, ya que solo juega Annie y si lo banean saca un pick trolll para que alguien del equipo dodgee. Esto pasa durante mucho hasta que Annie quede open y pueda jugarlo.\r\n\r\nYa desde hace muchas semanas el tipo anda trolleando con su pick preferido, desde selecci&oacute;n de campe&oacute;n tiene mala actitud y creo que el 95% de jugadores saben de &eacute;l, cada vez que me lo encuentro me pongo a pensar, acaso en este servidor no dan permabann o un castigo? \r\nEste tipo de jugadores son pocos sinceramente, esta minor&iacute;a fomenta a ello, el mal juego y la actitud, es muy antideportivo.\r\n\r\nSoy nuevo en el servidor y me agrada la habilidad de muchos jugadores pero pocos como este jugador me causa algo de molestia, no pongo su IGN por reglas pero supongo que saben quien es. \r\nAnexo Screenshot sin su nombre, espero que alg&uacute;n Rioter vea este caso\r\nSs: https://imgur.com/a/kfoUJ","replies":[{"poster":"LastHope17","date":"2017-09-27T09:49:45.004+0000","up_votes":26,"down_votes":0,"body":"No necesito saber el nombre, con saber que solo juega annie y  trollea tiene que ser el magnifico Dasant KO","replies":[{"poster":"arielsebastian1","date":"2017-09-27T13:24:55.463+0000","up_votes":3,"down_votes":0,"body":"+10","replies":[]},{"poster":"kt Wingz","date":"2017-09-27T19:34:37.859+0000","up_votes":1,"down_votes":0,"body":"No lo habian baneado ? xD","replies":[]}]},{"poster":"Stay in Tower","date":"2017-09-27T05:16:53.113+0000","up_votes":10,"down_votes":1,"body":"tuve el honor de ver su fiddle top con ign, creo que murió como 13 veces en 25 min. No entiendo como es que el sistema aún no lo banea xd","replies":[{"poster":"FurchiDC","date":"2017-09-28T05:41:10.837+0000","up_votes":4,"down_votes":4,"body":"Si él murió 13 veces en 25 minutos intentando jugar para ganar, el sistema lo reconoce como una mala partida y el reporte no es válido. \nAdemás seguramente le banearon a Annie a propósito por lo que tuvo que recurrir a otro campeón. Que no sepa jugar fiddlesticks al mismo nivel que Annie no lo hace un troll, simplemente un OTP.\n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[{"poster":"Keixt","date":"2017-09-28T15:22:59.002+0000","up_votes":2,"down_votes":1,"body":"Morir 13 veces en 25 minutos es suicidio intencional, en NA el sistema de reportes lo considera como INTENTIONAL FEEDING y los bann son mas rápidos, ya que te salen los mensajes de tal jugador a sido sancionado a los minutos, no puedo creer que exista gente que defienda a tal sujeto, eso para mi es \"corrupción\". Así como en las leyes, en este juego esta persona tiene \"contactos\" que lo hacen invulnerable al bann, espero que algún Riot vea esto y mire el caso de sus reportes o sus replays, ya que cada juego que muere por primera vez se va AFK y no le da la gana de jugar.\nAhora pertenezco a este servidor y estoy aportando mi granito a arena para mejorar esta comunidad.","replies":[{"poster":"FurchiDC","date":"2017-09-29T02:02:27.642+0000","up_votes":2,"down_votes":1,"body":">_\"Morir 13 veces en 25 minutos es suicidio intencional, en NA el sistema de reportes lo considera como INTENTIONAL FEEDING y los bann son mas rápidos\"_\n\n¿De dónde sacan estas cosas? NA no tiene un sistema distinto al de LAS xD.\n\n>_\"esta persona tiene \"contactos\" que lo hacen invulnerable al bann\"_\n\nYa fue permabaneado, y hace poco tuvo un ban temporal de 14 días. No entiendo en qué basas tu argumento.\n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[]}]},{"poster":"Stay in Tower","date":"2017-09-29T13:40:07.220+0000","up_votes":1,"down_votes":0,"body":"a bueno, no hay peor ciego que el que no quiere ver","replies":[]}]}]},{"poster":"FedecarboneroUY","date":"2017-09-27T05:39:04.081+0000","up_votes":8,"down_votes":0,"body":"Tantas manos para jugar pero poca cabeza para pensar, porque mejor no lo reportan? si es quien creo que es, el problema es que cuando le bannean la cuenta al otro día aparece con una nueva, juega demasiado tiempo, pero ya ha sido baneado.","replies":[{"poster":"FurchiDC","date":"2017-09-28T05:35:52.723+0000","up_votes":2,"down_votes":3,"body":"Fede, no aparece siempre al otro día con otra cuenta nueva. Solo le banearon una cuenta, que fue la primera, después siempre jugó con una a la cual le cambia el nombre regularmente. La segunda cuenta en cuestión sufrió un ban de 14 días y a partir de ese momento no obtuvo reportes válidos suficientes como para gatillar el permaban. \n\nSí lo reportan pero la mayoría de las veces son reports vacíos que se pierden, pocos reportes son válidos y por eso no es sancionado. \n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[{"poster":"FedecarboneroUY","date":"2017-09-28T06:21:22.429+0000","up_votes":1,"down_votes":0,"body":"Mira, yo lo vi en menos de 2 meses, pasar a tener 350 K con Annie en 1 més y poco, y entonces eso significa que básicamente todos los pots que hubieron desde fines de s5 que empecé a entrar al foro hasta ahora diciendo que lo habían banneado son todos mentira?","replies":[{"poster":"FurchiDC","date":"2017-09-28T06:22:50.042+0000","up_votes":3,"down_votes":4,"body":"Permaban solo le dieron en la primer cuenta \"Dasant Ko\". En la segunda, que ya tuvo incontables nombres lo banearon por 14 días solamente por ahora, le doy seguimiento y puedo dar fe de eso.\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**\n\n","replies":[{"poster":"FedecarboneroUY","date":"2017-09-28T15:22:40.732+0000","up_votes":1,"down_votes":0,"body":"xD Te dieron negativo :v\n\nMira, no dudo de lo que digas, pero entonces todos los posts de gente festejando por los bans a dasant eran mentira :v","replies":[]}]}]}]},{"poster":"Love Scars 618","date":"2017-09-27T06:18:38.614+0000","up_votes":1,"down_votes":0,"body":"Si solo le banearon una cuenta, de que hablas?","replies":[{"poster":"FedecarboneroUY","date":"2017-09-27T22:46:47.286+0000","up_votes":1,"down_votes":0,"body":"wtf","replies":[]}]}]},{"poster":"Insane","date":"2017-09-27T05:04:29.160+0000","up_votes":8,"down_votes":0,"body":"Es cierto he jugado con el 5 veces y en todas me ha troleado y lo peor es que a veces hace stream y mucha gente lo apoya","replies":[]},{"poster":"Andrade","date":"2017-09-27T23:13:02.345+0000","up_votes":4,"down_votes":0,"body":"Hola Keixt, recuerdo haber jugado contigo hace unos días. Eras graves jg y teniamos un troll en la bot lane. Terminamos carreandola <3\nTe cuento, desde que subí a Diamond 1 y estuve un par de horas en Master, la cantidad de jugadores con esta actitud negativa ha aumentado a mi parecer, me he encontrado con High Elos muy flamers (Y eso que yo me puse a trabajar en ello luego de comerme una sanción) y también que se dedican a hacerte pasar malos ratos... Perdí 5 promos a Master en 2 días, me emparejaban con los mismos jugadores, unos que trolleaban a propósito para devolverle la mano a otro y nada, ahora estoy en Diamond 2 y un poco frustrado por lo mismo, se supone que la calidad de jugadores y personas debería mejorar pero me encuentro con una muralla enorme, saludos!","replies":[{"poster":"Keixt","date":"2017-09-28T15:26:08.326+0000","up_votes":1,"down_votes":0,"body":"Si! Recuerdo que la bot enemiga eran smurfs y nuestro ADC era transfered account, pero TOP y MID(tú) hicieron snowball, muy buen juego, suerte. Gana todas ;)","replies":[]}]},{"poster":"Teddi","date":"2017-09-27T05:02:54.988+0000","up_votes":5,"down_votes":1,"body":"Actualmente he sido testigo de esa situación, muchas veces me ha tocado y aún si no le toca el roll de mid/top (que sería lo que más busca para jugar annie) igual lo pickea, un día decidí no cederle la linea de mid y fue annie adc, ya se imaginarán el resultado y el score que quedó fue muy parecido al de la imagen debería ser baneado por ese nivel para trollear así las partidas, porque aparentemente se la está llevando fácil","replies":[]},{"poster":"Kesito09","date":"2017-09-27T05:06:37.781+0000","up_votes":3,"down_votes":0,"body":"Le encuentro toda la razon a Keixt, ya que me ha tocado varias veces jugar con el en el mismo equipo y es cierto, si le banean annie pickea algo troll para que dodgeen y cuando logra pickear annie juega a mi parecer \"trolleando\".\n\nEste hecho se torna algo estresante ya que si lo tienes en tu team tienes 2 opciones; Dodgear o jugar con el y perder.\n\nPD: BAN POR FAVOR y asi lograremos una comunidad mas agradable !{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"arielsebastian1","date":"2017-09-27T13:26:24.209+0000","up_votes":1,"down_votes":10,"body":"Lo he visto carrear muchisimas partidas, el problema es que a la gente le molesta que el juegue un solo champ, vi sus streams donde por solo jugar con el, le banean annie, si la gente ya esta mal predispuesta que se joda...\nLiteral, un mid amigo le cedio mid 2 veces y las 2 veces lo carreo...\nHay partidas y partidas, pero no podes culpar al perro por el error del dueño.","replies":[{"poster":"Tortuguita","date":"2017-09-27T13:29:53.346+0000","up_votes":3,"down_votes":1,"body":"Y ? Eso no te cubre de ser la persona que mas dodges causa en todo el juego , como si jugar bien te da inmunidad para ser facilmente el peor invocador de las xD","replies":[]}]}]},{"poster":"Excorpion","date":"2017-09-28T21:34:49.766+0000","up_votes":1,"down_votes":1,"body":"A Dasant ya lo han baneado, no me sorprendería que le baneen otra cuenta y termine siendo un caso más de permaban en multicuentas...\n\nLa cosa es que en esta cuenta es nueva, y se mantuvo bien para volver a subir, pero si trollea como antes, la gente solo debe reportarlo para que le baneen la cuenta, y siendo meramente conocido, los bans podrían caer con frecuencia hasta que sea baneado no ???\n\nSi me lo topara y me trolleara, lo reportaría, pero no puedo por ser manco :c","replies":[{"poster":"Tortuguita","date":"2017-09-29T01:21:14.773+0000","up_votes":1,"down_votes":0,"body":"El tema de los reports no es lo que se trata aquí , sino de la cantidad de personas que obliga a dodgear y perder lp cuando no se le da su linea preferida. Esta explotando el sistema para su beneficio y eso debería ser sancionable...\n\nHace dos días que no me lo encuentro y en ese mismo día hizo 5 dodges a 5 personas diferentes , un amor el dasant...","replies":[{"poster":"Excorpion","date":"2017-09-29T03:58:01.031+0000","up_votes":1,"down_votes":1,"body":"Es por que le dan la posibilidad de explotarlo. Prefieren perder un par de LP y no reportarlo a perder muchos y reportarlos. SI la ven de esa manera, nunca lograran hacer nada contra los trolls.","replies":[{"poster":"Tortuguita","date":"2017-09-29T11:31:14.724+0000","up_votes":2,"down_votes":0,"body":"¿ Debemos hacer ese tipo de \"táctica\" por que un invocador esta abusando del sistema , te parece correcto ? Se lo debe castigar , eso es lo que se tiene que hacer. No estamos en selección de campeones esperando a dasant ko comernos una partida horrible y al final decir \"El halcon negro ha caido\" y nos tomamos unas cervezas , no. Venimos a jugar lo mejor que podemos y divertirnos , no a hacer una \"contratactica\" al que le hace exploit al servidor...","replies":[{"poster":"Excorpion","date":"2017-09-29T16:34:57.861+0000","up_votes":1,"down_votes":0,"body":"Ese abuso de sistema solo existe por que riot lo permite. La unica forma de hacer algo es tener esa partida y reportarlo.\nLo mismo sucede cuando gano jg y mientras rolleo campeones otro lockea jg, pero no le dejo la linea, entramos a la partida la terminamos rapido y todos lo reportamos. \nLos unicos que pueden hacer algo somos nosotros, hay que sacrificar solo un poco para un bien comun. Si no, nunca creceran como comunidad y usuarios.\n\nObvio, si existiera algun modo de reportar durante seleccion, seria mas facil, pero no hay.","replies":[{"poster":"Tortuguita","date":"2017-09-29T23:41:19.772+0000","up_votes":1,"down_votes":0,"body":"\"Obvio, si existiera algún modo de reportar durante selección, seria mas facil, pero no hay.\"\nAmen , es exactamente eso lo que sucede. Por que haya un exploit no significa que debas abusar de el y hacerlo 5 veces seguidas en un mismo día , es algo inaceptable de cualquier manera. Es como tener una pistola y decir \"Nunca se lastimara nadie\" , deben hacer algo los de riot games y al igual que mejorar ese sistema de reportes deben hacer algo con este invocador . Esto va mas allá de \"hacer el bien común\" por que este sacrificio es algo que no es totalmente obligatorio en ranked , venimos a \"jugar\" no hacernos de héroes justicieros en un sistema que predica ser justos.\n\nEDIT: \"Ese abuso de sistema solo existe por que riot lo permite.\" Por que haya un exploit cito no debes por que abusar de el 5 VECES en un dia ...","replies":[{"poster":"Excorpion","date":"2017-09-29T23:42:41.567+0000","up_votes":1,"down_votes":0,"body":"Pero como te digo, el exploit solo es posible dado que la gente se lo permite, si jugaran y reportaran, ya tendría baneada esa cuenta, pero como no juegan, no reportan y por eso sigue vivo.","replies":[{"poster":"Tortuguita","date":"2017-09-30T00:09:12.509+0000","up_votes":1,"down_votes":0,"body":"¿Que parte no entendes que el \"Delito\" sucede durante la selección de campeones donde no se puede reportar ? ¿Realmente piensas que debemos darle toda la comodidad a alguien que hace todo lo contrario al código de invocador ? ¿Acolchonar su caída mientras nos comemos la perdida lp ? Este sujeto le han baneado 1 una cuenta permanentemente y luego otro ban de 14 dias , esto no es solo reportar es hacer algo con el terrible exploit que hace frente a nuestras narices.","replies":[]}]}]}]}]}]}]}]},{"poster":"CayoElFurro","date":"2017-09-28T18:16:11.506+0000","up_votes":2,"down_votes":0,"body":"No se si mi opinion contara por estar en la peor liga pero... Ese es puro annie nomas y nunca se le paso por la cabeza que, jamas es tarde para probar otra champ?\n\nPD: No es necesario tachar su nombre, ya con decir \"High Elo\"+\"Annie baneada\"+\"Troll\"=DasantKo xD","replies":[]},{"poster":"Tortuguita","date":"2017-09-28T11:09:43.775+0000","up_votes":2,"down_votes":0,"body":"Tristisimo , medio servidor te dice que hace dodgear en plena selección de campeones y se basan en los reports. Esto es el pan de cada día y hay varias personas que sufrieron lo mismo.\n\nLo mas lamentable es que hay personas que llegan a defenderlo como si estaría en lo correcto y solo es la ira del populacho sin sentido , jaja.","replies":[]},{"poster":"Tortuguita","date":"2017-09-28T01:33:57.703+0000","up_votes":2,"down_votes":0,"body":"Rioters ? Alguien ? o se borran completamente ? jaja","replies":[]},{"poster":"Jettatore","date":"2017-09-27T23:40:18.736+0000","up_votes":2,"down_votes":0,"body":"La gente que lo defiende se nota que no lo conoce o que nunca han jugado con el sin lugar a dudas jajaja, a nadie le importa que juegue solo annie, el tema es que trollea en las selects si no le dejas ir annie mid por ejemplo a mi me saco un teemo jg con curacion y purificacion por que no le quise ceder la linea central y nos obliga dodgear tantas selecciones porque le banean annie o no le toca la linea que desea jugar, aun así cuando logra ir annie si le ganan la linea muere un par de ves y se va afk o se buildea cosas como filo de infinito con annie muriendo a propósito como podrán apreciar en alguna partida que otra de su historial, el tipo es de los trolls mas conocidos en el sv pero como no flamea seguido no lo banean nunca, se les pasa por alto a riot esta clase de jugadores.","replies":[]},{"poster":"IJN Akagi","date":"2017-09-27T08:45:04.310+0000","up_votes":2,"down_votes":6,"body":"por que el sistema lo conoce como una \"Mala partida\" y no como alguien que trolea,si vos vas 0-50 pero estas jugando para ganar y no para perder,como por ejemplo,ayudas a tu team en las tfs por mas de que mueras primero,no estas troleando xD y si no se como ese pibe llego tan alto,luego me acuerdo que con annie pegas un cabezazo al teclado y ganas una tf entera pero asi es este juego xd siendo OTP y teniendo 200000000000 partidas con la misma cosa terminas subiendo,aunque la verdad no le veo la gracia usar el mismo champ para subir,pero hay gente que le gusta jugar para ganar y no para aprender :P","replies":[{"poster":"Tortuguita","date":"2017-09-27T10:54:56.752+0000","up_votes":3,"down_votes":0,"body":"?? El men esta haciendo una actitud totalmente contraria al codigo de invocador , le han baneado una cuenta y sigue en esta. Da igual como suba lo que sucede es eso me importa una mier.da que tire R mate al team , asi jugamos como se nos de la gana pero no nos comportamos asi...","replies":[{"poster":"arielsebastian1","date":"2017-09-27T13:24:33.140+0000","up_votes":1,"down_votes":0,"body":"Segun vos annie esta broken, nada mas para acotar.","replies":[{"poster":"Tortuguita","date":"2017-09-27T13:28:31.874+0000","up_votes":2,"down_votes":0,"body":"En que momento dije eso ? Estas seguro que estas usando todas tus neuronas para escribir? Me importa nada que juegue el champ mas simple del juego , lo que me importa es la cantidad de dodgeos que te comes por estar a su lado. Acaso eso te parece justo ? Otro fansito mas ?","replies":[{"poster":"arielsebastian1","date":"2017-09-30T18:22:22.084+0000","up_votes":1,"down_votes":0,"body":"No soy fan de el, es mas si lo vi 2 o 3 veces es mucho, te invito a releer tu comentario... responder de manera agresiva para ocultar tu ignorancia no te va a llevar a nada en la vida, sobre todo si crees que tu funcionamiento neuronal es mayor al de otros...\nSobre todo si crees que al escribir se usan todas las neuronas, nada mas para acotar.","replies":[{"poster":"Tortuguita","date":"2017-09-30T21:06:32.148+0000","up_votes":1,"down_votes":0,"body":"? Responde a la respuesta \"agresiva\" indicando tu capacidad neuronal con otra del mismo tipo , eres un visionario amigo mio.","replies":[]}]}]}]}]}]},{"poster":"Hnk Kenshiro","date":"2017-09-27T12:54:12.744+0000","up_votes":2,"down_votes":0,"body":"Apenas vi tanta annie se supo quien era xD\n\nLo importante es, un troll en challenger o uno en plata da lo mismo, se reporta y se olvida.","replies":[]},{"poster":"Tortuguita","date":"2017-09-27T10:56:40.178+0000","up_votes":2,"down_votes":0,"body":"Date cuenta que nadie de los de riot va venir a decir algo al respecto. Es que esto es como el timo del siglo , la típica persona favorita del servidor que puede hacer lo que quiere y nadie le dice nada xD","replies":[]},{"poster":"Handymann","date":"2017-09-27T09:52:54.701+0000","up_votes":2,"down_votes":0,"body":"El permaban si lo dan, yo tengo una cuenta permaban por flamear a los flammers... por suerte me acostumbre a mutear. supongo que a los casos como este que merecen un permaban les llegara en su momento, suerte con eso bro.","replies":[]},{"poster":"KzG Arconte","date":"2017-09-28T11:12:15.005+0000","up_votes":1,"down_votes":1,"body":"YA, ¿y el fin de este post cual es? ... Si lo han baneado varias veces ya. No se por que no te borran el post aun, estas \"reportando\" a alguien en el foro, y dando su nombre. La verdad no entiendo a los adm ._.","replies":[{"poster":"Tortuguita","date":"2017-09-28T13:25:21.648+0000","up_votes":3,"down_votes":1,"body":"? No esta reportando a nadie , que sea una figura publica y se pueda saber quien es tan solo al mirarle el op.gg es totalmente irrelevante. Y ademas solo lo han baneado una vez a esta persona y ahora muestra otro (tal vez antes lo tenia) comportamiento aun mas desagradable que antes , por lo cual lo único que expresa es su opinión sobre este tema que nos afecta a todos. Este invocador no puede ser sancionado por que abusa del sistema en si y eso queremos exponer y tener una pronta respuesta por Riot. Nadie se paso por aqui xD","replies":[]}]},{"poster":"Kłaytøn","date":"2017-09-27T05:24:00.607+0000","up_votes":3,"down_votes":3,"body":"No le van a hacer nada tranqui, parece haber cierto tipo de favoritismo y no es el unico que esta en elo alto que merece estar baneado la verdad, despues las cosas que hace hasta en su stream se suele ver, pero al parecer no son pruebas suficientes y ultimamente empieza a stremear al iniciar la partida y no desde seleccion de campeon justamente para ocultar esto que se menciona que hace pero en fin...","replies":[{"poster":"arielsebastian1","date":"2017-09-27T13:26:58.126+0000","up_votes":1,"down_votes":4,"body":"Ya le banearon una cuenta (creo que dos) no digan boludeces, ademas no es todo su culpa.","replies":[{"poster":"Tortuguita","date":"2017-09-27T13:29:07.390+0000","up_votes":3,"down_votes":0,"body":"Todo su culpa ? Viejo le banean dos cuentas y aun sigue comportandose como siempre. Como no es su culpa ? Es un incomprendido ? xD","replies":[]}]}]},{"poster":"Bienzahar","date":"2017-09-28T17:45:57.111+0000","up_votes":2,"down_votes":1,"body":"Lastimosamente es amigo de los rioters, así que nada que hacer, queda aguantar no más.\n\nEdit 1: https://media.lolusercontent.com/api/embedly/1/image/resize?url=https%3A%2F%2Fi.gyazo.com%2Faed8e74b1b3ceb56c2228a7ef18aee32.jpg&key=f0abbd34f14549f3a15cd94dd9970851&width=425\nDasant ko con su amigo Escalibeer xD","replies":[]}]}