{"poster":"ragaMüffin","date":"2016-02-01T21:30:56.054+0000","title":"Cambio de server gratuito (GG LAS)","subforum":"Problemas Técnicos","up_votes":55,"down_votes":14,"body":"Bueno en vista que Riot LAS no hace las cosas bien y que el server est&aacute; injugable durante la mayor parte del tiempo (sin contar las fallas de las &uacute;ltimas actualizaciones) podr&iacute;an ponerse serios y como empresa ofrecer un cambio de server gratuito, yo prefiero irme a BR, funciona mucho mejor. No s&eacute;, qu&eacute; opinan.","replies":[{"poster":"ForeverNub","date":"2016-02-01T22:34:52.978+0000","up_votes":5,"down_votes":2,"body":"Yo vivo en Quilmes, Buenos Aires, en LAS tengo 60ms (aproximadamente) me cree una cuenta en BR para ver ya que todos decian que le iba mejor que en LAS y tengo 350ms, hay que aclarar que solo te va a andar mejor en BR que en LAS si vivis en las provincias del norte...","replies":[{"poster":"Ex Fire Dragon","date":"2016-02-01T22:37:30.874+0000","up_votes":6,"down_votes":1,"body":"No, es depende el ISP amiguín, algunas ISP tienen mal ruteado el tunel de datos y entonces van desde tu casa a america del norte y ahí al BR, y viceversa.","replies":[]},{"poster":"EDDDDDDDDDDDDDD","date":"2016-02-02T00:16:30.871+0000","up_votes":3,"down_votes":1,"body":"si tenes speedy tenes que usar el wtfast... yo tambien me estaba por mudar pero menos mal hice una cuenta para probar que onda y me tira 330 constantes, en NA me tira 220 (es jugable igual) pero bueno, estamos condenados a jugar en esta pija de server","replies":[]},{"poster":"Other Lee Sin","date":"2016-02-03T02:18:45.062+0000","up_votes":1,"down_votes":0,"body":"Yo soy de vicente lópez y me tiraba entre 60 a 80 de ping en BR, uso fiber, ni idea. A veces incluso 40.\n\nIgual he escuchado de gente que le tira 30 ping en BR, la smurf que tengo ahí es lvl 10, no tengo ni ganas de subirla de nivel para jugar solo, pero si con mis amigos nos podemos pasar sabes lo bien que jugamos ahí, si total este servidor es una basofia, nos vienen boludeando desde que salió a los Argentinos y a algunos Uruguayos...\n\nSi tenemos 140 de ping no nos tenemos que quedar jodiendonos, deberíamos de quejarnos todos, si no le van a sacar el gratis hagan una oferta, porque esto es una estafa, nos hacen jugar a todos en su servidor decadente que solo a \"Cierta gente le anda porque todas las ISP nuestras son horribles y deberíamos de echarle la culpa a las ISP si bien cuando entras a cualquier otro juego te anda 10 puntos\" mientras que ves en NA y EU cada tanto noticias de que hicieron banda de arreglos ruteos etc para que ande bien.\nAcá? Nada, jodete.\nEn EU tienen fácil 10 países para conectar y no tienen problema, por que para conectar 3 en LAS les va a costar tanto, no te parece que nos estan mintiendo y es la manera más indirecta de decir \"No nos preocupamos por ustedes\"?\nPara mí sí, y la verdad me cansé...","replies":[{"poster":"Sonycko","date":"2016-02-03T02:33:34.639+0000","up_votes":1,"down_votes":0,"body":"ESTOY TOTALMENTE DE ACUERDO CON VOS, RECIEN TERMINE UNA RANKED Y ERA IMPOSIBLE JUGARLA, TIRABAS UN PODER Y A LA HORA TE LO TIRABA, ASQUEROSO EL SERVIDOR... PASENOS A TODOS LOS ARGENTINOS Y URUGUAYOS A BR... AHI ANDA MEJOR","replies":[]}]},{"poster":"Febiven Fanb0y","date":"2016-02-02T12:37:42.570+0000","up_votes":1,"down_votes":0,"body":"Yo soy de bera y me va a 42 con Fibertel y a 340 con Speedy","replies":[]},{"poster":"Nahko","date":"2016-02-02T10:17:24.016+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ForeverNub,realm=LAS,application-id=X54mVVp0,discussion-id=snm1UVaW,comment-id=0001,timestamp=2016-02-01T22:34:52.978+0000)\n>\n> Yo vivo en Quilmes, Buenos Aires, en LAS tengo 60ms (aproximadamente) me cree una cuenta en BR para ver ya que todos decian que le iba mejor que en LAS y tengo 350ms, hay que aclarar que solo te va a andar mejor en BR que en LAS si vivis en las provincias del norte...\n\nque raro vivo en Buenos Aires y me va a 50ms en BR y en las a 70,80 ms en sus dias de gloria (cuando no hay lag)","replies":[]},{"poster":"LUCH0","date":"2016-02-01T23:35:40.401+0000","up_votes":1,"down_votes":0,"body":"yo vivo en Buenos Aires un poco mas al sur que vos y me anda con exactamente el mismo ping BR que LAS (50~ en ambos)","replies":[]},{"poster":"Priseida","date":"2016-02-01T23:11:03.347+0000","up_votes":1,"down_votes":0,"body":"No es asi, solo es un problema de rooteo, te bajas el WTFast que es todo automatico y listo. 30 ms en br, menos q en las, sin problemas de cortes ni nada por el estilo.","replies":[]},{"poster":"D4rk1igh7","date":"2016-02-02T14:11:38.100+0000","up_votes":1,"down_votes":1,"body":"Yo estoy en Bahía Blanca, un toque más al sur que vos y en el sv de BR tengo 60ms. No tiene nada que ver la ubicación","replies":[]},{"poster":"elflaco12","date":"2016-02-02T00:30:46.355+0000","up_votes":1,"down_votes":1,"body":"no en realidad yo vivo en la prov de bs as y en las me tira 79 ms y en br 50 60 puede ser que tus megas de internet sean 1 o 2 pero mas arriba en br te anda mejor","replies":[]}]},{"poster":"Maxi Mérida","date":"2016-02-02T01:04:55.334+0000","up_votes":6,"down_votes":2,"body":"si abren el traspaso gratis, se qdan sin dinero los rioters de Las, asi q es imposible q lo hagan, vamos a tener q soportar los gg izi de los chilenos","replies":[{"poster":"JulianELR","date":"2016-02-02T01:25:38.500+0000","up_votes":3,"down_votes":6,"body":"Lo dices como si todos los argentinos fueran perfectos Y NO LO SON >:)","replies":[{"poster":"Maxi Mérida","date":"2016-02-02T13:54:13.048+0000","up_votes":1,"down_votes":2,"body":"la otra vez jugamos con 3 amigos y nos tocaron dos chilenos, que trollearon con una janna y soraka, y nos vivian diciendo che boludo y un monton de cosas, aveces son los chilenos los q empiezan, pasa q se hacen las victimas.","replies":[{"poster":"Joey Tribbianî","date":"2016-02-02T18:31:13.138+0000","up_votes":2,"down_votes":0,"body":"Existe el mute, ¿Sabes?.\nTermina la partida y el report se lo llevá :)\nAdemás, no generalices ^^","replies":[]},{"poster":"JulianELR","date":"2016-02-02T17:41:11.470+0000","up_votes":2,"down_votes":1,"body":"Ahora dices que nos hacemos las victimas TODOS los chilenos, cuando mas de una ves me a tocado vivir eso mismo pero con argentinos que estaban haciendo pre-made y que solo por hacer un miss-play flamean entre todos y los mas gracioso piden report por el /all, eso si es hacerse la victima ;)","replies":[]}]}]}]},{"poster":"EzrealSupportOP","date":"2016-02-01T22:08:15.451+0000","up_votes":8,"down_votes":17,"body":"Pues pagalo.\n\nO create una cuenta nueva, y fin.","replies":[{"poster":"noob321","date":"2016-02-02T00:18:52.842+0000","up_votes":1,"down_votes":2,"body":"en todo los foros estas defendiendo a Riot... no jodas mas diciendo que te anda perfectamente que si todos están diciendo que anda para el ort.. es por algo digo","replies":[{"poster":"EzrealSupportOP","date":"2016-02-02T00:22:43.108+0000","up_votes":1,"down_votes":17,"body":"Bienvenido a la libertad de expresion, la verdad no ofende a nadie.\n\nTengo tanto derecho a exponer mi opinion sobre que me funciona bien el juego, como ustedes a quejarse del supuesto mal estado de sus conexiones.","replies":[{"poster":"noob321","date":"2016-02-02T01:07:49.341+0000","up_votes":4,"down_votes":0,"body":"no lo digo por mi, lo digo para que no digas nada innecesario la gente que viene de perder pl. por que se le cae no quiere escuchar a un chavon diciendo que a el le anda perfecto y que es mentira que anda mal fíjate...","replies":[{"poster":"gmolinamarquez","date":"2016-02-02T01:19:18.905+0000","up_votes":3,"down_votes":0,"body":"vengo de perder una ranked por que el server anda para el orto no esta demas decir que la partida estaba totalmente ganada cuando empezo a andar para el culo :)","replies":[]}]},{"poster":"Priseida","date":"2016-02-02T22:50:37.643+0000","up_votes":2,"down_votes":0,"body":"No se si te diste cuenta que este post esta echo para q  la gente a la  que le anda mal el servidor como a mi se descargue. Ya sabemos que hay gente a la que le anda bien el server, solo esperamos solucion para a los que no. Tu comentario es absolutamente absurdo y no hace mas que probocar a los que tienen problemas. Tenes libertad de exprecion absoluta, es un foro publico y nadie te va a censurar, pero tu comentario no suma para nada, resta.\nEspero que siempre te funcione bien el server, no sea cosa que algun dia te pase lo mismo que a los demas.\nEl server anda mal, le anda  mal a muchos usuarios. Y ademas de tener este problema ahora con el ping, tiene muchisimos mas que no vale la pena nombrar, ya que este ( el ping ) afecta directamente ala jugabilidad.\nLa critica es buena, sin critica no hay mejora y si uno quiere que Las mejore tiene que marcar lo q le parece esta mal para colaborar.","replies":[]}]},{"poster":"Ahristócrata","date":"2016-02-02T00:31:56.616+0000","up_votes":1,"down_votes":12,"body":"Tiene razón Ezreal.","replies":[]}]},{"poster":"LUCH0","date":"2016-02-01T23:21:25.064+0000","up_votes":3,"down_votes":3,"body":"Si me creo una cuenta nueva pierdo todo el tiempo y rp que invertí en esta, lo cual es injusto para cualquiera, por lo tanto esa solución es imposible y estoy seguro de que si vos lo tuvieras que hacer tambien te quejarías. Con respecto a pagar un cambio de server, el juego deja de ser free to play si hay que pagar para cambiar de server y que nos funcione correctamente. De cualquiera de las dos maneras es injusto para nosotros.","replies":[{"poster":"EzrealSupportOP","date":"2016-02-02T00:20:33.859+0000","up_votes":2,"down_votes":8,"body":"Sera injusto, pero asi es la vida, el unico traspaso gratis, ha sido cuando se creo el servidor de LAS, nunca mas.\n\nLa idea es que no se hagan falsas ilusiones, Riot no va asumir culpas por hechos ajenos (problema de los proveedores de internet), pero si va a intentar negociar con esas empresas para evitar que vuelva a ocurrir.","replies":[]}]},{"poster":"Maurofl48","date":"2016-02-03T01:52:08.575+0000","up_votes":1,"down_votes":0,"body":"¿Porque el usuario tiene que pagar un traspaso a un servidor si es algo que debería de andar bien?","replies":[]}]},{"poster":"Cobe","date":"2016-02-01T23:25:04.832+0000","up_votes":3,"down_votes":0,"body":"Desde Riot dijeron que no van a dar cambio de región gratis, y el problema con la fibra que se había roto ya se soluciono. Para saber mas les recomiendo que lean los comentarios y respuestas de este post de riot http://las.leagueoflegends.com/es/news/riot-games/announcements/infraestructura-de-red-ayer-hoy-y-manana","replies":[]},{"poster":"CJ Entus Sighma","date":"2016-02-02T02:48:43.433+0000","up_votes":3,"down_votes":1,"body":"Y si te anda mejor en BR, hacete una cuenta nueva y listo, no queres hacerte una cuenta nueva? compra rp y pasate, el juego es f2p tiene sus altas y bajas como todo juego","replies":[{"poster":"Sergius","date":"2016-02-02T20:09:36.956+0000","up_votes":2,"down_votes":1,"body":"Tal vez F2P para vos. Yo tengo invertido un monton de dinero en este juego. Y con ese dinero se paga el servidor. Un servidor al que vos y muchos otros juegan gratis y esmurfean para conseguir una skin gratuita. Si la gente de RIOT chile no puede dar un buen servicio que nos den la posibilidad de mudar nuestras cuentas.\nEl mal servicio no es únicamente provocado por lag. Tambien hay que depurar el server de gente toxica y mejorar el tema de las rankeds. Es inaudito que un tipo que no sabe jugar esté en silver 1 porque fue carreado 4 o 5 veces.","replies":[{"poster":"Nottïngham","date":"2016-02-02T21:05:33.349+0000","up_votes":1,"down_votes":0,"body":"\"y con ese dinero se paga el servidor\" JAJAJAJAJAJAJJAJAJAJAJAJAJAJAJA claro que si campeon, claro que si. Tenes menos negocio papa","replies":[{"poster":"SinisterDemon","date":"2016-02-03T05:12:56.671+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=I Nottingham I,realm=LAS,application-id=X54mVVp0,discussion-id=snm1UVaW,comment-id=000800000000,timestamp=2016-02-02T21:05:33.349+0000)\n>\n> \"y con ese dinero se paga el servidor\" JAJAJAJAJAJAJJAJAJAJAJAJAJAJAJA claro que si campeon, claro que si. Tenes menos negocio papa\n\ny vos tenes menos estudios hermano... segui estudiando y dps comenta jajaja","replies":[]}]}]}]},{"poster":"SinisterDemon","date":"2016-02-03T05:11:27.024+0000","up_votes":1,"down_votes":0,"body":"yo me cree una cuenta en BR y tengo con toda la furia 45 de ms.... osea que el problema no es de nuestros distribuidores de internet de argentina sino de ellos nose ustedes pero yo ya ando jugando en BR me canse de estos de riot chile si no hacen nada nunca","replies":[]},{"poster":"Dryaad","date":"2016-02-03T03:34:18.074+0000","up_votes":1,"down_votes":0,"body":"Seria genial que nos pasen a un server que ande! y si no hay chilenos mejor xD","replies":[]},{"poster":"FilipJotaFrai","date":"2016-02-02T06:20:14.808+0000","up_votes":1,"down_votes":1,"body":"Apoyo la moción","replies":[{"poster":"Hiding Tonight","date":"2016-02-03T02:13:49.899+0000","up_votes":1,"down_votes":0,"body":"CON \nTODA\nVIOLENCIAAAAAAA","replies":[]}]},{"poster":"Fabrio","date":"2016-02-02T00:01:45.109+0000","up_votes":1,"down_votes":0,"body":"vos crees que riot te va a dar algo gratis?","replies":[]},{"poster":"ZetaaOP","date":"2016-02-02T17:01:56.605+0000","up_votes":1,"down_votes":0,"body":"Mi solucion fue irme a EU WEST ya que en mi opinion es el mejor server sin trolls ni afks ni lag por un mes{{summoner:13}}","replies":[]},{"poster":"NeLord","date":"2016-02-02T15:31:55.068+0000","up_votes":1,"down_votes":0,"body":"Esto puede terminar como con otros juegos online en un server pirata, la molestia de todos los jugadores no chilenos es obia ! Que el juego te ande en diferido y todavia tener que bancar a los chilenos flameandote por el mal funcionamiento del juego es sumamente molesto. Rito anuncio la creacion de un cable propio ahora yo pregunto no es mas barato migrar el server a otro lugar?","replies":[]},{"poster":"WolfTeemo","date":"2016-02-02T13:57:41.761+0000","up_votes":1,"down_votes":0,"body":"no se man rito lo único que se preocupa es por cosas de los campeones sobre skins y eventos y bla bla o fallas de algunas cosas responde pero con el tema del server ni un carajo responde sin mas que decir rito no hace mucho que digamos","replies":[]},{"poster":"Tristana Ronaldo","date":"2016-02-02T03:29:58.177+0000","up_votes":1,"down_votes":0,"body":"Con todo el respeto, creo que es bastante tonto, sabiendo que hay problemas con red, es un posibilidad también hacer otra cosa mientras los arreglan. las cosas no pueden arreglarse de un día para otro, siendo que es una parte del servidor que tiene errores y algunas personas de X país no demuestran latencia alta ni nada. Lo que a mi concierne ando re bien de latencia, a veces me salta un mini delay de 1seg pero nada más. Tratar de ''aprovecharse'' de la situación para que de un tipo de compensación, por un problema que no es culpa de la empresa ya es mucho .-. El Juego es Free to play, la elección de comprar Riot Points es de uno, no es obligacion, se puede jugar bien sin ninguna Skin ni nada.","replies":[]},{"poster":"RRHEAD","date":"2016-02-02T03:15:45.021+0000","up_votes":1,"down_votes":0,"body":"no nos daran transferencia gratuita jajaj, les impurta un carajo nuestra situacion. Y si tenes speedy amenos q uses wtfast te tira 200ms. Condenados a fumarnos CL y su comunidad tan agradable.\nPD: sarcasmo","replies":[]},{"poster":"OG The Iron Crow","date":"2016-02-02T03:15:20.598+0000","up_votes":1,"down_votes":0,"body":"Hola, yo vivo en Cba, tengo Arnet 10 megas. Cuando el serve anda genial juego con 70-80 de ms, un amor. \n\nLa cosa es que estos últimos días estoy teniendo  350-490 hasta 550, es imposible jugar una partida como la gente. \n\nAh, otra cosa, cuando jugué 3 rank y las perdi por el terrible lag, me puso derrota evitada, pero en el total de 10 partidas para promoción ya tenia 3 derrotas. No es justo.","replies":[]},{"poster":"El Pritteao","date":"2016-02-01T23:13:05.196+0000","up_votes":1,"down_votes":0,"body":"No te arreglan el server que es lo que corresponde, te van a migrar la cuenta gratis.\nNada pedís amigo. Saludos","replies":[]}]}