{"poster":"179cm 76kg 18cm","date":"2017-10-07T15:52:42.492+0000","title":"Bannt doch mal die verdammten Trolls!","subforum":"Hilfe & Support","embed":{"description":"The easy way to save screenshots, GIFs, and websites. Make everyone happy by sharing smarter, faster, and with your point crystal clear.","url":"https://gyazo.com/92a70283ba60d331500d01f47d5e2277","image":"https://thumb.gyazo.com/thumb/1200/_cc55a29c17d39332dee93864e053c65f-jpg.jpg"},"up_votes":1,"down_votes":0,"body":"Grad in der Champselect wurde von unserem Midlaner der Champ vom Enemy-Team gebannt darauf hin musste ich lesen. \ni troll :) - its not my account. Daraufhin loggte er auch schon den Nunu Midlane mit Ghost, Cleanse ein und meinte noch er h&auml;tte den Account gehackt.\nIch find das es nen ziemliches Armutszeugnis ist Riot. Macht doch mal lieber umfragen warum ich ne Gamelobby leave. Mir gehen die Trolls mitlerweile echt auf die nerven, da in jedem 10ten game einer ist.\nUnd ich hab dadurch schon soviele LP verloren, dass es mittlerweile echt frustrierend ist.\nAber was soll man machen egal wie oft man nach so einem Game jemand Reported es passiert ja eh nie etwas.\n\nhttps://gyazo.com/92a70283ba60d331500d01f47d5e2277\nhttps://gyazo.com/166969009bea83786af04e1cc9a2fd79","replies":[{"poster":"silibum","date":"2017-10-07T16:05:48.839+0000","up_votes":1,"down_votes":0,"body":"Reporten, gerne zur Not auch per Support: https://support.riotgames.com/hc/de/requests/new -> Ich möchte ein Fehlverhalten, einen Betrug oder schädlichen Link berichten \n\nIm Forum kann Dir dabei niemand helfen. Reports funktionieren und führen auch zu etwas, Du erhälst aber nicht für jeden Report eine Rückmeldung.","replies":[]},{"poster":"Alustus","date":"2017-10-07T16:02:33.007+0000","up_votes":1,"down_votes":0,"body":"Und du hast genau das getan was der \"idiot\" wollte.\nSpiel solche spiele und Reporte die Person  dann wird diese auch gebannt, wenn du leavst passiert ihm weniger und er bekommt das was er will.","replies":[{"poster":"179cm 76kg 18cm","date":"2017-10-07T16:04:11.802+0000","up_votes":1,"down_votes":0,"body":"naja ich hab es mir schon paar mal angetan mit solchen trolls und sie reported. nie ein feedback bekommen, ergo denke ich mal das nichts passiert ist. da nehm ich lieber die -3lp in kauf und hab nen ticket aufgemacht","replies":[]}]}]}