{"poster":"LZ Flame","date":"2015-10-12T14:42:27.677+0000","title":"Einstufungspiele","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Wo w&uuml;rde ich landen wenn ich mit einem account mit dem ich noch nie ranked gespielt habe alle 10 Einstufung spiele dodgen w&uuml;rde(also champselect verlassen).\r\n\r\nDanke f&uuml;r eure Antworten im Voraus","replies":[{"poster":"HyperionCH","date":"2015-10-12T14:44:33.761+0000","up_votes":1,"down_votes":0,"body":"Ich vermute, die werden alles als Niederlagen gewertet.\nBei Niederlagen von 0:10 landet man sicherlich in Bronze.","replies":[{"poster":"Lord Vilich","date":"2015-10-12T15:18:21.933+0000","up_votes":1,"down_votes":0,"body":"Champ select kann man in den placements ohne folgen verlassen. Jedenfalls ist das in Teamranked so.","replies":[{"poster":"HyperionCH","date":"2015-10-12T15:21:55.967+0000","up_votes":1,"down_votes":0,"body":"Hmm... ich hatte gedacht, dies wäre ähnlich wie bei Promos (Niederlage wird gezählt).\n\nWobei beim Dodgen der Promo die MMR unverändert bleibt; dies wäre recht sinnfrei bei der Einstufung.\n\nIch hoffe, die Emissaries streamen morgen wieder. Dann frage ich einmal sie, ob sie dies wissen (bzw. ob sie nachfragen können). :D","replies":[{"poster":"Avorox","date":"2015-10-12T15:23:28.138+0000","up_votes":2,"down_votes":0,"body":"Habe es bereits auf meinem Smurf ausprobiert. Dodgen wird nicht als Niederlage gewertet und hat somit keinen Einfluss aufs Placement.","replies":[{"poster":"HyperionCH","date":"2015-10-12T15:27:32.629+0000","up_votes":1,"down_votes":0,"body":"Besten Dank.\n\nJa, mit der Überlegung, dass die MMR sich gar nicht ändern kann, würde es auch keinen Sinn machen, dass die Niederlagen zählen (die MMR würde dann immer noch auf Silber bleiben).\n\nWäre auch sonst missbräuchlich.\nWer z.B. 0:5 steht (und Gefahr läuft, in Bronze zu landen) könnte ja sonst 5x dodgen; MMR bleibt unverändert und man landet wohl noch in tieferen Silber.","replies":[]}]}]},{"poster":"Avorox","date":"2015-10-12T15:22:09.819+0000","up_votes":1,"down_votes":0,"body":"Tatsächlich ist das im SoloQ genauso. (Zumindest was das Ranking angeht. Die Zeitstrafe erhält man trotzdem)","replies":[]}]}]},{"poster":"Gâlahad","date":"2015-10-13T09:20:52.015+0000","up_votes":1,"down_votes":1,"body":"Ist vollkommen egal wie du spielst. Habe noch nie von jemandem gehört der ordentlich eingeordnet wurde nach den Einstufungsspiele. 2 Freunde von mir haben letzte Season in der selben Division beendet - der erste hat 3/10 gewonnen der zweite 7/10 - der erste ist in S1 gelandet der zweite in S5...","replies":[{"poster":"HyperionCH","date":"2015-10-13T09:28:18.523+0000","up_votes":1,"down_votes":0,"body":"Deine beiden Freunde haben vielleicht die Season damals in der selben Division beendet, aber nicht mit der selben Elo (aka MMR).\n\nDer eine hatte Wohl eine Elo im tieferen Silber (kam dann auf S1), der andere bereits in Bronze (kam dann auf S5).","replies":[{"poster":"Gâlahad","date":"2015-10-13T10:13:35.022+0000","up_votes":1,"down_votes":0,"body":"Wie die Elo der beiden aussah weiß ich nicht mehr genau, aber so enorm kann sie nicht außeinander gewesen sein... zumindest nicht so das es eine solche Differenz bei der Einstufung geben sollte. Man hat einfach zu oft den Eindruck da wird mehr gewürfelt als berechnet, obwohl da ja eigentlich ein System dahinter stecken muss.","replies":[]}]}]},{"poster":"expl0itdb","date":"2015-10-12T15:24:46.942+0000","up_votes":1,"down_votes":0,"body":"Ich glaube das zählt als kein Spiel !","replies":[]},{"poster":"RM Heartmeander","date":"2015-10-12T15:18:44.582+0000","up_votes":1,"down_votes":0,"body":"Wird nicht gewertet.","replies":[]},{"poster":"Alustus","date":"2015-10-12T14:47:31.203+0000","up_votes":1,"down_votes":0,"body":"Unrank ;D\nWenn ich mich nicht irre werden playcements nicht als niederlagen gewertet wenn man in der Champselection leavt.\nIngame kann man leaven davon würde ich dir aber dringest abraten, da du leuten das Spiel kaputt machst und wahrscheinlich auch eine Strafe bekommst.\nIm gegensatz zu Promotions wo man automatisch verliert. (bin mir aber nur zu 70% sicher, kann mich also auch irren)\n\nAnsonsten irgendwo in Bronze  wo genau kann man nicht sagen.","replies":[]}]}