{"poster":"Lucio07","date":"2017-04-10T13:43:58.197+0000","title":"Ya entendi lo que me dijieron, pero solo querria que me la saquen solo por esta vez...","subforum":"Comportamiento del jugador","embed":{"description":"Estaba a si normal jugando con Jhin, y tube que hacer tarea. Yo no me acordaba y para mi es mas importante la escuela, entonces la hice, tiraron remake y me pusieron cola. Me la podrian quitar??? Ya que es mas importante el colegio quiero que me la quiten","url":"https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/TjvGge4N-quiero-que-me-la-quiten","image":"https://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":4,"down_votes":5,"body":"Ya entendi lo de que pregunte y demas, yo lo hice revise todo con mi mama ( por la dudas) y dije como que bueno juego con Jhin haber que sale y justo se me pego un hoja en la que tenia tarea, me re cagaron a pedo de distraido y justo cuando vuelvo tiraron remake, solo querria que me perdonen y que me la saquen D:","replies":[{"poster":"Lucio07","date":"2017-04-10T15:18:59.519+0000","up_votes":1,"down_votes":0,"body":"Ok","replies":[]},{"poster":"Escrache","date":"2017-04-10T14:52:22.059+0000","up_votes":1,"down_votes":0,"body":"Como ya te dijeron antes, aprovecha el tiempo de la cola ahora para asegurarte de que no te falta lo mas mínimo..","replies":[]},{"poster":"Charlôtte","date":"2017-04-10T14:31:48.018+0000","up_votes":1,"down_votes":0,"body":"Exactamente como dice Arzen\nPara que te hagas una idea de lo malo que era antes, a mi me pusieron cola por cinco partidas y me banearon 3 días, cuando volví ya no tenía cola JAJAJAJAJ \nTampoco es el fin del mundo^^","replies":[]},{"poster":"iTargaryen","date":"2017-04-10T13:53:48.545+0000","up_votes":1,"down_votes":0,"body":"jajaj no te preocupes, yo hace unos años pase por algo peor, una cola de baja prioridad INFINITA, si, así es, cuando la crearon tenia muchos bugs y yo juge como 25 partidas con cola sin saber que tendrían q durar 5 partidas.\n\nYa se te va ir, tene en cuenta que no podes justificar abandonar la partida, aparte es una pavada porque no te banearon, es una cola.","replies":[]},{"poster":"Forero","date":"2017-04-10T13:50:08.870+0000","up_votes":1,"down_votes":0,"body":"La cola de baja prioridad desaparecerá al jugar las 5 partidas, después no la volverás a tener hasta que nuevamente reincidas en abandonar varias partidas.","replies":[]}]}