{"poster":"Aexy","date":"2018-03-19T09:14:57.686+0000","title":"Last Seasons Dia'Top-Main sucht..","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Moin Moin,\n\nich bin aktuell auf der Suche nach einem aktiven Gr&uuml;ppchen/Team im High-Plat bis Master Bereich zum FlexQ, evt. SoloQ und 3v3Q spielen. \nAllerdings bin ich auf Grund meines Studiums innerhalb der Vorlesungszeiten nur bedingt in der Lage regelm&auml;&szlig;ig da zu sein. Daher sollte das Spiel selbst zwar relativ ernst genommen werden, aber das Team nicht zu 100% Tryhard und aus einer &quot;Du-warst-2-Mal-nicht-da-Du-fliegst&quot;-Mentalit&auml;t bestehen. \n\nZu meiner Person:\n- Spiele seit Anfang Season 1 (oder Beta?_Who know&#039;s_) \n- Habe mittlerweile jede Position mindestens eine Season als _Main_  verbracht\n- spiele erst seit Season 3 Ranked _bin aber nicht der aktivste SoloQ Spieler..40-60 gem&uuml;tliche Spiele pro Season reichen mir f&uuml;r Dia 3-4 und dann sitz ich               zufrieden die Season aus_\n- Aktuell Top-Lane Main. Kann durch meinen Champ-Pool und die Erfahrung aber auch Problemlos Mitte &uuml;bernehmen.\n _Dazu: Ich bevorzuge mobile, schadenslastige Champions. Tanks beherrsche ich zwar (wer auch nicht), aber sie bereiten mir halt &uuml;berhaupt keinen Spa&szlig;.\n   Grob zusammengefasst eher Assassin-Types. Orientiere mich momentan (der Meta wegen) aber ein wenig in Richtung Offtanks/Fighter um (Jax, Tryndamere, Irelia, Aatrox, Yasuo, etc.)\n   Ich gewinne etwa 2/3 meiner Wins durch Macro-ing &amp; Splitpush.\n   Micro ist aber trotzdem (laut Coach von vor &#039;nem Jahr) auf High-Dia bis Challanger Niveau\n {{sticker:sg-lulu}}_\n- Coaching-Erfahrung; \n- Bef&auml;higung zum Shotcalling ist ein wenig eingerostet, aber vorhanden\n- bin 22 Jahre jung, studiere, m&auml;nnlich, tilt-prove &amp; freundlich, kritikf&auml;hig..\n\n\nWas ihr mitbringen solltet:\n- Freundlichkeit\n- **TILT FREI**\n- 18+\n- generell aktiv sein, (wobei ich ja schon angedeutet habe, dass durch mein Studium in Etappen die Zeit bei mir etwas knapp werden kann, oder abstuse Zeiten annehmen kann, bin zB. heute schon um 7 on gewesen :x)\n- High-Plat, aber bevorzugt Diamond 5+ (w&uuml;rde mich auch gerne bei High-Dia+ anschlie&szlig;en; da improve ich schneller und die Spiele machen generell mehr Spa&szlig;)\n- die M&ouml;glichkeit, dass ich meinen Spielstil soweit beibehalten kann (In Meta-Gezwungen zu werden ist nicht meins. Und Tanks spiele ich auch nicht gern. ABER ICH BIN KEIN ONETRICK)\n- wenigstens 1-2 Leutchen sollten auch 3v3 begeistert sein :P\n- TS / Discord \nAdded mich einfach Ingame _ Aexy _ , bin diese Woche ziemlich gut zu erreichen. \nIch w&auml;re begeistert, wenn ich zumindest f&uuml;r den Vormittag diese Woche  jemanden zum zocken finden w&uuml;rde. \n\nMfG Aexy","replies":[]}