{"poster":"BigFBear","date":"2018-04-11T12:56:39.501+0000","title":"random 5 Sekunden BLACKSCREEN ingame","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo.\nIch habe das Problem, dass ich immer mal wieder Blackscreens w&auml;hrend LoL-Matches habe.\nManchmal spiel ich mehrere Spiele hintereinander ohne Probleme und manchmal hab ich 2 Blackscreens in einem Match.\n\nMeistens tritt der Fehler w&auml;hrend eines Teamfighs auf, wenn viele Effekte auf dem Bildschirm zu sehen sind (glaube ich zumindest).\n**Der Bildschirm wird dann ganz kurz komplett grau und dann schwarz und bleibt dann f&uuml;r einige Sekunden so. W&auml;hrenddessen kann ich den Sound im Hintergrund h&ouml;ren. Nach ein paar Sekunden ist das Bild dann wieder da und ich kann normal weiterspielen.**\n\nDieses Problem habe ich jetzt seit ein paar Monaten und bis jetzt auch nur in LoL.\n\nIch spiele zwar auf hohen Grafikeinstellungen (2560x1440, 144 FPS-cap, Very High Settings, Anti Aliasing an, V-Sync an) aber meine Grafikkarte scheint damit keine Probleme zu haben. die FPS werden konstant gehalten (ohne FPS-Cap sogar h&ouml;her), ohne dass die Grafikkarte hei&szlig;/laut wird (55&deg;-65&deg;C).\n\nIch habe auch schon ohne V-Sync versucht...bringt nix.\n\nMein System:\nMonitor: Asus MG279Q 144HZ (DisplayPort) (IPS)\nProzessor: intel xeon cpu e3-1231 v3 (3.40ghz)\nGrafikkarte: NVIDIA GeForce GTX 970\nNetzteil: 530W\nRAM: 8 GB DDR3\n\nIm Internet habe ich viele Beitr&auml;ge gelesen von anderen leuten die dasselbe Problem haben. Sehr oft auch mit League of Legends, aber nirgendwo habe ich eine L&ouml;sung finden k&ouml;nnen.\n\nIch w&uuml;rde mich sehr freuen wenn man mir helfen k&ouml;nnte, da dieses Problem wirklich nervig ist, da es mir nicht nur einmal das virtuelle Leben und damit oft auch ganze Spiele gekostet hat.\n\nHat jemand das gleiche Problem?","replies":[{"poster":"HOPPSNEHMER","date":"2018-04-11T13:18:53.650+0000","up_votes":2,"down_votes":0,"body":"Hallo,\n\nhabe seit gestern einen neuen Monitor mit der selben Auflösung ( 2560/1440 ) und kriege auch in Matches blackscreens, die 2-3 sekunden dauern und dann wieder kurz ein Bild.\n\nAuch habe ich im Fog of War rote Pixel, wenn ich auf dieser Auflösung spiele.\n\nIch benutze eine AMD Radeon R7 M440.\n\nHast du auch das \"Fog of War\" Problem?","replies":[{"poster":"BigFBear","date":"2018-04-12T00:42:18.136+0000","up_votes":1,"down_votes":0,"body":"Benutzt du DisplayPort?\n\nIch habe jetzt ganz viel im Internet gesucht und viele Leute mit dem Problem benutzen DisplayPort.\nUnd dann habe ich das hier gefunden:\n\nhttp://www.tomshardware.co.uk/answers/id-3224339/rx480-random-black-screen-gaming.html\n\n> Finally solved, thanks to an LG engineer pointing me in the right direction. In the AMD Radeon settings, under \"Display\", the scaling mode was set to \"Preserve aspect ratio\" when it should have been \"Full panel\".\n> \n> That's all it was.\n\nIch habe das jetzt noch nicht testen können, aber ich kann mir gut vorstellen, dass das der Grund ist.\nIch habs jetzt bei mir (NVIDIA) folgendermaßen eingestellt (stand vorher auch auf \"Seitenverhältnis\"):\n\nhttps://abload.de/img/nvidiaq3uhn.png\n\nHab mich dabei hieran orientiert:\n\nhttps://windowsreport.com/indows-10-fullscreen-games/  \n-> Solution 4\nIst zwar Windows 10, aber das tritt ja in meinem Fall auch in Windows 7 auf.\n\nAnsonsten kann man evtl. noch versuchen in den LoL-Settings mit \"Fullscreen\" oder \"Borderless\" zu experimentieren (k.A. ob das was bringt aber ist ja irgendwie dasselbe Thema).\n\nWenn du ganz sicher gehen willst, tausch mal dein DisplayPort-Kabel gegen HDMI aus. Wenn das Problem dann weg ist weißt du bescheid.\nIst aber auch keine Lösung weil HDMI glaube ich bei höheren Auflösung nur 60 Hz unterstützt was mittlerweile als Gamer imho nicht mehr tragbar ist und man sieht auch ganz deutlich einen Unterschied zwischen 60 Hz und 120 Hz oder 144 Hz. Auch bei LoL.\n\nP.S.\nDie roten Pixel habe ich nicht. Kann aber evtl. auch durch die Skalierung kommen.\nSag mir mal ob die weggehen wenn du das umstellst wie beschrieben.","replies":[{"poster":"Sidia","date":"2018-04-12T13:03:54.699+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\ndie neueren HDMI Standards unterstützen mittlerweile 144 FPS. Sollte das was du dort beschreibst es nicht beheben benachrichtige uns bitte.\n\nMit freundlichen Grüßen\nSidia","replies":[]}]}]},{"poster":"BigFBear","date":"2018-04-16T10:41:04.912+0000","up_votes":1,"down_votes":0,"body":"I just want to tell you:\n\nIT WORKED!\n\nNever had this BlackScreens again!\n\nYEAAHH!! Moths of agony! \nI am free now!!","replies":[]}]}