{"poster":"Rock MD","date":"2018-11-25T01:51:12.313+0000","title":"Dark Harvest is pretty underwhelming now outside of one interaction","subforum":"Gameplay","up_votes":1,"down_votes":2,"body":"That interaction is DoTs.\n\nAs it currently stands, Dark Harvest procs off ANY damage source that is applied to a target, including ignite, Luden&#039;s procs, Red Smite&#039;s true damage, and Liandry&#039;s. It stands to reason that it could proc off Scorch as well. \n\nI&#039;m worried because this could lead to a good number of unintended collateral kills in which the keystone itself is oppressive because the counterplay is boiled down to, &quot;don&#039;t get hit with DoT.&quot; and it seems in specific cases it&#039;d be easy to hit 2 targets -&gt; proc DH on one -&gt; kill the first -&gt; proc DH on the other purely off of something like Brand passive. \n\nThis is also pretty cheesy on champions like Kha&#039;Zix, who I saw hit a champion from ~65 -&gt; 15% with a Q and then Dark Harvest finished them off on Red Smite DoT. \n\nI think it&#039;s worth looking into and nerfing so that it only procs of the initial hit/tick (if you get ignited, it only procs with the first application of ignite) or lock the keystone to not proc off item effects (Luden&#039;s, Liandry&#039;s, Skirmisher&#039;s). This interaction only serves to make the keystone better for mages (and Kha&#039;Zix) than the champions it was designed to be used by.\n\nThen after that, it could stand to get some buffs and/or retooling on the maps that aren&#039;t ARAM. Perhaps reducing the %hp threshold and returning some of the pre-hotfix damage.","replies":[{"poster":"MagicFlyingLlama","date":"2018-11-25T02:03:39.826+0000","up_votes":1,"down_votes":0,"body":"\"it sucks, nerf it!\"","replies":[{"poster":"Rock MD","date":"2018-11-25T03:04:30.661+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MagicFlyingLlama,realm=NA,application-id=3ErqAdtq,discussion-id=Gg9WxGxe,comment-id=0000,timestamp=2018-11-25T02:03:39.826+0000)\n>\n> &quot;it sucks, nerf it!&quot;\n\n\"It's got one really obnoxious interaction, nerf that and then buff the keystone to make it better for its intended users.\"\n\nI get it, reading comprehension is hard for the average gameplay user.","replies":[{"poster":"MagicFlyingLlama","date":"2018-11-25T04:05:28.462+0000","up_votes":1,"down_votes":0,"body":"How often does a DoT drop someone under 50% HP who would otherwise not fall under 50% HP?\n\nIt is a nonissue, just looks more annoying than it actually is, similar to getting killed at lv3 by a soraka running scorch, after flashing under your turret.","replies":[{"poster":"Rock MD","date":"2018-11-25T04:19:12.875+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MagicFlyingLlama,realm=NA,application-id=3ErqAdtq,discussion-id=Gg9WxGxe,comment-id=000000000000,timestamp=2018-11-25T04:05:28.462+0000)\n>\n> How often does a DoT drop someone under 50% HP who would otherwise not fall under 50% HP?\n> \n> It is a nonissue, just looks more annoying than it actually is, similar to getting killed at lv3 by a soraka running scorch, after flashing under your turret.\n\nThat's not the problem. The problem is nukes that drop them from 50% into low values followed by DoT damage proccing DH.\n\nWorst case scenario looks to be Karthus. Slap a Liandry's on that champion and I think it's going to be very easy for him to send a squishy back to base or chunk them for 80% and then hit another champion for 80% because of DH timer reset.","replies":[]}]}]}]},{"poster":"Ahri Inari","date":"2018-11-25T03:07:06.895+0000","up_votes":1,"down_votes":0,"body":"Considering Dots user don't have dedicated keystone I don't see the problem.","replies":[]}]}