{"poster":"Dolang","date":"2017-11-28T17:22:46.690+0000","title":"¿Riot es verdad que ahora en las solo Q los equipos se emparejan por nivel y no por elo?","subforum":"Charlas Generales","up_votes":1,"down_votes":4,"body":"&iquest;Riot es verdad que ahora en las solo Q los equipos se emparejan por nivel y no por elo? , quisiera saberlo ya que normalmente me esat tocando gente de nivel inferior, no me enoja sino que hace las partidas mas aburridas o hay veces que la diferencia es muy grande\r\ngracias.{{sticker:cass-cry}}","replies":[{"poster":"WhiteMax","date":"2017-11-28T18:22:50.093+0000","up_votes":1,"down_votes":0,"body":"No. Y quien te diga que si miente.","replies":[]},{"poster":"MILFortune","date":"2017-11-28T17:26:39.024+0000","up_votes":1,"down_votes":0,"body":"Es un mito y Kenshiro tiene razón. Imaginate que clase de emparejamiento sería un challenger level 50 con un bronce de cualquier level (50 para amoldarse a tu pregunta)","replies":[{"poster":"Dolang","date":"2017-11-28T17:30:06.060+0000","up_votes":1,"down_votes":0,"body":"gracias por sacarme la duda    {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2017-11-28T17:23:48.601+0000","up_votes":1,"down_votes":0,"body":"Algo así no es viable xD","replies":[]},{"poster":"Delsaco","date":"2017-11-28T17:31:34.627+0000","up_votes":1,"down_votes":2,"body":"cual es la diferencia de nivel y de elo.....???\n\nporque elo es un sistema para determinar nivel a base del winratio....\n\nsi tu me dices nivel querras decir rendimiento en partida y eso por lo que yo se no es asi....\n\nme imagino que no lo haran porque el sistema seria terriblemente difícil de hacer.... tendrias que hacer ul algoritmo del mmk que considere kda, wards puestas,  daño, heleo, daño soportado, objetivos hechos, farm promedio, torres destruidas, daño hehco al nexo, ward removidas, win ratio de cada campeon q seria diferente porque el rendimiento no es igual,buf otorgados.... Y COMO ASIGNARLE UN VALOR A CADA COSA UUUUYYYYY QUE DIFICIL PARA QUE FUNCIONE BIEN ESO.....\n\nYO LO VEO MUUUUY DIFICIL....\n\n\n**__si te refieres al nivel al numerito que saca por aprtidas jugadas ESTAS LOCO!!!!! eso no es mas que un dato referencial de cuanto alguien ha jugado no del NIVEL DE JUEGO QUE TIENE!!!!\n\nSI FUESE ASI UN TIO QUE JUEGA NO SE MIL PARTIDAS Y ES BRONCE 5 TENDRIA QUE JUGAR CONTRA CHALENGERS LO QUE SERIA RIDICULO....\n\nCALIDAD NO ES CANTIDAD....__**","replies":[]}]}