{"poster":"ChupahLohPechoh","date":"2017-09-10T03:26:46.918+0000","title":"Donde pido disculpas...?","subforum":"Problemas Técnicos","up_votes":6,"down_votes":4,"body":"Me banearon por nada... Osea mis amigos mis premades me reportaron para bromear y riot me baneo permanente siendo que todos estabamos molestando etc.. porfavor alguien me dice como pedir disculpas a riot o algo parecido.. mi amigo lo desbanearon de la permanente al pedir disculpas... ayuda pls","replies":[{"poster":"The Inkanus","date":"2017-09-10T04:55:20.836+0000","up_votes":1,"down_votes":0,"body":">mi amigo lo desbanearon de la permanente al pedir disculpas\n\nSuena a un caso interesante, el único que se conozca de hecho. Podrías pedirle a tu amigo que se pase por el foro y nos cuente más acerca de cómo fue eso?. Porque Riot nos dice y nos repite que no se levantan baneos permanentes causados por toxicidad a menos que haya sido un error del sistema...","replies":[{"poster":"PÉNTÁMÁN ÍZÍ ","date":"2017-09-10T15:58:02.326+0000","up_votes":1,"down_votes":0,"body":"Eso es mentira, a mi hermano lo banearon permanentemente sin razones de hacerlo.\nMandó tickets a Riot quejandose de que lo banearon sin razón y le respondieron que no le podrían sacar el ban...","replies":[]}]},{"poster":"Diosmo","date":"2017-09-10T07:53:15.470+0000","up_votes":1,"down_votes":0,"body":"Tenes que hablar con el jefe Gorgory\n\nhttps://memegenerator.net/img/images/600x600/12482425/jefe-gorgory.jpg","replies":[]},{"poster":"Little T","date":"2017-09-10T03:31:40.575+0000","up_votes":1,"down_votes":1,"body":"https://www.youtube.com/watch?v=D2Lt0hc6Exs\n\nenserio esperas que te creamos? por si no lo sabias no te banean solo por que te reportaron en una sola partida, claramente flameaste o tuviste otras actitudes antideportivas antes...","replies":[{"poster":" Katarina Select","date":"2017-09-10T05:04:19.493+0000","up_votes":1,"down_votes":0,"body":"jajajajajajajjajaja muy buena con el video de re pasaste ajjajajajajajajajaj","replies":[]}]},{"poster":"Mazer Rakham","date":"2017-09-10T03:31:22.329+0000","up_votes":1,"down_votes":0,"body":"No te sacan un permaban por pedir disculpas. Tu amigo te verseó. Sólo se saca el perma si es por falta de pago u error (los cuales son pocos). Y para que te den permaban tienes que haber juntado varios reportes consistentes con actitud tóxica, muerte intencional o similar. No por una sola partida te van a banear, salvo que haya sido algo muy extremo.","replies":[]}]}