{"poster":"ImNw","date":"2016-08-30T00:06:01.200+0000","title":"Nuevo bug de Yasuo(Parche 6.17)","subforum":"Charlas Generales","up_votes":8,"down_votes":4,"body":"Al pareser andan comentando en NA que existe un bug en yasuo que le permite tener ventajas en duelos en bug consiste en que cuando yasuo levanta al objetivo le da un basico ultea, en el transcurso de la ulti se aplica un basico(Cosa que no deberia) y luego al cae creeo que se aplica otro basico sumado mas da&ntilde;o he aqui un video:\n\n[Bug de Yasuo.](https://youtu.be/_IVjbOWvoqk)\n\nPost orignal de Reedit: https://www.reddit.com/r/leagueoflegends/comments/4zx1in/cause_of_yasuo_winrate_spike_118/\nEscucho opiniones","replies":[{"poster":"BiosDarkne55","date":"2016-08-30T00:10:42.768+0000","up_votes":1,"down_votes":3,"body":"No es un bug ya que, cuando está en el aire le pega un básico, y como aún no ha tocado el suelo le tira una r","replies":[{"poster":"SlayerAhri","date":"2016-08-30T00:46:25.596+0000","up_votes":3,"down_votes":0,"body":"Falso, si es un bug. Se ve claramente que cuando ultea hace daño adicional, como si estuviera dando basicos. Eso que dijiste: \"cuando está en el aire le pega un básico\", esa simplemente es la animacion, cuando termina su animacion, ahi recien hace daño. Si prestas atencion al leer su habilidad, su ulti hace daño fijo, no daño por tiempo.","replies":[]},{"poster":"ImNw","date":"2016-08-30T00:12:33.162+0000","up_votes":3,"down_votes":0,"body":"Se supone que cuando casteas la ulti no podes castear o tirar basicos , digamos que el daño de la ulti sale, pero lo que esta mal es que meta daño de ulti junto a un basico al mismo tiempo eso es lo que pasa","replies":[]},{"poster":"DLeonel99","date":"2016-08-30T00:22:16.212+0000","up_votes":1,"down_votes":0,"body":"lo que quiere decir es, cuando tira el tornado, estando en el aire le podes pegar un básico y luego apretás R antes de que toque el suelo, una vez toca el suelo le mete la Q, una cosa así sería","replies":[{"poster":"ImNw","date":"2016-08-30T00:57:58.450+0000","up_votes":1,"down_votes":0,"body":"No, en la animacion de la ulti fijate que hace daño 2 veces. quisa un poquito antes en el video lo explican mejor. pero fijate que la cuando lo levanta hace un daño adicional que representa un basico cuando la animacion de la ulti se esta casteando.","replies":[]}]},{"poster":"Aioria99","date":"2016-08-30T00:12:05.948+0000","up_votes":1,"down_votes":0,"body":"No se refiere a eso","replies":[]}]}]}