{"poster":"TBK PikaBolaz","date":"2017-09-05T01:42:01.479+0000","title":"Campeones ADC","subforum":"Guias y consejos","up_votes":5,"down_votes":0,"body":"Holaa perros, bueno quiero hacer una pregunta sobre que campeones son divertidos o no se que sean buenos para jugar de adc.\r\nLlevo 2 meses jugando y no he jugado casi nunca adc, por que no me gusta, con suerte se usar a twitch, miss fortune, sivir y xayah (no a la perfecci&oacute;n pero si se usarlos por lo menos), eso que campeones me recomendar&iacute;an para empezar a usarlos y mainearlos?. Graciasss\r\n\r\n-TBK PikaBolaz    {{champion:114}}","replies":[{"poster":"TSW Rorschach","date":"2017-09-05T12:12:46.420+0000","up_votes":3,"down_votes":0,"body":"{{champion:222}} Tiene buena limpieza de oleadas, no sufre tanto el early, daño decente para principiantes farmeando, ulti global, pasiva que te inyecta adrenalina, visión verdadera anti facecheck con la W, capacidad de hacer cadena de cc de forma fácil, buenas animaciones y pack de voz(?\n\n{{champion:18}} Buen farmeo en early con la pasiva de la E, el mejor adc tirando torres, rango fuerte, reposicionamiento con la W caso de que quedes mal parado y de últimas tenés una ulti que tira al enemigo medio kilómetro lejos.\n\nYo te recomendaría esas ahora.","replies":[]},{"poster":"Súper Top","date":"2017-09-05T21:13:19.545+0000","up_votes":1,"down_votes":0,"body":"Jinx es mega divertida, te destroza en late y puedes kittear desde nivel bajo, no se necesita de primer item algo de velocidad de ataque, la q ya te lo otorga.\nencima yo me cago de risa con lo que dice cuando juego normals xd","replies":[]},{"poster":"Defg45333","date":"2017-09-05T01:51:36.122+0000","up_votes":1,"down_votes":0,"body":"Yo tampoco juego adc, de hecho juego menos adcs que tú.\nMis opciones son, {{champion:21}}, si quiero intentar stompear y ganar rápido, o {{champion:18}} (normalmente uso a esta última), que si la partida se alarga y terminas la build no te para nadie, además es muy fácil de jugar y tiene un salto para corregir los errores de posicionamiento (que son comunes en mi caso ya que no juego adcs).\nYo te recomiendo a Tris.\nUn saludo.","replies":[]},{"poster":"Lucio22","date":"2017-09-05T01:44:20.992+0000","up_votes":1,"down_votes":1,"body":"jinxie siempre es una opcion...","replies":[]}]}