{"poster":"Tyrr Judicator","date":"2016-01-31T16:15:32.184+0000","title":"Modificar las voces es BANEABLE","subforum":"Charlas Generales","embed":{"description":"So basically a friend of mine got banned 2 days ago for a bug exploit/using a not allowed software. He contacted the support to know what was...","url":"https://www.reddit.com/r/leagueoflegends/comments/43j8u5/ok_so_apparently_you_can_get_ban_by_changing_your/","image":"https://i.redditmedia.com/F2a4Pt3NwYO_316KZ8HcF357ZuzF2RVhB6DQUeOqHkU.jpg?w=320&s=9038b1f8b942979ab377ab6664f3bd77"},"up_votes":3,"down_votes":5,"body":"Dejo un liink a una discusi&oacute;n de reddit donde muestran a un jugador franc&eacute;s que recibi&oacute; efectivamente un ban por cambiar las voces del cliente.\r\nChicos tengan cuidado...\r\nDe paso si alg&uacute;n rioter viene para echarle agua al tema y aclarar un poco mas estar&iacute;a mas que bien","replies":[{"poster":"LGBT Valentina","date":"2016-01-31T19:15:14.735+0000","up_votes":6,"down_votes":0,"body":"Y?\nA nadie le importa\n\nSi alguien defiende el tema este, de cambiar de idiomas, es un terrible idiota (al menos que lo defiendia x dinero/obligacion, riot)\n\nTendrian que banear MINIMO, al 70% de los jugadores de league of legends\n\nYa se hablo de este tema y a sir dal, le pasaron los -2k de dislike o down vote\n\nAnda a usar wooxy y si queres cambiar de idioma hacelo, riot no tiene forma de que se entere\nSi lo queres hacer desde el archivo regions, hacelo\nno modifica tu juego, ni da ventajas, ni desventajas, el juego sigue \"balanceado\" (ponele, el equipo de balanceos, la verdad deja de desear hace 3 años)\n\nLa unica forma que Riot se entere:\nTu Amig@ es una basura\nQue escribas en el chat, tengo X idioma, no tengo X item, etc. Y sean tan niños para reportarlo o mandarlo a soporte\n\n\ntoma, divertite unicamente cambiandole las voces a los champs\nhttp://mapskins.com/wooxy/faq/\n\n\nya los \"capos\" de LA, aclararon, esto que NO es LEGAL, a nadie le importa\nsi no me gusta el doblaje mexicano, xq lo tengo que escuchar? quiero escuchar las voces de otros champs y no voy a poner 150-300 pesos (argentinos) para irme a otra region y ensima tener LAG (sacando a BR, que anda de 10 casi siempre)\n\n\n","replies":[{"poster":"Tyrr Judicator","date":"2016-01-31T21:50:06.268+0000","up_votes":1,"down_votes":0,"body":"Básicamente estoy exponiendo un caso de un jugador en el server FRANCES, obviamente la diferencia entre los servidores pueden hacer que los rojos tomen diferentes decisiones, yo creo que eso del cambio de idioma del lenguaje acá en LA les importa poco y nada\npero según las reglas dice claramente que cualquier modificación al cliente es baneable \n(yo uso el LoLvoChanger) <- ya lo actualizaron.\n\n\nCabe agregar que el jugador baneado después de mandar un ticket al soporte le sacaron el ban... cosa que creo que acá en LAS \nabsolutamente NUNCA pasaria","replies":[]}]},{"poster":"Shappaw","date":"2016-01-31T16:24:31.332+0000","up_votes":5,"down_votes":0,"body":"Más abajo en uno de los comentarios dice que después le quitaron el ban porque Riot se dió cuenta que no usó ningún script, sólo usó el VoiceChanger.","replies":[{"poster":"Caraxes","date":"2016-01-31T17:14:07.453+0000","up_votes":1,"down_votes":2,"body":"http://image.noelshack.com/fichiers/2016/04/1454199290-yop.png\n\nLiteralmente dice que el cambio de lenguaje es una modificación del cliente, y es baneable.","replies":[{"poster":"Runth","date":"2016-02-01T00:57:01.394+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Caraxes,realm=LAS,application-id=v7qsfXsE,discussion-id=WkElQ46y,comment-id=00000000,timestamp=2016-01-31T17:14:07.453+0000)\n>\n> http://image.noelshack.com/fichiers/2016/04/1454199290-yop.png\n> \n> Literalmente dice que el cambio de lenguaje es una modificación del cliente, y es baneable.\n\nde seguro ni has trabajado en blog de notas","replies":[{"poster":"Lightning Shx","date":"2016-02-01T02:29:40.312+0000","up_votes":1,"down_votes":0,"body":"Demasiado difícil leer lo que dice el ticket? Hay unas cuantas traducciones en el ink del OP","replies":[]}]}]}]},{"poster":"panther189","date":"2016-01-31T17:42:44.567+0000","up_votes":3,"down_votes":0,"body":"No es baneable, te dejo un link de un caster de la lvp que idce que se comunico con un rioter y le dijo que no es baneable.\nde paso aprende a cambair las voces xd\nhttps://www.youtube.com/watch?v=jXVo2WplnPE","replies":[{"poster":"When Pigs Fly","date":"2016-01-31T18:47:49.673+0000","up_votes":1,"down_votes":0,"body":"Si lo dice uLISES, entonces debe ser cierto (? XD","replies":[]}]},{"poster":"When Pigs Fly","date":"2016-01-31T16:25:42.919+0000","up_votes":2,"down_votes":0,"body":"Creo que depende de cómo lo hagas. Muchos jugadores directamente cambian parte del archivo \"regions.txt\" para cambiar el idioma a inglés etc., y nunca escuché de alguno de ellos siendo baneado. Lo que sí me gustaría saber es acerca de programas como Wooxy (que instalan mods de sonido y particulas y skins personalizados). Hasta donde yo tengo entendido no te banean por utilizar ese programa porque no te da una ventaja en el juego ni publican mods para conseguir skins del juego gratis (como lo hace MKLol), pero no recomiendan usarlo debido a que pueden hacer que te deje de funcionar el LoL.\nMuchos usan Wooxy o LVOC para poner las voces en coreano o, ahora también, en japonés.","replies":[{"poster":"JulianELR","date":"2016-01-31T18:11:03.907+0000","up_votes":1,"down_votes":4,"body":"Si te pueden banear, lo han dicho un montón de veces y si quieres lo puedes leer tu en los términos y condiciones :)","replies":[{"poster":"Un Alma Más","date":"2016-01-31T18:19:22.291+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=JulianELR,realm=LAS,application-id=v7qsfXsE,discussion-id=WkElQ46y,comment-id=00020001,timestamp=2016-01-31T18:11:03.907+0000)\n>\n> Si te pueden banear, lo han dicho un montón de veces y si quieres lo puedes leer tu en los términos y condiciones :)\n\nNo es baneable, está desmentido mas abajo. Además se supone que cambiarle las voces no afecta en nada, y si el lol está traducido al koreano pues por qué tendria que ser baneable? Solo le cambias el idioma.","replies":[{"poster":"JulianELR","date":"2016-01-31T18:49:21.350+0000","up_votes":1,"down_votes":0,"body":"En el acuerdo de licencia para el usuario final están las limitaciones que tiene un usuario.\n\n**La licencia limitada que se concede al Usuario en la cláusula I está sujeta a las limitaciones adicionales que se exponen a continuación. Cualquier uso del Software que viole las limitaciones de la licencia es un uso no autorizado del mismo y por lo tanto, no cubierto por la licencia concedida al Usuario en la cláusula I, por lo que será considerado como una violación de los derechos de autor que tiene Riot Games y  sobre el Software y el Juego. El Usuario accede a no realizar, bajo ninguna circunstancia, las siguientes acciones:**\n\n* Modificar o causar la modificación de archivos que formen parte del Software aplicando métodos no autorizados expresamente por Riot Games.\n\nAqui esta el link y lee tu mismo(a): http://las.leagueoflegends.com/es/legal/eula","replies":[{"poster":"Runth","date":"2016-01-31T20:09:24.806+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JulianELR,realm=LAS,application-id=v7qsfXsE,discussion-id=WkElQ46y,comment-id=0002000100000000,timestamp=2016-01-31T18:49:21.350+0000)\n>\n> En el acuerdo de licencia para el usuario final están las limitaciones que tiene un usuario.\n> \n> **La licencia limitada que se concede al Usuario en la cláusula I está sujeta a las limitaciones adicionales que se exponen a continuación. Cualquier uso del Software que viole las limitaciones de la licencia es un uso no autorizado del mismo y por lo tanto, no cubierto por la licencia concedida al Usuario en la cláusula I, por lo que será considerado como una violación de los derechos de autor que tiene Riot Games y  sobre el Software y el Juego. El Usuario accede a no realizar, bajo ninguna circunstancia, las siguientes acciones:**\n> \n> * Modificar o causar la modificación de archivos que formen parte del Software aplicando métodos no autorizados expresamente por Riot Games.\n> \n> Aqui esta el link y lee tu mismo(a): http://las.leagueoflegends.com/es/legal/eula\n\ntonces los overlays tambien, los customs tambien?\n\nSoftware Programs =/= Customs Programs","replies":[{"poster":"JulianELR","date":"2016-01-31T23:04:31.235+0000","up_votes":1,"down_votes":0,"body":"Todo lo que modifique el juego si, a excepción de programas autorizados por riot (Creo que lo dice en alguna parte :P)","replies":[]}]}]}]},{"poster":"When Pigs Fly","date":"2016-01-31T18:40:10.549+0000","up_votes":1,"down_votes":0,"body":"Cito, desde la página de Wooxy:\n\n> Is this legal? What about Riot statement over custom modifications?\nWooxy is only able to install cosmetic changes to the game, it will never change other files to give unfair advantage to players. We are against mods that give advantage for players, and we are serious about it.\nWhile Riot does not give support for modding, because it can break your game, they are not against cosmetic modifications that don’t give unfair advantage for players, and we from MapSkins.com will always respect this rule. We have been serving map skins since two years ago and no one never had any case of ban because of a custom skin.\nMoreover, Wooxy focuses heavily on the Safe side, with extensive tests and always up-to-date to give you a free-worry solution to enjoy a new way to have fun in your game.","replies":[]}]},{"poster":"When Pigs Fly","date":"2016-01-31T16:30:05.529+0000","up_votes":1,"down_votes":0,"body":"Aquí te dejo el FAQ de Wooxy, donde en el primer punto responden a este tema en particular:\n\nhttp://mapskins.com/wooxy/faq/","replies":[]}]},{"poster":"I am bl4z","date":"2016-01-31T16:40:45.547+0000","up_votes":1,"down_votes":0,"body":"Solo te banean cuando usas \"algo\" que te de ventaja en el juego, obviamente no pegaras mas fuerte por un cambio de voz xD","replies":[{"poster":"Lucrexio","date":"2016-01-31T16:52:06.137+0000","up_votes":1,"down_votes":0,"body":"En medio de la TF: \"ULTEA ULTEA ULTEAAAAAAAAAAA!!\"","replies":[{"poster":"Un Alma Más","date":"2016-01-31T18:17:38.051+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=X Gungnir X,realm=LAS,application-id=v7qsfXsE,discussion-id=WkElQ46y,comment-id=00030000,timestamp=2016-01-31T16:52:06.137+0000)\n>\n> En medio de la TF: \"ULTEA ULTEA ULTEAAAAAAAAAAA!!\"\n\n???","replies":[]}]},{"poster":"Caraxes","date":"2016-01-31T17:14:30.327+0000","up_votes":1,"down_votes":0,"body":"En el ticket dice que lo banearon por modificar el cliente (cambiando las voces)","replies":[]}]},{"poster":"Shappaw","date":"2016-01-31T16:25:03.871+0000","up_votes":1,"down_votes":0,"body":"Por lo tanto NO es baneable. Pero considero lo que dijiste que venga algún rioter para aclarar mejor las cosas.","replies":[]},{"poster":"Lord Sonic","date":"2016-01-31T18:14:26.493+0000","up_votes":1,"down_votes":1,"body":"Pero no sean tan chupamedias de Riot, no te van a regalar Rp por publicar estas pavadas.","replies":[]}]}