{"poster":"Matsuzaka544","date":"2017-09-26T07:54:19.535+0000","title":"When should i start warding brushes as a sup?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I&#039;ve been maining supports for some time now and I&#039;m really bad at warding.Also I&#039;ll really appreciate it if you can give me some sup tips!","replies":[{"poster":"Fitzky","date":"2017-09-28T05:00:40.783+0000","up_votes":1,"down_votes":0,"body":"WHEN you ward is usually the same for every lane, around levels 3-4 when you know the jgler is ready to gank lanes. WHERE you ward for botlane is usually just the tri bush and river bush, although I do see some supports sometimes ward up the river as well.","replies":[]},{"poster":"Matsuzaka544","date":"2017-09-26T10:26:30.113+0000","up_votes":1,"down_votes":0,"body":"Ah thank you so much :O","replies":[{"poster":"Time Criminal","date":"2017-09-27T07:37:05.570+0000","up_votes":1,"down_votes":0,"body":"Lol so sorry, I forgot about this and it didn't tell me that you replied but I'll make it tomorrow :)      Again sorry about that","replies":[{"poster":"Time Criminal","date":"2017-09-28T03:57:58.810+0000","up_votes":1,"down_votes":0,"body":"So here it is. I've made two images, one for red side and one for blue side. The first one is blue side warding.\n\nhttps://imgur.com/a/G2cNQ\n\nThe red wards are the early trinket wards. The yellow ones are control wards. If a bush has a yellow and a red dot you can place either, depending on where you need the control ward the most. Where you place it depends on how aggressive the enemy jungle and mid laner are being. The green ones are the sightstone/after first tower wards, with some deep jungle and pushing wards.\n\nhttps://imgur.com/a/O9faF\n\nThe colors mean the same thing in this one. If you are behind you can place wards in your own jungle/bot lane. The deeper jungle wards can be not used if their jg is spending most of their time top, it all varies from game to game. \n\nI hope this helps :)\n\n\n______\n\nBy the way what supports do you play? I might be able to give some tips on those :)","replies":[]}]}]},{"poster":"DarkShade918","date":"2017-09-27T10:10:24.213+0000","up_votes":1,"down_votes":0,"body":"roughly 2:45-3:45 on the clock, thats about the time when jg's start ganking, first back always buy CTRL ward and place in the nearest bush to your tower (Tri on blue side, Gromp on red)","replies":[]},{"poster":"Time Criminal","date":"2017-09-26T09:13:34.389+0000","up_votes":1,"down_votes":0,"body":"Hi Matsazuka544,\n\nI'm not sure how to explain where to place wards, and what type and all that, but if you wait until tomorrow I can put some dots on a picture of Summoner's Rift to show off where, and I could maybe even put some colours in to show when :P\n\n___\nTime Criminal","replies":[]}]}