{"poster":"AmumuAlexx","date":"2017-07-09T00:58:35.772+0000","title":"Guía para tryndamere pls :c","subforum":"Guias y consejos","up_votes":4,"down_votes":1,"body":"Quer&iacute;a saber si hab&iacute;a aqu&iacute; un main tryndamere que me explique m&aacute;s o menos algunos consejos con el champ se consejos b&aacute;sicos pero siento que me falta mucho tambien uso tryndamere lo uso mucho pero de verdad necesito m&aacute;s consejos xD","replies":[{"poster":"Black Beret","date":"2017-07-09T01:34:05.503+0000","up_votes":4,"down_votes":0,"body":"Busca en google como usar el click derecho gg","replies":[]},{"poster":"Dog Bulling","date":"2017-07-09T03:41:47.859+0000","up_votes":1,"down_votes":0,"body":"click derecho + R igual victoria.\n\nHablando en serio, lo primero es que este campeón se juega con {{summoner:6}}, {{summoner:14}} y/o {{summoner:4}} . No es de esos campeones que le saque mucho partido al teleport.\n\nSegundo, en linea juega muy agresivo desde el nivel 2, ya que te puedes curar con tu Q. \n\nTercero y muy importante, el orden de habilidades del rey es Q(2)>E(1)>W(3/4)>R(6). Es decir, desbloqueas la E a nivel 1, te maxeas la Q, solo desbloqueas la W a nivel 3 si el rival es AD, y lo más importante y sorprendente de todo, no deberías darle puntos a la R despues del primero. En serio, esa R no otorga apenas poder despues del primer punto.\n\nCuarto, tryndamere tiene 3 objetos iniciales rentables: {{item:1036}} {{item:1055}} {{item:1054}} . Escoge segun lo complicada que va a ser la linea (Espada larga ante linea facil, espada de doran ante linea normal y escudo ante situaciones compremetedoras).\n\nQuinto, las runas son las clásicas de un tirador, y las maestrías 18/0/12 con fervor. La posición de los puntos es la lógica para alguien que se armaría full daño, se puede curar y se basa en autoataques.\n\nSexto, trynda necesita mínimo un 50% de crítico y dada su R, lo mejor es ir full daño, literal. Por lo general recurre a objetos como {{item:3046}} {{item:3087}} {{item:3153}} {{item:3031}} {{item:3074}} {{item:3071}} {{item:3026}} {{item:3036}} {{item:3812}} y aunque no lo creas, una build muy fuerte con este bárbaro incluye {{item:3508}} de segundo objeto, porque, aunque no use mana, ese 30% de CDR, 70 de AD y 20% de crítico por 3400 de oro es símplemente precioso para campeones de este estilo.\n\nSeptimo, trynda nunca busca las tf, sino que le interesa el pushear como loco y reventar a lo que pille, causando muchos 4vs3 a favor de tu equipo, lo cual permite forzar objetivos.\n\nOctavo y último consejo: CUIDADO CON SATANAS {{champion:17}} , Te ciega y desgasta mucho.","replies":[]},{"poster":"NtcxX","date":"2017-07-09T03:19:24.026+0000","up_votes":1,"down_votes":0,"body":"Mira, yo recomiendo  usar la maestria clave de robo de vida, da sustain y te sirve al principio sin conocerlo, sino fervor... el arbol seria 18/0/12, en juego hoy dia lo recomiendo en top unicamente; llena tu furia para pelear y guarda la e para escapar, no es util gastar para iniciar. Olvidate de tu equipo y concéntrate en pushear y no morir. para la build vendria priorizando critico y velocidad, rey arruinado, statik  berseker. Lei que tires la ulti y te metas a pelear, error, la ulti es para ultimos casos, no sos kyle.  No me parece muy divertido de jugar... No obstante pensa que conforme pase el tiempo y no mueras vas a ser muy moledto","replies":[]},{"poster":"solidwolfxxx","date":"2017-07-09T01:26:37.516+0000","up_votes":1,"down_votes":0,"body":"usa ulti cuando te metas en teamfight comete todo el daño que puedas siempre que tengas tu R  y nunca pero digo nunca te hagas un objeto que te de mucha vida deves ir full fulll daño solo daño y no se que mas decir es un campeon muy facil de usar.","replies":[]},{"poster":"Mr ØwO","date":"2017-07-09T01:10:57.712+0000","up_votes":1,"down_votes":0,"body":"https://youtu.be/uGJS0OXqi6g\n\n-la lechuza dormilona-","replies":[]},{"poster":"Xeport","date":"2017-07-09T01:02:27.593+0000","up_votes":1,"down_votes":0,"body":"Como mein maestria 7 full tryndamere 4k hd 100% real no feiker 1 link mega solo tienes que revenar el clic derecho del raton y ya esta hici penakill papuh ahora me engo que ir {{summoner:4}}  {{sticker:slayer-jinx-catface}}","replies":[]}]}