{"poster":"Iverns Father","date":"2017-07-06T00:51:48.781+0000","title":"FPS Drop and CPU Usage Patterns","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello League community. I am hoping you guys can help me. \r\n\r\nI recently installed league on my computer after doing a Windows 10 reinstall which wiped the previous system clean. After updating all my drivers and doing everything on the FPS guide I figured I'd open a ticket and come to you guys. Many people seem to be experiencing FPS drops right now without a means of fixing it. I previously was playing on maxed settings with 100+ FPS no problems. Now I install and I'm under 15 at same settings. The strange thing is this: when I track the CPU usage of league it decreases as the settings increase. Yeah, weird. I gradually increase the settings and resolution to see what the CPU does, when it is absolute lower settings it uses 20 - 30% of CPU. But, when I increase to max it eventually reaches under 10%. Very confusing...\r\n\r\nPlease help me guys.\r\n\r\nCheers","replies":[{"poster":"Iverns Father","date":"2017-07-11T13:29:43.660+0000","up_votes":1,"down_votes":0,"body":"I have gone through all of the FPS guide to no avail. V-sync is off. I've tried the audio no luck. \n\nSpec are as such\n8GB RAM\nGTX 560 2GB\nIntel i5-3570K CPU @ 3.40GHZ\n\nBeen running over 100fps on max for years. All of a sudden can't get above 20.","replies":[]},{"poster":"Broporo","date":"2017-07-06T21:21:42.894+0000","up_votes":1,"down_votes":0,"body":"This might be a case where your pc is starting off using the integrated graphics at first and then switches over once the settings hit a certain point. I'd recommend turning off v-sync as well as running through the rest of the steps in the [**FPS guide**](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting) too.","replies":[]},{"poster":"Cookamatic","date":"2017-07-06T12:35:06.286+0000","up_votes":1,"down_votes":0,"body":"Out of curiosity, have you tried disabling In-Game Audio? (Not muting with Windows or tuning the Volume to 0, actually disabling the Audio)","replies":[]},{"poster":"TheViper7911","date":"2017-07-06T07:26:59.505+0000","up_votes":1,"down_votes":0,"body":"System specs please. Make, model, graphics card, RAM bus speed and quantity, etc.","replies":[]}]}