{"poster":"Mr Zeroxs","date":"2018-05-16T11:40:26.193+0000","title":"[LFM] [Bronze] Non-Toxic Team Needed To Improve Together","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"Hello OCE, Today I&#039;m looking for 8-10 members to play league with for my team. I haven&#039;t decided on a team name yet and am open to suggestions. I am also looking for a higher ranked coach (pref. Gold-Diamond) to help us play better separately and together. The rough schedule will look like this:\r\n\r\n*     Training on Weekdays 2-3 nights a week for 2-5 hours.\r\n*     One training session on weekends 5-8 hours.\r\n\r\nTimes for both will be obviously down for moving around depending on other commitments of course. This team isn&#039;t going to be completely serious but we need to be serious when we are training or in a game. I will organize scrims and sort out the rosters, I just need you guys to be ready to commit to them or give me notice when you can&#039;t. My expectations:\r\n\r\n *    Non-Toxic (Big one - please be tilt-proof as morale is a big factor in low ELO.)\r\n*     Bronze - Silver player (Anyone ranked higher will likely get bored of us, the aim of the team is to improve together, if you think you&#039;re a god in Bronze, we don&#039;t want you.)\r\n*     Be able to use Voice Chat (Another big one - we can&#039;t have you playing if you&#039;re can&#039;t be talking.)\r\n*     This isn&#039;t 100% needed but it would be appreciated if you could have a different account with &quot;[Team Abbreviation] [Your Name]&quot;  in which you buy champions for your role within the team.\r\n\r\nThanks everyone my contact details are below, if you&#039;re interested please don&#039;t hesitate to get in touch.\r\n\r\nThank you for your time, \r\n~ Mr Zeroxs.\r\n\r\nContacts: \r\nLoL IGN: Mr Zeroxs \r\nDiscord: Pepe#1194 (Active on this Discord more than the other.) \r\nDiscord: Pepe#5417\r\n\r\n(I will likely not reply here but I might, please use the contacts above!)","replies":[]}