{"poster":"Blissed","date":"2016-01-02T04:54:13.589+0000","title":"Jhin Deadeye Teaser meanings revealed.","subforum":"Miscellaneous","up_votes":2,"down_votes":1,"body":"Numerology Definition For JHIN:\nThe life path number of JHIN is 5. For people with the destiny number five it is usually a matter of learning to curb certain predispositions and to control the alignment of their senses, so that their spiritual development is not compromised. Those who have chosen to chase after material values, often succumb to the temptation to perceive only the bright side of life, and accordingly only pursue what promises them amenities and conveniences. Sooner or later however there is no way around from directing their minds to other things that are also part of life. So one can say that number fie makes a man flexible and receptive to new ideas. It also stands for independence, tolerance and trust. People with the destiny number 5 will often find themselves in high social positions and prosperity. However should a five ever lose everything because of circumstances outside of his control, he would carry it with serenity for happiness is his constant companion. This may happen at work, especially if they change jobs frequently or in matters of love, where they rarely suffer severe disappointments. Adaptable and willing to learn. People with the destiny number 5 know how to excellently adapt to external events. Their fate teaches them to understand the meaning of all of their senses, because pain is as important a part of life as are satisfaction, joy and happiness. It is not sufficient in the long run to ignore the less pleasant sensations. Those who do so will destroy themselves. Pain is a good way to show someone the full range of his senses. People with the number life five have the best conditions for learning on how to properly deal with all of their senses. Learning to cope with ones senses is something everybody needs to learn, but for fives it is particularly easy to develop in this area. People with the name number five are sociable, open minded, mentally alert and friendly. This name number is most effective when it occurs together with the destiny number 5 as the double numerological fives will give birth to a very successful person. Both name number and destiny number five are similar in that they consider the pleasurable aspects of life to be a natural part of life. They find it easy to learn and to master their profession. They could not imagine life without extensive social contacts.  \n\nJhin is what is seems a teacher of sorts, not in the traditional way but in the way shown above, teaching Open mindedness, humility and appreciation for what they have. Whether is be Sona with her Musical talent but cannot speak, Vi who wants to stop crime and bring peace to Piltover but loves to fight, Zed whom only sees the way of the shadows and shuns the light and balance and cannot be persuaded otherwise (Religion), Garen whom like Zed believes Demacia is always good and his loyalty with never waiver (but is also conflicted with his love of an enemy, Katarina) each representing the opposite of what Jhin embodies.\n I would really love a post from a red just acknowledging that i have somehow in a way got it right < 3\n\nEdit: It Seem like each sight of the \"bullet wounds\" is part of what Jhin is teaching them.\nEdit: Just realised: Vi=2, Zed=3, Sona=4, Garen=5, (Going by their Names, VI was confirmed to be Roman Numerals representing 6 but it could also be 2 for  Vi.) Co-incidence? I think not.","replies":[{"poster":"Husstler","date":"2016-01-03T05:27:26.486+0000","up_votes":1,"down_votes":0,"body":"You're insane.","replies":[{"poster":"Blissed","date":"2016-01-03T10:16:24.657+0000","up_votes":2,"down_votes":0,"body":":D Ill take that as a compliment to mah detective skills.","replies":[]}]},{"poster":"BakedPotatoGod","date":"2016-01-03T17:07:00.421+0000","up_votes":1,"down_votes":0,"body":"Post this is on Reddit ;P","replies":[]}]}