{"poster":"ElLolero158","date":"2018-07-04T14:09:12.919+0000","title":"me c4go en los jugadores que me tocan cada vez que uso un nuevo campeon","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":17,"body":"Tengo una maldita racha de derrotas por esto soy lvl 29 esperando a jugar rankeds (confio que me va tocar gente buena y no afk como todos las partidas normales)yo no puedo con esto aun asi no se que hace el reporte por ejemplo si yo reporto a alguien por muerte intencional que castigo tendra ? dale riot hace algo con esto no aguanto mas esta estupidez,y eso que cuando juego con soraka support siempre gano partidas y siempre me gano una s- s+ etc siempre pero siempre gano con soraka pero cuando uso un nuevo campeon me tocan puros noobs en mi equipo puros feed afk y etc y siempre hago 3 sv 4  3 sv 5 y siempre asi, el equipo contrario tiene pros y no lo aguanto mas,odio este comportamiento de todos los jugadores,yo diria que cada jugador que abandone tenga que esperar 10 min y no 5 min","replies":[{"poster":"Rebkans","date":"2018-07-04T14:32:22.703+0000","up_votes":4,"down_votes":0,"body":"No es recomendable rankear apenas llegues a lvl 30. A pesar de que no es obligatorio (aunque deberia serlo) lo ideal seria que tuvieras entre 300 y 500 partidas ganadas porque el lapso entre lvl 1 y lvl 30 es muy poco tiempo.\n\nPor otro lado, no te hagas muchas ilusiones porque en las rankeds suelen haber muchos trolls, feeders y afk. No hay mucha diferencia en cuanto comportamiento.","replies":[]},{"poster":"Waninoko Main","date":"2018-07-07T03:28:20.128+0000","up_votes":1,"down_votes":0,"body":"Yo que tu me centraría primero en mejorar en lugar de echarle la culpa a lresto.","replies":[]},{"poster":"Falkon","date":"2018-07-06T13:53:14.059+0000","up_votes":1,"down_votes":0,"body":"Si trollea y no ha recibido baneo, recibiria el ban de 14 dias y respectivamente mas tarde el permaban\nSi flamea y no ha recibido baneo, recibira el ban chat de 10 partidas, luego de 25 y pasando por el ban de 14 dias y un permaban.\n\nHablando de lo otro, veo que eres nuevo y tratas de noob a otras personas... Las normals son para divertirse y pasarla bien (en su mayoria) y viendo que dices que el equipo contrario tiene pros, es posiblemente porque ellos tienen a esos campeones mas mecaniqueados que los de tu team, no significa que sea pro, signiifca que debes mejorar mentalmente (me refiero a no flamear ni decir nada, a no tiltearse demasiado)","replies":[]},{"poster":"MirRawrs","date":"2018-07-04T16:24:40.065+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ElLolero158,realm=LAS,application-id=PJAKt7ph,discussion-id=uzZJ9j98,comment-id=,timestamp=2018-07-04T14:09:12.919+0000)\n>\n>yo diria que cada jugador que abandone tenga que esperar 10 min y no 5 min\n\nLa sanción del Leaverbuster va aumentando entre más AFK te quedes, primero son 5 minutos, luego 10 y así hasta llegar al máximo que son 20 minutos.","replies":[{"poster":"Warisan","date":"2018-07-04T21:40:14.550+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MirRawrs,realm=LAS,application-id=PJAKt7ph,discussion-id=uzZJ9j98,comment-id=0001,timestamp=2018-07-04T16:24:40.065+0000)\n>\n> La sanción del Leaverbuster va aumentando entre más AFK te quedes, primero son 5 minutos, luego 10 y así hasta llegar al máximo que son 20 minutos.\n\nUna vez porque uno de mi equipo no eligió linea nos dieron 1 hora de espera, fue horrible xD","replies":[]}]}]}