{"poster":"Giankkles","date":"2016-07-13T22:37:40.368+0000","title":"Propongo que le cambien el nombre a Rek'Sai y le pongan \"Nerf'Sai\"","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Buenas gentusa lindusa\r\n\r\n Vengo a hacer esto porque como soy el unico que usa a rek sai, (nunca veo que lo usen) y la maineo desde que salio, siempre recibe nerfeos, el campeon ya se volvio inutil, desde que salio no recibio ni un buffeo, NI UNO, no lo usa nadie y encima la nerfean, cuando hay campeones desbalanceados totalmente como: illaoi, zed, yasuo etc. A lo que voy es mostrar mi bronca porque apenas salio rek, la usaba top y rendia muchisimo, la metieron un nerfeo masivo y no la pude usar mas top porque no aguantaba nada, le nerfearon la pasiva, la r, la curacion de la pasiva de la w, el da&ntilde;o de la q, el da&ntilde;o de la q enterrada, ahora le nerfean la w denuevo, no entiendo la verdad, es un campeon que no esta roto.\r\n\r\nBueno nada eso, espero que los de riot vean esto cosa que es imposible chau\r\n\r\nnv\r\n\r\n\r\n\r\n\r\n\r\nnv ameo\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\naguante boca\r\n\r\n\r\n\r\n\r\n\r\n\r\nnv en la grieta vo","replies":[{"poster":"Soraa","date":"2016-07-13T22:45:30.398+0000","up_votes":1,"down_votes":0,"body":"Yo tambien soy main rek sai y es verdad no paran de nerfearla {{item:3151}}  pero la verdad es un champ bastante roto no en el hecho de que pege mucho si no a mi parecer tiene un gran early y el nerfeo que le hicieron a la w ahora la verdad que era necesario por que como dice en el parche la informacion que te daba era demasiada y los cambios que le hicieron antes no te puedo decir por que no la use desde que salio si no cuando la empese a ver a reignover a usarla en competitivo y decidi probarla y me enamore de ese bicho eso un bufeo un poco en el dmg no vendria mal :v \nsalu2 {{champion:421}}","replies":[{"poster":"Giankkles","date":"2016-07-13T22:49:22.914+0000","up_votes":1,"down_votes":0,"body":"iamginate que en top le ganaba al anterior darius y a la anterior fiora, era un asco de rota, ahora es inutil","replies":[{"poster":"Soraa","date":"2016-07-14T15:53:36.550+0000","up_votes":1,"down_votes":0,"body":"JAJAJA de lo que me perdi aun asi la voy a segir usando y juge con rek sai y le note el nerf tiraba la q sin vision y no le daba por que la w me mentia :V","replies":[]}]}]},{"poster":"IITheKingII","date":"2016-07-14T02:00:09.592+0000","up_votes":1,"down_votes":0,"body":"Como me gustaria que le den un nerf a Illaoi el daño que te hace con 1 solo objeto de daño es absurdo","replies":[{"poster":"Dog Bulling","date":"2016-07-14T04:38:38.454+0000","up_votes":1,"down_votes":0,"body":"Lo hicieron, indirectamente. Ahora no será dificil esquivar los tentáculos, lo que realmente la hacen peligrosa.\n\nPD: Es uno y medio objetos de daño, para ser exactos usa {{item:3071}} {{item:3053}} (Este último es mitad daño y mitad aguante), y tampoco es que pegue tanto, almenos no fuera de su definitiva, lo que pasa es que te reduce la armadura en duelos largos y se cura mucho con los tentáculos. Eso, junto al harass que tiene, realmente la hacen una potente lane bullier, pero no aporta mucho mas que daño si la partida se alarga considerablemente.","replies":[]}]},{"poster":"Dog Bulling","date":"2016-07-14T04:25:17.566+0000","up_votes":1,"down_votes":0,"body":"Ojalá algún dia permitan que funcione como offtank (No tiene lo necesario para ser un buen tanque, sobretodo en cuanto a su limitado control de masas) y no solo la nerfeen sin piedad, que realmente le falta daño en partidas largas y sobretodo mejores escalados para que la versión offtank pueda competir contra la version full tanque (Como lo que pasó con ekko, la version ap no podía competir contra la version tanque porque sus escalados AP eran pobres).","replies":[]},{"poster":"Misery Business","date":"2016-07-13T23:45:08.549+0000","up_votes":1,"down_votes":0,"body":"La culpa es de los profesionales, no hay partida en la LCK que no la pickeen y ya saben que los nerfeos se rigen segun el ambito competitivo.","replies":[]},{"poster":"Rolando Magic","date":"2016-07-13T22:46:15.888+0000","up_votes":1,"down_votes":4,"body":"Que estas flasheando papu, rek sai lo pickean siempre y estuvo varies veces en el meta y en competitivo. Y los nerfs son merecidos (aunque el de este parche fue casi nada)","replies":[{"poster":"Giankkles","date":"2016-07-13T22:47:51.018+0000","up_votes":1,"down_votes":1,"body":"Disculpame amiguito, pero en oro silver y platino ni se usa, yo no lo veo NUNCA pero cuando digo nunca es nunca, no es merecido.","replies":[{"poster":"Rolando Magic","date":"2016-07-13T22:49:43.622+0000","up_votes":1,"down_votes":0,"body":"Y? que no la veas no significa que no este op, taliya no es popular y esta op :p","replies":[{"poster":"Giankkles","date":"2016-07-13T22:57:37.351+0000","up_votes":1,"down_votes":1,"body":"pero si no lo usa nadie, porque un nerfeo innecesario?","replies":[{"poster":"Rolando Magic","date":"2016-07-13T22:59:18.562+0000","up_votes":1,"down_votes":2,"body":"Porque es mas fuerte que otros jg, op, no importa que no la use nadie o que no tenga un ban/pick rate alto","replies":[]}]}]}]}]},{"poster":"Tazztania","date":"2016-07-13T22:44:36.146+0000","up_votes":1,"down_votes":0,"body":"yo tampoco entiendo. Cuando salió me gustaba usarla mucho en top! era genial!! pero ahora si comparas incluso solo con otros campeones de jungla es algo inútil Xd","replies":[{"poster":"Giankkles","date":"2016-07-13T22:49:02.816+0000","up_votes":1,"down_votes":0,"body":"en top ya no se puede usar","replies":[]}]}]}