{"poster":"Giankkles","date":"2016-08-03T16:47:25.041+0000","title":"Me tiro error al comprar rp?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola wachines, quise comprar rp con mi tarjeta y me tiro un error y me dice &quot;error en el pago intente mas tarde&quot; no quiero hacer el pago denuevo porque capaz estos me estafan y me hacen pagar el doble (obviamente dandome los rp correspondientes) alguna solucion?","replies":[{"poster":"Vaendrys","date":"2016-08-03T16:51:28.053+0000","up_votes":1,"down_votes":0,"body":"¿Porque piden ayuda a la comunidad en estos casos? Es mejor ir a alguien especializado como puede ser en soporte :/","replies":[{"poster":"Giankkles","date":"2016-08-03T16:53:37.702+0000","up_votes":1,"down_votes":0,"body":"porque el soporte nefasto de este game tarda entre 4 o 5 dias en contestarte","replies":[{"poster":"Vaendrys","date":"2016-08-03T16:58:56.141+0000","up_votes":1,"down_votes":0,"body":"Tarda entre 1 y 2 días,como mucho se extiende a 3(En mis casos fue así),y allí te van a dar mejor ayuda que aquí posiblemente.","replies":[]}]}]},{"poster":"vFrance","date":"2016-08-03T16:54:08.950+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo amigo ir a la seccion del foro \"Ayuda y Soporte\". Seguramente te borraran este post por que no pertenece a esta seccion. \nEs mejor conseguir ayuda profesional.\nSUERTE!.","replies":[{"poster":"Giankkles","date":"2016-08-03T16:57:40.817+0000","up_votes":1,"down_votes":0,"body":"gracias, pero esta gente tarda muchisimo en contestar y hasta que contestaron se me fueron todas las promociones","replies":[]}]},{"poster":"Tomyrex143","date":"2016-08-03T16:50:12.496+0000","up_votes":1,"down_votes":0,"body":"¿Tarjeta internacional o Nacional? Si te salta ese error, significa que NO SE TE COBRO EL DINERO. Experiencia propia. intentá de nuevo o más tarde. O por defecto, con otra. Saludos!","replies":[{"poster":"Giankkles","date":"2016-08-03T16:54:24.963+0000","up_votes":1,"down_votes":0,"body":"internacional, con mas detalles, visa bbva frances, ahora me tiro un error que dice \"el pago fue declinado por tu tarjeta\"","replies":[{"poster":"Tomyrex143","date":"2016-08-03T16:56:59.249+0000","up_votes":1,"down_votes":0,"body":"Ajá, Visa BBVA.. Si te dice que el pago fué declinado, significa que el tope de tu tarjeta está lleno, tenés demasiadas deudas con el banco, o un error del banco. Me pasó cuando mi tarjeta estaba llena e intenté cargar RP. Intentá con otra tarjeta, o espera a que se desocupe un toque.","replies":[]}]}]}]}