{"poster":"LegendaryKong","date":"2018-09-11T20:26:36.970+0000","title":"ARE YOU SICK OF BEING SILVER? | STEP BY STEP GUIDE ON HOW TO GET OUTTA SILVER","subforum":"Player Creations","embed":{"description":"With this, i even carried hardcore my Team!!","url":"https://www.youtube.com/watch?v=Xjkgpy5Yta4","image":"https://i.ytimg.com/vi/Xjkgpy5Yta4/hqdefault.jpg"},"up_votes":1,"down_votes":0,"body":"With this, i even carried hardcore my Team","replies":[{"poster":"Nightjar","date":"2018-09-12T01:30:09.385+0000","up_votes":1,"down_votes":0,"body":"you should be teaching the standard jungle rotation, cheese isn't reliable.\nAlso it's very important to learn how to clear/kite jungle camps without watching the camp, since whilst you are autofarming the camps, you should always be flicking between minimap and your lanes to look at which lanes minions are going to push in. A very important tip is to learn how to count minions and how they will push the wave.\n\nYou should be pointing out that it's important as a jungler to always be doing something, if you want to gank a lane, you should time it so that it fits with your rotation and you can move from a camp into the gank, for instance if both midlaners have a strong lvl6 all in, then you may want to consider clearing the raptors in your first rotation among your first 3-4 camps, so that you can return to them on the second rotation around the time when the mids would be hitting 6 for a countergank.\n\n It's often not worth waiting in a bush for something to happen, if the enemy top is breaking rotation to camp top, invade their jungle and take all the camps, ward it up, and coordinate with your botlane for them to hard push the last wave when the enemy jungle camps are respawning for a 3man invade and denial of the camp respawn. If you pull this off right, you can deny 5-6 camps which is more than kill gold and a massive amount of xp. Also drop a ward before or after every gank, preferably a control ward if you have the spare gold and are considering breaking rotation to pressure that laners out and take tower. \n\nAlso make sure that if you fail a gank, or you're only ganking for summoner spells, to not leech xp, but if you do kill the enemy laner, if your laner is low on hp but you're moderately healthy, to help them push out the wave by softening up the minions and letting them last hit. That early gold, xp lead, and reset of the lane state, can make recovering the lane hard even for smurfs, without the enemy jungler breaking rotation to camp top, and if the enemy jungler sacrifices himself to do that, you take his botlane camps, put him behind, and use wards to keep the enemy jungler on the topside of the map whilst you hammer bot and mid.\n\nGood Macro is enough to get to gold. Pressing leads, denying enemy jungler, being at lanes at the right moments, will carry most any team. You don't need cheese, and there were alot of basics of jungling that you should have been pointing out whilst you were doing them about rotations and watching the map.","replies":[]}]}