{"poster":"Malignis","date":"2017-02-12T03:21:21.893+0000","title":"Losing Sound in the Client after every Game.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello there.  So since the last two patches I have had an issue where after I play a game and am back to the client my sound is completely gone despite being on in the settings.  The only fix I seem to have currently is to close the client and open it again but this is pretty tedious when I'm playing with friends and we just want to play back to back.  I know the sound isn't imperative but it does help to let me know when it's my turn to ban and things while I'm fiddling around changing my masteries.  \r\n\r\nHas anyone had a similar issue that knows of a potential fix?  I appreciate any advice or help that can be offered :)","replies":[{"poster":"Erikard","date":"2017-04-23T20:08:19.243+0000","up_votes":1,"down_votes":0,"body":"same","replies":[]},{"poster":"Targons Blade","date":"2017-02-13T05:52:59.999+0000","up_votes":1,"down_votes":0,"body":"Do you have any programs running in the background that attempt to interact with your sound settings or League's sound? I recommend [**performing a clean boot**](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting#wq3) to ensure a background application isn't causing issues here.\n\nLet me know if that helped or caused any change at all.","replies":[{"poster":"Malignis","date":"2017-02-14T00:21:51.198+0000","up_votes":1,"down_votes":0,"body":"Hey thanks for the reply.  So I ended up reinstalling my latest sound driver and uninstalling and reinstalling league after restarting my pc and closing any side programs.  Happy news, my sound no longer seems to glitch out.  So far it has stayed in tact throughout the day!  \n\nSadly, I now have a new problem.  I am unable to update to the new client and am only able to use the old one.  Every time I try to hit launch after selecting to update to the newer client it tells me something is wrong and I need to reinstall the alpha client.  I tried uninstalling and reinstalling several times, repairing game files and such but I was never able to get past that point.\n\nNot a huge downfall, I'd much rather have the old client with sound than the new one without, but I do miss my animated Elementalist Lux in the champ select :P  Thank you again for the help and if you have any insight into this new conundrum I have found I would greatly appreciate it.","replies":[{"poster":"Targons Blade","date":"2017-02-14T23:56:46.821+0000","up_votes":1,"down_votes":0,"body":"Ah, I'm very familiar with the error you're seeing. You should be able to resolve this after hopping into your League install folder (C:\\Riot Games\\League of Legends) and deleting the **LeagueClient.exe** file, then launching League from the **lol.launcher.admin.exe** file as admin (right-click, *run as admin). Try the upgrade again from here, and you should be good to go!","replies":[{"poster":"Malignis","date":"2017-02-15T17:38:27.323+0000","up_votes":1,"down_votes":0,"body":"Hey there, just wanted to pop in and give an update, your fix for the client worked and I am now updated again :) yay.  Also my previous sound issue still seems to be gone so that has made me very happy.  Thank you again for taking the time to help me sort out these issues, I truly appreciate the time you took to do so.","replies":[{"poster":"Targons Blade","date":"2017-02-15T22:37:14.400+0000","up_votes":1,"down_votes":0,"body":"No worries! I'm here to help out however I can. :)\n\nI'm glad to hear everything's working for you again. Maybe I'll see you on the rift sometime. ^.^\n\nhttps://media.tenor.co/images/e81c3a0b0769c6caa2a1dc1a439f8bc3/tenor.gif","replies":[]}]}]}]},{"poster":"Wandering Ape","date":"2017-02-13T16:21:01.409+0000","up_votes":1,"down_votes":0,"body":"Hey, i have exactly the same problem after every first game of the day my sound is gone untill i restart the client :/ help is appreciated, i will try the clean boot now","replies":[]}]}]}