{"poster":"Mr Sa1nt","date":"2019-11-18T10:01:29.983+0000","title":"Tyler1 Is NOT Reformed","subforum":"Player Behavior","up_votes":7,"down_votes":30,"body":"Change my mind.\n\nI am currently watching Tyler1 on live stream flame his team as he grinds out his last day of the season. He's blaming his Gragas jungle, for picking Gragas...because he has a 29% w/r on the champion. He keeps asking why he played Gragas, but Gragas has at points been one of the most consistent junglers in the game...his kit is that safe. Tyler1 legitimately flashed in place, around 10-12 minutes into this game, said to open mid, all the negative things in chat.\n\nWhy is Tyler allowed to play? Why is Riot protecting him? He is clearly still toxic, and he's so famous that most people tune into his stream already. I don't care at all if he is a personality, or fun to watch. I don't even personally think he's that toxic, but I've been banned for less and so have many other players.  I don't even care if he types less in the chat box than what he used to. He has over 22,000 current viewers at 2AM Riot's time(5AM my time) and is setting the bar for all of his followers. Tyler1 should NOT be allowed to play this game, based on Riot's To and rulings/judgement. He is toxic, he isn't reformed, he should be subject to the same rules as anyone else. Change my mind.\n\nEDIT: He literally just said out loud \"I'm wasting my time playing with r%%%%%s like this\", that is easily worse than anything I've ever said. How is this acceptable? I was perma banned from defending an ally from being flamed...he's allowed to play, and he streams toxicity to a live audience of 25k.\n\nEDIT EDIT: Another argument to be made. Why is it any better for him to flame his team live to 40,000 viewers, than it is for him to flame the in game chat? There's only 9 people in his game, there's 40,000 people watching.\n\nThis thread has gotten 2k views in less than a day, and only 23 down votes. Not a single person has argued against Tyler being toxic, because we all know he is. The fact that so many people are looking here, just goes to show why he is famous in the first place. Things that people tend to view as \"negative\", gain a lot of attention.","replies":[{"poster":"World peace plz","date":"2019-11-18T10:14:28.508+0000","up_votes":10,"down_votes":2,"body":"Its not against the rules to say things out loud. Its against the rules to type them and your not the judge of what somebody said is way worse than what i said. Everybody gets punisht for they own behavior not cause of somebody els meaning if you break the rules by saying things that arent allowd you get punisht for breaking the rules its that simple and again your allowd to say it out loud   you ARENT allowd to type them.","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T10:21:57.973+0000","up_votes":2,"down_votes":11,"body":"Actually, he does break ToS. Part 5, Code of Conduct: xiv. Inducing or encouraging others to violate this Code of Conduct or the terms of this Agreement\n\nDefinition of inducing  is as follows: \n1. succeed in persuading or influencing (someone) to do something.\n2. bring about or give rise to.\n\nHe never tells his audience to flame, but he definitely does influence it. He normalizes it for them. Do you think his typical viewers don't go into games with a similar toxic attitude?","replies":[{"poster":"TrulyBland","date":"2019-11-18T10:35:08.819+0000","up_votes":5,"down_votes":0,"body":"Within context the \"influencing\" in the definition is very different from the way you are using it talking about Tyler.\nTyler isn't actively using his influence to make people do toxic things. He simply is an influential streamer, and easily impressionable people might pick up on his behaviour and then take it to far by bringing that behaviour into the ingame chat.\n\nBut ultimately, that's not his responsibility anymore. If he **himself** was doing things that are against the rules I'd agree that he is implicitly encouraging others to do the same. But as long as he is just saying those things out loud there is just no way one can consider that to be him inducing other peoples' toxic behaviour **ingame**.\n\nEdit: Frankly, I'd prefer if all the flamers out there **actually** imitated Tyler, and vented by shouting at their screen instead of typing it in chat. It would make the game much more enjoyable.","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T10:38:18.870+0000","up_votes":1,"down_votes":7,"body":"Influence as defined: the capacity to have an effect on the character, development, or behavior of someone or something, or the effect itself.\n\nDo you think that Tyler1 being toxic in front of 25k is not influencing at all? Have you heard of riot mentality? People will riot just because there are riots happening. It is his responsibility, just like any cult leader would be held responsible for their followers. Read Tyler1's chat and tell me that isn't the case, his live chat feed is even toxic.","replies":[{"poster":"TrulyBland","date":"2019-11-18T10:43:30.268+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=0002000000010000,timestamp=2019-11-18T10:38:18.870+0000)\n>\n> Influence as defined: the capacity to have an effect on the character, development, or behavior of someone or something, or the effect itself.\n\nSo you didn't even bother to look up the definition of the **verb**?\n\nLook, I'm not going to play your semantic games: You cannot hold people responsible for being poorly imitated.\nAnd that comparison to a cult leader is simply ridiculous.","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T10:44:53.011+0000","up_votes":1,"down_votes":6,"body":"Verb: Having an influence on, so you're saying he doesn't have an influence on his chat or the League community?","replies":[{"poster":"TrulyBland","date":"2019-11-18T10:54:20.597+0000","up_votes":4,"down_votes":1,"body":"Fine, since you are so insistent on the semantic part of your argument, let's dive a bit deeper than the first definition that pops up on google:\n\ninfluence verb\n\n1: to affect or alter by indirect or intangible means \nShe attempted to influence his decision.\n\n2: to have an effect on the condition or development of \nProductivity was influenced by worker satisfaction.\n\nsource: https://www.merriam-webster.com/dictionary/influence\n\nRiot's ToS is clearly considering the first definition.\n\nThe way Tyler is influencing people follows the second definition.\n\nIf you want to argue that the ToS also uses the second definition, be advised that your semantic arguments are starting to irritate me. That will likely have an **influence** on my behaviour in the next game of LoL that I play. You wouldn't want to be banned for that, would you now?\n\nAny legal document is likely going to use the first definition precisely because everything is influencing everything by the extremely vague second definition.","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T10:58:19.895+0000","up_votes":1,"down_votes":5,"body":"I don't understand your argument at all, as you literally define that he is influencing his audience. Again, have you heard of riot mentality? Go to areas that have rioting, and see how many people participate solely because it is already happening. Tyler is in violation of ToS, as it doesn't just apply to the chat box, or just apply to \"commanding his audience\", it apples to him literally using offensive words while he is streaming League.","replies":[{"poster":"TrulyBland","date":"2019-11-18T11:00:15.658+0000","up_votes":6,"down_votes":0,"body":">I don't understand your argument at all\n\nThat's weird, because I'm merely mimicking yours.\n\nYou are influencing me. Your actions are having an effect on me. \nAre you responsible for my actions now?\n\nAnd seriously, just stop with the pointless hyperbole. It's not a cult and it's not a riot.\n\n> Tyler is in violation of ToS,\n\nHow? How is it in violation of the ToS?","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T11:01:55.931+0000","up_votes":1,"down_votes":6,"body":"Am I responsible for you responding to this thread? Yes, I made the thread.\n\nYour logic is that he is somehow not currently influencing 25k viewers live, with his toxic feed? Monkey see, monkey do. His chat is just as toxic as he is, and if you read it you'll see how much impact he has on them.","replies":[{"poster":"TrulyBland","date":"2019-11-18T11:05:24.005+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=0002000000010000000000000000000000000000,timestamp=2019-11-18T11:01:55.931+0000)\n>\n> Am I responsible for you responding to this thread?\n\nNo. I'm asking about the next LoL game I'm going to play. I'm going to be way more easy to irritate due to this discussion.\nHell, maybe I'll call somebody an idiot because of it.\n\nWould you agree that you deserve to be banned for my actions in that case?\n\n>Your logic is that he is somehow not currently influencing 25k viewers live, with his toxic feed? \n\nWill you stop strawmanning me and start actually responding to my arguments?","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T11:08:02.290+0000","up_votes":1,"down_votes":4,"body":"At what point did I use any of those kinds of toxic words with you, how am I advocating that? He literally called his teammate a r*tard, I don't support this, Riot doesn't either.\n\nI would like to see Riot give equal and fair punishments, nothing more.\n\nI have responded to all your arguments, at least the points worth noting. Nothing you've said has changed my mind, why should I suddenly agree with you?","replies":[{"poster":"TrulyBland","date":"2019-11-18T11:12:02.979+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=000200000001000000000000000000000000000000000000,timestamp=2019-11-18T11:08:02.290+0000)\n>\n> At what point did I use any of those kinds of toxic words with you, how am I advocating that?\n\nOh, so we switched from \"influencing\" over to \"advocating\"?\nFine. Where is Tyler **advocating** breaking the rules, then?","replies":[{"poster":"TrulyBland","date":"2019-11-18T12:39:53.161+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=00020000000100000000000000000000000000000000000000000011,timestamp=2019-11-18T12:27:25.694+0000)\n>\n> You kind of have to be using League or Riot's services in order to transmit them, to stream them.\n\nAnd?\nAgain, the Code of Conduct doesn't govern \"the stuff you do while using Riot Services\", it governs **\"the use of Riot Services\"**.\nHis stream is not a Riot Services, therefore the way he uses that stream to broadcast things is not governed by the Code of Conduct.\n\nIt's governed by other sections of the ToS, of course, but **not the Code of Conduct.**\n \n> Also you seem to be under the misconception that the Code of Conduct isn't part of the ToS, it is. \n\nYes. I know. That's why I keep citing the ToS.\nAnd do you know what the ToS says?\nThat the Code of Conduct only governs the use of Riot Services.\n\n> It's part 5, to be exact. \n\nYes. And have you bothered to read that?\nEntirely?\n\nYou must also comply with certain additional rules that govern your use of the Riot Services (the “Code of Conduct”). \n\n> He's breaking part 5.5 of the ToS, by being flammatory in direct use with their platform.\n\nNow here's an interesting choice of words:\nDirect use. Care to elaborate how he is being flammatory \"in direct use with their platform\"?\n\n> Again, it was nice talking to you. If you're not going to quote relevant information\n\nYou mean like in [this](https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/UqWg88Kv-tyler1-is-not-reformed?comment=00020000000100000000000000000000000000000000000000000003) post?\n>\"You must also comply with certain additional rules that govern your use of the Riot Services (the “Code of Conduct”). \"\n\nOr, [this](https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/UqWg88Kv-tyler1-is-not-reformed?comment=00020000000100000000000000000000000000000000000000000007) one?\n>\"You must also comply with certain additional rules that govern your use of the Riot Services (the “Code of Conduct”). \"\n\nOr maybe [this](https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/UqWg88Kv-tyler1-is-not-reformed?comment=0002000000010000000000000000000000000000000000000000000d) one? I was even a bit more specific, since you kept ignoring the previous quotes.\n>The second sentence in the Code of Conduct section of the Tos:\n>\n>\"You must also comply with certain additional rules that govern your use of the Riot Services (the “Code of Conduct”). \"\n\nI am quoting relevant information. You just choose to ignore it. You managed to ignore it **so** hard, that you now are claiming I don't know that the CoC is part of the ToS, despite the fact that I repeatedly cited the exact line that introduces the CoC **from** the ToS.\n\n>You're speculating and nothing more.\n\nOh really now? Where am I \"speculating\", exactly? Care to give an example?","replies":[]},{"poster":"KFCeytron","date":"2019-11-18T12:26:59.258+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=00020000000100000000000000000000000000000000000000000002,timestamp=2019-11-18T11:19:44.784+0000)\n>\n> Go into League chat and start calling people that word, see how fast you get banned. Just because he says it on cam, doesn't make it any better.\n> \n> Also Riot doesn't specify \"game chat\" in their ToS.\n> \n> v. Transmitting or communicating any content which, in the sole and exclusive discretion of Riot Games, is deemed offensive, including language that is unlawful, harmful, threatening, abusive, harassing, defamatory, vulgar, obscene, sexually explicit, or racially, ethically, or otherwise objectionable;\n> \n> I already defined advocating, and you neglected to mention anything about that! Good try reflecting, though.\n\nYes, it does make it better. Riot's rules only apply to their platforms and services. If you play a game of Monopoly with your little brother and intentionally don't buy Boardwalk when you land on it, Riot won't ban you for inting and wintrading. Similarly, if a streamer complains about their team verbally on camera but doesn't put any of it into in-game chat where teammates (and/or opponents) can see, then he's abiding by the rules. If someone is iNfLuEnCeD by this to shout obscenities at their monitor while they play just like T1 does, they're not breaking LoL's rules either.","replies":[]},{"poster":"TrulyBland","date":"2019-11-18T11:25:39.813+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=00020000000100000000000000000000000000000000000000000002,timestamp=2019-11-18T11:19:44.784+0000)\n>\n> Go into League chat and start calling people that word\n\nI've said it before, I'll say it again:\nStop distracting and changing the question.\n\nWhere does he advocate breaking the rules?\n\n>Also Riot doesn't specify \"game chat\" in their ToS.\n\nBecause they don't have to? The entire segment applies to things you do with their services.\n\nEdit: Nevermind, they **do** specify where the rules apply:\n\"You must also comply with certain additional rules that govern your use of the Riot Services (the “Code of Conduct”). \"","replies":[]},{"poster":"TrulyBland","date":"2019-11-18T12:24:04.820+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=0002000000010000000000000000000000000000000000000000000e,timestamp=2019-11-18T12:18:32.440+0000)\n>\n> He is using league To say those things, how else could he call his own teammate a r%%%%%?\n\nThis whole conversation started with a discussion of whether saying things **out loud** is against Riot's rules. This is the basis of the entire conversation we had.\n\n> Streaming, by itself, is not in violation of the rules. The content of the stream however, is. Again, \"transmitting or communicating content\".\n\nGreat. And?\nThe stream is not a Riot Service.\nSo the section you keep citing regarding transmitting or communicating **already** doesn't apply to the stream.\n\nIf I have a set of rules that only apply to apples, then even **if** I had a subrule that said \"oranges should be washed before being eaten\" then that subrule would **still** not apply to oranges.\nWhy? Because that rule, even if it explicitly applies to oranges, is part of a **set** of rules which explicitly **doesn't** apply to oranges.\n\nSo even if you are right in your interpretation, that this transmitting or communicating section **would** apply to the things he says on stream... it still wouldn't matter because it is part of a **set** of rules (the Code of Conduct) which explicitly **doesn't** apply to a 3rd party stream.","replies":[]},{"poster":"TrulyBland","date":"2019-11-18T12:12:31.324+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=0002000000010000000000000000000000000000000000000000000c,timestamp=2019-11-18T12:08:35.447+0000)\n>\n> How is League of Legends not part of Riot's service?\n\nIs he using League of Legends **to** say those things?\nNo? Then that's irrelevant.\n\n>He is streaming their game, their content.\n\nIs that, by itself, against the rules?\nNo? Then that's irrelevant.\n\n>He is being toxic, via the Twitch platform\n\nIs that one of Riot's Services?\nNo? Then that's irrelevant.\n\n>but he is directly using League to get views.\n\nAgain: Is that by itself against the rules?\nNo? Then that's irrelevant.\n\n>He is own using his toxicity to generate an audience.\n\nIs his toxicity expressed **via** Riot's Services?\nNo? Then that's irrelevant.\n\n>Why am I answering any of your questions, wasting my own time, when you're not even backing up any of your argument with any factual proof? This is a prove ME wrong thread, not a prove YOU wrong thread. Try listing any definition, ToS, or anything relevant to back up your point, or I'll continue seeing it as moot.\n\nI have. Repeatedly.\n\nThe second sentence in the Code of Conduct section of the Tos:\n\n\"You must also comply with certain additional rules that govern your use of the Riot Services (the “Code of Conduct”).\"\n\nThe Code of Conduct only governs the use of the Riot Services.\nIt doesn't govern twitch.\nIt doesn't govern your own vocal chords.\nIt doesn't govern your living room.\nIt doesn't govern jack shit apart from the use of Riot Services.\n\n[Edit: Just to clarify:\n\"The use of\", not using.\nNot the stuff you do *while* using.\nThe use of. Explicitly, and exclusively, **the use of**, i.e. **the way you use** Riot Services.]\n\n\nIf you break the Code of Conduct **outside** of any of Riot's services, it is of no consequence as far as the ToS is concerned.","replies":[]},{"poster":"TrulyBland","date":"2019-11-18T12:04:46.369+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=0002000000010000000000000000000000000000000000000000000a,timestamp=2019-11-18T12:01:12.053+0000)\n>\n> It does apply to the stream, because part 5 word for word says \"transmitting or communicating\". \n\nPart 5 of what again?\nIs it the Code of Conduct?\nThe Code of Conduct that doesn't apply to his stream because it's not one of Riot's Services?\nI'm pretty sure it is.\n\n>How is streaming not a transmission or communication of Riot's game? \n\nAgain: It's not about transmitting or communicating Riot's game. It's about **USING** Riot's Services **TO** transmit or communicate.\n\nThe entire Code of Conduct only applies to the **WAY YOU USE** Riot's Services. His stream is \"using\" Riot's services by transmitting and communicating them, via somebody else's service.\nThat doesn't make the stream one of Riot's services. So whatever **ELSE** he does on the stream is of absolutely no relevance.","replies":[]},{"poster":"TrulyBland","date":"2019-11-18T11:56:46.610+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=00020000000100000000000000000000000000000000000000000008,timestamp=2019-11-18T11:52:07.069+0000)\n>\n> I've answered your question, you just refuse to read it as it is. He's using toxicity in his stream, his viewers will find it as a norm. You don't have to tell people to be toxic, to advocate toxicity. I'm not going to answer this again.\n\nYou never answered it in the first place, because you **again** changed the question. This time to the more vague term \"toxicity\".\n\n>It does break the rules, again section 5 of the Code of Conduct\n\nWhich doesn't apply to the stream, because it very explicitly only applies to the use of Riot's Services. His stream is not one of Riot's Services.\n\n>He only has to transmit the game (stream it) in order for it to break ToS. \n\nYes, the ToS.\nThe ToS.\n\nLet me say it again, the ToS.\n\n**But not the Code of Conduct**, which explicitly applies only to the use of Riot's Services.\n\nAnd the only rule you ever keep citing stems from the **Code of Conduct**, which - I hate to repeat myself -  **explicitly applies only to the use of Riot's Services**.\n\nThe **USE** of their services. It's not about transmission **of** their services, it's about transmissions **USING** their services. Forum, Chat, Voicechat, IMs via the LoL-Client. That stuff.\nHim saying things out loud, is not him **USING** their services, therefore the Code of Conduct **does not apply.**\n\nIt's really not that difficult.","replies":[]},{"poster":"TrulyBland","date":"2019-11-18T11:47:25.221+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=00020000000100000000000000000000000000000000000000000006,timestamp=2019-11-18T11:39:16.441+0000)\n>\n> He is influencing others to be toxic\n\nAaaaaand we're back to \"influencing\". Read all of my previous replies for that one.\n\n>He's supporting of it.\n\nAnd I'm asking you where and how.\n\n>He uses the words himself, that is supporting! \n\nAnd that doesn't break the rules.\nWhere is he supporting breaking the rules?\n\n>His stream is Riot's content, it 100% has to do with what is listed in the ToS.\n\nThe ToS? Sure.\nThe Code of Conduct, which you keep citing? No.\nRiot says so, very explicitly.\nEdit: In fact, the **ToS** says so very explicitly. \n\n\"You must also comply with certain additional rules that govern your use of the Riot Services (the “Code of Conduct”). \"\n\n>You keep asking me to answer the same question\n\nBecause you keep answering an entirely different question.\nThe question you keep answering is how he is supporting the use of words like \"r%%%%%\". But using the word \"r%%%%%\" and its likes is not against the rules by itself, as long as it is kept out of Riot's Services. Because, just to reiterate: **Only Riot's Services are governed by the Code of Conduct.**","replies":[]},{"poster":"TrulyBland","date":"2019-11-18T11:33:22.096+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=00020000000100000000000000000000000000000000000000000004,timestamp=2019-11-18T11:28:53.451+0000)\n>\n> Advocate: publicly recommend or support.\n> \n> He is publicly streaming, and publicly using said words, how is that not supporting the use of the words?\n\nThe use of words is not against the rules.\nCan you try, just try, to answer the question that I am asking?\n\nWhere is he advocating **breaking the rules**?\nThe rules.\nYou know, Riot's rules.\n\nNot saying certain words, not doing any other shit.\n\nI want to know where he is advocating breaking the rules.\n\n>He is transmitting their content, communicating their content, through a stream.\n\nFine. And? The code of conduct (which you cited) \"governs [his] use of the Riot Services\"\nHis stream is not a Riot Service, therefore not governed by the code of conduct.","replies":[]},{"poster":"TrulyBland","date":"2019-11-18T11:17:27.225+0000","up_votes":2,"down_votes":0,"body":"Stop distracting and changing the question:\n\nUsing the word \"r%%%%%\" isn't against Riot's rules. Using **any** word isn't against Riot's rules.\nRiot's rules apply to words you use **in chat**.\n\nHence why I didn't ask \"What words is Tyler advocating?\", I asked:\n\n>Where is Tyler advocating **breaking the rules**?\n\nEdit:\n>I like how you picked a single word out of my text to try and twist an argument.\n\nBecause your entire argument hinges on single words. Your entire argument is built around the word \"inducing\" in the ToS.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"ChaosReyn","date":"2019-11-18T21:58:33.641+0000","up_votes":3,"down_votes":1,"body":"In that case, let's pose this question:\n\nIf posting this on the board has the *exact* affect you desire from this: T1 gets re-permabanned, and Riot starts banning more and more people who play like he does...then that begs the question of whether it all started from a genuine violation of ToU, or the riot mentality of a bunch of people agreeing with you here. In which case, would you not have then influenced people to attack other players based upon their behaviors, and then by default also violate the ToU?\n\nAm I getting this right?\n\nInfluence in the context of Riot's ToU is defined as \"*deliberately* attempting to persuade or convince a person to do something, or otherwise attempting to express that it's acceptable for someone to do something.\"\n\nWhich, though not the actual definition you looked up on dictionary.com, is not that same thing as saying \"I'm a dick, and everyone should be fine with it.\"\n\nBasically...Tyler's a dick. But he's not deliberately encouraging others to be a dick, even if some of the more impressionable idiots end up becoming dicks after watching him be a dick. However, moving back to this case, you are directly attacking another player, in a way that is meant to directly influence other people on this board to consider attacking him as well. By posting this on the boards, you are directly asking for input on why he gets to play if you're going to be banned, and let's be fair...that thinking is what got you banned.","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T22:08:09.509+0000","up_votes":1,"down_votes":2,"body":"My desired effect is that Riot upholds their ToS, to the letter, fairly and equally. Not picking and choosing who they should moderate. I don't see how that is an attack on anyone, this is a discussion.\n\nFlaming your allies and doing things that could potentially lose you team fights or games, intentionally, that sounds like breaking the rules to me.\n\nTell me how influence, in their context, means \"deliberately\"? Influence does not mean deliberately, and he is influencing a mass amount of players at the same time.","replies":[{"poster":"ChaosReyn","date":"2019-11-18T22:21:47.344+0000","up_votes":2,"down_votes":0,"body":"I mean, playing dumb to the context already shows you really dont want this discussion, but I'll take your bait here.\n\nWhether or not you're deliberate about it or not, you're influencing me to be a tilted rules lawyer. That's not necessarily against any rules, is it?\n\nThe same applies to him, by your example: whether he's deliberately telling people on stream to interact with the game like he does or not, he's making people out to be toxic. That's your play, right?\n\nCan you definitively prove the pattern of toxic behavior is the direct result the connection of Tyler1's influence over any of the people that watch his stream? And can you do that, essentially, within a court of law?\n\nAny more than I can prove that it's because of you that I feel like I have to go out of my way to make all these long-winded, annoying examples?\n\nThe answer is no - because there is no act that can deliberately show Tyler1 is attempting to influence people to be toxic in game. That's what I mean when I say the definition isn't quite the same when it comes to contracts and Terms of Service clauses.\n\nYou can say \"yeah, look, Tyler1 calls people \"r%%%%%\" then [guy x] did the same thing 2 hours after Tyler1's stream ended\" and that judge is gonna say \"ok...but did he say it *because* Tyler1 said it, or did he say it because he, like Tyler1, is also just that kind of person?\"","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T22:30:16.449+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ChaosReyn,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=0002000000010000000100000000,timestamp=2019-11-18T22:21:47.344+0000)\n>\n\n> Whether or not you're deliberate about it or not, you're influencing me to be a tilted rules lawyer. That's not necessarily against any rules, is it?\n\nInfluence by definition, isn't me telling you to do anything in particular. I've influenced you simply by just making this thread. The only difference is, Tyler is breaking rules, this thread is an attempt to uphold rules.\n\n> The same applies to him, by your example: whether he's deliberately telling people on stream to interact with the game like he does or not, he's making people out to be toxic. That's your play, right?\n\nThat is my play, correct.\n\n> Can you definitively prove the pattern of toxic behavior is the direct result the connection of Tyler1's influence over any of the people that watch his stream? And can you do that, essentially, within a court of law?\n\nI can definitely prove that monkey see, monkey do, is a real life occurrence. I can also prove that Tyler1 is toxic, and is streaming Riot's content. The way you phrase this, makes it sound like I'm trying to say ALL toxicity comes from Tyler, and that's definitely not true. To say he influenced a large portion of the toxicity, well that's another story.\n\n\n> The answer is no - because there is no act that can deliberately show Tyler1 is attempting to influence people to be toxic in game. That's what I mean when I say the definition isn't quite the same when it comes to contracts and Terms of Service clauses.\n> \n> You can say \"yeah, look, Tyler1 calls people \"r%%%%%\" then [guy x] did the same thing 2 hours after Tyler1's stream ended\" and that judge is gonna say \"ok...but did he say it *because* Tyler1 said it, or did he say it because he, like Tyler1, is also just that kind of person?\"\n\nYou can't sit there and say that celebrities aren't influencing their fans, that's not logical. Just showing that you're doing something, in front of your own community, makes it a norm.","replies":[{"poster":"ChaosReyn","date":"2019-11-18T23:53:53.776+0000","up_votes":2,"down_votes":0,"body":"What I'm saying is not necessarily that he's not influencing them, you're correct. What I'm saying is \"in a court of law, this would still be viewed more as coincidence than actual fault.\" and since these are, in essence, legal contracts that you must agree to, that are meant to be used for litigation in legal disputes, it's not enough to point out something that simple.\"\n\nIn short...you need stronger evidence. A few words aren't really enough.\n\nIf I called you obnoxious, and then everyone else started doing the same...have I influenced them? *possibly*. But one word wouldn't be enough evidence.\n\nIf I used a whole, descriptive sentence to attack something...let's go with something not so personal this time so as not to make it feel like I'm actually trying to attack you...something like \"Everything riot's doing with season 10 is absolute fucking garbage, and I'm gonna troll every fucking game of it I play!\" and then several people basically jump on that exact bandwagon, and quote my exact sentence verbatim, repeatedly...that would be a little easier for them to get suspicious of. Though that's a bad example...since that's actually still a bit too simply put to show that it's my wording, specifically.\n\n*as a disclaimer...I'm trying to stay open-minded about season 10...so that's not an actual threat. xD*\n\nBasically...what I'm attempting to convey is that you'd need enough evidence to *specifically* link Tyler1 (since plenty of other streamers...-cough, NB3- -cough, Hashinshin-...also tend to be pretty toxic in their own ways as well)**EXACTLY** to what both he said/did, and what the other party said/did as if to copy him, and likely do this in several instances, to establish enough of a pattern and a strong enough influence for it to be usable as evidence in a court of law.\n\nIs it impossible? Not at all. Is it a lot less binding than it looks? Abso-freakin-lutely.","replies":[{"poster":"Mr Sa1nt","date":"2019-11-19T01:35:48.615+0000","up_votes":1,"down_votes":1,"body":"Almost missed this post, sorry!\n\nThis is a fair argument, unlike the majority of the others here. You do consider Tyler and those streamers as toxic though, right? That's my point of this thread.\n\nWhat I'm saying wouldn't hold well in court, that's definitely true. He is breaking the ToS on technicalities, though. He falls directly into the wording of it. You're right that I'd have to link multiple streams and chat logs in order to actually prove my point in court, but anyone who knows of Tyler and his stream could tell you that it's easily heard and visible just from watching his streams for even just a single game. Unfortunately you're right in saying that it doesn't fully mean he's the reason his audience becomes toxic, but he definitely is a reason that a lot of players are toxic.\n\nI do fully believe that he directly influences his audience, though. It's not just the one word, it's the consistent flame that he does. Monkey see monkey do is a real thing, unfortunately. And he's formed a community as well, so it's even easier for people to join in on his mentality, they are going to find a different norm than people who aren't watching his stream. And then those same viewers will play with thousands/millions of other players, to top it off.\n\nAnyways I don't want to necessarily criminalize Tyler. He streams as entertainment. I want Riot to pass fair and equal judgement. They are either supporting toxicity, or they are against it. In Tyler's case, they're for it. In most normal peoples' cases, they are against it. There's no reason his fame should allow him to be the way he is, especially because of the sheer numbers of League players that do find normality in his toxicity.","replies":[{"poster":"ChaosReyn","date":"2019-11-19T02:42:44.001+0000","up_votes":2,"down_votes":0,"body":"Well...let's re-examine this community for a second then.\n\nNightblue3. Shaclone. Nubrac. Meatwadsprite (aka Dunkey). QTPie (who's less toxic than the others, but can still get toxic)\n\nAnd many more.\nThere are more than a few big faces in League that can regularly be viewed as \"toxic\" for the community (in their own ways) as Tyler1. So in general, is Tyler1 toxic? Yeah. Is he an influence on his viewers? From a legal standpoint, I say *possibly* but in all honesty, I think we all know that means \"yes, but there's not enough physical evidence to support it so we can't rightly say so.\"\n\nBut the same can be said of others, who if I may be honest, have even less reason to be here than Tyler1 (post \"reformation\")\n\nNightblue3 and Nubrac should both be perma'd, imo. Nightblue for his part in \"calling his Riot friend\" to ban Nubrac for trolling (thus essentially telling everyone he has Riot in his pocket...something absolutely unprofessional on his level, Riot's level, and just...no. Unacceptable. I'm genuinely surprised none of this came close to a lawsuit.), and Nubrac for intentionally target-trolling streamers on his own stream. If anything...Nubrac falls under the same case as Tyler1 in regards to \"can you prove it?\" (Riot has the pattern in their logs that he almost exclusively practiced his \"new strategy\" in these games, according to their statement, so it can be argued that RIOT can, but we cannot) but what can be absolutely proven in his own videos is his absolute disregard of the way the game is played, and the *actual pushing of players* to \"try new things\", referring to the way he was intentionally throwing games. Now, I like radical, off-meta tactics and I play more than a few myself...but there's still a \"right way\" to off-meta, and Nubrac was no off-meta player...he was trolling, and trying to insist it was \"off-meta\" in the limelight. What he did was not off-meta gaming, it was total destruction of the game, followed by a demand that 4 other people then more or less completely reconstruct it around him. There *is* a difference. Follow all of that up with the fact that he genuinely refused to communicate with his teams, despite expecting them to suddenly drop *EVERYTHING* they were planning to do in their game and play *COMPLETELY* around his uncommunicated tactics, and you have a plan that is quite clearly meant to set 4 people up for failure.\n\nMeatwadsprite was at one point given the permaban due to (if I remember right) telling someone to \"kys\" on his stream after just absolutely laying into the guy. And while it was said somewhere else in this thread that streaming has nothing to do with Riot's physical services, this is one case that a) violated both twitch AND riot's Code of Conduct simultaneously, and b) was also done on both (in game chat, as well as on stream, he laid this kid open). So dunkey ate the perma. I think he still plays from time to time on an alt, but he doesn't play like he used to, and I dont think he cares to.\n\nShaclone...is a special case. Once one of the top Shaco players in the world, this guy...well, let's just say he's got some serious issues. A couple of clips I can find on him show him coming back to find himself permabanned, and (on stream) spewing death threats to \"riot\" and their families, among all the other obscenities. I don't have a lot of information about him, since I really didn't follow shaclone *at all* and didn't really catch his name until he was once compared to Pink Ward. But I know he was permabanned (at least twice) and he was BEYOND LIVID about it.\n\nPoint being...not to downplay your original point, but believe it or not, people *have* in fact found ways to make Tyler1 almost look reformed by comparison. I don't personally enjoy watching Tyler1. If I wanted to watch someone lose their mind and curse out the entirety of the internet all day, I'd stream my sister being ghetto. But those who do, remember they do so by their own choice. *THEY* are the ones who choose to let *THAT FACE* be \"normal\" to them.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"I Like Teemo","date":"2019-11-18T14:11:25.182+0000","up_votes":6,"down_votes":0,"body":"T1 isnt perfect, but his in game attitude has improved. His stream behaviour is a little bit blown out but when you look at moe, tf blade, and hanshishin... they all like to yell at the game, slam their desks, (moe and tf blade on many a time have looked at peoples profiles on like instagam and fb and basically just laughed and pointed fingers at how ugly/unattractive/nerdy people look) so you know as far as T1 goes... cant really punish the guy alone, he isn't the worst offender on the platform.\n\nand if you dont like his content and dont approve of it, just stop watching, report his channel for any of the rules he breaks and if someone at twitch agrees with you they will ban him. As far as riot goes, there is plenty of video evidence, if they wanna ban him again they will but that isn't something a boards post will change.","replies":[]},{"poster":"UltimateShield13","date":"2019-11-18T19:12:09.156+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=,timestamp=2019-11-18T10:01:29.983+0000)\n>\n> Change my mind.\n> \n> EDIT: He literally just said out loud \"I'm wasting my time playing with r%%%%%s like this\", that is easily worse than anything I've ever said. How is this acceptable?\n\nIt's acceptable because he said it out loud to the screen and not typed it in chat. At home, you can scream at someone to kill themselves if you want to, and you won't get banned for it. Do you know why? Because you said it out loud instead of typing it in game. It's not that hard to figure out buddy.","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T19:16:13.078+0000","up_votes":1,"down_votes":4,"body":"You can, and that's fine. However, he is streaming to an audience, he's not just in his room \"alone\".\n\nv. Transmitting or communicating any content which, in the sole and exclusive discretion of Riot Games, is deemed offensive, including language that is unlawful, harmful, threatening, abusive, harassing, defamatory, vulgar, obscene, sexually explicit, or racially, ethically, or otherwise objectionable;\n\nStreaming and playing the game, is transmitting Riot's content. He is being vulgar, obscene, offensive in language, and is apparently objectionable.\n\nEDIT: There isn't any wording in their ToS or CoC that specifies that he must be toxic in game chat. It does say that if he wants to play the game, he can't be transmitting or communicating toxic content.","replies":[{"poster":"UltimateShield13","date":"2019-11-18T19:18:34.905+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=000d0000,timestamp=2019-11-18T19:16:13.078+0000)\n>\n> You can, and that's fine. However, he is streaming to an audience, he's not just in his room \"alone\".\n> \n> v. Transmitting or communicating any content which, in the sole and exclusive discretion of Riot Games, is deemed offensive, including language that is unlawful, harmful, threatening, abusive, harassing, defamatory, vulgar, obscene, sexually explicit, or racially, ethically, or otherwise objectionable;\n> \n> Streaming and playing the game, is transmitting Riot's content. He is being vulgar, obscene, offensive in language, and is apparently objectionable.\n\nLet's just ban the rest of the top 10 league streamers while we're at it because they all do the same thing as T1.","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T19:20:05.274+0000","up_votes":1,"down_votes":4,"body":"Ok then let's do that? Why exactly should they, myself, or anyone else, receive special treatment?","replies":[{"poster":"UltimateShield13","date":"2019-11-18T19:29:41.848+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=000d000000000000,timestamp=2019-11-18T19:20:05.274+0000)\n>\n> Ok then let's do that? Why exactly should they, myself, or anyone else, receive special treatment?\n\nlol why are you so salty bro? What happened to you? Did Tyler1 int your game or something? We need more context! Otherwise this post should be in the rant section.","replies":[]}]}]}]}]},{"poster":"Last Whısper","date":"2019-11-18T10:15:45.377+0000","up_votes":7,"down_votes":3,"body":"You should worry about your life before worrying about others.\nIm pretty sure your mom would not be proud if she sees this\n\n>He literally just said out loud \"I'm wasting my time playing with r%%%%%s like this\"\n\nWasnt on chat\n\n\n>I was perma banned\n\ngotcha, you just salty{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Mr Sa1nt","date":"2019-11-18T10:14:14.138+0000","up_votes":2,"down_votes":6,"body":"He's streaming to 20% of the current LoL viewership. It's not about whether or not I find him toxic, or even that it bothers me. It's that he's breaking ToS and it slides by without issue. I tuned in for once, first time ever watching him live. I've only ever watched him on the YouTube. He is toxic, he teaches toxicity, and it is deemed acceptable.\n\nI'm not in his game, nor do I care if his allies are offended. I'm not offended either. I've been reported for far less than anything he's said in just the last 5 minutes, that's my point. There's no way to logically defend that.","replies":[{"poster":"AeroWaffle","date":"2019-11-18T10:21:32.407+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=0001,timestamp=2019-11-18T10:14:14.138+0000)\n>\n> He's streaming to 20% of the current LoL viewership. It's not about whether or not I find him toxic, or even that it bothers me. It's that he's breaking ToS and it slides by without issue. I tuned in for once, first time ever watching him live. I've only ever watched him on the YouTube. He is toxic, he teaches toxicity, and it is deemed acceptable.\n\nRiot's ToS is for stuff on Riot's domain, not Twitch.\n\n> I'm not in his game, nor do I care if his allies are offended. I'm not offended either. I've been reported for far less than anything he's said in just the last 5 minutes, that's my point. There's no way to logically defend that.\n\nSo you're complaining because you were punished and you believe someone else behaves worse than you and was not punished? Tyler has lost plenty of accounts and even landed himself a punishment tier beyond what you could possibly get. He is not immune to the punishment system.\n\nSounds like you're just extremely salty about your own punishment so you're actively searching for other people to distract from your own behavior.","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T10:23:39.709+0000","up_votes":2,"down_votes":4,"body":"I'm complaining because Riot picks and chooses who to moderate. They have influence over Twitch, and his channel does tend to break ToS even if he's not actively using the in game chat.\n\nBesides this, he is intentionally wasting his summoner spell flash without reason. There is no argument for why THAT is acceptable. Twitch isn't involved with him soft inting his teammates, only Riot is.","replies":[{"poster":"AeroWaffle","date":"2019-11-18T10:25:57.782+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=000100000000,timestamp=2019-11-18T10:23:39.709+0000)\n>\n> I'm complaining because Riot picks and chooses who to moderate. They have influence over Twitch, and his channel does tend to break ToS even if he's not actively using the in game chat.\n\nRiot doesn't tell Twitch who to ban, just as Twitch doesn't tell Riot who to ban. If he's breaking Twitch rules then report him through Twitch. But that's not Riot.\n\n> Besides this, he is intentionally wasting his summoner spell flash without reason. There is no argument for why THAT is acceptable. Twitch isn't involved with him soft inting his teammates, only Riot is.\n\nYou're free to report him should you find yourself in game with him.\n\nJust like everyone else in the game including the people that reported you that led to your punishment.","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T10:29:40.430+0000","up_votes":1,"down_votes":3,"body":"Twitch accounts have been banned by Riot's influence, so I'd have to disagree. League is the most viewed game on Twitch, consistently.\n\nI'm free to report him only if I play with him? What about if I play with the 25,000 people watching him? How long will it take to ban all those people and play with them, how many more games will those players influence because of his personal influence?","replies":[{"poster":"AeroWaffle","date":"2019-11-18T10:36:04.116+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mr Sa1nt,realm=NA,application-id=ZGEFLEUQ,discussion-id=UqWg88Kv,comment-id=00010000000000000000,timestamp=2019-11-18T10:29:40.430+0000)\n>\n> Twitch accounts have been banned by Riot's influence, so I'd have to disagree. League is the most viewed game on Twitch, consistently.\n\nI have not seen a single case of that happening. Anyone I've heard of that's been banned from Twitch were banned for breaking Twitch rules. Not Riot's.\n\n> I'm free to report him only if I play with him? What about if I play with the 25,000 people watching him? How long will it take to ban all those people and play with them, how many more games will those players influence because of his personal influence?\n\nThey're subject to the same rules as you. If they **CHOOSE** to behave poorly in their game, no matter what reason or claim of influence they make they're subject to the same rules.\n\nI doubt a Tyler fan is going to be ignorant of the behavioral rules considering how often Tyler was banned. If anything, he's a good example that no matter how popular you are you can still have several accounts banned for being a jerk.","replies":[]}]}]}]}]}]},{"poster":"LightswornLance","date":"2019-11-18T10:25:15.000+0000","up_votes":1,"down_votes":13,"body":"You are obviously a BoxBox fan boy but I'll bite. If it was just a random Gragas playing bad in soloque, whatever. But he literally locked in a champion he has a 29% winrate in 41 games WHILE DUOING. Not to mention BoxBox is a pretty terrible player and can only win lane if his lane opponent is autofilled and he is getting camped by his jungler. I mean the dude has a 53% winrate on his onetrick and obscenely bad winrates on all his other champions. I'd be mad if I was matched with players with stats like that as a gold player, imagine being a challenger tier player and getting matched with that.","replies":[{"poster":"DuskDaUmbreon","date":"2019-11-18T10:38:21.930+0000","up_votes":4,"down_votes":2,"body":">You are obviously a BoxBox fan boy\n\nDude. OP's wrong, but actually attack him on his *argument*, not just by slapping together ad hominems.","replies":[{"poster":"LightswornLance","date":"2019-11-18T10:49:27.461+0000","up_votes":1,"down_votes":5,"body":"Thats literally not relevant at all because I addressed his argument in the following sentence...","replies":[{"poster":"DuskDaUmbreon","date":"2019-11-18T12:08:59.239+0000","up_votes":2,"down_votes":1,"body":"Then why put it in in the first place? You're starting off attacking OP on an ad hominem, instead of attacking him on his invalid point.\n\nJust drop the ad hominem altogether.","replies":[{"poster":"LightswornLance","date":"2019-11-18T19:19:07.781+0000","up_votes":1,"down_votes":3,"body":"Dude did it really hurt your feelings that much when it wasnt directed at you?","replies":[{"poster":"Mr Sa1nt","date":"2019-11-18T19:25:59.172+0000","up_votes":1,"down_votes":1,"body":"There is a reason why I was pretty much just ignoring your posts. You make them into some sort of personal attack, rather than an actual argument. That's what the other person was pointing out.\n\nTry again with different wording.","replies":[{"poster":"LightswornLance","date":"2019-11-18T20:05:40.003+0000","up_votes":1,"down_votes":1,"body":"I mean you started this thread just because you were bored and wanted to debate about something. I can tell by the way you reply to literally every single post.","replies":[]}]}]}]}]}]}]}]}