{"poster":"Eleftheria","date":"2016-10-13T11:44:26.940+0000","title":"Toxicity, bans and notices","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"Hello,\r\nI want to talk about the toxic players in the oce server. Everyday I play 5 or 6 games. In those five or six games there will always be at least seven people who will start raging for the smallest things. For example, in my last game the enemy&#039;s jg ganked bot three times in five minutes and their adc got fed because of the lack of vision we had (supp preferred to ward the bush opposite to the turret), my need to farm and their cc. I did not blame anyone for that instead I asked for a gank (6 minutes in) and voli got mad because he said he had not recalled all game...I did not say anything to that and their jg camped bot. I ended up with 1/3 and that&#039;s when our top started to rage, calling us noobs and all that and our supp doing the same. Our jg did the same and even our mid joined in after a while...That&#039;s only one example. I have other examples with adcs trolling and saying that they will feed because they know riot will not punish them or ban them. Over the holidays I was reporting ten people every day and now around five or so. The thing is that I never get a notice from riot saying that they looked into it or they have given a warning or something. They used to do that. Yesterday I got an email saying that they banned a player and that was what woke me up. Over two weeks I had reported so many people for toxicity and only one got punished?\r\n \r\nNow do not think i report people for fun. I report someone if they have really annoyed the whole team and called us names. In my opinion even if someone just called you piece of sh** three times that&#039;s a reason to report him but I do not because I think they might have a bad day or something. It happens to everyone. Is riot really taking the report system seriously? The ** used in the chat when players curse each other is enough to be reported? Not only that but only the words. In order to improve the game they should take the report system (if they are not already) more seriously and give a notice to the reporter that they looked into it. Believe me that is enough for someone to appreciate the work people put into reports. \r\n\r\nI really love the game and I think riot is doing an awesome job in improving it. PBE, alpha client and updates really help but the community should improve as well. Even PBE which is supposed to be toxic-free is very, very, very toxic. People who are lucky enough to be in PBE know what I mean. \r\n\r\nI just want to ask...Am I the only one feeling this way? Like the toxicity level in our server has increased?? You don&#039;t have people ruining your game because they are raging?\r\n\r\nThe warnings and bans riot gives are very useful But chat restriction is not enough. In my opinion the first punishment should be three days suspension and 15 games with chat restriction. I have read many posts with people saying that the first punishment did not change their behaviour. That is my opinion though. I am not the best in this department but maybe they could look into it?\r\n\r\nIf you made it to the end then thanks for reading my thoughts. I only want to improve the community and I hope people feel the same way. Sorry if I tired you out.\r\n\r\n{{summoner:4}}","replies":[]}