{"poster":"Luggi Schimmel","date":"2017-11-07T20:58:23.734+0000","title":"Lags immer Abend","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich habe immer so gegen 30 ms vlt auch manchmal 40 ms. Seit ein paar Tagen ist es es so das mittags so gegen 25 ms ist. Ab ca. 19 Uhr steigt er auf ca. 100 ms mit kurzen 300 ms lags. Das ist seit vlt 4 oder 5 Tagen so.","replies":[{"poster":"DrYatty","date":"2017-11-08T06:57:27.728+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nwie die anderen Beschwörer schon vermutet haben könnte es hier an Nutzern, die deine Leitung überlasten, liegen. \n\nKommt Abends jemand von der Arbeit/Schule o.Ä. zurück und loggt sich ins Internet ein?\nÜber was für eine Verbindung spielst du? (Lan, Wlan etc.)","replies":[{"poster":"Luggi Schimmel","date":"2017-11-08T14:20:02.658+0000","up_votes":1,"down_votes":0,"body":"Ich spiel über Wlan. Ich hab ja so 25 ms im Durchschnitt. Was wäre jetzt der Unterschied zu Lan? Und mein Vater kommt abends nach hause, aber im Prinzip ist der Unterschied nur das er sein Handy mitnimmt. Kann sowas auch Störungen verursachen?","replies":[]}]},{"poster":"KageNoOkami","date":"2017-11-07T22:25:18.693+0000","up_votes":1,"down_votes":0,"body":"Jo das ist bei mir auch so. Irgendein Spinner fummelt bei mir am Netz rum oder Ddost mich. Wenn ich den in die Finger kriege dann ... !!!!!","replies":[]},{"poster":"Nico21","date":"2017-11-07T21:02:18.230+0000","up_votes":1,"down_votes":0,"body":"das müsste leider an deinem internet bzw. an deinem Anbieter liegen.\nAbends ist er einfach überlastet da mehr Leute das internet benutzen (Abends Feierabend jeder ist daheim).\n\nKannst dort vil mal nach Auskunft fragen ob sie von der Überlastung bescheid wissen.\nÜberprüf mal per speedtest, ob nachmittags die downloadgeschwindigkeit auch wesentlich höher als abends ist.\nFalls ja, dann ist das netz bei dir abends einfach überlastet.","replies":[]},{"poster":"Kolivanne","date":"2017-11-07T21:01:49.081+0000","up_votes":1,"down_votes":0,"body":"Spielst du über LAN, W-LAN?\n\nKlingt für mich als wenn abends sich wer über die Leitung Dateien runterzieht. Frag mal bei dir daheim, wer um die Zeit wo du zockst was im Internet macht.","replies":[]}]}