{"poster":"need elo police","date":"2019-06-30T17:28:18.075+0000","title":"An alle, die sich wegen ihren \"schlechten\" Mates aufregen","subforum":"Spielerverhalten & Moderation","up_votes":23,"down_votes":9,"body":"**Schaut euch die Profis an!**\r\n\r\nIch schaue sehr gerne League of Legends Esports, also wie die besten Spieler der Welt versuchen zu gewinnen. Richtig gelesen, dies sind **die besten Spieler der Welt.** Und wisst ihr was? In dem letzten Spiel hat der Sejuani Spieler mehr Ultis verhauen als ich jemals einen anderen Spieler in der Gold Elo gesehen habe. Dementsprechend war dieser Spieler nach dem verlorenen Spiel ziemlich angepisst. Dies ist aber nur die Spitze des Eisbergs. Dort werden gut und gerne mal die einfachsten Flashes oder Ganks verkackt. Man kann darüber nur den Kopf schütteln, oder? Immerhin sind diese Typen Profis und spielen nichts anderes. **FALSCH!**\r\n\r\nDazu kommt noch, dass die Profis **alle im Voice sind.** Die Kommunikation ist viel viel viel viel besser als in Solo Q, wo man sich nur mittels Pings (oder Chat) verständigen kann. Und selbst da gibt es oft genug fehlende oder unverständliche Kommunikation und führen zu Fehler, die manchmal das Spiel kosten. Zusätzlich spielen diese Spieler viel öfters miteinander als du mit jemanden in Solo Q. Wie soll es dann erst den Amateur Spielern wie wir es sind möglich sein, keine Fehler zu machen? **Gar nicht!**\r\n\r\nJeder, der eine negative Einstellung hat sollte sich immer hinterfragen: Macht man selber nicht auch Fehler? Denn oftmals sieht man seine eigenen Fehler gar nicht, sondern nur die der anderen. Dies ist nun mal so ... dazu kommt noch, dass die meisten hier einen normalen Job haben und nur in ihrer Freizeit spielen können. Aber ist es fair, diese Spieler fertig zu machen, wenn selbst die Profis die den ganzen Tag zocken oft genug Amateur Fehler machen? Ich sage: **NEIN!**\r\n\r\nBitte denkt an diesen Thread, wenn mal eine Elise einen Flash Kokon verfehlt oder ähnliche Fehler gemacht werden. **Wir sind alle nur Menschen!** Habt Spaß an diesem Spiel, gibt euer Bestes, seid freundlich zueinander, zeigt gegenseitigen Respekt und habt eine positive Einstellung. Dann werdet ihr auch früher oder später climben.\r\n\r\nDenn: **Wer gewinnen will, muss freundlich sein!**\r\n\r\nmfg\r\n\r\nder positivste Spieler auf EUW","replies":[{"poster":"00 M4ddin 00","date":"2019-07-01T06:12:06.410+0000","up_votes":6,"down_votes":0,"body":"Frechheit ! \nDas du mich einfach mit Profi Spielern vergleichst ! \n\nIch bin ganz klar besser als die ! \n\n*hust hust*","replies":[]},{"poster":"BenniSk1ll","date":"2019-06-30T19:59:20.563+0000","up_votes":0,"down_votes":0,"body":"Grundlegend finde ich diesen Post nicht schlecht, aber die Aussage das selbst Profis ne Menge Fehler machen finde ich sehr schwach. und hast du jemals ein Game in der Pro-Szene gesehen wo ein carry 10/0 war oder eine ziemlich hohe K/D hatte und trotzdem nicht carrien könnte weil die teammates zu inkompetent waren um den carry zu spielen!","replies":[{"poster":"need elo police","date":"2019-06-30T20:14:43.622+0000","up_votes":3,"down_votes":0,"body":"Es geht nicht darum, ob deine Mates inkompetent sind oder nicht. Die Aussage mit den Profis habe ich deshalb erwähnt, weil viele für eine gewisse Elo gewisse Fehler nicht verzeihen. Und ich wollte damit aufzeigen, dass jedem (weil eben Menschen) Fehler passieren können, egal welche Elo und auch egal welche Art von Fehler.","replies":[{"poster":"HappyLoLFriend","date":"2019-07-02T09:03:08.662+0000","up_votes":1,"down_votes":1,"body":"Das sieht der Game Support aber nicht so!, mein Dia Rating wurde mehrmals als Grund mit in das Makro genommen um mich zu verknacken für schlechte Stats. Beim letzten mal für ein einziges Spiel und dieses mal wurde die Sperre auch nicht aufgehoben, weil es bei meinen 20 Spielen pro Tag schon zweimal vorgekommen ist. Da wurde ich jedoch von einem Bot mit Feedback gesperrt und der Bann nach angeblicher Kontrolle aufgehoben. Das trifft sowieso auf niemanden bis auf mir zu also was laber ich xD Schöner Thread.\n\nP.S.: Keine Ahnung ob ich ausgerechnet diese Spiele angesehen habe, aber besonders die Supports der Proteams haben meines Erachtens nach viele Fehler gemacht.","replies":[]}]},{"poster":"AI Bärchen","date":"2019-07-03T13:32:30.601+0000","up_votes":1,"down_votes":0,"body":"Das Ranked System sollte Lane abhängig gemacht werden!","replies":[]}]},{"poster":"Lord Furzkissen","date":"2019-06-30T17:46:22.885+0000","up_votes":3,"down_votes":0,"body":"Scheint eine Eigenart in LoL zu sein... \n\nAls ich Schach spielen gelernt habe als Kind (ok, lange her) hab ich bestimmt die ersten 1000 Partien gegen meinen Vater verloren. \nHabe so nicht nur das Spiel gelernt, sondern auch ein Spiel nicht zu ernst zu nehmen und mit Anstand zu verlieren.","replies":[{"poster":"SuicidePlank","date":"2019-06-30T17:58:55.897+0000","up_votes":2,"down_votes":0,"body":"Habe früher mit meinem Bruder zusammen gegen meinen Dad Strategiespiele gespielt, kaum eins gewonnen, aber hatte trotzdem mega Spaß. ^^","replies":[]}]},{"poster":"Hundis Katze","date":"2019-06-30T18:15:49.559+0000","up_votes":4,"down_votes":1,"body":"Schade, dass so etwas selbstverständliches ein Thread braucht...","replies":[]},{"poster":"Atsùra","date":"2019-07-07T11:58:48.859+0000","up_votes":2,"down_votes":0,"body":"UUUH ich mag mit dir spielen, du bist bestimmt nett {{sticker:sg-lux}}","replies":[{"poster":"need elo police","date":"2019-07-07T14:06:45.617+0000","up_votes":1,"down_votes":0,"body":"{{sticker:katarina-love}}","replies":[{"poster":"Atsùra","date":"2019-07-07T14:22:57.354+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-jinx}}","replies":[]}]}]},{"poster":"Jinarai","date":"2019-06-30T20:32:16.763+0000","up_votes":3,"down_votes":6,"body":"selten so einen schwachgeistigen unsinn gelesen aber es erklärt im subkontext sehr deutlich den tief schwälenden konflikt in der league community. wenn du also wie du sagst nur aus spaß an der freude nach dem feierabend ein paar runden league spielen möchtest ist das völlig legitim. aber wenn du in ein ranked spiel gehst und du dich dann mit dem motto \"get carried or die trying\" in den kampf stürzt, musst du dich nicht wundern auf der anderen seite der leitung frust bei deinen mitspielern zu erzeugen. richtige trolle finde ich ja noch witzig ehrlich gesagt, ich hatte zum beispiel in der letzten zeit mehrfach einen der soraka jungle gepickt (banana!), oder als veigar 16? kills in 9 minuten gefeedet hat (also wircklich die mitte runter, vom shop in den turm). die werden dann reported und gut ist. was mich wircklich nervlich zermürbt sind spieler die mit 0,03 apm auf meiner lane sitzen und sich supporter schimpfen. hinterm turm, cs deny 20,40,50,100 was solls, und wenn die skills in trades benutzt werden, dann nur!! als last resort um den kill den dein mitspieler herausgearbeitet hat abzugreifen. wir haben dafür einen begriff, das nennt sich leechen, von engl. saugen. im low elo gibt es sooooo viele leute die genau das machen und die sich dann auch noch wegen mangelndem spielverständnis und fehlender politik seitens riot (enforce \"helping enemy team\") für \"gute\" spieler halten. DAS macht mich unglaublich toxic. ich könnte jetzt eine fünfzig seitige abhandlung über die abgründige schlechtigkeit des matchmaking systems schreiben, aber lassen wir das für den moment.\n\nzwei beispiele,\n\n1) nautilus support, heute im game gehabt, emote spam auf der lane anstatt fokussiertes gameplay, 1n5 engages und anschließender blame warum keiner mit ihm am t2 mid turret stirbt, hätte uns fast das spiel gekostet ABER er war einfach nur \"schlecht\". das war ok, der hat fehler gemacht aber er hat halt nicht absichtlicht gegen unser team / gegen mich gespielt. ich bin fett geworden, wir konnten ihn überzeugen nicht mehr zu inten und ein sieg war so relativ einfach möglich. tatsächlich hat es mich sogar amüsiert ihm dabei zuzusehen wie er sich zu weit vor gewagt, im falschen moment alleine in die gegner gestürmt, oder zu lange in der gegnerischen base geblieben ist.  just fine.\n\n2) lux support auch heute, spammt abilites non stop in die minion waves, permanenter push was easy ganks für den enemy jungler und ne menge verlorener cs durch zoning bedeutet, verhindert lasthits vom eigenen adc durch spellspam und aa (ist doch nicht so schlimm, das waren doch nur xyz), keine wards, immer 5 meter hinter dir wenn nicht gleich afk am turm, feedet early 2,3,4 kills an den gegner und nimmt sich im gegenzug jeden kill den sie / er kriegen kann. da denkt also jemand er müsse mit dem adc um die carry rolle konkurieren und spielt so gegen!! seinen eigenen teammates. ich verliere unglaublich viele spiele wegen solchen leuten die von riot ja auch noch belohnt und gefördert werden. dabei ist das straight up helping enemy team wenn der eigene carry als ureigene taktik heraus klein gehalten wird, damit man dann im lose screen der lobby schreiben kann \"nice damage adc\" und der emotionale sieg genauso viel schaden auf den gegner verteilt zu haben wie der adc, eingestrichen wird. dass das halt nur der fall ist weil das spiel nach 18min um war, und lux ulti auch ohne impact auf den spielverlauf in der statistik hoch klettert interessiert nicht. das ziel war von anfang an der adc und nicht etwa der gegnerische nexus. und solche spiele können nicht (von mir, kein challenger) gewonnen werden, unmöglich. da kannst du farmen wie du lustig bist, nicht sterben, versuchen early zu roamen, ganz gleich. wenn du auf botlane 3n1 bist, hast du das spiel quasi instant verloren. und das sind momente wo ich mir dann wegen kommentaren wie \"bad play(er)\" ne chat restriction einfange, was mich im umkehrschluss nicht unbedingt weniger toxic macht....\n\nkurz gesagt, spielt wie ihr wollt, aber dann spielt blind pick oder normals oder gott verdammt, noch besser, gebt uns endlich ein matchmaking system das leute auf einem ähnlichen wenn nicht sogar gleichen spielerischen niveau zusammenwürfelt und nicht ständig versucht dich krampfhaft herabzustufen. und wenn ihr doch ranked spielt, dann gebt euch WENIGSTENS mühe zu gewinnen. dafür sind ranked games da, nicht um das eigene team zu schlagen oder sein ego aufzupolieren (küsst mir die füße sonst renn ich in die türme, wer kennt es nicht?!). mit leuten die fehler machen und skillshots versetzen habe ich kein problem, mit leuten die gegen das eigene team spielen sehr wohl.\n\njust my 2 cents.\n\nps: freundlich muss zu mir auch niemand sein!","replies":[{"poster":"eingew","date":"2019-07-01T06:00:34.819+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Jinarai,realm=EUW,application-id=KYnfKGf0,discussion-id=Bo5bQBxd,comment-id=000b,timestamp=2019-06-30T20:32:16.763+0000)\n>\n> selten so einen schwachgeistigen unsinn gelesen aber es erklärt im subkontext sehr deutlich den tief schwälenden konflikt in der league community. wenn du also wie du sagst nur aus spaß an der freude nach dem feierabend ein paar runden league spielen möchtest ist das völlig legitim. aber wenn du in ein ranked spiel gehst und du dich dann mit dem motto \"get carried or die trying\" in den kampf stürzt, musst du dich nicht wundern auf der anderen seite der leitung frust bei deinen mitspielern zu erzeugen. richtige trolle finde ich ja noch witzig ehrlich gesagt, ich hatte zum beispiel in der letzten zeit mehrfach einen der soraka jungle gepickt (banana!), oder als veigar 16? kills in 9 minuten gefeedet hat (also wircklich die mitte runter, vom shop in den turm). die werden dann reported und gut ist. was mich wircklich nervlich zermürbt sind spieler die mit 0,03 apm auf meiner lane sitzen und sich supporter schimpfen. hinterm turm, cs deny 20,40,50,100 was solls, und wenn die skills in trades benutzt werden, dann nur!! als last resort um den kill den dein mitspieler herausgearbeitet hat abzugreifen. wir haben dafür einen begriff, das nennt sich leechen, von engl. saugen. im low elo gibt es sooooo viele leute die genau das machen und die sich dann auch noch wegen mangelndem spielverständnis und fehlender politik seitens riot (enforce \"helping enemy team\") für \"gute\" spieler halten. DAS macht mich unglaublich toxic. ich könnte jetzt eine fünfzig seitige abhandlung über die abgründige schlechtigkeit des matchmaking systems schreiben, aber lassen wir das für den moment.\n\nWeißt du wie ich das nenne? Das eigene Niveau blamen. Deine Mitspieler sind auf deinem Level. Wenn man durch leechen auf dein Level kommt, sagt das dann mehr übers leechen oder über dein Können aus?\n\n> zwei beispiele,\n> \n> 1) nautilus support, heute im game gehabt, emote spam auf der lane anstatt fokussiertes gameplay, 1n5 engages und anschließender blame warum keiner mit ihm am t2 mid turret stirbt, hätte uns fast das spiel gekostet ABER er war einfach nur \"schlecht\". das war ok, der hat fehler gemacht aber er hat halt nicht absichtlicht gegen unser team / gegen mich gespielt. ich bin fett geworden, wir konnten ihn überzeugen nicht mehr zu inten und ein sieg war so relativ einfach möglich. tatsächlich hat es mich sogar amüsiert ihm dabei zuzusehen wie er sich zu weit vor gewagt, im falschen moment alleine in die gegner gestürmt, oder zu lange in der gegnerischen base geblieben ist.  just fine.\n> \n> 2) lux support auch heute, spammt abilites non stop in die minion waves, permanenter push was easy ganks für den enemy jungler und ne menge verlorener cs durch zoning bedeutet, verhindert lasthits vom eigenen adc durch spellspam und aa (ist doch nicht so schlimm, das waren doch nur xyz), keine wards, immer 5 meter hinter dir wenn nicht gleich afk am turm, feedet early 2,3,4 kills an den gegner und nimmt sich im gegenzug jeden kill den sie / er kriegen kann. da denkt also jemand er müsse mit dem adc um die carry rolle konkurieren und spielt so gegen!! seinen eigenen teammates. ich verliere unglaublich viele spiele wegen solchen leuten die von riot ja auch noch belohnt und gefördert werden.\n\n\"Ich verliere spiele\" - \"die Spieler werden belohnt\" - Wie das? Sind Niederlagen neuerdings eine Belohnung? Wie fördert Riot das? Indem sie Miniongold per Lasthit vergeben oder was? Soll Miniongold ab sofort automatisch an die jeweiligen Lanerollen gegeben werden?\n\n> dabei ist das straight up helping enemy team wenn der eigene carry als ureigene taktik heraus klein gehalten wird, damit man dann im lose screen der lobby schreiben kann \"nice damage adc\" und der emotionale sieg genauso viel schaden auf den gegner verteilt zu haben wie der adc, eingestrichen wird. dass das halt nur der fall ist weil das spiel nach 18min um war, und lux ulti auch ohne impact auf den spielverlauf in der statistik hoch klettert interessiert nicht. das ziel war von anfang an der adc und nicht etwa der gegnerische nexus. und solche spiele können nicht (von mir, kein challenger) gewonnen werden, unmöglich. da kannst du farmen wie du lustig bist, nicht sterben, versuchen early zu roamen, ganz gleich. wenn du auf botlane 3n1 bist, hast du das spiel quasi instant verloren. und das sind momente wo ich mir dann wegen kommentaren wie \"bad play(er)\" ne chat restriction einfange, was mich im umkehrschluss nicht unbedingt weniger toxic macht....\n\nUnd, was ist deine Lösung? Trollen durch Spielmechaniken unmöglich machen? Schlechtes Spielen durch Spielmechaniken unmöglich machen? Was hast du vor? Willst du die Leute dazu zwingen auf hohem spielerischem Niveau zu spielen?\n\nGanz abgesehen davon, dass diese \"ungewinnbar\" Aussagen auch wieder Quatsch sind. Klar, du kannst nicht jedes Spiel gewinnen, ebenso wie du nicht jedes Spiel verlieren kannst. Viele sind aber relativ ausgeglichen und das ist der Haufen, in dem du das Ruder an dich reißen musst. Oder du schiebst eben weiterhin dein eigenes Versagen auf die ganzen Trolle. \nIst ja schließlich nicht so, als wäre dein Support nicht nächste Runde bei den Gegnern, wo du genau diese Fehler selbst ausnutzen kannst. Wie kommst du denn darauf, dass immer nur dein Gegner dich zonen kann, nur der Gegner dich ganken kann? Und wenn dir das jede Runde passiert, obwohl du ja jede Runde einen anderen Support kriegst, und der Gegner auch... liegt es dann nicht möglicherweise doch an dir?\n\n> kurz gesagt, spielt wie ihr wollt, aber dann spielt blind pick oder normals oder gott verdammt, noch besser, gebt uns endlich ein matchmaking system das leute auf einem ähnlichen wenn nicht sogar gleichen spielerischen niveau zusammenwürfelt und nicht ständig versucht dich krampfhaft herabzustufen. und wenn ihr doch ranked spielt, dann gebt euch WENIGSTENS mühe zu gewinnen. dafür sind ranked games da, nicht um das eigene team zu schlagen oder sein ego aufzupolieren (küsst mir die füße sonst renn ich in die türme, wer kennt es nicht?!). mit leuten die fehler machen und skillshots versetzen habe ich kein problem, mit leuten die gegen das eigene team spielen sehr wohl.\n\nVor jeder Runde werden 10 Spieler auf einem Niveau ausgesucht, und dann wird *ausgewürfelt* in welches der beiden Teams sie kommen. Das kannst du sogar selbst live beobachten, achte mal auf die Namen deiner Mitspieler wenn einer die CS verlässt. Wenn du dann instant wieder in eine neue CS kommt, wird dir auffallen, dass du ein paar der Namen bereits kennst, andere aber nicht. Dann im Loadingscreen wirst du plötzlich Leute im Gegnerteam sehen, die eine CS vorher noch in dein Team gesteckt worden waren.\nAlso wie soll denn das mit dem \"unten halten\" funktionieren? Du kriegst immer zufällig die schlechten Mitspieler? Das ist doch bloß ne schwache Ausrede. \nWenn dir deine Lane nicht gefällt, spiel eine andere oder hol dir einen Premade ran.\n\n> just my 2 cents.\n> \n> ps: freundlich muss zu mir auch niemand sein!\n\nWenn du wirklich aufsteigen willst, hier 3 kleine Tipps von mir, die dich garantiert noch einige Sprossen auf der Leiter klettern lassen:\n\n1. Kaufe und benutze mehr Pinks. Vision ist der wichtigste Faktor im Spiel und du hast keine. Hilft auch bei feindlichen Ganks.\n2. Bau als erstes Item auf Twitch Boots aus und geh erst auf AS, dann auf Schaden. Hilft auch bei feindlichen Ganks.\n3. Nimm nicht die Standardrunen, sondern gute. Presence of Mind ist besser als Triumph, und Last Stand besser als Coup de Grace. Ghost Poro ist besser als Sudden Impact. Außerdem ist bei der aktuellen AP-lastigen Supportmeta, von der du selbst ja bereits geschrieben hast, MR in den Runen besser als Leben und Schaden. Flat Resi in Runen bringt dir eh nur im Early was, und im Early macht der ADC keinen Schaden, der Support aber schon.","replies":[{"poster":"The Real Bonobo","date":"2019-07-04T11:14:05.667+0000","up_votes":1,"down_votes":0,"body":"Ich persönlich kann dem Beitrag von Jinarai nur zustimmen. Momentan gibt es im niederen Elo-Bereich (und da rede ich schon von Plat) so viele Leute, die einfach null Motivation haben sich zu bemühen, trotzdem aber Ranked spielen. Woran ich das festmache? In jedem (!) Spiel wird der surrender button gepressed bis zum geht nicht mehr, meist schon nach dem ersten eigenen Tod oder der 15 Minuten Marke. Dadurch wird die ganze Moral im Team massiv geschwächt, weil man schon weiß, dass ein Spieler das Spiel komplett aufgegegeben hat. Und es tut mir leid, aber dort sehe ich mich nicht in der Notwendigkeit, als persönlicher Seelsorger zu arbeiten und ihm (der meist noch feedet und flamed) zurück ins Boot zu holen. Das ist nicht nur bei Spielen so die vermeindlich wirklich bereits nach kurzer Zeit verloren sind - auch bei Spielen die eindeutig gewonnen werden, wollen Leute aufgeben, weil ihre eigene KDA nicht den Wünschen entspricht. Von Ranked-Flex brauche ich gar nicht anfangen, da in jedem Game gesagt wird \"I don´t care about Flex\" - wobei ich mir einfach nur denke, dass solche Leute eine Ranked Sperre bekommen sollten, da für sie die Normalgames wesentlich besser geeignet sind. \nIn meiner Matchhistory habe ich momentan im jedem dritten Game einen Troll oder Leaver und das ist keine Übertreibung. Von AD Neeko toplane der 0-7 nach 10min spielt (das geringere Übel) bis hin zu Sona support, die die ersten Minuten AFK ist, um dann sich AFK auf die Lane zu stellen und freekills abzugeben. Das schlimme daran ist, dass all meine Reports null auswirkungen haben, wohingegen man selbst immer wieder mit chat restrictions gestraft wird, nachdem man den Jungler bittet nicht das 3. Mal in den gegnerischen Jungle zu invaden und zu sterben (die Betonung liegt dabei, dass es auch als konstruktive Kritik formuliert ist und nicht als Flame/Insult - Chat logs kann ich gerne einmal auf Anfrage posten).\nZum Thema, dass man mit ähnlichen Leuten gematched wird. Ich Spiele momentan Plat-Elo (IV-II) und bekomme teilweise Leute in meinem Team sind, die Iron oder aber auch Diamond sind. Das ist nicht meine Elo! Hinzukommt, dass die Spielerlevel zum Teil soweit auseinandergehen, dass von einem gleichen Spielverständnis ebenfalls keine Rede sein kann. Jemand der Level 34 ist wird nicht das gleiche Spielknowledge haben wie jemand der Level 400 ist. Dafür muss der Spieler mit Level 34 kein Smurf sein, sondern einfach jemand der Glück in seinen Promomatches hatte. \n\nAll das sind Dinge, die einen einfach nur frustrieren und das Thema ausgeglichene Teams finde ich hat bei LoL massiv abgenommen.","replies":[{"poster":"eingew","date":"2019-07-05T07:38:32.111+0000","up_votes":2,"down_votes":0,"body":"Da schreibt man nichts ahnend seinen Kommentar und plötzlich springt dir die Katze auf die F5 Taste... Tschüss Text. War schön mit dir. \n\nAlso von vorn.\n\n> [{quoted}](name=Natalie Portnam,realm=EUW,application-id=KYnfKGf0,discussion-id=Bo5bQBxd,comment-id=000b00010000,timestamp=2019-07-04T11:14:05.667+0000)\n>\n> Ich persönlich kann dem Beitrag von Jinarai nur zustimmen. Momentan gibt es im niederen Elo-Bereich (und da rede ich schon von Plat) so viele Leute, die einfach null Motivation haben sich zu bemühen, trotzdem aber Ranked spielen. Woran ich das festmache? In jedem (!) Spiel wird der surrender button gepressed bis zum geht nicht mehr, meist schon nach dem ersten eigenen Tod oder der 15 Minuten Marke. Dadurch wird die ganze Moral im Team massiv geschwächt, weil man schon weiß, dass ein Spieler das Spiel komplett aufgegegeben hat. Und es tut mir leid, aber dort sehe ich mich nicht in der Notwendigkeit, als persönlicher Seelsorger zu arbeiten und ihm (der meist noch feedet und flamed) zurück ins Boot zu holen. Das ist nicht nur bei Spielen so die vermeindlich wirklich bereits nach kurzer Zeit verloren sind - auch bei Spielen die eindeutig gewonnen werden, wollen Leute aufgeben, weil ihre eigene KDA nicht den Wünschen entspricht. Von Ranked-Flex brauche ich gar nicht anfangen, da in jedem Game gesagt wird \"I don´t care about Flex\" - wobei ich mir einfach nur denke, dass solche Leute eine Ranked Sperre bekommen sollten, da für sie die Normalgames wesentlich besser geeignet sind. \n> In meiner Matchhistory habe ich momentan im jedem dritten Game einen Troll oder Leaver und das ist keine Übertreibung. Von AD Neeko toplane der 0-7 nach 10min spielt (das geringere Übel) bis hin zu Sona support, die die ersten Minuten AFK ist, um dann sich AFK auf die Lane zu stellen und freekills abzugeben. Das schlimme daran ist, dass all meine Reports null auswirkungen haben, wohingegen man selbst immer wieder mit chat restrictions gestraft wird, nachdem man den Jungler bittet nicht das 3. Mal in den gegnerischen Jungle zu invaden und zu sterben (die Betonung liegt dabei, dass es auch als konstruktive Kritik formuliert ist und nicht als Flame/Insult - Chat logs kann ich gerne einmal auf Anfrage posten).\n\nUnd du meinst nicht, dass die Stimmung, die du im ersten Absatz als negativ beschreibst signifikant mit deinem eigenen Verhalten, welches du im zweiten Absatz beschreibst, zusammenhängen könnte?\n\nWie kommst du denn darauf, dass du als persönlicher Seelsorger arbeiten müsstest? Wie wäre es damit, wenn du einfach im Spiel gar nichts schreibst? So mache ich das auch. Klar, gelegentliche \"gj\"s und \"wp\"s sind dabei, aber alles was darüber hinaus geht ist mMn in 99% der Fälle sowieso reiner Spam und Zeitverschwendung. Wozu erzählst du dem Jungler, dass er nicht ständig invaden sollte? Wie viele Spiele hat der diese Season? Er ist mit dem Schwachsinn da hin gekommen, wo du jetzt stehst und du glaubst, dass du ihm mittels einer Chatnachricht davon abbringen kannst, das zu tun, was er seit womöglich hunderten Spielen durchzieht? (Völlig erfolglos wird er damit auch sonst nicht gewesen sein...) Wozu die Mühe?\n\nJa, die meisten Menschen sind ziemlich bescheuert (und davon will ich weder mich noch dich ausnehmen.) Und das drückt sich natürlich auch in LoL aus. Aber das sind nun mal die einzigen Menschen, die wir haben. Also mach das beste draus. Stell dich doch nicht so bockig hin und tu so, als stündest du dem, was deine Mitmenschen tun, machtlos gegenüber. Zieh dein eigenes Ding durch. Häng dich nicht an den Dingen auf, die du sowieso nicht verändern kannst. Konzentriere dich auf das, was du ändern kannst. Und das ist nun mal, wie ich in dem anderen Kommentar bereits geschrieben habe, eben nicht das Carrypotential deiner Mitspieler, sondern gerade dein eigenes. Also Augen aus dem Chat raus und auf das Spielfeld und die Map. Schalte die Spammer stumm und konzentriere dich darauf, dir *deine* LP zu erspielen. Und wenn ein Troll dabei auch welche bekommt, seis drum, ein bisschen Schwund ist immer, es kommt in erster Linie darauf an, dass *du* sie erhältst.\n\nWas die Reports angeht, natürlich sind die nicht nutzlos. Der Feederbuster ist nicht gut, aber das was du von der Sona beschreibst wird er durchaus erkennen können. Und der Leaverbuster erkennt das sowieso, der ist nämlich verdammt gut. Nur bei den Strafen mangelts.\n\n> Zum Thema, dass man mit ähnlichen Leuten gematched wird. Ich Spiele momentan Plat-Elo (IV-II) und bekomme teilweise Leute in meinem Team sind, die Iron oder aber auch Diamond sind. Das ist nicht meine Elo! Hinzukommt, dass die Spielerlevel zum Teil soweit auseinandergehen, dass von einem gleichen Spielverständnis ebenfalls keine Rede sein kann. Jemand der Level 34 ist wird nicht das gleiche Spielknowledge haben wie jemand der Level 400 ist. Dafür muss der Spieler mit Level 34 kein Smurf sein, sondern einfach jemand der Glück in seinen Promomatches hatte. \n\nDie Dias sind Dia 4. Du wirst auch mit P1 gematcht. Das tut sich nicht viel. Der letzte Silberspieler war Premade mit 2 G1-Spielern und die beiden davor sind mittlerweile selbst hohes Gold, hatten wahrscheinlich also damals einfach nur noch einen zu niedrigen Rang während ihre MMR längst deutlich höher war. Irons finde ich nicht.\nDas Spielerlevel ist wertlos um dein Können zu beurteilen. Erfahrung macht sicherlich etwas aus in LoL, viel wichtiger sind aber Dinge wie Reaktionsgeschwindigkeit, räumliches Vorstellungsvermögen, Feinmotorik usw. Es kommt also nicht wirklich stark auf dein Level an, solange du grundlegendes richtig machst (was nun wirklich nicht schwer ist) kannst du natürlich theoretisch auch bereits auf Level 40 mit einem Level 100er mithalten.\n\nIch verstehe also dein Problem nicht? \n\n> All das sind Dinge, die einen einfach nur frustrieren und das Thema ausgeglichene Teams finde ich hat bei LoL massiv abgenommen.\n\nWenn man auf seine Elo kommt hat man weniger Einfluss auf den Ausgang des Spiels, als wenn man signifikant besser ist, als die anderen. Du warst letzten Monat noch Gold, bist also in letzter Zeit deutlich aufgestiegen. Dass es sich jetzt so anfühlt, als ob du nichts mehr reißen könntest, liegt nicht daran, dass das MM schlechter geworden ist, sondern daran, dass deine Mitspieler und Gegner jetzt etwa so gut sind wie du selbst.\n\nDer Trick besteht jetzt darin, dich weiter zu verbessern. Arbeite an deinen Fähigkeiten. Dann gewinnst du auch häufiger und die Spieler fühlen sich wieder kontrollierbarer an.","replies":[]}]}]},{"poster":"00 M4ddin 00","date":"2019-07-01T06:14:46.097+0000","up_votes":1,"down_votes":0,"body":"Mhhh blub blub","replies":[]},{"poster":"need elo police","date":"2019-06-30T20:45:45.134+0000","up_votes":2,"down_votes":0,"body":"Du hast nicht ganz den Sinn des Threads verstanden. Für dich nochmal:\n\n> Dieser Thread ist auch nicht für die Spieler gedacht, die sich über Spieler aufregen die versuchen das Spiel gezielt zu sabotieren. Den Spielern die das machen kann man wohl auch nicht mehr helfen. Aber ich hoffe einfach mit diesem Thread zu erreichen, dass die Spieler verständnisvoller mit ihren Mates umgehen wenn Fehler passieren. Das heißt, nicht gleich beleidigen, flamen, inten und Pipapo. Denn genau dies ist der Grund, warum viele verlieren. Nicht weil Fehler passieren, sondern weil viele zu schnell aufgeben und die Leute schlechter spielen, wenn sie von ihren Mates wegen Fehlern runtergezogen werde\n\nDas hat man gewinnen oder verlieren, oder Ranked oder Normals nichts zu tun.\n\nIch finde es aber gut, wenn du uns deinen Frust an diesem Spiel in einem vernünftigen Ton mitteilst. Glaube jeder kann das auch verstehen.","replies":[]}]},{"poster":"dugg","date":"2019-07-01T07:58:42.037+0000","up_votes":2,"down_votes":0,"body":"Ich durfte neulich unfreiwillig Inhalt eines Streams sein (4 Teammates + random Ich)\n\nZugegeben meine ADC-Fähigkeiten sind sehr begrenzt. Mein Thresh-Support war super. Die Toplane hat ein paar Kills gelassen, die Mid-Lane war in Ordnung. Unser Jungler (Trundle) hält sich für einen von dir besagten Profispieler und geht ohne Vision in den Gegner Jungle. Wird dann von zwei Leuten angegriffen und verliert sein Leben nähe Midlane. Jetzt war ich natürlich schuld! Ich wurde ingame ein wenig beleidigt, daraufhin habe ich den Spieler gemuted und anschließend reportet. Laut Stream (welches leider nicht Strafbar ist) sei ich eine dumme Missgeburt gewesen, der niemals seine Lane verlässt und nichts macht und sowie so einfach nur scheiße dumm ist. Das waren noch die netten Vorwürfe.\n\nIch fühle mich von deinem Thread vollends verstanden. Ich bin nicht der beste ADC. Ich bin kein guter LoL-Spieler. Ich habe einfach nur Spaß bei der Sache. Nur werden Spieler, die Fehler machen oder mal einfach nicht hart carrien oft als Sündenbock für das eigene schlechte Spiel genutzt. Man selbst ist natürlich nie Schuld, es sind sehr häufig die anderen.","replies":[]},{"poster":"HairyAsianWife","date":"2019-06-30T18:49:42.835+0000","up_votes":2,"down_votes":0,"body":"Seit ich /mute all nutze reporte ich weniger und muss nicht immer Kindergärtnerin spielen,ist schon eine super Funktion.\n\nMal gewinnt man und mal verliert man letztenendes ist es nur LoL und bevor sich die Community ändert bekommst du eher ein Alien zu Gesicht.\nUnd Comp mit Soloq vergleichen,ist wie einem Boxer im Cruiserweight zu erklären wie man in der Schwergewichtsklasse kämpft. \n\nPro Spieler kann man sich auch nicht immer als Beispiel nehmen,denn du hast es selbst gesagt Kommunikation ist besser und selbst wenn die Soloq nur noch ausschließlich den Voicechat benutzen würde werde ich innerhalb einer Woche fremde Eltern besser kennen als meine eigene gemessen an dem Durchschnittsalter der Spielerschaft...verzichte! :D","replies":[]},{"poster":"xAshen one","date":"2019-06-30T18:20:50.138+0000","up_votes":1,"down_votes":0,"body":"Es gibt einen unterschied zu schlechten spielern und spielern die das spiel absichtlich verliere, wenn jemand schlecht ist, ist das in ordnung, aber wenn du dein hirn beim ranked spielen abschaltest und das spiel alleine verlierst ist es unfair allen anderen gegenüber, dem gegner da er keine fairen gegner bekommt und dem eigenen team, da sie ihre puntke verlieren und dafür nicht einmal etwas können.\nklar ist es falsch das eigene versagen anderen in die schuhe zu schieben aber nicht das schlecht sein ist das problem sondern das absichtliche verlieren.\n\nPS: du bist nie im leben der positivste spieler in EUW","replies":[{"poster":"ItachiXAK","date":"2019-06-30T18:24:48.022+0000","up_votes":2,"down_votes":0,"body":"Beste Beispiel ich gank auf der toplane verkack nen spell (passiert halt mal oder andere dodge halt) danach der toplaner lol OMG ich feede jetzt absichtlich XD","replies":[{"poster":"need elo police","date":"2019-06-30T18:26:36.021+0000","up_votes":2,"down_votes":0,"body":"Für unter anderem die ist dieser Thread gedacht.","replies":[]}]},{"poster":"need elo police","date":"2019-06-30T18:22:50.090+0000","up_votes":2,"down_votes":0,"body":"Woher weißt du das? Du kennst mich doch gar nicht :/","replies":[]}]},{"poster":"RyoKhan","date":"2019-06-30T17:34:59.538+0000","up_votes":2,"down_votes":0,"body":"Sehe ich genauso.. aber in jeden zweiten Game, wenn nicht sogar in jeden gibt es Spieler die schon Toxic rein kommen und dierekt die gegner und seine eigenen mates flamen ich verstehe das nicht es macht mich selber ziemlich toxic ich versuche es aber zu unterdrücken.. aber wenn man nur sagt versuch dich zu konzentrieren oder so dann trollen sie lassen sich von gegnern viele male töten um das spiel unwin bar zumachen .-.","replies":[]},{"poster":"611FVNKBlv","date":"2019-06-30T20:08:47.124+0000","up_votes":2,"down_votes":1,"body":"> Bitte denkt an diesen Thread, wenn mal eine Elise einen Flash Kokon verfehlt oder ähnliche Fehler gemacht werden. Wir sind alle nur Menschen! Habt Spaß an diesem Spiel, gibt euer Bestes, seid freundlich zueinander, zeigt gegenseitigen Respekt und habt eine positive Einstellung. Dann werdet ihr auch früher oder später climben.\n\nGrundsätzlich richtig. Ich beurteile aber Bad play anders. n Kokon verfehlen ist immer noch etwas anderes als n Mundo der gegen 5 ads {{item:3194}}  baut oder meint er könnte nen 1v5 fight gewinnen indem er ult flashed während das eigene team 10 km entfernt ist. \n\nWenn ich sehe das solche Spieler Dia+ sind bin ich instant triggered. Klar jeder macht fehler. Während n verfehlter kokon aber einfach unlucky ist sind meine genannten situationen kein bad luck sondern einfach bad play bad brain und bad alles außerdem habe ich noch nie gesehen das proplayer selbst wenn se bad plays hinlegen bzw mistakes machen am ende 1:20 stehen o.ä\n\nFakt ist jedenfalls je höher die elo umso besser sollte der spieler sein. ich sage bewusst sollte denn sind wir mal ehrlich . dia elo bleibt einfach n meme .... \n\nso aber was unterscheidet nen guten spieler vom schlechten spieler?\n\nhier gibts viele sachen aber für mich zählt eine hier besonders:\n\nein guter Spieler passt seinen spielstil WÄHREND des games neu an. Kriegst du hart auf die fresse weil grund xyz dann änderst du deine spielweise so das du es am ende wenigstens vermeiden oder hinauszögern kannst den gegner noch weiter ahead zu bringen.\n\nproplayer schaffen das  recht oft. Dann spielt es auch keine Rolle ob du n skill verfehlst.\n\nWas machen die klassischen Teammates? Bauen tear , flashen ohne ult in die gegner 1v5 rein , fangen an zu flamen , fangen an den gegnern zuzuspielen und und und. DAS ist meine definition von teammates die einen zurückhalten und wer das bestreitet das es so ist wenn teammates diese genannte spielweise an den tag legen der ist nicht mit LoL vertraut genug.\n\nIch könnte jetzt  n paar fälle nennen wo ich nen teammate aus prinzip reporten würde sofern er dia+ wäre die einfach zeigen das es n klaren unterschied gibt von unlucky und boosted af aber eigentlich will ich das bei dem wetter nicht lol.\n\nIch hab einfach genug erfahrung in Lol gesammelt was die einzelnen spieler einer elo angeht um für mich selber zu urteilen ob jemand den aktuellen rang verdient oder nicht. Ich reporte diese leute ganz individuell nach spielgeschehen. Hierbei gehts mir aber ausschließlich ums generelle gameplay und das generelle decisionmaking. Es gibt entscheidungen die trifft man als Spieler in dia + nicht wenn man da wirklich hingehört. \n\nIch flame meine mates zwar nie IG auch wenns mich manchmal ganz schön kraft kostet aber ich werde nicht aufhören leute zu reporten die einfach mehr als 1 Liga von der aktuellen entfernt spielen. \n\nich bin glücklich über jeden schlechten teammate den ich habe der so spielt wie du einen \"schlechten\" teammate etwa versuchst darzustellen. Denn das sind die spieler mit denen ich gewinnen KANN.\n\n\nWas ich habe : spieler die bewusst bei einem fehler anfangen zu trollen ragequitten oder gleich von anfang an afk sind\n\ndas hat nichts mit dem schlechten teammate zu tun den du hier versuchst darzustellen denn dieser schlechte teammate von dir hat lediglich bad luck und entscheidet sich trotzdem ganz normal weiterzuspielen. so etwas will ich auch mehr will ich doch gar nicht. von allen schlechten teammates in league of legends ist das aber lass mich lügen bei 20% der fall ? die meisten trollen dich .. als jungler versuchen die deine camps zu lasthitten und und und. \n\nsich über diese leute aufzuregen ist völlig nachvollziehbar\n\nSo und zum Abschluss nochmal speziell diesen teil zitiert:\n\n> Wir sind alle nur Menschen! Habt Spaß an diesem Spiel, gibt euer Bestes, seid freundlich zueinander, zeigt gegenseitigen Respekt und habt eine positive Einstellung. Dann werdet ihr auch früher oder später climben.\n\nRichtig . wir sind alle nur menschen das hast du gut erkannt. Habt Spaß an dem Spiel. Hier fängts an . Einige haben nur Soaß daran den Spaß von anderen zu ruinieren. also funktioniert das generelle habt Spaß nicht mehr.\n\nseid freundlich zueinander: bin ich ingame immer selbst bei extremen flamern und beleidigungen halte ich mich unglaublich zurück. Wenn man mich hier schon manchmal im Forum erlebt hat kann man sich das gar nicht vorstellen das ich IG so ne ruhige seele bin. So aber sind die anderen freundlich? NEIN ..... wie wullst du jemanden zwingen freundlich zu sein? Selbst wenn man höflich entgegen kommt wird beleidigt.\n\nGestern habe ich locker 4 games in folge gestartet mit gl&amp; hf. 4x in folge war die reaktion in etwa : Shut up you gay. get cancer. welches Spiel spielst du? Also ich spiele League of Legends und bisher ist es fast unmöglich das nur ein Punkt hier jemals zutreffen wird. \n\nwie viel respekt soll man zeigen? sollte man gegen derartige spieler überhaupt respektvoll sein? Für mich haben die jeglichen respekt nicht mehr verdient. Hier ist wieder einfach meine übliche aussage : der ehrenhafte spieler zieht immer die arschkarte recht gut anzuwenden.\n\nes ist zwar schön davon zu träumen das league ein ort des respektvollen umgangs wird aber das wird nie geschehen. somit ist die Aussage \"dann werdet ihr auch früher oder später climben\" komplett überflüssig da die Bedingungen fürs climben nach deinem Bilde gar nicht gegeben sind und nie herrschen können. Es hat seine gründe warum leute in die DuoQ gehen sag ich mal und das liegt nicht zwingend daran das man zusammen ranked zocken möchte.\n\n\nfazit also das du zwar eine schöne vorstellung von League hast die aber von der realität nach dem 1. Game gleich wieder eingeholt wird.  Ein Thread ohne sinn und zweck außer für meine eigene welt der fantasie das auch ich eines tages meinem spielstil entsprechend 2 - 3 ligen climbe vielleicht sogar ohne das jede 2. Runde n afk ankommt.  \n\ndenn wer gewinnen will, muss freundlich sein, 1 von 5 haben wir schon mal im Team. die andern 4.bleiben abzuwarten {{sticker:slayer-jinx-wink}}","replies":[{"poster":"need elo police","date":"2019-06-30T20:20:02.399+0000","up_votes":1,"down_votes":0,"body":"Dieser Thread ist auch nicht für die Spieler gedacht, die sich über Spieler aufregen die versuchen das Spiel gezielt zu sabotieren. Den Spielern die das machen kann man wohl auch nicht mehr helfen. Aber ich hoffe einfach mit diesem Thread zu erreichen, dass die Spieler verständnisvoller mit ihren Mates umgehen wenn Fehler passieren. Das heißt, nicht gleich beleidigen, flamen, inten und Pipapo. Denn genau dies ist der Grund, warum viele verlieren. Nicht weil Fehler passieren, sondern weil viele zu schnell aufgeben und die Leute schlechter spielen, wenn sie von ihren Mates wegen Fehlern runtergezogen werden.","replies":[]}]},{"poster":"Cleptonancy","date":"2019-06-30T17:41:18.867+0000","up_votes":2,"down_votes":1,"body":"Genau der Amumu in meinem letzten game hatte nur ein schlechtes game und jeder von uns rennt mal die  lane runter um absichtlich zu verlieren also schämt  euch selbst!","replies":[{"poster":"RyoKhan","date":"2019-06-30T17:51:48.622+0000","up_votes":1,"down_votes":0,"body":"nein so etwas mache ich nicht weil ich einfach nur unfair und unreif finde..","replies":[{"poster":"Cleptonancy","date":"2019-06-30T17:57:52.189+0000","up_votes":1,"down_votes":0,"body":"Das war auch sarkastisch gemeint ^^","replies":[]}]}]},{"poster":"xAndre710x","date":"2019-07-16T18:44:30.883+0000","up_votes":1,"down_votes":0,"body":"Bei snapchat bei dumm gefragt wurden esl Profis befragt und die sagen das es ganz normal ist das man sich aufregt weil man besser werden will 😉","replies":[{"poster":"xAndre710x","date":"2019-07-16T18:45:20.207+0000","up_votes":1,"down_votes":0,"body":"Und es gibt einfach wirklich Leute bei den würde mal selber am liebsten lachend in die Kreissäge rennen xD","replies":[]}]},{"poster":"Ikrahdasan","date":"2019-07-08T09:20:32.953+0000","up_votes":1,"down_votes":0,"body":"Das doch wie beim Auto Fahren. Jeder fährt scheiße nur man selber nicht. \n\nSelbst wenn du über ne Rote Ampel fährst und zum Polizisten sagst: \"War doch noch Violett als ich drüber bin\" \n\nSelbstreflektion ist nun mal leider etwas das nicht jeder hat und auch viele im laufe ihres Lebens nicht mehr lernen wollen/können.","replies":[]},{"poster":"Vorzüglich","date":"2019-06-30T21:34:33.644+0000","up_votes":1,"down_votes":0,"body":"Wer gewinnen will muss nur premade spielen^^\n\nAnsonsten gebe ich mich schon lange nicht mehr mit Spielern ab, die so eine  \"dabei sein ist doch alles\"\nMentalität an den Tag legen.\n\nDirty Casuals^^","replies":[]},{"poster":"ShadowBamos","date":"2019-06-30T18:47:21.924+0000","up_votes":1,"down_votes":0,"body":"Was ich fast noch schlimmer finde ist es wen eine person dich zu tode flamt, selber scheiße spielt  und auch noch denkt er wäre der größte ficker in league.\nFrage mich wo man so ein riesiges ego herbekommt XD","replies":[]},{"poster":"Rena","date":"2019-06-30T17:58:56.776+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}} \n\nGute Einstellung.\nIch stimme zwar dem \"Freundlich-Teil\" nicht ganz zu, aber ich finde deine Einstellung echt super.\nIch denke einfach nicht toxic zu sein, reicht schon vollkommen.","replies":[]},{"poster":"RaphiOderSo","date":"2019-07-03T05:33:29.209+0000","up_votes":0,"down_votes":0,"body":"Leider vergessen viele lol Spieler das League of legends nur ein Spiel ist und mehr nicht. Und natürlich machen pro Spieler auch Fehler (was auch klar ist). Den Fehler sind menschlich. Man sollte finde ich einfach Spaß am Spiel haben dan läuft auch (meistens) alles supper gut :D Ach ja deine Aussage das man respektvoller mit anderen Spielern umgehen soll finde ich sehr gut und ein wichtiger Punkt. &lt;3 &lt;3.            {{sticker:slayer-jinx-wink}} ","replies":[]}]}