{"poster":"HTSG Hyo Kwan","date":"2015-11-13T19:46:22.464+0000","title":"quisiera saber si hay alguna forma de sacar un ban permanente ?","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":6,"body":"si alguna forma porfavor diganme y sino dejare de jugar de una vez.","replies":[{"poster":"xxOSNIxx","date":"2015-11-14T05:30:41.359+0000","up_votes":2,"down_votes":0,"body":"permanente.. permanente... mmmm que querra decir esa palabra... \nmmm \ngoogliemos\n\nPERMANENTE: del latin perma - nente, llamese a una accion totalmente modificable a la voluntad de quien quira.\nEj: Cuando uno recibe un ban permante lo puede cambiar. porque permanente no quiere decir que es irrevocable. naaa nada de eso... yo cambio las cosas permanentes todo el tiempo\n\nhay dio´ mio !!!","replies":[{"poster":"HTSG Hyo Kwan","date":"2015-11-15T00:56:22.198+0000","up_votes":1,"down_votes":1,"body":"che payaso yo pregunte bien, si te vas a hacer el capo ni comentes mejor y segui jugando al lol","replies":[]}]},{"poster":"nahuatl","date":"2015-11-18T15:01:56.728+0000","up_votes":1,"down_votes":0,"body":"solo si tenes una deuda, si no es asi, despedite de lol XD","replies":[]},{"poster":"Silver000","date":"2015-11-13T21:21:31.606+0000","up_votes":1,"down_votes":0,"body":"Adiós el lol y riot te extrañaran, a menos que haya sido por falta de pago o algún error \nPor que te suspendieron permanente?","replies":[]},{"poster":"Pascut","date":"2015-11-13T20:45:47.772+0000","up_votes":1,"down_votes":0,"body":"No hay forma al menos que sea porque no pagaste x cantidad de RP que te dieron, ahí tienes que cubrir el monto y te devuelven la cuenta","replies":[]},{"poster":"hi im chito","date":"2015-11-13T19:56:12.425+0000","up_votes":1,"down_votes":0,"body":"si es por causas de pago con RP, debes pagar el monto, si es por otro motivo, como ser toxico, segunda vez con elo boost, o otro motivo, es permanente, ni a los players de la LCS como iWilldominate, incarnation, XJ9 les han devuelto sus cuentas xD","replies":[]},{"poster":"Landidzu","date":"2015-11-13T19:54:39.219+0000","up_votes":1,"down_votes":0,"body":"No hay forma. Un banneo permanente es permanente y sin excepción.","replies":[]},{"poster":"ZanahoriaAsesina","date":"2015-11-13T19:51:24.494+0000","up_votes":1,"down_votes":0,"body":"No.Solo en el caso de que fuese un error se puede retirar la sanción.","replies":[{"poster":"HTSG Hyo Kwan","date":"2015-11-13T19:54:36.022+0000","up_votes":1,"down_votes":0,"body":"ok muchas gracias.","replies":[]}]},{"poster":"Aluneth","date":"2015-11-13T19:48:52.266+0000","up_votes":1,"down_votes":0,"body":"Si es por fraude (compraste RP y no pagaste) tenes que pagar el monto y te la devuelven.\nSi es por otro motivo, creo que no hay forma.","replies":[]},{"poster":"HomoSexpiens","date":"2015-11-14T00:44:18.465+0000","up_votes":1,"down_votes":1,"body":"si te banearon por ser niño rata (trollear , insultar y tirar partidas a proposito) te mereces el ban, si es por un error economico pide ticket al soporte para que te retiren el ban.","replies":[]}]}