{"poster":"Real Mechanics","date":"2018-08-22T15:52:59.734+0000","title":"Warum bekommt man in die Promos immer Spieler die ein Tilt-faktor 2000 haben?","subforum":"Allgemeiner Chat","up_votes":4,"down_votes":3,"body":"sei &uuml;ber ner Woche gewinne ich Jedes game, es sei denn ich komm in die Promos dann verliere ich wirklich jedes Promo Spiel.\r\nEgal wie safe ich spiele. Ich feede auch nicht aber mein Team intet wirklich jedes mal oder jedes 2. promo game mindestens einer mit 6000 ping oder der leavt\r\nist das von riot beabsichtigt damit man nicht schneller climben kann?\r\nich versteh das einfach nicht das geht jetzt schon 8 mal hintereinander so das ich jedes spiel was ich in den Promos spiele verliere.\r\nwieder in die Promos kommen ist kein problem, weil man da irgendwie immer ein gescheites team bekommt oder maybe nur eine lane feedet\r\nich raff das einfach nicht mehr \r\nund das lustige is das die gegner in den promos dann mei&szlig;t wie challenger spielen xD","replies":[{"poster":"Me Support OwO","date":"2018-08-23T15:58:57.560+0000","up_votes":1,"down_votes":0,"body":"Das ist einfach nur ein kleiner psychologischer Effekt, damit hat Riot rein gar nichts zu tun. :D\nAn wie viele deiner normalen Rankeds erinnerst du dich? Vermutlich an die letzten, nehme ich an. Aber an wie viele deiner Promos? Ziemlich viele, zumindestens was die schlechten angeht.\nDer Mensch ist so, dass er sich einfach die schlechten Dinge viel mehr merkt, als die Guten. Du hast sogar in den normalen Ranked Games öfter Feeder und Afkler, doch sind diese nicht so wichtig, als fällt es dir auch einfach nicht auf.\nGenau wie dass du immer bis zu den Promos gewinnst und dann verlierst ist einfach ein normales Ende deiner Winningstreak, wie du es ganz oft erlebst.\n\nUnd dass du durch Tilten schlechter spielst muss ich ja nicht erwähnen :P\n\nAlso wie gesagt: Riot hat nichts damit zu tun. Auch ist die Chance bei Promos nicht höher oder so, es wirkt jediglich einfach so. Kannst ja zum testen einfach mal eine Liste führen und jetzt wünsche ich dir noch viel Spaß beim Ranked _Gewinnen._\n{{sticker:katarina-love}} \n\n~Crynx","replies":[]},{"poster":"OPChampsSucks","date":"2018-08-22T21:03:23.773+0000","up_votes":1,"down_votes":6,"body":"man muss sich halt nur mal bekannte streamer anschauen  es gibt einfach keine Promo die ordentlich gespielt werden kann weil rito sich denkt lass mal unnötig nerven.\n\nMeine promos liefen eigentlich im Grunde aber eher für meine Verhältnisse sogar recht entspannt ab. Ich hatte eigentlich nur das problem sofern ich die promo geschafft habe das dann erst die extremsten trolls / afks etc in die team kamen um mich wieder zu droppen (13 spiele in folge auf 0 lp verlieren zu können  muss schon ne nice mmr sein rito aber danke für die mates lol) \n\nAllerdings wenns mal wieder so richtig eklig läuft dann schaffe ich bei ner 3er promo auch nur die 2 Games oder bei ner 5er nur die 2 Games , Meistens basieren diese verlorenen spiele wie gehabt auf 2-4 afk Spieler  oder auf extrem toxic spieler die meistens um die minute 10 ragequitten. Ewiger surrenderspam etc alles was dazu gehört. jungler buffs/farm klauen  etc ist da auch keine seltenheit was für zusätzlichen \"Spaß\" sorgt. \n\nWo ich dir nicht wirklich zustimmen kann ist das die gegner wie challenger in den promos spielen (also vom vergleich her) ... ich finde zwar schon das meistens ein bisschen besser gespielt wird aber richtige Gegner habe ich in den promos nicht wirklich also welche die mir meilen vom Skill her überlegen sind ist wirklich eine absolute ausnahme und das sind oft mastersmurfs.  bis aktuell dia 1 spieler komme ich sehr even gegen klar und hier ist meistens der Champion entscheidend oder wer zuerst nen fehler macht aber spieltechnisch gibts sehr wenig leute irgendwie die wirklich mich in grund und boden stompen.","replies":[]}]}