{"poster":"Swarovsko","date":"2017-09-12T22:07:22.731+0000","title":"Good job on sacred sword Janna, Riot","subforum":"Story, Art, & Sound","up_votes":69,"down_votes":16,"body":"It surprised me in a good way. I wasn&#039;t expecting to see skins that show us completely different shades of a champion (like reaper Soraka). I like it and I appreciate your thinking out of the box. I hope to see more skins like this in the future, I hope to see more original, unusual and yet beautiful skins like the reaper themed skin was for Soraka and the sacred sword is for Janna. Good job.","replies":[{"poster":"WinTheWarOnPants","date":"2017-09-12T22:56:13.156+0000","up_votes":22,"down_votes":3,"body":"Well, now riot can't use the excuse \"X champ didn't fit in this skin thematic\".","replies":[{"poster":"Swarovsko","date":"2017-09-12T22:58:47.003+0000","up_votes":4,"down_votes":2,"body":"> \"X champ didn't fit in this skin thematic\"\n\nWhen did they say that?","replies":[{"poster":"WinTheWarOnPants","date":"2017-09-12T23:35:02.982+0000","up_votes":22,"down_votes":3,"body":"Katey said that champs need to fit the theme, so even if they have gotten a skin recently or have a shit ton of skins, they will still be in the running aka ahri gets tons of skins because she fits all the themes(she could have even fit this theme apparently lol). cause it's about how well they \"fit\". I don't have a link(it might not have been katey cause i just went through 8 months worth of her post and didn't see it). \nHowever, I found this.\n> We have a skin in development right now (to be released later this year) that has the team divided. Some people feel it’s a slam dunk. Some feel it’s not the most obvious fit, but a risk worth taking. Others feel adamant that it’s a bad fit.\n\nI've never seen a worse fitting skin in the game, so i think he was probably talking about this janna skin(the timing also seems to fit).","replies":[{"poster":"Swarovsko","date":"2017-09-13T00:27:56.595+0000","up_votes":1,"down_votes":0,"body":"Thank you.","replies":[]}]},{"poster":"Smitty Manjensen","date":"2017-09-13T00:22:05.882+0000","up_votes":4,"down_votes":11,"body":"> [{quoted}](name=Swarovsko,realm=EUW,application-id=6kFXY1kR,discussion-id=00U3Ijto,comment-id=00010000,timestamp=2017-09-12T22:58:47.003+0000)\n>\n> When did they say that?\n\nI am baffled that some lesser minded people are upvoting you, Rito literally said that several times because people were complaining about Ahri getting her billionth skin.","replies":[{"poster":"parrot6632","date":"2017-09-13T13:46:52.661+0000","up_votes":8,"down_votes":0,"body":"\"lesser minded\" \n\nyou some wise-ass guru atop mount fuji meditating while playing league with your mind now?","replies":[{"poster":"5000000000000000","date":"2017-09-13T17:17:17.876+0000","up_votes":2,"down_votes":0,"body":"yes","replies":[]}]}]}]},{"poster":"GreenLore","date":"2017-09-12T23:48:12.185+0000","up_votes":15,"down_votes":0,"body":"Well it is possible to find a creative way to include a champ into a certain skinline,but not for everything.\nI mean in Jannas case they replaced her staff with a long sword,which is actually a really cool idea to make her fit.\n\nHowever that has its limits too.\n\nI mean how would they make a \"sword\"-skin for Cho'gath?Thats pretty much impossible,without making the skin ridiculous.","replies":[{"poster":"Placentas","date":"2017-09-13T02:29:50.026+0000","up_votes":7,"down_votes":0,"body":"I'm honestly picturing this \"Iron Throne\"-esque looking Cho'Gath. With swords as spikes coming off him etc etc lmao. Kinda like Blade Queen Liss","replies":[]},{"poster":"SanKakU","date":"2017-09-13T01:12:59.969+0000","up_votes":1,"down_votes":0,"body":"Just make the sword impale him?\n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"SteelMankind","date":"2017-09-13T04:52:12.981+0000","up_votes":3,"down_votes":0,"body":"Goddamn, that's so cool.\n\nImagine this enormous monster, bathed in shadow and smoke, and impaled Kalista-style by assorted rusting weaponry which are the source of it's power","replies":[]},{"poster":"GreenLore","date":"2017-09-13T09:00:17.114+0000","up_votes":1,"down_votes":0,"body":"Well but that would be a whole different kind of skin again.\nI mean the sword skins are about chinese sword masters,not about monsters impaled by swords.","replies":[{"poster":"SanKakU","date":"2017-09-13T14:41:29.321+0000","up_votes":2,"down_votes":1,"body":"Yeah because Janna holding a sword by its sheathe and using it as a magic wand totally makes her the same thing as a sword master Kappa.","replies":[]}]}]}]}]},{"poster":"cocacolalips","date":"2017-09-12T22:35:27.898+0000","up_votes":3,"down_votes":24,"body":"unpopular opinion:\n\nI really dislike all the recent skins that look nothing like the original champions, janna is a blond haired elf-ish caucasian white girl with skimpy clothes and a distinct staff, you replace her with a black haired asian chick? with a loose kimono of sort, a different haircut / skin tone and a sword for weapon? how is that janna? they look absolutely nothing alike, you might as well release a different champion all together.\n\nit's a shame because the skin is pretty, but I won't buy it because it's not janna.","replies":[{"poster":"Fairyfleur","date":"2017-09-12T23:18:39.279+0000","up_votes":17,"down_votes":0,"body":"She still has the same stance, body proportions, and pet. Skins aren't supposed to be x champion in a new outfit.","replies":[{"poster":"cocacolalips","date":"2017-09-12T23:34:04.349+0000","up_votes":2,"down_votes":7,"body":"> She still has the same stance\n\nthat's not by choice, animations are a lot of work, they changed everything they could realistically\n\n> body proportions,\n\nyou mean the same body proportions than 95% of the other female champions? damn, that's really what helps janna stands out from soraka and co, \"the body proportions\"\n\n> Skins aren't supposed to be x champion in a new outfit.\n\nno, but skins are supposed to be x champion still, and not y  or z champion.\n\nthe skin is unrecognizable at a glance, it could be anyone, it's battle boss brand / pug'maw all over again.","replies":[{"poster":"Fairyfleur","date":"2017-09-12T23:56:58.159+0000","up_votes":2,"down_votes":0,"body":"I guess by body proportions I mean that she still has a long narrow object in her hand, same floating hair, etc.","replies":[{"poster":"cocacolalips","date":"2017-09-13T00:09:04.328+0000","up_votes":1,"down_votes":4,"body":"that's the silhouette (think shadow) and no it's also different, her hair is longer and fuller, her clothes are wider and looser, her weapon is fairly different from a skinny, long staff with a blunt and round end to a larger long sword thingie with no round end\n\nadd that to all the colors shenanigans (hair, skin, clothes, weapons) and the noise (the sword again) and it's really difficult to see janna in it.\n\nthe skin is marvelous, but it's super far fetched, 99% of the ppl looking at it without prior knowledge wouldn't recognize janna. hell, I'm a janna main, I had no idea who I was looking at before reading the description.","replies":[]}]}]}]},{"poster":"GreenLore","date":"2017-09-13T09:04:57.827+0000","up_votes":4,"down_votes":1,"body":"So if a person dyes their hair,they become someone else entirely?\n\n\nSorry but I can't see how this is \"not janna\" just because she has black hair.\nI mean other skins turn champions into robots or entirely different beings and thats fine,but if a skin changes the hair color(which a lot of skins do) then thats bad?\nThats rather ridiculous.","replies":[{"poster":"cocacolalips","date":"2017-09-13T10:13:42.086+0000","up_votes":1,"down_votes":0,"body":"they changed everything, not only the hair color, I proposed to change the hair color back because it's the most noticeable characteristic and the easiest one to change without ruining the skin\n\nhttps://cdn.discordapp.com/attachments/147503303259979778/357237261118472192/564e2db076ce6dffe84fb3848cddcb9d-jpg.jpg\n\nhalf the ppl on reddit thought it was irelia looking only at the model, sorry the skin is unrecognizable\n\nI don't even get what ppl argue and comment about, you either have eyes and it doesn't look like janna or you don't and you don't comment.\n\nthis isn't the real world where you can tell ppl apart from the form of their nose or the color of their eyes, it's a video game with a top down view, all the champions have very small models and few details, they are only identifiable at a glance by their colors scheme and their overall silhouette, if you change both, which they did, you have something different entirely and largely unrecognizable.","replies":[{"poster":"GreenLore","date":"2017-09-13T10:59:13.790+0000","up_votes":1,"down_votes":0,"body":"Well look at any 2 skarner skins.\nDo they look like they are the same scorpion?\nNo they don't.\n\nSame goes for most nonhumanoids and their skins.\n\nSo why is it a problem that Janna looks different in this skin?","replies":[{"poster":"cocacolalips","date":"2017-09-13T15:20:26.363+0000","up_votes":2,"down_votes":1,"body":"so you are part of the ppl who don't have eyes, k, you troll.\n\nskarner has a very distinct silhouette btw, regardless of skin. when I look at a skarner skin, I don't think it's irelia, I think it's skarner. that's the difference.","replies":[{"poster":"GreenLore","date":"2017-09-13T15:57:16.169+0000","up_votes":1,"down_votes":0,"body":"Well you just disproved your own point.\n\nBecause Jannas silhouette is still the same even with this skin.\n\nAfter all the hair color or the face are irrelevant when it comes to the silhouette of the champion.","replies":[{"poster":"cocacolalips","date":"2017-09-13T17:05:41.970+0000","up_votes":1,"down_votes":0,"body":"I already had this discussion, this is my last post, you are a troll, a blind one at that\n\nI quote myself\n\n> that's the silhouette (think shadow) and no it's also different, her hair is longer and fuller, her clothes are wider and looser, her weapon is fairly different from a skinny, long staff with a blunt and round end to a larger long sword thingie with no round end","replies":[{"poster":"GreenLore","date":"2017-09-13T17:35:10.031+0000","up_votes":2,"down_votes":1,"body":"And yet she is still the only female champ who floats with floating long hair and a staff,while being surrounded by a pet...\n\nThe sword is long enough to be recognizeable as her staff,her hair is still pretty similar to her old one and the clothes have similar sleeves to her current ones.","replies":[]}]}]}]}]}]}]},{"poster":"Telephone Booth","date":"2017-09-13T01:41:54.116+0000","up_votes":7,"down_votes":0,"body":"I can see why that's an unpopular opinion lol","replies":[{"poster":"cocacolalips","date":"2017-09-13T01:57:25.225+0000","up_votes":1,"down_votes":1,"body":"still not as unpopular as you think, see the pug'maw skin drama and to a lesser degree, the battle boss brand skin drama.","replies":[{"poster":"Telephone Booth","date":"2017-09-13T02:35:30.627+0000","up_votes":2,"down_votes":1,"body":"Jeez, I miss out on all the skin drama lol. I rarely visit this part of the forums so I'm not up on the trends. I fucking love pug'maw skin lol it's hilarious. And the brand one looks pretty nice. Huh. Weird how people really are so opinionated about skins that Riot puts out. Well... Weird to me. We all have our passions.","replies":[{"poster":"cocacolalips","date":"2017-09-13T02:43:53.373+0000","up_votes":1,"down_votes":0,"body":"the Pug'maw skin was the most controversial skin ever made, the backlash was huge, here, on reddit, even at Riot HQ between rioters, dozens of discussions with 500-1000+ upvotes and as many comments, eventually riot changed the skin to make it look more like kog'maw, but I doubt they will go down that route for a while.\n\nit's mostly a matter of clarity and immersion, a champion should be instantly recognizable regardless of the skin, and shouldn't stand out/off too much in the LoL universe.","replies":[]}]}]}]},{"poster":"Akali Prime","date":"2017-09-13T15:11:16.461+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=cocacolalips,realm=NA,application-id=6kFXY1kR,discussion-id=00U3Ijto,comment-id=0000,timestamp=2017-09-12T22:35:27.898+0000)\n>\n> unpopular opinion:\n> \n> I really dislike all the recent skins that look nothing like the original champions, janna is blond, you give her black hair ??? how is that janna? they look absolutely nothing alike, you might as well release a different champion entirely.\n> \n> it&#x27;s a shame because the skin is pretty, but I won&#x27;t buy it because it&#x27;s not janna.\n\nare you new here????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????","replies":[{"poster":"cocacolalips","date":"2017-09-13T15:22:18.430+0000","up_votes":1,"down_votes":0,"body":"nah, I'm just lucky to have eyes, unlike the majority of the ppl posting in this thread clearly.","replies":[]}]},{"poster":"Mandalorian 117","date":"2017-09-13T05:18:11.003+0000","up_votes":1,"down_votes":0,"body":"You must hate pugmaw, arcade riven, and pulsefire Caitlyn.","replies":[]},{"poster":"Snowyalice","date":"2017-09-17T01:42:49.808+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=cocacolalips,realm=NA,application-id=6kFXY1kR,discussion-id=00U3Ijto,comment-id=0000,timestamp=2017-09-12T22:35:27.898+0000)\n>\n> unpopular opinion:\n> \n> I really dislike all the recent skins that look nothing like the original champions, janna is a blond haired elf-ish caucasian white girl with skimpy clothes and a distinct staff, you replace her with a black haired asian chick? with a loose kimono of sort, a different haircut / skin tone and a sword for weapon? how is that janna? they look absolutely nothing alike, you might as well release a different champion all together.\n> \n> it&#x27;s a shame because the skin is pretty, but I won&#x27;t buy it because it&#x27;s not janna.\n\ndon't you know what skins are for?","replies":[]}]},{"poster":"Nylisa","date":"2017-09-13T01:53:47.023+0000","up_votes":6,"down_votes":2,"body":"Fiora , Janna and Yi skins are outstanding in terms of style and design! i absolutely love any eastern and Asian inspired skin/outfits in any game. they are so elegant and badass at same time.","replies":[]},{"poster":"NekoniClaws","date":"2017-09-13T02:04:35.410+0000","up_votes":2,"down_votes":1,"body":"She is absolutely dazzling, unbelievably elegant! The fact she has a sword she isn't unsheathing and is using instead as her enchanted staff- it practically creates its own lore. The real highlight of the skin line.","replies":[]},{"poster":"KrazyKavy","date":"2017-09-13T21:01:39.681+0000","up_votes":1,"down_votes":0,"body":"Tempest Janna is still a zillion times better than any Janna skin (Samurai Janna included) that has come out since.","replies":[]},{"poster":"rtbf32614226","date":"2017-09-13T19:00:31.044+0000","up_votes":1,"down_votes":0,"body":"Btw i think this color for \"Q\" would be much better. https://cdn1.savepice.ru/uploads/2017/9/13/46544f96d7d7920914d7174d7ad44192-full.jpg","replies":[]},{"poster":"rtbf225618241","date":"2017-09-13T13:40:19.786+0000","up_votes":1,"down_votes":0,"body":"But...how does that express anything from Janna? It doesn't change her VO which is one of my main appeals for Soraka plus the theme is literally \"Reaper\" so it made more sense at the time aswell when her Q was much more satisfying with the center extra damage+slow.\n\nThing is, she doesn't even use the sword in any way at all. She fires her attacks from her feet/legs and has extremely low damage potential compared to other Supports. As i said before, with the previous Q, Soraka was very powerful in the hands of a skilled played.\n\nI even almost got a Penta with her but the Quadra was taken away from me so i just finished off the Ace. >_<","replies":[]},{"poster":"StainedViolett","date":"2017-09-13T10:33:27.245+0000","up_votes":1,"down_votes":0,"body":"I love the skin and the alternate theme to Janna the only thing that concerns me a little is that the other 2 have homguards animations but Janna does not. Idk just seems a little odd","replies":[]},{"poster":"PurpleKingCrazy","date":"2017-09-13T04:33:26.921+0000","up_votes":1,"down_votes":0,"body":"Sword shadow Taliyah anyone? {{champion:163}} \n\nBut yeah, Janna skin looks pretty good too.","replies":[]}]}