{"poster":"General Noxx","date":"2017-11-29T19:37:02.651+0000","title":"¿Como iniciar en el Rol de Jungla?","subforum":"Guias y consejos","up_votes":5,"down_votes":0,"body":"Buenas a todos y bienvenidos a los que vienen a dar clases y los que tienen la misma duda. \r\n\r\nJuego de manera intermitente desde finales de la S5 y considero que en el rol que m&aacute;s me defiendo es de ADC y bastante bien de MID o TOP, pero si algo me ha quedado pendiente es aprender a Junglear y Supportear. \r\n\r\nTal vez algunos tengan la suerte de encontrar el cambio de rol muy natural, pero para mi las veces que he jugado de Jungla o Support fue como si cambiara el juego directamente, porque tanto en el micro como en el macrojuego se aplican cosas tan distintas que me cuesta visualizar el Cu&aacute;ndo o Porqu&eacute; de cada acci&oacute;n \r\n\r\nSe que el buen junglero debe manejar muy bien los tiempos de los recorridos y poder predecir de un vistazo al minimapa, saber las posibilidades de que el otro jungla vaya a caer en una linea o vaya a invadir nuestra jungla o cu&aacute;ndo estar relativamente &quot;seguros&quot; para invadir su jungla, etc.... y esto aunque parezca sencillo para los que solo se dedican a flamear al jungla porque no pudieron mantener su linea, es algo bastante m&aacute;s complejo para alguien que quiere hacerlo realmente bien y no tiene idea de c&oacute;mo.\r\n\r\nTodos sabemos que hay much&iacute;simos recursos en internet de donde sacar informaci&oacute;n, pero la verdad no he encontrado a&uacute;n algo que realmente me convenza, por eso quer&iacute;a consultarles a los Main Jungla o a los que han pasado por una situaci&oacute;n como la m&iacute;a y ya est&aacute;n Jungleando con total naturaleza &iquest;C&oacute;mo han empezado a junglear? \r\n\r\nTodos los tips, los recursos, lo que sea ser&aacute; bienvenido. Ya sean gu&iacute;as, youtubers, campeones, tips b&aacute;sicos, etc.\r\n\r\nDesde ya &iexcl;Muchas gracias a todos!\r\n\r\n{{sticker:galio-happy}}","replies":[{"poster":"Salvor","date":"2017-11-29T19:44:36.376+0000","up_votes":2,"down_votes":0,"body":"Es un mundo distinto. Te dejo esta guia, es larga, pero vale la pena.\nhttps://www.youtube.com/watch?v=KGCQAuKi2kE","replies":[{"poster":"Draenyll","date":"2017-11-29T20:25:01.732+0000","up_votes":2,"down_votes":0,"body":"Coincido en que jungla es de los roles más difíciles del juego. En sí los dos roles que mencionas tienen una característica principal que los relaciona, esto es, el dominio absoluto del macrojuego. Como main support te puedo decir que tenemos la mitad del trabajo que el jungla ya que solo controlamos uno de los lados de la jungla y la linea de mid. En todo momento se busca mantener al carry alejado y seguro de posibles amenazas. El de jungla es un rol que varia según tu estilo de juego, el cual en parte es determinado por el campeón que usas, pero si hay algo que siempre debe estar presente juegues el campeón que juegues, es un macrojuego que permita a tus aliados jugar con estrategia.","replies":[{"poster":"General Noxx","date":"2017-11-30T12:52:44.657+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Draenyll,realm=LAS,application-id=8sKIclmi,discussion-id=sdfeFBso,comment-id=00000000,timestamp=2017-11-29T20:25:01.732+0000)\n>\n> Coincido en que jungla es de los roles más difíciles del juego. En sí los dos roles que mencionas tienen una característica principal que los relaciona, esto es, el dominio absoluto del macrojuego. Como main support te puedo decir que tenemos la mitad del trabajo que el jungla ya que solo controlamos uno de los lados de la jungla y la linea de mid. En todo momento se busca mantener al carry alejado y seguro de posibles amenazas. El de jungla es un rol que varia según tu estilo de juego, el cual en parte es determinado por el campeón que usas, pero si hay algo que siempre debe estar presente juegues el campeón que juegues, es un macrojuego que permita a tus aliados jugar con estrategia.\n\n¡Totalmente de acuerdo! Yo hago lo contrario a la mayoría (como ADC)... busco darle lugar al supp a que haga roam o que esté tranquilo para poder ir a wardear o a asistir a alguien más sin pensar \"este se va a suicidar apenas salga de línea\". \n\nLas veces que he jugado de Supp (las pocas) casi siempre he perdido, no se ni como pararme ni que hacer realmente... recién las últimas partidas he podido progresar gracias a ver guías y leer un poco... de todas formas, Supp es un rol que al menos en este momento trato de evitar. Necesitas ser realmente muy bueno para sacar adelante a un Team que va por detrás y para eso hace falta tiempo y mucha práctica.\n{{sticker:galio-happy}} ","replies":[]}]},{"poster":"General Noxx","date":"2017-11-29T20:47:30.485+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Salvor Hardin,realm=LAS,application-id=8sKIclmi,discussion-id=sdfeFBso,comment-id=0000,timestamp=2017-11-29T19:44:36.376+0000)\n>\n> Es un mundo distinto. Te dejo esta guia, es larga, pero vale la pena.\n> https://www.youtube.com/watch?v=KGCQAuKi2kE\n\n¡Muchas gracias! voy a empezar por eso a ver que pasa.\n{{sticker:galio-happy}} ","replies":[]},{"poster":"GDPhyros","date":"2017-11-30T01:22:15.444+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Salvor Hardin,realm=LAS,application-id=8sKIclmi,discussion-id=sdfeFBso,comment-id=0000,timestamp=2017-11-29T19:44:36.376+0000)\n>\n> Es un mundo distinto. Te dejo esta guia, es larga, pero vale la pena.\n> https://www.youtube.com/watch?v=KGCQAuKi2kE\n\nel video esta exelente, pero OJO que esta desactualisado en cuanto a datos de experiencia y rutas, en general es casi lo mismo pero hay  mas rutas para lvl 3, y eso te puede complicar el trackeo y comerte un counter gank","replies":[]}]},{"poster":"Barrik Gold","date":"2017-12-03T18:49:12.545+0000","up_votes":1,"down_votes":0,"body":"Te dejo un video.. El tipo tiene varios videos explicando el rol y explica super bien!! Te lo recomiendo\nhttps://youtu.be/wFc1QY6S-S0","replies":[]},{"poster":"GØD Leviatán","date":"2017-11-30T15:42:55.297+0000","up_votes":1,"down_votes":0,"body":"Yo empece con teemo en jg. Nunca me ha ido mal con él. Si quieres un campeón que pueda ayudar lo mas rápido que pueda a las lineas para evitar Gankeos enemigos o para acabar rápido con el peligro, usa a Hecarim o a Warwick que relativamente son campeones básicos, fáciles y rápidos de usar.\nSi quieres ser buen jungla depende de vos, yo se ir jg naturalmente con cualquier campeón que me digas ya (exceptuando los que realmente no pueden con ella) realmente no es muy difícil y si te flamean o algo no le respondas, solo trata de solucionarlo, aunque a veces no hay caso, depende el tipo de persona que sea, si es flammer a lo hard no se podrá, si solo pierde porque no es bueno trata de hacer lo posible, sin campear, sin kill no podes hacer nada....(hablando de los adc flammer de todos los días)\nSi quieres que te enseñe lo poco que se, agregame, hare lo que pueda... soy plata, no pidas demasiado jaja.\n\n\"Me temen, hacen bien...\" {{champion:19}}","replies":[]}]}