{"poster":"Revilous","date":"2015-06-29T16:25:34.062+0000","title":"COMMUNITY-MARKT (besserer Vorschlag als der andere Post)","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Hi Freunde\r\n\r\nErstmal eine kurze Frage: Wieso ist der andere Post im Foren Feedback?\r\n\r\nNaja jetzt zu meiner Idee: Ich finde man sollte im Community Markt mit Champs, Skins und Symbolen f&uuml;r RP handeln. Also das funktioniert so wie ein Auktionshaus. Einer stellt z.b. Bard rein f&uuml;r 900 RP und dann k&ouml;nnen alle bieten. Etwas reinzustellen w&uuml;rde dann 100 RP kosten. Irgendwann kommt jemand und bietet 970 RP und kauft sich Bard und hat dann ganze 5 RP gespart.\r\n\r\nNat&uuml;rlich k&ouml;nnte dann Riot Verluste machen aber pff ist doch egal. Haupts&auml;chlich geht es darum, dass man die M&ouml;glichkeit hat, Spieler Reich zu machen indem man deren seltene Skins kauft wie z.b. Championship Riven daf&uuml;r w&uuml;rde ich 100.000 RP ausgeben kein Schei&szlig;! Des weiteren ist das auch f&uuml;r Spieler praktisch, die zu viele EP haben und dann einfach Champions verkaufen. Dadurch bekommen sie RP und k&ouml;nnen wieder die EP ausgeben. Andere Spieler haben eine billige Alternative an Champs zu kommen wenn sie keine haben.\r\n\r\nBei den Symbolen kann man nat&uuml;rlich nicht alle einfach Verkaufen wie die League Reward Symbole (sonst w&uuml;rden sich Bronze Spieler Challenger Symbole kaufen lel) oder Teambuilder Reward Symbole. Aber eine Vielzahl k&ouml;nnte man dann schon zum Handel anbieten.\r\n\r\nAu&szlig;erdem ist das eine M&ouml;glichkeit an RP zu kommen ohne Etwas tun zu m&uuml;ssen. Die 100 RP zum Reinstellen hat man noch von den AnfangsRP. Das hat f&uuml;r alle nur Vorteile! (Au&szlig;er f&uuml;r Riot) Wer ist daf&uuml;r?\r\n\r\nmfG","replies":[{"poster":"my clone did it","date":"2015-06-29T16:45:53.002+0000","up_votes":1,"down_votes":0,"body":"Hi bin der Verfasser des anderen Vorschlags ich finde man sollte es begrenzen wie oft sonst wird riot es glaube ich nicht einführen","replies":[{"poster":"Revilous","date":"2015-06-29T16:52:04.369+0000","up_votes":1,"down_votes":0,"body":"Hi wie gehts","replies":[]}]},{"poster":"ThanhSon","date":"2015-06-29T16:32:15.773+0000","up_votes":1,"down_votes":0,"body":"Und warum sollte es Riot  tun, wenn es keine Vorteile für Riot  bringt?","replies":[]},{"poster":"Busty Botter","date":"2015-06-29T16:29:18.543+0000","up_votes":1,"down_votes":0,"body":"also soll rito an allen die 100k+ IP haben nichts verdienen, weil sie immer champs kaufen und diese verkaufen und für die RP dann neue skins kaufen können? gg wp xD\nalso noch mehr gründe die ganzen IP farmbots laufen zu lassen. \n\nkauft euch rp einfach oder lasst es!","replies":[]}]}