{"poster":"Revilous","date":"2018-04-24T16:48:17.994+0000","title":"chatban würdig?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":5,"body":"Spiel 1\r\nRevilous: atleast they arent smurfing so theres a chance they wont do this strat correctly\r\nRevilous: they cant kill me early anyway, lulu has not enough dmg\r\nRevilous: but they will 2v2 top\r\nRevilous: farm top and jungle\r\nRevilous: twitch will be super ahead\r\nRevilous: even without kills\r\nRevilous: then he does penta in teamfight\r\nRevilous: and im useless since i couldnt do anything in lane\r\nRevilous: im begging for help and your answer is &quot;muted &quot; nice\r\nRevilous: he has same level and double my farm now gg\r\nRevilous: well lets just ff\r\nRevilous: you&#039;re clearly not good enough to win against this strategie\r\nRevilous: sucks how easy it works in low elo\r\nRevilous: thanks for all the help team\r\nRevilous: twitch 57 cs haha\r\nRevilous: wp\r\nRevilous: thanks for waiting in the bush until i die\r\nRevilous: instead of helping\r\nRevilous: nice\r\nRevilous: YES\r\nRevilous: I AM\r\nRevilous: AND YOURE THE&sect;\r\nRevilous: k ill int\r\nRevilous: ff 15\r\nRevilous: idc\r\nRevilous: i int\r\nRevilous: give this ali his desired loss\r\nRevilous: i hope twitch does a pentakill i really do\r\nRevilous: &quot;ignore top&quot;\r\nRevilous: &quot;muted&quot;\r\nRevilous: thanks team\r\nRevilous: you dont like to win\r\nRevilous: press yes\r\nRevilous: why\r\nRevilous: im inting anyway\r\nRevilous: its 4v6 why press no\r\nRevilous: ok im not inting\r\nRevilous: press yes anyway pls\r\nRevilous: but press no?\r\nRevilous: why\r\nRevilous: PRESS NO PLS\r\nRevilous: WHY\r\nRevilous: haha\r\nRevilous: idk how much time you want to waste\r\nRevilous: just report ali and go next\r\nRevilous: any children is smarter than this alistar but its not hard\r\nRevilous: make sure to report ali\r\nRevilous: he flamed me in laning\r\nRevilous: and is the reason i inted\r\n\r\nDas ist alles. das &quot;int&quot; war nicht als tats&auml;chlich absichtliches feeden gemeint, sondern, dass ich keine chance hatte zu &uuml;berleben. Das einzige wirklich toxische ist &quot;any children is smarter than this alistar but its not hard&quot;, daf&uuml;r wird man normalerweise nicht gebannt, weil es keine schlimmen W&ouml;rter enth&auml;lt. Wieso also?? Mein honor 4 hat so ewig gedauert und alles umsonst...","replies":[{"poster":"Sirrkas","date":"2018-04-25T17:28:08.444+0000","up_votes":3,"down_votes":0,"body":">Wie ich auch schon gesagt habe, weiß ich das. Es geht nur darum, dass die anderen in dem Spiel überhaupt keinen Wert auf Toxicity legen können, weil sie mich selber als \"cancerbad\", \"faggot\", \"hardstuck\" etc bezeichnet haben. Warum sollten sie mich also für toxicity reporten, wenn sie selber ne milliarde mal toxischer sind? Macht keinen Sinn. Logischerweise haben sie mich nur für feeden reportet, für sonst nichts. Sie waren verärgert, dass Ich ihnen das Spiel verloren habe.\n\nGanz einfach. Auch Flamer finden Flame von anderen schlimm. Nur weil sie selber toxisch sind, heißt es nicht, dass sie andere nicht dennoch korrekt als Flamer etc. einstufen können oder sich nicht an anderem Flame stören. Wenn ich mir die ganzen Beiträge zu angeblich ungerechten Strafen so ins Gedächtnis rufe, wird auch ziemlich gut ein Bild davon gezeichnet, dass der gemeine Flamer, eben sehr wohl vom Flame anderer gestört wird. Aus irgendeinem Grund nehmen sie aber meist nicht ihr eigenes Fehlverhalten als störend war. Es sind immer die anderen die Bösen, nie man selbst. \n\nZudem wurdest du wohl kaum nur für Sabotage gemeldet, ich gehe zumindest davon aus, dass dein Chatlog nur dann auf Beleidigungen, Blame und ähnliches untersucht wird, wenn du auch dafür gemeldet wurdest. \nFür Sabotage also worunter int. Feeding fällt, würde man sofort einen 2 Wochenbann erhalten. Du hast hier nur eine CR erhalten, also wurdest du für dein Chatverhalten bestraft. Und damit du darauf untersucht wirst, wird dich jemand dafür gemeldet haben. \n\n>Zudem halte ich es nicht für angebracht zu flamen. Ganz im Gegenteil, mit Honor level 4 und über 40 Schlüssel hielt ich mich eigentlich für einen der freundlicheren Spieler der Kluft. Daher flame ich auch nie und verstehe auch nicht, wieso du denkst, dass ich geflamt hätte. Glaubst du, ich habe was ausgelassen in dem Chatlog? Ich kann dir gerne nen Screenshot machen.\n\nAuch Blame fällt unter toxischen Chat. Man muss nicht beleidigen um zu den Flamern zu zählen. Wobei diese Zeile hier\n\n>Revilous: any children is smarter than this alistar but its not hard\n\ndurchaus auch als Beleidigung angesehen werden kann. Im Grunde hast du \"idiot\" umschrieben. \n\nIch glaube dir gerne, dass du deinen eigenen Chatlog nicht als Flame ansiehst oder als nichts bestrafungswürdiges. Das heißt aber eben nicht, dass es auch so ist, da hier als Maßstab nicht die Meinung des gemeldeten Spielers genommen wird, sondern eher die Meinung der Community als ganzes. \n\n>Edit. Wieso funtkioniert die Antwort funktion nicht mehr\n\nDas Forum mag es nicht, wenn zu viele Antworten ineinander geschachtelt werden, irgendwann verschiebt es dann die Antwort auf den falschen Platz.","replies":[]},{"poster":"Lotuskobra","date":"2018-04-24T20:14:04.154+0000","up_votes":3,"down_votes":0,"body":"Hmm, da dürfte scheinbar jemand gegen die koreanische Boostingstrategie spielen mit Support Top und Yi oder Twitch im Jungle. Aus Erfahrung schonmal mein Beileid, ich dürfte das auch schon miterleben und mich anschließend von meinem Team beleidigen lassen, obwohl ich es ihnen vorher, so wie du erklärt habe und alle Schritte beschrieben habe, die passieren werden.\n\nEs gibt zwischen uns beiden nur einen kleinen aber feinen Unterschied:\n\nIch hab damals, obwohl ich mir nur neagtiven Müll anhören musste, alle gemutet, mich so gut es ging mit der Situation abgefunden und meine Lane unterm Tower verbracht. Hab mir gefühlt 20 Pinkwards gekauft und bin im gesamten Spiel nur 3 mal gestorben – im Gegensatz zu meinem Jungler, der damals als Wukong glaube ich 14 oder 15 Tode hatte und irgendwann auf meine Lane kam um mit mir zusammen \"Spaß zu haben\".\n\nIch habe das ganze Game über nichts geschrieben (außer meine Predictions in der Champselect), habe am Ende des Spiels 3 von 4 Teammitgliedern reported und meinen ADC geadded. Der gute Mann, wie ich dann feststellen dürfte Österreicher und Draven Main, war der einzige, der nicht geflamet hat, dem ich Leid tat und der unser Team auch nicht verstanden hat.\n\nDu hast mit dem was du schreibst an sich Recht, nur erwartest du zu viel und lässt deine Gedanken ungefiltert raus, warum? Wenn dein Team zu schlecht dafür ist, so etwas zu verstehen, warum dann noch rumflamen und die Leute, die offensichtlich nicht den geringsten Schimmer haben, was sie reden einfach muten und gut ist?\n\nEin verlorenes Spiel ist nicht schlimm. Den eigenen Computer anschreien oder der eigenen Katze sagen, dass alle behindert im Oberstübchen sind ist auch nicht schlimm, ABER es im Chat zu schreiben bringt dir nichts – außer eben eine Strafe.\n\nLass die Leute in ihrer Unwissenheit versauern, entspann dich und die Sache hat sich.\n\nWenn du ab dem \"then he does penta in teamfight\" nix mehr schreibst, ist alles gut und niemand würde dich dafür im Forum nur ansatzweise bestrafen wollen. Du hast etwas versucht taktisch zu erklären, aber dein Team hat es schlichtweg nicht verstanden. Happens, Mund abputzen, weitermachen :)","replies":[]},{"poster":"Izaya Kumiho","date":"2018-04-24T16:56:43.848+0000","up_votes":2,"down_votes":0,"body":">Revilous: sucks how easy it works in low elo\nRevilous: twitch 57 cs haha\nRevilous: k ill int\nRevilous: ff 15\nRevilous: i int\nRevilous: give this ali his desired loss\nRevilous: just report ali and go next\nRevilous: any children is smarter than this alistar but its not hard\nRevilous: make sure to report ali\nRevilous: he flamed me in laning\nRevilous: and is the reason i inted\n\nDrohung, negative Bemerkungen..","replies":[{"poster":"Revilous","date":"2018-04-24T17:22:53.930+0000","up_votes":2,"down_votes":2,"body":"mein Team wollte mir top nicht helfen, ist doch klar dass ich da feede gegen duotop, die mich permanent diven. Sorry, dass ich das angedroht habe, man sollte mir dafür wohl gleich den Perma geben wenns nach dem Forum hier ginge. Vielleicht bin ich blind aber ich sehe keine negativen Bemerkungen oder sonst toxicity die auch nur ansatzweise chatbann würdig sind..?","replies":[{"poster":"Izaya Kumiho","date":"2018-04-24T17:47:26.459+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=00010000,timestamp=2018-04-24T17:22:53.930+0000)\n> Vielleicht bin ich blind aber ich sehe keine negativen Bemerkungen oder sonst toxicity die auch nur ansatzweise chatbann würdig sind..?\n\n^Quasi alles, was ich dir rauskopiert habe.\n\nEhem.\n\n>Revilous: any children is smarter than this alistar but its not hard\n\noder:\n>Revilous: make sure to report ali\n>Revilous: and is the reason i inted","replies":[{"poster":"Revilous","date":"2018-04-24T18:04:39.579+0000","up_votes":1,"down_votes":0,"body":">Revilous: sucks how easy it works in low elo\nRevilous: twitch 57 cs haha\nRevilous: k ill int\nRevilous: ff 15\nRevilous: i int\nRevilous: give this ali his desired loss\nRevilous: just report ali and go next\nRevilous: any children is smarter than this alistar but its not hard\nRevilous: make sure to report ali\nRevilous: he flamed me in laning\nRevilous: and is the reason i inted\n\nDu hast mir bloß das rauskopiert.","replies":[{"poster":"Izaya Kumiho","date":"2018-04-24T18:23:46.700+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=0001000000010000,timestamp=2018-04-24T18:04:39.579+0000)\n>\n> Du hast mir bloß das rauskopiert.\n\nOrly?\n\nDann lies es dir bitte nochmal durch. Ich kopier dir das nicht zum Spaß :O","replies":[]}]}]},{"poster":"Darkr3sQ","date":"2018-04-24T17:31:29.280+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=00010000,timestamp=2018-04-24T17:22:53.930+0000)\n>\n> mein Team wollte mir top nicht helfen, ist doch klar dass ich da feede gegen duotop, die mich permanent diven. Sorry, dass ich das angedroht habe, man sollte mir dafür wohl gleich den Perma geben wenns nach dem Forum hier ginge. Vielleicht bin ich blind aber ich sehe keine negativen Bemerkungen oder sonst toxicity die auch nur ansatzweise chatbann würdig sind..?\n\nAch, und die Teammates rundmachen ist nicht toxisch?","replies":[]}]}]},{"poster":"LiebesWölkchen","date":"2018-04-24T16:53:25.922+0000","up_votes":3,"down_votes":2,"body":"\"make sure to report ali\"\nZum reporten auffordern ist harrasment.\nDann noch das \"i int\" , das rumgemecker das keiner ff voted , capslock , runtermachen deiner mates.\nVerdient gebannt.","replies":[{"poster":"Revilous","date":"2018-04-24T17:19:22.748+0000","up_votes":2,"down_votes":2,"body":"die haben gefragt wen sie reporten soll. Ich habe jemanden genannt und begründet.  \"i int\" war weil ich sooft gestorben bin um meinem Team mitzuteilen, dass ich keine chance gegen lulu twitch duotop habe. Mein Team hat gemeint, dass ich das game verliere, daher habe ich gefragt, warum sie dann nicht surrendern wenn sie mit mir keine chance haben. Auch, weil das game tatsächlich verloren war. Capslock bin ich ein bisschen ausgerastet, als alistar sich in den busch toplane gestellt hat, ich twitch und lulu gebaitet habe und er mich dann sterben lassen hat ohne etwas zu tun, danach hat er gesagt \"nvm riven is cancerbad, ignore top\" was quasi das todesurteil war für mich, da ich keine chance habe gegen twitch lulu.\n\nJa ich habe mein team runtergemacht, aber nur, damit sie mir top helfen, nachdem meine Hilferufe nicht erhört wurden, bzw. mit \"muted\" erwiedert wurden. Das kann man vielleicht als toxic bezeichnen, aber wohl als extrem geringe toxicity, die niemals chatban würdig ist. Mein Lehrer macht uns härter runter, das juckt auch niemanden, weils einfach überhaupt nicht schlimm ist.\n\nIch weiß ja wie ihr Gutmenschen hier im Forum so drauf seid und vermutlich hat der Post auch schon ein paar downvotes, aber dass dieser Chatlog auch nur ansatzweise toxic ist, könnt ihr wohl keinem erzählen.","replies":[{"poster":"Darkr3sQ","date":"2018-04-24T17:30:51.936+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=00000000,timestamp=2018-04-24T17:19:22.748+0000)\n>\n> die haben gefragt wen sie reporten soll. Ich habe jemanden genannt und begründet.  &quot;i int&quot; war weil ich sooft gestorben bin um meinem Team mitzuteilen, dass ich keine chance gegen lulu twitch duotop habe. Mein Team hat gemeint, dass ich das game verliere, daher habe ich gefragt, warum sie dann nicht surrendern wenn sie mit mir keine chance haben. Auch, weil das game tatsächlich verloren war. Capslock bin ich ein bisschen ausgerastet, als alistar sich in den busch toplane gestellt hat, ich twitch und lulu gebaitet habe und er mich dann sterben lassen hat ohne etwas zu tun, danach hat er gesagt &quot;nvm riven is cancerbad, ignore top&quot; was quasi das todesurteil war für mich, da ich keine chance habe gegen twitch lulu.\n> \n\nGanz ehrlich: wenn Du erst einmal breit erklären musst, wie Du etwas gemeint hast damit es nicht negativ klingt, solltest Du an Deiner Kommunikation arbeiten. Solche Sachen solltest Du vielleicht im Spiel anders verpacken, dann braucht es keine Erklärung dazu und es kommt nicht zu Missverständnissen.\n\n> Ja ich habe mein team runtergemacht, aber nur, damit sie mir top helfen, nachdem meine Hilferufe nicht erhört wurden, bzw. mit &quot;muted&quot; erwiedert wurden. Das kann man vielleicht als toxic bezeichnen, aber wohl als extrem geringe toxicity, die niemals chatban würdig ist. Mein Lehrer macht uns härter runter, das juckt auch niemanden, weils einfach überhaupt nicht schlimm ist.\n> \n\nAch, und als Du Deine Teammates rund gemacht hast, haben sie Dir mit Freude geholfen? Hat Dein Rund-machen irgendetwas verbessert?\nMag sein, dass Du das nicht als Schlimm empfindest, und klar gibt es immer jemanden der schlimmer ist. Der Fakt, dass Du dafür reportet wurdest zeigt aber, dass es sehr wohl andere Juckt.\n\n> Ich weiß ja wie ihr Gutmenschen hier im Forum so drauf seid und vermutlich hat der Post auch schon ein paar downvotes, aber dass dieser Chatlog auch nur ansatzweise toxic ist, könnt ihr wohl keinem erzählen.\n\nJa, jetzt kommt wieder die Gutmenschen Schiene. Du kannst mir nicht erzählen, dass der Chatlog absolut nicht toxisch ist. Die Teammates runtermachen, auch wenn Du das als nicht schlimm erachtest, fällt unter toxisch. Ob Du es wahr haben willst oder nicht.\nNur so ein kleiner Tipp von mir: Wenn Du Dein Chatverhalten nicht schleunigst änderst, dauert es nicht lange, und wir haben hier einen Thread, ob der Chatlog einen Perma rechtfertigt.","replies":[{"poster":"Revilous","date":"2018-04-24T17:58:01.546+0000","up_votes":2,"down_votes":2,"body":"Ich spiele seit 5 Jahren und nur auf diesem Account und das ist mein erster Chatban, davor war ich Honorlevel 4. Der Chatlog ist tatsächlich nicht toxic, ich chatte öfters so und wir in low dia bezeichnen uns doch gegenseitig die ganze Zeit als hardstuck etc., heißt, wir machen uns ständig gegenseitig runter aber das juckt niemanden. Und ja, es hat \"geholfen\", falls Alistar nicht die ganze Zeit schon vorhatte, mich zu trollen. Er kam nämlich top, auch wenn er mir dann nur beim sterben zugeschaut hat um mich anschließend zu flamen.\n\nIhr seid die einzigen, den ich erklären muss, wie es gemeint ist. Ihr seid auch die einzigen, die diesen Chatlog als toxic erachten. Daher auch \"die Gutmenschen Schiene\". Ich bin schon länger und oft im Forum, daher weiß ich auch, wie ihr drauf seid und wollte aber schauen, ob ihr selbst diesen Chatlog als toxic erachtet.","replies":[{"poster":"Darkr3sQ","date":"2018-04-24T18:25:39.089+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=0000000000000000,timestamp=2018-04-24T17:58:01.546+0000)\n>\n> Ich spiele seit 5 Jahren und nur auf diesem Account und das ist mein erster Chatban, davor war ich Honorlevel 4. Der Chatlog ist tatsächlich nicht toxic, ich chatte öfters so und wir in low dia bezeichnen uns doch gegenseitig die ganze Zeit als hardstuck etc., heißt, wir machen uns ständig gegenseitig runter aber das juckt niemanden. Und ja, es hat &quot;geholfen&quot;, falls Alistar nicht die ganze Zeit schon vorhatte, mich zu trollen. Er kam nämlich top, auch wenn er mir dann nur beim sterben zugeschaut hat um mich anschließend zu flamen.\n> \n> Ihr seid die einzigen, den ich erklären muss, wie es gemeint ist. Ihr seid auch die einzigen, die diesen Chatlog als toxic erachten. Daher auch &quot;die Gutmenschen Schiene&quot;. Ich bin schon länger und oft im Forum, daher weiß ich auch, wie ihr drauf seid und wollte aber schauen, ob ihr selbst diesen Chatlog als toxic erachtet.\n\nDa Du reportet wurdest, zeigt doch dass nicht nur wir uns an dem Chatlog stören, sondern auch die Mitspieler.","replies":[{"poster":"Revilous","date":"2018-04-24T18:44:08.944+0000","up_votes":2,"down_votes":0,"body":"nee die haben ja noch krasser geflamt, was die gestört hat war, dass ich nicht 1v2 die toplane gewonnen hab","replies":[{"poster":"Don Brando","date":"2018-04-24T20:12:34.073+0000","up_votes":4,"down_votes":1,"body":"Ich weiß nicht wie verdreht dein innerer Kompass sein muss, um den Chat nicht als toxisch zu erkennen und sich dann noch zurecht zu legen warum man denn, wenn nicht dafür, reportet wurde. Ich hoffe für dich, das ändert sich bald. Sonst wird eine Chatsperre in LoL das geringste Problem sein, was dich in Zukunft vor Herausforderungen stellt ;)","replies":[]},{"poster":"Darkr3sQ","date":"2018-04-24T18:46:41.188+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=000000000000000000000000,timestamp=2018-04-24T18:44:08.944+0000)\n>\n> nee die haben ja noch krasser geflamt, was die gestört hat war, dass ich nicht 1v2 die toplane gewonnen hab\n\nJa und? Nur weil andere krasser flamen als Du darfst Du straffrei toxisch sein? Unrecht rechtfertigt kein Unrecht.","replies":[{"poster":"Revilous","date":"2018-04-24T20:49:31.434+0000","up_votes":2,"down_votes":0,"body":"nein, es ging bloß darum, dass meinen teammates mein flaming herzlich egal war und die mich bloß fürs feeden reportet haben.\n\n>Da Du reportet wurdest, zeigt doch dass nicht nur wir uns an dem Chatlog stören, sondern auch die Mitspieler.","replies":[{"poster":"Darkr3sQ","date":"2018-04-24T20:52:55.421+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=00000000000000000000000000000000,timestamp=2018-04-24T20:49:31.434+0000)\n>\n> nein, es ging bloß darum, dass meinen teammates mein flaming herzlich egal war und die mich bloß fürs feeden reportet haben.\n\nDie reporten Dich also wenn Du feedest mit dem Grund für Flaming?","replies":[{"poster":"Revilous","date":"2018-04-24T21:23:46.966+0000","up_votes":2,"down_votes":1,"body":"Man reportet immer für \"negative Einstellung\", \"Beleidigung\" und \"absichtlich dem Gegner zugespielt\" wenn man denkt, dass derjenige das Spiel verloren hat. Du spielst nicht viel Ranked oder?","replies":[{"poster":"Angel Ayume","date":"2018-04-24T21:38:46.981+0000","up_votes":2,"down_votes":0,"body":"Woher willst du denn wissen, dass ihre Intention hinter dem Report NUR auf dem Feeding lag? \nNur weil sie sagen, sie reporten dich fürs feeden heißt das nicht, dass ihnen dein Gebrabbel im Chat egal war.. ^^","replies":[{"poster":"eingew","date":"2018-04-25T04:10:11.454+0000","up_votes":1,"down_votes":0,"body":"Es heißt nebenbei bemerkt übrigens auch nicht, dass sie einen tatsächlich fürs \"Feeden\" reporten.","replies":[{"poster":"Angel Ayume","date":"2018-04-25T05:27:37.025+0000","up_votes":1,"down_votes":0,"body":"Exactly.","replies":[]}]}]},{"poster":"Mad Loony","date":"2018-04-24T21:45:24.515+0000","up_votes":1,"down_votes":6,"body":"Stimmt. Mir ist auch aufgefallen, dass man eigentlich immer für 3 Dinge gleichzeitig reportet wird. Wenn man schlecht Spielt wird man also automatisch von irgendwem für negativ sein und flame reportet. Das löst dan Chatfilter aus, ohne das es irgend jemandes intention war.\n\nDer Chatfilter findet dann eigentlich immer irgend etwas toxisches, auch wenn man nur gg oder gj schreibt und schon bekommt man ne CR.","replies":[{"poster":"Sirrkas","date":"2018-04-24T22:11:29.205+0000","up_votes":4,"down_votes":1,"body":"Ihr redet beide wieder nur Unsinn. Keiner von euch kann wissen, wofür ihr gemeldet werdet. Ihr könntet für nur einen Grund gemeldet werden oder für 3 verschiedene. Vor allem der Teil von dir, von wegen, man wird für gj und gg bestraft ist an den Haaren herbeigezogen. \n\nWenn man dafür immer bestraft werden würde, hätte ich schon längst einen Permabann. Ich wurde nämlich schon oft genug gemeldet und mein Chatlog besteht fast immer aus \"gl hf\" \"gg\" und \"gj\". Jetzt musst du mir erklären, warum ich noch keine 3 Permabanns habe, wenn ich für gj doch immer bestraft werden würde.","replies":[{"poster":"Revilous","date":"2018-04-25T06:51:34.839+0000","up_votes":2,"down_votes":2,"body":"Alle haben geflamt in dem Game, ich war mit Abstand der freundlichste. Ich garantiere dir, es ist 90% der Leute in der SoloQ scheißegal, was ich geschrieben habe, hätten wir gewonnen oder hätte ich besser gespielt, hätte ich auch keine CR. Ich schreibe öfters wie hier, wurde aber noch nie gebannt weil ich normalerweise nicht so feede und daher auch nur selten reportet werde. Ich war davor Honor level 4 weil die Leute mich honoren selbst wenn ich sie davor noch als Retards beschimpft habe, hauptsache ich hab das Spiel gecarried.","replies":[{"poster":"Darkr3sQ","date":"2018-04-25T08:16:26.788+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tabbian,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=00000000000000000000000000000000000000000001000000000001,timestamp=2018-04-25T07:16:29.415+0000)\n>\n> Tatsächlich soll es im Moment so sein, dass jeder Report eine Überprüfung auslöst.\n\nHast Du da eine Quelle zu?\nZumindest würde hier der Fakt widersprechen, dass im Chatlog mehr als ein Spiel angegeben werden, sofern es sich nicht um einen Report bezüglich Hassrede handelt.","replies":[]},{"poster":"HHaie tabbian","date":"2018-04-25T07:16:29.415+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZcDQ0Dt6KV,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=00000000000000000000000000000000000000000001000000000000,timestamp=2018-04-25T07:08:39.200+0000)\n> Nicht jeder Report löst direkt eine Prüfung und eine Strafe aus.\n\nTatsächlich soll es im Moment so sein, dass jeder Report eine Überprüfung auslöst.","replies":[]},{"poster":"Darkr3sQ","date":"2018-04-25T07:08:39.200+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=0000000000000000000000000000000000000000000100000000,timestamp=2018-04-25T06:51:34.839+0000)\n>\n> Alle haben geflamt in dem Game, ich war mit Abstand der freundlichste. Ich garantiere dir, es ist 90% der Leute in der SoloQ scheißegal, was ich geschrieben habe, hätten wir gewonnen oder hätte ich besser gespielt, hätte ich auch keine CR. Ich schreibe öfters wie hier, wurde aber noch nie gebannt weil ich normalerweise nicht so feede und daher auch nur selten reportet werde. Ich war davor Honor level 4 weil die Leute mich honoren selbst wenn ich sie davor noch als Retards beschimpft habe, hauptsache ich hab das Spiel gecarried.\n\nUnd woher nimmst Du diese absolute Gewissheit?\nWo bitteschön kannst Du sehen, wann Du reportet wurdest und wann nicht?\nNicht jeder Report löst direkt eine Prüfung und eine Strafe aus. Das siehst Du alleine schon an dem Umstand, dass bei Strafen teilweise Chatlog aus bis zu 3 Spielen aufgeführt sind. Wenn das Verhältnis gespielte Spiele in Relation zu reporteten Spielen einen gewissen Grenzwert - abgesehen bei dem Punkt Hassrede -  übersteigt, kommt die Prüfung. Du kannst also nicht sagen, dass Du nur selten reportet wirst wenn Du das Spiel carriest.","replies":[]},{"poster":"Revilous","date":"2018-04-25T14:49:47.531+0000","up_votes":1,"down_votes":1,"body":"> Wie schon gesagt, das tut nichts zur Sache. Es ist egal ob du Rang 1 der schlimmsten Flamer in diesem Spiel warst oder Rang 10. Hast du geflamt, rechne mit einer Strafe. Selbst wenn absolut jeder außer dir in dem Spiel den anderen den Tod gewünscht hätte, wäre deine Strafe noch angebracht, da du mitgeflamt hast. \n\nWie ich auch schon gesagt habe, weiß ich das. Es geht nur darum, dass die anderen in dem Spiel überhaupt keinen Wert auf Toxicity legen können, weil sie mich selber als \"cancerbad\", \"faggot\", \"hardstuck\" etc bezeichnet haben. Warum sollten sie mich also für toxicity reporten, wenn sie selber ne milliarde mal toxischer sind? Macht keinen Sinn. Logischerweise haben sie mich nur für feeden reportet, für sonst nichts. Sie waren verärgert, dass Ich ihnen das Spiel verloren habe.\n\nZudem halte ich es nicht für angebracht zu flamen. Ganz im Gegenteil, mit Honor level 4 und über 40 Schlüssel hielt ich mich eigentlich für einen der freundlicheren Spieler der Kluft. Daher flame ich auch nie und verstehe auch nicht, wieso du denkst, dass ich geflamt hätte. Glaubst du, ich habe was ausgelassen in dem Chatlog? Ich kann dir gerne nen Screenshot machen.\n\nEdit. Wieso funtkioniert die Antwort funktion nicht mehr","replies":[]},{"poster":"Sirrkas","date":"2018-04-25T10:35:10.977+0000","up_votes":1,"down_votes":1,"body":">Alle haben geflamt in dem Game, ich war mit Abstand der freundlichste.\n\nWie schon gesagt, das tut nichts zur Sache. Es ist egal ob du Rang 1 der schlimmsten Flamer in diesem Spiel warst oder Rang 10. Hast du geflamt, rechne mit einer Strafe. Selbst wenn absolut jeder außer dir in dem Spiel den anderen den Tod gewünscht hätte, wäre deine Strafe noch angebracht, da du mitgeflamt hast. \n\n>Ich garantiere dir, es ist 90% der Leute in der SoloQ scheißegal, was ich geschrieben habe, hätten wir gewonnen oder hätte ich besser gespielt, hätte ich auch keine CR.\n\nDas bezweifle ich doch stark. Es ist gut möglich, dass man öfter gemeldet wird, wenn man verliert, aber das heißt noch lange nicht, dass es niemanden juckt, wenn du bei einem Sieg toxisch warst. Es kann ja sein, dass du dich nicht für Flame interessierst, solange das Spiel gut läuft, aber da du es für angebracht gehalten hast du flamen, wird dich Flame wohl doch jucken.","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"LiebesWölkchen","date":"2018-04-24T18:13:05.187+0000","up_votes":2,"down_votes":0,"body":"DU wurdest gechatbannt also erzähl mir nicht was toxic ist und was nicht ,weil anscheinend hast du vollkommen den zusammenhang zu dem wort TOXIC verloren wenn du deinen chatverlauf da als \"normal\" ansiehst.","replies":[]}]}]},{"poster":"Alustus","date":"2018-04-24T18:55:19.868+0000","up_votes":2,"down_votes":0,"body":"Verdient.\nNur weil etwas nicht so läuft wie du es willst heulst du rum und versucht/Machst Spielern die vllt noch Spaß am Spiel haben diesen auch noch kaputt.\n\nDas ist wie wenn du bei \"Mensch ärgere dich nicht\" das Spielbrett umwirfst weil du am verlieren bist, ganz egal ob die anderen 3 Spieler noch spielen wollen.\nAlles andere als die feine Art.\nOder wenn du bei Fußballspielen anfängst eigentore zu schießen weil dein Team nicht das macht was du willst. ( Da du zumindest nach Chatlog absichtlich gefeedet hast)\n\nNur weil du die Mitspieler nicht kennst und ihnen auch nicht in die Augen siehst, hast du kein Recht darauf dich ihnen gegenüber wei ein A... zu verhalten.","replies":[{"poster":"Revilous","date":"2018-04-24T19:13:57.977+0000","up_votes":1,"down_votes":3,"body":"Ich habe nicht absichtlich gefeedet, das \"i int\" war so gemeint, dass ich ständig sterbe weil ich 1v2 toplane spielen musste und die permanent gedived haben. \n\nDas ist wie wenn du bei \"Mensch ärgere dich nicht\" ständig ausgelassen wirst, es niemanden juckt und dir dann erklärt wird, wie schlecht du eigentlich bist. Du dann sagst, \"ich kann so nicht gewinnen\" und dir dafür jemand den Mund zuklebt, damit du aufhörst zu schimpfen.\nOder wenn du bei Fußballspielen alleine gegen 11 spielen musst und deine eigentlichen Mitspieler dich von der Bank aus vollschimpfen, weil du keine Tore schiest. Und dann sagst du \"ich verliere\", um deinen Mitspielern mitzuteilen, dass du, nunja, verlierst, weil diese ja anscheinend denken, dass du gegen 11 gewinnen könntest. Dafür bekommst du aber ne rote Karte, wegen negativer Einstellung.\n\nEdit: und dann gehst du ins Menschärgeredichnicht/Fußball-Forum um dich darüber aufzuregen und dort sagen dir alle was für ein A... du bist und dann dass du gefälligst nicht rumheulen sollst, weil du völlig zurecht bestraft wurden bist haha","replies":[{"poster":"Alustus","date":"2018-04-24T20:11:44.688+0000","up_votes":2,"down_votes":0,"body":"Ich sage nur wie der Chatverlauf auf mich und wie es auch bei Spielern ankommt, wie du als Person wirklich bist kann ich nicht beurteilen.\nAuch geht es nicht darum ob deine Reaktion verständlich ist oder nicht, sondern ob deine Reaktion in Ordnung ist oder nicht.\n\nUnd in diesem Punkt muss ich klar sagen, dass sie das nicht ist.\nWenn dich Spieler Blöd an machen, dann Mute sie und Reporte sie nach dem Spiel.\nWenn die Spieler scheiße spielen, dann ist das eben so dann solltest du versuchen die Zeit so sinnvoll wie möglich im Spiel zu verwenden indem du trainierst mit \"Affen\" zu spielen und nicht damit den Affen zu drohen oder sie blöd anzumachen.\n\nEs geht hier um dein Verhalten und nicht um das deines Teams, wenn deine Teammates gegen die Regeln verstoßen haben dann bekommt sie auch ihre Strafe von Riot.\nEs gibt keinen Grund dich so ein Niveau ziehen zu lassen.\n\n\nUnd ich denke wir alle hier im Forum waren schon mal in einer ähnlichen Situation wie du in diesem Fall und ja wir alle finden das Scheiße, aber es ist eben keine entschuldigung um zu drohen, bloßstellen oder um gegen das Team zu arbeiten.\n\n\n> \n> Ich habe nicht absichtlich gefeedet, das \"i int\" war so gemeint, dass ich ständig sterbe weil ich 1v2 toplane spielen musste und die permanent gedived haben. \n\nDas ist aber nicht die Definition von int.\nAuch ließt sich der Chatlog so als ob du absichtlich für die Gegner gearbeitet hast.\nGenerell wirken viele Rechtfertigungen von dir wie erfundene Ausreden.\n\nMir ist noch nie ein Gegner untergekommen, der gefragt hat wen er Reporten soll.\nAuch finde ich es komisch, dass du eine eigene Definition von Int hast.\nGenerell wirkt das ganze nach Frust ablassen und Gewissensberuhigung und nicht als ob du einen Meinungsaustausch anstrebst.\n\n\nNochmals ich kenne dich nicht und kann nur sagen wie das ganze über deine Posts auf mich wirkt.","replies":[{"poster":"Revilous","date":"2018-04-24T20:46:45.204+0000","up_votes":1,"down_votes":1,"body":"Ich benutze ständig das Wort \"int\", daher glaube ich auch nicht, dass das der Banngrund ist. Ich sage z.b. \"sry for int\", wenn ich gefeedet habe, \"i'm inting\" wenn ich dumm sterbe oder halt \"i int\" wenn ich keine chance habe ohne Hilfe zu überleben. Ich weiß, dass \"int\" kurz für \"intentional\" ist, da ist feeding ja noch nicht mal drin, aber trotzdem benutzt es jeder so.\n\nIch habe das game aufgenommen, generel könnte es mir egal sein, ob du mir glaubst, aber du kannst dir das Spiel auch gerne angucken.","replies":[{"poster":"Abasin","date":"2018-04-25T07:31:14.796+0000","up_votes":2,"down_votes":0,"body":"Dann musst Dir einen anderen Sprachgebrauch zulegen. Einen, der für weniger Missverständnisse sorgt. Wenn Du ein klassisches Reizwort wie \"int\" so inflationär und in nur Dir bekannten Konnotationen verwendest, dann fällt das irgendwann negativ auf Dich zurück.","replies":[]}]}]}]}]},{"poster":"hshtagniemehrcdu","date":"2018-04-24T18:57:46.010+0000","up_votes":2,"down_votes":0,"body":"> Das einzige wirklich toxische ist \"any children is smarter than this alistar but its not hard\", dafür wird man normalerweise nicht gebannt, weil es keine schlimmen Wörter enthält\n\nNein, da liegst du völlig falsch.\n\nDu wirst nicht für eine begrenzte Anzahl an Schlüsselworten gebannt, sondern, wenn dein Text beleidigend/abfallend gegenüber deinem Team ist.\nWas dieser Satz, wie du selber einsiehst, unzweifelhaft ist.\nDu kannst sehr wohl gebannt werden, ohne eine direkte Beleidigung zu verwenden.\n\nUnd das ist nicht die einzige Stelle, die abwertend gegenüber deinem Team ist.\nDeine Ankündigung der Sabotage zählt z.b. auch dazu.\nDas du das angeblich anders gemeint hast, ist aus dem log nicht zu entnehmen.","replies":[]},{"poster":"Mad Loony","date":"2018-04-24T17:02:12.437+0000","up_votes":2,"down_votes":11,"body":"Hattest halt Pech reportet zu werden. Die Software tut sich schwer damit \"Flame\" gerecht auszuwerten.","replies":[{"poster":"Revilous","date":"2018-04-24T17:23:39.747+0000","up_votes":1,"down_votes":5,"body":"Einzig vernünftige Antwort tbh.","replies":[{"poster":"Darkr3sQ","date":"2018-04-24T17:25:35.033+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=00020001,timestamp=2018-04-24T17:23:39.747+0000)\n>\n> Einzig vernünftige Antwort tbh.\n\nMag sein, dass sie in Deinen Augen vernünftig aussieht weil Dir der Poster Zuspruch gibt, hat jedoch nichts mit der Realität zu tun.","replies":[{"poster":"Revilous","date":"2018-04-24T17:59:26.135+0000","up_votes":2,"down_votes":5,"body":"Idk ob ich über euch lachen oder weinen soll. Idk ob dieses Forum belustigend oder deprimierend ist.","replies":[{"poster":"Darkr3sQ","date":"2018-04-24T18:26:20.361+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=0002000100000001,timestamp=2018-04-24T17:59:26.135+0000)\n>\n> Idk ob ich über euch lachen oder weinen soll. Idk ob dieses Forum belustigend oder deprimierend ist.\n\nSo etwas denke ich mir bei den TEs die über ihre gerechtfertigte Strafe im Forum rumjammern auch.","replies":[]}]},{"poster":"Izaya Kumiho","date":"2018-04-24T17:49:22.624+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZcDQ0Dt6KV,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=000200010000,timestamp=2018-04-24T17:25:35.033+0000)\n>\n> Mag sein, dass sie in Deinen Augen vernünftig aussieht weil Dir der Poster Zuspruch gibt, hat jedoch nichts mit der Realität zu tun.\n\nOuhhhhhh the burn.\nSchön gesagt, ZcD..ehh..whateffs.\n\nAber ja, ich kann dir da nur zustimmen.","replies":[]}]}]},{"poster":"Angel Ayume","date":"2018-04-24T21:34:37.556+0000","up_votes":3,"down_votes":0,"body":"Jetzt erzähl doch nicht WIEDER so einen Quatsch. \nDer Chatlog ist KLAR toxisch. Das er \"Pech\" hatte von Spielern reportet zu werden sei mal dahin gestellt, ich hätte ihn dafür auch reportet, aber was soll der letzte Satz bitteschön? \nDer Chatlog IST toxisch. Da gibt es nix zu rütteln und zu drehen. Das hat au nix damit zutun, dass die Software angebliche Probleme damit hat Flame zu erkennen oder richtig auszuwerten.... \nHör bitte auf hier überall so einen Stuss zu verbreiten..","replies":[]},{"poster":"Darkr3sQ","date":"2018-04-24T17:15:26.136+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=Za7984Vb,comment-id=0002,timestamp=2018-04-24T17:02:12.437+0000)\n>\n> Hattest halt Pech reportet zu werden. Die Software tut sich schwer damit &quot;Flame&quot; gerecht auszuwerten.\n\nEs handelt sich um einen negativen Chatlog. Hat rein Garnichts mit Pech zu tun. Und selbstverständlich wertet das IFS gerecht aus. Bei jedem Spieler der geprüft wird, werden die gleichen Maßstäbe angesetzt. Hat überhaupt nichts mit Glück, Pech oder Zufall zu tun.\nHandelt sich hierbei auch um kein Fehlurteil. CR ist verdient.","replies":[{"poster":"Mad Loony","date":"2018-04-24T17:26:41.321+0000","up_votes":1,"down_votes":4,"body":"Danke für deine Meinung. \n\nIch wollte eigentlich nur anmerken, dass ich auf deinen Kommentar im \"Reportaufrufe sind sinnvoll\" Thread schon noch antworten will. Mir ist vorher nur die Motivation ausgegangen noch so einen elendslangen Post zu schreiben. Hoffentlich kannst du das verstehen. :)","replies":[]}]}]},{"poster":"Megamaexx","date":"2018-04-24T17:08:20.976+0000","up_votes":1,"down_votes":0,"body":"Ist schon ziemlich negativ, ich hätte dich dafür auch reported","replies":[]}]}