{"poster":"Revilous","date":"2015-11-12T18:15:36.932+0000","title":"Lags/ Dc brauche Hilfe","subforum":"Hilfe & Support","up_votes":3,"down_votes":0,"body":"Also folgendes\r\n\r\nIn manchen Games habe ich 80 Ping ohne Grund, normalerweise habe ich 40, Pingtests sagen 20. In League sind es trotzdem 40 was ich auch nicht verstehe weil in einem anderen Haus ist die gleiche Leitung, Pingtests sagen auch 20 Ping und in League habe ich auch konstant 20 Ping. Hier aber habe ich wie gesagt 40 und in manchen Games 80 aber egal 40 reicht mir eigentlich.\r\n\r\nKommen wir jetzt aber zum Problem, also ich kenne mich nicht so aus mit dem ganzen aber anscheinend haben wir eine 50K Leitung. In manchen Games, nicht in allen, steigt der Ping auf 80 und manche sagen da ist kein Unterschied bis zu 100ms aber ich sage das ist der Unterschied zwischen Sieg und Niederlage. Das Problem ist ich wei&szlig; nicht wo ich sehen kann ob ich n&auml;chstes Game 80 Ping habe oder nicht weil in Custom Games ist das genauso random.\r\n\r\nManchmal habe ich auch kleine Dcs also das ich nicht sehe wie Minions sterben oder wie Champions laufen, das dauert aber nur ne Sekunde also ist das jetzt nicht sooo extrem schlimm. (In Teamfights schon) Wenn irgendjemand wei&szlig;, was ich dagegen tun kann, bitte hier kommentieren. Ich wei&szlig; auch nicht, was ich machen k&ouml;nnte, da Router Neustart eh nix bringt und es nur an League liegt, nicht an anderen Spielen oder so.\r\n\r\nDann habe ich noch ein zweites Problem, n&auml;mlich wenn ich tats&auml;chlich mal einen richtigen Dc habe und das &quot;Attempting to reconnect&quot; kommt,  geht es nicht von alleine weiter sobald ich mein Internet gefixt habe sondern ich muss erst aus dem Spiel raus und selbst dann lann ich nicht einfach auf &quot;Verbindung wieder herstellen&quot; denn dann kommt n&auml;mlich &quot;bitte &uuml;berpr&uuml;fe deine Internet Verbindung&quot;, nein ich muss LoL einfach komplett schlie&szlig;en und neustarten. Selten patcht es dann auch noch Login Screens oder so und dann bin ich richtig am Arsch.\r\n\r\nAlso wenn mir da jemand weiter helfen kann w&auml;re das sehr nett\r\n\r\nmfG","replies":[{"poster":"CrocoDog","date":"2015-11-13T21:10:12.088+0000","up_votes":2,"down_votes":0,"body":"Gleiches Problem ...","replies":[]}]}