{"poster":"clydé","date":"2017-03-21T18:54:22.424+0000","title":"Name Change","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"When I try to change my name to Clyde the name checker tells me it isnt available but when I check his Summoner he hasnt played since almost  years ago. Help?","replies":[{"poster":"Porocles","date":"2017-03-21T20:33:28.249+0000","up_votes":1,"down_votes":0,"body":"Are you trying to change your name on the updated client?  It may not give error messages or restrictions when making a name, so it may not actually be available.  You can double check on the legacy client for the specific reason.\n\n-  On the login screen of the open beta updated client, look for the \"Launch Legacy Client\" text at the bottom.\n-  Or create a shortcut directly to the legacy client in your League Installation. Just look for \"lol.launcher\" \n\nLet me know if that clears things up!","replies":[{"poster":"rebelprincess01","date":"2017-03-22T09:20:26.731+0000","up_votes":1,"down_votes":0,"body":"this might be off topic. but still. this acc was once called puscica and i changed (for obv resons :D) and for some friends that i had the name remained puscica even tho i changed it to JustJuicy","replies":[{"poster":"Porocles","date":"2017-03-22T15:22:46.809+0000","up_votes":1,"down_votes":0,"body":"It looks like your name change was fairly recent!  A name change might not appear for a player until they've relogged.  Have your friend logg off and back on to make sure that everything has resync'd.  Hope that helps!","replies":[{"poster":"rebelprincess01","date":"2017-04-28T07:57:47.832+0000","up_votes":1,"down_votes":0,"body":"i had this name for a year XD","replies":[]}]}]},{"poster":"clydé","date":"2017-03-23T03:10:20.464+0000","up_votes":1,"down_votes":0,"body":"Its been a thing since about August of 2016. It seems that the person has not even played a match for two years. But is there any way around it or is there another way for me to go about this?\nOh and thank you for the fast reply!","replies":[]}]}]}