{"poster":"GG Muscolo","date":"2016-11-17T16:43:53.041+0000","title":"No ejecuta el Launcher.","subforum":"Problemas Técnicos","up_votes":5,"down_votes":0,"body":"Que tal a todos, miembros de Riot y miembros de los foros.\r\nDesde ayer a la noche, tuve inconvenientes con el cliente.\r\nAl ejecutarlo, me sale el logo de League of Legends, carga la barra amarilla, se cierra y nunca m&aacute;s aparece, luego de haber esperado e intentado lo mismo, lo ejecute c&oacute;mo administrador, y la misma cosa, no es cosa del antivirus, debido a que tengo AVG y nunca me cre&oacute; problemas.\r\nC&oacute;mo si fuese poco, intente jugar desde otra PC que tengo, con una instalaci&oacute;n distinta, y el problema fu&eacute; el mismo, tengo un internet 4G con el que juego bien siempre, y si fuese problema del internet, me saldr&iacute;a el problema del &quot;Could not connect to HTTP...&quot;\r\nPero nada, no se qu&eacute; podr&iacute;a intentar, distinto a reinstalar el League of Legends, aunque se me ocurri&oacute; reemplazarlo por la Beta, s&oacute;lo que tengo entendido que puedo conseguirla desde el cliente viejo, pero no puedo abrirlo.{{item:3151}} \r\nEn fin, de antemano gracias por todo.","replies":[{"poster":"Łeyes","date":"2016-11-17T17:04:36.306+0000","up_votes":2,"down_votes":0,"body":"estamos en la misma.\nme acuerdo que este problema le paso a un amigo mio hace mucho tiempo y lo soluciono con un programa que te cambiaba  de región, se llama \"hotspot shield\", ayer lo descargue pero aun así seguía con el mismo problema, tambien intente borrar carpetas de launcher, pero sigue igual.\ntengo entendido que es un problema del server, habrá que esperar, pero si alguien tiene la solución, que la comente. saludos","replies":[{"poster":"Seebaah","date":"2016-11-17T19:58:10.141+0000","up_votes":1,"down_votes":0,"body":"El Hotsop Shield solo funciona para arreglar el problema \"error pvp net patcher kernel\"","replies":[]},{"poster":"GG Muscolo","date":"2016-11-17T17:57:21.574+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias, me deja más tranquilo{{item:3070}}","replies":[]}]},{"poster":"GG Muscolo","date":"2016-11-30T02:06:26.290+0000","up_votes":1,"down_votes":0,"body":"Mi problema persiste, y no encuentro solución u.u\nYa probé con reinstalar, en ambas PC, y no, cuando abro el lol.launcher, se queda la barra amarilla, se completa, y no desaparece el logo, y luego de mucho tiempo me sale un cuadro en blanco, con el icono del LoL que dice Error. {{item:3070}} {{item:3070}} {{item:3070}}\nYa estoy cansado de buscar, si alguien tiene algunda idea que aporte. {{summoner:3}} \nO mejor, cómo logro descargar la Beta sin necesidad de acceder al Launcher viejo?{{item:2045}}","replies":[]},{"poster":"byronniloa7x","date":"2016-11-20T20:23:53.251+0000","up_votes":1,"down_votes":0,"body":"A mi tambien me pasa exactamente lo mismo pongo ejecutar y nada y apreto alt crl supr para ver si la aplicacion esta ejecutandose o algo y me aparece pero no me aparece el launcher despues de ponerle ejecutar llevo ya 2 dias asi :c","replies":[]},{"poster":"Dastam","date":"2016-11-17T20:12:57.569+0000","up_votes":1,"down_votes":0,"body":"Yo también tengo el mismo problema. Me dijeron que es porque están probando una beta en el server con un cambio de interfaz y que el juego se actualizo solo, pero no a todos se les actualizó y a esos que no, les pasa lo que te pasa a ti y a nosotros.\n\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"nikowinter","date":"2016-11-18T06:36:29.536+0000","up_votes":1,"down_votes":0,"body":"Entonces no podremos jugar hasta qye terminen de probar el beta? :(","replies":[{"poster":"Dastam","date":"2016-11-18T16:04:30.237+0000","up_votes":1,"down_votes":0,"body":"Sinceramente no estoy seguro y no creo que sea la intención de Riot tampoco, ahora mismo estoy buscando una solución.","replies":[]}]}]},{"poster":"Kouhei Shutzio","date":"2016-11-18T09:53:46.211+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa lo mismo, actualice al cliente beta, y ayer cuando voy a entrar, ponia ejecutar normalmente y ya no aparecia nada, pobre las soluciones de borrar archivos, ejecutar como administrador, etc y seguia igual, hasta que lo desinstalé por completo, lo reinstalé y sigue pasando lo mismo, los procesos se abren, cuando quiero reabrir el cliente me dice que ya esta abierto y que lo cierre, que podrá ser?","replies":[]},{"poster":"lord starling","date":"2016-11-17T19:55:53.473+0000","up_votes":1,"down_votes":0,"body":"a mi me paso tambien no me sale nada\n{{sticker:zombie-nunu-tears}}","replies":[]}]}