{"poster":"Chirororo","date":"2017-06-14T13:59:57.501+0000","title":"Failed to connect after champ select","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Imgur: The most awesome images on the Internet.","url":"http://imgur.com/a/LcJS5","image":"http://i.imgur.com/4qRq9I9.jpg?fb"},"up_votes":1,"down_votes":0,"body":"The patcher lock deletion on notepad worked just fine (but i had to do it every time i had to login)\n but this happens after champion selection. \nI tried \nHextech repair\nflushing the DNS ,\nchange DNS ,\nreinstalled the game ,\ndisable Itpv6\nDIsable IP Helper\n is this in the problem that they are trying to fix as well? if not, how can I fix this problem? Thank you","replies":[{"poster":"Porocles","date":"2017-06-14T18:54:21.598+0000","up_votes":2,"down_votes":0,"body":"No, this issue seems different than the current offline error going on.  More specifically, it does seem like your network is having problems reaching the game server.  Minus the reinstall, you've taken solid steps to try and troubleshoot your connection.  You can also download the [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) and auto-configure firewall settings in case that's the culprit.  \n\nIf your specific issues continues, grab the logs from the HRT and attach them to a [support ticket](https://support.riotgames.com/hc/en-us/requests/new).  Our tech team can help you individually to figure this out.  See ya there!","replies":[{"poster":"Chirororo","date":"2017-06-14T19:03:26.251+0000","up_votes":1,"down_votes":0,"body":"Hello, Thank you for the reply! I have tried hextech firewall repairs and it didn't work as well.  I have sent in the support tickets. Hope all goes well C:","replies":[]}]},{"poster":"Ravenous Howls","date":"2017-06-14T14:22:11.855+0000","up_votes":2,"down_votes":0,"body":"I had the same thing happen. Selected my champ and was going into the game and then the client bugged and shut down. Now I got a leave buster and it screwed my placement for G4. so frustrating...","replies":[{"poster":"Chirororo","date":"2017-06-14T15:51:08.664+0000","up_votes":1,"down_votes":0,"body":"guess we can only wait for riot staff to fix or reply :c","replies":[]}]},{"poster":"Chirororo","date":"2017-06-15T07:22:37.392+0000","up_votes":1,"down_votes":0,"body":"I attempted re-installation again this time deleting LoL Screensaver as well and the game is working fine now! Thank you!","replies":[]}]}