{"poster":"Darkinknight","date":"2016-05-05T02:35:52.753+0000","title":"Rework maghi impressione","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Che ne pensate di questi rework? Per quelli che ho potuto vedere\r\nVladimir : molto meno oppressivo nella lane,prevedibile quando vuole attaccare,danni ridottissimi sulla ulti..lui secondo me &egrave; stato l&#039;unico uscito piu debole\r\nVeigar: danno danno danno,ma esplode lo stesso\r\nMalza : rimane sempre il difetto che fatichi a gestire piu di un avversario alla volta,ma le sue attuali creature sono sgravi da far schifo fra danno e velocita\r\nVel koz : tutto sommato forse era meglio prima credevo meglio ,pero vs team tank effettivamente rende molto di piu\r\nBrand : sgravissimo dal mid/late,praticamente esplode qualsiasi cosa tankata o meno","replies":[{"poster":"Lord Valotz","date":"2016-05-05T09:29:13.498+0000","up_votes":4,"down_votes":0,"body":"{{champion:90}}  : 1vs1 penso sia formidabile, il problema degli animaletti è che quando ti attaccano continuano a spawnare fino a quando mancano 4s della spell e tipo ieri sera con Darius mi ci incastravo dentro e non riuscivo più a muovermi, stare dentro la zona della ulti è praticamente assicurata, ieri senza avere troppo ap toglievo quasi il 20% della salute massima al secondo, poi ovvio c'è da considerare la resistenza magica. L'aver tolto i cast time della Q e della ulti ed il fatto che refreshano la E sono dei bei buff. Hanno tolto un po' di danno flat e di scaling sulle spell, ma con una delle passive più forti del gioco in late la hai praticamente sempre attiva è davvero sopra le righe.\n{{champion:161}}  : La differenza sostanziale rispetto a prima è che prima di ultare hai la necessità di fare una combo sul bersaglio per attivare l'analisi. Questo non si sente molto in lane quando tanto già si faceva così, quanto in teamfight che sei costretto ad attendere di aver castato le 3 spell se vuoi i danni puri, secondo me visto anche gli scaling inferiori alle mosse e quindi un nerf al suo poke è leggermente depotenziato nel senso, più che altro è diventato più difficile da usare. Poi secondo me va buildato solo oggetti Ap ignoranti e con il 40% di cdr senza più penetrazione magica e punti ad utilizzare la passiva.\n{{champion:143}} : L'ho potuta provare solo support, ma credo mid sia meglio visto la casualità dei semi le piante infastidiscono molto di più di prima il tuo adc per farmare ecc inoltre il migliorare le sue statistiche base, mi sembra incentrato ad uno spostamento in solo lane. Un heimerdinger 2.0 probabilmente più forte. Credo sia un peccato però aver tolto le aree di influenza delle piante.\n{{champion:8}}  : In lane con la Q depotenziata credo sia diventato molto meno oppressivo, i danni gli sono rimasti, soprattutto la E lì ha veramente alti, però probabilmente l'assenza di rubavita magico si fa sentire abbastanza. Credo sia un problema più di buildpath che di kit in se per lui.\n{{champion:69}} : la W è fantastica, ma probabilmente in generale fa meno danni rispetto a prima.\n{{champion:63}} : Quando esplodono le 3 stack è il delirio e finalmente la R è una mossa di senso compiuto e non rimbalza 673 volte sui minion, ma va sui campioni senza che siano incendiati e punta a far attivare la passiva.\n{{champion:1}} : La stessa bimba incendiaria con un orso che ha una mini passiva di SIon praticamente\n{{champion:34}} : La sua ulti è un nerf bello e buono\n{{champion:45}}  : Tonnellate di ap gratis praticamente","replies":[{"poster":"Darkinknight","date":"2016-05-05T10:57:56.777+0000","up_votes":1,"down_votes":0,"body":"Per vlad piu che altro è prevedibile quando sta per attaccare e fare un danno alto,basta attendere che non abbia piu la E e non stia vicino allo stato di cremisi e praticamente non puo fare nulla..la ulti soecialmente mi sembra davvero useless..\nCon vel koz il problema grosso è uno, devi essere veloce nella combo, e almeno da come ho visto,mi sembra che i danni non diventino puri se la 3 stack viene implementata durante l'utilizzo di ulti..questa cosa è un po meh","replies":[{"poster":"Lord Valotz","date":"2016-05-05T13:32:45.111+0000","up_votes":1,"down_votes":0,"body":"Quello se si convertano in puri all'applicazione della terza stack in ulti non saprei sinceramente, comunque per quanto uno sia veloce hanno tutte una animazione che rallenta se così si può dire la combo, idem la ulti ha un leggero delay, probabilmente se la ulti analizzasse i campioni anche lei, ma invece di applicare la passiva attivasse i suoi danni puri diverrebbe davvero interessante.","replies":[{"poster":"Darkinknight","date":"2016-05-05T20:07:14.469+0000","up_votes":1,"down_votes":0,"body":"Il ho 512 k maestria con vel koz,purtroppo in questi giorni ho davvero poco tempo per giocare e analizzare bene il champ come è ora..ma x quel paio di game che ho fatto ho notato questo problema..appunto il rallentamento della combo rappresenta un problema con la ulti che non converte in danni puri se le 3 stack vengono raggiunte ad attivazione gia effetuata,proprio xk con il rallentamento della combo le mosse colpiscono dopo la r..con una stack sulla r si risolverebbe questo problema,in modo che basti la prima stack della w per attivare i true damage..potrei sbagliarmi ma mi sembrava proprio che non li convertisse con questa consizione","replies":[{"poster":"Lord Valotz","date":"2016-05-05T21:48:28.943+0000","up_votes":2,"down_votes":0,"body":"Infatti il suo winrate è sceso di 2-3 punti percentuali. Comunque i danni puri della ulti si possono farli sentire solo a chi si prende la full combo quindi in un teamfight presumo solo la frontline li possa incassare. Te l'ho detto secondo me dovrebbero fare che anche la ulti attivi le stack di passiva ma invece di applicare i danni della scomposizione organica tramutare quelli della ultimate in corso in puri. Probabilmente ne è uscito leggermente depotenziato visto che prima la ultimate ti garantiva una stack ogni 0.5 secondi in cui la applicavi ti garantiva i danni puri della passiva oltre a quelli magici della passiva, ora ha le possibilità per farne di più sulla carta, ma si incontrano difficoltà nell'attuazione purtroppo vediamo cosa accadrà.","replies":[{"poster":"Darkinknight","date":"2016-05-05T21:51:50.016+0000","up_votes":1,"down_votes":0,"body":"Esattamente,l 'ho spiegato da biiip ma hai capito perfettamente {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Lord Valotz","date":"2016-05-05T22:07:55.309+0000","up_votes":1,"down_votes":0,"body":"È il secondo campione che ho più spammato con 75k niente in confronto alle tue 500k e passa, ma lo conosco piuttosto decentemente come campione.","replies":[{"poster":"Darkinknight","date":"2016-05-05T22:52:30.367+0000","up_votes":1,"down_votes":0,"body":"Abbastanza per capire cosa non va in questo kit evidentemente 👍la domanda a questo punto è \"perche i creatori e gente pagata apposta non ci pensano?\"..va beh spero nella prossima patch 😞","replies":[]}]}]}]}]}]}]}]},{"poster":"Nibbio Bianco","date":"2016-05-05T05:05:58.467+0000","up_votes":4,"down_votes":0,"body":"Ieri Vlad in lategame con una sola abilità ha ammazzato il nostro adc con maw e malmortius e scimitarra di mercurio. Questo vladimir in lategame non scherza mica. \n\nBrand l'ho avuto anche ieri in gioco e non ha fatto poi così tanto, ma forse perché contro aveva me con Zyra... porca miseria, se Zyra fa male adesso.","replies":[{"poster":"vondarck","date":"2016-05-05T09:41:46.071+0000","up_votes":1,"down_votes":0,"body":"un nasus AP... interessante\n\nieri i 2 vlad che ho visto giocare però hanno preso un sacco di schiaffi.. forse ci devono prendere la mano in fase di laining","replies":[{"poster":"Darkinknight","date":"2016-05-05T10:46:18.126+0000","up_votes":1,"down_votes":0,"body":"Quello vs di me ha finito 1/15, gli ho fatto finire la lane 0/7 ed ero almeno col vecchio vlad pure counterato..e sarebbe stato pure il suo 2 main quindi un po di esperienza sul champ gia la aveva..mah tanto meglio odiavo avere contro quel coso","replies":[]}]}]},{"poster":"SpideyPizza","date":"2016-05-05T06:48:58.798+0000","up_votes":1,"down_votes":0,"body":"hai dimenticato zyra :D\n\nieri ho provato la versione 2.0 di zyra e mi piace parecchio e' consigliabile mid ma support fa il suo sporco lavoro.\nla nascita dei fiora e' la loro posizione e' un po a caso ma cosi facendo porta l'adc nemico e il support a togliersi dal farm per calpestare i fiori.\nHo notato una leggera diminuzione del danno rispetto a prima ma il suo gameplay mi piace molto di piu :)","replies":[{"poster":"Frattaglia","date":"2016-05-05T07:48:04.364+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=SpideyPizza,realm=EUW,application-id=MJVj50Jw,discussion-id=tuvxsYns,comment-id=0002,timestamp=2016-05-05T06:48:58.798+0000)\n>\n> hai dimenticato zyra :D\n> \n> ieri ho provato la versione 2.0 di zyra e mi piace parecchio e&#x27; consigliabile mid ma support fa il suo sporco lavoro.\n> la nascita dei fiora e&#x27; la loro posizione e&#x27; un po a caso ma cosi facendo porta l&#x27;adc nemico e il support a togliersi dal farm per calpestare i fiori.\n> Ho notato una leggera diminuzione del danno rispetto a prima ma il suo gameplay mi piace molto di piu :)\n\nA me non piace la casualità che hanno introdotto in questa patch, sia rispetto alla questione dei draghi sia rispetto a cose tipo le piantine di Zyra (anche se forse quelle non sono troppo casuali).\n\nUn'altra cosa che non mi piace (ma non c'entrano i maghi) è l'icona a prova di stupido sulla minimappa all'altezza dei buff che ti dice anche se stanno per respawnare.\n\nSui maghi... ho fatto solo una partita, devo giocarci un po' di più per farmi un'idea.","replies":[{"poster":"Darkinknight","date":"2016-05-05T10:41:35.337+0000","up_votes":1,"down_votes":0,"body":"Yes concordo sui timer,e tutto sommato preferivo il sistema classico dei draghi","replies":[]},{"poster":"SpideyPizza","date":"2016-05-05T08:03:55.007+0000","up_votes":1,"down_votes":0,"body":"Quoto sull'icona del timer \n\nsu i draghi devo capirci ancora qualcosa. l'unica icona che apprezzo e' quella del tipo di drago che sta per sorgere","replies":[]}]}]},{"poster":"DANJERpuntoEXE","date":"2016-05-06T09:34:56.208+0000","up_votes":1,"down_votes":0,"body":"guarda le passive, è come comprare la mannaia e la trinity, o trinity e guanto del gelo.","replies":[]},{"poster":"vondarck","date":"2016-05-05T09:44:07.315+0000","up_votes":1,"down_votes":0,"body":"oggi se riesco a piccare top e bannare{{champion:39}} mi provo il nuovo {{item:3027}} su {{champion:13}} ..\npoi so che lo reworkeranno, ma nel mentre  *_*\nvorrei provare anche {{champion:38}} ","replies":[{"poster":"DANJERpuntoEXE","date":"2016-05-05T12:15:51.021+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=vondarck,realm=EUW,application-id=MJVj50Jw,discussion-id=tuvxsYns,comment-id=0007,timestamp=2016-05-05T09:44:07.315+0000)\n>\n> oggi se riesco a piccare top e bannare{{champion:39}} mi provo il nuovo {{item:3027}} su {{champion:13}} ..\n> poi so che lo reworkeranno, ma nel mentre  *_*\n> vorrei provare anche {{champion:38}}\n\nio l'ho provato....purtroppo non puoi comprarti tutti gli oggetti di mana che volevi perche hanno abilità passive uniche (bastone secolare e quel coso blu che costo 3000). In compenso puoi farti il morello che da 400 mana!!!!","replies":[{"poster":"vondarck","date":"2016-05-06T08:17:16.293+0000","up_votes":1,"down_votes":0,"body":"non capisco il commento.. mi pare che non si sovrapponga niente nella seguente build\n\n{{item:3027}} {{item:3040}} {{item:3030}} {{item:3110}} {{item:3020}} {{item:3165}}","replies":[]}]}]},{"poster":"DuckQuack0","date":"2016-05-05T17:03:28.376+0000","up_votes":1,"down_votes":1,"body":"Vladimir: Abbastanza inutile\n\nVeigar: E' tutto sommato migliore, per fortuna non hanno cambiato il kit, e finalmente la ulti fa qualcosa contro gli AD, grazie Riot.. peccato che non giocherò quasi mai mid altrimenti 30 minuti di coda..\n\nMalzahar: RIP AP Malzahar\n\nVel'Koz: Si ok può fare danni puri continuati, ma preferivo quello di prima, quando la ulti stackava la passiva\n\nBrand: E' molto meglio, non OP\n\nZyra: l'ho vista 1 volta, sicuramente qualcosa in più ha fatto\n\nAnnie: Wooooooh! Viva i maghi tank che oneshottano <3\n\nCassiopeia: Fantastica la nuova W!\n\nAnivia: Farà compagnia a Karthus.","replies":[{"poster":"Darkinknight","date":"2016-05-05T20:10:16.317+0000","up_votes":1,"down_votes":0,"body":"Si direi che condivido,tranne x brand..scioglieva me con 3300 hp e 200 mr e skarner full tank con nulla..abbattere poi il mid laner o adc non necessitava manco della ulti","replies":[]}]},{"poster":"Ringiel","date":"2016-05-05T08:58:02.489+0000","up_votes":1,"down_votes":0,"body":"{{champion:69}}: lo spammata ieri,e sinceramente tutto sto rework mi sembra un nerf ... sicuramente ha ottenuto una W fantastica perchè zona benissimo quando si fanno obbiettivi,però ha perso moltimo danno sulla E e la passiva (il non comprare le scarpe) ti obbliga a rusharti il luden per la MS;\n{{champion:143}}: provata mid contro una LB e devo dire che ora è diventata {{champion:74}} v 2.0,zona da far schifo con la nuova meccanica delle piantine (non serve più hittarle con l'abilità per evolverle) e sono anche più intelligenti \n{{champion:1}} : la E ora è fortissima contro i champ che burstano e tibbers fa un bordello di danni\n{{champion:50}} : ha ottunuto quello che mancava al suo kit,il clear weave ... secondo me è uno dei rework migliori\n{{champion:9}} : l'ms non era un problema per fiddle,visto che il 90% delle volte utilizza lo {{item:3157}}  subito dopo l'ulti ...\n{{champion:34}} : anche se ha un AA e una E più veloce,la ulti ha bisogno di cc per essere utilizzata\n","replies":[{"poster":"Killer SurpRyze","date":"2016-05-05T10:48:02.686+0000","up_votes":1,"down_votes":0,"body":"> {{champion:1}} : la E ora è fortissima contro i champ che burstano e tibbers fa un bordello di danni\n\nTibbers è più forte del fantasma creato con la R di Morde :-(  Ora non la si tiene più (non che prima fosse una bimba innocente e simpatica, eh!)","replies":[]},{"poster":"Keìron","date":"2016-05-05T09:53:57.485+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ringiel,realm=EUW,application-id=MJVj50Jw,discussion-id=tuvxsYns,comment-id=0004,timestamp=2016-05-05T08:58:02.489+0000)\n>\n> {{champion:69}}: lo spammata ieri,e sinceramente tutto sto rework mi sembra un nerf ... sicuramente ha ottenuto una W fantastica perchè zona benissimo quando si fanno obbiettivi,però ha perso moltimo danno sulla E e la passiva (il non comprare le scarpe) ti obbliga a rusharti il luden per la MS;\n> {{champion:143}}: provata mid contro una LB e devo dire che ora è diventata {{champion:74}} v 2.0,zona da far schifo con la nuova meccanica delle piantine (non serve più hittarle con l&#x27;abilità per evolverle) e sono anche più intelligenti \n> {{champion:1}} : la E ora è fortissima contro i champ che burstano e tibbers fa un bordello di danni\n> {{champion:50}} : ha ottunuto quello che mancava al suo kit,il clear weave ... secondo me è uno dei rework migliori\n> {{champion:9}} : l&#x27;ms non era un problema per fiddle,visto che il 90% delle volte utilizza lo {{item:3157}}  subito dopo l&#x27;ulti ...\n> {{champion:34}} : anche se ha un AA e una E più veloce,la ulti ha bisogno di cc per essere utilizzata\n\nLa E di cassiopeia fa molti più danni e cura se il bersaglio colpito è avvelenato.","replies":[{"poster":"Ringiel","date":"2016-05-05T10:41:13.455+0000","up_votes":1,"down_votes":0,"body":">La E di cassiopeia fa molti più danni e cura se il bersaglio colpito è avvelenato.\n\nin realtà no,perchè devi considerare che prima ne sparavi 2 nel tempo che ora ci metti per spararne una (sempre che il target sia avvelenato) ... ora ha un early inesistente,al contrario di quella vecchia che poteva farsi la FB a livello 2,e un late nettamente peggiore ... ha solamente più forza nello zonare ed è più facile last hittare con lei per il cd della nuova E","replies":[]},{"poster":"Darkinknight","date":"2016-05-05T10:38:35.999+0000","up_votes":1,"down_votes":0,"body":"Lo faceva gia prima","replies":[]}]}]},{"poster":"Laiho88","date":"2016-05-05T09:06:53.142+0000","up_votes":1,"down_votes":0,"body":"finalmente vlad è diventato gestibile, lo odiavo per il suo sustain infinito e cd inesistente......","replies":[]},{"poster":"Killer SurpRyze","date":"2016-05-05T08:57:43.196+0000","up_votes":1,"down_votes":0,"body":"mah, devo ancora provarli tutti, ma sulla carta pare abbiano subito nerf ai danni e alla rigenerazione del mana \"classica\". Ho provato solo Swain (nulla di ché: danni ridotti, Q più utile, meno cura con la R) e Malzahar (meno danni, più potere di pushare la lane, come se ce ne fosse bisogno). Oggi pomeriggio proverò Brand","replies":[]},{"poster":"Sorcio84","date":"2016-05-05T04:22:53.286+0000","up_votes":1,"down_votes":0,"body":"Ho appena preso vlad e mi sembra simpatico.\nSi in lane ha cd consistenti ma se riesci a piazzare una Q potenziata , fa male.\nLa difficoltà sta nel posizionamento perfetto e nel tempismo.\n\n{{champion:136}} provato in normal e ho vinto contro corki mid. Hl avuto una fase di laning abbastanza safe geazie al recupero di HP spendendo il mana della W , recuperandolo poi con la mastery apposita.\n\n{{champion:203}} con {{item:1416}} {{item:3124}} {{item:3153}} fa buoni danni ma esplode easy. Proverò questi item su altri champs.\n\nMi sembra che ora la guinsoo sia più bilanciata ma è solo una mia impressione dato che è presto per dare giudizi","replies":[{"poster":"Arteriam","date":"2016-05-05T08:47:44.226+0000","up_votes":1,"down_votes":0,"body":"Prova quegl'item su {{champion:266}} \nieri stavo per fare una quadra 4v1.","replies":[]}]}]}