{"poster":"Kn1ghtm4r3","date":"2015-02-06T23:48:07.735+0000","title":"Promo broken","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":2,"body":"Huhu, das Problem ist altbekannt und kennen sicher einige von euch,\r\nElo Boost, ich habe 5 Promo spiele gespielt\r\n2 davon hatte ich einen Elo Booster im Team (Haben sie sogar zugegeben)\r\n3 davon meine Gegner (100 Wins im Normal 0 Dominion 0 Aram, unranked in letzten Seasons, 2 Runenseiten etc, smurf/boost Accounts halt)\r\nIn jedem Spiel habe ich zumindest akzeptabel gespielt, die Lane nicht gefeeded bzw gewonnen, gewarded in den Teamkämpfen dabei etc. aber es gab das gewisse Problem, dass 100 Spiele \"Newcomer\" gold/plat Promo Spieler stompen als würde es keinen Morgen geben.\r\nIch verlange nicht viel von Rankeds, das einzige was ich will, ist mit Spielern zu spielen die auf einem Level sind, ich habe keine Lust weil ich in der Promo von möchtegernboostern und Idioten auf Silber lande und mich 2 Wochen lang zu Platin hochstompen muss (Ja, ich weiß ich werde dort langfristig landen, von da komme ich ja mimimi) \r\nEs raubt mir nur wahnsinnig Spass am Spiel, kein Spiel aufgrund meiner Fertigkeiten zu gewinnen oder zu verlieren, sondern einfach zuzugucken wie nach 18 min auf einer ausgeglichenen/gewonnen Top Lane zu sehen wie der Bot Inhib Turret down geht.\r\n\r\nNun meine Diskussionsanregung: Supportgrund: Elo Boosting/Smurfing oder soetwas, würde es die Ausnahme sein, okay. Aber ich habe nun 5/5 Spielen mit soetwas zu tun gehabt 2 vor free gewonnen 3 for free verloren, mir wäre es lieber aufgrund guter Entscheidungen oder schlechter Entscheidungen meinerseits/meines Teams zu gewinnen und zu verlieren. So macht das absolut keinen Spass und motiviert nicht dazu sich zu verbessern sondern sämtliche Spieler zu hassen die soetwas tun.\r\nEs gibt nichts als böses Blut durch solche Spieler, gegen eine 10/1 Tristana min 20 zu spielen führt auch nicht dazu dass ich aus dem Spiel irgendetwas lerne, wie so mancher eventuell behaupten würde, es ist nichts als ein schlechtes Spielerlebnis.\r\nFür ein positives Spielerlebnis sollte es einen Reportgrund geben, bei dem der Matchmaker sollte er häufig auftreten überprüft, ob seit dem auftreten dieser Reportgründe die IP gewechselt hat. Sollte dies der Fall sein, ist es unwahrscheinlich, dass der gleiche Spieler hinter dem Account wie sonst sitzt.\r\nUmgekehrt, bleibt man auf dem gleichen Niveau, sollte aus diesem Grund nicht reportet werden. Riot könnte über recht simple IP-Vergleichalgorithmen dieses Verfahren wahrscheinlich sogar halbwegs automatisieren und müsste nicht jeden Fall einzeln begutachten. Entsprechende Bestrafungen müssten natürlich folgen.\r\nDies würde zumindest das Elo Boosten komplett unattraktiv für gute Spieler bzw. Spieler die dafür zahlen machen.\r\n\r\nGrüße, von einem Spieler der nichts als ausgeglichene Spiele will.","replies":[{"poster":"Humpelstilzche","date":"2015-02-07T08:41:18.830+0000","up_votes":7,"down_votes":0,"body":"Nach Riots Aussage ist ein solcher Button nicht nötig, da Riot selbst Booster viel effektiver und präziser erkennen kann als dies Spieler tun können. Man muss auch immer bedenken, dass die bloße Existenz eines Report-Grundes dafür sorgt, dass das entsprechende Fehler viel mehr ins Zentrum der Aufmerksamkeit rückt. Die Existenz eines solches Buttons suggeriert dass es Unmengen Booster gibt und Riot ein Problem hat dagegen vorzugehen...was nicht der Fall ist. In der Wahrnehmung der Leute würde also das Problem viel größer gemacht, als es eigentlich ist. \n\nEin zusätzlicher Report-Button hat also auch negative Konsequenzen. Und wenn Riot diese Reports wirklich nicht braucht (sie werden schon wissen warum sie das sagen), ist es eben fraglich ob man diesen Nachteil dann in Kauf nehmen will.","replies":[]},{"poster":"Hakkuu","date":"2015-02-06T23:52:08.254+0000","up_votes":2,"down_votes":0,"body":"Sehr schon geschrieben ;)\nEloboosting ist schon ein Ban Grund und wird mit Entzug sämtlicher Ranked Belohnungen und einem kurzen Ban bestraft. Aber die Idee jemanden als Elo Booster zu Reporten klingt sinnvoll, solange dann auch alles nachgeprüft wird.","replies":[{"poster":"eingew","date":"2015-02-08T12:49:01.013+0000","up_votes":1,"down_votes":0,"body":"Es wird doch so oder so geprüft, egal ob man reported wird oder nicht :P Ich jedenfalls bezweifle, dass Riot jeden der Accounts, die bei der letzten Banwelle ihre Belohnungen verloren haben, durch Meldungen beim Support erkannt hat.","replies":[{"poster":"Hakkuu","date":"2015-02-08T16:22:42.403+0000","up_votes":1,"down_votes":0,"body":"Ja klar wird es das, aber ich denke ein zusätzlicher Report Grund dafür würde es den armen Riot Mitarbeitern etwas einfacher machen ;)","replies":[{"poster":"eingew","date":"2015-02-08T16:25:20.109+0000","up_votes":1,"down_votes":0,"body":"Da klingt Humpels Antwort realistischer :P Außerdem kann man entsprechende Spieler ja bereits dem Support senden.","replies":[{"poster":"Hakkuu","date":"2015-02-08T16:30:16.129+0000","up_votes":1,"down_votes":0,"body":"Oh, den hab ich ja noch garnicht gesehen :p \nAber ja, viele der mutmaßlichen Elo Booster sind wirklich nur Einbildung, Leute die mal ne Season Ranked Pause gemacht haben oder falsch eingestuft wurden - Oder sie spielen einfach gut ;) Außerdem sind Smurfs doch nicht mal verboten..?","replies":[{"poster":"eingew","date":"2015-02-08T16:34:13.992+0000","up_votes":1,"down_votes":0,"body":"Smurfs sind nicht verboten :)","replies":[{"poster":"Hakkuu","date":"2015-02-08T16:39:17.957+0000","up_votes":2,"down_votes":0,"body":"Na also, dann ist es schon im Vorhinein fast unmöglich einen Spieler wegen seines Spielverhaltens für schuldig zu erklären ;) Und wenn Riot meint sie brauchen es nicht, dann wäre der Nutzen fast komplett dahin.","replies":[]}]}]}]}]}]}]},{"poster":"Phobos Selini","date":"2015-02-07T02:20:36.187+0000","up_votes":2,"down_votes":0,"body":"Naja eigentlich sollten fortlaufend alle Accounts ständig überprüft werden, ob dort Accountsharing und Boosting stattfindet. Eine Reportfunktion, die bei genügend hoher Reportrate eine Kontrolle anfordert, braucht man nur, wenn diese ständigen oder zumindest regelmäßigen Kontrollen eben nicht so ohne weiteres durchgeführt werden können.\n\nNichtsdestotrotz finde Deine Geschichte aber auch wieder sehr übertrieben. Dann hattest Du halt ein paar einseitige Spiele, na und. Das war doch zu erwarten am Anfang der Season. Die ganze Ladder wird durch den Reset stark zusammen gestaucht und die Placementspiele sorgen für starke Schwankungen. Da ist es nur natürlich, dass dann auch das Matchmaking einfach manchmal nicht funktionieren kann.\n\nAllgemein sollten sich viel mehr Spieler nicht so sehr über ihre Soloqueue Games aufregen. Es ist nun mal Fakt, dass durch die zufällige Auslosung der Teammitglieder die eigene Einschätzung von \"zum Himmel hoch jauchzend\" bis \"zum Tode betrübt\" einnehmen kann. Klar ich war auch etwas generft von meinen 2:8 Placements und bin jetzt ziemlich erschrocken, was für eine Klientel sich heutzutage als Gold bezeichnen kann, aber das ist halt Soloqueue.\n\nWer wirklich Tryharden will, soll sich ein Ranked Team suchen.","replies":[]},{"poster":"Sanctuary2056","date":"2015-02-07T07:58:51.376+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Kn1ghtm4r3,realm=EUW,application-id=KYnfKGf0,discussion-id=lHNFN8wF,comment-id=,timestamp=2015-02-06T23:48:07.735+0000)\n>\n> Aber ich habe nun 5/5 Spielen mit soetwas zu tun gehabt \n\nDas halte ich für eine ziemlich kühne Behauptung.\nDas Problem daran ist, dass viele Spieler eine Bedrohung in smurfing sehen, die es eigentlich gar nicht gibt. Ebenso sehen viele Spieler viele Dinge als boosting an, die kein boosting sind. Premades zum Beispiel. Wenn man überall solche Leute und solche Bedrohungen sehen will, dann tut man das auch. Selbst nach einer riesigen Welle gegen Booster ({{item:1052}} die es vor kurzem tatsächlich gab!)\n\nIch glaube also ehrlich gesagt nicht, dass deine Beobachtung so objektiv ist.\nDas ist ein wenig offtopic ich weiß, aber wenn du mal darüber nachdenkst, wirst du feststellen, dass es sinnlos ist über Maßnahmen nachzudenken, solange der eigentliche Ursprung deiner Probleme bei dir selbst liegt.\n\nZum eigentlichen Thema:\nReports schaden prinzipiell nicht. Sie müssen ja nicht zwangsläufig auch irgendetwas bewirken. Daher denke ich, dass man es durchaus gefahrlos ausprobieren könnte. Schlecht ist der Vorschlag also keines wegs. Ob es was bringt sieht man dann.\n\nAber ich denke dass die Analyse von Verbindungsnachweisen und deutlich akkuratere erste Hinweise liefert, als reports das jemals könnten.\nAbgleich der Client ID, der Spielzeiten und des Spielverhaltens sind der nächste sinnvollere Schritt um die Fälle einzugrenzen.\nDass reports da noch einen nennenswerten Mehrwert bieten ist fraglich. Und als Unternehmen muss man sich überlegen, ob man Resourcen so einsetzen möchte, dass sie in fragliche Unterfangen gesteckt werden. Es würde mich daher sehr wundern, wenn dieser reports bald eingeführt wird. Dafür sind gerade in dem letzten Jahr viel zu viele innovativere und bessere Ideen umgesetzt worden. Wenn der Strom mal aufhört, okay, dann kann mans ruhig machen.","replies":[]},{"poster":"Fairtrade Milk","date":"2015-02-09T15:52:02.956+0000","up_votes":1,"down_votes":0,"body":"Viele meiner Freunde zum Beispiel sind Bronze und merken auch, dass dort ziemlich viele Smurfs unterwegs sind.\nNur dafür habe ich mir einen eigenen Smurf auf lv 30 gezüchtet um meinen Freunden gegen die gegnerischen Smurfs zu helfen ;)","replies":[{"poster":"Biestmaster","date":"2015-02-16T15:12:29.798+0000","up_votes":1,"down_votes":0,"body":"Da macht TRUE ELO so richtig Sinn.    Instaban für dich hoffentlich.","replies":[]}]},{"poster":"xCrumms","date":"2015-02-11T17:12:00.270+0000","up_votes":1,"down_votes":0,"body":"Allgemein denke ich, dass diese sogenannten \"Elobooster\" raus genommen werden, wenn man ab Level 1 direkt eine Elowertung kriegt.\nDas heißt, entweder sie verlieren mit Absicht, was bedeutet es gibt definitiv einen Reportgrund oder sie werden von Haus aus direkt besser eingestuft bei ihren Promospielen (Gold +). Würde vieles einfacher machen für diejenigen, die einen zweiten Account hochziehen wollen.","replies":[]},{"poster":"Khellandrath","date":"2015-02-08T12:35:10.918+0000","up_votes":1,"down_votes":1,"body":"Hm, ich reporte Booster und Smurfs regelmäßig. Auch Teams die absichtlich Spiele verlieren, damit sie in Bronze 5 alles stompen können - das ist superunsportliches Verhalten. (ist uns wirklich so passiert. wir sind ein harmloses Bronze3-Team, bekamen ein Gegnerteam, die uns so schwindlig spielten wie nur was, und die dann, nachdem sie schon zwei inhibs bei uns down hatten, bei Minute 20 aufgaben, just als wir das gleiche tun wollten. wir hatten ein total frustrierendes Spiel und einen Win, der uns das Spiel noch mehr zuwider machte. selbstverständlich haben wir die alle reported. Solche Idioten gehören lifetime gebannt, weil sie das Spiel zerstören)\nMan kann schlicht negatvie attitude / negative Einstellung reporten, denn die ist ja in diesem Fall immer vorhanden.","replies":[{"poster":"Hakkuu","date":"2015-02-08T16:40:59.338+0000","up_votes":1,"down_votes":3,"body":"Absichtlich Ranked Games zu verlieren ist aber kein Grund jemanden dafür zu bestrafen. Und Lifetime bans sind - Tut mir leid - wirklich einer der dümmsten Ideen der Community ;)","replies":[{"poster":"eingew","date":"2015-02-09T19:20:11.453+0000","up_votes":1,"down_votes":0,"body":"Aber sicher ist absichtliches verlieren von Spielen ein verbotenes Verhalten.\n\nPermabans werden nur in absoluten Ausnahmefällen vergeben. Um den zu bekommen musst du 50 zweite Chancen völlig ignorieren. Jeder davon ist absolut gerechtfertigt. Riot hat keine Lust, dass ein Haufen Idioten ihnen die netten Spieler vertreibt. Vertriebene Spieler bringen weniger Geld ein :P","replies":[]}]}]}]}