{"poster":"Kitsune Goddess","date":"2016-10-08T14:17:28.083+0000","title":"At loss of what to do","subforum":"Player Behavior","up_votes":1,"down_votes":0,"body":"(EDIT: My laptop had overheated and shut off before the mouse incident.)\nHello! \nWell I have quite a problem and I have no idea what to do anymore.\nAbout a month ago I was playing a game of league and my mouse&#039;s battery died. I was rummaging around in my room to find two AAA batteries that weren&#039;t dead. It took quite a long time to go through all the dead batteries in my room, so I ended up using my Wacom Tablet to play. By that time, the game was halfways over and people were complaining about me being AFK while I couldn&#039;t do anything.\nI explained my circumstances and some people understood, while others kept telling me I was going to be reported.\nSince then, I have had LeaverBuster on me. It said I only had it on me for FIVE games. I have since played way more than five It&#039;s still on me.  I have not been AFK and I don&#039;t leave matches. \nAccidentally left a match once though, because my laptop overheated and shut off. \nI&#039;m at loss of what to do and was hoping someone could help me out?\nThanks!","replies":[{"poster":"Kei143","date":"2016-10-08T15:22:51.216+0000","up_votes":1,"down_votes":0,"body":"hmm I'm not understanding clearing what is happening.\n\nAre you saying that you still have 5 games of low priority queue despite playing more than 5 games?\n\nOr are you saying that you played through those games, laptop overheated (thus you leave), and is now back in LPQ?","replies":[{"poster":"Kitsune Goddess","date":"2016-10-08T16:24:15.876+0000","up_votes":1,"down_votes":0,"body":"I've long been past my 5 games of low priority and it's still saying I have 5 left. Ever since the AFK incident, I've just been placed in low priority. \nPlus, nobody even gave me a chance to justify my AFK and the time my laptop overheated and I left the game.","replies":[{"poster":"Kei143","date":"2016-10-08T23:16:32.451+0000","up_votes":1,"down_votes":0,"body":"hmmmmmmmm ...........\n\nMaybe the \"help and support\" subsection can help you better on the regards of still having LPQ left.\n\nThe time your laptop overheated just was the final straw that put you into LPQ punishment, the other 4-6 games that you left (or AFKed) previously was also part of building towards your leaver buster case. \n\nFYI, clicking around the fountain & AFK farming still counts as AFK.","replies":[]}]}]},{"poster":"Zezockary","date":"2016-10-08T17:36:51.679+0000","up_votes":1,"down_votes":0,"body":"You won't get LPQ from leaving one game, it takes quite a few to trigger the leaverbuster, and appeals for the punishments are never even considered. You are responsible for all of your leaves.\n\nThat being said, your LPQ games should be going down with games. Try logging out for a bit and back in to see if that fixes it, and if not submit a support ticket.","replies":[]}]}