{"poster":"Erax157","date":"2019-04-26T21:25:39.698+0000","title":"Riot e le passive","subforum":"Campioni e gameplay","up_votes":4,"down_votes":5,"body":"Non so se ci avete pensato, ma a mio parere riot si trova così a corto di idee per i campioni che fa passive tutte uguali.\nIrelia, autoattacchi potenziati, Aatrox, aa potenziato, Sylas aa potenziato, tralasciando che sylas e zoe hanno praticamente la stessa passiva. Anche Yummi il nuovo campione, autoattacco potenziato, queste passive si differenziano tutte per minimi particolari, anche Nunu dà attack speed ma più o meno siamo li. Dov'è l'originalità? Dove sono le passive che mi fanno sentire un champion diverso dagli altri? è un vero peccato perchè è in gran parte la passiva che fa il champ quello che è, e ti fa sentire il champ mentre lo giochi. Cosa me ne faccio di un autoattacco potenziato?","replies":[{"poster":"sbepuz","date":"2019-04-26T22:30:45.596+0000","up_votes":10,"down_votes":0,"body":"giocatori: vogliamo originalità! vogliamo un game bilanciato e senza bug\n\nriot: _avete detto che volete una nuova skin di lux?_","replies":[]},{"poster":"Anubis Raven","date":"2019-04-26T23:13:55.162+0000","up_votes":4,"down_votes":0,"body":"mi ha fatto ridere questo post e sono qui per elencare tutti i campioni con attacchi o danni potenziati su altri attacchi o derivate come recuperare vita da un attacco, mana , moviment speed ecc...non prenderò in considerazione le passive su aa date da abilità altrimenti qui ci sarebberò da mettere 70% dei campioni:\n{{champion:266}} {{champion:84}} {{champion:22}} {{champion:432}} {{champion:53}} ( il nuovo blitz avra danni su aa e abilità){{champion:201}} {{champion:51}} {{champion:42}} {{champion:131}} {{champion:245}} {{champion:3}} {{champion:41}} {{champion:104}} {{champion:39}} {{champion:59}} {{champion:24}} {{champion:145}} {{champion:117}} {{champion:57}} {{champion:21}} {{champion:111}} {{champion:56}} {{champion:20}} {{champion:61}} {{champion:133}} {{champion:92}} {{champion:35}} {{champion:37}} {{champion:517}} {{champion:223}} {{champion:17}} (il nuovo teemo ovviamente){{champion:23}} {{champion:6}} {{champion:19}} {{champion:101}} {{champion:238}} {{champion:115}} {{champion:142}}  e questo è tutto.","replies":[{"poster":"1NG Faabier","date":"2019-04-26T23:22:31.894+0000","up_votes":1,"down_votes":0,"body":"In che senso il nuovo blitz??","replies":[{"poster":"sbepuz","date":"2019-04-27T00:04:46.863+0000","up_votes":1,"down_votes":0,"body":"nella prossima patch subirà un mini re-work sulla ulti e sulla passiva","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-04-27T05:34:29.275+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=sbepuz,realm=EUW,application-id=cAOZwaUi,discussion-id=ZXypAEu6,comment-id=000200000000,timestamp=2019-04-27T00:04:46.863+0000)\n>\n> nella prossima patch subirà un mini re-work sulla ulti e sulla passiva\n\nRip Paolone","replies":[{"poster":"BluCobalto92","date":"2019-04-27T07:19:21.189+0000","up_votes":1,"down_votes":0,"body":"Al contrario.... Sarà ben contento del cambiamento.... La passiva se ricordo bene lo scudo di mana passa dal 50% del mana attuale al 30% del mana massimo... Il che vuol dire che 0uoi ingaggiare anche spendendo fino all ultima goccia di mana e ottenere lo scudo.... Sostanzialmente potrebbe sembrare un nerf ma non lo è... Ti troveresti in svantaggio solo se vieni ingaggiato quando sei full mana nei primi livelli e devi scappare subito... Cosa che accade raramente ad un blitz.... La ulti invece ora la passiva non fa più danni a random ma li fa all ultimo bersaglio colpito","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-04-27T07:20:58.045+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BluCobalto92,realm=EUW,application-id=cAOZwaUi,discussion-id=ZXypAEu6,comment-id=00020000000000000000,timestamp=2019-04-27T07:19:21.189+0000)\n>\n> Al contrario.... Sarà ben contento del cambiamento.... La passiva se ricordo bene lo scudo di mana passa dal 50% del mana attuale al 30% del mana massimo... Il che vuol dire che 0uoi ingaggiare anche spendendo fino all ultima goccia di mana e ottenere lo scudo.... Sostanzialmente potrebbe sembrare un nerf ma non lo è... Ti troveresti in svantaggio solo se vieni ingaggiato quando sei full mana nei primi livelli e devi scappare subito... Cosa che accade raramente ad un blitz.... La ulti invece ora la passiva non fa più danni a random ma li fa all ultimo bersaglio colpito\n\nIo non ho ancora visto i cambiamenti non giudico su quelli,ma ricordo quanto ha sclerato quando gli hanno semplicemente levato il reset dell'AA sulla E (la forza inarrestabile XD) o del CD sulla ulti, quindi non immagino con cambiamenti più sostanziosi quanto bene reagisca.\nPer un otp di livello alto anche il cambio di una virgola risulta sempre pesantissimo all'inizio","replies":[{"poster":"sbepuz","date":"2019-04-27T11:26:09.854+0000","up_votes":1,"down_votes":0,"body":"è un bel buff per blitz\n\na parte lo scudo aumentato in caso di low mana su blitz\nhanno reworkato la ulti, ora non c'è più il danno casuale, ma si concentra un danno extra basato su ap/mana che fa un buon danno\n\nin pratica al posto dei fulmini random decidi tu a chi far danno, e in caso di grab su adc o qualcuno squishi....credo sia quasi unbalanced x)","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-04-27T12:05:01.319+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=sbepuz,realm=EUW,application-id=cAOZwaUi,discussion-id=ZXypAEu6,comment-id=0002000000000000000000000000,timestamp=2019-04-27T11:26:09.854+0000)\n>\n> è un bel buff per blitz\n> \n> a parte lo scudo aumentato in caso di low mana su blitz\n> hanno reworkato la ulti, ora non c'è più il danno casuale, ma si concentra un danno extra basato su ap/mana che fa un buon danno\n> \n> in pratica al posto dei fulmini random decidi tu a chi far danno, e in caso di grab su adc o qualcuno squishi....credo sia quasi unbalanced x)\n\nGne non sono convintissimo. \nLo scudo ora é aumentato in caso di low mana certo, ma blitz non é uno spammone ed a eccezione dell'early game quello scudo sarà quasi sempre più basso o comunque molto simile credo.\nIl cambio alla ulti é comodo ma non necessariamente un buff. Comodo perché certamente decidi a chi indirizzare il danno, ma anche uno svantaggio Perché il danno base poi viene dimezzato,aumentato di 10% lo scaling ap (che comunque non builda se non per trollare e nonostante sia aumentata la frequenza con cui colpisce  però bisogna aggiungere il secondo di carica da quando acquisisce il target. La forza sta più che altro nel poter colpire più nemici con la passiva, ma ciò implica che dovrebbe attaccare più nemici, non esattamente adatto al suo gameplay.\nMagari sbaglio, ma nel complesso mi sembra un leggero nerf al blitz supp mentre mi sembra siano ottimi buff per un eventuale blitz top.","replies":[{"poster":"sbepuz","date":"2019-04-27T12:20:34.175+0000","up_votes":1,"down_votes":0,"body":"per lo meno ora i mooby boots non verranno disattivati a caso in lane dalla passiva della ulti ^^","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-04-27T12:59:29.547+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=sbepuz,realm=EUW,application-id=cAOZwaUi,discussion-id=ZXypAEu6,comment-id=000200000000000000000000000000000000,timestamp=2019-04-27T12:20:34.175+0000)\n>\n> per lo meno ora i mooby boots non verranno disattivati a caso in lane dalla passiva della ulti ^^\n\nA beh quello si 😂","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Erax157","date":"2019-04-27T06:09:33.414+0000","up_votes":1,"down_votes":0,"body":"Beh si, ma questi sono champ abbastanza vecchi e sono prevalentemente adc o bruiser a parte 2  supporti e qualche mago. Quello che intendevo dire è che, tra i nuovi campionj, l'unico campione con una passiva origanale che abbiamo avuto è stata neeko","replies":[{"poster":"WÜLFGAR","date":"2019-04-28T07:08:44.663+0000","up_votes":0,"down_votes":0,"body":"Ma se ha gli aa potenziati ogni 2 ....(a parte il cambio di forma)","replies":[{"poster":"Erax157","date":"2019-04-30T10:44:12.892+0000","up_votes":1,"down_votes":0,"body":"È la passiva del E quella nona passiva vera","replies":[]}]}]}]},{"poster":"Aldebubi","date":"2019-04-27T12:29:13.565+0000","up_votes":3,"down_votes":0,"body":"Onestamente non sono d'accordo. Potrà essere un opinione personale, ma un campione non si rappresenta nella passiva, sicuramente alcuni citati lo fanno (Akali, Sylas). Ogni campione ha una abilità o un tratto distintivo che lo rende (in maniera più o meno marcata) unico. \nIn più altra cosa, non mi sembra che i campioni citati abbiano tutti passive uguali.\n{{champion:39}} faceva danno bonus sugli scudi, cosa che nessun altro fa in gioco\n{{champion:266}} applica un debuff unico (ok è simile a ferita grave, ma tanto ora lo tolgono)\nYuumi ottiene uno scudo che poi può trasferire agli alleati\n\nSe vogliamo parlare di passive banali io citerei {{champion:61}} {{champion:4}} {{champion:25}} {{champion:74}} e forse altri ma al momento non mi vengono in mente\nPer me è riduttivo parlare di auto-attacco potenziato, in quanto ognuno ha degli effetti secondari più o meno unici. Poi potrebbero anche aver avuto idee stra mega fantastiche, ma in termini di gameplay potrebbero non aver funzionato. Al contrario mi sembra che le passive recentemente siano più interessanti, come {{champion:10}}{{champion:136}}  {{champion:50}} (quello nuovo){{champion:164}} {{champion:84}} e anche l'update di quelle di {{champion:9}} {{champion:27}} \n\nEDIT. Magari Sylas si basa più sulla ulti che sulla passiva, mb","replies":[{"poster":"Erax157","date":"2019-04-27T19:13:52.840+0000","up_votes":1,"down_votes":0,"body":"Grazie al cavolo😂, è ovvio che gli effetti si debbano differenziare, ma sono e rimangono autoattacchi che come ho detto io, si differenziano per minimi particolari. Qui non si sta parlando di effetti delle abilità o di funzionalità del kit, queste capacità invece di affidarle a un autoattacco potevano essere fatte in altri modi. E comunque league of legends ha tantissimi campioni, non dico che tutti hanno le stesse passive, a parte che aurelion sol, camille, fiddlestick e singed sono abbastanza vecchiotti, la passiva di akali è sempre un autoattacco, però la sua si salva perchè fa parte del suo stule toccata e fuga, la passiva di swain invece è l'eccezione che conferma la regola. Comunque sia non è che ci si può giustificare con le passive originali, perchè quelle ci sono, ma quando vedi{{champion:517}}  e {{champion:142}} che hanno praticamente la stessa passiva, che è anche quella del{{item:3057}},  capisci che c'è qualcosa che non va😂😂😂\nPoi per quanto riguarda i kit in se dei campioni, se proprio si vuole cercare l'originalità lì è un altro discorso, fortunatamente i kit sono ancora vari.","replies":[]}]},{"poster":"Re Sombra","date":"2019-04-27T07:05:50.789+0000","up_votes":4,"down_votes":1,"body":"raga lol ha più o meno un centinaio e passa di campioni, e chiaro che certe cose le ripetano, perchè funzionano, è più facile autocopiarsi, e non poi  cosi tanto sbagliato, inoltre i champ nuovi sono differenti l uno dal' altro  per altre cose; questo ad esempio che è il primo supp che viene si ingloba dentro gli alleati, è il primo champ che ha una skill direzionabile col mouse...\nL' originalita ci sta in ogni campione anche in piccole cose.","replies":[{"poster":"Erax157","date":"2019-04-27T07:19:59.179+0000","up_votes":1,"down_votes":0,"body":"È ovvio che certe cose vanno a ripetersi ma se praticamente tutti i campioni recenti a parte rare eccezioni hanno passive ad autoattacchi e se addirittura due campioni{{champion:517}} {{champion:142}} hanno la stessa passiva, che tralaltro è anche la stessa passiva di un oggetto che esiste da eoni{{item:3057}} capisci che c'è qualcosa che non va. Oltretutto tu dici che l'originalità sta nelle piccole cose, è ovvio che i champ si differenziano per il concept, ma la passiva è la parte fondamentale che corona il tutto e rende i kit diversi, perchè le abilità sono sempre quelle, l'originalità nei kit ormai non esiste più, poi se ultimamente fanno i champ con dei concept spettacolari è un'altra cosa.","replies":[]}]},{"poster":"Due spade","date":"2019-04-27T10:43:15.039+0000","up_votes":2,"down_votes":0,"body":"Mordekaiser (per esempio) ha una sua unica passiva (e suprema), peccato che probabilmente col rework si andrà a perdere questa unicità. :v","replies":[{"poster":"Erax157","date":"2019-04-27T10:51:06.249+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Due spade,realm=EUW,application-id=cAOZwaUi,discussion-id=ZXypAEu6,comment-id=0006,timestamp=2019-04-27T10:43:15.039+0000)\n>\n> Mordekaiser (per esempio) ha una sua unica passiva (e suprema), peccato che probabilmente col rework si andrà a perdere questa unicità. :v\n\nSperiamo di no","replies":[]}]},{"poster":"BluCobalto92","date":"2019-04-27T07:23:07.644+0000","up_votes":2,"down_votes":0,"body":"Per quanto mi riguarda è vero che la maggior parte dei campioni ha passive che funzionano con gli aa ma i kit di per sé sono unici per ognuno inoltre trovo che le passive sugli aa servano a incentivare i bronzi silver (me compreso) a migliorare meccanicamente imparando a usare gli aa tra una spell e l altra e non a pare Q W E aa aa aa aa morto io o morto il nemico xD","replies":[]},{"poster":"V3LK0ZMAST3R","date":"2019-04-27T06:14:19.073+0000","up_votes":2,"down_votes":1,"body":"Ormai i champ stessi che creano hanno un kit privo di originalità, figuriamoci la passiva che é la parte più difficile da creare. Come hai detto la passiva di neeko é l'unica originale da ormai un sacco di tempo, anche quella di {{champion:163}} in realtà,ma parliamoci chiaro, fanno schifo e non danno un vero senso di identità al champ \nL'AA potenziato ormai é copiato e stracopiato, ma é una passiva che sostanzialmente va sempre bene ed é semplice da bilanciare.\nÉ inevitabile,finché mantengono la rotta di tanto danno e poche resistenze,qualsiasi cosa risulterà superflua o inutile (e quindi difficile da bilanciare) rispetto a dei bonus di semplice applicazione ","replies":[]},{"poster":"Axlander36","date":"2019-04-28T07:03:59.161+0000","up_votes":1,"down_votes":0,"body":"La Riot, a seconda dei momenti mette moveset simili. Pensa a kindred e Bard, usciti nello stesso momento.\nAnche tutti quelli che rubano qualcosa : sylas, neeko, zoe.\nCercano di utilizzare le idee che gli vengono in più modi possibili. \nLe passive si assomigliano solo perché devono essere equilibrate, non devono contare come una quinta spell (azir docet) ma non devono neppur essere inutili. Fatti sta che sono simili.\nP.S. Le passive di zoe e neeko sono diverse da quella di sylas, perché l'evaso si limita a fare danno ad area mentre le altre potenziano il dmg","replies":[{"poster":"sbepuz","date":"2019-04-28T10:13:11.916+0000","up_votes":1,"down_votes":0,"body":"> perché l'evaso si limita a fare danno ad area \n\nè la sua fonte principale di danno la passiva x)","replies":[]},{"poster":"Erax157","date":"2019-04-28T10:16:15.430+0000","up_votes":1,"down_votes":1,"body":"L'unica differenza tra le passive di zoe e sylas è che la passiva di sylas fa danno ad area, a me sembra un particolare abbastanza infimo per giustificarsi","replies":[]}]},{"poster":"MadGiorg","date":"2019-04-27T14:38:36.785+0000","up_votes":1,"down_votes":0,"body":"Sinceramente penso che però alcune di queste passive basate sugli aa siano accettabili. Ad esempio la passiva di{{champion:35}} funziona, lui è un assassino furtivo che colpisce alle spalle quando meno te lo aspetti, e quindi secondo me è perfetta. Per il resto è vero, molti campioni hanno passive simili o addirittura quasi identiche","replies":[{"poster":"Erax157","date":"2019-04-27T19:06:44.990+0000","up_votes":1,"down_votes":0,"body":"Non dico che passive simili non riassumono l'identità di un champ. Dico che ce ne sono troppe","replies":[]}]},{"poster":"LyuKk","date":"2019-04-26T22:03:23.451+0000","up_votes":1,"down_votes":0,"body":"Ti voglio ricordare anche il rework di teemo, che avra come passiva la sua E.{{sticker:sg-ezreal}}","replies":[]},{"poster":"WÜLFGAR","date":"2019-04-28T07:01:02.150+0000","up_votes":1,"down_votes":1,"body":"Sì, sono d'accordo, e poi ci sono passive così antiche quanto inutili, per esempio quella di anivia, con un cdr infinito, o quella di azir, inutile in 2 grandi fasi del game, cioè inizio e fine, anche qui una cdr mostruosa.... Non c'è nessun bilanciamento con passive tipo nautilus, shaco, ornn.... Riot su!","replies":[]}]}