{"poster":"7Soraka7","date":"2018-07-13T19:16:00.094+0000","title":"LoL ein Jump and Run game?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":9,"body":"Wie der Titel schon sagt habe ich das gef&uuml;hl das in LoL j&auml;gliche Spieltiefe verloren geht, als Supporter wie soraka wirst DU nur noch von Assasinen instant gekillt und Tower bieten keinen Schutz.\r\nDie Q ist der Fiesiste Streich von RIot an Soraka, Rip Soraka.\r\nAssasin Champs sind klar die gewinner und das weit ab von Spielerischen k&ouml;nnen, sind sie einfach viel zu stark.","replies":[{"poster":"clair de lune289","date":"2018-07-13T21:03:08.217+0000","up_votes":1,"down_votes":0,"body":"Soraka scheint mit jedem neuem Champ (genau wie viele andere \"ältere\" ober besser gesagt champs ohne perma dash und hard cc) schwächer zu werden.\nsie ist bei weitem nicht unspielbar und extrem stark **wenn** man keine Fehler macht,aber genau da liegt das Problem.\nso ziemlich jeder Spieler macht genug Fehler auf seinen besten Champs jedoch haben die neueren oder reworked Champs oft einen enormen Vorteil.\n\nPyke mit seiner Unsichtbarkeit,dem Heal wen er durch Champs schaden erlittenhat und der Ausmaß seines CC Potenzials ist da nur die Spitze des Eisbergs.\nCC,Dash oder gar Walljumps erlauben es einem wesentlich mehr Fehler z machen und dennoch leben aus einer schlechten Situation zu entkommen bzw den Champ ohne diese hinterherzujagen bis dieser Tod ist oder Hilfe kommt (sei es nun Tower,Minions oder verbündete Champs).\ndiese Fähigkeiten stellen dann auch noch oft genug sicher das man selbst wenn Hilfe kommt wieder sicher entkommt.\n\nich will nicht behaupten das Champs wie Pyke unbedingt leicht zu meistern sind,aber ihr Spielraum und Snowballpotenzial ist wesentlich höher.\n\nob diese neueren Champs balanced sind oder nicht ist mir in den meisten Fällen recht egal,allerdings haben die letzten Metaveränderungen + Pyke mich ernsthaft an meiner bis dato Lieblingsrolle (ver)zweifeln lassen (Mainsupport)\nChamps mit denen ich sehr viel Spaß hatte fühlen sich nicht mehr gut an, nicht weil ich ein Problem mit dem verlieren/gewinnen habe sondern weil es so viele Champs bzw Champcombos gibt gegen die das Spielen einfach keinen Spaß macht.\nes fühlt sich unfair an gegen bestimmte Champs zu spielen ob diese nun gewinnen oder nicht ist dabei irrelevant.\n\nps: sry,ist wohl doch ein etwas ausführlicher qq Post geworden als ich gedacht habe.","replies":[{"poster":"Veezey","date":"2018-07-13T23:12:31.883+0000","up_votes":1,"down_votes":0,"body":"Also ich finde Pyke an sich echt genial. Vorher hatte ich, wenn ich mal supporten musste Sona oder Leona gespielt, weil sie eben leicht sind. Aber Pyke ist genau der Supporter den ich gebraucht habe xD","replies":[{"poster":"clair de lune289","date":"2018-07-14T00:05:38.759+0000","up_votes":4,"down_votes":0,"body":"ich kann durchaus verstehen warum Spieler Pyke mögen,aber darum ging es mir nicht.\nPykes Champkit ist einfach überladen mit utility.\nmit Pyke kann man sich so viele Fehler erlauben und muss dennoch nicht unbedingt sterben.\nim Gegenzug hat er aber so viel CC wenn er richtig gespielt wird,das 1 Fehler gegen ihn recht schnell tödlich endet.","replies":[{"poster":"Plug In Baby","date":"2018-07-14T13:33:53.458+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=KYnfKGf0,discussion-id=nv7EwQGc,comment-id=000300000000,timestamp=2018-07-14T00:05:38.759+0000)\n>\n> ich kann durchaus verstehen warum Spieler Pyke mögen,aber darum ging es mir nicht.\n> Pykes Champkit ist einfach überladen mit utility.\n> mit Pyke kann man sich so viele Fehler erlauben und muss dennoch nicht unbedingt sterben.\n> im Gegenzug hat er aber so viel CC wenn er richtig gespielt wird,das 1 Fehler gegen ihn recht schnell tödlich endet.\n\nmit pyke kann man sich viele fehler erlauben? xd\nHast du den Char schonmal gespielt?","replies":[{"poster":"clair de lune289","date":"2018-07-14T16:56:55.229+0000","up_votes":3,"down_votes":0,"body":"die Aussage bezog sich auf seine Fehlertoleranz im **Vergleich** zu anderen älteren Supportchamps.\n\nim Vergleich zu Sona,Soraka oder sogar Leona kommt Pyke bei weitem besser weg.\ngehst du z.b. mit einem dieser Champs zur falschen Zeit warden verlierst du mit etwas \"Glück\" nur einen Summonerspell(oder in Leonas Fall die Ulti), Pyke hingegen kann wenn er sein kit ausspielt noch gut entkommen (Achtung diese Aussage bezieht sich nur unterschiedlichen Supports)\n\nandere Situation\nLeona startet einen Engage zum falschen Zeitpunkt entweder sie kommt gar nicht erst rein oder sie sitzt im Kampf fest und kann evt zumindest den Mitspielern etwas Zeit verschaffen,aber eine wirkliche Chance hat sie kaum noch.\nder entscheidende Unterschied bei Pyke ist wieder das er sowohl bei seinem Pull als auch bei seinen stealth Engage diesen nicht ausführen muss,er hat mMn noch eine reelle Chance da ohne Schaden für sein Team rauszukommen.\n\nich wiederhole es gern noch einmal \n\n**an keinem Punkt behaupte ich das solche Sachen auf Pyke einfach sind,geschweige denn das ich dazu in der Lage bin diese zu tun**  was ich hier kritisiere ist das **Potenzial** das Pykes kit bietet im Vergleich zu Sona,Soraka,Leona und co\n\nich behaupte auch nicht das diese älteren Champs zu schwach oder nutzlos sind,sondern das diese Champs bei einem eigenen Fehler weniger Optionen in ihrem kit haben.\ndazu kommt dann noch die Tatsache das Champs wie Sona,Soraka richtig gespielt die Lane durchaus dominieren können,aber sie können einen einzigen Fehler bei weitem nicht so extrem bestrafen wie Pyke bzw tragen wenn sie es doch können (Leona) ein höheres Risiko.\n\nim derzeitigen Spielzustand kann ein solcher Fehler in frühen Spiel sehr stark beeinflussen.\nPyke ist übrigens auch keine Ausnahme,fast alle neueren oder überarbeiteten Champs haben ähnliche kits\nman könnte sagen das gleicht das ganze ja wieder aus,\n\naber ganz ehrlich ? \nmir geht es ganz schön auf die Nerven das es so viele Champs gibt die entweder eine extrem hohe Engage Range,Walljumps (die nicht einmal skillshots sind) oder spammbaren dash/cc haben.\nzusammen mit dem \"Quest-sightstone\" fühlt sich das Spiel sehr schnell \"unfair\" an(auch wen dem faktisch nicht unbedingt so ist) selbst wen nichts auf der eigenen Lane passiert.","replies":[]}]},{"poster":"Nordwolf87","date":"2018-07-14T07:48:19.056+0000","up_votes":2,"down_votes":0,"body":"Seh ich genauso. Das Kit ist schlichtweg überladen.","replies":[]}]}]}]},{"poster":"Alpacana","date":"2018-07-13T19:23:42.271+0000","up_votes":3,"down_votes":0,"body":"Naja...Assassinen sind der natürliche Counter zu Squishies, so ist das nunmal.\nMeiner Meinung nach ist aber beides balanced, Assassinen sind nicht zu stark und \"Dinge\" wie Soraka sind nicht zu schwach.\nWenn das Gegnerteam einfach viel Burst-Damage hat, nimm einfach mal Barrier mit wenn du unbedingt Soraka da rein spielen willst.","replies":[]},{"poster":"SkyFallenNerox","date":"2018-07-13T19:26:26.162+0000","up_votes":3,"down_votes":4,"body":"Soraka ist seit ihrem Rework bad geworden das sie kein Mana mehr geben kann. die neue ist zwar nicht schlecht aber ich vermisse mehr sie alte {{sticker:sg-soraka}}","replies":[{"poster":"Nycaria","date":"2018-07-14T07:36:35.693+0000","up_votes":2,"down_votes":1,"body":"Soraka ist nicht bad geworden. Nur anspruchsvoller zu spielen ;) Ich stimme dir zwar zu, dass der E Change in gewisser Weise traurig ist, aber come on: Ein AoE Silence Feld hat schon was ^^","replies":[{"poster":"Plug In Baby","date":"2018-07-14T13:35:05.392+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Nycaria,realm=EUW,application-id=KYnfKGf0,discussion-id=nv7EwQGc,comment-id=00020000,timestamp=2018-07-14T07:36:35.693+0000)\n>\n> Soraka ist nicht bad geworden. Nur anspruchsvoller zu spielen ;) Ich stimme dir zwar zu, dass der E Change in gewisser Weise traurig ist, aber come on: Ein AoE Silence Feld hat schon was ^^\n\nDer alte E war traurig und viel schlechter als der neue, warum weinen eigentlich alle :D\nIn League hat doch eh kein ADC Manaproblem, der alte e war so nutzlos....\nAber dass Silberspieler einen AOE instant Silence nicht richtig benutzen oder wertschätzen können, ist schon klar :D","replies":[{"poster":"Sirrkas","date":"2018-07-14T18:30:29.849+0000","up_votes":2,"down_votes":0,"body":"Ein paar Vorteile hatte der richtig alte E durchaus. Ganz am Anfang konnte man sich selbst Mana geben. Man konnte wirklich stump W und E spammen und damit den Lanepartner permanent hochheilen. Allerdings empfinde ich das Silencefeld meist als besser, als den Onclicksilence.","replies":[]},{"poster":"SkyFallenNerox","date":"2018-07-16T22:53:59.336+0000","up_votes":1,"down_votes":0,"body":"das spiel mal mit einen ADC die ich immer in games bekomme. ich komme auf die Lane back als ich kurz shoppen war oder tot und mein ADC ist bei 0 Mana -_- und es war kein gegner weit und breit da. was hat der gemacht? gibt es jetzt nen neuen Champ der mana klaut von dem ich nix weis und der unsichtbar durch die map läuft? \n{{sticker:sg-lux-2}}","replies":[]},{"poster":"OrangeBubble","date":"2018-07-14T15:57:08.222+0000","up_votes":1,"down_votes":0,"body":"Die APC auf der Botlane würden sich über free mana freuen \n{{sticker:sg-soraka}}","replies":[{"poster":"eingew","date":"2018-07-16T04:55:18.043+0000","up_votes":1,"down_votes":0,"body":"Naja, allerdings gibt es für die sehr gute Itemalternativen. Bei einem Engage der Gegner ist mir ein AoE Silence deutlich lieber als ein bisschen Mana ;P.","replies":[]}]},{"poster":"Nycaria","date":"2018-07-14T18:06:37.627+0000","up_votes":1,"down_votes":0,"body":">Aber dass Silberspieler einen AOE instant Silence nicht richtig benutzen oder wertschätzen können, ist schon klar :D\n\nAuf wessen Elo hackst du nun hier bitte rum? :D Ich bin weder Silber, noch beschwere ich mich darüber, dass der Silence bad ist. Ich sagte nur, dass es in gewisser Weise schade ist, dass die Mana Mechanik entfernt wurde ;) Bitte genauer lesen :)","replies":[]}]}]}]},{"poster":"Gods Last Gift","date":"2018-07-13T19:23:05.673+0000","up_votes":3,"down_votes":1,"body":"Komisch dass ich mit meinem duo mate , der nur soraka spielt , alles abreiße.\nEs gibt so ein magisches item , welches gegen assassins gut ist {{item:3047}}","replies":[{"poster":"Nycaria","date":"2018-07-14T07:35:19.235+0000","up_votes":1,"down_votes":0,"body":"Verrate doch nicht die ganzen geheimen Tricks! o:","replies":[]}]}]}