{"poster":"Shiori Tanaka N7","date":"2019-06-24T02:00:23.443+0000","title":"League of Legends Iran","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":1,"body":"Liebe League Community, \r\n\r\nnormalerweise halte ich mich bei schwerer Kost raus somit auch bei politischen Diskusionen. Da Die Meinungen da sehr weit auseinander gehen und ich ein Gamer in erster Linie bin und als solcher ist es mir egal wie, wo, was und wo. Wir sind Gamer und das eint uns im Herzen. Egal welche Religion, Glaube, recht etc, bisher standen wir stets zusammen, spielten und wurden eine der größten Commiunitys überhaubt.\r\n\r\nDoch leider wie ihr vielleicht schon bemerkt habt, haben gewisse POLITISCHE Spannungen dazu geführt das der Iran kein LoL spielen darf. \r\nVielleicht fragt ihr euch nun, was geht uns das an? ODer was will Shiori von uns? Diese Fragen sind berechtigt und ich möchte sie euch beantworten.\r\n\r\nEs liegt mir fern mir an zu maßen mich in die politischen Geschicke anderer Länder ein zu mischen egal ob ich sie für schlecht oder gut empfinde.\r\nJedoch kann ich nicht verstehen oder hin nehmen das die USA nun sogar so weit gehen und durch ihr Handeln uns Gamer entzweien. Warum darf der Iran nicht mehr mit spielen? Nun die Mikrotransaktionen die durch League möglich sind um Skinns etc zu kaufen fallen unter das Wirtschafts bzw. die Handelssanktionen und somit wars das.\r\n\r\nWisst ihr ich habe einige Freundinnen und Freunde da, diese sind zumindest noch nie so weit mir bekannt negatiev aufgefallen und waren mir in manch schwerer Zeit nicht nur treue Freunde sondern eine echte Hilfe.\r\nIch verstehe warum RIOT sich fügen muß doch ich hoffe das es eine Lösung geben könnte. Zb. indem RIOT die Mikrotransaktionen deaktiviert und somit das Spiel selbst wieder möglich macht.\r\nWas hat das mit euch zu tun liebe Freunde und Commiunity? Nun, wir sind alle Gamer, und als solche sollten wir zusammen stehen, sollten auf Unrecht Aufmerksam machen und versuchen gemeinsam Lösungen zu finden auf einem friedlichen und nicht provokanten Weg. Den schreien, Gewalt und pöbeln, sind Mittel auf welche wir gern verzichten können und auch sollten. Alle Welt lacht gern über uns und behaftet uns mit Klisches, doch andererseits sind wir es die einen Milliaredenschweren Markt Weltweit ermöglichen.\r\n\r\nIch selbst war lange Zeit bei der Marine weswegen mir noch immer gewisse Sanktionen auferliegen und deswegen wende ich mich an euch. Aber auch wegen meiner eigenen Fehlbarkeit. Ich bitte euch auf Reddit, Facebook, Twitter usw. darauf aufmerksam zu machen, ich bitte euch dies nur zu tun wenn ihr meine Meinung teielt und auch dies ohne Gewallt oder andere Formen von Ausuferungen zu tun. Sicher denken nun viele, was verspricht sich Shiori davon. \r\n\r\nNun, ich hoffe das der Wiederstand gegen diese Ungerechtigkeit so groß wird das wir als vereinte Stimme gehört werden, das wir zeigen wir sind Gamer/innen und stehen zusammen und aufgrund dessen vielleicht eine Möglichkeit gefunden wird, League wieder im Iran zugänglich zu machen. Was können die Zivillisten denn dafür das ihr Regierung und jene der USA im Zwiespallt liegen? Ist es wirklich richtig alles und jeden zu sanktionieren für fehler, verbrechen etc die der einzelne nicht begangen hat geschweige denn die Mehrheit? Ich möchte nicht über die Schuldfrage diskutieren soindern darauf aufmerksam machen, das ich gerade eine Iranische Freundin am Telefon habe die weint weil sie nicht mehr spielen kann, weil sie sanktioniert wird für Dinge die sie nicht getan hat wie viele andere auch nicht.\r\n\r\nSicher mag das für viele Bereiche gelten doch ich berufe mich hier auf uns Gamer. Sind wir wirklich bereit untätig unserer eigen bequemlichkeit wegen nichts zu sagen? Sind wir bereit weiterhin den Eindruck zu erwecken wir wären nur Nerds die nichts weiter als zocken können und sich lieber im dunklen Zimmer verschantzen?\r\nIch bin es nicht! Daher bitte ich euch aufrichtig um Hilfe. N icht für mich, sondern für jene die unschuldig leiden müssen wie so oft im großen Getriebe der Welt.\r\nErneut, ich rufe nicht zu Straftaten, Gewallt etc auf. lediglich bitte ich um Hilfe das ihr vielleicht eure Meinung oder diesen Post etc, verbreitet wo auch immer es möglich ist. Es darf nicht sein das immer mehr Freiheiten beschnitten werden und ich lernte einmal, wer dabei tatenlos zu sieht bzw generell bei Unrecht macht sich selbst schuldig,\r\n\r\nIch denke mein Anliegen verstöst gegen keinerlei regeln hier dennoch habe ich doch bedenken. Jedoch hoffe ich zum einen das diese unbegründed sind und zweitens, das ich vielleicht helfen konnte einen kleinen Stein ins Rollen zu bringen welcher eine lavine Auslöst. Nehmt es mir nicht übel, jedoch verachte ich ungerechtigkeit insbesondere wenn es darum geht Menschen eines der wenigen Dinge zu nehmen die sie vielleicht noch mit Freude erfüllt in Zeiten welche sehr hart sein dürften wie eben zb im Iran.\r\n\r\nIch bitte auch euch liebe Supporter falls ihr eine Möglichkeit set meinen PÜost weiter zu leiten. Vielleicht arbeitet RIOT bereits an einer Lösung. Daran glaube ich fest. Vielleicht deaktivieren sie die Mikrotransaktionen eben für diese Zeit was zwar auch sehr schade ist, jedoch wenigstens gewährleisten würde das die Sanktionen nicht greifen und der Iran wieder spielen könnte.\r\n\r\nDies ist kein politisches Statement! Lediglich ein Hilferuf. Ich fühle mit diesen Menschen und genau das sollten wir uns einmal vor Augen halten. Sie sind Menschen wie wir auch. Wie würden wir uns in so einer Situation fühlen und wie dankbar wären wir für jede Hilfe? Es gab doch schon genug Leid...ich hoffe inständig das dieser aufruf vielleicht ein kleines bisschen hilft eine Lösung zu finden. Und selbst wenn 1000 Menschen mich nun auslachen und \"nur\" Zwei meine Ansichten teilen, so hat es sich gelohnt denn es sind Zwei mehr als vorher und somit sind wir zu dritt, sind wir bereits ein Verbund, sind wir bereits Gamer die zusammen stehen...\r\n\r\nIch bedanke mich herzlich für eure zeit meine liben Freunde und hoffe ihr habt einen schönen Morgen.\r\n\r\n\r\n( P.s.: ich weiß das dürfte ein kritisches Thema sein, jedoch hoffe ich niemanden damit verletzt zu haben oder eine regel gebrochen zu haben. Sollte dem so sein, bitte ich ehrlich um entschuldigung. Es war und ist nicht meine Absicht Regeln zu brechen und auch die politik ist nicht mein ziel da dies andere zu entscheiden haben. Ich habe nur nach Solidarität gefragt und hoffe das das so in ordnung ist. Verzeiht falls nicht und weist mich bitte gern darauf hin. Doch manchmal kann selbst ich nicht tatenlos zusehen... )","replies":[{"poster":"Asulia","date":"2019-06-24T05:51:14.847+0000","up_votes":1,"down_votes":5,"body":"Wenn der Iran jetzt ein Opfer wäre. ok.\nDer Iran ist aber ein aktiver Kriegstreiber, der die Leiden in der Welt unnötig verlängert und für seine regionalen Interessen über Leichen geht, sei es im eigenen land oder woanders.\nTut mir echt leid für die Bevölkerung des Iran, das die kein Lol spielen können, während unterdesssen der Iran dafür sorgt, das anderswo die Bevölkerung verhungert und mit Bomben eingedeckt wird.\nArmes Iranisches Volk, was ist denn mit dem Libanesischen Volk zum Beispiel die ausgerottet werden weil es dem Iran gerade so passt, und und und, ganz ehrlich, der Iran geht mir deswegen gerade mal am Arsch vorbei.","replies":[{"poster":"Uranbrennstab","date":"2019-06-24T06:30:35.389+0000","up_votes":5,"down_votes":2,"body":"Wow. Du bist nicht gerade informiert oder? \"Der Iran\" ist in erster Linie ein Opfer der islamischen Revolution der späten 70er Jahre. Von aktiven Kriegstreibern zu sprechen, wenn es Länder wie die USA, Saudi-Arabien, die EU und Russland gibt ist halt auch kein Argument. Ver würde denn nicht die eigenen Interessen verfolgen? Oder denkst du, Deutschland ist da eine Ausnahme? Dann muss ich dich schwer enttäuschen.","replies":[{"poster":"Asulia","date":"2019-06-24T06:35:10.721+0000","up_votes":1,"down_votes":3,"body":"Als ob ich auf der Bremssuppe hergeschwommen wär.\nWas ist das für eine Diskussionskultur, der hat mich geflamet jetzt flame ich zurück, es geht hier doch um den Iran oder irre mich da, steht da oben USA Deutschland und Saudiarabien.\nUnd nur weil die USA krieg treiben darf der Iran das auch, man man geh wieder in den Kindergarten.","replies":[{"poster":"Uranbrennstab","date":"2019-06-24T06:49:10.579+0000","up_votes":6,"down_votes":0,"body":"Deine gesamte Argumentation ist, dass du die Bevölkerung eines ganzen Landes verdammt die seit über 30 Jahren unterdrückt werden. Also was genau ist dein Punkt?","replies":[]},{"poster":"GitGudOrDie","date":"2019-06-26T07:38:30.354+0000","up_votes":3,"down_votes":0,"body":"naja man sollte sich wehren dürfen... die USA waren zuvor im Iran ;) und haben es so gelenkt das die USA öl bekommen... das macht die USA in länder einfallen wo es Öl gibt und dann einen USA überzeugten in die Regierung bringen um das Öl zu bekommen... und dass es den terror gibt und \"Heilige Krieger\" ist die USA dran schuld... \n\n\n1980-1988, Iran/Irak: 1979 muss im Iran der US-Statthalter Shah Reza Pahlewi dem Shiitenfuhrer Ayatolla Chomeini Platz machen. US-Präsident Carter stellt daraufhin die nach ihm benannte Doktrin auf: \"Ein Versuch einer dritten Macht, Einflussnahme im Persischen Golf zu erreichen, wird als ein Anschlag gegen lebenswichtige Interessen der Vereinigten Staaten gewertet und wird mit allen notwendigen Mitteln, einschließlich militärischer Gewalt, zurückgeschlagen.\" Die USA rüsten den Irak mit modernsten, auch chemischen Waffen zum Angriff auf den Iran aus. Mit Beginn der Offensive 1980 wird der Irak auch mit Aufklärungsmaterial von Satelliten und Awacs-Flugzeugen unterstützt. In dem achtjährigen Krieg kommen Hunderttausende ums Leben,. 1984 schießen die USA zwei iranische Kampfflugzeuge über dem Persischen Golf ab, 1987 holt das US-Kriegsschiff \"Vincennes\" einen iranischen Airbus runter - 270 Zivilisten finden den Tod. Durch die militärische Unterstützung der USA wird der Irak zur regionalen militärischen Großmacht.\n\n(Schah Mohammad Reza Pahlavi (1941–1979) leitete ab 1963 mit der „Weißen Revolution“ umfangreiche wirtschaftliche, politische und soziale Reformen ein. Mit den steigenden Öleinnahmen konnte ein Industrialisierungsprogramm aufgelegt werden, das den Iran in wenigen Jahren von einem Entwicklungsland zu einem aufstrebenden Industriestaat machte. Industrialisierung und gesellschaftliche Modernisierung führten von Beginn an zu Spannungen mit den konservativen Teilen der schiitischen Geistlichkeit. Insbesondere der Ajatollah Ruhollah Chomeini sprach sich bereits 1963 gegen das Reformprogramm aus. Neben der islamischen Opposition, der Fedajin-e Islam, bildete sich eine Linke Guerillabewegung im Iran, die das Land mit „bewaffnetem Kampf“ verändern wollte. Die ab 1977 erfolgende politische Liberalisierung ermöglichte es der Opposition, sich zu organisieren. Es kam zu gewaltsamen Demonstrationen, Mord- und Brandanschlägen, die das Land in seinen Grundfesten erschütterten. Nach der Konferenz von Guadeloupe im Januar 1979, auf der der französische Präsident Valéry Giscard d’Estaing, Präsident Jimmy Carter aus den Vereinigten Staaten, Premierminister James Callaghan aus dem Vereinigten Königreich und Bundeskanzler Helmut Schmidt beschlossen hatten, den Schah nicht mehr zu unterstützen und das Gespräch mit Ajatollah Ruhollah Chomeini zu suchen, verließ Mohammad Reza Pahlavi den Iran. Die islamische Revolution hatte begonnen.)\n\nGleichzeitig unterstützen die USA den Iran mit dem Ziel, dass die beiden Länder sich gegenseitig matt setzen. Über Israel werden Waffen im Wert von 80 Milliarden Dollar an den Iran geliefert. Das Waffengeschäft mit dem Iran wird am US-Kongress vorbei abgewickelt. Mit den iranischen Milliarden kann die Reagan-Regierung in aller Welt \"Contras\", Söldnereinheiten gegen missliebige Regierungen, unterhalten.\n\n1980-1990, Afghanistan: Die CIA heuert aus allen arabischen Ländern Aktivisten des islamischen Fundamentalismus an, um sie als \"Heilige Krieger\" gegen die von den Sowjets gestützte Regierung in Afghanistan einzusetzen. Zu den von der CIA ausgebildeten Terroristen gehört auch bin Laden, dessen Organisation ,,Al-Qaida - Die Basis\" unter der Ägide der CIA entsteht. Zur Finanzierung der Guerilla organisiert die CIA zusammen mit dem pakistanischen Geheimdienst den Drogenanbau in Pakistan und den \"befreiten\" Gebieten Afghanistan. Der Drogenhandel in alle Welt wird mit Hilfe der CIA-Logistik bewerkstelligt. Die \"arabischen Afghanen\" der CIA finden nach der Niederlage der Sowjetunion in den USA ein neues Ziel ihres \"Heiligen Krieges\"\n\nund da ist noch eingies mehr wo die CIA ein staatsoberhaupt stürzen weil sie nicht Pro USA sind usw. http://derfunke.at/nostalgie/hp_artikel/usverbrechen.htm\n\nDie USA sind gut darin in ihren Interesse zu handeln und wenn was schief geht haben sie nichts gemacht...","replies":[]}]}]},{"poster":"Necromant","date":"2019-06-24T06:13:12.254+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Asulia,realm=EUW,application-id=YnZkMR0R,discussion-id=bJwbJ9W0,comment-id=0001,timestamp=2019-06-24T05:51:14.847+0000)\n>\n> Wenn der Iran jetzt ein Opfer wäre. ok.\n> Der Iran ist aber ein aktiver Kriegstreiber\n\nJain. Schielt Richtung US und A.","replies":[{"poster":"Asulia","date":"2019-06-24T06:32:20.090+0000","up_votes":1,"down_votes":3,"body":"Klar. Gar keine Frage das die Bande kein Stück besser ist. Mit den Saudischen Waffenbrüder die absolute Pest.\nAber er hat zu stark in die Opferkerbe geschlagen.\nIch bin absolut ein Freund des Iran, vom Volk und Land wohlgemerkt, immerhin kommen da die schönsten Frauen her, aber Ich mag auch den Libanon und Jemen.","replies":[{"poster":"Necromant","date":"2019-06-24T06:34:16.362+0000","up_votes":3,"down_votes":0,"body":"Ich bin mit solchen Behauptungen halt immer vorsichtig, weil jedes Land Dreck am Stecken hat und da mit dem Finger nur auf eines zu zeigen ... naja :D u know what i mean","replies":[{"poster":"Alustus","date":"2019-06-24T08:26:09.934+0000","up_votes":2,"down_votes":0,"body":"Es ging auch nicht darum den iran schlecht zu reden.\nSondern so wie ich es verstanden habe einfach darum das der TE den Iran in eine reine Opfer rolle gesteckt hat, aber dieser auch kein Unschuldslamm ist.\n\nUnd ich bin auch der Meinung, dass die USA momentan sehr sehr fragwürdig agiert und seid Jahren/Jahrzehnten dafür sorgt das die Region instabil bleibt um immer wieder an Schürfrechte etc. zu kommen.\n(Tut die EU, Russland... auch nur mMn nicht so massiv)","replies":[]}]},{"poster":"4 For Maggie","date":"2019-06-24T08:05:42.416+0000","up_votes":1,"down_votes":0,"body":">  immerhin kommen da die schönsten Frauen her\n\nlol XD Niemals. Es gibt ein paar Ausnahmen, aber die gibt es überall.","replies":[{"poster":"Alustus","date":"2019-06-24T08:28:12.946+0000","up_votes":1,"down_votes":0,"body":"Geschmäcker sind verschieden darum macht es mMn auch keinen Sinn sich über soetwas zu \"streiten\".","replies":[]}]}]}]},{"poster":"NudehunterOlaf","date":"2019-06-25T06:41:59.387+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"eingew","date":"2019-06-25T10:28:15.011+0000","up_votes":1,"down_votes":0,"body":"Also, dass der Iran (damals noch \"Persien\" genannt) mal Gebiete am Mittelmeer hatte, ist schon bedeutend länger her als die Juden dort wieder hergezogen sind...","replies":[{"poster":"00 M4ddin 00","date":"2019-06-25T11:19:54.541+0000","up_votes":1,"down_votes":0,"body":"Ahhhh möchte aber darf nicht :0 \nMuss wieder stehen ! :0","replies":[]}]}]}]},{"poster":"Kira Rengami","date":"2019-06-25T13:14:15.820+0000","up_votes":1,"down_votes":4,"body":"Naja.. Amerika hat jeden Grund gegen den Iran vorzugehen... Wenn man z.b auf Ereignisse wie 9/11 zurück schaut...\nDavon abgesehen..\n\nBesitzt der Iran die Weltgrößte Atombomben Macht auf der ganzen Welt, und schmuggelt noch sonstige Waffen etc... Allein das ist schon ein Guter Grund, der Sache einhalt zu gebieten und dem Iran nicht länger zu erlauben, alles zu machen, was Er will.\n\nDann schießen die Jungs noch eine U.S Drohne ab {{sticker:zombie-brand-facepalm}}  ganz schlechter move..\nFalls es zum Krieg kommt, wissen wir ja, dass Amerika da leichtes Spiel hat. Man wird es wahrscheinlich nicht mal \"krieg\" nennen können, sondern eher \"Blitzkrieg\".\n\nStehe absolut auf der Seite von Amerika. Egal ob jemand Trump mag, egal ob jemand Amerika mag oder auch nicht. Bei so einer Situation kann ich die Reaktion sowie die aktuelle Lage/Situation 100% nachvollziehen, wenn man bedenkt dass das verhältnis zwsichen dem Iran und Amerika sowieso nicht gut war. ( 9/11 etc. siehe Anschläge, die alle vom Iran ausgeführt worden sind) bzw. generell der Iran Anschläge auf der ganzen Welt ausführt.\n\n\nDie aktuelle lage mal beiseite..\nDieser Move von Trump hat erstmal für den besten lachflash seit langen gesorgt xD Geiler. (wegen LoL)","replies":[{"poster":"eingew","date":"2019-06-25T16:52:05.872+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Kira Rengami,realm=EUW,application-id=YnZkMR0R,discussion-id=bJwbJ9W0,comment-id=0004,timestamp=2019-06-25T13:14:15.820+0000)\n>\n> Naja.. Amerika hat jeden Grund gegen den Iran vorzugehen... Wenn man z.b auf Ereignisse wie 9/11 zurück schaut...\n> Davon abgesehen..\n\nJa? Wieso? Viele davon waren aus Saudi-Arabien. Aus dem Libanon. Also wieso der Iran? Wieso nicht Saudi-Arabien? Und noch besser: Teile der Planungen wurden in Deutschland durchgeführt. Wieso nicht Deutschland?\n\nIch denke wir wissen es beide. Der 11. September ist relativ irrelevant die Aktionen der Vereinigten Staaten im nahen Osten. Wichtig ist nicht der ideologische Standpunkt, sondern die geopolitischen Faktoren.\n\n> Besitzt der Iran die Weltgrößte Atombomben Macht auf der ganzen Welt, und schmuggelt noch sonstige Waffen etc... Allein das ist schon ein Guter Grund, der Sache einhalt zu gebieten und dem Iran nicht länger zu erlauben, alles zu machen, was Er will.\n\nHm. Hättest du nicht Iran gesagt, hätte ich jetzt gedacht du redest von Frankreich. Oder England. Hättest du nicht \"Atombombe\" gesagt hätte natürlich auch Deutschland, die Schweiz oder hundert andere Länder, vor allem aus Europa, aber auch die Amis selbst, hätten da hinein gepasst.\n\nVerstehe ich das richtig, dass du hier zum Kampf gegen die meisten Länder der Welt aufrufst?\n\n> Dann schießen die Jungs noch eine U.S Drohne ab {{sticker:zombie-brand-facepalm}}  ganz schlechter move..\n\nJoa, kann ja nicht jeder so hörig sein wie Deutschland.\n\n> Falls es zum Krieg kommt, wissen wir ja, dass Amerika da leichtes Spiel hat. Man wird es wahrscheinlich nicht mal \"krieg\" nennen können, sondern eher \"Blitzkrieg\".\n\nJo. Du weißt halt schon, dass der nächstvergleichbare Krieg der Vereinigten Staaten, der in Afghanistan, nicht ganz so berauschend läuft?\nAmerika will den Iran nicht vollständig besetzen. Mit welcher Rechtfertigung? Wie sollen sie ihre Bevölkerung davon überzeugen?\n\nUnd selbst wenn wir das alles mal annehmen, was haben sie davon? Der Iran ist nicht der wichtige Feind. Alles, was die könnten, wenn sie wollten, wäre eine Weile die Straße von Hormus blockieren. Was Amerika in kurzer Zeit egal werden wird, weil die ihre Ölproduktion mittlerweile so weit hochgeschraubt haben, dass sie auf die Spitze der größten Ölproduzenten der Welt klettern, was ihnen die Lieferungen aus Saudi-Arabien erspart.\nDerweil lacht sich China einen Ast ab und breitet sich gemütlich aus.\n\nAmerika hätte ein leichtes Spiel ja. Ein leichtes Spiel, seine Zeit für nutzlosen Schwachsinn zu verschwenden.\nWobei das andererseits ja eines der Lieblingsspiele von denen geworden zu sein scheint.\n\n> Stehe absolut auf der Seite von Amerika. Egal ob jemand Trump mag, egal ob jemand Amerika mag oder auch nicht. Bei so einer Situation kann ich die Reaktion sowie die aktuelle Lage/Situation 100% nachvollziehen, wenn man bedenkt dass das verhältnis zwsichen dem Iran und Amerika sowieso nicht gut war. ( 9/11 etc. siehe Anschläge, die alle vom Iran ausgeführt worden sind) bzw. generell der Iran Anschläge auf der ganzen Welt ausführt.\n\nDas ist dann wohl deine Meinung. Hat zwar nichts mit der Realität zu tun, aber das muss es ja nicht unbedingt. Kleiner Tipp: Einer der ganz großen in diesem Spiel ist Saudi-Arabien. Wer deren Hegemonie in der Ecke wohl so stark unterstützt?\n\n> Die aktuelle lage mal beiseite..\n> Dieser Move von Trump hat erstmal für den besten lachflash seit langen gesorgt xD Geiler. (wegen LoL)\n\nAuch von mir ein herzliches Beileid.","replies":[{"poster":"Kira Rengami","date":"2019-06-25T18:51:30.306+0000","up_votes":1,"down_votes":4,"body":"1. Afghanistan ist ein Konflikt und kein Krieg. Davon abgesehen... gibt es da feste Befehle, heißt also : Die USA darf da nicht alles und jeden töten. bzw. darf erst schießen nach 3. Verwarnungen bzw. Wenn Beschuss auf Truppen ist. Davon abgesehen hat in Afghanistan nicht nur die USA sondern auch andere Länder mitzureden, wie, wo und was gemacht wird. 100% könnten Sie Afghanistan innerhalb einer Woche clearen und den Konflikt beenden, wenn Sie nur wollten.\n\n2. Der Iran hat 1. Die Weltgrößte Atombomben Macht und 2. Verfügt der Iran über eines der größten Illegale Waffenarensale.\n   Selbst wenn die Angriffe bzw. Anschläge ein anderes Land oder eine andere Macht ausgeführt haben. Dann haben Sie mit großer Sicherheit die Waffen und das Material aus dem Iran.\n\n3. In Deutschland passiert das nur, weil das ganze gesocks reingelassen wird. Warum? Ist mir ehrlich gesagt unbegreiflich.\n   Aber wenn die Demokratie weiterhin Anschläge in Deutschland riskieren will, dann lasst Sie nur rein.\n\n4. Das ist nicht nur meine Meinung, sondern auch die Sicht vieler anderer. Bestätigt sich durch einfaches  \"googeln\"\n\nMal zusammengefasst... bin ich kein Fan von Trump, auch kein rasist oder sonstiges.. etc.\nsondern lediglich einer, der die aktuelle Lage sieht, wie Sie auch ist.\n\n... Jedoch bin ich mir ziemlich sicher, dass die ganze Sache sehr böse ausgehen wird.\nEgal wie es auch kommen wird, der Iran wird den kürzeren ziehen.\nDie folgen kann sich denke ich jeder denken.\n\nP.S Wenn man in die Geschichte schaut bzw. in die Bücher, dann gibt es schon viel zu lange frieden... war klar, dass früher oder später mal wieder etwas passiert.","replies":[{"poster":"eingew","date":"2019-06-26T04:56:13.081+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Kira Rengami,realm=EUW,application-id=YnZkMR0R,discussion-id=bJwbJ9W0,comment-id=000400000000,timestamp=2019-06-25T18:51:30.306+0000)\n>\n> 1. Afghanistan ist ein Konflikt und kein Krieg. Davon abgesehen... gibt es da feste Befehle, heißt also : Die USA darf da nicht alles und jeden töten. bzw. darf erst schießen nach 3. Verwarnungen bzw. Wenn Beschuss auf Truppen ist. Davon abgesehen hat in Afghanistan nicht nur die USA sondern auch andere Länder mitzureden, wie, wo und was gemacht wird. 100% könnten Sie Afghanistan innerhalb einer Woche clearen und den Konflikt beenden, wenn Sie nur wollten.\n\nJaja ich weiß. \"Intervention\" nennen die das. Ein ähnlich schöner Euphemismus, wie wenn man davon spricht ein Land zu \"clearen\".\n\nMassenmord würde ich das nennen. Aber ich bin ja auch bloß Zivilist.\n\n> 2. Der Iran hat 1. Die Weltgrößte Atombomben Macht und 2. Verfügt der Iran über eines der größten Illegale Waffenarensale.\n>    Selbst wenn die Angriffe bzw. Anschläge ein anderes Land oder eine andere Macht ausgeführt haben. Dann haben Sie mit großer Sicherheit die Waffen und das Material aus dem Iran.\n\nOder eben, was bedeutend wahrscheinlicher ist, aus einem der Länder, die die meisten Waffen der Welt herstellen. [Die eben größtenteils in Europa hocken](https://de.wikipedia.org/wiki/R%C3%BCstungsindustrie). Du findest zu fast jedem halbwegs größeren (sprich: für die Absatzmärkte lohnenden) Konflikt Bilder mit deutschen Waffen. So auch in [Afghanistan](https://www.welt.de/politik/ausland/article4983378/Taliban-kaempfen-mit-modernen-deutschen-Waffen.html). So auch im [Jemen.](https://www.imi-online.de/2019/03/28/deutsche-waffen-toeten-im-jemen-krieg/) Und wenn du noch ein bisschen googelst findest du sicherlich noch mehr ^^.\n\nUnd, rechtfertigt das jetzt, alle Länder in Europa zu sanktionieren? Inklusive der Bevölkerung?\nWeißt du, warum die Welt nicht so funktioniert? Weil Europa, im Gegensatz zum Iran, tatsächlich ein abnormes Waffenarsenal besitzt und auf der Weltrangliste der Regionen mit den meisten und dicksten Atomwaffen der Welt direkt hinter den Vereinigten Staaten steht.\nNatürlich nicht ausschließlich. Aber eben unter anderem.\n\nUnd weil du das jetzt nochmal wiederholst: Du glaubst nicht wirklich, dass der Iran die größte Atommacht der Welt ist?! (Wie misst man eigentlich die Größe eines illegalen Waffenarsenals?)\n\n> 3. In Deutschland passiert das nur, weil das ganze gesocks reingelassen wird. Warum? Ist mir ehrlich gesagt unbegreiflich.\n>    Aber wenn die Demokratie weiterhin Anschläge in Deutschland riskieren will, dann lasst Sie nur rein.\n\nDamals? Weil man den Leuten eben doch nicht an der Grenze in den Kopf gucken kann.\n\n> 4. Das ist nicht nur meine Meinung, sondern auch die Sicht vieler anderer. Bestätigt sich durch einfaches  \"googeln\"\n\nDito.\nUnd jetzt?\n\n> Mal zusammengefasst... bin ich kein Fan von Trump, auch kein rasist oder sonstiges.. etc.\n> sondern lediglich einer, der die aktuelle Lage sieht, wie Sie auch ist.\n> \n> ... Jedoch bin ich mir ziemlich sicher, dass die ganze Sache sehr böse ausgehen wird.\n> Egal wie es auch kommen wird, der Iran wird den kürzeren ziehen.\n> Die folgen kann sich denke ich jeder denken.\n> \n> P.S Wenn man in die Geschichte schaut bzw. in die Bücher, dann gibt es schon viel zu lange frieden... war klar, dass früher oder später mal wieder etwas passiert.\n\nIn der Vergangenheit gab es auch keine Atombombe.","replies":[{"poster":"Kira Rengami","date":"2019-06-26T12:43:35.413+0000","up_votes":1,"down_votes":3,"body":"Sorry, aber dann bist du sehr schlecht informiert.\nSchmerzt, wenn ich sehe wie Leute mit Ihrem Halbwissen, meinen zu müssen auch nur irgendetwas zu behaupten.\n\n{{champion:268}} {{sticker:zombie-brand-mindblown}} ","replies":[{"poster":"dome025","date":"2019-06-26T18:30:03.354+0000","up_votes":4,"down_votes":0,"body":">Schmerzt, wenn ich sehe wie Leute mit Ihrem Halbwissen, meinen zu müssen auch nur irgendetwas zu behaupten.\n\nJoah Brudi, ich verstehe dich. Kenn den Schmerz. Fühl den grad beim lesen deiner Kommentare.\n\n1: Trägt die USA eine gewisse Verantwortung für die Situation dort. Im historischen Kontext als auch im momentanen Kontext.\n\n->Die USA haben durch ihre Einmischung (CIA Mission) damals zu politischer Instabilität geführt. Diese Instabilität führte langfristig zum erstarken religiöser Extremisten.\n\n->Die USA haben den von ihnen zusammen mit den Europäern und Iranern ausgehandelten Vertrag vor rund einem Jahr gebrochen und versuchen den Iran weitestgehend wirtschaftlich zu isolieren, sodass auch Länder wie Deutschland, Großbritannien, etc. kaum/keine Geschäfte mit dem Iran machen können. \nDie Preise im Iran deswegen nicht stabil sind und sich die Leute immer mehr sorgen müssen wie sie von Tag zu Tag leben. Obwohl der Vertrag gewisse Regeln enthält wie zu Verfahren ist, wenn der Iran sich nicht an das Abkommen hält. Trump hat das Abkommen halt einfach für zu schwach empfunden (komisch wenn das mehrere Nationen als zumindest ausreichend einstuften und noch einstufen).\n\n2: Der Iran ist sicherlich nicht die größte Atommacht. Das sind immer noch die USA, Russland und eventuell China (bin bei China grad überhaupt nicht sicher). Und ich bezweifle, dass der Iran auch diese Länder jemals überholen wird.\n\n3: Ist immer noch fraglich ob die Drohne den iranischen Luftraum verletzt hat oder nicht. Und da wird Otto Normalbürger wohl auch nie die Wahrheit drüber herausfinden. \n\n->Aber machen wir mal ein Gedankenexperiment. Eine Drohne nähert sich Deutschland. Die Drohne ist von einem Land, dass Deutschland feindlich gesinnt ist und die Drohne kann zur Spionage Deutschlands benutzt werden um mögliche Ziele auszukundschaften. Dazu unterstützt dieses Land Deutschlands Erzfeind und die Drohne \"testet\" sozusagen aus wie weit man gehen kann. Wann würdest du dich dazu entscheiden sie abzuschießen?\n\n->Exkursion:\nAls das kommunistische Kuba Russland erlaubt hat sein Atomarsenal aufzubauen schäumten die USA vor Wut. Sie richteten eine Blockade ein, obwohl dies nicht ihr Territorium war und waren dazu bereit einen Atomkrieg zu riskieren, wenn russische Schiffe die Blockade ignoriert hätten. Obwohl die USA damals selbst Atomwaffen in der Türkei hatten und quasi das machten (und immer noch machen durch die NATO) wovor sie selbst Angst hatten. Erst nachdem Vorfall waren sie bereit die Atomwaffen aus der Türkei abzuziehen.\nUnd in diesem Fall ging es um mögliche größtenteils globale Zerstörung und nicht wie jetzt um einen regionalen Konflikt.\n\n4: Amerika hat nicht per se ein leichtes Spiel. Kommt darauf an wie viele Kriegsverbrechen sie wieder begehen wollen und wie viel sie bereit sind in den Krieg zu investieren.\n\n5: Ok diesmal zitier ich noch ein mal für einen besseren Überblick:\n\n>Stehe absolut auf der Seite von Amerika. Egal ob jemand Trump mag, egal ob jemand Amerika mag oder auch nicht. Bei so einer Situation kann ich die Reaktion sowie die aktuelle Lage/Situation 100% nachvollziehen, wenn man bedenkt dass das verhältnis zwsichen dem Iran und Amerika sowieso nicht gut war. ( 9/11 etc. siehe Anschläge, die alle vom Iran ausgeführt worden sind) bzw. generell der Iran Anschläge auf der ganzen Welt ausführt.\n\nWelche Situation denn? Dass die USA ihren eigens ausgehandelten Vertrag gebrochen haben, anderen Staaten es kaum bis gar nicht möglich macht mit dem Iran Geschäfte abzuwickeln und dadurch wirtschaftliche Instabilität bringt (und lasst uns nicht vergessen, dass wirtschaftliche Instabilität **einer der Gründe** für Nazi Deutschland war, weil die Leute hungerten, etc.). Dazu testet wie weit sie gehen können/provozieren können.\n\nDas Verhältnis, auf welches Amerika nichtmal einen F+ck gibt? Und Amerika eine große Mitschuld trägt, dass es so angespannt ist?\n\n9/11 wurde durch eine Terrorgruppe vollzogen, die einen saudi arabischen Anführer hatte. Ja, Osama kam meines Wissens aus einer reichen saudischen Familie (aber vielleicht irre ich mich hier ja tatsächlich). Aber irgendwie sind die USA und Saudi trotzdem Verbündete geblieben? Komisch. Und wie eingew schon sagte war die Terrorgruppe auch in anderen Ländern aktiv. Zumal Osama sich in Pakistan versteckte, wieso greifen sie nicht Pakistan an? Oder wie gesagt Deutschland, da die glaub ich hier Pläne schmiedeten oder vorbereiteten. \n\nMal ganz davon abgesehen, dass Saudi Arabien (wie schon erwähnt mit den USA verbündet; hier möchte ich falls ich es nicht schon erwähnt habe erwähnen, dass Saudi Arabien und der Iran Erzfeinde sind) eine der strengsten Formen des Islams unterstützt, welche zur Radikalisierung und Terrorismus beiträgt. Welche Anschläge führt der Iran auf der ganzen Welt denn aus? Du tust so, als ob der Iran jeden zweiten Tag einen Anschlag irgendwo befehligt. Zumal man für viele Anschläge nicht einfach ein Land beschuldigen kann.\n\nUnd wieso ist die USA damals mit dem Irak in den Krieg gezogen und nicht mit dem Iran? Ich meine sie haben damals den NATO Bündnisfall ausgerufen und dann greifen sie das falsche Land an? Komisch die Anschläge werden vom Iran ausgeführt und dann ziehen die USA mit dem Nachbarland des beschuldigten Lands in den Krieg? Hmmm scheint zu stimmen, dass die Amis keine Ahnung von Erdkunde haben und denken dass Deutschland in Asien liegt und die Schweiz ein Kontinent ist.\n\nhttps://www.reddit.com/r/quityourbullshit/\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Kira Rengami","date":"2019-06-29T16:02:25.062+0000","up_votes":1,"down_votes":1,"body":"Jep, die Aussage meines  letztes Kommentares  bestätigt sich wieder... {{sticker:zombie-brand-mindblown}} \n","replies":[]}]}]}]}]}]},{"poster":"Shiori Tanaka N7","date":"2019-06-25T20:35:19.762+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Kira Rengami,realm=EUW,application-id=YnZkMR0R,discussion-id=bJwbJ9W0,comment-id=0004,timestamp=2019-06-25T13:14:15.820+0000)\n>\n> Naja.. Amerika hat jeden Grund gegen den Iran vorzugehen... Wenn man z.b auf Ereignisse wie 9/11 zurück schaut...\n> Davon abgesehen..\n> \n> Besitzt der Iran die Weltgrößte Atombomben Macht auf der ganzen Welt, und schmuggelt noch sonstige Waffen etc... Allein das ist schon ein Guter Grund, der Sache einhalt zu gebieten und dem Iran nicht länger zu erlauben, alles zu machen, was Er will.\n> \n> Dann schießen die Jungs noch eine U.S Drohne ab {{sticker:zombie-brand-facepalm}}  ganz schlechter move..\n> Falls es zum Krieg kommt, wissen wir ja, dass Amerika da leichtes Spiel hat. Man wird es wahrscheinlich nicht mal \"krieg\" nennen können, sondern eher \"Blitzkrieg\".\n> \n> Stehe absolut auf der Seite von Amerika. Egal ob jemand Trump mag, egal ob jemand Amerika mag oder auch nicht. Bei so einer Situation kann ich die Reaktion sowie die aktuelle Lage/Situation 100% nachvollziehen, wenn man bedenkt dass das verhältnis zwsichen dem Iran und Amerika sowieso nicht gut war. ( 9/11 etc. siehe Anschläge, die alle vom Iran ausgeführt worden sind) bzw. generell der Iran Anschläge auf der ganzen Welt ausführt.\n> \n> \n> Die aktuelle lage mal beiseite..\n> Dieser Move von Trump hat erstmal für den besten lachflash seit langen gesorgt xD Geiler. (wegen LoL)\n\nUm ehrlich zu sein weiß ich nicht ob du ironisch sein magst, witzig oder einfach nur trollen. Einige deiner Aussagen sind grundlegend falsch und davon  abgesehen betonte ich mehrfach das es hier nicht um die Politik gehen soll!!! Zumal nach wie vor leitragende einzig die Befölkerung ist welche wohl in den wenigstens fällen etwas dafür kann.\n\nSchade das du so reagierst und schreibst aber es war ab zu sehen das manche Menschen weder verstehen totz mehrfacher ausführung worum es hier geht, noch ernsthaft diskutieren wollen. Ehrlich gestanden tust du mi leid aber das tut hier nichts zur Sache.\n\nIch bitte dich lediglich an das Thema zu halten und \"deine politischen\" Gesinnungen ausen vor zu lassen.","replies":[{"poster":"Kira Rengami","date":"2019-06-26T12:42:57.068+0000","up_votes":1,"down_votes":3,"body":"Oh boy...\nNicht mal Halbwissen ist in deinem \"text\" zu erkennen...\n\n{{sticker:zombie-brand-facepalm}} ","replies":[{"poster":"Maexle","date":"2019-06-26T20:37:52.127+0000","up_votes":2,"down_votes":1,"body":"\"Das Unglück der Dummen ist, dass sie das, was nicht dumm ist, für dumm halten.\"","replies":[{"poster":"Kira Rengami","date":"2019-06-29T16:21:24.783+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]},{"poster":"Eibert Rümmel","date":"2019-06-27T15:34:11.490+0000","up_votes":1,"down_votes":0,"body":"Ist es nicht eher das Glück der Dummen? Muss doch herrlich sein, dummes zu tun und sich dabei grpßartig zu fühlen","replies":[{"poster":"Maexle","date":"2019-06-27T18:18:23.651+0000","up_votes":1,"down_votes":1,"body":"Stimmt... \n\nAndererseits ist es aber auch ein Unglück für sie, da sie sich niemals weiterentwickeln können. Aber natürlich trifft das auch nur auf die Prämisse zu, dass man sich an allgemeingültigen Normen und Fakten orientiert.","replies":[]}]}]}]}]}]},{"poster":"Shiori Tanaka N7","date":"2019-06-24T13:31:17.136+0000","up_votes":3,"down_votes":0,"body":"Ich finde es schön das zumindest ein Paar ihre Zeit diesem thema widmen. Dankeschön.\n\nAber ich möchte nocheinmal klar stellen das es mir nicht darum geht politische Gesinnungen zu diskutieren oder RIOT zu kritisieren die ja letzlich auch nur Regeln bevolgen.\n\nIch finde es unverständlich das einige denken ich würde den Iran und zb. auch Syrien welches auch betroffen ist, in eine \"Opferrolle\" stecken. Das habe ich weder getan noch beabsichtigt. Doch sagt mir, können die Gamer etwas für die Zustände? Sind es die Menschen die League spielen welche provozieren, angreifen, verteidigen etc? Nein!!! Es sind Menschen wie ihr und ich. Und genau darum ging es mir. Um all jene die überhaupt nichts für das Embargo können, die sich vermutlich nicht an irgendwelchen Auseinandersetzungen etc beteiligen. ich rede von jenen die von der Schule heim kommen, die von Arbeit kommen, die vielleicht Urlaub haben, krank sind und zumindest teilweise ein weitaus härteres leben haben als es gemein hin in der westlichen Welt üblich ist oder sollte euch das Wort ehr zusagen, gefährlicheres. Ohne das sie etwas dafür können.\n\nDaher mein post, um den Blick von euch liebe Community auf dieses problem zu lenekn. Um vielleicht einen kleinen Stein ins rollen zu bringen, um zu erfahren wie ihr so denkt und vielleicht sogar eine mögliche Lösung zu finden. \n\nEinige zb umgehen die ganze Sache mittels vpn was aber aufgrund des highping recht unpraktisch ist zumal ich mir nicht im klaren bin in wie weit es gegen die League Regeln verstöst.\n\nMuß denn immer alles und jedem die Schuld in die Schuhe geschoben werden? ich denke nicht. Doch zeigen einige kommentare leider auch klar in welche Richtung sich entwickelt. Weg vom gemeinsamen, der Solidarität, hin zu egoismus, anfeidungen etc. Ich bin mir sicher, würden einige von euch einmal mit den Betroffenen reden, wärt ihr überrascht wie viel ihr trotz anderer Sprache, land und eventuell auch Religion ihr bzw wir gemeinsam haben. Ich möchte weder richten noch urteilen da dies zum einen anmaßend wäre, zum anderen dies hier keine politische Diskusion ist. Ich wollte lediglich auf eine riesen Ungerechtigkeit und Problem aufmerksam machen in der vielleicht auch naiven Hoffnung, das man gemeinsam etwas erreicht. Und sei es nur das sie wieder spielen können ^.^\n\nKlar gibt es da noch weitaus wichtigere probleme doch diese hier zu diskutieren wäre deplaziert und würde den Ramen sprengen. Versucht euch vielleicht einfach mal vor zu stellen wie ihr selbst euch in so einer Situation fühlen würded und dann stellt euch noch vor, ihr könntet Deutsch lesen und schreiben und würded verstehen was einige hier geschrieben haben. Jeder kann seine Meinung haben, doch niemand sollte einfach blind richten und alle über einen kamm schären. Weder irl noch hier.\n\nDoch erneut Danke für eure zeit und einen schönen Tag. lasst uns einfach das beste hoffen. Lasst uns hoffen das die großen irgendwann aufhören ihre Machtkämpfe aus zu tragen auf dem Rücken der kleinen die immer darunter leiden werden. Denn besagte Sanktionen bestrafen nicht jene für die sie gedacht waren. Diese können weiter in saus und braus gut Leben. es trifft wie all zu oft jene die so schon nicht viel haben und das bricht mir eben das Herz. jaja so ist die Welt nun mal Shiori werden vielleicht einige denken. Und das stimmt.\n\nDoch nur weil etwas so ist, muß ich es noch lange nicht tollerieren und ich werde niemals bei einem Unrecht einfach Wortlos zusehen denn damit gebe ich meine Menschlichkeit auf. ich werde immer etwas dazu sagen auch wenn meine Stimme ungehört bleiben sollte, doch wenn ein jeder von uns auch nur einen Satz hinaus schreibt oder gar schreit, so ergibt das eine Stimme welche man nicht überhören kann. Maybe in ich ideallistisch doch ich halte an den mir gegeben werten fest :)","replies":[]},{"poster":"Shiori Tanaka N7","date":"2019-06-25T20:46:01.994+0000","up_votes":2,"down_votes":0,"body":"Weist du Kira, es ist ok seine Meinung zu sagen. Doch wenn dich jemand konkret nach  zb Autos fragt und du dann von zügen redest sind sie zwar gewisser Weise Art verwandt, jedoch hat es nichts mit dem Thema zu tun. Vielleicht solltest du dir alles nochmal eventuell durchlesen um sicher zu gehen das du nichts vielleicht übersehen hast.\nNicht nur das das was du sagst klar gegen das verstöst was ich gefragt habe und worum ich gebeten habe, sondern du machst die Zivielbevölkerung verntwortlich für Verbrechen, Athomwaffen und mehr. Denn auf jene bezog sich meine frage. Alles andere hat hier nichts zu suchen und somit würde ich dich bitten deine meinung an besser geeigneten Orten zu äusern und gebe dir den Tip dich vorher besser zu informieren und vorallem niemals Zivilisten mit Terroristen zu vergleichen!\n\ntrotzdem noch einen schönen Abend und entschuldige diese doch ungewohnten harten Worte von mir, jedoch werde ich weder Unrecht noch Lüge tollerieren.","replies":[]},{"poster":"00 M4ddin 00","date":"2019-06-24T05:48:53.473+0000","up_votes":2,"down_votes":0,"body":"Ok ich gebe zu ich hab keine Ahnung... \nHab davon nichts mit bekommen. Glaub die letzten Nachrichten die ich aktiv verfolgt hab waren zu den europa Wahlen? (Was Enttäuschung genug waren) \n\nDoof für den Iran und deine bekannten. Aber denke nicht das wir da groß was ändern. \n\nMich würden aber mal interessieren wie viele lol Spieler es dort gibt? :0","replies":[{"poster":"eingew","date":"2019-06-25T06:15:33.786+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=00 M4ddin 00,realm=EUW,application-id=YnZkMR0R,discussion-id=bJwbJ9W0,comment-id=0000,timestamp=2019-06-24T05:48:53.473+0000)\n>\n> Doof für den Iran und deine bekannten. Aber denke nicht das wir da groß was ändern. \n\nIn einer Demokratie fließt der Fluss von der Kultur zur Politik hinab. Das, was heute Begeisterungsstürme in den sozialen Medien erzielt, wird in 10/20 Jahren in der Politik umgesetzt. Natürlich ist man da, wenn man nicht gerade mehrere hunderte Follower gesammelt hat, ein kleines Licht. Aber nichtsdestotrotz ein Licht, Mund zu Mund Propaganda funktioniert auch bei politischen Einstellungen.\nAlso ja, vielleicht ändert man dadurch nichts großes. Aber was kleines und manchmal ist das schon genug.\n \n> Mich würden aber mal interessieren wie viele lol Spieler es dort gibt? :0\n\nIran ist auf dem HDI auf derselben Stufe wie China, Mexiko oder Brasilien. Ich schätze also nicht allzu wenige ^^.","replies":[{"poster":"00 M4ddin 00","date":"2019-06-25T11:21:03.880+0000","up_votes":1,"down_votes":0,"body":"Ok das hab ich nicht erwartet das da so viele spielen :0","replies":[]}]}]},{"poster":"Veezey","date":"2019-06-24T16:30:31.651+0000","up_votes":1,"down_votes":0,"body":"Die können doch über VPN zocken oder nicht?","replies":[{"poster":"Shiori Tanaka N7","date":"2019-06-24T21:08:24.551+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Veezey,realm=EUW,application-id=YnZkMR0R,discussion-id=bJwbJ9W0,comment-id=0003,timestamp=2019-06-24T16:30:31.651+0000)\n>\n> Die können doch über VPN zocken oder nicht?\n\nwie ich oberhalb schon schrieb, ja. Aber erstens ist unklar in wie weit das zb. gegen die regeln von RIOT verstöst und zum zweiten wenn du da nen VPN benutzt hast du mit großer Warscheinlichkeit einen sehr hohen Ping was wiederum dein Spiel ruiniert. Mag natürlich auch Ausnahmen geben.","replies":[]}]},{"poster":"faMe girl 8ghter","date":"2019-07-01T01:09:23.320+0000","up_votes":1,"down_votes":0,"body":"Ich glaube die Leute im Iran haben andere Probleme als League of Legends spielen zu wollen..","replies":[]}]}