{"poster":"Exanel","date":"2015-09-04T10:40:20.707+0000","title":"Spero mi permabannino, sproloquio di un giocatore stremato.","subforum":"Discussioni generali","up_votes":4,"down_votes":7,"body":"Sono sinceramente stufo di essere tentato di giocare a questo gioco.\r\nPerch&egrave;? Per via di gente ignorante e incapace di giocare e che si permette di spalare merda sul prossimo senza sapere un cazzo di niente!\r\n\r\nMa in parte &egrave; anche colpa mia... Sono stato cos&igrave; stupido da giocare sempre con diamond o gold, giocatori con una certa ottica del gioco e capaci di adattarsi alle circostanze, cosa che i bronzini che han sempre giocato normal o proprio gli unranked non sono capaci di fare.\r\n\r\nParliamoci chiaro, io non sono un diamond o un gold, ma caso strano quando gioco con diamond o gold, anche perdendo, faccio sempre delle belle giocate col mio team (in solo queue eh! che sia chiaro).\r\n\r\nIl picco di ignoranza l&#039;ho avuto 10 minuti fa nemmeno.\r\n\r\nVisto che chi legger&agrave; questo post sar&agrave; anche uno di quelli che bazzica i forum e i video su YT, sapr&agrave; con certezza del rework di Morde (fidatevi, c&#039;&egrave; gente che non sa nemmeno cosa FACEVA Morde!). Questo rework ha reso Morde un champ pi&ugrave; versatile nelle 5on5, dove prima era relegato ad un mid o un top, ma che comunque prendeva schiaffi da molti champ (a parit&agrave; di skill) per via della sua scarsa mobility.\r\n\r\nOra per&ograve; Morde, oltre che top o mid, pu&ograve; anche coprire altri due ruoli: suppor e jungler.\r\n\r\nE per amor del cielo! Prima di commentare con un&#039;idiota frase del tipo: &quot;No, non &egrave; vero, al massimo &egrave; ADC.&quot; vi supplico, controllate online! Perch&egrave; dire che Morde &egrave; il nuovo ADC, non vuol dire un cazzo! Anzi, probabilmente tentando di negare ci&ograve; che dico mi dareste ragione!\r\n\r\nOra Morde pu&ograve; speedarsi con la W, ingaggiando decentemente in lane, e prendendo molto AD con le sue abilit&agrave; la build migliore &egrave; Tank-AD, difatti possiamo osservare come ci siano moltissimi nuovi oggetti che donino molta vita, pompando le resistenze, aumentando l&#039;AD e facendo addirittura danno in base alla vita.\r\n\r\nIl problema, in game, sopraggiunge quando giochi con gli individui descritti all&#039;inizio: ignoranti per essere ignoranti, incapaci di aggiornarsi, con zero elasticit&agrave; mentale per adattare uno stile di gioco ad un champ, feeder, incapaci di guardare la mappa e focusare.\r\n\r\nNella fattispecie, nell&#039;ultimo game svolto, ho avuto a che fare con un Veigar che ha feedato cos&igrave; tanto la sua Fiora in top lane da farla uscire 5 0 0 in teleport nella nostra bot... dove io (Morde) con una Vayne, stavamo aprendo i culi ad una Sivir + Poppy.\r\nZed mid feedava nel suo mirror match.\r\nVi non gankava, e non azzeccava UN CC che fosse uno.\r\n\r\nMa ovviamente il problema non erano tutte queste cose, non erano le mancanze di gank bot a nostro favore, non era il fatto che Veigar non avvisasse dei MIA di Fiora, non era che lui spendesse i suoi  TP SOLO per farmare e mai per gankare (dimostrando di non guardare la mappa manco per il cazzo,  e fidatevi che le ward le piazzavo), nooo! Il problema era un Morde support.\r\nPerch&egrave; quando le cose vanno male si da la colpa a ci&ograve; che non si conosce.\r\nNonostante ci&ograve; che non si conosce stesse facendo il suo stracazzo di dovere.\r\n\r\nIo ho fatto una cosa che ho compiuto solo altre due volte, e in una sola di queste volontariamente: ho ragequittato. \r\nAlt+f4 e addio.\r\nIo SPERO che mi bannino, perch&egrave; non voglio pi&ugrave; giocare ad un gioco dove l&#039;ignoranza la fa da padrone.\r\nMigrer&ograve; su altri lidi come Warframe, dove la community non &egrave; composta da teste di minchia.\r\nRitorner&ograve; a Dark Souls, sperando di reintegrarmi nel PVP buggoso, laggoso e cheattoso ma dove se la colpa dev&#039;essere di qualcuno pu&ograve; essere solo tua.\r\nMa LoL, la cui opinione mi era migliorata dopo i primi  giorni di gioco, in seguito ad un periodo di stop, mi rendo conto che deve morire. LoL &egrave; un gioco che deve morire. Il fatto che sia FTP lo rende asilo di bambinetti incapaci.\r\nE vi chiedo: quand&#039;&egrave; stata l&#039;ultima volta che vi siete sentiti rilassati dopo aver giocato a LoL?","replies":[{"poster":"Ste the ripper","date":"2015-09-04T11:23:50.131+0000","up_votes":5,"down_votes":0,"body":"Quando giochi con i diamond vieni semplicemente hard carriato, è facile giocare bene se tutte le lane vincono ;)\n\nRicordati che se giochi con loro e perdi sei esattamente come loro.","replies":[{"poster":"Exanel","date":"2015-09-04T12:18:48.953+0000","up_votes":1,"down_votes":1,"body":"c'è sconfitta e sconfitta.\nci sono le sconfitte perchè l'avversario è più forte, ci sono le sconfitte invece dove il tuo team gioca senza guardare lo schermo.\ne come ho scritto sotto un altro commento, quando la tua giocata coi contro coglioni viene sfruttata il tf lo vinci. se con braum piazzi la ulti come cristo comanda e il tuo team focusa bene, il tf lo vinci, cavolo! se con soraka curi dopo un bel bait,  rigirando le sorti dell'engage nemico, e il tuo team si sveglia, il tf lo vinci! non puoi fare così se invece devi curare il solito stronzo feeder perchè sennò il team intero ti minaccia di report perchè \"soraka non cura!\", ma vaffanculo!","replies":[{"poster":"Ste the ripper","date":"2015-09-04T12:25:45.724+0000","up_votes":5,"down_votes":1,"body":"Devi imparare a riconoscere i tuoi errori, non partire convinto e non pensare sia colpa degli altri","replies":[{"poster":"Exanel","date":"2015-09-04T12:57:22.423+0000","up_votes":1,"down_votes":1,"body":"oh sì, di errori ne ho fatti. ho sbagliato a chaseare una sivir senza ultimate o ghost o flash con una vi che non azzeccava uno stump... effettivamente me ne sarei dovuto andare molto prima! quello è stato un errore.","replies":[{"poster":"Ste the ripper","date":"2015-09-04T13:23:18.598+0000","up_votes":4,"down_votes":2,"body":"Allora ciao, basta che smetti di fracassare e che quando te ne vai ti ricordi di chiudere la porta. :)","replies":[{"poster":"Exanel","date":"2015-09-04T13:44:17.617+0000","up_votes":1,"down_votes":1,"body":"?","replies":[]}]}]}]}]}]},{"poster":"Dr LouD","date":"2015-09-04T10:45:33.972+0000","up_votes":3,"down_votes":0,"body":"Ahhhhh..\n\n/mute all\n\n(mi sa che prendi un GIOCO un pò troppo sul serio m8 :/ )","replies":[{"poster":"Exanel","date":"2015-09-04T11:20:43.772+0000","up_votes":1,"down_votes":1,"body":"lo prendo sul serio quando vengo accusato ingiustamente. Vinciamo la lane bot, gli altri 3 feedano a bestia e la colpa è di Morde support. Ovvio no? Avessi giocato Varus support tank senza danno, senza mai utilizzare la ultimate o sbagliandola ogni volta, sai, avrebbero avuto ragione, ma se gioco Morde come deve essere giocato e mi spali merda addosso beh, fottiti.","replies":[{"poster":"Dr LouD","date":"2015-09-04T11:50:31.971+0000","up_votes":3,"down_votes":0,"body":"Sei al corrente del tasto per mutare gli altri, vero?","replies":[]},{"poster":"A Violent Theo","date":"2015-09-04T11:36:49.149+0000","up_votes":2,"down_votes":0,"body":"Allora, ho smurfato in Bronzo con 4 account, premetto che sono solo Gold V ( Ero arrivato a Gold II ma ahime, sono scarso ) \nAlla prima frase dove leggevo Vayne / Yi / Irelia con qualche lamentela ( si giocavo solo 3 champ ) mutavo colui che l'aveva scritto, perchè sapevo di far la cosa giusta in quella situazione.\nInizialmente no credevo servisse a molto, poi invece mi sono reso conto che aiuta un sacco a concentrarsi C:\n\nFunny Thing: 2 di quegli account sono di elo più alto di me ora lol","replies":[]}]}]},{"poster":"Vileblood Pyke","date":"2015-09-04T11:45:15.551+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Exanel,realm=EUW,application-id=MJVj50Jw,discussion-id=feQ9uiXy,comment-id=,timestamp=2015-09-04T10:40:20.707+0000)\n>\n>Ora per&ograve; Morde, oltre che top o mid, pu&ograve; anche coprire altri due ruoli: suppor e jungler.\n> \n> E per amor del cielo! Prima di commentare con un&#039;idiota frase del tipo: &quot;No, non &egrave; vero, al massimo &egrave; ADC.&quot; vi supplico, controllate online! Perch&egrave; dire che Morde &egrave; il nuovo ADC, non vuol dire un cazzo! Anzi, probabilmente tentando di negare ci&ograve; che dico mi dareste ragione!\n\nKappa.","replies":[]},{"poster":"Nibbio Bianco","date":"2015-09-04T10:52:36.703+0000","up_votes":3,"down_votes":0,"body":"Sei troppo serioso.","replies":[]},{"poster":"Sorcio84","date":"2015-09-04T13:54:50.184+0000","up_votes":1,"down_votes":0,"body":"guarda, per una volta zpero di potermi permettere il mio linguaggio solito (fuori da lol)\n\n[filter=off]\n\nallora :\n\nI ritardati minorati mentali tipo {{champion:62}} o {{champion:23}} li troverai sempre e ovunque.\n\nGente ignorante che saprà solo parlare dei tuoi errori ma totalmente incapace di darti un qualsiasi consiglio positivo. Ieri mi è successa proprio sta cosa in ranked e proprio con quella lurida brutta schifosa scimmia cinese bastonara ruotapalle.\n\nio ero {{champion:40}} e ho cannato la final un paio di volte.\na fine game mi hanno fatto notare i miei errori ma nessuno aiuto o consiglio.\ne allora fottiti porco mundo, e stai zitto se l'unica cosa che sai fare è sparare genkidama di fango sugli altri. sei una scimmia ignorante meriti la divisione legno 15\n\nMi guardano disperati quando picko {{champion:16}} coi lumi personalizzati alla banana e poi tengo su tutto il team a forza di cure anche a gente idiota che spamma vayne perchè è tier alto wow. e allora a forza di sparare banane ci credo che ho le scimmie sempre dietro al Qlo\n\nOra, dalla mia esperienza di tossico bastardo di zaun, le soluzioni sono 3\n\n- banna i champ ignoranti giocati da gente ignorante\n{{champion:23}} {{champion:62}} e in genere i free champ ritenuti op\nse chi li gioca ti flamma, reportali e non rispondere agli insulti\n\n- mutali e se flammano a fine game report, non rispondergli.\n\n- gioca premade e solo premade riduci la possibilità\n\nLa gente ritardata c'è, come\n\nfrustrati\ngente che pensa che è il champ che ti fa vincere\negoisti\nbimbiminchia\nnabbi (e ne ho tra gli amici)  con mastery / rune sbagliate o anche tier2\ntroll\nfeeder afk\nio che faccio il tossico in selezione segreta (raramente per fortuna vostra)\nflamer\ninstalock\ngente che si autocountera in champ select in ranked\n\nuccidili / ignorali / diventa uno di loro","replies":[{"poster":"73668109_DEL","date":"2015-09-04T18:13:38.304+0000","up_votes":2,"down_votes":0,"body":"Da calmo e pacato , mi stai diventando tossico come {{champion:29}} , confermo le ranked fanno male.","replies":[{"poster":"Sorcio84","date":"2015-09-04T18:46:54.549+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LastExileITA,realm=EUW,application-id=MJVj50Jw,discussion-id=feQ9uiXy,comment-id=000b0000,timestamp=2015-09-04T18:13:38.304+0000)\n>\n> Da calmo e pacato , mi stai diventando tossico come {{champion:29}} , confermo le ranked fanno male.\n\nho dei periodi di stress :(\nNon riesco ad evitarlo ed esco fuori di melona.\n\nIo curo la gente {{champion:16}} e ho anche preso il lume a banana, cosa vuoi di più dalla vita ?\ndo utility e disingaggio {{champion:40}} \napplico CC a non finire {{champion:89}} \ne ti sto vicino vicino per proteggerti {{champion:44}} \ne uso i ping per avvisarti e salvarti\n\ne tu, alleato, te ne strafreghi , continui a fare gli stessi errori, e te la prendi pure con me.\nchiaro che per quanto possibile cercherò sempre di fare duo bot premade\n\ne poi **quella scimmia** ...ogni volta perdo sia insieme che contro...\nstessa cosa {{champion:429}} .\n\nHo appena appena 18 champs, non posso avere sinergia con tutto\n\nAiuto ! medicine ! chiamate un dottore {{champion:36}} \no uno psichiatrologo D:\n\nportatemi via da zaun non ce la faccio più (x_X)","replies":[]}]}]},{"poster":"73668109_DEL","date":"2015-09-04T18:11:06.200+0000","up_votes":2,"down_votes":0,"body":"Veigar top , poppy support ..... stavi giocando normal con dei bronzi , che caxxo ti incaxxi a fare ?","replies":[]},{"poster":"Firenheit","date":"2015-09-04T11:28:45.336+0000","up_votes":3,"down_votes":1,"body":">Parliamoci chiaro, io non sono un diamond o un gold, ma caso strano quando gioco con diamond o gold, anche perdendo, faccio sempre delle belle giocate col mio team (in solo queue eh! che sia chiaro).\n\nNo, i tuoi compagni giocano bene, tu agisci solo in un bell'ambiente e l'unico pregio è quello di non fare 0 90. Non dico che è il tuo caso, ma diciamo è la risposta a quelli che dicono \"ma io gioco bene con 4 Challenger\".","replies":[{"poster":"UnknownEV","date":"2015-09-04T13:40:43.919+0000","up_votes":1,"down_votes":1,"body":"Ti prego sentilo XD \n---\n\"con Braum prendo i loro 3 carry stunnandone 1\" ma che...?... LOL","replies":[{"poster":"Exanel","date":"2015-09-06T11:59:15.934+0000","up_votes":1,"down_votes":2,"body":"BEH, se fai di tutto per non capire.\nautoattack, autoattack, ultimate, q, autoattack.\nstumpati 3 e uno stunnato.\n\nno ma, l'ignoranza.","replies":[]},{"poster":"Firenheit","date":"2015-09-04T15:12:51.742+0000","up_votes":1,"down_votes":2,"body":"Ignora, lascia fare.","replies":[]}]},{"poster":"Exanel","date":"2015-09-04T12:15:36.214+0000","up_votes":2,"down_votes":3,"body":"con 4 challenger contro 5 challenger sucherei abbestia, e se nel game vinciamo perchè con Braum prendo i loro 3 carry stunnandone 1, beh, grazie a  me e grazie al team che mi ha seguito e non era fuori posizione!\nperò caso strano quando faccio la stessa cosa con un team unranked cosa succede? il mio carry va via, il jungler ingaggia il tank, il top schiatta  fuori posizione, mid indietreggia per recallare.\n\nno ma ok... scusa se quando gioco con gente sveglia lo score è  4-3-27 e quando gioco che gente che l'autoattack lo usa per menare il muro sto 2-9-3 e mi cazziano anche perchè ho preso la kill dopo che il mio carry è morto, donandogli comunque per lo meno un assist (ed è successo più volte, l'altro giorno la tristana che avevo in lane si era incazzata perchè usava il salto sul posto e focusava il sup nemico, ci moriva e io  uccidevo, da solo, il carry avversario!).","replies":[]}]},{"poster":"SennaFirstPick","date":"2015-09-04T12:36:07.607+0000","up_votes":1,"down_votes":0,"body":"> E vi chiedo: quand'è stata l'ultima volta che vi siete sentiti rilassati dopo aver giocato a LoL?\n\nhttp://cdn.meme.am/instances/500x/19665711.jpg\nriflettete su questa frase. alla fine, non posso che dargli il mio upvote.","replies":[{"poster":"SKFF1R SubZero","date":"2015-09-04T12:41:40.966+0000","up_votes":1,"down_votes":0,"body":"Applichiamo lo stesso ragionamento ad un qualunque gioco: ti rilassi quando riesci a battere un boss che non riuscivi a battere con la giusta strategia ad esempio; ti rilassi quando lo finisci; ti rilassi quando riesci ad ottenere un oggetto fortissimo per il quale hai farmato per giorni :)\n\nOra torniamo a LoL.\n\nQuando riesci a scalare una divisione tu non ti rilassi?\n\nQuando fai vincere il tuo team grazie ad una tua buona play non ti rilassi?\n\nQuando il tuo team ti fa i complimenti per aver carriato non ti rilassi?\n\nQuando capisci finalmente dove sbagli con un determinato Champion e impari ad usarlo non ti rilassi?\n\nSe non ti rilassi vedendo quel che sei in grado di fare o i risultati del tuo allenamento, meglio che non giochi a qualunque gioco perchè hai proprio perso il senso del giocare, no? ^_^","replies":[{"poster":"Exanel","date":"2015-09-04T13:05:00.174+0000","up_votes":1,"down_votes":4,"body":"sinceramente no, anche nelle vittorie più schiaccianti non mi sono mai sentito rilassato. soddisfatto forse, ma mai rilassato. non ho mai detto \"boh bene. ci siamo  fatti sta partitina, è ora di ritornare a lavorare/studiare\". no, era sempre un \"minchia, meno male che l'abbiam vinta perchè se la perdevamo proprio ora era la fine!\".\n\nsignori, non è che parlo così negativamente senza motivo, ma parlo così dopo partite e partite di gente che sembra far di tutto per fare cavolate e darti la colpa! anche in una partita stravinta, in cui giocavo braum, mi ritrovo sta kalista che, mentre noi tutti scappavamo miracolosamente dall'engage nemico, fortunatamente non riuscito, mi prende con l'ultimate e mi lancia con 400hp in bocca al nemico!\ne ovviamente ci schiatto.\nalla domanda \"perchè?\"\nella mi rispose \"missclick.\"\n\nminchia, ce ne vuole eh! devi addirittura missclickare due volte e missposizionare il mouse di 180 gradi!","replies":[{"poster":"SKFF1R SubZero","date":"2015-09-04T14:55:55.901+0000","up_votes":3,"down_votes":0,"body":"> minchia, ce ne vuole eh! devi addirittura missclickare due volte e missposizionare il mouse di 180 gradi!\n\nSai vero che Kalista ti prende e poi sei tu che decidi dove buttarti? Ti ci sei buttato tu in mezzo, mica lei x'D\nE te lo confermo con questo: http://leagueoflegends.wikia.com/wiki/Kalista\n\n> sinceramente no, anche nelle vittorie più schiaccianti non mi sono mai sentito rilassato. soddisfatto forse, ma mai rilassato. non ho mai detto \"boh bene. ci siamo fatti sta partitina, è ora di ritornare a lavorare/studiare\". no, era sempre un \"minchia, meno male che l'abbiam vinta perchè se la perdevamo proprio ora era la fine!\".\n\nBeh, allora non giocare a nulla se hai questo atteggiamento, dato che evidentemente non sai la differenza tra divertirsi e giocare ranked :)","replies":[{"poster":"AnDGames","date":"2015-09-04T19:20:07.080+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Sanji992,realm=EUW,application-id=MJVj50Jw,discussion-id=feQ9uiXy,comment-id=0009000000000000,timestamp=2015-09-04T14:55:55.901+0000)\n>\n> Sai vero che Kalista ti prende e poi sei tu che decidi dove buttarti? Ti ci sei buttato tu in mezzo, mica lei x'D\n> E te lo confermo con questo: http://leagueoflegends.wikia.com/wiki/Kalista\n> \n> Beh, allora non giocare a nulla se hai questo atteggiamento, dato che evidentemente non sai la differenza tra divertirsi e giocare ranked :)\n\nprobabilmente kalista ha ultato per salvarlo, lui ha ricliccato sul nemico suicidandosi","replies":[{"poster":"Exanel","date":"2015-09-06T13:39:55.494+0000","up_votes":1,"down_votes":1,"body":"allora non si spiega perchè mi abbia scritto \"missclick\" e soprattutto non avrei potuto clickare da nessuna parte. avevo le mani alzate al cielo in un gesto di incredulità.","replies":[{"poster":"AnDGames","date":"2015-09-07T10:45:50.330+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Exanel,realm=EUW,application-id=MJVj50Jw,discussion-id=feQ9uiXy,comment-id=000900000000000000000000,timestamp=2015-09-06T13:39:55.494+0000)\n>\n> allora non si spiega perchè mi abbia scritto \"missclick\" e soprattutto non avrei potuto clickare da nessuna parte. avevo le mani alzate al cielo in un gesto di incredulità.\n\nse avevi davvero le mani alzate, la ulti di kalista si conclude dove stà il mouse se non clicki...ma mi correggeranno se sbaglio","replies":[]}]}]}]}]}]}]},{"poster":"AnDGames","date":"2015-09-04T12:08:25.619+0000","up_votes":1,"down_votes":0,"body":"era la tua prima partita da support quindi?\n\ndai è la dura vita del support, se non reggi il flame fai bene a cambiare gioco.\n\np.s. meglio che non provi a giocare jungler!","replies":[{"poster":"Exanel","date":"2015-09-04T12:58:55.888+0000","up_votes":1,"down_votes":2,"body":"è dalla season 1 che faccio support. il punto è che ho raggiunto il limite.","replies":[{"poster":"AnDGames","date":"2015-09-04T19:10:35.111+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Exanel,realm=EUW,application-id=MJVj50Jw,discussion-id=feQ9uiXy,comment-id=00080000,timestamp=2015-09-04T12:58:55.888+0000)\n>\n> è dalla season 1 che faccio support. il punto è che ho raggiunto il limite.\n\nseeeeeeeee\n\ne ancora non ti sei immunizzato al flame?\nnon ti credo","replies":[{"poster":"Exanel","date":"2015-09-06T12:43:00.261+0000","up_votes":1,"down_votes":1,"body":"giuro.","replies":[]}]}]}]},{"poster":"DeDiam0nd","date":"2015-09-04T14:02:12.498+0000","up_votes":2,"down_votes":1,"body":"Boh io non capisco...l'italia va a rotoli e la gente si lamenta per i ritardati in game.\nRicordati è solo un gioco, nessuno ti paga e ti fa pagare per giocare quindi non capisco.\nPS -. te lo dice uno che vive nell'elo hell.\nAvrò letto flotte di topic di gente che si lamenta degli altri, non giocare semplice no ?\nTanto non è che scrivendo qua sul forum la gente si impietosisce e inizia a giocare con il cervello solo perchè ha letto il tuo sfogo inutile.","replies":[]},{"poster":"UnknownEV","date":"2015-09-04T13:39:33.645+0000","up_votes":2,"down_votes":1,"body":"{{champion:82}}  NON è un supp... ti avrebbero reportato lo stesso a fine game °L°\n---\normai è così... \nah... io NON ho mai abbandonato una partita. E tu ci vieni a dire che rage quitti?  {{summoner:3}} \n---\nCioè TU dici che stai vincendo...ma il top fidda e non vuoi piu giocare? ah!!! bel player che sei COMPLIMENTI!\nSpero vivamente che lo lasci davvero...perchè trovarti in game sarebbe da {{summoner:11}} \n---\noh- per caso hai la chat limitata o hai preso il ban? :) chissà perchè ti lamenti.... c:","replies":[]},{"poster":"Frattaglia","date":"2015-09-05T10:19:09.336+0000","up_votes":1,"down_votes":0,"body":"Boh io quando mi voglio rilassare mi prendo la mia bella Sona o Soraka, mi metto in coda per il teambuilder e sticazzi. Sono tutti molto più rilassati in TB.\n\nP.s. Mordekaiser è un pessimo support (n o cc, no peel), e quando Kalista ti ulta sei tu che decidi dove buttarti, non lei :P","replies":[{"poster":"Exanel","date":"2015-09-06T12:47:12.775+0000","up_votes":1,"down_votes":1,"body":"vuoi ridere? picko soraka  poco fa, all'inizio faccio due cazzate, mi scuso due volte; mi scuso una terza.\n\nstanno zitti.\n\nper sbaglio lando una Q stealando il raptor grosso che il nostro lee sin stava counterjunglando. il nostro lee si incazza. si ferma per scrivermi qualcosa e viene stuprato mentre scrive al nemico.\nla colpa è mia perchè io volevo stealrgli il bestione grosso da 44 gold, quando volevo solo ciucciarmi quelli piccoli.\n\nnon è finita. siccome siamo in vantaggio i miei cari alleati si credono fighi e ingaggiano 1vs3.\nio intimo un regr, perchè è cosa buona e giusta! la mia jinx mi minaccia di report chiedendolo al team nemico dicendo che non partecipo mai ai tf. i tf NON ci sono perchè sono degli stupidi 1vs3.\n\nl'abbiamo vinta stracciata proprio. mi sono rilassato? mi sentivo più spaesato e incredulo che mai.","replies":[{"poster":"Ste the ripper","date":"2015-09-06T14:29:18.618+0000","up_votes":1,"down_votes":0,"body":"Ma la vera domanda è: come fai a fare cazzate con soraka? è tipo il champ più stupido che esista...","replies":[]}]}]},{"poster":"StayM","date":"2015-09-04T11:56:40.107+0000","up_votes":1,"down_votes":0,"body":"Praticamente sempre, è un gioco, rilassatevi e poi non si può flammare se non leggi ciò che scrivono (/mute all).\n Io gioco tanto bene anche se non sono un assiduo giocatore, vuoi diventare Diamond? okay /mute all e allenati, fine.","replies":[]},{"poster":"Revo21","date":"2015-09-04T10:48:44.479+0000","up_votes":1,"down_votes":0,"body":"Sono sempre rilassato quando gioco proprio perchè è un gioco, che ci sono i bimbi si sà ma è così in tutti i game, se ti danno la colpa fregatene mica succede qualcosa per un report insulso senza logica","replies":[]},{"poster":"Shaikorth","date":"2015-09-04T23:04:55.235+0000","up_votes":1,"down_votes":1,"body":"Passa a dota 2, fidati.\nIl fatto che lol sia il moba più popolare, per me è ancora un mistero.","replies":[]},{"poster":"Nabbomaster","date":"2015-09-04T14:41:06.854+0000","up_votes":1,"down_votes":3,"body":"sfigato trovati 4 amici e fatti un team cosi vediamo come siete pro","replies":[]}]}