{"poster":"Luqelac","date":"2016-06-29T03:16:01.334+0000","title":"Cuanto win ratio necesito?","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Tengo 556 loose y 554 win en normal team builder, y se que no existe la formula para poder calcularlo, pero quer&iacute;a saber mas o menos con la experiencia de alg&uacute;n jugador, cuantas win mas necesito para que al jugar una normal me machee con personas de nivel oro o superior.","replies":[{"poster":"Lucrexio","date":"2016-06-29T05:21:02.855+0000","up_votes":2,"down_votes":0,"body":"Te lo digo corto, no existe el emparejamiento en las normales, una vez me tocó jugar contra un retador y soy un flacido oro IV, y no es joda, osea...","replies":[{"poster":"martincarp","date":"2016-06-29T07:18:36.186+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=X Gungnir X,realm=LAS,application-id=X54mVVp0,discussion-id=zGPTHETs,comment-id=0002,timestamp=2016-06-29T05:21:02.855+0000)\n>\n> Te lo digo corto, no existe el emparejamiento en las normales, una vez me tocó jugar contra un retador y soy un flacido oro IV, y no es joda, osea...\n\nEso sucede por tres motivos:\n1- El jugador retador probablemente estaba en un grupo con amigos, por lo que los dos, tres o cuantos hayan sido estaban en la misma cola.\n2- No hay jugadores de nivel retador buscando partidas en colas normales todo el día, por lo que para el sistema durante GRAN parte del día es literalmente imposible ponerle rivales de su nivel.\n3- Por último pero no menos importante, como la mayoría de los jugadores que están en retador dejaron de jugar normales al llegar a platino, diamante bajo o lo que sea, dejan de jugar normales y solo juegan partidas clasificatorias, por lo que les queda un MMR mucho más bajo al que tienen en su liga, haciendo que el sistema busque jugadores de nivel oro, platino o diamante, dependiendo del caso.","replies":[]}]},{"poster":"ZanahoriaAsesina","date":"2016-06-29T03:36:20.224+0000","up_votes":2,"down_votes":0,"body":"Una vez que llegues a Oro/Platino, en normales te empareja con jugadores de ese nivel para arriba.\n\nO al menos es mas frecuente que suceda.","replies":[{"poster":"Luqelac","date":"2016-06-29T04:00:21.956+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Kone18,realm=LAS,application-id=X54mVVp0,discussion-id=zGPTHETs,comment-id=0001,timestamp=2016-06-29T03:36:20.224+0000)\n>\n> Una vez que llegues a Oro/Platino, en normales te empareja con jugadores de ese nivel para arriba.\n> \n> O al menos es mas frecuente que suceda.\n\nNo es así, el MMR de las normales es diferente al de las rankeds (En ranked estoy jugando un promedio de partidas de 1500 de elo y en normales varia de 1000 a 1200), por el momento no estoy rankeando por que quiero mejorar el win de normales, pero es medio tedioso que todo el tiempo te empareje con gente nivel 30 y bronce, por que el juego se hace aburrido, generalmente y por mas que a una normal no le pongan el 100% de dedicación que le ponen a las rankeds, es muy injusto perder por que juego con gente nivel 30 que no tiene la experiencia o no sabe que pasados el minuto 30 no puede estar en la jungla enemiga sin visión porque eso implica 40 segundos donde no podemos iniciar y es free objetivo sea torre inhi drag o baron (pongo ese ejemplo como te puedo dar 10 más).","replies":[]}]},{"poster":"Rolando Magic","date":"2016-06-29T03:22:15.324+0000","up_votes":1,"down_votes":0,"body":"Y mira es bastante incierto el mmr de las normales y llegado al punto en donde estas no se si puedas subir o bajar el mmr para cambiar el emparejamiento, va tendrias que ganar muchas partidas pero no es nada seguro","replies":[]}]}