{"poster":"ITACHY21","date":"2015-04-10T17:05:47.856+0000","title":"lag en los servers de las","subforum":"Problemas Técnicos","up_votes":10,"down_votes":1,"body":"estos dias eh estado jugando y es imposible jugar con el nivel de lag que hay ,por eso genero esta discucion para que los de riot lo arreglen . yo creo que el nivel de lag aumento desde que pusieron en la nueva actualizaci&oacute;n la animaci&oacute;n de victoria y derrota . les pido por favor lo discutan y lleguen a un acuerdo para mejorar esto ,saludos itachy21 {{champion:91}} ********","replies":[{"poster":"Rocofu","date":"2015-04-10T20:17:01.537+0000","up_votes":3,"down_votes":3,"body":"Hola!\n\nNo tenemos detectado algún problema general con las conexiones en estos momentos. Anoche sí se tuvo un problema con Cablevisión en Argentina pero cambiaron un equipo y no ha tenido problemas desde hace unas horas. \n\nLos picos de latencia que llegan a 1000 o superior en su mayoría están relacionados a algo local o un problema general que afecte a más de la mitad de los jugadores conectados. Muchas veces son porque se están corriendo más programas que utilicen el ancho de banda u otros recursos.\n\nSi su problema es un lag con respecto a los FPS, esto esta sucediendo entre tu computadora y el lol. Puedes revisar este artículo para soluciones comúnes respecto a estos problemas https://support.riotgames.com/hc/es-419/articles/201752684--Resoluci%C3%B3n-de-problemas-de-bajas-tasas-de-im%C3%A1genes-por-segundo-FPS-\n\n\nPor otro lado, nos pueden enviar su información de conexión utilizando la Herramienta de Análisis de Redes. Si hubiera algo que esté afectando su ruta, podemos detectar ciertas cosas ahí y en algunos casos tomar acción.\nhttp://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/nm7xWOwW-herramienta-de-anaalisis-de-redes","replies":[{"poster":"iLovëNiggäs","date":"2015-04-10T22:00:30.453+0000","up_votes":8,"down_votes":1,"body":"Si bien entiendo que ustedes no hayan detectado nada y también me parece lógico su razonamiento de: si no somos nosotros, probablemente sea la empresa de internet, me parece que aquí hay algo más.\n\nMi punto es que no es uno, no son dos y no somos tres los que estamos teniendo problemas de ping con el server. Porque en cada partida no solo ha aparecido una cantidad extraña e inusual de afk's y no solo eso, sino también jugadores que esporádica pierden la conexión y cuando la tienen, el ping afecta su partida. \n\n¿Cómo? Siendo protagonista del segundo suceso, puedo decir que mi latencia no es, como comúnmente sucede cuando hay problemas, superior a los 300 o los 500. Sino que varía entre 150 > X > 70. Mientras que normalmente se mantiene **estable** en 40. \n\nMuy bien, 70 no es tanto y 150 sigue siendo menos de la que obtenía a jugar en NA, cuando LATAM no existía ¿El problema? Pues, mientras que el que sea aun menor a NA, no es una excusa, el problema es que este ping genera un delay inusual en el juego y el hecho de que en muchas ocasiones se quede \"pegado\" o \"congelado\" (sin que le haya lanzado una ulti Sejuani) el campeón. Imposibilita la fase de labrado -terminología Ozrak- e incluso regala \"free kills\" al quedarse uno parado en la linea clickeando para moverse pero sin que el juego responda, mientras ves como te matan a basicos en nivel 5 (es muy frustrante por cierto). \n\nAhora bien, esto no expone que sea un problema del server o de Riot. Es cierto, pero ¿no es sospechoso que sean \"masivos\" los que tienen este tipo de problema IGUAL o SIMILAR? **Además** que _todos_ concuerdan con que dichos problemas comenzaron luego del último mantenimiento del server e incluso con el regreso de la modalidad U.R.F. al juego? \n\nAquí yo creo que Riot debería hacer una profunda investigación al respecto. Porque no soy ingeniero en sistemas, ni analista, ni programador, ni técnico informático. Pero mi sentido común me lleva a creer que es un problema de los servidor y del juego no de mi proveedor de internet (que por cierto tengo 2 distintos y con ninguno funciona bien el juego).\n\nUn saludo! {{item:3187}}","replies":[{"poster":"Kaynn Shieda ","date":"2015-04-10T22:50:22.982+0000","up_votes":1,"down_votes":0,"body":"me pasa eso exactamente eso y es muy frustrante, yo creo que hay mucha gente que no sabe o no quiere venir al foro a decir que tiene lag o delay\n\nLes aseguro que si pusieran una encuesta a fin de cada partida donde pregunte si el jugador experimento lag o delay mas del 75 % diría que si , yo creo que hay muchos que dentro del juego se quejan del lag aca en el foro no lo hacen","replies":[{"poster":"Poppy Noticiera","date":"2015-04-11T00:46:45.671+0000","up_votes":2,"down_votes":2,"body":"dudo que llegue ni a 50% , es la minoria que tiene lag ,tu crees que no estarían aca quejandose si son 75%? ademas si tienen lag algunos porque algo les esta usando su net y no serviria la encuesta , no seria problema del server , por ejemplo aveces tengo 10k de ping y es porque alguien esta descargando algo xD \n\npd : con 8 mb juego con 38 ms sin problemas desde la beta xD","replies":[{"poster":"Kaynn Shieda ","date":"2015-04-11T02:28:58.734+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=xIBlitzIx,realm=LAS,application-id=X54mVVp0,discussion-id=fENaztpF,comment-id=0008000000000000,timestamp=2015-04-11T00:46:45.671+0000)\n>\n> dudo que llegue ni a 50% , es la minoria que tiene lag ,tu crees que no estarían aca quejandose si son 75%? ademas si tienen lag algunos porque algo les esta usando su net y no serviria la encuesta , no seria problema del server , por ejemplo aveces tengo 10k de ping y es porque alguien esta descargando algo xD \n> \n> pd : con 8 mb juego con 38 ms sin problemas desde la beta xD\n\nnadie te pregunto desde cuando jugas o cuanta net, tenes yo no comparto con nadie y pago el mio,\n\nSe que no esta usando nada ni nadie mi NET, todas las partidas hay un afk y minimo 2 quejandose de que tienen lag en cada team, que vos tengas suerte es otra cosa o seguramente sos de chile, por eso no tenes problemas\n\npd: es muy molesta la gente que viene a decir ***** y no aporta nada al problema que tenemos varios","replies":[{"poster":"ĄsÞhÿxia","date":"2015-04-19T17:08:23.504+0000","up_votes":1,"down_votes":0,"body":"Yo igual soy chileno y me iva a 22 ms o 30ms y salio la actualizacion y PUM! 1000 ms a 4000ms PUUMM! \n\nPD: Uso claro chile","replies":[]}]}]}]}]},{"poster":"MasKasTrero","date":"2017-06-28T07:17:30.973+0000","up_votes":1,"down_votes":0,"body":"hola riot esta esta pasando nuevamente .......... y no es ami solo es a muchos y no es el internet ni ningun programa ni nada de eso me empeso a pasar hace dos o  3 semanas y esta compañia de internet la tengo hace mas de un año y nunca me paso esto..","replies":[]},{"poster":"ElenStrike","date":"2015-04-12T19:38:56.704+0000","up_votes":1,"down_votes":0,"body":"Eso es mentira porque yo juego TERA y no me da problemas, en cambiio juego LOL y hasta me descongiura el DNS, las redes y el firewall... puse un post y hasta lo dieron de baja porque ni se ve.","replies":[]},{"poster":"Superlativ0","date":"2015-04-12T06:49:30.857+0000","up_votes":1,"down_votes":0,"body":"como no viejo? desde que instalaron URF se fue a la mierda el lag, yo no puedo jugar, me sube hasta 4000 en ping, y se me desconecta... hago un test de velocidad y todo ok... planito el grafico.. y los megas y el ping como corresponden.. es problema de la actuaizacion revisenla bien... que de verdad es completamente desagradable jugar en estas condiciones....","replies":[]},{"poster":"Maxi Mérida","date":"2015-04-11T01:09:11.657+0000","up_votes":1,"down_votes":0,"body":"Esta foto es de ayer, y hoy también tengo otras con mas de 2000 ms y ya llame a mi proveedor y nada. Es problema del server no del proveedor nuestro sino seria mucha coincidencia, arreglenlo xq asi nose puede jugar.","replies":[]},{"poster":"AlekoZ","date":"2015-04-11T06:53:20.093+0000","up_votes":1,"down_votes":4,"body":"Tengo la solucion a sus problemas: Cierren el porno para jugar. Gracias por su atencion {{summoner:21}}","replies":[]}]},{"poster":"Demon of Mercy","date":"2015-04-11T05:53:17.098+0000","up_votes":2,"down_votes":0,"body":"a mi sin siquiera tener ping alto (no pasaba de 20~22) ni me bajaban los fps (entre 45~60) como que tenia un delay molesto y a veces no me podia mover :c veia que todos se movian a mi lado y yo no, es algo molesto xd","replies":[]},{"poster":"Mufasa On Bush","date":"2015-04-10T17:53:56.030+0000","up_votes":2,"down_votes":0,"body":"ami me pasa lo mismo no porq nadie de riot dice algo una bronca :c","replies":[]},{"poster":"OKROCKER","date":"2015-04-10T22:01:50.358+0000","up_votes":1,"down_votes":0,"body":"Por mi parte tengo internet de 2GB, quizas no es tanto pero practicamente lo uso yo solo. Y aun asi teniendo 23 ms y 60fps de repente las jugadas se traban (no por el computador) :O y me aparecen de repente mas de 1000 o 2000 ms -.- como dije antes lo uso yo solo. Es internet de Claro ;-; no se si será el server o simplemente Claro con su internet xD","replies":[{"poster":"Esti","date":"2015-04-11T04:36:55.461+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=OKROCKER,realm=LAS,application-id=X54mVVp0,discussion-id=fENaztpF,comment-id=000b,timestamp=2015-04-10T22:01:50.358+0000)\n>\n> Por mi parte tengo internet de 2GB, quizas no es tanto pero practicamente lo uso yo solo. Y aun asi teniendo 23 ms y 60fps de repente las jugadas se traban (no por el computador) :O y me aparecen de repente mas de 1000 o 2000 ms -.- como dije antes lo uso yo solo. Es internet de Claro ;-; no se si será el server o simplemente Claro con su internet xD\n\n2GB XD, esos no son los que contrataste? creo yo que aun no llegamos a los 100 mb de velocidad y tu tienes 2gb? XD","replies":[{"poster":"OKROCKER","date":"2015-04-16T01:06:56.587+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=StheGamer,realm=LAS,application-id=X54mVVp0,discussion-id=fENaztpF,comment-id=000b0000,timestamp=2015-04-11T04:36:55.461+0000)\n>\n> 2GB XD, esos no son los que contrataste? creo yo que aun no llegamos a los 100 mb de velocidad y tu tienes 2gb? XD\n\nSi si xD perdon ..confusion xD Justo estaba buscando Memorias RAM cuando vi esto xD","replies":[]}]}]},{"poster":"DODONPA","date":"2015-04-12T03:12:57.645+0000","up_votes":1,"down_votes":0,"body":"A mi tambien de 60 pasa a 500 de 500 a 700 y ahi baja a 60 y sube a 250 y asi. Espero riot investigue algo sobre esto, que me esta pasando desde el nuevo parche","replies":[]},{"poster":"Deseo","date":"2015-04-11T07:33:24.740+0000","up_votes":1,"down_votes":0,"body":"Tengo LAG con Zac y otros campeones. Activo la E y el MS sube a 2700 (rojo)\n\nConexion: ARNET (Argentina) 6 Megas\n\nCompartan conexion y pais.","replies":[]},{"poster":"Kaynn Shieda ","date":"2015-04-10T21:34:26.819+0000","up_votes":1,"down_votes":0,"body":"si anda todo mal hasta el cliente, anda re bug y para atrás, lo demás me anda a la perfección, solo con el LOL tengo problemas","replies":[]},{"poster":"sergios","date":"2015-04-10T20:56:38.172+0000","up_votes":1,"down_votes":0,"body":"condor yo revise y no tengo nada que ocupe la conexion juego a otros juegos y me anda bien solo al jugar lol se me arruina y solo se arruina en la tarde y noche despues llame al provedor de internet todo normal esto me pasa desde que cambiaron a telered o no recuerdo que cosa de argentina ;(","replies":[]},{"poster":"Time Lord","date":"2015-04-10T19:53:38.843+0000","up_votes":1,"down_votes":0,"body":"Quizas sea problema de zonas =\\ yo tengo 22 de ping constante y no he tenido lag para nada. =(\n Ojala se solucione el problema pronto para ustedes.","replies":[]},{"poster":"zPeluchin","date":"2015-04-10T19:35:26.437+0000","up_votes":1,"down_votes":0,"body":"Pense que era el unico que le daba  lag con la nueva actualizacion {{champion:32}}","replies":[]},{"poster":"Reng073","date":"2015-04-10T19:24:39.854+0000","up_votes":1,"down_votes":0,"body":"+100 me dan pings de hasta 1k y pico, arreglen porfa","replies":[]},{"poster":"Mariihuana","date":"2015-04-10T18:56:52.769+0000","up_votes":1,"down_votes":0,"body":"siii para el oje.. esta andando su server!! me pasa lo mismo,ecima me tira des conexiones con ping 120!!!!!!!!!!!! cuando me deberia andar de 10!! .. jugue una partida,me anduvo mal,jugue otra y me anduvo de 10,ganamos todo y la tercer partida ya ni me dejaba entrar :/ y cuando entraba me desconectaba.. vi a otro de mi team que le paso lo mismo... GG RIOT!!!!","replies":[]},{"poster":"Shappaw","date":"2015-04-10T18:11:50.260+0000","up_votes":1,"down_votes":0,"body":"No sé por qué le dan downvote al thread si tiene razón, hay lag. Everywhere.","replies":[]},{"poster":"Kaynn Shieda ","date":"2015-04-10T18:07:32.451+0000","up_votes":1,"down_votes":0,"body":"si somos varios  asi y nadie aclara nada ¬¬","replies":[]},{"poster":"Sorglegt","date":"2015-04-11T15:54:32.302+0000","up_votes":1,"down_votes":3,"body":"Pc de carton y inca-net....","replies":[]}]}