{"poster":"Sir Jazza","date":"2015-08-15T10:33:13.791+0000","title":"Recruiting Ranked 5 Team members for Serious Play!","subforum":"Team Recruitment","up_votes":4,"down_votes":0,"body":"Hey guys,\r\n\r\nI have decided on starting up my own ranked team, as I have had many previous experiences with ranked teams and want to start getting serious in the ranked 5&#039;s side of the game. I am 17 years of age and am currently Gold 5 and have been in approximately 4, ranked 5 teams. I have great knowledge in the area of teams and working together to achieve the goal of victory. As I am taking this seriously, I will be having schedules in which games are going to be played, practice sessions, and general team meetings which will be occurring every week when possible. I will be wanting the members of the team to be able to play at least 10 games per week. So the team will be consisting of Gold 1 onwards. Not accepting anyone below that as this is a serious ranked team.\r\n\r\nTo show that you are interested and would be willing and dedicated to join the team, I&#039;d happily ask if you&#039;d fill out a short application and I will get back to you as quickly as possible.\r\n\r\nIGN:\r\nAge:\r\nMain Role:\r\nFavourite Champion:\r\nRank:\r\nCurse or Skype:\r\nLength of time you could dedicate to the team p/day:\r\nWhat hours suit you best to play:\r\nA bit about yourself and league experience:\r\n\r\nOnce I have accepted your application, I will notify you from in game and go from there!\r\n\r\nThanks, Sir Jazza","replies":[{"poster":"eLoQuEnCe","date":"2015-08-21T09:06:20.128+0000","up_votes":1,"down_votes":0,"body":"IGN:Wildfire Zyra\nAge:28\nMain Role:sup\nFavourite Champion:thresh,leo,sona\nRank:gold 4\nCurse or Skype: team speak? skype\nLength of time you could dedicate to the team p/day:3-6\nWhat hours suit you best to play:5-12pm nz time\nA bit about yourself and league experience: love lol just need the right team:)","replies":[]},{"poster":"Tung","date":"2015-08-18T06:27:22.754+0000","up_votes":1,"down_votes":0,"body":"IGN: Tung\nAge: 19\nMain Role: Mid / Top / Jg\nFavourite Champion: Ahri, Fizz, Yasuo (changes over time, can play anything)\nRank: D4\nCurse or Skype: Skype\nLength of time you could dedicate to the team p/day: Few hours\nWhat hours suit you best to play: Weekdays (6 onwards), Weekends (anytime)\nA bit about yourself and league experience:\n- Studying commerce at uni\n- Played other games like FFXIV, GW2, CS:GO and random single player games\n- Played since S1\n- Played in a few ranked teams, but mainly just consisted of friends with varied skill levels\n- Always playing to improve mechanically and strategically","replies":[]},{"poster":"Scrawny Unicorn","date":"2015-08-16T11:09:22.675+0000","up_votes":1,"down_votes":0,"body":"IGN: Scrawny Unicorn \nAge: 20\nMain Role: adc\nFavourite Champion: vayne, gaves and corki\nRank: plat 4\nCurse or Skype: Skype\nLength of time you could dedicate to the team p/day: as much as I can\nWhat hours suit you best to play: 4-12 pm nz time\nA bit about yourself and league experience: Been playing since season 2 and improving each season, but I've never played ranked 5s before but being someone who plays a lot of team sports working with a team shouldn't be a problem. I am a quiet person at first so give me time  :)","replies":[]},{"poster":"Spaghini","date":"2015-08-16T02:10:47.943+0000","up_votes":1,"down_votes":0,"body":"IGN; Spaghini\nAge; 18\nMain role: Top lane\nFavourite champion: Riven\nRank: Platinum 4\nCurse or Skype: Have both along with  teamspeak\nLength of time I can dedicate to team: From about 7-10pm each night at least, potentially longer\nWhat hours suit: Weeknights, any time weekends\nA bit about myself: Playing mainly carry toplaners (riven/fizz/rumble) but happy to play tanks/anyone in flavour for 5s \n(e.g. maokai, olaf, hecarim, shen). Watch a lot of pro scene, already play in a semi-serious 5s team but looking\nfor something more serious.","replies":[]},{"poster":"Mattsherona","date":"2015-08-15T17:58:23.933+0000","up_votes":1,"down_votes":0,"body":"IGN: Mattsherona\nAge: 18\nMain Role: Jungle\nFavourite Champion: Master Yi\nRank: Diamond 5\nCurse or Skype: Have Skype, happy to give if im on team.\nLength of time you could dedicate to the team p/day: Not sure about team, but I usually play 3-4 hrs of league a day\nWhat hours suit you best to play: Weekdays --> NIghts, Weekends --> Day&Night\nA bit about yourself and league experience: I main junglers that can carry currently (i.e. master yi, xin). However, seeing many pro games, once at a higher elo, im happy to learn others more suited to cc and helping midlaners / botlaners get fed.\nhttp://plays.tv/u/Mattsherona\nhttp://oce.op.gg/summoner/userName=mattsherona\nLinks to some plays I've made in the past week (since I realised my gpu can record) and match history","replies":[]},{"poster":"xuzhinhen","date":"2015-08-15T12:06:02.679+0000","up_votes":1,"down_votes":0,"body":"IGN: Xuzhinhen\nAge: 21\nMain Role: ADC\nFavourite Champion: Twitch\nRank: Plat V\nCurse or Skype: both but pref curse\nLength of time you could dedicate to the team p/day: 16 hours\nWhat hours suit you best to play: 10am - 4am\nA bit about yourself and league experience: Been playing league for 3 years, looking to get into the professional scene","replies":[]}]}