{"poster":"Megamaexx","date":"2017-07-23T10:00:55.073+0000","title":"Neulinge und Jungle","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":0,"body":"Hey Leute und alle, die es werden wollen,\r\n\r\nmir kam gerade etwas in den Sinn:\r\nAlle, die ich kenne, die nach mir frisch mit LoL angefangen haben, haben keine Lust, Jungle zu spielen oder zu lernen. Da kommen dann gerne mal die Aussagen bei der Rollenwahl &ldquo;Ich spiel alles au&szlig;er Jungle&ldquo;. Nur warum?\r\n\r\nIst der Jungle wirklich etwas, wo man sich so hart reinarbeiten muss, dass Spieler, die noch nicht so lang spielen, diese Rolle nicht testen wollen?\r\n\r\nKennt ihr auch solche Leute oder kommt das nur bei mir vor? (Ich hab halt nur eine geringe Menge an Daten f&uuml;r diese Auswertung)\r\n\r\nIm Vergleich zu den &auml;lteren Seasons, ist es so viel schwerer geworden, zu junglen?\r\n(Ich habe in Season 2 das erste Mal gejunglet und das noch vor Level 30. Mir wurde damals oft davon abgeraten, weil ich ohne Runen und Meisterschaften im Jungle verrecken w&uuml;rde, haben sie gesagt. Mit Fiddlesticks oder Warwick ging das auch fr&uuml;her^^)\r\n\r\nVielen Dank f&uuml;r eure Zeit :3\r\nMfG Megamaexx","replies":[{"poster":"need elo police","date":"2017-07-23T14:09:59.394+0000","up_votes":2,"down_votes":0,"body":"Ich sehe auch Jungle als schwerste Rolle an, aber nicht unbedingt wegen der Rolle ansich sondern weil du sehr oft einfach Schuld an allem hast...und das tilted eben. Wenn die Leute ihre Lane verlieren geben sie dir die Schuld weil keine ganks bzw. schlechte ganks kamen, sie geben dir die Schuld wenn du falsch smitest, sie geben dir die Schuld wenn du nur Monster farmst aber nicht gankst, sie geben dir die Schuld wenn du counter junglest anstatt zu ganken, und und und...wenn ich Support spiele bin ich nie Schuld, egal wie schlecht ich spiele.","replies":[]},{"poster":"franticFurball","date":"2017-07-23T11:36:43.517+0000","up_votes":2,"down_votes":0,"body":"Der Jungler hat enorme Verantwortung, sehr hohen impact und in keiner anderen Rolle kann man soviel falsch machen.","replies":[]},{"poster":"The mute Swan","date":"2017-07-23T11:35:09.214+0000","up_votes":2,"down_votes":0,"body":"Kommt ganz auf die meta an. Ich spiel jetzt schon eine ganze weile und ich spiele größtenteils support und toplane.\nDie meisten Rollen kann ich auch einigermaßen spielen, ich kann 1-2 adcs so spielen, dass ich nicht reinfeede und wenn ich dann mal mit support/top auf die midlane gefilled werde spiele ich meistens etwas unkonventionelles, sei es einen midlane tank, weil wir einen mage-support/jungler haben oder sowas wie ori, wo es eigentlich recht wenig schlechte matchups gibt. In der Jungle-rolle habe ich mich nie wirklich heimisch gefühlt, weil mir jungle routen, invades, counterinvades und die agressive carry-jungle geschichte nie gefallen hat. Und meine beiden junglepicks sind mittlerweile auch nicht mehr so gut wie in s4. Die rammus-veränderungen haben ihn etwas anders zu spielen gemacht und ich müsste mich wohl neu in ihn reinfühlen. Meine eve ist auch nur dann effizient, wenn ich einen hardcarry toplaner habe, weil ich mit ihr für gewöhnlich eine lane hardsitte. Und meine jungle fiora ist seit dem rework nicht mehr viable. Vielleicht bekomme ich ja mit den mundo-änderungen einen neuen jungler, wer weiß...\n\nFest steht, wenn ich aktuell jungle gefilled werde und der gegnerjungler auf seiner main-position spielt, ist das game bei fairem matchmaking und ausgeglichenen lanes zu 75% schon verloren. Ich kann mein bestes geben, aber ein lee main wird mich trotzdem zerstören, da man im gegensatz zu einer lane im vergleich nicht so safe spielen kann.\n\nSvenson out","replies":[]},{"poster":"iTs SyneX","date":"2017-07-23T10:05:39.851+0000","up_votes":2,"down_votes":0,"body":"Also ich spiele lol selbst seid 2 Monaten und finde den Jgl mit den richtigen Champions als einfachste Rolle, da du wenn du deine Ganks nicht verkackst keine Gegner feeden kannst^^","replies":[{"poster":"Shooter90","date":"2017-07-23T10:45:13.799+0000","up_votes":2,"down_votes":0,"body":"das stimmt vllt, aber im jungle kommt keinen impact haben quasi feeden gleich imo.","replies":[]},{"poster":"Ma1days","date":"2017-07-23T20:58:09.704+0000","up_votes":1,"down_votes":0,"body":"wenn du mal gegen bessere spieler spielst und selber besser bist wirst du merken das dazu mehr gehört als ganken\nich selber kann mich noch an ein game aus season 2 erinnern ich war amumu und musste gegen einen lee (vermutlich ein smurf spielen)\ndamals waren die buffs noch viel wichtiger als heute und hatten viel einfluss aufs spiel \nder lee hat mir die ersten 3 buffs gestolen und mich jedes mal gekillt und er wusste jedes mal wo ich bin was ich damals nicht verstanden hab wie so etwas überhaupt geht \ndas erste mal konnte ich in dem game mit lvl 6 ganken und durch den lee war ich glaub 2 level unter meinem support","replies":[]}]},{"poster":"MVP Toxic","date":"2017-07-23T10:34:13.475+0000","up_votes":3,"down_votes":1,"body":"Jungle ist die schwerste Rolle  im ganzen Game.\nIch will jetzt nicht sagen wichtigste, weil jeder Rolle hat ihre eigene Wichtigkeit und Funktion.\n\nAber du musst im Jungle am meisten wissen, wenn du gut sein möchtest. Du musst auch am meisten im Vorraus nachdenken und das Spiel lesen können.\nIm Prinzip musst du die MatchUps jeder Lane kennen und nicht nur eine Lane wie beispielsweise der Midlaner, da du deine Ganks und Pathing danach ausrichtest.","replies":[]},{"poster":"Temudschinn","date":"2017-09-08T15:34:36.473+0000","up_votes":1,"down_votes":0,"body":"Ich find gerade für Einsteiger Jungle eingentlich recht praktisch. Ja, man muss sich mehr darum kümmern Ahnung vom Makrogame etc. zu haben, aber es entfallen zwei höllisch wichtige und höllisch schwierige Dinge, zumindest zu einem grossen Teil: lasthitting und Matchupkenntnisse.\nMan kann sich gemütlich auf seinen Champion und das Makrogame konzentrieren und muss nicht auch noch die CDs der möglichen Gegner im Überblick haben.","replies":[]},{"poster":"Tödil","date":"2017-09-08T09:31:48.503+0000","up_votes":1,"down_votes":0,"body":"Es hängt mehr oder weniger damit zusammen (zumindest bei mir), dass alle es mir abgeraten haben. Nachdem ich dann kurz vor lvl 30 ein wenig im Jungle unterwegs war, stellte ich fest, dass die Rolle mir gefiel, allerdings zu viele Lee Sins, Rengos und Shacos rumgurkten. Das nagt echt lange an einem. Und wenn man dann auch noch Geschwister oder Freunde hat, die die Rolle mainen oder auf einer höheren Elo sich messen, dann verliert man oft die Motivation daran, da diese dann all die negativen Aspekte immer wiederholen und die sich (scheinbar) immer bewahrheiten. Ein Junger ist nicht für deinen Tod verantwortlich, wenn du in ersten 2-3 min einen First Blood abgibst. Er solll Druck aufbauen und Kontrolle aufbauen. Er bereitet für euch vor, und ihr müsst mit dem Werkzeug, welches er euch dann weiterreicht dafür nutzen, den Vorteil auszubauen.Mittlerweile will ich aus der öden Welt des Supporters ausbrechen und mich im Jungle probieren, denn 1. habe ich die Rolle am wenigsten gespielt bzw. überhaupt versucht zu mainen und 2. sind wieder nach 2 Seasons erneut einige Champions, die damals viable waren, aber von ihren 'richtigen' Rollen ausgebremst oder aufgrund von Reworks (oder Patches) nicht mehr funktioniert haben, wieder zurückgekehrt (Ezreal jgl {{summoner:4}} ) oder neu dazu gekommen. \nAktuell übe ich Graggy (und Brand auf einem Smurf, erst Support, will ihn aber auch im Jgl spielen).\nLasst euch nicht verunsichern, aller Anfang ist schwer. Doch die Mühe lohnt sich.\n\n{{sticker:garen-swing}} {{sticker:vlad-salute}} \n\nMFG\nTödil","replies":[]},{"poster":"ZockerJan","date":"2017-08-28T16:16:40.125+0000","up_votes":1,"down_votes":0,"body":"Ich muss zugegben ich hab mir jetzt nicht alle kommis durchgelesen aber ich denke das hat noch keiner genannt:\nDer jng wird SEHR gerne von leuten geflamt.\nWarum?\nWegen allem möglichen:\nDu gankst,tötest den gegner und der midlaner der einmal autoattackt hat flamt dich für ks\nMan kann es sich wie eine toxische Vayne vorstellen(nicht gegen euch vayne mains :) nicht jeder ist ein flamer)\nWegen jeder <anderes Wort für Extremente> beschweren sich viele\nNa klar nicht jeder ist so.\nAber da ich gerne mal jng spiele weiß ich wie es ist,wenn man geflamt wird weil man nicht eine 12/0/X Illaoi ganken möchte\n\nps.ich habe nicht auf Reschtschraibunk;zeichen.setzung;oder ähnliches geachtet also bitte flamt mich nicht ^^(für den schlechten Witz könnt ihr mich ruhig flamen xD)","replies":[]},{"poster":"Nordwolf87","date":"2017-07-24T14:08:47.663+0000","up_votes":1,"down_votes":0,"body":"Fürn jungle musst halt nicht nur viel wissen sondern auch erfahrung haben und ein gespühr für die map bzw eine gute übersicht. \n\nIch habe die rolle am anfang gehasst. Ich war immer auf der falschen seite unterwegs, wenn zb toplaner gepingt hat ich soll ganken war ich grad am anderen ende am wächter dran oder am raptorcamp....bis ich dort war war alles vorbei und ich war wieder am falschen ende der map...also hab ich versucht immer in eine lane zu kommen.\n\nAber wenn man schon etwas erfahrung hat tut man sich da leichter...k6 macht richtig laune (mit lee sin bin ich noch nicht recht warm geworden).","replies":[]},{"poster":"Megamaexx","date":"2017-07-23T21:46:54.159+0000","up_votes":1,"down_votes":0,"body":"Ich spare mir mal, jedem einzeln zu antworten^^\nDanke für eure Meinungen (falls ihr das überhaupt noch lest :P)\nEs liegt eurer Meinung wohl an der Verantwortung, die man damit zu tragen scheint und ein gewisses Wissen vorausgesetzt wird. Kann verstehen, dass das für Neue nicht attraktiv ist (eher abschreckend) und diese sich einfach andere Positionen suchen.\n\nAuch schön zu erfahren, dass es auch Neue auf der Jungle-Position gibt (mindestens einer :D)","replies":[]}]}