{"poster":"Megamaexx","date":"2016-12-27T21:20:52.147+0000","title":"Wann Morgana, wann Janna, wann Karma?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\n\r\nIch bin gerade flei&szlig;ig dabei, Bronze zu verlassen. Allerdings f&auml;llt es mir schwer, den richtigen Champion zu w&auml;hlen.\r\n\r\nSo war beispielsweise mein Janna-Pick im vorletzten Ranked Game ein sehr schlechter Pick, meine Karma danach allerdings goldrichtig.\r\n\r\nAlso was sind eure Empfehlungen?\r\nGegen Blitzcrank immer Morgana?\r\nF&uuml;r hypercarries am besten Janna?\r\nF&uuml;r aggressive ADCs am besten Karma?\r\n\r\nWas ist gut gegen aggressive gegnerische Supporter? \r\nWelche der drei gegen beispielsweise eine Janna oder Soraka? \r\n\r\nMeine bisherigen Erkenntnisse:\r\nMorgana funktioniert gut gegen Leona und Blitzcrank und gut mit Miss Fortune.\r\n\r\nUnd zum Schluss noch eine Umfrage^^","replies":[{"poster":"MeMyselfandBaal","date":"2016-12-27T21:36:24.008+0000","up_votes":3,"down_votes":2,"body":"Ganz dumme Antwort: Als Firstpick empfehle ich Sona. Die kann halt alles, auch wenn andere die einzelnen Dinge besser können. Deswegen kannst du mit ihr (gerade wenn dein Team nicht ansagt, was sie spielen wollen) nie was verkehrt machen. Und Sona ist halt vom Kit her so solide, dass sie auch nie unpassend ist.\nWenn Sona allerdings nicht zur Debatte steht, würde ich Karma nehmen, weil man mit ihr halt im Early Game unfassbar viel Druck aufbauen kann. Also wenn der gegnerische ADC gegen Karma nicht unterm eigenen Turm farmen muss (was in Bronze oftmals mehrere \"Kills\" an Farmunterschied wert ist), machst du irgendwas falsch...\n\nMorgana würde ich dir wirklich nur gegen Blitz empfehlen. Ich spiele sie selber aus einem einfachen Grund nicht: Wenn du mit ihr hinten liegst, hast du quasi keine Ulti, weil du jedes mal stirbst, bevor du die durch kriegst. Mit einer Janna (oder, ich bleibe dabei, Sona) kannst du durch geschicktes R Drücken auch noch Teamfights entscheiden, wenn du selber 0-3 stehst. Meiner Meinung nach ist sie nach den ganzen Schild-Buffs, von denen sie relativ wenig hat (bei ihr geht es mehr um das Timing um die CC zu verhindern als um die Schildstärke), ein wenig aus der Meta gefallen. War aber halt auch nie ein Freund von ihr...\n\nUnd Janna... lustiger Weise mache ich den Pick nicht vom Hypercarry ADC abhängig, sondern vom Toplaner und Jungler. Wenn ich da nen Darius Top oder nen Rengar/ Hecarim Jungler im Gegnerteam habe (also Viecher, die meinen ADC oneshotten können), nutze ich Janna um diese Typen von meinem ADC fern zu halten... Ein gut gespielte Vayne als Hypercarry ist halt nicht so leicht zu kiten wie ein Darius...\nDas beste am Janna Blind Pick: Dein ADC kann mit ihr an der Seite quasi seine Lane nicht verlieren, da du mit deinen Schilden (wenn du sie gut setzt) viele an sich schlechte Trades ausgleichen kannst. Also wer mit Janna an seiner Seite keine ordentlichen CS Zahlen und 0 Tode als ADC auf die Reihe bekommt, dem ist auch nicht zu helfen...\n\nWas ich dir am Ende noch ans Herz legen würde, ist Braum. Der ist mechanisch einfacher als Alistar... und auch wenn wir uns angeblich in einer TopLane Tank Meta befinden... meine Toplaner scheinen davon nichts wissen zu wollen und schieben diesen Job gerne auf den Support. Da ist es hilfreich einen peelenden Tank-Support im Roster zu haben...","replies":[{"poster":"clair de lune289","date":"2016-12-27T22:24:01.752+0000","up_votes":4,"down_votes":1,"body":"als Main Support halte ich Morg eigentlich immer für einen sehr soliden pick grade wenn ich Firstpick bin.\nDer CCschutz von ihrem Schild ist mMn  eine der stärksten defensive Fähigkeiten die es im Spiel gibt dazu kommt ihr hohes pick Potenzial mit Q (z.b. zusammen mit Cait ist das auslösen einer Fall+Morg Qin der Regel ein free Kill oder zumindest ein Summoner.\n1 Punkt in W und du musst dir nie Sorgen machen das du auch ja deine {{item:3098}} Stacks bekommst.\n\nSona ist ganz klar ein \"sicherer\" Pick aber sie ist sehr leicht einzuschätzen.Damit mein ich das ihr grade in einer \"etwas\" höheren Elo (low Gold) {{summoner:4}} + Ulti ihr einziges playmaking Potenzial wenn der Gegner nicht blindlings in eine Falle rennt.\nOhne diese Combo sieht man Sona auf einen zukommen und geht einfach in die andere Richtung, ich denke du verstehst was ich meine.\nmMn ist Sona der Archetype eines Supportund grade für Support einsteiger zu empfehlen.\n\nJanna ist einer der besten peeling Supports der kein Tank ist,aber nur wenn du deinem adc vertraust bzw dich gut auf unbekannte adcs einstellen kannst solltest du solo unterwegs sein.\n\nKarma picke ich in der Regel eher mit Champs die gutes chase Potenzial haben oder einfach nur mobil sind (z.B. {{champion:81}} {{champion:120}}\nDie lustigste Combi ich je hatte mit Karma war Heca Sivir Karma Olaf TF (ist aber schon lange her war glaub ich Anfang season 5??)\n\nEin Champ der mir noch sehr ans herz gewachsen ist ist Nami. Sie hat weniger Manaprobleme im Vergleich zu Sona wenn man heals spammt/spammen muss.\nIhre Ulti ist breiter/länger und eignet sich super als follow auf ein Hardengage wie z.B. {{champion:54}} .\nNami hate ebenfalls einen Slow/AA buff für dich oder den adc was ihr aber den größten Vorteil über Sona in Lane gibt ist ihre Bubbel. Sona hat nur 1 HardCC und das ist ihre Ulti die man frühstens mit level 6 skillen kann.\nDie Bubbel braucht Übung (jede menge sogar) aber sie hat mir schon oft die Lane auf level 2/3 gewonnen.\n\nBei der Champwahl ist aber das oberste Gebot \"nimm den Champ mit dem du am meisten Spaß **_und_** Selbstvertrauen hast\"","replies":[{"poster":"Megamaexx","date":"2016-12-27T22:43:17.868+0000","up_votes":1,"down_votes":0,"body":">Bei der Champwahl ist aber das oberste Gebot \"nimm den Champ mit dem du am meisten Spaß und Selbstvertrauen hast\"\n\nDeswegen habe ich genau die drei ausgewählt ^-^ \nKarma+ Hecarim funktioniert einwandfrei und mit einem Lucian dazu kann man super eine Lane gewinnen :3","replies":[{"poster":"clair de lune289","date":"2016-12-27T22:45:10.112+0000","up_votes":1,"down_votes":0,"body":"ich find die Combi mit Sivir anstatt Lucian besser,aber mit Lucian geht das natürlich auch^^","replies":[]}]}]},{"poster":"Megamaexx","date":"2016-12-27T22:53:32.749+0000","up_votes":1,"down_votes":0,"body":"Mit Sona bin ich nicht sonderlich stark, das wäre wohl nicht förderlich, die zu spielen x)\nBraum ist ganz nett und sitzt bei mir bereits auf der Ersatzbank, aber mit den anderen dreien bin ich effizienter.\nTrotzdem danke für die Tipps :)","replies":[{"poster":"Nivoras","date":"2016-12-27T23:16:05.237+0000","up_votes":2,"down_votes":1,"body":"Sona ist auch insgesamt nicht sonderlich stark. Und ich kenne auch einige AD-Cs die es wirklich hassen mit ihr zu spielen. Poken und healen können andere besser, und der ADC muss eigentlich genauso eigenständig sein wie mit einer Janna/Soraka, nur dass die wesentlich mehr Utility mitbringen und Fehler im Positioning des ADCs ausgleichen, während Sona eigentlich nurab und an mal Fehler des Gegners mit der Ult bestrafen kann. Aber vielleicht bin ich da auch etwas unfair und rede ich sie auch *zu* schlecht weil ich sie selbst einfach überhaupt nicht spielen mag und das Kit echt stumpf finde. Das beste an ihr ist imo halt die Musik des Ultimate-Skins, der macht alles andere in Game dann wieder gut xD","replies":[{"poster":"OrangeBubble","date":"2016-12-28T00:06:14.197+0000","up_votes":2,"down_votes":1,"body":"Sorry, dann ist die Sona einfach schlecht. Sona richtig gespielt, dominiert zu 90% im alleingang die Lane und der ADC kann frei farmen und muss sich keine Sorgen machen. Einzig allein Sachen wie Leona können tricky werden, sind aber bewältbar. Außerdem hat Sona unfassbares Teamfight potential mit den richtigen Items.\n\n/edit: \nWas ich mich auch immer frage, hier wird im Forum durchweg immer behauptet, Sona sei so schwach, weil Champ XYZ kann dies und jenes ja besser, wieso hat sie durchweg in jeder Elo dann über 50% (ca. 53% im Durchschnitt, Challenger mal nicht beachtet - dort 72%) Winratio, wenn sie so schlecht ist. Für mich erschließt sich da schlichtweg die Logik nicht. Sona ist genauso spielbar, wie Nami oder Soraka oder i.ein anderer Supporter. Mag sein, dass vielleicht ein spezifischer Supporter etwas besser abschneidet, aber Sona perse schneidet nicht schlecht ab .. \n\nNami beispielsweise schneidet erst im Master besser ab, da hat Nami 58% und Sona \"nur\" 54%, tdm würde ich nicht behaupten, dass man Sona nicht spielen könne.... \n\nChallenger lass ich mal außen vor ~ \n\nQuelle: http://euw.op.gg/statistics/champion/","replies":[{"poster":"Supportsmanlike","date":"2016-12-28T00:13:54.468+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OrangeBubble,realm=EUW,application-id=Wj1wcocU,discussion-id=BN9iwZHY,comment-id=0000000100000000,timestamp=2016-12-28T00:06:14.197+0000)\n>\n> Sorry, dann ist die Sona einfach schlecht. Sona richtig gespielt, dominiert zu 90% im alleingang die Lane \n\nJoa.\n\n> [{quoted}](name=Supportsmanlike,realm=EUW,application-id=Wj1wcocU,discussion-id=BN9iwZHY,comment-id=00030000000000000000,timestamp=2016-12-27T23:19:57.805+0000)\n>\n> Richtig, Sona ist einfach ein instant lose, wenn du nicht richtig gut mit ihr bist\n\nMeistens wird Sona aber von Leuten gepickt die keine Ahnung vom supporten haben, einfach weil sie denken sie wäre super easy.\nDann muss ich nur noch mit Thresh auf sie zu laufen E -> Q machen und sie ist 100%ig tot wenn sie keinen Flash hat. Ist halt wirklich so :D","replies":[{"poster":"OrangeBubble","date":"2016-12-28T00:27:00.320+0000","up_votes":1,"down_votes":0,"body":"Wenn ich Sona bin und ich hab nen Thresh als Gegner, hab ich zu 95% die Lane gewonnen, ohne das der ADC großartig was tun muss. Thresh sollte kein großartig schwieriges Matchup sein.\n\nNur weil Leute zu blöd sind, um einen Champion anständig spielen zu können, heißt es nicht, dass der Champ zu schwach wäre...","replies":[{"poster":"Supportsmanlike","date":"2016-12-28T00:43:15.684+0000","up_votes":2,"down_votes":1,"body":"Bist du jemand der keine Ahnung vom supporten hat und nicht weiß wie man Sona spielt?\n\nSona ist meiner Meinung nach trotzdem nicht so geil, weil sie alles kann, aber nichts davon wirklich gut.","replies":[]},{"poster":"clair de lune289","date":"2016-12-28T10:04:01.962+0000","up_votes":1,"down_votes":0,"body":"Also wenn ich Sona spiele ist mein Alptraum immer Alistar.\nAlles was einen guten gapcloser + CC + flash hat kann für eine Sona recht schnell sehr gefährlich werden.\nIn der Regel stirbt man aber nur wenn man einen skillshot nicht dodge,aber sobald das passiert bist du in der Regel Tod  außer du hast deine Summoners up.\nBei Nami/Morg komm ich dann öfters noch weg mit Sona eher nciht das muss allerdings nicht unbedingt am Champ liegen.\nAnsonsten kann ich nur sagen sobald du ein bischen Manareg (oder Oceandrake <3) und CDR + level 11 hast, wird Sona extrem lustig.","replies":[{"poster":"OrangeBubble","date":"2016-12-28T11:08:22.464+0000","up_votes":1,"down_votes":0,"body":"Alister, Naut, Leona sind alles ungünstige Matchup, ich will auch nicht behaupten, dass Sona gegen alles super ist, ist sie nicht, sie ist gegen solche Machtup spielbar, aber in der Regel wird eine mittelmäßige Sona gegen Alistar Nautlisu Leona komplett verlieren. \n\nSona braucht vor allem Erfahrung, man muss wissen, wann man wo stehen kann, wann man aggressiv spielen kann, wann man deffensiv spielt. Auch skill ich meine zumindest Sona immer situationsabhängig, in vielen Guides lese ich, max. Q, ich selber präferiere aber eher W, da meine ADC's den Heal meistens nötig haben, gewinne ich meine Lane aber haushoch, max ich Q für Snowballeffekt, bei ausgeglichener Lane eher eine Mischung aus Q und W. \n\nIch würd' auch niemanden raten, dass er Sona first picken soll, da ist Morgana einfach die bessere Wahl, da Morgana eben durch das Spellshield keine Matchup hat, wo sie überhaupt nichts machen kann, mich stört es nur immer wieder, dass behauptet wird, Sona sei schlecht, obwohl sie nicht schlechter ist, als andere Utility Supporter. Ich persönlich mag sie vorallem, weil sie ein Allrounder ist, der einfach alles i.wie kann und ich zumindest finde, dass man dadurch flexibel ist. \n\nAber nun gut, ich hab Sona bis jetzt immer gespielt, egal ob die Meta für sie oder gegen sie war *Schulterzuck*","replies":[{"poster":"clair de lune289","date":"2016-12-28T12:11:33.150+0000","up_votes":1,"down_votes":0,"body":"ich liebe es z.B: Sona gegen andere Healchamps zu spielen (Nami/Soraka)","replies":[{"poster":"Lyrinn Delaire","date":"2016-12-29T23:12:21.250+0000","up_votes":1,"down_votes":0,"body":"Hey, Sona Main hier :) Zwar unranked aber hey, Main ist Main xD \nIch finde, Sona ist ein super Support. Natürlich hat sie ihre Schwächen, aber jeder Champion hat schwächen. Eine Sona stirbt schnell wenn sie all-in't wird, aber wenn man sie richtig spielt wird man einfach nicht all-in't ^^ Es gibt sicherlich einige Supporter die einen besseren Job machen als Sona (besseren Heal, besseren Schild, besseren Poke, mehr CC), aber trotzdem macht Sona einen sehr guten Job, wenn sie richtig gespielt wird! \nIch habe eine Zeit lang Sona weniger gespielt, teilweise weil ich einfach Lust auf andere Supports hatte, teilweise aber auch, weil mir von meinen Freunden mit höherer Elo (jeder mit nem Rang ist höher als ich x)) eingeredet wurde 'Sona ist schlecht, du musst unbedingt nen TankSupport spielen!' ... Aber mittlerweile weiß ich wieder: Sona ist nicht schlecht! Sona ist ein guter Supporter mit Heal, Schild, Poke, CC, Buffs fürs Team und Debuffs fürs Gegnerteam! Wenn man die PowerChords richtig nutzt hat Sona alles was ein Support braucht! \nWollte nur mal meinen Senf zur Sona-Diskussion zugeben :) {{champion:37}} {{summoner:31}}","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Nivoras","date":"2016-12-27T23:04:38.073+0000","up_votes":2,"down_votes":0,"body":"{{champion:40}} Also im Moment spamme ich Janna, und das auch eigentlich mit Erfolg (die Winrate ist grade etwas niedriger als sie sein sollte, lag vor ein paar Tagen noch bei 60%:D) Eigentlich ist sie ein sehr solider Pick, und natürlich einfach göttlich gegen alles was Dashes hat. Dazu ist ihr Prinzip recht simpel, trotzdem kann man noch ziemlich gute Plays machen und sieht stetige Verbesserung wenn man sie viel spielt, wenn man zB Gegner immer besser interrupten kann, besser tradet usw, das einzige was man bei ihr falsch machen kann ist einen gefeedeten Gegner mit der Ult ins Team zu schieben. \n\n{{champion:267}} Normalerweise wäre Nami der bessere Firstpick da noch etwas mehr aggressive Möglichkeiten in der Lane, aber meistens nehme ich dann doch Janna alleine schon damit der Gegner sie nicht bekommt und hoffe halt dass ich keine Zyra auf die Lane bekomme. \n\n{{champion:43}} Ich glaube wenn in einem Team viele Sachen sind die in euch reinlaufen, wie zB Olaf, dann wäre Karma wahrscheinlich besser, ebenso für Lanes die das Early gewinnen müssen (zB Sivir/Lucian gegen Vayne/JInx).\n\n{{champion:25}} Morgana... meh weiß nicht füher habe ich sie gern gespielt, diese Season irgendwie nicht mehr so. Gegen Blitzcrank und Nautilus super, aber ansonsten bin ich von ihr als Supp irgendwie nicht mehr so überzeugt und sehe sie auch nur selten. Das Q fliegt halt ziemlich langsam und ist auf große Range kaum zu treffen, die Ult braucht oft ein Zhonyas um durchzukommen und ist mMn jetzt auch nicht unbedingt so stark wie andere Ultis was die Utility angeht. Midlane Morg ist dann wieder was anderes, da ist ja alleine der W-Dmg insane, aber als Support ist sie ziemlich situationsabhängig.","replies":[{"poster":"Megamaexx","date":"2016-12-28T07:22:16.925+0000","up_votes":1,"down_votes":0,"body":"Hach ja, winrates^^ ich würde auch gern wieder auf die 80% kommen, die ich letzte Season zwischenzeitlich als Morgana hatte :D (hab mir die Stats am Ende noch versaut, weil ich sie danach noch Midlane gespielt hatte und ich kein guter Midlaner bin xD)","replies":[]},{"poster":"clair de lune289","date":"2016-12-27T23:56:04.304+0000","up_votes":1,"down_votes":0,"body":"bei mir ist es momentan umgekehrt letzte Season Janna diese Season Morg.\nGenerell spiel ich momentan eher das worauf ich lust habe (darunter auch das eine oder andere Annie/Sona Game) obwohl ich schneller und höher climben könnte,wenn ich mich auf 3 Champs fokussiere. (Morg/Janna/Nami)\n\nDa die Season eh grade erst angefangen hat und ich zur Zeit eh nur FlexQ,in der mir Gold für die Bonusbelohnung reicht, spiele geh ich das ganze recht locker an. (Nein d.h. nicht ich würde mir keine mühe geben,aber sturr nur die 3 besten Champs zu spielen muss nicht sein)","replies":[]}]},{"poster":"Jayce me RoIIing","date":"2016-12-27T21:46:21.752+0000","up_votes":2,"down_votes":0,"body":"Morgana wenn dein Team keinen Engage hat oder man sich gewisse Leute vom Leib halten muss :)\nKarma wenn man weiß das die gegnerische Bot schwächer ist zum einpushen.\nJanna wenn die gegnerische Bot stärker sit um deinen ADC zu beschützen.\n\nKarma ist generell sowie Morgana ein Pokechampion also aggresiv. Sollte das gegnerische Team also sowieso schon besser sein solltest du einen defensiven pick sowie Janna/Soraka nehmen :)","replies":[]},{"poster":"Supportsmanlike","date":"2016-12-27T22:45:43.473+0000","up_votes":2,"down_votes":1,"body":"Könnte jetzt einige Kommentare hier scharf kritisieren, aber ich glaube ich lass das jetzt einfach mal so im Raum stehen ;)\n\nAber als First Pick würde ich dir nur Nami, Janna und Nautilus empfehlen. Evtl. noch Thresh.","replies":[{"poster":"Megamaexx","date":"2016-12-27T22:55:02.352+0000","up_votes":1,"down_votes":0,"body":"Kritisiere ruhig, vielleicht hilft mir das weiter ^-^","replies":[{"poster":"Supportsmanlike","date":"2016-12-27T22:56:19.531+0000","up_votes":1,"down_votes":1,"body":"Neeeeeeee, nich jetzt, dauert zu lange :3","replies":[{"poster":"clair de lune289","date":"2016-12-27T23:04:21.479+0000","up_votes":1,"down_votes":1,"body":"Ich wette du hast was gegen Sona^^\nWas im Thread natürlich auffällt ist,dass Tanks kaum erwähnt werden außer von dir.\nTanks wie Ali/Naut/Leo sind natürlich noch immer gute Support,aber Tanks machen mir im Moment einfach keinen Spaß also ignoriere ich gekonnt ihre Existenz. XD","replies":[{"poster":"ELOW Cronos","date":"2016-12-28T07:27:39.337+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=Wj1wcocU,discussion-id=BN9iwZHY,comment-id=0003000000000000,timestamp=2016-12-27T23:04:21.479+0000)\n>\n> ...,aber Tanks machen mir im Moment einfach keinen Spaß also ignoriere ich gekonnt ihre Existenz. XD\n\nThresh macht immer Spass, wenn man ihn spielen kann :3.","replies":[]},{"poster":"Supportsmanlike","date":"2016-12-27T23:19:57.805+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=Wj1wcocU,discussion-id=BN9iwZHY,comment-id=0003000000000000,timestamp=2016-12-27T23:04:21.479+0000)\n>\n> Ich wette du hast was gegen Sona^^\n\nRichtig, Sona ist einfach ein instant lose, wenn du nicht richtig gut mit ihr bist. Wenn ich gegen eine Sona spiele abuse ich das so unnormal hart, dass es mir manchmal schon leid tut. Im early game hält sie halt gefühlte 2 Autoattacks aus.\n\n> Was im Thread natürlich auffällt ist,dass Tanks kaum erwähnt werden außer von dir.\n\nUnd Tank Supports sind zurzeit einfach schlecht, weil {{item:3107}} . Picke nur Tanks als Counter.","replies":[{"poster":"clair de lune289","date":"2016-12-27T23:40:37.160+0000","up_votes":1,"down_votes":1,"body":"Sona ist ganz gut in low elo und um die basics zu lernen,da sich mechanisch nicht wirklich schwer ist.\nWer sich aber wirklich climben will und das auf der Supportposi sollte eher Nami anstatt Sona spielen.\nSie spielt sich zumindest ein bischen so wie Sona hat aber viel mehr potenzial und das bei einer wesentlich stärkeren Laningphase.\n\nDie Supporttanks sind schwächer als letzte Season,aber als schlecht würde ich sie nicht bezeichnen.Als firstpick für Supporttanks kämen für mich zur zeit nur Thresh/Naut/Ali in Frage.\nDazu kommt dann noch das momentan manche Jungler/Toplanetanks einfach im Vergleich unglaublich Stark sind.(Hallo {{champion:154}} {{champion:57}} )","replies":[{"poster":"OrangeBubble","date":"2016-12-27T23:56:29.558+0000","up_votes":1,"down_votes":0,"body":"Sona und Nami sind komplett unterschiedlich vom Kit her. \nAußerdem kann man mit Sona durchaus climben, wenn man sie denn richtig spielen kann. \nEigentlich kann man mit jedem Champ climben, es ist vollkommen Wurst, welchen du nimmst, aber nun gut, die Community ist da eigentlich eher einseitig, so wie eh und je.","replies":[{"poster":"clair de lune289","date":"2016-12-28T00:02:02.513+0000","up_votes":1,"down_votes":0,"body":"mMn sind sich Nami und Sona sehr ähnlich, ganz einfach weil beide heal+poke+slow auf den Grundfähigkeiten haben( ja Nami hat da auch einen hard CC aber das ist nur der Bonus) und ihre Ulti linear und mit CC für engage oder disenage ist.\n\nes steht dir vollkommen frei da anderer Meinung zu sein,aber für \"fühlen\" sich diese Champs ähnlich an wenn ich sie spiele","replies":[]}]}]}]}]}]}]}]},{"poster":"Die Kaki","date":"2016-12-27T22:25:35.301+0000","up_votes":2,"down_votes":1,"body":"Du darfst Zyra nicht vergessen =). Die Champs sind nur so gut, wie der Spieler, der sie spielt und das build das man baut bzw. was man in deer situation zu bauen versucht. Morgana hält Thresh, Blitzcrank, Leona etc. davon ab überhaupt mit ihren hooks oder stunts zu treffen bzw den jeweiligen effekt auszulösen. Desweiteren hat Morgana ein sehr gute skalierung der Fähigkeitenstärke in ihren spells. Janna ist gut um einen starken bzw long range ADC das gewisse etwas zu verleihen und Ihn vor jeden schaden zu schützen (falls dieser nicht größer als der schaden ist).Karma hat Mehr power als beide zusammen 1. ihre ult ist sofort einsatzbereit und macht wenn man trifft sehr viel schaden und erzeugt den gewissen druck auf die gegner.\n\nMorgana: Immer spielbar und kann notfalls als APC fungieren und somit vielleicht als 2 oder 3 carry im Team aushelfen.\nJanna: Situations bedingt einsetzbar und man muss wissen wie man mit ihr spielt und gegen wenn.\nKarma:Immer Spielbar, wegen dem hohen druck den sie auf die gegner ausübt und kann notfalls auch als APC fungieren.\n\nZum schluss muss ich sagen bzw. ergänzen das Zyra mit unter den Magiern (keine Mage Assassins) zu den wahrscheinlich TOP FÜNF! magier zählt, die sehr schaden in kurzer zeit rausdrücken und den gegner davon abhalten kann das dein ADC verfolgt wird. OH! und lux darfst du auch nicht vergessen.","replies":[]},{"poster":"Supportsmanlike","date":"2016-12-28T00:03:21.334+0000","up_votes":1,"down_votes":0,"body":"Finde Sona im Low Elo Bereich richtig lame, ihre größte stärke im Late ist ihre E und mit der kann in Bronze-Gold niemand was anfangen. Mit ihrer Q gibst du noch den Onhit, hat aber keinen wirklichen Impact mehr und ihre W bringt dir nur was wenn die Gegner viel AoE aber wenig Dmg haben... Die Ult ist ganz nett, der Stun ist aber kurz und nur für die gegnerische Backline wirklich gefährlich. Die wirst du damit aber für gewöhnlich nicht treffen.","replies":[{"poster":"clair de lune289","date":"2016-12-28T12:01:49.809+0000","up_votes":1,"down_votes":0,"body":"grade in low elo ist es recht einfach die backline mit Sonas ulti zu treffen zumindest empfand ich das immer so wenn ich \"low\" elo war.","replies":[]}]}]}