{"poster":"Prince Pinkus ","date":"2016-08-17T03:56:33.680+0000","title":"Constant Freezing or Complete utter Computer freeze!!!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I been playing recently and i noticed that one day, my entire computer freezes when i enter a league game. It doesn't matter if i am starting a game or in the middle of a game it just craps itself when i play LOL. I have played league on my computer for a very long time and i haven't had this problem before, today alone i froze three times when in dynamic queue (thank god for /remake) when it freezes i can't alt tab or cntrl alt delete, i have to simply restart. Also the screen turns completely black when i unplug my second screen and the place where i froze shows up when i plug it back in. I did update my computer earlier that day but im pretty sure that isn't the problem. Please help.\r\n                                                          {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Porocles","date":"2016-08-19T22:00:03.486+0000","up_votes":1,"down_votes":0,"body":"Aviatinq is on the right track with his information.  A recent windows update has been causing issues for some players and causing them to freeze.  It seems that something with the [Xbox Game Bar ](http://www.tenforums.com/tutorials/8637-game-bar-turn-off-windows-10-a.html)is causing this issue, so disabling it would be a great first step.  That should get you fixed up, but if it doesn't let me know and with more details like errors and what you're seeing.","replies":[]},{"poster":"Prince Pinkus ","date":"2016-08-18T17:38:29.628+0000","up_votes":1,"down_votes":0,"body":"Update: i played on two different computers, one on windows 8 and one on the latest windows update, i completely reset my computer that had windows 10 and it still freezes the last five or six games of my were because of this, fix your game riot . Both of them freeze by the way.\n\n{{sticker:zombie-nunu-bummed}} ","replies":[]},{"poster":"Aviatinq","date":"2016-08-18T01:15:42.752+0000","up_votes":1,"down_votes":0,"body":"I saw a post a little bit ago where someone said the new windows 10 update made them start freezing because it automatically turned something on. There's also a widely known and used script program that's causing games to freeze ;p","replies":[]}]}