{"poster":"Illâoi Evê Siôn","date":"2018-01-02T17:47:21.262+0000","title":"Rubick Guy will prob hate me for this suggestion: What if Sona's buffs worked like Fiora's Ult?","subforum":"Gameplay","up_votes":122,"down_votes":11,"body":"Inspired by [this](https://boards.na.leagueoflegends.com/en/c/memes/uoBsBA2o-when-you-try-to-be-positive-in-gameplay?comment=0001) comment about Sona and positioning. \n\nSo Sona would passively have her aura circle around herself with 4 fields like Fiora&#039;s ult. When she uses an ability she colors the aura blue/green/purple and the nearest guy on that quarter gets a buff. The quarter disappears. _Only procs on active or when &#039;touching&#039; them with the **outer edge**_. So if two people are on one field and Sona has no Mana any more, she has to distance herself, walk around her ally and walk back to proc another field.  If Sona procs all four fields she gets Super Saiyan stuff, like her current passive on steroids or something. Fields reset one by one eventually (or all at once) so she has to keep up the beat(ing) to get the spiky hair. \n\nUhm ... gives her a really high skill cap, maybe? She would keep the current &quot;last spell gives bonus effects&quot; effect probably, after all. Might make Riot like her since she&#039;s flashier so they stop nerfing her immediately  every time she&#039;s as good as any other Enchanter.\n\nEdit: Could also be three fields because three basic abilities, positioning your active in a quarter pie might be too hard, and so it looks visually different from Fiora's ult.  \n\nEdit: Could also be five fields since you can bump people. Or three to five fields increasing with level? Eh.","replies":[{"poster":"Eternal Torment","date":"2018-01-02T20:39:08.068+0000","up_votes":25,"down_votes":0,"body":"So, basically a reverse urgot? Instead of going circles around enemies to damage them, she goes circles around her team to buff it?\n\nthats....actually a pretty solid idea.","replies":[]},{"poster":"Bootleg Gay","date":"2018-01-02T18:58:28.925+0000","up_votes":22,"down_votes":1,"body":"Holy fuck this is actually a really good design. I'm bumping the hell out of this! Would need further tweaks to compensate for reward and positioning, but the concept of there.","replies":[{"poster":"Zero Skill Tank","date":"2018-01-02T23:27:29.924+0000","up_votes":10,"down_votes":1,"body":"Is it, tho? It sounds like it would give her really high skillcap, but not too much counterplay at all (since she needs to touch allies, who won't avoid her).\n\nSo she would be garbage in low elos, and cancer in competitive.","replies":[{"poster":"Cavesloth","date":"2018-01-03T04:05:59.690+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=IDidNotTouchHer,realm=EUNE,application-id=3ErqAdtq,discussion-id=dAANi2iu,comment-id=00000000,timestamp=2018-01-02T23:27:29.924+0000)\n>\n> Is it, tho? It sounds like it would give her really high skillcap, but not too much counterplay at all (since she needs to touch allies, who won&#x27;t avoid her).\n> \n> So she would be garbage in low elos, and cancer in competitive.\n\nI agree. In anything but competitive it would make her feel like garbage. Relying on allies to do things is feels terrible, look at the Sej rework. She has to rely on her teammates to proc her highest damage ability, its like a damn blue balls simulator. Plus when it works it'd still have the problem of feeling overbearing (again much like new Sej), because to balance it for all elos it's have to be balanced around only some of them being proc'd and teams that could proc it all would feel like pure cancer, it wouldn't solve the issue of facing her feeling overbearing.\n\nJust because the idea is creative and out of the box  (and I'll give you that, its definitely both of those) doesn't mean its good in practice. I like where your head is at though, at least you are trying.","replies":[]},{"poster":"Remlap1223","date":"2018-01-03T01:17:00.494+0000","up_votes":4,"down_votes":1,"body":"The whole problem with Sona is that all of her skill expression gets thrown out the window late game.  It's the Master Yi problem, hence why she is impossible to balance.\n\nDoing this would give her actual windows of power, and allow her to be super stronk in the right circumstances.","replies":[]}]}]},{"poster":"zero356","date":"2018-01-02T20:31:02.190+0000","up_votes":5,"down_votes":1,"body":"So like Fiora Ult Proc marks but on your allies that you proc with your abilities to give them boosts?","replies":[{"poster":"Illâoi Evê Siôn","date":"2018-01-02T20:34:26.718+0000","up_votes":8,"down_votes":1,"body":"Yep. If you miss the active you can ram them with the field to buff them, too. If you proc all fields you get something nice.\n\nMario Cart Sona Skin ensued.","replies":[{"poster":"zero356","date":"2018-01-02T20:41:24.569+0000","up_votes":15,"down_votes":0,"body":"General Reaction\nhttps://78.media.tumblr.com/7f1e2f57571cd84e4d76517489713733/tumblr_nndp87CJZb1tp42tfo1_500.gif\n\n\n_EUROBEAT INTESIFIES_\n_MUTLI-LANE DRIFTING_\n_~~DEJA VU~~_","replies":[]}]}]},{"poster":"Swarovsko","date":"2018-01-02T20:49:04.873+0000","up_votes":9,"down_votes":0,"body":"AS AN EX SONA MAIN HOLYYYYYYYYYYYY I'M LIVING FOR THIS!!! THIS IS WHAT I MEAN WHEN I SAY THAT SONA HAS A LOT OF WASTEd POTENTIAL\n When Meddler comes back I'm gonna spam the SHIT out of his quick gameplay thoughts linking this thread until he sees this. Btw gj you're very creative I LOVE the idea.","replies":[]},{"poster":"kile147","date":"2018-01-02T22:14:47.770+0000","up_votes":8,"down_votes":0,"body":"Love this idea, only issue I see is that it would actually fit a dancing themed champion better and they may want to save it for a new support.","replies":[]},{"poster":"MFG Colour","date":"2018-01-03T04:54:39.903+0000","up_votes":6,"down_votes":0,"body":"Paraphrasing Riot on why they reworked Karma \"your team would have to know how your kit works for you to be effective\". This seems like it would rely more on your team not taking the wrong one or not walking into a position that hurts Sona","replies":[{"poster":"Z3Sleeper","date":"2018-01-05T00:39:09.060+0000","up_votes":1,"down_votes":0,"body":"It seems pretty clear to me. You step on the DDR pad and you get a buff. It's not a matter of misunderstanding kit but moreso just one of misunderstanding Sona's intentions.\n\nIt's not like old Karma who would tether an ally so they could proc the slow and damage on allies but they never do cuz they have no clue that it even does that. Most people just thought it was a speed boost.","replies":[]}]},{"poster":"kda akali","date":"2018-01-02T21:32:51.623+0000","up_votes":5,"down_votes":0,"body":"This could work so well with her theme of music too. If it had 4 zones there could be a song playing with beat of 4/4 with each zone proc moving the song to a higher BPM. \n\nThis might only work on DJ Sona though since it needs to keep it's theme of having music play for the whole team.","replies":[]},{"poster":"Glory to God","date":"2018-01-02T22:40:19.234+0000","up_votes":6,"down_votes":1,"body":"This is nice. Should see happening.","replies":[]},{"poster":"TeCoolMage","date":"2018-01-03T06:40:46.790+0000","up_votes":4,"down_votes":0,"body":"But sons was a musician, not a dancer, it should root sona so she can focus on playing while players go around collecting her buffs obviously :^)","replies":[]},{"poster":"Athenes Lulu","date":"2018-01-03T01:17:03.610+0000","up_votes":4,"down_votes":0,"body":"And her Arcade skin can make you feel like you're playing DDR.\n\nOr not really, but make it show DDR arrows or something, 'cuz that would be so cool.","replies":[]},{"poster":"Automated Riven","date":"2018-01-03T15:50:11.199+0000","up_votes":3,"down_votes":0,"body":"The only issue I have with this is that it would likely be significantly stronger in higher elo due to their being able to play around it and bad in low elo where people don't think.","replies":[{"poster":"Illâoi Evê Siôn","date":"2018-01-03T16:10:27.868+0000","up_votes":2,"down_votes":0,"body":"I actually don't think the divide would be _that_ great. It will exist, of course, but imagine Sona has four fields that she needs to proc and she has three low-cooldown basic abilities to proc them with.\n\n She can proc all four at once if her allies position themselves perfectly around her, of course, but getting all four in the mid to late game teamfights should be easy even without their cooperation. If she doesn't hit the active, she can still chase and boop them, especially with her E. That way, she'll only really have to really reposition herself for the last two fields, probably.\n\nYou can further balance it by tuning the fields' and reward's cooldown (so landing all four quickly is only ever relavent in clutch situations) and other aids (e.g. an E passive that gives her ms each time she procs one).","replies":[]}]},{"poster":"Remlap1223","date":"2018-01-03T01:13:59.084+0000","up_votes":3,"down_votes":0,"body":"WHAT?  How the hell have I never thought of this?  This is fookin genius!","replies":[]},{"poster":"big boi edri","date":"2018-01-03T00:14:38.443+0000","up_votes":3,"down_votes":0,"body":"This is actually a really cool idea, I would love to see it tested out.\n\nMaybe this would apply for this thread? \nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/aG96Psz9-featureqol-changeidea-generator-for-2018-and-beyond","replies":[]},{"poster":"The Yetii Rider","date":"2018-01-03T00:52:45.991+0000","up_votes":2,"down_votes":13,"body":"Sona is supposed to be a simple champion for bad players to learn support on. I don't care if she's trash at high elo or gets nerfed constantly, don't make her harder to play.","replies":[{"poster":"ampheon","date":"2018-01-03T01:43:27.234+0000","up_votes":6,"down_votes":0,"body":"We'll still have {{champion:16}}","replies":[{"poster":"PokladnicaZla","date":"2018-01-03T17:01:25.739+0000","up_votes":2,"down_votes":0,"body":"I love my celestial unicorn mommy <3","replies":[]},{"poster":"sobi999","date":"2018-01-03T16:18:12.974+0000","up_votes":2,"down_votes":0,"body":"not really, 90% of soraka's i see are dying constantly because they do not realise that their heals cost max health. WIth no stun/knockup and a very situational snare and slow, she is an easy target for most enemies. I personally think sona is easier than soraka to play with.","replies":[{"poster":"PokladnicaZla","date":"2018-01-03T17:01:02.531+0000","up_votes":2,"down_votes":0,"body":"Soraka is easy to play,but like all champions there's a difference when she played by someone from time to time and someone who actually knows how her kit functions.","replies":[]}]}]},{"poster":"Rendrex","date":"2018-01-03T01:13:59.486+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=dAANi2iu,comment-id=000c,timestamp=2018-01-03T00:52:45.991+0000)\n>\n> Sona is supposed to be a simple champion for bad players to learn support on. I don&#x27;t care if she&#x27;s trash at high elo or gets nerfed constantly, don&#x27;t make her harder to play.\n\nNegative, Even Garen takes more thought than her.","replies":[]}]},{"poster":"JarodDempsey","date":"2018-01-04T07:49:32.831+0000","up_votes":1,"down_votes":0,"body":"idk why people like this idea, it needlessly over complicates a currently fine mechanic while making it less reliable and more dangerous","replies":[{"poster":"Ahristocats","date":"2018-01-05T00:41:06.506+0000","up_votes":2,"down_votes":0,"body":"that's why i didn't comment it\n\ndoesn't fixe her counterplay\nmakes her mechanically intense for no reasons\n\nbut people liked it, so i didn't bother","replies":[]}]},{"poster":"Carnicore","date":"2018-01-03T17:49:43.738+0000","up_votes":2,"down_votes":0,"body":"How about if her spells all worked like [this](https://imgur.com/a/LpRSc), firing in 2 directions and changing with every spellcast?","replies":[]},{"poster":"General Esdeath ","date":"2018-01-02T21:36:15.909+0000","up_votes":2,"down_votes":0,"body":"speedstar Sona incoming :^)","replies":[]},{"poster":"Très Pauvre","date":"2018-01-02T20:49:27.493+0000","up_votes":2,"down_votes":0,"body":"I really like it and it adds a lot of team play potential because with this its not just sona who has to position correctly her team also have to help her out.  The team could even coordinate and activate \"Super Sona\" at an opportune moment to provide a team heal/shield (green) speed/as buff (purple) wombo combo damage team damage buff (blue).","replies":[]},{"poster":"Tomoe Gozen","date":"2018-01-03T12:27:19.977+0000","up_votes":3,"down_votes":2,"body":"Ah, this wouldn't work as there's no incentive for Sona to move around and orbit the entire team for this to happen. It makes sense for Fiora and Urgot to do as Riot didn't want to give them flat out broken damage but make them work for it (for their strengths) while Sona, being rather squishy and falling squarely into the support category, has nothing going on for her in order to benefit from this type of gameplay.\n\nIf this was the case, the same deal would have to apply to her - from Fiora's and Urgot's gameplay. If it was this tedious to keep her auras up, her auras would then need to provide a real hard benefit for a teammate. It simply has to pay off for how hard she'd have to work in order to keep it up. But that would mean teamfights would go horribly for Sona players who don't know how to do this while in lane, she'd still be a travesty and a lane bully, as she wouldn't even need to play her minigame to buff one or two allies (Marksman, a jungler and perhaps a ganking mid/top laner.)","replies":[]},{"poster":"Plastic 5 ADC","date":"2018-01-03T02:12:35.474+0000","up_votes":3,"down_votes":2,"body":"I agree on that Sona needs a new design on her kit.\n\nShe's beyond boring and obnoxious to play with and against, and way too simple to play.","replies":[]},{"poster":"The steam life","date":"2018-01-02T20:54:20.004+0000","up_votes":2,"down_votes":1,"body":"It’s a good idea but why do you have to act like they always nerf her when she’s good. She was good for months and left untouched.","replies":[]},{"poster":"CPU Lyrica","date":"2018-01-04T04:42:13.911+0000","up_votes":1,"down_votes":0,"body":"See, i like this. but it'd need to be rotatable, to compensate for \"aiming down\" when playing from redside.","replies":[]},{"poster":"Velasan","date":"2018-01-03T23:06:56.809+0000","up_votes":1,"down_votes":0,"body":"So, it's an interesting idea... but is sona as a champion really designed to have skill expression?\n\nAuras by nature are most effective by being able to just pop them off near your team mates. \n\nWhat if for Relic Shield it would only give you the proc or shield if your team mate was standing right next to you?  What if Soraka could only heal people if she healed from one side of her ally?\n\nIf you want to make Sona more interesting via the way she uses her skills the place to do that would be the power chords.  How and when you use those or adding more diversity to them is what makes a good Sona.  Particularly the green power chord, which used at the right time makes a lot of difference.\n\nThe auras need to work as auras normally do, otherwise your jumping around in circles trying to get them to work while your team gets mowed down.  It adds needless  complexity, much like Skarner spires.","replies":[]},{"poster":"HalcyonDweller","date":"2018-01-03T22:37:06.980+0000","up_votes":1,"down_votes":0,"body":"This idea kicks ass, I hope Riot notices it! +1","replies":[]},{"poster":"Mokuto Bunshi","date":"2018-01-03T21:08:57.622+0000","up_votes":1,"down_votes":0,"body":"Yeah, this is the best idea ive read on the forums in a good long time. Someone get riot Meddeler in here.","replies":[]},{"poster":"PokladnicaZla","date":"2018-01-03T16:58:49.379+0000","up_votes":1,"down_votes":0,"body":"This is an interesting idea,but it seems the only way to mess up or have counterplay would be for Sona to mess up. You wouldn't have much agency to to punish her,but would have to wait for her and her allies to make a mistake.\nShe would end up garbage in lower ELOs , strong in mid-high ELO and would dominate Competitive and organised play.","replies":[]},{"poster":"MCNT052","date":"2018-01-03T11:44:15.423+0000","up_votes":1,"down_votes":0,"body":"I don't know, but I want her ult to play music for an amount of time like 5-10 seconds or something, during that time, all teammates gain movement speed, attack speed, 5% cd, and maybe a shorter cc time casted on allies (so 2 second stun on your Kalista from a Morgana goes for something like 1.8 seconds instead)\n\nI wouldn't know fair details, but I think that would be an interesting ult.\n\nYou know how when you listen to music, people get more energetic (most the time)\nLike someone can do more reps\nrun for longer\nstuff like that","replies":[]},{"poster":"Attticus Finch","date":"2018-01-03T06:53:24.952+0000","up_votes":1,"down_votes":0,"body":"Edit","replies":[]},{"poster":"WrÆth","date":"2018-01-02T22:10:16.389+0000","up_votes":1,"down_votes":0,"body":"RNG tho","replies":[]},{"poster":"Irokaiser","date":"2018-01-04T00:09:30.774+0000","up_votes":1,"down_votes":1,"body":"made it an even hundred upvotes","replies":[]}]}