{"poster":"Krathos8","date":"2015-11-24T21:25:14.925+0000","title":"Bug pantalla de carga","subforum":"Problemas Técnicos","up_votes":4,"down_votes":0,"body":"Desde la version 5.22 me esta ocurriendo el bug en la pantalla de carga, todos los recuadros aparecen en negro y no se ven los SplashArts ni el marco de division. Lo unico que se ve es el simbolo de maestria de campeon, en caso de tenerlo, claro. Me gustaria que me propusieran ideas de como solucionar este problema, el cual no afecta el juego, pero me gustaria poder ver mi marco de division y los splasharts de mis skins y personajes, desde ya muchas gracias.","replies":[{"poster":"Unmasked Shaco","date":"2015-11-25T03:21:53.937+0000","up_votes":1,"down_votes":1,"body":"Me pasa exactamente lo mismo, y quiero una respuesta, realmente es feo que pase esto, leí que varias personas probaron reparando el lol o volviéndolo a instalar pero no da resultado, yo mandé un msj al soporte de Riot hace una semana masomenos, pero no me dieron una respuesta certera, me dijeron que lo iban a tener en cuenta y queseyo, mañana voy a mandar otro mensaje, es horrible no poder ver los marcos nuevos, ni las skins y eso","replies":[{"poster":"Krathos8","date":"2015-11-25T03:42:05.744+0000","up_votes":2,"down_votes":0,"body":"Sinceramente merecemos una solucion, porque tanto vos como yo, pagamos nuestras skins y tenemos todo el derecho de ver los SplashArts cuantas veces querramos, aunque no nos influya en nuestro juego, entendes?","replies":[{"poster":"Unmasked Shaco","date":"2015-11-25T12:50:05.021+0000","up_votes":1,"down_votes":0,"body":"Exacto, tanto que hacen propaganda con la skins, las ofertas, los reworks y eso, todos queremos verlos, y estar felices con el juego, no puede ser que hayan pasado más de dos semanas y que no haya solución, tampoco encuentro alguna explicación lógica para esto que nos pasa, porque no les pasa a todos, pero realmente es una vergüenza que no puedan encontrar una solución, ni que fuese algo tan complicado de solucionar, hay que seguir insistiendo al soporte hasta tener una respuesta, no es algo que querramos, es una necesidad básica en el juego la posibilidad de ver los splash arts y demás!","replies":[{"poster":"Krathos8","date":"2015-11-26T09:59:24.850+0000","up_votes":1,"down_votes":0,"body":"Te mande solicitud en lol amigo, yo siempre que entro a partidas suelo preguntar si a alguien le sucede y se rien de mi, me dice desinstala e instala jajajaj pero bueno esperare a ver si Rito se pone las pilas y en el proximo parche lo soluciona","replies":[{"poster":"Unmasked Shaco","date":"2015-11-26T13:04:51.375+0000","up_votes":1,"down_votes":0,"body":"Buenísimo, con mucho gusto te voy a aceptar ^^ si, esperemos que en algún momento lo solucionen","replies":[]}]}]}]}]},{"poster":"juan4994","date":"2015-12-04T15:52:48.157+0000","up_votes":1,"down_votes":0,"body":"a alguien se le arreglo ya?","replies":[]},{"poster":"juan4994","date":"2015-11-25T17:30:55.056+0000","up_votes":1,"down_votes":1,"body":"a mi me pasa exactamente lo mismo estoy hace dias intentando solucionarlo\nalta mierda","replies":[]}]}