{"poster":"Hych","date":"2017-03-05T18:58:07.733+0000","title":"Suche Ranked Team Main ADC Hoches silber/Gold","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo liebe Legaue of Legends Gemeinde mein Name ist Chris, ich suche ein Ranked team daher das ich es vermisse mit coolen dudes league zu zocken.\r\n\r\nZu mir : Ich bin 18 jahre alt und main rolle ADC, ich spiele schon seit season 3 Legaue. Bin zuverl&auml;ssig und spiele dieses Game mit Leidenschaft.\r\n\r\nIch habe schon in mehreren Teams gespielt und bringe auch erfahrung mit was das angeht, selbst hatte ich auch ein team was ich pers&ouml;nlich geleitet habe und traniert habe. Ich w&uuml;rde mich freuen wieder an tuniere zu spielen oder einfach ne runde flex q um sich zu verbessern.\r\nWas ich mit bringe ist erfahrung, spiel verst&auml;ndnis zuverl&auml;ssigkeit whats app ist auch vorhanden und ts habe ich auch.\r\n\r\nIch hoffe das euch meine beschreibung Gef&auml;llt und mir antworte, ihr k&ouml;nnt mich gerne auch in Legaue of Legends adden damit habe ich ken problem.\r\n\r\nMit freundlichen Gr&uuml;&szlig;en Chris","replies":[{"poster":"fess123","date":"2017-03-06T07:50:57.308+0000","up_votes":1,"down_votes":0,"body":"Hi ShootingPhantom,\n\ndu hast es satt alleine in der Flex Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/EB1PsvTk-aequilibritas-esports-sucht-rekruten-community-esports-organisation)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]}]}