{"poster":"MasterKeaton98","date":"2015-12-27T13:06:49.210+0000","title":"Zed non è morto.","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Semplicemente mentre si trastullava con {{champion:143}} gli &egrave; caduta un po&#039; di clorofilla sull elmo e ora sta nascendo un figlio.\r\n\r\nDai su e basta co ste morti.","replies":[{"poster":"ViaMalinconiaN9","date":"2015-12-27T13:14:38.635+0000","up_votes":1,"down_votes":1,"body":"Io credo sia un buff/potenziamento/miglioramenti ai campioni: Garen, Sona, Vi, e Zed. Boh.","replies":[{"poster":"miobabbo","date":"2015-12-28T08:05:30.747+0000","up_votes":1,"down_votes":0,"body":"si dai buffiamo gareeeeen. fa schifo adesso.","replies":[]},{"poster":"Unfaaaaair","date":"2015-12-27T13:19:40.042+0000","up_votes":1,"down_votes":0,"body":"Impossibile, nessuno di quei campioni necessita buff...\nLo vedo più come un probabile teaser di un evento","replies":[{"poster":"ViaMalinconiaN9","date":"2015-12-27T13:28:12.881+0000","up_votes":1,"down_votes":1,"body":"No buff, ma miglioramenti si.\nSi è già parlato più e più volte che hanno dei progetti per Sona.\nGaren è ancora un campione noioso, orami caduto in fallimento.\nVi è un mio main jungle, ed è anche forte, ma non la vedo mai usata da nessuno (Anch'io, me la dimentico proprio)\nZed non lo so. \n___\nMa tranquillo è solo una stupida teoria, ce ne sono di più probabili:\n-Un probabile new Champion;\n-Rework di Shen;\n-New skin;\n-L'inizio delle icone animate;\n-Un evento (impossibile solo di Ionia, visto che Garen e Sona fanno parte i Demacia e Vi di Piltover (Coincienze che sono i 3 stati dalla parte del bene e che più o meno sono alleati?);\n-Jhin new champion - DeadEye ultimate (trasforma i nemici in albero OMFG);\n-Zed x Syndra (my best day of always) <3;\n-E tante altre\n\nLa più probabile rimane quella del nuovo champion, in cui nelle ultime righe del post di surrender@20 c'è scritto che è probabile un nuovo campione, ed è probabile che vedremmo anche Vi, Garen e Sona abbattuti come Zed (Abbatutti, come un albero xD)\n\nChissà forse è una creazione \"anche viva\" non robotica (Blitz/Zac) di piltover, e lo stanno provando in varie Fazioni nemiche; Ionia, emacia, Piltover.\n","replies":[{"poster":"miobabbo","date":"2015-12-28T08:05:00.345+0000","up_votes":1,"down_votes":0,"body":"io credo sia proprio il rework di shen. l'hanno detto che sarebbe stato il prossimo e che era gia pronto per uscire; magari potrebbero ritoccare anche qualcos'altro ma credo sia quello. anche se l'opzione jhin non va del tutto esclusa.","replies":[]}]}]}]},{"poster":"ubercodlegend200","date":"2015-12-27T21:50:47.503+0000","up_votes":1,"down_votes":0,"body":"Oh tessvoro zed non è morto è solo andato a farsi una crociera intorno al mondo","replies":[]},{"poster":"Zedant","date":"2015-12-27T18:58:16.872+0000","up_votes":1,"down_votes":0,"body":"Come jho pensato io","replies":[]}]}