{"poster":"MasterKeaton98","date":"2015-09-23T16:22:31.463+0000","title":"[Off topic] Per i fan di The Walking Dead","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ho iniziato e finito la prima stagione ieri, mentre oggi ho iniziato la seconda.\r\n\r\nMi hanno detto che una delle 5 stagioni f&agrave; schifo.\r\n\r\nQuale? Cos&igrave; mi preparo prima.\r\n\r\n\r\nUn&#039;altra domanda:\r\n\r\nQuanti stupri ci sono in una puntata di Game Of Thrones? Perch&egrave; volevo iniziarlo ma se devo guardare 20 minuti di persone che chiavano e 20 minuti di tizi che vengono decapitati allora passo.","replies":[{"poster":"Nibbio Bianco","date":"2015-09-23T16:44:19.299+0000","up_votes":2,"down_votes":0,"body":"Quella che a te fa più schifo è la più schifosa. Se agli altri non piace non significa che a te non debba piacere. Ad esempio io non bevo il caffè perché l'odore del caffè mi dà il voltastomaco, chissenefrega se tutti lo bevono, io bevo il chinotto. FUCK D SISTEM and FUCK D DOTA","replies":[{"poster":"A Yordle ln Heat","date":"2015-09-23T17:08:46.202+0000","up_votes":2,"down_votes":0,"body":"Ironicamente, il caffè per me è la fottutissima ambrosia e mi serve per vivere.","replies":[{"poster":"Nibbio Bianco","date":"2015-09-23T17:14:48.654+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=CommonDotaPlayer,realm=EUW,application-id=MJVj50Jw,discussion-id=746gs6lh,comment-id=00020000,timestamp=2015-09-23T17:08:46.202+0000)\n>\n> Ironicamente, il caffè per me è la fottutissima ambrosia e mi serve per vivere.\n\nIn realtà non ti serve il caffè. Basta non morire per vivere.","replies":[{"poster":"MasterKeaton98","date":"2015-09-23T17:22:54.721+0000","up_votes":2,"down_votes":0,"body":"Signori Per favore calmi.\n\n\nCaffèllatte FTW.","replies":[{"poster":"Nibbio Bianco","date":"2015-09-23T17:25:58.780+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MasterKeaton98,realm=EUW,application-id=MJVj50Jw,discussion-id=746gs6lh,comment-id=0002000000000000,timestamp=2015-09-23T17:22:54.721+0000)\n>\n> Signori Per favore calmi.\n> \n> \n> Caffèllatte FTW.\n\nUna volta sono andato a Napoli, e per aver rifiutato il caffèlatte mi hanno trattato malissimo. FeelsBadMan.","replies":[{"poster":"ViaMalinconiaN9","date":"2015-09-23T19:06:48.322+0000","up_votes":1,"down_votes":0,"body":"Bene ù.ù\nTe lo meriti.","replies":[]}]}]},{"poster":"Sorcio84","date":"2015-09-23T18:38:24.939+0000","up_votes":1,"down_votes":0,"body":"non è che morire risolva qualcosa eh\n\n{{champion:6}} {{champion:14}} {{champion:82}} {{champion:30}} {{champion:429}} {{champion:83}} forse  {{champion:111}} \n\n\n...ma quanti zomboidi ha sto gioco ?","replies":[]}]}]}]},{"poster":"ztJackieChan","date":"2015-09-23T16:50:20.386+0000","up_votes":1,"down_votes":0,"body":"Può piacere e non piacere, the Walking Dead non è una serie che ti fa addormentare sul divano, questo è poco ma sicuro.\n\nGame of Thrones, invece, EPICO. Ogni puntata ti tiene incollato allo schermo. La miglior serie degli ultimi 20 anni.","replies":[{"poster":"A Yordle ln Heat","date":"2015-09-23T17:09:29.702+0000","up_votes":2,"down_votes":1,"body":"Talmente tanto che io ho passato le prime tre puntate letteralmente a dormire.","replies":[{"poster":"ViaMalinconiaN9","date":"2015-09-23T19:08:39.910+0000","up_votes":1,"down_votes":0,"body":"Certo, perché StevenUniverse è migliore. xD\nComunque concordo con Riso all'insalata, ognuno ha i propri gusti.","replies":[]}]},{"poster":"Ziovi","date":"2015-09-24T08:58:33.585+0000","up_votes":1,"down_votes":0,"body":"già... e adesso stanno andando avanti rispetto ai libri, pure... dannato quel panzone di martin che fa aspettare i suoi lettori così tanto","replies":[]},{"poster":"Exploooooosion","date":"2015-09-24T08:55:08.675+0000","up_votes":1,"down_votes":0,"body":"La migliore degli ultimi 20anni no la migliore degli ultimi 5 si","replies":[]},{"poster":"DeathJehuty","date":"2015-09-23T20:19:41.067+0000","up_votes":1,"down_votes":0,"body":"Game of throns...ho provato 3 volte a guardare il primo episodio...3 volte mi sono appisolato XD","replies":[]},{"poster":"Nibbio Bianco","date":"2015-09-23T16:54:18.927+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ztJackieChan,realm=EUW,application-id=MJVj50Jw,discussion-id=746gs6lh,comment-id=0003,timestamp=2015-09-23T16:50:20.386+0000)\n>\n> Può piacere e non piacere, the Walking Dead non è una serie che ti fa addormentare sul divano, questo è poco ma sicuro.\n> \n> Game of Thrones, invece, EPICO. Ogni puntata ti tiene incollato allo schermo. La miglior serie degli ultimi 20 anni.\n\nIn ogni caso sono gusti discutibili.","replies":[]}]},{"poster":"NiraBlade","date":"2015-09-23T20:10:51.584+0000","up_votes":1,"down_votes":0,"body":"TwD lo conosco solo per il videogioco, per la serie tv non saprei dirti\nSu got te lo consiglio, trama bella e imprevedibile abbastanza fedele al libro. Secondo me le scene di sesso e di morte sono proporzionate e realistiche, alla fine è quello che succede anche nella vita vera. Ti consiglio però di vederti almeno 3 episodi prima di decidere se continuare, solitamente il primo episodio non ti fa appassionare molto alla serie perché ci capisci poco.","replies":[{"poster":"Lord Valotz","date":"2015-09-24T15:12:59.241+0000","up_votes":1,"down_votes":0,"body":"\"Fedele\" al libro come Cersei Lannister al marito. Solo le prime due seguono abbastanza, poi la serie per ovvi motivi semplifica e si inventa cose soprattutto nella quinta stagione, resta comunque una serie avvincente su questo concordo.\nIn conclusione aggiungerei un :\"Vinoooohhh!!!\"","replies":[{"poster":"NiraBlade","date":"2015-09-24T16:47:55.293+0000","up_votes":1,"down_votes":0,"body":"valotz guarda qua: **abbastanza** uWu avrei scritto per niente se non fosse per le prime 2","replies":[{"poster":"Lord Valotz","date":"2015-09-24T16:58:59.446+0000","up_votes":1,"down_votes":0,"body":"Abbiamo due misure di \"abbastanza\" differenti io appartengo alla categoria dei puristi che strillano :\"omg hanno cambiato la storia\" per quanto ritengo sia stata ben fatta anche la serie e che sia piacevole da vedere, tranne una cosa che evito di riportare causa spoiler che mi ha fatto storcere il naso. Comunque il termine adatto è  all'incirca {{champion:48}} .","replies":[{"poster":"NiraBlade","date":"2015-09-24T17:03:10.235+0000","up_votes":1,"down_votes":0,"body":"eh ma ormai va sempre a finire così, bisogna sempre prenderle come due storie a se stanti o non ne vieni fuori","replies":[{"poster":"Lord Valotz","date":"2015-09-24T17:14:16.817+0000","up_votes":1,"down_votes":0,"body":"Ma infatti sono rimasto soddisfatto di quasi tutto tranne che di una cosa, ti mando un messaggio subliminale con un nome : Stannis. Ecco quello no e poi no è  stata un'esagerazione.","replies":[{"poster":"NiraBlade","date":"2015-09-24T18:03:20.477+0000","up_votes":1,"down_votes":0,"body":"eh quel personaggio si, mi ha lasciato l'amaro in bocca anche a me :S completamente innaturale l'adattamento del film, sopratutto nella parte finale ._.","replies":[]}]}]}]}]}]}]},{"poster":"Hródrsvitnir","date":"2015-09-24T17:07:03.306+0000","up_votes":1,"down_votes":0,"body":"Ti parla un fan di TWD, che potrebbe spoilerarti il mondo sulla 6° stagione visto che seguo il fumetto, ma poi devo litigare con qualcuno e rischio il ban! {{champion:35}} \n\nEssendo seri, TWD è una serie molto carina e che attira solo se sei amante del genere.\nAll'inizio sarà molto \"ZOMBIEEE\", e vedrai solo gente intenta a scappare, poi con l'andare delle puntate e delle stagioni, ti accorgerai della vera essenza della serie (Se vuoi, puoi vederti lo spin-off iniziato ad Agosto, \"Fear the walking dead\" che è molto carino.), cioè le relazioni umane e le reazioni alla catastrofe.\nCome reagiscono i vari tipi di persone, come convivono.\nCi saranno puntate che saranno solo di raccordo, ed alcune che finirai col nodo in gola.\nInsomma è una serie da vedere, almeno le prime 3 stagioni, ripeto, se ti piace il genere, non riuscirai a staccarti!\n\nGOT, ho fatto la stronzata di valutarne la prima puntata e stop.\nForse è da rivedere..","replies":[]},{"poster":"Zorby","date":"2015-09-23T19:59:04.702+0000","up_votes":1,"down_votes":0,"body":"Io ho preferito la seconda stagione alla terza.\nQuella cosa del governatore è abbastanza meh.","replies":[{"poster":"Exploooooosion","date":"2015-09-24T08:56:52.414+0000","up_votes":1,"down_votes":0,"body":"Dall'inizio della terza alla fine della 5a i nemici non sono più gli zombi ma gli umani...","replies":[]}]},{"poster":"Exploooooosion","date":"2015-09-24T08:54:27.850+0000","up_votes":1,"down_votes":0,"body":"a me personalmente t.w.d. mi è calato dalla 4a stagione e la 5a mi ha fatto proprio pena (eccetto il finale), ora sta uscendo negli usa uno spin-off della serie chiamato fear the walking dead (che ti fa comprendere cos'è accaduto prima del risveglio dal come di rick) purtroppo i personaggi sono diversi ;( ma è molto bella quasi ai livelli delle prime 3 stagioni.\nThe game of thrones è forse la seri tv più bella mai uscita visto che non esiste un protagonista reale e quindi tutti possono morire e quindi succede sempre qualcosa di inaspettato e fuori dalle righe. \nCi sono si parecchie scene di nudo ed essendo una serie fantastica-medievale dove l'obbiettivo è conquistare il trono è normale che ci siano parecchie scene di decapitazione e di guerre ma ci sono anche combattimenti tra cavalieri, draghi e altre creature mitologiche.\nDetto ciò io te la consiglio","replies":[]},{"poster":"ztJackieChan","date":"2015-09-23T22:28:38.104+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=rIgnofweEoM\n\ngame of thrones, canzone parodia, qualcuno di voi la conosceva ? :D\nmettete un UP se vi piace. :D","replies":[]},{"poster":"SideshowEMS","date":"2015-09-23T21:09:34.791+0000","up_votes":1,"down_votes":0,"body":"La prima stagione di TWD mi stava piacendo, poi però non sono riuscito neanche a finire la seconda. Troppo niente in ogni puntata. Ce ne sono alcune in cui veramente non accadeva nulla. Poi di quelle poche puntate che ho visto delle stagione successive mi sembra siano anche andati peggiorando. Succedono cose ( ti farei esempi, ma sarebbero spoiler ) troppo forzate per muovere un po' la trama, poi altro niente, poi altre cose a caso, poi ..... carri armati ? Poi ... altro, e qui è anche peggio ! Per me è no.\n\nGoT ho letto i primi due libri, e visto metà della prima stagione. Quindi boh.","replies":[]},{"poster":"Pizz Uh Jin","date":"2015-09-23T19:36:38.671+0000","up_votes":1,"down_votes":0,"body":"TWD: personalmente la terza stagione è quella che mi è piaciuta di meno, non mi ha coinvolto e la trama in certi casi mi ha fatto storcere il naso (e certe situazioni non capisco semplicemente perché i personaggi non compiano azioni ovvie).\n\nGOT: EPICOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO.\nNon è come tutti lo descrivo (\"morte ogni puntata\", \"troppo sesso\" ecc), le scene in questione sono frequenti (morti, non sesso, quello è in qualche episodio) ma neanche così tante, però.\nGuarda la prima stagione (non fermarti al primo episodio) e decidi.","replies":[]},{"poster":"ViaMalinconiaN9","date":"2015-09-23T19:11:11.266+0000","up_votes":1,"down_votes":0,"body":"Ricordati questo nome: Il Governatore.\nTi cambierà la vita. xD","replies":[]},{"poster":"ViaMalinconiaN9","date":"2015-09-23T19:05:32.290+0000","up_votes":1,"down_votes":0,"body":"Posso spoilerarti tutto su TWD? A ottobre esce la season 6 OMGOMGOMGKMOGOMG SBAVO.\nLa stagione più bella credo sia la 3, la più brutta o la 1 o la 2, dipende, c'è chi dice che sono le più belle.\nDalla season 4 in poi, la qualità video e audio migliorano, anche i colori.\n\nComunque a parere mio quelle sono le season più belle e brutte, poi la questione è soggettiva.","replies":[]},{"poster":"BrattishSolid6","date":"2015-09-23T18:51:35.693+0000","up_votes":1,"down_votes":0,"body":"Sono un grande fan di entrambe le serie c:\n\nIn TWD la stagione \"\"peggiore\"\" è la terza. Semplicemente per un piccolo motivo: è lenta. è più lenta delle altre stagioni, non ci sono risvolti così interessanti, in alcuni momenti la storia può far storcere il naso. Ma resta comunque molto molto bella. Continua tutto TWD, merita (anche perché tra poco comincia la sesta stagione ^^)\n\nGame of Thrones.. Ho finito le 5 stagioni in 3 settimane tipo. Ci sono scene di sesso, ma neanche così tante. Ci sono decapitazioni/scene cruente, ma neanche così tante. Il mio consiglio è di vederti almeno tutta la prima stagione, e poi decidere. (Nota: il primo episodio non ti prende sicuramente. Guardati tutta la prima stagione, fidati, non lasciarla a metà). Man mano che si va avanti secondo me migliora, continuamente. Diventa sempre più avvincente, ti affezioni sempre di più ai personaggi (quelli vivi. Sigh). \n\nSono due ottime serie a mio parere, sicuramente tra le mie preferite in generale. Di solito sono restio a consigliare TWD per le varie scene cruente/macabre/schifose/voltastomaco. Davvero cruente. Ma se sei resistito alla prima stagione, beh, lo standard si alza ma non così tanto. GoT invece vai tranquillo, giusto all'inizio c'è un po' troppo sesso e morte, poi le cose si calmano e la storia ti prende C: \nBuona ~~fine della tua vita sociale ~~ visione :D","replies":[]},{"poster":"Sorcio84","date":"2015-09-23T18:39:33.539+0000","up_votes":1,"down_votes":0,"body":"io ho visto la S1 e la S2 alla fine mi ha lasciato in crash.\n\nOra dovrei vedere la 3 ma non ho il tempo di guardarla/scaricarla di straforo. Mi tocca riandare un miliardo di cose a novembe.\n\nComunque la s2 è carina","replies":[]},{"poster":"StayM","date":"2015-09-23T16:33:05.967+0000","up_votes":1,"down_votes":0,"body":"guarda, secondo me la seconda è quella un po' più moscia, le altre sono molto carine, soprattutto la quarta. Il problema di TWD è che non si vede una fine della storia e questo può essere un po' esasperante\n\nGoT io lo ho visto, a me piace, sì ci sono strupri, omicidi, squartamenti etc... ma è la gente che esaspera le cose; ci sono molte storie parallele quindi non ci sono stupri così a gogo, per le uccisioni sono molto frequenti ma hanno un senso.\n\nComunque se non hai visto Breaking Bad, ignora tutto (scuola/uni, amici, vita sociale etc...) e guardatelo oltre a House of Cards e Twin Peaks.","replies":[{"poster":"ztJackieChan","date":"2015-09-23T16:54:40.073+0000","up_votes":1,"down_votes":0,"body":"Io non ho mai capito tutto il clamore riscosso da Twin Peaks. L'ho riguardato e non ci ho capito nulla.\n\nTutti in pena per la vittima ? Solo questo ? Non ci credo.\nO è il modo di girare la serie ? Boh","replies":[{"poster":"StayM","date":"2015-09-23T17:15:33.500+0000","up_votes":1,"down_votes":0,"body":"Ma è il modo in cui la trama si sviluppa, le inquadrature,l'ansia, il mistero, il tutto. Oltre a una bella storia devi valutare il come essa viene sviluppata (sarà che mi piacciono molto i film \"pesanti\"). \nInoltre io guardo molto al complesso; soprattutto per i film ma ciò vale anche per le serie o i video, in generale.","replies":[]}]}]},{"poster":"Newkopop","date":"2015-09-23T17:10:09.269+0000","up_votes":1,"down_votes":0,"body":"TWD a me personalmente piace talmente tanto che lo vedo il lingua originale perchè le voci di rick inj primis ti fanno venire.. GOT è bello seguo pure quello però a me sinceramente l'avere 5 se non più storyline diverse da seguire mi ha annoiato e non poco nell'ultima stagione","replies":[]},{"poster":"Tankerous","date":"2015-09-23T16:53:32.841+0000","up_votes":1,"down_votes":0,"body":"Game of Thrones in realtà non è \"pieno\" né di sesso né di morti, la serie tv semplicemente enfatizza quasi soltanto quelle particolari scene... leggendo i libri noti come muoia gente come in un qualsiasi altro romanzo.","replies":[]},{"poster":"Dantazzo","date":"2015-09-23T16:31:35.693+0000","up_votes":1,"down_votes":0,"body":"La seconda stagione è la peggio merda mai creata. Poi dalla 3 in poi ci si riprende, secondo me la 5 è la migliore per ora.","replies":[]}]}