{"poster":"Ao Vo","date":"2016-08-12T02:47:18.211+0000","title":"Reinstalling League","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Below is a walkthrough of the basic process of installing League of Legends, along with common mistakes encountered when trying to install the game on a Mac. Open your \"Applications\" folder (press the command key+Shift+G, and paste in: /Applications/). Drag League of Legends from the Applications folder to the Trash Can on the dock.","url":"https://support.riotgames.com/hc/en-us/articles/202539040-Reinstalling-League-of-Legends#section-windows","image":"http://p6.zdassets.com/hc/settings_assets/43400/200033224/w3uANovVixYgRaxUQ19kxg-logo.png"},"up_votes":1,"down_votes":0,"body":"I've been considering to reinstall league due to a bug with my hextech crafting. Everytime I try opening it, the hextech screen just blacks out, not the client itself though. I recently read a discussion about this @http://boards.na.leagueoflegends.com/en/c/help-support/uqz2HXkp-hextach-crafting-menu-bugged\n\n  Porocles responded w/ \"It looks like your game files may have corrupted. I suggest going over our reinstall guide to get things back to norma.. You can also use our hextech repair tool to automatically run a clean reinstall for the game. This should get you fixed up!\"\n\nI checked out the website above.\n\nI wanted to ask if reinstalling League this way is the same as if you were installing it for the first time, or is the download a bit faster?\n\nIf I wasn't so busy, I wouldn't have minded reinstalling the game all over again, but since I cant buy time, there's only so much I can do.\n\nThanks @AoVo","replies":[{"poster":"Porocles","date":"2016-08-12T18:44:00.100+0000","up_votes":1,"down_votes":0,"body":"This issue is something we've been looking into, and there's been a variety of different causes mostly from the recent Windows 10 update.  Reinstalling the game would be like doing a new install.  You can also use our  [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs) to automatically perform a clean reinstall for you.  Before you do that, check some other troubleshoot steps first like making sure you have any third party programs disabled.  Finally make sure your drivers are updated!  If your issue persists, then you may need to roll back your OS update.  Let me know what worked for you!","replies":[]},{"poster":"Kaniwkof","date":"2016-08-12T17:14:19.730+0000","up_votes":1,"down_votes":0,"body":"get league of legens back like season 4","replies":[]}]}