{"poster":"NebelBenny","date":"2018-08-11T16:38:53.079+0000","title":"Katarina Mains bitte helfen :)","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hallo,\r\nich habe Katarina f&uuml;r mich entdeckt und sie macht mir mega viel Spa&szlig;.\r\nVon den Combos kann ich die Grundlagen, woran es aber noch fehlt ist die laningphase.\r\nIch wei&szlig; manche sagen jetzt z.B naja einfach E,W,aa,Q,e,aa und der Gegner ist Tod. Ich habe vorhin gegen ein Ekko gespielt der mich komplett auseinander genommen hat. Hab ihr Tipps wann man zu den Dolchen springen sollte oder wie man wie die Mains z.B den Gegner schon mit Level 3 Auseinander nimmt oder allgemein in der Laningphase besser klar kommt?\r\n\r\nMFG NebelBenny","replies":[{"poster":"Sakuritou","date":"2018-09-17T09:03:06.237+0000","up_votes":1,"down_votes":0,"body":"Ich bin #5 Kata EUW und #63 Kata World also falls du weiterhin Tipps suchst, helfe ich gerne!\n\n\n\n{{sticker:katarina-love}}","replies":[]},{"poster":"Elyon the Kat","date":"2018-08-12T10:53:09.963+0000","up_votes":1,"down_votes":0,"body":"Adde mich, ich hol dich dann auf ein ts und erklär dir einiges","replies":[]},{"poster":"moampower","date":"2018-08-11T18:01:05.909+0000","up_votes":1,"down_votes":0,"body":"Ich bin jetzt kein Katarina Main habe aber Öfter Katarina auf ein paar Accounts gespielt nachdem sie Reworked wurde, wichtig ist das man auch weiß man kann auf unterschiedliche Positionen Springen bei dem Dagger je nach dem wie man die Maus platziert, landet man an dieser Stelle.\n\nUnd spiel nicht nur strickt nach Combos, Spiel je nach dem was dir das Spiel hergibt, laufen Laner auf deine Dagger möchtest natürlich Traden ansonsten kannst du ja die Lane auch ohne Solo Kill überleben. Ab Gunblade solltest du mit dem Slow eigentlich ziemlich safe auch ohne bisherigen Solo Kill etwas leisten können.\n\nJedoch ein Trick denn ich nach dem Rework immer vergessen habe, mann kann W - R machen und dann setzt man den Daggern inmitten der Ult ein, das überrascht eventuell ab und zu noch vom dmg her. ^^\n\nZur laning Phase, da wirst du als Katarina denke ich oft lang gemacht, sei dir auch mal nicht zu schade Doran's shield into ein seeker's armguard oder so early zu bauen. Katarina kriegt halt nunmal early ziemlich ins Gesicht oft lässt sich da nicht viel machen. \n(Soulstealer im Build immer vermeiden wenn du nicht gut darin bist am Leben zu bleiben!)\n\nIch kenne auch viele Katarina Mains die einfach in loosing Matchups nur auf anderen Lanes sitzen oder versuchen mit dem Jungler catches zu machen, das ist als Kata natürlich auch immer eine Option.","replies":[]}]}