{"poster":"FerrousOxide","date":"2016-12-31T07:56:38.565+0000","title":"Ryze top.","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"How does a normal top bruiser/tank (in my case {{champion:102}} and {{champion:106}} ) deal with Ryze top. I have seen it a few times and have found it impossible to fight against even to just lane and farm.","replies":[{"poster":"Captain Fortune","date":"2016-12-31T10:53:52.966+0000","up_votes":1,"down_votes":0,"body":"I would recommend starting off when you are having a trouble understanding how a champion works is seeing how that champion works themselves. Get a good understanding of how ryze's cooldowns and combos work. Once you have a good understanding of how he works that will help when you vs him.\n\nOther than that there are quite a few things that you can do when you are melee vs ranged in Top Lane. For example the three Lane bushes. You can use them to make your Lane opponent either waste a ward to get you out of the bush or walk into the bush. In this case one of two things with happen.\n\nA. He wards the bush and you can tell your jungle that Top Lane is not warded and that he can come for easy tanks. With how trinkets cooldowns work if he is using them on cooldowns as they are up the only way he will have it warded is via his jungler or a pink Ward.\n\nB. He walks into the bush making it so that you are in melee range of him for free. This let's you fight a ryze a lot easier and will help you get your melee abilities off at the start of the trade. As a quick note for Volibear try save your flip until he is close to getting out of the bush if he starts running away in my opinion.\n\nWith that in mind like you said farming and building tanky is a good option but you could always consider getting something like a hexdrinker for example that will help against a ryze alot. Ask for tanks from your jungler and make sure you punish ryze if he miss positions.\n\n--\n\nI hope this helps, if there are any more questions I can answer let me know and good luck in your games.\n\n~Elam","replies":[]},{"poster":"Talon12","date":"2016-12-31T10:04:06.589+0000","up_votes":1,"down_votes":0,"body":"Im actually stumped as to why you think shyvana is a general toplaner...\n\nYou need either ranged damage or gap closers to beat a ryze anyway, or some form of easy access stun.","replies":[]}]}