{"poster":"Riuzaki","date":"2018-03-05T10:13:47.910+0000","title":"Caitlyn rimossa dai miei champ..Help","subforum":"Aiuto e supporto","up_votes":3,"down_votes":0,"body":"Ragazzi qualcuno sa come sia possibile che il mio main con il quale giocavo sempre adesso me lo segna da acquistare?\r\nIo stavo accumulando essenze per altri champs e mi ritrovo a dover spendere 4800 essenze per un champ che avevo gi&agrave; acquistato....qualcuno mi aiuti","replies":[{"poster":"Menfrix","date":"2018-03-05T11:36:40.410+0000","up_votes":2,"down_votes":0,"body":"Per prima cosa riavvia il client, magari è solo un errore.\nSecondariamente controlla in Negozio->account (cerchietto tutto a dx)->cronologia acquisti e verifica che non sia stato rimborsato per sbaglio, se è rimborsato e sei sicuro di non averlo fatto tu potrebbero averti violato l'account.\n\nEdit: ma ricordati che sei esclusivamente tu responsabile della sicurezza del tuo account.","replies":[{"poster":"Riuzaki","date":"2018-03-05T13:24:33.156+0000","up_votes":1,"down_votes":0,"body":"Grazie mille per la risposta comunque in ordine:\n-Ho riavviato il client e non cambia niente\n-Non è stato rimborsato (anche perchè ho raggiunto il limite dei rimborsi)\n\nDi conseguenza non c'entra la violazione dell'account.\n\nAvete qualche altro consiglio? Proprio da poco avevo preso anche la Pulsefire di Caitlyn e non mi va di spendere 4800 essenze per prendee un champ che ho comprato 2 anni fa.","replies":[{"poster":"Menfrix","date":"2018-03-06T09:32:32.460+0000","up_votes":1,"down_votes":0,"body":"In questo caso, come ti han già detto, manda un tiket al supporto (Invia una richiesta->ho dei problemi tecnici credo vada bene, non sono wrenchman), spiegagli la situazione ed aspetta che ti rispondano.","replies":[{"poster":"X9Twitch","date":"2018-03-06T11:26:33.795+0000","up_votes":1,"down_votes":0,"body":"Per curiosità a cosa si riferisce \"adjudicator\" sotto al tuo nome?","replies":[{"poster":"Menfrix","date":"2018-03-06T13:47:49.532+0000","up_votes":1,"down_votes":0,"body":"Durante i tornei battlegrouds (quelli in cui si disputavano le finali al Lucca comics) siamo stati reclutati per verificare e supportare il corretto svolgimento di tale.\nDiamo comunque supporto a wranchman ed emissary, anche se in questo momento il nostro ruolo è poco utilizzato (con mio dispiacere)","replies":[{"poster":"X9Twitch","date":"2018-03-08T10:11:32.316+0000","up_votes":1,"down_votes":0,"body":"Grazie per l'informazione :D","replies":[]}]}]}]},{"poster":"X9Twitch","date":"2018-03-05T21:54:09.636+0000","up_votes":1,"down_votes":0,"body":"L'unica cosa che ti rimane da fare è inviare un ticket al supporto. Penso sia la cosa più giusta da fare, da quanto ho letto hai pagato elise ed anche pulsefire caitlyn in rp quindi se ti hanno tolto qualcosa è più che giusto fornirti delle informazioni ufficiali dalla Riot e magari serve anche a loro per evitare casi come questi in futuro.","replies":[{"poster":"Riuzaki","date":"2018-03-06T05:43:48.398+0000","up_votes":1,"down_votes":0,"body":"Nella sezione supporto cosa dovrei scegliere? Ho visto bug ma non si tratta di un bug secondo me sarà qualcosa di più complesso.","replies":[{"poster":"X9Twitch","date":"2018-03-06T11:22:45.092+0000","up_votes":1,"down_votes":0,"body":"Come ha detto Menfrix,n ella sezione problemi tecnici dovrebbe andare bene come ha detto Menfrix, penso che in caso la spostino loro o passano la richiesta a chi di competenza.","replies":[]}]}]}]}]},{"poster":"Riuzaki","date":"2018-03-21T03:54:19.741+0000","up_votes":1,"down_votes":0,"body":"Aggiornamento: niente da fare nessuna risposta...mi ritrovo senza Fiora Irelia Elise e Caitlyn per un danno pari a 19200 essenze blu o 3440 RP....grazie riot soprattutto per tutte le skin che avevo su quei champ...","replies":[{"poster":"DjangoUnchaìned","date":"2018-03-21T11:16:55.926+0000","up_votes":1,"down_votes":0,"body":"Non è che avevi sbloccato temporaneamente i suddetti champ? (sempre che si possa fare grazie al crafting hextech, non vorrei sbagliarmi).","replies":[]}]},{"poster":"Dodop","date":"2018-03-06T08:20:46.896+0000","up_votes":1,"down_votes":0,"body":"Bah è indifferente, credo anche bug possa andare bene.\nRicorda di postare gli screen e magari anche quello della cronologia acquisti/rimborsi e facci sapere.","replies":[]},{"poster":"Dodop","date":"2018-03-05T21:32:43.601+0000","up_votes":1,"down_votes":0,"body":"Mi sembra veramente strano, anche perché su Caitlyn dallo screen si vede che hai ottenuto il baule, cosa che non può succedere se lo giochi in rotazione gratuita e che effettivamente non ho mai visto.\nAssicurati che non sia un bug grafico, prova ad andare in custom e controlla se anche lì non hai più quei campioni.\nFacci sapere.","replies":[{"poster":"Riuzaki","date":"2018-03-06T05:42:23.650+0000","up_votes":1,"down_votes":0,"body":"Eh purtroppo me ne sono accorto proprio in partita, ovvero cerco cait che non era né bannata né pickata dal team avversario e non mi appariva tra i champ disponibili. Tutt'ora non posso giocarla in quanto non è più tra i champ Selezionabili in game.\nChe palle però non possono fare questo.","replies":[]}]},{"poster":"CesoiePlastiche","date":"2018-03-05T16:05:22.904+0000","up_votes":1,"down_votes":0,"body":"sicuro di averli persi? magari facci una foto della tua lista campioni quando scrivi il nome di cait, elise, irelia e fiora... è già successo che un tizio venisse qui sul forum per lo stesso problema ma alla fine si è scoperto che non riusciva soltanto a trovare nella lista i campioni che voleva giocare.","replies":[{"poster":"Riuzaki","date":"2018-03-05T17:16:53.162+0000","up_votes":1,"down_votes":0,"body":"http://prntscr.com/in7inc\nhttp://prntscr.com/in7j2w\n\nQui ci sono le foto per irelia e caitlyn....ma ripeto è impossibile perchè cait è il mio main ho anche alcune sue skin e ci gioco da parecchio.\nElise l'ho pagata in Rp addirittura quando la comprai.\nLa riot mi sta trollando","replies":[]}]},{"poster":"Riuzaki","date":"2018-03-05T13:40:54.129+0000","up_votes":1,"down_votes":0,"body":"Aggirnamamento:\n\nMi sono appena accorto che oltre a caitlyn mi hanno tolto\n-Elise\n-Irelia\n-Fiora \n\nMa mi sta prendendo per il culo la Riot?","replies":[]}]}