{"poster":"Stjerne27","date":"2019-02-18T11:17:38.249+0000","title":"So überlebt man die Dschungeländerungen -Übersetzung vielleicht überdenken","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"In dem Artikel auf der Lol Esport Seite berichten 5 Jungler &uuml;ber die Erfahrungen der &Auml;nderungen  durch 9.2\r\nAuf dem Hintergrund der deutschen Geschichte ( auch wenn es manche nicht mehr h&ouml;ren m&ouml;gen/wollen) finde ich die &Uuml;bersetzung \r\nvon ich nehme mal an &quot;Clean a camp&quot;\r\nmit &quot;S&auml;uberungen der Lager &quot; unangebracht und schlage vor hier  vielleicht von &quot;Beseitigen der Lager&quot; zu sprechen. Danke","replies":[{"poster":"Amycos Cyrus","date":"2019-02-18T12:47:12.400+0000","up_votes":1,"down_votes":0,"body":"Man sollte jedoch auch den Inhalt nicht verfälschen.\nClean a Camp => Säubern/Bereinigen eines Lagers, verdeutlicht, dass es nur um das entfernen der dort stationierten Kreaturen (Buffs etc) handelt.\nBeseitigen suggeriert, dass man das Lager selbst zerstört. => Also kein Respawn existiert.\n\n___\n\nWeiterhin finde ich es eher bescheiden, wenn man die deutsche Geschichte als Grundlage dafür nimmt Inhalte und Formulierungen zu brechen und beugen.\nEs kommt mir in vielerlei Hinsicht oft so vor, als würden sich nur die Deutschen so sehr darüber aufregen, wie Aussagen getroffen werden statt, was für Aussagen getroffen werden.\n\nEin schönes Beispiel ist die wunderschöne Formulierung \"dunkelhäutig\", die es nahe zu in keiner anderen Sprache gibt. Das spanische (negro) und englische (black) Pendant ist als schwarz zu übersetzen. Die jeweiligen Aussagen für dunkel (oscuro und dark) sind hierbei sogar als geistige Interpretation etabliert, was der deutschen Sprache in Gänze fehlt.\n\n___\n\nDie deutsche Geschichte lässt sich nicht leugnen, jedoch gehört zur Aufarbeitung auch die Tatsache festzustellen, dass sie glücklicherweise vorbei ist. Auf den Boden der Tatsachen zurückzukehren würde vielen Leuten sehr helfen. (jedenfalls in dieser Hinsicht)\n\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Qbert","date":"2019-02-18T12:54:11.051+0000","up_votes":1,"down_votes":0,"body":"> jeweiligen Aussagen für dunkel (oscuro und dark) sind hierbei sogar als geistige Interpretation etabliert, was der deutschen Sprache in Gänze fehlt.\n\nIch glaube das deutsche Pendant dazu wäre \"obskur\" oder \"böse\", aber auch \"dunkel\" oder \"schwarz\" oder auch \"korrumpiert\" könnte man in diesen Kontext setzen.\n\nIch persönlich empfinde den TE als Teil des Problems, welches die Gesellschaft sich derzeit schafft. Diese hypersensibilisierte Auslegung von Aussagen etc., es könnte ja jemand falsch verstehen.","replies":[]}]},{"poster":"SCUlater","date":"2019-02-18T11:22:29.005+0000","up_votes":1,"down_votes":0,"body":"Beseitigen klingt zu sehr wie entfernen.\n\nVielleicht überdenkst du das nächste mal , bevor du einen Thread postest :)","replies":[{"poster":"Qbert","date":"2019-02-18T11:29:40.944+0000","up_votes":1,"down_votes":0,"body":"was hältst du vom Kompromiss: \"Auslöschen der Lager\"? :D \n\nNein Spaß, wenn man diese Stelle wirklich entschärfen möchte, könnte man meiner Meinung nach \"Camps\" unübersetzt lassen oder ein \"Säuberung der Dschungellager\" schreiben","replies":[{"poster":"SCUlater","date":"2019-02-18T11:34:47.153+0000","up_votes":1,"down_votes":0,"body":"Wie schon gesagt.\nSolche probleme wie der TE hätte ich gerne.\nJeder weiß was gemeint ist, von daher ist die übersetzung in ordnung.","replies":[{"poster":"Uranbrennstab","date":"2019-02-18T12:41:03.796+0000","up_votes":1,"down_votes":0,"body":"Ja aber das erinnert doch voll Schlimm an die NS Zeit. Denn Worte wie Säubern und Lager gab es vorher gar nicht. Die Geschichte der deutschen Sprache ist begründet und erschöpft sich nämlich mit den Nationalsozialisten. Weiß nur wieder keiner.","replies":[]},{"poster":"Qbert","date":"2019-02-18T11:37:46.879+0000","up_votes":1,"down_votes":0,"body":"Ich kam dir zuvor, vertrete aber die selbe Meinung :)","replies":[]}]}]}]},{"poster":"naniwakaze","date":"2019-02-18T11:55:50.986+0000","up_votes":1,"down_votes":0,"body":"Die \"offizielle\" Übersetzung generell ist \"Räumen der Dschungellager\".","replies":[]},{"poster":"Qbert","date":"2019-02-18T11:20:34.439+0000","up_votes":1,"down_votes":0,"body":"Oder wir lassen die Kirche im Dorf und deklarieren es als \"unglückliche Übersetzung\".","replies":[]}]}