{"poster":"Humpelstilzche","date":"2017-03-31T22:06:16.891+0000","title":"Rework der League of Legends Homepage","subforum":"Allgemeiner Chat","up_votes":22,"down_votes":2,"body":"http://i.imgur.com/wSlhkGj.png\r\n\r\nBeschw&ouml;rer,\r\n\r\nwir wollen heute ein Thema ansprechen, das in den letzten Tagen dank des Youtubers [Maxim &ldquo;Letsreadsmallbooks&rdquo; Markow](https://www.youtube.com/user/Letsreadsmallbooks) vermehrt Aufmerksamkeit bekommen hat: Der Zustand dieser Homepage.\r\n\r\n\r\nEs gibt immer wieder Beschwerden, dass Teile der Homepage fehlen und veraltet oder schwer zu finden sind. \r\nWir, das [Volunteer Team](http://en.volu-eu.org/), haben uns gedacht: Das muss sich &auml;ndern! Nat&uuml;rlich ist die &Uuml;berarbeitung der Homepage ein langer Prozess, der nicht von einem Tag auf den anderen passieren kann. Wir wollen jedoch den Anfang machen, indem wir zumindest das Design der Boards &uuml;berarbeiten. \r\nWir vertreten den Standpunkt, dass Design und Funktion miteinander einhergehen sollten. Daher haben wir keine Kosten und M&uuml;hen gescheut und haben die besten K&uuml;nstler der League Community eingeflogen und sie darum gebeten, exklusive Artworks f&uuml;r jedes Unterboard zu erstellen. \r\n\r\nWir hoffen sehr, dass euch die &Auml;nderungen gefallen und dass das neue Design die Vision, die wir f&uuml;r diese Homepage haben, gut zum Ausdruck bringt. \r\n\r\nViel Gl&uuml;ck in der Kluft w&uuml;nschen\r\n\r\nDie Volunteers","replies":[{"poster":"SwissKeks","date":"2017-04-01T07:30:11.579+0000","up_votes":5,"down_votes":0,"body":"Also gibt es ein paar neue Designs oder auch die Möglichkeit Funktionen vorzuschlagen die schon länger fehlen?\nBeispielsweise die ganzen Bugs im Mobile, private Nachrichten, die Möglihkeit im Mobile Threads zu melden, user zu blockieren etc.?\n\nWehe das ist ein April Scherz weil die Website ist immernoch Mist und es ist teils echt schon ein Armutszeugnis wenn Rito sich weiterhin nicht darum kümmern will für ein Spiel solcher Grösse.\n\nAch, was erwarte ich eigentlich..\nSchönen 1. April euch allen.\n\nEdit: Witzig, aufm Mobile wird nicht mal die Website aktualisiert um den Joke zu verstehen. Joa, proves my point I guess?","replies":[{"poster":"Humpelstilzche","date":"2017-04-03T06:42:35.755+0000","up_votes":1,"down_votes":0,"body":"> Also gibt es ein paar neue Designs oder auch die Möglichkeit Funktionen vorzuschlagen die schon länger fehlen?\n\nJein. Es gibt die Möglichkeit die Forenhintergründe zu ändern. Das ist mit ein paar Klicks getan (und ewigem herumprobieren um das richtige Format zu finden...aber theoretisch ist es simpel). Ebenso einfach kann man die Namen und Anzahl der Unterforen ändern. \nAber alles darüber hinaus ist im Prinzip nicht möglich. Der neue Client ist schon seit geraumer Zeit der größte Fokus von Riot, der andere Entwicklungsarbeiten, wie die an Forum und Homepage, in den Hintergrund hat treten lassen. \n\nMomentan kann da niemand was dran ändern...zumindest niemand hier. Irgendwo bei Riot wird es wohl irgendwen (oder ein Team) geben der sowas entscheidet, aber alle die hier aktiv sind, können nicht wirklich etwas machen. Wir können nur hoffen dass das anders wird, wenn der Client die Beta verlässt, was ja vermutlich nicht mehr allzu lange dauern wird.","replies":[{"poster":"SwissKeks","date":"2017-04-03T09:22:33.771+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=YnZkMR0R,discussion-id=UIv7XMAv,comment-id=00030001,timestamp=2017-04-03T06:42:35.755+0000)\n>\n> Jein. Es gibt die Möglichkeit die Forenhintergründe zu ändern. Das ist mit ein paar Klicks getan (und ewigem herumprobieren um das richtige Format zu finden...aber theoretisch ist es simpel). Ebenso einfach kann man die Namen und Anzahl der Unterforen ändern. \n> Aber alles darüber hinaus ist im Prinzip nicht möglich. Der neue Client ist schon seit geraumer Zeit der größte Fokus von Riot, der andere Entwicklungsarbeiten, wie die an Forum und Homepage, in den Hintergrund hat treten lassen. \n> \n> Momentan kann da niemand was dran ändern...zumindest niemand hier. Irgendwo bei Riot wird es wohl irgendwen (oder ein Team) geben der sowas entscheidet, aber alle die hier aktiv sind, können nicht wirklich etwas machen. Wir können nur hoffen dass das anders wird, wenn der Client die Beta verlässt, was ja vermutlich nicht mehr allzu lange dauern wird.\n\nDanke für die Antwort.\n\nIch habe mit meinem (etwas bissigen) Kommentar nicht euch angreifen wollen. Als ich noch Emissary war habe ich ja auch selbst gesehen, dass solche Dinge nicht so einfach möglich sind. Was mich aber stutzig macht ist, dass es ständig irgendwelche Seiten für Events gibt, welche nur kurze Zeit dauern. Das heißt (in meinem Verständnis), dass Riot schon die Ressourcen hat, sie aber nicht in das Forum stecken möchte.\n\nIch finde es einfach lächerlich wie einem am Anfang das blaue vom Himmel versprochen wurde.\n\nUms direkt zu sagen: Ich fühle mich, im Bezug aufs Forum, von Riot verarscht.\n\nZumal es mir nicht mal direkt um neue Funktionen geht. Sondern um die Begründung warum zB. Pn's nicht aktiviert werden, die ganzen Buggs im Mobile (Muss ständig hochscrollen wenn ich auf eine neue Seite gehe, teils ist einfach mal random die halbe Seite schwarz und ich muss ständig reloaden bis sich das behebt) oder einfach nur die zahlreichen Versprechen um dann das Forum 2 Jahre in der Beta zu lassen.\nFrustet irgendwo auch langsam..","replies":[{"poster":"Humpelstilzche","date":"2017-04-03T09:32:56.063+0000","up_votes":3,"down_votes":0,"body":"> Ich habe mit meinem (etwas bissigen) Kommentar nicht euch angreifen wollen\n\nHab ich auch nicht so aufgefasst. \n\nIch bin da prinzipiell deiner Meinung. Maxim hat im Prinzip die Dinge gesagt, die ich Riot schon seit Jahren sage. Und nicht nur ich. Und auch nicht nur Spieler. Selbst Rioter sagen das Riot. \nDas ist so einer der wenigen Punkte wo ich wenig bis kein Verständnis für Riots Prioritäten haben. \n\nIch verstehe zwar zu einem gewissen Maß das Argumenent dass der Client wichtiger ist als alles andere, aber dass dann ausgerechnet das hauseigene und sogar selbst entwickelte Kommunikationstool für die Community (und wenn Riot auf etwas stolz sein will und kann, ist es ja wohl dass sie tatsächlich mit der Community kommunzieren) komplett vernachlässigt wird, ist eine Entscheidung die ich persönlich nicht nachvollziehen kann. \nVlt liegt es nur daran, dass ich die Gründe schlicht nicht kenne. Wäre nicht das erste Mal. Vlt ergibt das Sinn die HP und Foren links liegen zu lassen. Ich persönlich verstehe es aber nicht und mich würden die Gründe wahnsinnig interessieren.","replies":[]}]},{"poster":"Eibert Rümmel","date":"2017-04-03T17:57:05.468+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=YnZkMR0R,discussion-id=UIv7XMAv,comment-id=00030001,timestamp=2017-04-03T06:42:35.755+0000)\n>\n> Ebenso einfach kann man die Namen und Anzahl der Unterforen ändern. \n\n\nAllgemeiner Chat klingt schon doof, zumal der Name sogar eine falsche Erwartungshaltung schürrt, denn dahinter verbirgt sich ein Forum, kein Chat. Viel besser würde da doch Off-Topic passen ;) (Die Hoffnung stirbt zu letzt) oder noch wohlklingender wäre vielleicht Königreich Offtopic ;)","replies":[]},{"poster":"Zamonianer","date":"2017-04-03T07:05:27.783+0000","up_votes":1,"down_votes":0,"body":"Für ein paar Sachen gibt es allerdings schon eine Lösung, [hier](https://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/19jX6xwK-league-of-legends-foren-mod) ein paar von mir :)\n\nGruß\nZamo","replies":[]}]},{"poster":"XExEcUtOrX04","date":"2017-04-01T10:29:22.747+0000","up_votes":1,"down_votes":0,"body":"Wir hoffen alle das beste, im Prinzip gibts die Funktionen schon - man müsste die nur für die normalen User freischalten.","replies":[{"poster":"Shakês Beer","date":"2017-04-02T17:22:26.111+0000","up_votes":1,"down_votes":0,"body":"Das gute an diesem billigen \"Rework\" ist jetzt, dass man fast das \"scheiße sein\" der Website als Stilmittel anerkennen könnte.","replies":[]}]}]},{"poster":"inics","date":"2017-03-31T23:21:33.709+0000","up_votes":5,"down_votes":1,"body":"Also ich bin absolut begeistert !","replies":[{"poster":"Anticodon","date":"2017-03-31T23:24:16.540+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=inics,realm=EUW,application-id=YnZkMR0R,discussion-id=UIv7XMAv,comment-id=0000,timestamp=2017-03-31T23:21:33.709+0000)\n>\n> Also ich bin absolut begeistert !\n\nDas neue Design gefällt mir auch super gut!\n\nIch finde es auch schön, dass jede Seite nun individualisiert wurde und den Charakter des jeweiligen Unterforums wiederspiegelt.\n\nwould rate 5/7","replies":[]}]},{"poster":"Enderized","date":"2017-04-02T22:16:11.577+0000","up_votes":2,"down_votes":0,"body":"Wird es irgendeine Möglichkeit geben auch außerhalb des 'Designerteams für exklusive Grafiken' an der Gestaltung und Aktualisierung von zB den Gameinfo-Seiten mitzuwirken? Nicht dass es von Relevanz wäre, aber ich bin verdammt gut im ändern von Zahlen und kann Videos für Champions im Strichmännchenstil erstellen ","replies":[]},{"poster":"JustA kleo","date":"2017-04-01T13:24:32.537+0000","up_votes":1,"down_votes":0,"body":"\"... das nicht innerhalb eines tages passiert\"\nstimmt. da die homepage noch aus season 4 ist.","replies":[{"poster":"Humpelstilzche","date":"2017-04-01T13:57:53.720+0000","up_votes":2,"down_votes":0,"body":"Das stimmt. Aber wie du siehst, haben wir diese Zeit genutzt.","replies":[]}]},{"poster":"Eibert Rümmel","date":"2017-04-01T09:13:38.146+0000","up_votes":2,"down_votes":0,"body":"Insiderinfo: _Ein Hohes Tier bei Riot hat mir verraten, dass die Boards künftig höchste Priorität haben. Riot ist bewusst, dass die Boards so etwas wie die Visitenkarte eines Spiels sind und es ist ihnen peinlich, dass Spieler hier seit Jahren eine Beta Version nutzen müssen. Auch wollen sie ändern, dass Sie an dieser Stelle der Konkurrenz weit hinterher rennen, was Funktionailtät und Außenwirkung angeht._","replies":[]},{"poster":"Wici","date":"2017-04-01T02:10:32.096+0000","up_votes":3,"down_votes":1,"body":"Also ich muss sagen, dass sieht deutlich besser aus als vorher. Allein die Farbvielfalt stellt einen klaren Kontrast zu vorher dar.\nAuch 1 großes Lob von Niceigkeit her an die Künstler, die die Ereignisse aus dem Spiel so gut in Szene gesetzt haben. \n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Vorzüglich","date":"2017-04-01T23:02:19.754+0000","up_votes":1,"down_votes":0,"body":"Ja...GG!","replies":[]},{"poster":"Samus Saran","date":"2017-04-01T00:52:17.954+0000","up_votes":1,"down_votes":10,"body":"Absolute Käse von euch!\n\nDas Problem liegt weiter auf der Homepage und NICHT im Forum.\nSchämmt euch doppelt und dreifach das Ihr selbst nicht darauf kommt die Homepage zu aktualisieren, nein ihr weicht wieder vom Thema ab....Board hübscher machen..... Ihr tickt nicht mehr richtig!","replies":[{"poster":"TerrorRaven","date":"2017-04-01T04:12:35.087+0000","up_votes":2,"down_votes":0,"body":"Schau mal auf das Datum","replies":[]}]}]}