{"poster":"Humpelstilzche","date":"2016-09-15T11:54:11.406+0000","title":"Kleines Update zur \"Chatlogs or it didn't happen\"-Regel","subforum":"Spielerverhalten & Moderation","up_votes":10,"down_votes":2,"body":"Wenn ihr hier &ouml;fter unterwegs seid, ist euch m&ouml;glicherweise die oben angepinnte &quot;Chatlogs or it didn&#039;t happen&quot;-Regel bekannt, die besagt, dass Spieler, die in diesem Forum &uuml;ber eine Strafe klagen und behaupten unschuldig zu sein, dazu verpflichtet sind ihre Chatlogs zu posten. Andernfalls kann der Thread, nach Ermessen des Mod-Teams, geschlossen werden. \n\nDiese Regel bleibt erhalten, hat sich aber in sofern ge&auml;ndert, dass wir jetzt endlich die offizielle Best&auml;tigung haben, dass die Links zu einer &ouml;ffentlich zug&auml;nglichen Version der Chatlogs leider NICHT mehr in den Emails enthalten sind, die bestrafte Spieler erhalten. Daher sind ab sofort nur noch Screenshots von den Chatlogs im Client gefordert. \n\nEs steht euch frei entsprechende Threadersteller h&ouml;flich darauf hinzuweisen und die entsprechenden Threads als Spam zu reporten, sollten die Chatlogs nicht gepostet werden.","replies":[{"poster":"MilliDieFrau","date":"2016-09-15T12:13:38.375+0000","up_votes":5,"down_votes":0,"body":"Mal ne ganz doofe Frage, warum wurde der Link denn entfernt..? Gab es dazu eine Begründung?\n\nReine Neugier, versteht sich.\n\nLiebe Grüße,\nMilli","replies":[{"poster":"Humpelstilzche","date":"2016-09-15T12:27:04.662+0000","up_votes":3,"down_votes":1,"body":"Ich denke mal es hat damit zu tun, dass es Reformkarten nun im Client gibt. An die Foren hat man wohl leider nicht gedacht :(","replies":[{"poster":"MilliDieFrau","date":"2016-09-15T12:33:08.912+0000","up_votes":2,"down_votes":0,"body":"Blöd gelaufen.. :/\n\nDann klicken wir uns halt in Zukunft durch die Screenshots. Yay!","replies":[]}]}]},{"poster":"Killerkante","date":"2016-09-15T13:40:17.821+0000","up_votes":1,"down_votes":0,"body":"Wird ja ärgerlich wenn jemand vergisst einen Screen zu machen \n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"Humpelstilzche","date":"2016-09-15T13:44:11.283+0000","up_votes":2,"down_votes":0,"body":"Die Chatlogs erscheinen jedes mal, wenn man sich in den Client einloggt.","replies":[{"poster":"RM Heartmeander","date":"2016-09-15T15:24:40.476+0000","up_votes":3,"down_votes":0,"body":"Kannst ja als Vorschlag bringen, dass sie den Link mit dem Chatlog gleich im Client einbringen.\nWäre wohl am einfachsten für alle.","replies":[]}]}]}]}