{"poster":"BloodyFloKon","date":"2016-09-14T09:45:47.989+0000","title":"Suchen einen Adc für das Team \" Lost Sky \"","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hallo liebe Community,\r\ndas Team Lost Sky sucht noch einen Adc\r\n\r\nAnforderungen an euch:\r\n-  Elo Bronze - Silber,\r\nsolltet aber ein gutes Spielverst&auml;ndnis haben und wissen was ihr tut\r\n- ihr solltet mindestens 18 Jahre alt sein\r\n- ihr verf&uuml;gt &uuml;ber Ts3 und ein Headset\r\n- ihr seid Kritikf&auml;hig und flamed nicht\r\n- ihr seid aktiv und p&uuml;nktlich\r\n\r\nWas wir bieten:\r\n-  eine lustige und aktive Gruppe, die aus 3 Teams besteht\r\nund wir gr&uuml;nden das 4.\r\n- einen eigenen Ts3 Server\r\n- Regelm&auml;&szlig;iges Training\r\n\r\nTrainingzeiten:\r\nMontag ab 18:30 - 21:00\r\nMittwoch ab 18:30 - 21:00\r\nWochenende Je nach Absprache\r\n\r\nKontakt:\r\nIhr k&ouml;nnt, bei Interesse, euch bei Mir &quot;BloodyFloKon&quot;\r\nmelden und uns eine kleine Bewerbung schreiben,\r\nwarum ihr f&uuml;r dieses Team geeingnet seit\r\nund ein paar Einblicke &uuml;ber euch abgeben.\r\n\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"P3ngui","date":"2016-09-14T12:22:12.718+0000","up_votes":1,"down_votes":0,"body":"Hätte Interesse!\nName: P3ngui | Johannes/ Hannes/ JJ \nAlter: 19\nPosition: ADC\nChampions: {{champion:222}}  (170k) {{champion:18}} (95.5k) {{champion:81}} (100k){{champion:51}} (62.5k) {{champion:29}} (40k). Ich \"Kann\" auch andere ADCs (Nur keine Erfahrung mit Quinn oder Kennen ADC xD )\nElo: Gold 3/2 atm - Sehr viel Spielerfahrung. Ich hab das Game zu viel gespielt ^^\nAttitude: Freundlich, Untoxic \nZeit: Sehr offen und flexibel. Nur Freitags isses bei mir schwierig\nZum Gameplay: Ich habe immer das Ziel zu gewinnen! Surrendern gibt es bei mir eigentlich nicht. Für mich wird getryhardet bis zum Schluss. Fällt man z.B. stark zurück, versuche ich immer die Ruhe zu bewahren und durch Safeplay und Hochfarmen standzuhalten. Farm ist sowieso das Wichtigste für mich :D\nTilten gibt es bei mir nur, wenn sich Leute wirklich konsequent daneben benehmen. Dann beleidige ich aber auch nicht sondern suche ein Gespräch (eine meiner Größten Probleme, weil LoLSpieler nicht reden, sondern stumpf weiterbeleidigen xD)\nZiel: Ich würde gerne die Teilnahme bei Turnieren (wie z.B. dem KingOfSpandau-Turnier) anstreben!\n\nMit freundlichen Grüßen,\nP3ngui\n\nPS: Würde auch als Ersatzmann einspringen :) Die Bewerbung über mir ist ja sehr schön :)","replies":[{"poster":"BloodyFloKon","date":"2016-09-14T13:14:10.617+0000","up_votes":1,"down_votes":0,"body":"Alles klar, add mich mal und wir machen mal am Abend ein Tryout :)","replies":[]}]},{"poster":"Adcisusel3ss","date":"2016-09-14T10:21:20.364+0000","up_votes":1,"down_votes":0,"body":"Hey ho, \n\nich wäre sehr interessiert. Momentan bin ich Silber 4 und habe in Season 5 mit meinem alten Team auf einigen Turnieren auch gegen Dia Teams gespielt. Generell kann ich so gut wie jeden adc zumindest einigermaßen Spieen wobei ich sagen würde da diese 5 dabei herausstechen. {{champion:236}} {{champion:202}} {{champion:18}} {{champion:429}} {{champion:22}} . Ich bin jederzeit dazu bereit meinen Chmpionpool anzupassen. Meine größten Stärken würde ich sagen sind mein Poitioning, meine Fähigkeit zu Kiten und s ich soweit es mir möglich it meine Itembuilds variieren kann. Außerdem bringe ich reltativ viel Gameknowlege mt. Ein großes Problem bei mir it die tatsache das ic sehr hart Tilten kann und ich immernoch otmal für zuviele Risky Plays gehe was im Teamranked nicht gerade vorteilhaft ist. nsonsten bemühe ich andere immer mit rat und tat ingame zr Seite zu stehen und habe auch in meiem alten Game eine Menge Teamranked analysen gemacht. Zu Dingen wie Pick/und Ban Phase und dem Game im hinblick auf Rotations und Teamfigtverhaten. \n\nZu mit ich bin 20 Jare alt heiße Florian und bin momentan in meiner ausbildung zum Kaufmann für Bürmanagement. Ich komme aus witten, bin aus dem Ruhrgebiet und habe die eigenschaft knallhart ehrlich zu sein. Sprich wenn ich denke das jemand mist baut dann sage ich das auch sehr direkt. \nein Problem könnten die Trainingszeiten innerhalb der Woche sein da ich Montags bis Donnerstags bis 18:3 auf der Arbeit bin und erst zwischen acht und halb neun ready wäre. es wäre echt cool wenn man da was machen könnte. \n\n\nBitte um eine Rückmeldung ;)\n\nMFG Nero Sama","replies":[{"poster":"BloodyFloKon","date":"2016-09-14T10:42:34.177+0000","up_votes":1,"down_votes":0,"body":"Hört sich gut an, kannst mich mal adden und dann schaun wir mal wies weiter geht  :)","replies":[]}]}]}