{"poster":"Anokota","date":"2016-08-04T19:16:21.830+0000","title":"Azir / nerf","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ich finde es schon ziemlich bad das Azir erneut generft wurde und dass so stark , ja im competetive ist er ziemlich stark aber sonst war die Winrate bei 44% ...aktuell ist diese bei ugf. 40% ... Er sollte wieder zur&uuml;ck gebufft werden ....mehr Schaden auf der W sowie dass man diese auf T&uuml;rme machen kann ...sicherlich ist es auch noch eine Sache mit der Ult , dass sie Movementspeed gab ...aber aktuell ist es echt Gr&uuml;tze","replies":[{"poster":"Maexle","date":"2016-08-04T19:21:54.952+0000","up_votes":4,"down_votes":0,"body":"Das ist eben die Problematik: Er ist im competitive ziemlich gut und in SoloQ bzw. im normalen Ranked eher schlecht... Wenn man ihn jetzt buffen würde, dann eskaliert er im competitive komplett... \n{{champion:17}}","replies":[{"poster":"Anokota","date":"2016-08-09T22:47:24.721+0000","up_votes":1,"down_votes":0,"body":"Ja das sitzt mir auch im Kopf ....sollen die den halt einfach bannen :^)","replies":[]}]},{"poster":"Rpgboss","date":"2016-08-04T19:47:03.672+0000","up_votes":1,"down_votes":0,"body":"https://www.change.org/p/rito-stop-kill-azir\nAzir ist noch immer spielbar solo que.\nwenn man azir main ist  hat man sich schnell daran gewöhnt da man \nals azir main gewöhnt ist das azit nur generft wird.\n\naber wenn sie das driften raus nehmen gute nacht azir.","replies":[{"poster":"Anokota","date":"2016-08-09T22:46:38.279+0000","up_votes":1,"down_votes":0,"body":"Ja , ich bin ja Azir main , habe mich auch schon daran gewöhnt dass er nur generft wurde , aber der aktuelle Schden ist da vor lvl 14 wie ich finde schon zu schwach ..und dass der w auf turrts nicht geht ist noch so grade verkaftbar , aber in einigen Situationen hätee ich das schon gebrauchen können...der fehlende Schaden ist finde ich Das Problem und was mich dazu gebracht hat ihn nurnoch selten zu spielen.","replies":[]}]},{"poster":"Im a Papaya","date":"2016-08-04T20:52:24.673+0000","up_votes":1,"down_votes":0,"body":"Dieser Patch ging speziell an die Champs die im competetive gepickt werden und Azir ist dort Pick or Ban deswegen wird für diesen Patch auf die meisten Spieler gepfiffen um das Spiel auch für die Pros zu balancen und zwar nur für die Pros.\nLange rede kurzer Sinn: Azir wird wahrscheinlich wieder gebufft da der nächste Patch wieder für die normalen Spieler ist, wenn ich alles richtig verstanden hab.","replies":[{"poster":"Anokota","date":"2016-08-09T22:43:43.079+0000","up_votes":1,"down_votes":0,"body":"Ja da hast du Recht , dass der nur wegen competetive generft wurde , das ist  Vor und Nachteil an lol {{champion:268}}","replies":[]}]},{"poster":"YanKYhii","date":"2016-08-04T21:54:52.292+0000","up_votes":1,"down_votes":0,"body":"Also ich finde Azir immer noch sehr stark, klar ist es schade das man die W nicht mehr auf gegnerische Türme machen kann aber trotzdem, \nwenn man mit ihm 3 Items hat dann eskaliert er komplett. Und ja, die Lose rate kann viel sagen aber es muss auch nicht immer stimmen  ;)","replies":[]}]}