{"poster":"ForMySword","date":"2019-07-08T17:04:09.294+0000","title":"Asi esta el server lleno de flamers afks y demas cosas","subforum":"Comportamiento del jugador","up_votes":8,"down_votes":0,"body":"https://imgur.com/a/Zpmz4To\r\nestoy aprendiendo a jugar rengar ya que me toco una skin y lo unico que recibo es odio extremo\r\nya cansa esto no soy el mejor jugador pero creo que tods tenemos malas partidas \r\ntampoco para que diga que ojala mi familia se muera en frente mio eso me puso muy mal que alguien me diga eso\r\nsolo dejo esa imagen para que vean en lo que se esta convirtiando el server juego hace unos 5 meses y siempre me toca gente asi ya es cansino no se disfrutan las partidas envie el reporte pero aun no me llego nada y este insulto es grave creo yo no entiendo porque no se sanciona a este jugador super toxico","replies":[{"poster":"TSW Rorschach","date":"2019-07-08T18:36:53.297+0000","up_votes":4,"down_votes":0,"body":"Es una paja tener que mutear para poder disfrutar mejor el juego, pero hasta ahora  creo que es la mejor forma si te afecta de esa forma lo que dicen.\n\nDivertite, es una skin re linda y Rengar es un personaje bastante divertido una vez aprendes a aprovechar los saltos y hacer desaparecer barras de vida.","replies":[]},{"poster":"Silicon Valley","date":"2019-07-08T18:58:26.334+0000","up_votes":2,"down_votes":0,"body":"Ya no se puede jugar. Hay que buscarse un juego como la gente ¿alguna recomendación?","replies":[{"poster":"AdcInANutshell","date":"2019-07-08T20:35:05.965+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Silicon Valley,realm=LAS,application-id=PJAKt7ph,discussion-id=f9Uj9Ktf,comment-id=0004,timestamp=2019-07-08T18:58:26.334+0000)\n>\n> Ya no se puede jugar. Hay que buscarse un juego como la gente ¿alguna recomendación?\n\nlos single player nunca fallan","replies":[]}]},{"poster":"Persa de Asgard","date":"2019-07-08T22:20:40.741+0000","up_votes":1,"down_votes":3,"body":"No sé que sacan en publicar esto acá una y otra vez jajajaks :ppp","replies":[{"poster":"ForMySword","date":"2019-07-08T22:34:10.047+0000","up_votes":3,"down_votes":0,"body":"creo que para eso esta esta seccion ademas que fue flameo exagerado creo que es amenaza de algun modo","replies":[]}]},{"poster":"GR33NGOBLIN","date":"2019-07-11T17:54:26.417+0000","up_votes":2,"down_votes":0,"body":"master date cuenta que eso seguro te lo dice un gordito probablemente excedido de peso y con menos de 15 años, no podes prestarle demasiada atencion, me han dicho cosas peores en este juego","replies":[]},{"poster":"Dragneel JMD","date":"2019-07-09T14:16:37.056+0000","up_votes":1,"down_votes":0,"body":"Con el tiempo te das cuenta que no tiene sentido darle importancia al chat. Un factor que el jugador de lol tiene es que le importa lo que piensen los demás.","replies":[]},{"poster":"LolisOfLove","date":"2019-07-09T03:36:16.376+0000","up_votes":1,"down_votes":0,"body":"Si es ranked, no se prueban champs en ranked. Si es normal, las normal sirven para eso. Después hay desequilibrados mentales en todos lados.","replies":[]},{"poster":"BrokenCris21","date":"2019-07-09T03:26:20.511+0000","up_votes":1,"down_votes":0,"body":"Manda un ticket interno a Riot... si no lo sancionan es porque Riot Latam realmente hace mal las cosas\n\nSaludos de un Main {{champion:31}}","replies":[]},{"poster":"Pororo17","date":"2019-07-09T01:52:52.039+0000","up_votes":1,"down_votes":0,"body":"QUE SERVER DE MIERDAAA NO PUEDE SER QUE ESTE LLENO DE GENTE Q NO SABE JUGAR EN RANKED... CREO Q RIOT TENDRIA Q EQUILIBRAR MEJOR ESTE TEMA ES UNA COSA DE NO CREER TENER Q JUGAR CON GENTE ASI... ME ESTOY PUDRIENDO YA","replies":[]},{"poster":"Shulys","date":"2019-07-08T17:52:34.003+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"ForMySword","date":"2019-07-08T18:12:45.133+0000","up_votes":1,"down_votes":0,"body":"tu eres una gracias :3","replies":[]}]},{"poster":"Este No Es Zelos","date":"2019-07-08T17:19:55.027+0000","up_votes":3,"down_votes":3,"body":"Mute all y a divertirte man, no jugamos para ellos, jugamos para nosotros.\n\nNo se si sigue funcionando pero podes cargar la pasiva de rengar en las plantas, por ejemplo la explosiva del inicio.","replies":[{"poster":"ForMySword","date":"2019-07-08T17:35:42.789+0000","up_votes":1,"down_votes":0,"body":"gracias man lo intentare y gracias por el consejo te agradezco esper que este jugador reciba sancion","replies":[]}]},{"poster":"Alba Meira","date":"2019-07-08T18:13:36.416+0000","up_votes":1,"down_votes":1,"body":"Jajajjaajajajajajajajajaja lpm tipazo el lucian, ademas era mas malo que vos. Como sea, el juego es y sera siempre asi de toxico, tenes dos opciones; 1-Mute all 2-Reirte","replies":[]}]}