{"poster":"affogalaloffa","date":"2016-08-09T14:19:38.726+0000","title":"LeaverBuster inutile","subforum":"Aiuto e supporto","up_votes":4,"down_votes":1,"body":"Salve a tutti,\r\nnon capisco come mai, debba essere punito con il LeaverBuster per problemi di connessione oppure per problemi con il server di LOL, perci&ograve; non per colpa mia dato che non lascio le partite \r\na parer mio dovreste controllare il motivo per cui la gente abbandona (o non inizia proprio le partite) cos&igrave; evitereste di punire i giocatori per dei problemi creati da LOL.","replies":[{"poster":"BeardSergio","date":"2016-08-09T14:24:09.981+0000","up_votes":3,"down_votes":1,"body":"Ciao!\nCome gli altri n mila giocatori prima di te ricordo che i problemi di connessione,blackuout,pc che crasha, nonna che stacca la spina mentre passa l'aspirapolvere etc. sono tutti considerati come a carico del giocatore.\nQuesto succede perchè è impossibile tracciare o rilevare se si tratta di un imprevisto o di un'azione volontaria.\nRiguardo ai server di lol ti ricorco che leavebuster non scatta in caso di malfunzionamento causato da riot.\nFossi in te mi accerterei di avere una connessione stabile e un pc,rete elettrica e nonna performante.","replies":[{"poster":"Kim114","date":"2016-08-09T14:29:25.856+0000","up_votes":2,"down_votes":1,"body":"anchio mi sono sempre lamentato, poi l ho vista dal vostro punto di vista\npoi mi sono lamentato di nuovo xke hanno appiccato fuoco alla centralina che mi da energia e mi hanno dato 5 code da 20","replies":[{"poster":"BeardSergio","date":"2016-08-09T14:34:54.851+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Kim114,realm=EUW,application-id=98NGV4Al,discussion-id=sGxJBeoI,comment-id=00000000,timestamp=2016-08-09T14:29:25.856+0000)\n>\n> anchio mi sono sempre lamentato, poi l ho vista dal vostro punto di vista\n> poi mi sono lamentato di nuovo xke hanno appiccato fuoco alla centralina che mi da energia e mi hanno dato 5 code da 20\n\nPer quel che ne so potresti aver dato fuoco tu alla centralina per leftare una ranked XD","replies":[{"poster":"Kim114","date":"2016-08-09T15:38:14.097+0000","up_votes":3,"down_votes":0,"body":"si io sono qui a casa mia e la centralina  CHE SI TROVA A 400 KM A NORD","replies":[]}]}]},{"poster":"affogalaloffa","date":"2016-08-09T22:17:13.356+0000","up_votes":2,"down_votes":0,"body":"la mia connessione va come gli gira, o funziona perfettamente o lagga così tanto da generare un torneo di bestemmie. detto ciò, mi capita ogni tanto che lol mi dica che c'è un problema sconosciuto ecc., perciò ho pensato che potesse essere un problema di riot, dato che quando non va la connessione escono scritte differenti. vi ringrazio comunque per le risposte;)","replies":[]}]},{"poster":"Dr LouD","date":"2016-08-09T16:22:05.505+0000","up_votes":1,"down_votes":3,"body":"Quindi se a te salta la connessione ma settordici milioni di giocatori continuano tranquillamente a giocare è colpa della Riot\n\nOkkei...","replies":[]}]}