{"poster":"CRIMeM0NKEY","date":"2016-03-23T09:01:01.522+0000","title":"\"InGame Chat\" mit einer Taste deaktivieren.","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":2,"body":"Habe mal schnell die Game-Option &uuml;berflogen, und irgendwie die &quot;In Game Chat&quot; Deaktivierung nicht gefunden. Kann mir da einer Bitte schreiben, wie ich dies tun kann? \r\n\r\nMir geht es nicht um den Auswahl-Chat oder dem End-Chat. Mir geht es nur um den &quot;In Game Chat&quot;. \r\n\r\nDas &quot;Warum?&quot; dazu, brauch ich nicht erkl&auml;ren. Jeder weis die Antwort. Zudem m&ouml;chte ich &quot;nicht&quot; jeden auf Ignorieren setzen. Die Liste w&uuml;rde mit der Zeit zu lang werden. \r\n\r\nAlso wo muss ich den Hacken setzen? Oder welche Taste ist f&uuml;r das deaktivieren des Chats gedacht? \r\n\r\nAlternative: Die Kommunikation geht meistens &uuml;ber Ping sehr gut, wenn der Spieler nicht gerade ein Zittrigen Finger hat.  (Ping! Ping! Ping! Ping! ....!) \r\n\r\nW&auml;re f&uuml;r eine Antwort dankbar. {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Humpelstilzche","date":"2016-03-23T09:04:07.085+0000","up_votes":2,"down_votes":0,"body":"Es ist nicht möglich den Chat zu deaktivieren.","replies":[]},{"poster":"Lematique","date":"2016-03-23T13:11:36.705+0000","up_votes":1,"down_votes":0,"body":">Jeder weis die Antwort. Zudem möchte ich \"nicht\" jeden auf Ignorieren setzen. Die Liste würde mit der Zeit zu lang werden. \n\nDie Ignoreliste hat mit /mute all nichts zu tun, oder irre ich mich?","replies":[{"poster":"CRIMeM0NKEY","date":"2016-03-24T14:57:56.257+0000","up_votes":1,"down_votes":0,"body":"Japp, Hab es getestet und bemerkt, dass \"/mute all\" nur für das aktuelle Spiel gilt.  Super Sache.","replies":[]}]},{"poster":"CRIMeM0NKEY","date":"2016-03-23T09:39:22.683+0000","up_votes":1,"down_votes":0,"body":"Die Kommunikation geht auch über Kartensignale /-Symbole. \n\nPersönlich fühle ich mich betroffen, wenn schwächere Spieler in unserer Gruppe durch Gruppenmitglieder angegriffen werden. Meine Konzentration lässt nach, und der Gedanke... \"wir schaffen es wahrscheinlich nicht\" wächst. Eigentlich könnte man nach der ersten negativen Aussage im Chat, das Spiel beenden. \n\nHab schon versucht, den Chat selbst zu ignorieren, aber dann schaut man doch drauf und fängt unbewusst/unabsichtlich an zu Trollen. Im Kriegsfall würde ein Kommandant sagen: \"Die Moral der Truppe fängt an zu sinken. Und ohne Moral gewinnt man kein Krieg (oder Spiel). \n\nAber erstmal Danke für die guten Tipps. Werde das /mute all  mal testen und dass mit dem Chat verschieben. \n\n{{sticker:zombie-brand-clap}}","replies":[]},{"poster":"Prophet Kola","date":"2016-03-23T09:17:54.524+0000","up_votes":1,"down_votes":0,"body":"Das geht nicht, diese Option gibt es nicht. \n-1: Drücke Enter\n-2: Ziehe den Chat oben am Balken aus dem Bildschirm nach untern techts oder links.\n-3: Drücke erneut Enter.\n\nIch habe das eine Zeit lange auch gemacht aber ich kann es nichtmehr epmfehlen. Ich habe nach der Zeit bemerkt, dass ich den Chat bracuhe. Kommunikation ist das A und F (der Rest ist G bis O :P)","replies":[{"poster":"Prophet Kola","date":"2016-03-23T09:19:09.601+0000","up_votes":1,"down_votes":0,"body":"Du brauchst auch keine Angst wegen Reports zu haben, wenn du deine Pings setzt, gilt das für Riot als kommunikation.","replies":[{"poster":"FrankerX","date":"2016-03-23T09:28:15.184+0000","up_votes":1,"down_votes":0,"body":"du musst weder pingen noch schreiben und wirst nicht gebannt.\nedit: aber es ist zu empfehlen :D muss ich zustimmen","replies":[{"poster":"Freefall013","date":"2016-03-23T09:36:39.678+0000","up_votes":1,"down_votes":0,"body":"Trotzdem ist es wichtig mit dem Team zu kommunizieren, sei es nun durch Pings oder den Chat. Unterlässt man dies, ist es durchaus \"reportable\". Gebannt wird man dadurch nicht direkt, aber man ist im System bereits negativ vermerkt, was bei weiteren Reports in anderen Kategorien schneller zu Strafen führen kann.","replies":[]},{"poster":"Prophet Kola","date":"2016-03-23T09:36:23.407+0000","up_votes":1,"down_votes":0,"body":"Dennoch wäre das durchaus zu epmfehlen.","replies":[]}]}]}]},{"poster":"Maíko","date":"2016-03-23T09:05:33.692+0000","up_votes":1,"down_votes":0,"body":"soweit ich weiß funktioniert der Befehl /mute all\n\nAnsonsten gibt es keine Möglichkeit, da du mit deinem Team kommunizieren sollst.","replies":[]}]}