{"poster":"Wolf Husky","date":"2018-04-22T14:27:08.090+0000","title":"Wie kann ich Tilt vermeiden?","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Ich hab mich mal im &Uuml;bungsmodus begeben, urspr&uuml;nglich um das Lasthitten zu &uuml;ben. Doch bald wurde diese &Uuml;bung zum Kampf: wenn ich nur 1 Lasthit verfehlt habe, hab ich schon angefangen, leicht zu tilten. Und somit fing das &quot;Tilt-snowball&quot; an. Dadurch habe ich nat&uuml;rlich mehr Lasthits verfehlt und bin noch aggressiver geworden und irgendwann hab ich die &Uuml;bung einfach abgebrochen. Mein Fazit: ich verfehle 10-12% der Lasthits(ohne bots etc.) und bekomme ein hohes tiltlevel. Wenn ich ruhig geblieben w&auml;re, h&auml;tte ich vllt nur 7-8% verfehlt.\nDas Problem hier ist nicht das langfristige &quot;unterdr&uuml;cken&quot;, sondern der kleine Impuls wenn man den Lasthit verpasst. Dadurch, dass es eine unterbewusst chemische Reaktion(Hormone) ist, ist es f&uuml;r mich sehr schwer zu vermeiden. Erst wenn sich der tilt sich langsam aufgebaut hat, bringt es dann einem dazu, die &Uuml;bung abzubrechen. Denn schon beim dritten Durchlauf hatte ich eine Missrate von 15%.\nDie &Uuml;bungen hab ich mit Corki mit runen und mit der Sichel durchgef&uuml;hrt, und zwar immer 10 Minuten lang.(Also insgesamt k&ouml;nnte man 107 Minions erreichen).\n\nWisst ihr eine Taktik, wie man nicht so stark tilted? Zur Erinnerung, die kleinen Impulse, wenn du ein Lasthit verfehlst, sind das Problem!\n\nDanke im Vorraus, Euer Wolf7Husky","replies":[{"poster":"Dr Madscientist","date":"2018-04-22T15:44:48.735+0000","up_votes":3,"down_votes":0,"body":"du...brauchst wirklich einen ausgleich, wenn sowas dich schon aufregt.","replies":[{"poster":"x IP a IN iC x","date":"2018-04-22T18:27:13.302+0000","up_votes":1,"down_votes":1,"body":"Natürlich regt es ihn auf. Vllt. verstehst du es nicht, weil du silber 3 und ein support main bist XD","replies":[{"poster":"Dr Madscientist","date":"2018-04-23T10:45:21.937+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=x IP a IN iC x,realm=EUW,application-id=YnZkMR0R,discussion-id=3yraxZnh,comment-id=00010000,timestamp=2018-04-22T18:27:13.302+0000)\n>\n> Natürlich regt es ihn auf. Vllt. verstehst du es nicht, weil du silber 3 und ein support main bist XD\n\nstimmt. mir sind meine Lasthits relativ bummsfalara.","replies":[]}]}]},{"poster":"HotxPepperino","date":"2018-04-25T16:15:07.462+0000","up_votes":1,"down_votes":0,"body":"Ganz einfach(natürlich nicht hehe ) wenn du das Spiel als Spiel ansiehst, somit bekommt du eine Art von Distanz zum Spiel. \nWenn das Spiel dir kein Spaß macht und du nur das \"Climben\" vor dem Auge hast, wird dies auch nichts, da du nur den Fokus aufs Gewinnen legst und nicht daran wirklich besser zu werden. \n\nIrgendwelche Fehler usw... könnt ihr behalten, war ein spontaner Kommentar. {{sticker:slayer-jinx-catface}}","replies":[{"poster":"King ProwIII","date":"2018-04-25T19:24:02.399+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HotxPepperino,realm=EUW,application-id=YnZkMR0R,discussion-id=3yraxZnh,comment-id=0005,timestamp=2018-04-25T16:15:07.462+0000)\n>\n> Irgendwelche Fehler usw... könnt ihr behalten, war ein spontaner Kommentar. {{sticker:slayer-jinx-catface}}\n\nGut, kriegst du halt nix davon ab.","replies":[]}]},{"poster":"Crafty776","date":"2018-04-22T17:55:16.302+0000","up_votes":1,"down_votes":0,"body":"Wenn man ggf. Psychologe wäre, würde man sagen, arbeite an deiner Einstellung. Als KVTler würde man bestimmt sogar sagen ändere deine Denkmuster im Hinblick auf das Lasthitting.\n\nTilten ist ein Ausdruck von Unvermögen. Das ist das Schwierigste für jeden einzelnen Menschen. Sich selbst einzugestehen, dass man etwas nicht kann.\n\n\"Ich bin zu schlecht um diese 4 Idioten durch das Game zu carrien\".\n\"Ich bin zu schlecht um 100% meiner Laningphasen unabhängig vom Pick zu dominieren\".\n\n\"Ich bin zu schlecht um alle 100% der Lasthits zu holen\".\n\nStrugglen tut jeder. Gerade die die sich durchgesetzt haben und erfolgreich wurden, haben genauso oder viel mehr Probleme gehabt als andere. Man wächst mit seinen Fehlern. Die Grundeinstellung ist dass was X von Y unterscheidet. X geht weiter, trotz der Hindernisse, Y stuckt und gibt nach Versuch 100 auf.\n\nNeurobiologisch trainiert X weiter sein Gehirn beim lasthitting, während Y stagniert weil er nicht trainiert, auch im Hinblick auf die Einstellung. Wer wird in 2 Monaten das bessere Lasthitting haben?","replies":[{"poster":"TwistedZiggs03","date":"2018-04-22T18:22:36.199+0000","up_votes":1,"down_votes":0,"body":"Ich denke mal man sollte sich da garnicht so sehr reinsteigern außer man will profesioneller LoL-Spieler werden. Es ist im Prinzip nur ein Spiel und jeder macht Fehler/ hat Schwächen in anspruchsvollen Spielen. Also häng dich da nicht zu sehr rein, da du sonst echt tilten kannst. \nTrainier einfach weiter...mit der Zeit wird das werden.","replies":[{"poster":"Wolf Husky","date":"2018-04-23T15:53:42.210+0000","up_votes":1,"down_votes":0,"body":"Da muss man sich allerdings entscheiden: entweder, man schätzt die Lasthits als sehr wichtig und hat spaß daran, sie zu bekommen, oder sie sind einen egal und man kein Verlangen sie zu bekommen, was wiederum dazu führt, dass das Spiel sehr wenig spaß macht.\nIch würde lieber weiter die Lasthits wichtig schätzen, weil es eines der wenigen Sachen ist, das mein Behlonungszentrum aktiviert.(in andern Worten was dich Glücklich macht, wenn du sie bekommst :) )","replies":[{"poster":"Dr Madscientist","date":"2018-04-23T16:16:00.489+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wolf Husky7,realm=EUW,application-id=YnZkMR0R,discussion-id=3yraxZnh,comment-id=000200000000,timestamp=2018-04-23T15:53:42.210+0000)\n>\n> Da muss man sich allerdings entscheiden: entweder, man schätzt die Lasthits als sehr wichtig und hat spaß daran, sie zu bekommen, oder sie sind einen egal und man kein Verlangen sie zu bekommen, was wiederum dazu führt, dass das Spiel sehr wenig spaß macht.\n> Ich würde lieber weiter die Lasthits wichtig schätzen, weil es eines der wenigen Sachen ist, das mein Behlonungszentrum aktiviert.(in andern Worten was dich Glücklich macht, wenn du sie bekommst :) )\n\nso nicht richtig.\nMir sind, wie gesagt, meine Lasthits relativ schalalalalalabanga.\nUnd ich hab dennoch viel Spaß am spiel (meistens).\nWas die Ausschüttung von Hormonen die dich Glücklich machen angeht (sprich dein Belohnungzentrum aktivieren), so gilt zu beachten, dass diese IMMER auch einen hormonellen Gegenspieler haben und deren Wirkung zu hemmen.\nIn der Regel werden diese durch Stress vermehrt ausgeschüttet, was nun auch dein Problem erklärt: \ndu machst dir für das was du erreichen willst zu viel Stress. Der Stress, den du dir selbst machst um etwas was du als positiv empfindest zu erreichen ist größer als das positive Gefühl, dass du beim erreichen hast.","replies":[]}]}]}]},{"poster":"Schokohörnchen","date":"2018-04-23T06:56:25.061+0000","up_votes":1,"down_votes":0,"body":"Am Wochenende ist es mir tatsächlich bei **SoulWorker** passiert, dass ich richtig abgefuckt war x.x Und dann nicht nur mal eben so ein bisschen. So sehr, dass ich wieder League gespielt habe!\n\nIch wollte halt Instanzen laufen. Kampfareale, wie auch immer. Erst im normalen Modus, dann hart und zu guter Letzt natürlich **MANIA** :'D Natürlich solo. Ich liebe es alleine zu spielen! Und wenn ich eine Gruppe brauchen sollte, gibt es dort eine \"automatische Teamsuche\". Mit etwas Glück findet man dann ein oder zwei randoms. Dann geht das easy von der Hand. Ich hab halt im \"Mania Modus\" Probleme mit den Bossen.\n\nEs gibt eine Instanz/ ein Kampfareal, dass besteht aus Puppen und eins aus Clowns! Toll wenn man fast Panikattacken bekommt bei letzterem, da man Angst vor diesen Kackviechern hat. Um so schöner das man sie töten kann. Oder könnte.\n\nDas Problem war... Ich komme fast easy durch alles durch, auch im \"Mania\" Gedöns. Kleinere Bosse tun schon mal weh, aber ich lerne ja noch auszuweichen und mit dem Stamina zu arbeiten! Es macht einfach höllisch Spaß gefühlte 150 Gegner gleichzeitig zu eliminieren. Bis man dann auf einmal vor dem Boss steht x.x \n\nIch hab meiner kleinen schon goldenes Zeug gefarmt. Einfach damit sie mit den Gegner mithalten kann und nicht umfällt wie eine Fliege. Und trotzdem hat mich dieser Puppen-Boss manchmal so fertig gemacht, dass ich keinen Bock mehr hatte dieses coole legendäre Schwert zu farmen x.x von dem Clown will ich gar nicht erst reden. Clowns sind der letzte Abschaum und das schlimmste das es gibt auf dieser Welt... und den krieg ich nicht mal getötet. Zwei von sechs Mal oder so >.<\n\nJetzt hab ich vergessen was ich eigentlich schreiben wollte...\n\nUff x.x dieser Clown macht mich echt fertig!","replies":[]},{"poster":"King ProwIII","date":"2018-04-22T19:13:17.531+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=eY52Zsg-KVI&t=4552s\n\nBegib dich in die Arme der heiligen Antje :D","replies":[]},{"poster":"x IP a IN iC x","date":"2018-04-22T15:34:57.307+0000","up_votes":2,"down_votes":2,"body":"Tilt doch einfach, macht spaß :D. Vllt musst du einfach die Einstellung von dir verändern.","replies":[{"poster":"Wolf Husky","date":"2018-04-22T15:43:46.100+0000","up_votes":1,"down_votes":1,"body":"Ich würde vllt nicht tilten, wenn die Lasthits mir nicht wichtig wären. Aber wenn sie mir dann nicht wichtig sind, habe ich auch kein Spaß daran zu lasthitten bzw. zu üben. Und im Spiel gehts ja um spaß :)","replies":[{"poster":"TwistedZiggs03","date":"2018-04-22T18:00:26.389+0000","up_votes":1,"down_votes":0,"body":"Ich denke mal das ist relativ normal...gerade in den höheren Elo´s will man einfach jeden Farm bekommen und es regt einen extrem auf, wenn der Gegner besser Last-Hittet und somit auch besser ins Game kommt.\nIch denke das ist einfach eine Sache der Übung, auch wenn du manchmal tilten wirst. Irgendwann hast du den Ground Dmg von deinem Champ einfach drauf und weißt genau wann du das Minion Attacken kannst, um den Last-Hit zu erreichen.\nMein Tipp falls du diesen nicht schon anwendest: Spiele lieber 2-3 Champions perfekt als 20 Champions so mittelmäßig gut, denn so kannst du wie gesagt den Ground Dmg besser abschätzen und außerdem gewinnst du die Lane zu sagen wir 85%. \nIst alles eine Sache der Übung.","replies":[]}]}]}]}