{"poster":"TEA Pandaman","date":"2018-08-09T08:04:37.392+0000","title":"Toplane-Coach gesucht","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Heyho und Guten Morgen!\r\n\r\nIch suche einen Toplaner-Coach, der mir in der aktuellen Meta und sonst hilft, da ich aktuell in einem Team spiele und mit mir noch unzufrieden bin (u.a. Counter, passender Auswahl f&uuml;rs Team finden und TF)\r\n\r\nZu mir:\r\n\r\n- G5 (SoloQ) und S2 (FlexQ)\r\n- diese und letzte Season mehrheitlich auf der Toplane gespielt\r\n- grunds&auml;tzlich jeden Abend on, wenn nichts anderes geplant ist und ich Lust habe\r\n- Champ-Mains: Olaf, Ornn, Sion, Voli und Malph\r\n- Champ-Pool: Kled, Cho, Mundo, Garen, Illaoi, Nauti, Renek, Panthe, Nasus, Poppy, Singed, Trundle und Wu\r\n- Champs, die ich trainiere: Gang &amp; Camille \r\n- hab sowohl TS und Discord\r\n\r\nBei Interesse hier kommentieren oder ing TEA Pandaman adden, danke ;)","replies":[{"poster":"CastielMid","date":"2018-08-09T09:44:18.238+0000","up_votes":1,"down_votes":0,"body":"Ich empfehle dir deinen Championpool erstmal anzupassen. Folgende Champions solltest du aktiv spielen in der Reihenfolge: Gnar, Mundo, Camille und ggf Shen. Alle Champions sind gerade sehr gut in der Meta und bieten viel fürs Teamplay. Folgende Chammpions aus deinem Pool solltest du nicht mehr spielen: Volibear, Olaf, Garen, Illaoi, Nautilus, Pantheon, Nasus, Singed, Trundle, Wukong, Kled. Sion, Ornn und Maphite sind gerade auch nicht sondernlich stark und sehr situationsbedingt.","replies":[{"poster":"Diktator","date":"2018-08-09T13:29:10.714+0000","up_votes":1,"down_votes":0,"body":"Wat laberst du? xD\nZusammenfassung hör auf Meta zu zocken und spiel dieses 4 \"Gnar, Mundo, Camille und ggf Shen\" kackchamps mit denen du in SoloQ sowieso nichts reißen wirst. Nagut, camille ist in Ordnung","replies":[{"poster":"CastielMid","date":"2018-08-09T13:57:56.806+0000","up_votes":1,"down_votes":0,"body":"450 Games Gold 4 und hat die Rechtsschreibung eines Drittklässlers. Wenn du diese Champs spielen kannst dann bist du gut gewappnet für das Teamspiel. Und \"Diktator\" wenn du mal diskutieren willst dann adde mich ingame und wir diskutieren mal warum ich recht habe und du nicht.","replies":[{"poster":"Diktator","date":"2018-08-09T16:03:13.004+0000","up_votes":1,"down_votes":0,"body":"klar mache ich","replies":[]}]}]}]}]}