{"poster":"SHIA LABE0UF","date":"2016-07-16T15:44:06.404+0000","title":"Legacy mode?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Now im not the only person to think how cool it would be to play League like it was back when league was first released, not only would it show newer players like myself, how league evolved, but also would make you appreciate just how balanced champs are these days compared to original TF, Jax and Hiemerdinger. What do you guys think?","replies":[{"poster":"SKT T1 Taehoon","date":"2016-07-17T04:02:57.388+0000","up_votes":1,"down_votes":0,"body":"heimerdonger of as we know him today the imaQTpie champion known as the donger was more broken in seasons 1-2 than what he is now he could have 5 turrets placed so rip any fiora mains if riot bring this mode into play .\n old jax in season one i think patch 71 had his reflect removed as it was to broken and today riot still cant make jax right","replies":[]},{"poster":"DipperOCE","date":"2016-07-16T17:08:47.737+0000","up_votes":1,"down_votes":0,"body":"I've though about a game mode where every champion was changed back to release, to see all the broken champs and all the underpowered releases lined up. And we would change all the items back to when they first released, and we would change summoner's rift back to the old design as well.\n\nPart of this is because I found the game funner back in Season 3 when tanks were still really strong, but they didn't do ridiculous damage and could be 1v1ed by tank duelers OTHER than Vayne. They could actually be 1v1ed by any damage carry, but they could tank a lot of damage in team fights.\n\nNowadays with all the base damage and tank scaling things like Iceborn combined with the fact that most tanks either have ridiculous base damage or have max health / armor scalings, they are just more favorable than a top laner like Tryndamere or Fiora, and more favorable than supports like Soraka or Sona. \n\nIt was a lot more fast paced back then, but still was relatively balanced, minus champs like Zed and Riven, but at least they were actually squishy and didn't have all these crazy builds to protect them.\n\nYeah I would love something like this, though it will never happen.","replies":[]}]}