{"poster":"Mer1ino","date":"2018-11-12T09:55:18.457+0000","title":"Come salire plat giocando unicamente support","subforum":"Discussioni generali","up_votes":5,"down_votes":1,"body":"Qualche consiglio da parte di qualcuno che ce l&#039;ha fatta a salire plat usando supp (__**solo esperienze personali per favore**__, le storie di vostro cugggino mi interessano ben poco).\r\nSono bloccato in gold da troppo tempo, ma sto perdendo la fede ormai.","replies":[{"poster":"Dr LouD","date":"2018-11-12T10:27:12.350+0000","up_votes":5,"down_votes":1,"body":"Support aggro.\n\nPyke, Zyra, Brand.\n\nItem per le ward e poi full danno.","replies":[{"poster":"Mer1ino","date":"2018-11-12T11:54:55.033+0000","up_votes":2,"down_votes":3,"body":"Però nella meta attuale i tank vincono, e spesso mi ritrovo con un top fighter e un jungler assassin e se vado support aggro mi ritrovo un team senza tank. e se poi la lane va male tutti a dare la colpa al supp che non fa peel per l'adc (quei adc bambi che non riescono a stare in vita 2 secondi da soli)","replies":[{"poster":"Dr LouD","date":"2018-11-12T14:14:09.343+0000","up_votes":2,"down_votes":1,"body":"Giocando un supp carry non sei mica tenuto a preoccuparti della vita degli altri","replies":[{"poster":"sbepuz97","date":"2018-11-12T14:40:19.047+0000","up_votes":3,"down_votes":1,"body":"ehm perdonami. ma tu non hai idea di cosa sia la bot lane. si legge dal commento fatto a me\n\n1)giochi brand per carriare. se tu o il tuo adc morite entro lev 3/4, ne basta uno dei due che muore. lo svantaggio è già enorme\n2) se prendendo per prima il lev 6 la bot nemica vi riuccide, ecco che l'apc supp bot e l'adc saranno inutili\n\nla legge del: brand o zyra fanno danni anche da non feedati; non regge. in quanto il tuo adc è un minion, il jungler nemico può abusarvi, visto che non avete escape e tu \"brand\" come subirai 1 cc eploderai senza usare 1 abilità\n\nun champ con cc anche se finisce indietro basta che prende quel cc ed il game è recuperato, un brand indietro è un minion che non sa dove andare","replies":[{"poster":"Dr LouD","date":"2018-11-12T14:54:44.420+0000","up_votes":1,"down_votes":0,"body":"Guarda che stiamo parlando di consigli per il gold 5, non per il diamond..","replies":[{"poster":"sbepuz97","date":"2018-11-12T16:39:25.466+0000","up_votes":2,"down_votes":0,"body":"giustappunto. gli stai consigliando un brand zyra che come vanno out of position muoiono e perdono il game.\n\nse sono capaci di prendere i grab salgono molto più facilmente, in quanto portano utility e danno allo stesso tempo. non faranno danno ai tank, ma fidati che un thresh in lane mena che è un piacere, anche in diamond in alcuni game non è cosa rara essere 3* in danno con thresh","replies":[]}]}]}]}]}]},{"poster":"sbepuz97","date":"2018-11-12T11:37:09.504+0000","up_votes":4,"down_votes":1,"body":"sinceramente il mito del: gioca cose che fanno danno per salire support...credo sia un mito che non ha mai portato grandi risultati\n\nse te la cavi con gente che usa grab utilizzali con le build corette e vedrai che sali senza problemi. la gente si scorda che il danno senza un buon peeling e dei cc è intuile in questo gioco","replies":[{"poster":"Dr LouD","date":"2018-11-12T14:18:39.169+0000","up_votes":1,"down_votes":0,"body":"Anche fare peeling per gente senza mani non ha mai portato tanto lontano tho..\n\nE, da toplaner, ne so qualcosa. (Maledetto meta tank)","replies":[{"poster":"sbepuz97","date":"2018-11-12T14:35:44.533+0000","up_votes":1,"down_votes":0,"body":"sinceramente un buon engage/disengage carria i game\n\nfare peeling anche per un senza mani aiuta, se sono 4 senza mani la cosa non cambia. se focussano te pure un senza mani che non sa kaitare riesce a fare un minimo di danno\n\nla top adesso non è obbligatoriamente tank, vedi urgot/aa/irelia, e per di più in soloq per quanto riguarda la top in particolare champ come jax non spariranno mai","replies":[]}]}]},{"poster":"midoniano","date":"2018-11-13T10:09:25.362+0000","up_votes":2,"down_votes":0,"body":"se non fai morire quei maiali dei tuoi compagni sei già a metà dell’opera, nami premi W e fa tutto da sola devi giusto posizionarti bene, se non hai tank in team prendi leona","replies":[]},{"poster":"Lovecrank","date":"2018-11-13T10:07:04.774+0000","up_votes":2,"down_votes":0,"body":"con blitzcrank fino al p5 non dovresti avere problemi","replies":[]},{"poster":"U0M0 F0CACCINA","date":"2018-11-13T05:39:05.598+0000","up_votes":2,"down_votes":0,"body":"devi usare quello che ti senti. inutile dirti  pyke se dopo sei scarso con quel champ. io personalmente ho usato molto thresh nel secondo account. ma anche janna,bard,rakan,braum. usa quelli con cui hai più dimestichezza. per quanto mi riguarda thresh è il supporto perfetto. difficile da counterare, se sai giocarlo bene ti porta anche delle soddisfazioni. arrivato plat 5 divertendomi","replies":[]},{"poster":"Kebab4all","date":"2018-11-13T01:57:04.012+0000","up_votes":2,"down_votes":0,"body":"Secondo me i support migliori per carryare sotto il diamond sono playmaker come thresh, leona, bard, pyke oppure apcarry tipo vel'koz, brand, zyra. Se non sei in premade con il tuo adc prendere un champion come soraka, janna è un rischio, se sei fortunato e ti trovi un adc che sa posizionarsi possono funzionare però se trovi un adc senza mani diventa molto difficile carryare rispetto ad un playmaker oppure un apc che anche se il tuo adc è molto scarso possono trovare altri modi di carryare un game. Nel caso del playmaker puoi roammare e gankare altre lane oppure aiutare il tuo jungler a prender vision e nel caso invadere. Nel caso invece del apc nella maggior parte dei game puoi letteralmente vincere la lane da solo sei conosci bene i tuoi danni e hai un buon positioning. Io personalmente questa season ho giocato perlopiù vel'koz e bard con ottimi risultati","replies":[]},{"poster":"astenar","date":"2018-11-12T15:52:50.750+0000","up_votes":2,"down_votes":0,"body":"Esperienza personale, questa season sono arrivato a 88 lp gold 1 2/3 volte e reputo che se avessi affrontato con più calma le partite successive probabilmente sarei arrivato platino( vedremo l anno prossimo se sarà così). \nNon c è una categoria di support migliore per salire, sono salito giocanda blitz, pyke, bard, tham... devi trovare il support che ti piace e imparare a giocarlo. Le partite che giocavo bene in generale le vincevo, quelld che giocavo male in generale le perdevo. \nGira sempre intorno allo stesso discorso migliorarsi. \nTi senti migliorato abbastanza per salire platino?\nOpinione personale è che migliorare come support non è altrettanto facile che migliorare negli altri ruoli. In altri ruoli molte volte basta migliorare le proprie meccaniche per salire in eli più bassi, mentre questo col support non basta più, bisogna imparare altre cose, in cui molte volte è difficile trovarne un riscontro finchè non giochi contro un support molto superiore a te. Come ad esempio wardare.\nIn più bisogna saper fare la cosa più difficile di tutte, cooperare fin dai primi minuti. Anzi in molti casi il tuo unico modo per vincere è saper cooperare. Un assasin in vantaggio può uccidere due persone un support in vantaggio può piazzare più ward o dare più utilitá. \nQuindi essenzialmente gli sforzi in support sono più difficili da realizzare. \nMa non demordere e iniziare a incolpare il team, pensa sempre dove potevi fare meglio e soprattutto quali partite hai perso per colpa tua, dove te eri l ago della bilancia ma non lo sei stato. Così migliorerai e salirai.","replies":[]},{"poster":"Lıcky","date":"2018-11-12T10:59:07.868+0000","up_votes":2,"down_votes":1,"body":"+1 DR LouD\nAttualmente i champ support che possono, non solo aiutarti a salire, ma soprattutto a carryare la partita sono questi: Soraka, Pyke, Zyra, Brand, Sona. Personalmente ho spammato molto Soraka prima di arrivare Platino (soprattutto tra il Gold 1 e il Platino), ho giocato anche un po' mid, ma il mio main role questa season è stato Support. \nPersonalmente ti consiglio di guardare un dei miei game (Solo q) e capire soprattutto le priorità di un support: warding, supporto al carry del team, pressione in lane, roaming, ping intelligenti (es. il jungler è top e c'è un bell'Infernal free, fai un bel ping e fai capire al team che al momento la priorità è quella). Uno dei champ che non ho citato, tra l'altro il mio main champ, è Janna; Non perché attualmente usarlo non ti aiuterebbe ma anzi, se usato bene (e per bene intendo molto bene) può esserti di grande aiuto. Ma visto che è l'ultimo giorno, ti consiglio di usare i champ sopracitati soprattutto quelli che fanno molto danno --> Brand, Pyke, Sona e perché no Zyra. \nTi faccio i miei auguri, non mollare fino alle 23:59!","replies":[{"poster":"Mer1ino","date":"2018-11-12T12:02:04.105+0000","up_votes":1,"down_votes":0,"body":"Ward sono molto bravo (penso), roaming invece faccio schifo, anche perché le poche volte che lascio l'adc da solo questo muore e naturalmente la colpa è mia. Però anche qui il problema è che oramai la gente non pensa piu al team, e quinid mi ritrovo con top e giungla fighter/assassin e se non picco tank la partita è persa in partenza (per me un team senza almeno un tank non può vincere). Proverò sona che ho visto che ha un buon WR (ed è facile da usare). Ormai questa season mi fermo ancora in gold, ma comincio a prepare i miei champ per la 9","replies":[]}]},{"poster":"Dantazzo","date":"2018-11-12T10:48:57.503+0000","up_votes":2,"down_votes":1,"body":"Io sono arrivato plat 2 giocando principalmente nami e lulu, in pratica entri in game, piazzi i cc, proteggi i carry e magicamente vinci.","replies":[{"poster":"Ðarkelle","date":"2018-11-12T16:58:15.181+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dantazzo,realm=EUW,application-id=MJVj50Jw,discussion-id=6aQf7bvg,comment-id=0001,timestamp=2018-11-12T10:48:57.503+0000)\n>\n> Io sono arrivato plat 2 giocando principalmente nami e lulu, in pratica entri in game, piazzi i cc, proteggi i carry e magicamente vinci.\n\nsame","replies":[]},{"poster":"Mer1ino","date":"2018-11-12T11:57:44.200+0000","up_votes":1,"down_votes":0,"body":"lulu in effetti carria bene, ma quando mi trovo contro un rangar/kha giungla mi ritrovo in difficoltà nel proteggere l'adc in late. Poi contro support agressivi come leo/ali/thresh se l'adc è un po bambo e si fa prendere lulu ha pochi tool per tirarlo fuori dai pasticci (si l'ulti, ma cd ulti vs cd grab il calcolo è presto fatto, l'adc muore due volte su 3)","replies":[]}]},{"poster":"PaPerino Stresso","date":"2018-11-13T15:06:48.736+0000","up_votes":1,"down_votes":0,"body":"cerca di giocare sempre gli stessi 2/3 champ, impara a wardare e fare roaming e soprattutto non dare la colpa agli altri","replies":[]}]}