{"poster":"Ðwayn","date":"2015-05-30T22:12:01.218+0000","title":"Jungla","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Alguien me puede recomendar alguna guia, youtuber, o darme consejos con respecto a la jungla? Ya que es mi peor rol y me gustaria aprender.. :D","replies":[{"poster":"SPiCY TENTACLES","date":"2015-05-30T22:17:42.930+0000","up_votes":3,"down_votes":0,"body":"No es el mejor junglero del mundo pero sus tácticas son razonables y se acomodan al meta actual. Te recomiendo que visites su canal.\n\nhttps://www.youtube.com/user/RevenantL0L","replies":[{"poster":"TDEI","date":"2015-05-31T00:35:18.544+0000","up_votes":2,"down_votes":0,"body":"Tambien busca a cabravoladora en yt que te tira varios consejos y tips para junglear. Suerte","replies":[]}]},{"poster":"Whitesse","date":"2015-05-31T01:05:24.059+0000","up_votes":2,"down_votes":0,"body":"El jungla en teoria es un support para todas las lineas. Pero, hay junglas asesinos y luchadores que necesitan kills para desarrollar sus items y hacer ganks mas fuertes, hacer contra jungla, objetivos mas rapidos etc.\n\nSi queres empezar a junglear empeza con Phanteon, Xin zhao o Udyr. Pierden poca vida, limpian normalmente rapido, tienen ganks en early buenisimos y 1v1 buenos.\n\nLas rutas es depende que campeon tengas, si es mana dependiente empezas en Sapo / blue. Si es de auto ataques empezas en golems / red.\n\nSi queres hacer contra jungla no vayas con tu red o blue buff. Hacete los golems o el sapo y anda al buffo rival si sabes que va a estar ahi, sino quitaselo y hace counter gank. Si las lineas rivales no se mueven cuando vas hacia la jungla rival no esta ward, si se mueven andate, no vale la pena arriesgarse por un buff que en early no te va a ayudar mucho.\n\nLos canales recomendados de youtube te diria que RevenantLoL y Cabravoladora Sin Nexos. Revenant es mas meta game y build destroyer y Cabra es full yolo 420 champs full ad.\n\nMaineo jungla y la verdad que todos los consejos que te pueden dar muy pocos te van a servir en las partidas ya que el jungler es uno de los que mas impacto tiene en la partida en early mid game y el early de cada partidas es distinto. Ya sea por un invade, una free kill como seria un Master Yi con smite y teleport etc.\nEl jungler no es como otro liner normal que farmea hasta lvl 3 para tradear, etc.","replies":[]},{"poster":"Doctor Rata","date":"2015-05-31T00:10:42.317+0000","up_votes":2,"down_votes":0,"body":"Solo tenes que saber una cosa si vas de jungla, si te echan la culpa de algo los muteas a todos y bueno seguís con los objetivos que tiene un jungla","replies":[]},{"poster":"TeCagoMatando1","date":"2015-05-30T22:16:31.362+0000","up_votes":2,"down_votes":0,"body":"Si quieres aprender lo mas importante es no dejarte influenciar por los ratitas que pierden linea y te echan la culpa, lo demas buscala en youtube xd {{champion:245}} {{summoner:14}} {{item:3089}}","replies":[]},{"poster":"Krilin Noda Oro","date":"2015-06-03T02:50:18.918+0000","up_votes":1,"down_votes":0,"body":"yo te recomendaria a nightblue3 o en youtube te metes a proreplays y buscas videos de junglas.","replies":[]}]}