{"poster":"HellsHaven","date":"2019-02-16T22:57:58.954+0000","title":"So, how did I get banned?","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"So, uh, this morning, for god knows what reason, I decided to dive back into the unknowable abyss we know as ranked. And after the first ever ranked game I've played in a while, I get slapped with a 14-day ban.\r\n\r\nThis is the first time I've gotten banned, I have not the foggiest idea what it's for. Maybe I just got too salty and got a bit overly toxic? Idk. There wasn't highlighted text or anything, and as all salty kids like me do, I feel like this didn't call for a ban. Can somebody tell me where in here stepped over the line? Thanks.\r\n\r\nGame 1\r\nPre-Game\r\nHellsHaven: oooh Thresh\r\nHellsHaven: can't go wrong\r\nHellsHaven: mostly\r\nHellsHaven: xD\r\nHellsHaven: :0\r\nHellsHaven: i am m7 thresh\r\nHellsHaven: xD\r\nHellsHaven: oof\r\nHellsHaven: Zilean mid is actually good xD\r\nHellsHaven: I'll join your discord, but I can't talk.\r\nHellsHaven: lol\r\nHellsHaven: lets do this thing\r\nHellsHaven: :D\r\nHellsHaven: lp is on the line\r\nHellsHaven: xD\r\nHellsHaven: I like their squishy botlane :0\r\nIn-Game\r\nHellsHaven: report Shaco\r\nHellsHaven: no skin\r\nHellsHaven: they prolly in there\r\nHellsHaven: that inferal nassu dance is so out of place\r\nHellsHaven: xX\r\nHellsHaven: xD*\r\nHellsHaven: %%%\r\nHellsHaven: %%%\r\nHellsHaven: xD\r\nHellsHaven: nice tag btw\r\nHellsHaven: :P\r\nHellsHaven: clan tag\r\nHellsHaven: :P\r\nHellsHaven: I have depression\r\nHellsHaven: xD\r\nHellsHaven: sry i fed, just leave mid lol\r\nHellsHaven: christ\r\nHellsHaven: nasus\r\nHellsHaven: pls caryr my ass\r\nHellsHaven: xD\r\nHellsHaven: rip\r\nHellsHaven: i do no damage\r\nHellsHaven: LOL\r\nHellsHaven: converted 2 taccs\r\nHellsHaven: we cant baron\r\nHellsHaven: and if they contest\r\nHellsHaven: we get fked\r\nHellsHaven: good shit\r\nHellsHaven: sorry, i fed very hard T-T\r\nHellsHaven: o.0\r\nHellsHaven: defend and let nassu split\r\nHellsHaven: rip\r\nHellsHaven: not worth\r\nHellsHaven: LOL\r\nHellsHaven: gw\r\nHellsHaven: lol\r\nHellsHaven: wait we have baron buff???\r\nHellsHaven: back and defend\r\nHellsHaven: NASSSU :000000\r\nHellsHaven: dont get caught out\r\nHellsHaven: alright\r\nHellsHaven: back\r\nHellsHaven: they dont have time to push before we respawn\r\nHellsHaven: peel them off nasus\r\nHellsHaven: yeah\r\nHellsHaven: fking tank the turrets xD\r\nHellsHaven: mm\r\nHellsHaven: aight\r\nHellsHaven: waht the\r\nHellsHaven: collapse\r\nHellsHaven: ggwp\r\n\r\nJust for context, I called the enemy Xerath a %%% after he towerdived and killed me, then died to tower. He told me to repeat it, so I did. xD That's why there's two '%%%'s in the chat.\r\n\r\nThat being said, I'll stop complaining and just wait it out, lol.","replies":[{"poster":"Project Xayah","date":"2019-02-17T02:48:53.178+0000","up_votes":3,"down_votes":1,"body":"So looking through the logs, I can only assume that the instances of \"%%%\" (which seems to have been automatically censored by the boards) are the term \"f-a-g\", in which case that would explain the 14-day ban. Ultimately, behaviours like homophobia, racism, suicide encouragement etc. are taken *very* seriously, and can definitely result in an immediate escalation to a 14-day ban. There's nothing stopping you from engaging in such behaviour in private (such as whispers/private messages), but you definitely shouldn't be doing it in team/all chat, that's just not acceptable. I'd recommend that you refrain from saying anything unless it's actually constructive/useful, as that will help you keep from crossing any lines.\n\nThough I doubt there would be any possibility that it would change anything in this case, you do have the option of appealing the punishment by submitting a ticket to [Support](https://support.riotgames.com/hc/en-us/requests/new) (use the \"Account suspensions or restrictions\" option) and seeing what they have to say about it.","replies":[{"poster":"HellsHaven","date":"2019-02-17T03:01:50.670+0000","up_votes":1,"down_votes":0,"body":"Thanks... Yes, '%%%' was indeed what you've said. I tend to use that as a go-to insult, I've actually used the insult in similar scenarios as the one I mentioned earlier. This, however, is the first time I've been received any form of repercussion or even a warning for it.\n\nI'll just wait out the 14-day ban, since I can imagine homophobia isn't taken very lightly. :P Of course, I'm still salty, but at least I won't be able to play league in class xD\n\nAnyways, thanks. Guess I'll have to use some other insult now :P","replies":[]}]}]}