{"poster":"Bjerg Ryuko","date":"2015-04-14T17:23:01.360+0000","title":"Porque las ranked me dan tension!!","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"Cada vez que intento jugar ranked todo bien pero ya para mi es un nivel mas de dificultad ya que casi no juego ranked, la cosa es que soy algo malo en las ranked ya que siempre hay gente que te insulta por fallar una m&iacute;nima cosa que hagas y te sigue insultando hasta que termina la partida, intento jugar para acostumbrarme la dificultad pero aun as&iacute; me mata la tensi&oacute;n, tantos insultos me llevo que ya casi estoy acostumbrado, ya gente dir&aacute;, &quot;porque sos un manco&quot; y si hace poco comenc&eacute; y estoy tratando de mejorar, eso me pasa, opinen los que sienten algo parecido.","replies":[{"poster":"Esguein","date":"2015-04-14T20:29:49.838+0000","up_votes":3,"down_votes":0,"body":"Las rankeds te dan tensión, por que son una EMOCIÓN :D","replies":[]},{"poster":"ScaylerElPescado","date":"2015-04-14T17:51:28.077+0000","up_votes":2,"down_votes":0,"body":"Lo mejor es estar siempre preparado.\n\nLo que podes hacer es lo siguiente.\n\n• Primero que nada, tener una mentalidad totalmente positiva, saber que, si ganas, ganaste aprendiendo algo, y si perdes, ganaste porque igual aprendiste algo.\n\n• A la primera que te insultan, silencialos, de esa forma ya no vas a saber que te están diciendo algo, y si te dicen algo, hablan solos porque no los lees.\n\n• Si hay alguien en tu team que va mal ayudalo alentándolo, decile que no haga caso de los otros que lo insultan y siga tratando que va a poder salir adelante\n\n• No todas las partidas las vas a ganar, siempre trata de recordar eso, para no sentirte frustrado.\n\n• Usa los campeones que más cómodo te queden, muchos a veces usan a Zed o a Yasuo porque están rotos o a X personaje porque es counter de X personaje enemigo, y eso los hace perder, es mejor usar a alguien con quién te desempeñas bien que con algo que esta roto pero no sabes usar.\n\n• Toma las ranked como si fuesen una normal más, solo que le pones más ganas y jugas dándolo todo, y obviamente, sin probar cosas.\n\nSaludos y espero que esto te ayude a salir adelante ;)\n\nAtte:\n\nScaylerElSusaneado {{champion:75}}","replies":[{"poster":"Jonshi","date":"2015-04-14T19:27:43.984+0000","up_votes":1,"down_votes":0,"body":"Yo recomiendo tambien que te sepas algunos counters de los champs (ponele, ok? Jugar con un champ es bueno, pero si practicas un counter de 2 o mas champs ya sabes que, si pickean un champ al que vos le haces counter, podes ganar tu lane.) Ademas mutear cuando te flammean es bueno, ya que ellos ven que el error ES TUYO y se enfocan mas en insultarte que en pushear o romear. Aprovecha tambien en pushear lanes que no esten muy pusheadas (ese error lo cometi una vez al no pushear top con el toplaner). Y enfocate en mejorar con normals. Otra cosa tambien es hacer algo de ejercicio antes de jugar (digamos, algo como para tener la mente clara y activa).","replies":[{"poster":"Revolución","date":"2015-04-14T20:33:42.284+0000","up_votes":2,"down_votes":0,"body":"Y sigue siendo algo relativo, es importante que elijas un campeón que pueda carrear o hacer buena sinergía con el equipo. Por ejemplo, a mí si me sacan un Zed mid mi primer opción es Lulu y en línea le gano con comodidad generalmente, pero Lulu mid es un pick que sin buen follow up no termina sirviendo al terminar la fase de líneas, no te digo nomás que si los 4 son un desastre no vas a carrear, necesitás que tengan una ligera idea para que ande bien. Ayer me pasó en una partida con Lulu tener un Cho' Gath que nunca estaba con el equipo y un Volibear jungla afk, pero entre Leona, Vayne y yo ganábamos todas las team fights, es un milagro encontrarse gente así de cualquier modo. En cambio, si tuviera dominada a Lissandra también debería tener una buena fase de líneas contra Zed, y el impacto de Lissandra en una partida donde los compañeros no sean totalmente incarreables es muy fuerte.","replies":[{"poster":"Jonshi","date":"2015-04-15T19:54:35.038+0000","up_votes":1,"down_votes":0,"body":"Este... Los counters no es R y ya le ganaste la linea. Recien jugamos una partida y tenia a Leona de counter (O sea, sona era mi pick), pero a un hipercarry en jg (Contra Xin Shao). Depende de la calidad del jugador, de como esta el equipo y de cuanto estan jugando en equipo (nos enteramos de que ellos estaban flammeando :v). Eso si: que estes jugando con un counter del enemigo, te da la ventaja de ganar tu lane (Y los hipercarrys son beneficiosos. Por eso Sejuani tiene mas WinRate que Amumu :v) (Posta. Amumu tiene mas Win Rate que Jinx...)\nLos counters son relativos, pero en estadisticas, y si tenes 7/10 de W/L con un counter de tal champion, ganaste el game. Todo depende de las estadisticas y el ELO de cada champ con cada summoner.","replies":[]}]}]},{"poster":"l BlackWidow","date":"2015-04-15T23:00:39.324+0000","up_votes":1,"down_votes":0,"body":"Coincido con casi todo pero con lo de pickear un counter ya no. Imaginate que maineas blitz, y te pickean alistar. Yo no lo pickeo, o hay una morgana supp del otro lado y maineas tresh , no lo pickeo. Es decír que si maineas algo y sabes que del otro lado con ese pj te van a ganar no lo saques, saca una segunda opción.\nYo maineo elise, y cuando veo un xin zhao, volibear, u otro pj que se que me va a ganar vaya donde vaya, directamente no lo pickeo.\n\npd : Casi todas las rankeds tienen una vuelta , ayer el enemigo tenía 2 torres de mid y nosotros nos habían tirado todo el nexo nuestro estaba en 200 de vida,y la tristana que iba 28-7-20 con un penta echo, y la ganamos :D. Me dió 16 puntos XD","replies":[{"poster":"ScaylerElPescado","date":"2015-04-16T02:33:42.292+0000","up_votes":1,"down_votes":0,"body":"Obviamente uno no va a pickear un champ que te lo van a counterear (A menos que seas Faker, Bjergsen, YellowStar o uno de esos que son re pro viteh) y por eso también muchos recomiendan tener por lo menos 3 champs con un manejo decente por línea.\n\nCon lo de los counter a la vez estoy de acuerdo y desacuerdo al mismo tiempo.\n\nTodo depende de la habilidad del jugador, los jugadores a su alrededor, y obviamente de la mente del jugador, los aliados y los enemigos.\n\nPor ejemplo. Yo maineo Nasus, un enemigo pickea Renekton y yo pickeo a Nasus igual, porque veo que tengo una buena composición de team, y que mis aliados muestran una actitud bastante positiva.\n\nEn lo de habilidad es como manejan TODOS los jugadores en la partida a los campeones que llevan.\n\nEn lo de mentalidad, que es algo que influye bastante estaría:\n\n•Hacer al enemigo confiar, por ejemplo, comerte un tanto de daño (En mi caso de un Renek con Nasus) para que el Renek se confié y así tratan de divearme o pushean mucho, con esto mi jungla puede aprovechar para gankear al Renek, que si esta distraído por la confianza o no tiene una habilidad como para concientizar de los ganks tempranos y así llega mi jungla y lo gankea, OJO, que podría llegar el jungla enemigo, que se da cuenta de lo que estoy tratando de hacer con el Renek, le avisa al mismo y me hacen un diveo efectivo.\n\n•Engañar al enemigo. Viste que el enemigo wardeo el bush, y te están esperando a vos y a tu equipo, vos y tu equipo saben que ellos los ven y aprovechan esto para hacerse los boludos y al final los terminan outplayeando y de esta forma prácticamente tienen un boleto más hacía la Victoria.\n\n•Ejercer presión al enemigo, esto puede ser de muchas maneras.\n\n1.-Pushear una línea demasiado mientras hay 5 enemigos pusheando una línea, de esta forma, uno o más de ellos van a notar que estás pusheando y se van a poner nerviosos entre sí, seguir pusheando, sabiendo que no van a tirar torre o tal vez sí debido a que los otros 4 defienden esa torre y perder una torre debido al que esta pusheando solo, o ir a la línea, dejar a los demás del equipo en una desventaja o con menos posibilidades de tirar la torre, perder la torre igual o no, y entonces ponerse aún más nerviosos.\n\n2.-Ctrl+3(Bailar)/Ctrl+4(Reir)/Recuperación, Esto, aunque no lo parezca, en algunas personas crea una provocación bastante fuerte, reírte, bailar o Backear enfrente de ellos con poca vida los puede provocar a  cometer un dive o tratar de golpearte, quedándose muy en frente y recibiendo demasiado daño de los minions, y así, quedando en una clara desventaja frente a ti.\n\nUn ejemplo que yo uso mucho es farmear un minion, y mientras el enemigo me pega ponerme a bailar mientras me pegan, obviamente sin exceder el daño recibido, no sabes como se provocan y se meten bajo torre a matarme, por suerte algunas personas se lo toman a bien y nos echamos unas carcajadas.\n\nTambién algo que pongo muy en cuenta a la hora de jugar al lol es, sea ranked o normal, o lo que sea, juego para DIVERTIRME, si perdes 1 o 2 partidas y sentís que no te estás sintiendo a gusto, ni te divierte y te amarga, deja de jugar un rato, un día, tomarte una siesta, salir a pasear, a correr, al Gimnasio, tomarte un mate y charlar con alguien, hacer un asado con amigos, etc. Esto ayuda a librarte de la presión y así podes jugar nuevamente con una actitud bastante positiva.\n\nSin más que decir, saludos.\n\nAtte:\n\nScaylerElTankeado {{champion:75}}","replies":[]}]}]},{"poster":"ferkertor","date":"2015-04-14T21:29:06.611+0000","up_votes":1,"down_votes":1,"body":"mira penza que son normals con mas gente hpt de lo acostumbrado :P y si quieres te puedo ayudar (no se si esto sera bueno o malo T-T) añadirme y lleguemos a bronce 5 :D si te arastrare con migo(mentira se controlar las situaciones bajo presión solo quiero aser un amigo intimo 7u7 y hombre sip yo también soy hombre )","replies":[{"poster":"Jonshi","date":"2015-04-15T19:47:39.577+0000","up_votes":1,"down_votes":0,"body":":v","replies":[]}]},{"poster":"waffen SS","date":"2015-04-15T08:06:56.423+0000","up_votes":1,"down_votes":0,"body":"las ranked son esparta","replies":[]}]}