{"poster":"Légs","date":"2015-11-19T07:17:41.837+0000","title":"Should I start ranked ?","subforum":"Miscellaneous","up_votes":2,"down_votes":1,"body":"Whens the optimal time to start ranked.\r\n\r\nI have 3+ champs for each role except top, which I only have shen and maybe garen since hes super easy. Thinking of picking up Vladmir since he looks perfect for those who hate top. 501 wins right now.\r\n\r\nshould i start or nah","replies":[{"poster":"Rocka","date":"2015-11-19T07:34:18.536+0000","up_votes":3,"down_votes":0,"body":"start when ever u feel like you are ready","replies":[]},{"poster":"Zaps","date":"2015-11-20T00:22:01.443+0000","up_votes":2,"down_votes":0,"body":"I totally agree with Sephyre around mindset being the biggest thing rather than any particular line in the sand. If you're approaching each game positively with an positive but competitive attitude to win - and be open to improving the weaker parts of your play, you'll rise fast and really enjoy yourself. \n\nFrom the sounds of things you're probably more prepared than most when starting your ranked career.  It's pretty likely if you're a bit weaker at one role that most teams will tend to be accommodating - as long as you're willing to fill in the other four roles.\n\nAlso, this is a pretty good time to get started ranked if you're not fully confident - it's a little bit less competitive during preseason and any games that you play aren't directly counting towards an end of season rank!","replies":[]},{"poster":"Sephyre3","date":"2015-11-19T23:24:11.849+0000","up_votes":1,"down_votes":0,"body":"I think you'll be fine to give it a go. I personally wanted to make sure I had 100 games at level 30 before starting ranked but I got ansy to start and went in ahead of that target and it was fine.\n\nMindset is the biggest thing IMO -  people will be a little more in 'serious business mode' in ranked, but if you go in there seeking a good competitive game and are willing to work on the aspects of your game that might get exposed in ranked (especially as you climb) you're going to have a great time.","replies":[]}]}