{"poster":"ANewDay","date":"2016-09-15T22:00:40.809+0000","title":"LOL para Linux","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Hola a todos!!!!\r\n\r\nCada tanto hago esta solicitud porque realmente me interesa (y seguro a varios usuarios mas) y lo voy a seguir haciendo hasta que se logre o hasta que Riot me de un &quot;No&quot; definitivo.\r\n\r\nMi solicitud es hacia Riot y es si pueden considerar la posibilidad de lanzar un instalador que funcione en Ubuntu o en cualquier otra disto de Linux (pongo Ubuntu porque es un distro muy usada y facil de usar) asi como hicieron con Mac.\r\n\r\nEn mi caso, tengo Windows unica y exclusivamente por el LOL. La verdad que tengo una notebook de caractersticas medias (no es una notebook de la Nasa ni tampoco una tostadora) pero es notable la diferencia de rendimiento. La notebook me anda mucho mejor con Ubuntu que con Windows.\r\n\r\nIntente emular el LOL con Wine o PlayOnLinux pero tiene sus bugs y errores que afectan a la jugabilidad.Tambi&eacute;n noto que al emular el juego los fps son menores que al jugar en Windows (por lo general son de 10 a 20 fps menos) lo cual es normal ya que es emulado.\r\n\r\nS&eacute; que lanzar un instalador para Ubuntu no es algo que se haga de un dia para el otro pero estaria bueno que lo consideren.\r\n\r\nCada dia las distribuciones de Linux estan siendo cada vez mas usadas y los soportes y juegos a dicho sistema operativo son cada vez mas. Muchas empresas de juegos (por ejemplo Steam) optan por sacar juegos para Windows, Mac y Linux. Poco a poco empieza a ser tendencia y en mi opinion League of Legends no deberia quedar atras en esto.\r\n\r\nEspero que puedan apoyar a esta causa.\r\n\r\nMuchas gracias desde ya.\r\n\r\nSaludos.","replies":[{"poster":"Desaroll","date":"2016-09-15T22:13:59.492+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ANewDay,realm=LAS,application-id=v7qsfXsE,discussion-id=raEbaEKo,comment-id=,timestamp=2016-09-15T22:00:40.809+0000)\n>\n> Muchas empresas de juegos (por ejemplo Steam) optan por sacar juegos para Windows, Mac y Linux.\n> \n\nPequeña correción de un error muy común. Steam es una plataforma de juegos, no una empresa. La empresa es Valve.\n\nMuchas empresas publican en Steam, entre ellas la creadora de Steam, Valve.\n\nSuerte!","replies":[]},{"poster":"Runth","date":"2016-09-15T22:20:26.097+0000","up_votes":1,"down_votes":0,"body":"es el q 70% aplica riot, es usado por .exe","replies":[]},{"poster":"WT AraelF","date":"2016-09-15T22:02:02.096+0000","up_votes":1,"down_votes":0,"body":"Seria genial pero no lo usaria jajaja Uso archlinux exclusivamente para trabajar y wintendo para jugar :P","replies":[]}]}