{"poster":"Schmaxel1","date":"2015-12-29T02:33:53.959+0000","title":"Main Supporter sucht einen aktiven Clan","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Einen wundersch&ouml;nen guten Tag,\n\nmein Name ist Alexander, ich bin 18 Jahre alt und biete mich nun hier im Forum als Supporter f&uuml;r einen Clan an.\nLeague of Legends begann ich zu spielen vor ungef&auml;hr 5 Jahren, weshalb ich mich auch als Veteran bezeichnen w&uuml;rde. Allerdings hatte ich eine sehr lange Pause von ungef&auml;hr 2 Jahren, in welchen ich nur manchmal gespielt habe.\n\nNach einigen aktiven Monaten, welche ich nun wieder hinter mir habe, suche ich also einen Clan bzw. ein Team, mit welchen ich gemeinsam spielen kann.\n\nIch besitze ein meiner Meinung nach sehr gro&szlig;es taktisches Verst&auml;ndnis, einen gesunden Teamgeist und die Kraft bis zum bitteren Ende eines Matches mein bestes zu geben. Au&szlig;erdem versuche ich mich immer zu verbessern und h&ouml;re meinen Teammitglieder gerne aufmerksam zu und befolge ihre Befehle.\nAuch Abseits des Spiels bin ich ein sehr humorvoller Mensch. Auch bin ich sehr an Diskussionen &uuml;ber die verschiedensten Themen interessiert und probiere auch Menschen in jeder Lebenslage bestm&ouml;glich zu helfen.\n\nAls Main Supporter besitze ich folge Champions und beherrsche sie exellent:  \n{{champion:12}} {{champion:53}} {{champion:89}} {{champion:111}} \nNaturlich besitze ich auch noch viele andere, aber diese sind meine besten.\n\nIch suche ein Team, welches nette und gute Mitglieder besitzt (mindestens Silver 5) und bestenfalls auch Mitglieder, von welchen ich noch sehr viel lernen kann (&lt;Gold 5). Pers&ouml;nlich befinde ich mich momentan in der Soloelo Silver 5.\n\n\nBei Interessse, R&uuml;ckfragen oder jeglichen anderen Angelegenheiten k&ouml;nnen sie/du mich jederzeit per Mail unter *************** erreichen oder bedingt hier im Forum. Ich freue mich auf dich/sie. :)\n\n\nSchmaxel1/Alexander","replies":[{"poster":"NGC Polyxena","date":"2015-12-29T10:38:19.848+0000","up_votes":1,"down_votes":0,"body":"Hallöchen Alexander,\n\nwenn du magst kannst du dir gerne Mal unsere Homepage anschauen: http://nova.community . Wir sind eine familiäre ü18 Multigaming Community mit mittlerweile mehr als 150 Spieler/innen im LoL Bereich. Hier findest du jeden Abend genug Mitstreiter für ein paar gemütliche Runden durch die Kluft oder auch bei Arams. Und wer weiß, vielleicht findest du bei uns ja auch zeitgleich noch ein passendes Team?\n\nFalls du Fragen hast kannst du dich gerne an mich wenden.\n\nLiebe Grüße\nNOVA Polyxena | Julia","replies":[]},{"poster":"Frizzant","date":"2015-12-29T07:39:31.370+0000","up_votes":1,"down_votes":0,"body":"Hallo Alex\nEs würde mich sehr freuen, wenn du dich uns anschliessen würdest :) Am meisten ist bei uns zwischen 18:00-23:30 (GMT+1 Paris/Berlin/Zürich) los, aber sogar jetzt sind ein paar Leute online.\nSchau doch am besten einfach mal vorbei - ob \"for fun\", oder \"serious game\", du findest bestimmt das richtige bei uns :)\nTS: happy-forever.xyz\nwww.happy-forever.xyz","replies":[]}]}