{"poster":"scachthach","date":"2017-07-01T19:47:13.541+0000","title":"Realmente es posible carrear a 4?","subforum":"Guias y consejos","up_votes":3,"down_votes":5,"body":"Hola a todos! Hace mas o menos 1 a&ntilde;o que juego y soy un ranked, y me niego a rankear sin poder cumplir con el consejo que todos dan para subir de elo. Carrear.\r\nLos que dan ese consejo se basan en que lo unico constante en tus partidas sos vos, entonces por ende si no subis es porque no tenes suficiente nivel, pero que tan posible es esto?\r\nRealmente se puede ganar una partida con 4 feeders, afk, trolls, etc vs un equipo contrario en el que pueden ser buenos jugadores? \r\nRealmente se puede ganar solo?\r\nPorque ami me parece imposible. Hay 3 lineas, con los objetivos, no se si se puede estar en todo el mapa al mismo tiempo...","replies":[{"poster":"MD Abýssou","date":"2017-07-01T22:21:44.015+0000","up_votes":1,"down_votes":0,"body":"No, en el meta actual no se puede carrear 1v9, si te tocan 4 pibes con serios problemas mentales es muy probable que pierdas, pero aun asi, culpar a tus compañeros porque no subís es de manco, no importa el elo en el que estes, si no subís es por tu culpa.","replies":[{"poster":"scachthach","date":"2017-07-01T23:03:04.690+0000","up_votes":2,"down_votes":0,"body":"No, obvio culpar a los otros no sirve, la idea es mejorar uno y corregir sus propios errores. Me referia a lo del meta, lo cual tiene sentido, gracias por responder!","replies":[]}]},{"poster":" ll ch0t0l0g ll ","date":"2017-07-02T08:51:03.312+0000","up_votes":1,"down_votes":0,"body":"depende el elo , yo no juego mucho ahora pero en mis smurfs subir hasta platino  no era complicado porque   pikeas cosas que estan rotas o haces duo y subis enseguida , si queres subir te recomiendo mas que nada mid y jg  y champs que no requieran manos tipo ww  o annie   asi solo importa tus decisiones y no tanto  lo bueno que seas con el champ  ~~~~y podes abusar de la gente mala ~~~~  kayle es el champ que mas me gusta para subir porque en late contra gente mala literalmente carreas la partida  , gp tmb si soportas la fase de linea  en late te soleas un equipo . pero tene en cuenta que carreas fedeando a tu equipo porque como decis son 3 lineas lo importante es ayudar lo suficiente para que los laners de las demas lineas no sean un problema  .  plan b hace duo con tacticas de eloboost siempre funcionan  :V  tipo kayle top y  maestro yi jg","replies":[{"poster":"scachthach","date":"2017-07-02T16:47:13.247+0000","up_votes":1,"down_votes":0,"body":"Muy buen consejo! Gracias!","replies":[]},{"poster":" ll ch0t0l0g ll ","date":"2017-07-02T08:53:36.624+0000","up_votes":1,"down_votes":0,"body":"no te guies por  el meta para subir porque  hasta platino  literalmente podes jugar lo que quieras  porque la gente todavia ni sabe jugar el juego xd  y hay gente en diamante que juega cosas fuera del meta y se mantiene   , mi habilidad tiene sus limites y por eso solo puedo abusar hasta platino bajo","replies":[{"poster":"SenpaiDeathx","date":"2017-07-02T10:13:39.073+0000","up_votes":1,"down_votes":0,"body":"pero haces duo...el habla de carrear 1vs9","replies":[]}]}]},{"poster":"SenpaiDeathx","date":"2017-07-02T10:15:53.950+0000","up_votes":1,"down_votes":0,"body":"no imposible, incluso por 1 que la está jodiendo constantemente, ya es muy difícil si es que el otro team sabe aprovecharlo. O de repente eres el unico que estas carreando y el team enemigo se da cuenta de esto, basta con que apenas te vean lleguen todos para matarte y listo free LP.","replies":[{"poster":"scachthach","date":"2017-07-02T16:45:39.215+0000","up_votes":1,"down_votes":0,"body":"Es cierto, no hay champ inmortal, si te focusean bien no podes hacer nada. Aparte con los objetivos no podes estar en todos lados. Es un juego en equipo","replies":[]}]},{"poster":" ll ch0t0l0g ll ","date":"2017-07-02T08:50:31.577+0000","up_votes":1,"down_votes":0,"body":"depende el elo , yo no juego mucho ahora pero en mis smurfs subir hasta platino  no era complicado porque   pikeas cosas que estan rotas o haces duo y subis enseguida , si queres subir te recomiendo mas que nada mid y jg  y champs que no requieran manos tipo ww  o annie   asi solo importa tus decisiones y no tanto  lo bueno que seas con el champ  ~~~~y podes abusar de la gente mala ~~~~  kayle es el champ que mas me gusta para subir porque en late contra gente mala literalmente carreas la partida  , gp tmb si soportas la fase de linea  en late te soleas un equipo . pero tene en cuenta que carreas fedeando a tu equipo porque como decis son 3 lineas lo importante es ayudar lo suficiente para que los laners de las demas lineas no sean un problema  .  plan b hace duo con tacticas de eloboost siempre funcionan  :V  tipo kayle top y  maestro yi jg","replies":[]},{"poster":"Cobe","date":"2017-07-01T20:38:10.780+0000","up_votes":1,"down_votes":0,"body":"También tenes que tener en cuanta que ni faker gana el 100% de sus partidas, tampoco perder una partida por trolls, o afk es algo \"malo\" porque también te puede tocar uno en el team contrario, es como un 50 -50 aunque a veces uno siente que a uno le toca mas seguido un troll o afk XD . Y lo de carrear \"solo\" tampoco es tan asi, es mas que nada dependiendo de la liga en la que estes, tranquilamente no podes ser un faker carreando partidas, pero podes ser un jugador inteligente que sabe tomar deciciones y no regalar partidas, no dar tantas ventajas en linea como por ejemplo (farmeo, kills) no necesaria mente hay que estompear la linea para ganar, sino mas bien perder la linea.","replies":[{"poster":"scachthach","date":"2017-07-01T23:04:42.558+0000","up_votes":1,"down_votes":0,"body":"Si, exacto. A veces te toca a vos, aveces al otro equipo. A eso me referia, perder una partida, se va a perder, lo importante es darlo todo y despues utilizarlo para aprender.","replies":[]}]},{"poster":"Cesth","date":"2017-07-01T20:10:31.330+0000","up_votes":1,"down_votes":0,"body":"No.","replies":[]},{"poster":"PCtronix","date":"2017-07-01T20:09:43.806+0000","up_votes":1,"down_votes":0,"body":"es posible si .. pero la % de que pase eso es muy pero MUY baja","replies":[]},{"poster":"Tortuguita","date":"2017-07-01T19:55:26.426+0000","up_votes":1,"down_votes":0,"body":"Si se puede *tira el mic*","replies":[]},{"poster":"Warwiick","date":"2017-07-01T21:19:23.463+0000","up_votes":1,"down_votes":1,"body":"el unico que carrea solo una partida con 4 afks o fedeers es lord barbakahn :v","replies":[]}]}