{"poster":"Slax135","date":"2015-12-12T12:49:24.042+0000","title":"LeaveBuster Bug","subforum":"Melde einen Bug","up_votes":1,"down_votes":9,"body":"Hallo,\r\n\r\nDa es im Support einige unf&auml;hige Leute gibt oder die wollen einfach sich nicht darum k&uuml;mmern probier ichs hier mal, ein supporter namens &quot;BLESSMEI&quot; geh&ouml;rt meiner Meinung nach rausgeworfen vom SupportTeam,\r\n\r\nAlso folgendes wenn man eine Strafzeit hat vom LeaveBuster steht oben rechts normal immer wieviel Spiele man noch niedrige Priorit&auml;t hat und das steht einfach nicht mehr dort so wie fr&uuml;her, bei Chateinschr&auml;nkungen steht es dort aber vom LeaveBuster NIX EINFACH GARNIX! Wenn ich jetzt die 5 Spiele fertig habe und es steht immer noch 20 Minuten Strafzeit dann drehe ich durch....\r\nMfg","replies":[{"poster":"Busty Botter","date":"2015-12-13T12:50:10.620+0000","up_votes":2,"down_votes":1,"body":"Warum kriegst du es nicht auf die Reihe, Spiele nicht zu verlassen? :) Soviele \"Internetausfälle\" kann es ja nicht geben.","replies":[{"poster":"Slax135","date":"2015-12-13T13:22:28.106+0000","up_votes":1,"down_votes":0,"body":"Ich hatte 1x ne 20min Sperre die is weg da hab ich mit absicht das Spiel verlassen, aber beim 2. mal nicht....die Strafe ist mir ja egal aber es stört mich das ein Bug nicht behoben wird....wenn man Chateinschränkungen hat steht auch immer oben wieviel Spiele noch, und das muss beim LeaveBuster auch so sein!! War immer so... Wieso will das keiner checken das es ein Bug ist? \n\nUnd ab und zu muss man Spiele verlassen wenn es zb 5 zu 20 steht und 2 Idioten wollen nicht surrendern, ich verschwende doch nicht meine Zeit wenn einer voll feedet, da hab ich lieber ne 20 min Strafe weil in diesen 20 min kann ich was sinnvolles machen und bis ich in die Warteschlange komme bin ich wieder am PC ;)","replies":[{"poster":"HyperionCH","date":"2015-12-13T13:51:39.620+0000","up_votes":1,"down_votes":0,"body":"Klingt nach einem Anzeigefehler.\n\nPersönlich habe ich keine Erfahrung, da ich nie eine tiefere Priorität bekommen habe.\nDu musst aber auch verstehen, dass dieser Anzeigefehler nicht die höchste Priorität beim Beheben von Bugs haben wird. Schliesslich betrifft dies nur eine sehr kleine Gruppe der Spieler-Community (die sich zudem falsch verhalten hat) und hat auch keine Auswirkungen ingame. Das kann also einige Zeit dauern, bis dies behoben wird. Höchstwahrscheinlich ist deine Strafe da schon längstens weg.\n\nUnd nein! Man muss nie das Spiel verlassen. So etwas gilt als unsportlich.\nIst im WM-Halbfinale letztes Jahr ein brasilianischer Spieler vom Feld gegangen, weil das Spiel früh entschieden war? Was hättest du gesagt, wenn dies einer getan hätte? Die Mehrheit hätte dies kritisiert.\n\nDu solltest also besser eine Einstellung überdenken.\nDie längere Warteschlange ist ein Zeichen, dass dies nicht gerne gesehen wird. Riot kann bei Wiederholungstätern auch einen perma aussprechen.\n\nUnd sein einmal ehrlich:\nWie viel \"sinnvolleres\" hast du in den 5x20 Minuten (also total 100 Minuten) getan? Um die Strafe zu kriegen, hast du vielleicht 5x leaven müssen. So lange das Game läuft hast, kannst du nicht spielen. Du kannst spielst dann vielleicht die letzten 5 Minuten nicht, aber auch da kannst du wohl kaum etwas sinnvolles tun.\nMich würde es wundern, wenn du wirklich etwas sinnvolles in dieser getan hättest. Denn bei 5x leaven (Annahme: das Game läuft dann noch 5 Minuten) hast du 25 Minuten nicht gespielt. \"Zeitersparnis\" hast du aber keine, da du - z.B. wenn du climben möchtest - kein neues Game starten kannst.\nIn den 100 Minuten Zeitstrafe kannst du natürlich etwas sinnvolles tun. Aber dies kannst du auch ohne Zeitstrafe tun (du bist dann zudem nicht gezwungen, die \"sinnvolle Sache\" zu pausieren, wenn das Matchmaking dann nach 20 Min. startet).","replies":[{"poster":"Slax135","date":"2015-12-13T14:40:41.508+0000","up_votes":1,"down_votes":0,"body":"Permaban für leaven wäre ein bisschen übertrieben....da würde es gewaltig wirbel geben in der LoL community","replies":[{"poster":"HyperionCH","date":"2015-12-13T17:10:31.109+0000","up_votes":1,"down_votes":0,"body":"Warum?\nWer ständig afk geht, spielt nicht fürs Team und es ist nun einmal ein Teamspiel.\n\nFür jene Spieler, die nie leaven ist es ja auch kein Problem, wenn es dafür einen perma gibt.\nEs gibt ja auch perma fürs Flamen. Ist das ein Problem für Spieler wie mich? Nein, denn ich flame nicht. Bezüglich afk ist es genauso.","replies":[{"poster":"Slax135","date":"2015-12-13T18:00:26.816+0000","up_votes":1,"down_votes":0,"body":"es hat noch kein mensch ein perma ban für leaven bekommen, und vor perma ban kriegt man sowieso 14 tage sperre","replies":[{"poster":"HyperionCH","date":"2015-12-13T19:19:09.566+0000","up_votes":1,"down_votes":0,"body":"Ich habe auch nicht geschrieben, dass dies getan wird. Ich habe geschrieben, dass Riot dies kann.\nSollten zu viele Spieler leaven und die derzeitigen Massnahmen nicht greifen, kann Riot sofort entscheiden, dass permas fürs mehrmalige Leaven (bzw. wenn 2-Wochen-bans auch nichts halfen) ausgesprochen werden. Die AGB müsste nicht einmal geändert werden.","replies":[]}]}]}]}]}]}]},{"poster":"Slax135","date":"2015-12-13T12:33:47.227+0000","up_votes":1,"down_votes":0,"body":"Jetzt ist der scheiss Bug schon wieder da..... was ist das für ein Mist??? Es zeigt schon wieder nicht an wieviele Spiele man 20 Min warten muss....vorallem wurde ich zu unrecht nochmal vom LeaveBuster bestraft da ich ein Internetausfall hatte....Aber wenigstens sollte es anzeigen das man noch 4 von 5 Spiele niedrige Priorität hat...wieso kriegt das keiner auf die Reihe???","replies":[]}]}