{"poster":"Psanic","date":"2018-04-04T19:46:22.460+0000","title":"Ich komme nicht aus Bronze raus","subforum":"Champions & Gameplay","up_votes":1,"down_votes":3,"body":"Hallo. Da ich in meinen placements anscheinend nicht gut gespielt habe (5W5L),wurde ich Bronze 5 eingeranked. Ich m&ouml;chte nicht arrogant wirken aber ich sch&auml;tze mich eher in high silber oder gold ein. Meine main Rolle ist jungle wo ich meistens kha,kayn,vi spiele. Das Problem: Ich habe fast jede Runde ne krasse Kda,aber mein restliches Team feedet einfach. Und ich kann nunmal keine lane ganken wenn mein laner im 1v1 feedet. Ich ganke sogar ziemlich oft (1 mal alle 2min). Aber ich schaffe es einfach nicht mein Team zu carrien. Habt ihr irgendwelche Tipps wie ich noch besser spielen kann (wards,decision etc.). Ich will endlich aus Bronze raus das is so frustrierend mit solchen Noobs zu spielen. Zum carrien bin ich aber anscheinend zu bad. Also her mit Tipps!","replies":[{"poster":"H3nt4i K4m3n","date":"2018-04-04T20:09:06.321+0000","up_votes":3,"down_votes":0,"body":"Erstmal:\n\nDu gehört dahin wo du momentan bist, bis du zeigst, dass du dich wirklich verbessert hast!\nDiese Mentalität behindert dich indirekt in deinen Spielen, weil du denkst du bist so viel besser!\n\nKennst du die Jgl Routen?\nVersuchst du den gegnerischen Jgler zu tracken, damit du und dein Team es leichter haben?\nSpielst du aktiv um die Objectives?\nWie gankst du und wann?\nWie aktiv bist du im Warding und hilfst deinem Team? Nicht immer sind Kills nötig beim Gank, es reicht schon, wenn man Summoners der Gegner auslöst, oder die Gegner Mana und Leben verlieren.\n\nAnsonsten ist es schwer so aus der History dir wirklich Tipps zu geben.","replies":[{"poster":"Marksmansitter","date":"2018-04-04T22:29:26.874+0000","up_votes":2,"down_votes":0,"body":"Jup, ich denke auch das da die Probleme liegen. Beispielsweise hat er nicht 1x sein trinket zum roten geändert und das als main Jungler und von Pink wards kann man auch nicht ausgehen. Objectives sind das wichtigste im Spiel, kills sind nur Mittel zum Zweck.","replies":[]}]},{"poster":"Critical lmpact","date":"2018-04-04T20:18:05.401+0000","up_votes":2,"down_votes":0,"body":"Dein größtes Problem ist deine Einstellung.\n\nDu verlierst nicht, weil dein Team feedet, sondern weil du als jungler nicht gut genug bist um sie zu carrien.\n\nDeine „krasse KDA“ interessiert keinen, wenn am Ende dein Nexus fällt.\nFokussiere dich nicht so auf kills, sondern mehr auf objectives.\n\nTürme müssen fallen, nicht Gegner. Natürlich gehören teamfights und kills dazu, aber das ist nicht das eigentliche Ziel des Spiels.\n\nEntweder schaffst du es Solo zu carrien oder du musst andere Dinge verbessern, um deinen lanes effektiv zu Beginn des Spiels Vorteile zu verschaffen.\n\nAm ehesten erreichst du das, indem du dir z.B. deine replays anschaust und überlegst was du besser machen kannst.\n\nUnd lass deine Teammates aus dem Spiel. Die werden nicht besser oder schlechter wenn du dich über die aufregst. Es liegt ganz allein an dir: spiele besser als der Rest in Bronze, und du steigst auf","replies":[]},{"poster":"Nocì","date":"2018-04-04T19:54:55.945+0000","up_votes":2,"down_votes":0,"body":"Wenn du wirklich wie Silber/Gold spielst, dann kannst du in Bronze 5 nur gewinnen. \n\nVersuch deine Lanes früh zu ganken, vorallem snowballlastige Lanes mit Assassinen oder Bruiser. \nObjective Control ist auch enorm wichtig, da jeder Drache, Turm, Herald oder die River-Krabbe deinem Team enorm helfen. \nWenn man Bot gankt ist es einfach den Drachen danach zu machen. Es reicht auch wenn man weis das der gegnerische Jungle top ist. \n\nCounter Jungeln ist immer eine schwere Sache, man sollte es vermeiden wenn man nicht weis wo der gegnerische Jungler ist UND kein Backup für den Notfall hat.\n\nOft sind Tank jungler eine gute Wahl, da alle in Bronze auf Schaden gehen wollen und somit ein Tank fehlt.","replies":[]},{"poster":"Worthless Soul","date":"2018-04-05T12:19:14.510+0000","up_votes":1,"down_votes":0,"body":"In bronze 5 kann man mit Singed adc sogar gewinnen","replies":[]},{"poster":"Cenâreth","date":"2018-04-05T11:25:50.882+0000","up_votes":1,"down_votes":0,"body":"Kleiner Tipp fokussiere dich aufs auflösen der Summoners und auch auf Kills, aber geh nicht sofort in jeder Situation back oder in die Base, sondern pushe dann auch mal gemeinsam mit den Mate die Lane wenn möglich. Ihr vergesst alle beim killen sowohl aufs pushen der Lane, als auch davor beim Aufbau der Vision.","replies":[]},{"poster":"Psanic","date":"2018-04-05T08:22:28.915+0000","up_votes":1,"down_votes":1,"body":"Ich warde so gut wie immer objectives sodass wir 24/7 Vision im river haben. Ganken versuch ich je nach Start nach lvl 3 entweder top/bot zu ganken. Danach farme ich bis 6 und versuche eine lane zu snowballen","replies":[]},{"poster":"Kriegs Schwein","date":"2018-04-04T20:46:10.535+0000","up_votes":1,"down_votes":5,"body":"das hat mit deinem team nix zu tun wenn sie schöecht sind musst du sie halt carryen, wenn du zu schlecht dafür bist is es dein problem und du bleibst bronze, wo du noob auch hingehörst xD","replies":[]}]}