{"poster":"Schokohörnchen","date":"2018-05-11T06:16:49.258+0000","title":"[TGSG] Antrag auf Zwergkaninchen","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":5,"body":"Sehr geehrte Damen und Herren,\n\nda sich die Wellensittiche momentan in der Obhut des Tierarztes befinden und ich derzeit die Ruhe hier ziemlich genie&szlig;e, habe ich mir einige Gedanken bzgl. der zuk&uuml;nftigen Tierhaltung gemacht. Da eigentlich nur ich von der Tierhaltung betroffen bin, sehe ich es als mein gutes Recht Vorschl&auml;ge zu machen diesbez&uuml;glich bzw. diese sogar als sehr umsetzbar ansehe.\n\n**Punkt 1: Die Tiere sollen an der Rezeption ihr Zuhause finden.** Das bedeutet, dass ich die angeschafften Tiere von morgens 07:00Uhr bis 16:00Uhr &quot;ertragen&quot; muss. Tiere die Ger&auml;usche machen, sind da sehr anstrengend und manchmal sogar extrem belastend wie man sich vielleicht vorstellen kann. Zwergkaninchen sind ruhig. Man hat mich zwar schon dar&uuml;ber informiert das sie eventuell stinken, aber durch meine guten L&uuml;ftungsma&szlig;nahmen d&uuml;rfte das dann doch kein nennenswertes Problem darstellen.\n\n**Punkt 2: Die Bewohner sollen etwas von den Tieren haben.** Von V&ouml;geln haben die Bewohner reichlich wenig. Die gefederten Schreih&auml;lse werden nie auf die Wohnbereiche gefahren mit ihrer Voliere und sollen ja offensichtlich auch nicht mehr in den Innenhof, sprich nach drau&szlig;en, umgesiedelt werden. Wenn dann mal jemand mit einem Bewohner kommt, steht dieser vor der Voliere und... nichts. Manche sehen die V&ouml;gel nicht mal richtig und an anfassen ist auch nicht zu denken. Zwergkaninchen k&ouml;nnte man auf den Arm geben. Okay, vielleicht auch nicht. Aber ich k&ouml;nnte sie auf den Arm nehmen und die Bewohner k&ouml;nnten sie streicheln.\n\n**Punkt 3: Der Spa&szlig;faktor.** Es ist nicht sonderlich aufregend, nett oder niedlich Wellensittiche zu beobachten. Das Gezwitscher ist auch nur bedingt ertr&auml;glich. Denn die meiste Zeit entspricht es doch eher wildem Geschreie das wirklich belastend sein kann. F&uuml;r die Leute die die Wellensittiche nur im vor&uuml;bergehen &quot;bewundern&quot;, mag es nett sein. Aber den ganzen Tag diesem L&auml;rm ausgesetzt zu sein und ZUS&Auml;TZLICH noch allem anderen drum herum, ist wirklich anstrengend. Des weiteren sind die V&ouml;gel auch nicht zu gro&szlig;artigen anderen Dingen zu gebrauchen. Sie kacken unendlich viel und sind laut.\n\n**Punkt 4: Nur Vorteile.** Zwergkaninchen sind leise, den Geruch bekommt man in den Griff. Man kann sie anfassen, sind in der Reinigung wesentlich einfacher und in der Pflege ebenfalls. Gerade das &quot;anfassen&quot; stelle ich mir als wesentlich sch&ouml;ner auch f&uuml;r Bewohner vor, als Wellensittiche. Eventuell k&ouml;nnte man sogar eine Art tragbaren/ versetzbaren &quot;Outdoor-K&auml;fig&quot; anschaffen (vielleicht sogar in Eigenanfertigung), so dass die kleinen H&auml;schen als Rasenm&auml;her f&uuml;r das Wiesenst&uuml;ck am Eingang fungieren k&ouml;nnten :3\n\nHoffentlich nehmen Sie sich meine Gedanken zu Herzen! Denn im Endeffekt bin ich ja auch diejenige, die wie bereits erw&auml;hnt, den ganzen Tag mit den Tieren leben muss. Insofern w&auml;re es nur fair wenn meine W&uuml;nsche diesbez&uuml;glich auch ber&uuml;cksichtig werden w&uuml;rden.\n\nMit freundlichen Gr&uuml;&szlig;en\n:&gt; {{item:3681}}\n____\nGlaubt ihr ich komme damit durch? x.x","replies":[{"poster":"Dr Madscientist","date":"2018-05-11T13:10:29.088+0000","up_votes":1,"down_votes":0,"body":"Ich als Zwergkanninchenbesitzer kann das nur empfehlen.\nZwergkanninchen sind relativ pflegeleicht, in der regel werden die sogar quasi Stubenrein (die suchen sich EINEN ort an dem sie IMMER gehen werden, wenn sie können um ihr Geschäft zu verrichten) und den \"Gestank\" kriegt man ganz leicht weg: KEIN TROCKENFUTTER.\nDie meisten Futtermischungen für Kanninchen enthalten viel Getreide und davon kommt der Geruch wenn es am anderen Ende des Tieres wieder raus kommt.\nAm besten so viel Heu füttern wie sie wollen und etwa 20% des Eigengewichtes (des Tieres, nicht des Halters) an Frischfutter, am besten Sellerie, Steckrübe, Gurke. Wenig Karrotten, die enthalten zu viel Zucker und mit Salat und Kohl vorsichtig sein, davon kriegen die leicht Blähungen.\n\n\n\nDa wir beim Thema Tierhaltung sind, die Tauben die ich aufnehmen musste haben angefangen selbstständig zu Fressen ich muss die nicht mehr mit Spritze Zwangsfüttern. Hurra.\nAber ich hab es immernoch nicht geschafft die zum Tierarzt zu schleppen, dass klappt erst Montag, da hab ich das erste mal seit 16 Tagen frei.\nDienstag mach ich dann einen Thread auf zum Thema Namensgebung der Beiden, macht euch schon mal Köppe.","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T14:03:38.562+0000","up_votes":1,"down_votes":0,"body":":D Du hast echt Zwergkaninchen? :3 Und du kuschelst auch mit denen?\n\nIch hab so schöne Käfig-Gestaltungsmöglichkeiten gefunden heute beim googeln :o Man könnte was richtig schönes machen!\n\nUnd du willst das wir uns Namen für die Täubchen ausdenken? D: Aber wir kennen sie doch gar nicht! Wissen nicht was sie so für Macken haben, wie sie aussehen, welche Besonderheiten sie haben x.x","replies":[{"poster":"Dr Madscientist","date":"2018-05-11T14:16:04.628+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Schokohörnchen,realm=EUW,application-id=YnZkMR0R,discussion-id=AP6deroA,comment-id=00060000,timestamp=2018-05-11T14:03:38.562+0000)\n>\n> :D Du hast echt Zwergkaninchen? :3 Und du kuschelst auch mit denen?\n> \n> Ich hab so schöne Käfig-Gestaltungsmöglichkeiten gefunden heute beim googeln :o Man könnte was richtig schönes machen!\n> \n> Und du willst das wir uns Namen für die Täubchen ausdenken? D: Aber wir kennen sie doch gar nicht! Wissen nicht was sie so für Macken haben, wie sie aussehen, welche Besonderheiten sie haben x.x\n\nIch hatte mal mehrere ist aber nur noch ein Zwergkaninchen und das ist auch schon reichlich alt und verträgt sich nicht mehr mit anderen Tieren.\nGrießgrämiger Streihammel ist das. Der Käfig steht genau neben dem Schreibtisch in meinem \"Arbeitszimmer\" da kann der drauf rumlaufen, der sitzt im Winter meist direkt neben dem Computer-tower und wärmt sich an dem Gerät. Manchmal springt der auch beim Zocken auf die TAstatur und verlangt ein leckerli. Ist ganz witzig.\n\nWas die Namen der Tauben angeht: ich hab keine Idee wie ich die beiden nennen soll, also kann das OT auch Vorschläge abgeben. Ich bin nur Froh, dass die jetzt alleine Fressen.\n\nIch arbeite mit und am Menschen, wenn ich Feierabend habe will ich mit Menschen nix mehr am Hut haben und umgebe mich lieber mit Tieren, die wenig Zeit kosten. Zeit hab ich einfach zu wenig für was anderes.","replies":[]}]}]},{"poster":"Eibert Rümmel","date":"2018-05-11T11:26:04.144+0000","up_votes":1,"down_votes":0,"body":"Während der Arbeit schmeckt das Bier immer noch am besten","replies":[]},{"poster":"Eibert Rümmel","date":"2018-05-11T10:36:42.703+0000","up_votes":1,"down_votes":0,"body":"jetzt ist nur die Frage ob ich heimgehe oder noch ne stunde chille.... hm","replies":[]},{"poster":"Eibert Rümmel","date":"2018-05-11T06:20:12.784+0000","up_votes":1,"down_votes":0,"body":"Antrag abgelehnt :P","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T06:21:16.066+0000","up_votes":1,"down_votes":0,"body":"WAS? WARUM?\n{{sticker:sg-ahri-1}} {{sticker:sg-soraka}}","replies":[{"poster":"Eibert Rümmel","date":"2018-05-11T06:30:34.419+0000","up_votes":1,"down_votes":0,"body":"du sollst was arbeiten und nicht den ganzen Tag mit den Kanibchen schmusen :P","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T06:37:32.203+0000","up_votes":1,"down_votes":0,"body":"D: Als würde ich dann den ganzen Tag mit den Häschen rum hantieren! Und selbst wenn... dann wäre das immer noch sinnvoller, als das was ich gerade mache. Nämlich nichts außer Hasenbilder zu gucken!","replies":[{"poster":"Eibert Rümmel","date":"2018-05-11T06:51:45.580+0000","up_votes":1,"down_votes":0,"body":"Ja Brückentage sind schon entspannt. Hab in Ruhe gefrühstückt. dann kurz was für nächste woche vorbereitet. Grund genug für eine Raucherpause. jetzt geh ich Kaffee trinken. dann mach ich wieder kurz was. dann machen wir weisswurstfrühstück und dann ist fast schon feierabend. Versteh ich nicht, wieso man für solche Tage einen Urlaubstag verschwendet ;)","replies":[{"poster":"RainerKilltKeina","date":"2018-05-11T06:54:30.885+0000","up_votes":1,"down_votes":0,"body":"xD schaut nicht bei jedem so aus!\nGGWP","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T07:08:48.810+0000","up_votes":1,"down_votes":0,"body":"ISSO! Zumal ich nicht mal ein Frühstück habe. Aber ich habe mir einen geklauten Kakao aus dem Automaten gegönnt :> Vor allem weil ich mein KitKat heute vergessen habe :(\n\nHab auch schon den Friseur gemacht. Zumindest die Aufstellung. Ich müsste noch einen/ zwei Zusatzverträge schreiben und Sachen für einen Neueinzug am Montag vorbereiten. Aber... sind wir ehrlich. Ich hab halt null Bock. Aber ich befürchte wenn ich es nicht mache, dann vergeht der Tag erstens nicht, zweitens muss ich das eigentlich machen mit den Verträgen und drittens hätte ich Montag noch weniger Bock drauf und hätte dann tierischen Stress weil es dann gemacht werden MUSS innerhalb ein paar Stunden x.x","replies":[{"poster":"RainerKilltKeina","date":"2018-05-11T07:18:49.453+0000","up_votes":1,"down_votes":0,"body":"Ich hab nen Kaffee getrunken ^^\nwie jeden morgen.\n\nMach es heute, dann ist es getan.","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T07:28:16.841+0000","up_votes":1,"down_votes":0,"body":"Jaaaaa, im Laufe des Tages. Wird schon.\n\nAber da durch das ich heute so krass verschlafen habe, ist meine überdrehte Freude schon wieder zu nichte gemacht","replies":[{"poster":"Eibert Rümmel","date":"2018-05-11T07:37:53.045+0000","up_votes":1,"down_votes":0,"body":"Hast du wenigstens was schönes geträumt?","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T08:05:32.259+0000","up_votes":1,"down_votes":0,"body":"Nein. Ich habe geträumt den Wellensittichen Fahrradfahren bei zu bringen?! Und irgendwas war mit Soulworker. Ich wollte nicht aufwachen weil ich noch was zu ende spielen musste. Mit der Gold 3 Promo war auch irgendwas inkl. Stäbchen. Aber das kriege ich nicht mehr zusammen x.x","replies":[{"poster":"Eibert Rümmel","date":"2018-05-11T08:33:22.903+0000","up_votes":1,"down_votes":0,"body":"oo das klingt merkwürdig ;)","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T08:47:36.558+0000","up_votes":1,"down_votes":0,"body":"Das war auch kein richtiger Traum, sondern eher so Fetzen .-. von einem zum anderen gesprungen und ein wildes Durcheinander sag ich dir!","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T10:14:30.126+0000","up_votes":1,"down_votes":0,"body":"Tja. Da siehst du mal wie schlecht du von mir denkst! .-. Bzw. Sehe ich es","replies":[]},{"poster":"Eibert Rümmel","date":"2018-05-11T10:00:28.640+0000","up_votes":1,"down_votes":0,"body":"achsoooooooooooooooooo\n\nwas hab ich da nur wieder reininterprettiert :O :P","replies":[]},{"poster":"Schokohörnchen","date":"2018-05-11T09:59:19.149+0000","up_votes":1,"down_votes":0,"body":":x Ich rede hier von Traumfetzen! Von einem Traumfetzen zum nächsten gesprungen D:","replies":[]},{"poster":"Eibert Rümmel","date":"2018-05-11T09:27:37.192+0000","up_votes":1,"down_votes":0,"body":"von einem zum anderen gesprungen.... sososososo","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Rudeltreiber","date":"2018-05-11T08:48:23.489+0000","up_votes":1,"down_votes":0,"body":"Ich genehmige nur welche mit Schlappohren {{sticker:sg-lux}}","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T09:22:58.622+0000","up_votes":1,"down_votes":0,"body":"x.x Einer von denen darf Schlappohren haben","replies":[]}]},{"poster":"Necromant","date":"2018-05-11T06:34:38.334+0000","up_votes":1,"down_votes":0,"body":"Guten Morgen :D","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T06:36:40.718+0000","up_votes":1,"down_votes":0,"body":":p Huhu","replies":[{"poster":"Necromant","date":"2018-05-11T06:49:01.005+0000","up_votes":1,"down_votes":0,"body":"Ich darf mich jetzt nochmal mit meinem Projekt auseinander setzen ..","replies":[]}]}]},{"poster":"RainerKilltKeina","date":"2018-05-11T06:38:17.062+0000","up_votes":1,"down_votes":0,"body":"Würde dir zustimmen!","replies":[{"poster":"Schokohörnchen","date":"2018-05-11T06:41:05.188+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank!","replies":[]}]}]}