{"poster":"Sadman1213","date":"2016-12-14T22:43:33.675+0000","title":"New Winter Themed Summoners Rift Causing Vision Problems","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":1,"body":"Hello everyone,\r\nI just wanted to put it out there that the new winter themed summoner's rift is very nice looking.\r\nHowever, I can not play the game, because the colour scheme, contrast, brightness (I dont know what the issue is really to be honest).\r\nThroughout my first 30 minute game, I was tearing up the whole game, and I had a terrible time purely due to vision issues. I just wanted it to be know that I am having this very upsetting issue.\r\nI also know that I am not the only one, as a couple of my teammates in that game also had this same issue.\r\nI honestly dont know any ways to fix this, but I think an option to maybe change to the summer/normal theme might be an idea.\r\nWell let me know what you think if you are reading this.\r\nSincerely,\r\nSadman1213{{champion:80}}","replies":[{"poster":"Targons Blade","date":"2016-12-15T00:53:42.982+0000","up_votes":2,"down_votes":0,"body":"Damn, I'm sorry to hear the map was causing you physical discomfort. I wish there were a way you could toggle the map back to the classic one, but there isn't an option for this, unfortunately. It looks like the only mode that doesn't use the winter version of the map is Ranked Summoner's Rift.\n\nI'm sorry I didn't have a direct solution for your issue, but you may want to mess with your monitor's contrast or brightness settings to see if it makes looking at the winter map any less uncomfortable. Please let me know if you have any questions.","replies":[{"poster":"Incomitatus","date":"2016-12-17T01:59:07.436+0000","up_votes":2,"down_votes":0,"body":"I too  just wanted to throw in my support for hopefully in the future adding an option to revert to an alternate map if needed. While I absolutely love the winter summoner's rift, the detail, art, and animations are all amazing and adorable...I'm experiencing intense eye strain trying to focus, and unfortunately I suffer from cluster headaches so I've actually experienced going into a full fledged attack because of this. Thankfully this isn't an issue in all game modes right now, but having to adjust my monitor solely to play League is an unfortunate step to put on players, especially ones who may not be aware of their own limitations or problems until in the game, and then also might not be aware enough to identify the problem as the color scheme of the map. Please in the future give us an option to manipulate the colors\\revert to the original map if need arises. I shouldn't be forced to endure literal pain and agony, as if someone is trying to push my eyeball out of it's socket from the inside with a fire poker, just to finish a game. :(","replies":[]},{"poster":"Kobold","date":"2016-12-15T01:07:56.573+0000","up_votes":1,"down_votes":0,"body":"This was brought up before on the Bildgewater aram map as well and no solution was given and seems to be the same on this (2 years?) later map as well. where there is not the option to have it be visually the older map as the mesh mapping should be the same correct?","replies":[]}]},{"poster":"66 Misty 99","date":"2016-12-15T08:31:36.035+0000","up_votes":1,"down_votes":1,"body":"The colour scheme is really bothering my eyes. I cant seem to focus properly. It feels like I'm peering into a dark alley.","replies":[]},{"poster":"phiskt","date":"2016-12-15T03:53:06.656+0000","up_votes":1,"down_votes":2,"body":"I am, too, also having the same problem, is there anyway I can reverse the theme to normal? As for now, I will stop playing the game for a while, it causes eye cancer! Hope that you consider what it feels like for people like us, Riot!","replies":[]},{"poster":"resumed","date":"2016-12-14T22:47:32.216+0000","up_votes":1,"down_votes":2,"body":"im having similar issues, but i can't really focus on anything. the contrast is very different and the brightness stresses me out\n\ni dont think ill be able to play anything but my best picks until january 9th or until we get an option to disable it","replies":[]}]}