{"poster":"MyReaLoLAccount","date":"2018-01-14T08:51:44.216+0000","title":"Why does losing a 4v5 count as a loss to your promos?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So I was playing league, happy that i finally made it to my promos. I get in a match, play as normal for about 4 minutes, but then our Katarina just quits. I hoped that it would not count as a loss, because we couldn't remake. But surprise, we couldn't remake and losing a 4v5 still counts as a loss and makes it so im back at 50 lp. It really isn't fair that this happens, because Riot should never expect you to be able to win a 4v5 match. They need to implement a system that makes it so losing an unfair match up does not count as a win or a loss, but rather just gives you experience like a normal, non-ranked match. Any idea why they haven't done something like this yet?\n","replies":[{"poster":"Broporo","date":"2018-01-15T05:27:35.893+0000","up_votes":1,"down_votes":0,"body":"Taliyah has the right idea with why this still counts as a loss. It's not that we \"expect\" you to still be able to win. It boils down to the fact that League is a team-based game. Win or lose together as a team. \n\nIf the system was designed to forfeit any win/loss on an uneven team, AFK's and ragequits would be a MUCH bigger issue to deal with for sure.","replies":[]},{"poster":"Taliyah Supp","date":"2018-01-14T09:50:29.879+0000","up_votes":3,"down_votes":0,"body":"Agreeing with Chermorg here.  If there was a system in place, your friend could just setup a twink and then you queue together. If the game doesnt go as planned your twinkmade goes afk > loss prevented. Thats just one quick way to exploit this kind of safeguard, probably more.\n\nDont get me wrong. i lost ranked promos because of AFKers aswell. It sucks and nobody leaves the match statisfied. But you know, sometimes your fed Yi carries you solo. Ranked is nothing more than glorified gamble with some input of your own. Do your best and the rest is up to chance :)","replies":[{"poster":"MyReaLoLAccount","date":"2018-01-15T20:35:11.640+0000","up_votes":1,"down_votes":0,"body":"I guess that makes sense, it's just kinda disheartening when this happens. Thanks for the responses :)","replies":[]}]},{"poster":"Chermorg","date":"2018-01-14T09:10:18.129+0000","up_votes":2,"down_votes":1,"body":"\"oh, we're losing? lemme afk so my team can avoid getting a loss\"","replies":[]}]}