{"poster":"VoidOverLord","date":"2016-01-13T22:41:03.381+0000","title":"New Champion","subforum":"Oceanic University Championship","embed":{"description":null,"url":"http://pre06.deviantart.net/edda/th/pre/i/2014/066/2/f/plague_doctor_by_hagazusa-d79934l.jpg","image":null},"up_votes":1,"down_votes":0,"body":"I have been thinking about this for some time and i think it will be a god idea.\r\n\r\nthis Champion will be the same as a plague doctor\r\n\r\npassive:Plague--&gt; deals hp damage per second(the damage depents on the Champion&#039;s level and masteries)\r\n\r\nQ:medicine--&gt;Plague doctor throws an poison &#039;round bottle&#039; when it hits an enemy Champion it will poison him but the poison will also transfer to nearby enemies(the damage again depents on the Champion&#039;s level and masteries)\r\n\r\nW:unpleasant surprise--&gt;the Plague doctor turns into a shadowy form of him slowing nearby enemies, temporarily increasing the doctors movment speed, armor and magick resistance and enemy minions will not target him as long as he is in that form even if he attacks a Champion. Unpleasant surprise will also stun all nearby enemies + minions for 1.5 seconds if the Plague doctor uses it while hiding in the bushes(and come out in his shadowy form)\r\n                                                                                            \r\nE:Drain--&gt;when plague doctor uses drain it will just drain (10-15-20-25%) of both health and magicka/mana out of an enemy champion(if the enemy champion does not uses magicka/mana then the Plague doctor will slow them down and speed boost him self)\r\n\r\nR:Black death--&gt; black death will target an enemy then stunning, slowwing, disabling healing and all of the champion&#039;s positive effects and if black death is used at the same champion again (in the row) it will do the same thing multiplied by 2","replies":[{"poster":"lordofrage","date":"2016-01-13T23:27:43.254+0000","up_votes":1,"down_votes":0,"body":"assassins creed up in here","replies":[{"poster":"VoidOverLord","date":"2016-01-14T03:20:40.583+0000","up_votes":1,"down_votes":0,"body":"lol","replies":[]}]},{"poster":"VoidOverLord","date":"2016-01-14T01:42:23.585+0000","up_votes":1,"down_votes":0,"body":"Don't forget to let me know of what you thing ;)","replies":[]}]}