{"poster":"RMRs","date":"2015-03-25T05:40:59.088+0000","title":"UN LAMENTOSO CHE SI È STANCATO DI LAMENTARE (restrizioni in generale)","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ciao forum\r\nMi rivolgo a tutti, per tutti intendo compagni di lol, rioter etc etc.. \r\nC'è chi prende la parte del santo, chi del co..ne, chi del pirla, vuoi perché non c'è il tribunale, o perché veramente hai flammato, o per qualsiasi altro motivo hai preso un ban, o una restrizione (come ho fatto io) SCONTALA!!! Ora puoi solamente scontarla!! Ingiusta, giusta, sensata o no, scontala! \r\n\r\nVorrei solamente chiedere a chi se ne occupa di pubblicizzare la cosa! Perché c'è veramente chi spamma sul tasto report! C'è veramente chi non sa quale cliccare e ne clicca uno a caso tanto per.. \r\nPerché non si mettono fuori tante informazioni? A tal modo si può anche far prendere molto più seriamente tutti i report! (Ho visto persone che difronte ad una minaccia di reporto scrivono \"Np report me \")\r\nPoi secondo me, dovrebbero anche mettere un tribunale solo per alcuni report, cioè persone competenti che di diano la pena, un programma non può catalogare tutti! Può catalogare un nome inappropriato, ma non un abuso verbale! \r\n\r\n\r\nUn altra cosa.. Dopo aver preso una punizione vie funziona? Hai la \"fedina penale\" pulita o rimmarrai in una lista nera della riot?","replies":[{"poster":"A Yordle ln Heat","date":"2015-03-25T06:22:23.669+0000","up_votes":1,"down_votes":1,"body":"Io sono uno di quelli che scrive spesso e volentieri \"report me; enjoy wasting a report.\", ma non perché me ne sbatto di essere punito o mi ritengo intoccabile, bensì perché di solito la gente che mi reporta lo fa o a caso (capita di venire reportati per \"linguaggio offensivo\" dai nemici solo perché li si ha dominati durante la partita) o per motivi in cui il report non serve (il classico \"hai preso una kill all'ADC? Reported.\"; sai quanta gente reporta per questo? Tanta. Sai quanta gente viene PUNITA per questo? Praticamente nessuno.)\nTra parentesi: una macchina può benissimo catalogare un abuso verbale.\n\nBasta scrivere una lista di parole che non si possono dire; una persona ne scrive una? Bam, quella persona è reportabile per abuso verbale.","replies":[{"poster":"RMRs","date":"2015-03-25T07:30:18.166+0000","up_votes":1,"down_votes":0,"body":"Si common! Sulla seconda parte hai ragione! Ho sbagliato io! \nEsatto! Proprio perché si viene reportati a caso! \nMa sulla prima rimango fermo alle miei idee.. Un player può permettersi di \"prendere ironicamente\" il sistema dei report quando esso non funziona o funziona solo in parte! \nIo quando vede gente scrivere \"okok non c'è problema reportati pure\" in molti casi era il Flamer o un giocatore negativo! Poi è chiaro che dipende dai casi! Se tu non fai niente e se la pigliano con te, ovvio che non hai problema perché sai di non aver fatto niente!","replies":[]}]}]}