{"poster":"sin cos tan","date":"2015-07-10T07:58:14.476+0000","title":"How is ranked calculated? (And other stuff too)","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Hi there! \nBefore I start, I want to say I&#039;m an slightly below average player of 100lp at Gold IV.\nI couldn&#039;t find a riot link on who you get matched with in the ranking system. I recently played a game where I was the only Gold IV guy with the rest of the players who were all Platinum V except 2 people who were Gold II and a guy unranked. I would also like to point out I finished season 4 as a Bronze II and was Silver III for 6 hours before season 5 reset. rip no border for me.\n\nDoes this mean I would quickly rank up? How is MMR calculated? Where can I find it? Is mine high or lower than the expected? Is going for Platinum for ME by the end of this season achievable since I verse Plats already? \nThe average amount of lp I get is around 28lp and the average amount of ip lost is 15lp. Does red or blue side have the higher mmr? Which side gets more lp? Which side loses more?\n\nI am also looking for a partner that can train me in order for me to improve on what I can do better, sometimes I don&#039;t even get the basic stuff right like warding (I buy like 2 the whole game) and sometimes we throw games or our team fights are messed up. I want someone who can teach me what to do in team fights and positioning well (I am comfortable with any role except bot lane, this is because if I make a mistake he/she rages at me for doing bad then blames me for everything). We can also duo if I&#039;m comfortable with it. \nIf you do a fantastic job at this, I will be rewarding you for helping and tutoring me with some skins of your choice depending on how much I think I&#039;ve improved. \n\nFor more information on my account and what champions I play you can check it here... \nhttp://oce.op.gg/summoner/userName=BoxBox%20Jnr \nhttp://www.lolking.net/summoner/oce/980161 \n\nPlease add me if your interested,\n\nYours Sincerely,\nBoxBox Jnr \n(That name though)","replies":[{"poster":"JasonWazza","date":"2015-07-10T20:39:05.437+0000","up_votes":2,"down_votes":0,"body":"Playing against plat V's means very little, as they probably have Gold 4-Gold 2 MMR, however looking at your games, you look like you have a high gold 3 low gold 2 MMR.\n\nI did add you and can give you some more general tips on a fair few things, but i am also someone that is learning/climbing so don't expect to learn everything.","replies":[]}]}