{"poster":"Dædalus","date":"2014-11-18T18:01:44.678+0000","title":"Új dzsungelszörny fordítása","subforum":"Általános beszélgetés","up_votes":10,"down_votes":1,"body":"Sziasztok!\n\nNemsoká megérkezik az új dzsungelszörny a pályára, méghozzá a pálya két felét elválasztó folyóba. Ennek örömére úgy döntöttünk, szeretnénk titeket is bevonni nevének fordításba, így előbb ötleteket vártunk tőletek, majd a legnépszerűbb ötletekből [ki is írtunk egy szavazást](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/xeazAxz5-aj-dzsungelszarny-fordautaasa-szavazaas), amelyen több százan voksoltatok a nektek legjobban tetsző név mellett.\n\nA legtöbb szavazatot, méghozzá elsöprő többséggel a **Suhanó sutyerák** név kapta. Abban az érdekes helyzetben voltunk viszont, hogy bár a számok elég egyértelműen beszélnek, a hozzászólások között rengetegen aggodalmukat fejezték ki a névvel kapcsolatban, miszerint egy ilyen név nem való egy olyan komoly játékba, mint a LoL.\n\nA Sutyerák mellett és ellen is elhangzottak érvek: ha emlékeztek, pár éve elsöprő többséggel megszavaztuk, hogy legyen Chuck Norris hidunk, aztán hiába a többség ereje, végül mégis csak Megyeri híd lett az objektum neve, tehát bizonyos szempontból mindenképp érthető azok aggodalma, akik úgy érzik, túlságosan komolytalan lenne egy ilyen nevű szörny az Idézők szurdokára. Közben persze a lényünk messze nem lesz a pálya sztárja, még a dzsungelszörnyek között is egy kis mellékszereplőnek tekinthető a baron, a sárkány, a kék és piros buffok mellett, tehát vannak érvek, ami szerint igenis elfér egy ilyen kis humormorzsa a játékban.\n\nMindent összevetve úgy döntöttünk tehát, hogy mivel az előszezon most kezdődik, amelynek célja épp az, hogy különféle változásokat teszteljünk, és teszteljetek ti is, egyelőre **betesszük a Suhanó sutyerákot a játékba**, mert élőben látni mégis más lesz őt, mint egy fórumon szavazgatni róla -- annak, akinek papíron tetszett, lehet, hogy a játékban nem fog, és fordítva. De semmi probléma, **az előszezon éppen erre való**, hogy különféle ötleteket tesztelhessünk.\n\nEzért ugyanúgy, mint a játékbeli változásokat, kérjük, az új dzsungelszörny magyar nevét is \"teszteljétek\". Jegyezzétek meg, hogy hogy tetszik elsőre, amikor meglátjátok, majd adjatok neki egy kis időt, és figyeljétek meg, hogy véleményetek változik-e az idők folyamán, jobban megutáljátok-e, vagy épp megszeretitek azt. A lényeg, hogy néhány hét tesztelés után **ismét meg fogjuk látogatni az ügyet**, és miután mindenki leellenőrizte a játékban, a korábbi legnépszerűbb szavazatokból ismét ki fogunk írni egy szavazást, amelyben azt kérjük majd, mérlegeljétek az első benyomást, valamint a hetek utáni, kicsit leülepedett véleményt is.\n\nReméljük, ez így mindenkinek megfelel. Fontos számunkra a véleményetek, ezért kérjük, osszátok meg velünk, mit gondoltok erről a megoldásról, aztán ha bekerül a játékba a rák, jegyezzétek meg az első benyomást, mert pár hét múlva szavazunk, és akkor fontos lesz ez az információ is.\n\nKöszönjük nektek, hogy együtt dolgoztok velünk a League of Legends magyar verzióján, ti vagytok a legjobbak! :)","replies":[{"poster":"EDGE Tin Woodman","date":"2014-11-18T21:44:40.079+0000","up_votes":4,"down_votes":1,"body":"Szerintem a suhanó sutyerák egy találó név. Semmi nem tetszhet mindenkinek.  (Szerintem) csak azért lett több az ellenző megjegyzés mert akik szavazás után meglátták hogy nem az a név lesz amire ők szavaztak ki akarták verni a balhét. Én imádom az ötletet. És azért valljuk be hogy ez a kis rák azért elég sovány humorforrás a hatalmas pályához képest.  Ennyit aztán igazán megengedhetünk magunknak :3   És amúgy is. Aki játszani akar azt nem egy rák fogja rábírni annak ellenkezőjére. Ha valaki azért jön hogy komoly dolgokat játsszon annak ott  a *Dota* abban a játékban nem hogy poént nem fog találni de még csak egy száraz faviccet sem. (ezzel nem arra utalok hogy a dota rossz vagy esetleg jó játék, csak arra hogy komolyabb). Szerintem ha játék akkor már legyen vicces. \n\n\"Suhanó szív suttyó lélek sutyerák leszek amíg élek !\"\n                                                                                               Győri Bálint, 2014","replies":[{"poster":"Neoen Shinin","date":"2014-11-18T22:57:44.486+0000","up_votes":5,"down_votes":1,"body":"Szerintem a tiltakozók nem a vicces tartalom ellen szólaltak fel és nem is azért mert nem az övék nyert, hanem mert színvonalon alulinak találták az elnevezést. Bevallom elsőre én is felnevettem amikor olvastam a sutyerák elnevezést, mégsem támogatom a játékban való megjelenését. Persze ha ez kerül be a játékba én sem fogom abbahagyni, de az eddigi frappáns ötletek, megvalósítások sorából igenis ki fog lógni. Pedig van humortartalom nem kevés a játékban. Mindez éretten és intelligensen került bele. Elismerem, nem vág földhöz a többi lehetőség sem, de magam sem tudok jobbakat. Illetve a késői hozzászólásokban olvastam, hogy valaki felvetette a **VÍZIPÓK** nevet. Ez volt az első amire azt mondtam, hogy szuper. Akkor is ha rákról van szó és nem pókról. És van kellő magyar vonatkozása is.","replies":[]},{"poster":"Zooty","date":"2014-11-18T22:07:49.478+0000","up_votes":3,"down_votes":0,"body":"Igazából van itt komoly tartalom, és egy Sutyerák elnevezés semmit sem fog elvenni ebből.\nA komolyságát a játéknak a lényegibb részekben találni. A lore-ban, a hősök történetében, a motivációiban, a jellemükben stb. Az hogy emellett vannak kis poénkodások, nem befolyásolnak semmit a játék komolyságát illetően, csak színesebbé teszik a játék egészét...","replies":[]}]},{"poster":"Gege30","date":"2014-11-19T13:57:24.991+0000","up_votes":3,"down_votes":0,"body":"A vízipók egy jó ötlet!","replies":[{"poster":"Zooty","date":"2014-11-19T19:55:01.700+0000","up_votes":1,"down_votes":2,"body":"A baj az hogy ez nem egy pók..","replies":[{"poster":"FF Shaffy","date":"2014-11-21T14:26:00.582+0000","up_votes":2,"down_votes":0,"body":"És nem is sutyerák.\n (sutyerák: \"enyhén\" nem a mai kultúrális normáknak megfelelően viselkedő ember műveletlen, modortalan, sok esetben bunkó is, stb.)\nÉn továbbra is foggal és körömmel ellenkezek a \"suhanó sutyerák\" (~~wtf is this sh*t?~~) név ellen.","replies":[{"poster":"Zooty","date":"2014-11-21T14:59:02.955+0000","up_votes":1,"down_votes":0,"body":"Azért van ez az egész, hogy olyan nevet találjunk ki neki, ami a többségnek jó..\nValószínűleg lesz egy végleges szavazás majd, ahol majd megszavazzuk hogy véglegesen mi lesz a neve..","replies":[]}]},{"poster":"Tazsam","date":"2014-11-20T09:05:34.756+0000","up_votes":1,"down_votes":0,"body":"> A baj az hogy ez nem egy pók..\n\nSzintén a vízipók csodapókban szerepelt \"rák apó\" tekintve, hogy ma kipróbáltam és suhanni aztán tényleg nem suhan úgy gondolom ez is megfelel és legalább nem olyan konkrét kikacsintás mint a vízipók. Ha valaki utánanéz egyszer, hogy miért rák apó a magyarban az majd elmosolyodik aki meg nem néz után azt úgyse érdekli.","replies":[]}]}]},{"poster":"DannyT","date":"2014-11-19T13:50:00.010+0000","up_votes":3,"down_votes":1,"body":"Szerintem a **Suhanó sutyerák** név tökéletesen illik ebbe a környezetbe. \nHa azt nézzük, ez csak egy, a játék közben, a képernyő jobb alsó sarkában megjelenő kiírás lesz, ha rámutatunk majd a kis rákocskára, tehát semmi komolyat sem határoz meg a játékban, viszont emellett nagyon mókás szerintem. :)\nÉs ha a játék komolyságát nézzük, ez a poénfaktor még éppen belefér, szóval szerintem nincs miért aggódni. :)","replies":[]},{"poster":"DarkSt4r789pm","date":"2014-12-19T18:56:16.220+0000","up_votes":1,"down_votes":0,"body":"Véleményem szerint a \"**Suhanó sutyerák**\" egy tökéletes név, legalább van valami humor a magyar fordításban is... :)","replies":[]},{"poster":"Flammeo","date":"2014-11-20T11:29:14.733+0000","up_votes":1,"down_votes":0,"body":"Mi lett a Spurirák névvel?","replies":[]},{"poster":"MiG MádLife","date":"2014-11-20T02:32:29.173+0000","up_votes":1,"down_votes":0,"body":"Én a suhanó sutyerákra szavaztam, szerény véleményem szerint ez cseng a legjobban. :P És igen, ennyi humor bőven belefér egy ekkora pályába. Normális nevet meg egyébként sem hiszem, hogy ki lehetne találni neki. (Normálisat? Elvégre a scuttle magyar fordítása szenesvödör...)  Nekem először csigusz jutott róla eszembe a spongya bobból a páncéljára visszanyúló csápjai miatt. Én pöttyöket rajzolnék még rá és elnevezném Katinak. :D De voltaképp ha már a nevekről van szó és mindenki egy rákból indult ki szerintem nevezzük csak simán Sanyinak. :P","replies":[]},{"poster":"Zooty","date":"2014-11-18T20:28:24.959+0000","up_votes":1,"down_votes":0,"body":"Rákerestem google képkeresővel a \"suhanó sunyerák\" szóra, és egyedül ezt az egy találatot adta vissza:\nhttp://canadahun.com/data/avatars/m/45/45009.jpg?1369955987\n--- \nEz egy jel! \nŐ lehetne Magyarország gyöngyszeme; a mindenki szemébe örömteli ragyogást hozó rák, aki suhanva hoz jókedvet az Idézők Szurdokába, majd mielőtt észrevennéd munkásságát, már el is sunnyogott!","replies":[{"poster":"Blind Lemon Jeff","date":"2014-11-18T22:24:48.594+0000","up_votes":1,"down_votes":0,"body":"> Rákerestem google képkeresővel a \"suhanó sunyerák\" szóra, és egyedül ezt az egy találatot adta vissza:\n> http://canadahun.com/data/avatars/m/45/45009.jpg?1369955987\n> --- \n> Ez egy jel! \n> Ő lehetne Magyarország gyöngyszeme; a mindenki szemébe örömteli ragyogást hozó rák, aki suhanva hoz jókedvet az Idézők Szurdokába, majd mielőtt észrevennéd munkásságát, már el is sunnyogott!\n\nAkkor keress újra rá, az sutyerák nem sunyerák,vagy úgy kerestél rá, csak félre irtad?:D","replies":[{"poster":"Zooty","date":"2014-11-19T00:38:49.131+0000","up_votes":1,"down_votes":0,"body":"Alternatív név, jó az! :D","replies":[]}]}]}]}