{"poster":"Zxd","date":"2017-11-19T19:16:32.922+0000","title":"Tengo perdida de paquetes","subforum":"Problemas Técnicos","up_votes":4,"down_votes":0,"body":"muy grande y ya llam&eacute; a mis proveedores pero no vienen m&aacute;s . que podr&iacute;a hacer?","replies":[{"poster":"Lautinvocador","date":"2017-11-20T04:42:21.307+0000","up_votes":1,"down_votes":0,"body":"Hola, yo tambien tenia muchisimas perdidas de paquetes y mira lo solucione asi:\nFui al soporte de Riot y abri un Chat Beta (Vas y haces un ticket normal, pero en vez de elegir la opcion del ticket, elegis la del chat)\nTe van a pedir que te instales el Hextech Repair Tool, Instalalo.\nDespues te van a decir que marques unas casillas especificas para poder comprobar si efectivamente son perdidas de paquetes.\nLuego, si por casualidad no son perdidas de paquetes o no esta muy claro, te van a pedir que hagas un Tracert (Si no sabes q es no te preocupes q ellos, Los de Riot, lo explican bien)\nAca hay dos cosas:\n1) Son perdidas de paquetes y tenes q llamar a tu proovedor de internet (Seguramente el soporte de Riot te de algun archivo o algun codigo del cmd para que muestres que efectivamente son perdidas de paquetes)\n2) No son perdidas de paquetes, tenes q llamar a tu proovedor de internet y mostrarle el tracert que tendria q decir algo asi: Tiempo de espera agotado para esta solicitud. Pero esa misma oracion repetidas veces.\n\nOtra cosa que te cuento q puede ser mas facil: El otro dia pense q yo tenia devuelta perdidas de paquetes, los de Riot me dijeron que no eran, y me acorde que hacia poco habia cambiado el DNS, entonces lo puse en automatico o algo asi y PAM La magia sucedio y juge normal como siempre.\n\nEspero que el soporte de Riot te ayude !\nSaludos{{summoner:6}}","replies":[{"poster":"Zxd","date":"2017-11-26T06:06:51.029+0000","up_votes":1,"down_votes":0,"body":"era el módem, llame a mi proveedor y me lo cambiaron\nigualmente gracias por la info y el tiempo que te tomaste para escribirla","replies":[]}]},{"poster":"SolidDisk","date":"2017-11-19T19:22:13.722+0000","up_votes":1,"down_votes":2,"body":"ya llamaste a los del correo?, a lo mejor tienen un numero de seguimiento","replies":[{"poster":"latorre","date":"2017-11-20T01:08:03.443+0000","up_votes":1,"down_votes":0,"body":"paquete de datos...","replies":[]}]},{"poster":"Mazer Rakham","date":"2017-11-19T21:07:34.050+0000","up_votes":1,"down_votes":0,"body":"Tenes wi-fi? Si es así, comprá un cable Ethernet que alcance del módem a tu PC y San Seacabó","replies":[]},{"poster":"ParliaMént","date":"2017-11-19T19:30:16.704+0000","up_votes":1,"down_votes":0,"body":"si notas el modem caliente, no hagas nada solo espera al tecnico para que te lo arregle, quizas cambiarle algun dondensador o comprar uno nuevo. Si es que se trata de perdida de paquetes, por que si es por malos ms los factores son miles","replies":[]}]}