{"poster":"Baer","date":"2017-11-27T23:31:02.603+0000","title":"Dauerhaft Lastpick im Draft/Ranked","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Wurde es nicht irgendwann mal so eingerichtet, dass die Pickorder v&ouml;llig random ist? \r\nIch war jetzt mit meinen Mates in einer 5er Lobby und wirklich ausnahmslos jedes Game Lastpick (was wenn man mal einen Dauerpick Champ spielen will unm&ouml;glich ist). \r\nUnd bevor es kommt: nein ich habe weder die niedrigste noch die h&ouml;chste MMR in der Konstellation, noch hat die Inviteorder oder Joinorder der Lobby eine Auswirkung darauf gehabt (ja wir haben das alles getestet)\r\nIch kann&#039;s mir leider auch nicht mehr anders erkl&auml;ren als direkter Hass Clientseitig gegen&uuml;ber meines Accounts.\r\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Jastol","date":"2017-11-28T11:12:44.725+0000","up_votes":2,"down_votes":0,"body":"Ist der Ersteller der Lobby nicht automatisch immer First Pick?\n\nAnsonsten um direkt auf dein Problem zu antworten, warum lässt du deine Premades dann nicht für dich picken? Gerade wenn Ich mit Kumpels zu 5te zocken ist es egal wer an welcher Position ist, da wir immer das Picken, was gerade am sinnvollsten ist und dann am Ende die Champs tauchen (Ausser man vergisst mal das Tauschen, dann spielt auf einmal ne Tank Vayne Toplane).","replies":[]},{"poster":"Baer","date":"2017-11-28T15:17:42.972+0000","up_votes":1,"down_votes":0,"body":"Ja das der Lastpick normalerweise toll ist stimmt schon aber nicht wenn deine Mates nichts für dich picken können und den/die Champs die du spielen willst entweder gebannt (was nunmal passiert das tilted mich jetzt nicht wirklich) oder eben vom Gegner ge-firstpicked werden^^' und wir haben die Lobby mindestens 3 mal komplett neu gemacht mit anderem Invite-Order usw... es ist einfach wie verhext.","replies":[]},{"poster":"Hellosager","date":"2017-11-28T09:59:28.373+0000","up_votes":1,"down_votes":0,"body":"Nein, das ist kein Pech.\nMomentan ist es so, dass du bei 5er Lobbys immer die gleiche Pickorder mit deinen Mates erhälst.\nIst mir auch schon seit längerem aufgefallen. Es sollte helfen, wenn man jedes mal eine neue Lobby erstellt, statt auf Play again zu gehen.","replies":[{"poster":"Nordwolf87","date":"2017-11-28T11:05:42.065+0000","up_votes":1,"down_votes":0,"body":"Ah ok. Gut zu wissen!","replies":[]}]},{"poster":"Lunaá","date":"2017-11-28T09:59:31.723+0000","up_votes":1,"down_votes":0,"body":"Same Problem, nur das ich immer first pick bin, was dann besonders schlecht ist, wenn ich mal Midlane oder adc spielen will.\nKeine Ahnung, warum dass so ist, ich meine aber mal gelesen zu haben, dass man durch das Timing im akzepieren-Fenster ein wenig Einfuss darauf hat, wo man landet. Das galt aber glaube ich nur für Solo-Duo-Queue","replies":[]},{"poster":"Nordwolf87","date":"2017-11-28T08:44:42.698+0000","up_votes":1,"down_votes":0,"body":"Also ich bin immer happy wenn ich last pick bin, weil ich meinem pick dann mehr informationen zu grunde legen kann. Grade als Mid/Supp ungemein fein.\n\nAber ganz ehrlich selbst wenn du 5x hintereinander last pick bist ist das einfach nur pech. Du hast jedes mal eine wahrscheinlichheit von 0.2 = 20% wie für jede andere pickposition. \n\nDa das system sich nicht merkt wo du vorher warst (sondern nur du) sinkt die wahrscheinlichkeit auch mit jedem weiteren fill nicht sondern bleibt immer 0.2\n\nDie wahrscheinlichkeit des ganzen ereignisses ist natürlich mit 0.032% (0.2^5) sehr gering, aber so rechnet das system nicht.","replies":[]},{"poster":"Qbert","date":"2017-11-28T06:31:54.300+0000","up_votes":1,"down_votes":0,"body":"hmmmm, ich glaube das ist nur bei Solo/DuoQ so ... in der 5er Lobby kann das wohlmöglich anders geregelt sein.\n\nAber ich verstehe was du meinst, hatte mal einen Tag lang Pech und war in der SoloQ nur Firstpick :/","replies":[]},{"poster":"Drisinil","date":"2017-11-28T06:30:34.503+0000","up_votes":1,"down_votes":0,"body":"Da scheinst du wohl Pech gehabt zu haben.\n\nAllerdings, wo ist das große Problem daran? Wenn du unbedingt einen Champion spielen möchtest, frage doch, ob Ihn jemand für dich schon auswählt? Gerade mit Freunden/ Bekannten super leicht zu machen.\n\nIch z.B. würde es bevorzugen, wenn ich mal öfters als Letzter dran bin. Dann weis ich nämlich schon, was alle anderen 9 Leute so spielen :)","replies":[]}]}