{"poster":"Abyssial","date":"2015-12-23T14:11:14.095+0000","title":"Tenacity Gaming Community LF 2 teams","subforum":"Team Recruitment","embed":{"description":null,"url":"http://tenacitygaming.com/about-tenacity/","image":"http://tenacitygaming.com/wp-content/uploads/2015/08/Ke_Su_03-1024x507.jpg"},"up_votes":3,"down_votes":0,"body":"Hi all my Name is Shia LaRedBuff, known as Abyssial on the forums and i am the OCE Rep for the community.\r\nas pre season 6 is active, the owner and i reached a mutual decision on disbanding the current OCE team and then recruiting for the new season.\r\nas the new season rolls in my goal is to create 2 teams, one for being fully serious, and one for developing the skills required to play the game at a higher level of play.\r\nthe teams themselves have different requirements to join but they share a universal one which is \r\n*  you must register and be semi active on the forum which is linked to this post.\r\n**BOTH TEAMS ARE LOOKING FOR AT LEAST 5 NORMAL PLAYERS AND 3 SUBS**\r\n\r\nfor team one the requirements are as follows \r\n1. must be ranked as a high gold player going into the new season\r\n2. must be relatively chill. [not rage at teammates, everyone makes mistakes]\r\n3. must have a headset and be willing to join team speak or skype, [teamspeak generally incase an admin wants to see how we are doing]\r\n4. [optional] be willing to help with developing the second team to higher tier standards, must also answer any questions they have about the game\r\n\r\nSecond Team Requirements:\r\n1. can be any rank, this is more of a development team to get the team and players playing up to a higher tier level\r\n2. must be non toxic, this is a development team everyone will make mistakes.\r\n3. must have a headset and be willing to join team speak.\r\n4. be willing to any advice that is given to you as long as it is viable and not stupid.\r\n\r\n\r\n**this is a non toxic community so any salt and i will give a warning, any salt after that and you will be kicked. {unless retaliating to the enemy team or some other reasonable circumstance}**\r\n\r\nto apply for a team follow the link to the forum and post an introduction about yourself and then apply to the team in the ranked recruitment page. also state what team you are applying for by stating either team one or team two.\r\n\r\nAny questions and feel free to add me on Lol my ign is &quot;Shia LaRedBuff&quot;\r\n\r\nthanks for reading and hope to see you in the community soon.","replies":[{"poster":"CareBearKillerZz","date":"2015-12-27T05:55:21.633+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Abyssial","date":"2015-12-27T09:52:02.076+0000","up_votes":1,"down_votes":0,"body":"yea we are always looking for members.","replies":[]}]},{"poster":"Archjuggler","date":"2015-12-25T06:10:54.918+0000","up_votes":1,"down_votes":0,"body":"Hi, \nMy name is Connor, and my ign is Archjuggler :D i'd like to be part of the community as it's always fun playing with a good bunch of people\n\nIdm which team I play (if you let me) just there to play and learn a thing or too\n\nI'm d4 supp main\n\nHit me up with an add as it didnt let me follow the link T_T","replies":[]},{"poster":"traloop","date":"2015-12-24T02:44:42.315+0000","up_votes":0,"down_votes":0,"body":"I'm down for the second team","replies":[{"poster":"Abyssial","date":"2015-12-24T08:17:59.270+0000","up_votes":1,"down_votes":0,"body":"Hey please apply for the team at this website http://tenacitygaming.com/forums/topic/ranked-team-recruitment/ , it just helps me sorta see how many players have registered and for what team.","replies":[]}]},{"poster":"Fennix","date":"2015-12-24T07:20:24.988+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nMy name is Nick, IGN is Fennix. I recently I moved from NA to OCE due to the terrible lag. I’m looking for a team to join where we can all learn and improve our game, ultimately climbing the ranked ladder in Season 6.\n\nI’m a pretty chilled guy, accepting of peoples mistakes (unless it’s something like diving into the enemy team alone). I learn from my mistakes, and I’d love to improve my game to a higher tier of gameplay.\n\nI'd love to be apart of the second team (seeing as I don't quite reach the ranked requirement for the first team). I believe I will be able to learn a lot more about the game and grow as a player. \n\nI am an ADC main, currently in Silver, trying to climb to Gold in the pre-season, and then potentially reach Platinum. \n\nThank you for your time, Nick (Fennix)","replies":[]},{"poster":"Abyswalker","date":"2015-12-24T06:05:54.714+0000","up_votes":1,"down_votes":0,"body":"Hey, \n\nMy name is Sam, IGN is Abyswalker, looking to join a team and improve my skills through the higher ranks.\n\nChilled and easy to get along with, don't usually get to flamed up about mistakes, try and learn from them as best i can. I'd like to be a part of the second team and think I would be able to learn heaps about the game and improve my skills. \n\nI am a JG main, currently Bronze 3, trying to climb to silver and gold over the next season, maybe higher if possible. \n\nThanks, Abyswalker","replies":[]}]}