{"poster":"CestLeMoi","date":"2016-02-28T08:05:47.024+0000","title":"LoL auf 3d Party Programms & Co checken?","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Hey :)\r\n\r\nIch hab&#039; in letzter Zeit sehr viel von wegen &quot;Permabann, angeblich 3d Party Programms, usw&quot; hier im Forum gelesen.\r\n\r\nIch wei&szlig; ja nicht, ob die Leute echt unschuldig sind - Fakt ist aber, dass ich nicht m&ouml;chte, dass mit das auch passiert ^^\r\n\r\nDeswegen w&uuml;rde ich mich &uuml;ber eine M&ouml;glichkeit freuen, zu checken, ob ich vielleicht doch irgendwelche Programme habe, die auf mein Spiel einwirken. \r\n\r\nIch habe vor l&auml;ngerer Zeit mal custom skins benutzt (nur Rumble in the Jungle), und das Programm auch bald wieder gel&ouml;scht, weil mein LoL dann sehr stark gelagt hat ^^. Viele Leute haben aber geschrieben, dass zB die R&uuml;ckst&auml;nde irgendwelcher Programme weiterhin da und der Grund f&uuml;r den Bann waren.\r\n\r\nAuf jeden Fall hab&#039; ich keinen Bann, wurde nicht reported, benutze keine 3d Party Programme, aber lieber einmal mehr checken, als dann unn&ouml;tig gebannt zu werden  ^^\r\n\r\nLg ;)\r\n\r\nPS: Vielleicht ist das hier auch absoluter Schwachsinn und total unn&ouml;tig, wenn dem so w&auml;re, sagt mir bescheid ;) - ich m&ouml;chte nur kein unn&ouml;tiges Risiko eingehen; diese st&auml;ndigen &quot;ich wurde unschuldig gebannt&quot;-Geschichten machen mir da ein bisschen Angst C:","replies":[{"poster":"Sree","date":"2016-02-28T09:45:36.938+0000","up_votes":2,"down_votes":1,"body":"Solange das verwendete Programm keine Funktion bietet, die dir unfaire Vorteile bringt, ist es kein problem es zu nutzen. Wenn das Programm, welches du benutzt hast also nur Custom Skins ermoeglicht, brauchst du keine Angst haben. Problematisch wird es nur, wenn solche Programme neben den Custom Skins noch zusaetzlich Dinge ermoeglichen, die nicht erlaubt sind (automatisches in den Chat schreiben von Timern zum Beispiel).\n\nWenn du aber absolut sicher gehen willst, dass jede Reste von Zusatzprogrammen entfernt werden, dann solltest du neben der Deinstallation entsprechender Programme auch LoL deinstallieren. Nach der Deinstallation von LoL schaust du noch, ob eventuell Reste im Installationsverzeichnis verblieben sind und loescht diese ebenfalls.\nDannach installierst du LoL dann wieder neu.\n\nWenn du dann kein Programm mehr installiert hast, welches mit den Dateien von LoL interagiert, ist deine Installation auch sauber.\n\nPS: Die letzte Bannwelle richtete sich gegen Scriptnutzer (automatisieren von bestimmten Dingen wie Dodgen von Skillshots, perfekt smiten/lasthitten, usw.). Da wurde niemand Unschuldiges aus Versehen gebannt. Diejenigen, die gebannt wurden und hier sagen, sie sind unschuldig, luegen entweder oder haben ihren Account mit anderen Spielern geteilt, wobei dann eben die mit denen sie den Account geteilt haben, Scripts benutzt haben. Oder sie haben auf dem Rechner von Freunden gespielt und auf jenen Rechner waren Scripte fuer LoL. Egal wie man es dreht, die Ursache fuer die letzte Bannwelle waren von Riot erkannte Scripte. Irrtum ausgeschlossen.\n\nRiot Posts zu dem Thema:\n\n - http://boards.na.leagueoflegends.com/en/f/ZGEFLEUQ/d/69qVefAr?comment=0005\n - http://boards.na.leagueoflegends.com/en/f/ZGEFLEUQ/d/69qVefAr?comment=000500030003","replies":[{"poster":"CestLeMoi","date":"2016-02-28T11:30:56.705+0000","up_votes":1,"down_votes":1,"body":"Ok, super, danke :)\nDann brauch' ich mir keine Sorgen zu machen!","replies":[]}]},{"poster":"AndABottleOfRum","date":"2016-02-28T09:31:24.052+0000","up_votes":1,"down_votes":1,"body":"Ich hab mal paar Schritte aufgelistet die man machen sollte :) :http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/EOIBrwWn-momentane-permaban-phase\nWenn du das Programm deinstalliert hast dann sollte es eigentlich nicht mehr drauf sein. Kannst aber unter Programme schauen ob der Ordner vorhanden ist und den Löschen.","replies":[{"poster":"Rainbow Dashie","date":"2016-02-28T12:50:04.206+0000","up_votes":1,"down_votes":0,"body":"einige Programme werkeln auch an den Configs von LoL rum. Die änderungen gehen durch ein einfachen deinstall durch das Programm nicht weg.","replies":[]}]}]}