{"poster":"Romanticista","date":"2015-08-31T21:40:09.828+0000","title":"No existe la deportividad en ELO bajo (Bronce III)","subforum":"Problemas Técnicos","up_votes":1,"down_votes":2,"body":"Creo este post en el cual voy a ir mencionando a todos esos afk o troll que voy encontrando en mis ranked, con la esperanza de que en algun momento se realice alguna acci&oacute;n represiva a este tipo de conducta.\r\n\r\nEstar en Elo&acute;s bajos no significar no ver League Of Legends como una actividad deportiva-competitiva. Tambien queremos aprender y subir de ligas, nos esforzamos para ello y no importa lo que digan esas guias o demas cosas que se encuentran en internet, de que en Elo bajo tenes que carrear (es decir, ser 1 contra 9) si es, League Of Legueds, un juego deportivo serio, esas tonterias y la desatencion de las autoridades pertinentes de Riot, es prueba suficiente de la poca seriedad en su rol moderador.","replies":[{"poster":"Dr ChoPPer","date":"2015-08-31T23:33:57.780+0000","up_votes":1,"down_votes":0,"body":"Mira no es culpa tanto de riot, sino de los que lo jugamos: como los toman el juego.. siento el mismo problema respecto a la parte de deportivismo. porfavor comenta aca tu opinion o vota, y me gustaria llegar a bastante gente, para que lo vea un rioter.. \n\n(http://boards.las.leagueoflegends.com/es/c/reclutamiento/ufpTgmIe-concientisacion-para-rankeds-porfavor-lee-votar-y-comentar-si-quierenopinion-de-un-rioter-plis)\n\nSuerte.{{champion:201}}","replies":[]},{"poster":"lockynjack","date":"2015-08-31T22:13:28.443+0000","up_votes":1,"down_votes":1,"body":"Eso me parece bien pero lo que pasa con esto es que riot te lo va a eliminar y si no lo hace mejor sabes porque, Porque segun las \"reglas del foro\" no se puede identificar a gente en el mismo porque crea conflictos entre ellos y un mal ambiente, yo tambien ya hice varios post de esto y siempre me los han borrado y en cada uno de ellos 6 nombres facil, como trolls, afks ,feeders, etc. Yo si encuentro alguno lo ire publicando también pero talvez lo borren y aparte esto no asegura nada porque la mayoria de lo jugadores no lo leeran, yo soy bronce 5 y no es porque jugare mal ( tengo mis dias en los que no hago 1 bien ) pero yo ya ascendi 4 veces a bronce IV (empeze en bronce III y descendí como boludo por apurado) lo que pasa es que me emparejan con esta gente osea riot piensa que emparejando nose 2 personas que tienen malas partidas con 3 q son buenas por decirlo así la cosa va a mejorar pero lo que pasa que los que tienen malas partidas la mayoria son trolls y este tipo de gente. bueno me fui del tema pero te conté una historia jaja bueno lo que vendria a decir es que iré aportando tambien . bueno aca termino","replies":[{"poster":"Romanticista","date":"2015-08-31T22:58:22.062+0000","up_votes":1,"down_votes":0,"body":"Seguire publicando, y aunque lo borren lo seguire haciendolo, si ellos no lo hacen hare que algunos vean que gente es la que te deja en desigualdades deportivas. Uno puede perder, o ganar, en eso depende la habilidad de cada uno y de como se coordina con el equipo aleatorio que le toca. Y otra cosa muy distinta, es la falta de respeto a los demas, la inactividad, y las malas actitudes para con el equipo en su meta de conseguir la victoria.","replies":[]}]},{"poster":"martincarp","date":"2015-08-31T22:10:20.383+0000","up_votes":1,"down_votes":0,"body":"Está prohibido publicar nombres de invocadores en el foro con el fin de acusarlos o atacarlos, si no quieres que te borren el post te invito a tachar los nicks de la imagen y olvidarte de esto porque te lo van a terminar cerrando.","replies":[{"poster":"Romanticista","date":"2015-08-31T22:54:26.484+0000","up_votes":1,"down_votes":1,"body":"ya ni me interesa si me bannea o cualquier otra cosa, de hecho si lo hacen me están dando la razón de que apañan el comportamiento antideportivo de las ligas bajas, y que no se hacen responsable de moderar las actitudes antideportivas de los participantes. Eso es lo molesto, no que haya afk´s o troll, sino que no se tomen medidas represivas o limitadoras de actitudes contrarias a la deportividad de League Of Legends. {{summoner:21}}","replies":[]}]}]}