{"poster":"FurchiDC","date":"2016-03-02T23:02:02.748+0000","title":"Skins raras disponibles en el server japonés.","subforum":"Charlas Generales","embed":{"description":"リーグ・オブ・レジェンドの日本でのサービス開始を記念して、ジリアンがスキルを発動！　周囲の時間が巻き戻り、今では手に入らなくなったレガシースキンが期間限定、日本サーバーのみで購入可能になります！ これまで海外サーバーでの決済手段をお持ちでなかった皆さま、全てのレガシースキンを手にするまたとないチャンスです！ ...","url":"http://jp.leagueoflegends.com/ja/news/riot-games/announcements/qi-jian-xian-ding-regasisukinfu-huo","image":"http://jp.leagueoflegends.com/sites/default/files/styles/wide_medium/public/upload/legacy_skin.jpg?itok=a4V4VGXD"},"up_votes":4,"down_votes":3,"body":"Estar&aacute;n disponibles para la venta skins raras y de legado en el servidor japon&eacute;s durante el mes de marzo y abril. Con raras me refiero a mi Akalita All-Star, la Kata Tarjeta-Roja, Blitzcrank Paralotodo (el arquero), Riot Blitzcrank Kayle y Nasus, Graves Antidisturbios, skins de campeonato, de equipos ganadores de mundiales, etc.\n\nQu&eacute; ganas de pasarme para comprar algunas skins y volver... &iquest;es esto posible? &iquest;Alguien sabe c&oacute;mo hacerlo? Escuch&eacute; que solo pod&eacute;s entrar en el server japon&eacute;s con una IP japonesa :(.\n\n\n______________________________________\n\n>‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗ {{champion:134}}{{item:3211}}{{champion:84}} ‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗‗\n>░░░░░░░░░░░░░░░░░░░░░░░ Saludos ░░░░░░░░░░░░░░░░░░░░░░░","replies":[{"poster":"Soviet Yunyun","date":"2016-03-03T05:57:11.312+0000","up_votes":2,"down_votes":0,"body":"furchi siempre leo que quieres a la akali all-star, ami me salio en cajita hace tiempo y nunca la uso, ya que no juego mucho akali {{sticker:zombie-nunu-tears}}","replies":[{"poster":"FurchiDC","date":"2016-03-03T06:29:20.170+0000","up_votes":2,"down_votes":0,"body":"Oh dios no tenés una idea lo que te envidio :( como 15 cajitas me han regalado o he ganado en concursos y nunca me tocó T_T.","replies":[]}]},{"poster":"Runth","date":"2016-03-02T23:15:15.021+0000","up_votes":2,"down_votes":0,"body":"hasta incluye las limitadas, op server","replies":[]},{"poster":"Yrox the Third","date":"2016-03-02T23:06:32.404+0000","up_votes":1,"down_votes":0,"body":"Es una promocion Japonesa,  en los servers de Garena tambien hacen eso cuando quieren. \n\nSi no me equivoco puedes pasarte gratis,  pero vas a necesitar pagar el RP necesario para volver.","replies":[{"poster":"FurchiDC","date":"2016-03-03T06:36:11.972+0000","up_votes":1,"down_votes":0,"body":"¿Qué son los servers de Garena xD?","replies":[{"poster":"Yrox the Third","date":"2016-03-03T10:30:16.914+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FurchiDC,realm=LAS,application-id=v7qsfXsE,discussion-id=IcaBAGRa,comment-id=00000000,timestamp=2016-03-03T06:36:11.972+0000)\n>\n> ¿Qué son los servers de Garena xD?\n\nGarena es una compañia asiatica que junto a riot hicieron unos servers, sin embargo, riot no cuida estos server, lo hace Garena. \n\nHay 5 servers de Garena por el momento.","replies":[]}]}]},{"poster":"Synöpsie","date":"2016-03-03T06:02:07.850+0000","up_votes":1,"down_votes":0,"body":"Si no venden a Twitch Medieval o el icono del Árbol Viejo me vale madre!","replies":[]},{"poster":"Ks Erwyn","date":"2016-03-02T23:18:44.724+0000","up_votes":1,"down_votes":1,"body":"Tengo entendido que alla si todo juego online debe pasar por la politica del IP e identificación","replies":[{"poster":"LaReinaPingüino","date":"2016-03-03T03:06:28.374+0000","up_votes":1,"down_votes":0,"body":"A mi no me dio problema, no te estarás confundiendo con China?\n\nO Korea? allá si no eres Koreano no te puedes hacer una cuenta porque te piden tu numero de identificacion nacional, eso debidoo a que hay leyes muy estrictas anti addiccion a los videojuegos donde los videojuegos de allá o que lleguen alla deben poder detectar si el jugador es mayor de edad o no, si uno es menor de edad, los juegos te botan y se te bloquean después de las 12 de la m¿noche. Y cualquier juego que no cumpla eso es \"baneado\" de korea, como el ultimo FF que era mmorpg, ellos no quisieron incluir eso en su juego version koreana por lo tanto no se puede jugar eso allá y punto.\n\n> {{sticker:slayer-jinx-wink}}  Encuesta muy sensual acá: http://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/Vht9ZgZ5-jugar-lol-te-ha-convertido-en-un-cretino)","replies":[]}]},{"poster":"LaReinaPingüino","date":"2016-03-03T03:03:27.964+0000","up_votes":1,"down_votes":0,"body":"yo me meti a ese server de japon, me cree una cuenta nueva y me dio ningún problema, es lo mismo que hacerse una cuenta en las o na.\n\nKorea en otra parte te pide tu número de rut o como sea que se le diga en korea, esto es porque en korea hay leyes estrictas anti adiccion de videojuegos en que ningún juego te permite jugar después de las 12 pm si eres menor de edad, entonces necesitas corroborar tu edad, básicamente en corea si eres menor de edad los juegos se te cierran solos a cierta hora y o se bloquean y si los juegos que no cumplen esa norma y no exigen ese tipo de datos no son permitidos en korea y punto, como creo que es el caso de algunos Final Fantasy que simplemente no los puedes jugar allá porque square enix se rehusó a modificar sus juegos para incluir dicho sistema.\n\nSobre el server de japón: ellos te dan a tristana chica riot gratis si le das me gusta ak facebook de lol japon y a garen caballero del terror (mucho mejor que el garen comando que daban aca xD ) si sigues el twitter de lol japon, yo ya los desbloquié a ambos. Pero me da 280 de ping (mas que el server de usa que me da como 180 y menos que el server europeo occidental pero por unos 10 de ms  no mas), al menos vs bots es jugable, pero en pvp no se si será jugable, no lo he probado.\n\n> {{sticker:slayer-jinx-wink}}  Encuesta muy sensual acá: http://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/Vht9ZgZ5-jugar-lol-te-ha-convertido-en-un-cretino)","replies":[]},{"poster":"Stag","date":"2016-03-02T23:31:21.380+0000","up_votes":1,"down_votes":0,"body":"Mañana me paso  :D","replies":[]},{"poster":"ßrąkthør","date":"2016-03-02T23:20:42.446+0000","up_votes":1,"down_votes":0,"body":"Cambiarte de servidor cuesta unos 2600 RP (Suma otros 2600 mas si pensas volver) \nEn total serian unos 5200 RP SOLO EN EL TRASPASO, tambien tenes que sumarle el precio de las skins y todo.\n\nMe parece que no merece la pena gastar tanto por un par de skins, se que son raras y todo lo que quieras, pero me parece mucho dinero","replies":[{"poster":"FurchiDC","date":"2016-03-02T23:30:31.910+0000","up_votes":1,"down_votes":0,"body":"No te preocupes, no tengo el dinero para semejante cosa xD.","replies":[]}]},{"poster":"Shirotani","date":"2016-03-02T23:08:24.640+0000","up_votes":1,"down_votes":0,"body":"Esas skins las van a habilitar en algun momento en LAS otra vez, no vale la pena gastar 2600 RP + 975 RP por una skin.","replies":[{"poster":"FurchiDC","date":"2016-03-02T23:15:23.037+0000","up_votes":1,"down_votes":0,"body":"Espero no tener que esperar hasta el 2018 para eso xD.","replies":[{"poster":"Runth","date":"2016-03-02T23:17:55.622+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FurchiDC,realm=LAS,application-id=v7qsfXsE,discussion-id=IcaBAGRa,comment-id=00020000,timestamp=2016-03-02T23:15:23.037+0000)\n>\n> Espero no tener que esperar hasta el 2018 para eso xD.\n\no meter billeteras los rp y hacer el metodo carro\n\ntranferir, comprar y volverte aqui","replies":[{"poster":"FurchiDC","date":"2016-03-02T23:29:56.780+0000","up_votes":1,"down_votes":0,"body":"Jaja olvidate no tengo ahora mismo 1000$AR para hacer eso xD.","replies":[]}]}]}]},{"poster":"xFenix7","date":"2016-03-02T23:06:41.707+0000","up_votes":1,"down_votes":0,"body":"Paga la migración de cuenta,comprate las skins y volve a pagar la migración de cuenta.","replies":[]}]}