{"poster":"thepowerful mage","date":"2016-08-14T20:59:21.242+0000","title":"My ward skins are almost all gone","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"Recently, after I bought the recon drone ward, almost all of my ward skins have disappeared and its very strange. I had the season three championship skin, and some others that I don't remember what they were specifically. can someone please help me. I found this when I wanted to change to my drone ward skin to my season 3 championship. I would really appreciate the help.","replies":[{"poster":"Targons Blade","date":"2016-08-14T23:44:43.356+0000","up_votes":2,"down_votes":0,"body":"We're aware of an issue that prevents some ward skins from displaying in either champ select or in the Summoner Profile. This is purely a visual issue, and the wards still exist on your account. \n\nI don't have a timeline on when a fix for this will roll out, but please let me know if you have any other questions.","replies":[]},{"poster":"Denys0oo","date":"2016-08-15T07:09:12.064+0000","up_votes":1,"down_votes":0,"body":"It happened to me i was opening some Augmented Chaches and i got a Ward Skin Shard i use some essence to make them permanent and they arent showing in champ selects","replies":[]},{"poster":"Cuddle Collector","date":"2016-08-15T00:50:57.137+0000","up_votes":1,"down_votes":0,"body":"I have the same issue although I never bought the recon ward skin. It just happened to me after patching to 6.16.","replies":[]},{"poster":"Razorbeaks","date":"2016-08-14T21:23:58.699+0000","up_votes":1,"down_votes":0,"body":"Same, somewhere between the time I purchased and selected the Recon Drone Ward skin and Kled was unlocked for play a lot of older ward skins disappeared from the UI; **As of 8/14/2016 something is wrong with some ward skins' ownership in the client.**\n\nBest guess is that some of the older ward skins like the Halloween and Championship ones that aren't purchasable in the store are currently flagged in such a way that they can't be selected for use either, regardless of ownership.\n\n_I'm sure it'll be fixed, but chime in here if you're affected and maybe it'll get attention sooner rather than later!_","replies":[]}]}