{"poster":"VoiD WashuuuP","date":"2016-02-08T15:17:46.035+0000","title":"VoiD-Gaming sucht dich! und dich! und dich auch!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo Beschw&ouml;rer ,\r\ndu bist auf der Suche nach einem aktiven und gut organisiertem Clan?\r\nPerfekt!\r\nDann lies einfach weiter:\r\nWas wir von euch erwarten:\r\n&gt; Das Mindestalter betr&auml;gt bei uns 16 Jahre.\r\n&gt; Ein angemessener Umgangston sowie Team- und Kritikf&auml;higkeit.\r\n&gt; Ein aktives Auftreten auf dem Teamspeak.\r\n&gt; Elo ist vollkommen egal da wir auch gern f&uuml;r jede Elo Teams kompensieren m&ouml;chten.\r\nDesweiteren besitzt du ein funktionierendes Headset (inklusive Mikrofon),\r\nwei&szlig;t dich anst&auml;ndig zu benehmen, kannst dich klar ausdr&uuml;cken und nimmst konstruktive Kritik nicht als Flamen auf, dann bist du bei uns genau richtig.\r\nAlles andere wird sich ergeben und zeigen wenn du bei uns bist.\r\nDa wir einiges erwarten haben wir aber auch einiges zu bieten:\r\n1.Eine sehr spa&szlig;ige Zeit mit vielen tollen Mitgliedern.\r\n2.Einen eigenen TS3-Server\r\n3.Eine gro&szlig;e, lustige und aktive Community, in der du herzlich Willkommen bist.\r\n4.Die M&ouml;glichkeit einem Team beizutreten oder ein eigenes Team zu &ouml;ffnen und zu leiten.\r\n5.Mit deinem Team an interen und externen Turnieren teilzunehmen, evtl. sogar in der ESL oder GCL anzutreten.\r\n6.Ein rund um die Uhr aktives Adminteam, das dir mit Rat und Tat zur Seite steht. Kappa\r\n7.Zurzeit 2 aktive Ranked 5 vs 5 Teams\r\nFolgende Punkte haben wir uns als Ziele gesetzt:\r\n- Erfolgreiche &amp; w&uuml;rdige Repr&auml;sentation des Clans an Turnieren, wie z.B. Go4LoL, durch unsere Teams\r\n- Qualit&auml;tsverbesserung durch Aufnahme neuer Member und Trainingsm&ouml;glichkeiten f&uuml;r einzelne Spieler\r\n- Trotz des Augenmerks auf den Erfolg wollen wir den Spa&szlig; am Spiel und den anst&auml;ndigen, sowie freundlichen Umgang miteinander bewahren\r\nWir haben ein tolles Klima.\r\nWir k&uuml;mmern uns sofort um jedes Problem und sei es noch so klein.\r\nBei uns steht &bdquo;Spa&szlig; beim Spielen&ldquo; im Vordergrund\r\nDen Void Clan gibt es jetzt seit ca 6 Monaten.\r\nIch hoffe euch gef&auml;llt unsere &bdquo;Clanswerbung&ldquo; und gebt uns und dem Clan eine Chance.\r\nNun hast du ein paar Eindr&uuml;cke erhalten, aber da gibt es noch so vieles zu erz&auml;hlen, insbesondere zu der Aufnahme, Probezeit, Beitr&auml;ge und vieles mehr, was den Rekruten betrifft.\r\nAddet einfach unseren Leader VoiD CarryJos oder VoiD Washuuup Ingame dann bereden wir alles :D.\r\nGerne k&ouml;nnt ihr auch den TS&sup3; besuchen: voidbornsummoners.teamspeak.de\r\nAndere Kontaktm&ouml;glichkeiten wollen wir euch auch gerne zur Verf&uuml;gung stellen, so k&ouml;nnt Ihr unsere Website besuchen: www.void-gaming.com oder dem Leader eine E-mail zukommen lassen unter: carryjos@voidcommunity.de\r\nAlso, worauf wartest du noch?\r\nWir freuen uns auf dich !!!\r\nDein VoiD Team.\r\nPeace out &quot;&gt;","replies":[]}