{"poster":"Aletheïa","date":"2016-10-16T10:59:15.946+0000","title":"Nuovi ping: poter segnalare anche i propri ms al team","subforum":"Discussioni generali","up_votes":29,"down_votes":4,"body":"Con i nuovi ping ora si possono segnalare il cd per le spells, se si &egrave; vivi o morti, se i campi della giungla sono ancora l&igrave;, ecc...\r\nPerch&egrave; non poter cliccare sul proprio numero di ms e farlo sapere alla squadra? Molto spesso un evocatore lagga sul serio e viene preso in giro o reportato dai players, non potendo avvisare di avere una connessione instabile se non su fiducia: quindi perch&egrave; non poterlo rendere pubblico e inequivocabile?","replies":[{"poster":"Kim114","date":"2016-10-16T13:02:55.047+0000","up_votes":5,"down_votes":0,"body":"quando poi dici \"laaaaaaag\" e clicchi per far vedere gli ms, in quel momento si abbassano a 31 e poi salgono a 9k{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"DuckQuack0","date":"2016-10-16T12:14:07.226+0000","up_votes":3,"down_votes":3,"body":"No respect in ranked\nMettitelo in testa.\n\nGente che ha un computer di legno e una connessione di merda non dovrebbero fare ranked a prescindere\nMa sono, purtroppo, liberi di fare quello che vogliono, e difenderli non serve a niente\n\nAnche a me capita ci sia qualche sbalzo di ping una volta ogni 500 partite, quindi o vi fate una cazzo di connessione migliore (considerando che con la mia famiglia siamo in 4 collegati ed ho max 60ms) o vi prendete le vostre responsabilità.\nNon ti sto neanche a dire quante ne ho perse per colpa loro\n\nQua si difendevano pure gli AFK perché c'era un \"troll\" nel team\n\nEccheccazzo.","replies":[{"poster":"UltraLion","date":"2016-10-16T17:28:47.464+0000","up_votes":3,"down_votes":0,"body":"Certo, peccato che in Italia le connessioni facciano schifo, se non abiti a Roma e Milano dove continuano a fare cose sempre più veloci, dalle connessioni ai treni, ma vivi un pò fuori, ti ritrovi con 2 mega di connessione ed un regionale che fa 300 km in 6 ore.\nFacile dire \"allora non giochi\" ???","replies":[{"poster":"DuckQuack0","date":"2016-10-16T20:00:15.961+0000","up_votes":1,"down_votes":0,"body":"Posso capire uno che lagga una volta ogni tanto, ma se uno lagga sempre, perché gli altri devono perdere? Mica è colpa loro che uno sta in culo al mondo?\n\nIn ogni caso, come ho già detto, se sono normal chissene, per quanto riguarda me nelle normal sopporto tutto, non mi fa differenza neanche avere 4 afk\nMa se parli di ranked, quello con 9000 di ms è l'ultimo che dovrebbe essere difeso\nE non venirmi a dire che a te quelli che laggano e fanno perdere non ti danno fastidio, che io nel mio elo già sopporto i boostati.\nPerò ripeto, normal ok tutto quello che vuoi, ma ranked assolutamente no","replies":[{"poster":"UltraLion","date":"2016-10-16T20:11:33.976+0000","up_votes":2,"down_votes":0,"body":"Si mi fanno incazzare, ma sono io il primo ad avere 2 mega e quindi giocare con un ping a 100 / 150, a volte sta anche a 60, spesso riesco a giocare in maniera discreta senza o quasi senza laggare, purtroppo a volte svariona e và anche a 200 o picchi a caso da 500, il fatto è che è imprevedibile, non so da cosa dipenda, magari faccio un pò di partite e sta andando bene e poi capita quella che rompe di più le scatole, non si può prevedere, magari dipende anche da se la gente si collega nella tua zona, o se fuori c'è il temporale e la linea ne risente o se si collegano qua altri col wi fi, o caz ne so. Fidati che il primo ad incazzarsi è quello che lagga che vorrebbe giocare bene ma non riesce.\nSe  uno laggasse 24 ore su 24 è ovvio che farebbe meglio a non giocare.","replies":[]},{"poster":"capoccione98","date":"2016-10-17T18:07:17.227+0000","up_votes":1,"down_votes":0,"body":"chi non da un occhio alla connessione prima di giocare ranked è un animale, però a nessuno capita di avere 9000 di ping costante, spesso capita che connessioni piuttosto buone facciano qualche scherzo, ma fare lo speedtest con un buon risultato non significa che non ci saranno picchi di lag, perché quello dura appena qualche secondo, mentre i picchi non sono una cosa costante.\n\nchiaro, chi ha eolo (come me) è da arrestare se si mette a giocare quando diluvia o c'è molto vento (dai 25/35 di ping soliti si passa ad averne parecchie migliaia, provato in custom), però a qualunque connessione può capitare di avere un problema, magari anche leggero (se si raggiungono i 150/200 di ping non si fanno disastri, però bisogna avvertire il proprio support di non ingaggiare).","replies":[]}]}]}]},{"poster":"Mytlix","date":"2016-10-16T11:51:01.699+0000","up_votes":2,"down_votes":11,"body":"No, sarebbe un ping completamente inutile e superfluo.Semplicemente perchè una volta che i tuoi compagni di squadra lo sanno ...che cosa cambierebbe?Sanno che giocherai da schifo per colpa del ping? È colpa tua non avresti dovuto startare la partita...\"Eh si ma io che ne so che laggo???\" Apri una custom e vedi quanto è il ping li. Se laggi da far schifo è colpa tua non del lag,la partita l'hai startata te o il lag? Ti potresti star zitto e giocare safe sotto torre finchè non ti arriva la wave sotto torre ad esempio.","replies":[{"poster":"Nak v1","date":"2016-10-16T12:00:38.173+0000","up_votes":4,"down_votes":0,"body":"No, non lo sarebbe. Visto che giochi a league of legends dovresti sapere che basta un minimo per essere flammato fino al tilt. Io ho una fibra 100mb, ma capita a volte (casi rari) che il ping sballi ed a causa di questo, un tf, un drago, un baron, un obbiettivo importante venga perso. Quindi, se hai la possibilità di pingare il tuo ms, così da far vedere al tuo team che effettivamente non è stata colpa tua, così da evitare inutili polemiche ed eventuali insulti, perché non farlo? E comunque, in custom il ping è diverso, per cui non hai modo di constatare se lagghi davvero (esperienza personale).","replies":[]},{"poster":"Aletheïa","date":"2016-10-16T11:58:15.406+0000","up_votes":3,"down_votes":0,"body":"\"È colpa tua non avresti dovuto startare la partita...&quot;Eh si ma io che ne so che laggo???&quot; Apri una custom e vedi quanto è il ping li. Se laggi da far schifo è colpa tua non del lag,la partita l&#x27;hai startata te o il lag? Ti potresti star zitto e giocare safe sotto torre finchè non ti arriva la wave sotto torre ad esempio.\"\n \nConosco gente che gioca e quando qualcuno usa internet in casa il ping si alza a dismisura, come potrebbe saperlo prima di startare? Visto che c'è gente pronta a credere che non sia vero il fatto che laggi inizia a flammare e a reportare a caso. Superfluo? Trovo invece che sia utile sapere che un compagno avrà meno possibilità di aiutare gli altri con 200 ms (magari non per colpa sua, non credi?). Voglio vedere quando una persona ha picchi di 8000 di ping quanto possa \"giocare safe\"","replies":[]},{"poster":"Harkrade","date":"2016-10-16T16:03:28.324+0000","up_votes":3,"down_votes":0,"body":"Quindi se faccio 5 partite non laggando e la 6 laggo per qualche motivo è colpa mia che prima di ogni partita non provo una custom? Ma andiamo...","replies":[]}]},{"poster":"Dantazzo","date":"2016-10-18T10:12:24.865+0000","up_votes":2,"down_votes":0,"body":"Uno dei pochi ping utili da aggiungere sarebbe il \"Warded\". Questo mi sembra abbastanza inutile, cioè, ok hai fatto la cagata perchè lagghi, ma se lagghi perchè giochi? O più in generale a me se uno mi fa perdere un game che laggasse o meno frega poco, sempre colpa sua è.","replies":[]},{"poster":"Aletheïa","date":"2016-10-16T12:49:22.001+0000","up_votes":2,"down_votes":0,"body":"Fammela tu la connessione dove l'adsl non arriva :(\nIn ogni caso, non c'entrano neanche le ranked, io parlo di normal. Potete dire quello che volete delle classificate, ma tutti sono liberi di giocare e in normal credo sarebbe carino che gli altri sapessero che tu laggi più del normale o a volte salta la connessione o simili. Responsabilità? Dalla a quelli che i servizi li fanno solo nelle città, e nei 20 chilometri di periferia qui non c'è una connessione accettabile.","replies":[{"poster":"DuckQuack0","date":"2016-10-16T13:41:53.253+0000","up_votes":1,"down_votes":1,"body":"Se parli di normal allora che importa? \nI report per lagg non esistono, e quindi tu non verresti mai bannato, a meno che non vai sempre afk, allora te lo meriti il ban\n\nBasta non flammare a vincenda e puoi stare tranquillo\n\nCapisco il \"così gli altri mi credono, e tutti felici e contenti\", ma quante possibilità hai che il tuo team reagisca così? che sia normal o ranked, si comportano sempre male, e capiterebbe poche volte che ti dicano \"ok sorry np\"","replies":[]}]},{"poster":"1NG Faabier","date":"2016-10-16T12:04:06.417+0000","up_votes":2,"down_votes":0,"body":"Sarebbe una buona,anzi,un ottima idea a questo punto propongo di aggiungere anche gli fps dal momento che a me scendono anche sotto i 5 :(","replies":[{"poster":"JLuke","date":"2016-10-16T12:07:15.234+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Faabier,realm=EUW,application-id=MJVj50Jw,discussion-id=kHKLU2NO,comment-id=0003,timestamp=2016-10-16T12:04:06.417+0000)\n>\n> Sarebbe una buona,anzi,un ottima idea a questo punto propongo di aggiungere anche gli fps dal momento che a me scendono anche sotto i 5 :(\n\nQuello è veramente raro. Dato che league of legends è un gioco molto leggero. Avrai un pc molto vecchio presumo.","replies":[{"poster":"1NG Faabier","date":"2016-10-16T19:23:31.933+0000","up_votes":1,"down_votes":0,"body":"Si,ha 9 anni,fra non molto lo cambierò","replies":[]}]}]},{"poster":"Drìny II","date":"2016-10-16T11:47:15.351+0000","up_votes":2,"down_votes":1,"body":"Hai il mio +1","replies":[]},{"poster":"H2Obse","date":"2016-10-16T11:30:35.646+0000","up_votes":2,"down_votes":1,"body":"Approvo, mi sembra che nn guasterebbe affatto!","replies":[]},{"poster":"Darkinknight","date":"2016-10-18T10:06:35.472+0000","up_votes":1,"down_votes":0,"body":"Poveri main riven/vayne 😕 come faranno a giustificarsi ora..","replies":[]},{"poster":"Due spade","date":"2016-10-18T07:14:58.984+0000","up_votes":1,"down_votes":0,"body":"Io invece lo vorrei anche per gli fps, così posso vantarmi dei miei 15 durante il gioco e dei miei random 2-10 durante i tf. °w°","replies":[]},{"poster":"Domanda","date":"2016-10-17T10:28:23.589+0000","up_votes":1,"down_votes":0,"body":"L'idea non è malvagia in sè, però se ci pensi... Se qualcuno dovesse pingare il proprio ms e dovesse essere alto... Gli altri giocatori potrebbero chiedere \"Perchè stai giocando se hai ms alto?\" favorendo il flame :S","replies":[{"poster":"Seamus83","date":"2016-10-17T14:54:53.055+0000","up_votes":1,"down_votes":0,"body":"a me è capitato che faccio 5 partite a 50  ms ed una magari sto a 500 fissi ... sono cose che capitano e che a volte possono anche non essere prevedibili .\nSinceramente parlando di me sono abbastanza comprensibile , certo se mi accadesse a challenger rosicherei e neanche poco, ma finche si tratta di low elo se sei forte te la carry 4 vs 5 e con il troll in squadra da main support ;)","replies":[]}]},{"poster":"Seamus83","date":"2016-10-17T14:50:29.346+0000","up_votes":1,"down_votes":0,"body":"sarebbe utile un indicatore green , orange ,red vicino gli allies per sapere la loro situazione media , anche un pallino a mo di \"Ulti indicator\" sarebbe gradito ","replies":[]},{"poster":"DrWolf1904","date":"2016-10-16T17:38:19.143+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]},{"poster":"Campanello","date":"2016-10-16T15:14:13.859+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]}]}