{"poster":"TCL LutyPiolaa","date":"2015-03-22T20:19:04.679+0000","title":"¿Que runas le rendirian a un Nocturne en la JG, bien destroyer?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Hola muchachos/as de la comunidad del League of legends, necesito de su sabiduría para saber que runas le vendrían bien a mi amiguito Nocturne en la JG!\r\n\r\nLa build que básicamente le hago es \"One shot\" consiste en Hydra, Youmu, Filo, Trinidad y obviamente el item de la jg.\r\n\r\nDesde ya muchas gracias!","replies":[{"poster":"Cruch","date":"2015-03-23T01:37:27.731+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo 3 quintas de velocidad de ataque 6 glifos de cd y 3 glifos de velocidad de ataque, sellos de armadura, 8 marcas de daño de ataque y 1 de probabilidad de critico\n\nLa velocidad de ataque sirve para limpiar rapido la jungla y gracias a su pasiva tener mas sustain, los glifos de cd son un 5% de reduccion de cd que no le vienen nada mal a nocturne, que le serivira a lvl 6 para tener la ulti en menos tiempo, los sellos de armadura son obviamente para aguantar mas en la jungla las marcas de daño para tener mas daño base y el de probabilidad de critico pueden servirte para meter un critico random y ganar un 1v1 temprano o incluso para hacer rapido un campamento...\n\nLa build destroyer no sirve, te recomiendo que hagas:\n\nrey arruinado, randium, velo de banshee como items necesarios\n\nel smite puede ser el rojo para sacar mucho mas daño, el azul para ralentizar y tener mejores ganks o el violeta puede servirte para irte afk farm junto con espada de la avaricia y cosechar mucho farm\n\nlas botas pueden ser las de movilidad para ganks mas rapidos, las grebas de berseker porque dan mas velocidad de ataque, las tabi de ninja o las de mercurio, segun el team que tengan...\n\nel ultimo item puede ser un mazo de hielo, que da daño y muchisima vida, tambien puedes armar yomumu para hacer split push y para deletear mas rapido al adc contrario, hacer hidra tambien es viable ya que pegaras mucho y tendras mucha sustain, tambien puedes hacerte apariencia espiritual si tienen mucho ap o simplemente los ap del otro team esten feed, cota de espinas si tienen muchos ad o ad feed, corazon de hielo es muy buen item ya que da 20% de reduccion de cd lo que viene de 10 para la ulti, filo infinito es mas o menos viable, mucho daño criticos pero para mi gusto no es tan bueno.\n\nEspero que te sirva","replies":[{"poster":"TCL LutyPiolaa","date":"2015-03-23T20:55:25.814+0000","up_votes":1,"down_votes":0,"body":"¡Gracias! Crack.","replies":[]}]},{"poster":"HotSjokzGG","date":"2015-03-22T22:35:02.729+0000","up_votes":1,"down_votes":0,"body":"eso no rinde. Nocturne \"destroyer\" lo usan los Youtubers para brindarte un buen espectaculo. en el cual los emparejamientos le favorecen o simplemente se la tiene re clara.\nSi te metes a rankear con esa build probablemente te ira realmente mal. ya que es un personaje orientado a tanke en todos sus sentidos","replies":[]},{"poster":"DontChase","date":"2015-03-22T20:29:08.293+0000","up_votes":1,"down_votes":0,"body":"Mirate un video de Reve","replies":[{"poster":"TCL LutyPiolaa","date":"2015-03-22T22:33:21.634+0000","up_votes":1,"down_votes":0,"body":"ya me lo vi, pero no puso sus runas :C","replies":[]}]},{"poster":"Encarnox","date":"2015-03-22T20:31:08.226+0000","up_votes":1,"down_votes":0,"body":"Yo tengo a Nocturne pero todavía no le compro runas,creo que lo más recomendable sería ir con runas de ADC,marcas de daño de ataque,quintaesencias de velocidad de ataque,sellos de armadura y glifos de resistencia mágica.\nSaludos","replies":[{"poster":"Jonshi","date":"2015-03-22T20:39:43.440+0000","up_votes":1,"down_votes":0,"body":"o ponerle cdr y mrestist en blues, y buildearlo con {{item:3065}}  para ganar algo de mresist, ademas del life regen y tal. \nLuego, ir con las mismas runas de ADC, pero no se si con quints de attack speed. Si el jungle item lo bonificas a devorador (obviamente, fast farm con la purple y luego si queres asegurar kills anda por el blue, y ponele devorador), + youmuu ya tenes entre 0,90 y 1,2 de attack speed aproximadamente en lvl 13, o algo asi. Si queres un deleteo mas rapido ponele quints de attack speed + damage.","replies":[]}]}]}