{"poster":"firelele","date":"2019-07-01T00:21:52.900+0000","title":"Level 33 und Total starke gegner","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Ich bin Level 33 und kriege nur Gegner die mindesten Level 60 sind und meistens sind immer 2 dabei die höher als 150 sind und ich krieg nur auf die fresse ich spiel ganz normal kein Rank ganz normal warum ist das so ?","replies":[{"poster":"faMe girl 8ghter","date":"2019-07-01T01:21:50.551+0000","up_votes":1,"down_votes":1,"body":"Ab Level 30 wirst du hochgestuft.. so war es glaube ich mal...?\nDas heißt.. vor 30 nur bis 30 und ab 30 mit alles was es gibt.","replies":[{"poster":"Megamaexx","date":"2019-07-01T09:28:30.171+0000","up_votes":2,"down_votes":0,"body":"Nope, auch unter Level 30 kannst du höhere Mitspieler bekommen, wenn die MMR hoch genug ist","replies":[]}]},{"poster":"Megamaexx","date":"2019-07-01T09:31:44.846+0000","up_votes":2,"down_votes":1,"body":"Wird wahrscheinlich daran liegen, dass der Vorbesitzer ein höheres Skilllevel hatte als du.","replies":[{"poster":"firelele","date":"2019-07-01T12:06:51.329+0000","up_votes":1,"down_votes":0,"body":"was meinst du","replies":[{"poster":"Megamaexx","date":"2019-07-01T12:31:38.269+0000","up_votes":1,"down_votes":0,"body":"Seit wann spielst du LoL?","replies":[]}]}]},{"poster":"OT Riku","date":"2019-07-02T09:22:53.482+0000","up_votes":1,"down_votes":0,"body":"Man sollte sich halt keine Accounts kaufen.","replies":[]},{"poster":"SuicidePlank","date":"2019-07-01T00:23:09.927+0000","up_votes":1,"down_votes":1,"body":"Weil man durchs Normals spielen auch XP bekommt.\nSelbst jemand der nie Ranked spielt, wird irgendwann ein höheres Level haben als du.\nWenn du ausgeglichene Matches willst, dann geh ins Ranked.","replies":[{"poster":"firelele","date":"2019-07-01T00:54:32.822+0000","up_votes":1,"down_votes":0,"body":"Ja aber doch nicht 100 Level über mir bzw hab auch ranked gespielt war auch ein Level 291 drinne oder wieder der Rest fast über 100","replies":[{"poster":"SeaHorseCalamity","date":"2019-07-01T07:51:40.904+0000","up_votes":1,"down_votes":0,"body":"Wenn du mit solchen Leuten zusammen spielst, hast du wohl eine ähnliche MMR, wie diese. D.h. das Spiel stuft dich ähnlich gut ein, wie diese Spieler. Das kann dadurch passieren, dass du eine Winstreak hattest, oder diese Spieler mit einem lowlvl Kumpel spielen, oder Ranked only Spieler sind, die dann ab und zu ins normal hüpfen, dort aber eine sehr niedrige MMR haben, da sie den Modus ja fast nie spielen etc. \n\nDie MMR ist halt das entscheidende, nicht das Level.","replies":[]},{"poster":"SuicidePlank","date":"2019-07-01T00:57:24.066+0000","up_votes":1,"down_votes":0,"body":"Im Ranked ist es halt so das du zuerst mit schwachen Leuten zusammenspielst, so von Iron-Low Gold.\nDa gibt es sicher auch den ein, oder anderen der hardstuck ist und entsprechend viele Spiele in der Elo gespielt hat, oder ein only Normal Spieler der das erste mal Ranked spielt.\n\nLevel sagen kaum bist nichts aus, genauso wenig wie Meisterschaftspunkte, heißt nur das die viel spielen.","replies":[]}]}]},{"poster":"dugg","date":"2019-07-01T07:41:51.440+0000","up_votes":1,"down_votes":0,"body":"Entscheidend ist nicht dein LvL, welches nur eine Menge von Spielen repräsentiert, aber nicht den Skill eines Spielers. Du wirst anhand deiner MMR mit deinem Team gematched. Nicht aufgrund des LvLs.\n\nIch kann 5k Spiele gegen Bots machen und ordentlich EXP-Farmen, aber effektiv nichts vom Spiel lernen.\n\nWenn ein Gegner derart dominant war, dann schau dir das Replay und guck dir etwas von ihm ab.","replies":[]},{"poster":"Ïm À Çute Ýordle","date":"2019-07-01T06:55:25.467+0000","up_votes":1,"down_votes":0,"body":"Das Level hat nix zu sagen wie stark dein Gegner ist. Du kannst Level 30 sein und dein Gegner Level 500 und ist genau so schlecht wie damals und nur Bronze oder Iron als beispiel. Deshalb sagt das Level einfach nix aus.","replies":[]}]}