{"poster":"Savarin","date":"2015-01-19T07:34:17.360+0000","title":"Community Event- Champion Creation","subforum":"Player Creations","up_votes":2,"down_votes":0,"body":"Hey everyone.\r\nAs you guys know, Ocean Week is coming up and I thought \"What could Riot OCE\" do more for a community event and I thought of Champion Creation. The thing is since the release of Rek'sai, I felt and I am pretty sure others have felt that some Champions have gotten boring, like {{champion:429}} and {{champion:268}} brought some new creativity like a punch in the face from {{champion:254}} . And I just felt, although some may enjoy Rek'sai, we need a new interesting champion, someone with some creativity not just from Riot but from the Community as well. So I am proposing that there is a competition for a new champion contributed by the community. This is how it would work:\r\n\r\n1. People write up Champion ideas full with abilities, statistics, lore, etc\r\n2. They submit it into a forum/Riot thingie \r\n3. The people who design champions at Riot review the entries in terms of creativity and abilities and pick a top five/ten to be nominated\r\n4. They also tweak/nerf/increase the damage/healing/buffs of the abilities\r\n5. The community is given a week to vote for their favourite champion\r\n6. After the voting the winner is declared and the winning champion is then made into a real champion and the summoner gets an award (RP/Boosts/ first access to the Champion etc)\r\n\r\nI feel that this would be a great community event for everyone as it allows for everyone to try and make League a better game with their own ideas and creativity input. \r\n\r\nI hope you like my idea. Spread the word XD\r\n\r\nShining Neos","replies":[{"poster":"DarkShade918","date":"2015-01-20T00:03:44.342+0000","up_votes":1,"down_votes":0,"body":"I remember something similar to this, on NA for skins, that worked so well that riot did nothing.\n\nThis however may allow people to show off their creative skills, but likely riot will do nothing about it (soz riot, can't trust that you will)","replies":[]}]}