{"poster":"Comical","date":"2016-12-17T02:53:02.985+0000","title":"RIOT... REMOVE AUTOFILL.. LIKE SRSLY","subforum":"Gameplay","up_votes":7,"down_votes":5,"body":"Especially in lower Elo... People that get autofilled usually tilt and are REALLY NEW to the lane you guys choose for them.. In ranked shouldn&#039;t we be at our best? this autofill is putting us at our worst.. So please get rid of this autofill feature... Its ruining ranked.","replies":[{"poster":"Ixoziel","date":"2016-12-17T23:01:28.612+0000","up_votes":1,"down_votes":0,"body":"For the love of god, please explain to me why Riot is telling me, \"no you can't accept longer queue times, you HAVE to play this role.\" Why can't I DECIDE what I WANT? Why are they removing the ability for me to make my own choices? It makes absolutely zero sense.\n\nI thought the entire point of the new system was to let people play the roles they want. Fewer people want to play support? Great, they get instant queue times. \n\nInstead of forcing people to play things they don't want, why not find new ways to encourage support players? What if you increased chest droprates for \"in-demand\" roles? What about getting bonus IP for playing roles that are needed?","replies":[]},{"poster":"Octavia","date":"2016-12-17T03:01:45.202+0000","up_votes":1,"down_votes":1,"body":"watch out, riot will censor this post\n\nhttp://i.imgur.com/NN0zDIK.png\n\nhttp://i.imgur.com/SBJ2pdJ.png\n\nthey say 1 thread in 15 hours is \"spam\", clear censorship on discussion of autofill because there is spam about yasuo and other bullshit everywhere yet 2 autofill threads oh no that's too much\n\nthey tell me to go to the boards because \"riot support can't do anything\" and then I do and they delete my fucking thread","replies":[{"poster":"Mod Curator","date":"2016-12-17T03:05:46.038+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Octavia,realm=EUW,application-id=3ErqAdtq,discussion-id=i7LOBlPs,comment-id=0001,timestamp=2016-12-17T03:01:45.202+0000)\n>\n> watch out, riot will censor this post\n> \n> http://i.imgur.com/NN0zDIK.png\n> \n> http://i.imgur.com/SBJ2pdJ.png\n> \n> they say 1 thread in 15 hours is &quot;spam&quot;, clear censorship on discussion of autofill\n> \n> they tell me to go to the boards because &quot;riot support can&#x27;t do anything&quot; and then I do and they delete my fucking thread\n\nYou made the same post multiple times over the past two days naming them \"daily\" posts.  That is considered spam and it was removed.","replies":[{"poster":"Octavia","date":"2016-12-17T03:18:26.715+0000","up_votes":1,"down_votes":0,"body":"i am waiting for your spam to be deleted","replies":[]},{"poster":"Octavia","date":"2016-12-17T03:12:46.112+0000","up_votes":1,"down_votes":1,"body":"you made the same post multiple times over the past 5 mins therefore this needs to be removed due to spam","replies":[]}]}]},{"poster":"MagicFlyingLlama","date":"2016-12-17T03:07:02.111+0000","up_votes":1,"down_votes":0,"body":"This is just part of the riot campaign to force people to play support. Instead of admitting that people do not _want_ to play support and just accepting longer queue times and vastly better game quality.","replies":[]},{"poster":"PrimeWraith","date":"2016-12-17T02:54:16.099+0000","up_votes":1,"down_votes":0,"body":"im in silver4 and I bought blitz just for when I get autofilled I wont be tilted/troll.\nyou can upvote me for that.","replies":[]}]}