{"poster":"Chaandy","date":"2016-02-22T18:00:22.161+0000","title":"Aurelion Sol ... Rito o Realidad?","subforum":"Charlas Generales","up_votes":4,"down_votes":4,"body":"Bueno he estado viendo lo de Aurelion Sol , Ao Shin o como se le llame y varios comentarios decian que es probable que sea una broma del dia de los inosentes diciendo que se venia en Abril como el modo U.R.F ... ustedes que opinan?","replies":[{"poster":"JACKY FANBOY","date":"2016-02-22T18:06:55.896+0000","up_votes":1,"down_votes":0,"body":"Igual me lo pregunto ya que nunca habian anunciado un campeón así","replies":[{"poster":"Neo Gaussrik","date":"2016-02-22T18:17:04.879+0000","up_votes":5,"down_votes":0,"body":"Nunca antes habiamos tenido un campeon anunciado que se parece tanto a un campeon anunciado que fue cancelado. :p","replies":[{"poster":"JACKY FANBOY","date":"2016-02-22T18:34:19.361+0000","up_votes":1,"down_votes":0,"body":"Pero nunca habian anunciado un campeon que seria cancelado el cual volveria como un campeón evolucionado del campeon cancelado que habia sido anunciado :P\n\n","replies":[{"poster":"Neo Gaussrik","date":"2016-02-22T19:12:17.274+0000","up_votes":2,"down_votes":0,"body":"Si prefieres verlo asi, claro.\n\nEl punto es que no importa lo que hicieramos, cuando lanzaramos un campeon que fuera un dragon, seria acusado de ser Ao Shin, luego es importante que antes que hagamos anuncios, expliquemos el tema a la comunidad.\n\nLo ultimo que querriamos es que lanzaramos a Aurelion y los jugadores se sientan traicionados porque no lanzamos a Ao Shin.","replies":[{"poster":"JACKY FANBOY","date":"2016-02-22T19:19:48.882+0000","up_votes":1,"down_votes":0,"body":"Bueno creo que el post iba a a que podia ser un trolleo anticipado del April fool´s Day, y por eso te conteste así (espero se haya entendido la broma :V xD\n\nPor lo visto Aurelion Sol va en serio, y me alegra que hayan decidido comunicarlo.\nAunque lo que decepciona un poco es que los nuevos campeones tienen historias propias las cuales nos revelan  a diferencia de Jihn y Ekko (que nos cuentan un poco del pasado de ciertos campeones)","replies":[{"poster":"Neo Gaussrik","date":"2016-02-22T19:26:27.048+0000","up_votes":2,"down_votes":0,"body":"No entendi la parte de las historias; a que te refieres?","replies":[{"poster":"JACKY FANBOY","date":"2016-02-22T19:35:30.903+0000","up_votes":1,"down_votes":0,"body":"Por ejemplo gracias a ekko sabemos que Vi y Jinx eran hermanas simbolicas (al menos eso entendi) al estar en el mismo grupo \nEs que me enrede yo mismo :V ahora no se como explicarlo\nademas que estoy en el trabajo xDD","replies":[{"poster":"Neo Gaussrik","date":"2016-02-22T20:45:25.870+0000","up_votes":6,"down_votes":0,"body":"Hmm.\n\nAurelion llegara a transformar nuestro entendimiento de varios otros campeones.\n\nMejor no digo mas para no arriesgar mi trabajo. ;) Estoy ansioso por que salga!","replies":[{"poster":"AkNando","date":"2016-02-23T13:26:10.897+0000","up_votes":1,"down_votes":0,"body":"Hola Gaus, buen día.\n\n Tengo una duda, Ao Shin era un dragón del tipo serpeante. Aurelion Sol por alguna razón se me hace la idea de un dragón al estilo de las estatuas de dragones con forma de leon. No te parece? Hay avances de la estética del campeón o está en una etapa inicial de diseño?\n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Forbidden_City_Imperial_Guardian_Lions.jpg/300px-Forbidden_City_Imperial_Guardian_Lions.jpg\n\nPD: (Humor) Veremos una batalla celestial de Aurelion Sol contra Kayle al estilo de esta imagen?\n\nhttp://www.fondos7.net/wallpaper-original/wallpapers/lucha-del-dragon-1967.jpg\n\n\nSaludos. {{champion:19}}","replies":[{"poster":"Neo Gaussrik","date":"2016-02-23T13:32:33.248+0000","up_votes":1,"down_votes":0,"body":"No, Aurelion tambien es del tipo serpiente. No tiene alas, asi que se ve bastante distinto a tu imagen. :)\n\nSaludos!","replies":[{"poster":"Terriermon","date":"2016-02-23T15:16:30.522+0000","up_votes":1,"down_votes":0,"body":"Y asi fue como gaussrik acabo con el hype para mi u.u un dragon sin alas no es un dragon u.u","replies":[{"poster":"Neo Gaussrik","date":"2016-02-23T15:35:14.494+0000","up_votes":2,"down_votes":0,"body":"Shen Long te dice hola!\n\nhttp://imgur.com/mbkOBe4","replies":[{"poster":"Terriermon","date":"2016-02-23T19:55:36.492+0000","up_votes":1,"down_votes":0,"body":"Se que los dragones orientales no suelen tener alas (como el de shiryu por ejemplo también) , pero en lo personal me gustan mucho mas los dragones occidentales como los que salen en yugioh (ra,slifer,cyber dragon,el ojos azules,etc) los del l2 (valakas,lindvior), los dragones de fairy tail ,escaflowne, como entrenar a tu dragon, incluso el dragón de tristana y el de la grieta tienen sus alitas.\nSiento que este personaje no me llenara el rol de \"campeón dragón\" que siento que falta, al igual que no lo hace actualmente  shyvana, sin embargo es seguro que lo voy a comprar y que me guste aunque seguiré esperando mi querido dragón alado :D. \nEn fin cambiando de tema ojala algún día saquen un invocador de gatos (hace un tiempo admitían que les faltaba un summoner) que realmente extraño esa clase y no hay ningún gato en el juego (nidalee es un felino pero no me llena el rol de campeón gato).","replies":[{"poster":"xviciousx","date":"2016-02-24T13:22:48.940+0000","up_votes":1,"down_votes":0,"body":"{{champion:68}} ahí tienes tu gato","replies":[]},{"poster":"Terriermon","date":"2016-02-24T13:11:30.709+0000","up_votes":1,"down_votes":0,"body":"Rengar da mas miedo que ternura xD si se viera así http://41.media.tumblr.com/0bcb0c3e5329969b88fc6018bd6c20f0/tumblr_n5fgx9tr651s77284o1_400.jpg si lo vería mas como un gato aunque ese aspecto no encaja demasiado con la temática del personaje. \nNo se si jugaste el lineage 2 que estaba el warlock/arcana lord y tenias 5 gatitos para invocar (kai,kat,mew,queen y king) , también en el blade and soul esta esa clase que se llama summoner y te daban para elegir entre 5 gatos creo al comienzo. \nSobre lo del termino domestico no se si te referís a hacer un gato que vaya en 4 patas y se vea casi igual a uno real,  yo a lo que me refiero por campeón gato es mas a uno que se vea lindo por así decirlo aunque vaya caminando como humano (como los gatos de los juegos que te mencione antes) o que tenga alguna ropa/accesorio como en el caso de los del lineage (en el blade and soul al menos al principio no tenían nada de vestimenta, he visto imágenes que llevan accesorios pero hasta donde yo llegue aun estaban \"desnudos\") .\nEn resumen supongo que si tendría que identificarlo con un grupo de campeones dentro del lol (en lo visual)  entraría en el de teemo,lulu,mini gnar y los poros, básicamente el tipo de campeón que son adorables (se que adorable y teemo no va de la mano pero visualmente es tierno) y les sacan peluches xD. \nLuego que usen al gato como una mascota de summoner o un personaje en si me es indiferente, aunque con el primero llenarías el rol de summoner que falta junto al de \"gato vende peluches\" por así llamarlo.\nPD: Me puse a revisar el store de Riot y todos los que mencione tenían su peluche aunque teemo tiene de sus skins (la cottonail y panda)","replies":[]},{"poster":"Neo Gaussrik","date":"2016-02-23T22:34:33.894+0000","up_votes":1,"down_votes":0,"body":"De acuerdo; a mi tambien me gustan mas los dragones occidentales- como el dragon de la Grieta. :)\n\nSin embargo, este es otro tipo de dragon!\n\n(C/R a los gatos, Rengar no cuenta? Quieres un campeon que sea literalmente un gato domestico? )","replies":[]}]}]},{"poster":"IlllI","date":"2016-02-23T15:42:43.894+0000","up_votes":1,"down_votes":0,"body":"Va a ser una lombriz voladora","replies":[]}]},{"poster":"Chaandy","date":"2016-02-23T13:56:01.670+0000","up_votes":1,"down_votes":0,"body":"Aurelion Sol?\nhttps://www.google.com.ar/url?sa=i&rct=j&q=&esrc=s&source=images&cd=&cad=rja&uact=8&ved=0ahUKEwjD5qTrhI7LAhUCFZAKHThNBn0QjRwIBw&url=http%3A%2F%2Fes.dragonballfanon.wikia.com%2Fwiki%2FArchivo%3APejelagarto.jpg&psig=AFQjCNFMrGBvQdbbO-WvAMq1WfnaROOCmA&ust=1456322126559662","replies":[]}]}]},{"poster":"SnowyMagician","date":"2016-02-22T23:25:25.794+0000","up_votes":1,"down_votes":0,"body":"Habra algun video? cinematica o algun evento? Siempre es interesante cuando desarrollan las historias de los campeones asi,al menos a mi me gusta.","replies":[{"poster":"Ahristócrata","date":"2016-02-23T02:05:25.573+0000","up_votes":2,"down_votes":0,"body":"No te puede contestar eso, sería arruinar la sorpresa xD","replies":[]}]}]}]}]}]}]}]},{"poster":"Zabivaka","date":"2016-02-22T18:53:28.931+0000","up_votes":1,"down_votes":0,"body":"RIOT QUEREMOS A AO SHIN, NO CUESTA NADA PONERLE ESE NOMBRE","replies":[{"poster":"JACKY FANBOY","date":"2016-02-22T19:15:49.020+0000","up_votes":1,"down_votes":0,"body":"Es que no es Ao Shin, el esta CANCELADO","replies":[{"poster":"Zabivaka","date":"2016-02-22T20:27:11.329+0000","up_votes":3,"down_votes":0,"body":"PERO ES UNA ESTUPIDEZ\nSolo tenian que sacar un nuevo campeón y ponerle ao shin para cubrirlo y listo, no entiendo para que hacer tanto quilombo con la evolución del dragon que lo cancelamos que lo hacemos que lo volvemos a cancerlar, que le sacamos el nombre y se lo ponemos a otro.\nEra totalmente innecesario, bastaba con hacer el campeón aurelion sol y ponerle ao shin, y listo, que ganas de dar vueltas en circulos","replies":[]}]}]},{"poster":"efukt","date":"2016-02-22T19:02:06.481+0000","up_votes":1,"down_votes":0,"body":"cancelaron al aoi shin o solo esta en espera","replies":[{"poster":"Neo Gaussrik","date":"2016-02-22T19:10:54.876+0000","up_votes":1,"down_votes":0,"body":"Cancelado.","replies":[{"poster":"xviciousx","date":"2016-02-24T13:25:16.525+0000","up_votes":1,"down_votes":0,"body":"no que había evolucionado en Aurelion Sol? \nEn ese sentido no está cancelado, solo es otra versión más refinada del mismo concepto.","replies":[{"poster":"Neo Gaussrik","date":"2016-02-24T13:47:21.133+0000","up_votes":1,"down_votes":0,"body":"Tomamos lecciones que aprendimos tratando de crear a Ao Shin y las usamos para crear a Aurelion Sol, pero no significa que el concepto de Aurelion sea \"Es un dragon Chino\".\n\nSon bastante distintos.","replies":[{"poster":"xviciousx","date":"2016-02-24T22:40:14.583+0000","up_votes":1,"down_votes":0,"body":"los dragones serpientes son chinos -_-\n\nIntroduzcanlo luego y nos ahorramos discusiones :D ","replies":[]}]}]}]}]},{"poster":"Condor","date":"2016-02-22T21:09:01.853+0000","up_votes":1,"down_votes":0,"body":"gavid y zyra meibi? :P","replies":[]}]}]},{"poster":"Karrie","date":"2016-02-22T18:04:48.360+0000","up_votes":2,"down_votes":2,"body":"Un rioter (ni me acuerdo cual es) Respondio sobre eso c: diciendo que Ao Shin era algo obsoleto y que en resumen...\nAo shin tiene mucho detalle, nos da flojera hacer un campeón que implica mucho trabajo por que es complicado.\nAsi que usaremos a Aurelion Sol que es más facil y asi hacer que lo compren de todos modos. :3 Fin","replies":[{"poster":"Neo Gaussrik","date":"2016-02-22T19:12:48.680+0000","up_votes":5,"down_votes":2,"body":"Dime, en verdad crees esto? :P","replies":[{"poster":"Karrie","date":"2016-02-22T20:00:29.726+0000","up_votes":3,"down_votes":1,"body":"Cuando tengo que hacer bardo y llega un rioter .-.  \nPues, con dignidad, me desmayo.\n\n\n","replies":[]}]}]},{"poster":"Chaandy","date":"2016-02-23T06:47:54.005+0000","up_votes":2,"down_votes":0,"body":"Pero digo era mas facil para la comunidad sacar a Aurelion como sacan a cualquier champ y no dar mas noticias de Ao Shin pq es muerto {{item:3151}} {{item:3070}} {{item:3070}}","replies":[]},{"poster":"Yrox the Third","date":"2016-02-22T18:18:03.795+0000","up_votes":2,"down_votes":1,"body":"Aurelion Sol es el campeon nuevo. \nAo Shin no es nada,  cero,  absolutamente nada,  ya no existe. \nEl URF es la broma del Dia de los Inocentes.","replies":[]},{"poster":"Asturios","date":"2016-02-29T21:59:21.587+0000","up_votes":1,"down_votes":0,"body":"Cuando dijeron que estaba relacionado de alguna manera con el campeón cancelado ya me entró la duda. Ni hubieran hecho mención a eso ya que ahora hasta que no vea el campeón en la tienda para mi va a seguir siendo un engaño. Ni siquiera me creo un spotlight de Skyshock.","replies":[]},{"poster":"Lion","date":"2016-02-23T00:15:32.799+0000","up_votes":1,"down_votes":0,"body":"_Duda para algún rojo, será de Monte Targon este campeón?:_\n\n**Aureliano:\nAureliano fortaleció la posición del dios del Sol, Sol (Invictus), como la principal divinidad del panteón romano. Su intención era dar a todos los pueblos del Imperio, civiles o soldados, occidentales u orientales, un solo dios en quien ellos podrían creer sin traicionar a sus propios dioses. El centro del culto fue un nuevo templo, construido en 271 en Campus Agrippae en Roma, con grandes decoraciones que fueron financiadas con el botín obtenido del Imperio de Palmira. Aureliano no persiguió a otras religiones. Sin embargo, durante su breve reinado, parecía seguir el principio de «un dios, un Imperio», idea que más tarde adoptó completamente el emperador Constantino el Grande. En algunas monedas, aparece con el título deus et dominus natus («dios y señor nato»), título que más tarde sería adoptado también por D**iocleciano. Lactancio argumenta que Aureliano habría prohibido adorar a todos los demás dioses si hubiera tenido tiempo suficiente para hacerlo.\n\n{{champion:80}} {{champion:89}}","replies":[]},{"poster":"Nekoween","date":"2016-02-22T20:34:08.405+0000","up_votes":1,"down_votes":0,"body":"Yo voto por una skin nueva de karma :D","replies":[{"poster":"Nekoween","date":"2016-02-22T20:34:29.233+0000","up_votes":1,"down_votes":0,"body":"P/D: que sea blanca :D","replies":[]}]},{"poster":"pipum","date":"2016-02-22T19:14:30.803+0000","up_votes":1,"down_votes":0,"body":"Hubieran dicho que iban a lanzar un lagarto alargado que vuela y se ahorraban los problemas.","replies":[]},{"poster":"Duo Vegetil777","date":"2016-02-22T19:13:17.986+0000","up_votes":1,"down_votes":0,"body":"Aguante {{champion:157}} {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"ManaosDeÚva","date":"2016-02-22T18:57:12.649+0000","up_votes":1,"down_votes":0,"body":"No lo se ¿No te parece algo temprano para empezar con las bromas de abril? Aunque con Don Rito, todo es posible.","replies":[]},{"poster":"Sir Crucifix ","date":"2016-02-22T18:21:14.603+0000","up_votes":1,"down_votes":0,"body":"no creo , falta mucho para eso , pero \"ao shin\" saldra como campeon","replies":[]},{"poster":"rokushoger","date":"2016-02-22T18:12:56.652+0000","up_votes":1,"down_votes":0,"body":"Estamos en febrero, no creo que den desde ahora una noticia como broma de acá a abril.","replies":[]},{"poster":"Wena Mi Plebeyo","date":"2016-02-29T23:17:25.287+0000","up_votes":1,"down_votes":1,"body":"OPINO QUE TU ME COPIASTE LA PUBLICACIÓN >:c","replies":[]}]}