{"poster":"BaNxNed","date":"2015-08-26T22:25:39.908+0000","title":"Cleint Crashes.......","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"So zum 1. mal melde ich mich zu Wort weils einfach nicht sein kann das Riot sich immernoch nicht um diesen \"Bug\" gek&uuml;mmert hat, es ist nicht das erste mal das im Ladebild einfach das game \"abst&uuml;rtzt\"  und wenn man das game dann Schlie&szlig;t und auf \"reconnect\" dr&uuml;ckt was passiert dann? Genau garnix! Es h&auml;ngt sich wieder auf das hei&szlig;t komplett neu einloggen und neu reconnecten das kostet nicht nur Zeit sondern auch Nerven besonders wenn man in einer Promo ist man mit level 1 dann endlich drin ist der gegner schon level 6 ist weil 3mal hintereinander dieser \"Fehler\"  aufgetreten ist. Bevor ihr jetzt kommt mit : ja das liegt an dein Client. Ich hab den Client schon X mal neu installiert und viele Freunde haben das auch schon gehabt. Nun die Frage  ist Riot einfach nur zu faul oder haben die kein bock das zu \"fixen\"? Und ehrlich gesagt mich juckt es nicht wv downvotes ich bekomme ich wollte nur mal meine Erfahrungen zum derzeitigen Clienten preisgeben und wissen ob ihr das auch schon hattet.\nBin dann mal weg {{summoner:4}} mfg. BaNxNed","replies":[{"poster":"eriκ","date":"2015-09-02T01:13:14.861+0000","up_votes":1,"down_votes":0,"body":"Ich habe ab und zu das gleiche Problem. Nur wenn ich den Client neustarte Funktioniert es bei mir immer noch nicht ..","replies":[]},{"poster":"TurtleMari","date":"2015-08-27T12:19:53.027+0000","up_votes":1,"down_votes":0,"body":"Ich hatte das einmal, da hat sich mein Router wahrscheinlich neu gestartet wodurch die Verbindung wohl für weniger als eine Sekunde weg war. Letztendlich konnte ich nicht ins Spiel connecten und hatte das Spiel nicht in meiner Matchhistory.","replies":[]},{"poster":"Enderized","date":"2015-08-27T06:35:08.040+0000","up_votes":1,"down_votes":0,"body":"Meine Erfahrung sagt mir, dass dieser Bug meistens nach einem Verbindungsabbruch zu einem Netzwerk oder zB auch einem Routerreset auftritt.","replies":[{"poster":"BaNxNed","date":"2015-08-27T06:42:59.899+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lonichiwa,realm=EUW,application-id=ImBE6GqA,discussion-id=qouTRhaA,comment-id=0000,timestamp=2015-08-27T06:35:08.040+0000)\n>\n> Meine Erfahrung sagt mir, dass dieser Bug meistens nach einem Verbindungsabbruch zu einem Netzwerk oder zB auch einem Routerreset auftritt.\n\nGenau das ist eig. nie der fall gewesen bei mir hab den Router direkt neben mir stehen und immer ein Blick drauf :p","replies":[{"poster":"Enderized","date":"2015-08-27T08:45:37.021+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BaNxNed,realm=EUW,application-id=ImBE6GqA,discussion-id=qouTRhaA,comment-id=00000000,timestamp=2015-08-27T06:42:59.899+0000)\n>\n> Genau das ist eig. nie der fall gewesen bei mir hab den Router direkt neben mir stehen und immer ein Blick drauf :p\n\nWie gesagt, es reicht auch aus, einen kurzen Verbindungsabbruch zum Netzwerk an sich zu haben - dies kann auch durch alles Mögl. ausgelöst werden (zB NetzwerkClienten).\n\nEs sind halt nur meine Beobachtungen :)\n\nKann ja bei dir auch wirklichnn bug sein, ich habe ihn halt nur bei geschilderten situationen","replies":[{"poster":"BaNxNed","date":"2015-08-27T12:12:46.756+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lonichiwa,realm=EUW,application-id=ImBE6GqA,discussion-id=qouTRhaA,comment-id=000000000000,timestamp=2015-08-27T08:45:37.021+0000)\n>\n> Wie gesagt, es reicht auch aus, einen kurzen Verbindungsabbruch zum Netzwerk an sich zu haben - dies kann auch durch alles Mögl. ausgelöst werden (zB NetzwerkClienten).\n> \n> Es sind halt nur meine Beobachtungen :)\n> \n> Kann ja bei dir auch wirklichnn bug sein, ich habe ihn halt nur bei geschilderten situationen\n\nHeute hatte ich auch wieder den bekannten \"Bugsplat\" und dann heißt es ja das man auf reconnect drücken soll aber es passiert dann garnix ich finde das in Rankeds stark nervig es kommt zwar eig nicht oft vor aber wenn ist es ein großer Nachteil deswegen hoffe ich das Riot sich da mal dran setzt und was ändert ^^","replies":[]}]}]}]}]}