{"poster":"SenbonZakura 1","date":"2015-12-29T02:35:49.047+0000","title":"producto de calidad? menos eso cualquier cosa rito y sus ''mejoras''","subforum":"Charlas Generales","embed":{"description":"15 minutos de Cliff despotricando sobre el LOL. Hay que tener estómago para aguantarlo, pero si te atreves... ¡Adelante! PD: Antes de hablar basándote en el título, o de poner un negativo, sería interesante que escuchases el contenido o parte del mismo.","url":"https://www.youtube.com/watch?v=cvpe3T24pm4","image":"https://i.ytimg.com/vi/cvpe3T24pm4/hqdefault.jpg"},"up_votes":6,"down_votes":6,"body":"antes que nada piensen un poco muchas cosas que se dicen son reales y ciertas \n\nno voy a escribir mucho por que la verdad ya no vale la pena\nes obvio que nadie va a responder o den negativo por decir cosas o me den ban o me borren el post \n**\nriot lo peor jamas creado aunque su juego esta bueno, es muy mal manejado.**\nsegu&iacute;s sacando cosas skins ofertas y mucha porquer&iacute;a junta. \nno paras de hacer **actualizaciones de las cuales cada d&iacute;a est&aacute;n mas buggs **\nno respondes a lo pedido por la gente ni con un si o un no pareciese que programan mas bots para responder que para llevar las peticiones de la gente a los de &#039;&#039;alto mando&#039;&#039; o como quieran llamarlo\n**se preocupan mas por las ofertas que por solucionar las cosas del server** yo no se como se administran no me importa tampoco pero la realidad es que ustedes les importa un bledo la gente y asi como los gobiernos del mundo prometen y hablan cosas de las cuales en lo oscuro se r&iacute;en y burlan de seguro.\nsobre el tema de los trolls no voy agregar nada es obvio que ustedes lucran con esa gente y les conviene \nsepan que por motivos de no ser un malote o esas cosas de ni&ntilde;os de 6 a&ntilde;os que ponen estoy tratando de seleccionar mis palabras pero que quede claro que es obvio y mas que obvio que no les importa nada absolutamente nada.\n\nmientras la gente se pone contenta por ofertas nuevos champs nuevos nerfeos a pedidos de los mancos que no saben jugar y dicen uuuu uuu esta roto esta roto, **hablan de un juego balanceado cuando en realidad manosean tanto las cosas que se vuelve &#039;&#039;tonto&#039;&#039; aprender a manejar un champ bien.**\n\nejemplos de rotaje: {{champion:104}} {{champion:122}} {{champion:203}} \n\n y lo que supuestamente estaba roto: {{champion:16}}  asi como muchos otros champs que suelen hacer pelota\n**su idea de balanceo es tan buena como las condiciones de su server **\nbueno luego de esto que puedo decir? que desgraciadamente **asi como riot muchas empresas millonarias de juegos solo hacen crap crap crap y mas crap copiando y cambiando dos tres tonterias y cambiando su titulo....**\nya **no hacen juegos hacen cosas para vender** por son cosas sin historias sin nada como lo era antes, y la masa es tonta y lo consume\nno hay historias no hay nada.... \ndonde se ha visto que le cambien la historia por a o b motivo a un personaje\ndesde luego en eso si son pioneros \nyo deseo sinceramente **que la gente se una y despierte de toda esta basofia** que hace no solo riot si no muchas empresas y digamos no no consumamos no juguemos por que por mas plata que tengan no les sirve de nada un server vac&iacute;o.\nrecalco lo de vac&iacute;o\n por que por algo **no borran a los trolls jajaja cuanta gente se les fue ya ?**   pero bueno **cuando el caudal de gente que entre sea menor a la que salga solo tal vez riot haga algo por la gente que al fin y al cabo le da vida a su juego**\n\notra cosa no me sorprenderia que les pagaran a ciertas personas para joder las promos de la gente y dejar que solo ciertas caras lleguen lejos por que la verdad nada me sorprende ya \nme imagino que si no arreglan eso de la gente troll en promo es por algo\n\n**el lol es un gran juego** pero **la manzana creo yo esta muy podrida y la pintan de colores lindos con skins y cosas para que la gente siga comprando el producto.**\n\ncabe destacar que voy a copiar y a pegar esto por que **seguramente le busquen el pelo al huevo como siempre para borrar el post o dar ban.... si lo se... para eso si son r&aacute;pidos**\n\nsaludos y les deseo buena suerte... los que quieren jugar bien la necesitan y recuerden es un gran juego muy mal manejado por gente que solo busca lucrar y no dar algo de calidad...\n\nsobre el video cabe destacar que no pasa por que pais sea si no el comportamiento de personas puntuales ya sea argentino chileno o lo que fuere no es problema el pais el problema es la gente \n\nEL LOL ES UN JUEGO EXCELENTE pero no lo es la gente que lo maneja y tampoco lo es su sistema extra genial y buena onda de baneos\n\ntengo 22 a&ntilde;os y jamas jugue un juego tan toxico y de gente que demuestra que vale nada la comunidad he jugado muchisimas cosas pero la verdad no se puede \n\ny si gustan: aqui tienen otro video para re&iacute;rse un rato ;\n\nhttps://www.youtube.com/watch?v=qurUYZnHOaE","replies":[{"poster":"lronHide","date":"2015-12-29T03:32:15.874+0000","up_votes":2,"down_votes":0,"body":"Hace rato que Rito está más preocupado del $$$ que de la comunidad, nunca ha sido casualidad que los campeones nuevos salgan rotos a propósito para que la gente gaste en RP para comprarlos, o que los campeones más populares/rotos tengan 100 skin mientras que los menos populares apenas tengan 3 skin en 3~4 años...\n\nMientras la gente siga regalando $$$ por un juego administrado de una forma absurdamente deficiente, seguiremos recibiendo sanciones injustificadas, Bots respondiendo tus dudas, comunidad basura, etc etc etc...\n\nConseguir respuestas es fácil, solo que la gente se conforma con poco.","replies":[{"poster":"SenbonZakura 1","date":"2015-12-29T03:35:58.602+0000","up_votes":1,"down_votes":0,"body":"pienso firmemente en que vos si me entendes muchas gracias por comentar y aportar tu opinión.\n> [{quoted}](name=lronHide,realm=LAS,application-id=v7qsfXsE,discussion-id=hdAdeQ5m,comment-id=0004,timestamp=2015-12-29T03:32:15.874+0000)\n>\n> Hace rato que Rito está más preocupado del $$$ que de la comunidad, nunca ha sido casualidad que los campeones nuevos salgan rotos a propósito para que la gente gaste en RP para comprarlos, o que los campeones más populares/rotos tengan 100 skin mientras que los menos populares apenas tengan 3 skin en 3~4 años...\n> \n> Mientras la gente siga regalando $$$ por un juego administrado de una forma absurdamente deficiente, seguiremos recibiendo sanciones injustificadas, Bots respondiendo tus dudas, comunidad basura, etc etc etc...\n> \n> Conseguir respuestas es fácil, solo que la gente se conforma con poco.\n\nte dejo un video que te va a gustar mucho gracias :)\n\nhttps://www.youtube.com/watch?v=Rtv2v_Fm95E","replies":[]},{"poster":"SenbonZakura 1","date":"2015-12-29T03:34:27.794+0000","up_votes":1,"down_votes":0,"body":"pienso firmemente en que vos si me entendes muchas gracias por comentar y aportar tu opinión.","replies":[]}]},{"poster":"Runth","date":"2015-12-29T03:20:03.260+0000","up_votes":2,"down_votes":0,"body":"{{champion:121}} Pero vendran cambios decian, seran buenos decian {{champion:121}}","replies":[{"poster":"SenbonZakura 1","date":"2015-12-29T03:26:05.467+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Runth,realm=LAS,application-id=v7qsfXsE,discussion-id=hdAdeQ5m,comment-id=0003,timestamp=2015-12-29T03:20:03.260+0000)\n>\n> {{champion:121}} Pero vendran cambios decian, seran buenos decian {{champion:121}}\n\nlo espere tanto que paso mas tiempo ya jugando cualquier juego arcade que desquiciandome por mejorar en el lol","replies":[]}]},{"poster":"UMBRELLA CORP1","date":"2015-12-29T03:12:25.059+0000","up_votes":2,"down_votes":0,"body":"tenes razon bro pero bueno es como la droga mala y vicio","replies":[]},{"poster":"CapitanVertigo","date":"2015-12-29T22:03:07.387+0000","up_votes":1,"down_votes":0,"body":"Al tipo del video se le nota lo flammer a 1000000km de distancia. Lo único que hace es tratar de justificar su comportamiento responsabilizando a los demás, pero nunca pone el foco en su actitud: TIPICO. Se cree superior a los demás y con eso justifica tener prioridades o privilegios, no me parece una actitud q sume, es más, eso es una de las cosas q más genera malestar desde el pick room, gente que en vez de sugerir, exige.","replies":[{"poster":"SenbonZakura 1","date":"2015-12-30T03:08:46.078+0000","up_votes":1,"down_votes":0,"body":"no se tiene mucha razon en muchas cosas que sea o no flamer cosa de el pero de que joden ciertas cosas joden y mucho","replies":[]}]},{"poster":"Galiers","date":"2015-12-29T18:43:17.734+0000","up_votes":1,"down_votes":0,"body":"siempre hay personajes rotos en todos los juegos... wow los warriors (en el tiempo que jugaba wow), en dota habian algunos que no recuerdo cuales, en Tera los gunners y ahora los browlers, incluso en los juegos de pelea hay personajes rotos... es algo imposible de impedir, siempre hay algun detalle, un golpecito, una skill que hace que un personaje tenga ventaja sobre el resto\n\nsobre los campeones nuevos que salen rotos, eso es más que nada el no saber jugarles, muchos lloraban por illaoi pero en realidad no esta rota, solo hay que saber jugarle... su skill que te saca el alma es lentisima y tienes varias formas de prevenir la maldición... kyndred tambien se decia que estaba rota cuando salio, pero ahora nadie la pickea\n\nhay varios campeones \"rotos\", pero que si les sabes jugar o si sacas su counter no tienen nada de roto al final... varias veces he visto tipos que lloran por que X campeon esta roto, pero le siguen peleando 1v1, siguen pusheando la linea en lugar de jugar defensivo, siguen regalandole kills... tengan presente que roto y feed no es sinonimo","replies":[{"poster":"SenbonZakura 1","date":"2015-12-29T18:57:30.965+0000","up_votes":1,"down_votes":0,"body":"totalmente a lo que me refiero es al manoseo constante de los champ si lo crean de una manera y manoseas y bastardean todo es al pedo aprender bien a jugar un pj por que llega algun flaco y se le ocurre manoseas y te caga a eso me refiero","replies":[]}]},{"poster":"Tosca","date":"2015-12-29T16:14:28.041+0000","up_votes":1,"down_votes":0,"body":"Como siempre digo, para mi mejoro mucho , pero todavía se nota mucho la comunidad toxica y en eso tienen que trabajar mucho mas.","replies":[]},{"poster":"SL Forget","date":"2015-12-29T03:16:55.400+0000","up_votes":1,"down_votes":0,"body":"Espera al PentaQueue y después opiná.","replies":[{"poster":"SenbonZakura 1","date":"2015-12-29T03:26:29.617+0000","up_votes":1,"down_votes":0,"body":"el que ???? me podrias explicar?","replies":[]}]},{"poster":"SenbonZakura 1","date":"2015-12-29T03:09:14.638+0000","up_votes":1,"down_votes":0,"body":"mira como votan que chupa medias son loco","replies":[]}]}