{"poster":"bradiposky ","date":"2015-07-05T19:35:43.731+0000","title":"Un dubbio: scendere da gold a silver","subforum":"Aiuto e supporto","up_votes":2,"down_votes":0,"body":"Ciao. Mi sorge un dubbio. Si pu&ograve; scendere da Gold 5 a Silver 1? Se s&igrave;. bastano anche 1 o 2 partite perse a 0 punti o comunque per scendere da una lega ad un&#039;altra bisogna perdere molte partite a 0 punti? Scusate il disturbo, magari posso rintracciare la risposta alla mia domanda cercando sul forum, ma ora proprio non ho tempo. Grazie mille a chi cortesemente risponder&agrave; a questa domanda.","replies":[{"poster":"Easlay","date":"2015-07-05T21:34:01.069+0000","up_votes":2,"down_votes":0,"body":"anche 20 te ne serviranno per scendere, non è facile.\nMa a grandi linee, quando vedi che da gold 5 inizi a giocare vs silver 4, è ora di iniziare a preoccuparsi","replies":[{"poster":"Il Freddo","date":"2015-07-05T23:17:30.158+0000","up_votes":1,"down_votes":0,"body":"io sono silve V e gioco contro almeno un gold a partita","replies":[]}]},{"poster":"Reverenge","date":"2015-07-12T11:31:24.946+0000","up_votes":1,"down_votes":0,"body":"Per caso l'hanno tolto il fatto che se non fai classificate per 28 giorni e sei a 0 lp ti demotano?","replies":[]},{"poster":"bradiposky ","date":"2015-07-05T21:42:43.582+0000","up_votes":1,"down_votes":0,"body":"Guardate, probabilmente ho un mmr basso, anche se guadagno punti quanti ne perdo (non so se c'entri, ma tipo è possibile guadagni solo 17 punti ma a volte ne perdo lo stesso solo 17), nonostante in questa stagione sono salito da bronzo 1 (piazzamento coi placements) a gold 5, e ho circa 20 vittorie in più rispetto le sconfitte (sinceramente non so come si calcoli l'mmr, quindi non so se c'entri realmente qualcosa), però sono sceso facilmente da una divisione ad un'altra silver con una sola sconfitta a 0 punti, quindi mi chiedevo se da una lega ad un'altra (es. gold 5-silver 1), anche per chi ha un mmr basso, fosse più \"difficile\" scendere, o è la stessa cosa di scendere da una divisione ad un'altra. Grazie mille a tutti per le risposte!","replies":[]},{"poster":"Elle C","date":"2015-07-05T21:32:24.826+0000","up_votes":1,"down_votes":0,"body":"Per scendere da gold a silver devi perdere un numero sufficiente di partite in modo che il tuo mmr scenda a livello di quello del silver basso... Tipo silver quattro... Più o meno ci vorranno una sei o forse più partite perse consecutive a zero punti o anche di più se ne vinci qualcuna in mezzo","replies":[]},{"poster":"Ringiel","date":"2015-07-05T19:44:56.888+0000","up_votes":1,"down_votes":0,"body":"bisogna perdere numerose partite a 0 punti","replies":[]}]}