{"poster":"Greenlandxy","date":"2018-02-25T16:20:50.103+0000","title":"Schlechte Internetverbindung","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Moin hab mir jetzt nen Laptop geholt mit dem ich nicht immer an meinen Rechner muss wenn ich ne runde League zocken will....leider hab ich in meinem Zimmer nur WLAN und deswegen hab ich in jedem zweitem Spiel hohe pings (150+), meistens auch so das ich disconnecten muss... Gibts da eine L&ouml;sung wie ich ohne 15 m Kabelverlegen eine stabile Verbindung herstellen kann oder diese verbessern kann? Da ich mich rund um Netzwerke und Router nicht auskenne hab ich leider keine Ahnung...Vielen Dank an alle Antworter schon mal im vorraus(-:","replies":[{"poster":"Sidia","date":"2018-02-26T08:15:30.711+0000","up_votes":1,"down_votes":0,"body":"Wie bereits vorgeschlagen gibt es DLAN, da musst du dich allerdings vorher erkundigen, nicht in jedem Haus bzw jedem Zimmer funktioniert dies da manche Häuser 2 getrennte Stromnetze haben (wie bei mir Zuhause).\n\nAnderenfalls kommst du schlecht am Kabel vorbei, WLAN wird immer ein starker Problemfaktor sein","replies":[]},{"poster":"Pandeonor","date":"2018-02-26T07:51:30.819+0000","up_votes":1,"down_votes":0,"body":"Beste Lösung: DLAN. Kosten bei den billigeren etwa 40EUR für das Paar (gebraucht die Hälfte). Da brauchst Du nur jew. eine Steckdose bei Dir und in der Nähe des Routers sowie u.U. noch etwas LAN-Kabel. Bei neuen DLANs sind i.d.R. kurze Stücke LAN-Kabel dabei (aber kurz ist eben kurz). Das ist   _wesentlich_  besser als alles was Du über WLAN aus(an)richten kannst. \n\nEinzige Voraussetzung ist, das Du im gleichen Stromnetz wie der Router sitzt [also in einem Haus am gleichen Stromzähler].\n\nGrüße","replies":[]},{"poster":"Fight with Pride","date":"2018-02-25T16:22:32.856+0000","up_votes":1,"down_votes":0,"body":"Google mal Wlan-Repeater, die gibts schon relativ billig ab 15€","replies":[{"poster":"Greenlandxy","date":"2018-02-25T16:24:53.704+0000","up_votes":1,"down_votes":0,"body":"ja so ein Ding hab ich schon, bei meinem laptop sind auch 4 balken aber die verbindung ist halt nicht immer gegeben","replies":[{"poster":"Fight with Pride","date":"2018-02-25T16:32:21.239+0000","up_votes":1,"down_votes":0,"body":"hmh, wohnst du in einem Mehrfamilienhaus? dann solltest du mal die Frequenz deines Routers wechseln, und eventuell den Router mal höher stellen (also mal ein Meter höher das der freier funken kann), das hats bei mir gebracht.\nAnsonsten fällt mir nix mehr ein ausser lankabel^^","replies":[{"poster":"Greenlandxy","date":"2018-02-25T19:31:41.504+0000","up_votes":1,"down_votes":0,"body":"ne wohne im einfamilienhaus","replies":[{"poster":"Greenlandxy","date":"2018-02-25T19:33:10.980+0000","up_votes":1,"down_votes":0,"body":"wie ist denn das wenn ich einen repeater mit lan ausgang nehme....würde es dann wie bei einer richtigen lsn verbindung funktionieren?","replies":[{"poster":"Avorox","date":"2018-02-25T19:36:23.419+0000","up_votes":1,"down_votes":0,"body":"nein.","replies":[]}]}]}]},{"poster":"VIRGIN CODE","date":"2018-02-25T16:34:52.244+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Fight with Pride","date":"2018-02-25T16:35:56.744+0000","up_votes":1,"down_votes":0,"body":"Nur weil du wegen deinem Namensproblem gefrustet bist und den Support doof findest, musst du nicht so ein schwachsinn posten.","replies":[]}]}]}]}]}