{"poster":"ApocaBomb","date":"2015-04-19T09:21:21.982+0000","title":"Non so più che fare","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Sono bloccato in Silver 2 da una settimana.Prima vinco una,poi perdo.Ora per&ograve;,sto solo perdendo.Prima c&#039;&egrave; un troll,poi 2 afk,poi un feeder,poi Irelia,poi Cho,&egrave; uno schifo.Non riesco pi&ugrave; a fare niente,non posso carriare perch&eacute; i nemici sono troppo feeddati.Come posso fare?Possibile che l&#039;unica soluzione si fare duo e non soloq?\r\nUn&#039;altra domanda,arriver&agrave; il Ranked Team Builder prima o poi?Perch&eacute; i troll escono fuori da questo,il ruolo.Da quando hanno messo il team builder questi troll in normal non li ho trovati pi&ugrave;.","replies":[{"poster":"Lord Valotz","date":"2015-04-19T10:22:01.038+0000","up_votes":5,"down_votes":0,"body":"Magari hai solo raggiunto il tuo tetto di skill attuale, quando riuscirai a migliorare ulteriormente salirai ancora.","replies":[{"poster":"Frattaglia","date":"2015-04-19T10:45:22.189+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Valotz,realm=EUW,application-id=MJVj50Jw,discussion-id=gyKH4iEO,comment-id=0002,timestamp=2015-04-19T10:22:01.038+0000)\n>\n> Magari hai solo raggiunto il tuo tetto di skill attuale, quando riuscirai a migliorare ulteriormente salirai ancora.\n\n^ questo. Punta a trovare i tuoi errori.\n\nAd esempio noto che muori spesso: cerca di abbassare la media di morti a partita, facendoti trovare di meno fuori posizione, e già andrà meglio. E non sono convintissima della build che fai su rengar. :-/","replies":[{"poster":"ApocaBomb","date":"2015-04-19T10:54:42.641+0000","up_votes":1,"down_votes":0,"body":"Non ho mai detto che sono bravo,anzi,ho ancora molto da imparare.Ma vedere gente che nonostante abbia dato first blood+altre 2 kill tentare di fightare l'avversario un po mi fa incazzare xD poi gente che farma e prende danni gratuiti giusto perché avere un minion in più fa figo.So che non sono così bravo,però non posso credere che esista gente così in Silver 2.Comunque,grazie dei consigli.Tenterò di trovare una build più efficace e di ingaggiare meglio in tf.","replies":[]}]}]},{"poster":"DarkBlood Shadow","date":"2015-04-19T09:33:37.370+0000","up_votes":3,"down_votes":0,"body":"Prova a contattare SirZeel,forse ti boosta in cartapesta IV","replies":[]},{"poster":"MarcoBorowski","date":"2015-04-19T11:00:08.624+0000","up_votes":1,"down_votes":0,"body":"L'unica cosa che ti può far perdere le partite è quando uno va afk oppure ci sono persone molto tossiche.\nParli di troll e di campioni fuori ruolo ma è sbagliato perchè se uno lo fa per vincere è lecito e assolutamente normale (il metà lo costruisce l'utenza anche), l'importante è non flammare. \nPoi se quella persona muore intenzionalmente lo fa sia giocando campioni nel ruolo prestabilito dal meta sia non in ruolo...a quel punto non assume importanza non so se mi spiego.\n\nDal canto tuo pensa a giocare positivo che se vali davvero sali. L'importante è mantenere sempre l'armonia di gruppo se no sicuro perdete.","replies":[{"poster":"ApocaBomb","date":"2015-04-19T11:05:36.277+0000","up_votes":1,"down_votes":0,"body":"Beh io ci provo,ma certe volte trattenersi è un po complicato xD Farò del mio meglio per mantenere il team in armonia ed evitare flame.Ma se poi cominciano a flammare gli altri,come posso fare?Se dici di non flammare fanno peggio D:","replies":[{"poster":"MarcoBorowski","date":"2015-04-19T11:11:31.862+0000","up_votes":2,"down_votes":0,"body":"Lo so, infatti la community di lol non è proprio il massimo...\nTu guarda i tuoi errori pensa a te quello che hai fatto o quello che potevi fare, gli altri se flammano mutali e gioca per vincere...poi se quella partita la perdete amen! Vai avanti migliora le tue giocate e vedrai che di partita in partita migliorerai e anche la tua media sarà migliore, scalando le leghe!\n\nAlcune partite le perderai sempre e la gente flammerà sempre, tu non puoi farci niente l'importante è non gettarti in questo immaturo vortice inutile dell'odio e dell'invidia...se vuoi crescere come giocatore concentrati su te stesso! ;)","replies":[]},{"poster":"Dainsleif09","date":"2015-04-20T08:18:16.922+0000","up_votes":1,"down_votes":0,"body":"quando iniziano a flamarsi tra di loro ho notato che fare dei complimenti anche per dei trade piccoli o azioni di poco conto puo servire a riportare una pace momentanea e tutti poi pensano che tu puoi guidarli perche sembri simpatico{{champion:201}} ,a me funziona nel  75% dei casi ed e meglio che restare passivi e non parlare,scrivi piu di qualche gj o gg poi ti capisco se flammi per il feeder intenzionale quelli si che ti fanno saltare dai gangheri {{champion:82}}","replies":[]}]}]},{"poster":"Jolly Roger","date":"2015-04-20T08:26:32.211+0000","up_votes":1,"down_votes":0,"body":"ah da una settimana, c'è chi è fermo in bronzo da 3 anni.","replies":[]},{"poster":"Tyferet","date":"2015-04-19T09:29:47.957+0000","up_votes":1,"down_votes":0,"body":"Se non sbaglio avevo letto nelle news, quando fu messo il TB, che non sarà inserito per le ranked in quanto andrebbe a minare la strategicità che offre la draft, anche se a me e ad altri non dispiacerebbe come aggiunta.","replies":[{"poster":"ApocaBomb","date":"2015-04-19T10:14:18.895+0000","up_votes":1,"down_votes":0,"body":"Secondo me potrebbero fare teambuilder con i ruoli,non necessariamente con i champ.Solo con i ruoli,così rimane draft.","replies":[]}]}]}