{"poster":"Zeklow","date":"2015-11-12T12:47:47.366+0000","title":"Erhöhter Ping","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"Hallo, Ich habe folgendes Problem und hoffe das mir hier jemand helfen kann..\nSeitdem ich LoL spiele hatte ich immer eine konstanten 25 Ping, seid ein paar Tagen habe ich jedoch das Problem das meine Ping sich im 80-100 Bereich bewegt und ich habe echt keine Ahnung woran das liegen kann..\nHat jemand von euch schon Erfahrungen damit und wie habt ihr das Problem gel&ouml;st?\nDanke schon mal im Voraus :)\n\nZeklow {{champion:238}}","replies":[{"poster":"Nephirelle","date":"2015-11-12T13:38:48.259+0000","up_votes":2,"down_votes":0,"body":"Jetzt wo du's sagst: Gleiches Problem bei mir. Ping seit gestern immer bei 80. Hatte schon gedacht, dass irgendwas in meinem Netz mal wieder irgendwelche Updates zieht. Allerdings habe ich auch keine nennenswerten Einschränkungen im Spiel gespürt. Eventuell nur ein Display-Bug?","replies":[{"poster":"Zeklow","date":"2015-11-12T13:52:23.804+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nephirelle,realm=EUW,application-id=7hciEY9w,discussion-id=LLWX1clQ,comment-id=0000,timestamp=2015-11-12T13:38:48.259+0000)\n>\n> Jetzt wo du's sagst: Gleiches Problem bei mir. Ping seit gestern immer bei 80. Hatte schon gedacht, dass irgendwas in meinem Netz mal wieder irgendwelche Updates zieht. Allerdings habe ich auch keine nennenswerten Einschränkungen im Spiel gespürt. Eventuell nur ein Display-Bug?\n\nWas genau ist ein Display Bug?","replies":[{"poster":"VoiD Energy","date":"2015-11-12T17:37:21.391+0000","up_votes":1,"down_votes":0,"body":"ich glaub er Meint das da die anzeige rumm spinnt und etwas Falsches anzeigt :)\n\nEin Bug ist in der \"computersprache\" einfach ein Programm- bzw. Softwarefehler.","replies":[]}]}]},{"poster":"Adioz TFT","date":"2015-11-18T18:40:13.802+0000","up_votes":1,"down_votes":0,"body":"Ja hab das selber Problem, liegt denk ich nicht am Windows 10 Update.\nHab ne eigene Wohnung und nutze mein Internet alleine. Hab 80er Ping und zuvor immer Konstant 40.\nTritt seit 2 Tagen und nur im Zusammenhang mit League of Legends.","replies":[]},{"poster":"VoiD Energy","date":"2015-11-12T17:34:14.888+0000","up_votes":1,"down_votes":0,"body":"Also Es gibt sehr viel Ursachen dafür, was eine Neue Große Ursache ist will ich hier mal schnell Beschreiben und ich hoffe einfach dass ich jemand von euch da helfen kann.....\n\nSeit dem Win 10 draußen ist gib es viele die es sich noch runter laden oder halt immer tägliche Updates ziehen...\nEs ist grundsätzlich eingestellt das wenn sich jemand in der Nähe Updates laden will, die Updates über eure Rechner oder eures Internet ziehen das \n1. heist sie greifen auf euer Internet zu um die Updates schnell auszuführen... das wissen halt nicht viel...\n\nwie man das ausschaltet erklär ich euch schnell:\nin die Suchleiste gebt ihr Update ein und klickt dann auf \"Windows Update dann auf erweiterte Optionen und mittig steht dann Übermittlung von Updates auswählen das klickt ihr an und schaltet es aus... \n\nZusammenfassung:\n\n-Windows Updates > erweiterte Optionen > Übermittlung von Updates > Aus....\n-Ansonsten kommt es drauf an wer alles bei dir Im Netzt hängt wenn viele drinne sind dann steigt halt der Ping, bei mir ist es wenn meine Schwester irgendwelche Filme streamt....\n-Wenn du starke Probleme hast dann ruf einfach den Kundendienst deines Providers an (also Telekom oder so)\n\n\nDas wars, ich wünsche alzeits ein guten Ping, faire Teammitglieder und viel Spaß! hoffe es hat geholfen...","replies":[]}]}