{"poster":"Hysteròn","date":"2017-12-27T00:58:30.081+0000","title":"Movimento e autoattack adc","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"Salve a tutti gioco da un anno e Maino adc, e da un periodo che sto cercando di migliorarmi nella meccanica dell&#039;autoattack e ho scoperto che ci sono vari settaggi, come ad esempio mettere l&#039;autoattack e movimento automatico sul tasto sinistro, inizialmente pensavo fosse comodo ma premere ogni volta shift mi tiltava parecchio infatti a volte non mi lanciava le skill, io in questo momento l&#039;ho settato sulla barra space , volevo sapere dai pi&ugrave; esperti quali sono i settaggi migliori ad esempio quali usano i proplayer adc?, inoltre sarei davvero riconoscente se qualcuno mi spiegasse la differenza tra l&#039;autoattack normale con la freccia verde e quello autoattacco e movimento automatico con la freccia rossa. Cordiali saluti e grazie in anticipo","replies":[{"poster":"Hysteròn","date":"2017-12-27T13:46:24.911+0000","up_votes":1,"down_votes":0,"body":"Grazie per la risposta anche se non in sostanza non mi ha chiarito nessun punto, io i tasti laterali del mouse li uso per collocare la visuale sul mio campione e per il segnale di visione nemica, quando hai parlato dei possibili problemi intendevi quello con autoattack movimento sul sinistro?","replies":[]},{"poster":"ILoveTiramisu","date":"2017-12-27T07:24:39.825+0000","up_votes":1,"down_votes":0,"body":"Ho il mouse con 4 tastini extra, ma in genere lo faccio manualmente. L'unica cosa è che un miss click o uno zhonia puo farti andare in mezzo al teamfight, ma mi capita 1 volta ogni 30 partite. Lo spazio lo uso per la funzione normale. Quello che usi tu ha problemi di questo tipo: recolli e premi inventario e il tuo personaggio si sposta annullando il recall. Uguale se premi sulla mappa. Usando molto la mappa mi sono trovato scomodo.\nAltro problema: è difficile da imparare e per imparare una skill ci vogliono almeno 30 partite di seguito. ","replies":[]}]}