{"poster":"Desaroll","date":"2016-09-21T23:23:56.509+0000","title":"Estoy a punto de tener un ladrillo con antenas, y te lo cuento.","subforum":"Off-topic y temas personales","up_votes":7,"down_votes":2,"body":"Hayo!\n\nEsta vez decid&iacute; hacer un post m&aacute;s &quot;personal&quot; del proyecto de turno ;-)\n\n#&iexcl;Advertencia! &iexcl;Este post hablar&aacute; de tecnolog&iacute;a, redes y de meter mano donde los fabricantes no quieren que lo hagas!\n##Si no te gustan estos temas, no sigas, te parecer&aacute; aburrido. No digas que no te advert&iacute; luego ;-)\n\nResulta que ten&iacute;a un modem/router que me dej&oacute; Arnet hace un tiempo (Ten&iacute;a contratado el servicio, cambi&eacute; a Fibertel, dijeron que vendr&iacute;an a buscarlo, nunca vinieron, volv&iacute; a Arnet y me dieron uno nuevo), al cual ya ten&iacute;a acceso como administrador (Alcanz&oacute; algo de creatividad para encontrar la p&aacute;gina de login y una b&uacute;squeda en internet para tener el usuario y contrase&ntilde;a correctos), y que ya hab&iacute;a usado como Router de emergencia en alguna ocasi&oacute;n.\n\nResulta que lo ten&iacute;a inactivo, en mi casa, cuando traduzco el ultimo articulo sobre [Riot Direct](http://boards.las.leagueoflegends.com/es/c/charlas-generales/aXa8fzdZ-traduccian-configurando-internet-para-aplicaciones-en-tiempo-real-parte-3). Leyendo sobre el hardware y software adaptado a medida, comenc&eacute; a investigar sobre el tema, y me cruc&eacute; con uno de los tantos proyectos de c&oacute;digo abierto al respecto, [OpenWRT](https://openwrt.org)\n\n##&iquest;Que ventajas tiene hacer esto?\n\nPues pasas a tener m&aacute;s control sobre lo que puede hacer o no puede hacer tu router. &iquest;Quieres controlar cuanto consume cada persona en tu casa? Puedes hacerlo. &iquest;Quieres limitarlo? Tambi&eacute;n. &iquest;Quieres poder desconectarlos con solo presionar 1 o 2 botones? &iexcl;Puedes dejarlo listo para eso! &iquest;Quieres tener un bot&oacute;n rojo que sea: &quot;Modo Ranked&quot; en la cual se desconecte a todos excepto tu PC, y se le de prioridad a la conexi&oacute;n de League of Legends? &iexcl;Puedes hacerlo! Aunque probablemente tu familia no estar&aacute; muy contenta cuando lo logres.\n\nAs&iacute; pues, agarr&eacute; mi routercito, un Broadband P.DG A4001N, y siguiendo una [gu&iacute;a que encontr&eacute;](http://foro.seguridadwireless.net/openwrt/(desarrollo)-openwrt-en-adb-p-dg-a4001n-de-arnet/) comenc&eacute; el proceso de hacerlo m&aacute;s personalizable.\n&nbsp;\n\n|_Rip Router_\n|-\n|http://www.mediafire.com/convkey/f4f0/3n6d664221xgp7p4g.jpg\n\nDespu&eacute;s de transpirar en varias ocasiones (Despu&eacute;s de todo, un paso en falso en estos procesos te deja con un ladrillo con antenas), logr&eacute; que tuviera el sistema operativo corriendo, y listo para ser personalizado.\n&nbsp;\n\n|_Mira Mama! Soy todo un Jacker!_\n|-\n|http://imgur.com/Eg5QjRy\n\n&nbsp;\n#No todo es color de Rosa.\n&nbsp;\n\nEl sistema OpenWRT es un sistema operativo Linux, con un gestos de &quot;modulos&quot; para manejar la ampliaci&oacute;n.\n\nExplorando la lista de m&oacute;dulos (Muy amplia, debo decir), encontr&eacute; uno que quise probar, as&iacute; que mand&eacute; el bot&oacute;n de &quot;install&quot;.\n\nAh&iacute; salt&oacute; un peque&ntilde;o problema.\n\n&nbsp;\n##Resulta que, los routers no tienen discos duros.\n&nbsp;\n\n|&iexcl;The Horror!\n|-\n|http://imgur.com/WqNPjUo\n\n&nbsp;\nEs decir, tienen una memoria Flash (Del mismo tipo que los celulares) interna de poca capacidad. Despu&eacute;s de todo, el fabricante no quer&iacute;a que la usases para descargar cosas extra :V\n\nAs&iacute; pues, pas&eacute; al proceso de utilizar un pendrive que ten&iacute;a abandonado por ah&iacute; (De 16gb) como disco duro para el router.\n\nPara eso, tuve que formatearlo con formato Linux. Para lo cual, hubiera sido ideal tener una PC con linux cerca... Lo cual no tengo (A&uacute;n, estoy en proceso).\n\nAs&iacute; que, tuve que conectar el pendrive al puerto USB del modem, y por [SSH](https://es.wikipedia.org/wiki/Secure_Shell) ir enviando los comandos necesarios para realizar el particionado, luego el formateo, y por ultimo montarlo en el sistema de archivos. Linux es m&aacute;s quisquilloso que Windows con los dispositivos removibles, pero, que sea quisquilloso me permiti&oacute; hacer algo luego...\n\n(Aqu&iacute; tuve que hacer algunas cosas para que el gestor de modulos descargue en el USB y no en la memoria interna, pero son detalles muy aburridos.)\n\nAs&iacute; pues, con 16gbs de disco duro extra (14.4 en realidad... Ya sabes, te los venden con umeros redondeados, pero la mayor&iacute;a no est&aacute; realmente accesible :V), proced&iacute; a querer descargar de nuevo el mismo modulo... &iquest;Que pod&iacute;a salir mal?\n\nPues resulta que...\n&nbsp;\n\n|&iexcl;Bang! Los routers tampoco necesitan tener mucha memoria RAM.\n|-\n|http://imgur.com/ONs7PWF\n\n&nbsp;\n\nLo que hizo que cuando el router quiso descomprimir el programa, se quedara sin memoria para hacerlo, por lo que el Sistema Operativo le dijo: &quot;Par&aacute;, loco, est&aacute;s comiendo mucha memoria&quot;, y bang. Le peg&oacute; un tiro. Directo al coraz&oacute;n. &iquest;Testigos? Linux aqu&iacute; es el criminal, el testigo, el juez y el verdugo.\n\n&quot;Killed&quot; me apareci&oacute; en la consola. Literal.\n\n##&iquest;Ahora que hago?\n\nPues claro, aunque tuviera memoria RAM que se pudiera conectar por USB, &iexcl;Mi router solo tiene un puerto!\n\nPero aqu&iacute; me salv&oacute; lo que Linux puede hacer que Windows no puede (En realidad s&iacute; puede, pero me pareci&oacute; m&aacute;s elegante como lo hace Linux :V)\n\nResulta que, a diferencia de Windows, Linux puede &quot;particionar&quot; un dispositivo removible, pudiendo usar un trozo para algo, y otro trozo para otra cosa.\n\nAs&iacute; pues, luego de buscar como hacerlo, termin&eacute; usando el pendrive USB con 13GB de disco duro, y 1.4GB de espacio SWAP (En Windows se le conoce como &quot;Memoria Virtual&quot;)\n\nEl espacio SWAP es un espacio de una memoria lenta (Un disco duro, un pendrive) que se usa para &quot;resguardo&quot; de informaci&oacute;n menos usada de la memoria r&aacute;pida (RAM), permitiendo liberar espacio de la RAM para la informaci&oacute;n que se est&eacute; usando en ese momento, o que se use m&aacute;s frecuentemente.\n\nAunque 1.4GB de memoria SWAP es un overkill, prefer&iacute; no quedarme corto, y dej&eacute; redondo el espacio de almacenamiento (10 puntos por estilo!)\n\nHabiendo hecho esto, descargu&eacute; lo que quer&iacute;a descargar desde que lo v&iacute;, solo para descubrir... Que usa funciones avanzadas del procesador que no estaban disponibles en mi modelo de router\n&nbsp;\nhttps://i.kinja-img.com/gawker-media/image/upload/s--Q-ZYoI0k--/c_scale,fl_progressive,q_80,w_800/1405150531039080774.jpg\n&nbsp;\n#El peligro a&uacute;n no termina\n&nbsp;\nLuego de tama&ntilde;a decepci&oacute;n, segu&iacute; jugando con las configuraciones y actualizaciones.\n\nDecid&iacute; actualizar el modulo encargado de actualizar otros m&oacute;dulos (El gestor de paquetes, para quien sepa de Linux).\n\n&iquest;Que pod&iacute;a salir mal?\n\n##Si alguien sabe que pas&oacute; aqu&iacute;, que me lo cuente.\n\nPues bien. Actualiza, todo ok. APARENTEMENTE todo ok.\n\nIntento actualizar otra cosa, y me tira un error.\n\nUn error que era evidente por qu&eacute; ocurr&iacute;a, pero no pod&iacute;a solucionarlo desde mi lado.\n\nEl error era algo como: (No lo recuerdo con exactitud, y no tom&eacute; imagen de eso :V)\n\n> Error opening //usr/var/file.config: not such file or directory.\n\nBien, para quien sepa de linux, al error ya deber&iacute;a haberlo visto.\n\nPara quien conozca Windows, en Linux, todas las rutas a archivos (Y otras cosas, pero archivos en general) comienzan con &quot;/&quot;, a diferencia de Windows, que comienzan con la letra de la unidad (&quot;C:/&quot;, &quot;D:/&quot;, &quot;E:/&quot;), ya que, en Linux, todos los &quot;discos&quot; son parte del mismo sistema de archivos.\n\nEl programa estaba intentando acceder a un archivo comenzando con &quot;//&quot;, lo que era el origen del fallo.\n\nIntento hacer otra cosa, y me tira un error similar. Intento deshacer la actualizaci&oacute;n, otro error similar. Por todos lados un error por que intentaba entrar a un archivo con &quot;//&quot;.\n\nAs&iacute; pues, decido intentar reiniciar el router, para ver si era un error de algo que carg&oacute; torcido.\n\nAl intentar acceder a la consola:\n&nbsp;\n\n|_Mira! Dice PuTTY!_\n|-\n|http://imgur.com/BE2U2SQ\n\n&nbsp;\nComenc&eacute; a sudar.\n\nPues ver&aacute;n...\n\nCuando una PC falla por software, pones un CD, arrancas desde &eacute;l, y puedes formatear la PC desde 0.\n\nCuando un Router falla por software... No arrancan los puertos de red, no arranca el puerto USB, no arranca nada...\n\nNada, de nada.\n\nB&aacute;sicamente, tienes un ladrillo con antenas, ya que no puedes llegar a &eacute;l por ning&uacute;n m&eacute;todo. Bien podr&iacute;as usarlo para, al menos, terminar la pared.\n\n#No todo est&aacute; perdido\n\n---------------------\n---------------------\n---------------------\n\n> **A los programadores de OpenWRT**:\n\n> Gracias.\n\n> Si no fuera por ustedes, habr&iacute;a terminado la pared, pero habr&iacute;a perdido un router, adem&aacute;s de sentirme como un completo idiota cada vez que viera las antenas sobresaliendo de la pared.\n\n> Desaroll, 21/09/2016\n\n---------------------\n---------------------\n---------------------\n\nNo solo se prepararon para eso, si no que hicieron [una bella gu&iacute;a](https://wiki.openwrt.org/doc/howto/generic.debrick) explicando como deshacer esta clase de cosas.\n\nObviamente, esa gu&iacute;a no sirve para todas las formas en las que puedo cagarl* haciendo esta clase de cosas, pero es un comienzo.\n\nPor ahora, sobrevivo. Dentro de poco, quiz&aacute;s termine la pared.\n\n-----------------------\n\nGracias por leer hasta ac&aacute;, mi bella descarga de lo que estuve haciendo estos d&iacute;as :V\n\nA quien no le gusta, que no lea. Esto es Off-topic, gente, sean pacientes xD\n\nSi alguien quiere intentar algo similar y no est&aacute; del todo seguro como, que me avise, y as&iacute; ~~la cagamos juntos~~ intento ayudarlos.\n\nSuerte!","replies":[{"poster":"Hnk Kenshiro","date":"2016-09-21T23:49:14.009+0000","up_votes":3,"down_votes":0,"body":"Los prestigiosos estudiosos especializados de mi proveedor de Internet, siempre recomiendan apagarlo y prenderlo :)","replies":[{"poster":"Desaroll","date":"2016-09-21T23:54:46.410+0000","up_votes":2,"down_votes":0,"body":"SIEMPRE.\n\n\"¡El módem se prendió fuego y tuve que apagarlo a baldasos de agua!\"\n\"¿Ya probó reiniciando el modem? Si ya lo hizo, hágalo de nuevo.\"\n\nPero pará! Ni que prenderlo y apagarlo fuera... Oh, ya funciona...\n\nSuerte!","replies":[{"poster":"Hnk Kenshiro","date":"2016-09-21T23:57:35.482+0000","up_votes":1,"down_votes":0,"body":"Tendré que leer despacio el post para intentar seguirle el hilo, pero se agradece xd","replies":[{"poster":"Desaroll","date":"2016-09-21T23:59:39.089+0000","up_votes":1,"down_votes":0,"body":"Te aviso que no hay nada que agradecer xD\n\nEra un proyecto propio que tenía ganas de contar, así que lo tiré por el foro :V\n\nSuerte! :3","replies":[]}]}]}]},{"poster":"Nombre ofensivo","date":"2016-09-22T11:51:51.801+0000","up_votes":2,"down_votes":0,"body":"Vos cambiando el firmware y yo aca insultando a fibertel para que me dejen abrir algunos puertos del router(Ya entre al setup pero aun que ponga los parametros los puertos siguen bloqueados)","replies":[{"poster":"Desaroll","date":"2016-09-22T11:54:51.323+0000","up_votes":1,"down_votes":0,"body":"Yep, me pasó lo mismo cuando estuve en Fibertel\n\nTodo te lo controlan remotamente, así que dependes de su servicio de atención al cliente para que te dejen hacer alguna boludes.\n\nEs uno de los motivos por los que volví a Arnet xD\n\nUn amigo con Fibertel lo que hizo fue pedir que lo pasaran a modo Bridge.\n\nEn ese modo, el modem pasa a actual de forma transparente, dejando pasar todo lo que le llegue. Obviamente, solo pídelo si tienes un Router atrás que puedas configurar, para evitar que tu PC quede expuesta.\n\nSuerte!","replies":[{"poster":"Nombre ofensivo","date":"2016-09-22T12:28:51.864+0000","up_votes":1,"down_votes":0,"body":"Lo voy a tener en cuenta compro algun router barato y con eso andare. Aunque nuca descargo software extraño asi que dudo tener algun inconveniente","replies":[{"poster":"Desaroll","date":"2016-09-22T12:35:57.184+0000","up_votes":1,"down_votes":0,"body":"El problema de quedarte sin Router es que tu PC quedaría expuesta a Internet.\n\nNo dependería de lo que instales tú, si no de que herramientas tenga el atacante.\n\nSin ir más lejos, sin un Router de por medio, solo es necesaria tu IP para saber que puertos tienes abiertos (Y de ahí deducir que programas usas, en algunos casos hasta sus versiones), que sistema operativo usas, y otros datos.\n\nAdemás de que con el modem en modo bridge, sin router, solo 1 PC puede conectarse a Internet xD\n\nSuerte!","replies":[{"poster":"Nombre ofensivo","date":"2016-09-22T13:27:09.765+0000","up_votes":1,"down_votes":0,"body":"ok, hora de pedir un router prestado a un amigo {{summoner:6}}","replies":[]}]},{"poster":"iNGENiO","date":"2016-09-22T12:52:07.365+0000","up_votes":1,"down_votes":0,"body":"Es cierto lo que dice desaroll, si queres sacarte la atención al cliente de fibertel de encima pásalo a modo bridge y usalo solo para establecer la conectividad y con un router detras controlas todo vos. En varias empresas lo tenemos así y tenes mas libertad en las configuraciones.\n\nY un problema menos, no llamar a fibertel para cada vez que queres algo.","replies":[]}]}]}]},{"poster":"Condor","date":"2016-09-21T23:42:22.669+0000","up_votes":2,"down_votes":0,"body":"Ohhh.... no me imagino tu frustración.\n\nTodo para poder terminar la pared hahaha.\n\nAl menos fue una experiencia educativa (?.","replies":[{"poster":"Desaroll","date":"2016-09-21T23:46:15.497+0000","up_votes":1,"down_votes":0,"body":"Por suerte al final lo hice safar, pero sí, estuvo cerca xD\n\nObviamente, lo hice para aprender como. Siempre que hago experimentos peligrosos los hago:\n\n1° En algo que no me sirva.\n2° En algo que no sea mío.\n3° En algo reemplazable.\n4° En algo mío.\n\nAhora... Creo que mi primo me había pedido ayuda con su router....\n\nMUHAHAHHAHAA","replies":[{"poster":"Vaendrys","date":"2016-09-22T01:07:36.425+0000","up_votes":1,"down_votes":0,"body":"\"En algo que no sea mio\",nunca en mi vida supe nada de informatica y intente formatear un pc,no tengo ni idea,pero el pendrive se murio,y nunca(por mas que busque soluciones) volvio a ser el mismo.Le tuve que comprar un pendrive nuevo a mi vecino xD","replies":[{"poster":"Desaroll","date":"2016-09-22T02:40:37.445+0000","up_votes":1,"down_votes":0,"body":"De un fallo se aprende más que de un éxito!\n\nEso dicen, pero creo que sólo aplica si sabes en qué fallaste :V\n\nFormatear cualquier cosa que se pueda extraer es una ruleta rusa xD\n\nCualquier corte de luz, desconexión o lo que fuese puede dejarlo totalmente inútil.\n\nPero no le tengas miedo a volverlo a intentar (Sólo asegurate de poder recuperar la información!)\n\nSuerte!","replies":[{"poster":"Vaendrys","date":"2016-09-22T03:47:05.706+0000","up_votes":1,"down_votes":0,"body":"Al menos en ese momento fui lo suficientemente inteligente de sacar la información que tenia en el pendrive,sino no estaría contando esto.\nNunca estudie informatica,pero me manejo un poco de lo que intento.Casi siempre la cago,pero la mayoria de veces me lo soluciona un amigo(Que es chino xD).\nMe acuerdo que hace ya tiempo mi viejo me dejo su iphone(Me acuerdo que era un 3g,cuando me lo dio ya era casi obsoleto),y intentando cosas con el,no se que hice que no prendia mas.Estuve un mes con el celular escondido para que no me mataran,pero al final me salvo mi amigo el chino (?","replies":[{"poster":"Desaroll","date":"2016-09-22T11:18:37.599+0000","up_votes":1,"down_votes":0,"body":"Aguante el chino!\n\nSe la re banca (?\n\nSuerte!","replies":[]}]}]}]},{"poster":"Condor","date":"2016-09-22T00:02:16.210+0000","up_votes":1,"down_votes":0,"body":"Jajajaja, pobre primo ~~ Kappa~~","replies":[]}]}]},{"poster":"Navutan","date":"2018-11-11T21:51:17.932+0000","up_votes":1,"down_votes":0,"body":"Yo tengo el mismo router y le instale openwrt 18.06.1 pero no se como habilitar el puerto USB, baje los paquetes basicos y de ahi no se mas nada, no se como ejecutar comandos, se algo de linux porque hace años lo instale por curiosidad pero muchos conceptos no los se, lo que quiero hacer es poner un disco portatil para usar los archivos por la red. tambien tengo un router CPE210 de exteriores con openwrt y quiero usar para controlar el trafico de cada dispositivo para poder jugar sin tener que cambiar la clave del wifi jaja. yo me conecto por cable asi que no me afecta.","replies":[{"poster":"Navutan","date":"2018-11-11T21:55:50.337+0000","up_votes":1,"down_votes":0,"body":"me olvidaba, yo se electronica y se puede subir el firmware original o cualquiera con un puerto serie pero se necesita una interface y soldar cables en el router. aparte de tener una computadora que tenga puerto serie","replies":[{"poster":"Desaroll","date":"2018-11-12T01:41:49.611+0000","up_votes":1,"down_votes":0,"body":"Supuestamente, tras instalarlo debería tener un servidor SSH listo para que te conectes como root.\n\nSi no, el webserver para instalar paquetes más que nada.\n\n---------------------------\n\nYep, pero creo que antes de ponerme a buscar una placa con puerto serie tiraba el router xD. Me sobró de cuando tuve Arnet, nunca vinieron a buscarlo, así que lo usé pa' romperlo.\n\nSuerte!","replies":[]}]}]},{"poster":"zelaya19","date":"2016-09-21T23:38:46.284+0000","up_votes":1,"down_votes":0,"body":"Pero si querés controlar el wifi solo bastaba con crear una jaula de Faraday xD","replies":[{"poster":"FedecarboneroUY","date":"2016-09-22T19:22:09.431+0000","up_votes":1,"down_votes":0,"body":"el de electricidad nos mandó a buscarlo en google a ver quién era ... jaja, te imaginás que voy a buscar eso? JAJA","replies":[]},{"poster":"Desaroll","date":"2016-09-21T23:40:31.024+0000","up_votes":1,"down_votes":0,"body":"¿¡COMO NO SE ME OCURRIÓ ESO!?\n\nTotal, ¿Quien no tiene varios barrotes metálicos guardados y está dispuesto a ponerlos y quitarlos cuando le conviene? xD\n\nSuerte!","replies":[{"poster":"iNGENiO","date":"2016-09-22T12:01:23.446+0000","up_votes":1,"down_votes":0,"body":"con una olla pequeña alcanza\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Desaroll","date":"2016-09-22T12:38:39.852+0000","up_votes":1,"down_votes":0,"body":"Y luego en que cocino?","replies":[{"poster":"iNGENiO","date":"2016-09-22T12:55:22.966+0000","up_votes":1,"down_votes":0,"body":"Router al vapor en este caso \n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Desaroll","date":"2016-09-22T13:12:52.199+0000","up_votes":1,"down_votes":0,"body":"Delicioso :3","replies":[]}]}]}]}]}]},{"poster":"KarmaUnder","date":"2016-09-22T19:04:23.737+0000","up_votes":1,"down_votes":0,"body":"jajajajaj que interesante, bastante quilombo pero lo vale por el botoncito de modo ranked (?\nAlgun dia averiguare y lo intentare :P \nSuerte desa","replies":[{"poster":"Desaroll","date":"2016-09-22T19:17:13.989+0000","up_votes":1,"down_votes":0,"body":"ALERTA: El modo ranked puede enfurecer a familiares que compartan la conexión Wifi :V\n\nSuerte karma! :3","replies":[]}]},{"poster":"iNGENiO","date":"2016-09-22T12:00:09.724+0000","up_votes":1,"down_votes":0,"body":"No es buena idea cambiar de firmware el router, a no ser que sea un router, en el cual fue probado el firmware y te asegures de que ande bien previamente a realizar el cambio.\n\nO si queres probar algo nuevo tiene que ser en un router de altas prestaciones, para meter un linux, ya que siempre es mas pesado que el firmware original que fue preparado y testeado especialmente por el fabricante.\n\nMas que nada en routers de muy poca calidad que son los que entregan las empresas de internet.","replies":[{"poster":"Desaroll","date":"2016-09-22T12:33:10.632+0000","up_votes":1,"down_votes":0,"body":"OpenWRT precisamente trabaja con eso en mente.\n\nConsume muy poco (Recien instalado, el espacio en la memoria flash libre era del 80%, y la memoria se mantiene al 30% libre), y está preparado con diferentes arquitecturas para que puedas hacerlo funcionar en casi cualquier router (Siempre que sepas cual usar).\n\nIncluso puedes compilarlo en el router mismo para evitar que tenga ningún problema, que es una de las cosas que estoy intentando hacer ahora.\n\nY ni en pedo arriesgo un Router de altas prestaciones para hacer algo que me lo puede arruinar xD\n\nMi problema con la memoria y el almacenamiento fue que intenté hacer funcionar algo que está preparado para PCs de escritorio. Quise probar si lograba hacerlo :V (Node.js, para ser exactos)\n\n--------------------------------------------\n\nSi vamos al caso, hacer cualquier cosa sin saber lo que haces no es buena idea, pero siempre se tiene que aprender en algún sitio, verdad?\n\nPor eso me metí en este proyecto, para pasar de \"No saber lo que hago\" a \"Ya sé lo que hago!\" (Aunque recién voy por el 5% de ese camino :V)\n\n---------------------------------------\n\nLuego, no siempre el firmware no oficial es más pesado que el oficial. \n\nMuchas veces, los firmware oficiales vienen con muchas funciones que no usarás en tu vida y no puedes desactivar (Por ejemplo, al usar el router como lo estoy usando ahora no estoy usando el servidor DHCP (Solo el cliente), ni el DDNS (No lo necesito), ni el firewall (Está detrás de otro, así que está apagado), ni el protocolo de conexión por linea telefónica (No lo voy a usar de módem). En muy pocos firmware oficiales esas funciones están preparadas para ser apagadas, pero en el firmware no oficial es cosa de un par de opciones para desactivarlos. Y, si paso necesitarlos, estoy a otro par de botones de tenerlas de nuevo.\n\n------------------------------------------\n\nSi coincido en la ultima parte. Pero, este modem, por ejemplo, tenía problemas con el firmware oficial. Solía trabarse y era necesario un reinicio. Desde la actualización no tuve más problemas.\n\nSuerte!","replies":[{"poster":"iNGENiO","date":"2016-09-22T12:47:57.807+0000","up_votes":1,"down_votes":0,"body":"Conozco que es openWRT, no tenes que darme una clase de lo que es el proyecto. \n\nTe doy mi consejo porque:\n\n1) Soy profesor universitario.\n2) Ya probamos muchos routers y muchos firmwares\n3) Uso linux desde las primeras versiones  del kernel , soy viejo y tengo mucha experiencia con el SO.\n\nProbar cosas y ver que hacen suele ser divertido, me alegro que experimentes en el tema, yo te doy mi experiencia en empresas donde realmente necesitas que un router de altas prestaciones haga cosas distintas ahí te viene bien, poder controlar el router como si fuera un pc con linux, siempre que el router sea de buenas prestaciones, como te dije antes, ahora en un router de muy escasas prestaciones, la cosa se pone aspera. (Escasas presataciones = microprocesador lento y poca memoria y lenta)\n\nUltimo consejo, cuando decis: \n\n\"este modem, por ejemplo, tenía problemas con el firmware oficial. Solía trabarse y era necesario un reinicio. Desde la actualización no tuve más problemas\"\n\nTal vez el hardware del router no funcione muy bien, por eso se trababa. No es normal que se trabe. menos con el firmware oficial del fabricante. Tal vez tendrias que revisar el router a ver si tiene algo reparable en el hardware. Tambien muchas veces la fuente se torna inestable.","replies":[{"poster":"Desaroll","date":"2016-09-22T13:12:28.948+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iNGENIO 40,realm=LAS,application-id=J8qpiO2I,discussion-id=PHENF99g,comment-id=000800000000,timestamp=2016-09-22T12:47:57.807+0000)\n>\n> Conozco que es openWRT, no tenes que darme una clase de lo que es el proyecto. \n \nDesde mi lado, no tenía forma de saberlo. Prefiero asumir lo que ocurre con la mayoría de las personas, y es que no conocen el proyecto.\n\nEl Software que le cargué al modem ya había sido probado en este modelo. En la página de OpenWRT figuraba como compatible, y en la guía que coloqué al principio se usa ese mismo software para este mismo modelo. No avancé a ciegas.\n\n> Te doy mi consejo porque:\n> \n> 1) Soy profesor universitario.\n> 2) Ya probamos muchos routers y muchos firmwares\n> 3) Uso linux desde las primeras versiones  del kernel , soy viejo y tengo mucha experiencia con el SO.\n\nFelicidades. Aunque prefiero valorar los consejos por lo que son, no por quien los da. Mis respuestas siguen siendo las mismas. Aunque saber tu trasfondo me sirve para poder hablar más directo, y sin lenguaje de lego, como quien lo dice.\n\n> Probar cosas y ver que hacen suele ser divertido, me alegro que experimentes en el tema, yo te doy mi experiencia en empresas donde realmente necesitas que un router de altas prestaciones haga cosas distintas ahí te viene bien, poder controlar el router como si fuera un pc con linux, siempre que el router sea de buenas prestaciones, como te dije antes, ahora en un router de muy escasas prestaciones, la cosa se pone aspera. (Escasas presataciones = microprocesador lento y poca memoria y lenta)\n\nYep, es cierto. Pero no tengo suficiente dinero como para juguetear con Routers de altas prestaciones, por lo que juego con lo que tengo a mano, disponible, y que no me sirva en su estado actual.\n\n> Ultimo consejo, cuando decis: \n> \n> &quot;este modem, por ejemplo, tenía problemas con el firmware oficial. Solía trabarse y era necesario un reinicio. Desde la actualización no tuve más problemas&quot;\n> \n> Tal vez el hardware del router no funcione muy bien, por eso se trababa. No es normal que se trabe. menos con el firmware oficial del fabricante. Tal vez tendrias que revisar el router a ver si tiene algo reparable en el hardware. Tambien muchas veces la fuente se torna inestable.\n\nPuede ser. Pero, como ya mencioné, no tenia ningún uso para este router, más que \"Router de emergencia si se rompía otro\". No pienso cambiar ninguna pieza que tenga rota, ya que no valdría el dinero por lo que es.\n\nActualmente, tengo 3 routers (Sin contar el router/modem que estoy usando, ni el que hablo en el post) configurados por mi casa, por lo que si se rompe alguno puedo reemplazarlo por otro con otra distribución, así que no lo necesitaba ni como router de emergencia.\n\n----------------------------------------\n\nEn mi experiencia (Hogareña y configurando una red con VLANs, varios switchs, varios routers y dos conexiones diferentes a Internet en una escuela), los firmware oficiales de la mayoría de los routers traen muchas opciones que no se usan en la mayoría de las configuraciones habituales, y, cuando necesitas una opción avanzada, tienes que buscar la marca y modelo de router que tenga esa opción. Luego también problemas comunes que me he cruzado han sido:\n\n- Servicios DDNS que no permiten configurar el servicio que quiero utilizar.\n- Modems con firmware no de fabrica, si no manipulado por el ISP (Como es el caso del que uso para este experimento, que tenia una interfaz más amigable para el usuario estandar, pero a cambio era poco comunicativa respecto a errores, la redirección de puertos era imposible, y no puedo descartar que los errores que sufría el modem fueran por esos cambios).\n- Más especifico para cuando hice la red de la escuela: El botón de reset demasiado fácil de utilizar, lo que provocaba que los alumnos resetearan los dispositivos en cuanto tenían oportunidad.\n\nSon pequeños problemas, o problemas de uso específicos, pero que se solucionan con un sistema más adaptable que el firmware de fabrica.\n\nPor supuesto, siempre está el riesgo de que el rendimiento no sea el mismo, soy consciente de eso. Pero con las precauciones suficientes, todos estos procesos son reversibles.\n\n---------------------------------------\n\nComo dijiste, esto es para probar, y divertirme. Si logro configurar este router para que sea funcional con OpenWRT, luego podré hacerlo de nuevo con alguno de mayores prestaciones si llega a ser necesario.\n\nObviamente, sé que lo que hice con el pendrive no soluciona ni la mitad de los problemas de hardware que tendré con este aparato.\n\nEsto lo hice por diversión y para aprender.\n\nEl post lo hice para contarles del proyecto a quien no lo supiera, y si hay alguien en una situación similar a la mía, darle un empujón para que pruebe y aprenda.\n\nSuerte!","replies":[{"poster":"iNGENiO","date":"2016-09-22T13:20:49.924+0000","up_votes":1,"down_votes":0,"body":"Me alegro que nos cuentes tus experiencias.","replies":[]}]}]}]}]},{"poster":"SplayFIve64","date":"2016-09-22T12:24:52.675+0000","up_votes":1,"down_votes":0,"body":"Muy entretenido el post solo de mi punto de vista,\ntendría que intentarlo un día. \n\n\n{{sticker:slayer-pantheon-thumbs}}  +1 prrrro","replies":[]},{"poster":"Hilario Navarro","date":"2016-09-22T04:00:04.185+0000","up_votes":1,"down_votes":0,"body":"miren un 100tifiko","replies":[{"poster":"Desaroll","date":"2016-09-22T11:19:09.664+0000","up_votes":1,"down_votes":0,"body":"http://k32.kn3.net/3/6/7/0/B/C/D39.jpg","replies":[]}]},{"poster":"Un Sin Corazón","date":"2016-09-22T02:22:23.417+0000","up_votes":1,"down_votes":0,"body":"No me leí nada y tampoco me interesa. +1","replies":[]},{"poster":"wattefak","date":"2016-09-22T00:29:21.779+0000","up_votes":1,"down_votes":0,"body":"Hay algo que no entiendo, ¿ese router no tiene por defecto la capacidad de controlar el uso de la red o hiciste todo a modo de entretencion/experimento? XD\nPD:Este si es off-topic del bueno, +10 maquinola.","replies":[{"poster":"Desaroll","date":"2016-09-22T00:48:39.017+0000","up_votes":1,"down_votes":0,"body":"Lo segundo xD\n\nAdemás, como programador, el poder habilitarlo de este modo me deja la posibilidad de agregarle las funciones que yo quiera ;-)\n\nSuerte!","replies":[]}]},{"poster":"resnov15","date":"2016-09-21T23:33:43.256+0000","up_votes":1,"down_votes":1,"body":"No lei nada pero igual te dire que te valla bien","replies":[{"poster":"Desaroll","date":"2016-09-21T23:37:19.700+0000","up_votes":1,"down_votes":0,"body":"Perfecto xD\n\n¿Te sirvió la advertencia del inicio? :V\n\nSuerte!","replies":[]}]}]}