{"poster":"Desaroll","date":"2016-06-27T23:08:31.701+0000","title":"[Programa] Medidor de Ping, Herramienta de Tracert. Versión 1.0.","subforum":"Creaciones de la comunidad","up_votes":47,"down_votes":4,"body":"**[31/10/2016]** Código fuente: https://github.com/Desaroll/LoL-Ping-Indicator/tree/master\n**[6/07/2016]** Actualizado a v1.3. Multiserver.\n**[30/06/2016]** Actualizado a v1.2. Cambios a la IU, ajustes al código. ¡Ahora solo 1 lo detecta como virus!\n**[28/06/2016]** Actualizado a v1.1. Cambios menores, listados abajo.\n\nHayo!\n\nAqu&iacute; les traigo un peque&ntilde;o programa que realic&eacute; estos &uacute;ltimos... 4 d&iacute;as, si no perd&iacute; la cuenta en el medio:\n\nUn medidor del retardo de conexi&oacute;n con el servidor de LAS (Y otros servidores!), con una funci&oacute;n para realizar tracert (An&aacute;lisis de Ruta) al servidor.\n\n|Ping bajo|&nbsp;&nbsp;&nbsp;|Ping medio|&nbsp;&nbsp;&nbsp;|Ping elevado\n|-\n|http://imgur.com/nQjjXS8||http://imgur.com/6RudPai||http://imgur.com/S4ORqSC\n\n&iquest;Como funciona?\n\nHabr&aacute;n visto el truco de ejecutar el comando &quot;_ping las.leagueoflegends.com_&quot;, o, si buscaron un poco m&aacute;s, el &quot;_tracert 138.0.12.100_&quot;\n\nEl primero no funciona (No entrar&eacute; en motivos a menos que alguien pregunte), y el segundo en engorroso (Tarda a&ntilde;os y hay que analizarlo).\n\n|&iexcl;Entonces!|Configurando\n|-\n|Program&eacute; este programa, que, tras una configuraci&oacute;n que tarda lo que un solo tracert y que, si todo funciona bien, solo debe hacer una vez, guarda los resultados y los utiliza para dar una aproximaci&oacute;n al ping que tienes ingame.|http://imgur.com/fjSswUY\n\nLuego, abriendo una partida personalizada y ajustando el valor que da al ping que tienen ingame, el programa guardar&aacute; sus valores para, la pr&oacute;xima vez que lo abran, tener el ping aproximado m&aacute;s preciso que puede encontrar, en la posici&oacute;n que quieras, y, &iexcl;Con modo mini!\n\n|Puedes ajustar el valor|&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|&iexcl;Modo mini!\n|-\n|http://imgur.com/Sl3V9Lk||http://imgur.com/WIkQUGt\n\nSi sueles jugar en modo ventana, el programa puede correr a un costado del juego. No lo recomiendo, ya que si le haces click por error no har&aacute;s click en el juego, y puede llegar a estorbar. Adem&aacute;s &iquest;Para que quieres ver el ping con un programa externo cuando ya estas en partida?\n\n-----------------------------------------------------------\n\nAhora bien, quiero dejar un par de cosas en claro:\n\n>#Preguntas frecuentes.\n\n##&iquest;Es seguro descargar esto?\n\nNo, no lo es (Sincericidio). Es un archivo ejecutable, que bien podr&iacute;a ser un virus que rompa tu PC. Solo descargalo si conf&iacute;as en tu antivirus o en m&iacute;. **&iexcl;NUNCA DESCARGUES ARCHIVOS DE INTERNET DE PERSONAS EN LAS QUE NO CONF&Iacute;ES!**\n\nLes dejo el resultado de un an&aacute;lisis de 52 antivirus diferentes:\nhttps://www.virustotal.com/es-ar/file/ec7a66f09b1ecd6ea68ba6b7c268e752f2164c32c83e1cd5190318ec7a47a167/analysis/1467846634/\n\n7 de esos 52 lo detectaron como virus (Heuristico, es decir, comportamiento similar), pero de esos 7, solo o&iacute; hablar del BitDefender. La mayor&iacute;a de los grandes antivirus dicen que est&aacute; limpio.\n\n##&iquest;Es exacto?\n\nLuego de la calibraci&oacute;n, es el mecanismo de aproximaci&oacute;n m&aacute;s exacto que se me ocurri&oacute; despu&eacute;s de abrir el juego. A retardos elevados la precisi&oacute;n se pierde por usar un protocolo de baja prioridad (ICMP, para quien le interese).\n\n##&iquest;Es fiable?\n\nLuego de la calibraci&oacute;n, en la mayor&iacute;a de los casos, s&iacute;.\n\n##&iquest;Puede fallar?\n\nS&iacute;. Es una aproximaci&oacute;n, usando el nodo m&aacute;s lejano. Si algo falla despu&eacute;s de ese nodo, el programa no lo detectar&aacute;. Adem&aacute;s, el programa puede fallar, ya que lo program&eacute; en ratos libres. A un futuro, si Riot mueve los servidores, el programa fallar&aacute;, ya que usa la IP de los servidores actualmente.\n\n##&iquest;Es legal?\n\nS&iacute;. No interact&uacute;a con el juego, ni le importa siquiera si lo tienes instalado. No tengo el visto bueno de ning&uacute;n Rioter, pero no viola las condiciones del servicio, e invito a quien crea que s&iacute; a decirme por qu&eacute;.\n\n##&iquest;En que consiste?\n\nEl programa consta de 4 archivos, un ejecutable, 2 im&aacute;genes, y una fuente para texto. El programa crea 1 archivo extra, m&aacute;s otro si usas la funci&oacute;n de tracert. Recomiendo usar un acceso directo en tu escritorio si lo usar&aacute;s con frecuencia, ya que poner el programa en tu escritorio ser&aacute;n muchos archivos extra all&iacute;.\n\n##&iquest;Como funciona?\n\nVersi&oacute;n corta: Busca el nodo de internet m&aacute;s cercano al servidor de Riot, y usa ese para estimar el retardo. El valor que sumas o restas en la calibraci&oacute;n viene a ser el retardo entre ese nodo y el servidor de Riot.\n\n##&iquest;Funciona?\n\nS&iacute;. Lo vengo usando mientras lo estuve programando, y me ha salvado de algunas subidas de lag bastantes importantes (&iexcl;Gracias, actualizaciones sin avisar de Windows 10! &iexcl;Gracias, gente que viene de visita con celulares con sus aplicaciones no actualizadas!)\n\n##&iquest;Est&aacute; terminado?\n\nNo. Nunca lo estar&aacute;. Ahora lo descargar&aacute;s, lo usar&aacute;s, y probablemente encuentres entre una decena y un millar de errores. Si me lo dicen, lo ir&eacute; corrigiendo, y agregando nuevas funciones a medida que se me ocurran. Por ejemplo, tengo planeado que guarde un registro de cambios de rutas, lo que puede servirte para llamar y quejarte con tu ISP si tu ruta empeora. Tambi&eacute;n agregar&eacute; compatibilidad con otros servidores en futuras versiones.\n\n----------------------------------------------------------------\n\n>#Link de descarga (v1.3):\n\nMega: https://mega.nz/#!icMWEBjQ!BxrKtF-5g-pvDtLA1ZAaRKRqeOOsebwq_VWUVENTwkA\n\nMediafire: http://www.mediafire.com/download/w9vdzd9e4fr3696/Ping_Indicator_v1.3.zip\n\nSi lo usan, agradecer&iacute;a que me digan que opinan de &eacute;l, y si tienen ideas de funciones que se le puedan agregar.\n\n------------------------------------------------------------\n\nCambios en v1.1 (28/06/2016):\n\n- Arreglé un error al pedir varios tracerts sin cerrar el programa.\n- Corregí uno de los mensajes secretos (Shhhh).\n- ¡Ahora con icono! (Busco alguien que haga un reemplazo. En serio.)\n\nCambios en v1.2 (30/06/2016):\n\n- Ahora los botones tienen un cambio al pasar el puntero por encima.\n- Ahora el ajuste se muestra por un tiempo al hacerle un cambio.\n- Arreglé un error con los botones que aún nadie había detectado (Al menos, no lo habían reportado). ¡Ja! Les gané.\n- Arreglé el código. Ustedes no lo ven (Aún), pero ahora es mas legible :D\n\nCambios en v1.2 (30/06/2016):\n\n- Cambié el titulo de la ventana. Al no tener borde y usar Win10 no ví hasta recién que aún tenía el nombre por defecto. GG Desa.\n\nCambios en v1.3 (6/07/2016):\n\n- ¡Multiserver! Ahora no necesita los archivos extra.\n\n------------------------------------------------------------\n\n>#Luego de la descarga.\n\n##1) Configuraci&oacute;n y calibraci&oacute;n.\nLa primera vez que lo abras, el programa har&aacute; una cuenta regresiva de 29 a 0 (No son segundos, algunos los har&aacute; r&aacute;pido, los otros m&aacute;s lentos). Intenta que la red est&eacute; despejada para evitar errores en esta etapa.\n\nCuando termine, abre el juego, inicia una partida personalizada contigo solo, y mira el retardo. Ajusta el numero usando los botones &quot;+&quot; y &quot;-&quot; que aparecen al pasar el mouse sobre el medidor hasta que el valor estable (Donde pasa m&aacute;s tiempo) sea lo m&aacute;s parecido que logres.\n\nLuego de eso, mueve la ventana a donde prefieras que permanezca y activa o desactiva el modo mini usando el bot&oacute;n &quot;=&quot; de arriba a la izquierda. El bot&oacute;n &quot;X&quot;, sobra decir, es para cerrar en cualquier momento.\n\n##2) Uso habitual.\nAl abrir el programa, dale unos 5 segundos antes de tomar el valor como exacto.\n\nLa autoconfiguraci&oacute;n (La cuenta regresiva de 29 a 0) puede activarse en cualquier momento si el programa detecta una perdida de conexi&oacute;n, un cambio de ruta, o un ping muy elevado. Por favor, tengan paciencia en esos momentos. Si ocurre seguido, puede que tengas un problema en tu conexi&oacute;n, o que el programa tenga un problema. Avisame y lo vemos.\n\nNo deber&iacute;a ser necesario que lo calibres seguido. Incluso luego de una autoconfiguraci&oacute;n, el valor de calibrado se conserva. Si luego de una autoconfiguraci&oacute;n el valor queda muy movido, click secundario y &quot;reconfigurar&quot;. A veces toma otro nodo si el usual no respondi&oacute; a tiempo.\n\n##3) Tracert y funciones adicionales.\nLas funciones adicionales se acceden con el bot&oacute;n secundario. Por ahora, las &uacute;nicas funciones adicionales activas son el tracert y la reconfiguraci&oacute;n.\n\nEl tracert ejecuta una reconfiguraci&oacute;n previa, para evitar errores. Cuando termine la reconfiguraci&oacute;n, marcar&aacute; &quot;...&quot; hasta que termine de realizar el tracert.\n\nCuando termine, con el bot&oacute;n secundario podr&aacute;s copiar el tracert o volverlo a ejecutar. Tambi&eacute;n puedes encontrar un archivo &quot;tracert.txt&quot; donde est&eacute; el programa con los resultados del ultimo tracert. Si ese archivo se borra antes de copiar, no podr&aacute;s copiar el resultado.\n\n-----------------------------------------------------------\n\n#&iexcl;Avisame si encuentras un error!\n\nQuiero hacer de esto una herramienta &uacute;til para los jugadores de LAS. Cualquier error que encuentres intentar&eacute; solucionarlo en cuanto tenga tiempo.\n\n-------------------------------------------------------------\n\n#Errores registrados:\n\n- Algunos nodos finales tiran más retardo que el del servidor. Estoy viendo como detectar y corregir estos casos.\n- El tracert copiado al portapapeles trae errores. Pueden usar el archivo tracert.txt mientras busco como arreglarlo.\n\nSuerte!","replies":[{"poster":"The Inkanus","date":"2016-06-29T00:56:37.009+0000","up_votes":2,"down_votes":0,"body":"Excelente aporte!\nUna sugerencia: algún efecto onclick al apretar los botoncitos, porque pasé algún tiempo con la sensación de que apretaba y no sucedía nada (debido a que los números en mi caso bailan demasiado).\n\nSaludos!.","replies":[{"poster":"Desaroll","date":"2016-06-30T18:23:20.432+0000","up_votes":1,"down_votes":0,"body":"Ahí agregué la versión 1.2, con el hover event y un click event al cambiar el ajuste :-)\n\nGracias por la sugerencia!","replies":[{"poster":"The Inkanus","date":"2016-06-30T18:24:17.640+0000","up_votes":2,"down_votes":0,"body":"Probemos!\n\nEdito: ahora si me doy cuenta que mis acciones provocaron alguna reacción, bárbaro!.\nNorma al crear software: el usuario final es un primate con un palo, desarrollar todo a tal punto que hasta él pueda entenderlo/usarlo.\n\nYa que esás en el tema software, y aunque no se si sos de ver series de TV, te recomiendo, porque si no más, la serie Silicon Valley.\nSaludos!.","replies":[]}]},{"poster":"Desaroll","date":"2016-06-29T01:14:43.269+0000","up_votes":2,"down_votes":0,"body":"Mhhh...\n\nSi, buena sugerencia. No se sabe si realmente se presionó cuando lo usas y el numero ya estaba cambiando de antes.\n\nHabía pensado en agregar de cuanto es el ajuste entre los 2 botones, pero lo descarté para no sobrecargar. Probablemente vaya por ese lado. Si desaparece al rato de no hacer ajustes no debería molestar y ayudaría para lo que mencionas.\n\nGracias y suerte!","replies":[]}]},{"poster":"Capitana Beryl","date":"2016-06-29T18:14:36.059+0000","up_votes":2,"down_votes":0,"body":"Muy buena la aplicación, la voy a empezar a tener abierta siempre antes de jugar jaja.\nPor cierto, una buena idea sería agregar un botón de Benchmarks para ver el promedio de tu ping (Aparte de algún efecto de apretado en eventos cómo OnClick que ya sugerió The Inkanus, o también HoverEvent por cada botón), nada realmente importante ni que cambie completamente todo ni su funcionalidad, pero detalles que siempre que están se aprecian.\n\nSaludos{{champion:223}}.","replies":[{"poster":"Desaroll","date":"2016-06-29T18:47:32.708+0000","up_votes":2,"down_votes":0,"body":"Gracias :3\n\nEl HoverEvent lo iba a poner con el mouse de la manito, pero lo descarté al ver que pedía demasiadas lineas de código por poca cosa. Veré de cambiar el fondo al botón cuando se hace un hover, eso sería fácil de implementar.\n\nEl benchmark es una buena idea. Veré que hago al respecto. Pero, como es una función que solo algunos usarán, no la prometeré pronto xD\n\nSuerte!","replies":[{"poster":"Capitana Beryl","date":"2016-06-29T19:16:57.436+0000","up_votes":1,"down_votes":0,"body":"Jaja ¡No hay de qué! ^-^\nY ciertamente sería una herramienta usada raramente y por un grupo casi cerrado de personas, pero creo que es lo suficientemente útil para que no sea un desperdicio de espacio/líneas.\n\nDe todas maneras, la estaré esperando con ánsias (Aunque sepa que tardará).\n\nGracias por responder, saludos y mucha suerte ^^","replies":[{"poster":"Desaroll","date":"2016-06-30T18:22:58.476+0000","up_votes":2,"down_votes":0,"body":"Ahí agregué la versión 1.2, con el hover event y un click event al cambiar el ajuste :-)\n\nGracias por la sugerencia!\n\nPD: El benchmark lo agregaré junto a otras funciones más \"avanzadas\" en la 2.0. No hay fecha, pero para esa versión haré un post nuevo.\n\nSuerte!","replies":[{"poster":"Capitana Beryl","date":"2016-06-30T20:36:02.883+0000","up_votes":1,"down_votes":0,"body":":D Ya me pongo a descargarlo y no, gracias a vos por dedicar tu tiempo a ayudar y leer sugerencias.\n\nSaludos {{champion:223}}. ^-^","replies":[]}]}]}]}]},{"poster":"Ryu NoCaretas","date":"2016-06-29T11:57:06.247+0000","up_votes":2,"down_votes":0,"body":"Inicie sesión por primera vez en el foro , y es el primer post que voy a comentar desde que juego league of legends *season 3 * , toma tu +1 ojala este post haga eco en todos lados ya que somos muchos los que necesitamos saber nuestro ping sin tener que entrar a una partida personalizada .\n\npd: entiendo tu frustracion por esos \" invitados que no tienen sus aplicaciones actualizadas \" jaaja saludos y bien hecho ! {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Desaroll","date":"2016-06-29T12:30:32.814+0000","up_votes":1,"down_votes":0,"body":"Un honor tener tu primer mensaje, veterano de muchas temporadas :-)\n\nMe alegro que te hay sido útil :3\n\nY si, a esos invitados habría que echarlos. El LoL es más importante (?\n\nSuerte!","replies":[]}]},{"poster":"Walter Kannemann","date":"2016-06-28T21:46:16.632+0000","up_votes":2,"down_votes":0,"body":"lo probe recien y en el juego tengo 3 ms mas que en el medidor, muy bueno ahorra el tiempo de esperar el tracert xd","replies":[{"poster":"Desaroll","date":"2016-06-28T21:47:54.497+0000","up_votes":1,"down_votes":0,"body":":3\n\nRecuerda ajustar el valor para que te indique el mismo ;-)\n\nLa idea precisamente es esa, acelerar el tracert haciendo solo la parte que nos importa (El retardo, no la ruta).\n\nSuerte!","replies":[]}]},{"poster":"Garenhotsister","date":"2016-06-28T02:45:20.461+0000","up_votes":1,"down_votes":2,"body":"lastima que lo subiste a mega","replies":[{"poster":"Desaroll","date":"2016-06-28T13:17:40.945+0000","up_votes":2,"down_votes":1,"body":"Todos los servidores tienen algún problema. Mega es el que mejor me ha funcionado en mi experiencia.\n\n¿Cual recomiendas?\n\nSuerte!","replies":[{"poster":"Garenhotsister","date":"2016-06-28T16:44:39.826+0000","up_votes":1,"down_votes":0,"body":"bien pero sabes que esta el problema que no te deja descargar, ya se que se puede cambiando la ip etc, en fin podrias poner un mirror en dropbox, mediafire, googledrive etc xD","replies":[{"poster":"Desaroll","date":"2016-06-28T16:52:29.301+0000","up_votes":2,"down_votes":0,"body":"Cierto que Mega tiene ese limite. Como usualmente lo uso para archivos pequeños solo una vez lo alcancé xD\n\nAhí lo subí a Mediafire, y agregué el link en el post principal.\n\nhttp://www.mediafire.com/download/v0vww745e6zf2zj/Ping_Indicator_v1.0.zip\n\nSuerte!","replies":[{"poster":"Garenhotsister","date":"2016-06-28T18:41:46.732+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]},{"poster":"LDarkKnight","date":"2016-06-28T03:46:27.150+0000","up_votes":2,"down_votes":0,"body":"Toma tu +1 buen hombre\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"PentakiII","date":"2016-06-28T03:21:39.182+0000","up_votes":2,"down_votes":0,"body":"Muchisimas gracias!","replies":[]},{"poster":"Shappaw","date":"2016-06-28T00:53:30.933+0000","up_votes":2,"down_votes":0,"body":"Che, Desa, por el momento está funcionando bien, normal. Ingame tengo 43ms-49ms y el PingND calibrado oscila entre 39ms y 46ms. Creo que está dando buenos frutos y es sólo el inicio.","replies":[]},{"poster":"Nombre ofensivo","date":"2016-06-27T23:29:13.336+0000","up_votes":2,"down_votes":0,"body":"en que lo programaste?","replies":[{"poster":"Desaroll","date":"2016-06-27T23:30:40.452+0000","up_votes":2,"down_votes":0,"body":"C++.\n\nUsé SFML para la parte gráfica, WinApi para varias otras cosas, y luego standard C++.\n\nSi no encuentran errores mayores creo que subiré el código a GitHub.\n\nSuerte!","replies":[{"poster":"Nombre ofensivo","date":"2016-06-27T23:34:18.945+0000","up_votes":1,"down_votes":0,"body":"estoy viendo ahora que me marca menos latencia que la de verdad tengo ingame\n\nde 37-40ms in game el programa marca 27-33","replies":[{"poster":"Desaroll","date":"2016-06-27T23:36:38.466+0000","up_votes":1,"down_votes":0,"body":"Usualmente marca menos, ya que el ultimo nodo no responde.\n\nPor eso se le hace la calibración manual luego de la autoconfiguración (Parte 1 de \"Luego de la descarga\")\n\nSolo 1 vez, y ya queda guardado.\n\nUsa los \"+\" y \"-\" de abajo, hasta que dé el mismo valor aproximado.\n\nEs algo necesario, ya que no todos los nodos responden las peticiones, así que me quedo con el más lejano que responda, que está más cerca que el servidor.\n\nPor eso, la diferencia (El ping entre ese nodo y el server) la agrega el usuario manualmente.\n\nPD: Yo juego con 76 constantes T_T GG Arnet y su vuelta por Brasil","replies":[{"poster":"GatóMonstruo","date":"2016-06-28T00:33:27.802+0000","up_votes":1,"down_votes":0,"body":"El último nodo no responde por cuestiones obvias. Me parece maravilloso que le hayas agregado esa opción del ajuste manual.","replies":[{"poster":"Desaroll","date":"2016-06-28T00:52:33.635+0000","up_votes":2,"down_votes":0,"body":"Ni te cuento lo útil que fue para las imágenes :V\n\nMi ping no baja de 70, no podría haber tomado las imágenes verdes sin esa función T_T\n\nJAJAJAJA\n\njaja\n\nja\n\nhttps://imgflip.com/readImage?iid=9863151","replies":[]}]}]}]}]}]},{"poster":"1221","date":"2016-06-28T00:21:09.577+0000","up_votes":2,"down_votes":0,"body":"Después lo pruebo, genial m3n honor y  +1 y te cuento los resultados","replies":[]},{"poster":"GatóMonstruo","date":"2016-06-27T23:19:49.531+0000","up_votes":2,"down_votes":0,"body":"¡Fantástico Desa!  \nEn cuanto pueda le voy a probar a ver qué tal está. Me encantó la iniciativa. Enhorabuena.","replies":[]},{"poster":"lNexusl","date":"2016-07-30T20:38:04.718+0000","up_votes":1,"down_votes":0,"body":"No se si sea mucho pedir , pero podrías pasarme el código o porlomenos que lenguaje usaste.\n\nGracias.{{summoner:2}}","replies":[{"poster":"Desaroll","date":"2016-08-19T13:58:36.063+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Desaroll,realm=LAS,application-id=J0mxKtkB,discussion-id=aXO8xApf,comment-id=00020000,timestamp=2016-06-27T23:30:40.452+0000)\n>\n> C++.\n> \n> Usé SFML para la parte gráfica, WinApi para varias otras cosas, y luego standard C++.\n> \n> Si no encuentran errores mayores creo que subiré el código a GitHub.\n> \n> Suerte!\n\nVeré de subir el código uno de estos días ;-)\n\nSuerte!","replies":[{"poster":"sonof666","date":"2017-08-22T02:00:23.767+0000","up_votes":1,"down_votes":0,"body":"Gracias, me bajo el código para compilar.","replies":[{"poster":"Desaroll","date":"2017-08-22T02:21:39.189+0000","up_votes":1,"down_votes":0,"body":"Cierto, olvidé de avisarte que lo había subido :c\n\nLo siento, pero al menos lo tienes ;-)\n\nSuerte!","replies":[]}]}]}]},{"poster":"Seven Teemo Army","date":"2016-06-28T01:44:39.075+0000","up_votes":1,"down_votes":1,"body":"Bueno tu programa pero le falta un icono bien shidorri :v \n\nPD: parece que sabes de redes, asi que te vengo con una duda, cuando intento usar el programa Netcut me pide elejir un adaptador de red y no me aparece nada para elejir, y si le doy a cancelar no me aparece la lista de macs, ¿Es mi placa de red o un bug del programa?\nPD 2: El icono de WiFi me aparece como si no estuviese conectado a internet, creo que tiene algo que ver con lo de arriba.","replies":[{"poster":"Aioria99","date":"2016-06-28T15:03:42.619+0000","up_votes":1,"down_votes":0,"body":"Tienes que dar a \"Choice NetCard\" Y ahi te aparecera :'v\n\nSalu2","replies":[{"poster":"Seven Teemo Army","date":"2016-06-28T15:27:17.477+0000","up_votes":1,"down_votes":0,"body":"Ese es el problema, donde debería aparecer mi placa de red no hay nada :/","replies":[{"poster":"Aioria99","date":"2016-07-18T00:01:31.069+0000","up_votes":1,"down_votes":0,"body":"Ya lo solucionaste? \n\n-Saludos{{champion:103}} {{champion:55}} {{champion:64}}","replies":[{"poster":"Seven Teemo Army","date":"2016-07-19T22:41:46.406+0000","up_votes":1,"down_votes":0,"body":"No :/","replies":[{"poster":"Aioria99","date":"2016-07-20T15:19:15.584+0000","up_votes":1,"down_votes":0,"body":"Prueba lo siguiente :v\n\nDesactiva el que dice \"Protect My computer\" Luego Clickeas en Refresh net, Y por ultimo Scan net\n\nEspero que te sirva :v\n\n-Saludos{{champion:103}} {{champion:64}} {{champion:55}}","replies":[{"poster":"Seven Teemo Army","date":"2016-07-20T22:01:24.583+0000","up_votes":1,"down_votes":0,"body":"Bien, ahora tengo que esperar a tener internet en mi PC para instalar el programillo","replies":[]}]}]}]},{"poster":"Aioria99","date":"2016-07-18T00:00:59.420+0000","up_votes":1,"down_votes":0,"body":"Ya lo solucionaste? \n\n-Saludos{{champion:103}} {{champion:55}} {{champion:64}}","replies":[]},{"poster":"Aioria99","date":"2016-06-29T00:33:14.640+0000","up_votes":1,"down_votes":0,"body":"Lo habia solucionado, solo que olvide como :v \n\nEntrando en choice netcard, apagar el router, encenderlo nuevamente y ahi se supone que tiene que aparecer. \n\nSalu2...","replies":[]}]}]}]},{"poster":"ELDRIFTING","date":"2016-06-28T15:40:47.842+0000","up_votes":1,"down_votes":0,"body":"Me parece muy atento de tu parte crear algo así, pero soy noob en eso de redes, si me pudieras explicar mejor como usarlo te lo agradeceria, cuando lo abrí me salio 260ms, en al programa al parecer funciona, es algo parecido al ping que tengo que son 246ms te preguntaras como juegas con ese lag xD ya me acostumbre","replies":[{"poster":"Desaroll","date":"2016-06-28T16:47:52.464+0000","up_votes":1,"down_votes":0,"body":"Hayo!\n\nSi cuando lo abres te indica algo muy similar a tu ping habitual, puedes ajustarlo con los \"+\" y \"-\" que aparecen debajo. Pero si es muy alto es menos preciso.\n\nDe todas formas, 260 es mucho.\n\n¿Podrías hacer click secundario en el programa, poner \"Preparar Tracert\" y luego cuando termine (Cuando vuelva a aparecer el ping) click secundario, \"Copiar Tracert\", y luego pegarlo aquí?\n\nEs raro tanto retardo.\n\nSuerte!","replies":[{"poster":"ELDRIFTING","date":"2016-06-28T17:01:00.925+0000","up_votes":1,"down_votes":0,"body":"Tengo ese ping por ser de Perú, debería jugar en LAN, pero juego aquí porque todos mis amigos juegan en este servidor.","replies":[{"poster":"Sonya Kyron","date":"2016-06-28T18:41:34.304+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"ELDRIFTING","date":"2016-07-17T17:15:30.467+0000","up_votes":1,"down_votes":0,"body":"en LAN tengo 94 ms, en LAS es el problema, y lo que me importa mas porque todos mis amigos juegas ahí, juego con 273 ms, aveces baja a 246 ms en LAS, es molesto jugar así e puesto varios post, pero Riot no les presta atención, y Claro es el internet mas decente aca en Perú, porque Movistar es un asco total.","replies":[{"poster":"Sonya Kyron","date":"2016-07-17T19:53:15.957+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"ELDRIFTING","date":"2016-07-17T20:00:06.008+0000","up_votes":1,"down_votes":0,"body":"¿Como harías para bajarlo?","replies":[]}]}]}]},{"poster":"Desaroll","date":"2016-06-28T17:03:50.850+0000","up_votes":1,"down_votes":0,"body":"Ah, ok, ok.\n\nhttp://statics.vrutal.com/hm/2014/09/VRU_20509_la_importancia_del_lag.jpg\n\nPonte orgulloso de poder jugar con ese lag ;-)\n\nSuerte!","replies":[]}]}]}]}]}