{"poster":"dNiW","date":"2016-12-26T14:57:24.620+0000","title":"Was tun in der Laningphase (Toplane)","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Hallo Leute,\r\n\r\nIch spiele total gerne {{champion:39}} \r\nVorweg ich bin Durchschnitt/unterm Durchschnitt was Skill und sonstiges angeht. also geht von einem schlechten Spieler aus\r\nder keine Profihaften Aktionen hinkriegt ;D\r\n\r\nIch habe mit Irelia gro&szlig;e Probleme gegen die Early&quot;Noob&quot; Picks in der Lowelo.\r\n\r\nGegen z.B. {{champion:92}}  oder {{champion:75}}  klappt es besser\r\n\r\nAber gegen {{champion:122}} /{{champion:80}} ... all diese Earlyhelden die im Late abfallen kann ich **nicht** einfach nur\r\nTrades vermeiden und warten das die Lane reingepusht wird damit ich entspannt unter dem Tower farme.\r\nIch hatte letztes Mal einen Gegenspieler, der fr&uuml;h angefangen hat die Lane zu freezen und somit konnte ich mich entscheiden\r\nFarmen und Trade verlieren oder Nicht farmen und Itemnachteil.\r\nWas tut Ihr mit Irelia gegen Darius, **wenn** er die Lane freezt um euch ganz aus der Lane zu dr&auml;ngen?\r\n\r\ndas Spiel ist dadurch verloren gegangen, dass der Darius viel Farmvorteil hatte und ich durch meinen miserablen Farm viel zu lange\r\nauf mein Starkes Midgame warten musste.Sobald er auf der Lane war konnte ich nicht einen Creep bekommen durch Dauerfreeze an seinem\r\nTower.\r\n\r\nAktuell banne ich Darius immer aber das ist doch keine L&ouml;sung!\r\nSollte ich unabh&auml;ngig von diesem Dariusbeispiel am Besten nie mit Irelia vor Level 4 traden?\r\n\r\nBitte um Hilfe, m&ouml;chte gegen jeden Gegner spielen egal ob Counter oder nicht","replies":[{"poster":"Ireliα","date":"2016-12-26T15:40:25.574+0000","up_votes":2,"down_votes":0,"body":"Ich habe gerade nicht viel Zeit, du kannst mich aber gerne adden und wir reden über TS oder ingame. Ansonsten kannst du [hier](http://www.replay.gg/search/euw/Ireli%CE%B1) mein Replay.gg mal durchgehen. Die Niederlage in der ich 5/2/1 stand war gegen einen Darius. Wenn ich das richtig im Kopf habe war meine Laningphase ganz gut.\n\nAnsonsten hast du es schon richtig erkannt, vor Level 4 macht man erstmal gar nichts. Man kann ihn nur zu Q's provozieren. Damit pusht der die Lane und du kannst save unter dem Tower farmen. Ansonsten benutzen viele Darius Spieler ihr Q regelmäßig um die Lane zu pushen, nach Level 4 kann man darauf reagieren und das All-In suchen. Wichtig ist vor allem, dass du selber dein Q aufbewahrst um an ihn heranzuspringen wenn er seins macht. \n\nIch werde mich später nochmal melden wenn nicht andere schon alles wichtige erwähnen :)","replies":[{"poster":"dNiW","date":"2016-12-26T23:33:30.208+0000","up_votes":1,"down_votes":0,"body":"Wow das Dokument mit groben Richtlinien ist enorm!\nVielen Dank , dass ist für Mich der absolute Hammer+","replies":[]}]},{"poster":"0815xand0r","date":"2016-12-26T18:25:41.502+0000","up_votes":1,"down_votes":0,"body":"> Aktuell banne ich Darius immer aber das ist doch keine Lösung!\n\nSolange du nicht anders gegen ihn klarkommst, ist das durchaus eine sehr sinnvolle Lösung. Immerhin musst du im Zweifel auf der Toplane gegen ihn spielen, was deinem Team vermutlich mehr Nachteile bringt, als einen anderen Champion zu bannen.\n\nAnsonsten hilft nur Übung und Erfahrung. Man muss halt die Matchups erstmal wirklich kennenlernen und sich dann auch daran erinnern. Ich habe mir bspw. für die neue Season ein Spreadsheet angelegt, in dem ich alle Spiele eintrage, mit allen wichtigen Daten (bin ein kleiner Statistiken-Fan ^^) und auch ein Spalte, in welcher ich vor allem die Laningphase reflektiere. Dabei muss man aber auch ehrlich zu sich selbst sein (also nicht einfach \"Meh, wurde gecampt, unser Jungler war Müll\" oder so). Dadurch wird einem manchmal etwas klarer, warum man die Lane bspw. verloren hat, und was man evtl. dagegen tun kann.\n\nWenn der Darius bspw. die Lane freezt, musst du schauen, wie du den Freeze auflösen kannst. Hast du deinen Stun gemax't, dann kannst du zum Beispiel mit Q engagen, warten, bis seine Q-Animation anfängt, ihn stunnen und dann weglaufen oder weg Q'n. Dadurch pusht er die Lane. Versuche also sein Q zu baiten, du bist deutlich mobiler als Darius und hast den Stun und eigtl. auch mehr Sustain.","replies":[{"poster":"dNiW","date":"2016-12-26T23:28:20.294+0000","up_votes":1,"down_votes":0,"body":"Danke für Deine hilfreiche Ergänzung =)\nWerde ich im nächstenMatchup auch ausprobieren+","replies":[]}]},{"poster":"Ireliα","date":"2016-12-26T20:17:35.158+0000","up_votes":1,"down_votes":0,"body":"Ich nochmal :)\n\n> Was tut Ihr mit Irelia gegen Darius, wenn er die Lane freezt um euch ganz aus der Lane zu drängen?\n\nEr kann das im richtigen Early nicht machen. Dafür sind die Minions zu stark. Wenn er einen richtigen Freeze auf Level 2 o.ä. probiert kannst du einen kurzen Trade mit ihm eingehen. Obwohl du an sich schwächer bist sollten die Minions dafür sorgen, dass du den Trade gewinnst.\n\n> Sobald er auf der Lane war konnte ich nicht einen Creep bekommen durch Dauerfreeze an seinem\nTower.\n\nWenn er schon einen Vorteil hat wird es richtig ätzend. Ich kann dir nur empfehlen deine Grenzen genau auszutesten und zu lernen wie groß die Minion Wave sein muss damit du trotzdem fighten kannst. So wirst du ein paar mal öfter sterben aber das ist Lehrgeld. Wenn gar nichts mehr geht musst du über den Roam und Jungle Camps gehen.\n\nDieser [Link](https://docs.google.com/spreadsheets/d/1xHx9PdVNwk4KFr7GNwCyc5EDxKxMDoYolsmcwH_eULM/edit#gid=0) beinhaltet eine kurze Beschreibung für jedes Match up. Ein Blick lohnt sich auf jeden Fall.","replies":[{"poster":"dNiW","date":"2016-12-26T23:27:42.571+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank das Du mir das genauer erklärt hast=)\nIrelia ist wirklich abhängig von Erfahrung und Entscheidungen, wenn es klappt wird es belohnt+\nIch werde mir Dein profil weiter angucken, dass sind gute Tipps und Tricks","replies":[]}]}]}