{"poster":"ScissorMyTibbers","date":"2016-04-05T20:22:44.527+0000","title":"Curious about Point and Click abilities","subforum":"Gameplay","up_votes":2,"down_votes":2,"body":"Just something I thought of after seeing the new Taric rework. While I think that being outplayed by a point and click stun or ability can be annoying, at the same time its nice to have that in the game as some diversity. Just off the top of my head I think of some of the past re-works, see Ryze&#039;s Q, Sion&#039;s E, Taric E that got rid of them. \r\n\r\nA lot of the new champs don&#039;t really have them either. A Sol, Ekko (yes the 2nd half of his E but that essentially an empowered auto), Illaoi, Kindred, Bard. I guess Tahm and Jihn do have them but both of those abilities wouldn&#039;t really make sense as skill shots (Jihn&#039;s grenade and Tahm&#039;s W). \r\n\r\nAgain not that I&#039;m really complaining, more just making an observation, but at the same time I don&#039;t want to see every champion be all skill shots, just nice to have different styles to play/play against. \r\n\r\nJust a thought, let me know what you all think. Have a great day!","replies":[{"poster":"Hullabaloo907","date":"2016-04-05T20:45:52.511+0000","up_votes":1,"down_votes":0,"body":"I think point and click cc has a place  on champs who specialize in locking  enemies down. Think Lulu, nautlis, and maokai.  Taric never really specialized in locking people down, since he only had one form of cc","replies":[{"poster":"Droogzy","date":"2016-04-05T20:52:45.852+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hullabaloo907,realm=NA,application-id=3ErqAdtq,discussion-id=a04y6acN,comment-id=0000,timestamp=2016-04-05T20:45:52.511+0000)\n>\n> I think point and click cc has a place  on champs who specialize in locking  enemies down. Think Lulu, nautlis, and maokai.  Taric never really specialized in locking people down, since he only had one form of cc\n\nWhen he got maxed CDR with his passive and proper usage actually yeah, he could keep you near perma-stunned, a good Taric could keep you locked down better than a good Maokai or Lulu could. I've seen it. \n\nRework looks good, but I'm a little disappointed they removed the targeted stun in this age of mobility creep. That being said, its clear they compensated for the loss of targeted stun, put Bastion (W) on another champion and you got two stun skill shots to work with. Overall his kit look pretty cool. ","replies":[{"poster":"Hullabaloo907","date":"2016-04-05T21:42:43.767+0000","up_votes":1,"down_votes":0,"body":"In theory, yes. In practice, this required you to have max ranked e and maxed CDR, and start in melee range so you don't miss and time getting your passive procs off.  Maokai, naut and Lulu can chain their cc much more effictivlely in practice, allowing them to reliable lock up champs for 3 to 5 seconds.","replies":[]}]}]},{"poster":"Viperjcs1985","date":"2016-04-05T20:49:54.796+0000","up_votes":1,"down_votes":0,"body":"On the other hand, didn't his old stun only hit one target?  New one seems to hit multiple.  His skill cap went up but he gained added benefit accordingly.","replies":[]}]}