{"poster":"E5 RGS","date":"2015-06-01T17:53:16.185+0000","title":"[Gold/Plat] Teamranked Clan sucht Member! Serious Ranked! Couching! Feste Trainingszeiten!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\r\n\r\nich baue zurzeit einen neuen Clan. Mit diesem wollen wir 2 Teams aufbauen. Beide Teams sollten auf gleicher Elo sein. Wir werden mit den 2 Teams auch Scrims gegeneinander spielen, daher gleiche Elo, um mal neue Combos und Picks zu versuchen, oder Champions die meistens gebannt sind.\r\n\r\nWir werden eine WhatsApp Gruppe gr&uuml;nden, bzw. habe diese schon. Es wird feste Trainingszeiten geben so wie einen Couch der uns begleiten wird.\r\nBitte schreibt ein Kommentar mit folgenden Angaben:\r\n\r\nEure Lane schreiben\r\nAlter (mind. 16+):\r\nElo (mind. Gold 2+):\r\nGeistliche Reife\r\nP&uuml;nktlichkeit f&uuml;r 2-3 mal die Woche feste Trainingszeiten\r\nTS3\r\nFunktionierendes Headset\r\nGutes Mikro (kein Rauschen oder Hintergrundger&auml;usche)\r\n\r\nSpezifische Champions f&uuml;r die Lanes:\r\nTop: Maokai, Rumble, Gnar, Sion; Keine SoloQ Champions wie Riven!\r\nJungle: Rek Sai, Sejuani, Gragas, Nunu; Keine SoloQ Champions wie Master Yi, Shaco!\r\nMid: Orianna, Azir, Ahri, Ekko, Xerath, Le Blanc; Keine SoloQ Champions wie Yasuo, Zed! AP orientiert!\r\nADC: Jinx, Kallista, Sivir, Urgot; Keine Caitlyn, Miss Fortune, Vayne!\r\nSupport: Thresh, Leona, Janna, Nami;\r\nSonstige Meta Champions sind gerne gesehen! Sollten aber die Voraussetzungen erf&uuml;llen.\r\n\r\nUnsere Ziele des Teams sind folgende:\r\n\r\nWir werden regelm&auml;&szlig;ige Trainingszeiten haben um uns zu verbessern und sp&auml;ter auch an Turnieren teilzunehmen. Das Ziel f&uuml;r dieses Team w&auml;re ca. GOLD 3-2 im Team Ranked zu erreichen.\r\nDas wichtigste allerdings ist, das ihr leidenschaftliche Feeder seit!\r\n\r\nSobald genug Leute beisammen sind, werden wir mehrere Tryouts mit allen machen, auch verschiedene Teams. Dementsprechend werdet ihr dann eingeteilt ob ihr in Team 1 oder 2 spielt.\r\n\r\nWICHTIG: Wir nehmen keine adds InGame an! Schreibt ein Kommentar und wenn wir Interesse haben, adden wir euch!\r\n\r\nMfG\r\n\r\n(Leiter von Clan und Team 1) Rachiniho,(Leiter von Team 2) Unh0lyRush","replies":[{"poster":"TheW1tcher","date":"2015-06-02T11:35:43.995+0000","up_votes":1,"down_votes":0,"body":"Hallo Zusammen, \n\nAlso main lane ist mid \nbin 20 Jahre alt ( und am studieren heißt in klausur phasen kann vllt nicht immer )\nElo mäßig bin ich gold3  ( aber in der promo zu gold2 )\nTS3 sowie headset sind vorhanden \n\n\nMid Lane: Kennen(main), ori, ahri, Brand, diana, Akali . (alle champs müssen natürlich verbessert werden, denn man kann immer was lernen. und weitere champs können nach bedarf auch noch recht schnell trainiert werden)\n\nTop lane : Maokai (Riven will ich wieder anfang zu trainieren)\n\njungle: - (aber wenn es sein muss dann kann ich mit lee auch jungle gehen bzw andere champs aneignen )\n\nadc - (nicht meine lane aber uach hier wenn es sein muss jinx oder lucian)\n\nSupport: blitz, thresh (auch hier wie bei den anderen auch hier kann man sich noch verbessern)\n\n\nAlso meiner Meinung nach kann man sich immer veberssern. Würde mich freuen wenn ich eine antwort bekomme \n\nMit freundlichen Grüßen \n\nTheW1tcher","replies":[]},{"poster":"Untitlêd","date":"2015-06-02T04:03:11.668+0000","up_votes":1,"down_votes":0,"body":"Wie bitte!??!?!?!? Kein yasuo oder zed? Als ob yasuo nur für die soloQ da ist !-.-","replies":[{"poster":"E5 RGS","date":"2015-06-02T10:23:13.248+0000","up_votes":1,"down_votes":0,"body":"Es geht darum das Yasuo und Zed AD Assasinen sind. Bei dem was wir spielen werden, wird ein AP Mid benötigt, daher kein Yasuo oder Zed. Ich hatte schon viele die nur Yasuo und Zed, aber keine AP Assasine konnten.","replies":[]}]},{"poster":"BraindeadMates","date":"2015-06-02T07:51:34.289+0000","up_votes":1,"down_votes":0,"body":"Grüße. \n\nZunächst erstmal zu meiner Person : Ich bin 29 Jahre alt, habre recht viel Freizeit, wie mein Alter schon zeigt, bin ich ein sehr vernünftiger Typ der sowie konstruktive Kritik austeilen aber auch einstecken kann. Der Ton macht die Musik. \n\nZu meiner Elo : Ich bin Silber 4...warum ? ... ganz einfach wenn man ständig Leute hat die einen Mundo in den Fokus nehmen nur weil er prozentual weniger Leben hat, kann man schlecht als Tank im Jungle allein carrien. Dazu kommt noch die Qualität der ADC`s,die zu 80 % noch schlechter als ich sind,was nahezu unmöglich sein sollte. Näher möchte ich das nicht vertiefen, sonst stehen hier gleich 3000 Wörter zu dem Thema.\n\nMainlane : Definitiv Jungle...habe mittlerweile über 300 Spiele im Jungle in Solo/Duo diese Season hinter mir. \nAlternativ kann man mich auch ohne Bedenken in die Mitte stellen. Mache dort meist eine sehr gute Figur.\nSupport und Toplane ist möglich,wobei ich das nicht so gerne spiele. \nZudem bin ich der schlechteste ADC der WELT ;)\n\nChampionspool : \n\nJungle : Zac, Amumu, Sejuani, Malphite, Gragas, Warwick (Reihenfolge chronologisch)\n\nMitte : Brand, Orianna, Syndra, Anivia, Malzahar (nur gegen AD) (Reihenfolge chronologisch)\n\nSupport : Sona, Nami, Lulu, Maokai, Taric\n\nToplane : Renekton, Gragas\n\nADC : könnt ihr alleine spielen !!! :)\n\nDas sollte es erstmal gewesen sein.\n\nLG Davi85","replies":[]},{"poster":"Seimei","date":"2015-06-01T20:56:30.468+0000","up_votes":1,"down_votes":0,"body":"Gute Tag bin Main AdCarry Plat5 momentan (S4 Plat2) Habe schon viel Erfahrung da ich in einem high Plat team mitgespielt habe. Kann alle AdCarrys aber Favorit ist Vayne :>\n\nMfG Seimei","replies":[]}]}