{"poster":"StillYasuoMain","date":"2016-03-02T02:50:38.085+0000","title":"Chell der vierdimensionale Scharfschütze(letzte Überarbeitung)","subforum":"Skin- & Champion-Konzepte","up_votes":6,"down_votes":4,"body":"Hallo Community\n\nZum letzten mal schlage ich den Champion Chell der vierdimensionale Scharfsch&uuml;tze vor. Doch diesmal mit einem komplexen und gebalanctem Kit, Geschichte, Taunts, Stattisken und Attribute:\n\nChell der vierdimensionale Scharfsch&uuml;tze\n\n**Attribute:**\n\nSchaden: |||||||||||||||||||||\nLeben....: ||||||\nMagie....: |||||||||||||\nDifficult.: |||||||||||||||||||||||||\n\n**Statisken**\n\nLeben: 553(+66)\nMana: 390(+39)\nAngriffschaden: 53(+2.5)\nAngriffstempo: 0.612(+2.3%)\nLauftempo: 330\nLebensregen.: 6.45(+0.53)\nManaregen.: 8.12(+0.63)\nR&uuml;stung: 20.6(+3.6)\nMagieresistenz: 30(+0)\n\n**Passiv: Pr&auml;zision**\n\nJe weiter Ziele von Shell entfernt sind, desto mehr Schaden verursacht er mit normalen Angriffen. \nChell hat zus&auml;tzlich eine spezielle Skalierung:\n30% Seines Angriffstempos wird in Schaden umgewandelt.\n20% Seines Lauftempos wird in F&auml;higkeitsst&auml;rke umgewandelt.\n\n**Q: Granate**\n\nChell wirft eine Granate, welche Schaden in einem Bereich verursacht und getroffene Gegner aufdeckt. Trifft die Granate einen gegnerischen Champion, kann Chell einen Schuss in eine Richtung abfeuern, welcher Schaden verursacht und den ersten getroffenen Gegner verlangsamt. Falls der Schuss ein aufgedeckter Gegner trifft, wird die Abklingzeit von Granate um 50% verringert.\n\nDie Granate kann auch durch Portale geworfen werden.\n\nGranate:\nSchaden: 30/45/60/70/85\nFl&auml;che(Radius): 135 Einheiten\nReichweite: 870 Einheiten\nKosten: 40 Mana\nAbklingzeit: 10/9/8/7/6 Sekunden\nCasting: 1 Sekunde\n\nSchuss: \nSchaden: 65/70/80/105/120\nReichweite: 915 Einheiten\nVerlangsamung: 20\\25/25/30/40%\nCasting: 0.5 Sekunden\n\n**W: Vierte Dimension**\n\nDeaktiviert: Chells normale Angriffe durch Portale verursachen zusätzlichen Schaden. Gegner können durch Portale gehen werden danach aber verlangsamt. Jeder Gegner kann innerhalb von 10 Sekunden nur einmal durch ein Portal gehen.\n\nAktiv: Chell kann nicht mehr durch Portale schiessen. Chell und seine Verb&uuml;ndete k&ouml;nnen durch Portale gehen. Falls Chell oder ein Verb&uuml;ndeter durch ein Portal geht, erh&auml;lt er f&uuml;r kurze Zeit zus&auml;tzliches Lauftempo. Jeder Verbündete kann nur einmal jede 10 Sekunden durch ein Portal gehen.\n\nBonusschaden: 20/34/56/70/85\nVerringerten Schaden: 20%\nLauftempo: 10/12/14/20/25%\nVerlangsamung: 10/12/14/20/25%\nKosten: 90 Mana\nAbklingzeit: 15/12/10/8/7 Sekunden\nCasting: 2 Sekunden(bleibt kurz im Portal)\n\n**E: Portal**\n\nPassiv: Chell kann falls er innerhalb eines bestimmten Teils seiner Grundangriffsreichweite in der Nähe eines Portals befindet auf Gegner innerhalb der gleichen Reichweite des anderen Portals schiessen.(löst passive aus)\n\nAktiv: Chell &ouml;ffnet ein Portal an einem Ort, welches magischen Schaden in einem Bereich verursacht und getroffene Gegner verstummt. Es k&ouml;nnen maximal 2 ge&ouml;ffnet sein und falls Chell sich zu weit entfernt wird es automatisch geschlossen.\n\nTeil von Grundangriffsreichweite: 20/30/40/50/60%\nSchaden: 10/14/18/20/30\nVerstummen: 2 Sekunden\nFl&auml;che(Radius): 120 Einheiten\nReichweite: 650 Einheiten\nAbstandgrenze: 1850 Einheiten\nKosten: 80/90/100/110/120 Mana\nAbklingzeit Ladung 1-2: 8 Sekunden \nAbklingzeit 0-1: 15 Sekunden\n\nCasting: 2 Sekunden\n\n**R: Spezialanzug**\n\nPassiv: F&uuml;r jeden an gegnerischen Champions verursachten Schaden erh&auml;lt Chell eine Ladung. Falls er einem gegnerischen Champion Schaden verursacht hat und dieser innerhalb von 3 Sekunden stirbt, wird Spezialanzug aktiviert.\n\nSpezialanzug: Chell wird f&uuml;r kurze Zeit unsichtbar. Sein n&auml;chster normaler Angriff verursacht extrem hohen Schaden, der von den Ladungen abh&auml;ngig ist und deckt Chell auf, falls er noch getarnt ist(Geht auch durch Portale) W&auml;hrend er getarnt ist kann er zus&auml;tzlich einmal durch ein Portal gehen.\n\nMax Ladungen: 2000/3000/4000\nDauer: 5 Sekunden\nSchaden = Ladung : 10\nCasting: 0.5 Sekunden\n\n**Geschichte**\n\n_Shell war einst einer der Wissenschaftler aus Zhaun. Seine eigentliche Aufgabe war, Waffen zu entwickeln. Er entwickelte zwar Waffen wie spezielle Granaten, Lasergewehre und spezielle Anz&uuml;ge, doch heimlich studierte er auch mit der vierten Dimension und arbeitete an einem Portal. Nach 10 Jahren hatte er das Portal und noch eins davon fertig und startete heimlich einen Test, indem er eine seiner Waffen durch das Portal schickte. Es verschwand zwar in dem Portal, doch kam nicht aus dem anderen raus. Er probierte es auch mit kleinen Lebewesen, doch niemals kam es aus dem anderen raus. Nach dem Test kamen die Besitzer des Labors um seine entwickelten Waffen zu holen. Weil er nicht genug Waffen fertig gestellt hatte(er hatte viele ins Portal geschickt), durchsuchten sie sein Labor und entdeckten das Portal. Sie verurteilten Shell gegen das Gesetz verstossen zu haben und wollten ihn verhaften. Anstatt verhaftet und vielleicht sogar hingerichtet zu werden, entschied sich Shell in das Portal zu fliehen. Er schloss die Augen und rannte durch das Portal. Shell war der einzige der Zugang zum Portal hatte. Das hat er f&uuml;r den Notfall in seinen entwickelten Anzug programmiert. Es sah nur schwarz. Kein einziges Licht. Er f&uuml;hlte nichts, h&ouml;rte nichts, sah nichts und riechte nichts. Er befand sich in einer fremden Galaxis ohne Sterne und ohne Planeten. Er verfiel in einen dauerhaften Schlaf. 8 Tage sp&auml;ter(in der fremden Galaxis 2000 Jahre) wachte er in seinem Labor neben allen Waffen und Lebewesen welche er durch das Portal geschickt hat auf. Die neue Person des Labors war zu besch&auml;ftigt um ihn zu bemerken. Das Labor war nun ein Chemielabor und der Mann der dort arbeitete hatte eine Glatze und l&auml;chelte &uuml;ber das gr&uuml;ne Gemisch was er gerade zusammengemischt hat. Shell schlich aus dem Labor und floh in ein geheimes Versteck. Dort arbeitete er weiter und versuchte herauszufinden wieso er zur&uuml;ckgekommen ist. Er war erfolgreich und entwickelte neue Portale, zus&auml;tzliche Waffen und einen modernisierten Anzug. Denn er war in Zhaun gesucht und zum Tode verurteilt. Deshalb macht er sich bereit um der Liga der Legenden beizutreten...\nFreunde:  (er hat Viktor mal belehrt) Rivalen:  (Kein richtiger Rivale, aber besetzte sein Labor)\n_\n\nFreunde: {{champion:112}} (Er hat Viktor mal belehrt)\n\nRivalen: {{champion:27}} (Hat sein Labor f&uuml;r sich beansprucht)\n\n**Sequenzen**\n\nChampionauswahl: &quot;Portale und Waffen einsatzbereit!&quot;\n\nZuf&auml;llig: &quot;Die 1. Dimension ist die Strecke, die 2. Die Fl&auml;che, die 3. der Raum und die 4. ... die Zeit...&quot;\n\nWenn er stirbt: &quot;Ich hab die Dimensionen falsch berechnet&quot;\n\n {{champion:27}} &quot;Hab ich dich nicht mal in meinem Labor gesehen? Dort warst du noch nicht so h&auml;sslich&quot;\n\n{{champion:112}}  &quot;Ich habe dich anscheinend gut belehrt&quot;\n\n {{champion:19}} &quot;Was ist dann aus dir geworden?&quot;\n\nCTRL1: (Betrachtet sein Gewehr) &quot;Beste Qualit&auml;t&quot;\n\nCTRL2: (&quot;L&auml;dt&quot; seine Waffe nach)&quot;Oh ich hab ganz vergessen, bei solchen Waffen muss man doch nicht nachladen&quot;\n\nCTRL3: (Wird unsichtbar und tanzt)\n\nCTRL4: (Lacht in seinem Anzug(Roboterstimme))\n\n**Aussehen von Chell**\n\nZwei Beispiele wie Chell aussehen könnte(Bilder von google):\n\nhttp://orig14.deviantart.net/a05a/f/2014/002/a/0/sniper_by_hunqwert-d70ig7r.jpg\n\nhttp://coolvibe.com/wp-content/uploads/2013/07/Sci-fi-Art-Geoffroy-Thoorens-Orbital-Sniper.jpg\n\n\nDie Granate von Chell sollte eher rund sein. Wie in diesem Bild:\n\nhttp://img05.deviantart.net/ae76/i/2012/092/a/f/3d_scifi_grenade_by_jadentracyn-d4ur0wz.jpg\n\n**Anmerkungen**\n\nIch w&auml;re froh &uuml;ber ein Feedback zu Chell. Danke f&uuml;rs Lesen.\n\n\nMfg","replies":[{"poster":"ChimeCollector69","date":"2016-03-02T08:10:35.565+0000","up_votes":3,"down_votes":3,"body":"Der Vorschlag ist doch absurd. Es fängt schon beim Namen an. Der \"vierdimensionale\" Scharfschütze? Das ist doch schon lächerlich, weil man sich eine vierte Dimension, bzw. ein vierdimensionales Objekt gar nicht vorstellen kann. Was soll das also überhaupt bedeuten? Und wo findet sich diese \"vierte Dimension\" in seinem Konzept wieder.\n\nDann seine Fähigkeit \"Portal\". Was bitte soll diese Fähigkeit für ein Counterplay haben, wenn man einfach aus einer hohen Distanz von ihm angegriffen wird und im Grunde nichts dagegen unternehmen kann. Ich gehe davon aus, dass es sich hierbei um Autoattacks handelt, die bei größerer Distanz auch noch höheren Schaden anrichten. Und vor allem nicht gedodgt werden können.\nUnd wie soll das überhaupt funktionieren, dass er durch die Portale auf Gegner schießen kann? Wie soll man sich das vorstellen? Muss er in einem gewissen Winkel vor dem Portal stehen? Wie groß soll der Bereich um die Portale sein, wo man angegriffen werden kann. \nKönnen die Portale von Gegnern eigentlich zerstört werden?\n\nStell dir doch mal folgendes Szenario im Jungle vor, wo man in einem engen Gang ist, etwa beim Drake. Dann sitzt Chell in schöner Entfernen und wenn Gegner ankommen knallt er die einfach ab, ohne dafür bestraft werden zu können. Ich kann eine Abstandgrenze von 1850 Einheiten nicht abschätzen wie weit das ingame ist, aber wird wohl so lang sein um selbst von Fähigkeiten mit sehr höher Reichweite nicht getroffen zu werden. \nZum Vergleich hat der Q von Xerath eine maximale Reichweite von 1400. Ist also deutlich darunter.\nWie mir scheint könnte also höchstens Jhin ihn mit seinen Fähigkeiten treffen.\n\n\nAuch das er und Verbündete diese Portale benutzen können ist viel zu stark. Im Grunde ist es so wie die Magical Journey von Bard, nur das anscheinend Gegner diese nicht nehmen können, man ohne Verzögerung am \"Ende\" herauskommt und dort auch noch Movespeed erhält und man diese überall platzieren kann (bis auf den maximalen Abstand, versteht sich, der aber im Grunde belanglos ist). Das ist ungefähr 10mal besser als die Fähigkeit von Bard und viel zu op, vor allem, weil Gegner diese Option nicht haben.\nDiese Fähigkeit ist völlig überladen.\n\nSeine Passive ist im Grunde die von Jhin, nur mit einem Bonus.\nSeine \"Granate\" ist im Grunde die Bombe von Corki, auch nur mit einem Bonus.\nDa steckt für mein empfinden also teilweise wenig Innovation drin. Und das worauf das restliche \"innovative\" Konzept basiert ist unbalanced und stelle ich mir ziemlich \"anti-fun\" für die Gegner vor.\n\nEin solches Konzept kann so, meiner Meinung nach, nie funktionieren.\n\nIch überlege selber seit längerem an einem Champion-Konzept was so eine Art Portal-Fähigkeit hat. Sowas kann meines Erachtens nur funktionieren wenn auch die Gegner diese Portale benutzen können und man sie nur gegen Kosten benutzen kann.\nEtwa Mana, oder auch Leben, damit man sie nicht so leicht als Escape verwenden kann. Außerdem sollten solche \"Sprünge\" eine Verzögerung haben. Wie etwa Reksai und Tahm Kench mit ihren Ultimates. \nDas ist ja nicht ohne Grund so.\n\nEdit: \n\nIch habe mir gerade noch mal die Ultimate durchgelesen. \nDu findest also eine Ultimate, welche nur passiv ist und nach einem Champion-Kill dich für bis zu 8 Sekunden unsichtbar macht in irgendeiner Form balanced? \nDann wäre er ja ein longrange-ADC-Assassine....","replies":[{"poster":"StillYasuoMain","date":"2016-03-02T10:11:52.672+0000","up_votes":1,"down_votes":0,"body":"Die vierte Dimension ist die dritte Dimension einfach mit Zeit. Also man kann wissen wann das Obejkt sich wo befindet. Falls du die Geschichte gelesen hast, geht er ins Portal und schlaft in dieser Galaxie für mehrere Jahre, bzw Monate, die bei uns 1 Sekunde sein sollte. 8d = 2000j   1s = ?\nWenn du lust hast das auszurechnen, bitte schön.\n\nWeisst du dann was die vierte Dimension ist? Wenn du dich in dem Bereich gut auskennst kannst du es mir gerne erklären.\n\nCountern vom Portal: Nicht nahe dran gehen\n\nIch habe etwas im Konzept vergessen zu erwähnen: Die Angriffsreichweite von Chell zum Portal und vom anderen Portal zum Gegner wird um 60/50/40/30/20% verringert. Das heisst er kann nur nahe Gegner angreiffen. Seine normale Angriffsreichweite ist 690. Nehmen wir mal E lvl 2, dann könnte er nur Gegner innerhalb von 345 Einheiten vom Portal enternt angreiffen und muss mindestens 345 Einheiten in der Nähe vom Portal sein. Wie er überhaupt durchschiesst? Gute Frage. \nEs erscheinen zwei Kreise um die Portale, die der Angriffseichweite entsprechen. (Also auf lv 2 dann eben 345) \nWenn Chell dan in der Nähe eins Portals auf einen Gegner in der Nähe des anderen Portals(Nähe = 345) rechtsklick klickt wird automatisch in das Portal geschossen. Ich werde vielleicht das Konzept noch erweitern und diese Dinge mit Bildern erklären.\nÜbrigens muss der Gegner aufgedeckt sein um ihn anzugreiffen und das Portal deckt NICHT die umgebung.\n\nDie Fähigkeit ist nicht unbedingt 10 mal besser:\n\nBard:\n\n- Tiefe Manakosten\n- Muss nur eines platzieren\n- Kann es mehrmals benutzen\n- Kann damit auch Fallen für Gegner stellen\n- Kann es auch benutzen um schneller vorwärts zu kommen(Follow,SofortEscape)\n- Kann es sofort benutzen\n- Kann es benutzen um zu ganken ohne dass man ihn zu früh sieht\n\nChell:\n\n- Hohe Manakosten\n- Muss zwei platzieren\n- Kann nur 2 geöffnet haben\n- Gegner können nicht hindurch\n- Total useless um schneller vorwärts zu kommen\n- Muss alles vorbereitet werden\n- Hat eine hohe Reichweite\n- Kommt ohne Verzögerung aus dem anderen raus\n- Erhält MS\n\n\nSeine passive ist nicht die passive von Jhin und seine q ist nicht die Bombe von Corki. \n\nJhin und Chell passive haben nur das AS zu AD gemeinsam.\n\nCorki Q kann nicht durch Portale geworfen werden und wenn man sie trifft kann man auch keinen.  Schuss abfeuern. Corki q verlangsamt und macht hohen Schaden. Chells Granate wenig und deckt die Gegner auf um sein Schuss besser zu treffen und macht erst viel und verlangsamt.\n\nWenn du willst kann ich eine 3 Sekunden Castingsdauer reinmachen. Da wäre ich einverstanden, denn solange sich das Portal in einem Gebüsch befindet und das andere auf der Lane kann man immer noch eine Überaschung machen. Der Champ ist halt wie Yasuo und Kalista sehr op wenn man mit seinem Team leicht kommunizieren kann. zB. Im Teamfight mit den Portalen wo man sie hibsetzen soll um das andere Team zu Überraschen etc.\n\n8 Sekunden unsichtbar auf Stufe 16 solange er nicht angreifft*","replies":[{"poster":"ChimeCollector69","date":"2016-03-02T12:17:32.890+0000","up_votes":2,"down_votes":0,"body":">  Falls du die Geschichte gelesen hast\n\nNein, habe ich natürlich nicht.\n\n> Countern vom Portal: Nicht nahe dran gehen\n\nDas ist kein Counterplay.\nDieser Chell kann im Grunde eins seiner Portale auf die höhe der gegnerischen Caster-Vasallen stellen und den Gegner immer mit Autoattacks angreifen. Das ist doch Blödsinn. Wie soll denn die Laning-Phase gegen ihn aussehen?\n\nIch äußere mich mal nur zu den Vor-/Nachteilen die du zu dem \"Portal\" von Chell schreibst.\n\nHohe Manakosten:\n\nEin Champ der eine Ulti hat, welche kein Mana kostet und den Großteil seines Schadens durch Autoattacks macht, wird keine Manaprobleme haben, außer am Anfang. Spätestens wenn das Spiel etwas voran geschritten ist, interessieren die Manakosten sowieso überhaupt niemanden mehr.\n\nMuss zwei platzieren:\n\nIn wie fern ist das ein Nachteil? Wenn der Gegner die Portale nicht zerstören kann, und die Portale auch nicht irgendwie zeitlich begrenzt sind, dann ist das doch nahezu keine Einschränkung.\n\nTotal useless um schneller vorwärts zu kommen:\n\nMag sein, aber mit dem Portal kannst du deinem ganzen Team ein flash über eine Mauer ersparen, ohne das der Gegner ohne weiteres folgen kann.\n\n> Seine passive ist nicht die passive von Jhin und seine q ist nicht die Bombe von Corki.\n\nIch glaube du hast nicht verstanden, was ich damit sagen wollte. Das es nicht eins zu eins die genannten Fähigkeiten sind, ist doch klar...\n\n> 8 Sekunden unsichtbar auf Stufe 16 solange er nicht angreifft*\n\nDas schießt den Vogel einfach ab. Das potential acht Sekunden unsichtbar, nach jedem Kill/Assist, zu werden ist völlig absurd.\nVor allem, weil der nächste Angriff dann auch noch \"extrem hohen Schaden\" machen soll.\nDas würde heißen er wird nach jedem Kill zu so einer Art Rengar....\n\n\n\nDie Fähigkeiten die du dir ausgedacht hast, sind einfach völlig utopisch. \nDieser Champion würde wahrscheinlich nicht mal \"gesund für das Spiel sein\", wenn du die Funktionsweise des Portals und seiner Ulti von den Werten in Grund und Boden nerfst.\n\nMein Vorschlag für das Portal würde so aussehen, auch wenn ich mir sicher bin, dass dieses Konzept niemals funktionieren wird.\n\nDas das Portal auch von Gegnern benutzt werden kann, wäre Mindestvoraussetzung dafür, dass diese Fähigkeit im Spiel existieren kann.\nAußerdem müsste der Schaden durch die Portale nicht noch zusätzlich durch magischen Schaden erhöht werden, sondern er müsste verringert werden. Etwa auf erster Stufe 60% vom AD. (Nur als Beispiel) Und auf Stufe 5 vielleicht den normalen Schaden.\nZusätzlich müsste jeder Schuss durch das Portal Mana kosten und darf nicht kritisch treffen können. Sonst kann man ja {{item:3508}} bauen und es trotzdem so oft benutzen wie man möchte.\n\nIm Gegenzug könnte man auch hier wieder ein Stack-System einbauen, was ja eh jeder neue Champ braucht, wo man pro Schuss durch das Portal ein Stack auf den Gegner sammelt, und bei drei Stacks kriegt er zusätzlichen magischen Schaden, oder was weiß ich.","replies":[{"poster":"StillYasuoMain","date":"2016-03-02T12:28:06.351+0000","up_votes":2,"down_votes":0,"body":"Kk ich werde ihn folgendermassen ändern:\n\nW: Akri-und deaktivierbar\n\nDeaktiviert: Chells normale Angriffe verursachen zusätzlichen Schaden durch Portale. Gegner können durch Portale gehen.\n\nAktiviert: Chell kann nicht mehr durch Portale schiessen. Verbündete können durch Portale gehen.\n\nAbklingzeit dazwischen: 10/9/8/7/6 Sekunden\n\nR: 5 Sekunden auf jeder Stufe\n\nBist du zufrieden?","replies":[{"poster":"ChimeCollector69","date":"2016-03-02T13:40:19.894+0000","up_votes":2,"down_votes":0,"body":"Nein. Das Konzept ist einfach bescheuert und nicht umsetzbar.","replies":[]}]}]}]},{"poster":"El Jonas","date":"2016-03-07T15:17:44.970+0000","up_votes":1,"down_votes":0,"body":"alter hast du dir viel mühe gemacht :D","replies":[]}]},{"poster":"Darkblizzard","date":"2016-03-02T12:56:43.494+0000","up_votes":1,"down_votes":0,"body":"DER NAME IST IMMER NOCH VON PORATL 1 und 2 GEKLAUT","replies":[{"poster":"StillYasuoMain","date":"2016-03-02T14:58:54.527+0000","up_votes":1,"down_votes":0,"body":"Ik ich habe es 3 mal mit Shell versucht, doch es hatte kein grossen Erfolg. Jetzt dachte ich probier ich es nochmals mit Chell und es hat wieder mehr Erfolg... Doch was spielt das für eine Rolle? Riot interresiert sich sowieso nicht für Konzepte von Spielern. In NA forum hat es konzepte mit 1000 upvotes und?","replies":[]}]},{"poster":"Quietschiie","date":"2016-03-02T11:36:11.391+0000","up_votes":1,"down_votes":0,"body":"Bin etwas im Zwiespalt mit dem Kit. Finde es prinzipiell eine gute Idee, allerdings klingt es irgendwie ein bisschen ZU gut..\nMöchte nur anmerken, dass die Liga mit Jhin bereits einen Scharfschützen erhalten hat und da Riot ja immer die Einzigartigkeit eines jeden Champions umwirbt, sehe ich für einen zweiten Sniper eher schwarz..\n\nBewundere trotzdem deine Mühe dahinter, sowas entwickelt man nicht mal schnell in 10 Minuten!","replies":[{"poster":"ChimeCollector69","date":"2016-03-02T12:19:49.871+0000","up_votes":1,"down_votes":2,"body":"Echt? So kommt es mir aber vor, was die Fähigkeiten angeht.","replies":[{"poster":"StillYasuoMain","date":"2016-03-02T12:45:44.522+0000","up_votes":1,"down_votes":0,"body":"Weisst du was: Mach selber ein Konzept und poste es.","replies":[{"poster":"ChimeCollector69","date":"2016-03-02T13:40:51.763+0000","up_votes":1,"down_votes":0,"body":"Bin dabei.","replies":[]}]}]},{"poster":"StillYasuoMain","date":"2016-03-02T12:29:21.659+0000","up_votes":1,"down_votes":0,"body":"Naja jhin finde ich ist nicht gerade ein richtiger sniper. Cait wäre mir da näher als Scharfschütze.\n\nPS: Das Konzept allein ging ja noch, aber die erstellten Videos zu den Fähigkeiten beim letzten edit dauerten Tagen, brachten aber nichts:(","replies":[]}]},{"poster":"EG RedFlake","date":"2016-03-02T07:30:03.163+0000","up_votes":2,"down_votes":2,"body":"Hey ho :)\nHabe ja seit dem ersten Post von dir zu Chell schon mitgeschrieben. Ich habe diesesmal auf \"Ja\" geklickt, weil ich finde dass der Champ jetzt echt eine Überlegung bzw. Option wert ist. An manchen Stellen - finde ich persönlich - könnte man zB noch Cooldowns und Manakosten anpassen (zB bei den Portalen CD und bei der Q Mana). Vom Kit her finde ich ihn aber echt super, Respekt dass du dir so viel Mühe gemacht hast.\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"StillYasuoMain","date":"2016-03-02T12:52:06.735+0000","up_votes":1,"down_votes":0,"body":"Ich habe CD und Manakosten bei den Portalen so geändert:\n\nAbklingzeit Ladung 1-2: 8 Sekunden\nAbkiingzeit 0-1: 15 Sekunden\n\nManakosten: 80/90/100/110/120","replies":[{"poster":"EG RedFlake","date":"2016-03-07T07:28:41.514+0000","up_votes":1,"down_votes":1,"body":"Hey sorry für die späte Antwort :D\nIch fand die CD`s im Zusammenhang mit den Manakosten zu niedrig bzw. zu günstig.\nDu musst halt schauen dass man solch \"starke\" Fähigkeiten nicht spammen kann.\nDas kann man über zwei Wege balancen: Manakosten erhöhen oder CD erhöhen.\n\nBin mal gespannt ob sich RITO dem Champ annähern will,\nfinde ihn ganz naaaise :)","replies":[]}]},{"poster":"StillYasuoMain","date":"2016-03-02T09:27:49.061+0000","up_votes":1,"down_votes":0,"body":"Danke:D\n\nAlso du denkst die CDs sind alle zu kurz oder verschieden? Und die Manakosten bei der E zu teuer? Ich meine es wäre nicht gerade balanced wenn es auch noch wenig Mana kosten würde...","replies":[]}]}]}