{"poster":"StillYasuoMain","date":"2016-12-08T19:45:40.413+0000","title":"Yasuo nerf Idee von einem Yasuo main","subforum":"Champions & Gameplay","up_votes":1,"down_votes":8,"body":"Hallo liebe Leute\n\nIch bin mit einem total von 500k points ein Yasuo main(bin also kein Yasuo hater und schon etwas erfahren mit ihm)\nYasuo war schon immer ein Champ, der extrem viel und schwere mechanics hatte die halt ungeheuer viel Spielspass bieten. Was jedoch jetzt und auch bei Tank Yasuo der Fall war: Auch schlechte Spieler konnten mit Yasuo abgehen, da er auch ohne advanced Mechanics stark ist. ABER: Nur der offtank Yasuo mit Tanky items wie {{item:3022}} {{item:3065}} {{item:3053}} etc. \n\nFull AD Yasuo(was eigentlich Yasuos Ursprung war) ist hingegen sehr gebalanced, da er keinen einzigen Fehler verzeiht(es sei denn man holt ein ADC der alleine in seiner minion wave pusht...). Um mich selbst zu verbessern und anderen nicht den Spielspass zu versauen spiele ich deshalb andauernd nur full AD Yasuo. Es sei denn wir sind am verlieren aber k&ouml;nnten noch gewinnen und ich spiele gegen toxische Spieler oder total brokene Champs. Dann kauf ich mir die Offtank Items und gewinne dann meistens^^\n\n**Meine Nerf Idee:**\n\nAltes Q: Ein normaler Skillshot-Angriff. Nach zwei erfolgreichen Stahlst&uuml;rmen feuert der n&auml;chste einen Tornado ab, der Gegner in die Luft st&ouml;&szlig;t.\nSt&ouml;&szlig;t nach vorne und verursacht 20/40/60/80/100 (+100% Angriffsschaden) normalen Schaden. Bei einem Treffer gew&auml;hrt Stahlsturm 10 Sekunden lang eine Steigerung von Aufziehender Sturm. Bei zwei Steigerungen entfesselt Stahlsturm einen Wirbelwind, der in die Luft schleudert.\nStahlsturm wird als normaler Angriff behandelt: Er kann kritisch treffen, l&ouml;st Treffereffekte aus, kann durch Massenkontrolleffekte unterbrochen werden und seine Abkling- und Ausf&uuml;hrungszeit sind durch Angriffstempo verringert. Falls er w&auml;hrend des Sausens ausgef&uuml;hrt wird, beschreibt Stahlsturm einen Kreis.\n\n**Cooldown: 4(-0.58 pro 1% AS)**\n\nNeues Q: Ein normaler Skillshot-Angriff. Nach zwei erfolgreichen Stahlst&uuml;rmen feuert der n&auml;chste einen Tornado ab, der Gegner in die Luft st&ouml;&szlig;t.\nSt&ouml;&szlig;t nach vorne und verursacht 20/40/60/80/100 (+1.0 AD) normalen Schaden. Bei einem Treffer gew&auml;hrt Stahlsturm 10 Sekunden lang eine Steigerung von Aufziehender Sturm **und seine Abklingzeit wird um 25% verringert**. Bei zwei Steigerungen entfesselt Stahlsturm einen Wirbelwind, der in die Luft schleudert.\nStahlsturm wird als normaler Angriff behandelt: Er kann kritisch treffen, l&ouml;st Treffereffekte aus, kann durch Massenkontrolleffekte unterbrochen werden und seine Abkling- und Ausf&uuml;hrungszeit sind durch Angriffstempo verringert. Falls er w&auml;hrend des Sausens ausgef&uuml;hrt wird, beschreibt Stahlsturm einen Kreis.\n\n**Cooldown: 4(-0.435 pro 1% AS)** (um 25% erh&ouml;ht)\n\nAlte R: Yasuo sprintet sehr schnell zu einem nahen gegnerischen Champion der hochgeschleudert wurde, unterdr&uuml;ckt ihn und alle umliegenden hochgeschleuderten Gegner in einem 400er Radius, w&auml;hrend er ihnen **200/300/400(+1.5 AD)** normalen Schaden zuf&uuml;gt. Sobald er landet, werden alle Steigerungen von Stahlsturm automatisch zur&uuml;ckgesetzt und Yasuo erh&auml;lt maximalen Fluss sowie 15 Sekunden R&uuml;stungsdurchdringung in H&ouml;he von 50% der Bonusr&uuml;stung des Gegners bei kritischen Treffern(dies trifft auf die R&uuml;stung von Gegenst&auml;nden,Runen,Meisterschaften und Boni)\n\nCooldown: 80/55/30\n\nNeue R: Yasuo sprintet sehr schnell zu einem nahen gegnerischen Champion der hochgeschleudert wurde, unterdr&uuml;ckt ihn und alle umliegenden hochgeschleuderten Gegner in einem 400er Radius, w&auml;hrend er ihnen **100/200/300(+1.75 AD)** normalen Schaden zuf&uuml;gt. Sobald er landet, werden alle Steigerungen von Stahlsturm automatisch zur&uuml;ckgesetzt und Yasuo erh&auml;lt maximalen Fluss sowie 15 Sekunden R&uuml;stungsdurchdringung in H&ouml;he von 50% der Bonusr&uuml;stung des Gegners bei kritischen Treffern(dies trifft auf die R&uuml;stung von Gegenst&auml;nden,Runen,Meisterschaften und Boni)\n\nCooldown: 80/55/30\n\nSchreibt unten was ihr von dem Nerf haltet und falls er euch gef&auml;llt dann lasst doch ein upvote da. @YasuoMains seht diesen nerf nicht negativ. Denn damit k&ouml;nnt ihr besser beweisen wie gut ihr mit Yasuo wirklich seid!\n\nmfg StillYasuoMain","replies":[{"poster":"Balmung","date":"2016-12-09T09:21:34.102+0000","up_votes":5,"down_votes":1,"body":"Der Unmut über Yasuo gründet in seinen Mechanics, nicht in der Frage \"muss man an seinem Dmg etwas drehen?!\"\n\nEs ist für den Spieler selbst toll ihn zu spielen - quasi keine CDs und Kosten, viel Mobility wenn Minions da sind, einen W um jegliches Projektil einfach verpuffen zu lassen, unglaubliches Lategamescaling, einen selbstaufladenden Shield um Autos zu blocken/Trades zu vereinfachen, Gratis-CDR auf dem Q durch Attackspeed, etc.\n\nQuasi jeder dieser Punkte ist für den Gegenspieler einfach eine unglaublich beschissene Mechanic, um sie auf der Lane oder auch im späteren Spiel zu handlen.\nDabei muss der Yasuo nicht mal wirklich gut spielen können, da einfach zu viel \"positives\" für ihn zusammenkommt.\n\nDer Champion bräuchte einfach mal richtige Schwächen, welche nicht durch irgendetwas bereits im Kit verbauten abgemildert würden. Dann wäre er aber auch wie Master Yi...und kaum jemand würde ihn mainen.","replies":[{"poster":"StillYasuoMain","date":"2016-12-09T11:05:54.922+0000","up_votes":1,"down_votes":2,"body":"Genau deshalb den Q change! Man muss die Q treffen um den minimalen cdr zu erhalten. Wenn du jetzt sagst, dass jeder alle Yasuo Qs trifft dann denk selber darüber nach.","replies":[{"poster":"Balmung","date":"2016-12-09T18:12:11.553+0000","up_votes":2,"down_votes":0,"body":"Ich frag mich ja wirklich ob du meinen Text gelesen hast - der Triple-Q ist eigentlich der unproblematischste Teil seines Kits.\n\nUnd ob du nun statt 1.3 -> 1.3 -> 1.3 Sekunden CD pro Q 1.8 -> 1.5 -> 1.3 hast, ist völlig ralle, da der Dmg und sein relativ-gut-handlebarer Knockup einfach nicht das Problem ist.\n\nEs ist sein gesamtes Kit, welches eigene Fehler grußzügigst vergibt, gegnerische Fehler bestraft und ein halbwegs brauchbares eigenes Play in den Himmel hebt, als wäre man Faker persönlich.\n\nDabei ist auch völlig wumpe ob man gegen Yasuo gewinnt oder verliert, ob er im eigenen oder dem Gegnerteam ist. Die meisten mir bekannten Spieler bannen Yasuo auch aus \"ich hab keinen Bock den Champion in meinem Spiel zu haben\", nicht aus \"oh, der ist grade stark oder würde mir gefährlich werden\".","replies":[{"poster":"Mi3zekatze","date":"2016-12-10T07:49:52.466+0000","up_votes":2,"down_votes":2,"body":"Yasous Kit verzeiht keine Fehler! Wenn einmal keine Minions zufälligerweise genau hinter dr stehen machst du einen falschen Schritt und du bist tot! Das macht Yasou auch so schwer er hat keine Möglichkeit einen Fehler auszubügeln. \nUnd auch auf der lane ist es so das du wenn du behind fällst engage wirst nur die Flucht nach vorne (über die gegnerischen Minions) hast! Und da wirst du auch gnadenlos verfolgt.\nFazit: Bitte Spiel erstmal ein Paar Games mit Yasou ukd behaupte hier nicht pauschal er hätte keine Schwächen oder jeder kann mit ihm gewinnen! \nYasou ist meiner Meinung nach einer der schwersten Champions der Kluft und ich sehe genug Yasous die komplett reinfeeden! Oder wie erklärst du dir das Leute in der CS Yasou bannen obwohl ein M8 ihn schon angezeigt hat?!","replies":[{"poster":"Balmung","date":"2016-12-10T11:34:24.859+0000","up_votes":2,"down_votes":0,"body":"Ich hab mir den Text jetzt mal nicht durchgelesen, da nach dem ersten Satz bereits klar ist worauf du hinaus willst und meinen Absatz ebensowenig gelesen hast.\n\nUm's kurz zu machen: Champions wie Azir oder Aurelion Sol sind komplex, weswegen sie auch nicht jeder Vollhonk spielt, da sie einfach für schlechtes Positioning, Ressourcenmanagement oder falsch benutzte Cooldowns sich selbst bestrafen können.\nDie Champions sind nicht massentauglich, da sie komplexes Gameplay haben.\n\nYasuo hingegen kann jeder Depp spielen, da er wie oben beschrieben einfach von sich aus einen Haufen Gratiszeug bekommt, womit jeder im Grunde komplexe Champion trivial wird.\n\nUnd weshalb Yasuo gebannt wird, obwohl ihn jemand angezeigt hat: Weil kein Mensch mit oder gegen Yasuo spielen will.  Habe ich oben bereits gesagt - lesen hilft.","replies":[]}]}]}]}]},{"poster":"Staatsanwalt","date":"2016-12-10T14:06:51.494+0000","up_votes":2,"down_votes":0,"body":"Ich glaube auch, dass nicht unbedingt der Schaden das Problem ist, sondern halt seine ganzen free \"Stats\".\nBalmung hat es eigentlich gut auf den Punkt gebracht.\n\nEs wäre doch ne Idee, ihm ne Ressource zu geben bzw. das zu nutzen was er hat.\n\nNämlich sein Windschild:\n\nWas wäre, wenn seine Fähigkeiten sein Schild aufbrauchen würden? \n\nIch stelle mir das so vor:\n\nYasuo bekommt wie gehabt durch laufen seinen Schild. Er ist jetzt Theoretisch bei 100% der Schildstärke. Nun ist es so, das ein Q zb. 10% aufzerrt, ein e 5% und W meinetwegen 40% der Gesamtschildstärke. Dadurch muss er entscheiden, wie er das am besten handelt und kann nicht alles spammen, was er hat. Und vielleicht muss er einfach zwischendurch mal laufen\n\nDie Ulti lädt es natürlich wieder voll auf. \n\nJetzt kommt der berechtigte Einwand, dass man ihn ja nur einmal einen AA geben müsste und dann kann er nix mehr machen. Aber nein, dafür hab ich auch eine Idee. Das Schild droppt wie gewohnt, jedoch entsteht ein passiver Stand des Schildes, dort wo der aktive Schild geploppt wurde.  Der Aktive Schild sollte mit der Stärke des Passiven wertes nach 3 Sekunden ohne Schaden wieder erscheinen.\n\nIch stelle mir das so vor:\n\n1. Yasuo geht mit 100% Schildstärke in den Kampf.\n2. Er dasht und benutzt dann Q, seine Schildstärke ist bei 85%.\n3. Er bekommt Schaden und der Schild ist nur 85% der maximalen Schildstärke.\n4. Yasuo läuft ein bisschen lädt ein bisschen auf und ist wieder bei 90%.\n5. Yasuo greift wieder an mit 4xe auf Minions und 2xQ und ist nun bei 50%.\n\nusw. usw. Er muss halt nun darauf achten was er macht. Jetzt muss er halt entscheiden, ob er vielleicht die Windwall einsetzen muss oder weiter angreift, weil wenn er weiter angreift, kann er evtl die Windwall nicht mehr benutzen.\n\nNatürlich sind die Werte ein bisschen überzogen, aber Vielleicht ist dieses Konzept eine Möglichkeit ihn zu balancen","replies":[{"poster":"StillYasuoMain","date":"2016-12-11T11:57:39.839+0000","up_votes":1,"down_votes":0,"body":"So, hab einen Weg gefunden deine Idee umzusetzen. \n\nDeine Idee war, dass Yasuo Fluss braucht um die Q zu aktivieren. \n\nDa Yasuo aber immernoch ein caster ist und nie zuwenig Resourcen haben soll:\n\nYasuos Q hindert ihn daran sein Maximales Schild zu bekommen.\n\nSo jetzt die neue Passive:\n\n>Yasuo lädt durch Bewegung Fluss auf. Mit 100% Fluss erhält er einen Schild, dass bis zu x Schaden abfängt sobald er Schaden erleidet(Keine Änderung).\n\n>Falls er Stahlsturm benutzt verliert er 10% Fluss wenn dieser noch nicht auf 100% ist(bei weniger als 10% Fluss wird einfach auf 0% gesetzt)\n\n>Evtl hinzufügen: Wenn er mit Stahlsturm ein Gegner trifft erhält er 5 Fluss zurück*\n\n\nBeispiel:\n\nYasuo läuft auf die lane und hat 100% Fluss. Er spielt gegen eine Leblanc. \n\nEr benutzt seine Q ein paar mal ohne Fluss zu verlieren(da er ja 100 Fluss hat).\n\nJetzt autoattackt ihn die Leblanc. Er erhält kurz sein Schild und der Fluss ist auf 0%.\n\nYasuo bewegt sich wieder und hat 40% Fluss. \n\nEr benutzt seine Q auf Leblanc(*aber verfehlt). Nun wird ihm 10% Fluss abgezogen.\n\nEr bewegt sich wieder bis 100% Fluss ohne seine Q zu benutzen, doch Leblanc procct sein Schild mit ihrer Q.\n\nYasuo macht eine E und hat 9% Fluss. Er benutzt seine Q auf ein Minion wobei seine 9% Fluss verliert. (*Er erhält 5% Fluss zurück und hat jetzt 5%)","replies":[{"poster":"Balmung","date":"2016-12-11T14:23:20.943+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=StillYasuoMain,realm=EUW,application-id=Wj1wcocU,discussion-id=belM4Aw1,comment-id=000a0001,timestamp=2016-12-11T11:57:39.839+0000)\n> Da Yasuo aber immernoch ein caster ist und nie zuwenig Resourcen haben soll:\n\nUnd genau diese Einstellung führte zu Yasuos überladenem Kit, worauf die Abneigung vieler Spieler gegenüber diesem Champion gründet.","replies":[{"poster":"StillYasuoMain","date":"2016-12-11T18:43:21.942+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Balmung,realm=EUW,application-id=Wj1wcocU,discussion-id=belM4Aw1,comment-id=000a00010001,timestamp=2016-12-11T14:23:20.943+0000)\n>\n> Und genau diese Einstellung führte zu Yasuos überladenem Kit, worauf die Abneigung vieler Spieler gegenüber diesem Champion gründet.\n\nAha und riven?","replies":[{"poster":"Balmung","date":"2016-12-11T19:23:01.032+0000","up_votes":1,"down_votes":0,"body":"Riven hat deutlich höhere CDs und benötigt CDR - zudem kann sie nicht von der einen Seite der Minionwave gratis zu dir dashen ohne dabei Dmg zu verlieren.\nIhr Shield hat ein merkliches CD im early und hält ebenso nur 1.5 Sekunden - Zeit zum traden und wenn du ihn falsch used nutzlos.\nSie hat keine Möglichkeit jegliche Projektile verpuffen zu lassen, obwohl sie den Skill in die völlig falsche Richtung setzt.\n\nAber was Championvergleiche, so ziemlich das unsinnigste was man für eine Argumentation ranziehen kann, bringen sollen, ist mir nicht ganz schlüssig.\nDas Problem ist ja nicht Riven oder ein andere Champion sondern Yasuo, welcher deutlich unbeliebter als Riven ist.","replies":[{"poster":"StillYasuoMain","date":"2016-12-11T22:50:40.086+0000","up_votes":1,"down_votes":0,"body":"Was ich halt einfach an Yasuo nicht mag ist sein hohes DPS was ihn mit der mobilität und der wall halt fast ein besserer Trynda macht(auch pushen kann er extrem gut). \n\nHier wäre ein Rework das mir gefallen würde:\n\n\nPassiv: Seine kritischen Treffer verursachen ~~ 10% weniger  Schaden~~ 50% weniger Schaden\n\nW: ~~26/24/22/20/18 Sekunden~~ 28/26/24/22/20 Sekunden\n\nE(Sausende Klinge):~~Jeder Dash erhöht den Schaden um 25% bis zu 50%~~ Jeder Dash erhöht den Schaden von Sausende Klinge und seiner kritischen Treffern um 25% bis zu 50%.\n\nSomit muss er seine E stacks behalten um zu fighten und die Wall kann er auf der laning phase nicht mehr so oft benutzen. ","replies":[]}]}]}]},{"poster":"Staatsanwalt","date":"2016-12-11T13:50:01.619+0000","up_votes":1,"down_votes":0,"body":"Das würde doch aber nur die Häufigkeit seines Schildes verändern oder?","replies":[{"poster":"StillYasuoMain","date":"2016-12-11T18:42:50.978+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Staatsanwalt,realm=EUW,application-id=Wj1wcocU,discussion-id=belM4Aw1,comment-id=000a00010000,timestamp=2016-12-11T13:50:01.619+0000)\n>\n> Das würde doch aber nur die Häufigkeit seines Schildes verändern oder?\n\nEigentlich schon. Aber du kannst ja nicht einfach auf das Schild verzichten und die Q spamen(ausser beim pushen wenn du sowieso immer 100% hast).","replies":[]}]}]},{"poster":"StillYasuoMain","date":"2016-12-10T19:25:59.900+0000","up_votes":2,"down_votes":3,"body":"Gratuliere! Der erste Beitrag der eine gute Kritik angibt :)\n\nFinde das mit der Resource eine Interessante Idee. Jedoch würde ich sie noch etwas ändern. Ich werde mal überlegen wie man das umsetzen könnte und dir demnächst meine Idee kommentieren. \n\nDer Fakt sollte sein: Yasuo baut Resource für seine Fähigkeiten durch Bewegung auf","replies":[{"poster":"Sihari","date":"2016-12-10T23:08:52.243+0000","up_votes":1,"down_votes":0,"body":"Oh und die Vorschläge wie Krit nerfen oder Windwall reworken zählen nicht als gute Kritik, weil...? xD\n\nAber mal ganz abgesehen davon könnte ich mich auch damit anfreunden. Passt gut zu den anderen Vorschlägen, wie man verhindern kann, dass jeder Anfänger-Yasuo mit ner Menge kram wegkommt~ \nIch meine diese Idee übrigens schonmal so ähnlich in den NA Boards gesehen zu haben, wo sie auch sehr gut ankam. Die Chancen stehen gut, dass RIOT genau das beim anstehenden Mini-Rework von Yasuo machen wird. c:","replies":[{"poster":"StillYasuoMain","date":"2016-12-11T01:20:08.871+0000","up_votes":1,"down_votes":0,"body":"Was ich an Yasuo liebe ist, dass er keine wirklichen Fähigkeiten hat aber auch nicht nur Autoattacken muss. Solange er in etwa das bleibt was er ist ist es mir recht. Mir wärs auch egal wenn man seine AD um 10 runtersetzt, er ist trotzdem noch mein Main Champ. In einer Hinsicht würde ich es sogar gut finden weil er dann nicht mehr 24/7 gebannt wird :)","replies":[]}]}]}]},{"poster":"Sihari","date":"2016-12-09T02:19:48.458+0000","up_votes":1,"down_votes":0,"body":"Wenn ich etwas an Yasuo andern dürfte, dann würde ich seine Windwall anfassen.\nBisher ärgere ich mich mit diesem Skill  am meisten herum, da er so meinen gesammten Championpool countert.\nWenn ein Yasuo sich \"schlau\" anstellt, dann stellt er sich im Teamfight einfach in die Frontlinie und lässt seine Windwall ungenutzt, um schon allein mit dem Gedankenspiel die Gegner davon abzuhalten ihre Ults dann einzusetzen, wenn sie am besten eingesetzt wären.\nUnd wenn der Gegner dann doch ultet, dann muss Yasuo seine Wall nichtmal schlau setzen um sich und im besten Fall auch noch sein ganzes Team zu schützen. \nEs ist einfach so nervig zusehen zu müssen, wie eine wunderschöne Nami-Ult an einer schief dahingepanicten Yasuo-Wall zerschellt! \n\nMein Traum wäre es, wenn das Ding nicht instant kommen würde, nicht direkt in ihm spawnt und erst Recht nicht in diesem Moment alles negiert, das auf ihn zu kommt, egal aus welcher Richtung das auch ist.\nYasuo sollte seine Wall auch in die Richtung stellen müssen, aus der das abzuhaltende Projektil kommt!\nOh und vielleicht könnte man es einrichten, dass sie wie andere Schilde (zB Sivir oder Morgana) auch nach dem ersten Projektil platzt und nicht noch ewig da steht.","replies":[{"poster":"Mi3zekatze","date":"2016-12-10T07:53:17.160+0000","up_votes":2,"down_votes":0,"body":"Da bin ich deiner Meinung die Yasou W sollte nicht in den 4s wo sie besteht ALLES blocken sondern sich nach 4 Projektilen (oder mehr weil wenn alle einen AA machen ist sie nach 0,5s weg) \nDas wäre mal ein konstruktiv Änderungsvorschlag :)","replies":[{"poster":"Sihari","date":"2016-12-10T10:09:19.313+0000","up_votes":1,"down_votes":0,"body":"Jap, das ist ne gute Idee! ^-^","replies":[]}]},{"poster":"StillYasuoMain","date":"2016-12-09T05:34:03.832+0000","up_votes":1,"down_votes":2,"body":"So wie du das jetzt sagtst klingt das eher nach URF Yasuo. Auf lvl 18 hat die wall einen 18 Sekunden cooldown(das einzige item das cdr gibt ist triforce wenn man es kauft) \n\nWenn Yasuo zuvorderst ist, dann könnt ihr ihn einfach schnell wegpusten(full ad Yas). Wenn Yasuo die Wall für die Nami ult braucht dann hat er keine Wall mehr und der ADC oder APC kann ihn schnell wegpusten. Wenn Yasuo aber die Wall macht und ihr alle eure Ults in seine bereits stehende Wall castet dann seid ihr selber Schuld. Kannst ja mit blitz auch keinen Darius ins team hooken.\n\nSei froh dass Yasuos Wall verbuggt ist und manchmal projektile hindurchgehen.","replies":[{"poster":"Sihari","date":"2016-12-09T10:39:26.845+0000","up_votes":1,"down_votes":0,"body":"Wo klingt das denn bitte nach Urf? xD \nÜber den CD hab ich doch gar nichts gesagt! ;)\n\nDir ist schon klar, das Yasuos Wall da 4 Sekunden rum steht, nachdem sie gecastet wurde und in der Zeit JEDES Projektil abfängt, egal von welcher Richtung es kommt? \nDa gibts kein \"wenn er seine Wall dafür benutzt, dann könnt ihr in einfach wegratzen\". Dann steht da 4 Sekunden ein Ding, dass den Teamfight teilt und an dem man nicht vorbei kommt, ohne sich schlecht zu positionieren, während die Gegner da einfach durchballern. In 4 Sekunden ist ein Teamfight entschieden und es ist pups egal wierum die Wall in diesen 4 Sekunden steht. Irgendwen hindert sie daran, wichtige Spells zu casten und der Yasuo muss nicht mal darüber nachgedacht haben wen er jetzt blocken möchte.\nEs macht einfach keinen Spaß gegen ein Schild zu spielen, dass anders als alle anderen nicht für einen bestimmten Spell getimed werden muss. Braum kann mit seinem Schild doch auch nur ein Projektil negieren und alle anderen muss er brav selbst tanken. Sivir kann auch nur in einem sehr kurzen Zeitfenster nach dem ersten Treffer noch einen zweiten Spell schlucken und um all diese Mechaniken kann man sehr gut herum spielen. Da gilt wirklich \"wenn der das Schild für die Nami Ult genutzt hat, dann ist der jetzt aber lecker und schutzlos. >:3 \" \nAber nicht bei Yasuo...\n\nUnd zum Abschluss: Was ist \"sein froh dass er verbuggt ist\" denn für eine Aussage? Mal ganz abgesehen davon, dass ich noch nie beobachten konnte wie ein Projektil durch die Wall durch kam, ist das das blödeste, was du in dieser Diskussion bringen könntest. Bugs sind keine Möglichkeit um ungesunde Mechaniken abzuschwächen! \nWenn man sie irgendwie sinnvoll im Fight reproduzieren könnte, dann hat das trotzdem nichts mit Outplay zu tun, sondern dann ist das stumpfes Bugusing und gehört bestraft...","replies":[{"poster":"StillYasuoMain","date":"2016-12-09T11:13:07.587+0000","up_votes":2,"down_votes":2,"body":"Genau wie du sagtest bleibt die Wall für 4 Sekunden an der genau ** gleichen Stelle**. Wenn man die Wall mit Nami vergleicht, kann sie sich obwohl sie keine Beine hat bewegen genau wie alle anderen Champions. \n\n\"Talyahs Wall ist OP weil ich einfach nicht drüberkomme egal wie viel ich rechtsklick klicke\" \n\nDas ist jetzt nicht böse gemeint aber was Yasuo angeht bist du einer von denen,  die nur seine Stärken sehen. Kurz gesagt: Retarded","replies":[{"poster":"OrangeBubble","date":"2016-12-09T12:16:30.948+0000","up_votes":2,"down_votes":0,"body":"Das Ding ist, lieber Yasou Main, durch eine Taliyah Wall kann ich DMG anbringen und mich verteidigen UND der Gegner kann auch nicht einfach durch die durch rennen. Bei der Yasou Wall bin ich für 4 Sekunden gezwungen, um sie herum zu spielen, was bedeutet, schlechte Positionierung ..... Wärend SEIN Team durch die Wall ballern kann, was das Zeug ist. Daher ist dein Vergleich Taliyah Wall und Yasou Wall vollkommener Bullsh.it ~\n\nWie wärs damit, die Wall bleibt nur noch 1-2 Skunden stehen und kann weiterhin alles blocken. DAS würde dann gute Yasou's von schlechten Yasou's trennen ~","replies":[{"poster":"Mi3zekatze","date":"2016-12-10T08:05:05.819+0000","up_votes":1,"down_votes":0,"body":"Auch eine gute Ändernung!","replies":[]}]},{"poster":"Sihari","date":"2016-12-09T12:07:39.031+0000","up_votes":1,"down_votes":0,"body":"Wie ich schon sagte ist es gar nicht so einfach, sich an der Wall vorbei zu bewegen, wenn man so squishy ist wie Nami oder ein ADC. Im Normalfall stehen die beiden nicht umsonst da wo sie stehen. Man nennt es auch Positioning.\nUm an der Wall effektiv vorbei zu kommen, müssten die beiden sich aktiv auf den Gegner zu bewegen, den sicheren Abstand zu allem, das sie super einfach umbolzt, verringern und vor allem DIREKT an Yasuo vorbei. Dabei ist doch das sicherste Counterplay gegen ihn und sein verdammt tödliches Wesen ihn NICHT an dich ran zu lassen. Mach ihn alle bevor er dich alle macht ist wie bei allen anderen Assasins die Deviese.\nMal ganz abgesehen davon, dass dieses umpositionieren auch noch ne Menge wertvolle Zeit kostet, von der wir ja schon etabliert hatten, dass es im Teamfight davon nicht genug gibt.\n\nDu hast inzwischen klar gemacht, wie oft du Yasuo spielst, aber was ich nicht weiß ist, wie oft du gegen ihn antreten musstest.\nWie oft warst du schon der Squishy auf der anderen Seite der Windwall? Wie sehr hast du dich schon damit auseinander gesetzt wie diese Wall auf deine Gegner wirkt? Welche Effekte hat diese Wall neben dem offensichtlichen \"ich fange jetzt 4 Sekunden alles ab, das hier vorbei fliegt\"?\nIch weiß sehr wohl, dass Yasuo auch ein paar Schwächen hat, aber die Windwall ist eindeutig keine davon. Wenn du also denkst, dass mit dieser Fähigkeit alles in Ordnung ist, weil du sie oft nutzt und dir der Champ Spaß macht, dann bist du der, der hier \"retardet\" ist. (Das ist übrigens keine nette Wortwahl, weswegen ich mich für den Gebrauch davon entschuldigen möchte.)\n\nZur Talyah-Wall: Ja, das Ding ist eindeutig stärker als alle anderen geländeerzeugenden Fähigkeiten und deswegen ist es auch ne Ult. Außerdem muss eine Taliyah das Ding auch schlau setzen um nicht dem eigenen Team zu schaden. Der Vergleich mit der Windwall hinkt also gewaltig.","replies":[{"poster":"Mi3zekatze","date":"2016-12-10T08:04:33.587+0000","up_votes":2,"down_votes":1,"body":"Also grade als Nami etc. Ist es sehr easy die Yasou wall zu umgehen! Wenn er sie einmal gesetzt hat ist er den rest des fights schutzlos und so gut wie tot da sind wir uns einig.\nWenn yasou seine Wall setzt dann ist von allen der normale Reflex = zurückgehen. Und was macht der Yasou jtz? Wie will er rankommen? Der fight hat sich nen bisschen nach hinten verlagert (wieso gibt es keine Messeinheit in lol??) Und yasou hat keine wall mehr das sollte doch jtz nicht das Problem hier sein!? \nOkay wer in Yasou reinläuft sollte sich bevor er sagt OPOPOOOOPPOP sich vllt Gedanken machen wo er gerade steht!","replies":[{"poster":"StillYasuoMain","date":"2016-12-11T01:25:15.707+0000","up_votes":1,"down_votes":0,"body":"Du meinst wohl, ohne Wall kommst du nicht in den Fight rein ohne schonmal die  Vayne E in Gesicht zu kriegen und damit bis ins Jenseits fliegen. \n\nDie Masseinheit in LoL sind entweder Einheiten(Yasuos AA Range ist 175 Einheiten) oder Teemos(Quadrat in grösse von Teemos Grundriss)","replies":[]},{"poster":"Sihari","date":"2016-12-10T10:08:26.177+0000","up_votes":1,"down_votes":0,"body":"Es ist gar nicht so einfach wie du denkst als Nami um eine Windwall herum zu spielen. xD\n3 ihrer Fähigkeiten werden aktiv von den Ding geblockt und eine passiv, wenn der, der von ihrer E gebufft wurde, durch die Wall ballern möchte.\nDadurch, dass die Wall und die Ult beide sehr breit sind muss man zB deutlich länger überlegen, wie man die Ult nun setzt wenn da irgendwo ne Wall steht, weil die Ult ja schon verpufft wenn die Ränder der beiden Hitboxen sich streifen. Meist ist es gar nicht möglich so effektiv zu ulten um mehr als einen Gegner zu erwischen.\nDie W hat nach dem ersten Cast auch eher ein eigenleben und wenn der Gegner nahe genug an der Wall bleibt, dann kann eine Nami auch nicht mehr dafür sorgen, dass wirklich 3 Leute vom Spell getroffen werden, was dann in rausgeschmissenem Mana endet.\nBei der Q ist es noch ok, da sie recht schmal ist und geradlinig zu ihrem Zielort fliegt.\nDie ganzen Probleme könnte man zwar verhindern in dem man dem Yasuo auf die andere Seite der Wall folgt, aber wie ich schonmal sagte ist das meist keine gute Idee. Lieber lasse ich den Tank vorn verrecken als zusätzlich noch mit in den Tod gerissen zu werden, weil ich zu weit vorn stand. Denn tot ist eine Nami gar keine Hilfe mehr...","replies":[]}]}]},{"poster":"D4RKEVA","date":"2016-12-09T12:35:58.551+0000","up_votes":2,"down_votes":1,"body":"Die windwall ist halt busted\n\n\nder adc ist entweder 4 sekunden useless trotz mega positioning oder geht risky rein und droht zu sterben damit er dmg macht in den 4 sekunden","replies":[]}]},{"poster":"Mi3zekatze","date":"2016-12-10T07:59:10.841+0000","up_votes":1,"down_votes":0,"body":"Naja ich habe bisher dir immer zu gestimmt aber du willst dich hier doch nicht ernsthaft über das TEAMFIGHT potenzial eines Yasous ärgern oder?? Yasou ist useless im teamfight und das wissen wir alle (Ausnahme 5mann Ult)","replies":[{"poster":"StillYasuoMain","date":"2016-12-10T20:19:02.869+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xtaktiq,realm=EUW,application-id=Wj1wcocU,discussion-id=belM4Aw1,comment-id=0007000000000001,timestamp=2016-12-10T07:59:10.841+0000)\n>\n> Naja ich habe bisher dir immer zu gestimmt aber du willst dich hier doch nicht ernsthaft über das TEAMFIGHT potenzial eines Yasous ärgern oder?? Yasou ist useless im teamfight und das wissen wir alle (Ausnahme 5mann Ult)\n\nAktuell ist es ziemlich hoch, aber nicht zu hoch :)","replies":[]},{"poster":"Sihari","date":"2016-12-10T09:56:47.599+0000","up_votes":1,"down_votes":0,"body":"Ich hab nie gesagt, dass Yasuo der Brüller im Teamfight ist. ;3 \nNur, dass die Wall so wie sie jetzt ist einen solchen entscheiden kann und in einigen Fällen auch eindeutig schon getan hat.","replies":[]}]}]},{"poster":"Mi3zekatze","date":"2016-12-10T07:54:08.810+0000","up_votes":1,"down_votes":0,"body":"Was buggt den durch die Wall durch? Das der lux laser durchgeht ist klar weil es kein Projektil gibt.\nGibt es echt nen Bug?","replies":[{"poster":"Falcoon","date":"2016-12-12T10:59:57.173+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xtaktiq,realm=EUW,application-id=Wj1wcocU,discussion-id=belM4Aw1,comment-id=000700000001,timestamp=2016-12-10T07:54:08.810+0000)\n>\n> Was buggt den durch die Wall durch? Das der lux laser durchgeht ist klar weil es kein Projektil gibt.\n> Gibt es echt nen Bug?\n\nMeines logischen Verständnisses nach ist eine Nami Ult kein Projektil. Genauso wenig wie ein lanebreites Aurelion Sol Q. Jedenfalls nach meiner Definition. Was Riot da als Projektil definiert keine Ahnung. Und trotzdem schluckt die Windwall beide Skills problemlos und das unabhängig davon ob die Wall unmittelbar davor gecastet wurde oder bereits 3 Sekunden steht. In der vierten ist trotzdem die Ult oder das Q verpufft.","replies":[{"poster":"Sihari","date":"2016-12-13T01:27:06.737+0000","up_votes":1,"down_votes":0,"body":"Als Projektil zählt alles, dass wandert bevor es wirkt, während alles, was sofort im gesammten Wirkungsbereich gleichzeitig wirkt ein AOE-Spell ist.\nDie Nami-Ult ist dadurch ein eindeutiges \"Projektil\" auch wenn man sie im RL nicht als solches bezeichnen würde. ^-^\n\nAber es stimmt schon: es ist ärgerlich, dass die Wall beide sauber vorbereiteten Skills einfach so schluckt.","replies":[]}]},{"poster":"StillYasuoMain","date":"2016-12-10T08:48:42.035+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xtaktiq,realm=EUW,application-id=Wj1wcocU,discussion-id=belM4Aw1,comment-id=000700000001,timestamp=2016-12-10T07:54:08.810+0000)\n>\n> Was buggt den durch die Wall durch? Das der lux laser durchgeht ist klar weil es kein Projektil gibt.\n> Gibt es echt nen Bug?\n\nManchmal passiert es dass projektile hindurchgehen wenn Yasuo etwas nahe(aber immer noch dahinter) der wall steht oder wenn das Projektil nahe am Rand der Wall trifft.\n\nhttps://m.youtube.com/watch?v=LUyDGnGNRyc\n\nAuch ein Vorteilhafter Bug gibt es(hatte ich selbst auch schon)\n\nhttps://m.youtube.com/watch?v=OxtDg1tCgZk\n\nDieser ist auch gleich einen Beweis, dass die Wall etwas hinter Yasuo gecasted und weniger weit hingesetzt wird als es ausssieht. Deshalb sind auch die 2 anderen Bugs.\n\nMan müsste also nur das Wall cast positioning um ca 10 nach vorne setzen und schon wärs gefixt.","replies":[]}]}]}]},{"poster":"Killerkante","date":"2016-12-08T21:33:24.296+0000","up_votes":3,"down_votes":2,"body":"Ich entschuldige mich om Vorraus schonmal für die schroffheit im folgenden Text.\n\n>Ich bin mit einem total von 500k points ein Yasuo main.\nYasuo war schon immer ein Champ, der extrem viel und schwere mechanics hatte die halt ungeheuer viel Spielspass bieten. Was jedoch jetzt und auch bei Tank Yasuo der Fall war: Auch schlechte Spieler konnten mit Yasuo abgehen, da er auch ohne advanced Mechanics \n\nIch bitte euch, am liebsten jeden der DAS tut.\nKommt nicht an mit \"Ich bin blabla Main, ich weiß ALLES über ihn\", sowas kommt leicht lächerlich und unnötig arrogant rüber, speziell wenn derjenige anscheinent nicht einmal wirklich rankeds zockt .. zumal (zu Yasuo selbst) eine mechanics auf sein komplettes kit gesehen für casuals geeignet ist, nicht für Anfänger aber jeder durchschnittliche Spieler kann seine lane mit ihm stompen ohne wirklich geübt zu sein mit ihm, auch ohne tankbuild, egal darum gehts auch nicht.\nAnhand deiner Aussagen im Text sehe ich auch dass du sicherlich auch kein high elo smurfer bist.\n\nNaja, mir ging es lediglich nur um den \"Einführungssatz\", habe mir daher nicht deine Ideen durchgelesen.\n\nPs: du brauchst auch nicht versuchen dich als Yasuo main ins grüne Licht zu schieben, das ist wie als würde ein Tokyo Hotel Fan damals in den 2000ern seine Band verteidigen wollen :d\n\n#nohate","replies":[{"poster":"StillYasuoMain","date":"2016-12-08T22:58:38.446+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Killerkante,realm=EUW,application-id=Wj1wcocU,discussion-id=belM4Aw1,comment-id=0006,timestamp=2016-12-08T21:33:24.296+0000)\n>\n> Ich entschuldige mich om Vorraus schonmal für die schroffheit im folgenden Text.\n> Yasuo war schon immer ein Champ, der extrem viel und schwere mechanics hatte die halt ungeheuer viel Spielspass bieten. Was jedoch jetzt und auch bei Tank Yasuo der Fall war: Auch schlechte Spieler konnten mit Yasuo abgehen, da er auch ohne advanced Mechanics \n> \n> Ich bitte euch, am liebsten jeden der DAS tut.\n> Kommt nicht an mit &quot;Ich bin blabla Main, ich weiß ALLES über ihn&quot;, sowas kommt leicht lächerlich und unnötig arrogant rüber, speziell wenn derjenige anscheinent nicht einmal wirklich rankeds zockt .. zumal (zu Yasuo selbst) eine mechanics auf sein komplettes kit gesehen für casuals geeignet ist, nicht für Anfänger aber jeder durchschnittliche Spieler kann seine lane mit ihm stompen ohne wirklich geübt zu sein mit ihm, auch ohne tankbuild, egal darum gehts auch nicht.\n\n> \n> Naja, mir ging es lediglich nur um den &quot;Einführungssatz&quot;, habe mir daher nicht deine Ideen durchgelesen.\n> \n\nGenau deshalb solltest du sie lesen, da der eine nerf nichts mit Offtank Yasuo zu tun hat. \nDu nennst mich einfach arroganter Angeber und betrachtest mich als möchte gern high elo Yasuo pro. Um dich selber ins grüne Licht zu schieben? :D","replies":[{"poster":"Killerkante","date":"2016-12-09T23:51:34.947+0000","up_votes":2,"down_votes":0,"body":"quatsch, ich mag des getue nur nicht nur weil jemand einen Champ maint, dass er denkt, er würde ALLES über ihn/sie wissen, ist nichts persönliches.\nIch hab damals z.B auch nen Champ gemaint mit dem ich meine Mitspieler auf der damaligen MMR gemoliert habe, war genauso von mir selber überzeugt bis mir jemand der wirklich gut war (yellowpete h3h3) gezeigt hat wie schlecht ich war.\nDas gute daran dass mich jemand auf'n Boden gebracht hat war, dass ich gemerkt habe wie viel Luft es noch nach oben gab.\n\n>Du nennst mich einfach arroganter Angeber und betrachtest mich als möchte gern high elo Yasuo pro.\n\nUnd ich nenn dich nicht so, es kommt nur so rüber wenn jemand so einen Thread anfängt, zumindest für mich.\nWenn du keiner bist brauchst du dich auch nicht angesprochen zu fühlen, ist halt nur der erste Eindruck den du ... wie gesagt zumindest mir vermittelst, will dich damit nicht angreifen .. auch wenn das absolut so klingt.\n\nDen Eindruck zu machen ist auch was ganz anderes als jemanden damit zu betiteln, also brauchst du dich um Grunde auch nicht angegriffen zu fühlen.","replies":[]}]}]},{"poster":"SchwarzerBimbo","date":"2016-12-08T21:29:42.376+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"StillYasuoMain","date":"2016-12-08T21:32:35.260+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SchwarzerBimbo,realm=EUW,application-id=Wj1wcocU,discussion-id=belM4Aw1,comment-id=0005,timestamp=2016-12-08T21:29:42.376+0000)\n>\n> Mall damage runter schrauben das nen jasuo nen full tank malphite in 4 sec killst ist echt zu op....\n\nNur weil Vayne jetzt eifersüchtig ist? :D","replies":[{"poster":"SchwarzerBimbo","date":"2016-12-08T21:42:41.236+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Staatsanwalt","date":"2016-12-09T07:08:15.632+0000","up_votes":1,"down_votes":1,"body":"Wenn wir schon dabei sind, dann sollte ein Fulltank Malph einen Adc nicht mit einer Kombo aus dem Leben knallen können. Und eine Malph Kombo dauert weit weniger als 4 Sekunden.","replies":[{"poster":"SchwarzerBimbo","date":"2016-12-09T09:42:30.761+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"D4RKEVA","date":"2016-12-09T11:55:33.958+0000","up_votes":1,"down_votes":0,"body":"ein full tank map (mit gaunlet) töten nen adc in 3 sekunden\n\nR e q aa w aa aa aa \n\n\nDer adc kann da gerne nen qss haben ... Das hilft nich wirklich","replies":[{"poster":"SchwarzerBimbo","date":"2016-12-09T12:56:11.480+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"D4RKEVA","date":"2016-12-09T14:26:14.385+0000","up_votes":2,"down_votes":0,"body":"Allg ja\n\nAber er macht sofort nen 1000 dmg burst auf ne squishy(der dann kein ms/as) mehr hat und davor noch cc'd ist\n\nheißt der malphite macht immer noch schön 100-300 dmg mit jedem aa was den adc schnell killen kann\n\nMit nem peel champ wird der malp natürlich den adc nicht töten, wobei ein assassin mit dem maph gegen adc/supp auch wieder gewinnt","replies":[{"poster":"SchwarzerBimbo","date":"2016-12-09T15:07:32.785+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"D4RKEVA","date":"2016-12-09T15:18:38.718+0000","up_votes":1,"down_votes":0,"body":"naja mundo ist da auch nicht netter\n\nim mid stirbt er eig nie gegen 90% der adcs kiltl diese aber in 3 sekunden \n\nq aa e aa q aa und der adc ist schon mega low","replies":[]}]}]}]}]}]}]}]}]}]}]}