{"poster":"StillYasuoMain","date":"2016-05-10T15:24:52.286+0000","title":"Was haltet ihr von diesen champs?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo Leute\n\nIch musste nun ein paar mal gegen diese champs spielen oder sie wurden extrem viel gebannt(Bemerkungen kommen alle von mir und sind meine Meinungen):\n\n- **Malzahar**(habe ich schon einmal gefragt und er ist anscheinend zurzeit definitiv op)\n\n- **Zed**. Ich finde er ist nun viel st&auml;rker da qss nun useless gegen ihn ist. Zudem fand ich ihn vorher schon recht stark seit {{item:3147}} rausgekommen ist.\n\n- **Fizz**. Ich finde ihn der nervigste, unskillendste und einer der st&auml;rksten champs in lol(meine Meinung). Auch in pro plays geht er h&auml;ufig ab. Er kann mit seiner e wichtige spells dodgen, er ist mobil, hat ein &quot;double&quot; gratis flash, viel dmg, lowe CDs, skillshot ult durch minions die slowt und den schaden auf das Ziel erh&ouml;ht, ein point and click dash und starke und blutende autoattacks. Was sagt ihr zu fizz?\n\n- **Darius**. Wenn man weiss wie man ihn spielt und der richtige moment im teamfight kommt ist er krass stark(ein Beispiel:  WM 2015 erstes game von c9 vs fnc m&uuml;sst ihr den Sieg anschauen). Doch da ich yasuo main bin sage ich besser nichts &uuml;ber starke teamfights xD\n\n- **Annie**. Sie hat zwar immer noch kein escape, doch bei ihrem mage update sehe ich nichts von nerfs sondern nur buffs(w&auml;r nett wenn mir jmd sagen k&ouml;nnte ob was generft wurde). Ihre ulti ist jetzt noch schlimmer als zuvor und mit 3 stacks + flash + e + ult + w kann man den/die carry(s) sofort ausschalten. Findet ihr sie nun auch zu stark?\n\nEdit: Akali hab ich vergessen^^ Finde ihre Anzahl ults und der cd davon + der full cdr bei kills/asssists einfach krass stark und ihre q dealt massiven schaden mit einer abklingzeit zwischen 3 und 5 sekunden. Ihre W ist ne Art ein aoe slow mit 5 Sekunden unsichtbarkeit und lauftempobonus. Ihre E lässt sie gut farmen und ihr lifesteal/spellvamp(jetzt % heal des schadens) find ich auch op. Ich freute mich auf den neuen hextechrevolver. Jetzt hat sie aber einen nur noch hoheren burst...\n\n\nmfg","replies":[{"poster":"Nohgolgh","date":"2016-05-12T00:35:17.231+0000","up_votes":2,"down_votes":0,"body":"Ich hatte auch alnge Zeit Probleme mit Zed. In letzter Zeit läuft es aber richtig gut. Also erstmal denke ich, dass er ein großer Gewinner von Patch 6.9 ist. Zhonias hat nun 120 Sekunden Cooldown und QSS entfernt seine Ulti nicht mehr. Außerdem wird durch die wertvolleren Drachen (gerade Feuer und Wasser) ein Snowballing auf der Midlane doch schon recht stark belohnt. Die Dämmerungsklinge finde ich tatsächlich nicht so megatoll, einfach aus dem Grund, dass sie nicht so wirklich systematisch einsetzbar ist (passiver effekt mit 120 Sekunden Cooldown). Aber Zed hat auch große Schwächen. Zum Beispiel hat er keine Passive, wenn du nicht unter 50% Leben gehst. Tränke {{item:2033}} helfen also in der Frühphase viel. Auch ist sein Schatten mit einem langen Cooldown besehen. Wenn er seinen Schatten also offensiv verwendet, verliert er relativ lange (~20 Sek am anfang im late immer noch 10 Sek mit CDR) seinen Escape. Er bettelt also dann förmlich darum, dass man ihm dann ins Gesicht haut. Seine Ulti hat einen langen Cooldown und seine Energie ist im Late recht schnell leer, wo er auch generell abfällt.  \n\nFizz hat viel Potenzial zum dodgen und outplayen, gerade in Verbindung mit Zhonias. Deswegen bin ich mir aber auch nicht sicher, ob er jetzt wirklich stärker ist als zuvor. Er kriegt jetzt zwar seinen Cooldown früher zusammen,  aber verliert dafür AP im late und hat einen höheren Cooldown auf dem Stundenglas zu verkraften. Nach wie for gilt, dass er, wenn er einmal CC abkriegt relativ schnell down ist. Schon ein Morgana Snare verhindert für 3 Sekunden, dass er zwei seiner Fähigkeiten einstzen kann, ein Stun richtet oft noch größeren Schaden an. Außerdem fehlt ihm am Anfang der Waveclear. In der Laningphase gilt also: Pushen (wenn es ohne große Risiken möglich ist) und sich nicht töten lassen. Es wird momentan diskutiert, ob der Hextech-Protobelt01 nicht allerdings zu stark auf den mobilen Champions sein wird, im Sinne von Hindashen-dann den Protobelt mit 7 Projektilen treffen und 300  +77% Ap Schaden machen und dann entweder weiter auf den Gegner einkloppen oder wieder sicher rausdashen. Man hat als mobiler Burstchampion dann einfach noch einen guten zusätzlichen Spell mit nicht zu hohem Cooldown. Das betrifft dann aber nicht nur Fizz sondern auch Ahri und LeBlanc. Bisher kann ich das noch nicht bestätigen oder widerlegen, die Sache mit dem Protobelt ist bisher eher theoretischer Natur, aber WENN einige Leute diese Combo wiederholt durchkriegen, dann wird dieser Gegenstand den ADC komplett zerpflücken.\n\nDarius in Teamfights finde ich tatsächlich nicht so gut, der Typ kann nur rennen und daher recht einfach von den Tanks und dem Support aufgehalten werden. Seine Laningphase is jedoch recht stark am Anfang. Wenn du Nasus als first Pick nimmst und dir dann ein Darius auf die Fresse haut, bist du aber meines erachtens selbst Schuld. Solide Leistungen gegen Darius hast du z.B mit Nautilus (Festhalten, Schild und Escape aus dem Nahkampf mit dem Haken auf Terrain), Trundle (guter Sustain, ich klaue deine Tank-Stats, gute Mobilität und gleichzeitige Immobilisierung des Gegners dank W und E), Irelia ( guter Sustain, gute und sehr lange CC zum Escapen [wenn du weniger Hp hast als Darius], ein Q um aus der Range zu kommen) und Cho'Gath (gute CC, die auf Range gecasted wird, seine Ult macht auch absoluten Schaden). Ansonsten sollte man gerade am Anfang längere Kämpfe vermeiden- die bluten dich wortwörtlich nur aus. Nicht zu low droppen-sein Ult macht absoluten Schaden. Wenn er seine Q benutzen will und man es nicht heraus schafft, ist es immer eine Möglichkeit zu Darius hinzugehen-man vermeidet damit eine Menge Schaden und die Blutung und kann dann vergleichsweise entspannt herauskommen, da die Q ja nun für 5 Sekunden nicht verfügbar ist. Was halt nicht passieren darf ist folgendes Szenario:\n\n-Du kriegst in Folge eines Trades eine Menge Autoattacks von ihm ab und hast schon drei Stacks Blutungen gesammelt. \n-Nun versuchst du panisch wegzukommen.\n-Er zieht dich zu sich hin. Du versuchst immer noch panisch wegzukommen.\n-Beim Rausgehen verkrüppelt er dich und macht seine Q und trifft dich mit der Klinge. Du bist nun bei maximaler Blutung, geslowt und auf der Flucht. er hat sich durch seinen Treffer mit der Q um 15% seines maximalen Lebens geheilt, was vermutlich mehr ist, als du im anfänglichen Trade an Schaden gemacht hast. \n-Er bearbeitet dich weiter mit Autoangriffen. Du kommst nicht weg, weil du verlangsamt bist. \n-Du schaffst es bis zum tower, hast aber 75% deines Lebens verloren. \n-Er setzt dir unter dem Turm mit der Q und dann mit der Ult nach, die wegen der Blutungen auch noch doppelten Schaden verursacht.\n-Du bist tot. \n\nBesser ist das Folgende:\n-Du spielst nicht agressiv ohne Grund (ein Grund wäre, dass dein Jungler in der Nähe ist). \n-Er schafft es, dich mit seiner W zu dir hinzuziehen (das kann durchaus passieren). \n- Du verpasst ihm einen Stun/Silence/Knockup und läufst einfach raus, eventuell kriegst du vorher noch einen Autoangriff durch. \nOder\n- Du gibst dir einen Schild. Er slowt dich (Blutung 1)\n-Du versuchst herauszugehen. Er benutzt seine Q. Um Blutungen und seinen Heal zu vermeiden gehst du wieder zu ihm hin und verpasst ihm einen Autoangriff. Möglicherwise kriegst du einen Autoangriff ab (Blutung Nummer 2)\n-Alle seine Skills sind auf Cooldown, du kommst nun recht einfach heraus. Du hast den Trade vielleicht nicht gewonnen, aber auch nicht sonderlich viel Schaden genommen und kannst dank des besseren Sustains und deiner besseren Skalierung dich in 15 Minuten rächen. \n\nZu den anderen kann ich nicht sonderlich viel sagen: Malz ist permanent gebannt, Annie habe ich seit dem Rework genau einmal bekämpfen müssen und Akali noch gar nicht.","replies":[{"poster":"StillYasuoMain","date":"2016-05-12T14:11:53.996+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nohgolgh,realm=EUW,application-id=Wj1wcocU,discussion-id=dvNmEZ2c,comment-id=0005,timestamp=2016-05-12T00:35:17.231+0000)\n\nDanke für die vielen Tipps und Mühe:D","replies":[]}]},{"poster":"Doo ","date":"2016-05-11T21:52:19.561+0000","up_votes":2,"down_votes":0,"body":"Seit dem Mage-Update kam ich nicht ein einziges Mal dazu Malzahar zu spielen, da er IMMER gebannt ist. {{champion:32}}","replies":[{"poster":"StillYasuoMain","date":"2016-05-12T14:12:45.347+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Supporta,realm=EUW,application-id=Wj1wcocU,discussion-id=dvNmEZ2c,comment-id=0004,timestamp=2016-05-11T21:52:19.561+0000)\n>\n> Seit dem Mage-Update kam ich nicht ein einziges Mal dazu Malzahar zu spielen, da er IMMER gebannt ist. {{champion:32}}\n\nEr wird im 6.10 hart generft. Also viel spass dann^^","replies":[]}]},{"poster":"SeaHorseCalamity","date":"2016-05-10T18:36:38.102+0000","up_votes":1,"down_votes":0,"body":"Malz: seit Rework nicht gespielt, kann also nichts dazu sagen.\nZed: Hat Tonnenweise Counterplay. Er stompt eigentlich nur, wenn du diese Möglichkeiten nicht nutzt oder er dich counterpicken konnte. Vor lvl 3 macht er auch fast nichts und richtig gefährlich ist er erst ab lvl 6. Da Zhonyas billiger ist, ist das eine gute Möglichkeit gegen ihn zu überleben. Im Late ist er übrigens nciht so toll.\nFizz: Nicht so einfach wie viele danken. Du wirst meist outfarmed, da du am Anfang wenig zu melden hast als Fizz. Mit e kann er zwar gut Ausweichen, allerdings kann man dem E ebenfalls ausweichen, da das Ding sehr langsam ist. Von der Ult sollte man sich nicht treffen lassen, sonst stirbt man halt. Gegen einen Assassinen nichts ungewöhnliches. (ist nun mal bei vielen Ultis so, hmm?) Zudem ist er immernoch ein unglaublich zerbrechlicher Nahkämpfer.\nDarius: Kite ihn und sein Spielspaß sinkt. Bisschen Fokus auf ihm ist auch nicht verkehrt, wenn er zu offensive Items kauft.\nAnnie: Wenn du in Tibbers-Reichweite bist stirbst du halt. Wenn nicht stirbst du nicht. (außer das Rework hätte viel an dem Prinzip geändert)\nFlash+Tibbers ist deshalb auch fast der einzige Weg mit Annie Leute zu töten. {{item:3102}}  hat auch ncoh nie geschadet.","replies":[{"poster":"StillYasuoMain","date":"2016-05-10T20:30:34.426+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bIoody Encore,realm=EUW,application-id=Wj1wcocU,discussion-id=dvNmEZ2c,comment-id=0002,timestamp=2016-05-10T18:36:38.102+0000)\n>\n> Malz: seit Rework nicht gespielt, kann also nichts dazu sagen.\n> Zed: Hat Tonnenweise Counterplay. Er stompt eigentlich nur, wenn du diese Möglichkeiten nicht nutzt oder er dich counterpicken konnte. Vor lvl 3 macht er auch fast nichts und richtig gefährlich ist er erst ab lvl 6. Da Zhonyas billiger ist, ist das eine gute Möglichkeit gegen ihn zu überleben. Im Late ist er übrigens nciht so toll.\n> Fizz: Nicht so einfach wie viele danken. Du wirst meist outfarmed, da du am Anfang wenig zu melden hast als Fizz. Mit e kann er zwar gut Ausweichen, allerdings kann man dem E ebenfalls ausweichen, da das Ding sehr langsam ist. Von der Ult sollte man sich nicht treffen lassen, sonst stirbt man halt. Gegen einen Assassinen nichts ungewöhnliches. (ist nun mal bei vielen Ultis so, hmm?) Zudem ist er immernoch ein unglaublich zerbrechlicher Nahkämpfer.\n> Darius: Kite ihn und sein Spielspaß sinkt. Bisschen Fokus auf ihm ist auch nicht verkehrt, wenn er zu offensive Items kauft.\n> Annie: Wenn du in Tibbers-Reichweite bist stirbst du halt. Wenn nicht stirbst du nicht. (außer das Rework hätte viel an dem Prinzip geändert)\n> Flash+Tibbers ist deshalb auch fast der einzige Weg mit Annie Leute zu töten. {{item:3102}}  hat auch ncoh nie geschadet.\n\nZed verstehe ich manchmal einfach nicht wegen den vielen Tryhards. Hab mal crit zed gespielt und ging richtig ab. Doch wenn man mit 0/10 und 100 cs(etwa) mit einer e + aa jemanden killt finde ich das nicht normal...keine ahnung mehr was der baute. Glaub deathdancer und noch etwas.\n\nFizz hab ich schon selber gespielt. Hatte jedoch immer w vor e und q gemaxt xD. Ausser in meinem ersten game(hab ich im guide nachgeschaut), da hatte ich e, q, w gemacht und war ständig legendary also schwer naja...werde ihn morgen mal wieder spielen:)\n\nDarius: Hast warscheinlich recht. Er darf einfach beim focus dann seine Q nicht hitten.\n\nAnnie: Musste heute gegen die spielen mit Yasuo. Ist echt schwer aber es stand immer so gleichstand zwischen uns, da ich sie relativ einfach outplayen konnte.\n\nBanshee mit Yasuo? Hab mir lieber hexteinkerund qss gekauft^^, doch leider hat die qss nichts entfernt. 3 Leute stunnten mich, ich drück qss und bleib gestannt... wie auch immer:)","replies":[]}]},{"poster":"CCG Inu XIII","date":"2016-05-10T19:23:06.702+0000","up_votes":1,"down_votes":0,"body":"Akali? Srs?! Die is grade sowieso recht im Eimer, da es stärkere Assassins gibt. Sie hat 0 Escape und ihre einzige Defensive lässt sich mit 75 Gold countern Oo\n\nZed ist da mindestens 5x schlimmer...oder Ekko...oder Lb...oder (Enter random Assassin with escape here)\n\nUnd zum Revolver...ich habs schon seit der Ankündigung gesagt, dass das Revo update sie nur stärker macht nich schwächer :3\n\nHält mich trotzdem nicht davon ab sie weiterhin zu mainen :3","replies":[]},{"poster":"Nebeltänzer","date":"2016-05-10T17:02:00.405+0000","up_votes":1,"down_votes":0,"body":"Malzahar und Annie hatte ich seitdem im Aram im Gegnerteam.\nAnnies Tibbers hat jetzt zwar nicht mehr diesen direkten Burstschaden, ist dafür aber über die Dauer sehr unangenehm geworden, vor allem wenn er enraged wird.\n\nMalzahar: Den Werten nach und alles schon extrem stark, wobei heute ja auch ein Hotfix liveging, wie ich gelesen hab, der ihn etwas generft hat. War aber dennoch machbar. Aber ja, sein Schaden ist echt abartig geworden.\n\nFizz: Hat mich schon immer genervt, und ich banne ihn nicht selten. :D Ich hasse ihn. Ungefähr so wie Yi (Auch, wenn der erst richtig gedroppt ist durch Ragebladenerf + Entfernung des Devourers)\n\nDarius: Mag ich nicht, ist nervtötend, aber manageable. Solange man es schafft, ihm den Heal seiner Q zu verwehren.\n\nZed: Als Midlaner hatte ich sowieso keine Probleme mit ihm. Und ansonsten... hatte ich auch selten ne QSS dabei, dementsprechend: Nervig, vor allem durch seine extreme Mobility + Escapemöglichkeiten, aber manageable, dagegen zu spielen. (Wenn auch etwas erschwert worden in den letzten Patches)","replies":[]},{"poster":"König der Möwen","date":"2016-05-10T15:52:33.523+0000","up_votes":1,"down_votes":0,"body":"Malzahar wurde ja gerade eben ein bisschen abgeschwächt, mal schauen wie sich das dann so anfühlt.\n\nZed ist halt immer noch ein Assasine, er springt rein oneshottet jemanden und dann ist er eigentlich auch ziemlich useless mit oder ohne qss.\n\nFizz ist schon ein ziemlicher Nerv-Champ aber auch ziemlich squishy, zumal er im Late Game nicht mehr viel ausrichtet.\n\nDarius ist schon ein sehr starker Champion keine Frage, aber er hat keinen wirklichen CC oder Escape \n\nAnnie habe ich persönlich seit dem update noch nicht als Gegner gehabt aber laut Patch Notes ist der DMG von Tibbers stark runtergegangen und dadurch macht er nun mehr Autoattacks, keine Ahnung ob das jetzt viel ausmacht aber wie du schon sagtest sie hat selber keinen Escape und ohne ihre Combo ist sie vollkommen useless.","replies":[]}]}