{"poster":"T3chy","date":"2015-08-12T14:44:58.389+0000","title":"Clan sucht Member, Teams und Unterstützung in der Leitung","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Guten Tag liebe Forum Leser,\r\n\r\nBevor ich euch etwas &uuml;ber dieses Projekt erz&auml;hle, m&ouml;chte ich mich kurz vorstellen und &uuml;ber meinen Werdegang in dieser Szene etwas sagen.\r\n\r\n&Uuml;ber mich:\r\n\r\nDie Leitung des Projektes werde ich &uuml;bernehmen, da ich schon im Clanleitungs- und Managementbereich mehrerer bekannter Clans aktiv mitgearbeitet habe, unter anderem bei German Gamer Society und Wildplay:\r\n\r\nhttp://ggs-clan.de/ \r\nhttp://wild-play.eu/ \r\n\r\nEbenso bin ich der Meinung, dass ich die richtigen Eigenschaften daf&uuml;r aufweise, wie Erfahrung, F&uuml;hrungsqualit&auml;t, Engagement und Aktivit&auml;t.\r\nIch stecke viel Zeit und Herzblut in diese Projekte, man wird mich also mehrere Stunden am Tag aktiv finden. \r\n\r\nBei weiteren Fragen an mich einfach anschreiben.\r\n\r\nZu diesem Projekt:\r\n\r\nIch habe 2 Ziele, welche ich beide bei diesem Projekt umsetzen m&ouml;chte\r\n\r\nErstes Ziel: Coaching\r\n\r\nLeague of Legends ist ein Spiel bei dem es, gerade als Anf&auml;nger, vieles zum Lernen gibt. Allerdings brauchen noch viele Leute im Bronze, Silber oder anderen Bereichen noch einen n&ouml;tigen ,,Anstupser&ldquo; um h&ouml;her zu kommen.\r\n\r\nDeshalb suchen wir sowohl nach Coaches als auch nach Sch&uuml;lern, um Unterst&uuml;tzung bei Fragen zu bieten, Fehler aufweisen zu k&ouml;nnen und euch es erm&ouml;glich, euch selbst aus eurer Elo raus zu carryn.\r\n\r\nMan kann freiwillig Coach werden, aber es wird &uuml;berpr&uuml;ft ob euer Game-Knowledge auch stimmt.\r\n\r\nZweites Ziel: Clanatmosph&auml;re\r\n\r\nBeim zweiten Ziel wollen wir eine Gemeinschaft aufbauen\r\n\r\nDas hei&szlig;t freundliche Leute am Abend zusammen spielen lassen und Freundschaften aufbauen.\r\nEs bedeutet ebenfalls, Teams aufzunehmen, zu scrimmen, kleine Events zu gestalten, Youtuber und Streamer zu unterst&uuml;tzen.\r\n\r\nMit einem Beitritt bei uns habt ihr auch Mal die Chance an einem neuen, jungen Projekt mitzuwirken. Wir sind ja derzeit erst eine Handvoll Spieler.\r\nDa wir noch sehr jung und klein sind brauchen wir auch noch Leute die uns direkt beim Aufbau helfen. Das hei&szlig;t wir suchen noch Verst&auml;rkung in der Leitung, Designer, Webmaster usw...\r\n\r\nWebmaster: Die einzige Voraussetzung ist das ihr Freude an eurer Arbeit habt und euch entsprechend auskennt.\r\n\r\nBereichsleiter: Du m&ouml;chtest nicht gleich einen Clan aufmachen aber dich um etwas k&uuml;mmern? Werde Leiter &uuml;ber dein Game! K&uuml;mmer dich um den LoL/Cs:go oder einen anderen Bereich!\r\n\r\nCommunity Admin: Zust&auml;ndig f&uuml;r das Suchen und Aufnehmen von Membern, das L&ouml;sen von Problemen usw....\r\n\r\nGrafiker: Zust&auml;ndig f&uuml;r Playersheets, Logos usw.\r\n\r\nWir verf&uuml;gen derzeit &uuml;ber einen Teamspeak Server und dieser wird in der Slot Zahl nicht eingeschr&auml;nkt sein.\r\n\r\nAnforderungen:\r\n\r\n-Aktiv\r\n-Geistige Reife\r\n-Enthusiasmus\r\n-Besitzen von Teamspeak\r\n\r\nErreichen k&ouml;nnt ihr uns &uuml;ber:\r\nDem Teamspeak Server: 78.46.176.5:9999\r\nDem Ingame-add: T3chy\r\nLiebe Gr&uuml;&szlig;e, Daniel/T3chy und der AGA","replies":[]}