{"poster":"xXBleachLord69Xx","date":"2016-06-02T01:24:14.154+0000","title":"Fears and slow resist","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Flame me if this has been raised before, but does anyone else think that slow resist shouldn&#039;t apply when being feared? I was playing a veigar game with Stormraider&#039;s, and right after I proc&#039;ed it, i got feared by Fiddle and sprinted headfirst into his tower behind me. It seems weird that you should be able to insec like this (or escape way too easily in other circumstances). i don&#039;t know if this is intended, but fear, being hard CC, seems like it should not have its slow component mitigted by slow resist. Niche, yes, but occasionally annoying for both the fear-er and the fear-ee.","replies":[{"poster":"fattyhotdogs","date":"2016-06-02T02:32:29.786+0000","up_votes":1,"down_votes":0,"body":"I don't understand what you're saying. If you moved faster you only would have sprinted to his tower faster and deeper","replies":[{"poster":"DipperOCE","date":"2016-06-03T14:14:47.462+0000","up_votes":1,"down_votes":0,"body":"That is his point. Stormraider's makes him immune to slows, meaning he sprinted towards the tower instead of the regular fear slow towards it. However, even though this is annoying it is not a bug, because it is intended technically.","replies":[]}]},{"poster":"Devils Advocate","date":"2016-06-02T02:34:10.995+0000","up_votes":1,"down_votes":0,"body":"It all falls under the tenacity bracket, but i have to double check the mechanic, does fiddle have an inbuilt slow or a speed increase to his fear? Haven't really seen much of him to consider this aspect deeply.\n\nThat being said, with resolve talents and merc treads. You're getting substantially less CC time on you, however, should you be using boots of swiftness which purely have increased speed and a slow resist built in, well i would imagine, any slows are affected, however since this mitigation does not apply to the fear itself. It's a full DR fear. Now if the fear has a minor speed increase mechanic, it's technically, not a debuff, unless it is built into the same mechanic as fear...\n\nEG, looking at your character debuffs, do you get a) slow icon/speed icon and b) fear icon, or is it just the fear, which when hovered over with the mouse to read the tooltip, has a slow built in. This mechanic means it has multiple effects under 1 application and the main mechanic takes priority, without merc treads. You may still encounter the slow even with boots of swiftness as the slow itself is not a stand alone debuff..\n\n\ni hope that makes sense, if i need to clarify just do a quick custom game and test the mechanic vs a bot and look for the debuffs. Or im sure some mighty elo player knows a bit more on the specifics of the mechanic. \n\nhowever, in general if you know what im saying from your end, it's probably just the same info, just better said.","replies":[{"poster":"JasonWazza","date":"2016-06-02T08:40:03.712+0000","up_votes":1,"down_votes":0,"body":">It all falls under the tenacity bracket, but i have to double check the mechanic, does fiddle have an inbuilt slow or a speed increase to his fear?\n\nThere is a slow involved with the fear\n\n>A unit that is fleeing (Feared) will move directly away from the source with 33% Slow reduced movement speed for the duration\n\nIt's why it's always funny to see a Master Yi being feared while ulting, cause he damn well fucks off.\n\nThe fear incorporates the slow, so any slow resists (IE stormraider's) drop the amount the slow works, and can effectively kill yourself.\n\nIt's an annoying thing when it happens, but is intended.","replies":[]}]}]}