{"poster":"Innocent Moon","date":"2019-11-04T02:25:20.091+0000","title":"¿Concejo para subir en tft?","subforum":"Teamfight Tactics","up_votes":10,"down_votes":1,"body":"Estoy en oro I y no puedo subir, en cada partida siento que la mayoría de jugadores esta sobre mi en cuanto a como jugar o que composiciones hacer. ¿Cuales son las mas fuertes actualmente? O cualquier concejo constructivo me ayudaría mucho","replies":[{"poster":"ManuelAlcayaga","date":"2019-11-04T03:03:24.592+0000","up_votes":6,"down_votes":0,"body":"esta es la composición mas fuerte actualmente:\nhttps://i.imgur.com/9F57ig4.png\ncoloca yuumi a aatrox junto con{{item:3026}} y {{item:3089}} \nasi con el buff de 6 hechizeros destrozas a todos.\n\nrespecto a tips de juego, en early prioriza juntar trios de campeones y arma una composicion base solida con esos trios, luego de eso economiza.\nsi te va mal en early y tienes cerca de 30hp, rolea todo a lvl 7 y trata de quedar top 4.\nsi te va bien en early rollea todo a lvl 8 y trata de ganar la partida, jamas rollees antes de lvl 7.\nsi aplicas eso deberias de subir a platino antes de que termine la season, por cierto te puedo garantizar que la composición es la mas fuerte ya que llegue a challenger 259lp usando solamente esa composición \nhttps://blitz.gg/tft/profile/la2/ManuelAIcayaga","replies":[{"poster":"Innocent Moon","date":"2019-11-04T03:58:18.254+0000","up_votes":3,"down_votes":0,"body":"Buenísimo, me quede bastante atrás en cuanto saber combinar y como proceder. Muchas gracias{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Shijim4 de Virgo","date":"2019-11-04T04:52:46.867+0000","up_votes":4,"down_votes":2,"body":"No fuerces una composición nunca, juega con lo que sale, consejo, siempre compra campeones del mismo tier (costo) si no te alcanza el oro para generar interes, asi aumentas la chance q te toque alguno que estas usando (ej: tenes 37 de oro, gasta esos 7 de oro alguno del mismo tier que el campeon que estas armando) total despues los vendes y no pierdes oro nunca. Pienza a futuro que items vas a querer y que compo esta usando el que va primero y segfundo","replies":[{"poster":"ManuelAlcayaga","date":"2019-11-04T14:22:15.830+0000","up_votes":3,"down_votes":0,"body":"> No fuerces una composición nunca, juega con lo que sale\n\nforzar una composicion es necesario para optimizar los items que vas armando orientada a esa composicion, por ejemplo si yo tengo claro que mi composicion final será \"caballeros imperiales\" entonces armo especificamente los items que me permitan maximizar la capacidad de carreo de draven, si no hago eso y armo items que son sub-optimos que podrian servir para otras composiciones seré derrotado por las personas que si tengan items optimos en sus composiciones forzadas.\nal forzar una composicion puedes reservar las unidades especificas de esa composicion desde early lo cual te permite aumentar tus probabilidades de juntar trios para transicionar correctamente en el midgame.","replies":[]},{"poster":"Glaceon","date":"2019-11-04T13:48:53.124+0000","up_votes":1,"down_votes":0,"body":"Cuidado con los últimos puestos, si estos son los que están ahorrando 50 de oro, cuando bajan a 20 lo gastan todo y se arman sarpada composición que matan a los primeros. A esos hay que revisarlos y pensar lo que ellos piensan hacer en el futuro.","replies":[]}]},{"poster":"KOHBEE","date":"2019-11-06T09:17:50.261+0000","up_votes":2,"down_votes":0,"body":"https://guiadeparche.com/composiciones-tft/mejores-composiciones-de-teamfight-tactics/\n\nEspero te sirve, es una pagina completísima, toda la informacion que busques la encontraras ahi, Salu2 ^^","replies":[]},{"poster":"Silver Charïøt ","date":"2019-11-04T15:30:20.541+0000","up_votes":2,"down_votes":0,"body":"Yo subi a diamante jugando solo una composicion que es la de los Gunslinger (pistoleros) y Brawlers (peleadores) \npor ahí tambien la de Dragon y Sorceress (hechiceros) \n\nhttps://progameguides.com/teamfight-tactics/teamfight-tactics-tft-best-brawler-team-comp-guide/ \n{{sticker:sg-lux}}","replies":[]},{"poster":"Te voy a Trolear","date":"2019-11-04T05:28:47.815+0000","up_votes":3,"down_votes":4,"body":"el consejo es dejar de jugar tft, no se puede subir en un modo de suerte, va si se puede pero si tenes suerte nomas, sino mira a reven y copia su composicion que siempre es la misma.","replies":[{"poster":"KOHBEE","date":"2019-11-04T20:08:11.736+0000","up_votes":1,"down_votes":0,"body":"Y porque no haces eso en vez de decir que es suerte? xD","replies":[{"poster":"Te voy a Trolear","date":"2019-11-05T00:50:31.173+0000","up_votes":1,"down_votes":0,"body":"por que no borran todas las demas composiciones entonces?, se supone que hay variedad para que uno elija que le conviene mejor en que situación, no tiene sentido en ir solo una composicion o 2 y que todas las demas no te sirvan para nada. Para mi es una victoria vacia = perdida de tiempo.","replies":[{"poster":"KOHBEE","date":"2019-11-06T09:16:04.183+0000","up_votes":1,"down_votes":0,"body":"Se nota que no sabes cuales son las composiciones mas fuertes en tft, decime algo, en el lol jugando ranked tenes un campeón mas fuerte que otros verdad? ahí esta el meta de campeones, borramos todos los campeones que no estén en el tier S total \"no sirven de nada\" y dejamos que todos se den piñas con los campeones mas rotos y que ganen pero no por habilidad si no porque el campeón esta mas op, no? si así fuera todos estarían jugando los campeones mas rotos por lo tanto el que mejor micro/macro juego tenga va a ganar, no el que tenga el campeon mas fuerte, puesto ya que todos los que quedaron son fuertes, lo mismo con TFT, el que tiene la compo mas fuerte no gana si no sabe ubicar sus personajes en el tablero, que items ponerle, y si hay 4 personas mas haciendo la misma composición ninguno va a poder terminar nunca esa composición, por lo tanto si te fijas bien en una partida a veces te conviene hacerte otra composición ya que si todos sacan lo mismo ninguno podría subir un champ a nivel 2 si quiera y el que saca una composición diferente le tocaran todos los campeones y los subiría de nivel.\nEstoy seguro que no jugaste lo suficiente tft o ni siquiera jugaste, pero en los elos altos no gana siempre la composición mas op, si no el que mejor mira las composiciones del equipo enemigo y se adapta a los que el otro tiene.","replies":[]}]}]}]},{"poster":"Crach an Craite","date":"2019-11-05T13:43:07.131+0000","up_votes":1,"down_votes":0,"body":"Abusa de las composiciones rotas, no hay otra para subir facil, dragones/guardianes, pistoleros/brawlers","replies":[]},{"poster":"Dog Bulling","date":"2019-11-04T17:17:13.129+0000","up_votes":1,"down_votes":0,"body":"Abusa del RNG. Lo ideal es armarte un equipo sólido que los demás no quieran, y tambien tratar de posicionar tus tropas de tal forma que la estrategia rival no funcione. También hay que forjar los objetos adecuados con tus tropas para mejorar su potencial, y de preferencia solo armar las tropas que más podrían aportar con una mejora.","replies":[]},{"poster":"Glaceon","date":"2019-11-04T04:50:39.127+0000","up_votes":1,"down_votes":0,"body":"La que yo uso es 6 Yordles. En la que todos los champs están atrás de todo  y dejo delante de todo en el medio a un yordle que tenga guantelete de hielo y Fajin/Garra Trampa. Puede ser Gnar/Poppy con Warmog o un Kennen con Sable-Pistola para curarse si de alguna forma pierden vida.\nEl peor enemigo que encuentro son Salvajes o Magos pero podes contrarrestarlos usando tus segundas composiciones para cada ocasión que debas identificar.","replies":[]}]}