{"poster":"Stückmilch","date":"2015-10-18T15:33:26.064+0000","title":"Zyra Bearbeitung","subforum":"Champions & Gameplay","up_votes":4,"down_votes":6,"body":"Ich pers&ouml;nlich finde dass {{champion:143}}  eigentlich ein guter Champion ist, aber sie in einen Tiefschlaf gefallen ist von seitens Riot. \nSie ist Azir sehr &auml;hnlich und er wird andauernd gespielt und das auch mit Erfolg. Ich m&ouml;chte halt gerne erinnert wei&szlig; das {{champion:143}}  eigentlich ganz gut ist.{{champion:143}}  wieder zur&uuml;ck ins Spiel bringen damit wir sie so &ouml;fter sehen, weil wer sich an die Season 3 \n\nIch fange einfach mal von Forne an:\n\n\nDie Passive: ist ja ganz okey aber die Zeit ist viel zu lange bis sie zur Pflanze wird und bis sie dann irgendwann mal \nschie&szlig;t ist jeder schon weg gelaufen!\n\n\n\nQ: Positiv: Sie hat wenig Abklingzeit und hohen Schaden. \n\n     Negativ: Kleiner Radius und zu viel Manakosten.\n\n\nW: Vergleichen wir mal mit {{champion:268}} ... Im Prinzip sind sich {{champion:143}}  und {{champion:268}}  mit den Pflanzen und Soldaten &auml;hnlich... Allerdings sind die von {{champion:268}}  unzerst&ouml;rbar und {{champion:143}}  kann man zerst&ouml;ren und dazu kriegt man noch Gold! Eine Bitte macht die Pflanzen doch auch unzerst&ouml;rbar dann kann sie wenigstens mit den anderen Mid Lanern oder Supports mithalten.\n\nEin Vorschlag: Macht die Pflanzen unzerstörbar dafür kosten sie Mana und sie machen dafür weniger Schaden.\n\nPositiv: Mini Ward, Schaden\n\nNegativ: Sterben schnell, geben Gold, wenig Lebenszeit\n\n\nE: Ich muss sagen diese F&auml;higkeit ist die Beste von ihr. \n\nPositiv: Fläche, CC, Schaden, unbegrenzt viele kann man treffen\n\nNegativ: Manakosten\n\n\nR: Die Ultimate ist ganz nett, allerdings hat man das Gef&uuml;hl das man die Ultimate direkt unter sich selbst setzen muss . Da bitte ich darum den Radius zu verbessern. Aber das aller schlimmste ist das schon wieder total viel Zeitverz&ouml;gerung ist... Bis man hoch geschleudert wird ist man schon l&auml;ngst drau&szlig;en. \nDie Manakosten sind ja Abstrus HOCH! Auf Stufe 3 140 Mana und dann ist die Ultimate auch noch so bescheiden. Macht es so dass sie bei jeder Stufe 100 Mana kostet, sonst hat sie einen gro&szlig;en Nachteil. \n\nVergleicht doch mal mit Lissandras Ultimate und Viktors!\n\nPositiv: Großer Radius, Knock UP, Schaden und Pflanzen Buff\n\nNegativ: Zu viel Zeitverzögerung, MANAKOSTEN: AUF STUFE 3 140 MANA!\n\nMeine Probleme mit der jetzigen {{champion:143}} sind:\n\n- Die Manakosten\n- Die W ist Vergleichsweise schlecht zu {{champion:268}}  Soldaten.\n\nWer kennt nicht das Problem das man keinen Counter gegenüber Azir hat? \nWenn man den W so buffen würde wie ich es erklärt habe wäre Zyra ein guter Gegner.\n\nIch wollte einfach nur mal aufgreifen von Maxims alias LetsReadSmallBooks Video und das Problem bekannter machen.\n\nUnd sie wollen sicherlich {{champion:143}}  wieder zur&uuml;ck im Spiel haben. Das w&auml;re eine Gute L&ouml;sung. \nIch hoffe sie verstehen mein Anliegen und versuchen es zu supporten .{{summoner:21}}  \n\nMFG St&uuml;ckmilch","replies":[{"poster":"Evenrider","date":"2015-10-18T16:18:01.952+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=NnAde-v4-k4\nHab das Gefühl, dass die Hälfte deiner Sätze aus dem Video entnommen sind :D\n\nDie Verzögerung bei Zyra ist absicht. Schließlich muss man die Fähigkeit sprechen können, dann die Pflanzen setzen, welche immer noch von der Fähigkeit getroffen werden sollen. Wenn man das nicht könnte, würde man die Pflanzen vorher setzen müssen. Dies würde dazu führen, dass der Gegner sie entweder kaputt macht oder einfach geht.\n\nUnd bei der E kann man die Verzögerung auch nicht wegmachen. Das ist ein normaler Skillshot. Lux, Morgana,... haben auch alle diese Verzögerung.","replies":[{"poster":"Stückmilch","date":"2015-10-18T18:23:57.413+0000","up_votes":1,"down_votes":2,"body":"Ja aber sie könnte ein Rework vertragen.\nAber die haben auch nicht bei jedem Spell Zeitverzögerung!","replies":[{"poster":"Califax111","date":"2015-10-23T03:02:05.319+0000","up_votes":1,"down_votes":0,"body":"Zyra braucht kein Rework. Sie ist mein meistgespielter Champ und ich finde sie großartig.  Das einzige was wirklich gut wäre, wenn der \"e\" skill weniger Abklingzeit hätte, da   mid-game oft schnell viele Kämpfe nacheinander kommen und die seeds dann oft CD haben.. Wenn man Zyra buffen wollte, wäre auch Ihre Def. verbesserungswürdig. Ich spiel sie meist als Support und wenn man sie mit z.b. Morgana vergleicht, die eine ziemliche  ähnliche Support-rolle einnimmt, stellt man fest, dass Morg sehr sehr sehr viel mehr aushält (mehr leben, mehr def-stats.)","replies":[{"poster":"Califax111","date":"2015-10-23T03:10:31.752+0000","up_votes":2,"down_votes":0,"body":"PS: Ein neuer Skin wäre nice :)","replies":[]}]}]}]},{"poster":"Sirrkas","date":"2015-10-18T16:36:27.408+0000","up_votes":1,"down_votes":0,"body":"Wirklich ausweichen kann man Zyras Q nicht. Wenn man einen verzögerten Skillshot aber so setzt, dass der Gegner bis dahin ohnehin rausgelaufen ist, macht man etwas falsch. Cassis Q und W sind da im Grunde gleich.","replies":[{"poster":"Stückmilch","date":"2015-10-18T18:57:33.392+0000","up_votes":1,"down_votes":3,"body":"Aber es kann nicht sein das ein normaler Spell genauso viel Verzögerrung hat wie Leonas Ultimate . \nIch weiß ja dass sie nicht schlecht ist aber ihr Champion Design ist halt noch recht alt ^^","replies":[{"poster":"Sirrkas","date":"2015-10-18T19:00:41.268+0000","up_votes":2,"down_votes":1,"body":"Schonmal den Käfig von Veigar gesehen?","replies":[{"poster":"Enderized","date":"2015-10-18T20:19:37.462+0000","up_votes":2,"down_votes":0,"body":"Oder den Rooteffekt von Sorakas E?\nOder der Karthus Q sobal die Gegner ihre Tier2 boots haben?\n\nDie Kog'Maw Ult ist auch nur zu gebrauchen wenn der Gegner sich nicht wegbewegt, zumal die range bis lvl 16 sowieso zu vernachlässigen ist.\n\n\nAber Zyras Q ist eigl okay- so verglichen mit der Brand W.","replies":[]},{"poster":"Stückmilch","date":"2015-10-18T19:05:29.334+0000","up_votes":1,"down_votes":1,"body":"Ja aber der Stunt dann und dieß tut sie nicht und der Käfig hat glaube ich auch ein bisschen mehr Reichweite.","replies":[]}]}]}]},{"poster":"Leinhard","date":"2015-10-18T19:54:58.903+0000","up_votes":2,"down_votes":1,"body":"Ich glaube es würde schon reichen die W Unzerstörbar zu machen damit hätte sie dann ein kleines zoning Tool.","replies":[{"poster":"Stückmilch","date":"2015-10-18T20:06:01.385+0000","up_votes":1,"down_votes":0,"body":"ja das könnte sein.","replies":[]}]},{"poster":"Bergelmir32","date":"2015-10-18T19:30:11.926+0000","up_votes":2,"down_votes":1,"body":"All die Verzögerungen haben sie auch nicht davon abgehalten in S3 Top Tier Support zu sein...\n\nAbgesehen von den R Manakosten auf 100 setzten, kannst du auch in den letzten Thread schauen der genau den selben Inhalt hatte und auch fast 1 zu 1 von Maxims Infotainment abgekupfert war.","replies":[{"poster":"Stückmilch","date":"2015-10-18T20:09:32.839+0000","up_votes":1,"down_votes":1,"body":"Weil es dort noch nicht so viele mobile Chmpions gab und auch noch viel Verzögerung.","replies":[{"poster":"Bergelmir32","date":"2015-10-18T21:50:32.579+0000","up_votes":1,"down_votes":0,"body":"Nicht das ich das nicht schonmal gehört hätte aber schauen wir doch mal wie viel mobile Champions seit dem rausgekommen sind die es wirklich einfach haben Zyras Spells zu dodgen:\nLucian, Yasuo, Braum, Gnar, Kalista, Ekko, dann nochmal so viele die es sehr schwer haben und noch ein paar bei denen es so lala ist.\nIm Großen und Ganzen hat sich an der Menge der Champs die es einfach haben und denen die es das nicht haben also nicht viel geändert. Inwiefern soll sie jetzt also schlechter zu spielen sein als vorher?","replies":[{"poster":"OrangeBubble","date":"2015-10-19T06:17:16.594+0000","up_votes":1,"down_votes":0,"body":"Zyra ist nicht in \"inn\" und Maxim sagt \"sie ist schlecht\", deswegen ist sie schlecht.\nWürde jetzt morgen ein Pro mit ihr mega abgehen, dann wären diese Argumente von Maxim wieder hinfällig, nein, dann würde alle wieder schreien, wie stark die ist. \n\nAber keine Ahnung, ich kann nur sagen, wenn ich meinen Freund sie spielen sehe, frag ich mich, warum sie niemand spielt ô.o Wohlgemerkt spielt er nur sehr selten Lol und geht tdm mit dem Champ ab ..","replies":[]}]}]}]},{"poster":"OoP Planet","date":"2015-10-18T19:21:05.936+0000","up_votes":2,"down_votes":1,"body":"Bei der R von {{champion:143}} stimme ich dir nicht ganz zu zwar ist da diese krasse verzögerung aber ganz ehrlich im teamfigth konzentriert man sich auf andere Dinge als einer {{champion:143}} wenn nicht dann {{summoner:4}} man easy rauß aber ich finde auch das sie ein rework brauch davor brauch aber gayric {{champion:44}}  auch eins und das ist ein bisschen dringender :/ {{item:3151}} \n\nMFG der biber und der Baum","replies":[{"poster":"Stückmilch","date":"2015-10-18T20:17:18.185+0000","up_votes":1,"down_votes":0,"body":"Da hast du Recht ;)","replies":[]}]},{"poster":"Im a Papaya","date":"2015-10-18T15:43:31.688+0000","up_votes":2,"down_votes":1,"body":"Ich stimme dir größtenteils zu, aber es klingt so als wolltest du die E quasi zu nen point and click Cage machen was dann schon zu stark wäre. \nZyra sollte auf jeden fall ein kleines Rework bekommen in der gleichen Größenordnung wie Darius und Garen, weil ich ihr Kit an sich ziemlich nett finde.","replies":[{"poster":"Stückmilch","date":"2015-10-18T18:59:21.276+0000","up_votes":1,"down_votes":1,"body":"Ja aber Zyra ist vom Spiel Stil ähnlich wie Annie und sie hat auch Point und Klick, aber man könnte ja die Fähigkeit verändern oder sogar eine ganz neue machen.\n\nIn dem Anderen Punkt stimme ich dir voll kommen zu!","replies":[{"poster":"Im a Papaya","date":"2015-10-18T19:25:31.560+0000","up_votes":1,"down_votes":0,"body":"Bei Annie siehst du wenigstens wann sie den Stun bereit hat und ansonsten fällt mir kein point and click cc spell von nen anderen Magier ein.","replies":[{"poster":"Stückmilch","date":"2015-10-18T20:11:01.730+0000","up_votes":1,"down_votes":0,"body":"Es muss ja nicht point and click sein aber man sollte Manakosten etwas runter schrauben.","replies":[]}]}]}]},{"poster":"Heisl","date":"2015-10-18T15:41:52.781+0000","up_votes":2,"down_votes":1,"body":"Bin dabei, Nicht genau wie du beschrieben hast aber nah dran.","replies":[]},{"poster":"FeatherPaw","date":"2015-12-26T02:30:55.429+0000","up_votes":1,"down_votes":0,"body":"Also erst mal, dass sich so viele von jemandem beeinflussen lassen, der sich augenscheinlich noch nicht viel mit Zyra beschäftigt hat, nur weil er einen Youtube kanal hat und Mitglied bei Summoners Inn ist, finde ich unglaublich.\nZu den delays: wie schon erwähnt wurde, BRAUCHT Zyra diese delays wegen ihrer Pflanzen. Da bringt es auch rein gar nichts, sie mit Lux, Annie oder sonst wem zu vergleichen. Zumal der Vergleich zu Annie generell komplett aus dem Sternen gegriffen ist, da Zyra ein zoning mage ist und Annie ein burster. Daher sind die Delays auf Q und E auch gold richtig. Mag sein, dass Zyra genauso lange braucht, wie Leonas Ult, aber er hat auch guten Grundschaden, eine gute Skalierung, einen SEHR niedrigen Cooldown und ist eine FLÄCHE. Gleiches gilt auch für den E. Also stell dir vor, sie würden schneller triggern und die gegnerische Zyra hämmer im 3 Sekunden Takt mit ihrem so schon schwer dodgbaren Q auf dich. Der Delay auf der Ult bis zum Knock up ist etwas übertrieben, mag sein. Aber wieder ist es eine verdammt große FLÄCHE mit hohem Schaden und einem Buff für die Pflanzen. Abgesehen davon hat sie einen 1,75 Sekunden Snare mit dem maximalen E und der knockup erfolgt nach 2 Sekunden. Stell dir jetzt vor, er würde schon nach 1,5 kommen. Counterplay = 0 wenn sie den E trifft und hierbei würde sie wie Lux agieren: Benutz E. Hast du getroffen? Nein? Warte ab und probiere es erneut. Ja? Benutz deine volle Combo.\nAußerdem, wie schon einmal erwähnt, ist sie eine zonerin. Ihre Pflanzen sind eine Gefahr, selbst wenn du deine Spells nicht triffst, was sie zu einem lanebully macht. Also wieder bringt es rein gar nichts, sie mit Lux oder sonst wem zu vergleichen, weil ihre Pflanzen noch eine weitere Schadensquelle liefern. Dabei ist sie auch nicht mot Azir zu vergleichen, da dieser nur seine Soldaten als Schadensquelle hat und diese mobil sind, aber auf seine Angriffe angewiesen sind. Zyra ist mehr wie Heimerdinger. Sie erschafft Gefahrenzonen mit ihren Pflanzen. Allerding halten sie nicht im mindesten so lange wie Heimers Türme, dafür kann sie sie öfter beschwören, ist also mobiler und interaktiver mit ihren Zonen. Zyra ist wie eine Mischung aus Azir und Heimerdinger, wenn man es genau betrachtet. Darauf ausgelegt, Gefahrenzonen für den Gegner zu erschaffen ind nicht um ihn so schnell zu bursten, wie möglich.\nAber da liegt auch das Problem, das Zyra momentan hat. Ihre Pflanzen sind nicht mehr verlässlich genug und ihre Spells allein reichen zum Zonen meist nicht aus. Durch die Anfälligkeit der Pflanzen gegen AoE effekte sterben sie oft nebenbei. Eine Morgana Pfütze umd innerhalb von 1 Sekunde sind sie tot. Sie unzerstörbar zu machen ist völliger Blödsinn, außer du willst nie wieder farmen und zusehen, wie die Pflanzen deinen Carry im teamfight tranchieren. Aber eine mit dem Skill Level stärker werdende Schadensreduzierung gegenüber AoE Effekten wäre vorstellbar. Und natürlich eine neue Passive. Zwar passt es in ihr Kit, selbst mach dem Tod noch eine Gefahrenzone zu erzeugen, in der du von ihr getroffen werden kannst, aber die umsetzung lässt zu wünschen übrig. Stattdessen würde ich eine Interaktion mit dem Pflanzen bevorzugen.\nAnsonsten ist Zyra vollkommen in Ordnun, auch mit all ihren delays. Manchmal muss man halt predikten und vorhersehen, wo der Gegner als nächstes hinlaufen wird, um ihn zu treffen, aber das ist bei weitem nicht nur mit Zyra so. Und ehe eine Antwort alá \"aber gegen mobile champs hat sie meist keine Chance\" kommt: dass sie es schwer gegen Assassinen hat ist logisch, das gaben die meisten unmobilen und/oder \"weichen\" Champs, die keinen Instant stun haben. Das ist schließlich der Sinn von Assassinen. Aber dennoch hat sie eine Chance gegen sie, weiö sie die meisten von ihnen auf Abstand halten kann. Immerhin ist sie ein zoning mage. Hau deine Spells einfach nicht direkt auf deinen Gegner, sondern erschaffe mit deinen Pflanzen Gefahrenzonen, um seine Bewegungsfreiheit einzuschränken, setz deine Pflanzen ein wenig mit Köpfchen anstatt alles in einer \"alles oder nichts\"-combo raus zu hauen und du wirst sehen, wie stark und gemein Zyra sein kann. Ihr Kit ist voll von delays. Ist da nicht der Gedanke gekommen, dass es also nicht dafür gedacht ist, wie bei nem normalen combo-mage alles rauf zu hauen? ;)","replies":[{"poster":"SkyDivaReal","date":"2018-02-08T16:54:48.810+0000","up_votes":1,"down_votes":0,"body":"Ich schließe mich diesem Kommentar von FeatherPaw zu hundert Prozent an.\n\nZyra ist mein absoluter Main Champ ( ich liebe diesen Champ - neuer Look und kleines Upgrade wären Top ) - auf höchster Stufe. \nWer sie beherrscht und vor allem wenn der ADC sie ebenfalls versteht, entscheidet Sie sehr oft Teamfights zu Gunsten Ihres Teams. Lediglich das \"Gejammer\" einiger aus meiner Sicht unerfahrenen, egoistischer ADC's - das Zyra auch mal einen Farm ab bekommt, geht mir total auf die Nerven.\nSehr oft kann ich mit Zyra massiv Kills holen, wenn der ADC einfach keine Auto Attacks macht, für den Last Hit. \nDie E könnte man an Morgana anpassen, wäre absolut fair - aber bevorzugen würde ich etwas mehr Ressistenz - genau wie Morgana sie hat.\n\nZu dem Thema Assassins möchte ich anmerken das die Pflanzen oft nach Zyra's Tod durch einen Assassin - diesen auch noch zu Fall bringen - so soll das auch sein, sonst wäre Sie ein zu leichtes Ziel, \nwas hier bei Heimerdinger meiner Meinung nach öfter der Fall ist.\nDie meisten Assassin springen mich nur noch an wenn Sie auch alles zur Verfügung haben, inclusive Flash. \nWer das nicht macht, geht garantiert mit mir unter - was dem ganzen Team aus meiner Sicht ebenfalls einen Vorteil bringt die restlichen Gegner aus dem Weg zu räumen.\nAls Supporter bin ich gerne bereit dieses Opfer zu bringen, wodurch das Team die Teamfights sehr oft gewinnt und Lanes erobert. Wenn es dem Supp gelingt einen Killer aus dem Spiel zu nehmen, was will man mehr in einem Teamfight.\nFür Teamspiel ist Zyra ein super Champ.\n\nIch finde Zyra noch immer einen starken Support - für alle Teamplayer, für egoistiche Spieler ist sie weniger hilfreich, denn auch mit Zyra bekommt man schnell mal ein S+.\n\nWürde mir allerdings die genannten Verbesserungen des von mir kommentierten Beitrags wünschen. Abgeschwächt wurde Sie ja nun genug, ein kleiner Buff und neuer Look macht Sie noch lange nicht wieder OP, aber einfach interessanter, gegen die vielen neuen mobilen Champs.\n\nAn die Entwickler:\nMan muss das Rad nicht immer neu erfinden, wenn man es auch einfach nur verbessern kann ,-)).\nSchickt Zyra mal in eine Tanzschule - haha.","replies":[]}]},{"poster":"GayFluffyUnicorn","date":"2015-10-18T20:27:15.985+0000","up_votes":1,"down_votes":0,"body":"Zyra benötigt nunmal einen höheren Skill als andere Champs ^^","replies":[{"poster":"Stückmilch","date":"2015-10-18T20:54:38.190+0000","up_votes":1,"down_votes":1,"body":"Naja aber man kann ihre Spells halt zu einfach ausweichen das ist das Problem was ich habe ^^","replies":[{"poster":"hshtagniemehrcdu","date":"2015-10-19T08:35:04.878+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stückmilch,realm=EUW,application-id=Wj1wcocU,discussion-id=rGAHtxgV,comment-id=00070000,timestamp=2015-10-18T20:54:38.190+0000)\n>\n> Naja aber man kann ihre Spells halt zu einfach ausweichen das ist das Problem was ich habe ^^\n\nDas liegt nicht an dem Champion, sondern an dir.\nDer Q hat eine hohe Reichweite + sehr schnelle Cast-Zeit.\nDass man da einfach rauslaufen kann, ist Schwachsinn.\nDiie Pflanzen, welche du mit dem Q auslöst, haben ebenfalls eine enorme Reichweite + sehr hohen Schaden.\nDem man gar nicht auswiechen kann...\n\nDer Ult ist enorm riesig und ist ebenfalls alles andere als schwer zu treffen.\nUnd dafür, dass er so enorm groß ist, muss die Verzögerung beim Knockup einfach sein.\nMit der Ultimate kannst du ein riesiges Gebiet völlig absperren, und deine Pflanzen erhalten nochmal einen massiven Schadensboost.\nUnd das nennst du bescheiden.\nAha.\n\nDie einzige Fähigkeit, welche schwer zu treffen ist, ist ihr E (und ihre Passive).\n\nDu willst im Grunde nichts weiter als einen massiven Buff für Zyra, mit einer äußerst fragwürdigen Begründung.","replies":[{"poster":"OrangeBubble","date":"2015-10-19T10:52:28.782+0000","up_votes":1,"down_votes":0,"body":"Dafür kann die E theoretisch ein ganzes Team snaren und geht durch Minions. Muss man mal dazu sagen :P\nWenn der schneller wäre, wärs wahrscheinlich wieder too much.","replies":[{"poster":"Bergelmir32","date":"2015-10-19T10:58:27.216+0000","up_votes":1,"down_votes":0,"body":"Es ist auch nur 50 langsamer als Lux und Morganas Snares, 1200 zu 1150.","replies":[{"poster":"hshtagniemehrcdu","date":"2015-10-19T16:40:32.293+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dupree0991,realm=EUW,application-id=Wj1wcocU,discussion-id=rGAHtxgV,comment-id=00070000000000000000,timestamp=2015-10-19T10:58:27.216+0000)\n>\n> Es ist auch nur 50 langsamer als Lux und Morganas Snares, 1200 zu 1150.\n\nDafür ist er allerdings auch sehr schmal.\nAber ja....\nDie Möglichkeit bis zu 5 Personen zu treffen sollte nicht unbeachtet bleiben.","replies":[{"poster":"Bergelmir32","date":"2015-10-19T16:54:40.117+0000","up_votes":1,"down_votes":0,"body":"Ist es sehr schmal? Es ist breit genug um das gesammte Raptor Camp zu teffen.\nIch hab keinen Vergleich aber so viel schmaler als vergleichbare Skillshots sollte es nicht sein.","replies":[]}]}]}]}]}]}]}]}