{"poster":"Názer","date":"2018-06-13T03:05:49.595+0000","title":"Preocupacion por perdida de jugadores del juego","subforum":"Charlas Generales","embed":{"description":null,"url":"https://trends.google.com/trends/explore?date=all&q=%2Fm%2F04n3w2r","image":null},"up_votes":30,"down_votes":7,"body":"Buenas solo quer&iacute;a comentar a cerca de gente que esta dejando de jugar y quer&iacute;a saber que pensaban, si bien ya es sabido que el juego esta decayendo, Riot aun no puede remediar como evitar perder mas jugadores de los que esta ganando. En el enlace se dan cuenta la cantidad de b&uacute;squeda del juego, el juego salio el 2009 y empez&oacute; a crecer exponencialmente obvio, como todo nuevo juego parece ser una novedad y se mantuvo as&iacute; por a&ntilde;os, pero despu&eacute;s del mundial del 2015 el juego empez&oacute; a decaer de manera significativa era la season 5 si no me equivoco, en todos los crecimientos que sale en la tabla es debido a alg&uacute;n evento del juego en si, que busca de alguna manera interesar a mas personas para que vuelvan al juego o nuevos jugadores, pero que quiz&aacute;s con los &uacute;ltimos parches y cosas menos interesantes ya no sea probable que jugadores antiguos vuelvan para que quiz&aacute;s (ojal&aacute; que no) muera el juego , yo aun no me aburro y juego ocasionalmente pero no voy a mentir que en las seasons anteriores me entreten&iacute;a mas que en estas ultimas que han salido. Ojala puedan comentar lo que piensan. \r\n  \r\n {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Rick Silence","date":"2018-06-13T03:26:24.629+0000","up_votes":15,"down_votes":1,"body":"Los niveles del 1 al 30 son increíblemente tóxicos, mucho peores que la toxicidad normal desde ahí. \nY espantan a la gente nueva. De hecho, me ha tocado ver cómo un jugador nuevo al que le expliqué un poco el juego se fue cuando vio la toxicidad que hay en ese pozo. \nY sin jugadores nuevos, el juego muere. Así de sencillo.","replies":[{"poster":"Nabuze","date":"2018-06-13T03:51:47.815+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Cisne Blanco,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=0000,timestamp=2018-06-13T03:26:24.629+0000)\n>\n> Los niveles del 1 al 30 son increíblemente tóxicos, mucho peores que la toxicidad normal desde ahí. \n> Y espantan a la gente nueva. De hecho, me ha tocado ver cómo un jugador nuevo al que le expliqué un poco el juego se fue cuando vio la toxicidad que hay en ese pozo. \n> Y sin jugadores nuevos, el juego muere. Así de sencillo.\n\nDeberían poner 1 advertencia al primer flameo de lvl bajo. Luego de esa advertencia en su segundo flameo un ban de 14 días, finalmente un ban permanente, que no se toleren estás actitudes del 1 al 30 después de eso que se trate con el sistema actual a las cuentas.\n\nEs importante generar un buen ambiente al menos en lvl bajos para que salgan bien educados de ahí.","replies":[{"poster":"Ellora","date":"2018-06-13T13:52:58.331+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nabuze,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=00000001,timestamp=2018-06-13T03:51:47.815+0000)\n>\n> Deberían poner 1 advertencia al primer flameo de lvl bajo. Luego de esa advertencia en su segundo flameo un ban de 14 días, finalmente un ban permanente, que no se toleren estás actitudes del 1 al 30 después de eso que se trate con el sistema actual a las cuentas.\n> \n> Es importante generar un buen ambiente al menos en lvl bajos para que salgan bien educados de ahí.\n\nSolo flameos? Y los troll? Y los afk recidentes? \nEl flameo me importa un egg, mute y listo... Pero el troll, fedeer, el que no quiere jugar, ni ayudar, el afk. Ese es el problema sin solución","replies":[{"poster":"Nabuze","date":"2018-06-13T14:54:52.718+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Ellora,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=000000010000,timestamp=2018-06-13T13:52:58.331+0000)\n>\n> Solo flameos? Y los troll? Y los afk recidentes? \n> El flameo me importa un egg, mute y listo... Pero el troll, fedeer, el que no quiere jugar, ni ayudar, el afk. Ese es el problema sin solución\n\nA vos te importa un egg porque ya subiste, ya aprendiste ya sabes mas o menos de que va el juego pero alguien que nunca toco un moba en su vida y no sabe ni con que nivel de gente lo emparejan mucho menos que existen las ligas va a ver que uno de sus compañeros le dice un montón de cosas que no entiende y se va a sentir re mal no sabe que se lo está diciendo un smurf de bronce plata frustrado de la vida.\n\nPara traer nuevos jugadores lo peor serían los tóxicos porque estos hacen sentir mal a los jugadores nuevos, los trolls y los afk hacen que los jugadores se enojen pero es distinto enojarte con alguien a que te hagan sentir una basura.\n\nMuchas veces esos trolls que decís son personas que les va mal solamente y en la mayoría de los casos y los afk es problema de las en general a menos que estés en uruguay siempre hubieron problemas de conexión en las demás regiones por A o por B.\nVos no podés diferenciar  tan fácil a un troll de alguien que le va mal. El día que uno de los que se quejan de estos últimos venga con media neurona a proponer algo útil para diferenciarlos en vez de solo quejarse va a ser merecedor de que lo contraten para riot ya que es algo que con la tecnología actual es difícil de saber :)","replies":[]},{"poster":"Dystopia18","date":"2018-06-13T20:25:57.566+0000","up_votes":2,"down_votes":0,"body":"Los flamers son los que mas espantan en los lv bajos \nDel 1 al 30 , un jugador nuevo puede morir , pero no trollear...al ser NUEVOS ni siquiera saben como usar pociones siquiera\nA esos jugadores asi que van a los niveles bajos a jugar y acusan de trolls a los nuevos , son los que deberian de sacar , ya que al creer que como no saben jugar,son trolls . Y ahi es donde empiezan a flamear y a espantar a los nuevos jugadores\nY los afk ya lo dijo Nabuze , a muchos nos pasa que tenemos problemas de conexion o incluso el servidor te saca por bugs . ademas de que muchos nuevos (y esto lo vi ayer... que estaba observando a alquien que queria iniciar el lol) no saben que seria afk ... a lo que mueren y se van a hacer un te o al baño , revive el personaje y aun ni regresan y se toman un tiempito sin saber sobre irse afk y ese tipo de penalizaciones \n\nBasicamente... la toxicidad parte de los flamers , los trolls pueden haber en cualquier elo y juego , ya con jugar algo que no deberia ser ,es trollear , por algo hay picks trolls y aun asi puede ir bien o mal la cosa como jugar timo jg o garen supp . Los afk mucho se van de las partidas solamente porque no quieren seguir leyendo a los compañeros que se la pasan diciendoles que juegan mal, que se compen manos , que gg tal jugador , /all report tal porfa ( me ah pasado que me acusan de esas cosas y dan ganas de irse... )pero no todos podemos seguir jugando ignorando a esos jugadores asi , dan ganas de irse de la partida y esperar a la siguiende que no toque la misma gente \n Todo parte de los flamers , deberian enfocarse mas en esos que los afk/trolls \n{{sticker:slayer-jinx-unamused}}","replies":[]}]}]},{"poster":"L9 Letalis Umbra","date":"2018-06-13T05:16:18.625+0000","up_votes":4,"down_votes":0,"body":"Siempre que recomiendo el juego digo lo mismo, _si no tienes paciencia, no vas a durar mucho jugando. La gente en niveles bajos es demasiado tóxica y tendrás que aprender por arte de magia y subir como pro para evitar esto_\n Al final esto se cumple en la mayoría de los casos, amigos que tuvieron que subir a nivel 30 jugando solamente en coop vs ia o arams para evitarse la toxicidad","replies":[]},{"poster":"Názer","date":"2018-06-13T03:34:50.345+0000","up_votes":2,"down_votes":0,"body":"La verdad no lo había pensado de esa forma, tienes razón gran parte también influye por la comunidad comenzando desde niveles bajos, gracias por poner tu punto de vista.\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Nabuze","date":"2018-06-13T03:57:52.378+0000","up_votes":9,"down_votes":0,"body":"Te digo que si hubiera habido clash los servidores se llenaban.\nTenía todo para ser un modo de juego inovador.\n- Experiencia competitiva\n- no tiene smurfs\n- honor 2 obligatorio, obligando a los tóxicos a dejar de serlo si quieren esa hermosa experiencia\n- podías emparejarte con el amigo que quisieras así fueras challenger con 4 bronces xD\n\nY las rankeds 2019 le van a dar otro aire a esto.\nAhora mismo no juego muchas rankeds porque ando en Diamante II y no podría mantener una cuenta en máster o challenger por cuestiones de tiempo asi que mi máximo nivel quedaría en Diamante I si lo logro, pero llegué ahí sólo jugando katarina mid.\nEsas rankeds 2019 me dan la oportunidad de medirme en otras líneas lo que me va a hacer ser mucho mas activo en las rankeds que no afectan mi elo de mid :D.","replies":[{"poster":"LeagueOfReportss","date":"2018-06-13T06:04:25.180+0000","up_votes":1,"down_votes":9,"body":"me dijeron que solo el 7% de la comunidad clasificaba de honor 2 en adelante. por eso cancelaron el evento","replies":[{"poster":"Cuchufleitor","date":"2018-06-13T06:31:33.093+0000","up_votes":7,"down_votes":1,"body":"No se quien te dijo eso, pero no conozco a nadie que este abajo de honor 2, de hecho la mayoria estan en 3 o 4","replies":[{"poster":"Phaedra","date":"2018-06-14T00:57:01.129+0000","up_votes":2,"down_votes":1,"body":"Tu estadística es tan poco fiable como la del 7% del otro amiguito....","replies":[{"poster":"Cuchufleitor","date":"2018-06-14T19:02:51.399+0000","up_votes":1,"down_votes":0,"body":"Nunca dije que fuera una estadistica, es entre los que conozco (tengo como 40 contactos de los cuales NINGUNO esta debajo de honor 2). No se puede tomar como estadistica pero creo que es claramente una tendencia.","replies":[{"poster":"Phaedra","date":"2018-06-14T22:07:11.135+0000","up_votes":1,"down_votes":0,"body":"Estadística es analizar datos y en base a esa muestra, sacar una conclusión, estás confundiendo el término. \n\nSaludos","replies":[{"poster":"Cuchufleitor","date":"2018-06-15T06:14:48.692+0000","up_votes":1,"down_votes":0,"body":"No, vos pusiste una palabra en mi que nunca nombre. Solamente queria dejar eso claro","replies":[{"poster":"Phaedra","date":"2018-06-15T23:28:57.958+0000","up_votes":1,"down_votes":0,"body":"Jjaja todo bien. Igual no puse ninguna palabra en ningún lado, vos confundiste el significado de estadística con el de resultado o inferencia. Es como si te digo \"estás escribiendo\" y me contestás que no estás escribiendo en el foro, y que yo puse esa palabra en tu boca. Si tipeás letras y formás palabras estas escribiendo. Si analizás datos (el nivel de honor de la gente) en base a una muestra (40 contactos) y llegás a una conclusión (no ves a nadie abajo de honor 2) estás haciendo estadística...simple as that. Saludos","replies":[]}]}]}]}]}]}]},{"poster":"DIOS TUTI","date":"2018-06-13T09:15:41.127+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nabuze,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=0004,timestamp=2018-06-13T03:57:52.378+0000)\n>\n> Te digo que si hubiera habido clash los servidores se llenaban.\n> Tenía todo para ser un modo de juego inovador.\n> - Experiencia competitiva\n> - no tiene smurfs\n> - honor 2 obligatorio, obligando a los tóxicos a dejar de serlo si quieren esa hermosa experiencia\n> - podías emparejarte con el amigo que quisieras así fueras challenger con 4 bronces xD\n> \n> Y las rankeds 2019 le van a dar otro aire a esto.\n> Ahora mismo no juego muchas rankeds porque ando en Diamante II y no podría mantener una cuenta en máster o challenger por cuestiones de tiempo asi que mi máximo nivel quedaría en Diamante I si lo logro, pero llegué ahí sólo jugando katarina mid.\n> Esas rankeds 2019 me dan la oportunidad de medirme en otras líneas lo que me va a hacer ser mucho mas activo en las rankeds que no afectan mi elo de mid :D.\n\nestamos en la misma jaja.\n\npd: sos otp igual que yo, creo que deberias saber, que el sistema de clash permite ver que champs usa el enemigo antes de jugar, te van a permabanear kata, yo para que me esten permabaneando udyr, prefiero ni jugar.","replies":[{"poster":"Nabuze","date":"2018-06-13T11:03:40.526+0000","up_votes":1,"down_votes":0,"body":"Ser otp por descubrir el campeón que más amas en toda la grieta y que usarías así este en lo más profundo del pozo jaja.\nBueno con esto de clash me había puesto las pilas para practicar otros picks tenía un antiguo otp y muchos mains anteriores.\nEmpecé a otpear katarina a mediados de la season anterior pero estoy bien consciente que mi katarina será permabaneada y esa no es mi única desventaja.\nMi equipo consta de un platino, un oro, 2 platas y yo, quedamos justo en el nivel 2 nos pueden llegar a salir todos platinos u otra ensalada de elo igual a nosotros x'D.\n\nLa verdad veía a clash como una excusa para aprender el juego en equipo, hacerme 2 trick o 3 trick no sonaba tan mal.\nAhora seguro ves sólo katarina en el historial pero si eso es así es porque me bajaron de un puñetazo en la cara el hype.\nUna cosa es que te avisen 1 día antes, otra que te avisen 2 hs antes y te enteres por un título en el foro pensando que es una broma.\n\nHabía dejado impecable hasta el teclado para jugar, ese era mi nivel de hype :'c\n(Con decir hasta el teclado, fue toda la pieza y haya todo papelito de chicle arriba de la mesa sobre la cual está el monitor, le pase hasta el blem!! D: mientras más escribo más da la impresión de que no limpio nunca pero no es así, sólo que esta vez limpie muy a fondo x)","replies":[{"poster":"DIOS TUTI","date":"2018-06-13T20:56:34.269+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nabuze,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=000400010000,timestamp=2018-06-13T11:03:40.526+0000)\n>\n> Ser otp por descubrir el campeón que más amas en toda la grieta y que usarías así este en lo más profundo del pozo jaja.\n> Bueno con esto de clash me había puesto las pilas para practicar otros picks tenía un antiguo otp y muchos mains anteriores.\n> Empecé a otpear katarina a mediados de la season anterior pero estoy bien consciente que mi katarina será permabaneada y esa no es mi única desventaja.\n> Mi equipo consta de un platino, un oro, 2 platas y yo, quedamos justo en el nivel 2 nos pueden llegar a salir todos platinos u otra ensalada de elo igual a nosotros x&#x27;D.\n> \n> La verdad veía a clash como una excusa para aprender el juego en equipo, hacerme 2 trick o 3 trick no sonaba tan mal.\n> Ahora seguro ves sólo katarina en el historial pero si eso es así es porque me bajaron de un puñetazo en la cara el hype.\n> Una cosa es que te avisen 1 día antes, otra que te avisen 2 hs antes y te enteres por un título en el foro pensando que es una broma.\n> \n> Había dejado impecable hasta el teclado para jugar, ese era mi nivel de hype :&#x27;c\n> (Con decir hasta el teclado, fue toda la pieza y haya todo papelito de chicle arriba de la mesa sobre la cual está el monitor, le pase hasta el blem!! D: mientras más escribo más da la impresión de que no limpio nunca pero no es así, sólo que esta vez limpie muy a fondo x)\n\nte soy sincero, desde que salio clash, ya sabia que no lo iba a jugar, porque si me banean udyr me quedan solamente xin zhao y shyvana (shyvana solamente, xin es godtier, baneado tambien) y shyvana esta en la mierda, por mucho que la haya masterizado (que no es nada, 150k exp), pero para los que estaban hypeados, fue una mierda jajaj.\n\nese equipo no era competitivo jaja, era pa joder nomas","replies":[{"poster":"Nabuze","date":"2018-06-13T21:02:47.913+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TUTI DIOS,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=0004000100000000,timestamp=2018-06-13T20:56:34.269+0000)\n>\n> te soy sincero, desde que salio clash, ya sabia que no lo iba a jugar, porque si me banean udyr me quedan solamente xin zhao y shyvana (shyvana solamente, xin es godtier, baneado tambien) y shyvana esta en la mierda, por mucho que la haya masterizado (que no es nada, 150k exp), pero para los que estaban hypeados, fue una mierda jajaj.\n> \n> ese equipo no era competitivo jaja, era pa joder nomas\n\nObvio que era para joder si era de puros amigos xD.\nSe hace cada 2 semanas y llegaremos hasta donde nos den las manos o se desarmara en el intento quien sabe.\nYo ni lo jugaria si no fuera con amigos, tenes que tener mucha paciencia para tener buena sinergia con 4 que no conoces.\n\nMi primera opcion eran todos buenisimos diamantes y podia pickear varios mids con ellos pero estan la mayoria por debajo del honor 2 xD\n\nTenete mas fe, quien dijo que no podes masterizar otra cosa mas, que te de vagancia hacerlo es otra cosa, yo tambien estoy re comodo con katarina ","replies":[{"poster":"DIOS TUTI","date":"2018-06-13T21:12:58.307+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nabuze,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=00040001000000000000,timestamp=2018-06-13T21:02:47.913+0000)\n>\n> Obvio que era para joder si era de puros amigos xD.\n> Se hace cada 2 semanas y llegaremos hasta donde nos den las manos o se desarmara en el intento quien sabe.\n> Yo ni lo jugaria si no fuera con amigos, tenes que tener mucha paciencia para tener buena sinergia con 4 que no conoces.\n> \n> Mi primera opcion eran todos buenisimos diamantes y podia pickear varios mids con ellos pero estan la mayoria por debajo del honor 2 xD\n> \n> Tenete mas fe, quien dijo que no podes masterizar otra cosa mas, que te de vagancia hacerlo es otra cosa, yo tambien estoy re comodo con katarina\n\nme tengo fe, pero me siento re comodo con udyr jaja.\n\nel problema no es practicar otro champ en jungla (mi rol main) sino que estoy practicando otras lineas en una smurf, por lo menos hasta 2019 que van a meter elo por ligas.","replies":[{"poster":"Nabuze","date":"2018-06-13T21:25:40.042+0000","up_votes":1,"down_votes":0,"body":"si la comodidad que te brinda ser otp es lo mejor, casi ninguna partida salis mal por ende no te flamean y si vas mal sabes exactamente que hacer para remontar, si te juntas con premades adoran el carrito.\nTiene muchas ventajas para que el juego sea super sano (al menos con kata solo me flamean enemigos).\ny la ventaja mas grande, no te aburris de jugar al otp.\nTiene sus contras como todo pero es tan comodo ser otp.\n\nObviamente mis otros champs no estan a la altura de mi katarina pero tampoco es como que este otpeando en bronce :/\n\nLos que si tienen mas desventaja en clash son los jugadores de flex ya que el sistema de clash te da un nivel individual segun tu liga mas alta y de los 5 integrantes saca un promedio.\nflex es como la liga de mentira ya que la mayoria de los challenger ahi son diamantes en solo q, seria como la segunda liga de diamante salvo por unas muy pocas excepciones.\nImaginate 5 challengers de flex contra 5 challenger de solo q, los destrozan a los de flex.","replies":[{"poster":"DIOS TUTI","date":"2018-06-13T22:56:37.530+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nabuze,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=0004000100000000000000000000,timestamp=2018-06-13T21:25:40.042+0000)\n>\n> si la comodidad que te brinda ser otp es lo mejor, casi ninguna partida salis mal por ende no te flamean y si vas mal sabes exactamente que hacer para remontar, si te juntas con premades adoran el carrito.\n> Tiene muchas ventajas para que el juego sea super sano (al menos con kata solo me flamean enemigos).\n> y la ventaja mas grande, no te aburris de jugar al otp.\n> Tiene sus contras como todo pero es tan comodo ser otp.\n> \n> Obviamente mis otros champs no estan a la altura de mi katarina pero tampoco es como que este otpeando en bronce :/\n> \n> Los que si tienen mas desventaja en clash son los jugadores de flex ya que el sistema de clash te da un nivel individual segun tu liga mas alta y de los 5 integrantes saca un promedio.\n> flex es como la liga de mentira ya que la mayoria de los challenger ahi son diamantes en solo q, seria como la segunda liga de diamante salvo por unas muy pocas excepciones.\n> Imaginate 5 challengers de flex contra 5 challenger de solo q, los destrozan a los de flex.\n\nla mayoria de challengers en flex, son challengers soloq, y si, hay bastantes que son d5 pero olvidate que sean la mayoria, no llegan a los 15, todos los otros son d2+","replies":[{"poster":"Nabuze","date":"2018-06-14T02:04:35.065+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TUTI DIOS,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=00040001000000000000000000000000,timestamp=2018-06-13T22:56:37.530+0000)\n>\n> la mayoria de challengers en flex, son challengers soloq, y si, hay bastantes que son d5 pero olvidate que sean la mayoria, no llegan a los 15, todos los otros son d2+\n\nHace nada me tomé el tiempo para verlos uno por uno y la mayoría era Diamante V fíjate de nuevo  los challenger o diamantes altos son muy pocos.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Kassadán","date":"2018-06-13T07:37:34.309+0000","up_votes":9,"down_votes":1,"body":"Sabes cual es la diferencia del lol y el dota 2? (sin sacar tanto el tema del que se habla) que el dota 2, por mas que sea menos gente que en el lol, se mantiene porque en el dota 2 podes crear tu propio modo de juego.. para los que conozcan, un ejemplo claro y muy conocido es el pudge wars, cosas asi influyen, porque tenes miles de opciones de cosas para jugar), el hots tiene un monton de mapas variados cada uno con diferentes misiones y variabilidad, en el lol son 2 mapas siempre, podes tener un monton de campeones pero llega un punto que ya los conoces todos, sabes lo que hacen, tus amigos dejan el juego porque se embolan igual que vos, y se atrevieron de reworkear a mi old y hermoso viejo shen por esta bazofia que no se puede mirar, y ahora hacen a un aatrox que lo unico que hace es ser un copy-paste de riven con otro trajecito y con robo de vida totalmente innecesario mientras que campeones como nunu, karthus, volibear, etc lo necesitan mas que él.. Por si no se dieron cuenta mientras iba escribiendo, se deberian haber dado cuenta de que rito se enterró solito al haber cambiado cosas innecesarias, volviendo el juego tan repetitivo y tedioso al punto de hasta darte ganas de buscar algun juego para comprar en internet (en mi caso Starcraft 2 <3 ), en fin es mi punto de vista y el por que de ya la comunidad es aburrida y el juego igual, por mas que llenen el juego de recompensas y todo lo que quieran, no va a volver a ser lo que era antes por el simple echo de que lo divertido lo fueron sacando ellos mismos parche tras parche.. año tras año, y porlomenos hasta la s4 era jugable, hoy en dia juego solamente cuando me invitan mis amigos y ya la verdad con pocas ganas acepto.. saludos","replies":[{"poster":"Heavywolf","date":"2018-06-14T04:25:06.287+0000","up_votes":1,"down_votes":0,"body":"Yo me gustaría recalcar algo en lo que decís, **la jugabilidad**. Hace dos años que juego al lol ,estoy en oro 5 por ahi y si algo creo es que  la personalización de personajes debería ser lo suficientemente compleja para que los jugadores veteranos no nos paren de sorprender. \n\nA lo mejor suena soberbio, pero es que siento que el lol esta haciendo lo mismo que hace el OW quiere incluir mucho para abarcar poco y el problema es que el jugador casual viene juega, se estanca, fomenta la toxicidad y se va a otro juego que este de moda a repetir el ciclo.\n\nEntonces en el proceso para traer publico, tenes un juego con personajes chatos en el que sabemos todos lo que hacen, en el que el mayor porcentaje que asegura la victoria en la linea es su poderío general por encima de la habilidad del jugador.","replies":[]}]},{"poster":"Mazoku","date":"2018-06-13T05:22:20.054+0000","up_votes":4,"down_votes":2,"body":"Prefiero guiarme por las estadisticas de op.gg\n\nAño 2015 300.000 jugadores rankeados en las\nAño 2016 400.00 jugadores rankeados en las\nAño 2017 600.00 jugadores rankeados en las\n\nPor ahora vamos 450.000 y faltan un monton de meses para que la gente empieze a grindear las recompensas.\n\nNo lo se rick, parece que el juego va viento en popa en LAS.","replies":[{"poster":"Zoliza","date":"2018-06-13T07:52:00.384+0000","up_votes":7,"down_votes":1,"body":"Cada persona que conozco tiene mínimo 4 o 5 cuentas rankeadas, sin contar que las cuentas que fueron baneadas siguen contando si ya estaba rankeada. \nSin irme tan lejos yo tengo 5 cuentas todas tienen las placement jugadas y yo ya prácticamente no juego al lol, si hacemos un promedio y decimos que la mayoría tiene dos cuentas, main + smurf ya tenes sólo 225k de jugadores y ni siquiera activos porque un alto porcentaje de bronces y de oros suelen dejar la cuenta ahi y no rankean mas. \n\nPd: 2012: 1 cuenta\n      2014: 2 cuentas\n      2016: 3 cuentas    \n      2018: 5 cuentas \n\nAhí tenes el incremento de \"personas\" sin contar que por más prohibido que este el pasar cuentas muchos jugadores que dejan lol regalan sus cuentas y se siguen usando.\nCapaz a final de season tenes 1kk de cuentas rankeadas eso no te garantiza que sean jugadores distintos.","replies":[{"poster":"Renekor","date":"2018-06-13T16:56:15.758+0000","up_votes":1,"down_votes":4,"body":"La mayoria no rankea 5 cuentas, no hables bobadas","replies":[{"poster":"Zoliza","date":"2018-06-13T17:34:59.849+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Renekor,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=000700010002,timestamp=2018-06-13T16:56:15.758+0000)\n>\n> La mayoria no rankea 5 cuentas, no hables bobadas\n\nLa mayoría de los de tu elo quizás,  de platino para arriba no conozco una persona que no tenga mínimo 3.\n\nVos usas una sola cuenta y sólo jugas las 10 placement por season eso no es lo que hacen todos y aún así vos figuras como alguien rankeado al igual que está cuenta cuando sólo jugué 10 ranked.","replies":[{"poster":"The UnshackIed","date":"2018-06-14T01:36:38.795+0000","up_votes":2,"down_votes":0,"body":"tu mismo lo has dicho, ahora dime, cuantos jugadores hay de platino para arriba, el 10% creo, verdad?","replies":[{"poster":"Zoliza","date":"2018-06-14T07:02:28.643+0000","up_votes":1,"down_votes":0,"body":"Capaz no tienen 5 pero si tienen dos rankeadas ya basta para cortar a la mitad los jugadores, lo que tenes que entender es el concepto de lo que hablo no los números puros porque claramente son incomprobables, no se puede sacar un promedio de cuentas smurf ni riot lo daría porque no le conviene.","replies":[]}]},{"poster":"Renekor","date":"2018-06-13T17:37:01.837+0000","up_votes":2,"down_votes":1,"body":"Un verdadero macho juega con una sola cuenta","replies":[{"poster":"Zoliza","date":"2018-06-14T07:28:00.360+0000","up_votes":1,"down_votes":0,"body":"Si jugará sólo normales como vos nunca hubiese tenido más de una cuenta tampoco. Todas las smurf tienen un propósito, que después las deje tiradas o no es otro tema.","replies":[]}]}]}]},{"poster":"Mazoku","date":"2018-06-13T11:25:39.591+0000","up_votes":1,"down_votes":2,"body":"> Cada persona que conozco tiene mínimo 4 o 5 cuentas rankeadas\n\nPerdon pero eso se invento ahora?\n\nJAJAJAJA","replies":[{"poster":"Zoliza","date":"2018-06-13T17:26:29.320+0000","up_votes":4,"down_votes":0,"body":"No , pero hablar de aumento de jugadores cuando siempre son los mismos hace muchas season y jugadores nuevos hay cada vez menos..","replies":[]}]}]},{"poster":"Corchito","date":"2018-06-13T17:51:47.866+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mazoku,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=0007,timestamp=2018-06-13T05:22:20.054+0000)\n>\n> Prefiero guiarme por las estadisticas de op.gg\n> \n> Año 2015 300.000 jugadores rankeados en las\n> Año 2016 400.00 jugadores rankeados en las\n> Año 2017 600.00 jugadores rankeados en las\n> \n> Por ahora vamos 450.000 y faltan un monton de meses para que la gente empieze a grindear las recompensas.\n> \n> No lo se rick, parece que el juego va viento en popa en LAS.\n\nHace un tiempo a un rioter o al que escribió la noticia se le escapó el número de jugadores tirando un dato indirecto en los eventos locales, no recuerdo si era \"soy lolero\" o similar. Cuando hacías el cálculo daba que había alrededor de 100.000 jugadores en LAS. Si lo encuentro lo expongo.","replies":[]},{"poster":"Ellora","date":"2018-06-13T14:07:56.639+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mazoku,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=0007,timestamp=2018-06-13T05:22:20.054+0000)\n>\n> Prefiero guiarme por las estadisticas de op.gg\n> \n> Año 2015 300.000 jugadores rankeados en las\n> Año 2016 400.00 jugadores rankeados en las\n> Año 2017 600.00 jugadores rankeados en las\n> \n> Por ahora vamos 450.000 y faltan un monton de meses para que la gente empieze a grindear las recompensas.\n> \n> No lo se rick, parece que el juego va viento en popa en LAS.\n\nNo te confundas con los que rankean, son los mismos jugadores de normales que ahora como cualquier manco puede escalar se pasaron a ese modo,  gracias a que las ranked se facilitaron.","replies":[]},{"poster":"Názer","date":"2018-06-13T05:57:53.305+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Mazoku,realm=LAS,application-id=v7qsfXsE,discussion-id=aBPYF3oY,comment-id=0007,timestamp=2018-06-13T05:22:20.054+0000)\n>\n> Prefiero guiarme por las estadisticas de op.gg\n> \n> Año 2015 300.000 jugadores rankeados en las\n> Año 2016 400.00 jugadores rankeados en las\n> Año 2017 600.00 jugadores rankeados en las\n> \n> Por ahora vamos 450.000 y faltan un monton de meses para que la gente empieze a grindear las recompensas.\n> \n> No lo se rick, parece que el juego va viento en popa en LAS.\n\nTe entiendo, pero eso no dice mucho ya que en años pueden variar entre jugadores que juegan ranked o tal vez no, incluso lo mas probable es que jugadores antiguos se crean smurf y rankean teniendo 2 a mas cuentas en total, así que quizás no encuentre mucha validez para mi opgg , ya que para descargar el lol tienes que ir a un buscador y el buscador predeterminado es google donde tienes que poner lol y en su pagina sale la descarga, por lo que si menos gente esta descargando el juego pero si existe un aumento de jugadores en ranked significa un aumento de cuentas smurf quizás.","replies":[{"poster":"Cuchufleitor","date":"2018-06-13T06:34:30.131+0000","up_votes":2,"down_votes":0,"body":"Lo de las smurf pasa desde siempre. Es verdad que los jugadores de ranked no son el total, pero es una tendencia y los porcentajes suelen ser muy parecidos todos los años. Asi que si habia el doble de rankeados en 2017, seguramente habia el doble de players tambien. Ademas te das cuenta por el numero de expectadores de las partidas que año a año son cada vez mas. Fijate los numeros de expectadores del mundial en 2015 y 2017, hay una clara diferencia.","replies":[]}]}]},{"poster":"Salvor","date":"2018-06-13T03:38:06.668+0000","up_votes":7,"down_votes":1,"body":"Por alguna razón esa caída que muestra google trends (y que vos citas en este post) también le pasa a la mayoría de juegos de \"la competencia\".\nhttps://i.gyazo.com/3e7533fe7a4e00ca13ac221a3a31a7d3.png\nhttps://gyazo.com/9fe79cf5eb2fbf7db655f03f85a0edc4.png\n\nEs un tema que da para largo la verdad, pero la posta la tiene Riot, que tiene los números.\nEspero que ellos sepan que hacer.","replies":[]},{"poster":"Wawüz","date":"2018-06-13T03:34:18.890+0000","up_votes":7,"down_votes":1,"body":"Oí en algun sitio que RIOT prefiere centrarse en que los viejos jugadores no abandonen el LOL a que vengan nuevos jugadores, aun asi es notoria la publicidad que esta haciendo en distintos sitios web, sobretodo en YT, de cada 5 comerciales que veo 3 son de LOL. Ante juegos como PUBG, OW, y el temido Fortnite varios otros juegos estan experimentado una caida de jugadores y desde afuera puedo ver que año con año la competencia se hace mas fuerte en los videojuegos. Otras personas solo se terminan aburriendo por que les llego la hora de hacerlo, otras como yo tiene epocas de vicio, juegan mucho cierto tiempo luego apenas entran durante unas semanas o meses para despues volver con fuerza otra vez, son como pequeños descansos que se dan.\n\nInnegablemente el LOL esta perdiendo gente algunos era de forma inevitable (como los puntos ya antes mencionados) y en otros casos creo que si se podria haber hecho algo para que esa gente no se vaya.","replies":[{"poster":"Mascheranox","date":"2018-06-13T13:28:05.949+0000","up_votes":2,"down_votes":0,"body":"temido Fortnite XD\nese juego me gustaria si no tuviera esa parte de construir","replies":[]}]},{"poster":"Winter Lion","date":"2018-06-13T10:46:11.356+0000","up_votes":4,"down_votes":0,"body":"a nadie mas le parece un poco desencajado que si en teoria hay menos jugadores, el servidor colapse cada vez que sacan un juego rotativo como urf?","replies":[]},{"poster":"TeamSayori","date":"2018-06-13T08:30:57.003+0000","up_votes":3,"down_votes":0,"body":"el google trends solo refleja la busqueda, no la cantidad de jugadores, yo hace mucho no busco nada relacionado al lol en google xd","replies":[]},{"poster":"Az1n","date":"2018-06-13T07:30:17.251+0000","up_votes":3,"down_votes":0,"body":"La verdad es que el juego en si no se va a \"morir\", porque es un juego ya con una comunidad muy grande y si Riot ve que en  algún momento la caga y esta perdiendo gran cantidad de usuarios va a sacar algo que nos guste a la comunidad y listo, todos contentos y volviendo.\n  Lo que esta pasando actualmente es que tenemos una comunidad extremadamente toxica, es verdad que en los niveles bajos no se puede ni jugar de tantos flameos, y como lo dijo uno ahí así no llegan jugadores nuevos..\n A mi pareces las políticas de Riot son estúpidas y algunas sin sentido, yo creo que deben ser mucho mas firmes a la hora de aplicar sanciones... He hablado con alguna persona que otra del soporte dando \"consejos\" para que se los comenten a los riotes... Pero no, es OBVIO que ellos no van a ser mas duros con sus baneos... ¿Saben porque? Segun la creencia popular la mayoría de estos niños que flamean son los que hacen que el juego gane mas y mas $$$, debido a que piden dinero a sus padres para skins,etc...\n No digo que no haya gente seria o adulta que compre skins, es mas, conozco a gente así... Pero se imaginan si Riot de verdad baneara a todos esos tóxicos que se creen mejor por tenes skins o algo así?\n El juego la verdad esta bien hecho, a pesar de la gran cantidad de errores que se experimentan es un buen juego... Pero el problema esta en la sucia comunidad que tenemos, y por razones ya explicadas el soporte a manos de Rioters no van a hacer nada al respecto.\nPD: Es verdad que el soporte si funciona bien, y lo he comprobado por mis propios medios, siempre ando reportando a trolls,afk's,flammers,etc y hacen muy bien su trabajo...  ¿Pero saben donde esta el problema?\nEs simple y sencillo, si los programadores quisieran crean una blacklist (Lo cual un programador inexperto podría hacerlo, es super fácil) y tachan todas las palabras sancionadas.  [Todas aquellos insultos que salen ***** cuando los escribes, entonces... Dices 1 vez ***** y ya tienes un ban de chat por X cantidad de horas], lo dices 2 veces y ya no puedes hablar por 1 semana, y asi aumentando la cantidad de la sanción.\n Pero entiendanlo, RIOT NO VA A HACER ESTO, y por eso el juego se cae y pierde muchos jugadores, riot las no es una empresa que se preocupe por lo que piense su comunidad, a ellos solo les importa $$$$$, por eso decae! \n\nUn gran ejemplo: Epic Games (La empresa del famoso Fornite)\n  Fornite aumenta y aumenta su cantidad de usuarios debido a que los programadores escuchan a la comunidad, cada 2 o 3 días están actualizando el juego para agregar todo lo que le guste a los usuarios... (Pero obviamente Riot no esta por escuchar a su comunidad)\nY ojo, no defiendo a Epic Games, ni siquiera juego fornite, lo se por un amigo que juega xd.\n\nLes dejo unos videos que tal vez sean de su interés: \n1: https://www.youtube.com/watch?v=bvpvurFiVzg&t=536s\n2:https://www.youtube.com/watch?v=Rpyikdtd4I4\n\n No somos solo los usuarios pequeños quienes nos quejamos, espero algún rioter lea esto :p","replies":[{"poster":"Jeremías 17 5","date":"2018-06-13T20:14:16.490+0000","up_votes":2,"down_votes":0,"body":"Coscu no puede opinar de nada. Y voy a dar 2 puntos de mi opinión (me aburrí a los 3 min de ver el vídeo y me causa rechazo el tipo este):\n\n1- Creo que no tiene sentido que nadie le pague nada por jugar al lol, menos siendo \"Dueño\" de un equipo. Si queres ir, pagatelo vos, así de simple, si sos el dueño. \n\n2- Habla de que Riot quiere plata con las skins/champs/etc pero no es lo mismo que el quiere de su stream y de YT? O hace Streams y sube vídeo por amor al arte? Bueno, Riot no hace skins/champs/etc por amor al arte. Vivimos en un mundo que se mueve por dinero, no por el amor al arte, y que casi todo tiene un valor económico.\n\nBueno, igual sabemos que despues de tantos bans, un toque resentido esta.","replies":[]}]},{"poster":"Cuchufleitor","date":"2018-06-13T06:28:33.669+0000","up_votes":3,"down_votes":0,"body":"Mira, es muy facil, fijate en op gg la cantidad de jugadores totales y claramente en 2017 habia mas jugadores que en 2015. Y si hablamos de la cantidad de expectadores en el mundial, cada año rompen un nuevo record. Posiblemente no se busca mas en google por que o todo el mundo sabe a que pagina ir, o por que lo ponen como LOL o simplemente juegan sin buscar nada.","replies":[]},{"poster":"Medagad","date":"2018-06-13T12:47:45.826+0000","up_votes":1,"down_votes":6,"body":"wachin este juego es una mierda ya, no se preocupan por castigar a la gente que en realidad se lo merece, gente que no sabe jugar, gente que se mete a ranked a trolear la partida, mancos de mierda que no saben ni jugar el match up contra el campeon que mejor usan, (ejemplo, un main rengar que juega irelia, y le toca jugar contra un rengar) a esa gente tendrian que banear, alos mancvos que no quieren aprender a jguar al lol, a los bronces hijos de p*** que no saben ni jugar a esos tendrian que banear, no a los \"toxicos\" que tratan de mejorar en el juego, porque los mancos de mi*** que se dedican a trolear, esos son los verdaderos toxico, y por culpa de eso hay gente flamer, estos mancos de mi*** tendrian que estar dejando el lol, no nosotros los \"toxicos\"","replies":[]}]}