{"poster":"Neopuck","date":"2018-01-29T22:08:44.343+0000","title":":((Ward Item nerfed, gefrorene Herzen gebrochen!!!((-_-'","subforum":"Champions & Gameplay","up_votes":4,"down_votes":5,"body":"Hej hier ist mal wieder euer Neopuck, der Random der dich supportet.\nHeute mal ein kleiner Rage von mir; &uuml;ber das neue bzw nicht mehr alte Warditem (sightstone).\nEs brachte uns Supportern, die ebenfalls gern mal Klavier spielten, den Spa&szlig; am komplexen Gameplay auf der Botlane zur&uuml;ck..\nCDR und viiihiiel Healpoints sorgten f&uuml;r eine dicke Wampe und viel aktive Mitglieder unserer Items, von welchen wir uns nun in traurigem Angedenken, w&uuml;rdig verabschieden wollen: Michael so Glory, E. Solari war stehts ein befreiender Schlag, und vor allem dafug, die Rune welche einen zus&auml;tzlichen eis &auml;hnlich animierten Slow zum \n {{item:3312}}  brachte ist jetzt kaum noch geil (botrk for real?) naja... ich bin auf jeden Fall mies gelaunt, Adc Nerfes... ok, aber warum zerst&ouml;rt ihr den Supporter auf so vielen Ebenen!?!? Danke, dass man jetzt belohnt wird f&uuml;r die blo&szlig;e Anwesenheit und nicht mehr dar&uuml;ber nachdenken darf, was nun f&uuml;r den Spieler sinnvoller und damit dynamischer w&auml;re.","replies":[{"poster":"Oriius","date":"2018-01-29T22:34:13.121+0000","up_votes":3,"down_votes":2,"body":"falls der nerf wirklich so stark ist: in gewissen elos ist supporten ja nicht eh schon abfck genug also nochmal reindrücken :3","replies":[{"poster":"RM Heartmeander","date":"2018-01-29T22:39:09.885+0000","up_votes":2,"down_votes":1,"body":"Na ja da wars je nachdem nen Buff, weil die Leute da kein Warditem kaufen.\nAlso es war ein nerf für den Skill und ein Buff für faule Säcke.","replies":[{"poster":"Shinigami1332","date":"2018-01-30T00:07:04.401+0000","up_votes":1,"down_votes":0,"body":"Gibt vor und nachteile da. Ich habe z.b lieber das ward item und dafür das andere Support item gebaut. Nun gibt es ja nur noch das eine :(","replies":[{"poster":"RM Heartmeander","date":"2018-01-30T01:04:15.490+0000","up_votes":1,"down_votes":0,"body":"Hab ich auch am liebsten gemacht.","replies":[]}]}]}]},{"poster":"RM Heartmeander","date":"2018-01-29T22:29:58.514+0000","up_votes":3,"down_votes":2,"body":"Ich finde es auch sehr Schade dass sie es so gelöst haben.\nIch hätte mir ehrlich gesagt wieder die Ausbaubaren Trinkets für 100 Gold gewünscht.\nIch meine vorher hat es wenigstens was mit skill zu tun gehabt überhaupt ein Warditem kaufen zu können.\nJetzt bekommt es einfach jeder...\n\nUnd die schönen aktiven...\nWürde das Item kein Gold geben, würde ich es gar nicht mehr kaufen, somit spart man ja auch wieder Gold.\nUnd ja mit der neuen Rune hat man CDR auf Gegenstände.\nUnd wieso ist dies denn im Domination Baum und nicht im Supportbaum, wenn sie schon meinen die CDR auf Gegenstände zu entfernen.\nDies wäre auch eine interessante Schlüsselrune gewesen und wenn dies exclusiv für Supporter gewesen wäre (weil es kaum andere aktivierbare Items gibt)\n\nOder warum nicht das Warden dem Jungler überlassen und ihm nen Free Warditem geben mit dem Jungleritem?\nDann hätte der Support immernoch genug Gold für andre Sachen (was für ein Witz, früher hatte der Support wirklich kaum Gold, man erinnere sich an LCS Annie die nur mit Wards und 5er Boots durch die Gegend lief)\n\nIch wäre auch für eine Stärkung der Tower, dass die z.B. 25% True dmg machen, dann wären die Tower auch wirklich gefährlich und Ohmzerstörer wäre ein wirklich viables Item.\nWürde Ebenfalls ADC stärken und Tanks schwächen.","replies":[{"poster":"MeMyselfandBaal","date":"2018-01-29T22:58:20.949+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=RM Heartmeander,realm=EUW,application-id=Wj1wcocU,discussion-id=m38rFHty,comment-id=0000,timestamp=2018-01-29T22:29:58.514+0000)\n>\n>\n> \n> Und die schönen aktiven...\n> Würde das Item kein Gold geben, würde ich es gar nicht mehr kaufen, somit spart man ja auch wieder Gold.\n> Und ja mit der neuen Rune hat man CDR auf Gegenstände.\n> Und wieso ist dies denn im Domination Baum und nicht im Supportbaum, wenn sie schon meinen die CDR auf Gegenstände zu entfernen.\n> Dies wäre auch eine interessante Schlüsselrune gewesen und wenn dies exclusiv für Supporter gewesen wäre (weil es kaum andere aktivierbare Items gibt)\n\nAber... der Domination Baum ist doch der perfekte Support Tree... als Secondary Rune. Mit der ersten kannst du dir dann das holen, was du unbedingt brauchst (je nach Spielweise) und im 2ndary kriegst du die Zombiewards und die Cooldowns auf Aktiv Items.\n \nNebenbei... ähm... also... Aktivierbare Nicht Support Items gibt es auch genug... die 3 Hextech Dinger, Zhonyas, Blade of the Ruined King, Seraphs, den Steinpanzer, Randuims... um mal spontan alle Aktivitems zu kaufen, die ich mir als Support nicht hole... Dann ist da noch dieses Lethality Item \"Saum der Nacht\", Yumos Geistklinge, die 2 Tiamat Items, Zz Rot Portal... und Redliche Pracht + Ritterschwur, die man sich durchaus als Toplane Tank oder Jungler gönnen kann... zumindest wenn man den Profis glaubt... Da kommt man auf ne Menge Items mit Aktiven...\n\nAber ja, die Synergie zwischen Zombieward und Cooldownreduction ist wunderbar und für jeden Support, der sie haben will, verfügbar... Ob das wirklich die stärkste Variante für die Solo Que ist, ist eine andere Frage, aber es ist definitiv eine Option. Zwischenzeitlich bestanden alle meine Runenseiten aus Domination im 2ndary, aber nach dem Zombieward Nerf experimentiere ich da ein wenig...","replies":[]},{"poster":"Marksmansitter","date":"2018-01-30T11:07:15.018+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=RM Heartmeander,realm=EUW,application-id=Wj1wcocU,discussion-id=m38rFHty,comment-id=0000,timestamp=2018-01-29T22:29:58.514+0000)\n>\n> Ich finde es auch sehr Schade dass sie es so gelöst haben.\n> Ich hätte mir ehrlich gesagt wieder die Ausbaubaren Trinkets für 100 Gold gewünscht.\n> Ich meine vorher hat es wenigstens was mit skill zu tun gehabt überhaupt ein Warditem kaufen zu können.\n> Jetzt bekommt es einfach jeder...\n> \n> Und die schönen aktiven...\n> Würde das Item kein Gold geben, würde ich es gar nicht mehr kaufen, somit spart man ja auch wieder Gold.\n> Und ja mit der neuen Rune hat man CDR auf Gegenstände.\n> Und wieso ist dies denn im Domination Baum und nicht im Supportbaum, wenn sie schon meinen die CDR auf Gegenstände zu entfernen.\n> Dies wäre auch eine interessante Schlüsselrune gewesen und wenn dies exclusiv für Supporter gewesen wäre (weil es kaum andere aktivierbare Items gibt)\n> \n> Oder warum nicht das Warden dem Jungler überlassen und ihm nen Free Warditem geben mit dem Jungleritem?\n> Dann hätte der Support immernoch genug Gold für andre Sachen (was für ein Witz, früher hatte der Support wirklich kaum Gold, man erinnere sich an LCS Annie die nur mit Wards und 5er Boots durch die Gegend lief)\n> \n> Ich wäre auch für eine Stärkung der Tower, dass die z.B. 25% True dmg machen, dann wären die Tower auch wirklich gefährlich und Ohmzerstörer wäre ein wirklich viables Item.\n> Würde Ebenfalls ADC stärken und Tanks schwächen.\n\nWas hat es denn mit skill zu tun sich mit 800g nen sightstone zu kaufen ? Das war absoluter Standard. Es gibt keinen klar definierten Supportbaum, man kann in jedem Baum gehen in den man möchte, von daher kannst du auch die CDr mitnehmen, wenn du unbedingt willst.\n\nDeine Änderungsvorschläge sind meiner Meinung nach sinnlos. Du scheinst dss visiongame nicht wirklich zu verstehen.","replies":[{"poster":"RM Heartmeander","date":"2018-01-30T20:44:01.799+0000","up_votes":1,"down_votes":0,"body":"Und trotzdem haben es sehr viele nicht hinbekommen dies zu kaufen weil kein Skill.\nDa Sightsotne kein Schaden gibt haben es teil Leute nicht gekauft und daher haben sie keine Wards gehabt.\n\nFür was haben denn die Bäume überhaupt Namen, wenn sie nicht definiert sind?\nEs gab schon immer Offensiv, Defensiv und Utility.\n\nEbenfalls wie jetzt Präzision AS gibt usw.\n\nUnd inwiefern sind meine Änderungsvorschläge sinnlos?\nWieso sollte ich das Visiongame nicht verstehen?","replies":[{"poster":"Marksmansitter","date":"2018-01-31T01:25:10.054+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RM Heartmeander,realm=EUW,application-id=Wj1wcocU,discussion-id=m38rFHty,comment-id=000000010000,timestamp=2018-01-30T20:44:01.799+0000)\n>\n> Und trotzdem haben es sehr viele nicht hinbekommen dies zu kaufen weil kein Skill.\n> Da Sightsotne kein Schaden gibt haben es teil Leute nicht gekauft und daher haben sie keine Wards gehabt.\n> \n> Für was haben denn die Bäume überhaupt Namen, wenn sie nicht definiert sind?\n> Es gab schon immer Offensiv, Defensiv und Utility.\n> \n> Ebenfalls wie jetzt Präzision AS gibt usw.\n> \n> Und inwiefern sind meine Änderungsvorschläge sinnlos?\n> Wieso sollte ich das Visiongame nicht verstehen?\n\nDas man kein Sightstone gekauft hat kam aber nur in Bronze und vllt silber regelmäßig vor, was ich egtl auch nicht mal glaube. Es ist nunmal standard. \n\nKlar haben die Bäume Namen aber du kannst nehmen was du willst, ob das jetzt immer sinn macht ist eine andere Sache aber alles was für den Support nützlich ist, ist meiner Meinung nach auch machbar in den Runen und sinnvoll.\n\nWieso sollte es dem Jungler überlassen sein für Vision zu sorgen bzw. größtenteils ? Wenn es utility/support jungler sind dann kaufen die auch das Jungle item mit den wards. \nEin supporter braucht nicht so viel Gold wie ein adc oder midlaner um effektiv zu sein. Support- und tank-items sind um einiges billiger als damage-items. \n\nNaja kommt mir so vor, weil du es als \"niedere Arbeit\" ansiehst, jedenfalls kommt es so rüber. Warding ist sehr sehr wichtig.\n\nDie Türme sind so auch schon gefährlich wieso sollte man daran etwas ändern ?","replies":[{"poster":"RM Heartmeander","date":"2018-01-31T04:12:37.020+0000","up_votes":1,"down_votes":0,"body":"Es gibt das in jeder Elo, ich habe schon Zyra Main Supporter in Diamant gesehen, der jedes Game ohne rumgelaufen ist. (nein kein Full Build)\n\nDie Bäume haben nicht nur Namen, sondern auch Werte.\nWarum sollte jetzt also ein Supporter Fokussierter Angriff mitnehmen?\nIhm bringt es nicht's.\nGenauso wie Nachbeben einem ADC nicht's bringt.\nUnd genauso verhält es sich mit den entsprechenden Runen, jede ist für eine Klasse zugeschnitten, sei es AS, AD7AP, Leben oder ne Mischung und dazu Tränke.\nIch sage nicht, dass es nutzlos ist oder so sondern nur dass die entsprechenden Runen auch einen Gedanken dahinter haben für was für eine Klasse die ist.\nUnd Supporter bedinen sich nunmal an Utility, schon seit langem.\n\n\nWieso sollte es Supporter überlassen werden für Sicht zu sorgen?\nNur weil die Spieler das irgendwann man so entschieden haben heisst es ja noch lange nicht, dass es so bleiben muss.\nUnd jetzt muss ja niemand mehr zusätzliches Gold ausgeben für einen Sightstone, den gibts gratis.\nWarum also nicht das gleiche mit dem Jungleritem und dafür keinen aktiven Smite mehr?\n\n\nIch sehe es nicht als \"niedrige\" Arbeit an zu warden, keine Ahnung wie du da draufkommst.\nIch sehe es als keinen Skill an, wenn man nicht für Wards sorgen kann und es ist nunmal so dass der Supporter dazu gedrängt wurde zu warden, damit die anderen Laner Schaden bauen können.\nUnd genau das habe ich ja geschrieben, warum sollten Supporter warden müssen und nicht wir in ner vorherigen Season ein ausbaubares Trinket wo alle warden können?\nDann gibt es auch keine Ausreden von wegen wir haben keine Wards, der Supporter ist Schuld.\n\nGefährlich?\nKlar wenn man mal 2 min nen Tower tanken kann.\nWären Tower wirklich gefährlich, dann würde es viel mehr Teamplay erfordern diese einzureissen.\nGlaub mir ich spiele genug Tanks damit ich Tower getankt habe.\nWürden die Tower wirklich gefährlich sein, könnte man auch in Ruhe unter einem Farmen und das würde entgegen den neuen Runen das Spiel wieder verlangsamen.","replies":[{"poster":"Marksmansitter","date":"2018-01-31T04:31:17.106+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RM Heartmeander,realm=EUW,application-id=Wj1wcocU,discussion-id=m38rFHty,comment-id=00000001000000000000,timestamp=2018-01-31T04:12:37.020+0000)\n>\n> Es gibt das in jeder Elo, ich habe schon Zyra Main Supporter in Diamant gesehen, der jedes Game ohne rumgelaufen ist. (nein kein Full Build)\n> \n> Die Bäume haben nicht nur Namen, sondern auch Werte.\n> Warum sollte jetzt also ein Supporter Fokussierter Angriff mitnehmen?\n> Ihm bringt es nicht&#x27;s.\n> Genauso wie Nachbeben einem ADC nicht&#x27;s bringt.\n> Und genauso verhält es sich mit den entsprechenden Runen, jede ist für eine Klasse zugeschnitten, sei es AS, AD7AP, Leben oder ne Mischung und dazu Tränke.\n> Ich sage nicht, dass es nutzlos ist oder so sondern nur dass die entsprechenden Runen auch einen Gedanken dahinter haben für was für eine Klasse die ist.\n> Und Supporter bedinen sich nunmal an Utility, schon seit langem.\n> \n> \n> Wieso sollte es Supporter überlassen werden für Sicht zu sorgen?\n> Nur weil die Spieler das irgendwann man so entschieden haben heisst es ja noch lange nicht, dass es so bleiben muss.\n> Und jetzt muss ja niemand mehr zusätzliches Gold ausgeben für einen Sightstone, den gibts gratis.\n> Warum also nicht das gleiche mit dem Jungleritem und dafür keinen aktiven Smite mehr?\n> \n> \n> Ich sehe es nicht als &quot;niedrige&quot; Arbeit an zu warden, keine Ahnung wie du da draufkommst.\n> Ich sehe es als keinen Skill an, wenn man nicht für Wards sorgen kann und es ist nunmal so dass der Supporter dazu gedrängt wurde zu warden, damit die anderen Laner Schaden bauen können.\n> Und genau das habe ich ja geschrieben, warum sollten Supporter warden müssen und nicht wir in ner vorherigen Season ein ausbaubares Trinket wo alle warden können?\n> Dann gibt es auch keine Ausreden von wegen wir haben keine Wards, der Supporter ist Schuld.\n> \n> Gefährlich?\n> Klar wenn man mal 2 min nen Tower tanken kann.\n> Wären Tower wirklich gefährlich, dann würde es viel mehr Teamplay erfordern diese einzureissen.\n> Glaub mir ich spiele genug Tanks damit ich Tower getankt habe.\n> Würden die Tower wirklich gefährlich sein, könnte man auch in Ruhe unter einem Farmen und das würde entgegen den neuen Runen das Spiel wieder verlangsamen.\n\nKlar das einige keinen Sinn machen, der Punkt ist das man trotzdem variieren kann.\n\nEs ist dem Supporter nicht alleine überlassen, er trägt nur den größten Teil dazu bei. Der Support kann auch nur 3 wards + pink setzen, alle anderen haben durch das trinket auch 2 mögliche wards + pink und der jungler kann sogar ein \"warditem\" bauen. Der support ist nicht alleine für die vision zuständig, das wird igwie nur von vielen so angenommen.\n\nWieso willst du das spiel verlangsamen ? wieso sollten die, die unter dem Turm gedrückt werden mit \"Immunität\" belohnt werden ? Auf 40min spiele in denen einfach nur afk unterm turm gefarmt wird hätte ich keine lust\n\nedit.: das der support in höherer elo keinen sightstone gekauft hat war aber eine absolute seltenheit..","replies":[]}]}]}]}]}]},{"poster":"Marksmansitter","date":"2018-01-30T11:00:49.179+0000","up_votes":1,"down_votes":0,"body":"Support generfed ? Whut?? Durch die Sightstone änderung hat man 800g mehr als vorher. Ich verstehe euch alle nixht 😅 ich bin selber support main und die Änderung gibt dem supporter viel mehr spielraum.","replies":[{"poster":"Qbert","date":"2018-01-30T11:20:51.073+0000","up_votes":1,"down_votes":0,"body":"ich finde auch die Beschwerden merkwürdig .... das einzige was mir aufgefallen ist, dass man nicht mehr deutlich schneller den Sightstone bekommen kann als der Gegner, normal 2 Kills und du konntest ihn kaufen, jetzt musst du die Quest abarbeiten.... \n\nAber alles in Allem fehlen mir zwar ab und zu auch die Items mit den activs, aber ... so habe ich einen Slot mehr Platz und kann länger pinks horten :)","replies":[]}]},{"poster":"Neopuck","date":"2018-01-30T16:50:52.812+0000","up_votes":1,"down_votes":1,"body":"Alle sprechen hier von den Wards in dem Item, oder wie man sie anders bekommt.. es geht um die krasse CDR auf aktivierbare Gegenstände, schließt das aus die Rune mitzunehmen? Die Rune rechtfertigt ein Häufchen 2xa  und eine andere Rune im Inspirationtree rechtfertigt das man das blaue Suppitem wieder zu alter aktivierbarer Edition zurück führt.","replies":[]}]}