{"poster":"wattbatt","date":"2017-03-03T11:29:35.808+0000","title":"garen con thunderlord?","subforum":"Campioni e gameplay","up_votes":2,"down_votes":2,"body":"cheddite? il grasp funziona solo con la q, invece questo anche con la E, tutte quelle di attacco sono inutili....","replies":[{"poster":"Mist3rFl4sh","date":"2017-03-03T11:44:47.877+0000","up_votes":2,"down_votes":0,"body":"Ti consiglio di correggere alcune parole per evitare di fare brutte figure. Riguardante il post... Su garen va bene il grasp quello si usa solo se vuoi giocarlo un po' più offensivo\n\nBuona giornata ","replies":[{"poster":"wattbatt","date":"2017-03-03T11:55:54.546+0000","up_votes":1,"down_votes":0,"body":"che parole scusa?","replies":[{"poster":"Mist3rFl4sh","date":"2017-03-03T12:10:18.440+0000","up_votes":1,"down_votes":0,"body":"Titolo ma già l'hai corretto quindi va bene così, manca \"cheddite\" che va scritto separato ovvero così \"che dite\"","replies":[{"poster":"wattbatt","date":"2017-03-04T11:25:41.994+0000","up_votes":1,"down_votes":0,"body":"Ma queste sono correzioni di grammatica!!!! Mi hai fatto prendere un colpo pensavo di essere andato contro le regole del forum in qualche maniera. Come sei pignolino eh, per due lettere.","replies":[{"poster":"Mist3rFl4sh","date":"2017-03-04T12:55:02.453+0000","up_votes":1,"down_votes":0,"body":"LOL, man io te l'ho detto per non farti fare brutte figure non perché non pignolo °_°. E poi la anche se un banale errore grammaticale,  è comunque un errore che tutti quanti noteranno; cerca di scrivere con più accuratezza la prossima volta :)","replies":[]}]}]},{"poster":"NiraBlade","date":"2017-03-03T12:08:37.820+0000","up_votes":1,"down_votes":0,"body":"\"thunderlord\" invece che \"thinderlord\" --> scusa se mi sono permessa di correggerti il titolo, mi stava triggerando male :V\n\nedit: anyway, quoto Ringiel; per andare di thunder dovresti sacrificare la versione tank, andando full danno per poterne usufruire al 100% (neanche tanto, non ha questi grandi scaling AD, presenti solo su 2 abilità) e imho il gioco non vale la candela sopratutto se il tuo team ha solo te come tank.","replies":[]}]}]},{"poster":"Ringiel","date":"2017-03-03T11:49:21.341+0000","up_votes":1,"down_votes":0,"body":"è viabile,anche se il grasp funziona meglio visto che scala con il 3% del max hp,oltre a darti anche sustain,mentre thunder con _**AD BONUS**_(rune e oggetti)","replies":[]}]}