{"poster":"wattbatt","date":"2017-11-27T13:26:28.611+0000","title":"perchè ancora coda da 20","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"ho preso il leaverbuster, ancora da 20 minuti. L&#039;ultima volta che l&#039;ho avuto &egrave; stato 6 mesi fa. Si puo sapere cosa (bestemmia) si deve fare per farlo scendere a 5 minuti?","replies":[{"poster":"FreaksBane","date":"2017-11-27T14:43:30.957+0000","up_votes":2,"down_votes":1,"body":"non dire (bestemmia) e si risolve tutto. muta tutti i player in game e gioca support nami/soraka così ti onorano quei cojoni e la rito ti (sesso orale) sul tuo (glande)","replies":[{"poster":"Nibbio Bianco","date":"2017-11-27T17:49:00.678+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MB BRO,realm=EUW,application-id=cAOZwaUi,discussion-id=ZLGhxnzK,comment-id=0001,timestamp=2017-11-27T14:43:30.957+0000)\n>\n> non dire (bestemmia) e si risolve tutto. muta tutti i player in game e gioca support nami/soraka così ti onorano quei cojoni e la rito ti (sesso orale) sul tuo (glande)\n\nTi ricordo che è il forum di un gioco 12+...","replies":[{"poster":"FreaksBane","date":"2017-11-27T19:45:36.690+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nibbio Bianco,realm=EUW,application-id=cAOZwaUi,discussion-id=ZLGhxnzK,comment-id=00010001,timestamp=2017-11-27T17:49:00.678+0000)\n>\n> Ti ricordo che è il forum di un gioco 12+...\n\nTi ricordo che le \"nuts\" di tutti si rompono (guarda che gentile ti faccio anche gli inglesismi).","replies":[{"poster":"Nibbio Bianco","date":"2017-11-27T21:53:28.173+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MB BRO,realm=EUW,application-id=cAOZwaUi,discussion-id=ZLGhxnzK,comment-id=000100010000,timestamp=2017-11-27T19:45:36.690+0000)\n>\n> Ti ricordo che le &quot;nuts&quot; di tutti si rompono (guarda che gentile ti faccio anche gli inglesismi).\n\nCosa ti ha portato a rompere le così dette \"nuts\"?","replies":[]}]},{"poster":"wattbatt","date":"2017-11-28T09:32:05.067+0000","up_votes":1,"down_votes":0,"body":"12+ con tutte le graziose fanciulle che ci sono rly? Non almeno 14+?","replies":[{"poster":"Nibbio Bianco","date":"2017-11-28T10:28:07.914+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=wattbatt,realm=EUW,application-id=cAOZwaUi,discussion-id=ZLGhxnzK,comment-id=000100010001,timestamp=2017-11-28T09:32:05.067+0000)\n>\n> 12+ con tutte le graziose fanciulle che ci sono rly? Non almeno 14+?\n\nPEGI 12 = In questo gruppo di età rientrano i videogiochi che mostrano violenza leggermente più esplicita rivolta a personaggi di fantasia e/o violenza non esplicita rivolta a personaggi dall’aspetto umano o ad animali riconoscibili nonché i videogiochi che mostrano scene di nudo leggermente più esplicite. Le espressioni volgari non devono essere forti e non devono contenere imprecazioni a sfondo sessuale.","replies":[]}]}]},{"poster":"wattbatt","date":"2017-11-27T14:46:13.645+0000","up_votes":1,"down_votes":0,"body":"non c'entra il comportamento, è per l'afk","replies":[]}]},{"poster":"CesoiePlastiche","date":"2017-11-28T10:36:46.877+0000","up_votes":1,"down_votes":0,"body":"Il leaverbuster per afk è sempre stato di 20 minuti per 5 partite.","replies":[{"poster":"wattbatt","date":"2017-11-29T08:25:25.064+0000","up_votes":1,"down_votes":0,"body":"La prima volta che l'ho avuto mi ricordo che era 5 da 5 min","replies":[]}]},{"poster":"FreaksBane","date":"2017-11-27T22:11:16.279+0000","up_votes":1,"down_votes":0,"body":"Ho altro da fare HF","replies":[]},{"poster":"Saibbo","date":"2017-11-27T14:24:27.858+0000","up_votes":1,"down_votes":1,"body":"non lasciare partite/lobby/queues","replies":[{"poster":"wattbatt","date":"2017-11-27T14:46:55.147+0000","up_votes":1,"down_votes":0,"body":"questo è un consiglio per non prenderlo, ho chiesto come si riduce","replies":[{"poster":"MisogiKumagawa","date":"2017-11-27T15:50:24.324+0000","up_votes":1,"down_votes":0,"body":"Si resetta ogni season","replies":[{"poster":"wattbatt","date":"2017-11-27T17:00:31.080+0000","up_votes":1,"down_votes":0,"body":"quindi si resetterà a gennaio?","replies":[{"poster":"MisogiKumagawa","date":"2017-11-27T17:20:18.657+0000","up_votes":1,"down_votes":1,"body":"Yep","replies":[{"poster":"FireM1nd","date":"2017-11-27T19:23:10.051+0000","up_votes":1,"down_votes":0,"body":"No. Io ho il leavebuster da 20 Min da ormai 2 anni, e ti posso dire che, è esattamente l'opposto della verginità: si prende ma non si perde. Ora, non sono un Player che afka spesso: credo mi capiti 5-6 volte all'anno,  su una media di almeno 600 - 700 partite giocate. Non flammo, non feeddo. I motivi degli afk vanno da problemi di connessione a impegni imprevisti che richiedono la mia attenzione in quel momento,  leggermente più importanti che finire una partita.  Il punto è che il leave buster non si basa tanto sul numero di partite afkate tanto quanto sulla frequenza.  Inutile dire, ne bastano 2-3 ben piazzate per arrivare alla coda da 20 Min.\n\nLo so, è una vera piaga, una macchia sull'account che però,  non va via. Ho letto un thread un anno fa sul forum NA dove c'era uno che chiedeva con precisione cosa fosse e come funzionasse il meccanismo del leavebuster.   La risposta da parte dei più fu molto esauriente, e tutti concordavano sul fatto che togliere il leavebuster fosse di fatto impossibile. Non perché non si tolga, ma perché viene richiesta dalla rito una partecipazione su lol enorme (in termini di partite giocate, e tempo speso in game) dove durante quel periodo non deve accadere NULLA. NEMMENO UN CALO DI FPS (esagerato, si - rende però il concetto). Ora questo è valido più che altro per il leavebuster da 20 Min.  Questo perché il \"periodo da bravi\" richiesto è molto più lungo e oneroso rispetto alle punizioni precedenti (come ogni cosa in lol). In realtà,  è fattibile solo per gli streamer. Per cui, rispondendo alla tua domanda:\n\nRILASSATI, NON PUOI FARCI UN C***O. Cerca solo di non flammare,  perché per il leavebuster non si becca mai il Ban (a meno di non farlo in ranked - o davvero troppo spesso), ma è una componente molto influente nel caso di analisi di un account sul quale è sospeso un giudizio di Ban.  Tutto fa brodo, per intenderci..\n\nPs: NON SÌ RESETTA CON IL SISTEMA DELL'HONOR. QUELLO È UN SISTEMA A PARTE, CHE VALE SOLO PER IL FLAME/INTING. La prova? Stando a quello chè ho visto scritto nei commenti qui sopra, avrei dovuto tornare automaticamente alla coda da 5 minuti. E invece.. ho chiuso la season con honor 5, preso il lumino,  e un paio di sere fa mi va via la connessione durante un'Aram. Riacceso il router,  trovo il messaggio della rito che mi dice, con dolcezza, che nella nostra relazione non è cambiato nulla, e non le importa quanto io possa essere fedele: continua a non perdonarmi le mie scappatelle con la cosiddetta \"vita reale\" \n\n<\\3\n\n\"Saluti evocatore. Abbandonare una partita è un'infrazione punibile in League... Bla,  Bla..\"\n\nTi voglio bene anch'io,  Rito","replies":[]}]}]}]},{"poster":"Saibbo","date":"2017-11-27T14:50:32.973+0000","up_votes":1,"down_votes":1,"body":"non lo riduci se non lo perdi.... \n{{sticker:slayer-jinx-unamused}}","replies":[]}]}]}]}