{"poster":"wattbatt","date":"2018-07-02T14:21:03.258+0000","title":"Cosa devo fare come toplaner dopo la 1 torre","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"onestamente non perdo pressoch&eacute; mai la lane, al massimo pareggio farmando e non dando kill; ma dopo la prima torre cosa devo fare?\r\nCredo sia quello il punto in cui migliorarmi perch&eacute; mi ritrovo sempre solo a seguire il resto del team dato che contro maghi/ranged/mobility uscito dalla top non posso prendere una cacchio di iniziativa.\r\nDovrei comprare molte controls, wardare tutta la mia lane e continuare a pushare?","replies":[{"poster":"Sorcio84","date":"2018-07-02T14:45:26.806+0000","up_votes":1,"down_votes":0,"body":"vedi come vanno le altre lanes.\nA - prendi {{item:2055}} e mettila nel 3bush nemico, prendi {{item:2057}} e mettila nel bush davanti al red, e pusha la torre. a meno che non saltino il muro, dovresti vederli arrivare\nB - vai a fare l'herald e poi buttalo in una lane appena nei hai l'occasione. se il game va bene puoi riuscire a prendere anche 2 torri\nC - vai mid/bot a mettere pressione, metti una {{item:2055}} nel bush all'entrata della jng nemica vicino al mid, e un {{item:2057}} nel bush del blu nemico. vedi se puoi dare una mano al drake\n\nin sostanza, per vincere metti pressione agli obiettivi e controlla di tanto in tanto la direzione dei minions. e al momento giusto, pulisci per farli pressare la lane, poi gruppa. così i nemici o si dividono per proteggere la torre pressata dai minions, o restano a difendere.\n\nalmeno io applico questa strategia se mi trovo a giocare top","replies":[]},{"poster":"TZombi1234","date":"2018-07-02T14:24:46.009+0000","up_votes":1,"down_votes":0,"body":"Dipende da situazione a situazione:\nCi sono situazioni dove è meglio continuare a pushare per la seconda o magari la terza torre o situazioni dove è meglio roammare o/e cercare dei buon tp da fare sulla mappa(se usi il tp) ecc...\nNon è una cosa che qualcuno ti può dire fa questo e tu lo fai per tutte le partite, ma è un qualcosa che si impara con l'esperienza di gioco per capire qual è la decisione giusta da fare in quel momento ed in quella situazione...\nNon so se sono stato chiaro xD","replies":[]},{"poster":"Giggio","date":"2018-07-02T14:22:59.156+0000","up_votes":1,"down_votes":0,"body":"herald e poi dipende dal campione che hai se è un combattente o uno split push","replies":[]}]}