{"poster":"wattbatt","date":"2017-06-28T20:34:49.871+0000","title":"un aiutino per le skin nei chest?","subforum":"Discussioni generali","up_votes":2,"down_votes":5,"body":"dico, ci sono circa 130 campioni , facciamo di media 3 skin a testa, sono 400 skin....significa che trovarne una di preciso che ti interessa ha una probabilit&agrave; minima... quando si apre un chest non si pu&ograve; mettere una scelta al premio che si riceve? \r\n\r\nPer esempio, il chest decide se la ricompensa &egrave; un frammento campione o skin o lume in modo normale, e se &egrave; skin puoi scegliere se vuoi una skin di un tank, assassino , mago, adc, etc.","replies":[{"poster":"Mix lyc4n ","date":"2017-06-28T23:42:45.151+0000","up_votes":3,"down_votes":1,"body":"Non ti basta una skin gratuita?","replies":[{"poster":"wattbatt","date":"2017-06-29T08:40:03.538+0000","up_votes":2,"down_votes":1,"body":"a cosa serve se su 50 che ne trovo non me ne interessa neanche una, manco rifndendole? è come non aver ricevuto il chest","replies":[{"poster":"Dr LouD","date":"2017-06-29T09:47:21.182+0000","up_votes":1,"down_votes":1,"body":"Sei semplicemente sfigato, non è di certo colpa della Riot ne dovrebbe fare qualcosa a riguardo, già ti stanno dando roba gratis che dovrebbe essere a pagamento lol\n\nChe alla fine anche le chest e le chiavi le ottieni gratuitamente giocando, non vedo dove sia la tua perdita","replies":[]}]}]},{"poster":"RGM Player","date":"2017-06-28T21:45:52.565+0000","up_votes":2,"down_votes":1,"body":"Poi magari nella chest ti chiedono se vuoi essere bronzo 5 o challenger.","replies":[{"poster":"wattbatt","date":"2017-06-29T09:01:21.740+0000","up_votes":2,"down_votes":1,"body":"mamma mia sai che richiestona pretenziosa!!! se scelgo la categoria da un totale di 400 skin la ricompensa viene scelta tra 70-80 skin, roba da mandare in bancarotta la riot vero??","replies":[{"poster":"Mix lyc4n ","date":"2017-06-29T10:20:59.803+0000","up_votes":1,"down_votes":1,"body":"Tecnicamente si.\n\nForse non capisci le spese di un personale e del mantenimento di un gioco(online).\n\n","replies":[{"poster":"RGM Player","date":"2017-06-29T13:02:56.756+0000","up_votes":1,"down_votes":1,"body":"La gente pensa che fare una skin costi pochissimo e ci vuole un giorno, ma non è così. Ci vogliono settimane di lavoro.","replies":[]}]}]}]},{"poster":"Orgazmico","date":"2017-06-29T06:29:58.564+0000","up_votes":1,"down_votes":0,"body":"pensa che fino a 3 anni fa il massimo a cui si ambiva era una skin gratuita l'anno...","replies":[{"poster":"Mix lyc4n ","date":"2017-06-29T10:20:24.783+0000","up_votes":1,"down_votes":0,"body":"E dei 400rp","replies":[]}]},{"poster":"ImSmurfnHolyPogz","date":"2017-06-29T10:58:17.114+0000","up_votes":1,"down_votes":1,"body":"A caval donato non si guarda in bocca. In piu puoi riforgiare 3 shards in una skin gratuita (da 200 a 3250 ip, escluse le legacy). Io c'ho trovato pulsefire ezreal e l ho attivato senza pagare nulla. \n\nVedila come un incentivo a provare nuovi campioni","replies":[]}]}