{"poster":"wattbatt","date":"2017-12-04T16:58:24.233+0000","title":"Dale, il tecnico delle ward","subforum":"Creazioni della community","up_votes":5,"down_votes":1,"body":"Non l&#039;ho pensato per essere realisticamente giocabile ma non &egrave; messo male secondo me\n\n-------\n\nruolo: support, jungler?\nlore: *cercasi loreista per lore decente*\nattacchi melee\naspetto: casco di protezione giallo, giubbetto color evidenziatore, pantaloni larghi con molte tasche, arma: una torcia hextech\n\nSKIN - &quot;ispector de la securit&egrave;&quot; cappello a larghe tese e impermeabile beige, Dale cammina un p&ograve; pi&ugrave; proteso in avanti e con musica di sottofondo opzionale &quot;A shot in the dark&quot; (sotto)\n\n**Passiva- visione potenziata**\n\nDale vede oltre la nebbia per 300 range in pi&ugrave; nella direzione in cui &egrave; rivolto, inoltre\nle {{item:3340}} di Dale sono ward potenziate (sulla mappa sono mostrate in verde).\npossono vedere le unit&agrave; camuffate e durano il 10%-100%(livello) del tempo in pi&ugrave;.\n\n-al livello 6 le ward accumulabili diventano 3 e possono essere piazzate due volte pi&ugrave; lontano\n\n-al livello 11 le ward accumulabili diventano 5, individuano le unit&agrave; invisibili e si ricaricano il 30% pi&ugrave; velocemente\n\n-al livello 16 la velocit&agrave; di ricarica delle ward diminuisce del 70%, il limite di ward sale a 5 e possono essere piazzate lontano quanto {{item:3363}} \nDale non pu&ograve; avere ward diverse da{{item:3340}}  nello slot delle ward.\n\n\n**Q - lume mina (15/14/12/10/8 s)**\n\n_Passiva_ - ogni 13-5 secondi (livello) Dale pu&ograve; sparare la lampadina della torcia in testa ad un nemico, stunnandolo per 1 secondo + 0.3 secondi per ogni ward accumulabile di qualunque tipo e facendo (70% AP) danni bonus, la torcia rimbalza fino a 2 nemici in prossimit&agrave; stunnandoli per met&agrave; durata \n\n_Attiva_ - Seleziona una qualunque ward di Dale sulla mappa per farla esplodere istantaneamente e fare 50/100/150/200/250 (+70% AP) danni magici in un&#039;area e 10/30/70/120/170 danni puri in 4 secondi. Esplosioni secondarie sullo stesso bersaglio applicano solo il 70% dei danni dell&#039;esplosione e resettano i danni puri.\n\nI lumi esplosi non diventano lumi zombi e scacciano qualunque poro fantasma nello stesso bush.\ninfligge il 500% dei danni ai mostri e minion.\n\n**W - protocolli di difesa (0.1 s)**\n\n_Passiva_ - se un lume invisibile amico viene rivelato rallenta la velocit&agrave; d&#039;attacco di tutti i nemici in prossimit&agrave; del 50% finch&egrave; &egrave; visibile.\n\n_Attiva _- selezionare un lume di Dale con questa abilit&agrave; per attivare lume mina automaticamente quando un nemico entra nel raggio dell&#039;esplosione. I lumi selezionati che sono nel raggio di altre esplosioni esplodono anch&#039;essi.\n\n**E- scansione avanzata (ricarica delle ward)**\n\n_Passiva_ - tutte le ward di Dale hanno un raggio visivo aumentato del 20/40/60/80/100%. \nDale ottiene un lume di controllo al primo livello e aumenta il loro limite massimo di 0/1/1/1/2. Dal livello 9 l&#039;abilit&agrave; funge da slot per un secondo tipo di ward.\n\n\n\n**R - Lumetosto (120 s)**\n\nSeleziona un qualunque lume sulla mappa per farlo diventare un lumetosto (limitato a 1). \n\n(immaginatevi un lume normale con gli occhietti e due braccine)\n\nIl lumetosto guadagna 2/3/4 (+1 per 1000 hp) punti vita e attacca il nemico pi&ugrave; vicino con una raffica di pugni a 7(+0.5 per 50 AP) velocit&agrave; d&#039;attacco e 15/20/25 (+30% AP, +90% AD bonus) danni fisici se &egrave; rivelato, automaticamente se non &egrave; un lume invisibile. La raffica di pugni crea degli spostamenti d&#039;aria che rallentano del 30% le unit&agrave; e fanno gli stessi danni fino a 400 range\n\nSe il lumetosto lo era precedentemente, o viene selezionato con protocolli di difesa esplode solo alla morte, inoltre distrugge le ward nemiche visibili. Il lumetosto non &egrave; figo, &egrave; tosto.","replies":[{"poster":"BluCobalto92","date":"2017-12-04T17:40:35.279+0000","up_votes":2,"down_votes":0,"body":"Io come ulti mi aspettavo qualcosa come chiama un supporto aereo che cerca e rileva i nemici in un area selezionata delle dimensioni di 1/4 della mappa per esempio.... E lo illuminava come gli elicotteri della polizia quando seguono i criminali... Finché nn scade il tempo.. O non viene abbattuto","replies":[{"poster":"wattbatt","date":"2017-12-04T17:58:08.575+0000","up_votes":1,"down_votes":0,"body":"bella idea, infatti ho messo la skin da investigatore perchè ero tentato di farlo anche con quel tema, ma investigatore come principale secondo me sarebber da cambiare un pò tutte le abilità per renderlo piu coerente","replies":[{"poster":"BluCobalto92","date":"2017-12-04T18:56:52.098+0000","up_votes":1,"down_votes":0,"body":"Beh non sarebbe male come cosa... Molta utilità.... Specialmente per sapere dove si trova il jng avversario... Aggiungi posti di blocco tipo il muro di anivia fatto da auto della pula e siamo al top...oppure delle strisce chiodate che rallentano o stunnano... Poi nn ho idee per passiva e altre 2 skill.... Supponendo che ha la ulti per trovare gli avversari... Il posto di blocco per intrappolarli.... Serve una skill per la ms per raggiungerli e poi se lo si pensa jng serve sustain","replies":[]}]}]},{"poster":"Cyberpop Ashe","date":"2017-12-06T11:06:31.376+0000","up_votes":1,"down_votes":0,"body":"Non saprei, diventerebbe troppo un Must da avere in team, al lv 18 piazza 5 ward invisibili che rivelano il doppio dell'area e durano il doppio del tempo, + 3 lumi di controllo, praticamente vedi tutta la mappa..\n\nPiuttosto la R mi piacerebbe più così, a sto punto, se proprio dobbiamo fargli rivelare tutta la mappa:\nR: Manomissione\nTutte le Ward nemiche presenti sulla mappa diventano Ward alleate per 3-5-7 secondi","replies":[]},{"poster":"LordDragon991","date":"2017-12-04T18:22:48.723+0000","up_votes":1,"down_votes":0,"body":"wowowwwoww la ulty forse è un pochino troll ma ci sta!","replies":[]},{"poster":"SORA MASTER OF K","date":"2017-12-04T17:38:09.075+0000","up_votes":1,"down_votes":0,"body":"Carino.\nDa senso alle frasi degli streemer che danno consigli tipo: Wardare sempre, la mappa deve essere un fottutissimo albero di natale XD","replies":[]},{"poster":"wattbatt","date":"2017-12-04T16:59:09.594+0000","up_votes":1,"down_votes":0,"body":"musica della skin\nhttps://www.youtube.com/watch?v=Jjq0WDvapow","replies":[]}]}