{"poster":"Lannister9228","date":"2014-08-18T14:31:43.053+0000","title":"Kötetlen beszélgetés a játék idegesítő dolgairól.","up_votes":4,"down_votes":0,"body":"Sziasztok! Ide olyan témákat várok, amik idegesítőek bírnak lenni mind a játék program, működés oldalról, mind pedig a játékosok oldaláról.\r\nKezdem én.:\r\n\r\nAram. Szórakoztató játékmódnak kellene lennie, de nem az. Eddig jó ha volt 10 meccsem, amit élveztem. Minden meccsre kell a cspaatomba legalább 1 (vagy több) afker, illetve 1-2 tökéletesen béna játékos. Oké, nem tudhat mindenki minden hőssel egyformán játszani, de azért az alap dolgokkal csak tisztában vannak. Még nem zavarna, ha az enemy sportszerűen viselkedne. Csak mert fölényesen nyer valaki (független attól, hogy mi milyenek voltunk), nem kéne széjjel spammelni a chatet azzal, hogy easy n00bs......\r\n\r\nMásik az easy témaköre. Ha rajtam múlna (tudom, nem, és szerencsére), akkor minimum permabant kapna az, aki leírja. Rettentően sértő bír lenni, főleg egy olyan meccs után, amiben egészen jól tetted a dolgodat az adott lanen.\r\n\r\nTi jöttök. Beszélgessünk egy jót.","replies":[{"poster":"R3wan","date":"2014-08-18T15:22:38.356+0000","title":null,"up_votes":3,"down_votes":0,"body":"Az a vicc az easy-zésben, hogy általában az mondja, akit carryznek, vagy valami könnyebb karival elfeedelődött és lehozta a meccset. Szóval kb komolyan se kell venni. Ezek ilyen érzelmi nyomorékok, akik az életben nem tudnak érvényesülni és itt élik ki magukat. Vagy szimplán csak tahók. Megy neki egy report, meg egy ignore a meccs végén és viszlát. \nA magyarok meg olyanok, mint az összes többi. Vannak normálisak és nem normálisak. Pont ugyanúgy ignorálok egy magyart, mint egy másik nemzetiségű embert. Ha meg jó fej, akkor legyen akárki fia-lánya, akár fel is veszem barátnak, hogy később játszhassunk újra.\n\nDe ugyanúgy nagyon zavaró, mikor aram-ról valaki azért lép ki, mert nincs rerollja, vagy nem cserél vele senki, így majdnem minden meccs csak 2-3 nekifutás után indul el. Az ilyen kilépegetőknek kilépésenként adnék egyre nagyobb büntetést, hogy elgondolkodjanak.","replies":[{"poster":"VampVik","date":"2014-08-19T14:29:00.487+0000","title":null,"up_votes":4,"down_votes":0,"body":"Meg kéne csinálnia Rito bácsinak, hogy a rendszer megjegyezze a kilépő bajnokát, és ahogy kilépésnél a reroll-t sem kapja vissza a kilépő, úgy következő ARAM-jára automatikusan kaphatná azt ami miatt előtte kilépett. Így nem lenne értelme kilépni. De sokszor használtam a \"kilép\" szót...\n\nGG easy-n én csak mosolyogni szoktam, de akit zavar az miért nem kapcsolja ki az all chat-et? Ott általában úgy is csak a flame jön, semmi haszna nincs belőle annak aki magára veszi.","replies":[{"poster":"BÜDÓSROMÁNERIK","date":"2014-08-20T02:15:37.200+0000","title":null,"up_votes":5,"down_votes":0,"body":"Én szívem szerint már annak is örülnék, ha rankeden nem olyanokkal tenne össze, akiknek 2700 leavepointjuk van, főleg, amíg nekem 0 van. Az már csak a hab tortán, hogy egészen véletlenül rendre promókon kapok ilyen nyomorékokat. Itt nem arról van szó, hogy máskor nem nézem meg, és ezért tűnik csak úgy, mintha csak promón kapnék ilyeneket... Olyan mintha promón alapból válogatná a nyomikat a csapatba... Legyen 1 olyan, akit az elmúlt 20 meccsén 17x reportoltak Unskillednek, legyen 1 olyan, aki 10 meccsből 5x kilép, meg egy olyan, aki 1 halál után azt mondja, hogy retard a jungler, és már vesztettünk, vége mindennek, surrat20,  aztán megy feedelni, csak ne vesztegessük a drága idejét...\n\nEsküszöm, bronz4-től silver3-ig elszántabb, és odaadóbb emberekkel játszottam, mint silver 3 felett. Ha irányítottad őket, és bejött, onnantól itták a szavaidat, az utasításaidat - még akkor is, ha néha hibáztál. Igyekeztek azt csinálni amit mondtál nekik, és nem egymást buzerálták ha valami nem sikerült, hanem beírták, hogy \"sry, its my fault\", és mindenki törekedett arra, hogy azt a kis dolgot, ami az ő feladata, azt akkor és úgy csinálja, amikor, és ahogyan kell. Aztán nyertetek, és megköszönték, hogy irányítgattad a játékot. Nem úgy mint silverben, hogy \"na én már silver vagyok, nekem senki nem mondja meg, hogy mi a jó, tudom én azt pontosan, mindenki más meg kapja be.\" vagy \"nem az én hibám, hogy már harmadszor viszi el az ellenfél dzsungelese a kéket, hanem mindenki másé, aki nem wardolja meg fedezi amíg én oda nem érek két halál között\" :DDDD\n\n\"easy\": ma pont megkaptam egy 2/7/19-es ashe-tól egy \"easy\"-t, akit earlyben 6/1-be vertem/vertünk boton (plussz a supportom killjei, amiket elvitt véletlenül). Igaz, hogy a 6/1-ből aztán 9/10/7 lett, de ez nem számít ebben a kontextusban. Kikaptunk, és pont az az utolsó nyomorék ashe írta be azt, hogy \"easy\", akin aztán a legkevésbé múlt, hogy nyernek-e vagy sem....\n\nAhogy mások is írták, akármi volt egy meccsen az \"easy\"-ért bárkit reportolok - még csapattársat is. Lehet, hogy tényleg könnyű győzelem volt, de az \"easy\" az akkor is arrogáns kifejezés, akárki írja. Szóval nálam is az \"easy\" az élből report.","replies":[]},{"poster":"R3wan","date":"2014-08-19T18:01:19.275+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez egy tök jó ötlet. :) Megérdemelnék az ilyenek. :) Vagy azt a champet kapja, akivel a legrosszabbul szokott teljesíteni. :D\n\nGG easy meg igen, csak szánakozva lehet az ilyenre nézni. Épp az imént kaptunk ki 4v5-ben, kezdettől fogva kevesebben voltunk. De így is 70 percükbe telt lenyomni minket. Aztán a végén a Draven nyomatta a szöveget. Persze már fel se veszem, főleg, hogy earlyben egyedül voltam ellene és Sona ellen és egyszer nem bírtak megölni, csak amikor már a jungeles is befutott. Szóval ennyit az ilyen kis nyomorékokról. :) Írtam is neki meccs után, hogy fap time for Draven. Biztos a lelkébe gázoltam, mert nagyon elkezdett magyarázni. :D","replies":[]}]}]},{"poster":"Holdpille","date":"2014-08-19T10:48:51.484+0000","title":null,"up_votes":3,"down_votes":0,"body":"A legproblémásabb a lolban hogy túl népszerű, ennek okán túl sokféle ember játssza és a legtöbbnek nincs fogalma róla hogyan kéne internetes etikettet minimálisan betartani.  \nEzért már leszoktam hogy próbáljak idegenekkel együtt játszani, mivel minimum egy képtelen normálisan elviselni a vereséget ha úgy állunk vagy feleslegesen nagyoskodik ha a nyerünk. Az afk-zó és hisztis csapattagokól ne is beszéljünk.\nSajnos volt hogy magyar csapatot hagytam ott mert képtelenek voltak rage nélkül játszani és folyamat hallgatni őket veszett rossz volt.  \nHa valaki easy-zik a végén tőlem insta kapja a riportot az ilyen hasonlókért. \n\nAz aramos folyamatos leavek annyira nem zavarnak, inkább leaveljen mint olvassam mennyire szarok vagyunk mert ő ilyet vagy olyat kapott. \n\nÉn már alig várom hogy csináljanak végre valamit a törvényszékkel mert néha az lehet érezni hogy túlságosan sok az idióta ebben a játékban. Kéne némi visszatartó erő.","replies":[]},{"poster":"Mind The Gap","date":"2014-08-18T15:13:26.584+0000","title":null,"up_votes":3,"down_votes":0,"body":"Én speciel azokat a magyarokat gyűlölöm, akik nem tudnak köszönni, a játék kellős közepés írok valamit a chatbe, akkor meg azzal kezdi, hogy \"kussolj\", meg hogy \"buzi\" vagyok, és ugye nem tudom. A másik fele pedig a nagyon flamer rész, ahol, ha ellenséges csapatban vannak magyarok, akkor nagyon bunkóak, mert, ha veszít a csapatom, akkor elkezdenek mindent, hogy \"noob vagy\", \"szopjál\" és sorolhatnám. Szánalom. Az ilyen embereken látszik is, hogy nem tudnak szocializálódni, mert ahelyett, hogy minimum köszönnének, még be is szólnak neked. Ember, örülök, ha tudok egy magyarral kommunikálni.","replies":[]},{"poster":"ShakuChan","date":"2014-08-20T16:54:01.088+0000","title":null,"up_votes":2,"down_votes":0,"body":"Engem az idegesít igazán, hogy ha a mi csapatunk áll rosszul, akkor valaki mindig flamelni kezd, összevesznek, megy az anyázás - a meccs végén talán a report is. Mivel folyton szidják egymást, így a játékra már nem is tudnak odafigyelni, és én próbálok békíteni, és megakadályozni, hogy valamelyik okos elmenjen trollkodni, vagy afk-nek, de még ez is időt és figyelmet vesz el, marhára nem tudunk fordítani, mivel az enemy persze odafigyel, nem szokták annyira elbízni magukat, hogy érdemes legyen egyáltalán megpróbálni az 1v5-öt...\n\nNa de ha az enemy áll vesztésre! Late game-re valahogy összeszedik magukat, senki sem megy afk-nek, és a meccs végén is beírják, hogy gg, nice team...Nagyon rossz helyzetből képesek fordítani úgy, hogy összejátszanak, kommunikáció van köztük! \n\nItt meg...Nem értem, nem értem, miért mindig én kapok az \"idegbegyütt állapotúakat\", mikor én soha nem bántok senkit, max. tanácsot adok, de azt is szépen, hogy még véletlenül se tűnjön sértegetésnek. >.<","replies":[]},{"poster":"mmateexd","date":"2014-08-18T16:07:48.476+0000","title":null,"up_votes":2,"down_votes":0,"body":"Nagyon idegesítő hogy mikor aramozok akkor mindig két csapat felépítés van\n\n1.teamben van 2 adc és a többi karakter papír\n\n2.teamben meg nincs adc viszont tele van tank és fighter karakterekkel....\n\nMeg volt már olyan is hogy én kaptam Sorakat és ezen kívül volt egy Blitzcrank és egy Morgana is a csapatban de adc egy sem....\n\nNálam szinte mindig ez van 10/9 meccsen kb úgy van ahogy leírtam fent :)\n\n\nEasy megnyilvánulást én is utálom az enemytől mert legtöbbször azok írják akik k*rvára nem tudnak játszani vagyis az adott gameben nem raktak sokat hozzá....\n\nNálam Silverben gyakori a gg easy...noobs kifejezés,gondolom a sok 12 éves így jobban érzi magát és megnyugszik a kis lelkük ettől hogy leírhatják...ilyenkor szoktam azt hogy ha utána is gg easy megy a chatban akkor reportolom.\n\n\n\nRankedon még mindig nem tudják mi a pick order kifejezés és ettől sírni tudnék. Legtöbbször azok vannak kiakadva akik 4.-5.helyen vannak és pl. midre vagy topra akarnak menni de az 1. és a 2. emberke befoglalja azt. Ilyenkor mennek a low,retard,delete lol kid kifejezések.Ilyenkor tudom már hogy bukta van mert azokkal együtt játszani és megnyerni a teamfightot nem lehet :D","replies":[]},{"poster":"ixikecske","date":"2016-07-03T16:23:13.444+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én azt utálom, hogy ha az ellenség csapata jó, kommunikálnak (talán), és ők állnak nyerésre, akkor valaki MINDIG elkezdi hogy\" %%%%%% feeder noob team.\" És ha mondom neki, hogy csak az ellenség jó \"of course, feeder.\"\n(És amúgy mondja nekem a 2/10-es statjával, az én 5/4-es statomhoz)","replies":[]},{"poster":"Lannister9228","date":"2014-09-28T17:40:43.319+0000","title":null,"up_votes":1,"down_votes":0,"body":"Valaki látogatja még ezt a beszélgetést??","replies":[]},{"poster":"Lannister9228","date":"2014-09-02T19:29:54.682+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem tudom, szoktátok-e még nézegetni ezt a témát, de azért én írok. Az első, leginkább zavaró tényező a játékban, az a ranked rendszer, és annak a \"Hogy a f*szba\" működő meccs-kreáló rendszere. Gondolok itt arra, hogy oké, mmr meg egyebek, na de kérem, amikor jobban játszom mint egy silver 3-as (bronz 1-ben), de a teamem elbassza a meccsemet, akkor valahogy nem éppen a testvéri szeretet gondolatai keringenek a fejemben a csapattársaim iránt....","replies":[]},{"poster":"Marcixd11","date":"2014-08-21T14:42:02.701+0000","title":null,"up_votes":1,"down_votes":0,"body":"Engem az idegesít hogy volt amikor úgy álltam hozzá hogy a jungle a legizgalmasabb szerep és meg akarok tanulni. Ekkor rájöttem hogy ha valaki meghal akkor biztos a jungle a hibás. Elismerem nem vagyok profi a jungleben legalábbis én úgy gondolom. De valahogy mégis jól megy amikor nem olyanokat kapok csapatnak akik egész meccs alatt nyomják a \"Gankelj már NOOB. Nem érdekel hogy az enemy topos már 6/0-ban van de én azért is pusholok mint egy idióta és próbálok 1v1-ezni. De a jungle a noob mert nem jön gankelni.\" szöveget.","replies":[]},{"poster":"Lannister9228","date":"2014-08-20T12:15:30.682+0000","title":null,"up_votes":1,"down_votes":0,"body":"Még az is idegesít engem néha, hogy van 1-2 ilyen rejtélyesen működő játékmechanizmus. Ignite az egyik (én rárakom x hp-n, túléli, ő rámteszi ugyanannyi hp-n, meghalok). Az armor&mr a másik. Minek vannak bent, ha kb semmit sem érnek? Vehetek én bármennyit, az ap-s rittig megesz (nem feedesnél is előfordul), az ad-s meg 1-hitel, amikor van egy szép adag armorom. \n\n(Rajtam múlna, lenne bent a játékban egy chat-figyelő rendszer. Leírtad hogy easy? permaban. Természetesen figyelné a szövekörnyezetet is, hogy a segítő mondatokra ne bannoljon (pld.: I know it's an easy game for us, but you should try it harder to win). Persze, ez csak álom....)","replies":[]},{"poster":"Talenton","date":"2014-08-20T11:38:40.692+0000","title":null,"up_votes":1,"down_votes":0,"body":"A legidegesítőbb dolgok egyike a netikett be nem tartása (flame, rage, \"easy\" vagy csak a cpas on) A másik a \"report (top/mid/bot/jung) for .......\" És bizony a \"pontpontpont\" helyét gyakran a feed van beillesztve. Attól még, ha valakit, elvernek a saját lane-én nem azt jelenti, hogy nem tud játszani, csak azért, mert nem tud 100%-os teljesítményt nyújtani minden játék alkalmával, még inkább indokolatlan, ha normal game-ben hangzik el a dolog, mert a szándékos feedelés más tészta, de ha valamelyik csapattársamnak ilyen nagy az arca, akkor lehet gankelni, ha látom, hogy a botnak nem megy a játék, és nem megy a flame, (ami tisztelendő) szólok a jungelesnek, hogy mozdítsa meg a seggét és menjünk le ketten gankelni botra a siker érdekében, NEM KEZDEK REPORTOT ORDÍTANI!  A report meg fölösleges, a Riot nem szokott sűrűn bannolni. Csak az ignore az egyedüli lehetőség, mindenki egy esélyt kap nem többet, aki beszól instant ignor. Ezen kívül nagy probléma az \"ss\" nem tagadom hasznos, de ha nem írok ss-t akkor mindenki blamel mert az én hibám, hogy megölték, mert csak a support az aki wardol......most nem azt akartam mondani, hogy sosem írok ss-t, de van olyan szituáció amikor mással vagyok elfoglalva, vagy nem vagyok lane-en. Tehát lehet nézni a map-ot mert arra találták ki, és ha én tudok wardot venni midre más is tud a saját lane-jére. Solo Q-ban is magadra vagy utalva, nem fognak pesztrálni. Én is tudom mikor nem teszek wardot és megölnek, az az én hülyeségem volt, nem pedig azért, mert pl. a topos nem írt ss-t, látnom kellett volna. Használjuk az ss-t, mert jó dolog, de azért nem kell mindig mindent a másikra fogni.","replies":[]},{"poster":"Mókusmedve","date":"2014-08-20T10:33:13.368+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én néhány skillshot hatóköre miatt akadok ki. Amikor arrébb lépek, hogy elkerüljek egy Morgana q-t vagy egy Jinx w-t, és hozzám sem ér, elsuhan(na) mellettem, mégis elér.","replies":[]},{"poster":"zrs1337","date":"2014-08-19T18:47:17.771+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hát igen az ARAM elég idegesítő tud lenni, mert kb. 10x kell elfogadnon a játékot mire nem lép ki valaki. Aztán ha elindul a játék, mindig van legalább 1 AFK, de ez dominionban is így megy, eddig mindig találkoztam ott AFK-val.\n\nA gg easy tényleg idegesítő, főleg mikor olyanok írják, akiknem lecarryzték a meccset vagy csak 4v5 volt.\n\nIdegesítő még a \"KS\" kifejezést használata... Ma is volt olyan, hogy 1v1ezek az enemyvel, 90% hpját leveszem, jön a midesünk rányom 1 spellt aztán én megölöm az enemyt és jön, hogy KS...mert hogy én jungler vagyok nekem nem kell kill... Volt olyan is, hogy a midesünk elvett egy killt az ADC-től, és akkor mondja, hogy \"ok i'm afk bb\" és tényleg őt ott befejezte és free win meccset buktuk, mert igaz, hogy már el volt feedelve, de minden killt neki kell kapni, mert ha nem akkor vége a világnak...\n\nAmi még idegesítő, hogy nem fogják fel a játékosok, hogy úgy nyernek ha beverik az enemy bázist vagy az enemy fel nem adja... Azt hiszik minden áron, minden helyzetben neki kell rontani az ellenfélnek, mert muszáj killt szerezniük.. Ezért van annyi feeder. Sokszor nézem, hogy játszanak a csapattársaim miden/topon és mindig hiába van az enemy már elfeedve, még a társaim kezdik a harcot lanen... aztán sírnak, hogy a noob jungler nem gankel, de hogy gankeljen, ha meghalnak mielőtt a jungler odaérne? Amikor meg mútlkor beütöttem egy tornyot nyert teamfight után, azt mondta rám az egyik gyerek, hogy retard vagyok, mert nem segítek nekik végigkergetni az egész pályán a 2 túlélő ellenséget... :D Mondom neki, hogy az a lényeg, hogy a nexust beüssük, mert akkor nyerünk, erre megkérdezi, hogy \"hány éves vagy? 10?\"... mondom valószínű kettőnk közül én vagyok a 10 éves.. :D\n\nDe sok ilyen dolog van..","replies":[]},{"poster":"Kadegrow","date":"2014-08-19T10:56:26.628+0000","title":null,"up_votes":1,"down_votes":0,"body":"Gyere rankedra kerülj be S5-be. Tulajdonképpen egy másik dimenzióban leszel. xD Természetesen nem jó alapon, hanem szánalmas alapon. :D\nOtt aztán vannak kezdők, afkok, beszólások, idegbetegek minden amit csak a szemed szád megkíván.","replies":[]}]}