{"poster":"Inked Bushido","date":"2017-02-17T15:46:29.041+0000","title":"El famoso \"no merecen ganar\".","subforum":"Charlas Generales","up_votes":35,"down_votes":4,"body":"Reci&eacute;n jugu&eacute; una partida en la que me toc&oacute; ir mid. No es una de mis mejores lineas, pero hay campeones con los que puedo minimamente aguantar la linea y hacer una diferencia en TF. Pickeo primero, elijo Brand. Me sacan un Ekko. Le gan&eacute; f&aacute;cil en farm y kills, a level 6 y ya iba 4/0 y hab&iacute;a tirado la torre.\nBot no iba tan bien (Janna y Lucian vs Morgana y Miss Fortune), pierden torre perdemos top y el jg empez&oacute; a insultar a los de bot. Le ped&iacute; reiteradas veces que se callara y dejara de tiltear a todo el mundo. A todo esto empez&oacute; el team enemigo a agrandarse por chat.\nClaramente perdimos la partida, todos troleando y chateando, pero lo que m&aacute;s me llam&oacute; la atenci&oacute;n fue el &quot;no merecen ganar&quot; de mi propio team, haciendo alusi&oacute;n a &quot;juego mal porque mi team no merece ganar&quot;. \nAAAAAGUANTAAAAA, RETADOR DE LOS RETADORES, FAKER SEMPAI DE LOS MIDS, HONORABLE JUEZ Y VERDUGO DE LAS PARTIDAS MEDIOCRES. \n&iquest;De donde sale esta gente? No entiendo. Perder una partida s&oacute;lo para que tal persona no gane, &iquest;qu&eacute; es eso? &iquest;Que clase de flagelo virtual es este? Cabe destacar que todo mi team era entre Silver 3-5... por lo que deber&iacute;a suponerse que van a tener un entendimiento minimo de las partidas que juegan: rotaciones, objetivos, diveos y roamings... \nBueno, no. Al parecer hoy d&iacute;a el orgullo pedorro y el ego (yo juego bien y vos mal, por eso mereces perder aunque me cueste ptos a mi) puede m&aacute;s que &quot;me callo la boca, juego lo mejor posible y si ganamos y vos no aportaste nada, te reporto y listo&quot;.\nSinceramente me asquea un poquito...","replies":[{"poster":"WhiteMax","date":"2017-02-17T15:48:53.984+0000","up_votes":8,"down_votes":2,"body":"El \"no merecen ganar\" no existe, es solo otra forma de generar mal ambiente de los toxicos.\n\nEdit: Bueno... la verdad si existe alguien, los trolls y Flammers, esos si que no lo merecen porque le arruinaron la experiencia de una partida \"normal\" a las personas con las que le toco jugar.","replies":[{"poster":"LGBT Valentina","date":"2017-02-17T17:28:30.938+0000","up_votes":9,"down_votes":1,"body":"En realidad, el \"no merecen ganar\", lo usan mas como excusa para justificar que juegan mal, ya que aprovechan la situación sobre los acontecimientos  ocurridos de la otra persona que probablemente hayan sido negativos ","replies":[{"poster":"EdxxEdxx","date":"2017-02-17T17:35:32.296+0000","up_votes":4,"down_votes":2,"body":"He visto mucha gente tirar surrender (4 a favor 1 en contra) en equipos rivales, y también en aliados donde yo mismo he aceptado. No es una excusa, cuando una persona pasa cierta línea y el equipo sigue ganando la partida, dependiendo de que quienes juguemos tengamos moral y orgullo no lo vamos a dejar ganar esa partida. No a un tóxico en extremo.\n\nAhora, esto se da rara vez no, lo siguiente, y es cierto que muchas veces te encontras con alguien que va 3/14 y dice *\"trolleo porque no merecen ganar\"*. *Eso* es lamentable.","replies":[{"poster":"LGBT Valentina","date":"2017-02-17T17:49:21.705+0000","up_votes":5,"down_votes":1,"body":"**No es una excusa, cuando una persona pasa cierta línea y el equipo sigue ganando la partida, dependiendo de que quienes juguemos tengamos moral y orgullo no lo vamos a dejar ganar esa partida**\n\nhttp://www.thebrokeagent.com/sitemain/wp-content/uploads/2016/12/are-you-serious-wtf-meme-baby-face.jpg","replies":[{"poster":"EdxxEdxx","date":"2017-02-17T21:35:04.126+0000","up_votes":5,"down_votes":1,"body":"Oh, parece que no fui claro:\n\n*\"Cuando una persona pasa cierta línea y el equipo sigue ganando la partida\"*.\n\nExplicación:\nCuando alguien empieza a ser xenófobo, insultos a todos, a lo que sea, meterse con enfermedades, pingueos encima, hacer int, molestar, perseguir para joderle la partida (farm por ejemplo), comentarios indebidos (racismo), amenazas de muerte, etc. ¿Ahora quedó mejor?. Y si, por supuesto que lo digo muy en serio.","replies":[{"poster":"LGBT Valentina","date":"2017-02-17T22:36:56.099+0000","up_votes":4,"down_votes":1,"body":"http://www.thebrokeagent.com/sitemain/wp-content/uploads/2016/12/are-you-serious-wtf-meme-baby-face.jpg http://www.thebrokeagent.com/sitemain/wp-content/uploads/2016/12/are-you-serious-wtf-meme-baby-face.jpg","replies":[]}]}]}]},{"poster":"HyenaLoL","date":"2017-02-17T20:08:14.999+0000","up_votes":2,"down_votes":0,"body":"Yo lo vi en chocolove diciendoselo a mantarraya porque los estaban cojiendo hasta que hubo un a de las tipicas jugarretas del sv y se cayeron 3 players del team de choco\n\nFue la 1ra vez que vi el no merecen ganar bien usado ^-^","replies":[]},{"poster":"Oe Kein","date":"2017-02-19T11:09:53.453+0000","up_votes":1,"down_votes":0,"body":"Eso es cierto, es solo para quedar bien consigo mismo y no lo apoyo","replies":[]}]}]},{"poster":"wuaiqui","date":"2017-02-17T21:54:23.023+0000","up_votes":3,"down_votes":5,"body":"hay veces de verdad que no merecen ganar la otra vez me paso que pudimos cerrar la partida  al min 20 pero se querían seguir fedeando y el adc mid y top decían que estaban carreando y bno emepezaron a agrandarse por chat diciendose mancos y otras cosas y terminaron ganando.","replies":[{"poster":"Inked Bushido","date":"2017-02-17T22:28:23.541+0000","up_votes":4,"down_votes":3,"body":"No justifica ni es excusa. El comportamiento pesimo de 4 no amerita la perdida de puntos de 1 que si haya querido jugar.","replies":[{"poster":"wuaiqui","date":"2017-02-18T03:14:15.445+0000","up_votes":4,"down_votes":2,"body":"tienes razón pero en esa partida ni si quiera yo que fui supp tenias ganas de que ganaran por que los 4 de mi team tenían mala actitud e insultaban al otro team por tener ventaja en el early hasta que perdieron el late fue como un karma","replies":[{"poster":"Inked Bushido","date":"2017-02-18T03:55:48.667+0000","up_votes":6,"down_votes":0,"body":"Vos no mereces perder si estas dando lo mejor. El que otros la caguen no quita que vos hayas merecido la victoria. No siempre se puede carrear.","replies":[{"poster":"wuaiqui","date":"2017-02-18T06:06:40.668+0000","up_votes":3,"down_votes":0,"body":"toda la razón salu2","replies":[{"poster":"Inked Bushido","date":"2017-02-18T13:34:51.700+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-catface}}","replies":[]}]}]}]}]}]},{"poster":"Shion Archimago","date":"2017-02-17T16:55:16.231+0000","up_votes":1,"down_votes":25,"body":"y bueno aveces no merecen ganar","replies":[{"poster":"Inked Bushido","date":"2017-02-17T17:36:44.675+0000","up_votes":6,"down_votes":2,"body":"{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Geeik","date":"2017-02-17T17:48:18.209+0000","up_votes":1,"down_votes":1,"body":"Tranca supp, según recuerde este quiere que buffeen a teemo (no me acuerdo bien del nombre, pero era parecido), y suele decir este tipo de tonterías","replies":[{"poster":"Inked Bushido","date":"2017-02-17T17:57:32.884+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Nplayer03,realm=LAS,application-id=v7qsfXsE,discussion-id=oOXZJlbW,comment-id=000100000000,timestamp=2017-02-17T17:48:18.209+0000)\n>\n> Tranca supp, según recuerde este quiere que buffeen a teemo (no me acuerdo bien del nombre, pero era parecido), y suele decir este tipo de tonterías\n\n¿Buff a Temmo? Jajaja","replies":[{"poster":"yo soyyoporqueno","date":"2017-02-17T19:34:42.775+0000","up_votes":4,"down_votes":0,"body":"ese era Dat Internet","replies":[{"poster":"Geeik","date":"2017-02-17T21:44:04.731+0000","up_votes":2,"down_votes":1,"body":"no, dat internet hizo un post sobre eso, este men me discutió todo mi comentario sobre que teemo necesitaba buff, y yo siendo m6 teemo le dije que teemo estaba roto, y el men me discutía y dicutía...","replies":[]}]}]}]}]}]},{"poster":"Sir Crucifix ","date":"2017-02-17T17:31:19.379+0000","up_votes":3,"down_votes":4,"body":"y vos lavate las manos si no es tanto culpa tuya","replies":[{"poster":"Inked Bushido","date":"2017-02-17T17:55:43.487+0000","up_votes":6,"down_votes":2,"body":"No pasa por lavarse las manos. No me quejo del perder, se pierde y se gana. La partida la perdimos todos de una forma u otra. \nMe quejo de la actitud que ocasiona una derrota, muchas veces peor que un score.","replies":[{"poster":"Sir Crucifix ","date":"2017-02-17T18:14:07.461+0000","up_votes":3,"down_votes":0,"body":"pues me paso peor a mi , porque ibamos todos bien excepto una riven top que perdia y se quejaba porque nuestro jungla no le ayudaba , pero nuestro jungla me ayudaba tanto a mi como a los de bot , hacia dragon todo hermoso , y la riven feedeo a un garen y nos costo la partida porque empezo a trollear , se descontrolo nuestro adc el jg empezo a flamear .. gg","replies":[{"poster":"Inked Bushido","date":"2017-02-18T01:12:01.949+0000","up_votes":3,"down_votes":0,"body":"Una fedeada se puede permitir hasta cierto punto. Pero todos, incluso el que fedeo, tienen que apuntar a intentar solucionarlo.\nEl tilteo y el snowball generalmente pesan mas.","replies":[]}]}]}]},{"poster":"HyenaLoL","date":"2017-02-17T20:06:35.971+0000","up_votes":1,"down_votes":5,"body":"En silver nadie entiende nada. Es igual que bronce. Y que oro 4/5\nEn oro 3 para adelante hay un atisbo de diferenciacion muy chiquitito","replies":[{"poster":"Inked Bushido","date":"2017-02-17T20:13:29.258+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=V2G Hyena,realm=LAS,application-id=v7qsfXsE,discussion-id=oOXZJlbW,comment-id=0007,timestamp=2017-02-17T20:06:35.971+0000)\n>\n> En silver nadie entiende nada. Es igual que bronce. Y que oro 4/5\n> En oro 3 para adelante hay un atisbo de diferenciacion muy chiquitito\n\nCoincido en un 50%","replies":[{"poster":"HyenaLoL","date":"2017-02-17T20:16:21.233+0000","up_votes":1,"down_votes":3,"body":"El otro 50% supongo que es\n\nPara ser silver no hay que hacer nada, absolutamente nada\nPara ser bronce hay que esforzarse por perder. Ser malo con ganas\nY el oro intenta, es malo pero intenta ser mejor","replies":[{"poster":"Inked Bushido","date":"2017-02-17T20:23:11.992+0000","up_votes":5,"down_votes":1,"body":"Para ser plata tenés que saber lo suficiente como para salir de bronce.\nPara ser oro tenés que saber lo suficiente como para no volver a plata y a bronce.\n\nTodas las ligas e incluso sus divisiones tienen su grado de dificultad.\nNo caigamos en la generalización de que todos son malos, yo mismo he visto a platinos jugar \"malisimas partidas\", que si fuesen bronces le llamaríamos \"sólo ser malo\".","replies":[{"poster":"Uli con azúcar","date":"2017-02-18T00:39:40.480+0000","up_votes":4,"down_votes":1,"body":"Pasa que los gordos de platino o diamante para arriba ya pierden la noción del nivel al estar muy por encima. \nPero te puedo asegurar que la diferencia de nivel existe incluso entre las divisiones más bajas. Osea un b1 o b2 se diferencian mucho de un b4 (lo más bajo que llegué a jugar). Y en plata cada división es un salto que parece absurdo, obvio que esta división tiene mala fama por los unranked que recién estan empezando y por ganar 4 o 5 de las placement los meten en silver y bueno ahí si es bronce blanco.","replies":[{"poster":"Inked Bushido","date":"2017-02-18T01:10:17.894+0000","up_votes":3,"down_votes":0,"body":"Exacto.","replies":[]},{"poster":"Wiemeyer","date":"2017-02-22T15:17:59.601+0000","up_votes":1,"down_votes":0,"body":"\"Pasa que los gordos de platino o diamante para arriba ya pierden la noción del nivel al estar muy por encima.\"\nPapu desde plata v (season 4, donde empece a jugar) hasta platino 4 que llegue la season pasada es un camino bastante largo, todos pasaron por una liga \"baja\" por asi decirlo. Obviamente hay casos (un amigo mio) la primera vez que hizo las placements (y primera vez que rankeaba) termino en oro 1 en pre season, empezo la season y termino en platino 3, los humos se le fueron a la nubes, como dije obviamente hay casos pero la mayoria empieza de abajo.\nComo tambien hay casos en los que el jugador no progresa y no sube más de liga,(otro amigo) empezó en season 2 en bronce y todavia no sale de ahí :/","replies":[]},{"poster":"Zoliza","date":"2017-02-19T02:53:00.595+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Uliiss,realm=LAS,application-id=v7qsfXsE,discussion-id=oOXZJlbW,comment-id=00070000000000000000,timestamp=2017-02-18T00:39:40.480+0000)\n>\n> Pasa que los gordos de platino o diamante para arriba ya pierden la noción del nivel al estar muy por encima. \n> Pero te puedo asegurar que la diferencia de nivel existe incluso entre las divisiones más bajas. Osea un b1 o b2 se diferencian mucho de un b4 (lo más bajo que llegué a jugar). Y en plata cada división es un salto que parece absurdo, obvio que esta división tiene mala fama por los unranked que recién estan empezando y por ganar 4 o 5 de las placement los meten en silver y bueno ahí si es bronce blanco.\n\nTe pensas que los que somos platinos o diamond no empezamos de abajo? Esta cuenta es mi smurf, mi main cuando vine de NA era bronce 5 la subi a bronce 1 y se me acabo la season apenas abrio las, la temporada siguiente en vez de rankear con mi cuenta main rankee con esta dejandola oro y a la siguiente subi otra smurf mas, a lo que un amigo challenger me dijo, esta bien que no te guste rankear pero juga en tu main, estas en normal jugando con gente diamond, algunos diamond 2+ y no queres rankear donde estas contra gente de 4 ligas abajo... Aunque aun no me guste mucho rankear lo hice y subi hasta oro con 93% de winrate, el cual fue bajando mientras mas subia. Actualmente casi no juego y como mucho la subo a platino a las cuentas que tengo solo por el marco o las recompensas para mis cuentas en final de temporada pero no por eso no tenemos nocion por estar donde estamos. Respecto a las diferencias en ligas, el nivel de una liga es equivalente al de las adyacentes a nivel jugabilidad. \nEn bronce la gente suele tener mejor actitud que en silver, ahi veo mucha gente perder por la toxicidad que se genera, sobretodo porque muchos se creen buenos por no estar en bronce o cercanos a oro, si logras enojar al enemigo y que se ponga a flammear, trollear o quedarse afk es free win y alguien que juegue mejor que las personas de esas ligas lo pueden lograr matandote 5 veces, freezeando linea o riendose con el champ y tirandote maestria. Las personas que tienen ego alto en elos bajos son los que mas pierden.","replies":[]}]}]}]}]}]},{"poster":"Autumn Shade","date":"2017-02-17T23:59:02.824+0000","up_votes":3,"down_votes":2,"body":"Hay gente que juega tan mal que realmente no merece ganar.","replies":[{"poster":"Inked Bushido","date":"2017-02-18T01:14:43.123+0000","up_votes":3,"down_votes":1,"body":"Eso no lo juzgas vos, ni yo. Si te toco jugar con ellos, minimamente por una cuestión de amor propio, deberías querer ganar y buscarlo. No tirar la partida porque ellos no merecen ganar.","replies":[{"poster":"Autumn Shade","date":"2017-02-18T05:28:37.176+0000","up_votes":2,"down_votes":1,"body":"Pero si son hay gente que es mala mecánicamente y no sabe ni donde esta parada, para mi tratar de ganar esas partidas imposibles es una perdida de tiempo ¿no es mejor que termine cuanto antes?","replies":[{"poster":"xShadow10","date":"2017-02-18T07:13:31.860+0000","up_votes":2,"down_votes":1,"body":"Haber, el concepto es simple: uno juega para ganar. Si entras a una partida, o si en el transcurso de la misma concideras que perder es la mejor opción, ¿qué clase de jugador sos? Es un pensamiento completamente ridículo y sin sentido. Mirémoslo desde otro punto de vista: si el flaco \"merece\" perder, jugará cientas de partidas mas que la que ha jugado contigo, y si verdaderamente merece perder, perderá. No todo el mundo va a ser carreado para siempre.","replies":[{"poster":"Autumn Shade","date":"2017-02-19T03:47:27.588+0000","up_votes":1,"down_votes":0,"body":"si claro no querer perder mi tiempo es ridículo y sin sentido","replies":[]}]},{"poster":"Inked Bushido","date":"2017-02-18T13:37:08.599+0000","up_votes":1,"down_votes":0,"body":"Recuerda que estás jugando un juego. La premisa siempre es divertirte. Aparte siempre puede haber una mala play del equipo enemigo que los lleve a un exterminio o tal vez a un tilteo y puedes revertir tu situación.\nYo personalmente no acepto el surrender jamás.","replies":[]}]}]}]},{"poster":"Thails SirYordle","date":"2017-02-18T03:41:35.648+0000","up_votes":2,"down_votes":1,"body":"Cuando los encontras es algo como:\n\nhttps://i.gyazo.com/622cbc3a698c1e2ca96ddbea60200cd0.jpg","replies":[{"poster":"Inked Bushido","date":"2017-02-18T03:52:48.426+0000","up_votes":1,"down_votes":0,"body":"Tal cual jaja","replies":[]}]},{"poster":"Tutancadead","date":"2017-02-17T21:25:46.913+0000","up_votes":2,"down_votes":1,"body":"Soy un manco que no entiende el juego pero se cree que juega perfecto todo por  X motivo.\nPierdo.. no es mi culpa es que el team no Merce ganar","replies":[]},{"poster":"Zoliza","date":"2017-02-19T02:29:25.889+0000","up_votes":1,"down_votes":0,"body":"\"Rotaciones, objetivos, diveos y roamings...\" En silver? Eso no existe olvidate, a veces veo en platino gente que no sabe rotar y mueren los dos diveando..","replies":[]},{"poster":"BerteMC","date":"2017-02-19T02:25:11.950+0000","up_votes":1,"down_votes":0,"body":"totalmente en lo cierto, comparto tu opinion. Y la verdad que yo estoy entre ese elo y la gente de ese elo tiene esa frase bien en el fonde del cora","replies":[]},{"poster":"Hi im Eleven","date":"2017-02-18T17:58:18.525+0000","up_votes":1,"down_votes":0,"body":"Yo perdí la cuenta de todas las veces que me van diciendo \"No mereces ganar, manco\", no entiendo, o sea, el juego es para ganar, pero, que ganan haciendo perder una partida en la cual ellos tambien salen perjudicados?","replies":[]},{"poster":"lucpro","date":"2017-02-18T06:11:11.724+0000","up_votes":1,"down_votes":0,"body":"El otro día jugué mid con {{champion:136}} y un talon cada ves que me mataba flamea y aparte decía MORISTE PETE 123 , y el 123 lo agregaba en todo y era molesto :/","replies":[{"poster":"Inked Bushido","date":"2017-02-18T13:33:57.789+0000","up_votes":1,"down_votes":0,"body":"Jajajajaja 123? Que demonios jajaja","replies":[{"poster":"RedKi","date":"2017-02-18T16:00:25.528+0000","up_votes":1,"down_votes":0,"body":"Si, esas cosas lo dicen las ratitas que siguen a Coscu.","replies":[]}]}]},{"poster":"TheSystruction","date":"2017-02-18T00:50:12.070+0000","up_votes":1,"down_votes":0,"body":"hoy me toco un {{champion:17}}  support que tiro la partida y empezo a trolear, me dejo solo en bot, iba con {{champion:18}} , solo por que no ultie al rengar porque no me dio el mana solo por 5 unidades :( , se fue a top a molestar al darius jajajaaa, fue como :/ , lo mas triste es que ni asi la perdio porque ganamos 2 tf, el rengar enemigo fedeado se fue afk dela impotencia y ganamos :/","replies":[{"poster":"Inked Bushido","date":"2017-02-18T01:13:34.247+0000","up_votes":1,"down_votes":0,"body":"Al menos la pudieron remontar. Hay veces que ni con un troll pueden ganar una partida, y eso demuestra lo deplorable que es el nivel de juego.","replies":[{"poster":"TheSystruction","date":"2017-02-18T13:51:28.339+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SUPP Prospect,realm=LAS,application-id=v7qsfXsE,discussion-id=oOXZJlbW,comment-id=000e0000,timestamp=2017-02-18T01:13:34.247+0000)\n>\n> Al menos la pudieron remontar. Hay veces que ni con un troll pueden ganar una partida, y eso demuestra lo deplorable que es el nivel de juego.\n\npuro ojete, no podia ni farmear , me toco un draven y una nami y yo solo en la botlane :(","replies":[]}]}]}]}