{"poster":"Feu3rBlitz","date":"2016-10-09T18:08:37.396+0000","title":"League of Legends funktioniert auf anderem Monito nicht","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Und zwar habe ich folgendes Problem. Ich muss wegen gr&uuml;nden in der woche einen anderen monitor an mienem Laptop anschlie&szlig;en. Allerdings funktioniert bei dem anderem Bildschirm mein LoL nicht. alles passt eunderbar aber nach der Champselect kommt ein bugsplat. Ich kannn zu 95% sagen das es an dem Monitor liegt, kann aber nicht sagen warum. Helft mir mal bitte. W&auml;re nicht schlecht","replies":[{"poster":"Feu3rBlitz","date":"2016-10-10T14:05:44.719+0000","up_votes":1,"down_votes":0,"body":"okay leute habs geschafft. hab einfach was umgeschriebn und alles ging gut. musste dann nur wieder auf vollbild umstellen.","replies":[]},{"poster":"Feu3rBlitz","date":"2016-10-10T13:25:32.148+0000","up_votes":1,"down_votes":0,"body":"also den anderen bildschirm habe ich leider nicht da und der monitor vom laptop ist komplett hinüber. Erkennt man garnichts drauf.","replies":[{"poster":"Saufautomat","date":"2016-10-10T14:01:34.277+0000","up_votes":1,"down_votes":0,"body":"Wenn du den anderen Bildschirm an deinen Laptop anschließt wird das Bild automatisch dupliziert. Du kannst dann mit Windows+P die Art der Anzeige auf \"Nur zweiter Bildschrim\" umstellen.\n\nDie Lösung von RED Loki Reach würde wahrscheinlich auch Helfen, aber wenn ich das richtig verstanden habe kommst du gar nicht erst soweit, dass du die Ingame-Einstellungen ändern kannst.\n\nEDIT: Wenn du die Datei \"C:\\Riot Games\\League of Legends\\Config\\game.cfg\" mit einem Texteditor öffnest, kannst du bei \"WindowMode\" mal \"WindowMode=2\" eintragen","replies":[]}]},{"poster":"RED Loki Reach","date":"2016-10-09T22:40:19.769+0000","up_votes":1,"down_votes":0,"body":"Starte LoL im Fenstermodus wenn du das nicht schon machst ( bei manchen Monitoren macht Vollbild Probleme )","replies":[]},{"poster":"Saufautomat","date":"2016-10-09T18:28:18.950+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nIch habe mal zwei Sachen, die du versuchen kannst.\n\n1: Sorge dafür, dass Windows _**nur**_ den zweiten Bildschirm verwendet. Drücke dazu Windows+P und wähle \"Nur zweiter Bildschrim\" aus.\n\n2: Wenn der externe Bildschirm eine andere Auflösung hat, dann probier Mal die auf deinem Laptop auf die gleiche zu stellen (vorausgesetzt er unterstüzt sie)","replies":[]}]}