{"poster":"The IlIest","date":"2018-06-09T22:19:17.539+0000","title":"Ban nachdem mein Account gehackt wurde. Support weigert sich mir zu helfen.","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":4,"body":"Hallo,\r\nvorletzte Woche wurde mein Account gehackt und der Support weigert sich mir zu helfen.\r\nIrgendwer hat sich Zugang zu meinem Account verschafft und damit &uuml;ber einen Tag hinweg 14 Spiele gemacht.\r\nEin Freund hatte mich Nachmittags darauf aufmerksam gemacht, da er wusste, dass ich nicht Zuhause war. \r\nAm fr&uuml;hen Abend habe ich dann Versucht mich einzuloggen, und die Meldung kam &quot;dein Account wurde gebannt&quot;.\r\nZu diesem Zeitpunkt befand sich der Account allerdings noch in einem Spiel. Danach war er dann offline.\r\nIn der Email von Riot stand dann, dass mit meinem Account &quot;third party programs&quot; genutzt wurden und dieser deshalb gebannt wurde.\r\nIm Support wollte mir keiner helfen und ich bekam nur die Antwort, dass gebannte Accounts NICHT wieder freigegeben werden.\r\nIch bin echt ratlos was ich noch tuen kann. Der Account besteht seid Anfang der 3 Season und ich habe eine Menge Geld investiert.\r\nVilleicht kann mir hier jemand helfen!","replies":[{"poster":"GhostOfFl4me","date":"2018-06-10T00:15:12.297+0000","up_votes":2,"down_votes":14,"body":"die leute vom support sind Inkompetenz wie mein mahte Lehrer","replies":[{"poster":"Zyzyx","date":"2018-06-10T07:18:20.692+0000","up_votes":16,"down_votes":0,"body":"Ich mach mir mehr Sorgen um deinen Deutschlehrer.","replies":[{"poster":"Izaya Kumiho","date":"2018-06-10T10:11:25.493+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=Zyzyx,realm=EUW,application-id=KYnfKGf0,discussion-id=G7BZLpLA,comment-id=00040000,timestamp=2018-06-10T07:18:20.692+0000)\n>\n> Ich mach mir mehr Sorgen um deinen Deutsch-Lehrer.\n\nNaja...Deutschlehrer schreibt man aber auch zusammen..\n\nhttps://bit.ly/1Orcxr2","replies":[{"poster":"Zyzyx","date":"2018-06-10T10:18:30.273+0000","up_votes":4,"down_votes":0,"body":"Meh, fair enough. Das ist der Preis wenn man auf der Arbeit ständig zwischen Deutsch und Englisch wechselt. Scheinbar hab ich mich in Bezug auf Zusammen/Getrenntschreibung irgendwo in der Mitte eingependelt, was in beiden Sprachen falsch ist^^","replies":[{"poster":"Gin","date":"2018-06-11T08:28:57.478+0000","up_votes":2,"down_votes":0,"body":"Hm? Also bei mir ist es in deinem Kommentar richtig geschrieben :^)","replies":[{"poster":"Zyzyx","date":"2018-06-11T08:49:43.005+0000","up_votes":2,"down_votes":0,"body":"https://media.giphy.com/media/12NUbkX6p4xOO4/giphy.gif","replies":[]}]}]}]},{"poster":"GhostOfFl4me","date":"2018-06-11T18:42:05.221+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Sirrkas","date":"2018-06-11T18:57:41.804+0000","up_votes":3,"down_votes":0,"body":"Wenn du Spieler direkt beleidigst, klappt es bei dir plötzlich einigermaßen mit Rechtschreibung und Co.?","replies":[]}]},{"poster":"Abasin","date":"2018-06-10T21:18:04.445+0000","up_votes":2,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"Izaya Kumiho","date":"2018-06-09T22:42:25.512+0000","up_votes":3,"down_votes":3,"body":">Ban nachdem mein Account gehackt wurde. Support weigert sich mir zu helfen.\n\n\nErstmal am Rande: Accountsharing ist gegen die Regeln. Mit der Erstellung deines Accounts hast du dem Regelwerk zugestimmt.\nIch komme gleich darauf zurück..\n\n>In der Email von Riot stand dann, dass mit meinem Account \"third party programs\" genutzt wurden und dieser deshalb gebannt wurde.\n\n\"TPP\" sagt aus, dass du wegen einem dritten Programm (Scripts, Bots, Etc) deinen Ban bekommen hast. \n\nSprich der Fakt ob der Account von einer anderen Person genutzt worden ist, oder nicht, spielt hier grade gar nicht mal so eine große Rolle.\nAccounts die für's cheaten benutzt werden, bekommen instant einen Permaban. \n\n> Der Account besteht seid Anfang der 3 Season und ich habe eine Menge Geld investiert.\n\nDas Geld sollte für dich keine Rolle mehr spielen, da du freiwillig den Kies auf einem geliehenden Account für kosmetische Items and Riot gespendet hast.\n\n(Jeder Account gehört Riot Games. Mit der Erstellung deines Accounts \"leihst\" du ihn dir nur.)\n\nÄrgerlich ist es selbstverständlich, aber es liegen nunmal hier zwei Probleme vor: Accountsharing und Cheating. \nSelbst wenn du das eine los wirst, ändert es nichts an dem Ban.\n\n\nWieso ich Accountsharing aufzähle? Well.\nDu übernimmst die Verantwortung für deinen Account. \nVerlierst du deine Daten an eine weitere Person, so kann Riot dir maximal anbieten, den Account zu sperren und deine Daten sicher zu ändern.\nSollte es jedoch bereits zu spät sein, kann man schlecht nachweisen, dass das nicht bewusstes Sharing gewesen ist.\n\nSpieler XY fragt, ob AB seinen Account über die Feiertage an ihn abgeben kann, um Champion ZG zu testen. \nAB stimmt zu, XY spielt auf dem Account. XY ist toxic af und AB hat nun einen Account mit Tempban. Geht AB dann zum Support, wird er sowieso für Accountsharing auffliegen und den Perma bekommen.\n\n(Meistens wird Accountsharing relativ schnell von alleine aufgedeckt btw)\n\n\n_____________\n\n>Villeicht kann mir hier jemand helfen!\n\n\nHmm.\nBenutzte deine Virenscanner und so.\n(Malwarebytes ist z.B. ein Scanner, welcher die meisten bösen Dinge auf deinem Rechner finden und entfernen kann).\n\nUntersuche deinen Rechner auf Keylogger und anderes Zeugs, bevor du dir einen neuen Account zulegst. Überprüfe auch, ob andere Accounts von anderen Spielen oder deiner Bank betroffen sind.","replies":[{"poster":"The IlIest","date":"2018-06-09T22:55:33.567+0000","up_votes":1,"down_votes":2,"body":"Alles was du schreibst ist mir vollkommen bewusst, trotzdem ist das inakzeptabel und alles andere als kundenfreundlich. \nDas Geld keine Rolle spielt, weil der Account geliehen wurden, ist eine ziemlich einseitige Sichtweise. \nAccountsharing setzt für mich Vorsatz voraus. \nWenn jemand dein Auto klaut und damit einen Unfall baut bist du auch nicht dafür verantwortlich bzw. wirst dafür bestraft.\nEin Authenticator würde viele Probleme lösen...","replies":[{"poster":"Izaya Kumiho","date":"2018-06-09T23:05:12.594+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=The IlIest,realm=EUW,application-id=KYnfKGf0,discussion-id=G7BZLpLA,comment-id=00030000,timestamp=2018-06-09T22:55:33.567+0000)\n>\n> Alles was du schreibst ist mir vollkommen bewusst, trotzdem ist das inakzeptabel und alles andere als Kundenfreundlich. \n\nWenn es dir bewusst sein würde, sollte der Begriff \"Kundenfreundlichkeit\" nicht mit \"Fairness\" verwechselt werden.\nEs liegt ein Regelbruch vor- völlig egal wer es getan hat.\nDu würdest doch auch keine Cheater im Spiel haben wollen,right? :O\n\n\n> Das Geld keine Rolle spielt, weil der Account geliehen wurden, ist eine ziemlich einseitig Sichtweise. \n\n**Der Account ist nicht dein Eigentum.** Jeder hat sich seinen Account von Riot geliehen.\nGibst du Geld für ein Spiel aus, welches keinen Pay2win-inhalt anbieten tut, so hast du freiwillig Geld an die Firma gespendet und bekommst als Danke deinen ausgewählten Skin für den geliehenden Account.\n\nDas mit dem Eigentum rechtliche Gründe.\n\n> Accountsharing setzt für mich Vorsatz voraus. \n\n> Wenn jemand dein Auto klaut und damit einen Unfall baut bist du auch nicht dafür verantwortlich bzw. wirst dafür bestraft.\n\nWenn es **nicht dein** Auto war, sondern nur **von dir geliehen** worden ist, dann bist du dafür verantwortlich.\n\n> Ein Authenticator würde viele Probleme lösen...\n\nIndeed.\nAber selbst AC-accounts werden teilweise übernommen. Das ist dann immer so ein blödes gefuchtel mit dem Support, wenn du den AC wieder entfernen lassen musst usw.\nAber ja, einen AC würde ich auch gerne bei Rito sehen.","replies":[{"poster":"OPChampsSucks","date":"2018-06-10T20:25:02.291+0000","up_votes":2,"down_votes":2,"body":"Nein wenn du die Möglichkeit hast Geld einzusetzen und das Geld dir ohne konkreten relevanten Grund (Insolvenz etc) wieder \" weggenommen\" wird hat man immer noch ein Recht auf Schadensersatz da es sich hier lediglich um nichts anderes als Waren bzw. Güter handelt. Diese sind im Prinzip in einem gewissen Nutzungsrecht bei dir verankert das an beidseitige Nutzungsbedingungen gebunden ist. Lediglich der Account ist rechtlich gesehen vollständig geliehen.\n\nSprich sollte der Account erwiesenermaßen zu unrecht gesperrt worden sein (Riot beweispflichtig) und darauf haben sich RP oder gekaufte Skins befunden dann hat dieser Nutzer das Anrecht den Account wieder entsperren zu lassen oder sich das Geld auszahlen zu lassen.\n\nAber ansonsten ist alles korrekt.","replies":[{"poster":"Izaya Kumiho","date":"2018-06-11T06:37:35.414+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=OPChampsSucks,realm=EUW,application-id=KYnfKGf0,discussion-id=G7BZLpLA,comment-id=0003000000000001,timestamp=2018-06-10T20:25:02.291+0000)\n>\n> Nein wenn du die Möglichkeit hast Geld einzusetzen und das Geld dir ohne konkreten relevanten Grund (Insolvenz etc) wieder &quot; weggenommen&quot; wird hat man immer noch ein Recht auf Schadensersatz da es sich hier lediglich um nichts anderes als Waren bzw. Güter handelt.\n\nNot exactly...\nhttp://forums.euw.leagueoflegends.com/board/showthread.php?t=439331\nhttps://euw.leagueoflegends.com/de/legal/termsofuse\n\nEhem. Ich zitiere:\n\n>4.3. Sind die virtuellen Gegenstände, die ich entsperre, mein „Eigentum“? (Nein. Was du „freischaltest“, ist nicht der virtuelle Gegenstand selbst, sondern vielmehr ein qualifiziertes Recht, innerhalb des Spiels darauf zuzugreifen.)\n>\n>Du hast kein Eigentums- oder sonstiges Vermögensrecht an den von dir freigeschalteten virtuellen Gegenständen, unabhängig davon, ob du den Zugang zu diesen virtuellen Gegenständen durch Verwendung von Riot Points, blaue Essenzen oder über die Hextech-Werkstatt erworben hast. Virtuelle Gegenstände haben keinen monetären Wert. Du kannst sie nicht gegen Bargeld einlösen. Du kannst keine Erstattungen für den Kauf von Riot Points oder virtuellen Gegenständen erhalten, außer soweit ausdrücklich von uns gestattet.\n>\nBITTE BEACHTE, DASS DIE BEREITSTELLUNG VON RIOT POINTS UND DIE ERBRINGUNG VON DIENSTEN UNMITTELBAR NACH ABSCHLUSS DEINES KAUFS BEGINNT UND WENN DER ZUGANG ZU DEN RIOT POINTS IN DEINEM KONTO AKTIVIERT WURDE, IST DER VERTRAG DURCH UNS IN VOLLEM UMFANG ERFÜLLT. DAHER ERKENNST DU AUSDRÜCKLICH AN, STIMMST ZU UND ERKLÄRST DICH DAMIT EINVERSTANDEN, DASS DU DEIN RÜCKTRITTSRECHT IM ZUSAMMENHANG MIT UNSEREM DIENST, DIR RIOT POINTS BEREITZUSTELLEN, NACH DEM ABSCHLUSS DES KAUFS VERLIERST.","replies":[{"poster":"Jinx1967","date":"2018-06-12T12:37:20.609+0000","up_votes":1,"down_votes":0,"body":"Er liegt mit seiner Terminologie zwar daneben, aber in der Sache hat er grundsätzlich Recht. Der Zugang zum Account sowieso zu den Skins etc. kann nicht ohne weiteres entzogen werden; eine Vertragspflichtverletzung kann Schadensersatzpflichten nach sich ziehen.\n\nDer von dir zitierte Teil der AGB ändert daran nichts.","replies":[{"poster":"Haudruppmoor","date":"2018-06-12T14:07:00.664+0000","up_votes":1,"down_votes":0,"body":"Richtig, Riot muss es hinreichend begründen können. Zumindest wenn Geld geflossen ist.\n\nIrgendwo hatte ich mal nen Link von ner Anwaltskanzlei die sich mit dem Thema beschäftigt hat. allerdings gabs da nen Hinweis, daß bei kostenlosen Inhalten der Anbieter durchaus willkürlich agieren kann. Also wenn man gegen den Anbieter nach ner Sperrung gerichtlich vorgeht, könnte es sein, daß dann zugunsten des Anbieters entschieden wird - Bin mir da aber net mehr so sicher und ich find den Link net :( . \n\nWas ich zu dem Thema noch sehr interessant fand war eine Studie vom FIT , da diese sich eben sehr nah am Verbraucher orientiert :\n\nhttps://www.fit.fraunhofer.de/content/dam/fit/de/documents/Studie_Leistungsst%C3%B6rungen_Digitale_Inhalte_2017.pdf\n\nmfg\nMB","replies":[{"poster":"Jinx1967","date":"2018-06-12T14:26:01.669+0000","up_votes":3,"down_votes":0,"body":"> Irgendwo hatte ich mal nen Link von ner Anwaltskanzlei die sich mit dem Thema beschäftigt hat\n\nEs finden sich ein paar Fälle auf \"Frag-einen-Anwalt\", wenn man das in Kombination mit Account Bans sucht. Ebenso gibt es die ein oder anderen anwaltlich betriebene Seite die solche Rechtsfragen und aktuelle Urteile diskutiert.\n\nhttps://www.frag-einen-anwalt.de/League-of-Legends-Account-gesperrt-bitte-um-hilfe--f280692.html\n\nIst halt seltsamerweise ein großer Irrtum hier im Forum, dass Riot alles mit den Accounts machen kann.\n\n>  allerdings gabs da nen Hinweis, daß bei kostenlosen Inhalten der Anbieter durchaus willkürlich agieren kann\n\nWenn ich micht recht erinnere war das die Frage, ob ein Anbieter sich ein fristloses und grundloses Kündigungsrecht per AGB einräumen kann. Bei kostenfreien Spielen scheint das möglich zu sein, wobei ich mir nicht mehr sicher bin, ob Riot in dem Sinne kostenfrei wäre.\n\nAber bei Riot spielt das ohnehin keine Rolle, weil sie sich ein solches Kündigungsrecht per AGB gar nicht eingeräumt haben. Also haben wir ganz klassisch einen Vertrag, den sie erfüllen müssen, daraus resultiert die Beweislast bei Kündigung und grds. auch Schadensersatzpflicht.","replies":[]}]}]}]}]},{"poster":"Released Ape","date":"2018-06-10T05:34:17.847+0000","up_votes":1,"down_votes":1,"body":"> Wenn es nicht dein Auto war, sondern nur von dir geliehen worden ist, dann bist du dafür verantwortlich.\n\nEs wurde aber nicht verliehen, sondern gestohlen. Selbst beim Verleihen eines Autos gibt es unterschiedliche Rechtssprechungen in den meisten Fällen kommt die Haftpflichtversicherung des Entleihers ins Spiel, weil es sich die Versicherung auf das Fahrzeug bezieht und nicht auf den tatsächlichen Fahrer. Allerdings ist die Person, die das Fahrzeug leiht verpflichtet das Auto unversehrt zurückzugeben und dieser haftet dann unter Umständen für eventuelle Reparaturkosten.\n\nDas ganze überhaupt mit Leauge Accounts zu vergleichen ist daher ohnehin fragwürdig.\n\n> Aber selbst AC-accounts werden teilweise übernommen. Das ist dann immer so ein blödes gefuchtel mit dem Support, wenn du den AC wieder entfernen lassen musst usw.\nAber ja, einen AC würde ich auch gerne bei Rito sehen.\n\nEs ist jedem Fall eine Sicherheit und die lässt sich dann in den meisten Fällen nur die Fahrlässigkeit des Besitzers aushebeln (z. B.  wieder mit Phishing). Wobei deutlich mehr Personen aufmerksam werden mit einem Authenticator.\n\nIn jedem Fall sollte der Threadersteller nochmal mit dem Support schreiben und seine Lage gut erläutern, es gibt genug Fälle in denen der Support das ausgiebig nachprüft und dann den Account wieder freischaltet. Personen, die ihren Account verlieren immer sofort mit \"Kann man nichts machen, Pech gehabt\" abzuspeisen halte ich für kein gutes Verhalten. Jeder soll eine Chance bekommen sich zu erklären, wenn nun tatsächlich nachgewiesen werden kann das er \"gehackt\" wurde - dann halte ich es für unzumutbar ihm das noch so aufzudrücken.\n\nIch bin der festen Überzeugung das der Support immer noch der richtige Ansprechpartner ist, manchmal muss man öfter mit ihm schreiben um gehört zu werden. Andere Spieler werden dir hier nur das gleiche anraten oder dir an den Kopf werfen das du \"Pech\" hattest. \n\nWir wissen nicht was wirklich passiert ist und der normale Spieler hat auch nur begrenzte Möglichkeiten das nachzuprüfen, daher (@TE) wende dich bitte erneut an den Support und versuche ruhig zu bleiben - auch wenn dir viel am Account liegt.\n\nEdit: @TE hinzugefügt / Das mit dem Auto war auf \"Account Sharing\" bezogen","replies":[{"poster":"Izaya Kumiho","date":"2018-06-10T10:25:30.229+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Wrong Sentence,realm=EUW,application-id=KYnfKGf0,discussion-id=G7BZLpLA,comment-id=0003000000000000,timestamp=2018-06-10T05:34:17.847+0000)\n>\n> Es wurde aber nicht verliehen, sondern gestohlen. \n\nDer Account auf dem du schreibst, hast du dir geliehen. Er gehört Riot.\nMit der Erstellung eines Accounts, leihst du ihn dir von Riot. \nDas selbe gilt auch für den TE und so..\n\n>Selbst beim Verleihen eines Autos gibt es unterschiedliche Rechtssprechungen in den meisten Fällen kommt die Haftpflichtversicherung des Entleihers ins Spiel, weil es sich die Versicherung auf das Fahrzeug bezieht und nicht auf den tatsächlichen Fahrer. Allerdings ist die Person, die das Fahrzeug leiht verpflichtet das Auto unversehrt zurückzugeben und dieser haftet dann unter Umständen für eventuelle Reparaturkosten.\n\nUnd in dem Fall ist es deine Aufgabe, keine Regeln mit diesem Account zu brechen. Du zahlst deine Strafe mit dem Permaban.\n_...bzw der TE ..._\n\n\n\n> Das ganze überhaupt mit Leauge Accounts zu vergleichen ist daher ohnehin fragwürdig.\n\nWie die unbekannte Person an die Zugangsdaten gekommen ist, sollte hier eher die Frage sein.\n\n\n\n \n> In jedem Fall sollte der Threadersteller nochmal mit dem Support schreiben und seine Lage gut erläutern,\n\nWenn er es nicht schon getan hat...\n\n >es gibt genug Fälle in denen der Support das ausgiebig nachprüft und dann den Account wieder freischaltet. Personen, die ihren Account verlieren immer sofort mit &quot;Kann man nichts machen, Pech gehabt&quot; abzuspeisen halte ich für kein gutes Verhalten. Jeder soll eine Chance bekommen sich zu erklären, wenn nun tatsächlich nachgewiesen werden kann das er &quot;gehackt&quot; wurde - dann halte ich es für unzumutbar ihm das noch so aufzudrücken.\n> Ich bin der festen Überzeugung das der Support immer noch der richtige Ansprechpartner ist, manchmal muss man öfter mit ihm schreiben um gehört zu werden.\n\nIch sage auch nicht, dass das kein Fall für den Support sein würde.\n\n> Andere Spieler werden dir hier nur das gleiche anraten oder dir an den Kopf werfen das du &quot;Pech&quot; hattest. \n\nWas erwarten die Leute denn auch anderes, wenn zwei Bangründe vorliegen? ó_ó\n\n> Wir wissen nicht was wirklich passiert ist\n\nWird der Support auch nicht btw. Die können ja schlecht wissen, ob das gezieltes Accountsharing war, oder wirklich nur das PW abgegriffen worden ist.\n\n> und der normale Spieler hat auch nur begrenzte Möglichkeiten das nachzuprüfen, daher wende dich bitte erneut an den Support und versuche ruhig zu bleiben - auch wenn dir viel am Account liegt.\n\nDu hast das \"@TE\" vergessen :P","replies":[]}]}]}]}]},{"poster":"Bettnachleger","date":"2018-06-09T22:36:07.106+0000","up_votes":2,"down_votes":0,"body":"Die Frage ist eigentlich: Wie kommt jemand an dein passwort? Tausendmal wichtiger als so ein dummer lol Account.\nWobei ... Warum sollte jemand versuchen an deine geheimen Daten  zu kommen, nur um 14 Runden lol zu spielen? \nNajaaaaaa....","replies":[{"poster":"The IlIest","date":"2018-06-09T22:44:17.397+0000","up_votes":1,"down_votes":0,"body":"Ich habe in den letzten Monaten meinen Account nur sehr selten genutzt. Ich habe keine Ahnung welche Möglichkeiten es gibt Accountdaten zu knacken und ich habe keine Ahnung warum jemand das tuen sollten, dennoch ist es passiert....","replies":[{"poster":"Zyzyx","date":"2018-06-10T06:51:55.763+0000","up_votes":3,"down_votes":0,"body":">  Ich habe keine Ahnung welche Möglichkeiten es gibt Accountdaten zu knacken\n\nQuasi gar keine. Das ist der springende Punkt hier. \n\nFalls du dich fragst warum dir die Leute hier im Forum mit ein wenig Misstrauen antworten...das ist der Grund. Da es quasi keine Möglichkeit (und vor allem keinen Grund) gibt ein sicheres Passwort zu knacken, sind derartige Stories wo ein Account angeblich einfach so geklaut wurde immer recht unglaubhaft.","replies":[]},{"poster":"Bettnachleger","date":"2018-06-09T22:53:21.168+0000","up_votes":1,"down_votes":0,"body":"lol dann sei froh, das deine Bankdaten usw. nicht geklaut wurden. \noh warte ... das wuerde jemand tun, der zugriff auf deinen Rechner hat.","replies":[{"poster":"Cenâreth","date":"2018-06-12T06:01:24.615+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Bettnachleger,realm=EUW,application-id=KYnfKGf0,discussion-id=G7BZLpLA,comment-id=000200000000,timestamp=2018-06-09T22:53:21.168+0000)\n>\n> lol dann sei froh, das deine Bankdaten usw. nicht geklaut wurden. \n\nWas in der heutigen Zeit ziemlich einfach möglich ist, wenn man sich damit beschäftigt. (und keine Sorge ich mach sowas generell nicht.)","replies":[]}]}]}]},{"poster":"Zyzyx","date":"2018-06-09T22:22:50.076+0000","up_votes":2,"down_votes":0,"body":"Antworte einfach auf das Ticket und erkläre die Situation. Rechne aber damit, dass man dir nicht helfen wird. Accountsicherheit liegt in deiner Verantwortung und wenn du sorglos damit umgehst und das irgendwelche Konsequenzen hat, hilft Riot in aller Regel nicht. ","replies":[{"poster":"The IlIest","date":"2018-06-09T22:35:32.981+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zyzyx,realm=EUW,application-id=KYnfKGf0,discussion-id=G7BZLpLA,comment-id=0000,timestamp=2018-06-09T22:22:50.076+0000)\n>\n> Antworte einfach auf das Ticket und erkläre die Situation. Rechne aber damit, dass man dir nicht helfen wird. Accountsicherheit liegt in deiner Verantwortung und wenn du sorglos damit umgehst und das irgendwelche Konsequenzen hat, hilft Riot in aller Regel nicht.\n\nIch habe auf das Ticket geantwortet, mehrfach und es wurde abgelehnt mir in irgendeiner weise zu helfen.\nAußerdem bin ich nie Sorglos mit meinen Accountdaten umgegangen. Mein Passwort bestand aus 15 Zeichen, Buchstaben und Zahlen und wurde niemals an andere weitergegeben.\nNatürlich liegt die Verantwortung der Accountsicherheit bei mir, doch wenn ich ein mehr als adequates Passwort nutze und NICHT \"passwort123\", dann kann es doch nicht sein, dass Riot sich weigert meinen Account wieder freizuschalten.\nAußerdem waren alle Antworten äußerst standardisieren. Ich hatte nicht den Eindruck, dass der Support wirklich versucht hat mir in meinem Anliegen zu helfen.","replies":[{"poster":"Zyzyx","date":"2018-06-10T06:47:26.668+0000","up_votes":2,"down_votes":0,"body":"Zu den Standard-Antworten: Das ist völlig normal. Ich arbeite für eine andere Spiele-Firma und muss dort gelegentlich auch auch als Third-Level-Support auf Tickets antworten, wobei Account-Recovery eines meiner Spezialgebiete ist. \nAccount Recovery ist wohl einer der standarditisiertesten Ticket-Prozesse überhaupt, weil man hier eine ganze Menge Informationen sammeln und sorgfältig vorgehen muss, damit mit diesem Prozess kein Schindluder getrieben wird (z.B. fremde Accounts bannen lassen oder sich fremde Accounts aneignen). \nIm Endeffekt geht es darum, dass man...\na) sicher ist, dass man tatsächlich mit dem Ersteller des Accounts spricht\nb) dem Spieler nicht nicht bei illegalen Aktionen hilft (z.B. Account zurückholen nachdem er verkauft, verschenkt oder verliehen wurde)\n\nDaher ist der ganze Prozess sehr formell und standardisiert und es gibt wenig Platz bzw Nutzen für, ich nenne es jetz mal provokant \"persönliche Sob-Stories\".\nGenerell machen derartige Tickets von Support-Seite auch nicht viel Spaß, da man meistens nicht helfen kann. Das liegt allerdings auch daran, dass in mindestens 90% dieser Tickets der Spieler selber schuld ist, man nicht mit dem Ersteller des Accounts spricht oder sich die Spieler selbst ins Knie schießen, indem sie entweder lügen oder inakkurate Antworten geben. \n\nWenn du also dem Supporter und dir selbst einen Gefallen tun willst, sieh zu dass alle Fragen so präzise wie möglich beantwortest und persönliche Ausschmückungen meidest. Wenn du ein \"nein\" bekommst, versuche herauszufinden warum. Sagt man dir, dass man dir nicht sagen kann warum \"nein\", liegt das meist daran, dass du nicht als Ersteller des Accounts identifiziert wurdest und du somit kein Recht auf diese Informationen hast.","replies":[]},{"poster":"Reboot Geostorm","date":"2018-06-10T04:32:23.148+0000","up_votes":1,"down_votes":0,"body":"Das stimmt auch.  Am Anfang bekommst du auch nur standart automatische Antworten..... Erst nach dem 5 oder 6 mal ect wird sich ein Mitarbeiter bemühen sich direkt mit deinem Problem zu beschäftigen.... Tipp :  Drann bleiben,  und wichtig immer freundlich sein....","replies":[]}]}]},{"poster":"Bärenmarder","date":"2018-06-10T14:18:04.170+0000","up_votes":1,"down_votes":0,"body":"S3 Bronze und dann auf einmal jede Season Platin, hmmm riecht aber ganz stark nach boosting, vor allem feedest du echt jedes Game rein, keine ahnung wie du platin gekommen bist.","replies":[{"poster":"The IlIest","date":"2018-06-11T12:48:43.847+0000","up_votes":1,"down_votes":1,"body":"Ich merke du bist nicht sonderlich mit der Thematik vertraut. Ich habe diese Season gar nicht gespielt. Die Spiele die gemacht wurden wurden nicht von mir gespielt, wie im Anfangsbeitrag beschrieben. Ich habe Season 3 angefangen zu spielen und quasi nur Placements gemacht. Elo Gaining kam dann erst in Season 4. Wie man halt Platin kommt, was alles andere als schwer ist? Einfach einmal200 SoloQ Games machen und das geht ganz schnell.","replies":[{"poster":"Mjöllnir1990","date":"2018-06-21T00:27:11.236+0000","up_votes":1,"down_votes":0,"body":"das is schlichtweg gelogen...\nhttp://euw.op.gg/summoner/userName=+The+IlIest\nich hab mit den spaß gemacht und ma gezählt.... nach meinem letzten wissensstand brauchte man nich ca 230 games für die placements... \nfakt is aber dass schon in s4 deutlich weniger(166games) und in seasons 7 fast gar nich mehr gespielt wurde... \nund dann kommt jemand und hackt deinen acc und macht reinzufällig 14 spiele (übrigens alles ranked und auch die einzigen rankeds diese season)? das wirkt mehr als unglaubwürdig... \nich mein im ernst... dann noch tpp? wirkt auch kaum so als hättest du jemanden der deinen acc einfach jede season solid in plat spielt und dann is gut... vllt auch noch scripts nutzt oder whatever...\nauch wenn das mit den scripts iwi unwahrscheinlich is weil der die meisten spiele einfach nur hart geintet hat... \naber ich kann mir nich vorstellen dass jemand so mirnichts dir nichts n 15 stelliges pw knackt was aus zahlen und buchstaben und am besten noch groß-kleinschreibung hackt... \njemand der sowas kann wird sicher keine lol accs klauen... \nbesonders weil der login name auch noch random is und mit den ingame namen nix zu tun haben muss... \nund man mit lol accs nich wirklich geld machen könnte (schon gar nich wenn man dann damit spielt und einfach schlecht is^^) \njemand der solche pws knacken kann würde sich sicher an anderen spielen mit verkaufbarem ingame content versuchen...\nich denke nich dass das sehr realistisch is bzw denke eher dass es eine gute geschichte is die aber leider faktisch widerlegt werden kann... und selbst solltest du zu dein recht einklagen wollen einfach keine substanz haben wird da sie halt null glaubwürdig is","replies":[]},{"poster":"Sirrkas","date":"2018-06-11T18:56:39.292+0000","up_votes":1,"down_votes":0,"body":"Rankeds funktionieren nicht so. Man steigt nicht einfach auf, nur weil man viel spielt. Ich habe Leute gesehen, die mit 2000 Rankedsiegen in einer Season Bronze 5 sind.","replies":[{"poster":"Cenâreth","date":"2018-06-12T06:06:30.680+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=G7BZLpLA,comment-id=000600010000,timestamp=2018-06-11T18:56:39.292+0000)\n>\n> Rankeds funktionieren nicht so. Man steigt nicht einfach auf, nur weil man viel spielt. Ich habe Leute gesehen, die mit 2000 Rankedsiegen in einer Season Bronze 5 sind.\n\nJa wegen Unfähigkeit (und sry wenn ich es so betitel aber es ist so), in Bronze Silber wird man Spieler antreffen die auf Dia Niveau sicherlich spielen können, aber auch wieder welche die bei 2000 Games dass Niveau nicht steigern können, weil sie sich mit dem Spiel nicht befassen können/wollen. Jeder weiß dass aktuell die Meta bei Runen und Rollen alle 2 Wochen verschoben wird nur eben diese Leute nicht, die werden noch ewig Bronze bleiben und dann gibt es eben diese toxischen Spieler die sich wie Sand am Meer vermehren und Account Sharing betreiben, man braucht nur bei eBay schauen wieviele Accounts auf unterschiedliche Server aktuell vertrieben werden.","replies":[{"poster":"Sirrkas","date":"2018-06-12T09:30:07.562+0000","up_votes":1,"down_votes":0,"body":"Du scheinst aber auch zu vergessen, dass nicht alle gleichzeitig Platin und Dia sein können. Wenn ab morgen, wirklich jeder wenigstens so gut wie Platin spielen würde, würden die Leute, die das Niveau haben, was aktuell in Platin 5 herrscht, die Bronzeliga bilden. Silber wären etwa die nächsten 2 Platindivisionen und so weiter.\n\nIch weiß auch nicht, was schlimm daran sein soll, wenn jemand Bronze oder Silber ist. Wenn der Spieler für sich entscheidet, er will jetzt unbedingt aufsteigen, steht es ihm frei, sich zu verbessern. Wenn sie nicht die nötige Energie dafür aufbringen wollen oder sie falsch einsetzen, ist das doch auch nicht schlimm. Niemandem von uns tut es weh, wenn jemand in Bronze feststeckt, egal ob er da raus will und es nicht schafft oder ob ihm sein Rang nicht so wichtig ist.","replies":[]}]}]}]},{"poster":"Gin","date":"2018-06-11T08:27:27.458+0000","up_votes":1,"down_votes":0,"body":"So gerne ich mich auf den Threadersteller in derartigen Threads stürze, es ist auch möglich dass er sich S3 einfach nur eingerankt hat und kaum Rankeds gespielt hat. So wie das z.B bei mir in S3 der Fall war.\n\nIch hatte allerdings das Glück in Silber 4 oder 3 eingerankt zu werden. Ich bin mir nicht mehr sicher was genau ich war, ist schon ein Weilchen her :D","replies":[]}]},{"poster":"Stichsaege","date":"2018-06-10T00:37:28.920+0000","up_votes":1,"down_votes":6,"body":"Gehe erst ml zur Polizei.\nMache eine Anzeige gegen unbekannt.\n\nDie können dann die IP ermittelen, und du hast ein Nachweiß deine Unschuld.\nDann kannst du von Riot die Entsperrung fordern.","replies":[]}]}