{"poster":"ZannShir","date":"2015-11-14T10:14:14.078+0000","title":"GRAZIE MILLE PER LA GIOCATA","subforum":"Aiuto e supporto","up_votes":2,"down_votes":2,"body":"Cari player, e cara RIOT, sicuramente avete ricevuto 1000000 di questi post, e probabilmente di alcuni ve ne siete fregati ma io voglio tentare. Questa mattina ho fatto una partita con morgana nella season 6 ( complimenti peri fix e per i tanto aspettati aggiornamenti per gli adc) gioco,gioco e nel MID GAME si blocca il computer, si blocca per 1 min E POI SI SPEGNE IL COMPUTER{{champion:63}} ....IMMAGGINATEVI LA MIA FRUSTRAZIONE...ma io da buon player apro il computer e accedo al LOL. clicco su riconetterti  e si blocca al 97%. Tento parecchie volte (intanto imprecavo), e poi VIENE LA BELLISSIMA SCHERMATA CON DISERTORE E PRIORITA LIMITATA (GRAZIE RIOT)...ADDESSO HO PAURA DI RICONETTERMI PERCHE SE MI DISCONNETTO ANCORA SECONDO ME MI BANNATE (NO GRAZIE), se on volete perdere un fan cercate di ripararlo al pi&ugrave; presto\r\nCON AFFETTO (ancora per poco credo)\r\nUN PLAYER ARRABBIATO {{sticker:zombie-brand-facepalm}} \r\n\r\nP.S. AVRO FATTO QUALCHE ERRORE DI ORTOGRAFIA MA HO SCRITTO VELOCEMENTE, PER FAVORE CHIUDETE UN OCCHIO{{champion:161}}","replies":[{"poster":"Jackeg","date":"2015-11-14T11:13:06.906+0000","up_votes":2,"down_votes":0,"body":"Ma non pensi che i problemi sono del tuo PC è non del gioco? Io posso capire i crash e tutto ma stai sicuro che lol non ti spegne il pc","replies":[{"poster":"ZannShir","date":"2015-11-14T14:28:59.922+0000","up_votes":1,"down_votes":0,"body":"ovvio ma infatti e la prima volta","replies":[]}]},{"poster":"Capoz","date":"2015-11-14T11:03:14.275+0000","up_votes":1,"down_votes":0,"body":"Ma perchè giocate coi tostapani e ve la prendete con la riot?\nCioè, usi pure il caps lock... degrado.","replies":[{"poster":"ZannShir","date":"2015-11-14T14:30:51.644+0000","up_votes":1,"down_votes":0,"body":"peccato che il gioco e sempre fluido (oppure la riot se la prende con i tostapani{{champion:115}} )","replies":[]}]},{"poster":"CIOSS099","date":"2015-11-14T10:48:25.727+0000","up_votes":1,"down_votes":0,"body":"questa e la meno stai tranqullo io dalla nuova BELLISSIMA PATCH 5.22 non posso piu giocare sono a casa con la febbre a rugolarmi i coglioni perche e da mercoledi sera dopo la bellissima patch che non mi fa piu giocare.. cioe mi spiego meglio.. dopo la selezione champ dovrebbe essere la schermata di aspetto con tutti che devono arrivare al 100%.. A ME non carica un cazzo rimango li con schermata nera con il cerchietto di caricamento e poi appare errore connessione server riporvaa riconnetterti e non va.. mi sono beccato la coda da 20 min in 5 partite perche nel corso dei giorni ho riprovato a giocare ma nulla e adesso ogni 3/4 provo a fare una personalizzata ma non va manco quella... e una presa in giro che mezza italia dopo sta patch non puo giocare... le patch dovrebbero migliorare un gioco non riempirlo di bug","replies":[]},{"poster":"IWantToWinPls","date":"2015-11-14T10:22:10.694+0000","up_votes":1,"down_votes":0,"body":"Amico amico....A me si spegne il computer molto spesso durate le partite... fai come me... nei 20 minuti cerca di cazzeggiare sul formu aiutando gli altri e cercare consigli sui campioni.... Io lo sto facendo in questo momento {{sticker:zombie-brand-clap}}","replies":[{"poster":"ZannShir","date":"2015-11-14T10:26:41.740+0000","up_votes":1,"down_votes":0,"body":"hai ragione...ma secondo te mi sbloccano dalle 5 famose partite a bassa priorita","replies":[{"poster":"IWantToWinPls","date":"2015-11-14T10:28:43.387+0000","up_votes":1,"down_votes":0,"body":"No amico caro.. io intendevo mentre  ASPETTI i 20 minuti,cazzeggia sul forum... fai qualcosa di utile e inganni il tempo..Devi aspettare {{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]}]}