{"poster":"kiwibeschwörer62","date":"2015-11-03T20:20:22.199+0000","title":"Niedrige Prioritäten","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Einen wundersch&ouml;nen guten Tag, liebe Spieler. \r\nIch wollte mal wissen ob  man auch eine Sperre bekommen kann, wenn man nicht reportet wird. Ich achte immer darauf nie das Spiel zu verlassen, was mir auch gelingt. Als aber heute mein Internet f&uuml;r 6-9 Min aufgab, stellte ich fest, dass ich eine Sperre bekommen habe (5 mal 5 Min. warten). Das hat mich erschrocken, vor allem da wir erfolgreich den Sieg geholt haben. Das finde ich sehr schade, da ich an diesem Spiel nichts zu meckern habe. \r\nUnd nat&uuml;rlich ist das auch mein Problem, aber wegen schlechtem Internet eine Sperre bekommen?\r\nWie dem es auch sei, ich wollte fragen ob man dies verhindern kann, eine Sperre deswegen zu bekommen und ob man wegen zu often Sperren  permanent gebannt werden kann. \r\nWenn ihr wisst, wie man sowas verhindern kann, dann schreibt es bitte!!! Mein Internet spinnt n&auml;mlich in letzter Zeit sehr oft, was ich hoffentlich bald behebe. Manchmal kriege ich gute Runden hin, selten Runden bei denen ich das Spiel neustarten muss.\r\nDanke f&uuml;rs lesen!","replies":[{"poster":"Megamaexx","date":"2015-11-03T22:10:45.537+0000","up_votes":2,"down_votes":0,"body":"Soweit ich weiß, kommt die Sperre erst nach mehrmaligem Vergehen. Auch wenn es unfair sein mag, wenn du durch Internetprobleme aus dem Spiel fliegst, finden es deine Mitspieler unfair, dann plötzlich zu viert auf dem Platz zu stehen. Demnach also ganz gerechtfertigt.\n\nAber ich habe noch einen Trostkeks für dich {{item:2010}} \n\nund noch einen better-luck-with-internet-Keks {{item:2009}} \n\nMfG :3","replies":[{"poster":"kiwibeschwörer62","date":"2015-11-04T08:07:13.930+0000","up_votes":1,"down_votes":0,"body":"Okay, vielen Dank für die Infos. Ich weiß auch warum das Internet so schlecht war; Meine Eltern schauten einen Film.... Dadurch war das Internet ab und zu weg..... Du hast ja schon recht, wenn  das Spiel verlassen wird und das Team dann verliert, ist das ganz schön nervig!\nUnd danke für die Kekse, hab ich schon alle gegessen <3","replies":[]}]},{"poster":"Blubi di Blub","date":"2015-11-03T20:47:02.692+0000","up_votes":1,"down_votes":1,"body":"So leid es mir auch tut ... Wenn du weißt dein Internet spackt rum, dann solltest du eben nicht spielen ... :/ Einfach deswegen, weils das Spielgefühl der anderen 4 bzw. 9 Mitspieler stark beeinflusst. In normals kein Ding, aber in Ranks würde ich mich auch ein wenig veräppelt fühlen wenn jemand ausm Team wegen \"Internet problems\" uns allein lässt ... Mal abgesehen davon, dürftest du ja wohl auch überhaupt keinen Spaß dran haben mit Laggs zu spielen. Versuch mal mit ner LAN Verbindung zu spielen. Die sind DEUTLICH stabiler, ich habe ne 50 er Leitung bei der Telekom und hatte mit WLAN an manchen Tagen so nen highen Ping (100+) das glaubste nicht, Spielspaß war da ein fremdwort. Mit LAN alles weg. Nie irgendwelche Probleme was Ping angeht.","replies":[{"poster":"kiwibeschwörer62","date":"2015-11-04T08:13:02.517+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für deine Antwort!\nIch bin nicht in Ranks, keine Sorge :D Und wie bereits geschrieben habe, das Internet spinnt selten, in der Woche jetzt 2 mal, einmal war der Router überhitzt, das andere mal schauten meine Eltern einen Film! Und mein Ping ist immer zwischen 35-45. Ich glaube mal, dass das nicht so schlecht ist!","replies":[]}]},{"poster":"FlavourFlame","date":"2016-08-28T15:10:14.111+0000","up_votes":1,"down_votes":1,"body":"ich hoffe du kriegst nen permaban, nachdem was du letztes game abgzegogen hast... anderen das spiel zu versauen und dann noch so überheblich tun... pfui!","replies":[]}]}