{"poster":"parky82","date":"2017-03-03T10:18:10.596+0000","title":"cho'gath","subforum":"Campioni e gameplay","up_votes":1,"down_votes":2,"body":"io mi ricordo che quando moriva decresceva di almeno tre cariche adesso lo ha comprato un mio amico e non solo cresce in maniera illimitata ma quando muore non perde nemmeno piu le cariche .la domanda &egrave; mi ricordo male io avendolo tenuto solo in prova o questo bestione prima aveva un limite di crescita e quando moriva perdeva qualcosa o mi sbaglio?","replies":[{"poster":"Dr LouD","date":"2017-03-03T10:45:30.386+0000","up_votes":2,"down_votes":1,"body":"E' il bello di esser bronzi","replies":[{"poster":"mangialavandini","date":"2017-03-03T15:18:11.629+0000","up_votes":1,"down_votes":1,"body":"dai dai, non essere cattivo, (risposte brevi e concise) inimitabile ILouD INCOREGGIBILEEE ILOUD ILOUD INARRESTABILEEEE SEIIIII","replies":[]}]},{"poster":"mangialavandini","date":"2017-03-03T15:20:08.630+0000","up_votes":1,"down_votes":0,"body":"l'hanno mini reworkato\n\npatch. 7.4 - buona lettura.\n\nBanchetto può accumularsi all'infinito contro campioni e mostri epici, e le cariche non scadono più alla morte. Rapporto di potere magico di Banchetto ridotto; aggiunto rapporto salute bonus.\n\nÈ un po' di tempo che Cho'Gath è deboluccio: la sua ultima incursione nelle note sulla patch, ai tempi della 6.20, ha reso Urlo bestiale un'abilità più equa da affrontare, ma ha indebolito Cho, rendendo il suo kit meno affidabile. Aggiorniamo Banchetto per potenziare gli aspetti più belli della fantasia da colossale mostro del Vuoto di Cho'gath, rimuovendo la frustrazione data dal perdere le cariche alla morte (trovarsi alle prese con una anti-valanga dopo la morte era una brutta esperienza). Così facendo Cho è meno rischioso e scegliere configurazioni da tank è una buona scelta.\nAGGIORNATOR - Banchetto\nModifiche alle regole riguardanti le cariche di Banchetto.\n\nMEMORIA ALIMENTARE Cho'Gath non perde più le cariche di Banchetto alla morte\nSFAMA IL VUOTO Banchetto ora può accumularsi all'infinito (da minion e mostri non epici è possibile ottenere solo cinque cariche, che non devono necessariamente essere le prime cinque)\nHO ANCORA FAME Banchetto non cura più Cho'Gath quando uccide un'unità col massimo delle cariche (mangiare un sesto minion o un mostro non epico non fa nulla, oltre ai danni)\nDIGESTIONE INDISCRIMINATA Banchetto non conferisce più due cariche all'uccisione di un campione o metà mana e rimborso ricarica all'uccisione di un minion\nCRITICO GASTRONOMICO Il tooltip di Banchetto ora tiene traccia di ciò che ha mangiato Cho'\nTutto il resto.\n\nRAPPORTO 0,7 potere magico ⇒ 0,5 potere magico e 10% salute bonus\nSALUTE BONUS PER CARICA 100/140/180 ⇒ 80/110/140\nSALUTE BONUS A 6 CARICHE 600/840/1080 ⇒ 480/660/840\nBONUS MASSIMO GITTATA D'ATTACCO +50 (175 gittata d'attacco) ⇒ +75 (200 gittata d'attacco)\nNON ESAGERIAMO Cho'Gath raggiunge le sue dimensioni massime (e il massimo di gittata d'attacco bonus) a 10 cariche\n\na","replies":[]},{"poster":"vondarck","date":"2017-03-03T12:17:54.387+0000","up_votes":1,"down_votes":0,"body":"La vecchiaia....","replies":[]},{"poster":"sciacallo3","date":"2017-03-03T10:39:11.663+0000","up_votes":1,"down_votes":0,"body":"=  permaban","replies":[]},{"poster":"Jeanne dˆArc","date":"2017-03-03T10:35:12.362+0000","up_votes":1,"down_votes":0,"body":"Patch note, queste sconosciute... Non ricordi male, prima perdeva stack quando moriva ma di recente è stata modificata l'ulti, che tra i vari cambiamenti apportati, comprende anche la possibilità di accumulare stack infinite e il non perderle alla morte.","replies":[]},{"poster":"MyXanadu","date":"2017-03-03T10:44:09.673+0000","up_votes":1,"down_votes":1,"body":"Leggere le patch notes?","replies":[]}]}