{"poster":"Surry","date":"2016-06-16T03:52:21.820+0000","title":"Dear Riot. League is in the worst place it has been since season 2","subforum":"Gameplay & Strategy","up_votes":4,"down_votes":5,"body":"Dear riot, \r\nNow I know I&#039;m going to get a whole lot of hate for this. But really at this point I&#039;m past caring.  At present I have over 4000 games played across my accounts, and have been playing since early season 2. And never until now have I felt that the game was so un-fun to play that I would be better of spending my time anywhere else. Here are my reasons\r\n\r\n1. True damage exists, and for some reason keeps getting added to more and more champions. \r\nThis mechanic is game breaking for me in multiple ways, but primarily its that feeling that no matter what I build to try and defend myself from it, NOTHING at all will work.  This was okay when only Irelia and Vayne had it. But with the addition of true damage to the likes of Master Yi, Fiora and others it moves from the feeling that you had a chance to fight these champs to helplessness as they just run across your entire team when they get any sort of lead.\r\nThis would be much better if you had some way to mitigate some of the raw damage that&#039;s thrown at you else being a tank is meaningless.\r\n\r\n2. Zed is a thing. \r\nZed. Do i need to say any more? Yes? Well okay. Since changing QSS to not remove zed ult&#039;s the only real way to block some of his retardedly huge burst is zhonyas, which let&#039;s face it.. forces people to either play ap, build an item which doesnt work at all for their champ, die needlessly, or give up. He was already strong.. but with the addition of the new assassin item he&#039;s got little to no counters especially at low elo. &quot;killing is his job&quot; was said in recent patch notes. Well guess what? SO IS EVERY OTHER CHAMP IN THE GAMES. Except soraka. Hers is to punish you so much you wish she just killed you. \r\n\r\n3. Balancing for the Pro scene.\r\nYes I understand LoL is now an Esport. No I don&#039;t agree with the need to balance for 1% of the game community population. When you have most of the population in lower elo&#039;s getting destroyed by a few ridiculous assassins and ez win champs like Tryn and Yi, ekko, fizz, zed to name a few, the ones forced to play against this cancer don&#039;t care in the slightest about tiny poppy nerfs. \r\n\r\n4, &quot;Killing is fun&quot; \r\nThis mentality is what brought this on. I get that outplaying and killing someone with skill is fun. 100-0 bursting someone just because you picked leblanc or some other stupid damage dealer is not fun at all to fight against. It forces you to try build defenses, which most of the time only sets you further behind as it lets them just build more and more damage to kill you easier with. What happened to trying to get sustain mages any sort of game play? Currently its either pick something that can&#039;t be killed, pick an assassin or pick azir.\r\n\r\n5. ADCs no longer have a place in the game. \r\nArgue with me if you like. But even the castors for the OPL said that you can no longer carry as an adc, you&#039;re better off picking a utility adc and supporting your top jg and mid. What the actual f*** is the point of the role then. Why not just throw the whole class out the window and put another mage down there or another support? \r\n\r\n6. Magic resist means nothing. Not a damn thing. \r\nTo put it in context, I just played a game as shen. I built a zz rot, mercs, spirit visage as my mr items. I had 4.7k hp. JG elise on the enemy team killed me in one combo. ONE COMBO. It took her under 2s to kill 4.7k hp. On top of all my shen passive shields. How is this even balanced? Or does MR just not work any more? Should I just say f*** it and build damage? If so thats more of the problem that I have with the game right now... since damage seems to be everything. \r\n\r\n7. Supporting feels like the slow onset of aids\r\nI main support. I loved the role. In season 3 playing taric and leona felt powerful and it felt like I was doing my part to win games. Currently though It&#039;s the opposite. You&#039;re so gold starved you can&#039;t get any sort of tankiness going until late game when everyone already has their items, you&#039;re constantly expected to be ALL the teams wards when no one will guard your back when you go to place them. And then theres the support items.. not a lick of defense on them besides a little hp. Small wonder every time I join games now the enemy support is a mage type.  or thresh. thresh does everything. \r\n\r\n8. Invincible ultis. \r\nIt seems like the current trend is to just give champions not only a small shield to stop them dying, but to lay down an AOE field around them to stop EVERYONE dying. Kayle and Zileans ult&#039;s used to feel strong enough already, but with new Taric and Kindred, it feels like whoever picks those have a huge unfair advantage. Small wonder azir rose in popularity again to shove people out of kindreds, but these skills don&#039;t even feel fun to play with or against. They just feel like unneeded power to a game already starting to feel like a kill or be killed fps. \r\n\r\nAND Probably my biggest pain with playing at the moment\r\n\r\n9. Champions kits that do EVERYTHING\r\nOn Thresh&#039;s release I felt the beginning of the end for my enjoyment. And you know what? It&#039;s true. \r\nIn any other game a champion that had 2 displacements, a shield, stacking armor, a huge slow, and a hail mary save skill would be considered broken. But apparently not here, because -drumroll please- The release of Ekko was announced. \r\nEkko&#039;s kit is to be brutally honest, the single most overpowered thing I have ever seen released on LoL. And this is from someone who had to fight rengar on his release where he 1 combo killed people at level 1. Seriously. Ekko has a slow, a dash, another move speed buff, a shield, a stun and to top alllll of that nonsense off, he gets to rewind time and do it all over again after healing himself to full and doing a huge aoe nuke on his return trip. Why should ANY champion have this much utility? Don&#039;t give me this crap about him being balanced because he got nerfed a tiiiiny bit. When his kit screams out &quot;Abuse me and get free wins&quot; no matter how much you nerf the damage.  Since his utility is always relevant, and no one can ever catch him to kill him.\r\n\r\n\r\n\r\nSo thank you riot. Not even a new rainbow skin for Taric could make me enjoy the game in its current state. The game is no longer skill based, it&#039;s a mockery of what it once was and It&#039;ll take a long while and a lot of needed changes before it becomes fun again. {{champion:44}}","replies":[{"poster":"Omni Presents","date":"2016-06-16T11:38:57.772+0000","up_votes":2,"down_votes":1,"body":"Since Season 2? I think it is worse than that. Every day I come onto the forums there are more and more posts about how bad this game has gotten and if not for the few of us bothering to come here, no one will even know there is any sort of problem.\n\nThe issue about being here and stating what you are stating is that you get the obvious, those who play the game for real, join a premade team every game, stomp the enemy and say there is nothing wrong while giving us who care and play solo queue shit for saying there is something wrong.\n\nPlayers don't want to come here and say anything knowing they will be downvoted out of here for saying something by those who premake teams and see no issues. We need to get everyone on board and start showing Riot that there really is an issue, http://boards.oce.leagueoflegends.com/en/c/gameplay-strategy/ymNFgFVZ-sometimes-you-just-cant-climb - A Platinum 2 main player cannot climb out of low ELO, when that happens, there is somewhat of an issue.","replies":[]}]}