{"poster":"Syntzx","date":"2019-04-03T15:47:06.826+0000","title":"No piensan que el precio de RP en argentina es exageradamente caro?","subforum":"Charlas Generales","up_votes":12,"down_votes":3,"body":"Pues eso, antes estaba mucho más accesible. Antes si querías comprar una skin de 1350 RP gastabas 100 pesos argentinos ( es muy poco ). Pero ahora si queres comrpar una skin del mismo valor tenes que gastarte el triple. Por una skin de 1820 RP ahora estás gastando 500 pesos argentinos, que es una barbaridad, es casi el triple del precio anterior. Yo pienso que deberían modificar eso. No es exageración que está al triple, realmente es impagable.","replies":[{"poster":"AMD Radeon RDNA","date":"2019-04-03T15:56:24.457+0000","up_votes":10,"down_votes":3,"body":"Te dejare un comentario muy sabio de hace varios meses sobre esta cuestion \n\n> https://boards.las.leagueoflegends.com/es/c/charlas-generales/8FZOH80o-una-vergaenza-el-tema-del-rp-y-mi-tienda?show=flat&amp;comment=0020\n> \n> \n> Borriic III (LATS)  - about 2 hours ago\n> FAQ y Bofetada de Realidad para mis amigos argentinos (sin animo de bardear a nadie)\n> Les pusieron las skin al precio que tienen en todo el mundo, no todas las monedas tienen el mismo valor en el mundo y muchas veces el acceso a los distintos bienes viene dado por la fuerza que tenga tu moneda en el intercambio, en ocasiones las compañias abaratan los costos en regiones en crisis para no perder a toda la clientela, pero realmente no estan obligados a hacerlo\n> \n> por que riot haria eso? son estupidos? quieren perder todos sus clientes de una comunidad tan grande como es la argentina?\n> Respuesta: No, pero considera que alguien de europa o de norteamerica, antes que cargar en su propio servidor preferia pagar el cambio de server y comprar al precio argentino para luego volver a su servidor OSEA IMAGINA LO BARATO QUE LO TENIAN que se pegaba el viaje de ida y vuelta y aun asi le rentaba mas. Es mas, yo como chileno y la mayoria de mis amigos tambien comprabamos a precio argentino, literalmente una skin nos valia el vuelto de comprar una coca cola en el almacen de la esquina\n> \n> Pero Borric, yo soy argentino y siento que no estamos tan jodidos, puedo comer bien y tanto mis amigos como conocidos se ven bien ¿De que me hablas?\n> Respuesta: eso es por su cultura bro, aunque muchos chilenos no lo admitiremos de buenas a primeras, lo cierto es que la cultura del argentino promedio es increible, son gente muy amable y en general culta que administra bien los recursos con los que cuenta, sin embargo al final del dia la mayoria de tus amigos o conocidos de esas tierras tan hermosas estan con el agua hasta el cuello de deudas y muchas veces ni lo saben\n> \n> Entonces RIOT no me esta cagando?\n> Respuesta: Si, te estan cagando, pero no con la intencion de hacerlo, sino con la intencion de mantener reales sus numeros respecto a las transacciones ocurridas en cada region, no es normal que un gringo x prefiera pagar 2 cambios de servidores para cargar rp y aun asi le salga rentable\n> \n> Y que onda como steam me permite comprar barato?\n> Respuesta: eso es pedo de steam, un amigo de mi hermano compra en rupias los juegos para todo su grupo, literalmente un juego le vale lo mismo que comprar 3 caramelos en el kiosquito de la esquina, si steam no ha cambiado eso es porque o no les importa o no se han dado el tiempo de hacer los estudios pertinentes\n> \n> Entonces deberia estar enojado?\n> si, pero no con riot, sino con quienes manejan y han manejado tu pais de tal modo que son pocas las empresas que pueden invertir o intentar surgir alla y por lo tanto generan un cambio monetario poco atractivo para el extranjero\n> \n> Moraleja?\n> macri gato, los K te robaron, tu pais hace 80 años pintaba a ser el pais mas poderoso de la region y todos pensaron que serian el primer pais latino de llegar al primer mundo, las malas politicas los han ido empobreciendo de una manera casi imposible, pero siguen siendo gente espectacular y no hay mal que dure 100 años ustedes saben de poner huevos, nada mas no dejen que el progresismo descerebrado los empobrezca como a la actual europa no nordica\n> \n> saludos :)","replies":[{"poster":"Plagg","date":"2019-10-22T00:57:52.126+0000","up_votes":1,"down_votes":0,"body":"tipazo","replies":[]},{"poster":"Adamek","date":"2019-05-27T01:43:44.582+0000","up_votes":1,"down_votes":0,"body":"es tan facill como poner una clausula de cambio de region, que peudas cambiar de region cada x cantidad de tiempo. O que el pago con la tarjeta tiene que ser erradicada en argentina, mil cosas. Eligieron la mas facil.","replies":[]},{"poster":"Syntzx","date":"2019-04-04T01:02:39.964+0000","up_votes":1,"down_votes":0,"body":"A ver si entiendo que es barato. Pero es lo mismo que en Venezuela le pongan una skin a 12 dólares, o 15 en efectivo, sabiendo que con eso comen un mes. No es tan exagerado nuestro caso. Pero en chile, por ejemplo, es otro el precio dólar y pagan mucho menos que nosotros ahora. Se que estaba baratísimo, pero ahora es MUY caro, el triple del precio anterior, ese es mi punto.","replies":[{"poster":"AMD Radeon RDNA","date":"2019-04-04T01:45:41.636+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=No Paradise,realm=LAS,application-id=v7qsfXsE,discussion-id=zWtEkEO8,comment-id=00010000,timestamp=2019-04-04T01:02:39.964+0000)\n>\n> A ver si entiendo que es barato. Pero es lo mismo que en Venezuela le pongan una skin a 12 dólares, o 15 en efectivo, sabiendo que con eso comen un mes. No es tan exagerado nuestro caso. Pero en chile, por ejemplo, es otro el precio dólar y pagan mucho menos que nosotros ahora. Se que estaba baratísimo, pero ahora es MUY caro, el triple del precio anterior, ese es mi punto.\n\nY que queres viejo? Es culpa de la economia de cada pais. Lamentablemente aunque a todos nos duela, nos la tenemos que bancar solamente.","replies":[{"poster":"Syntzx","date":"2019-04-05T01:41:01.518+0000","up_votes":1,"down_votes":0,"body":"O podemos intentar quejarmos a que vuelvan los precios a moenda argentina. No es bancarsela, es hacernos escuchar. Justamente por eso nos siguen robando los politicos xd","replies":[{"poster":"AMD Radeon RDNA","date":"2019-04-05T02:04:34.166+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=No Paradise,realm=LAS,application-id=v7qsfXsE,discussion-id=zWtEkEO8,comment-id=0001000000010000,timestamp=2019-04-05T01:41:01.518+0000)\n>\n> O podemos intentar quejarmos a que vuelvan los precios a moenda argentina. No es bancarsela, es hacernos escuchar. Justamente por eso nos siguen robando los politicos xd\n\nAy por favor, en serio comparas una estupidez de un videojuego con la economia de un pais cualesquiera? {{sticker:zombie-brand-facepalm}} \n\nA mi me importa mas como se llega a fin de mes y el aumento de los productos de la canasta basica.","replies":[]}]}]},{"poster":"Syntzx","date":"2019-04-04T01:03:49.796+0000","up_votes":1,"down_votes":0,"body":"Además, los demás países no lo pagan a precio dólar, así que lo que dije antes no tiene sentido. Juego con amigos chilenos que lo pagan a moneda chilena, no precio dólar. Ese es mi punto","replies":[]}]}]},{"poster":"ToxicRunner","date":"2019-04-03T21:26:03.092+0000","up_votes":6,"down_votes":0,"body":"Pero por 200 pesos te llevas un pack de 10 juegos de Steam, o por 250 te llevas el borderlands The handsome collection.\n\nDesde que aumento el rp dejo de ser una prioridad para ese vuelto que me sobraba después de una semana, y ahora compro juegos de Steam o junto y compro juegos de ps4.\n\n¿Por qué?\n\nPor qué el precio no va a bajar, y andar pagando más de 300 pesos por una skin que nisiquiera tiene interacciones medio meh.\n\nActualmente el que yo compré RP es tan probable como que mañana por la mañana encuentre un lambo aparcado en mí sala, simplemente por qué hay mejores cosas que puedo comprar por menos plata.","replies":[{"poster":"Syntzx","date":"2019-04-04T01:09:12.088+0000","up_votes":1,"down_votes":0,"body":"Pienso igual, y muchos piensan igual. Por eso pienso que algo debería cambiar","replies":[]}]},{"poster":"Carmat","date":"2019-04-03T16:01:16.591+0000","up_votes":6,"down_votes":0,"body":"Y lamentablemente si Argentina va de mal en peor el precio de rp será impagable.","replies":[{"poster":"Syntzx","date":"2019-04-04T00:58:41.251+0000","up_votes":1,"down_votes":1,"body":"Pasa que esta mal que se maneje a precio dólar. En argentina cambia todos los días xd. Pero subirle un 50% es aceptable, pero un 200% por el precio dólar es mucho. De todas formas la gente consume más cuando el precio es menor","replies":[]}]},{"poster":"Fízz","date":"2019-04-03T15:48:19.751+0000","up_votes":6,"down_votes":1,"body":"lamentablemente es justificable por la inflacion de argentina , aunque si es bastante","replies":[{"poster":"Syntzx","date":"2019-04-04T00:59:52.006+0000","up_votes":2,"down_votes":1,"body":"Si, es una lástima. Pero el problema para mí es que esté a precio dólar. Como dije, subirle un 50% más a lo que estaba antes ( por precio y cantidad de RP ) es aceptable, terminas comprando una skin de 1820 a 300, no a 500 como ahora","replies":[]}]},{"poster":"Salvor","date":"2019-04-03T16:05:28.762+0000","up_votes":3,"down_votes":0,"body":"Es muy caro, el otro día estaba pensando en cargar y hago la conversión del dolar y PUM! **1000 pesos!**\nOsea WTF! Si bien puedo pagarlo es una barbaridad.\n\nEn warframe te ofrecen cada cierto tiempo 75% de descuento y por 100 o 200 pesos compras una cantidad aceptable.","replies":[{"poster":"Syntzx","date":"2019-04-04T01:05:00.002+0000","up_votes":2,"down_votes":0,"body":"Yo me compre ember, frost y ash a lo que serian 300 pesos xd, mas otras Armas que no recuerdo","replies":[]}]},{"poster":"Zhearun","date":"2019-04-03T17:45:41.561+0000","up_votes":4,"down_votes":1,"body":"En realidad, está al mismo precio que en el resto del mundo. El problema es que acá tenemos un 21% de impuestos por VAT por el gobierno, a los cuales, obviamente, el pago recae en nosotros, los consumidores argentinos, y no en las empresas (en otros países, estos impuestos se les hacen a las empresas extranjeras *y les obligan a estas no cobrárselo a los consumidores*)","replies":[{"poster":"Syntzx","date":"2019-04-04T01:07:59.413+0000","up_votes":1,"down_votes":0,"body":"Somos los únicos que pagan el rp a precio dólar, ese es mi punto. Por lo que he estado leyendo, en chile se paga a moneda chilena, por mucho más rp. Por que si al menos subieran la cantida de rp por el precio valdría la pena, pero es demasiado. Más allá del precio dólar en argentina","replies":[]},{"poster":"Mona","date":"2019-04-03T19:44:16.937+0000","up_votes":1,"down_votes":0,"body":"No cuesta mucho entrar a la tienda y ver que los precios comprando con crédito son \"menores\" (terminas pagando lo mismo que en efectivo) debido al impuesto del que hablas, Riot lo descuenta de la compra con crédito.\nEl verdadero problema es que tenemos una economía terrible y nuestra moneda no vale nada.","replies":[]}]},{"poster":"Punga1","date":"2019-04-04T01:38:56.557+0000","up_votes":1,"down_votes":0,"body":"Aun asi teniendo trabajo y aun asi pudiendomelos pagar me parece extremadamente caro, mas con el impuesto que cobran y en dolares se va a las nubes!","replies":[{"poster":"Syntzx","date":"2019-04-05T01:42:15.286+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Heights,realm=LAS,application-id=v7qsfXsE,discussion-id=zWtEkEO8,comment-id=000e,timestamp=2019-04-04T01:38:56.557+0000)\n>\n> Aun asi teniendo trabajo y aun asi pudiendomelos pagar me parece extremadamente caro, mas con el impuesto que cobran y en dolares se va a las nubes!\n\nEl problema es que pagamos el precio en dolares, con pesos argentinos. Eso esta mal...","replies":[{"poster":"Syntzx","date":"2019-04-05T01:44:13.532+0000","up_votes":1,"down_votes":0,"body":"Pero y chile, por ejemplo siguen manejando su moneda.","replies":[]}]}]},{"poster":"SARPADO SCRIPT","date":"2019-04-04T00:10:27.416+0000","up_votes":2,"down_votes":0,"body":"No, el precio esta bien, pero nuestra moneda esta en la mierda","replies":[]},{"poster":"Gogeta SSJ Blue","date":"2019-04-03T20:57:40.388+0000","up_votes":2,"down_votes":0,"body":"La última vez que cargue rp fue cuando el pack más caro estaba 1000 pesos y te daba como 12000 y algo. Hice 2 cargas seguidas porque el precio aumentaba a 1600 el pack más caro (que ya me pareció una barbaridad) y encima te daban menos rp. \nY cuando vi que cambiaron a dólar poniendo a 80 dólares el paquete más caro decidí no comprar más. Es una estafa, más si comparas que con 1600 te daban 10000 y ahora te dan 14000 siendo que estas pagando 1600 más (masomenos). \nY si, es carísimo.","replies":[{"poster":"Syntzx","date":"2019-04-04T01:12:27.693+0000","up_votes":1,"down_votes":0,"body":"Yo pienso que debería volver a precio re moneda argentina, con un aumento del 50% base. Ósea, la cantidad de rp de antes a un 50% más cara. ( 2250 de rp por 300, por ejemplo )","replies":[]}]},{"poster":"Leandro007","date":"2020-02-21T03:59:02.248+0000","up_votes":1,"down_votes":0,"body":"Es verdad lo que dice","replies":[]},{"poster":"LiamSham","date":"2020-02-19T01:10:27.161+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Syntzx,realm=LAS,application-id=v7qsfXsE,discussion-id=zWtEkEO8,comment-id=,timestamp=2019-04-03T15:47:06.826+0000)\n>\n> Pues eso, antes estaba mucho más accesible. Antes si querías comprar una skin de 1350 RP gastabas 100 pesos argentinos ( es muy poco ). Pero ahora si queres comrpar una skin del mismo valor tenes que gastarte el triple. Por una skin de 1820 RP ahora estás gastando 500 pesos argentinos, que es una barbaridad, es casi el triple del precio anterior. Yo pienso que deberían modificar eso. No es exageración que está al triple, realmente es impagable.\n\nSi","replies":[]},{"poster":"Tenori Taiga","date":"2019-10-22T03:44:24.801+0000","up_votes":1,"down_votes":0,"body":"Sabes que tambien aumento muchisimo en Argentina? El pan, la leche, la carne, la comida en general, los servicios, los productos de higiene, la nafta, los alquileres, y un largo etc.\nLos rp cuando estaban con un dolar a 10 pesos eran mas accesibles que ahora wue estan con un dolar que ro da los 60.","replies":[{"poster":"Syntzx","date":"2019-10-22T06:42:15.772+0000","up_votes":1,"down_votes":1,"body":"Amigo no seas peronista","replies":[{"poster":"Tenori Taiga","date":"2019-10-22T08:04:27.546+0000","up_votes":1,"down_votes":0,"body":"No llego a comprender como ser o no peronista hace fluctuar el presio de las cosas","replies":[{"poster":"Syntzx","date":"2019-12-06T17:05:15.985+0000","up_votes":1,"down_votes":0,"body":"Vos fijate que gobierno dejo 30% de pobres","replies":[{"poster":"Tenori Taiga","date":"2019-12-08T23:25:37.452+0000","up_votes":1,"down_votes":0,"body":"Fijate lo que dejo el que se va","replies":[]}]}]}]}]},{"poster":"Uriel Righentini","date":"2019-10-22T03:31:17.358+0000","up_votes":1,"down_votes":0,"body":"soy argentino y te puedo decir que por acá las cosas no van muy bien... riot cobra lo mismo en todos los países el problema es que la moneda de mi país ya no vale lo mismo que antes... me parece bien que cobren supuestamente en dolares ya que es un precio igual para todos, el problema aparece cuando nuestro presidente actual pone un impuesto a los rp\n\nhttps://www.lanacion.com.ar/tecnologia/iva-a-los-servicios-digitales-cuando-habra-que-pagar-el-impuesto-nid2135440","replies":[]},{"poster":"Nishika","date":"2019-09-14T20:25:32.218+0000","up_votes":1,"down_votes":0,"body":"Una lástima que este tan caro. Me gustaría comprarme la ultima de Riven que va a salir, pero como esta difícil la cosa en el país (Arg) entonces opto para ahorrar para la facultad.","replies":[]},{"poster":"707 EXTREME","date":"2019-05-04T18:11:50.337+0000","up_votes":1,"down_votes":0,"body":"Yo dejé de comprar RP desde el año pasado al ver semejante barbaridad. Compraba fielmente TODOS los meses RP y gastaba en cualquier boludes que salía, ahora, con un dolar llegando a 50 ni en pedo te voy a pagar casi 70 dolares por 14.500 RP siendo que una skin promedio sobrepasa los 2000 RP\nSi Riot no tiene pensado bajar los precios y castigar a toda la comunidad de latinoamérica (en especial a Argentina) creo que la mayoría de los usuarios vamos a optar por no consumir más. A lo sumo, cargaré 1 vez al año por una skin en específica pero ya no más.","replies":[]},{"poster":"Fransoi ","date":"2019-04-27T12:23:30.303+0000","up_votes":1,"down_votes":0,"body":"el pais esta mal pa todo esta caro","replies":[]},{"poster":"Rehlein","date":"2019-04-27T06:36:39.691+0000","up_votes":1,"down_votes":0,"body":"compa el precio esta bien,lo que esta mal es el rp que dan,no tiene sentido la bajada drastica de rp\nAl menos si van a aumentar el precio que no bajen la cantidad de rp,yo tranquilamente pagaria $240 por 2,250rp pero te dan 1,450rp eso es lo que esta mal,ahi esta el problema en que el rp que te dan es una miseria,con que vuelvan a dar el mismo rp que daban antes me da igual si tengo que pagar 1600$ por la recarga maxima pero amigo al menos que valga la pena","replies":[]},{"poster":"Deigex","date":"2019-04-05T02:04:37.624+0000","up_votes":1,"down_votes":0,"body":"Riot tomo la medida mas facil para ellos ante el problema de que viniesen de otras regiones a comprar rp aca. Deberian haber aumentado las transferencias y penalizar el ir y volver y no arruinar a toda una comunidad con una economia deplorable. Aunque tengan razon steam lo manejó con mucha mas cabeza que riot. Un juego triple A en steam o una skin? Creo que esta bastante claro.","replies":[]},{"poster":"Nikoratzu","date":"2019-04-04T01:33:02.578+0000","up_votes":1,"down_votes":0,"body":"Es por la moneda","replies":[]},{"poster":"Del0reaN","date":"2019-04-03T21:57:10.164+0000","up_votes":1,"down_votes":0,"body":"Yo no compré más. Creo que mucha gente ha hecho lo mismo (por lo que pude observar). Básicamente, no necesitas comprar RPs para sacar buenas skins. Participando de los eventos podés sacar buenos ítems. De hecho, en la última caja artesanía Hextech que saqué en un evento, me dió la Lux Elementalista.\n\nEs cuestión de ser activo y completar las misiones. Jeje. Por supuesto, cuesta más conseguir las cosas, pero no es imposible. Subiendo de nivel y con Esencias Azules me compré todos los campeones soportes. Ahora voy por los adc (que ya tengo más de la mitad).","replies":[{"poster":"Syntzx","date":"2019-04-04T01:11:12.058+0000","up_votes":1,"down_votes":0,"body":"Me dio súper kennen y Maineo vlad:p","replies":[]}]},{"poster":"Poro Travieso","date":"2019-04-03T18:50:54.740+0000","up_votes":2,"down_votes":4,"body":"exijo la union latino americana para competir contra el dolar y el euro","replies":[{"poster":"ImNw","date":"2019-04-04T00:47:22.573+0000","up_votes":1,"down_votes":0,"body":"Estarias dispuesto a asumir la inflacion venezolana?\nAdemas de la nuestra que dentro de un par de meses vamos a sufrir otra devaluacion","replies":[{"poster":"Syntzx","date":"2019-04-04T01:10:16.681+0000","up_votes":1,"down_votes":0,"body":"Son latinos de todas maneras. La situación tiene que cambiar algún día. Y algo tiene que producir el cambio. Aunque las minorías como nosotros no pueden mover masas, lamentablemente.","replies":[]}]}]},{"poster":"TSW Rorschach","date":"2019-04-04T00:49:22.305+0000","up_votes":1,"down_votes":0,"body":"Antes solía recargar de vez en cuando, porque aguante el derroche. Pero de hace rato tengo ganas de gastar, veo el precio del rp y sinceramente se me pasa.","replies":[{"poster":"Syntzx","date":"2019-04-04T01:09:27.479+0000","up_votes":1,"down_votes":0,"body":"X2","replies":[]}]},{"poster":"Jaime Lannisterr","date":"2019-04-03T22:03:43.750+0000","up_votes":1,"down_votes":0,"body":"El problema es que pasamos de tener la mejor moneda, en bolsas hablando, de toda Latinoamerica a tener la peor seguido de Venezuela. Para que te des una idea, 8000 pesos Argentinos antes equivalían a cerca de mil dolares, ahora 11.000 pesos Argentinos equivale a 300-400 dolares, si no que menos con las últimas bajas del valor monetario. \n\nHaz las cuentas por ti mismo y verás que las cosas no aumentaron porque si, o porque quieran, si no que nuestro Peso se queda atrás y el dolar se mantiene en el mismo nivel.","replies":[]},{"poster":"Rod Flanders","date":"2019-04-03T17:16:21.021+0000","up_votes":1,"down_votes":0,"body":"No creo que el tema pase porque acá el RP es caro, en realidad podríamos decir que el dólar está alto o bien estaba bajo, teniendo en cuenta que ahora es el mismo valor en dólares para los diversos países. O sea, comparando el RP con lo que cuestan juegos (acá o en otros países) en verdad es caro o bien no tiene una coherencia. \n\nPodés ver el episodio de South Park \"Freemium isnt' free\" y la malicia de lanzar skins de champs donde saben que las personas tienen todos los anteriores y por consecuencia quieren tener el que saldrá. El problema es que ahora los hacen prestigiosos (bien notorio para el caso de Ahri). El tema de los pases no solo significa que pagues el valor del skin sino que además estés obligado a jugar para poder juntar las piezas y de no hacerlo, en los últimos días comprarás más RP para poder finalmente tener dicho skin de -edición prestigiosa- que en definitiva tiene mucha gente. \n\nAhora si lo vemos del lado de que con RP comprás un \"derecho de uso limitado [...] de licencia digital\" son claramente caros en cualquier lugar del mundo los Riot Points y la inversión que se realiza para las skins y no así para el funcionamiento y optimización del juego dejan más que en claro que a Riot solo le interesa chuparte la sangre. Yo luego de ver hace 2 meses lo que gasté en RP comencé a jugar mucho menos, de hecho hay días que no tengo partidas y me tiré más por el Hots -que no me divierte por el tema de que no hay items- pero que si querés determinado skin lo podés terminar adquiriendo gratis o bien el uso del dinero real termina rindiendo más. \n\nAcá bueno en LATAM nos afecta más por la economía pero es simple, si había gente que se pasaba de región para comprar RP, que directamente limiten las \"licencias digitales\" a LAS y LAN y que los Riot Points tengan un valor más adecuado y, en todo caso, al cambiarte de servidor (NA o EUW) pagues una diferencia ya sea de 700 RP para poder usar un skin de 1350 RP. Es más mencionaron que otras empresas analizaron el tema y no dieron altos aumentos en lo que es Latinoamérica o países en dónde el PBI per cápita es bajo.","replies":[{"poster":"Poro Travieso","date":"2019-04-03T19:18:02.198+0000","up_votes":1,"down_votes":0,"body":"la mayoria de los paises de latino america estan basados en el dolar mas bien que suba bastante el dolar a pesar de que oriente quiere perjudicarlo rusia china","replies":[]}]}]}