{"poster":"xXSHERMINATORXx","date":"2018-09-18T15:42:57.227+0000","title":"Y te pido por ultima vez cantalo skyshock cantalo GG","subforum":"Esports","up_votes":5,"down_votes":2,"body":"Hola soy de Argentina y cuando miraba las presentaciones de campe&oacute;n por primera vez esa voz del presentador me gustaba mucho, despu&eacute;s hacia algunas gracias en los videos y me gustaba aun mas, entonces me puse a investigar y me choque con skyshock.\r\nSkyshock me hizo conocer los esport de ah&iacute; en adelante segu&iacute; a LAN y a LAS, encontr&eacute; mucha diferencia en los caster, LAS exageraba las expresiones y emociones a un nivel que sent&iacute;a que me quer&iacute;an meter la mano en el bolsillo (no se porque, pero sent&iacute;a eso), LAN con tranquilidad y emoci&oacute;n me inspiraban profesionalismo y diversi&oacute;n aun mas si escuchaba a skyshock.\r\nTuve a skyshock en LAS con las presentaciones de campeones y lo segu&iacute; en LAN con los esport y ahora veo que ya no estar&aacute; mas, grabe error de RIOT a no elegir un buen lugar intermedio para que todo LATAM este conforme, el foro de LAN esta destrozado y yo junto con ellos porque decae la calidad (que siempre fue mala en los mundiales ya que LAS solo le importo &quot;$&quot; y LAN estaba creciendo pero con esto ya no).\r\nBueno espero que skyshock no desaparezca de la presentaci&oacute;n de campeones porque mi paso por el lol y esport se lo debo a &eacute;l.\r\n\r\nPd: ya no juego lol, solo los modos, no juego mas por los troll y flamer, un Juego debe ser divertido y eso no me divierte, pero soy muy fan&aacute;tico de los esport por eso sigo las actualizaciones y todo solo por los esport y me parte el alma no escuchar a skyshock (quiero llorar).\r\n\r\nPd2: Me sacaron a panchasky de actualizando que mas quieres sacarnos RIOT\r\n\r\nSOY LATAM","replies":[{"poster":"Hell Darking","date":"2018-09-18T17:25:46.244+0000","up_votes":1,"down_votes":0,"body":"no as escuchado a los casters coreanos xD","replies":[]},{"poster":"Rakan Wawita","date":"2018-09-18T16:03:56.145+0000","up_votes":1,"down_votes":0,"body":"Si se de la salida de skyshock pero creo que decían por ahí o que el se iba o que lo echaron por los cambios en los worlds (e-sports asi le digo xD)","replies":[]}]}