{"poster":"Hýbris","date":"2018-11-15T19:55:54.799+0000","title":"League of Legends e Twitch Prime","subforum":"Aiuto e supporto","embed":{"description":"Ottieni un frammento aspetto leggendario collegando i tuoi account di League of Legends e Twitch Prime. Non sei un membro di Twitch Prime? Comincia oggi la prova gratuita.","url":"https://euw.leagueoflegends.com/it/featured/twitchprime/connect","image":"https://lolstatic-a.akamaihd.net/frontpage/apps/prod/twitch-drop-link-page-2018/it_IT/651c068bd87c8c4c9822ac241d85d296887590e1/assets/images/og-preview.jpg"},"up_votes":7,"down_votes":2,"body":"Bene inteso che son due giorni che ci provo, ho cercato in giro qualche altra soluzione ma non funziona. Ho letto che bene o male siamo in molti ad avere lo stesso problema - e vorrei capire se Riot voglia aiutarci a riguardo anche! \r\nHo già amazon prime, ho già twitch prime, dunque non dovrebbe essere un problema, mi basta giusto passare allo step 2 (ho già reclamato sull'account di twitch la ricompensa). Lo faccio, e non so come, ma slitta sui server NA (North America), invece che su EUW, portandomi come errore il classico \"**There was an error linking your account. Please try again.**\".\r\n\r\nHo controllato sui vari forum: alcuni parlano di abilitazione dei cookies, sia tramite impostazioni che tramite il lucchetto a lato dell'URL. Non c'è alcun cookie bloccato, però. Ho provato su microsoft edge, su mozilla firefox, su google chrome. Qualcuno di voi è riuscito a sistemare il problema? \r\n\r\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"AlbiDJ","date":"2018-11-27T19:00:20.122+0000","up_votes":1,"down_votes":0,"body":"Ragazzi io ho trovato la mia risposta fatto in un minuto, avevo lo stesso problema, andate su twitch in collegamenti, dove vi chiede il summoner name e la regione , mettete il nome che usate per il Login di League ovvero il NOME UTENTE non il nome di gioco, poi copiate la riga in grassetto , andate sul client nelle impostazioni su verifica incollate la riga della pagina twitch rifate verifica e riprovate a collegare l'account a me ha funzionato! Spero aiuti tutti.","replies":[]},{"poster":"LeBonArMike","date":"2018-11-24T13:07:36.607+0000","up_votes":1,"down_votes":0,"body":"stesso problema, ho già amazon prime, ho già twitch prime, dunque non dovrebbe essere un problema, mi basta giusto passare allo step 2 (ho già reclamato sull'account di twitch la ricompensa). Lo faccio, e non so come, ma slitta sui server NA (North America), invece che su EUW,","replies":[]},{"poster":"g1zmo","date":"2018-11-21T13:23:47.166+0000","up_votes":1,"down_votes":0,"body":"Io ho risolto mandando un ticket attraverso la sezione \"supporto\" e mi hanno aggiunto la capsula della skin manualmente nel mio account di LoL. \nQuello che vi chiederanno di fare è di mandare degli screenshot del vostro account twitch prime (probabilmente per verificare l'autenticità)","replies":[{"poster":"Hýbris","date":"2018-11-21T19:03:40.345+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=g1zmo,realm=EUW,application-id=98NGV4Al,discussion-id=aL4ckIcL,comment-id=0007,timestamp=2018-11-21T13:23:47.166+0000)\n>\n> Io ho risolto mandando un ticket attraverso la sezione &quot;supporto&quot; e mi hanno aggiunto la capsula della skin manualmente nel mio account di LoL. \n> Quello che vi chiederanno di fare è di mandare degli screenshot del vostro account twitch prime (probabilmente per verificare l&#x27;autenticità)\n\n\nCome hai mandato la richiesta?","replies":[{"poster":"g1zmo","date":"2018-11-22T10:37:28.796+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hýbris,realm=EUW,application-id=98NGV4Al,discussion-id=aL4ckIcL,comment-id=00070000,timestamp=2018-11-21T19:03:40.345+0000)\n>\n> Come hai mandato la richiesta?\n\nSono andato nella pagina web dedicata al supporto e contattato direttamente un rioter :\n\nhttps://support.riotgames.com/hc/it/requests/new","replies":[{"poster":"Hýbris","date":"2018-11-22T19:52:21.917+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=g1zmo,realm=EUW,application-id=98NGV4Al,discussion-id=aL4ckIcL,comment-id=000700000000,timestamp=2018-11-22T10:37:28.796+0000)\n>\n> Sono andato nella pagina web dedicata al supporto e contattato direttamente un rioter :\n> \n> https://support.riotgames.com/hc/it/requests/new\n\nConfermo, ho mandato ieri un ticket ed oggi ho la capsula. Grazie per l'aiuto. \n{{sticker:slayer-jinx-catface}}","replies":[]}]}]}]},{"poster":"VanillaBhu","date":"2018-11-20T21:02:37.790+0000","up_votes":1,"down_votes":0,"body":"stesso problema ...aspettiamo!!{{sticker:sg-lulu}}","replies":[]},{"poster":"Cucovazz","date":"2018-11-20T17:49:17.005+0000","up_votes":1,"down_votes":0,"body":"Idem stesso problema... oggi è il mio primo tentativo","replies":[{"poster":"Cucovazz","date":"2018-11-20T18:06:21.803+0000","up_votes":1,"down_votes":0,"body":"Speriamo sia davvero dovuto al blocco temporaneo dei trasferimenti, a questo punto c'è solo da aspettare che riprendano i trasferimenti","replies":[]}]},{"poster":"Marco ProX","date":"2018-11-20T12:19:30.448+0000","up_votes":1,"down_votes":0,"body":"Ho tentato per 3 giorni di fila ma ancora niente. C'è la possibilità di avere supporto?","replies":[]},{"poster":"crono999","date":"2018-11-16T16:58:56.386+0000","up_votes":1,"down_votes":0,"body":"idem ho questo problema spero che la riot risolva questo problema all istante{{summoner:4}}","replies":[]},{"poster":"Hýbris","date":"2018-11-16T09:26:30.318+0000","up_votes":1,"down_votes":0,"body":"A quel che leggo sul mio account twitch: \"**Ottieni una Summoner's Crown Capsule di LoL - League of Legends Contenuti di gioco: 26 ott. – 12 dic.**\"\n\n\nEdit: leggo sul forummone\n\n**DuReXx02 (EUNE) ** -_ about 11 hours ago_\nI have same problem right here \"LINK ACCOUNT\" button redirects you to NA website,i tried to change NA into EUNE in link but it doesn't work,my friend has unlocked this capsule exactly 2 weeks ago,on EUNE,so probably this is some sort of transfer disable that has been announced by Riot in the client,I personally think that problem is because you cant claim any loot and season reward,this will probably last 'till patch 8.23(pre-season patch) so don't worry,this will come with the time,because you are paying for prime accounts!!!\n\n\nQuindi c'è solo da aspettare e riprovare, suppongo.\n\n{{sticker:sg-janna}} ","replies":[]},{"poster":"Selazie","date":"2018-11-16T00:16:39.606+0000","up_votes":1,"down_votes":0,"body":"Ho anch'io lo stesso problema. Speriamo risolvano o che comunque ci diano notizie. Sapete fino a quanto dura la promozione?\n\nAnche perché in palio c'è una skin leggendaria.\n\nSe avete news magari scrivetele.","replies":[]},{"poster":"g1zmo","date":"2018-11-15T21:56:16.240+0000","up_votes":1,"down_votes":0,"body":"ho lo stesso problema anche io. Ho letto che potrebbe essere legato al fatto che hanno bloccato temporaneamente il trasferimento tra i server per la fine season","replies":[]}]}