{"poster":"CHEESYLEEKS","date":"2017-05-05T08:32:12.992+0000","title":"Its easier to kick weed then it is to stop playing lol (for me anyway)","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Im doing a course which requires me to travel to melbourne and stay there mon-fri\n\nI havnt smoked weed in 6 months .... perfectly fine\n\nI havn&#039;t played lol in 4 days... getting constant cravings for a game.\n\nIm addicted.\n\nDoes anyone know a good internet cafe or whatever near south morang or close to? Or even a good one in melbourne and whats the average per hour price?","replies":[{"poster":"SEKAI","date":"2017-05-05T10:46:03.638+0000","up_votes":1,"down_votes":0,"body":"I can't help with the request since I have no contact in and neither am I in Melbourne.\n\nThat said, if you're truly addicted (as in, it's no longer a hobby but something you depend and feed on), it's best to treat and tame it than let it rumble and taking over you tbh, and if the addiction is influenced or instigated by something else, you will also have to come in terms with it too. Addiction is certainly no light matter if that's indeed the case imho.\n\nBut if it's just a metaphor, all good. \n\nStill though, just get a laptop if you haven't one already or something, it's not particularly hard to find and afford one that can run League semi-decently even with the current poor performance of the new client taken into consideration. It's useful outside of gaming too, a computer with you is always nice.\n\nTbh, I personally wouldn't recommend internet cafe, especially the ones that involve personal accounts, for the precise reason of security. Yes, security, the biggest reason. While it's generally not likely that the cafe owner is into _those_ kinds of things, unless you're clearly in the wrong neighbourhoods, but the same can't always be said for the the customers frequenting the place, especially since you won't know if the computers have been tempered with before you. When there is an online account on the line of whatever description, always try to avoid accessing it in public machines and free wifis at all costs. Sure it's not like your home network and your personal machines are invincible, far from it, but at least it's not elevated risks that could be easily avoided.\n\n2 cents.","replies":[{"poster":"CHEESYLEEKS","date":"2017-05-05T10:57:17.261+0000","up_votes":2,"down_votes":0,"body":"Cheers mate.","replies":[]}]},{"poster":"CHEESYLEEKS","date":"2017-05-05T14:47:55.963+0000","up_votes":1,"down_votes":0,"body":"played my first game since the update..... tanks are still the highest damage dealers in the game.... can't say im to addicted anymore.","replies":[{"poster":"SEKAI","date":"2017-05-05T15:08:27.829+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CHEESYLEEKS,realm=OCE,application-id=Ntey9fRZ,discussion-id=5AhvuKik,comment-id=0001,timestamp=2017-05-05T14:47:55.963+0000)\n>\n> played my first game since the update..... tanks are still the highest damage dealers in the game.... can&#x27;t say im to addicted anymore.\n\nCheck the stat sheet of the match. It's rarely the case that they get the highest total damage dealt, and even rarer that they have the highest damage dealt to champs.\n\nIt feels like tanks do too much damage because the complaints are generally from glasscannon players who also build 0 defence no matter the circumstances, so obviously they die very quickly to anything and everything when remotely focused. That and also, some seem to confuse the notion of being tanky with being an actual tank, and proceed to blame the latter for everything even though they are by no means equivalent in the first place.","replies":[]}]}]}