{"poster":"CHEESYLEEKS","date":"2017-01-02T01:40:05.027+0000","title":"building zeal first back on an adc","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"thoughts? what lead to this trend? does this tilt everyone else as much as me?\r\n\r\nI&#039;m having an alarming number of games were adc&#039;s are building zeal first, in which we lose lane in 100% of the games.\r\n\r\nplz adc&#039;s remember - {{item:1038}} forever,{{item:3086}} never","replies":[{"poster":"Klavinmour","date":"2017-01-02T02:14:16.569+0000","up_votes":1,"down_votes":0,"body":"I'd say it's because of the popularity of the second worst item in the game {{item:3085}} . (worst item is {{item:3041}} should have been removed with Sword of the Occult)\n\nIt's a terrible item that doesn't work on most ADCs because they out range the sole reason for buying the damn thing in the first place.\n\nSeriously, why are people buying this piece of shit on Caitlyn? If you're playing Caitlyn you should be taking advantage of her maximum range, if you're doing this, you'll NEVER fire a single bolt from {{item:3085}} at all.","replies":[{"poster":"BarryButcher","date":"2017-01-02T02:54:53.243+0000","up_votes":1,"down_votes":0,"body":"LMAO then explain why literally EVERY pro player builds it on her? Are you saying that every Pro ADC in the world is building wrong.\n\nhttp://www.probuilds.net/champions/details/Caitlyn\n\nit is built in 92% of games played.","replies":[{"poster":"Talon12","date":"2017-01-02T11:55:34.874+0000","up_votes":1,"down_votes":0,"body":"Its in every single build on the initial page","replies":[]},{"poster":"Klavinmour","date":"2017-01-02T06:08:27.452+0000","up_votes":1,"down_votes":0,"body":"I've no idea why the pros build it on Caitlyn.\n\nBut Cait's range is 650.\nRunaan's is 350.\n\nFor Cait 350 is basically melee mode.","replies":[{"poster":"Talon12","date":"2017-01-02T11:49:42.871+0000","up_votes":1,"down_votes":0,"body":"Runaan's \"350\" is the range from the clicked target within the champs aa range (If cait shoots champ A, and champ B is within 650 units of cait and 350 units of champ A, champ B will also be shot) ANd the pros build it on cait because they are smart,, and take advantage of bloody 300% damage bonus every 2nd shot, as her passive will stack every 2 shots and proc on the second or in a bush will proc every attack provided the bolts hit, which give her a massive burst advantage over other adc's especially considering her range.","replies":[]},{"poster":"BarryButcher","date":"2017-01-02T06:26:33.479+0000","up_votes":1,"down_votes":0,"body":"350... of the target hit. not of the user.","replies":[]}]}]},{"poster":"Talon12","date":"2017-01-02T11:47:19.892+0000","up_votes":1,"down_votes":0,"body":"Caitlyn and jinx are legit candidates for the item though, rushing it is stupid yes but the item is still fine on them, the problem is the tristana's and quinns and all that (sure it works on kog but tri still best first on him after revert anyway, and what the hell are the match histories i have seen with people rushing it on jhin, who the actual **** does that), caitlyn gets hurricane because it makes her passive stack after 2 shots or insta stack from bushes and jinx gets it because the rocket splash doubles up ending up with ~40% more damage to grouped targets. The main reason for rushing zeal is when they are forced out of lane before getting enough gold for a BF, although i have no idea why people buy zeal as first item in full when they could have got a bf and zeal components instead of just zeal. seriously, who gets zeal on jhin when can afford a bf and if not a bf the long swords or pick to make into a bf item... zeal and its full items have no effect for him until ~25 min, 30% crit and 13 damage is far outweighed by the 144 ad and 20% crit you get from a bf crit item.","replies":[]},{"poster":"CHEESYLEEKS","date":"2017-01-02T03:20:37.714+0000","up_votes":1,"down_votes":0,"body":"Basically to proc headshot quick as fuck","replies":[]}]},{"poster":"BarryButcher","date":"2017-01-02T01:57:08.923+0000","up_votes":1,"down_votes":0,"body":"Depends what ADC i guess. In majority of cases BF sword first is better.\n\nFew exceptions like Kalista and Vayne who benefit from the attack speed more than most. Argument for it being good on Twitch too.\n\nZeal 1st is fine if you are already winning lane. But say going back and buying {{item:1042}} {{item:1051}} ... i hate that shit","replies":[{"poster":"Anıma","date":"2017-01-02T03:45:28.370+0000","up_votes":1,"down_votes":0,"body":"You go BF every single time (a case can be made for Kalista)\n\nYou would zeal on Vayne because you want the Statikk Shiv/IE build or a variant of it so you would be maxing q and not overly focusing on high attack speed so having the extra damage from BF is mandatory. If you're going the tank buster w max for whatever reason you wouldn't be going zeal, you'd be going BOTRK/Guinsoos or something since that does the job MUCH better than the crit build.\n\nTwitch wants more AD for a stronger contaminate. In most fights the extra attack speed doesnt help you stack much since the W buffs and all too","replies":[]}]},{"poster":"Captain Fortune","date":"2017-01-02T03:05:11.944+0000","up_votes":1,"down_votes":0,"body":"Greetings Cheesyleeks,\n\nI myself am an ADC main and find myself doing this naturally from time to time. As **Klavinmour** noted this is most likely due to the popularity of the Item Runaan's Hurricane. While I do agree with your points that BF sword certainly can be a lot stronger in lane when rushed first over a Zeal, there can be reasoning behind why they would go Zeal first.\n\nFor example sometimes when I am forced to back early before I have the gold to buy a BF sword, often I will pick up the components of a Zeal on characters that I was going to get a Runaan's on anyway. This lets me spend goal into items that I am going to buy later, while giving me a small power spike when going back into lane, as opposed to buying more Doran's Blades or a Cull. \n\n---\n\nI think that another reasoning behind this is Runaan's has a lot of visual power. What I mean by this is when you buy a Runaan's it makes every auto attack shoot out up to three bullets, this gives the feeling of intimidate power for your champion that you bought that you can very easily see the effects of. While in a sense buying a BF sword does give you a lot more damage, Runaan's with its visual effect can often make you feel more power when buying it compared to other items. (Its three auto attacks, per auto attack.)\n\n---\n\nHowever you do have a good point though of BF sword being a stronger item over Zeal component wise on most champions. This can make your laning phase a lot weaker in a sense, but it also helps you hit your power spike of that Runaan's of champions such as Jinx that much sooner. A Jinx that gets resets early on in the game with a Runaan's can be a truly scary sight to see. Plus it works quite well with the Rocket Form of her Q making her AOE reach even further and letting her pick up resets even easier. Has some good wave clear advantages as well.\n\n---\n\nWhat are your thoughts on Visual power vs Flat out damage in this game, have you seen this effect what items you buy yourself? Another example would be Hydra with its auto attack passive, that item feels amazing to use. Let me know what you think because I am curious what your thoughts are!\n\nGood luck in your games and if there are any other questions I can answer let me know!\n\n~Elam","replies":[]}]}