{"poster":"CHEESYLEEKS","date":"2017-03-03T11:52:57.512+0000","title":"The reason autofill sucks.","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":0,"body":"auto fill is not the problem. ITS THE PLAYERS WHO GET AUTO FILLED BEING FUCKING BABIES THAT IS THE ROOT OF THE PROBLEM.\n\n&quot;omg support is not fun, i can&#039;t play {{champion:55}} {{champion:92}} {{champion:157}}  etc and carry da game herpa derp&quot;\n\n\"i can only play x champion, i dont play anyone else dearp\"\n\nplayer gets auto filled the following thing happens in the majority of cases.\n\nthey hold champ select at ransom, if they do get the role they want through intimidation they usually end up trolling anyway because of the pregame chat becomes salty as fuck and usually continues into the game, if they don&#039;t get the role they want they usually end up feeding and trolling\n\nauto fill doesn&#039;t work because this player base is immature garbage and would rather just be a total ass hat than actually have a go, i would rather wait the extra time then deal with a fuckhead 7/10 times.\n\n/end vent.","replies":[{"poster":"Fitzky","date":"2017-03-04T01:34:03.157+0000","up_votes":3,"down_votes":0,"body":"Just like some people enjoy only playing one champion, some people only enjoy playing 1 or 2 roles. That's how some people are, just like in an MMO you'll always have the players who like to play DPS or Tank or Healers, and will stick with that for the entirety of the time they play the game. Forcing someone who likes to play DPS carries into a support role isn't healthy, and is why people are having these fits of rage, especially in League which holds one of the most toxic communities. If you're gonna force people to play every role at least stick it with the high elo players that are actually very good at the game and not bronze players who can barely carry games to some degree. Being good at 1 or 2 roles is hard enough, but for bronze and silver being good at all 5 roles is challenging and much different for diamond+ players.","replies":[{"poster":"oPuredo","date":"2017-03-04T06:59:58.269+0000","up_votes":1,"down_votes":0,"body":"It's not just about liking a champion/role. It's about what can actually be played.\nAlso, an AP main being forced to ADC at challenger is much harder than in bronze.","replies":[{"poster":"Fitzky","date":"2017-03-04T10:23:33.840+0000","up_votes":1,"down_votes":0,"body":"I've seen plenty of high elo streamers being autofilled and carrying games easy, and you expect a bronze player who can just barely play their main role to a good degree to just pick up a role they hardly play and be good at it?","replies":[]}]}]},{"poster":"Roguestoney","date":"2017-03-03T19:57:53.055+0000","up_votes":1,"down_votes":0,"body":"Preach it.","replies":[]}]}