{"poster":"CHEESYLEEKS","date":"2016-07-21T23:59:44.292+0000","title":"first lvl 7 champ!","subforum":"Miscellaneous","up_votes":5,"down_votes":0,"body":"http://i1190.photobucket.com/albums/z459/Tom_Smoodger/yozzamozza_zpsiin8py6y.jpg\r\n\r\nhttp://static.comicvine.com/uploads/original/11120/111207453/4317398-8405442708-art-%25.png\r\n\r\nurgots next kek","replies":[{"poster":"freebase","date":"2016-07-22T04:01:35.379+0000","up_votes":1,"down_votes":0,"body":"jus wandering why u lvl7 yoric? of all champs. i rarely see him at all.","replies":[{"poster":"BarryButcher","date":"2016-07-22T06:18:53.517+0000","up_votes":1,"down_votes":0,"body":"because its a hell of a lot easier to get S and higher on \"unpopular\" champions LOL","replies":[{"poster":"Nightjar","date":"2016-07-28T08:29:10.553+0000","up_votes":1,"down_votes":0,"body":"not all the unpopular champs. You play zilean support (one of the lowest play rates for a support champion and not a great winrate either) and you will get threats to go sona, blitz or thresh or your team will report you. But even then if you go 7/2/35 you still only get an S-. The thing is, you play unpopular champs and usually the people playing them are bad but sometimes you have some champions that have a devoted following of psychopaths with amazing kdas and kill contribution and you can't compete. Took me ages in normal que to get lvl7 Zilean.","replies":[]},{"poster":"CHEESYLEEKS","date":"2016-07-22T06:33:57.695+0000","up_votes":1,"down_votes":0,"body":"Even easier when you play them support","replies":[]}]},{"poster":"CHEESYLEEKS","date":"2016-07-22T05:08:40.812+0000","up_votes":1,"down_votes":0,"body":"i enjoy playing him","replies":[{"poster":"freebase","date":"2016-07-22T06:38:59.480+0000","up_votes":1,"down_votes":0,"body":"what are u serious. S grade hacks wow ty","replies":[{"poster":"CHEESYLEEKS","date":"2016-07-22T07:07:17.820+0000","up_votes":1,"down_votes":0,"body":"i legit enjoy playing yorick support.","replies":[]}]}]}]},{"poster":"DipperOCE","date":"2016-07-22T00:16:32.454+0000","up_votes":1,"down_votes":0,"body":"Actually do Urgot though as I discovered he is a beast mid laner right now. Just skip Manamune and you have an easy game.","replies":[{"poster":"CHEESYLEEKS","date":"2016-07-22T00:23:55.568+0000","up_votes":1,"down_votes":0,"body":"i play him adc,support,top and mid and have racked up 134k mastery points, just need 2 more tokens and ill be lvl 7, so two good support games kek\n\nI usually just charge a tear then build manamune 3rd or fourth\n\n","replies":[{"poster":"DipperOCE","date":"2016-07-22T07:39:50.858+0000","up_votes":1,"down_votes":0,"body":"The problem with Manamune is even if you get a tear you are investing gold which would be better invested in damage. Auto attacks are a noticeable part of Urgot's damage, but not enough to buy an item with the soul purpose of increasing their damage. \n\nIf you need mana you would be better off building a glacial shroud into a Frozen Heart. Manamune is overall a bad item right now in my opinion, and has a little value on champs like Ezreal and Urgot but mostly it's pretty garbage.","replies":[{"poster":"JasonWazza","date":"2016-07-23T15:11:32.123+0000","up_votes":1,"down_votes":0,"body":">Auto attacks are a noticeable part of Urgot's damage\n\n(It's not just AA's, it's Single target damage, which includes his Q)\n\n>The problem with Manamune is even if you get a tear you are investing gold which would be better invested in damage.\n\nHonestly 2 long swords is not something i would call worth more then Tear on Urgot.","replies":[]},{"poster":"CHEESYLEEKS","date":"2016-07-22T08:00:28.253+0000","up_votes":1,"down_votes":0,"body":"I use it with no problems and scales well into the mid to late if you dont build manamune first or second rather build it fourth when muramana isnt far off\n\nPop ult,pop ghostblade,spam q,proc triforce and watch as your opponents hp literally melts away in a second or less","replies":[]}]}]}]},{"poster":"SKT T1 Taehoon","date":"2016-07-23T07:06:45.198+0000","up_votes":1,"down_votes":0,"body":"your so lucky bro i kjust went 29/7/11 ranked jinx as a current lvl 6 jinx and this was ranked and i didnt even get a single fucking token 23 miute game 213 cs WTF RIOT FIXX THIS SHIT","replies":[]},{"poster":"BurningAvalanche","date":"2016-07-22T07:10:28.159+0000","up_votes":1,"down_votes":0,"body":"LOL. Good job on finding the courage to play urgot enough times to get level 7 knowing at your teamates will flame and rage at you for just being who you are :/. I love this community.","replies":[{"poster":"CHEESYLEEKS","date":"2016-07-22T07:16:51.034+0000","up_votes":1,"down_votes":0,"body":"1 more token to go.\n\nurgot is love, urgot is life {{champion:6}}","replies":[]}]}]}