{"poster":"ColdPriest","date":"2017-01-25T22:05:00.886+0000","title":"Ranked Team sucht Spieler (Gold/Silber)","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Wir m&ouml;chten mit einem neuen Ranked Team starten, dazu suchen wir noch Top, Jungle und Adc.\r\nIhr solltet euch im High Silver/ Low Gold elo in der Flex Queue befinden.\r\nDas Ranked Team sollte auf Erfolg aus sein, d.h. wir m&ouml;chten nicht nur aus Spa&szlig; spielen, sondern uns auch verbessern und aufsteigen bzw Turniere spielen.\r\n\r\nVoraussetzungen:\r\nAlter: 18+\r\nkritikf&auml;hig\r\nTS\r\ngro&szlig;er Championpool\r\nflexible Zeiten\r\n\r\nBei weiteren Fragen added mich einfach.\r\n\r\nLG\r\nColdPriest","replies":[{"poster":"NGC Polyxena","date":"2017-01-26T07:29:22.077+0000","up_votes":1,"down_votes":0,"body":"Guten Morgen ColdPriest,\n\nsolltet ihr noch auf der Suche nach passenden Kameraden für euer Ranked Team sein würde ich euch gerne anbieten diese Lücken innerhalb unserer ü18 Community \"**Nerds Go Casual**\" zu füllen. Ausgestattet mit einem aktiven Forum & TS, sowie einer eigenen \"Datenbank\" für Team Suchende bieten wir eine gute Grundlage um den Aufbau von Teams zu unterstützen.\n\nWir bestehen seit April 2016 und haben unser Hauptaugenmerk auf den Casual Spieler gelegt. Nichts desto trotz sind wir bereit Spieler / Teams bei Bedarf entsprechend zu unterstützen. Es sollte euch jedoch bewusst sein, dass ihr als Teil einer Community euch auch in diese einbringen solltet. Heißt Grüppchenbildung ist nicht gern gesehen, wir haben noch viele andere freundliche Spieler/innen im LoL Bereich, die sich über Mitspieler in Normals, Rankeds und Arams freuen ;) .\n\nZu guter Letzt lasse ich euch Mal unsere Vorstellung da und ihr könnt euch überlegen ob ihr nicht auch Lust hättet Teil einer aufstrebenden Zocker-Gemeinschaft zu werden: [♣ ƝЄƦƊƧ ƓƠ ƇƛƧƲƛԼ ♣ Ü18 multigaming Community lädt zum Zocken ein ♣](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/eERAnrLZ-oe-i-a-l-oe-a18-multigaming-community-laadt-zum-zocken-ein-oe)\n\nLiebe Grüße,\nP0lyxena | Julia _(das O = Null)_","replies":[]}]}