{"poster":"Wickedlike","date":"2019-08-27T04:29:01.266+0000","title":"Best start yet?","subforum":"Teamfight Tactics","up_votes":2,"down_votes":1,"body":"https://imgur.com/CJG2Ohu\n\nSo basicly get a level 3 Veigar with 3 seraph's embrace so he can ult after just 1 auto or taking some damage.\n\nThen you need 6 Brawlers, 6 Nobiles or 6 Knights.\nThen guardians(2). And thats all.\nCan be done on level 8 if you have a bad game hitting level 9 isnt that important.","replies":[{"poster":"BladeSteel","date":"2019-08-27T05:22:21.653+0000","up_votes":4,"down_votes":1,"body":"Talks about \"best start yet\"\nShows end of game.\nokay?","replies":[{"poster":"Wickedlike","date":"2019-08-27T07:07:19.576+0000","up_votes":1,"down_votes":1,"body":"You think i lost this? Vaygar oneshots everyone and has wall of brawlers + braum for voli glacial.\nYou know vaygar oneshots everyone who's lower level then himself, right?\n\nAs a start this one is good but its hard to get 3 seraph's embrace on a level 3 Veygar consistantly and thats when the start starts working.\nVeygar will spamm ults that one shot. But its pointless if his not level 3 so use a different sorc/demon who needs 75 mana to ult until veygar is level 3. This game i had Atroxx 2 with a random demon until i got Veygar to 3.\n\nYou start looking/rolling for Veygars at level 7(33%) and 8(35% max chance to get a rank 3 unit) untill then hold on to 50 gold for income.\nOn the item picking stages take only tears.\n\nVaygar legit only does 1 auto and an ult that oneshots.","replies":[{"poster":"Illabethe","date":"2019-08-27T13:53:14.333+0000","up_votes":1,"down_votes":1,"body":"He's talking about fact this is a Start of GAME thread. We don't know what you're referring to starting.\n\nP.S. Nobles stomp this comp, especially with a Braum with Thornmail.","replies":[]}]}]},{"poster":"Porglit","date":"2019-08-27T16:21:50.279+0000","up_votes":1,"down_votes":0,"body":"Do you mean \"strat\"?","replies":[{"poster":"Wickedlike","date":"2019-08-27T20:11:20.993+0000","up_votes":1,"down_votes":0,"body":"Ah yeah i did indeed mean that.","replies":[]}]}]}