{"poster":"Obscuration","date":"2015-11-26T20:28:57.108+0000","title":"Plans for Ezreal?","subforum":"Gameplay","up_votes":16,"down_votes":2,"body":"Any buffs for Ezreal? Ezreal is my favorate champion and for a while he has been left in the dust to stronger adcs/mid laners","replies":[{"poster":"RiotRepertoir","date":"2015-11-27T06:44:51.150+0000","up_votes":10,"down_votes":0,"body":"Ezreal feels like he fell a bit short of what we expected to see from him in the 5.22 preseason patch. We should look over him along with some others like Ashe, Sivir, and Twitch before the preseason ends. For him specifically, we nerfed some stuff to make room for the improved Q cooldown reducing effect as a precautionary measure, but it may not have been necessary.","replies":[{"poster":"Auryiel","date":"2015-11-27T06:53:40.696+0000","up_votes":7,"down_votes":1,"body":"I'm not sure what you expected would happen when you removed his ability to sustain his mana from Q range if he built essence reaver (which clearly was supposed to be a must buy on him), nerfed his CDs and put stats he doesn't care about that much into Triforce while also buffing the living shit out of many of other AD carries\n\nAlso please, for the love of god, give him a spellblade effect, a magic damage on-hit effect with a small AP ratio (3%-5%?) on his AAs that increases with how many stacks of his passive he has (it would be at 0% with no stacks, of course). Small but meaningful buff for AP Ezreal, who would now have a real reason to care about his passive and have a DECENT way to clear minion waves without actually getting waveclear, and a completely unnoticed buff for AD Ezreal ESPECIALLY with the removal of AP from Triforce.","replies":[{"poster":"RiotRepertoir","date":"2015-11-27T07:07:09.941+0000","up_votes":6,"down_votes":3,"body":"We expected him to be fine, and he's honestly not super far off. He tends to sit at a lower-than-average win rate when considered balanced by us and most players.\n\nop.gg has him at a 48.5% win rate over the last week in Korea, where he has always been and continues to be a very popular pick, so that seems like decent evidence that he's not _horribly_ far off. I don't think he requires much more than a slight adjustment, really.","replies":[{"poster":"Martyrofsand","date":"2015-11-27T08:31:59.168+0000","up_votes":9,"down_votes":7,"body":"So I guess that whole \"winrates are not a sign of balance\" goes out the window whenever it suits you guys doesn't it?","replies":[{"poster":"Evelyn Endwise","date":"2015-11-27T10:46:20.013+0000","up_votes":11,"down_votes":0,"body":"***","replies":[{"poster":"RiotRepertoir","date":"2015-11-27T21:18:01.785+0000","up_votes":6,"down_votes":0,"body":"Basically this. It's pretty easy to have a conversation that starts at win rate and leads somewhere else, since win rate is likely the most obvious _baseline_ indicator of power.","replies":[{"poster":"Sneakyy XD","date":"2015-11-27T21:42:46.630+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=ZFv81t4f,comment-id=000100000000000300010000,timestamp=2015-11-27T21:18:01.785+0000)\n>\n> win rate is likely the most obvious _baseline_ indicator of power.\n\nPlease tell me the people in charge of balance don't actually believe this.","replies":[{"poster":"qetzel","date":"2015-11-27T22:48:24.133+0000","up_votes":6,"down_votes":0,"body":"The most obvious. Baseline.\n\nNot the only.","replies":[]}]}]}]},{"poster":"Solidair3","date":"2015-11-27T14:32:02.513+0000","up_votes":3,"down_votes":0,"body":"Win rates when compared to pick rates. If Ezreal has a high pick rate (which he does in KR) and an average win rate (which, again, he does. Maybe just a little low), then that's a good sign.","replies":[]},{"poster":"qetzel","date":"2015-11-27T09:25:41.705+0000","up_votes":3,"down_votes":1,"body":"Win rates are a sign of balance. They are a useful tool to gauge champion power. Riot have always said this.\nThey are not the be all and end all though. Riot don't just look at win rate (or Ez would be considered balanced only with a win rate of exactly 50%).","replies":[]},{"poster":"Silents429","date":"2015-11-29T04:44:47.065+0000","up_votes":1,"down_votes":0,"body":"He isn't using it for balance.","replies":[]}]},{"poster":"Photos of Ghosts","date":"2015-11-27T12:07:40.426+0000","up_votes":1,"down_votes":0,"body":"Can he please have some utility back into his W someday? Because a plain base damage spell is sad.","replies":[{"poster":"RiotRepertoir","date":"2015-11-27T21:22:10.950+0000","up_votes":4,"down_votes":0,"body":"It is sad, and we're not happy with it either. If we had the right low-cost approach (resources seem to mostly be allocated things at the moment), there may be something we could do. Of course there are things we _could_ do, but it's more a matter of finding a good long-lasting approach.","replies":[{"poster":"Rager Dave","date":"2015-11-28T17:29:28.959+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=ZFv81t4f,comment-id=00010000000000040000,timestamp=2015-11-27T21:22:10.950+0000)\n>\n> It is sad, and we're not happy with it either. If we had the right low-cost approach (resources seem to mostly be allocated things at the moment), there may be something we could do. Of course there are things we _could_ do, but it's more a matter of finding a good long-lasting approach.\n\nHere is what I know about Ez. His w and passive are pretty bad for ad, while for ap the passive is absolutely useless. Back when w slowed as it was a solid ability as it added options for ad and allowed ezreal to use his passive in trades when enemy ad's would try to all in him. Nowadays without the as slow the w and his passive are just...meh. So I can attack more as an AD CASTER, big whoop. It isn't like I'm corki where my Aas are hybridized in terms of output, so the faster attack speed doesn't matter because I'm suppose to be camping on the edge of fights slinging abilities to help my team instead of trying to auto attack. The solution to this dilemma is adding new complexity to the passive and adding more power into his w. \n\nTo be quite honest the best way to strengthen the passive is to give it something else besides As. What I was thinking is that at 5 stacks ezreal next ability or attack causes an arcane explosion that does scaling damage with bonus ad or ap, whichever is higher. This would help with wave clear and help ezreal's abysmal dueling. The stacks would reset after this.\n\nW is harder to balance. One part of me wants to keep the as steroid. But it is absolutely worthless as for the first part of the game the only champ getting it would be a support and/or jungle. It's why I think it would be better used for ezreal's theme. He is the prodigal explorer yet has no real exploration tools. Lengthen the range, add an ad ratio, and make it reveal things in a straight line. Remove the as steroid. And there you go. W is fixed, provides actual utility, and gives Ez some more security as in the current meta having a long cd blink that costs a lot of mana is not enough.\n\n Anyway that's my ideas. My other one was changing e to not just be a random shot but an Aa enhancer like vayne's tumble except it provides magic damage on next auto or q.","replies":[{"poster":"Thryale","date":"2015-11-30T07:26:54.185+0000","up_votes":1,"down_votes":0,"body":"well, as far as the atk spd boost on ez's w... that's a relic from when his w actually had a thematic to it. Basically, when ez was released, his w boosted atk spd of allies and slowed the atk spd of enemies **as well as** dmg'ing enemies and **healing** allies.\n\nbasically, it was a 'kiss curse' thematic. do 1 thing to the enemy, and do the reverse to allies. But over the course of the years, ez's w has been stripped of what made it cool in the name of \"balance\" and thus we are left with the sad sad spell you see today.\n\nOn a ***completely*** unrelated note... OMG!! I did not know we had these!!! {{sticker:slayer-jinx-catface}}  these are so awesome!!!","replies":[]}]},{"poster":"EROTIC RAID BOSS","date":"2015-11-27T21:40:20.813+0000","up_votes":2,"down_votes":0,"body":"What do you guys intend for his strengths and weaknesses to be exactly? \n\nDo you have any directions you're looking at pushing him?\n\nHonestly while I think his current w should be changed into something else probably utility focused I don't have any real suggestions. I think it would be nice to see that clear niche for him the way other adcs have ","replies":[]},{"poster":"Thryale","date":"2015-11-30T07:21:06.909+0000","up_votes":1,"down_votes":0,"body":"can we just make ez a mage? like pretty plz? I don't really understand why ez is an adc to begin with, other than his passive giving him atk spd. Everything else about his kit screams \"mobile eluse poke mage or burst assassin\" But for years everyone's been trying to force ez as some adc ad caster mash up that just leaves him very unrewarding and lack luster.\n\nI'd honestly much rather see more focus be put into mid lane ezreal than the janky duo bot lane ez we see now.\n\nWhat are your thoughts on that? and could you tell me your opinion at least, on the focus of ad ez over ap ez.","replies":[]},{"poster":"JChaosMaster","date":"2015-11-28T18:04:38.035+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=ZFv81t4f,comment-id=00010000000000040000,timestamp=2015-11-27T21:22:10.950+0000)\n>\n> It is sad, and we're not happy with it either. If we had the right low-cost approach (resources seem to mostly be allocated things at the moment), there may be something we could do. Of course there are things we _could_ do, but it's more a matter of finding a good long-lasting approach.\n\nPart of it is also the tank support advantage.  With high power tanky support its hard for ezreal to apply pressure.  In fact unless feed ezreal cant really apply pressure at all. Any decent bottom lainers know as adc he will almost never W you so you don't have to worry. He will likely save his e so run. And his best skill you just have to stand behind a minion and your safe. \n\nBuff ideas take out the decay off the ult so he could shred a team in a team fight. Ash and jinx both have globals and scale with distance his wont.\n\nOr let q proc sheen effect. Its nuts I have to blow a w or e before I can empower my next basic.","replies":[]}]}]},{"poster":"The Yetii Rider","date":"2015-11-27T15:46:00.656+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=ZFv81t4f,comment-id=000100000000,timestamp=2015-11-27T07:07:09.941+0000)\n>\n> We expected him to be fine, and he's honestly not super far off. He tends to sit at a lower-than-average win rate when considered balanced by us and most players.\n> \n> op.gg has him at a 48.5% win rate over the last week in Korea, where he has always been and continues to be a very popular pick, so that seems like decent evidence that he's not _horribly_ far off. I don't think he requires much more than a slight adjustment, really.\n\nPower-wise, Ezreal is indeed better than before, and we thank you for that. \n\nI don't have a lot of recent Ez games but I played Ez pretty much exclusively from when I was level 20 to when I hit level 30, back in Season 2 when he was pretty strong. \n\nMy problem with Ezreal's current kit is just the satisfaction, not the power. Ezreal just feels...meh. The change to his E is...okay? I guess? It gives him stronger chasing power but with his ultimate Ezreal rarely needs to chase to kill someone. Maybe Ezreal is in a decent spot power wise but his W definitely needs SOMETHING so that his kit overall feels more satisfying to play.\n\nThe champion is supposed to be a caster who is more centered around his abilities than his autos. If that's the case, it shouldn't feel like he only has 3 abilities to work with.","replies":[]},{"poster":"Gentzer","date":"2015-11-28T16:07:06.582+0000","up_votes":1,"down_votes":0,"body":"Might I ask what these possible Twitch changes are?","replies":[]},{"poster":"Siyther","date":"2015-11-28T15:28:17.049+0000","up_votes":1,"down_votes":0,"body":"no he isnt far off but the cd changes make him feel kinda clunky at best. With the new items i like him better but every thing really feels slow with him these days. If u just could revert the cd changes i think it would be fine","replies":[]},{"poster":"HigeR","date":"2015-11-27T19:28:08.068+0000","up_votes":1,"down_votes":0,"body":"I think he's fine too... to be honest at the beginning of the preseason I tumbled a lot with him, I even tried the thunderlord's mastery on him >.< tried a lot of items as well and now I think I've found the best options to play as Ezreal and my skills with him have balanced out once again.\n\nHe's not the strongest adc whatsoever but if you're looking for the kiting adc, you're probably looking for ezreal.","replies":[]}]}]},{"poster":"Kei143","date":"2015-11-27T15:41:01.494+0000","up_votes":4,"down_votes":0,"body":"Oh Oh oh !!\n\nCan I take a poke at Ashe since you mentioned her?\n\nI understand people like to use the Q flurry and it feels good after 5 stacks, I previously used it as an \"OMG I NEED TO KITE THIS GAREN, NOOOOAAA\" tool. Where I can increase my Atkspd & slow to keep him at bay. Can't Do that anymore !! unless I score a lucky crit. But I still get no Atkspd boost to help me kite more :(\n\nRevert it? or maybe you have something else planned?","replies":[{"poster":"RiotRepertoir","date":"2015-11-27T21:20:50.346+0000","up_votes":4,"down_votes":0,"body":"The change to make her W always crit was supposed to help address this. It's possible her baseline slow is just too weak.","replies":[]}]},{"poster":"Sire Hippington","date":"2015-11-27T17:23:28.268+0000","up_votes":3,"down_votes":0,"body":"Just how did you expect him not to fall short?!?\n\nI mean he was always one of the least crit-useing adc in the game, and you basically gutted itemisation for every ad that doesn't want crit...\nless arpen across the board, less ad overall, ER now needs crit items and doesn't give mana back on his Qs...every single itemchange that patch was a slap into ezreals face(and that of every other ad-caster)\n\nand give back the arcane blade masterie, AP Ez and many others really miss that great masterie","replies":[]},{"poster":"Earl Eulrich","date":"2015-11-27T13:57:26.964+0000","up_votes":2,"down_votes":0,"body":"maybe take a look here: http://boards.na.leagueoflegends.com/en/c/gameplay-balance/j1dEhWyL-detailed-preseason-feedback-part-2-marksmen\nthat sums up basically all the problems currently.","replies":[]},{"poster":"SwiftSwrd","date":"2015-12-02T03:08:52.103+0000","up_votes":1,"down_votes":0,"body":"Are you going to take AP Ezreal into account when assessing his current state? Does your data show any significant changes in AP Ezreal with the preseason changes?","replies":[]},{"poster":"Innovac","date":"2015-11-28T22:28:37.382+0000","up_votes":1,"down_votes":0,"body":"Am I to understand that you are fine with where Kog´maw is, since you excluded him? Because as a player I am very unhappy with where he is at right now. It might just be me but I would like to have your honest opinion on the matter. Whether or not you agree with me or disagree completely I´d like to just talk it out, it would not be unreasonable to think I am in the wrong here.","replies":[]},{"poster":"Obscuration","date":"2015-11-27T17:56:09.391+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=ZFv81t4f,comment-id=0001,timestamp=2015-11-27T06:44:51.150+0000)\n>\n> Ezreal feels like he fell a bit short of what we expected to see from him in the 5.22 preseason patch. We should look over him along with some others like Ashe, Sivir, and Twitch before the preseason ends. For him specifically, we nerfed some stuff to make room for the improved Q cooldown reducing effect as a precautionary measure, but it may not have been necessary.\n\nsuggestion: q ignores % armor like 15-30% ?","replies":[]},{"poster":"Lucifer","date":"2015-11-27T14:23:22.224+0000","up_votes":1,"down_votes":0,"body":"When you update him, is there any chance you can add something interactive back to his W? I miss the attack speed slow. I remember wayyyyyyyyyyy back when it had a heal too, lol.","replies":[]}]},{"poster":"LadyRenly","date":"2015-11-27T17:29:21.382+0000","up_votes":5,"down_votes":0,"body":"I really hope they don't pigeonhole him as an AD botlaner, honestly I have a lot more fun playing him as a mage.","replies":[]},{"poster":"Wînter Fox","date":"2015-11-27T15:31:18.862+0000","up_votes":5,"down_votes":0,"body":"As far as I'm concerned they ruined Ezreal with the {{item:3025}} change. Blue Ez is the only Ez","replies":[]},{"poster":"Tenryushin","date":"2015-11-27T13:27:49.935+0000","up_votes":5,"down_votes":0,"body":"Maybe a allow his Q to crit?","replies":[{"poster":"KONO RUBICK DA","date":"2015-11-27T15:47:41.851+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rikishin717,realm=NA,application-id=3ErqAdtq,discussion-id=ZFv81t4f,comment-id=0006,timestamp=2015-11-27T13:27:49.935+0000)\n>\n> Maybe a allow his Q to crit?\n\nmaybe make his W usefull?","replies":[{"poster":"Nozomi Tojo","date":"2015-11-28T00:30:49.864+0000","up_votes":1,"down_votes":0,"body":"The old Ezreal has his W useful for your bot duo partner sustain.\nW Heals you (and Ult?) with AP scaling also damages. \nI bet AP Ezreal mains want those things.","replies":[]}]},{"poster":"Kouga","date":"2015-11-27T14:34:37.697+0000","up_votes":1,"down_votes":0,"body":"Fastest way to break him, unfortunately.","replies":[]}]},{"poster":"Zero Shingetsu","date":"2015-11-26T20:34:55.175+0000","up_votes":3,"down_votes":1,"body":"I feel like he needs a rework tbh. (Which wouldn't bode well for you if he's your favorite champ, admittedly...) He never felt like an ADC to me. More like an assassin. I'd like to see him rely more on autos and movement.","replies":[]},{"poster":"Dominick Destine","date":"2015-11-27T21:45:39.737+0000","up_votes":2,"down_votes":1,"body":"Ezreal is doing fine with Essence Reaver and Trinity (40%).\n\nProbably a buff to his W and he will be exactly where he needs to be. Maybe have it apply the ASPD slow by 1/2rd of its power against enemy champions for half duration... OR, and get ready for this, let it damage minions?\n\nJust a suggestion.","replies":[]},{"poster":"Rico Nasty","date":"2015-12-15T02:34:16.811+0000","up_votes":1,"down_votes":0,"body":"Could we buff ADC Ezreal but leave his AP ratios untouched please? Seriously, AP Ezreal is fucking terrible to lane against","replies":[]},{"poster":"Bryvx","date":"2015-11-30T08:30:29.027+0000","up_votes":1,"down_votes":0,"body":"Things I really want to note as an ezreal main:\n\n1. Leveling his W at all never feels satisfying or worth it when building AD, in lane the damage is negligent unless you max it and the mana cost is never worth the damage output at level 1 (it would be a different story if W had some kind of mana refund feature, but it doesnt). There is also very little utility on the W as I would have liked. Most of the time, I don't can't even tell the difference when I am using my W to give an ally an attack speed boost (this is different from nunu/warwick which has that obvious red glow). Similar to how sona used to be before her rework last year, the boosts your abilities are supposed to give feel \"invisible\". \n\n2. As an AD, his damage output is easily \"turned off\" simply by standing in front of him. Some champions, such as tristana, corki, twitch can simply jump or sneak past the front line and 1-2 shot the carries, but ezreal's damage source is generally stacked on his abilities and making his most damaging ability blockable just makes him less attractive as a reliable marksman.\n\n3. mana is such an important stat, yet tear takes too long to stack up in the current preaseason where games snowball heavily and on-demand waveclear is almost mandatory so its almost always better to pick an ADC that can waveclear without needing to spend mana (guinsoo's rageblade alleviates this problem, but if ezreal is only as good as the items that are available then the item is too strong while the champion is too reliant on it. Nerfing guinsoos for example is a hard hit to ezreal at the moment). \n\n4. As an AP, he has a horrible laning phase and offers little to no CC in skirmishes, has a hard time securing kills during jungle ganks unless the jungler has cc in their kit, and takes a very long time to scale. Why would I play AP ezreal when I could play a different AP mage with similar mobility and more utility / better skirmish/teamfight  potential during this meta? {{champion:103}} {{champion:7}}","replies":[]},{"poster":"JChaosMaster","date":"2015-11-28T18:52:14.468+0000","up_votes":1,"down_votes":0,"body":"More ideas. Again maybe let his e poloriz the closest champ. So he can punish bad gankers with his double blink.\n\nSecondly decrease the ad scaling on his e but allow how his e to crit. So building crit is more meaningful. \n\nThird would be increase the duration of his passive again. With the increase crit power items its even harder to keep it past 2 stacks unless you ult.","replies":[]},{"poster":"Dinko","date":"2015-11-27T22:23:33.981+0000","up_votes":1,"down_votes":0,"body":"Since we are discussing Ezreal, can I ask for a quick clarification on his Q; it counts as an auto attack since it procs on hit effects (such as BORK) and does not proc magic effects (such as Deathfire Touch) - if this is the case, why does Sivir's Spell Shield absorb Ezreal's Q as if it were an ability, when clearly it's not.\n\nDescriptions from Riot's website\n\nSpell Shield:\n\nCreates a magical barrier that blocks a single enemy ABILITY cast on Sivir. [...]\n\nDeathfire Touch:\n\nYour damaging ABILITIES cause enemy champions to take magic damage equal to [...]\n\nAt the very least there's a clarity issue, since Riot's own in-game interaction with Spell Shield would define Ezreal's Q as an ability. Since it deals damage, it is indeed a Damaging Ability. If it's a Damaging Ability, then it should proc Deathfire Touch.","replies":[{"poster":"Nozomi Tojo","date":"2015-11-28T00:28:05.904+0000","up_votes":1,"down_votes":0,"body":"About the Sivir. Every ability you shoot/cast on her will deny its effects.\n[Link](http://leagueoflegends.wikia.com/wiki/Spell_shield)\nI believe it shields GP's Q too.  DFT is some what unconfirmed \nthe spell damage of your Q applies it i guess?","replies":[{"poster":"Dinko","date":"2015-11-28T03:48:48.437+0000","up_votes":1,"down_votes":0,"body":"No, Q does not apply DFT. It's a spell effect, not on-hit.","replies":[]}]}]},{"poster":"SlashStriker","date":"2015-11-27T23:48:47.792+0000","up_votes":1,"down_votes":0,"body":"Idea - replace ezreal W with Charge Shot similar to Megaman Plasma Charge\n\nfor instance\ncast 1: Ezreal charges his... Mystic bow (I guess) during which he cannot attack or cast spells\ncast 2: Ezreal releases powerful charge shot which upon 1st enemy collision creates AoE Explosion","replies":[]},{"poster":"Blade of Justic","date":"2015-11-27T21:45:02.430+0000","up_votes":1,"down_votes":0,"body":"I just thought to myself \"How cool would it be if Ezreal's W was replaced with a \"Ricochet Point\" that would bounce his Q and Ult in a direction relative to where he fired from and from what angle.\n\nLike, you're at tribush in bot lane, but you want to run your ult straight across river. You can either wait to fire it, or put a \"Ricochet Point\" to reflect it off of.\n\nJust wanted to think out loud.","replies":[]},{"poster":"Sythriel Draken","date":"2015-11-27T09:39:00.931+0000","up_votes":1,"down_votes":0,"body":"Maybe they should turn EZ's W into some form of wave clear? Out of all the ADCs that are popular, EZ has no innate wave clear outside of his ultimate. Examples:\nJinx's Q-Rocket form, \nCait Q\nLucian Q\nTwitch W(it's small but it's an aoe that applies his kinda tiny passive, which that too should be buffed a bit)\nGraves Autos and Q\nTrist E bomb\nQuinn Q\nKalista Q (when it kills a minion)\nCorki Q\nSivir Q W\nUrgot.. wait, he exists still??\nAshe W\nDraven E (small but it IS aoe damage)\nKog E and Ult\nVarus Q\nMF Q and E (tiny but it helps)\n\nVayne has no wave clear, but is Friggen OP with her W in team fights. \n\nAs you can see. EZ is the only other champion that's considered \"Marksman\" that does not have some form of innate wave clear, or heavy contribution to team fights when his R is on cool down. His W is also the most boring part of his kit when you run him AD.  One fix would be to give his W some AD scaling and some form of degrading damage wave clear like his ult.  Least, that's my suggestion playing EZ for a while and enjoying him.","replies":[]}]}