{"poster":"Zenchi","date":"2019-04-29T20:01:07.555+0000","title":"Nicht berühren, sonst zerbrichst du es noch.","subforum":"Community-Kunstwerke","up_votes":7,"down_votes":1,"body":"Aber selbst, wenn ich mit ihr reden könnte, mit welchem Recht könnte ich es mir erdreisten solch ein graziöses Wesen ein Abbild einer Göttin von edler Natur mit meiner unreinen Stimme zu verderben. Ob mein Stimmlein solch himmlischen Worte, die dazu nötig wären ihre Erscheinung und ihr Herz zu beschreiben stark genug wäre eben diese zu tragen.\n\nDas mein Geist solche Worte überhaupt ergründen und erfassen könnte wäre schon fraglich. Ein Philosoph von höchstem Range geführt von der Hand Gottes wäre vonnöten, um solch undenkbaren Worte zu finden. \n\nNur ein Chor aus Engeln mit dem Hall Gottes als Resonanz wäre gut genug um solch Worte ihr Gehör bezaubern zu lassen. \n\nDer Schall noch Jahre später schwingend der Erde als Erinnerung an dieses einzigartige Event dienend, sobald die Worte klingend uns ins Traumland bringen sie uns bezaubernd durch die Nächte singen.\n\nUnd so berührte meine Stimme nie ihr Herz doch dafür entzweite meins. Herzen sind dazu da gebrochen zu werden. Doch weil ich mich selbst liebe ist mein Herz wieder eins.\n\nTja ich bin mich nicht sicher ob das was mit LoL zu tun haben muss um hier zu stehen also. Ich geh mal ganz unauffällig an die Wand dort drüben. \n{{summoner:4}}\n\nGrüße Zenchi","replies":[{"poster":"StardustSorcerer","date":"2019-04-29T22:41:58.303+0000","up_votes":2,"down_votes":0,"body":">  Doch weil ich mich selbst liebe ...\n\n( ͡° ͜ʖ ͡° )","replies":[{"poster":"Zenchi","date":"2019-04-29T22:45:18.724+0000","up_votes":1,"down_votes":0,"body":"♥ ;)","replies":[{"poster":"StardustSorcerer","date":"2019-04-29T22:50:28.712+0000","up_votes":2,"down_votes":0,"body":"Hmm. Ich frage mich ob du unter Drogeneinfluss stehst oder einfach nur enthusiastisch bist.","replies":[{"poster":"Zenchi","date":"2019-04-29T22:58:13.251+0000","up_votes":1,"down_votes":0,"body":"Wohl eher das Zweite. Auch wenn ich mir ab und zu das Vergnügen einer Zigarette gönne. Aber wenn ich vor der Wahl stehe Dorgeneinfluss oder enthusiastisch dann lieber enthusiastisch. Aber am Ende bin Ich einfach nur... naja Ich halt. Ich könnte mich jetzt beschreiben und erzählen wie ich bin aber der versuch wäre vergebens denn ich weiß selbst nicht wer ich bin xD","replies":[{"poster":"StardustSorcerer","date":"2019-04-29T23:12:59.140+0000","up_votes":2,"down_votes":0,"body":"Dann solltest du dich selbst kennen lernen. Oder willst du das nicht?\n\nDu hast mich einfach neugierig gemacht mit deinem \"speziellen\" Post und mit der schnellen Antwort.","replies":[{"poster":"Zenchi","date":"2019-04-29T23:17:17.221+0000","up_votes":1,"down_votes":0,"body":"Ich lerne mich gerne kennen. Doch die frage ist immer bin ich wirklich das was ich erkenne oder bin ich der Erkennende. Ich beobachte gerne wie die Gedanken wandern und was sie mir erzählen oder wie sich die Gefühle einfach nicht einig werden was sie nun sein wollen Wut, Freude, Liebe oder soll es lieber Angst sein? Oder wie alles um mich her rum still wird wenn ich LoL spiele und sobald ich das bemerke die Stille sofort verschwindet wie als ob sie mich trollen will. haha xD","replies":[{"poster":"StardustSorcerer","date":"2019-04-30T12:58:35.051+0000","up_votes":2,"down_votes":0,"body":"Das sieht nach meiner Ansicht gesund aus. Ich finde es gut, dass du deinen Gefühlen zuhörst.","replies":[]}]}]}]}]}]}]},{"poster":"xXDragONn","date":"2019-04-29T21:37:27.002+0000","up_votes":2,"down_votes":0,"body":"{{summoner:4}} … Alter Warum bist du hier nicht?#! joo klar du bist in dem Busch da drüben Geflasht xD assi 360 sec cooldown","replies":[{"poster":"Zenchi","date":"2019-04-29T21:39:20.655+0000","up_votes":1,"down_votes":0,"body":"xD haha","replies":[]}]},{"poster":"Old Videnz","date":"2019-10-04T15:46:42.876+0000","up_votes":1,"down_votes":0,"body":"Da war/ist wohl jemand verliebt? Schöne Worte!","replies":[]}]}