{"poster":"Ken Masters","date":"2016-08-02T18:25:57.355+0000","title":"Se agoto el tiempo de espera asdf","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"Con cada parche nuevo que sale, las mejoras son microsc&oacute;picas (el juego no ha cambiado mucho), y la experiencia de juego, el lag, los bajones de FPS est&aacute;n a la orden del d&iacute;a. De todos los juegos online que frecuento, este es el &uacute;nico que me bota del server de vez en cuando, que no me deja logearme de vez en cuando, que me hace empezar al minuto 6 jugando shaco jungla en rankeds, etc. Se supone que los requerimientos recomendados para el juego no son altos, quiz&aacute;s deber&iacute;a actualizarse, porque mi PC no siendo tan malo (8gb ram, procesador core I5, tarjeta de video ati radeon HD 6370M), me corren juegos con requerimientos mucho m&aacute;s altos y sin bajones de FPS. No s&eacute; si es un problema que se arreglar&aacute; pronto, pero creo que muchas cosas est&aacute;n muy poco optimizadas y tantas actualizaciones terminan arruinando la experiencia de muchos. Caso particular de hoy, jugue una ranked con 7 fps toda la partida (no ten&iacute;a ning&uacute;n proceso activo ni nada, otros juegos me corr&iacute;an bien), y ahora no me deja conectarme al server, siendo que tengo conocidos que est&aacute;n jugando en estos momentos, sin problema alguno.\r\n\r\neso nomas, este post seguramente morir&aacute;, pero al menos dejo mi descontento plasmado.","replies":[{"poster":"Necrosis","date":"2016-08-02T18:46:45.342+0000","up_votes":1,"down_votes":0,"body":"Creí que sólo a mí me pasaba.","replies":[{"poster":"Ken Masters","date":"2016-08-02T21:27:21.890+0000","up_votes":1,"down_votes":0,"body":"Y eso que no mencioné la cantidad de veces que he terminado en leavebuster porque me bota el server xD","replies":[{"poster":"Necrosis","date":"2016-08-03T03:16:58.337+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ken Masters,realm=LAS,application-id=X54mVVp0,discussion-id=WUZE9lZg,comment-id=00000000,timestamp=2016-08-02T21:27:21.890+0000)\n>\n> Y eso que no mencioné la cantidad de veces que he terminado en leavebuster porque me bota el server xD\n\nAh, no... Por suerte no llegué a ese nivel. Sólo sufría altos bajones de FPS durante las partidas y era como sufrir un delay. :P","replies":[]}]}]},{"poster":"Ghost Shadow26","date":"2016-08-02T19:15:50.530+0000","up_votes":1,"down_votes":0,"body":"Imposible que teniendo una PC asi te ande a 7 FPS, te dejo alguna cosas para ayudarte a mi me sirven teniendo una net que ni la mitad de ram que la tuya me anda semi pasable:\n\n* **Trata de borrar archivos basura del Pc (_Prefetch, %Temp% , Temp_)**\n\n* **Configura bien la plaqueta (pero si dijiste que te andan bien el resto de los juegos salta este punto)**\n\n* **Borra los archivos basura del LOL (Ve a la carpeta \"Logs\" del LOL y entra en _Game - R3d Logs_ y borra todos los archivos del texto que haya ahi)**\n\nCon eso algo seguro mejora tu rendimiento del LOL.\n\nSaludos y Suerte compañero! {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Ken Masters","date":"2016-08-02T21:27:47.875+0000","up_votes":1,"down_votes":0,"body":"Gracias compañero, intentaré seguir tus recomendaciones; por ahí quizás me ande bien el juego, saludos!","replies":[]}]}]}