{"poster":"Grifis1586","date":"2017-12-12T14:23:47.318+0000","title":"Account rubato, non funziona il form per contattare il supporto","subforum":"Aiuto e supporto","up_votes":2,"down_votes":0,"body":"Come da titolo. Oggi 12 provo a loggare e mi dice che il mio account &egrave; stato sospeso fino a marzo, non loggavo da mesi. Controllo l&#039;email e risulta un tentativo di cambiare penso la password il 10/12 e account sospeso 11/12. Vado a vedere lo storico delle partite e risulta negli ultimi tempi per l&#039;appunto solo questa partita con vayne che va 0/14. Immagino sia stato bannato per inting. Il punto &egrave; che non riesco a contattare i rioter cosa devo fare? Pu&ograve; essere solo una cosa temporanea che il form non funziona?","replies":[{"poster":"Chroniicles","date":"2017-12-12T16:09:15.333+0000","up_votes":1,"down_votes":0,"body":"Ciao! Che errore hai precisamente? Appena logghi ti scollega in automatico?","replies":[{"poster":"Grifis1586","date":"2017-12-13T08:24:36.272+0000","up_votes":1,"down_votes":0,"body":"Si non mi fa proprio loggare esce un messaggio con scritto che l'account è stato bannato fino a marzo","replies":[{"poster":"Airghon","date":"2017-12-13T11:19:39.945+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Grifis1586,realm=EUW,application-id=98NGV4Al,discussion-id=26cG2LNV,comment-id=00000000,timestamp=2017-12-13T08:24:36.272+0000)\n>\n> Si non mi fa proprio loggare esce un messaggio con scritto che l&#x27;account è stato bannato fino a marzo\n\nCiao!  \n\nAbbiamo ricevuto e preso in carico la tua richiesta, ti risponderemo appena possibile. \n\nMi dispiace per l'attesa ma riceviamo continuamente numerose richieste.\n\nA presto!{{sticker:vlad-salute}}","replies":[{"poster":"Grifis1586","date":"2017-12-14T09:26:42.802+0000","up_votes":1,"down_votes":0,"body":"Grazie mi è arrivata l'email ora appena ho due minuti seguo la procedura.","replies":[]}]},{"poster":"Chroniicles","date":"2017-12-13T11:09:54.480+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Grifis1586,realm=EUW,application-id=98NGV4Al,discussion-id=26cG2LNV,comment-id=00000000,timestamp=2017-12-13T08:24:36.272+0000)\n>\n> Si non mi fa proprio loggare esce un messaggio con scritto che l&#x27;account è stato bannato fino a marzo\n\nPerdonami non sono stato chiaro, mi riferivo al problema di non riuscire a contattare il supporto\n> Può essere solo una cosa temporanea che il form non funziona?\n\nIl ban può essere stato fatto preventivamente, però l'impossibilità di accesso _al sito del supporto_ può essere dovuto al ban dal sistema per spam.\nNel frattempo che mi rispondi, faccio fare un controllo ;)","replies":[{"poster":"Grifis1586","date":"2017-12-14T09:27:15.261+0000","up_votes":1,"down_votes":0,"body":"si come ho scritto sopra è arrivata l'email dal supporto, grazie mille per la disponibilità!","replies":[]}]}]}]},{"poster":"Laiho88","date":"2017-12-13T09:04:15.289+0000","up_votes":1,"down_votes":1,"body":"a me sembra che ci siano più furti di account di lol che di carte di credito.....","replies":[]}]}