{"poster":"Otti Teiger","date":"2015-04-04T14:43:48.072+0000","title":"Rankingteams suchen Spieler aller Art _Platin+ (Außnahme Gold)","subforum":"Clans & Teams","up_votes":4,"down_votes":2,"body":"Edite: \n\nTeam A - Platin /Dia\n\nMindestens Platin 2 (bevorzugt DIA!) \n\nGesucht werden: Jungler oder Top\n\nBisher belegt: \nTop oder Jungle : Platin 1\nMid: Dia 5\nAdc: Dia 4\nSup: Dia 3\n\nNur Platinspieler mit Potenzial nach oben. Bitte selbstkritisch sein. Es bringt nichts, wenn ihr mit dem Team nicht weiter kommt, weil kein Potenzial da ist. \n\n\nTeam B - Platin \n\nIst voll!\n\nBei genügend Anfragen wird ggf. noch ein zweites Platinteam eröffnet.\n\nTeam C - Gold/Platin\n\nMindestens Gold 2\n\nGesucht werden: Adc und Top Spieler\n\n\n\n\n\nGesucht werden Spieler f&uuml;r 3 Teams.\nWarum f&uuml;r 3?\nGanz einfach. Nach Erfahrung, kann man sagen, dass 25-50% der Anfangsspieler sich wieder ihren solo/due Spielen widmen bzw. einfach nicht ins Team passen. Sucht man nur f&uuml;r ein Team Leute und ein paar gehen, l&ouml;st sich die Gruppe wieder auf. Mit der 3 Teamregelung soll gew&auml;hrleistet werden, dass 2 Teams immer einsatzf&auml;hig sind. Daher werden die Teams auch nach einem bestimmten Prinzip aufgebaut sein.\nTeam 1: 5 Stammspieler + 2 Spieler aus Team 2 und 2 Spieler aus Team 3\nTeam 2: siehe Aufbau Team 1\nTeam 3: siehe Aufbau Team 1\nDurch diesen Aufbau sollten sich immer genug finden f&uuml;r ein Teamranking. Endstande L&uuml;cken kann man so auch einfach wieder auff&uuml;llen und es kommt nicht zum Stillstand. \nStammbesetzug:\nDie Teams werden grob nach eurer Liga sortiert. Daher soll es ein &bdquo;schw&auml;cheres&ldquo; Team geben mit Gold und Platin und die anderen beiden mit Platin und Diamant.\n\nKurz zu mir:\nPlatin 5, main mid und support, 25 Jahre, ts server vorhanden. \n\nGesucht werden:\nAnzahl: nur noch 4 Spieler\nPositionen: siehe unten\nLiga: Platin+ (mit Ausnahme Gold)\nJahre: 18+\nZeit: Ihr solltet abends wenigstens 3-4x die Woche online sein f&uuml;r ein paar Spiele. (Genaueres kann jedes Team dann f&uuml;r sich besprechen).\nTS: Pflicht\nChampions: Jeder sollte 4-5 Chars f&uuml;r seine Lane besitzen, die er/sie gut spielen kann sowie genug Champions zum Tauschen haben.\nSoftskills: Lernf&auml;hig, Kritikf&auml;hig, freundlich\nTeamleader: Gesucht werden nat&uuml;rlich auch Spieler, die das jeweilige Team leiten, sowie Spieler, die ingame gute Ansagen machen und auf die Zeiten achten.\nEin weiterer Vorteil bei 3 Teams, ist dass man neben einer guten Besetzung auch Testspiele gegen einander machen kann. Dar&uuml;ber hinaus kann auch jemand von der Stammbesetzung mal nicht kommen, wenn er/sie lange arbeiten muss oder im Urlaub ist. Das Team ist dann immer noch Einsatzf&auml;hig. \n\nWer Interesse hat, kann mich gerne adden. Ich bin heute noch bis kurz vor halb 6 zu erreichen und dann ab 7 Uhr.\n\n\n","replies":[{"poster":"UEG Mister Bliss","date":"2015-04-05T21:16:42.452+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nich würde mich gerne bei euch als AD-Carry/Marksman bewerben.\nIch spiele seit ca. 4 Jahren LoL und seit ca. 3 Jahren als Main ADC.\nIch habe in verschiedenen Teams bereits Erfahrungen gesammelt, sowohl in deutschen als auch internationalen Teams von Gold bis Diamant Niveau.\nAuch als Teamleader konnte ich bereits Erfahrungen sammeln. Als Shotcaller habe ich zwar bereits gespielt, ich bin aber der Meinung, dass man als ADC diese Rolle nicht perfekt ausfüllen kann.\nIch versuche trotzdem während des Spiels dem Team mit meinem (soweit vorhandenen) Wissen zu helfen.\nMeine Stärken sehe ich im relativ guten und sicheren Farm und meinem sicheren Positioning in Teamfights.\nMeine momentan meist gespielten ADC Picks sind Jinx, Kog Maw und Corki.\nIch suche ein Team mit dem ich sowohl mein eigenes Spiel, als auch das allgemeine Teamspiel verbessern kann.\nWerde sobald ich wieder nach Hause komme auch mal auf dem Teamspeak Server vorbeischauen.\nSolange könnt ihr mich gerne adden. Auch für Testspiele stehe ich gerne zur Verfügung.\nMfG Steal","replies":[]},{"poster":"Otti Teiger","date":"2015-04-04T15:09:29.961+0000","up_votes":1,"down_votes":0,"body":"11 Plätze noch frei.","replies":[{"poster":"Pyrill v2","date":"2015-04-04T20:37:10.278+0000","up_votes":1,"down_votes":0,"body":"sucht ihr noch einen midlaner (platin 3)?","replies":[{"poster":"Otti Teiger","date":"2015-04-05T09:03:43.852+0000","up_votes":1,"down_votes":0,"body":"midlanes haben wir momentan alle besetzt.","replies":[]}]}]},{"poster":"Otti Teiger","date":"2015-04-05T00:03:03.650+0000","up_votes":1,"down_votes":0,"body":"Es wird noch gesucht:\n1x Jgl + 1x sup mindestens platin 2, bevorzugt dia\n\n1x adc 1x top ab gold 1\n\nSonntag ab ca 12 uhr wieder da.","replies":[]},{"poster":"AttáX","date":"2015-04-04T19:20:49.707+0000","up_votes":1,"down_votes":0,"body":"Hey, hätte interesse.\n\nIch bin 24 Jahre Alt, je nach absprache jeden abend ab 18 uhr Online.\n\nIch spiele Main Toplane ( Maokai, Vlad, Naut, Kennen und Heca also Metapicks )\n\nAdde mich einfach ingame wenn bedarf besteht, bin leider nur low Gold.\n\nmfg Chris","replies":[]},{"poster":"FrankJaeg3r","date":"2015-04-04T18:38:11.975+0000","up_votes":1,"down_votes":0,"body":"PUSH{{summoner:4}}","replies":[]},{"poster":"Kleineholly","date":"2015-04-04T17:21:23.987+0000","up_votes":1,"down_votes":0,"body":"moin,\n\ndie idee mit den 3 teams finde ich sehr gut. ich suche schon seit längerem ein team, bin allerdings bis jetzt noch nicht fündig geworden. \nzu mir: \nich bin 27 jahre alt, spiele seit ca. 3 jahren lol und habe die letze saison mit gold III abgeschlossen. aktuell bin ich immer noch dort, doch mein ziel für diese saison ist platin. :) ich bin zwar recht flexibel, was die lane angeht, allerdings spiele ich am liebsten mid ({{champion:103}} {{champion:1}} {{champion:134}} {{champion:38}} {{champion:161}} {{champion:127}} {{champion:101}} {{champion:157}} ) und support ({{champion:37}} {{champion:89}} {{champion:53}} {{champion:25}} {{champion:201}} {{champion:1}} {{champion:40}} {{champion:412}} ). TS und headset sind natürlich vorhanden.\n\nwenn ich eure neugier geweckt habe, dann addet mich einfach ingame (kleineholly).","replies":[]},{"poster":"Otti Teiger","date":"2015-04-04T17:12:10.578+0000","up_votes":1,"down_votes":0,"body":"Hauptsächlich werden noch ADC, JGl und TOP gesucht ab Platin","replies":[]}]}