{"poster":"Piombo Savage","date":"2018-04-02T22:50:00.409+0000","title":"Sì ma non è giusto.","subforum":"Discussioni generali","up_votes":4,"down_votes":3,"body":"Ho appena finito una partita ranked.\r\n\r\nPersa per uno che ha giocato solo per feedare ed &egrave; andato afk dopo 10 minuti. (aveva regalato apposta 6 kill al Darius nemico).\r\n\r\n\r\nLa partita &egrave; stata persa inevitabilmente. Ed io ho perso 19 LP.\r\n\r\nOra io lo so che capita anche a tutti voi.  Ogni giorno gente viene retrocessa perch&egrave; c&#039;&egrave; un idiota che va afk nella propria squadra.\r\n\r\n\r\nIo volevo proporre come minimo di evitare ci&ograve;, o almeno abbassare la quota di RP che si perdono se c&#039;&egrave; un afk in squadra.\r\n\r\n\r\nDavvero sono un po&#039; scazzato.","replies":[{"poster":"cucusettete","date":"2018-04-02T23:29:59.463+0000","up_votes":3,"down_votes":0,"body":"Io oggi sono arrivato a 0 LP e la partita dopo sono sceso di categoria. Quindi non bisogna per forza perderne tante dopo essere arrivato a 0.\nComunque, secondo me sarebbe giustissimo penalizzare in maniera minore chi gioca con un afk in squadra. Si fa un sistema che, in base al tempo giocato in inferiorità numerica, ti fa perdere meno lp. Ovviamente chi va afk perde tutti gli lp, o anche qualcuno in più. Sistema poco abusabile,perché abbandonare al 25 perché magari si sta perdendo, farebbe comunque perdere molti punti al team, quindi sarebbe inutile, e che rende il gioco meno frustrante. È vero che si scende per colpa nostra, però se in un momento nel quale non riesci a vincere molto, ti ritrovi anche 2-3 partire da giocare in 4, di certo la discesa è semplificata. \nSe aggiungono un sistema di questo tipo, ed uno che impedisce di giocare se si hanno problemi di connessione, oggi mi è capitato di fare i primi 15 minuti di una partita con 300-700 di ping, secondo me il gioco ne guadagnerebbe un sacco.","replies":[{"poster":"RVN Trobugno","date":"2018-04-04T08:10:00.827+0000","up_votes":1,"down_votes":0,"body":"Non mi dispiacerebbe se ci fosse uno \"sconto\" per chi perde man mano che riesce a tirare avanti la partita nonostante l'AFK in team. Anche se su questo punto porrei una \"limitazione\" nel senso che comunque non puoi perdere meno di un tot, per esempio: solitamente perdi 19 LP? Perfetto ricevi questo sconto.. e magari resistendo riesci a raggiungere 12 LP, ma se fossi durato di più comunque sempre 12 ne avresti persi, chiaro?\n\nPer l'ultimo purtroppo credo che copra una parte di problemi, dato comunque che può capitare anche nel bel mezzo della partita una caduta di connessione, ecc.","replies":[{"poster":"cucusettete","date":"2018-04-04T22:03:11.409+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Trobugno,realm=EUW,application-id=MJVj50Jw,discussion-id=fcVyvNVX,comment-id=00020000,timestamp=2018-04-04T08:10:00.827+0000)\n>\n> Non mi dispiacerebbe se ci fosse uno &quot;sconto&quot; per chi perde man mano che riesce a tirare avanti la partita nonostante l&#x27;AFK in team. Anche se su questo punto porrei una &quot;limitazione&quot; nel senso che comunque non puoi perdere meno di un tot, per esempio: solitamente perdi 19 LP? Perfetto ricevi questo sconto.. e magari resistendo riesci a raggiungere 12 LP, ma se fossi durato di più comunque sempre 12 ne avresti persi, chiaro?\n> \n> Per l&#x27;ultimo purtroppo credo che copra una parte di problemi, dato comunque che può capitare anche nel bel mezzo della partita una caduta di connessione, ecc.\n\nPiù che premiare la capacità di resistere in quattro, cercherei semplicemente di rendere meno frustrante il tutto. Se uno abbandona dopo 5 minuti, magari ti scontano 10 lp, se uno abbandona dopo 20, te ne scontano 2-3. \nÈ vero, il problema di connessione può arrivare anche nel bel mezzo del game, e li non ci puoi fare niente, però quando io prboema c'è sin dal principio, secondo me si dovrebbe impedire di far giocare la partita. A me qualche volta capita che faccio un paio di partite senza problemi, poi magari alla terza ho 400 di ping sin dalla schermata di caricamento. Ricordo che su altri giochi, forse dota 2 o un vecchio moba di nome LOCO, era presente un sistema simile.","replies":[]}]}]},{"poster":"Pellah","date":"2018-04-02T23:10:18.939+0000","up_votes":1,"down_votes":1,"body":"Sì può perdere una partita o due per colpa di afk e troll in una sessione ma non viene declassati per via degli altri, se si scende di una o più divisioni l'unica persona a cui si può dare la colpa è se stessi. Togliendo il fatto che questa cosa potrebbe essere abusata, a ero basso servono più game per essere declassati e  avete pure la win gratis sulla promo, ma cosa volete di più? \n\nSe ti capitano game come questi impara quello che puoi imparare e vai al Next game, sarà l'insieme dei game a decidere se salirai o scenderai ed è quanto sei forte che determina in che percentuale vinci i game. Vuoi vincere di più?  Migliora, invece che perdere tempo a fare post lamentele ci sono un sacco di guide che puoi leggere, videoguida da guardare o puoi anche allenarti con meccaniche specifiche in custom, tutte cose che aumenterebbero le tue chance di salire al contrario di questo post \"\"\"sfogo\"\"\".","replies":[]},{"poster":"Aurelion Shmoll","date":"2018-04-02T23:02:51.842+0000","up_votes":3,"down_votes":4,"body":"Ok, hai perso 1 partita per questa ragione. Ora prova a pensare a come avresti potuto evitare di perdere le altre **51** sconfitte e a quante di quelle **53** vittorie possano essere state dovute al fatto che i nemici facevano estremamente cagare o trollavano.","replies":[{"poster":"LoSnaso","date":"2018-04-03T13:34:01.734+0000","up_votes":2,"down_votes":2,"body":"Questo non giustifica niente. Questa risposta non ha senso.","replies":[]}]}]}