{"poster":"Candleoro","date":"2019-08-28T05:58:52.212+0000","title":"Saoirse, The Lunar Preistess, Poke, Burst Heal, Support Concept","subforum":"Concepts & Creations","up_votes":2,"down_votes":1,"body":"Hey guys! Considering this is my first ever post to the Forums, I thought it important to introduce myself.\nMy summoner name is Candleoro as many of you may be able to tell, and I main lux, ok get your boos and hatred out of the way, ... Done? ok...\n\nTo you, I present **Saoirse**, The last in a long line of Lunari Priests. Saoirse was the last of her tribe to complete a successful trade with the Marai, \n({{champion:267}} 's people) Trading a powerful moonstone for an equally as powerful abyssal pearl. riped from the depths of the beyond by the tidecaller of the past. Saoirse's life was, by all means, uneventful until the looming Solari finally put an end to the Lunari. However, Saoirse took the Abyssal Pearl and ran. When she was left with no other option she panicked and discovered the true potential of the abyssal Peral's power. The Solari have long forgotten her name. But her face is a constant reminder to the elders of the Solari, a reminder of their failure to cleanse the land of heretics. Saoirse has been hunted down ever since that day, she's hidden for eons in faraway lands under many guises and many names. But she has always feared being found by the Solari, and thus finally took action. She scouted the youth, finding a strange anomaly within the Solari ranks she pounced on this opportunity. Soon enough, Diana was truly born as the aspect of the moon. Naturally, Diana's loud and defiant nature overshadowed any need to search for Saoirse, and so she rests. She acknowledges her selfishness but considers it only a survival tactic.\n\n**ABILITIES**\n\n**Passive Ability:** _Flow_\nSaoirse has a tertiary resource called _Flow_ which can stack up to **5** stacks\nSaoirse gains a stack or stacks of flow upon landing certain abilities. Each stack of Flow\ngives Saoirse **2% bonus movespeed (up to 10%)** and **bonus health regeneration**\nand **upon reaching five stacks Saoirse may right-click an ally champion to provide a small\nsingle-target heal**\n\n**Q Ability:** _Skipping Stone_\nSaoirse sends out a small skipping stone which can bounce up to **five times**. The\nstone travels a fixed distance every bounce and can be redirected between bounces. \nThe ability will cancel upon colliding with an **enemy champion**. upon hitting an enemy\nchampion or minion the stone will inflict damage in a small area, **the damage ramps up and \nthe area shrinks with every bounce if the stone** and** depending upon how many times the \nstone has bounced the ability will grant an equal amount of flow stacks upon hitting an enemy\nchampion.**\n_This ability deals significantly less damage to minions_\n\n**W Ability** _Abyssal Prayer_\nSaoirse roots herself where she stands and creates a heal over time area of effect in a \nmedium-sized area around her **healing all ally champions nearby over time for five seconds**.\nSaoirse may reactivate _Abyssal Prayer_ to **expend her current flow stacks and perform a\ninstant large heal which scales with the number of expended flow stacks**\n\n**E Ability** _Undertow_\nSaoirse unleashes a line skill shot that knocks up and damages any enemy champions in the \nrectangular area of effect. After which two waves explode from the long sides of the rectangular\nskill shot **Pushing any enemy champions in the direction of the wave, any champion pushed\ninto a wall is slowed briefly and takes damage.** Damaging an enemy champion with _undertow_ grants a _flow_ stack.\n\n**Ultimate Ability** _Abyssal Apparition_\nSaoirse creates a watery apparition of herself **which taunts very nearby enemy champions for 0.5 seconds**after which, the apparition smashes her own abyssal pearl creating **three large circular waves which push any enemy champions in their direction any champion pushed into a wall will be damaged and slowed**\n_Damaging an enemy champion with Abyssal Apparition will grant a flow stack_\n\nThanks for sticking with me! In the future, I may make some edits and add some Drawings!\nThanks again for listening!\n-Candleoro","replies":[{"poster":"BlackKnightJack","date":"2019-08-28T07:27:51.750+0000","up_votes":1,"down_votes":0,"body":"I think I'll start by saying that adding more Gnar ults into the game is probably a bad idea (especially when one is a basic ability). People are awfully upset as it is that Qiyana, an assassin, has one.","replies":[{"poster":"Candleoro","date":"2019-08-28T21:05:13.775+0000","up_votes":1,"down_votes":0,"body":"That's a very valid criticism, maybe instead of a short stun, it could like a minuscule knockup. or maybe converting the hard cc to soft cc in the form a slow while also bumping up the damage a bit to compensate?","replies":[{"poster":"BlackKnightJack","date":"2019-08-28T21:42:13.789+0000","up_votes":1,"down_votes":0,"body":"Maybe I should focus on what about this concept I DO like.\n\nPrimarily what I do like is that she has a built in Athene's Holy Grail wherein she stores successful ability casts and can heal allies using it. I would say make her Q a skillshot that damages enemies hit and accumulates flow while allies hit are healed and consume flow. From there just make a kit that operates around that.","replies":[]}]}]}]}