{"poster":"Final00","date":"2018-06-18T07:23:51.135+0000","title":"Championmarke in aram","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hey Leute,\r\nich frage mich jetzt schon l&auml;nger wieso bekommt man in aram keine Champion marken ? Ich pers&ouml;nlich bin der Meinung das es in aram sogar schwerer ist mit manchen Champions in aram ein S zu bekommen ( was riot ja auch best&auml;tigt hat da es jetzt etwas einfacher sein soll ein S in einem aram zu bekommen ) \r\nIn 3 vs 3 gibt es ja auch Champion marken, ich als leidenschaftlicher aram Spieler ( 5000 Games ) , wie auch viele andere Spieler bekommen keine Gelegenheit ihre Champions auf stufe 7 zu bekommen. \r\nFalls jemand wei&szlig; mit welcher Begr&uuml;ndung Riot keine Champion marken &iacute;n einem aram zul&auml;sst ( obwohl in der Beschreibung steht : erreiche ein S in der Bewertung um eine Champion marke zu erhalten ) so schreibt es mir bitte in die Kommentare.\r\nDanke schon mal im voraus. \r\nLG Final00","replies":[{"poster":"SSI CptHaunted","date":"2018-06-18T07:46:24.554+0000","up_votes":3,"down_votes":0,"body":"Ich schätze mal weil Aram mehr oder weniger \"nur\" ein Fun-Modus ist, gibt ja schließlich auch kein Ranked obwohl Aram mit Sicherheit öfter gespielt wird als Gewundener Wald.","replies":[]},{"poster":"SkyFallenNerox","date":"2018-06-21T20:28:11.338+0000","up_votes":1,"down_votes":2,"body":"Ich hasse aram, ist ein kack mode aber egal. es war noch nie schwer ein s zu bekommen.  wegen meinen freunden die nur das spielen habe ich somit auch einige aram games und da so gut wie immer ein S+,S,S-, A+ oder A bekommen. und marks sind mir egal. ich finde es behinderter das schlüsselstücke schwerer zu bekommen sind. selbst in aram. sogar als es hieß das es dort einfacher sei habe ich nie welche bekommen","replies":[{"poster":"eingew","date":"2018-06-27T03:16:37.278+0000","up_votes":1,"down_votes":0,"body":"Hattest du zufällig schonmal eine Strafe oder so? Ich kenne das Problem nämlich irgendwie so gar nicht. Ich habe im Moment über 20 Schlüssel und es ist kein Ende in Sicht, ich kriege deutlich weniger Kisten als Schlüssel und kann diese immer direkt öffnen. Die Leute, die sich über fehlende Schlüssel beschweren, bei denen weiß ich meistens, dass sie auch bestraft wurden und deshalb ja ihr Honorlevel gesunken ist, was es ihnen ja deutlich schwerer macht, Schlüssel zu bekommen. Also... weiß nicht, ich denke entsprechend mal, dass du dich über einen Effekt beschwerst, der so von Riot gewollt ist?","replies":[{"poster":"clair de lune289","date":"2018-06-27T04:32:04.413+0000","up_votes":2,"down_votes":0,"body":"hast du deine Kisten immer auf CD ? sprich du hast nie das Maximum von 4 erhaltbaren Kisten ?\n\nich bekomme beide eigentlich relativ gleichschnell außer ich mach mal wieder eine LoL \"Pause\" von 2-3 Wochen (kommt zur Zeit öfters vor XD)\ndas Ergebnis davon ist das ich zur Zeit 4-5 Kisten aber keine Schlüssel habe.\nwurde auch noch nie bestraft und bin beim letzten Zwischenschritt zu Honor 5.\n\nes kommt denke ich wirklich darauf an wie viel man spielt,da die Kisten doch recht einfach zu bekommen sind wen man Blindpick und 3vs3 unranked benutzt. gab schon Wochenende an denen ich innerhalb von einem Tag nach einer dieser Pausen meine 3 Kisten zusammen hatte und nach dem Wochenende dann wieder wichtigeres zu tun hatte.","replies":[]},{"poster":"SkyFallenNerox","date":"2018-07-13T18:03:09.558+0000","up_votes":1,"down_votes":0,"body":"als das neue system raus kam hatte ich meine 2 jährige lol pause wo ich gerade mal 3-5 mal im jahr vielleicht mal was gezockt habe und da hatte ich nix von ner strafe. und ich meine vor dem honor system und den schlüssel fragmente. damals soll es ja geheißen haben das man durch aram besser an fragmente kommt aber da war nix. und das neue system ist in meinen augen auch dumm. ok, man kann so auch leichter an fragmente kommen aber wenn es idioten gibt die nie einen honorn und das viele spiele hintereinander hast du zwar kisten aber keine schlüssel. das ist mit dem system von damals im vergleich ein noch größeres glückspiel. da hat man sogar ne höhere chance beim russisch rollet das 10 von 10 läuten überleben. {{sticker:slayer-jinx-unamused}} {{sticker:sg-ahri-1}} {{sticker:sg-soraka}}","replies":[{"poster":"eingew","date":"2018-07-16T04:06:10.234+0000","up_votes":1,"down_votes":0,"body":"Die Honors sind gar nicht einmal so wichtig. Du steigst eher durch die Anzahl deiner Spiele auf. Kisten bekommst du ja dadurch, dass einer deiner Mitspieler oder du selbst ein S schafft, ob das jetzt im ARAM einfacher ist, weiß ich ehrlich gesagt nicht, würde ich nicht so unmittelbar sagen. \nDas System ist eben darauf ausgelegt, dich dazu anzuregen, besonders viel zu spielen, dann profitierst du auch am meisten davon. So schlecht wie du finde ich das auch nicht, ich selbst spiele gar nicht mal so viel im Vergleich würde ich sagen und habe schon einiges durch die Kisten geschenkt bekommen, da waren echt nette Skins dabei.\n\nAnsonsten probier mal Supports zu spielen, da kriege ich eigentlich immer mit Abstand die meisten Honors durch :D. Aber wenn du mit der Einstellung \"diese Idioten\" an die Sache heran gehst wird das natürlich schwierig.","replies":[{"poster":"SkyFallenNerox","date":"2018-07-16T22:50:24.303+0000","up_votes":1,"down_votes":0,"body":"ich bin schon seit ca 1-2 jahre support main und spiele es immer noch, carry meistens als nami das spiel in dem ich alles und jeden heile und buffe bis zum umkippen, meine ult perfekt einsetzte und dennoch nen feuchten furz bekomme\n{{sticker:slayer-jinx-unamused}} {{sticker:sg-soraka}} {{sticker:sg-ahri-1}}","replies":[{"poster":"eingew","date":"2018-07-17T04:08:54.301+0000","up_votes":1,"down_votes":0,"body":"Naja, so wie ich das sehe bist du Level 42. Du spielst vielleicht einfach zu wenig, wie gesagt: Das meiste bei den Belohnungen ist abhängig davon, wie viel man spielt.","replies":[{"poster":"SkyFallenNerox","date":"2018-07-18T00:18:33.030+0000","up_votes":1,"down_votes":0,"body":"ich habe über 2 jahre pause gemacht da LoL nur noch Scheiße war und mich angekotzt hat. habe somit das update bei den man jetzt über 30 wird nicht mit bekommen und so und spiel es erst seit 2 monaten wieder aktive da ich nix anderes habe um meine zeit los zu werden. könnte auch genau so gut Minecraft oder so spielen da ich nix besseres zu tuen habe. {{sticker:slayer-jinx-unamused}}","replies":[]}]}]}]}]}]}]},{"poster":"naniwakaze","date":"2018-06-18T07:56:43.296+0000","up_votes":2,"down_votes":0,"body":"Ich denke, das liegt daran, dass das Spiel hauptsächlich für die Kluft ausbalanciert ist und du dein Können mit einem Champion dort beweisen musst.","replies":[]},{"poster":"Sirrkas","date":"2018-06-18T07:48:55.419+0000","up_votes":1,"down_votes":0,"body":">In 3 vs 3 gibt es ja auch Champion marken, \n\nNein, auch im 3vs3 kann man keine Marken erhalten. Die Marken für Stufe 6 und 7 gibt es lediglich im SR 5vs5 Modus. Blindpick oder Draftpick ist aber egal. Das wurde von Riot auch ausdrücklich so vorgesehen und kommuniziert.\n\n>Champion-Meisterschaftsstufen 6 und 7\n>\n>Wenn du mit einem Champion der Meisterschaftsstufe 5 ein S- oder besser erhältst, bekommst du Meisterschaftsmarken. Diese Meisterschaftsmarken kannst du mit Hextech-Beute in deinem Inventar kombinieren, um die Meisterschaftsstufen 6 und 7 zu erreichen! Hier die Details für jeden einzelnen Rang:\n>\n>Verdiene mit Champions auf Meisterschaftsstufe 5 für ein S-, S oder S+ Meisterschaftsmarken der Stufe 6. Kombiniere zwei Meisterschaftsmarken der Stufe 6 mit dem Hextech-Splitter, der permanenten Version dieses Champions oder 2450 blaue Essenzen, um Meisterschaftsstufe 6 freizuschalten.\n    Verdiene mit Champions auf Meisterschaftsstufe 6 für ein S oder S+ Meisterschaftsmarken der Stufe 7. Kombiniere drei Meisterschaftsmarken der Stufe 7 mit dem Hextech-Splitter, der permanenten Version dieses Champions oder 2950 blaue Essenzen, um Meisterschaftsstufe 7 freizuschalten.\n>\n>Meisterschaftsmarken, Championsplitter und permanente Champions, die zum freischalten der Meisterschaft verwendet werden, müssen alle Champion-spezifisch sein. Wenn du also mit Quinn auf Meisterschaftsstufe 6 kommen willst, musst du mit ihr S-Wertungen und Meisterschaftsmarken verdienen.\n>\n>**Meisterschaftsmarken der Stufen 6 und 7 erhältst du nur in normalen und Ranglistenspielen in der Kluft der Beschwörer.**\n\n[FAQ](https://support.riotgames.com/hc/de/articles/204211284)\n\nOb es eine Begründung dazu gab, fällt mir aber gerade nicht ein.\n\n","replies":[{"poster":"Final00","date":"2018-06-18T08:02:33.585+0000","up_votes":1,"down_votes":0,"body":"Danke für die Info´s {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}