{"poster":"Honey Queen","date":"2016-09-24T12:04:44.084+0000","title":"Ultimamente il ping su lol mi  impazzisce","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Gioco da molto tempo, nell&#039; ultimo anno la connessione mi &egrave; sempre andata bene stavo sempre sugli 70/ 90 ping\n\nIn questa settimana non so perch&egrave; il ping varia avvolte arriva anche a 400 o delle volte a 1000 per poi tornare a 70/80, questa situazione &egrave; frustrante  specialmente in ranked che se mi sale il ping a 1000 in team fight si pu&ograve; perdere quel fight per colpa mia. \n\nQuindi volevo chiedere come fare a sistemare il ping  secondo voi &egrave; problema della mia connessione o di lol? Ribadisco che la mia connessione &egrave; sempre andata bene in quest&#039;anno e mi da problemi solo su lol... forse pu&ograve; essere che il modem &egrave; vecchio e dovrei cambiarlo ? o cosa ? help please Q_Q {{champion:32}}","replies":[{"poster":"SerSlayer","date":"2016-09-25T20:04:23.307+0000","up_votes":1,"down_votes":0,"body":"Avevo il tuo stesso problema con un modem TP-LINK nuovo datato 2016. Può anche essere il modem ma è difficile, a meno che non ci sia qualcosa che non funziona più bene, anche se spesso i modem si bruciano direttamente, oppure può essere qualche interferenza semplicemente.\n\nComunque io ho risolto cosi:\nEntrando nel modem, c'è una sezione in cui puoi scegliere il canale radio (canale che utilizza il modem per mandare i dati), ho provato a cambiarli tutti, sono 14, finché non ho trovato quello giusto, quello che dà la massima connessione, questo perché magari altri modem utilizzavano quel canale. Ho spostato anche il modem (posto più alto e vicino al PC) con connessione wi-fi.\n\nIn realtà con tutto questo è cambiato solo il fatto che al posto di avere 1000 ping fisso, ne avevo come te. Da 60 arrivava a 500 nel giro di qualche secondo per poi scendere ancora, per tutta la partita.\nLa vera soluzione l'ho trovata in una stupenda funzione attivabile sui modem di ultima generazione, chiamata Bandwidth control, nella quale dopo aver notato che quando altri dispositivi connessi al wi-fi aprivano internet per scaricare o per vedere video, la connessione riceveva questi sbalzi, mi sono messo a \"smanettare\" su questa funzione. (ti allego uno screenshot... appena capisco come fare). http://s22.postimg.org/43jrs35zl/Nuova_immagine_bitmap.jpg\n\nImpostando questi valori alla rete, nella quale il mio IP fisso impostato su PC è 192.168.1.200 e quello degli altri dispositivi va da 192.168.1.100 a 192.168.1.199, sono riuscito ad avare una buona percentuale di connessione fissa sul mio PC (6000 minimo su 8000 circa), mentre 1250 su tutti gli altri dispositivi. Stessa cosa fatta sia in download che upload.\n\nConclusione: Ping fisso tra 55 e 65 ad ogni partita, con minimi sbalzi di massimo 80-90 ping se ci sono troppi dispositivi connessi.\n\nPer capire che il problema degli sbalzi di ping erano gli altri dispositivi ho semplicemente provato a cambiare password al modem, in modo che solo io ero connesso e tutto andava bene, quando rimettevo la vecchia password e gli altri si connettevano andava tutto a rotoli. (Vivo con genitori, zii e nonni).\n\nNon tutti i modem hanno questa funzione, soprattutto se vecchiotti, ma mi ci trovo benissimo. Ho fatto questa semplice guida, nel caso vuoi informarti meglio cerca su internet o magari contattami anche. Ciaoo!","replies":[]},{"poster":"Chroniicles","date":"2016-09-24T13:21:11.069+0000","up_votes":1,"down_votes":0,"body":"Ciao, prova a dare un'occhiata a questa [guida](https://support.riotgames.com/hc/it/articles/201752664-Risolvere-i-problemi-di-connessione); se giochi in wi-fi, oltre a testare se utilizzando il cavo hai gli stessi lag spike, sarebbe importantissimo assicurarti che altri dispositivi collegati alla rete non stiano saturando la banda, anche con processi in background","replies":[{"poster":"Honey Queen","date":"2016-09-25T18:08:25.319+0000","up_votes":1,"down_votes":0,"body":"Non ho capito nulla di ciò che hai detto Q_Q","replies":[{"poster":"Chroniicles","date":"2016-09-25T19:42:31.330+0000","up_votes":1,"down_votes":0,"body":"ehmm xD ti riferisci alla guida in sè o al resto? Posso provare a spiegarti tutto \"terra terra\"","replies":[]}]}]},{"poster":"TheKingOfTroll","date":"2016-09-24T12:29:32.204+0000","up_votes":1,"down_votes":0,"body":"Stesso problema.. Meglio abbandonare le ranked per il momento.. Ho iniziato ad avere problemi da questa settimana.. Prima era tutto ok","replies":[{"poster":"Honey Queen","date":"2016-09-24T12:47:45.651+0000","up_votes":1,"down_votes":0,"body":"Ma manca un mese alla fine seson è fondamentale arrivare a gold Q___Q","replies":[{"poster":"TheKingOfTroll","date":"2016-09-24T17:59:32.781+0000","up_votes":1,"down_votes":0,"body":"Sono Platino {{champion:48}}","replies":[]}]}]},{"poster":"wildfox99","date":"2016-09-24T16:37:26.026+0000","up_votes":1,"down_votes":0,"body":"mi aggiungo,normalmento sto sui 47ms,ma in questi giorni i ping cominciano a \"rimbalzare\" fra i 200ms e  i 1400 ms","replies":[]}]}