{"poster":"Rockoutwithmy","date":"2018-09-03T05:30:02.918+0000","title":"Bad Manners in Game","subforum":"Player Behavior","up_votes":2,"down_votes":1,"body":"So the issue at hand is that this game leans so heavily in the favor of being a dick.\r\nIn any other \"sport\" theres a sportsmanship aspect to the game, a referee that calls bad mannered language or behaviors.\r\nTHis game doesn't have a ref however, so bad manner behavior has to be reported after the game.\r\nThe main issue with this though is that bad mannered behavior ISNT punishable!\r\nYou can stomp somebody, continue to decimate a game, then just keep the game going until the enemy team surrenders.\r\nThere is no punishment for walking around mastery flashing endlessly.\r\nThere is no punishment for griefing in game, they only punish chat.\r\nChat that can be muted...\r\nSO the question remains, why is there so much reinforcement for behaviors that actually ruin people's games and even their day?\r\nWhy not find a way to reinforce being actually good mannered, or having some sportsmanship?\r\nWhy not recognize the inherent flaw in the game that rewards bad manners and no sportsmanship?\r\nOr is it that because this isn't a sport you don't want to recognize these so people dont catch on to this bullshit?","replies":[{"poster":"Periscope","date":"2018-09-03T05:52:28.959+0000","up_votes":1,"down_votes":0,"body":"I'm really not following you here. How does this game cater to negative players? If you're a positive player, you rank up in honor, get rewards, and never have to worry about losing your account.\n\nIf you're negative, you get punished.\n\nJust because you see negative players in game does not mean that the system does not affect them. You don't like someone spam pinging or spam emoting? Hit the report button, or the ping/emote mute button.","replies":[{"poster":"Rockoutwithmy","date":"2018-09-03T06:33:03.869+0000","up_votes":1,"down_votes":0,"body":"Negativity goes beyond what you say - unfortunately the game does not reward sportsmanship play and reinforces negative play (like farming one person to 10+ deaths for free gold). Yeah its a game, but being a sportsman like player means being respectful of others.\nAlso honor rewards are a red herring. They don't mean anything.","replies":[]}]},{"poster":"breakordoom444","date":"2018-09-03T05:53:38.451+0000","up_votes":1,"down_votes":0,"body":"griefing is infact bannable, its just rarely banned, with the current bot lane meta, the barrier between troll pick and non-meta pick has gotten REALLY thin, so riot has been very light with troll picks, as to feeding/walling with anivia, report and ban.\n\nyou can't take someone out of a game when they are still in a game.\n\nwhy would mastery flashing be bannable? your just proving that you as an individual are good at a champion, especially when playing skill dependent champions like vayne, your not saying your better then them, is just a self approval of skill.","replies":[{"poster":"Rockoutwithmy","date":"2018-09-03T06:31:28.743+0000","up_votes":1,"down_votes":0,"body":"Actions are not punished, in that, doing something bad mannered vs saying something bad mannered are not treated equally.\nMastery flash spam is typically done in an insulting manner. Its usually done following being killed by them. The intent is to tilt or insult, and should be treated as such.","replies":[]}]}]}