{"poster":"Mágikarp","date":"2016-01-18T22:00:17.641+0000","title":"Lo que yo pienso sobre el emparejamiento.","subforum":"Comportamiento del jugador","up_votes":8,"down_votes":0,"body":"Es solo **mi opini&oacute;n**, todas las opiniones son v&aacute;lidas siempre que se hagan con respeto, pueden no estar de acuerdo conmigo pero se eso se trata que todos somos diferentes y podemos pensar de diversas maneras, acepto todo lo que me quieran compartir ^^ .\n\nCon todo respeto y amor ^^ el emparejamiento actual que tiene el LoL es y ser&aacute; siendo por los momentos inservible para lo que se necesita/requiere, siento que cumple requerimientos muy b&aacute;sicos y deja muchas fallas, no quiero que suene como una cr&iacute;tica muy fuerte porque admiro el trabajo que hizo Riot, simplemente hay cosas con las que no estoy plenamente conforme como este sistema.\n\nhttps://fbcdn-sphotos-h-a.akamaihd.net/hphotos-ak-xpt1/v/t1.0-9/12507690_481389982062520_1577522857788605812_n.jpg?oh=4e3878f26b987279387b5cf6aa157a73&amp;oe=56FF91BE&amp;__gda__=1459456954_f042ce4d8e00a5f49077fdfcc5977a4a \n\nAHORA! les voy a indicar como voy a expresarme para que puedan entenderme, enumerar&eacute; un problema con la soluci&oacute;n, lo que est&eacute; en cursiva es una opini&oacute;n adicional, no es necesario leerla. Al final colocar&eacute; un mini-glosario para aquellos que no entiendan los t&eacute;rminos que us&eacute;. Empecemos {{sticker:slayer-jinx-catface}} \n\n- **  (1) Partidas Normales:** Al jugar con premades con una cantidad de partidas MUY inferior a la que posees el sistema funciona de manera incorrecta, no tomando en cuenta la cantidad de victorias en partidas normales sino que te coloca o con otros premades o contra un equipo que supera con creces la cantidad de victorias general y por lo tanto tiene MAYOR experiencia, esto genera que tanto t&uacute;, como tu premade/s se frustren al ser stompeados durante toda la partida por jugadores que poseen mayor habilidad, haciendo de esto una partida infernal, los jugadores que est&aacute;n solos y no son parte de la premade se sienten m&aacute;s frustrados a&uacute;n porque tienen a alguien que sin la intenci&oacute;n est&aacute; saliendo 0/10 en l&iacute;nea, no porque quiera sino porque carece de la habilidad necesaria para sostenerse contra un rival que tiene 500 victorias m&aacute;s que &eacute;l, e inclusive hasta le saca una ventaja enorme por runas._ _Hasta yo, si s&eacute; que mi rival es nivel 20 por alguna falla en el emparejamiento me dedico a asediarlo y a obtener todo el oro posible para asegurarme la victoria, porque s&eacute; que tarde o temprano estar&eacute; en una partida con las mismas condiciones, como dicen muchos, a veces te toca un &quot;troll&quot; en tu team y a veces en el otro team hay un &quot;troll&quot; y hay que aprovechar a recuperar la victoria perdida por un troll._\n\n**[Soluci&oacute;n]:** solo emparejar contra equipos con un n&uacute;mero general de victorias iguales, o lo m&aacute;s parecido entre s&iacute;, achicar el margen de diferencia que existe, &eacute;sto va a generar que el juego sea m&aacute;s positivo y &quot;divertido&quot; para aquellos que quieren jugar con su premade y m&aacute;s a&uacute;n jugadores que entran solos, sabiendo que se encontrar&aacute;n con un nivel similar a lo que ven&iacute;an jugando. Esto obviamente va a generar m&aacute;s tiempo de espera en las colas sin embargo creo que se prefiere tener una partida buena y satisfactoria, en 3 o 4 minutos a una partida &quot;basura&quot; cada 40 segundos. Encontrarse con una diferencia de m&aacute;s de 1000 victorias en un equipo es frustrante.\n\nhttps://scontent-gru2-1.xx.fbcdn.net/hphotos-xap1/v/t1.0-9/12507096_1067922429905394_1978538479725950350_n.jpg?oh=163c488a6f667da9316875a7e7c4cd46&amp;oe=57395D29\n\nhttps://scontent-gru2-1.xx.fbcdn.net/hphotos-xpl1/v/t1.0-9/11997_481098242091694_644795969099476351_n.png?oh=5f38c68c3e8f869be090b47d1e4edf25&amp;oe=5741C6FE\n\n- ** (2) Partidas clasificatorias:** en mi opini&oacute;n personal las rankeds son un 50% de diversi&oacute;n y un 50% de competici&oacute;n sana, se supone que es un e-sport y deseamos mejorar nuestras habilidades, superarnos, para muchos &eacute;so de que es &quot;un juego, asi que no me importa&quot; me parece que est&aacute; bien, sin embargo yo aplicar&iacute;a &eacute;so a las partidas normales, siento que las clasificatorias deben tomarse en serio y Riot deber&iacute;a promover &eacute;sto de manera individual tambi&eacute;n, no solo para con los equipos clasificatorios. Existe un desnivel muy notable que se presenta en las partidas normales, y es el n&uacute;mero de victorias como ven&iacute;a explicando, &Eacute;STO tambi&eacute;n sucede en ranked, s&eacute; que existen diversos factores como el MMR, el elo, pare de contar pero en ning&uacute;n momento Riot revel&oacute; bajo que indicadores funcionan y tampoco tiene porque revelarlo, sin embargo sabemos que no funciona de la manera correcta a como se ten&iacute;a pensado.\n\nSeg&uacute;n la wikia un deporte competitivo es: deporte practicado con la intenci&oacute;n de vencer a un adversario o de superarse uno mismo. Siento que actualmente &eacute;sto no se respeta en las partidas clasificatorias siendo que entramos en la categor&iacute;a de e-sport..\n\nhttps://media.giphy.com/media/3o6UBm6251kcmhUOje/giphy.gif\n\n**[Soluci&oacute;n]:** evaluar el DESEMPE&Ntilde;O INDIVIDUAL obtenido a trav&eacute;s del KDA/Rango de maestr&iacute;as x partida. Haciendo que &eacute;ste aumente o afecte directamente el MMR/ELO osea, que obtener un KDA/Clasificaci&oacute;n de maestr&iacute;as bueno, d&eacute; un &quot;peque&ntilde;o bonus&quot; al MMR/ELO obtenido, y si pierdes que no baje tanto, que de alguna forma &quot;amortig&uuml;e&quot; esa p&eacute;rdida. &Eacute;sto tambi&eacute;n afectar&iacute;a directamente los LP que se ganan y pierden por partida. Un ejemplo, {{champion:17}} {{item:3077}}  tuvo una muy buena partida donde gan&oacute; obteniendo una clase S en la clasificatoria, por lo que si a &eacute;l esta partida le daba por decir un ejemplo +50 puntos de MMR/Elo que le de un bonus por su esfuerzo como 55/60 puntos porque obtuvo clase S.\n\n{{champion:117}} fue jungla y tuvo una mala partida obteniendo un horrible KDA, no era su intenci&oacute;n pero termin&oacute; 0/15, entonces cuando su MMR/ELO baje se le va a descontar un poco m&aacute;s debido a que no le fue muy bien, &eacute;sto es para proteger a {{champion:117}}  y llevarla a un nivel donde ella se sienta c&oacute;moda y pueda salir 10/3 porque va a enfrentarse a jugadores con su mismo desempe&ntilde;o.\n\n{{champion:238}}  le fue muy bien sin embargo perdi&oacute;, pero consigui&oacute; un KDA de 14/2, entonces al perder su MMR/ELO va a disminuir, sin embargo como tuvo una buena participaci&oacute;n NO VA A DISMINUIR TANTO como deber&iacute;a, es decir que si el peque&ntilde;o zed iba a perder 30 puntos, se le van a descontar solo 25, por dar un ejemplo simple.\n\n{{champion:157}}  el peque&ntilde;o yoshua gan&oacute; la partida pero sali&oacute; 0/12, obtuvo una mala clasificaci&oacute;n, obviamente su MMR/ELO va a aumentar porque &eacute;l gano y se lo merece, sin embargo debido a su terrible desempe&ntilde;o yoshua en vez de aumentar 50 puntos, aumentar&aacute; 45, por decir un ejemplo.\n\nhttps://fbcdn-sphotos-g-a.akamaihd.net/hphotos-ak-xlf1/v/t1.0-9/12552541_479688772232641_2525860526323004283_n.jpg?oh=0a9f54ae23ff68a32e0b704cd892533f&amp;oe=57372066&amp;__gda__=1464317209_f8e802815ba35d0d8d0c9cd52e313c13\n\n\n- **(3) Trolls y AFK**: est&aacute; de m&aacute;s explicar el problema actual, todos lo vivimos a menudo\n\n**[Soluci&oacute;n]: ** Aparte del excelente sistema de baneos que han colocado por lo cual felicito enormemente a RIOT, siento que hace falta un empujoncito m&aacute;s agregando PENALIZACIONES M&Aacute;S SEVERAS, aquellos jugadores que se vayan AFK o Troleen en una partida clasificatoria ver&aacute;n descontado su MMR/ELO el doble, es decir les contar&aacute; como una derrota x 2, esto no quiere decir que se los coloque con trolls y AFK, porque todos tenemos derecho a mejorar nuestra conducta, sino que si iba a perder 15 LP, perder&aacute; 30. Es decir que para aquellos que abusen de la confianza de su equipo vendr&aacute; este castigo, ocasionando que bajen el doble de r&aacute;pido de divisi&oacute;n.\n\n**Mini-Glosario**: \n\n**AFK**: del ingl&eacute;s away from keyboard, que significa lejos del teclado, es decir que est&aacute; ausente y no volver&aacute;\n**Troll:** persona que pierde a prop&oacute;sito/ ayuda al equipo enemigo\n**MMR/ELO:** sistema puntuado que se toma de referencia para realizar los emparejamientos en las partidas clasificatorias.\n**Premade:** cuando invitas a tu amigo/amigos y para jugar en conjunto, tambi&eacute;n se le conoce como &quot;party&quot;.\n**LP:** puntos de liga que se obtienen al ganar una partida clasificatoria, en caso de perder se descuentan.\n**KDA:** del ingl&eacute;s Kill, Death, Assist. Que significa Asesinatos, Muertes, Ayudas, es la puntuaci&oacute;n que obtienes por juego.\n**Stompear:** que un rivel con mayor habilidad se aproveche de ti y esté constantemente asediandote.\n**Rango de maestrias: **clasificación que te da el juego según tu desempeño, este desempeño se compara con los mismos jugadores que usaron tu campeón.\n\nhttp://giphy.com/gifs/xT77XJdMtKKX6pEndK/html5\n\nMuchas gracias si leiste hasta aqu&iacute;, espero puedas opinar y compartirme lo que piensas porque aceptar&eacute; encantado toda opini&oacute;n! \n\n{{sticker:zombie-nunu-hearts}}","replies":[{"poster":"Bienzahar","date":"2016-01-18T22:14:21.423+0000","up_votes":5,"down_votes":1,"body":"No leí nada, muy largo, me aburri.","replies":[{"poster":"Mágikarp","date":"2016-01-18T22:25:39.491+0000","up_votes":2,"down_votes":1,"body":"Al menos te gustaron las imágenes?  </3 {{sticker:zombie-nunu-tears}}","replies":[{"poster":"Bienzahar","date":"2016-01-18T22:32:53.270+0000","up_votes":2,"down_votes":1,"body":"Puede ser.","replies":[]}]}]},{"poster":"Jota312","date":"2016-01-18T22:02:05.722+0000","up_votes":3,"down_votes":1,"body":"main jhin beta.","replies":[]},{"poster":"Whentz","date":"2016-01-19T02:26:45.078+0000","up_votes":2,"down_votes":1,"body":"Jajajaja estalle cuando vi la imagen del Yi poniendo \"gg izi\" JAJAJ tenga su +1 {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"xxOSNIxx","date":"2016-01-20T03:12:41.123+0000","up_votes":1,"down_votes":0,"body":"vengo de postear lo mismo en charlas generales.. totalmente de acuerdo con que las rank perdieron seriedad... hoy juegan por jugar... prueban campeones... no les importa perder... y el emparejamiento pesimo que hay... ya no hay partidas op.. ni las partidas que uno lograba dar vuelta... \nyo no era de jugar mucho,  pero recuerdo la temporada 3 se daban vuelta partidas perdidas... hoy el snow ball de los campeones hace imposible jugar con ingenio... \narregelen el emparejamiento pedorro de las rank","replies":[]},{"poster":"JACKY FANBOY","date":"2016-01-19T19:01:46.848+0000","up_votes":1,"down_votes":0,"body":"Lei el principio y el final, igual que los libros cuando iba al cole","replies":[]},{"poster":"Farsant3","date":"2016-01-19T01:34:40.960+0000","up_votes":1,"down_votes":0,"body":"Solo emparejar contra equipos con un número general de victorias iguales: Aqui se generaria un problema, yo tengo una cuenta smurf en Oro IV que solo tiene 110 victorias en normales, y conozco mucha gente smurf que sus cuentas son asi.\n\nEsto tambien se aplicaria a cuentas en ranked, esta bien el emparejamiento por elo en ranked si lo haces por partidas existe gente en bronze con 800 partidas y en Challenger igual, esto haria fallar el emparejamiento. Tambien aclararte que los puntos de liga no son igual al MMR , perder menos puntos no te hara perder menos elo, ademas eso del kda solo generaria en las partidas que nadie quiera arriesgar o que algunos esperarian a entrar a una tf solo a limpiar sin ponerse en riesgo.","replies":[]},{"poster":"alhasthor","date":"2016-01-18T23:07:03.973+0000","up_votes":1,"down_votes":0,"body":"es muy buen post pero creo q esta en la categoria incorrecta...\n\nme va a doler denunciarte lince cosmico de las cavernas celestiales de andromeda {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Mazoku","date":"2016-01-18T22:11:23.352+0000","up_votes":1,"down_votes":0,"body":"1) La cantidad de partidas jugadas no determina que tan bueno sos. Emparejar por cantidad de partidas es absurdo...\n\n2) El sistema actual determina 1 sola cosa: Que tan bueno sos para ganar. Al sistema no le importa COMO lo logras sino que si sos capas de ganar o no. Es por ese motivo que un challenger tiene muchas mas chances de hacer que un equipo sea victorioso que un bronce dados los mismos equipos.\n\nTu sistema premia a aquellos jugadores con X rasgos. Dicho en otras palabras los challenger con tu sistema serian muy buenos en garantizar esos x rasgos pero infinitamente inferiores a los challengers actuales en cumplir el objetivo del juego: romper el nexo enemigo.","replies":[{"poster":"Mágikarp","date":"2016-01-18T22:18:37.332+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias por tu opinión, siento que tienes razón y a a vez no en el punto uno, puesto que a mayor cantidad de partidas se posee mayor experiencia y conocimiento sobre el juego, son pocos los jugadores que poseen una habilidad excepcional con tan solo 100 juegos por darte un ejemplo, son muy contados los casos que dices, pero te entiendo perfectamente y estoy de acuerdo.\n\nRespecto al punto 2 el sistema hace que las partidas sean frustrantes y se dé lo que actualmente se viene generando, que el lol deja de ser divertido porque te presiona en condiciones injustas y no iguales para todos los jugadores, yo intenté plantear un sistema que funcione igual tanto para el que sale 0/10 como para el que sale 15/1 , quizás hay mejores formas de hacerlo pero eso fue lo que se me ocurrió.\n\n Yo veo el sistema actual como una ruleta rusa donde a veces te toca un team bueno y a veces te toca un team malo, a veces tienes suerte y lo puedes sacar adelante, mientras que la mayoría de las veces cuando no tienes suerte pierdes exclusivamente por un jugador, si se te plantea que vas a jugar por ejemplo en la liga comprendida entre oro y plata, debería representar para ti esa dificultad, y no una dificultad platino por ejemplo, es todo suerte, inclusive si vas 0/10 y todo tu equipo te saca adelante también está mal porque no aportaste lo necesario, tú no mereces esa victoria, es de quienes te sacaron adelante, alguien tuvo que aportar lo que a ti te faltaba, es decir superaron el nivel plata/oro (referido al ejemplo) pero van a seguir en esa division porque le van a seguir tocando dificultades mas elevadas donde no siempre van a salir victoriosos.\n\nNo se puede romper el nexo sin hacer teamfight y colaborar directamente con tu equipo lo que se va a ver reflejado en el KDA, tiene sus grandes fallas lo que estoy planteando pero siento que es un \"mal menor\" al sistema actual, por ejemplo un singed proxyfarm que lleve su equipo a la victoria no vería beneficio alguno de esto que planteo, le perjudicaría.","replies":[{"poster":"Mazoku","date":"2016-01-18T22:27:29.706+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mágikarp,realm=LAS,application-id=PJAKt7ph,discussion-id=8w3OjKO2,comment-id=00010000,timestamp=2016-01-18T22:18:37.332+0000)\n>\n> Muchas gracias por tu opinión, siento que tienes razón y a a vez no en el punto uno, puesto que a mayor cantidad de partidas se posee mayor experiencia y conocimiento sobre el juego, son pocos los jugadores que poseen una habilidad excepcional con tan solo 100 juegos por darte un ejemplo, son muy contados los casos que dices, pero te entiendo perfectamente y estoy de acuerdo.\n> \n> Respecto al punto 2 el sistema hace que las partidas sean frustrantes y se de lo que actualmente se viene generando, que el lol deja de ser divertido porque te presiona en condiciones injustas y no iguales para todos los jugadores, yo intenté plantear un sistema que funcione igual tanto para el que sale 0/10 como para el que sale 15/1 , quizás hay mejores formas de hacerlo pero eso fue lo que se me ocurrió.\n> \n> No se puede romper el nexo sin hacer teamfight y colaborar directamente con tu equipo lo que se va a ver reflejado en el KDA, tiene sus grandes fallas lo que estoy planteando pero siento que es un \"mal menor\" al sistema actual, por ejemplo un singed proxyfarm que lleve su equipo a la victoria no vería beneficio alguno de esto que planteo, le perjudicaría.\n\nLa mayor experiencia no significa nada si no sabes tomarla. Tu cuenta es nivel 11 (asi que asumo que es una smurf y sabes de que hablo) pero yo en silver me cruzaba gente con 4000 partidas que eran eternos bronces. Gente que nunca iba a salir de ahi. Yo tengo 1000 wins aproximadamente y llegue a platino 2.\n\nEmparejar por partidas jugadas tiene tanto sentido como repartir la liga por numero de partidas jugadas. Puesto en esas palabras no tiene sentido, ves?\n\n----\n\nSi, hay mejores formas de hacer lo que propones pero ninguna que pueda ser aplicada realmente.\n\nLa unica forma de crear un sistema que premie correctamente (asumiendo que el objetivo es romper el nexo) es el que solo considere las wins o loss que tenes.\n\nExisten 3 tipos de soluciones:\n\n1) Reales: Aquellas que pueden ser aplicadas.\n2) Utopicas: Aquellas que no pueden ser aplicadas.\n3) Hibrida\n\nLa tuya es una solucion hibrida. No es tan buena como una solucion utopica pero tampoco puede ser aplicada en la realidad.\n\nUna mejor solucion utopica seria que una persona real por parte de riot spectee los games y decida cuanto puntaje gana cada uno al finalizar.\n\nUna mejor solucion real es la que tenemos ahora.","replies":[{"poster":"Mágikarp","date":"2016-01-18T22:38:08.559+0000","up_votes":1,"down_votes":0,"body":"Me gusta mucho tu punto de vista y lo tomo ^^ , quizás no me expliqué bien o no me di a entender apropiadamente yo solamente incluía a la cantidad de victorias para emparejamiento de partidas normales, en las ranked siento que como tu dices no deben tomarse tanto en cuenta sino depende únicamente del MMR/ELO como se viene haciendo y es el sistema que tú (y también yo) apoyo, como tú dices lo que propongo es algo híbrido conservando el sistema pero generando \"pequeños\" cambios, muchas gracias por tu opinión, siento que podrían existir mejores soluciones reales y que es una problemática el sistema actual, quizás en eso no concordemos pero te digo de nuevo que gracias por compartirme lo que sabes. :* \n\nSoy oro V y tengo 1200 partidas aprox, publiqué esto en el foro incorrecto y me banearon un día (no sé porque tan extremista todo :C ) asi que no pude hacerlo desde mi cuenta original: \"0wu\". Saludos!!\n\nPD. Al menos con el sistema de castigo a trolls y afk's estamos de acuerdo? =(","replies":[{"poster":"Mazoku","date":"2016-01-18T22:41:28.809+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mágikarp,realm=LAS,application-id=PJAKt7ph,discussion-id=8w3OjKO2,comment-id=0001000000000000,timestamp=2016-01-18T22:38:08.559+0000)\n>\n> Me gusta mucho tu punto de vista y lo tomo ^^ , quizás no me expliqué bien o no me di a entender apropiadamente yo solamente incluía a la cantidad de victorias para emparejamiento de partidas normales, en las ranked siento que como tu dices no deben tomarse tanto en cuenta sino depende únicamente del MMR/ELO como se viene haciendo y es el sistema que tú (y también yo) apoyo, como tú dices lo que propongo es algo híbrido conservando el sistema pero generando \"pequeños\" cambios, muchas gracias por tu opinión, siento que podrían existir mejores soluciones reales y que es una problemática el sistema actual, quizás en eso no concordemos pero te digo de nuevo que gracias por compartirme lo que sabes. :* \n> \n> PD. Al menos con el sistema de castigo a trolls y afk's estamos de acuerdo? =(\n\nTanto las partidas normales como las clasificatorias tienen el mismo sistema detras. Las dos colas funcionan con el sistema del MMR.\n\nAgregar una restriccion adicional como la tuya incrementa el tiempo de busqueda y disminuye la calidad del servicio que nos brinda riot. Como no hay razon suficiente que justifique esto no hay motivo para incluirlo.\n\n----\n\nNo, no estamos de acuerdo con respecto a lo de los trolls y afks. Deje eso de lado porque no conosco el sistema de forma tan profunda como para formular una opinion y ponerme a debatir con vos.","replies":[{"poster":"Mágikarp","date":"2016-01-18T22:43:29.661+0000","up_votes":1,"down_votes":0,"body":"Bueno, gracias de todas formas por la opinión brindada! {{sticker:slayer-jinx-catface}}","replies":[]}]}]}]}]}]}]}