{"poster":"Szurony","date":"2017-12-28T06:54:29.960+0000","title":"League Of Legends(LoL) és Dota2 és Heroes Of The Storm(HOTS)","subforum":"Általános beszélgetés","up_votes":4,"down_votes":1,"body":"Egy nap el kezdtem ezeken a j&aacute;t&eacute;kokon gondolkozni  ezekről a j&aacute;t&eacute;kokr&oacute;l &eacute;s arra jutottam, hogy &quot;Melyik a jobb?&quot; k&eacute;rd&eacute;st felesleges feltenni, de &eacute;rdekelne akik esetleg hozz&aacute;m hasonl&oacute;an mind a 3-mal j&aacute;tszottak mi a v&eacute;lem&eacute;ny&uuml;k. Az t&eacute;ny, hogy  mindbe munk&aacute;t fektettek &eacute;s zseni&aacute;lis. De &eacute;rdekes tapasztalataim lettek. \r\n**A LoL.:** Sz&aacute;momra mindig az a j&aacute;t&eacute;kvolt amit szidtam, de nem b&iacute;rtam abba hagyni &aacute;ltal&aacute;ban egy k&ouml;zepes j&aacute;t&eacute;kos k&eacute;nt j&aacute;tszottam ugyan annyi győzelmem van mint veres&eacute;gem, de rangsoroltban cs&uacute;fosan bukok. (&eacute;s magyar nyelvel teljesen t&aacute;mogatott)\r\n**A Dota 2-t:** Sz&aacute;momra ideges&iacute;tő ir&aacute;ny&iacute;t&aacute;sa &eacute;s n&eacute;ha unalmasan hossz&uacute; j&aacute;t&eacute;kai ki k&eacute;sz&iacute;tenek, de m&eacute;g is j&aacute;t&eacute;kosok ellen is t&ouml;bb győzelmem van mint veres&eacute;gem, de t&uacute;l unalmasnak tartom, hogy &uacute;gy bele vessem magam mint a LoL-ba. (csak sz&ouml;vegesen t&aacute;mogatott a magyar nyelv)\r\n**A HOTS.: **Ez a legfrissebb nagyon k&ouml;nnyed &eacute;s kezdő bar&aacute;t, de probl&eacute;m&aacute;m, hogy internetem gyenge a felhőtlen &eacute;lvez&eacute;s&eacute;hez &eacute;s a napi egy k&uuml;ldet&eacute;s kap&aacute;s&aacute;val &eacute;s megcsin&aacute;l&aacute;s&aacute;n t&uacute;l  nem tudtam nagyon csin&aacute;lni egyebet. R&aacute;f&uuml;ggeni nagyon nem tudtam-e miatt, de &eacute;lvezem. (magyar nyelvel nem t&aacute;mogatott)\r\n\r\nNektek mi a v&eacute;lem&eacute;nyetek ezekről? \r\n**K&eacute;rlek ezt kultur&aacute;ltan tegy&eacute;tek meg!**","replies":[{"poster":"Gamma Ray","date":"2017-12-28T07:44:05.687+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Nemin","date":"2017-12-28T10:49:43.277+0000","up_votes":1,"down_votes":0,"body":">Az már hab a tortán, hogy steamen találtam. Steam vagy valve szót meglátom, a hányinger kerülget. Ezt nem fejtegetem megvan az okom rá, hogy úgy ahogy van az egész bandát utáljam. Számomra a steam, mint név a gusztustalansággal egyenlő.\n\nErre kíváncsi lennék :)","replies":[]}]},{"poster":"Nemin","date":"2017-12-28T10:52:37.742+0000","up_votes":2,"down_votes":1,"body":"A DOTA játékosok iránt van egy sajátságos csodálatom, mivel képesek ilyen szinten mindenre odafigyelni. De maga a játék számomra nehezen játszható, időnként megjön hozzá a kedvem, majd két játék után le is törlöm.\n\nA HOTS nekem mindig is nagyon visszataszító volt. Se a játékmenet, se a karakterek megvalósítása és viselkedése nem tetszett, így kb. nem vagyok hajlandó vele játszani.\n\nA LoL-t pedig lassan négy éve nyomom már. Bőven van miért haragudni a Riotra, de még így is ez az egyetlen MOBA játék, ami képes volt huzamosabban lekötni.","replies":[{"poster":"Gamma Ray","date":"2017-12-28T14:28:25.709+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Nemin","date":"2017-12-28T14:33:14.068+0000","up_votes":2,"down_votes":1,"body":"Hát effektíve most elküldted az egész Blizzard franchiset :D\nUgyanis, ezek a karakterek mind egy-egy Blizzardos szériából vannak, Warcraft, Starcraft, Diablo, Overwatch, The lost Vikings, stb.\n\nÉn fogalmaztam rosszul, nem a karakterekkel van bajom, hanem, ahogy a HOTS-ban viselkednek. Önmagukban jól megírt karakterek, akiket ilyen ostoba meme-szintre butítanak, mert hogy mennyire barátságos játék ez a HOTS.","replies":[]}]},{"poster":"Szurony","date":"2017-12-28T13:03:30.010+0000","up_votes":1,"down_votes":0,"body":"Én is kb. 5-6 éve játszok a LoL-lal Dotá2-ben  mag kb. 9 meccsem. :)","replies":[]}]},{"poster":"M4dr4c","date":"2017-12-28T09:54:10.550+0000","up_votes":2,"down_votes":1,"body":"Nagyon tömör vélemény csak. \nDota2 túl lassú és bonyolult, túl sok mindenre kell odafigyelni, nekem nem jött be ezek miatt. \nHoTS túl egyszerű és kötött, a tárgyak hiánya miatt kevesebb lehetőséged van reagálni a változásokra és a mapok némelyike teljesen megköti mik a jó hősök hozzá. Nem tetszett igazán. \nLoL még leginkább az \"arany középút\" a kettő közt, ezzel is játszottam a legtöbbet mondjuk. Az évek során változóan tetszett és nem. :D","replies":[]},{"poster":"WZsoleszko","date":"2017-12-28T21:33:02.025+0000","up_votes":1,"down_votes":0,"body":"Dotával rengeteget nyomtam, annó még warcraft 3as modként is, utána pedig sokáig a \"második\" résszel.\nSzámomra még mindig az etalon MOBA, sokkal összetettebb, figyelemigényesebb, kreatívabb módon lehet játszani, jóval nehezebb mint a lol.\nAz egyetlen ok amiért abbahagytam hogy különböző okok miatt eladtam a gépem és a másik nem vitte, így nekiálltam lolozni, (úgy 4 éve) most meg már nincs annyi időm hogy újra értelmes szinten tudjam játszani, így maradok itt.\nBarom orosz 12évesek rosszabbak mint akármelyik lolos, és ott voice chat is van :DD\n\n\nLolról annyit hogy összességében egy jó játék, könnyebb mint a dota, az egyetlen dolog amit nem szeretek hogy minden meg van szabva, nem lehet olyan kreatívan játszani. Értem ezalatt hogy amég dotában konkrétan láthatsz mindent mindenhol, addig itt pár kivétellel ugyan de a mides champ az mid, a topos az top stb.. ( nyilván ha skilled megvan lehet játszani pár szokatlan dolgot ha a teamcomp is engedi, de sokkal szűkebb a lista)","replies":[{"poster":"Szurony","date":"2017-12-28T22:46:26.922+0000","up_votes":1,"down_votes":0,"body":"Ami érdekelne mivel úgy látom elég tapasztalt vagy, hogy LoL-ba Top-ozni szeretek, de Dota2-be support-kodni és csak azt is tudok. \"Hogy lehet ez?\"","replies":[{"poster":"WZsoleszko","date":"2017-12-30T13:33:30.428+0000","up_votes":1,"down_votes":0,"body":"Na erre nem tudok konkrét választ adni.\nA top a dotában különbözik a lolostól, ott a top északi oldalon safelane, délin hard, vagyis ha a radiant (dél) oldalán játszol könnyen lehet hogy 2v1 vagy akár 3v1 szituációban találod magad topon ahol megfelelő hero és skill nélkül nem fogsz egyről a kettőre jutni :D","replies":[]}]}]},{"poster":"SquatEye","date":"2017-12-29T22:11:14.788+0000","up_votes":1,"down_votes":0,"body":"Amellett hogy a DOTA 2 szvsz túl van bonyolítva, nekem az art concept része sem tetszik, egyszerűen rossz ránézni, a HOTS pedig még casualnak sem felel meg, halvány elképzelésem sincs hogy gondolta a Blizzard hogy e-sportot csinál belőle.\nNem mondom hogy a LOL tökéletes, de messze a legjobban kivitelezett MOBA minden szempontból. Amihez értenek a RIOTosok, az az, hogy hogy legyen egy játék könnyen tanulható, de mesteri szinten nehezen játszható, és mindezt hogy tudják úgy becsomagolni, hogy tömegeket mozgassanak meg vele.","replies":[]},{"poster":"Galvin Flintmage","date":"2017-12-28T18:51:57.242+0000","up_votes":1,"down_votes":0,"body":"Lol: Már 5-6 éve játszom\nDOta2: nem próbáltam\ndota 1: király volt égen :D\nHOTS: Azzal többet játszottam, néha megjön a kedv, de nagyon hamar meg lehet unni, mert olyan egyszerű a játék.","replies":[]}]}