{"poster":"Szurony","date":"2015-05-25T17:13:25.098+0000","title":"Manna erő forrásból túl sok van,másból túl kevés van?","subforum":"Tippek és trükkök","up_votes":1,"down_votes":0,"body":"Csak &eacute;n tartom kev&eacute;snek a nem mann&aacute;t haszn&aacute;l&oacute; karakterek sz&aacute;m&aacute;t kev&eacute;snek? T&eacute;ny a manna egy klasszikus &eacute;s j&oacute;l bev&aacute;lt erő forr&aacute;s, de  nem innovat&iacute;v. Viszont azt is tudom hogy m&aacute;s fajta energia forr&aacute;st kital&aacute;lni neh&eacute;z &eacute;s v&eacute;gtelen kreativit&aacute;s kell hozz&aacute; ( **Ami a League of Legends(a c&eacute;g&eacute;nek is)-nak mindig meg volt** ). \r\n&Eacute;s nagyon neh&eacute;z ezzel a t&eacute;nyezővel a balanszot ( **egyens&uacute;lyt** ).\r\n> Szerintetek van arra &ouml;tlet, &ouml;tletetek, hogy valakinek ak&aacute;rmilyen &uacute;j energiaforr&aacute;st kital&aacute;lni &uacute;gy hogy fenn maradjon a balansz( **egyens&uacute;ly** )?","replies":[{"poster":"Lord1289","date":"2015-05-25T19:14:57.389+0000","up_votes":2,"down_votes":0,"body":"BRONZE FIIIIVEEEEEEEE","replies":[{"poster":"Szurony","date":"2015-05-26T03:24:53.469+0000","up_votes":1,"down_votes":2,"body":"És akkor mi van azért vagyok ebben a rangba mert\n1.  nem érdekel annyira a rang sorolt.\n2.  nincs csapaton így nem túl jó a csapat munka. -----\n3.  ----> Illetve az már komoly baj 10-ből 10 elbukok, de Nem mindig az én \"hülyeségem,, miatt bukjuk el.","replies":[{"poster":"Tornyi1899","date":"2015-05-26T10:55:07.030+0000","up_votes":3,"down_votes":0,"body":"Az emberek 90%-nak nincs csapata mégis tud csapatban harcolni.","replies":[{"poster":"Szurony","date":"2015-05-30T22:06:41.117+0000","up_votes":1,"down_votes":1,"body":"Érdekes nekem nem sikerül annyira ,de azért az angol tudásom se 5-ös.\n( Mondjuk nem ez a téma de ha szeretnél erről beszélhetünk még 4 szem közt ).","replies":[]}]}]}]},{"poster":"manaszon","date":"2015-05-25T19:10:08.435+0000","up_votes":1,"down_votes":0,"body":"Szerintem új energiaforrásra semmiképp sincs szükség, így is több variációja van a dolognak: ugye a manás hősök, az energiával \"működő\" hősök, a saját életerejüket feláldozó hősök, illetve azon bajnokok, amelyek semmit sem igényelnek. Több energiaforrásra szerintem nincs szükség, ezzel a négy verzióval szerintem mindent le lehet fedni, ami szükséges lehet.\n\nAz mondjuk valóban érdekes kérdés, hogyha vannak olyan hősök akik teljesen ingyen használják a képességeiket (még HP-ba sem kerül nekik), a többieknek miért kell ilyesmikkel küzdeniük_ (mármint a manával/energiával)_? Nem vagyok benne biztos, hogy ez így teljesen fair.","replies":[{"poster":"M4dr4c","date":"2015-05-25T19:21:59.466+0000","up_votes":2,"down_votes":0,"body":"Van még a rage út is, lásd Trinda, Syv, Reneton. Igaz ez a legtöbb esetben nem úgy fogy, mint a mana, de azért komoly különbség a sima CD-re várunktól játékstílusban.","replies":[]},{"poster":"Jashin chan","date":"2015-06-21T17:54:33.146+0000","up_votes":1,"down_votes":0,"body":"Ott van {{champion:60}}  pók alakja aminél a képességek nem kerülnek semmibe se manába se dühpontba se semmibe gyorsan visszatöltődnek és nem is gyenge sebzéseket lehet vele bevinni.","replies":[]}]},{"poster":"Tetth","date":"2015-05-25T17:43:54.590+0000","up_votes":2,"down_votes":0,"body":"Én csak a helyesen leírt mondatok számát tartom kevésnek.","replies":[{"poster":"Szurony","date":"2015-05-26T03:01:45.684+0000","up_votes":2,"down_votes":1,"body":"Bocs pedig pont ezért többféle helyes írás ellen őrzőbe is be ütöttem, de nem talál  hibát.\nIlletve nem vagyok túl gyakorlott a fogalmazásban az az nem akartam oldalakat írni hanem meg próbálni röviden tömören a lényeget azért mondjuk azt köszönöm hogy nem kiemelve cikizve mondtad csak meg említetted. (Tényleg köszönöm :) ).","replies":[{"poster":"M4dr4c","date":"2015-05-26T08:24:42.097+0000","up_votes":1,"down_votes":0,"body":"Nem olyan vészes a helyesírásod. A fő hiba az, hogy nem tudod hova kell tenni a vesszőket, de azt hiszem ez a legáltalánosabb gond az embereknél, inkább tippelném az oktatási rendszer hibájának emiatt.\nAmit kiemelnék az nem helyesírási hiba és ez a manna. A manna az istenek eledele, míg a mana az amiből varázsolunk. Gyanús, hogy ez épp a helyesírás ellenőrző bűne és elsőre jól írtad. :D\nA mostaniban tényleg van egy hiba, megint egy olyan, amit a helyesírás ellenőrző szerintem nem talál meg, a beütöttem egy szó. De míg csak annyi hibád van egy-egy posztban addig nincs miért szégyenkezned, szóval ne aggódj. :)","replies":[{"poster":"Szurony","date":"2015-05-30T22:00:39.028+0000","up_votes":1,"down_votes":0,"body":"Köszönöm nem gonosz válaszodat/kritikádat.","replies":[]},{"poster":"Tetth","date":"2015-05-27T08:54:06.050+0000","up_votes":1,"down_votes":0,"body":"*helyesírás, megpróbálni. Jó hogy nem találja meg a hibakereső mivel külön szavak ként úgy ahogy értelmesek de mondatban így nem. Nincs mit, nem vagyok idegeskedő kötekedő fajta, csak tudja szúrni a szemem a dolog.","replies":[{"poster":"M4dr4c","date":"2015-05-27T09:35:43.291+0000","up_votes":1,"down_votes":0,"body":"És a megemlítetted. De felületesek vagyunk...","replies":[]}]}]}]},{"poster":"M4dr4c","date":"2015-05-25T18:03:53.743+0000","up_votes":2,"down_votes":1,"body":"Nézd, ez már a második teljesen felesleges topikja ma, az első ráadásul hamis adatokra támaszkodott. A helyesírásról meg már nem is merek szólni, mert megint jön Győzike és jól megvédi a pácienst.","replies":[{"poster":"Darzylem","date":"2015-05-25T18:53:09.676+0000","up_votes":3,"down_votes":5,"body":"Lehet, de legalább nem azon élem ki magam, hogy másoknak a fűszálait kezdem el ki kezdeni amikor te magad sem vagy patyolat tiszta. Csak persze neked meg kell felelni neked senkinek sem. Gondolom valamilyen cionista leszármazott vagy azoknak van ehhez hasonló \"szabad elvű\" gondolkodásuk. További szép napot a \"tartalmas\" életedhez.\n\nNa meg persze a témához szólva is egy kicsit mert inkább fektetek erre energiát mint egy internethuszárral száj karatézzak aki szerint én egy szar ember vagyok mert a fórumról mindent meg tud állapítani. Szerintem első sorban ezért mert egy nem mannás hősnek sokkal kevesebb mindenre kell figyelnie, jóval nehezebb kiegyensúlyozni egy ilyen stílusú játékban mint egy mannás hőst.","replies":[{"poster":"M4dr4c","date":"2015-05-25T19:27:48.795+0000","up_votes":2,"down_votes":2,"body":"Utoljára reagálok hozzászólásodra ebben a témában. Ha akarod védd az igénytelenséget, a te dolgod. Sose mondtam, hogy hibátlan vagyok. Nem is egy szóismétlésbe vagy vesszőhibába kötök bele, hanem olyan kritikán aluli szövegekbe, hogy azonnali bukás járna érte még általános iskola 3. osztályában is.\nArról meg, hogy én kit, hogy ítélek meg a kevéske infó alapján igazán nem köthetnél bele, mert ugyanezt csinálod, csak sokszor még jobban eltúlozva.\nJó szórakozást az igénytelenséghez Győzike. Fogyaszd egészséggel.","replies":[{"poster":"Tetth","date":"2015-05-27T08:55:01.601+0000","up_votes":1,"down_votes":0,"body":"Mennyire igazad volt. :D Nem hittem hogy valaki tényleg jön a \"győzike\" szerepre. xD","replies":[]}]}]},{"poster":"Tetth","date":"2015-05-25T18:49:09.714+0000","up_votes":1,"down_votes":0,"body":"True story","replies":[]}]}]},{"poster":"Looter","date":"2015-05-25T17:28:31.010+0000","up_votes":2,"down_votes":0,"body":"Minden karakter ami nem használ manát, hp t, energiát, op mivel az egyetlen egy dolog amire figyelniük kell az a hp juk mennyisége és így bármennyi ideig a csatába maradhatnak.","replies":[]},{"poster":"mmateexd","date":"2015-05-25T17:32:00.959+0000","up_votes":1,"down_votes":0,"body":"Rivennek és Katának is kellene valami erő forrás de mind1...az ilyen hősök vesznek egy kis cd-t és darálnak :)","replies":[]}]}