{"poster":"Tim844","date":"2016-09-19T12:49:51.909+0000","title":"Fragen bezüglich des Itembuilds an Lulu Spieler(Mains)","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hey!\r\nIch habe eine Frage bez&uuml;glich des Itembuilds von Lulu.\r\nIch wei&szlig; nicht genau, ob ich nun Athenes oder Ardent Censer baue, ob ich beides baue und wenn, welches ich zuerst baue.\r\nIst mein erstes Item nach Sightstone Athenes oder ardent censer?","replies":[{"poster":"Zovers","date":"2016-09-20T12:18:40.146+0000","up_votes":1,"down_votes":0,"body":"http://www.probuilds.net/champions/details/Lulu","replies":[]},{"poster":"Ritual of Tsuru","date":"2016-09-19T14:11:45.114+0000","up_votes":1,"down_votes":0,"body":"Hallo :) \nAlso ich maine Lulu seit 1,5 Jahren und ich muss ehrlich sagen, ich baue sie selten mit eins der beiden.\nAnfangs habe ich oft Athenes gebaut, das ist gerade zur Zeit eigentlich gar nicht mal schlecht durch deine Schilde etc. Also das würde ich dir auf jeden Fall empfehlen.\nIch konzentriere mich jedoch mehr auf Items wie Locket of the Iron Solari oder Gefrorenes Herz, ich habe da so meine eigenen Itembuilds. ^^\nArdent ´kannst du bauen, finde ich persönlich aber besser auf Soraka. Auf Lulu benutze ich das weniger.","replies":[]},{"poster":"Grαce","date":"2016-09-19T14:11:00.361+0000","up_votes":1,"down_votes":0,"body":"Es kommt immer auf die Situation an. Ich persönlich baue gerne Mikaels, weil fast jede ordentliche Team Komp CC drauf hat. Ansonsten baue ich den Rauchbrenner weil er durch den Bonus DMG praktischer ist. Athenes zahlt sich mMn auf Lulu nicht mehr aus da Riot ja mit den letzten Änderungen ihren Schaden ziemlich verringert haben. Je nach Vorliebe kannst du das aber auch gerne bauen, wie man möchte ^^.\n\nUnd fixier dich nicht auf eine bestimmte Item Build Reihenfolge, oft ist es praktischer wenn du das Iron Locket zuerst baust weil die Gegner full ap sind oder der AP Midlaner schon sehr gefeedrt ist usw.. Bau das was dir grade am sinnvollsten erscheint oder frag dein Team wennn du dir nicht sicher bist. \n\nLg Krallensturm","replies":[]},{"poster":"RyzeCanKillYou","date":"2016-09-19T14:52:11.432+0000","up_votes":1,"down_votes":3,"body":"einfach das bauen was vorgelegt ist\nidk what is so hard","replies":[]}]}