{"poster":"Tim844","date":"2016-10-04T17:10:24.062+0000","title":"Steige ich auf, wenn ich NUR Janna in Silber spiele?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Hey!\r\nIch liebe Janna und da die meisten Profi Spieler meinen, dass man nur ein Champion spielen sollte.\r\nIch habe daher vor,  nur Janna zu spielen.\r\nWenn ich meinen ADC fed bekomme und ihn im Teamfight gut genug zu sch&uuml;tzen, m&uuml;sste ich ja eigentlich steigen k&ouml;nnen.\r\nPS: Habe 60 Games mit Janna und eine Winrate von 60%","replies":[{"poster":"RAG Ryve","date":"2016-10-05T05:11:06.597+0000","up_votes":2,"down_votes":0,"body":"Ob ihr wirklich richtig steht, seht ihr wenn der Flame los geht!","replies":[]},{"poster":"MeMyselfandBaal","date":"2016-10-04T19:22:59.994+0000","up_votes":1,"down_votes":0,"body":"Janna ist halt ein grundsolider Champion, der immer seinen Platz in der Meta haben wird. Unabhängig von irgendwelchen Tweaks, Nerfs oder Meta-Veränderungen. Dafür ist ihr Disengage einfach zu gut... Von daher ist sie definitiv gut geeignet zum Aufsteigen, da du nicht davon ausgehen musst, dass sie tot generft wird... Oder dein ADC einfach nicht damit klar kommt, wie man mit einer Janna an seiner Seite spielen sollte...\n\nDas Problem ist halt auch... dass sie nur Disengage und Schilde kann... Stumpf ist da gerade in der Laning Phase Trumpf... Aber wenn du damit kein Problem hast.","replies":[{"poster":"xinf3ct3d","date":"2016-10-04T22:36:43.747+0000","up_votes":1,"down_votes":0,"body":"Ich kann dem nur zustimmen. Aus Supportersicht kann ich sagen dass man bei Janna nicht viel Falsch machen kann. Das Kit ist mehr als einfach, jedoch empfehle ich nicht Janna zu Onetricken, sondern Janna zu präferieren aber wenn du ne Vayne als Adc hast ist Janna halt Bullshit","replies":[{"poster":"Mariju Janna","date":"2016-10-04T23:02:20.322+0000","up_votes":2,"down_votes":0,"body":"Bullshit man janna und vayne ist eine der besten kombos überhaupt frag mal paar gute spieler oder sogar pro vayne spieler wie gosu wollen immer ne janna haben wenn die vayne spielen","replies":[{"poster":"xinf3ct3d","date":"2016-10-08T18:42:31.901+0000","up_votes":1,"down_votes":0,"body":"Wenn du meinst. Das mit Janna+Vayne ist meine Persönliche erfahrung. Die Meisten Vaynes die ich anfangs mit Janna Supportet hab haben einfach nur gesuckt und oft sah es danach aus als hätte ich ihr nich helfen können, obwohl weder ich noch Vayne nen Fehler gemacht haben oder boostet waren","replies":[{"poster":"Nohgolgh","date":"2016-10-08T19:15:11.580+0000","up_votes":1,"down_votes":0,"body":"Ich habe mal eine zeitlang mit Janna gespielt, auch mit und gegen Vayne. Janna und Vayne ist eine gute Kombo, aber in der niedrigen Elo geht sie oft nicht so auf, weil die Leute nicht wissen, wann sie stark sind. Janna und Vayne skalieren beide gut ins Late, aber Vaynes early ist schlecht und Janna hat auch nicht die Megapressure. Wenn beide richtig spielen, kann Janna praktisch die ganze Killpressure des Gegners rausnehemen und auf der Lane passiert einfach nichts. WENN. Leider stelle ich fest, dass gerade Vaynespieler gerne dazu neigen, ihr Early hoffnungslos zu überschätzen und beispielsweise gegen eine Lucian-Thresh-Botlane früh zu kämpfen. Und dann bekommst du mit Janna Probleme. Dein Carry kämpft in einer Situation, in der er nicht kämpfen darf, und du kannst nicht beleibig viel Schutz zur verfügung stellen. Trotzdem ist sie definitv einer der besseren Supports für Vayne. Engage-Supports wie Leona und Alistar finde ich auf Vayne viel viel schlechter, weil Vayne wie gesagt der Schaden fehlt. Poke-Supports sind nach meinem Gefühl auf der Lane etwas stärker, da sie die mangelnde Pressure einer Vayne ausgleichen können, aber in Teamfightsituatuionen sind die Utility-Supports deutlich stärker, da sie ihren Hypercarry wesentlich besser schützen können. Janna hat mit ihren Schilden und ihrem Heal und eine Locket und einem Mikaels und einem Censer eine Schildkraft/Heilkraft von über 2000 Leben in einer Rotation. Sie verdoppelt damit das Leben ihres Carries und mit der Mastery im Intelligenzbaum kommen noch Defensivwerte dazu. Das ist gerade für Vayne nützlich, die über recht wenig Reichweite verfügt. \n\nWenn es mit Janna zu Toden in der Laningphase kommt, dann hat vermutlich doch wer einen Fehler gemacht. Meist ist es frühe Agression gegen eine Lane, die man nicht agressiv spielen sollte. Vayne suckt meiner Meinung nach momentan recht stark. Viele andere Hypercarries haben deutlich bessere Laningphasen und sind im Late nicht mal unbedingt schwächer. Meine Hypercarryliste ohne Kog Maw (habe ihn nach Rework nicht mehr gesehen) ist derzeit:\nIm Late:  \n{{champion:18}}> {{champion:222}}> {{champion:51}}> {{champion:29}}> {{champion:67}}> {{champion:22}} \n\nAlle Hypercarries haben mehr Range als Vayne (bzw. können sich mit einer Fähigkeit zusätzliche Reichweite holen) und ebenfalls eine Fähigkeit, um massiv Schaden zu generieren (Caitlyns Passive, Jinx Q und Q-Passive, Tristana E und E-Passive, Twitch R und E, Ashe Q ) sowie -mit Ausnahme von Twitch- harte CC und/oder einen verlässlichen Escape im Kit. Ashe ist nun nach endlosen Nerfs hinter Vayne. \nIm Lanen: \n{{champion:51}} >{{champion:222}} >{{champion:22}} >{{champion:18}} >{{champion:29}} >{{champion:67}} \nCaityn, Jinx und Tristana sind recht gut im pushen und können zumeist verhindern zu sehr unter den eigenen Turm gedrückt zu werden. Hinzu kommt, dass Cait ein sehr starkes Early hat. Cait, Ashe und Jinx können auf hohe Reichweite poken. Tristanas Bombe und Twitchs Gift helfen, falls es mal wieder länger dauert. Vayne fehlt für das frühe Traden hingegen einfach das Kit.","replies":[{"poster":"xinf3ct3d","date":"2016-10-11T18:50:52.102+0000","up_votes":1,"down_votes":0,"body":"Stimmt schon du hast Recht. Ich hasse diese Vaynes die immer versuchen zu fighten weil sie 15 cs (=1 Dolch 12% AASpeed) vorne sind und 1 Kill durch nen Guten Gank haben und dann die Lane komplett throwen weil sie meinen Fighten zu müssen. Meistens Pinge ich sie zurück aber dann sterben sie schon durch einen Sona stun.Im Chat steht dann : report Blitz for no Follow...","replies":[]}]}]}]},{"poster":"MeMyselfandBaal","date":"2016-10-05T02:10:59.660+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xinf3ct3d,realm=EUW,application-id=Wj1wcocU,discussion-id=7J0n9E6L,comment-id=00050000,timestamp=2016-10-04T22:36:43.747+0000)\n>\n> Ich kann dem nur zustimmen. Aus Supportersicht kann ich sagen dass man bei Janna nicht viel Falsch machen kann. Das Kit ist mehr als einfach, jedoch empfehle ich nicht Janna zu Onetricken, sondern Janna zu präferieren aber wenn du ne Vayne als Adc hast ist Janna halt Bullshit\n\nalso ganz ehrlich... solange du nicht nach Platin willst, sind solche Sachen ziemlich egal. Also das erste Mal, dass ich überhaupt darüber nachgedacht habe, was eigentlich zu meinem Team passt, war letztes in Gold 2 und danach war ich auch ziemlich schnell Platin. Vorher konnte ich einfach nur spielen, was ich selber beherrsche und meinem Team trotzdem ausreichend helfen...\nAlles, was unter Platin ist, wird meiner Erfahrung nach nicht durch Kompositionen entschieden, sondern dadurch, wer seinen Champion besser beherrscht und weiß, was mit diesem zu tun ist... und ja, das gilt auch noch für die Riven, Kindred, Zed, Vayne Komposition (auch wenn es da schon kritisch wird...)","replies":[{"poster":"xinf3ct3d","date":"2016-10-08T18:43:59.169+0000","up_votes":1,"down_votes":0,"body":"Naja, ich hab keinen Bock Blitzcrank zu spielen wenn mein Adc sagt er will safe farmen.","replies":[]}]}]}]},{"poster":"Flüssigsubstanz","date":"2016-10-04T18:10:35.690+0000","up_votes":1,"down_votes":0,"body":"****Solange du eine Positive winrate beibehälst wirst du IMMER irgendwann aufsteigen.****\n\nAuch wenn ich persönlich nicht so der fan von Janna bin, sondern eher so ein thresh/bard fan bin weil playmaking supports für mich mehr sinn machen um zu carrien.\nIch will damit nicht sagen das Janna schlecht ist, aber Janna kann halt \"nur\"  peelen und shielden, bietet sonst weiter keinen so verlässlichen cc (tornado braucht zu lange um wirklich nen effektiver cc zu sein und ulti ist eigentlich nur zum disengagen da) wo du vielleicht durch roamen punkten könntest oder durch treffen von CC die lane gewinnen könntest.\nIch finde such dir am besten ,falls du nichtmehr weiterkommen solltest, nochn ADC premade und dann dürfte dir schon nichts im wege stehen mit Janna.","replies":[{"poster":"xinf3ct3d","date":"2016-10-04T22:38:55.956+0000","up_votes":2,"down_votes":0,"body":"Janna kann auch Carrien, glaub mir. Ich hab mit dem Tornado schon so manch eine LeBlanc oder einen Zed Outplayed wenn sie Towerdiven wollten. Janna hat halt andere Schwerpunkte","replies":[{"poster":"Flüssigsubstanz","date":"2016-10-04T23:00:43.670+0000","up_votes":1,"down_votes":0,"body":"Das hab ich ja auch nicht bestritten, ich will nur damit sagen das es damit schwieriger ist. Ums mal so zusagen, das typische szenario wie das hier häufiger leute bezeichnen \"Öh meine botlane feedet alle feeden wein wein etc.\" was kann man dagegen als support machen bzw wie kann man damit helfen? Roamen. Jetzt vergleich mal einen Janna roam mit einen Thresh/Bard/Alistar roam. \n\nWie gesagt ich habe nicht behauptet das Janna nicht dazu in der Lage wäre ein outplay zu machen oder alleine zu carrien, aber es ist halt einfach schwieriger. Der Tornado hilft nur unaufgeladen gegen die bereits genannten dash/all in/channel ability champions da du damit den schaden von, wie du als gutes beispiel sagtest, Leblanc fast über der hälfte negieren kannst. Voll aufgeladen triffst du den äußerst selten, wenn die gegner nicht laggen und ein halbes hirn besitzen, deswegen nenn ich das einfach nichtmal, auch wenn ein voll aufgeladener Tornado verherrend sein kann.\nSonst hat sie noch ihren tornado zu bieten der auch gut einsetzbar ist mitner flashkombo aber in 90% der fälle zum disengagen/peelen deines ADC's genutzt werden sollte und nicht um damit zu roamen und irgendwelche wunder wirken zulassen. \nWie gesagt Janna ist weniger ein playmaker sondern mehr ein peel/shield bot für den jeweiligen ADC. Sie ist dazu in der lage plays zu machen, wie wahrscheinlich jeder supporter, aber ist halt nicht so gut dadrin. Es sei denn du hättest mit Janna keinen CD auf flash und könntest das immer mit deiner ulti kombinieren.","replies":[{"poster":"eingew","date":"2016-10-05T06:31:29.368+0000","up_votes":1,"down_votes":0,"body":"> Ums mal so zusagen, das typische szenario wie das hier häufiger leute bezeichnen \"Öh meine botlane feedet alle feeden wein wein etc.\" was kann man dagegen als support machen bzw wie kann man damit helfen? Roamen. Jetzt vergleich mal einen Janna roam mit einen Thresh/Bard/Alistar roam.\n\nNormalerweise feedet eine Botlane mit Janna als Sup nicht rein. Natürlich hat man auch mal schlechte Starts, natürlich gibt man auch mal 1/2 Tode ab... aber richtiges Feeden ist mit Janna gar nicht mal so einfach, weil sie einfach so unglaublich viele Fehler verzeiht.\n\nDu hast abgesehen davon natürlich recht, ein Janna Roam als Offensive ist meistens ziemlicher Müll.\n\nJanna ist eben kein Offensiver Champ. Aber Janna kann eines perfekt: Engages countern. Wenn man also mit Janna roamt, dann bekommt man den Maximalen Gewinn, wenn man das mit einem gegnerischen Gank auf der Midlane abstimmt. \n\n> Voll aufgeladen triffst du den äußerst selten, wenn die gegner nicht laggen und ein halbes hirn besitzen, deswegen nenn ich das einfach nichtmal, auch wenn ein voll aufgeladener Tornado verherrend sein kann.\n\nBeim Tornado geht es auch nicht darum ihn aufzuladen. Das mag nett sein, wenn man mal einen Tower deffen muss oder der ADC noch ein wenig Hilfe beim pushen im Early und Mid braucht. Aber der Tornado ist im Allgemeinen Spiel eher dazu gedacht... Engages zu countern ;) So wie alles in Jannas Kit.\n\n> Wie gesagt Janna ist weniger ein playmaker sondern mehr ein peel/shield bot für den jeweiligen ADC.\n\nDas mag an meinem Stolz liegen, aber ich würde doch sagen, dass Janna mehr als das ist. Gerade die Ulti sollte man nicht einfach so zünden... Und da man den Tornado nicht trifft, wenn man nur hinter dem ADC steht, sie aber gleichzeitig selbst mit 2/3 tanky Items noch relativ Squishy ist, reicht es nicht, einfach Sinn- und Hirnbefreit irgendwo vor dem ADC rumzugurken... das wird in vielen Toden enden.\n\n> Es sei denn du hättest mit Janna keinen CD auf flash und könntest das immer mit deiner ulti kombinieren.\n\nIm Early ja, im Late habe ich spätestens mit dem Gelben Supportitem und noch dazu mit meinen Boots locker genug MS um auch mal einen Udyr alt aussehen zu lassen... Du kannst vor Janna nicht wirklich weg rennen.\n\nJanna countert Engages. Und wenn ich mir die Sachen so ansehe, gegen die man normalerweise spielen muss, dann ist das eine relativ starke Sache.","replies":[{"poster":"xinf3ct3d","date":"2016-10-08T18:47:02.774+0000","up_votes":1,"down_votes":0,"body":"naja, wenn der eigene Adc von nem Blitz geholt wird ist er geschichte, auch mit ner Janna","replies":[{"poster":"eingew","date":"2016-10-09T10:55:29.125+0000","up_votes":1,"down_votes":0,"body":"Das kommt auf den Zeitpunkt an. Wenn ich reinflashen kann und die Gegner noch nicht allzu gefeedet sind krieg ich mit meiner Ulti und nem Shield manchmal noch einen Spieler gerettet.\n\nAber in den allermeisten Fällen hast du wohl recht.","replies":[]}]},{"poster":"Flüssigsubstanz","date":"2016-10-05T09:29:56.015+0000","up_votes":1,"down_votes":0,"body":">Normalerweise feedet eine Botlane mit Janna als Sup nicht rein. \n\nWie du schon selbst sagtest passiert das aber trotzdem ab und zu mal. Es kann immer mal 1-3 misplays passieren wo der ADC oder sogar vielleicht du als Janna was falsch machst und dann stehst du da. Bist noch auf dein jungler oder midlaner angewiesen das die hoffentlich mal ganken oder das die gegner auch mal nen fehler machen. Wenn man denn keine ganks bekommt hat man die laningphase seines lebens am tower und vielleicht ab und zu mal das risiko eingehen nen deep ward mit Janna zu setzen.\n\n>Beim Tornado geht es auch nicht darum ihn aufzuladen. \n\nHabe ich auch gesagt, weil das nur zum disengagen wirklich gut ist.\n\n>Das mag an meinem Stolz liegen, aber ich würde doch sagen, dass Janna mehr als das ist. \n\nDas mit Janna als bot klingt zwar fies, aber war auch nur spaßig gemeint weil du halt nunmal nicht wirklich viel machst, zumindest nicht soviel wo du dir denkst \"ich habe gecarried\". Klar im gesamtbild wenn man sehen könnte wieviele engages du verhindert  hast und wieviel damage deine schilde gegeben und absorbiert hätte ist das schon viel, aber ich vergleich das mal mitner Soraka, bei ihr fühlst du dich in den meisten fällen auch nicht so als hättest du gecarried weil dein silence zwar effektiv aber nicht so wirklich den \"BABUUM\" effekt hat. Janna hat zwar dank ihrer ulti nen besseren \"BABUUM\" effekt als Soraka aber sonst halt nichts.\nVielleicht liegt das daran das ich an Thresh/Alistar/Bard gewöhnt bin, die fürs engagen, disengagen und roamen sehr gut sind, und deswegen mehr spannung überall macht. Ich hab aufjedenfall mehr das gefühl was gerissen zu haben wenn man eine gute Bard ulti landet zum engagen, mit alistar ne 3man Q+W kombo trifft oder wenn man als thresh den entscheidenden hook auf einen Carry landet, als wenn ich einen engage verhindere oder ich meinen ADC einen schild gebe.\nDie einzigen sachen die mir als Janna spaß macht ist die ulti und das man dank der passiven so schnell fliegt und durch den ganzen disengage möglichkeiten sich ohne viel gedanken nen mejais holen kann weil man schon recht schwer mit der sterben kann. Das ist aber auch nur meine persönliche Meinung.\n\n>Im Early ja, im Late habe ich spätestens mit dem Gelben Supportitem und noch dazu mit meinen Boots locker genug MS um auch mal einen Udyr alt aussehen zu lassen... Du kannst vor Janna nicht wirklich weg rennen.\n\nBeim umher fliegen geb ich dir völlig recht, trotzdem gibt es ohne flash genug reaktionsmöglichkeiten  dagegen, zumindest wenn wir jetzt über das \"engagen\" mit Janna ulti reden. Als dein beispiel udyr könnte er dich einfach stunnen während du versuchst hinterher zu gehen um mit deiner ulti einen \"engage\" zu machen, ausserdem gibt es sicherlich noch andere leute in der nähe die das auch verhindern können, sei es durch nen assassine der dich killt bevor du überhaupt reagieren kannst oder nen utility champ/support der dich slowt/stunned und davon abhält.\nWenn wir jetzt aber vom chase potential reden gebe ich dir recht kann man ganz gut leuten hinterher rennen, aber es dauert halt trotzdem eine weile bis man da ist mit keinen cc weil der tornado beim chasen noch viel weniger trifft und du wenn du deinen W einsetzt dein movementspeed verlieren würdest. Generell gibs da auch ne gute rede, das man Singed nicht chasen soll, dasselbe könnte man für Udyr auch sagen. Da du, bis man da ist, trotzdem wahrscheinlich mehrere minuten \"verschwendet\" hat.\n\nSonst weiter wie gesagt, ich habe nichts gegen Janna spieler ich habe auch niemals gesagt das man mit Janna nicht SoloQ gewinnen kann ich habe nur gesagt das es mit ihr, allgemein betrachtet, mit jeglichen möglichen situationen vorhanden, weniger leicht ist als mit den anderen bereits genannten Supports.\n{{sticker:slayer-jinx-wink}}","replies":[]}]}]}]}]},{"poster":"Mariju Janna","date":"2016-10-04T17:36:49.642+0000","up_votes":2,"down_votes":0,"body":"Klar nichts ist unmöglich ich find gerade in lol wenn du einen champ gut kannst bringt das unheimlich viel klar kannst du nicht immer gewinnen aber wenn du sie so magst dann spiel sie einfach ob du mit ihr weiterkommst ist ne andere sache. \nAnsonsten ist glaub ich wichtig wenn du mit janna reingehen willst sag es deinem adc oder ping den gegner an. \nEin freund von mir der dia 1 letzte season war hat so eine gute janna der hat mich als adc fed bekommen was sonst keine janna schaffte zu der zeit war ich noch wesentlich schlechter als Adc er war mit mir im ts und hat mir immer gesagt los wir können jetzt rein und er hatte immer recht und wir haben die engages dann gewonnen.\nVielleicht findet sich hier ja noch ein Janna Main der dir Tipps geben kann.","replies":[]},{"poster":"haha weed lol xd","date":"2016-10-05T08:04:08.355+0000","up_votes":1,"down_votes":4,"body":"Janna braucht weder Skill noch Hirn um zu gewinnen also perfekt für Freelo :)","replies":[{"poster":"xinf3ct3d","date":"2016-10-08T18:49:19.927+0000","up_votes":2,"down_votes":0,"body":"Janna braucht wahrscheinlich mehr Skill als du denkst. Deine Tornados gehen alle in die Pampa wenn du niht predictest","replies":[]}]},{"poster":"InNeedOfWombat","date":"2016-10-05T05:33:01.979+0000","up_votes":1,"down_votes":0,"body":"Ich bin ADC-Haupt und suche noch einen Supporter :3 Wenn du Lust hast schick mir einfach eine Freundscahftsanfrage.","replies":[]},{"poster":"M Λ D Λ R Λ","date":"2016-10-04T17:27:24.251+0000","up_votes":1,"down_votes":0,"body":"Man KANN aufsteigen wenn man nur Janna spielt. Ob du wirklich aufsteigst liegt dann an dir. Du musst bereit sein dazu zu lernen, ansonsten kannst du auch nach 5000 Games mit Janna noch in Silber stecken.\n\nEs gibt ein Video über einen Rengar Main, mit über 2 Millionen Mastery Points auf Rengar. Als das Video rauskam war er noch Bronze mit 1500 Rengar Games in dieser Season.\n\nAlso geh nicht davon aus dass du aufsteigst nur weil du nur noch einen Champ spielst. Versuch aktiv besser zu werden.","replies":[]},{"poster":"TerrorRaven","date":"2016-10-04T17:14:41.399+0000","up_votes":1,"down_votes":0,"body":"Wenn du gut genug bist, kannst du mit jeden Champ aufsteigen.","replies":[]},{"poster":"HinchMajor","date":"2016-10-04T17:53:46.892+0000","up_votes":1,"down_votes":1,"body":"Hab gehört Bard Jgl ist gut","replies":[]},{"poster":"xinf3ct3d","date":"2016-10-04T22:42:21.548+0000","up_votes":1,"down_votes":6,"body":"Ich würde Supporter generell nie Onetricken, weil man nicht vergessen sollte,  dass man da ist um seinem Adc zu helfen. Wenn man ne Vayne hat, ist man Praktisch Useless für den Adc, weil Vayne nichts mit den Ad Werten vom Schild Anfangen kann und Vayne kann auch mit dem E für sich peelen.","replies":[]}]}