{"poster":"McNuggzV2","date":"2014-12-04T10:39:32.341+0000","title":"can any one not log on to league right now?","subforum":"[ARCHIVED] Help & Support","up_votes":29,"down_votes":0,"body":"is any one not being able to log on to leauge? it just keeps giving me the loggin erorr mesage and a page to go to with reasons why, but i was just on the servers disco every one now i cant log on","replies":[{"poster":"Tsukasuke","date":"2014-12-04T10:51:51.829+0000","up_votes":11,"down_votes":0,"body":"Oh shucks, looks like someone might've actually baked the potato the servers ran off of.","replies":[]},{"poster":"SpaceClown","date":"2014-12-04T15:38:20.061+0000","up_votes":7,"down_votes":0,"body":"5 hours later{{summoner:3}}","replies":[{"poster":"Diophantus91","date":"2014-12-04T16:07:27.039+0000","up_votes":4,"down_votes":0,"body":"Ha!","replies":[]}]},{"poster":"McNuggzV2","date":"2014-12-04T10:44:01.425+0000","up_votes":5,"down_votes":0,"body":"is no one els having this problem? i cannot connect to any accounts","replies":[]},{"poster":"McNuggzV2","date":"2014-12-04T11:28:10.199+0000","up_votes":4,"down_votes":0,"body":"who knows be nice for riot to say somthing on the forums","replies":[{"poster":"SpaceClown","date":"2014-12-04T12:59:12.281+0000","up_votes":2,"down_votes":0,"body":"They literately never say anything regarding this kind of issues","replies":[]}]},{"poster":"gratchhh","date":"2014-12-04T17:34:02.218+0000","up_votes":5,"down_votes":1,"body":"Riot has finally admitted there are issues\n\nhttp://status.leagueoflegends.com/#na","replies":[{"poster":"speezus","date":"2014-12-04T17:51:56.535+0000","up_votes":1,"down_votes":0,"body":"it's fixed for me! {{champion:18}}","replies":[]}]},{"poster":"Mad King Matt","date":"2014-12-04T15:20:21.488+0000","up_votes":3,"down_votes":0,"body":"Bump i have been trying for the past 2 hours before finding this thread","replies":[]},{"poster":"K00Ki3S","date":"2014-12-04T15:07:30.435+0000","up_votes":3,"down_votes":0,"body":"League of Legends Player Support\nTo\tme Today at 8:59 AM\nThis message contains blocked images.\nShow Images Change this setting\n##- Please type your reply above this line -##\nHey Dawnshairsalon,\nJust wanted to let you know that I’ve updated your request (#15090150). Just reply to this e-mail or click the link below to add any additional comments.\nhttp://support.riotgames.com/hc/requests/15090150\nsaisei\t\nsaisei (Riot Games Player Support)\nDec 04 06:58\n\nHey Summoner,\n\nI'm sorry to hear that you're unable to log in to your account. No worries, I'll try my best to help you solve this issue as soon as possible.\n\nBefore I can proceed, I need you to provide me a screenshot of the error so I can determine on what's causing the problem.\n\nYou can obtain a screenshot out-of-game through the following steps:\n\n- Press Print Screen\n\n- Open MS Paint\n\n- Paste the screenshot onto MS Paint\n\n- Save it as a .jpg or .png file.\n\nLooking forward for your reply!\n\nsaisei \nRiot Games Player Support\nMid Laner\n\nDawnshairs\t\nDawnshairsalon\nDec 04 06:41\n\nyou know the thing is that you cant get a hold of anyone to get help with this and so we sit and wait for a reply or a fix to the problem and no response omg why is that. You should at least have someone to talk to.\n\nDawnshairs\t\nDawnshairsalon\nDec 04 06:34\n\njust read about this happening but the date was on february now what\n\nDawnshairs\t\nDawnshairsalon\nDec 04 06:19\n\nnow both of our computer are no able to connect to pvp.net\n\nDawnshairs\t\nDawnshairsalon\nDec 04 05:55\n\nhas my account been compromised\n\nDawnshairs\t\nDawnshairsalon\nDec 04 05:55\n\ni have uninstalled LOL and reinstalled I have checked my internet connection restarted and shut down my computer changed my password try my other acct and no log in what is going on.. this is so frustrating.\n\nDawnshairs\t\nDawnshairsalon\nDec 04 04:40\n\ncant sign in\n\nThis email is a service from Riot Games Player Support. Sent by Riot Games.","replies":[]},{"poster":"SpaceClown","date":"2014-12-04T14:34:47.275+0000","up_votes":3,"down_votes":0,"body":"Please, Riot. I just wanna play vidya gayme","replies":[]},{"poster":"Altkee","date":"2014-12-04T13:25:39.210+0000","up_votes":3,"down_votes":0,"body":"OMG so its not only me thank the lord iv been trying to fix for the past 2 hours....","replies":[]},{"poster":"McNuggzV2","date":"2014-12-04T10:53:40.308+0000","up_votes":3,"down_votes":0,"body":"i still cannot get on any account and it does not even recognize that i have changed to an account  it just keep going back to the one i got disco on","replies":[]},{"poster":"Tsukasuke","date":"2014-12-04T10:47:32.359+0000","up_votes":3,"down_votes":0,"body":"Me and a friend are having the same issue. I keep getting Connection Error.","replies":[]},{"poster":"CoupDetate","date":"2014-12-05T05:40:36.761+0000","up_votes":2,"down_votes":0,"body":"The packet loss has nothing to do with the Riot servers.  That has to do with the route your taking to get to their servers.  There's a lot of info on boards and google about what the packet loss stuff is all about.  Bottom line, has nothing to do with Riot, and they can't do anything about it.","replies":[]},{"poster":"dArtagnan","date":"2014-12-04T18:02:49.201+0000","up_votes":2,"down_votes":0,"body":"Hey guys,\n\nSorry for not posting in here earlier, 2am was a bit too early >.<  But I wanted to make sure that I posted in here as well regarding the Login Issues we've been facing today.  I recently made a new sticky post outlining what is going on and where you can the get the latest updates about this issue.  Check it out here:\n\nhttp://boards.na.leagueoflegends.com/en/c/help-support/kajsGIQ6-why-cant-i-login-rito-pls","replies":[]},{"poster":"Grinka","date":"2014-12-04T16:39:39.839+0000","up_votes":2,"down_votes":0,"body":"Submitted a ticket for the issue, and I was told that they are getting a high volume of requests atm. Gee, I wonder why?","replies":[{"poster":"speezus","date":"2014-12-04T17:26:11.814+0000","up_votes":2,"down_votes":0,"body":"I submitted one 4 hours ago, haven't gotten a reply besides that initial one.","replies":[]}]},{"poster":"Syncing Virus","date":"2014-12-04T17:08:59.693+0000","up_votes":2,"down_votes":0,"body":"all mine does is log on but loads at that screen then says connection failure.. all my stuff is fine but everything is up and running. my feeling is someone might be Ddosing the server or theres a bug in the system or im just to high..","replies":[]},{"poster":"AliFromCairo","date":"2014-12-04T17:07:27.339+0000","up_votes":2,"down_votes":0,"body":"Logged in about 6 hours ago, got disconnected at loading screen and havent been able to log in since.  Troubleshot with internet service provider and McAfee, not an internet connection issue or firewall issue.  Can connect to Oceania server but unable to connect to NA server.  Have an open ticket to support at the moment, no response as of yet.","replies":[]},{"poster":"Rai5788","date":"2014-12-04T17:00:43.648+0000","up_votes":2,"down_votes":0,"body":"Im having the same problem. I can login to EUW but not to NA. Also I tried from a different computer. It didnt work. So I'm pretty sure it's no firewall and no computer problem. Did anyone find a fix to this already?","replies":[]},{"poster":"Hanky Spanky","date":"2014-12-04T16:40:01.930+0000","up_votes":2,"down_votes":0,"body":"FIX THIS RIOT! PLEASE IM {{summoner:3}} ED!!!","replies":[]},{"poster":"bosfolife","date":"2014-12-04T11:02:16.661+0000","up_votes":2,"down_votes":0,"body":"Connection Failure: Unable to connect to the PVP.net\nserver.\n\nInformation regarding what may have caused this error\ncan be found *here*\n\nService availability can be viewed on the League of\nLegends Server Status web page.\n\nFIX IT RITO I NEED MUH CRACK!!!!!!!!!!!","replies":[{"poster":"Dagvaar","date":"2014-12-04T16:32:50.981+0000","up_votes":2,"down_votes":0,"body":"> Connection Failure: Unable to connect to the PVP.net\n> server.\n> \n> Information regarding what may have caused this error\n> can be found *here*\n> \n> Service availability can be viewed on the League of\n> Legends Server Status web page.\n> \n> FIX IT RITO I NEED MUH CRACK!!!!!!!!!!!\n\nthey didn't sell as much {{champion:429}} as they though and are unable to pay the **Adobe Air** bill, see the thread below for more clues on what is causing this error by 2 years, a well known issue and they keep toying with us, making us send \"proof\", and asking us to disable our firewall, our ip helper (needed to surf the web) and out sisters too. Fun fact if you disable ip helper you will be unable to browse the web and therefore submit ticket requests, its much like if your ISP tells you that to fix your router you have to cut the ethernet cable. Happy reading:\n\nhttp://boards.na.leagueoflegends.com/en/c/help-support/jb18v1LQ-connection-failure-unable-to-connect-to-the-pvpnet-server","replies":[]}]},{"poster":"Volt Cruelerz","date":"2014-12-04T16:26:07.332+0000","up_votes":2,"down_votes":0,"body":"I'm a member of a facebook group of hundreds of league players from my university.  So far, none of us appear to be able to log in either.","replies":[]},{"poster":"CraxyAlpaca","date":"2014-12-04T16:04:12.650+0000","up_votes":2,"down_votes":0,"body":"Says I can't connect to pvp.net even though I have tried every fix and the server status seems to be up fun times....","replies":[]},{"poster":"Gao 7 n 3 ","date":"2014-12-04T15:37:41.659+0000","up_votes":2,"down_votes":0,"body":"Same issue here.{{champion:32}}","replies":[]},{"poster":"RAGEMODENOW","date":"2014-12-04T15:28:20.808+0000","up_votes":2,"down_votes":0,"body":"For Crying out Loud. Still can not Log On. It would be nice for RIOT to at least respond to its users what the hell is going on.","replies":[]},{"poster":"K00Ki3S","date":"2014-12-04T15:05:09.212+0000","up_votes":2,"down_votes":0,"body":"I have submited a ticket and added several comments I have done everything everyone on google has tried ihope i didnt screw up my system lol...but I have doen it all. Occassionally I have had this problem but this time it so persistent not to connect ...above someone said they needed their fix...I too would like to get my fix  this morning lol well good luck I guess I wait.","replies":[]},{"poster":"Buddha Forever","date":"2014-12-04T15:03:42.521+0000","up_votes":2,"down_votes":0,"body":"I submitted one. Still no word.","replies":[]},{"poster":"K00Ki3S","date":"2014-12-04T14:56:31.139+0000","up_votes":2,"down_votes":0,"body":"yes i have been trying since 6 and still no response no board notices tried all the recommendation and no connections...pvp.net does not connect. omg it is so frustrating and no one is talking.","replies":[]},{"poster":"Altkee","date":"2014-12-04T13:55:18.839+0000","up_votes":2,"down_votes":0,"body":"yea i really wish they would comment on issues more often -_-","replies":[]},{"poster":"uvJ5yeyBz4","date":"2014-12-04T13:45:26.542+0000","up_votes":2,"down_votes":0,"body":"FOUR hours and riot hasn't said a word about this. Please get your shit together","replies":[]},{"poster":"SongofStorm","date":"2014-12-04T13:03:57.407+0000","up_votes":2,"down_votes":0,"body":"Won't let me log in, keeps giving the connection error for some reason......","replies":[]},{"poster":"Elicit MayheM","date":"2014-12-04T17:43:41.293+0000","up_votes":3,"down_votes":1,"body":"Whats going on over there? I remember a time when I had zero problems playing League of Legends. We have been plagued by connectivity issues and server stability issues for months. It seems to get better, then get worse again but I believe whole heatedly that Riot has stopped caring about its community when it comes to these issues. People have been complaining about constant disconnects, micro-stutter lag, connectivity issues, and other things over the past few months. I have experienced some, but not all of these problems. I have uninstalled, deleted, re installed the game. I constantly monitor my own internet connection to make sure its not on my end. I run diagnostics to see if my latency is spiking, and other troubleshooting steps to figure out of its on my end. I have even gone to the point of re-installing windows and proper driver updates. You can not put the blame on anyone anymore, I demand a public statement as to why, with all the millions of dollars this company is worth that you can not resolve simple issues like these. Lack of employees, lack of employee knowledge, hardware issues, connection provider issues, all of that can be dealt with over time. You have had MORE time than necessary during the obvious growing of these issues. I remember playing with 10+ friends, that I knew from outside of league of legends and NONE of them play anymore except me. On a larger scale, i'm pretty sure you will lose more of your player-base if this behavior is not resolved. You're breaking peoples hearts in the process, some people cant wait for a day off from work to play this game and then subjected to this type of nonsense.\n\nPeople will say \"1000 RP\" like you have done in the past. You can have it, spend the money on fixing your internal company issues, and address the public by saying you are sorry.","replies":[]},{"poster":"ImWaterlemonCat","date":"2014-12-06T12:44:36.644+0000","up_votes":1,"down_votes":0,"body":"I pass the \"logging screen\" but get disconnect after one game\nbetter than last week, lol\nI just don't want to be banned bc of being afk\np/s: the lag is real","replies":[]},{"poster":"BugWaifusBest","date":"2014-12-06T09:26:38.419+0000","up_votes":1,"down_votes":0,"body":"League has been out for me since the huge drop around 2-3am EST Thursday. I'm working with support. I'll update if I get any progress.","replies":[]},{"poster":"GaIatic Azir","date":"2014-12-06T06:27:28.126+0000","up_votes":1,"down_votes":0,"body":"some copy paste replies support","replies":[]},{"poster":"GaIatic Azir","date":"2014-12-06T06:27:07.856+0000","up_votes":1,"down_votes":0,"body":"league support rate 2/10 just plain outrageous been ignored for almost a week alrdy","replies":[]},{"poster":"boothsayer00","date":"2014-12-05T18:56:03.121+0000","up_votes":1,"down_votes":0,"body":"i got this same problem, it started about 30 minutes ago and i still cant log in.","replies":[]},{"poster":"Dakaa","date":"2014-12-05T01:54:57.003+0000","up_votes":1,"down_votes":0,"body":"I am able to login but each game I am playing is having massive packet loss.","replies":[]},{"poster":"Mad King Matt","date":"2014-12-04T18:24:56.292+0000","up_votes":1,"down_votes":0,"body":"I got on woot.","replies":[]},{"poster":"AliFromCairo","date":"2014-12-04T17:56:30.823+0000","up_votes":1,"down_votes":0,"body":"Just now able to log on to system.  If only Leaverbuster could differentiate between a ragequit and the servers crashed....maybe someone over at Riot could determine that millions of people didnt ragequite at the exact same time....?","replies":[]},{"poster":"Eambo","date":"2014-12-04T17:56:14.885+0000","up_votes":1,"down_votes":0,"body":"Hi guys,\n\nRiot have just updated that the issue should now be resolved: http://status.leagueoflegends.com/#na\n\n\n> RiotMasterCheese – a few seconds ago\n> We have performed some network configuration changes that appear to have resolved this issue. We will continue to monitor the situation to ensure that everything is working correctly.\n\n> 44 minutes ago\n> RiotMasterCheese — We're aware of problems related to logging into the NA platform and are working with our partner on getting these resolved. Earlier today we experienced issues with a major national backbone provider, causing many players to experience connection issues to our platform. We're also checking the health of our own infrastructure, but at this moment we believe the issue is related to the provider's infrastructure.\n\n\nLooks like it should've been fixed as of a few seconds ago - might be worth trying to get your game on! :-)","replies":[]},{"poster":"Croooow","date":"2014-12-04T17:49:54.704+0000","up_votes":1,"down_votes":0,"body":"I think it works now.","replies":[]},{"poster":"hi im nature","date":"2014-12-04T17:48:55.960+0000","up_votes":1,"down_votes":0,"body":"well guys they are saying they are working on it........now everyone on NA server is having login problems. Let's just hope they fix it fast.","replies":[]},{"poster":"RemIsAmazing","date":"2014-12-04T14:21:33.922+0000","up_votes":1,"down_votes":0,"body":"It's not only Cox internet. It's also Fairpoint (NH)","replies":[{"poster":"SpaceClown","date":"2014-12-04T17:37:43.558+0000","up_votes":1,"down_votes":0,"body":"Skybeam tx\n\nLul","replies":[]},{"poster":"BeastHeadbutt","date":"2014-12-04T16:59:57.357+0000","up_votes":1,"down_votes":0,"body":"And TimeWarnerCable (Maine)","replies":[{"poster":"speezus","date":"2014-12-04T17:24:53.054+0000","up_votes":1,"down_votes":0,"body":"Century Link Utah","replies":[]}]}]}]}