{"poster":"Im Gonna Carry Ü","date":"2017-07-04T12:55:47.629+0000","title":"Rift Rivals 2k17 - CLS Studio","subforum":"Esports","up_votes":5,"down_votes":0,"body":"Hola,\r\n\r\nQuer&iacute;a saber: abrir&aacute;n las puertas en alg&uacute;n momento para ver o presenciar estos matchs en las oficinas de Riot? Algo as&iacute; como para que los fan&aacute;ticos por alg&uacute;n equipo puedan ser realmente hinchas ? Qu&eacute; dir&iacute;a Riot Dwarf si no tuviera como ir al estadio a ver a la gloriosa U ? Al menos por &uacute;ltimo, para que ISG Emp me firme una servilleta.\r\n\r\nDigo, porque al menos NA vs EU va a ser en el EULCS Studio donde SI se permite ir al p&uacute;blico.\r\n\r\nGracias ! Y por favor, habiliten las oficinas para al fin poder asistir hinchadas. Que los deportes electr&oacute;nicos no se queden s&oacute;lo en la pantalla de un simple pc o un celular :)\r\n\r\nBesitos sabor a totolate.","replies":[{"poster":"Riot Maggical","date":"2017-07-04T18:51:49.567+0000","up_votes":2,"down_votes":0,"body":"Hola Im Gonna Carry Ü,\n\nTL;DR: No, los estudios de la CLS no tienen capacidad para tener público en vivo.\n\nLas oficinas de Riot Games en Santiago de Chile no fueron nunca pensadas para tener audiencia en vivo, lo mismo pasa en las otras oficinas alrededor del mundo, la diferencia es que algunas como las que mencionas de NA o EU tienen un estudio APARTE de las oficinas solamente para Esports que permite audiencia.\n\nPor diversos motivos nosotros no estamos aún en esa situación. Es algo que estamos explorando hace un buen tiempo y queremos hacerlo a futuro, pero aún es incierto cuando vamos a dar el paso hacia un estudio independiente y con público.\n\nActualmente tenemos otras prioridades mucho más importantes para la escena que impactan a todo el mundo, y no solamente a los afortunados que vivan en Santiago. También tienen que pensar que a la hora de decidir lo más importante, nuestro foco está en entregar las mejores herramientas posibles a los equipos y jugadores para que suban su nivel, así como también en entregar la mejor experiencia posible de transmisión online, que es algo que impacta a ABSOLUTAMENTE todos los jugadores que tenemos.\n\nPor ejemplo, si tuvieramos 100 para invertir, ¿crees que es más importante para la región invertirlos en un estudio con audiencia en vivo en Santiago o en los equipos de la Copa e infraestructura de transmisión actualmente? Nosotros creemos que es más importante la segunda opción, especialmente pensando en los equipos de CDL por ejemplo que este año recibieron mucho más apoyo.\n\nEsto no quiere decir que a futuro hagamos el cambio a un estudio con audiencia, definitivamente lo tenemos en el horizonte, pero parte de nuestro trabajo es priorizar de acuerdo a los recursos que tenemos para invertir, tanto económicos como humanos.\n\nLas oficinas son un lugar de trabajo, y tienen un área de competencia, pero no poseen un área para el público y definitivamente ya estamos al máximo de capacidad con 6 equipos completos de todas las regiones.\n\nUn abrazo,","replies":[{"poster":"Im Gonna Carry Ü","date":"2017-07-04T20:23:13.050+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=Ky2nrTjR,discussion-id=H6LFNsad,comment-id=0001,timestamp=2017-07-04T18:51:49.567+0000)\n>\n> Hola Im Gonna Carry Ü,\n> \n> TL;DR: No, los estudios de la CLS no tienen capacidad para tener público en vivo.\n> \n> Las oficinas de Riot Games en Santiago de Chile no fueron nunca pensadas para tener audiencia en vivo, lo mismo pasa en las otras oficinas alrededor del mundo, la diferencia es que algunas como las que mencionas de NA o EU tienen un estudio APARTE de las oficinas solamente para Esports que permite audiencia.\n> \n> Por diversos motivos nosotros no estamos aún en esa situación. Es algo que estamos explorando hace un buen tiempo y queremos hacerlo a futuro, pero aún es incierto cuando vamos a dar el paso hacia un estudio independiente y con público.\n> \n> Actualmente tenemos otras prioridades mucho más importantes para la escena que impactan a todo el mundo, y no solamente a los afortunados que vivan en Santiago. También tienen que pensar que a la hora de decidir lo más importante, nuestro foco está en entregar las mejores herramientas posibles a los equipos y jugadores para que suban su nivel, así como también en entregar la mejor experiencia posible de transmisión online, que es algo que impacta a ABSOLUTAMENTE todos los jugadores que tenemos.\n> \n> Por ejemplo, si tuvieramos 100 para invertir, ¿crees que es más importante para la región invertirlos en un estudio con audiencia en vivo en Santiago o en los equipos de la Copa e infraestructura de transmisión actualmente? Nosotros creemos que es más importante la segunda opción, especialmente pensando en los equipos de CDL por ejemplo que este año recibieron mucho más apoyo.\n> \n> Esto no quiere decir que a futuro hagamos el cambio a un estudio con audiencia, definitivamente lo tenemos en el horizonte, pero parte de nuestro trabajo es priorizar de acuerdo a los recursos que tenemos para invertir, tanto económicos como humanos.\n> \n> Las oficinas son un lugar de trabajo, y tienen un área de competencia, pero no poseen un área para el público y definitivamente ya estamos al máximo de capacidad con 6 equipos completos de todas las regiones.\n> \n> Un abrazo,\n\nNingún problema bb, entiendo que no puede asistir público en vivo, pero por último el mini casino con la pantalla gigante ? O algo por el estilo, crear un estilo de concurso para que asistan qué se yo, 15 personas a las oficinas y puedan disfrutar por último, de una máquina arcade si no hay más acceso. Además de obligarlos a llevar cámaras y registrar todo lo que puedan para que la gente se entere de la acogedora experiencia Riot LAS.\n\nBTW, ya leí lo que publicó Riot Mockingbird y habrán Viewing Parties (que definitivamente deberían tener más publicidad, por ejemplo en RRSS como Instagram), lo cuál llena un poco la falta de un estudio, pero no te niego que no llena el vacío, tanto así que no debo ser el único (tanto Chilenos, Uruguayos como Argentinos y últimamente Peruanos) que gustaría de asistir a algo más personal y tener una servilleta autografiada de tu jugador favorito, o el jugador de moda.\n\nEntiendo también y agradezco, el apoyo a equipos de CDL / CLS el cuál se nota un progreso y cambio, pero creo yo (y muy de modo personal) no es suficiente en el aspecto monetario, a mi gusto se necesita un poquito más de coaching, contratación de personal altamente calificado para sacar adelante a la región y no hablo de Rioters, ustedes ya llevan un buen trabajo con la región LatAm, hablo de personal que ya haya pasado por competitivo, coachs con experiencia, por último alguna pasantía por alguna otra región (Aló ISG ? pero pagado por Riot). Esto lo lees en Facebook (grupos) en el chat de Twitch (que ahora gracias a greenvitorn ni se puede hablar xD) en Youtube y ni hablar de Reddit: en LAS/LAN no hay nivel (y ojo, sin desprestigiar a nuestros jugadores que realmente tienen un nivel sobresaliente y pueden llegar a ser mil veces más de lo que son)\n\nLo último es totalmente off-topic, pero quería mencionarlo.\nPD: Sigue subiendo material a instagram, me divierto con tus historias aunque deberías ser más carismático :v jajaj","replies":[]}]},{"poster":"Skgwet","date":"2017-07-04T22:26:53.206+0000","up_votes":1,"down_votes":0,"body":"hola.donde puedo ver los horarios del rift rivals de korea?\nayuda :c","replies":[]},{"poster":"Riot Maggical","date":"2017-07-04T22:15:25.843+0000","up_votes":1,"down_votes":0,"body":"El casino que mencionas, que se suele ver en algunas fotos que publicamos, estará completo con los equipos asistentes y los medios de prensa, y aunque no sea así no tenemos los recursos para traer público. No es sólo abrir las puertas de dejar pasar, es atenderlos, recibirlos, hacerlos pasar un momento único, organizar a los jugadores para que se saquen fotos con ellos, y mil cosas más. Eso se traduce en tiempo, recursos y demás que no tenemos.\n\nNo hace falta discutir en que nos gustaría tener un estudio con público, eso es algo en lo que estamos de acuerdo. Lo que te traté de contar son los motivos detrás de por qué aún no lo tenemos, y por qué no es prioridad actualmente.\n\nLo del apoyo a los equipos, no me refiero a jugadores. Este año se subió el apoyo para el cuerpo técnico, pero no podemos nosotros contratar gente, ahora los equipos tienen esas herramientas y está en ellos usarlas de la mejor manera.\n\nNo me acostumbro a Instagram todavía :) ¡Pero seguiré intentando!","replies":[]},{"poster":"LalaPopo","date":"2017-07-04T13:54:14.105+0000","up_votes":1,"down_votes":0,"body":"seria una buena idea pero no lo haran xd","replies":[]}]}