{"poster":"xFrozenFire3","date":"2015-02-20T00:58:45.271+0000","title":"frustriert/ Zeit sperre für Spiel starten","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"habe gestern und heute 4 games gestartet \r\nnachdem champ pick kam immer die meldung ..``unable to reconect`` -.- also ein bug oder so wo ich einfach nicht ins spiel kam \r\ndann habe ich 10min zeit sperre bekommen \r\n\r\nheute habe ich sogar 20min weil wieder diese meldung kam -.-\r\nalso eigentlich kann ich ja nichts dafür ich bin nicht jemand der afk geht!!\r\n\r\nalso unglaublich wieder mal riot find ich echt unfaire \r\nhab glaub ich nach langem recherchieren das ``bug`` problem gelöst \r\ndoch muss nun **20min** warten \r\n\r\nwenn ihr probleme mit dem server habt müssen wir dafür büsen oder wie ?","replies":[{"poster":"legofreak1","date":"2015-02-20T01:16:55.970+0000","up_votes":2,"down_votes":0,"body":"Du hast 4 Spiele hintereinander verlassen und hast nicht gemerkt, dass du Probleme hast? 1 Spiel ist noch in Ordnung. 2tes kann ich einigermaßen verstehen. Aber spätestens danach sollte man zusehen, dass man keine Spiele mehr verlässt, indem entweder dafür sorgt, dass das Problem gelöst wird, wenn man es alleine nicht kann auch mit Hilfe, und/oder man spielt so lange nicht mehr und testet in ansonsten leeren Customgames, ob wieder alles funktioniert.\nDu hast eine Nachricht erhalten, dass du zustimmst, keine Spiele mehr zu verlassen und bist dem nicht nachgekommen, obwohl du bereits eine Sperre hattest, die folgende Sperre ist also verdient und wird auch nicht zurückgenommen werden.","replies":[{"poster":"xFrozenFire3","date":"2015-02-20T02:08:22.805+0000","up_votes":1,"down_votes":0,"body":"nachdem 2ten spiel habe ich dann alles neu gepatcht usw und habe nachher wieder ein spiel gestartet ging aber wieder nicht leider \n\nleider hab ich nicht den leeren custom game ausprobiert habe ist mir erst später in den sinn gekommen \naber trotzdem wenn die server nicht anständig laufen und überall on steht kann ich doch nichts dafür \nund erstes spiel war ich sogar ingame und dann hats einer nachdem anderen erwischt alle rausgekickt lol","replies":[]}]},{"poster":"Cardboard","date":"2015-02-20T06:46:29.365+0000","up_votes":1,"down_votes":0,"body":"Ich würde an deiner Stelle dieses Problem an den Riot Support weiterleiten bzw auf der Riot Support Seite die Lösungsvorschläge anschauen  \nHier ist der link zum Riot Support >     https://support.riotgames.com/hc/de","replies":[]}]}