{"poster":"yyu","date":"2018-12-22T16:17:59.090+0000","title":"El querido fizz","subforum":"Charlas Generales","up_votes":5,"down_votes":1,"body":"Saludos, queria empezar diciendo que era main fizz hace 1 a&ntilde;o y lo empece a dejar de usar ya que lo usaba literalmente siempre y recien hace poco se me dio por empezar a jugar devuelta y siento que no hace el da&ntilde;o como lo hacia antes, tambien se cambio la build que al principio era el liche y ahora se compra el prototipo ese que meh, sigo preferiendo la liche como primer item, en resumen queria saber si recibio un nerf bastante importante o yo perdi la habilidad con fizz","replies":[{"poster":"Soy Gardel","date":"2018-12-22T16:44:52.027+0000","up_votes":4,"down_votes":0,"body":"Le sacaron burst, le agregaron dps, hubo un patch en el que fue el mid con winrate mas bajo del juego, pero mas allá de eso, sigue deleteando en late de un R Q W (o q w en algunos casos) y tiene buen winrate ahora mismo, yo creo que solo tenes que acostumbrarte a su estilo de juego quizas algo distinto.","replies":[]},{"poster":"Tortuguita","date":"2018-12-22T17:38:29.113+0000","up_votes":3,"down_votes":0,"body":"Debes practicar de nuevo.","replies":[]},{"poster":"WhiteMax","date":"2018-12-22T16:31:39.901+0000","up_votes":3,"down_votes":0,"body":"Definitivamente perdiste la habilidad con el.","replies":[]},{"poster":"atr pibe argento","date":"2018-12-22T20:39:46.699+0000","up_votes":2,"down_votes":0,"body":"yo soy main fizz y llegue a master con el, pero tenes q saber aguantar hasta el lvl 6. y si queres tradear al lvl 3 es buena opcion.\n\nencuanto a la build yo empiezo con proto si es un rangue y si es mele con zhonyas.","replies":[]},{"poster":"Fízz","date":"2018-12-22T18:40:05.071+0000","up_votes":2,"down_votes":0,"body":"en la 8.24 creoq ue fue o 8.16 nerfearon su w y todas las runas que usaba (sudden impact electrocute la que cura y scorch y celerity)\n\nbasicamente le aplicaron un nerf enorme , todo gracias a la comunidad de reddit que estaba dividida entre dejarlo como estaba y cambiarle la w a la antigua que aplicaba % de vida enves de dps como esta ahora (el dps que aplica ahora es una real mierda), asique si lo nerfearon y probablemente perdiste la habilidad , ya que no es el mismo combo que usaba antes del nerf","replies":[]}]}