{"poster":"Quiup","date":"2018-08-21T00:18:58.249+0000","title":"AFK im Ranked aber wer muss dafür bezahlen?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":4,"body":"Der Moment wenn die Riven nach 10 min feed AFK geht und du sie nicht einmal reporden Kannst da die Spielauswertung sich nicht &ouml;ffnet. \r\n\r\nKennt doch irgendwie jeder aber muss man dann auch selbst daf&uuml;r Bezahlen?\r\n\r\nFinde ich nicht!\r\n\r\nKann man nicht im nachnein das Game entwerten, wenn sich raus gestellt hat das der Report wegen afk gerechtfertigt war?\r\nAlso ich meine wenn ein Mitspieler 5-10 Minuten nicht am Spiel teil genommen hat bekommt das andere Team schon einen enormen vorteil. Und meist ist dieser auch nicht wieder gut zu machen wenn der Spieler &uuml;berhaupt wieder kommt.\r\n\r\nEs kann ja immer mal sein, dass das Game abschmiert aber dann ist man keine 10 Minuten weg. Falls doch ist es ja auch kein Problem den Fehler Riot zu kommen zu lassen.\r\n\r\nKlar k&ouml;nnte man, das  Entwerten ausnutzen.\r\nAber ich glaube kaum, dass jemand immer wieder einen ACC hoch spielt, nur um ein Game ungeschehen zu machen. \r\nFinde ich einfach recht unwahrscheinlich.\r\nUnd wie gesagt, die leidtragenden sind dann die Restlichen aus dem Team.\r\n\r\nWas ich sagen muss, das ich das, mit dem Remake System sehr gut finde.\r\nDas hat mir schon oft Games voller Qualen erspart.\r\n\r\nKlar gibt es auch einige Argumente die dagegen sprechen, aber wenn das dann anf&auml;ngt den Spielspa&szlig; zu nehmen ist das, finde ich, das dies erst rech nicht der Sinn der Sache ist.","replies":[{"poster":"MeMyselfandBaal","date":"2018-08-21T02:37:06.183+0000","up_votes":4,"down_votes":0,"body":"Nein, kann man nicht. Warum? Weil davon toxische Spieler mehr profitieren als Vorbildliche. Denn wenn das eingeführt wird, hilft man den zurückliegenden Spieler nicht, sondern schreibt ihm \"At least go afk, so I wont lose LP\"... Was ja auch dann völlig legitim ist, wenn es einem darum geht, aufzusteigen.\n\nDazu kommt das Problem mit der Eloinflation, die man in einem MMR System immer gering halten will. Als es würden dann ja 5 Spieler LP gewinnen, auf der anderen Seite 4 keine LP verlieren. Was dann das Ligensystem entwertet und entstellt. Und ja, MMR Rechnungen sind kompliziert. \n\nNatürlich sind 4vs5 Niederlagen frustrierend. Aber wenn die Spieler, die mit ihrem Verhalten Ragequits auslösen, dafür dann im Endeffekt belohnt werden, wird dies nur zu einer toxischeren Community führen.\nDas einzige, was da hilft ist: Sich von der Bedeutung des einzelnen Spiels lösen und sich bewusst werden, dass man demnächst auch nen 5vs4 gewinnen wird. Wenn man sich selber immer vorbildlich und aufmunternd verhält und niemals AFK geht, ist dies sogar wahrscheinlicher als ein anders herum. \n\nUnd wenn es dich aufbaut: Der Leaverbuster agiert unabhängig von Reports voll automatisch. Also praktisch gesehen sogar, wenn du mit 5 Premades ins Spiel gehst und einer von euch dann AFK geht. Die Riven zu reporten ist an der Stelle also nur halb so wichtig, wie du glaubst.","replies":[{"poster":"Quiup","date":"2018-08-21T19:22:42.554+0000","up_votes":1,"down_votes":0,"body":"Deswegen würde ich ja an dieser stelle sehr hohe Strafen einführen, die soweit gehen, das bei durchgängiger wiederholung, der ACC ganz blockiert wird. \n\nUnd die Inflation würde dann nicht zu Stande kommen da für beide Teams das Game entwertet wird.\n\nSo überlegt man sich das zweimal ob man das Game verlässt und mind. einen Monat nicht mehr spielen kann oder ob man es wie ein Ehrenvoller Spieler nimmt und es bis zum ende spielt.","replies":[{"poster":"MeMyselfandBaal","date":"2018-08-22T00:59:18.021+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Quiup,realm=EUW,application-id=ip27PlEH,discussion-id=7bXikhzB,comment-id=00000001,timestamp=2018-08-21T19:22:42.554+0000)\n>\n> Deswegen würde ich ja an dieser stelle sehr hohe Strafen einführen, die soweit gehen, das bei durchgängiger wiederholung, der ACC ganz blockiert wird. \n\nEs ist ja bekannt, dass die Länder mit der Todesstrafe (was die höchstmögliche Strafe ist, die mir einfällt) die geringste Verbrechensquote haben... Härtere Strafen haben in der Geschichte der Menschheit noch nie zu weniger Kriminalität geführt. Das einzige, was hilft, ist eine hohe Aufklärungsrate. \n\n> \n> Und die Inflation würde dann nicht zu Stande kommen da für beide Teams das Game entwertet wird.\n\nAlso ganz ehrlich... wie bescheuert ist denn bitte der Vorschlag. Entschuldige bitte die Formulierung, aber die Idee ist unfassbar dumm... Und das wirst du gleich einsehen.\n\nFolgendes Szenario: Ich outplaye meine Gegner auf der Toplane bei deren Towerdive und gehe deswegen mit 2:0 in die Base. Ich komme zurück auf die Lane und führe die Riven mit mechanisch optimaler Ausnutzung wieder vor uns stehe nach 6 Minuten 3:0... die Riven schreibt \"bye\" in den all chat... und plötzlich werde ich von meinem Team geflamed... Wie konnte ich denn so blöd sein und die Riven so hart stompen, dass die das Spiel verlässt. Was bin ich denn für ein Vollidiot. \n\nUnd auf ein Mal verliere ich die sehr wahrscheinlichen 20 LP, ohne dass ich irgendwas falsch gemacht habe. Außer dass ich gut in dem Spiel war... Warum sollte ich Gefahr laufen dafür bestraft zu werden, dass ich gut spiele? \nGanz ehrlich: an dem Tag, an dem mir aus dem Grund LP abgezogen werden, deinstalliere ich sofort. Und da dürfte ich nicht der einzige sein. Das wäre wirklich das Ende von LoL...","replies":[{"poster":"Quiup","date":"2018-08-27T20:23:57.808+0000","up_votes":1,"down_votes":0,"body":"Ich glaube du hast noch nicht verstanden wie ich das meine bzw ich habe mich schlecht ausgedrückt.  Oder ich habe dich nicht richtig verstanden. \n\nKlar bin ich für die Aufklärung. Doch wie soll doese geschehen?\nAber ich denke das wenn der Acc für lange Zeit gesperrt werden würde, sollte die Riven sich das überlegt ob sie AFK geht oder nicht. \n\nWenn die Riven für so 8 min AFK gehen sollte verlierst du ja keine Punkte. Sondern da das Geme sehr unverhältnismäßig bzw einfach nicht fair gespielt wird, und nicht klar ist ob das eine Team gewonnen hat weil es wirklich besser ist oder nur weil sie Anderen nur zu 4. war gibt es für niemanden Punkte dazu bzw welche Abzug. Das heißt die Restlichen 9 gehen da +-0 raus. \n\nAlso wenn du die Riven weg klatscht, und sie trotz der drohenden sehe hohe Strafen Afk gehen sollte, verlieren nicht 4 andere Spieler grundlos LP obwohl sie nicht unbedingt schlechter ware. Und du bekommst keine Punkte geschenkt für ein Spiel was nicht fair beendet werden konnte. \n\nIn anderen Sportarten wird auch darauf geachtet das alles fair läuft und falls nicht setzen Strafen. \n\nJetzt würde ich gerne wissen wie du dir vorstellst in wie Zukunft das AFK gehen von Spielern verhindern sollte wenn es nicht aus Grüden des Absturzes oder des Internetzes ist. Buw wie du die Spieler aufklären würdest.","replies":[{"poster":"MeMyselfandBaal","date":"2018-08-27T21:55:18.675+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Quiup,realm=EUW,application-id=ip27PlEH,discussion-id=7bXikhzB,comment-id=0000000100000001,timestamp=2018-08-27T20:23:57.808+0000)\n>\n> Ich glaube du hast noch nicht verstanden wie ich das meine bzw ich habe mich schlecht ausgedrückt.  Oder ich habe dich nicht richtig verstanden. \n> \n> Klar bin ich für die Aufklärung. Doch wie soll doese geschehen?\n> Aber ich denke das wenn der Acc für lange Zeit gesperrt werden würde, sollte die Riven sich das überlegt ob sie AFK geht oder nicht. \n\nJa. Genau. Also Leute, die beim AFK sein erwischt werden (was ein Bot relativ einfach feststellen können sollte... ich meine, du kriegst in Game ne Warnung, dass du gerade AFK bist...) müssen schnell und direkt bestraft werden. Da ich selber nie AFK gehe und meine Freunde auch nicht (wer es tut, wird halt gekickt), kann ich halt schlecht beurteilen, wie schnell der Leaverbuster zuschlägt. \n\n> \n> Wenn die Riven für so 8 min AFK gehen sollte verlierst du ja keine Punkte. Sondern da das Geme sehr unverhältnismäßig bzw einfach nicht fair gespielt wird, und nicht klar ist ob das eine Team gewonnen hat weil es wirklich besser ist oder nur weil sie Anderen nur zu 4. war gibt es für niemanden Punkte dazu bzw welche Abzug. Das heißt die Restlichen 9 gehen da +-0 raus. \n\nWie gesagt: Ich mache absolut nichts falsch. Ich dominiere die Lane. Ich stehe nach 15 Minuten bei 5-0 und habe, wenn ich mich nicht dumm anstelle (und sonst keiner in meinem Team gefeedet hat) nen fast sicheren Sieg. 4 von 5 dieser Spiele gewinne ich. Ich muss das nur noch souverän runterspielen. Und dann wird mir das alles genommen, nur weil mein Gegner nen Ragequit hinlegt? Und ich sag das mal so: Die meisten \"Ragequits\" kommen aus der \"Das ist eh verloren, da verschwende ich nur meine Zeit\" Haltung. Also genau dem Szenario, das ich beschreibe.\nUnd ich provoziere den Ragequit ja, weil ich wirklich besser bin als mein Gegenüber. Sonst würde ich nicht 5-0 stehen. Und wenn du jetzt mit dem \"Man sollte nur LP bekommen, wenn man wirklich besser ist, als der Gegner\" anfängst... das kann niemand wirklich beurteilen.\n\n> \n> Also wenn du die Riven weg klatscht, und sie trotz der drohenden sehe hohe Strafen Afk gehen sollte, verlieren nicht 4 andere Spieler grundlos LP obwohl sie nicht unbedingt schlechter ware. Und du bekommst keine Punkte geschenkt für ein Spiel was nicht fair beendet werden konnte. \n\nNochmal: Das Problem mit den \"Die 4 Mitspieler sollten keine LP verlieren\", bleibt halt folgendes: Die toxischen Spieler profitieren davon mehr als die vorbildlichen. Denn auf ein Mal ist es eine vernünftige Taktik ein \"At least go afk\" in den Chat zu spammen, wenn jemand hinten liegt. Kostet dich halt weniger. \n\n> \n> In anderen Sportarten wird auch darauf geachtet das alles fair läuft und falls nicht setzen Strafen. \n\nÄhm... das ist auch ziemlicher Blödsinn... wenn du im Teamsport mitbekommst, dass ein Gegner nicht mehr ordentlich laufen kann (und der Gegner ihn nicht auswechseln kannst), dann attackierst du die Schwachstelle. Wenn in der Kreisklasse einer der Gegner sagt \"Ich hab da kein Bock mehr drauf, ich gehe jetzt\" (und ja, ich war mal in so einem Spiel dabei), wird das Spiel dann auch nicht abgebrochen... und wenn dies der Fall ist, weil zu viele Gegner ausgefallen sind, kriegst du trotzdem deine 3 Punkte und die 8 Tore, die du vorher erzielt hast, gutgeschrieben...\nOh und wenn in der NFL dein Starquaterback vom Gegner Krankenhausreif getackelt wird, sagen die Gegner hinterher auch nicht \"Oh, das ist unfair, da spielen wir gegen euch auch mit unserem Back Up\", sondern dann verpasst du die PlayOffs...\nWenn bei der Tour de France einer stürzt, attackieren die anderen Teams in 95% der Fälle... die Beispiele lassen sich endlos fortführen... Sport heißt halt immer auch: Die Schwachstellen des Gegners ausnutzen...\n\n> \n> Jetzt würde ich gerne wissen wie du dir vorstellst in wie Zukunft das AFK gehen von Spielern verhindern sollte wenn es nicht aus Grüden des Absturzes oder des Internetzes ist. Buw wie du die Spieler aufklären würdest.\n\nGanz einfach: Ich würde alles genau so lassen, wie es ist. Einmaligen Leavern die LP abziehen (und so weit ich weiß, verliert man dann mehr, es ist aber Jahre her, dass mir das in nem Ranked passiert ist, damals gab es noch keine Liga... war aber trotzdem ein ziemlich teurer Stromausfall...). Leuten, die häufiger leaven mit spürbaren Strafen (wie: Du und all deine Freunde müssen 20 Minuten warten, bevor es losgeht) belegen. Und vor allem kein System einführen, welches die Toxidität im Spiel erhöht. Die einzige Änderung, die ich einführen würde, wäre... den Timer so programmieren, dass er wirklich nur runter läuft, wenn man auch im LoL Client ist... damit man halt nicht einfach 20 Minuten lang surfen geht...\n\nUnd wenn ich dann mal nen AFK in meinem Team habe, ärgert mich das natürlich. Aber ich habe halt nicht nur das eine Spiel im Sinn, sondern bin mir bewusst, dass ich als (Honor Stufe 5) vorbildlicher Spieler häufiger 5vs4 spiele als anders herum. Und das deswegen langfristig die vorbildlichen, ihre Teammates aufbauenden Spieler davon profitieren, während es den Leuten, die Ragequits provozieren schadet. Das ist nicht perfekt, aber es ist die beste Möglichkeit.\n\nWenn man natürlich nur die eigenen 4vs5 Spiele wahrnimmt und niemals mitbekommt, dass es ab und zu auch anders herum läuft, fällt es einem schwieriger in dieses System zu vertrauen. Und leider funktioniert das menschliche Gedächtnis genau so: Dass die negativen Beispiele eher hängen bleiben als die für einen positiven.\n\nAber ich habe mich ja auch vor Jahren von der Bedeutung des einzelnen Spieles verabschiedet. Du solltest aber einfach mal bedenken, dass du bei deinem \"Dann kriegen alle keine LP\" Vorschlag langfristig mehr verlierst als gewinnst... oder du gehörst zu den Spielern, die mit ihrem Verhalten Ragequits provozieren...","replies":[{"poster":"Quiup","date":"2018-08-28T08:56:22.409+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt ich denke das wenn es droht den ACC 2 Monate nicht benutzen zu können wird da niemand das Game verlassen. Und selbst falls doch wird sich das nicht wiederholen da man denn den ACC garnicht mehr benutzen könnte. \n\nIch stimme dir da zu das es ohne hohen Strafen das komplett Schwachsinn ist und niemals mehr Spiele beendet werden würden. \n\nDeswegen bin ich ja in dem Zuge für höhere Strafen. \n\nIch weiß leider nicht wie hoch die Strafen für beleidigen oder sonstiges ist. Aber ich habe oft das Gefühl, dass es nichts bringt, die Spieler für solche Dinge zu melden. Man bekommt ja eine Benachrichtigung wenn etwas getan wurde, nur kommt das deutlich seltener als man jemanden Melden muss. \n\nIch Persönlich wurde noch ne bzw habe noch nei eine Strafe bekommen. Außer in einem meiner ersten Games gegen damls noch Bots wo ich noch nicht wusste wie das Geme funktioniert.","replies":[]}]}]},{"poster":"Noxempire","date":"2018-08-22T17:41:45.795+0000","up_votes":1,"down_votes":0,"body":">Es ist ja bekannt, dass die Länder mit der Todesstrafe (was die höchstmögliche Strafe ist, die mir einfällt) die geringste Verbrechensquote... \n>\n\nIch glaub du hast dich verschrieben? ^^ \n\nZumindest ergibt das dann im Kontext keinen Sinn :0\n\nEDIT: Naja und der Satz ist natürlich unvollständig :p ","replies":[{"poster":"MeMyselfandBaal","date":"2018-08-22T17:54:50.936+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Noxempire,realm=EUW,application-id=ip27PlEH,discussion-id=7bXikhzB,comment-id=0000000100000000,timestamp=2018-08-22T17:41:45.795+0000)\n>\n> Ich glaub du hast dich verschrieben? ^^ \n> \n> Zumindest ergibt das dann im Kontext keinen Sinn :0\n> \n> EDIT: Naja und der Satz ist natürlich unvollständig :p\n\nDamn, du hast Recht, ich habe ein \"haben\" vergessen... ups...","replies":[]}]}]}]},{"poster":"OPChampsSucks","date":"2018-08-21T11:34:46.035+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=ip27PlEH,discussion-id=7bXikhzB,comment-id=0000,timestamp=2018-08-21T02:37:06.183+0000)\n>\n> Nein, kann man nicht. Warum? Weil davon toxische Spieler mehr profitieren als Vorbildliche. Denn wenn das eingeführt wird, hilft man den zurückliegenden Spieler nicht, sondern schreibt ihm &quot;At least go afk, so I wont lose LP&quot;... Was ja auch dann völlig legitim ist, wenn es einem darum geht, aufzusteigen.\n> \n> Dazu kommt das Problem mit der Eloinflation, die man in einem MMR System immer gering halten will. Als es würden dann ja 5 Spieler LP gewinnen, auf der anderen Seite 4 keine LP verlieren. Was dann das Ligensystem entwertet und entstellt. Und ja, MMR Rechnungen sind kompliziert. \n> \n> Natürlich sind 4vs5 Niederlagen frustrierend. Aber wenn die Spieler, die mit ihrem Verhalten Ragequits auslösen, dafür dann im Endeffekt belohnt werden, wird dies nur zu einer toxischeren Community führen.\n> Das einzige, was da hilft ist: Sich von der Bedeutung des einzelnen Spiels lösen und sich bewusst werden, dass man demnächst auch nen 5vs4 gewinnen wird. Wenn man sich selber immer vorbildlich und aufmunternd verhält und niemals AFK geht, ist dies sogar wahrscheinlicher als ein anders herum. \n> \n> Und wenn es dich aufbaut: Der Leaverbuster agiert unabhängig von Reports voll automatisch. Also praktisch gesehen sogar, wenn du mit 5 Premades ins Spiel gehst und einer von euch dann AFK geht. Die Riven zu reporten ist an der Stelle also nur halb so wichtig, wie du glaubst.\n\nBah ich muss mich innerlich schon wd aufregen wenn ich das mit diesem \"wahrscheinlich\" schon wd lese. Wahrscheinlichkeit ist lediglich eine Chance genau wie die Wahrscheinlichkeit im Lotto zu gewinnen. Es gibt Leute die haben auch schon 2x gewonnen bei 0,00-300milliardenchance während die Chance für nen afk wesentlich höher auch eine Serie von afks wesentlich höher ausfällt.  sprich es kann einfach unglaublich leicht sein etliche afk leute ins Team in Folge zu kriegen und das wird auch nicht beim einzelnen Match bleiben. Wenn ich alle meine Games zusammenzähle bin ich vllt bei einer 50/50 Rate und von 7k Games 3500 1 oder mehr AFKS im team zu Haben finde ich extrem peinlich für diese große Firma ^^ Afks im Gegnerteam sehe ich btw nahezu nie also ganz selten haben die wirklich mal nen afk aber das gleicht sich vllt in nem  1:20 oder 1:50 verhältnis\n\n\n@Te\n\nist normal das man mit allem bestraft wird. hatte grad auch n freelose. 1. Match des Tages und direkt 4 leute die jeweils 2:8 ausm Game gehen während ich 4:2 stand ^^ danke riot.","replies":[{"poster":"MeMyselfandBaal","date":"2018-08-21T14:36:59.066+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=OPChampsSucks,realm=EUW,application-id=ip27PlEH,discussion-id=7bXikhzB,comment-id=00000000,timestamp=2018-08-21T11:34:46.035+0000)\n>\n> Bah ich muss mich innerlich schon wd aufregen wenn ich das mit diesem &quot;wahrscheinlich&quot; schon wd lese. Wahrscheinlichkeit ist lediglich eine Chance genau wie die Wahrscheinlichkeit im Lotto zu gewinnen. Es gibt Leute die haben auch schon 2x gewonnen bei 0,00-300milliardenchance während die Chance für nen afk wesentlich höher auch eine Serie von afks wesentlich höher ausfällt.  sprich es kann einfach unglaublich leicht sein etliche afk leute ins Team in Folge zu kriegen und das wird auch nicht beim einzelnen Match bleiben. Wenn ich alle meine Games zusammenzähle bin ich vllt bei einer 50/50 Rate und von 7k Games 3500 1 oder mehr AFKS im team zu Haben finde ich extrem peinlich für diese große Firma ^^ Afks im Gegnerteam sehe ich btw nahezu nie also ganz selten haben die wirklich mal nen afk aber das gleicht sich vllt in nem  1:20 oder 1:50 verhältnis\n> \n> \n> @Te\n> \n> ist normal das man mit allem bestraft wird. hatte grad auch n freelose. 1. Match des Tages und direkt 4 leute die jeweils 2:8 ausm Game gehen während ich 4:2 stand ^^ danke riot.\n\nAuch wenn das jetzt übelst fies klingt: Wenn du dich in Game so präsentierst, wie hier, also immer eine aggressive Grundstimmung und eine gewisse Negatitivät ins Spiel bringst, wundert es mich nicht, dass du mehr AFKs hast als ich. Du scheinst mir genau der Spielertyp zu sein, wegen dem ich keine Änderungen im System will. Vielleicht solltest du einfach mal deinen eigenen Einfluss auf die Mitspieler überdenken und positiver auf diese einwirken... nur so ne Idee...\n\nUnd das du selten AFKs im Gegnerteam wahrnimmst, ist auch ganz leicht zu erklären. Das liegt an dem \"Nebel des Krieges\" Phänomen: Du siehst halt nicht immer, was das Gegnerteam macht. Du siehst aber alles, was dein Team macht. Bedeutet: Sobald einer deiner Mates in der Base chillt, fällt dir das auf. Wenn du aber den Teamfight gewinnst, weil der Gegner in Unterzahl spielt, fällt dir das nur auf, weil du \"GIVE ME PENTA\" brüllst... sonst nicht zwingend. \nUnd ja, ich hatte schon einige Spiele, in denen mir dann relativ spät aufgefallen ist, dass wir seit 10 Minuten in Überzahl spielen. Passiert.","replies":[{"poster":"Quiup","date":"2018-08-21T19:23:09.211+0000","up_votes":3,"down_votes":0,"body":"Stimme dir da voll und ganz zu","replies":[]}]},{"poster":"Marksmansitter","date":"2018-08-21T12:09:26.930+0000","up_votes":2,"down_votes":0,"body":"Wenn du in 50% deiner Spiele afks hast dann wird das wohl an deinem Verhalten liegen, d.h. z.B. du provozierst Spieler. Ich kenne niemanden der auch nur annähernd so viele afks hat.\n\nDas ist wie als wenn du durch die Stadt gehst und jedem passiv aggressive sachen an den Kopf wirfst, irgendwann fängst du dir deswegen eine, du sagst dann das jeder zweite in der Stadt gewalttätig ist aber letztendlich bist du der Auslöser. \n\n\"Afks im Gegnerteam sehe ich btw nahezu nie also ganz selten haben die wirklich mal nen afk aber das gleicht sich vllt in nem 1:20 oder 1:50 verhältnis\" Das bestätigt auch meine Aussage.\n\nAbgesehen davon übertreibst du sowieso maßlos und deine \"Argumente\" sind auch völliger Schwachsinn.","replies":[]}]}]},{"poster":"Meemoy","date":"2018-08-21T07:18:53.365+0000","up_votes":1,"down_votes":0,"body":"Und was ist mit den Spielen, die man geschenkt bekommt, weil jemand im Gegnerteam afk geht?","replies":[{"poster":"Quiup","date":"2018-08-21T19:23:56.135+0000","up_votes":1,"down_votes":0,"body":"Finde ich sollten genauso entwertet werden.","replies":[{"poster":"Meemoy","date":"2019-01-20T02:57:31.103+0000","up_votes":1,"down_votes":0,"body":"Und jetzt erklär mir mal bitte, wo der Unterschied liegt, ob Spiele mit einem AFK voll oder gar nicht gewertet werden.\nNach meiner Rechnung kommt es auf das selbe hinaus oder sehe ich das falsch?","replies":[]}]}]}]}