{"poster":"Káho Shibuya","date":"2015-03-14T01:15:45.578+0000","title":"ayuda en jungla","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"hola queria preguntarles que campeon me recomiendan ( y como usarlo) para jugar en sector de la jungla?\r\nya que es la unica linea que nose jugar y quiero aprender para entrar a jugar ranked desde ya muchas gracias.","replies":[{"poster":"Whitesse","date":"2015-03-14T01:35:57.424+0000","up_votes":2,"down_votes":0,"body":"Amumu, volibear, rammus (si son todos ad), Fiddle, j4, vi, warwick,nautilus, phanteon,udyr y wukong, son los junglas mas faciles de usar. Las rutas que les vas a hacer son dependiendo de que necesite el campeon en early dentro de la jungla.\n\nCuando seas mas \"pro\" usa Rengar, K6, Nocturne, Lee sin, Neo j4, Neo vi, Shaco, skarner,rek sai etc.\n\nMain jg.","replies":[]},{"poster":"Adrien Agreste","date":"2015-03-14T02:12:31.547+0000","up_votes":1,"down_votes":0,"body":"empieza con {{champion:5}}  es un campeon muy muy facil de usar , ya sea para hacer la jg y para gankear no dificulta para nada , por ahi el late puede costar pero si aprendes  a andar por hay no pasa nada . suerte !  de ultima si no te agrada el personaje te recomiendo {{champion:20}} {{champion:19}}   lo unico de estos es que , a nivel 6 en el caso del lobete  es mas eficiente el agankeo y es mas seguro de que se lleve bien el gank y con nunu  es que su gankeo mas alla de que con su E  haga mucho daño y realentice mucho no suelen salir bien pero si le das la vuelta y enganchas por atras y tiras la R para despistar suele pasar que por esto el enemigo tenga impedido el paso a su torre y este obligado a gastar flash y demas , pero no resulta tanto .\nlo bueno es que con estos dos jg es muy pero muy facil hacer la jg y no deberias de tener complicaciones a no ser que te hagan counter jg . ahora si decides ir por xin esta complicado hacerle counter jg por que este es un chap que 1 vs 1 suele tener mas posibilidades de ganar. agregame :3","replies":[]},{"poster":"Káho Shibuya","date":"2015-03-14T02:01:01.676+0000","up_votes":1,"down_votes":0,"body":"muchas gracias por la ayuda empesare con amumu ya que lo tengo y por lo que me dijieron es muy facil de usar.\nmuchas gracias","replies":[]},{"poster":"santyko","date":"2015-03-14T01:40:33.385+0000","up_votes":1,"down_votes":0,"body":"1. yo aprendi con{{champion:19}} , ahora tengo a {{champion:254}} y me gusta , {{champion:107}} me gusto cuando lo probe , me canse de fedear pero me gusto igual es muy divertido\n\nPD: worst jg  ever","replies":[]},{"poster":"Rencor","date":"2015-03-14T01:23:50.520+0000","up_votes":1,"down_votes":0,"body":"Hay muuuuchos... Yo te recomendaría amumu(buena resistencia en jungla, tank, buena presencia en tf), shaco(buena movilidad, muchos asesinatos y carreas solo) y vi( aunque la banean seguido es muy buena, muy buen daño, buena presencia en tf, perfecto focus xd)\n\npero te recomiendo amumu, es súper fácil ya que si atinas la q ya los stuneaste :p y con la ulti aun mejor","replies":[]},{"poster":"Cafall","date":"2015-03-14T01:23:47.212+0000","up_votes":1,"down_votes":2,"body":"{{champion:9}} {{champion:11}} {{champion:19}} {{champion:106}} {{champion:254}} {{champion:20}} {{champion:80}} {{champion:432}}","replies":[]}]}