{"poster":"Schesam","date":"2015-05-28T18:24:01.548+0000","title":"Elophant Achivements","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ich wei&szlig; nciht ob die hier &uuml;berhaupt wer kennt, aber es gibt auf Elophant Achivements, die man in Lol erf&uuml;llen kann. Hab die vor ca ner Stunde entdeckt,a ls ich nachschauen wollte, wv und welche skins ich alle hab ohne nachzuz&auml;hlen (Hab 53 btw). Hab dann die Achivements entdeckt und nun auch schon 3x geupdated. Allerdings sind die lange nicht vollst&auml;ndig. ALso Beispiel hab ich als Achivement gerade mal 5h Lol-Spielzeit, auch wenn wastedonLol 1550h sagt, was auch realistischer is :P. Dann noch einige andere, wie z.B. 20 Games mit dem Gral, mal als Morgana, Rengar,Kha-Zix, etc spielen.\r\nHab ich alles shconmal gemacht, aber teilweise steht da dran das ich das noch nie getan habe. ISt das normal oder nurn Fehler bei mir?","replies":[{"poster":"Schesam","date":"2015-05-28T19:02:28.448+0000","up_votes":1,"down_votes":0,"body":"Nur die letzten 10 games? is doch beschissen lol Naja danke","replies":[{"poster":"FailerOfWorld","date":"2015-05-28T19:47:13.112+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Schesäm,realm=EUW,application-id=Wj1wcocU,discussion-id=UEscFg9Q,comment-id=0001,timestamp=2015-05-28T19:02:28.448+0000)\n>\n> Nur die letzten 10 games? is doch beschissen lol Naja danke\n\nNaja ist aber so, kannst ja regelmäßig updaten, anders wäre das ja ein rieseiger Datensatz der analysiert werden müsste","replies":[{"poster":"Schesam","date":"2015-05-28T20:05:40.728+0000","up_votes":1,"down_votes":0,"body":"Muss ja im Prinzip nur einmal gemacht werden, danach nurnoch das, was noch nciht drinne ist, kann man ja im Account vermerken. BIn ja schließlich auch angemeldet. Hatte eig vor die mal alle zu erfüllen, aber alle nochmal neu machen und jedes mal ans updaten denken? Keine Ahnung ob ich dazu Lust hab, vorallem so Sachen, die ewig brauchen, wie 50 Pentakills und solche Späße. Hätte so  gut sehen können wv ich jetz shcon hatte^^ UNd den ganzen Datensatz untersuchen amchen auch shcon adnere Seiten, is jetz nich son Act.","replies":[]}]}]},{"poster":"FailerOfWorld","date":"2015-05-28T18:59:39.312+0000","up_votes":1,"down_votes":0,"body":"http://www.elophant.com/league-of-legends/forum/achievements/how-do-i-get-achievements-9\n\n\"Only your last 10 matches can be scanned, so scan often to ensure that you don't miss any achievements. Also, the only games that count towards achievements are Normal and Blind 5v5, and ranked Solo / Duo / Team 5v5. So, if you play any another map, custom or co-op vs. ai games these will not count.\n\"\n\nHast du das beachtet?","replies":[]}]}