{"poster":"Schesam","date":"2015-06-30T06:32:00.030+0000","title":"Das neue Zekes Herold","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":">Recipe : Glacial Shroud + Amplifying Tome + Amplifying Tome\n>Total Cost: 2300 G\n>+250 Mana\n>+35 Armor\n>+50 Ability Power\n>+10% Cooldown Reduction\n>UNIQUE Active - Conduit: Bind to target ally. This will remove all other Conduits on your target (60 >second cooldown). \n>UNIQUE Passive: When within 1000 units of each other, you and your ally generate Charges. Attacking or casting spells generates extra Charges. At 100 Charges, causing damage consumes them, increasing you and your ally&#039;s Ability Power by 20% and Critical Strike Chance by 50% for 6 seconds.\n\nhttp://puu.sh/iHVMa/894c45d45e.jpg\n\nWas haltet ihr vom neuen Zekes? Ich finde es richtig OP, dem ADC einfach mal  50% Crit zu geben oder dem APC 20% mehr AP f&uuml;r 6 Sekunden, in denen er den Gegner bursten kann","replies":[{"poster":"Hamrio","date":"2015-06-30T09:55:46.354+0000","up_votes":1,"down_votes":0,"body":"also mit einer cassio im team wäre das ja übelst geil die tanzt ja normalerweise mit full ap schon auf ~1200 Ap rum dann nochmal +20%","replies":[{"poster":"Schesam","date":"2015-06-30T10:00:35.815+0000","up_votes":1,"down_votes":0,"body":"In nem Custom, wo ich sie mal ausprobiert hatte, da sie mir Spaß machte, hatte ich am ende (war gg 5 bots) 1.800 AP. Hatte Ludens, Rabadons, Zhonyas, 20-Stack-Mejais, Seraphen + MPen-Boots. Also bei dem Build im Normal sogar Full-tanks 2-Hit mit dem Item dann :D","replies":[]}]},{"poster":"Ashuna","date":"2015-06-30T06:55:10.330+0000","up_votes":1,"down_votes":1,"body":"Das Item ist sehr Stark ja, Op? Nicht wirklich.\nDas Item gibt halt solide stats die 60 sekunden Cd sind auch ganz Ordentlich, man kann es auf jedenfall gut auf manche Champs kaufen. Es ist mit der 6 Sekunden dauer wirklich nur für kurze Kämpfe gedacht. (dort ist es dann sehr stark). Kämpfe die länger anhalten für diese wäre es nicht so gut.\n\nAn sich Solide Stats+ Gute Passive; Jedoch eher für Burst comps/ Teams wo die Tf's kurz sind.\n\nmfg Ashuna {{champion:1}}","replies":[]}]}