{"poster":"Schesam","date":"2015-06-14T00:41:21.551+0000","title":"Neues CDR-Item","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Ich wollte nur mal fragen, ob ich eigentlich der einzige bin, der ein neues 20% CDR-Item f&uuml;r APler m&ouml;chte, das die 20% CDR bringt, aber daf&uuml;r nichts mit mana, sondern etwas anderes, wie z.B. ne neue Passive, 100 AP, ne coole Aktive (Hat man als Mage seit DFG-Remove eh nurnoch selten im Inventar) oder iwie sowas\n\nOder aber ganz einfach: Man gibt den Twin Shadows anstatt 10% 20% CDR, dann wäre das auch gelöst c:","replies":[{"poster":"Th3is","date":"2015-06-14T00:50:41.896+0000","up_votes":1,"down_votes":0,"body":"Für DFG ist doch Ludens rein gekommen. Und ich denke 20% CDR, 100AP + eine Aktive wäre dann doch etwas OP ;)","replies":[{"poster":"Leeerzeichen","date":"2015-06-14T11:56:27.238+0000","up_votes":1,"down_votes":0,"body":"Bietet Luden CDR?\nNein.\nDas macht es Manalosen Champs wie z.B mordekaiser oder vladimir schwer 40% cdr zu stacken, ohne zu viele slots für sehr spezielle Items zu wasten. Die einzigen items die cdr ohne mana bringen sind {{item:3023}}, {{item:3115}}, {{item:3152}} und vlt. {{item:3158}}. Aber auch sonst würde ich mir einen 15% cdr gegenstand wünschen, da dass exakt die Menge ist, die auf 40% fehlt, wenn man die Mastery und {{item:3174}}/{{item:3165}} hat. Zur Zeit ist man halt gezwungen {{item:3158}} zukaufen, wenn man nicht 5% over- oder undercappen will.","replies":[{"poster":"Th3is","date":"2015-06-14T23:19:00.557+0000","up_votes":1,"down_votes":0,"body":"Mit Runen und Masterys kannst du locker auf 20% mit AP und dann kannst du noch je nach Matchup Armor/Magic Resist mitnehmen.","replies":[]}]}]},{"poster":"Infevo","date":"2015-06-14T14:34:40.282+0000","up_votes":1,"down_votes":0,"body":"Kenne das Problem. Vor allem weil ich gerne Vlad spiele\n20% von Runen und Masteries, 10% von {{item:3152}}  und dann gibt es kein sinnvolles Item mehr, welches die Lücke stopft. Manareg ist gold waste. Lucidity boots sind auch stat waste und mpen macht viel mehr aus. Will of the Ancients sollte wieder 10% mehr haben oder ich bin gezwungen weiterhin Spiritvisage zu bauen.\n\n\n> [{quoted}](name=gg Apdo,realm=EUW,application-id=Wj1wcocU,discussion-id=V5xcGjwU,comment-id=0001,timestamp=2015-06-14T01:02:58.486+0000)\n>\n> deswegen spiele ich mit 15% CDR in den blauen runen \n> CD Boots 15% \n> und dann baust du ja meist Morellos oder so ...\n> \n> schon haste deine 40 %\n\nMan kann auch rabadon auf Zed rushen. Trotzdem ergibt das nicht viel Sinn.","replies":[]},{"poster":"pulledchicken","date":"2015-06-14T01:02:58.486+0000","up_votes":1,"down_votes":0,"body":"deswegen spiele ich mit 15% CDR in den blauen runen \nCD Boots 15% \nund dann baust du ja meist Morellos oder so ...\n\nschon haste deine 40 %","replies":[]}]}