{"poster":"Eøbard Thawne","date":"2018-07-14T22:58:15.848+0000","title":"Domanda da bronzo (beh, lo sono)","subforum":"Campioni e gameplay","up_votes":3,"down_votes":2,"body":"Ebbene. Sono uno molto convinto che il gioco di League of Legends sia ben fatto e bilanciato. Ma io ho una domanda esistenziale. Perch&egrave; non &egrave; possibile che io perda la lane solo contro quel campione.\r\n\r\nAdesso, escludete i teamfight dove &egrave; un personaggio che ha counterplay, basta kaitarlo. E dai matchup eliminiamo {{champion:17}}  e {{champion:133}} \r\nIo come dovrei vincere la laning phase (e attenzione, solo quella) contro {{champion:420}} ?. Giuro, ho giocato quasi tutti i campioni, sia quando erano in free rotation, e nonostante io non sia gesu cristo, normalmente so gestire ogni campione in Toplane. ma lei mai. Sar&ograve; bronzo, ma a questo punto contro altri bronzi dovrebbe essere alla pari, &egrave; vero che ho l&#039;MMR alto ma comunque me lo chiedo. Io sono un bronzo che segue molto gli Esports e cosi via, quindi a livello teorico sono molto bravo ma non a livello pratico. Perci&ograve; io a livello di Laning phase, esclusi i ranged toplane come {{champion:17}} {{champion:133}} {{champion:13}} {{champion:8}}  e {{champion:50}} non vedo gente melee che possa vincere contro di lei, nemmeno {{champion:80}} e {{champion:58}} . Pure {{champion:122}} le ha prese. Quindi...help?","replies":[{"poster":"Ser Nalor","date":"2018-07-15T01:22:34.199+0000","up_votes":5,"down_votes":0,"body":"Chi gioca Illaoi, di solito, tende ad essere molto aggressivo sin dalle prime battute. Una buona chiave di lettura potrebbe essere giocare aggressivo a tua volta con champ da snowball e con cui, comunque, rimani confident nelle meccaniche. In questo, per dire, il buon {{champion:122}} non è affatto malaccio contro di lei.\n\nGeneralmente si suggeriscono champ con alta mobilità contro di lei ma in low elo basta usare la testa (...e le mani).\n\nApplicare il famoso detto \"chi mena per primo, mena due volte\" può essere una mossa vincente contro di lei purché fatto con le dovute maniere e non allo sbaraglio. In pochi, per dire, sono riusciti a raccontare un dive avvenuto con successo quando i suoi tentacoli erano nei pressi della propria torre ed ella ardette di scorno come furia empia d'inferno.\n\nQuindi i consigli per sopravvivere al meglio possono essere i seguenti:\n- **Il positioning è tuo amico!** \nNon posizionarti in mezzo ai tuoi minion, la sua Q colpisce un'area utile per free poke e farm al contempo;\n- **Occhio alla sua E!** \nIl grab per il Vessel è un'ottima intro per un all-in nonostante non sia necessariamente l'inizio della sua combo ma più tieni a mente il suo cooldown e più finestre di trade potrai rimediarti; _-  20 / 18 / 16 / 14 / 12 - Tieni anche conto di quanta CD builda_\n- **Tentacoli, che passione!** \nEliminali quando puoi farlo in modo safe o quando lei non è presente in corsia (anche in seguito ad un recall), inoltre ricorda di non star loro troppo vicino od offrirai a lei un free engage di W;\n- ** Who need a map?!** \nRefreshare il sano uso della minimappa è doveroso, in un matchup tra due champ immobili (per esempio, come dicevo prima, se usi Darius) una gank del jungler segna un vantaggio/svantaggio importante che ti porterai dietro per buona parte della partita;\n- **L'anima de li mejo...!** \nSe lei hard focussa la tua \"anima\" in seguito a un grab di E con tutto ciò che ha, anziché scappare ed essere slowato dall'applicazione del Vessel, attaccala a tua volta con tutto ciò che hai perché le farai molto più danno tu su di lei che lei colpendo la tua anima (il danno che lei applica sull'anima è in %, il tuo su di lei no);\n- **Liberate il Kraken!**\nLa sua ultimate spawna un tentacolo per ogni champion e anima nelle vicinanze (per un massimo di 5 tentacoli) per cui capisci bene che fightare in spazi angusti è totalmente sconsigliato. Se ciò avviene, vattene prima possibile e pinga altrettanto ai tuoi compagni.\n\nQuest'ultima non è propriamente sulla laning phase ma è spesso un errore che si commette, come quando si fighta un Rumble nelle zone dei buff di giungla: si danno solo vantaggi gratuiti che segnano inesorabilmente l'esito di una partita.\n\nSpero ti sia stato utile :D","replies":[{"poster":"Rohan97","date":"2018-07-21T05:19:41.558+0000","up_votes":1,"down_votes":0,"body":"se ti prende l'anima e gli vai contro ti picchia due volte.\nscappa che ti mena di meno , l'unico modo per giocartela contro illaoi e solamente posizionarti bene è non farti prendere dalle E , e come hai detto tu giocare più aggressivo\n{{champion:122}} {{champion:114}} {{champion:39}} {{champion:92}} {{champion:78}}  con questi mi trovo bene contro di lei","replies":[]},{"poster":"Eøbard Thawne","date":"2018-07-15T18:49:29.594+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ser Nalor,realm=EUW,application-id=cAOZwaUi,discussion-id=cbRxdKwH,comment-id=0002,timestamp=2018-07-15T01:22:34.199+0000)\n>\n> Chi gioca Illaoi, di solito, tende ad essere molto aggressivo sin dalle prime battute. Una buona chiave di lettura potrebbe essere giocare aggressivo a tua volta con champ da snowball e con cui, comunque, rimani confident nelle meccaniche. In questo, per dire, il buon {{champion:122}} non è affatto malaccio contro di lei.\n> \n> Generalmente si suggeriscono champ con alta mobilità contro di lei ma in low elo basta usare la testa (...e le mani).\n> \n> Applicare il famoso detto &quot;chi mena per primo, mena due volte&quot; può essere una mossa vincente contro di lei purché fatto con le dovute maniere e non allo sbaraglio. In pochi, per dire, sono riusciti a raccontare un dive avvenuto con successo quando i suoi tentacoli erano nei pressi della propria torre ed ella ardette di scorno come furia empia d&#x27;inferno.\n> \n> Quindi i consigli per sopravvivere al meglio possono essere i seguenti:\n> - **Il positioning è tuo amico!** \n> Non posizionarti in mezzo ai tuoi minion, la sua Q colpisce un&#x27;area utile per free poke e farm al contempo;\n> - **Occhio alla sua E!** \n> Il grab per il Vessel è un&#x27;ottima intro per un all-in nonostante non sia necessariamente l&#x27;inizio della sua combo ma più tieni a mente il suo cooldown e più finestre di trade potrai rimediarti; _-  20 / 18 / 16 / 14 / 12 - Tieni anche conto di quanta CD builda_\n> - **Tentacoli, che passione!** \n> Eliminali quando puoi farlo in modo safe o quando lei non è presente in corsia (anche in seguito ad un recall), inoltre ricorda di non star loro troppo vicino od offrirai a lei un free engage di W;\n> - ** Who need a map?!** \n> Refreshare il sano uso della minimappa è doveroso, in un matchup tra due champ immobili (per esempio, come dicevo prima, se usi Darius) una gank del jungler segna un vantaggio/svantaggio importante che ti porterai dietro per buona parte della partita;\n> - **L&#x27;anima de li mejo...!** \n> Se lei hard focussa la tua &quot;anima&quot; in seguito a un grab di E con tutto ciò che ha, anziché scappare ed essere slowato dall&#x27;applicazione del Vessel, attaccala a tua volta con tutto ciò che hai perché le farai molto più danno tu su di lei che lei colpendo la tua anima (il danno che lei applica sull&#x27;anima è in %, il tuo su di lei no);\n> - **Liberate il Kraken!**\n> La sua ultimate spawna un tentacolo per ogni champion e anima nelle vicinanze (per un massimo di 5 tentacoli) per cui capisci bene che fightare in spazi angusti è totalmente sconsigliato. Se ciò avviene, vattene prima possibile e pinga altrettanto ai tuoi compagni.\n> \n> Quest&#x27;ultima non è propriamente sulla laning phase ma è spesso un errore che si commette, come quando si fighta un Rumble nelle zone dei buff di giungla: si danno solo vantaggi gratuiti che segnano inesorabilmente l&#x27;esito di una partita.\n> \n> Spero ti sia stato utile :D\n\nQuello più utile fino ad ora grazie :D","replies":[]}]},{"poster":"Linkimaru","date":"2018-07-15T12:40:40.074+0000","up_votes":2,"down_votes":1,"body":"Non ha senso ciò che dici, perché bisogna escludere i ranged se sono proprio quelli il principale punto debole di illaoi? È come dire aiutatemi a sconfiggere Superman escludendo la kryptonite XD","replies":[{"poster":"Eøbard Thawne","date":"2018-07-15T18:48:18.744+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Final Linkimaru,realm=EUW,application-id=cAOZwaUi,discussion-id=cbRxdKwH,comment-id=0004,timestamp=2018-07-15T12:40:40.074+0000)\n>\n> Non ha senso ciò che dici, perché bisogna escludere i ranged se sono proprio quelli il principale punto debole di illaoi? È come dire aiutatemi a sconfiggere Superman escludendo la kryptonite XD\n\nperche so che uno dei suoi punti deboli sono i ranged, ma mi sembrava stupido che fosse il suo unico punto debole (il tuo esempio anche, la kryptonite nn e la sua unica debolezza, ma anche i soli rossi e la magia nera)","replies":[]}]},{"poster":"teox02","date":"2018-08-09T09:50:11.108+0000","up_votes":1,"down_votes":0,"body":"Prova a usare gnar io mi trovo bene","replies":[]},{"poster":"tempn9835","date":"2018-07-19T10:17:42.886+0000","up_votes":1,"down_votes":0,"body":"Illaoi avrà sempre più danni di te perchè di per se era ed è ancora sbroccato come campione.  Per vincerla completamente devi avere minimo 4 kill e molto più oro di lei. Allora in quel caso puoi decidere di ingaggiarla quando vuoi ma devi comunque sempre stare attendo alla quantità di danni che ti farà. Campioni efficaci contro illaoi possono essere darius, gp (se giocato bene, perchè ha molta mobilità e puoi arrassarla di q e di barili) o anche garen, io addirittura giocavo talon top con ignite e vincevo facendo piccoli trade e quando arrivava a low hp ci ingaggiavo di brutto. In ogni caso devi avere molta manualità nell'essere veloce a fare i trade e, a meno che tu non snowballi tanto, al livello sei devi sempre stare attendo perchè purtroppo oneshotta anche i tank.","replies":[]},{"poster":"vondarck","date":"2018-07-16T14:38:54.855+0000","up_votes":1,"down_votes":0,"body":"I darkin in geneale non le piacciono (raast e aatrox).\nEscludendo ranged puri ti potrei consigliare gnar che le da molta noia con la ulti\n\nPoppy le da noia (dovresti almeno sopravvuverle alla fase di linea)\n\nDarius se la può giocare\n\nOgnu executioner calling è tuo amico (ferita grave, riduzuone cure)\n\nTrindamere può gestirsela bene o male\n\nFiora","replies":[]},{"poster":"IoAmoIlLatte","date":"2018-07-15T19:06:19.422+0000","up_votes":1,"down_votes":0,"body":"Un semplice Yasuo toplane potrebbe risolvere i tuoi problemi... Molta mobilità tra i minion per schivare i tentacoli di Illaoi, possibilità di pulire waves facilmente e di usare il tuo muro del vento per difenderti da un eventuale attacco quando sei lowhp. Una semplice combo di spell potrebbe regalarti una lane semplice e già vinta. Ovviamente se sai usare questo champ.\n\nIl nuovo Aatrox potrebbe aiutarti a counterare la sua suprema, Avendo poca mobilità, puoi aiutati con il facile waveclear della Q, farmare a distanza e dare qualche hit significativa ad Illaoi potrebbe rallentare il suo pressing iniziale. Ricordati che anche se hai una resurrezione a comando(dopo il 6), divare sotto torre avversaria contro Illaoi è quasi un suicidio. \n\nPuoi sempre usare una fascia d'argento vivo per rimuovere i rallentamenti. Puoi provare a bannare sempre Illaoi per non aver quel matchup. Puoi chiedere al jngler di scegliere pick forti contro Illaoi, tipo skarner, XinZhao, Graves.","replies":[]},{"poster":"Re Sombra","date":"2018-07-15T16:00:27.455+0000","up_votes":1,"down_votes":0,"body":"prova jayce","replies":[]},{"poster":"Ignotum ITA","date":"2018-07-15T13:20:29.365+0000","up_votes":1,"down_votes":0,"body":"Ultimamente con yorick ho trovato un buon contrasto contro illaoi, ma c'è anche un'altra cosa da notare. la bravura tua e del player Illaoi. se non sei molto bravo ti consiglio di farti richiedere più di una gank in lane, così da trovar molto vantaggio che facendo delle skill cade subito, quando sai che tu sei più bravo, ti devi aspettare di tutto. Camperate nei bush.. Gank ogni tot minuti, Roam del midlaner. Ricorda una sola cosa se sei contro Illaoi, se prendi una kill, è vinta la lane. \n\nOppure semplicemente ti consiglio di permabannarla in ranked\n {{sticker:sg-syndra}}","replies":[]},{"poster":"Darkinknight","date":"2018-07-15T09:41:13.095+0000","up_votes":1,"down_votes":0,"body":"Potrei spiegarti nel dettaglio,ma la verita che il modo migliore per imparare a giocare vs illaoi (in lane) è usarla qualche game. Ha enormi punti  di debolezza compensati da enormi punti di forza solo se l'avversario sbaglia.\nIn linea generale comunque devi giocare attorno alla sua E (tutti la sottovalutano,ma gia in lane è come se ti picchiasse 1 volta e mezzo se la prende e la traddi) e ricordarti che un gank non è sempre una buona idea.\nChamp come darius hanno un enorme vantaggio pre 6, leggero vantaggio post 6 e skill match up dalla black cleaver in poi.\nRenekton pure ha un early game piu forte,e puo punirla quando faila la E,ma devi giocartela di mordi e fuggi finche non hai un vantaggio.\nPhanteon invece non ha speranze se chi usa illaoi ha almeno 2 dita semiarticolate.\nCredo che anche il nuovo aatrox se la cavi piuttosto bene contro illaoi.\nA eccezione di darius comunque ti sconsiglio di provare a mandarla da 100 a 0 con un all in.","replies":[]},{"poster":"pinkmanTS","date":"2018-07-15T01:17:02.290+0000","up_votes":1,"down_votes":0,"body":"è importante prendere vantaggio prima del 6, in genere devi beitarli la e e se la missa hard ingaggiarlo e il trade in genere lo vinci. Darius Camille Aatrox(lui vince contro tutti) io con questi in genere riesco sempre a portarmi a casa la lane.","replies":[]},{"poster":"RGM Player","date":"2018-07-14T23:06:39.591+0000","up_votes":1,"down_votes":0,"body":"Schiva la E e scappa quando ulta","replies":[]}]}