{"poster":"Jacquelino","date":"2015-07-13T15:12:05.758+0000","title":"Mein Account wurde ohne Begründung Permanent Gebannt","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Guten Tag Beschw&ouml;rer,\r\n\r\nvor einigen Tagen spielte ich ganz normal eine runde Lol, bis ich dann aber aufeinmal Permanent gebannt wurde. F&uuml;r mich ohne erkenntlichen Grund.\r\nZu dem nennt Riot mir keinen Grund und antwortet mir zu dem nichtmals auf meine Anfragen. Deswegen auch hier der weg &uuml;ber das Forum.\r\nEine Email , wie es ist im Einloggbildschirm steht warum man gebannt sein und f&uuml;r weitere Informationen, habe ich auch nicht bekommen.\r\n\r\nIch bitte um HILFE!!\r\n\r\nMfG Jacquelino","replies":[{"poster":"Jacquelino","date":"2015-07-13T19:10:10.144+0000","up_votes":1,"down_votes":0,"body":"Ich habe nie RP gekauft oder ausgegeben. Habe sogar immer noch die 400rp die man von anfang an hat. Ich hatte noch nie eine Chat speere oder sonstiges.\nEin Ticket habe ich auch schon geschickt.\nAber trotzdem habe ich keine email bekommen obwohl ich eine bekommen hätte sollen. Mit weiteren Informationen zu meinen Bann..","replies":[{"poster":"Schorletrinker","date":"2017-06-09T12:48:05.209+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jacquelino,realm=EUW,application-id=7hciEY9w,discussion-id=zrzAfBLE,comment-id=0003,timestamp=2015-07-13T19:10:10.144+0000)\n>\n> Ich habe nie RP gekauft oder ausgegeben. \n\nDa ham wa ja det Probleeem!\nWie willst Du erwarten, daß wir Dich mitmachen lassen, wenn Du Dir nicht mal nen popeligen Skin leisten magst ?","replies":[]},{"poster":"schmürrgäll","date":"2015-07-14T11:56:07.910+0000","up_votes":1,"down_votes":0,"body":"wie kann man jemanden wegen falschen reportet melden?","replies":[]}]},{"poster":"Suffron khalid","date":"2017-06-09T12:21:18.757+0000","up_votes":1,"down_votes":0,"body":"Guten Tag an alle, denen es ähnlich geht, ich wurde anscheinend gestern Abend/Nacht gebannt und bisher konnte ich weder ein Grund finden, noch wie lange mein account nun wirklich geperrt ist o.O. Auf jeden Fall würde ich gern eine Antwort von Riot und hoffe niemandem ergeht es genauso... ;((","replies":[{"poster":"legofreak1","date":"2017-06-09T12:38:45.089+0000","up_votes":1,"down_votes":0,"body":"Wenn du Informationen zu deinem Bann erhalten möchtest und dir diese nicht zugesendet wurden, wende dich bitte per Ticket an den [Support](https://support.riotgames.com/hc/de/requests/new).","replies":[]}]},{"poster":"Chaosschnitzel7","date":"2016-02-19T13:44:03.843+0000","up_votes":1,"down_votes":0,"body":"Maann ein freund hat auf meinem acc gespielt und nichts gemacht doch dann wurde ich einfach perma gebannt ohne grund ich bitte um hilfe!!","replies":[{"poster":"Rainbow Dashie","date":"2016-02-19T17:19:30.489+0000","up_votes":1,"down_votes":0,"body":"1. Du bekommst eine Mail\n2. wenn du über einen Ban diskutieren möchtest bitte einen eigenen Thread [hier](http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de) erstellen und keinen 7 monate alten Thread ausgraben.\n3. könnte es durch Accountsharing geschehen sein\n\n>Sie dürfen Ihr Konto keinem anderen außer den hier Genannten zugänglich machen, und Sie alleine sind für die Vertraulichkeit Ihrer Anmeldedaten und aller von Ihrem Konto ausgehenden Aktivitäten (einschließlich Einkäufe und Buchungen, falls zutreffend) verantwortlich.\n\nhttp://euw.leagueoflegends.com/de/legal/termsofuse Abschnitt 3 C","replies":[]},{"poster":"Bergelmir32","date":"2016-02-19T13:50:54.343+0000","up_votes":1,"down_votes":0,"body":"Ohne Grund? Wie wärs mit Acc Sharing verboten?","replies":[]}]},{"poster":"schmürrgäll","date":"2015-07-14T11:55:33.179+0000","up_votes":1,"down_votes":1,"body":"ich wurde auch gerade jetzt das 2 mal schon ohne richtigen Grund gebannt.\nEs kann nicht sein, nur weil manche nicht Spielen können das die dann jemanden Reporten der sogar noch versucht denen zu helfen. Das die z.b die richtigen Items kaufen etc. nein Sowas wird hart abgelehnt mit Beleidigungen etc. Ich frage mich langsam was für kleine Kinder dieses Spiel spielen. Die vertragen ja nicht mal Sarkasmus xD Und wegen den Leuten weil ich versucht habe zu helfen wurde ich gerade 2 Wochen gebannt. OHNE GRUND\nWird man jetzt gebannt weil man sein maul auf macht oder was?","replies":[{"poster":"legofreak1","date":"2015-07-14T12:37:12.817+0000","up_votes":1,"down_votes":0,"body":"Wenn du deinen Bann diskutieren möchtest, tu dies bitte im richtigen Forum:\nhttp://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de\nOhne den dir zugesendeten Chatverlauf, wird dort aber auch keine Diskussion stattfinden.","replies":[]}]},{"poster":"Synatics","date":"2015-07-13T16:14:58.838+0000","up_votes":1,"down_votes":0,"body":"Per Bankeinzug RP gekauft aber kein Geld drauf? Scripts benutzt? Andere 3rd party programme? Wiederholte harte Beleidigung (Rassistisch, homophob, sexuell...)?","replies":[]},{"poster":"BiillabonG","date":"2015-07-13T16:10:57.150+0000","up_votes":1,"down_votes":0,"body":"Niemand wird grundlos gebannt hast mit sicherheit was angestellt \nder support wird dir bestimmt sagen womit du das verdient hast \nwie gesagt alles hat seinen grund","replies":[]},{"poster":"Tiaryn","date":"2015-07-13T16:08:29.698+0000","up_votes":1,"down_votes":0,"body":"Wie hast du versucht Riot zu erreichen?\nWenn du es über den Support versuchst, dann musst du einfach abwarten.\nKeine Tickets spammen oder immer wieder nachfragen wie lange es dauert.","replies":[]}]}