{"poster":"Lysergsäure","date":"2015-11-03T19:43:23.507+0000","title":"Diana RQ Combo ?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Nabend,\r\n\r\naktuell versuche ich Diana zu perfektionieren und teste mich an der RQ Combo, sprich ich Caste im R-Flug die Q und erhalte den Reset.\r\nLaut YouTube und vielen Artikeln ist dies schwierig aber m&ouml;glich, jedoch hab ich es in einer Stunde Custom-Games nicht einmal wirklich den Effekt hinbekommen, wie er in den Videos zustande kommt.\r\nIst die Combo &uuml;berhaupt noch m&ouml;glich ?\r\nFalls ja, kann mir jemand eventuell noch ein paar Sachen nennen,die ich beachten sollte ?\r\n\r\nMfG","replies":[{"poster":"68 73 77 65","date":"2015-11-03T19:57:20.739+0000","up_votes":1,"down_votes":0,"body":"Sie geht, ja. Man muss einfach R und wirklich instant danach die Q.. und wenn du es nicht schaffst, bist du einfach zu langsam. ^^ Ein guter Ping wäre auch vorteilhaft. :D","replies":[{"poster":"FDG DragonSlayer","date":"2015-11-08T07:59:17.625+0000","up_votes":1,"down_votes":0,"body":"Geht nicht immer egal wieviel du es übst ;) aber q und r gleichzeitig drücken klappt.","replies":[]}]},{"poster":"i3IackCat","date":"2015-11-08T03:45:05.485+0000","up_votes":1,"down_votes":0,"body":"...\n...\n...\nWieso will man Diana überhaupt üben?","replies":[]},{"poster":"Lysergsäure","date":"2015-11-04T13:39:42.012+0000","up_votes":1,"down_votes":0,"body":"Für die Spezialisten, ich meine wirklich R-Q und nicht Q-R, da liegen Welten zwischen, denn bei der RQ gibt es keine möglichkeit zum Dodge der Q.\n\nIch habe meistens einen ping um 28, daran wird es dann wohl liegen..","replies":[]},{"poster":"Der Wohltäter","date":"2015-11-03T20:29:42.678+0000","up_votes":1,"down_votes":1,"body":"Du könntest allerdings auch einfach die Q vor der R schmeißen. Das sollte aufs selbe hinaus laufen.","replies":[{"poster":"haha weed lol xd","date":"2015-11-03T20:45:41.797+0000","up_votes":1,"down_votes":0,"body":"Und gibt dem Gegner mehr Zeit zum reagieren.","replies":[{"poster":"Der Wohltäter","date":"2015-11-04T12:16:27.237+0000","up_votes":1,"down_votes":1,"body":"Nicht mal ansatzweise. Probier es aus dann wirst du es sehen.","replies":[{"poster":"haha weed lol xd","date":"2015-11-04T13:30:31.654+0000","up_votes":1,"down_votes":0,"body":"Ich spiele diesen Champion seit gut und gerne 2 Jahren als Main Champion. \nIch habe es oft genug ausprobiert.","replies":[]}]}]}]},{"poster":"Kata Ga Kill","date":"2015-11-04T07:49:32.658+0000","up_votes":1,"down_votes":0,"body":"Ist mir neu das Diana während des R Ihre Spells casten kann.....\n\nSoweit ich weis muss man Q und direkt sofort (also q hat noch nicht getroffen und befindet sich auf der flugbahn) schon R casten damit die QR Kombo funktioniert.","replies":[]},{"poster":"Crounty","date":"2015-11-03T21:17:36.186+0000","up_votes":1,"down_votes":0,"body":"Es ist machbar, aber sehr schwer, jemand hat mal hier das ganze mit Makros getestet und die Chance lag selbst da nicht bei 100% sondern bei glaub 50%","replies":[{"poster":"haha weed lol xd","date":"2015-11-03T21:30:51.032+0000","up_votes":1,"down_votes":0,"body":"Wat ? Es ist ziemlich einfach wenn man den Dreh raus hat.","replies":[{"poster":"Crounty","date":"2015-11-03T21:32:41.189+0000","up_votes":1,"down_votes":0,"body":"Dann filme das bitte, ich habs schonmal ausprobiert und bei mir hats nie funktioniert.\n\nEdit: \n> He talked about it the other day. He said the RQ combo is possible but it is too inconsistent to use in an actual game. He says he never goes for it because if it fails you fuck yourself over. Considering he has like 2k Diana games this season alone I think its safe to say that you shouldn't bother trying.\n\n\nQuelle: https://www.reddit.com/r/leagueoflegends/comments/2rdeyr/diana_mains_how_the_hell_do_you_pull_off_that_rq/cnev07z","replies":[{"poster":"haha weed lol xd","date":"2015-11-03T21:34:03.489+0000","up_votes":1,"down_votes":0,"body":"Werde ich machen. \nIst wie Lee Sins Wardhop, nach tausenden Versuchen hat man es schlussendlich drauf und kann es im Schlaf.\n\nEDIT: \n\nKommt stark auf den Ping an. Spiele mit nem 14 Ping. Ab 25 Ping sollte man Probleme haben. \nEs ist ganz einfach erklärt. Während du ultest und du Q castest bist du schon kurz vor dem Gegner. Dein Cast der Q und deren Animation fängt wenige Einheiten vor Diana an und hat zuerst einen höheren Speed als die Ult fällt aber dann rasant ab. Sprich es ist eigentlich nur Ping und Übungssache. \n\nUnd du kannst mir 1000 Reddit Posts raus suchen, nur weil ein Mensch das sagt. Ich hab hunderte an Spiele mit Diana seit Anfang Season 4 gespielt und **weiß**, dass es funktioniert. ","replies":[{"poster":"Crounty","date":"2015-11-03T21:53:06.170+0000","up_votes":1,"down_votes":0,"body":"Ich hab nen 27 Ping könnte daran liegen.\n\nEdit: Ich hab ja nicht gesagt dass es nicht funktioniert, ich meinte nur dass die Chancen dafür nicht hoch sind.","replies":[{"poster":"haha weed lol xd","date":"2015-11-03T22:00:37.362+0000","up_votes":1,"down_votes":0,"body":"Denke eher, dass liegt daran dass man die Q nicht trifft. oder zu weit macht. Man sollte sie relativ nah casten, da sie am Ende eine kleine \" AoE - Explosion \" macht und man dadurch eher die Markierung drauf bekommt. \nWenn man es zu weit macht fliegt die Q langsamer als die Ult.","replies":[{"poster":"Crounty","date":"2015-11-03T22:03:21.510+0000","up_votes":1,"down_votes":0,"body":"Achso okay, hab ich was dazu gelernt.Klingt auch logisch.","replies":[{"poster":"haha weed lol xd","date":"2015-11-03T22:15:25.718+0000","up_votes":1,"down_votes":0,"body":"Noch ein Tipp: \n\nDu kannst während der Ultimate schon deine E casten um die Casttime zu verringern und dein Ziel schneller zu bursten. \n\nAuch Lee Sin 2 Q oder Rengars ( oder LB W usw, jegliche Art von Dashes )  sprung usw kannst du damit canceln, falls du das nicht wusstest :D","replies":[{"poster":"Crounty","date":"2015-11-03T22:45:31.120+0000","up_votes":1,"down_votes":0,"body":"Danke das mit dem Lee Sin Q abbrechen etc wusste ich schon aber das mit der Casttime nicht. Was man noch so lernen kann ^^","replies":[]}]}]}]}]}]}]}]}]},{"poster":"haha weed lol xd","date":"2015-11-03T20:46:10.330+0000","up_votes":1,"down_votes":0,"body":"Klappt noch. \nEinfach R und keine Sekunde danach Q. Wenn du die Q halt nicht trifft bist du im Eimer btw :D","replies":[]}]}