{"poster":"Vyacheslav ","date":"2016-06-21T00:18:26.091+0000","title":"Problemas en el servidor.","subforum":"Charlas Generales","embed":{"description":"Uploaded by Chris Murillo on 2015-08-29.","url":"https://www.youtube.com/watch?v=lA3nRatlA0I&feature=youtu.be","image":"https://i.ytimg.com/vi/lA3nRatlA0I/hqdefault.jpg"},"up_votes":1,"down_votes":1,"body":"Hola gente vengo a traerles este v&iacute;deo (Que no es mio) Pero me pasa exactamente lo mismo, como dice ah&iacute; &quot;Lag con ping estable&quot; La verdad quisiera saber si a alguien mas le ocurre este problema, hace dos para tres semanas voy lidiando con esto, ya no puedo mas, no se que hacer, llamo a la compa&ntilde;&iacute;a que me brinda internet y me dicen que no hay ning&uacute;n problema, actualizo los drivers de la tarjeta gr&aacute;fica, sigue igual, le di reparar, sigue igual, desinstale el lol y lo instale de nuevo, sigue igual, ya no se que hacer, y la verdad le escribo al soporte y me mandan a actualizar los drivers sabiendo que ya los tengo actualizados, hice de todo pero sigue, si alguien sabe alguna soluci&oacute;n a este problema, le agradezco mucho que me la diga!","replies":[{"poster":"Pablove90","date":"2016-06-21T04:33:28.707+0000","up_votes":1,"down_votes":0,"body":"igualmente tus fps bajan a 20 o menos (la congelada no permite ver el numero real)\nahi ya tenes 2 problemas... no solo la perdida de datos o picos de ping\n\n* Tendrias que hacer un tracert y mostrarnos(https://support.riotgames.com/hc/es-419/articles/201752674--Registros-de-redes-sistemas-y-League-of-Legends) \n\n* Tambien especificar que maquina usas (si no te das maña usa el everest y manda captura)\n\n* Que velocidad de internet que compania (manda una captura de un test http://www.speedtest.net )\n\n* Como llega ese servicio  (nodo fibra adsl) usas router o modem? o ambas? \n\n\nhace un nuevo post mas especifico y a cada uno de aca que se ofrecio a ayudarte manda el link del nuevo post asi tenes los que ya se ofrecieron y los que se van a sumar","replies":[]},{"poster":"ZeNch","date":"2016-06-21T00:28:06.820+0000","up_votes":1,"down_votes":0,"body":"Es perdida de paquetes, el peor enemigo del gamer, habla con soporte al jugador y enviales un tracert si no sabes como hacer ellos te diran como (en la parte de soporte al jugador si buscas te dice igualmente como hacerlo) quizas es un mal ruteo o quizas tu compañia no te esta diciendo la verdad aprobechando la ignorancia del estado de tu red... digamos que se hacen los tontos.\n\nlos de riot te podrian acesorar mejor, yo tuve varias veces pero como lo explique detalladamente no les quedo otra que mandar gente a la zona por que yo no era el unico con este problema solo que usuarios normales (que no juegan online) quizas ni se dan cuenta ... \"uh se me desconecto el chat de face y se me reconecto a los 3 segundos... que raro\" y ni llaman... en los juegos ya sabes lo que genera... y si se extiende mucho o es muy alto el packet loss en el lol te marca 500 ping, pero solo si es muy extremo hasta el hecho de desconectarte quizas.","replies":[{"poster":"Vyacheslav ","date":"2016-06-21T00:33:26.007+0000","up_votes":1,"down_votes":0,"body":"Yo ya les eh enviado todo lo que me piden, pero no me dan una solución en el soporte, digamos que este problema lo vengo bancando hace 3 semanas, y hace un par de días me andaba re bien, ahora comenzó de nuevo,  pero eso del video me ocurre siempre que juego ahora, es imposible, das un click y te demora 3 minutos en caminar el champ, ya no se que hacer con esto","replies":[{"poster":"ZeNch","date":"2016-06-21T00:55:36.779+0000","up_votes":1,"down_votes":0,"body":"Tenes que hacer un Tracert a la IP del server, otro a una IP DNS de google (8.8.8.8 o 8.8.4.4) y otro si queres estar mas seguro, dejarlo cada uno unos 10 minutos aprox y ver si tu problema de perdida de paquetes es solo con el server o con otros host tambien....\nDe ser solo con el server reabri el ticket y comentalo...\nDe ser con otros host tambien llama a tu compañia ISP...\n\nsi les decis no me anda bien el lol se traba y cosas asi se te van a reir en la cara y te van a decir que no es responsabilidad de ellos y que tu coneccion esta bien...\n\nSi en cambio les decis algo como esto:\nBuenos dias/tardes/noches desde hace unas semanas tenia Problemas de Packet Loss (perdida de paquetes) y no se hicieron cargo atribuyendo que era problema del servidor al que me conecto sin embargo ultimamente me esta ocacionando desconecciones en chats, se traban descargas de sitios como youtube/soundcloud y hasta a veces me obliga a usar F5 para reiniciar la coneccion/descarga. Ya hice varios Tracerts a diferentes dominios y el resultado es el mismo.\n\nO podes evitar decir \"y no se hicieron cargo atribuyendo que era problema del servidor al que me conecto\" y decir simplemente tu problema para evitar demostrarte disconforme y que se genere una mala onda en la atencion.\n\nLa otra solucion son antorchas y mucho fuego...\n\n\n\nPara los tracerts que sean mas comodos de usar y ver podes usar WINMTR lo recomiendan como alternativa en la web soporte del lol y es el que yo uso ya que ves el resultado en vivo y en directo y aparte te permite copiarlo al portapapeles con un click... nada mas comodo que una interfaz visual simple","replies":[{"poster":"Vyacheslav ","date":"2016-06-21T01:07:55.487+0000","up_votes":1,"down_votes":0,"body":"Me parece que les diré que hace semanas tengo estos problemas, (Mas la segunda opción que me dijiste) Y que lamentablemente daré de baja al servicio, quizás ahi muevan las manos y arreglen estos problemas, lo raro que también me sucede en el cs, creo que si es claramente problema de mi proveedor, Bueno amigo, muchas gracias por tu tiempo y tus respuestas , un saludo!","replies":[{"poster":"ZeNch","date":"2016-06-21T01:46:21.468+0000","up_votes":1,"down_votes":0,"body":"recomiendo que digas lo de los tracerts a diferentes dominios, la perdida de paquetes y que si bien no es notorio al cargar webs se nota al ver videos, en chats, en juegos online.\n\nasi se ponen las pilas... siempre fue asi... si te doy un servicio o garantia voy a apelar a tu ignorancia (sin ofender! todos somos ignorantes de o en algo.) para lavarse las manos y no hacerse cargo... pero cuando te instruis, consultas o sabes es dificil que se hagan los tontos.","replies":[{"poster":"Vyacheslav ","date":"2016-06-21T01:50:45.767+0000","up_votes":1,"down_votes":0,"body":"Tal cual, sos de las? Pasame tu nick que te agrego y seguimos hablando por ahi si quieres !","replies":[{"poster":"Arconoid","date":"2016-06-21T02:32:14.360+0000","up_votes":1,"down_votes":0,"body":"estas viendo su nombre y le pedis su nick\ngenius{{sticker:zombie-brand-facepalm}}","replies":[]}]}]}]}]}]}]}]}