{"poster":"Divewing","date":"2016-11-04T08:50:17.792+0000","title":"I realise Riot ignoring us isn't fair or right","subforum":"Gameplay","up_votes":1,"down_votes":5,"body":"But if they honestly pulled every &quot;negative change&quot; from the PBE nothing would ever happen.\r\nI&#039;m kinda surprised Akali and Shaco haven&#039;t received that much attention, but in regards to the plant thing, god damn give them a break.\r\nThey have made several changes to spawn rates, times, locations, all in response to complaints, yet you all are refusing to give it a chance.\r\n\r\nFunny thing is, I bet if Riot reverted the Shaco and Akali changes, there&#039;d inevitably reach a point where people would mass post about how bullshit they are/were.\r\nBecause it happened with Lee.\r\nAnd it happened with Riven.\r\n\r\nAgain, I&#039;m not saying we should all get on our knees and beg forgiveness, but damn can we not give them a chance (at least in regards to the plan things)?\r\nSomething else I&#039;d like to point out, Shaco and Akali are on the list for VGUs.","replies":[{"poster":"Fairyfleur","date":"2016-11-04T12:39:43.044+0000","up_votes":1,"down_votes":0,"body":" They're doing so much in the pre-season that people have wanted for a long time, but everyone wants to complain instead.","replies":[]},{"poster":"Limmie","date":"2016-11-04T09:53:22.497+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lancir,realm=OCE,application-id=3ErqAdtq,discussion-id=YhEadVYY,comment-id=,timestamp=2016-11-04T08:50:17.792+0000)\n> Something else I'd like to point out, Shaco and Akali are on the list for VGUs.\n\nGreat, all we have to do is put up with that ridiculous reworked Akali while they finish reworking Warwick, Galio, Ryze, Urgot, Ryze, Evelynn, Ryze and Shaco.\n\nJokes aside, there's no way her VGU is coming out before September at least so that's hardly any comfort.","replies":[{"poster":"Divewing","date":"2016-11-04T10:26:16.070+0000","up_votes":1,"down_votes":0,"body":"Point is acting like these reworks are the be-all-end-all is silly","replies":[]}]}]}