{"poster":"Bruder mûss Los","date":"2018-11-30T08:47:43.249+0000","title":"Viel zu Stark in der Meta?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":5,"body":"**Siehe Umfrage!**\r\n\r\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"Qbert","date":"2018-11-30T08:49:07.174+0000","up_votes":1,"down_votes":0,"body":"Mir fehlt da leider ein weder noch.\n\nKlar, sind alle stark und snowballen stark ... aber das tun andere Champs auch.\nRiot will ja die Spiele schneller gestalten.\n\nCamille ist natürlich schon ziemlich krass, dennoch bekommst du sie auch unter Kontrolle.","replies":[{"poster":"Pure Cynicism","date":"2018-11-30T08:57:28.927+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=Wj1wcocU,discussion-id=x9MR5NZk,comment-id=0000,timestamp=2018-11-30T08:49:07.174+0000)\n>\n> Riot will ja die Spiele schneller gestalten.\n> \n\nMacht ja auch total Sinn, wenn man sich die Probleme über diese Saison hinweg mal durch den Kopf gehen lässt: Übertriebener Schaden, schlechtes Balancing, zu starke Assassins, extrem snowballlastig. Riots Anwort: Neeko und schnellere Spiele. \n\nEgal, einfach nicht aufregen.","replies":[{"poster":"Qbert","date":"2018-11-30T08:59:25.988+0000","up_votes":1,"down_votes":0,"body":"Genau, einfach nicht aufregen.\n\nIch finde es gut, dass die Meta teilweise so extrem umgekrempelt wird.","replies":[{"poster":"Pure Cynicism","date":"2018-11-30T09:12:34.575+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=Wj1wcocU,discussion-id=x9MR5NZk,comment-id=000000010000,timestamp=2018-11-30T08:59:25.988+0000)\n>\n> Genau, einfach nicht aufregen.\n> \n> Ich finde es gut, dass die Meta teilweise so extrem umgekrempelt wird.\n\nEs gab aber Zeiten, da war die Meta nicht so wichtig. Wenn du heute als Tank auf der Toplane mit Teleport, als Controll-Mage mit Barrier oder als Crit-Adc SoloQ spielen willst, brauchst du einfach ein extrem dickes Fell. Früher war alles irgendwie ganz gut spielbar. Heute sind die Zeiten völlig vorbei. \n\nGerade als Tank verlierst du gegen jeden guten Carry dank Ignite und Conqueror schon die Lane, von der Sidelane gar nicht zu reden. Controll-Mages spielen dank Assassins kaum eine Rolle und Crit-Adcs bekommen ihre Items nicht, bevor das Spiel zu Ende ist.\n\nIch finde die ausgeglichenen 40 Minuten Games immer am interessantesten. Wenn man nicht weiß, wer am Ende gewinnt und es mehr auf Taktik als auf Outplays ankommt. Aber solche Spiele gibt es nicht mehr. Heute stompst du dank Ignite und dem hohen Schaden die Lane, machst dann früh bei Minute 20 Nash und holst dir direkt zwei Inhibs. Damit ist das Spiel so gut wie entschieden. \n\nWenn Riot möchte, dass wir alle mit Yasuo, Riven, Talon und Zed facerollen, dann sollen sie Blitz zurückbringen. Der ganze Rest kann dann vernünftige Games spielen. \n\nAber ich gebe gerne zu, dass das nur meine Meinung ist. Und die meiner Freunde, von denen kaum noch jemand spielt. Es ist einfach schade, in welche Richtung sich LoL entwickelt. Nämlich in die Richtung \"15 Minuten roflstomp für zwischendurch\".","replies":[{"poster":"SuicidePlank","date":"2018-11-30T09:17:44.495+0000","up_votes":2,"down_votes":0,"body":"> Ich finde die ausgeglichenen 40 Minuten Games immer am interessantesten.\n\nGenau das fehlt mir auch. Was bringt mir jetzt ein Lategame Champ? Die Games sind zum einen extrem schnell vorbei und zum anderen sind ausgeglichene Spiele sehr, sehr rar. \nEntweder stomped mein Team die Gegner und die haben keinen Spaß mehr, oder umgekehrt.\n Klar, man kann von behind spielen, man kann eigentlich noch gewinnen..aber die ganze Zeit von allen möglichen Krimskrams geoneshotted zu werden...mir macht das eigentlich kaum noch Spaß.\nEs fehlt mir die Spannung die ein langes Game hat, die Teamfights bei denen mir die Pumpe geht. \nDas hat League für mich eigentlich so reizvoll gemacht.","replies":[]},{"poster":"Qbert","date":"2018-11-30T09:19:33.966+0000","up_votes":1,"down_votes":1,"body":"Nexus Blitz kommt ja :D \n\nIch verstehe auch deine Meinung und gebe dir in Auszügen Recht.\nEs gab Zeiten da hast du auch ADC mid gespielt .... aber, und das finde ich gut, Riot würfelt mittlerweile zwischen den Seasons alles neu aus.\nDas endet während der Preseason bisher immer im Chaos und in Beschwerden aber wenn dann die Season losgeht dauert's nicht lange und alles grooved sich ein.\n\nIch sage ja nicht, dass das alles toll ist.\nWas ich aber sage ist, wir müssen uns etwas gedulden und das es immer Phasen geben wird, die dir gefallen aber anderen nicht und umgekehrt.","replies":[{"poster":"SSI CptHaunted","date":"2018-11-30T09:35:23.661+0000","up_votes":1,"down_votes":0,"body":"Na ja, diese Season haben sie es nicht nur zwischen den Seasons ordentllich durchgewürfelt.","replies":[]}]},{"poster":"Bruder mûss Los","date":"2018-11-30T09:14:50.949+0000","up_votes":1,"down_votes":0,"body":"Gebe dir Recht!...","replies":[]}]}]},{"poster":"00 M4ddin 00","date":"2018-11-30T09:01:30.312+0000","up_votes":2,"down_votes":0,"body":"Neeko <3","replies":[]}]},{"poster":"Bruder mûss Los","date":"2018-11-30T08:51:22.558+0000","up_votes":1,"down_votes":0,"body":"Interessant. Ich allerdings finde speziell diese 4 Champs absolut nervig...","replies":[{"poster":"Qbert","date":"2018-11-30T09:00:07.732+0000","up_votes":1,"down_votes":0,"body":"Da gebe ich dir Recht.\nGerade gut gespielt sind sie nur schwer unter Kontrolle zu bringen. Aber so ist das leider ... warten wir ab, wie es sich bis zur nächsten Saison alles entwickelt.\n\nDie Preseason ist ja für ihre Extreme bekannt :)","replies":[{"poster":"Bruder mûss Los","date":"2018-11-30T09:05:04.861+0000","up_votes":1,"down_votes":0,"body":"Kleines Beispiel: Ich Ori > 12-0... das ganze game gutes Poss., roaming etc.\nDann wurde ich trotz guter Poss. und Flash von Kayn gef****…\n...Game verloren! GG :D","replies":[{"poster":"Qbert","date":"2018-11-30T09:07:03.440+0000","up_votes":1,"down_votes":0,"body":"da rennst du bei mir offene Türen ein :)","replies":[{"poster":"Bruder mûss Los","date":"2018-11-30T09:10:26.485+0000","up_votes":1,"down_votes":0,"body":"{{sticker:poppy-wink}}","replies":[]}]}]}]}]}]},{"poster":"Haasinger","date":"2018-12-05T17:24:46.419+0000","up_votes":1,"down_votes":0,"body":"Pyke\nExtrem skillabhängig und sehr nervig wenn man auf OTPs trifft. Zudem auch sehr glitschig. Wenn es nach mit ginge sollte er evtl ein defensives Tool weniger haben, oder der Hook nur \"ziehen\" anstatt über ihn drüber werfen. Bin aber kein Bot Main und kann das schwer beurteilen.\n\nCamille\nAbsolut fine im Moment. Gutes Early, mieses Mid und starkes Lategame.\n\nIrelia\nBraucht noch einen kleinen Nerf damit ich sie mal ordentlich lernen kann. Zudem mag ich sie in der Mitte nicht. Gegen die meisten Bruiser ist sie fine. Aber dass sie Ranged Champs zerlegt finde ich etwas unpassend. Ihr all in Potential sollte minimal generft werden sodass sie bis ins frühe Lategame eine weniger dominante Rolle einnimmt.\n\nKayn\nDa ich ihn selbst nicht spiele schwer zu beurteilen. Finde den Heal im Lategame for allem in Random Teams schwer zu handeln, könnte von mir aus den Heal halbiert bekommen und dafür etwas mehr HP o.Ä..","replies":[]},{"poster":"Kata Ga Kill","date":"2018-12-04T21:18:19.143+0000","up_votes":1,"down_votes":0,"body":"Irelia Q reset Nerf - Bei Reset auf 1 sec CD setzten und nicht kompletter reset.\nPykes R scaling nerfen.\nKayn bissel abschwächen.\nKarthus extrem nerfen, du hast Karthus vergessen Boy. Long range 1 sec CD Q GG. Bringt jeden Top, Mid zum tilten, besonders ADCs haben hier keine Chanche.\n\nCamille who cares? Sie hat ohnehin schlechten Jungle Clear Speed, weder guten Sustain.\n\nUdyr und Vlad mit kaum schwächen sind ne größere unfairniss im Gameplay.","replies":[]},{"poster":"KogaTheWolfhog","date":"2018-12-03T15:54:29.841+0000","up_votes":1,"down_votes":0,"body":"Ich muss dabei aber anmerken, dass besonders Camille und Irelia im Gegnerteam immer 12/0 oder so stehen wenn ich auf meiner Rolle als ADC spiele O.o..... sind diese Champs aber in meinem Team... dann ist es genau anders rum {{sticker:zombie-brand-facepalm}}  Also denke ich mal, dass es einfach auf den Spieler ankommt. Wenn jemand die Champs nicht beherrscht, dann bringt es auch nichts wenn diese gerade ziemlich \"broken\" sind.\nDa finde ich Zed, Kai'sa und und LeBlanc gerade schlimmer. Weil egal wie schlecht die spielen... die bekommen immer iwie an ihre Kills...\n\nNaja... finde das ganze oneshotten langsam langweiig xD aber wird wieder andere Zeiten kommen.{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Bruder mûss Los","date":"2018-11-30T12:06:29.341+0000","up_votes":1,"down_votes":0,"body":"Was sagt ihr zu dem Zwischenergebnis der Umfrage?...\n...Ich für meinen Teil bin überrascht, dass die Mehrheit kein Problem mit den 4 Champions hat!... \n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"DanionVibit","date":"2018-11-30T12:10:18.696+0000","up_votes":1,"down_votes":0,"body":"Sie sind nicht stark. Alle von diesen Champs haben counterplay. Wenn du es so willst ist jeder Champ auf seine Art nervig. Ich banne pyke z. B. wenn ich auf der ADC Position spiele, weil ich gegen diesen nicht mit meinem Champion Pool spielen kann. Auf der Top banne ich Darius, im Jungle banne ich Evelyn und in der Mitte Zed.\n\nNicht weil sie broke sind sondern weil sie meinen Champion Pool zu stark einschränken.","replies":[{"poster":"Bruder mûss Los","date":"2018-11-30T13:35:25.118+0000","up_votes":1,"down_votes":4,"body":"Da haben wir definitiv differenzierte Ansichten... Ich würde niemals Darius, Zed und auch keine Eve bannen, weil man diese Champs OUTPLAYEN kann!!!...\nWie kann man eine Camille´´ R´´ OUTPLAYEN???... Sag es mir du Platin Gott...\nPyke, Irelia, Kayn, Camille... Sind deiner Meinung nach nicht stark...?! \n\nGG an der Stelle...  \nLG Rico \n\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"DanionVibit","date":"2018-11-30T14:05:51.222+0000","up_votes":2,"down_votes":2,"body":"Blue-kayne, camille und Irelia haben starke Probleme gegen ein ganzes Team zu spielen also turtle zusammen. Pyke ist nur stark sobald er snowballed. Red-kayne spiked erst im mid-lategame. Generell musst du gegen genannte champs eben dein Item build anpassen, nicht stumpf das gleiche bauen und verhalten adaptieren :)\n\nWenn du keine Argumente bringen kannst dann lass doch eine Diskussion sein. :) ","replies":[]}]}]}]},{"poster":"00 M4ddin 00","date":"2018-11-30T08:51:30.112+0000","up_votes":1,"down_votes":0,"body":"Find nur kayn bräuchte ein bißchen Anpassung ist schon krass wenn man von ihm geoneshotet wird ^^'","replies":[{"poster":"Bruder mûss Los","date":"2018-11-30T08:52:54.349+0000","up_votes":1,"down_votes":0,"body":"1. Das und 2. sein heal im Late- und Midgame...","replies":[{"poster":"00 M4ddin 00","date":"2018-11-30T08:55:02.452+0000","up_votes":1,"down_votes":0,"body":"Und Mobilität und seine cc und die Möglichkeit mit der ult Dogen zu können ^^'","replies":[{"poster":"Necromant","date":"2018-11-30T08:56:45.334+0000","up_votes":1,"down_votes":0,"body":"mit der ult kannst auch nur auf Champs dodgen ^^ sonst passiert da net viel.","replies":[{"poster":"00 M4ddin 00","date":"2018-11-30T09:01:08.891+0000","up_votes":1,"down_votes":0,"body":"Naja im richtigen Moment kannst du schon viele ults Dogen :P","replies":[{"poster":"Bruder mûss Los","date":"2018-11-30T09:05:51.204+0000","up_votes":1,"down_votes":0,"body":"Richtig!...","replies":[{"poster":"Necromant","date":"2018-11-30T09:07:10.937+0000","up_votes":1,"down_votes":0,"body":"nja ^^ :D\n\nAber tbh seh ich aktuell auch kein Game wo eine Person nicht in irgendeiner Art und Weise negativ auffällt. Ist halt PreSeason x)","replies":[{"poster":"00 M4ddin 00","date":"2018-11-30T09:10:53.770+0000","up_votes":1,"down_votes":1,"body":"Naja das ich eskalier liegt an meinen still und nichg an Leblanc oder preseason ^^","replies":[{"poster":"Necromant","date":"2018-11-30T09:11:31.832+0000","up_votes":1,"down_votes":0,"body":"x)","replies":[]}]},{"poster":"Bruder mûss Los","date":"2018-11-30T09:10:51.034+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-wink}}","replies":[]}]}]}]}]}]}]}]},{"poster":"Enderized","date":"2018-11-30T09:26:26.409+0000","up_votes":1,"down_votes":1,"body":"Camille's Kit ist halt nach wie vor überladen.\n\nLongrange Escape/Engage/Stun/AttackspeedSteroid gepaart mit\nDouble AA Reset + Truedamage zusammen mit\nAdaptive Shield und einem\nAoE Slow + Heal mit\nEiner Ultimate aus der man nicht entkommen kann, egal wie inkl. %HP Damage.\n\nPyke und Kayn finde ich i.O.\n\nIrelia eigl auch, obgleich sie für mein Empfinden zu viel Damage hat bei ihrer Mobilität + Damage Mitigation","replies":[]}]}