{"poster":"OneHourPhoto","date":"2017-11-19T13:24:46.277+0000","title":"riot por favor lee! vas a destrozar a mi main con el nerfeo a aery","subforum":"Jugabilidad, balance y narrativa","up_votes":1,"down_votes":16,"body":"maineo kassadin, uno de los 140 champs con peor fase de linea hasta el punto de que se la podria considerar patetica\n\nno puede matar al enemigo\nel waveclear es patetico\nlas chances de que vos le tires torre al enemigo son practicamente inexistentes\nlas chances de que te tiren torre son altisimas\nhacer roam no es tan conveniente como otros champs porque tenemos que concentrarnos en terminar la vara de las edades\nsomos forzados a utilizar absolutamente todo (items, summoners, runas) para asegurarnos que vamos a sobrevivir la fase de lineas y no ser destrozados en los primeros 10-15 minutos de la partida\nal ser melee se nos dificulta farmear cuando el enemigo esta ahi para pegarnos\npodemos meter da&ntilde;o con la Q nada mas que tiene 9 segundos de cd, ensima hay champs como el yasuo o el malzahar que tienen escudo de pasiva o sea que no le metemos nada\nsi nuestro jungla no juega bien y no gankea mid somos destrozados\ny podria seguir con otras 3 millones de razones\n\ny ahora ensima ustedes nerfean a aery tanto???????\n \nde 20-60 da&ntilde;o pasar a 15-40 es muchisimo!\n\nno solo nerfean da&ntilde;o base sino que tambien nerfean da&ntilde;o por escalado de nivel\n\nrealmente nose porque ustedes destrozan a ciertos champs porque hay otros que sacan ventajas con aery\n\nporque no buscan otra forma de hacer este cambio sin que mi pobre champ que no tiene otra runa decente que la aery reciba un nerf que no merece\n\nNO ES JUSTO ESTO!!!!!!!!!!!!!!!!\n{{sticker:sg-shisa}}","replies":[{"poster":"CamaleonaBugeada","date":"2017-11-19T14:32:27.782+0000","up_votes":6,"down_votes":1,"body":"Para empezar, no deberías usar a Aery con Kassa, se supone que deberías usar el Thunderlord nuevo, el meteorito, o de última la de disrupción de fase,  Aery es para los campeones de utility agresivos... (Sona, Lux, Lulu...)\n\n\n\nTeniendo todas esas opciones y que aún así optes por Aery, deja en claro que está bien el nerf. \n {{sticker:sg-lulu}}","replies":[{"poster":"WilfreCheesemice","date":"2017-11-19T21:58:02.386+0000","up_votes":1,"down_votes":0,"body":"Cleptomanía con sona y lulu for the win.","replies":[]},{"poster":"OneHourPhoto","date":"2017-11-19T18:45:25.145+0000","up_votes":1,"down_votes":2,"body":"JAJAJAJAJAJAJA, 0 idea tenes","replies":[]}]},{"poster":"dscpnak","date":"2017-11-19T13:40:07.836+0000","up_votes":2,"down_votes":1,"body":"usa electrocutar y a la mierda jaja","replies":[]},{"poster":"SKT T1 Bank","date":"2017-11-19T13:31:01.993+0000","up_votes":2,"down_votes":2,"body":"Aguante nerfear a kassa :)","replies":[{"poster":"Deigex","date":"2017-11-19T22:11:33.048+0000","up_votes":1,"down_votes":0,"body":"Una runa que es viable en todos los campeones sin desventajas claras no es nerf a kassa es el acomodar dicha runa para lo que debe ser utilizada y luego si hay campeones que están por detrás y realmente necesitan un Buff se verá más adelante.","replies":[]},{"poster":"69LUCIFER69","date":"2017-11-19T14:12:51.149+0000","up_votes":1,"down_votes":0,"body":"yo lo conocía por nerfeadin, fue raro que ya no lo nerfearan XD","replies":[]}]},{"poster":"Kyousuke","date":"2017-11-19T14:24:16.690+0000","up_votes":1,"down_votes":0,"body":"tenes la runa de velocidad, electrocutar, cosecha oscura y el meteoro para usar a kassa :P nerfear algo que esta roto no lo volverá usseles","replies":[{"poster":"OneHourPhoto","date":"2017-11-19T18:45:51.519+0000","up_votes":1,"down_votes":2,"body":"otro que no tiene idea absoluta","replies":[{"poster":"Kyousuke","date":"2017-11-19T20:58:34.579+0000","up_votes":1,"down_votes":0,"body":"lvl 27 y me decís que no tengo idea? lel","replies":[]}]}]},{"poster":"Mazoku","date":"2017-11-19T13:28:53.694+0000","up_votes":1,"down_votes":0,"body":"Cuando te sientas mal por ese nerf pensa en kayle. A ella le sacaron la ruta de {{item:1039}} para el primer clear. Hasta un amumu te puede invadir ya que ni con triple pota alcanzas a regenerar hp (antes arrancabas con 1).","replies":[]}]}