{"poster":"alebarzo sundra","date":"2017-09-22T22:08:02.125+0000","title":"Bannato per 14 giorni per 1 solo game, probabilmente segnalato da tutti per flame","subforum":"Discussioni generali","up_votes":2,"down_votes":12,"body":"Salve ragazzi, premetto che ho gi&agrave; mandato un ticket al support in modo da contattare direttamente la riot 1:1 per risolvere questa questione.\r\nLa racconto veloce, c&#039;&egrave; stato un game oggi dove ho flammato un po&#039;, le solite cose che si dicono spesso &quot;cancer, tumor, die&quot; ecco, questo &egrave; stato semplicemente uno dei pochi game dove ho flammato &quot;pesantemente&quot;.\r\nMi ha tiltato twisted fate nemico perch&egrave; si vantava di essere bravo e ci ha provocati dicendo che avrebbe tryhardato tanto, allora abbiamo tryhardato e abbiamo vinto.\r\nEcco, nella schermata di fine game ho detto a tf che lui &egrave; uno di quei player che odio su league, la gente che si vanta tanto, ad un certo punto sono stato bannato per 14 giorni per sto fatto, io non capisco ho fatto game peggiori di questi e boh.\r\nProbabilmente &egrave; per via dei report pesanti che ho ricevuto, avevo iniziato a ignorare la chat ma in questo caso ho perso la testa.\r\nE niente volevo dirvi solo sta cosa e basta, non mi importa dei premi di fine season sinceramente, finch&egrave; esiste Star Guardian Jinx uso solo lei.","replies":[{"poster":"Dantazzo","date":"2017-09-22T22:53:19.818+0000","up_votes":3,"down_votes":1,"body":"Se tumor, cancer, die e simili sono flame \"leggero\" che diavolo è il flame pesante per te?","replies":[{"poster":"alebarzo sundra","date":"2017-09-22T22:54:22.772+0000","up_votes":1,"down_votes":6,"body":"minaccie di morte proprie, die è usato spesso eh","replies":[{"poster":"Dantazzo","date":"2017-09-22T22:59:45.438+0000","up_votes":9,"down_votes":1,"body":"Anche porco**o in Veneto è usato come preposizione, il fatto che una cosa sia usata spesso non la rende meno leggera o offensiva. Detto questo a me che uno mi scriva insulti attraverso uno schermo non mi fa ne caldo ne freddo, ma molti si offendono etc...","replies":[{"poster":"Orgazmico","date":"2017-09-22T23:20:25.115+0000","up_votes":10,"down_votes":1,"body":"io personalmente son abbastanza sconcertato, e si che son tra i bronzi quindi retard, noob sono il pane quotidiano....ma cancro o tumore fino alle minacce di morte...scherziamo??togliete il pc a questi soggetti","replies":[{"poster":"Adalkah","date":"2017-09-24T22:09:19.358+0000","up_votes":1,"down_votes":0,"body":"agreed","replies":[]}]}]},{"poster":"Adalkah","date":"2017-09-24T22:11:05.711+0000","up_votes":1,"down_votes":0,"body":"allora io gioco sto profilo da un anno e non gioco nemmeno ranked e sto in bronzo semplicemente perchè voglio cercare almeno di regalare una partita felice alle povere anime che si ritrovano insulti etc ogni giorni. ne ho visti di tanti come kys ( no scherzo questa settimana solo in 2 lo hanno detto) ma minacce di morte. oh ma se cojone ? ma io ti permabanno. non sai che ne regolamente le minacce di morte sono da permaban??","replies":[]}]},{"poster":"Adalkah","date":"2017-09-24T22:08:40.856+0000","up_votes":1,"down_votes":0,"body":"HAHAHAHAHAH LOOOL","replies":[]}]},{"poster":"Nabbomaster","date":"2017-09-22T22:11:01.153+0000","up_votes":4,"down_votes":4,"body":"> [{quoted}](name=alebarzo sundra,realm=EUW,application-id=MJVj50Jw,discussion-id=2pjdwBmQ,comment-id=,timestamp=2017-09-22T22:08:02.125+0000)\n>\n\n> La racconto veloce, c&amp;#039;&amp;egrave; stato un game oggi dove ho flammato un po&amp;#039;, le solite cose che si dicono spesso &amp;quot;cancer, tumor, die&amp;quot; ecco, questo &amp;egrave; stato semplicemente uno dei pochi game dove ho flammato &amp;quot;pesantemente&amp;quot;.\n\nnella tua testa bacata si dicono spesso o anche solo ogni tanto","replies":[{"poster":"alebarzo sundra","date":"2017-09-22T22:18:23.670+0000","up_votes":1,"down_votes":3,"body":"Non ho capito scusa","replies":[{"poster":"Floppyz","date":"2017-09-22T22:35:12.449+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=alebarzo sundra,realm=EUW,application-id=MJVj50Jw,discussion-id=2pjdwBmQ,comment-id=00000000,timestamp=2017-09-22T22:18:23.670+0000)\n>\n> Non ho capito scusa\n\nNabbomaster si prende una pausa, certo che però\n\n> [{quoted}](name=alebarzo sundra,realm=EUW,application-id=MJVj50Jw,discussion-id=2pjdwBmQ,comment-id=,timestamp=2017-09-22T22:08:02.125+0000)\n>\n>  le solite cose che si dicono spesso &amp;quot;cancer, tumor, die&amp;quot;\n\nno. Queste cose non sono certo _le **solite** cose che si dicono **spesso**_, a meno di non volersi giustappunto beccare un ban, oltre che risultare piuttosto maleducati.\n\nPer quanto riguarda il ticket al supporto, ti posso già dire che non rimuoveranno/ridurranno il ban, e che visto che tu stesso ammetti che hai avuto comportamenti poco corretti in passato, fra cui questo in particolare (che mi sembra abbastanza grave), mi sembra normale che sia finita così.\n\nSe mi permetti un consiglio per il futuro, visto che il prossimo ipotetico ban sarà permanente, fa in modo che quelle diventino _cose che non si dicono mai_.","replies":[{"poster":"BrattishSolid6","date":"2017-09-23T09:08:39.252+0000","up_votes":2,"down_votes":1,"body":"Hai letteralmente detto tutto ciò che c'era da dire.\nSei il mod di cui abbiamo bisogno, ma che non ci meritiamo.","replies":[{"poster":"Dantazzo","date":"2017-09-23T09:45:38.692+0000","up_votes":2,"down_votes":4,"body":"The human centipede","replies":[{"poster":"Adalkah","date":"2017-09-24T22:12:38.980+0000","up_votes":2,"down_votes":0,"body":"cosa centra? XD","replies":[{"poster":"Dantazzo","date":"2017-09-24T23:08:00.079+0000","up_votes":1,"down_votes":1,"body":"Intendo dire che una certa parte del corpo di una persona è molto vicina ad una parte diversa del corpo di un'altra persona.","replies":[]}]}]}]}]}]}]},{"poster":"Ser Nalor","date":"2017-09-22T22:54:52.698+0000","up_votes":4,"down_votes":0,"body":"leggerai tanti commenti che diranno \"14 giorni di ban per un solo game è impossibile, sei sicuramente recidivo e non sarà stata la prima volta che hai flammato!\"\n\ne in generale è così, anche se di solito si passa tramite alcuni step come la chat ristretta per tot tempo fino ad arrivare a questa tua punizione e infine il ban permanente dell'account.\n\nse ci tieni all'account, evita in tutti i modi di flammare ulteriormente, anche in modo \"soft\", che da quando tornerai a giocare sarai un \"osservato speciale\" e non ti sarà perdonato nulla. \ngià dopo pochi report (se non dopo il primo report sensato) che riceverai, perderai tutto e se hai speso tempo e soldi per maestrie, rune, champ e skin sarà tutta fatica buttata al vento. {{champion:157}} \n\nin ogni caso penso abbiano saltato quegli step di cui ti parlavo prima proprio perché augurare cancri, tumori e compagnia brutta è considerato (ed è) molto grave, ergo non sono previsti avvertimenti o avvisi più pacati per farti capire che non devi in nessun caso scrivere cose simili in chat.\n\naltro piccolo consiglio spassionato: muta tutti una volta in partita se ti basta poco per farti innervosire.\n\nsfrutta i 14 giorni per prenderti una pausa e torna meglio di prima.\n\n{{sticker:vlad-salute}} saluti.","replies":[{"poster":"alebarzo sundra","date":"2017-09-22T23:17:36.279+0000","up_votes":1,"down_votes":0,"body":"Eh mi sa che questo game è stata la ciliegina sulla torta per farmi bannare, menomale non è permanente, ora che ci ripenso mi dispiace un pochino per i premi, ma non fa niente ripeto che ho già sg jinx e mi basta quella.","replies":[{"poster":"Adalkah","date":"2017-09-24T22:14:01.464+0000","up_votes":1,"down_votes":0,"body":"sei nemmeno ad un passo dal permaban, ti dicosolo questo.","replies":[]}]}]},{"poster":"Master Caos98","date":"2017-09-23T08:17:19.533+0000","up_votes":2,"down_votes":0,"body":"Hai infranto le regole,ed è giustissimo che tu venga punito,ti consiglio di mutare tutti per evitare il tilt(sopratutto se si è molto suscettibili).\nInoltre ti consiglio di avere anche un po più di padronanza di te stesso.","replies":[]},{"poster":"Laiho88","date":"2017-09-23T08:11:10.162+0000","up_votes":3,"down_votes":1,"body":"\"mi hanno bannato perché ho flammato un pò, le solite cose, cancer, tumor\"\nSe per te queste sono \"le solite cose\" ti consiglio di farti vedere da uno bravo\n\nNon c'è niente da risolvere contattando il support, il ban rimane e a breve ti arrivà il permaban 100%.\n\nPS: Vergogna, augurare il male dietro a un monitor per un gioco, sei il peggio del peggio....","replies":[]},{"poster":"zezzypiro133","date":"2017-09-25T07:26:50.775+0000","up_votes":1,"down_votes":0,"body":"Pure io sono stato reportato per int feed e sospeso, mi spiace, io ho cercato di contattare il supporto per spiegare e se fosse stato possibile trovare un rimedio","replies":[]},{"poster":"Clearωay","date":"2017-09-23T07:26:14.004+0000","up_votes":1,"down_votes":0,"body":"Ti hanno bannato per 14 giorni e ti hanno dato la motivazione per cui l'hanno fatto. Perciò ora con tutto il rispetto il ban è meritato e ti consiglio di smetterla di fare il bambino augurando cancro, morte ecc attraverso uno schermo, cosa che a me sembra alquanto ridicola. \"le solite cose che si dicono\"? Beh io non le dico e infatti non sono stato bannato 14 giorni come te. \nSe poi non te ne frega dei premi ecc allora perché hai contattato la riot e perché hai scritto qui?","replies":[]},{"poster":"Dr LouD","date":"2017-09-22T23:09:21.301+0000","up_votes":1,"down_votes":0,"body":"Ok, quindi?","replies":[]},{"poster":"Orgazmico","date":"2017-09-22T23:07:39.317+0000","up_votes":1,"down_votes":0,"body":"ammetto che ho riso quando ho letto \"le solite cose che si dicono spesso\".\nUn consiglio, occhio al linguaggio sennò la prossima sospensione sarà permanente","replies":[]},{"poster":"alebarzo sundra","date":"2017-09-22T22:59:03.961+0000","up_votes":1,"down_votes":0,"body":"Vabbè grazie raga, non fa niente farò un altro account e ignorerò la chat, solamente per i premi stagionali, poi ritornerò sul main","replies":[{"poster":"Ser Nalor","date":"2017-09-22T23:03:22.816+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=alebarzo sundra,realm=EUW,application-id=MJVj50Jw,discussion-id=2pjdwBmQ,comment-id=0003,timestamp=2017-09-22T22:59:03.961+0000)\n>\n> Vabbè grazie raga, non fa niente farò un altro account e ignorerò la chat, solamente per i premi stagionali, poi ritornerò sul main\n\nsi ma bada che il periodo da \"osservato speciale\" non è sicuramente corto.\n\ndevono passare mesi di partite senza flame per scongiurare il ban permanente e non basta stare in un altro account e tornare sul tuo main a distanza di tempo.\n\nstacci attento.","replies":[]}]},{"poster":"Ardens33","date":"2017-09-23T14:40:09.404+0000","up_votes":2,"down_votes":3,"body":"ma tipo non ce ne frega un cazzo di come sono andate le cose nel dettaglio, che sei all'asilo che devi giustificarti? stai zitto e impara a giocare","replies":[]}]}