{"poster":"nahuellopezq","date":"2017-06-02T03:39:36.247+0000","title":"Como actuar y que hacer en estas ocaciones?","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":2,"body":"inb4- crypost/racha negativa/reportalos y listo\r\nBuenas, quer&iacute;a consultarles a los &quot;mods&quot; que hacer en estos casos.\r\nVengo de jugar 2 rankeds en duo con un amigo y en las dos partidas ( que fueron seguidas ) me tocaron 2, a falta de 1, jugadores afk.\r\nNo le pregunto a la comunidad en general por que sinceramente no vine a pedir opiniones barbaras, sino, que hacer concretamente en estos casos de gente in&uacute;til para la comunidad.\r\nAlgo que me parece completamente &uacute;til es brindarle a la comunidad una evidencia de quienes son los que trollean o toxicos para poder evitarlos, pero por alguna raz&oacute;n esta prohibido y es baneable ( ir&oacute;nico que denunciando un afk/troll exponi&eacute;ndolo lo baneen a uno )\r\nSi alg&uacute;n &quot;rioter&quot; se digna a trabajar, espero su respuesta abajo. \r\nDe llegar a contestar un &quot;rioter&quot; ahorrarse los comentarios sarc&aacute;sticos, dan pena.","replies":[{"poster":"Nitrobacter","date":"2017-06-02T03:49:21.549+0000","up_votes":2,"down_votes":0,"body":"Para eso riot implemento el remake. Algo mas para hacer y que no afecte negativamente la experiencia de los 10 jugadores no creo que haya ( si tenes una solucion relevante estaria bueno que la digas , teniendo en cuenta TODOS los factores).\n\nSimplemente TODOS podemos ser futuros afks. Por que ? Porque se pueden presentar ocaciones en donde se nos corta la luz, se nos va el internet , se nos cae la abuela por la escalera , etc , y debido a esa generalidad inconsistente es que no se pueden tomar medidas contra dichos usuarios ( a menos que se vayan afk a menudo).","replies":[{"poster":"Lucio22","date":"2017-06-02T03:55:12.051+0000","up_votes":1,"down_votes":1,"body":"> Porque se pueden presentar ocaciones en donde se nos corta la luz, se nos va el internet , se nos cae la abuela por la escalera\n\nnos agarra un ataque de diarrea asesina, escuchamos que se acercan los testigos de jeova y hay que tapiar puertas y ventanas, hay que salvar a un bebe de un incendio, cosas importantes","replies":[]},{"poster":"nahuellopezq","date":"2017-06-02T03:53:43.150+0000","up_votes":1,"down_votes":1,"body":"Entendible completamente. En una partida que de la nada se tome el palo uno. Lo que no me exprese bien, fue que estos AFK fueron intencionales. Corta, en ambas partidas los jugadores tiraron el famoso \"Ya fue, no mereces ganar\" y se tomo el palo.\nEn la segunda partida mi compañero me conto que fue asi, porque generalmente muteo a todos.\nYa esta. Otro post que para mi sirve de descargo, pero es uno mas de la lista negra de los mods o como se llamen.","replies":[]}]},{"poster":"Shion Archimago","date":"2017-06-02T03:41:12.925+0000","up_votes":2,"down_votes":0,"body":"tirar ff\nno todas las partidas se pueden ganar","replies":[]},{"poster":"Lucio22","date":"2017-06-02T03:48:24.390+0000","up_votes":2,"down_votes":1,"body":"\"Como actuar y que hacer en estas ocaciones\" --> reportas al/los afk y listo\n\"no vine a pedir opiniones barbaras\" --> ... ok... o tas caliente o se te escapa lo flamer\n\"que hacer concretamente en estos casos de gente inútil para la comunidad\" --> ok, flamer sera nomas\n\"Algo que me parece completamente útil es brindarle a la comunidad una evidencia de quienes son los que trollean o toxicos para poder evitarlos, pero por alguna razón esta prohibido y es baneable\" --> la razon es sencilla: esta no es la plataforma para reportarlos, ademas de que tranquilamente puedo decir (sin prueba alguna) que VOS sos flamer, afk y troll y que me amenazaste por ser hombre/mujer/argentino/chileno/ecuatoriano/melmakino o porque me gusta el queso. no se si entendes hacia donde va esa normal...\n\n\"Si algún \"rioter\" se digna a trabajar\" --> ya dije que parecias flamer? ok, just checking...\n\"De llegar a contestar un \"rioter\" ahorrarse los comentarios sarcásticos, dan pena.\" --> hermano, segui asi y tu proximo post va a ser \"pod ke me bamneadon la cuenda di no doy dlamed\"...","replies":[{"poster":"nahuellopezq","date":"2017-06-02T04:04:28.440+0000","up_votes":1,"down_votes":1,"body":"Lucio, disculpa si te sentiste tocado por lo bárbaro, pero es una expresión que me parece correcta ya que son repetitivos y no incluyen una solución al problema de manera directa. Una cosa es que pase 1 vez y que pobre chiquito se haya quedado sin Internet, y otra es que, como dije en otra respuesta, tiren la famosa \"Ya fue, no mereces ganar\" proveniente de los ganks inexistentes de un jungla que quizás no le vaya bien o no sea su partida. Multiplicalo por dos.\nPor otra parte, y para tu sorpresita, no suelo flamear. Suelo mutear a todos y listo el pollo. Gracias a dios no suelo ser xenofobo ni amenazo gente ( que carajo se te ocurrió ahi amiguin jajaja ) \nEsta si debería ser una plataforma para denunciar este tipo de comportamiento, ya que haría de atajo para diferentes casos de gente inadecuada para el juego.\nY finalmente lo de banear la cuenta no va a pasar, quedate tranquilo de eso amiguin, solo espero que le toque a la gente que realmente hace del juego un rejunte de bárbaros.","replies":[{"poster":"Lucio22","date":"2017-06-02T04:24:33.360+0000","up_votes":1,"down_votes":0,"body":"...\n\nok, se va la segunda:\n\n1. \"es una expresión que me parece correcta ya que son repetitivos y no incluyen una solución al problema de manera directa\" si son repetitivos, es porque siempre preguntan la misma pelotudez, no por otra cosa (y, pese a lo que decis, si dan una solucion directa: reporta al final de la partida o, si es un caso extremo, en el soporte)\n2. \"tiren la famosa \"Ya fue, no mereces ganar\" proveniente de los ganks inexistentes de un jungla que quizás no le vaya bien o no sea su partida.\" reportalo al final y listo\n3. \"Multiplicalo por dos\" ok: 1 reporte x 2 = 2 reportes. no era taaaaaaaaaaan dificil...\n4. \"no suelo flamear\" posta? raro, pero bueno\n5. \"Suelo mutear a todos y listo el pollo\" ah, eso lo explica\n6. \"Gracias a dios no suelo ser xenofobo ni amenazo gente ( que carajo se te ocurrió ahi amiguin jajaja )\" ok, parece que no entendes lo que es un ejemplo, pero si realmente quisiese hacer algo asi, seria tu palabra contra la mia, ya que en el historial de las partidas no sale el chat, por lo que tendria que intervenir riot a ver que carajo pasa, lo que toma tiempo al pedo ya que es mas facil tener un sistema en el cual la gente se queja y revisan de forma particular cada queja (algo onda lo que hay, lo reportas y ese reporte es analizado y, si acumula muchos asi, se lo banea)\n7. \"Esta si debería ser una plataforma para denunciar este tipo de comportamiento\" no, esta es una plataforma para compartir distintos tipos de pelotudeces, desde arte que hace alguno, pasando por concepto de personaje hasta la creacion y/o busqueda de un equipo para rankear. todo positivo o con dudas sobre algo, por lo que algo negativo (como indicar con el dedo a alguien SIN PRUEBA ALGUNA SALVO LAS PALABRAS DEL ACUSADOR Y DEL ACUSADO) no tiene lugar aca\n8. \"lo de banear la cuenta no va a pasar\" ... ah... deciselo a todos los que se quejan a diario, capaz no lo saben bien...","replies":[{"poster":"nahuellopezq","date":"2017-06-02T04:49:48.883+0000","up_votes":1,"down_votes":2,"body":"Me gusta tu emoción a los puntos, denota mucha dedicación al orden de tu parte, pero poco al contenido.\nTambién noto una cierta rigidez por así decir, en tu forma de desarrollar tu habla. Evita los modismos y los insultos, es una discucion, no estamos intentado demostrar quien tiene la razón, por que como esta en el principio del post, simplemente son comentarios barbaricos sin precedentes ni conocimientos en la plataforma/programa de reportes.\nContinuando tu puntillismo, es evidente que no rankeaste todavía, por lo cual, estos troll se tornan mas graves y se supone que le dan mas bolilla. En una normal, un afk, un toxico, un troll, siempre están presentes, y te acostumbras y hasta te reis del pobre diablo. Lamentablemente, en clasificatorias, la gente le pone mas empeño y dedicacion y es por eso que cada vez que ocurren precedentes de esta índole, nadie quiere que quede en la nada, como 75% de los casos.\nFinalizando la respuesta, y haciendo foco a tu listita numérica que intenta apabullar el problema real, me refería a que mi cuenta no la banearian. Y es mas, a lo que te referís, faneando a los \"rioters\" y su orgullo payasesco a los \"crypost\" son en su gran mayoría de las cuentas \"elo boosteadas\", que al final del día, pueden comprar o crearse otra cuenta y volver al ciclo.\nEl sistema de tribunal en este juego no funciona del todo bien amiguin. Un claro ejemplo es el caso del jugador y streamer \"Tyler1\" que lo banearon 23 veces y sigue jugando. \nEspero con ansias tu nueva lista o tu dialogo para llegar a un punto en tu desarrollo inconcluso.","replies":[{"poster":"Lucio22","date":"2017-06-02T05:07:58.730+0000","up_votes":1,"down_votes":0,"body":"...\n\no sos muy especial, o hiciste un curso, que queres que te diga...\n\n\"es una discucion, no estamos intentado demostrar quien tiene la razón\" \nre que esa es la idea de una discusion, la presentacion de al menos 2 puntos de vista distintos en el cual se intenta defender y, por lo general, llegar a un acuerdo de cual es el mejor/tiene razon. AHORA, si eso te parece \"barbarico\", welp... hablale a los griegos, ellos empezaron con la onda de hablar las cosas... (esos fucking barbaros... por que no habran sido civilizados como los hunos o los mongoles...)\n\n\"es evidente que no rankeaste todavía\"\nerror señor! rankie 3 partidas en mi vida (todas en team) y gracias a dios me basto para no querer rankear nunca mas. simplemente es algo que no es para mi\n\n\"como 75% de los casos\"\n~~- estadisticas traidas a ustedes por: la universidad siglo del culo~~\nalto dibujo le mandaste al porcentaje, pero bueno\n\n\"El sistema de tribunal\"\nbreaking news, el tribunal murio! like, 3 years ago...\n\n\"Espero con ansias tu nueva lista o tu dialogo para llegar a un punto en tu desarrollo inconcluso.\"\nhablando de desarrollo inconcluso, tu punto es \"yo tengo razon porque me lo soplo un huevo\" o es idea mia?","replies":[{"poster":"nahuellopezq","date":"2017-06-02T05:28:13.481+0000","up_votes":1,"down_votes":1,"body":"Lucio, el punto de una discucion de una comunidad creo que deberia ser enfrentar puntos y lograr una unica unidad, y no inclinarse hacia un lado. \nEn cuanto al tribunal, me exprese de mala manera, queriendo hacer referencia al sistema que considera o no baneable. No recuerdo si lo sacaron o no sinceramente. \nPor otra parte, y es claro en tus contestaciones, noto una pisca  de angustia juntada y resentimiento. Me gustaria que dejes de lado estos, por que cualquier persona que te lea te tildaria como los efectuantes que denuncio. Fijate como pasaste de ser el acusante a ser el acusado. Comportamientos de madurez esteril producen el deterioro de esta comunidad. \nPara concluir, lamento que las competiciones en esta comunidad no sean para vos, es entendible y visible, pero para el resto que disfruta de demostrar habilidades y estrategias de juego, es algo que nos afecta diariamente. Si quisiera jugar una partida para quemar tiempo estaria en Aram o jugando normales con amigos, lo cual disfruto en ocaciones espontaneas. \nEspero que te sirva mi contestacion. Y evita la agresion pre adolecentesca para poder modular tus desarrollos y para poder discutir.","replies":[{"poster":"Lucio22","date":"2017-06-02T05:48:42.519+0000","up_votes":1,"down_votes":0,"body":"...\n\n\"Y evita la agresion pre adolecentesca\"\nQUE VIOLENCIA? a ver... \n(fuente, ya que no pude encontrar el clip solo: https://www.youtube.com/watch?v=wKLRjuZiUis min 1:37)\n\nel punto de una discucion segun vos es basicamente lo mismo que digo yo, solo que con la posiblidad de que haya un punto intermedio (cosa que pase por alto, ya que no suele suceder)\n\nangustia, te lo puedo discutir, pero en cuanto al resentimiento... los que me conocen te van a decir que soy mas resentimiento que persona jeje (de hecho, siempre digo que yo olvido pero no perdono, aguante tener mala memoria). pero en si, es mi forma de expresar. como todo buen argentino, suelo dar un enfasis a algo con algun \"insulto\" (y lo pongo entre comillas ya que, por lo general, en si no es un insulto a alguien sino para el enfasis). ademas, estuve releyendo lo que puse y solo encontre \"pelotudez\" como \"insulto\", so...","replies":[]}]}]}]}]}]}]}]}