{"poster":"Pulgaa","date":"2016-10-28T06:46:44.085+0000","title":"Los de riot donde estan cuando les escribis????","subforum":"Off-topic y temas personales","up_votes":2,"down_votes":0,"body":"No puede ser cansado de jugar con tanta gente igual dios, no puede ser que juegue una partida bien y 3 mal, juego ranked y los de mi team son todos trolls o afk, donde esta esa comparacion oarece que ponen a los diamantes en el equipo contrario, a ver si empiezan a dar mas bolilla a los msj que la comunidad les manda, porque no puede ser que no den respuesta a nada, pero ojo si yo hago algo mal ya me advierten \r\n\r\nLa verdad que esto cansa ya..\r\n\r\nespero que uno de riot me responda por mensaje o algun lado pero que RESPONDA...\r\n\r\n\r\n\r\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"rokushoger","date":"2016-10-28T12:15:31.511+0000","up_votes":3,"down_votes":0,"body":"Las respuestas que buscas ya están, para a esta gente depende de nosotros al reportar consistentemente y por el lado adecuado. Si reportas a un feeder intencional como actitud negativa probablemente le caiga más lento el ban que si lo reportas por sacrificio intencional. No obstante es mejor reportar y equivocarse de categoría que no hacerlo!","replies":[]},{"poster":"J0CS4N","date":"2016-10-28T11:41:51.217+0000","up_votes":2,"down_votes":0,"body":"Están en sus oficinas \n\nhttp://vignette3.wikia.nocookie.net/inciclopedia/images/c/c6/El_%C3%BAltimo_asado.jpg/revision/latest?cb=20111112180847\n\nPreparando lo que se viene :\n\nhttp://commondatastorage.googleapis.com/static.panoramio.com/photos/original/3541654.jpg","replies":[{"poster":"rokushoger","date":"2016-10-28T12:13:28.282+0000","up_votes":3,"down_votes":0,"body":"Hola! te voy a contestar algo que nada que ver, pero el post que me habías contestado marchó con moderación y no pude volvera  contestarte. Gracias por la info (lo de calma), lo tendré en cuenta, todos los días se aprende algo nuevo!","replies":[{"poster":"J0CS4N","date":"2016-10-28T12:20:19.729+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=J8qpiO2I,discussion-id=LZ82EVPY,comment-id=00030000,timestamp=2016-10-28T12:13:28.282+0000)\n>\n> Hola! te voy a contestar algo que nada que ver, pero el post que me habías contestado marchó con moderación y no pude volvera  contestarte. Gracias por la info (lo de calma), lo tendré en cuenta, todos los días se aprende algo nuevo!\n\nEso es por que la gente se enoja mas , se frustran por que piensan que no son comprendidos, mas por que cuando explotan .. lo que necesitan es ser comprendidos, que alguien los escuche en sus momento de rabia, en sus derechos personales etc etc etc... Es obvio que esta mal como se expresan con tanto insulto. Pero al sentirse parte de algo como el juego, la comunidad... Lo único que encuentran es el foro. Es un instinto natural del ser humano ... El asunto es que no todos tiene la capacidad mental para controlarlo. Y es ahí cuando el receptor que son los admin deben dirigir el mensaje del emisor a buen puerto y reformar la actitud con capacidad y diligencia.","replies":[{"poster":"rokushoger","date":"2016-10-28T13:01:01.805+0000","up_votes":1,"down_votes":0,"body":"Te agradezco el consejo!\nLo que si por las dudas mirá que no soy admin, simplemente el colorcito es para distinguir que según Riot le gusta como ayudo a la gente, onda \"más credibilidad\". Los únicos admin son los otros colores, nosotros voluntarios nomás!","replies":[{"poster":"J0CS4N","date":"2016-10-28T13:58:32.510+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=J8qpiO2I,discussion-id=LZ82EVPY,comment-id=0003000000000000,timestamp=2016-10-28T13:01:01.805+0000)\n>\n> Te agradezco el consejo!\n> Lo que si por las dudas mirá que no soy admin, simplemente el colorcito es para distinguir que según Riot le gusta como ayudo a la gente, onda &quot;más credibilidad&quot;. Los únicos admin son los otros colores, nosotros voluntarios nomás!\nya lo se. Suerte!","replies":[]}]}]}]}]},{"poster":"ThePunkRocker","date":"2016-10-28T10:53:48.495+0000","up_votes":2,"down_votes":0,"body":"yo sinceramente estoy cansado ya... partida que entras partida que te recontra trolean, se van afk o mueren 2 millones de veces cada uno, les hablas bien y no entienden se siguen tirando 1 vs 5, es entrar a jugar y salir con dolor de cabeza, lo peor que pedis report o lo que sea a los del team de enfrente y se te rien y dicen \"no, le voy a dar honor\" rico server tenemos","replies":[]},{"poster":"Cuching","date":"2016-10-28T07:00:43.650+0000","up_votes":2,"down_votes":0,"body":"Los de **Riot** están muy ocupados en otras cosas, además, no van a **arreglar los problemas** de los **afk** y de los **trolls** de un día para otro, para eso tenes para **reportar** al final de la partida, que eso ayuda a ver el comportamiento del jugador. Suerte!\n___\n>  &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp; {{item:3751}} {{champion:17}}**&iexcl;Saludos!** {{champion:99}} {{item:3751}}","replies":[]},{"poster":"Tazztania","date":"2016-10-28T15:34:42.433+0000","up_votes":1,"down_votes":0,"body":"exactamente que respuesta estas buscando?","replies":[]},{"poster":"FurchiDC","date":"2016-10-28T07:33:37.168+0000","up_votes":4,"down_votes":5,"body":"Que dejen de existir los trolls y afks es una utopía imposible de conseguir, pero se puede mejorar. El sistema existe, y funciona pero necesita que la gente se comprometa en reportar a estos seres que arruinan este hermoso juego. \n\nSi un troll, afk, flammer lo es consistentemente (es decir que lo hace seguido) y todos los afectados lo reportan se va con un ban 100% asegurado. Pero si nadie lo reporta pasa desapercibido.\n\nPor eso en vez de irse enseguida de la pantalla de fin de partida, hay que reportar a todos estos invocadores negativos y pedirle amablemente al enemigo que también lo haga. Si el troll, afk o flammer estaba en el enemigo y ganaron gracias a él no le den honores, reportenlo también, porque en la próxima partida puede estar de su lado.\n\nSi el caso es muy extremo, podés abrir un ticket a soporte y plantearlo: https://support.riotgames.com/hc/es-419\n[](http://.)\n[](http://.)\n_________________________________\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]}]}