{"poster":"Gharribaldy","date":"2018-06-30T23:03:13.950+0000","title":"U.R.F. ist geil, ABER","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":1,"body":"Also ich mag den U.R.F. Mode sehr gerne und ich bin richtig froh das der Modus jetzt das zweite Mal in kurzer Zeit da ist. ABER ich m&ouml;chte gerne die westliche Version spielen. Ich als deutscher bin demokratie gewohnt, auch wenn die Entscheidung nicht immer meiner Meinung entspricht. Aber diese komunistische Version (Alle zuf&auml;llig) nervt mich etwas. Weil man Champions bekommt die einfach ungeeignet sind oder einfach keinen Spass machen. WARUM d&uuml;rfen wir Spieler zu unserer eigenen Freude, nicht das spielen was wir m&ouml;chten. Uns werden in sovielen Mode&#039;s ein Champion aufgezwungen. Obwohl man mit anderen viel mehr Spass h&auml;tte. Und ich kann sehr wohl sagen, dass ich bereit w&auml;re mehr Geld ins Spiel zu stecken. Wenn ich die Wahl h&auml;tte, was ich spielen darf. Nur bringen mir Skins nichts, wenn ich diese Champions nicht spielen kann und darf, weil mir etwas aufgezwungen wird.\r\n\r\nAlso Riot-Team seit mal etwas flexibler und lasst uns Spieler selbst entscheiden. Nicht jeder will Master in der Kluft werden, sondern spielt lieber die anderen Mode&#039;s.","replies":[{"poster":"Caíus","date":"2018-07-01T02:06:59.602+0000","up_votes":2,"down_votes":1,"body":"Wenn du mit schlechten Champs nicht klar kommst hast du die besseren nicht Verdient. finde dich damit Ab das du auch mal mit einem Trundle oder what Ever carrien musst xD","replies":[{"poster":"Xx Gargamel xX","date":"2018-07-01T02:26:14.415+0000","up_votes":1,"down_votes":0,"body":"Ey Trundle is voll geil :D Teammates die recallen wollen mit q trollen ne Spaß :D ne Trundle is schon was feines ^^","replies":[{"poster":"Caíus","date":"2018-07-01T03:09:44.283+0000","up_votes":1,"down_votes":0,"body":"Trundle bockt schon wenn man weiß wie da is selbst nen Fed Zed ne lachnummer :X aber PSSSt das ist ein Geheimniss :O","replies":[]}]}]},{"poster":"OPChampsSucks","date":"2018-06-30T23:21:01.163+0000","up_votes":1,"down_votes":0,"body":"Dann haste nur noch shaco zed wukong karthus games. ne danke lass ma","replies":[{"poster":"Gharribaldy","date":"2018-06-30T23:49:16.289+0000","up_votes":1,"down_votes":0,"body":"Nein","replies":[]}]}]}