{"poster":"Kusok","date":"2016-01-27T01:04:42.225+0000","title":"Champion in free rotation selezionabili in ranked dynamic","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"&Egrave; un bug o mi son perso qualcosa? Prima non si potevano mica giocare in ranked i champion free che non hai acquistato o_o mentre adesso si pu&ograve;","replies":[{"poster":"Frattaglia","date":"2016-01-27T11:25:50.212+0000","up_votes":2,"down_votes":0,"body":"In realtà credo che sia voluto.\nSiccome la coda dinamica va a rimpiazzare anche le ranked di squadra, e siccome nelle ranked di squadra era possibile scegliere anche campioni nella rotazione gratuita, penso che abbiano mantenuto apposta questa cosa.","replies":[]},{"poster":"Squacquerone","date":"2016-01-27T10:48:56.399+0000","up_votes":1,"down_votes":0,"body":"Io stavo per pickare urgot in Ranked poi mi son ricordato che Ehi io non ho urgot O.O","replies":[]},{"poster":"IrrationalNumber","date":"2016-01-27T10:40:04.062+0000","up_votes":1,"down_votes":0,"body":"Se e' come dici, c'e' un bug bello grosso","replies":[]},{"poster":"Capoz","date":"2016-01-27T10:08:00.068+0000","up_votes":1,"down_votes":0,"body":"Può darsi che ci sia il simbolo del \"free\" ma che tu lo abbia comprato?\nIo ieri ho usato Corki e avevo il punto esclamativo, ma avendolo comprato non ci ho fatto caso lì per lì","replies":[{"poster":"Kusok","date":"2016-01-27T10:26:59.620+0000","up_votes":1,"down_votes":0,"body":"no, durante i placement ho giocato gnar e non ce l'ho, oggi potevo selezionare corky e mordekaiser ad esempio che mi mancano etc. si possono usare i free rotation in ranked, il punto è capire se è voluto o meno... per me che sono smurf è un piacere onestamente visto che sul main ho tutti champ quindi mi fa comodo poterli giocare \"gratis\" anche sull'account secondario.","replies":[]}]},{"poster":"LKV2","date":"2016-01-27T01:39:31.636+0000","up_votes":1,"down_votes":1,"body":"io sono sfavorevole al massimo.\nNon si possono provare i champ in free rotation in ranked. Per quello ci sono le normal.","replies":[]}]}