{"poster":"xXPinoChotaXx","date":"2018-03-03T21:26:56.972+0000","title":"Lee sin","subforum":"Jugabilidad, balance y narrativa","up_votes":5,"down_votes":4,"body":"Riot, espero algun metodo para que lee sin vuelva a ser lo que era antes del parche 8.4, un jg que no esta en el meta, pero si sos bueno , podes jugarlo.\r\nActualmente, lee sin esta demasiado mal , antes no era un champ op, era un campeon normal/malo para el meta actual, pero con una muy buena capacidad de jugadas y muy versatil, ahora en una pelea de equipo tenes que hacerle peel al adcarry, es el unico rol que podes ocupar. \r\nGracias, espero cambios","replies":[{"poster":"Oblivion awaits","date":"2018-03-03T21:33:57.307+0000","up_votes":2,"down_votes":1,"body":"¿Demasiado mal con un Decreto del señor del trueno buffado (Electrocutar) y 7 de letalidad sin ningún objeto en early game gracias al Impacto repentino? Sumado al buen early game que posee Lee sumado a las runas del Arból de Dominación creo que el campeón no está nada mal. ¿Cuál es el problema? Que sigue siendo Lee Sin. Y por más fedeado que va Lee Sin, va a llegar un momento en el cual se desinfle. ¿A caso soy el único que ha visto como Lee Sin's 6/0/ después terminan en la nada? Dale un 6/0 a un Jax y después se va a montar una fiesta pero en tu cu**. \nDe igual forma creo que Lee Sin merece un buff ya que el Cuchillo Rastreador será removido.","replies":[]},{"poster":"Lygnus dwarf","date":"2018-03-04T12:39:20.349+0000","up_votes":1,"down_votes":0,"body":"Alguna vez que este mal y los junglas les toque explorar otros campeones que por si no sabian lee sin no es el unico jungla en el juego\nNo entiendo como le pegan un nerf a lee y todos andan llorando hay campeones que no han estado en el meta por dos años y nadie dice nada","replies":[]},{"poster":"Salvor","date":"2018-03-03T21:31:59.086+0000","up_votes":1,"down_votes":1,"body":"Ya anunciaron que lo van a buffar.","replies":[{"poster":"Oblivion awaits","date":"2018-03-03T21:42:03.263+0000","up_votes":1,"down_votes":0,"body":"Le van a poner una nueva habilidad, se va a llamar: \"Ojos bien abiertos\", cuando Lee sin activa esta habilidad abre los ojos y revela a todos los campeones en el mapa como la R de {{champion:4}} Incluso puede ver como ella se va con otro :'v","replies":[{"poster":"Urxnium","date":"2018-03-03T22:45:24.825+0000","up_votes":1,"down_votes":0,"body":"Borra eso men k sad","replies":[]}]}]}]}