{"poster":"21CmOfPureHook","date":"2016-05-01T09:40:51.140+0000","title":"Prendere S giocando support","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"Sar&ograve; diretto, accumulando A su A mi sono accorto di quanto sia difficile prendere una S giocando da support.\r\n\r\nNe &egrave; un esempio la mia ultima partita con Thresh che mi ha spinto a scrivere questo post, andando a guardare le statistiche si nota in fatti u kda di 1/0/17 su 21 con una kill participations dell&#039;86% e due Pink comprate in 28 min di game)\r\nMi chiedo quindi come sia possibile che io abbia perso una misera A con queste statistiche {{item:3070}} {{item:3070}}{{item:3070}}","replies":[{"poster":"A Yordle ln Heat","date":"2016-05-01T10:05:50.972+0000","up_votes":3,"down_votes":1,"body":"Se non ricordo male avevano detto, quando vennero rilasciati i \"voti di fine partita\", che la propria valutazione veniva data in base alla giocata media di un giocatore, con quel champ, in quel ruolo, in QUALSIASI ELO del gioco, e non mi pare che abbiano cambiato questa cosa.\n\nSe tu quindi giochi con campione molto usato in un luogo competitivo, e ancora peggio (e molto più frequente), un campione mainato da giocatore molto bravi, o se non mainato magari è la loro seconda scelta durante la selezione campioni, è più difficile ricevere dei buoni voti perché il sistema si aspetta giocate di livello più alto del tuo.\n\nThresh è spammatissimo, è ovvio che (in tutti gli elo) ci siano giocatori bravissimi che lo usano alla perfezione, e che mettono in ombra chiunque cerchi di usarlo. Prova ad usare support meno usati (Nautilus, Zyra, Blitzcrank, Brand, Taric) se proprio ci tieni a prendere ottimi voti, ma secondo me sarebbe meglio vincere piuttosto che prendersi l'ennesima chest, quindi non tentare troppo la fortuna.","replies":[{"poster":"21CmOfPureHook","date":"2016-05-01T10:27:09.533+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CommonDotaPlayer,realm=EUW,application-id=cAOZwaUi,discussion-id=WvRf83k1,comment-id=0004,timestamp=2016-05-01T10:05:50.972+0000)\n>\n> Se non ricordo male avevano detto, quando vennero rilasciati i &quot;voti di fine partita&quot;, che la propria valutazione veniva data in base alla giocata media di un giocatore, con quel champ, in quel ruolo, in QUALSIASI ELO del gioco, e non mi pare che abbiano cambiato questa cosa.\n> \n> Se tu quindi giochi con campione molto usato in un luogo competitivo, e ancora peggio (e molto più frequente), un campione mainato da giocatore molto bravi, o se non mainato magari è la loro seconda scelta durante la selezione campioni, è più difficile ricevere dei buoni voti perché il sistema si aspetta giocate di livello più alto del tuo.\n> \n> Thresh è spammatissimo, è ovvio che (in tutti gli elo) ci siano giocatori bravissimi che lo usano alla perfezione, e che mettono in ombra chiunque cerchi di usarlo. Prova ad usare support meno usati (Nautilus, Zyra, Blitzcrank, Brand, Taric) se proprio ci tieni a prendere ottimi voti, ma secondo me sarebbe meglio vincere piuttosto che prendersi l&#x27;ennesima chest, quindi non tentare troppo la fortuna.\n\nMi era sorto il dubbio che magari il voto si basasse sulle mie prestazioni passate con thresh ma non mi era nemmeno passato in mente che si basasse anche sulle prestazioni altrui","replies":[{"poster":"Filthyrocker","date":"2016-05-01T12:36:35.246+0000","up_votes":2,"down_votes":1,"body":"Non credo sia vero quello che ha scritto.I voti dipendono dalla tua prestazione nella partita e basta.Altrimenti i forzieri si vincevano solo con champ poco usati e i fuori meta.","replies":[{"poster":"A Yordle ln Heat","date":"2016-05-01T16:31:17.638+0000","up_votes":2,"down_votes":1,"body":"Sì, ma a cosa si comparano i risultati fatti in partita?\nServe un modello campione su cui fare riferimento, e quello è la media delle prestazioni di tutti i giocatori.","replies":[{"poster":"Filthyrocker","date":"2016-05-02T11:31:36.571+0000","up_votes":1,"down_votes":0,"body":"Ok,ma non credo facciano una media per ogni campione giocato come hai scritto prima.Se mai ci sono criteri generali (farming,kill,ecc...) Altrimenti sarebbe troppo squilibrato.","replies":[{"poster":"A Yordle ln Heat","date":"2016-05-02T18:53:07.909+0000","up_votes":1,"down_votes":0,"body":"Ma dove vanno a prenderli questi criteri? Devono per forza avere delle fonti, non possono sparare dei numeri a caso.\nE poi, qual'è fonte migliore di una che cambia dinamicamente e istantaneamente con il meta e con lo stile di gioco dell'utenza?\n\nA me, onestamente, pare la scelta migliore.","replies":[{"poster":"Filthyrocker","date":"2016-05-02T19:10:32.755+0000","up_votes":1,"down_votes":0,"body":"Beh,se effettivamente la metti cosi,sono d'accordo pure  io","replies":[{"poster":"A Yordle ln Heat","date":"2016-05-02T19:12:10.703+0000","up_votes":1,"down_votes":0,"body":"È quello che intendevo dall'inizio. :P","replies":[{"poster":"Filthyrocker","date":"2016-05-02T19:36:13.353+0000","up_votes":1,"down_votes":0,"body":"Fraintendimenti,capitano :)","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Ops You Just Die","date":"2016-05-06T15:29:43.249+0000","up_votes":1,"down_votes":0,"body":"Dipende veramente da troppe cose. In che ruolo giochi, partecipazioni, andamento degli altri membri della squadra, obiettivi. \nTi faccio qualche esempio. \nCon Morgana, Ho preso S+ con un punteggio buono ma non eccelso (tipo 6/1/15), con un paio di pink piazzate e gli obiettivi comuni. COsa che avevo fatto in più, ero riuscito a salvare 4 o 5 volte la vita a un compagno quasi morto con la 1, lo scudo o la ulti. Quindi immagino abbia influenzato.\nUna partita fatta come jungler, finita 11/0/18, con 3 draghi fatti, pink piazzate ecc. ho preso solo A+. C'era però un trindamere 26/0/3 che ha preso S, quindi immagino abbiano guardato l'andamento generale della squadra (avevamo fatto in tutto circa 43/45 kill come squadra.\nPartita dopo in Mid con Aurelion, A+ con un punteggio orribile (4/6/13), pur avendo aiutato in altri modi a vincere il game...\npenso che l'unica soluzione sia giocare meglio possibile, e non focalizzarsi solo su un aspetto. A dispetto del ruolo, wardare, aiutare le altre linee, salvare i compagni, fare più obiettivi in comune possibili. ecc ecc ecc :P","replies":[]},{"poster":"5RN 99 Monkeys","date":"2016-05-03T06:47:04.798+0000","up_votes":1,"down_votes":1,"body":"Guarda io sono main support. Posso dirti che ho fatto un esperimento con Tahm Kench: se in game prendevo poche kill, morivo poche volte ma avevo un pacco di assist, NON arrivavo mai più in là della A. Alzando il numero delle kill, mantenendo quello degli assist e cercando di limitare quello delle morti, il voto non era mai più basso di S-.\nDai un'occhiata alle ultime partite fatte con tahm: l'unica in cui ho preso A è stata la penultima ranked. Nelle altre che vedi tutte S+/S/S-. Questo per dire che (secondo me) il voto che prendi dipende SOLO dal kda e non da giocate o trinket piazzati (anzi, mi pare anche che in un post ufficiale abbiano espressamente detto che hanno risolto il bug per cui bastava spammare ward in base per ottenere S).","replies":[{"poster":"Frattaglia","date":"2016-05-03T07:33:49.817+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LuckyMarciano,realm=EUW,application-id=cAOZwaUi,discussion-id=WvRf83k1,comment-id=000b,timestamp=2016-05-03T06:47:04.798+0000)\n>\n> Guarda io sono main support. Posso dirti che ho fatto un esperimento con Tahm Kench: se in game prendevo poche kill, morivo poche volte ma avevo un pacco di assist, NON arrivavo mai più in là della A. Alzando il numero delle kill, mantenendo quello degli assist e cercando di limitare quello delle morti, il voto non era mai più basso di S-.\n> Dai un&#x27;occhiata alle ultime partite fatte con tahm: l&#x27;unica in cui ho preso A è stata la penultima ranked. Nelle altre che vedi tutte S+/S/S-. Questo per dire che (secondo me) il voto che prendi dipende SOLO dal kda e non da giocate o trinket piazzati (anzi, mi pare anche che in un post ufficiale abbiano espressamente detto che hanno risolto il bug per cui bastava spammare ward in base per ottenere S).\n\nRipeto: dipende dalle statistiche medie dei giocatori di quel champ. E' ovvio che se migliori il KDA e il resto resta uguale hai un punteggio migliore, ma ho fatto partite in cui stavo 10/1 e ho preso B+ perché le altre statistiche non erano buone (nello specifico, giocavo mid e avevo un farm molto basso)","replies":[]}]},{"poster":"SpideyPizza","date":"2016-05-02T06:59:31.548+0000","up_votes":1,"down_votes":0,"body":"partecipazione ai draghi e alle torri?","replies":[]},{"poster":"Darkinknight","date":"2016-05-01T22:16:38.483+0000","up_votes":1,"down_votes":0,"body":"Bah io ho preso A con j4 con 14/4/11 con +200 creep e in un'altra ho preso s- facendo 5/4/6 con +200..secondo me guardano anche quanto hai influito rispetto al resto del team..supp con blitz 0/0/15 2 pink e 18 ward in 21 min A-..ma se ci avessi messo 3-4 kill e qualche creep in piu andrebbe a S in teoria..credo che questi voti servano a definire tutto al di fuori del aver giocato bene o no","replies":[]},{"poster":"Chroniicles","date":"2016-05-01T21:37:01.341+0000","up_votes":1,"down_votes":0,"body":"Ti giuro che con braum ho perso il conto delle S che ho preso xD \nNe ho ricevute parecchie anche con blitz, piuttosto facilmente.\nCon thresh e karma ci sono riuscito ma è più difficile, e il motivo lo ha detto già Common.\nMi pare di aver preso S anche giocando illaoi support xD","replies":[]},{"poster":"Darki200","date":"2016-05-01T12:22:23.319+0000","up_votes":1,"down_votes":0,"body":"Dipende dalle kill: Su reddit c'era un thresh 8/0/10 (Support, e aveva preso molte kill per caso) e sebbene non abbia wardato molto o farmato ha preso S+","replies":[]},{"poster":"DoubleT","date":"2016-05-01T10:06:32.688+0000","up_votes":1,"down_votes":0,"body":"Pochi minions e poche wards. Di solito per prendere S- o S io faccio il tuo score ma compro 4 pink, piazzo più di 30 wards e chiudo con almeno 50 cs.","replies":[{"poster":"21CmOfPureHook","date":"2016-05-01T10:24:11.372+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DoubleT,realm=EUW,application-id=cAOZwaUi,discussion-id=WvRf83k1,comment-id=0006,timestamp=2016-05-01T10:06:32.688+0000)\n>\n> Pochi minions e poche wards. Di solito per prendere S- o S io faccio il tuo score ma compro 4 pink, piazzo più di 30 wards e chiudo con almeno 50 cs.\n\nPure io ma parliamo di una partita con 3 inibitori open a 23min.                                   Inoltre ho dovuto fare una scelta, o fai roaming o resti in lane a prendere cs","replies":[]}]},{"poster":"21CmOfPureHook","date":"2016-05-01T10:05:45.616+0000","up_votes":1,"down_votes":0,"body":"Leggendo tutti i vostri commenti ho capito di essere unlucky as f*ck","replies":[]},{"poster":"BrattishSolid6","date":"2016-05-01T09:57:02.237+0000","up_votes":1,"down_votes":0,"body":"Ho preso più volte S- e S con Nautilus support. Buona kill partecipation e soprattutto un minimo di cs. Non ovviamente presi in lane phase, ma tra Face of the Mountain, Zz'Rot (quando lo compravo) e depushing, in 30minuti magari quei 50/60 minion li prendevo. Anche questo influisce molto","replies":[]},{"poster":"XxShido91xX","date":"2016-05-01T09:43:51.442+0000","up_votes":1,"down_votes":1,"body":"First time soraka supp(conta che maino jng e sono un support scambiabile da zalando) S+......eh si è difficile xD","replies":[{"poster":"21CmOfPureHook","date":"2016-05-01T09:46:17.644+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XxShido91xX,realm=EUW,application-id=cAOZwaUi,discussion-id=WvRf83k1,comment-id=0000,timestamp=2016-05-01T09:43:51.442+0000)\n>\n> First time soraka supp(conta che maino jng e sono un support scambiabile da zalando) S+......eh si è difficile xD\n\nEvvbh sono str*nz* io allora {{item:3070}} \n\n(Si possono dire le paroline brutte brutte sul forum?)","replies":[]}]},{"poster":"Dantazzo","date":"2016-05-01T10:06:23.374+0000","up_votes":4,"down_votes":5,"body":"Io sono sempre più convinto che i voti siano dati alla cazzo di cane.","replies":[]},{"poster":"MyXanadu","date":"2016-05-01T09:51:30.263+0000","up_votes":1,"down_votes":3,"body":"L'altro ieri ero first time Taric (reworkato): S-\nLa partita dopo Zyra: S \nTotale pink comprate in entrambe le partite: 0 (LOL)\n\nProprio difficile :)\n\nScherzi a parte, a me sembra che basti vincerle per ottenere le S","replies":[]}]}