{"poster":"21CmOfPureHook","date":"2016-05-18T17:38:10.799+0000","title":"Inciviltà sul forum (?)","subforum":"Aiuto e supporto","up_votes":2,"down_votes":6,"body":"&quot;Saluti Evocatore!\r\n\r\nStiamo cercando costruire un ambiente tranquillo e come tale permettiamo spazi per le discussioni e dibattiti fintanto che vengono gestiti in maniera matura. Sbeffeggiare, sminuire, insultare gli altri evocatori, criticare non civilmente la loro opinione, il loro campione preferito, il loro stato classificato oppure utilizzare un linguaggio inappropriato ( parolacce, caps lock attivo per tutto il thread/messaggio) non solo &egrave; immaturo, ma &egrave; anche una chiara violazione delle Regole Generali.\r\n\r\nI forum dovrebbero essere un ambiente in cui tutti possono avere un&#039;opinione fintantoch&eacute; il confronto si gestisca in modo maturo. Contrastare gli argomenti e le idee della gente va bene, a condizione che quest&#039;ultimi non paghino la critica a loro spese.\r\n\r\nPer favore assicurati di rivedere le Regole Generali prima di pubblicare ulteriori contenuti.\r\n\r\nEvitiamo la sfilza di &quot;RIP&quot; e altri messaggi sbeffeggianti, grazie.&quot;\r\n\r\n1) w8 wut?\r\n\r\n2)IL messaggio in questione era un &quot;Rest in mom&#039;s pepperoni&quot;\r\n\r\n3) non capisco il senso del messaggio","replies":[{"poster":"LunSeiSleidee","date":"2016-05-18T18:31:06.850+0000","up_votes":3,"down_votes":0,"body":"Ma dai? Finalmente i moderatori stanno cercando di eliminare i commenti inutili od offensivi?","replies":[{"poster":"21CmOfPureHook","date":"2016-05-18T18:48:53.620+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=LunSeiSleidee,realm=EUW,application-id=98NGV4Al,discussion-id=gyd9V3Re,comment-id=0001,timestamp=2016-05-18T18:31:06.850+0000)\n>\n> Ma dai? Finalmente i moderatori stanno cercando di eliminare i commenti inutili od offensivi?\n\nNon sapevo che ci fossero dei moderatori con cotanti poteri","replies":[{"poster":"Ardens33","date":"2016-05-18T19:39:16.466+0000","up_votes":2,"down_votes":0,"body":"hai detto peppeeronniiiih in un luogo pubblico io ti avrei permabannato istant.","replies":[]}]}]},{"poster":"Sexy Win","date":"2016-05-18T18:09:25.152+0000","up_votes":3,"down_votes":0,"body":"Ti bannano per cazzate u.u","replies":[{"poster":"LunSeiSleidee","date":"2016-05-18T18:30:41.603+0000","up_votes":3,"down_votes":0,"body":"Ed era anche ora.","replies":[]},{"poster":"Sexy Win","date":"2016-05-18T18:09:47.778+0000","up_votes":2,"down_votes":0,"body":"Indovina il prossimo che sarà bannato?","replies":[]}]},{"poster":"Filthyrocker","date":"2016-05-18T19:31:02.478+0000","up_votes":1,"down_votes":0,"body":"Se c'e' gente che vuole farlo,lo fara' cmq.Ripostare le regole del forum su un topic ha un impatto su un flamer,quanto la scritta \"Fumare provoca danno a te e chi ti sta intorno\" su un fumatore cronico.Non voglio dire che sbagli a scrivere quello che hai scritto,solo che certe cose alla gente entrano da un buco ed escono da un altro,per dire.","replies":[]},{"poster":"Frattaglia","date":"2016-05-18T19:50:57.664+0000","up_votes":1,"down_votes":1,"body":"E' un messaggio standard, per evitare di scriverlo ogni volta.\n\nNel tuo caso si applica il\n\n> \"Saluti Evocatore!\n> \n> Stiamo cercando costruire un ambiente tranquillo e come tale permettiamo spazi per le discussioni e dibattiti fintanto che vengono gestiti in maniera matura. **Sbeffeggiare, sminuire,** insultare gli altri evocatori, criticare non civilmente la loro opinione, il loro campione preferito, il loro stato classificato oppure utilizzare un linguaggio inappropriato ( parolacce, caps lock attivo per tutto il thread/messaggio) **non solo è immaturo, ma è anche una chiara violazione delle Regole Generali.**\n> \n> I forum dovrebbero essere un ambiente in cui tutti possono avere un'opinione fintantoché il confronto si gestisca in modo maturo. Contrastare gli argomenti e le idee della gente va bene, a condizione che quest'ultimi non paghino la critica a loro spese.\n> \n> Per favore assicurati di rivedere le Regole Generali prima di pubblicare ulteriori contenuti.\n> \n> Evitiamo la sfilza di \"RIP\" e altri messaggi sbeffeggianti, grazie.\"","replies":[]}]}