{"poster":"21CmOfPureHook","date":"2015-09-04T22:46:11.455+0000","title":"Vantaggio red bot lane dato dalla mappa?","subforum":"Mappe e modalità","up_votes":1,"down_votes":1,"body":"Buongiorno.           mainando support e giocando quindi in not lane ho notato che giocando dalla parte dei red si ha un vantaggio, infatti! Se non dico una cacolata, i blu durante un push alla prima torre saranno esposti ad un gank dal fiume e anche uno dal threebush, invece i red esposti ad un gank avranno pi&ugrave; possibilita di escape, infatti anche se il jungler volesse gankaere da dietro dovrebbe tankarai 3/4 colpi di torre. Ora potreste dire che se anche cos&igrave; fosse nella lane bot avr&agrave; cantaggi il top laner blu, infatti &egrave; cosi, ma dovete contare che nella bot lane il vantaggio va a due giocatori e non solo a uno! Fatemi sapere cose ne pensate qui sotto!","replies":[{"poster":"Nibbio Bianco","date":"2015-09-05T10:20:24.504+0000","up_votes":3,"down_votes":0,"body":"Non è proprio così, in quanto, comunque, se hai un team coordinato che warda le entrate della giungla gankare da dietro non dovrebbe essere possibile. Gankare è molto \"complicato\", bisogna prendere in considerazione un sacco di elementi che di solito in elo più basso non vengono presi, come ad esempio la possibilità di esserecountergankati, di vedere il jungler in una ward e approfittarne per gankare una lane in cui sicuramente non c'è, stare attenti ad eventuali teleport o abilità globali che assicurano gankate facendole diventare da 3 a 4, a volte 5 persone... insomma non è così semplice gankare e a seconda della mappa non si ha nessun vantaggio gli unici vantaggi li prendi dalla visione, grazie alle ward, sopratutto. ","replies":[]},{"poster":"luxetumbra","date":"2015-09-05T07:25:24.047+0000","up_votes":1,"down_votes":0,"body":"In generale si la botlane rossa é meno esposta ai gank ma questa situazione non é un totale vantaggio poiché il jungler rosso può andare botlane solamente passando dal fiume (se non prova un lane gank o passa dalla giungla nemica) e quindi sarà inevitabilmente visto da delle ward dal drago mentre support e adc blu possono tenere una pink nel tribush e una nel Bush dietro al red così da rendere impossibile al jungler rosso di gankare dalla loro giungla e pulendo la ward sul fiume possono permettere al jungler un gank senza contare che fare un lane gank dalla parte blu é più veloce dato che puoi passare dal tribush e non devi andare dietro la torre.\nP.s jungler tipo rek'sai amumu nocturne e credo jarvan possono gankare da dietro il muro ad angolo vicino alla torre rossa (mossa rischiosa ma efficace)","replies":[{"poster":"21CmOfPureHook","date":"2015-09-05T10:10:20.563+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=luxetumbra,realm=EUW,application-id=P2lqIlMN,discussion-id=EP8IIlOF,comment-id=0001,timestamp=2015-09-05T07:25:24.047+0000)\n>\n> In generale si la botlane rossa é meno esposta ai gank ma questa situazione non é un totale vantaggio poiché il jungler rosso può andare botlane solamente passando dal fiume (se non prova un lane gank o passa dalla giungla nemica) e quindi sarà inevitabilmente visto da delle ward dal drago mentre support e adc blu possono tenere una pink nel tribush e una nel Bush dietro al red così da rendere impossibile al jungler rosso di gankare dalla loro giungla e pulendo la ward sul fiume possono permettere al jungler un gank senza contare che fare un lane gank dalla parte blu é più veloce dato che puoi passare dal tribush e non devi andare dietro la torre.\n> P.s jungler tipo rek'sai amumu nocturne e credo jarvan possono gankare da dietro il muro ad angolo vicino alla torre rossa (mossa rischiosa ma efficace)\n\nDi solito io scrivo al mio jubgler di mettersi la per gankare e poi lo lanterno (quando uso thresh) i nemici non se lobaspettano mai, sono quasi sempre due kill assicurate","replies":[]}]},{"poster":"TheAwesomeJ","date":"2015-09-04T23:27:46.853+0000","up_votes":1,"down_votes":0,"body":"Potremo dire di si, perchè effettivamente è così.\nLa bot lane oltretutto è perennemente wardata, quindi diciamo che si può presentare un problema solo in top. Però tieni conto di altri aspetti come la jungla, il team rosso può partire dal blu e avere il buff del gromp tenendosi poi il red buff per i gank.\nE non c'è niente di meglio che un permaslow con true damage per un gank :D\n\nComunque se sono in top preferisco starmene nel team blu :)\nMa se capita di stare nel rosso e di ricevere un gank, poco male sarà una doublekill!","replies":[]}]}