{"poster":"Paluz","date":"2016-11-15T23:34:44.374+0000","title":"flex, la cola que nacio muerta","subforum":"Charlas Generales","up_votes":46,"down_votes":1,"body":"parece que rito quiere obligarnos a jugar esto como de lugar, pero con tan mala optimizacion, desbalanceos exagerados de equipos y posicionamientos absurdos (platinos a bronce, platas a platino) la cola ya cav&oacute; su propia tumba en la comunidad\r\ny con lo que implementaron en el hotfix, empeoraron las cosas y el descontento de la comunidad... la proxima vez que hagan algo asi, USEN EL PBE que para eso esta....","replies":[{"poster":"CoronavirusC0V","date":"2016-11-16T00:09:32.411+0000","up_votes":11,"down_votes":1,"body":"venias bien rito y en una sola noche la cagaste TOODO, todo lo que habias logrado, lo de las skins, los modos de juego, el mismo reclutamiento que tanto te costo perfeccionar y modificar para que sea del agrado de todos lo tiraste a la basura en un solo parche y la seguis cagando con esto de la cola flexible tratando de disumular que no paso nada malo y negando que cometiste el mayor error en todo lo que lleva de vida el league of legends.","replies":[{"poster":"MrFriki","date":"2016-11-16T15:24:22.195+0000","up_votes":1,"down_votes":1,"body":"http://boards.las.leagueoflegends.com/es/c/charlas-generales/lyJjfesh-riot-la-estas","replies":[{"poster":"CoronavirusC0V","date":"2016-11-16T16:48:37.325+0000","up_votes":2,"down_votes":0,"body":"la pagina no existe :P","replies":[]}]}]},{"poster":"la momme","date":"2016-11-16T03:40:35.830+0000","up_votes":6,"down_votes":0,"body":"yo soy unranked juego normal no clasificatoria y llevo 8 partidas perdiendo seguidas.practicamente no puedo jugar bien a mi nivel porq me viven tocando equipos armados y platino oro,pareciera un beneficio pero no lo es porq al no estar a su nivel en las (estaría troleando yo)y nada q ver no estoy a la altura.para mi esto q hicieron los de rito le erraron y por mucho .","replies":[]},{"poster":"AND SirMerkis","date":"2016-11-16T19:27:25.190+0000","up_votes":2,"down_votes":3,"body":"que tiene de malo las flex? onda es una cola para practicar lo veo yo, ademas si sos bueno subis y si sos malo bajas onda dejen de llorar jajajaja.","replies":[{"poster":"Sirek","date":"2016-11-16T19:48:52.780+0000","up_votes":1,"down_votes":0,"body":"Es que no es para practicar, es clasificatoria, la cual tiene la misma importancia que la otra por lo que Riot dijo.","replies":[{"poster":"Insane Sir","date":"2016-11-16T21:38:47.385+0000","up_votes":1,"down_votes":1,"body":"no tiene nada de importante, es como un reclutamiento normal pero con league points, ya que el mmr es otro al de la cola solo/duo","replies":[{"poster":"Ellora","date":"2016-11-16T23:31:06.435+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Insane Sir,realm=LAS,application-id=v7qsfXsE,discussion-id=OHdTE9Xd,comment-id=000300000000,timestamp=2016-11-16T21:38:47.385+0000)\n>\n> no tiene nada de importante, es como un reclutamiento normal pero con league points, ya que el mmr es otro al de la cola solo/duo\n\nEstas totalmente equivocado, donde dice CLASIFICATORIA significa competitivo, ni practica, ni normal, ni tutorial, ni nada. Es entrar para ganar","replies":[]}]}]},{"poster":"Flánn","date":"2016-11-16T20:50:10.389+0000","up_votes":1,"down_votes":0,"body":"Para que te hagas una idea a Faker OJO A EL PUTO FAKER le toco jugar contra un bronce 4 https://www.youtube.com/watch?v=2wV8JPC7Oqk","replies":[{"poster":"Sirek","date":"2016-11-16T21:12:31.050+0000","up_votes":1,"down_votes":0,"body":"jajaja Minuto 10 lo tiene destrozado! xD","replies":[]}]}]},{"poster":"Trick2Gates","date":"2016-11-16T19:39:58.795+0000","up_votes":2,"down_votes":0,"body":"la cola que nació rota?\n\n^^","replies":[{"poster":"Sirek","date":"2016-11-16T19:47:44.733+0000","up_votes":1,"down_votes":0,"body":"Pillin!!!!!!! ^^","replies":[]}]},{"poster":"XxlentaoxX","date":"2016-11-16T16:49:23.290+0000","up_votes":1,"down_votes":0,"body":"La idea principal de tu post me parece correcta, sólo le cambiaría algo. La Flex es sólo un cambio de nombre a la dynamicQ, que permita a las ratas jugar en premade la hace nacer muerta, cualquiera con medio cerebro sabe que para esta cola hay que esperar a que empiece la season 7, rankear quedar oro en las placements y no jugar más rankeds que esas 10. No necesita malos emparejamientos para ser mala. Con ser la dynamicQ y tener que competir con el glorioso soloQ es suficiente para hundirse. Sólo las ratas eloboosteadas la van a usar.","replies":[]}]}