{"poster":"WhiteMax","date":"2016-11-17T00:01:44.887+0000","title":"Problema al iniciar sesion","subforum":"Discusiones sobre el Cliente","up_votes":1,"down_votes":0,"body":"Mi problema es este, cuando entro al juego a escribir mi nombre de usuario y contrase&ntilde;a, como que el tama&ntilde;o del login de inicio de sesion es demasiado grande ahora en este nuevo cliente (en el anterior no me pasaba) y cuando intento moverlo un poco a la izquierda (ya que el marco para escribir datos esta a la derecha), me desaparecen los marcos donde escribo nombre, contrase&ntilde;a, etc.\r\nMi pregunta es si hay una solucion para esto? Porque ya probe buscar las opciones pero literalmente no me sale el dibujo de herramientas porque al igual que con los marcos para escribir datos esta a la derecha y al intentar mover el cliente a la izquierda, desaparece el marco donde escribir datos (aclaro: no me desaparece el cliente ni el splash art del login, solo el marco donde escribir datos).\r\nHay una solucion para esto?\r\nPosdata: no se si esto ayuda pero, mi resolucion es 1024x768 (No se si sera bajo pero en el antiguo cliente podia ver todo perfectamente).","replies":[{"poster":"Aioria99","date":"2016-11-17T00:25:28.087+0000","up_votes":1,"down_votes":0,"body":"Ctrl + o -","replies":[{"poster":"WhiteMax","date":"2016-11-17T01:05:56.590+0000","up_votes":1,"down_votes":0,"body":"Ya lo probe y funciono :D, gracias!!!","replies":[]}]},{"poster":"Aioria99","date":"2016-11-17T00:26:22.707+0000","up_votes":1,"down_votes":0,"body":"Si quieres entrar en el antiguo cliente :v\n\n Si te encuentras con inconvenientes cuando ejecutas el cliente actualizado y no puedes hacer clic en \"Ejecutar cliente de legado\", haz lo siguiente:\n\nDirígite a tu carpeta donde se encuentra instalado League of Legends. Por defecto es: C:\\Riot Games\\League of Legends y luego dirígete a \\RADS\\system\nUbica el archivo .cfg y ábrelo con el bloc de notas\nCambia donde dice \"leagueClientOptIn = yes\" para que diga \"leagueClientOptIn = no\"\nGuarda el archivo y relanza el cliente de League of Legends.","replies":[{"poster":"WhiteMax","date":"2016-11-17T01:03:34.712+0000","up_votes":1,"down_votes":0,"body":"No se supone que este nuevo cliente sera permanente en el futuro? Que caso tiene volver al viejo si en unas semanas tendre este de por vida{{item:3070}}","replies":[]}]}]}