{"poster":"Robibobizockt","date":"2018-02-08T22:32:59.545+0000","title":"Azir muss stärker werden","subforum":"Champions & Gameplay","up_votes":1,"down_votes":10,"body":"Ich finde es gut das champs jeweils angepasst werden, aber ich meiner meinung nach muss Azir st&auml;rker gemacht werden, er hat gegen ander range champions totale probleme und auch wenn es nur w&auml;re das die range des kriegers gr&ouml;&szlig;er wird.\r\n\r\nWas ist eure meinung dazu?","replies":[{"poster":"Cayce","date":"2018-02-08T22:38:47.211+0000","up_votes":6,"down_votes":1,"body":"Azir hat eine lächerliche Laningphase die diesen Patch zum Glück generft wurde. Wenn du Problem hast, liegen sie an deiner Spielweise. Ein guter Azir ist unglaublich dominant in der Lane.","replies":[{"poster":"Gin","date":"2018-02-09T09:05:19.967+0000","up_votes":1,"down_votes":0,"body":"Sei ehrlich, Orianna's Laning Phase ist nicht wirklich besser.\n\nReichlich Waveclear, super sicher, kann extrem gut zonen und viel zu sicher traden. Orianna ist die Burst-Variante von Azir, mit Movementspeed statt einem Dash, und der Möglichkeit ihre Teammates zu schilden ^^","replies":[{"poster":"Cayce","date":"2018-02-09T18:31:52.413+0000","up_votes":1,"down_votes":0,"body":"Azirs early Laningphase ist deutlich stärker. Das Azir Q ist eigentlich nicht missbar, und die Soldaten sind für längere Zeit eine Gefahr, während du bei dem Ball um den Q cd herumspielen kannst. Und durch den Slow vom Azir Q ist der Comet und mindestens ein Autoattack der Soldier auch noch sicher.\n\nDie Soldaten von Azir halten 10 Sekunden. Der cd vom Azir Q war vor dem Nerf 11 / 9.5 / 8 / 6.5 / 5. Wenn dir der Soldat den Weg abgeschnitten hat, hattest du kein wirkliches Zeitfenster um Azir zu punishen. Mit dem Nerf sollte das besser sein, da sich die Platzierrange der Soldaten in Grenzen hält.\n\nDas Ori Q hat mit 6 Sekunden zwar den deutlich niedrigeren Cd, aber bietet damit aber auch ein festes Zeitfenster um sie zu punishen - sie kann den Ball zwar mit E auf sich zurückholen, aber ihr W ist nicht einsetzbar außer zum weglaufen. Und E + W zieht 130 Mana.\n\nSpäter in der Lane hat das Ori Q dann nur noch 3sekunden und sie hat dann ja auch Cdr - dann wird sie tatsächlich extrem eklig in der Lane.\n\nAber gerade in der pre-first Back phase wenn eigentlich keiner das Mana hat um mit Fähigkeiten zu farmen ist Azir schlimmer weil er mit den Soldaten permanenten Zone hat, während Ori stärker von ihren Cooldowns abhängig ist. Gegen Azir spielen fühlt sich wie eine Tortur an(wie nen Xerath auf Steroiden), gegen Ori ist es nicht wirklich anders als gegen andere Mages auf den ersten Leveln.","replies":[]},{"poster":"Nordwolf87","date":"2018-02-09T09:41:22.456+0000","up_votes":1,"down_votes":0,"body":"Gebe dir recht. Aber ich habe schon mit ori gegen azir gespielt...der range nachteil ist echt pain.","replies":[{"poster":"Gin","date":"2018-02-09T10:13:02.990+0000","up_votes":1,"down_votes":0,"body":"Und ich habe schon mit Azir gegen Ori, und mit Ori gegen Azir gespielt. Es ist für beide Pain da deren Reichweite in etwa gleich ist.","replies":[]}]},{"poster":"Qbert","date":"2018-02-09T09:10:03.318+0000","up_votes":1,"down_votes":0,"body":"ich finde aber Azir effektiver als Ori, er hat sowohl Engage als auch Disengage, wenn du mit der Ult mal nicht mehr als einen triffst ist das auch nicht sooo wild, aber Orianna kann, wenn ihre Ult verfehlt, schon gar nicht mehr soooo viel machen wie Azir","replies":[{"poster":"Gin","date":"2018-02-09T09:15:40.544+0000","up_votes":1,"down_votes":0,"body":"Hm? \n\nOrianna kann immer noch ihr ganzes Team beschleunigen, Feinde verlangsamen, jede Menge Schaden drücken, Teammitglieder oder sich selber für eine ordentliche Menge schilden und feindliche Carrys mit der Kugel die ganze Zeit wegzonen und fast nur mit der W+Q wegbursten sollten die dieser doch zu nahe kommen.\n\nZonen kann Azir zwar auch mit seinen Soldaten, diese laufen allerdings nach einer gewissen Zeit ab und haben seit dem Rework eine niedrigere Reichweite als Orianna mit der Kugel.\n\nUnd MIT ihrer Ultimate ist sie um ein vielfaches bedrohlicher als Azir. Sie kann nur mit ihrer Ult-Combo die feindlichen Carrys töten.","replies":[{"poster":"Qbert","date":"2018-02-09T09:17:38.810+0000","up_votes":1,"down_votes":0,"body":"Ja, ich bezog das jetzt wirklich nur aufs Ult und den damit verbundenen Schadensabfall danach.\nBin ja kein Mid-Profi, wollte nur meine Sicht der Dinge kund tun :) ich würde gerne beide Champs können, Ori habe ich mal probiert, und Azir ... naja ... passen beide leider nicht wirklich in mein Portfolio bzw. habe ich leider nicht genug Zeit sie zu trainieren :/","replies":[{"poster":"Gin","date":"2018-02-09T09:22:04.524+0000","up_votes":1,"down_votes":0,"body":"Die Ultimate ist \"nur\" eine W die alles ins Zentrum zieht. Wenn Orianna ihre W zweimal casten könnte, würde das auch reichen um Carrys zu killen.\n\nDer Hauptunterschied zwischen Ori und Azir ist, dass Azir besser als alleine stehender Champion ist, während Ori ihrem Team mit Buffs und Shields helfen kann.\n\nUnd das Azir eher in Richtung DPS/Tank Shred geht, während Orianna die feindlichen Carrys im Bruchteil einer Sekunde bursten kann.\n\nAzir geht also in die Richtung Mage/ADC, während Orianna eher ein Mage/Support ist.\n\nUnd je höher du von der Elo her kommst, und desto besser das Teamplay und deine Teammitglieder werden, desto wertvoller wird Orianna.","replies":[{"poster":"BlackAjani","date":"2018-02-09T09:47:39.292+0000","up_votes":1,"down_votes":0,"body":"Und Teemo? {{champion:17}} {{item:3070}}","replies":[{"poster":"Qbert","date":"2018-02-09T09:59:37.506+0000","up_votes":1,"down_votes":0,"body":"Teemo mit Träne lohnt sich nicht :)","replies":[{"poster":"BlackAjani","date":"2018-02-09T10:11:22.768+0000","up_votes":1,"down_votes":0,"body":"Teemo kann man mit allem spielen und überall.","replies":[]}]},{"poster":"Gin","date":"2018-02-09T09:57:20.602+0000","up_votes":1,"down_votes":0,"body":"Der ist nur anstrengend für Toplaner. Ich spiele Toplane aus Prinzip nicht, daher kann ich dazu nicht viel sagen.","replies":[]}]}]}]}]}]}]},{"poster":"Megamaexx","date":"2018-02-09T07:33:20.360+0000","up_votes":1,"down_votes":0,"body":"> Wenn du Problem hast\n\nAlso entweder bist du so ein Proll-Türke oder du hast ein e vergessen x3","replies":[{"poster":"BlackAjani","date":"2018-02-09T07:39:12.774+0000","up_votes":1,"down_votes":0,"body":"xD Mega\nWenn du Problem hast, \nmach ich dich messer in Bauch","replies":[{"poster":"hi im seb","date":"2018-02-09T08:12:54.705+0000","up_votes":1,"down_votes":0,"body":"ich schör diggah","replies":[]}]}]}]},{"poster":"Nordwolf87","date":"2018-02-09T05:46:53.340+0000","up_votes":3,"down_votes":0,"body":"Ein nahezu 100% pick/ban im profi-bereich braucht dringend einen buff!!","replies":[{"poster":"Gin","date":"2018-02-09T07:51:29.835+0000","up_votes":1,"down_votes":0,"body":"Mit einer 13% Pickrate in Dia+!\n\nEs gibt nichts besseres als immer wieder gegen den selben Champion zu spielen!\n\nUnd Champions die Azir outrangen sind eine seiner wenigen Schwächen, daher wird sich das so schnell nicht ändern.","replies":[{"poster":"Nordwolf87","date":"2018-02-09T08:11:20.586+0000","up_votes":1,"down_votes":0,"body":"13% ist echt hoch! O.O\n\nAber viele champs, die einen azir outrangen können gibts nicht. So ganz spontan fallen mir da nur xerath und vl ziggs ein.\n\nEine seiner größten schwächen finde ich seine extrem anspruchsvollen combos...hab ihn 1 od 2 mal im aram bekommen...der ist echt nicht leicht zu spielen...","replies":[{"poster":"Gin","date":"2018-02-09T08:52:03.869+0000","up_votes":1,"down_votes":0,"body":"Xerath, Vel'Koz, Lux, Ziggs und Jhin wären die ersten die mir in den Sinn kommen.\n\nUnd als jemand der selber 250k Punkte auf Azir hat und ihn früher gemaint hat, weiß ich selber nur zu gut dass Azir kaum bis gar keine wirklichen Counter hat. Er macht einfach zu viele Dinge zu gut. \n\n(Macht Orianna zwar auch, aber ihr mangelt es wenigstens an DPS um Tanks zu killen. Die braucht da schon was länger.)\n\nDas ein Champion anspruchsvoll ist, heißt nicht dass er deswegen alles und jeden in höheren Elos stompen darf weil die Leute da oben diese Champions drauf haben.\n\nGenau so wie Master Yi in Lowelo stompt weil die Leute nicht gegen ihn spielen können, sind Azir und andere High-Skill Champions in High-Elo problematisch weil die zu viele Optionen gegen dich haben.","replies":[{"poster":"Nordwolf87","date":"2018-02-09T09:43:02.718+0000","up_votes":1,"down_votes":0,"body":"Bei vel war ich mir nicht sicher...dessen rage kommt mir gefühlt ahnlich wie die von azir vor, jhin hab ich noch nie mid gesehen in meinen spielen, hat aber mehr range stimmt ^^","replies":[]}]}]}]}]},{"poster":"Shadowscreen","date":"2018-02-09T11:47:55.795+0000","up_votes":1,"down_votes":0,"body":"Bitte nicht....Azir ist gerade schon sehr stark und der Q nerf tut ihm auch keinen all zu starken Abbruch....\n\n{{champion:268}}  Mfg","replies":[]},{"poster":"00 M4ddin 00","date":"2018-02-09T09:18:47.174+0000","up_votes":1,"down_votes":0,"body":"Ok dann möchte ich das Morgana Q gebufft wird :) \nDie Q breiter machen und sie soll minions ignorieren ^^ \n\n\n;)","replies":[]},{"poster":"JHIN IRL L9","date":"2018-02-09T06:51:44.730+0000","up_votes":1,"down_votes":0,"body":"Jhin bräuchte auch mal ein Buff. \nDer Buff auf der R von 20 bei lvl 3 ist einfach nur lächerlich.","replies":[]},{"poster":"Tobbel","date":"2018-02-08T22:43:12.584+0000","up_votes":1,"down_votes":0,"body":"ja und nami zilean tahm kench und lulu müssen auch stärker werden ( weil ich sie immer spiele ) ^^","replies":[]}]}