{"poster":"Rirol","date":"2015-03-27T15:15:48.646+0000","title":"Sona und der Glühende Rauchbrenner","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo,\nIch habe mal eine frage.^^\nFunktioniert der gl&uuml;hende Rauchbrenner mit Sona&#039;s Heal (W) ?\nSona&#039;s W heilt ja sie selbst und Verb&uuml;ndete. Der Text besagt ja folgendes.\n> EINMALIG, Passiv: Deine Heilungen und Schilde auf einer anderen Einheit gew&auml;hren dieser 6 Sekunden lang 25 >% Angriffstempo.\n>(Auf dich selbst gewirkte Regeneration und Effekte ausgeschlossen.)\n\nJetzt frage ich mich, ist Sona&#039;s W f&uuml;r das System jetzt eine Selbstheilung oder gewirkte Heilung auf andere. \nIm letzten Normal [LINK](http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2033321515/32626445?tab=overview) habe ich keine sp&uuml;rbare Verbesserung bei meinem ADC gesp&uuml;rt nach kauf des Brenners. Kann mich aber auch t&auml;uschen, da unsere Caitlyn keinen guten Tag hatte und ich bisher selten mit Caitlyn auf einer Lane war. Sprich ich wei&szlig; aus Erfahrung gar nicht wie schnell sie Schie&szlig;en sollte.^^\n\nWei&szlig; jemand Rat oder hat das Thema schon mal auf NA oder so gesehen?\n\nMfG\nRirol","replies":[{"poster":"Evenrider","date":"2015-03-27T15:18:47.576+0000","up_votes":2,"down_votes":0,"body":"Das man nichts merkt, ist das Problem des Rauchbrenners.\n25% AS ist nicht viel.\n\nAllerdings funktioniert Sonas W mit dem Rauchbrenner.\nJeder Verbündete der den Shield und/oder den Heal bekommt, erhält ebenfalls die 25%. Mit Selbstheilung ist nur gemeint, das Sonas W zwar sie selbst heilt und shielded, aber den AS Boost erhält sie trotzdem nicht.","replies":[{"poster":"Rirol","date":"2015-03-27T15:29:27.800+0000","up_votes":1,"down_votes":0,"body":"Das ich den selbst nicht bekomme ist klar^^\nMir geht es halt um mein Team. Und wenn die den Buff bekommen, ist das gut. :)\n25% klingt zwar nicht viel aber, ich dachte mir das bringt in Teamfights schon einen Vorteil (zumindest bis Midgame) , da ich dann sowieso Massenweise W's raus haue.","replies":[{"poster":"Sirrkas","date":"2015-03-30T06:47:02.543+0000","up_votes":1,"down_votes":0,"body":"Ich finde da {{item:3190}} besser, die Aktive kann einige male zwischen Leben und Tod entscheiden.","replies":[]}]}]},{"poster":"BìgM","date":"2015-03-30T05:29:50.531+0000","up_votes":1,"down_votes":0,"body":"Ja, der Heal von Sona löst den Effekt aus.\n\nFinde das Item situationsbedingt auch recht geil.\nMit einem AS lastigen Team lohnt es sich alle mal.","replies":[]}]}