{"poster":"Rirol","date":"2015-11-21T12:43:35.835+0000","title":"Blitzcranks Q zieht den Gegner nicht heran.","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Hi,\r\nin einigen Spielen mit Blitz ist mir aufgefallen, dass Blitz Q den Gegner nicht immer heranzieht.\r\nWenn Q nicht funktioniert, wird der Gegner manchmal nur einen Teil der Strecke gepullt, meistens gar nicht.\r\nBesonders h&auml;ufig kommt das vor, wenn der Gegner im Bereich seines Towers ist.\r\nDas ganze ist mir jetzt schon mit einigen Gegnern passiert, sowohl im Botgame als auch in Normals.\r\n\r\nMfG\r\nRirol","replies":[{"poster":"BurrScurrSheesh","date":"2015-11-22T14:04:24.501+0000","up_votes":1,"down_votes":0,"body":"Mehr Informationen wären hilfreich. Gegen wen hast du gespielt? Morganas e schützt vor Blitz' Hook, aber die Hand bleibt am geschützten Champion. \nIch weiß gar nicht, ob das bei Sivirs Schild auch so ist.","replies":[{"poster":"Rirol","date":"2015-11-22T14:34:15.574+0000","up_votes":1,"down_votes":0,"body":"Leona, Alistar (bevor er Lvl6 war), Ashe, Draven und Kalista sind die die mir im Gedächtnis geblieben sind.\nMeistens in Bot Games...\nIch hab mich jetzt auch mal auf Replay.gg angemeldet damit ich, wenn es das nächste mal im Normal vorkommt, ein Beispiel habe.","replies":[]}]},{"poster":"XII IX XIX I","date":"2015-11-21T13:19:55.184+0000","up_votes":1,"down_votes":0,"body":"Hahaha das tut mir leid dann kann ich auch nicht weiter helfen, aaah DOCH es gibt items die graps, nook ups etc blockieren,  genauso wie Stuns blockieren, glaube mercurial ist so eins, somit grapst du und der Gegner aktiviert das item \n\nLG","replies":[{"poster":"Rirol","date":"2015-11-21T13:34:02.937+0000","up_votes":1,"down_votes":0,"body":"Ja auch das ist mir bewusst...\nAber auch das konnte ich ausschließen. \nIm early kauft sich das kein ADC und im Spielverlauf ist auch bei keinem der Spiele ein entsprechender Gegenstand zu finden.\nIch habe diese Möglichkeiten schon in einem anderen Thread durchgekaut, da ich weiß das einige Champs die Fähigkeit dodgen können oder man mit Hilfe eines Gegenstandes wieder raus kommt.\n\nTrotzdem danke :)","replies":[]}]},{"poster":"XII IX XIX I","date":"2015-11-21T12:59:22.924+0000","up_votes":1,"down_votes":0,"body":"Ich spiele Blitz sehr sehr oft aber selber hatte ich das Problem nicht, vlt fehlt bei dir n Millimeter damit der Gegner gegrapt wird?  :/","replies":[{"poster":"Rirol","date":"2015-11-21T13:11:07.249+0000","up_votes":1,"down_votes":0,"body":"Sorry, das ist es nicht. Wenn der Arm nicht trifft kommt er ja normal zurück.\nAber der Arm greift und wir stehen beide da und Blitz Arm hängt an dem Gegner, nur bewegen tut sich nichts. Sieht aus als wollten wir Seilspringen spielen.\nUnd wie kommt es das der Gegner manchmal nur teilweise zu mir gezogen wird?","replies":[]}]},{"poster":"PowerSafety","date":"2015-11-21T12:58:52.546+0000","up_votes":1,"down_votes":0,"body":"Ist doch toll. Was will man mehr? :D\n\nNee im ernst dieser Patch ist voll mit Bugs ^^","replies":[]}]}