{"poster":"Baltion","date":"2017-04-10T06:30:51.272+0000","title":"Tipps für Main Support Silber 3","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hallo liebe Leute,\r\n\r\nnach meinem mehr oder weniger erfolgreichen Einstufungsmatches (7W/3L) bin ich Silber 3 geranked worden und hoffe ein paar Tipps zu bekommen worauf ich als Supporter besonders achten muss bzw. welche Items ich auf jedenfall nehmen sollte.\r\n\r\nIch spiele &uuml;berwiegend Janna und Nami als Support.\r\nBei beiden starte ich mit Acient Coin und bau das mit dem Ward-Stein aus.\r\nDann folgt Ardent Censer, Redemption, Locket of the Iron Solari.\r\n\r\nF&uuml;r jeden gut gemeinten Ratschlag w&auml;re ich sehr dankbar. \r\n\r\nLG Baltion","replies":[{"poster":"The real Furry","date":"2017-04-10T19:16:19.081+0000","up_votes":2,"down_votes":1,"body":"Ich würde dir empfehlen deinen Supp Pool etwas zu erweitern so in etwa auf 3 Supps die du Spielen kannst. Zudem ist es wirklich wichtig besonders als Silber Support deine ADCS hart zu protecten, da kaum einer von denen weiß wie man als ADC zu stehen hat. Dein Itembuild finde ich soweit ganz gut nur musst du bei verschiedenen Matchups auch etwas Varianz zeigen d.h. wenn du vom Gegnerteam nur geburstet wirst wäre auch einen Geistessicht (Spirit Visage) oder ein Deathmans Plate (in besonders stark ad und crit lastigen Matchups ist auch ein randuins ok). Wenn du in einem Matchup mal besonders aggressiv spielen musst kannst du dir auch eine Redliche Pracht (Ridgious Glory oder so) zulegen. Mit Janna brauchst du den Censer und bei Nami kannst du ihn auch manchmal weglassen, kommt auf Matchup an. Locket ist in der derzeitigen Meta sehr stark. Das würde ich definitiv als Core Item belassen und in 99% der Matchups auch bauen.\n\nEs ist auch wichtig deine ADCS auf ihr overextending hinzuweisen indem du einmal pingst, maximal 2x, weil das sonst sehr aggressiv wirkt. Du musst nicht an deinem ADC kleben, es sei denn es ist Kallista aber selbst dann ist es oft sinvoller dem ADC Achtung zu pingen um dem Jungler kurz bei einem FIght zu helfen als sinnlos auf der lane zu stehen. Dein ADC wird in diesen Fällen leider meistens sterben, da er nicht weiß dass man gegen 2 Gegner passiv spielt oder er unglücklich gecatch wird. Dennoch ist es dann mehr worth diesen einen Death für 2 Kills mit dem Jungler oder der Midlane zu traden. Also lass dich nicht verunsichern sollte er dich flamen du hast es ja geping.t :)\n\nSei vor allem immer freundlich im Game, auch wenn dus vor dem Monitor mal nicht bist und benutze den Mute Button, wenn du merkst dass einer toxic ist, denn dummes Gesafte kann keiner brauchen. :)\n\nAnsonsten noch viel Glück weiterhin.","replies":[{"poster":"Hmto AkA Oliver","date":"2017-04-11T18:17:40.153+0000","up_votes":1,"down_votes":0,"body":"Spiel einfach Taric und GG","replies":[{"poster":"The real Furry","date":"2017-04-11T18:19:17.742+0000","up_votes":1,"down_votes":0,"body":"Taric ist doch mega langweilig :D","replies":[]}]}]},{"poster":"bard is my life","date":"2017-04-13T21:19:18.336+0000","up_votes":1,"down_votes":0,"body":"Klingt doch toll, Nami und Janna kann man immer gebrauchen :)\nIch hab damals sehr viel gespielt und war Season 4 sogar Diamant.\nAllerdings spiele ich jetzt leider nicht mehr, sonst würde ich dir gerne helfen.\nIch weiß nicht ob du die Webseite [www.leagubreaker.de](http://www.leaguebreaker.de) kennst.\nDiese hat mir damals geholfen in Diamant zu kommen. \nLies dir einfach die 9 Themen durch, das sind so wertvolle Tipps, die sonst nirgendswo im Internet zu finden sind, sie beziehen sich sehr auf die Spielpsychologie und wie du diese nutzen kannst.\nMehr kann ich nicht für dich tun, viel Glück auf deinem Weg :)","replies":[]},{"poster":"Teilzeitmain","date":"2017-04-12T18:27:52.443+0000","up_votes":1,"down_votes":0,"body":"Grüße dich!\n\nEinfach so ein paar Tipps geben ist ungemein schwierig. Wir wissen absolut nicht wo deine Fehler liegen und welcher Spielstil dir gefällt. Klar du hast 2 Sustainchampions in deinem Championpool, aber das heißt auch nicht sonderlich viel. \n\nMein Rat an dich, guck bei mir aufm Youtubekanal vorbei und schau dich um. Ich mach das nun bald seit einem Jahr und bin zu 80/90% auf Support spezialisiert.\n\nhttps://www.youtube.com/user/Flotidus100\n\nFalls dann noch spezielle Fragen sind, beißt sicherlich keiner.\n\nTschüss gemüs!\nFlotidus","replies":[]}]}