{"poster":"Girlington","date":"2016-06-01T00:47:20.153+0000","title":"Pretty Intense Packet Loss","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Since the recent patch, my games have been latency-filled lag fests where my ping is a steady 63-64ms.  At first I thought it was particle effects bogging down my game (usually I run at ~50 fps no problem with medium-high and low shadows) but when I knocked down my graphics settings, nothing had changed.  Latency issues usually involve  an overall delay in seeing particle effects in game, like autoattacks killing minions and then the gold popping out, or flashing and jumping position way after casting the spell.  On occasion it jumps to an unbearable degree in lane or teamfights and can involve anything from complete freezing, sliding champs, or missing spell particles.  Usually accompanied by a heavy FPS drop.  It's not my computer, since I've been playing League for the whole year without issue, and the internet is fine with other games.\r\n\r\nWhat would you suggest I do?  The game is pretty unplayable at this point.  If you need any additional information for logistics, let me know, Rito.","replies":[{"poster":"dArtagnan","date":"2016-06-01T01:04:02.405+0000","up_votes":1,"down_votes":1,"body":"Hmmm...given the description of the issues that you experience, this definitely seems like some sort of Packet Loss Issue.  To confirm this, make sure to run our [Connection Analyzer Tool](https://support.riotgames.com/hc/en-us/articles/209765743).  It'll give you a good idea of the stability of your connection to our servers and some different steps you can take to help improve it.\n\nGive me a heads up if you are still experiencing the same issues!","replies":[{"poster":"Hige","date":"2016-06-01T01:35:13.881+0000","up_votes":2,"down_votes":0,"body":"it only takes a moment on this forum to realize that a lot of players are going through the same issue (myself included) I sent a ticket and got the same response, your tool said I had \"major issues\" even though it is not that bad, the common denominator here is that everyone affected registers lag without ping increasing and it happens ONLY when playing league of legends.\n\nI have taken the time to check on my wi-fi stability while playing and everything is fine. It might not be on your end but how are we supposed to tell brighthouse (in my case) that we have lag when playing your game only and that it's their fault??\n\nEither way, the issue on my end kind of subdued but I got so angry at the answer on my ticket that I didn't even care to answer the e-mail...","replies":[{"poster":"Hoozt","date":"2016-06-01T03:17:28.204+0000","up_votes":3,"down_votes":0,"body":"I have the exact same issue, just lost my promos because of it.\n\nPing at constant 17ms, but game plays like I have 200ms.  Did the connection analzyzer tool, says I have good ping, horrible packet loss.\n\nAnd yes, this only happens on LoL and this has never happened before in my 4 years of playing so I'm sure it's not _my_ connection\n\n(also I do not live in Minnesota, I heard they were having issues.)","replies":[{"poster":"dArtagnan","date":"2016-06-01T22:54:00.334+0000","up_votes":1,"down_votes":2,"body":"Yes, unfortunately the root cause appears to be that you live in Minnesota and we've had issues with setting up peering with ISP's in that area.  We are constantly attempting to get this resolved and get them peered with us.  Unfortunately, I don't have any further news at the moment :(","replies":[{"poster":"MissMikasa","date":"2016-06-01T23:03:06.497+0000","up_votes":1,"down_votes":0,"body":"DUDE! Can you even read? The guy said he DOESN'T LIVE IN MINNESOTA.\n\nAlso, the packet loss is happening EVERYWHERE. Not just MN. Get your dang head in the game, man.","replies":[]}]}]},{"poster":"M Dragon14","date":"2016-06-01T12:38:24.265+0000","up_votes":2,"down_votes":0,"body":"They have to collect info on everyone with the issue before they can determine the problem and develop a fix. This tool is simply showing what the issue with your connection is. While it is pretty obvious that your problem is packet-loss, the tool he is wanting you to use will confirm it. When trying to troubleshoot issues, especially for riot, it's best to cover all the basics. You have to remember, that they are probably not seeing any issues on their side, otherwise they would have mentioned it.","replies":[]},{"poster":"dArtagnan","date":"2016-06-01T22:52:24.863+0000","up_votes":1,"down_votes":1,"body":"I get where you are coming from and from looking at the Help and Support Board, you can definitely feel that you aren't alone and therefore the issue lies elsewhere.  However, this is the place everyone goes to to get help.  With the amount of people playing, there are always bound to be similar issues that players have.  In this sense, its kind of like a doctor office.  When you go to the doctor and you enter the waiting room, its also filled with sick people.  This doesn't mean there is an epidemic and everyone is sick (usually), just that this is where people go when they are sick. \n\nIf the tool says that you have \"major issues\", but you said it isn't that bad.  What are the major issues that it reported exactly?  While I know you may not believe it to be that bad, but even a very small amount of packet loss can have huge issues on the game.\n\nReply back and let me know!","replies":[{"poster":"Hige","date":"2016-06-02T02:55:05.058+0000","up_votes":1,"down_votes":0,"body":"hopefully you haven't read this already, it's back, luckily I was going bonkers over caitlyn and actually went on customs before queuing up, but yeah, then I got into a co-op and it was so bad that cait would attack once and then she'd just fizzle and then attack again, like I was having packet loss in between autos :S","replies":[]},{"poster":"Hige","date":"2016-06-01T23:36:18.037+0000","up_votes":1,"down_votes":0,"body":"yeah I understand, the tone on my first post was rather salty and I apologize.\n\nit says major issues on packet loss, but then again, the issue kinda fixed itself, yesterday I experienced a minor disconnection but it was the internet itself since it all went down, I guess raining season in Florida does that to wiring and whatnot.\n\nThe part that threw me off was the lag without a ping increase, often times, when you lag you know you are because you look at the number and say: \"oh well, gotta wait it out\" but when you can't see it... madness.\n\nThanks again for your help!","replies":[]}]}]}]}]}