{"poster":"GendoRokubungi","date":"2016-05-04T20:43:35.762+0000","title":"(Repost) ¿Mala partida = manco?","subforum":"Comportamiento del jugador","up_votes":10,"down_votes":2,"body":"_Vuelvo a publicar este post ya que Riot me lo borro por colocarlo en la categor&iacute;a incorrecta. Lo siento Riot :&#039;v _\r\n\r\n\r\nHola a todos! este es el segundo post que escribo en el foro.\r\nEn esta noche de insomnio hice una peque&ntilde;a reflexi&oacute;n (si, AMO reflexionar) sobre una palabra muy usada en el LoL y en cualquier juego online: &quot;manco&quot;, y quiero compartirla.\r\nSe le dice manco a un jugador cuando no sabe jugar o comete errores. Pero la cuesti&oacute;n es que en LoL no se puede tener una mala partida tranquilo sin que duden de tu habilidad. Antes de decirle a alguien que es un &quot;noob&quot;, &quot;manco&quot;, &quot;no tenes manos&quot;, pensa en esto:\r\n&iquest;Vos sos perfecto cuando jugas? &iquest;nunca cometiste un error?\r\n&iquest;Nunca tuviste una mala partida?\r\n&iquest;Una sola partida define la habilidad de un jugador?\r\nEsto ya lo dije en el primer post que hice, y lo repito a modo de parafraseo:** parece que en League of Legends hay poca tolerancia al error**; parece que para jugar al LoL tenes que ser perfecto, como si fueras un robot, no un ser humano.\r\nObviamente no me refiero a los que dicen &quot;troleo&quot;, por &quot;x&quot; motivo, y mueren una y otra vez aprop&oacute;sito, me refiero al jugador que se compromete con la partida y capaz no toma las mejores decisiones.\r\nPor ultimo: &iquest;perdiste? no es el fin del mundo, no se olviden que m&aacute;s alla de toda competencia, esto es un juego, y los juegos estan para divertirse y pasar el rato, no para estresarse.\r\n\r\nBuenas noches {{champion:56}}","replies":[{"poster":"Sylphid","date":"2016-05-05T01:01:13.561+0000","up_votes":6,"down_votes":0,"body":"La toxicidad no es culpa del juego en sí por ser competitivo, es culpa de Riot y del tipo de gente que lo juega, este es el primer juego de mucha gente, no fueron \"educados\" en otros juegos online que con mano dura te kickean o te banean a la primera mala palabra, es una comunidad casual, y si se pondrían a banear por insultar perderían mucha gente, así que hay que bancarsela y usar el mute, aunque también vendria de 10 un mute a los pings de ese jugador.","replies":[{"poster":"GendoRokubungi","date":"2016-05-05T02:19:34.304+0000","up_votes":3,"down_votes":0,"body":"Por supuesto, la toxicidad es por los jugadores y no por el juego. En mi caso, LoL es el primer juego online al que le dedico interés, y tal vez gracias a la educación que tuve en casa, se lo que es el respeto al otro, así que no insulto a nadie mientras juego. \nSi Riot fuera muchísimo más estricto con los baneos el server quedaría bastante vacío, así que no queda otra que, como bien decís, \"bancarsela y usar el mute\".\nSaludos!!","replies":[]},{"poster":"SeikaJs","date":"2016-05-05T15:24:38.774+0000","up_votes":2,"down_votes":0,"body":"Como quieren aumentar la cantidad de jugadores (más money pls) permiten el ingreso de las lacras malhabladas y no toman las medidas indicadas.\n\nLo del mute a las señales del jugador silenciado vendría de perlas, te empiezan a spamear pings a mas no poder y muchas veces si bien a uno no le afecte a otros del equipo los puede laguear y causarles problemas durante la partida.","replies":[]},{"poster":"Juanci","date":"2016-05-06T00:38:17.404+0000","up_votes":1,"down_votes":0,"body":"Apoyo la moción con toda violencia","replies":[]},{"poster":"DieOrSovngarde","date":"2016-05-05T22:25:15.162+0000","up_votes":1,"down_votes":0,"body":"En un juego serio, te kickean y banean por 24hs...a la segunda permanente.","replies":[]}]},{"poster":"Bananation","date":"2016-05-04T23:28:42.259+0000","up_votes":5,"down_votes":0,"body":"***","replies":[{"poster":"GendoRokubungi","date":"2016-05-05T00:32:06.540+0000","up_votes":2,"down_votes":0,"body":"Gracias por el aporte! saludos! {{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"Tesnologo1","date":"2016-05-04T21:19:44.533+0000","up_votes":4,"down_votes":0,"body":"Muchos tenemos \"tilteos\", partidas en donde fallamos todas las skills, hasta la q de malphite (fuckin minion), pero como tu bien dices, la tolerancia al error que tiene un número importante de personas es nula, te putean por cualquier cosa.\n\nDistinto es cuando te pones a trolear y regalar kills porque si.","replies":[{"poster":"GendoRokubungi","date":"2016-05-04T21:22:24.339+0000","up_votes":2,"down_votes":0,"body":"Mejor dicho imposible","replies":[]}]},{"poster":"rockokok","date":"2016-05-04T22:29:08.526+0000","up_votes":0,"down_votes":3,"body":"lo que pasa es que a esa persona no la vamos a volver a ver mas en nuestra vida de lol, entonces si nos arruina la partida porque tuvo un mal juego ya automaticamente se convierte en estropea partidas y por lo tanto se convierte, en esa partida, en un manco \nsaludos","replies":[{"poster":"GendoRokubungi","date":"2016-05-05T00:17:17.625+0000","up_votes":1,"down_votes":0,"body":"Pero una partida no se estropea cuando alguien que juega mal, se estropea cuando hay jugadores tóxicos","replies":[{"poster":"Me Perdonas xDD","date":"2016-05-05T06:05:20.161+0000","up_votes":1,"down_votes":1,"body":"prefiero un toxico ante una persona que no sepa jugar.. Saludos.. Despues al toxico no lo veo mas.. y gano puntos.. en cambio el manco me hace perder puntos.","replies":[{"poster":"GendoRokubungi","date":"2016-05-05T17:44:55.666+0000","up_votes":3,"down_votes":0,"body":"Yo lo pienso de este modo: es preferible alguien que, si bien no juega bien, genere un buen ambiente dentro de la partida, que un toxico que juega bien pero genera un ambiente negativo. \nNo todo en la partida es ganar o sumar puntos. La experiencia misma de la partida, pasarla bien, también cuenta.","replies":[]}]}]}]},{"poster":"Slink95","date":"2016-05-05T01:16:04.659+0000","up_votes":3,"down_votes":0,"body":"Eso de poca tolerancia al error en este juego es lo que más odio, y casi me sacan las ganas no jugar más.\nYo tengo partidas en las que no pego ni una habilidad, juego muy mal, etc\n\nTodos tenemos/tendremos/tuvimos una mala partida, es casi imposible que en TODAS las partidas salgamos 9/1 - 13/2\nEn fin, yo cuando leo esos comentarios de \"gg adc/mid/supp/jg/top\", simplemente los muteo y sigo con lo mío.\n\nPero se que cuando tengo una mala partida dejo de jugar por un tiempo y después vuelvo\nSaludos!","replies":[{"poster":"GendoRokubungi","date":"2016-05-05T17:40:32.168+0000","up_votes":1,"down_votes":0,"body":"Yo también casi dejo de jugar al LoL por la toxicidad, estuve casi una semana sin jugarlo, pero después volví a jugar y todo bien... excepto por los jugadores tóxicos. \nSaludos!!","replies":[]}]},{"poster":"fenakz","date":"2016-05-04T21:34:22.719+0000","up_votes":3,"down_votes":0,"body":"Pasa en todas las partidas, nunca falta el que esta pendiente en tu linea en ves de la de el y si moris salta la tipica palabra \"gg adc/mid/jg\" etc. Yo aprendi a no darle bola, ojo como tus compañeros pasa con los enemigos que porque te ganan la linea empiezan a boconear se nota que no gana una partida hace mil .","replies":[{"poster":"Not real Draven","date":"2016-05-05T01:36:51.177+0000","up_votes":2,"down_votes":0,"body":"No solo eso, ademas, en muchas partidas me ha tocado gente que, o no ayuda, o intenta que te agarren mal parado o que te maten, solo para decirte \"ah que manco sos\". Por eso opino que la solución no es solo mutear a un flamer.","replies":[]},{"poster":"GendoRokubungi","date":"2016-05-04T22:11:04.761+0000","up_votes":1,"down_votes":0,"body":"Tal cual, si no es en tu equipo es en el equipo enemigo","replies":[]}]},{"poster":"Sakura Star","date":"2016-05-05T20:37:00.623+0000","up_votes":2,"down_votes":0,"body":"Bue te cuento una que me paso hara 40 min atras.\nLlego de laburar luego de descansar un poco, entro a aram directamente(ya que por mi integridad mental prefiero aram/evento antes de jugar normales/reclutamiento), lo primero que veo son dos cosas.\n* Tenia a {{champion:18}} , que se lo cambie a otro user por {{champion:222}} \n* Al arrancar la partida en el screen de carga noto que tengo 400 ms(reviso mi internet, no era yo).\n* Arranca el match(o partida) y de entrada el {{champion:105}} nos advierte de la {{champion:18}} y de {{champion:5}}  que ambos eran jugadores troll y que tuviesemos cuidado si estaban cerca(obviamente de nuestro team).\nEn lo que termino resumidas cuentas en un surrender por parte del team contrario  ya que habia un {{champion:11}} que lo mataban cada respawn que hacia (que lol...).\nPero en el entremedio de la partida comienzo a leer el chat de las agresiones entre {{champion:105}} {{champion:5}} {{champion:18}} , lo cual de manera muy troll termine diciendole a tristana \"que pasa, no te estan dando bola tus padres en tu casa, que venis a molestarnos aca a todos en internet y encima en un juego?\", lo que llevo al dicho troll a callarse la boca(le dolio la moral al parecer), en lo cual me vuelve a agredir a mi, retandome a pvp a mi y al fizz.\nEn un momento antes del surrender llame a Annie y a Fizz a quedarnos en la base ya que al parecer los dos estaban diciendo \"estos mancos, no sirven, solo ganamos por nosotros\" los dos {{champion:5}}  {{champion:18}} encima la tristana era robo puros de kills, tuve 27 asistencias, de las cuales 15-16 kills fueron robados por la tristana . \nJusto se dio el surrender, yo tambien suelo manquearla en Aram porque a veces me tocan champs que en mi vida use o las pocas veces me ha tocado con {{champion:30}} pero debo comenzar a usarlo mas seguido, lo compre hace poco lo cual no se 100% todo sobre el dicho champ.\nNo se, pero me causo una gracia.\nMe paso algo parecido en la siguiente partida, solo por usar a Karthus, pero robe varias kills con la ulti, pero aun  asi me usaban de carnada para safar ellos, ni siquiera podian aprovechar la W que da ralentizacion...solamente inteligentemente la {{champion:84}}   se le ocurrio aprovecharlo.\nYo tambien tengo mis momentos de manquedad o porque ando mal por cosas personales, pero loco aca todos en su mayoria(no digo todos) se creen que son los lord del universo, profesionales e incorregibles. Despues son los que lloran a riot xD cuando los denuncias.","replies":[{"poster":"GendoRokubungi","date":"2016-05-05T21:17:36.466+0000","up_votes":1,"down_votes":0,"body":"El problema es que algunos jugadores se creen que estan jugando la final de la LCS en un team profesional, cuando en realidad estan jugando una típica y cotidiana partida de LoL. Se olvidan que detrás de un campeon hay una persona que capaz no esta pasando un buen momento y viene a jugar para desconectarse un rato, y con ese flameo lo hacen sentir peor. \nYo también tengo momentos de manquedad, pero si juego al LoL es para pasarla bien, no para hacerme el pro player; parece que esta comunidad (no todos) se olvido de la palabra diversión. \nSaludos!","replies":[]}]},{"poster":"Hi im Kub","date":"2016-05-05T18:51:16.054+0000","up_votes":2,"down_votes":0,"body":"Para mi es asi:\n\nPartidas malas tenemos todos, pero también hay que ver con que frecuencia y como se desarrolló la partida, por ejemplo puedo ir 2/1 en mi linea y que me campeen toda la fase de lineas, o que te hagan focus por ser el fed y terminar 3/7 por ejemplo (Esto ultimo me ha pasado bastante)","replies":[{"poster":"GendoRokubungi","date":"2016-05-05T21:26:46.605+0000","up_votes":1,"down_votes":0,"body":"Tal cual, hay muchos factores que determinan el resultado de una partida","replies":[]}]},{"poster":"EstufaDePared","date":"2016-05-05T13:43:46.017+0000","up_votes":1,"down_votes":0,"body":"Te parás cerca del que te bardea, presionás CTRL+4. (Tiene mejor efecto con campeones como {{champion:117}} , (a mi me gusta hacerlo con {{champion:53}} )), lo repetís tres o cuatro veces al procedimiento y volves a tu juego.\nRepetir en caso de que te sigan molestando... Y, lo más importante, no contestar, no vale la pena.\nSaludos.-\n\nP/D: Consejo de un manco con todas las letras. jaja","replies":[{"poster":"GendoRokubungi","date":"2016-05-05T17:14:00.254+0000","up_votes":2,"down_votes":0,"body":"Posta, no hay que contestarle a los flamers. Hay un dicho que dice que la indiferencia mata. Saludos!!!\nPD: Te falto {{champion:99}} (?","replies":[]}]},{"poster":"LemønPykë","date":"2016-05-04T23:43:14.695+0000","up_votes":2,"down_votes":0,"body":"te cuento una anécdota muy graciosa, una vez estaba jugando de adc con {{champion:81}}  y tenia un {{champion:432}}  de soporte.\nCabe recalcar que el toplaner de nuestro equipo era un {{champion:98}} .\nBueno la cosa es que estaba todo muy reñido en bot, y el top escribía cada 2 por 3 \"dat bot\" \"dat jg\" \"gg\" desde el minuto 5, y ojo, nadie había hecho cagadas como para que diga eso, la cosa es que nos gankea su jungla, counter gankea el nuestro también, yo tiro flash para volver un poco atrás sino moría, y seguimos peleando, y me matan, fue justo en ese momento que veo el chat \"xxxxxxxxxxxx (Shen): Dat adc\" estaba en base, y solo miraba bot para bardear a alguien, la ulti la dejo de adorno solo para decir gg después.","replies":[{"poster":"SeikaJs","date":"2016-05-05T15:27:47.985+0000","up_votes":2,"down_votes":0,"body":"Un clásico ... pero despues si no lanzas tu ulti te bardean ellos  -_-","replies":[]},{"poster":"GendoRokubungi","date":"2016-05-05T00:34:21.648+0000","up_votes":1,"down_votes":0,"body":"Le importo más bardear que ayudar... Dat Shen  {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"LemønPykë","date":"2016-05-05T03:31:32.573+0000","up_votes":2,"down_votes":0,"body":"Exacto :C","replies":[]}]}]},{"poster":"Biryuk97","date":"2016-05-05T01:14:33.222+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=GreyWolf91,realm=LAS,application-id=PJAKt7ph,discussion-id=bNspGhtK,comment-id=,timestamp=2016-05-04T20:43:35.762+0000)\n>\n> _Vuelvo a publicar este post ya que Riot me lo borro por colocarlo en la categor&amp;iacute;a incorrecta. Lo siento Riot :&amp;#039;v _\n> \n> \n> Hola a todos! este es el segundo post que escribo en el foro.\n> En esta noche de insomnio hice una peque&amp;ntilde;a reflexi&amp;oacute;n (si, AMO reflexionar) sobre una palabra muy usada en el LoL y en cualquier juego online: &amp;quot;manco&amp;quot;, y quiero compartirla.\n> Se le dice manco a un jugador cuando no sabe jugar o comete errores. Pero la cuesti&amp;oacute;n es que en LoL no se puede tener una mala partida tranquilo sin que duden de tu habilidad. Antes de decirle a alguien que es un &amp;quot;noob&amp;quot;, &amp;quot;manco&amp;quot;, &amp;quot;no tenes manos&amp;quot;, pensa en esto:\n> &amp;iquest;Vos sos perfecto cuando jugas? &amp;iquest;nunca cometiste un error?\n> &amp;iquest;Nunca tuviste una mala partida?\n> &amp;iquest;Una sola partida define la habilidad de un jugador?\n> Esto ya lo dije en el primer post que hice, y lo repito a modo de parafraseo:** parece que en League of Legends hay poca tolerancia al error**; parece que para jugar al LoL tenes que ser perfecto, como si fueras un robot, no un ser humano.\n> Obviamente no me refiero a los que dicen &amp;quot;troleo&amp;quot;, por &amp;quot;x&amp;quot; motivo, y mueren una y otra vez aprop&amp;oacute;sito, me refiero al jugador que se compromete con la partida y capaz no toma las mejores decisiones.\n> Por ultimo: &amp;iquest;perdiste? no es el fin del mundo, no se olviden que m&amp;aacute;s alla de toda competencia, esto es un juego, y los juegos estan para divertirse y pasar el rato, no para estresarse.\n> \n> Buenas noches {{champion:56}}","replies":[]},{"poster":"Zoycite","date":"2016-05-04T20:46:51.274+0000","up_votes":2,"down_votes":0,"body":"Me caes bien +1","replies":[{"poster":"GendoRokubungi","date":"2016-05-04T20:56:56.302+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"La corrupción","date":"2016-05-04T20:46:42.137+0000","up_votes":2,"down_votes":0,"body":"hola, creo que comenté en el otro post, asi que vengo a comentar en este, como andas?","replies":[{"poster":"GendoRokubungi","date":"2016-05-04T20:56:33.314+0000","up_votes":1,"down_votes":0,"body":"Hola! la verdad que no me acuerdo si comentaste en el otro xD\nAndo bien, gracias por preguntar :)","replies":[]}]},{"poster":"Me Perdonas xDD","date":"2016-05-05T05:07:32.417+0000","up_votes":1,"down_votes":2,"body":"En ves de llorar deberías de perfeccionar tu game.. si te flamean por que juegas mal.. es por que estas jugando mal y punto viejo.. que quieres que te digan.. que estas jugando muy lindo ? Las partidas contra bots estan para practicar los champs .. las normales son para perfeccionar aun mas (igual se nota cuando ni si quiera tienes noción de las habilidades del PJ) Y las rankeds son para valerte a ti mismo como vas. \n\nYo soy de los que si voy perdiendo.. es por que mi team va mal.. y eso que soy D5.. Generalmente siempre pierdo por culpa de mis compañeros.. Casi nunca por mis errores. y eso de que ahh no fuiste lo suficientemente bueno para carrearlos.. es pura mentira.. es imposible carrear a gente que en ves de ayudar son un peso muerto.  Te adjunto un link como claro ejemplo:\n\nhttp://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/324524546/123065?tab=overview\n\nesa partida fue hace poco.. hace harto rato que ya ni juego lol y solo juego para mantenerme en la linea....\n\nResumen del encuentro: La partida inicio bien.. gracias a mis roamings y mi apoyo al equipo.. Luego de eso.. el equipo empezó a perder la cabeza.. regalándose a los enemigos y obviamente Ni wardean.. ni compran pinks.. de hecho FUI EL UNICO QUE COMPRO SEGUN LA ESTADISTICA.. Akali top tanke.. (Cuando falta cc) Lee sin sin manos.. y falta mencionar a mi queridicimo adc que gastaba la ulti contra los tanques para *Bajarles* la vida.. Como si fuera lucían el tonto weon.\n\nMoraleja de la historia.. Si no quieres que te flameen.. Mejora tu juego.. sube lo que mas puedas.. si te aburres.. juega solo para mantenerte en tu división.. League of Las hace rato que se volvio una mierda de comunidad.. Los emparejamientos a mi parecer no son los que corresponden... fuera de broma.. hace tiempo que no disfruto una partida donde la partida realmente esta equilibrada.. Cuando duraban 40 minutos y aun ni se define quien gana la partida... cuando realmente estaba peleada la partida.. no las partidas cuando mis compañeros regalan todo.. \n\nSaludos bro.. ojala te valla bien.\n\nPD: no suelo comentar el foro.. pero cuando lo hago es por que tengo atados con el cliente.. Como siempre.. PVP PATCHER y la p...que la repario.","replies":[{"poster":"GendoRokubungi","date":"2016-05-05T17:39:06.060+0000","up_votes":2,"down_votes":0,"body":"Si, podría jugar mejor, pero ser manco no justifica que te insulten y te falten el respeto.\nAdemas esto no es un \"crypost\", es una opinión personal; y no lo digo por mi solamente, lo digo por todos los que pasaron por eso. \nEn lo que si estoy de acuerdo es que la comunidad deja mucho que desear, y que es absurdo pensar que porque sos Diamante tenes que carrear siempre. \nSaludos!","replies":[]},{"poster":"SeikaJs","date":"2016-05-05T15:57:16.292+0000","up_votes":2,"down_votes":0,"body":"Pregunto, de curiosidad:\n\n- Le sugeriste al equipo con el que se te emparejo el tema de la falta de CC al momento de los picks y bans?\n- Les dijiste de forma adecuada que no se lanzaran de cabeza?\n- Supongo que fuiste first pick por que los champs del enemigo tienen obviamente de todo para parar una Kata (excepto el negro)\n\nLamentablemente el emparejamiento actual ofrece la opción de ir en premades muy grandes, absurdas y la opción del SoloQ esta quedando muy al margen pues Riot quiere que el juego realmente pase a ser algo competitivo por equipos (meh), a menos que vayas con un equipo de jugadores en los cuales confies en sus capacidades es mejor no rankear, el riesgo es mucho.\nAl ir uno solo y el resto premade te arriesgas a que la comunicación entre tu y ellos no sea la adecuada (skype, ts, raidcall, etc) por ende al momento de lanzarse o iniciar TF se entre tarde, el fijar objetivos se puede ver retrasado por decisiones que tu o los demas crean importantes, puede que ambos tengan razón pero la pelea del \"yo tengo razon y más que tú\" arruina todo. \nComo son premade estas mas suceptible a que a uno le culpen por lo mal de la partida, a veces sucede que la premade completa esta funcionando mal o gran parte de ella o que el jugador random cause tal fedeo del equipo rival que culmina en una fase de líneas terrible ademas de los consecuentes gankeos por haber ganado ya su lane (pasa mucho en premade de 4 con 1 random).\n\nEn lo personal yo este año quería rankear en SoloQ adecuadamente (el año pasado por temas de estudio saque las 10 para ver que onda con todo el tilt del mundo xD) pero con los cambios implementados si no vas en equipo puedes verte muy mal parado y para mas mala suerte la mayoría de mis amigos con los que jugaba lo han dejado por otros juegos de comunidad mas amable.","replies":[]}]},{"poster":"TheSystruction","date":"2016-05-08T00:38:51.868+0000","up_votes":1,"down_votes":0,"body":"a mi me da igual esta gente, a carrearlos un poco y a mandarlos a llorar a casa hombre {{sticker:slayer-jinx-wink}} por cierto,  Jinx es buenísima para carrear mancos, pruébenla, en late con los ítems correctos pues usas a tu equipo de escudo y gg","replies":[]},{"poster":"kiuhm","date":"2016-05-05T18:46:18.571+0000","up_votes":1,"down_votes":0,"body":"Una cosa es terminar 0/3 y otra es ir 2/8 al minuto minuto 13.","replies":[{"poster":"GendoRokubungi","date":"2016-05-05T21:25:29.547+0000","up_votes":1,"down_votes":0,"body":"Te doy como ejemplo uno de los primeros comentarios que recibí en el post:  \n{{champion:91}} VS {{champion:91}}; uno sale 2/8, el otro 15/3, al Talon 2/8 lo flamean incansablemente, pero resulta que el Talon 15/3 es Platino I, el otro es unranked. \nSi vas 2/8 al minuto 13 puede ser por varios factores: te campea el JG enemigo, te toca un contrario que juega mejor que vos, te hacen focus, son muchas posibilidades, pero lamentablemente se reduce a ser manco y ya esta. \nAparte, es muy fácil criticar al otro cuando le va mal, pero es muy distinto cuando es uno el que falla, ahi el narcisismo y el ego de cada uno actua como una barrera.","replies":[{"poster":"kiuhm","date":"2016-05-05T21:49:21.874+0000","up_votes":1,"down_votes":0,"body":"Lo del flameo es chamuyo, muteas y listo. por mas que el otro sea faker, talon no te puede divear. despues de morir 2 veces seguidas, te quedas piola bajo torre hasta que te ayuden. \nEn ese momento estas asumiendo que tenes una mala partida. ahora si moris 15 veces haciendo lo mismo, esa no es una mala partida, es que no sabes jugar.","replies":[]}]},{"poster":"GendoRokubungi","date":"2016-05-05T21:29:49.310+0000","up_votes":1,"down_votes":0,"body":"Digo, lo recibí en el otro post que me borraron :'v","replies":[]}]},{"poster":"Gordo Merquero","date":"2016-05-04T21:11:19.840+0000","up_votes":1,"down_votes":9,"body":"Sos un manquito. {{sticker:zombie-nunu-bummed}} ","replies":[{"poster":"GendoRokubungi","date":"2016-05-04T21:27:16.782+0000","up_votes":1,"down_votes":0,"body":"Nunca manqueaste? nunca te equivocaste en una skillshot? nunca te ganaron la linea? nunca tuviste una mala partida? que suerte","replies":[]}]}]}