{"poster":"Ignotum ITA","date":"2018-11-25T15:43:58.199+0000","title":"Approfondimento generale per non creare altri thread su domande di elo o ricompense.","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"1. Ricompense di Ranked a fine season 2018\r\n\r\nQuando finira la season?\r\nLa season finir&agrave; il 12 novembre esattamente a 00:00\r\n\r\nLe ricompense in game, quando verranno date?\r\nTUTTE le ricompense verranno date entro il 12 dicembre del 2018\r\n\r\nCome verranno distribuite le ricompense?\r\nLe ricompense verranno distribuite in modo diverso, con le missioni.\r\nLe missioni appariranno nel tuo account e saranno garantite le ricompense,\r\nQuali saranno le missioni? Entra nel tuo account :)\r\n\r\n\r\n\r\nChe ricompense ricever&ograve;?\r\n \r\nBRONZE\r\n \r\nL&#039;icona Evocatore per il bronze elo in ranked.\r\n\r\nSILVER\r\nIcona evocatore per il piazzamento in silver per ranked,\r\nBordino della schermata di caricamento per le partite . (ci&ograve; cambia in che elo hai concluso la season e in che modalit&agrave;)\r\n\r\nGOLD &amp; ETC.\r\nIcona evocatore per le ranked con l&#039;elo raggiungo, gold etc.\r\nBordino della schermata di caricamento partite gold etc.\r\nSkin vittoriosa con i chroma, in questo caso Orianna vittoriosa\r\n\r\n\r\n\r\nCHALLENGER\r\nPer chi ha raggiunto l&#039;alto challenger verr&agrave; spedito uno zaino challenger per la vittoria (qui non sapevo come tradurlo e ho fatto cos&igrave; direttamente)\r\n \r\n\r\nCome ricever&ograve; il mio bordino della schermata di caricamento?, quando verr&agrave; attivato?\r\nIl tuo bordino della schermata di caricamento verr&agrave; sbloccato assieme alle altre ricompense. per&ograve;, questo bordino verr&agrave; rimosso alla fine della season 9 e sar&agrave; visibile soltanto durante la pre-season.\r\n\r\nRicever&ograve; lo stesso, la skin di orianna vittoriosa anche se non ho sbloccato il champion?\r\nAssolutamente, il champion verr&agrave; Sbloccato insieme alla skin.\r\n\r\nVerranno dati anche dei lumi onori, (Bisogna solo avere il livello 2 per avere le ricompense, ricordiamoci di ci&ograve;).\r\nCome la season scorsa verranno dati lumi di onore livello 3 4 5,\r\nlvl 3: Blu\r\nlvl 4 : Viola\r\nlvl 5: Arancione.\r\n\r\n2. Ranked 2019\r\nQuando inizier&agrave; la season 9?\r\nil 24 gennaio 2019.\r\n\r\nCi sono nuove novit&agrave; nel prossimo anno di League of Legends 2019, Sono stati introdotti 2 nuovi elo\r\nIl Ferro, che sar&agrave; situato sotto il bronzo, e il Grandmaster tra il master e il challenger.\r\nRicordiamo che dopo questa season non esister&agrave; pi&ugrave; il bronzo 5, Ogni quinta lega verr&agrave; cancellata e rimarranno solo 4 leghe, es, ferro 4, ferro 3, ferro 2, ferro 1,  bronzo 4. E le placements l&#039;anno prossimo funzioneranno come delle semplici promo, Prendi molti pi&ugrave; lp es 40/50 , se sei silver3 con 100 lp invece di giocare 3 game diventi subito silver2, stessa cosa per s1 e gold5 andando in s&ugrave;. Quindi, decider&agrave; solo a voi, In che elo giocare.\r\n \r\nP.S Ho voluto scrivere ci&ograve;, per chi sta ancora spammando thread con scritto &quot;perch&egrave; non ho le mie ricompense&quot;? Ricordo che questo, &egrave; un post proveniente dal forum inglese, gentilmente tradotto da me senza google translate. https://boards.euw.leagueoflegends.com/en/c/help-support-en/g85GrjiE-helpdesk-ranked-rewards-2018-ranked-system-2019\r\n\r\nAlcune parti le ho saltate perch&egrave; per me non erano molto importanti, spero di aver fatto luce nelle vostre menti annebbiate. siccome qui nel forum italiano non &egrave; stato fatto nulla allora ci penso io.\r\nAvvisatemi se c&#039;&egrave; qualcosa di sbagliato che aggiorno e.e","replies":[]}