{"poster":"Just Nocturne","date":"2016-03-11T17:07:04.607+0000","title":"Fappys Five","subforum":"Clans & Teams","embed":{"description":null,"url":"https://www.youtube.com/channel/UCflVkqymASyv8uz8XpTBnow","image":null},"up_votes":2,"down_votes":2,"body":"Hallo liebe Leser,\r\nUnser Ranked Team geht diese Season in die 3te Runde und wir w&uuml;rden uns sehr &uuml;ber neue Mitglieder freuen. Wir haben die Letzte Season auf Silber gespielt und Streben diese Season Gold oder h&ouml;her an. Unser Team ist sowohl im 3v3 als auch im 5v5 vertreten. Wir haben au&szlig;erdem feste Trainingszeiten (welche ihr in den Kommentaren findet) und unseren eigenen Ts ( zumindest einen Bereich :3 ) Zudem haben wir eine bestehende Whatsapp Gruppe in der man Training absagen kann oder jemanden fragen kann ob er lust auf ein Game hat. Wir haben momentan 4 Pl&auml;tze frei und suchen Spieler zwischen Bronze und Gold. Ich kann Heute 3 Leute Einladen. \r\n\r\n(Au&szlig;erdem w&auml;re es ziemlich Gut wenn ihr ebenfalls &uuml;ber Youtube und Programme zur Aufnahme verf&uuml;gt. Meinen Kanal findet ihr oben verlinkt){{champion:56}} \r\n\r\n\r\nKommen wir zu euch.\r\n\r\n\r\n\r\n&gt; * Ihr solltet Teamranked Erfahrung haben.\r\n&gt; *  Eine dieser 3 Posis. Spielen.   [ Adc , Mid , Jung ]\r\n&gt; *  Solltest du Jungler oder Support sein Shot Calling beherrschen.\r\n&gt; *  Einen relativ gro&szlig;en Champion Pool haben.\r\n&gt; * Spa&szlig; am spiel haben und nicht Ragen/tilten.\r\n&gt; * Au&szlig;erdem  Whatsapp und Ts3 zur Kommunikation haben. \r\n&gt; \r\n\r\nSolltest du Interesse haben kannst du mich Unter **_Sir Garnkill_** oder **_Nocturne ez Pz_** erreichen. \r\nDanke f&uuml;rs lesen :)\r\n{{item:2050}}","replies":[{"poster":"Rucking Fiot","date":"2016-03-11T19:35:43.294+0000","up_votes":1,"down_votes":0,"body":"Hey.\nHab Interesse und bin eig auf jeder Lane gut... bis auf Adc xD\nSollte noch was frei sein, adde mich bitte c: (kann grad nicht on um dich zu adden D: )\nHab auch alles an Aufnahmeprogrammen was man so braucht :)\nMfg NightcraftfpvpYT\n (ich brauch definitiv nen neuen Namen xD)","replies":[{"poster":"Just Nocturne","date":"2016-03-11T20:31:13.372+0000","up_votes":1,"down_votes":1,"body":"Hey :) \nBis jetzt habe ich bloß eine Anfrage auf Jungle und Adc , das heist wenn du Mitte Gut kannst sollte das alles kein Problem. Wir haben allerdings feste Trainingszeiten und hoffen das du dich an diese Anpassen kannst. Sollte das alles so weit klappen würde ich sagen willkommen im Team. Falls ich es heute nicht mehr schaffe dich zu adden würde ich dich bitten das zu machen. meinen Namen hast du ja ;)","replies":[{"poster":"Rucking Fiot","date":"2016-03-11T22:04:23.343+0000","up_votes":1,"down_votes":0,"body":"Zed main c:\nKann frühstens morgen Abend adden... bzw onkommen... hab noch bisschen technische Probleme mit dem PC {{sticker:slayer-jinx-unamused}}","replies":[]}]}]},{"poster":"der Casper","date":"2016-03-11T17:20:19.243+0000","up_votes":1,"down_votes":0,"body":"Hallo .\nich hätte intresse.wen noch platz ist schreibt mich mal an\nmfg der casper","replies":[]}]}