{"poster":"Danispark","date":"2018-04-05T12:38:50.744+0000","title":"Segnalazioni prepartita / Re-matchmaking","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Sono stanco di dover perdere 3 lp e 5 minuti ogni volta che qualcuno nel mio team decide in champ select che troller&agrave;.\r\nEs. Adc banna yasuo al toplaner = il toplaner dice che troller&agrave; e prende soraka \r\n\r\nSarebbe opportuno poter fare una segnalazione a riguardo prima che la partita inizi o far partire una votazione a tutti i membri che compongono la squadra per riformare il team\r\n\r\nIl problema &egrave; che potrebbero abusarne nel caso in cui ci siano counter pick\r\n\r\nche so fare in modo che il re-matchmaking avvenga solo dopo i ban in una finestra di 60 secondi cosicch&eacute; se ci sono problemi del genere uno lefta direttamente e cerca una nuova squadra.","replies":[{"poster":"Dr LouD","date":"2018-04-05T12:50:16.634+0000","up_votes":2,"down_votes":0,"body":"Soraka top > Yasuo top","replies":[{"poster":"Detective Meow","date":"2018-04-05T12:53:21.265+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dr LouD,realm=EUW,application-id=MJVj50Jw,discussion-id=oNrcZahW,comment-id=0000,timestamp=2018-04-05T12:50:16.634+0000)\n>\n> Soraka top &gt; Yasuo top\n\n^this","replies":[]}]},{"poster":"Detective Meow","date":"2018-04-05T13:03:10.834+0000","up_votes":1,"down_votes":0,"body":"In effetti in low elo è un bel problema.\nNon tanto per i 3-5 LP che ti vengono tolti (che comunque è una porzione di tempo che tu hai dedicato a vincerli, per poi vedertene tolti una parte per colpa di qualcuno con la testa calda, quindi perchè ad ogni modo dovrei perderli IO, o tu?).\nMa è l'attesa per fare un'altra partita del dopo aver lasciato una champion selection, che può andare da 5 min a anche mezz'ora credo(perchè, di nuovo, devo rimetterci IO del tempo, quando un tipo a caso ha deciso a priori che o gioca il suo campione che per altro viene permabannato, oppure fare di tutto per far perdere LP ad altre 4 persone mettendosi in testa di dare 15 kills nei primi 5 minuti?).","replies":[{"poster":"Danispark","date":"2018-04-05T13:08:38.297+0000","up_votes":1,"down_votes":0,"body":"esattamente {{sticker:slayer-jinx-unamused}}","replies":[]}]}]}