{"poster":"Hunkrisz1","date":"2014-07-08T12:18:01.834+0000","title":"Nekem az a bajom a lolal","subforum":"Hibabejelentés","up_votes":1,"down_votes":0,"body":"A lol a világ legjobb játéka de az a baj hogy nagyon kevés mapp van benne ez nekem nem nagyon tetszik de amúgy az egész játék nagyon jó !!","replies":[{"poster":"DannyT","date":"2014-07-08T13:42:16.898+0000","up_votes":3,"down_votes":0,"body":"Üdv! :)\n\nPár új pálya magában nem lenne meghatározó elem a játékban. Pl. ha most beraknánk 5 új 5v5-ös pályát, akkor kb. semmit sem változtatna a játékosok hangulatán, maximum látványtechnikailag, maximum az lenne, hogy egy-egy játékra sokkal-sokkal többet kellene várni, hogy bedobjon. Más egyéb fejlesztéseink, melyek jelenleg folyamatban vannak, pedig rengeteg újdonsággal színesítik majd a játékot. ;)","replies":[]},{"poster":"Littlefox97","date":"2014-07-08T13:49:15.276+0000","up_votes":2,"down_votes":0,"body":"szerintem nem kellenek új pályák, inkább csak azokat felújítani (ami most fog jönni) pld: a dominion sokkal jobb lenne egy új mappal","replies":[]},{"poster":"M4dr4c","date":"2014-07-08T12:35:21.394+0000","up_votes":2,"down_votes":0,"body":"Mivel a játék nem a pályákról, hanem a hősökről szól.","replies":[]},{"poster":"Kadegrow","date":"2014-07-09T18:05:55.276+0000","up_votes":1,"down_votes":0,"body":"Nem jó, mert így is Dominionra meg ARAMra várni kell azé, Csapatkészítőbe meg szintén vagy perceket 5v5 normal Draft pick ott is vagy 5 percet várni kell.\nMax egy CTF még illene ide, de nagyon pálya nem kell mert ígyis várni kell 2-3 percet normal és rankeden kívül.\nItt igazából ja, kinézetet kell újítani 5v5-be már megvan a kinézet, de azé én örülnék ARAMra vagy Dominionra, hogy egyik oldal szép erdős másik meg sötét, vagy egyik sivatagos másik dzsungeles és mind2 helyen más effect. Szóval inkább kinézetet kell újítani.","replies":[]},{"poster":"AbodyHUN666","date":"2014-07-08T15:38:46.568+0000","up_votes":1,"down_votes":0,"body":"ugyanazért nincs több map a játékban, amiért nincs másféle csocsóasztal, vagy kosárlabdapálya átrendezett vonalakkal. annyi sokat kellene dolgozniuk azon, hogy teljesen balanszolva legyen egy új pálya mindkét félnek, hogy hacsak nem hagynának félbe minden újítást egy évre 3-4 éven belül nem is tudnának egy ilyen dolgot megcsinálni","replies":[]}]}