{"poster":"MetalClaw6000","date":"2015-11-15T23:03:21.882+0000","title":"Borders Gone Wrong!","subforum":"Report a Bug","up_votes":2,"down_votes":0,"body":"First off had no idea to put this as a bug or the need Help/Support calm... (Just a heads up)\n\nBut I need help my loading screen border is showing the incorrect version of the one I&#039;m supposed to have, I&#039;m in Silver 1 but i have the Silver 5 one instead. \nA friend of mine also has the same problem he has the S5 border as me but he&#039;s in S2. Just what to have the right one because its really awesome.\n\nBut if you don&#039;t see this, hope you do see some else have the same problem and fix it.  Thx for all the cool thing you guys do.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"moonstones","date":"2015-11-16T21:21:41.715+0000","up_votes":1,"down_votes":0,"body":"Hiya! \n\nWere you Silver 5 last season? Rewards are still in the process of being handed out, so you may not have received the updated border.","replies":[{"poster":"MetalClaw6000","date":"2015-11-16T21:28:25.930+0000","up_votes":1,"down_votes":0,"body":"Ya I was, but weird thing was when you guys changed the borders on the patch (before the give outs) it gave me the S1 border no idea why but i had it. Also I got my rewards already but that's when the change happened it gave me my S5 back and got rid of the S1 I had, its all so weird.","replies":[{"poster":"moonstones","date":"2015-11-16T21:43:29.375+0000","up_votes":1,"down_votes":0,"body":"Hmm. That's kind of odd. I know we're still in the process of getting rewards handed out. If it doesn't swap to the proper border, I'd shoot a ticket over to [Player Support](https://support.riotgames.com/hc/en-us/requests/new?ticket_form_id=4584) so we can take a look at your account and make the proper adjustments!","replies":[{"poster":"MetalClaw6000","date":"2015-11-16T21:45:36.244+0000","up_votes":2,"down_votes":0,"body":"Thank you very much","replies":[]}]}]}]},{"poster":"KayleeT","date":"2015-11-15T23:07:30.449+0000","up_votes":1,"down_votes":1,"body":".. what border are you talking about","replies":[{"poster":"MetalClaw6000","date":"2015-11-15T23:58:07.599+0000","up_votes":2,"down_votes":0,"body":"The loading screen borders they changed them this season to have extra flare.","replies":[]}]}]}