{"poster":"Pinke","date":"2018-11-10T07:31:57.044+0000","title":"No hagan mas misiones en equipo...","subforum":"Comportamiento del jugador","up_votes":21,"down_votes":2,"body":"Yo juro que cada vez que intento completar una misi&oacute;n de estas de hacer algo en equipo me agarra un acv cada vez que un graciosito trollea eso porque &quot;es muy divertido ajajajxd&quot;. Riot incentiva a esta comunidad a odiarse mas entre si, ya es demasiado con que se armen lo que quieran, que juegen mal a proposito, los afks, que no se pueda jugar normal porque esta plagado de trolls y afks, y nos meten misiones que no vamos a poder completar por alguien que le gusta romper las pelotas??\n\nYo casi estallo con odisea con el tema de los aumentos, y ahora cada tanto nos van a meter otra mision jodidamente imposible por una comunidad llena de gente de m*rda que se hacen los graciosos _&quot;ups, me olvide de sacarme el aumento&quot;, &quot;Thresh cuenta como mujer?&quot;\n&quot;Pero yasuo no tiene nepe xddd&quot;, &quot;Pero zed tampoco tiene %%%%% xddddd&quot;_\n\nY yo queriendo partirle el cuello al super genio que molesta **Porque quiere y porque puede**\n\nedit: Ahora otro \"personaje\" se le bugeo y pickeo Thresh :c","replies":[{"poster":"ÏnƒêçtĘÐMµšhrØºm","date":"2018-11-10T07:48:50.793+0000","up_votes":5,"down_votes":0,"body":"Pues esas misiones están hechas para hacerlas con amigos, pero con amigos que de verdad conozcas, no amigos random que salen la partidas o esas personas que ni siquiera colaboran y diciendo todo lo anteriormente mencionado en tu post.\nSaludos!","replies":[{"poster":"Pinke","date":"2018-11-10T08:27:59.123+0000","up_votes":3,"down_votes":2,"body":"Casi todos mis amigos dejaron el lol, porque se convirtió en una basura, y yo como todavía no encuentro un reemplazo no lo dejo, pero ya me cansó, desde sacar cosas asquerosas como irelia akali zoe, hasta hacer mierda el juego LITERALMENTE, por ejemplo, desde hace unos 2 parches que tengo que esperar 1 minuto aprox para ver mi artesanía hextech","replies":[{"poster":"CamaleonaBugeada","date":"2018-11-10T11:00:37.448+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Pinke,realm=LAS,application-id=PJAKt7ph,discussion-id=zostt6kt,comment-id=00000000,timestamp=2018-11-10T08:27:59.123+0000)\n>\n> Casi todos mis amigos dejaron el lol, porque se convirtió en una basura, y yo como todavía no encuentro un reemplazo no lo dejo, pero ya me cansó, desde sacar cosas asquerosas como irelia akali zoe, hasta hacer mierda el juego LITERALMENTE, por ejemplo, desde hace unos 2 parches que tengo que esperar 1 minuto aprox para ver mi artesanía hextech\n\nA mi me pasa lo mismo, en mi grupo pasamos de tener que jugar customs para no dejar a nadie afuera, a que con suerte vamos premade de 3 :/","replies":[]},{"poster":"Nuke","date":"2018-11-10T11:44:16.123+0000","up_votes":4,"down_votes":3,"body":"1- Busca la definición de \"literal\".\n2- Mi consejo es que juegues a juegos cooperativos y no competitivos. Porque cuando vos la pasás bien, el otro la pasa mal. Y cuando el otro la pasa bien, vos la pasás mal. Y si sos como yo y te da igual perder, la diversión no es que dure mucho para todo lo que consume.\n3- Cuando no te abre la artesanía a los 5 segundos, poné la tienda y volvé a poner la artesanía. No hace falta que cargue la tienda, solo seleccionala 1 segundo y volvé a la artesanía.\n3- Destiny 2 está gratis hasta el 18/11, pero si tu PC no puede ni abrir rápido la artesanía Hextech dudo que lo corra xD...\nhttps://www.youtube.com/watch?v=SOegYa1Be2U\n5- No se contar :c","replies":[{"poster":"Pinke","date":"2018-11-10T20:05:02.073+0000","up_votes":1,"down_votes":0,"body":"8- Juego al GTA V en esta pc, definitivamente es culpa de riot.\n31- Ya lo tenia de antes, pero no me gustó","replies":[{"poster":"AdcInANutshell","date":"2018-11-10T21:57:36.820+0000","up_votes":1,"down_votes":0,"body":"el gta v me corre hasta en mi netbook del gobierno","replies":[{"poster":"Pinke","date":"2018-11-10T22:16:39.621+0000","up_votes":1,"down_votes":0,"body":"Hablo de que me lo corra fluido con gráficos y resolución decentes :/","replies":[]}]}]}]}]}]},{"poster":"diabetín","date":"2018-11-10T08:05:33.492+0000","up_votes":4,"down_votes":0,"body":"las prefiero a las de \"gana con x champ en tu equipo\" y ves que lo compran para la misión y bueno, el champ está en el equipo, pero la victoria no \n:´v","replies":[]},{"poster":"Nuke","date":"2018-11-10T11:40:08.929+0000","up_votes":5,"down_votes":1,"body":"> Riot incentiva a esta comunidad a odiarse mas entre si\n\nUHHHHHHHHHH\nComo me pone nervioso gente que trata a Riot como si fuera el gobierno. ME PARECE PERFECTO que quieras quejarte de la conducta de la comunidad, PERO CULPA A LA COMUNIDAD ._.","replies":[{"poster":"HarpaX","date":"2018-11-10T19:20:12.044+0000","up_votes":1,"down_votes":0,"body":">ME PARECE PERFECTO que quieras quejarte de la conducta de la comunidad, **PERO CULPA A LA COMUNIDAD\n**\n^ Eso mismo.","replies":[]}]},{"poster":"TheKiller Justin","date":"2018-11-10T14:03:27.542+0000","up_votes":3,"down_votes":0,"body":"No podés obligar a alguien a seguir con eso de la misión.\nSi no tenés la posibilidad de jugar con 4 premades, tenés la opción de \"Gana 3 partidas en menos de 36 minutos\" (Creo que era así).","replies":[]},{"poster":"zMiSTiK","date":"2018-11-10T17:51:51.600+0000","up_votes":2,"down_votes":0,"body":"Cada uno juega con lo quiere. Pero si, esas misiones son una cagada.","replies":[]},{"poster":"POETA DEL TRUENO","date":"2018-11-10T16:33:14.141+0000","up_votes":2,"down_votes":0,"body":"Yo complete todas  sin premades y sin pedirle nada a nadie xd.\n\nSi Jugás normales, jugá para divertirte sin más... \n\nSino no, no tenes ni idea de lo que es JUGAR!","replies":[{"poster":"POETA DEL TRUENO","date":"2018-11-10T16:33:38.968+0000","up_votes":2,"down_votes":0,"body":"Xd","replies":[]}]},{"poster":"lordeman10","date":"2018-11-10T21:36:16.979+0000","up_votes":1,"down_votes":0,"body":"pero tenés una opción de no hacerla en equipo, es como si alguien ya hubiera previsto lo que planteas y lo estés pasando por arriba\n\nluego lol es un juego en equipo.. es entendible que en la variedad esté bien que pongan cosas single pero tampoco para negar absolutamente toda posibilidad de que se haga algo en equipo, para eso te instalás un single player y todos felices, acá la idea es que además de jugar te hables con otros jugadores y formes una estrategia para ganar.. y no digo que tengas que hacerlo en los 2 minutos que tarda en arrancar la partida tenés un sistema de clubes, lista de amigos, un foro, comunidades es parte de la experiencia del evento que busques compañeros con el mismo objetivo","replies":[{"poster":"Pinke","date":"2018-11-10T22:18:00.049+0000","up_votes":1,"down_votes":0,"body":"Jugaste odisea?","replies":[{"poster":"lordeman10","date":"2018-11-10T22:48:06.827+0000","up_votes":1,"down_votes":0,"body":"si hasta la mision de 2 aumentos gane con sangres y sudor jajaj","replies":[]}]}]},{"poster":"HarpaX","date":"2018-11-10T19:16:50.519+0000","up_votes":1,"down_votes":0,"body":">\"Pero yasuo no tiene nepe xddd\", \"Pero zed tampoco tiene nepe xddddd\"\n\njsdkfbvsfsldfa\n{{sticker:sg-miss-fortune}} \nQue buena logica xD\n\nAhora en serio, es verdad que hacer esas misiones es un dolor de huevos, amenos que tengas 4 amigos y hagan la mision los 5 juntos, pero por diversas razones muchas veces no se puede.\n\nRiot hace esas misiones para incitar a la comunidad a trabajar en equipo y llevarse mejor, pero como la comunidad esta llena de basura terminan causando el efecto contrario.\n{{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"Lygnus dwarf","date":"2018-11-10T16:20:50.102+0000","up_votes":1,"down_votes":0,"body":"mmm","replies":[]},{"poster":"Nabuze","date":"2018-11-10T16:13:59.879+0000","up_votes":1,"down_votes":0,"body":"Las misiones no son obligatorias y la mayoría se pueden hacer solo.\nMetieron una sola para hacer con amigos   durante el Worlds","replies":[]},{"poster":"LyghtSh","date":"2018-11-10T15:32:26.510+0000","up_votes":1,"down_votes":0,"body":"Yo creo un testo super educado, copio y pego apenas entro a partida, y si la gente se copa y es buena, bien, sino, dodgeo o juego la partida xD","replies":[]},{"poster":"Ąvÿ","date":"2018-11-10T15:03:24.273+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-ahri-3}}","replies":[]},{"poster":"cristiann2018","date":"2018-11-10T11:48:59.195+0000","up_votes":1,"down_votes":0,"body":"agregen para club de amigo  cristiann2018 soy nuevo me dijieron que puedo sacarme  S o caja en partida con amigo deun club","replies":[]}]}