{"poster":"Ryura","date":"2015-04-04T03:01:27.207+0000","title":"Castigos algo injustos","subforum":"Comportamiento del jugador","up_votes":0,"down_votes":5,"body":"Estoy seguro que no soy el unico al que le ha pasado...vas entrando a una partida con las mas grandes espectativas y derrepente te sale alguien que quierre trolear{{summoner:1}} {{summoner:13}} por que perdio linea, le gano un autolock, se equivoco de cola etc., y claro uno juega con la intencion de ganar y en casos no escojemos campeon para que la partida no inicie y luego cuando queremos entrar a otras partidas y nos dan un castigo de 6 min, osea igual esta bien desde el punto de vista de q talves el que trolea es el que no escoje, pero es injusto en contraste de que las personas que se van afk{{champion:17}}  trolean o insultan y a pesar de los report que les damos al final de la partida, no se les da ningun castigo. Hablo por muchos cuando digo que es aburrido y te arruina la partida cada vez que un flamer aparece o un afk, pero mas rabia da cuando se sabe que no resivira castigo, y yo por evitar un troleo me castigas 6 min, yo en mi opinion digo que si tanto quieren un juego libre de esta gente toxica los castigos deberian ser mas severos. Todo esto lo se porque ise unas pruebas en una smurf antes de venir a escribir esto. Pero en realidad quiero saber el porque y si esque estan de acuerdo conmigo.","replies":[{"poster":"Demiurgius","date":"2015-04-04T04:52:37.149+0000","up_votes":4,"down_votes":0,"body":"\"CEVEROS\"... en serio? a la escuela!","replies":[]},{"poster":"Demiurgius","date":"2015-04-21T04:13:35.135+0000","up_votes":1,"down_votes":0,"body":"\"Severos (con s)\" \"de (espacio) repente\" \"o (espacio) sea\" \"tal (espacio) veZ (zeta)\" \"reCiBira (con c y b)\" \"HiCe (hache y c)\" \"es (espacio) que\"\n\nEs que me la dejaste MUY fácil.","replies":[]},{"poster":"MasterRightClick","date":"2015-04-04T15:25:44.960+0000","up_votes":1,"down_votes":0,"body":"Hijo agarra un libro alguna vez en tu vida","replies":[{"poster":"Ryura","date":"2015-04-11T01:57:04.726+0000","up_votes":1,"down_votes":0,"body":"...disculpa...me equivoque en una letra en todo el texto....disculpe...lamento haberlo ofendido","replies":[]}]},{"poster":"ChatranElGato","date":"2015-04-08T21:00:26.085+0000","up_votes":1,"down_votes":0,"body":"JUGANDO UNA PARTIDA DONDE UN TROLL REVIVE Y SE DEJA MORIR COUNTINUAMENTE, UN DUO QUE NO QUIERE SURRENDEAR Y UN AFK.\nYO TENGO COSAS MAS IMPORTANTES QUE PERDER EL TIEMPO SI NO SE PUEDE JUGAR UNA PARTIDA ASI.\nME VOY AFK.\nSAQUENME LA BAJA PRIORIDAD RIOT ESPERO SUS RESPUESTAS.\n\nY SU SISTEMA DE LEAVEBUSTER NO SIRVE LES PARECE QUE ME PONGAN EN COLA DE BAJA PRIORIDAD POR ESTAS PARTIDAS? SI NO ME SACAN DE LA COLA DE BAJA PRIORIDAD ME RETIRO DE SU SERVER","replies":[]},{"poster":"Ryura","date":"2015-04-05T19:24:42.914+0000","up_votes":1,"down_votes":0,"body":"Me equivoco en una letra y se creen superdotados corrigiendome...si fuera un inculto el texto entero estaria lleno de faltas.","replies":[]},{"poster":"Aphelion","date":"2015-04-04T19:57:00.841+0000","up_votes":1,"down_votes":0,"body":"Los castigos deben ser más cerveceros, estoy totalmente de acuerdo.","replies":[]}]}