{"poster":"MasterOfTheOrder","date":"2018-08-31T07:15:22.571+0000","title":"Punishments, fairness, and why I'm uninstalling league after years. Constructive critisism included.","subforum":"Player Behavior","up_votes":6,"down_votes":13,"body":"This thread is mostly intended for Riot employees to read, and meant to possibly help other players in the future. Both to learn from my experiences, and maybe change how punishments work a little.\r\n\r\nThis will be slightly lengthy, so I&#039;ll just start with a very simplified TL;DR. The punishment system does a terrible job trying to make slightly toxic people to try and be better, and punishes them instead. Now you know what the meat of this thread is. Now, for my personalized experiences, and why I&#039;m finally leaving this game for good. I will start with my playtime, an example of punishments, and end with constructive feedback. It&#039;ll be a bit all over the place, but I just want to cover everything to a certain degree. Also, for the record, I&#039;m not currently banned. I can play if I choose, so I&#039;m not raging over being banned.\r\n\r\nI&#039;ve been playing this game for quite a while. I started sometime after Nami was released, when she was still the login theme. I&#039;ve played quite a few games, probably thousands. Mostly pvp. I&#039;ve was there when blind pick was the only way to play. I was one of the people that only played Team Builder, when it was a thing. I remember all the things that created large infinite salt among players. With that said, I&#039;ve NEVER been the racist, insulting kid. My version of toxicity is pretty much only limited to losing my patience in games that are clear losses. I&#039;ll lose my patience and stop trying, point out why we aren&#039;t going to win, and only when its clear in the kind of games in which the enemy carry is something akin to 21/3, and our carry is 0/10. At 15 minutes.\r\n\r\nThese are the games that make me stop having fun fairly early. I will, of course, try to surrender as early as possible to move on and try again in a different game. However, and everyone has experienced this, there are plenty of games that involve duo&#039;s and more. In those games, those duos that essentially feed and just wont stop, also refuse to surrender.\r\n\r\nThis, my fellow gamers, and Riot, is the crux of my post. At this point, in these games, I become what you could call very low level toxic. I will ask why they don&#039;t surrender. I will ask that they do in the future, unless they can suddenly become relevant and give us a fighting chance (this basically NEVER happens). I will become increasingly salty. Throughout all of this, I won&#039;t call them swear words. I won&#039;t use vulgar language. I will be salty, and have a clear negative attitude, but the reason is obvious. \r\n\r\nI&#039;m stuck in an unfun game, against my will. If I quit, I will 100% be punished for it. I&#039;m being held hostage for up to half an hour by people that both make sure we can&#039;t win, and make sure I have to keep playing.\r\n\r\nThis is awful. MOBAS are subject to this very specific experience, and League of Legends is the only game that employs a punishment system that will punish me for my non vulgar, non harassing, salt. I am deemed the problem of these games.\r\n\r\nNow at this point, some of you will probably say &quot;well then just stay quiet in chat&quot;. You know what? You&#039;re probably right. I cannot get punished if I just sit there and suffer of frustration and boredom silently, like an obedient child. I can take my beating silently, without resisting. Sometimes I do. But I&#039;m not a flawless person, and sometimes I simply state that we are going to lose and should move on with our lives. I get harshly punished for this. I never start the cycle of games that become unfun, and toxic. But I, as a human being, have great difficulty staying silent while just taking a beating. I cannot be the only one like this.\r\n\r\nAs I said before, I&#039;ve played a LOT of games. Honestly, these situations are but a small percentage of my total games played. However, as far as the punishment system goes, that does not matter. The VAST majority of my games, I get honored for beeing a good teammate, and great shotcalling. When my honor isn&#039;t throttled, I will constantly get that notification saying &quot;you get x% more honors than the average player, keep it up!&quot;, but again the punishment system does not care. I am mostly a supportive player, who tries to win, have fun, and play as a team and try to do some silly combos. but that one game in an average of 50, that one instance of non vulgar rage, and I&#039;m suddenly a honorless, toxic, chat restricted player. It does not matter if 99 out of 100 games I&#039;m honorable and forgiving. It&#039;s just the one game that I&#039;m not. And again, in that one game I&#039;m not vulgar or racist. I&#039;m not saying degenerate thing. I&#039;m simply plainly frustrated with wasting my time.\r\n\r\nMy feedback is thus. I think the punishments for non vulgar, non horrific things said in chat should be vastly more forgiving. I think that every single restriction should take the factors of those individual games into consideration. If someone is saying swear words, that&#039;s clearly not okay. Same with racist  stuff, telling someone to kill themselves, and other obvious uncalled for foul things. However, saying your 0/20 jungler that won&#039;t ever help is useless, while probably rude, is also very accurate. Pointing that out, while rude to the jungler, is affecting that player far less that that player is affecting the team. That should matter, but it currently doesn&#039;t.\r\n\r\nFor me to be chat restricted over this is nonsense. Now, I cannot coordinate with my team. I cannot quickly come up with a combo and express it. Why? Because of that game where I pointed out teammate was useless, when they were genuinely less helpful than a ward I placed at the beginning of the game.\r\n\r\nI&#039;m sure some of you will disagree with me. Maybe all of you will. But for me personally, this experience has shown me the ratio of value riot places in my efforts to be a good teammate. Basically, it only matters if I NEVER lose my temper. My one game in 100 honorable games makes me a problem.\r\n\r\nAs a result, I cannot justify putting anymore of my time in League, let alone money. I&#039;ve been here for a while, but I&#039;m a functioning adult. This kind of punishment has it&#039;s place in a boarding school for children, not a free to play online game.\r\n\r\nFor those of you that are staying, have fun. May you never have awful games, and may you never lose your temper. Stay positive, and test negative.","replies":[{"poster":"Jamaree","date":"2018-08-31T07:18:37.310+0000","up_votes":7,"down_votes":2,"body":"They will allow flaming around the time when it proves to do anything positive.","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T08:16:04.333+0000","up_votes":2,"down_votes":0,"body":"It's like you didn't read anything he said lol.","replies":[{"poster":"Jamaree","date":"2018-08-31T08:27:52.138+0000","up_votes":6,"down_votes":1,"body":"I read the post, he feels like words shouldn't be punished, my retort, they won't be when keeping your allies down actually accomplishes anything.","replies":[{"poster":"MasterOfTheOrder","date":"2018-08-31T09:05:29.012+0000","up_votes":1,"down_votes":4,"body":"I feel that non vulgar, non hateful words should not be punished. There are times when no words can possibly make people play worse than they already are, and far more often there are times when it 100% won't change anything regardless of how kind or hateful your words are.\n\nPunishments should be reserved for intolerable language and phrasing, not just the discontent and frustrated general complaining of someone completely powerless to change anything.\n\nDirectly harassing someone isn't good. Calling a bad teammate bad isn't so much harassment, as much as it is truthful. If you keep saying it over and over then yeah that's not acceptable, but you should be able to say it once without being punished for it as long as you use non vulgar language.","replies":[{"poster":"Jamaree","date":"2018-08-31T09:12:52.907+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=MasterOfTheOrder,realm=NA,application-id=ZGEFLEUQ,discussion-id=ABcpaVgm,comment-id=0000000000000000,timestamp=2018-08-31T09:05:29.012+0000)\n>\n> I feel that non vulgar, non hateful words should not be punished. There are times when no words can possibly make people play worse than they already are, and far more often there are times when it 100% won&#x27;t change anything regardless of how kind or hateful your words are.\n\nHow will not saying anything make someone player worst as opposed to making them feel miserable...what?\n\n> Punishments should be reserved for intolerable language and phrasing, not just the discontent and frustrated general complaining of someone completely powerless to change anything.\n\nYou can complain all day about how trapped you feel, but the moment you start pointing it at allies and doing everything in your power to make the entire experience worst for everyone, people aren't going to want to play with you.\n\n> Directly harassing someone isn&#x27;t good. Calling a bad teammate bad isn&#x27;t so much harassment, as much as it is truthful.\n\nThat is...literally still harassment. That is the legal definition of harassment: Harassment Law and Legal Definition. Harassment is governed by state laws, which vary by state, but is generally defined as a course of conduct which annoys, threatens, intimidates, alarms, or puts a person in fear of their safety.\n\n>If you keep saying it over and over then yeah that&#x27;s not acceptable, but you should be able to say it once without being punished for it as long as you use non vulgar language.\n\nI very much doubt you said it once, you could post your chat logs and prove it though.","replies":[{"poster":"MasterOfTheOrder","date":"2018-08-31T09:50:51.703+0000","up_votes":2,"down_votes":2,"body":"I personally heavily dislike people that attempt to attack a person instead of the point said person is making, so I'll only respond to you directly this one time. After all, it looks like this post is dead anyway.\n\nIn order of your four replies.\n\n1. When all you're doing is feeding and not contributing to the team, you cannot be less useful to your team. AKA you cannot play worse. Maybe you could miss a skill, but you're talking about a minute difference of damage output in a game that in order to win you must multiply your teams current effectiveness. Staying the same results in failure.\n\n2. I addressed this, but you seem to have missed it. If you're \"doing everything in your power to make the entire experience worse for everyone\" is not acceptable, and In have said as much. I'm defending making one, maybe two non vulgar comments. Not constantly talking about it, which is the same as harassment. Harassment, as I've said, multiple times, is not ok. Considering everything that I've said is in front of you via text, maybe don't literally change my words to try and make me an awful person.\n\n3. That is the legal definition, yes. Since you want to use the law, I'll reply with a similar comparison. You aren't breaking any law for publicly saying a sports player is bad after they play terribly. Why? Because the \"annoy\" section requires intentional persistence. Otherwise you'd be a criminal for chewing loudly and \"annoying\" those that are angered by the sound of chewing. Persistence is my key point. If you're not being persistent, it's not harassment.\n\n4. I didn't save the chat logs, but I believe I said it twice, in different words. \"Meanwhile (feeding champ here) is farming minions, why did I hope he'd be useful\" and something like \"oi just team up since you clearly can't fight anyone 1v1\". Maybe not my exact phrases, but if I'm off it's by like a word. I'm pretty confident in the accuracy. Anyway,not that it really matters. I'm not trying to get my chat restriction overturned, that's an impossible battle to even try to fight. What I'm trying to do is maaybe make Riot aware that this kind of punishment system makes people like me more toxic, instead of less. Why spend any extra effort in being nice, when all it takes is one non vulgar game of slight rage to get chat restricted for hours of gameplay? I'm indirectly being told to just not be nice, since eventually I'll get banned again regardless. Maybe even permabanned, since the length between offenses seems to be completely irrelevant.\n\nThere you go. Other than the person or people playing terribly, I don't believe my words have ever affected anyone else. And on the flip side, however my words did affect them, it certainly wasn't comparable to how their gameplay affected me. I'm not rallying behind banning bad players, but I'm just saying in a game like this that you can't leave, you should be given a degree of verbal leniency. Limit the restrictions to vulgarity.","replies":[{"poster":"Jamaree","date":"2018-08-31T10:10:21.655+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=MasterOfTheOrder,realm=NA,application-id=ZGEFLEUQ,discussion-id=ABcpaVgm,comment-id=000000000000000000000000,timestamp=2018-08-31T09:50:51.703+0000)\n>\n> I personally heavily dislike people that attempt to attack a person instead of the point said person is making, so I&#x27;ll only respond to you directly this one time. After all, it looks like this post is dead anyway.\n> \n> In order of your four replies.\n> \n> 1. When all you&#x27;re doing is feeding and not contributing to the team, you cannot be less useful to your team. AKA you cannot play worse. Maybe you could miss a skill, but you&#x27;re talking about a minute difference of damage output in a game that in order to win you must multiply your teams current effectiveness. Staying the same results in failure.\n\nAs opposed to keeping them hopeful for a chance they do something useful, like group, or meatshield, or split push?\n\n> 2. I addressed this, but you seem to have missed it. If you&#x27;re &quot;doing everything in your power to make the entire experience worse for everyone&quot; is not acceptable, and In have said as much. I&#x27;m defending making one, maybe two non vulgar comments. Not constantly talking about it, which is the same as harassment. Harassment, as I&#x27;ve said, multiple times, is not ok. Considering everything that I&#x27;ve said is in front of you via text, maybe don&#x27;t literally change my words to try and make me an awful person.\n\nThat still is harassment, never once said you were a bad person, but whether it is once or multiple times, you are harassing them hoping to make them feel even worst then they already are. I don't like people feeding or doing poorly as the next person, but making them feel worst isn't helping anything.\n\n> 3. That is the legal definition, yes. Since you want to use the law, I&#x27;ll reply with a similar comparison. You aren&#x27;t breaking any law for publicly saying a sports player is bad after they play terribly. Why? Because the &quot;annoy&quot; section requires intentional persistence. Otherwise you&#x27;d be a criminal for chewing loudly and &quot;annoying&quot; those that are angered by the sound of chewing. Persistence is my key point. If you&#x27;re not being persistent, it&#x27;s not harassment.\n\nIt actually still is.\n\n> 4. I didn&#x27;t save the chat logs, but I believe I said it twice, in different words. &quot;Meanwhile (feeding champ here) is farming minions, why did I hope he&#x27;d be useful&quot; and something like &quot;oi just team up since you clearly can&#x27;t fight anyone 1v1&quot;. Maybe not my exact phrases, but if I&#x27;m off it&#x27;s by like a word. I&#x27;m pretty confident in the accuracy. Anyway,not that it really matters. I&#x27;m not trying to get my chat restriction overturned, that&#x27;s an impossible battle to even try to fight. What I&#x27;m trying to do is maaybe make Riot aware that this kind of punishment system makes people like me more toxic, instead of less. Why spend any extra effort in being nice, when all it takes is one non vulgar game of slight rage to get chat restricted for hours of gameplay? I&#x27;m indirectly being told to just not be nice, since eventually I&#x27;ll get banned again regardless. Maybe even permabanned, since the length between offenses seems to be completely irrelevant.\n\nYour chat logs are in your email, you can post them still, just go get them from your email and post them here, uneditted. You don't even have to be nice, if you don't have anything to say that will help anyone, why not just not say anything at all?\n\n> There you go. Other than the person or people playing terribly, I don&#x27;t believe my words have ever affected anyone else. And on the flip side, however my words did affect them, it certainly wasn&#x27;t comparable to how their gameplay affected me. I&#x27;m not rallying behind banning bad players, but I&#x27;m just saying in a game like this that you can&#x27;t leave, you should be given a degree of verbal leniency. Limit the restrictions to vulgarity.\n\nAnd I repeat again, when it accomplishes ANYTHING positive for you or your team, they will allow it.","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T13:25:35.407+0000","up_votes":1,"down_votes":2,"body":"Your definition of harassment is simply wrong.  There's no other way to put it, you are redefining the words to try and support your argument.  Harassment requires either repetitive behavior or intense aggression.\n\nWhy is it a reasonable expectation to expect players to remain completely positive in any and all chat interactions, and be nothing but butt-cheek-spreading levels of polite even to assholes, but unreasonable to expect players who are easily offended or who become offended to use features like chat mute or disabling all chat?  That's neither logical nor rational.","replies":[{"poster":"Jamaree","date":"2018-08-31T13:28:53.162+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Vanilla Trubbs,realm=NA,application-id=ZGEFLEUQ,discussion-id=ABcpaVgm,comment-id=00000000000000000000000000000000,timestamp=2018-08-31T13:25:35.407+0000)\n>\n> Your definition of harassment is simply wrong.  There&#x27;s no other way to put it, you are redefining the words to try and support your argument.  Harassment requires either repetitive behavior or intense aggression.\n\nDoesn't matter if it is repetitive or not, it is still harassment.\n\n> Why is it a reasonable expectation to expect players to remain completely positive in any and all chat interactions, and be nothing but butt-cheek-spreading levels of polite even to assholes, but unreasonable to expect players who are easily offended or who become offended to use features like chat mute or disabling all chat?  That&#x27;s neither logical nor rational.\n\nNo one is saying to be positive, or to kiss their ass, if they are actually feeding, report them, but retaliating literally does nothing for you or your team. Most people who do poorly know it and don't need people jumping on them to make them feel worst about. You don't have to say they are bad, they already know, and telling them such does nothing.","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T13:39:26.836+0000","up_votes":1,"down_votes":3,"body":"Now you are just repeating yourself as if that somehow makes you correct re: what constitutes harassment.  We can't agree on a definition - mine is the dictionary's.  I went ahead and looked up the legal definition and I got this: \"Harassment is governed by state laws, which vary by state, but is generally defined as a course of conduct which annoys, threatens, intimidates, alarms, or puts a person in fear of their safety.\"\n\n'Course of conduct' is defined as \"a pattern of conduct composed of 2 or more acts, evidencing a continuity of purpose.”\n\nFeel free to link me to this legal definition of yours, all my definition searches are not showing what you are claiming.  Your move.\n\n\"but retaliating literally does nothing for you or your team.\"\n\nThat's simply not true.  Expressing emotion is far healthier than bottling it up inside.  Being able to vent is important.  People who are doing bad can also say things like \"well guys I'm sorry I'm really shitting the bed here\" or something along those lines, it helps ease tension and release frustration.\n\nAs far as kissing ass or being positive, Riot has told me as much in my numerous tickets with customer service representatives.  They repeatedly say that if you don't have anything positive to say, don't say anything at all.  What a wonderful environment that fosters.  I definitely want to subject my leisure activities to the same strict language policies that I might have in the workplace.  It really helps me relax and get more enjoyment out of my game time knowing that I could be permanently banned for saying the wrong thing.","replies":[{"poster":"Jamaree","date":"2018-08-31T13:44:45.377+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Vanilla Trubbs,realm=NA,application-id=ZGEFLEUQ,discussion-id=ABcpaVgm,comment-id=0000000000000000000000000000000000000000,timestamp=2018-08-31T13:39:26.836+0000)\n>\n> Now you are just repeating yourself as if that somehow makes you correct re: what constitutes harassment.  We can&#x27;t agree on a definition - mine is the dictionary&#x27;s.  I went ahead and looked up the legal definition and I got this: &quot;Harassment is governed by state laws, which vary by state, but is generally defined as a course of conduct which annoys, threatens, intimidates, alarms, or puts a person in fear of their safety.&quot;\n> \n> &#x27;Course of conduct&#x27; is defined as &quot;a pattern of conduct composed of 2 or more acts, evidencing a continuity of purpose.”\n> \n> Feel free to link me to this legal definition of yours, all my definition searches are not showing what you are claiming.  Your move.\n\nIf you are speaking in a sense of it isn't harassment unless you are doing it repeatedly, then, I guess you are right, I'm looking at it at a case of anything once or not that is meant to demoralize and/or sabotage your team and your allies to play worst.\n \n> &quot;but retaliating literally does nothing for you or your team.&quot;\n> \n> That&#x27;s simply not true.  Expressing emotion is far healthier than bottling it up inside.  Being able to vent is important.  People who are doing bad can also say things like &quot;well guys I&#x27;m sorry I&#x27;m really shitting the bed here&quot; or something along those lines, it helps ease tension and release frustration.\n\nPeople tend not to get the chance, or still get flamed anyway. That said, then go express and let it out, go punch a pillow, go work out, go do something productive then, stop playing league.\n\n> As far as kissing ass or being positive, Riot has told me as much in my numerous tickets with customer service representatives.  They repeatedly say that if you don&#x27;t have anything positive to say, don&#x27;t say anything at all.  What a wonderful environment that fosters.  I definitely want to subject my leisure activities to the same strict language policies that I might have in the workplace.  It really helps me relax and get more enjoyment out of my game time knowing that I could be permanently banned for saying the wrong thing.\n\n*shrug*","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T14:23:55.568+0000","up_votes":1,"down_votes":0,"body":"Well I'll give you credit where it's due; you are the first person I've argued with who doesn't downvote every one of my responses.","replies":[{"poster":"Jamaree","date":"2018-08-31T14:26:14.872+0000","up_votes":1,"down_votes":0,"body":"Gonna be honest, I very rarely downvote anyone. These forums are for discussion and the upvote and downvote system is more just a case of who agrees with the current circlejerk when this place SHOULD be about discussion.","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T15:05:36.899+0000","up_votes":1,"down_votes":0,"body":"YES!  We agree about something!  Let's just call it here lol.","replies":[]}]}]}]}]}]}]}]},{"poster":"Kei143","date":"2018-08-31T12:41:18.385+0000","up_votes":2,"down_votes":0,"body":"Did you know, you can get past chatlogs from player support?\n\nhttps://support.riotgames.com","replies":[]}]},{"poster":"Vanilla Trubbs","date":"2018-08-31T09:56:28.453+0000","up_votes":2,"down_votes":4,"body":"Ok, I guess you read it and just didn't understand it.\n\n\"How will not saying anything make someone player worst as opposed to making them feel miserable...what?\"\n\nOk, bear with me here - sometimes, your input has no effect on the outcome.  I.E. someone is having a bad game - someone calls them an asshole - there is no perceivable difference in their gameplay because they are already playing so bad.  Or another example - someone is having a bad game - their teammate says \"hey man, it's ok, we got this, don't worry, just do your best =)\" - the guy continues to play poorly because he is having a bad game.  The argument that people are in control of their language also extends to the fact that people are in control of how they react to said language.  No one can make you angry - only you can allow other people to make you angry.\n\n\"You can complain all day about how trapped you feel, but the moment you start pointing it at allies and doing everything in your power to make the entire experience worst for everyone, people aren't going to want to play with you.\"\n\nAnger is a normal and healthy response to this stimulus.  You are basically saying here that you think complaining should be bannable because it would make people not want to play with them?\n\n\"That is...literally still harassment. That is the legal definition of harassment: Harassment Law and Legal Definition. Harassment is governed by state laws, which vary by state, but is generally defined as a course of conduct which annoys, threatens, intimidates, alarms, or puts a person in fear of their safety.\"\n\nNope.  A quick google search returns the ENGLISH definition of harassment as \"aggressive pressure or intimidation.\"  So one can absolutely call a teammate bad without harassing them if one is not aggressive or repetitive in one's denouncements.\n\n\"I very much doubt you said it once, you could post your chat logs and prove it though.\"\n\nBad faith assumptions aren't a good way to conduct conversations.  This is a really negative way of saying you agree.","replies":[{"poster":"mlm olo mlm","date":"2018-08-31T17:37:36.425+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Vanilla Trubbs,realm=NA,application-id=ZGEFLEUQ,discussion-id=ABcpaVgm,comment-id=000000000000000000000001,timestamp=2018-08-31T09:56:28.453+0000)\n> Anger is a normal and healthy response to this stimulus.  You are basically saying here that you think complaining should be bannable because it would make people not want to play with them?\n\nDid you know: \"Complaining\" is actually a punishable offence. Since chat offences escalate in punishment, \"complaining\" may result in a permanently banned account. \n\nAny negative chat is considered punishable behavior.","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T22:39:56.967+0000","up_votes":1,"down_votes":0,"body":"Does it seem reasonable to you for a company to ban paying customers simply for expressing discontent in a game that can be extremely frustrating at times?  Do you honestly believe this is a good policy?","replies":[{"poster":"Subdue","date":"2018-08-31T23:05:41.864+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Vanilla Trubbs,realm=NA,application-id=ZGEFLEUQ,discussion-id=ABcpaVgm,comment-id=00000000000000000000000100010000,timestamp=2018-08-31T22:39:56.967+0000)\n>\n> Does it seem reasonable to you for a company to ban paying customers simply for expressing discontent in a game that can be extremely frustrating at times?  Do you honestly believe this is a good policy?\n\nLet's clarify.\n\n1. Flaming: This Yasuo is such a feeder.  Screw you Yasuo, uninstall noob.\n\n2. Expressing Discontent: I am so frustrated at this game right now.\n\n3. Expressing Discontent Without Your Keyboard: *Screaming at screen* \"GOD DAMNIT! FUCK THIS YASUO!\"\n\nNumber 1 will get you penalized.  Number 2 will not.  And number 3 is better for team morale than both of the other options.","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T23:13:47.521+0000","up_votes":1,"down_votes":1,"body":"Number 3 is great because that way everyone you live with gets to soak up the \"toxicity\" instead of the other players!\n\nI simply don't believe #1 example warrants a ban.  I think only chat restrictions are appropriate for that.  You honestly believe accounts should be **permanently banned** for the example you provided?  Really?","replies":[{"poster":"Subdue","date":"2018-09-01T00:28:56.234+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Vanilla Trubbs,realm=NA,application-id=ZGEFLEUQ,discussion-id=ABcpaVgm,comment-id=0000000000000000000000010001000000000000,timestamp=2018-08-31T23:13:47.521+0000)\n>\n> Number 3 is great because that way everyone you live with gets to soak up the &quot;toxicity&quot; instead of the other players!\n> \n> I simply don&#x27;t believe #1 example warrants a ban.  I think only chat restrictions are appropriate for that.  You honestly believe accounts should be **permanently banned** for the example you provided?  Really?\n\nUh, well obviously if you are living with people that's a different consideration.  Scream into a pillow?  I mean, do I really need to explain that people have to consider more than League of Legends when making their decisions?  The point wasn't to say that screaming at the screen was the **ONLY** other option, it was to give an example of an option.  Squeeze a stress ball, bite a donut.  Release your frustration _outside of the game._\n\nAs for whether #1 deserves a permanent ban by itself, no.  That would be ridiculous.  And if that's what was going on here, then I'd be up in arms with you.  But that isn't what's happening.  You get banned for _consistently_ harassing other players, #1 being a solitary example of that.  And even then, you are not instantly banned, you are warned three times over that your behavior is not acceptable and told the consequences of not reforming.\n\nSo, do I think accounts should be permanently banned for exhibiting a pattern of verbal harassment and abuse towards fellow players and a demonstrated unwillingness to reform, despite multiple warnings that clearly lay out the repercussions of not reforming?  **Absolutely I do.**","replies":[{"poster":"Vanilla Trubbs","date":"2018-09-01T00:33:42.415+0000","up_votes":1,"down_votes":1,"body":"Releasing frustration outside the game means getting Leaver Buster'd.  That is itself one of the biggest causes of toxicity - people become trapped in games.  This is often the cause of people raging about failed FF votes - certainly it has been 100% of the time I've raged about people not surrendering.\n\nAs far as #1 bans - if you do #1 enough, you will be perma'd.  Even if you are doing it to different people and never truly harass anyone.  You will eventually be perma'd for it.\n\n\"So, do I think accounts should be permanently banned for exhibiting a pattern of verbal harassment and abuse towards fellow players and a demonstrated unwillingness to reform, despite multiple warnings that clearly lay out the repercussions of not reforming? Absolutely I do.\"\n\nSee the problem there is that the definitions of those words, harassment and abuse, are being continuously shifted to include ever milder behaviors.  And this is going to result not only in the playerbase shrinking but also in making the new player experience far worse.  See my new post \"Wondering why low-level games are so full of...\"","replies":[{"poster":"Subdue","date":"2018-09-01T00:55:11.856+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Vanilla Trubbs,realm=NA,application-id=ZGEFLEUQ,discussion-id=ABcpaVgm,comment-id=000000000000000000000001000100000000000000000000,timestamp=2018-09-01T00:33:42.415+0000)\n>\n> Releasing frustration outside the game means getting Leaver Buster&#x27;d.  That is itself one of the biggest causes of toxicity - people become trapped in games.  This is often the cause of people raging about failed FF votes - certainly it has been 100% of the time I&#x27;ve raged about people not surrendering.\n> \n> As far as #1 bans - if you do #1 enough, you will be perma&#x27;d.  Even if you are doing it to different people and never truly harass anyone.  You will eventually be perma&#x27;d for it.\n> \n> &quot;So, do I think accounts should be permanently banned for exhibiting a pattern of verbal harassment and abuse towards fellow players and a demonstrated unwillingness to reform, despite multiple warnings that clearly lay out the repercussions of not reforming? Absolutely I do.&quot;\n> \n> See the problem there is that the definitions of those words, harassment and abuse, are being continuously shifted to include ever milder behaviors.  And this is going to result not only in the playerbase shrinking but also in making the new player experience far worse.  See my new post &quot;Wondering why low-level games are so full of...&quot;\n\nYou are going to such great lengths and making such ridiculous assumptions.  I guarantee you that you will not get leaver bustered for pausing to squeeze a stress ball, or heck even for getting up and doing jumping jacks for 30 seconds to release some tension.  Guaranteed.  If you need much more than that to release frustration that you've acquired _from playing a video game_ I have to wonder if this is really the game for you.  Maybe you need something less stressful.\n\nIf you are harassing people over and over again, whether it's the same person or different people, you absolutely deserve to be penalized.  And if your behavior persists, you absolutely deserve to be permanently banned.\n\nThe people who reach permanent ban in this game is a tiny, TINY fraction of the player base.  And of those, not all return on a smurf.  I know if I lost 10 years worth of effort in this game because I couldn't meet the extremely low attitude threshold of not being an asshole, I would stop playing.  But let's say something obnoxiously like 95% of permanently banned players come back on a smurf, that's still 5% fewer of the most toxic players.\n\nAs for the new player experience, I think Riot is on the right track with having lower acceptable toxicity thresholds for early levels combined with aggressive MMR movements to kick smurfs out of newbie island.  I've watched from behind a new player playing, and most of his games had similarly skilled new players in them.  When veterans complain about the new player experience, they're often complaining about the new _smurf_ experience, because contrary to popular belief, Riot's matchmaking is actually pretty good at identifying smurfs.  Could it be better?  Sure.  Everything can be better.  But is the right approach to let toxic players keep their accounts despite being toxic?  Definitely not.","replies":[{"poster":"Vanilla Trubbs","date":"2018-09-01T01:01:58.814+0000","up_votes":1,"down_votes":0,"body":"The last smurf I made got to 27-9 before it really figured out I was a smurf.  This was about 6 or 7 months ago.\n\nYou and I fundamentally disagree on what behavior warrants a permaban.  But people like me seem to be leaving this game in droves, so I'm sure you will end up with what you want.","replies":[]}]}]}]}]}]},{"poster":"mlm olo mlm","date":"2018-09-02T01:37:34.437+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Vanilla Trubbs,realm=NA,application-id=ZGEFLEUQ,discussion-id=ABcpaVgm,comment-id=00000000000000000000000100010000,timestamp=2018-08-31T22:39:56.967+0000)\n>\n> Does it seem reasonable to you for a company to ban paying customers simply for expressing discontent in a game that can be extremely frustrating at times?  Do you honestly believe this is a good policy?\n\nNot the way I would do it if I was Riot.","replies":[]}]}]},{"poster":"MasterOfTheOrder","date":"2018-08-31T09:59:27.378+0000","up_votes":1,"down_votes":2,"body":"Well my post is getting more rapidly downvoted, so most likely people just won't see it. But it's nice to see that at the very least one person on here doesn't see my opinions as the voice of toxicity incarnate.","replies":[{"poster":"Jamaree","date":"2018-08-31T10:11:36.813+0000","up_votes":1,"down_votes":0,"body":"\"The people who don't agree with me even though it is the majority are wrong, but the one person who does it clearly right.\" :I Ok.","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T13:20:59.325+0000","up_votes":1,"down_votes":1,"body":"Yep, that's exactly what he said.  10/10 reading comprehension.\n\nFor what its worth, if you think the sample of the population offered in this board is indicative of majority opinion, you might want to reconsider that.","replies":[{"poster":"Jamaree","date":"2018-08-31T13:23:51.406+0000","up_votes":1,"down_votes":0,"body":"No what I said is a majority of people coming onto this post clearly don't agree, ie, the majority.","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T13:42:28.071+0000","up_votes":1,"down_votes":1,"body":"\"The people who don't agree with me even though it is the majority are wrong, but the one person who does it clearly right.\"\n\nYou are using an ad populum here, which is a type of logical fallacy whereby you argue that because a larger quantity of people believe something is true or correct, it must be true or correct.\n\nMy initial response was pointing out that a few people on this board are not in any way representative of a meaningful majority.  I don't believe for one moment that the majority of the entire League playerbase would disagree with this post.\n\nN3AC3Y touches on this a bit in this video from season 4.\n\nhttps://www.youtube.com/watch?v=5UfO7qOHx5M\n\nedited for formatting","replies":[{"poster":"Jamaree","date":"2018-08-31T13:47:12.470+0000","up_votes":1,"down_votes":0,"body":"Where is your proof that a majority would agree?","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T14:22:29.031+0000","up_votes":1,"down_votes":0,"body":"I have just as much proof as you do, which is to say absolutely none.","replies":[]}]}]}]}]},{"poster":"Xidphel","date":"2018-08-31T10:51:05.510+0000","up_votes":1,"down_votes":0,"body":"I don't think that's what he meant.","replies":[]}]}]}]},{"poster":"SoundwaveCanada","date":"2018-08-31T23:55:45.405+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Jamaree","date":"2018-09-01T00:13:15.167+0000","up_votes":1,"down_votes":0,"body":"?","replies":[]}]}]}]}]},{"poster":"Xidphel","date":"2018-08-31T10:49:52.978+0000","up_votes":3,"down_votes":0,"body":"\"You disagreed with him on something. That automatically means you didn't read what he said.\"","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T13:23:53.538+0000","up_votes":1,"down_votes":1,"body":"Yep, that's exactly what I said.  Reading comprehension 10/10.","replies":[]}]}]}]},{"poster":"Kei143","date":"2018-08-31T11:30:57.661+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=MasterOfTheOrder,realm=NA,application-id=ZGEFLEUQ,discussion-id=ABcpaVgm,comment-id=,timestamp=2018-08-31T07:15:22.571+0000)\n>\n> My feedback is thus. I think the punishments for non vulgar, non horrific things said in chat should be vastly more forgiving. I think that every single restriction should take the factors of those individual games into consideration.\n\nThat's... how the system currently works my friend.\n\nIt takes lots of games with mild toxicity before you get punished.","replies":[]},{"poster":"Vanilla Trubbs","date":"2018-08-31T08:16:58.551+0000","up_votes":2,"down_votes":7,"body":"That this post is itself getting downvoted speaks volumes about the true toxicity of this community.","replies":[{"poster":"MasterOfTheOrder","date":"2018-08-31T09:06:41.144+0000","up_votes":2,"down_votes":5,"body":"I didn't expect to stay at a upvote/downvote rating of 0, but I suppose it just goes to show how much I don't belong in this gaming community. People won't even see this post.","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T09:48:38.753+0000","up_votes":2,"down_votes":3,"body":"Which is a damn shame because it's well articulated and more than polite.  The way most people just jump down your throat for being toxic is impressive from a psychology standpoint.  People are out looking for a villain.  These people are expressing more or less the same frustration as you are by making you the scapegoat.  It doesn't seem to matter what you say, if Riot has punished you you are a bad person and unworthy of even the smallest amount of empathy.  The lack of self-awareness is stunning.","replies":[{"poster":"usul1202","date":"2018-08-31T14:14:48.471+0000","up_votes":1,"down_votes":0,"body":"Or it's just that, while well written, we get a couple of these threads a week on the boards. The repeated consensus is that the toxicity threshold is fairly reasonable, and that who you're flaming is unimportant. This comes from the tribunal, where a large portion of the player base voted overwhelmingly to punish regardless of context because flaming makes the game less enjoyable.\n\n(also, losses are a great way to improve your mechanics and focus on playing a safe macro, so no need to turn them into a shit storm)","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T14:21:56.827+0000","up_votes":1,"down_votes":1,"body":"I'm pretty sure the entire reason they stopped doing the tribunal was because everyone just voted to punish every time and collect their free IP - as long as your vote was aligned with the majority decision, you got free IP.  The threshold for toxicity has been significantly decreased fairly recently which is probably what generates a lot of these threads.  The slippery slope increasing definition of flaming now encompasses far more than it used to.","replies":[{"poster":"usul1202","date":"2018-08-31T15:40:04.902+0000","up_votes":1,"down_votes":1,"body":"People also voted to not punish all the time, and others actually voted. I personally wasn't playing at the time, so no chance to contribute, but I'm 75% sure that riot claimed they removed both parties from their IFS data. (but not 100%, don't lurk here full time. Would have to scroll for a while through tantrums posts).\n\nAlso, what decrease did they do? I know they upped troll detection and really put the burner on the word retard recently, but I haven't noticed a significant decrease in the toxicity in chat logs.","replies":[{"poster":"Vanilla Trubbs","date":"2018-08-31T22:00:54.109+0000","up_votes":1,"down_votes":0,"body":"I was playing at that time and did participate in the tribunal.  I specifically remember them stating the reason I mentioned above in some video - they used to make a lot of videos informing the playerbase of the reasoning behind changes.  Back in the days when nikasaur was in them.\n\nThey have become FAR more strict about general negativity.  I actually received a chat restriction on an account for typing too many messages - they weren't spam, they weren't negative, they weren't bad, I was just enjoying talking to people.  I can type really fast (~130 wpm) so yeah.  Stupid.","replies":[{"poster":"usul1202","date":"2018-09-01T05:59:17.056+0000","up_votes":2,"down_votes":0,"body":"I've seen that claim (typing too much) a lot, and it always turns out to be something else. I personally am a big typer (tho nowhere near your impressive wpm) and have never been punished.","replies":[{"poster":"Vanilla Trubbs","date":"2018-09-01T19:00:07.085+0000","up_votes":1,"down_votes":0,"body":"Ok, here you go.  I'll dig up my ticket just for you.\n\nFirst response: \"Hello,\n\nMy name is Iron Wing, and I'll be your Player Support guide for this ticket.\n\nYou can get a chat restriction for misusing chat, whether or not what you're talking about is \"over a line\". I would say that /all chat is not the best place to have a political discussion like this. You are free to discuss the topics of your choice, but I recommend adding them after the game for a DM if you wanted to.\n\nSending this many messages in all chat without being relevant to the game is distracting from the game, not just for you, but for every one (especially in /all chat). The amount of messages can be likened to spamming, and is another reason that a chat restriction can be applied.\n\nAs far as things that specifically are over a line, \"im not a fucking retard\" is something that we don't want in game. Even if you're talking about yourself, you need to keep it to an appropriate level.\n\nAnything else I can do to keep your account from getting any harsher punishments let me know. I'm interested in keeping this account unpunished in the future if you want that too.\n\nIron Wing\nRiot Games Player Support\n\"I fought a house once. I'm pretty sure I won.\"","replies":[{"poster":"Vanilla Trubbs","date":"2018-09-01T19:00:32.145+0000","up_votes":1,"down_votes":0,"body":"Round two: \n\nMy name is Skeletor and I will be taking over.\n\nI understand that it sounds ridiculous, cluttering up the game with non-game specific content prevents others from seeing important game information and can make the game frustrating for others. Sadly we would not be able to tell you whether this was player or system triggered.\n\nThat said, just because the mute button exists, it doesn't mean that it is grounds for someone to justify the misuse of chat. The mute button exists to stop the person from dealing with that player so that they can go back to enjoying the game without that type of negativity in their life.\n\nThat aside, chat can be used for many things like relaying important information, friendships, congratulations on a game well played, and so forth. However, it is a tool and a privilege and if it is used incorrectly then disciplines must be applied. As it is still in League and should primarily remain a League related tool.\n\nAs a final note, we pointed out the \"I am not a fucking retard\" comment, because it was the easiest to have a discussion on, as it is more notably offensive.\n\nAll this said, even though you had made mentions to move on from here I would like to thank you for the understanding tone you have kept throughout this ticket.\n\nLet me know if you have any more questions. Otherwise, I wish you the best wherever your gaming adventures take you from here.\n\nSkeletor\nRiot Games Player Support","replies":[{"poster":"Vanilla Trubbs","date":"2018-09-01T19:03:21.473+0000","up_votes":1,"down_votes":0,"body":"I remember saving the chatlog somewhere because of how bullshit it was, but I'm not sure where I put it.\n\nThese tickets read like the agents had no idea what I was punished for and were just taking stabs in the dark.","replies":[{"poster":"usul1202","date":"2018-09-01T23:39:38.743+0000","up_votes":1,"down_votes":1,"body":"I would guess that yall were on some pretty controversial topics, but without a full log no way to tell. If I had to bet, I'd say that it wouldn't have gotten you punished without the retard part, riots going hard on that word. Tbh, not sure how I feel about that one. It's decently controversial but...... Eh. Doesn't carry the same hate as most of the 0 tolerence list imo.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}