{"poster":"Jhin Freecss","date":"2016-01-10T02:39:58.021+0000","title":"Han pasado 196 dìas ...","subforum":"Off-topic y temas personales","up_votes":6,"down_votes":2,"body":"Desde hace un poco mas de 6 meses que cree mi cuenta , he bloqueado a 469 personas ( si , los conte todos ) y por f&igrave;n me lleg&ograve; el cartelito que dice que han castigado a una persona gracias a mis reportes...\r\nLa sensacion es indescriptible , la felicidad  que fluye por mis venas es algo que nunca hab&igrave;a sentido.\r\nY lo malo es saber que esta felicidad y me durar&agrave; un par de partidas cuando vuelva a bloquear a otra persona y que probablemente no vuelva a ver durante mucho tiempo ese cartel tan m&agrave;gico que me hizo ver la peque&ntilde;a luz de la justicia .\r\n{{item:3800}} {{summoner:13}} {{summoner:1}} \r\n~~pray for the community~~","replies":[{"poster":"Excorpion","date":"2016-01-10T03:03:24.836+0000","up_votes":2,"down_votes":0,"body":"Siempre eh sugerido que ese cartelito debería aparecer siempre que alguien ah sido baneado (ese cartel no aparece con cada persona baneada, solo aparece el 0,1% de las veces) pero dicen que eso desmotivaría a las personas a banear... es estúpido la verdad","replies":[{"poster":"Hell Darking","date":"2016-01-10T04:23:25.709+0000","up_votes":1,"down_votes":0,"body":"Si el cartelito saliera siempre la gente reportaria mas las cosas, pero como nunca sale se piensa \"para que voy a reportar si no funciona nunca\" y pss.. estamos como estamos","replies":[{"poster":"Excorpion","date":"2016-01-10T16:32:30.942+0000","up_votes":1,"down_votes":0,"body":"Exacto, esa es la lógica que Rito no sigue, no se cuantas veces se los eh dicho...","replies":[]}]}]},{"poster":"Sonya Kyron","date":"2016-01-10T16:04:00.286+0000","up_votes":1,"down_votes":0,"body":"No era tan mal jugador, si tardo 196 dias en llegar a 0 puntos de jugador. Yo vengo recibiendo muchos premios reportando, es una forma alternativa para subir de liga.","replies":[]},{"poster":"Yrox the Third","date":"2016-01-10T03:30:02.862+0000","up_votes":1,"down_votes":0,"body":"Estoy seguro que has baneado a muchos mas, el problema con este sistema es que solo le sale al que activa el ban, osea, el que dio el ultimo report, es un poco estupido pero es asi.","replies":[]}]}