{"poster":"Crunchy Lizard","date":"2017-11-10T01:03:03.847+0000","title":"Lag bei minute 1:30","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"In der Kluft lagt es bei 1:30 wenn die minions den tier zwei tower erreichen","replies":[{"poster":"DrYatty","date":"2017-11-10T01:18:34.987+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nes könnte durchaus an dem Patch liegen da Performance Probleme bekannt sind. -> \n\n\n\n> [{quoted}](name=SP3EDI,realm=EUW,application-id=7hciEY9w,discussion-id=Vem5rnmG,comment-id=0016,timestamp=2017-11-09T13:29:28.388+0000)\n>\n> #**PERFORMANCE/ FPS PROBLEME NACH PATCH (7.22)**\n> \n> Wir haben einige Meldungen erhalten über Probleme mit der Client Performance und FPS Drops im Spiel.\n> Wir arbeiten hart daran die Ursache für dieses Problem zu finden und dieses zu beheben.\n> Leider können wir derzeit noch nicht sagen wann genau das Problem behoben sein wird.\n> \n> Für den Moment könnt ihr das Problem kurzzeitig damit bekämpfen, das ihr in den Optionen &quot;Client schließen während des Spiels&quot; auswählt.\n> \n> Bitte bedenkt das die Probleme unterschiedliche Gründe haben können abhängig von eurem Betriebssystem und der Leistung eures PC/Laptops.\n> \n> \n> \n> ****\n> ****\n> \n> \n> \n> #**Wie könnt ihr uns Helfen das Problem zu finden?**\n> \n> Um das die Ursache der Probleme schneller finden zu können brauchen wir eure Logs.\n> **Hierfür müsst ihr ein [Support Ticket](https://support.riotgames.com/hc/requests/new) erstellen, da ihr keine .zip Dateien hier im Forum anhängen könnt.**\n> Ich habe euch hier unser **Hextech-Reperatur-Tool** angehängt, mit welchem ihr ganz einfach eure Logs mit einem Klick sammeln könnt. \n> \n> \n> **HRT:**\n> \n> - Lade das HRT [hier](https://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool) herunter\n> - Installiere das HRT mit Admin Rechten (stelle sicher das du keine Änderungen an den voreingestellten Einstellungen vornimmst)\n> - Starte das HRT als Admin\n> - Drücke auf Start\n> - Warte bis das HRT die Tests beendet hat und hänge die Logs.zip die auf deinem Desktop erstellt wurde an das Ticket an. \n> \n> \n> **Als letztes benötigen wir noch deinen PassMark CPU Score**\n> \n> - Klicke [hier](http://www.passmark.com/ftp/petst.exe) um die .exe Datei herunterzuladen.\n> - Installiere das Programm\n> - Nutze die Kostenlose 30 Tage Testversion\n> - Nach dem du das Programm gestartet hast, klicke auf **&quot;Run&quot;** unter  **&quot;CPU MARK&quot;** (das gelbe Viereck)\n> - Wenn der Test beendet ist, mache einen Screenshot von dem Ergebnis und hänge den Screenshot ebenfalls an das Ticket an.","replies":[]}]}