{"poster":"X FeKing","date":"2016-06-27T16:55:13.567+0000","title":"Por favor mejorar la comunidad con reglas o emparejamiento","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":0,"body":"Hace 4 a&ntilde;os juego al Lol y no me arrepiento, pero siempre esta esa molestia de encontrarte con algunas personas que no son &quot;buenas&quot;.\nSiempre hay gente que juega de malas o haces algo que no debes y  te insulta con mensajes xen&oacute;fobicos o relacionado a familiares que molestan mucho y ustedes me dir&aacute;n que mutee y listo pero si juegas una ranked la comunicaci&oacute;n es importante.\nSeria muy c&oacute;modo que arreglaran estos tipos de cosas. \n \n\nGracias por leer.","replies":[{"poster":"Rolando Magic","date":"2016-06-27T16:59:38.559+0000","up_votes":1,"down_votes":0,"body":"Si muteas a alguien, lo que vos escribis lo siguen leyendo, yo llevo como 5 partidas con /mute all y el juego se disfruta.\nPD: que tienen que ver los emparejamientos?","replies":[{"poster":"X FeKing","date":"2016-06-28T04:04:28.621+0000","up_votes":1,"down_votes":0,"body":"Yo por lo menos prefiero no mutear, ya que el necesita comunicación para entender a tu compañero que esta haciendo una mala partida o cuando sale todo bien es bueno decirlo. Genera mas confianza y mejor juego. \n\nSi te pones a pensar todo tiene que ver con el emparejamiento ya que si estas en plata3 y te toca con un bronze4, hay algo mal no?  \no en Oro 3 y te toca un plata 4, o tienes todo positivo y te toca un aliado con el KDA todo negativo y esos son los principales que flamean y se van afk. Eso es lo que tiene que ver el Emparejamiento.","replies":[{"poster":"Rolando Magic","date":"2016-06-28T04:23:54.896+0000","up_votes":1,"down_votes":0,"body":"Emm, pero como te dije si muteas los otros te leen ademas que comunicación podes tener con alguien que esta flameando? dije mute all pero es solo mutear a los toxicos.\nEl emparejamiento esta bien y funciona, dudo que te pueda tocar alguien de plata 4 siendo oro 3 pero no es imposible dependiendo del mmr general de la partida puede pasar, la persona que tenga kda negativo puede o no ser flamer y puede o no ser de una liga superior a la tuya ya que el kda significa poco y no hace al jugador flamer.","replies":[]}]}]},{"poster":"Lince Salvaje","date":"2016-06-27T17:04:21.360+0000","up_votes":1,"down_votes":0,"body":"veamos...\nLa comunidad ya tiene reglas.\npero si la gente no les da importancia o las rompe, hay que reportar.\nahi es donde esta fallando la comunidad, en no reportar todos los casos de flameo, trolleo y afk porque creen que el sistema no funciona o no están acostumbrados.\nsimplemente hay que seguir reportando y en caso de flameo intenso el mute, no es lo ideal pero es lo mejor para evitar mala sangre :)","replies":[{"poster":"X FeKing","date":"2016-06-28T04:12:16.246+0000","up_votes":1,"down_votes":0,"body":"Para mi las reglas no son las mejores y podrían ser mas estrictas,correctas y justas. \nNo te sirve de nada pedir report a alguien que se va afk o flamea ya que cuando la partida termina todos aprietan el botón de inicio y el afk, troll o flamer queda en el pasado. Yo en mi caso reporto todo el que sea negativo, al que tenga actitud antideportiva etc.\n\nLo que me parece justo es que los afk, negativos, flamers etc. Se vayan para una liga que merezcan como es bronze 4 o 5 \nTambién se podría poner una nueva \"regla\" que si todos los jugadores de tu team te reporten pierdas el doble o mas de PL. Ya que bajaría un montón la posibilidad que te toque alguna de esa gente que arruina las partidas.","replies":[]}]}]}