{"poster":"xxG1G4xx","date":"2015-05-10T09:29:45.142+0000","title":"Riot Nerf Yasuo pls","subforum":"Campioni e gameplay","up_votes":4,"down_votes":5,"body":"Riot nerf per Yasuo pls... \r\n{{champion:157}} \r\n\r\nIl champ pi&ugrave; odioso mai creato...","replies":[{"poster":"lucanomax1994","date":"2015-05-10T09:53:51.788+0000","up_votes":4,"down_votes":1,"body":"***","replies":[{"poster":"A Yordle ln Heat","date":"2015-05-10T09:54:51.637+0000","up_votes":7,"down_votes":0,"body":"Better Nerf Irelia","replies":[]}]},{"poster":"Ucr0niA","date":"2015-05-10T14:46:27.607+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=xxG1G4xx,realm=EUW,application-id=cAOZwaUi,discussion-id=vFBYAU4H,comment-id=,timestamp=2015-05-10T09:29:45.142+0000)\n>\n>\n> Il champ pi&ugrave; odioso mai creato\n\n{{champion:17}} \nBcc pls","replies":[{"poster":"Whommy","date":"2015-05-11T08:42:27.735+0000","up_votes":1,"down_votes":0,"body":"che c'entra la banca? XD","replies":[]}]},{"poster":"Otivnaig","date":"2015-05-10T14:43:04.599+0000","up_votes":4,"down_votes":4,"body":"Si nerfiamo un champ che richiede tanta abilità per fare qualunque cosa, incisivo solo se fiddato, molto dipendente dal team e che per fare qualcosa devve avvicinarsi e starti vicino molto tempo (ed è un carry), una ulti che fa qualcosa solo dopo che l'hai fatta (il buff, il danno della ulti è relativo), una w con un cd di venti secondi.\nBanniamo un champ che in mid non countera praticamente nessuno ed è counterato da molti, in top se non sai prima chi hai contro è un vero terno a lotto, un assassin senza escape nerfato già dieci volte.\nSi banniamo karthus perchè preme r e colpisce tutti a caso.\nBanniamo LOL, ha troppi champ op. \nMa và là","replies":[{"poster":"Axelney","date":"2015-05-10T20:30:18.015+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Otivnaig,realm=EUW,application-id=cAOZwaUi,discussion-id=vFBYAU4H,comment-id=0003,timestamp=2015-05-10T14:43:04.599+0000)\n una w con un cd di venti secondi.\n\n\ncosa vuoi che sia un muro che protegge da tutti i proiettili nemici (sia skillshots che attachi base). cioè 20 secondi di cooldown son troppi che scherziamo? Alla fine non ti ripara nemmeno dalle abilità AoE . fa proprio shcifo hai ragione diamogli un cooldown di 4 secondi sulla w così la lane contro yasuo diventa ancora più difficile di quello che è. Riot pls buff Yasuo","replies":[{"poster":"Whommy","date":"2015-05-11T08:40:30.426+0000","up_votes":1,"down_votes":0,"body":"yasuo è counterato da tutti i midlaner eccetto syndra\nha meno hp di un adc, non ha escape, il muro basta girarci attorno invece di stare ad autoattaccare come scemi per poi dire \"il muro mi blocca pls nerf\"","replies":[{"poster":"Axelney","date":"2015-05-11T13:27:02.746+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tommyhaze17,realm=EUW,application-id=cAOZwaUi,discussion-id=vFBYAU4H,comment-id=000300000000,timestamp=2015-05-11T08:40:30.426+0000)\n>\n> yasuo è counterato da tutti i midlaner eccetto syndra\n> ha meno hp di un adc, non ha escape, il muro basta girarci attorno invece di stare ad autoattaccare come scemi per poi dire \"il muro mi blocca pls nerf\"\n\nNon sto dicendo che è da nerfare perchè ha un muro ma lamentarsi perchè il muro ha un cooldown di 20 secondi mi pare stupido, è più che giusto che sia così","replies":[{"poster":"Whommy","date":"2015-05-11T15:01:16.812+0000","up_votes":1,"down_votes":0,"body":"scusa se l'hai presa come critica, ma forse mi sono spiegato male......stavo \"integrando\" il tuo discorso XD","replies":[{"poster":"Axelney","date":"2015-05-11T20:24:51.260+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tommyhaze17,realm=EUW,application-id=cAOZwaUi,discussion-id=vFBYAU4H,comment-id=00030000000000010000,timestamp=2015-05-11T15:01:16.812+0000)\n>\n> scusa se l'hai presa come critica, ma forse mi sono spiegato male......stavo \"integrando\" il tuo discorso XD\n\nnp xD","replies":[]}]}]},{"poster":"SideshowEMS","date":"2015-05-11T11:27:05.609+0000","up_votes":1,"down_votes":0,"body":"Ha anche uno scudo che si attiva in automatico però, devi tenerne conto. In più può attivare la W per **parare** il prossimo attacco, non è che ci voglia tanto.","replies":[{"poster":"Whommy","date":"2015-05-11T12:46:02.797+0000","up_votes":1,"down_votes":0,"body":"il flusso si ricarica moooolto lentamente , hanno aumentato la capacità nelle ultime patch, di conseguenza aumentato il tempo di ricarica in più ora si ricarica pochissimo dashando con la E (prima era OP bastavano 3 minion e tornava lo scudo)\nin ogni caso lo scudo \"mitiga\" nel senso copre fino a X danno ma basta un qualsiasi colpo per buttarlo giù indipendentemente dalla quantità di danno.\nIn lane basta un AA appena uno lo vede pieno e lo scudo non esiste più,....mettetelo a confronto con quello di Riven.","replies":[{"poster":"SideshowEMS","date":"2015-05-11T14:24:15.730+0000","up_votes":1,"down_votes":0,"body":"Lo so che basta un AA per buttare giù lo scudo ma è comunque qualcosa di cui tener conto. Yasuo non è messo così male come hai detto.\nE' giusto che il cd della W sia alto, così giusto che lo scudo si ricarichi lentamente. Non c'è nulla di male nel dire che un campione è forte. Non è che perché qui è stato chiesto di nerfarlo, allora bisogna sottolineare tutti i suoi difetti per farlo sembrare più difficile di quello che è. Sono cose pensate per il suo ruolo. Non ti passa neanche per la testa di considerare come handicap il fatto che un mago non faccia danni fisici ! E i  lati positivi allora ?. Tipo che la probalità di critico è \" solamente \" raddoppiata.","replies":[{"poster":"Whommy","date":"2015-05-11T14:58:40.606+0000","up_votes":1,"down_votes":0,"body":"E' giustissimo che sia alto il cd della W, sto solo discutendo e non l'ho neppure accennato il cd XD\nDico solo che è un pick rischioso attualmente, se lo stompi in early  fa poco e nulla fino a 30min.\n\nSe si feedda è come qualsiasi champ feeddato, rimane comunqe un champ da late con meccaniche da early.\n\nRicorda che fa fra il 10% e il 25% (in caso della Q) di danno in meno a critico e che è melee non ranged.\nInoltre lo statikk è stato nerfato un pelino ma di riflesso gli ha tolto 10% di critici (cit. Tryndamere....)\nScala malissimo in HP, armatura e rigen.\n\nSottolineo i difetti per un semplice motivo, se sai i difetti e i punti deboli capisci come ci si gioca contro.","replies":[{"poster":"SideshowEMS","date":"2015-05-11T18:02:55.860+0000","up_votes":1,"down_votes":0,"body":"> Ricorda che fa fra il 10% di danno i meno ......\n\nDue critici da 90 danni ciascuno fanno più male di un critico da 100 e un AA da 50.\n:)","replies":[]}]}]}]}]}]}]}]},{"poster":"xiaososo","date":"2015-05-10T20:55:51.881+0000","up_votes":2,"down_votes":0,"body":"hahahah poi nessuno parla di fiora, che nel early game ha gia 105+ ad che poi dopo la hydra famelica tutti i tuoi burst che fai lei li recupera usando i suoi AA poi. Ti salta adosso con la Q W E ti mette a metà vita poi Q torna indietro su un minions poi Q di nuovo su di te Q ignite manco la R usa.....0 skills e riesce a carriare un team fight","replies":[{"poster":"PLgei","date":"2015-05-10T21:05:38.385+0000","up_votes":2,"down_votes":0,"body":"Ho sentito che {{champion:114}}  verrà rifatto. Mi sà che non sarà più un noob champ nel futuro, ma vorrei che riot fà rimanere la sua combo(A+Q+A+Hidra+A+E+A+Q)\nP.S. Nel futuro Fiora avrà più mobilità e sarà in jungle o mid (forse, ma credo di si)","replies":[]},{"poster":"Whommy","date":"2015-05-11T08:49:26.488+0000","up_votes":1,"down_votes":0,"body":"per rimanere OT, puù che altro mettendo la R di Fiora rispetto a quella di Yasuo si rimane basiti.\n\nfiora: 5 attacchi base AOE +Hydra+x AD (che applicano gli effetti sul colpo) che la rendono imbersagliabile e che fanno perdere l'aggro della torre (se ci sono minion si refulla la vita con rubavita), anche se lanci un CC  9/10 può comunque usarla.\n\nyasuo: 3 attacchi base+xAD+50%pen arm (che applicano gli effetti sul colpo) deve soddisfare il lanciato in aria per essere lanciata, yasuo rimane bersagliabile.\n\n\nieri ho comprato fiora XD","replies":[]}]},{"poster":"Otivnaig","date":"2015-05-10T15:00:39.914+0000","up_votes":2,"down_votes":0,"body":"Odioso? E uno yi che fa quadra premendo q (e quindi beccando 4 persone con uno sputo di vita) che fa? Una riven che, previa craniate sulla tastiera, fa una quadra (di nuovo) perchè nessuno ha cc? Tryndamere che ti spacca la faccia nonostante sia 1v4? Jinx che ti fotte un baron premendo r? Non sono tutti fastidiosi?\nO ci mettiamo pure garen che non crepa mai? O shaco che ai primi livelli è sempre sotto al tuo culo?\nE' tutto fastidioso, è bello per questo. Ritengo un blitzcrank che non sbaglia un grab molto più rompicazzo","replies":[]},{"poster":"Zarath93","date":"2015-05-10T10:19:40.593+0000","up_votes":2,"down_votes":0,"body":"L' HANNO GIA NERFATO, PRIMA SI CHE ERA UN MOSTRO\n\n\nYasuo moves slightly faster and Steel Tempest has a lower cooldown at early ranks.\n\n\"We might have overdone it a tad with v4.18, so we're stepping back just a bit. These changes should maintain Yasuo's vulnerability to ganks in lane but give him a little more leeway to make plays with Steel Tempest. A wanderer isn't always lost, but that doesn't mean he's over-nerfed. What does that mean. We don't know.\"\n\nGeneral\nMOVEMENT SPEED: 340 ⇒ 345\nSteel Tempest.png Q - Steel Tempest\nCOOLDOWN: 5/4.75/4.5/4.25/4 seconds ⇒ 4 seconds at all ranks\nv4.18\nYasuo's base health and movement have been reduced. Remember that time we talked about taking more time to read the summary than the actual changelist?\n\n\"As hypercarry swordsman, Yasuo should make early game tradeoffs for opponents to capitalize on before he grows to his late potential. Right now, that isn't quite the case as Yasuo's quite strong in the early game, even in unfavorable matchups, in addition to scaling extremely well. These changes are to more specifically highlight Yasuo's early weaknesses, including being squishier if his passive isn't up and, more importantly, being more vulnerable to ganks if he's pushed up and doesn't have minions to dash through for his retreat. We'll be keeping a close eye on Yasuo with these changes, however, as having an early game weakness will almost certainly have an impact on his late game reliability.\"\n\nGeneral\nBASE HEALTH: 512 ⇒ 462\nBASE MOVEMENT SPEED: 350 ⇒ 340\nv4.17\n\"While this is a fairly innocuous bugfix for Yasuo, we wanted to take this opportunity to talk about everyone's favorite wind swordsman (to ban). While we think Yasuo's in a good spot in terms of his overarching gameplay and strategic fit, there's a good chance he's just a little strong for what he brings to the table. We're currently examining ways to add more meaningful counterplay against Yasuo but just wanted to let you know we're aware of his power.\"\n\nSteel Tempest.png Q - Steel Tempest\nINNOCUOUS BUGFIX: Fixed a bug where Steel Tempest's cooldown was slightly too low when using the E-Q combo at high attack speeds\nv4.13\nYasuo's passive shield is slightly shorter, Q scales less with attack speed, and W no longer gives bonus flow to E\n\n\"We've been watching Yasuo over the past few months and while we don't think he's really out of line, we did some fine-tuning to round him out.\"\n\nWay of the Wanderer.png Passive - Way of the Wanderer\nSHIELD DURATION: 1.5 seconds ⇒ 1 second\nSteel Tempest.png Q - Steel Tempest\nLESS-QUICK-DRAW: Steel Tempest now scales less effectively with attack speed and has a minimum cast time of 0.13 seconds ⇒ 0.18 seconds. The attack speed needed to reach this minimum is unchanged (at 114%, or 60% from items at level 18).\nBUGFIX: Fixed a bug where Steel Tempest's whirlwind was dealing instant damage in the area of a normal Steel Tempest cast as it was traveling out (this is a very minor change)\nWind Wall.png W - Wind Wall\n\"REMOVED\" LOW ON FLOW: Wind Wall no longer passively grants bonus Flow from dashing\nv4.12\nSweeping Blade.png E - Sweeping Blade\nBugfix: Fixed a bug where Sweeping Blade sometimes didn't count as a spellcast for various items and champion abilities\nv4.11\nAs a nimble fighter, Yasuo should be balancing his offense and defense throughout the laning phase. Right now, however, Yasuo's ability to stack up excessive amounts of extra damage on Sweeping Blade (particularly at early levels) means he can quickly bully out opponents before they have the chance to retaliate.\n\nSweeping Blade.png E - Sweeping Blade\nBONUS DAMAGE CAP: 100% at 4 stacks ⇒ 50% at 2 stacks\nv4.3\nWe’ve reduced Way of the Wanderer’s shield duration as well as its value at higher levels.\n\n“We want to further emphasize Yasuo’s defensive weaknesses, like triggering his shield with a basic attack and then waiting out the duration, or making him more vulnerable to lots of things hitting him at the same time.”\n\nWay of the Wanderer.png Passive - Way of the Wanderer\nSHIELD DURATION: 2 seconds ⇒ 1.5 seconds\nSHIELD (ROUGH VALUES): 60~690 ⇒ 60~470\nSHIELD (REAL VALUES): 60/65/70/75/85/95/110/125/145/170/200/240/290/350/420/500/590/690 ⇒ 60/65/70/75/80/90/100/110/125/140/160/185/215/250/290/340/400/470\nv4.2\nIt now takes more movement to generate flow and Sweeping Blade gives less flow when Yasuo dashes. We also reduced Last Breath’s cast range.\n\nWe made some general quality of life changes to Yasuo in patch 4.1 , but as players begin to master him, we’ve seen how strong he is when played to maximum effectiveness. We looked at areas where we could reduce some of that power without messing with his core playstyle. We were also unhappy with how Yasuo was using Last Breath to engage in fights by teleporting from thousands (and thousands) of miles away.\n\nWay of the Wanderer.png Passive - Way of the Wanderer\nMOVEMENT TO GENERATE A UNIT OF FLOW :: increased by 15%\nSteel Tempest.png Q - Steel Tempest\nVISUALS :: Now passively displays a range indicator around Yasuo when Steel Tempest's Whirlwind is available\nSweeping Blade.png E - Sweeping Blade\nPASSIVELY GRANTS FLOW WHEN HE DASHES :: 4/8/12/16/20% ⇒ 3/6/9/12/15%\nLast Breath.png R- Last Breath\nCAST RANGE :: 1300 ⇒ 1200\nBUG FIX :: Fixed a bug where Last Breath could sometimes be used beyond the maximum range\nv4.1\nSummary: We’ve smoothed out Yasuo’s gameplay overall and made Steel Tempest auto-smartcast. Additionally, Last Breath now gives maximum Flow when cast and has a slightly shortened animation.\n\nWhile we’re still keeping an eye on how Yasuo is performing at all levels, we wanted to smooth out his gameplay and give Last Breath more use to turn around a fight when he’s behind.\n\nGeneral\nNow properly applies the 10% critical strike damage reduction to Statikk Shiv critical hits\nImproved the functionality of his E – Sweeping Blade to Q – Steel Tempest combo\nSteel Tempest.png Q – Steel Tempest\nAll casts are now automatically smart cast\nWind Wall.png W – Wind Wall\nNo longer blocks friendly Syndra orbs\nLast Breath.png R – Last Breath\nNow grants maximum Flow on cast\nSpell animation shortened by 0.1 seconds\nNow less likely to be teleported out of by enemies spamming flash\nNow properly alerts spectators and allies when it is on cooldown","replies":[]},{"poster":"PLgei","date":"2015-05-10T20:52:46.569+0000","up_votes":2,"down_votes":1,"body":"Ma  il champ più odioso mai creato non era {{champion:17}} ?","replies":[]},{"poster":"Vileblood Pyke","date":"2015-05-10T14:55:18.804+0000","up_votes":2,"down_votes":1,"body":"Sì, Yasuo è odioso.\nNo, al momento non ha bisogno di nerf.","replies":[]},{"poster":"Mattia91Rufy","date":"2018-03-01T18:53:30.551+0000","up_votes":1,"down_votes":0,"body":"è illegale come campione. non è possibile che vinca le partite da solo, è immortale. Fa passare la voglia di giocare","replies":[]},{"poster":"Otivnaig","date":"2015-05-11T20:05:56.147+0000","up_votes":1,"down_votes":0,"body":"Sono contento della conversazione... XD\nper il muro, mi lamento si del cd, perchè il muro COME IDEA è op, ma se lo sgarri anche di un solo secondo è una spell buttata nel cesso (e ho scoperto da qualche mese che funziona anche dall'altra parte, quindi spesso scappo facendomi il muro davanti e funziona)","replies":[]},{"poster":"One Tax Man","date":"2015-05-11T18:14:30.423+0000","up_votes":1,"down_votes":0,"body":"Perché nerfarlo scusa? Già è un campione difficile da usare , divertente si ma fa qualcosa o se sei un coreano che ha 35 dita nelle mani e non lo vedi muovere con la E e non sbagli un tornado oppure sei feedato da far schifo.\nA me piace da usare ma non è che rende sempre benissimo : mid ha moltissimi counter anche se teoricamente ne countera pure molti , se non ci sono minion non ha escape , è item-dependent da far paura , la ulti fondamentalmente non fa danno ( dopo ne fai tanto ma Vabbè) e se non c è un malphite , un wukong oppure orianna nel team è ancora più arduo da usare.\nPer come la penso io ci sono champ che meritano molto di più di essere nerfati.","replies":[]},{"poster":"SideshowEMS","date":"2015-05-11T11:55:07.546+0000","up_votes":1,"down_votes":0,"body":"Lo scudo per me ci può stare. Volendo anche la W. Solo una cosa mi infastidicce però.\n\nPerdonatemi ma non considero schivare i tornado come \" counterplay \". A livello di probabilità prima poi dovrà pur prenderti.  Poi con le mosse che seguono può eliminare in un colpo solo un mago come Syndra o Twisted Fate a vita piena, potendolo fare anche sotto la torre in totale sicurezza. Non succede sempre, questo lo so, però si può fare. Il problema non è la possibilità di fare All-in, ma che dopo la Q non lo puoi schivare. Per capirci. Se LeBlanc ti si lancia adosso sotto la torre tu ti puoi muovere. Questo è importante. Se tu vai indietro, cosa fa lei ? Il tornado invece ti lancia in aria. \n\nHey, però Yasuo è difficilissimo XD","replies":[]},{"poster":"Ulamog95","date":"2015-05-11T10:47:48.650+0000","up_votes":1,"down_votes":0,"body":"yasuo mid fa schifo, la sua mossa più forte è la e perchè gli permette di non essere stuprato e farmare i primi livelli, top è accettabile ma è squishyssimo e gente tipo fiora/jax lo annienta(nasus poi), yasuo è forte solo in alcuni casi: il nemico prova a colpire te e non a farmare, il nemico è stupido e perde l'early contrto di te, usi i trucchi, il tuo jungler è tua mamma che ti babysitta la lane con un champ da knockup o in late avete una team comp wombo combo omaigod con knockup ad area multipli e danni ad area.\ncontro yasuo io la lane non la perdo quasi mai, mi è successo con zac, ma è un tank ed è counterato da yasuo, se mid prendi tipo azir(però devi essere bravo), gragas, katarinanoobpls o akali lo batti tranquillissimo ;)","replies":[]},{"poster":"Niklide","date":"2015-05-10T21:47:05.154+0000","up_votes":1,"down_votes":0,"body":"N O..........è difficile da usare quindi se ti sembra OP è tutta bravura del player, tanto di cappello.... p.s. io non lo gioco quindi non è che lo sto difendendo","replies":[]},{"poster":"xxG1G4xx","date":"2015-05-10T09:31:27.336+0000","up_votes":1,"down_votes":0,"body":"Sono sicuro che gli amanti di Yasuo diranno noooo bla bla bla...\nma non è possibile che un champ da solo possa vincere scontri del tipo 3 vs 1","replies":[{"poster":"Ucr0niA","date":"2015-05-10T14:45:28.136+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xxG1G4xx,realm=EUW,application-id=cAOZwaUi,discussion-id=vFBYAU4H,comment-id=0000,timestamp=2015-05-10T09:31:27.336+0000)\n>\n>\n> ma non è possibile che un champ da solo possa vincere scontri del tipo 3 vs 1\n\nCiò significa, che di 3 di voi, nessuno ha un CC (cosa improbabile) o che quindi nessuno di voi è riuscito a beccarlo con questo, che siete indietrissimo rispetto a lui, e che vi siete persino messi in fila per farvi sollevare dal tornado.","replies":[]}]},{"poster":"Best Chair Euw","date":"2015-05-12T08:41:07.391+0000","up_votes":1,"down_votes":2,"body":"Ma via ragazzi che scherziamo per davvero! Andatevi a guardare le statistiche di tutti i champ e guardate la difficoltà di yasuo in confronto a tutti gli altri mid laners. La forza di yasuo sta nel CONTINUO dashare, dal momento che non hai più niente su cui dashare yasuo che combina?non pushate yasuo sotto torre che se arriva un tank dasha su 2 minion e vi è addosso insieme al jungler...fatelo pushare così non ha via di fuga. Il windwall blocca gli skillshot pls nerf rito...allora gli autoattacchi di un ap bloccarli o no sicuramente è un grave danno...per quanto riguarda le abilità se sei lux e appena tiri una abilità lui usa la W se te vai di full combo sei te il pirla non il muro che la rito deve fixare pla nerf it. Come ho letto giustamente è un champ da squadre, senza un knock up non vale poco.","replies":[]}]}