{"poster":"xxG1G4xx","date":"2019-03-13T08:07:46.684+0000","title":"Maaaa Diana in PBE?!?!?!?!","subforum":"Discussioni generali","up_votes":3,"down_votes":1,"body":"Buongiorno...\r\nqualche tempo fa la riot ha annunciato delle modifiche su Diana in PBE ed in particolar modo sulla Q ed R.\r\n\r\nBene... queste modifiche che fine hanno fatto?!?!??! La Riot non ne parla più da qualche mese... che è successo?\r\n\r\nMi potete dare un riscontro??\r\n\r\nGrazie a tutti in anticipo\r\n\r\nG1G4","replies":[{"poster":"HarlequinIT","date":"2019-03-13T21:53:26.038+0000","up_votes":3,"down_votes":3,"body":"Per me Diana può rimanere così\nHa un buon ingage scudo, danni ad area e controllo. \nNon ho capito cosa vuoi di più? Che voli?\nCon la R se trovo il midlaner fuori posizione e con vita bassa lo scoppia (sto parlando di Diana jungle) \nInvece se vuoi giocarla mid.... Non farlo che è meglio \nNel early game non combini nulla se il nemico sa giocare, solo dopo riesci a fare qualcosa in lana. \nInvece se rimani back, rientrare in partita non è troppo difficile, rubi 1 o 2 kill in team fight e sei apposto","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-03-14T06:34:57.073+0000","up_votes":3,"down_votes":1,"body":"Diana mid: 1.4% pick rate con il 48% wr. Tier 5. Una delle peggior stat della mid nonostante gli assasin siano la classe più spammata al momento in questa lane e Diana dovrebbe essere per natura un antiassasin molto efficace.Ci sta,capita,se non fosse che é così da quasi a4 anni.\nDiana jng: fa talmente schifo che manco la si gioca un numero minimo di game per fare una statistica (l'ultimo periodo dove ancora qualcuno la giocava aveva una wr del 43% su una pick rate di meno del 1%). Con i vari cambi al metà che hanno reso la jng sempre più di impatto early game é stata messa in condizioni sempre peggiori,poi é morta definitivamente a fine S5 quando é stato modificato l'item da jng per gli ap, modificando la passiva da una similare {{item:3100}} a un {{item:3285}} . Inoltre la stessa {{item:3100}} aveva preso un bel Nerf.\nSemplicemente é un champ vecchio,binario,che necessita il 6, che necessita di snowball early game e che il kit stesso la porta a doversi suicidare nei tf nonostante lo stesso kit non glielo permetta (rendendola dipendente dallo {{item:3157}} anch'esso nerfato pesantemente circa 2- 3 anni fa) e un kit in generale che non le fa sfruttare bene gli oggetti per assasin Ap presenti.\nInoltre anche nelle situazioni di team comp più favorevoli ci sono svariati champ che fanno il suo stesso lavoro meglio e più facilmente.\nCerto poi se si parla di Iron e bronzo allora funziona anche soraka jng,ma iniziando a giocare dove i player la tastiera l'hanno almeno comprata Diana jng é un suicidio","replies":[{"poster":"sbepuz97","date":"2019-03-14T09:09:58.849+0000","up_votes":2,"down_votes":2,"body":"> modificando la passiva da una similare  a un  . Inoltre la stessa  aveva preso un bel Nerf.\n> Semplicemente é un champ vecchio,binario,che necessita il 6, che necessita di snowball early game e che il kit stesso la porta a doversi suicidare nei tf nonostante lo stesso kit non glielo permetta (rendendola dipendente dallo  anch'esso nerfato pesantemente circa 2- 3 anni fa) e un kit in generale che non le fa sfruttare bene gli oggetti per assasin Ap presenti.\n\npraticamente hai descritto un qualsialsi assassin che si butta 1v5\nc'è un motivo se più sali più la vedi ancora giocata. diana rimane uno di quei champ dove come prendi 2/3 kill di vantaggio puoi snowballare un game da solo, e non sei obbligato a farle in corsia le kill. le puoi fare anche seguendo il jungler quando invade o contesta i crab","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-03-14T10:16:04.763+0000","up_votes":2,"down_votes":1,"body":"Veramente no.salendo diventa totalmente inesistente proprio per l'orribile early game e il kit insulso. Le stat da me riportate stanno dal plat in su. Scremando ulteriormente eli più alti questi dati peggiorano ancora di piu. Qualsiasi assasin ha la possibilità di buttarsi in mischia,uccidere e avere la possibilità di uscirne,Diana no (oltre che Diana non é un assasin ma un dive fighter e che nulla di ciò che ho detto é ricollegabile agli assasin attualmente esistenti).\nIl motivo per cui non va buffata ma cambiata é lo stesso identico di akali, se prende 2-3 kill snowballa da sola (comunque meno rispetto ad altri assasin Ap ), il punto é che non riesci a prendere vantaggio per come é ora se l'avversario non é afk (se la buffi e ha la possibilità di prenderlo invece risulterebbe troppo opprimente e priva di counterplay,esattamente come la vecchia Akali)","replies":[{"poster":"sbepuz97","date":"2019-03-14T21:53:25.876+0000","up_votes":1,"down_votes":2,"body":"i mean, sarà che allora si drogano quelli che la giocano anche in challenger (euw) prima che pensi che sto parlando del server turco\n\ndiana è un assassin come tutti, ovviamente ha match up orribili essendo un assassin, ma questo vale per tutta questa categoria di champion\n\ncon gli assassin in genere, prima di essere quasi full build non potrai mai fare 1v5, ma dovrai giocare per fare pick. e non venirmi a dire che con 1/2 item a diana manca il danno per sciogliere un champ, il vero problema nel giocare assassin non sta nel \"giocarlo\", ma nel negare la visione al team nemico e approfittare di questo","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-03-15T05:09:26.314+0000","up_votes":2,"down_votes":2,"body":"Non spariamo cose a caso pls. Basta guardare.\n1- Diana non é un assasin ma un dive fighter,é un dato di fatto sia classificata così non un opinione (tanto più che buona parte del kit non ha nulla a che fare con un assasin,come lo scudo,la passiva e la passiva della E). https://euw.leagueoflegends.com/it/news/game-updates/gameplay/unaltra-occhiata-alle-sottoclassi qui la puoi trovare fra i combattenti/assalitori se non ti fidi. Inoltre questa lista é un po' vecchia,dalla precedente modifica della passiva e della E questo aspetto si é ancora piu marcato .\nl fatto che dai per scontato sia un assasin é un ulteriore conferma di come il kit che ha non viene sfruttato come dovrebbe perdendo di fatto parte della sua forza.\n- il fatto che tu abbia visto un paio di partite challenger di un server specifico con Diana non la fa un pick efficace. É un altro dato di fatto che generalmente salendo di elo la pick rate diminuisce così come la win rate. Ti basta guardare le statistiche. Challenger si tratta di un paio di centinaia di player,fare una statistica su un numero di game così limitato non ha senso, dato che sono dati totalmente fittizi basati su una decina di game,oggi puoi trovarla al 100% di wr e settimana prossima allo 0 ad esempio (già guardando il master non sono affidabilissimi) salvo non si tratti di pick rate esageratamente alte. Sarebbe come dire che Aurelion Sol sia rotto visto che ha il 56% di wr,quando invece il numero di game giocati ci fa capire quanto sia un dato fuorviante.\n- gli assasin (di cui comunque Diana non fa parte) non sono pensati per arrivare a full build per fare gli 1 vs 5,ma a finire il game prima di essere esplosi a vista da chiunque \n","replies":[{"poster":"sbepuz97","date":"2019-03-15T15:36:02.679+0000","up_votes":1,"down_votes":2,"body":"1) ehm w8w8w8w88w se mi stai dicendo che diana non è un assassin ma un fighter abbiamo già un grosso problema di base. se la prendi come combattente quindi fighter/bruiser, rientra sempre in quella categoria, quindi diana potrebbe matchare un darius in lane? un renekton? un irelia? etc\n\nil fatto che i champ vengano classificati in più ruoli è più che normale, siamo in s9 tutto può essere giocato ovunque. esempi: talyah è passata al ruolo di support full ap, neeko va pure a casa mia, elise è stata flexata più volte in ruolo da support, vladimir può andare mid/top/adc, kassadin lo si builda tank/resistenze, rengar lo si builda trinity top lane\n\nprincipalmente diana rimane un assassin e null'altro, che vuol dire poi \"dive fighter\"? non siamo mica su final fantasy a inventare i nomi delle mosse\n2) non sai leggere nemmeno quindi dopo questo messaggio smetterò di perdere tempo. ti ho detto che ci sono otp diana in challenger euw, poi hf ^^\n3) aurelion sol, aurelion sol non è mai stato un bidone ambulante, in questo periodo ricolmo di irelia e fighter simili sicuramente non splende. il fatto che non venga giocato da chiunque è sicuramente a causa dello stile di gioco, anche quando aurelion sol era più che forte non lo si vedeva spesso, proprio perchè sfruttarlo al massimo richiede molto tempo di gioco su tale champ. se non riesci a pushare la wave e rommare...be sarai solo un peso per il team\n4) ehm in silver di sicuro, ma uno zed anche se 6/0 con 2 item min 20 non farà mai un 1v5, sicuramente potrà rommare e portare grosso vantaggio al team per snowballare il game e chuderlo in fretta. ma dire omg il champ non fa 1v5...è un assassin con 2 item...1 cc e esplode, è il motivo per il quale gli assassin hanno dovuto ricevere tutti questi buff negli ultimi anni per tornare in meta\n5)metti pure tutti i meno che vuoi....diana non cambia da assassin a fighter\n6) se vuoi un altro modo per farti capire che diana non è un darius....evento blood moon...diana/zed/fizz etc","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-03-15T19:18:42.993+0000","up_votes":2,"down_votes":1,"body":"1) stai mettendo una tua opinione davanti a un dato di fatto,quindi praticamente un sacco di fuffa al vento . La categoria in cui rientra non denota la lane dove deve giocare o che build fare ma la tipologia di champ che é. Neeko appunto é un caso anormale che verrà fixato 100%. Vladimir non modifica la propria identità in base alla lane,é e rimane un APC da hyperscaling.. Rengar rientra appunto negli assalitori e non assasin (appunto ha un modo per entrare velocemente e apportare un buon danno,tankare qualcosa ma non avere possibilità di uscire).ecc ecc... Dive fighter o Divers se preferisci,non é un nome inventato,é una categoria dove rientrano alcune tipologie di combattenti come Vi o Kled. https://leagueoflegends.fandom.com/wiki/Category:Diver_champion non sai le cose abbi almeno la decenza di non fare lo strafottente.\n2) il fatto che esistano otp qualcosa in challenger non rende un champ efficace nel gioco. Per quello ci stavano otp challenger anche del vecchio primo meme aatrox esempio eh,ma ciò non lo rendeva viabile\n3)non sto discutendo sull'efficacia di Aurelion,ma era un esempio per spiegare come pochi game portino dati falsati e spesso gonfiati e che quindi un numero irrisorio come quel paio di game  in challenger con Diana non vogliono dire nulla \n4) tu hai tirato in mezzo gli 1 vs 5 a caso,in cui ti ho spiegato che non é potenzialità degli assasin fare 1 vs 5,in particolar modo late game (dove secondo te invece a quasi full build dotrebbero farlo)\n5) vedi sopra\n6) in evento Blood Moon non erano presenti solo assasin infatti. Hanno dovuto inserire anche delle storpiature per aumentare la champ pool oltre che vendere le skin(salvo che cose come yasuo o riven non siano diventate assasin a mia insaputa almeno). Inoltre Darius é un jugg, Diana un diver quindi sostanzialmente più simile a Vi o Xin esempio\nSe hai da aggiungere cose che non siano esclusivamente opinioni basate sul nulla felice di sentirle","replies":[{"poster":"sbepuz97","date":"2019-03-16T01:00:29.467+0000","up_votes":1,"down_votes":2,"body":"hf \ndiana rimane un assassin, poi fai quello che vuoi\nil champ rimane buono in mid-late game","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-03-16T05:05:10.235+0000","up_votes":2,"down_votes":1,"body":"Quindi presumo tu non abbia nulla a dimostrazione della tua opinione. Dandoti il beneficio del dubbio hai capito di aver torto e semplicemente non vuoi ammetterlo. Va bene così dai :)","replies":[{"poster":"sbepuz97","date":"2019-03-16T13:07:28.089+0000","up_votes":1,"down_votes":1,"body":"nha, semplicemente non ha senso discutere con gente che preferisce guardare le statistiche su programmi esterni invece che imparare a giocare a league ^^\n\nal momento diana viene giocata anche nel server koreano. se non sappiamo giocare i champ è inutile andare a vedere programmi esterni e dire, eh ma da diamond a bronzo a 47% winrate....\nnon ha mai avuto senso guardare il winrate sotto il diamond\n\nripeto, smetto di scrivere sotto questo post in quanto è una perdita di tempo ragionare con te. non per altro","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-03-16T18:15:02.733+0000","up_votes":1,"down_votes":1,"body":"Sono sicuro che sei in grado di capire che fare una statistica su 10 game sia totalmente un dato errato.  Non esiste un solo server con dati positivi su Diana,nemmeno guardando  dal master. Certo guardiamo in korea esempio,ieri era al 100%, oggi al 66%,la settimana scorsa al 10%,un mese fa al 0% dati molto precisi trattandosi di 10 game in croce. Prendendo una media dei server su Diana con cui accumuliamo qualche  game, ha il 46% wr anche dal master in su (come detto peggiora salendo di Elo rispetto a cose a caso che affermi tu) nonostante la pick rate sia pure irrisoria.\nInsomma sia che si guardi  dal platino in su,il diamond,master ecc.. tutti dicono la stessa cosa,Diana fa schifo nonostante venga pickata quasi esclusivamente da otp o in game estremamente vantaggiosi. Prendendo esempio mid davvero utilizzabili ( in master+  così sei contento) come Ahri o Katarina,troviamo pick rate di un numero svariati di volte più alto con wr 7-8% superiori. Anche l'immagino super viabile God tier teemo (ironia ovviamente) ha la stessa pick rate di Diana ma con un wr di 12% superiore.\nInoltre i \"programmi esterni\" sono corretti a differenza delle mere opinioni basate sul nulla (non esiste una sola stat che sia a favore della tua tesi ne niente di ufficiale che classifichi Diana come assasin esempio). Ora lascio perdere visto che la discussione ha praticamente raggiunto il livello intellettuale di Scienza canonica vs terrapiattisti. Byebye ;)","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"V3LK0ZMAST3R","date":"2019-03-13T14:16:16.866+0000","up_votes":3,"down_votes":3,"body":"Illuso,per dei champ non amati dai bm credi che bastino 4 anni di inutilizzabilità per diventare degni di nota?","replies":[{"poster":"Mystogan92","date":"2019-03-13T19:14:55.580+0000","up_votes":3,"down_votes":2,"body":"infatti , figurati se la riot mette mano a champ non pickati. Se tocca qualche champ non pickato è perchè le perspne sono ormai esasperate e imprecano ogni santo da 2 almeno 3 o 4 anni.\n\nPrendi le blanc o rengar. Li hanno mini-reworkati, puff tutto tornato come prima. Ma li lasciate stare e pensate agli altri champ invece che perdere tempo a fare dietrofront che non erano messi male?\n\nLux: per un periodo è stata sotto la voce\"buff\" delle patch notes per mesi. Risultato: un champ che se prente mezza kill oneshotta. \nMa giustamente se non la buffavano chi comprava le 1001 skin di lux, no?\n\nPrendi shen o modekaiser...ah no aspè. Prima di toccarli devono morire nel meta. Tra poco tocca a mordekaiser ( tra poco nel senso che se va tutto bene per l'ultimo trimestre 2019)\n\nPrendi teemo: più che dare fastidio ai champion melee ai primi livelli non serve a niente. Solo i bronzini lo bannano. In team è \"utile\"con qualche funghetto che rallenta. fa danno solo se feedato. A livello 10 se la lane è pari qualsiai champ lo apre in due. Oh guarda dopo anni la riot se ne accorge\n\nToccano Morgana che già prima era messa più che bene, ora è anche più cancro. E , parlo per me, la morgana di prima a livello grafico era quasi migliore.\n\nNunu: la gente ha imprecato per anni il rework. Dopo 10 anni almeno sono risuciti a fare qualcosa di buono.\n\nvogliamo continuare a parlare di champ dimenticati, o champ modificati solo perchè sono i main pick in ogni elo?\n\n","replies":[{"poster":"koore","date":"2019-03-14T07:39:19.316+0000","up_votes":1,"down_votes":0,"body":"Su morgana non sono d'accordo. Hanno solo ottimizzato la w e la r. Piuttosto mi chiedo quando si occuperanno di fiddlestick. Attualmente è inutile","replies":[{"poster":"Mystogan92","date":"2019-03-14T18:26:11.618+0000","up_votes":1,"down_votes":0,"body":"ahh il mio caro fiddlestick. Anche io l'avevo dimenticato ormai.","replies":[]}]},{"poster":"JeffDahmer","date":"2019-03-14T07:36:19.350+0000","up_votes":1,"down_votes":0,"body":"{{champion:82}}  ricordati lui un champion vecchio con una mobility peggio di urgot con la w","replies":[{"poster":"Mystogan92","date":"2019-03-14T18:25:18.016+0000","up_votes":1,"down_votes":0,"body":"già citato vicino shen","replies":[]}]}]}]},{"poster":"Erax157","date":"2019-03-13T16:53:53.159+0000","up_votes":1,"down_votes":0,"body":"Io sono un Diana main personalmente preferirei se rimanesse così","replies":[]},{"poster":"vondarck","date":"2019-03-13T08:17:35.865+0000","up_votes":1,"down_votes":0,"body":"Ma magari...\n\nÈ un sacco di tempo che dico che diana ha bisogno di un nuovo kit","replies":[]}]}