{"poster":"Durfain","date":"2017-10-02T18:23:55.406+0000","title":"The tagline of the resolve rune tree is \"live forever\"","subforum":"Gameplay","up_votes":92,"down_votes":6,"body":"3 armor.","replies":[{"poster":"GrievousFetus","date":"2017-10-02T18:43:24.768+0000","up_votes":36,"down_votes":0,"body":"Can I just say that the second row of resolve secondaries feels like the most wasted potential and wasted space of all the runes? \n\nNot only are they lackluster, but they're also frustratingly similar. Iron Skin and Mirror Shell are otherwise identical but grant armour versus MR, and conditioning is simply being granted both iron skin and mirror shell at ten minutes after not having them until that point. First of all physical and magic damage aren't perfect symmetrical counterparts, the mere existence of auto attacks alone ensure that much, so it feels misguided to make the masteries symmetrical counterparts. Masteries which better reflected that physical damage comes from both skills and autos, as well as minions, while magic damage comes only from skills and some items, would be better.","replies":[{"poster":"Hexs Fortune","date":"2017-10-02T19:55:58.887+0000","up_votes":2,"down_votes":20,"body":"> [{quoted}](name=GrievousFetus,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=0003,timestamp=2017-10-02T18:43:24.768+0000)\n>\n> Can I just say that the second row of resolve secondaries feels like the most wasted potential and wasted space of all the runes? \n> \n> Not only are they lackluster, but they&#x27;re also frustratingly similar. Iron Skin and Mirror Shell are otherwise identical but grant armour versus MR, and conditioning is simply being granted both iron skin and mirror shell at ten minutes after not having them until that point. First of all physical and magic damage aren&#x27;t perfect symmetrical counterparts, the mere existence of auto attacks alone ensure that much, so it feels misguided to make the masteries symmetrical counterparts. Masteries which better reflected that physical damage comes from both skills and autos, as well as minions, while magic damage comes only from skills and some items, would be better.\n\nHave you seen the last two rows of Precision? 5 percent lifesteal, 15 percent attack speed, 5 percent dmg on targets below 40 percent.\n\nAll barely noticeable","replies":[{"poster":"Paroe","date":"2017-10-02T20:08:56.709+0000","up_votes":16,"down_votes":0,"body":"> [{quoted}](name=Hexs Fortune,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=00030000,timestamp=2017-10-02T19:55:58.887+0000)\n>\n> Have you seen the last two rows of Precision? 5 percent lifesteal, 15 percent attack speed, 5 percent dmg on targets below 40 percent.\n> \n> All barely noticeable\n\nOver the course of the game; \n10% increased damage on enemies below half health gets REALLY high (which is why we still get it even now) \n5% lifesteal is a lot when youre hitting for 500+ every half a second. \n15% attack speed is alot when you consider how attack speed works and that youre getting something like 40% from runes with it.\n\nYou want to talk barely noticeable? \nTanks get 5 HP per grasp proc. \nTanks get 0.2% max HP per one and a half waves. \nTanks get +5% armor or MR depending on which rune you take. \nTanks get +100 base health.","replies":[{"poster":"Skorch","date":"2017-10-03T11:22:30.616+0000","up_votes":1,"down_votes":3,"body":"A thing of note. These are all actually somewhat decent.\n\n100 base HP is a TON early, especially with the stat changes.\n\n5% armor/mr is also quite a lot. Its a bit stronger than just 5% less damage. Its like 7% reduced damage from whatever you take at around 250armor/mr.\n\nOver the course of a game you deal with over 20 waves. Meaning more than 7.5% bonus HP which is also quite a nice number. at 4000HP thats 300HP from 1 rune.\n\nThere are more bonuses to grasp than the 5HP per proc. And even then after procing 20 times (not too hard) thats 100HP. Still quite a nice number.","replies":[{"poster":"LankPants","date":"2017-10-03T12:44:43.643+0000","up_votes":10,"down_votes":1,"body":">5% armor/mr is also quite a lot. Its a bit stronger than just 5% less damage.\n\nDo the math before you make a claim like this please.\n\nHere's a graph showing the two lines for these at every resist value as well as the baseline resist.\n\nhttps://www.desmos.com/calculator/x1j09lwur1\n\nA 5% increase in resists is literally never better than 5% DR in any case. It's fairer to say that a 5% increase in Armour is close to a 3% increase in DR.","replies":[]},{"poster":"Paroe","date":"2017-10-03T21:20:29.909+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skorch,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=0003000000000001,timestamp=2017-10-03T11:22:30.616+0000)\n>\n> A thing of note. These are all actually somewhat decent.\n> \n> 100 base HP is a TON early, especially with the stat changes.\n> \n> 5% armor/mr is also quite a lot. Its a bit stronger than just 5% less damage. Its like 7% reduced damage from whatever you take at around 250armor/mr.\n> \n> Over the course of a game you deal with over 20 waves. Meaning more than 7.5% bonus HP which is also quite a nice number. at 4000HP thats 300HP from 1 rune.\n> \n> There are more bonuses to grasp than the 5HP per proc. And even then after procing 20 times (not too hard) thats 100HP. Still quite a nice number.\n\n100 base HP is less effective than 20AD. \n5% armor/MR is simply not a whole lot.... 200armor = +10. PLUS TEN. Similar runes from other trees are +30~50AD/AP. These masteries were never taken on live, why the hell are they on the revamped runes? \n\nOver the course of a game yeah syre youre going to get a decent bonus - but thats over the course of the game. Riot doesnt want late-game viable tanks, theyre meant to be early and mid game. The green tree is by far the most time-gated and gold-gated tree in the game right now because its bonuses are small and stack quite a bit. \n\nEven though grasp is decent, its still time gated and only really benefits lanes where you can actually slap fight... most top lanes are lane bullies or long-range champions right now. \nIf we want grasp to be really good then it needs to proc - the health steal - on large minions, large monsters, champions, and structures. \n\nRegardless the mirror runes NEED to be replaced with actually useful runes; 30% crit resistance and 30% penetration resistance are PERFECT mirror runes because you can tailor yourself to the matchup. Your enemy a toplane yasuo? Grab crit resistance and nullify his IE bonus. You a galio mid? Snag that 30% penetration resistance so the fed liandries mid laner cant melt you with poke.","replies":[{"poster":"Skorch","date":"2017-10-03T22:12:42.478+0000","up_votes":2,"down_votes":0,"body":"Um. Sorry, but uh, 30% crit/pen resistance is like Really good, like REALLY good. A single minor rune SHOULDNT negate an entire item.","replies":[{"poster":"Paroe","date":"2017-10-03T22:31:36.027+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skorch,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000300000000000100020000,timestamp=2017-10-03T22:12:42.478+0000)\n>\n> Um. Sorry, but uh, 30% crit/pen resistance is like Really good, like REALLY good. A single minor rune SHOULDNT negate an entire item.\n\nIn the case of crit resistance, buying a randy's omen and getting this crit resistance rune only nullifies IE - an item which is gold efficient without its passive. \n30% penetration resistance means 35% becomes 25% and 30 flat pen becomes 21. Situationally the difference is high enough to actually be useful, because these two runes would be on the same line. \n\nIt would be FAR better and scale as well as the other AD-oriented trees without being that powerful because theres not a whole lot of multiplicative options for resistances.\nWhen you think about the classes of champions the two runes i proposed are meant to help do your job against the bonuses are within a comfortable \"this isnt to strong but provides tangible benefits\" range.","replies":[{"poster":"Blitzidious","date":"2017-10-03T23:11:57.124+0000","up_votes":2,"down_votes":0,"body":"What about the third rune? 10 armor and magic resistance at ten minutes sounds horrible compared to 30% pen resistance or 30% crit resistance.","replies":[{"poster":"Paroe","date":"2017-10-04T00:19:13.548+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LadleLancer,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=00030000000000010002000000000000,timestamp=2017-10-03T23:11:57.124+0000)\n>\n> What about the third rune? 10 armor and magic resistance at ten minutes sounds horrible compared to 30% pen resistance or 30% crit resistance.\n\nYou could have it bee tank-incentivizing damage reduction. +1% reduced damage (per minute, up to 10~20) taken by basic attacks and abilities while your bonus AD is lower than 50% of your base AD. \nThis would also incentivise bruisers to build real tank as well - instead of building ~200AD, they would build a cleaver and then real tank items. Of course this would be hugely effective on AP-based champions like maokai but.... it doesnt really matter because synergy with other kinds of champions is good.","replies":[{"poster":"Skorch","date":"2017-10-04T02:49:45.877+0000","up_votes":2,"down_votes":0,"body":"They need an equivalent of both early game strength and late game strength. But not just plain overall insane strength.\n\nLike for instance even in the damage trees, most of them are either scaling, or situational/early.\n\nFor instance something like 2% Armor & MR per 8 Min. So that after 36 min around full build thats a bonus 8% of both which is pretty nice.\n\nBut also something for early game lane bully bruisers so maybe something like current fearless: After taking damage from an enemy champion gain 15% resistance for 6 seconds. CD 35 Seconds\n\nStuff like that.\n\nI will say though i HAVE played on PBE and experienced Resolve runepage, and with the stat buffs that every champion got, early game tanks are pretty ridiculous. I think people are worrying a bit too much.","replies":[]}]}]}]}]}]},{"poster":"Sdars","date":"2017-10-03T13:19:37.587+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Skorch,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=0003000000000001,timestamp=2017-10-03T11:22:30.616+0000)\n>\n> A thing of note. These are all actually somewhat decent.\n> \n> 100 base HP is a TON early, especially with the stat changes.\n> \n> 5% armor/mr is also quite a lot. Its a bit stronger than just 5% less damage. Its like 7% reduced damage from whatever you take at around 250armor/mr.\n> \n> Over the course of a game you deal with over 20 waves. Meaning more than 7.5% bonus HP which is also quite a nice number. at 4000HP thats 300HP from 1 rune.\n> \n> There are more bonuses to grasp than the 5HP per proc. And even then after procing 20 times (not too hard) thats 100HP. Still quite a nice number.\n\n1000 physical dmg vs 250 armor = 286 dmg\n\n5% more armor -> 263 armor\n\n1000 physical dmg vs 263 armor = 275 dmg\n\n275/286=96%\n\n~ 4% reduced dmg","replies":[]}]}]}]}]},{"poster":"RiotRepertoir","date":"2017-10-03T23:03:34.419+0000","up_votes":11,"down_votes":9,"body":"What's the correct value? And why? Keep in mind we're unlikely to let champions that opt in to the resolve tree actually live forever.","replies":[{"poster":"Shuriman Curator","date":"2017-10-03T23:40:41.870+0000","up_votes":16,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b,timestamp=2017-10-03T23:03:34.419+0000)\n>\n> What&#x27;s the correct value? And why? Keep in mind we&#x27;re unlikely to let champions that opt in to the resolve tree actually live forever.\n\nIts not what the correct value is, but if its worth the slot and as it stands i wouldn't consider either Iron Skin or Mirror Shell when conditioning offers better than both, without the heal condition and not for only 3 seconds. As a Shen main, and a Juggernaut player Conditioning is my go to option every match(assuming i go that route). There is no comparison lol","replies":[{"poster":"Thryale","date":"2017-10-03T23:57:39.127+0000","up_votes":2,"down_votes":0,"body":"yeah, that's a good point. I was thinking exactly the same thing when I saw those 3 options. I was like, \"da fudge? why would anyone pick a situational 3 armor/MR when they could get double of BOTH for free\"","replies":[{"poster":"NewGuy101","date":"2017-10-04T02:35:15.431+0000","up_votes":2,"down_votes":1,"body":"Depends on who you're up against. If you're up against a Renekton, you're probably better off with the upfront armor rather than waiting 10 minutes after Renekton has already bullied you to death.","replies":[{"poster":"Steelflame","date":"2017-10-04T02:53:31.718+0000","up_votes":11,"down_votes":0,"body":"Yea... except 3 armor won't stop him from bullying you to death.\n\nIron or mirror would make more sense if they had MORE upfront power, but decayed over the game's length.  They would be runes that would help you resist being bullied, but eventually would decay into a non-factor entirely, so if you didn't utilize the early defense they gave you to ensure you survived lane with a solid gold value, you'd lose out on the value of the slot entirely.","replies":[]}]},{"poster":"RocketRelm","date":"2017-10-04T01:22:34.752+0000","up_votes":2,"down_votes":0,"body":"The \"thought\", I imagine is that the early game bump is supposedly more important than the late game power, but +3 armor is incredibly marginal.","replies":[]}]},{"poster":"Melledoneus","date":"2017-10-04T02:55:13.959+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shenetration,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b0001,timestamp=2017-10-03T23:40:41.870+0000)\n>As a Shen main\n\nWhat the f*ck I just found the second of my kind.","replies":[{"poster":"Paroe","date":"2017-10-04T02:58:05.333+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Melledoneus,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b00010001,timestamp=2017-10-04T02:55:13.959+0000)\n>\n> What the f*ck I just found the second of my kind.\n\nIm an ex shen main... I miss my pre-rework space marine.","replies":[{"poster":"Melledoneus","date":"2017-10-04T03:00:55.343+0000","up_votes":1,"down_votes":0,"body":"*Sneakily pulls out butter knife and conceals it behind back*\n\nPlease, tell me more.","replies":[{"poster":"Paroe","date":"2017-10-04T03:14:12.149+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Melledoneus,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b0001000100000000,timestamp=2017-10-04T03:00:55.343+0000)\n>\n> *Sneakily pulls out butter knife and conceals it behind back*\n> \n> Please, tell me more.\n\nWell... For starters his old W and his old Q were flat better designed and just needed modernization buffs. His old passive was good too in its own way.\nPre-rework shen needed minor tweaks, but hes a victim of riots change for the sake of change policy. \nPost rework shen needs waveclear. If he had waveclear, he would be picked competitively a lot more often... I posted a thread a long while ago about making his Q a cleave - cone AoE centered ON shen instead of on the target - but it didnt get traction because shen was... ah... vaguely meta at the time. Every champion deserves waveclear, theres a reason why non supports have it built in nowadays.","replies":[{"poster":"Toru Itai","date":"2017-10-04T12:36:24.756+0000","up_votes":1,"down_votes":0,"body":"these are my feelings about Sion.\nEx-Sion main","replies":[{"poster":"Paroe","date":"2017-10-04T20:51:05.946+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Toru Itai,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b000100010000000000000000,timestamp=2017-10-04T12:36:24.756+0000)\n>\n> these are my feelings about Sion.\n> Ex-Sion main\n\nI was also a pre-rework sion main - im still cheesed at riot for not giving him a traditional skin that retained his glorious VO or paid homage to what he was before... A traditional skin, mind you, that highschoolers were able to make on their lunch break. Post rework sion is a more cohesive design though; the only thing he needs is old sions good base health.\n\n> [{quoted}](name=Flacid Leviathan,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b000100010000000000000001,timestamp=2017-10-04T18:08:22.618+0000)\n>\n> As a fellow Shen main, I don&#x27;t mind Shen&#x27;s core weakness being pushing. I&#x27;d rather have a good core item like sunfire back.\n\nThe thing about that... every champion deserves a good laning phase. Waveclear is not part of the power budget; waveclear should be a given. Making shens Q a cleave would do that for him in a way that WOULDNT break him because an AoE auto attack that ISNT a standard circular cleave woud give him no extra power, just wave clear. \nAs for sunfire cape, it needs range. Being able to comfortably hit the caster minions while being in front of the melee minions would be GREAT. Once we have the range, we can give it health scaling so that the item will never be lackluster compared to other options.","replies":[]}]},{"poster":"And A Real Hiero","date":"2017-10-04T18:08:22.618+0000","up_votes":1,"down_votes":0,"body":"As a fellow Shen main, I don't mind Shen's core weakness being pushing. I'd rather have a good core item like sunfire back.","replies":[]}]}]}]}]}]},{"poster":"Miraweave","date":"2017-10-03T23:23:22.077+0000","up_votes":7,"down_votes":0,"body":"Resolve tree should give you a permanent Tryndamere ult.","replies":[]},{"poster":"GrievousFetus","date":"2017-10-03T23:42:41.634+0000","up_votes":3,"down_votes":0,"body":">What's the correct value\n\nNot a third of the armour lost by the removal of armour yellows.","replies":[{"poster":"RiotRepertoir","date":"2017-10-03T23:45:32.151+0000","up_votes":9,"down_votes":4,"body":"Pretty sure there are base stat compensations already being added to compensate for some/all of the loss of Armor runes.","replies":[{"poster":"Automated Riven","date":"2017-10-04T13:44:53.758+0000","up_votes":5,"down_votes":0,"body":"I understand why you have to make tank runes so weak. (So other classes can't dip in and live forever while dealing obscene damage) but can the keystones be op as fuck like the rest of the trees at least? If you are sacrificing damage then you should get damn tanky anyway. (but what do I know. I think that team fights should last 10-15 seconds instead of 3 anyway)","replies":[]},{"poster":"Steelflame","date":"2017-10-04T03:00:33.889+0000","up_votes":2,"down_votes":0,"body":"Here is the thing though, these runes are obscenely weak.\n\nMost runes value at anywhere from 350-1000+ gold, while the best case scenario for these runes even in the lategame would tend to be less than 250 gold.\n\nThe resolve tree in general shows many cases of very low gold value runes, to be honest.   Other trees average 300-400 gold value for the adaptive bonuses.  Resolve is about 130-150 value.   Many of the other trees runes can get to obscene gold values lategame, exceeding 2k-3k+ even over the full tree, or offer a fairly solid chunk early game.  Resolve tends to sit at less than 800-1000 gold.\n\n\nI entirely wouldn't be surprised if the resolve tree after the rune rework has less than a 5% pick rate as either a primary OR secondary path.","replies":[{"poster":"Skorch","date":"2017-10-04T04:28:27.938+0000","up_votes":1,"down_votes":0,"body":"Thats tanks in general though. Tanks stats are always lower.\n\nIf I had to 100% guess i say that the reason secondary tank stats are so much worse than offense is because:\nA. You still need to be able to kill them early. If they got like 300HP and bonus 30Armor at level 1 they would be near immortal.\nand\nB. They want to disuade it as a secondary option for damage dealers.","replies":[{"poster":"Paroe","date":"2017-10-04T04:48:11.458+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skorch,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b0002000000010000,timestamp=2017-10-04T04:28:27.938+0000)\n>\n> Thats tanks in general though. Tanks stats are always lower.\n> \n> If I had to 100% guess i say that the reason secondary tank stats are so much worse than offense is because:\n> A. You still need to be able to kill them early. If they got like 300HP and bonus 30Armor at level 1 they would be near immortal.\n> and\n> B. They want to disuade it as a secondary option for damage dealers.\n\nThen make the actually powerful tank runes have something that dissaudes it; purposefully lower stats than the AD focused tree is BAD.  \nIve said before that making it so things only apply if you have less than 50% of your base AD in bonus AD would be a proper tank persuasion tool.","replies":[{"poster":"Skorch","date":"2017-10-04T05:10:23.696+0000","up_votes":1,"down_votes":0,"body":"It has been Riots strategy for YEARS. And the game has gone up and down in success. Tanks having generally less efficient stats hasnt been a problem unless tanks are getting killed.","replies":[{"poster":"Paroe","date":"2017-10-04T05:38:32.080+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Skorch,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b000200000001000000000000,timestamp=2017-10-04T05:10:23.696+0000)\n>\n> It has been Riots strategy for YEARS. And the game has gone up and down in success. Tanks having generally less efficient stats hasnt been a problem unless tanks are getting killed.\n\nIt hasnt been a problem because tanks and ADCs have been a stage apart; tanks used to be a stage ahead of AD champions. \nThere is a HUGE reason why a tank who does even is behind. Its because AD itemization is head and shoulders above the rest and tank items are far to expensive. 900~1100 combine costs. Marksman combine costs? 500~600.","replies":[]}]}]},{"poster":"Acheron16","date":"2017-10-04T20:05:33.075+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skorch,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b0002000000010000,timestamp=2017-10-04T04:28:27.938+0000)\n> B. They want to disuade it as a secondary option for damage dealers.\n\nThen why even make it an option? Wasnt the purpose of this new system to be able to adapt your builds?","replies":[]}]}]},{"poster":"And A Real Hiero","date":"2017-10-04T17:59:20.587+0000","up_votes":1,"down_votes":0,"body":"Doesn't make the mastery any less garbanzo though.","replies":[]},{"poster":"La Bello","date":"2017-10-04T16:58:30.794+0000","up_votes":1,"down_votes":0,"body":"Does this mean tank champions like {{champion:12}} {{champion:32}} {{champion:36}} {{champion:31}} {{champion:3}}  are gonna have like 150 base armor at level 18 instead of the usual 104 and stuff?\nbecause thats the only way I see tanks still be viable with the advent of infinite scaling damage and 80% AS steroids on every carry champ.\n\nthere is no way in hell +3 magic resist will stop a Lethal Tempo Kog'Maw from decimating you come lategame. Resolve is by far the worst tree so far .","replies":[]}]}]},{"poster":"Illâoi Evê Siôn","date":"2017-10-04T00:32:25.668+0000","up_votes":5,"down_votes":0,"body":"The correct value is one that can compete with other runes. That competition could be conditional, but it should be obvious to players. That's the whole point of the new runes, right? \n\n3 Armor doesn't feel very impactful.","replies":[]},{"poster":"Carnarius","date":"2017-10-04T08:17:25.277+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b,timestamp=2017-10-03T23:03:34.419+0000)\n>\n> What&#x27;s the correct value? And why? Keep in mind we&#x27;re unlikely to let champions that opt in to the resolve tree actually live forever.\n\n5 armor/magic res + 10% bonus when used with consumable\n10 armor/magic res + 10% total after 10 minutes for conditioning\n\nwhy? because runes from damage trees are way more powerful. also keep in mind that there is no secondary tank tree, while damage dealer can pick (for example) precision as his main path and domination as secondary, which will give him another free damage multipliers\n\nabout living forever, well there was a time where tanks actually did what they were supposed to do (low damage, high survivability), but that was season 2/3, when it was way easier to balance the game. right now i would be happy if i could survive few seconds against high damage team comp. i really doubt that these resolve runes will noticeably increase my survivability","replies":[]},{"poster":"Khristophoros","date":"2017-10-04T04:21:14.014+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=HP99yFZU,comment-id=000b,timestamp=2017-10-03T23:03:34.419+0000)\n>\n> What&#x27;s the correct value? And why? Keep in mind we&#x27;re unlikely to let champions that opt in to the resolve tree actually live forever.\n\nHigher than Conditioning. Why? Because Conditioning is both armor and MR and comes into play rather early at 10 min, plenty of time to recover from behind. However, the values on Iron Skin/Mirror Shell do not look impactful for pre-10 min anyway.\n\nIt needs to be high enough that we think \"Ok, I'm willing to take this for only armor or MR instead of both.\" and \"Wow it looks like it'll make a difference before 10 minutes.\" and I can say with confidence that 3 + 5% does not encourage players to have either of those thoughts.\n\nI think that the \"active\" portion especially makes little sense. It seems like for most champions it will be triggered by activating potions, but it's 5% instead of a flat amount which would be useful early game when we use potions. It makes no sense for the majority of champions when it is presented to us as a rune we are meant to take as an adjustment for certain lane matchups. The numbers really do not make sense for this purpose, and for later in the game when these runes could potentially be useful, Conditioning is better in every possible way.\n\nGiven that logic, it seems insane that the numbers are what they are. If it's meant to be useful for laning it shouldn't be 3 +5%. Perhaps 5% (passive) + 10 (triggered) or something along those lines.","replies":[]},{"poster":"And A Real Hiero","date":"2017-10-04T17:58:19.178+0000","up_votes":1,"down_votes":0,"body":"Uninspired masteries/runes. Flat armor, flat mr and a increase in both after 10 mins. Why not crit resist based off max armor, penetration resist, something fun and good?","replies":[]},{"poster":"La Bello","date":"2017-10-04T16:52:32.009+0000","up_votes":1,"down_votes":0,"body":"chock the tree full of % BONUS armor/Magic resist multipliers .\n\nMy suggestions:\n\nMirror Shell: now gives extra  _**BONUS**_ Magic resist when below half HP or when you apply a crowd control to a enemy champion (like 20% or something)\n\nIron Skin : Gives extra _**BONUS**_ armor when below half HP or when you apply a crowd control to a enemy champion.\n\nGrasp ALSO gives permanent HP bonus on Cannon,Large Jungle camps,Baron,Dragon and Rift kills.(Dragon,Rift and Baron gives like 50 extra HP instead of 5)\n\nGuardian Soul: remove AP ratio ( screw you AP supports go get a different tree). Pump up the bonus HP ratio\n\nAftershock: the Armor/MR increasing passive does NOT go on cooldown. only the damaging portion meaning heavy initiators get that bonus armor to work with.\n\n All you have to do to keep squishies off this page is make thier intended choices all that much more enticing. I cant really see a world where a Yasuo is going to try and go tanksuo with Wardens mail and GA  just for 30 extra armor at 50% hp over Precision's INFINITE ATTACK DAMAGE.","replies":[]},{"poster":"Lil Homie busta","date":"2017-10-04T16:24:55.861+0000","up_votes":1,"down_votes":0,"body":"I don't want to be rude, but just the fact that Riot developed those runes and said \"_Hm.. They are impactful and good enough to compete with others runes, now ship it to PBE_\" is already concerning. \n\nI know that durability stats are generally less effective in terms of gold per value due to balance measures, but to let this interfere so much in the runes to the point that they become incredibly underwhelming as they are is pretty unfair. Not only tanks want take the Resolve tree. People that's looking for more durability want it too, but Riot is ruining this option with those pathetic numbers.\n\nI'm sure that Iron Skin/Magic Shell are occupying a slot that could be used to put a creative and impactful defense rune, instead of unnoticeable amounts of stats. **What about a rune that creates a shield in the front of the champions (similar to Braum's E Shield \"Unbreakable\") when they use a skill/ability? The shield would stay for a brief moment and would block part of the damage taken through it, based on armor/MR and level (with a certain cooldown of course)? Now that sounds cool.**","replies":[]}]},{"poster":"Cocho","date":"2017-10-02T18:30:49.738+0000","up_votes":1,"down_votes":20,"body":"If you just take armor yellows, you get 9 armor. \n\nEveryone is getting +5 armor across the board \n\nYou got 8 out of 9 armor and 5% more when u pop a pot","replies":[{"poster":"Vlädïmïr","date":"2017-10-02T18:41:22.707+0000","up_votes":14,"down_votes":0,"body":"You're forgetting about masteries. \n\nThat doesn't even break even with runes+masteries currently. And you have the option of using more armor into many match-ups in place of your quints. \n\nMeanwhile, offensive options are being drastically buffed, especially on the AD side.","replies":[{"poster":"Cocho","date":"2017-10-02T19:55:42.519+0000","up_votes":1,"down_votes":2,"body":"There are other things to give you armor, there is a keystone that gives you like 10 armor + 25% for a short amount of time after CCing someone.","replies":[{"poster":"Vlädïmïr","date":"2017-10-02T20:05:54.812+0000","up_votes":6,"down_votes":0,"body":"Wow, so you mean fearless, another mastery?\n\nHere's the thing:\n\nNo one took Unyielding or Fearless because they aren't as good as the alternative. They're practically non-factors. \n\n______________\n\nTanks are getting back some of their worst masteries, while ADs are getting all of their already strong masteries buffed. \n\nThen AP's have a generic \"EVERY AP WILL USE THIS PAGE\" setup like now...except no DFT alternative. ","replies":[{"poster":"Cocho","date":"2017-10-02T20:39:28.372+0000","up_votes":2,"down_votes":1,"body":"No i mean the new keystone. and people do somewhat take fearless in higher elos. Its actually really good","replies":[{"poster":"Steelflame","date":"2017-10-03T02:32:30.230+0000","up_votes":2,"down_votes":0,"body":"Fearless is the strongest of the options at that tier by far.   Not saying much mind you, because all the options are fairly meh, but its really solid just for how much burst resistance it grants you.","replies":[{"poster":"LankPants","date":"2017-10-03T12:48:15.059+0000","up_votes":2,"down_votes":0,"body":"Inspiration is better than Fearless by quite a lot.","replies":[]}]}]}]}]}]}]}]}