{"poster":"Senék","date":"2016-09-26T15:59:27.863+0000","title":"ADC Laningphase","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Moin,\r\n\r\nIch wollte mir mal ein paar Tipps bez&uuml;glich der Laningphase holen bzw erfragen. Momentan bin ich Plat5 und es sieht auch so aus also ob ich mehr erreichen k&ouml;nnte. Mein mid und late game sind eig ziemlich gut, nur verlier ich zu 80% meine lane bzw werde ich fast immer gepressured.. ich wei&szlig; nicht so richtig wie ich das momentan verbessern kann. die punkte die mir bisher aufgefallen sind ist das meien map awareness manchmal unter aller sau ist und ich zu langsam reagiere wenn die gegner ihre spielweise &auml;ndern z.b aggressiverer spielstil wenn der gegnerische jgl kommt.\r\nFalls jmd direkt ein paar tipps geben kann oder mir ein paar gute youtuber/streamer empfehlen kann w&auml;re ich dankbar.\r\n\r\nGr&uuml;&szlig;e Senek","replies":[{"poster":"V3IG4R HQ","date":"2016-09-27T09:48:37.066+0000","up_votes":1,"down_votes":0,"body":"Sola macht gute \"Erklärungsvideos\" mit relativ gutem Gedankengang, sein Gameplay solltest du aber nicht als Referenz nehmen, denn imo ist er auch nicht gerade stark auf der Lane.\nEtwas vom Wichtigsten ist wirklich die Map-Awareness, auf der Botlane finden ganz gerne Partys mit bis zu 8 Spielern statt. Also immer schön warden wenn ihr deep geht oder pushen wollt, ansonsten auspushen und mit den Bushes spielen o.Ä. Nicht selten bekommen die Aggressoren auf die Kappe weil ein Zac  etc. plötzlich reingeflogen kommt. Deshalb ist es wirklich wichtig, sich solchen Dingen immer bewusst zu sein. Ein juicy Doublekill lässt sich kein Jungler entgehen.\n\nWie aggressiv du sein kannst hängt natürlich auch vom Matchup ab (wobei das auf Plat V noch nicht so entscheidend ist). Was du brauchst ist ein guter Mix aus Farm und Poke, wobei dein Movement extrem wichtig ist (dodgen, Orbwalk [ohne AA-Move geht garnix], etc...). Nur mit Positioning und gutem Bewegungsverhalten lässt sich unmenschlich viel rausholen. Sich einpushen lassen ist imo nur in seltensten Fällen wirklich empfehlenswert, weil du dann keinen Druck mehr ausüben kannst. Ich schaue eigentlich immer dass ich von Anfang an freeze oder pushe, weil man Trades dadurch viel effizienter gestalten kann (mehr Minions etc.) Wenn du gerne pokest platziere dich bei den Büschen solange nicht gewardet ist, um die Minion-Aggro unverzüglich wieder zu resetten. \nGibt noch viele Punkte, aber das würde aus dem Ruder laufen. Wichtig ist natürlich auch die Frage, ob dein Supporter Druck aufbauen kann (poken, zonen, engagen). \nWas ich auch oftmals feststelle: Supporter warten mit Exhaust immer bis zum letzten Moment, was natürlich total dumm ist. Wenn ein All-In beginnt sofort Exhaust raushauen. Ist jetzt zwar nicht an ADC's gerichtet, aber auch dadurch kann man sich Vorteile rausholen (vielleicht also mit Supp kommunizieren).","replies":[]},{"poster":"Neeko the Ekko","date":"2016-09-26T19:00:33.268+0000","up_votes":1,"down_votes":0,"body":"Sola von Summoners Inn zB streamt derzeit oft genauso wie Sedrion1. Beide wissen wie man in high elo adc spielt. Meistens gewinnt man die lanes öfters wenn man einfach Defensive unter dem Turm farmt. So ist auch die gank Gefahr niedriger","replies":[]}]}