{"poster":"Ezoroth Roze","date":"2016-11-11T00:07:07.007+0000","title":"In game and in lane, items bought, etc.","subforum":"[ARCHIVED] Help & Support","embed":{"description":null,"url":"http://i.imgur.com/c8N3Nxp.jpg","image":"http://imgur.com/c8N3Nxps.jpg"},"up_votes":1,"down_votes":0,"body":"Something about being penalized shows up, and now I'm seriously annoyed. I closed out of the message before reading it without thinking, but it was for leaving/afking too much and now I'm in lower priority queue. Absolute bs. How many problems do I have to go through with this game? I crashed before entering game, and I reconnected a bit late because the League client just isn't working at all for me. PBE loads and works 100% fine, but not regular client? Seriously, I'm starting to get really bothered by this, and I don't know whether or not any of these penalties are going to be fixed/have been fixed because the game is bugging out on me. At this rate, I don't even feel like I should play the game if I'm being penalized for things that are completely out of my control. Should I just stick to PBE at this point?\n\nEDIT: On a side note, need I mention that I reconnected and I still wasn't the last one to leave base?","replies":[{"poster":"Targons Blade","date":"2016-11-11T04:34:55.666+0000","up_votes":1,"down_votes":0,"body":"Disconnections negatively affect all players in the match, regardless of their cause. All disconnections are treated equally because of this and this is also why we cannot remove penalties for any reason.\n\nIt sounds like you're experiencing a poor connection to the servers, so I'd recommend we investigate the things that could be causing this. Local network connection settings play a big role in this, so working through our [connection guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) would be a great first step.\n\nLet me know if this caused any change.","replies":[{"poster":"Ezoroth Roze","date":"2016-11-11T05:56:54.018+0000","up_votes":1,"down_votes":0,"body":"Thing is, I've had this problem multiple times before and I've gone through the connection guide multiple times before. It only fixes it temporarily, and sometimes it works for only one or two games. Along with this, I was in game when this happened, so I don't see why a remake was even necessary.","replies":[{"poster":"Targons Blade","date":"2016-11-13T23:32:14.540+0000","up_votes":1,"down_votes":0,"body":"A remake would have been available if you were marked for being inactive for 90+ seconds within the first 3 minutes of the game. Once that happens, your team votes to pass the remake, and if successful, the game ends. \n\nSince you continue to have persistent issues with this, I'd recommend reaching out in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) and attach some system logs using our [HRT App](https://support.riotgames.com/hc/en-us/articles/224826367). One of our tech specialists can work with you further in order to target the exact cause of these issues. Let me know if you have any issues submitting your ticket.","replies":[]}]}]}]}