{"poster":"WaterWaffle","date":"2016-12-01T17:50:36.594+0000","title":"Lux Ultimate skin","subforum":"Discussioni generali","up_votes":8,"down_votes":0,"body":"Salve a tutti, volevo espandere se cos&igrave; si pu&ograve; dire il mio pensiero alla comunity,  cos&igrave; che, se l&#039;idea piace e porta feedback positivi i rioter possano prendere in considerazione di fare alcuni di questi cambiamenti/miglioramenti per garantire sempre di pi&ugrave; una sessione di gioco pi&ugrave; gradita. \r\n1 cosa ne pensate sul fatto di poter modificare l elemento una volta caricato a piacimento  visto che poter vedere solo 2 elementi a partita sembra un po limitativo vista la vasta scelta o perlomeno di rendere  il cambiamento fra i due elementi scelti reversibile a piacere che &egrave; sempre meglio di nulla.\r\n2 questa invece &egrave; la cosa che secondo me lancierebbe molto di pi&ugrave; anche la qualit&agrave; della skin, poter vedere nel proprio profilo lux in versione diversa in base al tipo di icona messa ( un po come con quella di udyr ) , visto che anche qua tornando al discorso della vasta scelta di elementi e di variet&agrave; di quella skin secondo me hanno trascurato molto il fatto di poterla visualizzare di pi&ugrave;. \r\nringrazio chi mi aiuter&agrave; con questa causa e spero che ci&ograve; possa portare a qualche cambiamento se ci&ograve; avr&agrave; successo ^^","replies":[{"poster":"RGM Player","date":"2016-12-01T18:57:13.182+0000","up_votes":3,"down_votes":0,"body":"Concordo pienamente sul fatto che devono migliorare la possibilità di cambiare più elementi in game. Il secondo punto sarebbe veramente molto bello se quando cambio icona, cambia anche il banner del profilo.","replies":[{"poster":"WaterWaffle","date":"2016-12-01T19:30:08.906+0000","up_votes":1,"down_votes":0,"body":"grazie , sono  felice che anche tu la pensi come me , allora chiedo a voi se poteste diffondere il messaggio così che anche gli altri possano aderire a questa idea :)","replies":[]}]},{"poster":"Kim114","date":"2016-12-01T19:18:23.906+0000","up_votes":2,"down_votes":3,"body":"ma invece di fare settordici skin a pochi champ, FARE SKIN A QUEI POVERI DISGRAZIATI CHE NE HANNO SOLO 1 O 2?{{champion:203}}  {{champion:202}}","replies":[{"poster":"SickAnto","date":"2016-12-01T22:36:52.885+0000","up_votes":2,"down_votes":0,"body":"Jhin è uscito da \"poco\" e Kindred ha pure ricevuto una skin non da molto tempo, penso che gli esempi fatti sono sbagliati xD","replies":[]},{"poster":"WaterWaffle","date":"2016-12-01T19:29:08.389+0000","up_votes":1,"down_votes":0,"body":"Su questo sono d'accordo  anche io che ci sono personaggi anche usciti da molto più tempo lasciati in disparte a livello estetico , ma non posso farci nulla , di certo so solo che se ricevono dei feedback positivi per incrementare il piacere di gioco potrebbero tenerne conto e  agire per conto della comunity .Ho contattato il support prima di fare questo post e un rioter  stesso mi ha invitato a creare una discussione sul forum per questo e che erano belle idee che avrebbe inoltrato al team di lol . Quindi morale della favola più si è uniti e attivi per le proprie cause e per migliorare il game anche secondo i nostri gusti più loro possono assecondarci.","replies":[]}]},{"poster":"TSM Helios","date":"2016-12-01T19:47:30.067+0000","up_votes":2,"down_votes":0,"body":"Totalmente d'accordo con quanto detto da te, mi sembra abbastanza limitativo il fatto di poter cambiare forma 2 volte a game anzichè dare la possibilità di switchare forma quando si vuole e poter 'resettare' la forma per tornare a quella base, dando la possibilità di poter combinare più elementi ogni game. Riguardo l'icone e banner profilo ben detto, ottima idea amico.","replies":[]}]}