{"poster":"xSM0k3xB1GxW33Dx","date":"2015-09-12T16:29:48.213+0000","title":"The inevitability of losing to Vlad","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":0,"body":"I assume that many of the players have already run into the champion Vladimir sometime in your normal game, solo, duo or even ranked team adventures.\r\nAs stated by the title. losing to a Vlad is easier done than said, literally, let him play safe and create a farm lane for himself, which wont work out because you&#039;re an aggressive riven player, so you just ponder on about how easy this game will be as you harass him and send him into the shadow realm with his 0/18/2 scoreline and 200 cs at 50mins in.\r\nOh you may think this game is over as the total scoreline is 62 - 21, well honey you&#039;ve got storm coming your way.\r\nPile up into a team fight and this abomination of a champion will face roll your entire team with his ultimate and q alone, this champion doesn&#039;t even need a full kit, but just to top it off give him an invulnerability for 2.5 seconds and the ability to itemize as a glass cannon but still be as tanky as your bruiser.\r\nThis post is not what has happened to me in a game, it&#039;s what has happened to several players in countless games.\r\nWhy has no one realised this champion is a mad man, put him in the hands of a Diamond player, he&#039;ll farm endlessly and rack up kills and you wont even witness a second past 20 mins, because 19 minutes into top lane and farm and he gives you this look {{champion:8}} .\r\nAnd you know you&#039;ve messed up when you forgot to ban vlad, but you had to ban every other juggernaut that riot has already buffed with the release of {{item:3053}} and {{item:3748}} .\r\nTo sum up, this is a rant (Which is not intended) about how powerful Vladimir is, and almost or on par with many of the top tier tops at the moment which will indefinitely get nerfed such as Garen, Darius, Fiora.\r\nHopefully this post draws some attention to the easily acceptable flaws as they are not played in worlds or dominating solo q as he is a bland champion in general, and people would rather cut their eyeballs with paper than play him.","replies":[{"poster":"JasonWazza","date":"2015-09-13T06:14:48.258+0000","up_votes":3,"down_votes":0,"body":"All i hear is \"i let a champ farm and now he is fed.\"","replies":[]},{"poster":"Yuriklatura","date":"2015-09-15T09:14:46.221+0000","up_votes":1,"down_votes":0,"body":"Just get better and you won't lose to Vlad 1v1. Ask for ganks, he is just as vulnerable as Nasus and scales just as hard. If your jungler is that much of a potato to not babysit your Vlad/Nasus lane early game make sure to let him know that.","replies":[]},{"poster":"The Spawn Man","date":"2015-09-13T10:40:46.291+0000","up_votes":1,"down_votes":0,"body":"Vlad annoys me no end. Whenever I verse Vlad, he never dies and kills everyone on my team. Whenever I play Vlad, I die. And die. Until we lose. I just can't figure the bugger out. :P","replies":[]},{"poster":"Talon12","date":"2015-09-13T01:52:31.579+0000","up_votes":1,"down_votes":0,"body":"I don't care, just use skills to blow him sky high before he can do anything","replies":[]},{"poster":"TeCoolMage","date":"2015-09-13T00:10:11.598+0000","up_votes":1,"down_votes":0,"body":"I play Veigar.\n\nI'm also trying out Nasus.","replies":[]}]}