{"poster":"Abasin","date":"2016-12-19T06:40:04.072+0000","title":"ARAM MMR - was mir aufgefallen ist :)","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":0,"body":"Um gleich mit der T&uuml;r ins Haus zu fallen, die ARAM MMR wird anscheinend saisonal resettet oder berechnet sich als gleitender Mittelwert &uuml;ber einen definierten Zeitraum. Oder anders. Aber auf jeden Fall wird sie nicht konserviert, wenn man l&auml;ngere Zeit nicht spielt.\r\n\r\nWie komme ich auf diesen Gedanken? Durch direkten Vergleich meiner beiden Accounts. Diesen hier spiele ich seit fast einem Jahr so gut wie exklusiv, mehrheitlich ARAM. Den anderen, meinen eigentlichen Main habe ich im vergangenen Jahr fast nie ausgepackt und gut 9 Monate in Folge kein Spiel gemacht. Aufgeh&ouml;rt habe ich mit einer ARAM-Bilanz von 185:165, also mit einer halbwegs guten Winrate. Vergangenes Wochenende habe ich ihn wieder aus der Mottenkiste gezogen und ein paar Spiele gemacht, auch ARAM. Mit interessantem Resultat. Spiel 1 hatte keiner meiner 9 Mitspieler sowas wie Runen oder Masteries, Spiel 2 lief &auml;hnlich, nur dass es jetzt beim Gegner auch einen menschlichen Mitspieler gab, wir haben uns kurz im Allchat unterhalten. Gestern abend noch ein drittes Spiel, welches genauso ausgesehen hat. Schon sehr seltsam, das Ganze.\r\nWie schon oft hier gelesen, trifft man auf Bots nur dann, wenn man eine sehr niedrige MMR hat. Da ich mir in den letzten Spielen vor der Pause eine recht hohe Siegesrate erarbeitet hatte, war ich &uuml;ber diese Konstellation dann doch erstaunt. Und ja, wer mir nicht glaubt oder immer noch der Ansicht ist, es gebe keine Bots - oder &quot;sind mir noch nie begegnet&quot; - der schaue sich die Mitspieler und Gegner der letzten 3 ARAMs von &quot;Powerjen&quot; in op.gg an. Sind ganz frisch. \r\nNur der Vollst&auml;ndigkeit halber, ich hab alle verd&auml;chtigen Summoner reported und hoffe inst&auml;ndigst, dass auch hier eine Bannwelle kommt.\r\n\r\nNur der Vollst&auml;ndigkeit halber sei gesagt, dass ich auf diesem Account nur noch h&ouml;chstens einen oder zwei Bots im Team habe, und das auch nur in jedem 10. Spiel. {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Δπσπψωσυș","date":"2016-12-19T09:14:19.544+0000","up_votes":2,"down_votes":0,"body":"Aktivität ist ein fester Bestandteil deiner MMR. Und zwar von jeder.  Darum werden auch zum Beispiel Leute, die sich in die 5te Division einer Liga spielen und dann dort nur noch Anti-Afk Spiele machen zu Season Beginn 8-10 Divisionen tiefer geplaced, um dann hier im Forum rumzuheulen, wie es denn sein kann, von Platin 5 nach Silber 4 geplaced zu werden.","replies":[{"poster":"Abasin","date":"2016-12-19T09:57:51.656+0000","up_votes":1,"down_votes":0,"body":"Das erklärt es. Aber mir war nicht klar, dass auch die MMR einem zeitlichen Verfall unterliegt. Zumal es ja nur um ARAM geht. Aber gut, wieder was gelernt.","replies":[]}]},{"poster":"Chri","date":"2016-12-19T12:32:03.423+0000","up_votes":1,"down_votes":2,"body":"Wie schafft ihr es immer gegen bots zu spieln hab 1.3k aram wins und hab noch nie gegen bots gespielt","replies":[{"poster":"Abasin","date":"2016-12-19T13:28:55.853+0000","up_votes":1,"down_votes":0,"body":"Ich will mich für Dich gerne selbst zitieren:\n\n> Und ja, wer mir nicht glaubt oder immer noch der Ansicht ist, es gebe keine Bots - oder \"sind mir noch nie begegnet\" - der schaue...\n\nNicht jedermanns ARAM MMR ist hoch genug, aber den Unterschied habe ich ja schon erwähnt...Du Glücklicher.\n\nEs geht auch nicht drum, wie das zu schaffen ist. Ich bin halt nicht so spielstark wie Du es anscheinend bist. Also treffe ich noch welche. Meine Winrate pendelt momentan knapp um die 50% für die letzten 100 ARAMs, was für einige Bots wohl kein Problem mehr ist. Aber im Kern ging es ja um den MMR-Verfall auf meinem anderen Account, der gegenüber diesem eine bessere Gesamtwinrate aufweist und der nach langer Spielpause plötzlich auf Horden von Bots trifft. Und mehr als eine Erklärung für den MMR-Verfall wollte ich nicht. Dass man mit niedriger MMR in ARAM auf Bots trifft, ist kein Geheimnis. Die wachsen schneller als Bambus.","replies":[]}]}]}