{"poster":"El Capitán TSV","date":"2016-04-14T10:52:54.358+0000","title":"Bug here, bug there, bug everywhere :)","subforum":"Melde einen Bug","up_votes":2,"down_votes":0,"body":"Mahlzeit!\r\n\r\nMir sind in letzte Zeit einige Bugs aufgefallen. Ich w&uuml;rde diese gern mal hier zusammenfassen.\r\n\r\n1. (Ich nenn ihn mal &quot;Ger&auml;usch-Bug&quot; :D)\r\nIn vielen Spielen ist es so, dass Champions skills benutzen und dabei irgendwelche Laute von sich geben. Diese Ger&auml;usche sind dann einfach das ganze Spiel &uuml;ber zu h&ouml;ren.\r\n\r\nWie z.B. Sejuani. Wenn sie ihre Q bet&auml;tigt, f&auml;ngt das Schwein immer an zu grunzen. Und dieses Grunzen ist immer zuh&ouml;ren wenn Sie in der n&auml;he ist. Kann Vor- und Nachteile haben. Abgesehen davon ist es auf Dauer echt nervig :D\r\nOder Corki. Ich h&ouml;re so oft dieses permanente Propeller- (schreibt man das so? :D)Ger&auml;usch. \r\n\r\n2. Annie-Bug\r\nGestern hatte ich ein Spiel gegen eine Annie in der Midlane. Und dann ist das schlimmste passiert, was h&auml;tte passieren k&ouml;nnen.\r\nEin Bug ist eingetreten, bei dem das Zeichen f&uuml;r den Stun bei Annie (die kleinen Kreise um sie herum) permanent zu sehen war.\r\nMan wusste also nie ob der Stun da ist oder nicht, weil es durch dem Bug immer zu sehen war. \r\nDas war die H&ouml;lle... Keiner hatte sich getraut zu engagen oder Annie anzugreifen. Weil eben keiner sicher sein konnte...\r\n\r\n3. PvP-Client \r\nIch wei&szlig; nicht ob es ein Bug ist, oder es an mir liegt...\r\nOft ist es so, dass sich nach dem Spiel einfach ein schwarzes Fenster &ouml;ffnet. Ich kann also keine Statistiken sehen, keinen Chat, kein sonst was. Ich h&ouml;re zwar Ger&auml;usche wenn Leute den Chat verlassen oder was geschrieben haben, aber sehen tue ich nichts.\r\n\r\nOder, wenn ich in die DynQ will und meine Rollen ausw&auml;hle, erscheint die Rollenauswahl in Zeitlupe. Sprich es laggt wie Sau. Ich muss dann das Spiel schlie&szlig;en und neu starten. Dann klappt alles wieder. Ist trotzdem nervig.\r\n\r\nAber wie gesagt, ich wei&szlig; nicht ob es an mir liegt oder ein Bug ist. :p\r\n\r\n\r\nDas war&#039;s soweit von mir.\r\n\r\nLieben Gru&szlig;.","replies":[{"poster":"xXDupsteptaubeXx","date":"2016-04-14T13:50:34.311+0000","up_votes":2,"down_votes":0,"body":"Das sind wahrscheinlich bugs mir ist so etwas auch oft passiert","replies":[]}]}