{"poster":"Inari Fox Orrion","date":"2017-05-13T12:46:10.538+0000","title":"Can you please not fill me elsewhere if I choose to support?","subforum":"Gameplay","up_votes":86,"down_votes":26,"body":"I&#039;ve recently been being autofilled to jungle/top/mid/ADC a lot more, despite being a support OTP and, in turn, always having it as my primary role.\n\nCan you not? Autofill exists due to a lack of support players; Don't make it worse.","replies":[{"poster":"Salron","date":"2017-05-13T15:38:29.189+0000","up_votes":52,"down_votes":7,"body":"If normal people complain about getting autofilled, they're told to learn more roles\nIf support mains complain about getting autofilled, they're upvoted\nLol.","replies":[{"poster":"Battlecast Sona","date":"2017-05-13T16:25:04.321+0000","up_votes":17,"down_votes":4,"body":"because the (supposed) reason that we have autofill at all is primarily because people don't support or try to spam roles like mid/top that are more popular... I've been autofilled out of support in a game where a mid/top laner was autofilled into support. It just doesn't make much sense.\n\nI mean, I am capable of at least 1-2 champs in other roles, but that doesn't mean  I want to trust some random autofill to support my team.","replies":[{"poster":"Salron","date":"2017-05-13T16:28:17.759+0000","up_votes":9,"down_votes":3,"body":"I get autofilled into jungle quite a bit\nSupport isn't the only role we get autofilled","replies":[{"poster":"Supreme Senpai69","date":"2017-05-13T22:13:08.047+0000","up_votes":2,"down_votes":0,"body":"I think it's more-so that Riot says autofill is because people don't want to play support. So if a support is getting auto-filled their reasoning is basically bullshit and there's no need to have auto-fill","replies":[]},{"poster":"Oelyk","date":"2017-05-14T04:09:10.601+0000","up_votes":1,"down_votes":0,"body":"I can only play Kha and Warwick. Anyone can play Warwick.\n\nJungle is my worst role.","replies":[]}]}]},{"poster":"An Enemy Sutando","date":"2017-05-13T23:54:25.193+0000","up_votes":4,"down_votes":0,"body":"A yay for double standards.","replies":[]},{"poster":"Warsame","date":"2017-05-13T20:02:55.459+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Face The Win,realm=NA,application-id=3ErqAdtq,discussion-id=4xzZz2rE,comment-id=0004,timestamp=2017-05-13T15:38:29.189+0000)\n>\n> If normal people complain about getting autofilled, they&#x27;re told to learn more roles\n> If support mains complain about getting autofilled, they&#x27;re upvoted\n> Lol.\n\nSupports cant even get autofilled lol \n\nIf you put support primary you're autofill protected, all you have to do is learn 1 secondary role","replies":[]}]},{"poster":"Limmie","date":"2017-05-13T14:45:33.666+0000","up_votes":20,"down_votes":0,"body":"I once got autofilled jungle when I queued top/mid while a teammate got autofilled top when they queued for jungle/bot. Autofill is weird like that.","replies":[{"poster":"EvanThomas","date":"2017-05-13T19:36:33.699+0000","up_votes":4,"down_votes":0,"body":"Problems like this need more attention.","replies":[]}]},{"poster":"Tobias Brackner","date":"2017-05-13T17:20:12.189+0000","up_votes":11,"down_votes":1,"body":"Learn more roles.\n\nAnd if you are getting autofilled to non-supp that's a good thing.  It means that more people are playing supp.","replies":[{"poster":"Inari Fox Orrion","date":"2017-05-13T18:44:00.098+0000","up_votes":6,"down_votes":1,"body":"That's true; It does mean that people are playing support...  but then why the hell is autofill still here? It seems to just be here, at this point, to skew matchmaking and tilt people as much as possible before being inevitably removed because it's a nexus for toxicity and matchmaking imbalance.\n\nBy the way, \"Learn more roles\" applies to people who are generally good at doing that. Some people like me have a specialized skillset; We pay attention to every detail on the minimap, but can't roam or TP-gank to save our life.","replies":[{"poster":"cocacolalips","date":"2017-05-13T23:30:33.678+0000","up_votes":2,"down_votes":0,"body":"play a solo lane support? if top players can play lulu/karma mid and top, so can you.","replies":[]},{"poster":"Tobias Brackner","date":"2017-05-14T06:45:45.239+0000","up_votes":1,"down_votes":0,"body":"Then learn to roam and TP-gank, they are valuable tools to have when you play League.  Also as already mentioned, you can play supp champs in other lanes.  Bring back Alistar top.\n\n  It's designed to make sure that all the roles are filled so we don't have people fighting over a position.  Everyone knows that if they aren't auto-fill protected then they can be assigned a random role, and everyone plays by those rules.","replies":[]}]}]},{"poster":"Anastaecia","date":"2017-05-13T15:22:03.539+0000","up_votes":9,"down_votes":0,"body":"Yea this never made sense to me.  We are low on supports, yet Rito puts support mains into other slots?","replies":[]},{"poster":"Jerry SeinfeId","date":"2017-05-13T16:10:27.903+0000","up_votes":10,"down_votes":1,"body":"LMAO, autofill isn't just there for everyone other than support. It's there for everyone.\n\nI've been \"autofilled\" to MID, ADC, Jungle and support. i say \"autofilled\" because mostly i just take fill as secondary.\n\nlet's try to not treat support mains as some special kind of player.","replies":[{"poster":"Inari Fox Orrion","date":"2017-05-13T21:56:33.323+0000","up_votes":2,"down_votes":2,"body":"I should rephrase; One of the **MAIN** reasons autofill exists is the lack of support players.","replies":[{"poster":"Jerry SeinfeId","date":"2017-05-14T01:30:08.108+0000","up_votes":3,"down_votes":1,"body":"while this is true it's more an overbearing amount of midlaners/toplaners.\n\nI remember a post from someone who did autofill only and it was mostly Supp and ADC, a bit of jungle and rarely Top/mid.\nThe problem probably isn't the support role or the support champions but the fact that you are sharing a lane with someone.\nUp next is jungle who while isolated in the jungle has to gank and interact with/ rely on people.\n\nthis is imo understandable. If i lose top i know I lost it myself, mid the same. \nif as a jungler every lane is losing it becomes hard to stay motivated.\nBotlane is the worst in this case. As an adc/support it's very much possible your \"partner\" fucks up multiple times. \n\nI  mostly take 1 role i wish to play and then fill. when i take bot + fill or even bot + supp i often get bot. and if i don't mostly jungle or support i had one rare game of mid a few days ago though.\n\n\nAutofill isn't perfect, but it certainly isn't as bad as people make it out to be. it's just easier to blame something else, everyone does it, there's nothing wrong with that.","replies":[]}]}]},{"poster":"Friendly Ram","date":"2017-05-13T14:50:53.328+0000","up_votes":3,"down_votes":0,"body":"go sup/mid it fixes most of your problems and if you get mid just play morg.","replies":[{"poster":"Inari Fox Orrion","date":"2017-05-13T14:55:19.689+0000","up_votes":4,"down_votes":1,"body":"But then what happens if you get filled Mid and are expected to do anything from roam to push to the many micro things you can't do as a support OTP?","replies":[{"poster":"5000000000000000","date":"2017-05-13T15:31:48.315+0000","up_votes":7,"down_votes":0,"body":"~~Git gud~~\nIt's generally a good idea to have an off role, though.","replies":[{"poster":"Rusty Owl","date":"2017-05-14T18:00:40.008+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=5000000000000000,realm=NA,application-id=3ErqAdtq,discussion-id=4xzZz2rE,comment-id=000100000000,timestamp=2017-05-13T15:31:48.315+0000)\n>\n> ~~Git gud~~\n> It&#x27;s generally a good idea to have an off role, though.\n\nFrom my experience a support main who can play other roles well is often better. They can react better to the actions of their teammates! (So ya Git gud)","replies":[]}]}]}]},{"poster":"Dextix LT","date":"2017-05-14T16:59:05.677+0000","up_votes":4,"down_votes":0,"body":"> Autofill exists due to a lack of support players\n> \n\nhttps://img.memesuper.com/1ffde6caa2e8013621d8ab1387d1718c_trump-wrong-3-wrong-meme-wrong-trump_250-250.jpeg","replies":[]},{"poster":"Niyumi","date":"2017-05-13T18:36:16.675+0000","up_votes":6,"down_votes":2,"body":"News flash: You don't always get the role you want. \"OTPing\" anything is the worst idea.","replies":[{"poster":"3TWarrior","date":"2017-05-14T01:04:02.055+0000","up_votes":3,"down_votes":0,"body":"several challenger players would disagree with you as well as other high ranking players","replies":[]}]},{"poster":"doiminat0r3600","date":"2017-05-13T18:47:46.728+0000","up_votes":4,"down_votes":1,"body":"Autofill doesn't exist due to a lack of support players. It was formed due to extremely long que times because of the lack of one role being filled fast enough (it happened to be support).\nThe same thing would have happened if top lane, mid lane, jungle, or ADC didn't get filled within a certain time.\n\nThe purpose was to lower que times by putting people in unpopular roles. \nIt's not very needed now because of the release of rakan has made support somewhat popular again, balancing out the que times.\n\nI've actually gone away from being a support main because I hardly got it since the rakan release. When I do play League, it's either top or jungle. I've been autofilled one time to support since the release, and this was out of ~40 games.\n\nThis is what riot says autofill is:\nhttps://boards.na.leagueoflegends.com/en/c/GD/1du4BOW9-dynamic-queue-updates\n","replies":[{"poster":"rtbf76109271","date":"2017-05-13T23:22:58.806+0000","up_votes":2,"down_votes":1,"body":"Long queue times and lack of support players is literally the same thing. Matchmaking has a bunch of 4 man groups looking for a support, but not enough people choose support to complete the teams. So people waited until there was a support player which took too long. Instead now it autofills someone to complete groups faster. \n\nThere is absolutely no lack of people playing mid and such. In fact the opposite, as per the warning in which selecting same roles increases your queue time due to them being so popular. Every time it autofills a support main role to another, it is a waste of a support queue and is totally the opposite of what helps this problem","replies":[{"poster":"doiminat0r3600","date":"2017-05-14T00:35:43.636+0000","up_votes":2,"down_votes":1,"body":"Lol. Long que times and lack of support players aren't literally the same thing. Matchmaking can't be a bunch of 4 man groups because you can't do 4 man groups since a while ago. Enough people don't choose to be flamed all game because one mistake they made in a group of friends. Nobody wants to hear \"This support is trash\" then proceed to get flamed all game. So 4 mans aren't even allowed.\n\nYou're taking my example of \"The same thing would have happened if top lane, mid lane, jungle, or ADC didn't get filled within a certain time\" too literally. I said *if*, meaning on the chance that <event> happens.\n\nIt doesn't just autofill you to a support. Clearly, otherwise OP wouldn't have made this post. \n\nIf your statement on matchmaking being a bunch of 4 mans is true, howcome throughout all the years of maining support I never was autofilled to a 4 man? How come I consistently am able to get into lobbies without any duos or trios either? \n\nIt's not only for support role. It's for all roles.","replies":[{"poster":"rtbf76109271","date":"2017-05-14T01:04:47.683+0000","up_votes":3,"down_votes":2,"body":"I'm not talking about 4 man groups queued together. I'm talking about new people queueing up, and the match maker tries to create teams. It makes a ton of 4 man groups (from solo/duo players) and is looking for a support player to create teams. \n\nIncoming players look like this\n\nadc mid mid mid top jg adc mid top jg (...) support\n\nYou end up with \n\nadc x5\nmid x7\njg x6\ntop x5\nsupport x1\n\nhow many teams can you make with this group of players queued up? ONE. Since you need a support for each team. So autofill takes some people and FORCES them to play support in order to create 5 complete teams.\n\nEvery time you take a VALUABLE support player and fill them to something else, it is hurting this problem not helping","replies":[{"poster":"doiminat0r3600","date":"2017-05-14T02:10:01.190+0000","up_votes":2,"down_votes":1,"body":"You said \n\n>Matchmaking has a bunch of 4 man groups looking for a support\n\nWhich is what I was talking about. You also just said \"4 man groupes queued together.\" This means that they are in the same que and same party.\n\nYou still don't see that it's not only for supports do you? The autofill automatically fills the missing roles.\n\nThis is what riot defines it as:\n\nIf players enter queue with excessive estimated wait times, the matchmaker will potentially assign them a role other than the two they selected.\n\nSource: https://boards.na.leagueoflegends.com/en/c/GD/1du4BOW9-dynamic-queue-updates\n\nNothing says it's only for supports.","replies":[{"poster":"rtbf76109271","date":"2017-05-14T06:05:02.671+0000","up_votes":1,"down_votes":0,"body":"You actually cant read. I am talking about match making having 4 solo or duo people, mid top jg adc together, looking for a support to complete their team. This team is made of solo and duo players. Then it autofills someone to support to complete that team, so they can play instead of sitting in queue. \n\nEVERY time i have been autofilled, it has been to support. \n\nNo it doesnt explicitly say this system is for lack of supports. Yet everyone with a brain knows it is obviously due to the lack of support.","replies":[]}]}]}]}]}]},{"poster":"lmakehersquirtle","date":"2017-05-14T17:02:06.348+0000","up_votes":2,"down_votes":0,"body":"Autofill exists whenever a roll is in demand, not because there is a lack of support players...","replies":[]},{"poster":"Psyrix","date":"2017-05-14T11:36:09.038+0000","up_votes":2,"down_votes":0,"body":"Autofill wasn't designed just cuz of the lack of supports, it was to decrease queue times.  It just happened to be that supports isnt the most popular role. Adding more supports doesn't really change the fact that some roles are a lot more popular than others,  The system sorting out for players of each specific role everytime isn't that efficient and would likely take longer. I'd say to just accept the autofill, helps you learn a new role.... and each role really gives u more experience and a better perspective of what you should/can do in ur maain role.  and anyways, can you really say you get autofilled often?","replies":[]},{"poster":"Solidarius","date":"2017-05-14T08:01:08.505+0000","up_votes":2,"down_votes":0,"body":"you have my respect for playing support main\n\nbut\n\nI think it is fair that if top/mid/jg/adc can get autofilled so SHOULD YOU!\n\nhonestly...If anyone said in my que \"I am a supp main\" who would be crazy enough not to swap with that person.\n\n<3","replies":[]},{"poster":"Flawless Fetus","date":"2017-05-14T01:56:28.619+0000","up_votes":2,"down_votes":0,"body":"Autofill exists due to lack of equal role preference across all 5 roles. Not lack of support players. Idk why people keep on pretending like autofill only, or should only, affect(s) support. If you queue support, and your team needs a jungler. You might get autofilled into jungler. It forces you to fill. Not to support. Hence the name \"autofill\" and not \"autosupport\". It's not a very complicated concept...","replies":[]},{"poster":"rtbf76109271","date":"2017-05-13T23:19:38.613+0000","up_votes":2,"down_votes":0,"body":"Their algorithm for autofilling people really needs work. I believe that every X games it just autofills you no matter what, even as support. Which is ridiculous seeing as it exists due to lack of support players. It also seems to just autofill you if you have 2 or 3 lobbies fail and you are still in queue for 5+ minutes. I once had autofill 2 times in 5 games, and both times I had lobbies fail and I stayed in queue so it felt like this was true.","replies":[]},{"poster":"Clementine","date":"2017-05-13T16:34:21.883+0000","up_votes":2,"down_votes":0,"body":"If you play support, you have autofill protection for 2 games. Seems like dishonesty to me","replies":[]},{"poster":"58697132DEL1","date":"2017-05-13T18:36:53.628+0000","up_votes":4,"down_votes":2,"body":"No autofill exists because queue times were forever and riot was like \"hurr durr well we can fix dat herr\" and everyone made it a meme that sutofill = support (yes i know not a lot of people were playing support thats why most fills put you there but thats not the primary reason it was made)\n\nSo autofill will kick in regardless of your position because they dont want people going \"OMG I HAD TO WAIT A WHOLE 2 MINUTES FOR A GAME RITO FIX UR QUEUE TIME!\" even tho most ~~smart~~ people agree it's better to wait 10 minutes to get a role you you can play vs waiting only 5 minutes and having a shit 20+ minute game because you got a shit role.\n\nOh and autofill exponentially increased dodge and troll picking, which literally counter that \"dont waste time\" bullshit. Far as im concerned, remove the damn autofill yesterday.","replies":[{"poster":"Inari Fox Orrion","date":"2017-05-13T18:41:03.733+0000","up_votes":3,"down_votes":2,"body":"But then why does it give you autofill protection if you queue and get support? It was created due to a lack of us, undeniably. My issue is that, when we try to fix the problem, we're told we can't... \n\n...only to get some dude in the next game insta-tilted because he got filled to my role unwillingly.","replies":[]}]},{"poster":"Warsame","date":"2017-05-13T20:03:39.515+0000","up_votes":1,"down_votes":0,"body":"What are you talking about, supports cant get autofilled. If you put support or fill as your primary, you get autofill protected","replies":[{"poster":"LightIsMyPath","date":"2017-05-13T20:08:03.744+0000","up_votes":2,"down_votes":1,"body":"Nope. You get protected after you play supp but let's say I queue supp/mid and get mid 3 times in a row the protection is lost and I can get autofilled","replies":[{"poster":"Warsame","date":"2017-05-13T21:05:09.175+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=LightIsMyPath,realm=EUW,application-id=3ErqAdtq,discussion-id=4xzZz2rE,comment-id=00130000,timestamp=2017-05-13T20:08:03.744+0000)\n>\n> Nope. You get protected after you play supp but let&#x27;s say I queue supp/mid and get mid 3 times in a row the protection is lost and I can get autofilled\n\nThis has literally never happened to me. That sounds incredibly uncommon","replies":[{"poster":"LightIsMyPath","date":"2017-05-14T12:29:33.814+0000","up_votes":1,"down_votes":0,"body":"It may be uncommon for support mains but for me, as mid main, it happens pretty commonly. I queue mid/support and after getting mid several times in a row I loose protection and can be autofilled in every other role randomly even having support selected as my secondary role. The other day I got autofilled jungle and our support was autofilled too. He trolled without even asking for a swap, turns out in game that he was main jungle..  I was pretty disappointed to say the least.\n\nI suppose if you queue as primary support getting secondary role enough times to break protection is more rare but definitely possible","replies":[]}]}]}]},{"poster":"Mira Arya Enthe","date":"2017-05-13T20:10:33.920+0000","up_votes":2,"down_votes":1,"body":"\"Learn to play you should know every role!\" What support mains tell the rest of us. Deal with it.","replies":[]},{"poster":"ScurryLizard","date":"2017-05-15T07:46:38.998+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure they didn't create autofill to manage the low amount of support players. Half the time it seems like junglers are really the ones in short supply. Anyway as long as you slot two roles you're comfortable with, you'll almost always have autofill protection from being a support main. If you don't _have_ a secondary role, you need to find one.","replies":[]},{"poster":"Rusty Owl","date":"2017-05-14T17:57:32.913+0000","up_votes":1,"down_votes":0,"body":"Riots Goal was to have more support players and make the role more apeeling. They still have a way to go but it is still a lot better then it was. So this is but only normal to have more people play support at this point. I'm a support main and honestly if you want to survive past silver you need to learn a couple other champs in other lanes if only to understand more the role. Exemple by playing more Top I understand more the presure behind the role and gaging my {{summoner:12}}. With that experience it makes me a better support player because I can react better to my top lanner's actions. If anything I hate support mains (Or any other lane mains) that have no real understanding of how different roles work. By playing a fair amount of other roles you undertand better what to expect from your teammates when playing your main role.","replies":[]},{"poster":"Wtf that champ","date":"2017-05-13T20:15:40.686+0000","up_votes":1,"down_votes":1,"body":"And Im Top OTP and I need play support sometimes. Why can i do? Nothing. So why u can't play other lane sometimes? I dont get peoples like u. \nPlayers need to don't think about support like about \"other\" \"secondary\" role.","replies":[{"poster":"LightIsMyPath","date":"2017-05-14T12:31:42.545+0000","up_votes":1,"down_votes":0,"body":"The problem is when you get an autofilled support main in a lobby chances are the guy in the support spot is autofilled too.. Which is pretty bullshit","replies":[]}]},{"poster":"AbyssionKnight","date":"2017-05-14T09:18:18.248+0000","up_votes":1,"down_votes":0,"body":"I feel your pain, but at the same time at least you have role selection. Back in my day all this stuff didn't exist, and you just typed your role in chat and hoped no one else wanted that role. If they did want it then you had to hope you picked  before them, and if you did pick first you then had to hope they wouldn't also pick your role out of spite, making  you either share the lane, or one of you go fill the missing role with a champ not suited for the position.  \n\nThat's how things used to be, so while I understand your position, I think you're overreacting a  bit.","replies":[]},{"poster":"Dusk Mane Rengar","date":"2017-05-14T08:23:44.996+0000","up_votes":1,"down_votes":0,"body":"Then i dont want to be filled when i choose jungle.","replies":[]},{"poster":"brad","date":"2017-05-14T03:21:27.604+0000","up_votes":1,"down_votes":0,"body":"you literally can't get auto-filled if you queue as primary support, so take your secondary role off of fill, and you won't ever have to jungle again\n\nI put support/mid and I never get anything other than those two roles","replies":[]}]}