{"poster":"TT  GoDLike","date":"2018-07-09T09:56:51.188+0000","title":"Coach sucht High-Elo Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo zusammen, \r\n\r\nich bin auf der Suche nach einem High-Elo Team was vor hat etwas zu erreichen. Ich war bereits als Coach in mehreren kleineren Teams t&auml;tig und m&ouml;chte mich jetzt an was gro&szlig;es wagen womit man gemeinsam was erreichen hat. Gro&szlig;e Turniere LOL Division 2 sind vorerst das Ziel. Ich selbst spiele auch League und befinde mich im Diamond Bereich. Ich besch&auml;ftige mich viel mit League, den aktuellen Patches der Meta und nehme mir sehr viel Zeit als Coach. Zudem versuche ich stetig neue Strategien zu entwickeln um gegnerische Teams zu &uuml;berrumpeln und &uuml;berraschen. Ich w&uuml;rde mich sehr freuen wenn ein Team sich bei mir meldet da ich derzeit Teamlos bin und wieder Coachen m&ouml;chte. \r\n\r\n\r\nNoch als Anmerkung zu mir ich bin 22 Jahre jung und bringe viel Zeit mit!","replies":[{"poster":"FeS Equinox","date":"2018-07-10T10:42:28.779+0000","up_votes":1,"down_votes":0,"body":"Mahlzeit,\n\nohne Deine spezifische Erfahrung oder Referenzen zu kennen, machst Du es einer eSports Organisation nicht leicht, zu entscheiden, ob Interesse an Deinen Fähigkeiten besteht, insbesondere weil Du schreibst, Du warst Coach in mehreren \"kleineren Teams\"; Was stellt man sich darunter vor? Alles etwas schwammig.\n\nNehmen wir mal an, Du hast schon Mal irgendwo in Platin+ gecoached und bist nun ambitioniert, an Deinen Fähigkeiten zu arbeiten, Zeit zu investieren, Ziele zu erreichen. In diesem Fall haben wir ein Team im Elo-Bereich von D2-D5 für Dich - mit vernünftigen Peaks bis D1/Master -, das derzeit einen erfahrenen Coach aus der UK hat und **Unterstützung** für den Staff-Bereich in Erwägung ziehen könnte. Neben Zeitinvestition sind Teamgeist und gute Englischkenntnisse gefragt.\n\nDu entscheidest frei, ob Dich meine Worte ansprechen. Meinen Beitrag verstehe bitte als Möglichkeit zu einem Gespräch, nicht als Angebot, denn leider fehlen mir Referenzen und ein gutes dutzend Informationen in Deinem Beitrag. Du erreichst uns über die Homepage (https://fenris-esports.com/contact/) oder direkt per E-Mail unter \"management@fenris-esports.com\". Falls wir nicht voneinander hören, wünsche ich Dir viel Erfolg für Dein Vorhaben.\n\nLiebe Grüße,\nChristian \"Equinox\" Böker\nCEO Fenris eSports","replies":[]},{"poster":"ZivaDiNozzoDavid","date":"2018-07-09T10:16:48.992+0000","up_votes":1,"down_votes":0,"body":"Guten Tag, \nwir die Community Legacy Global Esports sind auf der Suche nach Coaches.\nMomentan haben wir auch ein Dia-Team, dass einen Coach sucht.\nBei Interesse komm doch einfach mal auf unseren Teamspeak Server : ty.legacy-global.de\nund spreche mozuki/toby an oder Nefe/Mimi, sie ist die Leitung des Teams, die einen Coach suchen, an :)\n\nLG\nZiva, Leitung der Memberbetreuung :)","replies":[{"poster":"TT  GoDLike","date":"2018-07-09T11:58:31.713+0000","up_votes":1,"down_votes":0,"body":"Verbindung zum Server fehlgeschlagen","replies":[{"poster":"ZivaDiNozzoDavid","date":"2018-07-09T12:00:22.242+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chall3ng3rInc,realm=EUW,application-id=ElKI1ocy,discussion-id=r2qAbEtQ,comment-id=00010000,timestamp=2018-07-09T11:58:31.713+0000)\n>\n> Verbindung zum Server fehlgeschlagen\n\nVerzeihung muss auch ts.legacy-global.de heißen","replies":[]}]}]},{"poster":"Nedca","date":"2018-07-09T10:15:30.025+0000","up_votes":1,"down_votes":0,"body":"ab was ist denn bei dir high-elo? :)","replies":[{"poster":"TT  GoDLike","date":"2018-07-09T11:55:37.683+0000","up_votes":1,"down_votes":0,"body":"dia 3+","replies":[]}]}]}