{"poster":"GermanyCallsGG","date":"2017-07-26T12:51:15.544+0000","title":"ADC sucht Supporter","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey Boys and Girls,\r\n\r\nich suche nen vern&uuml;nftigen Main Support der mindestens silber 5 ist, lieber aber h&ouml;her um hoch zu kommen.\r\n\r\nIch bin Main ADC und Silber 5 allerdings spricht meine KDA da von einer anderen Elo, Problem im Late fehlt die Protection.\r\n\r\nBei Interesse einfach Yasuhira Senpai adden. \r\nDankesch&ouml;n","replies":[{"poster":"Jιnxed","date":"2017-07-26T15:27:16.802+0000","up_votes":4,"down_votes":0,"body":"Hey Boy,\n\nDeine KDA spricht nicht von einer höheren Elo, da: \n1. KDA keinen Zusammenhang mit Elo besitzt.\nUnd 2. habe ich mir dein OP.GG Profil mal angesehen, und eine 2er KDA auf fast jedem Champion spricht definitiv nicht dafür, dass du den Champion beherrschst. \nUnd zu deinem Problem: \"Im Late fehlt die Protection.\", kann ich nur sagen, dass in deinem Late wahrscheinlich das Positioning fehlt. Ein guter ADC braucht keine Protection, um nicht zu sterben oder um Schaden zu machen. Schaue auf dich selbst und verbessere deine eigenen Fehler, dann steigst du auch alleine auf.\n\nLiebe Grüße, ein ADC Main. ;)\nDanke für Ihre Aufmerksamkeit! {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Alolan Snorlax","date":"2017-07-26T16:29:00.078+0000","up_votes":1,"down_votes":0,"body":"Du bist Silber V mit extreeeem vielen Games, das ist nicht böse gemeint, aber du solltest dich lieber nach einem Mate auf deinem Level umschauen und auf dich selbst achten. Bei der Anzahl an Games bist du derzeit genau da wo du hingehörst. \nVersuche mehr auf dich zu achten und deine Fehler auszumerzen und es wird, egal ob mit oder ohne Duo Mate von alleine voran gehen.\nEine KDA ist generell niemals ein Punkt um eine angeblich verdiente höhere Elo zu rechtfertigen. Spielst du besser gewinnst du mehr, gewinnst du mehr kommst du dort an wo du hingehörst :-)\nVersuche mehr dich selbst zu reflektieren und viel Erfolg beim Climben!","replies":[]}]}