{"poster":"VaIhaIIaGuardian","date":"2016-02-09T21:20:25.408+0000","title":"La splash art di Blood Moon Yasuo è sbagliata!","subforum":"Discussioni generali","embed":{"description":null,"url":"http://a.disquscdn.com/uploads/mediaembed/images/3184/9147/original.jpg","image":null},"up_votes":6,"down_votes":3,"body":"Come potete vedere nell&#039;immagine il fodero della katana di Yasuo &egrave; mostrato col dorso della lama verso l&#039;alto e la lama verso il basso, ed &egrave; un terribile errore! I Samurai tenevano le lame delle loro spade rivolte verso l&#039;alto facendo in modo da far scorrere il dorso della lama sul fodero mentre le estraevano cos&igrave; da non intaccarne la lama. Spero il post sia utile per aggiornare la splash art prima dell&#039;uscita della skin :)","replies":[{"poster":"BrattishSolid6","date":"2016-02-09T21:36:41.969+0000","up_votes":9,"down_votes":1,"body":"Momento momento momento.\nTu stai parlando dei samurai giapponesi probabilmente, che non hanno nulla a che fare coi samurai di Ionia. Hanno storie diverse, abitudini diverse, vivono in universi diversi, probabilmente leggono anche periodici diversi.\n\nScherzi a parte, è una bella pillola di cultura. Non penso purtroppo che la cambieranno. Ma è davvero una bella segnalazione, mi hai insegnato qualcosa di nuovo ^^","replies":[{"poster":"VaIhaIIaGuardian","date":"2016-02-09T22:06:13.628+0000","up_votes":3,"down_votes":1,"body":"Felice di averti aiutato xD","replies":[]}]},{"poster":"DonCavallo","date":"2016-02-10T17:10:12.980+0000","up_votes":2,"down_votes":0,"body":"Precisazioni: \n- in guerra invertivano quanto tu hai detto poichè, essendo i samurai primariamente guerrieri a cavallo, per poter estrarre e tagliare (iai antelitteram) un nemico quasi sempre appiedato, conveniva avere il filo verso il basso\n- in tempo di pace filo verso l'alto come dici tu (a bersagliare petto e gola), ma nell'effettuare il taglio il filo si girava di 180° verso sinistra, la lama risultava quindi parallela al terreno, col filo all'esterno. Più o meno simile all'immagine (magari gli è sfuggito di mano) XD","replies":[{"poster":"VaIhaIIaGuardian","date":"2016-02-12T15:46:39.226+0000","up_votes":1,"down_votes":0,"body":"Ah non lo sapevo di quello a cavallo, grazie! Comunque si girava di 90°, è impossibile girare di 180° a sinistra a meno che tu non abbia il filo verso di te :v Comunque quello di cui parli credo sia la stessa tecnica che ho descritto nel messaggio in risposta a ubercodlegend200 (dovrebbe essere lo Iaido)","replies":[{"poster":"DonCavallo","date":"2016-02-12T18:51:15.919+0000","up_votes":1,"down_votes":0,"body":"Sono stato pirla a scrivere 180... Non so che  cazzo avevo in testa, si era 90° \nXD","replies":[]}]}]},{"poster":"ubercodlegend200","date":"2016-02-09T21:49:02.219+0000","up_votes":1,"down_votes":1,"body":"Se per questo i samurai non andavano nemmeno in giro con maschere e capelli rossi lunghi un paio di metri","replies":[{"poster":"VaIhaIIaGuardian","date":"2016-02-09T22:14:08.797+0000","up_votes":2,"down_votes":0,"body":"Beh ma maschere e capelli colorati possono essere preferenze personali, mentre tenere una katana con la lama verso il basso è pura stupidaggine :)\nSoprattutto perché le katane puntano tutto sull'efficacia della lama in quanto venivano fatte con materiali piuttosto scadenti e quindi si potevano spezzare facilmente, anche perché erano lame lunghe e sottili, quindi la base della tecnica erano affondi e fendenti veloci, e anche sfoderare la spada risulta come un colpo, tenendo la lama verso l'alto per poi sfoderarla ruotando la katana verso sinistra, in modo da sfoderare la lama esternamente a mo' di fendente. Con la lama verso il basso ciò non può essere fatto, inoltre ogni volta che si andrà a toglierla dal fodero la lama striscerà sul fondo perdendo il filo :)","replies":[]}]},{"poster":"Giunco171","date":"2016-02-09T21:23:35.233+0000","up_votes":2,"down_votes":2,"body":"Esiste blood moon yasuo?","replies":[{"poster":"VaIhaIIaGuardian","date":"2016-02-09T21:29:13.384+0000","up_votes":2,"down_votes":2,"body":"Tu che dici? xD","replies":[{"poster":"BrattishSolid6","date":"2016-02-09T21:37:04.635+0000","up_votes":2,"down_votes":1,"body":"http://www.surrenderat20.net/2016/02/29-pbe-update.html","replies":[{"poster":"Giunco171","date":"2016-02-09T21:45:40.062+0000","up_votes":2,"down_votes":1,"body":"Grazie","replies":[]}]}]}]}]}