{"poster":"Laugh a while","date":"2016-10-26T22:26:17.491+0000","title":"Graves vs Rammus Bug","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Hallo, also ich denke mal das es offensichtlich ein bug ist.\r\n\r\nIch Rammus, Items: Thornmail, Ninja Tabi und Hextech gunblade.\r\nEr Graves, Statiks stich, Phantomdancer, Vampirisches zepter.\r\n\r\nMeine r&uuml;stungswerte wahren mit der W auf etwa 400 r&uuml;stung.\r\nGraves greift mich an und sein krittischer treffe f&uuml;gte mir bei einer kugel 66 schaden zu.\r\nEr greift mich 3 mal an und  ich bin tot.\r\nIch habe zu dem zeitpunkt volles leben, und hatte 1500 leben.\r\n\r\nWie ist das m&ouml;glich?\r\nIst meine anzeige verbuggt, stimmt etwas nicht mit graves oder mit rammus nicht?\r\n\r\nIch konnte mich nichteinmal heilen mit der Passiven von Hextechgunblade, und graves hat auch keinen schaden genommen.\r\nUnd zwar wirklich 0 schaden, er war full life und ich auch, nach 3 auto attacks bin ich bin, bei 66 crit damage....!\r\nBeantwortet mir bitte diese frage.\r\ndanke.","replies":[{"poster":"Balmung","date":"2016-10-26T23:15:56.502+0000","up_votes":1,"down_votes":0,"body":"66 Dmg pro Kugel? Macht 66*5 + ~190=520 Dmg pro Autoattack.\n\nEine Kugel macht immer vollen Dmg, der Rest abhängig von der ersten. Bei Crits fliegen 6 Kugeln.\n\nGrobe Überschlagsrechnung - da noch 'nen Q und Statikks-Proc rein und deine 1.5k HP sind in 3 Hits mehr als locker möglich.\n\nJa, Graves schmerzt ziemlich wenn man sich mitten in ihn platziert.","replies":[{"poster":"Laugh a while","date":"2016-10-27T01:16:20.371+0000","up_votes":1,"down_votes":0,"body":"Naja, ich hatte thornmail was mir nur durch thornmail 40 schaden machen lässt.\nRammus W Macht auf stufe 5 65+10% rüstumg was 105 schaden sind.\n\nEinkommender schaden waren pro kugel also 66 schaden.\nPro Auto attack macht er 6 kugeln.\nWas pro auto attack 396 schaden macht, wovon 15% Schaden zurückgeworden werden, +25% rüstung + 65+10% rüstung = 265 Schaden ist.\nWie kann es sein das graves am ende noch volles leben hatte wenn er über 3 auto attacks 795 schaden erhalten hat, wovon ich mir sogar noch 15% geheilt habe. Leben wiederhergestellt wurde somit 120 Leben. Wie konnte ich also sterben?\nDer auto Attack Damage von mir nicht mit eingerechnet!","replies":[{"poster":"Balmung","date":"2016-10-27T16:41:27.950+0000","up_votes":1,"down_votes":0,"body":"Also geht's dir mehr um den mangelnden Reflect von Thornmail/deiner W?\n\nUnd wie oben drin steht: Eine Kugel von Graves macht immer 100% Dmg, was 3x der Dmg der restlichen Kugeln ist. Ergo 66*5+66*3=528 und nicht 396.\n\nDabei muss man bedenken das Thornmail vor Reduktionen seinen Dmg berechnet, ergo sind ~300 Dmg pro Autoattack auf Graves denkbar - vor seiner MR. Nach ~100 MR sind wir bei ~150 Dmg auf ihm, was durch seinen Lifesteal locker rein kommt.\n\nErgo noch immer: Stell dich nicht zu Graves in's Melee. Der Champ ist absurd auf kurzer Range. Und Gunblade auf Rammus ist so ne Sache,,,","replies":[]}]}]},{"poster":"Busty Botter","date":"2016-10-26T22:53:39.014+0000","up_votes":1,"down_votes":0,"body":"Ja bei nem Gunblade auf Rammus lach ich wirklich ne Weile...\n\nBtw. Graves macht umso mehr Schaden umso näher du bist, er hat ja ne Pumpgun und die streut nicht nur optisch.","replies":[{"poster":"Laugh a while","date":"2016-10-27T01:18:23.270+0000","up_votes":1,"down_votes":0,"body":"Gegen den Olaf konnte ich das Gunblade perfekt nutzten, Olafs angriffe haben mich sogar noch geheilt ^^\nHat darin geendet das er wann immer ich in seiner nähe war die ulti rausgeworfen wurde xD","replies":[]}]}]}