{"poster":"Siempre DU0","date":"2019-06-14T00:22:10.538+0000","title":"Se busca top elo platino/oro alto para roster amateur","subforum":"Reclutamiento","up_votes":2,"down_votes":0,"body":"Presentacion: Buenas que tal? Me presento, mi nombre es Rodrigo, soy capitán y coach del equipo WhiteTigers/LosSinNombre.\n\nSobre nosotros: Es un proyecto que ya lleva más de 4 meses de vida, apuntando a torneos como liga fox o ga4lol, somos un team elo platino, con jugadores ex diamantes que están volviendo de a poco a jugar LOL.\n\nQue buscamos?: buscamos un MAIN TOP, xq en mayúscula? Xq hemos tenido e intentado probar con gente que mainea otro rol, que hace el reroll a top, y no nos ha ido tan bien, por eso es excluyente conocer la línea y saber jugar variedad de campeones!\n\nQue exigimos como persona?: principalmente el respeto hacia los compañeros, dentro y fuera de la grieta, así como el poder de aceptación de críticas constructivas de parte del team, al igual que el saber escuchar ya que todo lo que se diga será en forma de enseñanza para hacer que sigas creciendo como player, y sobre todo compromiso con el proyecto!\n\nQue exigimos como player?: tener una champool variada, saber jugar varios champs (bruisers, magos, tanques, split etc), Tener un elo platino/oro 2+ y entender como funciona tu rol dentro de cada partida.\nEn caso de no saber algo de lo anterior se explicara y enseñará!\n\nQue ofrecemos? Principalmente crecer como player, ya que por ahora no tenemos ningún ingreso más aya de algún RP ganado en torneos, pero con miras a furuto, la liga fox tiene premios en efectivo, y es a donde apuntamos...\n\nHorarios: jugamos desde las 20hrs Argentina hasta las 22:30 aprox, con un lapso de 20/30 minutos para comer en el medio, pero se puede adaptar a las necesidades de cada player.\n\nEs necesario: una buena coneccion, discord y micrófono, también wsp que es por ahí donde coordinamos todo.\n\nSin más que agregar te agradezco tu tiempo al leer todo, y si estas dispuesto a probar suerte y estas motivado con la propuesta, te invito a dejar un comentario o agregarme ingame con este mismo nombre \"R0driih S2\" sin las comillas.\n\nSaludos y nos vemos en la grieta!","replies":[{"poster":"Auren Seven","date":"2019-06-16T02:55:10.909+0000","up_votes":1,"down_votes":0,"body":"Hola, ya encontraron Top? Me interesaria sumarme. Maineo top y tengo una champion pool bastante grande. Mi elo actualmente es Platino 4 en Solo Q y Platino 1 en Flex.","replies":[{"poster":"Siempre DU0","date":"2019-06-16T05:06:03.440+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Auren Seven,realm=LAS,application-id=z7ypWKrA,discussion-id=jFaVnHti,comment-id=0001,timestamp=2019-06-16T02:55:10.909+0000)\n>\n> Hola, ya encontraron Top? Me interesaria sumarme. Maineo top y tengo una champion pool bastante grande. Mi elo actualmente es Platino 4 en Solo Q y Platino 1 en Flex.\n\nte agrego y charlamos bro!","replies":[]}]},{"poster":"BCG Minemon","date":"2019-06-14T00:24:54.151+0000","up_votes":1,"down_votes":0,"body":"Info :\nTOP LANER\nPLATINO 1 (FLEX) PLATINO 4 (SOLOQ)\nBuena pool de champs\nExperiencia como caller o co-caller\nNick : Minemon","replies":[{"poster":"Siempre DU0","date":"2019-06-14T00:30:13.336+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Minemon,realm=LAS,application-id=z7ypWKrA,discussion-id=jFaVnHti,comment-id=0000,timestamp=2019-06-14T00:24:54.151+0000)\n>\n> Info :\n> TOP LANER\n> PLATINO 1 (FLEX) PLATINO 4 (SOLOQ)\n> Buena pool de champs\n> Experiencia como caller o co-caller\n> Nick : Minemon\n\nte agrego y charlamos bro!","replies":[]}]}]}