{"poster":"Malicious Metal","date":"2017-03-22T00:01:13.205+0000","title":"I know he's on the VGU list...","subforum":"Story, Art, & Sound","up_votes":62,"down_votes":10,"body":"But Mordekaiser could **really** use a Dreadnova skin!\r\nAll his other skins are either different spins on the armoured fantasy warlord (Be it dragon themed, demonic or whatnot) or Pentakill.\r\n\r\nWhat he lacks in his skin catalog is something Mechanic and Sci-fi!\r\nSomething intimidating that reeks of metal and power!\r\nhe could just be Dreadnova&#039;s Darth Vader...\r\n\r\nOr, well..\r\nSpace Lord Leoric!\r\nhttp://media.blizzard.com/heroes/images/media/wallpaper/space-lord-leoric_twitter.jpg","replies":[{"poster":"Blood Magicks","date":"2017-03-22T00:28:43.168+0000","up_votes":4,"down_votes":6,"body":"How many months ahead do you plan your daily Mordekaiser threads?\n\nIf I pay you, will you put daily Vlad (or Vlad x Vayne) threads on your schedule?\n\nPles.\n\nhttp://imgur.com/aSh38Tt.jpg","replies":[{"poster":"Malicious Metal","date":"2017-03-22T00:35:02.812+0000","up_votes":10,"down_votes":1,"body":"I planned them in a millenia long past...\nSimpler times back then.\n\nI'd do that, since I accept the souls of the damned as currency and soul-stealers have more than enough tormented souls to share.\nhttps://68.media.tumblr.com/c5ef5e57b7af89963b37c8ad0506f941/tumblr_nx3falp6481ukyxlgo1_540.jpg","replies":[{"poster":"Legacy Hydralpha","date":"2017-03-22T01:40:48.328+0000","up_votes":7,"down_votes":0,"body":"You accept souls of the damned as currency?\nhttps://articles.pvplive.net/article_images/wp-galio-gatekeeper-logo.jpg","replies":[{"poster":"Mhihnj","date":"2017-03-22T13:55:27.725+0000","up_votes":13,"down_votes":0,"body":"{{champion:412}} : welcome to the bank. How may I serve you?","replies":[{"poster":"crippler38","date":"2017-03-22T15:36:39.516+0000","up_votes":12,"down_votes":0,"body":"{{champion:236}} I'd like to make a withdrawl.","replies":[{"poster":"Velzard of Koz","date":"2017-03-22T15:57:44.230+0000","up_votes":3,"down_votes":1,"body":"{{champion:412}} Fine, just hand me your permit A 38.","replies":[{"poster":"crippler38","date":"2017-03-22T19:53:16.403+0000","up_votes":3,"down_votes":0,"body":"{{champion:236}} It's my wife and I want her now! You didn't ask the guy in front of me for his permit whatever!\n\nthis place is racist! I demand to speak to your manager!","replies":[{"poster":"BladeSingularity","date":"2017-03-23T02:08:55.956+0000","up_votes":1,"down_votes":0,"body":"{{champion:203}} _Now, Thresh, just give him the soul ..._ **before I decide to chase YOU!**","replies":[{"poster":"crippler38","date":"2017-03-23T03:32:21.026+0000","up_votes":1,"down_votes":0,"body":"{{champion:236}} *stares at that white booty* yeah give me my wife!","replies":[{"poster":"BladeSingularity","date":"2017-03-24T00:15:26.206+0000","up_votes":1,"down_votes":0,"body":"{{champion:203}} **Nice try, human.  I saw you.  But we will help.**  _It seems that Thresh has ... decided to go absent without leave, if that is the correct phrase._","replies":[{"poster":"crippler38","date":"2017-03-24T00:21:40.644+0000","up_votes":1,"down_votes":0,"body":"{{champion:236}} he always does this when I ask for my wife's soul back, terrible service really.","replies":[{"poster":"Axle the Beast","date":"2017-03-24T02:27:15.729+0000","up_votes":1,"down_votes":0,"body":"{{champion:412}} That's because it's not my fault that I have a high wifesteal stat. You're just discriminating against my condition.\n\nUnfortunately I wasn't born a sociopath but developed that by torturing like, mirrors 'n crap so... well let's just keep this on-topic.","replies":[{"poster":"crippler38","date":"2017-03-24T02:44:03.903+0000","up_votes":1,"down_votes":0,"body":"{{champion:236}} here's my form *puts down first gun* and here's my wife's *puts down second gun on the table*\n\nnow give me  back my wife.","replies":[{"poster":"Axle the Beast","date":"2017-03-24T03:11:42.051+0000","up_votes":2,"down_votes":0,"body":"{{champion:412}} *Reaches into lantern and rummages through it before pausing* What did your wife look like again? She didn't look exactly like my wife did she?","replies":[]},{"poster":"crippler38","date":"2017-03-24T09:51:18.706+0000","up_votes":1,"down_votes":0,"body":"{{champion:236}} You have a wife? You're a soulless creature with no human traits left- no she can't possibly look like your wife that'd be like marrying a fire with hooks hanging from it- the monster hunter I was hunting alongside of, she used this gun. *holds up second gun*","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Blood Magicks","date":"2017-03-22T00:38:36.946+0000","up_votes":2,"down_votes":0,"body":"Hired. Starting next Monday.","replies":[]}]}]},{"poster":"rtbf225618241","date":"2017-03-22T07:24:00.118+0000","up_votes":4,"down_votes":0,"body":"I think you need to stop pressing for pre-rework skins, because they ain't happening. It's highly impractical.\n\nPS:It seems your prayer for Mad Max skins got answered with the Darius one.","replies":[]},{"poster":"Forhonor321","date":"2017-03-22T01:20:21.372+0000","up_votes":2,"down_votes":1,"body":"Hell I think this is a great idea. Just so long as they don't make him a Loot Exclusive LIKE THE **NEW DARIUS SKIN!!!!!!!!!!** (Seriously who even tries to get those anymore? The system is just stupid)","replies":[{"poster":"Meep Man","date":"2017-03-22T01:47:01.052+0000","up_votes":4,"down_votes":0,"body":"On the other hand, having one of those skins is probably more exclusive than having an ultimate skin","replies":[{"poster":"Forhonor321","date":"2017-03-22T02:00:30.789+0000","up_votes":2,"down_votes":1,"body":"If by exclusive you mean spending hundreds of dollars more than an ultimate skin, in an RNG based system that has an extremely rare chance of dropping just 1 of 10 of the same components to craft the damn thing, then yes it would be more exclusive. \n\nBut honestly, I'd rather spend $50 of RP to get an ultimate skin + possibly a few other cheap/ on sale skins than spend $200+ in said system just to get a single damn gem to try and get a skin that looks like it's worth 1350!","replies":[{"poster":"macromite","date":"2017-03-22T08:55:12.214+0000","up_votes":1,"down_votes":2,"body":"I have gotten both loot skins for free*. now stop whining.\n\n*Thinking about it I actually bought a few keys and boxes. but not more than ten dollars worth.","replies":[{"poster":"Melledoneus","date":"2017-03-22T14:03:24.065+0000","up_votes":1,"down_votes":0,"body":"Then it's not free.","replies":[{"poster":"macromite","date":"2017-03-22T14:15:49.691+0000","up_votes":1,"down_votes":0,"body":"got at most a gem from bought chests. A gem. one. out of twenty.","replies":[{"poster":"Melledoneus","date":"2017-03-22T14:41:29.910+0000","up_votes":2,"down_votes":0,"body":"I paid a dollar. I had a $19 coupon for groceries and it came out to be $20. Even in that situation, it's still not free.","replies":[{"poster":"macromite","date":"2017-03-22T16:50:01.975+0000","up_votes":1,"down_votes":0,"body":"poor example.\n\nMore like once every few days someone may or may not come to your house with a thing, you need twenty things, one day you pay the man to give you the thing, and he does. but that does not mean that the other times were not free things.","replies":[]}]}]}]}]},{"poster":"BIAKaboose","date":"2017-03-23T01:45:31.348+0000","up_votes":1,"down_votes":0,"body":"Literally never put money into Hextech Crafting, have 4 gems, will continue never putting money into Hextech Crafting, will eventually get 10 gems assuming I play long enough. I was actually kind of salty because I don't like Annie or Vayne and until now there was not a skin that I could get via gemstones that I would actually ever use.\n\nYou can also get the skin as a shard out of the free chests, and make it permanent using the resources you get from the free chests. There is no money requirement on Hextech Crafting, people are just addicted to online gambling in the form of unboxing loot in games so they are willing to spend hundreds of dollars fueling their addiction like most people do with alcohol or tobacco.","replies":[{"poster":"Forhonor321","date":"2017-03-23T03:50:16.762+0000","up_votes":1,"down_votes":0,"body":"> You can also get the skin as a shard out of the free chests, and make it permanent using the resources you get from the free chests.\n\nThis I'm fairly aware of and would highly love it if this could happen to me, but as far as my knowledge goes it's still as rare as the gemstones and even then you're still trying to rely on an RNG based system to drop you that shared where you also have high chances of getting champion shards which are pretty much useless since more than likely anyone playing this game for more than 2 years will have earned almost gained ever single champ so far (whether through RP, IP or even the crafting system already) as well as any other skin shard.\n\nYeah I don't have to spend money on this but honestly it feels like that's the only way I'm ever going to have a chance of getting this skin, since key fragment drops aren't super common and trying to earn S rank on champs isn't always going to be easy or clear, let alone having the stupid rule of waiting a number of days before you can get another chest through getting S ranks.","replies":[]}]}]}]},{"poster":"Sexy Jack Rabbit","date":"2017-03-22T04:23:43.316+0000","up_votes":1,"down_votes":0,"body":"People don't really understand the system. \nThese skins are given to champions who already have a tonne of Quality skins.\n\nAnnie was given the first one because everyone and their mum at least has one of Annie's other 9 skins. \nVayne got the second one because again, she's insanely popular and anyone who actually plays her is going to have at least one of her 6 other skins, + 3 Chromas. \nDarius has 3 skins with new VFX already, + 2 remodels + 8 Chromas, and once again, he's insanely popular. \n\nYou're really not missing out on much by not having that one skin for that one champion, because they have tonnes of other options available. ","replies":[]}]},{"poster":"Elikain","date":"2017-03-22T19:11:57.990+0000","up_votes":1,"down_votes":0,"body":"I've been meaning to ask you this MM, how do you play Morde nowadays?\nWhat kind of a builds, runes, masteries do you use? Can he work as a bot/mid laner or do you strictly play him top?","replies":[{"poster":"Malicious Metal","date":"2017-03-22T19:20:55.722+0000","up_votes":2,"down_votes":0,"body":"I usually play him top or mid, sometimes bot, IF i have a premade support^^\n\nBut, if you need some reference, here ya go. Just ask if you need anything specific.\nhttps://s23.postimg.org/ekdl72xd7/rustymorde.jpg\n\nhttps://s30.postimg.org/jmbwiwu6p/mordermastery.jpg\n\nhttps://s17.postimg.org/w7gs8bwrj/morderune.jpg","replies":[]}]},{"poster":"Mordepool","date":"2017-03-22T05:15:52.854+0000","up_votes":2,"down_votes":0,"body":"Still waiting for Mordekaiser to join Viegar and Blitzcrank in the Boss skin line","replies":[]},{"poster":"Mcloved","date":"2017-03-22T00:46:58.362+0000","up_votes":1,"down_votes":0,"body":"im not gonna lie i think think this would be awesome, however we should get him an tyrant of the galaxy skin( kinda like veigar and blitz's skins that where their arcade skin but where the villains....","replies":[{"poster":"Malicious Metal","date":"2017-03-22T00:48:27.084+0000","up_votes":2,"down_votes":1,"body":"Of course he'd be the big baddie.\nHe'd be a space conqueror like, and I'm not making that name up, Lord Dominator!\nhttp://vignette3.wikia.nocookie.net/legendsofthemultiuniverse/images/5/5b/Hater%27s_perspective_of_Dominator_(1).jpg/revision/latest?cb=20151004155749","replies":[{"poster":"Ravenous Howls","date":"2017-03-22T17:41:04.068+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Malicious Metal,realm=EUW,application-id=6kFXY1kR,discussion-id=MGj48Ntn,comment-id=00040000,timestamp=2017-03-22T00:48:27.084+0000)\n>\n> Of course he&#x27;d be the big baddie.\n> He&#x27;d be a space conqueror like, and I&#x27;m not making that name up, Lord Dominator!\n> http://vignette3.wikia.nocookie.net/legendsofthemultiuniverse/images/5/5b/Hater%27s_perspective_of_Dominator_(1).jpg/revision/latest?cb=20151004155749\n\nIf he's going to be a space conqueror then we need to have his pick or intro song be Space Lord by Monster Magnet. Just saying... =)\n\nhttps://www.youtube.com/watch?v=dscfeQOMuGw\n","replies":[]},{"poster":"AninLegions777","date":"2017-03-22T16:33:37.148+0000","up_votes":1,"down_votes":0,"body":"Was that from S. Jack?","replies":[]}]}]},{"poster":"xXRaichopXx","date":"2017-03-22T00:02:54.017+0000","up_votes":1,"down_votes":0,"body":"Doesn't fix the fact that he is bad.\n\n\n\nEdit: WTF 50% win rate top","replies":[{"poster":"Malicious Metal","date":"2017-03-22T00:05:06.893+0000","up_votes":2,"down_votes":1,"body":"https://www2.pic-upload.de/img/32886562/wrmord.jpg\n\nI beg to differ.","replies":[{"poster":"xXRaichopXx","date":"2017-03-22T00:05:29.766+0000","up_votes":1,"down_votes":0,"body":"I just checked his top wr...","replies":[{"poster":"Malicious Metal","date":"2017-03-22T00:07:14.362+0000","up_votes":1,"down_votes":0,"body":"He's got a 54% over in Korea too.\nHe's far from being bad.\n\nHis problems aren't power-related.","replies":[{"poster":"Meep Man","date":"2017-03-22T01:03:25.205+0000","up_votes":1,"down_votes":0,"body":"Their design related, mainly revolving around his passive and bugs yes?","replies":[{"poster":"Supreme Senpai69","date":"2017-03-22T12:25:49.430+0000","up_votes":1,"down_votes":0,"body":"Tbh most bugs aren't even bugs, they're mostly just visual fuck ups. Which I guess can be called bugs, but in a game like League, it's also a bit misleading to label em like that","replies":[]}]}]}]}]}]},{"poster":"Scrimshäw","date":"2017-03-22T16:58:46.239+0000","up_votes":1,"down_votes":5,"body":"ha, why would you reference that steaming turd of a dead game tho?","replies":[{"poster":"midnight oil24","date":"2017-03-22T17:08:09.685+0000","up_votes":2,"down_votes":1,"body":"You realize it still has a good number of fans, right? Just because you don't like it doesn't mean others don't.","replies":[{"poster":"Scrimshäw","date":"2017-03-22T17:17:27.041+0000","up_votes":1,"down_votes":4,"body":"you realize you're wrong, right? check how many twitch viewers it has at ANY GIVEN TIME rofl kid","replies":[{"poster":"BIAKaboose","date":"2017-03-23T01:56:04.490+0000","up_votes":1,"down_votes":0,"body":"Yep, because the amount of people watching other people play games totally shows how many people are actually playing the game themselves. \n\nI know a ton of people who absolutely hate streams because of the mentality behind them who still play games that are streamed, that doesn't mean that just because there are streams and they don't watch them they aren't fans of the game or players of the game. \n\nAs a side note, my normal League queue times in draft are around 2 minutes, for Heroes of the Storm it's usually less than 45 seconds. Games that are actually dead don't have swift queue times, I've sat in a Guns of Icarus queue to find an 8 player game vs AI for upwards of 15 minutes, that's dead.","replies":[{"poster":"Scrimshäw","date":"2017-03-23T03:16:42.354+0000","up_votes":1,"down_votes":0,"body":"HAHAHAHA okay, i could've believed everything up until the queue time thing. now i know you're lying through your teeth. every ranked queue i go into takes OVER 11 minutes, it's unbearable, and is what caused me to quit the game","replies":[{"poster":"BIAKaboose","date":"2017-03-25T21:11:55.045+0000","up_votes":1,"down_votes":0,"body":"Could just be an MMR thing, I'm trash at both games so I have a wide pool of people to be bad against.","replies":[]}]}]},{"poster":"midnight oil24","date":"2017-03-22T17:20:17.832+0000","up_votes":1,"down_votes":0,"body":"Twitch doesn't determine the number of fans. I play the game and don't stream. I know others who play the game and don't stream. Just because it's not streaming constantly doesn't mean that it doesn't have fans.\n\nAlso, they come up with far more creative stuff than most Moba games. Ragnaros accurately conveyed the feeling of being a raid boss, and Tracer did a good job playing like an fps character without being overbearing, just for a couple examples.","replies":[]}]}]}]},{"poster":"Zedex","date":"2017-03-22T11:41:33.899+0000","up_votes":1,"down_votes":0,"body":"https://support.riotgames.com/hc/en-us/articles/202294884-Champion-Update-Schedule\n\n\nNo he's not. Let it die.\n\nUntil its actually confirmed and announced (and not a random forum post listing 12 champions that are POSSIBLE candidates, Morde among them.) Morde is not up for a VGU. The only fact is that he's a possible candidate. \n\nThat being said, he's got pizza feet and an archaic model, Riot would be stupid not to update him.","replies":[]}]}