{"poster":"Zooty","date":"2014-12-30T16:55:20.310+0000","title":"Toxikus csapattársak, avagy hogyan kezeljük le a helyzetet..","up_votes":7,"down_votes":0,"body":"Sziasztok!\r\n\r\nRengetegszer téma a különböző toxic csapattársak jelenléte, és úgy gondoltam összegzem a gondolataimat ezzel kapcsolatban, és pár ötletet adok hogy **ti** mit tehettek ezen jelenségek megelőzésére/orvoslására! A meccsek java része fejben/moralitásban dől el, főleg alacsonyabb divíziókban, úgyhogy remélem hasznotokra válik amit írok...\r\n---\r\nEgy kicsit más szemszögből fogom elemezni a helyzetet mint a megszokott.. próbáljunk meg belelátni az említett illetők fejébe. Ezek az emberek ugyanúgy győzni akarnak, ugyanúgy nem szeretik a toxic csapattársakat, és ugyanúgy utálják ha lenézik/cseszegetik őket mint ti!\r\nEbből következik hogy soha, de soha ne kritizáljunk ismeretleneket játék közben. Ha így tesztek, azt személyes támadásnak veszik általában, és ez elleni védekezésre kezdenek koncentrálni a játék helyett egy visszaszólás formájában. Erre ti válaszoltok ugyanígy, és máris elromlott a játék hangvétele, és garantált a vesztés..\r\n\r\nUgyanez a másik irányból: ha téged kritizálnak ne vedd magadra, ne szólj vissza, amúgy se tudod elhitetni másokkal hogy nem neki van igaza, tehát a vita értelmetlen lenne. Ha nem bírod elviselni az illetőt, /mute..\r\nMondok erre egy példát. Tegyük fel hogy gankelsz toppon, viszonylag kevés élettel, de úgy gondolod megoldható a dolog. A topposod viszont máshogy látja a helyzetet, és kihátrál. Te meghalsz, pedig biztos voltál benne hogy működött volna a terved.. Ha ebben a helyzetben elkezded hibáztatni a csapattársadat hogy miért nem segített, akkor belekerülhettek a fent említett spirálba, és az senkinek se jó. És igazából nem is hibás az illető, csupán szeret biztonságosan játszani: máshogy gondolkodik mint te. Az is egy *skill*, hogy felmérd, hogy a csapattársaiddal mit lehet, és mit nem lehet megcsinálni és ezt tiszteletben kell tartani.\r\n---\r\nMi van ha te személy szerint meg se szólaltál, két csapattársad esik egymásnak ilyen módon? Természetesen oldani kell ilyenkor a feszültséget köztük valahogy. Egyszerűen rávilágíthatsz arra, hogy amit csinálnak értelmetlen, megkéred őket, hogy fókoszáljanak a játékra. \r\nVagy védd meg **mindkét felet**: \"nem az *ő* hibája, és nem is az *övé*, balszerencsés véletlen történt, misscommunication volt\" stb.\r\nAdvanced tactic: átirányítod a negativitást másra: nem a csapattárs feed-el, az ellenfél volt ügyes. Vagy azt mondod hogy nem a mides tehet a sávja elvesztéséről, csupán Azir retardáltan OP ebben a pecsben, és az ellenfél meg pont elvitte...\r\nAvagy humor. Pár poén nagyon jól oldja a feszültséget. Nem véletlen commentelek vicces/aranyos cicás képeket mindenhova itt a fórumon!:)\r\n---\r\nA jó hangulat fenntartása a csapatodon belül hatalmasat segíthet egy-egy meccs megnyerésében. Próbáld fenntartani ezt a jó hangulatot. Kommunikálj a csapatoddal. Mond meg előre mit tervezel csinálni, mit tervezel építeni magadnak, mikor akarsz sarit vinni, stb. Dicsérd a csapattársaidat amikor csak tudod, megdobja a játékos morálját.\r\n---\r\nNa itt abba is hagyom az írást, mert túl sok lesz!:) Ha bármi észrevételetek van ezzel kapcsolatban, vagy bármivel kiegészítenétek, írjátok le kommentben. Várom a válaszaitokat! :)","replies":[{"poster":"NalamiHUN","date":"2014-12-30T17:10:28.445+0000","title":null,"up_votes":1,"down_votes":1,"body":"sajnos a dícséret nem ér néha semmit valakinél. :S\n\nVolt olyan, hogy megköszöntem, hogy megmentette az életemet, GJ, erre rávágta, hogy takarodjak AFK-ba, mert ilyen useless meg olyan useless vagyok, mert kb 14-er meghaltam. Azt viszont már nem figyelte, hogy más is 10 fölött volt halálozásban a csapatból.","replies":[{"poster":"Vasipari Béla","date":"2014-12-30T17:51:00.168+0000","title":null,"up_votes":2,"down_votes":2,"body":"Vannak hasonló tapasztalataim.\nNemrég játszottam egy játékot. Kb. 5/0-ba lehettem, warwickal jungleztem., szó mi szó, elég jól álltunk. Elkezdtünk egy harcot a sárkánynál, és végül elvesztettem a \"SmiteFight\"-ot. Erre olyan iszonyatos átkozódás, szitkozódás kezdődött (akkor tudtam meg, hogy meleg vagyok, és anyám mindenkinek megvolt, valamint rákban fogok meghalni), hogy muszáj volt mennem feedelni, és hatalmas elégtétellel nézni a csapattársak tehetetlen dühét. Általában egy ilyen után meggonldolják, legközelebb flamelnek-e. Az ilyet nem /mute-olom, mert szeretem nézni, ahogy szenved.","replies":[{"poster":"Zooty","date":"2014-12-30T18:46:51.936+0000","title":null,"up_votes":2,"down_votes":0,"body":"És eldobtál egy könnyen megnyerhető meccset azért, hogy egy toxic játékossal kicsesszél.. Szerintem nem érte meg... A /mute ilyenkor sokkal jobb megoldás..","replies":[{"poster":"Vasipari Béla","date":"2014-12-30T18:53:48.455+0000","title":null,"up_votes":1,"down_votes":1,"body":"Azért azt elmondanám, hogy csak akkor csinálok ilyet, ha minden csapttárs őrjöng. Ártatlanokkal nem szúrok ki.","replies":[]}]}]},{"poster":"Zooty","date":"2014-12-30T17:45:00.099+0000","title":null,"up_votes":1,"down_votes":0,"body":"Persze, nem mindig, de az esetek többségében működik. És valóban, vannak olyanok akik annyira reménytelen esetek, hogy felesleges bármit is kezdeni velük.. /mute az ilyenre, azt csumi..","replies":[{"poster":"NalamiHUN","date":"2014-12-30T18:21:05.501+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az benne a vigasz, hogy nem mindegyik olyan. ^^","replies":[]}]}]},{"poster":"Brăd","date":"2014-12-30T20:55:30.888+0000","title":null,"up_votes":1,"down_votes":0,"body":"Úgy vettem észre én is ,hogy sz utóbbi időben és is elkezdtem pozitívan hozzáálni a dolgokhoz és megpróbálok taktikáznia csapattársak elméjével. Kedvenc taktikám ,mikor azt mondom ,hogy valójában nő nemű vagyok ,és ilyen esetekben többnyire lazulnak a hurkok (,hiszen kinek lenne kedve megsérteni egy lányt :PPP) ,sőt általában nagyobb segítséget kapok a csapattól.\n----\nA másik mostanában használt praktikám az ,hogy megpróbálok minden apróságra odafigyelni ,megköszönni mindent ,megdicsérni mindent és segíteni (lehetőleg) mindenben. Bár ilyenkor is előfordulnak olyan dolgok ,hogy ha pl. ADC-vel játszom a Lila csapatnál ,akkor nem szoktam segíteni a junglernek (kéknél) ,minthogy nagy mennyiségű Xp-t vagyok képes elveszíteni. Egy hasonló esetnél egész konkrétan azt mondta a jungler ,hogy nem gankel boton. Ezt teljesen passzívan kezeltem (tudván ,hogy nem jönne) nem is pingeltem gankért ,viszont amikor a jungler is belátta ,hogy hülyeség a bot lane-t gank nélkül hagyni ,így mégiscsak lejött.\n----\nEzekből azt vontam le ,mint következtetés ,hogy jobban megéri minél pozitívabban ,hibák esetén passzívabban játszani ,mivel ezzel akár egy teljesen elvesztett csatát is élvezettel lehet játszani ,viszont ,ha ez sem jön be ,meg kell próbálni taktikázni nem az ellenféllel ,hanem a saját csapattársaiddal :)\n----\nTeljesen toxic játékosokat ,akik meg csak  flame-elnek ,szitkozódnak érdemes teljesen passzívan kezelni ,esetleg megpróbálni neki segíteni ,kedvére tenni (neki adni a killt ,gyakrabban gankelni...) és lehetőleg megszüntetni minden olyan dolgot ami miatt tovább folytathatná a \"munkálkodását\".\nHa meg ezek se jönnek be még mindig ott van a /mute parancs :)\n----\nMár a lobby-ban is fontos az ,hogy lehetőleg jó kapcsolatban legyünk a társainkkal. Érdemes kivárni ,hogy ki hova szeretne menni még ha ilyenkor csak a support lane marad (ezért érdemes minden lane-en legalább 2 champ-pel magtanulni jól játszani) ,illetve ha egyáltalán nem akarunk az adott lane-re kerülni ,ki kell hangsúlyozni a csapattársaknak ,lehetőleg ,úgy ,hogy ne sérts meg vele másokat. Ha meg mindenképp egy bizonyos lane-re szeretnél menni ,akkor ha más is mondja és nem szeretné átadni neked NE VESZEKEDJ!\n----\nHa olyat látsz ,hogy valaki XY lane-re szürreális champet pickel (pl. Jax support, Thresh adc) ,akkor sem érdemes elkezdeni veszekedni ,hiszen egyáltalán nem biztos az ,hogy olyan rosszul teljesít azzal a champpel.\n(SolWolf: [Break the Meta](https://www.youtube.com/playlist?list=PLC0_N2JiWjTp-hIoC6zXd6nET1dXzUzyC))\n(Disco Heat: [League of Children (Legfőképp a toxic játékosokat mutatja be)](https://www.youtube.com/playlist?list=PL6YZkeWa4hQV73_NHf3gMaJsStPDZU4nY))\n\n\nEnnyit szerettem volna elmondani :)\n{{champion:89}} {{summoner:11}} {{item:3709}}","replies":[{"poster":"NalamiHUN","date":"2014-12-30T21:03:55.146+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mondjuk a Jax Support nem vészes, volt egy olyan lane partnerem, s semmi baj nem lett belőle, jól össze tudtunk dolgozni, mert ha nekem nem sikerült elkapnom az ellenfelet, ő elkapta, volt olyan is, hogy megmentett a haláltól.","replies":[{"poster":"Razer1912","date":"2015-01-28T16:01:04.615+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hello NalamiHUN ehez csak annyit füznék hozzá hogy igencsak szeszélyes supportokat szoktam vinni lásd : Jax van vele vagy 1000-1200 meccsem ebből 300 at biztos hogy suppoltam vele  :D vagy ott van yasou,ahri,zed,lux stb. szóval az ilyen carry féle support champek ha nem kapja el az ADC-m a kellő embert akkor egy Lux ulti még jó hangulatot is kelt a csapat morálban főleg mikor elolvassák az enemy szitkozodását :D\n+ ha ilyen carry féle supportot viszek van rá elég nagy százalék esély hogy utánna lecarryzem a meccset vele. Lásd Lux supportoltam 0/6/20 ban voltam AP ezreal mid stack-elősen Jinx adc 3 killel 4 halálal és 6 assistal.\nEgyszerűen csak vesztésre áltunk és szépen visszahoztuk double ultival az ezrealal + a lux stun-al aztán a végére 22/9/34 be lettem mikor megnyertük a meccset.\nJax supporthoz pedig annyit füznék hozzá ha az ADC nem bírja elverni a lane-t elmegyek jungleben fel farmolni magam és szétverem utánna a bot lane supportot és az ADC-t aztán még win is lehet belőle mikor egy jax lead gameben beugrik a teamfightba és szétkapja az emberek 2.50 es attack speedel hybridként :D","replies":[]},{"poster":"Brăd","date":"2014-12-30T21:17:17.725+0000","title":null,"up_votes":1,"down_votes":0,"body":"Csak egy példa volt :D","replies":[]}]}]},{"poster":"Mind The Gap","date":"2014-12-30T18:07:18.202+0000","title":null,"up_votes":1,"down_votes":0,"body":"A kedvenc parancsom az egész játékban a /mute all... IMÁDOM <3","replies":[{"poster":"Brăd","date":"2014-12-30T20:33:05.769+0000","title":null,"up_votes":1,"down_votes":0,"body":"Amit nemrég ismertettünk veled :P","replies":[{"poster":"Mind The Gap","date":"2014-12-31T11:41:49.331+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igen, azóta szentté tettétek vele az életem. /mute all <333","replies":[]}]}]},{"poster":"Tomasz cool","date":"2014-12-30T20:21:28.539+0000","title":null,"up_votes":1,"down_votes":0,"body":"Amit leírtál az nagyon jó és igazán jól hangzik, de az egyik nagy probléma a kommunikáció során, maga az információ átadása, avagy az angol nyelv elégtelen, vagy nagyon alap szintű használata. Sokan nem képesek egy értelmes kijelentő mondatot összeállítani angolul, nem hogy még párbeszédet kezdeményezni a csapattársakkal. Vannak olyanok, akiknek a szókincse a mid,top,AFK,OP,low,noob,fu,retard... és társaiban merül ki, esetleg le tud írni egy \"I go AFK\", \"I go mid\", I'm trolling\", \"Stop feeding\" s a többit. Így azért nehéz tudatni a társakkal, hogy mit szeretne pontosan. A lejátszott mérkőzéseimen főként supportoltam, tehát az ADC-vel \"előfordult\" hogy kommunikálnom kellet és elég ritkán találkoztam olyannal, aki kifejezően használta volna az angolt. Ezt egy elég nagy problémának tartom a játék játszhatóbbá tételének szempontjából.\n\nAmit még hozzá tudnék tenni a leírásodhoz, hogy jó ha elismered, ha hibáztál. Például egy rosszul sikerült gank vagy TeamFight-ban elkövetett fatális hiba után ha valaki beírja pl hogy \"f*ck, my bad\", akkor nem is írok semmi, mert tudom hogy tudja hogy hibázott és nem direkt tette azt, amit. :D\n\nPlusz ha valami \"csúnyát\" akarsz beírni, akkor azt ne tedd meg egyből, hanem számolj el háromig, egy-kettő-három és jó esetben vissza fog tartani az írástól, legalábbis engem vissza szokott tartani. Átgondolom jobban a szituációt és igen, olykor beugrik, hogy én is csinálhattam volna jobban a dolgomat.","replies":[]},{"poster":"Vasipari Béla","date":"2014-12-30T17:43:47.762+0000","title":null,"up_votes":1,"down_votes":0,"body":"Jó kis írás!","replies":[]}]}