{"poster":"Zooty","date":"2014-08-24T00:23:23.500+0000","title":"Hogyan másszunk fel az elolétrán?","up_votes":1,"down_votes":0,"body":"Arra gondoltam, hogy összegyűjthetnénk pár hasznos rövid tippet arról, hogy hogyan legyünk sikeresebbek rankeden(vagy akárhol máshol).. \nReményeim szerint ezáltal tanulhatunk valamit egymástól, de az biztos hogy hasznosabb mint egy újabb nerf urgot topic;)\n\nEdit: Én igazából ilyen kis rövidke tippszeletecskékre gondoltam, ami nem több pár sornál, de igyis jó. :D","replies":[{"poster":"VampVik","date":"2014-08-24T07:15:03.394+0000","title":null,"up_votes":4,"down_votes":0,"body":"Hát CS:GO-ban a siker titka... vagy nem így értetted az \"akárhol máshol\"-t? :)\n\nKomolyabban a képlet általánosságban egyszerű. Ne nyerni akarj, hanem fejlődni. Használ LoL Recordert és nézd vissza/elemezd ki a meccseidet. Játék közben ne az érdekeljen, hogy ki mit rontott el (múlt) hanem, hogy ezután mit kell tenni (jövő) és folyamatosan javítsd a hibáidat, tanulj mások hibáiból is, lesd el a jobbak trükkjeit, gyakorolj sokat.\n\nHa pedig konkrét \"Hogyan legyünk jobb LoL playerek\" tanácsok érdekelnek, akkor ajánlom figyelmedbe a Youtube-ot, elég sok ezzel foglalkozó csatorna van amik sok oldalról vizsgálják a kérdést és rengeteg tanácsot adhatnak (Adam Kiss pl az egyik magyar ilyen Youtube-os LoL-tanár ha nem tudnál angolul).\n\nNa jó, azért csak írok pár konkrét tanácsot is.\n\n- Farmolj! (Costume game, csak te botok és emberek nélkül, rúnák és mesterségek nélkül, itemek nélkül kimész lainre és 10 percig lasthitelsz. Ha a 10. percben van 80 cs-d akkor még van mit gyakorolnod (101 a tökéletes) de készen állsz a harcra, ha nem... akkor gyakorolj többet.)\n- Wardolj! Bármilyen poszton is vagy!\n- 4-6 mp-ként nézz a minimap-ra! (Nincs olyan, hogy nem volt SS, olyan van, hogy nem néztél a minimappra és nem vetted észre, hogy a másik lainen ss van, sőt a harmadik laint is neked kell értesítened a 2. lain ss-éről mert TE vagy aki fentebb való, neked kell carryzni ami nem az ellenség le Ace-eléséből áll, hanem a csapat eljuttatásából Ace-ig.)\n- Ne flamelj, mute-old a flamereket. (Ha fejlődni akarsz, nem pocsékolhatod az idődet szájkaratéra és a hidegvéredet is csak így őrizheted meg, a csapatmorálról már nem is beszélve)\n- Vezess! (Ha jobbnak érzed magad a csapattársaidnál adj nekik tanácsokat [TANÁCSOKAT, NEM PARANCSOKAT!] amiket vagy követnek vagy nem, de ha jól végzed a dolgod és nem utáltatod meg magad azzal, hogy flamelsz akkor szép sorban elkezdenek majd követ és Team Work OP)\n- Team Work OP (A LoL egy csapatmunkán alapuló stratégiai játék. Vizicsacsi talán a legismertebb magyar LoL-os, épp az LCS-re vagyis a világbajnokságra kijutásért küzd a csapatával, de indult a LoLfoglaláson is, csak épp nem az összeszokott csapatával és solo szinten hiába volt jobb az ellenfeleinél, csapat szinten legyőzték már talán a legjobb 16-nál, szóval képzeld el, hogy mit lehet elérni egy olyan játékban ahol az összes ellenfél \"Solo huszár\" ha egy kicsit is össze tudtok dolgozni, elárulom akár a 2/30 is fordítható csapatmunkával)\n- Never surrender! (Ha feladod, akár fejben akár ténylegesen azzal semmit sem nyersz, ha kitartasz az utolsó pillanatig, akkor a játék hátralevő részéből még sokat tanulhatsz és ha 100 feladandó játékból csak 1-et nyersz mert az ellenfél \"eldobja\" a meccset akkor már nyertél [100-ból nem 1 ilyen játékod lesz])\n- Sose bízd el magad! (A játékot addig nem nyerted meg amig az ellenség Nexusa áll, hidd el, nem csak az ellenség tudja \"eldobni\" a nyertes meccseket!)\n- Tanuld meg az Objektek fontosságát! (Egy korai sárkány hatalmas előnyt jelenthet, vagy a hátrányból is sok lefaragható belőle, egy Baron eldönthet egy közel döntetlen állást, de egyben a játék legnagyobb \"Throw magnet\"-je, vagyis itt dobják el a nyerésre álló csapatok a legtöbbször a győzelmet maguktól.)","replies":[{"poster":"Invisible Dye","date":"2014-08-24T07:25:19.481+0000","title":null,"up_votes":1,"down_votes":0,"body":"Jó tippek!","replies":[]}]},{"poster":"zrs1337","date":"2014-08-24T15:44:56.090+0000","title":null,"up_votes":5,"down_votes":1,"body":"Ne próbáld az LCS játékosokat copyzni, vagy pro streamerekt, tök mindegy, csak ne másolj, mert annyi olyan agyhalottat látok, hogy ő már játék elején eldönti, hogy top alistart megy és veszi a triforcot, shivet meg frozen heart-ot, az tök mind1 ha 5 ap van enemyben, mert xy pro 3. item frozen heart volt szóval azt kell venni aztán lehet a csapatot blamelni, mert ő biztos nem rontotta el mert pro playerék is ugyanezzel a builddel nyertek meccset és OP szóval csak a team lehet a szar. :D","replies":[{"poster":"Zooty","date":"2014-08-25T10:52:08.084+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem értem miért vagy lepontozva, egyet értek veled..","replies":[]}]},{"poster":"l3ullet","date":"2014-08-25T14:46:05.104+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az én tippem: A hibát sose a csapatodban keresd, hanem magadban elvégre őket nem tudod megváltoztatni akkor sem ha 100%-ig bebizonyítod h már pedig a föld gömbölyű. Ellenben ha észreveszel 1 hibát a játékodban azt te magad könnyen kijavíthatod. (ez a tipp főleg bronzosoknak és silvereseknek szól + talán még goldnak is)","replies":[{"poster":"Zooty","date":"2014-08-25T15:51:25.143+0000","title":null,"up_votes":1,"down_votes":0,"body":"Meg platinásoknak, és diamondosoknak..","replies":[{"poster":"Mogo","date":"2014-08-25T18:07:27.824+0000","title":null,"up_votes":1,"down_votes":0,"body":"Meg challengereknek...","replies":[{"poster":"Zooty","date":"2014-08-25T20:44:20.973+0000","title":null,"up_votes":2,"down_votes":0,"body":"Nekik nem, ők essenek csak vissza bronzba!!! :C","replies":[]}]}]}]},{"poster":"Invisible Dye","date":"2014-08-24T07:19:28.596+0000","title":null,"up_votes":2,"down_votes":0,"body":"Sok dolgot írnék, de arról volt szó rövid tippet szóval\n\n* Attól függően melyik divíziót nézzük.:\n  * Bronz: Kapcsold ki a chatet (elég ha fejben megteszed, amennyiben van önuralmad)  pingelj, mások dolgaival/véleményével ne törődj, magadban keresd a hibákat és változtass rajtuk. **WARDOLJ!!!**\n  * Silver: Most már lehet foglalkozni a chat-el, de ne fektess rá nagy hangsúlyt (azaz ne etesd a trollokat, csak a csapatmunka érdekében használd, ne flamelj), kezdj el minél inkább csapatjátékosként játszani, de sose feledd, hogy csak bizonyos mértékig számíthatsz másokra. Az itemeket ne feltétlenül  saját hősödre szabd, mindig vedd figyelembe a saját, bár inkább az ellenség csapatát, eszerint eszközölj kisebb változtatást. **WARDOLJ!!!**\n  * Gold:  Ismerned kell a hősök 75%-át(még jobb, ha mindet, természetesen azokat is akiket utálsz) hősválasztásnál megfontoltan pickelj (teszem azt ad-s team ellen egy Rammus/Graves/Taric kombó hatásos lehet, bár még nem próbáltam) elsődleges hősökre szabott rúna/mesterség kötelező! **WARDOLJ!!!**\n  * ~~Platina : Passzolok. (WARDOLJ!!!)~~\n  * ~~Diamond: Passzolok. (WARDOLJ!!!)~~\n\nSzerintem ezek lennének divíziónként a legfontosabb dolgok, de csak azért, mert valaki silverbe lépett, nem szabad figyelmen kívül hagynia a bronzhoz írt tippeket, és ugyanígy hasznára válhat a goldban leírtak is. Persze ezek csak részletek, de nem erősségem, hogy röviden fogalmazzak.*** Teamwork és wardozás mindenekfelett :)***","replies":[]},{"poster":"M4dr4c","date":"2014-08-24T00:56:01.387+0000","title":null,"up_votes":2,"down_votes":0,"body":"Wardolj.","replies":[]},{"poster":"Zooty","date":"2014-08-24T00:26:01.919+0000","title":null,"up_votes":3,"down_votes":1,"body":"Kezdem én valami méllyel: \nFogadd el hogy borzasztó vagy ebben a játékban, és fejlődj fel innen.","replies":[]},{"poster":"PandaCukorPL","date":"2014-08-24T21:56:58.510+0000","title":null,"up_votes":1,"down_votes":6,"body":"A sikeresebb ranked titka: Riot megkéri az FBI-t, vagy CSI-t, hogy keressék meg polandiát, az örök bronzerek mezejét, és bumm.... ugyanez a greekekkel (geek...) elég durvának hangzik, de ez a siker titka :)","replies":[{"poster":"Zooty","date":"2014-08-25T10:51:31.953+0000","title":null,"up_votes":3,"down_votes":0,"body":"Ezt sose értettem.. Ha rankeden találkozol egy polákkal, akkor az azt jelenti, hogy ugyanazon az elo-n vagytok. Tehát ha ő rosszul játszik, és veled van egyszinten, akkor a logika alapján nem nagyon vagy abba a helyzetbe hogy ilyeneket irkálj...","replies":[]}]},{"poster":"mmateexd","date":"2014-08-24T04:28:10.827+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha az enemyben afk vagy troll van akkor örülj mert megnyerted a gamet :D","replies":[{"poster":"Hagyma Beni","date":"2015-09-18T18:28:03.211+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az egyik kedvenc játékomban 3vs5-ben nyertünk Tryndával, Jaxszel és én Sona voltam. Hosszú volt, de tanulságos:)","replies":[]},{"poster":"Mókusmedve","date":"2014-08-25T09:48:07.180+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem biztos. Veszítettünk már 5vs4-ben és nyertünk 4vs5-ben. Ha így áll hozzá az ember, akkor olyan buta hibákat követhet el, amiket amúgy nem tenne.","replies":[]}]},{"poster":"Berény","date":"2014-08-27T12:55:17.447+0000","title":null,"up_votes":1,"down_votes":0,"body":"Sziasztok! \n\nPár tanács a részemről (főleg top/support vagyok, jelenleg Plat V-ben): \n\n- Sokat segít, ha zenét hallgatsz játék közben, kicsit ellazít. Persze állítsd be a hangokat úgy, hogy ha valaki pingel, azt halld. \n- Nekem sokat segített, hogy az all chatet lelőttem, és már a játék legelején lemutoltam mindenkit. Csak azzal, hogy használod a smart ping rendszert, már a játékhoz szükséges főbb dolgokat tudatni tudod a csapattársaiddal. Persze a \"Warded, Ward here\" pingeket azóta is várom epekedve, sokat segítene az is. \n\n- Ha mégse mutoltál mindenkit, és valami flame kezdődik, hagyd őket a francba, esetleg írd be, hogy \"chill guys\" vagy valami. Ha elkezdesz visszaírkálni, azzal csak magad alatt vágod a fát, egyrészt mert nem a játékra koncentrálsz, másrészt meg úgy is valami Vérpisti van a monitor másik oldalán aki nem fogja abbahagyni amíg te is reagálsz rá. \n\n- Ha topon vagy, és az enemy jungler egymás után 5-ször jött érted sorozatban, mert esetleg nem wardoltál, vagy az enemy tornya alatt voltál sok ideig, akkor nehogy ilyet írj be nekik, hogy \"gank more pls\" vagy valami. Ezzel csak azt éred el, hogy még többet fognak rád menni, egyrészt a poén kedvéért, másrészt mert látják hogy belül már megtörtél, és még 1-2 gank után a saját csapatodat fogod szidni, hogy miért nem segítenek, stb. \n\n- Személy szerint én utálom, ha valaki egyedül mászkál, főleg az ellenség vonalai mögött (ADC farmol boton az enemy 2. turret közelében, míg ti topon vagytok). Az én ligámban még ez a taktika sajnos nem működik, hogy valaki egyedül pushol, míg ti máshol ugyanezt teszitek. Főleg, mivel a csapat nagyja ilyenkor vagy nem csinál semmit, vagy elkezd hátrálni, így akár mindkét része a csapatnak nagyon megszívhatja (5-en a maradék 4-t beverik, vagy öten a topon egyedül lévőt, majd a maradék 4-t). TEHÁT próbáljatok meg mindig csapatban mozogni. Ha valaki nem hajlandó ezt csinálni, muszáj nektek követni az elcsatangolót, amiből még jó is kisülhet. \n\n- Tanulj meg minden szerepre legalább 2-3 hőst! Ez is persze a saját példám okán, én kb. 4-5 hőssel játszva jutottam el platináig. \nÉs ez több előnnyel is jár: \n  - Mivel ismered az adott hős szinte minden erősségét, gyengéjét, és kb. minden hős ellen játszottál már vele, ismered a saját határaidat, és tudod ki ellen mit kell csinálnod. Példának okán én Taric supporttal 47-22 win/lose arányban vagyok, ami szerintem nem egy rossz arány. Egyrészt illeszkedett a hős a saját játékstílusomhoz (óvatos, inkább farmoljunk mintsem valami öngyilkos dzsihádba menjünk taktik), másrészt olyan karaktereket is elvertem vele, akik elvileg Taric counterjei (Janna, Lulu, Alistar, Morgana). \n  - Sokkal jobb egy hőst tökéletesen ismerni, mint mondjuk 30 esetén annyit tudni, hogy kinek mik a képességei, mit kell venni. \n\n\n- És a legfontosabb: WARDOLJ!!!4!négy","replies":[]}]}