{"poster":"Unknown101","date":"2015-03-25T06:53:05.953+0000","title":"Get rid of premade/teams week","subforum":"Miscellaneous","up_votes":1,"down_votes":2,"body":"I usually go support because no one want to in solo ques. But there was a 3 man premade and they want to duo bot i said that is fine ill go top but i thought well no one called jungle ill jungle. That is when \"David is my name\" like if you call a lane @#$%ing stick too it. I'm like relax and he tells me to @#$% off.\r\nGame starts and i get first blood with olaf on leesin. Then David come ganked top because rengar was camping we get a double kill with a turret dive, he dies and I lived and he says gw. I was thinking i was going to get an ear full. after about 15 mins we have lost mid and bot and dragon. So I came mid to stop the push on inner turret and get rekt by the fed adc. But lee keeps farming top and pushing. So i'm split to I farm and stop lee or help mid and lose top. In fear of abuse I tryed helping the team but all they wanted to do was chase kills and we are losing turrets top bot and mid.\r\nI was thinking this is going to be a mute game but after game started he didn't say any thing to the end of the game when he said i'm reporting top and mid.\r\nSo how is this meant to stop abuse in game when most of the games it is just premades abusing the solo ques and preventing a surrender on a lost game.","replies":[{"poster":"Unknown101","date":"2015-03-25T07:07:04.828+0000","up_votes":1,"down_votes":0,"body":"Its more the fact that some ppl are getting awarded for abusing other ppl due to the premades awards","replies":[{"poster":"Valorose","date":"2015-03-25T07:08:07.580+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Unknown101","date":"2015-03-26T02:57:36.832+0000","up_votes":1,"down_votes":0,"body":"I know not all pre-mades are bad but, the point of the pre-made rewards was to curve the abuse in game. I could be a complete jerk with my mates and we would still get rewarded for it.\nMaybe they should of made it if you got reported for being aggresive at someone else you would not get the bonus points.\nI think that might curve more than just giving ppl more ip for playing as a team.","replies":[]},{"poster":"Chalze","date":"2015-03-25T08:29:32.303+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Valorose,realm=OCE,application-id=Ntey9fRZ,discussion-id=nP0Evs8E,comment-id=00010000,timestamp=2015-03-25T07:08:07.580+0000)\n>\n> Not all pre-mades are assholes, you know? Your case should be an exception.\n\nMost.","replies":[]}]}]}]}