{"poster":"Op Taruc","date":"2016-04-06T15:26:48.310+0000","title":"Unbekannter Fehler beim Patchen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo, \nDa der Support mir bei meinem Problem nicht behilflich sein kann oder es nicht sein will  .\nFrage ich jetzt euch ob jemand mir bei meinem Problem helfen kann .\nUnd zwar , wenn ich den Patcher starte kommt eine Meldung dass ein &quot;Unbekannter Fehler&quot; aufgetaucht ist (siehe Screenshot)\n                                                                   http://www2.pic-upload.de/img/30275432/error.png \nIch hab das Spiel neu runtergeladen , auf &quot;Reparieren&quot; gedr&uuml;ckt , einige &quot;Dateien&quot; gel&ouml;scht wie es in verschiedenen &quot;Hilfsthreads&quot; stand jedoch hat bis jetzt nichts geholfen .\nDie einzige antwort  die ich vom Support bekomme habe ist dass es eventuell ein Verbindungsfehler ist . \n\nPS: Alle Windows Updates sind gemacht sogar auf Win10 geupdatet  alle Treiber sind aktuell  und das mit dem Wrenchmen´s toolbox hat auch nicht geholfen u.s.w \n\nIch w&auml;re jedem der mir helfen k&ouml;nnte Dankbar da ich schon 2 Wochen lang versuche hierf&uuml;r eine L&ouml;sung zu finden .\n\nDanke .","replies":[{"poster":"Wingslash","date":"2016-04-06T15:47:23.998+0000","up_votes":1,"down_votes":0,"body":"Du hast es Neu heruntergeladen hast du denn den PC davor ausgeschalten damit auch wirklich alle dateien komplett enfernt wurden/ sind, selben Fehler hatte ich auch. Vielleicht solltest du das Spiel komplett Deinstallieren nicht nur im Papierkorb löschen meist is trotzdem noch etwas zu dem spiel auf dem PC. Sollte es immer noch nich funktionieren musst du etwas in deinem Explorer umstellen (hab ich auch gemacht) was das war kann ich dir leider nicht mehr sagen auf jeden fall ist das Problem nichts was man nicht beheben könnte \nWünsche dir viel Erfolg dabei und sag bescheid falls es geklappt hat {{sticker:slayer-jinx-catface}} \n\n\nLG Karsten Carried","replies":[{"poster":"Op Taruc","date":"2016-04-06T16:13:28.647+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Karsten Carried,realm=EUW,application-id=7hciEY9w,discussion-id=djLPl1Ep,comment-id=0000,timestamp=2016-04-06T15:47:23.998+0000)\n>\n> Du hast es Neu heruntergeladen hast du denn den PC davor ausgeschalten damit auch wirklich alle dateien komplett enfernt wurden/ sind, selben Fehler hatte ich auch. Vielleicht solltest du das Spiel komplett Deinstallieren nicht nur im Papierkorb löschen meist is trotzdem noch etwas zu dem spiel auf dem PC. Sollte es immer noch nich funktionieren musst du etwas in deinem Explorer umstellen (hab ich auch gemacht) was das war kann ich dir leider nicht mehr sagen auf jeden fall ist das Problem nichts was man nicht beheben könnte \n> Wünsche dir viel Erfolg dabei und sag bescheid falls es geklappt hat {{sticker:slayer-jinx-catface}} \n> \n> \n> LG Karsten Carried\n\n\n\nDas mit dem alle LoL dateien Löschen , neuinstallieren hat nicht geholfen :/","replies":[{"poster":"Wingslash","date":"2016-04-06T16:26:41.643+0000","up_votes":1,"down_votes":0,"body":"wie gesagt einmal komplett löschen PC neustart und dann neuinstallieren\nfalls das nicht funktioniert werde ich für dich nachsehen wie ich das mit dem explorer damals gefunden habe, nich weil du es verdient hast (wow wie gemein :D) sondern weil ich einfach ein netter kerl bin und du mir sehr sympatisch erscheinst also probiers mal aus und teil mir dann nochmal mit ob es funktioniert hat oder nicht {{champion:1}}","replies":[{"poster":"Op Taruc","date":"2016-04-06T16:52:30.676+0000","up_votes":1,"down_votes":0,"body":"Komplett gelöscht , pc neugestartet und dann neuinstallieren hat auch nicht geholfen :/{{summoner:3}}","replies":[{"poster":"Wingslash","date":"2016-04-06T17:04:20.586+0000","up_votes":1,"down_votes":0,"body":"LAN Kabel für eine saubere Verbindung verwenden, Firewall deaktivieren ( kann sein dass sie etwas blockiert). eventuell .NET FRAMEWORK 3.5 installieren( nur falls alles nichts hilft) Bildschirmauflösung zu 60Hz. Winsock zurücksetzen. Windows Taste + R, cmd eingeben \"OK\" drücken, dann eingeben \"netsh winsock reset\" eigabetaste drücken Computer neu staren, LOL starten, spiel als Administrator starten. Achja nur so am Rande versuch es nicht alles auf einmal ich habs auch nich gemacht{{champion:18}} ","replies":[{"poster":"Op Taruc","date":"2016-04-06T17:06:51.460+0000","up_votes":1,"down_votes":0,"body":"Das alles hab ich schon ausprobiert in den 2wochen  aber nichts hat geholfen hab danach sogar auf win10 geupgradet jedoch hat das auch nicht geholfen :/","replies":[{"poster":"Wingslash","date":"2016-04-06T17:18:36.937+0000","up_votes":1,"down_votes":0,"body":"Okey ich hab das gefunden was bei mir das problem war, also schließe den patcher \nöffne den Internet explorer und drück auf startmenü, dann auf dateimenü, \"offline arbeiten\" darf keinen haken haben. kann auch sein dass du den internet explorer auf den neuesten stand bringen musst.\nWas Ich auch noch gemacht habe im internet explorer auf das Zahnrad klicken / Internet Optionen / zum Reiter \"Erweitert\" gehen, dann die häkchen bei \"Auf gesperrte Serverzertifikate überprüfen\" / \"Auf gesperrte Zertifikate von Herausgebern überprüfen\" und  \"Warnung anzeigen, wenn die Zertifikatadresse nicht übereinstimmt\" entfernt habe.","replies":[{"poster":"Op Taruc","date":"2016-04-06T21:12:41.061+0000","up_votes":1,"down_votes":0,"body":"Geht leider immer noch nicht :/","replies":[{"poster":"Wingslash","date":"2016-04-06T21:22:27.583+0000","up_votes":1,"down_votes":0,"body":"Puhhh Es gibt noch sehr viele andere Optionen moment ich glaube riot hat da sowas im support stehen \nhttps://support.riotgames.com/hc/de/articles/202969434-Probleme-beim-Patchen probier einfach alles aus hab ich auch gemacht... ich war da selber 8 stunden an einem tag dran gesessen und habs irgendwie behoben","replies":[{"poster":"Op Taruc","date":"2016-04-06T21:27:37.047+0000","up_votes":1,"down_votes":0,"body":"Werds mals versuchen .\nIch bin schon fast 14 Tage dran mit dem \"Support\" der als letzt vor 3 tagen geantwortet hat . \n\nHoffe dass es danach geht :/","replies":[{"poster":"Wingslash","date":"2016-04-06T21:31:27.647+0000","up_votes":1,"down_votes":0,"body":"Feel with you bro kenn das Gefühl is echt zum kotzen :/ naja falls es gehen sollte mal kannst mich ja adden wäre auch bereit mit dir weng zu zocken wennst lust hast :D{{champion:44}}","replies":[{"poster":"Op Taruc","date":"2016-04-07T00:09:58.765+0000","up_votes":1,"down_votes":0,"body":"Die Jungs von Wrenchbox haben mir dabei geholfen und den Fehler gefunden .","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Títaric","date":"2016-04-06T19:54:01.294+0000","up_votes":1,"down_votes":0,"body":"Falls diese ganzen Tipps hier nicht helfen gehe entweder zum Support oder zu den Wrenchmen, das sind freiwillige Leute aus der Commiunity, die bei technischen Fehlern kontaktiert werden können: [Thread,Die Wrenchmen, was sie tun und wie man sie direkt erreichen kann](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/i0cdbtgM-live-chat-mit-den-wrenchmen)","replies":[{"poster":"Op Taruc","date":"2016-04-06T21:13:10.348+0000","up_votes":1,"down_votes":0,"body":"Ich werde es mal mit dem \"Wrenchsupport\" versuchen , danke wusste nicht dass es auch soetwas gibt.","replies":[]}]}]}