{"poster":"Suki no Sukiru","date":"2016-02-21T10:36:48.190+0000","title":"YuMo The Blade Seeker","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"YuMo, a warrior who has lost his spirit for battle long ago. His blade taken off him, once he was so powerful countless empires fall to him, and him alone. Now, he is back to take revenge on those who has stolen his treasure. With his old Skills re-invoked, Youmuu style; Shall reign again......\n\n\nYuMo is a Melee champion capable of long sustained fights, with each second in combat, he becomes harder and harder to kill until eventually the enemies fall to his Youmuu Style.\n\nHP580+74 3.78/5sec\nEnergy 200\nAD53.1 +4.19\nAtk Speed 0.631 +0.013\nArmor 27+2\nMR 23+4\nSpeed 330\n\nPassive: Stronger With Time\nPassively each second in combat increases Armor and MR by 2/3/4/5, AD by 2/3/4/5 and Lifesteal by 1/1.5/2/2.5%.\nEvery 3 seconds, attackspeed is increased by 5/10/15/20%. Stacks 30 times.\nLasts 10 sec out of combat.\nAbilities also gain stacks.\n\nQ: Triple Slice. 70/65/60/55/50 energy 13/12.5/12/11.5/11 sec\nDashes to the enemy within 400 range to attack them 3 times in 1.75/1.5/1.25/1/0.75  seconds.\nHowever each hit only dealing 65/70/75/80/85% of AD.\nCrit deals 15% Less Bonus Damage. \nGenerates 2/2/3/3/4 stacks of Stronger with time stacks.\n\nW: Ancient Grudge 50Energy  30/27/24/21/18sec\nHidden Passive: Enemies who buys Youmuu&#039;s Ghostblade{{item:3142}} take 1% Bonus Damage from Yumo\nUsing an unknown force, extending his next attack to become ranged of +300/350/400/450/500. \nAs well as tapping into the Life of the opponent dealing 5/6/7/8/9%MAX HP +60/100/140/180/220+80/90/100/110/120%AD\nover 4 seconds.  As well as losing 4/7/10/13/16 Armor and MR for 4 seconds every time they are attacked by YuMo while taking the damage.\nGrants 1/1/2/2/3 Stacks every time they are attacked.\n\nE: Force of the Youmuu  No Cost 20/18.5/17/15.5/14 seconds.\nPassive: Gains 5/7.5/10/12.5/15% Movement Speed and 10/15/20/25/30% Attackspeed\nActive: Channels for 1.5/1.25/1/0.75/0.5 seconds before enhancing his blade. Gaining triple the Bonuses and a 10/15/20/25/30% Armor penetration buff for\n4/4.75/5.5/6.25/7 seconds. Increases by 1 second for every 10% HP he is missing. The passive is removed during the cooldown.\nHowever, if Yumo loses more than 60% of his Current Health after the effect is lost, the passive will not be lost and the cooldown is reduced by \n2/3/4/5/6 seconds.\n\n\nR: Path of the Chosen 80/75/70 Energy 3 seconds cooldown\nSelecting an enemy within 475/550/625range and dashes to them after a short 0.3/0.25/0.2sec delay. Applying Grievous wounds for 3 seconds and stuns for 0.75/1/1.25 seconds as well as dealing 100/175/250+70%AD Physical Damage. Gains 2 Stacks of Stronger with time. If the enemy is killed, the Energy is refunded and gains an additional 5 stacks of Stronger with time.\nKilling an enemy with this spell reduces the Cooldowns of all abilities by 4/6/8 seconds as well as granting MAX CDR for 5 seconds.","replies":[{"poster":"LUPIN lll","date":"2016-03-01T11:30:12.851+0000","up_votes":1,"down_votes":0,"body":"I know it's a hidden passive, but 1% damage is alot :P. Maybe +1 damage. \n\nAs for my opinion of the kit... Steroids. Stat steroids EVERYWHERE. In my opinion, it's a really boring kit.\n\nThe Q is a cool idea. I like.\n\nThe W is cancer. I think that's enough said.\n\nThe E is just stat steroids? \n\nThe R is a point and click gapcloser stun that makes you do damage and be able to spam abilities?\n\nOverall, I think it's a really bland kit with little counterplay","replies":[]},{"poster":"Captain Cancer","date":"2016-02-21T10:43:31.983+0000","up_votes":1,"down_votes":0,"body":"There are some sweet ideas here. Bit of tuning needed, e.g. 8% life steal per second in combat is cancer.","replies":[{"poster":"Suki no Sukiru","date":"2016-02-21T10:44:27.598+0000","up_votes":1,"down_votes":0,"body":"ehhh ik..........","replies":[]}]}]}