{"poster":"Jocr","date":"2016-07-29T07:35:26.064+0000","title":"Bild für Homepage verwenden","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hallo, \r\n\r\nich habe dieses Bild hier entdeckt was mir ziemlich gut gef&auml;llt. Ich w&uuml;rde es gerne als Hintergrundbild f&uuml;r unsere Community Homepage verwenden. Wir haben keinerlei kommerzielle Absichten o.&auml;. Darf ich dieses Bild verwenden? Habe mal gelesen hier, dass die Bilder verwendet werden d&uuml;rfen allerdings ohne kommerzielle Verwendung. \r\n\r\n[League of Legends Bild - KLICK](http://hdimagesnew.com/wp-content/uploads/2015/08/League-of-Legends-Wallpaper-0.jpeg)\r\n\r\nW&auml;re um Rat sehr dankbar !","replies":[{"poster":"Zamonianer","date":"2016-07-29T17:48:26.607+0000","up_votes":1,"down_votes":0,"body":"Wenn du das Bild allerdings nicht selbst von deinem Server bereitstellst, darfst du es \"unter Verwendung der Framing-Technik\" (EuGH, Beschluss vom 21.10.2014 - C-348/13) auf deiner Website einbinden.\n\nGruß\nZamo","replies":[{"poster":"Jocr","date":"2016-07-30T16:29:12.971+0000","up_votes":1,"down_votes":0,"body":"Danke, aber ich habe andere offizielle Bilder gefunden die ich verwenden darf.","replies":[]}]},{"poster":"Humpelstilzche","date":"2016-07-29T08:03:24.124+0000","up_votes":1,"down_votes":0,"body":"> Habe mal gelesen hier, dass die Bilder verwendet werden dürfen allerdings ohne kommerzielle Verwendung. \n\nFür nicht-komerzielle Fan-Projekte darst du Riots geistiges Eigentum frei verwenden...allerdings ist das was du da verlinkt hast keine Homepage und die Kunstwerke dort sind nicht alle von Riot und dürfen somit von dir nicht verwendet werden. \n\nVerwenden darfst du also nur was du auf Riots Internetseiten und im Client selbst findest bzw. eindeutig von Riot stammt.","replies":[{"poster":"Jocr","date":"2016-07-29T08:14:51.858+0000","up_votes":1,"down_votes":0,"body":"Ok super, dann werde ich wohl weitersuchen müssen.","replies":[]}]},{"poster":"Maexle","date":"2016-07-29T07:44:28.513+0000","up_votes":1,"down_votes":0,"body":"Im Zweifel solltest du  den Riot Support anschreiben.\nWenn du es über eine Google-Suche gefunden hast, kannst du selbst herausfinden, ob du es verwenden darfst, indem du die Sucheinstellungen änderst, so dass dir nur Bilder angezeigt werden,  die weiterverwendet werden dürfen oder auch die nur ohne kommerzielle Nutzung weiterverwendet werden dürfen.\n{{champion:17}}","replies":[]}]}