{"poster":"SlurpeeCupFurbie","date":"2014-11-26T01:19:18.737+0000","title":"About the new poro themed ward skins (Rito pls)","subforum":"Concepts & Creations","up_votes":4,"down_votes":3,"body":"Alright, so I have to commend the people at Riot for the Poro-themed winter — genius.  The Poro ward skins are also adorable, as one would expect... However the death animation of Gentleman Poro, and Astro Poro are so sad.  {{item:3070}} {{champion:32}} {{item:3070}} Astro Poro suffocates in space, and Gentleman Poro's chair falls on top and crushes the poor little guy, unlike the regular Poro skin where he just bounces it off.\r\n\r\n[You can watch the animations here.](http://youtu.be/pW8WMUorw9A)\r\n\r\nI think we can agree that these skins need some different animations; it will not only enhance their cuteness, but prevent players from being sad when clearing wards.","replies":[{"poster":"moonstones","date":"2014-11-26T02:47:24.695+0000","up_votes":5,"down_votes":0,"body":"The Astro dude isn't suffocating, he's just floating off into space! (May or may not be coming back...) As for the Gentleman, a chair fell on him, but it doesn't mean he's dead. :D \n\nIt was pretty hard for us to come up with a 'death animation' for a ward when it involved poros!","replies":[{"poster":"Apakakuta","date":"2014-11-27T13:18:28.907+0000","up_votes":4,"down_votes":0,"body":"No save the poro's,they are too cute to be mistreated! \n\nHowever in all seriousness. I think it would be much cuter if each poro ward skin the poro just left in some way:\n- normal rolls away as is \n-astronaut poro jet packs away \n-gentleman poro bows and vanishes like a cute magic trick\n\nOn a side note can we get each poro theme to be a ward skin too please? It'd be cool to have a dragonslayer poro and the evil shadow isle poro and the mechanical battle cast poros\n\nThe shadow isle death animation could be the poro dissappearing into a mist\nDragonslayer poro would run away from fire\nand Battlecastporo would turn into a ball with either rockets or a helicopter carry it away\n\nPlease Consider my input as these ideas would be awesome in game :) \nThank you for reading!","replies":[]},{"poster":"WickedKing","date":"2014-11-26T19:45:34.215+0000","up_votes":2,"down_votes":0,"body":"What about ripping the chair of and out comes the feather, as Poro just sneeze away from it.?","replies":[]},{"poster":"Acolyte of Steel","date":"2014-12-02T02:27:51.138+0000","up_votes":1,"down_votes":0,"body":"Maybe Astro-Poro looks confused for a moment, but then giddy as he notices a spiral galaxy that reminds him of a poro snack? {{item:2052}} \n\nGentleman poro's chair could fall backwards and let him tumble off unhurt, instead of being squished? \n\nJust some suggestions that maximize the adorable charm of poros, without fear of making the wee little guys too sad. :) {{item:2043}}","replies":[]},{"poster":"Hyrum Graff","date":"2014-11-26T04:18:03.877+0000","up_votes":1,"down_votes":0,"body":"Any chance we could see a change in Poro Rider Sej or Snow Day Malz? It's going to break my heart to play against them :(\n\nhttp://boards.na.leagueoflegends.com/en/c/memes/BjArBkv2-skins-shoudnt-increase-the-power-of-champions-riot","replies":[]}]},{"poster":"Sukishoo","date":"2014-11-30T03:07:47.410+0000","up_votes":1,"down_votes":0,"body":"Yeah the death animations made me sad when I saw those :( but the wards are just so cute I love them but never want to destroy them :(","replies":[]},{"poster":"California Ice","date":"2014-11-30T03:04:07.352+0000","up_votes":1,"down_votes":0,"body":"Whoever said poros must die are so mean! )';","replies":[]},{"poster":"inmUGco","date":"2014-11-26T04:03:27.381+0000","up_votes":1,"down_votes":0,"body":"i love Gentleman poro ~3D very coool~\nenemy was found it ，gentleman's clothes were taken away","replies":[]}]}