{"poster":"Uncle lroh","date":"2017-11-08T01:43:51.757+0000","title":"*BUG* \"BLUE ESSENCE\" FROM \"RUNES'\" ARE NOT COMING THROUGH","subforum":"[ARCHIVED] Help & Support","up_votes":10,"down_votes":0,"body":"I have completed the &quot;rune mission&quot; and was meant to receive 20000 + 7000 Blue essence but it has bugged and not come through. I want to purchase items for the blue essence sale but I will not be able to if I haven&#039;t received the BE from runes. \r\nI am on OCE servers btw.\r\n\r\nThanks,\r\n\r\nIts a player","replies":[{"poster":"Porocles","date":"2017-11-08T16:22:28.298+0000","up_votes":1,"down_votes":0,"body":"Hey guys, the OK, COOL essence notification is **NOT **all of your blue essence!  Many rewards are now mission based, which is a big change from when we used to take months to hand out rewards to everyone.\n\n**Check your missions**, you will see everything ranging from Blue Essence conversion to rune page skins, and veteran rewards. It can quickly be done on an AI vs Coop game if you need this quickly.\n\nOnce the mission is complete, you will find capsules in your **Hextech Crafting loot **to obtain your essence.","replies":[{"poster":"Negative Top","date":"2017-11-12T10:49:41.382+0000","up_votes":1,"down_votes":0,"body":"I understand what to do but i dont get the mission for it","replies":[]},{"poster":"morakaano","date":"2017-11-08T17:14:59.555+0000","up_votes":1,"down_votes":0,"body":"I wonder why this process has to be that complicated... Facing the challenge to set and learn the new rune system is one thing then this? I wonder if you guys were overthinking too much on this one. As a user, I can't really see the benefit of designing this transition complicated more than necessary (unless your business logic won over usability), yet thanks for the clarification. Pre-season finally has begun!","replies":[{"poster":"Porocles","date":"2017-11-08T17:29:20.557+0000","up_votes":1,"down_votes":0,"body":"This is really good feedback for our devs!  When you have time, go over in detail the complications you're feeling and any suggestions to make it better over at our [gameplay boards.](http://boards.na.leagueoflegends.com/en/c/gameplay-balance)  My perception is that having it mission based makes it a lot simpler for everyone to get their rewards in a timely manner.  In the past we would run scripts that could cause delays due to so many eligible players or issues if something/someone was missed.","replies":[]}]}]},{"poster":"Broporo","date":"2017-11-08T02:12:40.586+0000","up_votes":1,"down_votes":0,"body":"Did you go into your loot and open the capsules the mission gave you yet? Might have missed that little step, so double check your loot first and let me know.","replies":[{"poster":"St Jimmy44","date":"2017-11-08T08:50:23.192+0000","up_votes":10,"down_votes":1,"body":"After pressing the \"Okay, cool\" button to get my blue essence from my runes and rune pages i didn't get any of them","replies":[{"poster":"Eredor","date":"2017-11-08T10:43:03.856+0000","up_votes":3,"down_votes":1,"body":"the same happened to me :(","replies":[{"poster":"Sletel Verfield","date":"2017-11-08T12:36:04.727+0000","up_votes":3,"down_votes":0,"body":"I think i understood what riot ment : we have a mission that gives us BE, and the amount is not the same : i think we have to play a game before getting our runes's blue essence, is that right ?","replies":[]}]},{"poster":"Broporo","date":"2017-11-09T04:04:17.564+0000","up_votes":2,"down_votes":1,"body":"Clicking that button isn't supposed to give you the BE. As I mentioned above, you need to play a match to complete the new missions you have first, then open the orbs the missions give you.","replies":[{"poster":"CornHubx","date":"2017-11-18T15:10:46.351+0000","up_votes":1,"down_votes":0,"body":"my brother and my brothers friend got the quest for essence but i dint and ive played more than one game ive only gotten a capsule from lvling up they said the ygot 3000 blue essence from doing that quest\n\nign : anaastig16","replies":[]}]}]},{"poster":"thisblasiankid","date":"2017-11-09T20:45:15.432+0000","up_votes":3,"down_votes":0,"body":"The message said i would recieve around 100,000 blue essence but when i got my capsule it gave me 9,000. any reason why that would happen?","replies":[]}]},{"poster":"Quoi Suège","date":"2017-11-08T14:12:10.704+0000","up_votes":2,"down_votes":0,"body":"i have the same problem rito pls :(  i did not receive the capsule after I pressed \"Okay, cool\"","replies":[]},{"poster":"majikku2","date":"2017-11-08T13:32:04.804+0000","up_votes":2,"down_votes":0,"body":"I have the same problem i got no BE from runes at all.. I even played the mission but nothing happended..","replies":[]},{"poster":"Abraxina","date":"2017-11-08T13:32:00.213+0000","up_votes":2,"down_votes":0,"body":"Same Problem for me :/","replies":[]},{"poster":"Kiśele","date":"2017-11-08T13:29:58.572+0000","up_votes":2,"down_votes":0,"body":"Same! What the heck, riot?","replies":[]},{"poster":"Octopicake","date":"2017-11-08T13:28:18.929+0000","up_votes":2,"down_votes":0,"body":"Also having the same issue. Said I got like 30 or 60k and I hit okay. Hadn't updated at all.","replies":[]},{"poster":"Stefik07","date":"2017-11-08T13:25:51.071+0000","up_votes":2,"down_votes":0,"body":"same here","replies":[]},{"poster":"Airixas0421","date":"2017-11-21T20:02:12.420+0000","up_votes":1,"down_votes":0,"body":"Yea dude what the heck I didn't get reward but I had tons of runes long time ago when they were costing like hundreds, I don't get it when I logged on I just stayed with 705 BE... ;( I am so jealous my friends got tons of BE ;( I did same things they did and I didn't get BE","replies":[]},{"poster":"Sl4yerKing","date":"2017-11-11T00:37:05.840+0000","up_votes":1,"down_votes":0,"body":"Has anyone else had the issue of not getting a mission in the first place? I bought many runes and and a rune page, but I cannot find any mission, even under my completed missions there are no missions other than my daily win mission.","replies":[{"poster":"CornHubx","date":"2017-11-18T15:12:11.688+0000","up_votes":1,"down_votes":0,"body":"same happended with me my dood :(","replies":[]},{"poster":"Ulises Peraza","date":"2017-11-11T09:39:00.679+0000","up_votes":1,"down_votes":0,"body":"I have the same issue i never got the mission in the first place which means i cant complete it and my orbs do not show up in my loot. I've tried restarting the client but it doesn't work and I don't know what else to do. Some help would be appreciated.","replies":[]}]},{"poster":"DrPepega","date":"2017-11-17T21:26:17.386+0000","up_votes":1,"down_votes":0,"body":"So the game said I was going to get around 70k blue essence then I played the game and got about 15k had 9 orbs I clicked to open them and then got nothing...:/. What happened to the remaining 55k?","replies":[]},{"poster":"TlT1T1T1T1T1TlT","date":"2017-11-08T22:43:19.777+0000","up_votes":1,"down_votes":0,"body":"looks like you have to just play a game and then you get it?  Mine says \"play a game with the new runes\" and then I should get my 25k blue... since I had half of the old runes...","replies":[{"poster":"BlackChillDragon","date":"2017-11-14T07:22:19.553+0000","up_votes":1,"down_votes":0,"body":"I have the same problem too - I bought all quintessences and then all other runes to the runes limit and I only got 25k blue essences too.\nMy friend StravorPhönix got no missions and he also bought all runes to the runes limit.","replies":[]}]},{"poster":"Swìss","date":"2017-11-12T16:45:36.396+0000","up_votes":1,"down_votes":0,"body":"YEET","replies":[]},{"poster":"Next to Narnia","date":"2017-11-12T02:10:26.136+0000","up_votes":1,"down_votes":0,"body":"hi riot !\n\nmy blue essences has been lost after a game crush is its possible to fix it ? i finished all quests but i dont have my BE","replies":[]},{"poster":"cLuke","date":"2017-11-11T15:51:16.366+0000","up_votes":1,"down_votes":0,"body":"it happened the same to me, I completed the mission, received two orbs, opened them, but the blue essence amount was not increased. Also I received a chest for being honor 5, but the chest is nowhere to be found....","replies":[]},{"poster":"DoubleHoodiez","date":"2017-11-11T14:18:13.948+0000","up_votes":1,"down_votes":0,"body":"I dont even have the quests-missions. thats really irritating as most of my friends have them. I am pretty sure this i a bug.i also bought many runes in the previous season but ig gave me nothing only the be from the loot i had. FIX THIS","replies":[]},{"poster":"Dr Compadre","date":"2017-11-11T08:27:29.336+0000","up_votes":1,"down_votes":0,"body":"I have completed the mission and opend the loot thing, I even got my BE but when I tried to use it to buy a champion I wasnt able to, I figure I just had to restart. But when I did it siad I only had the 881 I had from before. So now I dont recived any at all. Have this happend to any other of you? And how do I fix it?","replies":[]},{"poster":"PepsiB","date":"2017-11-11T05:39:16.879+0000","up_votes":1,"down_votes":0,"body":"Same here","replies":[]},{"poster":"Möses","date":"2017-11-10T20:01:13.829+0000","up_votes":1,"down_votes":0,"body":"I never got the missions to refund my old runes. The only blue essence i got was the one i had in my loot and ip.","replies":[]},{"poster":"Merodie","date":"2017-11-10T19:38:51.086+0000","up_votes":1,"down_votes":0,"body":"i dont even have the quest. how do i get the quest ?","replies":[]},{"poster":"Lauren280","date":"2017-11-09T21:29:00.656+0000","up_votes":1,"down_votes":0,"body":"SO i just have a question about the missions. Are they mostly going to be on Summoner’s Rift? Because I only play ARAM (I know its rare) but I don’t think it’s fair to only accomodate rift player if that’s the case... Most of the world missions were all summoner rift based. And it rly sucks because I couldn’t get many tokens.","replies":[]},{"poster":"bongoo21","date":"2017-11-09T08:41:12.441+0000","up_votes":1,"down_votes":0,"body":"riot didnt give me capsule :( (pls fix bug)","replies":[]},{"poster":"DeepsorroW","date":"2017-11-09T02:01:46.663+0000","up_votes":1,"down_votes":0,"body":"Everything work fine it's just the method a bit unusual -  \n1 Step play the game with new runes as the mission say you will get the reward blue essence orbs \n2 step go to your loot and open orbs \n3  restart client if you did not get orbs after \"ok, cool\" or after opening orb your BE count did not increase.\nGot my self a good 50k   {{sticker:slayer-pantheon-rainbows}}","replies":[]},{"poster":"Killahnoe","date":"2017-11-08T21:07:47.185+0000","up_votes":1,"down_votes":0,"body":"Same here i never received any of the blue essence i was supposed to. I played a game of draft and i got everything except  my blue essence. I checked my hextech loot stuff and there was nothing there for me to receive.\n\n**FOR ANYONE STILL MISSING THEIR BLUE ESSENCE I JUST CLICKED ON MY LOOT AND THE BLUE ESSENCE SAYS 0/1 JUST CLICK OPEN AND IT WILL WORK. I RESOLVED THE PROBLEM THOUGHT THE 0/1 IS EXTREMELY MISLEADING   **","replies":[]},{"poster":"Richart","date":"2017-11-08T20:43:40.664+0000","up_votes":1,"down_votes":0,"body":"I had almost every rune and i had 10 runepages and i got  40k blue essence while my friend how made his account this year got 45k be. I have been playing since s2 and i got almost everything i could achieve within the game. so i wonder why this happening and i should have gotten a lot more be tbh","replies":[]},{"poster":"Yukí","date":"2017-11-08T20:24:18.194+0000","up_votes":1,"down_votes":0,"body":"**Hey Riot**, I have completed the missions, and one thing that I dont understand is why does it say on the mission: **Rune archivist** that as a reward you get **2 Epic Mystery skins** and I got **2 champions** (that I already owned) instead. -.-  it was kinda frustrating.. **is this suppose to happen or it was a bug?**  thanks in advance","replies":[]},{"poster":"zeptivial","date":"2017-11-08T19:54:23.996+0000","up_votes":1,"down_votes":0,"body":"I canøt open the essense capsules in my loot page","replies":[]},{"poster":"Tequíla Shot","date":"2017-11-08T19:11:10.631+0000","up_votes":1,"down_votes":0,"body":"i have the same problem","replies":[]},{"poster":"surflemon","date":"2017-11-08T08:10:58.473+0000","up_votes":1,"down_votes":0,"body":"i did redeemed them .. but after a game the BE disappeared :(","replies":[{"poster":"Jiriyah66","date":"2017-11-08T17:47:47.921+0000","up_votes":1,"down_votes":0,"body":"This happened to me, but they appear as a blue orb in your loot. You have to open them to claim the missing BE","replies":[]}]},{"poster":"INF3RNO902","date":"2017-11-08T16:10:11.748+0000","up_votes":1,"down_votes":0,"body":"I also have this problem.","replies":[]},{"poster":"Voegeley","date":"2017-11-08T16:03:27.361+0000","up_votes":1,"down_votes":0,"body":"same here. got the quest. played a game. won the game ^^ mission completed. no essences ;( but skins and other stuff\nAAAHHHHH  \n\nok they are in the loot section :DD\n\ngot it :D <3","replies":[]},{"poster":"Heppsak","date":"2017-11-08T15:48:10.882+0000","up_votes":1,"down_votes":0,"body":"Same here..","replies":[]},{"poster":"Sexismoney","date":"2017-11-08T14:32:25.262+0000","up_votes":1,"down_votes":0,"body":"nvm all good, go to your loot and open the blue essences! best regards","replies":[]},{"poster":"CHEEKY BNOC","date":"2017-11-08T13:07:32.496+0000","up_votes":1,"down_votes":0,"body":"Same here","replies":[]},{"poster":"D0UGLAS","date":"2017-11-08T12:59:36.293+0000","up_votes":1,"down_votes":0,"body":"Same here, are we doing something wrong?","replies":[]}]}