{"poster":"Simonus101","date":"2017-06-08T07:12:42.399+0000","title":"Code che spesso non si meritano!","subforum":"Aiuto e supporto","up_votes":4,"down_votes":2,"body":"Buon giorno Community! Io sono Simonus101, e sono &quot;nuovo&quot; del forum. Ho un account livello 20 e il mio personaggio preferito &egrave; Kayle. Volevo esporvi una questione: siccome io abito in un posto in campagna, e la mia connessione non &egrave; che sia cos&igrave; potente, spesso mi ritrovo durante la partita ad andare afk o addirittura ad abbandonare poich&egrave; il gioco va in palla. Tutti sappiamo che, cos&igrave; facendo, si accumulano le code, che sono abbastanza fastidiose. Avrei delle domande: il tempo di attesa prima di una partita si accumula ogni volta che si prende una nuova coda? (Nel senso: se prendi una coda da 5 minuti, e poi una da 10, c&#039;&egrave; la possibilit&agrave; di tornare a quella da 5?). In secondo piano, non c&#039;&egrave; un modo per far si che le code non vengano prese, poich&egrave; nel mio caso non &egrave; certo colpa mia... Ringrazio in anticipo chi risponder&agrave;, buona giornata!!","replies":[{"poster":"mangialavandini","date":"2017-06-08T08:31:30.728+0000","up_votes":3,"down_votes":2,"body":"Mi spiace dirtelo ma la colpa è tua\n\nnon la colpa di non avere una connessione stabile, certo.\n\nMa la colpa di essere consapevole di tale disagio e entrare in game, praticamente stai dicendo a 4 persone (alleati) che forse ci sei forse no \n\nnon mi sembra giusto nei loro confronti fari un 20 min o anche più di game facendoli sprecare tempo, quindi la Riot giustamente ti punisce prima con una piccola sanzione come un avvertimento, poi il ragionamento è semplice fai sprecare 20 min? ok e noi te ne diamo 20.\n\nLa Riot non ha il dovere di tutelare il giocatore che non rispetta i termini minimi per giocare, però se vuoi risolvere il problema o alleviarlo la Riot ha fatto delle guide molto semplici, dove passo passo ti aiutano a cercare una soluzione al problema.\nte ne metto due quà:\nhttps://support.riotgames.com/hc/it/articles/201752664-Risolvere-i-problemi-di-connessione\n\nhttps://support.riotgames.com/hc/it/articles/201752684\n\nSpero di essermi spiegato bene e di esserti stato di aiuto, Buon game\n\nPEACE","replies":[]},{"poster":"Sigmamoner","date":"2017-06-08T09:34:17.265+0000","up_votes":2,"down_votes":1,"body":"Ciao, come ti hanno già detto (anche se in un modo non molto conciliante) purtroppo puoi farci ben poco.\nCapisco il tuo problema, anch'io abitavo in un posto di campagna, dove la connessione è ballerina.\nSiccome sei nuovo, sia del forum che del gioco, probabilemente ti sfugge tutta la frustrazione che l'assenza di un giocatore causa alla partita.\nDevi sapere che questo genere di eventi (afk) è un classico e rovina l'esperienza di gioco a nove giocatori.\nFinché sei contro i bot, amen. Ma in pvp, e ancor più in ranked, la partita diventa veramente pesante.\nPer questo, se non hai un computer/connessione capaci di far filare tutto liscio, purtroppo LoL non fa per te (sei ancora in tempo, salvati!!! xD).\n\nRispondendo alla tua domanda, le code diminuiscono se smetti di andare afk per un po' di partite di fila.\nIn bocca al lupo!","replies":[{"poster":"Kim114","date":"2017-06-08T10:37:56.368+0000","up_votes":1,"down_votes":0,"body":"quante partite circa? è a partite o a tempo?\nperchè io ho preso le code ad aprile, le ho tolte tutte lo stesso giorno, per 3 mesi sono stato a casa di un mio amico con la fibra che giocavamo senza lag in 2 su due computer diversi, ho preso una coda sempre da 20 un mese dopo essere tornato a casa, partite fatte circa 100","replies":[{"poster":"Sigmamoner","date":"2017-06-08T11:06:49.625+0000","up_votes":1,"down_votes":0,"body":"Mi spiace ma non ho proprio idea di come funzioni...\nL'unica cosa, se per \"a tempo\" intendi che spariscono anche senza giocare, temo proprio di no.\nViceversa, non so se c'è un numero di partite target da raggiungere o un tot di minuti di gioco.","replies":[{"poster":"Kim114","date":"2017-06-08T11:08:12.240+0000","up_votes":1,"down_votes":0,"body":"grazie lo stesso","replies":[]}]}]},{"poster":"Sexy Win","date":"2017-06-08T10:27:22.660+0000","up_votes":1,"down_votes":0,"body":"> anche se in un modo non molto conciliante\n\nè un eufemismo xD","replies":[]}]},{"poster":"Kim114","date":"2017-06-08T11:10:20.503+0000","up_votes":1,"down_votes":1,"body":"ti racconto una storia, la storia della mia connessione e del mio paese\nvivo in un paesino di circa 10k abitanti, e non abbiamo la fibra\nun giorno, un cretino qualsiasi, BRUCIA TUTTO QUELLO CHE ERA POSSIBILE BRUCIARE E OLTRE facendo saltare corrente a tutto il paese per 1 giorno, io prendo la coda e dico: ok... colpa mia? no, non potevo sapere!\nRISUCCEDE a circa un anno dopo, arrestano il tipo, io tilto per la coda... cioè shish","replies":[]},{"poster":"SonoLaTuaOmbra","date":"2017-06-08T07:32:03.317+0000","up_votes":1,"down_votes":1,"body":"Non è questione di :\"non è colpa mia\" , se un player va afk (per qualsiasi motivo) viene sanzionato , perché prima di iniziare una partita bisogna essere sicuri di poterla finire per intero , non esiste la scusa \"non ho la connessione buona\" perché andando afk rovini la partita ad altre 4 persone quindi semplicemente assicurati di avere una buona connessione prima di iniziare una partita (per buona connessione intento una connessione che non ti faccia uscire dalla partita), comunque le code vado ad aumentarsi , è l'unico modo per non prendere le code e non andare afk.","replies":[]},{"poster":"Dr LouD","date":"2017-06-08T07:47:16.499+0000","up_votes":1,"down_votes":2,"body":"La Riot non ha il dovere di tutelare chi vuole giocare pur non disponendo dei requisiti minimi per farlo (in questo caso una connessione decente)","replies":[]},{"poster":"Laiho88","date":"2017-06-08T07:33:11.067+0000","up_votes":2,"down_votes":3,"body":"se sai già di avere problemi di connessione la colpa è tua, il tuo afk rovina i game degli altri, ti consiglio di dedicarti a giochi singleplayer se hai di queste problematiche","replies":[]}]}