{"poster":"Rumshum","date":"2017-12-31T01:26:36.810+0000","title":"Reclutamiento para jugador de platas para abajo.","subforum":"Reclutamiento","up_votes":5,"down_votes":0,"body":"Chicos, les cuento. Estoy creando un equipo que para la season que viene que es la 8. Jugar, pero posta. tanto en los eventos creados x la comunidad, como los propios de riot que van a a&ntilde;adir! :33 PEROOO enserio, jugar posta al 100% o lo mejor que se pueda. El chiste igual seria tener una conexion estable tambien xD. Si estan interesados avisen.\r\nLo unico que pido es que tengan skype y sean buena onda, osea nada de flameos ni nada por ese estilo.","replies":[{"poster":"LamonicaDisck","date":"2017-12-31T05:13:01.093+0000","up_votes":2,"down_votes":1,"body":"Buenas, yo cumplo con los requisitos solo que mi amigo también esta buscando equipo, el también cumple con los requisitos... si nos aceptan a los dos ok, sino suerte :3","replies":[]},{"poster":"Ammonrah","date":"2017-12-31T22:17:56.012+0000","up_votes":1,"down_votes":0,"body":"plata V atrapado en elohell hace dias buscando compas que no troleen(soraka jg -.-!!!!!! ) ni flameen solo jueguen y si se pierde que sea dando lo mejor de uno y viceversa","replies":[{"poster":"PansitoConQuesoo","date":"2018-01-01T08:42:22.583+0000","up_votes":1,"down_votes":0,"body":"De que jugas bro??","replies":[]}]},{"poster":"PansitoConQuesoo","date":"2018-01-01T08:40:50.680+0000","up_votes":1,"down_votes":0,"body":"Hola bueno tengo harto tiempo para jugar \nSoy Bronce 2 y en flex plata 3\nBueno de rol juego: Mid \nNombre de Invocador: Pansitoconquesoo\nSoy demasiado buena onda\nEdad: 17 \nViña del Mar \nFrecuentemente Juego de noche ( y si es posible la madrugada entera)\nUso Ts3, Skype, Discord, etc pero puedo descargar mas aplicaciones\nY si quieres ver como juego, podemos jugar sus flex para ver si quepo en el Team\n(Por si algun otro Team necesita un mid, que me comente porfa )\nGracias","replies":[]},{"poster":"Mussalim","date":"2017-12-31T16:34:40.285+0000","up_votes":1,"down_votes":0,"body":"Nombre: Mussalim\nPais: Chile\nCiudad: Santiago\nLineas: Adc y Mid\nBronce 4, volví a jugar este año después de un receso de más de 1 año.\nEdad: 20 años\nConexion: estable y veloz. Nunca me voy afk, nunca se me cae.\nDisponibilidad: 4 hrs. al día aprox., si no estoy me hablas por whatsapp y te digo si puedo conectarme o no.\nProgramas de voz: Twitch, pero no tengo problemas en descargar otro.\n\n{{champion:110}} {{champion:236}} {{champion:222}} \n\nPruébame en un par de flex para que veas si te sirvo.\nSaludos","replies":[]},{"poster":"Gatito Jugon","date":"2017-12-31T13:10:55.111+0000","up_votes":1,"down_votes":0,"body":"Es importante que especifiques que edades buscas, porque eso influye muchisimo en el equipo y la relacion de los jugadores","replies":[]},{"poster":"Fakross","date":"2017-12-31T09:25:48.173+0000","up_votes":1,"down_votes":0,"body":"(Razziel2017 me encanto tu presentacion, te la copio en este foro para presentarme)\nNombre: Fakross\nPais: Argentina\nLineas: Jg y Sup\nPlata V Nivel 43, llevo dos años activo.\nEdad: 17 años\nConexion: Arnet 100 gb, Estable 60 Pin.\nDisponibilidad: 4 a 5 horas, mas frecuentemente en la noche.\nProgramas de voz:Skype y Discord, sin problemas en descargar alguna otra aplicacion.\n\nActualmente tengo buena jugabilidad, exelente toma de decisiones a principios de partida, decaigo mucho juego medio y tardio, Me encanta el juego en equipo y los Invade y contra Invade, Siempre juego con buena onda y nunca Flameo.\nSALUDOS!","replies":[]},{"poster":"shenklo","date":"2017-12-31T09:16:58.762+0000","up_votes":1,"down_votes":0,"body":"si queres invitame y probamos, soy oro 5 y segyro me deja en plata 2 o 3 cuando reinicien, juego mid pero tambien se jugar adc","replies":[]},{"poster":"Razziel2017","date":"2017-12-31T07:07:16.369+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rumshum,realm=LAS,application-id=z7ypWKrA,discussion-id=soFg3KdN,comment-id=,timestamp=2017-12-31T01:26:36.810+0000)\n>\n> Chicos, les cuento. Estoy creando un equipo que para la season que viene que es la 8. Jugar, pero posta. tanto en los eventos creados x la comunidad, como los propios de riot que van a a&amp;ntilde;adir! :33 PEROOO enserio, jugar posta al 100% o lo mejor que se pueda. El chiste igual seria tener una conexion estable tambien xD. Si estan interesados avisen.\n> Lo unico que pido es que tengan skype y sean buena onda, osea nada de flameos ni nada por ese estilo.\n\nNombre: JoA\nPaís: Uruguay\nLineas: Top/mid. (mas que nada top)\nDivision: Unranked lvl 48 (subiendo con doble buf, para ampliar Champs pick) , volví luego de casi dos años ausente con cuenta nueva (ex Oro 4 en 2015, Plata 2 en las primeras 10 de 2016 con smurf) \nMains: Top (poppy, urgot, rumble, jayce. practicando riven), Mid (annie, jayce, kayle, Mordekaiser, GP).\nEdad: 28 años\nConexión de banda ancha: Fibra óptica 120gb, (20mb bajada, 5-10 apx subida) .\nDisponibilidad horaria: 5-8 hs diarias apx.\nProgramas de voz: Discord, Skype, Team Speak.\n\nActualmente como mencione antes estoy expandiendo champs picks, probando nuevos estilos de juego según composiciones, me adapto fácil al juego en equipo.\n\nSaludos","replies":[]},{"poster":"Tomas3D","date":"2017-12-31T01:54:34.711+0000","up_votes":2,"down_votes":2,"body":"cumplo todos los requisitos agrega,eso si para la s8 ya voy a ser oro.","replies":[{"poster":"Honor My Zed","date":"2017-12-31T03:54:20.352+0000","up_votes":1,"down_votes":0,"body":"Entonces si vas a ser Gold no los cumplis!\n\nSuerte con eso el año que viene, estuve viendo que te falta muy poco!\n\nLuego tratá lo mas rápido posible de salir de Gold 5 :(\n\nEs un tormento terminar ahí, la mayoría de las ligas V tienen menos nivel que las otras por el hecho de jugadores que subieron una liga y están satisfechos.\n\nSuerte :)","replies":[{"poster":"Tomas3D","date":"2017-12-31T04:44:01.905+0000","up_votes":1,"down_votes":0,"body":"Sabias palabras,lo voy a tener en cuenta.\n\nSaludos y suerte. :)","replies":[]}]}]},{"poster":"Neyst","date":"2017-12-31T02:02:44.057+0000","up_votes":1,"down_votes":0,"body":"hola que tal em podria participar si lo deseas , tengo dos cuentas en oro pero las abandone por querer jugar una nueva cuenta y hacerla mid , el chiste de esto es que quiero tener mis propios campeones \"main\" en el perfil y a si crecer mecánicamente.\n\nsoy un jugador que le gusta jugar mucho en equipo pero no le gusta el solo q , jugando mid creo que empezare a jugar bastante solo q ya que todo el tiempo voy a estar practicando campeones nuevos\n\ntengo 20 años  con microfono y con discord , pero no tengo problemas en descargar skype \n\nde ultima mientras subo niveles podria quedar de suplente ? no juego mal de mid solo me falta practica , espero respuesta ! Saludos","replies":[]}]}