{"poster":"YellowBrickRoad","date":"2016-12-17T07:47:39.340+0000","title":"So ive been experimenting this season and quite frankly this isnt very shocking.","subforum":"Miscellaneous","up_votes":1,"down_votes":2,"body":"Randomly started losing games despite playing to the same level of play i had been since the start of this season (the same level of play which has resulted in me having a 62% overall winrate over about 55 games) so i decided to go over the games where i lost but felt like i played good and noticed a pattern, literally every single last game had atleast one person with a sub 40% winrate, im talking winrates like 22% etc etc.\r\n\r\nSo i started screening my teams before every game and dodging the sub 40% winrates, proceeded to win 7 games in a row, went back to not screening and id lose a couple games win a couple games then lose a couple again, went back to screening boom another 6 wins in a row.\r\n\r\nWhat i basically figured out is that if i literally screen out trash that somehow got boosted to bronze, i win literally every game.\r\n\r\nSo now that im just going to dodge all the shitters i expect my winrate to go from 62% to around 70-80%, or in otherwords about equal to my main champion winrates.","replies":[{"poster":"Fitzky","date":"2016-12-17T09:07:04.692+0000","up_votes":3,"down_votes":0,"body":"YellowBrickRoad complaining about matchmaking isn't very shocking either","replies":[{"poster":"Cakemeisting","date":"2016-12-17T09:08:26.043+0000","up_votes":1,"down_votes":0,"body":"Wasn't he the guy that said he had made his last post on these boards, a few weeks ago? ;)","replies":[{"poster":"Fitzky","date":"2016-12-17T10:59:58.463+0000","up_votes":1,"down_votes":0,"body":"Probably, he really needs to shut the fuck up tbh I'm about done with his constant whinging about the same thing over and over, pretty sure he's had a board ban as well","replies":[{"poster":"YellowBrickRoad","date":"2016-12-17T11:48:26.910+0000","up_votes":1,"down_votes":0,"body":"Never been banned, people have been banned for constantly bitching on my posts before though, since it constitutes as harassment.\n\nonly reason you havnt heard from me for a month is a much better game dropped an update (path of exile) so i went and played that till i accomplished my goals for that expac.","replies":[]}]}]}]},{"poster":"Cakemeisting","date":"2016-12-17T09:00:07.943+0000","up_votes":1,"down_votes":0,"body":"The Artful Dodger is probably a good strategy. Sucks that you have to do it, but yeah matchmaking is pretty random right now.","replies":[{"poster":"Gesteppie","date":"2016-12-18T23:24:34.720+0000","up_votes":1,"down_votes":0,"body":"Matchmaking has never been random, but it does seem random after the Season \"soft reset\" because everyone isn't in the tiers that they previously were. Which makes matching seem random.\n\nThese are the 3 simplified things match making basically does.\n\n1. Your team will never be outside 5 teirs of each other. So lets take a Silver 3 person. He can either be in a game with people up to Gold 3, leaving him at the lowest point, or in a team with people down to Bronze 3, leaving him at the highest point.\n\n2. The \"average\" mmr of each team will always be closely within each other, BUT the match making system will ALWAYS favour one team over the other.\nLike Blue team could have a mixture of Bronze and Silver players, and Red team could have a mixture of Silver and Gold players.\nIts not always as radical as that; most games will have teams within the same rank as each other.\nBUT this can make the game seem \"unfair\" and be more difficult to play. \n\n3. HOWEVER, if the \"favoured\" team loses, there is a much greater reward for the \"unfavoured\" team in extra lp and a harder loss for the \"favoured\", losing extra lp.\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Cakemeisting","date":"2016-12-19T18:46:52.519+0000","up_votes":1,"down_votes":0,"body":"Lets put my point into more context here.\n\nOne. A player who was Platinum last season but now because they are in Silver 2 after placements can be matched with Bronzes. People will say their mmr is high but they were placed lower. Well why not tell matchmaking this also! Also a player who is Bronze 4 can be in a game with a player who is Gold 1 (on their team). On the opposition team they will have Bronzes and Silvers. Gold 1s are generally not boosted bonobos like Gold 5 players. Is that fair?\n\nI still don't see the point of resetting ranks at the end of the season. If you are bad with a new patch, your mmr will slowly decline to it's proper levels. But resetting everything always upsets the lowest and the highest extremes of the ranking population. Challenger have to play monkeys and Bronzes now have to play with woods. Challengers will climb because their monkey teammates have some basics on how the game works. Bronzes will take forever to climb because their teammates don't, and they are not godlike enough players to burn a bunch of wood in the elo hell fireplace. As I've stated on a previous thread, a 200 point mmr difference at low elo is negligible while a 200 point mmr difference at high elo is very decisive.\n\nTwo. In this case the Golds and Silver team will beat the Silvers and Bronze team more than 75% of the time. Thats how elo works, unless players are boosted and their rankings are not accurate. So why not make the matchmaking system WAIT until players are around similar levels, rather than waste 20 minutes of everyone's time?\n\nThree. This is true, but who cares if you win a meagre amount of points, or lose a meagre amount? It's essentially a waste of time for both teams. Matchmaking should be there to find similarly SKILLED teams so that the game is actually a contest.\n\nWith this in mind, the matchmaking is as close to random as I've ever seen in in 2.5 seasons of play. Hence what YellowBrickRoad is doing is cutting through the Riot PR bullshit and actually proving that matchmaking is flawed.\n\nI would think that matchmaking would be far more accurate if divisions were not implemented, and players just had their mmr number next to their names, like in chess, where their elo is displayed. I guess Riot decided not to display this number incase of bad matchmaking? Or was it to cushion the blow for some players who were embarrassed about their mmr number, when in reality its just a form guide and they should not worry about it, only about improving their game.\n\nOne thing's for sure: the level of play on the OCE server in every tier is pathetic and has been in a steady decline for 2 years. Even Coach Jish (Chiefs head coach to those who don't know) has to make his own group so that pro players can get proper competition! This is because Challenger games are riddled with low Diamond and Platinum guys that are just easybeats, and no, i'm not talking about the start of the season. \n\nRiot should keep things simple so as to not upset the majority of the players (on OCE we are talking about 75% of the server being under Silver 2 level). I'm giving this game one more year to sort itself out. If it doesn't, I'm gone, which is a shame because the game itself has a very good concept and some nice quirks. But the constant meddling with it just ruins the experience. Go back to **solo queue mode where there is no duoing possible**, and if you want more people to team up, bring back ranked 5s teams again! That will stop all of this mmr bullshit happening. Riot should also seriously consider a legacy mode, where you can go back to certain patches and play. I guess they won't do this for Oceania, due to our low server population, but I'd be interested to see what would happen on higher population servers. I could bet that a lot of people would skip any patches with 5.xx and 6.xx in them.\n\nThis game used to be really fun to play, but the constant meddling with systems (e.g. dynamic queue) that are a quick fix but a long term nightmate causes the community morale to seriously drop. I've never seen so much hate talk in games than in the current state it is in.","replies":[]}]}]},{"poster":"BarryButcher","date":"2016-12-19T04:33:52.525+0000","up_votes":1,"down_votes":0,"body":"I mean just glancing at your match history you die alot. like A LOT. Like double figures in almost every game. I don't think you can blame everything on your teammates with figures like that.\n\nhttp://oce.op.gg/summoner/userName=YellowBrickRoad\n\nThat being said, with low Bronze MMR you are going to get people with sub 40% winrates. There are people in Bronze 5 who should really be in Bronze 8 but Riot put a bottom on the rankings.\n\nWith a winrate of over 55% i wouldn't be complaining. That high winrate is what people should aim for. You sitting around 60% is good. You honestly think you'd be able to hit 70% with your method, it would be very interesting to see.\n\nI would emplore you to edit this post or something, once a week, with updates. Number of dodged games etc and we can see how it goes.\n\nCurrently you sit: 56 - 40. 58% Winrate. Bronze 3 52LP.\n\nlets see how far you get.","replies":[]},{"poster":"Miicka","date":"2016-12-18T16:14:32.594+0000","up_votes":1,"down_votes":0,"body":"The only thing that's shocking is your incapability to type the word \"I\" and capitalise it. \n\nIt greatly triggers me.","replies":[]},{"poster":"Project Xayah","date":"2016-12-17T23:41:39.626+0000","up_votes":1,"down_votes":0,"body":"An interesting experiment. Definitely something I'd be interested to see the results of on other accounts (when push comes to shove, 1 account likely doesn't provide a very accurate depiction of the situation). One thing that concerns me, though, is dodging punishments, as in how do you go about dealing with them? If I'm not mistaken, repeated dodging is a good way to lose LP (though you'd likely be winning much more than you're losing if you're having those kinds of win streaks) and receive LPQs.","replies":[{"poster":"YellowBrickRoad","date":"2016-12-18T15:27:50.551+0000","up_votes":1,"down_votes":0,"body":"My winrate with the dodging method far outweighs the lp i lose from dodging.\n\nThe amount of lp i lose from playing with bad teams also far outweighs the lp i lose from dodging.\n\nAnd as for what i do during the wait? i go and play other better games that i dont have to dodge just to get good teams in.\n\nFor context when i say good, i just mean belong in this elo, not belong in an elo thats 3 tiers below this elo, aka the teams i dodge.","replies":[]}]},{"poster":"dragon poo","date":"2016-12-17T09:08:53.023+0000","up_votes":1,"down_votes":0,"body":"honestly i wish we would just get placed in matches against people in the same division as us, bronze, gold, silver etc., i feel that the quality of game would go up for lower elo, and as fr higher elo, you could put two division together like they already do. would make games fairier and have people that want to climb climb against people in the elo that they are in, not against the people that the want to be in the same elo with.","replies":[]}]}