{"poster":"YellowBrickRoad","date":"2015-10-13T03:43:40.115+0000","title":"Warning: Constructive Criticism ahead, dont read if you are a walking salt factory.","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":2,"body":"Ok so i just came out of a game where i went against garen top with a riven (my mains only bronze so frankly i wasnt going to get anywhere anyway) but in my weaknesses i very quickly realised where garen is truly broken.\r\n\r\nSome will say its his new passive which can heal him to full health just by disengaging for a few seconds, but no thats fine, tryndamere q and gangplank w both heal for alot more than garens passive and those dont make them &quot;omgwtfop&quot;\r\n\r\nIs it the true damage on his ult? Well you would think that but again no, the ult requires you to be the villian and even then chogath ult does more damage or you could just look at other champs that can do true damage (sated devo master yi anyone?)\r\n\r\nSo if its not his passive, and its not his damage what is it?\r\n\r\nWell its his q obviously.\r\n\r\nMore specifically the movespeed portion of it.\r\nNow heres my justification, The entire juggernaut patch was supposed to be about making tanky hulk champions that move slow as balls but hit hard as fuck.\r\n\r\nLike &quot;you get caught you deserve to die&quot; type champions.\r\n\r\nSo its pretty backwards giving one of said champions a movespeed boost that is literally more powerful than movespeed boosts from champions such as shyvana w or singed&#039;s ult, or ghost even.\r\n\r\nYes q is faster than ghost.\r\n\r\nTo put it into perspective if you were to rush Ionian boots as your first item you would have a base ms of 385, after q you go up to 480, this is enough to very easily chase down even the fastest of champs, but it gets worse, because of the relatively low cd of q along with the cdr from the boots you can just spam q over and over until you finally catch your prey.\r\n\r\nTheres no ambushing, no skillful outplays to catch your opponent, not even any building certain items to catch up, just a &quot;i win&quot; button that makes him go faster than sanic and then silence you for the kill.\r\n\r\nTo put it into perspective if the ms boost was say 30 ms instead of an insane 100 ms with those boots you would atleast have to think before you q, and it wouldnt be certain death for anyone just a smidge too close (aka in range to get cs) \r\n\r\nHell frankly i wouldnt care if his ult was literally a one hit kill ability with a kill reset and heals him for half the damage it dealt, if he didnt have his q.\r\n\r\nBecause even that would be more balanced than he is right now.\r\n\r\nTl:Dr nerf the movespeed boost or remove it entirely, it breaks the theme of the juggernaut update.","replies":[{"poster":"Robo23","date":"2015-10-13T09:25:20.336+0000","up_votes":1,"down_votes":0,"body":"Well the thing is that garen can either build full tank or full ad. IF he builds full tank then the movement speed wont do too much. If he builds full ad then he is easy to kill. He needs the boost to survive.","replies":[{"poster":"YellowBrickRoad","date":"2015-10-13T18:53:19.423+0000","up_votes":1,"down_votes":0,"body":"Youve clearly never been one shot by a full tank garen that runs at you like a train.\n\nHave you even seen him post rework?\n\nlet alone played him.\n\nActually id like to give you some context on why garens q is broken.\n\nGarens q is literally a level 3 warwick e, baked into an auto attack reset, that is also a 1.5 second silence.\n\nTake away any one of those three components and it stops being aids.","replies":[{"poster":"Robo23","date":"2015-10-14T06:00:56.643+0000","up_votes":1,"down_votes":0,"body":"i play him quite a lot, check out my champ masteery","replies":[]}]}]},{"poster":"GigaPube","date":"2015-10-13T17:01:56.256+0000","up_votes":1,"down_votes":0,"body":"WOTS THIS? A RIVEN MAIN COMPLAINING ABOUT GARENS Q?!?!?!?!? BY GOLLY THE MAYANS WERE RIGHT. THE APOCALYPSE IS HERE","replies":[{"poster":"YellowBrickRoad","date":"2015-10-13T18:50:46.427+0000","up_votes":1,"down_votes":0,"body":"Im a singed main actually.\n\nAs someone who mains a champion that is literally sanic, when im complaining that someones movespeed is to high its a pretty valid complaint.","replies":[]}]},{"poster":"Bookbash","date":"2015-10-13T18:14:31.125+0000","up_votes":1,"down_votes":0,"body":"Do you guys think Kayle is a reasonable counter to Garen in top lane? With Q you can kite him back.","replies":[]},{"poster":"DragonOfTheVoid","date":"2015-10-13T05:11:51.954+0000","up_votes":1,"down_votes":0,"body":"Garen has always had that passive.\n\nYou wont a broken champ look at {{champion:23}} now before your like omfg your a nub go away look at this build and il tell you why he is op after.\n{{item:3153}} {{item:1300}} {{item:3031}} {{item:3046}} {{item:3071}} {{item:3026}} \nnow the  build path \n{{item:1053}} >{{item:1001}}>{{item:3031}}>{{item:1300}}> {{item:3153}} >{{item:3046}} >{{item:3071}} >{{item:3026}} \nNow for why its op broken what ever you wont to call it.\nThe thing that stop trind is cc or kite now with this build he gets 534 move speed just from hitting you 1 time and 498 from using his e now why Its the boots and black clever as the passive move speed you get from them stack, 90% crit as his passive gives crit, near 400 ad a free life, 30% armor pen, % hp damage add this with his w slow witch takes away 80 ad at max rank a 300 hp heal from his q and his e spin a gap closer with his ult a 5 sec invincible no die op ult and you have some one with 1200+ crits 500+ move speed a slow a heal and basically 3 lives. \nnow tell me who is op this rageing hunk of manliness or garen with a magic sword that falls from the sky p.s. this guy has a ult that counters garens magic sword. \n\nGaren atm is fine tryind on the other hand if I see some one using my build I shit my self.","replies":[{"poster":"Jink","date":"2015-10-13T09:59:28.457+0000","up_votes":1,"down_votes":0,"body":"\n{{summoner:6}} {{summoner:14}} \n\n{{item:3153}} {{item:3006}} {{item:3087}} {{item:3031}} {{item:3142}} {{item:3172}}\n\nI don't know why you'd go cleaver since it takes 6 autos to cleave them for 30% when you could be hitting for 35% pen from the first auto. Last whispers not always a necessirty though and his builds should vary, using the same build over and over again isn't always optimal seeing as some games incorporating a bloodthirster can help you duke it out with assassins or junglers like Yi and sometimes Youmuu's is a good buy, other times a Phantom Dancer can be better than Shivv - but if they have no MR sometimes a quick Shivv works out better, sometimes you can even just {{item:3144}} {{item:3006}} {{item:3031}}  and then go for a {{item:3046}} or {{item:3142}} or {{item:3035}} - Get exhausted though and you need to commit hard to fights and you really need your team and if they have a Warwick you're sorta in a bit of trouble because a QSS is expensive and if you didn't need to grab one you could have spent that G on early damage or attack speed and crit chance to snowball so having to buy it sets you back a lot plus it isn't always off cooldown because there are other ways you can use it - also a lot of hard CC like annies and Tahms can smash you.\n\nTahm kench eating your target can be gamebreaking for trynd plus he can quickly get a Q and two autos on you and eat you and spit you basically as your ult is down or completely negate your engage and turn fights into a 4v4 then spit you into his team etc or turret plus if he times it right during dives or engages where you are usually quickly focused down being eaten can get you killed.","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-13T10:21:12.451+0000","up_votes":1,"down_votes":0,"body":"yes and no iv tried many builds but this one seems to be the best you can say what you wont but try it and you will see the power","replies":[{"poster":"Jink","date":"2015-10-13T10:46:47.043+0000","up_votes":1,"down_votes":0,"body":"Flat armor pen's good for killing squishies though {{item:3142}} \n\nThe Distortion enchant increases your MS boost from Ghost to 40% up from 27%.\n\nIf they have a tank Jungler and a Tanky top like a Shen with like 300 armor you'll be doing more damage from the get go with {{item:3035}} and you'll be doing like 30% more damage for all your autos where cleaver will take 6 autos to get them to about 28% more damage. I spose it helps allies though. I tend to dive with Trynd a lot though which is why I take ghost and don't really go for assisting allies but just jump their carries and smash people lol but it looks like a decent build.\n\nSometimes {{item:3140}} is good if they have like an Annie because you can just cleanse and continue damaging in a fight and cleanse exhausts and such and it's a pretty late game build - most of my ranked games are over within 25 minutes so I sort of go for early game power or capitalize getting into late game with {{item:3035}} after {{item:3153}} and {{item:3087}} or {{item:3046}} instead of {{item:3087}} if I've farmed a bit. \n\nI like getting {{item:3093}} with boots or {{item:3144}} next if it's an easy lane so that I can sit safe and go for mid game with the Avarice Gold gen and minion bonus gold plus it upgrades into {{item:3087}} or instead take a {{item:3142}} if you wanna dive their carries early or maybe if they don't have a lot of CC or tanks and you can even leave it and rush an {{item:3031}} second item then go for a {{item:3046}} or some lifesteal {{item:1053}}. \n\n{{item:3072}} can be really good to because it can help you deal with enemies if they have like 2 champs with {{item:3072}} or they have {{item:3072}} because it can help you win fights without having to ultimate or commit or even really take damage and can help you save your ultimate for ages plus because Trynd gets bonus damage and crit chance the lower health he has - if you can keep lifestealing your total damage output can skyrocket through you being able to sustained fight at low HP etc plus the Shield is awesome too.\n\nSometimes I'll even go {{item:3087}} and {{item:3046}} if I'm fed early so I have heaps of MS, can pressure the map, push quickly and take objectives fast and crit a lot - it sort of caps out your damage faster but sets you back a bit more mid-game.\n\nAttack speed it usually better for taking turrets than flat damage and you can't crit turrets either making these two items really good for pushing hard because while it might seem like hitting hard will take turrets faster, more attack speed - gold wise - in the early/mid game is more damage on turrets than an AD and IAS item or 2 AD items.","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-13T10:59:47.714+0000","up_votes":1,"down_votes":0,"body":"lol did I not just say I have tried all sorts of builds","replies":[]}]}]}]}]},{"poster":"YellowBrickRoad","date":"2015-10-13T03:45:37.629+0000","up_votes":1,"down_votes":0,"body":"To add to this ive played him a few times so im not just qqing ive made sure ive seen both sides of the fence.\n\nHe takes 0 skill to play and just isnt fun at all in his current state.","replies":[{"poster":"Jink","date":"2015-10-13T10:52:44.719+0000","up_votes":1,"down_votes":0,"body":"I pick him against Darius but other than that only pick him vs low CC teams or against top laners that can't harass early or force trades because if he gets a bit of farm not much can stop him and there are only a few champs I wont play him against but there are safer picks.\n\nI don't think he's bad lol, some Champs are more fun though.","replies":[]}]}]}