{"poster":"YellowBrickRoad","date":"2016-05-15T10:34:59.302+0000","title":"Man when is that league client update coming, adobe air is cancer.","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Windows 10 update for adobe products.\r\n\r\nBreaks league client.\r\n\r\nDoes every fix imaginable, finally gets past patcher crashing.\r\n\r\nBlack screen after login bug.\r\n\r\nTries everything possible, breaks patcher again.\r\n\r\ncant get into patcher to run repair client to repair the broken patcher (because fucking logic right)\r\n\r\nBreak down and realise i aint playing league tonight while i have to download 2 fucking gigs just to fix one tiny fucking file corruption due to having to reinstall league.\r\n\r\nGG no re.","replies":[{"poster":"Corehog","date":"2016-05-20T06:43:59.440+0000","up_votes":1,"down_votes":0,"body":"Here bro\n\nhttp://boards.oce.leagueoflegends.com/en/c/announcements/EzTL469v-league-client-update-alpha-sign-ups-now-open\n\nThe link is about 3 weeks old, but sign ups should still be accepted now :)","replies":[{"poster":"YellowBrickRoad","date":"2016-05-20T07:11:00.443+0000","up_votes":2,"down_votes":0,"body":"just signed up.","replies":[]}]},{"poster":"Corehog","date":"2016-05-20T07:12:56.684+0000","up_votes":1,"down_votes":0,"body":"Good luck man.\n\nHere's a link to another thread where you can see some of the new client, if you haven't seen it already\n\nhttp://boards.oce.leagueoflegends.com/en/c/miscellaneous/5Z7cWtwn-for-those-who-want-an-idea-what-the-alpha-client-looks-like\n\n:)","replies":[]},{"poster":"Corehog","date":"2016-05-20T06:28:52.682+0000","up_votes":1,"down_votes":0,"body":"You could apply for the Alpha testing now. It runs on HTML5 and is pretty smooth.\n\nThe Riot team that are tasked with it have been really good on responses and taking feedback. :)","replies":[{"poster":"YellowBrickRoad","date":"2016-05-20T06:41:28.422+0000","up_votes":1,"down_votes":0,"body":"If they will take me in for it id be glad to give them valid feedback.\n\ni have another thread where i literally break down all the components of the current system and then provided feedback on where they can be improved so im sure i can think of something to suggest to em.\n\nWhere do i sign up?","replies":[]}]},{"poster":"Kreator","date":"2016-05-16T10:20:01.009+0000","up_votes":1,"down_votes":0,"body":"Hey dude,\n\nI run windows 10 and i've not encountered any issues.\nhow old is the machine you're running on?","replies":[{"poster":"YellowBrickRoad","date":"2016-05-16T13:38:57.240+0000","up_votes":1,"down_votes":0,"body":"2 years old windows 10, 4690 with a 270x for the gpu, have league installed on an ssd.\n\nFrankly my system outclasses the average system used for league so thats not the issue.","replies":[{"poster":"Kreator","date":"2016-05-17T14:22:32.781+0000","up_votes":1,"down_votes":0,"body":"270x? dude thats oldschool, might want to consider upgrading if thats your actual iteration because... that could be a cause of your problems.","replies":[{"poster":"YellowBrickRoad","date":"2016-05-19T00:17:48.787+0000","up_votes":1,"down_votes":0,"body":"I get 300 fps with league maxed out.\n\nLike shit my gpu is the problem.","replies":[{"poster":"Kreator","date":"2016-05-19T07:53:58.012+0000","up_votes":1,"down_votes":0,"body":"300 fps isnt a good benchmark, it could be over clocking your PC and causing issues elsewhere. \nhave you recently defragged/scanned your PC for unwanted software?","replies":[{"poster":"YellowBrickRoad","date":"2016-05-19T10:12:15.796+0000","up_votes":1,"down_votes":0,"body":"1. i run an SSD defragging would shorten the life span of the drive by unnecessarily using delete cycles from the nand cells.\n2. my 270x is not overclocked, it was previously overclocked when i had it crossfired with my 7870 but that was for cryptocurrency mining, and i had only bumped it up by 100mhz as memory clocks were far more important for that project.\n3. Im qualified in IT and have 12 years experience, seriously anything you could possibly suggest to me tech wise ive already ruled out.\n4. 300 fps IS a good benchmark. It means that i can hit the refresh rate of my monitor 5 times over, aka there is no bottleneck in my system degrading my ingame performance.\n5. My issues are on my isps end, ive known this for months, all you are doing by suggesting my hardware doesnt work properly is insulting my knowledge on the topic.\n6. This topic is entirely about the shortcomings of riots client, not my computer, the proof is in the pudding in this regard, because a complete reinstall fixed it, aka the client corrupted itself.","replies":[{"poster":"Kreator","date":"2016-05-19T13:18:18.502+0000","up_votes":1,"down_votes":0,"body":"just because you've got ' 12 years in experience ' doesnt mean someone else doesnt know something. \nyou've already found your issues, then its not riots client, its your ISP.","replies":[{"poster":"YellowBrickRoad","date":"2016-05-19T13:58:49.534+0000","up_votes":1,"down_votes":0,"body":"*facepalm*\n\nNo the client is why it corrupted in the first place.\n\nThe isp is why it failed the reinstall.\n\nreading comprehension pls.\n\nI have a whole nother post where i go into a full detail break down of the clients flaws and where i personally could fix them if given the source code.\n\nGranted that post got downvoted to shit by riot supporters.","replies":[]}]}]}]}]}]}]}]},{"poster":"Niji","date":"2016-05-15T11:00:14.596+0000","up_votes":1,"down_votes":0,"body":"It should of came out like 2 seasons ago, Riot is still riding the \"We didn't expect to get so big so fast\" excuse that they have been for years now, all the Riot shills will come in here and back them up but frankly its unacceptable the most popular game in the entire world still doesn't have a non-Air client but hey what ya gunna do","replies":[{"poster":"YellowBrickRoad","date":"2016-05-16T03:40:16.993+0000","up_votes":1,"down_votes":0,"body":"I know right.","replies":[]}]}]}