{"poster":"YellowBrickRoad","date":"2016-02-05T17:22:00.305+0000","title":"Yet another rant, yellow style.","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"So ive been having a good couple weeks, hence why you havnt heard from me, ive won a few more games than normal despite huge lag from my new house, ive picked up and almost mastered jhin practically on release. lifes good.\r\n\r\nBut then i got that one morg, that one person dumb enough to make the entire 2 weeks horrible.\r\n\r\nI look back at all those good times and think &quot;this is just karma, league cant be fun, she was fucking with me, teasing the tip, just so she could sack whack me hard with this retard in ranked&quot;\r\n\r\nIt all made sense.\r\n\r\nI looked at this morg, so desperate trying to land q&#039;s, on minions.\r\n\r\nI watch as repeatedly the enemy yi times ganks so she doesnt have q up because he knows damn well she just wasted it trying to hit the full health twitch under his turret, and he knows damn well there is never any wards in the lane.\r\n\r\ni watch as she doesnt even have q at level 2, she has pool and black shield, and she tries to shield twitch w, every time, so even when she could make use of shield, its not even up.\r\n\r\nAs i slowly tear my hair out watching this train wreck, giving her honest advice on how to use her kit, she just retorts with the typical bronze excuses &quot;lol bro im not an aimbot&quot; as she misses the yi at point blank after he q&#039;s onto her.\r\n\r\n&quot;but my q does mad damage&quot; she replies as i say q is meant for cc not poke (maybe when we are ahead, but we are down 4 kills at this point)\r\n\r\nI very quickly realise towards the end of the game that despite numerous teamfights she has ulted a grand total of 2 times.\r\n\r\nAnd has easily by far the worst score on the team being 1/11, despite constantly trying to ks everyone and do &quot;mad damage&quot; with her q.\r\n\r\nFinally as im broken, a former shell of the man i once was, in post game champ select, just to rub salt in the wounds &quot;fucking toxic jhin, wasnt even good&quot;\r\n\r\nI... i dont know what to do anymore.... these people, these people that i play with are fucking idiots, morgana has been out for what, 7 years now? how hard is it to learn that her shield only blocks magic damage, and only works on certain types of cc.\r\n\r\ni repeatedly show that i am physically better than these people, but no matter how hard i trash them, theres always that one retard, that one fucker that puts me on mad tilt. and thats all it takes really, one person so undoubtedly stupid that im surprised they even figured out how to type their password into the client, let alone comprehend how the ranked draft system works.... and its all down hill from there.\r\n\r\nAs soon as i tilt it feels like ive just gone to the gym for 2 weeks and then taken a cheat month.\r\n\r\ni lose more progress than i made, because i cant stop?\r\n\r\nim better than them, i know that, so i keep going, to prove to myself that i can beat the tilt.\r\n\r\nBut no one can beat the tilt, no one.\r\n\r\nThere is no elo hell, but there is a tilt city, and im living in it, a dead end job carrying people who cant even realize when they are carried because all they see is the post screen numbers, and no hope to get out.\r\n\r\nBecause while i can play consistently, im playing consistently under tilt.\r\n\r\nAnd i know im not b5, not because i trash people.\r\n\r\nNot because i think everyones retarded.\r\n\r\nBecause the game actually gets easier as my rank goes up, technically it should get harder if i dont belong there, my winrate should go down due to tougher opponents, but if my experiences playing in b1 and silver (first placements) is anything to go by, that is far from the case, in fact i play better at such elos due to spending less time facepalming at my team and more time focusing on myself, knowing that i dont have to hand hold people.\r\n\r\nSincerely, a broken bronzetard.","replies":[{"poster":"Essembie","date":"2016-02-06T01:40:08.368+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=YellowBrickRoad,realm=OCE,application-id=Ntey9fRZ,discussion-id=jtEiMgmu,comment-id=,timestamp=2016-02-05T17:22:00.305+0000)\n>\n> So ive been having a good couple weeks, hence why you havnt heard from me, ive won a few more games than normal despite huge lag from my new house, ive picked up and almost mastered jhin practically on release. lifes good.\n> \n> But then i got that one morg, that one person dumb enough to make the entire 2 weeks horrible.\n> \n> I look back at all those good times and think &quot;this is just karma, league cant be fun, she was fucking with me, teasing the tip, just so she could sack whack me hard with this retard in ranked&quot;\n> \n> It all made sense.\n> \n> I looked at this morg, so desperate trying to land q&#039;s, on minions.\n> \n> I watch as repeatedly the enemy yi times ganks so she doesnt have q up because he knows damn well she just wasted it trying to hit the full health twitch under his turret, and he knows damn well there is never any wards in the lane.\n> \n> i watch as she doesnt even have q at level 2, she has pool and black shield, and she tries to shield twitch w, every time, so even when she could make use of shield, its not even up.\n> \n> As i slowly tear my hair out watching this train wreck, giving her honest advice on how to use her kit, she just retorts with the typical bronze excuses &quot;lol bro im not an aimbot&quot; as she misses the yi at point blank after he q&#039;s onto her.\n> \n> &quot;but my q does mad damage&quot; she replies as i say q is meant for cc not poke (maybe when we are ahead, but we are down 4 kills at this point)\n> \n> I very quickly realise towards the end of the game that despite numerous teamfights she has ulted a grand total of 2 times.\n> \n> And has easily by far the worst score on the team being 1/11, despite constantly trying to ks everyone and do &quot;mad damage&quot; with her q.\n> \n> Finally as im broken, a former shell of the man i once was, in post game champ select, just to rub salt in the wounds &quot;fucking toxic jhin, wasnt even good&quot;\n> \n> I... i dont know what to do anymore.... these people, these people that i play with are fucking idiots, morgana has been out for what, 7 years now? how hard is it to learn that her shield only blocks magic damage, and only works on certain types of cc.\n> \n> i repeatedly show that i am physically better than these people, but no matter how hard i trash them, theres always that one retard, that one fucker that puts me on mad tilt. and thats all it takes really, one person so undoubtedly stupid that im surprised they even figured out how to type their password into the client, let alone comprehend how the ranked draft system works.... and its all down hill from there.\n> \n> As soon as i tilt it feels like ive just gone to the gym for 2 weeks and then taken a cheat month.\n> \n> i lose more progress than i made, because i cant stop?\n> \n> im better than them, i know that, so i keep going, to prove to myself that i can beat the tilt.\n> \n> But no one can beat the tilt, no one.\n> \n> There is no elo hell, but there is a tilt city, and im living in it, a dead end job carrying people who cant even realize when they are carried because all they see is the post screen numbers, and no hope to get out.\n> \n> Because while i can play consistently, im playing consistently under tilt.\n> \n> And i know im not b5, not because i trash people.\n> \n> Not because i think everyones retarded.\n> \n> Because the game actually gets easier as my rank goes up, technically it should get harder if i dont belong there, my winrate should go down due to tougher opponents, but if my experiences playing in b1 and silver (first placements) is anything to go by, that is far from the case, in fact i play better at such elos due to spending less time facepalming at my team and more time focusing on myself, knowing that i dont have to hand hold people.\n> \n> Sincerely, a broken bronzetard.\n\nhttp://i1.kym-cdn.com/photos/images/original/001/063/063/f73.gif","replies":[{"poster":"Ingénue","date":"2016-02-06T02:15:38.782+0000","up_votes":2,"down_votes":0,"body":"TL;DR:\nQQ I had a bad morgana in a ranked game, I tried telling her what to do but she wouldn't listen, I am so tilted rn, I don't deserve bronze, I find silver+ so much easier, QQ.\n\n\nSolution: \nMake a ranked team with other bronzies who also \"deserve\" and \"play better\" at higher elos and climb together. That way, climbing should be easy since you all are good players and deserve to be higher than bronze.","replies":[{"poster":"Talon12","date":"2016-02-06T02:23:11.246+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Princess Yaia,realm=OCE,application-id=Ntey9fRZ,discussion-id=jtEiMgmu,comment-id=00010000,timestamp=2016-02-06T02:15:38.782+0000)\n>\n> TL;DR:\n> QQ I had a bad morgana in a ranked game, I tried telling her what to do but she wouldn't listen, I am so tilted rn, I don't deserve bronze, I find silver+ so much easier, QQ.\n\nThats just the funny part. Silver is worse than bronze.","replies":[{"poster":"Essembie","date":"2016-02-06T02:48:33.622+0000","up_votes":1,"down_votes":0,"body":"I have to disagree. 50% win or loss in silver is usually down to a lost team fight, better team comp, or someone getting caught out.\n\nIn bronze, games are lost because the ADC doesnt know how to last hit, lanes are constantly pushed with no river wards, and people are happy to bring a first time champ to ranked.\n\nSilver may be toxic and yeah you'll win some and lose some but not because your team mates are potatoes.","replies":[{"poster":"YellowBrickRoad","date":"2016-02-06T03:49:28.743+0000","up_votes":1,"down_votes":0,"body":"^ this.\n\nAt the same time im not sure if silver is worse than bronze or not, i do know that i feel more challenged up there, yes i win slightly more than in bronze, but i do honestly have to work for those wins unlike in bronze where i just go \"im bored gonna queue some ap jarvan mid and say swag flag after every e\" then proceed to go 3/1/12 and force and early surrender, because im chunking everyone for their entire healthbar and letting the adc clean up for the gold he desperately needs, all because no one in bronze is smart enough to think \"better stack mr\" like i mean they might buy a null mantle or two, but im running flat mpen runes, mpen boots, and a liandry's, all that nullmantle did was stop me doing true damage to you.","replies":[{"poster":"YellowBrickRoad","date":"2016-02-06T03:50:16.474+0000","up_votes":1,"down_votes":0,"body":"God forbid i mention the time i legit carried a bronze 3 game with a liandry's and 5 pairs of sorc boots on kayle.","replies":[{"poster":"Talon12","date":"2016-02-06T08:38:26.038+0000","up_votes":1,"down_votes":0,"body":"if only liandry magic pen wasnt unique","replies":[{"poster":"YellowBrickRoad","date":"2016-02-06T13:51:29.030+0000","up_votes":1,"down_votes":0,"body":"Exactly what i was thinking as i flew around with 10 pairs of legs all somehow magically giving me magic pen\n\nOn the other hand i got to spam all chat with advertisements for some shoe shop and get laughs.\n\nEdit: actually, realizing now that i play my best when im trolling, and i play my worst when im actually trying to win, more evidence im not terrible, just meh and tilt alot.","replies":[{"poster":"Z3npachi","date":"2016-02-06T14:24:41.830+0000","up_votes":1,"down_votes":0,"body":"Prone to tiling is being bad. The ability to play consistently each game regardless of your team will allow you to remain calm and continue to make game changing plays without going full hamtard. Remember every throw your team has done? Well the enemy team has thrown just as many games.","replies":[{"poster":"YellowBrickRoad","date":"2016-02-06T14:59:35.446+0000","up_votes":1,"down_votes":0,"body":"Im not talking throwing, when i say tilt i mean like, i just came out of a game that was thrown.\n\nAnd i literally play worse, like noticeably worse, i mean like where i wouldve been fed i am now the feeder, because i make stupid plays, because im emotional, im angry, im pissed off and i want to direct that anger at the nearest person so i throw myself into 1v3's THATS what i mean by tilt.\n\nand its the reason my winrate sucks, because im tilted for 9/10 games.\n\nWhen im not on tilt? i actually play at around a low silver level of play, because thats the level of player i learned to play from, low silvers, that and a few gold mates but i defo aint gold.\n\nits very noticeable in norms, where i have a laidback attitude because i dont have my mmr on the line, someone feeds? pfft just making a raid boss, someone baits me? ill bait them back, its all fun and games, ironicaly? that attitude makes me play like an absolute machine.\n\nBut in ranked, where i legitimately see the game as 1v9 because for all intents and purposes until i arrive at an elo where everyone is ATLEAST my mmr or higher, it is 1v9, i get very aggressive, one bad play and you are instantly in my bad books, ill watch you like a hawk while simultaneously micromanaging my lane, and you best be aware that if you miss that third hook in a row as blitz and then land your fourth hook on a nunu? i will be chewing you out on it, and thats what loses me games.\n\nits not necessarily because im bad, its mostly because i want to win so badly that it clouds my vision.\n\nOh and dont get me wrong i dont go on tilt from a thrown game, if we are evenly matched and its blow for blow and im sweating and then one outplay makes us lose? ill accept that, it pumps me up for my next game and i play even harder, what puts me on tilt is just absolute retards, which considering i have like 6-7 years of game knowledge, is basically 90% of bronze in my eyes which is a bad thing for my predicament.","replies":[{"poster":"Z3npachi","date":"2016-02-06T15:19:37.486+0000","up_votes":1,"down_votes":0,"body":"Like I said, tilting is being bad. You can wall of text all you want to justify whatever, but the fact stands if you are \"tilting\" 9/10 games, playing badly 9/10 games, then you are bad 90% of the time. Stop worrying about your random team mates and worry about how you can impact the game yourself.\n\nIf you can't stay calm playing with randoms, then only play with 4 other team mates who you can rage at and hold accountable all you want in comms.","replies":[{"poster":"YellowBrickRoad","date":"2016-02-06T16:11:03.965+0000","up_votes":1,"down_votes":0,"body":"easier said than done, the caliber of player willing to duo with me at facevalue due to my b5 ranking isnt exactly the kind of player i can deal with.\n\nAnd all my silver mates wont queue with me because well they want to grind for gold or just dont care about ranked.\n\nIm basically stuck in solo queue raging at people who dont even understand their kit till i somehow miraculously get better by bashing my head against the wall.\n\nbecause you and i both know practicing against bronze players is not going to teach me how to 1v9 carry games, and is say 1v9 because generally speaking i am the lowest number of deaths in most of my games, which means that EVERYONE is feeding, not just my team, youd think thats a good thing, but nope, because my team getting kills is just kill gold resets for their team in my book, and most of the kills are usually to me or that one retard who cant play for shit but just so happens to arrive to teamfights late and cleanup.\n\nIt feels like playing with lead weights on my fingers.\n\nGame after game after game.\n\nDesperately trying to grind my way out of this hell by playing well.\n\nThen i get one bad team, get pissed off do more damage than good to my mmr.\n\ncall it quits and start again the next day.\n\nits a vicious cycle that is legit pushing me to the edge of violence on furniture and im a fucking pacifist.\n\nthere are days when i actually do wish cancer on my team, not in a spur of the moment thing, i mean legitimately the way they play denotes someone of an iq level so low that itd actually be better for the human race as a whole if they got cancer so they cant spread their shitty genes.\n\nLike im really not that good a player.\n\nBut i feel like faker surrounded by wood 5 players in this elo, but because of how legitimately angry stupid people make me (yes stupid people piss me off) i play like im limestone 10.\n\nlegit the only way im ever getting out of bronze is three things.\n\nI stop playing ranked for a year, find a bunch of people in diamond who only ever play customs. and play with them till im diamond level and can just faceroll my way out.\n\nGet carried out till im away from the stupid.\n\nOr my last option is to just die so i dont have to think about being stuck in bronze anymore.","replies":[{"poster":"Z3npachi","date":"2016-02-06T17:55:27.303+0000","up_votes":1,"down_votes":0,"body":"Easiest way to get out of bronze, play mechanically \"easy\" champs who become difficult to deal with mid game. Pref something you find enjoyable to play or atleast give the champ a few games to get used to.\nFocus on your lvl 1-4 , this is where you can easily win your lane with a simple outplay and correct lane management. Win lane, assert your presence elsewhere.\nYou will never win 100% of games, a good win % while climbing should be around 55-60% with a champion ( based on a large sample size ). If by say 20 games your champion is sitting on sub 50%, retire it for now until you can put more games in through blinds.\nRelax, listen to some chill music while you play, forgive yourself and your team when mistakes are made, it will help you not only enjoy the game more but greatly improve your ranked experience.","replies":[{"poster":"fattyhotdogs","date":"2016-02-08T09:16:14.131+0000","up_votes":1,"down_votes":0,"body":"REKT","replies":[]},{"poster":"Z3npachi","date":"2016-02-07T11:41:37.937+0000","up_votes":1,"down_votes":0,"body":"Not according oce.op.gg. You played 7 games on singed, 1W6L . Nice bait though.","replies":[]},{"poster":"YellowBrickRoad","date":"2016-02-07T07:55:13.881+0000","up_votes":1,"down_votes":1,"body":"Last season i had an 80% win rate with singed over the course of 150 games and was still bronze 5.\n\nLet that sink in.","replies":[]}]},{"poster":"fattyhotdogs","date":"2016-02-06T23:38:27.723+0000","up_votes":1,"down_votes":0,"body":"So in all of your games, your teammates have a 90% chance of seeing the bad \"tilted\" yellowbrickroad.... And yet you still blame them. And that time you go 10/3 against a retarded enemy? Nahhhhh the enemy wasn't bad, it was definitely your superior skill! Because you were once silver!!! That is your homeland! Nothing can prove you are bad!","replies":[{"poster":"YellowBrickRoad","date":"2016-02-07T07:57:01.401+0000","up_votes":1,"down_votes":0,"body":"And yes they do see the tilted me.\n\nOn the other hand if im having just a brilliant day and im in the best mood ever ill proceed to carry 10 games in a row and skip a division.\n\nBut you best believe im tanking to b5 again the next day after im all stressed out and someone ticks me off.","replies":[]},{"poster":"YellowBrickRoad","date":"2016-02-07T07:54:08.339+0000","up_votes":1,"down_votes":0,"body":"Sure, lets ignore the fact that i generally tend to see the same enemies in my games.\n\nAlso i consistently win lane when paired against smurfs (i once first blooded a diamond rengar and put up such a fight that he added me after, since then ive been playing norms with a mate of his from new zealand) \n\nNot every bronzie is of bronzie quality mate.\n\nits exactly your attitude to us that is why i cant find decent duo partners.","replies":[]}]}]}]},{"poster":"Talon12","date":"2016-02-08T08:05:23.929+0000","up_votes":1,"down_votes":0,"body":"that moment you get banned for 1 bad game.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"YellowBrickRoad","date":"2016-02-06T05:19:12.332+0000","up_votes":1,"down_votes":0,"body":"Oh god i just had a lux who basically did the exact same thing, went 2/8/3. didnt realise her snare can save lives including her own.\n\nAnd repeatedly blamed lag as to the reason she just walked head first into the front line and tanked like 20 autos before going \"ooopsies im being attacked\"\n\nLike i dont care how bad your lag is, it doesnt make you right click on things you dont want to.\n\nlag doesnt bitch slap you in the face and say \"WALK INTO THAT TANK RIGHT NOW BE A MAN\" lag just doesnt work that way.\n\nFirst game of the day and im already tilted.","replies":[{"poster":"Talon12","date":"2016-02-06T08:40:04.017+0000","up_votes":1,"down_votes":0,"body":"of course not, that would be silly if is slapped you and said \"WALK INTO THAT TANK RIGHT NOW BE A MAN\" but it does say \"DO IT, IT'LL BE FUN\"\n\n\nignore the binary just put it here for my clipboard\n01100100 01110010 01101001 01101110 01101011 00100000 01100010 01101100 01100101 01100001 01100011 01101000","replies":[{"poster":"YellowBrickRoad","date":"2016-02-06T13:54:17.353+0000","up_votes":1,"down_votes":0,"body":"Our body is mostly bleach, and bleach is mostly water, hence we are mostly bleach, now drink up.","replies":[{"poster":"Talon12","date":"2016-02-08T08:06:07.612+0000","up_votes":1,"down_votes":0,"body":"i said ignore it, it was for my clipboard","replies":[]}]}]}]},{"poster":"CHEESYLEEKS","date":"2016-02-07T06:53:20.379+0000","up_votes":1,"down_votes":0,"body":"> And i know im not b5\n\n I PLAY AT A DIAMOND LVL, RITO PLZ!!!","replies":[{"poster":"YellowBrickRoad","date":"2016-02-07T07:59:55.042+0000","up_votes":1,"down_votes":0,"body":"Not b5 =/= challenger\n\nThere is what 3 tiers between bronze and diamond.\n\nnot to mention each of those tiers have 5 divisions, what makes you think i think im a godlike player.\n\nAll i said is im not b5, because when im in a good mood i trash b5 players, absolutely stomp them, like fuck dude yesterday after i had a good couple games and got my mojo back i forced like 3 people to afk from just trashing them so hard in the early game.\n\nThat and i turned a game into a 4v5 by going 10/0 against the enemy kat and just blowing people up because i actually knew how to last hit so i got super ahead.\n\nIll say what i always say, some people in bronze are not bronze players, they just get tilted easily. i am one of those people.","replies":[]}]}]}