{"poster":"YellowBrickRoad","date":"2016-10-11T16:15:26.135+0000","title":"So i found a summoner school article that i should 1v5 int bots to get out of bronze","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"http://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/150152826/201665539\r\n\r\nAnd on the first game i got near perfect cs (336 at 34:53 so lets just say 35 minutes is 9.6 cs a minute, perfect cs if 10 a minute) went 36/4 (karthus bot ulted my a few times while i was pushing nexus towers ele giggle) got 2 pentas and didnt learn shit aside from &quot;even bots can kill you if you decide to push while super low&quot;\r\n\r\nHalp i need a training excercise that i wont just destroy in the first go causing dunning krueger.","replies":[{"poster":"fattyhotdogs","date":"2016-10-11T20:54:47.650+0000","up_votes":2,"down_votes":0,"body":"It's less about just winning a 1v5 bot game, and more about winning a 1v5 bot game without dying. Not once. If you die, quit and start again.\nThat will teach you to play smarter","replies":[{"poster":"Nightjar","date":"2016-10-12T01:49:49.175+0000","up_votes":1,"down_votes":0,"body":"^this, also this only works for training as an assassin or squishy fighter, if you try to do this with a janna goodluck, and if you do this as a poke based mage or adc or an especially tanky bruiser, depending on the matchup you won't learn much. \nThe idea though is trying to treat it like a regular game where you have to snowball as fast as possible and carry whilst trying to keep perfect cs, backing at the right times, watching the map (even though nothing is happening it's good to check every 2-3s), picking the right time to engage, trade or capitalise on a mistake (and bots give you alot of opportunities to do this), dealing with lane camp (even as a midlaner go top or bot for the 2v1).\n\nAlso all of this is made redundant if you exploit the flaws of the bots like not backing off when they should, recalling in stupid places and not responding when you jump on them between two towers or waiting for them to go oom or not play against your ult timing. This doesn't teach you how to beat real players, only how to abuse bots. If you can end a 1v5 pre-25min without dying or abusing any of the bot weaknesses (take not of these for doombots soon though) then you're not getting anything out of bots and you should not move on to using normals to practice, though if you have the time and the right mindset, and you aren't me ( I have the mechanics of a potato) then practicing the same thing in normals might be more beneficial.\n\nI lack mechanics so I mainly play support and I don't really practice my lane skills alot recently because I lack time with uni getting hectic but that's the regime I was trying to reach for some time. Please don't check my match history, but I will say that even though I still suck and should practice like this more, my csing and trading in lane was alot stronger for a short while after I did some of this training and it's especially strong on people who don't have good mechanics to start off with, so I really need to do more of this but urgh uni work.","replies":[]}]},{"poster":"Bytez","date":"2016-10-11T20:41:23.050+0000","up_votes":1,"down_votes":0,"body":"If you want to get out of bronze just keep playing. That's pretty much it, it's not that hard, I don't know what the big fuss about being stuck in bronze is. Most people were there at one point and they all clawed their way out, so I'm sure you can as well. But the first step is to get over this \"my team is always bad\" mentality that seems to be common in bronze players. You don't need to be a beast at the game to get out of bronze, you just need some common sense. Best of luck mate.","replies":[]}]}