{"poster":"YellowBrickRoad","date":"2016-11-26T03:53:13.487+0000","title":"Back below 50% now, 4 retarded teams in a row with feeders.","subforum":"Miscellaneous","up_votes":2,"down_votes":11,"body":"No seriously riot, your matchmaking system fucking sucks.\n\nLiterally the only reason im fucking playing the game is because path of exiles new league doesnt drop till december 2nd.\n\nive been playing for 8 fucking years, the last 2-3 years, youve gone downhill.\n\nYour game may not be dead, but ive seen this shit before, and just like every other behemoth game before it youve hit that tipping point, where you are trying to hard to bring newer players in and not hard enough to retain consistent players.\n\nYour games gonna fall off the radar soon, and im gonna fucking sit here laughing at you as your entire fucking studio tears its hair out trying to figure out why.\n\nbecause youve fucking earned it, you cant fucking balance a simple numbers system with only one variable, that has proven methods that work.\n\nYou fuck up my main.\n\nYou fuck up my queues.\n\nYou fuck up the new client, what happened to the original alpha client i tested, that shit was good, you swapped it out for this web based shit that uses 5 times as much cpu power has all the same bugs from the original client and a bunch of new ones?\n\nTheres almost nothing left to fuck up.","replies":[{"poster":"He Meant Mine","date":"2016-11-26T04:14:54.306+0000","up_votes":5,"down_votes":1,"body":"I've literally asked you if u wanted help and didnt reply. Mate so what if u cant carry people who are \"stupid\", you're bronze deal with it. You need to learn how to stop god damm complaining and actually learn tactics to play around it.  Its not hard to throw an annie  mid and carry off that. Fed annie -> roam = gg all lanes. Looking from your match history i get it shaco main but do u really think an ap shaco can carry the whole game itself?  Yeaaaaah nooooo. If you want I'll teach u or wat not seriously, it aint hard hun.","replies":[]},{"poster":"Rocka","date":"2016-11-26T07:15:43.781+0000","up_votes":3,"down_votes":0,"body":"Tbh it doesnt take much to carry bronze games. Play something that can snowball, if you know how to get a lead and abuse it there should be no reason to have below 50% win rate. With over 1000 rank games i would say that you still belong in bronze 5, focus on improving yourself rather then blaming others every game. Rank system works fine, you just need to accept the fact this is ur skill bracket and focus on getting better.","replies":[{"poster":"YellowBrickRoad","date":"2016-11-26T08:34:03.643+0000","up_votes":1,"down_votes":0,"body":"Except i was at 52% winrate b3 90lp when i started losing the games i mentioned in op.\n\nWere talking flex queue here, a queue where my mmr is higher so my teammates are slightly less shit.","replies":[{"poster":"Rocka","date":"2016-11-26T08:37:04.945+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=YellowBrickRoad,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=00030000,timestamp=2016-11-26T08:34:03.643+0000)\n>\n> Except i was at 52% winrate b3 90lp when i started losing the games i mentioned in op.\n> \n> Were talking flex queue here, a queue where my mmr is higher so my teammates are slightly less shit.\n\nBronze 3 isnt much different tho, just focus on improving urself. Blaming your team is getting you nowhere clearly. If you think its the team that loses u the game, get a premade of 5.","replies":[{"poster":"YellowBrickRoad","date":"2016-11-26T08:45:53.182+0000","up_votes":1,"down_votes":1,"body":"Excuse me but riddle me this im a 10/4 shaco.\n\ni have  a 2/4 lucian bot\n\n3/12 kindred top\n\n0/8/10 leona\n\nand a 5/7 lee sin\n\nAre you teling me im the one who fed the yasuo up to 15 kills?\n\nI rest my fucking case.\n\nOh and uh, yes that is the only time i lose when im playing my mains, like i actually cant find a single game in my match history where i played one of my mains and lost and could directly attribute the loss to me.\n\nSure you could indirectly attribute it to me by saying \"well you shouldve won your shitty teams lanes for them\" but i mean 15/5 yasuo man, and i was responsible for 3 of his deaths, its pretty damn fucking clear i was throwing my weight around trying to make that game into something but my team wasnt buying it.\n\nBecause thats the thing, its a team game.\n\nif im at around the elo i belong, im never going to 1v9, ever. literally never, if i ever achieve the abilty to 1v9 im probably meant to be or atleast low silver.\n\nBut until then no no 1v9\n\nOnly teamwork.\n\nAnd teamwork unforunately is not a one person skill.\n\nTo do adequate teamwork the other 4 people, must also have teamwork.\n\nThat and uh, do you see any mid low bronze players around here, that i wont immediately puke at their match history?\n\nAnd god knows the silver players wont queue with me, im a lowly fucking bronez so i dont even get a chance to prove myself, instead i have to bash my head against the bronze 5 wall until i give up or something achieve a miracle and get out.\n\nThis is why im quitting ranked, because throwing 5 random fucktards into a group, not having an accurate enough mmr system to put equal teams together, and then not giving a enough of a shit about the playerbase to reinstate the tribunal.\n\nI might play again IF and when oce gets 3v3's.\n\nBecause i mean 3v3 is 2 less tards to worry about, that and im a third of the team, if i pop off i could single handedly win with 2 afks, so god knows im not staying bronze there.","replies":[{"poster":"Rocka","date":"2016-11-26T08:47:13.251+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=YellowBrickRoad,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=0003000000000000,timestamp=2016-11-26T08:45:53.182+0000)\n>\n> Excuse me but riddle me this im a 10/4 shaco.\n> \n> i have  a 2/4 lucian bot\n> \n> 3/12 kindred top\n> \n> 0/8/10 leona\n> \n> and a 5/7 lee sin\n> \n> Are you teling me im the one who fed the yasuo up to 15 kills?\n> \n> I rest my fucking case.\n> \n> Oh and uh, yes that is the only time i lose when im playing my mains, like i actually cant find a single game in my match history where i played one of my mains and lost and could directly attribute the loss to me.\n> \n> Sure you could indirectly attribute it to me by saying &quot;well you shouldve won your shitty teams lanes for them&quot; but i mean 15/5 yasuo man, and i was responsible for 3 of his deaths, its pretty damn fucking clear i was throwing my weight around trying to make that game into something but my team wasnt buying it.\n\nYou are telling me that over ur 1000 rank games every game has been like that? there will be shitty games like that every once in a while not every game. These are just poor excuses for being bad at the game.","replies":[{"poster":"YellowBrickRoad","date":"2016-11-26T08:55:36.677+0000","up_votes":1,"down_votes":1,"body":"150 games akali, 60%\n\n180 games katarina, 59%\n\nAround 100 games singed 57%\n\nAround 50 games shaco 55%\n\nClearly i am capable of not only carrying myself, but doing it consistently \n\nunforunately the only non consistent thing is my team.\n\nAnd Unforunately something thats also consistent about me is i tilt very very very hard.\n\nIf you give me a 4/18 bot lane.\n\nill spend the next 3 games doing alright, but not my best, and in turn not carrying.\n\nif proceed to play from there i degenerate further, and further, and further, until im going 0/10 damn near punching my monitor and screaming at pixels for not fucking warding properly when they bitch about mias.\n\nAnd why do i tilt so hard?\n\nBecause i play ranked ironically to unwind, theres nothing i enjoy more than a good competitive bash, keyword competitive or id just play normals and thresh jg or river ekko or something.\n\nAnd what do i have to unwind from? everything\n\nSo excuse me if bad teammates tick me off a bit when im trying to forget about things like the fact turnbulls in for a second term, or that julian asaange bullshit thats going down atm.\n\nOr that i just watched the news and it was sports coverage while they had a major scientific breakthrough on the ticker reel.\n\nOr  that our fucking populace due to the tendency for the least intelligent to breed the most is very quickly becoming increasing less fucking intelligent and i fear for the future of our human race as if a fucking kid on a computer cant fucking press the 4 key on his fucking keyboard near the river how the fuck does he expect to function as a fucking adult and not raise retarded kids.","replies":[{"poster":"dragon poo","date":"2016-11-26T09:24:44.026+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YellowBrickRoad,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=000300000000000000000000,timestamp=2016-11-26T08:55:36.677+0000)\n>\n> 150 games akali, 60%\n> \n> 180 games katarina, 59%\n> \n> Around 100 games singed 57%\n> \n> Around 50 games shaco 55%\n> \n> Clearly i am capable of not only carrying myself, but doing it consistently \n> \n> unforunately the only non consistent thing is my team.\n> \n> And Unforunately something thats also consistent about me is i tilt very very very hard.\n> \n> If you give me a 4/18 bot lane.\n> \n> ill spend the next 3 games doing alright, but not my best, and in turn not carrying.\n> \n> if proceed to play from there i degenerate further, and further, and further, until im going 0/10 damn near punching my monitor and screaming at pixels for not fucking warding properly when they bitch about mias.\n> \n> And why do i tilt so hard?\n> \n> Because i play ranked ironically to unwind, theres nothing i enjoy more than a good competitive bash, keyword competitive or id just play normals and thresh jg or river ekko or something.\n> \n> And what do i have to unwind from? everything\n> \n> So excuse me if bad teammates tick me off a bit when im trying to forget about things like the fact turnbulls in for a second term, or that julian asaange bullshit thats going down atm.\n> \n> Or that i just watched the news and it was sports coverage while they had a major scientific breakthrough on the ticker reel.\n> \n> Or  that our fucking populace due to the tendency for the least intelligent to breed the most is very quickly becoming increasing less fucking intelligent and i fear for the future of our human race as if a fucking kid on a computer cant fucking press the 4 key on his fucking keyboard near the river how the fuck does he expect to function as a fucking adult and not raise retarded kids.\n\nthen sotp plying if you get tilted, ive just solved your problem, you can lock the thread now mods","replies":[]}]}]}]}]}]}]},{"poster":"dragon poo","date":"2016-11-26T04:15:06.228+0000","up_votes":1,"down_votes":0,"body":"Just  a question, why not just queue for top/mid and play akali? you have a decent win rate on her, your shaco is not great, barely going even when you win and whatnot, play to your strengths, not to the meta.","replies":[{"poster":"Nightjar","date":"2016-11-26T04:33:47.546+0000","up_votes":1,"down_votes":0,"body":"also shaco is not very good right now (very inflated from onetrick shaco mains really trying to find a way to make him work) and has always been a very hit-or-miss champion and despite that he's not much of a carry in his current state. As a fellow shaco main, I can understand that his kit is very fun to play with, but he might not be the best pick for soloq right now.\n\nIt's good that you're playing ap, since any ad based build that isn't titanic or full lethality based atm isn't great; however, unless you are a shaco god, it's probably best to avoid playing him in ranked right now and just go for a more carry type champion. \n\nIf jungling is your thing I'd suggest that rengar might be a decent pick up since a snowballed rengar in his current state is almost an instant gg and he's very good at counterjungling at the moment for the sheer fact that any jungler who tries to fight him is probably going to die immediately, other junglers worth picking up are, zac and shyvanna. In their current state they're both menaces who posses both good teamfighting and dueling power and can snowball very hard considering they're tanky/bruiser type champions.","replies":[{"poster":"YellowBrickRoad","date":"2016-11-26T04:49:10.583+0000","up_votes":1,"down_votes":0,"body":"Actually i hate jungle, bot and sup.\n\nWhat is the three things those roles have in common? they rely on your team.\n\nSup relies on the adc to do good.\n\nAdc relies on the sup to do good.\n\nJungle relies on all 3 lanes to do good, or atleast just 2 so when he has to camp the feeding bot lane it doesnt sting as hard for mid and top.\n\nMid and top are the only two lanes where you can pretty much just completely ignore your team and still have a chance of winning.\n\nAnd considering how hard this elo tilts me, thats mandatory because if i paid attentioned to even one persons lane for longer than five seconds id instantly tilt.\n\nWhich is ironic really, because im an amazing shyvana jg (100% winrate) an amazing lucian and ashe (mastery 6 lucian by playing full ap top lane for the lols, even deadlier when i go ad, like im talking with just a little bit of peels i can single handedly turn a game with lucian) and an amazing thresh.\n\nBut i cant fucking play any of those champions in my current elo or ill just lose because someone will fuck up.\n\nAnd thats the sad fucking truth of it, my best champions rely on atleast one person also being competent, it is literally impossible for me to 1v9 carry with the champ pool i am proficient at, at my skill level, which means i literally am in elo hell, good enough to notice every pain staking mistake my team makes, good enough to get pissed off about every pain staking mistake because i dont make those same mistakes (unless im tilted), but not good enough to climb.","replies":[{"poster":"He Meant Mine","date":"2016-11-26T05:21:47.132+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=YellowBrickRoad,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=000100000000,timestamp=2016-11-26T04:49:10.583+0000)\n>\n> Actually i hate jungle, bot and sup.\n> \n> What is the three things those roles have in common? they rely on your team.\n> \n> Sup relies on the adc to do good.\n> \n> Adc relies on the sup to do good.\n> \n> Jungle relies on all 3 lanes to do good, or atleast just 2 so when he has to camp the feeding bot lane it doesnt sting as hard for mid and top.\n> \n> Mid and top are the only two lanes where you can pretty much just completely ignore your team and still have a chance of winning.\n> \n> And considering how hard this elo tilts me, thats mandatory because if i paid attentioned to even one persons lane for longer than five seconds id instantly tilt.\n> \n> Which is ironic really, because im an amazing shyvana jg (100% winrate) an amazing lucian and ashe (mastery 6 lucian by playing full ap top lane for the lols, even deadlier when i go ad, like im talking with just a little bit of peels i can single handedly turn a game with lucian) and an amazing thresh.\n> \n> But i cant fucking play any of those champions in my current elo or ill just lose because someone will fuck up.\n> \n> And thats the sad fucking truth of it, my best champions rely on atleast one person also being competent, it is literally impossible for me to 1v9 carry with the champ pool i am proficient at, at my skill level, which means i literally am in elo hell, good enough to notice every pain staking mistake my team makes, good enough to get pissed off about every pain staking mistake because i dont make those same mistakes (unless im tilted), but not good enough to climb.\n\nHun stop making stuff up, as Dragon Poo mentioned the support doesnt have to rely on the adc. U can literally carry as a lux support, brand, zyra, sona etc without having the adc to be extremely good, this also applies to adc. It's all about mechanics and knowledge. You say you're good but you're in bronze? Saying you're good means jack shizzles in this elo.  You say u hate the 3 roles but play champs that belong in that role. \"Even deadlier if i go ad\" if u were actually \"deadlier\" wouldnt u be able to carry your ass out of bronze? No LOL. Seriously just stop making stuff up and deal with it. Yes it takes two to carry a team but that doesnt mean if you're doing well in whatever role you are doesnt mean u CANT roam to make another lane fed (unless adc -> take turret rotate) . I can literally carry as AHRI. It takes one person to be fed thats all really in bronze.","replies":[{"poster":"YellowBrickRoad","date":"2016-11-26T05:42:15.925+0000","up_votes":1,"down_votes":0,"body":"You didnt read my reply mate.","replies":[]}]},{"poster":"Nightjar","date":"2016-11-26T06:17:30.661+0000","up_votes":1,"down_votes":0,"body":"that sucks but whilst adc requires the support, I don't agree with the other two. \n\nFirstly a good jungler can make things happen, force towers, crush lanes with weak earlygames and influence all 3 lanes. Now that doesn't mean he should babysit. If a lane is losing hard, don't even bother, don't go there, don't try to win it back for them, because either you'll die and fall behind, or you'll get it back, and then your laner will most likely lose it again just like they did the first time. This is carrying as the jungler 101.\nYour best bet is to find a lane that's breaking even or winning, and make it win harder. A game isn't so hard to carry if you have a laner or two to help you out. People say league is a team game but realistically at bronze and silver level, you only need 2-3 people to know what they're doing and have a lead to win the game. So find the lanes than you can imagine snowballing, watch how they're doing in terms of lane pressure, csing, trading and how well they play compared to their opposing laner. If you think you can win them that lane, wait till the enemy is pushed or ask your laner to freeze and then gank them, force the tower and kill it and then either ask them to roam with you if the rest of the lanes are losing or put a control ward down in an aggressive spot and then try to go to the next lane that's doing okay. Then pressure that lane, kill the enemy, take the tower, take objectives. Then you gather your team, take the next tower if the enemy tries to teamfight or defend use your advantage to force trades. Entering the midgame, getting a tower is generally worth more than getting a kill in terms of gold and especially map control but be careful since a man down can often mean a lost objective. If you have greater numbers after making a pick or skirmish it's usually best to start a teamfight or force an objective. Added note, whilst ganking is good, make sure you farm up as much as possible because you'll need gold and levels to make all this happen, so don't neglect your farming. Generally focus on 1-2 lanes and look for opportunities to get ahead first. You'll need to start snowballing to win the game and people generally won't listen to shotcalls from someone who's 0-3.\n\nAs a support, I wouldn't suggest this role for hard carrying, but if you're good enough this role can carry pretty hard. Picking mage supports with high damage and kill potential is probably the easier way to carry as a support and I'd suggest things like zyra and morgana, since if you can pick up a random kill here or there, you can easily get to a point, where your adc could be afk and you'd still be able to winlane. If you're good as a mage support, don't be afraid to delay the sightstone a little and defensive stats won't really matter that much since they'll be afraid to come near you. Tank supports rely alot on teammates following up alot of the time so it's alot more challenging but blitzcrank, tahm and nautilus are all good at getting things done and offer good utility whilst not being as team reliant as champions like thresh.\n\nI agree with the fact that adc relies alot on the support. A good adc can carry regardless of the support but the adc needs a good support to shine more than a support needs a good adc to shine. Supports often have high base damage, cc and utility which means their carry potential doesn't really scale off requiring alot of gold. A stellar support and a mediocre adc is much stronger than a stellar adc and a mediocre support. People don't really think about this much but the support's skill is generally more important to the outcome of botlane laning phase than the adc. \n\nNot to mention that in bronze, supports are the worst and by playing that role yourself, you reduce the odds of having a useless player on your team by alot.\n\n\nAnyways I'd suggest you have a look at jungling since it can actually be one of the best roles to carry from. Also if you feel that jungle requires the lanes to do well, you're probably not roaming as the midlaner enough. Jungler and midlaners should both have a large impact on all the other lanes.","replies":[{"poster":"He Meant Mine","date":"2016-11-26T06:49:47.746+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nightjar,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=0001000000000002,timestamp=2016-11-26T06:17:30.661+0000)\n>\n> that sucks but whilst adc requires the support, I don&#x27;t agree with the other two. \n> \n> Firstly a good jungler can make things happen, force towers, crush lanes with weak earlygames and influence all 3 lanes. Now that doesn&#x27;t mean he should babysit. If a lane is losing hard, don&#x27;t even bother, don&#x27;t go there, don&#x27;t try to win it back for them, because either you&#x27;ll die and fall behind, or you&#x27;ll get it back, and then your laner will most likely lose it again just like they did the first time. This is carrying as the jungler 101.\n> Your best bet is to find a lane that&#x27;s breaking even or winning, and make it win harder. A game isn&#x27;t so hard to carry if you have a laner or two to help you out. People say league is a team game but realistically at bronze and silver level, you only need 2-3 people to know what they&#x27;re doing and have a lead to win the game. So find the lanes than you can imagine snowballing, watch how they&#x27;re doing in terms of lane pressure, csing, trading and how well they play compared to their opposing laner. If you think you can win them that lane, wait till the enemy is pushed or ask your laner to freeze and then gank them, force the tower and kill it and then either ask them to roam with you if the rest of the lanes are losing or put a control ward down in an aggressive spot and then try to go to the next lane that&#x27;s doing okay. Then pressure that lane, kill the enemy, take the tower, take objectives. Then you gather your team, take the next tower if the enemy tries to teamfight or defend use your advantage to force trades. Entering the midgame, getting a tower is generally worth more than getting a kill in terms of gold and especially map control but be careful since a man down can often mean a lost objective. If you have greater numbers after making a pick or skirmish it&#x27;s usually best to start a teamfight or force an objective. Added note, whilst ganking is good, make sure you farm up as much as possible because you&#x27;ll need gold and levels to make all this happen, so don&#x27;t neglect your farming. Generally focus on 1-2 lanes and look for opportunities to get ahead first. You&#x27;ll need to start snowballing to win the game and people generally won&#x27;t listen to shotcalls from someone who&#x27;s 0-3.\n> \n> As a support, I wouldn&#x27;t suggest this role for hard carrying, but if you&#x27;re good enough this role can carry pretty hard. Picking mage supports with high damage and kill potential is probably the easier way to carry as a support and I&#x27;d suggest things like zyra and morgana, since if you can pick up a random kill here or there, you can easily get to a point, where your adc could be afk and you&#x27;d still be able to winlane. If you&#x27;re good as a mage support, don&#x27;t be afraid to delay the sightstone a little and defensive stats won&#x27;t really matter that much since they&#x27;ll be afraid to come near you. Tank supports rely alot on teammates following up alot of the time so it&#x27;s alot more challenging but blitzcrank, tahm and nautilus are all good at getting things done and offer good utility whilst not being as team reliant as champions like thresh.\n> \n> I agree with the fact that adc relies alot on the support. A good adc can carry regardless of the support but the adc needs a good support to shine more than a support needs a good adc to shine. Supports often have high base damage, cc and utility which means their carry potential doesn&#x27;t really scale off requiring alot of gold. A stellar support and a mediocre adc is much stronger than a stellar adc and a mediocre support. People don&#x27;t really think about this much but the support&#x27;s skill is generally more important to the outcome of botlane laning phase than the adc. \n> \n> Not to mention that in bronze, supports are the worst and by playing that role yourself, you reduce the odds of having a useless player on your team by alot.\n> \n> \n> Anyways I&#x27;d suggest you have a look at jungling since it can actually be one of the best roles to carry from. Also if you feel that jungle requires the lanes to do well, you&#x27;re probably not roaming as the midlaner enough. Jungler and midlaners should both have a large impact on all the other lanes.\n\nMy question is have u ever been higher than silver?","replies":[{"poster":"Nightjar","date":"2016-11-26T07:54:08.086+0000","up_votes":1,"down_votes":0,"body":"hahaha nope, I'm kinda new and I've only played this game for half a season. Half a year ago I wasn't even lvl30 and I think I first started playing league around january-february this year.\n\nI still can't land skillshots and as much as I study these things, try to practice them, watch instructional videos and seek advice from higher ranked players, when I put them into practice I'm still a potato. I still feel the advice is valid even though I'm the sort of person who can fuck up and use a warwick ultimate on a bloody wukong clone when chasing him into a bush.\n\nI have 0 mechanics and I'm kind of limited to champions with low skill requirements but I like to believe that all my studying of the game, rotations, knowledge of cooldowns, theory, ect... make up for that a little bit.\\\n\nIf you have anything to correct or contribute I'd be glad of some tips myself since I'm still new and open to advice on how to improve myself.","replies":[{"poster":"He Meant Mine","date":"2016-11-26T08:09:34.217+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nightjar,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=000100000000000200000000,timestamp=2016-11-26T07:54:08.086+0000)\n>\n> hahaha nope, I&#x27;m kinda new and I&#x27;ve only played this game for half a season. Half a year ago I wasn&#x27;t even lvl30 and I think I first started playing league around january-february this year.\n> \n> I still can&#x27;t land skillshots and as much as I study these things, try to practice them, watch instructional videos and seek advice from higher ranked players, when I put them into practice I&#x27;m still a potato. I still feel the advice is valid even though I&#x27;m the sort of person who can fuck up and use a warwick ultimate on a bloody wukong clone when chasing him into a bush.\n> \n> I have 0 mechanics and I&#x27;m kind of limited to champions with low skill requirements but I like to believe that all my studying of the game, rotations, knowledge of cooldowns, theory, ect... make up for that a little bit.\\\n> \n> If you have anything to correct or contribute I&#x27;d be glad of some tips myself since I&#x27;m still new and open to advice on how to improve myself.\n\nExactly, you wouldnt have proof behind your theory for adc needing supports. If you've ever been in high elo (in this case no) the adc doesnt require the support if not the team. I know an adc who can literally 1v5. How? He has the game knowledge, the mechanics, his limits and how much the champ itself can do  etc. He literally 1v5-ed the team once lol no help just solo. Its not needing the support to peel etc its about knowing the champ itself and your skills. Again I've been saying this multiple times to anyone, if they want free mentoring literally just as ask me lol. Only if you're willing to put the time and effort in.","replies":[{"poster":"Nightjar","date":"2016-11-26T08:29:22.566+0000","up_votes":1,"down_votes":0,"body":"when do you schedule your mentoring sessions? also how do you communicate do you use discord, teamspeak, other?\nI'm interested in getting a bit of mentoring for the next few weeks since I generally don't have much freetime outside of holidays and late december I'm being dragged along on a family holiday and I'll have to start studying and going through required reading material for my uni course.\n\nI'd really like some advice on how to improve and I'm sure there are some glaring things I'm doing wrong that I just can't spot or notice from just watching guides and spectating other people's games.","replies":[{"poster":"He Meant Mine","date":"2016-11-26T09:05:45.853+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nightjar,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=00010000000000020000000000000000,timestamp=2016-11-26T08:29:22.566+0000)\n>\n> when do you schedule your mentoring sessions? also how do you communicate do you use discord, teamspeak, other?\n> I&#x27;m interested in getting a bit of mentoring for the next few weeks since I generally don&#x27;t have much freetime outside of holidays and late december I&#x27;m being dragged along on a family holiday and I&#x27;ll have to start studying and going through required reading material for my uni course.\n> \n> I&#x27;d really like some advice on how to improve and I&#x27;m sure there are some glaring things I&#x27;m doing wrong that I just can&#x27;t spot or notice from just watching guides and spectating other people&#x27;s games.\n\nJust add me","replies":[]}]}]}]}]}]},{"poster":"dragon poo","date":"2016-11-26T05:09:40.898+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YellowBrickRoad,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=000100000000,timestamp=2016-11-26T04:49:10.583+0000)\n>\n> Actually i hate jungle, bot and sup.\n> \n> What is the three things those roles have in common? they rely on your team.\n> \n> Sup relies on the adc to do good.\n> \n> Adc relies on the sup to do good.\n> \n> Jungle relies on all 3 lanes to do good, or atleast just 2 so when he has to camp the feeding bot lane it doesnt sting as hard for mid and top.\n> \n> Mid and top are the only two lanes where you can pretty much just completely ignore your team and still have a chance of winning.\n> \n> And considering how hard this elo tilts me, thats mandatory because if i paid attentioned to even one persons lane for longer than five seconds id instantly tilt.\n> \n> Which is ironic really, because im an amazing shyvana jg (100% winrate) an amazing lucian and ashe (mastery 6 lucian by playing full ap top lane for the lols, even deadlier when i go ad, like im talking with just a little bit of peels i can single handedly turn a game with lucian) and an amazing thresh.\n> \n> But i cant fucking play any of those champions in my current elo or ill just lose because someone will fuck up.\n> \n> And thats the sad fucking truth of it, my best champions rely on atleast one person also being competent, it is literally impossible for me to 1v9 carry with the champ pool i am proficient at, at my skill level, which means i literally am in elo hell, good enough to notice every pain staking mistake my team makes, good enough to get pissed off about every pain staking mistake because i dont make those same mistakes (unless im tilted), but not good enough to climb.\n\nAs a support main, i disagree, the adc can be braindead and if the support is good, they can make things happen, the support is team reliant, not ADC reliant. people are human, i got out of bronze 5 last season, pretty much just supporting/ top. there is no reason you cant do the same. literally play around how your team plays, dont be an idiot trying to make shit happen and the enemy team will probably make a mistake or overextend.","replies":[{"poster":"YellowBrickRoad","date":"2016-11-26T05:44:14.294+0000","up_votes":1,"down_votes":0,"body":"In higher elos sure.\n\nIn bronze? im not talking the adc doesnt know when to engage.\n\nIm talking the adc is clearly lockscreened doesnt watch minimap and cant dodge a skill shot for his life.\n\nIts not a losing lane because my adc doesnt get kills.\n\nits a losing lane because hes 0/15","replies":[{"poster":"dragon poo","date":"2016-11-26T05:55:03.476+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YellowBrickRoad,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=00010000000000000001,timestamp=2016-11-26T05:44:14.294+0000)\n>\n> In higher elos sure.\n> \n> In bronze? im not talking the adc doesnt know when to engage.\n> \n> Im talking the adc is clearly lockscreened doesnt watch minimap and cant dodge a skill shot for his life.\n> \n> Its not a losing lane because my adc doesnt get kills.\n> \n> its a losing lane because hes 0/15\n\nI know exactly what you are talkiing about mate, and hell, my adc a couple of games ago, was 4/11 at one point, we still won, because we played around it like vayne wasnt needed to win, you legit need to calm down, and actually play the role you dont like, jus to see how hard it is and maybe you'll have  a bit more respect for the job they are trying to do rather than afk splitpush top/mid","replies":[{"poster":"YellowBrickRoad","date":"2016-11-26T08:36:32.799+0000","up_votes":1,"down_votes":0,"body":"No i wont have respect for them because i can play all of them and not feed.\n\nif i can do it.\n\nSo can they, they have no fucking excuse to suck at the lanes they main, when i can get autofilled into that same role and play better than them.","replies":[]}]}]},{"poster":"dragon poo","date":"2016-11-26T05:11:49.794+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=dragon poo,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=0001000000000000,timestamp=2016-11-26T05:09:40.898+0000)\n>\n> As a support main, i disagree, the adc can be braindead and if the support is good, they can make things happen, the support is team reliant, not ADC reliant. people are human, i got out of bronze 5 last season, pretty much just supporting/ top. there is no reason you cant do the same. literally play around how your team plays, dont be an idiot trying to make shit happen and the enemy team will probably make a mistake or overextend.\n\nAlso you have 3 games as shyv, which is hardly a good indicator of being \"good\" with her, i mean, kudos for the 100% wwin rate on her, but im honestly more impressed with the 100+ games wiht 60% win rate than 3 games with 100%","replies":[]}]}]}]},{"poster":"YellowBrickRoad","date":"2016-11-26T04:46:44.362+0000","up_votes":1,"down_votes":0,"body":"Because everything that made akali good got removed, that winrate was pre nerf (or as others call it rework) akali.\n\nmy shaco in the preseason is sitting around 70% winrate, was 80% before the torrential rainfall of retards in my queues.\n\nOverall winrate im not counting because it includes like 15 games of ap shaco support back in b5.","replies":[]}]},{"poster":"Gnarlolek","date":"2020-02-05T19:43:43.095+0000","up_votes":1,"down_votes":0,"body":"I feel you man, this ranked is become more shit with every season. It rly means nothing now, just a luck based matchmaking\nnothing more","replies":[{"poster":"Bookbash","date":"2020-02-05T21:44:12.190+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gnarlolek,realm=EUNE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=0005,timestamp=2020-02-05T19:43:43.095+0000)\n>\n> I feel you man, this ranked is become more shit with every season. It rly means nothing now, just a luck based matchmaking\n> nothing more\n\nIt's so weird that Riot doesn't do anything about their matchmaking. It would reduce toxicity and lead to more skilled games, if they just fixed it. Wouldn't be too hard to do. Just make mmr change faster, and pair according to position, while also giving the algorithim more time to actually get fairer teams. Not hard.\n\n[The current situation.](https://preview.redd.it/kgyafvk4u3c41.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=3bedcc458751d730edc2578cae1e0748a89e6daf)","replies":[]}]},{"poster":"Fitzky","date":"2016-11-26T06:33:12.791+0000","up_votes":1,"down_votes":0,"body":"You seriously need to chill dude, like, quit the game for a bit.","replies":[{"poster":"YellowBrickRoad","date":"2016-11-26T08:40:50.840+0000","up_votes":1,"down_votes":0,"body":"You see i would, but with the way mmr fucking works its either i grind out a shit ton of fucking mmr now just to have a chance of not placing b5 in season 7, which in turn gives me a SMALL Chance of getting out of bronze.\n\nor i just give up now and dont play season 7.\n\nlike you dont fucking understand the struggle, bronze 5 is a fucking black hole, ive seen players down here that blow my fucking mind how good they are, they are very fucking rare but they exist and you know what? they cant get out.\n\nTake one of my mates who i used to duo with, bronze 5 shitty mmr like i have, had a mate duo with him till he was b2? hes silver 2 now.\n\nhe didnt even change, hes still the same bronze 5 kennen, only he was actually silver 2 the whole time and stuck in bronze.\n\nLike the oce fucking bronze scene is literally cancer.\n\nIve played played in other regions, i mentioned ive been playing for 8 years, i started on the NA servers, trust me when i say this its a hell of a lot easier to climb over there.","replies":[{"poster":"Fitzky","date":"2016-11-26T09:09:45.422+0000","up_votes":1,"down_votes":0,"body":"Mate we've all been there, I started my first ranked season being placed in b3 and by the end of it I was silver 5 but only just after ranked rewards were distributed, you can imagine how angry I was knowing I missed out on a silver boarder by a single day. Fast-forward to season 6 and I was determined to reach silver again after yet another b3 placement. But I was so hesitant to win every game I never looked at what I was doing wrong, sure I would win lane perfectly, then it would get to mid-late game and a fed enemy botlane would destroy me and I would flame botlane for being bad. It wasn't long before I finally realised that it wasn't worth spending 10-20 minutes constantly arguing in chat over a fucking video game. I realised that even if the other 4 people on my team were trash, there was still more I could do. So everything I do for myself is perfect and works out, so why not improve in areas where I can **help my teammates**. It was then that I realised that I could actually help botlane out a bit and maybe stop the enemy from getting a good lead if I simply tried tp'ing down botlane when the opportunity was there. When I started doing that I then started to win more and my teammates started to get good leads and win the game for us.\n\nSo listen here, YellowBrickRoad, this is a **team game**, if you truly believe your doing everything \"perfectly\" and every loss is the fault of your teammates then THAT'S where you need to improve.","replies":[{"poster":"YellowBrickRoad","date":"2016-11-27T09:06:11.445+0000","up_votes":1,"down_votes":0,"body":"One of the games i played the day i made this post i literally spent 15 minutes in bot lane securing them kills because they were feeding so hard.\n\nwanna know why we still lost despite me literally spoon feeding them gold?\n\nThe second i left they went back to feeding, meaning i lost lane pressure and cs for literally a 0 gain situation by trying to help my team.\n\nI cant be in every lane at the same time.\n\nI cant pressure every lane at the same time.\n\nI am not 5 people.","replies":[]}]},{"poster":"Rocka","date":"2016-11-26T08:43:52.638+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YellowBrickRoad,realm=OCE,application-id=Ntey9fRZ,discussion-id=Eaytn5xM,comment-id=00020000,timestamp=2016-11-26T08:40:50.840+0000)\n>\n> You see i would, but with the way mmr fucking works its either i grind out a shit ton of fucking mmr now just to have a chance of not placing b5 in season 7, which in turn gives me a SMALL Chance of getting out of bronze.\n> \n> or i just give up now and dont play season 7.\n> \n> like you dont fucking understand the struggle, bronze 5 is a fucking black hole, ive seen players down here that blow my fucking mind how good they are, they are very fucking rare but they exist and you know what? they cant get out.\n> \n> Take one of my mates who i used to duo with, bronze 5 shitty mmr like i have, had a mate duo with him till he was b2? hes silver 2 now.\n> \n> he didnt even change, hes still the same bronze 5 kennen, only he was actually silver 2 the whole time and stuck in bronze.\n> \n> Like the oce fucking bronze scene is literally cancer.\n> \n> Ive played played in other regions, i mentioned ive been playing for 8 years, i started on the NA servers, trust me when i say this its a hell of a lot easier to climb over there.\n\nI have played in bronze, barely pay attention to the game at all and its easy wins. Got several smurf accounts all in higher elos now. If you cant get out of bronze it is because of lack of understanding and poor mechanics. There is not really much else to say, improve your skills and you can climb out.","replies":[]}]}]},{"poster":"CHEESYLEEKS","date":"2016-11-27T04:09:51.386+0000","up_votes":1,"down_votes":0,"body":"objectives > highest kda","replies":[]}]}