{"poster":"YellowBrickRoad","date":"2016-01-23T05:41:18.160+0000","title":"Riot pls bring back the fucking tribunal","subforum":"Miscellaneous","up_votes":1,"down_votes":10,"body":"Just get rid of leaver buster, it doesnt fucking work and all it does is punish people who have legitimate reasons to afk.\r\n\r\nTake myself i just got put in low prio queue because i got paired up with a zilean support who decided to go 0/10 in a period of 8 minutes\r\n\r\nI then decided &quot;fuck this i dont have time for this shit im just gonna sit in fountain and fill out paper work while i wait to ff&quot; why is it, that they dont get punished for actually ruining the game, and i get punished for and i quote &quot;Abandoning a match or being afk results in a negative experience&quot; Well no shit riot, the entire reason i afk&#039;d was because i was having a negative experience.\r\n\r\nI honestly cant even be fucked to play the game anymore with this kind of bullshit, the game stopped being fun ages ago, now its just something i use to fill in my time between work and shit.\r\n\r\nYouve killed league of legends, even with your advancements in the queue system and such, you have killed league for the oce community.\r\n\r\nI have no doubt, that your na reports of the anti toxicity system are going just dandy, and thats fine, keep doing that. But do us a favor? stop being fucking lazy shits, stop working on the next skin to money grub, and fucking give us a working report system.\r\n\r\nOk i have not seen someone get banned off of reports in my 3-4 years playing on the oce servers, 3-4 years (on my main not this account) and there are trolls from way back then that i recognise and are still kicking the bucket around without bans, and they are still trolling and generating reports on the daily.\r\n\r\n\r\nHell want proof your fucking system doesnt work? Look up this account, count the reports i have against this account in the system, i give zero shits if i get permabanned for pointing out i have a few thousand reports against me in the system, go for it games sucks now anyway, but as i said proof that it doesnt fucking work.\r\n\r\nI intent feeded my way from 1-30, all the way from 1-30 with mostly intent feeding and troll builds, how the fuck did i not even get chat banned, let alone a temp or perma suspension of my account.\r\n\r\nOk i have hundreds of games on this account, if i get reported in 2/3 of those games, and i get 9 reports, how many thousands do you think that is.\r\n\r\nWhats the magic number you need before you take action.\r\n\r\nBecuase thats the issue with the oce community, we dont care, not we dont care about the consequences, you cant care about something that just straight up does not exist, no we dont care about each other, you know why? because we are so fucking salty and caught up in the moment, that without that dangling carrot of a perma ban? no one fucking gives a shit, i can be having a great game and very quickly say &quot;i dont like my team im trolling now&quot; and ill do that without a second thought, simply because i know nothing will happen, not i think nothing will happen, i know nothing will happen, and alot of us know, nothing will happen.\r\n\r\nIn fact from what i can tell the only people who actually do believe that the report system works, are new players, who are naive and take everything you say as gospel. \r\n\r\nWe all know you lie riot, you do it quite a bit actually, im sure we all remember the oce skin, what a cock up that was.\r\n\r\nAnd who did you donate the money to? we never got told.\r\n\r\nHow about that automatic report system we supposedly got? thats clearly not working, or just outright doesnt exist.\r\n\r\n\r\nLIke if the system worked statistically id see people being banned by now, because i get alot of trolls in my games, hence why i am such a salty person and hate your game so much, if i see a few hundred trolls over a period of a couple months, and i report all of them, youd think atleast 1 of them is banned yeah? unless your systems have a less than 1% accuracy rate? is that the issue riot, do your systems have a less than 1% accuracy rate for picking up reports? because that is also poor form?\r\n\r\nJust bring back the tribunal, it worked, and we need something in the meantime while you all fart ass around letting the community slowly devolve into 4chans autistic cousin.","replies":[{"poster":"sad little benju","date":"2016-01-23T07:43:55.600+0000","up_votes":2,"down_votes":0,"body":"At the end of every day I make some popcorn and come read all these post which brighten up my day. Plus all this saltiness is needed for my popcorn. Thank you.","replies":[]},{"poster":"DianasGotSwag","date":"2016-01-23T10:18:23.721+0000","up_votes":1,"down_votes":0,"body":"Tribunal2016: There will be anal.","replies":[]},{"poster":"Arf Arf Arf Arf","date":"2016-01-23T05:58:52.859+0000","up_votes":1,"down_votes":0,"body":">legitimate reasons to afk... paired up with a zilean support who decided to go 0/10 \n\nThere's only one legitimate reason to AFK - unforeseen emergencies IRL e.g. family member gets hurt. You AFKing just makes the game even worse for your team mates. Think about more than just yourself. \n\n>I honestly cant even be fucked to play the game anymore with this kind of bullshit, the game stopped being fun ages ago, now its just something i use to fill in my time between work and shit.\n\nYou're not having fun. Quit the game, or find some friends and play as a group and you won't have to face these problems. This isn't meant as an insult, I'm 100% serious. You'll be much happier if you find something other than soloQ to do with your time.","replies":[{"poster":"YellowBrickRoad","date":"2016-01-23T06:27:19.502+0000","up_votes":1,"down_votes":0,"body":"Ok so im supposed to sit through half an hour of grueling almost painful gameplay because one autistic retard thinks its funny to waste my time?\n\nThat sounds like im being punished for being trolled, not the troll is being punished.\n\nEdit: On that note surprise surprise after waiting 20 minutes for low prio queue, i get placed with yet another troll support who went out of their way to piss me off specifically because i called them out on one shitty play and told them to get infront of me (he was playing ali, if hes standing behind me trying to avoid harass he shouldnt be playing support) and THEN i also had to play for nearly half an hour because i cant afford to afk, basically i just lost nearly 2 hours of my life that i wont get back from both games combined all because the system is broken and punishes the victim not the assailant.\n\nArgue against that one mate, i dare ya.","replies":[{"poster":"Arf Arf Arf Arf","date":"2016-01-23T09:11:26.779+0000","up_votes":1,"down_votes":0,"body":">Ok so im supposed to sit through half an hour of grueling almost painful gameplay because one autistic retard thinks its funny to waste my time?\n\nYes. If he's intentionally feeding, he will be punished soon enough. In your Elo, games are easily winnable even with a heavy feeder. Just relax, stay positive, focus on your basics, and often you'll find that you can win what's basically a 4v6. Even if you can't win, there's still plenty to learn from a disadvantaged game. Learning to play from behind is one of the biggest things that can gain you Elo.\n\n>specifically because i called them out on one shitty play \n\nHow about this? Don't flame your team mates. Yes, they can do stupid things. But think of it from a selfish perspective. In the worst possible scenario, flaming your team mates will make them feed or AFK. In the best possible scenario, you might just tilt them or make them mute you, restricting strategic communication to pings only.\n\nFlaming your team mate does nothing to increase your chances of winning or having a good game. All it does is make things worse for YOU.\n\n>basically i just lost nearly 2 hours of my life that i wont get back from both games combined all because the system is broken and punishes the victim not the assailant\n\nThis isn't the right game for you. Clearly you're getting stressed out, and you're failing to see that you're also causing negative experiences for your team mates too. Quit the game. Go outside, take up a sport or something. If you keep playing games that stress you out like this you'll die early and you'll never be happy.","replies":[{"poster":"YellowBrickRoad","date":"2016-01-23T09:42:20.437+0000","up_votes":1,"down_votes":0,"body":"Im a mythic wow raider im no stranger to the concept of stress from video games and spending hours upon hours on one boss.\n\nWhat makes me pissy is that when i was raiding i had the power to just get rid of the player who was fucking up the group, like literally kick him from the group to stop us from wiping.\n\nleague you cant do that, league you HAVE to deal with it.\n\nWhich means riot has to fix the problem, which is a real problem. The issue there is riot isnt going to fix the problem because they have brainwashed everyone into thinking bans actually happen.\n\nAll you have to do is ban a few high profile players for varius things and suddenly bans actually do happen according to the general populace. meanwhile a certain summoner with a name relating to the military and with the word sarcasm in it has been trolling bronze elo with random stuff like ad soraka jg for literally a year now, a year since today is the first time i saw him do it, and hes still at it right now, no bans, no suspensions, but thousands upon thousands of games ruined for people, if you calculate that into man hours hes probably ruined a few years worth of league.\n\nYou telling me that he shouldnt be banned? because if you agree he should be banned than you also agree by default that the report system doesnt work as people like him are allowed to roam free causing chaos in their path.\n\nI would much rather a system where your first proper troll sesh you geta  warning, the next game you get a queue timer, the game after that you get a temp ban, and if you get a third strike after your warning your out kiddo better roll a new account, and the system would have to be accurate, i dont mean \"ok he got a warning a few months ago lets let this one slide\" i mean it sticks with the account forever its a permanent mark, and you only need a couple games to reach each strike.\n\nMake it take longer to roll a new account than to get banned, because that is the ONLY way you will get rid of trolls, atm we dont have anything like that, yes we have the ability to submit a report, but no one is acting on said reports, the only way punishments are dealt right now is through the automatic systems and the automatic systems dont have the power to hand out perma bans like candy.\n\nAs for the flaming thing, that again stems from my raiding experience, i have no patience for retards, sure if you arent mechanically great go ahead im not gonna bitch about it, but if you actively make a stupid decision that defies common sense and shows you do not possess the mental capability to make decisions on the fly, id rather you afk than be on my team, like i already have it hard enough lacking the mechanics to play league considering i come from a tactical basis gaming wise, its a whole nother ball game if i then have to carry some absolute fucktard ontop of that.\n\nAnd lastly im well aware im creating negative experiences but i like i said before, until riot actually starts banning these fucks, i dont give a shit.\n\nill happily go play ranked, start having a good game, see that one of my team mates thinks hes funny and is trolling.\n\nAnd ill just out troll him, ill afk or ill banter hard while building ap on draven, ill do what ever i can to end that game asap so i dont have to deal with the walking brain aneurysm that is the 0/20 top ad janna that could \n\nI think the main thing you dont understand here that is why you are telling me to quit, is that i dont get salty, at anything, except EXCEPT for smurfs, because lets face it, they are dicks, trolls, for the same reason, and in very very rare scenarios bad players, only to get me salty about you being a shit player you have to really take the cake, like im talking you have to be worse than b5 to piss me off.\n\nBasically i am pretty hard to piss off, and using a bandaid solution like \"walk away\" instead of going to the source and just removing the toxic members of the community in the first place? is just a cop out, and a pathetic one at that.","replies":[]}]}]}]},{"poster":"Hyde","date":"2016-01-23T07:27:27.925+0000","up_votes":1,"down_votes":0,"body":"Duuuuuuuudeeee........ not to be a hard ass or anything ... but like ... seriously.... chill out! its just a game, if you don't have fun playing it then just stop... if not for yourself then for... everyone else who actually enjoys playing this game... its not that hard ... just go uninstall and never think about it again, its not like it even costs you money.. you didn't invest $60 or anything .. its free, most free to play games out there are trash piles that maybe 100 people play because ... they are bad. but there are some games like LoL and such that are free to play and can be an awesome experience, I for one have a heap of fun playing it! I have been on it for 3 or so years now and probably play it more than ever. .. if you are still reading this.. I'm just going to go through everything you said and.. yea: first of all .. you complained that it punishes people who have legitimate reasons for AFK... and I'm like ... ok yea that makes sense I guess... BUT, then you say you AFKed because your support fed intentionally or not (maybe it was his first time support .. I have had worse scores playing Sivir sometimes even though I have mained her for like an entire year)... well sorry to say but, you gotta harden up and just meet it like a challenge, ok one of my team mates is not doing well at all, ok we probably can't come back, but why on earth you would think that is a legitimate reason to afk? you dam well deserved the punishment and if Zilean was feeding intentionally then your entire team and hopefully the enemy would report him and he deserves the punishment too. just have fun, go kill some minions, group up, change your build, ward more ... I don't know .. but there are a lot more ways to play this game than just give up because someone isn't doing so well... thats just stupid, and its that kind of attitude that really ruin the game. I already said before, if you are not having fun .. then whyyyy why???? are you still playing it?? its like going outside and stubbing your toe 100 time ... oh I don't like it ... but .. well , I still do it ... because .. what? is it a habit? a need? are you addicted? do you need help? just uninstall .. its not so hard. The only one \"killing\" league is people like you with your toxic attitudes, I know I'm being a bit rough here, but your kinda are asking for it. They way LoL progresses, updates, changes keeps it fluid and interesting, better graphics, new champs and items, new systems even, they all add to the game and if you see them as a downside .. then well, LoL probably isn't the game for you.  you reckon you have a few thousand reports against you?  ... I am sure that is an exaggeration ... but even so, why do you think you have so many reports? it it because you intentionally troll your team and ruin games for others, again, sorry to hit you so hard but its actually a team game,  those other champions running around the map .. yea they are other real people sitting at computers trying to have a fun time ... so when you think only about yourself and pack a big sad because one of your team mates is having a bad day and gave a kill over to the already fed Vayne... you just ruin it for all the others playing for fun. You probably didn't get banned because its pre level 30 and know one knows how to play the game properly, maybe they just thought you were trying a new champ and didn't want to report you. I don't think really anyone reports people below level 30 at all, pretty much all my friends still don't report people and they are all silver/ gold. when you talk about the entire OCE community s a whole... well thats just plain stupid, how can you possibly know what all those thousands of players think and feel? I for one do care! I would never flame my team or troll just for the hell of it, I play for fun like a lot of people do. you wouldn't just walk out into a field and just cut a cow because ... yolo and its not like i'm gonna get caught.. .so why not.. because its just not something you do.. so why would you become toxic and nasty .. just .. because???? it makes no sense. are you mentally ill or something? (you're probably not but... come on man..) as for: does the report system even work? .. well yes it does, I have had salty friends who got report warnings, hell even I have got one once because I fed in a game not intentionally but because I was having a bad day. and just one last thing to top it all off.. your language you use, all the swear words and insults.. I'm sure you think its all good and no one cares but, really? it is really needed? can't you chill it out a bit, take out some of the curse words and stop blaming a company who provides you with a fun free to play game for not being the perfect little angel that answers to your every want and need. Now I don't even want you to reply to this because I have said all I want to say and I would rather you just think about it, look over yourself, clean up your act and uninstall league or just start having fun, use the system like its meant to be used and enjoy yourself :) if you really hate the game and want to quit, look at some other games to fill your free time, there are plenty of other games out there that, you don't even have to talk to there players.\nHave a great day and just breathe out all that anger. or go hit a wall with a stick or something, that works :) (just don't hit other people)","replies":[{"poster":"YellowBrickRoad","date":"2016-01-23T07:45:04.305+0000","up_votes":1,"down_votes":1,"body":"League free? ha.. haha... hahahahahaha\n\nYou clearly havnt spent upwards of $200 on your account\n\n1. Ok first off there is a difference between intentionally trying to lose a game and not playing well, i can tell that difference, this zilean wanted to lose and was doing everything in his power to make that happen, i also know that while im sitting here dealing with a chat restriction for 10 games and 3 more 20 minute low prio queues to go hes just prancing along in his next games ruining yet more games for people, because regardless of if he got reported he isnt getting punished.\n\n2. I have fun playing the game, but only when i dont have the human embodiment of autism on my team, hell i hate it when the enemy team is playing autistically because it takes away the challenge. Hence why i would much rather riot actually do something about trolls instead of letting them run rampart because its really the only reason i hate league, but its a very valid reason that is unavoidable because of how little action rito actually is willing to take.\n\n3. The reports are not an exaggeration trust me i actually do have about that many reports, i have a near eidetic memory so i remember every game i was every reported in.\n\n4. i troll because of a simple concept that you are more than likely too young to grasp, but im going to put it this way, every human has a breaking point, that point where you have dealt with bullshit for so long that you just stop caring. I hit mine when it comes to trolls awhile ago, yes i still get salty but im at the point where im like \"well have they seem to be having a great time ruining my experience, why dont i join them since its impossible to actually get banned anyway\" so far not only have i been correct about the report system being pure cancer, ive enjoyed the game more pissing off the people i hate and i could give zero shits about the people around me while i do it because they didnt give a shit for the last 3 years ive played this game.\n\n5. I am bronze, i am in an elo where more than 60% of the population lies, i can safely say that 60% of the population is made up of retards, salty fucks like myself, and dickwads, those are the 3 options, the only other people in bronze are the occasional person that accidently tanked there for god knows what reason and gets back out in a week.\n\n6. That report warning doesnt mean shit, ive had about 100 of those, i assume you mean the little text box that pops up after your game saying \"your recent behaviour blah blah blah\" yeah, thats just the automatic system going \"gee you got a lot of reports maybe we should tell you just incase you didnt know you were toxic\" the issue never elevates to a ban, that is why the system doesnt work.\n\n7. The issue isnt that they arent perfect angels, the issue is that they have a system that does work over at na, but they refuse to give it to us over here in oce, basically they are shafting an entire community because they are too lazy to port the resources to the oce servers.","replies":[]}]},{"poster":"Kaze Enigma","date":"2016-01-23T05:55:26.341+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}} {{item:3073}} {{item:3070}} {{sticker:zombie-nunu-bummed}} \n\nCalm down. Seriously.","replies":[]}]}