{"poster":"Rendezvous Alice","date":"2018-02-20T18:18:46.386+0000","title":"Kai'Sa y su nombre.","subforum":"Jugabilidad, balance y narrativa","up_votes":12,"down_votes":2,"body":"Es una pregunta que me tiene con leg&iacute;tima curiosidad. &iquest;Por qu&eacute; Kai&#039;Sa tiene su nombre en shurimano antiguo?\r\nCre&iacute; que el shurimano antiguo se reservaba para criaturas del Vac&iacute;o que llevaban probablemente milenios en Runaterra, y separaba su nombre &quot;real&quot; de su raza con un apostrofe (&#039;). V&eacute;ase el caso de Rek&#039;Sai, de la raza de los Xer&#039;Sai.\r\nV&eacute;ase el caso de Vel&#039;Koz, que su lore nuevo dice que es posiblemente la primera intervenci&oacute;n del Vac&iacute;o en el mundo. Entonces...\r\n&iquest;Cu&aacute;l es el caso de Kai&#039;Sa?\r\nSe me ocurren tres razones para esto, que son...\r\n-En shurimano antiguo, la denominaci&oacute;n para la raza humana de hecho termina en &#039;Sa. (Il&oacute;gico)\r\n-Es la raza de la armadura simbi&oacute;tica. Eso de hecho tendr&iacute;a algo de sentido, y ser&iacute;a bastante interesante, pero... Extra&ntilde;o. En tal caso, Kai&#039;Sa no ser&iacute;a el nombre de la campeona y ella tendr&iacute;a un nombre completamente distinto.\r\n-De verdad tiene una buena cantidad de a&ntilde;os, haciendo imposible que sea la hija de Kassadin.\r\n\r\n&iquest;Kai&#039;Sa siquiera escap&oacute; del Vac&iacute;o hace poco? Tendr&iacute;a que encontrarse a Azir (O tal vez ni siquiera eso) para recibir su nombre. Entonces... &iquest;Por qu&eacute;?","replies":[{"poster":"spitfire1945","date":"2018-02-20T18:30:26.352+0000","up_votes":18,"down_votes":0,"body":"⠰⡿⠿⠛⠛⠻⠿⣷\n⠀⠀⠀⠀⠀⠀⣀⣄⡀⠀⠀⠀⠀⢀⣀⣀⣤⣄⣀⡀\n⠀⠀⠀⠀⠀⢸⣿⣿⣷⠀⠀⠀⠀⠛⠛⣿⣿⣿⡛⠿⠷\n⠀⠀⠀⠀⠀⠘⠿⠿⠋⠀⠀⠀⠀⠀⠀⣿⣿⣿⠇\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠁\n⠀⠀⠀⠀⣿⣷⣄⠀⢶⣶⣷⣶⣶⣤⣀\n⠀⠀⠀⠀⣿⣿⣿⠀⠀⠀⠀⠀⠈⠙⠻⠗\n⠀⠀⠀⣰⣿⣿⣿⠀⠀⠀⠀⢀⣀⣠⣤⣴⣶⡄\n⠀⣠⣾⣿⣿⣿⣥⣶⣶⣿⣿⣿⣿⣿⠿⠿⠛⠃\n⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄\n⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡁\n⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁\n⠀⠀⠛⢿⣿⣿⣿⣿⣿⣿⡿⠟\n⠀⠀⠀⠀⠀⠉⠉⠉","replies":[]},{"poster":"Pántheon","date":"2018-02-20T20:43:55.354+0000","up_votes":13,"down_votes":0,"body":"Kai'Sadin :v","replies":[]},{"poster":"MILFortune","date":"2018-02-20T21:01:37.639+0000","up_votes":6,"down_votes":0,"body":"Está claro que adoptó el nombre:\n\n> Para sobrevivir a sus depredadores, Kai’Sa **se convirtió en uno de ellos**. Tras de años de aislamiento sin esperanza de ser rescatada, Kai’Sa resistió gracias a su fuerza de voluntad y una piel secundaria simbiótica que **adaptó de una criatura del Vacío**. _Ahora_, la Hija del Vacío resurge como una superdepredadora dividida entre dos mundos: el mundo en el que nació, y el mundo que la creó.\n\nY que aún así puede ser hija de Kassadin o hermana de Ezreal\n\n> El Vacío es una dimensión de pesadilla que, se dice, existe** fuera del espacio y el tiempo**\n> \n\nAunque el hecho de que posea una habilidad llamada Lluvia de Icathia indica que tenía una conexión con la ciudad o que era habitante de ella. Así que bien puede ser una humana muy antigua o una exploradora perdida durante la búsqueda de la ciudad.\n\nTambién recordemos:\n\n> The Void grows, and the Void adapts\n\nO sea, el Vacío crece, el Vacío se adapta. Esto quiere decir, que los humanos alcanzados por el vacío, no cambian totalmente, si no que mutan en algo más cercano al vacío, pero sin perder lo relativo a la humanidad. Si tomamos esto en cuenta y observamos las herramientas de pelea de Kai'sa, podríamos fácilmente asumir que salió de Piltóver.","replies":[]},{"poster":"Light123","date":"2018-02-20T19:04:06.716+0000","up_votes":3,"down_votes":0,"body":"onda yo creo que Kai'Sa, si es hija de kassadin. Por las interacciones de swain con kassadin, donde dice  \"asi que escucho los rumores , la niña que volvio...\" asi que creo que ahi una posibilidad de que si sea la hija de kassadin","replies":[]},{"poster":"ImperfectIvo","date":"2018-02-20T18:33:04.501+0000","up_votes":1,"down_votes":7,"body":"Cho'Gath\nKha'Zix\nRek'Sai\nVel'Koz\nKai'Sa\n\nSegún lo que google, esas palabras por separado no significan nada o nada importante (Gath es una ciudad Israelí, Vel es \"O\" en latino...)\nSolo vas a encontrar la respuesta cuando saquen el Lore y actualizen los del vacío.","replies":[{"poster":"Rendezvous Alice","date":"2018-02-20T18:35:45.171+0000","up_votes":3,"down_votes":0,"body":"Hablo de shurimano antiguo por esa razón. Por ejemplo, Xerath no tiene significado real pero en shurimano moderno significa \"aquel que comparte\".","replies":[{"poster":"ImperfectIvo","date":"2018-02-20T18:50:04.321+0000","up_votes":1,"down_votes":0,"body":"¿De donde sacas los lores completos? Yo encuentro puras versiones resumidas. Entiendo inglés así que no hay problema.","replies":[{"poster":"Rendezvous Alice","date":"2018-02-20T18:55:51.495+0000","up_votes":3,"down_votes":0,"body":"En la página de [Universo](https://universe.leagueoflegends.com/es_AR/about/). La información que dije de Xerath aparece si vas a la [página de Azir](https://universe.leagueoflegends.com/es_AR/champion/azir/) en [Campeones](https://universe.leagueoflegends.com/es_AR/champions/) y le das al botón de \"Leer Biografía\". Esto obviamente te sale con todo el lore de Azir. Si bajas más puedes leer hasta una pequeña historia corta que tiene. \n\n>\"En medio de aquel laberinto de pergaminos, volúmenes y tablillas, Azir conoció a un joven esclavo que visitaba la biblioteca casi a diario en busca de libros para su amo y señor. En Shurima los esclavos no podían tener nombres, pero al entablar amistad con el muchacho, Azir decidió quebrantar esta ley y bautizarlo como Xerath, nombre que significa ''el que comparte''. Nombró a Xerath su esclavo personal —aunque sin ponerlo nunca en peligro usando su nombre en público— y, a partir de entonces, los dos muchachos, impulsados por un mismo amor a la historia, comenzaron a estudiar el pasado de Shurima y su largo linaje de héroes Ascendidos.\"","replies":[{"poster":"ImperfectIvo","date":"2018-02-20T21:54:36.971+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias nunca me había dado cuenta!","replies":[]}]}]}]},{"poster":"Rgnrok","date":"2018-02-21T02:28:17.542+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ImperfectIvo,realm=LAS,application-id=xQmJPO8F,discussion-id=hEJkN6JB,comment-id=0002,timestamp=2018-02-20T18:33:04.501+0000)\n>\n> Cho&#x27;Gath\n> Kha&#x27;Zix\n> Rek&#x27;Sai\n> Vel&#x27;Koz\n> Kai&#x27;Sa\n> \n> Según lo que google, esas palabras por separado no significan nada o nada importante (Gath es una ciudad Israelí, Vel es &quot;O&quot; en latino...)\n> Solo vas a encontrar la respuesta cuando saquen el Lore y actualizen los del vacío.\n\nsu nombre esta hecho con algunas letras de los demas campeones del vacio.","replies":[]}]},{"poster":"Yanx99","date":"2018-02-20T19:38:15.645+0000","up_votes":2,"down_votes":0,"body":"Pues Kassadin es o era shurimano y con interacciones con el juego muchos champs aseguran que tiene una hija, así que supongo que Kai'Sa es su hija por las similitudes en sus nombres que como ya dijiste es shurimano, lo de la edad de Kai'Sa supongo que el vacío ni siquiera tiene espacio y tiempo como puede pasar con los relatos de Bandle.","replies":[{"poster":"JPablo01","date":"2018-02-20T21:36:14.819+0000","up_votes":1,"down_votes":0,"body":"Mejor dicho, con las 2 ultimas interacciones se dice que la hija de kassadin volveria, como por ejemplo Urgot que dice que padre e hija deben estar juntos\nEs como algo similar a lo que pasó con la relación entre Garen y Katarina, campeones como Tahm Kench, Jhin o Illaoi hablaban algo al respecto","replies":[]}]},{"poster":"lllHeisenberglll","date":"2018-02-20T23:28:37.041+0000","up_votes":1,"down_votes":0,"body":"https://i.ytimg.com/vi/N9G1MDXttYo/hqdefault.jpg\n\nHmmmmm no parece ropa actual capaz Kassadin tiene muchisimos años osea parece ropa de cavernas papu\n\nhttps://vignette.wikia.nocookie.net/leagueoflegends/images/7/7d/Kassadin_OriginalSkin.jpg/revision/latest?cb=20170616223301\n\nY aca es cuando volvió asi queeeeee podria ser que el tiempo transcurre distinto xD","replies":[]},{"poster":"ALEXKOND","date":"2018-02-20T22:02:40.942+0000","up_votes":1,"down_votes":0,"body":"Esperaría a que revelen su historia completa una vez que llegue a los servidores en vivo, pero me decantaría por la 2da opción.\n\nNo me extrañaría que ella adoptase ese nombre o que sea nombrada por alguien más en clara referencia a su segunda piel simbiótica, la cual creo ya forma parte de ella y no pueda simplemente deshacerse de ella como si se tratase de una prenda de vestir.","replies":[]},{"poster":"Lucio22","date":"2018-02-20T19:55:11.320+0000","up_votes":1,"down_votes":0,"body":"Calculo que o no es la hija de kassa y/o que el nombre es el del traje que toma posesión y controla al usuario (onda venom de Spider-Man, que legalmente es un simbionte pero que puede controlar al usuario a voluntad)","replies":[]},{"poster":"Nataro","date":"2018-02-20T19:42:35.608+0000","up_votes":1,"down_votes":0,"body":"en ningun lado del lore te dice que el tiempo en \"el vacio\" transcurre de la misma manera o sigue la misma linea que en \"la tierra\", que tal si un año terraqueo es un siglo en el vacio? o hacemos la relacion 1-3, 1-5 perfectramente puede ser la hija de kassa ;)","replies":[]},{"poster":"Zxd","date":"2018-02-20T18:54:17.331+0000","up_votes":1,"down_votes":0,"body":"la 2da","replies":[]},{"poster":"Lygnus dwarf","date":"2018-02-20T18:26:45.113+0000","up_votes":1,"down_votes":0,"body":"y si el tiempo en el vacío transcurre distinto?","replies":[{"poster":"Rendezvous Alice","date":"2018-02-20T18:37:47.197+0000","up_votes":1,"down_votes":0,"body":"Es una de las posibilidades que se me ocurrieron. En tal caso, Kai'Sa no puede ser hija de Kassadin.","replies":[{"poster":"Lygnus dwarf","date":"2018-02-20T18:44:42.751+0000","up_votes":1,"down_votes":0,"body":"quedaría ver su biografía e interacciones {{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Rendezvous Alice","date":"2018-02-20T18:51:19.342+0000","up_votes":1,"down_votes":0,"body":"Yeeep. Probablemente si no se revela ahí iré al AMA que seguramente hará el equipo desarrollador en Reddit cuando salga. Espero no perdérmelo.","replies":[]}]}]}]}]}