{"poster":"Rendezvous Alice","date":"2017-04-09T22:27:19.680+0000","title":"¿Es realmente importante jugar con cámara desbloqueada?","subforum":"Guias y consejos","up_votes":3,"down_votes":0,"body":"Como una persona que reci&eacute;n se ha comenzado a adentrar en las clasificatorias a pesar de haber jugado el juego desde la temporada 3, siempre he jugado con la c&aacute;mara bloqueada en mi campe&oacute;n, con tal de concentrarme en menos cosas a la vez.\r\n\r\nTras una desastrosa partida con Xerath que tuve en la ma&ntilde;ana, me comenc&eacute; a preguntar qu&eacute; beneficios trae jugar con la c&aacute;mara desbloqueada y si deber&iacute;a comenzar a acostumbrarme a ocuparla. &iquest;Podr&iacute;an darme algunos consejos para eso, y responderme si EN VERDAD deber&iacute;a cambiar mi estilo?\r\nP.D: Usualmente ocupo a Vel&#039;Koz, Veigar y Ahri, por lo que jam&aacute;s he tenido la necesidad de desbloquear la c&aacute;mara hasta ahora, que jugu&eacute; con Xerath y fall&eacute; horriblemente cada definitiva que intent&eacute; ocupar.\r\nP.D2: &iquest;Alguien sabe c&oacute;mo se pronuncia Xerath? La duda de si es Kserath, Sherath o Serath me ha carcomido desde que empec&eacute; a jugar.","replies":[{"poster":"FedecarboneroUY","date":"2017-04-09T22:34:58.760+0000","up_votes":3,"down_votes":0,"body":"Va a haber gente que te va a decir que es obligatorio jugar con cámara desbloqueada, yo lo único que te voy a decir (juego desde la s5 con cámara bloqueada) es que no es necesario, es necesario si, desbloquearla en ciertos momentos, para eso esta la tecla: \" y \".\n\nEn cuanto a la pronunciación, en Chile supongo yo que se le diría: \"Sherat\", porque no saben decir la Y.\n\nAcá en Uruguay se le diría: \"Cerat\" o \"Cserat\" que vendría a ser lo mismo que pronunciar la X.","replies":[{"poster":"Numerítos","date":"2017-04-10T00:26:50.656+0000","up_votes":1,"down_votes":0,"body":"> En cuanto a la pronunciación, en Chile supongo yo que se le diría: \"Sherat\", porque no saben decir la Y.\nAcá en Uruguay se le diría: \"Cerat\" o \"Cserat\" que vendría a ser lo mismo que pronunciar la X. \n\n\nQue? no entendi","replies":[{"poster":"FedecarboneroUY","date":"2017-04-10T01:00:46.364+0000","up_votes":1,"down_votes":0,"body":"Mira, en realidad creo que me equivoqué xD\nPorque en Chile dicen \"chow\" en vez de \"Show\" no sé si entendes, le erré feísimo en eso XD","replies":[{"poster":"Numerítos","date":"2017-04-10T01:41:11.265+0000","up_votes":1,"down_votes":0,"body":"no te preocupes, no entendi que decias porque no lei todo el post no me habia fijado de los PD y no entendia el contexto con el que lo decias","replies":[{"poster":"FedecarboneroUY","date":"2017-04-10T02:31:51.624+0000","up_votes":1,"down_votes":0,"body":"xDD","replies":[]}]}]}]}]},{"poster":"Shion Archimago","date":"2017-04-09T22:31:13.417+0000","up_votes":4,"down_votes":1,"body":"no\npero es importante saber cuando desbloquearla \nhay campeones q necesitan tener mas vision del mapa por sus habilidades","replies":[]},{"poster":"lordeman10","date":"2017-04-10T01:29:12.017+0000","up_votes":2,"down_votes":0,"body":"¡tunel-visión!\n\njugá como estés cómodo pero tené en cuenta que jugar con la camara bloqueada te empuja al tunel vision que significa que solo tenés visión una visión limitada del objetivo, solo ves una luz pero te perdés lo que hay alrededor que puede cambiar totalmente las cosas, la idea es que uses el minimapa para hechar un vistazo general pero cuando ves algo importante como un objetivo o una posible emboscada puedas enfocar tu camará ahí para saber que está pasando exactamente, ya que no es lo mismo ver una annie lvl 6 full de vida yendo a tu linea que una annie lvl 5 con 30% de vida, por poner un ejemplo tonto, si sabés lo que viene podés analizar más la situacion puede que mates la annie en lugar de simplemente uir \n\nen linea muchas veces te favorece en especial con campeones de mucho rango, probá hacer lo que yo hago andá a configuraciones de camara y donde ves la tecla Y (es la que está en bloqueo/desbloqueo de camara) la cambiás por barra de espacio, entonces vas a poder bloquear la camara y desbloquearla con solo apretar el espacio, la dejás la mayoria del tiempo bloqueada salvo cuando haya alguna situación puntual entonces apretarías espacio y se desbloquearia, y espacio para volver a enfocarte y bloquearla\n\nte digo a mi me parece muy importante, a veces viene un amigo a jugar a casa que juega con la camara bloqueada y me pongo re nervioso viéndolo porque por ahí hay peleas en equipo y no puedo verlas, no es de chusma ver una tf, uno tiene que saber como está la situación del equipo y que habilidades se gastaron, igual que para emboscar o rotar de lineas, no podés entrar en una linea a emboscar a alguien si no tenés idea de la situación eso tenés que verlo mientras estás pensando en entrar.. se pierden demasiados detalles de la partida, a mi amigo siempre termino diciéndole \"tendrías que haber prestado atención a que pasaba ahí\" \n\nvoto por seratch","replies":[]},{"poster":"Kími","date":"2017-04-11T02:08:31.745+0000","up_votes":1,"down_votes":0,"body":"Mira amigo, la verdad la cámara bloqueada te saca mucha visión del mapa, es recomendable no tenerla 100% bloqueada.   Te recomiendo que tengas la cam sin estar fija, y cuando quieras fijar, mantén el espacio o space (o como quieras llamarlo) para saber donde estas ubicado así te concentres mas en linea.  \n\nSaludos","replies":[]},{"poster":"SenpaiDeathx","date":"2017-04-10T17:39:08.706+0000","up_votes":1,"down_votes":0,"body":"si te acomoda ps bien, cada quien juega como lo sienta mas cómodo, tengo un amigo que juega en notebook y usa el pad, ni idea como lo hace para jugar decente usando eso y no el mouse.","replies":[]},{"poster":"Clothill","date":"2017-04-10T07:16:39.852+0000","up_votes":1,"down_votes":0,"body":"Realmente creo que es cuestion de cada usuario, mas que nada es para su comodidad. He oido sobre las personas que no pueden encontrar su personaje cuando juegan com la camara desbloqueada, por ello usan la camara bloqueada, como decia antes creo que es cuestion de cada uno.","replies":[]},{"poster":"Edden","date":"2017-04-10T02:57:50.030+0000","up_votes":1,"down_votes":0,"body":"No creo que sea necesario si te sabes manejar bien con lo de desbloquearla en ciertos momentos, pero la realidad es que, si te terminas acostumbrando, jugar con la cámara desbloqueada resulta más cómodo, aunque siempre puedes jugar con la cámara semi bloqueada o como se llame, esa que ademas de la pantalla te deja ver y mover un poco la cámara en todas direcciones pero que en si mismo esta \"fija\".","replies":[]},{"poster":"Espada","date":"2017-04-09T23:41:32.470+0000","up_votes":1,"down_votes":0,"body":"Camara desbloqueada gana en cuanto a beneficios (mayor visión y por ende control del mapa el mas importante), pero en lo personal si te gusta la camara bloqueada puedes optar por una mediación \"amigable\" en cuanto a una toma de decisión, por ejemplo hay muchos jugadores que ocupan ambas (se van intercalando el uso dependiendo de la situación dada) entre los que me incluyo, pues saber sacar lo mejor de ambas modos llega a ser sublime y mucho mas cómodo que hacer una dicótoma rigida entre ambas;  la camara bloqueada te ofrece un seguimiento mucho más fiel en el movimiento del campeón lo que ayuda muchísimo en situaciones como un chase o un poke & run , mientras que ya mencionado antes la camra desbloqueada te permite un mejor control de tu entorno como pudiese ser la fase de linea. \nIgualmente esta en ti la elección pero personalmente te recomendaría probar, la camara desbloqueada puede llegar a considerarse mejor pero no hay que olvidar el factor comodidad {{champion:92}} .","replies":[]},{"poster":"panther189","date":"2017-04-09T23:38:46.108+0000","up_votes":1,"down_votes":0,"body":"es muy importante, es como si usaras esas cosas que usan lo caballos en los ojos para que no vean hacia los costados.\nPierdes vision de lo que pasa en frente tuyo.","replies":[]},{"poster":"Shino Asada","date":"2017-04-09T22:37:24.298+0000","up_votes":1,"down_votes":0,"body":"pero para eso esta la tecla \"Espacio\" lo mantienes presionado cuando te estes concentrando como en el farm o en tu campeon solamente, considero bastante importante tenerla desbloqueada para evitar gankeos repentinos y cosas asi :v","replies":[]},{"poster":"Axlbg","date":"2017-04-09T22:34:16.606+0000","up_votes":1,"down_votes":0,"body":"Yo creo que sí, me perdería de muchas cosas teniéndola siempre bloqueada, igualmente suelo usar mucho la _barra espaciadora_ para bloquearla cuando yo quiera.\n\n{{champion:101}} Creo que lo mas cercano es Serath https://www.youtube.com/watch?v=2v5MmuMJ2qU","replies":[]}]}