{"poster":"Akujii","date":"2015-09-04T00:57:52.139+0000","title":"Il sistema limitazione ranked e chat non funziona.","subforum":"Discussioni generali","embed":{"description":"Captured with Lightshot","url":"http://prntscr.com/8cchwz","image":"http://i.imgur.com/EVIovCH.jpg"},"up_votes":10,"down_votes":4,"body":"Dopo aver finito la partita con Tham Kench, insieme ad un mio amico in skype riavvio il client, e cosa mi ritrovo? \r\n-Per via di alcune attivit&agrave; negative su questo account, i messaggi in chat sono attualmente limitati per 75 partite.\r\n-Per via di alcune attivit&agrave; negative su questo account, l&#039;accesso alla coda classificata in singolo &egrave; limitato per 35 partite.\r\n\r\n.......\r\n\r\nAre you fking kidding me?\r\n**N1 - Stavo su skype con amici.... non scrivevo niente.\r\nN2 - Non Potevo scrivere niente per via della cosa che, mi sono tolto la chat manualmente per non dovermi deconcentrare per i flammer [Link Screensot](http://prntscr.com/8ccj45)\r\nN3 - Non facevo niente di sbagliato ero Tham support, non trollavo, non rompevo e stavo sempre con il mio amico ADC\r\n**\r\n....\r\n\r\nHo mandato la lettera al supporto ma so che mi diranno che non possono togliere le chat e ranked ristrette... come sempre.\r\n\r\nIo ho gia ho ricevuto restrizioni e un ban e le ho fatte senza dire una parola perch&egrave; me le meritavo, ma questo &egrave; troppo.\r\n\r\nOk la mia domanda &egrave; questa: Come fare a migliorare o almeno cercare di andare  per la retta via se al primo report di una persona che rosica mi danno le restrizioni.\r\n\r\nBot intelligenti si come no.... Voglio vedere se mi danno almeno un motivo per il quale mi hanno dato le restrizioni o mi rispondo in modo stupido come sempre.\r\nTham vuol dire prendersi restrizioni eh?\r\nGrz mi sfogo che questo post &egrave; alle 3 di notte...\r\n\r\n[Ecco il link della partita](http://prntscr.com/8ccld2)","replies":[{"poster":"Nabbomaster","date":"2015-09-04T02:52:33.949+0000","up_votes":7,"down_votes":2,"body":"semplicemente il ban non e' per quella partita, i report di quella partita hanno fatto solo partire i controlli e vedendo le partite dove eri stato reportato hanno controllato se eri un tossico o no\ne il risultato e' che sei un flamer","replies":[{"poster":"Akujii","date":"2015-09-04T10:55:44.315+0000","up_votes":1,"down_votes":2,"body":"Peccato che non ho la chat da 2 settimane !!!\nTolta manualmente con il commando nella cartella Rot Games.\nSi ho flammato come no.\nSe un tipo rosica in quanto salvo la gente mangiandola   mica mi de v o beccare la coda limitazioni!!!\nPS: piccolo  problema le partite prima erano aram dove  giocavo con 5 amici.... chi  report a in aram????","replies":[{"poster":"franz94","date":"2015-09-04T16:48:15.617+0000","up_votes":3,"down_votes":0,"body":"1 il sistema controlla tutte le partite il motivo della punizione può tranquillamente essere di 6-7 mesi fa... \n2 capita molto che alcune persone sono punite per insultare anche solo per scherzo alcuni amici in premade in quanto il sistema non fa distinzione... ","replies":[]}]},{"poster":"Akujii","date":"2015-09-04T11:05:38.975+0000","up_votes":1,"down_votes":3,"body":"Quasi dimenticavo, sete stupidi a pensare che il bot si a infallibile un mese fa ha bannato un casino  di gente a caso, tanto che la riot ha dovuto sbannare molti account manualmente per le  lamentele.\nE ancora una cosa, io sono stato ristretto molte volte e questo mi comporta che al primo stronzo che mi reporta vengo subito ristretto per che beh sa com'è la RIOT non crede che vuoi migliorare non te lo lascia manca provare.\nHo dovuto togliere la chat per via delle persone che flammavano e con le quali io discutevo dopo prendendomi i le limitazioni.!!!\nGRZ RIOT","replies":[{"poster":"franz94","date":"2015-09-04T16:57:01.871+0000","up_votes":3,"down_votes":0,"body":"con questo commento mostri di essere alquanto immaturo. Molte persone, dopo essere state punite, hanno migliorato il loro atteggiamento, se vieni punito più volte vuol dire che semplicemente non hai imparato la lezione.\nPer quanto riguarda il bot, ovvio che non è perfetto ma generalmente non sbaglia e se sbaglia è colpa di un errore umano fatto dai programmatori.\nIl problema di alcuni mesi fa è stato risolto da quanto ho letto, ci saranno altri errori? sicuro ma il bot e molto più veloce del vecchio tribunale e viene migliorato con il tempo.","replies":[]}]}]},{"poster":"Easlay","date":"2015-09-04T08:48:23.515+0000","up_votes":4,"down_votes":2,"body":"non capisco cosa ci sia di difficile da capire che non è l'ultima partita a causare la punizione.\nSE ti han reportato, e SE si arriva a un tot numero di report, il sistema prende e inizia a controllare le tue partite regresse (sostanzialmente partendo dall'ultima analizzata per la precedente punizione), e SE rileva comportamenti negativi parte la sanzione.\nNon è che se hai avuto un comportamento sbagliato per tot mesi, e poi nell'ultimo breve periodo non hai fatto nulla, allora il sistema dice \"è tutto ok, è pulito\", non funziona così :V\nHa analizzato, sei risultato da punire, la sanzione è arrivata, stop.\nE no, prima che si dica \"eh ma reportano a caso!!11\", non vuol dire nulla; SE il sistema vede i report e poi l'analisi non porta a risultati, questi vengono visti come falsi positivi e non succede nulla, e anzi, i report successivi di quel player avranno validità sempre minore se non quasi nulla, in quanto etichettato come \"non affidabile\"\n\nPiù chiaro di così, il sistema penso non possa essere","replies":[{"poster":"Akujii","date":"2015-09-04T10:56:50.401+0000","up_votes":1,"down_votes":3,"body":"Ti rispondo come  ad altri, ho tolto la chat da 2 settimane  e di solito gioco aram.","replies":[{"poster":"franz94","date":"2015-09-04T16:59:54.783+0000","up_votes":2,"down_votes":0,"body":"Hai letto il commento? \nil controllo viene fatto su tutte le partite(a partire da l'ultima controllata se sei già stato punito), la modalita di gioco non cambia nulla per il sistema si può essere puniti anche facendo solo partite personalizzate con gli amici...","replies":[]},{"poster":"Nabbomaster","date":"2015-09-04T12:49:37.280+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Brock O Lee,realm=EUW,application-id=MJVj50Jw,discussion-id=jzPEPZBz,comment-id=00060000,timestamp=2015-09-04T10:56:50.401+0000)\n>\n> Ti rispondo come  ad altri, ho tolto la chat da 2 settimane  e di solito gioco aram.\n\nche centra se e' aram o normal? io quando scrivevo easya fine di oqni partita o aspettato mesi prima che mi arrivassero i ban","replies":[]}]}]},{"poster":"Saryukai","date":"2015-09-04T01:02:02.056+0000","up_votes":2,"down_votes":3,"body":"Ero in partita con lui e non ha scritto niente perche' parlavamo su skype","replies":[{"poster":"SKFF1R SubZero","date":"2015-09-04T09:09:07.340+0000","up_votes":2,"down_votes":1,"body":"Si ma se non scrive niente in questa partita e nelle scorse invece ha fatto scendere Gesù e tutti i santi, capisci da solo che se lo è meritato magari x'D","replies":[{"poster":"Akujii","date":"2015-09-04T10:57:11.874+0000","up_votes":1,"down_votes":2,"body":"no chat","replies":[]}]}]},{"poster":"73668109_DEL","date":"2015-09-04T18:27:06.985+0000","up_votes":1,"down_votes":0,"body":"Puoi arrabbiarti quanto vuoi , ma se hai beccato la restrizione te la meritavi .\nNon ci credi , chiedi al supporto le parole che ti incriminano , aspetta 2 mesi e sarai accontentato , ti stupiresti di quali sono quelle nella loro black list, addirittura raped .","replies":[]},{"poster":"Patata Aliena","date":"2015-09-04T01:09:01.217+0000","up_votes":1,"down_votes":0,"body":"Dimmi cosa ti risponde il supporto","replies":[{"poster":"ViaMalinconiaN9","date":"2015-09-04T01:49:12.117+0000","up_votes":1,"down_votes":1,"body":"Semplice, risponderà un bot che dirà più o meno:\nNoi sapiamo che hai flammato, cerca di migliorare.. non possiamo darti prove, etc.. cose del genere, una risposta no-sense. (lo so per esperienza)","replies":[{"poster":"franz94","date":"2015-09-04T17:03:36.639+0000","up_votes":1,"down_votes":0,"body":"Be il bot risponde in automatico nei primi tentativi, perché ti risponda una persona devi tentare un po di volte, per quanto ne so ,se ti risponde una persona del support o questa può mostrarti la chat incriminata e in caso di errore anche togliere la punizione.\n( Più bello  se facessero come nel forum americano dove mettono il chatlog sul forum in modo che tutti possano vedere la tossicità della persona :p)","replies":[]}]}]},{"poster":"DeathJehuty","date":"2015-09-04T06:27:17.984+0000","up_votes":1,"down_votes":0,"body":"Da quanto tempo hai disabilitato la chat?","replies":[{"poster":"Akujii","date":"2015-09-04T10:57:39.979+0000","up_votes":1,"down_votes":2,"body":"2 settimane, mi sembra un po troppo se un chat restriction deve arrivare da  2 settimane.","replies":[]}]},{"poster":"Rhadamant1s","date":"2015-09-05T10:28:39.050+0000","up_votes":1,"down_votes":4,"body":"Alla fine è inutile lamentarsi sul forum. Anzi finirai per innervosirti ancora di più, perché sarai costretto a sorbirti tutti i lecchini che per partito preso danno ragione alla Riot e al sistema di bot che utilizza.\nVorresti che venissero puniti quelli che sono la causa dei flame? Ma stai scherzando? :D \nSarebbe una cosa intelligente, quindi non avverrà mai!","replies":[{"poster":"franz94","date":"2015-09-05T16:19:06.473+0000","up_votes":1,"down_votes":0,"body":"Generalmente i troller e gli afk sono puniti già dal sistema, pero poi molta gente ti flamma solo perché uno perde la lane o prende x champ cosa che non sono punibili quindi....","replies":[]}]},{"poster":"xKotoriH","date":"2015-09-05T10:59:59.820+0000","up_votes":1,"down_votes":1,"body":"Capitata la stessa cosa a me, per lo stesso numero di partite (sia chat che ranked)","replies":[]},{"poster":"LordBlackout93","date":"2015-09-05T15:53:00.941+0000","up_votes":1,"down_votes":2,"body":"stessa cosa anche a me,in una ranked sono stato reportato per negative attitude anche se non avevo detto offese,spamm,troll,flame e altro...l'unica cosa che scrivevo era in all \"finish please\" punto...ma il sistema e fa fatica ad avere delle prove :D","replies":[]},{"poster":"Shaikorth","date":"2015-09-04T03:31:11.948+0000","up_votes":2,"down_votes":5,"body":"Ma è proprio il sistema di report che è una boiata.\nDovrebbero risolvere le case che frustrano le persone, non punire a muzzo chi perde le staffe a causa del loro gioco.","replies":[]}]}