{"poster":"l Mugetsu l","date":"2018-02-08T21:09:41.341+0000","title":"Eure Meinung zum derzeitigen \"League of Legends\"","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":4,"body":"Also worauf ich mich hier beziehen m&ouml;chte mit euch sind folgende Punkte (Meine Meinung dazu ganz unten) :\r\n\r\n    Patch&auml;nderungen seit den letzten 3 Jahren\r\n    Stopwatch\r\n    Tanks vs ADC und Allgemein die Tank Meta\r\n    Das man praktisch dazu &quot;gezwungen&quot; wird Tanks zu spielen\r\n    Enjoyment von dem Spiel\r\n    Schilde bzw. alles was damit zutun hat Schildpower Items die Champs die schilden k&ouml;nn Runes etc.\r\n    Das Riot Komplett die Meinung und Vorschl&auml;ge der Community ignoriert\r\n\r\nSo dann fangen wir mal an ^^\r\n1.Meiner Meinung nach ging das Spiel seit season 4-5 den Bach runter.\r\nDie Patch&auml;nderungen f&uuml;r bestimmte Champs (z.B Fiora(viel zu stark meiner Meinung nach); Der neue Swain ist auch ein gutes Beispiel, da ich gegen den Heute noch gespielt habe und es kann nicht sein das ich mit Nasus 700 Stacks 250MR 45 CDR halt fullbuild Nasus ein 1on1 gegen den Swain mache und der mit Full Life rauskommt und ich tod bin ??? Wie soll das Funktionieren? Naja auf zum n&auml;chsten Thema, sonst wird das hier noch Roman.\r\n\r\n2 Das kann ich mir ehrlich gesagt garnicht erkl&auml;ren, sowas z.B auch ist wieder viel zu stark ,hiermit nimmt man Zed/Talon/LB, halt &uuml;berwiegend Assasinen alle M&ouml;glichkeiten jemanden zu t&ouml;ten ab lvl 6 und aufsteigend solange man die Stopwatch halt noch nicht gebraucht hat.\r\n\r\n3 Hier ist das Limit dann aber auch echt erreicht , es kann nicht sein das man gegen Tanks egal zu welchem Zeitpunkt ob Early Late Mid Game Keine Chance hat, es geht nicht egal ob man Botrk Lord Dominiks oder was auch immer man gegen HP oder % baut hat , man hat einfach keine Chance!.Das muss ich jedes mal wieder aufs neue Feststellen, man hat als ADC einfach keine Chance mehr,wenn man z.b das Game Snowballt bzw. sehr stark snowballt (Aber da auch wieder wann und wie oft Snowballt man so hart das das Game in 20Minuten over ist vll 1.mal alle 20-30 Games wenn &uuml;berhaupt)\r\ndann hat man vll noch die Chance zu gewinnen wenn dies nicht der Fall ist hat das Team mit Mehr Tanks ab minute 25-30 zu 100% gewonnen und das kann einfach nicht sein.\r\n\r\n4 So hier kann man dann wieder auch zur&uuml;ck auf Punkt 3 greifen und wei&szlig; was gemeint ist, hier kommt aber wieder die Frage &quot;Will ich &uuml;berhaupt einen Tank spielen&quot;, Ich spiele doch um Spa&szlig; zuhaben aber auch nat&uuml;rlich um zugewinnen, dies ist aber einfach nicht mehr M&ouml;glich wenn man keine Tanks im Team hat, was einen Teilweise wieder zwingt einen zu spielen,weil man sonst eben halt verliert.\r\n\r\n5 Ich pers&ouml;nlich hab die Schauze voll von diesem Rotzgame, Nichts Klappt mehr . Das gesamte game ist Unbalanced. Kein vern&uuml;nftiger Support.\r\nZuviele Bugs die nicht gefixt werden. Man hat einfach kein Spa&szlig; mehr. Riot als Unternehmen hat meiner Meinung nach bei diesem Spiel TOTAL Versagt letzendlich in den letzten 3 Jahren, Ich spiele seit Season1 und muss ehrlich sein ich hatte Spa&szlig; zuspielen auch wenn jemand geflamt hat oder wenn ich geflamt wurde ich hatte trotzdem zu 99% das spiel Genossen, aber das geht einfach nicht mehr. Wie denn auch bei diesen Patches und alles drumherum.\r\n\r\n6 So hierzu gibt es nat&uuml;rlich auch wieder sehrviel zumeckern,da ich das gesamte Konzept der Schild supporter nicht vern&uuml;nftig durchdacht finde , da es nicht sein Kann das es 3-4 Items gibt die Nochmal extra Schildpower geben und dazu nochmal vielzuviel Manareg und CDR. Au&szlig;erdem finde ich es auch ec ht absurd das der Ardent Censor z.B 6 sekunden anh&auml;lt und Nami/Janna/Lulu 5 Sek Cooldown aufm Schild haben und dazu ne Manareg von 20-30 per sec.\r\nHier auf der Laning Phase auch hat man kaum noch die Chance mit Supportern zu gewinnen die Keine Schilde haben, da Janna/Nami/Lulu/morgana z.b einfach viel zuviele M&ouml;glich keiten haben nen Gank zu verhindern und algemein nen Thresh/Leona einfach komplett Useless machen k&ouml;nnen auf der laning phase bedacht.\r\n\r\n7 Hierzu muss ich glaub ich garnichts mehr zu sagen, naja Riot ihr habt verschissen bei diesem Thema. Bots als Supportsystem .\r\nVorschl&auml;ge ?? gibt es Tausende nat&uuml;rlich, ist aber auch gut so, da ich finde das die Community das Spiel auch mit gestalten sollte, aber bei Riot? Ne das geht leider nicht. Da diese Komplett Ignoriert werden und Patchnotes etc. einfach selbst entschieden werden, ich mein ist doch Toll 20 Leuten gef&auml;llst doch , wenns 10Millionen anderen nicht gef&auml;llt ist das doch egal &quot;Sie spielens ja trotzdem also gef&auml;llst den ja schon st&uuml;ckweit&quot;. Jap sch&ouml;ne Fantasie die hier herscht. Wenn man das hier mal z.B mit Battle.Net vergleicht (Steam brauchen wir garnicht dr&uuml;ber reden ist genau so&acute;n Rotz vom Supportsystem her)\r\nsind das Zwei Verschiedene Welten Battle.net hat nen Super Support SUPER SUPPORT(probs an euch) das kann man mit Riot garnicht vergleichen, die k&uuml;mmern sich um ihre Community und sorgen daf&uuml;r das alle Zufrienden werden und Spa&szlig; haben am Spiel was bei Riot eher weniger der Fall ist.\r\n\r\nNaja Schluss Aus Ende bevor das hier noch 2 Stunden weitergeht .\r\n\r\nWie w&auml;rs wenn ihr einfach mal eure Meinung dazu gebt. CY@\r\n\r\n{{sticker:slayer-jinx-catface}}  Peace","replies":[{"poster":"Westcoast38","date":"2018-02-08T23:18:45.233+0000","up_votes":2,"down_votes":3,"body":"Ok ich geh mal stark davon aus das du entweder ein Assasin Main bist oder ADC Main der versucht Tanks zu oneshooten. Sry aber dann bist du im falschen Spiel. Wenn diese spaßraubenden Assassine nun auch Tanks oneshooten sollen dann tut es mir leid es sagen zu müssen aber du hast das Spiel seit Season 1 nicht verstanden. Die sind sowieso nervig und es ist gut so das die jemand auch bestrafen kann für ihre nervige Art, vorallem diese Zed Spieler die dauernd taunten und ihre Mastery spammen. Zum Kotzen sowas!\n\nAnsonsten könnte ich dir fast überall zustimmen. \n\nDas Spiel ist wirklich ab Season 5 gestorben weil es sehr einseitig geworden ist. Alles dreht sich um die Meta, wer ist OP und wer nicht. Das ist Troll und das nicht.\n\nEs ist auch gut so. Nun heißt es nicht mehr eine 2 Tasten drücken und Ende = fertiger Kill (alte Lb z.b)\nDa ihr AssassinMains ja immer behauptet ihr braucht Skill. Da jetzt könnt ihr zeigen ob ich wirklich Skill habt oder nur damals so overfeed wart weil die Champs so easy zu spielen waren mit einem unnormalen Schadensoutput.\n\nDann spiel einfach auch Tanks und gut ist. Als ADC solltest du auch generell nicht auf die Tanks draufgehen, sondern die gegnerischen Carries focusen es sei den du bist Vayne aber die ist eh Tötungsmaschine mit ihrem Truedmg ( das ist aber ok, bisschen mehr Tankyness für die Tanks aber nicht).\n\nWenn du Spaß haben willst mit diesen untanky Champs, geh dann Normal games. Ich finde es auch immer wieder blöd zu verlieren weil mein Jungler und Toplaner immer wieder meinen sowas wie Yasuo und Kha in ein Team mit 3 gegnerischen Tanks zu picken.\n\nNaja, sowie früher nichtmehr das stimmt, aber so extrem finde ich es jetzt nicht.\n\nAssassine haben ihren Tödlichkeitsfaktor, Crit, Lebensraub, AS usw. APs Magiedurchdringung Tanks Leben und dann sollen die Supporter eben eine bessere Heilkraft bekommen. \nEine Janna hat auf jeder Stufe 10 Sekunden CD auf ihren Schild und die anderen sind auch nicht ganz so niedrig. \n\nJa hast du Recht.","replies":[{"poster":"CYPHΕR","date":"2018-02-09T14:34:58.146+0000","up_votes":3,"down_votes":0,"body":"> Das Spiel ist wirklich ab Season 5 gestorben weil es sehr einseitig geworden ist. Alles dreht sich um die Meta, wer ist OP und wer nicht. Das ist Troll und das nicht.\n\nDie Meta ist eigentlich ziemlich irrelevant. Die einzigen Elo-Bereiche in denen sie eine Rolle spielt sind Master und Challenger. Überall darunter kannst du spielen worauf du Lust hast bzw. was du gut kannst. Das reicht mehr als genug aus. Erst wenn Skilldefizite keine Rolle mehr spielen (Master+) wird die Meta relevant, weil sie dann den entscheidenden Vorteil erzeugt.\n\nDie Ironie dabei ist aber, dass ausgerechnet in Bronze und vorallem Silber der größte Metazwang überhaupt herrscht  (durch die Spieler selber erzwungen). Und warum? Weil sich hier keiner wirklich mit den Spielmechaniken auseinandersetzen will und lieber 1zu1 alles von den Pros kopiert, ohne überhaupt verstehen zu wollen warum oder mit welcher Spielweise etwas stark ist.\n\nAlleine die Tatsache, dass Bronze und Silber dabei metatechnisch meist 1-2 Patches hinterherhinkt zeigt doch die Problematik. Z.B. werden \"OP-Meta-Itembuilds\" in Silber teilweise erst entdeckt und gebaut, wenn sie bereits seit 2 Patches wieder generft wurden.\n\nSo gut wie jeder Spieler in Silber kann dir sagen, welche Champs aktuell als \"OP\" gelten. Allerdings wird dir keiner erklären können warum.","replies":[]}]},{"poster":"Pilze","date":"2018-02-10T14:53:22.315+0000","up_votes":1,"down_votes":0,"body":"Ich gebe dir da auch recht. Das Spiel ist festgefahren und es kommt einfach nichts mehr nach und jede Season sieht man immer die selben Champions, hat man ein Spiel am Anfang der Season gesehen brauch man eigentlich gar nicht mehr schauen weil man weiß was kommt. \nIch finde das Thema Türme sollte Riot mal überdenken, kann ja auch nicht sein was man schon ab LvL 2 unter dem Tower geholt werden kann. \nDas Riot die Spiele unbedingt schneller haben wollte hat das Spiel fast schon in Grund und Boden gestampft. \nAuch die extrem hoch gepushte E-Sport Szene hat einen großen Beitrag dazu geleistet das dieses Spiel langsam einschläft und soweit es mich angeht finde ich hat das Spielniveau in den Ligen deutlich abgenommen. \nRiot merkt das auch deswegen auch dieser hoffnungslose versucht mit den Missionen. \nIch spiele dieses Spiel wirklich gerne und bin schon sehr lange dabei und habe alle Höhen und Tiefen miterlebt, sogar die Zeiten vor S1 wo Turbine noch die Server hatte ( wenn man den Spielen konnte ) war mehr Feuer im Spiel drin als jetzt.","replies":[]},{"poster":"OrangeBubble","date":"2018-02-10T03:46:50.906+0000","up_votes":1,"down_votes":0,"body":"Geühlt machen Türme kein DMG und sind eigentlich nur Deko ^^'''' \nDas ärgert mich schon bissel :d","replies":[]},{"poster":"Fíddlestîcks","date":"2018-02-08T22:25:44.186+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=l Mugetsu l,realm=EUW,application-id=KYnfKGf0,discussion-id=nR8kGilE,comment-id=,timestamp=2018-02-08T21:09:41.341+0000)\n\n> 2 Das kann ich mir ehrlich gesagt garnicht erkl&amp;auml;ren, sowas z.B auch ist wieder viel zu stark ,hiermit nimmt man Zed/Talon/LB, halt &amp;uuml;berwiegend Assasinen alle M&amp;ouml;glichkeiten jemanden zu t&amp;ouml;ten ab lvl 6 und aufsteigend solange man die Stopwatch halt noch nicht gebraucht hat.\n\n\nwie du sagst es sind ASSASINS deren Aufgabe  ist es leute die OUTOFPOSITION stehen zu töten , sie zu bestrafen das is ihr job , squishis zu töten is auch ihr job","replies":[{"poster":"Jura500","date":"2018-02-09T00:02:10.780+0000","up_votes":1,"down_votes":0,"body":"Und genau da liegt ja sein Problem mit der Stopwatch, diese gibt einfach zu viel Sicherheit. \n\nWobei die Probleme von Assasins weitaus tiefer liegen. Es gibt keinen Counter zu Schilden, wie z.B. für Heals.\nAußerdem kommt halt das Assasinrework hinzu, von dem selbst schon Riot gesagt hat, dass es gescheitert ist.","replies":[{"poster":"Nordwolf87","date":"2018-02-09T10:28:23.846+0000","up_votes":1,"down_votes":2,"body":"1. Stoppwatch funzt ein einziges mal! Danach muss man auf zhonyas warten (was meist erst das 2. oder 3. Item ist) da hat jeder genügend zeit für kills. Bzw nicht jeder kauft zhonyas dh genau 1x golden im ganzen spiel...DRAMA meine damen und herren.\n\n2. Stoppwatch kann man erzwingen ähnlich wie flash und später bestrafen.\n\n3. Oh nein ein gegner hat EINMAL die chance eine Zed, kata oder talon ulti zu überleben!!! Das geht gar nicht! Die armen assassins!\n\n4. Der counter für schilde heißt damage, davon haben assassins reichlich.\n\n5. Gott sei dank ist die ekelhafte Assassin meta der preseason ein bisschen weg! Und man wird nicht von talon/zed/kata sobald sie lvl 6 haben unterm turm von 100 auf 0 geburstet und sie dashen raus ohne mehr als 1 towershot zu kassieren. Jetzt kann man auch wieder mages in der mid vernünftig in lower elo spielen.","replies":[{"poster":"Jura500","date":"2018-02-10T00:28:11.574+0000","up_votes":1,"down_votes":0,"body":"1. Zed hat ein Fenster in dem er usefull ist und muss in der Zeit snowballen. Für Talon gilt das gleiche. Beide fallen im late hart ab.\nStopwatch nimmt dir eine Chance diesen snowball zu starten. Midlaner mit Gehirn bauen dann armguard und tabi. Und schon war's das.\n\n2. Jup kann man. Aber man hat eben ein Defensivtool mehr. Man kann zum Beispiel den Flash CD überbrücken oder den CD von Barrier/exhaust.\n\n3. Kata ist in der Tat recht stark im Moment. Zed und Talon haben Probleme sobald Gegner groupen.\n\n4. Sorry, die Aussage ist dumm. Demnach ist DMG der Counter für alles. Zu heal gibt es eine Mechanik die dagegenwirkt, für Schilde nicht. Ganz davon abgesehen haben fast alle Assassins einen delay auf ihrem Schaden. Ne Janna oder Lulu nimmt dir da schon die meisten Möglichkeiten.\n\n5. Kata ist wie gesagt wirklich recht stark im Moment. Die anderen sind leider in einem eher schlechten Spot. Assassins skalieren halt leider stark mit der Dummheit der Gegner. Auf Bronze ist zed noch immer gefürchtet. Auf plat+ wird es da schon schwerer. \n\nInsgesamt gibt es einfach im Moment zu viele Defensivtools (nicht nur stopwatch, die man sogar aggressiv nutzen kann) und zu wenig gute Offensive Antworten darauf (Runen), deshalb gehen die Spiele aktuell auch so lange.","replies":[]}]}]}]},{"poster":"Pure Cynicism","date":"2018-02-08T21:32:40.254+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=l Mugetsu l,realm=EUW,application-id=KYnfKGf0,discussion-id=nR8kGilE,comment-id=,timestamp=2018-02-08T21:09:41.341+0000)\n>\n\n> 3 Hier ist das Limit dann aber auch echt erreicht , es kann nicht sein das man gegen Tanks egal zu welchem Zeitpunkt ob Early Late Mid Game Keine Chance hat, es geht nicht egal ob man Botrk Lord Dominiks oder was auch immer man gegen HP oder % baut hat , man hat einfach keine Chance!\n\nAllein das hier ist schon komplett falsch. Ich habe zB gestern mit Tristana Amumu, Nautilus und Gnar komplett weggeschmolzen, dabei hatte ich noch nicht mal Lord Dominiks.","replies":[]},{"poster":"Anikiisama","date":"2018-02-08T23:25:51.789+0000","up_votes":2,"down_votes":4,"body":"das derzeitige League of Legends ist eigentlich wie immer :-D\n\ntoxisch und unbalanced :-D","replies":[{"poster":"Draven Greyjoy","date":"2018-02-09T10:45:17.438+0000","up_votes":2,"down_votes":0,"body":"Dem ist nichts hinzuzufügen!","replies":[]}]}]}