{"poster":"Acadiaum","date":"2015-05-30T21:42:46.468+0000","title":"Talon wrecks Ekko","subforum":"Tips & Tricks","up_votes":2,"down_votes":1,"body":"I&#039;ve played Ekko on PBE tons of games and when I couldn&#039;t get him, I picked Talon. \r\n\r\nTalon can burst Ekko down before he can ult away, and if he does manage to get away your ult is on a way shorter CD than Ekkos. \r\n\r\nJust take care if he has hourglass up, Watch out for the W+Hourglass combo and you&#039;ll be fine.","replies":[{"poster":"Manchufanchu","date":"2015-05-30T22:10:41.969+0000","up_votes":2,"down_votes":0,"body":"iv played yi vs ekko in mid and i won handly i pushed both mid turrets by 15 and was reking him even with all of his kit .... You can say what u want Yi isnt just Q but i still whiped ekko handly","replies":[]},{"poster":"Red9For LEON2","date":"2015-06-02T19:33:24.293+0000","up_votes":1,"down_votes":0,"body":"Beat the pants off ekko with AP Nasus. Ekko is cake to beat with almost any champ so long as you do 3 simple things. \n\n1. Dodge his w. Its very easy to do, and even easier if you have a higher mobility champ. Its what everyone is having a hard time with and one of the reasons ekko is \"OP\" at the moment. As soon as people learn his tell, his winrate is going to drop.\n\n2. Don't chase him. His ult relies on YOU being stupid for it to do damage. If you don't chase him, it will be incredibly hard for him to land the damage portion, though the health regen is still a factor. \n\n3. Don't stay in melee range for longer than 4 seconds. For the same reason as above, keeping all your skirmishes under 4 seconds will mitigate half his damage. His poke isn't very good and most of his other moves require you to sit there and trade with him for a few. Don't give him the opportunity. Play the assassin and end it early, or play a poke champ and keep your distance. Either way, he's not bad to lane against.","replies":[]},{"poster":"Genuwhine","date":"2015-05-30T21:43:56.524+0000","up_votes":1,"down_votes":0,"body":"so does annie, or any mid you can harass and burst with.","replies":[{"poster":"Acadiaum","date":"2015-05-30T21:46:43.532+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Genuwhine,realm=NA,application-id=WEuoGbmp,discussion-id=OsKlrQ1t,comment-id=0000,timestamp=2015-05-30T21:43:56.524+0000)\n>\n> so does annie, or any mid you can harass and burst with.\n\nSo many people complaining I wanted to share who I use to crap on Ekko, Like you said anyone who can burst him before he ult away. Ekko is super squishy.","replies":[{"poster":"Genuwhine","date":"2015-05-30T21:55:03.048+0000","up_votes":1,"down_votes":0,"body":"Yeah its funny that all these players cant play against him because they dont know how. Plus its not like they know how to use ekko to his full potential let alone what to build and how to combo. When they see a good ekko they can complain but if you have any idea how to lane it's easy when you are on bursty champions, i think syndra would also do well against him.","replies":[{"poster":"Mars vzx","date":"2015-06-02T07:43:19.546+0000","up_votes":1,"down_votes":0,"body":"So true.","replies":[]}]}]}]},{"poster":"ayNigerianPrince","date":"2015-05-30T23:32:18.017+0000","up_votes":1,"down_votes":0,"body":"I was thinking about posting something about this. My first game against Ekko I played talon, and wrecked him pretty hard. \nFun shit","replies":[]},{"poster":"Puri Puri Taric","date":"2015-05-30T23:20:07.622+0000","up_votes":1,"down_votes":0,"body":"so does taric mad ?","replies":[]}]}