{"poster":"Samo","date":"2018-07-29T09:45:57.321+0000","title":"Team Dragon Community Recruitment","subforum":"Team Recruitment","up_votes":2,"down_votes":1,"body":"Team Dragon is a community made for streamers and content creators giving them a platform to share and grow their brands aswell as help support other community members with similar goals! \n\nwe currently have over 500 members in the discord at the moment and steadily rising. \n\nThe staff over at team dragon have decided to branch out into game categories so each &quot;popular&quot; game will have its own dedicated admins and members\nand a part of that is reaching out to the league of legends community starting in the oceanic region\n\nSo if you are a league player,streamer or just want to watch and support the oceanic scene feel free to join\nhere you can find the discord link https://discord.gg/zEmUms6\n\nThanks! ~ sjs","replies":[{"poster":"TTL Rem","date":"2018-07-30T00:09:06.658+0000","up_votes":2,"down_votes":0,"body":"If you find you cannot use the link, try this instead: https://discord.gg/zEmUms6\n\nWhat happened was that they put the link inside brackets, but didn't put a space between the end of the link and the final bracket, hence adding the close-bracket into the link (which isn't meant to be there).\n\nHope this helps :)\n{{sticker:sg-ahri-2}}","replies":[{"poster":"Samo","date":"2018-07-30T01:01:44.036+0000","up_votes":2,"down_votes":0,"body":"thanks for pointing that out! i appreciate it {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"msi mouse pker","date":"2018-07-29T22:51:33.167+0000","up_votes":2,"down_votes":0,"body":"am i the only one that the discord link dose not work for ??","replies":[{"poster":"TTL Rem","date":"2018-07-30T00:06:59.730+0000","up_votes":2,"down_votes":0,"body":"This link should work: https://discord.gg/zEmUms6\n\nWhat happened was that they put the link inside brackets, but didn't put a space between the end of the link and the final bracket, so the close-bracket was added into the link.","replies":[]}]}]}