{"poster":"LEOSCUROX","date":"2017-01-02T11:35:12.134+0000","title":"¿Esta realmente aatrox fuera de meta?","subforum":"Charlas Generales","up_votes":0,"down_votes":2,"body":"Bueno tenía una  pregunta, eh estado usando aatrox tanto en top como en jg y me parece un champ bastante bueno. Pero me dijeron y le&iacute; en muchos lugares que es un champ nerfeado fuera de meta, quer&iacute;a preguntar si es realmente as&iacute; y por qu&eacute;?, ya que me parece que es un buen duelista 1 vs 1 principalmente en batallas largas y en tf tiene buen potencial ya que puede tirarse en el medio de todos tirar R y b&aacute;sicos con hydra dando buen da&ntilde;o y resistiendo bastante bien dado al robo y reviviendo con la pasiva/&Aacute;ngel guardi&aacute;n y asi logra bajarse como m&iacute;nimo al adc rival.","replies":[{"poster":"SnowHorse","date":"2017-01-02T11:58:27.393+0000","up_votes":2,"down_votes":0,"body":"por un lado como otros ya dijeron, tenes muchos campeones que cumplen mejor su rol, ya sea en linea o jg\n\npor otro lado aatrox tiene uno de esos kit que es difícil de balancear, o lo dejas roto o lo dejas tibio, y si se resaga no tiene buena recuperación hoy por hoy","replies":[{"poster":"LEOSCUROX","date":"2017-01-02T12:12:56.296+0000","up_votes":1,"down_votes":0,"body":"Claro, también quería preguntar que campeones cumplen mejor su rol, ya que aatrox tiene buen cc y buen split push además de mucho sustain, creo que lo malo para el son los tardes cortos y claramente el ignite","replies":[{"poster":"SnowHorse","date":"2017-01-02T12:33:26.610+0000","up_votes":1,"down_votes":0,"body":"{{champion:164}} {{champion:114}} {{champion:23}} {{champion:107}} {{champion:64}} {{champion:121}} {{champion:254}}\n\nesos por ponerte algunos nomas","replies":[{"poster":"LEOSCUROX","date":"2017-01-06T08:11:02.081+0000","up_votes":1,"down_votes":0,"body":"Claro pero esos son duelistas/asesinos aatrox tiene más cc con la q para irrumpir en una tf (obviamente si sabe como entrar en esta) y puede tirarse mas suicida ya que tiene buen daño y si lo focusean puede recuperar vida lo cual hace que lo tarden en matar ( dejando tiempo para que el team ataque ) y aunque muera tiene la pasiva, a mi parecer aatrox sirve tanto como duelista e splitpush como para ayudar en tf's cosa que entre esos sólo veo a camille ( el resto deletean a 1 y se van o no tienen tanto splitpush como aatrox )  puede que me equivoqué y por eso planteó mi pensamiento para saber si estoy equivocado y así me puedan corregir","replies":[]},{"poster":"9081913DEL1","date":"2017-01-02T13:04:16.969+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SnowHorse84,realm=LAS,application-id=v7qsfXsE,discussion-id=FWfqEWVq,comment-id=000200000000,timestamp=2017-01-02T12:33:26.610+0000)\n>\n> {{champion:164}} {{champion:114}} {{champion:23}} {{champion:107}} {{champion:64}} {{champion:121}} {{champion:254}}\n> \n> esos por ponerte algunos nomas\n\ntryndamere justamente sufre de lo mismo que atrox XD.\nTengan el cuenta que el meta no se enfoca de la misma manera que una partida estandar.\n\nSaludos.","replies":[{"poster":"SnowHorse","date":"2017-01-03T08:49:11.729+0000","up_votes":1,"down_votes":0,"body":"si, se me escapo ese, lo puse por parecido nomas pero no es lo mejorcito, gracias","replies":[]}]}]}]}]},{"poster":"Zoboo","date":"2017-01-02T11:48:30.475+0000","up_votes":2,"down_votes":0,"body":"En top no rinde tanto como lo es en jungla, si lo sabes usar podes tener buenas partidas, el tema es que hay campeones mejores en este momento para su rol.","replies":[]},{"poster":"Kokoro Chacarero","date":"2017-01-02T20:05:01.890+0000","up_votes":1,"down_votes":0,"body":"El único one trick pony Atrox entre NA, EU y KR está en challenger y lo juega jungla.\n\nDejo video para alguno que le interese, lo probe y esta muy bueno.\n\nhttps://www.youtube.com/watch?v=bir4VGivXR4","replies":[]},{"poster":"Flánn","date":"2017-01-02T18:42:19.458+0000","up_votes":1,"down_votes":0,"body":"Hay muchos campeones que cumplen mejor su rol sea TOP o JG ademas de que el ruidito de mierda que hace la W tiltea a cualquiera","replies":[]},{"poster":"saikou29","date":"2017-01-02T17:33:25.146+0000","up_votes":1,"down_votes":0,"body":"Tengo un amigo main aatrox 30k o más  ya con él, yo siempre le pregunto porque juega tanto  con ese champ siendo que hay otros mejores y su respuesta  fue que le encanta  su pasiva jaja\nConversando llegamos a un punto que aatrox si no se saca una o dps kills tempranas  o tiene un farmeo decente no servirá  luego, si se hace tanque  no pega nada, si se hace ap no aprovecha tanto su velocidad  de ataque, entonces  una build mixta entre daño  ad, velocidad  de ataque, ap y tanque lo dejan bien. PERO de llegar a fedearse explota a cualquier champ a punto de terminar una vez  18/3 (porque le hice un campamento en la top siendo yo su jg)\nEs un campeón  difícil en ese sentido puede explotar como no servir para nada","replies":[]},{"poster":"wattefak","date":"2017-01-02T12:04:36.960+0000","up_votes":1,"down_votes":0,"body":"Que este fuera del meta no significa que no rinda, por los nerfeos también dejan fuera a azir y kalista, o por builds no convencionales tienes a yi offtank, akali top, mf supp, etc lo que se te ocurra; todos pueden ser muy poderosos cuando alguien los sabe usar. Basicamente si \"no tienes manos\" el meta ayuda bastante","replies":[{"poster":"LEOSCUROX","date":"2017-01-02T12:10:19.382+0000","up_votes":1,"down_votes":0,"body":"El tema es que hay campeones que fuera de meta tienen una desventaja bastante clara como es el caso de mordekaiser, obvio que con manos cualquier campeón puede ser bueno pero hay casos donde te tocan tanto equipos malos como trolls o afk y no es tanto que te vaya bien si no mas lograr carrear","replies":[{"poster":"NoxDragon26","date":"2017-01-02T15:43:02.769+0000","up_votes":1,"down_votes":0,"body":"Mordekaiser es otra historia. Nadie lo juega porque tiene archivados mas de 200 bugs, haciendolo literalmente injugable.","replies":[]}]}]},{"poster":"NoxDragon26","date":"2017-01-02T15:41:52.896+0000","up_votes":1,"down_votes":0,"body":"Si, esta fuera de meta y creo que esa es la mejor ventaja que tiene. Porque nadie sabe que hacer contra el. Si te gusta el champion y te sentis comodo jugandolo, dale para adelante.","replies":[]},{"poster":"9081913DEL1","date":"2017-01-02T11:38:51.140+0000","up_votes":1,"down_votes":0,"body":"Estaba fuera en la temporada de adcs, ten en cuenta que luego de su salto mas alla del resto es tan kiteable como cualqueira. \nYo jamas eh tenido una mala partida con el, no me gusta el champ, pero no es malo.\n\nSaludos.","replies":[{"poster":"LEOSCUROX","date":"2017-01-02T12:14:45.965+0000","up_votes":1,"down_votes":0,"body":"Gracias por el dato, lo voy a tener en cuenta para percatarme más de los adc  \nSaludos igualmente","replies":[]}]}]}