{"poster":"Rewt","date":"2019-12-31T00:08:27.840+0000","title":"My 1 problem with Yasuo Wind Wall","subforum":"Gameplay","up_votes":66,"down_votes":3,"body":"because it comes out from him. you can have skills that are on top of him, but because they still have 1 pixel left to go it gets blocked.\r\n\r\nAll I want is for the Windwall to appear in front of him. Not from him. So if you get a skill shot close enough to him without him reacting, he can't block it at the last possible pixel.","replies":[{"poster":"Caitlyn FTW","date":"2019-12-31T01:35:12.582+0000","up_votes":35,"down_votes":0,"body":"Lore wise, Yasuo summons his wind wall from his rectum as he accumulates and condenses the spirits of the wind which makes compressed air that comes out of his anus to his sword. Changing how his wind wall works, would make the lore false.","replies":[{"poster":"Ranmiaku","date":"2019-12-31T01:47:16.464+0000","up_votes":15,"down_votes":0,"body":"> [{quoted}](name=Three One Four,realm=EUW,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=0002,timestamp=2019-12-31T01:35:12.582+0000)\n>\n> Lore wise, Yasuo summon his wind wall from his rectum as he accumulates and condenses the spirit of the wind which makes compressed air that comes out of his anus to his sword. Changing how his wind wall works, would make the lore false.\n\nso what you're saying is riot needs to introduce a butt plug item into the game so we can counter windwall? {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Caitlyn FTW","date":"2019-12-31T01:52:43.828+0000","up_votes":7,"down_votes":0,"body":"that's wild","replies":[{"poster":"Ranmiaku","date":"2019-12-31T01:55:59.877+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Three One Four,realm=EUW,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=000200000000,timestamp=2019-12-31T01:52:43.828+0000)\n>\n> that's wild\n\nwhere do i apply for a riot position, going to make league great again lmao","replies":[{"poster":"Caitlyn FTW","date":"2019-12-31T02:02:59.984+0000","up_votes":3,"down_votes":0,"body":"Cali I think","replies":[]}]}]}]},{"poster":"zero356","date":"2019-12-31T06:50:13.665+0000","up_votes":2,"down_votes":0,"body":"If you start following lore logic, Ekko ult doesn't heal himself\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Caitlyn FTW","date":"2019-12-31T20:20:56.455+0000","up_votes":3,"down_votes":0,"body":"You really think I was using any logic? This is just satire.","replies":[]}]},{"poster":"BläzeD","date":"2019-12-31T18:28:18.419+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Three One Four,realm=EUW,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=0002,timestamp=2019-12-31T01:35:12.582+0000)\n>\n> Lore wise, Yasuo summons his wind wall from his rectum as he accumulates and condenses the spirits of the wind which makes compressed air that comes out of his anus to his sword. Changing how his wind wall works, would make the lore false.\n\npewwwwwwwwwwwwwwwwwwwwwwwwwweww the smell","replies":[]}]},{"poster":"Weiss Guertena","date":"2019-12-31T14:36:07.417+0000","up_votes":16,"down_votes":0,"body":"Yasuo's wall is the only ability in the game that you can cast in a completely wrong direction and still reap full benefits from it. I've seen trash Yasuo's panic-windwall behind them and still block what they intended to block. Name me one other skillshot that you can literally miss by 180 degrees mid-fight and get rewarded for it.","replies":[{"poster":"GonahtanuGepardi","date":"2019-12-31T18:20:42.511+0000","up_votes":1,"down_votes":0,"body":"Heimer rockets and qiyana's r are the first ones that come to mind. IIRC maokai's q works like that too but i couldn't test that one since i don't own him on this account. Riven used to have that in her r but it was removed.","replies":[{"poster":"Rewt","date":"2019-12-31T18:55:02.523+0000","up_votes":2,"down_votes":0,"body":"Dont know about the first 2, but Maokai has a small AOE around him and then a small line in the skill shot direction.","replies":[{"poster":"Verxint","date":"2020-01-01T00:44:18.632+0000","up_votes":2,"down_votes":0,"body":"Not to mention Maokai Q is supposed to be a spammy, medium impact spell. Windwall is supposed to be a clutch, big play, high impact spell. Medium and low impact spells can be forgiving. High impact spells should not.","replies":[]}]}]}]},{"poster":"makkii","date":"2019-12-31T02:27:59.485+0000","up_votes":9,"down_votes":0,"body":"its even worse for gragas mains, if u throw a barrel and its reached the end spot but is still spinning it gets fizzed out by windwall.","replies":[]},{"poster":"Small Boobs Ahri","date":"2019-12-31T12:31:11.345+0000","up_votes":10,"down_votes":1,"body":"My 1 problem with Yasuo Wind Wall :\n\nI'm Ahri main and Yasuo can block my : AA Q W E and R \nit's a bit boring Riot (:","replies":[{"poster":"Śhunpo","date":"2019-12-31T12:34:10.707+0000","up_votes":5,"down_votes":2,"body":"Y'know, this is one of the few times I actually agree with an Ahri player. The matchup is unnecessarily toxic thanks to Windwall.","replies":[{"poster":"Ahri Baka","date":"2019-12-31T12:41:54.947+0000","up_votes":3,"down_votes":1,"body":"Dude , as someone who mains Ahri/Lux/Neeko , when it comes to Lux he legit even BLOCKS HER FUC@@@ W , not a damage ability , a freakin shield and he blocks it , my only pick against him is Neeko since he can't block her R ( but still dashes out of it anyway )","replies":[{"poster":"Billybaroo2314","date":"2019-12-31T16:29:20.915+0000","up_votes":4,"down_votes":0,"body":"This is true but sarcastic (defending you, not winwall) but at least it doesn't block Lux R.  Takes a beam of light to go through it.  Blocks Zyra roots, an ability that is suppose to go underground,  btw.","replies":[]}]}]},{"poster":"5050BS","date":"2019-12-31T16:52:07.005+0000","up_votes":2,"down_votes":0,"body":"I just think its insainly stupid that WW blocks Nami's Ult.  A HUGE WAVE OF WATER","replies":[{"poster":"T2K Baka","date":"2020-01-01T03:46:35.120+0000","up_votes":1,"down_votes":0,"body":"have you seen the size of the windwall in the video. That sht is HUGE. But I hate windwall with a passion, being able to block Kat's whole kit with one ability is stupid","replies":[]}]},{"poster":"CourtWizardAhri","date":"2019-12-31T16:02:06.773+0000","up_votes":2,"down_votes":1,"body":"uh to be honest i've played against yasuo so much his  windwall is really easy to bait out, it has quite the cool down so if you can bait it out and not get camped chances are, you're gonna be able to buy your damage items first. However I still agree with original OP, I was 5/0 as varus and yasuo still managed to solo kill me it makes no sense.","replies":[]}]},{"poster":"The thigh guy","date":"2019-12-31T03:39:07.537+0000","up_votes":13,"down_votes":5,"body":"But then yasuo would need a brain to be played.","replies":[{"poster":"Toxicate13","date":"2019-12-31T07:45:56.406+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=The thigh guy,realm=NA,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=0009,timestamp=2019-12-31T03:39:07.537+0000)\n>\n> But then yasuo would need a brain to be played.\n\nNo he still wouldn't lol","replies":[]}]},{"poster":"DiveAlive","date":"2019-12-31T02:01:36.245+0000","up_votes":7,"down_votes":0,"body":"yas wind wall shouldn't block \"lobbed\" abilities","replies":[]},{"poster":"Śhunpo","date":"2019-12-31T12:32:38.260+0000","up_votes":8,"down_votes":1,"body":"Man, you haven't seen how Windwall works with {{champion:55}} daggers. It's the single worst and most painful interaction in the entire game. Hands down.\n\nYasuo can just block Kat daggers AFTER they've fallen onto the ground because apparently they count as projectiles when they're sitting on the ground. \nOh, and you know when they're falling from the sky? Yeah, he can block those too.\n\nFor what __should__ be a skill matchup is turned into a broken shitfest thanks to Windwall's atrocious coding with what it considers a \"projectile\".","replies":[]},{"poster":"Yaskamasandwich","date":"2019-12-31T17:49:57.322+0000","up_votes":4,"down_votes":0,"body":"The real problem of wind wall ... it existing on a champion that deals damage, or doesn't have a price for it. There was a reason abilities like that go on support champions, because a powerful ability like that would come at a price. Instead it's given to someone that can deal damage, is hyper mobile, has a shield that is built up from said mobility, and now has a TEAM denial button. It's not shocking this abomination came from that hack of a champion designer CertainlyT.\n\nNot that it matters anymore, champions like Pyke, Senna, and mage supports throw the balance of support role out the window.","replies":[]},{"poster":"Vlada Cut","date":"2019-12-31T01:19:36.406+0000","up_votes":4,"down_votes":0,"body":"Good quality of life change but I think that should be considered in a full Yasuo VGU so other spells can be tuned equally the same.","replies":[]},{"poster":"Ranmiaku","date":"2019-12-31T01:23:26.654+0000","up_votes":5,"down_votes":1,"body":"i think they should change windwall so after yasuo casts it, if he makes contact with the windwall, he just gets erased from the game... permanently... wooo everybody wins :P but jokes aside i agree with your idea 100%","replies":[]},{"poster":"Catastroclysm","date":"2019-12-31T21:00:14.900+0000","up_votes":2,"down_votes":8,"body":"Yes delete this mechanic that is intended and makes the champ not complete garbage, but please keep in other champs ability to completely negate cc by timing their dashes even slightly well (notably trist, and ezreal). Also continue to let j4 camille and graves dash WHILE rooted. Those mechanics are fun bc the champions are easy enough for me to play well :))) \n\nYou a clown.","replies":[{"poster":"Ranmiaku","date":"2019-12-31T21:02:54.031+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Catastroclysm,realm=NA,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=0017,timestamp=2019-12-31T21:00:14.900+0000)\n>\n> Yes delete this mechanic that is intended and makes the champ not complete garbage, but please keep in other champs ability to completely negate cc by timing their dashes even slightly well (notably trist, and ezreal). Also continue to let j4 camille and graves dash WHILE rooted. Those mechanics are fun bc the champions are easy enough for me to play well :))) \n> \n> You a clown.\n\nDING DING DING!, we've clearly found a yasuo player lmao","replies":[{"poster":"Catastroclysm","date":"2019-12-31T21:20:58.370+0000","up_votes":2,"down_votes":3,"body":"I play a lot of champs, Yasuo being one of them. I just don't have \"me hate katana man\" monkey brain like boards seem to.\n\nHate something reasonable like vlad ryze or kaisa. -.-","replies":[{"poster":"Ranmiaku","date":"2019-12-31T21:26:56.990+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Catastroclysm,realm=NA,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=001700000000,timestamp=2019-12-31T21:20:58.370+0000)\n>\n> I play a lot of champs, Yasuo being one of them. I just don't have \"me hate katana man\" monkey brain like boards seem to.\n> \n> Hate something reasonable like vlad ryze or kaisa. -.-\n\nYasuo being the main one you mean, and no you don't, but instead you just have the plain old monkey brain..  (no offense? :P), but i also hate vlad ryze and kai'sa if it makes you feel any better, they're just nowhere's near as annoying or unfair as yasuo is.","replies":[{"poster":"Catastroclysm","date":"2019-12-31T23:09:41.250+0000","up_votes":2,"down_votes":2,"body":"Nope. By far and away my most played champ is Lux, who is hard countered by Yasuo, and I have never once disliked him. You know why? Because he is objectively underpowered, and not a problem. He also has counter play, so he's not even unfun to play against. Those other champions I mentioned are objectively overpowered, and have been for YEARS, while also offering extremely little counterplay/interactivity. :) \n\nHonestly the only thing Yasuo is too good at is farming easily, and since no one seems to complain about that, and hes weak enough in other areas, I doubt it'll be changed.","replies":[{"poster":"Ranmiaku","date":"2019-12-31T23:29:11.610+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Catastroclysm,realm=NA,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=00170000000000000000,timestamp=2019-12-31T23:09:41.250+0000)\n>\n> Nope. By far and away my most played champ is Lux, who is hard countered by Yasuo, and I have never once disliked him. You know why? Because he is objectively underpowered, and not a problem. He also has counter play, so he's not even unfun to play against. Those other champions I mentioned are objectively overpowered, and have been for YEARS, while also offering extremely little counterplay/interactivity. :) \n> \n> Honestly the only thing Yasuo is too good at is farming easily, and since no one seems to complain about that, and hes weak enough in other areas, I doubt it'll be changed.\n\nwell my bad i guess, butt i disagree that yasuo is underpowered in any way whatsoever, because that's just not true at all. and also when a champion is one of your most played champs you tend to forget that they're busted, or just dont like to admit it anymore, and i've never said he has no counterplay once, all champs have forms of counterplay, but he is very unfun to play against.. and his kit is definitely overloaded to the point where its hard to punish a half decent yasuo at all.. and vlad and ryze are actually super easy lanes if you know what you're doing or pick a decent champ into them, and i agree with you about kai'sa, overloaded kit also and she takes very little skill to play at a decent level,  the waveclear is the least annoying part about yasuo tbh but its still insane..\n\nAnyways we all know he's probably not going to get changed anytime soon regardless (untill riot come out with another new skin) and then they will probably try to buff him..","replies":[{"poster":"Catastroclysm","date":"2020-01-02T04:46:45.057+0000","up_votes":3,"down_votes":0,"body":"You can disagree. It's an objective fact though. He is underperforming in high elos despite being a mechanically intensive champion. He should perform better there. Instead hes a pubstomper because he can be pretty strong against people who dont know how to play against him.\n\nRyze and Vlad aren't overbearing early depending on matchup, but they ARE faaar too safe. They'll never really hard lose a matchup unless they're playing really poorly, and then they out scale everything in the game. They're both also gank resistant, and CAN absolutely stomp certain matchups too. Ever play Malph into Vlad?\n\nWe agree on kaisa. Shit is dumb across all elos, and as you said is hella easy.\n\nAlso I shoulda been more specific. I didnt mean his waveclear was too much, I specifically mean how easy it is to last hit creeps with him. Similar to Ezreal or Karthus. Having a spammable low/no cost ability AND a good auto means you shouldn't really ever miss cs. Plus means he can flawlessly farm under tower from level 1. It's very overlooked imo.","replies":[{"poster":"Ranmiaku","date":"2020-01-02T05:03:20.144+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Catastroclysm,realm=NA,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=0017000000000000000000000000,timestamp=2020-01-02T04:46:45.057+0000)\n>\n> You can disagree. It's an objective fact though. He is underperforming in high elos despite being a mechanically intensive champion. He should perform better there. Instead hes a pubstomper because he can be pretty strong against people who dont know how to play against him.\n> \n> Ryze and Vlad aren't overbearing early depending on matchup, but they ARE faaar too safe. They'll never really hard lose a matchup unless they're playing really poorly, and then they out scale everything in the game. They're both also gank resistant, and CAN absolutely stomp certain matchups too. Ever play Malph into Vlad?\n> \n> We agree on kaisa. Shit is dumb across all elos, and as you said is hella easy.\n> \n> Also I shoulda been more specific. I didnt mean his waveclear was too much, I specifically mean how easy it is to last hit creeps with him. Similar to Ezreal or Karthus. Having a spammable low/no cost ability AND a good auto means you shouldn't really ever miss cs. Plus means he can flawlessly farm under tower from level 1. It's very overlooked imo.\n\nI guess i can't really speak for how he is in high elo, and yeah i completely agree with everything else you're saying, especially with how safe vlad is, especially vlad mid.. hes damn near impossible to kill unless he realllyy fucks up, but nahh i have never played malph really, i find that champion wayyy too boring.\n\nand yeah kai'sa definitely need something done to her, lower the damage/safety or do something to make her a little more difficult however that may be done.\n\nbut ohh my bad i misunderstood that, even though he does also have too much free waveclear haha, but again, you're spot on with that, and easy last hitting like that is definitely overlooked (guilty) on some champs getting shoved in early really fucks you up, although i dont see a yasuo shoved under his turret too often.","replies":[{"poster":"Catastroclysm","date":"2020-01-02T22:16:13.602+0000","up_votes":2,"down_votes":0,"body":"Vlad is by far my most hated champ haha. Funnily enough though, he's one of the reasons I picked up Yasuo. I feel like I can actually do something to him. On Lux it's just farm and get out scaled sickeningly hard, or try and poke him while he sustains it and you go oom. Hell even if you root him he just pools. >.>\n\nI think a big issue with Kaisas difficulty is her Q. I don't really have a solution to fix it either, but have such a strong ability literally just be 'fire and forget' is bonkers. Also her E is basically just a safer empowered Vayne Q. The massive shield and ability to build Zhonya doesn't help either. She likely just needs a full rework, or massively reduced numbers so shes less dominant. I still find it funny how she was announced as a 'risky divey adc' and ended up being the safest one in the game (barring maybe ezreal)\n\nYasuo is really easy to gank, so often times he wants to let the opponent push him in. Ideally you'd freeze in front of your tower, but occasionally it ends up under your tower. This should normally be a bad thing for most mids, but ends up being fine since he farms so well.\n\nHe's also really quick at clearing raptor and wolf camps so he can snowball even harder if he's ahead. I'm not sure lowering his Q or E damage to minions or monsters would really be a good idea. But it's a suggestion I never see, and I think it would hurt his reliability getting to his famous '0/10 powerspike'.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Skýcrow","date":"2020-01-01T02:33:55.089+0000","up_votes":3,"down_votes":0,"body":"I'm also a Ahri main and pretty High in Elo up there. I usually do not have a problem with yasuo in general nor do i think he is overpowered as a champion. However i do know that he is ultra annoying and i would honestly change it. 1. single thing that i probably hate the most on yasuo is, that he can windwall ur autoattack. Usually you want to let him have prio early game, also u want to save mana which means u wanna towerfarm, the yasuo player however very often smashes his windwall infront of the canon minion, which makes u loose the canon minion even if u didn't even fail the last hit and in my opinion it is actually extremely toxic. I also believe high Elo players ban him exactly mostly of the time because of that one Reason. So yeah if i would work at riot i would make a few suggestions for a mini rework.\n\na. when his windwall does not block a spell, it gets significantly higher Cooldown, because a yasuo player should not prevent u from last hitting in such a non counterplayed way.\nb. Autoattacks go through his windwall and smth else get's buffed in return. \n\nI recommend A since it would be way easier to balance also it would finally remove a very toxic mechanic which in all honestly just sucks and tilts u off the earth. **Especially in High elo every single minion that u can get counts, yasuo being able to do this, probably is one of the bigger reasons why people ban him regardless if he sucks or is strong as a whole. :).**\n\n(btw im not sure why riot can't figure this out by themself) (also yes the fact that yasuo can basically shot his windwall backwards and it still blocks ur spell is a big yikes)","replies":[]},{"poster":"Hay5eed","date":"2019-12-31T20:13:25.689+0000","up_votes":3,"down_votes":0,"body":"Yasou's windwall should appear one swords length away from his body","replies":[]},{"poster":"voidscaler","date":"2019-12-31T16:21:50.274+0000","up_votes":3,"down_votes":2,"body":"Imo windwall is a cancerous ability because it is so all or nothing\nAny projectile champion is just instantly negated by it for a long period of time, but not projectile champions don't give a shit\nImo it should be changed in 2 ways\n1 add a knockback or small shield on use to it, allowing it to be at least partially usefull against non projectile champions\n2 massively lower it's duration\nIt should be used in the same way fioras parry is, a snap reaction to the big incoming damage, but that's it, at the moment it just sits there forever blocking everything, it should it do that, it should last at most 2 seconds AT MOST","replies":[{"poster":"Billybaroo2314","date":"2019-12-31T16:30:45.326+0000","up_votes":3,"down_votes":0,"body":"Just NO!  He has a shield already, stupid mobility, stupid damage, if anything WW cooldown should be longer as strong as it is.  And something useful against melee champs, so......you want him banned more or so OP he ruins the game with those changes.  ","replies":[]}]},{"poster":"Bugzspray","date":"2019-12-31T18:17:16.733+0000","up_votes":2,"down_votes":0,"body":"You know what else WW counters?  The second cast of Urgot's ult. You stick a giant \"drill\" (or whatever it is) on him, and you are literally dragging him with chains, but nope the wall breaks them...\n\n:(","replies":[]},{"poster":"FCJAAAAGOOOO","date":"2019-12-31T02:43:40.527+0000","up_votes":2,"down_votes":0,"body":"I want Yasuo's windwall to constantly move out like it won't sit directly in front of/on top of him forever.  \n\nOh, and for it to not last forever.","replies":[]},{"poster":"Kazekiba","date":"2019-12-31T02:01:24.979+0000","up_votes":2,"down_votes":0,"body":"Worse the wall spawns slightly BEHIND Yasuo. \nExtremely fast projectiles can be blocked by casting windwall backwards so that it hits the wall before entering the hitbox. I've seen SMDR do this.","replies":[]},{"poster":"KFCeytron","date":"2019-12-31T02:25:14.236+0000","up_votes":2,"down_votes":21,"body":"His W casts 400 units away from him and then drifts another 50 for a total of 450 units. Having his W originate from him doesn't just give him those extra few milliseconds to react; it allows him to use it against projectiles that _originate_ from closer than 450 units away. Changing this would not only be a weird disincentive for a melee champion to be in melee, but also remove the skill expression of using that fraction of a second of wall movement. Karthus and Anivia can cast their walls anywhere within range, and no one says \"Anivia shouldn't be able to block champs who are already on top of her. If you get close enough to her without her reacting, she shouldn't be able to block you at the last possible pixel.\" Even Cass, a ranged mage, got her W changed to remove the minimum cast distance restriction. But then, none of those champs are hated as much as Yasuo, are they... ¯\\\\\\_(ツ)\\_/¯","replies":[{"poster":"makkii","date":"2019-12-31T02:36:06.062+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=0005,timestamp=2019-12-31T02:25:14.236+0000)\n>\n> His W casts 400 units away from him and then drifts another 50 for a total of 450 units. Having his W originate from him doesn't just give him those extra few milliseconds to react; it allows him to use it against projectiles that _originate_ from closer than 450 units away. Changing this would not only be a weird disincentive for a melee champion to be in melee, but also remove the skill expression of using that fraction of a second of wall movement. Karthus and Anivia can cast their walls anywhere within range, and no one says \"Anivia shouldn't be able to block champs who are already on top of her. If you get close enough to her without her reacting, she shouldn't be able to block you at the last possible pixel.\" Even Cass, a ranged mage, got her W changed to remove the minimum cast distance restriction. But then, none of those champs are hated as much as Yasuo, are they... ¯\\\\\\_(ツ)\\_/¯\n\nthe thing is that none of those other wall like abilities have a power that matches that of an ultimate. in certain cases a well placed windwall can deflect upwards of thousands of points worth of damage. Even the ability to deter people from shooting projectiles for almost four seconds is in itself very powerful.\n\nanother thing is that using an ability like windwall, and being able to basically use it reactively, as opposed to proactively, based on the way it functions is like the  exact opposite of skill expressive.","replies":[{"poster":"KFCeytron","date":"2019-12-31T03:24:20.936+0000","up_votes":1,"down_votes":12,"body":"> [{quoted}](name=makkii,realm=NA,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=00050000,timestamp=2019-12-31T02:36:06.062+0000)\n>\n> the thing is that none of those other wall like abilities have a power that matches that of an ultimate. in certain cases a well placed windwall can deflect upwards of thousands of points worth of damage. Even the ability to deter people from shooting projectiles for almost four seconds is in itself very powerful.\n\nHang on, I thought your one problem with Yasuo W was that he can use it on projectiles that are near him, not all this other stuff. Hmmmmmm. And if the problem is that it can deflect or deter damage, why not make this complaint about Tryn, Kayle, Fiora, Fizz, Bard, etc.? How very puzzling!\n\n> [{quoted}](name=makkii,realm=NA,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=00050000,timestamp=2019-12-31T02:36:06.062+0000)\n>\n> another thing is that using an ability like windwall, and being able to basically use it reactively, as opposed to proactively, based on the way it functions is like the  exact opposite of skill expressive.\n\nYou think building a wall and setting up camp rather than quickly reacting to stimuli is a better expression of skill? What skill would that be, exactly? The skill of not being an interactive gameplay element?\n\nHonestly, you had a (very small) chance of passing this off as a legit thread rather than a common anti-Yasuo rant, but you irreversibly ruined that when you used it as a springboard to launch into a bunch of other complaints after you specifically said you only had one. =\\","replies":[{"poster":"Bijeesny","date":"2019-12-31T14:30:22.617+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=000500000000,timestamp=2019-12-31T03:24:20.936+0000)\n>\n> Hang on, I thought your one problem with Yasuo W was that he can use it on projectiles that are near him, not all this other stuff. Hmmmmmm. And if the problem is that it can deflect or deter damage, why not make this complaint about Tryn, Kayle, Fiora, Fizz, Bard, etc.? How very puzzling!\n\nTrynda has that on his ult.\nKayle has that on her ult.\nFiora has that as a basic ability, except its much shorter than yasuo's windwall + it costs mana.\nFizz has that as a basic ability, except its much shorter than yasuo's windwall + it costs mana.\nBard has that on his ult.\n\nSee the problem? All those champs you named that has an ability similar to Yas's winwall is either an ult or a basic ability which costs mana and has much shorter duration.\n\nOn the other hand, Yas has a basic spell which has the power of an ult which has a bigger duration and costs NOTHING.\nThe only bs basic spell thats on par with the windwall that i can think off is Kayn's W, and even that has some restrictions.\n\nAnd thats why people wont make this complaint about other champs.","replies":[{"poster":"KFCeytron","date":"2019-12-31T16:44:41.879+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Bijeesny,realm=EUNE,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=0005000000000000,timestamp=2019-12-31T14:30:22.617+0000)\n>\n> Trynda has that on his ult.\n> Kayle has that on her ult.\n> Fiora has that as a basic ability, except its much shorter than yasuo's windwall + it costs mana.\n> Fizz has that as a basic ability, except its much shorter than yasuo's windwall + it costs mana.\n> Bard has that on his ult.\n> \n> See the problem? All those champs you named that has an ability similar to Yas's winwall is either an ult or a basic ability which costs mana and has much shorter duration.\n> \n> On the other hand, Yas has a basic spell which has the power of an ult which has a bigger duration and costs NOTHING.\n> The only bs basic spell thats on par with the windwall that i can think off is Kayn's W, and even that has some restrictions.\n> \n> And thats why people wont make this complaint about other champs.\n\nTryn's blocks all damage sources from killing him for 5 seconds, Kayle's blocks all damage from even harming the target, Fiora's blocks all damage and CC and includes hard CC if it blocked any, Fizz's has a much lower CD, Bard's prevents all damage and CC and can even work on turrets.\n\nAnd shifting the topic to whether it's an ult or basic ability is _yet another_ instance of moving the goalposts.\n\nAnd yes, people DO complain about those things, particularly Tryn's and Fizz's. Is this your first time on Boards?\n\nThis thread belongs on Rant.","replies":[{"poster":"Bijeesny","date":"2019-12-31T17:19:17.465+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=3ErqAdtq,discussion-id=Q0OYFX3j,comment-id=00050000000000000000,timestamp=2019-12-31T16:44:41.879+0000)\n>\n> Tryn's blocks all damage sources from killing him for 5 seconds, Kayle's blocks all damage from even harming the target, Fiora's blocks all damage and CC and includes hard CC if it blocked any, Fizz's has a much lower CD, Bard's prevents all damage and CC and can even work on turrets.\n\nSoooo what's the point of you just explaining spells from those champs? That doesnt change the fact that Yas's W, as a basic spell, is strong as hell. As strong as some champs ults.\n\n> And shifting the topic to whether it's an ult or basic ability is _yet another_ instance of moving the goalposts.\n\nThats not what i was saying lmao.\nmy point is that Yasuo has a basic spell thats as strong (similar) as some champ's ults. And for a spell that strong you would expect him to be weak in other areas. But hes not.","replies":[]}]},{"poster":"Rewt","date":"2019-12-31T18:58:49.722+0000","up_votes":1,"down_votes":0,"body":"which W lol. He has got 3 of them","replies":[]}]}]}]}]}]}