{"poster":"Call Me GODyr","date":"2016-07-14T17:05:42.773+0000","title":"Kerekerdő udyr","subforum":"Általános beszélgetés","up_votes":2,"down_votes":0,"body":"Sziasztok! L&aacute;ssuk be udyr mostan&aacute;ban el&eacute;gg&eacute; el van hanyagolva, el&eacute;gg&eacute; r&eacute;g&oacute;ta nem kapott skint, szinte minden hős kapott az elm&uacute;lt egy &eacute;vben, csak ő nem, szerintem kaphatna egy kerekerdő skint ő is, nektek mi a v&eacute;lem&eacute;nyetek erről? (Tudom hogy az&eacute;rt mert ide &iacute;rok, nem fog t&ouml;rt&eacute;nni nagyon sok minden, csak k&iacute;v&aacute;ncsi vagyok hogy nektek tetszene-e)","replies":[{"poster":"Mind The Gap","date":"2016-07-14T17:09:03.446+0000","up_votes":1,"down_votes":0,"body":"Tavaly jött be a Definitely Not Udyr (alias Semmiképp sem Udyr), olyan rég nem volt. Inkább egy picike kis átdolgozás kellene neki, nem sok. Csak az éles részeket lesimíthatnák picikét jobban rajta, meg talán pár animációját frissíthetnék. De én őszintén nem sok Udyr látok errefelé.","replies":[{"poster":"Call Me GODyr","date":"2016-07-14T17:17:12.891+0000","up_votes":1,"down_votes":0,"body":"Igen, ráférne az átdolgozás, de mi van akkor hogyha nem engedheted meg magadnak a játék legdrágább skinjét? Akkor vehetsz egy semmiképp sem udyrt(amit gyűlölök) vagy egy fekete öveset, nem túl nagy a választék, és nem értem hogy miért az kap akinek már van 9, mert többen veszik meg azt a skint? Udyr is eléggé népszerű szerintem, megérdemelné az ember hogy vehessen egy olyan skint ami nem a legdrágább és választhasson :)","replies":[]}]},{"poster":"Zooty","date":"2016-07-14T17:10:19.091+0000","up_votes":1,"down_votes":0,"body":"Honnan veszed hogy mindenki kapott idén skint? Ez szimplán nem igaz, vannak akik évek óta nem kaptak egyet sem! (Pl. Yorick)\n\nUdyr meg pont azon kevés hősök közé tartozik akik még ultimate skinnel is rendelkeznek..","replies":[{"poster":"Call Me GODyr","date":"2016-07-14T17:13:31.756+0000","up_votes":1,"down_votes":0,"body":"\"szinte minden hős kapott az elmúlt egy évben\" tudom hogy kik kaptak és kik nem, tudom hogy van ultimate skinje is, aminek van egy ára nem értem hogy miért az fog kapni most is akinek van már 8, yorickot és urgot is sajnálom nem csak udyrt :(","replies":[]}]}]}