{"poster":"Call Me GODyr","date":"2016-06-05T13:25:47.342+0000","title":"Udyr","up_votes":2,"down_votes":1,"body":"Sz&eacute;pj&oacute;napot, udyr el&eacute;gg&eacute; a sz&iacute;vem cs&uuml;cske, csak vele j&aacute;tszom &eacute;s el&eacute;gg&eacute; furcsa dolgok v&eacute;lhetők fel rajta, ha haszn&aacute;lod a q k&eacute;pess&eacute;ged akkor a bal t&eacute;rded &aacute;tbugol a szokny&aacute;don, a ruh&aacute;d kereszt&uuml;lmegy a tigrisbund&aacute;n, 6 &eacute;ve &iacute;gy n&eacute;z ki szeg&eacute;nyke, igaz&aacute;n meg&eacute;rdemelne egy visual update-t. Ameddig van idő /remake commandokat csin&aacute;lni ami semmit sem &eacute;r, addig van idő arra is hogy egy olyan bugot fix&aacute;ljanak amit 3 patch &oacute;ta &eacute;szrevettem m&aacute;r, ha riotos vagy &eacute;s ezt olvasod, akkor l&eacute;gy oly kedves &eacute;s &iacute;rd le hogy erre van egy cseppnyi es&eacute;ly is, vagy vedd meg a spirit guardot azt k&eacute;sz...","replies":[{"poster":"Temp65432","date":"2016-06-05T13:31:32.096+0000","title":null,"up_votes":1,"down_votes":0,"body":"No offense, de szerintem az, hogy a /remake-el kiszűrjék azokat az embereket, akik töltéskor kifagynak, és így jobbá tegyék a játékot kicsit fontosabb, mint az, hogy udyrnak kilátszik a térde a szoknya alól. Bár lehet, hogy az én gyarlóságom miatt hiszem ezt, és tényleg kulcsfontosságú a játék jövője szempontjából, hogy udyr sexy lába eltakarva maradjon.","replies":[{"poster":"Call Me GODyr","date":"2016-06-05T13:36:31.371+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az kritikát elfogadom, de itt inkább arra célzok, hogy azt aki kifagyott töltőképernyőn stb és nem tud visszajönni a 3. perce csak a 4.re azzal ki kell cseszni, de aki trollkodik azzal bírj ki 20 percet és veszíts te is lp-t. Amúgy, ha jól tudom 6 éve így néz ki és az hogy hogy néz ki egy karakter szerintem fontos. Ha színes kockák lennének a champek biztos te se játszanád ezt(költői túlzás)","replies":[{"poster":"Temp65432","date":"2016-06-05T13:46:13.896+0000","title":null,"up_votes":1,"down_votes":0,"body":"Persze, értem én a problémád, csak kicsit túlzásnak éreztem a hasonlatod :'D Sajna nagyon sok hősre ráférne már a visual upgrade, csak gondolom a grafikus teamnek elsősorban az a dolga, hogy új karaktereket/skineket csináljanak, nem pedig az, hogy a régieket újítsák (abból nem jön annyi bevétel, tehát nem élvez prioritást). Meg persze gondolom nem ugyan azok az emberek dolgoznak a visual upgradeken, mint azok akik a technikai dolgokkal, tehát nem jó ötlet a kettőt egymás mellé állítani.","replies":[{"poster":"Call Me GODyr","date":"2016-06-05T13:56:03.754+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hogyha együtt tudnak dolgozni és képesek megalkotni hibátlan skineket és champeket kinézet ügyileg, akkor igazán egymás mellé állíthatom őket. Tudom hogy a skinek hozzák a pénz és nem a vu-k, megértem hogy a riot nem milliárdosokból álló non-profit szervezet, de miért nem lehet valamit rendesen megcsinálni ha egyszer megcsinálod? Nem kéne vele többet foglalkoznod, max ha új motort kap a játék. Megértem hogyha úgy állnak hozzá, hogy akinek tetszik az vegye meg a spirit guard udyrt, abban nincs hiba, de ha jól tudom ez egy free to play játék, szóval igazán fixálhatnák azt is ami ingyen van, azért mert nem csinálnak egy 12. skin valakire hanem 5-6 champet helyre raknak kinézet ügyileg, nem fog összeomlani a cég...","replies":[{"poster":"derX","date":"2016-06-05T13:58:23.223+0000","title":null,"up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Call Me GODyr","date":"2016-06-05T14:04:23.522+0000","title":null,"up_votes":1,"down_votes":1,"body":"Többször is leírtam, hogy tudom miből jön a pénz, tudom hogy nem non-profit a riot, szóval nem értem ezt az érvelésed. Milyen kérdésre kapok választ? Talán egyetemen tanítják azt hogy mikor mit fog megvalósítani a riot? De nem veszekedni jöttem ide, örülök hogy vannak olyan emberek akik tudnak még érvelni :) Valószínűleg egy oldalon állunk, csak épp máshogy adunk hangot magunknak, én is szkeptikus vagyok ezzel kapcsolatban de semmit sem veszíthetek, egy riotos válaszára leszek majd igazán kíváncsi, de úgyis tudom hogy csak csűrni-csavarni fogja az egészet és nem mond el semmit, de mit veszíthetek?","replies":[]}]},{"poster":"Temp65432","date":"2016-06-05T14:02:45.698+0000","title":null,"up_votes":1,"down_votes":0,"body":"Azért írtam, hogy ne állítsd őket egymás mellé, mert ha odaültetsz egy rendszergazdát a rajztábla mellé, akkor abból garantálom hogy nem lesz visual upgrade. Mindenkinek megvan, hogy mi a dolga. Ugyan úgy , ahogy az életben sem raksz egy jogászt oda, hogy fessen, hiába tudja a törvényeket nagyon jól.","replies":[{"poster":"Call Me GODyr","date":"2016-06-05T14:06:05.393+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez szép és jó, de nem értem ha össze tudnak rakni valamit szépre és jóra, akkor azt valami mással miért nem lehet? Mert régi? Netántán nem hoz pénzt? Valószínűleg a pénz miatt....","replies":[]}]}]}]}]}]},{"poster":"derX","date":"2016-06-05T13:41:41.626+0000","title":null,"up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Call Me GODyr","date":"2016-06-05T13:47:32.218+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igen, tényleg eléggé sok van, nem csak udyr, de ilyen bugokat nem véltem felfedezni másnal (igaz nem is játszom mással) Csak itt az a bökkenő, hogy inkább új skineket csinálnak arra akinek csomó van(tudom, ami népszerűbb az többet kap, szín tiszta üzlet) és nem fixálja ezeket a champeket, udyrnak van 3 skine ami megvehető, több mint egy éve nem kapott újat(ez igaz sok champre, de nekik van egy csomó, kivétel gnar és bard) ameddig pl. trinda aki tűrhetően néz ki 2-t is kapott, pedig nem egy felkapott chaamp. lehet hogy csak én vagyok elfogult, de akkor is...","replies":[]}]}]}