{"poster":"Call Me GODyr","date":"2016-08-03T14:59:29.862+0000","title":"Csak én gondolom így?","up_votes":2,"down_votes":1,"body":"Ti is &uacute;gy vagytok vele hogy ez a legrosszabb season? Minden t&eacute;ren, a community, a ranked meccsek, a csapatt&aacute;rsak stb.... t&ouml;k j&oacute; hogy van project ekko, de mi lenne ha ehelyett ink&aacute;bb valami olyasmivel foglalkozn&aacute;nak, mint a soloQ visszahoz&aacute;sa, teamranked stb...","replies":[{"poster":"Brăd","date":"2016-08-03T15:51:12.808+0000","title":null,"up_votes":1,"down_votes":0,"body":"A DynamicQ kivételével semmi bajom a seasonnel.","replies":[{"poster":"Sgt Stonebridge","date":"2016-08-03T16:03:44.726+0000","title":null,"up_votes":1,"down_votes":2,"body":"Komolyan érdekel hogy neked jelenleg unrankedként, egyébként bronz-silveres mmr-el mi bajod van a dynamicq-val? Azt hogy az embereknek challangerben mi bajuk van azt tényleg megértem, de hogy neked mint max silveresnek mi bajod van a dynamic q-val azt nem. A játék olyan alacsony szinten zajlik ott hogy a világon SEMMI különbség nincs, talán még jobban is jársz ha van ellened egy jó 4fős premade akik hétvégén néztek 1 kis lcst és totál szét failolják a meccset meg tolnak 1 laneswapot.\n\nszóval komolyan érdekelne hogy neked mi bajod van vele","replies":[{"poster":"Lord Babkonzerv","date":"2016-08-03T18:46:18.499+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez nagyon durva negatív diszkrimináció barátom. Netán politikusnak készülsz?","replies":[{"poster":"Sgt Stonebridge","date":"2016-08-03T18:55:10.701+0000","title":null,"up_votes":2,"down_votes":1,"body":"ebben nincs semmi negatív diszkrimináció (vagyis nem akart lenni) csupán kíváncsi vagyok hogy miért zavar valakit valami ami őt gyakorlatilag semmiképpen nem érinti, high elon kívül sehol nem változott semmi a DQ miatt, sőt lowelon mostmár 1 winről kezded a promóidat a sok cry miatt, lett remake is.\ncsupán érdekel hogy 1 olyan playert akit ez gyakorlatilag semmiképp nem befolyásol negatívan miért zavar. fogadni mernék ha nem lett volna ez az ormotlan cry a DQ miatt a legtöbben észre sem vették volna hogy bent van.\n(pláne hogy én diamond elon nem látok olyant hogy egyik team 4-5 fős premade a másik pedig full solo, így szinte lehetetlennek tartom hogy silver-bronzban ahol a legtöbben vannak többször is előforduljon hogy 4fős premade vs full solo legyen)\naz egyetlen ami miatt cryolhatnak hogy a szomszéd pistikét kihuzták dynamicban így ahelyett h silveres lenne most gold5ben van, és ez így mennyire nem fair, de ha valakit az komolyan érdekel hogy a szomszéd pistike silverben vagy goldban van az komolyan megérdemli hogy ezen tiszta ideg legyen","replies":[]}]},{"poster":"Call Me GODyr","date":"2016-08-03T16:09:32.797+0000","title":null,"up_votes":1,"down_votes":0,"body":"Unranked, tehát nem lehet véleménye semmiről a lolban? Ő nem gondolkodhat? Nem lehetnek ötletei? csak azért mert te régebb óta játszol, ő is ugyanolyan rég használja a dynamicQ-t.... (normál draft)","replies":[]},{"poster":"Brăd","date":"2016-08-03T20:11:45.709+0000","title":null,"up_votes":1,"down_votes":0,"body":"Eunén régóta nem rankedezem.~~ Euw-n kölcsönkaptam egy darabig egy plat-dia mmr-ű accot, hogy X csávónak, ne essen le az LP-je. (<- tudom, hogy tiltott, de wurf)~~\nMindenesetre a lényeg, hogy volt alkalmam megtapasztalni a dynamicQ örömeit és azt, hogy mennyire kényelmes solo játékosként 3-mas, 4-es premade csapatokat kapni, akik teljes mértékben kizárnak a kommunikációból, illetve, mikor az enemy egy ütőképes kombóval ránk támad boton 4 emberrel.","replies":[]}]}]},{"poster":"Sylasi Elvtárs","date":"2016-08-04T16:54:22.148+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha te egy weblapszerkesztő vagy egy cégnél, gondolod téged hivnak majd oda ha elromlott a kávéfőző? Szerintem helytálló példa.","replies":[]},{"poster":"Nemin","date":"2016-08-03T15:04:44.143+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem tudom, én mivel főleg haverokkal megyek normált, nekem teljesen jó ahogy van.\n\nNem az igazad akarom tagadni, csak a másik nézőpontra is rávilágítani: A játék még mindig ugyanannyira jól élvezhető a megfelelő emberekkel.","replies":[{"poster":"Call Me GODyr","date":"2016-08-03T15:08:15.550+0000","title":null,"up_votes":1,"down_votes":0,"body":"Örülök, hogy neked megvan az a baráti kör, persze teljesen másmilyen az ha normáloztok, mintha egyedöl/ketten tryhardoltok rankeden, a platináért. A mai meccseimen is minden volt csak rendesel elosztott csapat nem, nem sírni akarok, de tavaly amikor silver 4-5 körül mozogtam, sokkal jobban élveztem a rankedeket, sokkal jobban el voltak osztva a caspatban az emberek, nagyon ritka volt az a meccs ami az első 20 percben eldőlt, mostanság amikor a botlane rendzseresen 0/15.öt produkál, mind nálunk, mind az enemyben akkor az nem élvezhető, nincs azzal bajom ha kikapok, azzal viszont van ha úgy nyerek hogy az ellenfelemnek esélye sem volt","replies":[{"poster":"Nemin","date":"2016-08-03T15:35:10.444+0000","title":null,"up_votes":1,"down_votes":0,"body":"Egyrészt a hozzáállásod nagyon tetszik, legalább nem a kikapásért sírsz mint sokan szoktak,\n\nmásrészt, gondolhatod mi miért normálozunk és nem rankedezünk...","replies":[{"poster":"Call Me GODyr","date":"2016-08-03T15:40:10.151+0000","title":null,"up_votes":1,"down_votes":0,"body":"A kikapást is lehet élvezni, szerintem nem azért kell játszani, hogy nyerjünk, hanem hogy élvezzük a meccset :)","replies":[{"poster":"Nemin","date":"2016-08-03T15:53:06.273+0000","title":null,"up_votes":1,"down_votes":0,"body":"Sajnos egy-két barátom ezt nem így gondolja...","replies":[{"poster":"Temp65432","date":"2016-08-03T20:25:04.547+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ugyanmár...ez csak habi. Ha a funért játszana és nem a győzelemért, akkor ez a topic nem létezne, hanem épp kacarászna azon, ahogy az enemy mides egyhitelgeti. Ha valaki felhőtlenül szórakozik akkor nem sírdogál a fórumon a matchmaking miatt.\nMondani énis tudom, hogy mennyire a funért játszok és imádom, ha szürke a képernyőm....Csak épp 500 emberből kb ezt 1 gondolja komolyan. És azzal az egyel nem ilyen jellegű topic alatt fogsz találkozni.","replies":[{"poster":"Call Me GODyr","date":"2016-08-04T10:53:11.561+0000","title":null,"up_votes":1,"down_votes":0,"body":"Először is, nem nonstop játszom, mást is csinálok, tudom furcsa. Másodszor, a fun nem azt jelenti hogy direkt feedelek, nekem az az élvezet ebben a játékban amikor 50 perces kemény küzdelem megy, nem pedig az hogy a killek állása 30-70, ez bármi csak funnak nem fun, nem tudom hogy a fun miért lenne egyenlő azzal hogy rosszul teljesítesz, gondolom neked ez a \"vicces\" ha élvezel valamit a játékban akkor ez az. Elindítottam egy felmérést hogy kinek hogy tetszik ez a season, ez bármi csak nem sírás, szimpla kíváncsiság, de persze kössünk bele mindenbe, az indokaid pedig eléggé harmatosak, senki sem mondta hogy nekem az a fun ha feedelek, amiket leírtam itt a komment szekcióban, erre rá is jöhettél volna, ebből is látszik hogy csak belém akarsz kötni, igazából nem is érdekel hogy miről szól a topic, nem is értem miért koptatom a billentyűzetemet....","replies":[]}]},{"poster":"Brăd","date":"2016-08-03T20:13:39.603+0000","title":null,"up_votes":1,"down_votes":0,"body":"I just have been rekted.","replies":[]}]}]}]},{"poster":"SS Éjjeli Féreg","date":"2016-08-04T08:57:57.011+0000","title":null,"up_votes":1,"down_votes":0,"body":"1-2 skinért cserébe kihúzlak silverből ha gondolod","replies":[]},{"poster":"Sgt Stonebridge","date":"2016-08-03T15:54:00.150+0000","title":null,"up_votes":1,"down_votes":4,"body":"\"azzal viszont van ha úgy nyerek hogy az ellenfelemnek esélye sem volt\"\nakkor fogd azt a hülye udyrodat és rohanj addig miden amig ugy nem érzed hogy az ellenfélnek van esélye... ekkora baromságot nehéz lehet leírni","replies":[{"poster":"Call Me GODyr","date":"2016-08-03T15:59:45.164+0000","title":null,"up_votes":1,"down_votes":0,"body":"köszönöm az értelmes hozzászólást, lehet hogy furcsa, de nem szeretem azt ha az ellenfél feladja 20-nál, furcsa, mi? Nem tudom hogy udyr miért \"hülye\" te tudod.... Én még azon egyes emberek közé tartozom, akik nem fognak remakelni, akik engedik farmolni az ellenfelet ha a afk volt, számomra ez fontosabb mint a winn, inkább leszek sportszerű vesztes, mint igazságtalan győztes, de a komennted alapján, aminek cask annyi köze van a topickhoz, hogy beleköss, nem fogok leállni vitatkozni veled, tudod van az a mondás, hogy ne vitatkozz hülyével, mert lehúz a szintjére és legyőz a tapasztalatával :)","replies":[{"poster":"Sgt Stonebridge","date":"2016-08-03T16:44:49.162+0000","title":null,"up_votes":2,"down_votes":2,"body":"belövöd ide hogy te feljebb akarsz jutni, meg tryhardolsz mint állat és 0-15öket megy a botlaned, aztán benyomsz 1 ilyent h ha az ellenfél kifagy akkor hagyod farmolni meg nem remakelsz. alapvetően ezzel nincs gond, ugy ah azzal sincs gond ha valaki bronzos, akkor van gond ha valaki feljön ide és nyit 1 crytopicot h minden mennyire rosz :'( és tryhardol de 0-15öket megy a botlane, miközben köze nincs a tryhardhoz. én ha feljebb akarok jutni és valaki kifagyott addig farmolom amig ki nem lép a játékból mivel ez a tryhard lényege. ha meg elmulsz 15éves és kicsit felnősz rájössz hogy olyan nincs hogy igazságtalan győztes, csak olyan van hogy győztes","replies":[{"poster":"Temp65432","date":"2016-08-03T17:32:38.721+0000","title":null,"up_votes":1,"down_votes":0,"body":"Végre valaki aki tudja , hogy működik a ranked. Kemény szavak, de igazak.","replies":[]},{"poster":"Call Me GODyr","date":"2016-08-03T17:19:34.766+0000","title":null,"up_votes":1,"down_votes":0,"body":"Van egy rossz hírem, be kellene járnod nyelvtan órákra, nem tudsz mondatot értelmezni, azért mert én jungelben, topon, miden próbálok tryhardolni, attól még feedelhet a bot, ahhoz nekem max 1-2 ganknyi közöm van, nem szeretem az udyr supportot, adct. Lehet hogy neked a tryhard azt jelenti hogy kibaszol azzal akivel csak kibaszhatsz és nem lesz belőle bajod, nekem a tryhard azt jelenti hogy próbálok jobban odafigyelni, mindent beleadni, olyan champekkel játszani amikkel tudok is, nem pedig azt hogy kibaszok azzal aki afk volt, kifagyott stb... nem tudom hogy te mennyire érzed igazságosnak azt hogy az ellenfélnél kilép egy ember a 40. percnél, ti bedaráljátok őket, persze ők jobban álltak, de miután ezt megtetted, biztos büszke leszel magadra, hogy te mennyire jó játékos vagy, miközben az ellenfél nyerte meg neked, azzal hogy kilépett, de te attól még jobb játékos leszel, az tényleg igazságos volt a 4 enemyvel szemben, nem mondom hogy nem tenném meg én is ezt a 40. percnél, de nem lennék büszke arra a meccsre, amin közöm sem volt a winnhez, persze neked ez teljesen oké... Vannak elveim amiket nem fogok megszegni +20-25 liga pontért (lp), ezzel én befejeztem, írj amit szeretnél, el fogom olvasni, válaszolni már nem fogok, mert te csak bele kötöttél eddig mindenkie, ha unranked akkor azért, ha udyr main akkor azért, érveket már nem tudsz felmutatni, csak gyenge próbálkozásokat, hogy te tryhardolsz de a botlane 0/15, semmi köze a 2-nek egymáshoz...","replies":[{"poster":"Sgt Stonebridge","date":"2016-08-03T17:59:28.279+0000","title":null,"up_votes":1,"down_votes":1,"body":"azt írod h tryhardolsz, ami azt jelenti h mindent megteszel a győzelemért, aztán közben ha kifagy valaki melletted akkor nem ölöd meg, ha vki töltőképernyőn elmegy megsétáltatni a kutyát és visszajön 5 percnél te nem ölöd meg mert az nem fair (: .\nbiztos csudajófejnek hiszed magad de az igazság az h 1 idiota vagy, a kutyát nem érdekli hogy hogyan nyersz, nem fog senki odamenni és aztmondani ezigen udyrkirály te ugy nyertél hogy a csapatod hihetetlenül jól játszott és te voltál a vezére, pont ugyanannyit ér mint amikor az enemy gnar 5percnél 1-3ban 5 farmal kilép. \nnincs azzal baj ha te nem tryhardolsz meg hagyod farmolgatni az enemyt ha neked ez jól esik, csak akkor ne gyere ide és kezdj el sírni hogy kikapsz mert 0-15ben van a botod, amikor te ugyanugy csak játszani mész be és nem teszel meg mindent a winért","replies":[]}]}]},{"poster":"Lord Babkonzerv","date":"2016-08-03T16:08:50.859+0000","title":null,"up_votes":1,"down_votes":0,"body":"Végre valaki ismeri Mark Twain mondását, ez elismerésre méltó","replies":[]}]},{"poster":"Nemin","date":"2016-08-03T16:11:14.195+0000","title":null,"up_votes":1,"down_votes":0,"body":"Még jó, hogy objektív és megdönthetetlen érveket hoztál fel ellene!\n\nAz oké, hogy az Udyr nem egy A. Sol, de attól még mindenkihez kell skill.","replies":[]}]}]}]},{"poster":"FirstFizz","date":"2016-08-03T17:15:37.829+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nekem csak az aránytalanul erős ellenfél elosztással van gondom...meg azzal hogy az ellenfél hozz egy 4-es premadet normalra akkor miért a solo játékosokat dobja be ellenük??? mikor biztos lenne más premade csapat is a várólistán. Tavaly nem volt ilyen baj akkor rendesen eltudták osztani a játékosokat.","replies":[]},{"poster":"Mind The Gap","date":"2016-08-03T15:07:14.377+0000","title":null,"up_votes":1,"down_votes":0,"body":"A Riotön belül több csapat van, amelyek más-mással foglalkoznak. Az ezzel foglalkozó csapat lehet, hogy ezen gondolkodik, de nem egy csapat foglalkozik a játék összes részével.","replies":[]}]}