{"poster":"Apsidi 152M KM","date":"2017-02-10T22:10:37.703+0000","title":"Salve ho un grossisimo problema","subforum":"Aiuto e supporto","up_votes":1,"down_votes":3,"body":"Ragazzi purtroppo mi sono entrati nell&#039;account di lol e nell&#039;email credo a  causa di un keylogger ho mandato diversi ticket ma mi dice che sono cancellati non posso cambiare password ne nulla perche &egrave; stata cambiata con una cinese strana vi prego aiutatemi a risolvere  ecco l&#039;email ******77117@163.com\r\nho faticato tanto per portarlo gia in gold questo account vi prego ditemi come risolvere","replies":[{"poster":"Chroniicles","date":"2017-02-11T09:23:01.175+0000","up_votes":1,"down_votes":0,"body":"Non è che possono risponderti nel giro di qualche ora (notturna per giunta e nel fine settimana).\nAspetta la loro risposta, non mandare più ticket del necessario (o la tua richiesta torna indietro nella coda) e ricordati che è pur sempre colpa tua se sei in questa situazione... pazienta e collabora più possibile col supporto, devono poter verificare sia tu il legittimo proprietario e per forza di cose ci vuole tempo","replies":[]},{"poster":"Apsidi 152M KM","date":"2017-02-11T08:11:09.286+0000","up_votes":1,"down_votes":0,"body":"ho fatto gia tutto ne ho mandati 4 e non ricordando bene da quale account email ho creato l'account perche ne ho tanti, cosa che ho scritto gli ho chiesto se potevano dirmelo da quale era stato creato cossi acedevo tanto le password le ho, comunque non rispondono proprio ne danno segni di vita quelli della riot del supporto e se clicco per vedere i tiket dall'email mi da che non esistono i tiket mandati. Insomma supporto inesistente intanto il cinese mi ha speso tutti gli ip e rp che avevo fantastico..","replies":[{"poster":"Menfrix","date":"2017-02-11T08:31:22.057+0000","up_votes":1,"down_votes":0,"body":"Tieni presente che è sabato, essendo loro dei lavoratori, probabilmente saranno ad organico ridotto durente il finesettimana...\nSe hai pazienza fino a settimana lavorativa iniziata ti faranno sapere qualcosa, tutti quelli con problemi similari al tuo che han scritto qua sul forum e al supporto da quel che ci han detto han risolto.\nPer quanto riguarda rp etc etc, se il recupero va a buon fine te lo resettano al tuo ultimo accesso se non ricordo male.","replies":[]}]},{"poster":"Menfrix","date":"2017-02-11T08:03:31.804+0000","up_votes":1,"down_votes":0,"body":"Leggi questa guida del supporto e segui la procedura del caso \"account non recuperabile\", ti faranno una serie di domande, solitamente la cosa si risolve. \nhttps://support.riotgames.com/hc/it/articles/201751694","replies":[]},{"poster":"Apsidi 152M KM","date":"2017-02-10T22:44:28.840+0000","up_votes":1,"down_votes":0,"body":"l'email l'ho recuperata non riesco a  recuperare l'account di lol perche quando devo cambiare email manda un email all'email corrente che è cinese di conseguenza non posso cambiare nulla ne password ne email","replies":[]},{"poster":"Jeanne dˆArc","date":"2017-02-10T22:40:38.789+0000","up_votes":1,"down_votes":0,"body":"Recupera l'email. Ci sono tanti modi per recuperarla: email di riserva su cui farti mandare il tool per cambiare password, numero di telefono associato all'email, domanda segreta oppure puoi contattare direttamente l'assistenza del tuo dominio email (gmail, yahoo, libero ecc). Una volta recuperata l'email, potrai con calma recuperare l'account di LoL.","replies":[]}]}