{"poster":"SpecterVonBaren","date":"2015-09-16T21:28:30.559+0000","title":"@ Rioter Important clarity question about Kindred's passive","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"&gt;     Both Lamb and Wolf mark targets to hunt.\r\n&gt; \r\n&gt;     Lamb can choose a champion to hunt from the selection panel opened by the button beneath the passive icon. \r\n&gt; \r\n&gt;     Wolf periodically hungers for and hunts jungle monsters.  \r\n&gt; \r\n&gt;     Gaining a kill or assist on that target permanently empowers Kindred&#039;s attacks, granting them 1.25% of the target&#039;s current Health in bonus physical damage.\r\n\r\nOkay, so my question is this specifically &quot;Gaining a kill or assist on that target permanently empowers Kindred&#039;s attacks, granting them 1.25% of the target&#039;s current Health in bonus physical damage.&quot; So does this mean she gains percentage current health damage no matter who or what she kills or does it mean she gains percentage health damage against that specific target? \r\n\r\nLike if she killed Malphite while he was marked she&#039;ll now do 1.25% of HIS current health in physical damage against him but then she camps bot and kill the enemy Caitlyn twice and so she now 2.5% of HER current health in physical damage. Or would it just give her 3.75% current health damage against everyone?","replies":[{"poster":"Meddler","date":"2015-09-17T06:29:48.013+0000","up_votes":2,"down_votes":1,"body":"Current health damage against everyone (same way Blade of the Ruined King works).","replies":[{"poster":"darkdill","date":"2015-09-17T06:35:44.297+0000","up_votes":4,"down_votes":3,"body":"That honestly sounds like Kindred has too many anti-health attacks. One as a permanent passive bonus for kills, one as part of her E.\n\nI dearly hope that the passive one has a cap of some kind. Otherwise it's fundamentally broken if Kindred snowballs.","replies":[{"poster":"macromite","date":"2015-09-17T16:08:12.247+0000","up_votes":2,"down_votes":0,"body":"kindred is fair because they already need to be fed before it does anything worthwhile and crazy.","replies":[]}]}]},{"poster":"ReshiKillim","date":"2015-09-16T21:29:41.893+0000","up_votes":1,"down_votes":0,"body":"It's a permanent boost against everything! (Except structures, they'll make it so it doesn't work on structures)","replies":[]}]}