{"poster":"ProfessorGroovy","date":"2017-10-12T14:35:12.439+0000","title":"Why Can't Others Hear Jhin's Ult Music","subforum":"Concepts & Creations","embed":{"description":"Champion Select \"In carnage, I bloom, like a flower in the dawn.\" \"My genius will be understood - eventually.\"","url":"http://leagueoflegends.wikia.com/wiki/Jhin/Quotes","image":"http://img3.wikia.nocookie.net/__cb173/leagueoflegends/images/8/89/Wiki-wordmark.png"},"up_votes":6,"down_votes":0,"body":"Why can&#039;t other champions hear Jhin&#039;s ult music when he ults? You would figure that Jhin isn&#039;t the one would pass up an opportunity to show off his performance. It could be like, if you&#039;re in Jhin&#039;s ult range you&#039;re part of his performance now and can hear the music. I think this would add ALOT to playing against/with Jhin and it kinda seems like a missed opportunity that it&#039;s not in the game. If you never played Jhin you wouldn&#039;t even know that his ult even has a theme! \r\nNow I understand if this was disabled because the music could mask Jhin&#039;s bullet audio queues; but I think allies hearing the music would do nothing but add to the experience of playing with the Virtuoso. \r\nWorst case scenario, you could even add an option to mute Jhin&#039;s music when you hit tab. \r\nBeing able to hear Jhin&#039;s music during his performance seems like a no brainer to me. He&#039;s not exactly the humble kind of guy that would censor himself so others wouldn&#039;t be bothered by his music. MAKE IT HAPPEN RITO. \r\n(P.S. If you haven&#039;t listened to Jhin&#039;s Curtain Call themes, fix that asap. I left a link to his quotes; You can find his themes under the Curtain Call section. Each of his skins have multiple different variations of the song.)\r\nThanks for hearing me out!!! :D","replies":[{"poster":"Chembaron Yamada","date":"2017-10-12T16:09:58.147+0000","up_votes":11,"down_votes":0,"body":"I actually think it fits thematically.\nThe music is not real, it is just in Jhin's head.\nHe is insane and sees his murders as art, It's not that farfetched to think that he is imagining things like that.","replies":[{"poster":"Riot Ve1vet","date":"2017-10-12T18:23:15.547+0000","up_votes":12,"down_votes":1,"body":"Was going to comment this ^ If you think about Jhin's perspective in his head this is all part of a performance :^)","replies":[]},{"poster":"ProfessorGroovy","date":"2017-10-12T19:46:27.443+0000","up_votes":5,"down_votes":0,"body":"You make a really good point.","replies":[]},{"poster":"HonestJohnTheCon","date":"2017-10-12T20:45:25.567+0000","up_votes":3,"down_votes":0,"body":"Similarly, you'll notice every quote line he says to himself has a slight reverb or echo at the end. His taunts, joke, and anticipating-fourth-shot lines don't have this effect.","replies":[{"poster":"The Djinn","date":"2017-10-13T15:29:34.787+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Helixarrow,realm=NA,application-id=A8FQeEA8,discussion-id=HX9AriwX,comment-id=00010002,timestamp=2017-10-12T20:45:25.567+0000)\n>\n> Similarly, you&#x27;ll notice every quote line he says to himself has a slight reverb or echo at the end. His taunts, joke, and anticipating-fourth-shot lines don&#x27;t have this effect.\n\n...that's really awesome, and I'd never noticed that before. Time to go listen to all of Jhin's lines again with that in mind!","replies":[]}]}]},{"poster":"Sona Ping","date":"2017-10-12T16:10:40.017+0000","up_votes":3,"down_votes":1,"body":"He doesn't because Jhin does not drag an orchestra and full choir with him where ever he goes.  I imagine that would cause issues with the assassin thing.\n\nSo consider, where is the choir then?","replies":[]},{"poster":"DariusDemiurge","date":"2017-10-12T19:53:55.270+0000","up_votes":1,"down_votes":0,"body":"They should claim that fully constructed whisper plays the music with some magical reason and make it happen, at least for his teammates as an extra indicator he is setup to snipe.","replies":[]},{"poster":"LegendarySaiyanG","date":"2017-10-12T15:58:55.348+0000","up_votes":1,"down_votes":0,"body":"They definitely should get to hear the music, but like in a coming from the source way and not a universal way like jhin's it would be really cool if implemented.\n#ritopls :D","replies":[]}]}