{"poster":"soy re nob xD","date":"2016-01-04T01:35:22.106+0000","title":"GG Cabros Riot me Gankea","subforum":"Problemas Técnicos","up_votes":2,"down_votes":2,"body":"Estoy chato de que la basura de bug splat haga que me baneen, no veo ninguna falla en partida, de un momento a otro se cierra sin razon y se abre la basura de bug splat para que me baneen la cuenta y esperar 5 partidas con el ban de 20 minutos de tantas veces que me ha pasado, se que hay mas de uno por ahi que quizas ni lea esto pero riot ya me tiene harto, ganan cualquier plata y no mantienen bien un servidor (lag impresionante) y ahora vienen a banearme por algo que no es culpa mia >:C ensima no pueden sacar el ban y con un perdon no recupero el tiempo perdido en esos 100 minutos.","replies":[{"poster":"Chillout","date":"2016-01-04T01:51:15.867+0000","up_votes":1,"down_votes":0,"body":"El bugsplat igual es un tema de tu pc. No entiendo porque lo pones aca cono queja, de ultima pedi consejos para arreglarlo. {{champion:17}} {{champion:105}}","replies":[{"poster":"FedecarboneroUY","date":"2016-01-04T02:08:42.313+0000","up_votes":1,"down_votes":0,"body":"problema de PC no es, o me vas a decir que Gosu no juega con una Computadora buena?\nNo, no es problema del PC, es problema de Riot, a mi me ha saltado 2 o 3 veces en mi vida, pero aun asi se que a mucha gente le salta, y es problema de Riot, de nadie mas.","replies":[{"poster":"Chillout","date":"2016-01-04T04:37:25.916+0000","up_votes":1,"down_votes":0,"body":"Gosu esta en challenger y nunca se quejo del launcher (y si lo hizo primero tendrias que llegar a challenger antes de quejarte jajajaj). {{summoner:13}} {{summoner:2}}","replies":[{"poster":"FedecarboneroUY","date":"2016-01-04T05:17:27.278+0000","up_votes":1,"down_votes":0,"body":"yo nunca dije que Gosu se haya quejado o no, solo dije que mismo hay un video en el que a Gosu le sale el Bugsplat y eso mismo evidencia que el Bugsplat no salta por tener una computadora mala, no creo que el jugue con una computadora asi ...","replies":[{"poster":"Chillout","date":"2016-01-04T06:50:14.732+0000","up_votes":1,"down_votes":0,"body":"Es un decir nomas, mi compu no es la mejor (tampoco la peor) pero nunca me salto el bugsplat. Solamente digo que no hay que generalizar porque me aburre ver en el foro gente poniendo anda mal el servidor (cuando hace 3 dias que anda bien, osea si tu internet es una mierda hacete cargo) o gente (no digo por vos) que generaliza que el launcher es una mierda, cuando en realidad no es algo de todos los dias en general. Creo que poner, \"alguien me ayuda con el problema de bugsplat?\" es mejor que poner \"este launcher es una cagada anda siempre mal y el bugsplat me tiene las pelotas llenas\" jajajaja. Nada, solo eso tratar de que sea mas amena la comunicacion y no quejarse tanto que aburre leer gente enojada. \n\nOjala lo puedas solucionar. Abrazoo\n\n{{item:2043}}","replies":[{"poster":"FedecarboneroUY","date":"2016-01-04T16:32:11.218+0000","up_votes":1,"down_votes":0,"body":"pero, yo no soy el del problema con el Bugsplat xDDDDDDDDDDDDDDDDDD\nes otro jaja, yo solo lei el post jajaa :v","replies":[{"poster":"Chillout","date":"2016-01-04T18:24:24.275+0000","up_votes":1,"down_votes":0,"body":"No esta bien solo lo pongo porque descubri el foro hace unos dias (desde que se cayo el servidor) y la gente no para de criticar cosas sin sentido (que el servidor se cae, cuando ya no se cae desde el 1 osea si tu internet es una cagada bancatela, que el launcher es una cagada, etc) sinceramente no se porque siguen jugando si tanto les molesta jajaja\n\nVa con toda la onda ABRAZO.","replies":[{"poster":"FedecarboneroUY","date":"2016-01-04T20:58:34.783+0000","up_votes":1,"down_votes":0,"body":"xD\nsaludos","replies":[]}]}]}]}]}]}]}]},{"poster":"xXLawea777xx","date":"2016-01-04T03:03:10.111+0000","up_votes":1,"down_votes":0,"body":"generalmente pasa por error de actualización o algún programa externo que modifique el juego (skins custom, mk lol, mapa custom y esas cosas)\n\nintenta reparar el cliente","replies":[]}]}