{"poster":"EH AMEO KE TE PA","date":"2017-02-09T03:34:46.096+0000","title":"Los moderadores del foro hacen mal su trabajo (Con el mayor de los respetos plz no ban)","subforum":"Charlas Generales","up_votes":56,"down_votes":7,"body":"A ver, ya que son tan machos para borrar comentarios poniendo copy paste, se les tendr&iacute;a que pedir los siguientes requisitos:\n\n- _**Ser objetivos**_ : &iquest;Qu&eacute; quiero decir con esto? Que en vez de leer un comentario y borrarlo seg&uacute;n su opini&oacute;n personal ( que obviamente lo hacen ), lo hagan con una raz&oacute;n v&aacute;lida en vez de ser tan subjetivos.\n\n- _**&iexcl;Que den la cara!**_ : que el moderador que haya borrado el comentario de un usuario, en el reporte que te llega de notificaci&oacute;n, diga que moderador es, su nombre en el foro y su n&uacute;mero de matr&iacute;cula. A ver si ah&iacute; se hace el macho.\n\n- _**Que se tomen la molestia de leer el contexto de un comentario reportado**_ : No se puede tomar tan a la ligera un comentario de un thread muy largo, tal vez pueda sonar ofensivo a la primera, pero si se lee el contexto se dar&aacute;n cuenta que solo un usuario con envidia lo reporto.\n\n- _**Poner una raz&oacute;n l&oacute;gica y pensada por dicho moderador**_ : A ver, si vas a borrar un comentario, y estoy hablando de comentarios con sentido, no cualquier cosa, por lo menos pone con tus propias palabras porque lo hiciste y que razones l&oacute;gicas utilizaste para borrar dicho comentario. \n\n- _**No sirve el copy paste**_ : Uno como usuario o forero, suele hacer largas rese&ntilde;as para responder a otra gente, en la cual puede llegar a pasar que en una oraci&oacute;n de esta rese&ntilde;a aparezca una palabra fuera de lugar, ya que por reglas del foro es entedible. Pero ah&iacute; a borrar un comentario de una persona y que te claven un copy-paste as&iacute; nomas, se siente desalentador y poco agradable.\n\n- _**Conclusi&oacute;n**_ : Por lo menos, y para que parezca que los moderadores hacen su trabajo bien, solo en comentarios que no rocen lo absurdo, como agravios, amenazas, o spam de verdad, te puedan dar una advertencia de que tu comentario a sido obsceno, o a cometido una falta del c&oacute;digo de convivencia del foro, y que trates de editarlo para que quede de forma correcta.\n\n S&iacute; el comentario sigue en las condiciones previas a la advertencia, este mismo sera borrado sin previo aviso. Por lo cual estar&iacute;a totalmente de acuerdo que as&iacute; sea, porque a uno por lo menos le da tiempo a pensar que hizo mal, y en que se pudo haber equivocado. En vez de ver que la rese&ntilde;a que te costo trabajo escribir, haya sido borrada sin posibilidad de modificarla.","replies":[{"poster":"Sir Crucifix ","date":"2017-02-09T07:04:10.084+0000","up_votes":17,"down_votes":2,"body":"a mi me banearon por discutir en la seccion de discuciones . son unos genios , menos mal que no dan la cara","replies":[{"poster":"Oniroz","date":"2017-02-09T12:09:00.867+0000","up_votes":8,"down_votes":3,"body":"Recuerdas qué comentario fue?","replies":[]}]},{"poster":"exrex","date":"2017-02-09T06:54:21.099+0000","up_votes":9,"down_votes":1,"body":"Una verguenza que ningun mod se haya pasado a responder, ni siquiera a decir que te tomarian en cuenta. \n\nPero yo creo que en realidad todas esas desprolijidades que nunca cambiaron a pesar de que muchos se quejaron, son para lavarse las manos lo maximo posible a la hora de banear. \n\nMuchas veces los bans que te meten en el foro ni siquiera te ponen el comentario que fue borrado. Asi que a veces ni sabes que hiciste mal y si preguntas, no te dicen, se hacen los misteriosos, osea wtf...  \nTe meten ban de 24 hs si te equivocaste de seccion, como si todos fueramos perfectos y equivocarse fuera un delito grave. \nPor ejemplo, poner un post de memes de lol en off-topic, te cae ban porque eso va en \"creaciones de la comunidad\"\nay guarda, cuanta diferencia... me merezco lo peor, super toxico lo que hice... Es mas, mis inteciones eran que el foro caiga... \n\nHay una norma en el foro que fue hecha para atajarse de los bans erroneos, esta en la seccion \"quejas y reclamos\" que dice: \n> Por favor si eres sancionado en el foro, no uses una cuenta secundaria o \"smurf\" para evadir la sanción o será suspendida.\n\nDe esta manera no tenes forma comunicarte para hacer que revisen tu caso y te tenes que comer el ban. \n\nLas normas del foro son muy ambiguas, tanto asi que los mods se toman la libertad de interpretarlas como se les de la gana (de ahi viene el \"cada mod tiene su criterio para banear\") algo totalmente ilogico porque no te da ninguna seguridad a vos como forero, al contrario, les da mas seguridad a los mods para que no les reclamen y puedan banear por tonterias, y muchas veces hacer lo contarior, no banear a quien se lo merece y da la casualidad que esto ultimo nada mas se vio en usuarios que estan en permanente contacto con ellos...","replies":[{"poster":"rokushoger","date":"2017-02-09T11:23:53.696+0000","up_votes":2,"down_votes":9,"body":"> De esta manera no tenes forma comunicarte para hacer que revisen tu caso y te tenes que comer el ban.\n\nLa forma de reclamar por un ban es por ticket a soporte. Esa regla es porque si te sancionan una cuenta es porque no quieren que escribas en el foro por ese tiempo, ergo si entrás con una smurf estás saltándote el castigo, y es razón de ban.","replies":[{"poster":"exrex","date":"2017-02-09T11:59:35.052+0000","up_votes":2,"down_votes":0,"body":"Cuando sos amarillo\n> La forma de reclamar por un ban es por ticket a soporte.\n\nCuando no sos amarillo. \n> Posteo esto acá porque la sección de comportamiento parece no tener moderador, o simplemente son tan ineficientes como en el soporte.\n\nhttp://forums.las.leagueoflegends.com/board/showthread.php?t=155974","replies":[{"poster":"rokushoger","date":"2017-02-09T12:13:09.528+0000","up_votes":2,"down_votes":4,"body":"Eso fue hace tres vida XD.\n\nAdemás de eso, por ese caso me pidieron disculpas públicamente por el foro, y además la gente que moderaba en ese entonces no es la misma de ahora.\n\nAdemás de eso no dije que esté o no de acuerdo, solo aclaré un punto que dijiste mal.\n\nPor último al estar conectado por interno muchas veces nos comentan porque fue baneado tal o como es el proceso de baneo, y realmente no es tan sencillo ser mod. Muchas veces tienen que evaluar post en el límite de si está bien o está mal, es realmente difícil.\n\nTené en cuenta que el foro es 100% a mano el baneo.","replies":[{"poster":"exrex","date":"2017-02-09T12:16:32.146+0000","up_votes":2,"down_votes":0,"body":"A vos solo te pidieron disculpas despues de haber espameado el foro, y yo te habia ayudado para que te contestaran. \n\nNo lo dije mal, vos bien sabes que es aproposito. el soporte no te va a contestar hasta que se te pase el ban, y lo puede asgurar cualquiera que le haya pasado. antes y ahora.  y obviamente, la respuesta es un copy paste. ","replies":[{"poster":"rokushoger","date":"2017-02-09T12:51:56.128+0000","up_votes":2,"down_votes":3,"body":"Si, eso es cierto. \n\nIgualmente ya no quedan mods del foro viejo, es toda otra gente la que está ahora, así que es lo que digo, no tiene sentido traer cosas del foro viejo a lo que pasa ahora.","replies":[{"poster":"exrex","date":"2017-02-09T13:24:31.668+0000","up_votes":6,"down_votes":0,"body":"Tambien cambiaron los rioters, eso no significa nada chabon. \nY antes estaban los \"ayudantes\" (verdes) en vez de los \"voluntarios\", y vos te acordaras cuando los ayudantes y mister candanga descaradamente decian que estaba todo perfecto, que era un trabajo excelente para despues terminar admitiendo que los usuarios tenian razon y que los mods se habian pasado. pero claro, todo esto dicho despues de haber cambiado de foro. \n\nY sir dal me quito del historial mucho de los bans de los mods que hoy ves aca. No fueron los de soporte que me mandaron a leer las normas, ni los mods que se escondian cada vez preguntaba por que me habian baneado por haber dicho la marca de una gaseosa,  fue un rioter que pasa cada muerte de obispo, \nEso no es justo para nadie y yo ahi no vi cual fue la transparencia, ni la comunicación, ni la renovación como me dice uno por ahí que tiene una cuenta nivel 5.","replies":[{"poster":"rokushoger","date":"2017-02-09T21:56:20.941+0000","up_votes":1,"down_votes":4,"body":"Te vuelvo a repetir que no vale la pena traer cosas del pasado cuando la gente que hay es toda nueva. Es como te le dijera a alguien que es una mier... solo porque el padre fue una mier... totalmente sin sentido. Además, mejor una disculpa tarde que nunca?\n\nPero bueno, si es tu percepción estás en tu derecho de tenerla. Saludos!","replies":[{"poster":"exrex","date":"2017-02-10T07:19:28.151+0000","up_votes":5,"down_votes":0,"body":"No te estoy hablando de hace 5 años capo, te estoy hablando de unos meses, que fue cuando me encontre a sir dal. \n\nY decime esto, dame tu opinion sincera ya que no te gusta perder tiempo del pasado. \nA vos te parece que un amarillo te revise el historial para hacer que los mods te baneen por cosas que dijiste hace un año? \nDecime, te parece logico? te parece normal el comportamiento de este amarillo que parece acoso y de los mods (son los dos que ves comentar aca)?  yo te hablo de hace unos meses, ese fue el tiempo que ya deje de participar ya. \nTus mods junto a tu amigo se ponen a banear personas que los critican por cosas que dijeron hace un año. un año chabon. \nYo te hablo de hace unos meses y no me daban ni la hora... ni el soporte, ni los mods ni excalibeer, nada mas sir dal que lo reviso al toque, ahi no mas. y decis que no importa que ya paso? \nTe repito, te banean por cosas que dijiste hace un año y dicen que pueden hacerlo si encuentran cosas que hayas dicho desde la creacion de este foro, entonces a mi no me podes decir que lo que paso hace unos meses no cuenta y que no vale, porque a ellos cuando les conviene si cuenta. \n","replies":[{"poster":"rokushoger","date":"2017-02-10T20:27:02.412+0000","up_votes":1,"down_votes":6,"body":"Si tenés un problema con otro amarillo arreglalo con él, te aclaré un punto de lo que dijiste nomás, te sirve bien no te sirve no hay drama, be happy.","replies":[{"poster":"Toramaru1","date":"2017-02-11T04:18:00.770+0000","up_votes":3,"down_votes":0,"body":"EXREX tiene toda la razon y hasta me tome el tiempo de leer el post tuyo del 2014, que paso con tigo amigo, el tipo que estab ahi, que escribio ese post es alguien que defiende su derecho a expresarse, EXREX  esta haciendo exactamente lo mismo ahora, hay muchas cosas en este foro que estan funcionando mal y muchos que se aprovechan de sus derechos para desacerse de los que decimos la verdad sin tapujo, con respeto, sin insultos, pero la verdad de los errores que pasan tanto en el foro como a nivel de soporte tambien, y tengo un baneo en una de mis cuentas hasta el 22 de febrero, intente dialogar buscar que me explicaran el motivo, que me dieran una prueba al menos, pero 0 colaboracion por parte de riot, realmente no se si hable con una persona al exponer todos mis motivos o si era un bot, porque la respuesta era practicamente la misma siempre y al final de todo me ponian siempre superalo y sigue adelante amigo, eso suena mas a tomada de pelo que a otra cosa realmente un desastre, y aunque como tu dices los baneos son 100% a mano, creo que hay veces que si te detienes 5 minutos a leer los argumentos que te pone quien se esta quejando por el baneo puedes diferenciar entre quienes hablan con motivo y razon y quienes hablan por hablar, ademas me parece que es un derecho basico, yo salgo de mi casa mato a alguien y no me caen automaticamente 30 años, voy a un juicio en el cual se esponen las pruebas de ambos lados y finalmente alguien imparcial decide, creo que deverian de hacer eso cuando alguno de nosotros nos quejamos por un baneo,  por un  lado el que resivio el baneo por otro el modulador que dio el baneo, y que un tercero o terceros evaluen y decidan, creo que hay mucha cosas que se pueden mejorar, y que muchos miembros de la comunidad al igual que nosotros proponen muchas ideas, pero riot suele hacer la vista gorda a esos comentarios, no pueden tapar el sol con un dedo, y creo que es hora de empesar a hacerle frente a los problemas, y apollarse en la comunidad para eso, que si es por ayudar, hay muchos que con gusto lo haremos.","replies":[{"poster":"rokushoger","date":"2017-02-12T21:08:48.851+0000","up_votes":1,"down_votes":0,"body":"En ningún momento dije que no pueda quejarse, de hecho es productivo que haya quejas.\n\nLo que aclaré simplemente es que no podemos saltarnos el ban con una smurf, porque según las reglas del foro eso también es motivo de ban, y antes que alguien tenga un baneo al santo botón lo advertí, es tan difícil eso de entender?\nNadie dice que no se queje, le dije que si tiene un ban y quiere hacer un reclamo que lo haga por soporte, si la solución no satisface luego puede ir y realizar el reclamo via foro si quiere, está en su derecho, pero luego que se quite el ban, o estaría violando las reglas y capaz se come un ban al santo botón.\n\nDel 2014 para acá todo cambió, el foro, los mods, la gente, todo, actuar de la misma manera siempre es ser necio, hay que adaptarse a las situaciones y actuar en consecuencia.\n\nErrores en los baneos va a haber ahora y siempre mientras las personas que banean lo hagan a mano, porque son personas y humanos, y los humanos podemos malinterpretar o equivocarnos, todos, vos, yo, los rioters, los mods, etc. En el juego es más difícil que haya errores porque hay una máquina por detrás, y aún así ni siquiera es un sistema perfecto y ha habido casos, como esperan entonces que los tipos no se equivoquen?\nMi caso en ese momento fue un error, rompí los quinotos en el foro porque la respuesta de soporte fue pauperrima, pero lo hice luego del ban, no durante el mismo. Y si, recibí una disculpa, y listo.\n\n> ademas me parece que es un derecho basico, yo salgo de mi casa mato a alguien y no me caen automaticamente 30 años\n\nY esto porque es así? Porque el país tiene una serie de normas llamadas leyes que así lo establecen, y que, al formar parte del país, te guste o no tenés que cumplir. \nEn el caso de Riot está los términos de servicio, que son esa cosa a la que le diste si acepto, y que establece claramente que Riot tiene derecho a banearte cuando ellos quieran sin deberte explicaciones. Es feo eso? Si, pero es también lo que nos protege de flamers, trolls, y afk, yo prefiero eso y poder jugar relativamente tranquilo, y aún así hay bastante porquería para limpiar, imagínate si eso no estuviera!\nAdemás imagínate que tu tuvieras un kiosko, y mañana entra un cliente y te dice \"sabés que no me gusta que vendas el alfajor a 15 pesos (o lo que sea acorde a tu país, acá en uruguay es maso ese precio), voy a llamar a un juez imparcial para debatir el precio y tu ganancia no me interesa\", no está bueno no?","replies":[{"poster":"Toramaru1","date":"2017-02-13T04:15:29.903+0000","up_votes":1,"down_votes":0,"body":"Es cierto, en todos los paises hay leyes que hay que respetar, pero te recuerdo que esos paises son democraticos, por lo tanto el poder es del pueblo, y esas leyes se modifican de continuo, existen herramientas, como el referendum que le permiten al pueblo alzar su vos si consideran que algo en esas leyes esta mal, y modificarlas, el punto es ese, aunque los que gobiernan son pocos el pueblo siempre estara atras para asegurarse de que esos pocos hagan las cosas bien, eso es una democracia, y en la democracia las leyes de hoy no son las mismas de hace 20 años atras, pero de todas formas el sistema de el juego nunca se rejira asi, de una forma democratica, mas bien es como una monarquia en donde existe un poder sin un controls, como lo son los terminos de servicio de riot que no contemplan ninguna posibilidad de modificacion porquienes los deven respetar y conocer a diario que son los usuarios, de todas formas, lo se por experiencia que muchas veces estas quejas terminan callendo en sao roto, y este tiempo escribiendo  termina siendo un sinsentido, asi que siemplemente dire que hay mucho por mejorar, y que antes de intentar retrucar se tendria que ver que se puede ideas utiles se pueden sacar de las opiniones de los usuarios.\nP.D: sobre lo del kiosco no estas muy lejos de la realidad, el estado que es un juez imparcial se encarga de moderar y asegurarse de que los precios de los preoductos sean acordes, no lo hacen con el kioskero pero si con los productores de lo que vende el kioskero, muchas veces cuando los precios se disparan el gobierno se reune con los empresarios para analizar que se puede hacer con relacion a esos precios, y el estado es un juez imparcial entre la empreza que produce ese alfajor y el niño que lo va a comprar al almacen, un juez imparcial que vela tanto por la ganancia de la fabrica como por un precio justo para el niño","replies":[{"poster":"Toramaru1","date":"2017-02-20T00:09:04.777+0000","up_votes":1,"down_votes":0,"body":"Pues entonces, por lo visto, soy el unico desgraciado que cada vez que se ha quejado por algo a riot, o le a propuesto algo no recibe respuesta, o de lo contrario recivo respuestas defensivas o del tipo respuesta robot, asi que bueno tendre que mejorar mi suerte para poder \"comuicarme\" con riot de una forma decente.\nViva la moraquia de RIOT!!!!!","replies":[]}]}]}]},{"poster":"exrex","date":"2017-02-11T09:30:58.790+0000","up_votes":2,"down_votes":0,"body":"Alta lavada de manos. Antes no te quedabas callado y opinabas sobre lo que estaba bien y mal, ahora opinas sobre lo que esta mal pero de los usuarios. Y si hay un problema, es del usuario y no del amarillo acosador o de los mods que hacen mal su trabajo.\nTene un poco de respeto a vos mismos y la proxima ni te aparezcas por estos post asi como lo hicieron los demas amarillos que no se la jugaron. \nUsuarios comunes dicen que son... los usuarios comunes no tienen miedo a comentar.","replies":[{"poster":"rokushoger","date":"2017-02-12T21:19:40.990+0000","up_votes":1,"down_votes":3,"body":"Por que no revisas mi perfil de foros y te fijas en lo que respondí a lo de la \"isla de los condeandos\" de Riot? Stalkeas para lo que te conviene, así no se juega.\nDe hecho eso mismo lo plantee por interno, y ni la hora me dieron, la diferencia es que ahora cuando algo me molesta puede que haga o no post en el foro según la gravedad, pero puedo quejarme en vivo y en directo, y por eso ves menos quejas mías, pero claro, es más fácil y cómodo quedarte con lo malo que plantearte otras posibilidades.\n\nLavada de manos no, estás discutiendo conmigo de un problema que tuviste con otros mods, u otros amarillos (vaya a saber quien) como si yo fuera un maestro de escuela que puede ir y regañarlos XD que eso man? Acá se supone que estamos todos grandecitos como para andar con \"pepito me hizo tal cosa\" no te parece? Y todo eso se derivó de una aclaración cualquiera y genérica sobre que no se puede saltar un ban con una smurf, algo que es de sentido común y que te lo digo para que el día de mañana no te baneen, y me saltas con una sarta de cosas de hace tres años atrás?\n\nComo le dije al otro, tenés todo el derecho de reclamar por foro cuando se te pase el ban, de hecho yo lo he hecho varias veces para dejarlos pegados, nadie dice que no lo hagas.\nTambién le dije al otro usuario que errores va a haber siempre que sean humanos quienes hacen baneos, ya podrás leer eso en el post de arriba, que más querés que te diga? Que insulte a Riot? Que putee? Que te insulte a vos? para que luego digan \"mirá lo que dice este amarillo\" como ya lo dicen ahora? No voy a entrar más en este forobardo barato. Querés errores de Riot a mi gusto? Mirá:\n\n-Sacar las reclutamiento normales\n-Bajar la exp. necesaria para llegar a 30.\n-Poder rankear ni bien llegues a 30 (le pondría límite a esto tipo tantas partidas ganadas o algo así)\n-La tolerancia ante los troll, flamer y afk (podrían ser castigos más directos).\n-La poca claridad que hay en los motivos de reporte, y el no sacar videos informativos más seguidos sobre dicho tema con lo importante que es que todos reportemos bien.\n-Que le den poca bola al foro en cuestiones técnicas (onda siguen en beta...)\n\nNo se que más querés que te diga, para mí el foro en cuestión de moderación está bastante correcto, por lo que veo día a día. Vos me decís este caso tuyo? Pelealo, si lo hubiese visto lo hubiese pasado por interno para revisión como hago con todos los que veo que pueden tener razón.","replies":[{"poster":"exrex","date":"2017-02-13T14:42:08.916+0000","up_votes":1,"down_votes":0,"body":"Esta tan bien la moderacion para vos que ayer excalibeer dijo que no compartia la actitud de uno de los  mod que comento en este post.  y seguis diciendo que todo esta perfecto. excelente. se nota la objetividad.","replies":[{"poster":"rokushoger","date":"2017-02-13T20:33:16.962+0000","up_votes":1,"down_votes":0,"body":"No dije que todo está perfecto. Si lees lo que puse habrías notado que puse algo así como \"todos podemos cometer errores, somos humanos\", vos también estás incluído, y yo, y todos.","replies":[]}]}]},{"poster":"Toramaru1","date":"2017-02-12T01:34:12.247+0000","up_votes":1,"down_votes":0,"body":"te dejo mi like amigo, te lo mereces, hay que hablar sin tapujos {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Feedeo con Salsa","date":"2017-02-09T11:36:11.870+0000","up_votes":3,"down_votes":1,"body":"Me borraron un comentario y me dieron notificacion por que puse que la colo de paladins estaba mas buena :c\nHablando de la colo de Actualizando... 7.3, me agrada.. pero era un comentario machista inofensivo :c no queria hacer sentir mal a un miembro de riot y mucho menos que le llegue a la anfitriona del video, esto.","replies":[{"poster":"Forero","date":"2017-02-09T12:08:00.305+0000","up_votes":1,"down_votes":11,"body":"> era un comentario machista inofensivo\n\nPero machista al fin y al cabo, podias decirlo de otra forma, pero el \"esta màs buena\" lo vulgariza.","replies":[{"poster":"Ch4puLin","date":"2017-02-09T12:34:39.528+0000","up_votes":9,"down_votes":0,"body":"Decir que alguien está bueno/a es machista?\nBleh","replies":[{"poster":"Forero","date":"2017-02-09T12:46:24.136+0000","up_votes":1,"down_votes":9,"body":"Fue una comparación. A modo personal uno puede pensar lo que quiere, pero en un lugar publico hay formas para decir, y otras que no (Asi como no se acepta un mensaje todo en mayúsculas).\n\nY el comentario podía salirse del tema principal de la noticia, que era el contenido del vídeo.","replies":[{"poster":"Feedeo con Salsa","date":"2017-02-09T15:15:59.771+0000","up_votes":10,"down_votes":0,"body":"Bien entonces..\n\nLa chica que dirije las reviews de las versiones del juego paladins tiene mejor personalidad, su cabello es de color puro naranja pelirojo, no actua \"TANTO\" como la que tenemos en este juego y se hace notar su profesionalidad.","replies":[{"poster":"Toramaru1","date":"2017-02-12T01:39:40.048+0000","up_votes":1,"down_votes":0,"body":"al final ya todo lo que se comenta es machismo, racismo, etc, parece que se criaron en un apartamento, que nunca tuvieron calle, que nunca salieron a jufar al futbol al campito de la esquina, es como si no tuvieran una vida, todo siempre esta mal, creo que llega un punto en que exageran mal, porque o me creo que los moderadores que banean nunca hayan dicho que una mujer esta buena, que son? un {{champion:10}} ?","replies":[]}]},{"poster":"masterdragon02","date":"2017-02-11T03:07:41.221+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Forero,realm=LAS,application-id=v7qsfXsE,discussion-id=ir5d9WTc,comment-id=0007000000000000,timestamp=2017-02-09T12:46:24.136+0000)\n>\n> Fue una comparación. A modo personal uno puede pensar lo que quiere, pero en un lugar publico hay formas para decir, y otras que no (Asi como no se acepta un mensaje todo en mayúsculas).\n> \n> Y el comentario podía salirse del tema principal de la noticia, que era el contenido del vídeo.\n\na mi me han dejado con una pregunta porque yo soy mucho de insutar en broma(y aclararlo y dejar disculpas si moleste a alguien y a veces no se si me fui mucho/insulte mucho o si simplemente el humor negro no se usa en este foro","replies":[{"poster":"Forero","date":"2017-02-11T03:20:26.212+0000","up_votes":1,"down_votes":0,"body":"Pues mientras se tome como una broma no es que sea malo, lo importante es que no ofenda o sea muy molesto o denigrante para alguien.  Pero si con un comentario la gente se ríe, no denuncia, y se toma con humor sin que busque principalmente ofender, pues no va en contra de la normas.\n\n\nEl humor negro es mal visto por aquí, hacer por ejemplo bromas sobre la esclavitud, Hitler u otros hechos así es delicado, es mejor no hacerlo para no tener problemas.","replies":[{"poster":"masterdragon02","date":"2017-02-11T03:31:06.886+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Forero,realm=LAS,application-id=v7qsfXsE,discussion-id=ir5d9WTc,comment-id=000700000000000000010000,timestamp=2017-02-11T03:20:26.212+0000)\n>\n> Pues mientras se tome como una broma no es que sea malo, lo importante es que no ofenda o sea muy molesto o denigrante para alguien.  Pero si con un comentario la gente se ríe, no denuncia, y se toma con humor sin que busque principalmente ofender, pues no va en contra de la normas.\n> \n> \n> El humor negro es mal visto por aquí, hacer por ejemplo bromas sobre la esclavitud, Hitler u otros hechos así es delicado, es mejor no hacerlo para no tener problemas.\n\ncon razon alex no entra a los foros","replies":[]}]}]}]}]}]}]},{"poster":"Icesoul","date":"2017-02-09T10:32:38.255+0000","up_votes":12,"down_votes":5,"body":"Cuando leí esto deje de leerlo\n\"¡Que den la cara! : que el moderador que haya borrado el comentario de un usuario, en el reporte que te llega de notificación, diga que moderador es, su nombre en el foro y su número de matrícula. A ver si ahí se hace el macho\"\n\nEn que va a favorecer eso? En nada, ni te va ni te viene quien te borro lo que hayas colgado en el foro, que muestre la cara y se haga el macho? Para un poco...","replies":[{"poster":"masterdragon02","date":"2017-02-11T03:17:08.566+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Icesoul,realm=LAS,application-id=v7qsfXsE,discussion-id=ir5d9WTc,comment-id=0005,timestamp=2017-02-09T10:32:38.255+0000)\n>\n> Cuando leí esto deje de leerlo\n> &quot;¡Que den la cara! : que el moderador que haya borrado el comentario de un usuario, en el reporte que te llega de notificación, diga que moderador es, su nombre en el foro y su número de matrícula. A ver si ahí se hace el macho&quot;\n> \n> En que va a favorecer eso? En nada, ni te va ni te viene quien te borro lo que hayas colgado en el foro, que muestre la cara y se haga el macho? Para un poco...\n\nno apoyo lo de que muestre la cara y se haga el macho\npero en lo que se refiere a legal se supone que en una tienda si te atienden mal podes preguntar quien te atiende y denunciar tu caso y me gustaria que fuese asi le daria mas seriedad al foro","replies":[]}]},{"poster":"Ch4puLin","date":"2017-02-09T12:32:02.439+0000","up_votes":6,"down_votes":0,"body":"Totalmente de acuerdo. La falta de capacidad de los moderadores hizo que deje de participar en el foro.\nRecuerdo también que una vez escribí una respuesta usando solo los términos \"bobo\" y \"malote\" (que son los mismos que usaban ellos en el mensaje copy-paste de ban. Lo borraron y me banearon otra vez. De eso entendí que ellos pueden usar términos y nosotros no.","replies":[]},{"poster":"Zesc","date":"2017-02-09T19:46:14.012+0000","up_votes":2,"down_votes":0,"body":"hay moderadores?, pensé que solo eran ñoquis.....","replies":[{"poster":"7overtherainbow7","date":"2017-02-09T19:50:15.843+0000","up_votes":2,"down_votes":4,"body":"***","replies":[{"poster":"Zesc","date":"2017-02-10T15:05:17.020+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=7overtherainbow7,realm=LAS,application-id=v7qsfXsE,discussion-id=ir5d9WTc,comment-id=000e0000,timestamp=2017-02-09T19:50:15.843+0000)\n>\n> O sea que si yo no existo, quien esta respondiendo ahora?.\n> O los ñoquis aprendieron a escribir?\n> http://www.reactiongifs.com/wp-content/uploads/2013/10/tim-and-eric-mind-blown.gif\n\nEl ñoqui es alguien que ocupa un cargo en el cual no hace nada, básicamente es un mantenido en donde legalmente parece que trabaja pero en realidad no lo hace. Pensé que por ahi no sabias lo que era un ñoqui, te o explico.","replies":[{"poster":"7overtherainbow7","date":"2017-02-10T18:50:58.980+0000","up_votes":3,"down_votes":6,"body":"Hay países donde los ñoquis son de papas y se comen, así que gracias por la aclaración.","replies":[{"poster":"Zesc","date":"2017-02-10T19:51:07.930+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=7overtherainbow7,realm=LAS,application-id=v7qsfXsE,discussion-id=ir5d9WTc,comment-id=000e000000030000,timestamp=2017-02-10T18:50:58.980+0000)\n>\n> Hay países donde los ñoquis son de papas y se comen, así que gracias por la aclaración.\n\n:/ es triste sos moderador y actúas de esta manera solo refleja lo mal que esta este foro.","replies":[{"poster":"7overtherainbow7","date":"2017-02-10T20:23:27.097+0000","up_votes":3,"down_votes":4,"body":"Insisto en agradecerte la aclaración ya que desconocía esa interpretación para la palabra \"ñoqui\".\nMe gustaría que pudieras decirme que fue lo que te pareció mal acerca de mi actitud (solo si quieres), así podre tener una idea acerca de que aspectos mejorar para una próxima conversación.\nEstaré atento a tu respuesta\n¡Saludos!","replies":[{"poster":"Zesc","date":"2017-02-11T03:55:27.557+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=7overtherainbow7,realm=LAS,application-id=v7qsfXsE,discussion-id=ir5d9WTc,comment-id=000e00000003000000000000,timestamp=2017-02-10T20:23:27.097+0000)\n>\n> Insisto en agradecerte la aclaración ya que desconocía esa interpretación para la palabra &quot;ñoqui&quot;.\n> Me gustaría que pudieras decirme que fue lo que te pareció mal acerca de mi actitud (solo si quieres), así podre tener una idea acerca de que aspectos mejorar para una próxima conversación.\n> Estaré atento a tu respuesta\n> ¡Saludos!\n\nmmmm, bueno primero cuando estas comentando en un post en donde habla gente que esta desconforme con la forma en que trabajan los moderadores, te recomiendo que te presentes con un nivel de formalidad decente, porque sos un moderador y justamente la gente esta desconforme con tu trabajo, es decir sin memes, sin respuestas con la intension de dar chistes, nada.\n\nHacerse el sofista con el tipo de respuestas que haces buscando errores del tipo de redacción y lógica en las premisas, con el objetivo de evadir una respuesta sincera no sirve, es mejor no comentar.\n\nEJ :\n \n> Hay países donde los ñoquis son de papas y se comen, así que gracias por la aclaración.\n\n\"Hay países en donde los ñoquis son de papas y se comen\", completamente de mas, no va a ningún lado, una obviedad terrible que solo busca evadir una respuesta sincera. Podrías haber dicho, \n\n\"perdón por mi tipo de respuesta, no había entendido el termino de la palabra, gracias por la aclaración.\", no es un poquito mejor?.\n\nEj-2:\n\n> Y después quien modera, los ñoquis?\n> Oh wait!\n\nEsta respuesta es inútil no lleva a ningún lado, es burlarse de las personas que están esperando una posible respuesta de algún moderador. Esta es una respuesta la cual quiere evadir las cosas que se cuestionan en el post, cosas como:\n\n1. Se analiza el contexto de los comentarios en el post?\n2. Porque no generan advertencia a personas que posiblemente no saben que están cometiendo una infracción?\n3. Porque son subjetivos a la hora de banear a diferentes usuarios?, sino son subjetivos cuales son los motivos?, porque no aplica a todos por igual?\n4. Porque hay tanto spam sobre comentarios y temas?\n\nEntre otras posibles cuestiones que se plantean en el post.\n\nQue no te des cuenta de tus errores hace mas grave todo el asunto, ojala puedas leer este comentario y también estoy abierto a cualquier respuesta.\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"Toramaru1","date":"2017-02-13T03:47:01.154+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=eyGFz-zIjHE\nMira este video, y entenderas porque muchos jamas piensan que un ñoqui sea una persona vaga, de hecho hace unas semanas comi ñoquis, y por ahora no soy canibal, es cuestion de diferencia de dialetos, solo hay uno o dos paises en america latina que tienen un español bastante neutro","replies":[{"poster":"Zesc","date":"2017-02-13T21:53:44.057+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Toramaru1,realm=LAS,application-id=v7qsfXsE,discussion-id=ir5d9WTc,comment-id=000e0000000300000000000000010001,timestamp=2017-02-13T03:47:01.154+0000)\n>\n> https://www.youtube.com/watch?v=eyGFz-zIjHE\n> Mira este video, y entenderas porque muchos jamas piensan que un ñoqui sea una persona vaga, de hecho hace unas semanas comi ñoquis, y por ahora no soy canibal, es cuestion de diferencia de dialetos, solo hay uno o dos paises en america latina que tienen un español bastante neutro\n\n..... Si yo me di cuenta de eso y le explique que era.... lo que no es una diferencia de dialecto de habla hispana es que el ñoqui es una comida....","replies":[]}]},{"poster":"EH AMEO KE TE PA","date":"2017-02-11T15:19:36.283+0000","up_votes":1,"down_votes":0,"body":"+10.","replies":[]}]}]}]}]}]},{"poster":"Nuke","date":"2017-02-09T21:10:24.534+0000","up_votes":3,"down_votes":3,"body":"No hagas caso papu, sigan haciendo su trabajo u.u\n\nPD: Me dio hambre, dejame comerte v:","replies":[{"poster":"7overtherainbow7","date":"2017-02-10T01:21:27.918+0000","up_votes":2,"down_votes":4,"body":"http://i.imgur.com/qy2w0Lh.png?noredirect\n\nY después quien modera, los ñoquis?\nOh wait!","replies":[{"poster":"Nuke","date":"2017-02-10T01:25:30.526+0000","up_votes":3,"down_votes":0,"body":"Todos los que tienen color en el nombre, sacan estas pegatinas super buenas. Como la de Fiddles, la de Vi, la de Taric, esta de Zed... Simplemente hermoso *-* tienen mucha personalidad.","replies":[]}]}]}]}]}]}