{"poster":"Yasuo H1zi","date":"2017-03-17T20:42:43.102+0000","title":"High Ping nur in LoL","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Habe seit l&auml;ngerem das ich einen Konstanten Ping von 125 habe, der sich kein st&uuml;ck &auml;ndert, und das ist NUR in LoL, habe meinen Router, PC, LoL Clienten neugestartet aber es &auml;ndert sich &uuml;berhaupt nichts!!!\r\n\r\nWie fixx ich die schei&szlig;e{{summoner:11}} \r\ntilted af, bekomme bestimmt wegen soner schei&szlig;e leaverbuster, unspielbar.\r\nbin echt am &uuml;berlegen ob ich den Server wechsel da EUW nur noch dreck ist","replies":[{"poster":"legofreak1","date":"2017-03-17T20:48:18.741+0000","up_votes":2,"down_votes":0,"body":"Folgende Dinge können bei Pingproblemen meistens helfen:\n\n- Nutze testweise LAN statt WLAN.\n- Starte deinen Router neu (Strom raus, 5 Min warten, Strom wieder rein)\n- Such nach neuer Firmware für deinen Router und installiere diese falls vorhanden\n- Mach einen [Speedtest](http://www.speedtest.net/). Ist das Ergebnis deutlich niedriger als das, was du bezahlst, ruf bei deinem ISP an.\n- Der Support hat einen sehr ausführlichen Artikel zu Verbindungsproblemen, geh diesen bitte durch:\nhttps://support.riotgames.com/hc/de/articles/201752664-Fehlerbehebung-bei-Verbindungsproblemen\n- Spiel nicht zu Peak-Zeiten. Also dann, wenn außer dir niemand bei dir zu Hause im Internet ist und es nicht zwischen 16:00 und 22:00 ist. Es geht auch getrennt, das eine ist dazu dar, um Überlastung von deiner Seite auszuschließen, das andere um Überlastung von ISP auszuschließen.\n- Führe keine großen Up-Downloads im Hintergrund aus. Diese können bei niedrigem Durchsatz der Leitung auch zu Problemen führen. Schließ also am besten alle Hintergrundprogramme, die eine Internetverbindung benötigen.\n\n\nWenn du diese Liste durchgegangen bist und immer noch Probleme hast oder einfach weiterführende Hilfe benötigst, lass bitte während eines Spiels mit Problemen Pingplotter im Hintergrund laufen und stelle das Log hier zur Verfügung:\n\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> https://www.pingplotter.com/download.html\n> Um ein Log zu erstellen, ladet das Programm bitte runter und stellt es dann folgendermaßen ein:\n> * Interval: 1 second\n> * Focus: all\n> * Target Name: 185.40.65.1\n>\n> Startet das Programm dann über den grünen Button oben links und lasst es laufen, während ihr im Spiel seid.\n> Wenn während des Spiels Probleme aufgetreten sind, ist das Log verwertbar und kann folgendermaßen im Forum geteilt werden:\n> * Edit -> Copy as Text\n> * Geht nach [Pastebin.com](http://Pastebin.com)\n> * Fügt das kopierte Log unter \"New Paste\" ein und klickt auf \"Create new Paste\"\n> * Kopiert den Link zum Log auf Pastebin aus der Adressleiste und fügt diesen in euren Forenpost ein.\n>\n> Fügt bitte außerdem das [Netlog](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/X3waeihA-wrenchmens-toolbox-lasungen-zu-bekannten-problemen-und-fehlern?comment=0000) dieses Spiels ein.","replies":[{"poster":"Kainp94","date":"2017-03-17T21:41:38.416+0000","up_votes":1,"down_votes":0,"body":"Guten Abend,\n\nIch habe exakt das selbe Problem und habe jetzt mal per Pingpotter eine Log erstellt, ich hoffe es richtig. (Router 20min vom Netz genommen, PC Neustart, nichts hat wirklich geholfen)\n\n\n  Target Name: 185.40.65.1\n         IP: 185.40.65.1\n  Date/Time: 17.03.2017 22:03:35 - 17.03.2017 22:34:29\nHop  Sent  PL%    Min      Max     Avg  Host Name / [IP]\n  1  1843    0   0,13    14,43    0,70  192.168.0.17 [192.168.0.17]\n  2  1843    0  12,00   324,60  203,55  83-169-183-12-isp.superkabel.de [83.169.183.12]\n  3  1843    0  12,17    39,46   18,51  ip5886cb67.static.kabel-deutschland.de [88.134.203.103]\n  4  1843    0  12,19    37,24   18,11  ip5886eb34.static.kabel-deutschland.de [88.134.235.52]\n  5  1843    0  19,85    55,81   26,68  ip5886ca01.static.kabel-deutschland.de [88.134.202.1]\n  6  1843    0  27,08    52,66   34,23  ip5886caa3.static.kabel-deutschland.de [88.134.202.163]\n  7  1786   94  34,07  2535,03  157,49  80.249.211.66 [80.249.211.66]\n  8  1840  100      0        0       0   [-]\n  9   890    2  31,09   123,51   70,00  104.160.141.103 [104.160.141.103]\n 10   875    3  30,84   129,10   69,94  104.160.141.107 [104.160.141.107]\n 11   897    1  23,76    98,13   31,29  10.31.246.118 [10.31.246.118]\n 12  1840  100      0        0       0   [-]\n 13  1840  100      0        0       0   [-]\n 14  1840  100      0        0       0   [-]\n 15  1840  100      0        0       0   [-]\n 16  1840  100      0        0       0   [-]\n 17  1840  100      0        0       0   [-]\n 18  1840  100      0        0       0   [-]\n 19  1839   50  26,80   127,38   67,62  185.40.65.1 [185.40.65.1]\n\n\nUnd bei dem zweiten game war der Ping höher\n \nHop  Sent  PL%    Min      Max     Avg  Host Name / [IP]\n  1   550   47   0,01    12,53    0,74  192.168.0.17 [192.168.0.17]\n  2   552    0  11,31   313,10   20,33  83-169-183-12-isp.superkabel.de [83.169.183.12]\n  3   552    0  12,43    30,18   18,10  ip5886cb67.static.kabel-deutschland.de [88.134.203.103]\n  4   552    0  11,28    28,80   17,70  ip5886eb34.static.kabel-deutschland.de [88.134.235.52]\n  5   552    0  19,93    41,09   26,19  ip5886ca01.static.kabel-deutschland.de [88.134.202.1]\n  6   552    0  27,86    46,87   34,03  ip5886caa3.static.kabel-deutschland.de [88.134.202.163]\n  7   550   95  29,00  1717,57  134,74  80.249.211.66 [80.249.211.66]\n  8   550   96  57,12  1881,37  795,04  104.160.141.44 [104.160.141.44]\n  9   268    0  24,00   230,65   53,74  104.160.141.101 [104.160.141.101]\n 10   265    0  27,93   234,38   57,47  104.160.141.105 [104.160.141.105]\n 11   552   54  24,60   364,81   58,01  185.40.65.1 [185.40.65.1]","replies":[{"poster":"legofreak1","date":"2017-03-18T20:04:30.004+0000","up_votes":2,"down_votes":0,"body":"Im zweiten Log weist dein Router hohen Packetloss auf, das muss aber nichts heißen, da die Verbindung danach vernünftig weitergeht. Das Netlog des Spiels wäre noch interessant, das könnte Aufschluss über den zeitlichen Verlauf des Pings geben.\nDa du außerdem Kabelkunde bist, geh bitte einmal auf folgende Website und lass den Test durchlaufen:\nhttp://ipv6-test.com/\nWenn deine Verbindung über Dualstack läuft, lass diese auf reines IPv4 umstellen, das behebt oft einige Verbindungsprobleme.","replies":[{"poster":"Kainp94","date":"2017-03-18T23:08:04.164+0000","up_votes":1,"down_votes":0,"body":"Erstmal Danke für die Antwort! :)\n\n\nAuf http://ipv6-test.com/ wurden mir folgende Probleme angezeigt:\n\n1. Get a reverse DNS record\n> There is no reverse DNS record to associate your IPv6 address with a host name. Reverse DNS records are required by some Internet protocols and are usually managed at the ISP level.\n\n2. DNS6 + IP6  Unreachable\n\nIch habe ehrlich gesagt nicht so viel Ahnung was eine Reverse DNS ist bzw wie man das erste Problem behebt.\nIch denke Problem Nr. 2 hängt mit dem ersten zusammen obwohl beim zweiten mal aktualisieren stand dort \"DNS6 + IP6 Reachable\" und beim dritten mal wieder nicht. \n\n\nHab das Modem CH6640E und leider lässt sich es nicht in den Einstellungen auf Ipv4 umstellen. Ist es möglich bei KD / Vodafone anzurufen und auf Ipv4 umstellen zu lassen?","replies":[{"poster":"legofreak1","date":"2017-03-19T11:06:28.868+0000","up_votes":1,"down_votes":0,"body":"Zum Umstellen deiner Leitung müsstest du bei deinem Internetanbieter anrufen. Wenn du mit dem Ergebnis des Tests nichts anfangen kannst, dann mach einfach einen Screenshot davon, und poste diesen hier.","replies":[]}]}]}]}]},{"poster":"Yasuo H1zi","date":"2017-03-17T20:57:36.375+0000","up_votes":1,"down_votes":1,"body":"wie gesagt, alles schon gemacht.\nes hilft alles nichts, hab auf EUNE 30 Ping aber auf EUW konstant 125\n* Pingplotter auch schon gemacht\n*² LoL ist so unspielbar, also bringt mir das nichts das während des Spieles laufen zu lassen bis das Spiel vorbei ist, tue ich mir nicht an.","replies":[{"poster":"legofreak1","date":"2017-03-17T21:02:08.518+0000","up_votes":1,"down_votes":0,"body":"Wenn das immer auftritt, würde es für Pingplotter auch ein Customgame tun. Bleib aber bitte mindestens 10 Minuten im Spiel, damit das Log aussagekräftig ist.\n\nWenn du antwortest, dann nutze bitte die \"Antworten\"-Funktion des Forums, das wahrt die Übersicht und ich bekomm eine Benachrichtigung, dass du geantwortet hast.","replies":[{"poster":"Yasuo H1zi","date":"2017-03-17T21:10:46.108+0000","up_votes":1,"down_votes":1,"body":"Ich kann kein Costum Game beitreten, nach 4 Minuten kommt eine Meldung ich solle meine Internet Verbindung testen.{{item:3070}}","replies":[{"poster":"legofreak1","date":"2017-03-18T20:06:48.476+0000","up_votes":1,"down_votes":0,"body":"Wenn du alle meine Vorschläge sorgfältig durchgegangen bist, aber trotzdem keine Verbindung zum Spiel aufbauen kannst, dann teste bitte, wenn du Kabelinternetkunde bist, ob deine Verbindung über Dualstack läuft. Einen Test dazu findest du hier:\nhttp://ipv6-test.com/\nWenn ja, dann lass dies auf reines IPv4 umstellen. Sollte das nicht helfen oder du kannst weiterhin keine Verbindung aufbauen, wende dich für weiteres Troubleshooting deiner Internetverbindung bitte an den Support deines Internetanbieters.","replies":[]}]}]}]}]}