{"poster":"Sir Wolfud","date":"2014-05-29T22:05:44.777+0000","title":"HP VS IP(k)","up_votes":4,"down_votes":0,"body":"Sziasztok! Kb 1 hónappal ezelőtt merült fel a IP influence points magyar elnevezésének a problémája, mely módosítása nem került be a legutóbbi frissítésbe, mert nem volt rá egyértelmű játékosoknak is megfelelő elnevezés.\r\nRemélem ez pontot tesz az ügy végére. :D","replies":[{"poster":"Dædalus","date":"2014-05-30T12:14:19.144+0000","title":null,"up_votes":8,"down_votes":0,"body":"Őszinte leszek, az Idézői pontok nekem nagyon bejön.","replies":[{"poster":"DannyT","date":"2014-05-30T12:34:37.635+0000","title":null,"up_votes":3,"down_votes":0,"body":"+1 Nagyon klassz ötlet! :)","replies":[]}]},{"poster":"Sir Wolfud","date":"2014-06-01T14:12:21.080+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mondjuk szerintem az Impresszió Pontok se rosszak, mert az impresszió hatást jelent :D Vagyis megmaradna a Hatás Pontok, csak Impresszió szóval, és még  IP is lesz belőle.","replies":[]},{"poster":"Böhöm Bika","date":"2014-06-01T08:12:15.252+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem a legjobb lenne az Igazság Pontok amikor mindig azt mondják, hogy irány az igazság mezejére stb... Meg szerintem jobban is hangzik mint a Hatás Pontok vagy az Idézői Pontok","replies":[]},{"poster":"Code name Bullet","date":"2014-05-31T18:46:40.256+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ok. De váltsátok is át... Különben tényleg az a legjobb.","replies":[]},{"poster":"SkipperWasTaken","date":"2014-05-30T11:47:02.244+0000","title":null,"up_votes":1,"down_votes":0,"body":"szerintem igenis fontos lenne, nemrég valaki azon akadt ki, hogy aki vesz csatanövelőt, vagy mit annak a csapata kap 100 hp-t, és azt hitte, hogy életet kapnak\na másik pedig, hogy a játékban nem csak magyarok vannak, és jó lenne ezt egységesen kezlni, mert ha egy angol IP-t mond, akkor az újannan jött játékosok nem értik, hogy mit mond","replies":[]},{"poster":"EGC Shred","date":"2014-05-30T11:22:06.077+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem már teljesen tökmindegy, mire hozzászoktunk hogy hp már minek változtatni?  \nMás lenne a helyzet, ha mondjuk egy hős képessége, vagy egy tárgy neve lenne az átnevezés tárgya, mert azt nem látja mindenki nap mint nap, és nem szokja meg annyira, mint egy olyan dolgot, amit minden nap lát. Részemről maradhat HP.","replies":[]},{"poster":"Looter","date":"2014-05-30T06:18:15.397+0000","title":null,"up_votes":4,"down_votes":4,"body":"Én már annyira elfelejtettem ezt az egész kérdést, hogy rég hozzászoktam.","replies":[]}]}