{"poster":"Sofiˉ","date":"2017-10-19T20:53:50.372+0000","title":"Traslado de aspectos y/o campeones desde cuenta antigua a una nueva, de forma limitada y controlada.","subforum":"Final de temporada","up_votes":0,"down_votes":8,"body":"Traslado de aspectos y/o campeones desde cuenta antigua a una nueva, de forma limitada y controlada.\r\nQuisiera que se agregue el m&eacute;todo de poder trasladar aspectos y/o campeones (tambi&eacute;n iconos, centinelas, etc... si es posible) a trav&eacute;s de una cuenta antigua hacia una nueva. Ya que en mi pa&iacute;s Argentina, si quer&eacute;s comprar cualquier tipo de art&iacute;culo que sea vendido con RP va a ser complicado porque en mi pa&iacute;s el precio de los Riot Points son muy altos. Puedo proponer varias formas de medidas al usar este m&eacute;todo.\r\n\r\n1 - Dependiendo de qu&eacute; aspecto quieras trasladar, ser&aacute; trasladado el campe&oacute;n propietario de ese aspecto escogido.  \r\nEJEMPLO: Si desde tu cuenta antigua trasladas el aspecto de Jhin Luna de Sangre, hacia la cuenta nueva, el campe&oacute;n poseedor de ese aspecto, es decir Jhin, ser&aacute; trasladado preceptivamente hacia la cuenta nueva tambi&eacute;n. \r\n\r\n2 - El m&eacute;todo de traslado de aspectos y/o campeones puede ser gastado como un reembolso. Es decir, si gasto un traslado no podr&eacute; usar un reembolso, dependiendo de cuantos traslados est&eacute;n disponibles y esto var&iacute;a en la cantidad de RP que haya gastado el usuario en su cuenta antigua, osea si el usuario en total gast&oacute; 25.000 RP, ser&iacute;a justo que se a&ntilde;adan m&aacute;s traslados a su cuenta nueva. Esto puede ser usado en otras medidas como la numero 1. \r\n\r\n3 - El control de que este m&eacute;todo no sea abusivo, ser&iacute;a el control desde alg&uacute;n sitio (email) de cada usuario que elige utilizar este m&eacute;todo, que se requiera alg&uacute;n tipo de verificaci&oacute;n desde varios sitios o solo uno que sea confiable. \r\n\r\n4 - El traslado de el aspecto deseado o campe&oacute;n es opcional, es decir si el usuario quiere el aspecto pero no el campe&oacute;n o viceversa es su decisi&oacute;n.\r\n\r\n5 - El traslado debe ser dependiente de los aspectos y/o campeones que posea la cuenta antigua.\r\nEJEMPLO: Si en tu cuenta antigua tienes Jhin el Forajido, no vas a poder trasladarte cualquier otro aspecto de Jhin, que no sea ese. \r\n\r\n&iquest;Por qu&eacute; quiero crear una nueva cuenta? Pueden ser por diferentes factores:\r\n- Me aburr&iacute;, quiero empezar de nuevo.\r\n- Me frustr&eacute;, no puedo ascender de liga.\r\n- Necesito hacer un cambio radical en mi cuenta.\r\n- No estoy conforme con lo que tengo y creo que volver a empezar es m&aacute;s c&oacute;modo que cambiarlo.\r\n- Me permabanearon la cuenta, y he gastado mucho dinero en la misma. \r\n- Quiero cambiar varios aspectos de mi cuenta pero no es posible al ser aspectos irreversibles, y necesito crear una nueva para eso, pero quiero conservar algunos de mi cuenta antigua sin tener que gastar una cantidad alta de dinero.\r\n- X caso quiero contactarme con Riot para estar de acuerdo. \r\n\r\nCreo que es una forma justa de poder conservar elementos de alto valor y no tener que volver a gastar tanto dinero despu&eacute;s de haberte creado una nueva cuenta por X raz&oacute;n.","replies":[{"poster":"Natchin","date":"2017-10-19T20:55:43.401+0000","up_votes":4,"down_votes":0,"body":"No va a pasar. Se presta para crear un mercado negro de venta de skins y con el sistema de botín es super explotable.","replies":[{"poster":"Sofiˉ","date":"2017-10-19T21:02:12.088+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Natchin,realm=LAS,application-id=1kXTbdax,discussion-id=chARsA78,comment-id=0000,timestamp=2017-10-19T20:55:43.401+0000)\n>\n> No va a pasar. Se presta para crear un mercado negro de venta de skins y con el sistema de botín es super explotable.\n\nSé que es poco probable que pase, pero tengo que intentarlo... No puedo crear una nueva cuenta después de haber gastado tanto, necesito hacerlo. Además, ese \"mercado negro\" no puede existir si hay un buen control del sistema de traslado.","replies":[{"poster":"yOCobain","date":"2017-10-20T17:58:13.222+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Łevı,realm=LAS,application-id=1kXTbdax,discussion-id=chARsA78,comment-id=00000001,timestamp=2017-10-19T21:02:12.088+0000)\n>\n> Sé que es poco probable que pase, pero tengo que intentarlo... No puedo crear una nueva cuenta después de haber gastado tanto, necesito hacerlo. Además, ese &quot;mercado negro&quot; no puede existir si hay un buen control del sistema de traslado.\n\nPero cómo lo controlas? \n\nRecaigo en lo que  comentaron del sistema de Botín.  Te haces una cuenta nueva. Empezas a sacar algunas S y ya podes pasar lo que ganes a otra cuenta. \n\nEl sistema deberíatener condiciones como que puedas demostrar que pagaste por las  cosas que tenes para seguirlas teniendo. Eso Haría que sólo puedas trasladar cosas por las cuales hayas pagado.\n\nOtra cosa, cómo separamos \"nueva\" de  \"vieja\"?.  Sólo se me ocurre que en la misma página del LoL tengas una opción de crear otra cuenta asociada al mismo mail. \n\nPor otra parte, se promoveria  mucho el uso de cuentas smurf.  Cosa que se combate hace tiempo. Y los eloboosters? Te Imaginas?\n\nEl caso de cuenta nueva por permaban no lo comparto. La cuenta nueva está bien, pero si perdiste cosas por las cuales pagaste es tu problema, por algo te permabanearon. Es la máxima sanción. \n\nAdemás de un juego también es un negocio, Y este tipo de propuestas por muy prácticas y atractivas que suenen, ocasionarian pérdidas.  Las razones están a la vista.\n\nMe tome el trabajo de explayarme un poco ya que veo que la gente sólo te vota negativo y ni se gasta  en hablar del tema.  Pero ya te digo. No es viable, no va a ocurrir, Y la propuesta tiene muchas grietas que la hacen cuestionable. \n\nSaludos!","replies":[]}]},{"poster":"Sofiˉ","date":"2017-10-19T20:58:33.066+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Natchin,realm=LAS,application-id=1kXTbdax,discussion-id=chARsA78,comment-id=0000,timestamp=2017-10-19T20:55:43.401+0000)\n>\n> No va a pasar. Se presta para crear un mercado negro de venta de skins y con el sistema de botín es super explotable.\n\nSe puede debatir.","replies":[]}]},{"poster":"ouz","date":"2017-10-19T21:15:21.282+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}}","replies":[]}]}