{"poster":"Xayaah ","date":"2017-06-25T08:04:46.523+0000","title":"Calling lanes for two people","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"Can we call lanes for two people? Ive done it for quite a while, with no one arguing with it but some one goes and says you cant and starts swearing at me. Am i allowed to call lanes for two people like for bot lane and bot lane only?.\r\n\r\nAlso i had a game when a person called then lanes for 3 people. Can they do that?","replies":[{"poster":"Astrea","date":"2017-06-30T03:08:12.905+0000","up_votes":1,"down_votes":0,"body":"I think it's completely fine, in all honesty. Especially if you're helping a friend who may load into champion select quite slowly.","replies":[]},{"poster":"Wean","date":"2017-06-26T03:23:37.197+0000","up_votes":1,"down_votes":0,"body":"In PVP Blind pick, duo top can happen if all the roles (adc, top, mid, support) had been called except for jungle, when the remaining player has no smite yet, he may want to call top, that should not be an issue.\nOther than that, there should only be one top, one mid, one adc, one support, and one jungle.","replies":[]},{"poster":"Roguestoney","date":"2017-06-25T23:14:58.229+0000","up_votes":1,"down_votes":0,"body":"I have no issues with one person calling bot lane for them and their friend. This is entirely my own opinion though. I would say many people wouldn't have an issue but there will always be a few that will.","replies":[{"poster":"Project Xayah","date":"2017-06-25T23:40:11.612+0000","up_votes":1,"down_votes":0,"body":"I agree with this. If I get into lobby and there's a duo wanting to go bot together, I don't mind. Better two people who are likely communicating via voice chat than two randoms who will more than likely have no synergy whatsoever, as far as I'm concerned.\n\nAs About 9 pointed out, though, \"role-calling\" is more of a respect thing than anything else. It's a community created system which isn't policed by Riot in and of itself, which means there's not really a penalty for choosing not to follow call order, as long as there still exists some reasonable communication, cooperation and strategising with the team.","replies":[]}]},{"poster":"About 9 Kenyans","date":"2017-06-25T08:24:58.807+0000","up_votes":1,"down_votes":0,"body":"well there is no set in stone rules about calling actually, its more of a respect thing even though most players dont follow it, so yeah you could call more than one, but each lobby depends on the people in it","replies":[]},{"poster":"HashTagNoodles","date":"2017-06-25T08:10:31.271+0000","up_votes":1,"down_votes":0,"body":"You can only call for two people if its for bot lane and nothing else other than that you're on your own for your role","replies":[]}]}