{"poster":"flitspaal","date":"2015-01-23T21:19:34.595+0000","title":"fps drop","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"Half a year or so ago i was able to play LOL from my laptop, but i tried again this week and it has become impossible due to framerate drop. I tested in an empty custom game and noticed that with every new minion wave it slowly drops... starting from around 18-20 fps at the start of the game to a 0 or 1 fps between 5 and 10 mins in game. The game simply slowly dies (I keep my character at base and do nothing)\r\n\r\nI tried a kazilion suggestions which i found through google, including adjusting config settings, disk/registry cleanup, video settings, startup-removals, closing other programs and processes, driver updates, energy-saving settings and so on and so on but all together it makes only a difference in that the game starts from around 30 fps but still gradually dies over the same 5 to 10 min to 0 fps\r\n\r\nAnyone any clue what else I could try? or does this basically mean I'm doomed to give up on playing on my laptop ever again?","replies":[{"poster":"LGD Lewllyne","date":"2015-01-23T21:41:28.731+0000","up_votes":2,"down_votes":0,"body":"It seems that there are many people in this situation, it's been going on for a little while. If you have already tried all the readily supplied fixes and none helped I suggest submitting a ticket with your R3d files and stuff. I'm hoping the more info they can get on this the sooner they'll have a fix. I've been sticking to co-ops, normals or arams with friends who don't care i can't play as well as normal with it. I've started seeing a pattern in the way it goes downhill as time goes on as you said. I just played three arams and the drops started about 7 to 8 minutes in in each one. Seems like 28 or 30ish minutes in normals.","replies":[]},{"poster":"PenetrationPaul","date":"2015-01-24T05:31:35.494+0000","up_votes":1,"down_votes":0,"body":"Same shit different day with Riot. I've had the same problem for months on a brand new machine with dedicated graphics. It worked great until patch 4.20. Now this game is pure ass.","replies":[]}]}