{"poster":"Blitzillu","date":"2020-01-20T04:53:51.457+0000","title":"Crasheos, bugs splats y más","subforum":"Problemas Técnicos","up_votes":7,"down_votes":0,"body":"Hola últimamente eh tenido problemas con con mis partidas , estos son : \n- se crashea el lol, se congela la pantalla y juego en modo ventana \n- bugs splat \n- pequeños cortes de conexión ( y tengo un Internet estable ) \n- league of Legends ah dejado de funcionar \n- y el clásico pantalla de carga infinita \n\nBueno el único problema q tenía antes era el de la pantalla de carga pero de repente comencé a tener todos estos problemas !  Eh ganado leaber buster como 3 veces ( y son de 20 minutos ) \n\n\nJuego con todo al mínimo y bueno a alguien más le pasa o le a pasado ? Alguna solución ? Gracias por leer{{champion:201}} {{champion:1}} ","replies":[{"poster":"Betor","date":"2020-01-22T04:00:50.633+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa lo mismo, se congela todo la pc y tengo que reiniciarla, en requisitos estoy bien, Win10 / RTX 2060 super / Ryzen 3600 / 16 Gb Ram","replies":[]},{"poster":"Ezian","date":"2020-01-20T04:58:20.013+0000","up_votes":1,"down_votes":0,"body":"Hola!\n\nEn mi experiencia, creo que los que tenemos pc un tanto básicas (o viejitas) estamos experimentando mas problemas de lo habitual, no se que pc tendrás vos.\n\nTambién están existiendo problemas con el tema del cliente bastante absurdos, en los que supuestamente están trabajando.\n\nSaludos!\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Blitzillu","date":"2020-01-20T05:02:38.575+0000","up_votes":1,"down_votes":0,"body":"Bueno mi PC no es una PC último modelo pero siempre ah servido para correr el lol, que problemas tuviste ? Alguno similar a los míos ?  Me va a alegrar saber q no soy el único {{champion:32}}","replies":[{"poster":"Ezian","date":"2020-01-20T05:07:00.415+0000","up_votes":1,"down_votes":0,"body":"Estoy en la misma situación que vos con el tema de la compu, aunque soy consciente de que es viejita, siempre dio pelea y pude jugar en medio a 100-130 fps estables.\n\nDesde el inicio de la season 2020, después de seleccionar campeón, se cierra el cliente para iniciar la pantalla de carga y mi pc se congela por completo, lo único que puedo hacer es reiniciarla desde el botón.\n\n{{sticker:sg-janna}}","replies":[{"poster":"Blitzillu","date":"2020-01-20T05:11:00.481+0000","up_votes":1,"down_votes":0,"body":"Bueno veo que estás incluso peor y por lo q decís de los fps no es muy diferente a la mía entonces estos problemas son del juego y no la PC ? \n\nEspero que sea eso {{sticker:zombie-nunu-tears}}","replies":[{"poster":"Ezian","date":"2020-01-20T05:12:57.886+0000","up_votes":1,"down_votes":0,"body":"En parte son nuestras pc porque son un poco viejitas y limitadas, y por otra creo que el juego va avanzando y a eso sumale los problemas, nos va dejando en el camino.\n\n\n{{sticker:sg-soraka}}","replies":[]}]}]}]}]}]}