{"poster":"LoeweYT","date":"2019-01-13T21:05:05.911+0000","title":"Zu wenig Schaden bei Perfektem Spiel ?","subforum":"Champions & Gameplay","embed":{"description":"Jedes Match erzählt seine eigene Geschichte; schaue in den neuen Matchverlauf von League of Legends, um zu sehen, wie diese ausgeht, und um andere an deinen Geschichten teilhaben zu lassen!","url":"https://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3894000231/226939639?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":0,"body":"Mein Freund (Kayn) fragt sich warum er mit so guten Stats nur so wenig Schaden gemacht hat. Dass Olaf mehr Schaden hat ist noch verst&auml;ndlich (Laningphase), aber dass er nur 6k mehr Schaden als der Supporter hat ist doch etwas komisch, bei 14 Kills. Falls ihr das Game angucken wollt ich bin LoeweYT auf EUW.","replies":[{"poster":"Bobby Bonkers","date":"2019-01-16T10:33:23.899+0000","up_votes":1,"down_votes":0,"body":"Liegt teilweise auch am champion.\nAssassinen neigen dazu overall im game nicht den allermeisten schaden zu verursachen. Zum einen weil sie Großteils nicht auf aoe ausgelegt sind, und weil der playstyle der sie Auszeichnet sich darum dreht kurz in nen fight reinzuspringen, nen squishy umzubursten und sich wieder zurück zu ziehen.\nBeispiele für Champs die in der regel hohe dmg zahlen am Ende verursacht haben wären zb:\n1. Pokechamps (Ez,Vel) \n2. aoe Champs (Sivir,viele Mages)\n3. Dps Charaktere (Adcs, unteranderem auch Olaf)\n\nHoffe das ist einigermaßen verständlich und klärt deine frage","replies":[]},{"poster":"PlsLoLMMO","date":"2019-01-14T14:49:23.194+0000","up_votes":1,"down_votes":0,"body":"die Stats haben halt nichts mit dem ausgeteilen Schaden zu tun. du kannst genau so gut 100k Dmg gemacht haben und nicht 1 Kill haben. Es spielt keine Rolle wie viel Schaden man macht/gemacht hat sondern wann und in welcher Situation. Bist du in der lage den Schaden der benötigt wird in der richtigen Situation auszuteilen oder machst du kontinuierlichen SChaden der aber nie reicht um das zu erreichen was erforderlich ist. \n\ndas gleiche wird dort auch so sein. der kayn hat den Schaden eingesetzt als er benötigt wurde und nicht um den Gegner permanent ein bisschen den lebensbalken zu nehmen. Noch dazu als Jungler ist es kein wunder das man in der Regel n bisschen weniger Schaden austeilt. (Dazu hat Thresh einigermaßen busted base-damage wenn man bedenkt das er sup ist und sup build geht)\n\nein weiterer Aspekt: Wenn der Kayn weder den Vlad noch den Ornn aggresiv gefocussed hat sondern sich ausschließlich zb auf jinx fokussiert hat dann kann er die 14 kills sogar solo geholt haben und würde nicht mal auf den Schadenswert kommen. Ne jinx hat wenig leben dementsprechend kannste auch nicht viel austeilen und so wie die stats aussehen waren jinx und jax das daueropfer.","replies":[]},{"poster":"XenesisCH","date":"2019-01-14T08:16:40.422+0000","up_votes":1,"down_votes":0,"body":"Die Laner machen halt während der Laningphase immer wieder Schaden durch geplänkel und ein Olaf ist darin eigentlich sehr gut, denn er kann sich durch seinen Lifesteal immer wieder schön hochheilen. Wenn jetzt der Jungler bei den Ganks nur den Lasthit machen muss für den Kill hat er beispielsweise auch nicht viel zum Schaden beigetragen. Es gibt halt viele Gründe und wenn du es genau wissen möchtest, dann solltest du dir das Replay selbst anschauen ;).","replies":[]},{"poster":"RM Heartmeander","date":"2019-01-14T07:16:46.979+0000","up_votes":1,"down_votes":0,"body":"Na ja zumindest die Karte mit den Kills indiziert, dass er die meisten Kills im gegnerischen Bereich gemacht hat und auch eher gegen Ende des Games.\n6 Kills sind nach der 25 Minute gewesen, bei nem 30 Min Game also recht viel von den 14 Kills.\nEr hat nach 18 min 5 Kills und geht Tank.\nWenn man jetzt noch davon ausgeht, dass er nicht alle Kills alleine im 1 vs 1 geholt hat und er Jungler ist, kommt das schon auf geringere Werte and dmg Dealt.\n\nEs ist z.B. möglich, dass er die Kills nur durch Lasthits gemacht hat, sagen wir also so 300 dmg, da könnte man auch bei 14 Kills wenig Schaden haben.\nNatürlich wird er schon mehr Schaden gemacht haben aber ich hoffe du verstehst, worauf ich hinauswill?\n\nWenn er dann auch noch viel Zeit im Jungle verbringt, dann kann es schon einmal vorkommen, dass man wenig Schaden macht.\n\nAber ohne das komplette Game gesehen zu haben, kann man das nicht zu 100% sagen.","replies":[]},{"poster":"ImTheFox115","date":"2019-01-13T23:09:04.629+0000","up_votes":1,"down_votes":0,"body":"Kannst ja selber mal das Game angucken und mal grob nach rechnen...\n\nWenn er 14 Kills hat und bei allen nur einmal einen Aa gemäht hat, kommt man nicht auf soviel Dmg  :D","replies":[]}]}