{"poster":"Mr Graspolo","date":"2015-12-13T14:47:17.254+0000","title":"[OT] Ci avete mai fatto caso?","subforum":"Discussioni generali","up_votes":8,"down_votes":2,"body":"https://scontent-frt3-1.xx.fbcdn.net/hphotos-xlf1/v/t1.0-9/12376729_1096944927006040_5722943356905440355_n.jpg?oh=21de56fa17ecf422ed816a5b457637d6&amp;oe=56DC54C2\r\n\r\nAvete mai fatto caso a quante persone che arrivano dalla comunit&agrave; di tumblr siano tra le meno piacevoli da avere con voi in una chat room o in una lobby?\r\nPer carit&agrave;, esistono anche eccezioni, ma in generale l&#039;utenza di tumblr sembra che giochi a league solo per la feature di una chat libera, in cui se ti comporti in maniera scorretta puoi effettivamente rovinare un&#039;ora (adesso 20 minuti thx season 6) della vita di una persona, ma cari tumbleriani, fan girl di serie sopravvalutate come super natural, fan boy di pagine che riescono a sessualizzare qualsiasi cosa peggio di deviantArt, finte femministe e bimbi disturbati, smettetela di fare i tossici nei miei game, e iniziate a cercare una ragione di vita che sia diversa dal renderla pi&ugrave; difficile agli altri.\r\n\r\nSe pensavate che la comunity di lol fosse messa male, fatevi un giro su tumblr e vedrete il pi&ugrave; grande accampamento del Trisomia-Club mai esistita\r\n\r\nCon amore, vostro Graspolo.","replies":[{"poster":"lucanomax1994","date":"2015-12-13T15:00:50.270+0000","up_votes":8,"down_votes":2,"body":"***","replies":[{"poster":"IrrationalNumber","date":"2015-12-14T10:34:36.996+0000","up_votes":2,"down_votes":0,"body":"OP ha appena scoperto le SJW e ci teneva a farlo sapere al mondo.\n\n/thread","replies":[{"poster":"lucanomax1994","date":"2015-12-14T10:43:37.318+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"IrrationalNumber","date":"2015-12-14T10:50:54.589+0000","up_votes":2,"down_votes":0,"body":"Social Justice Warriors\n\nGente che si fa seghe mentali sulle inequita' della societa'.\n\nRoba tipo \"dobbiamo far capire al mondo che essere grassi non vuol dire niente di negativo, non significa avere una brutta salute e nessuno dovrebbe suggerirti una dieta, nessun dottore dovrebbe imputare i tuoi mali al tuo peso e nessun uomo dovrebbe sentirsi poco attratto da te solo perche' sei grassa e soprattutto se sei grassa e' tutta colpa dei geni e tu non hai colpa e le diete non sono efficaci, i cinema, gli aerei e le macchine dovrebbero avere posti a sedere piu' grandi per favorire anche i grassi e avere porte e bagno e vestiti piu' grande senza sovraprezzi per i ciccioni e se non posso lavorare perche sono grasso lo stato dovrebbe mantenermi etc...\"","replies":[]}]}]},{"poster":"Sorcio84","date":"2015-12-13T20:20:10.471+0000","up_votes":1,"down_votes":0,"body":"FB mi ha bloccato il secondo profilo per nome falso e ha censurato una lumaca pensando fosse 1 P{{champion:17}} E .\n\nOrmai FB è un sito dominato dai bot","replies":[]}]},{"poster":"A Yordle ln Heat","date":"2015-12-13T14:49:01.113+0000","up_votes":2,"down_votes":0,"body":"https://www.youtube.com/watch?v=i8Kq0BfhX7Y","replies":[]},{"poster":"Aegis Winebeard","date":"2015-12-13T18:04:21.256+0000","up_votes":2,"down_votes":1,"body":"Se vuoi farti una risata, prova a vedere quanti ipotetici orientamenti sessuali girano su Tumblr.... Rido ancora oggi","replies":[]},{"poster":"ubercodlegend200","date":"2015-12-14T10:24:18.607+0000","up_votes":1,"down_votes":0,"body":"io mi son creato un profilo tumblr per metterci sopra i miei disegni stupidi lo uso stile mediafire ma posso incolare i png qui e là https://41.media.tumblr.com/4034b2ad9b4ec652d160960f5881064f/tumblr_nzcfjka4Pl1um3mlbo1_540.png","replies":[]},{"poster":"Skydago","date":"2015-12-13T16:24:19.171+0000","up_votes":3,"down_votes":3,"body":"SI, su tumbrl la gente ci sta solo per insultare,, infatti ad un nostro amico di famiglia che gestisce una pizzeria hanno scritto che la pizzeria è un merdaio solo per il gusto di fargli cattiva pubblicità.","replies":[]}]}