{"poster":"Coreykun","date":"2015-07-08T20:24:37.437+0000","title":"Championstufe und Matchbewertung","subforum":"Champions & Gameplay","up_votes":5,"down_votes":1,"body":"_**Hallo liebe Mitbeschw&ouml;rer und Riotler!**_\r\nIch m&ouml;chte gerne mal &uuml;ber die Championstufe und die Matchbewertung, die man nach einem Game erh&auml;lt, reden, da mir das System doch zum einen negativ aufst&ouml;&szlig;t und zum anderen auch irgendwie unausgereift wirkt.\r\n\r\n**Um kurz alle auf einen Stand zu bringen**: Ich spreche von diesem wunderbar kleinen Erfahrungskreis, der uns in der Statistik neben den erk&auml;mpften Einflusspunkten in der Statistik nach einem Match angezeigt wird. Dieser zeigt die bisher mit dem gespielten Champion erreichte Erfahrungsstufe an, sowie, wenn man mit der Maus in den Kreis hineingeht, eine Art &quot;Note&quot; die unsere Leistungen im letzten Gefecht bewertet. Die Notenstufen reichen dabei von _S_ (gut) bis _D_ (schlecht), sogar mit Abstufung in Plus und Minus, beispielsweise &#039;B+&#039;.\r\n\r\n**Nun zu meiner Kritik:** Die Championstufe ist ja ganz nett, aber die Bewertung ist irgendwie verst&ouml;rend. **Es ist nicht wirklich transparent, woran sich unsere Leistungen messen**, ob es hier um die _KDA_ (Kills | Deaths | Assists, zu deutsch: T&ouml;tungen | Tode | Unterst&uuml;tzungen), die _get&ouml;ten Vasallen_ oder um _gute Spielz&uuml;ge_, _platzierte Wards_ (zu deutsch: Augen) oder ob unser _Itembuild_ geht. Meine Vermutung ist dabei, dass zu gro&szlig;en Teilen die KDA in diese Bewertung einflie&szlig;t, da diese von Natur aus in Zahlen gefasst und dadurch sehr leicht verwertet werden kann, sowie die get&ouml;teten Vasallen und eventuell auch, je nach Rolle, die man eingenommen hat, die Anzahl der platzierten Wards. **Deutlich gest&auml;rkt in dieser Meinung hat mich ein Match**, in welchem ich die gute Quinn (an dieser Stelle mal kurz Schande &uuml;ber euer Haupt, Riot, das Rework der Vogellady ist &uuml;berf&auml;llig!) auf der Toplane gespielt habe. Meine KDA in diesem Spiel war 13/5/8, ich habe 389 Vasallen in einem 52 Minuten Spiel get&ouml;tet und Wards habe ich 14 platziert. Meine Bewertung f&uuml;r dieses Spiel war ein &#039;S-&#039;. Klingt ja erstmal sch&ouml;n und gut, ist aber ziemlich mies, da keine meiner T&ouml;tungen auf eigenem Skill beruht sondern auf unangenehmen Diebst&auml;hlen (An dieser Stelle sei meinen Teamkollegen in jenem Match gesagt, manche davon waren Versehen und andere Diebst&auml;hle... Eben nicht. Tut mir leid!) oder Gegnern mit weniger als 100 Leben die ich mit einem Schuss erledigen konnte. Meine Tode waren durchweg sinnlos und sind wirklich ein peinliches Beispiel f&uuml;r meine Unf&auml;higkeit. Das einzige was ich getan hab war AFK (Away From Keyboard, zu deutsch: Nicht an der Tastatur) auf der Toplane Vasallen t&ouml;ten, und auch das erst mit ein paar Items erfolgreich. Ich w&uuml;rde sogar soweit gehen, unsere Niederlage als meine Schuld hinzustellen, da ich den entscheidenen Teamfight verpasst habe (ich stand hirntot auf der Toplane und habe Vasallen gepiesackt) und dann, statt die Basis zu verteidigen, wie ein Idiot in 5 Gegner hineingesprungen bin. \r\nKurzum habe ich mich spielerisch in diesem Match nicht wirklich mit Ruhm bekleckert, aber zahlentechnisch war ich ziemlich gut dabei. **Meine Bewertung mit &#039;S-&#039; erscheint mir also unangemessen**. Andersherum bekomme ich in anderen Gefechten trotz einiger guter Momente nur mittelklassige Bewertungen. \r\n\r\nDas f&uuml;hrt mich zu folgendem Problem: **Bewertungen sind nicht sonderlich stichhaltig**. Zum einen ist der Bewertungsvorgang an sich nicht transparent, zum anderen liefern Bewertungen mitunter falsche Bilder vom eigenen K&ouml;nnen. Den Leuten, denen das System gn&auml;dig ist und deren Ego verst&auml;ndlicherweise mit guten Bewertungen eine gute Pflege erf&auml;hrt w&uuml;nsche ich gerne mehr davon, aber ein &#039;D&#039; zu kassieren, obwohl man sein Bestes gegeben hat ist frustrierend. **Au&szlig;erdem verbessert oder verschlechtert eine Bewertung den Spieler nicht** und zumindest ich finde, dass eine Bewertung in einem wettbewerbsorientiertem Spiel einem die M&ouml;glichkeit geben sollte. Aber aus den vorhergenannten Problemen heraus versteht sich, dass eben das nicht m&ouml;glich ist.\r\n\r\nGenug gemeckert und gejammert, **wie geht man das Problem nun an?** Eine Idee die ich habe w&auml;re zum Beispiel, dass uns nicht nur unsere Bewertung in dem kleinem Fenster angezeigt wird, sondern vielleicht auch ein Championrelevanter Tipp. So k&ouml;nnte bespielsweise bei einem Zed dort stehen &quot;Lebender Schatten hat eine lange Abklingzeit. W&auml;ge gut ab, wann du ihn einsetzst.&quot;. Klingt erstmal ziemlich primitiv, aber wenn der Spieler im n&auml;chsten Spiel auf den Schatten achtet und nur einmal dr&uuml;ber nachdenkt, ob das der richtige Augenblick f&uuml;r den &quot;Lebenden Schatten&quot; ist, wird er auf lange Sicht effektiv besser mit diesem Werkzeug umgehen. \r\nEine andere Idee, die ich habe ist die Einf&uuml;hrung von Mittelwerten. Zum Beispiel: &quot;In ihrem letzten Spiel als Zed haben sie 246 Vasallen get&ouml;tet. Das sind 14 Vasallen mehr als ihre durchschnittliche Leistung.&quot; Wieder ein sehr einfaches Prinzip, aber es spricht den Ehrgeiz in uns an. Im n&auml;chsten Spiel wird der Spieler nun vielleicht 25 Vasallen mehr schaffen wollen und so wird er verst&auml;rkt darauf achten.\r\n\r\nSo weit, so gut. **Um es nocheinmal zusammenzufassen:** Das Bewertungssystem in seinem derzeitigen Zustand ist mir doch ein Dorn im Auge, aber mit einer &Uuml;berarbeitung des Ganzen k&ouml;nnte ich mich doch noch damit anfreunden.\r\n\r\n**Was denkt ihr dar&uuml;ber?** Haltet ihr mich f&uuml;r verr&uuml;ckt? Denkt ihr vielleicht dasselbe? Habt ihr eigene Ideen dazu? Schreibt es ins Forum. Vielleicht schaffen wir es ja, Riot einen kurzen Augenblick der Aufmerksamkeit abzugewinnen. \r\nBis dahin:\r\n\r\n**Viel Gl&uuml;ck euch auf den Richtfeldern! **","replies":[{"poster":"OSaftKiller","date":"2015-07-09T10:34:50.435+0000","up_votes":1,"down_votes":0,"body":"Ich habe auch oft schon S Bewertungen bekommen, obwohl ich eigentlich abgrundtief schlecht gespielt habe und dann habe ich wiederum C Bewertungen bekommen, obwohl ich spiel entscheidende Aktionen in meinem Gameplay hatte.\n\n14 Wards nach der Spielzeit finde ich übrigens eher wenig wenn du das Ward Trinket verwendet und ausgebaut hast. Ansonsten finde ich ein S bei 5 Toden wovon einige wohl Spielentscheiden waren auch eher unangebracht und da muss ich dir in dem Punkt zustimmen, auch wenn die KDA natürlich nicht immer aussagekräftig ist. Hatte auch schon Games mit 0/10/43 wo ich mit einem Supp die Teamfight Wins herbeigeführt habe und dafür halt jedes mal gestorben bin.:D","replies":[{"poster":"Coreykun","date":"2015-07-10T13:18:03.846+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Flöff,realm=EUW,application-id=Wj1wcocU,discussion-id=NXkUd7y5,comment-id=0000,timestamp=2015-07-09T10:34:50.435+0000)\n>\n> Ich habe auch oft schon S Bewertungen bekommen, obwohl ich eigentlich abgrundtief schlecht gespielt habe und dann habe ich wiederum C Bewertungen bekommen, obwohl ich spiel entscheidende Aktionen in meinem Gameplay hatte.\n> \n> 14 Wards nach der Spielzeit finde ich übrigens eher wenig wenn du das Ward Trinket verwendet und ausgebaut hast. Ansonsten finde ich ein S bei 5 Toden wovon einige wohl Spielentscheiden waren auch eher unangebracht und da muss ich dir in dem Punkt zustimmen, auch wenn die KDA natürlich nicht immer aussagekräftig ist. Hatte auch schon Games mit 0/10/43 wo ich mit einem Supp die Teamfight Wins herbeigeführt habe und dafür halt jedes mal gestorben bin.:D\n\nJa es sind extrem wenig Wards :) In der Regel verwende ich auch mehr, und das erweiterte Trinket hol ich mir so gut wie immer. In dem Game war einfach wirklich der Wurm drin, und ich hab mich hauptsächlich aufs Quinns W verlassen. Nichtsdestotrotz hast du recht, das müssten mehr sein.","replies":[]}]}]}