{"poster":"GooCommitAlivent","date":"2018-01-12T00:47:35.424+0000","title":"Ehrungssystem, wann?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Kurz und b&uuml;ndig wie im Titel.. wann kommt den das neue Ehrungssystem? Und wie ist eigentlich eure Meinung dazu?\r\n\r\nEs gibt Leute die sowas unn&ouml;tig finden und meinen &quot;Jaa hat nichts mit dem Gameplay zu tun.. unn&ouml;tig as fck&quot;\r\nAlso ich finde es toll! Das ist es was mich so an League h&auml;lt. Die geben uns immer mehr und mehr Belohnungen f&uuml;r das Spielen und genau das hat das Spiel gebraucht. Fr&uuml;her hat man wirklich nur gespielt gespielt und... fertig. Ich mein diese Belohnungen k&ouml;nnen Skins sein, die eigentlich RP kosten bzw. echtes Geld! Oder halt Augenskins ist egal was es sind Sachen dabei die eigentlich fr&uuml;her nur mit echtes Geld gekauft werden konnten. \r\n\r\nFind voll cool dieses neue System und bin gehyped, daher will ich unbedingt wissen wann das kommt ich mein bei der Seite vom neuen System haben sie es nicht rein geschrieben.","replies":[{"poster":"hi im seb","date":"2018-01-12T10:07:20.078+0000","up_votes":2,"down_votes":0,"body":"imo is es unnötig\n\nnicht missverstehen, ich finds super das es das System gibt und freue mich natürlich über die Belohnungen, ist ja alles kostenlos.\n\nAllerdings braucht es das ganze nicht um mich bei Laune zu halten, da fänd ich einige Nerfs hier und da angenehmer :D","replies":[{"poster":"GooCommitAlivent","date":"2018-01-12T17:04:41.415+0000","up_votes":1,"down_votes":0,"body":"Naja so manche Champions könnten wirklich nerfs gebrauchen. Da wären Leute wie Shyvana, Fizz, usw. Aber wenn RIOT sich wirklich NUR um Nerfs und Buffs kümmert wäre das auch nicht gut. Denk mal nach Leute spielen jetzt zum Beispiel Yorick weils jetzt op ist und plötzlich sofort wieder generft und dann rüber zu Xin weils gebufft wurde.. boom wieder generft usw. Da gebe es nicht so ein Balance also Gleichgewicht.","replies":[]}]},{"poster":"Alustus","date":"2018-01-12T04:26:55.853+0000","up_votes":2,"down_votes":0,"body":"> wann kommt den das neue Ehrungssystem? \n\nIch denke am 16. Jänner wenn die neue Season startet, also zur selben Zeit wenn das Rank usw. einen restett erhält","replies":[{"poster":"GooCommitAlivent","date":"2018-01-12T17:10:30.623+0000","up_votes":1,"down_votes":0,"body":"Ach stimmt ja.. bin so doof.. keine Ahnung warum ich nicht an das gedacht hab. \n\nDanke dir ^^","replies":[]}]},{"poster":"Oriius","date":"2018-01-12T03:19:05.506+0000","up_votes":1,"down_votes":6,"body":"Ich find das ehrlich gesagt absolut nice mit den Belohnungen , auch wenn das System wirklich überarbeitet gehört was die Schwierigkeit der Stufen angeht. Jedoch ist es für mich immer noch dringlicher andere Systeme sowie Bestrafungen anzupassen.\n\nKann einfach nicht angehen das man tage hat wo man 20 Runden in Folge mit afk´s ausharren muss und oftmals immer die selben oder das man in rankeds als s4 Spieler in Dia matches gequeued wird. Mir macht League schon nahezu kein Spaß mehr wegen so was ...","replies":[{"poster":"Sirrkas","date":"2018-01-12T11:36:01.539+0000","up_votes":2,"down_votes":0,"body":"Spiel doch mal Rankeds. ARAMs sind nämlich kein Ranked.","replies":[{"poster":"Veezey","date":"2018-01-12T12:53:07.082+0000","up_votes":1,"down_votes":0,"body":"Bei ARAM erwarte ich auch nichts mehr. Ich habe im letzten Monat öfter ARAM gespielt und die Afk-Rate ist dort echt hoch, etwa alle 3-4 Spiele habe ich dort einen Afkler. Da es aber ein Funmode ist stört es mich nicht sooo sehr, aber es nervt.","replies":[{"poster":"Sirrkas","date":"2018-01-12T21:14:58.367+0000","up_votes":1,"down_votes":0,"body":"Es ging mir eher darum, dass er sich beschwert gegen Dia im Ranked als S4 Spieler antreten zu müssen. Damit das stimmt, müsste er erst mal Rankeds spielen. \n\nIm ARAM stört mich am meisten, dass es kein Remake gibt. Leute, die während des laufenden Spiels afk gehen, sehe ich da nur selten. Da ist es deutlich häufiger, dass jemand gar nicht erst ins Match kommt und eine Seite muss dann 4vs5 spielen.","replies":[]},{"poster":"GooCommitAlivent","date":"2018-01-12T17:07:45.323+0000","up_votes":1,"down_votes":0,"body":"Also von meiner Erfahrung kann ich eins sagen.. Ich sehe fast so viele AFK´ler oder sogar noch schlimmer.. Troller in Ranked wie in ARAM. Also fast.. Wie die Leute einfach Rank garnicht mehr ernst nehmen macht mich schon traurig. Leute gehen aus der que raus ich mein da verliert man doch LP und bekommt Strafe.. Aus nem Ranked Que raus zugehen.. sag mal wtf? Auch AFK sehe ich sehr oft im Gegensatz zu 2016. Ich hoffe in 2018 werden sie weniger.","replies":[]}]}]},{"poster":"Hakkuu","date":"2018-01-12T12:54:33.629+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Oriius,realm=EUW,application-id=Wj1wcocU,discussion-id=b1vLPO3c,comment-id=0000,timestamp=2018-01-12T03:19:05.506+0000)\n>\n> Ich find das ehrlich gesagt absolut nice mit den Belohnungen , auch wenn das System wirklich überarbeitet gehört was die Schwierigkeit der Stufen angeht. Jedoch ist es für mich immer noch dringlicher andere Systeme sowie Bestrafungen anzupassen.\n> \n> Kann einfach nicht angehen das man tage hat wo man 20 Runden in Folge mit afk´s ausharren muss und oftmals immer die selben oder das man in rankeds als s4 Spieler in Dia matches gequeued wird. Mir macht League schon nahezu kein Spaß mehr wegen so was ...\n\nEs dauert nunmal seine Zeit bis ein Spieler gebannt wird. Ich denke du willst auch nicht aus heiterem Himmel gebannt werden nur weil das jemand schnell schnell durchgewunken hat.\nDie 20 Runden halte ich für mehr als utopisch, und dass du im Ranked öfters mit Dias gematcht wirst klingt unrealistisch. Und selbst wenn, sind die Team MMRs immernoch gleich und du hast im Gegenzug auch jemanden über deiner Elo in's Team bekommen.","replies":[]}]},{"poster":"DrunkenRedPanda","date":"2018-01-12T07:46:29.761+0000","up_votes":1,"down_votes":0,"body":"Ich finde das System gut, hab dadurch schon MIttelalter Twitch bekommen, einen Skin den ich eigentlich schon immer haben wollte.","replies":[{"poster":"GooCommitAlivent","date":"2018-01-12T17:09:30.390+0000","up_votes":1,"down_votes":0,"body":"Sehr nice! Ich habe für mein Main Support Thresh damals den Dark Star Thresh bekommen. Bin sooo explodiert vor Freude :D","replies":[]}]}]}