{"poster":"Iccigó","date":"2014-09-22T19:24:35.415+0000","title":"Egy érdekes dolog és kérés","subforum":"Segítség és támogatás","up_votes":1,"down_votes":0,"body":"Kedves Riot!\r\nPár napja észrevettem, hogy nem engednek játszani rangsorolt meccsen (holott meg sincs a kötelező mennyiségű hősöm hozzá) mert \"nem megfelelő a modorom\" na most nem tudom ez pontosan mit jelent, de ha azt jelenti hogy bannoltak és azért bannoltak mert túl sok reportot kaptam akkor el kell mondjam hogy elég idegesítő amikor olyan csapattársakat kapok akik mellett nem lehet játszani, de azért mindenki engem akar reportolni, nem beszélve arról hogy a másik csapat \"csak mert jó poén\" szintén repoltol, ami egyenesen vezet az OK NÉLKÜLI (!) bannolásomhoz....nem lehetne esetleg ez ellen valamit tenni?! vagy mindig csináljak új accountokat vagy mi?\r\nElőre is köszönöm!","replies":[{"poster":"Iccigó","date":"2014-09-23T13:40:35.447+0000","up_votes":1,"down_votes":0,"body":"Köszönöm szépen az információt. Akkor nincs más hátra mint előre. Ha minden szabályt betartok csak elkerülöm a reportot...bár nehéz lesz nem  feedelni az ellent ha minden csapattárs hagy meghalni :S","replies":[]},{"poster":"R3wan","date":"2014-09-23T07:30:30.055+0000","up_votes":1,"down_votes":0,"body":"Sajnos nem sokat tehetsz ez ellen. Próbálj meg nem okot adni arra, hogy reportoljanak. \nTegnap én is kaptam a figyelmeztetést, hogy reportoltak negatív hozzáállásért. Pedig csak annyit tettem, hogy el poénkodtam az illetővel a másik csapatból, miután hackernek nevezett. Érted. Megvádol, hogy csalok és még utána a rendszer is engem figyelmeztet. Vigyázni kell, mert semmiért is reportolnak. Amíg nincs tribunal, addig meg senki nem ellenőrzi, hogy tényleg mondtál-e olyanokat, amik miatt reportolhatnak.\n\nMondjuk volt még egy érdekes tegnap. Aramoztunk, mielőtt azonban elindult volna a meccs, kaptam egy üzit, hogy kiléptetett a játék, mert valami változtatás történt a fiókomon. Vagy valami ilyesmi. Mivel nem tudtam mire vélni, gyorsan jelszót változtattam a biztonság kedvéért. Aztán visszaléptem és látom, hogy nem csak kivágott a rendszer, de még a leaver buster is engem büntetett meg 15 perc kispaddal. Vannak itt érdekes dolgok.","replies":[]},{"poster":"Jaedanz","date":"2014-09-23T06:59:18.197+0000","up_votes":1,"down_votes":0,"body":"Igen.","replies":[]}]}