{"poster":"Hextech OwI","date":"2018-08-14T01:23:35.000+0000","title":"I have a wish regarding Nunu and Willump.","subforum":"Story, Art, & Sound","up_votes":23,"down_votes":0,"body":"Please, make their theme occasionally play when the game starts, like it does for Zoe and Swain.\r\n\r\nDuring the trailer, I found what was hearable of his theme simply awesome, and I would love to be set in a whimsical setting when I start a game with them from times to times, like I love to feel magnificently evil when I hear Swain&#039;s theme. If there are champions that has to possess this feature, it is Nunu and Willump.\r\n\r\nTo Riot Interlocutioner, I know this isn&#039;t your field of work but since you&#039;re a rioter that is notorious for its presence on the boards, I beg you to bring up this idea as a suggestion to whoever is able to make it happen.\r\n\r\nTo everyone, I wish you a wonderful day/evening and a happy Nunu &amp; Willump VGU.","replies":[{"poster":"Interlocutioner","date":"2018-08-14T02:58:43.777+0000","up_votes":14,"down_votes":0,"body":"There are no plans to have this particular thing, as far as music goes... {{sticker:zombie-brand-facepalm}} However, we're trying to get in as much music as possible for the characters. And skins... and emotes... we might surprise you!\n\nIf you see any more opportunities once they hit PBE, please lemme know.","replies":[{"poster":"JonnyBoyy","date":"2018-08-14T03:31:22.495+0000","up_votes":3,"down_votes":0,"body":"can i ask a question?\n\nWhy was this feature discontinued? I think its awesome and the ctrl+5 too","replies":[{"poster":"Interlocutioner","date":"2018-08-14T15:28:59.819+0000","up_votes":6,"down_votes":0,"body":"It's a difficult thing to talk about. Our composers are extremely talented, but there are only so many of them, and they can only work on so many things.\n\nFor example, imagine Urgot's gang, the Sons of Ur, chanted along with music at the start of every match. (Something I actually begged for.) Now imagine Riot actually made a Star Guardian Urgot skin. To keep the experience from being janky af, a sound designer or composer would have to come up with something new to replace the base music and chants. We can't just take things away without replacing them... that feels bad.\n\nSo while we recognize how beloved the intro music is on champs, every time we do it we commit to future work, and that adds up over time. \n\nThat's how I'd present the argument... but I'm someone who always pushes for the music anyway, so {{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"Chromatic Eagle","date":"2018-08-14T19:14:18.333+0000","up_votes":9,"down_votes":1,"body":"All I got out of this is Star Guardian Urgot is confirmed.","replies":[]},{"poster":"Kei143","date":"2018-08-15T13:21:16.549+0000","up_votes":1,"down_votes":0,"body":"Why not just make a bunch of fangirls/bois squeal his name?","replies":[]},{"poster":"TheKingOfBiches","date":"2018-08-14T17:02:26.474+0000","up_votes":1,"down_votes":0,"body":"Is that why aatrox dosent have his music anymore when he ults?","replies":[{"poster":"Meep Man","date":"2018-08-14T22:06:07.917+0000","up_votes":1,"down_votes":0,"body":"I can still hear the music.","replies":[]}]}]}]},{"poster":"Larriet","date":"2018-08-15T00:08:11.357+0000","up_votes":1,"down_votes":0,"body":"After the Star Guardians and GGMF (getting AFTER release, no less!), I have a craving for skins to get this, at least.  The way Zoe/Swain did it (only 30% chance of happening I think is what I read) is a little unsatisfying, since their themes don't work for all their skins, and it's sad not getting them every time for those who do.  So is this to say that if a champion has it by default, every skin needs it, but if a skin adds it, it's fine?  I don't get it.\n\nWhich isn't me saying \"Wow, I'm so disappointed\", just that I don't understand the architecture behind it because how could I?  I haven't seen it.\n\nI do hope more skins get this, at least, and I'd be hyped for older skins to get it should the time arise (personally, I really want Elementalist Lux to get a somber piano at the beginning, but that's neither here nor there).  Thank you for your awesome requests.","replies":[{"poster":"Interlocutioner","date":"2018-08-15T00:52:56.031+0000","up_votes":3,"down_votes":0,"body":"Yeah, different rules are forming for base champs vs. skins, since skins avoid the dilemma of locking in future work. (The \"doesn't play 100% of the time\" was a compromise of sorts). Don't expect the feature to completely disappear, and like I said, we're still looking to squeeze in as much as we can for Nunu & Willump!!","replies":[]}]}]},{"poster":"Phieldworker","date":"2018-08-14T05:29:15.208+0000","up_votes":6,"down_votes":0,"body":"I agree!! I play Swain and love just waiting for the battle to start, have crows flocking in and that noxian them. Mmmmmmmm. He’s my favorite.","replies":[]},{"poster":"IllusionLord333","date":"2018-08-14T08:24:06.098+0000","up_votes":2,"down_votes":0,"body":"The satisfying sound of Swain’s theme at the beginning of each game I play as him is incredibly satisfying!\nIt makes me feel as if I have a glorious purpose to accomplish, and that I will lead my comrades to victory! \n\nIt would be pretty neat to see this kind of musical in-game depth with other champions as well. I can somewhat understand Nunu and Willump not being ideal candidates (sadly), but maybe it would fit better for another champion?","replies":[]},{"poster":"Alzon","date":"2018-08-14T13:03:02.182+0000","up_votes":1,"down_votes":0,"body":"Then they’d have to switch Super Galaxy Rumble to play the same way, so you can feel the feed flow through you.","replies":[]}]}