{"poster":"Rhaąst","date":"2018-02-25T00:37:47.390+0000","title":"WE DEMAND MORE BLUE ESSENCE","subforum":"General Discussion","up_votes":1,"down_votes":6,"body":"As a member of the League community I think I can speak for all of us, especially us higher levels (50+), when I say we **NEED **more Blue Essence chances. What I mean by this is the daily that gives us 90 BE is not enough at all!\n {{sticker:sg-shisa}} \nNow you all may be typing you comments right now **&quot;WE GET CHAMPION CAPSULES AND WE CAN GET CHAMPION SHARDS ... AND ... AND .&quot;** blah blah blah! We all know these give max 1200 BE and if you say you got more &quot;that one time&quot; you didnt, you were dreaming. So back to the subject at hand, as you get higher in levels it gets harder to level up (go figure) and in short that means less BE for you! I am level 69 and it takes ages for me to level up and earn BE! Last item I bought was the mid laner/ top laner/ Jungler known as Ekko({{champion:245}}). As most of us know he is a newer champ costing about 6300 BE. Now I bought this champ on 2/8/2018 and I havent bought another champ since and I am only at 4955 BE. It is **16 days later** (2/24/2018) and I am still working hard to get a champ. Like most of you, I go to school and do normal stuff, but I do spend quite a bit of time on League so this means I have played about 16 days straight and havent gotten enough for a champ that I want. (Zac {{champion:154}} for 6300 BE) So it takes about **16+ days** for me to get 1 champ that I want. Now most of you can say I only want expensive champs and they have other champs for less. Well yes they do but most good champs and mechanically entertaining champs cost the max amount of 6300 BE. Now the point I am making is we work hard and try our best and we get rewarded with a champion that costs about 390 BE to dissenchantadn we get robbed of our hard earned BE that we deserve! I have saved up for 16 days and still dont even have enough for Zac! We need more opprotunities like instead of the daily mission of winning giving us 400 xp and 90 BE we should have a daily xp mission and and a daily BE mission that gives us 1,000 BE. Perhaps we could have a system that we can do new daily missions each day containing a easy, medium and hard daily mission set. Easy being maybe get a double kill for 200 BE. Medium being slay 10 Dragons for 500 BE and Hard being maybe get 20 kills in a game and get 1000 BE. No matter what you implement Riot we demand our BE it is too difficult for higher levels to get champs. I havent gitten a new champ to enjoy in 16 days and I still need to level up 1 more time fo that number may end up being 17 or 18. This is a ridiculous syatem that we are suffering from. We demand change and we want more ways to earn BE becasue the caps that give us at most 1200 BE and the 90 BE a day is robbing us of our time and hard work. \n{{sticker:sg-janna}} \nPlease tell me how you feel about this subject also because personally I hate the BE system and the whole loot system as a whole. \nPlease share this discussion with your friends so we spread the word that we want change! \nAs always feel free to express your opinions and your thoughts on this I am open to ideaqs and any commenst good or bad! Have a wonderful rest of your day or night and good luck out in the rift!","replies":[]}