{"poster":"Her Daddy Bear","date":"2015-05-12T18:41:04.940+0000","title":"Gold 3 Sucht Aktives und Ernsthaftes 5vs5 Ranked Team!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey Liebe LoL Community,\r\nich spiele seit 2 Jahren League of Legends, seit etwa einem halben Jahr wirklich ernsthaft was lernen und Ranked angeht.\r\nIch habe die Jahre in Bronze vergangen, gespielt aus Spa&szlig;, nicht aus Ernst.\r\nIn Dieser Sch&ouml;nen Zeit habe ich von anfang der Season aus Bronze 3, bis jetzt zu Gold 3 &quot; hoch gek&auml;mpft &quot;.\r\nDie SoloQ Ist zwar was sch&ouml;nes, aber ich habe mir gedacht es w&auml;r sch&ouml;n wenn ich Leute h&auml;tte, mit denen ich in einem Team spielen kann und dort die Rangliste aufsteigen kann, also bin ich hierher gesto&szlig;en.\r\nIch habe mir gedacht ich gestalte es ein bisschen wie ne Bewerbung und ne FAQ^^\r\n\r\n1.Warum?\r\nHab Lust in nem Team Ranked zu spielen^^\r\n2.Elo?\r\nGold 3\r\n3.Main Position?\r\nIch f&uuml;hle mich auf ADC und Jungle wohl, bei bedarf auch Midlane.\r\nSchickt mich auf die Toplane oder Support und es ist lost.\r\n4.Main Champ?o:\r\nNidalee.\r\n\r\nEin paar Sachen &uuml;ber mich:\r\nIch spiele LoL Seit 2 Jahren, halbes Jahr ernsthaft.\r\nich bin ein Junge, 14 Jahre alt, und nein: Ich habe keine hohe Piepsstimme, zumindest w&uuml;rde ich pers&ouml;nlich das so behaupten.\r\nIch w&uuml;rde es sehr gut finden, wenn es Zeiten g&auml;be wie z.B.: Jo, wir machen morgen XX:XX Ein paar Team Rankeds, Biste dabei: Ja/Nein?\r\nSpontan ist immer so ne Sache bei mir^^\r\n\r\nDa ich keine Ahnung mehr habe was ich schreiben soll, w&uuml;rde ich mich hier mal verabschieden und mich bedanken f&uuml;r die Aufmerksamkeit.\r\nUnd Nochmal damit es nun jeder merkt: Ich suche ein AKTIVES und ERNSTHAFT gemeintes Ranked Team, Am Besten im Gold/Platin Bereich, KEINE Bronze 3 &quot; Wir Spielen Zum Spa&szlig;&quot; Teams.\r\nTs3 sowie Skype vorhanden, Mikro ebenfalls\r\n\r\nMFG, &quot; Kitty On Hunt &quot; (EUW)","replies":[]}