{"poster":"µßþÿŚŒæÆŽýŁłøûËÐ","date":"2017-03-19T06:10:25.737+0000","title":"Comodín Automático","subforum":"Charlas Generales","up_votes":5,"down_votes":1,"body":"Bueno, les vengo a hablar sobre el molestoso comod&iacute;n autom&aacute;tico, el que nos manda una posici&oacute;n que no queremos ir.\r\n\r\nEl comod&iacute;n autom&aacute;tico hace perder varias partidas, y la verdad creo que la gente prefiere esperar m&aacute;s tiempo en cola que ir una posici&oacute;n que no sepa jugar o que simplemente no quiera ir. Hoy el juego me puso comod&iacute;n autom&aacute;tico y me mand&oacute; ADC ( El rol que peor juego ), termin&eacute; 0/11/2, todos los de la partida pensaron que estaba troleando, de hecho les  tuve que dar esta misma explicaci&oacute;n, a&uacute;n as&iacute; flamearon y me reportaron por &quot;troll&quot;. si se fijan en mi historial, todas las partidas anteriores estan &quot;decentes&quot; por as&iacute; decirlo xd, mi pregunta es, les gustar&iacute;a que quiten el comod&iacute;n autom&aacute;tico?. S&eacute; que muchos de ustedes han estado en mi posici&oacute;n y no es agradable, se supone que est&aacute;s concentrado y motivado con todas las ganas de ganar queriendo ir uno de tus roles favoritos y el juego te manda una posici&oacute;n random.\r\n\r\nOtra soluci&oacute;n ser&iacute;a agregar una tercera posici&oacute;n.\r\n\r\nResponder en la encuesta de abajo. \r\n\r\nY no me vengan con &quot; debes saber jugar todos los roles &quot; porque s&iacute; s&eacute; jugar ADC pero es lo que se me da peor.\r\n\r\nGracias por su atenci&oacute;n.","replies":[{"poster":"9081913DEL1","date":"2017-03-19T16:13:01.878+0000","up_votes":2,"down_votes":0,"body":"**El comodín automático hace perder varias partidas**\n\nOtra frase épica. Es increible lo mucho que se sube en las con ese pensamiento. Siempre vas a tener un rol principal, hasta ahi bien, pero minimamente tenes que poder manejarte en los demas roles, no seras el mejor, pero pasar de soporte a top no te convierte en un fedeer incontrolable.\n\nWardear va a ser igual de efectivo en cualquier linea, no morir sigue teniendo el mismo principio, repartir daño, controlar vision, obtener objetivos, carrear, dejarse carrear. \n\nLo basico sigue siendo lo mismo. Si las pocas partidas que vas comodin las perdes, pensa sobre tu nocion del juego, porque tendrias que darte cuenta que esa partida que vos sos comodin, tenes 4 mainroles jugando ;). Si te pones a pensar con solo no dejarte matar y ayudar al resto vas bastante bien teniendo 4 personas especializadas en lo que estan jugando.\n\nSaludos!","replies":[]},{"poster":"Kyousuke","date":"2017-03-19T15:40:27.116+0000","up_votes":2,"down_votes":0,"body":"era mejor el sistema que estaba en el pbe antes, elegir 2 posiciones y banear 1 para que el comodín te tire cualquiera menos la que baneaste","replies":[]},{"poster":"scorcherbleiser","date":"2017-03-20T07:33:00.748+0000","up_votes":1,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/charlas-generales/X2rdJ6Xq-auto-comodin-y-experiencia-de-juego","replies":[]},{"poster":"gregosss","date":"2017-03-20T03:51:44.690+0000","up_votes":1,"down_votes":0,"body":"es una basofia eso del comodin, siempre sale uno que no quiere ir suporte y terminan pikeando un mago sup sin cc y hechan a perder toda la composicion de equipo, yo preferia el creador de equipos. tardabas 20 min esperando pero era partida que todos disfrutaban","replies":[]},{"poster":"Tecnicomando","date":"2017-03-19T11:09:18.575+0000","up_votes":1,"down_votes":0,"body":"ES un reclamo generalizado,hay tremendos post en el pbe y reddit sobre lo mismo..\n\nA rito no le cuesta nada poner un botón para anular el comodín y esperar mas,pero no lo van a hacer ,por que simplemente no les importa mas que sus estadísticas estén en verde\n\nsalu2","replies":[]},{"poster":"Rohaerlynn","date":"2017-03-19T09:09:16.593+0000","up_votes":1,"down_votes":0,"body":"a mi me encantaria poder elejir comodin menos x posicion, me encanta jugar con variedad al juego, pero no puedo poner comodin porque siempre me va a tocar soporte o jungla y estamos en la misma.\nPD no juego support desde que salio taliyah vamonos alv wey","replies":[]},{"poster":"Zinc","date":"2017-03-19T06:38:56.292+0000","up_votes":1,"down_votes":0,"body":"Me a pasado, y en esos casos SIEMPRE alguien me cambio de rol, aunq tuviera que ir a jugar soporte.\n\nLa solucion es saber jugar soporte y listo, cualquier otro rol si le explicas tu situacion a tu equipo, te lo cambian.","replies":[]},{"poster":"Gretta Thunberg","date":"2017-03-19T07:03:53.060+0000","up_votes":1,"down_votes":1,"body":"La verdad amigo es que el comodin me da lo mismo, siempre pido adc y mid que son como las dos lineas que se me dan mejor, pero soy main adc pienso que mis peores 2 roles son top y jg dejando a supp como en medio por que es un rol bastante divertido de jugar, y si pidiendo esas 2 posiciones me ha tocado jg y top y tengo mis campeones para cada linea es la unica forma de sacarte el comodin ya que no puedes mainear todas las lineas pero si puedes tener 2 campeones por rol con los cuales sepas jugar","replies":[]},{"poster":"Ðoomed","date":"2017-03-19T15:52:51.593+0000","up_votes":1,"down_votes":2,"body":"Debes saber jugar todas las posiciones.{{champion:12}}","replies":[]}]}