{"poster":"NotIntingISwear","date":"2018-09-10T23:00:56.298+0000","title":"A Quantitative look into the low level Botting issue.","subforum":"Help & Support (OCE)","up_votes":3,"down_votes":0,"body":"(I put this in Help, as I believe it may be the best place for an Employee to see the data I have collected, and may be where other players are coming to complain)\r\n\r\nLets start with the facts. This is costing Riot money. Players have already confirmed they have quit the game before getting into it due to the bots they encountered in their early games. \r\n\r\nNow, you may think this title is misleading. It is not. I created this account about 14 days ago. Played ARAM as soon as I unlocked it. This is what I uncovered. \r\n\r\n25 games over 3 days.\r\n7 hours, 16 minutes, 45 seconds spent ingame, excluding loading, Champ Select, Queue time, and post game screens. This was 7.25 hours of PURE gameplay on the howling abyss.\r\n77 Unique Bots Encountered. This is an Average of about 3 unique bots per game, every game.\r\n136 Total Bots Encountered. This is an Average of about 5.5 bots per game, every game.\r\n225 Total Players, excluding myself. 60% were bots.\r\n\r\nNow what was the per day breakdown? Good question.\r\n\r\nDay 1: 8 Games over 5 Hours. \r\nTotal time spent in-game: \r\n2 Hours 5 Minutes 6 Seconds\r\nBots: 52\r\nBot Average: 6.5\r\nUnique Bots: 24\r\nUnique Bot Average: 3\r\n\r\nThis is a bad sign out of 72 players that weren&#039;t myself, 52 were bots. That&#039;s 72% of players in these games were bots.\r\n\r\nDay 2: 7 Games over 4 Hours. \r\nTotal time spent in-game: \r\n2 Hours 18 Minutes 49 Seconds\r\nBots: 40\r\nBot Average: 5.7\r\nUnique Bots: 27\r\nUnique Bot Average: 3.85\r\n\r\nAgain, on day #2, we STILL haven&#039;t improved. Again, 63 players that weren&#039;t me, 40 bots. 63% bot rate.\r\nIt is at this point I&#039;ll mention the ending game I played this day. 57/12. Hard Carried.\r\n\r\nDay 3: 10 Sessions over 8 Hours. \r\nTotal time spent in-game: \r\n2 Hours 52 Minutes 50 Seconds\r\nBots: 43\r\nBot Average: 4.3\r\nUnique Bots: 33\r\nUnique Bot Average: 3.3\r\n\r\nDay #3, honestly improvements. 90 other players, 43 bots. That&#039;s 47%. \r\n\r\nWell, it got better you may ask. So what&#039;s the problem? \r\nI would ask you, did it really? Keep in mind, my last game Day 2 I carried. First game day 3, 22/15. Less than decent, however I clutched out the game, aced the enemy and killed the nexus. The very next game, Game 2 on Day 3, I get Kayn, on a team with 4 bots. Enemy? 4 real players. Why am I forced to lose this game?\r\n\r\nThe issue is absurd for fresh players. I had the advantage of knowing a majority of champions, so I knew roughly how to deal with the enemy, as well as myself, I still found this incredibly unfun. The game was won or lost based on your bot count, to a point where half the time I was genuinely wishing the bots just afk&#039;d, as then I&#039;d get more XP, and the enemies less gold.\r\n\r\nNow comes to the damning evidence.\r\nThe following link is to a txt, you may simply view it in browser, or download it. The formatting is a little messed up because I made it in Notepad++, but oh well. This txt includes every bots name, the times I encountered them, a link to their match history, and the date of the last game they played, as of 5:30am AWST. (If a Riot employee or otherwise forum moderator find the link inappropriate for any reason, take this message as my expressed permission to remove it, at your discretion. [Here](https://files.fm/u/gwvqsxx4) Hover to verify safe link if you don&#039;t trust)\r\n\r\nI share this file so everyone has access to these match histories so you can prove my claims for yourself. It has been 10 days since I played a single game on this account. As of 5:30am:\r\n\r\nBots played 11/9: 1\r\nBots played 10/9: 5\r\nBots played 9/9: 5\r\n\r\nAs a result, I believe of these 77 obvious bots, all of whom I reported every chance I got for inting, cheating, and provided the information that they were a bot in the information box, 15% remain unbanned. And that&#039;s just assuming the bots prior to the 9th ARE banned, and not just inactive due to hitting level 30, or some other reason.\r\n\r\nDo I believe Riot are making attempts? Yes.\r\nDo i believe Riot are doing all they can? No.\r\n\r\nWe know where these botted accounts get sold. The bots are easily identifiable on Champion Select due to a multitude of factors. Factors an alogrithm should be able to detect, and is failing to do so. \r\n\r\nI hope a quantitative look into the botting in low level games helps shed some light onto the matter for Riot, and I hope, for everyones sake, it gets resolved. But it&#039;s been years, I might be hopeful, but I&#039;m not a fool.","replies":[{"poster":"NotIntingISwear","date":"2018-09-19T11:07:31.663+0000","up_votes":1,"down_votes":0,"body":"Alright what the fuck Riot? Some of these bots STILL aren't banned. Not only have they been botting for 20 days, and me naming them a week ago, some played a game just yesterday. The actual FUCK!?\n\n[REMOVED - [Reporting Other Players](http://boards.oce.leagueoflegends.com/en/c/announcements/BjArMH2B-boards-universal-rules)]\n\nHow the fuck are you guys letting bots that have been outed on the forums exist for 2 weeks. How.","replies":[{"poster":"Ninox","date":"2018-09-19T11:43:26.494+0000","up_votes":1,"down_votes":0,"body":"Ok so, I'm the first to admit that bots in low level skewed environments (co-op vs AI, low level ARAM etc) are more present than they should be. It's not easy to remove them from those places simply because of how easy it is to make a new account. If you do ban waves that catch 9% of bots before they hit level 15 that's great, because they don't enter the main population, but they do still ruin too many games. Unfortunately there isn't all that much way around that for many reasons which I won't go into.\n\nOf the accounts you listed (which is against boards rules unless they're confirmed bots so they've been removed) they largely seemed to be either smurfs or genuine new players from looking through their history, with nothing that particularly indicates botting behaviour. One was somewhat suspicious, but mostly just in the name and *some* scores.","replies":[{"poster":"NotIntingISwear","date":"2018-10-14T19:42:30.820+0000","up_votes":1,"down_votes":0,"body":"\"It's not easy to remove them from those places simply because of how easy it is to make a new account.\"\nYes. This I understand. However if you \"Flag\" an account that has a suspicious name, or never changes summoners (Remember the client tells you when you got a new summoner very obviously. A real player would test it) after a reasonable amount of games, of this behaviour, put this account on teams ONLY with other accounts like this. This will not help the harder bots, but will mean a majority of those crappy bots you can recognise on Champ Select will always be stuck not on your team. This means they'll ruin less games, while still getting more information.\n\n\"If you do ban waves that catch 9% of bots before they hit level 15 that's great, because they don't enter the main population\" \nIn my 25 game analysis, I got 77 unique bots. If 9% were banned, that's 7. See a problem here? That's none in the grand scheme of things.\n\n\"they largely seemed to be either smurfs or genuine new players from looking through their history, with nothing that particularly indicates botting behaviour.\"\nAgain. 3 of those had been purchased. As in. They were bots, and suddenly one day went from ONLY aram games with shit scores, to playing ranked with amazing scores. That is INSANELY indicative of botting behaviour. They were likely bought on those insanely public sites you can find by literally googling \"Buy lol account\" and go to G2A..\n\nAlso, though you removed them from the comment, they're still in the post itself in the txt file. One of them even took 7 days after I reported him directly to Riot games in a support ticket before he was actioned. This is where my issue lies. I understand they exist. I understand riot games are \"trying\" but based upon information and belief, they're woefully incompetent at it. \n\nAt this point, the way to deal with these bots is to just STOP banning them. Then the bot creators will stop making 100 to sell 5. They'll flood the market so much that it'll no longer be profitable, and such action will cease. Even if it doesn't cease, less accounts will be made, and as such less bots will exist. \nIs this the best course of action? No. \nIs it the easiest? Yes. \nWill it be effective at protecting them from infesting low level games? Yes. \n\n\"Ok so, I'm the first to admit that bots in low level skewed environments\" \nOh btw, wanna explain how I get the in my Silver 3, level 100, 4 year old account? Thats not a low level game. Yet I still see them in varying quantities, up to 4 per game.","replies":[{"poster":"Ninox","date":"2018-10-15T09:47:46.252+0000","up_votes":2,"down_votes":0,"body":">However if you \"Flag\" an account...\n\nIf you consider when the ban waves go out, and how quick it is to level up, that's basically what happens. There pretty much aren't any bots that make it to lvl 30, only the absolute sneakiest and those get picked up pretty soon after. The only solution would be to do ban waves every day, which isn't done already because it clues the botters into what is detected and what isn't (and at roughly what speed), which Riot tries to avoid given how hard it is as is to stay that step ahead of the botters.\n\n>One of them even took 7 days after I reported him directly to Riot games in a support ticket before he was actioned.\n\nI believe the ban waves are at least weekly, and I know Gehirn bans a lot by hand as well. I'm not 100% on the frequency, but 7 days sounds about right if it was caught in a ban wave (in which case they won't manual ban).\n\n>Will it be effective at protecting them from infesting low level games? Yes.\n\nBut it will destroy the integrity of higher level games instead. At the moment, only a small percentage of players are actually affected, but if those bots are allowed into higher level play, think of the type of players that will use them? Boosters and players with perma banned accounts. So yes you push out one negative aspect, but it all just funnels into another, it's not that simple.\n\n>Oh btw, wanna explain how I get the in my Silver 3, level 100, 4 year old account? \n\nCoop vs AI MMR is all over the place, especially on small regions like OCE. The population is low, and the MMR is separate from normals and ranked. ARAM MMR is also separate, so if you haven't really played it much that would be why. Beyond that, I'm not sure why you're seeing them as much as you are. I've just started a new account and over about 15 co-op vs AI games I've seen about 4 bots.\n\n>These accounts, the most recent played, was 3 weeks ago. 3 of them last played on the 10/9. These accounts were banned, because they were bots, as such I think that it would count as confirmed ;)\n\nAt that point it's rather irrelevant since they're banned anyway, but even if they *were* bots, there is now a real player attached to that account (who may or may not have known that buying accounts isn't ok) and so all the witch hunting and so on rules apply.","replies":[{"poster":"NotIntingISwear","date":"2018-10-30T08:27:27.416+0000","up_votes":1,"down_votes":0,"body":">There pretty much aren't any bots that make it to lvl 30, only the absolute sneakiest and those get picked up pretty soon after.\n\nLike the ones that run Grasp on Lux and Malzahar, and everyone because they never change runes, run Mark and Exhaust, and have a name like \"cVhJames\" \n\nThey're SOOO Sneaky. Its almost as if I can tell its a bot on champ select. What happened to the botted account you removed? A full MONTH before it was actioned. 3 weeks of which I had exposed it, and a week of which I told a staff member in a support ticket. The bots are just 2 sneaky 5 me.","replies":[]},{"poster":"NotIntingISwear","date":"2018-10-15T13:49:21.573+0000","up_votes":1,"down_votes":0,"body":"> ARAM MMR is also separate, so if you haven't really played it much that would be why\n\nhttps://imgur.com/a/HLb9ecT\n\nKeep in mind this is excluding the Butchers Bridge maps. That seem like not much aram to you? https://matchhistory.oce.leagueoflegends.com/en/#match-history/OC1/201592135?map=12\nWhat about this? Not much aram huh? \n\n> who may or may not have known that buying accounts isn't ok\n\nignorance of the rules is not a defence. \"I didn't know\" isn't a defence. \n\nAlso I have no issue with coop vs AI games. This is because there is no real players on the enemy team to take advantage of the 4 bots on your team. Not to mention you can pick your champion, so you don't have to deal with getting a riven on a map where you can't flank, and have to fight as 1 player against 5 real players because you have 4 bots.\n\n>There pretty much aren't any bots that make it to lvl 30\n\nI linked you 5 of them. out of 77. That's 5 too many considering they are blatant, never change runes or summoners, and feed like shit.\n\n>The only solution would be to do ban waves every day, which isn't done already because it clues the botters into what is detected and what isn't (and at roughly what speed), which Riot tries to avoid given how hard it is as is to stay that step ahead of the botters.\n\nYeah, which is what pissed me off when I tried talking to support and they said to say it on the forums. because then the bot creators know what to avoid. Which is fucking useless. And, again, a flag is not a ban. Flag the account and put it on teams with other flagged accounts only, when an algorithm determines it is suspicious. This **_IS NOT_** a ban, and simply segregates it while more information is gathered, and pending a ban wave. There will be false positives, which is why this isn't a ban instantly. I would actively try to 1v5 challenger players 5 games in a row as Sona if it meant I encountered 10% of the bots I do currently. \n\nI am not saying the system right now is useless. I'm saying its ineffective.","replies":[]}]}]},{"poster":"NotIntingISwear","date":"2018-10-14T19:48:24.615+0000","up_votes":1,"down_votes":0,"body":"Btw\n\n\"which is against boards rules unless they're confirmed bots so they've been removed\"\n\nThese accounts, the most recent played, was 3 weeks ago. 3 of them last played on the 10/9. These accounts were banned, because they were bots, as such I think that it would count as confirmed ;)","replies":[]}]}]}]}