{"poster":"FranticFerret","date":"2015-05-16T01:54:37.204+0000","title":"Shaco quality of life buff pls","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"My favourite champion is {{champion:35}}  ({{item:3285}} AP ofc): He has this unique identity amongst assisins in the way that you need to be smart and 100-0 someone, and you can play around a bit instead of just diving in, murdering the marksman, dashing out, like with Zed, or Fizz, etc. He&#039;s a really cool unique assasin which is really flexible. He&#039;s got many different tricks he can do and I feel he is healthy, but there is one trick I like doing, which all too often comes down simply to luck if it&#039;ll work or not, which I think is a shame.\r\n\r\nI&#039;m reffering to standing in a bush, ulting, then having your clone walk out of the bush. Sometimes when you do it, you or your clone, or both, will appear outside of the bush, which completely ruins the plan if you appear out of the bush. So Riot, I&#039;m begging, please make this tiny quality of life buff that will help Shaco&#039;s healthy gameplay, and will cause the success of the plan to be between vision/cunning, not luck: Please make it so if you ult in a bush as Shaco, both you and the clone appear inside the bush. That&#039;s all I&#039;m asking for, and it&#039;ll iron out the only slight kink in what is otherwise the perfect chamption for just messing around and having fun with (without being anti fun for the enemy team, either.)","replies":[{"poster":"Chicken4dinner","date":"2015-05-16T14:41:59.102+0000","up_votes":2,"down_votes":0,"body":"Healthy?\nI played a game against a shaco and died five times out of 6 to that stupid thing, plus he stole dragon at level 4","replies":[{"poster":"FranticFerret","date":"2015-05-17T23:11:37.203+0000","up_votes":1,"down_votes":0,"body":"What I meant when I said his healthy gameplay is that change won't make him any more abusable. :)\n\nHe won't be any more likely to do that with that change. I meant it was a change that wouldn't promote any unhealthy aspects of hit kit. Really, it's a fix so that he can do what he's meant to be able to do.\n\nAnd besides, being able to steal dragon and killing someone a lot doesn't make a champion unhealthy. Shaco has a really high skillcap, so people who are good at him can do some awesome stuff, but they need to be good with him first.","replies":[]}]},{"poster":"JasonWazza","date":"2015-05-16T03:06:41.037+0000","up_votes":2,"down_votes":0,"body":">Shaco's healthy gameplay\n\nhahahahaha\n\nOh wait your serious, my bad.\n\nHAHAHAHAHAHAHAHAHAHAHAHAHA","replies":[]},{"poster":"TouchMyKimchi","date":"2015-05-17T03:53:18.206+0000","up_votes":1,"down_votes":0,"body":"I agree.\n\n......it grinds my gears","replies":[]},{"poster":"Garens Harem","date":"2015-05-16T01:58:22.708+0000","up_votes":1,"down_votes":0,"body":"gut the freelo clown","replies":[]}]}