{"poster":"Lysdexic1","date":"2015-06-23T03:51:08.153+0000","title":"A question i have not seen asked before","subforum":"Story, Art, & Sound","up_votes":25,"down_votes":3,"body":"How does a homeless child living on the streets of Zaun with no access to a lab or expensive materials create a device like the Z drive? {{champion:245}}\n-Edit- sorry, haven't really actually read his lore. I now understand he is not homeless thank you for the replies, but the question still remains. xD","replies":[{"poster":"Bioluminescence","date":"2015-06-23T14:28:58.609+0000","up_votes":22,"down_votes":5,"body":"Well, we have 13 and 14 year olds in our world who build nuclear fusion reactors in their parents sheds and garages.  So with (as GreenLore and Legacy of Xion have mentioned) the advantage of having a home and well-meaning parents, it seems highly impressive, but not impossible, that a kid like Ekko could make something amazing using the bits and parts that could be found in Zaun.","replies":[{"poster":"DamienSolta","date":"2015-06-23T15:40:23.909+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Bioluminescence,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=0003,timestamp=2015-06-23T14:28:58.609+0000)\n>\n> Well, we have 13 and 14 year olds in our world who build nuclear fusion reactors in their parents sheds and garages.  So with (as GreenLore and Legacy of Xion have mentioned) the advantage of having a home and well-meaning parents, it seems highly impressive, but not impossible, that a kid like Ekko could make something amazing using the bits and parts that could be found in Zaun.\n\nWait what? We don't even have controlled nuclear fusion IRL with governments and stuff. I can imagine a kid knowing how to make a fission reactor, but not having the materials. Please, if I'm wrong I want to know cause that is pretty awesome if true.\n\nEdit: I just looked into it, technically at least one youngster has created a device to fuse to atoms together, and the young man was successful. It was a little more involved than just a garage project in the case I found, and required a few thousand dollars in specific equipment and materials that was paid for by his school (hmm maybe Ekko got a grant in the same way). Definitely cool, but not the controlled fusion humanity is searching for, and thank goodness it was extremely low energy and boring (cause yeah, the sun is a big fusion reactor and it's scary).","replies":[{"poster":"Bioluminescence","date":"2015-06-23T15:51:42.680+0000","up_votes":12,"down_votes":1,"body":"> [{quoted}](name=DamienSolta,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=00030002,timestamp=2015-06-23T15:40:23.909+0000)\n>\n> Wait what? We don't even have controlled nuclear fusion IRL with governments and stuff. I can imagine a kid knowing how to make a fission reactor, but not having the materials. Please, if I'm wrong I want to know cause that is pretty awesome if true.\n\nThis is the [wikipedia article about Taylor Wilson](https://en.wikipedia.org/wiki/Taylor_Wilson) - the person who made a reactor when he was 14.  It also mentions Jamie Edwards who did it at 13.  They didn't do it with scavenged parts or anything, but they did do it!","replies":[{"poster":"DamienSolta","date":"2015-06-23T16:04:03.033+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Bioluminescence,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=000300020000,timestamp=2015-06-23T15:51:42.680+0000)\n>\n> This is the [wikipedia article about Taylor Wilson](https://en.wikipedia.org/wiki/Taylor_Wilson) - the person who made a reactor when he was 14.  It also mentions Jamie Edwards who did it at 13.  They didn't do it with scavenged parts or anything, but they did do it!\n\nYep, check my edit I just looked into it. That is some cool stuff. Maybe Ekko got a grant from his school or something. Gotta get that enriched uranium from somewhere.\n\nEdit: Legit real talk, someone somewhere in Runeterra would probably approve a grant for something that crazy. Or private funding from a shady patron. Desperate people with lots of money do strange things.","replies":[]}]}]},{"poster":"Xsoteric Ronin ","date":"2015-06-23T14:56:57.230+0000","up_votes":3,"down_votes":9,"body":"Is it a possibility Lucian and his wife may be his parents? Not entirely because he's black but because of lucians job, hunting evil. Perhaps Lucian and his wife   hunted in zuan for a while? May also explain why their never around.","replies":[{"poster":"Bioluminescence","date":"2015-06-23T15:10:06.416+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=Heliares,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=00030001,timestamp=2015-06-23T14:56:57.230+0000)\n>\n> Is it a possibility Lucian and his wife may be his parents? Not entirely because he's black but because of lucians job, hunting evil. Perhaps Lucian and his wife   hunted in zuan for a while? May also explain why their never around.\n\nI don't know for certain (I'm not privy to that information) but I'd err on the side of them not being directly related.  Quite a few people wondered if the Gambler in the recent River King video was Twisted Fate, for example, but Jaredan has stated that the urge to always have champions related to each other makes the world seem a bit small.  It might be far too much of a coincidence if they were father and son.\n\nHere's [Jaredan talking about the (very tempting) urge to have new champs be really closely connected](http://boards.na.leagueoflegends.com/en/c/story-art/khkWEbWQ-what-the-hell-is-the-lore-team-getting-paid-for?comment=005b0000000000050000), from the outset, to other existing champs.  Note that he's all about champs having stories together _later_ (and the interesting things that come out of that) but maybe not at the start.\n\nBut like I said - I don't know for certain.  I'm not on that team.","replies":[{"poster":"Solideus","date":"2015-06-23T15:22:07.236+0000","up_votes":4,"down_votes":0,"body":"They said there was no relation in the Q&A.","replies":[{"poster":"Bioluminescence","date":"2015-06-23T15:46:52.152+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=Solideus,realm=EUNE,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=0003000100000000,timestamp=2015-06-23T15:22:07.236+0000)\n>\n> They said there was no relation in the Q&A.\n\nHuh!  [You're right!](http://boards.na.leagueoflegends.com/en/c/miscellaneous/xEVZQjPL?comment=019b0000)  I should have read that more closely so I didn't talk nonsense.  My apologies, and props to Solideus for keeping me right.","replies":[]}]},{"poster":"McAllister","date":"2015-06-23T16:03:31.626+0000","up_votes":5,"down_votes":0,"body":"I understand Jaredan's counterurge to clamp down on the they're-related urge, but as we're going on 127 champions, my inclination is that the world will feel plenty big no matter how tightly they're woven together.  Just my $0.02.","replies":[]}]},{"poster":"FuryofThornsRedo","date":"2015-06-23T16:59:27.642+0000","up_votes":1,"down_votes":2,"body":"{{item:3105}} Helaries {{item:3105}} ,\nMy up vote did not reduce you then -1 when I tried to up vote your comment for courage to ask in a curiosity stance. Try not to stop ever in asking questions you are curious about anything, anytime, anywhere, about any subject material. I am bound Loyally to Courage! {{item:3105}} \n\n{{item:3105}} From: FuryofThronsRedo{{item:3105}}","replies":[{"poster":"Xsoteric Ronin ","date":"2015-06-24T08:09:40.082+0000","up_votes":2,"down_votes":1,"body":"Thank you :)","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-24T15:25:54.460+0000","up_votes":1,"down_votes":0,"body":"Welcome\n{{item:3105}} \n\nFrom: FuryofThornsRedo","replies":[]}]}]},{"poster":"Dalenthas","date":"2015-06-23T15:55:49.020+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=Heliares,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=00030001,timestamp=2015-06-23T14:56:57.230+0000)\n>\n> Is it a possibility Lucian and his wife may be his parents? Not entirely because he's black but because of lucians job, hunting evil. Perhaps Lucian and his wife   hunted in zuan for a while? May also explain why their never around.\n\nThis question seems more than a bit racist, even if it's unintentional. There are two black men in League and some people assume they must be related? Is there confusion that maybe Miss Fortune is Annie's mom because they're both redheads? I mean, I think it'd be a pretty important thing to mention when Lucian came out if he had any kids, plus it'd make him go from a heroic character seeking to avenge his lost wife to a total deadbeat abandoning his kid on a quest for vengeance. Plus it was explicitly stated that Lucian and Senna were Demacian, not Zaunite. There is literally zero reason to assume they're related. \nHey, maybe Tristana and Lulu are secretly sisters because they're both Yordles.","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-23T16:32:37.740+0000","up_votes":1,"down_votes":5,"body":"By your description  [\"...deadbeat dad...\"]\n\nSo much for thinking they could try to depict Lucian as a role model in his vengeance career for his child. There is nothing wrong in the brain functioning capacity of human beings to make conclusions based on first associations alone, which, is a proven scientifical behavior action acknowledged psychological line of Study.\n\nAppears to me from your behaviors to post defensively, that maybe when you read magazines, you might be reading with a more guarded and closed communication style, and maybe based on your life personal experiences. There is nothing wrong with Riot League of Legends anticipation to learn about Champion Lore nor is there a wrong in creating Drama Gossip. If the line of communication stories and suggestions for people hopes to have the Lore unwind in time close to maybe how they could ever have concluded about their favorite Champion Ekko, then those fans and their dreams or hopes are achieved.\n\nWas unaware that Spawn a superhero comic made to help appease the (pardon me) (Black fans or audience base for a need to have a Black superhero to be their cartoon superhero role model), was unaware Spawn might have experienced a wrong upbringing from his parents dead beat or not. What is he was neglected? Deny the truth of Spawns existence based on the truth of is life formed inside of the Race he depicts?\n\nCorrect, we are talking about Riot League of Legends Cartoon Artwork. So, maybe a person makes a suggestion using the suggestion as a question in searching about the truth of Ekko's parents. Is there anything wrong now as I might have explained their comment which you replied to as: _Is it a possibility Lucian and his wife may be his parents?_ asked from Heliares (NA)?\n\nOr, better yet, maybe some in the crowd owning the same representation of Skin Pigmentation maybe trying to coordinate the street tactic of only stating or placing a thought out in a conversation as a lure to see which sorts of directions the various answers arrive in which style or lack of taste; all so then anyone of those people could cry \"Racist\" :without any acknowledgement to Freedom of Speech rights and the Human beings we are in owning our opinions and rights to think with our brains regardless of the sound at times.\n\n_Is it a possibility Lucian and his wife may be his parents?_ Also appears to be a question seeking and searching for clarification Directly with manners in knowing they might be asking what might only be divulged in time as a means to being polite to the artists, while also being uncertain if they should ask the question or not.\n\nHeliares appears to have been bold in asking with their first associations connected to psychological foundations inside of studies and continued to ask. Any teacher would be thankful for the level of interest and curiosity to learn more about subject material many people know much less about.\n\nThank you for allowing me to share in the privilege of sharing my side of this clarification Dalenthas opened up his comment reply with: \n_This question seems more than a bit racist, even if it's unintentional._ As they were trying to share their opinions in asking about Helariess' question asked:\n_Is it a possibility Lucian and his wife may be his parents?_\n\nIf there could be for any reason any person upset with what I have shared, truly, my intentions to share this reply were and continue to be in only trying to dismantle people ruining artwork from their not always ethical street education artwork feedback review subject material shared with the skills and styles any sorts of those street people own or other people otherwise defined could own. Should there be a need to debate, or search for clarification about this comment reply post to the original: **A question i have not seen asked before** then please make sure to have your semantics confirmed so there are no fast drawn accusations or generalizations of false assumptions concluded towards ANY of us inside of this Subject Discussion posted on 06/22/2015 around a 10 pm in my time zone, originally.\n\nSincerely, thank you for your attention and time! From: FuryofThornsRedo","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-23T16:56:08.484+0000","up_votes":1,"down_votes":3,"body":"Should there be a concern about maybe me being kicked out for Racist remarks described in my attempt to clarify some of the comment posts replies which I was not initially involved in but included myself to dismantle social discussion revolved around people searching with their own question in return _This question seems more than a bit racist, even if it's unintentional._  as a reply to their concern in this question _Is it a possibility Lucian and his wife may be his parents?_ \n\nShould there be a concern, (c) NMU (c) please define the terms of concerns or quality boundaries of thoughts bound inside of the Dictionary, where the collection of English Language Words are defined, which, we are all defined inside of and in around in time with, while clearly articulating in efficient proper Semantically solid with zero room for debatable questions create of design your comment replies to my comments in this specified communication manner set of skills. The request in how to best present a debate or comment reply in competition of thoughts supporting or opposing the original comment inside of this specific thread line of thoughts would enhance the debate more than a level lacking in semantically clarified thoughts pertaining to this Subject Discussion. (c) NMU (c) From: FuryofThornsRedo {Due to the Genetically Coded Intellectual material please acknowledge ALL (c) inside of this comment post I have created and designed: In Accordance with Riot League of Legends Summoner's Code, Eula, And Disclaimer in partnership with the human being FuryofThornsRedo (c) Accredits their/mine/ my own intellectual Space!\n\nFrom: FuryofThornsRedo","replies":[{"poster":"Dalenthas","date":"2015-06-23T17:36:40.583+0000","up_votes":3,"down_votes":1,"body":"I'll be honest, I tried to understand your reply... I couldn't. Perhaps you should be more aware of your sentence and paragraph structure. You seem to move from one topic to the next, as if you're just typing whatever loose thoughts float through your head. \n\nBelieve it or not, I was trying to help Heliares examine his own thought structure. I pointed out that the racism was probably unintentional, and was attempting to illustrate the point with a comparison he would hopefully find absurd. Hopefully he'd then think about it and realize how offensive his question could be, and be more mindful in the future of his own biases and assumptions.\n\nAt no point did I call for him being banned for asking the question, nor do I wish to see that happen. That's a quick way to turn someone with a little latent racism into someone with blatant racism, as they start blaming the \"PC police\" for all their woes and it spirals downward from there.\n\nOf course, if the racism was intentional, then there's nothing I can do for Heliares, as intentional racism isn't nearly as vulnerable to logic and reason as unintentional racism, but maybe somebody else reading this would be enlightened.","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-24T15:16:56.164+0000","up_votes":1,"down_votes":1,"body":"I could take the time to clarify your comment beginning line opening, but then as you have clearly already stated: you find my sentence structure to be more than a novel in length from sentence to sentence, you along with Coltfan08 tend to think maybe there is a trying to hard or a flow of thoughts presently at this time defined in another quadrant unparalleled to your line of thinking let alone no where near your communication style {thank the heavens, + science + genetics + fate with an early elementary school concussion classifying me into a learning disability + the UNIQUE level of Artistic Abstract mind realm of my congnitive existence resides}, and the tangent criticism of your claim of \"PC police\" is worse than any of my tangents thrown into a discussion far from any lines of thought I ever explained near where you are hoping your claims to the original investigating sentence from Helaries (Is it a possibility Lucian and his wife may be his parents?); continue to search here all you want for a means to claim intellectual debate, however, I refuse to be near any of your future debates. Interesting in how you try to assert an intellectual knowledge of knowing more when you easily illustrate more than one reason why you dislike my comment reply post to the original **A question i have not seen asked before** subject discussion comment post. As for your capacity to visualize the actual substance of intelligence inside of a wall of text, coordinate as such in you area of visual cognitive improvement learning agility to improve upon and claimed with an overall level of dislike serves a purpose which I might highlight in another place inside of the blocks of texts I am creating for cognitive learning for those people who: Own more Patience and Attention Span ability, sound far from any of your generic level of feedback, and your reference to ambiguous thoughts as you closing attempt to reason with wisdom is an attempt and Nothing More than An Attempt. This paragraph concludes the clarifying of Dalenthas and Coltfan08 opinions to sentence structure. (Taking the time to make a copy for the both of you, which is my pleasure to aid in your comment reply to my comments thank you for you time)\n\nSentence structure in the opening of my comment reply these sentence are residing inside of are a creative artwork display and an illustration I as the artist own in creating blocks or walls of texts unfavorable to many eyes, but coordinated as the dis-favorable preference of Dalenthas and Coltfan 08. Not presented to receive feedback of to instigate their opinions; since ALL of MY ARTWORK continues to be created in artistic style, taste and social mannerisms I conclude from my perceptions of the world around me. Funny to me is I have actually made paragraphs inside of this comment post, and have decided to unallow the ease of visual for any indirect asking but nicely stated as feedback. Thank you but you have not earned the means or reward for me to ever want to tailor a message in type or writing more favorable for you reading needs, based on the sound of your performance inside of your own feedback. Biased criticism, with sounding the same as everyone else by critiquing to the same points of obvious mistakes I already know I make to try and fit into an audience already grammatically impaired with attention to details, a note to those whom enjoy reading with sarcasm when the ideas and definition of sarcasm are far from any boundary lines of sarcastic flare {which concludes the readers offering the first suggestion about racism with \n_This question seems more than a bit racist, even if it's unintentional._ from Dalenthas and with Coltfan08 trying to be a supportive comment reply with claiming to be an expert in knowing where the writer of their typed or written thoughts is navigating inside of their own direction when claiming to conclude about me inside of their reply to me with, ~ _Try to be concise with your thoughts in the future, and cut the fancy language crap. All it does is hide whatever you're trying to say._ continues to be their conclusion. A conclusion I will not explain to educate where I cognitively continue to Exist Alone as an Artist. If I was hiding as was suggested, then I would be zero in attendance to any of these subject boards discussions Riot League of Legends delivers as their objectives to their community boards are aligned inside of. Trying too hard, is a subjective opinion, thank you for thinking far from what could never be concluded from your brain efforts about me, other than any of the opinions you are entitled and welcomed to own. Though, Dalenthas and Coltfan08:\nI was not created to exist on the Planet Earth in there being any needs, wants, desires, or any intention in making sure your life is a favorable existence because my efforts inside of my existence conclude this means of existing for your pleasure or for your level of social acceptance concludes this more favorable conclusion inside of your lives. If I am going to share a comment reply post with less visual breaks as paragraphs serve in their purpose, then I could. I was not created to make any of wither of your wishes come true. I serve zero purpose in delivering any enjoyment as any of my comment posts conclude with your dislike and unenjoyable taste inside of the activity time frame to read anything longer than your crayon box could hold intellectually! How could I conclude such an exclamation of thought about the both of you (Dalenthas, Coltfan08) appears the short sentence structure serves your purposes better, but are clearly far from any level of intellectual knowledgeable thought ARTWORK I continue to own. Really? Really the list of sentence style already has been Determined with conclusions directly correlating below sub standard quality, however, I know how to take long sentences and intellectualize to those in elementary school as there continues to be blood proof from those teachings to the youths inside of my family you could never experience in witnessing to observe the proof of your opinions about my sentence structure. I decided to illustrate another aspect rather than be more direct with my thoughts; which one of you stated I was hiding. OK, your opinions, but there are other opinions in contrast to the sentence structure with winding more than 9 times over, since I know I can perform to a better level of achievement and better for there to be more of the less understanding form your stated needs.\n\n(See the Champions play in their passive skills. See the Champions battle. See the Champions work as a team. See the Champions own a word longer than the majority of one syllable words.) Sorry, and excuse me, but I could never allow myself to deconstruct the person I am am talk to a lower level of intellectual thought saturated with knowledge and wisdom.\n\nI refuse to provide the elementary level of sentences to any adult with the capacity to read and write only to make their time management schedule coordinate more to the means easier for them to consume inside of their down time. I will only adapt my sentence structure to those youths in elementary school as I am observing in my life as I am privileged to meet those growing up in life. Based on the needs for the request from both of you and your sentence structure intentional request to demean and deconstruct the level of of intellectual intimidation from your lack of learning agility to perform with your reading skills to adapt inside of new reading experiences enhancing your brain linguistics learning agility to adapt to new communication style maybe more artwork sound inside of; where I know I exist artistically and will not explain any further for anyone inside of these comment replies, while the both of you exist from where your opinions about me have confirmed to avoid and steer clear away from people such as yourselves dismantling the advanced education levels of existence which would only weaken the Educational Core many schools are rooted inside of the Advancement of Educational Growth, which is another psychology school of thought.\n\nInteresting is, why would I claim to think life could be easy for any one person when they are reading any of the comment reply posts I have taken the time to construct with the communication process messages I design in the boundary lines of the English Language enlightened to a cognitive level of human being existence transpiring along correlated potentially upgraded levels of beyond advanced knowledgeable realms of complex compounded thoughts articulated with ease of linguistic artwork sound however, the durability of cognitive human being brain endurance capacity for some people concluding in the same conclusions as schools educate is correct; however, when a writer is creating written exercises for those people needing the commas, sentences with periods, or paragraphs, or even with the thoughts grouped more easily for their intellectual enjoyment and consumption then there is really only so much I could illustrate in performing in contrast to their suggestions. {<<< the sentence in this paragraph with 152 words is created and designed for the intellectual ability endurance exercise illustration purpose I acknowledge}\n\n(c) I have shared what I wanted to share whether consumed in full or in parts, the Level of intellectual Endurance has already been defined from previous opinions both of you asserted and voiced opinions towards me in direct feedback. (c) Thank you for you feedback. I am content, glad, and elevated to a higher artwork educational performance level of knowledgeable existence in teamwork with the knowledge and wisdom Almost all of my Teachers have installed, instilled, bestowed, and delivered with Everyone of my Teachers illustrating the NEEDS and Desires to BE UNIQUE from the social communities around me. (c) My writing and typing artwork of thoughts continue to be created and designed from FuryofThornsRedo with attention to all of the Legalities in accordance with (c) NMU (c) as I have been certified in Accredited Expert Definitions(c). From: FuryofThornsRedo","replies":[]}]},{"poster":"coltfan08","date":"2015-06-23T21:06:55.008+0000","up_votes":2,"down_votes":1,"body":"> Should there be a concern, (c) NMU (c) please define the terms of concerns or quality boundaries of thoughts bound inside of the Dictionary, where the collection of English Language Words are defined, which, we are all defined inside of and in around in time with, while clearly articulating in efficient proper Semantically solid with zero room for debatable questions create of design your comment replies to my comments in this specified communication manner set of skills.\n\nYou're trying way too hard. This sentence makes no sense at all. I don't know if you're trying to be sarcastic here by overdoing it, but it really doesn't come across that way. Try to read this sentence out loud. It's a run-on sentence 5 times over. This is the internet, no one wants to take the time to read your 9 paragraph analysis of someone else's paragraph. Try to be concise with your thoughts in the future, and cut the fancy language crap. All it does is hide whatever you're trying to say.","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-24T15:18:37.585+0000","up_votes":1,"down_votes":2,"body":"I could take the time to clarify your comment beginning line opening, but then as you have clearly already stated: you find my sentence structure to be more than a novel in length from sentence to sentence, you along with Dalenthas tend to think maybe there is a trying to hard or a flow of thoughts presently at this time defined in another quadrant unparalleled to your line of thinking let alone no where near your communication style {thank the heavens, + science + genetics + fate with an early elementary school concussion classifying me into a learning disability + the UNIQUE level of Artistic Abstract mind realm of my congnitive existence resides}, and the tangent criticism of your claim of \"PC police\" is worse than any of my tangents thrown into a discussion far from any lines of thought I ever explained near where you are hoping your claims to the original investigating sentence from Helaries (Is it a possibility Lucian and his wife may be his parents?); continue to search here all you want for a means to claim intellectual debate, however, I refuse to be near any of your future debates. Interesting in how you try to assert an intellectual knowledge of knowing more when you easily illustrate more than one reason why you dislike my comment reply post to the original **A question i have not seen asked before** subject discussion comment post. As for your capacity to visualize the actual substance of intelligence inside of a wall of text, coordinate as such in you area of visual cognitive improvement learning agility to improve upon and claimed with an overall level of dislike serves a purpose which I might highlight in another place inside of the blocks of texts I am creating for cognitive learning for those people who: Own more Patience and Attention Span ability, sound far from any of your generic level of feedback, and your reference to ambiguous thoughts as you closing attempt to reason with wisdom is an attempt and Nothing More than An Attempt. This paragraph concludes the clarifying of Dalenthas and Coltfan08 opinions to sentence structure. (Taking the time to make a copy for the both of you, which is my pleasure to aid in your comment reply to my comments thank you for you time)\n\nSentence structure in the opening of my comment reply these sentence are residing inside of are a creative artwork display and an illustration I as the artist own in creating blocks or walls of texts unfavorable to many eyes, but coordinated as the dis-favorable preference of Dalenthas and Coltfan 08. Not presented to receive feedback of to instigate their opinions; since ALL of MY ARTWORK continues to be created in artistic style, taste and social mannerisms I conclude from my perceptions of the world around me. Funny to me is I have actually made paragraphs inside of this comment post, and have decided to unallow the ease of visual for any indirect asking but nicely stated as feedback. Thank you but you have not earned the means or reward for me to ever want to tailor a message in type or writing more favorable for you reading needs, based on the sound of your performance inside of your own feedback. Biased criticism, with sounding the same as everyone else by critiquing to the same points of obvious mistakes I already know I make to try and fit into an audience already grammatically impaired with attention to details, a note to those whom enjoy reading with sarcasm when the ideas and definition of sarcasm are far from any boundary lines of sarcastic flare {which concludes the readers offering the first suggestion about racism with \n_This question seems more than a bit racist, even if it's unintentional._ from Dalenthas and with Coltfan08 trying to be a supportive comment reply with claiming to be an expert in knowing where the writer of their typed or written thoughts is navigating inside of their own direction when claiming to conclude about me inside of their reply to me with, ~ _Try to be concise with your thoughts in the future, and cut the fancy language crap. All it does is hide whatever you're trying to say._ continues to be their conclusion. A conclusion I will not explain to educate where I cognitively continue to Exist Alone as an Artist. If I was hiding as was suggested, then I would be zero in attendance to any of these subject boards discussions Riot League of Legends delivers as their objectives to their community boards are aligned inside of. Trying too hard, is a subjective opinion, thank you for thinking far from what could never be concluded from your brain efforts about me, other than any of the opinions you are entitled and welcomed to own. Though, Dalenthas and Coltfan08:\nI was not created to exist on the Planet Earth in there being any needs, wants, desires, or any intention in making sure your life is a favorable existence because my efforts inside of my existence conclude this means of existing for your pleasure or for your level of social acceptance concludes this more favorable conclusion inside of your lives. If I am going to share a comment reply post with less visual breaks as paragraphs serve in their purpose, then I could. I was not created to make any of wither of your wishes come true. I serve zero purpose in delivering any enjoyment as any of my comment posts conclude with your dislike and unenjoyable taste inside of the activity time frame to read anything longer than your crayon box could hold intellectually! How could I conclude such an exclamation of thought about the both of you (Dalenthas, Coltfan08) appears the short sentence structure serves your purposes better, but are clearly far from any level of intellectual knowledgeable thought ARTWORK I continue to own. Really? Really the list of sentence style already has been Determined with conclusions directly correlating below sub standard quality, however, I know how to take long sentences and intellectualize to those in elementary school as there continues to be blood proof from those teachings to the youths inside of my family you could never experience in witnessing to observe the proof of your opinions about my sentence structure. I decided to illustrate another aspect rather than be more direct with my thoughts; which one of you stated I was hiding. OK, your opinions, but there are other opinions in contrast to the sentence structure with winding more than 9 times over, since I know I can perform to a better level of achievement and better for there to be more of the less understanding form your stated needs.\n\n(See the Champions play in their passive skills. See the Champions battle. See the Champions work as a team. See the Champions own a word longer than the majority of one syllable words.) Sorry, and excuse me, but I could never allow myself to deconstruct the person I am am talk to a lower level of intellectual thought saturated with knowledge and wisdom.\n\nI refuse to provide the elementary level of sentences to any adult with the capacity to read and write only to make their time management schedule coordinate more to the means easier for them to consume inside of their down time. I will only adapt my sentence structure to those youths in elementary school as I am observing in my life as I am privileged to meet those growing up in life. Based on the needs for the request from both of you and your sentence structure intentional request to demean and deconstruct the level of of intellectual intimidation from your lack of learning agility to perform with your reading skills to adapt inside of new reading experiences enhancing your brain linguistics learning agility to adapt to new communication style maybe more artwork sound inside of; where I know I exist artistically and will not explain any further for anyone inside of these comment replies, while the both of you exist from where your opinions about me have confirmed to avoid and steer clear away from people such as yourselves dismantling the advanced education levels of existence which would only weaken the Educational Core many schools are rooted inside of the Advancement of Educational Growth, which is another psychology school of thought.\n\nInteresting is, why would I claim to think life could be easy for any one person when they are reading any of the comment reply posts I have taken the time to construct with the communication process messages I design in the boundary lines of the English Language enlightened to a cognitive level of human being existence transpiring along correlated potentially upgraded levels of beyond advanced knowledgeable realms of complex compounded thoughts articulated with ease of linguistic artwork sound however, the durability of cognitive human being brain endurance capacity for some people concluding in the same conclusions as schools educate is correct; however, when a writer is creating written exercises for those people needing the commas, sentences with periods, or paragraphs, or even with the thoughts grouped more easily for their intellectual enjoyment and consumption then there is really only so much I could illustrate in performing in contrast to their suggestions. {<<< the sentence in this paragraph with 152 words is created and designed for the intellectual ability endurance exercise illustration purpose I acknowledge}\n\n(c) I have shared what I wanted to share whether consumed in full or in parts, the Level of intellectual Endurance has already been defined from previous opinions both of you asserted and voiced opinions towards me in direct feedback. (c) Thank you for you feedback. I am content, glad, and elevated to a higher artwork educational performance level of knowledgeable existence in teamwork with the knowledge and wisdom Almost all of my Teachers have installed, instilled, bestowed, and delivered with Everyone of my Teachers illustrating the NEEDS and Desires to BE UNIQUE from the social communities around me. (c) My writing and typing artwork of thoughts continue to be created and designed from FuryofThornsRedo with attention to all of the Legalities in accordance with (c) NMU (c) as I have been certified in Accredited Expert Definitions(c). From: FuryofThornsRedo","replies":[]}]}]}]},{"poster":"BlackSunNocturne","date":"2015-06-24T05:00:56.724+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Dalenthas,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=000300010001,timestamp=2015-06-23T15:55:49.020+0000)\n>\n> Is there confusion that maybe Miss Fortune is Annie's mom because they're both redheads? \n\nDude. Annie is _8_, Miss Fortune was confirmed to be like 16-19\n\nI _SEVERELY_ doubt MF got pregnant at around 8 to 11 years old.","replies":[]},{"poster":"Xsoteric Ronin ","date":"2015-06-24T08:03:44.562+0000","up_votes":1,"down_votes":2,"body":"Firstly I fail to see how a black person can be racist towards his own race? I believe you meant racially stereotyping. Secondly you cannot deny the fact that in fiction, many minority characters are portrayed as related or having some sort of relationship in a predominantly (insert other race here) show or medium. So even IF that was my thought structure it wouldn't be nearly as absurd as you seem to claim sir .yes, my reasoning was partially due to their race however you act as If I  was perpetuating the idea solely based off of that when I made it clear I had other fuels for the question.\n\n\nI also disagree. I think the prospect of a father son duo and hidden lore within league interesting to say the least. You also have to consider my post was purely speculative in nature\n\nOf course the point is moot seeing as my question was answered","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-24T15:38:25.850+0000","up_votes":1,"down_votes":1,"body":"Having Grown from Infant near and close to the referenced (... black person...) culture, I could not only debate Racism could sound Racist from the culture spotlight of the Racist comments; however, those in my elementary school teaching where I was growing up Jewish before the 1980's (classifying me as White  Human Being Genetically Pigmented from birth, as I will share) and also Christian; though will Explain the composition of my Genetics and teaching no further; those adults in my life near to the teaching from the 1960's was more than an up close an personal experience of Racism based on the Heretic Opinions thrown and voiced with opinions towards me and about me while I was growing up in school with the socially unaccepted religious blend of the dual religions I own as both Jewish and Christian. {Based on my early childhood experiences I know what sorts of friends I am attracted to with said varying personality types more compatible than other personalities. Another life fact.} {Only mentioned what I could debate, I am not opening this observation I have witnessed inside of my life. No proving wrong, only stating what I have witnessed and what I could debate about in reference to the first sentence inside of this comment post. I continue to be glad to have been able to help you earlier Healaries.}\n\nMuch needed here \" Truth will be heard.\" {{champion:131}}  Truth in my life will be shown and illustrated with picture needs:\n{{item:3751}} {{item:3751}} {{item:3751}} {{item:1052}} {{item:1052}} {{item:1052}} {{item:3065}} {{item:3146}} {{item:2003}} {{item:3105}} {{item:3105}} {{item:3105}} {{item:3751}} {{item:3751}} {{item:3751}} \n\nFire flames in Memory to those Blood Line Loved ones connected in memories in my life Forever and Eternally infinite!!!\n\nEdit:\nFor some maybe saw the ward item I originally selected in the items list above. I have decided that these two {{champion:16}}  {{champion:131}} share the most light for me artistically and Fire continues to be the only source of heated light I need. Nope, I am genetically coded to a Sun Zodiac Sign, Too Bad! Another Fact.\nFrom: FuryofThornsRedo","replies":[]}]},{"poster":"commit an hero","date":"2015-06-23T19:27:39.593+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Dalenthas,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=000300010001,timestamp=2015-06-23T15:55:49.020+0000)\n>\n> This question seems more than a bit racist, even if it's unintentional. There are two black men in League and some people assume they must be related? Is there confusion that maybe Miss Fortune is Annie's mom because they're both redheads? I mean, I think it'd be a pretty important thing to mention when Lucian came out if he had any kids, plus it'd make him go from a heroic character seeking to avenge his lost wife to a total deadbeat abandoning his kid on a quest for vengeance. Plus it was explicitly stated that Lucian and Senna were Demacian, not Zaunite. There is literally zero reason to assume they're related. \n> Hey, maybe Tristana and Lulu are secretly sisters because they're both Yordles.\n\nI don't think you know what racism is.","replies":[]}]},{"poster":"TwoD","date":"2015-06-23T23:18:55.366+0000","up_votes":2,"down_votes":0,"body":"That's like asking as if Master Yi and Xin Zhao were the gay parents of Lee Sin, but not because they're Chinese? wtf?","replies":[{"poster":"Xsoteric Ronin ","date":"2015-06-24T08:09:08.018+0000","up_votes":2,"down_votes":2,"body":"The very nature of the two are different and I have no idea how you could compare my question  with  that, nit to sound rude.","replies":[]}]},{"poster":"Chromatic Eagle","date":"2015-06-23T18:09:16.262+0000","up_votes":2,"down_votes":0,"body":"They've explicitly stated they are not related.","replies":[]}]},{"poster":"Legacy of Xion","date":"2015-06-23T14:56:53.320+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bioluminescence,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=0003,timestamp=2015-06-23T14:28:58.609+0000)\n>\n> Well, we have 13 and 14 year olds in our world who build nuclear fusion reactors in their parents sheds and garages.  So with (as GreenLore and Legacy of Xion have mentioned) the advantage of having a home and well-meaning parents, it seems highly impressive, but not impossible, that a kid like Ekko could make something amazing using the bits and parts that could be found in Zaun.\n\nBiolumenesence, thank you for being awesome.","replies":[]}]},{"poster":"Legacy of Xion","date":"2015-06-23T04:27:51.017+0000","up_votes":10,"down_votes":3,"body":"Apparently Ekko's parents are still alive and well, not gone or dead. Just always, always busy.\n\nYes, Ekko is not homeless or poor. Enjoy that plothole","replies":[{"poster":"Solideus","date":"2015-06-23T14:36:21.214+0000","up_votes":3,"down_votes":1,"body":"How is that a plothole? Neglected teens joining gangs and roaming the streets making trouble isn't an unusual phenomenon.","replies":[{"poster":"Legacy of Xion","date":"2015-06-23T14:56:27.983+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Solideus,realm=EUNE,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=00010000,timestamp=2015-06-23T14:36:21.214+0000)\n>\n> How is that a plothole? Neglected teens joining gangs and roaming the streets making trouble isn't an unusual phenomenon.\n\nHe has a good relationship with his parents, and clearly not poor. Hence literally no reason to send Ajuna out since they clearly have enough.","replies":[{"poster":"Valaran Nara","date":"2015-06-23T15:33:10.046+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Legacy of Xion,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=000100000000,timestamp=2015-06-23T14:56:27.983+0000)\n>\n> He has a good relationship with his parents, and clearly not poor. Hence literally no reason to send Ajuna out since they clearly have enough.\n\nIn the comic he said \"We didn't need food.\" There was *NO* reason for him to send Ajuna out in the first place.  He did so because he was upset for some odd reason or was just too busy, so he sent him out to get Ajuna out of his hair.  Then...you know what happens, and he feels guilty as shit.  It's one thing if they needed the food. Then it's \"Oh no.  What have they done?\"  But, he sent him away, so he won't be bothered. It's his fault, so it's \"What have I done?\"","replies":[{"poster":"Legacy of Xion","date":"2015-06-23T17:19:28.408+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Valaran Nara,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=0001000000000001,timestamp=2015-06-23T15:33:10.046+0000)\n>\n> In the comic he said \"We didn't need food.\" There was *NO* reason for him to send Ajuna out in the first place.  He did so because he was upset for some odd reason or was just too busy, so he sent him out to get Ajuna out of his hair.  Then...you know what happens, and he feels guilty as shit.  It's one thing if they needed the food. Then it's \"Oh no.  What have they done?\"  But, he sent him away, so he won't be bothered. It's his fault, so it's \"What have I done?\"\n\nYeah, but why would Ajuna really need to steal if Ekko wasnt poor? I'd think Ekko'd give him enough money to, you know, buy said food. So Ajuna decided to randomly pickpocket someone?\nYeah, happens all the time. Doesn't mean I have to like the fact it doesn't make a super big amount of sense.","replies":[{"poster":"Valaran Nara","date":"2015-06-23T17:56:24.130+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Legacy of Xion,realm=NA,application-id=6kFXY1kR,discussion-id=7jmmYyww,comment-id=00010000000000010000,timestamp=2015-06-23T17:19:28.408+0000)\n>\n> Yeah, but why would Ajuna really need to steal if Ekko wasnt poor? I'd think Ekko'd give him enough money to, you know, buy said food. So Ajuna decided to randomly pickpocket someone?\n> Yeah, happens all the time. Doesn't mean I have to like the fact it doesn't make a super big amount of sense.\n\nWhy would he bother pickpocketing?\n\nHere's the thing. You believe that PIlty ov-stop. I know.\n\nYou believe the man in a trench coat and bowler hat, who comes from an \"uptown\" like city that sees itself as wealtheir and better off.  He decides to take a stroll through the gutters and area he knows is dangerous.  He is strapped with a gun (which means he knows how to use it and has no qualms about shooting somebody in self defense).  This man, who is most likely in Zaun to do some illegal activities, drug dealing, gun trading, smuggling, so on and so forth, said that he was getting pick pocketed by some random child and proceeded to shoot in self defense.\n\nWhen Ekko assaulted him, he said \"He was trying to pick pocket this.\" He pulled out a gun and then shot.  That means, he possibly said that to do \"yeah, he tried to--BAM BAM!\"  The man shot the child and walked off WHISTLING! he was whistling like nothing ever happened.  As if shooting people was an everyday thing.","replies":[{"poster":"Chromatic Eagle","date":"2015-06-23T18:13:17.000+0000","up_votes":2,"down_votes":0,"body":"Which oddly enough, makes him a more interesting character than Ekko. Same with the video. They need to work on that, or commit to giving Ekko a Rogue's gallery.","replies":[]}]}]}]},{"poster":"Solideus","date":"2015-06-23T15:19:48.651+0000","up_votes":3,"down_votes":1,"body":"If they are always busy and not around that seems like a legit reason for him to be out and about. Teens are influenced _a lot_ by the people they spend time with, and he lives in Zaun of all places. What made you think he had to be poor or homeless? he's just a kid hanging around with other kids from the neighborhood and getting into trouble.","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-23T15:24:09.446+0000","up_votes":3,"down_votes":3,"body":"Kids usually have no Jobs, which confirms teen have no money. So, Mommy and Daddy must be paying for him to have fun. Or, then he is a criminal to help self-fund himself; which with the self-funding a large majority of teens self-fund with criminal behavior. My opinion is he is no genius as I illustrated above. He might have stolen the weapon from a military base which his dad might have helped him to get into based on some of these other ideas.\n\nFrom: FuryofThornsRedo","replies":[{"poster":"Solideus","date":"2015-06-23T15:29:35.156+0000","up_votes":3,"down_votes":1,"body":"They said he built his machine himself in the Q&A. As for materials, there's probably a lot he can salvage himself in Zaun.","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-23T15:33:34.275+0000","up_votes":1,"down_votes":2,"body":"Sure, agree.\nBuilt his weapon as per Q & A but only after the Stolen Parts were collected. Try not to forget the back stories in the Lore which in time reveal those Difficult Truths to Digest at the majority of times for most people.\n\nMy communication process code of Ethics defines me in another direction furthest and beyond far from this champion, EVER! THANK GOODNESS!!! {Fact equals to a positive affirmation about myself which I am allowed to own.}\n\nFrom: FuryofThornsRedo","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-23T15:38:30.997+0000","up_votes":1,"down_votes":2,"body":"As far as I Confirm, scientifically making metal is beyond knowledge bound with Accredited Upgrade Upscale Advanced Level of Education.\n\nHanging out as a Teenager is unaccredited street level education.\n\nOwn the Truth if other people claim to like and enjoy their Champion in their lives Ekko. Embraces his truths and make him more sound. Ekko continues to be weak as a Champion when those he could ever inspire continue to deny the truth about his existence.\n\nFrom: FuryofThornRedo","replies":[]}]}]}]}]}]}]}]},{"poster":"GreenLore","date":"2015-06-23T08:24:20.570+0000","up_votes":5,"down_votes":2,"body":"Ekko still has parents and is probably a teen genius.\n\nAside from that he might have had learned some stuff from someone else in one way or another.\nFor example what if he found one of zileans inventions,analyzed it and uses the knowledge that he gained by analyzing this machine to create the Z-Drive?","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-23T15:17:19.279+0000","up_votes":1,"down_votes":6,"body":"A _teen genius_ then would know Hot-To-Not be a traitor and kill a fellow teammate {{champion:16}}  with his greed to turn time backwards for me {{champion:16}}  to have two go arounds at low health against Karthus {{champion:30}} , and think he could try to Champion more than one Champion at the same time along with Champion more than one role. Clearly with his decision to turn time back and force me{{champion:16}} to heal him at low health only illustrates his LACK of genius!\n\nI selected bot. But took a round at healing top lane. Then after giving my life to heal my teammates in top lane with my W, I decide to return to bottom lane healing in the long hike back. Was my understanding to stay way clear of Ekko so I would not be included in his time turning backwards. If I was not then here is another replay option. I hike past middle lane, and with the half life am air vacuum cleaner sucked to lower health from {{champion:30}} and move along. Then with a few seconds of self healing with potion {{item:2003}}  I move along, but then Ekko turns time backwards but to a place inside of his battle where my health is too low and my life is over immediately when {{champion:30}}  receives a replay in his air vacuum cleaner suck. So, the better option would have been Ekko ulting as I reached middle lane not after his first failed attempt against {{champion:30}}  and after my health is much lower. The BEST option would have been to wait a few seconds longer for me to be in the clear in the bottom lane.\n\n{{champion:16}}  I Am Support and I make the Decisions WHEN TO Heal!!!\n\nFrom: FuryofThornsRedo","replies":[]}]},{"poster":"Ultimate Snipe","date":"2015-06-24T01:35:13.541+0000","up_votes":2,"down_votes":0,"body":"Another reason why Riot should actually add lore.","replies":[]},{"poster":"CrazedPorcupine","date":"2015-06-23T16:08:01.680+0000","up_votes":2,"down_votes":0,"body":"in the Ekko Q&A, they explain that Ekko isn't homeless and he's not an orphan. He just stays out on the streets more often because his parents are never around.","replies":[]},{"poster":"MVDuneCats","date":"2015-06-23T16:49:35.146+0000","up_votes":3,"down_votes":1,"body":"The Z drive was the prize in his cereal box.","replies":[]},{"poster":"CyberDeath1337","date":"2015-06-23T03:56:50.765+0000","up_votes":4,"down_votes":2,"body":"He didn't.","replies":[]},{"poster":"Dextix LT","date":"2015-06-23T14:51:23.386+0000","up_votes":3,"down_votes":2,"body":"Oh, nothing was explained in the new lore about him? Im schocked! (sarcasm)","replies":[]},{"poster":"lightdragoon88","date":"2015-06-23T16:22:44.326+0000","up_votes":2,"down_votes":1,"body":"Homeless? You might want to read up a bit on Ekko.","replies":[]},{"poster":"Dalenthas","date":"2015-06-23T16:00:35.882+0000","up_votes":2,"down_votes":1,"body":"New head-cannon: Ekko went back in time and gave his younger self the Z-Drive, making it's existence an Ontological Paradox. He's still a genius because he took that and reverse engineered it so he can repair it when necessary, but the first Z-Drive came from nowhere. Or nowhen? {{item:3157}}","replies":[{"poster":"FuryofThornsRedo","date":"2015-06-24T15:23:47.717+0000","up_votes":1,"down_votes":1,"body":"Far from genius with an Ontological Paradox. Only could open the doors to said roots of problems.\nHope this comment reply is short enough for your level of knowledge to consume, far be it from me to think a level of intellectual endurance is important. Also, bet you continue to have zero time in reading my longer than 9 x over reply shared to you above in another threads of thought comment reply post! Stating the fact, and thank you for you time in allowing me the privilege to share feedback in reference to Ontological Paradox.\n\nFrom FuryofThornsRedo {{item:3105}}","replies":[]}]},{"poster":"High5","date":"2015-06-24T05:17:01.302+0000","up_votes":1,"down_votes":1,"body":"He's the Bill Gates of Zaun.","replies":[]}]}