{"poster":"NoobGamer4990","date":"2018-07-16T19:50:52.851+0000","title":"Wieso kein Permabann?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":7,"body":"Wieso habe ich kein Permabann bekommen und nur einen 2 Wochenbann?, schaut euch meine 2 letzten Spiele an, ich wollte weiter machen da ich so hart tilted war wegen der Community, aber ich dachte mir... egal das reicht f&uuml;r ein Permabann. \r\n\r\nIch habe auch ingame &Uuml;BER 1000 MAL &quot;KYS&quot; geschrieben ich habe es immer Kopiert und eingef&uuml;gt, ich habe ALLE zu geflamet, habe running down mid gemacht und das 2 Games lang.\r\n\r\nIch habe auch geschrieben &quot;Riot give me a IP permabann&quot;. Ich habe alles scheiss geschrieben.\r\n\r\nIhr denkt euch jetzt sicher; &quot;Der Typ hat doch eine schraube locker&quot;, diese Frage kann ich nur verneinen, die Schraube ist gestern gefallen, Sona hat mir was geschrieben im Nasus Game und dann ist es passiert, all die Wut die ich nach 4 Jahren lol angesammelt habe, all dieser Hass der Community, ALLES habe ich in den letzten 2 games Raus gelassen.\r\n\r\nIch selber Flame grunds&auml;tzlich nie au&szlig;er man beleidigt mich, dann schreibe ich meist &quot;STFU&quot; danach mute ich ihn. \r\n\r\nIch weiss, Spieler so wie ich versauen das Spiel, aber h&auml;tte es diese Spieler nicht gehabt, w&auml;re das Gestern nicht passiert, ist wie eine Kettenreaktion, einer f&auml;ngt an und es geht weiter. \r\n\r\nZur&uuml;ck zu meiner Frage, wieso habe ich den keinen Permabann, sowas SOLLTE meiner Meinung nach mit einem Permabann bestrafft werden da sowas KOMPLETT keine 2. chance verdient hat, was ich Gestern geleistet hab. \r\n\r\n(Ps. soviel ich weiss gibt LoL keine IP banns.)","replies":[{"poster":"Released Ape","date":"2018-07-16T22:56:18.678+0000","up_votes":6,"down_votes":1,"body":"Wenn, du möchtest kann der Support deinen Account auch löschen: https://support.riotgames.com/hc/de\n\nAnsonsten sind die 2 Wochen Pause doch super um auf andere Gedanken zu kommen. Ich wurde gestern auf meinem anderen Account auch 3 Spiele hintereinander nicht mit Liebe überschüttet, aber passiert:\n\nGame 1: Nachdem ich als Midlaner beim Red nicht \"gut\" gepullt habe (Botlane hat nicht gepullt, also meinte der Jungler ich solle pullen - weil sein Mate auf der Bot die Gegner mit Heimerdinger im Busch abfangen wollte). Habe dann als Morgana eine W gesetzt und bin Mitte, aber nein - nicht mit dem Graves! Da habe ich die Rechnung falsch kalkuliert. Also kam der Graves nach jeder neuen Wave und hat versucht alles zu nehmen und das 10 Minuten konstant und jede Bitte ignoriert. Dann hat er geschrieben \"Next time, help me fgt :)\". Danach war ich zufrieden, ich konnte ihn jetzt problemlos reporten und bekam bereits in der Que ins nächste Spiel eine ISF Benachrichtung das jmd gepunished wurde. [Spiel haben wir komischerweise verloren].\n\nGame 2: Jungler wollte nicht Junglen pickt letzte Sekunde top und sagt ich solle Jungle gehen. Gut gehe ich eben Jungle, bekomme keinen Pull und frage ob der Toplaner (der eigl. Jungle sollte) einen Ward zum Blue setzen kann. Keine Reaktion, werde beim Blue dann auch vom Graves getötet. Dann werde ich geflamed, das gesamte Spiel über ist Graves im Jungle - ich fighte mit meinem Midlaner gegen Graves, Ahri und Yorick - während unsere Top sich oben einen abfarmt. Kann ja passieren, aber unserer Midlane wurde das auch zu doof, jedes Mal 2v3 zu kämpfen und ist dann auch auf einen \"ff15\" train der Botlane aufgesprungen. Toplaner hat dann im All Chat gelogen und geschrieben das ich ihm Jungle geklaut habe wtf. Wurde aber recht schnell richtig gestellt von meinem Team. [Spiel haben wir komischerweise verloren]. Habe dann auf die History des Spielers geschaut und eine 12-er Losing Streak erblicken können.\n\nGame 3: Lief ganz gut bis ich den Kill \"geklaut\" habe. Habe auf der Toplane als Aatrox Mundo von 100 auf 0 getötet und unsere Kindred sah das ich ihn gerade dive und ist über die Wall geflashed und wollte sich einen Stack abholen. Aber da ich Mundo knapp getötet habe und nur wegen meiner Ulti rauskam - konnte ich auch nicht länger warten bis sie den Kill ohne jegliche Hilfe an sich nimmt. Das was der Kindred zu viel und sie ist 4-Mal Toplane in den Turm gegen Mundo gerannt, dann hat sie Midlane und Botlane dasselbe getan. Seitdem hat sie aber auch kein weiteres Spiel gespielt. [Und ja auch das war verloren].\n\nGame 4: Sehr flamelastig, aber knapp gewonnen - ich hab gemerkt das ich leicht tilted bin und habe das Spiel für den Tag geschlossen.\n\nUnd das passiert häufiger, aber entweder man akzeptiert es oder auch nicht. Was bringt es mir mich darüber unendlich lange aufzuregen, wenn es gerade nicht so will kann ich es schlecht erzwingen. Also pausiere ich und bringe mich auf andere Gedanken, viele können das auch 20 Spiele einstecken - ich kann nach 5 schlechten Spielen nicht mehr normal spielen und daher zwinge ich mich sobald ich merke das es langsam nicht mehr geht aufzuhören. Bisher wurde ich nie gebannt und bin damit sehr gut gefahren, über die Zeit hat sich die Spielzahl gesteigert und ich werde immer schwerer tiltbar. Aber run-it-down mach ich nicht, den Gefallen tue ich meinen Gegnern nicht - den All Chat deaktiviere ich mittlerweile. In 1-2 Spielen von 1000 würde sich der All Chat lohnen, aber in mindestens 10 stört der Gegner Chat einen nur extrem. Hat mich aber auch einige Jahre gekostet den zu deaktivieren, man glaubt ja im inneren noch an einen guten Nutzen und daran das man alles ignorieren kann. Aber ich weiß das mein Unterbewusstsein das anders sieht.","replies":[{"poster":"Trap Tristana","date":"2018-07-17T01:14:48.879+0000","up_votes":4,"down_votes":2,"body":"Gute Einstellung... Ich habe aber auch im Moment das Gefühl, dass alles etwas schlimmer ist. Alle ADC-Mains sind getriggert (bei mir geht's soweit noch) und \"müssen“ auf andere Rollen ausweichen und sind permanent tilted. Ich habe vor kurzem 3-4 Games Bot mit einem Kumpel gezockt, immer Yasuo+ Pyke oder Vladimir + Fiddle und habe unfassbar viel toxicity erfahren, obwohl wir jedes game gefühlt 2v8 gespielt haben (haben auch viel verloren, teilweise aus eigener Schuld). Aber ich bin guten Mutes, dass Riot ADC wieder bufft, wir ADC-Mains wieder in unserer alles ist OP außer wir geweine zurückfallen können, obwohl ADC broken ist und sich die Lage etwas motiviert... Dies darf meinetwegen auch noch bis zu 3-4 Patches dauern, da ich atm sehr viel Spaß an LoL habe, aber das toxicity Problem hängt wahrscheinlich eben von der Dauer der toten ADCs ab (unteranderem). Ich selber rege mich natürlich auch auf über vieles, halte mich aber zurück und bin eher sarkastisch aggressiv, also im Sinne von \"you know, I can fight off the enemy minions all by myself, dear [Jungle/Support]\", wenn mir farm geklaut wird. Allerdings kann ich auch viel wegstecken. Nur muss die Community von LoL das auch lernen. Zum Beispiel habe ich gestern mit einem Dr. Mundo gespielt, der mir Worte in den Mund gelegt hat, meinen Wunsch ihn für extreme toxicity zu reporten als flame ausglegt hat und komplett hohlgedreht ist. Ich habe es dann einfach beim klassischen \"x9 Mundo\" belassen und habe mein Ding gemacht und im Endeffekt das Spiel auch gewonnen. Was ich mit all dem unstrukturierten Wirr-Warr safen will ist, Du hast sehr Recht, bist ein gutes Beispiel, aber es ist notmal, dass man mit flamern spielt, dafür ist es umso schöner, wenn man irgendwelche lustigen Dinge mit randoms tut, wie z.B: einander leben lassen oder sonstigen Müll. Also: Härtet ab und habt Spaß am Spiel :)","replies":[]},{"poster":"Sry ShacoWasOpen","date":"2018-07-17T20:48:23.478+0000","up_votes":1,"down_votes":0,"body":"Wer hat gefragt?","replies":[]},{"poster":"ConradhKaX","date":"2018-07-17T14:15:27.802+0000","up_votes":1,"down_votes":3,"body":"Wie schlecht muss man als graves sein um einen pull zu benötigen. Wtf","replies":[{"poster":"eingew","date":"2018-07-18T04:19:49.453+0000","up_votes":1,"down_votes":0,"body":"Du hast \"schnell\" falsch geschrieben.","replies":[]}]}]},{"poster":"PX0 Soulfrezze","date":"2018-07-16T23:14:56.161+0000","up_votes":3,"down_votes":2,"body":"Fühlt sich gut an anderen die games zu versauen weil du ein egoist bist oder?","replies":[{"poster":"NoobGamer4990","date":"2018-07-16T23:26:12.361+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"PX0 Soulfrezze","date":"2018-07-16T23:32:01.045+0000","up_votes":4,"down_votes":3,"body":"Alter wenn du nicht zocken willst lass es aber ruinier nicht anderen den spaß am spiel wegen leuten wie dir ist dieses spiel so unbeliebt","replies":[{"poster":"NoobGamer4990","date":"2018-07-16T23:43:30.037+0000","up_votes":1,"down_votes":4,"body":"Das Spiel ist Grundsätzlich nicht unbeliebt, es ist zurzeit immer noch auf Platz 2 hinter Fortnite so viel ich weiss. Also diese Aussage mit dieses Spiel ist so unbeliebt ist totaler quatsch. \n\nDie Community ist die Schlimmste, LoL hat den Ruf eine EXTREM SCHLECHTE Community zu haben, und Gegensatz zu mir gibt es Leute die Hacken und Smurfs erstellen um nur anderen das Spiel zu versauen. \n\nIch vermute sogar das du ein Flamer bist, so wie du schreibst glaube ich das sogar sehr. Und Flamen ist auch ein Grund warum die Community so einen schlechten Ruf hat.","replies":[{"poster":"PX0 Soulfrezze","date":"2018-07-16T23:46:23.279+0000","up_votes":3,"down_votes":0,"body":"1. Gibt es keine hacks höchsten scripts\n2. ist die Community toxic wegen leuten wie dir die meinen anderen unschuldigen leuten die Spiele zu ruinieren da gibt es keine ausrede hör auf zu spielen oder spiel aber hör auf ein Schadensfroher Mensch zu sein ich mein wtf?","replies":[{"poster":"NoobGamer4990","date":"2018-07-17T00:04:32.954+0000","up_votes":2,"down_votes":3,"body":"1. Such mal die Bedeutung von Hack. Script ist eine nicht erlaubte Programmierung von Leuten die sich Unberechtigt in das System von LoL das Spiel zerstören.\n\n2. Die Community ist Toxic wegen Leuten wie mir, da gebe ich dir Recht aber wieso bin ich den so Toxic gewesen? O.o, GENAU wegen der Community, es ist eine Kettenreaktion, der nächste Tilted weiter, und so gehts immer weiter. Es hört nicht auf, es ist LoL. \n\n3. PS. SCHADENFROHER MENSCH, also Entschuldigung für meine Wortwahl, aber bist du Dumm, oder hast du noch nicht lesen gelernt, hast du mein Forum Beitrag nicht gelesen?! Wäre ich schadenfroh hätte ich weiter gemacht wie du vlt. lesen konntest, ich habe es aber nicht da ich nicht Schadensfroh bin.\n\nIch habe es gemacht für einen Permabann, deswegen habe ich diese DUMME Aktion durchgefüht und um meinen Frust abzubauen um andere zu schaden. Aber das macht mich nicht zu einem Schadensfroher Mensch, wäre ich das, hätte ich weiter gemacht. \n\nPS. Ich habe so 4-6 LoL Acc's, ich könnte jetzt einfach weiter machen mit dem inten, aber ich bin kein Schadensfroher Mensch.\n\nDiese Logik gibt keinen Sinn. Wenn man 1x was machst, ist man das ja nicht ganze zeit. Ich bin also kein Schadensfroher Mensch, ich hoffe du hast das verstanden.","replies":[{"poster":"PX0 Soulfrezze","date":"2018-07-17T00:34:32.375+0000","up_votes":4,"down_votes":0,"body":"Nein es gibt kein \" ich bin toxic deswegen \" das sagt jeder wenn es keiner wäre gäbe es auch keine\ndu trollst für einen bann games = Schadensfroh fertig aus.","replies":[{"poster":"NoobGamer4990","date":"2018-07-17T00:46:26.695+0000","up_votes":1,"down_votes":4,"body":"Ay, Konstruktive Kritik kannst du wohl nicht vertragen, schade.","replies":[{"poster":"PX0 Soulfrezze","date":"2018-07-17T01:03:04.156+0000","up_votes":3,"down_votes":0,"body":"Kann ich auch so sagen \n\" Die Wahrheit verträgst du nicht \" \nSchade ;/","replies":[{"poster":"NoobGamer4990","date":"2018-07-17T01:31:26.714+0000","up_votes":1,"down_votes":4,"body":"Ich habe dir Argumentiv geschrieben und du schreibst einfach schnell und Unwahrheiten, also du schreibst unwahrheiten, kannst keine Kritik ab und weisst auch nicht wie man eine schreibt, traurig, hoffe du bist noch nicht Erwachsen sonst hast du was verpasst im Leben.","replies":[{"poster":"PX0 Soulfrezze","date":"2018-07-17T01:39:29.334+0000","up_votes":3,"down_votes":0,"body":"lmao xDDDDDDDDDD","replies":[{"poster":"NoobGamer4990","date":"2018-07-17T02:06:08.256+0000","up_votes":1,"down_votes":2,"body":"Ja ist gerade schon extream Witzig da du durch diese Aussage meine recht gibst.","replies":[{"poster":"ConradhKaX","date":"2018-07-17T14:19:56.968+0000","up_votes":2,"down_votes":0,"body":"Könnt ihr mal eure fressen halten holy","replies":[]}]}]}]}]}]}]},{"poster":"Alpacana","date":"2018-07-17T09:59:25.629+0000","up_votes":2,"down_votes":0,"body":"So sieht man sich wieder :)\n\nAlso:\n\nDu schreibst du willst einen Permabann damit du mit LoL aufhörst, kannst aber nicht aufhören ohne deinen Account gebannt zu bekommen. Jetzt sagst du, du hast mehr als 4 Accounts, dann erzähl mir doch mal wieso du mit LoL aufhören würdest wenn genau dieser einzige Account gebannt wird. Oder hattest du vor, auf all deinen anderen Accounts das Gleiche abzuziehen? Und selbst dann, wieso glaubst du, erstellst du dir nicht einfach einen neuen Account wenn du so süchtig bist, dass du nicht normal aufhören kannst LoL zu spielen?\n\nZum Thema Scripts + Hacks:\nScripts sind **keine** Hacks. \nBei Hacks dringst du **in** das **bestehende** System ein und manipulierst es (gibst dir zum Beispiel zu Beginn des Spiels 10.000 Gold), was in League of Legends nicht möglich ist, außer du hackst dich in die Zentrale von League ein (die übrigens in den USA steht).\n\nScripts dagegen laufen **neben** dem bestehenden System **her** und gelten nur für deinen PC.\nDazu gehören z.B Hilfsprogramme, wie z.B Skillshot-Calculator, die sich nur auf das Spiel beziehen und dementsprechend Rechnungen anstellen.\nDiese Programme nennt man Third-Party-Programme, da sie eben **nicht** in das System integriert sind. Es ist ein extra Programm was neben League läuft und nicht erlaubt ist.\n\n\nSo, zum Thema Toxic Community:\n1. Wenn du nicht Teil der schlechten League Community sein möchtest, dann spiel dieses Spiel einfach nicht (was für dich aber ja auch wieder nicht in Frage kommt weil du scheinbar krankhaft süchtig nach diesem Spiel bist).\n2. Wenn du die Community **verbessern** möchtest, dann reporte einfach die Leute die toxic sind und/oder trollen.\n\nSo wie du jetzt schon gelesen hast gehörst du also auch zu dieser toxic Community, du willst also genau genommen von dir selbst entkommen.\nIch kann dir jetzt schon sagen: Man kann nicht vor sich selbst weglaufen.\nAber ich kann dir einen Tipp geben: Man kann sich ändern. (andere kann man allerdings nicht ändern wenn sie es nicht selbst wollen)\n\nAlso (Part 2):\n1. Du solltest etwas gegen deine krankhafte Sucht machen.\n2. Toxic sein ist scheiße, weißt du ja selber.\n3. Wenn du wirklich aufhören möchtest League zu spielen, setz dich mit anderen Themen auseinander und versuch nicht einfach gebannt zu werden. Wenn du wirklich aufhören wollen würdest, würdest du auch ohne Bann aufhören können.\nWenn du jetzt allerdings deinen Perma bekommst und dann doch noch spielen willst, wirst du höchstwahrscheinlich einfach auf einem anderen Account weiterspielen und du hast somit nichts bewirkt außer einen Account zu verlieren.","replies":[{"poster":"NoobGamer4990","date":"2018-07-17T14:33:55.613+0000","up_votes":1,"down_votes":1,"body":"Hm, Bei Part 2., ich habe eine Sucht, aber das haben glaube ich noch relativ viele in LoL, aber ich möchte ja nichts dagegen machen da mir das Spiel spass macht. \n\n2. Da muss ich dir zu 100% recht geben, und in dem Game, da war ich einfach nur ein Ideot auf gut Deutsch, da war ich Toxic und war Blind vor Wut, das ist aber keine Rechtfertigung, deswegen wollte ich einen Permabann da dass nicht mehr vorkommt. \n\n3. Es hört sich dumm, komisch für jede Person an ausser für mich, aber ich kann von eigenen Willen mein Acc nicht löschen, gut Deutsch, ich habe keine Eier dazu, wenn man mich Permabannt, dann habe ich es nicht aus eigenen Willen getan, da hat es jemand anders gemacht und ich kann es nicht verhindern, so denke ich mir, ja kake gelaufen ich höre auf, so denkt mein Gehirn nun mal. \n\n4. Die 4 Acc's, ich weiss nicht wieso ich so viele habe, aber ich Spiele hauptsächlich auf dem und auf meinem Main da ich nur auf den beiden Geld ausgegeben habe, ich vermute mal, so wie du es sagt, ich werde weiter auf meinen Smurfs spielen. (Ich habe kein Acc gekauft da ich mich grundsätzlich an die Regeln halte) \n\nAlso, wenn alle meine 4 Acc's gebannt werden, höre ich auf mit LoL, NATÜRLICH werde ich nicht jetzt auf jeden gehen und überreagieren um nur jeden das Spiel versauen, gestern war ich einfach Blind vor Wut und bereue meine Tat, deswegen ist auch die Frage wieso ich keinen Permabann bekommen habe. \n\nUnd jetzt habe ich ja eine Nacht darüber geschlafen, ich bereue es jetzt, ich hoffe es kommt nicht wieder vor, aber jeder hat mal einfach eine schlechte Phase. \n\n\nZum Thema Scripts & Hacks:\nGestern hat mich einer Egoist genannt, da ich das auf mir nicht sitzen lassen wollte, habe ich diesen Text gefasst, ich dachte er wäre richtig, aber du hast mich vom Gegenteil überzeugt, ich muss da auf meine Verantwortung eingestehen, ich hatte unrecht, danke. \n\n\nThema Toxic: \nIch gehöre Grundsätzlich nicht zur Toxischen Community, ich ignoriere meist die Flamer, ich Flame auch nie wenn jemand Feedet, da jeder mal ein schlechtes Game haben könnte, und NoBodyIsPerfect. Aber ja, manchmal gehöre ich dazu. \n\nIch Reporte immer die Inter, Troller, Flamer. Wenn jemand mein Champ in der Champselect bannt, schreibe ich einfach ingame schnell Report ... for banning my champ. Dann schreiben mir zu 90% alle; \"I report you\", ich denke mir dann nur, \"Dude wtf\", und dann werde ich geflamet. \n\nGester war auch so ein Fall, ich war im Inten.... leider, und die Gegner Poppy schreibt MIR \"I honor you thx\", da wurde ich wieder agresiv, genau Spieler wegen Poppy ist mir gestern der Faden durchgebrannt, wieso honort man einen Inter, ich muss Reported werden, und sie will mich honoren weil ich ihr Spiel gewonnen habe. \n\nDie Community macht mich halt Toxic und so eine Begründung, mute doch alle, mache ich nicht, wegen der Communication, wenn jemand anfangt Flamen mute ich ihn, wenn er es Speziel auf mich macht schreibe ich \"stfu muted\" und mute die Person. \n\n\nDanke das du dir Zeit genommen hast deinen Text zu schreiben. :)","replies":[{"poster":"Alpacana","date":"2018-07-17T15:28:54.175+0000","up_votes":2,"down_votes":0,"body":"Also bist du ja im Grunde ein vorbildlicher Spieler. Warum solltest du dann direkt einen Permabann abbekommen?\nDu hast geflamed, du wurdest dafür bestraft. Kommt es nochmal vor, wird wahrscheinlich der Perma folgen, also ist doch alles gut.\n\nViele sind süchtig nach LoL, aber soweit zu gehen, dass man einen Permabann braucht um aufhören zu spielen, müssen glaube ich die wenigsten.","replies":[{"poster":"NoobGamer4990","date":"2018-07-17T15:35:32.926+0000","up_votes":2,"down_votes":1,"body":"Ja, aber ein Permabann wäre gerechtfertig gewesen, ich habe über 1000x KYS geschrieben, das ist schon Menschlich verwährflich, das ist ein Todeswunsch und schon auf rechtlicher Ebene illegal, dann habe ich den anderen das Ranked game versaut obwohl SIE nichts konnten, in meiner Ansicht nach hätte ich ein Bann verdient, aber das ist halt wieder Ansichts Sache. \n\nManche sagen, ey, du hast ja dein Fehler eingesehen, das verdient doch eine 2. Chance, aber wieso, ich habe Masslos übertrieben was ich gemacht habe, sowas ist doch keine 2. Chance wert. Janu, danke das du dir Zeit genommen hast mir deine Meinung, bzw. Kritik zu schreiben. \n\nGL HF in deinen Games hoffe du bekommst nicht so einen wie mich, Peace Out. {{sticker:slayer-jinx-catface}}  ^^","replies":[]},{"poster":"NoobGamer4990","date":"2018-07-17T15:42:02.875+0000","up_votes":1,"down_votes":0,"body":"Die Chatlogs, und das waren nur so 10% .... https://prnt.sc/k7kmam","replies":[]}]}]}]}]}]},{"poster":"Dreadlord Mike","date":"2018-07-18T14:20:51.062+0000","up_votes":1,"down_votes":0,"body":"TBH ist League immer noch auf Platz 1 wenn du offizielle Spieler stats ansiehst.\nTwitch TV representiert nicht die Spieler fälls du deswegen meinst fornite wäre platz 1.\nWas ich mich erinnern kann ist fortnite sogar platz 4 oder 5 nach CsGo Hearthstone ecc","replies":[{"poster":"NoobGamer4990","date":"2018-07-18T14:32:04.762+0000","up_votes":1,"down_votes":0,"body":"Ich habe mal eine Statistik gesehen, bzw. gelesen, deswegen meinte ich das es Platz 2 ist, danke für die Info. ^^","replies":[{"poster":"Dreadlord Mike","date":"2018-07-18T16:10:03.496+0000","up_votes":1,"down_votes":0,"body":"NP weiß jetzt nicht wie Aktuell die Stats waren aber sollte schon von diesem Jahr sein, müsste ich mal raussuchen.\n\nEdit: hier der Link \nhttps://newzoo.com/insights/rankings/top-20-core-pc-games/\n\nFortnite sogar nur noch mehr Platz 4, an Spielern deutlich verloren wie es aussieht im Juni.\nHab mal alles durchgesehen seit Januar 2017 ist league 1st. \n","replies":[]}]}]}]}]}]}]},{"poster":"Nocì","date":"2018-07-16T20:37:02.228+0000","up_votes":3,"down_votes":0,"body":"Es wäre vllt besser auch deine Chat-Logs zu kopieren, dann kann man das besser beurteilen.\n\nIch fiende es aber schonmal gut das ein \"gebannter\" sich über ein zu lasches Bannsystem beschwert.","replies":[{"poster":"NoobGamer4990","date":"2018-07-16T22:16:06.394+0000","up_votes":2,"down_votes":0,"body":"Ah, und ich kann die ChatLogs nicht kopieren, da ich wegem Inten gebannt wurde, deswegen sehe ich keine Chatlogs, sonst hätte ich sie reingepackt.","replies":[]},{"poster":"NoobGamer4990","date":"2018-07-16T22:12:08.906+0000","up_votes":1,"down_votes":0,"body":"Ich habe ja geschrieben das ich über 1000x KYS geschrieben habe, also das ist sogar untertrieben, schon das ist ja ein Permabann Grund.","replies":[]}]},{"poster":"Abasin","date":"2018-07-17T05:32:38.171+0000","up_votes":2,"down_votes":1,"body":"Da Du keinen Chatlog gepostet hast, kann niemand hier die Wahrhaftigkeit Deiner Aussagen überhaupt beurteilen. Es kennt auch niemand Deine Vorgeschichte, was Chatbanns angeht. Wäre also schön, wenn Du das erst nachlieferst, bevor wir uns hier in Spekulationen über die Rechtmässigkeit oder gar Verhältnismässigkeit eines Banns unterhalten, der eventuell so gar nicht passiert ist.\n\nEine kleine Bemerkung sei noch erlaubt. Aus rein technischen Gründen ist ein IP-Bann ein Ding der Unmöglichkeit. Etwas anderes wäre es, wenn RIOT eine eindeutig personenbezogene Registrierung durchführen würde. Im Falle eines personenbezogenen Bannes wäre dann aber die Kollision mit der DSGVO - Recht auf \"Vergessen\" - vorprogrammiert. Zu aufwändig, steht in keinem Verhältnis zum Nutzen.","replies":[{"poster":"Bettnachleger","date":"2018-07-17T06:09:43.605+0000","up_votes":2,"down_votes":0,"body":"Er wurde wegen inten gebannt, daher gibt es keine Chatlogs.\n\nEdit: Und da er ja bereits sagte, das er haeufig zero tolerance kram nutzte, brauch man den Chatlog wohl nicht unbedingt.","replies":[{"poster":"Abasin","date":"2018-07-17T09:59:51.623+0000","up_votes":2,"down_votes":0,"body":"Nein, er hat auch geschrieben, dass er geintet hat und dass er wiederholt \"kys\" benutzt hat und trotzdem **nur** einen 2 Wochen Bann. Und will deswegen wissen warum er nur so milde bestraft wurde anstatt permanent.\n\nEigentlich ist es auch egal, da er nach Ablauf der Frist nur noch ein kurzes Game mit einer minimal toxisch reporteten Aussage braucht, um das Ende herbeizuführen.","replies":[]}]},{"poster":"NoobGamer4990","date":"2018-07-17T15:42:29.915+0000","up_votes":1,"down_votes":0,"body":"Chatlog; https://prnt.sc/k7kmam","replies":[]},{"poster":"NoobGamer4990","date":"2018-07-17T14:01:14.069+0000","up_votes":1,"down_votes":1,"body":"Ja, ich wurde wegem Inten gebannt, aber wie schon gesagt, ich habe über 1000x KYS geschrieben, und das ist leider noch untertrieben.","replies":[]}]},{"poster":"Tobatzen","date":"2018-07-17T06:38:30.739+0000","up_votes":2,"down_votes":0,"body":"Also wenn dir das Spiel Spaß macht oder du sogar süchtig danach bist, aber dich die Community / Teammates aufregen kann ich dir einen ganz einfachen Tipp geben. \"/MUTE ALL\" . Das mache ich mittlerweile in fast jedem Spiel sobald auch nur ein Spieler anfängt zu flamen.","replies":[{"poster":"KillingKenni","date":"2018-07-17T13:35:41.529+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tobatzen,realm=EUW,application-id=KYnfKGf0,discussion-id=t9Ld9eAK,comment-id=0008,timestamp=2018-07-17T06:38:30.739+0000)\n>\n> Also wenn dir das Spiel Spaß macht oder du sogar süchtig danach bist, aber dich die Community / Teammates aufregen kann ich dir einen ganz einfachen Tipp geben. &quot;/MUTE ALL&quot; . Das mache ich mittlerweile in fast jedem Spiel sobald auch nur ein Spieler anfängt zu flamen.\n\nDas Problem mit dem geflame wäre somit dann ja beseitigt aber er wir können nichts gegen feeder inter tun ... Gerade heute morgen hatte ich wieder einen schönen Fall : Meine mid wollte yasuo spielen (im ranked natürlich) was er aber nicht zeigte, also dachte ich mir bevor ich wieder gegen nen gefeedeten yasuo spielen muss banne ich ihn. Als mein mid laner dann mal mit dem picken dran war viel ihm auf dass ich ihn gebannt hatte, was dazu führte dass alles seinen lauf nahm... Er wollte ori spielen die aber vom Gegner gepickt wurde, was in ihm anscheinend einen Schalter umlegte... Er schrieb sofort dass alle mich reporten sollten und er wegen mir jetzt TF picken muss. Ingame meinte er noch dass er es trotzdem carryn würde und wir ihn honorn soll ... Nach dem er aber leider zum 2. Male das 1vs1 auf Mitte gegen ori verloren hatte fing es wieder an, alle sollen mich reporten er würde afk gehen und all diese Drohungen... Da ihm aber auffiel dass sowohl Top als auch bot gut liefen und das Spiel bei weitem nicht verloren war... Fing er an und lief nur noch die Mitte runter. Erst waren es 0.5 dann 0.6 0.7 plapla immer so weiter als er bei 09 an kam hat er mit aller Gewalt versucht einen kill zu bekommen (was ihm auch gelang wie das auch immer ging ) dass er wieder Gold geben würde (da die Gegner sich schon drüber lustig machten dass er nur 75 Gold oder so gab... Natürlich haben wir das Games verloren.. was ich damit aber sagen möchte ist. Du kannst flamer muten doch seine taten nicht rückgängig machen :/","replies":[]}]},{"poster":"Mad Loony","date":"2018-07-16T20:47:02.930+0000","up_votes":5,"down_votes":4,"body":"Ich finde jeder hat ne zweite Chance verdient. Deshalb ist der 14. Tagesbann hier ganz gut. Vielleicht denkst du ja in zwei Wochen auch wieder anders über diese Situation. Du siehst dein Fehlverhalten ja auch ein, was zugegebener Maßen daran liegt, dass du vollkomen absichtlich so gehandelt hast. Trotzdem hast du damit vielen Flamern schonmal was vorraus.\n\nSchlaf drüber. Überleg dir nochmal, ob du wirklich nen Permabann willst. Falls ja, deinstalliere das Game am besten noch während dem Bann, dann bleibt dir ein Rückfahrticket ;)","replies":[{"poster":"NoobGamer4990","date":"2018-07-16T22:10:48.275+0000","up_votes":2,"down_votes":1,"body":"Das Game habe ich schon 2x deinstalliert, aber ich kann nicht aufhören, ich habe hier schon zu viel erreicht...","replies":[{"poster":"Eltra","date":"2018-07-17T02:01:13.273+0000","up_votes":2,"down_votes":0,"body":"Statt zu versuchen einen permaban zu bekommen könntest du auch einfach den Support bitten deinen Account zu löschen. Für dich das selbe Ergebnis und angenehmer für alle anderen. \n\nWenn du allerdings sagst du KANNST nicht aufhören bist du SÜCHTIG und solltest ernsthaft mit jemandem darüber reden. Familie, Freunde oder vielleicht auch mit einem Arzt.","replies":[{"poster":"NoobGamer4990","date":"2018-07-17T02:08:51.541+0000","up_votes":1,"down_votes":1,"body":"Was soll der Arzt dann sagen?, ich bin süchtig, ich kann nicht aufhören, aber das Spiel macht mir wenigstens Spass, mich regt nur die Community auf, deswegen habe ich das gemacht. Wenn mein Acc einen Permabann bekommen würde, hätte ich kein Problem und würde aufhören. \n\nKomisch ist aber so {{sticker:zombie-nunu-bummed}}","replies":[{"poster":"eingew","date":"2018-07-17T04:15:32.559+0000","up_votes":1,"down_votes":0,"body":"Wenn Ärzte nicht in der Lage wären bei vielen Menschen mit Süchten umzugehen, würde keine Krankenkasse Geld für die Behandlung ausgeben ^^.","replies":[{"poster":"NoobGamer4990","date":"2018-07-17T14:05:30.039+0000","up_votes":1,"down_votes":1,"body":"Ja stimmt schon, aber das Problem ist, wenn man Süchtig ist, muss man als erstes es von alleine Rausschaffen damit dir überhaupt ein Arzt helfen kann, aber ich möchte ja nicht aus meiner Sucht raus, also kann mir dementsprechend kein Arzt helfen, da der erste Schritt bei sich selbst anfängt. \n\nUnd ich habe mir vorgenommen, ich verlasse League nur wenn ich einen Permabann bekomme, den Acc einfach löschen könnte ich nicht, ich traue mich irgendwie nicht, ein Permabann habe ich gleich ohne mein Einverständniss, eine Acc Löschung muss ich selber in anspruch nehmen und ich habe auf gut Deutsch, keine Eier für das.","replies":[{"poster":"eingew","date":"2018-07-18T04:10:14.108+0000","up_votes":1,"down_votes":0,"body":"Wenn du den Permaban dabei aktiv provozierst sehe ich da wirklich keinen Unterschied.","replies":[]}]}]},{"poster":"Eltra","date":"2018-07-17T06:01:44.723+0000","up_votes":1,"down_votes":0,"body":"Also ich hoffe ich hab alles richtig vertanden:\nDu weißt dass du süchtig bist, aber das ist OK weil du das Spiel gerne spielst.\nUnd du willst einen Permaban weil dich die Community aufregt.\n\nDa LoL ein online multiplayer Spiel ist, sind Spiel und Community untrennbar miteinnander verbunden. Man könnte natürlich die Community wechseln, indem man zB nach EUNE geht. Aber viel bringen wird das nicht, da es ja leider überall Idioten gibt, und ein Idiot auch immer lauter schreit als 100 normale Leute.\n\nAber zurück zum eigentlichen Thema: deinem Bann.\nWas würde passieren, wenn dein Account gebannt wird? Mir fallen spontan zwei Möglichkeiten ein:\n\n1. du hörst auf. Das hättest du auch mit der bereits genannten Accountlöschung machen können.\n\n2. du kannst nicht aufhören, erstellst dir einen neuen Account und fängst wieder an.\n\n In beiden Fällen hättest du dir und vor allem auch deinen Mitspielern die ganze Aktion ersparen können. In diesen zwei Spielen hast du insgesammt acht Teammitglieder genervt. Die sind jetzt vieleicht genau so sauer wie du und machen im nächsten Spiel das gleiche wie du. Und damit die Community noch viel schlimmer.","replies":[]}]}]}]}]},{"poster":"Megamaexx","date":"2018-07-16T20:41:40.713+0000","up_votes":2,"down_votes":0,"body":"Riot gewährt eben jedem, der nicht hackt, cheatet, scriptet oder Vergleichbares, eine zweite Chance.","replies":[{"poster":"Released Ape","date":"2018-07-17T01:49:49.782+0000","up_votes":2,"down_votes":0,"body":"Sogar jmd der scripted kriegt im Normalfall erst einen 2-Wochenban und ggf. verliert er noch alle Rankedbelohnungen. Es gibt zum aktuellen Zeitpunkt keine wirklichen game-breaking Hacks in League, zumindest sind keine weit verbreitet. Aber es gab mehr oder weniger \"Hacks/Cheats\" in der Vergangenheit:\n\n- Level 1 Invade mit Brand Ulti xD (funktionierte aber nur mit bestimmten Champions die das triggern mussten wie z. B. Ashe)\n- Unendlich viele Azirtürme überall (konnte überall gespawnt werden, da musste kein Turm sein)\n- Keine Cooldown auf Summoner Spells (und das mit Cheat Engine xD)\n- Eigene Team Mates abschlachten (Stichwort: Ryze)\n- [...]\n\nWaren wunderbare Zeiten. Da wo Riot noch nicht jede Kleinigkeit serverseitig abgespeichert bzw. gegengeprüft hatte. Dazu kam noch eine DDos Welle oder Spieler die Bugsplats für alle Gegner triggern konnten (heute kann man das kaum absichtlich hervorrufen, davon ging es zumindest mal mit Tiamat und ... glaub Quinn...erinnere mich nicht mehr zu 100 %). Aber gut damals hatte man auch Fiora mit 5x Tiamat oder Master Yi auf Ap gespielt und Supporter hatten bis Minute 40 nur ein ausgebautes Items und der Rest der Slots war mit Wards bedeckt (man möge sich an ein LCS Game von früher erinnern^^).","replies":[]}]},{"poster":"Ayka","date":"2018-07-17T11:32:25.842+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist, dass hinter den Bestrafungen keine Person sitzt sondern ein Sytem. Anscheinend bist du vorher noch nicht allzu auffällig gewesen und hast so \"nur\" die nächst härtere Stufe abbekommen (den 2 Wochen bann) und würdest beim nächsten mal wohl eine noch höhere Stufe an Strafe bekommen.\n\nWieso du nach dem kys- Spam nicht gepermabannt wurdest kann ich mir nur mit einem Vorfall aus der Vergangenheit erklären. \nDort gab es eine Person, welche andere dazu gebracht hat, eine bestimmte Anzahl an kys zu schreiben, sonst \"würde er feeden\" . Das System damals hat solche Leute gepermabannt. Aufgrund von Beschwerden gehen diesen Spieler wurden diese Leute jedoch wieder entbannt und der \"Übeltäter\" permabannt. \nDenke aufgrund solcher Vorkommnisse haben sie das System so angepasst, das dieser Instant bann nicht mehr existiert.","replies":[{"poster":"eingew","date":"2018-07-18T04:15:20.488+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WolfsQueen,realm=EUW,application-id=KYnfKGf0,discussion-id=t9Ld9eAK,comment-id=000a,timestamp=2018-07-17T11:32:25.842+0000)\n>\n> Das Problem ist, dass hinter den Bestrafungen keine Person sitzt sondern ein Sytem. Anscheinend bist du vorher noch nicht allzu auffällig gewesen und hast so &quot;nur&quot; die nächst härtere Stufe abbekommen (den 2 Wochen bann) und würdest beim nächsten mal wohl eine noch höhere Stufe an Strafe bekommen.\n\nAuch Menschen würden in dieser Hinsicht systematisch arbeiten.","replies":[{"poster":"Ayka","date":"2018-07-18T20:00:55.443+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=t9Ld9eAK,comment-id=000a0000,timestamp=2018-07-18T04:15:20.488+0000)\n>\n> Auch Menschen würden in dieser Hinsicht systematisch arbeiten.\n\nJa das stimmt auch wieder","replies":[]}]}]}]}