{"poster":"THcSA Blacky","date":"2015-06-28T12:47:29.412+0000","title":"ARAM RANKED","subforum":"Karten & Spielmodi","up_votes":0,"down_votes":4,"body":"Servus zusammen,\r\n\r\nMeine Idee war es das es nicht nur 5vs5 oder 3vs3 Ranked gibt sondern auch f&uuml;r das ARAM 5vs5 Ranked gibt f&uuml;r SOLO , DUO und als komplettes 5 Team.\r\nNat&uuml;rlich auch mit der Zuf&auml;lligen Champion Auswahl und vlt ein Besseres Matchmaking nicht das man nur Fernk&auml;mpfer hat ...\r\nWas haltet ihr von der Idee?{{item:3508}} {{summoner:14}}","replies":[{"poster":"MeMyselfandBaal","date":"2015-06-28T14:20:50.495+0000","up_votes":2,"down_votes":0,"body":"Es ist ein Funmode... Rangliste und Funmodes vertragen sich nicht.\n\nVor allen Dingen, weil ARAM halt nicht gebalancet ist. Es gibt halt Champions, mit denen du quasi nicht verlieren kannst (Sona ist da ganz weit vorne), und es gibt Melee AFK-Farm Champs wie Yi, die in dem Modus nur sterben werden.\nDas ist aber halt ARAM. Das steht für ALL RANDOM. Und wer damit ein Problem hat, (wie ich) sollte den Modus meiden.\nUnd als nächstes... würden sich die Hardcore Erfolgsjäger extra Accounts zulegen, auf denen sie sich nur die starken ARAM Champs holen und die Bards außen vor lassen... Und die würden dann Platin+ werden, nicht die besten Spieler... (ok, ich gebe zu, dieses Problem könnte man einfach beheben, in dem man für diese Que immer alle Champions freischaltet... allerdings wird dann der Glücksfaktor extrem zunehmen... wie gesagt ALL RANDOM...)\n\nUnd damit, dass der Taktische Anspruch eines ARAMs echt lächerlich ist, habe ich noch nicht mal angefangen...","replies":[]},{"poster":"Kryptonq","date":"2015-06-28T12:51:15.102+0000","up_votes":1,"down_votes":0,"body":"Mit \"besseres Matchmaking\" meinst du wohl faire Teamcomps? \nDie Idee wurde bereits mehrfach diskutiert, aber ARAM bleibt nun mal nach wie vor ein Funmode, bei dem es um den Spaß und nicht um den Wettkampf gehen soll, deshalb bin ich dagegen. Das Zufallselement so zu schwächen würde zudem ein bisschen den Sinn aus ARAM nehmen, außerdem ist (und das soll eigentlich auch so sein) es nicht auf Balancing ausgelegt.","replies":[]}]}