{"poster":"Taylor the swift","date":"2019-03-11T05:34:37.001+0000","title":"Stuck in a higher rank then deserved","subforum":"Player Behaviour","embed":{"description":"megatron18200 / Bronze 2 14LP / 22W 32L Win Ratio 41% / Malphite - 15W 16L Win Ratio 48%, Nunu & Willump - 5W 9L Win Ratio 36%, Warwick - 2W 11L Win Ratio 15%, Renekton - 1W 2L Win Ratio 33%, Blitzcrank - 1W 0L Win Ratio 100%","url":"https://oce.op.gg/summoner/userName=megatron18200","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":2,"down_votes":0,"body":"Hello Riot. I just had some advice and concerns with the new ranking system.\nYou guys created iron as a way to filter and differently skilled players from bronze and it was a great idea and has helped is someway but not in others. Unfortunately  by creating a rank you can not go below its stops the filtering of bad players because if they have never played ranked before League of legends doesn't assume that this new player has the skill level of iron or low bronze for example when i first played ranked i lost 7 out of 10 games in my promos and yet got places in silver 4 and if i had of done it this year i would of not dropped below despite my skill level not being that of a silver 3 player. By creating this new system it defeats the purpose of iron in a lot of cases. I had a  Warwick {{champion:19}}  in my ranked and although it was not a all round good game none of us unintentionally fed as hard as this player and after a brief look into this persons match history it seems as though despite there skill level being lower than bronze 2 14 lp they cant drop drop below it and have not won a game in 11 games. This unfortunately ruins the game for others who belong in or above that rank, unless of course you are lucky to verse against them and god knows i hope i do.\n\nAnother example is the game i just played that got me into bronze one. this tristana is silver 4 https://oce.op.gg/summoner/userName=livinggarbage thankfully i was on the opposite team. But maybe next time i wont. this person barely understood the concept of farming and ended there last game after 39 minutes with 29 cs. is this really a silver player, if so give me challenger","replies":[{"poster":"Krispy Migraine","date":"2019-03-12T06:50:15.952+0000","up_votes":2,"down_votes":0,"body":"i don't like the new placement system, last season i went 2/8 in my placements and i got placed b2\nthis season i go 6/4 (in which 3 of the losses i did really well in but i still lost) and i got iron 1. \nthis player is surprising though because they probably did well in their first game then hard inted the rest, so i think this is just a rare case of a player but rito pls reset all ranks tytytytytytytytytytytytytytytyty its very embarrassing knowing that someone that started late last year having a far higher rank than you","replies":[{"poster":"Taylor the swift","date":"2019-03-13T04:09:18.194+0000","up_votes":1,"down_votes":0,"body":"I completely agree ! thank you for your input","replies":[]}]}]}