{"poster":"x3Keksiix3","date":"2015-10-17T07:25:50.080+0000","title":"Probleme mit dem Ping","subforum":"Hilfe & Support","up_votes":3,"down_votes":0,"body":"Hall&ouml;chen zusammen,\r\n\r\nich habe da mal eine Frage: und zwar habe ich gestern mit ein paar Freunden versucht ein paar R&uuml;ndchen zu zocken. Dies geling uns allerdings durch einen zu hohen Ping den ganzen Abend nicht mehr. Heute morgen habe ich dann mal rein geschaut und auch diesmal konnte ich aufgrund eines zu hohen Pings nicht zocken. Nun meine Frage an euch: hat jemand noch diese Probleme mit den Laggs? Habe auch schon bei meinem Internet anbieter nach gehakt aber da ist alles in ordnung. Danke im voraus f&uuml;r die Antoworten","replies":[{"poster":"Schlachtpartie","date":"2015-10-17T11:19:47.652+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/en/c/help-support-en/rIbxgB1E-investigation-of-the-lagspikes-occurred-on-16102015 =)","replies":[]},{"poster":"legofreak1","date":"2015-10-17T10:36:20.356+0000","up_votes":1,"down_votes":0,"body":"Kannst du bitt ein Tracert erstellen, wenn du im Spiel bist und dieses Problem hast?\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> https://www.pingplotter.com/download.html\n> 1. Das 'Trace Interval' sollte auf '1 second' eingestellt werden.\n> 2. Die 'Address to Trace' ist in unserem Fall 185.40.65.1\n> 3. trace starten\n> 4. Es wird jetzt jede Sekunde ein tracert durchgeführt. Während Pingplotter im Hintergrund läuft, kann man ein Testspiel in LoL starten um zu testen ob Probleme auftreten oder das Programm besser noch komplett während eines Spiels im Hintergrund laufen lasse.\n> Sollte es Verbindungsprobleme geben, geht es mit Schritt 5 weiter. Gibt es keine Verbindungsprobleme sind die tracerts vermutlich nutzlos.\n> 5. Sollten Verbindungsprobleme aufgetreten sein, müssen die Ergebnisse exportiert werden:\n> Edit > Copy as Text\n> Nach [Pastebin.com](http://pastebin.com/) gehen, das Ergebnis dort einfügen, auf \"submit\" klicken und den Link zum Ergebnis im Forum posten.","replies":[]},{"poster":"Titcat","date":"2015-10-17T08:28:52.627+0000","up_votes":1,"down_votes":0,"body":"2 Beiträge weiter unten gibt es einen Beitrag.\nEs gibt auf der ersten Seite glaub 3 oder 4 Beitäge zu diesem Problem.","replies":[]}]}