{"poster":"HappySchabernack","date":"2017-05-24T22:22:59.819+0000","title":"Sandbaukasten, Heulende Schlucht und wie man Riot darauf aufmerksam macht","subforum":"Karten & Spielmodi","up_votes":3,"down_votes":2,"body":"Hallo liebe Community,\r\nFolgenes bezieht sich weitgehend auf die Aram-Map (Heulende Schlucht), daher sind hier eher die &quot;mal was anderes&quot; Spieler gefragt.\r\nSeit den Item updates von vor der letzten Season wurden die Normal Tower etwas angepasst, die Items wurden in der Heulenden Schlucht auch &uuml;bernommen, aber die Tower blieben die selben alten.\r\nGestern erst hatte ich so gut wie keine Resis und wollte mich executen und hatte 5% HP als apc ohne sonderlich viel Leben, doch der Tower konnte einen resilosen apc mit lvl 16 keine 5% Leben mit einem Schuss abziehen. Au&szlig;erdem f&uuml;hlt es sich an wie ein hei&szlig;es Messer das durch butter geht wenn man aram-tower angreift. \r\nSelbst mit strategischem (wir m&uuml;ssen waveclearen und ins lategame kommen) hintergrundwissen ist diese Strategie mit Fokus der gegnerseite auf den Towern mit fast keinem matchmaking umzusetzen. Ob es an der Todeszeit liegt oder die neuste &Auml;nderung, dass Supervasallen so stark sind oder die Wellen schneller kommen... vielleicht aber auch das Gesamtpaket.\r\n\r\nDiese Meinung teilen eine Menge meiner Mitspieler, die Aram sehr gerne spielen und Die Heulende Schlucht ist nunmal ein bedeutender Teil von LoL geworden. Viele meinen sogar es sollte ein Ranked-system geben, auch wenn Gl&uuml;ck der Championwahl dort eine Rolle spielt, dies jedoch wei&szlig; man ja vorher und m&uuml;sste damit leben oder unranked spielen ^^\r\n\r\nJetzt aber mal ins eingemachte:\r\nWas haltet ihr davon, dass ein Sandbaukasten an der stelle GENAU das richtige ist? Negativ kann man es nicht sehen, denn wem es nicht gef&auml;llt der benutzt es nicht und erfreut sich daran, dass es anderen den Spielspa&szlig; in LoL am Leben h&auml;lt.\r\nEin beispiel wie so etwas aussehen k&ouml;nnte hatte ich in der Vergangenheit schon vorbereitet:\r\n\r\nhttps://boards.euw.leagueoflegends.com/de/c/karten-spielmodi-de/ZEXEnaE7-more-options-in-free-games-community-wish?comment=00000000\r\n\r\nDie Frage ist: &quot;Wie k&ouml;nnten wir Riot am besten darauf aufmerksam machen, da es eine Bereicherung des spiels w&auml;re diese M&ouml;glichkeiten zu haben&quot;\r\n\r\nwer den link nicht anschauen m&ouml;chte noch mal eine Erkl&auml;rung, wer es aber schon begriffen hat, kann hier nach ganz unten scrollen und abstimmen:\r\n&gt;ein Freies Spiel erstellen\r\n&gt;Freunde einladen\r\n&gt;map aussuchen\r\n&gt;s&auml;mtliche Einstellungen f&uuml;r das h&ouml;chste Spielvergn&uuml;gen einrichten\r\nfolgende beispiele sollte man sich als Reiter (also ausw&auml;hlbar) vorstellen z.b.\r\n\r\n**!!Aram Tower st&auml;rke:** (f&uuml;r das rote und blaue team induviduell einstellbar, weil man z.b. 2 vs 5 spielen will)\r\n&gt;-HP 0,5x / 1x  / 2x / 3x / 5x / 10x (oder am besten direkt ne Zahl zwischen 0,1 und 100 reinschreiben)\r\n&gt;-Frequenz /ZAHL/\r\n&gt;-Self-HHP-regeneration: OFF / 0,1%/min / 1%/min / 2%/min / 5%/min / 10%/min / 15%/min\r\n&gt;-Dmg 0,5x / 1x  / 2x / 3x / 5x (wobei ich gerell finde, dass es m&ouml;glich sien sollte tower zu diven aber nciht zu einfach, ein Dr Mundo kann mit 45% cdr und viel HP eigentlich son tower dauertanken also k&ouml;nnte man sagen, dass ab den dritten schuss der dmg mit jeden weiten verdoppelt und au&szlig;erdem pro schuss 5% des max lebens des ziels als absoluten schaden durch geht, so kann ein mundo maximal 20 schuss aushalten, au&szlig;er die frequenz liegt unter der regeneration)\r\n&gt;-wenn der erste tower f&auml;llt sollte der zweite tower f&uuml;r X sekunden 99% des eingehenden schaden verringern   X=Zahl (0-60 sekunden)\r\n\r\n\r\n**!!Gold:** (f&uuml;r das rote und blaue team induviduell einstellbar, weil man z.b. 2 vs 5 spielen will)\r\n&gt;-Start Gold (beliebige Zahl eintragen)\r\n&gt;-Regeneration: OFF / 0,5x / 1x (aram standart) / 1,5x / 2x / usw\r\n&gt;-Kills: OFF / 0,5x / 1x (aram standart) / 1,5x / 2x / usw\r\n&gt;-Assists: OFF / 0,5x / 1x (aram standart) / 1,5x / 2x / usw\r\n&gt;-Minions: OFF / 0,5x / 1x (aram standart) / 1,5x / 2x / usw\r\n&gt;-Itemkosten  0,5x / 1x (aram standart) / 1,5x / 2x / usw\r\n\r\n**!!Items:** (f&uuml;r das rote und blaue team induviduell einstellbar, weil man z.b. 2 vs 5 spielen will)\r\n&gt;-Aus der Kluft ON/OFF\r\n&gt;-Aus der Schlucht ON/OFF\r\n&gt;-Aus dem Wald ON/OFF\r\n&gt;-Itemslotpl&auml;tze 1 / 2 / 3 / 4 / 5 / 6 (standart) / 7 / 8 / 9 / 10 / 11 / 12\r\n\r\n**!!Versallen** (f&uuml;r das rote und blaue team induviduell einstellbar, weil man z.b. 2 vs 5 spielen will)\r\n&gt;-Wellen geschwindigkeit: x/sek (bei X ne zahl zwischen 20 und 300 eintragen)\r\n&gt;-Superversallen Wellen geschwindigkeit: x/sek (bei X ne zahl zwischen 20 und 300 eintragen)\r\n&gt;-Power (also HP und DMG) 0,5x / 1x / 2x / 5x\r\n&gt;-Randoom djunglemonster dabei sein (wie redbuff usw) OFF / X% chance per versallenwelle (bei X ne zahl eintragen)\r\n\r\n**!!Teamgr&ouml;&szlig;e**\r\n1/2/3/4/5/6(hexakill)/7/8\r\n\r\n\r\nSOOOO, bitte helft mir, dass Riot diesen beitrag liest, es w&auml;re wundervoll die Lobby in LoL zu beleben.\r\nwem es gef&auml;llt, der soll doch den link an seine freunde posten mit der bitte, dass sie dasselbe tun und immer so weiter, vielleicht kommt es dann bei riot an :-)\r\n\r\nMfG Happy Incubus\r\n\r\n\r\n\r\n\r\n[  ] alte Rechtschreibung\r\n[  ] neue Rechtschreibung\r\n[X] Induviduelle Rechtschreibung","replies":[{"poster":"Oriius","date":"2017-05-25T04:44:05.344+0000","up_votes":2,"down_votes":0,"body":"kann man machen ob man das jetzt so wirklich brauch ist ne andere frage. Towers in aram brauchen generell nen buff aber das gilt auch für KdB meiner meinung nach. Ziggs zb macht mit einem AA fullbuild 50-70% vom towerleben als damage und das kann nicht wirklich nachvollzogen werden meinerseits","replies":[]},{"poster":"Megamaexx","date":"2017-05-29T15:18:43.028+0000","up_votes":1,"down_votes":0,"body":"Naja, diesen Hardcore-Sandbox-Mode müsste Riot erst mal programmieren. Das werden eher wenige nutzen.\n\nWas aber durchaus denkbar wäre, wäre einfach, den schon vorhandenen Sandbox-Mode auf die anderen maps zu erweitern und auch die Anzahl der möglichen Spieler zu erhöhen.","replies":[{"poster":"HappySchabernack","date":"2017-06-01T00:00:34.854+0000","up_votes":1,"down_votes":1,"body":"Das glaube ich nicht, ich wette das würden eher über 75% nutzen.","replies":[]}]},{"poster":"Sirrkas","date":"2017-06-02T10:27:58.475+0000","up_votes":1,"down_votes":1,"body":"Es wäre schön, wenn solche Umfragen weniger voreingenommen und besser strukturiert werden. \n\nDu hast im Grunde folgende Optionen zur Verfügung gestellt:\nStimme zu\nEnthaltung\nKannst du ruhig machen, juckt mich nicht und ich sollte mich dafür schämen, diese Option gewählt zu haben\nStimme erneut zu\n\nWo ist da ein klares nein, bei dem man nicht versucht, dem Leser eines reinzuwürgen? Hättest du einfach nur \"nein\" geschrieben, wäre das eine relative faire nicht verurteilende Abstimmung. So versuchst du beim Leser das Gefühl zu wecken, dass er sich schlecht fühlen soll, dagegen zu sein, nur weil er es selbst nicht nutzen will.\n\nDie Idee mit anderen Werten ist zwar irgendwo interessant. Allerdings sehe ich da auch einige Probleme. Wenn solche Spiele gespielt werden, können die sich deutlich von dem Unterscheiden, was man gewohnt ist. Das kann durchaus für Frust sorgen, weil man sich dann eben wundert, warum der Turm einen jetzt so schnell getötet hat. Selbst wenn man das sehr offensichtlich macht in der Lobby oder zu Spielbeginn, wird das sicher gerne im Eifer des Gefechts vergessen. ","replies":[]},{"poster":"R3playZ3","date":"2017-06-02T07:12:03.561+0000","up_votes":1,"down_votes":2,"body":"es gibt weltweit jetzt über 150 eigene threat im forum und über 1000 posts die ein aram ranked wollen, um auf deine frage zurück zu kommen.\n\nübers forum schonmal nicht! :-D\n\nalso ich würde dir raten in einer größeren menschen menge, am besten im fernsehen mit einem riot tshirt für so dermaßen tumult zu sorgen das sie es durch die nachrichten erfahren. das ist glaub die einzige möglichkeit an einen riot mitarbeiter zu gelangen.\n\ndas forum wird von denen nicht beachtet, im support arbeitet kein fachpersonal bzw sie werden dir sagen \"diese antwort dürfen wir dir leider nicht geben\"\n\nalso überleg dir am besten was, vielleicht läufst du nackt durch die straßen, mit edding schreibst du dir riot auf die brust und schreist in der innenstadt solange rum bis die medien kommen und dann schreist du \"free aram free aram\"\n\nich würde dir für diese aktion geld überweisen, es muss nur endlich einer den ersten schritt machen.","replies":[]}]}