{"poster":"HappySchabernack","date":"2015-11-21T14:31:54.616+0000","title":"Freies Spiel, mehr Freiheiten","subforum":"Karten & Spielmodi","up_votes":19,"down_votes":0,"body":"Hallo zusammen\n\nViele der Community, w&uuml;nschen sich URF, O4A oder andere Spieltypen wieder, einige in der Heulenden Schlucht, andere in der Kluft.\nDas diese Spielmodis nicht dauerhaft drin sein k&ouml;nnen, kann man verstehen. Doch die Kreativit&auml;t jedes Einzelnden nicht unterst&uuml;tzen zu wollen, nicht.\n\nEin vorschlag, damit die Ranked-Spieler nicht sagen m&uuml;ssen &quot;oh nein, 3 jahre bis die que offen geht&quot;\n-in Freien Spielen k&ouml;nnte man doch viel mehr Freiheiten einbauen, so k&ouml;nnte jeder seine Freunde einladen, die lust auf &quot;mal was anderes&quot; haben und die Lobby w&uuml;rde viel mehr belebt werden. Man denke nur an &quot;find the teemo&quot; und &quot;hide&amp;Seek&quot;, ist ebenso popul&auml;r wie manch andere Spielmodis.\n\n-Ich dachte daran [Reiter] zu erstellen indem man entscheiden kann:\n\n &gt; Goldreg: [like-heulendeschlucht] / [like-Kluftderbeschw&ouml;rer] / [extrem hoch] / [aus] (also nur f&uuml;r minions, killls und supports und golditems)\n &gt; EXPreg: [like-heulendeschlucht] / [like-Kluftderbeschw&ouml;rer] / [aus] (nur kills minions usw) / [extrem hoch]\n &gt; Item-goldkosten: [0,5x] / [1x] / [2x] / [3x] / [5x] / [10x] (wer extrem lange spiele mag)\n &gt; Tower/nexus  HP/dmg: [0,5x] / [1x] / [2x] / [3x] / [5x] / [10x] (wer extrem lange spiele mag)\n &gt; Map: [Heulende Schlucht] / [Kluft der Beschw&ouml;rer] / [Kristallnarbe] / [Gewundener Wald]\n &gt; Itempl&auml;tze: [6 (standart)] / [1] / [2] / [3] / [4] / [5] / [7] / [8] / [9] / [10] / [11] / [12]\n &gt; wiederbelebungsdauer nach tot: [10%] / [25%] / [50%] / [75%] / [100%(normal)] [200%]\n &gt; Startgold: [500] / [1500] / [3000] / [usw]\n &gt; Startlevel: [1] / [2] / [3] / [4] / [5] / [6] / [18]\n &gt; Pick: [Random] / [O4A mehrheit] / [Freie Wahl] / [Auswahlmodus]\n &gt; Mit bannen: [3 (standart)] / [5] / [aus]\n\n-Und nat&uuml;rlich h&auml;kchenfelder zu erstellen indem man Optionen &quot;zubuchen&quot; kann\n\n &gt; One 4 All\n &gt; One 4 All Mirror (w&uuml;rde den 1. O4A inaktiv werden lassen)\n &gt; URF\n &gt; Hexerkill\n &gt; Doombotst&auml;rke (falls bots vorhanden)\n &gt; Die Heulende Schlucht Passive (das mit mehr manareg und 50% weniger heal auf andere, aram spieler wissen was das ist)\n &gt; Tower/Nexus reg (Prozentualer lifereg der lebenden Towers die l&auml;nger nicht angegriffen wurden (wer extrem lange spiele mag)\n\n__________________________________\nh&auml;kchensetzung welche Items erlaubt sind: (wobei man auch alle 4 anklicken k&ouml;nnte und somit alle items haben k&ouml;nnte)\n &gt; [Heulende Schlucht items] \n &gt; [Kluft der Beschw&ouml;rer items] \n &gt; [Kristallnarbe items] \n &gt; [Gewundener Wald items]\n\nevtl eine Champliste die der Raumersteller zur verf&uuml;gung hat um anzuklicken welche champs alle Prebanned sind (vielleicht die in seiner Sch&auml;tzung oder die seiner Mitspieler OP sind)","replies":[{"poster":"Ra1nDr0ps","date":"2015-11-21T19:30:43.067+0000","up_votes":1,"down_votes":0,"body":"Ich finds ne gute idee. Aber es würde eben wirklich jeder nur noch freies spiel spielen da man ja glaube schon ab 4 v 4 ip und xp bekommt","replies":[{"poster":"HappySchabernack","date":"2015-11-21T21:32:31.736+0000","up_votes":4,"down_votes":0,"body":"ja und? ist doch schön wennd ie leute das spielen was sie mögen :p","replies":[]},{"poster":"BigSnipe","date":"2015-11-22T14:01:50.441+0000","up_votes":2,"down_votes":1,"body":"Es geht in LoL um spaß und nicht um ip, wer viel spielt hat eh scho alles. (ich net) \nAußerdem was ist daran verkehrt freies spiel zu spielen? Riot verdient ja nicht weniger dadurch, und die Community hätte definitv mehr spaß...\n\nWer Ranked spielen will wird weiterhin ranked spielen, und wie ich es von mir kenne spielt man selbst wenn URF dann 2 wochen da ist ja auch nicht nur URF!\n\nDer Vorteil am freien Spiel ist auch das es keine Warteschlange gibt.","replies":[]},{"poster":"Anopka","date":"2015-11-22T02:23:46.362+0000","up_votes":1,"down_votes":0,"body":"Gerade das könnte Riot ja unterbinden","replies":[]}]},{"poster":"I love you Malon","date":"2015-11-21T15:31:59.795+0000","up_votes":4,"down_votes":0,"body":"Das wäre AWESOME :D\nAber!\nIch denke dann würde jeder nur noch Freies Spiel spielen :/","replies":[{"poster":"HappySchabernack","date":"2015-11-21T15:53:35.202+0000","up_votes":1,"down_votes":0,"body":"ja und? wer Empire Earth kennt, weiß dass es clans und Lobby fördern würde, ich erinnere mich daran, dass jeder Clan für seinen Spielmodi bekannt war und man sich diese als gegner ausgesucht hat, falls man sich messen wollte in genau dieser :p\num etwas zu erreichen (gold, silber, EP) muss man ja trotzdem auch andere spiele spielen :p","replies":[{"poster":"I love you Malon","date":"2015-11-21T15:58:40.786+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Happy Incubus,realm=EUW,application-id=cGRapXds,discussion-id=gqt4F1Zn,comment-id=00000000,timestamp=2015-11-21T15:53:35.202+0000)\n>\n> ja und? wer Empire Earth kennt, weiß dass es clans und Lobby fördern würde, ich erinnere mich daran, dass jeder Clan für seinen Spielmodi bekannt war und man sich diese als gegner ausgesucht hat, falls man sich messen wollte in genau dieser :p\n> um etwas zu erreichen (gold, silber, EP) muss man ja trotzdem auch andere spiele spielen :p\n\nWarum glaubst du ist URF nicht Permanent? \n\n- Weil es ein Funmode ist, wenn diese Modien Permanent wären würden man nur noch diese Modien zocken und es würde igrendwann langweillig werden... diese Modien sollen abwechslung Bieten und jeder freut sich dann bald wieder auf den 1.April weil unser Manati mit seinem URF Game zurück kommt!\nWenn diese Modien aber nun im Custom verfügbar sind wäre das irgendwie langweillig...die Spannung wäre weg und der Beliebtheitsgrad würde senken.","replies":[{"poster":"HappySchabernack","date":"2015-11-21T16:12:59.866+0000","up_votes":2,"down_votes":0,"body":"das ist nur eine vermutung, zumal die eine aussage die andere doch wiederlegt,\n-würden nur spielen\n-würde langweilig werden\n-fazit würden nicht nur spielen\n-aram wurde auch nie langweilig, ich maine nur aram btw kenne mehrere die das tun.","replies":[{"poster":"I love you Malon","date":"2015-11-21T16:22:38.881+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Happy Incubus,realm=EUW,application-id=cGRapXds,discussion-id=gqt4F1Zn,comment-id=0000000000000000,timestamp=2015-11-21T16:12:59.866+0000)\n>\n> das ist nur eine vermutung, zumal die eine aussage die andere doch wiederlegt,\n> -würden nur spielen\n> -würde langweilig werden\n> -fazit würden nicht nur spielen\n> -aram wurde auch nie langweilig, ich maine nur aram btw kenne mehrere die das tun.\n\nhehehe sag das mal zu Dominion xP\nRiot hat der Community Dominion perma geschenkt...nun sehe was mit der Map ist :/","replies":[{"poster":"HappySchabernack","date":"2015-11-21T16:30:19.208+0000","up_votes":2,"down_votes":0,"body":"17:26 11 offene Dominions in der lobby, geschätzt für ien normales dominion 1:58 min aram hingegen 40 sek, also schätze ich wird dominion zwar nur ein drittel der zeit wie aram gespielt, ABER es wird gespielt :D\naußerdem ist dominion die einzige map in der find the teemo und hide&seek möglich ist, was ich ab und an mal gerne spiele. man hat soviele möglichkeiten bei meiner oben beschriebenen variandte, dass wenn man alles einmal gespielt hat von vorne anfangen kann, da wird keinen langweilig :D","replies":[{"poster":"I love you Malon","date":"2015-11-21T16:33:12.444+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Happy Incubus,realm=EUW,application-id=cGRapXds,discussion-id=gqt4F1Zn,comment-id=000000000000000000000000,timestamp=2015-11-21T16:30:19.208+0000)\n>\n> 17:26 11 offene Dominions in der lobby, geschätzt für ien normales dominion 1:58 min aram hingegen 40 sek, also schätze ich wird dominion zwar nur ein drittel der zeit wie aram gespielt, ABER es wird gespielt :D\n> außerdem ist dominion die einzige map in der find the teemo und hide&seek möglich ist, was ich ab und an mal gerne spiele. man hat soviele möglichkeiten bei meiner oben beschriebenen variandte, dass wenn man alles einmal gespielt hat von vorne anfangen kann, da wird keinen langweilig :D\n\nMag sein aber ich denke es wird nie passieren :(\n\ndie Vorstellung ist trotzdem schön :c\n\nIch denke das Riot diese Modies auch als Reiz benutzt um nicht soviele Spieler zu verlieren...zumindest glaub ich das :o\nNaja war ne schöne Diskussion :D\n\nMfg XtremBoy {{champion:103}}","replies":[{"poster":"HappySchabernack","date":"2015-11-21T16:37:08.063+0000","up_votes":1,"down_votes":0,"body":"kann sein, danke für die anregungen, evtl wäre es ja eine Option, diesen oben genannten mode für ne woche oder so retail zu bringen, wie die anderen und wenns geil ist und mehr nachfrage gibt wie aram retail zu bringen ^^","replies":[]}]}]}]}]},{"poster":"GooCommitAlivent","date":"2015-11-27T21:47:08.819+0000","up_votes":1,"down_votes":0,"body":"> - Weil es ein Funmode ist, wenn diese Modien Permanent wären würden man nur noch diese Modien zocken und es würde igrendwann langweillig werden...\n\nMoment.. und es ist NICHT langweilig immer Kluft der Beschwörer und ARAM zu spielen? oder 3v3? Wenn dann sollte es vielleicht 2 mal im Monat geben und nicht nach mehreren Monaten.. Du sagst es wäre dann langweilig aber wieso denkst du nicht an die jetztige Moden die wir eigentlich jeden Tag spielen? Es geht immer um das selbe.. ich spiele immer nur Kluft der Beschwörer oder ARAM und richtig selten auch 3v3. Aber ausser diese Modis gibt es wirklich nichts. Ich persöhnlich hasse diese Leute die immre mit der selben Shit kommen wie \"Jaaa das wäre dann nach einer Woche langweilig blaa blaa\" oder diese High-Elo-Freaks-Wannabe-LCS-Player die mit dieser Ausrede kommen \"Jaa niemand würde dann Ranked spielen nur URF irg. was dummes skilloses blaa blaa\".\n\nDas ist ein Spiel! Hier geht es um Spaß! Spielmodis sind Spaß! Aber nicht alle paar Monate.. Jeden Tag das selbe Kluft der Beschwörer und ARAM ist auch nicht wirklich spaßig das wird nicht irgendwann langweilig sondern es fängt schon an langweilig zu werden. Hätten sie die Kluft nicht verändert (Mit den neuen Jungeln, Dragon-Buff, Herold, Grafische Details, etc.) dann würden sicher (MEINER Meinung nach) schon viele Leute aufgehört haben mit dem Spiel.","replies":[]}]}]}]},{"poster":"ManOfPotato","date":"2015-11-21T18:57:15.735+0000","up_votes":3,"down_votes":0,"body":"Das wäre richtig genial! :)\nNe wirklich **sehr gute** Idee! {{champion:53}}","replies":[]},{"poster":"iShadow0","date":"2016-01-10T15:34:33.500+0000","up_votes":2,"down_votes":0,"body":"Ich hoffe sehr Stark das das durchgesetzt wird, alleine um die anzahl an Trolls ( nicht Trundel ) in HIde and seek und Find the Teemo zu senken.","replies":[]},{"poster":"Jedt","date":"2015-11-22T14:40:10.751+0000","up_votes":1,"down_votes":0,"body":"Sehr schöne Idee, wird aber leider niemals kommen, da es viel Arbeit ist und Riot dadurch kein Geld verdient. Würde es ihnen in irgendeiner Art Geld bringen gäbe es das schon längst.","replies":[{"poster":"The Demon Child","date":"2015-11-22T15:13:45.632+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jedt,realm=EUW,application-id=cGRapXds,discussion-id=gqt4F1Zn,comment-id=0003,timestamp=2015-11-22T14:40:10.751+0000)\n>\n> Sehr schöne Idee, wird aber leider niemals kommen, da es viel Arbeit ist und Riot dadurch kein Geld verdient. Würde es ihnen in irgendeiner Art Geld bringen gäbe es das schon längst.\n\nIn wie fern genau würde Riot dadurch kein Geld verdienen? \nich mein ja nur, dass Riot durch die Anzahl der Leute, die 5v5 Normals oder Rankeds spielen auch nichts dazuverdient. Eig. nur an den Champions und Skins, die diese verkaufen. \nund im Custom bekommt man wie bekannt nicht so viele IP zustande.","replies":[{"poster":"Jedt","date":"2015-11-23T16:08:00.641+0000","up_votes":1,"down_votes":1,"body":"Das ist mir bewusst, aber wie du schon gesagt hast verdient Riot durch das spielen des Spiels selber nichts. Dieses muss es aber geben damit man eine Plattform hat um Skins zu verkaufen. Bedeutet also, dass Riot Geld dadurch erhält, dass Leute ihr Spiel spielen und deswegen etwas hinein investieren. Soweit zu dem was du sagtest. Mein Punkt ist jedoch, dass es wie man gesehen hat einfacher für Riot ist Skins z.B. nicht mehr Legacy zu machen (bsp. Mondwende) oder mehr Skins zu produzieren und diese teurer zu verkaufen. So steigern sie ihren Profit. Es ist nun allerdings so, dass sie das Spiel und den Skinverkauf am Laufen halten müssen. Deswegen gibt es Seasonchanges um zu zeigen, das Riot das Spiel zu verbessert. Allerdings ist es dabei so, dass es (wie jetzt auch an den Marksmanbuffs(nicht das ich was gegen sie habe die waren nötig)) eine Umverlegung von Stärken gibt, so dass neue Champions gespielt und Skins dafür gekauft werden. Außerdem gibt es je nach Veränderungen Bundles, die mit RP erworben werden können (bsp. Marksmanbundle). Nach dem Prinzip, nicht 10 Euro gespart sondern 20 ausgegeben, verdient Riot damit Geld. Um nun zu meinem Punkt zu kommen, ist es für Riot ertragreicher Events und Angebote zu machen und Spielmodi damit einfließen zu lassen, um es etwas besonderes zu machen. Würden sie nun diesem super Vorschlag folgen, würde das zur Folge haben, dass z.B. Events nicht mehr so spektakulär wären und man sich sein Spiel selber einstellen kann. Jenes würde bedeuten, dass Riot nur noch durch Patchnotes Einfluss auf Custom Games (die dann beliebter wären als Normal/Ranked) nehmen kann, was durch Items und weitere Einstellungen (wie hier vorgeschlagen) reguliert werden kann. Schlussendlich würden auch Bundles und Angebote für Champions die derzeit Stark sind weniger beliebt werden und Riot würde gleichzeitig dadurch, dass sie mehr Freiheiten geben einen Teil ihrer Kontrolle und ihres Einkommens verringern. Ein weiterer Punkt wie ich schon erwähnt habe wäre, dass es ein Aufwand im Stil einer Seasonänderung sein würde und das kostet eine Menge Arbeit und demnach auch Geld. Fazit daraus ist, dass Riot viel Arbeit investieren würde um ihre Einnahmen vermutlich zu senken, und keinen weiteren Punkt zu schaffen, an dem dieses Geld wieder rein kommt. Das wiederum bedeutet, dass der Aufwand kein Profit erbringt würde und damit für Riot als Unternehmen damit uninteressant ist.","replies":[{"poster":"HappySchabernack","date":"2015-11-24T21:13:25.786+0000","up_votes":2,"down_votes":0,"body":"Interessanter Einwant, jedoch glaube ich, dass die Spieleranzahl durch sowas konstant um 20-30% steigern würden und diese 20-30% würden auch die zusätzlichen skins kaufen. als die, die lol zu langweilig finden und nur bei events ma on kommen.\n\n\"Schlussendlich würden auch Bundles und Angebote für Champions die derzeit Stark sind weniger beliebt werden und Riot würde gleichzeitig dadurch, dass sie mehr Freiheiten geben einen Teil ihrer Kontrolle und ihres Einkommens verringern.\" dem würde ich allerdings nicht zustimmen, würden trotzdem beliebt sein ausgeschlossen dieser custom games.\n\n-evtl kann man ja auch sagen um so ein spiel hosten zu können brauch man VIP status, womit man dann pro monat 10 euro zahlen müsste, wobei ja von 10 spieler nur EINER zahlen \"müsste\", die anderne 9 könnten dem spiel joinen... so kann jeder selbst entscheiden monatlich 10 EUR zu investieren um diesen grandiosen vorteil  zu haben oder lieber auf der Free2play basis bleiben...\n\n-schöner einschleich von leuten die nur F2P spielen wollen und nach 10 spielen von anderen hosts sich denken \"ach egal zahl ich halt ausnahsweise doch mal 2 monate weils cool ist\" und dann sich denken \"oh ist doch geil, ich zahl konstant\" mit anderen worten leute die prinzipiell nur F2P´s spielen das zahlen geschmackvoller machen. hält man mir die ganzezeit n schokoeis vor der nase, würd ichs irgendwann kaufen.\n\n-und die die ABSOLUT das nciht wollen, würdne bei LoL bleiben, weils F2P ist und sich entweder mit den jetzigen machbaren games zufrieden geben oder hohsts zum anschließen suchen ^^\n\n(und das sind nur ideen die ich mir innerhalb 3 minuten ausm finger gezogen habe, die kriegen das bestimmt noch besser hin) wo ein wille ist...\n\n\"man sollte sich nicht mit den problemen sondern mit den lösungen beschäftigen\"\n\nP.S: vielen dank für diese konstruktive kritik ich hoffe dafür gibt es einen lösungsweg um alles spannender zu machen.","replies":[]}]}]}]},{"poster":"HappySchabernack","date":"2017-01-13T16:18:55.474+0000","up_votes":1,"down_votes":0,"body":"- Push - \n\nschon 59 + stimmen ^^","replies":[]}]}