{"poster":"Chancleta Veloz","date":"2017-03-02T23:30:18.197+0000","title":"Acerca de las transmisiones y casters de la CLS","subforum":"Esports","up_votes":6,"down_votes":1,"body":"Buenas tardes,\n\nEscribo este post para dejar saber mis impresiones y para leer las de la comunidad respecto a los casters y analistas actuales de la CLS, y de las trasmisiones en general.\n\nA los clasicos como Rafamaik y Corsario, esta temporada se sum&oacute; a los casters un tal Gabvy. Mi tema principal se dirige a este caster en particular ya que si bien admito que a veces tiene ideas bastante interesantes y hace algunos aportes bien elocuentes respecto al desarrollo de la partida, siento que sus aptitudes como caster no son las mejores. Me explico: Personalmente se ha vuelto una &quot;molestia&quot; el ver los streamings de la CLS ya que la voz de este señor no se siente como la de un profesional (porque si, hay profesionales de la narraci&oacute;n y locuci&oacute;n), a esto le sumo que en los momentos de tensi&oacute;n dentro de las partidas se pone a gritar de manera descontrolada, llegando al punto de tener que bajarle el volumen a la transmisi&oacute;n. Punto aparte, creo que a veces Gabvy es bastante parcial en lo que respecta a los enfrentamientos entre distintos equipos, un poco parecido a los que pasa con los casters internacionales cuando hablan de SKT T1, o para los entendidos en football, lo que le pasa a los comentaristas deportivos de ESPN cuando hay un argentino en cancha. Para terminar con Gabvy, creo que a veces el ego le juega malas pasadas con Tommy (y aqui tambi&eacute;n a Tommy le recalco lo mismo), ya que varias veces durante las partidas se escucha que alguno entrega una idea a la que el otro responde, y se siguen respondiendo de una manera no constructiva, es decir que se siente como si estuviesen &quot;peleando&quot; mas que discutiendo un punto (les faltan las chispas saliendo de los ojos no m&aacute;s).\n\nPor el otro lado, destaco la labor de Gonto ya que he sentido que sus an&aacute;lisis de las partidas junto con el equipo de analistas (Vendetta con puntos menos despu&eacute;s de su pol&eacute;mica en el All-Stars) han sido super constructivos y a&ntilde;aden un buen sabor a las secciones post-partida. Tambi&eacute;n me gustar&iacute;a destacar la labia de Elmo durante las secciones en que participa, si bien a veces se enreda un poco, da gusto escuchar como se expresa.\n\nPor &uacute;ltimo, y a modo general para todos los involucrados en el &aacute;rea del an&aacute;lisis y locuci&oacute;n, hay un punto que yo consideraba como un plus muy bien conseguido en los streamings latinoamericanos y que siento que en esta temporada se ha perdido bastante. De lo que hablo es del uso del vocabulario en ingl&eacute;s por sobre el espa&ntilde;ol. Primero me gustar&iacute;a dejar en claro que yo soy profesor de ingl&eacute;s y me encanta el uso de los t&eacute;rminos en ese idioma, y gozo las transmisiones de la LCS NA y EU por lo mismo. Sin embargo siento que en LAS las transmisiones hab&iacute;an conseguido su propia identidad al usar el vocabulario t&eacute;cnico del juego en nuestro idioma natal, y me regocijaba en el hecho de escuchar los nombres de las habilidades, objetivos, jugadas y otros traducidos de una manera acertada a nuestra lengua. Siento que es un tremendo paso hacia atr&aacute;s el volver a referirnos a &quot;grabs&quot;, &quot;splitpush&quot;, &quot;tilt&quot;, &quot;CC&quot;, &quot;facecheck&quot;, a pesar de que todo lolero entiende los t&eacute;rminos: creo que el ocuparlos en un idioma extranjero hace que el mismo juego se sienta algo extranjero, y no algo de lo que somos parte como la comunidad latinoamericana de League of Legends (o Liga de Leyendas ya que estamos XD).\n\nEspero que los dem&aacute;s usuarios comenten sus propias impresiones respecto a los temas planteados, y que se entienda que las cr&iacute;ticas siempre tienen un &aacute;nimo constructivo, esperando que puedan dar paso a mejoras en la experiencia general de las transmisiones. Disculpen el testamento.\n\nSaludos!","replies":[{"poster":"Riot Maggical","date":"2017-03-02T23:58:31.835+0000","up_votes":3,"down_votes":0,"body":"Simplemente quiero agradecerles a todos que nos dejen estas opiniones y espero muchas más. Nos sirve mucho para crecer que nos cuenten que cosas les gustan más, que cosas menos, que podemos cambiar y demás.\n\nLos escuchamos siempre e iremos haciendo lo que podamos para cada vez darles una transmisión aún mejor. Espero hayan visto un cambio este año y creo que estamos en el buen camino.\n\n¡Un abrazo!","replies":[{"poster":"Estoy AFK","date":"2017-03-03T00:25:52.610+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=Ky2nrTjR,discussion-id=t3Yeaxbt,comment-id=0001,timestamp=2017-03-02T23:58:31.835+0000)\n>\n> Simplemente quiero agradecerles a todos que nos dejen estas opiniones y espero muchas más. Nos sirve mucho para crecer que nos cuenten que cosas les gustan más, que cosas menos, que podemos cambiar y demás.\n> \n> Los escuchamos siempre e iremos haciendo lo que podamos para cada vez darles una transmisión aún mejor. Espero hayan visto un cambio este año y creo que estamos en el buen camino.\n> \n> ¡Un abrazo!\n\nPero tambien ten en cuenta la mia:\n\nGabvy y Tommy me encantan! Aunque por supuesto corsario y rafamaik lo hacen muy bien tambien, lo de gabvy particularmente me parece genial. Otra voz, otra opinion, su relato de la partida es emocionante y explosivo. Me encanta. Por supuesto, todos tienen defectos, y deberian intentar hacer algun analisis propio cada uno de los que estan en la mesa, y los casters para ver en que pueden mejorar, pero sin lugar a dudas no los corran. Me gustan esos casters. Apoyo a Gabvy! Y cuando se quejan de sus gritos, lo que a alguno puede parecerle molesto, a mi me encanta. Porque un muchacho tan calmado de la nada explota en emocion por las jugadas y lo bueno es que dice las cosas como muchas veces las piensa uno que esta mirando al otro lado. Es menos reservado para criticar y elogiar y no toma parte por ninguno de los dos equipos.\n\nDiganle a gabvy que lo apoyo jaja! ","replies":[{"poster":"Gabvy2018","date":"2017-03-03T19:25:25.544+0000","up_votes":5,"down_votes":0,"body":"Te amo man (?","replies":[{"poster":"Estoy AFK","date":"2017-03-04T01:32:48.074+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Riot Gabvy,realm=LAS,application-id=Ky2nrTjR,discussion-id=t3Yeaxbt,comment-id=000100010000,timestamp=2017-03-03T19:25:25.544+0000)\n>\n> Te amo man (?\n\nEa ea jaja gabvy! Si supieras lo que te dan con un palo algunos, me amarias aun mas jajajaj","replies":[]}]}]},{"poster":"Chancleta Veloz","date":"2017-03-03T00:10:53.957+0000","up_votes":2,"down_votes":0,"body":"Con saber que alguien lo leyó y le otorga un valor me doy por pagado.\n\nSaludos!","replies":[{"poster":"Riot Maggical","date":"2017-03-03T00:17:52.064+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Chancleta Veloz,realm=LAS,application-id=Ky2nrTjR,discussion-id=t3Yeaxbt,comment-id=00010000,timestamp=2017-03-03T00:10:53.957+0000)\n>\n> Con saber que alguien lo leyó y le otorga un valor me doy por pagado.\n> \n> Saludos!\n\n¡Siempre leemos todos sus comentarios! Es la mejor manera que tenemos de crecer :)","replies":[{"poster":"Estoy AFK","date":"2017-03-03T00:34:37.089+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=Ky2nrTjR,discussion-id=t3Yeaxbt,comment-id=000100000000,timestamp=2017-03-03T00:17:52.064+0000)\n>\n> ¡Siempre leemos todos sus comentarios! Es la mejor manera que tenemos de crecer :)\n\ny perdon por el spam, pero seria bueno que lean comentarios seleccionados de los que vemos siempre la copa latinoamerica durante la transmision y la mesa de analisis. Como leer tweets, o lo que sea.","replies":[{"poster":"Franja","date":"2017-03-03T11:08:47.789+0000","up_votes":1,"down_votes":2,"body":"Oh eso lo hacian el año pasado y lo yo al menos lo odiaaaaaaaaaaaaaaba jajajaj","replies":[]}]}]}]}]},{"poster":"Franja","date":"2017-03-02T23:43:33.065+0000","up_votes":2,"down_votes":0,"body":"A mi me gusta bastante la forma en como castea Gabvy, le pone mucha emocion al transmitir y al menos a mi me la logra transmitir. Tengo mis casters menos favoritos tambien, aunque nada del otro mundo, ninguno me parece molesto.\n\nCreo que lo interesante del equipo que castean/analizan es que todos son super distintos entre si, mas alla de si a alguno le gusta mas uno u otro, puedes ver la diferencia entre un Tommy y un Corsario y al menos a mi eso me entretetiene.\n\nRespecto al idioma, personalmente prefiero el uso del ingles siempre que el termino sea mayoritariamente usado asi por los el jugador comun y me sangran los oidos cada vez que escucho carril inferior (pero no tanto como cuando lei football jaja).\n\nComparto lo de Gonto, creo que es el que mas sabe del juego entre todos, un poco por encima respecto a Vendetta. Ambos fueron un aporte valioso.","replies":[{"poster":"Chancleta Veloz","date":"2017-03-03T00:09:58.200+0000","up_votes":2,"down_votes":0,"body":"A mi de hecho me agrada la elocuencia de Gabvy, sin embargo es mas un tema de volumen lo que me \"molesta\" (noten las comillas). Para hacer un símil, es como los cantantes: Puedes cantar fuerte sin gritar, que es la manera correcta, o puedes gritar para escucharte mas, que sería lo incorrecto. Siento que Gabvy hace lo último. Podríamos decir que le falta matizar un poco mas en el volumen.\n\nConcuerdo plenamente contigo en que la diversidad del grupo de analistas hace que la experiencia post partida sea mucho mas fructífera que con un grupo mas homogéneo.\n\nEn lo que respecta al idioma, yo también lo consideraba adecuado el uso del inglés ya que muchas veces son los términos mas widespread.  Sin embargo, me inclino por el español por el sentido de identidad de la comunidad. (jaja lo del football fue instintivo, cosa de profe de inglés XD).\n\nSaludos","replies":[{"poster":"Gabvy2018","date":"2017-03-03T19:16:30.484+0000","up_votes":5,"down_votes":0,"body":"Ey gracias por el feedback, la verdad no me había puesto a verlo de esa forma. \n\nHay días que tengo mas energías y otros días menos, pero sin dudas voy a intentar mantener un margen de volumen para no aturdir. \n\nJusto estuve mirando los partidos de ayer y sentí que no llegue a niveles donde podía molestar, igualmente de ahora en mas voy a prestar mas atención cuando sienta que esto sucede para no molestar (no prometo nada si llegan hacer un penta ) . \n\nEspero puedas hacer posts así con frecuencia, las criticas de este estilo son bienvenidas.","replies":[{"poster":"Chancleta Veloz","date":"2017-03-06T16:14:41.143+0000","up_votes":4,"down_votes":0,"body":"Un gusto poder hacer este tipo de posts y que sean recibidos de la manera correcta. Hubiese sido fácil enojarse o sentirse atacado, pero entendiste a la perfección la idea así que por eso sumas puntos extra :)\n\nAhora si hay un penta, creo que estas en DEBER de subir los decibeles de manera importante, so go ahead.","replies":[{"poster":"Gabvy2018","date":"2017-03-06T20:59:52.201+0000","up_votes":2,"down_votes":0,"body":"JAjajaj justo estoy en la parte de player support, así que no hay forma de evitar criticas pocas constructivas. \nCuando se ven comentarios así te nace responderlos y formentarlos. \n\nSi llega a ver un penta, no me hago cargo (?","replies":[]}]}]}]}]},{"poster":"Turing Test","date":"2017-03-03T00:35:31.562+0000","up_votes":4,"down_votes":0,"body":"Gabvy \"suena\" medio boludo pero para decir la verdad, es el caster que más emocionante hace una jugada. Si hay algo que me gusta es sentir apasionadamente una transmisión y con los casters de LAS, así lo siento. No tengo quejas de ninguno y eso que suelo ser quisquilloso con esto. Lamentablemente, en Worlds sigo prefiriendo a los casters de NA. En Latinoamérica los chicos de acá son acordes a los jugadores... es como que todo fuera de la mano. En el mundial es algo distinto. Se \"siente\" la necesidad de analizar y transmitir muy metódicamente las jugadas. Una situación ideal sería un caster muy metódico + Gabvy del otro lado","replies":[]},{"poster":"Riot Maggical","date":"2017-03-03T00:57:56.287+0000","up_votes":3,"down_votes":0,"body":"Leemos TODAS las opiniones chicos, incluso en Twitter, Facebook, Instagram y demás redes que tenemos. Pasa que para contestar es más fácil hacerlo acá a todos juntos, pero eso no significa que no miremos los otros lados también :)\n\nY claro que tenemos las diferentes opiniones en cuenta, buenas, malas, a favor y en contra, si es para construir una escena mejor siempre queremos leerlos.\n\n¡Abrazo!","replies":[{"poster":"Locked ULIvE","date":"2017-03-03T02:17:19.776+0000","up_votes":2,"down_votes":0,"body":"Oye maggical, el chat me pareció bastante cool, mas con la implementación de la plataforma da youtube para gammers, me encanto. Saludos. Faltan los drakes, el elemento.","replies":[{"poster":"Riot Maggical","date":"2017-03-03T09:57:24.447+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Locked ULIvE,realm=LAS,application-id=Ky2nrTjR,discussion-id=t3Yeaxbt,comment-id=00040000,timestamp=2017-03-03T02:17:19.776+0000)\n>\n> Oye maggical, el chat me pareció bastante cool, mas con la implementación de la plataforma da youtube para gammers, me encanto. Saludos. Faltan los drakes, el elemento.\n\n¿Cómo que faltan? Los marcamos en la transmisión a medida que los van haciendo con su ícono, ¿a qué te refieres?","replies":[]}]}]},{"poster":"Brick Man","date":"2017-03-04T05:12:32.548+0000","up_votes":2,"down_votes":0,"body":"Respecto a los casters creo que en parte estoy de acuerdo con que \"grita\" por sobre \"hablar fuerte\", pero no pasa de ahí, en mi opinión Gabvy no es mi favorito, pero si escucharlo me da una sensación distinta, de renovación, considerando que llevábamos años escuchando a Corsario y Rafa (unos grandes <3)  y que al final es necesario para no ir quedándose estancado.\n\nAhora si por alguna razón tuviera que elegir otro caster para que traigan sin duda elijo a Fahrenheit, encuentro que aporta mucho desde el punto de vista analítico además de que su voz es bastante agradable de escuchar cuando relata (KappaPride).\n\nY respecto al tema del idioma, estoy muy de acuerdo contigo, las palabras en español nos dan identidad, aunque me costó un tiempo acostumbrarme (Tirador wtf?) pero no me gusta cuando siento que la traducción no pega en un relato, por ejemplo: En algún stream (de LAN me parece) escuché que al 'dive' bajo torre le llamaban 'sumergimiento', que es obvio por ser la traducción de la palabra, pero al escucharlo en un relato, para mi al menos, no pega. Aunque reconozco que hay algunas que nunca se me habrían ocurrido como 'emboscada'='gank'.\n\nEspero este comentario no muera perdido en el espacio-tiempo de internet {{item:3070}}","replies":[{"poster":"Chancleta Veloz","date":"2017-03-06T16:16:32.493+0000","up_votes":1,"down_votes":0,"body":"Totalmente de acuerdo en absolutamente todo. Tu comentario no morirá ignorado {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Diosmo","date":"2017-03-03T04:45:36.574+0000","up_votes":2,"down_votes":0,"body":"Es una cuestion de gustos, a mi me divierte Gabvy, castea de una forma mas descontracturada. Obviamente los clasicos Corsario y Rafa se conocen y castean desde hace mucho por eso se entienden, se dan el pie, etc.\nMe gusta mucho la produccion, nada que envidiarle a NA o KR (por ahi veo las transmisiones en ingles de ambos) y tienen igual calidad.","replies":[]},{"poster":"Charlôtte","date":"2017-03-03T00:02:15.708+0000","up_votes":2,"down_votes":0,"body":"Riot Gabvy frecuenta los foros xd \nMaggical, sé que lees esto, invocalo :D \n\nA mi me parece más piola Gabvy y su compañero, le dan toda la emoción a la partida. Además el acento argento le da ese toque de felicidad. \nCorsario y Rafa me parecen demasiado partido de futbol, excepto cuando empieza la acción que hacen ver todo increible.\nPero bueno, el ego es parte de él, además lo dice en joda, es parte del salseo que le gusta hacer, si hablamos de profesionalismo no podemos tocar cómo es él xd\n\nSon jugadores como vos y cada uno tiene su manera de jugar, por lo tanto, su manera de ver lo que sucede en las partidas\n\nEdit: Me ganó mashical :B","replies":[]}]}