{"poster":"UselessSnek","date":"2018-10-07T15:21:22.949+0000","title":"Stärkeres Durchsetzen gegen toxischen Verhalten","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":3,"body":"Hallo Leute!\r\n\r\nIch wollte euch mal fragen wie es euch bei dem Thema geht: ich treffe in LoL oft auf Spieler mit Verhalten welches echt unter aller Sau ist und die reporte ich dann auch. Aber in den 3 Jahren die ich League spiele habe ich vielleicht 3/4 mal die R&uuml;ckmeldung bekommen, dass ein Spieler, den ich reportet habe, bestraft wurde.\r\n\r\nIch kann verstehen dass jemand der nur einmal auff&auml;llt nicht gleich den Bannhammer oder so abbekommt oder &uuml;berhaupt bestraft wird, weil einmal ist keinmal. Allerdings ist negatives Verhalten in LoL ein massives Problem wogegen etwas unternommen werden sollte. Eigentlich kann man sagen dass man fast  immer einen Flamer/Troll/etc. im Team hat. Wobei ich da nicht schlechte Spieler oder Leute die ungew&ouml;hnliche Itembuilds ausprobieren mit hineinz&auml;hle.\r\n\r\nDas inzwischen nicht mehr ganz so neue Ehrungssystem hilft da leider auch nur wenig. Einfach weil ich die Skins / Champions die ich mag schon habe und das ist denke ich mal bei den meisten so. Eine niedrige Ehrungsstufe bestraft nur wenig. Man kann sich bestimmte kosmetische Gegenst&auml;nde holen, manchen Merch nicht kaufen und an Clash nicht teilnehmen. Das ist nichts was wirklich abschreckt.\r\n\r\nWas f&uuml;r Ideen/L&ouml;sungsans&auml;tze habt ihr so? Hat Riot da was in Arbeit? Macht ihr auch solche Erfahrungen?","replies":[{"poster":"Humpelstilzche","date":"2018-10-07T16:30:50.860+0000","up_votes":3,"down_votes":0,"body":"> Aber in den 3 Jahren die ich League spiele habe ich vielleicht 3/4 mal die Rückmeldung bekommen, dass ein Spieler, den ich reportet habe, bestraft wurde.\n\nDu bekommst nicht jedes mal Rückmeldung, wenn ein Spieler den du reportet hast bestraft wurde. Keine Rückmeldung zu erhalten bedeutet NICHT, dass der Spieler nie bestraft wurde. \n\n> Eine niedrige Ehrungsstufe bestraft nur wenig. \n\nEs ist auch weniger als Strafe gedacht, sondern vielmehr als Belohnung für's \"normal\" sein.","replies":[{"poster":"UselessSnek","date":"2018-10-07T16:45:16.006+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksycr4EU,comment-id=0000,timestamp=2018-10-07T16:30:50.860+0000)\n>\n> Du bekommst nicht jedes mal Rückmeldung, wenn ein Spieler den du reportet hast bestraft wurde. Keine Rückmeldung zu erhalten bedeutet NICHT, dass der Spieler nie bestraft wurde. \n> \n> Es ist auch weniger als Strafe gedacht, sondern vielmehr als Belohnung für&#x27;s &quot;normal&quot; sein.\n\nDas wusste ich nicht. Danke für die Info!","replies":[{"poster":"Humpelstilzche","date":"2018-10-07T16:49:44.721+0000","up_votes":2,"down_votes":0,"body":"Kein Problem, wissen die meisten nicht ;)","replies":[]}]}]}]}