{"poster":"Natuz Vincere","date":"2019-01-17T03:48:34.979+0000","title":"Riot Maggical - lolesports ¿será posible implementar?","subforum":"Esports","up_votes":2,"down_votes":1,"body":"Estuve viendo la p&aacute;gina de las.lolesport y a mi gusto esta todo muy bien, todo bonito y ordenado **Felicidades**.\r\nComo ya van empezando los split de las ligas que me interesan estaba buscando un sitio donde pudiera tener todo ordenado partidas/horarios, pero no encontraba nada hasta que se me prendi&oacute; la ampolleta de revisar la pagina de lolesport y quede fascinado. Ten&iacute;a un par de consultas ojala pudieras solucionarlas. \r\n\r\n1-. La seccion de Ligas\r\nhttps://imgur.com/a/ZQ90N9W\r\n&iquest;Cual es la Finalidad de esta seccion de la pagina de lolesports? Como la veo vac&iacute;a me causa la duda.\r\n\r\n2-. Esta Programaci&oacute;n de los horarios seg&uacute;n las ligas filtradas me simplifico mucho todo!\r\nhttps://imgur.com/a/vZDMjXi\r\nPero quer&iacute;a preguntar si existe o existir&aacute; la posibilidad de **agregar un icono al lado de las partidas**, que este asociado a que partidas me gustar&iacute;a que se me **notifiquen al celular** con tan solo marcarlas, para que asi en el caso de que quisiera seguir mas ligas de las que sigo (LLA, LCS, LEC y LCK) pudiera en cierto sentido &quot;pickear&quot; las partidas que son de mi inter&eacute;s, &iquest;no s&eacute; si se entiende mi idea?. Por ejemplo:\r\nhttps://imgur.com/a/HDv2BRx\r\nSupongamos que ademas de esas 4 ligas quiero empezar a ver partidas de inter&eacute;s (para mi) de la CBLOL (para ver las partidas de whitelotus), LPL (para ver al actual campeon) y OPL. El horario ser&iacute;a un menjunje con mas de unas partidas solapadas y ya que twitch o youtube solo me notifica cuando &quot;estan ON los streams&quot; hay ciertas partidas que me gustar&iacute;a priorizar y ver en vivo.\r\n\r\n3-. Siguiendo el punto (2) la seccion de &quot;ver&quot;, asi como tienen la programaci&oacute;n, poder tambi&eacute;n tener las transmisiones de todas las ligas a mano, las que esten en vivo o a punto de comenzar, para as&iacute; estar mas ordenado e ir directo al grano o **escoger entre las posibilidades todas a la mano**. Ojal&aacute; alg&uacute;n d&iacute;a todo se** centralice en la p&aacute;gina de lolesport** y no tener que andar indagando en twitch o youtube cada stream deportivo.\r\n&iquest;Crees tu que con esos detalles pueda existir un aumento en el uso de la p&aacute;gina de lolesport? &iquest;Tienen planeado m&aacute;s implementaciones a futuro?\r\n\r\nPD: S&eacute; que cada d&iacute;a mejoran m&aacute;s, has aprendido a escuchar a la comunidad cuando de esport se trata y he sido testigo de aquello, **no nos ba&ntilde;amos dos veces en las aguas de un mismo r&iacute;o, ni siquiera una vez**, se que pueden mejorar a&uacute;n m&aacute;s, este a&ntilde;o creo que sera mi primera temporada en a&ntilde;os que seguir&eacute; el transcurso de la LLA, en especial por ese par de coreanos, **gracias por tener una p&aacute;gina tan ordenada**.\r\n\r\nSaludos Cordiales\r\nOjal&aacute; veas este post, yo s&eacute; que eres muy dedicado y el tiempo no te sobra!","replies":[{"poster":"Riot Maggical","date":"2019-01-17T17:53:03.736+0000","up_votes":1,"down_votes":0,"body":"Hola Scoorpiuz,\n\nMuchas gracias por tomarte el tiempo de hacer estos comentarios, es bueno saber que hay gente realmente interesada y preocupada por dar sus opiniones de la mejor manera.\n\nTe comento que estamos trabajando en lanzar un nuevo sitio web, lo más pronto posible, que será único para LAS y LAN. Es por eso que las webs actuales de LAS y LAN no han sufrido cambios y tampoco los sufrirán en estas primeras semanas.\n\nLa intención a nivel mundial de hecho es llevar la experiencia de mirar partidas a watch.lolesports.com y nosotros no seremos la excepción. Ya lo venimos haciendo hace más de un año y allí van a encontrar todo lo referido a nuestra liga hoy en día.\n\n¡Un abrazo!","replies":[{"poster":"Natuz Vincere","date":"2019-01-18T01:18:26.764+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=Ky2nrTjR,discussion-id=6Fv4sflU,comment-id=0000,timestamp=2019-01-17T17:53:03.736+0000)\n>\n> Hola Scoorpiuz,\n> \n> Muchas gracias por tomarte el tiempo de hacer estos comentarios, es bueno saber que hay gente realmente interesada y preocupada por dar sus opiniones de la mejor manera.\n> \n> Te comento que estamos trabajando en lanzar un nuevo sitio web, lo más pronto posible, que será único para LAS y LAN. Es por eso que las webs actuales de LAS y LAN no han sufrido cambios y tampoco los sufrirán en estas primeras semanas.\n> \n> La intención a nivel mundial de hecho es llevar la experiencia de mirar partidas a watch.lolesports.com y nosotros no seremos la excepción. Ya lo venimos haciendo hace más de un año y allí van a encontrar todo lo referido a nuestra liga hoy en día.\n> \n> ¡Un abrazo!\n\nEso suena de maravilla! Entonces esperaré con ansias ver el nuevo trabajo! Se que será de calidad! Ojalá lo anuncien por aca (Foro) que es lo unico que reviso generalmente!\nSaludos y muchas gracias por tomarte un tiempito en responder, siempre has sido considerado con los demás!\nGLHF","replies":[]}]}]}