{"poster":"DESTRUCT0R123","date":"2015-04-29T19:20:03.914+0000","title":"¿ Que campeon es el mas fuerte de LOL ?","subforum":"Charlas Generales","embed":{"description":"Bueno hola amigos , aqui estare suviendo tutoriales,gameplays y algunas canciones; por cualquier duda que tengan comuniquense conmigo por google o hotmail. S...","url":"https://www.youtube.com/channel/UCY609QI9F_oWDBVLeB_hPZQ","image":"http://i.embed.ly/1/image/resize?url=https%3A%2F%2Fyt3.ggpht.com%2F-VZDavHDZaOI%2FAAAAAAAAAAI%2FAAAAAAAAAAA%2FkTCb-DwIkJc%2Fs900-c-k-no%2Fphoto.jpg&key=a45e967db0914c7fb472fd4381e6c85b&width=425"},"up_votes":1,"down_votes":1,"body":"ES SOLO PARA SAVER QUE CAMPEON ES EL MAS FUERTE DEL LOL PORQUE HAY MUCHOS.","replies":[{"poster":"MolotovKiller","date":"2015-04-29T21:25:52.181+0000","up_votes":1,"down_votes":0,"body":"Dependiendo, pero no hay tantos rotos actualmente a mi parecer, si no que hay algunos que merecen un retoque en alguna cosa en particular.\nADC:\nDraven: Entre la pasiva y el daño abusivo de la Q lo hacen un dolor de cabeza, un poquito menos de daño de esa Q no le viene mal.\nGraves: Por lejos, el PEOR. Merece un nerf, no un buff por que no es normal que siendo adc se beneficie de estar cerca de sus enemigos. A los tanks los burstea con la W esa mugrosa y si no burstea al tank, borra a tu adc y encima para hacer la gracia, la pasiva le da MR y armor.\nMid:\nYasuo: simple, es Yasuo, un asco de personaje con movilidad, tazas de critico absurdas y abusivas y que encima tiene una pared que cubre TODO o casi todo y mejor no hablo de su escudo que le cubre el daño.\nTop:\nCreo que ninguno, si eso por ahí Sion un poquitin (no mucho) o Heca, pero despues meh.\nJg:\nLo mismo que arriba, ninguno esta por encima la verdad.\nSupp:\nBlitzcrack: Con el pedazo de chatarra me pasa algo curioso y es que si bien tiene un kit de habilidades bueno y que no esta OP, el rol que desempeña hace que dicho kit se vuelva muy fuerte. Al seis su combo es gastar un flash o que tu support gaste casi todo para sacar con vida al adc o para salvar a su compañero.","replies":[]},{"poster":"Runth","date":"2015-04-29T19:28:41.704+0000","up_votes":1,"down_votes":0,"body":"Yo (okno)\n\nUstedes? (okno)\n\nMmmm el pelao(dal) y condor (okno)\n\nMmm.... {{champion:268}} Shurima???\n\nMe doy, no se :/","replies":[]},{"poster":"The Darkitect","date":"2015-04-29T19:26:31.062+0000","up_votes":1,"down_votes":0,"body":"No existe el campeon mas fuerte","replies":[]},{"poster":"DESTRUCT0R123","date":"2015-04-29T19:21:09.901+0000","up_votes":1,"down_votes":1,"body":":)","replies":[]}]}