{"poster":"SoloDöner","date":"2015-02-22T18:22:09.662+0000","title":"Was ist nur mit dem Sonntag passiert?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":1,"body":"Früher und für einige heute war es der Tag des Herrn. Man ruhte sich aus. War enstpannt.\r\n\r\nDie ganze Woche sind LOL-Spieler freundlich, kooperativ. Es macht Spaß zu spielen. Selbst wenn man verliert. Das ist Sonntags nicht so, Seit ich spiele, wird am Sonntag geflamed, Krankheiten gewünscht, gefeedet. Nicht man selbst, sondern der Jungler soll die Lane für einen gewinnen, das übliche man kennt es.\r\n\r\nWarum am Sonntag? Was ist da los????","replies":[{"poster":"Hüxün","date":"2015-02-22T18:24:58.367+0000","up_votes":2,"down_votes":0,"body":"Das ist eher subjektiv. Ich hatte heute nur einen der arg aus der Reihe getanzt ist, ansonsten ging es eigentlich bzw. war es auf jeden Fall nicht schlimmer als die restlichen Tage.","replies":[]},{"poster":"XPekeks","date":"2015-02-22T18:23:32.589+0000","up_votes":2,"down_votes":1,"body":"Glaube da sitzen einfach die meisten mit Alk am PC.","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-02-22T21:20:13.248+0000","up_votes":1,"down_votes":0,"body":"ich durfte gerade meinem Mitspieler erklären, dass ich ein furchtbarer Yi Spieler bin... in nem ARAM...nicht so, dass ich mir den ausgesucht hätte... der wollte mich trotzdem unbedingt reporten... aber hey, lass ihn doch, wenn er unbedingt sein Report-Rating ruinieren will...\n\nAuch hörte ich gerade das erste mal ein \"OMG, FCK YOU THESE STUPID BANS, REPORT PLS\"... im Nemesis Draft... einem Fun Mode... ob das nun wirklich am Sonntag liegt, sei mal da hingestellt... loswerden wollte ich es trotzdem mal...","replies":[]},{"poster":"eingew","date":"2015-02-22T18:59:45.710+0000","up_votes":1,"down_votes":1,"body":"Hmm. Also ich hab heute nur entspannte Spiele gespielt, waren nicht mehr toxische Leute als sonst auch. Zwei oder drei klar, aber nur so Kleinigkeiten (\"ich mag den nicht, weil der doof ist, reported den bitte\" und son Kram).","replies":[]}]}