{"poster":"Go to play","date":"2017-07-28T23:39:24.212+0000","title":"#Nunca te rindas!!!!!","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"ME olvide el tp, voy riven top, me quedo el ignite de la partida anterior que jugue midline.\r\n\r\nLa linea no es complicada pero tampoco es facil, el jungla me campea como un campeon, los de bot van bien pero el midline le esta gankeando la linea como a mas no poder, limitandolos. \r\n\r\nempiezan a caer mid top bot, tiro TOP, pero ellos nos vuelven a tirar las de grado dos de las 3 lineas.\r\n\r\nlos agarran solos a nuestro jungla y la inebitable muerte luego de un dragon ancestral, nos quita inhibidor central, y las dos torres del nexo. estan poniendo GG a mas no poder en el chat....  y en mi pc arranca a sonar este tema.\r\n\r\nhttps://www.youtube.com/watch?v=ZTidn2dBYbY\r\n\r\n\r\nAhi es donde todo se prende fuego, con dos segundos de regeneracion de mi campeon, y buenos items, no voy nada mal en farm, ni en kills, con buen kda... para ir perdiendo, \r\nsalimos de la base, le faltaban 2 hit al nexo, y deleteamos a los tress que estaban ayi con dos compa&ntilde;eros mas...\r\n\r\nEntramos en trance de SKT1, luchabamos a desgaste, juntos, coordinando habilidades, entraban y salian de las tf, como campeones, nadie moria, y matabamos al draven feed,. luego al maldito vladimir.\r\n\r\nfizz estaba prendido en rabia,. baiteaba como un campeon, uy cuando parecia morir, sorprendia con un ataque sorpresivo inesperado, conn lo cual siempre que este el factor humano en un juego,. es el mejor arma.\r\n\r\nluchamos por baron, entro la leona y vladimir junto con jarvan, a todo mas, no tenian a draven ni a oriana cerca. no dudamos en pelear, los eliminamos , luegoa uno por uno aprovechando la distancia.\r\n\r\nEliminamos la torreta de grado 1, de mid. luego la torreta de grado 2,. inhibidor, ultima TF\r\n\r\nla partida se gano.\r\n\r\nel unico inconveniente que tuvimos fue en la pantalla de honores, no podiamos darle honores a todos...","replies":[{"poster":"Siúlóir Knock","date":"2017-07-29T00:08:52.827+0000","up_votes":1,"down_votes":1,"body":"lo único que separa a un guerrero de un noob es el corazón <3","replies":[]},{"poster":"Keykpo","date":"2017-07-28T23:51:58.970+0000","up_votes":1,"down_votes":1,"body":"Pasa papu, por eso a veces surrendear esta mal :v a menos que no se pueda dar vuelta xD","replies":[]}]}