{"poster":"F6 Tornado","date":"2017-07-31T03:02:37.535+0000","title":"Weird Censoring in runes/masteries","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Just recently something changed where the masteries/runes are now censored (something that is only visible to YOU), and I would also like to add that I have the profanity filter off.... \r\n\r\nHowever, if that wasn't already bad enough, the words that are banned are just ridiculous... Soraka shows as So***a and the entire word \"support\" is censored for some reason. What's odd is that these are actually in my current masteries, but if I edit them at all, it now censors them.\r\n\r\nWhat is this and why is this in place?","replies":[{"poster":"Broporo","date":"2017-07-31T04:50:37.620+0000","up_votes":1,"down_votes":0,"body":"Wow that's pretty strange. I don't believe mastery page names are meant to be filtered out. I did receive word that some of the language filters have been updated, and that may have caused the filtering to bleed over into masteries for some strange reason. I can pass this along for you, but also go ahead and post this over in [**Report a Bug**](http://boards.na.leagueoflegends.com/en/c/bug-report) in order to draw the devs attention a little more!","replies":[{"poster":"PaladinNO","date":"2017-07-31T21:02:53.685+0000","up_votes":2,"down_votes":0,"body":">I don't believe mastery page names are meant to be filtered out.\n\nYou may start believing it is a thing.\nhttps://boards.na.leagueoflegends.com/en/c/gameplay-balance/TlVGM8Vm-yo-riot-enough-with-the-mastery-censoring\n\nSame with profile status messages.\nF.ex. when I wanted to have \"DT Lulu recall plz\" (as reference to Dragon Trainer Lulu's lack of a recall animation, despite being a 1350 RP skin), the system singled out \"DT\" as offensive for some reason. RIP context.\n\nI don't need a profanity filter - as a mature adult (unless this game is \"PG-32\"-rated), I can take it. \nJust add a disable option on the filter, you know. Leave it on by default, but let the grown-ups decide for themselves.","replies":[]}]},{"poster":"HonestJohnTheCon","date":"2017-07-31T16:31:12.525+0000","up_votes":1,"down_votes":0,"body":"This happened to me too. The \"Cai\" in Caitlyn is censored so it looks like ***tlyn.","replies":[]}]}