{"poster":"Tomas83","date":"2018-03-24T19:40:01.777+0000","title":"Quien es mas dificil, Riven o Teemo?","subforum":"Jugabilidad, balance y narrativa","up_votes":5,"down_votes":3,"body":"Esta pregunta esta referida a quien es mecanicamente mas dificl. Tuve una partida con teemo en la que una riven se puso empezo a enojar de que le atacara con basicos y empezo a decir cosas como, &quot;Pero que facil ese champ que solo pegas basicos&quot; o cosas de que riven es dificil y teemo facil. no recuerdo sus palabras exactas. Lo mismo estuvo diciendo sobre el warwick de que es demasiado facil y que eramos mancos por usarlos, en ningun momento de la partida dije que si o que no ni si jugaba bien o mal, creo que en un momento puse xd en el chat pero nada mas. La cosa es que su equipo empezo a apoyar la idea de que teemo es de mancos y que sus champs son muy dificiles, de la evelyn me lo creo pero de riven ya no tanto.\r\n\r\nYo nunca use a riven asi que nose si es verdad o no, entonces mecanicamente &iquest;Riven es mejor que teemo?\r\nPor cierto, si tienen duda, ganamos la partida.","replies":[{"poster":"Danshid","date":"2018-03-24T19:41:57.644+0000","up_votes":6,"down_votes":1,"body":"mira, teemo es mas facil, pero riven tampoco es demasiado dificil, ya que llega un punto en la partida donde solo aprietas qqqrr al adc y lo matas \n\npd: a pesar de riven ser facil, tambien es dificil de dominar, no me malinterpreten","replies":[{"poster":"Little T","date":"2018-03-24T19:47:51.114+0000","up_votes":1,"down_votes":0,"body":"> pd: a pesar de riven ser facil, tambien es dificil de dominar, no me malinterpreten\n\n\nnoooo amigo, ya sembraste la semilla de la discordia... dijiste que riven \"tampoco es demasiado difícil\", ese \"tampoco es demasiado\" me ofendió terriblemente... \n\nhttps://media.giphy.com/media/3o85xCOtskra2ISaVW/giphy.gif","replies":[{"poster":"Tomas83","date":"2018-03-24T19:49:57.478+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Verdugo de Yasuo,realm=LAS,application-id=xQmJPO8F,discussion-id=gwdYsXhZ,comment-id=00000001,timestamp=2018-03-24T19:47:51.114+0000)\n>\n> noooo amigo, ya sembraste la semilla de la discordia... dijiste que riven &quot;tampoco es demasiado difícil&quot;, ese &quot;tampoco es demasiado&quot; me ofendió terriblemente... \n>\n\nSi hubiese puesto \"Es el champ mas dificil que existe y existira\" estarias contento?","replies":[{"poster":"Little T","date":"2018-03-24T19:51:27.407+0000","up_votes":1,"down_votes":0,"body":"> Si hubiese puesto \"Es el champ mas dificil que existe y existira\" estarias contento?\n\npor supuesto que si!!! junto con yasuo por supuesto :v","replies":[]}]}]},{"poster":"CoronavirusC0V","date":"2018-03-24T22:55:19.229+0000","up_votes":1,"down_votes":0,"body":"en resumen, ambos son sencillos, pueden llegar a matar con bastante facilidad pero al nivel de dominar mecanicas riven es mas dificil","replies":[]},{"poster":"Tomas83","date":"2018-03-24T19:46:38.940+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Danshid,realm=LAS,application-id=xQmJPO8F,discussion-id=gwdYsXhZ,comment-id=0000,timestamp=2018-03-24T19:41:57.644+0000)\n>\n> mira, teemo es mas facil, pero riven tampoco es demasiado dificil, ya que llega un punto en la partida donde solo aprietas qqqrr al adc y lo matas \n> \n> pd: a pesar de riven ser facil, tambien es dificil de dominar, no me malinterpreten\n\nSe que teemo es muy facil, pero esta riven ademas de ser mala se quejaba de que era demasiado facil. No le creia hasta que todo su team empezo a defender este echo, Por eso tengo la duda de cual es mas facil, de jugar y de dominar?","replies":[{"poster":"Danshid","date":"2018-03-24T20:52:28.176+0000","up_votes":1,"down_votes":0,"body":"teemo, sin duda teemo es mas facil de jugar y dominar, porque tu fase de lineas es regalada y en late solo debes poner callampas por tdas partes, ademas de no tener ni un combo\n\nSe nota cuando una riven le saca el maximo potencial a los combos","replies":[]}]}]},{"poster":"Nabuze","date":"2018-03-25T03:01:56.812+0000","up_votes":2,"down_votes":0,"body":"Son diferentes.\n\nMecánicamente teemo no tiene muchas opciones porque sus mecánicas son quedarse invisible, Q una skill target, la W es para ir más rápido, la e es una pasiva y la R siembra el caos.\nMe anicamente más fácil.\n\nRiven tiene 3 Q la tercera salta y puede ser usada para saltar paredes o esquinas lo cual resulta muy difícil mientras las paredes o esquinas son más grandes.\n\nLa W se puede cancelar con la hydra y con la Q haciendo que tengas que tirar un combo de cierta forma que si no lo haces lo cagas prácticamente.\n\nLa E es un escudo para. Dodgear y es la base del cancel de animación de sus habilidades.\n\nLa R modifica el rango de tus habilidades y hace que tengas que conocerlo.\n\nLo que hace más difícil a riven mecánicamente es que tenga muchas más opciones que teemo a la hora de usar sus habilidades.\n\n--------\n\nAhora que el enemigo tuyo te haya dicho que teemo es fácil viene de que estaba ardido por no poder matar al raton demoníaco.\n\nSi el teemo fuera malo basta con que tus tardes contra teemo sean cuando el tira la Q. Tenés que aprovechar a amortiguar el daño de la Q de teemo con la e de riven cuando vez la animación del dardo,  aprovechando que te acercas gastas tus habilidades mientras se va el efecto y tratas de no pasarte de las 3 acumulaciones como para no desaprovechar la pasiva.\nOsea hasta que se te vaya el silencio de teemo podés tirar 3 habilidades e q w, a partir de acá alternas q y básicos para matarlo, si tenés R mejor.\n\nTrata de tener un pink para el lvl 6 así lo pones en medio de la línea para poder tradear en contra del teemo.\n\n----------\n\nResumen: \n\n- Riven es mas difícil mecánicamente que teemo.\n- Tu enemigo era un ardido y un manco por no aceptar sus errores.","replies":[]},{"poster":"TSW Rorschach","date":"2018-03-24T20:05:08.488+0000","up_votes":2,"down_votes":0,"body":"Ah, esas personas que se creen superiores por usar un campeón complicado, incluso sin saber usarlo.\n\nRiven mecánicamente hablando si resultaría más complicada que Teemo. No de usarla (porque burstear al adc con R cualquiera puede), pero si requiere su tiempo para mainearla.\n\nA mi opinión igual, no le veo sentido a echarle la culpa al rival de que no le podés ganar porque use un campeón fácil.","replies":[{"poster":"Tomas83","date":"2018-03-24T20:12:15.572+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HMorskoy,realm=LAS,application-id=xQmJPO8F,discussion-id=gwdYsXhZ,comment-id=0003,timestamp=2018-03-24T20:05:08.488+0000)\n>\n> Ah, esas personas que se creen superiores por usar un campeón complicado, incluso sin saber usarlo.\n> \n> Riven mecánicamente hablando si resultaría más complicada que Teemo. No de usarla (porque burstear al adc con R cualquiera puede), pero si requiere su tiempo para mainearla.\n> \n> A mi opinión igual, no le veo sentido a echarle la culpa al rival de que no le podés ganar porque use un campeón fácil.\n\nOk, gracis por la respuesta. Por los otros comentarios puedo ver que si, teemo es mas facil.","replies":[]}]},{"poster":"WhiteMax","date":"2018-03-24T19:57:04.296+0000","up_votes":1,"down_votes":2,"body":"Teemo es mas facil por la sencilla razon de que su unica mecanica \"dificil\" es saber kitear.","replies":[{"poster":"Tomas83","date":"2018-03-24T20:02:14.563+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=WhiteMax,realm=LAS,application-id=xQmJPO8F,discussion-id=gwdYsXhZ,comment-id=0002,timestamp=2018-03-24T19:57:04.296+0000)\n>\n> Teemo es mas facil por la sencilla razon de que su unica mecanica &quot;dificil&quot; es saber kitear.\n\npero la de riven es apretar q","replies":[]}]},{"poster":"Šeiya","date":"2018-03-24T20:20:02.416+0000","up_votes":3,"down_votes":2,"body":"Con todos los combos, cancelaciones de animación, walljumps, etc, etc. No deberías ni preguntarte quien es mas difícil mecánicamente.\nY aunque le duela a todos los lowelo, Riven es de los campeones mas difíciles de todos en términos de microjuego.\nY creo que mi opinión no podría ser más objetiva, ya que jamás la usé y ni siquiera es un champ que me guste.","replies":[]},{"poster":"Mintrer ","date":"2018-03-25T13:31:15.016+0000","up_votes":1,"down_votes":0,"body":"Yo diria que teemo, de riven nose mucho asi que no sabria decirte de riven pero como otros dicen seguramente riven sea facil o nose :D Pero recomiendo teeemo yo a garen con teemo lo mato antes que vengan los minions\nxD\n","replies":[]},{"poster":"SKT T1 Bank","date":"2018-03-25T11:53:15.472+0000","up_votes":1,"down_votes":0,"body":"Creo que mas dificil seria teemo, con teemo tenes que ser creativo (bah para no ser del mediocre promedio que solo se queda invi como si no supieras que esta ahi...). Lo que tiene teemo es que no es facil hacer impacto glabal con el sin perder tu safezone y tu vida en el proceso, porque basicamente no tenes hp para aguantar un burst.\nSi bien mecanicamente es sencillo, jugarlo bien para lo que es el macro no es taaan facil, pueden no entrar en tu torre, pero tranquilamente pueden rotar y destruirte todo, ademas solo pdoes aprar un enemigo a la vez, y con un pink (que es obligatorio ahora) o un revelador de 250 te anulan tu tacticplay. \n\nEn cambio riven es mecanicamente mas compleja, pero cuando aprendes a hacer clicks, no tiene secreto, es solo entrar hacer tu combo y salir, no tiene otra cosa, algo parecido a renek, que es usar su combo y repetir. Lo que tiene riven es que si puede hacer un snow fuerte, en cambio teemo debe ser creativo como dije para llevar su ventaja al resto del equipo.\nLo que hace a teemo fuerte es lo flexible de su build, y su  capacidad de fetener rotaciones o revelarlas, ser un hinchahue.. como shaco o mao con sus trampas. Fuera de eso mucho mas no tiene. Pero creo que es mas dificil porque lo importante no es matar al otro si no ganar la partida.\n\nSaludos!\n\n**SKT T1 BANK**","replies":[]},{"poster":"L3G1ON","date":"2018-03-24T20:57:40.430+0000","up_votes":1,"down_votes":0,"body":"Yo creo que entrar en su corazón es lo mas dificil </3\n{{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"Sir Crucifix ","date":"2018-03-24T20:29:35.009+0000","up_votes":1,"down_votes":4,"body":"teemo es facil , apretas Q , farmeas a distancia , podes correr , (y le falta un rework ) \n\nriBenguenza es mas complicada porque es un pj cuerpo a cuerpo , algunos te la complican , pero es un burster y tenes que usarla con trueno para que rinda bien","replies":[{"poster":"Tomas83","date":"2018-03-24T20:38:30.374+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sir Crucifix ,realm=LAS,application-id=xQmJPO8F,discussion-id=gwdYsXhZ,comment-id=0008,timestamp=2018-03-24T20:29:35.009+0000)\n>\n> teemo es facil , apretas Q , farmeas a distancia , podes correr , (y le falta un rework ) \n> \n> riBenguenza es mas complicada porque es un pj cuerpo a cuerpo , algunos te la complican , pero es un burster y tenes que usarla con trueno para que rinda bien\n\nTeemo tiene un rango muy pequeño, es facil querer poquear y quedar atrapado en una habilidad como la e de darius y perder media vida por su combo, si te le quedas tradeando probablemente moris, con gnar siempre tiene mas movilidad y alcanze por lo que poquearle puede dar muy malos resultados si fallas al esquivar, hay muchos champs asi que le dificultan a teemo.","replies":[]}]},{"poster":"RGuerreroZ","date":"2018-03-24T20:13:20.541+0000","up_votes":1,"down_votes":0,"body":"es cuestion de criterios, teemo es mecanicas sencillas de aplicacion dificil (por saber donde poner los hongos y que te sirvan a la vez), y riven son \"mecanicas dificiles\" de facil aplicación, a que me refiero, que en si mismo las mecanicas de riven son mas diversas que las de otros campeones pero una vez dominas las bases es facil improvisar con ella","replies":[]},{"poster":"ZeNch","date":"2018-03-24T20:11:16.662+0000","up_votes":1,"down_votes":0,"body":"Riven es dificil y teemo solo es kitear PERO hay un pero...\n\nTeemo tiene INFINITAS BUILDS tengo un amigo main teemo (platino) que lo juega ad/ap/tank... si tank...\nla verdad es que si es dificil saber que hacerte en cada situacion y como se juega cada build.\n\nPero mecanicamente (a nivel manos) es mas dificil riven... igual no hay por que quejarse, cada persona usa el champ que quiere... si hay mas faciles y vos no lo usas es por que consideras que podes sacar mas provecho a otro... y si te quejas luego de eso, quejate de tu decision.\n\nCada campeon tiene un grafico de aprendizaje (mas o menos partidas) muy diferente al de masterizarlo (a nivel real noa  nivel puntos de maestria) cada quien usa a quien quiere, son campeones, son elegibles, si te molesta jugarle ban.\n\nEsa riven al verdad nunca debio escribir nada x el chat.","replies":[]},{"poster":"Little T","date":"2018-03-24T19:49:17.401+0000","up_votes":1,"down_votes":0,"body":"riven es complicada, teemo no tanto... osea, es dar básicos y esperar que se mueran por el veneno e ir por ahí hinchando \n\npero me sorprende que a pesar de ser riven no te gane, se supone que a partir de lvl 6 las cosas deberían darse vuelta xd","replies":[]},{"poster":"Champi4UP","date":"2018-03-24T20:16:21.290+0000","up_votes":1,"down_votes":1,"body":"En el meta actual es más difícil usar a Teemo y que se sienta que hacés algo (carrear) que Riven ya que sigue siendo meta tank y Riven con un CC se le corta todo el combo. \nVamos, cualquier campeón puede burstear al adc, hasta una Soraka.\n\nTeemo como mucho gana el early pero hay que saber ser perseverante en las líneas y pushearlas hasta romper torres o que vaya todo el equipo contrario a pararte, like a Trynda.\n\nRiven en cambio por más que decaiga te la pasás en TF y algo hacés ya que tenés un stun en área y un knockup.\n\nMientras que Teemo en una teamfight mete un dardo al tanque porque no se puede acercar al adc/mid. Así que eso, obligar a tu equipo a jugar 4vs5 te hace la partida más difícil.\n\n¿Mecánicas? Gana Riven, es mover constántemente el cursor hacia donde querés que vaya con la Q o E que a su vez son desplazamientos.","replies":[]}]}