{"poster":"Critterous","date":"2015-02-13T05:37:25.339+0000","title":"Bad connection....","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Okay wtf... i was in a ranked game just then and about 25-30 minutes in i couldnt move... i had 3000 ping... I ran a speedtest but my internet was holding at 30 ping... So that rules out my internet. i dont know if its the server but it was frustrating... watching my team base race at about 1 frame a second as they were teleporting... We won with me standing in the fountain for about 5 minutes.... \r\n\r\nFyi i did reset my client Help?","replies":[{"poster":"HORSE OF FORCE","date":"2015-02-13T06:26:56.571+0000","up_votes":1,"down_votes":0,"body":">I ran a speedtest but my internet was holding at 30 ping... So that rules out my internet.\n\nYou're new here. Cute.\n\nDo you get any red notifications if you do [this test](http://netalyzr.icsi.berkeley.edu/)? Make sure no other applications are running while you do it.","replies":[{"poster":"Critterous","date":"2015-02-14T05:17:56.253+0000","up_votes":1,"down_votes":0,"body":"1. I am not new here... I have been on the oceanic server ever since it opened.\n2. yes no other Applications were open when i ran this test, (This includes my League window)\nAnd still getting these spikes, impossible to play on even on custom matches by myself","replies":[{"poster":"HORSE OF FORCE","date":"2015-02-14T08:06:39.453+0000","up_votes":1,"down_votes":0,"body":"Let me rephrase that: your internet can seem to be perfectly fine with other applications, and you can throw up useless statistics like ping and download speed, but there could still be underlying problems in your connection. Not all ISPs are perfect, and some are renown for their terrible routing.\n\nPlease visit http://netalyzr.icsi.berkeley.edu/ and perform the test. You'll need Java activated. Reply with any messages that appear in red from the analysis. Do not post the entire analysis here.\n\nText that uses a darker font colour on this board means that it's been linked, meaning you can click it and it will take you to a specific site.","replies":[{"poster":"Critterous","date":"2015-02-15T07:52:13.884+0000","up_votes":1,"down_votes":0,"body":"Ahh i see yep, some thing wrong with cables or something im not a techy person... But thanks i will try to fix it","replies":[{"poster":"HORSE OF FORCE","date":"2015-02-15T09:58:00.753+0000","up_votes":1,"down_votes":0,"body":"If that doesn't work, then tell me your OS and ISP. We should be able to discuss it from there.","replies":[]}]}]}]}]}]}