{"poster":"FreecK","date":"2015-06-08T14:23:50.639+0000","title":"Estrategia clásica?","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Cada vez me va molestando m&aacute;s cierta actitud, o no se, la verdad es normal. Todos empezamos jugando sin saber mucho, o al menos la mayor&iacute;a, y por eso nos adaptamos a la forma de jugar que nos dicen los que ya saben, y cu&aacute;l es esta forma?, pues;\r\n\r\n-Tienes que ganar una linea, muy r&aacute;pido( es pr&aacute;cticamente una competencia infantil xD) y escoger un campe&oacute;n de acuerdo al rol y bla bla bla....\r\n\r\n PERO ESO ES INVENCI&Oacute;N DE LOS JUGADORES!, es la estrategia que se ha generalizado, pero el juego no se creo para necesariamente jugar as&iacute;, mi punto... Muchas veces dicen report por autolock, o incluso troll, eso me pesa mucho, y ya me parece injusto(lo importante es apoyar a tu equipo y empujar para la victoria)... Quiz&aacute;s deber&iacute;an inventar un report que se llame &quot;No se adapta a sus compa&ntilde;eros&quot; o &quot;No sigue la corriente&quot;.\r\n A mi parecer, el juego es amplio y se puede jugar de mil formas y eso no es trolear; Imaginen como ser&iacute;a por ejemplo un doble adc en mid ( {{champion:119}} {{champion:22}} para pushear mucho la linea de mayor influencia (por ser la mas corta) , un mago independiente y muy bueno para pushear en bot{{champion:103}} {{champion:101}} {{champion:143}} (para poder contrarrestar a 2 enemigos sin correr riesgo) , un jg y un top. No lo se, no lo se, pero sinceramente me parece de mal gusto que la comunidad pueda sancionarte, te deteste tanto por... Buee, de todas formas igual me gusta esta &quot;estrategia cl&aacute;sica&quot;, pero... No me gusta que te maltraten por a veces querer hacer algo distinto.\r\n\r\nMe gustar&iacute;a saber sus opiniones, saludos!{{item:1063}}","replies":[{"poster":"Neo Gaussrik","date":"2015-06-09T14:16:14.190+0000","up_votes":3,"down_votes":0,"body":"En lo personal, yo siempre apoyo iniciativas extrañas de campeones siempre que el jugador me diga que hay una fundamentacion teorica para ello.\n\nPor ejemplo, recuerdo haber jugado con una support Ashe que me explicaba que la idea era esperar el critico (por su pasiva vieja), entrar, pasar mucho daño subito, y volver a esconderse en el arbusto mientras se carga la pasiva. No se si era la mejor estrategia, pero al menos habia una logica por la que el jugador pensaba que pudiera funcionar.\n\nYo creo que el mayor problema con gente que trata de romper el Meta es cuando se siente que no solo estan haciendo algo extraño (digamos, Azir jg) pero que ademas no saben hacer bien lo que estan intentando hacer (digamos, muere contra el blue).\n\nSaludos!","replies":[{"poster":"Leks","date":"2015-06-09T21:00:48.578+0000","up_votes":1,"down_votes":0,"body":"BREAK THE META {{champion:53}} MID!","replies":[]}]},{"poster":"xFenix7","date":"2015-06-08T15:36:02.309+0000","up_votes":3,"down_votes":0,"body":"En casos de que quieras hacer cosas \"new meta\" te sugiero que le avises (con mucha antelación) a tu equipo y que estén conscientes de que podrías ser un inútil para ellos, si no aceptan entonces o te sales de la sala o ve con un campeón que si sea aceptado socialmente en el rol que juegues.\nSalu-2!","replies":[]},{"poster":"ZanahoriaAsesina","date":"2015-06-08T19:58:31.231+0000","up_votes":3,"down_votes":1,"body":"Hay varias razones de porque los roles que están se respetan y se toma como tabú salir de esos roles por ejemplo:\n\nJungla: Cumple la función de meter presión en el mapa (ya que el enemigo desconoce cuando y donde va a aparecer si no se tiene visión) y controlar objetivos (Barón/Dragón).\nObviamente también están los \"ganks\" que si son exitosos sirven para dar una ventaja durante la fase de lineas o para poder \"echar\" al enemigo del carril denegandole experiencia y oro.\n\nSoporte:El papel del soporte es, fundamentalmente, hacer que tu equipo resista mas, y darle ventaja cuando tu estas ahí.\n\nLos soportes suelen tener habilidades beneficiosas, como curas, aumentos de velocidad, escudos, etc... generalmente Buffos para el equipo, aunque no todos tienen curas, pero si Aturdimientos y demás.\n\nSu función es apoyar constantemente al equipo, ayudar a los otros a conseguir muertes, y estar siempre detrás del tanque.\n\nPor lo general, los soportes NO Farmean, ya que si lo hacen, nuestro Adc no obtendría el Oro que necesita en el Early Game(Fase temprana del juego), a menos de que uses un objeto llamado \"Escudo Reliquia\" y solo des el ultimo golpe a los Súbditos únicamente cuando tengas las cargas de este objeto.\n\nADC/MID: Generalmente son los que tratan de llegar a tener los primeros items y ser los \"carrean\"  al equipo con su daño, ya que tienen la ventaja del oro y la experiencia. (más aun para el mid)\n\nTOP: El papel del Top es, fundamentalmente, resistir todo el daño, para que su equipo lo haga al contrario.\nLos tanques suelen tener habilidades de apoyo contra el otro equipo, como escudos, provocar, aturdimientos, etc... que harán nuestro combate mas fácil.\n\nEn mi opinión las cosas están como están porque es la forma donde se explota de mejor manera el juego con cada rol.\n\nSaludos!\n\nPD: Algunos de los párrafos son recopilaciones de otros usuarios del foro antiguo, ya que, buscando un poquito se encuentra todo ^^","replies":[]},{"poster":"Lucrexio","date":"2015-06-08T17:29:41.790+0000","up_votes":1,"down_votes":0,"body":"Lo que pasa es que el Meta, a pesar de que sea \"inventado por los jugadores\", es una estrategia necesaria de tener todos los roles en el equipo, y de por si lógica, es decir, no te puede faltar el mago, o el DPS de los tiradores, o un asesino en la jungla y un tanque en top, o un soporte. Es decir, el LoL terminó evolucionando a favor de esta meta, visto ya con los objetos.\nMiralo al Heroes of the Storm, son como el sol y la luna, totalmente distintos, pero porque el juego los diseño para que sean así, el problema que tiene el LoL es que el meta está muy sujeto a cambiarse por cualquier jugador \"vanguardista\" que le vaya bien en tal partida, como recuerdo que pasó con Soraka cuando antes del rework la usaban en top.\nEn HotS, no existe tal problema porque ya arman las partidas con héroes preseleccionados, con un énfasis en beneficios al equipo en general con solamente la ganancia de experiencia y los rasgos, y que no hay objetos que cambien a tal héroe.\n\nLo que pasa es que se usan ciertos champs en ciertas líneas CONTRA ciertos campeones que sí están diseñados para llevar a cabo ese rol, por ejemplo Nidalee en la jungla, a simple vista no la vez como un campeón de jungla, pero tiene su lógica de que se beneficia de hacer counter-jungla al enemigo, pero, teniendo en cuenta que los objetos y demás benefician a campeones tanques ahora, es un locura pickiar una Nidalee, sabiendo que del otro lado puede estar por ejemplo una Sejuani, le partiría el traste en la jungla.\n\nMi opinión es que hay una diferencia entre hacer picks \"patéticos\", y hacer picks que pueden llegar a ser \"decentemente competitivos\", bla bla bla xD","replies":[{"poster":"MaestraDelEtwahl","date":"2015-06-09T18:24:06.426+0000","up_votes":1,"down_votes":0,"body":"\"no te puede faltar el mago, o el DPS de los tiradores, o un asesino en la jungla y un tanque en top, o un soporte.\" Si te fijas hay muchos equipos donde falta el mago. \n\nEse enfoque es muy pobre, si te fijas hay campeones que depende como los buildees y/o lo uses (no me refiero a nivel sino a modalidad) cambia su rol completamente. Un ejemplo seria vladimir... puede ser considerado el mago ap o tambien el tanke del equipo, y con la misma build pero cambiando la forma de jugarlo.\n\nEl pick raro ayuda mucho por la gente que está encerrada en el meta... te sorprenderia ver la cantidad de adcs que ragean porque no pueden contra el daño de un urgot.","replies":[]},{"poster":"rokushoger","date":"2015-06-08T18:26:00.630+0000","up_votes":1,"down_votes":0,"body":"Exactamente, opino lo mismo, está bien ir anti meta pero con un plan bien pensado, no solo ir por capricho y porque me creo heavy y rebelde.","replies":[]}]},{"poster":"ZorroDorado","date":"2015-06-09T14:47:47.467+0000","up_votes":1,"down_votes":0,"body":"Lo mismo hice ayer. Me encanta jugar con Gnar (Desde que lo compré) y siempre lo use en top armándome como tanque, pero quise probar algo nuevo: Pedí Mid y me arme Gnar AP... Les explique a mis compañeros que la habilidad W es 100% AP Y a decir verdad saca mucho daño. Entonces porque no explotar ese potencial con velocidad de ataque y poder de habilidad? Lo hice y a la primera partida no resulto, me insultaron, reportaron, etc. A la segunda partida ganamos y me felicitaron; La gente es extraña... Je","replies":[]},{"poster":"X1sp1N","date":"2015-06-09T14:29:53.219+0000","up_votes":1,"down_votes":0,"body":"Es el meta que te imponen a jugar por que es el que mas renta los que decidieron ir contra ese \"meta\" simplemente lo sacaron, ahora ultimo con el top con smite era free elo y que paso lo nerfearon. El singed proxifarm que paso? lo nerfearon . El tryndamere ap un tipo subio solo 4 divisiones solo con  trynda ap y que paso? lo nerfearon lamentablemente. El machete escaramuza cuando salio sino me equivoco te daba 4 golpes con true damage estaba roto lo nerfearon por ww one shot y asi si encuentras una manera como las que te mencione aprovechala sal del elo hell antes que la saquen del meta xd","replies":[]},{"poster":"FreecK","date":"2015-06-08T23:21:54.587+0000","up_votes":1,"down_votes":0,"body":"Entieendo lo que dicen, el juego se desarrollo, evoluciono de la mejor manera posible. Aunque está claro que el \"meta\" o lo que sea sigue cambiando, antes no se veían taaantos gragas jungleros y cosas así. Demás que se podría hacer algo inteligente, innovador","replies":[]},{"poster":"Axitas Alexis 99","date":"2015-06-08T20:36:44.899+0000","up_votes":1,"down_votes":0,"body":"Deberias armar un team ranked diciendoles a tus amigos/compañeros que tu intencion como capitan es probar nuevas cosas,  el problema es en que esas personas deben ser muy abiertas de mente, si te falta 1 agregame que estare muy contento de jugar de un modo \"anti meta\"","replies":[]},{"poster":"Funes7","date":"2015-06-08T18:05:31.471+0000","up_votes":1,"down_votes":0,"body":"nunca nadie se le ocurrio hacer un solo top duo mid y duo bot. Sin jungla.\n\nTeniendo 2 supports que no ocupen farm. Y ayuden en el 1vs2 y a la vez a hacer objetivos.\n\nTranquilamente se me ocurre un blizts supp y un tresh supp al mismo tiempo.\n\nY con el top con smite. para hacer sapo o rocosos y ayudar asi en los objetivos..","replies":[{"poster":"rokushoger","date":"2015-06-08T18:24:12.213+0000","up_votes":1,"down_votes":0,"body":"Pero ahí dejás todo el oro y experiencia, sin mencionar los puntos ciegos de la jungla al jungla enemigo, le abrís campo de gankeo, le das más buff, en fin, demasaidas desventajas. Sin mencionar que donde en mid te elijan un mago que pueda farmear de bien lejos te va a ganar porque va a subir de nivel más rápido.","replies":[]}]},{"poster":"rokushoger","date":"2015-06-08T18:22:35.946+0000","up_votes":1,"down_votes":0,"body":"Justo los casos que decís no son nada viables, porque en mid un mago te detona a los dos adc en early sin acercarse, mientras que estos no ganan el suficiente oro para ser útiles y quedan encima en menos nivel, mientras que en bot el mago las va a pasar canutas contra el cc que te tira el support y el posterior poke sin posibilidad de contragolpe del adc.\nIgual entiendo que no debieran insultar solo porque no sigas el meta, pero tampoco estoy tan de acuerdo en condicionar a todo un equipo a una forma de jugar que no está probado que sea eficiente, y solo porque tenés ganas de cambiar me explico? Yo creo que lo más correcto es avisar y si están de acuerdo dale para adelante, y sino bueno, seguís con algo clásico.","replies":[]},{"poster":"Fenderwenger","date":"2015-06-08T18:11:35.195+0000","up_votes":1,"down_votes":0,"body":"Yo creo que la estrategia se fue \"depurando\" hasta llegar a lo que es hoy.\nEstoy de acuerdo con la disposicion de roles en lanes, adc flan pero con daño cuidado por el supp, top tanque o con late algo en lane alejada y un mid que en lo posible tiene que ser asesino para burstear y tener la torre cerca ya que es squishy y tiene el back rapido en mid.\nPorque no dos adc en mid? Cual de los 2 farmea? Los dos y tenes dos champs medio pelo en late? Yo creo que es una evolucion en la forma de jugar la que nos hace elegir otras cosas, entiendo al vanguardista que quiere cambiar las cosas, pero todo tiene su limite, no podes ir a un partido de futbol poniendo 7 delanteros porque vas a meter mas goles, pero te van a hacer 15 por partido y a la larga termina no sirviendo.\n\nSlds-","replies":[]},{"poster":"Mulfer","date":"2015-06-08T15:33:05.162+0000","up_votes":1,"down_votes":0,"body":"Jaja Las estrategias se amoldan acorde avanza la partida y los items ademas del pj escocido es según los enemigos, ahora por lo de las lineas es según el plan de ataque del equipo, a mi me a tocado jugar contra 5 en mid o los 5 cazando a todos... En fin es cosa de gustos pero obviamente a un mago no le sirve FILO INFINITO jajaja... Y esas personas que viven con el botón en REPORT son las que mas molestan en el equipo ya que me ha tocado también ver eso y me molesta bastante. Yo por lo menos me entretengo y si puedo ayudar a equipar a alguien mejor por que se arma con mas facilidad las estrategias conociendo el equipamiento del otro.\nPero bueno tu juega y ayuda si puedes por que todos devén asistir al compañero, LA MEJOR ESTRATEGIA creo yo XD {{champion:2}}","replies":[]},{"poster":"Rainbow Quartz","date":"2015-06-08T14:39:37.109+0000","up_votes":1,"down_votes":0,"body":"A ver... la disposición de las líneas es así por cuestiones en particular. Van dos en bot para mayor control en dragón, hay un carry con un support para así sacar la mayor cantidad de oro posible y que el carry pueda comprar items. Va con un support porque el carry suele ser muy blando y además el sup es el que debería controlar con el jungla la zona de dragon. El top es el que está más alejado, es una línea muy larga y con posibilidades de gank, por lo que suelen ir champs con movilidad o tanques para bancarse eso. Todo existe por una razón, no es que Riot dispuso el órden de las líneas ni mucho menos. Más allá de eso, es genial que se varíe y se hagan cosas nuevas, nunca sabés qué puede funcionar y qué no, así que mientras no jodas la composición de tu team te banco :)","replies":[]},{"poster":"Eldrazi3","date":"2015-06-08T20:07:55.574+0000","up_votes":0,"down_votes":0,"body":"Yo solia ir gangplank y ashe support en ranked y andaba bien. Eso en LAS es anti-meta pero mucho despues me entere que en el servidor koreano era algo común para support. Lo mejor es probar en normales y despues pasar a ranked. Tené en cuenta con quien estas jugando y en que liga, tené en cuenta que la moral en ranked y elos bajos (digamos plat5 para abajo) esta muy dañada es decir para los jugadores hay ciertas cosas que son sinonimos de perder, como por ejemplo fedear afk o anti-meta y por eso vas a ser victima de insultos entre otras cosas.","replies":[]}]}