{"poster":"FakeLvL7Icon","date":"2018-08-11T23:15:19.882+0000","title":"Ich möchte besser werden , brauche Tipps !","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Sch&ouml;nen Abend .\n\n\nVorerst m&ouml;chte ich mich Entschuldigen wenn ich es in die Falsche Diskussion reingeschrieben werde .\n\nIch br&auml;uchte Hifle da ich fast jedes Game nur noch verliere und deswegen wenigere Kapseln grieg ! \n\n\n\nNun mein Proplem ist ich will in LoL besser werde aber auch gerne Tipps will .\n\nIch wei&szlig; noch nicht was meine Main Lane Soeben auch nicht mein Main Champ kenne . \n\nIch hab viele Champs auspropiert und hab nie den richtigen gefunden. \n\n\nIch bin froh auf viele Tipps , und hoffe das ich nicht gehatet werde ! \n\nLG-Euer Minito/AvaterRM\n\n{{sticker:poppy-wink}}","replies":[{"poster":"Crewmember Olaf","date":"2018-08-11T23:58:59.465+0000","up_votes":5,"down_votes":0,"body":"* Probiere viele Champions aus, halte dich aber erstmal an die Leichten\n* Gewöhne dir **schnellstmöglich** an alle 5 Sekunden auf die Karte zu sehen\n* Jedes mal wenn du stirbst solltest du überlegen warum und worauf  **DU**  achten musst um den Fehler nicht wieder machen\n* Ignoriere voll und ganz die Fehler anderer. Du sollst besser werden, nicht deine Mitspieler\n* Deaktiviere den ALL-Chat (Esc -> Interface -> ganz unten) \n((dieser Tipp ist besser als du vllt Anfangs annimmst))\n* Trink genug Wasser und steh zwischen den Spielen immer mal ein paar Minuten auf.\nDas verringert Müdigkeit und steigert deine Wachsamkeit\n* Geb dir Mühe und denke nach.\nWenn die selben Fehler immer wieder passieren musst du was ändern\n\nViel glück beim besser werden\nAm hilfreichsten ist es nur dann zu  Spielen wenn man Spaß hat. Es müssen auch nicht immer Ranglistenspiele sein wenn dich der Druck zu sehr stresst","replies":[{"poster":"NamiCurry","date":"2018-08-12T09:27:24.852+0000","up_votes":1,"down_votes":0,"body":"Der All-Chat ist sogar standardmäßig deaktiviert.","replies":[{"poster":"Angel Ayume","date":"2018-08-12T12:33:30.415+0000","up_votes":2,"down_votes":0,"body":"Du meinst standartmäßig deaktiviert. ;)","replies":[]}]}]},{"poster":"Angel Ayume","date":"2018-08-12T00:15:20.082+0000","up_votes":3,"down_votes":0,"body":"Um deine Main Lane und einen Champ zu finden, musst du halt wissen, woran du ansich Spaß hast. \n\n* Willst du lieber viel aushalten und vorne in der Front stehen und mehr der Unterstützer deiner DD sein? Dann ist Tank/Support-Tank eine Lösung.\n* Gehst du gerne rein und oneshottest einen Gegner aus dem Leben? Dann sind Assassins die Lösung.\n* Oder stehst du eher auf kontinuierlichen Schaden durch Spells? Dann sind Kontroll-Mages die Idee.\n* Oder doch eher der, der hinten steht und durch AA seinen Dmg drückt und im Late völlig ausrastet? Dann ist Adc das was du spielen solltest.\n* Oder doch eher der, der zwar tanky ist aber dennoch Dmg machen kann? Dann solltest du dich Bruiser-Champs widmen, a la Darius. \n* Oder willst du dein Team unterstützen und der sein, der dafür sorgt, dass dein Team die Kills bekommt und selber eher hinten ansteht? Dann sind Supporter eher deine Wahl. Wobei es hier auch Dmg-Supporter gibt, wie Zyra oder Pyke. \n\nGibt halt unglaublich viel, was man spielen könnte und vorallem wie. Wichtig ist erstmal herauszufinden, welche Lane du bevorzugst anhand dem, was dir Spaß macht. ^^ Dann könnte man mit Tipps anfangen. Natürlich könnte man dir auch allgemeine Tipps geben, wie Mapawarness, besseres warden etc. aber um im Ranked aufzusteigen, sollte man sich schon auf eine Lane und max. 3 Champs pro Lane festlegen, für den Anfang und dort dann anfangen sich zu verbessern und sich speziell für die Lane Tipps zu holen. \n\nAllgemein ist immer wichtig, dass du regelmäßig, am besten alle 2-3 Sekunden auf die Map schaust.\nVision ist sehr wichtig, schaue also, dass du immer einen Pinkward stehen hast oder zumindest einen im Inventar, nutze auch deine Standardwards. Da Gold sehr wichtig ist, solltest du, falls du ein Laner bist, so viele Minions lasthitten wie möglich. Falls du damit Probleme hast, übe es im Custom-Modus. Auch nach der Laningphase solltest du das Farming nicht vernachlässigen. \n\nAls Jungler solltest du immer wissen, was auf deinen Lanes so vor sich geht, schaue also regelmäßig dort mit der Kamera vorbei. Willst du ganken, dann achte sowohl auf das Leben als auch die Mana deines Mates. Du solltest nicht traden, wenn dieser low ist und kein Mana zum kämpfen zur Verfügung hat, wenn du dir nicht sicher bist, dass du das alleine schaffst. \n\nUnd was auch besonders wichtig ist. Flame NICHT. Und lass dich nicht von Mates tilten. Sei tolerant gegenüber Fehler deiner Teamkameraden. Du darfst dir Fehler erlauben, also dürfen sie das auch. Niemand ist perfekt, jeder macht irgendwo Fehler oder hat einen schlechten Tag/schlechtes Game. Ärger dich also nicht, wenn der Adc 0/3 steht, die Midlane den gegnerischen Assassine feedet, oder der Jungler lieber ein Camp macht, anstatt nach einem erfolgreichen Gank den free Drake zu machen. :)\nSollte ein Mate flamen, dann mute ihn sofort und gehe nicht im Chat drauf ein. \n\nSo, ich denke das sollte erstmal reichen für den Anfang. xDD","replies":[{"poster":"Noxempire","date":"2018-08-12T10:20:59.333+0000","up_votes":1,"down_votes":0,"body":">Um deine Main Lane und einen Champ zu finden, musst du halt wissen, woran du ansich Spaß hast.\n>\n\n\"Wollt ihr euch schützen, oder Schaden austeilen?\"","replies":[]},{"poster":"AI Marko","date":"2018-08-12T06:02:10.432+0000","up_votes":1,"down_votes":0,"body":"Oder einfach wie ich sei allrounder spiel die champ auf die du gerade lust hast.\n\nWichtig nie tilten, andere flamen oder auf andere mehr achten als auf dich selbst :D\n\n(okey auf den account habe ich ein bisschen mehr ahri/mid gespielt als anderes aber auf meinen smurf sind eig alle lane gleich verteilt)","replies":[{"poster":"Angel Ayume","date":"2018-08-12T08:18:25.514+0000","up_votes":1,"down_votes":0,"body":"Ja, Allrounder geht natürlich auch. Aber ich behaupte mal, dass es als Allrounder wesentlich schwieriger ist zu climben. Man beherrscht zwar irgendwo jede Lane und auch da Champions, aber nie so gut wie ein Main der diese Lane immer spielt. \n\nDa der TE sagt er will sich verbessern, interpretiere ich mal, dass er auch im Ranked aufsteigen will. Warum es ihm also unnötig schwerer machen. :D\n\nAber natürlich kann er auch Allrounder werden, wenn er das möchte.","replies":[]}]}]},{"poster":"Jar Jar Jînx","date":"2018-08-13T12:29:01.476+0000","up_votes":1,"down_votes":0,"body":"..Ich empfehle Jinx. \n{{sticker:sg-jinx}}","replies":[]}]}