{"poster":"Troll LoLoLoLoL","date":"2019-09-26T05:25:55.004+0000","title":"Why da fuk did I get a 14 day ban right off the bat. I thought I got a chat restriction first.","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"Like the title says. I got a 14 day ban. No chat restriction first, no nothing. Ok I had a bad game. I didn't play to my best.\r\n\r\nBut everyone has one of those games. Does everyone get a 14 day ban after a bad game?\r\n\r\nLike WTF.","replies":[{"poster":"Ninox","date":"2019-09-26T06:07:32.996+0000","up_votes":1,"down_votes":0,"body":">[WHY DID I SKIP RESTRICTIONS?](https://support.riotgames.com/hc/en-us/articles/207489286-Instant-Feedback-System-FAQ-#h1q4)\n\n>We have a zero-tolerance policy for extreme negative behavior as well as extremely offensive language and remarks made in game towards other players. Since it is a severe disregard for the Summoner’s Code this sort of behavior can result in skipping to a Two week or Permanent suspension. Suspensions of this degree based on negative behavior will not likely be reduced or removed.\n\nThis policy includes (but isn't limited to) things like suicide encouragement (kys and that ilk) and hate speech (racism, sexism, homophobia, etc).\n\nIf you'd like more specific context then you can post your chat logs for community review, but chances are that's what's happened.","replies":[{"poster":"Troll LoLoLoLoL","date":"2019-09-26T08:13:44.116+0000","up_votes":2,"down_votes":1,"body":"LOL I certainly didn't do any suicide encouragement, or hate speech.\n\nThis community is very toxic, and reports people for no reason at all. If you have a bad game, everyone is like \"report\" \"report\" \"report\"\n\nGet 3 reports, no matter what happened, you get a punishment.","replies":[{"poster":"Ninox","date":"2019-09-26T12:24:54.408+0000","up_votes":2,"down_votes":0,"body":"There are other behaviours which can result in escalation, those I mentioned are essentially the prime examples and what most people experiencing escalation (for a chat punishment) have run afoul of.\n\nQuantity of reports does not have that kind of impact.\n\nOnly one report is necessary to trigger a review for the reported behaviour, and any extra reports have basically no impact beyond providing context for manual reviews. The system is also very good at filtering out false reports.\n\nThe false-positive rate for punishments/escalations is very low, but not non-existent (because that would be impossible). If you feel you were unduly escalated, you can appeal for a reduction through player support: https://support.riotgames.com/hc/en-us/requests/new\n\nPlayer support can also offer you more context on your punishment. \n\nWithout further context here (i.e the actual logs), that is the best information we can offer.","replies":[]}]}]},{"poster":"Project Xayah","date":"2019-09-26T06:28:05.594+0000","up_votes":1,"down_votes":0,"body":"It can depend on *why* you got punished. Chat restrictions only apply to chat-related offences, and as such you wont get a chat restriction for something like griefing or 3rd party software (for example). If the ban was issued for a chat-related offence, then it may be a result of using zero-tolerance language (as Seras mentioned). Without more context, we can't give you any definitive answers.\n\nYou can feel free to submit a ticket to [Support](https://support.riotgames.com/hc/en-us/requests/new) (use the \"Discuss a personal suspension or restriction\" option) if you want to appeal the ban and/or get more context.","replies":[{"poster":"Troll LoLoLoLoL","date":"2019-09-26T08:18:36.519+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=HeartVine,realm=OCE,application-id=T8eq2lFQ,discussion-id=64GHjTUN,comment-id=0001,timestamp=2019-09-26T06:28:05.594+0000)\n>\n> It can depend on *why* you got punished. Chat restrictions only apply to chat-related offences, and as such you wont get a chat restriction for something like griefing or 3rd party software (for example). If the ban was issued for a chat-related offence, then it may be a result of using zero-tolerance language (as Seras mentioned). Without more context, we can't give you any definitive answers.\n> \n> You can feel free to submit a ticket to [Support](https://support.riotgames.com/hc/en-us/requests/new) (use the \"Discuss a personal suspension or restriction\" option) if you want to appeal the ban and/or get more context.\n\nYeah I once got an account perma banned, because I asked the team to report a toxic player during the match. I didn't realize just asking to report someone was bannabable . \n\nIt seems LOL players at way too happy on the report button.\n\nThis time I have copped a 14 day ban for no reason.","replies":[{"poster":"DarkShade918","date":"2019-09-26T23:54:34.064+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Troll LoLoLoLoL,realm=OCE,application-id=T8eq2lFQ,discussion-id=64GHjTUN,comment-id=00010000,timestamp=2019-09-26T08:18:36.519+0000)\n\n> This time I have copped a 14 day ban for no reason.\n\nPost chat logs","replies":[{"poster":"JasonWazza","date":"2019-09-27T02:33:03.783+0000","up_votes":1,"down_votes":2,"body":"You don't always get them.","replies":[]}]},{"poster":"delete this","date":"2019-10-01T04:47:19.189+0000","up_votes":1,"down_votes":1,"body":"Sure it's prejudice but judging by your name, you earned it.","replies":[]}]}]}]}