{"poster":"AceInYourHole","date":"2017-05-15T22:46:49.107+0000","title":"Riot's penalty system","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"This is in regards to the afk system. I think it needs some serious reworking and tuning. I think it needs to be able to detect client issues apart from disconnect issues. I just got penalized for a remake when I was trying to load the game and it wouldn't even get the loading screen. The game would freeze and do nothing. I tried re opening and still nothing. I dont think its right to make someone lose 20LP over a client issue. Everything else on my computer was working fine. It was literally just League. Now I have to win 2 matches. And the match i won beforehand now meant nothing. This is a serious issue that needs to be addressed. Especially with the buggy new client.","replies":[{"poster":"Broporo","date":"2017-05-15T23:28:22.163+0000","up_votes":1,"down_votes":0,"body":"While it may seem unfair that you never even made it into the match and still got punished, but your teammates still had to play without a 5th member which probably made the match incredibly difficult for them.\n\nWhen you couldn't get into the loading screen, it's most likely due to your network not being able to make that initial connection to the game server you were going to be playing on. I don't want you to get punished again for a game you didn't intentionally leave, so let's check up on your [**network settings**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to make sure everything is configured in the best way for League!","replies":[{"poster":"xXDaBoozeXx","date":"2017-05-16T00:40:44.406+0000","up_votes":1,"down_votes":0,"body":"Hey @BroPro about the punishment system, was it ever considered for some sort of compensation for people who deal with teamates afking in ranked and loose lp because of it, or a more harsh punishment for leaving in ranked?","replies":[{"poster":"Broporo","date":"2017-05-16T01:17:44.863+0000","up_votes":1,"down_votes":0,"body":"Hmmmmm I'm not really sure what they've got in the works for the future. I'll do my best to pass that suggestion along, but you can also get more visibility for ideas like this over in Player Behavior!","replies":[]}]},{"poster":"AceInYourHole","date":"2017-05-15T23:40:54.717+0000","up_votes":1,"down_votes":1,"body":"Like I said, my network was fine. I was opening the internet and could use anything else. It was only league freezing. And the whole lobby screen loaded fine. It's not like this is common, however what is common is my game will crash before the loading screen. But usually just pressing reconnect solves the issue. This bug I've never experienced however. I even had 3 2 remakes after this match. Doesn't seem like coincidence to me. How can a match be incredibly difficult if it's ended in 3 minutes? Regardless of everything there is far too many problems still with the client that need to be resolved. I have been using it since Alpha. Another big issue I have is my sound goes in and out so I'm forced to just mute the client.","replies":[]}]}]}