{"poster":"Sparrowday","date":"2015-09-14T15:37:46.739+0000","title":"Riot scorretta","subforum":"Discussioni generali","up_votes":2,"down_votes":13,"body":"Non trovo giusto che a causa di un problema di connessione che ha il mio computer io debba essere messo in una coda a bassa priorit&agrave; di ben 20 minuti. Giocateci panzoni nerd a questo giochino spendeteci pure i soldi per le skins e le rune, ma fate comunque schifo come persone, basta flame basta tutto. Questo gioco fa schifo per la comunity, no questo gioco fa schifo per colpa della riot. Che lascia in mano ai giocatori la possibilit&agrave; di insultare e lamentarsi degli altri giocatori. E la riot come un genitore che ama viziare i propri figli li accontenta, annientando altri giocatori che vogliono solo divertirsi. Perch&eacute; allora vorrei che la riot aprisse un altra landa per giocatori che vogliono divertirsi e non ammazzarsi a vicenda perch&eacute; a qualche povero sfortunato &egrave; saltata la corrente in casa oppure sta insegnando ad un amico a giocare insieme. Perchi&ograve; Riot ti prego di ascoltare questa richiesta, io da videogiocatore banale e mediocre nonch&eacute; insulso ti chiedo di viziarmi e di creare nella prossima patch una landa in cui ci si pu&ograve; divertire senza che entri in funzione il tribunale, che punisce sempre le persone sbagliate.\r\nGrazie","replies":[{"poster":"Sìrjohn","date":"2015-09-14T15:51:03.481+0000","up_votes":5,"down_votes":0,"body":"> Non trovo giusto che a causa di un problema di connessione che ha il mio computer io debba essere messo in una coda a bassa priorità di ben 20 minuti\n\nQuindi il problema è tuo e la Riot te lo deve risolvere?","replies":[]},{"poster":"Sorcio84","date":"2015-09-14T18:57:10.662+0000","up_votes":2,"down_votes":0,"body":"> Non trovo giusto che a causa di un problema di connessione che ha il mio computer io debba essere messo in una coda a bassa priorità di ben 20 minuti\n\nsistema automatico senza sentimenti e che non capisce l'ironia {{champion:53}} {{champion:61}} che non distingue tra problema tecnico e afk volontario.\n\n> Giocateci panzoni nerd a questo giochino spendeteci pure i soldi per le skins\n\navendo raggiunto quota 90kg posso attivare il cuore di {{item:3083}} . era ora.\nUn mio amico ha omega {{champion:17}} , direi che per questa stagione sono a posto\n\n>  Che lascia in mano ai giocatori la possibilità di insultare e lamentarsi degli altri giocatori.\n\nbeh di sicuro questo post non è una lamentela... veeeerooooo ?\n ('  w ')\n\n> un altra landa per giocatori che vogliono divertirsi e non ammazzarsi\n\ncattura bandiera coi support WoW e niente pentakill\n\n> perché a qualche povero sfortunato è saltata la corrente in casa\n\nsalta la corrente in continuazione ogni volta che giochi a LoL\nstrane coincidenze...\n\n>  landa in cui ci si può divertire senza che entri in funzione il tribunale, che punisce sempre le persone \n\npartita personalizzata ?\nps : il tribunale al momento è chiuso","replies":[]},{"poster":"BrattishSolid6","date":"2015-09-14T19:30:08.512+0000","up_votes":1,"down_votes":0,"body":"La coda la mettono dopo 4/5/6 volte che abbandoni delle partite nel giro di 2/3 giorni. La prima punizione sono 5 partite di coda a bassa priorità di 5 minuti. Poi da 10. Poi da 20. Ergo, o hai davvero TANTI problemi a livello elettrico in casa, o non è la prima partita che abbandoni, o qualcuno ti sta rosicchiando i fili {{champion:29}}","replies":[]},{"poster":"UlmoMakesMeWet","date":"2015-09-14T15:48:57.558+0000","up_votes":1,"down_votes":0,"body":"1. come faresti a dividere gli onesti dai non?\n2. se per un tuo problema fai perdere delle persone è giusto che tu venga messo in coda","replies":[]}]}