{"poster":"Ham the Rabbit","date":"2019-01-07T08:32:04.677+0000","title":"why not Elo job","subforum":"Player Behaviour","up_votes":0,"down_votes":5,"body":"im not the type of a guy who uses Elo job, but I saw someone using it, and he question me somethings I couldn&#039;t say he was wrong, Elo job is just another kind of people getting money from this thing they are good on it.. secondly, if you are playing because some one is helping you to increase you play, why not? think about gym and working out, you start paying to go to gym, then you think you need help with the equipment (like champions, micro game) so you hire a personal instructor, then you realise that you don&#039;t have a good diet for your objectives (macro game) so you hire a nutritionist, after years using them to get the body you are looking for, you start looking for the &quot;illegal&quot; things that lots of sports go which are the anabolizants, DO NOT TAKE ME WRONG, THIS IS ILLIGAL AND NEEDS TO BE LIKE THAT, but lots of of people do it to get the perfect body and better in their on sport, they pay for it, with professionals taking care go them (just like using hacks) then you&#039;ll need to stop and keep going with your training, everything happens in almost all sports, in case you become a professional and get busted on it, you are out for using illegal methods, but the ones that want to pay for increasing their account, they will not become a professional.. so why in lol elojob is legal.. since at the same time we (players) always find people going for surf accounts and those accounts don&#039;t get banned, im not the one using Elo jobs, im silver IV to silver III, but my friend asked told me those things, he is a MMA fighter, thats why he used those examples.. just curiosity .. Thanks #OldFioraForever","replies":[{"poster":"TheDemonEmperor","date":"2019-01-07T10:57:36.959+0000","up_votes":7,"down_votes":0,"body":"Let me shatter the theory to pieces in just a few words. \n\nGym is training for a healthy body. Elo boost is like cheating on an exam, to get into a course that is beyond your intellectual capability.\n\nYour friend's example is pretty shallow.","replies":[]},{"poster":"Hideinplainsight","date":"2019-01-09T11:40:49.757+0000","up_votes":1,"down_votes":0,"body":"If you're referring to being boosted then what exactly are you going to learn from it? Sure, your mate plays the account - you get into a high rank by being boosted from his performance and then he lets you be. You then realize your current skill-level is not of that a person deemed fit for that rank so then you start demoting and declining back them into the ever-unavoidable abyss of bronze.\n\nPlay the game yourself and just enjoy it or don't play it at all. And just as TheDemonEmperor stated; the example you have given is nothing close to similar. Working out at the gym and such even with a personal trainer or the use of 'illegal' things doesn't happen without effort being put in by you. You can't just take the 'illegal' things and then expect your muscles to just grow. You put in the time and effort to better yourself mentally and physically because you actually NEED to put in alot of work and then you'll be learning along the way where-as boosting is just another person doing all the work for you. Sure if the personal trainer took control of your body, fair enough but it doesn't work like that.","replies":[]}]}