{"poster":"kecskeharcos100","date":"2019-12-14T20:30:45.156+0000","title":"Hőskoncepció - Kronkech, Ixtal Nagyszelleme","up_votes":2,"down_votes":0,"body":"Üdv emberek!\n\nEgy általam kreált hős ötletét osztanám meg, remélem elnyeri tetszéseteket!\n\n**Alapkoncepció:** Egy láthatatlan tank volt a cél összességében. Olyan élharcos, aki rendkívül gyorsan, hirtelen és sokoldalúan tud harcot kezdeményezni, ám ezek után cserébe nincs meg benne az a mérhetetlen tömegirányítás-lánc, mint más tankokban, vagy a harcosok nyers sebzése. Megvannak a maga egyedi eszközei a túlélésre, és némileg a csapat védelmezésére is, de összességében egy térképet járó hős, aki a pillanatnyi zavarodottság erejével robbant elő csapatharcokat a semmiből.\n\n**Háttértörténet:**\nKronkech már az ősidők óta létező, nagyhatalmú, természetfeletti létállapotban \"élő\" elementál, Ixtal népe, mindig is a Nagyszellemeként tisztelte.  Annak idején Ixtal papjai és sámánjai, viszont meg akarták érteni az entitás rejtélyes énjét, ezáltal mélyebb betekintést nyerve a világ működésébe is,  másrészt hatalmukat is bizonyítani szerették volna népük előtt, így az volt a tervük, hogy valahogy a fizikai lét síkjára idézik Kronkechet, hogy majd ő elmondja nekik az egyetemes Igazságot. Értették a dolgukat, így a szellemet egy négy természeti elemből álló gólem, egy Őrző Elementál testében keltették evilági életre.  Jószándékú léleknek bizonyult, mind népét, mind a természetet segítette, de sokkalinkább kiváncsiságból maradt velük. Mivel nem értette, foglalkoztatta a fizikai síkon zajló élet, különösen a leginkább emberi lényekre jellemző öntudat.  Ugyan emberek varázslata által elevenült meg, teljesen szabad akarattal, személyiséggel rendelkezett, így évszázadok múltán, mikor már senki sem élt az őt megidézők közül, kíváncsiságtól fűtve útra kelt, és egész Shurimát bebarangolta. Egy furcsa, egyszerre hívogató, és nyomasztó erő azonban minduntalan egy irányba csábította, s minél tovább ment, az érzés annál erősebbé vált. Ichathiából jött a hívó jel, az éppen kiszabadult Üresség miatt. Odaérvén zavarodottan kémlelte a nem ezen, de nem is az ő világából származó hatalmom pusztítását. Embertömegek értelmetlen szenvedésének és halálának volt tanúja, megvédésükért pedig hajlandó volt eddigi békés létét feladni, és harcba szállni. Ürességivadékok egy nagy csapatával kezdett hősies harcot, ám azok elsöprő túlereje, és Kronkech gyakorlatlansága miatt a Nagyszellem hamar alulmaradt. Sejtette, hogy ez lesz a vége, de a hordát kellő ideig feltartotta, hogy ne vehessék szülőhazájába, az irányt. Ixtal adta neki a fizikai életet, most Ixtalért, és minden más emberi civilizációért kell feláldozni azt. Tűz, víz, föld és levegő, szilárd, folyékony és légnemű élettel teli komponensei nyugodtan, a helyzettel megbékélve szűntek meg létezni.  Ám egy a négy elem hatalmát tartalmazó apró kockában, egy Elementálmagban öszpontosulva Kronkech lelke mégis túlélte a pusztító raj rohamát. Évekkel később alakult csak vissza, legalábbis ezt akarta volna. Mikor antropomorf formát öltött, rádöbbent, hogy visszafordíthatatlanul megfertőzte az üresség. A hajdanán négy,  békésen, és szinergiában kavargó elemből álló alak most puszta ürességanyagból és- energiából állt. Természetellenesen lila formák emberszerű figurát kiadó halmazává vált, mégha a sötét alkotóelem szilárd, folyékony és légnemű allapotban is jelen volt. Egyetlen épen maradt része a mellkasa belsejében, ürességköddel közrefogott, meglehetősen összezsugorodott Elementálmag volt. Ez adta neki a reményt, hogy még maradt benne némi evilági, ezért hazaindult. Ám útja során akaratlanul is nagy pusztítást okozott útbaeső népeknek és élővilágnak, amit Kronkech sem jóvátenni, sem magának megbocsátani nem tudott. Valaha az élet segítője volt, most annak torz antitézise. Nehézkesen aztán mégis Ixtalba ért, ahol sok áldozat árán, de enyhíteni tudták pusztító létét. Ám a biztonság kedvéért, hogy ne árthasson népének, önkéntes száműzetésbe vonult, vissza  Shurima kietlen sivataga felé. A néhány ott élő civilizáció viszont a kizárólag Ürességből származó, gonosz lényt látta benne, így a Nagyszellem levadászásán ügyködtek. Habár Kronkech mégcsak nem is nagyon állt ellen, puszta léte szomorú véget vetett a bizalmatlan törzseknek. Majdnem egy évezred telt el a Kronch'zus Rau, az Üresség Szellemének Vadászai törzsszövetség utolsó hadjáratának bukása óta.  Mára már csak a legrátermedtebbek kalandorok és zarándokok járnak arra, azoknak pedig van akkor akaratereje, hogy Kronkech ürességenergiája ne hasson rájuk, így őket nagyon szívesen megsegíti kalandjaikon, és utat mutat a létezés Igazságához.\n\n**Megjelenés:**\n\"Klasszikus elementál alak,\" melynek teljes emberalakú teste az Üresség \"anyagából\" áll, néhol sötétlila kövek, néhol kavargó folyadék, gáz, vagy köd formájában, hasonló színnel. Egyedül teste közepén tér ettől el, ahol színesen virít az Elementálmag. \n\n\n**Képességek:**\n\n**Passzív: Örök formálódás **\nKronkech a hőspanelja felett három halmazállapot közül választhat, melyik formát öltse magára. A három külömböző forma más- más bónuszt biztosít Kronkechnek egy képesség használata után, mely minden egyes közeli ellenséges hős után halmozódik. A halmazállapotváltásnak nincs töltési ideje, míg Kronkechet semmilyen ellenség nem látja. \nSzilárd: Bónusz Páncél és Varázsellenállás, +5/7/9/11 + 5/7,5/10/12,5%  az 1/6/12/18. szinten, 3/3,5/4/4,5/5 mp-re, ami nem halmozódik képességek egymás utáni elsütésekor\nFolyékony: Visszatöltött Életerő,  5/15/45/135 + 2/3/4/5% MaxHP az 1/6/12/18. szinten\nLégnemű: Áthaladás egységeken, valamint mozgási sebesség, 10/17,5/25/32,5% az 1/6/12/18. szinten, 3/3,5/4/4,5 mp-re, ami nem halmozódik képességek egymás utáni elsütésekor, és harcon kívül 2 másodperc után elveszik\nHatótáv: 750\nTöltési idő, ha lát ellenség: 30 mp, kiiktatások nullázzák\n\n**Q: Elementálroham **\nKronkech a kiválasztott irányba rohamoz, sebzi  az ellenfeleket, akiken áthalad, valamint lelassítja a közelében repülő ellenséges irányított képességek utazási sebességét. A minionoknak jelentős extra sebzést okoz, a falakban pedig elakad. Halmazállapottól függően bőnusz hatással rendelkezik. \nSebzés: 40/55/70/85/100 +15%AP,\nminionoknak 150/200/250/300/350% sebzést okoz.\nIrányított képességek lassulása: 30/32,5/35/37,5/40%\nKépességlassítás hatótávja: 750\nSzilárd: Az ellenséges képességek lassítása hat az egycélpontos képességekre is, mértéke 45/47,5/50/52,5/55% -ra emelkedik\nFolyékony: Gyógyítja a szövetséges egységeket is, akiken áthalad, valamint még 1,5/2/2,5/3/3,5 másodpercig Kronkech további képességei is életerőt töltenek nekik.\nLégnemű: Áthaladhat falakon, ha pedig így tesz, a fal túloldalán 20/30/40/50/60%-al nő a sebzése.\nKöltség: 50 mana\n\n**W: Az Üresség áldása és átka**\nKronkech a képességet hosszan lenyomva tudja ki és- bekapcsolni. Bekapcsolt állapotban alaptámadásai rövid hatótávú irányított képességgé válnak, amiket a w rövid lenyomávával lehet használni. Megnövelt területi sebzést, és részben Tényleges sebzést okoznak és egyre nagyobb mozgási sebességet és ellenállást adnak, ám egyre több időt kell várni két támadás közt, valamint egyre több manát fogyasztanak. A képesség kikapcsolása utánmég rövid ideig megtartja a kapott bónusz sebességet és ellenállást.\nBekapcsolási költség: 30/35/40/45/50 mana\nFenntartási költség: 10/12/14/16/... az 1./2./3./4./... ütésnél\nTöltési idő 2 ütés közt:\n0,5/0,6/0,7/... az 1./2./3./4. ütés után -5%BonusAtkSpeed, de minimum 0.2/0.3/0.4/.... az 1./2./3./4./... ütésnél\nHatótáv: 175/200/225/250/275\nElsütés és sebzés közti idő: 0,35/0,3/0,25/0,2/0,15 mp\nBónusz sebzés: 10/15/20/25/30 + 0,5/0,75/1/1,25/1,5% MaxHp\nBónusz sebesség és kitartás: 10/15/20...% az 1./2./3./... ütésnél,legfeljebb 100%-ig.\nKikapcsolás utáni hatóidő: 1/1.5/2/2.5/3 mp\nKikapcsolás utáni töltési idő: 6/5.5/5/4.5/4 mp\nTényleges sebzés aránya: 10%\n\n**E: Beolvadás** \nKronkech rövid idő után lopakodni(!) kezd. Idő lejártával, vagy alaptámadás vagy képesség használatával felfedi magát, és lassít maga körül.\nHa sebző támadással, vagy képességgel szakította meg a láthatatlanságot, az azzal eltalált célpontok jóval nagyobb lassulást szenvednek.\nFelkészülési idő: 1 mp, csak erős tömegírányítással szakítható meg\nHatóidő: 3,5/4/4,5/5/5,5/ mp\nZóna hatótávja: 500\nLassítás: 15/20/25/30/35%, 1  másodpercre\nExtra lassítás: 40/50/60/70/80%, 1,5 másodpercre\nKöltség: 60/70/80/90/100 mana\nTöltési idő: 16/14/12/10/8 mp, közben nem töltődik\n\n**R: Lét és nemlét**\nKornkech szétporlad, pora pedig egy nagy körben szétterjed megsebezve minden ellenséget, akit elér. Mikor elérte hatótávja szélét, lassan összeáll eredeti pozíciójába, és a területen lévő összes ellenséget is erre a pontra húzza, valamint az előzőhöz hasonló sebzést okoz. Mindkét alkalommal az összes ellenfél után megkapja a Passzív bónuszát, mégha alapértelmezetten hatótávon kívül is lennének a célpontok. A visszafele elkapott célpontokat a saját összeállási sebességével húzza, azok eközben cselekvőképesek, és kicsúszhatnak/teleportálhatnak/rohamozhatnak a rántásból, de mozgással nem hagyhatják el\nazt. A képesség alatt Kronkech megcélozhatatlan, és sebezhetetlen, valamint nem használhat semmilyen képességet. \nElsütési idő: 1,5 mp oda, 1,5/1,25/1 mp vissza\nSebzés: 100/175/250 + 30/35/40%AP\nHatótáv: 1250/1500/1750\nKöltség: 100 mana\nTöltési idő: 120/100/80 mp\n\nMJ: Köszönet ptlg225 -nek a Háttértörténet és a Passzív képesség kibővitésére, korrigálására tett javaslataiért.\n\n\nEz lenne Kronkech, Ixtal Nagyszellemének koncepciója, remélem elnyerte tetszéseteket! A számadatok szinte biztosan nem teljesen kiegyensúlyozottak, csak iránymutatónak vannak, nem az a lényeg.  Ha bármilyen észrevételed/kritikád/véleményed lenne, szívesen fogadom.","replies":[{"poster":"ptlg225","date":"2019-12-16T21:16:00.702+0000","title":null,"up_votes":2,"down_votes":0,"body":"Helló nagyon megtetszett a Kronkech hős koncepciód.\nHa nem zavar megosztanám veled a véleményemet.\n\nMindenekelőtt honnan jött a Kronkech név, van valami jelentése? Először majdnem Stonehenge-nek olvastam, utána egyből eszembe jutott Tahm Kench neve is.\n\nKronkech tudja változtatni testének a méretét, alakját vagy a benne lévő anyagok összetételét? Át tud alakulni szilárdból folyékonyba majd légnemű alakba, ha akar?\n\nIlyenkor akaratlanul is eszébe jutnak az embernek a hasonló témájú hősök a játék világában. Pl: Maokai a dühös ent, aki a természet szelleme volt míg az Árny-szigeteki romlás megnem változtatta. Vagy Galio Demacia védelmére létrehozott hatalmas kolosszus/vízköpő. Vagy Malphite a szintén Ixtalban lévő hatalmas monolitból létrejött hős, aki a célját keresi a világban.\nMindnek meg van a témája: dühös szellem, dicső védelmező, mozdíthatatlan hegy.\n\nDe a történet alapján látom, hogy te a nagy barátságos óriás témát választottad neki. Adnék egy pár tippet, ha nem baj.\n\nTörténet: \nNagyon régen Ixtalban papok és sámánok egy csoportja jobban meg akarta érteni a természet/világ működését így kapcsolatba akartak lépni a kontinens természetfelettijét megtestesítő szellemmel. A másik létezési síkon lévő Kronkech néven emlegetett elemi szellemet azonban nem tudták megérteni. Ezért egy rituálé keretében a négy elemi erőből összegyúrt gólem testbe idézték meg. Bár emberek által megteremtett lény lett, Kronkechnek saját önálló tudata, személyisége és érzelmei voltak. Ő is jobban meg akarta ismerni az emberi lényeket, így velük maradt. Ennek már sok-sok éve és az utolsó varázsló is öregségben elhunyt, de Kronkech még mindig nem tudta kiismerni ezeket a összetett emberi lényeket. A kíváncsisága irántuk vándorlásra késztette és útjai során szívesen segített Ixtal minden lakosának. \n\nEzután nem csak úgy véletlenül megy el Ichatiába hanem mert érzet valami különös erőt vagy valami. Ott békés természete révén csak értetlenül nézi az Ichatiai és Shurimai emberek ádáz csatáját, majd szemtanúja lesz az Üresség portál kinyitásának és az ürességlények elszabadulásának. \n\nEkkor nem csak összekuporodik, hanem szembeszáll az üresség ivadékokkal és feláldozva magát megállítja az inváziójukat Ixtal felé megmentve azt. \n\nEzután ugyanúgy csodával határos módon túléli, de közben megfertőzi az üresség ereje, akaratlanul is árt Ixtal népének ezért száműzetésbe megy a sivatagba. Sok száz éven keresztül az ottlakók, akik nem ismerik félre értik őt és kinézete miatt összetévesztik az ürességből származó borzalmakkal. \n\nVagy sok száz évvel később valaki megtalálja Kronkech Elementálmagját és valahogy feléleszti. De sajnos az Üresség fertőzéstől rosszra fordulnak a dolgok és elmegy száműzetésbe a sivatagba.\n\nA történet utolsó mondatát nem értem: „Először ezek elméje, majd teste, s végül lelke is a puszta Üresség martaléka lesz, Kronkech pedig egyel kevesebb unalmas napot tölt a sivatag szívében.”\nMost ha a benne lévő Üresség fertőzés csinálja ezt az emberekkel, miért nem lesz tőle erősebb vagy valami? Ezt egyáltalán nem raktad bele a hős képességeibe. Ezenfelül az ilyen módon elveszett életek nem zavarják kedves békés óriásunkat?\n\nKépességek:\nIgazából a képességekkel nincs semmi különösebb bajom, csak megosztok veled pár ötletet hátha megtetszik.\n\nPasszív: Ez igazából oké és kell is ilyen öngyógyítás egy tanknak, csak passzívból ilyenből már elég sok van a játékban.\nAz én ötletem: Örök formálódás\nKronkech az életerőt veszítve különböző formát vesz fel, mindegyikben másfajta bónuszt kap a körülötte lévő ellenségek után, ha elhasznál egy képességet.  \nSzilárd: egy kis időre halmozható bónusz páncél és varázsellenállás.\nFolyékony: az ellenfelek számától függően gyógyítja magát.\nLégnemű: átmehet az egységeken és minden mozgást korlátozó hatás fél másodperc múlva megszűnik rajta. \n\nQ: Miért pont Elemi Lélek a képesség neve? \nEz is tetszik főleg a lövedékek lassítása rész. Bár én átraktam volna egy másikra és ezzel CC-zne a formák szerint.\nSzilárd: amikor átmegy rajtuk a levegőbe löki az első ellenfelet.\nFolyékony: minden ellenfelet a földbegyökereztet.\nLégnemű: elnémítja az ellenfeleket.\n\nW: Az Üresség áldása és átka\nElég jó képesség, csak megint a nevet nem értem. Hogy kapcsolódik az amit csinál az Ürességhez? Ahogy látom feláldozza az alaptámadását egy pár távolsági területi sebzésért, plusz kap mozgási sebességet és ellenállást. Ez miért is áldás és átok?\n\nE: Ezzel tényleg semmi bajom, csak én ide raktam volna a képességből származó lövedékek lassítását. \n\nR: Ez egy nagyon jó képesség és már egyből szívesen is látnám a játékban. Csak én egy olyat is beleraknék, hogy a már elszenvedett sebzésből is sebezzen első körben.\n\nNagyon jó munka, csak így tovább.\nMár alig várom a következő hősödet.","replies":[{"poster":"kecskeharcos100","date":"2019-12-17T14:43:43.896+0000","title":null,"up_votes":1,"down_votes":0,"body":"Először is köszönöm a rendkívül alapos, részletező véleményt, és örülök, hogy tetszett.\n\nA Kronkech név csak úgy \"random\" jött, tudtommal nincs semmi jelentése.\n\n\nTörténet: Egyszerűen kifogásolhatatlan az általad írt hozzátoldás/átírás, ha nem gond, átvenném (persze megjelölve értelmi szerzőjét, mégha pár görgetés után enélkül is megtudtató) Őszintén szólva a történet volt most a számomra legkevésbbé lényeges, csak a képességek után bújtattam ebbe a köntösbe. A vége nem túl logikus valóban.\n\nKépességek: \n\nElőbb a nevekre térnék ki, az rövidebb:\nQ: Kizárólag tematikus alapon van köze hozzá, konkrétan nem igazán, így \"Elementálroham\" -ra módosítom\nW: Az ürességnek \"köszönhetően\" képes a pusztító erőre, amit a w alaptámadásai képviselnek. Nyilván a nagy sebzés, gyorsaság és ellenállás az áldás, az átok pedig, hogy mindezt egyre lassabban, egyre több manáért teheti csak meg, mondhatni az Üresség nagy (pusztítő) erőt nyújt neki, de minél többet használja, annál jobban kimerül, mind fizikailag (ütési sebesség), mind spirituálisan (mana)\n\nPasszív módosításjavaslat: Nagyon tetszik, főleg, hogy semmiféle halmazállapotváltozáshoz fűződő képesség nincs a játékban, ide pedig nagyon illik. Annyiban módosítva venném át az ötletet, hogy ingyen válthat alakot, de csak akkor, mikor az ellenségek nem látják, különben nagyon nagy töltési időbe kezdene (méginkább hangsúlyozva a \"láthatatlan tank\" archetípust)\n\nItt válaszolnék a \"Tudja változtatni méretét, alakját, ...\" kérdésre. Ha már az általad írt módon megváltoztatom a Passzívot, halmazállapot-kiválasztás előtt/nélkül a \"Megjelenés\" szekcióban leírtnak megfelelően mindhárom h. á. -ból megtalálható belőle egyszerre. A méretét nem gondolom, hogy kéne változtatnia, túl nagy hasonlóság lenne Zac-el. Alakját is csak a különböző képességek használatakor.\n\n\nQ: Tetszik a halmazállapotonkénti bónusz itt is, de erősebb cc-t direkt nem adtam sokat a kezébe az identitása hangsúlyozásáért, így efféle bónuszokat gondoltam:\nSzilárd: A maga körüli ellenséges képességlassítás kiterjed a célzott képességekre is, valamint minden esetben erősebben hat. Lándzsaszerű alakot vesz fel, mint egy gerely, vegigvetődik a hatótávon.\nFolyékony: A passzív Folyékony állapotban történő élettöltése kihat a szövetségesekre is egy időre, akiken átment  (Kronkech életereje és képességei alapján, így törékeny hősökön is sokat gyógyít, és akár minionokat is). Árhullám alakban folyik végig.\nLégnemű: Átmehet a falakon, ha pedig így tesz, a fal túloldalára érve megnövekedik sebzése. Gázfelhőként repül át.\n\nW: Itt megjegyezném, hogy még annyiban látszódhatna az Üresség \"átok\" része, hogy addig elvesznek a halmazállapotok bónuszai, az Üresség témáját pedig némi Tényleges Sebzés erősítheti meg. A három h. á. így újra egyszerre jelenik meg benne, mint a Passzív kiválasztása előtt.\n\nE: Itt esetleg összehúzhatja magát, karcsúbb, áramvonalasabb formát öltve, kezei is eltűnnek ezidőre.\n\n\nKöszönöm tehát a részletes véleményezést, próbáltam minden pontra válaszolni benne. A legjobban az ember a hibákat kiemelő, de közben pozitív hangvételű véleménynek örül.","replies":[]}]}]}