{"poster":"Dartrix","date":"2019-01-09T23:48:41.460+0000","title":"Deberia dejar el juego?","subforum":"Guias y consejos","up_votes":2,"down_votes":0,"body":"Bueno, llevo 2 season jugando este juego, me encanta, es lo que mas juego porque me gusta y por mi pc que no es muy buena pero llevo un tiempo pensando: De verdad vale la pena seguir jugando? tengo 15 a&ntilde;os y a esa edad muchos proplayers ya era elo alto, yo soy plata 4 estacado y realmente no se me da bien ningun campeon, mi &quot;main&quot; es lee con 300K de puntos pero la verdad no pienso que lo uso bien\r\npor lo que pienso que este no es mi juego, aunque lo ame no puedo ni creo que vaya a progresar. en fin, gracias por leer","replies":[{"poster":"Cuchufleitor","date":"2019-01-10T00:08:48.268+0000","up_votes":1,"down_votes":0,"body":"No se si dejar, pero si no pretendes ser profesional, probablemente no le deberias dedicar mas de una o dos partidas por dia, alguna mas los fines de semana. \nProductivo no es, un \"juego\" lo que se dice \"juego\" para relajarse y divertirse, tampoco es. Es como para saciar un poco el hambre competitivo si no lo haces en alguna otra area (como jugar al futbol o cualquier otra competicion). \nProbablemente debas ir buscando de a poco otro hobby que te resulte mas recompensante y a la vez podria ser \"productivo\", como para que ya lo vayas entrenando desde joven. \nPuede ser carpinteria, programacion, idiomas, etc y lo podes aplicar a cosas que te gusten o te hayan gustado. \nPero al cerebro no \"le gusta\" que le saques algo a lo que esta acostumbrado (no de golpe), asi que te recomiendo que lo hagas de a poco y lo vayas reemplazando de a poco por otra cosa, por que si no, vas a tener un \"efecto rebote\", vas a volver mas enviciado, te vas a volver a frustrar al poco tiempo y no vas a saber por que.","replies":[{"poster":"Dartrix","date":"2019-01-10T00:18:20.907+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cuchufleitor,realm=LAS,application-id=8sKIclmi,discussion-id=ugJfMAzf,comment-id=0001,timestamp=2019-01-10T00:08:48.268+0000)\n>\n> No se si dejar, pero si no pretendes ser profesional, probablemente no le deberias dedicar mas de una o dos partidas por dia, alguna mas los fines de semana. \n> Productivo no es, un &quot;juego&quot; lo que se dice &quot;juego&quot; para relajarse y divertirse, tampoco es. Es como para saciar un poco el hambre competitivo si no lo haces en alguna otra area (como jugar al futbol o cualquier otra competicion). \n> Probablemente debas ir buscando de a poco otro hobby que te resulte mas recompensante y a la vez podria ser &quot;productivo&quot;, como para que ya lo vayas entrenando desde joven. \n> Puede ser carpinteria, programacion, idiomas, etc y lo podes aplicar a cosas que te gusten o te hayan gustado. \n> Pero al cerebro no &quot;le gusta&quot; que le saques algo a lo que esta acostumbrado (no de golpe), asi que te recomiendo que lo hagas de a poco y lo vayas reemplazando de a poco por otra cosa, por que si no, vas a tener un &quot;efecto rebote&quot;, vas a volver mas enviciado, te vas a volver a frustrar al poco tiempo y no vas a saber por que.\n\nsi te soy sincero es un sueño imposible para mi ser profesional, me encantaria trabajar de lol pero no voy a progresar jamas, me aburri de ver videosy replays mia para analizar mi juego y esas cosas pero sencillamente no se me da.","replies":[{"poster":"Shyeda Kayn","date":"2019-01-12T04:20:28.858+0000","up_votes":1,"down_votes":0,"body":"pide prestamo para un pc y todo, juega bien tu economia para trabajar del lol, vee streems, deja de cometer errores obviamente, juega campeones del meta (las.op.gg vee a estadisticas de campeones y tier god y aparecen las lineas) trata siempre de ganar linea, si juegas lee sin tienes que stompear el early, campear al mejor de tu team, no al malo debido que si feedean es por algo aunque todos lo hacemos, pero seguira dando ventaja). wardea la jg enemiga es como el ajedrez,si predices donde estara el jg wardeando sabras como hacerle counter ganks etc, campear el red para matarlo y obtener el red, etc,fijate si bot y mid van hacia ti para ayudar al jg enemigo, hace todos tus campamentos sin excepcion aunque seas de early que veo ese error en los lee sin de low elo, si nesesitas ayuda respondeme aqui y te agrego y te puedo enseñar seria de gran satisfaccion para mi.","replies":[]},{"poster":"Cuchufleitor","date":"2019-01-10T01:01:09.799+0000","up_votes":1,"down_votes":0,"body":"Ser profesional en una disciplina competitiva requiere de muchas mas cosas de las que normalmente se dice. \nUna pasion por ser el mejor que supera a la necesaria para terminar una carrerara universitaria, le dedican mucho mas tiempo, analisis y pueta en practica del que vos seguramente le pusiste. Te lo estoy sacando en cara? para nada, simplemente no era el camino que querias seguir edsde el inicio, consideraste que el sacrificio requerido no valia la recompenza, nada mas tenes que encontrar un camino en el que consideres que si vale la pena.","replies":[]}]}]},{"poster":"NøPuedenCønmigø","date":"2019-01-11T23:07:02.655+0000","up_votes":1,"down_votes":0,"body":"JUGAR Y ENTRENAR son 2 cosas distintas. \n\nhttps://drive.google.com/file/d/0B1YmQ7AnpduJYmdubGtMZ2hkTEU/view?pli=1","replies":[]},{"poster":"TvTLucio22","date":"2019-01-10T00:13:54.974+0000","up_votes":1,"down_votes":0,"body":"depende principalmente si queres hacer una carrera de esto. si no es asi y el juego te divierte, dale nomas para joder un rato. AHORA, si queres ser un pro, despedite de tu vida social, del estudio, del trabajo y de todo hobby que tengas, porque ESE es el precio a pagar (por algo se amotinan en una casa a practicar casi todo el dia, todos los dias).","replies":[{"poster":"Dartrix","date":"2019-01-10T00:23:00.724+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TvTLucio22,realm=LAS,application-id=8sKIclmi,discussion-id=ugJfMAzf,comment-id=0002,timestamp=2019-01-10T00:13:54.974+0000)\n>\n> depende principalmente si queres hacer una carrera de esto. si no es asi y el juego te divierte, dale nomas para joder un rato. AHORA, si queres ser un pro, despedite de tu vida social, del estudio, del trabajo y de todo hobby que tengas, porque ESE es el precio a pagar (por algo se amotinan en una casa a practicar casi todo el dia, todos los dias).\n\ndedico mi dia completo a lol, aveces juego media hora a otro juego pero nada mas, mis estudios van perfectos y mi vida social es nula porque no soy muy sociable ni me interesa serlo, y como dije arriba dedico todo el dia a este juego durante 2 season y sigo estancado en plata, llegue a plata 1 pero luego baje plata 4 y ahi quede","replies":[{"poster":"TvTLucio22","date":"2019-01-10T00:36:29.270+0000","up_votes":1,"down_votes":0,"body":"Reitero: QUERÉS dedicarte profesionalmente a esto? Y pensa en todo lo que implica, lo bueno y lo malo. A partir de ahí podes ver tus verdades opciones.\n\nAlso, podes dedicarle el día entero al lol y no querer ser pro, yo lo hice durante mucho tiempo (de hecho, tengo sólo 3 rankeds jugadas desde 2011). Sino, siempre podes buscar otro juego para ir mezclando y no aburrirte de siempre lo mismo","replies":[]}]}]},{"poster":"BesoDelPayaso","date":"2019-01-10T00:30:34.520+0000","up_votes":1,"down_votes":0,"body":"si lo que quieres es subir, mira videos completos de jugadores profesionales, buscas el rol y el champ con el que más te destaques y empieza a subir, generalemente se sube por tener un buen macro-game, el micro-game es importante también ya que si no sabes lanear contra alguien bueno te stompean infinito y pierdes cada game. Resumen mira videos didacticos y encuentra tu champion pool ideal. Si quieres saber un poco más agregame in game","replies":[]},{"poster":"Måuro","date":"2019-01-10T00:06:41.371+0000","up_votes":1,"down_votes":0,"body":"Si te gusta el juego seguí jugando. Si estás muy saturado de jugar, para por un rato y volvé cuando te den ganas de jugar.\n\n> [{quoted}](name=TheWorldAlive,realm=LAS,application-id=8sKIclmi,discussion-id=ugJfMAzf,comment-id=,timestamp=2019-01-09T23:48:41.460+0000)\n>\n>tengo 15 años y a esa edad muchos proplayers ya era elo alto\n\nNo te presiones para ser proplayer, trata de jugar por gusto y no presionado.","replies":[]}]}