{"poster":"Terminator1602","date":"2017-05-06T16:57:02.960+0000","title":"Item Sets","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Kurz: Warum gibt es keine item sets mehr? Bin ich der einzige der wieder welche haben will?\r\n\r\nSeit einiger Zeit schon Frage ich mich warum es eigentlich keine Item Sets mehr gibt, da diese eigentlich ja eine echt tolle Idee waren (und immernoch sind). \r\nDas Problem was ich dabei ausserdem noch habe, ist dass man alte Sets nichtmehr entfernen kann, da man ja nicht mehr die Option dazu hat. Ich spiel zwar betroffene Champions (Talon, Katarina...) nurnoch seltend, da ich von der midlane derzeit weggegangen bin, aber wenn es mal dazu kommt, ist es bl&ouml;d, wenn man im Shop immer wieder einen Tab wechseln muss.\r\nDarum w&auml;re es (unter anderm auch) von Vorteil diese Option wieder einzuf&uuml;hren. Ich w&uuml;rde ausserdem gerne bei Champions die man viel spielt die M&ouml;glichkeit haben ein Set anzufertigen und nicht immerwieder im Shop zu sitzen und den Itemnamen verge\r\nssen zu haben und dann die ganzen Items durchzugucken (was ja auch wieder wertvolle 30-80 Sekunden beanspruchen kann).\r\n\r\nMit freundlichen Gr&uuml;&szlig;en, Terminator1602","replies":[{"poster":"Reliable Support","date":"2017-05-06T16:58:39.756+0000","up_votes":2,"down_votes":0,"body":"Junge\n\n> Kurz: Warum gibt es keine item sets mehr? Bin ich der einzige der wieder welche haben will?\n\nDas Forum ist voll mit dieser Frage, kannst du das nicht mal in der Suchfunktion eingeben\n\nEs ist schon auf dem PBE wieder eingeführt und kommt auch bald auf die Live Server","replies":[{"poster":"Terminator1602","date":"2017-05-07T17:34:55.542+0000","up_votes":1,"down_votes":0,"body":"okay danke :)","replies":[]},{"poster":"DontKillMySoraka","date":"2017-05-06T18:09:18.187+0000","up_votes":1,"down_votes":0,"body":"nicht nur das, es gibt ca. 3 ask-riots + FAQs darüber.","replies":[{"poster":"Reliable Support","date":"2017-05-06T18:12:18.367+0000","up_votes":1,"down_votes":0,"body":"Ich wollte es nicht erwähnen, da ich zu faul war, die Links auch rauszusuchen XD","replies":[]}]}]},{"poster":"The mute Swan","date":"2017-05-09T09:59:25.147+0000","up_votes":1,"down_votes":0,"body":"Guten tag,\nmit den alten sets kann ich dir helfen. du gehst auf C: lokaler datenträger\\ Riot Games \\ League of Legends \\ Config \\ champions \\ den champ bei dem du das itemset entfernen möchtest \\ Recommended und löschst die datei","replies":[]},{"poster":"eLB D4mnis","date":"2017-05-09T07:08:48.227+0000","up_votes":1,"down_votes":0,"body":"Aufm PBE gibts afaik wieder Itemsets, daher kanns nichmehr allzu lang dauern","replies":[]}]}