{"poster":"Freesool","date":"2015-12-28T00:32:17.155+0000","title":"World of legends","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":2,"body":"**_HEYO _** {{sticker:slayer-pantheon-thumbs}} \r\n an alle die das hier lesen :D \r\nWie f&auml;ndet ihr es, wenn Riot Games ein MMORPG im League universum erstellen w&uuml;rde?\r\nWenn sie es hinbekommen ein gutes mmo zu schaffen k&ouml;nnten sie zum Beispiel das mmo mit dem moba verkn&uuml;pfen. \r\nSpieler des MMO&#039;s k&ouml;nnten so zum Beispiel neue Champions finden (z.B. Gnar in Freljord als eisblock in ner versteckten h&ouml;hle), die Story einzelner Charaktere beinflussen indem sie ihnen helfen, und und und.\r\nOder aber auch andersherum. Im Spiel sind gerade die Zombie Halloweenskins rausgekommen und im mmo bricht eine Zombieseuche aus.\r\nEin neuer Champ wird im moba released, im mmo gabs zun&auml;chst als zus&auml;tzlichen teaser ein weltevent wo dieser neu in die welt kommt.\r\n\r\nAu&szlig;erdem k&ouml;nnte man im mmo sp&auml;ter sofort zum moba wechseln und sie damit noch enger verkn&uuml;pfen indem im mmo die Liga als geb&auml;ude existiert man mit dem Ingamehelden diese betritt und seinen &quot;Freund&quot; als Beschw&ouml;rer unterst&uuml;tzt. \r\n\r\nIch denke zwar das RIOT Games nich so gro&szlig;e erfahrungen mit RPG&#039;s hat und dies dadurch schwer wird aber m&ouml;glich ist es ;)\r\n\r\nZudem w&uuml;rde das mmo definitiv an den erfolg der mobas ankn&uuml;pfen k&ouml;nnen sodass von anfang an gleich gen&uuml;gend spieler vorhanden sind damit man dies umsetzen k&ouml;nnte. Blizzard hat es bei Warcraft ja auch geschafft das universum in ein perfektes mmo zu verwandeln. Zudem ist der Grafikstyle der Splasharts wie z.B. das [der Kluft im Hintergrund der Leagueseite](http://prntscr.com/9j91ir) der perfekte f&uuml;r ein MMO. Und die Storys der einzelnen Charaktere sind definitiv gut genug f&uuml;r eine Mmo-Story mit Halt : \r\ndie ninjas/Assassinen{{champion:84}} {{champion:85}} {{champion:98}}{{champion:238}}  , die Kriege, einfach alles.\r\n\r\nZu den Umgebungen muss man glaube ich kaum was sagen ich meine es g&auml;be so viele abwechslungsreichew gebiete:\r\nFreljord, Ionia, der gewundene Wald, die Kluft der Beschw&ouml;rer (nicht nur als Liga sondern wirklich als komplette hauptstadt des Games), die Schatteninseln usw.\r\n\r\n Also ich w&uuml;rde es um jeden fall spielen das {{champion:86}} tier ich euch ;)","replies":[{"poster":"Im a Papaya","date":"2015-12-28T01:03:24.889+0000","up_votes":3,"down_votes":0,"body":"Wäre ne nette Idee ^^ Aber ich mach mir Sorgen das die ganze Sache am ende zu gestellt wirkt. Entweder spielt man wirklich in einem Gebäude das dann die Liga der Legenden darstellt oder man spielt wirklich in der Welt die von den Machern erdacht wurde, was dann wieder für Konflikte sorgen wird bei neuen Champs und co.","replies":[{"poster":"Freesool","date":"2015-12-29T10:15:15.095+0000","up_votes":1,"down_votes":0,"body":"Ich dachte eher daran, dass sie die Welt von League komplett darstellen und dies als Welt nehmen. Freljord, der gewundene Wald, Demachia, Noxus, Piltover, Schatteninseln... dass währe die perfekte Grundlage in sachen dynamic in der Umgebung: Es gibt düstere Gebiete durch die Schatteninseln, Eisgebiete durch Freljord, moderne Gebiete durch Piltover und und und und. Die Hauptstadt des ganzen ist dann die Liga welche aus einem Riesigen Gebäudekomplex besteht. Man selbst spielt als Beschwörer der die Helden in der Liga vertreten darf, wenn er ihnen hilft und somit die Geschichten mitbekommt.","replies":[{"poster":"Im a Papaya","date":"2015-12-29T10:59:18.347+0000","up_votes":3,"down_votes":0,"body":"Klingt auf jeden Fall danach als wäre es einen Versuch Wert.","replies":[]}]}]},{"poster":"PwnedAkkon ","date":"2015-12-30T01:23:30.404+0000","up_votes":1,"down_votes":1,"body":"woran ist denn bitte wow das perfekte mmorpg...","replies":[{"poster":"Freesool","date":"2015-12-30T17:23:41.811+0000","up_votes":1,"down_votes":0,"body":"das hab ich nicht gesagt ;)\nich meinte lediglich das riot, wenn sie ein Mmo machen sich vll an WoW orientieren könnten, da WoW auch aus einem Strategiespiel entstand.\nZudem macht World of Warcraft nichts falsch es gibt unmengen an End-Game-Content dauerhafte Updates riesige Inis und es ist nicht für standart Casualgamer designt, die meiner Meinung nach in mmo's nicht wirklich viel zu suchen haben da ein mmo daraus besteht sich eine Gilde zusammen zu suchen mit der man jede Ini und jeden Boss nacheinander legt und das auf immer schwereren Stufen in immer schnellerer Zeit. Und da sehe ich wow als einen der größten Vorreiter. Es ist nicht umsonst das meistgespielteste mmo der Welt (12mio. aktive Spieler) da sie das Spiel aber immer mehr casual machen wird WoW immer weniger gespielt und das währe die chance für World of Legends ;)","replies":[]}]},{"poster":"M4UR1C31234","date":"2015-12-28T00:46:47.611+0000","up_votes":1,"down_votes":1,"body":"Wäre sicher gut. Am besten sollte das ganze einfach gehalten werden wie das gute alte Metin 2 nur mit vielen verschiedenen Klassen und nicht nur 4 Klassen mit jeweils 2 möglichen Skillungen.\n\nMit Freundlichen Grüßen {{champion:92}} {{champion:92}} {{champion:92}}","replies":[{"poster":"Freesool","date":"2015-12-29T10:20:06.512+0000","up_votes":1,"down_votes":0,"body":"Ich dachte wirklich eher an sowas wie wow also riesige Fantasywelt (in Metin ja einfach im asiatischen Raum angesiedelt) riesige Inis verschiedene Skillungsmöglichkeiten selbst in den Klassen (komplette Freiheit nicht nur 2 Möglichkeiten ;) )... Das Problem dabei ist jedoch das es nicht wie ein 0 8 15 Klon von nem X-Beliebigen mmo wirkt. Zudem weiß ich nicht was für Klassen sie rausbringen sollten... standart Magier und co denke ich passt nicht wirklich in das Universum. \nVll. sollte man sie an den League Champs orientieren :D","replies":[]}]}]}