{"poster":"Wanna be Màdlife","date":"2018-01-30T10:41:15.143+0000","title":"So about perma bans.....","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"well i had a close friend of mine that got a perma ban yersteday for flaming i was talking with him about 15 mins ago (from now) saying \"yeah i deserved that ban but they should be banned to for trolling\" thats litteraly his reaction well i wont dissagree that he indeed flame but he got his lesson instead of a perma ban can't he get a 30-60 days one? i will bet my own acc to his good behavior name is S1rinakis of euwe\nlitteraly if he flame iven once perma ban him and me\n(didint know where to ask about that sorry from my part to anyone else that wasted his time reading it and thanks)\n  {{sticker:sg-soraka}}","replies":[{"poster":"Broporo","date":"2018-01-31T01:16:35.104+0000","up_votes":1,"down_votes":0,"body":"Accounts get several warnings as attempts to help usher reform before it gets escalated to a permanent ban. These warnings and temporary suspensions are meant to give them a chance to change the behavior that was punished for. We can't simply trade punishments between accounts either. If your friend doesn't remember what happened to warrant the ban, they're always welcome to submit a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new) for that context.","replies":[{"poster":"Wanna be Màdlife","date":"2018-01-31T14:03:05.673+0000","up_votes":1,"down_votes":0,"body":"yeah but that just makes them make other acc and do the same thing instead of fixing their behavior while there are cases that can be solved this way","replies":[]}]},{"poster":"Wanna be Màdlife","date":"2018-01-30T13:49:19.934+0000","up_votes":1,"down_votes":0,"body":"litteraly can't anything happen about that? iven if i take a punisment for him to?","replies":[]},{"poster":"Chermorg","date":"2018-01-30T13:14:10.775+0000","up_votes":1,"down_votes":0,"body":"Your friend should've learned his lesson before the permanent ban. He got a 2 week ban before most likely, and it makes explicitly clear that any further offenses will be permanent. If your friend flamed and the ban was thus proper, it is virtually impossible it be removed. Riot does not reverse permanent bans that were not placed in error.","replies":[{"poster":"Wanna be Màdlife","date":"2018-01-30T13:48:06.055+0000","up_votes":1,"down_votes":0,"body":"so there is no possible way? ill put my acc integrity if its possible he is a good guy but had 12 loses in a row iven xpeke would crack by that\n(thanks for he response btw :D )","replies":[]}]}]}