{"poster":"bestbelfegor","date":"2017-03-20T04:18:00.447+0000","title":"Aproximadamente 21 juegos que pierdo por gente que no tiene idea que es el juego.","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":4,"body":"Estaba en Oro I. Hace 3 d&iacute;as pero desde ese momento me trolearon tanto no solo los jugadores si no tambi&eacute;n el juego con las conexiones de mis aliados ya que ellos ten&iacute;an &quot;lag&quot; y de esa forma no pod&iacute;an jugar.\r\nProvablemente este sea la ultima vez que juego en este servidor de LAS.\r\nYa que posiblemente me vaya a Norte america por que simple hecho de que aqu&iacute; los jugadores son terribles no solo a nivel mecanico si no a nivel Psicologico.\r\nUna pena realmente este servidor asi jamas llegaremos a aspirar el mundial con este tipo de personas dentro del juego.","replies":[{"poster":"rokushoger","date":"2017-03-20T11:05:36.174+0000","up_votes":2,"down_votes":1,"body":"Buenas guardian de la tormenta Varia!\n\nEs gracioso que te quejes de que los compañeros que te tocan sean malos, es decir, todos los que te tocan son malos? todos de verdad? Me parece que si tenés problemas con todos entonces el problema pasa por otro lado no te parece? \n\nAdemás tené en cuenta que, si te toca con esa gente, es porque son de tu mismo nivel de MMR, o sea que tanto mejor no debes ser. Saludos!","replies":[]},{"poster":"santyRPX","date":"2017-03-20T04:43:24.630+0000","up_votes":2,"down_votes":1,"body":"sin ofender pero en algunos no perdiste por culpa de tu team sino por culpa tuya en parta, siendo oro 1 farmeas como bronce xd","replies":[]},{"poster":"AIister","date":"2017-03-20T23:24:13.596+0000","up_votes":1,"down_votes":0,"body":"Hola, no es por atacarte, pero quisiera informarte que el unico factor comun en esas 21 partidas fuiste tu. La unica cosa que se repitio (Sin contar campeones, maestria, items, etc) Se que estas \"tilteado\", pero no le eches la culpa a los demas","replies":[]},{"poster":"Trying Improve","date":"2017-03-20T08:01:24.288+0000","up_votes":1,"down_votes":0,"body":"Ojala te cambies de server, para que disfrutes jugar con 170 ms y luego no puedas volver a cambiar la cuenta a LAS\nSi no se pudiera subir de división no habrían challengers. ¿Es más fácil mirar al resto, no?","replies":[]},{"poster":"Lucio22","date":"2017-03-20T04:55:04.699+0000","up_votes":1,"down_votes":0,"body":"...\n\nTe quejas de que el ser ver anda mal y eso, pero te queres ir a na... suerte jugando con los 250 ms fijos (si tenes suerte, pueden aumentar sin drama).\n\nRecomendacion: deja de culpar a otros por todos (ya que seguramente en más de una partida tuviste algo que ver con esa derrota, de una u otra forma) y aprende a escribir/redactar","replies":[{"poster":"bertox","date":"2017-03-20T05:25:23.000+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Lucio22","date":"2017-03-20T06:41:06.856+0000","up_votes":1,"down_votes":0,"body":"\"sino porque se van abrasil??\"\n\npor llorones? porque hay que quejarse siempre de algo? por pitos cortos?\nidk, hay varias opciones\n\no sea, no digo que sea el mejor server de la historia de la humanidad, pero a mi aca me anda entre 50 y 60 ms constantes (el dia que me anda \"para la bosta\" son 75...) mientras que en na eran 250 ms como minimo y si tenia suerte, no era raro jugar con 300 0 mas intentando ver que carajo pasaba con unos segs de diferencia","replies":[]}]}]}]}