{"poster":"G13 Smoke","date":"2015-09-15T17:48:29.198+0000","title":"Bronze in Normals???","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":2,"body":"hey leute, ich hab flaute in meinen rankeds und bin von g2 auf g5 wieder heruntergeflogen :( also dachte ich mir, spiel ich wieder paar normals (normalerweise spiel ich immer ranked, macht einfach mehr spa&szlig;, da die mitspieler und gegner es ernster nehmen). wie dem auch sei, ich spiele immer ranked bin leider auf gold5 runtergefallen und spiele jetzt ein normal.... meine gegner und meine mitspieler waren alle samt bronze oder unteres silber.\nWarum? selbst wenn meine elo durch die vielen looses niedrig geworden is, is es kein vergleich mit bronze. Diese Spiele waren ein Witz, ich habe einmal eine lux zum ersten mal ausprobiert und nach 15 min 20 stacks.... oder habe ich meinen main adc in bot gespielt und der gegner adc war als ich 6 war lvl 2 mit 15 farm.... \nnun meine frage, warum? wie soll ich denn besser werden, wenn riot mich mit bronze zusammen steckt, und mein niveau mindestens g5 is? \nist das weil ich nie normals spiele und mich in normals erstmal mit wins auf eine h&ouml;here elo spielen muss? also das ranked und normal elo von einaner unterschiedlich is?\n\n\n(ach und tut mir echt leid wegen all der ortographischen fehlern, ich war immer schon n noob in deutsch)","replies":[{"poster":"Marksmansitter","date":"2015-09-15T18:37:44.784+0000","up_votes":2,"down_votes":0,"body":"Ranked-Elo hat nichts mit der Normal-Elo zu tun.\n\nDu kannst im Ranked Challenger sein und in normals eine Bronze Elo haben","replies":[{"poster":"G13 Smoke","date":"2015-09-15T20:05:22.774+0000","up_votes":1,"down_votes":0,"body":"ok danke... aber das heißt ja, dass wenn ich ein vernünftiges spiel spielen will, n ranked machen muss.... \nohhh man wie ich das game liebe","replies":[{"poster":"Bluefersan","date":"2015-09-15T20:31:13.603+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=G13 Smoke,realm=EUW,application-id=vatevpvi,discussion-id=gcBZeWl5,comment-id=00000000,timestamp=2015-09-15T20:05:22.774+0000)\n>\n> ok danke... aber das heißt ja, dass wenn ich ein vernünftiges spiel spielen will, n ranked machen muss.... \n> ohhh man wie ich das game liebe\n\noder du gewinnst mehr normals, normal mmr steigt schnell an","replies":[{"poster":"Busty Botter","date":"2015-09-15T20:37:42.033+0000","up_votes":1,"down_votes":0,"body":"Dann spielt er nicht mehr gegen Bronze Tryhards sondern gegen Platin Trolle...\n\nNormals im Blindpick darf man niemals als Richtlinie für irgendwas nehmen. Soviel getrolle (meist aus Spaß nicht böswillig) habe ich in keiner anderen Queue erlebt. Hier lebt teilweise Ultimate Bravery in einem Team mit Doublejungle und Tripplemid. Es ist ein reiner Funmode, auch für mich.\n\nWenn du halbwegs ernsthaft üben willst spiel Normal Draft, im Teambuilder sind leider zuviele \"first Time Champ X\" und man bekommt so keine gute Resonanz von seinem Können. Richtig lernen wirst du einen Champ aber nur im Ranked, deshalb sollte man hier \"better save then sorry\" spielen.","replies":[{"poster":"G13 Smoke","date":"2015-09-16T01:03:05.362+0000","up_votes":1,"down_votes":0,"body":"mhh, ja ok, ja das hab ich ja jetzt immer gemacht :D nur rankeds :DD aber ich werde draft pick mal ausprobieren, danke für den tipp","replies":[{"poster":"Taihuang","date":"2015-09-16T14:45:13.732+0000","up_votes":1,"down_votes":0,"body":"Wie ist denn deine W/L in den normalen Runden?\nSonst such dir einfach ein paar Veteranen, die meisten guten\nSpieler mit 750+ Spielen haben ganz automatisch eine passable Normal-MMR.","replies":[]},{"poster":"Bluefersan","date":"2015-09-16T10:12:42.133+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=G13 Smoke,realm=EUW,application-id=vatevpvi,discussion-id=gcBZeWl5,comment-id=00000000000000000000,timestamp=2015-09-16T01:03:05.362+0000)\n>\n> mhh, ja ok, ja das hab ich ja jetzt immer gemacht :D nur rankeds :DD aber ich werde draft pick mal ausprobieren, danke für den tipp\n\ndraft sind die aber echt mad wenn du verlierst, weil dort sind zum größten teil leute mit CR.","replies":[]}]}]}]}]}]}]}