{"poster":"G13 Smoke","date":"2016-11-24T08:01:12.993+0000","title":"Mage Items","subforum":"Level Up: Guides & Tipps","up_votes":2,"down_votes":1,"body":"Hey, \r\nich bin plat adc main, habe aber beschlossen zur neuen Season mehr mid zu spielen.\r\nIch bin auf jeden fall mehr der long range mage, da ich fr&uuml;her viel ori gespielt habe. Also was ich im Moment versuche zu lernen, sind Ori, Xerath, Vel&acute;Koz, Lux, Syndra. \r\nMeine frage ist nun, was ich auf denen baue und wann ich es baue. Ich will jetzt kein Item build zu den Champions, dass kann ich mir auch im inet zusammensuchen. Ich w&uuml;rde gerne wissen was die Items wirklich bringen. \r\nMit was burste ich schneller, mit {{item:3285}}  oder {{item:3089}} / wann sollte ich {{item:3020}} und wann {{item:3158}} kaufen/ ein {{item:3001}} nur wenn ich zur&uuml;ck falle, oder bringt mir die mr pen sehr viel im early? Das sind nur ein paar Beispielfragen\r\n\r\nkurz gesagt, ich habe 0 Gef&uuml;hl daf&uuml;r was f&uuml;r st&auml;rken und schw&auml;chen die Items haben und gegen welche Champions ich was bauen sollte\r\n\r\n(ich entschuldige mich f&uuml;r die miserable Rechtschreibung)","replies":[{"poster":"Kata Ga Kill","date":"2016-11-24T14:23:56.100+0000","up_votes":1,"down_votes":0,"body":"Für Lux & Syndra kann ich dir gerne detailiert helfen:\n\nStart Items können 1-2 {{item:1056}} sein, je nachdem ob du früh Probleme hast ist der 2te Dorans sinnvoller.\nAm Anfang ist es sehr wichtig das man {{item:3165}} kauft bzw. First Back das {{item:3802}} holst um deinen Mana Haushalt zu finanzieren.\nDen die beiden Girls saugen schnell das Mana leer, zudem gibt das Item sehr wichtige Overall Stats mit CDR, Mana und viel AP.\n\nWenn du allerdings direkt Probleme auf der Lane hast oder nen guten Assassinen als Gegner solltest du {{item:3802}} / {{item:1056}} {{item:1056}}  und {{item:3001}} / {{item:3157}} zuerst kaufen bevor du das Morelo zu ende baust. Defintiv aber spätestens als 2tes Item solltest du Morelo haben.\n\nIm normalfall aber braucht eine Lux keine defensives Items ingegensatz zur Syndra, Position und hohe Range sind genug für Lux.\n\n{{item:3020}} Sollten unbedingt neben dem Morellos gekauft werden. \n------------------------------------------------\nJetzt kommts drauf an wie die Lage aussieht nach der Lane  bzw. nach deinem {{item:3165}}:\n\nBiste gefeedet mit mindestens 3:0 kannste dir {{item:3089}} kaufen.\nBrauchste bessere Positionierung, Roaming und Burst Hilfe ist {{item:3285}} deine nächste Option bzw. bessere Option als Rabadons.\nHaben die 2-3 Gegner schon mindestens +50 MR (schau TAB nach) solltest du dir {{item:3135}} als nächstes kaufen.\n----------------------------------\nBrauchste mit Syndra mehr Utility und HP ist {{item:3116}} nicht verkehrt. Für Lux ist dieses Item eher uninteresant weil hohe Range und abgesehen davon slowt und snared die Lady schon von allein. Bzw. ist Rylais für die meisten Mages zurzeit immer das 2te Item.\n----------------------------------\nZuletzt kann ich Zhonyas bei beiden stark empfehlen es hilft gegen Engage bzw. ist das das Guardian Angel für Mages.\nOder wenn dus nicht nötig hast weil Gegner Noobs sind oder die nicht hard engagen können oder du ultra Fett bist ist {{item:3100}} dein Item to Go für zusatz Burst Schaden (besonders für Lux ist es nett da man ohnehin AA dazwischen spammt durch ihre Passive) und um Turrets schnell zu bekommen.\n\nPS: {{item:2139}} nicht vergessen :)\n\nFür weitere fragen kannste mich gerne Adden.","replies":[]},{"poster":"PlanetenPlatzer","date":"2016-11-24T08:20:39.720+0000","up_votes":1,"down_votes":0,"body":"Auf all den Champions die du genannt hast ist Morellonomicon ein sehr gutes Item. Dass baust du meistens als erstes. Es sei denn du spielst gegen etwas wie Fizz/Zed.\n\nGegen Fizz und Zed brauchst du Zhonya's. \nGegen Malzahar kaufen viele Leute Qss. Das ist aber kein Muss. \n\nAbyssal hat keine Magic Pen mehr. Es gibt dir einfach nur +10% Damage. Allerdings gilt dies nur bei Champions in deiner Nähe. Ist also gut auf Syndra. Aber auf den anderen Champions bringt es dir nicht so viel. Vielleicht noch Ori. Aber die anderen haben halt nicht so viel von der Passiven.\n\nLuden's Echo bietet im Early den stärksten Burst. Rabadon's muss erst skalieren. Außerdem kann man wenn man Luden's hat, Thunderlord schon mit 2 Fähigkeiten auslösen, da die Passive von Luden's ebenfalls als eigene Schadensquelle gilt.\n\nBei den Schuhen kommt es auf 2 Faktoren an:\n\nDie Cooldown Schuhe sinnt ganz nutzvoll wenn du möglicherweise nur auf 30% CDR kommst. Damit du dann die vollen 40% hast. Ansonsten ist es auch nutzvoll wenn du gegen etwas wie Hecarim oder Amumu spielst. Von diesen Champions muss man öfters mal wegflashen. Denn die CDR Schuhe geben ja auch CDR auf Summoners. \nAuf Syndra würde ich nie die CDR Schuhe kaufen. Denn Morellonomicon, Abyssal Scepter und Zhonya's zählen nunmal zum Standardbuild. Dort sieht man fast immer die Magic Pen Schuhe. Bei den anderen kann man es sich überlegen. Kommt halt wie gesagt auf die oben genannten Faktoren an.","replies":[{"poster":"G13 Smoke","date":"2016-11-24T08:51:19.020+0000","up_votes":1,"down_votes":0,"body":"Danke schonmal sehr hilfreich\npaar fragen hab ich trotzdem noch \nwenn ich nun {{item:3157}} first bauen muss, sollt ich mir trotzdem {{item:3802}} mit first back kaufen? einfach für den sustain? \nWann sollte ich meine Boots ausbauen? Als adc, tu ich dies, in dem moment, wenn ich weiß dass ich so stark auf der lane bin, dass ich bald den tower bekomme, oder den tower schon habe. Aber als midlaner romed man ja schon oft vor dem towerfall. Außerdem sehe ich oft pros die boots erst nach dem 2 oder sogar 3 item ausbauen. \nWas ist mit {{item:3116}} nur bauen, wenn ich utility brauche? und {{item:3151}} nur wenn ich vorher {{item:3116}} gebaut habe? waren für mich beides items, die ich nur gegen krasse tanks gebaut habe, aber die ap werte sind ja jetzt enorm. wenn man mal sieht wie wenig {{item:3157}} jetzt bringt...\nsagen wir ich habe {{item:3165}} und {{item:3157}} und bin infront. Sollt ich mir dann gegen squishies ein {{item:3135}} kaufen oder ein {{item:3285}}? und sollte ich {{item:3135}} gekauft haben, lohnt sich danach überhobt noch ein {{item:3285}} oder sollte ich dann schon ehre ein {{item:3089}} holen?","replies":[{"poster":"Ηastur","date":"2016-11-24T10:57:49.891+0000","up_votes":1,"down_votes":0,"body":"Hi.\n\nAlso ich mag Rylais gerne auf Champs mit AOE Schaden, da man so in gewisser  Weise noch CC/Peel mitbringt im Teamfigt. Ich bau selten dazu Liandrys, eigentlich nur gegen harte Tanks.\nBei der Kosten Nutzen Rechnung von Void gegenüber Rabadons gabs mal irgendwo ein Video. Ich glaube mich erinnern zu können, dass dort gesagt wurde, dass Rabadons tatsächlich erst über 300AP besser wird. Das muss aber nichts heißen. Das ist zwar jetzt sehr Champspezifisch aber auf meinem Main (Annie) Kaufe ich 2 Dorans, wenn ich auf nichts reagieren muss Rylais und CDR Boots und danach Voidstaff. Da beginnt das Gegnerteam idR schon MR zu bauen. Nur als Beispiel.\nSchuhe ausbauen tu ich früh, wenn ich vor habe zu roamen, und dann auch schon nach dem zweiten Dorans. Ansonsten nach dem ersten Item. Welche ist auch Abhängig von der Situation und dem Champ. Gibt Champs die sind auf den CD angewiesen, wenn mehr als ein Gegner MR baut kann es aber echt nicht schaden die anderen zu priorisieren.\nVon Ludens Ekko bin ich eigentlich gar kein Freund. Es gibt dir abgesehen von der Passiven nur noch Laufgeschwindigkeit und sonst nur rohe AP. Andere Items sind da wesentlich besser. Kann man machen, wenn man nen early lead bekommt oder roamen will. Ich sehe das Item häufig auf AP-Supportern, in der Mitte eher selten und wenn dann auf Kata und Annie.\n\nBzgl. Höllenzepter und Zhonias. Diese Items sind immer situativ. Gibt Champs da sollte man sie vlt auch als core bauen, ich mag es mich anzupassen, da beide nicht so bombig AP geben und du damit viel Druck verlierst, andererseits gewinnst du Utility.","replies":[]},{"poster":"PlanetenPlatzer","date":"2016-11-24T10:06:31.704+0000","up_votes":1,"down_votes":1,"body":">wenn ich nun  first bauen muss, sollt ich mir trotzdem  mit first back kaufen? \n\nGegen Fizz würde ich Zhonya's definitiv immer als erstes bauen. Gegen Zed überlebst du auch wenn du nach der Ult einfach flashed. Dann fehlt der Schaden und du solltest überleben. Allerdings bist du danach anfälliger. Ist also eine Frage des eigenen Interesse. Gegen Zed kann man sich aber erlauben das Mana Item zu holen. \n\n>Wann sollte ich meine Boots ausbauen?\n\nWann der beste Zeitpunkt gekommen ist um die Schuhe auszubessern kann ich dir aber leider nicht sagen. Ich kaufe mir die immer wenn ich gerade das Gold dazu habe aber mir nichts teureres kaufen kann. Also wenn man ca. 800 Gold hat. Bei mir ist das relativ früh, aber niemals bevor ich das 1. Item gebaut habe. Aber meistens schon bevor das 2. Item da ist. Aber wann der beste Zeitpunkt gekommen ist, weiß ich selbst nicht.\n\n>Was ist mit  nur bauen, wenn ich utility brauche?\n\nRylais würde ich auch nicht unbedingt auf jedem der Champions bauen die du genannt hast. Eigentlich ist es auf Keinem ein muss.\nVel' Koz und Xerath können das Item zwar bauen, und es steht ihnen auch, es muss aber nicht unbedingt sein.\nAuf Syndra sieht man Rylais öfter mal. Ich spiele Syndra aber nicht und weiß nicht ob es bei ihr eins der besseren Alternativen ist.\nBei Orianna und Lux weiß ich nicht ob man da Rylais baut. \nGenerell ist das Item ziemlich gut bei Champions die Damage over Time Spells haben, oder bei Fähigkeiten mehrere Instanzen haben. Zum Beispiel Aurelion Sol W, oder der W von Vel'Koz. \n\nDie Maske ist dann noch spezieller. Grundsätzlich würde ich sagen ja, die Maske ist nur wirklich gut wenn man vorher Rylais hat. Gibt aber vielleicht Ausnahmen die mir momentan nicht einfallen. Allerdings steht Maske nicht sehr vielen Champions. Die Damage over Time spells sind hier besonders gut. \nAlso sowas wie Brand und Rumble können mit diesem Item am meisten anfangen. Auf den Champions die du genannt hast würde ich das Item nicht bauen.\n\n>sagen wir ich habe  und  und bin infront. Sollt ich mir dann gegen squishies ein  kaufen oder ein ?\n\nVoid Staff ist gut gegen Tanks. Denn diese bauen viel MR. Squishies eher weniger. Gegen Squishies ist Luden's besser. Allerdings würde ich mir Luden's nicht mehr im späten Spielverlauf kaufen. Entweder im Early oder nur wenn du im Late Game noch einen freien Itemslot hast und nicht weißt was du dir kaufen sollst. Denn ansonsten ist Rabadon's besser. \n\n>und sollte ich  gekauft haben, lohnt sich danach überhobt noch ein  oder sollte ich dann schon ehre ein  holen?\n\nDa man Void Staff erst später kauft lohnt sich danach Rabadon's wahrscheinlich mehr. Meistens kaufen sich Midlaner Void Staff als 3. Item. Das gilt aber nur für High Elo. Denn dort gibt es kaum Spiele ohne Tanks. In Platin gibt es da noch weitaus mehr Assassins. Also kann es durchaus sein, dass man sich Void Staff erst als viertes, fünftes, sechstes oder gar nicht kauft. \nNochmal zu Luden's: Wie gesagt entweder im Early, Gar nicht oder als letztes Item wenn noch Platz ist.","replies":[{"poster":"G13 Smoke","date":"2016-11-24T10:45:26.713+0000","up_votes":1,"down_votes":0,"body":"vielen dank, hat mir sehr geholfen :)","replies":[]}]}]}]}]}