{"poster":"Strikeeagle55","date":"2016-01-05T22:39:28.195+0000","title":"Ranked","subforum":"Champions & Gameplay","up_votes":0,"down_votes":1,"body":"wie kann ich im ranked viel dmg machen also muss man daf&uuml;r eigene runen machen f&uuml;r ranked ?","replies":[{"poster":"The mute Swan","date":"2016-01-06T00:28:22.671+0000","up_votes":4,"down_votes":0,"body":"würde auch was bringen, deine masteries zu aktualisieren, bzw überhaupt erst mal ein paar zu erstellen\n\nund auf deinen runenseiten nur ad oder ap reinzuballern ist sooo.... bronze... versuch mal auch was rüstung und mr reinzuhauen. wenn du nicht so schnell stirbst, drückst du mehr damage. für sowas gibt es seiten, die dir erklären was und warum.\nund kauf dir nicht immer nur damage. full ap taric mag ja ganz lustig sein, aber gegen das team hättest du ganz prima mr bauen können und deinem team einige tode ersparen können.\nUND ALS SUPPORT KAUFST DU DIR BITTE EINEN ****** WARDSTONE!!! \ndamage mag ja schön und gut sein, aber wenn du die gegner feedest, weil du den gank nicht kommen siehst, machst du weniger damage und die gegner mehr, allein deshalb, weil die gegner mehr gold bekommen und dadurch mehr items haben. Trust me, I'm main support.\n\nauf rammus jungle den cinderhulk nicht zu bauen, sondern einfach mal auf das jungle item zu verzichten ist auch etwas... naja...\nvor allem weil du mit dem red smite den gegnerdamage reduzieren kannst und dir das bei ganks zugutekommen kann\n\nzudem würde ich dir auch raten kdu auf adcs als first item zu bauen, einfach wegen dem erhöhten crit-damage.\n\njegliche sachen hier sind definitiv nicht beleidigend gemeint, sollte es so rüberkommen, so tut es mir leid. ich wusste leider nur bei deiner match-history nicht, ob ich lachen oder weinen sollte...\nsolltest du mich nach dem post hier nicht bereits hassen, dann kannst du mich in-game adden und ich kann versuchen dir ein paar tipps zu geben, dazu dürfte ich als popeliger silber-spieler noch in der lage sein.\n\nMfG,\n\nStein","replies":[]},{"poster":"Ireliα","date":"2016-01-06T01:57:37.786+0000","up_votes":1,"down_votes":0,"body":"Aua, deine Runen tun wirklich weh. \nWenn du auf mein Profil gehst und dir meine Runen anguckst siehst du auf den ersten beiden Seiten die Standard AD und Standard Ap Varianten (Sie heißen auch so). Diese sind die Grundseiten, wenn du was spezifischeres haben möchtest kommst du wohl um mehr Runenseiten kaum herum.","replies":[]},{"poster":"Flakies12","date":"2016-01-05T22:48:22.287+0000","up_votes":1,"down_votes":0,"body":"Genauso wie du in normal Games viel Dmg machst o.O","replies":[]},{"poster":"ClAO KAKAO","date":"2016-01-05T22:44:55.670+0000","up_votes":1,"down_votes":0,"body":"Es wäre schon ziemlich nützlich Runen gekauft zu haben für Ranked, ja ^^","replies":[]}]}