{"poster":"D3Di","date":"2018-10-01T11:25:57.761+0000","title":"Sind Reports weniger wert wenn der Honor Rang niedriger ist?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":2,"body":"Merkw&uuml;rdigerweise erhalte ich selten bis nie report feedback f&uuml;r Leute die extrem toxisch in Games geschrieben haben. Ich bin nahezu t&auml;glich mit Chatlogs konfrontiert f&uuml;r die ich bereits gebannt wurde. So langsam bekomme ich das Gef&uuml;hl, dass die Reports von Spielern die niedrigere Honor Levels haben, schlichtweg ignoriert werden. \r\n\r\nKennt sich jemand damit aus oder hat eine verl&auml;ssliche Quelle zu bieten in der man das nachlesen kann?","replies":[{"poster":"Izaya Kumiho","date":"2018-10-01T11:57:12.579+0000","up_votes":4,"down_votes":2,"body":">Sind Reports weniger wert wenn der Honor Rang niedriger ist?\n\nNein. \n\n>Merkwürdigerweise erhalte ich selten bis nie report feedback für Leute die extrem toxisch in Games geschrieben haben.\n\nDas ist nicht merkwürdig, sondern normal. Das dient unter anderem zum Schutz der Privatsphäre. **Jeder Report zählt**, egal welches Honorlevel du hast, bzw dein Gegenüber besitzt. Die Benachrichtung selten zu bekommen, ist also fällig normal. (Dazu kommen noch weitere Dinge, die ich gleich aufzähle...)\n\n\n\n>Ich bin nahezu täglich mit Chatlogs konfrontiert für die ich bereits gebannt wurde. So langsam bekomme ich das Gefühl, dass die Reports von Spielern die niedrigere Honor Levels haben, schlichtweg ignoriert werden. \n\nMit Honor hat das schlichtweg nichts zutun.\n\nDie Sache ist die: Es kommt auch nicht zwingend auf die Stärke der Worte an, sondern auf die **Anzahl an Games** in welchen sich ein Spieler reportbar macht.\n\n**Unser Strafsystem hat 4 (bzw. 5) Stufen:**\n\n- Verwarnung\n- CS (10, 25)\n- Tempban\n- Permaban\n\n\nDu kannst in 4 Games alle Stufen skippen und bekommst bei Hatespeech sofort einen Tempban ohne die Stufen davor je gehabt zu haben.\n(Beim ersten Verbrechen (ohne Hatespeech) ist es eine Verwarnung, dann die CS (10-25) usw. Das soll dem Spieler die Möglichkeit geben, sich dem erwünschten, sozialen Umgang in der Community anzupassen.)\n\nWorauf ich nun hinaus möchte? Well..\n\nWenn also ein Spieler nur einfach einen schlechten Tag hatte und dich einfach nur als einen \"doofen Spieler\" bezeichnet hat, dann wird das System ihm vielleicht nur eine Verwarnung oder CR geben.\n\nWenn es sich um einen Wiederholungstäter handelt, wird das System mit stärkeren Strafen arbeiten. \nDas heißt z.B: \"Du hattest einen Tempban und dein Verhalten hat sich nicht gebessert. Nun bist du erneut auffällig geworden und wirst aus der Community ausgeschlossen.\".\n\nGenau wie du wahrscheinlich nicht möchtest, dass dein Gegenüber von deinem Ban bescheid weiss, gilt das selbe Recht auch deinem Gegenüber. Was dir/Ihm passiert, geht niemanden etwas an.\n\nAuch wenn es kein Ban ist, wird alles geheim gehalten, um die Privatsphäre einer Person möglichst zu schützen.\n\n\n**Fakt ist aber, dass kein gerechtfertigter Report ignoriert wird.**\n\nEs gibt nur einfach keine öffentlichen Hinrichtungen. \n(Zumal viele Leute vielleicht in dem Augenblick sauer auf Spieler XY sind und sich dann sofort 'nem Perma für ihn wünschen, obwohl er noch nie davor eine böse Tat erledigt hatte...das wäre ja auch nicht fair und würde nur zu einem angry mob werden. Das führt dann vielleicht noch zu Hetze und Mobbing.)","replies":[{"poster":"D3Di","date":"2018-10-01T12:05:14.677+0000","up_votes":3,"down_votes":0,"body":"Danke, sehr ausführlich und informativ","replies":[]}]},{"poster":"67105 TOXIC","date":"2018-10-03T08:05:09.087+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Pure Cynicism","date":"2018-10-03T08:20:23.518+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=67105 TOXIC,realm=EUW,application-id=KYnfKGf0,discussion-id=8BXfKEHM,comment-id=0003,timestamp=2018-10-03T08:05:09.087+0000)\n>\n> mir kommt es eher so vor als ob riot einen schneller bannt mach dem ersten perma ( erster perma nach ca 300 rankets ) danach mehrmals vor lvl 30 gebannt.\n\nWenn man mal eine Minute nachdenkt, macht das auch Sinn. Ich hab auf meinem Account seit Season 1 bestimmt mehrere tausend, wenn nicht zehntausend Spiele gespielt, ohne eine Strafe erhalten zu haben. Wenn ich jetzt zu flamen beginnen würde, würde es lange dauern, bis die Flame/Spiele-Relation hoch genug ist. Auf einem frischen Account ist diese Schwelle viel niedriger, weil du kaum Spiele gespielt hast. Da du dein Verhalten offensichtlich nicht änderst, kommt der Bann eben schneller.","replies":[]}]},{"poster":"G2 Slippi","date":"2018-10-01T12:02:34.560+0000","up_votes":3,"down_votes":1,"body":"Meistens sind es \"nur\" CR und für diese bekommt man keine Feedbackmeldung.\nDeshalb kommt es auch nicht so oft vor, dass man Feedback für einen erfolgreichen Report bekommt.\nJedoch bin ich auch der Meinung, dass jeder Report gleichwertig ist, wobei es egal ist ob ein Spieler 1x oder 9x reported wird. Deshalb bringen auch die ganzen Reportaufrufe rein gar nichts, außer dass der Spieler der sowieso schon toxisch war, noch mehr getriggert wird.\n\nLG Slippi","replies":[{"poster":"D3Di","date":"2018-10-01T12:05:40.822+0000","up_votes":1,"down_votes":0,"body":"Danke für den Kommentar","replies":[]}]},{"poster":"Qbert","date":"2018-10-01T11:40:52.658+0000","up_votes":1,"down_votes":0,"body":"Es gibt dazu zumindest nichts seitens Riot, ich behaupte aber auch mal, dass jeder Report die gleiche Wertigkeit besitzt, so er denn gerechtfertigt ist.\n\nDiese Meldung bekommt eben auch nur DIE Person, die mit ihrem Report das Fass zum Überlaufen bringt und wodurch der Spieler dann bestraft wird.\n\nHabe ich am WE bspw. 3x erhalten diese Meldung, ich war schon etwas schockiert, da ich echt nicht so viele spiele ._.","replies":[{"poster":"eingew","date":"2018-10-02T07:26:33.012+0000","up_votes":1,"down_votes":0,"body":"Naja, Riot hat nicht spezifisch gesagt, ob das Honorlevel Einfluss darauf hat, wie \"wichtig\" deine Reports sind. Riot hat aber spezifisch gesagt, dass jeder Report eine Überprüfung auslöst. Ich würde also sagen, dass alle Reports gleich wichtig sind. [Hier:](https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/t4INpYH4-i-have-heard-that-saying-ggez-is-against-the-tos?comment=000300000000000000000001)\n\n> [{quoted}](name=Riot Tantram,realm=NA,application-id=ZGEFLEUQ,discussion-id=t4INpYH4,comment-id=000300000000000000000001,timestamp=2017-05-10T00:21:37.555+0000)\n>\n> There&#x27;s no such thing as report value.\n> \n> Reports trigger reviews of the game.","replies":[]},{"poster":"D3Di","date":"2018-10-01T11:52:09.646+0000","up_votes":1,"down_votes":0,"body":"Ok, danke für die Antwort. Ich denke auch das es Sinn macht wenn alle gleich gewertet werden aber ich wundere mich wirklich wenn ich keine Meldungen bekomme wenn ich sehe das jemand wirklich ausfallend beleidigend wird. \n\nNunja, dann hoffe ich mal das Riot seinen Job macht und ich ein wenig dazu beitragen konnte.","replies":[]}]}]}