{"poster":"D3Di","date":"2017-07-22T16:22:35.065+0000","title":"Danke für die tolle Forumserfahrung","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo Forum,\r\n\r\nich dachte ich bedanke mich mal &ouml;ffentlich f&uuml;r die konstant tollen Diskussionen die man hier konstruktiv und ohne administrative Eingriffe f&uuml;hren kann. Es ist sch&ouml;n einen Ort zu haben, an dem einem zugeh&ouml;rt und geholfen wird. Mir wurden hier wahrhaftig die Augen ge&ouml;ffnet und mir wurde endlich klar, welch schlechter Mensch ich bin. Mir war es vorher nie bewusst und gl&uuml;cklicherweise wurde ich von einigen aktiven Forumsmitgliedern gel&auml;utert. Meine Seele ist nun rein und ich kann weiterziehen in das Blumenfeld welches manche Kluft nennen. Ich werde Frieden stiften und meinen neuen Glauben unter den Beschw&ouml;rern verbreiten. Welch einschneidendem Erlebnis durfte ich beiwohnen... \r\n\r\nOhne jegliche H&auml;me gr&uuml;&szlig;t,\r\nGnaeus","replies":[{"poster":"legofreak1","date":"2017-07-22T16:26:52.568+0000","up_votes":3,"down_votes":1,"body":"Wieso habe ich mit einem Thread dieser Art gerechnet?\nDie meisten Leute hier wollen dir helfen, wenn du dieser Hilfe mit Sarkasmus, Ironie und Häme begegnest, diese konsequent nicht annehmen möchtest und keine Einsicht zu deinem schlechten Verhalten zeigst, dann wird die Diskussion von Seite der Moderatoren geschlossen.","replies":[{"poster":"D3Di","date":"2017-07-22T16:33:15.626+0000","up_votes":1,"down_votes":2,"body":"Ich behaupte jetzt mal, dass ich keine \"Hilfe\" erhalten habe, sondern blame, welcher mir ja schließlich attestiert wurde. Feuer mit Feuer zu bekämpfen halte ich nicht für sinnvoll, daher Sarkasmus. Leider wurde der einzige Kommentar, den ich wirklich ernst nehmen konnte, unmittelbar nach dessen Erstellung gelöscht. Als ich Antworten wollte, war der thread bereits geschlossen. Shoutout to Eingew.","replies":[{"poster":"legofreak1","date":"2017-07-22T16:38:41.830+0000","up_votes":2,"down_votes":0,"body":"Gelöscht wurde dort nichts.\nEs gab auch vorher bereits Kommentare, die hilfreich waren und dir aufgezeigt haben, wo deine Fehler waren bzw was zu deiner CR geführt hast. Diese hast du nur nicht wahrgenommen.","replies":[{"poster":"AI Yjuq","date":"2017-07-22T17:04:45.322+0000","up_votes":2,"down_votes":0,"body":"Oder es mangelt ihn an Empathie. Das war bei mir auch lange der Fall und ich musste wirklich lernen (per Psychologe) mich in anderen Menschen künstlich hinein zu versetzen. Da ist dann entsprechend sachlicher Erklärungsbedarf um einiges wichtiger. Darum verstehe ich nicht warum der Thread geschlossen wurde. Zudem darf man auch nicht vergessen dass geschriebene Texte nun mal unterschiedlich von Mensch zu Mensch interpretiert werden. Was für dem einen neutral klingt, kann für den anderen schon extrem angreifend wirken (auch abhängig nach der Gefühlslage des Leser in dem Moment). Deshalb kann ich an einigen Stellen seine Ablehnung nachvollziehen, ob es nun berechtigt war ist eine andere Geschichte.","replies":[{"poster":"legofreak1","date":"2017-07-22T17:37:38.088+0000","up_votes":1,"down_votes":0,"body":"Geschlossen wurde der Thread, weil keine sinnvolle Diskussion mehr stattgefunden hat. Dem TE wurden sachliche Argumente geliefert bzw die Sachlage im allgemeinen erklärt und er hat pampig und ohne Einverständnis reagiert, keine Diskussion zugelassen und wollte nur seine Sichtweise bestätigen lassen. Natürlich hätte ich den Thread auch offen lassen können, in der Hoffnung dass sich da doch noch etwas ändert, solche Threads eskalieren dann aber erfahrungsgemäß und sind eine Moderationstechnische Katastrophe.\nDer Thread ist weiterhin vorhanden, der TE kann sich also jederzeit erneut die Kommentare ansehen und seine Meinung vielleicht ändern bzw wenn er zu einer Diskussion bereit ist ein neues Thema eröffnen.","replies":[]}]}]}]},{"poster":"LosMichus","date":"2017-07-22T16:32:02.862+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=legofreak1,realm=EUW,application-id=7hciEY9w,discussion-id=3sWJYWyr,comment-id=0000,timestamp=2017-07-22T16:26:52.568+0000)\n>\n> Wieso habe ich mit einem Thread dieser Art gerechnet?\n> Die meisten Leute hier wollen dir helfen, wenn du dieser Hilfe mit Sarkasmus, Ironie und Häme begegnest, diese konsequent nicht annehmen möchtest und keine Einsicht zu deinem schlechten Verhalten zeigst, dann wird die Diskussion von Seite der Moderatoren geschlossen.\n\nBin mir nicht sicher ob er das Sarkastisch meint :/","replies":[{"poster":"D3Di","date":"2017-07-22T16:33:43.603+0000","up_votes":1,"down_votes":1,"body":"xDDD","replies":[]}]}]},{"poster":"franticFurball","date":"2017-07-22T17:18:41.358+0000","up_votes":1,"down_votes":0,"body":"Was hast du denn erwartet bei deinen Beiträgen?\n\nDer Unterton war entweder _\"Ich hab sowieso recht!!!!\"_ oder _\"Ich werd hier nur runtergemacht!!!!\"_...wobei insbesondere zweiteres einfach nciht stimmt. Die Leute haben dir in klaren, ruhigen Worten die Sachlage dargelegt wie sie ist.\n\nUnter den Umständen ist keine vernünftige Diskussion führbar.\n\nUnd zum Thema der Forenmoderation...angesichts solcher Posts von dir:\n\nhttps://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/A4KUvgw8-yasuo-wird-nicht-gebannt-weil-er-zu-stark-ist?comment=000a00000001\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/XxWUIUMT-schlechte-mates?comment=00010001\n\n...darf dich ein Schliessen von Threads nicht wundern.","replies":[{"poster":"PanGea Z3rO","date":"2017-07-22T17:28:56.756+0000","up_votes":1,"down_votes":2,"body":"Oh, du verfolgst mich auch, nicht wahr?\n\nIch weiß nicht woher du kommst, aber in Deutschland darf man seine Meinung, auch wenn sie nicht deiner Meinung entspricht, kund tun. Daher finde ich es schon etwas peinlich, wenn ich deiner Haut stecken würde und nahezu alle meiner Beiträge downvotest oder sogar meldest. \n\nEs tut mir außerordentlich leid, dass du nicht mit den Meinungen andere umgehen kannst und sie daher unterdrücken möchtest.","replies":[{"poster":"franticFurball","date":"2017-07-22T17:31:54.794+0000","up_votes":2,"down_votes":0,"body":">Oh, du verfolgst mich auch, nicht wahr?\n\nSportsfreund, du bist in meinem Thread aufgetaucht und hast dort deine Kommentare abgelassen.\n\nUnd jetzt hat halt der Ton in diesen Beiträgen zum logischen Forenban geführt.\nDie Vernünftige Entscheidung wäre es jetzt, das in Zukunft bleiben zu lassen...anstatt in einem Zweitaccount gleich mal weiterzuflamen.\n\n>Ich weiß nicht woher du kommst, aber in Deutschland darf man seine Meinung, auch wenn sie nicht deiner Meinung entspricht, kund tun. \n\nDu kannst deine Meinung so oft und so laut kundtun wie du willst.\nDir muss halt klar sein, dass dasselbe Recht das du in Anspruch nimmst auch für andere gilt.\n\n>oder sogar meldest. \n\nOb deine Beiträge gemeldet werden oder nicht, kann dir eigentlich völlig egal sein, es sei denn natürlich sie widersprechen den Forenregeln...","replies":[]},{"poster":"Sirrkas","date":"2017-07-22T17:41:11.466+0000","up_votes":2,"down_votes":1,"body":"Besuch mal einen Grundkurs zum Rechtswesen. Eine der ersten Sachen die man da lernen sollte wäre, dass das Recht auf Meinungsfreiheit nur gegenüber dem Staat gilt, es dort endet, wo du die Rechte anderer beschneidest und niemand verpflichtet ist, dir eine Plattform für deine \"Meinung\" zu bieten.\n\nhttp://imgs.xkcd.com/comics/free_speech.png\n\nVielleicht hilft dir der Comic besser, das zu verstehen.\n\nSolltest du mit dem Gedanken spielen, noch mal über deinen Chatlog reden zu wollen, empfehle ich dir, das in einem neuen Thread zu machen. Nimm dir aber davor bitte etwas Zeit um dir die Sache durch den Kopf gehen zu lassen, vielleicht ein oder zwei Tage.","replies":[]},{"poster":"legofreak1","date":"2017-07-22T17:32:08.030+0000","up_votes":2,"down_votes":1,"body":"\"Meinungsfreiheit\" bedeutet aber nicht, dass man ungehindert beleidigend werden darf. Die persönlich Meinung hört dort auf, wo die Gefühle und Rechte anderer anfangen. Jemanden einen Fettsack zu nennen mag zwar unter Umständen korrekt und/oder eine Meinung sein, ist aber auch beleidigend.","replies":[]}]}]},{"poster":"AI Yjuq","date":"2017-07-22T17:00:23.539+0000","up_votes":1,"down_votes":0,"body":"Servus, ich hab mir mal den Thread durchgelesen. Komplett + alle Kommentare und ehrlich gesagt verstehe ich folgende Dinge nicht:\n1. Warum die Diskussion geschlossen wurde\n2. Weshalb du dich in meinen Augen an einigen Stellen so stur stellst\n\nMeines Erachtens nach war Sirrkas Antwort die am zutreffendste: [Link zum Comment](https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/vwMv7b2q-begrandung-einer-chat-restriction?comment=00000000000000000000)\n\nKlar lässt sich Blame & Flame jeweils anders interpretieren da es tatsächlich keine eindeutige Grenze bzw. Definition dafür gibt. Jeder Mensch nimmt Blame und Flame anders wahr. Was dich vielleicht richtig sauer macht könnte für einen anderen Menschen nun mal nicht so tragisch sein, andersrum aber genau so. Da es eben diese Definition nicht gibt definiert die gesamte Community selber was negativ angesehen wird. Dies wird durch die Reports entschieden und entsprechend auch bestraft. Die Punkte die Sirrkas da angesprochen hat würde ich ebenfalls als negativ empfinden und halte ich reportwürdig. Natürlich ist auch der restliche Kontext ebenfalls entscheidend, aber eine komplette ausführliche Erläuterung dazu gebe ich hier nicht mehr einfach aus dem Grund dass der Thread geschlossen wurde (warum auch immer).\n\nFalls es dir an Empathie mangelt und du gerne eine ausführliche und \"objektive\" (Gibt's so nicht da alles natürlich irgendwo auch subjektiv ist) Betrachtung meinerseits hören möchtest, lass es mich wissen. Dann können wir uns auf einen TeamSpeak Server gerne privat unterhalten.","replies":[{"poster":"PanGea Z3rO","date":"2017-07-22T17:10:53.318+0000","up_votes":1,"down_votes":2,"body":"Hallo, danke für deinen Kommentar. \n\nLeider kann ich dir nicht auf dem anderen Account antworten weil mich dieser Kindergarten hier mit einem Forumsban belegt hat. Ich denke man muss nicht hervorheben wie wenig reif und schlichtweg lächerlich solch ein Verhalten ist. \n\nMachen wir Menschen mit anderen Meinungen lieber mundtot als sich mit ihnen auseinander zu setzen. \n\nWelcome to Turkey...","replies":[{"poster":"AI Yjuq","date":"2017-07-22T17:15:14.427+0000","up_votes":1,"down_votes":0,"body":"Für wie lange?","replies":[{"poster":"PanGea Z3rO","date":"2017-07-22T17:18:24.023+0000","up_votes":1,"down_votes":1,"body":"24h wenn ich es richtig gelesen habe","replies":[]},{"poster":"PanGea Z3rO","date":"2017-07-22T17:17:41.747+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=AI Yjuq,realm=EUW,application-id=7hciEY9w,discussion-id=3sWJYWyr,comment-id=000100000000,timestamp=2017-07-22T17:15:14.427+0000)\n>\n> Für wie lange?\n\n24h wenn ich es richtig gelesen habe","replies":[]}]}]}]},{"poster":"Chronicol","date":"2017-07-22T17:15:28.681+0000","up_votes":1,"down_votes":1,"body":"Wirklich teilweise solche netten Leute hier. :)\nVorallem sind manche Kommentar so usefull: legofreak1 gel","replies":[]}]}