{"poster":"Bote des Chaos","date":"2017-06-19T12:27:59.161+0000","title":"Warum wird in LoL nur mit Vorteilen anstatt mit Nachteilen gebalanced?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Hallo Leute,\r\nviele beschweren sich &uuml;ber das Balancing in LoL, teils weil Skillchamps lange nicht so belohnend sind, wie sie sein sollten, teils auch weil &quot;Komplexes Champdesign&quot; scheinbar kein Counterplay bietet oder Champs einfach &Uuml;berladen sind (Beispiel hierf&uuml;r sind die meisten Champs, welche neu erscheinen).\r\n\r\nRiot nutzt als Balancing-Tool fast immer Vorteile. Das hei&szlig;t, dass einem Champ Vorteile entzogen werden um ihn zu nerven, Vorteile gegeben werden um ihn zu buffen. Diese Vorteile k&ouml;nnen Schadenswerte sein, es kann aber auch die Reichweite, die Basis-Werte des Champs, der Cooldown, die Dauer eines CCs sein. Klassisches Beispiel ist hierbei z.B. die Erh&ouml;hung von Katas E-Cooldown, oder einfach die erh&ouml;hung des Scalings auf Rek`Sais W.\r\n\r\nSelten nutzt Riot mal einen Nachteil um etwas zu balancen. Dennoch kommt es vor:\r\n{{item:3193}} Dieses Item verringert euren Schaden betr&auml;chtlich, wenn ihr die Aktive einsetzt, daf&uuml;r bekommt ihr aber auch gro&szlig;e mengen an Leben, was  wohl die einzige Mechanik ist, um absoluten Schaden (welchen ihr selbst erleidet) zu verringern. immerhin sind die 100 TrueDMG bezogen auf euer Leben nur noch halb so viel, wenn ihr von mind. 3 Gegnern umringt seid und den Effekt verwendet. Ihr habt hier aber einen Tats&auml;chlichen NACHTEIl wenn ihr dieses Item einsetzt. Auf einem Champion wie Rumble w&auml;re das deutlich sp&uuml;rbar, einen Nautilus st&ouml;rt das aber eher weniger.\r\nEin Grenzbeispiel:\r\n{{champion:2}}  die Ultimate von Olaf ist stark. Er kann damit auf die Carrys zurennen und zerhackt ihn, ohne dass Stuns, Slows oder andere CC ihn daran hindert. Die F&auml;higkeit hat aber einen Nachteil: die Passive f&auml;higkeit der Ult (zus&auml;tzliche R&uuml;stung und MR) geht verloren, der Vorteil wird euch genommen.\r\n\r\nNun meine Frage an euch:\r\nWas haltet ihr davon? Sollte Riot h&auml;ufiger einen Nachteil in die Nutzung eines Gegenstandes oder einer F&auml;higkeit einbauen? Ist das Sinnvoll und k&ouml;nnte helfen die Balancingprobleme zu l&ouml;sen? Oder haltet ihr das f&uuml;r weniger gut und sollte eher vermieden werden?","replies":[{"poster":"Hakkuu","date":"2017-06-19T12:40:11.094+0000","up_votes":2,"down_votes":0,"body":"Ich finde Nachteile wie sie momentan sind eigentlich ganz gut, denn\n\n1. Basiert das Spiel vor allem auf den Cooldown der Fähigkeiten des jeweiligen Champions - also quasi schon ein \"Nachteil\": Benutzt du mit Zed deine w aggressiv um zu poken bringt das den Nachteil mit sich, dass du verwundbar für ganks bist. Cooldowns cappen sozusagen die Vorteile jedes Champions.\n\n1. Gibt es derzeit schon sehr viel mehr Nachteile, als man vielleicht denkt: Xeraths Q slowt ihn selbst, seine Ult macht ihn bewegungsunfähig und somit angreifbar. Urgots Ult stunt ihn während der Castdauer selbst. Lissandras E und Zeds Ult Schatten ermöglichen viel Counterplay dadurch, dass der Gegner sieht, wohin sie sich teleportieren können.\n\n1. Finde ich es interessant, wie Riot momentan Nachteile einsetzt. Nämlich um den Charakter eines Champions oder Items zu entwickeln und weiter zu verdeutlichen. Olafs Ultimate beispielsweise: Er verliert zu einem Teil die Kontrolle über sich selbst und verfällt in Raserei -> Logische Folge: Er macht zwar mehr Schaden, ist aber in seiner blinden Aggressivität auch verwundbarer","replies":[{"poster":"Bote des Chaos","date":"2017-06-19T13:29:38.254+0000","up_votes":1,"down_votes":0,"body":"Bei 1. kann ich dir nicht so ganz zustimmen, denn ich würde den Cooldown dann eher mit anderen Vergleichen... \nBeispiel: Galios Ult hat den Vorteil, dass er einen Geringeren Cooldown hat. Dafür hatt Shen eine größere Reichweite, da seine Ult Global nutzen kann. Dennoch verstehe ich was du meinst, da der Cooldown, zusammen mit den Kosten die Grenzen eines Champs festlegen.\nBei 2. und 3. stimme ich dir voll und ganz zu. Natürlich war meine Aussage, dass es sehr selten vorkomme überspitzt, dennoch finde ich, dass es häufiger vorkommen könnte. Mittlerweile hat auch Rammus zum Beispiel einen selbstslow und Blizcranks Schub ist ebenso offensichtlich. Warum wird das aber nicht bei mehr champs so gemacht? beispielsweise bei den \"Ohne Recourchen\" Champs wie Yasuo, Kata oder Riven? Klar haben die drei ihre eigenen Stärken und Schwächen... aber garkeine Kosten nervt schon echt. Verstehst du wie ich das meine?","replies":[]}]},{"poster":"Euronymus88","date":"2017-06-21T11:26:33.992+0000","up_votes":1,"down_votes":0,"body":"Ich finde die Balance im Grossen und Ganzen in Ordnung.\nUmso mehr Content und Spielinhalt es gibt umso schwerer wird es eine möglichst perfekte Balance zu schaffen.\nEs gibt daher praktisch in jedem Spiel eine Meta, auch wenn die Unterschiede nicht gravierend sind. \nDie Profis werden immer auch die kleinsten Vorteile ausnutzen, daher sieht man auch von Patch zu Patch wieder wechsel in der Meta.\n\nSolche Nachteile die du aufzählst gibt es zahlreiche und es kann durchaus Sinn machen über solche Aspekte zu Buffen/Nerfen, dass sowas automatisch die Balance verbessert ist in meinen Augen aber nicht zwingend so, denn selbst wenn du jetzt den CD von Fizz E erhöhst machst du das ja auch irgendwie, da wenn er diesen Spell benutzt hat ja deutlich anfälliger ist und da gibt es halt zahlreiche andere Beispiele wie das von Zed usw.\n\n\nBei {{item:3193}} ist eigentlich klar das es einen Malus braucht, da man damit ja kurzfristig ab 3 Gegner doppeltes Leben erhält und gerade als Tank der sonst schon einiges aushält und wahrscheinlich schon einige HP Items hat nur enorm stark. Seit dem neusten Patch skaliert {{item:3190}} stark mit HP was nun bedeutet, dass wenn man erst Gargo und danach Iron Solari zündet (was natürlich erst im Lategame wirklich was bringt) einen enormen Schild als Tank allen nahen verbündeten gibt, ob das so bedacht wurde bin ich mir jetzt nicht sicher, denn man gibt allen in der Nähe ein Schild von Rund 2,5- 3,0k .\n\nSowas wird zwar nie bei den Profis gemacht, da sowas einfach viel zu langsam ist aber in Endeffekt ist der Malus in Kombi mit Iron Solari im Endgame einfach nur lächerlich dafür das ich nahezu unsterblich bist und deinem Team einfach mal einen übertriebenen Schild  gibst, ob solche Items also die Balance fördern muss man von Situation zu Situation entscheiden, aber gerade bei deinem genannten Beispiel ist es wohl eher das Gegenteil :P zumind. im Endgame mit Solaris.\n\n\n\nAber im Endeffekt ist das auch schwer zu sagen, da wir auch Champions haben die im early schwach sind und im Lategame wirklich krass sind, aber auch da gibt es genügend Counterplay meiner Meinung nach.\nJa Yi ist ein gutes Beispiel du farmst dich im Jungle hoch machst ein paar Objektives und ab lvl 6 gankst du Lanes (bevorzugt mit genügend CC).\n\nSelbst wenn dein early nicht besonders gut verlaufen ist skalierst du enorm ins Lategame und machst enorm Schaden. Aber genau wie bei Yasuo (welcher aber deutlich mehr Skill als Yi erforder)bist du Fragil und enorm anfällig gegen CC, klar kann man sowas Klug gespielt auch umgehen aber öfter wird dir das nicht gelingen.\n\nPickst du eine Leona in den Yi da wird der sich im Regelfall die Zähne an dir ausbeissen.\nAuch ne Lulu , Thresh oder sonstige CC starke Champions können Yi rausnehmen.\nZugegeben ist er sehr einfach zu spielen und skaliert extrem, daher sicher ein guter Solo Q Pick im Low Elo, es gibt in meinen Augen genügend Countermechaniken gegen Yi nur muss man Sie auch verwenden.","replies":[]},{"poster":"Alustus","date":"2017-06-19T12:54:43.937+0000","up_votes":1,"down_votes":0,"body":"Mal davon abgesehen das es kaum balance probleme gibt, sind skillchamps sehr wohl belohnend teilweise sogar zu sehr.\n\nDamit Skillchamps allerdings belohnend sind braucht man skill und spielwissen, was unter high Dia kaum zu finden ist.\nKlar ist es in der Low wlo leichter einen Champ zu spielen der kaum championseitige anforderungen benötigt.\nAber aus einem \"Noobchamp\" kannst du auch nicht soviel rausholen, sprich er skaliert nicht so stark mit skill und bietet beispielsweise wenoger möglichkeiten für ein outplay.\n\nDas fähogkeiten zweischneidige schwerter sind kommt auch nicht so selten vor wenn man alle champs/fähigkeiten durchgeht.","replies":[{"poster":"Bote des Chaos","date":"2017-06-19T13:17:45.381+0000","up_votes":1,"down_votes":0,"body":"Da ich selbst noch nicht soooo lange spiele, nicht besonders gut bin und auch nicht ausdauernd genug spiele (ich bevorzuge abwechslung, außer wenn ich Ranked spiele) um allzuschnell Fortschritte zu machen, kann ich das natürlich nur aus meinem Standpunkt aus betrachten. Ich empfinde aber eine Vi im Jungle als recht einfach, ein Master Yi ist in meiner Elo im Lategame ein absolutes Monster. Diese Champs sind aber in der LCS quasi nicht existent. Ein Aurelion Sol ist in der LSC selten zu sehen, hat aber auch im SoloQ eine der niedrigsten Pick-Rates. \nIch empfinde so etwas schon als \"Balancingproblem\"\nIch kann ja verstehen, dass es sowas wie Garren geben sollte, auch dass beispielsweise Champs wie Azir oder Aurelion schwer zu balancen sind. Dennoch halte ich es für ein Problem, dessen Lösung das Spiel definitiv verbessern würde....","replies":[{"poster":"RM Heartmeander","date":"2017-06-19T13:29:28.233+0000","up_votes":1,"down_votes":0,"body":"Das Problem an Champs wie Master Yi ist, dass auch diese nicht balanced sind.\nIch denke da an die Zeit zurück mit dem Jungleitem, dass jeden 2ten Hit doppelt gemacht hat.\nIn der LCS kann man nicht so viel machen, da er nicht viele Optionen hat wie andere Jungler.\nUnd für solo q ist er zu stark wegen seiner q womit er Spells ausweichen kann.\n\nUm für LCS interessant zu werden, müsste er so was wie Naut q auf der Ult haben, sprich CC der am besten Ranged ist.\n\nIch finde aber auch, dass manche Champs ein Balacingproblem haben die auf dmg aufgebaut sind.\nEben bsp. Yi oder Yasuo.\nAuch wenn die hinten liegen, sobald die 1-2 Kills haben rasten die zumindest in solo q aus.\nSnowball ist ja gut und recht aber wo ist der Counterplay, wenn man unangreifbar wird?\n\nDas gleiche Problem ist ja auch bei Olaf aber der wird deswegen in der LCS gespielt, da er relativ sicher in die Backline kommt mit der Ult.\nAber ich finde es auch recht, dass nicht jeder Champ in der LCS vertreten ist.\nImmerhin sollte es ja auch Champs gegen die einfach designt sind wie Garen um für Neulinge attraktiv zu sein.\n\nAber gestern wurde z.B. Blitzcrank in der LCS gespielt was ne Überraschung war.\nSo etwas ist dann halt schon erfrischend.","replies":[]}]}]}]}