{"poster":"Brincas","date":"2015-08-09T21:05:08.394+0000","title":"Disqualifikation da Gegner zu spät waren???","subforum":"Battlegrounds-Turniere","up_votes":2,"down_votes":8,"body":"Mein Team hat bei den Battleground Tunier mitgemacht und ich m&ouml;chte mich hier in aller Form beschweren. Ich finde absolut schlecht organisiert, wie schon das Erste. Zuerst, dass man NIE eine Antwort von der Battlegroundmail bekommt, da ich versucht habe das Spiel zu verschieben. Nichts desto trotz konnte ich es mit einem Sub schaffen, um 18 Uhr 5 Leute in die Lobby zu bekommen, was alleine schon sehr Schade ist, da wir mit Hauptbesetzung eine reelle Chance gegen die high Dia Gegner gehabt h&auml;tten. Wor&uuml;ber ich aber wirklich sauer bin ist, dass ich einen Termin um 19 Uhr hatte, womit ich 1h f&uuml;r das Spiel zur Verf&uuml;gung hatte, was eig vollkommen langt. Da aber unsere Gegner sogar NACH 18.10 immer noch nicht vollz&auml;hlig waren, und das sogar unser zust&auml;ndiger adj best&auml;tigen kann, wurde es immer knapper. W&auml;hrend der adj in der Lobby war, so gegen 18.15, kam dann der letzte Spieler von unseren Gegnern und ich musste feststellen, dass ich das einfach nicht mehr schaffe, wenn das spiel um ca 18.20 beginnt. Deshalb habe ich in der Champion Select das Spiel verlassen, weil es dann auch kein Sinn mehr hat, dass Spiel unter wahnsinnigen Zeitdruck zu spielen. Ich finde es halt einfach nur sehr gemein, dass unsere Gegner der Sieg zugesprochen bekommen, obwohl diese unp&uuml;nktlich waren, weil ich noch einen Termin hatte. Und laut Battlegrounds Regeln m&uuml;sste auch uns auch der Sieg zugesprochen werden, da sie zur Deadline nicht vollz&auml;hlig in der Lobby waren. Ja ich kann verstehen das man bei 15 min noch ein Auge zudr&uuml;cken kann, aber unter diesen Umst&auml;nden war es mir einfach nicht m&ouml;glich das Spiel zu spielen, da es sonst einfach zu sp&auml;t geworden w&auml;re.\r\n\r\nmfg\r\n\r\nBrincas","replies":[{"poster":"Baisi","date":"2015-08-09T21:32:26.268+0000","up_votes":7,"down_votes":0,"body":"Ich Persönlich kann deine Wut nachvollziehen, jedoch ist dieses Battleground besser Organisiert als das Letzte und an sich ist es sehr gut meiner Meinung nach Organisiert.\nIn der Regel gilt, dass wenn um 18.10 das Spiel nicht gestartet hat weil ein Team unvollständig ist das die anderen Gewinnen, soweit liegst du richtig, jedoch möchten die Adjus nur ungerne einen Team einen Free Win geben wenn die Gegner es doch noch schaffen vollzählig zu sein. In den Regeln steht auch, dass die Adjus das letzte Wort haben und sogar über den Turnierregeln stehen. Riot nimmt an das du/ihr genug Zeit habt um das Spiel zu spielen, immerhin kann ein Game auch mal mehr als 1 Stunde dauern. \nIn einen anderen Thread stand richtig, dass es das Ziel sei das beste Team zu finden unnd nicht das was sich exakt an die Regeln hält.","replies":[]},{"poster":"GummibaumXYZ","date":"2015-08-09T21:42:02.152+0000","up_votes":9,"down_votes":2,"body":"Hallo Brincas,\n\n1. Von welcher Battlegroundsmail sprichst du? Wir haben mehrmals erwähnt, dass die Teams über das Forum, Facebook, Twitter und natürlich zur offiziellen Spielzeit im Chatraum des Clients mit uns Kontakt aufnehmen können.\n\n2. Wir Adjus geben den Teams, die annähernd vollzählig sind noch eine kurze Frist, das Spiel zu starten. Die Battlegrounds sind ein LoL Turnier und wir möchten selbstverständlich, dass möglichst viele Spiele gespielt werden und der Sieger des Turniers nicht einfach nur Glück hatte, dass die Gegner sich um ein paar Minuten verspätet haben.\n\n3. Euer Gegnerteam hat bereits um 18:10 Uhr darum gebeten ihr letztes Teammitglied einladen zu können. Um 18:12 Uhr waren alle spielbereit in der Lobby und das Spiel hätte losgehen können. Du selbst hast den Spielstart weiter hinausgezögert.\n\n4. Ein Spiel kann sowieso mehr als eine Stunde dauern. Insbesondere wenn man die Pick&Bann Phase mitrechnet, kommt das gar nicht so selten vor. Deshalb sollte man sich mehr als eine Stunde Zeit nehmen. Bei den Battlegrounds kommt auch noch die Möglichkeit der Pausenfunktion oder sogar eine Wiederholung des Spiels hinzu.\nIch kann wirklich nicht verstehen, warum du das Spiel nicht einfach gestartet und zumindest so lange gespielt hast, wie es dir zeitlich möglich war. Die Chance hätte ja durchaus bestanden, dass das Spiel vor 19:00 Uhr beendet ist. Durch dein Verhalten hast du jetzt deinem ganzem Team die Möglichkeit im Turnier weiterzukommen genommen. Genau für solche Fälle in denen die Zeit knapp ist, gibt es übrigens die Möglichkeit bis zu vier Ersatzspieler für das Turnier anzumelden.\n\n5. Zuletzt noch ein Zitat aus den Regeln: \"Adjudicators haben die höchste Entscheidungsgewalt - Sie können auch Entscheidungen treffen, die von den Regeln nicht abgedeckt werden. Diese Entscheidungen sind bindend, es hat daher keinen Sinn, darüber zu diskutieren.\"\n\nIch hoffe trotzdem dich und dein Team beim nächsten Qualifier wiederzusehen und dass ihr dann mehr Spaß an den Battlegrounds habt. \n\nViele Grüße Gummibaum","replies":[{"poster":"131ind","date":"2015-08-10T15:22:04.095+0000","up_votes":5,"down_votes":0,"body":"Ich gehöre zum Gegnerteam von Brincas. \nWir haben um 18:11 den letzten Spieler in die Lobby holen können. Dieser musste mehrmals relogen, weil er nicht mit dem Chat verbunden wurde. \n\nAlle Zeit stand ein Sub bereit, der hätte einspringen können. Da ich diesen leider nicht in meiner friendlist hatte, konnte ich diesen nicht einladen. Da wir auch auf Nachfrage keine weiteren Inviterechte bekommen haben hat es sich leider um 1 Minute verzögert. (Da konnte sich unser richtigen Spieler nach mehrmaligen relogen endlich einfinden)\n\nIch würde natürlich auch auf den Regeln behaaren, aber bei 1 Minute Verspätung, die ihr hättet selber verhindern können bitte ich dich.\n\nZudem möchte ich Brincas bitten vor Spielbeginn einmal die Regeln zu lesen, weil dort Dinge wie Seitenwahl geregelt waren. Außerdem fand dein Team das weniger nett von dir ;)","replies":[{"poster":"Cunctor","date":"2015-08-10T20:47:49.455+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=131ind,realm=EUW,application-id=U1AH627U,discussion-id=ENF8RpTT,comment-id=00010001,timestamp=2015-08-10T15:22:04.095+0000)\n>\n> Ich gehöre zum Gegnerteam von Brincas. \n> Wir haben um 18:11 den letzten Spieler in die Lobby holen können. Dieser musste mehrmals relogen, weil er nicht mit dem Chat verbunden wurde. \n> \n> Alle Zeit stand ein Sub bereit, der hätte einspringen können. Da ich diesen leider nicht in meiner friendlist hatte, konnte ich diesen nicht einladen. Da wir auch auf Nachfrage keine weiteren Inviterechte bekommen haben hat es sich leider um 1 Minute verzögert. (Da konnte sich unser richtigen Spieler nach mehrmaligen relogen endlich einfinden)\n> \n> Ich würde natürlich auch auf den Regeln behaaren, aber bei 1 Minute Verspätung, die ihr hättet selber verhindern können bitte ich dich.\n> \n> Zudem möchte ich Brincas bitten vor Spielbeginn einmal die Regeln zu lesen, weil dort Dinge wie Seitenwahl geregelt waren. Außerdem fand dein Team das weniger nett von dir ;)\n\nIn den Regeln wird auch empfohlen, 10 Minuten vor 18 Uhr in der Lobby zu sein, damit man solche Probleme frühzeitig lösen und das Drama vermeiden kann ;)\nAußerdem könnte man im Chatraum Bescheid sagen, sobald klar ist, dass man es nicht ganz bis 18 Uhr schafft.","replies":[{"poster":"131ind","date":"2015-08-11T15:42:22.022+0000","up_votes":1,"down_votes":0,"body":"Wir konnten ja nicht wissen dass einer von uns sich nicht mitm Chat Server verbinden kann.. Denke das ist nicht unser Fehler","replies":[]}]}]},{"poster":"SoneStar","date":"2015-08-09T23:54:44.367+0000","up_votes":2,"down_votes":6,"body":"> Ich hoffe trotzdem dich und dein Team beim nächsten Qualifier wiederzusehen und dass ihr dann mehr Spaß an den Battlegrounds habt.\n\n+1 Hinterher gleich noch eins auf die Fresse -_- \n\n@ Brincas \n\nIch empfehle dir and Turnieren teilzunehmen, bei denen es eine festgelegte Spielzeit gibt und klare Regeln. Ich selber habe noch nie an einem BG teilgenommen und werde dies auch sicherlich nicht. Es gibt viel zu viele Freiheiten in dem Reglement, alleine dieser Ausschnitt :\n\n> Adjudicators haben die höchste Entscheidungsgewalt - Sie können auch Entscheidungen treffen, die von den Regeln nicht abgedeckt werden. Diese Entscheidungen sind bindend, es hat daher keinen Sinn, darüber zu diskutieren\n\nführt einem vor Augen, wie unprofessionell die BG sind. Nimmst du an einem Massenturnier teil, so musst du auch mit der dem  entsprechenden Organisation auskommen.\n\nMFG SoneStar\n\nPS: Ich warte leider immer noch erfolgos auf den **Auserwählten-Adjudicator** der ein Team wegen eines Teemopicks disqualifiziert :D","replies":[{"poster":"Paniro","date":"2015-08-10T00:36:33.044+0000","up_votes":7,"down_votes":1,"body":"Heya SoneStar,\n\n\n> Ich empfehle dir and Turnieren teilzunehmen, bei denen es eine festgelegte Spielzeit gibt und klare Regeln.\n\nDie Spielzeiten sind festgelegt, 18:00 Samstag/Sonntag. Wir lassen Teams welche unvollständig sind jedoch noch etw. mehr Zeit, da wie gesagt das Match der Hauptpunkt eines Turniers ist, und so sollte dies auch falls möglich statt finden. \n\nMan muss nicht schon vor Samstag spielen, dies lassen wir jedoch zu, aber das müssen dann natürlich die Teams unter sich ausmachen.\n\nNochmals: Festgelegte Spielzeiten gibt es, Samstag/Sonntag 18:00. Wer keine 15min auf die Gegner warten kann, damit das Match möglich ist, sollte sich überlegen ob er wirklich die Zeit & den Willen für die Teilname an einem Turnier hat, denn man weiß nie wie lange ein LoL-Match gehen kann, denn besonders wenn jeder sein Bestes gibt können die Spiele locker an die 45min+ kommen.\n\nDie Regeln sind genauso klar, jedoch wenn man sich diese nicht durchliest sollte man sich dann nicht beschweren, dass man aufgrund Gründe wie z.B. ungültige Spieler disqualifiziert wird, denn jeder der sich diese durchliest weiß, welche Spieler gültig & welche ungültig sind. Falls man sich doch trotzallem nicht ganz sicher ist, kann man natürlich noch hier nachfragen, die Adjudicator-Armee wird einem dann schnellstmöglich antworten.\n\n> alleine dieser Ausschnitt : \"....\" führt einem vor Augen, wie unprofessionell die BG sind.\n\nDiese Regel hat wie jede andere seine Gründe, z.B. für Fälle wie diesen hier und ich kann versichern, dass alles professionell & im Sinne der Community gemacht wird.\n\nWir wollen nur das Beste für die Community, und dementsprechend agieren wir auch. In diesem Fall war es, dass man dem Gegner 1 Minute gibt, da sich ihr 5. Spieler gerade einloggte. Man weiß nicht durch welche Gründe der Spieler sich verspätete, Internetabsturz, Fehler im LoL-Client, Stromausfall, ein Notfall oder vielleicht einfach nur verschlafen, aber man würde doch gerne auch fair behandelt werden, falls man in derselben Situation wäre.\n\nDazu versuchen wir die Battlegrounds stetig zu verbessern, und dies hat sich schon gezeigt. Dabei hilft natürlich auch konstruktive Kritik, welche immer willkommen ist, da wir natürlich nicht das ganze aus den Augen eines Teilnehmenden sehen können.\n\n> PS: Ich warte leider immer noch erfolgos auf den Auserwählten-Adjudicator der ein Team wegen eines Teemopicks disqualifiziert :D\n\nDies wird, selbst wenn man es verdient hätte wenn man Satan spielen will, nicht passieren.\n\n{{champion:131}}  ~ Paniro","replies":[]}]}]},{"poster":"Resistancebear","date":"2015-08-10T01:56:54.396+0000","up_votes":4,"down_votes":1,"body":"Ich muss an dieser STelle den Adjus unnd allen anderen , die an der Organisation der Battlegrounds Tuniere beteiligt sind ein Lob aussprechen.\n\nEs wird wirklich viel getan um dieses Tunier aufrecht zu erhalten\n\nAuch an alle diejenigen , welche ihrer Meinung nach zu Unrecht ausgeschieden sind will ich nur zu denken geben wie viel Aufwand dahinter steht ein Tunier mit 500-4000 Teams (4.500-40.000) Spielern am Laufen zu halten","replies":[{"poster":"DotA KuroKy","date":"2015-08-10T08:58:00.513+0000","up_votes":1,"down_votes":0,"body":"der englische Battleground wurde sogar eingestampft, oder verschoben.\n\ndie 2. runde geht bei dehnen nämlich noch nicht los.","replies":[]}]},{"poster":"Call me Br00t","date":"2015-08-09T23:02:53.055+0000","up_votes":1,"down_votes":0,"body":"Macht nen screen mit Uhrzeit wo es zeigt dass ihr vollständig seid.\n\nDann könnt ihr auch nen Formular ausfüllen und ihr seid weiter normal","replies":[{"poster":"131ind","date":"2015-08-10T15:26:38.294+0000","up_votes":2,"down_votes":0,"body":"Oder man gibt dem Gegner auf Nachfrage Inviterechte um püntklich zu beginnen..","replies":[]},{"poster":"Elthision","date":"2015-08-09T23:18:11.931+0000","up_votes":2,"down_votes":1,"body":"Hey,\nDas ist hier nicht der Diskussionspunkt. Brincas hat das Formular korrekt ausgefüllt und ein Schiedsrichter ist das in die Lobby überprüfen gegangen. Wir haben die Screenshots des zuständigen Schiedsrichters und wie wir diese ausgewertet haben hat GummibaumXYZ bereits geschrieben.\nmfg Elthision","replies":[]}]},{"poster":"Brincas","date":"2015-08-11T18:49:27.477+0000","up_votes":1,"down_votes":1,"body":"da das hier gerade ausatet und ich irgendwie auch noch geflamed werde, da das ja irgendwie alles meine Schuld ist find ich schon ein wenig gemein. Ich wollte auf keinen Fall irgendein Hate erzeugen und ich kann auch die Entscheidung akzeptieren. Nur wenn ich ehrlich bin, heißt es man will das beste Team finden und man will versuchen das die Spiele statt finden und ich denke beide Parteien sind sich einige, dass das ganze eine Anreihung unglückerlicher Umstände war. (Einloggbug, Termin, keine Antwort von Support etc) Wieso macht man da, weil eben unglücklich gekaufen ist, nicht einfach ein Rematch? das wäre doch das fairste überhaupt? Ich wäre auf jedenfall dabei und wollte mich auch nochmal entschuldigen falls das falsch angekommen ist, weil der Adj mich hier schon etwas arg harsch angeschrieben hat! Habe wohl den Text etwas zu dramatisch im eifer des Gefechts geschrieben!","replies":[{"poster":"Baisi","date":"2015-08-12T12:33:53.094+0000","up_votes":1,"down_votes":0,"body":"In meinen Augen wäre ein Rematch in diesen Fall nicht Akzeptabel..\nWenn es stimmt, dass euer Gegner einen Ersatzspieler hatte und er keine Inviterechte bekommen hatte ist es euer Verschulden ( wenns den so war)  das ihr dem Gegner Team diese nicht gegeben habt.. Die Spiele haben leider nicht Umsonst eine Frist die im Vorfeld feststeht.. ( Im Turnierbaum)\nIm Endeffekt bist du dann ja aus Zeitgründen geleaved und dadurch hat dein Team verloren. Leider muss man, wenn man sich für so ein Turnier anmeldet auch genug Zeit mitbringen, wobei dies nicht immer einfach ist. An sich würde ich immer Grob 1 1/2 Stunden einplanen für so ein Spiel und zurnot kann man ja die Gegner Fragen ob das spiel vorverlegt wird.. Es ist an sich ja nur für euch schlecht gelaufen und das aus eigenen verschulden.. Wenn ihr das nächste mal mitmacht wäre es zumindest besser sich Ersatzspieler zu besorgen und falls ein Termin dazwischen kommt diesen spielen zu lassen","replies":[{"poster":"Brincas","date":"2015-08-12T13:25:36.223+0000","up_votes":1,"down_votes":0,"body":"weiß nicht, mag diese Ausrede mit dem Inviterechten nicht. Der Leader hatte die ganze Zeit Inviterechte und er hätte seinen Ersatzspieler auch adden oder beim Invite eintippen können aber egal. Bzw gehe ich davon aus das ein Leader eines Teams seinen Ersatzspieler in der Freundschaftsliste hat, va. weil man jeden den man in sein Ranked Team einladen will, auch in seiner Freundschaftsliste sein muss.\nUnd ich habe schon mit einem Ersatzspieler gespielt. Ich brauch nicht mit mehreren Subs die gold oder so sind und noch nie miteinander gespielt haben gegen ein dia 5 Team antreten, wo fast alle high dia sind. Ganz ehrlich das tue ich meinem Team nicht an in 20min gestompt zu werden wenn ich da mit ka 3 Subs antrete.","replies":[{"poster":"Baisi","date":"2015-08-12T14:04:05.958+0000","up_votes":1,"down_votes":0,"body":"Naja ich mache es manchmal auch so das ich jemanden kurz den Lead gebe damit jemand eingeladen werden kann.. Das bekomme ich auch bei anderen so mit die es genau so Praktizieren.. Ich meine es ist ne Sache von 1 min jeden Inviterechte zu geben..\nNaja für mich geht es Persönlich um Spaß und um zu gucken wie ich Performen kann.. Wir mussten leider auch mit 2 Subs spielen weil andere nicht konnten ( Gamescom, Arbeit) und trz. hatten wir es wenigstens versucht auch wenn wir Elo Technisch nicht so gut aufgestellt waren.. Ich meine wenn man es nichtmal versucht dann brauch man meiner Meinung nach nichtmal Antreten weil man dann ja schon voher weiß das man dieses Turnier nicht Gewinnt","replies":[]}]}]}]}]}