{"poster":"Astrox3","date":"2016-08-24T23:31:49.781+0000","title":"Client Crashes all the time after Log In (Mac)","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"Whenever I log in with my username and password, I get shown the main screen for a split second, then the client instantly crashes and I get a message saying that the LolClient quit unexpectedly. I have to start it 3 or 4 times usually until it stays up without crashing. Anyone know a fix? Thanks","replies":[{"poster":"Targons Blade","date":"2016-08-24T23:58:04.931+0000","up_votes":2,"down_votes":0,"body":"These crashes can be caused by a number of different factors. To narrow down the cause, I recommend working through our [Crashing Guide](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes#section-mac), which consolidates the most common solutions.\n\nLet me know if you noticed any change after taking those steps.","replies":[{"poster":"Astrox3","date":"2016-08-28T22:43:01.534+0000","up_votes":1,"down_votes":0,"body":"Hey mate, thanks for the reply. The problem is still persisting, I did everything in the guide expect \"SMC reset\" as the apple page on it sounded very much like I shouldn't. Some of the steps from the guide seemed like things to help prevent crashes during the game, but that's not what's happening on in my case though. It's very specifically directly after the client opens after I logged in. I hoped that you guys may have heard about this problem and know what the specific fix to it is? Appreciate the effort!","replies":[{"poster":"Targons Blade","date":"2016-08-29T18:19:17.088+0000","up_votes":1,"down_votes":0,"body":"I've heard of this specific issue a number of times, and it's very specific to the Mac client. In the rare case this pops up, it's generally the result of the client requesting a specific font, which is either missing or corrupted in your Mac OS file structure. The font(s) are typically installed during your installation of Mac OS, and if missing, could require a repair or full reinstallation of the OS.\n\nI recommend we escalate this to our tech specialists, as they can work with your closely to resolve this for good. You can do this by running a set of system logs using our [Hextech Repair Tool](https://support.riotgames.com/hc/en-us/articles/224826367), then attach the resulting log zip to a [support ticket request.](https://support.riotgames.com/hc/en-us/requests/new)\n\nLet me know if you have any questions.","replies":[{"poster":"Astrox3","date":"2016-08-31T16:52:26.965+0000","up_votes":1,"down_votes":0,"body":"I'm trying to submit the support client, but these zip log files are over 100 mb in size and the uploader for the support ticket system doesn't seem to be able to handle this size -____- I guess I'll upload them somewhere and link to it in the description. But it's a bit weird that the riot programm that creates log files makes them so big that the support website can't handle it. My internet connection is pretty fast, it shouldn't be a problem on this side","replies":[{"poster":"Targons Blade","date":"2016-09-01T15:18:05.329+0000","up_votes":1,"down_votes":0,"body":"Ah, yeah so the uploader has a limit of about 50MB if I recall correctly. Typically the reason a LoL Logs file is over that limit is if you have a TON of r3d game logs (means you play a LOT or haven't reinstalled League in a while). \n\nLinking to an external upload of the file zip is fine too, though.","replies":[]}]},{"poster":"Astrox3","date":"2016-08-29T20:59:59.099+0000","up_votes":1,"down_votes":0,"body":"I'll do this then, thanks!","replies":[]}]}]}]}]}