{"poster":"Durarara","date":"2015-02-02T13:33:22.890+0000","title":"Sist. baneo para los troll en clasificatoria","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola. Bueno mi propuesta es simple implementar una forma **sacar** a una persona de la selección de campeones por elegir un campeón troll o empezar a amenazar con ayudar al equipo enemigo porque no se le dejo elegir MID, TOP, BOT o JG; o también por haber baneado a un campeón que el quería usar......\r\n  El administrador seguro dira q lo reportemos al final de la partida, pero uno pierde **tiempo** **puntos** entre otras cosas aveces la paciencia.\r\n  Y** el sistema que yo propongo** es que cuando una de estas personas aparezca con la intención de arruinar la partida que se pueda votar para expulsarlo de selección de campeones, sin tenes en cuenta la votación de su amigo si entra en pareja.","replies":[{"poster":"Pascut","date":"2015-02-02T13:42:19.736+0000","up_votes":1,"down_votes":0,"body":"Sería buena idea pero la gente podría abusar de el cuando una persona elige un pick que no les gusta","replies":[{"poster":"Runth","date":"2015-02-02T13:58:23.726+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pascut,realm=LAS,application-id=v7qsfXsE,discussion-id=Q0vIlc1s,comment-id=0001,timestamp=2015-02-02T13:42:19.736+0000)\n>\n> Sería buena idea pero la gente podría abusar de el cuando una persona elige un pick que no les gusta\n\nEl emparejamiento chico, entre mas lo abusen, abusara a si mismo xD\n\nQue es mejor, tener un team organizado o irte como resertor con lp menos si te toca un team que no tienes la confianza, este juego si que es parecido al ajedrez y deporte a la vez","replies":[{"poster":"AnyMuzZ","date":"2015-02-02T15:21:53.484+0000","up_votes":2,"down_votes":0,"body":"Según Surrender@20, lo de un team organizado ya se viene planiado desde hace tiempo,por eso implementaran en un tiempo (no se cuando), un creador de equipos para las ranked, si en ese creador de equipos hubiera una votacion , para baniar dicho troll, la apruebo, pero podrias tardar eternidad para jugar una ranked, no todo lo bueno tiene lo suyo no?.De todas formas yo espero ese modo, sino no importa si hay un troll, uno puede cantar una linea donde se sintie mas seguro y puede ir mal y te sentis de porque le dejaste esa linea si es un manco, o no?.\n Este modo de expulsión es arriesgado como dice @PASCUT , podrian abusar de el, y un voto a favor si estan en duo.","replies":[]}]}]},{"poster":"Jhin Freecss","date":"2015-02-02T16:58:12.000+0000","up_votes":1,"down_votes":0,"body":"No hay campeones trolls","replies":[]},{"poster":"SoloRenektonTop","date":"2015-02-02T13:53:35.024+0000","up_votes":1,"down_votes":0,"body":"Fulanito: {{champion:22}}  Mid! (Y Fulanito tiene racha de victorias con Ashe mid de 20/0/20 aprox ) \n\nlos 4 restantes:  ESTE ES TROLLLL!! VOTACION!! EXPULSAR!!! \"click, expulsion del jugador Fulanito\" \"Fulanito fue explulsado de la cola\"\n\nNo, no me parece buena idea, las colas de clasificatorias serian eternas y siempre la gente haria doge sin poder jugar. Aun asi me gustaria que lo pusieran solamente para probar por 1 o dos meses.","replies":[]},{"poster":"Runth","date":"2015-02-02T13:40:45.999+0000","up_votes":1,"down_votes":0,"body":"Mmmm interesante , como es imposible salir en la seleccion con el tipico alt + f4 porque pueden perder sus lp y quedarte como resertor, buena idea esa de suspender al jugador que no quiere organizar su equipo y su eleccion de baneos, e.e\n\nInteresante idea {{champion:34}}","replies":[]}]}