{"poster":"IS1a442cd69a169ed293a39","date":"2015-01-27T03:36:12.211+0000","title":"Discrimination Against Bronze is Brutal.","subforum":"Gameplay","up_votes":114,"down_votes":19,"body":"EDIT2: I am so tired of receiving comments like \"Just climb out of bronze. If you can't, you are bad. You deserve to be in Bronze\"\n\nFirst, I ended plat in S4 and currently Gold 2. Second, this topic is about the common attitude towards bronze players, NOT about \"imma d1 smurf i no belong here\" trash. Please refrain from trying to teach me how to climb out of bronze and feel superior, because this kind of attitude is exactly what I despise.\n------------------------------------------------------\n------------------------------------------------------\n\nEDIT: I find that a lot of people have misunderstood my point. These are some examples I want to address:\n> It's more that they don't understand WHY they're there. They don't grasp the concept of this game. They don't understand that this is a TEAM game and they think they can carry it all on their own.\n\nThis is a typical stereotype for Bronze players. People who don't accept their own league exist in all leagues, not only Bronze. (maybe except challenger)\n\n> I discriminate people who have been LONG TERM bronze (As in years, not new players) because they want an opinion in the rulings of development when they (When I say they, I mean in my perspective, and the vast majority) have zero clue how to utilize anything in the game to it's best potential.\n\nOkay, I accept Bronze players can't utilize all possible moves or decisions to its best potential. Does it mean they should be discriminated?\n\n> So either you want to win games and therefore you are competitive. Or you do not want to and you should not play ranked.\n\nI never said I don't try my best. I only said \"The lowest tier means the players inside are not competitive enough to beat people above them.\" Diamond is less competitive to Challenger, Bronze is less competitive to Gold. Nothing more.\n\nTo make my point clearer, I am not saying we have the right to stay bad. I didn't even bring up Elo hell, but some people just wanna put words in my mouth and switch my topic into a different way.\n\n------------------------------------------------------\n------------------------------------------------------\n\nBronze has always been the lowest tier after League system was implemented. The lowest tier means the players inside are not competitive enough to beat people above them. That is all.\n\nIt doesn't mean we don't have a brain.\nIt doesn't mean we  deserve cancer.\nIt doesn't mean we  should be labelled with humiliating names.\nIt doesn't mean we are trolls who aim to ruin games.\n\nIf I have to define the worst toxicity in LoL, it has to be the attitude people demonstrate towards lower tiers, in which Bronze is the eternal victim.\n\nThink before you try to insult Bronze players. You may find yourself ashamed.\n\nPS. Anyway, I am now a plat in TW, but I was once below 800 ELO in S2 NA (didn't even reach bronze), I believe I've experienced enough insults at that time to share my thoughts.","replies":[{"poster":"Stephenizgod","date":"2015-01-27T03:45:26.959+0000","up_votes":30,"down_votes":0,"body":"I agree with you, as someone who has been in Bronze before (i got to silver though) and will probably be in Bronze this season too thanks to the 'soft' reset :).  \n\nI have no problem with being in Bronze, if i deserve to i will climb out, if not oh well. Its other people who have a problem with Bronze, well its a problem with those who dont have the same knowledge and skill as them. Actual players who for whatever reason cant rise out of Bronze are associated with those who are in Bronze because they troll, feed, afk, etc. They are mostly talking about those people, but since majority of those people end up in Bronze and low Silver, high tiers think that all Bronzies are like that.  \n\nWell jokes on them most of those Golds are starting in Bronze this season and are crying like children lol If you truly believe you deserve in Gold then work your way back up, what are you afraid of? That you wont get lucky this time and get placed in Gold like last time? That you dont actually have the skills required to get into Gold? Lol its just funny to me, there is no point in complaining you will end up where you deserve to end up at.","replies":[{"poster":"Duchess of Deer","date":"2015-01-27T06:19:07.137+0000","up_votes":2,"down_votes":21,"body":"started b5 last season ended at b1 was in my silver provisionals didn't get time to finish them\n\nplay my first ten provisional games start of 4/0 then 2 afk's in a row 2 games where my team fed and i was the only one positive and 2 games where i straight up lost got b5 geuss you could say my work was for nothing i have gotten into promo's 3 time's all of which had afk's \n\nand they say elo hell doesn't exist","replies":[{"poster":"Zenthon Prime","date":"2015-01-27T07:04:48.254+0000","up_votes":11,"down_votes":1,"body":"\"Elo Hell\" is the sense that there's some inescapable void down in Bronze is a myth.  I saw someone climb from Bronze IV to Silver III just last season.  \"Elo Hell\" in the sense that Bronze is easily 5x worse than any other division in terms of behavior, including Silver (I've seen both, and even by Silver IV the effect is hugely noticeable), is a very real thing.\n\n\nBTW, the real issue isn't promos, it's the fact that across the board everyone's MMR is (supposedly) at least a full league below what they used to be ranked.  I mean, I get having a B1 rank and getting demated to, say, B2, but if you're in B1 getting dropped to B5 literally makes no sense.  IF your MMR was REALLY that low you shouldn't even have gotten any LP for winning previously.\n\nPromos working as intended, but the MMR system apparently is either bugged to hell or utterly broken.","replies":[{"poster":"Ten60wAddison","date":"2015-01-27T22:17:50.524+0000","up_votes":2,"down_votes":0,"body":"\"Elo Hell\" does exist.  If I can go 8 games in a row twice in a two week window, then get trolled at specific times and still end up in the same tier I started in, there's a problem.\n\nI'm getting +14 for wins and -22 for losses.  Even if I win 3 out of 5 (which for high elo players that's good) I'm still -2 LP's.  So you'll say, \"Well your LP gains are based on who you are playing against and their MMR's.\"  Everyone understands that.  The problem is, I don't choose who I play against.  In effect, Riot could pair me with all 800 MMR players from here till eternity and I can't control that.\n\nI've qualified both of the last seasons B5.  I belonged there last season.  I was B3 with 65 LP's and climbing last season when I lost two tough games in a row.  Was down to ~20 LP's.  I got the network bug and couldn't get into my game.  Lost and was at 0 LP's.\n\nNeedless to say after a few 4v5's and some games where these bronze morons went roaming in non-warded jungles getting ganked left and right, I fell to B5.  Climbed back to B3....  Promos.\n\n\nWelcome back to Bronze 5.","replies":[]}]}]}]},{"poster":"SEKAI","date":"2015-01-27T03:43:48.056+0000","up_votes":17,"down_votes":2,"body":"People laugh on many things, and use the \"low value existences\" in their mind to insult others, where have you been? It's been here since the first dawn.\n\n* People use certain animals to represent a bad image.\n* People use social class to differentiate the level between me and you.\n* People use educational background to judge whether you're a decent human being or not.\n* People look at brands while check out each others'.\n* People look at the monetary goods you own, then look at theirs.\n* People compare the food you eat and criticise on your level of humanity.\n* People compare the cloth and style you wear, to see whether you're in line or not.\n\netc, I don't wanna distress over this too much.\n\nThe world is a sinister place, full of people full of themselves. It's NOT a bad thing per se, it's always cool to look out to something you like to see and do a little comparison, but many do go too far which in this case, is the rank in LoL.\n\nHowever the world at the same time, isn't completely full with them, you can very easily find like minded people. Just yer, just ignore the hate and enjoy the day.","replies":[]},{"poster":"Mistress Madoka","date":"2015-01-27T17:25:27.790+0000","up_votes":12,"down_votes":1,"body":"Personally, I think it's wrong to discriminate based on rank alone.\n\nDiscriminate based on their Attitude, not their colors.\n\nIf they're bronze but they're nice and cooperative, Don't be an ass to them\n\nIf they're bronze and say stuff like \"omg u noob report I afk fkin troll team\" then they deserve no Mercy. Players like this need to either be Eliminated or Reformed.\n\n(And No, I'm not Advocating murdering bad players who can't handle defeat. I'm advocating that those players uninstall, Get some anger Management classes, and Maybe find a more relaxing game to play.)","replies":[]},{"poster":"Sadistic Cheese","date":"2015-01-27T12:24:02.935+0000","up_votes":8,"down_votes":0,"body":"Agreed OP, agreed.\n\nThe worst thing is that they wouldn't have so many supposed trolls and unskilled players in their games if they would stop with the Bronze hate. At the moment, if you care at all about Ranked, Bronze is the worst thing ever. In reality it's not because a large amount of players, possibly the majority, are distributed between it and silver (last I heard, anyway.)\n\nMany of us may very well never have the aptitude to climb to Gold or higher. Maybe it's our mechanics, maybe it's our decision-making, or our champion-pools, or our ability to control our emotions. Whatever the reason, we may never see a Gold or higher ranking and may never see a Victorious skin.\n\nand THAT'S OKAY. It's not bad, it doesn't mean you've failed at life. If you feel like you want to climb out? Go ahead! I'll be seeing where I can go if I can stomach more than my placements this year. (I have a tendency of getting teams where one or two peoples' attitudes make me feel like Ranked isn't worth it.) But if you never get that far, that's okay.\n\nIt's NOT the end of the world to be Bronze. As long as you do your homework and understand that at higher ranks the game is very different in key areas, your opinion isn't automatically invalid just because you're Bronze. \n\nOther players just need to stop trying to prop up their egos by crying about/at people who aren't as good at them in a video game and treating those people as if they've failed at life. If the measure of success in life to you is what Rank you're at in League...you...have a very weird standard and have a hell of a life outside of it, I'd say.","replies":[]},{"poster":"Akesgeroth","date":"2015-01-27T07:12:23.216+0000","up_votes":7,"down_votes":3,"body":"All right, long post.\n\nThe issue you're seeing right now stems from the absolutely terrible rehaul of the MMR system which caused a lot of gold and plat players to get put in low silver and bronze for God knows why. These are people used to being grouped with other players who are actually trying to win, people who know what they're doing, people who don't AFK or DC during ranked matches regularly, etc. Many of these people are also newcomers who had never known Elo hell and who, through misinformation, were taught that it doesn't exist.\n\nNow they're experiencing it. Here's the deal: If you're a troll, you'll wind up in bronze. If you leave games, you'll wind up in bronze. If you DC or AFK often, you'll wind up in bronze. If you're the kind of person who picks champions you've never played before in ranked, you'll wind up in bronze. If you're the kind of person who pushes your opponent under his tower then whines at his jungler when he gets ganked, you'll wind up in bronze. If you're the kind of person who's AFK when the match starts until minions spawn, you'll wind up in bronze. If you're the kind of person who starts feeding on purpose or other similar behaviors when your team takes a last hit from you, you'll wind up in bronze. All the worst of the worst winds up in bronze, and these people can single handedly lose games for their whole team. Gold and plat players are not used to dealing with this bullshit.\n\nAt least maybe now some people will stop pretending Elo hell doesn't exist.","replies":[{"poster":"Arkna","date":"2015-01-27T13:32:49.717+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Akesgeroth,realm=NA,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=000f,timestamp=2015-01-27T07:12:23.216+0000)\n>\n> All right, long post.\n> \n> The issue you're seeing right now stems from the absolutely terrible rehaul of the MMR system which caused a lot of gold and plat players to get put in low silver and bronze for God knows why. These are people used to being grouped with other players who are actually trying to win, people who know what they're doing, people who don't AFK or DC during ranked matches regularly, etc. Many of these people are also newcomers who had never known Elo hell and who, through misinformation, were taught that it doesn't exist.\n> \n> Now they're experiencing it. Here's the deal: If you're a troll, you'll wind up in bronze. If you leave games, you'll wind up in bronze. If you DC or AFK often, you'll wind up in bronze. If you're the kind of person who picks champions you've never played before in ranked, you'll wind up in bronze. If you're the kind of person who pushes your opponent under his tower then whines at his jungler when he gets ganked, you'll wind up in bronze. If you're the kind of person who's AFK when the match starts until minions spawn, you'll wind up in bronze. If you're the kind of person who starts feeding on purpose or other similar behaviors when your team takes a last hit from you, you'll wind up in bronze. All the worst of the worst winds up in bronze, and these people can single handedly lose games for their whole team. Gold and plat players are not used to dealing with this bullshit.\n> \n> At least maybe now some people will stop pretending Elo hell doesn't exist.\n\nMost gold and plat players ARE aware of it. They're just royally pissed because they know they're looking at a huge grind to get out.","replies":[{"poster":"Hi Im Leona","date":"2015-01-27T17:03:26.699+0000","up_votes":2,"down_votes":1,"body":"Ended the season as Gold 3, Got placed as Silver 4 this season. \n\nA few days later i'm back into gold. It's not that difficult. I at least enjoy my trip back to silver by playing yolo champs like wukong, poppy and fizz.","replies":[{"poster":"xXSomeoneElse","date":"2015-01-27T19:27:02.198+0000","up_votes":3,"down_votes":0,"body":"silver is absolutely nothing like bronze... I learned that the hard way.. went from silver IV last season and got placed into Bronze IV this season played several games where people were using champs for the first time in ranked games people intent fed in games and people just literally sat at base all game not even afk just raging at everyone because they lost first blood to their lane opponent, now I don't believe that elo hell is a \"league\" or a \"division\" but elo hell is the player, if you troll, feed, afk, rage etc. you are the elo hell not only for yourself but for your whole team as well. (not saying you as in you just in general)","replies":[{"poster":"Kristari Zuboro","date":"2015-01-28T01:26:07.944+0000","up_votes":2,"down_votes":0,"body":"One of the lessons I learned in ranked from last season, is never to play ranked at the start of the season.\n\nAfter two seasons of starting ranked at the early part of the season, I learned.","replies":[]}]}]}]}]},{"poster":"AloneInTheCrowd","date":"2015-01-27T03:50:34.037+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=IS1a442cd69a169ed293a39,realm=NA,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=,timestamp=2015-01-27T03:36:12.211+0000)\n>\n> Bronze has always been the lowest tier after League system was implemented. The lowest tier means the players inside are not competitive enough to beat people above them. That is all.\n> \n> It doesn't mean we don't have a brain.\n> It doesn't mean we  deserve cancer.\n> It doesn't mean we  should be labelled with humiliating names.\n> It doesn't mean we are trolls who aim to ruin games.\n> \n> If I have to define the worst toxicity in LoL, it has to be the attitude people demonstrate towards lower tiers, in which Bronze is the eternal victim.\n> \n> Think before you try to insult Bronze players. You may find yourself ashamed.\n\nLook the majority that does the things you mentioned above are your avarage everyday person , they do it because of their own insecurities . Paying attention to such behaviour is like expecting from a chair to speak english .","replies":[]},{"poster":"The Bearded Bard","date":"2015-01-27T06:33:48.465+0000","up_votes":9,"down_votes":3,"body":"It's more that they don't understand WHY they're there. They don't grasp the concept of this game. They don't understand that this is a TEAM game and they think they can carry it all on their own. The fact of it is, if you're under silver 1 and not making any visible progress climbing the ladder, it's not the game and it's not your teammates, it's you. And until you realize that and adjust your playstyle accordingly, you'll stay there. \n\nAnd it's not just limited to bronze players. Like I said, Bronze 5 to Silver 2 are all the same, only difference is the higher they are the more they play the game. Silver 1 to plat 3 are all the same as well. They've got more of a grasp of the game, maybe better technical skill, but their skill levels are no where near their egos.\n\nWhat I'm getting at here is that it's hard to take people lower than me that complain about where they're at seriously when I know full well how bad I am at this game compared to those above me. ","replies":[{"poster":"AtheosisX","date":"2015-01-27T06:43:48.203+0000","up_votes":5,"down_votes":1,"body":"> They don't understand that this is a TEAM game and they think they can carry it all on their own. The fact of it is, if you're under silver 1 and not making any visible progress climbing the ladder, it's not the game and it's not your teammates, it's you. And until you realize that and adjust your playstyle accordingly, you'll stay there. \n\nWhile I don't disagree with your point it is kind of odd that on one hand you are saying it's a team game and you can't do it all while the ranking system says otherwise.  The people who climb carry games, and that's the way Riot has designed it.  Honestly solo queue is fundamentally flawed because you have people who are ranked individually based upon their record with random teams of strangers.  It is what it is.  Solo queue is not where to go if you really want to enjoy the team aspect of this game.","replies":[{"poster":"The Bearded Bard","date":"2015-01-27T06:59:59.158+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=AtheosisX,realm=NA,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=000c0000,timestamp=2015-01-27T06:43:48.203+0000)\n>\n> While I don't disagree with your point it is kind of odd that on one hand you are saying it's a team game and you can't do it all while the ranking system says otherwise.  The people who climb carry games, and that's the way Riot has designed it.\n\nI climb by adjusting to my teammates. I play what position is left over after everyone says what they want, even if I'm first pick. If you're confident that you're good enough to play well from any position, why not let everyone else play the position they feel best at? Once you stop fighting your allies and start focusing on playing the game, you'll find the climb easier. \n\nThe system is ridiculously flawed anyway. All nonpromo games should be treated the same way. You shouldn't be gaining an absurdly high or low number for wins and vice versa for losses. How can you say a system is accurate when your allies are gaining 10 points for the same game you just got 20 points for winning? I like the 100 points then promos thing, I really do, but even out the way you gain or lose. Win a game? 10 points. Win two in a row? 10 for the first game, 15 for the second. 3 in a row? 20, 25 for the fourth, 30 for the fifth. That'll get you to 100 points and you can start your promos. Works the same way for losing. Start with 10, end with 30. Starts over if you go up or down a tier. Third loss in a row at 0 LP drops you down a league or tier or whatever you wanna call it. If you lose a series without winning a game, you go back down to 50 LP, if you win one and lose the other two you go down to 75.","replies":[]},{"poster":"shadecrapper","date":"2015-01-27T08:44:24.736+0000","up_votes":2,"down_votes":0,"body":"I would agree, but word it differently. People in Bronze play the game to 1v1 or just kill people. They dont care about farming, they just want to fight. If you watch most bronze top lanes its all they do. Both will fight each other the whole time and only have 40 cs 30 minutes in. Or they will force team fights out of no where. In silver people are just better at doing this while also have a grasp on the game. Little to no f*cks are given about deaths, unless your team sees you at 0/3 and calls you a feeder.","replies":[{"poster":"CHITOGEBESTGIRL","date":"2015-01-27T23:08:03.084+0000","up_votes":2,"down_votes":0,"body":"dats fun as fuk mang","replies":[]},{"poster":"xXSomeoneElse","date":"2015-01-27T19:32:00.764+0000","up_votes":2,"down_votes":0,"body":"that's honestly the truth of it and I use that to my advantage... I normally play my lane completely passive even with the advantage mainly because my opponents urge to kill me will build up so much that they will dumbly fight me at any chance I let them take which usually ends up with me getting another kill on them and I just repeat this process until they learn that they can't fight me and then I take tower and roam xD","replies":[]}]}]}]},{"poster":"EverTokki","date":"2015-01-27T21:04:28.272+0000","up_votes":5,"down_votes":0,"body":"Yes, I know that there might be people in Bronze because of their skills or their low level of competition. However, I also want to state that many people in Bronze also have a weak mentality, and probably a higher density of mentally fragile people. The outbreak of one's mental breakdown can kill the whole team and lead to feeding/afks/toxicity..etc. Of course, it won't be different in other tiers, however it tends to show more if a Bronze breaks up because they have lesser skills and sometimes are in an angry state because they are \"Bronzes\" (believe me, there are people who throw games because they are \"Bronzes\"). \n\nAlso, the main reason most Bronzes are in their low tier is because they throw the game. I mean, if you do a pretty good job, you'll at worst be Bronze 2 or 1. Nowadays, people know enough to practice more in Normals and do promos. Many people who don't care about the game will be most likely to be in Bronze 4~5. That's why many people came to think that all Bronze players are toxic. And it's probably why some of the Bronze players act negatively, too. It's a never-ending loop, and will be unless people start to make plays in Bronze, or until they make Wood tier. Then the Bronzes will have something to attack on, I guess.","replies":[]},{"poster":"Junkο","date":"2015-01-27T18:41:24.639+0000","up_votes":3,"down_votes":0,"body":"I remember when i was Bronze 4 on NA (with 200-300 ping), i played a few normal games to cool off and then just stomped ranked. People in Bronze are SO MUCH worse than normal players, i actually managed to get 20+ kills every single game with 200 ping, no idea how.\n\nI don't really discriminate against Bronze myself because i don't see any point in insulting other people (unless i'm really mad). But here is a vid of why people might discriminate bronze:\nhttps://www.youtube.com/watch?v=DXgvNyn_w7A","replies":[]},{"poster":"AtheosisX","date":"2015-01-27T06:39:25.324+0000","up_votes":3,"down_votes":0,"body":"What's funny is that most players are Bronze or were Bronze at some point.  It's an absurd attitude to have really.","replies":[{"poster":"Hi Im Leona","date":"2015-01-27T17:10:06.370+0000","up_votes":2,"down_votes":0,"body":"And then we climbed out of with with the power of knowledge, experience, and the Gates.","replies":[{"poster":"blueberrypancake","date":"2015-01-28T17:59:05.499+0000","up_votes":2,"down_votes":0,"body":"BASE GATESSSSSSSS","replies":[]}]}]},{"poster":"Konidias","date":"2015-01-28T19:35:50.248+0000","up_votes":2,"down_votes":0,"body":"Also I want to add... every division has discrimination. When I am Silver and a Gold player is insulting me, their first move is to pull the \"stay silver\" and \"this is why you're silver\" card.\n\nSame thing when I hit Gold. \"stay gold\", \"this is why you're gold\"\n\nI literally had one S1 game where this other Silver had managed to get a gold border before Season 4 ended but had dropped since then. He did terribly and then tried to play it off by telling us how jealous we were that we didn't have a gold border and he did. He kept bragging about it like he was superior to us because he had reached gold.\n\nThen I reach gold and I get plat players telling me the same thing.\n\nSo guess what... there's discrimination at every level of play. If you are plat you have diamond people telling you you're garbage. If you are master you have higher master ranked players telling you you're garbage.\n\nEven if you hit number one rank in the world, people are going to say you're garbage and you just got lucky or carried or whatever. It's because people have insecurity issues and huge egos.\n\nBut the ranking system is there for a reason. It's there to rank people by their wins/losses. Take that as you will. But please stop taking your rank so seriously. So what if you're Bronze? Either accept that you are the bottom 50% of the playerbase, or get better and stop whining.","replies":[]},{"poster":"REMAKE GoT S8","date":"2015-01-28T14:26:30.458+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=IS1a442cd69a169ed293a39,realm=NA,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=,timestamp=2015-01-27T03:36:12.211+0000)\n\n> It doesn't mean we don't have a brain.\n> It doesn't mean we  deserve cancer.\n> It doesn't mean we  should be labelled with humiliating names.\n> It doesn't mean we are trolls who aim to ruin games.\n> \n> If I have to define the worst toxicity in LoL, it has to be the attitude people demonstrate towards lower tiers, in which Bronze is the eternal victim.\n\nThis is like the most touching thing I've read on the League forums. It's ridiculous how just getting into the match before minions even spawn how some people already have to start going on about this shit Bronze they got queued with. I hear more shit in normals and ARAMs too.\n~~which is retarded since who the fuck even cares about those? ~~","replies":[]},{"poster":"Engetsu","date":"2015-01-27T23:28:11.179+0000","up_votes":2,"down_votes":0,"body":"Since the ranking on League is basically the social ladder of life, you will get those dicks who kick a person who is down ( aka rich people/ high ranks).\nThere are people who will try to help, but really its up to person who is getting the help to stand up.  \n\n\"You are so bad you belong in bronze\", apparently people who are bad at a game has no right to try to improve them self.  People on this game expect you to be pro instantly.  News flash, everyone is different, some people won't get the game just like that.  Yes Bronze is where the unskill players goes, but what gives you the right to judge them? Is because you are higher rank? if that's the reason than you are horrible person.\n\nIt's not much, but I went from Bronze 4 to Silver 5 last season, I took my time and looked back at what I did wrong.  I would have liked to get higher, but I stopped for personal reasons.  Any way you shouldn't be dick just because you are higher rank.","replies":[]},{"poster":"Space Bum","date":"2015-01-27T19:52:42.806+0000","up_votes":2,"down_votes":0,"body":"Some teams are uncarryable for one reason. Split push. If your team is 100% worthless, you are the team. You cannot be everywhere and you cannot count on anyone so all it takes is one person to split and you lose your carry potential. Watch as your team goes for dragon while an enemy takes out two turrets and an inhibitor. Do you leave them and watched them get aced? Of course but 4-5 fed  players with retarded gorilla strength only need to get off a stun to blow you up.","replies":[]},{"poster":"OblongOtter","date":"2015-01-27T18:48:49.555+0000","up_votes":2,"down_votes":0,"body":"My problem is when people in normals (or even ranked although I don't ranked much) say they don't have to listen to anything you say because you're bronze.  \"I can get Athene's versus an all AD team if I want, you're bronze you don't know anything.\"  Yeah but I also know I almost never play Ranked, when I do I almost always get fed as well as getting towers, and that I've actually carried Plats against Plats (and sometimes a Gold/Silver) before.  I actually decayed down to Bronze last season and never really cared to get out of it.  I also have this weird thing where I can come up with great solutions to problems, as long as it isn't *my* problem.  (That's really annoying in real life.)\n\nThere are any number of factors that can make someone Bronze, but people (including Silver 5s) think that if you're Bronze (Even Bronze 1) you are the worst at literally everything related to League.","replies":[]},{"poster":"Spencer Orchid","date":"2015-01-27T10:02:23.440+0000","up_votes":2,"down_votes":0,"body":"i think youre right. maybe bronze players dont play as good as higher tiers. there are probably still enough people who should be higher than others who got lucky and went to silver or gold. i mean i had botlane raging at me because i didnt say ss. when i said i did, i said \"mid mia\", they told me to stop speaking italian, because they dont understand it. and it was a gold ranked game....so idiots are everywhere. so saying bronze players shouldnt have a say in discussions is just rude","replies":[]},{"poster":"Knight SoIaire ","date":"2015-01-27T06:15:48.789+0000","up_votes":2,"down_votes":0,"body":"> The lowest tier means the players inside are not competitive enough to beat people above them. That is all.\n\nmaybe its you \nbut i will  never believe that the rest of bronzes shares your thought process\n\nand i was there, i saw the chat, those ppl were competetive but didnt improve their game","replies":[]},{"poster":"Konidias","date":"2015-01-27T18:03:52.861+0000","up_votes":3,"down_votes":1,"body":"I think the hate towards Bronze comes from playing with unskilled teammates. Bronze has been associated with being unskilled, since they are at the bottom of the skill ladder.\n\nTherefore, people hate Bronze players because they are the least skilled, and low skilled teammates are the most frustrating to have on your team because they:\n\n- don't listen\n- go rambo and dive the enemy team 1v5 and die\n- don't learn from mistakes\n- don't make a real effort to improve\n- blame everyone but themselves\n- would rather argue than play\n\nIt's not necessarily \"discrimination\" but I really don't want Bronze level players having input on how the game should work or be changed... because they don't properly understand the game. If they did, they wouldn't be bronze. This isn't some sort of physical sport where you might have a great understanding of the game but are incapable of physically performing at high levels.\n\nThis is a game where knowledge and understanding are like 95% of what it takes to win. I would consider people at high elo to most likely be actual geniuses. Whether or not they are friendly or sociable is another thing... but there is no denying they are smart individuals. There is a lot of information to retain in this game, and the higher elo you get, the more you have to know. You can't just jump on an enemy without thinking about it like bronze/silver level... you have to know what the enemy can do EXACTLY. You have to know your own limits. You have to look at levels, items, timing windows, vision, who is where, what summoner spells are burned, what ults have been used, etc... That's just scratching the surface. I can say without a doubt that Bronze players are not thinking about the majority of this stuff.\n\nIt's not even about skill, it's about knowledge and taking the time to learn what you need to know.","replies":[{"poster":"IS1a442cd69a169ed293a39","date":"2015-01-27T18:06:54.043+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Konidias,realm=NA,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=002c,timestamp=2015-01-27T18:03:52.861+0000)\n>\n> I think the hate towards Bronze comes from playing with unskilled teammates. Bronze has been associated with being unskilled, since they are at the bottom of the skill ladder.\n> \n> Therefore, people hate Bronze players because they are the least skilled, and low skilled teammates are the most frustrating to have on your team because they:\n> \n> - don't listen\n> - go rambo and dive the enemy team 1v5 and die\n> - don't learn from mistakes\n> - don't make a real effort to improve\n> - blame everyone but themselves\n> - would rather argue than play\n> \n> It's not necessarily \"discrimination\" but I really don't want Bronze level players having input on how the game should work or be changed... because they don't properly understand the game. If they did, they wouldn't be bronze. This isn't some sort of physical sport where you might have a great understanding of the game but are incapable of physically performing at high levels.\n> \n> This is a game where knowledge and understanding are like 95% of what it takes to win. I would consider people at high elo to most likely be actual geniuses. Whether or not they are friendly or sociable is another thing... but there is no denying they are smart individuals. There is a lot of information to retain in this game, and the higher elo you get, the more you have to know. You can't just jump on an enemy without thinking about it like bronze/silver level... you have to know what the enemy can do EXACTLY. You have to know your own limits. You have to look at levels, items, timing windows, vision, who is where, what summoner spells are burned, what ults have been used, etc... That's just scratching the surface. I can say without a doubt that Bronze players are not thinking about the majority of this stuff.\n> \n> It's not even about skill, it's about knowledge and taking the time to learn what you need to know.\n\nYou are basically saying because people aren't good at gaming, they are stupid.","replies":[{"poster":"Konidias","date":"2015-01-27T18:18:45.600+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=IS1a442cd69a169ed293a39,realm=NA,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=002c0000,timestamp=2015-01-27T18:06:54.043+0000)\n>\n> You are basically saying because people aren't good at gaming, they are stupid.\n\nNot gaming. League of Legends, specifically. \n\nI'm saying if you are Bronze level at LoL then you are not using your brain.\n\nLeague is closer to Chess than Call of Duty... Brainpower is required to succeed at higher levels. You can't just be lazy and charge headfirst at the enemy and mash buttons. The number one skill in LoL is knowledge.","replies":[{"poster":"IS1a442cd69a169ed293a39","date":"2015-01-27T23:12:07.182+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Konidias,realm=NA,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=002c00000000,timestamp=2015-01-27T18:18:45.600+0000)\n>\n> Not gaming. League of Legends, specifically. \n> \n> I'm saying if you are Bronze level at LoL then you are not using your brain.\n> \n> League is closer to Chess than Call of Duty... Brainpower is required to succeed at higher levels. You can't just be lazy and charge headfirst at the enemy and mash buttons. The number one skill in LoL is knowledge.\n\nIt seems that people who don't use brain to play LoL is the majority of ranked players though. There are always players in bronze, what makes you so sure most of them aren't trying their best?","replies":[{"poster":"Konidias","date":"2015-01-27T23:29:19.145+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=IS1a442cd69a169ed293a39,realm=NA,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=002c000000000001,timestamp=2015-01-27T23:12:07.182+0000)\n>\n> It seems that people who don't use brain to play LoL is the majority of ranked players though. There are always players in bronze, what makes you so sure most of them aren't trying their best?\n\nLapses in judgement and being off your game are different than totally not having map awareness or ignoring enemy builds or whatever.\n\nThe only reason for losing Bronze games is like literally shutting your brain off and being extremely lazy and ignoring everything and everyone. Even then I would find it hard to lose Bronze games. So I can't believe that people stuck in Bronze are trying their best. I think they are either being lazy or stubborn. One of the two.\n\nYou either keep doing things the same way and think you are playing perfectly and just blame your team or bad luck for everything, or you go zombie mode and just go into \"auto play\" where you are going through the motions but not really doing everything you can. Basically you are being lazy brained.\n\nIt's like when the jungler wants assistance but you refuse to go help because it would require you to click and walk over to him... that is mental laziness. It's a real thing. Just like going into laning phase and just either nonstop farming or nonstop harassing and trying to kill the enemy. People need to adapt to the situation. Not every game has you building the same items and doing the same strategy.\n\nI was guilty of this myself which had me stuck in low Silver for the longest time because I'd go on auto-pilot and end up getting ganked because I was zoning myself out and just mindlessly grinding farm instead of constantly assessing the situation and checking minimap and looking at how I can be proactive.","replies":[{"poster":"ZephyrDrake","date":"2015-01-28T00:32:31.314+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Konidias,realm=NA,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=002c0000000000010000,timestamp=2015-01-27T23:29:19.145+0000)\n>\n> Lapses in judgement and being off your game are different than totally not having map awareness or ignoring enemy builds or whatever.\n> \n> The only reason for losing Bronze games is like literally shutting your brain off and being extremely lazy and ignoring everything and everyone. Even then I would find it hard to lose Bronze games. So I can't believe that people stuck in Bronze are trying their best. I think they are either being lazy or stubborn. One of the two.\n> \n> You either keep doing things the same way and think you are playing perfectly and just blame your team or bad luck for everything, or you go zombie mode and just go into \"auto play\" where you are going through the motions but not really doing everything you can. Basically you are being lazy brained.\n> \n> It's like when the jungler wants assistance but you refuse to go help because it would require you to click and walk over to him... that is mental laziness. It's a real thing. Just like going into laning phase and just either nonstop farming or nonstop harassing and trying to kill the enemy. People need to adapt to the situation. Not every game has you building the same items and doing the same strategy.\n> \n> I was guilty of this myself which had me stuck in low Silver for the longest time because I'd go on auto-pilot and end up getting ganked because I was zoning myself out and just mindlessly grinding farm instead of constantly assessing the situation and checking minimap and looking at how I can be proactive.\n\nyou heard him guys, most people playing the game are idiots. Gotta love elitist people, that's the only reason for people being stuck in bronze, not using their brains. There is no other reason, those who only play ranked once every few matches and mostly play normals? idiots, those who have medical conditions that don't let them have fast reactions? idiots, those who get unlucky in series matches? idiots. Those who are new to the game and haven't nailed down every little possible thing? idiots","replies":[]}]}]}]}]}]},{"poster":"PatMcGroyn","date":"2015-01-27T11:53:27.619+0000","up_votes":3,"down_votes":1,"body":"Having come from Bronze 5 (bottom of the barrel) and having climbed to Gold 1 (top 12% of ranked ladder), in my experience, Bronze players are no more toxic than any other ranked tier.  They're not as good at the game, but there's no crime in that.  Some are just new to the game and learning how to win, others disregard meta and try out their own theorycrafting through trial and error, and lose more often than not.\n\nWith that said, I LOVE those \"Bronze 5 adventures\" videos, not because I think it's funny to laugh at people making shit plays, but because oftentimes in bronze 5, they play with a reckless abandon and kind of balls that higher tier players often don't have.  That's a fun way to play, and it's damn fun to watch.","replies":[]},{"poster":"D2oPtuSCko","date":"2015-01-27T08:14:57.918+0000","up_votes":3,"down_votes":1,"body":"One of my good friends started this game about 6 months ago, after he hit 30 he started playing ranked. He was highly above average for the amount of time he's played the game, but he was no where even near decent. Still doesn't know what half the champions abilities are. Yet he managed to nearly get to GOLD before the end of the season, Silver 1 in promos. He still plays like a bad bronze 5, but this system is set up to where if your luck is right you can easily get carried out of bronze and even silver. \n\nNow more about the original topic... I manged to get gold myself last season and was hoping to get better team mates at this level. I was wrong and my Diamond+ friends were right, everything below plat 2 is elo hell. I get just as many brain dead idiots in gold as I did in bronze. Why? Because people get lucky with better teams that carry them.","replies":[]},{"poster":"Wullf","date":"2015-01-27T09:44:18.157+0000","up_votes":5,"down_votes":3,"body":"Ranked is a competitive mode. Therefore claiming that bronze players are not competitive enough is just an excuse,\n\nIf you intentionally start playing ranked then you are there to compete, aren't you?\n\nSomeone is bronze bcause he does invest little time in playing, or does not want to get better. Or thousand more things.\n\nBut going into ranked and saying \"I am not competitive player\" is hipocritical.\nAlso playing ranked with no care of win means you are ruining game for others.\n\nSo either you want to win games and therefore you are competitive. Or you do not want to and you should not play ranked.","replies":[{"poster":"IS1a442cd69a169ed293a39","date":"2015-01-27T12:15:36.502+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Wullf,realm=EUNE,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=0016,timestamp=2015-01-27T09:44:18.157+0000)\n>\n> Ranked is a competitive mode. Therefore claiming that bronze players are not competitive enough is just an excuse,\n> \n> If you intentionally start playing ranked then you are there to compete, aren't you?\n> \n> Someone is bronze bcause he does invest little time in playing, or does not want to get better. Or thousand more things.\n> \n> But going into ranked and saying \"I am not competitive player\" is hipocritical.\n> Also playing ranked with no care of win means you are ruining game for others.\n> \n> So either you want to win games and therefore you are competitive. Or you do not want to and you should not play ranked.\n\nI never said I don't try my best. I only said \"The lowest tier means the players inside are not competitive enough to beat people above them.\" Diamond is less competitive to Challenger, Bronze is less competitive to Gold. Nothing more.\n\nTo make my point clearer, I am not saying we have the right to stay bad. I didn't even bring up Elo hell, but some people just wanna put words in my mouth and switch my topic into different way.","replies":[{"poster":"Wullf","date":"2015-01-27T12:43:10.320+0000","up_votes":4,"down_votes":2,"body":"logic that lower tier is less competitive then higher makes no sense.\n\n> \"The lowest tier means the players inside are not competitive enough to beat people above them.\" \n\nwat?\n The lowest tier means the pleayers inside are not **skilled**/**knowledged** enough to beat people above.\n\ncompetitivnes has nothing to do with it.\n\nI just cannot understand why would someone play ranked if he did not want to get better, to climb higher.\n\nWhen I started to play ranked, I was just a little noob withot any idea what real games look.\nStill I went in to prove myself. And saying about me that I was less competitive would only insult me.","replies":[]}]}]},{"poster":"Hibeki","date":"2015-01-27T04:33:40.711+0000","up_votes":5,"down_votes":4,"body":"I discriminate people who have been LONG TERM bronze (As in years, not new players) because they want an opinion in the rulings of development when they (When I say they, I mean in my perspective, and the vast majority) have zero clue how to utilize anything in the game to it's best potential.\n\nI'm not talking about Korean level potential, I'm talking open mindset, evolving player potential.\n\nNot everyone  can be Korean standard playing, but when people start realizing how valuable the skitterbug is for instance, then you can start thinking how to balance it.\n\nFor instance, people even plat and under completely ignore the bug. It's a FREE 50g, with a mobility boost and a free choke point ward. The camp doesn't even damage you.\n\nEarly in the game it's a piece of cake to kill even without cc, and most junglers do have cc, so people completely ignore this extremely valuable resource then want to make balance decisions on it?\n\nNo thank you, this is just an example. They do the same thing with champions, items, and tactics.","replies":[{"poster":"IS1a442cd69a169ed293a39","date":"2015-01-27T12:16:00.046+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Hebiki,realm=NA,application-id=3ErqAdtq,discussion-id=XrKm4EuY,comment-id=0004,timestamp=2015-01-27T04:33:40.711+0000)\n>\n> I discriminate people who have been LONG TERM bronze (As in years, not new players) because they want an opinion in the rulings of development when they (When I say they, I mean in my perspective, and the vast majority) have zero clue how to utilize anything in the game to it's best potential.\n> \n> I'm not talking about Korean level potential, I'm talking open mindset, evolving player potential.\n> \n> Not everyone  can be Korean standard playing, but when people start realizing how valuable the skitterbug is for instance, then you can start thinking how to balance it.\n> \n> For instance, people even plat and under completely ignore the bug. It's a FREE 50g, with a mobility boost and a free choke point ward. The camp doesn't even damage you.\n> \n> Early in the game it's a piece of cake to kill even without cc, and most junglers do have cc, so people completely ignore this extremely valuable resource then want to make balance decisions on it?\n> \n> No thank you, this is just an example. They do the same thing with champions, items, and tactics.\n\nOkay, I accept Bronze players can't utilize all possible moves or decisions to its best potential. Does it mean they should be discriminated?","replies":[]}]},{"poster":"Sukishoo","date":"2015-01-28T01:32:23.034+0000","up_votes":2,"down_votes":1,"body":">Bronze has always been the lowest tier after League system was implemented. The lowest tier means the players inside are not competitive enough to beat people above them. That is all.\n\nNot really. I know of many bronze players that have beaten much higher up ranks and are still bronze.  It's as I've always said, Ranks don't mean a damn thing overall. Ooo it's a colored marker in a game.. so what? It means nothing in life, and people get so far into it and act like they are the greatest of the great when it won't help them do anything in the world.","replies":[]},{"poster":"TotalJerk","date":"2015-01-27T21:48:19.320+0000","up_votes":2,"down_votes":1,"body":"On this note, can we all put an end to digging up a person's rank whenever you argue with them about anything. I see plenty of Silver/gold players making perfectly valid points about the balance of this game, only to have a higher rank come along and says \"Shut up, you're [rank] and I'm [rank+1], so I'm right\". Not only is that an elitist attitude, by that logic, Riot should just fire their balance team and give the job to the current LCS champions every year.","replies":[]},{"poster":"xXSomeoneElse","date":"2015-01-27T20:02:40.600+0000","up_votes":2,"down_votes":1,"body":"a lot of people seem like they are \"hating\" on the way Riot has ranking set up, personally I don't have a problem with it... the system is set up in a way to where people are where they \"belong\" to be if you are rising fast and climbing the ladder pretty quickly you belong in a different division or tier but if your rising slowly then chances are you have hit the point where you're going to stay until you either get better or more knowledgeable at the game, or you get lucky and get good teams that carry you up, you have a 50/50 chance to win everytime you start a game of league.","replies":[]},{"poster":"Marquis of Salt","date":"2015-01-27T16:02:47.621+0000","up_votes":1,"down_votes":0,"body":"In Season 3, I was a bronze III player who worked his way into Bronze I. I can rightly say it was hard to escape. However, I will admit I was nowhere near the player I am now.\nSeason 4, I started in Bronze II and worked my way into Gold V in 120 games. Definitely seems like a lot of time (to me) to put into ranked. And yet I've seen players with 50/50 win rates and 400+ games in Bronze I who rage and complain about not being able to escape.\n\n\nIt's more than possible to escape bronze but what people fail to realize is that sometimes they belong in bronze. Typically a 50/50 win rate means you are where you belong.","replies":[{"poster":"Mistress Madoka","date":"2015-01-27T17:28:01.891+0000","up_votes":1,"down_votes":0,"body":"50/50 w/l rate isn't the only Factor. There are People in Gold who got 50/50. Other Factors are things like the enemy team's ELO, Your Teammates' Elos, ETC.\n\nIf the rest of your team is High elo, the enemy team is likely Higher ELO, too, so if you lose that match you lose less than if they had the same Elo as you. the Opposite is true, too. There is a Luck side of it, too.","replies":[{"poster":"Marquis of Salt","date":"2015-01-27T18:07:38.976+0000","up_votes":2,"down_votes":1,"body":"Generally a 50/50 win rate is a great indicator if you have 300-400 games and still in the lowest division. Lucks plays a factor in 10-20 games. Not most of them. \n\nAlso, I'm not saying 50/50 doesn't show growth. But if you can't win your provisionals after 50/60 attempts,  you definitely belong in bronze.","replies":[]}]}]}]}