{"poster":"Daxlum","date":"2019-07-12T02:36:39.931+0000","title":"Mi cuenta fue baneada y quiero saber si me equivoque.","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Hola, quiero preguntar si el ban permanente que recibí es algo normal o si existe alguna otra razón que desconozca.\r\nHoy entre luego de 2 meses a lol, ya que mi computadora u ordenador como quieran llamarlo tuvo varios problemas y basicamente murio, y la verdad quería jugar unas partidas, ya que hace tiempo no jugaba. La realidad es que me baje como 1.5gb de update puse mi cuenta y me encontré con que mi cuenta había sido baneada (me llego un mail, en su momento pero no me di cuenta), y la razón del ban se encuentra en que yo \"utilice\" programas de terceros para mejorar mi juego. Quiero aclarar que soy una persona que acepta que no es muy buena jugando ya que antes de que dejara de jugar mi rango era silver 2 (si soy muy malo y lo acepto, pero me sigue divirtiendo el juego así que meh), bueno volviendo al tema, es verdad que yo utilice 2 veces un programa de tercero pero se trata del programa \"PLAYVIG\" que es recomendado por varios Youtubers que juegan lol  como por ejemplo \"The Glacierr\", ya que tiene un sistema de recompensas al jugar y cumplir \"objetivos\", la realidad es que como era recomendado por varios Youtubers yo me lo baje y lo use 2 o 3 veces pero por un tema de que me molestaban las publicidades (cada vez que terminaba una partida eran 2 o 3 publicidades con volumen muy alto) lo que logro que lo termine borrando. Pero la realidad de la situación es que yo \"use\" un programa de tercero mientras tenia una partida de lol. Por ende y a lo que vengo es a ver si realmente dicho programa fue una violación o si existió algún problema en los 2 meses que no jugué al lol, y ver si a fin de cuentas puedo recuperar mi cuenta, ya que por mas de que no gastara dinero en ella (son lindos los skins, pero la verdad es que no me interesa gastar mi salario en eso xD), yo invertí una cantidad considerable de tiempo en subirla de nivel y conseguir una cantidad de skins. Y lo que mas me duele es que había desbloqueado a varios campeones, lo cual no es fácil (era nivel 110+ no recuerdo el exacto y todavía no tenia ni la mitad de campeones creo)\r\nSin mas que molestar, espero saber si alguien sabe de esto y me puede indicar. Muchas gracias.","replies":[{"poster":"TheKiller Justin","date":"2019-07-12T03:06:23.631+0000","up_votes":4,"down_votes":0,"body":"Creo que el lugar correcto para sacarte las dudas es el [soporte](https://support.riotgames.com/hc/es-419)\nUsar programas de terceros corre bajo tu propio riesgo, y si estaba prohibido, así lo hayan promocionado 1000 youtubers, no hay vuelta que darle.\nTambién estaría la posibilidad que alguien más haya ingresado a tu cuenta y usado hacks, pero bueno, el motivo exacto calculo que los del soporte te lo van a saber decir.","replies":[]},{"poster":"Framed","date":"2019-07-12T03:06:47.819+0000","up_votes":1,"down_votes":0,"body":"Supongo que tenés los suficientes pelos en los huevos como para poder resolver esto, pero te voy a ayudar.\n\nhttps://imgur.com/a/6WE9997\n\nHay otra opción que es la segunda que habla de una suspención, usá la que quieras bro.","replies":[{"poster":"Daxlum","date":"2019-07-12T03:20:13.224+0000","up_votes":2,"down_votes":1,"body":"Si si, ya lo reporte en soporte, pero quería saber que era lo que pensaba la comunidad del hecho, o si a alguien le había pasado algo parecido y si lo pudo o no resolver, gracias igual.","replies":[{"poster":"Framed","date":"2019-07-12T03:31:00.120+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Daxlum,realm=LAS,application-id=v7qsfXsE,discussion-id=0sK4K2wz,comment-id=00010000,timestamp=2019-07-12T03:20:13.224+0000)\n>\n> Si si, ya lo reporte en soporte, pero quería saber que era lo que pensaba la comunidad del hecho, o si a alguien le había pasado algo parecido y si lo pudo o no resolver, gracias igual.\n\nEn ese caso, a mí me parece que te re cagaron y debería ayudarte el soporte. A mí me pasó que me banearon una cuenta lvl 3, me parece, que era por usar un script muy conocido en 2014 contra bots (porque no podía ir a normal por el nivel, y menos mal que no lo hice) que involucraba la espada del rey arruinado. Consistía en robarle toda la vida al enemigo en cuestión de segundos gracias al efecto del item pero re rápido.\n\nAcá te dejo un video: https://www.youtube.com/watch?v=DDJigrDBgZI\n\nEse baneo está justificado, pero el tuyo no. Suerte con eso.","replies":[]}]}]},{"poster":"ObscureAngel","date":"2019-07-12T12:08:21.205+0000","up_votes":2,"down_votes":1,"body":"Fijate buscando por San Google que hay un lugar donde podes ver los programas de terceros que Rito acepta que descarguen (por ejemplo Quarterback o Championify), nunca te fíes de los youtubers que recomiendan un programa de terceros si no estás seguro de si es legal o no","replies":[]},{"poster":"PasoPackXHonores","date":"2019-07-12T16:27:04.947+0000","up_votes":1,"down_votes":0,"body":"Riot: \"No se permite el uso de programas de terceros. No los usen o corren riesgo de ban permanente.\"\n\nRatatuber cualquiera: \"Hola, criaturitas del señor, les recomiendo usar este programa de terceros, por que me pagan para promocionarlo, gg izi tu gfa en bici\"\n\nJugador: \"si señor, lo usaré\" \n\n(cuenta baneada)\n\njugador: \"RITO PLIS\" T_T","replies":[]}]}