{"poster":"masterkelly","date":"2015-05-11T04:52:47.425+0000","title":"Formar Team","subforum":"Reclutamiento","up_votes":2,"down_votes":1,"body":"Buenas, estoy buscando formar un equipo desde cero, mas que nada quiero aprender lo que pueda faltarme para ser mejor, actualmente somos 2 en el equipo, no hemos puesto un nombre ya que solo somos 2. En cuanto estemos los 5 fijaremos el nombre y las demas cosas, como horarios de entrenamiento, tacticas, etc.  Si a alguien le interesa agregar in-game. Yo estoy B3 y subiendo y mi amigo esta plata 3. Por temas de trabajo solo estoy los fines de semana asi que quien quiera y acepte solo jugar viernes, sabado y domingo en equipo pues agregue y trataremos de llegar lo mas lejos posible.","replies":[{"poster":" BOOSTED ADC","date":"2015-05-11T07:16:05.384+0000","up_votes":3,"down_votes":0,"body":"Main ADC PLATA III \nagregame  y hablamos :D","replies":[]},{"poster":"Baal Shamen ","date":"2015-05-11T05:17:43.978+0000","up_votes":3,"down_votes":0,"body":"yo soy plata5 vengo subiendo desde br3 agregame y hablamos...{{summoner:6}}","replies":[]},{"poster":"TareKiller","date":"2015-05-11T04:55:30.570+0000","up_votes":3,"down_votes":0,"body":"todavia no llegue  level 30 pero estoy a punto si me esperas yo puedo jugar soy mas de top y soy de argentina{{champion:17}}","replies":[]},{"poster":"CuboVerde","date":"2015-05-11T08:07:51.298+0000","up_votes":2,"down_votes":0,"body":"Yo también quiero participar. Soy nivel 25 y maineo warwick jungla.","replies":[]},{"poster":"Ako Nee","date":"2015-05-14T19:06:14.688+0000","up_votes":1,"down_votes":0,"body":"Nick: Razor414 (si quieres un mid, o supp) Jimy4 (si quieres un top) Shadow Hunter EU (si quieres jg)\nEdad: 18\nLinea: de Preferencia supp y mid xD (todo menos adc)\nDivisión: En Las primeras oro 2 en la season 2013\nCampeones: Shaco (supp y jg) Sona, Jax, Malphite y Vi\nTiempo jugando: Si ves anime (Sword art Online, seria mas que kirito, un alpha tester) desde el alpha.\nHorarios disponibles para entrenar: Todo el día menos de 5:30 PM a 11:30  Pm que tengo que pasar clases.\nUna cosa más, mi pasatiempo era (creo que sigue) levear cuentas, las mas dedicadas (con runas y todo eso) son las 3 que puse ariva (la de ako Nee la leveo xD). \nLugar de origen: Bolivia (no generalizen porfa :P)","replies":[]},{"poster":"Rompez","date":"2015-05-14T17:06:37.801+0000","up_votes":1,"down_votes":0,"body":"-Nombre: Rompez\n-Edad: 19\n-División: S4 Plata 1 (Baje a 4 creo) S5 Bronce 5\n-Posición: MID y SUPP\n-Campeones Mains: Katarina, Janna. Soraka\n-Nacionalidad: Argentino","replies":[]},{"poster":"Box Box NA","date":"2015-05-12T15:17:46.465+0000","up_votes":1,"down_votes":0,"body":"Nick: Violet Diamonds\nEdad: 22\nLinea: Top\nDivisión: Plata lll\nCampeones: Riven (maineo 100%) ,Gnar, Diana, Rek Sai, Jayse\nTiempo jugando: Juego desde el Server NA cuando no existia el LAS\nHorarios disponibles para entrenar: 100% tiempo completo para entrenar","replies":[]},{"poster":"Equinox Yukkii","date":"2015-05-12T04:26:43.776+0000","up_votes":1,"down_votes":0,"body":"Hola, juego bastante Jg, Adc,mid y supp también, pero no tanto como Jg, Top no tanto, pero también me va bien. Soy Oro V en este momento, así que si no hay personas todavía y queres, agregame y vemos como podemos mejorar todos n.n","replies":[]},{"poster":"Razor02","date":"2015-05-11T20:17:21.590+0000","up_votes":1,"down_votes":0,"body":"soy main adc, pero puedo ir cualquier linea\nbronce 4, pero muchas ranked no juego","replies":[]},{"poster":"EzeK","date":"2015-05-11T14:06:30.854+0000","up_votes":1,"down_votes":0,"body":"pues... si no son : flammer, niños, gente que se creen superior a los demas y cosas que no van en un team...\nSoy lv 30.\nNick : Askhalon, Plata IV.\nJuego bastante Top, JG, Supp ( ADC/MID soy un asco. )\nSoy de argentina. Los dias de semanas no puedo jugar... 1 o 2 partidas y a dormir... por lo que no creo q sera, pero los fines de semana estoy libre :3\nNo soy de calentarme por Perder 1 partida, sin embargo obviamente...Todo puede pasar :3\n\nPero en fin, cualquier cosa se arregla in-game.\nSaludos.","replies":[{"poster":"masterkelly","date":"2015-05-11T14:51:50.069+0000","up_votes":1,"down_votes":0,"body":"AGREGAME IN GAME Y HABLAMOS","replies":[]}]}]}