{"poster":"Señor Toplaner","date":"2017-01-22T00:00:03.788+0000","title":"Ja Riot sehr lustig","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":12,"body":"Also ich muss ja echt sagen, nicht nur das mein Cliend so oft crasht und das nicht wegen mein Pc. und jetzt auch noch 5 Games 20 min. Ban lustig mein letzter Ban war vor ca 4 Monaten kann mir mal bitte mal erkl&auml;ren warum ?????. Ich konnte nicht einmal was daf&uuml;r da mein Router einfach Gecrasht ist ja super","replies":[{"poster":"TerrorRaven","date":"2017-01-22T00:04:59.171+0000","up_votes":2,"down_votes":0,"body":"Was hat nun die ganze Zeit gecrasht? Der Client oder dein Router?\n\nDie Strafe ist deshalb, weil du dich nicht um dein technisches Problem gekümmert hat.","replies":[{"poster":"Señor Toplaner","date":"2017-01-22T00:12:32.611+0000","up_votes":1,"down_votes":3,"body":"das ding ist ich kann nichts dafür wenn mein Router crasht ich habe den outer erst neu gekauft","replies":[{"poster":"Homunculi","date":"2017-01-22T09:15:06.368+0000","up_votes":1,"down_votes":0,"body":"Es wäre vllt. ganz gut gewesen, wenn du schon weisst dass dein Router rumspinnt, einen Thread im Hilfe&Support Unterforum aufzumachen.\nDa kann dir vllt. geholfen werden und es hätte dir die 20 Minuten Wartezeit erspart.\n\nMerke, wenn du ein Problem bemerkst, schau ob es sich innerhalb von sehr kurzer Zeit wiederholt und unternimm vorher etwas, bevor etwas passiert ^^.","replies":[]},{"poster":"TerrorRaven","date":"2017-01-22T00:18:03.561+0000","up_votes":1,"down_votes":0,"body":"Dann solltest du mal herausfinden, warum er crasht und wie sich das beheben lässt.","replies":[]}]}]},{"poster":"Devine","date":"2017-01-22T01:40:43.193+0000","up_votes":3,"down_votes":1,"body":"Dein Router, Deine Probleme. \nSo wie Du schreibst bist du 12-16 Jahre jung.\nWenn Dein Pc crasht und dein Team OHNE DICH spielt ist es DEINE Schuld.\nEs ist kein Mitspieler der dir deinen Router crasht oder Riot.\nWenn du weißt, du hast Internet Probleme, spiel kein Ranked dann wirst Du auch nicht bestraft.","replies":[]},{"poster":"Time2Whine","date":"2017-01-23T11:41:31.397+0000","up_votes":1,"down_votes":0,"body":"Mit jedem Patch und bei der Erstinstallation des Clients akzeptierst du, dass nur du für deine Hardware, Internetverbindung etc. verantwortlich bist und du entsprechend bestraft wirst, wenn du trotz nicht 100 % funktionierender Hardware, Internetverbindung etc. Spiele machst.\nErgo, selber Schuld! Du solltest daher versuchen das Problem zu beheben und dich mit dem technischen Support in Verbindung setzen.","replies":[]},{"poster":"Lasse Laufen","date":"2017-01-23T11:14:03.219+0000","up_votes":1,"down_votes":0,"body":"Kann nicht sein, ich hatte auch schon \"oft\" die 20 Minuten Sperre, wenn man ca. 10 Games ohne die Sperre macht und wieder eines rausfliegt, bekommt man die nicht direkt.\n\nEntweder du hast in diesen letzten 4 Monaten kein Game gemacht, oder du bist deutlich öfter rausgeflogen. \n\nWas du ja auch zugibst, weil es ja \"crasht\". Ich würde wenn ich du wäre mal Lol Deinstallieren und wieder Installieren, oder diese Komplettreperatur machen. Vielleicht hilft es dir ja, das dein Lol nicht so oft abstürzt.","replies":[]},{"poster":"Werknuckle","date":"2017-01-22T07:58:22.510+0000","up_votes":1,"down_votes":0,"body":">  Ban lustig mein letzter Ban war vor ca 4 Monaten kann mir mal bitte mal erklären warum ?????\n\n4 Monate sind keine lange Zeit falls du das dachtest.\n\nUnd wie viele hier schon sagten, allein du bist dafür verantwortlich dass deine hardware i.O. ist. Ansonsten spiele bitte keine weiteren Spiele mehr bis du das Problem behoben hast, denn immerhin versaust du 9 anderen Spielern ihre Zeit und ihren Spaß.","replies":[]},{"poster":"Pandaphiri","date":"2017-01-22T01:41:36.719+0000","up_votes":1,"down_votes":0,"body":"riot ist nicht verantwortlich dafür zu sorgen das wenn deine hardware nicht funktioniert das zu detecten udn dir dafür zu verzeihen. DU hast dafür zu sorgen das deine hardware funktioniert.","replies":[{"poster":"Alustus100","date":"2017-01-22T03:43:35.069+0000","up_votes":1,"down_votes":0,"body":"zumal es schlicht nicht möglich ist.\nOb ich einfach den Stecker ziehe oder ob das Ding explodiert, macht was die Rückmeldung an Riot angeht keinen Unterschied.\nKein Signal ist kein Signal.","replies":[]}]},{"poster":"Alustus100","date":"2017-01-22T03:39:58.996+0000","up_votes":1,"down_votes":0,"body":"> Ich konnte nicht einmal was dafür da mein Router einfach Gecrasht ist ja super\n\nNa, wer ist den für deinen Router verantwortlich wenn nicht du?\n\n> Also ich muss ja echt sagen, nicht nur das mein Cliend so oft crasht und das nicht wegen mein Pc.\n\nBei mir ist der Client seid über 2 Jahren nicht mehr  gecrasht, also kann es sehr wohl am PC liegen (wenn auch vllt nicht an der Leistung)\nAuf jeden Fall würde ich vllt das Spiel mal komlett neu installieren und wenn das nichts hilft auf Fehlersuche gehen.","replies":[]},{"poster":"TachyonC","date":"2017-01-22T00:10:06.731+0000","up_votes":1,"down_votes":0,"body":"Wir alle haben solche Probleme mit dem client oder vill mal mit dem router, nur kümmern wir uns um diese Probleme. Auserdem, nur weil du \"nichts\" dafür konntest, hast du trotzdem das Spielerlebnis vieler Spieler durch ein AFK verschlechtert.","replies":[]}]}