{"poster":"Vi Sexual","date":"2016-02-19T06:30:59.992+0000","title":"Necesito ayuda \"mala racha\"","subforum":"Guias y consejos","up_votes":1,"down_votes":1,"body":"Lo que dice el titulo, no se si realmente es una mala racha o estoy haciendo las cosas para la mierda yo.\nPaso a explicar:\n\nTermine la preseason a 1 partida de subir a plata, en esta season quede en B5 pero no me molesto, en 2 dias subi a b2, segui jugando y como que &quot;me estanque&quot;. Y ahora vengo en picada, estoy en B3. No soy de culpar al team por perder las partidas, pero en las ultimas 20 partidas por lo menos, me vienen tocando algun que otro afk, alguna premade troll (como en la ultima partida), o feeders extemos. Yo intento no fedear, intento dejar kills, de hecho me pasa que saco mucha ventaja early, pero mi team se confia, empiezan a regalar kills, se fedea el equipo contrario, hacen exterminio y gg. Mucho no puedo hacer, o tal vez si, y es por eso que quiero saber, que hacer en esta situacion? Me flamean a mi por no morir, cuando se tiran 1vs4 por ejemplo. Les digo &quot;juntemonos y pusheemos mid, si forzamos la tf ganamos&quot; pero no lo hacen, y si lo hago solo me cago muriendo, se van a farmear la jungla, mientras tiran mid, o si uno inicia (ya sea yo u otro aliado) no ayudan, e INSISTO: NO ESTOY CULPANDO A MIS TEAMS, SI ESTOY EN RACHA DE PERDIDAS EL PROBLEMA SOY YO, pero no se CUAL es el problema conmigo.\nLa verdad ahora mismo estoy frustrado, se que hay algo que tengo que mejorar yo (si fuera y jugara perfecto estaria ya en challenger, como cualquiera) la cuestion es que S&Eacute; que mi problema no es mecanico (es decir, no es que no se farmear/gankear/no se usar mi campeon, etc.) mi problema esta en vision del juego supongo, o en algo mas.\nY la verdad necesito ayudar urgente, mi elo/mmr se hecho a perder, si sigo asi voy a terminar en bronce 5, no me molesta sinceramente, tal vez sea pesimo y merezca estar ahi, pero realmente quiero mejorar y subir, habia llegado a muy buenas rachas, y ahora, en unas partidas seguidas, baje, y no encuentro mi error; me esta carcomiendo la cabeza jajaja.\n\npd: dije mucho la palabra problema, tengo un problema (?\n\nSaludos y suerte.","replies":[{"poster":"Yrox the Third","date":"2016-02-19T06:38:44.887+0000","up_votes":1,"down_votes":2,"body":"Lo que puedes hacer en ese elo es esto, puede sonar agresivo pero es asi.\nSe egoista, abandona a tu team y anda a pushear, ignoralos completamente, saca kills y aprovechalos hasta el punto que tienen que enviar 2 o mas para detenerte, si pasa eso ya ganaste, porque mientras haces eso tu team puede sacar otra ventaja y asi vas a ir destruyendo al team enemigo lenta y dolorosamente mientras ven como su base es destruida pedazo a pedazo y empiezan a insultarse entre ellos preguntandose quien murio mas o quien te feedeo y van a empezar a caer en la locura y desesperacion mientras no saben si defienden inhibidor o baron y pierden los dos y se dan cuenta cuando ya es tarde que no pueden hacer nada mas que ver todos sus sueños y esperanzas destruidos en un segundo, y ver como la luz de sus ojos abandona su cuerpo.","replies":[{"poster":"Vi Sexual","date":"2016-02-19T07:25:58.513+0000","up_votes":2,"down_votes":0,"body":"Me gusta el tono oscuro de tu comentario (? jajaja\nEl problema es que al minuto 15 soy esa maquina de destruccion masiva (perdi una partida donde al minuto 10 iba 7-0, porque? porque cuando splitpusheaba mi team en vez de ir a sacar un objetivo, se ponia a farmear la jungla)\n\nTal vez tenga que ser mas agresivo aun, lo probaré.\nGracias por comentar.","replies":[]},{"poster":"Calihea","date":"2016-02-19T20:26:15.410+0000","up_votes":1,"down_votes":0,"body":"No es tan fácil splitpushear maestro, necesitás coordinación con el resto. Banco la parte de ser un poco egoísta, pero no flashees táctica.","replies":[{"poster":"Vi Sexual","date":"2016-02-20T23:09:02.708+0000","up_votes":1,"down_votes":0,"body":"Oh, Calihea comentó un post mio, jajaja\n\nTe sigo en Youtube, y la verdad sos un capo.\n\nCon el tema del splitpush se me complica bastante por eso que nombre arriba, cero coordinación, solito tirando top, muerto entre 3  y mi team queda en 5vs4, por eso no lo estoy implementando. Tampoco digo que no sea viable, de hecho en bronce es una de las estrategias que mas me convence, pero es bastante dificil de aplicar teniendo a un team que en mid game se farmea los pajaritos todo el tiempo, o un Garen 0/3 se manda a la jungla enemiga sin vision buscando kills. No le echo la culpa a mi team, claramente es mi error si me matan en un 1vs3. Es que simplemente no se que hacer ante una situación así (me refiero a tener ventaja, y tirar la partida a la basura, se que si hago un splitpush tengo que tener a un campeón duelista, o al menos estar feed, para que tengan que mandar a 2 o 3 a matarme, y obviamente tener wardeada la jungla enemiga para poder anticiparme)","replies":[]},{"poster":"Yrox the Third","date":"2016-02-19T20:32:00.565+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Calihea,realm=LAS,application-id=8sKIclmi,discussion-id=2R0PE5EU,comment-id=00000001,timestamp=2016-02-19T20:26:15.410+0000)\n>\n> No es tan fácil splitpushear maestro, necesitás coordinación con el resto. Banco la parte de ser un poco egoísta, pero no flashees táctica.\n\nSi, no es lo mas sencillo te apoyo en eso, sin embargo no es algo que te demores mucho en aprender.\nSi tienes un kill de ventaja por lo menos y sacas varios minions (y tienes un campeon AD, porque el unico champ AP que se me ocurre que podria hacer esto, es Ziggs) puedes ir a pushear, pero necesitas tener ciertos puntos especificos wardeados, siempre revisar el mini-mapa y cosas asi.\n\nNo es algo que dices \"ya lo voy a hacer por primera vez\" y terminas ganando la partida carreando facil, es algo que tienes que aprender, pero no es tan dificil.","replies":[]}]}]},{"poster":"Jota312","date":"2016-02-19T06:42:40.114+0000","up_votes":1,"down_votes":0,"body":"Mira cuando entras en racha negativa te baja el mmr/elo y te emparejan con gente mas mala y viceversa .(asi que es comun entrar en estas rachas).\n____________________________\n\nYo siempre intento varias cosas para salir de estas malas rachas : \n\n1- Sacar campeones que carren , los mids y adcs suelen ser los con mas daño y los junglas tienen la capacidad de fedear a mas de 1 linea(adc solo lo recomiendo si juegas duo , osino puede que no rinda por tu compañero \"random\").\n\n2- Jugar duo (o de a mas , ahora que se puede) , esto siempre es muy bueno, por que ? : simple al jugar con gente que conoces sabes que no seran ni trolls/feeders/flamer/ etc , y ademas si es posible puedes hablar con ellos y eso es fundamental en un juego en equipo , ya sea para sacar una kill un objetivo o matar al cangrejo.\n\n3- Analizar tus errores y mejorarlos (sin duda lo mas dificil) :\n\n-Ver su tu farmeo esta bien (no tiene por que ser de nivel lcs [100minionx10minutos] , pero si es importante siempre estar en una buena cifra , por ej 65-75 minions por cada 10min)\n\n-Tu aporte al wardeo del mapa , aun que parezca ridiculo TODOS deben ayudar aunque seas el adc o mid , tu debes ojala tener siempre 1 pink en el mapa y aportar con tu Baratija (y upgradearla apenas puedas).\n\n-Daño en la partida , es importante que siempre seas util en este ámbito , al terminar la partida lo puedes ver en las estadísticas\n\n-Pingear siempre que puedas , ya sea por que viste al jg o por que tu laner rival no esta.\n\n4- Jugar tus mains y si puedes jugar los campeones tier 1 (los mas fuertes del parche  [ http://www.nerfplz.com/ ]en la pagina puedes buscarlos como la \"god tier\",y cambia segun el parche)\n\n_________________________________________________________\n\nBueno ya nose me ocurre mucho mas , ojala leas y veas que puedes hacer para mejorar , todos tenemos malas rachas lo importante es salir de ellas \nSuerte ! :D","replies":[{"poster":"Vi Sexual","date":"2016-02-19T07:24:15.616+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias por los consejos. Rankeo siendo jungla, es la linea que mas comodo me siento sinceramente. \nLo que mas ruido me hizo es hacer duo, creo que voy a hacerte caso jajaja.\n\nMuchisimas gracias.","replies":[{"poster":"Sirek","date":"2016-02-19T13:39:54.169+0000","up_votes":1,"down_votes":0,"body":"Cuando eres jungla en este Elo, es importante tener más presencia que el jungla enemigo... Gankear, quizá no matar al enemigo pero gastarle el flash, para que juegue con miedo y no pueda estar comodo en la linea, y te aseguro que pusheara y podras al proximo gank matarlo. \n\nOtro tips es que eres el Jungla, puedes estar mirando mucho más el mapa que los demás, si vez que desaparecio una linea hace el mia, si vez que va el jungla pingue la advertencia. Aunque se enoje, tu dirige la defensiva. \n\nTrata de controlar la visión del Rio y si se puede tener vision de la JG Rival, para así poder trackearlo y evitar que gankee o hacer un countergank. \n\nLa build, es importante saber que armarte dependiendo de cada situación, no te vas armar MR contra puros AD, pero si el Fajin si tienen un zed en el enemigo (Se entiende).\n\nEso, además como mencionan de saber cuales son los personajes que estan en la TIER GOD o Tier 1 para jugar con ellos. \n\nSldos,","replies":[{"poster":"Vi Sexual","date":"2016-02-19T21:26:03.953+0000","up_votes":1,"down_votes":0,"body":"Ultimamente deje de lado la prescencia de las lineas, y estuve ultimamente mas afk farming jaja, error mio. \n\nRecomendas hacer counterjungla, o con mantener wardeado lo mas posible posible, gankear bastante y estar atento al minimapa alcanza? Porque la contrajungla es algo que me es bastante incomodo PERO si rinde bastante, podria practicarlo y mejorarlo.\nGracias por los consejos.","replies":[]}]},{"poster":"Jota312","date":"2016-02-19T07:53:31.905+0000","up_votes":1,"down_votes":0,"body":"No hay por que , para eso estamos xd\n\nLo del farmeo de 100x10min es para laners el de jungla es diferente .\n___________________________________\n\nOtra cosa que te recomiendo si eres jungla juega con un duo top o mid (con estos puedes hacer gankeos + tp , o gankeo mas roaming del mid y hacer los clasicos 4v2 , tambien puedes forzar el heraldo , invadir la jungla de manera mas facil ,etc) .\n\nAdc o suport no te sirven tanto como duo, pero si ya son premade de 3 seria perfecto un jungla mas la botlane entera .\n\nSuerte","replies":[{"poster":"Vi Sexual","date":"2016-02-19T12:11:04.666+0000","up_votes":1,"down_votes":0,"body":"> Mi duo es mi novia, y es main mid, no juega mal y estamos los dos en bronce (amor bronzodia jajajaja)\nYa he rankeado con ella y no nos va mal aunque a veces me pasa lo mismo, de terminar tirando a la basura una partida ganada, pero no estuve teniendo en cuenta lo de lograr el 4vs2 en bot y terminar sacando dragon y torre por ejemplo.\nNuevamente, gracias!","replies":[]}]}]}]}]}