{"poster":"Sister Support","date":"2018-06-06T06:38:36.396+0000","title":"Pyke nemico e \"tacchetta\" R","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"&Eacute; un ragionamento forse un po&#039; contorto per&ograve; ci provo: \r\nLa R di Pyke sotto una certa percentuale di vita (designata da una tacca) uccide sicuramente il bersaglio anche se dovesse flashare, fare magie come Harry Potter o urlare &quot;CENTO CENTO CENTO&quot; a mo&#039; di Iva Zanicchi. Fino a qui mi va tutto bene, ma mi sorge spontanea una domanda. Se io curassi il mio compagno di squadra di tanto abbastanza da portarlo fuori dalla tacca della R di Pyke ... verr&aacute; ucciso comunque oppure sopravviver&aacute;? Nel caso teorico in cui si possa salvare comunico che sul proprio team non viene indicata nessuna tacca sulla propria vita dal minuto in cui Pyke sblocca la R e quindi io da support non so di quanto curare il mio compagno; se invece non importa quante cure o scudi lanci perch&eacute; vince la priorit&agrave; di lancio della R di Pyke sulle tue abilit&agrave; ... Mi va bene uguale, basta saperlo, perch&eacute; ora come ora penso sia pi&ugrave; certo il caso negativo (morte del tuo compagno) per&ograve; ecco vorrei esserne certo al 100% prima di gridare al &quot;Eskereeee XD report Teemo omg Braum nashor tooth it&#039;s aram&quot;","replies":[{"poster":"P R O Void Omen","date":"2018-06-06T07:56:51.825+0000","up_votes":1,"down_votes":0,"body":"La ulti di pyke ignora gli scudi ma non le cure, nel momento in cui pyke ulta i nemici subiscono i danni dopo circa 0.5 sec. di animazione, se in quei 0.5 sec riesci a curare il tuo alleato oltre la soglia della R di pyke, sopravviverà. Ricorda però che se il tuo alleato muore nella X mentre pyke esegue l' animazione della R, perché ucciso da un alleato di pyke, da un mostro ecc. pyke ottera comunque il gold e il reset poiché basta che il nemico muoia nella X per ottenere il reset, non deve necessariamente essere ucciso da pyke. Comunque se curi un tuo alleato oltre la soglia lo salvi, se lo scudi no. Il flash comunque ti può salvare se riesci a uscire dalla X","replies":[{"poster":"P R O Void Omen","date":"2018-06-06T08:01:41.479+0000","up_votes":1,"down_votes":1,"body":"Ovviamente anche l' immunità, tipo zonia/ulti di Bard vanificano la R di pyke. Se il tuo alleato viene rebornato dopo essere stato ucciso nella X, pyke otterà comunque il reset della ulti, anche se il tuo alleato non è effettivamente morto, quindi fuck Guardian Angel, fuck Aatrox's passive, fuck anivia's egg, fuck zac's passive.","replies":[{"poster":"Sorcio84","date":"2018-06-06T09:51:24.679+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ProRannerSnaipah,realm=EUW,application-id=cAOZwaUi,discussion-id=j0juMiQ7,comment-id=00000000,timestamp=2018-06-06T08:01:41.479+0000)\n>\n> Ovviamente anche l&#x27; immunità, tipo zonia/ulti di Bard vanificano la R di pyke. Se il tuo alleato viene rebornato dopo essere stato ucciso nella X, pyke otterà comunque il reset della ulti, anche se il tuo alleato non è effettivamente morto, quindi fuck Guardian Angel, fuck Aatrox&#x27;s passive, fuck anivia&#x27;s egg, fuck zac&#x27;s passive.\n\nCredo che abbiano fixato. In un game ho ultato trynda in ulti con 1 hp e non ho avuto altre R.\n\nNegazione della morte, dei danni, e il resuscitare, dovrebbero negargli la ulty.\nInoltre soffre qualsiasi cc pur buildandosi offtank.","replies":[{"poster":"vivalasusina","date":"2018-06-06T10:20:57.247+0000","up_votes":1,"down_votes":1,"body":"se ulti un trynda in ulti non lo uccidi visto che è IMMORTALE ma ci sei ?","replies":[{"poster":"Sorcio84","date":"2018-06-06T17:41:09.658+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=vivalasusina,realm=EUW,application-id=cAOZwaUi,discussion-id=j0juMiQ7,comment-id=0000000000010000,timestamp=2018-06-06T10:20:57.247+0000)\n>\n> se ulti un trynda in ulti non lo uccidi visto che è IMMORTALE ma ci sei ?\n\nsi ci sono, ciao. ci stava un bug per il quale pyke che ultava in certe condizioni, resettava il cast della R\nhttps://www.youtube.com/watch?v=ZclWgXhwLHk","replies":[]},{"poster":"Vileblood Pyke","date":"2018-06-06T10:28:58.975+0000","up_votes":1,"down_votes":0,"body":"Quando Pyke era sul PBE riceveva il reset se colpiva Tryndamere/Kindred in ulti.\nhttps://youtu.be/ZclWgXhwLHk","replies":[]}]}]},{"poster":"Sister Support","date":"2018-06-06T08:44:00.788+0000","up_votes":1,"down_votes":0,"body":"Uh perfetto. Grazie <3 {{sticker:sg-ahri-2}}","replies":[]}]},{"poster":"wattbatt","date":"2018-06-06T09:49:10.359+0000","up_votes":1,"down_votes":0,"body":"ah aspetta questa non la sapevo, pyke dà i soldi del kill se killa lui ma li riceve anche se qualcun altro killa ?","replies":[{"poster":"Mh012","date":"2018-06-09T14:31:56.201+0000","up_votes":1,"down_votes":0,"body":"Dà i Gold a coloro che hanno partecipato solo se lui riesce a killarlo di ulti, a quanto ne so","replies":[{"poster":"P R O Void Omen","date":"2018-06-10T10:15:05.048+0000","up_votes":1,"down_votes":0,"body":"No, basta che muore il nemico nella X. Se ad esempio nel momento in cui ulti la tua cait uccide un nemico nella tua X, la spell viene eseguita, il cd resettato e ottieni \"la tua parte\". Almeno questo è ciò che mi è successo un paio di volte. Penso che non sia un bug, dopotutto ci sta che un champ singolare e pieno di limitazioni come pyke abbia una ulti sbroccata","replies":[]}]}]}]}]}