{"poster":"DBS Ronovon","date":"2018-03-27T22:42:21.892+0000","title":"League, is it comepetitive or not?","subforum":"Gameplay","up_votes":2,"down_votes":3,"body":"League of Legends is not competitive. \r\nHave you ever seen a football season where every team ends up with a 50% win rate? \r\nNo. \r\nWhy? Because in professional sports, there is no MMR. \r\n\r\nWhy is the MMR system in place, even thought it takes the winning a losing out of the player&#039;s hands because different skill levels play against each other, creating this 50% win/loss ratio. \r\nThe LCS claims to be competitive e sports, so why isn&#039;t League of Legends? \r\nDoesn&#039;t this seem odd to you, the player? \r\nRiot, what do you have to say about this? \r\nWhy is there a hidden system that places people in games they can&#039;t win, and also in games that they will win without trying? \r\nWhy not let players just hash it out and use the regular ranking system to match people of the same skill level until they promote? \r\n\r\nLeague of Legends is not a competitive game, its a player experience based game, that rigs your matches to be very easy by placing people against you with way lower skill level if you lose too many games, and it also makes sure you can&#039;t climb by placing you with those same low skill people but against higher skill level people, so you get stomped.\r\n \r\nWhat a shady system, that really pisses me off. I am so sick of the existence of this system, and would like to see something done about this, so we can have an actual competitive game. \r\n\r\nImagine I am lifting weights, and I can lift only 100lbs, and I slowly progress to 130 over time. Well if you put the concept of MMR in the mix, I would all of the sudden have to lift 350lbs, and die so I don&#039;t keep progressing too fast. Then after that I would be injured and have to keep failing my lifts, until my MMR makes me lift 30lbs, which is so low and easy to lift, but if I lift 30lbs then 40 lbs, then 50 lbs, the MMR would jump me back up to 350lbs just to make sure I don&#039;t have success, and injure me. \r\n\r\nCool stuff huh guys. \r\n{{champion:45}}","replies":[{"poster":"MagicFlyingLlama","date":"2018-03-27T22:47:44.760+0000","up_votes":1,"down_votes":0,"body":"If you want to see what LoL would be like without any matchmaking system, go play blind pick on a new account.\n\nYou will get to see that the winrate still averages to exactly 50%, because anything else is impossible.\n\nYou will also see the player no longer has any control over winning or losing - it is completely dictated by which team gets the bronze V guy or the fresh lv30 9-year-old with rage issues.\n\nPro Sports also have a 'rank' system - usually something like casual local teams, highschool teams, college teams, minor league, major league.\n\nImagine a baseball or football game where the players got randomly picked from all of the above.","replies":[]}]}