{"poster":"jiraiya47","date":"2015-02-16T13:13:17.440+0000","title":"Ahri's q und Yasuo's Windwall","subforum":"Melde einen Bug","up_votes":3,"down_votes":0,"body":"Hallo Community \r\n\r\nMir ist jetzt schon öfters passiert wenn ich mit Ahri die Q auf Yasuo mache und der erste Angriff dann auch trifft aber wenn die Kugel danach zurück fliegt (die Kugel ist jetzt hinter Yasuo) und Yasuo dann vor ihm den Windwall macht (also nicht in Richtung zur Kugel sondern in meine Richtung)  das sich die Kugel dann einfach in Luft auflöst und dann keinen dmg macht obwohl sie ihn eigentlich treffen müsste.\r\n\r\ndaher meine Frage: soll das so sein oder ist das ein Fehler bzw. ist das euch auch schon passiert?\r\n\r\nund Entschuldigung für Rechtschreibfehler oder ähnliches ich hab das auf dem i pad geschrieben und da etwas zu tippen kann schon mühselig sein also nicht zu kritisch sehen^^","replies":[{"poster":"jiraiya47","date":"2015-02-16T15:25:48.825+0000","up_votes":1,"down_votes":0,"body":"danke für die Antworten :) \naber nochmal um sicher zu gehen. Ist das jetzt beabsichtigt dass sich der Wall hinter ihm zu formieren beginnt?\n\nDenn das ist manchmal echt nervig :/","replies":[{"poster":"Black Mage","date":"2015-02-16T15:50:43.045+0000","up_votes":1,"down_votes":0,"body":"das ist \"normal\" und ich behaupte mal auch \"beabsichtigt\", da das schon speziel bei yasuo ist (er lässt die wand auch leicht nach vorne schieben, nachdem er diese erschaffen hat).\n\n\nAber ich finde das schon teilweise nerfig, weil er beinah zu 100% gegen jedes projectil geschützt ist wenn er die W macht (jedenfalls für einen kurzen Moment)","replies":[]}]},{"poster":"Black Mage","date":"2015-02-16T13:56:03.680+0000","up_votes":1,"down_votes":0,"body":"die wand beginnt leicht hinter yasuo sich zu formieren, vlt kommt es davon?","replies":[{"poster":"Dat Ding15","date":"2015-02-16T14:11:45.716+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Red Mage,realm=EUW,application-id=ImBE6GqA,discussion-id=uBPqhKf9,comment-id=0001,timestamp=2015-02-16T13:56:03.680+0000)\n>\n> die wand beginnt leicht hinter yasuo sich zu formieren, vlt kommt es davon?\n\nGenau Das meinte ich :D Wusste nicht wie ich es so einfach formulieren kann wie du xD","replies":[]}]},{"poster":"Dat Ding15","date":"2015-02-16T13:18:50.296+0000","up_votes":1,"down_votes":0,"body":"Ist denk ich ein bekannter Windwall bug von Yasuo.\nBeim Ausführen der Windwall bewegt sie sich zuerst hinter Yasuo nach vorne.","replies":[]}]}