{"poster":"KORGtuners","date":"2017-04-03T16:44:15.473+0000","title":"How does the IFS learn?","subforum":"Player Behavior","up_votes":3,"down_votes":2,"body":"**First question: **Does the IFS ever review a game without reports?\r\n\r\n**Second question: **How does the IFS determine what is punishable? \r\n\r\n**Third question:** How does the IFS determine what is not punishable?","replies":[{"poster":"Warlord Scrap","date":"2017-04-03T16:49:52.174+0000","up_votes":3,"down_votes":0,"body":"its reviews games that are reported and gets hot words that are commonly used by toxic players.  Some words are considered never to be toxic like the or i.  lets use kys for example. say over the next week kys is used in 300 games. Of those 300 games the player who used it is reported 270 times.  The system can now add it as a toxic word.","replies":[{"poster":"KORGtuners","date":"2017-04-03T17:05:56.642+0000","up_votes":1,"down_votes":0,"body":"1. yes?\n2. combination majority rule and Riot\n3. it doesn't?","replies":[{"poster":"Warlord Scrap","date":"2017-04-03T17:43:55.043+0000","up_votes":2,"down_votes":0,"body":"1. the ifs reviews all game but will only punish for extreme offenses without reports so it can based no toxic words to toxic words and continue to learn.  feeder buster and leaver buster are separate from the language ifs. \n2.  riot has set aside most basic words as non punishable and set some words as always punish (homophobia and racism)\n3.  The ifs takes multiple things into consideration including context of the whole sentance (report ahri for feeding is possibly punishable, report ahri for no skin ifs realizes is a joke)","replies":[{"poster":"KORGtuners","date":"2017-04-03T17:49:06.216+0000","up_votes":1,"down_votes":0,"body":"> The ifs takes multiple things into consideration including context of the whole sentance (report ahri for feeding is possibly punishable, report ahri for no skin ifs realizes is a joke)\n\nDo you happen to know if that is a dynamic system? Or, does Riot decide the parameters?","replies":[{"poster":"Warlord Scrap","date":"2017-04-03T17:53:51.092+0000","up_votes":2,"down_votes":0,"body":"A mixture riot has stated that they try and let the community decide but riot does random manual audits for quality assurance.  Same someone is report in half of the games they play riot will review there games and decide if they are toxic or not then tweak ifs if they deem the player toxic.  For the most part it seems to be mostly dynamic though.","replies":[{"poster":"KORGtuners","date":"2017-04-03T18:16:04.495+0000","up_votes":1,"down_votes":0,"body":"Riot has absolute undisputed vote. \n\nOnce something crosses the threshold into \"negative behavior\", only Riot can put it back to unpunishable.\n\nIs my summary correct?","replies":[{"poster":"Warlord Scrap","date":"2017-04-03T18:45:06.038+0000","up_votes":1,"down_votes":0,"body":"yes.","replies":[]}]}]}]}]}]}]},{"poster":"elduris","date":"2017-04-03T17:21:38.935+0000","up_votes":5,"down_votes":2,"body":"Given my knowledge of IFS, here's my take on the questions you asked.\n\n> [{quoted}](name=KORGtuners,realm=NA,application-id=ZGEFLEUQ,discussion-id=TJ9JAMWb,comment-id=,timestamp=2017-04-03T16:44:15.473+0000)\n>\n> **First question: **Does the IFS ever review a game without reports?\n\nIn some cases, yes. Intentional feeding or extreme racism in chat don't need a report to trigger a review.\n\n> **Second question: **How does the IFS determine what is punishable? \n\nBased on data from previous games/reports, input from players, and parameters set by the designers.\n\n> **Third question:** How does the IFS determine what is not punishable?\n\nBased on input from players and parameters set by the designers.\n\nIt's not so much \"if X exists, then punish\", it's more \"if negative behavior exists, then begin review\" and what happens during the review process determines if a punishment is handed out. You will never be able to find a strict, comprehensive list of things you can/can't do. For one, it would be way too long, and for two, you can always find ways around the existing list to proliferate negative behavior, so keeping a list would be too much work for little benefit.","replies":[{"poster":"scazzman","date":"2017-04-04T01:46:04.965+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=elduris,realm=NA,application-id=ZGEFLEUQ,discussion-id=TJ9JAMWb,comment-id=0001,timestamp=2017-04-03T17:21:38.935+0000)\n>\n> Given my knowledge of IFS, here&#x27;s my take on the questions you asked.\n> \n> In some cases, yes. Intentional feeding or extreme racism in chat don&#x27;t need a report to trigger a review.\n> \n\nis this the same for 5 man premades?","replies":[]},{"poster":"KORGtuners","date":"2017-04-03T17:35:13.783+0000","up_votes":1,"down_votes":1,"body":"> Third question: How does the IFS determine what is not punishable?\n\n\n`\n> Based on input from players and parameters set by the designers.\n\nWhat do you mean? Specifically, where would one player give their input?","replies":[{"poster":"Kei143","date":"2017-04-03T18:17:29.137+0000","up_votes":1,"down_votes":0,"body":"Post game reports.\n\nAFAIK, if a word / phrase is commonly used, but not reported, it means the community is ok with it. Thus more likely to be classified as a false report.","replies":[]},{"poster":"elduris","date":"2017-04-03T19:53:18.041+0000","up_votes":1,"down_votes":1,"body":"Players can give input about what is acceptable vs unacceptable via the report system in the post-game lobby.","replies":[]},{"poster":"Zezockary","date":"2017-04-03T18:25:08.681+0000","up_votes":1,"down_votes":1,"body":"The additional comments you can type in at the end of the report.","replies":[]}]}]},{"poster":"KVbqbFsC8e","date":"2017-04-03T19:58:14.165+0000","up_votes":2,"down_votes":6,"body":"It doesn't. In reality its just a system that scans for certain keywords.","replies":[{"poster":"RoddyMcFly","date":"2017-04-04T18:56:00.120+0000","up_votes":2,"down_votes":1,"body":"Who are these players who keep scanning the boards for anyone who is being honest and downvoting? This is clearly a conspiracy to hide the truth about League's many issues.","replies":[]}]}]}