{"poster":"TankerInc","date":"2016-04-23T23:36:26.422+0000","title":"B4 B5 Look for help","subforum":"Esports","up_votes":1,"down_votes":0,"body":"Hi. I signed up to some site that offers free coaching for players like my self looking to improve there level of understanding. \r\nBut this isn&#039;t working out so well.. \r\n\r\nMost of them don&#039;t even care about it or just want to act pro and offer no real help.\r\n\r\nSo now I am making a post here looking for a coach / Someone to help me improve and stay out of B5.\r\n\r\n\r\nAbout me.\r\n\r\nBeen playing LoL for a very long time.. Since hec was released. I started to do rank and well. Owning in normal games. Is not the same as owning in Rank games. So I suck.\r\nI was placed into B5 and I would go from B5 to B4 to only go back down to B5 then to go back up to B4... This is where I have been for a long time.\r\nEach time I just give up and stop playing this game because I am not growing. It is the same thing OVER AND OVER.\r\n\r\nI make it to B4 get about 50 LP.. Back down to B5 with zero points. Then again back up to B4 and back down again.\r\nSo I signed up to http://www.lol-coaching.com/ in hope of finding someone to help me. But this isn&#039;t working out.\r\n\r\nYou are only as good as the player you face. When you only ever face B5.. You are only as good as B5. \r\nSo if someone can help me out. Offer some time to help me understand what i am doing wrong and what I am doing right. I would really love it.","replies":[{"poster":"in3x","date":"2016-04-24T05:01:02.536+0000","up_votes":2,"down_votes":0,"body":"Add me on both of my accounts, Kylo Ren and in3x. I have peaked gold 3, I am not that good but I can definitely help bronze players and enjoy it very much. I will be willing to help you :){{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"TankerInc","date":"2016-04-24T05:25:59.401+0000","up_votes":1,"down_votes":0,"body":"Thank you. I will add you.","replies":[]}]},{"poster":"Aidan7787","date":"2016-04-24T06:16:21.317+0000","up_votes":1,"down_votes":0,"body":"I am exactly the same atm :(","replies":[]},{"poster":"Master Farmer","date":"2016-04-24T00:04:03.679+0000","up_votes":1,"down_votes":0,"body":"I will give you one tip. FInd the champion you are strong at and enjoying playing then play the hell out of him in norms then in ranked. You will climb. Usually champs which not many people play are the best as people don't know how to play against them.","replies":[]}]}