{"poster":"The Zahir","date":"2017-06-06T18:00:37.689+0000","title":"Silber/Gold ADC | Mitspieler gesucht (DuoQ/Team/3v3)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hall&ouml;chen und einen wundersch&ouml;nen Abend... Mittag? Morgen? Wie auch immer,\r\n\r\nnach einer langen Pause, was zum Teil auch an meiner Arbeit lag, wollte ich mich nun wieder an League of Legends herantasten.\r\nDas macht aber alleine nur halb so viel Spa&szlig;, deshalb suche ich hier nach Mitspielern. Entweder f&uuml;r DuoQ (&uuml;ber Langzeit) oder als Team (Ebenfalls &uuml;ber Langzeit). Am besten mit jemanden oder einem Team wo man auf l&auml;ngere Zeit zusammen spielt, damit man sich blind aufeinander anpasst. Nat&uuml;rlich hei&szlig;t da nicht das ich kein Spa&szlig; am Spiel habe, nur weil ich es mag auch mal ernster zu spielen, nein, im Gegenteil; Ich bin sogar der erste der lacht wenn der Drache gestohlen wird. Genug Text, die meisten sind eh schon eingeschlafen, kommen wir zu den harten ;) Fakten.\r\n\r\nIch bin unterwegs als Zahir, bin 19 Jahre jung und arbeite derzeit 30 Stunden die Woche, was hei&szlig;t ich habe eigentlich noch relativ viel Freizeit um League of Leggins zu spielen. Vor meiner doch nun l&auml;ngeren Pause war ich Gold, habe dannach aber nur noch die Placements gespielt und war sogar mit Silber zufrieden. Denn der bunte Rahmen ist f&uuml;r mich eigentlich unwichtig, ich wei&szlig; das ich mich verbessern m&ouml;chte, und kein goldener Rahmen zeigt mir ob ich es hab oder nicht.\r\n\r\nMeine Main-Rolle ist ADC, ausweichen kann ich auf die MIdlane.. Ich kann sogut wie jeden ADC spielen, au&szlig;er Kog&#039;maw und Xayah (Da ich diese beiden noch garnicht besitze) was hei&szlig;t das ich sehr flexibel bin. Aggressive oder Passiv, ich spiele beides sehr gerne und orientiere mich oft an meinen Supporter. Meine besten ADC&#039;s sind {{champion:81}} {{champion:119}} {{champion:236}} {{champion:29}} {{champion:429}} {{champion:202}}  \r\n\r\nWer Lust und Laune hat kann mich ja einfach im Client hinzuf&uuml;gen oder hinterl&auml;sst hier eine Nachricht nach dem Signalton\r\n\r\nBEEP!\r\n\r\nP.S.: Achja. Am liebsten mit Voice. Teamspeak oder Discord. Geht aber auch ohne.","replies":[]}