{"poster":"red panda z","date":"2016-08-07T19:22:32.031+0000","title":"Suggestion: Reroll for Rare Gems concept.","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Right now, Rare Gems can be acquired in two ways: You can either get really lucky, and have one appear in a chest (a rate that requires years of earning chests for free to get 10) or you can spend almost 3000 RP on the PROJECT chest bundle in the shop right now, a bundle that will go away eventually. That 3000 RP will earn you 1 Rare Gem. This is either an extremely lengthy process, or a massively expensive one. It&#039;s also really defeating on players to have no way to work toward the 10 rare gems skins. All you can do is cross your fingers that you&#039;ll have 10 in less than 2-3 years or crack out the wallet and spend enough money that could&#039;ve bought you a PS4.\r\n\r\nCould there be another way to earn Gems, a way that players can actually work toward that doesn&#039;t rely on hilariously expensive purchases or complete randomization?\r\n\r\nMy suggestion would be to allow players to reroll skin shards into rare gems. Right now, I have no reason to reroll all my skin shards. I&#039;ve learned that doing so only ends up unlocking skins I don&#039;t like for champions I don&#039;t use. It would be different if the skin permanents didn&#039;t immediately unlock the content I will never touch and instead returned to my inventory so I could decide what to do with it, but that isn&#039;t how it works right now. But that could be a nice way of dealing with the gems.\r\n\r\nIf skin permanents didn&#039;t immediately unlock the skins of champions you own, and instead would always go into your inventory so you could decide if you wanted to unlock that skin, then you could have rerolling 3 skin permanents be the method for unlocking Rare Gems. Thats a goal that requires time still, but it would allow players to work toward those 10 Gem skins in a way that didn&#039;t require luck or lots and lots of money.","replies":[{"poster":"Nightjar","date":"2016-08-07T23:11:09.627+0000","up_votes":1,"down_votes":0,"body":"It seems to be alot about luck. I've just been farming hextech since it was released and I have 2 gemstones atm. Not sure I'll be able to get to 10 though, so I might just forge them into chests.\n It would be cool if we could swap hextech loot with friends though since I have a friend who is a vayne main who has like 7 gemstones (after spending alot of money) and another friend who has 1 gemstone as well. We could transfer all the gems to him and he could get soulstealer vayne and he could give us some of his rarer champion shards as recompense, everyone wins. Probably never going to happen though. {{item:3070}}","replies":[]}]}