{"poster":"Channira","date":"2015-09-04T09:30:04.503+0000","title":"Wie sieht euer EU-Dreamteam aus ?","subforum":"Esports","embed":{"description":"After the confetti descends at the 2015 World Championship, we'll head into the offseason with players around the world setting their sights on our last international event of the year. The 2015 All-Star Event (ASE) will bring the unexpected to the Rift featuring a clash of the regions, epic 1v1 matches, fan-voted comps, fun game modes, and mixed region roster showdown.","url":"http://euw.lolesports.com/articles/2015-all-star-event","image":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/styles/article_image/public/ASE_800x315_lolesportsheader_01.jpg?itok=4YG8zxLV"},"up_votes":3,"down_votes":0,"body":"Guten Morgen,\r\n\r\nwie viele von euch wahrscheinlich schon mitbekommen haben findet im Dezember wieder das All-Star Event statt. Deswegen wollte ich euch mal fragen, wie euer Dreamteam f&uuml;r EU aussehen w&uuml;rde ?!\r\n\r\n2013 bestand das EU Team aus 4 Spielern von Gambit Gaming (Diamond, Alex Ich, yellowpete, EDward) und SoaZ. Ich denke dieses Jahr wird es darauf rauslaufen, dass das EU-Team fast nur aus Fnatic Spielern bestehen wird.\r\n\r\nMein Team w&uuml;rde so aussehen:\r\n\r\n**Top: SoaZ.** Er ist meiner Meinung nach einfach der beste Top-Laner in EU und er hat es in den Finals auch nochmal deutlich gezeigt. MonteChristo   bezeichnet ihn in einem Video sogar als besten Gangplank Spieler der Welt. Und 2013 hat SoaZ auch das 1 vs 1 Event der Toplaner gewonnen.\r\n\r\n**Jungle: Amazing/Reignover.** Kann mich nicht entscheiden...\r\n\r\n**Mid: PowerOfEvil. **Mitte war f&uuml;r mich eine schwere Entscheidung. Ich finde, dass es auch Febiven oder Nukeduck verdient h&auml;tten, aber da ich Deutscher bin, bevorzuge ich nat&uuml;rlich PoE. \r\n\r\n**ADC: Niels.** Rekkles ist im Moment noch der beste ADC in EU, aber Niels hat eindeutig das Potenzial auch irgendwann zu werden. Und da ich ein Origen-Fanboy bin w&uuml;rde ich lieber Niels sehen.\r\n\r\n**Support: YellowStar.** Er ist einfach der beste Support in EU und das kann glaub auch niemand abstreiten.\r\n\r\n\r\nIch bin auf eure Dreamteams gespannt. \r\n\r\nViele Gr&uuml;&szlig;e \r\nChannira","replies":[{"poster":"StitchStar","date":"2015-09-08T08:53:04.054+0000","up_votes":1,"down_votes":0,"body":"TOP: Cabochard\n(Odoamne hätte ich auch noch nehmen können aber finde Cabochard ist stärker in der Lane und bei so Turnieren ist das wichtig, da man eh nicht so eingespielt ist als Team. Huni ist zwar der beste aber fühlt sich nicht richtig an für ein EU-Dreamteam.)\n\nJGL: Amazing \n(Svenskeren ka. ob der überhaupt EU LCS spielt und die nötige Motivation noch hat, daher Amazing weil er auch schon mehr erreicht hat als Jankos.)\n\nMID: Febiven \n(POE hat einen fragwürdigen Championpool vom Skill aber auch gut, der Febiven spielt fast alles in der Meta.)\n\nADC: Freeze\n(Forgiven war auch eine Option aber ka ob der EU LCS spielen wird. Ich persönlich steh nicht so auf diese cleanup ADCs, deswegen konnte es nur einer von beiden erprobten ADCs werden. Wenn man einen cleanup ADC haben will würde ich Niels oder Hjärnan bevorzugen, weil ich denen Ihren Support auch rein wählen würde ins Team.)\n\nSUP: Kasing  \n(Mithy hätte es auch werden können aber ich denke Kasing ist einen Tick besser in der Lane. YellOwStaR war keine option da seine stärken eher vom Teamplay kommen wie bei Odoamne.)\n\nIch hoffe war einigermasen verständlich warum ich die Spieler genommen habe oder auch nicht. Ich bin mir nur nicht sicher wer Shot-Caller ist in meinem Team da diesen Aspekt nicht wircklich mit berücksichtigt habe. Wenn mein Team aber noch einen braucht dann würde ich Odoamne in das Team holen, der ist auch eingespielt mit Kasing was Shot-Calling angeht.\n\nHier eine zweite Variante mit mehr Teamplay und denk Shot-Calling so genau sagen die Teams ja nicht wer was macht.:\nTOP: Odoamne \nJGL: Amazing \nMID: Febiven (Febiven hat früher in dem H2K Team gespielt bevor er zu Fnatic ging.)\nADC: Hjärnan \nSUP: Kasing  ","replies":[]},{"poster":"MrPuffin","date":"2015-09-06T16:15:57.743+0000","up_votes":1,"down_votes":0,"body":"Top:  SoaZ/Holo\nJungle: Reignover/Jankos (Obwohl Amazing mein Lieblingsspieler ist)\nMid: Ryu/Febi\nAdc: Nieeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeels\nSupp: Mithy/Yolostar\n\n\nOG FTW","replies":[]},{"poster":"staubi22","date":"2015-09-06T10:21:52.518+0000","up_votes":1,"down_votes":0,"body":"Top: Soaz\nJungle: Amazing\nMid: Nukeduck/ Febiven\nADC: Rekkles\nSupp: Yellowstar","replies":[]},{"poster":"Leberwurstfrau","date":"2015-09-04T11:47:38.364+0000","up_votes":1,"down_votes":0,"body":"Top: Soaz\nJungle: Reignover\nMid: Febiven\nADC: Rekkles\nSup: YellowStar\n\nWürde dir im großen und ganzen zustimmen. Aber ich finde in der letzten Zeit hat Powerofevil einfach nicht überzeugt ich denke Mitte müsste an Febiven gehen.","replies":[]}]}