{"poster":"VadKUtyAA","date":"2015-09-01T11:25:40.038+0000","title":"Bejelentkezési hiba (A bejelentkezési szerver nem válaszolt...)","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Sziasztok az a baj hogy be lepek a lol-ba es eszt irja ki Bejelentkez&eacute;si hiba (A bejelentkez&eacute;si szerver nem v&aacute;laszolt...) es el szamol 3-ig es ki ad olyan oldalakat ami semire se jok mindent ki probaltam   internet , minden  de semi  , tudnatok segicseget adni/___???","replies":[{"poster":"Szabadkőműves","date":"2015-09-04T14:33:40.961+0000","up_votes":1,"down_votes":0,"body":"Az XP-s felhasználóknál egyszerű a megoldás, talán win7-nél is, vagy újra kell telepíteni a netkeretrendszert vagy csak simán letölteni a 3.5-s verziót és működni fog.","replies":[]},{"poster":"Zooty","date":"2015-09-01T12:21:20.286+0000","up_votes":1,"down_votes":0,"body":"Bejelentkezési hibákra [itt](https://support.riotgames.com/hc/hu/articles/201761944) találhatsz gyógyírt! \nHa ezek egyike se segített, írj rá a [játékostámogatásra](https://support.riotgames.com/hc/hu/requests/new), ők biztosan tudnak majd segíteni!","replies":[{"poster":"VadKUtyAA","date":"2015-09-03T11:20:02.761+0000","up_votes":1,"down_votes":0,"body":"Szia hat mar 2- napja nem kapok valaszt ot se nem tuc valami megoldast ?? windos xp van","replies":[{"poster":"Zooty","date":"2015-09-03T12:29:22.841+0000","up_votes":1,"down_votes":0,"body":"Sokan írnak a játékostámogatásnak, úgyhogy sajnos van amikor napokba telik mire sorra kerülsz. Nyugi, válaszolni fognak!\n\nAz a baj, hogy rengeteg oka lehet ennek a hibának. A cikk amit linkeltem lefedi a leggyakoribbakat. Innentől kezdve, mi csak tippelni/próbálgatni tudunk. \nMegy-e másik gépről a lol? Ha igen, akkor a gépeden van valami..\nRouter kiiktatásával (közvetlen kapcsolattal) működik? Ha igen, a router blokkolja a kapcsolatot valamiért.\nIlyen próbálkozásokkal megpróbálhatod belőni, hogy hol lehet a probléma forrása, de biztosat majd a játékostámogatás fog mondani..","replies":[{"poster":"VadKUtyAA","date":"2015-09-03T13:39:49.137+0000","up_votes":1,"down_votes":0,"body":"es ha az nternet Explorer van baj es le szeretnem tolteni az EI 8 at akor a regit ki kell torojem , mert korul nesztem egy kicsit es hat ha aval van baj","replies":[{"poster":"Mókusmedve","date":"2015-09-03T18:02:15.819+0000","up_votes":1,"down_votes":0,"body":"A játékostámogatás ugyan azt a linket fogja írni, mint Vadhalál, nekem is annó fenn állt ez a hiba. Jó helyen keresgélsz szerintem, én leszedtem a legfrissebb Internet Explorert és volt, nincs hiba. Ne add fel! :)","replies":[]}]},{"poster":"VadKUtyAA","date":"2015-09-03T12:59:38.113+0000","up_votes":1,"down_votes":0,"body":"oke kosze hat ak meg probalok mindent hatha megy","replies":[]}]}]},{"poster":"VadKUtyAA","date":"2015-09-03T15:18:16.973+0000","up_votes":1,"down_votes":0,"body":"nha megy a lol - le toltotem az internet explorert 8-at es megy ad tovab eszt leci ha valaki le tolti es ilyen problemaja van akor meni fog","replies":[]}]}]}