{"poster":"Anubis Raven","date":"2016-07-04T20:01:11.014+0000","title":"Dissero che giocare con i troll era impossibile","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"ciao a tutti,\r\npurtroppo non ho foto per dimostrare quello che dico, ma potreste andare sulla mia cronologia delle partite per vederlo voi stessi!\r\nIniziando dal principio, leggo spesso sul forum di giocatori che si lamentano del fatto che perdono per i troll ecc...e volevo rispondere per tutti quanti, non importa quanti troll hai in squadra, se gli altri giocano bene si puo sempre vincere, e volevo sfatare il mito del il troll ha feedato tutti e abbiamo perso per quello, lo sanno tutti che dopo un po&#039; che tizio caio muore di seguito non dara tanti gold, dopo 8 morti di fila dara a chi lo uccider&agrave; piu o meno 70 gold che sono 5 minion piu o meno, eeeeeeee quelle 8 morti possono essere delle morti normali se ci pensate, anche se non avesse trollato magari le avrebbe potute fare cercando di aiutare la squadra, ma comunque tornando all&#039;inizio,\r\n-oggi iniziai una partita di ranked in modo da andare in promo per il silver 2, io ho scelto il mio Braum come support e tutti quanti hanno scelto gli altri, scambiandosi anche di ruolo, avevamo un jungler senza maestrie e senza smite, e gi&agrave; da quel punto pensai &quot; che palle perche devo trovarmi un imbecille proprio ora&quot; la questione non fini li, perche essendo un support dovrei anche aver un buon adc, ma non fu cos&igrave; perche avevo bot non so se un first time oppure un troll oppure un first time troll, ma avevo un ashe che si era buildata dal primo secondo solo atk speed fino alla fine senza scarpe fino alla fine.\r\nuno potrebbe pensare, che io sia stato sfortunato, ma non fu cos&igrave;, certo ashe fecce cagare per&ograve; non mi lamentai del fatto che il nostro khazix senza maestrie senza rune e senza smite era finito 15/3/2 eh ahime ashe 4/9/10 ma ci siamo fatti valere sia io che il midlaner con Vladimir e il toplaner con Nasus, vincendola malamente, e da quel momento ho capito una cosa.\r\nCHE &eacute; DAVVERO BRUTTO GIOCARE CON UN ADC TROLL MENTRE SONO IL SUPPORT","replies":[{"poster":"WuBerna","date":"2016-07-04T21:52:08.957+0000","up_votes":4,"down_votes":0,"body":"4/9 troll? PLS","replies":[{"poster":"DivusAugustus","date":"2016-07-05T11:35:37.038+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bernarda,realm=EUW,application-id=MJVj50Jw,discussion-id=2G9EkKEd,comment-id=0002,timestamp=2016-07-04T21:52:08.957+0000)\n>\n> 4/9 troll? PLS\n\nCome dice lei ( o lui? ) il fatto che l' adc faccia 4/9 non significa che sia un troll, ne' che sia un first time. Inoltre le scarpe non danno particolari stats ( neanche le tier 2, dopotutto ) fuorche' la velocita' di movimento ( che ottieni comunque, con il Runaan's ad esempio ) per cui non e' così strano che non se le sia buildate fino alla fine, essendo rimasto indietro. \nE poi non so se sia solo un' impressione mia, ma quel tuo modo di scrivere e quella '' morale della favola '' alla fine non fanno altro che darmi l' impressione che tu ci stia trollando tutti.. [ da genius ]\nUn saluto a tutti i support main,\nDivusAugustus.","replies":[]}]},{"poster":"floodcf","date":"2016-07-05T08:22:28.454+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Anubis Raven,realm=EUW,application-id=MJVj50Jw,discussion-id=2G9EkKEd,comment-id=,timestamp=2016-07-04T20:01:11.014+0000)\n>\n> ciao a tutti,\n> purtroppo non ho foto per dimostrare quello che dico, ma potreste andare sulla mia cronologia delle partite per vederlo voi stessi!\n> Iniziando dal principio, leggo spesso sul forum di giocatori che si lamentano del fatto che perdono per i troll ecc...e volevo rispondere per tutti quanti, non importa quanti troll hai in squadra, se gli altri giocano bene si puo sempre vincere, e volevo sfatare il mito del il troll ha feedato tutti e abbiamo perso per quello, lo sanno tutti che dopo un po&amp;#039; che tizio caio muore di seguito non dara tanti gold, dopo 8 morti di fila dara a chi lo uccider&amp;agrave; piu o meno 70 gold che sono 5 minion piu o meno, eeeeeeee quelle 8 morti possono essere delle morti normali se ci pensate, anche se non avesse trollato magari le avrebbe potute fare cercando di aiutare la squadra, ma comunque tornando all&amp;#039;inizio,\n> -oggi iniziai una partita di ranked in modo da andare in promo per il silver 2, io ho scelto il mio Braum come support e tutti quanti hanno scelto gli altri, scambiandosi anche di ruolo, avevamo un jungler senza maestrie e senza smite, e gi&amp;agrave; da quel punto pensai &amp;quot; che palle perche devo trovarmi un imbecille proprio ora&amp;quot; la questione non fini li, perche essendo un support dovrei anche aver un buon adc, ma non fu cos&amp;igrave; perche avevo bot non so se un first time oppure un troll oppure un first time troll, ma avevo un ashe che si era buildata dal primo secondo solo atk speed fino alla fine senza scarpe fino alla fine.\n> uno potrebbe pensare, che io sia stato sfortunato, ma non fu cos&amp;igrave;, certo ashe fecce cagare per&amp;ograve; non mi lamentai del fatto che il nostro khazix senza maestrie senza rune e senza smite era finito 15/3/2 eh ahime ashe 4/9/10 ma ci siamo fatti valere sia io che il midlaner con Vladimir e il toplaner con Nasus, vincendola malamente, e da quel momento ho capito una cosa.\n> CHE &amp;eacute; DAVVERO BRUTTO GIOCARE CON UN ADC TROLL MENTRE SONO IL SUPPORT\n\nSei straniero ?","replies":[{"poster":"Anubis Raven","date":"2016-07-05T22:28:07.716+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=floodcf,realm=EUW,application-id=MJVj50Jw,discussion-id=2G9EkKEd,comment-id=0004,timestamp=2016-07-05T08:22:28.454+0000)\n>\n> Sei straniero ?\n\nda cosa lo hai dedotto, dal fatto che mancano gli accenti? piu che altro non sono ancora abituato ad usare le lettere sulla parte remota a destra della tastiera, quindi scrivo con i classici caratteri, comunque si, lo sono","replies":[]}]},{"poster":"Nice Doggo","date":"2016-07-05T11:03:48.616+0000","up_votes":1,"down_votes":0,"body":"Ah beh.. a me alle volte dispiace lasciare le Kill ai miei adc perché so che non le sfrutterebbero abbastanza... tipo una jinx che in lane va quasi sotto torre nemica e spara razzi a manetta fino a farsi ovviamente uccidere.. ma la cosa peggiore è che sta jinx (matta come il champ stesso) mi è capitata nuovamente dopo tipo 3 ranked.. però la 2° l abbiamo vinta... gli avversari erano terrorizzati da questa jinx senza paura... cioè aveva due palle che neanche quelle di Mundo...\n\n\nMa il dispiacere più grande è quando riesci a far feedare il tuo adc e dopo tipo 9 kill si sente dio sceso in terra e continua a farsi 1 vs 5 crepando maaaaale...poi chiaramente flamma perché no help ecc.\n\n\nPoi bisogna sempre vedere se son troll o se hanno un modo di giocare che sembrano troll ma per loro è la normalità. ..","replies":[]},{"poster":"Floppyz","date":"2016-07-05T08:15:26.939+0000","up_votes":1,"down_votes":0,"body":"Mi sa che non hai chiara la definizione di troll.\n\n> [{quoted}](name=Anubis Raven,realm=EUW,application-id=MJVj50Jw,discussion-id=2G9EkKEd,comment-id=,timestamp=2016-07-04T20:01:11.014+0000)\n>\n> non importa quanti troll hai in squadra, se gli altri giocano bene si puo sempre vincere, \n\nQuesta frase non è logica.","replies":[]},{"poster":"Best Chair Euw","date":"2016-07-04T20:31:32.227+0000","up_votes":1,"down_votes":0,"body":"No, non ê impossibile, ma è parecchio pesante. Molto spesso quelli che definiamo troll, sono giocatori frustrati che non stanno attraversando un periodo roseo e quindi molto spesso sono recuperabili dando fiducia e soprattutto non offendendo. E poi capita il flamer/feeder/troll/boostato come a me oggi che ha tiltato noi altri 4.","replies":[]},{"poster":"zYaichi","date":"2016-07-04T20:15:59.365+0000","up_votes":1,"down_votes":0,"body":"in realtà kha zix ha carriato xd","replies":[]},{"poster":"TheKingOfTroll","date":"2016-07-05T10:21:46.409+0000","up_votes":1,"down_votes":1,"body":"> perche avevo bot non so se un first time oppure un troll oppure un first time troll\n\nCOS{{champion:48}}","replies":[]}]}