{"poster":"Anubis Raven","date":"2018-04-05T17:05:54.222+0000","title":"Ban atuomatico di 1 settimana o 2 di un campione nuovo o reworkato nelle ranked","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ci ho sempre pensato, perch&egrave; la riot non disabilita i nuovi campioni o reworkati nelle ranked in modo da dare alle persone il tempo di giocare o imparare a giocare con il nuovo campione. mi sono stufato di vedere gente che prende irelia senza saperla usare oppure irelia avversaria che gioca contro gente che non sa come combatterla. non &egrave; giusto per il semplice fatto che uno ci avr&agrave; gia giocato sul pbe mentre altri no. dato che in teoria all&#039;uscita i campioni non sono mai bilanciati potrebbero essere op o scarsi quindi perch&egrave; farli usare in ranked. non ditemi che bastava bannarla perch&egrave; non tutti ci pensano a bannarla. cosa ne pensate di far mettere un ban in ranked per 1 o 2 settimane sui nuovi campioni?","replies":[{"poster":"Dr LouD","date":"2018-04-06T09:33:10.174+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Anubis Raven,realm=EUW,application-id=cAOZwaUi,discussion-id=K5J3GtxL,comment-id=,timestamp=2018-04-05T17:05:54.222+0000)\n>\n> mi sono stufato di vedere gente che prende irelia senza saperla usare oppure irelia avversaria che gioca contro gente che non sa come combatterla.\n\nOVVIAMENTE l'Irelia che non sa giocare ce l'hai sempre tu mentre tutte quelle avversarie giocano sempre contro gente che non sa come combatterla e vincono. Mooooolto salty come post, GG","replies":[{"poster":"Anubis Raven","date":"2018-04-06T17:00:14.285+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dr LouD,realm=EUW,application-id=cAOZwaUi,discussion-id=K5J3GtxL,comment-id=0001,timestamp=2018-04-06T09:33:10.174+0000)\n>\n> OVVIAMENTE l&#x27;Irelia che non sa giocare ce l&#x27;hai sempre tu mentre tutte quelle avversarie giocano sempre contro gente che non sa come combatterla e vincono. Mooooolto salty come post, GG\n\nio ho fatto un esempio perchè ho giocato anche io irelia e mi sembra abbastanza broken, l'idea di bannare i nuovi rework o campioni l'ho pressa da overwatch dove mi sembra anche giusto farlo. se ti da fastidio il mio post oppure ti piace fare commenti non costruttivi puoi benissimo passare oltre. io avevo chiesto cosa la gente pensasse del ban per 1 settimana, tu sei venuto solo per commentare il commento su irelia","replies":[]}]},{"poster":"Philippicus","date":"2018-04-05T17:26:31.325+0000","up_votes":2,"down_votes":1,"body":"La colpa è della stupidità della gente. Senza contare il pbe, renderla indisponibile per una settimana non sarebbe giusto nei confronti di chi magari riesce a fare 10 partite al giorno (purtroppo non è il mio caso) e quindi si sente abbastanza pronto per giocarla già in ranked.\nSo che hai detto di non dirlo ma la prossima volta, se non vuoi vedere un un champ nuovo o reworkato, l'unica soluzione è non dimenticare di bannarla.\nInoltre credo che le ranked siano il banco di prova principale per capire se effettivamente un campione è bilanciato oppure no, i test sul pbe e in normal non credo siano sufficienti","replies":[]},{"poster":"AthlonX860","date":"2018-04-06T14:56:23.775+0000","up_votes":1,"down_votes":0,"body":"Secondo me dipende dal champ e dal tipo di rework, un esempio il rework di {{champion:19}}  è differente dal ww precedente, ma non è così lontano dal vecchio dal dire che non sai più come giocarlo. Caso contrario è stato per irelia e galio i Rework hanno modificato anche i loro stili di gioco, e ad esmpio un mio amico main galio ci ha impiegato un po di partite a capire come sfruttare al meglio il nuovo rework, cosa che non ci è capitata provando ww. Per i nuovi campioni concorderei un ban automatico in ranked per una settimana, anche solo perchè a volte come è successo per camille (troppo forte) e ornn (uscito troppo debole) serve qualche patch ancora per bilanciarli, oltre al fatto che la persona che prende il campione uscito ieri, anche se bravo non riesce a sfruttarlo al meglio delle sue capacità. Quindi per finire sono favorevole al disabilitare i nuovi champ, ma non i rework nelle ranked per un breve periodo.\n\nPS: su una cosa ti sbagli, la riot applica nel pbe dei bilanciamenti ai campioni mentre vengono testati, solo che a volte sbagliano pensando che sia o troppo forte o troppo debole per i server live e quindi fanno degli ultimi ritocchi a volte errati.","replies":[]}]}