{"poster":"iZitro","date":"2015-08-18T22:00:55.883+0000","title":"Yasou Op ?","subforum":"Champions & Gameplay","up_votes":0,"down_votes":5,"body":"Hallo \r\nIch wei&szlig; nicht on ihr es schon mitbekommen habt aber Yasou ist momentan doch ein Beast oder ab lvl 3 zerst&ouml;rt er alles.\r\nKommt mir das nur so vor oder geht es auch anderen so.\r\nIn der lezten woche hatte ich jeden tag min 1 oder 2 mal Yasou als gegner und immer haben wir Verloren weil der einfach 1vs5 geht und gewinnt.\r\nOder kann mir irgendjemand einen tipp geben wie ich besser gegen ihn klar komme.\r\nAls Beispiel Toplane ich Garen rund 200 r&uuml;stung Yasou kommt Critet mich um braucht nichtmal ult zu machen hatte Satik , Trinity , boots und  halbe Kdu. \r\nDavor konnt ich gut mitin Traden aber nach 4 Ganks und 3 Mid kills kam ich nicht mehr auf den Schaden klar.\r\nIch hoffe jemand kann mir helfen.\r\n\r\nMFG: ZitronenTee","replies":[{"poster":"Maexle","date":"2015-08-19T03:32:00.154+0000","up_votes":2,"down_votes":1,"body":"Nur mit HandofBloods Yasuo OP Guide! Ich denke die Yasuos die du gesehen hast haben wahrscheinlich alle den Guide gelesen und befolgen ihn heimlich… Da ist Böses im Busch aber kein Garen und heute auch leider kein Teemo ;P","replies":[{"poster":"MeIsTeR MaNne","date":"2015-08-19T12:55:07.380+0000","up_votes":2,"down_votes":1,"body":"HandofBlood <3 die op guides sind so geil ^^","replies":[]},{"poster":"RiskyDuude","date":"2015-10-26T20:04:35.526+0000","up_votes":1,"down_votes":0,"body":"Schliatz! Ach ne das war Darius... xD","replies":[]}]},{"poster":"Stahlvormund","date":"2015-08-18T22:13:55.088+0000","up_votes":1,"down_votes":1,"body":"Jeder Top Lane Gegner, dem durch 3 Kills und 4 Ganks geholfen wurde, würde dir schnell Probleme bereiten. Das ist nicht spezifisch für Yasuo.","replies":[{"poster":"Maexle","date":"2015-08-19T03:30:24.845+0000","up_votes":2,"down_votes":1,"body":"AD Pantheon auch? Aber AP Pantheon auf jeden Fall, oder?","replies":[{"poster":"Stahlvormund","date":"2015-08-19T14:28:30.634+0000","up_votes":1,"down_votes":3,"body":"Auch die :)\n{{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} \n\n{{champion:14}} {{champion:6}}","replies":[]}]},{"poster":"iZitro","date":"2015-08-18T22:16:07.298+0000","up_votes":1,"down_votes":0,"body":"Ja das war auch nur ein Beispiel vom letzten spiel gegen einen.\nEr wird ja auch in der mitte gespielt und da hat man ja meistens nur was bei 50 rüstung+","replies":[]},{"poster":"Stahlvormund","date":"2015-08-19T21:03:54.367+0000","up_votes":1,"down_votes":2,"body":"Da mein Post downgevotet wurde, würde ich gerne auch eure gegenstimmen hören :)","replies":[]}]},{"poster":"Uranbrennstab","date":"2015-08-19T09:25:21.728+0000","up_votes":2,"down_votes":3,"body":"Ich habe lange Zeit über Yasuo geflucht und gemeckert, man braucht keinen skill und er ist unfair einfach. Dann war er free und ich hab ihn selber gespielt. \nWas habe ich festgestellt? Es ist wirklich so lächerlich einfach. Ich weiß nicht, wieso er eine 100% Schwierigkeit hat.\nEr hat kein Mana, keine Energie, kaum Cooldowns. Dazu eine Fertigkeiten die Ca. 95% aller schadensquellen im Spiel blockt. Und wenn man dann immer noch gefahren läuft zu sterben, hat man noch seinen bullshit passiven. \nUnd ja, wenn man nicht über die Reflexe einer toten Katze verfügt, hat man einen Point-and-Click knock up.\n\nAlso tl;Dr: ha er ist OP, Ban ihn einfach zusammen mit ekko.","replies":[{"poster":"HTSE Omu Omu","date":"2015-08-19T16:16:00.878+0000","up_votes":2,"down_votes":2,"body":"Er ist fcking schwer also lern lol zu spielen","replies":[{"poster":"iZitro","date":"2015-08-19T16:54:36.968+0000","up_votes":1,"down_votes":4,"body":"Jap er ist sau schwer mann mus ja Skill Shots treffen um dmg zu machen xD","replies":[{"poster":"HTSE Omu Omu","date":"2015-08-22T18:46:37.702+0000","up_votes":1,"down_votes":0,"body":"Ja mann muss die dritte q treffen um zu ulten","replies":[{"poster":"toastbrot1707","date":"2015-10-26T19:49:13.936+0000","up_votes":1,"down_votes":0,"body":"Die dritte q zu treffen ist nicht wirklich ne leistung....","replies":[]}]},{"poster":"Maexle","date":"2015-08-19T23:16:55.808+0000","up_votes":1,"down_votes":0,"body":"Zum Glück gibt es ja kein Counterplay gegen ihn… oh warte gibt es, obwohl es deiner Meinung nach keine Skillshots gibt…","replies":[]}]}]}]},{"poster":"MeMyselfandBaal","date":"2015-08-19T06:21:40.547+0000","up_votes":1,"down_votes":0,"body":"hat Yasuo seit neustem einen Point and Click Knock up (also quasi Nautilus Ulti) in seinem Kit? Nein.\nKann es also passieren, dass ein mäßig Fähiger Yasuo 2 Mal in 40 Minuten seine Ulti auslöst? Möglich.\nKann ein Champ, der dermaßen extrem abhängig von seinem Team ist (Und ja, Yasuo war als Duo-Bot gedacht) so absurd OP sein? Gute Frage.\n\nFakt ist: er ist einer von diesen angeblich absolut OPen Champs, die ich nie zum laufen gebracht habe...","replies":[]},{"poster":"EpicSeju","date":"2015-08-18T22:24:21.708+0000","up_votes":1,"down_votes":0,"body":"Er is nur OP wenn man ihn feedet ..\nBTW = Annie ist sein größter counter.. d.h in Teamfights tibbers.. und yasuo is raus","replies":[]},{"poster":"AyRe CoNteMpT","date":"2015-08-18T22:03:23.661+0000","up_votes":2,"down_votes":3,"body":"wenn du mit garen gegen yasuo verlierst, solltest du dir n andres hobby suchen ; )","replies":[]}]}