{"poster":"eusebioh","date":"2017-02-28T22:46:36.322+0000","title":"Matchmaking putrefatto","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"Appena iniziata la season ho fatto, come tutti, i piazzamenti dove sono finito B1. Dopo ho rankato facilmente fino a S5 l, giocando poi solo normal, aram e tutte le altre modalità e, in seguito, \"abbandonai\" LoL per quasi 1 mese. Oggi, al mio ritorno, mi metto a fare ranked, e cosa succede? Ho perso 2/2 partite perch&eacute; in team mi sono trovato gli unranked con il lvl 30 appena fatto e contro i gold. Ora mi chiedo, ma &eacute; normale? Per carit&agrave;, i gold non sono un problema (visto che come meccanice etc sono molto meglio di loro), ma perdere perch&eacute; ho gli unranked in team &eacute; vergognoso. La Riot &eacute; a conoscenza di questo &quot;problema&quot; o ne &eacute; del tutto consapevole ma se ne sbatte le scatole?","replies":[{"poster":"Jeanne dˆArc","date":"2017-02-28T22:58:02.661+0000","up_votes":2,"down_votes":0,"body":"I livelli 30 unranked possono essere matchati con e contro: bronzi, silver e gold. Non è un problema, è il modo in cui funziona attualmente il matchmaking per quella categoria.","replies":[]},{"poster":"RGM Player","date":"2017-02-28T22:51:53.915+0000","up_votes":2,"down_votes":1,"body":">Per carità, i gold non sono un problema (visto che come meccanice etc sono molto meglio di loro)\n\nSei sei meglio dei gold, allora perché hai perso? Se sei meglio dei gold potevi anche carriare 4 scimmie... non dare sempre la colpa agli altri, pensa anche a come hai giocato tu e dove hai sbagliato. Il matchmaking a volte è pessimo, sono d'accordo, una volta mi sono trovato due plat contro e io ero unranked, ma non ci si può fare nulla ","replies":[]},{"poster":"fedy99","date":"2017-02-28T23:21:16.037+0000","up_votes":1,"down_votes":0,"body":"Non so se tu giocavi quando esistevano le team ranked,ma il matchmaking Era una roba assurda.un bronzo poteva tranquillamente trovarsi contro un diamond","replies":[]}]}