{"poster":"Giajmino ","date":"2016-07-13T15:26:31.714+0000","title":"Boosting","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"ho una domanda relativa al boosting. So che fare duoq con qualcuno con account di livello pi&ugrave; basso non &egrave; punibile come boosting. Ma se qualcuno prende possesso di un account di livello pi&ugrave; basso per far salire qualcunocon cui non pu&ograve; fare duo?\r\nesempio: un platino, entra su un account silver e vince la promo insieme ad altri due platino su altri due smurf and un bronzo per arrivare in silver. E&#039; punibile oppure no?","replies":[{"poster":"Frattaglia","date":"2016-07-13T15:52:12.676+0000","up_votes":2,"down_votes":1,"body":"Giocare con un account non proprio è punibile.\nGiocare con un account non proprio per farlo salire in graduatoria è punibile.\nGiocare con un proprio account secondario (smurf) assieme a degli amici non è punibile.","replies":[]},{"poster":"Darkinknight","date":"2016-07-13T22:23:39.837+0000","up_votes":1,"down_votes":0,"body":"Si è punibile ma oggettivamente non puoi saperlo..dovresti guardare settimane di suoi match in cui gioca male,e notare poi un impennata improvvisa ai k/d/a e farm con champ magari mai usati e per svariati game..il tutto senza la presenza di premade che potrebbero influenzare la buona riuacita di un game..quindi si lo e9 dal punto di vista teorico ma diciamo che su 10000 che lo fanno ne verranno beccati 10","replies":[]},{"poster":"l  Ferox  l","date":"2016-07-13T15:29:02.694+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=HaxxorDiFiducia,realm=EUW,application-id=MJVj50Jw,discussion-id=E2wPrbx5,comment-id=,timestamp=2016-07-13T15:26:31.714+0000)\n>\n punibile oppure no?\n\nNo.","replies":[{"poster":"Giajmino ","date":"2016-07-13T15:31:00.582+0000","up_votes":1,"down_votes":0,"body":"posso chiedere perchè no? cioè, se uno avesse le prove?","replies":[{"poster":"l  Ferox  l","date":"2016-07-13T15:50:22.659+0000","up_votes":1,"down_votes":0,"body":"Dipende cosa intendi con : prende possesso di un account ... se è un suo smurf, può giocare liberamente con chi vuole... se è un account scammato, a meno che tu non fornisca tutte le info che la Riot vuole per provare che è un account rubato ci puoi fare poco. Se invece si fa \"prestare\" l'account di un amico per aiutare un altro a salire, è boosting ... ma riguarda l'account prestato, in quanto non è un account del giocatore ... dovrebbe essere cosi, ma prendi tutto con le pinze ^^","replies":[]}]}]},{"poster":"ZZALA","date":"2016-07-13T15:47:59.641+0000","up_votes":1,"down_votes":0,"body":"In questo caso si viene bannati ( sempre che si viene scoperti ed è difficile ) per account sharing , comunque ci sono dei limiti per i platino / diamante / master per giocare in gruppo","replies":[]},{"poster":"DuckQuack0","date":"2016-07-13T15:34:48.016+0000","up_votes":1,"down_votes":1,"body":"Bhè, se l'account non è tuo, è chiaro boosting quello\nO ho capito male? o.O''\nE poi, credo che l'account sharing sia vietato","replies":[]}]}