{"poster":"Bardock 88","date":"2016-07-27T03:26:14.496+0000","title":"Me siento Noob. DEJO LOL?","subforum":"Charlas Generales","up_votes":9,"down_votes":4,"body":"Hace 3 semanas que llevo jugando LOL, soy nivel invocador 13 y la verdad esque me cuesta jugar mejor dicho, juego mal, he muerto hasta 18 veces en una partida, juego pesimo y no se que hacer, solo se manejar a ashe (y igual juego mal pero no tanto incluso he tenido rachas buenas donde juego bien pero solo con ashe. \r\nHe pensado en dejarlo pues muero partida tras partida. el equipo gana pero yo casi nunca puedo ayudar y me siento una carga para el equipo.\r\nDejo el juego? Que me dicen o que opinan?","replies":[{"poster":"Rebkans","date":"2016-07-27T03:33:40.364+0000","up_votes":10,"down_votes":0,"body":"Deberias seguir jugando, total todo se aprende practicando y mas aun cuando sos lvl bajo.\n¿Que impoirta si salis 0/45? Lo importante es que practiques, veas tus errores y sigas mejorando. Nadie empezó el LoL sabiendo, asi que no te hagas drama.\nConozco gente que eran muy malos y ahora son ellos los que carrean y llegaron hasta la division Oro.\nNo aflojes y segui jugando, en todo caso, fijate si alguien te puede dar una mano con consejos, estrategias o lo que sea.\nSaludos!","replies":[]},{"poster":"Cuchufleitor","date":"2016-07-27T04:17:20.242+0000","up_votes":5,"down_votes":0,"body":"El problema es que hay muchos \"smurf\" (gente que ya sabe jugar y se hace cuentas nuevas para aprovecharse de los nuevos) y eso molesta a la gente que es nueva de verdad, lo que podrias hacer es jugar con amigos que te vayan diciendo que se hace y que no durante algunas partidas, como dicen los chicos aca jugar con bots tambien. No deberias dejar el juego por ser malo (si lo dejaran por eso no jugaria practicamente nadie) si no si el juego no te divierte.","replies":[{"poster":"Lunari Red Mask","date":"2016-07-27T04:27:53.976+0000","up_votes":1,"down_votes":0,"body":"Ejem, yo soy muy bueno ,a rreh XD","replies":[{"poster":"SrElite","date":"2016-07-27T06:55:26.696+0000","up_votes":1,"down_votes":0,"body":"QUINTA CUENTA XD, QUÉ HDP XDD","replies":[{"poster":"Lunari Red Mask","date":"2016-07-27T21:49:31.091+0000","up_votes":1,"down_votes":0,"body":"Mhhahaha. Es divertido porque es verdad, son 5 en total.","replies":[]}]}]}]},{"poster":"Aslicolly17","date":"2016-07-27T03:50:06.009+0000","up_votes":5,"down_votes":0,"body":"yo te recomiendo que veas más partidas, de amigos, o de los profesionales de la LCS y sobretodo que juegues más, que seas autocrítico, que leas acerca del juego, que cosas hacer que cosas no hacer, ver tutoriales o guías de youtube ser positivo dentro del juego, todos en algún momento nos sentimos así, pero si pones de tu parte y en verdad te gusta el juego, saldrás adelante, suerte.\n\n {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"LGBT Valentina","date":"2016-07-27T18:32:46.659+0000","up_votes":1,"down_votes":0,"body":"Ni es lvl 30...\n\nQue mire videos y guias en youtube xD. Por algo se empieza","replies":[]}]},{"poster":"Hendrix","date":"2016-07-27T12:06:15.431+0000","up_votes":4,"down_votes":0,"body":"Al principio yo tambien pase por un periodo de frustracion muy grande porque resultaba extremadamente facil morir, aun contra bots. Hasta que empezas a tomar la mano de que no se trata de tirarse al palo por palo como en muchos juegos sino de buscar el momento de tirarse, saber cuidarse, no atacar bajo torre, no atacar entre medio de una oleada de minions rivales, no tradear 1 contra 2, saber comprar los objetos y un sinfin de etc.\nSigo siendo un bronce del monton, pero aprendi a morir poco (aun jugando de supp, con champs que son un flan) y lo mas importante, aprendi a disfrutar el juego y divertirme. \nNo te desalientes y no bajes los brazos. \nBuena suerte y ya nos cruzaremos en alguna partida!","replies":[]},{"poster":"Lunari Red Mask","date":"2016-07-27T04:30:23.718+0000","up_votes":3,"down_votes":0,"body":"Te recomiendo lo mismo que los demás, que sí te gusta el juego, lo sigas jugando, es para divertirse no para llegar a profesional en un día. De paso te comento que hay mucha gente nivel 30 que no saben ni ser junglas, ni tienen idea de que hace el champ que usan. Así que no sigas consejos de pendejos que solo buscan causarte un mal rato.","replies":[]},{"poster":"DanielGarrita","date":"2016-07-27T04:13:35.659+0000","up_votes":3,"down_votes":0,"body":"practica con bots en el modo mas dificil y trata de sacar el mejor farmeo y morir lo menos posible, poco a poco iras mejorando incluso con otros personajes, yo igual era malo y solo jugaba con ashe y lo armaba full {{item:1055}} jajaja,  y ahora se armar a diferente tipos de personajes, tanques, magos, ADC, Junglas, support\n\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"MelG","date":"2016-07-27T04:09:26.192+0000","up_votes":3,"down_votes":0,"body":"Vos te pensas que alguien sabia algo a nivel 13? Noooo nada que ver man\nVos tenes q poner empeño si queres aprender a jugar decentemente\nMi opinion es que vos tenes q pedirle al que te recomendo LoL que te ayude\nO sino a alguien conocido q te ayude\n\nEs normal que te vaya mal, no es un juego re facil como el candy crush tiene su estrategia y hay que tener muchisima paciencia.","replies":[]},{"poster":"Cien De Paleta","date":"2016-07-27T14:20:42.745+0000","up_votes":2,"down_votes":0,"body":"Tenes que entender una cosa a la hora de jugar principalmente: es un juego, te tiene que divertir, le tenes que buscar siempre el lado positivo al juego. te puedo asegurar que no jugaste un 5%  de lo que ofrece el juego. El juego tiene mas de 100 campeones con mas de tres lineas diferentes, modos de juegos y mapas. \nproba todos los campeones, juga todas las lineas, divertite, aprovecha todo lo que el juego tiene para ofrecer. y encima de todo, tenes mil millones de videos subidos en youtube de como mejorar en el juego. sos nivel 13 nada mas, y feedeas a quien le importa, no estas jugando la final del mundial. estas jugando por que te gusta, o porque es tu descarga a tierra, o porque te divertis con tus amigos. para darte un ejemplo, yo era re malo jugando, tanto asi que termine en bronce 5. hoy en dia estoy en promocion para oro 4 y sigo subiendo. por la unica razon de que me gusta el juego y me gusta tambien la escena competitiva.  suerte con tus partidas y mejora si es lo que queres, sino solamente cagate de risa... :D","replies":[]},{"poster":"HyenaLoL","date":"2016-07-27T13:34:54.316+0000","up_votes":2,"down_votes":0,"body":"Twitch.tv te puede ayudar bastante.\nMira a gente y aprende.\nPersonalmente te recomiendo si te cruzas el stream de Khynm. Que le encanta responder las dudas de los viewers y como ahora no esta jugando copa esta stremeando seguido (lo unico que por ahi es muy a la noche)","replies":[]},{"poster":"OkashiCS","date":"2016-07-27T07:15:11.946+0000","up_votes":2,"down_votes":0,"body":"practica/entre etc\nsi  quieres consejos fujases agregame no tengo drama en esplicar, dar alguna guia a quien me lo pida  y vea que pone  esmero en mejorar","replies":[]},{"poster":"Runth","date":"2016-07-27T07:02:21.701+0000","up_votes":2,"down_votes":0,"body":"el lol se aprende lento, asi q lo primero siempre hay q leer y ver como se usa, ver las opciones y las configuraciones, la tienda hay items q usar , comprar lo recomendado y etc","replies":[]},{"poster":"Ufaaaaaaaaaa","date":"2016-07-27T04:38:31.049+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bardock 88,realm=LAS,application-id=v7qsfXsE,discussion-id=6BG002Md,comment-id=,timestamp=2016-07-27T03:26:14.496+0000)\n>\n> Hace 3 semanas que llevo jugando LOL, soy nivel invocador 13 y la verdad esque me cuesta jugar mejor dicho, juego mal, he muerto hasta 18 veces en una partida, juego pesimo y no se que hacer, solo se manejar a ashe (y igual juego mal pero no tanto incluso he tenido rachas buenas donde juego bien pero solo con ashe. \n> He pensado en dejarlo pues muero partida tras partida. el equipo gana pero yo casi nunca puedo ayudar y me siento una carga para el equipo.\n> Dejo el juego? Que me dicen o que opinan?\n\nSI te sentís noob es porque sos noob. El juego empieza a nivel 30, antes de eso aprovechá a aprender todo lo que puedas. Eso si, no vas a mejorar por arte de magia, intenta aprender.","replies":[]},{"poster":"BiosDarkne55","date":"2016-07-27T04:26:40.427+0000","up_votes":2,"down_votes":0,"body":"Amigo, a derrotas se aprende, yo por ejemplo mi primera partida PvP terminé 1-27 xD así que me dio cosas jugar pvp y jugué bots hasta nivel 22, te recomendaría probar bien los campeones en Bots y ver videos de profesionales o jugadores que explican las partidas (ejemplo: Revenant) por ahora, solo debes aprender :3","replies":[]},{"poster":"Nehalem","date":"2016-07-27T03:34:39.965+0000","up_votes":2,"down_votes":0,"body":"Los vídeos en youtube ayudan mucho, si te cuesta mucho podes empezar por jugar de support mientras vas aprendiendo los demás roles con solo verlos. Con el tiempo la experiencia va a hacer lo suyo, primero llega al nivel 30 y luego empieza a preocuparte por mejorar, ahora estás recién aprendiendo.","replies":[]},{"poster":"Turing Test","date":"2016-07-28T08:04:50.096+0000","up_votes":1,"down_votes":0,"body":"Vine a responder pero no encuentro mi comentario (? NO ME DIGAN QUE AHORA HAY LAG DE FORO","replies":[{"poster":"Bardock 88","date":"2016-07-29T04:03:21.101+0000","up_votes":1,"down_votes":0,"body":"Pos comenta de nuevo :)","replies":[{"poster":"Turing Test","date":"2016-07-29T08:18:15.403+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bardock 88,realm=LAS,application-id=v7qsfXsE,discussion-id=6BG002Md,comment-id=00130000,timestamp=2016-07-29T04:03:21.101+0000)\n>\n> Pos comenta de nuevo :)\n\nNo, ahora quiero una cajita {{champion:35}}","replies":[{"poster":"Bardock 88","date":"2016-07-30T21:19:52.329+0000","up_votes":1,"down_votes":0,"body":"XD","replies":[]}]}]}]},{"poster":"Ryuushin","date":"2016-07-27T22:12:59.346+0000","up_votes":1,"down_votes":0,"body":"jugá con amigos, amigos de verdad no un contacto al azar que te haya agregado en el LoL, y toma en cuenta las cosas que te dicen, no lo tomes como absoluto pero prestales atención, este es un juego muy complejo, pero primero ante todo tenes que divertirte con amigos, luego si te gusta y disfrutas la competitividad, ve jugando solo\ny otra cosa, practica contra bots, no te creas que porque tenes otros nv13 o demás niveles en la partida sean como vos, un montón son smurf, y tratá de cambiar a ashe, yo empecé jugando por caitlyn y fue mi primer campeón, disfrute mucho más el juego usandola a ella que a ashe, tenes que aprender mil cosas para jugar bien a este juego e invertir muchisimas horas","replies":[]},{"poster":"Turing Test","date":"2016-07-27T17:28:10.290+0000","up_votes":1,"down_votes":0,"body":"Nah, el KDA no te dictamina la partida. Por ejemplo, yo en ARAM es raro que no muera el doble de lo que mato. Mis compañeros me dicen troll {{champion:17}}  pero al final las partidas terminan ganadas. Alguno dirá que me carrean otros que tengo mucha suerte... \nYo no soy un experto en LoL, pero descubrí hace un tiempo que se trata de la \"visión\" de la partida. Concentrate en tu rol, en tu función (que va más allá de ser bueno con el champ que juegues) . Cuando no tenés habilidades en las manos (como yo xD ) tenés que usar la cabeza. La próxima ves que te esté yendo mal en la línea, ~~pegale un cabezazo al monitor ~~ , tranquilizate, respirá y fijate **qué otra cosa podés hacer ** que no sea matar a un rival.\n\nhttps://s32.postimg.org/4fznosdyt/Captura.jpg","replies":[{"poster":"Lunari Red Mask","date":"2016-07-27T21:52:46.039+0000","up_votes":1,"down_votes":0,"body":"Sin ir más lejos pasa mucho que cuando moris y te rompen torre abandonan la linea, entonces es tu oportunidad de ir y romper torre. Me pasaba cuando comence a usar fiora pre-rework no sabía usarla bien y terminaba muriendo mucho, pero derribaba torres y ayudaba a mi equipo de esa forma.","replies":[]}]},{"poster":"CordobezEverdeen","date":"2016-07-27T18:53:28.878+0000","up_votes":1,"down_votes":0,"body":"Primero llega al lv 30","replies":[]},{"poster":"ESCURRIDISO","date":"2016-07-27T18:39:23.329+0000","up_votes":1,"down_votes":0,"body":"yo tmabien tuve el mismo problema con los famosos y estupidos smurf que se creen dios matando pollos que esten recien empezando, OJALA RIOT logre crear alguna solucion contra los smurf y borre algunas cuentas estupidas, que supuestamente son para ``entrenar`` , si vas a entrenar juegen contra bots simple 1 los bot no te insultan ni te dicen nada excepto al principio cuando te dicen eje: annie, tibbers quiere jugar dkjksadjaksjd , pls ojala rito empieze a borrar algunas cuentas que no se conecten en años o dias o semanas, cuentas que esten debajo del nivel 20 que sean borradas asi de simple.","replies":[]},{"poster":"BRUZER","date":"2016-07-27T05:23:45.882+0000","up_votes":1,"down_votes":0,"body":"Si te gusta el juego y queres aprender, te recomiendo que no lo dejes. Todavía tenes muchas cosas que aprender siendo lvl 13. \nTe aconsejo que farmees lo maximo posible (osea el ultimo golpe a los minions siempre) para sacar ventaja con el oro aunque sea... con el tiempo vas a ir aprendiendo maneras de moverte (roaming), distintas builds (las cosas que te compras en la partida), priorizar distintos objetivos, runearte mejor, tener en cuenta composiciones de equipo y muchas cosas mas ! hay muchas guias de como usar los distintos champs en internet buscalas, es cuestion de LEER y ENTENDER! no te dejes influenciar por los comentarios negativos (que son muchos). **SI TE GUSTA JUGA, APRENDE Y GO WIN** .\nSi realmente no te divierte buscate otro game. \n\nSaludos ! {{champion:266}}","replies":[]}]}