{"poster":"Ben1 Slave Nighu","date":"2015-07-08T02:17:43.884+0000","title":"Server spinnen.","subforum":"Melde einen Bug","up_votes":2,"down_votes":1,"body":"Hallo liebes Riot Team.\nIch muss sagen, langsam geht es mir richtig auf den Sack. Jedes 2te Spiel, habe ich einen Disconnect, und komme nicht mehr ins Spiel hinein. Unternehmt endlich was dagegen. An meinem Internet liegt es nicht, in Skype/TS habe ich nie einen disconnect.","replies":[{"poster":"Crounty","date":"2015-07-08T02:46:15.854+0000","up_votes":1,"down_votes":1,"body":"Klar, vorallem dass die Skype/TS Server genau den gleichen Standort haben, wie die LoL Server :D\n\nEs gibt 3 Möglichkeiten, was passiert ist:\n\n1. Jemand hat nen Bug benutzt, der das Spiel abstürzen lässt.\n\n2. Jemand hat gedrophackt.\n\n3. Riot DNS funktioniert immernoch nicht bei jedem.\n\nWenn es Punkt 1 oder 2 waren, würde ich an deiner Stelle den Support anschreiben.","replies":[{"poster":"Ben1 Slave Nighu","date":"2015-07-08T03:13:22.199+0000","up_votes":1,"down_votes":0,"body":"Was hat es damit zutun das Skype/TS nicht den gleichen Standort haben wie die lol Server?","replies":[{"poster":"Crounty","date":"2015-07-08T03:17:58.983+0000","up_votes":2,"down_votes":0,"body":"Ich kenn mich da leider nicht so gut aus, aber Riot Pente hat mal erklärt, dass man nur weil man auf Google oder so zugreifen kann, dass man nicht zwingend in LoL reinkommt z.B weil vllt der Weg zu den LoL Servern durch Arbeiten etwas anders ist und man einen Umweg machen muss, als es bei dem TS und bei Skype so ist oder bei Google, was auch immer.\n\nMal ein Beispiel: Lol Server -> Niederlande\nEs gibt eine normale Route von dir zu den Servern. Jetzt gibt es warum auch immer Arbeiten und genau in deiner Route, da nimmst du eine andere Route, machst einen Umweg und es dauert dann länger, bis du Daten kriegst/hochlädst als beim TS Server, der z.B in Frankfurt liegt und dort keine Störung in deiner Route ist.","replies":[{"poster":"Ben1 Slave Nighu","date":"2015-07-08T03:19:04.722+0000","up_votes":1,"down_votes":0,"body":"Also liegt es an den LoL Servern:D","replies":[{"poster":"Humpelstilzche","date":"2015-07-08T08:51:30.626+0000","up_votes":1,"down_votes":0,"body":"Nein. Es liegt an dem Weg dahin (meistens, nicht immer).","replies":[]},{"poster":"Crounty","date":"2015-07-08T03:20:53.496+0000","up_votes":1,"down_votes":0,"body":"Nein nicht wirklich mal ein Beispiel:\nDu willst mit dem Auto von Bonn nach Düsseldorf und der schnellste Weg dahin ist die Autobahn Richtung Köln zu nehmen, nun ist diese Autobahn gesperrt und du musst einen Umweg machen, der dich Zeit kostet. Dann kannst du die Schuld nicht auf den Laden in Düsseldorf schieben, zu dem du willst. (Ein grobes Beispiel, muss nicht alles stimmen aber vom Sinn her ist es richtig)","replies":[]}]}]}]}]},{"poster":"GIANTS destra","date":"2015-07-08T02:21:34.567+0000","up_votes":1,"down_votes":0,"body":"Gleiches Problem hier, ist auch schon öfter aufgetreten die letzten Tage .. \nKann mir nichts bessere vorstellen als paar Stunden zu warten bis das \"Ghost Game\" dann vorbei ist.{{item:3067}}","replies":[{"poster":"Ben1 Slave Nighu","date":"2015-07-08T02:25:40.488+0000","up_votes":1,"down_votes":0,"body":"Naja, ich bin gerade wieder eingeloggt, in meiner match history wird das Game aber garnicht angezeigt. Ich frage mich aber, ob nur wir (EUW), von diesen Serverabstürzen betroffen sind. {{item:3070}}","replies":[]}]}]}