{"poster":"BluFoxer","date":"2015-03-27T00:43:57.244+0000","title":"AAA CERCO UN TEAM RANKED!","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ciao a tutti sono di nuovo io....\r\nVorrei entrare in qualche team per rankare dato che da solo non posso fare ranked perch&egrave; ho un loop di punizioni ahim&egrave; credo senza fine.\r\nComunque mi reputo abbastanza capace e versatile nei game, il mio nome in game  &egrave; come questo del forum :BluFoxer.\r\nCome potete capire da tutti i miei post, maino Fiddle in mid e jungle. Lo uso pure top e support ma pi&ugrave; di rado, ciononostante gioco meglio in solo lane. Gioco principalmente di mattina e se qualcuno vuole un membro per un team eccomi qua. ;)\r\n{{champion:9}}","replies":[{"poster":"Phanix","date":"2015-03-27T09:29:32.883+0000","up_votes":2,"down_votes":0,"body":"Ciao bluFoxer mi permetto di darti dei consigli  il primo meglio non dire che hai una fila di punizioni senza fine o almeno inizia a smettila di averli, cosi fai pensare a chi legge che sei un flammer o un afk e nessun team vuole queste persone qua..\n\nNon si maina un personaggio nel team, nel senso il team e' composto da persone che mainano una linea e imparano diversi personaggi di quella linea cosi da caounterare meglio l avversario o prendere personaggi che si combinano con quelli dei tuoi compagni\n\nsicche' ti consiglio continua a fare le normal per scegliere la line che ti diverte di piu in cui ti trovi piu a tuo agio e impara almeno 4 o 5 champ bene in quella line\n\nEsempio io sono main mid silver e conosco 14 champ mid cosi e' per tutti i componenti del team di cui faccio parte!\n\nSe sei sempre solo e cmq vuoi giocare con altri italiani ti posso invitare nella community mia di ts dove siamo quasi una 40ina di giocatori italiani di lol cosi puoi trovare compagni per le normal e imparare a giocare bene!\n\nSaluti Phanix","replies":[{"poster":"Dr LouD","date":"2015-03-27T09:34:29.340+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]}]},{"poster":"BluFoxer","date":"2015-03-27T11:03:50.902+0000","up_votes":1,"down_votes":0,"body":"1. Il problema è che ormai credo davvero che ci siano degli errori nel sistema, questa è quasi la decima chat restriction e la 2 serie di draft, non sono più ne un flamer ne un afk,  abbandono solo in situazioni eccezionali. So usare tutti questi mid e toplaner:{{champion:268}}  {{champion:161}}  {{champion:74}}   {{champion:9}}   {{champion:1}}  {{champion:150}}  {{champion:115}}  {{champion:421}} .\nEro Silver IV nella scorsa season. Non credo di dover continuare a fare normal perchè non mi vengono bannati tutti questi champion in ranked.\n{{champion:9}}","replies":[]}]}