{"poster":"TehFoxx","date":"2015-02-22T00:08:50.248+0000","title":"Custom games ideas","subforum":"Player Creations","up_votes":3,"down_votes":0,"body":"Hi would like to say a few problems & some ideas that all players have that play custom games & would like to see some or all of these happen\r\n\r\n1. The pause function is a completely useless function that it's only purpose is for trolls to ruin the game even more(best way to fix it is limit the use of the /pause to 3 times per user, remove it completely or allow games owners to disable this function \r\n\r\n2. Game owners need more rights ingame(& in lobby/team select) to deal with trolls or players that just ruin it for everyone else. For example, allow game owners to call a vote to kick/remove a player from the game ingame\r\n\r\n3. i know kicking someone ingame will leave the other team 1 player short but could also add an option for the game owner(or other players) to invite someone to take over(they will still have all the gold, items & kdr the last person had before they were kicked), they obviously won't be able to change champ but will help the game become \r\n\r\n4. Allow game owners to undo a ban/kick in the lobby/team select as theres times you might kick the wrong person\r\n\r\n5. Maybe have a minimizable separate chat box ingame(for any game) for whispers & have separate tabs for different conversations or could put it on the normal chat box but have tabs(like in some mmos)\r\n\r\n6. Add a link to the riot support pages on the games menu(Next to settings button or in the help menu on the client)\r\n\r\nthese are needed for players who enjoy custom games(like Hide & seek & others)","replies":[{"poster":"Crusader charlie","date":"2015-02-26T03:28:17.184+0000","up_votes":1,"down_votes":0,"body":"I like it so far, but your leaver could be replaced by a bot if you wanted it to","replies":[]},{"poster":"TehFoxx","date":"2015-02-26T03:13:42.013+0000","up_votes":1,"down_votes":0,"body":"Another idea is to have an option in the menu when you right click a friend on your friends list is to see the previous names they have used(like what steam has)","replies":[]},{"poster":"TehFoxx","date":"2015-02-23T16:42:44.241+0000","up_votes":1,"down_votes":0,"body":"As i have said these are ideas/suggestions\n\n [{quoted}](name=JasonWazza,realm=OCE,application-id=hIjvqaz6,discussion-id=xEpLYHJg,comment-id=0000,timestamp=2015-02-22T00:53:45.714+0000)\n\n> If you need to talk that bad, alt+tab and bring up the client.\n\nWell duh \n\n [{quoted}](name=TehFoxx,realm=OCE,application-id=hIjvqaz6,discussion-id=xEpLYHJg,comment-id=,timestamp=2015-02-22T00:08:50.248+0000)\n\n> Maybe have a minimizable separate chat box ingame(for any game) for whispers & have separate tabs for different conversations or could put it on the normal chat box but have tabs(like in some mmos)\n\nI made this suggestion so players wouldn't have to do that =/ would make it more convenient that way so you wouldn't miss anything ingame.","replies":[]},{"poster":"Ingénue","date":"2015-02-22T05:12:53.769+0000","up_votes":1,"down_votes":0,"body":"Really confused as to why you would have people trolling in customs? Are your friends ♥♥♥♥♥? Do you invite/accept randoms and expect them not to be ♥♥♥♥♥? IDK\n Anyways, most of your suggestions can easily be nullified by playing with players in customs that are not complete ♥♥♥♥♥. \nNumber 5 is quite interesting, but as JasonWazza stated, it is easier to alt+tab and communicate to individuals that way, than to try and keep up with many separately tabbed conversations in the in game chat window.\nNumber 6 would be pretty useful, not many people know where to go when they need help.","replies":[]},{"poster":"JasonWazza","date":"2015-02-22T00:53:45.714+0000","up_votes":1,"down_votes":0,"body":">Maybe have a minimizable separate chat box ingame(for any game) for whispers & have separate tabs for different conversations or could put it on the normal chat box but have tabs(like in some mmos)\n\nIf you need to talk that bad, alt+tab and bring up the client.\n\nOtherwise it's a simple fact of, trolls are gonna troll, not much you can do about them.","replies":[]}]}