{"poster":"γαsυσ","date":"2015-07-26T07:17:03.774+0000","title":"Cose strane delle ranked..","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"Ora non vorrei apparire il classico nabbo bronzo bimbominchia, ma le ranked stanno diventando un massacro mentale..\r\nIniziando dal fatto che ogni 3x2 si trovano persone che non sanno giocare (e quello ci pu&ograve; pure stare, non siamo challanger) e persone che si credono Dio sceso in terra, si credono perfette e flammano come se non ci fosse un domani, insultanto alleati e nemici.. Questo diciamo che non &egrave; troppo strano visto che 3/4 delle persone che giocano a lol sono morti di vagina e che devono credere di essere &quot;forti&quot; in qualcosa, ma quello di cui volevo parlare veramente &egrave; il fatto delle promo..\r\nQuesta cosa mi ha quasi traumatizzato diciamo, perch&eacute; nelle normali partite ranked faccio solitamente score positivi vincendo lane e partita molte volte, ma in promo i nemici sono molto piu forti del solito e gli alleati sono molto piu rintronati di prima..\r\nCapisco che nemici piu forti &egrave; normale, ma gli alleati diventano proprio totalmente flamer, senza un contegno morale che li faccia stare zitti e giocare come una persona dovrebbe fare...\r\n\r\nQuesto post l&#039;ho fatto principalmente per sfogo visto che per 3 volte di fila perdo la promo per la gold {{champion:32}}","replies":[{"poster":"Dantazzo","date":"2015-07-26T21:16:06.458+0000","up_votes":2,"down_votes":0,"body":"Io un pò ci credo che ogni tanto le promo sfasino, ho provato a fare delle promo 7 volte, e la divisione dopo l'ho fatta in 8 partite promo compresa.","replies":[]},{"poster":"Exploooooosion","date":"2015-07-26T10:14:12.562+0000","up_votes":2,"down_votes":0,"body":"Se perdi le promo evidentemente non sei pronto per quella lega, ci sono passati tutti","replies":[{"poster":"γαsυσ","date":"2015-07-26T17:37:54.251+0000","up_votes":1,"down_votes":0,"body":"Il fatto è che se quella partita non è una promo, la vinco il 98% delle volte :)","replies":[{"poster":"Exploooooosion","date":"2015-07-26T20:52:01.258+0000","up_votes":1,"down_votes":0,"body":"be sei più forte del tuo lvl attuale ma non abbastanza per il lvl successivo","replies":[]}]}]},{"poster":"Mastro Olio","date":"2015-07-26T09:03:20.714+0000","up_votes":2,"down_votes":1,"body":"Le promo sono il boss finale del gioco. Se non sono più difficili che gusto c'è?","replies":[{"poster":"γαsυσ","date":"2015-07-26T09:45:06.542+0000","up_votes":1,"down_votes":0,"body":"Ahahahahah non ci avevo pensato! xD","replies":[]}]},{"poster":"ztJackieChan","date":"2015-07-26T17:58:19.948+0000","up_votes":1,"down_votes":0,"body":"è una questione di cervello. Mi spiego meglio, prima che vi facciate strane idee. :D\n\nIl nostro cervello tende a dare più importanza a determinanti episodi che hanno un maggiore impatto traumatico.\n\nTrovare un AFK in team ha un forte impatto emotivo. Il nostro cervello si ricorderà più facilmente di quell'unica partita con l'AFK piuttosto che delle altre 9 in cui non ci sono stati particolari avvenimenti. Qualche individuo, particolarmente sottosviluppato, crederà addirittura che le partite con AFK siano oltre il 50%, addirittura sfiorando il 90% delle partite.\n\nPerdere le promo.\nSenza escludere il fatto che le promo sono cmq un ulteriore passo in alto per quanto riguarda la difficoltà dei nemici, è altresì vero che c'è generalmente un saltino di difficoltà in più rispetto alla solita scalata.\nSeason4 silver. Hai 334 ranked in season5. Significa che non sei uno che le vince tutte, anzi, è chiaro non le decidi tu le partite. Un 55% di win rate appena sufficiente a farti arrivare lentamente verso gold. Se la variabile della fortuna non ti era favorevole, magari ora ti trovavi a giocare la promo per andare in silver4.\n\nPuoi anche pensare che \"**_nelle normali partite ranked faccio solitamente score positivi vincendo lane e partita molte volte_**\", ma un win rate del 55% implica 11 wins e 9 loss. Se vinci molte volte, allora è anche vero che perdi molte volte.","replies":[]},{"poster":"D3MOS92","date":"2015-07-26T09:49:16.041+0000","up_votes":1,"down_votes":0,"body":"E' normale,  anche qui sul forum, utenti che si credono DIO e flammano, è un fenomeno normale, per i nerd dipendenti dai giochi online. Gia nella vita reale molti non hanno rispetto figuriamoci in un gioco.","replies":[]}]}