{"poster":"Battlecast Sona","date":"2015-11-26T19:40:51.846+0000","title":"Let's talk about what's ACTUALLY wrong with Yasuo","subforum":"Gameplay","up_votes":129,"down_votes":17,"body":"I see a lot of Yasuo QQ threads and I&#039;m kind of tired of seeing &quot;omg rito he does so much damage + cc + mobility wtf nerf nao&quot; and it&#039;s like uh. That&#039;s not where his hidden power is, and that&#039;s not why he&#039;s broken.\r\n\r\nReason 1 that Yasuo has tons of hidden power: Wonky spaghetti code windwall. If Yasuo times his W correctly, he can place it in any direction and it will block ANY projectile coming towards him, regardless of direction. The reason? Windwall has a hitbox has soon as Yasuo casts the spell, and the instant he casts it this hitbox intersects with Yasuo&#039;s, making him 100% immune to projectiles. The fix? Windwall has no hitbox until it is fully formed. This means Windwall is no longer a &quot;oh god I heard the Sona ult sound effect lemme mash W in any direction to stop it&quot; spell, and a calculated block. Still just as effective at blocking long range skillshots, less effective at blocking instantcast or skillshots from fog. COUNTERPLAY!\r\n\r\nReason 2 that Yasuo has tons of hidden power: Double passive. Yasuo has both a shield and double crit from his passive. Yes, his crits are weaker, but double crit at level 1 is pretty silly (as instanced by the brawler&#039;s glove 20% crit infinite sustain w/ warlord&#039;s bloodlust before the hotfix). Having 100% crit at 1 and a half items is ridiculous, especially when one of those items is Shiv (since you&#039;re guaranteed a shiv crit every time it procs). The fix? Put his crit on an ability (preferably W) so that Yasuo has to scale into his crit. 20%/40%/60%/80%/100% additional crit per rank. Gives him a reason to rank up windwall if he&#039;s snowballing while simultaneously forcing him to choose to delay his damage from abilities. Also, unless Yasuo ranks it up first, this locks him out of insane crit levels until the midgame, making his laning phase much less oppressive.\r\n\r\nNothing else about Yasuo&#039;s kit is the problem. It&#039;s not his E. It&#039;s not his ult. Those things, by themselves, are fine. But in combination with his ridiculous safety and low decision making requirements (due to W being such a reaction-based spell due to the hitbox interaction explained above), he also scales into damage very, very quickly (only requiring about 3k gold to hit 100% crit on live). The changes outlined above would make his laning phase less oppressive while retaining his mid-game teamfighting spikes and lategame damage spikes (which are not really where the problem is unless he&#039;s snowballed from lane, which these changes would address).\r\n\r\ntl;dr: take the hidden power off of W and put crit passive on another ability to help Yasuo&#039;s kit be less overloaded and give him less for free instead of just flat nerfing him.","replies":[{"poster":"RiotRepertoir","date":"2015-11-27T07:01:01.799+0000","up_votes":81,"down_votes":6,"body":"The interaction you're describing with Windwall is actually intended as far as I know; it's not the result of a coding error.\n\nMaking him scale into his crit passive in some way or another seems like a reasonable approach to reduce his power, though. Good suggestion.","replies":[{"poster":"Battlecast Sona","date":"2015-11-27T07:04:20.284+0000","up_votes":42,"down_votes":3,"body":"Why is it intended? It's really awful to play against when Yasuo throws a W the wrong way and blocks your projectile anyway. I've had multiple Crescendo's miss Yasuo's entire team because of this sort of interaction, and a multitude of other projectiles as well. So I guess the appropriate question then is - who really thought it was okay that Yasuo can splitsecond block anything by mashing his W in any direction?","replies":[{"poster":"RiotRepertoir","date":"2015-11-27T07:13:30.852+0000","up_votes":71,"down_votes":3,"body":"This sounds as much like an argument against the instant-cast and instant-effect nature of the wall as it is an argument against its size. The wall's gotta spawn somewhere, whether that be behind, in front of, or right on top of Yasuo. Maybe it should only block things from one side, though.","replies":[{"poster":"LankPants","date":"2015-11-27T07:19:16.637+0000","up_votes":57,"down_votes":0,"body":">Maybe it should only block things from one side, though.\n\nDefinitely agree with that one. There's nothing more BS that when you're playing an all projectile champion and Yasuo just sits in his wall so you can't actually hit him.\n\nIt would be nice to be able to flank the wall if he fucks up with it, rather than it still being useful.","replies":[{"poster":"YumaS2Astral","date":"2015-11-27T13:59:38.556+0000","up_votes":2,"down_votes":18,"body":"> [{quoted}](name=LankPants,realm=OCE,application-id=3ErqAdtq,discussion-id=nqA4lEna,comment-id=000c000000000001,timestamp=2015-11-27T07:19:16.637+0000)\n>\n> Definitely agree with that one. There's nothing more BS that when you're playing an all projectile champion and Yasuo just sits in his wall so you can't actually hit him.\n> \n> It would be nice to be able to flank the wall if he fucks up with it, rather than it still being useful.\n\nIf that was true, Vladimir would beat Yasuo even harder, since currently the damage from Vlad's Q is not blocked by Yasuo's windwall, but the healing is","replies":[{"poster":"Spacesuit Spiff","date":"2015-11-27T14:19:50.774+0000","up_votes":19,"down_votes":1,"body":"Theres more to counters than one mechanic. Yasuo can easily get on vlad and punish him for farming without even using w or q3. The matchup is settled on a more fundamental level: poke vs gapcloser.","replies":[]}]},{"poster":"The Voids Call","date":"2015-11-28T05:05:13.403+0000","up_votes":2,"down_votes":0,"body":"I'd argue it's more a matter of yasuo doesn't get his own pillar to kite around during a fight. It means he'd have a wall to hide behind, but flanking that wall takes away the advantage he gets from it. That's counter play, which is something which he is very much lacking.","replies":[]}]},{"poster":"Veraska","date":"2015-11-27T08:23:38.965+0000","up_votes":19,"down_votes":1,"body":"has anyone recommended lowering the up time of his knockups charge? like once he's used his Q twice he has 10 seconds to use the tornado, and i feel that gives yasuo a ton of zoning power, as he has effectively a 6 second window (10 minus the Q's 4 second cooldown) to force a favorable trade- its difficult to trade back when you're hard CC'd and can go in and out, ala renekton and riven.\n\ni play a ton of yasuo and i feel a bunch of his power comes from the up time of his knockup especially in lane, maybe if the tornado duration was cut in half to 5, it'd stretch out his windows of power (a similar change has been made to TF and ryze to circumvent there earrly game power in the past) and it'd also strengthen his reliance on teammates. this is the change ive been reccomending since the yasuo concern cropped up again.","replies":[]},{"poster":"A Miss Fortune","date":"2015-11-27T12:36:44.699+0000","up_votes":2,"down_votes":2,"body":"Difficult to understand why wind wall still has to be an ability of his especially if the coding itself is difficult to manage. It isn't fun to play against and is similar to a Blitz hook, you can miss a lot of them but the one time you hit it you can win the entire game. It lets him become extremely toxic and just invalidate almost all ranged champions in the laning phase as a melee champion. He's one of the reasons why mages are in such a poor state and while I think It's fine for a champion to counter a certain class but he shouldn't be able to flat out just counter ranged champions.\n\nWould be nice to see something like wind wall just blocking _all_ projectiles whether It originates from the enemy or ally team the Yasuo is in. It would limit his insane bullying power to even ranged champion by not being able to do things like wind wall and throw a tornado at the enemy, but it would make his wind wall have more counterplay than just hoping the Yasuos forgets to mash W.","replies":[{"poster":"Ariel the Cruel","date":"2015-11-27T14:21:31.387+0000","up_votes":12,"down_votes":3,"body":">while I think It's fine for a champion to counter a certain class but he shouldn't be able to flat out just counter ranged champions.\n\nDon't worry. CertainlyT already thought of that.\n\n{{champion:429}} Hi.","replies":[]},{"poster":"MegamanEXE79","date":"2015-11-27T15:32:02.842+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=A Miss Fortune,realm=NA,application-id=3ErqAdtq,discussion-id=nqA4lEna,comment-id=000c000000000007,timestamp=2015-11-27T12:36:44.699+0000)\n>\n\n> Would be nice to see something like wind wall just blocking _all_ projectiles whether It originates from the enemy or ally team the Yasuo is in. It would limit his insane bullying power to even ranged champion by not being able to do things like wind wall and throw a tornado at the enemy, but it would make his wind wall have more counterplay than just hoping the Yasuos forgets to mash W.\n\nI like this. You look at champs like an allied Bard or Kalista or Lee, whose accidental misuse of their ultimates can screw your team over, and Riot says \"That's called high skillcap\", and separates the god Bards from the fail Bards. \n\nNow granted, Yasuo W is not an ultimate, so it shouldn't HAVE to fall under the same mentality, but this would feel like a fair thing in the same way that Bard ult feels like a fair thing, even if your own teamate can potentially mess you up.","replies":[]}]},{"poster":"lolipopevelynn","date":"2015-11-27T09:15:15.756+0000","up_votes":1,"down_votes":11,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=nqA4lEna,comment-id=000c00000000,timestamp=2015-11-27T07:13:30.852+0000)\n>\n> This sounds as much like an argument against the instant-cast and instant-effect nature of the wall as it is an argument against its size. The wall's gotta spawn somewhere, whether that be behind, in front of, or right on top of Yasuo. Maybe it should only block things from one side, though.\n\nit should also only block basic abilities, not ultimate projectiles.","replies":[{"poster":"JustMyBassCannon","date":"2015-11-27T10:38:07.942+0000","up_votes":11,"down_votes":0,"body":"Because ultimates ignore untargetability, invulnerability and shields of all kinds, right?\n\nWait, no, they don't. It's entirely possible to negate ultimates with those effects as well. And far more ultimates are affected by those abilities than the number that are affected by Wind Wall.","replies":[]}]},{"poster":"Troll for Trump","date":"2015-11-27T08:37:49.169+0000","up_votes":8,"down_votes":1,"body":"Try doing the one-sided wall thing and see how many Yas mains will rage about \"unneeded nerfs\" and get tons of upvotes after said update.\nSeriously though, a Onesided wall would be great(Blocks in the same direction as Yas is facing when initially cast). Some bugs may appear though. Try it :L","replies":[]},{"poster":"badooga","date":"2015-11-28T17:03:52.733+0000","up_votes":3,"down_votes":0,"body":"Regarding the fact that the Wind Wall totally deletes {{champion:267}} ult, what if her ult was coded so that it was a few, separate chunks of water that ran right next to each other? The only effect this would have on gameplay is if a Wind Wall blocks it, where it would only block the part that is the size of the wall itself and the other parts would run off to the sides and still work.","replies":[]},{"poster":"Kouga","date":"2015-11-27T09:52:00.314+0000","up_votes":3,"down_votes":0,"body":"For Vitriolic's specific case (Sona Ult getting blocked from the opposite side of the wall) I don't think the size is so much the problem; even if it was extremely narrow, if its spawning \"on top of\" Yasuo it seems likely to cause this problem.\n\nI don't know to what degree they intended for it to be forgiving in terms of cast time; I know there have been times that I've cast the wall when it should have been too late to block the projectile (the projectile was visually behind the wall by the time the wall \"formed\") but because of hitboxes, it blocked it since it starts at his position and then sort of \"floats\" forward. Of the two options mentioned:  1) move its spawn point to just in front of Yasuo, in the direction it is cast. Enough so that the opposite side of Yasuo's hitbox is not protected at the start of the cast. This would be a nerf, for sure, but I think it'd \"feel\" better for both Yasuo's opponents (who can feel like they properly outmaneuvered him) and Yasuo himself (who should know that he cast it the wrong direction) without it feeling unfair to either party.\n\nThe other option would be 2) what you suggested as for making it only block in one direction. This is a much larger nerf, as part of Yasuo's strength (especially against ranged champs) is being able to duck back and forth across the wall as the opponent dances around it. Personally I like it because it emphasizes positioning, but it does come with drawbacks. Even if the wall spawned \"forward\" of Yasuo, in those cases where he cast it the wrong direction it could still stop the ability - such as with, say, Ezreal's Ultimate - from continuing past his position and hitting his teammates.\n\nIMHO I think that if you went with #1, putting the spawn point just a tad further forward, it would eliminate accidental cases of protecting Yasuo when he misclicks his wall, but still give him the option of, \"Oh $#!* I'm too late to block that from me, but I can still protect a teammate\" by casting it \"behind\" him if the projectile gotten too close.","replies":[]},{"poster":"TendajiX","date":"2015-11-27T18:49:27.717+0000","up_votes":2,"down_votes":0,"body":"In front of him in the direction it was cast so it isn't on his hit box is the only logical place.... it's not even a question lol it's not like the windwall is actually INSIDE yasuo at any point.","replies":[]},{"poster":"warpenguin555","date":"2015-11-27T18:30:44.601+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=nqA4lEna,comment-id=000c00000000,timestamp=2015-11-27T07:13:30.852+0000)\n>\n> This sounds as much like an argument against the instant-cast and instant-effect nature of the wall as it is an argument against its size. The wall's gotta spawn somewhere, whether that be behind, in front of, or right on top of Yasuo. Maybe it should only block things from one side, though.\n\nthats what most people want. It should be like braums E, gives more counterplay and is less confusing for newer players","replies":[]},{"poster":"Lucifer","date":"2015-11-27T14:08:42.530+0000","up_votes":2,"down_votes":0,"body":"That would make more sense, from a game read perspective. \n\nIn general, can you explain any directions you want to push Yasuo in? It seems like he's generally not well liked by the people who have to play against him at the moment.","replies":[]}]}]},{"poster":"Solidair3","date":"2015-11-27T14:27:23.191+0000","up_votes":4,"down_votes":0,"body":"Can ya'll at least confine the hitbox a bit? Yesterday I was playing as sona, the enemy yasuo was on the same side pf the wall as me, and my crescendo still couldn't hit him because the wall's area of influence is bigger than the graphic would suggest. I would like it of the wall could exactly match up with it.","replies":[]},{"poster":"Rozzeta","date":"2015-11-27T13:45:12.508+0000","up_votes":4,"down_votes":0,"body":"Is there a way to separate projectiles in a way that wind wall only blocks what it touches? It seems really silly to see all of Talon's blades disapepar because 1 touched the wall, or Ashe's volley (if not already changed after update), or the infamous example with Nami's ultimate.","replies":[]},{"poster":"Mansana","date":"2015-11-27T19:05:51.466+0000","up_votes":2,"down_votes":0,"body":"I feel like one of the most frustrating things about Yasuo is indeed his laning pattern. Many players have already described it plenty of times. This season especially has gotten worse. Windwall to block skill shots, Shield to reduce damage from skill shots, and a dash to dodge skill shots on top of the amount of sustain given this season with Feast, Vampirism and Doran's Blade. It's hard to stick damage to him. Trading with him is near impossible as most mages, unless he makes obvious mistakes. If the Yasuo is on the same level of skill, Yasuo will always win lane in 80% of his matchups. ( I say 80% more or less because there are champs that can harass him easily since they can abuse masteries easier than others and don't really have many linear projectile skill shots; mainly Brand, Malzahar, Swain, etc.) He has no weak point except during team fights when he goes in to ONE target and then you just focus and lock him down. But in most cases, Yasuo is usually backed up by other champs that synergize with him well to get multiple targets.\n\nEdit: TL;DR: Yasuo should not have an oppressive laning phase and still scale extremely well late game. A character that has 1v1 and potentially 1v5 capabilities.","replies":[]},{"poster":"XxxLumberJackxxX","date":"2015-11-27T16:52:30.367+0000","up_votes":2,"down_votes":0,"body":"Hey buddy. @riotrepertoir\nMy biggest problem with yasuo is that his kit actually goes AGAINST the stated objectives for champins.\nFun interactions with counterplay and not just big bundles of free stats as older champions have been criticized for.\nYasuo passive- Double dip on crit. \nYasuo ult passive- free armor penetration.\n\nThere is literally 0 counterplay for that. None.  You can say what you want about winrates and high/lows of playing against and as him, but ever since yasuo launched I saw him as a completely failed champion since he couldn't be played without those two huge packages of free stats.\n\nOther champions that are almost nothing except bundles of stats:\nJax- Free AS on Passive, free armor/mr on ult. 'Free' meaning- do I need armor and mr now? Ok press this.\nMundo- Passive hp regen to balance out his health costs. Mk. E- A free AA AND free AD. and in this case free means 'do i need more ad now? ok press this' The costs and cd are fairly irrelvant. I *HATED* when I saw the E changed a few patches ago because i have always hated this ability on Mundo. And I'm guessing since he just got a little lovetap buff that means he wont get anything meaningful for a long time. That being said I'll just go abuse all of this until you rework them...","replies":[]},{"poster":"Battlecast Sona","date":"2015-11-27T07:06:03.726+0000","up_votes":2,"down_votes":0,"body":"also randomly I've been playing since season 1 and this is my first response from a rioter, woooo","replies":[]},{"poster":"Commando Yi","date":"2015-11-28T05:29:35.192+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=nqA4lEna,comment-id=000c,timestamp=2015-11-27T07:01:01.799+0000)\n>\n> The interaction you're describing with Windwall is actually intended as far as I know; it's not the result of a coding error.\n> \n> Making him scale into his crit passive in some way or another seems like a reasonable approach to reduce his power, though. Good suggestion.\n\nthink about this slowly before you nerf a poorly performing champion into the gutter\n\nwhy does a champion who can barely squeeze out a 47% win rate need more nerfs?\n\nhttp://champion.gg/statistics/#?roleSort=Middle&sortBy=general.playPercent&order=descend","replies":[]}]},{"poster":"RespectPlus","date":"2015-11-26T23:02:04.182+0000","up_votes":26,"down_votes":5,"body":"they should move the crit passive to his R, but instead of double chance, its gives flat 20%/25%/30%","replies":[{"poster":"Ferus and Ferrum","date":"2015-11-28T05:23:04.093+0000","up_votes":4,"down_votes":0,"body":"Giving flat crit chance is not the answer. They did that to tryndamere which is why he isn't allowed to be good or he just curbstomps lanes with rng alone. The double crit chance at least forces yas to build crit to have any, though moving the shield or the crit-chance to his w would be a pretty good way to gate his powerspike without gutting him. They did it with Azir but went too far with taking his knockup away imo.","replies":[]},{"poster":"FastAsHeck","date":"2015-11-27T13:07:49.521+0000","up_votes":4,"down_votes":1,"body":"If they did that, yasuo would become a Jax 2.0 because he would have no reason to build crit, so he'd just get Trinity which already synergises really well with him and maybe BOTRK and then he would build tank items, just like Jax. You have to keep in mind that they can't just remove something without compensation. What would they compensate? His damage? His tankiness?","replies":[]}]},{"poster":"IronwallJackson","date":"2015-11-26T19:58:25.218+0000","up_votes":20,"down_votes":14,"body":"The windwall thing isn't spaghetti code; it spawns inside of him and then moves forward. That's intended unless you think that Riot can't code static walls at all. Also, Yasuo's W is meant to be a form of counterplay against safe, ranged spells. It fulfils its purpose very well, and it's especially true if the player is fast enough to react. Hell, it *helps* higher latency players since they don't have to wait to see/hear the projectile, cast the spell, wait for their ping, and then wait for their cast time.\n\nI'd argue about his passives as well, but I've been talking about Yasuo endlessly since the boards started throwing a collective hissy fit and I no longer possess the patience or energy to engage you in any further written fisticuffs.","replies":[{"poster":"NotClarkolas","date":"2015-11-27T00:27:18.566+0000","up_votes":4,"down_votes":25,"body":"> [{quoted}](name=IronwallJackson,realm=NA,application-id=3ErqAdtq,discussion-id=nqA4lEna,comment-id=0000,timestamp=2015-11-26T19:58:25.218+0000)\n>\n> The windwall thing isn't spaghetti code; it spawns inside of him and then moves forward. That's intended unless you think that Riot can't code static walls at all. Also, Yasuo's W is meant to be a form of counterplay against safe, ranged spells. It fulfils its purpose very well, and it's especially true if the player is fast enough to react. Hell, it *helps* higher latency players since they don't have to wait to see/hear the projectile, cast the spell, wait for their ping, and then wait for their cast time.\n> \n> I'd argue about his passives as well, but I've been talking about Yasuo endlessly since the boards started throwing a collective hissy fit and I no longer possess the patience or energy to engage you in any further written fisticuffs.\n\nWe found the yasuo main, time for him to angrily reply about how 'he isnt one but hes just being reasonable'","replies":[{"poster":"ZLbSwAR23I","date":"2015-11-27T02:56:59.428+0000","up_votes":24,"down_votes":1,"body":"The \"Yasuo main\" gave a very detailed explanation about why is windwall isn't unintentional.\n\nYou replied with some bullshit salty comment \"Oh he's a Yasuo main just disregard his post and laugh everyone hahaha\"\n\nLong walk, short pier please.","replies":[]}]},{"poster":"Battlecast Sona","date":"2015-11-27T07:25:58.691+0000","up_votes":5,"down_votes":0,"body":"It's not fisticuffs because I'm not raging for my changes - I agree that I don't want to remove the entirety of Yasuo's counterplay abilities. But you shouldn't be able to block an Ezreal ulti by facing your wall AWAY from it - on ANY patch, for ANY reason. I don't mind that Yasuo has a windwall, I don't -really- mind that it comes out fast, but I -do- mind that it completely shields you from any projectile regardless of the direction you face it if you cast it right as the projectile intersects with your body.","replies":[]},{"poster":"Sona Ping","date":"2015-11-27T07:10:30.546+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=IronwallJackson,realm=NA,application-id=3ErqAdtq,discussion-id=nqA4lEna,comment-id=0000,timestamp=2015-11-26T19:58:25.218+0000)\n>\n> That's intended unless you think that Riot can't code static walls at all.\n\nAre we talking about the Riot that has coded walls as minions?","replies":[{"poster":"MegamanEXE79","date":"2015-11-27T15:36:49.907+0000","up_votes":2,"down_votes":0,"body":"Are we talking about Impassible terrain that Vayne can roll through?","replies":[]}]},{"poster":"Baron of Bread","date":"2015-11-27T07:27:53.771+0000","up_votes":3,"down_votes":0,"body":"While it isn't bad code, it does feel a bit unfair.  Perhaps they should code it so that the wall only covers one side of his hitbox when it is initially spawned?  That would at least cover the case where he blocks a projectile from the complete opposite direction which just feels wrong.","replies":[]}]},{"poster":"Woook3r","date":"2015-11-26T22:15:42.666+0000","up_votes":10,"down_votes":2,"body":"yes put crit on windwall.","replies":[]},{"poster":"Polaritie","date":"2015-11-27T07:23:02.190+0000","up_votes":7,"down_votes":1,"body":"Eh, his E is extremely problematic in laning I think - there's a point where somebody becomes _too_ mobile. There's a lot of champions (read: skillshot-based) who just can't do anything if he's dashing past them left and right while he gets to attack (and yeah, people will say not to fight with minions around... but that basically means not going in to last hit too, so...).\n\nPlaying against him with point and click abilities versus skillshots is night and day in terms of the matchup.\n\nEdit: I don't have an issue with it as much in teamfights, even if it's still annoying - he lacks as dense a target field and so can't make multiple dash>Q spin passes at the same person so easily. I'm thinking tone down how often he can dash between creeps, because otherwise half the mages in the game are just a question of how fast you lose lane.","replies":[]},{"poster":"Akeydel","date":"2015-11-27T08:51:20.815+0000","up_votes":1,"down_votes":1,"body":"Two things:\n1: isnt the crit on {{item:3087}} no longer 'guaranteed'? Last I checked it's possible for the damage to crit, if the aa would crit anyway, and doesnt add the % for each enemy hit. Itdoesnt really matter either way, after the 100% crit chance though....\n\n2: One thing I believe was unintentional and definitely adds to {{champion:157}}'s hidden power is his ult being cast-able on ALL DISPLACEMENTS. When he was released, it seemed like they were aiming for specifically 'knockups' ({{champion:12}} {{champion:201}} {{champion:31}} {{champion:54}} {{champion:267}}  {{champion:14}} prolly missed a few that are so clearly defined)\nThat would have limited his combo potential, and made him more situationally powerful, instead of having weird opportunities he arguably wouldn't have otherwis: \n{{champion:122}} {{champion:131}} {{champion:119}} {{champion:120}} {{champion:126}}  {{champion:78}} {{champion:133}} {{champion:33}} {{champion:27}} {{champion:134}} {{champion:412}} {{champion:18}}  {{champion:48}} {{champion:67}}{{champion:106}}","replies":[{"poster":"Kouga","date":"2015-11-27T09:34:58.794+0000","up_votes":3,"down_votes":0,"body":"There is a disconnect, in some ways, between the sort of \"word logic\" versus \"code logic\" of how CC works. For example, Yasuo's Ultimate does specify that he can target \"**Airborne**\" enemies, but it is often misunderstood by players what that means. Airborne =/= \"Knockup\". Airborne is basically coded as any CC with two components: a stun (so you can't use abilities, move or attack during it) and a \"Move Block\", which is part of the ability's code but basically means forced movement (or forced lack of movement, in the case of Suspended targets).\n\nThis means that Knock Ups (Alistair), Knock Backs (Janna), Knock Asides (Draven) are all \"Airborne\" effects. Some of these make \"word logic\" sense, such as Singed's Fling. Sure, he is actually *throwing* them over his shoulder and they are visually in the air, so that all works. However Pulls are actually coded as an Airborne effect, since they are made of 1) a stun and 2) forced movement, or a Move Block. This means that yes, Thresh can trigger Yasuo's Ultimate on both \"tugs\" of his Q in addition to his E. This makes less \"logic\" sense from a visual perspective. But its not accidental, its not a coding error, its all correct and functioning as intended.\n\nIf Yasuo's ult only functioned on actual, true 'n' blue \"knockups\" it'd hurt his power considerably and could cause its own set of problems (for example Nami, who you mentioned, can \"Knock Up\" on her Ultimate, but her Stun is actually a Suspension effect, not a knockup.)","replies":[]}]},{"poster":"TurboWindex","date":"2015-11-26T23:22:36.415+0000","up_votes":3,"down_votes":3,"body":"**Part** of what made yasuo balanced was how if his shield was down, you could poke him down. Granted you would have to have windwall on cd, or go around it but that was my main way of fighting against yasuo and my main weakness as yasuo. The new keystone mastery is so good on yasuo because it gives him 20% attackspeed practically all the time, making yasuo with 8% crit and e lv one even worse, and it heals him. So while before you could work for maybe a min in lane to get him to a spot he could be poked down, and do that enough to push him out, while you are trying to chip away at his passive and windwall, he is healing. The rest of the crit Items also work really well on him. I think a good Idea for a nerf would be to make it so his shield passive loweres his critical chance by 5%, and doesnt work untill you have 5%, this would prevent the shiv cloak 100%, make him weak to poke early, or force crit runes that wouldnt give him any crit chance.  Keep in mind that Riot has said they dont give a flying fuck about balance pre season, so dont count on anything for a bit.","replies":[{"poster":"ZLbSwAR23I","date":"2015-11-27T02:54:47.048+0000","up_votes":3,"down_votes":0,"body":"You know they nerfed it, right? It only works on champs now, not minions.","replies":[]}]},{"poster":"JustMyBassCannon","date":"2015-11-27T01:11:18.021+0000","up_votes":5,"down_votes":2,"body":"To Reason 1: All that we'd need to do, then, is have Wind Wall's hitbox start further in front of Yasuo. That's it. Instead of centering it on him, have it start at the front edge of his hitbox. This way, you can still make the same kind of last-second blocks that other, normal shield spells can do, but it does require you to actually aim the Wind Wall correctly.\n\nTo Reason 2: I just want to say that having multiple passives **is never a valid complaint**. Champions have had multiple passives or ultra-versatile passives since the dawn of the League.\nHaving said that, the idea of having his Crit passive scale up--with an ability rank or with his champ level, either one--is a valid way to curb his early-game power (although I might suggest removing the 10% self-reduced damage if this happens).\n\nOverall, this is a pretty rationally written post that accurately describes the real problems with Yasuo. The only criticisms I had for it are nitpicks rather than any issues with the material. People like you give me hope for the future of forum discussion.","replies":[]},{"poster":"Commando Yi","date":"2015-11-30T15:39:12.278+0000","up_votes":1,"down_votes":0,"body":"so this is basically a blind witch hunt by people who can't even recognize when a champion is strong or weak, just relying on their own personal experiences against the champion\n\nwho needs objective stats when we've got anecdotal evidence right?","replies":[{"poster":"Battlecast Sona","date":"2015-11-30T19:41:55.755+0000","up_votes":2,"down_votes":0,"body":"I wish you could recognize that the point of these changes wouldn't be to flat nerf Yasuo. I wish people weren't so ignorant that they could see these things.\n\nCURRENTLY, Yasuo is in a really crap spot as a character because he consistently gets nerfed whenever he becomes strong due to how overwhelming it is to play against him. These changes would be targetted at lowering the oppressiveness of his early game without affecting his mid and late game power spikes - THIS WOULD MAKE YASUO ~EASIER~ TO BUFF BECAUSE HIS MATCHUPS WOULDN'T BE AS OPPRESSIVE. \n\nThe point of these changes is not to gut the character. The point of making changes to the character in general should not be to gut the character. But pretending that Yasuo should just get buffed because \"oh he's weak\" is ignorant - everyone knows how Yasuo goes. Either he's useless or he's in every game. This behavior is the hallmark of an overloaded kit. By redistributing his power budget a bit, you allow the character's numbers to go up. Currently Yasuo is the only character in the game with a steroid that is 100% \"activated\" at level 1 - and this takes up a surprising amount of his power budget. But is it REALLY worth to double your crit at level 1 if it means that all your numbers have to be shit and your character has to be weaker than it really should be because as soon as you finish Shiv you have tons of crit? Do you REALLY think that having 100% crit at level 9 is integral to the character succeeding? Because I really don't think there's a big problem with delaying Yasuo's powerspike from a 3k gold 100% crit spike completely independent of level to, say a level 13 spike.\n\nI never said I thought Yasuo was overpowered. I never said I thought he was even strong right now. But if they redistributed power budget on his kit, they could BUFF Yasuo without catapulting him into OPness. That's the entire point of these kinds of changes - you change where he spikes so that the character can be good without being oppressive. Currently if Yasuo is strong there are too many matchups mid that he just wins outright, so he has to be kept in a very awkward state where nobody is really happy - Yasuo players are unhappy with how weak he feels when he doesn't snowball, and people playing against Yasuo get frustrated when you beat him in lane and then he gets 2-3 kills from other lanes (or farms the jungle or splitpushes for 5 minutes or WHATEVER), hits 100% crit, and comes into your lane and destroys you. He's a character who has a powerspike that is basically impossible to delay, because it's only dependent on him getting a tiny amount of gold (what's the REAL harm in delaying the 100% crit spike for a couple levels AFTER you get the items for it? Aside from making it way less oppressive to play against, there's little change in Yasuo's teamfighting in the mid or late game).","replies":[]}]},{"poster":"Drakylon","date":"2015-11-27T15:09:58.993+0000","up_votes":2,"down_votes":1,"body":"Wind Wall has no reason to last more than a fraction of a second. It was intended to be a \"cut down projectiles\" type of ability in the first place, but that was eventually made into Wind Wall because the concept was apparently too difficult to code. Right now it's used more as a zoning tool than a reactive counter to projectiles.\n\nCut its duration down to .5 to 1 second, similar to Fiora's Riposte, and make it spawn just slightly off of Yasuo's hitbox so that only projectiles from one direction are blocked right at the instant it's cast.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-28T16:46:09.421+0000","up_votes":2,"down_votes":0,"body":"Distinguo: how could the lowered duration have been difficult to code? What you're thinking about is the projectile **slowing field**, which they say was hard to code and not worth since it needed to be OP to be noticeable.","replies":[]}]},{"poster":"Dude Im a Nurse","date":"2015-11-28T07:52:26.388+0000","up_votes":2,"down_votes":0,"body":"The problem with Yasuo is that he's overused as all getout.","replies":[]},{"poster":"deJasper36","date":"2015-11-27T16:54:31.116+0000","up_votes":1,"down_votes":0,"body":"He already has a shitty winrate","replies":[{"poster":"DrNova","date":"2015-11-28T05:15:00.274+0000","up_votes":1,"down_votes":0,"body":"Part of that is because he is, I'm my opinion, super strong. So tons of people use him trying for freelo when has actually has a fair skill cap.\n\nBut in the hands of anyone who is  comfortable with him he become.ee absurdly oppressive","replies":[{"poster":"Commando Yi","date":"2015-11-28T05:30:23.281+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DrNova,realm=NA,application-id=3ErqAdtq,discussion-id=nqA4lEna,comment-id=001b0000,timestamp=2015-11-28T05:15:00.274+0000)\n>\n> Part of that is because he is, I'm my opinion, super strong. So tons of people use him trying for freelo when has actually has a fair skill cap.\n> \n> But in the hands of anyone who is  comfortable with him he become.ee absurdly oppressive\n\ncheck his stats\n\nveteran yasuo players are able to reach a 50% win rate - this is a sign that he's not in a healthy state as he is simply not rewarding even when mastered","replies":[]}]}]}]}