{"poster":"SgtBananenkuchen","date":"2018-09-30T18:10:52.403+0000","title":"Worlds Mission","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hab gerade die neue Mission bekommen, mit dem Link, wo ich mich einloggen und dann die Spiele verfolgen soll.\r\n\r\nAber die genau funktioniert das? Wie logge ich mich ein? Ich sehe oben rechts mein Icon und Namen, bin ich dann direkt eingeloggt? Und welche Spiele z&auml;hlen bzw. wie viele Spiele bzw. wie lang muss die Spiele schauen, damit es z&auml;hlt?","replies":[{"poster":"BabyRageLoL","date":"2018-09-30T18:29:20.076+0000","up_votes":3,"down_votes":0,"body":"Würde mich auch interessieren zumal man nicht mal den \"Belohnungen verdienen\" Button auf der esportsseite anklicken kann bzw es passiert nix...","replies":[{"poster":"LordZukasa","date":"2018-09-30T18:41:52.170+0000","up_votes":2,"down_votes":0,"body":"Dann hab zumindest nicht nur ich dieses Problem, gut zu wissen.","replies":[]},{"poster":"SgtBananenkuchen","date":"2018-09-30T19:49:20.445+0000","up_votes":1,"down_votes":0,"body":"Also der Link funktioniert jetzt; bin auf einer Seite, wo die Missionen zu Sehen ist, natürlich noch nicht erfüllt :'D\n\nWerde mal morgen schauen, wie das funktioniert, vielleicht doch nicht so kpmpliziert, wie ich mir das vorstelle :D","replies":[]},{"poster":"SgtBananenkuchen","date":"2018-09-30T19:42:34.055+0000","up_votes":1,"down_votes":0,"body":"Ja, bei mir und ein paar Freunden in der Liste auch","replies":[]},{"poster":"1 Flasche Cola","date":"2018-09-30T18:48:07.185+0000","up_votes":1,"down_votes":0,"body":"ah ok ist bei jedem so hab schon gedacht xD","replies":[]}]},{"poster":"ozeanpower34","date":"2018-10-01T15:48:18.657+0000","up_votes":1,"down_votes":0,"body":"Muss man ein aktives spiel schauen oder kann man auch eins nachträglich schauen?","replies":[]},{"poster":"DrakoniaDRK","date":"2018-10-01T15:16:49.174+0000","up_votes":1,"down_votes":0,"body":"Der Link funktioniert aber wenn man sich ein Video anschaut bleibt die Mission noch immer unerfüllt. Und der Support reagiert auch nicht. Also kurz gesagt das Geld wird uns abgezogen aber die Belohnung dafür bekommt man nicht. Und auch die Misison im Launcher wo man 35 Missionen erfüllen muss um das WM Symbol zu bekommen steht bei mir auf 4/35 obwohl ich mehr als 4 dieser Missionen erfüllte! Ganz schön verbuggt das Ganze.","replies":[]}]}