{"poster":"SgtBananenkuchen","date":"2018-11-15T19:09:43.156+0000","title":"Ranked Queue noch offen, obwohl Saison beendet?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Wieso sind eigentlich die Ranked Warteschleifen nocht offen, obwohl die Season vorbei ist? Klar, die Position ist schon fest, aber was bringt es eigentlich, jetzt noch Ranked zu spielen? Eigentlich nichts, oder? Wieso sind die Queues dann noch offen? (ich hab mich nie damit so wirklich besch&auml;ftigt, weil ich nie wirklich ranked gespielt habe :D)","replies":[{"poster":"HutschenKarl","date":"2018-11-16T19:37:47.960+0000","up_votes":1,"down_votes":0,"body":"Ich denke wenn die ranked abdrehen, speziell die Solo Q, rasten die Leute dermaßen aus daß sie das Militär zu Riot schicken müssen xD - Ich ereinner mich vage daß die Queues nur mehr iwann in der preseason oder  kurz vor Anfang der neuen Season abgedreht sind. Iwie zählt das was du jetzt spielst dann auch für den Reset oder kA ;) - Also verkack es nicht ganz...","replies":[]},{"poster":"Auulay","date":"2018-11-15T19:55:11.159+0000","up_votes":1,"down_votes":0,"body":"Was CLawler etwas merkwürdig Formuliert hat:\nDu kannst weiterhin rankeds spielen, du kannst zwar deine Belohnungen nicht verbessern allerdings deinen Rang damit du nächste Season auch direkt wieder höher einsteigst :)","replies":[{"poster":"SgtBananenkuchen","date":"2018-11-15T20:19:42.740+0000","up_votes":1,"down_votes":0,"body":"Auch, wenn das System für nächste Saison so überarbeitet wird?","replies":[{"poster":"BotgameOTP","date":"2018-11-15T20:59:31.534+0000","up_votes":1,"down_votes":0,"body":"Ja das wird keine Rolle spielen.  Da aber angeblich 5er Divisionen verschwinden (oder gilt das nur für dia ?) und eben 2 neue Ligen dazukommen wird zb Gold nicht mehr Gold sein sondern könnte Silber sein was die MMR angeht. Hoffe du verstehst einigermaßen was ich meine. Sprich die Ligen verschieben sich nur etwas aber der Rang kann trotzdem jetzt erhöht werden für die neue Season. Da wird dir die Überarbeitung nicht im Wege stehen.","replies":[]}]}]},{"poster":"Clawler","date":"2018-11-15T19:12:53.933+0000","up_votes":1,"down_votes":0,"body":"Hidden MMR für nächste Season\n\nEdit: Also man bekommt zwar keine Rewards mehr aber beeinflusst ganz normal seine Mmr für die kommende Season","replies":[]}]}