{"poster":"Μatteo Salvini","date":"2020-01-10T20:12:30.727+0000","title":"Reconnect!!!","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Non bastava trovare troll, feeder e afk nei game adesso anche la riot ci mette il suo contributo altrimenti non sarebbe contenta. Dopo un piccolo black out nel quartiere (ero in ranked) provo a riconnettermi alla partita, ahimè il gioco stesso mi impedisce di farlo \"togliendo\" RICONNETTITI. \r\nPRETENDO che al termine della partita mi rivengano consegnati gli LP persi nel game (eravamo in svantaggio, figuriamoci vincere 4v5), non è possibile perdere un game così senza avere la possibilità di ribaltare la situazione! \"tra parentesi, SI VERGOGNI\"","replies":[{"poster":"im not happy why","date":"2020-01-10T21:25:32.085+0000","up_votes":1,"down_votes":1,"body":"Buona sera evocatore \nMi dispiace ma non possiamo farci nulla , ci dispiace per quello che é successo , ma in queste situazioni non possiamo aiutarti .\nNon si puo' pretendere nulla specialmente la riconsegna dei PL . \nMi dispiaci ancora","replies":[{"poster":"Μatteo Salvini","date":"2020-01-10T22:22:00.401+0000","up_votes":2,"down_votes":1,"body":"Dispiace molto anche a me, dispiace molto che da parte mia non vedrete più 1 euro, perché essere preso per il culo così non mi sembra corretto. Se non potete dare di nuovo LP (cosa anche strana, perché non potreste farlo. Non mi sembra che non si possa fare a meno che voi* non vogliate LOL, dite la verità che fate più bella figura) trovate un \"modo efficace\" che risolvi questi problemi tecnici, girarci attorno non servirà a nulla... sarà successo sicuramente ad altri. Capisco che i \"poteri forti\" possono fare quello che vogliono d'altronde ormai tutto gira intorno a questo. Detto questo mi dileguo, buona serata.\n\n*voi inteso come \"Riot\", non come singoli operatori.","replies":[{"poster":"Gìove","date":"2020-01-11T20:02:29.597+0000","up_votes":1,"down_votes":0,"body":"Purtroppo noi siamo semplici volontari.\n\nQuesto forum è gestito da volontari che offre il suo tempo e le sue energie per creare iniziative per far divertire i propri utenti. \nSo che di solito può essere frustrante trovarsi Troll, AFK e flamers nelle proprie partite ma questo accade in ogni gioco, in ogni community ci sono questi personaggi indesiderati che vengono sempre puniti (Ricorda di Usare il pulsante 'report' a fine partita, funziona sempre). \n\nPer quanto riguarda i tuoi LP, non c'è molto che si possa fare, il massimo che possiamo consigliarti è quello di contattare il supporto Riot tramite ticket.\nRiperto, noi non siamo Rioter, non siamo stipendiati e siamo qui solo per aiutare la. Community, mi dispiace per quel che ti è successo, capita anche a me ma lamentarsi non porta a molto.","replies":[{"poster":"Μatteo Salvini","date":"2020-01-12T19:59:35.849+0000","up_votes":1,"down_votes":0,"body":"Bisogna ascoltare la voce del popolo, prendi come esempio \"me\" che sto sempre a contatto con i miei elettori, i piccoli imprenditori, i risparmiatori, ecc. Siamo in un paese di DEMOCRAZIA dove il il POPOLO è SOVRANO e dobbiamo ribellarci a questo sistema CORROTTO, bisogna SMUOVERE le cose in questo paese di vecchi decrepiti come Renzi, Zingaretti e tutti PDidioti \n\nCon affetto Matteo Salvini\n\n\nP.S Non provate a censurare i miei post perchè sarebbe ANTI-COSTITUZIONALE contro libertà di espressione e di pensiero. Avete osato censurarmi un messaggio tempo fa, non provate di nuovo altrimenti ricorrerò a vie legali. \n\nDi nuovo con \"NON\" affetto Matteo Salvini  (SLOGAN= PRIMA GLI EVOCATORI)","replies":[{"poster":"Hyuaska","date":"2020-01-13T13:01:08.286+0000","up_votes":1,"down_votes":0,"body":"Sì ma i 49 milioni?","replies":[{"poster":"Μatteo Salvini","date":"2020-01-14T10:17:03.316+0000","up_votes":1,"down_votes":0,"body":"Purtroppo i famosi \"49 milioni\" sono stati presi da Bossi non da me! Possiamo definirli debito del partito, quindi alla fine devo pagarli io :)","replies":[]}]}]}]}]}]}]}