{"poster":"Wolfangs","date":"2017-11-08T17:13:11.192+0000","title":"Problemi con i Premi","subforum":"Aiuto e supporto","up_votes":2,"down_votes":0,"body":"Salve a tutti, ho riscontrato un problema con il client, quando vado nei premi e clicco con il tasto sinistro le Capsule Onore e/o la Sfera 10.000 Essenze Blu non si aprono (Stessa cosa con click sinistro e &quot;Apri&quot;). Qualcuno sa dirmi come risolvere? Se devo attendere?\r\nIn sostanza volevo solamente segnalare questo problema, quindi grazie a quanti riusciranno a darmi una soluzione!","replies":[{"poster":"NickLightbringer","date":"2017-11-14T21:53:56.177+0000","up_votes":1,"down_votes":0,"body":"stesso problema, con tutti i premi! cosa posso fare?","replies":[]},{"poster":"Wolfangs","date":"2017-11-12T02:37:11.060+0000","up_votes":1,"down_votes":0,"body":"Alla fine si è tutto risolto da solo {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"SuperVergo","date":"2017-11-09T08:03:38.604+0000","up_votes":1,"down_votes":0,"body":"Anche io ho lo stesso problema, non posso convertire le sfere e ogni tanto non carica la pagina dei premi, penso sia una cosa passeggera, staranno ancora sistemando tutto quindi pazientiamo =), per chi è vecchietto come me e si ricorda, anni fa quando rilasciavano degli aggiornamenti così grandi, per almeno 1 mese era quasi impossibile giocare, lag casuali a 500 di ping fissi, 1 ora di coda per accedere al gioco e cose varie XD, quindi non mi lamento per adesso.","replies":[]},{"poster":"Wolfangs","date":"2017-11-08T20:02:39.335+0000","up_votes":1,"down_votes":0,"body":"Anche a me non carica proprio la pagina dei Premi adesso.","replies":[]},{"poster":"LawFuego","date":"2017-11-08T19:49:40.434+0000","up_votes":1,"down_votes":0,"body":"Seguo, in quanto riscontro lo stesso problema","replies":[]},{"poster":"TZombi1234","date":"2017-11-08T18:14:05.520+0000","up_votes":1,"down_votes":0,"body":"Io riesco tranquillamente ad aprire questi premi. Ho notato che in molti (anche dei miei amici) hanno questo problema..","replies":[]},{"poster":"RGM Player","date":"2017-11-08T17:17:20.961+0000","up_votes":1,"down_votes":0,"body":"Idem, sono salito a lvl 31, ho una capsula, ma non posso aprirla. \nEdit: adesso invece non carica proprio il loot.","replies":[]}]}