{"poster":"Funkér","date":"2015-05-30T20:53:37.039+0000","title":"Tut was gegen diese dummen Drophacks!","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":4,"body":"Ich hatte heute ein Ranked gespielt und wir waren dabei die Endtower zu zerst&ouml;ren.\r\nAuf einmal kriege ich Laggs und verliere meine Verbindung. Danach war nur noch &quot;Attempting to reconnect&quot; zu sehen.\r\nSchlussendlich konnten wir das Spiel nicht beenden und am Ende wurde es einfach aufgel&ouml;st.\r\nMal wieder danke an Rito, dass ihr diese Drophacker nicht in Griff bekommt.\r\nGG.\r\nff20.","replies":[{"poster":"Kaitri","date":"2015-05-30T21:03:53.639+0000","up_votes":3,"down_votes":0,"body":"was soll riot jetzt so auf die schnelle tun? gedulde dich und eventuell spiel keine rankeds (oder normals oder arams, hatte da schon drophacks :D)","replies":[]},{"poster":"SiskoD","date":"2015-05-30T21:18:41.928+0000","up_votes":1,"down_votes":1,"body":"Bei mir auch grad wieder habe auch langsam das Gefühl das nicht wirklich was dagegen gemacht wird. echt bitter bei nem sicherem win in der Promo. Komischerweiße kann das gegnerteam ohne laggs spielen...\n","replies":[{"poster":"A Dragons Heart","date":"2015-05-31T10:40:38.325+0000","up_votes":2,"down_votes":0,"body":"Das Gegner Team kann nicht ohne Laggs spielen! Wenn ein Server geddost wurde, dann fliegen alle!","replies":[]},{"poster":"Freefall013","date":"2015-05-30T21:34:15.094+0000","up_votes":2,"down_votes":0,"body":"Wenn dein gesamtes Team mit Laggs zu kämpfen hat, dann liegt das an den Servern von Riot. Du hast sicherlich auch schon mitbekommen, dass Riot mit Drophacks zu kämpfen hat, darum geht es in diesem Thread schließlich. Zu behaupten, dass Riot nichts dagegen unternehmen würde, ist absoluter Schwachsinn.\nIch schätze mal, dass du keinerlei Ahnung davon hast, wie schwierig es ist, solche Drophacks zurückzuverfolgen. Riot tut viel für seine Community, deutlich mehr als viele andere Entwickler. Ich bin fest davon überzeugt, dass Riot bestmöglich versucht, die Lage zu verbessern.\n\nWenn mal ein Ranked, vielleicht sogar eines in der Promo, von einem solchen Drophack angegriffen wird, dann ist das natürlich ärgerlich. Wegen eines einzigen solchen Spieles kann man Riot jedoch keine großen Vorwürfe machen, zumal League ja kostenlos ist. Ich persönlich hatte vielleicht 2 oder 3 Spiele, die letztendlich von meiner Matchhistory gestrichen wurden, weil es Serverprobleme gab. Also habe ich persönlich auch nicht die Erfahrung gemacht, dass es besonders oft passieren würde.","replies":[]}]},{"poster":"Zamonianer","date":"2015-05-30T20:56:32.456+0000","up_votes":2,"down_votes":0,"body":"[Erhöhtes Aufkommen von Drophacks - Mai 2015](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/JJH9QXmY-erhahtes-aufkommen-von-drophacks-mai-2015) ...\n\nGruß,\nZamo","replies":[]},{"poster":"eragon0102","date":"2015-05-31T11:00:09.927+0000","up_votes":1,"down_votes":0,"body":"Ich hatte schon 2x Drophacks in normals. Das eine Mal stand ich mit Shyvana irgendwie 16/1/5 oder so was ... Richtig schlimm ist das. Naja wenigstens in Rankeds hats mich noch nie erwischt. ^^ Btw. ich finde Rito macht einen guten Job und es wird sich gut um die Spieler gekümmert. Allerdings ist Riot keine Magierschule sondern eine normale Firma und dass heißt, auch sie sind nicht Fähig, einfach mit dem Finger zu schnipsen und es gibt keine Drophacks mehr. Ihr Hauptsitz liegt nicht in Hogwarts. (Kann man sich aber auch denken, da funktioniert Elektronik sowieso nicht) Sorry an alle deren Hoffnungen und deren Glaube gerade zerstört wurde.","replies":[]},{"poster":"A Dragons Heart","date":"2015-05-30T21:20:19.106+0000","up_votes":1,"down_votes":0,"body":"Wenn du meinst, dass Riot die Bösen sind, die die Drophacks nicht in den griff bekommen, dann versuchs du doch!","replies":[]}]}