{"poster":"I love you Malon","date":"2016-06-22T14:48:34.407+0000","title":"Brauche ein wenig Rat bei dem Champion Yasuo ^^","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Ich habe Yasuo seit ich LoL anfange zu zocken als einer der ersten Champs gekauft und zocke ihn nun 1 1/2 Jahr immer zum Spa&szlig; in normals.\r\n\r\nHab mittlerweile 58k. auf ihm und trotz allem sucke ich ballz...\r\nIch kann euch im voraus sagen das ich dieses Game in dem ich Yasuo picke feede und X/17 rausgehe x)\r\nDabei spiele ich Yasuo auch nur zum spa&szlig; da das benutzen des E gro&szlig;en Spa&szlig; macht und DAFUQ ITS A FCKING SAMURAI :D\r\nDie muss man m&ouml;gen :3\r\n\r\nMeist werde ich vom Jungler Perma gegankt, hab ein ekliges Matchup oder der gegnerische Spieler ist viel erfahrener als ich und da mir die Erfahrung fehlt werde ich einfach wegesnackt und zerst&ouml;rt D;\r\nOder ich gehe 3/0 aus der Lane und throwe es :D\r\n\r\n\r\nIch m&ouml;chte von euch gerne Mid-Lane Itembuilds vorgeschlagen bekommen und eben ein paar Tipps wie man sich usefull anstellt um nicht gleich reinzusuckken :(\r\nDa ich Top-Lane nicht spiele (Hasslane) sollte ihr mich nun auch nicht umstimmen in dem Sinne von &quot;Top-Lane ist er aber viel Besser&quot; weil ich ja nur zum Spa&szlig; ihn im Normal spiele und nicht in Rankeds :D\r\n\r\n\r\n\r\nMfg XtremBoy","replies":[{"poster":"ClAO KAKAO","date":"2016-06-22T15:11:04.515+0000","up_votes":2,"down_votes":1,"body":"https://www.twitch.tv/arkadataediting\nWarte bis er Online ist und lerne","replies":[{"poster":"I love you Malon","date":"2016-06-22T15:13:32.921+0000","up_votes":2,"down_votes":1,"body":"NICE DANKE :3","replies":[]}]},{"poster":"Pure Cynicism","date":"2016-06-22T15:13:26.894+0000","up_votes":2,"down_votes":1,"body":"Da braucht es nicht unbedingt einen Yasuo-Main, zB sind Bjergsen, Faker oder Fenix keine Yasuo-Mains, würden aber trotzdem jeden anderen Spieler stompen. Schau doch mal bei denen rein, zB:\nhttps://www.youtube.com/results?search_query=yasuo+main+mid","replies":[]},{"poster":"Pure Cynicism","date":"2016-06-22T15:07:40.570+0000","up_votes":2,"down_votes":1,"body":"Halte doch mal nach ein paar Gameplay-Videos von guten Spielern Ausschau und versuche zu verstehen, was die da so machen. Kev1nTV hat zB erst gestern wieder ein Yasuo-Gameplay hochgeladen, allerdings von der Toplane. Gibt aber auch ein paar Videos von ihm zur Midlane.","replies":[{"poster":"I love you Malon","date":"2016-06-22T15:10:15.813+0000","up_votes":2,"down_votes":1,"body":"Kennst du jemand der Main Mid-Lane Yasuo ist? :o","replies":[]}]},{"poster":"Oyasumi Punpun","date":"2016-06-22T23:13:41.129+0000","up_votes":1,"down_votes":0,"body":"In der Mitte muss man sich bei weitem nicht so sehr vor Ganks fürchten wie auf der Toplane, da du viel schneller beim Tower bist. Um aber komplett auf Nummer sicher zu gehen heißt es erstmal, nicht pushen, sondern freezen oder den Gegner pushen lassen. Das heißt am Anfang NUR lasthitten und mit der Q nicht unnötig Minions angreifen, auch nicht mit dem 3. Stack poken wenn du damit unnötig mehrere Minions verletzt. \nPoken kannst du deinen Gegner am besten indem du erst deine Q stackst, dann mit der E durch die Minions (E übrigens IMMER zuerst maximieren), durch deinen Gegner und mit einer E-Q-Combo den Knockup machen, während er in der Luft ist noch eine Basic drauf und durch die Minions wieder zurück dashen. Deswegen ist Fervor Of Battle der perfekte Keystone für ihn, weil du sehr schnell die Stacks auf ihn drauf bekommst.\nWenn du deinen Gegner in einem Trade töten möchtest, vergewissere dich erst dass der Jungler nicht in der Nähe ist, also warden oder schauen ob er gerade auf einer Sidelane ist.\nSelbe Technik wie beim poken, Q stacken, drauf dashen und erst im allerletzten Moment ulten, dass du vorher noch eine Basic drauf bekommst und nach der Animation deine Q wieder ready ist. \nDen größten Fehler den ich anfangs gemacht habe ist die Lane unnötig zu pushen, ich konnte meinen Gegner nie töten da er immer unterm Tower stand und ich wurde ständig durch den global Taunt von Yasuo gegankt. Also nur pushen wenn du back gehen willst oder du roamen möchtest, was du solltest, auch wenn Yasuo nicht die stärksten Ganks hat, kann man Fights mit dem eigenen Jungler gegen den gegnerischen Jungler provozieren.\n\nIm späteren Spielverlauf musst du Yasuo als Assassinen betrachten, du bist nicht derjenige der engaged, du versuchst schon vor dem Fight deine Q zu stacken und gehst kurz nach der Frontline rein um so möglichst viele Gegner zu knockupen und vor allem auch die High-Priority-Targets, für die solltest du dir übrigens auch die Windwall aufheben, mit ihr kannst du den gegnerischen ADC zur Neupositionierung zwingen die oftmals sehr ungünstig für ihn ist.\n\nItems:\n\n{{item:3046}} ist meiner Meinung nach ist fast allen Fällen besser als {{item:3087}}.\nDer PD gibt dir durch seinen Damage-Debuff ein enormes 1v1 Potenzial mit dem zu sogar mäßig gefeedete Gegner noch wegtraden kannst. Statiks Shiv gibt dir zwar zusätzlichen Waveclear, den hast du jedoch sowieso schon in deinem Kit und es ist sehr suboptimal wenn die Passive davon instant die komplette Wave oneshottet, da du oftmals die Minions für deine E brauchst, ob's nun zum chasen oder einfach zum outplayen ist.\n\n{{item:3031}} ist in der Mitte eigentlich ein Muss und normalerweise das zweite Item, falls die Gegner jedoch sehr viel AP-Schaden haben der dir zu schaffen macht, gönn dir ruhig vorher {{item:3156}}.\n\n{{item:3078}} ist immer noch ein starkes Item auf Yasuo, jedoch ist es eher für die Toplane geeignet, da kann man auch gerne mal auf die 100% Crit verzichten. In der Mitte nicht unbedingt zu empfehlen wenn du schon {{item:3031}} hast, dann doch lieber ein {{item:3072}} um dir den nötigen Sustain zu geben.\n\n{{item:3053}} ist ebenfalls als letztes oder vorletztes Item sehr solide, es gibt dir neben der Tankiness noch zusätzlichen Schaden den man immer gebrauchen kann, bedenke aber dass es inzwischen die selbe Passive hat wie {{item:3156}}, also niemals beides kaufen!\n\n{{item:3026}} wenn du unbedingt ein S willst und deshalb nicht sterben darfst. Außerdem gut gegen mixed Damage und vor wichtigen Teamfights. \n\n{{item:3742}} Wenn das gegnerische Team extrem viel AD hat, es gibt dir Mobility und auf deiner ersten Basic einen starken Slow.\n\n{{item:3153}} Kann entweder als Ergänzung zum {{item:3072}} gekauft werden oder als Ersatz, für den Fall das gegnerische Team hat sehr viele Tanks.\n\n{{item:3139}} Gegen Hard CC, obviously.\n\n{{item:3091}} Kann funktionieren falls das Gegnerteam sehr viel AP hat, ist aber schon sehr speziell.\n\n{{item:3009}} kauf ich mir eigentlich immer. {{item:3111}} nur bei viel CC und {{item:3006}} falls ich schon früh weiß, dass ich mir nach dem PD keinen Attackspeed mehr kaufe aber schon ziemlich gefeedet bin.","replies":[]},{"poster":"StillYasuoMain","date":"2016-06-22T21:22:32.792+0000","up_votes":1,"down_votes":0,"body":"Hallo, bin main Yasuo(250k lvl 7) auch wenn ich ihn fast nur auf der toplane spiele.\n\nAlso zuerst mal zu dem **maxing**. Als Yasuo maxt man die e und nicht die q wenn du es noch nicht weisst. Es erhöht nicht nur den Schaden des dashes und verringert der cd von 0.5 auf 0.1, sonder verringert auch den cd auf dem Ziel.\n\nAls **mastery** empfehle ich dir eindeutig fervor of battle. Deine q gibt dir 2 stacks und deine e eine(auf champs). Das ist perfekt zum outplayen und mit 8 stacks machst du einfach krass viel Schaden.\n\n**Obligatorische Items** in jedem match up:\n\n{{item:3087}} Ich weiss viele empfehlen phantom dancer, doch statikk ist einfach sooo viiel besser. Man macht so mit der ersten q einfach nur krassen dmg und kann das Ziel in den meisten Fällen danach mit der ult 1shotten. Man kann mit e+q eine gesamte minion wave clearen. Ausserdem ist Yasuos Stärke doch etwas durch Bewegung aufzuladen. Und yasuo kommt auch ohne 45% attack speed auf 1.33 sek(max) cd mit seiner q.\n\n{{item:3006}} 30% bonus attack speed/cdr auf die q...\n\n{{item:3031}} Für die 100% crit und 50% mehr dmg pro crit. Yasuos crits machen ja 175% dmg(statt 200%). Jetzt kommen 50% noch dazu. also 225%(mathematisch wärs 262.5 aber ingame wird das anders gerechnet)\n\n{{item:3072}} Yasuo wird damit zu einem echten Lifesteal Monster. 3-4 Qs und du bist full life und dazu kommt noch der Schild, der sich mit deinem passiv schild summiert.\n\n\n**Situationsabhängige Items:**\n\n{{item:3139}} Zuerst einmal Flinker Krummsäbel(QSS) . Yasuo ist meistens sofort tot wenn er in ein cc gerät, was durch einen Fehler sehr oft passieren kann. Da es in den meisten teams viel cc hat baue ich es auch fast immer. Es gibt auch noch bonus ad und lifesteal.\n\n{{item:3026}} Falls du mal der carry deines Teams bist, kann guardian angle sehr nützlich sein. Meistens kaufe ich es als letztes item gegen focus und ersetze es sobald es auf cd ist durch ein anderes item, ausser ich brauche unbedingt armor + mr.\n\n{{item:3022}} Echt gutes Item auf ihm. Es gibt dir nicht nur 300 hp und x AD, sondern jeder deiner autoattacks und Qs slowt um 40%! Damit kannst du extrem gut mit der Q kiten und mit dem Q storm mehrere Gegner aufeinmal slowen. Einfach der (Frost-)Hammer! xD\n\n{{item:3812}} Der CDR von Deathdance ist gar nicht so useless wie man denkt. Die windwall und ulti sind nämlich extrem wichtige abbilities auf denen cdr nicht schaden kann. Leider heilt man sich nicht mit der e :(, aber die ult heilt um 12% des Schaden. Also kannst du dich theoretisch mit einer 5 man ult hochheilen qährend du 15% deines erlittenen Schadens über Dauer statt sofort erleidest. Diesen kannst du mit lifesteal hochheilen bevor du ihn überhaupt ganz erleidest.\n\n\n{{item:3156}} Würde ich nur gegen viel und starkes ap nehmen. \n\n\n\n**Build order:**\n\n{{item:1001}} {{item:1042}} {{item:1051}} {{item:3086}} {{item:1042}} {{item:3006}} {{item:3087}} {{item:1018}} {{item:1053}}{{item:1038}}  {{item:1037}} {{item:3031}} {{item:1038}} {{item:3072}} \n\n\nKrummsäbel:\n\n{{item:3140}} {{item:1053}} {{item:1037}} {{item:3139}} \n\n\nFrozen Mallet:\n\n{{item:3052}} {{item:3022}} \n\n\nDeaths dance:\n\n{{item:3133}} {{item:1053}} {{item:1037}} {{item:3812}}","replies":[]}]}