{"poster":"Lady Hammerlock","date":"2016-07-19T07:47:43.462+0000","title":"When i see Taliyah with 2 HP items","subforum":"Memes & Games","up_votes":64,"down_votes":3,"body":"I say to myself &quot;man she will be toph to kill&quot;","replies":[{"poster":"Pierce The Veal","date":"2016-07-19T07:53:49.954+0000","up_votes":9,"down_votes":7,"body":"I don't get it...","replies":[{"poster":"Zarvanis","date":"2016-07-19T12:31:16.324+0000","up_votes":17,"down_votes":2,"body":"https://media.giphy.com/media/8cPpgUhTMjhF6/giphy.gif\n\nIt's an Avatar the Last Airbender joke. Toph is an Earthbender.","replies":[{"poster":"Zedex","date":"2016-07-19T14:19:06.055+0000","up_votes":1,"down_votes":9,"body":"***","replies":[{"poster":"Jakra","date":"2016-07-19T15:09:39.630+0000","up_votes":8,"down_votes":0,"body":"It's also a shame that there are still a ton of people who doesn't know what \"weeb\" actually means.\n\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Zedex","date":"2016-07-19T19:40:53.813+0000","up_votes":2,"down_votes":7,"body":"I do, and apparently so did Riot. It got removed, lol.","replies":[{"poster":"Zarvanis","date":"2016-07-19T19:59:22.173+0000","up_votes":6,"down_votes":0,"body":"Avatar is an American cartoon, you uncultured swine.\n\nIf you really do understand what a \"weeb\" is, then you're admitting to being a sad, pathetic, obnoxious child. \"Weeaboo\" is essentially the anime equivalent to words like \"fa**ot\", and that one word that starts with an \"n\". It's extremely offensive, and a word no self-respecting person would ever call someone.\n\nAlso, it's a word that really only applies to otaku and hikikomori. Calling a casual anime viewer a \"weeb\" is like telling someone they're morbidly obese just because they have ice cream every once in a while.","replies":[{"poster":"Zedex","date":"2016-07-20T11:52:51.239+0000","up_votes":1,"down_votes":5,"body":"You've obviously taken offense, someone must have struck a nerve before with the word. Regardless, comparing it to the N word is actually you being an uncultured swine. Theres a big difference between a completely racist and unacceptable term and a term used to insult people who watch a lot of anime and engross themselves in the culture.\n\nBut thanks for giving me a clear picture of what you think a fake word used to insult people over the internet means.","replies":[{"poster":"Zarvanis","date":"2016-07-20T20:09:58.202+0000","up_votes":1,"down_votes":0,"body":"http://gifrific.com/wp-content/uploads/2014/03/Buzz-Lightyear-Sad-Strange-Little-Man.gif","replies":[{"poster":"Zedex","date":"2016-07-25T18:21:37.996+0000","up_votes":1,"down_votes":0,"body":"And again, you respond with literally nothing. Typical. You have no arguments or reasoning to back up the fact that you're trying to make. The \"W\" word is nowhere near as bad as the N word. Being teased on for being heavy into japanese anime culture is nowhere near getting called a racist term like the N word which has history, and blood all over the word. the \"W\" words only history is that it was conceived on the internet, and has spread via the internet. Its merely a derogatory term for someone heavy into Japanese culture, its not an insult. If you however find it insulting, thats totally your beef, and has nothing to do with me or the people that use the word.  Shame on you for even comparing the two.","replies":[{"poster":"Zarvanis","date":"2016-07-25T20:16:48.143+0000","up_votes":1,"down_votes":0,"body":"I will admit that I exaggerated to an unreasonably extreme extent. \"Weeaboo\" is not even close to being as offensive as the other word mentioned. Comparing the two was a terrible and ridiculous mistake on my part. I'm kind of embarrassed to admit that my reaction to what you posted made me into a sort of SJW. I'm disgusted with myself for not realizing I was getting defensive for other people over something they probably just shrug off. \n\nSo let's move past all those ridiculous things I said the other day and just settle on this:\n\nCalling someone a \"weeaboo\" is childish. It's akin to \"nerd\", in that it's the kind of lame insult a schoolyard bully would use.\n\nI feel that this exchange was an eye-opening experience. I shouldn't care when people use childish words. Because they're just children. I'm 20, why should I care even the slightest bit about what a child thinks? \n\nLet's consider this interaction concluded, shall we?","replies":[]}]}]}]},{"poster":"Kitty Darkstar","date":"2016-07-19T23:39:52.076+0000","up_votes":1,"down_votes":0,"body":"I'm more casual than you","replies":[{"poster":"Zarvanis","date":"2016-07-20T20:11:15.074+0000","up_votes":1,"down_votes":0,"body":"What makes you say that?","replies":[{"poster":"Kitty Darkstar","date":"2016-07-20T20:20:35.214+0000","up_votes":1,"down_votes":0,"body":"Nothing really, I just like to get competitive over the most bizarre things","replies":[{"poster":"Zarvanis","date":"2016-07-20T20:49:44.768+0000","up_votes":1,"down_votes":0,"body":"Bizarre, eh?\n\nhttp://38.media.tumblr.com/ecd8af1229b69b796bf3ac5d9868596a/tumblr_mkif46GXUD1qdiw9jo1_500.gif\n\nhttp://33.media.tumblr.com/dea3e5251711787e871bd431bcddad6d/tumblr_mkif46GXUD1qdiw9jo2_500.gif","replies":[{"poster":"Kitty Darkstar","date":"2016-07-20T21:58:39.212+0000","up_votes":1,"down_votes":0,"body":"I'm not competing in absurdity, you would probably win that contest","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Pierce The Veal","date":"2016-07-20T04:38:59.741+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zarvanis,realm=NA,application-id=Ir7ZrJjF,discussion-id=6INZ4Kbf,comment-id=00000000,timestamp=2016-07-19T12:31:16.324+0000)\n>\n> https://media.giphy.com/media/8cPpgUhTMjhF6/giphy.gif\n> \n> It&#x27;s an Avatar the Last Airbender joke. Toph is an Earthbender.\n\nOh. Uh, never watched it. I remember seeing it on nickelodeon waaaaaaaaaaay back but the only thing I remember is a bald guy with a down arrow on his head sitting on a ball of air.","replies":[{"poster":"Zarvanis","date":"2016-07-20T05:43:31.871+0000","up_votes":2,"down_votes":0,"body":"Behind it's goofy looking exterior is one of the best shows I've ever seen. I can't describe things to save my life, so you'll just have to take my word when I say it's incredibly well written, has serious drama, and has extremely lovable and memorable character all while managing to appeal to all ages and maintaining a good sense of humor.\n\nIt also won and was nominated for a lot of awards, which is pretty neat.\nhttp://imgur.com/a/YJSEs","replies":[{"poster":"Pierce The Veal","date":"2016-07-20T10:51:19.071+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zarvanis,realm=NA,application-id=Ir7ZrJjF,discussion-id=6INZ4Kbf,comment-id=0000000000010000,timestamp=2016-07-20T05:43:31.871+0000)\n>\n> Behind it&#x27;s goofy looking exterior is one of the best shows I&#x27;ve ever seen. I can&#x27;t describe things to save my life, so you&#x27;ll just have to take my word when I say it&#x27;s incredibly well written, has serious drama, and has extremely lovable and memorable character all while managing to appeal to all ages and maintaining a good sense of humor.\n> \n> It also won and was nominated for a lot of awards, which is pretty neat.\n> http://imgur.com/a/YJSEs\n\nI honestly don't have the time to watch some *long* series, so while it may be the *best* tv show ever produced, I actually wouldn't watch it if it required me to put down over 10 hours of time. Even that would be pushing it.\n\nToo busy here m8","replies":[{"poster":"Odinakos","date":"2016-07-20T14:04:16.503+0000","up_votes":1,"down_votes":0,"body":"Watch it season by season a couple episodes per day. It does not have the dragonball curse(3 episodes to charge a kame hame) and it is quite interesting. Seasons are semi self-complete(wording?) and it is one of the best because it is both light and deep at the same time. \n\nThe legend of Kora becomes darker and the villains represent a variety of extremist beleifs (an anarchist, an aggresive capitalist, a dicator and someone i cant remember) but is still funny to watch, but less than the last airbender.","replies":[]}]}]}]}]},{"poster":"TWITCHTV ERONATE","date":"2016-07-19T14:38:45.194+0000","up_votes":4,"down_votes":1,"body":"i dont get your downvotes lol not everyone watched avatar since there are a million other animes out there to choose from","replies":[{"poster":"Khadaver","date":"2016-07-19T19:03:54.103+0000","up_votes":2,"down_votes":0,"body":"is avatar even an anime? i thought it was just inspired by it.","replies":[{"poster":"Zarvanis","date":"2016-07-19T20:02:57.777+0000","up_votes":3,"down_votes":0,"body":"If you want to get technical, anything animated is \"anime\", since it's the Japanese term for animation. \n\nBut in terms of how it's usually referred, Avatar is an american series. Thus, not an anime.","replies":[]},{"poster":"TWITCHTV ERONATE","date":"2016-07-19T20:16:31.131+0000","up_votes":1,"down_votes":1,"body":"well you can't call it a cartoon can you\nwhatever lol","replies":[{"poster":"Votable Jester","date":"2016-07-20T01:54:22.885+0000","up_votes":1,"down_votes":0,"body":"Yes you can call it a cartoon...\nIt is an American cartoon (just with the style of a Japanese anime).","replies":[]}]}]},{"poster":"RookPusher","date":"2016-07-19T14:47:41.866+0000","up_votes":1,"down_votes":1,"body":"Or, you know, non-anime things to choose from.","replies":[{"poster":"Zarvanis","date":"2016-07-19T20:13:39.422+0000","up_votes":2,"down_votes":0,"body":"It's sad to me that are people who see Dragon Ball Z and Sailor Moon and think all anime are like that. There are plenty of anime and Manga series that are serious and mature, with none of that shouting and fan-service. Naoki Urasawa's 'Monster' is a fantastic mystery psychological drama, but most people won't even give it a shot because it's from Japan.","replies":[{"poster":"RookPusher","date":"2016-07-19T20:30:06.661+0000","up_votes":1,"down_votes":0,"body":"Don't go by my comment. I listen to Intelligence Squared or Malcolm Gladwell talks while I'm playing LoL.","replies":[]}]}]}]}]},{"poster":"Narvuntien","date":"2016-07-19T14:41:22.474+0000","up_votes":1,"down_votes":1,"body":"It is made in the USA though doesn't really count as weeb.","replies":[{"poster":"Mr Bruce Swain","date":"2016-07-19T15:19:30.291+0000","up_votes":3,"down_votes":0,"body":"Actually kinda do, since anime are essencially japanese cartoons (anime kinda literally means cartoon) so the difference between what we call cartoon and what anime is only the country of its origin.\nFor Japanese person ATLA is basicly western anime.\nDepends on how you would define weeb, if as a person overly attached to anime only then it could be maybe disputable but if you'll add also the obsession about everything Japan related to the point when somone wants to be more Japanese than Japanese themselves then yeah watching cartoons as western animations like Avatar doesnt rly makes you a weeeb.","replies":[{"poster":"Auz the Ripper","date":"2016-07-19T21:02:20.841+0000","up_votes":1,"down_votes":0,"body":"I'm say, in the US at least, Anime and Cartoons are just different styles irrelevant of the nation of origin now days, although they still tend to be most popular in their home countries.","replies":[]},{"poster":"Dicerson","date":"2016-07-19T20:46:33.034+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Irimort,realm=EUNE,application-id=Ir7ZrJjF,discussion-id=6INZ4Kbf,comment-id=00020000,timestamp=2016-07-19T15:19:30.291+0000)\n>\n> Actually kinda do, since anime are essencially japanese cartoons (anime kinda literally means cartoon) so the difference between what we call cartoon and what anime is only the country of its origin.\n> For Japanese person ATLA is basicly western anime.\n> Depends on how you would define weeb, if as a person overly attached to anime only then it could be maybe disputable but if you&#x27;ll add also the obsession about everything Japan related to the point when somone wants to be more Japanese than Japanese themselves then yeah watching cartoons as western animations like Avatar doesnt rly makes you a weeeb.\n\nThe actually definition of Weeb (Full Term: Weabu) (Note this is my interpretation of an explanation by a guy who explained the term in full) Is basically someone who is obsessed with a culture, but is so self-centered, lazy, and disrespectful that not only do they know nothing about the culture, but will claim to know more than those who do.\n\nThis isn't 100% accurate, so here is the video on it.\nhttps://www.youtube.com/watch?v=1YYYwhSILL4","replies":[]}]}]},{"poster":"Are","date":"2016-07-19T19:37:54.373+0000","up_votes":2,"down_votes":0,"body":"\"My name is Toph because it sounds like tough\"","replies":[{"poster":"Votable Jester","date":"2016-07-20T01:57:40.663+0000","up_votes":2,"down_votes":0,"body":"\"BAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHH.\nThere, I got a pretty good look at you.\"","replies":[]}]},{"poster":"aítch","date":"2016-07-19T20:37:43.572+0000","up_votes":1,"down_votes":0,"body":"> When i see Taliyah with 2 HP items\n\nT R I G G E R E D","replies":[{"poster":"Lady Hammerlock","date":"2016-07-20T01:23:58.445+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FrostFireTaliyah,realm=NA,application-id=Ir7ZrJjF,discussion-id=6INZ4Kbf,comment-id=0004,timestamp=2016-07-19T20:37:43.572+0000)\n>\n> T R I G G E R E D\n\nWhats so wrong about running {{item:3152}} + {{item:3116}} ,it works for me","replies":[{"poster":"aítch","date":"2016-07-20T20:00:13.549+0000","up_votes":1,"down_votes":0,"body":"Depends on your definition of HP items.  Personally I don't like the protobelt itemization since I would much rather prefer abyssal/Zhonyas with Morelos but if you never built morello then protobelt is decent but I much rather enjoy a sustain burst dps build over the one shot a carry build since Talitah can already do that.","replies":[]}]}]},{"poster":"Chaos689","date":"2016-07-19T11:47:14.280+0000","up_votes":4,"down_votes":4,"body":"So every mage nowadays?","replies":[]}]}