{"poster":"Riot Ezkii","date":"2019-11-27T23:35:45.755+0000","title":"[AVISO] Pausa al Aviso en el cliente sobre la actualización del nombre de usuario","subforum":"Charlas Generales","up_votes":8,"down_votes":4,"body":"La semana pasada, empezamos a distribuir correos a los jugadores que necesitaban actualizar su nombre de usuario como parte de nuestra transición a cuentas Riot [(Más información aquí)](https://support.riotgames.com/hc/es-419/articles/360037264394-Cuentas-de-Riot)).\n\nEstos correos incluían una lista de cuentas vinculadas a tu dirección de correo electrónico, a la vez que enlaces para entender el por qué hacemos estos cambios. Para algunos, esta lista incluía cuentas olvidadas (Tal vez estabas de vacaciones en otra región, o te registraste en el PBE, o querías jugar con alguien que vivía en otra región). \n\nSi bien la mayoría de los casos de nombres duplicados eran instancias legítimas de dos personas diferentes con el mismo nombre de usuario y esto tiene que ser corregido, creímos que tener una lista de tus cuentas podría disminuir las chances de accidentalmente quitarte el nombre a ti mismo; para clarificar, el correo no te dejará saber si alguien más tenía tu mismo nombre, esto por riesgos de seguridad que surgen incluso si no te decimos quien tiene la cuenta o de que región son.\n\nDesafortunadamente, el proceso de estos correos está tomando más de lo planeado. Como resultado, algunos de ustedes se encontraron con un aviso obligatorio de cambiar su nombre de usuario sin saber que estaba ocurriendo y sin tener la información que provee este correo. \n\nPor ahora desactivamos el aviso en el cliente hasta que la distribución de los correos haya concluido. Ahora verás una versión del aviso en el cliente que podrás cerrar y solo avisará de los cambios próximos para informar a todos los jugadores posibles, pero no lo haremos obligatorio de nuevo hasta que los correos se hayan enviado.\n\nSabemos que esta transición ha causado mucha confusión. Esperamos que nuevas características del cliente como \"Permanecer conectado\" disminuyan la frustración de tener que ajustarse a un nuevo nombre de usuario y al implementar estos cambios la experiencia con los con los juegos que anunciamos durante la celebración de los 10 años sea más llevadera.\n\nSi tienes alguna pregunta adicional, por favor revisa este [artículo de soporte](https://support.riotgames.com/hc/es-419/articles/360037264394-Cuentas-de-Riot).\n\n[Aviso original](https://boards.na.leagueoflegends.com/en/c/developer-corner/Rw1knV9P-username-update-client-prompt-on-pause)","replies":[{"poster":"Carmat","date":"2019-11-28T00:25:45.037+0000","up_votes":6,"down_votes":0,"body":"Conclusión: Se va demorar un poco más hasta que el correo de aviso llegue a todos los que tiene el USER repetido a nivel global.\n\nRecomendación: Para los que les salio el aviso en el cliente se recomienda que de todas formas hagan el cambio, porque les llegará de manera obligatoria tarde o temprano dicho aviso. Abrir el link en modo incógnito para no tener problemas => https://update-account.riotgames.com/","replies":[{"poster":"Riot Ezkii","date":"2019-11-28T00:55:34.020+0000","up_votes":4,"down_votes":2,"body":"Esto es correcto, gracias por el resumen :)","replies":[{"poster":"Shiroe92","date":"2019-12-01T23:42:54.904+0000","up_votes":1,"down_votes":1,"body":"hola necesito ayuda es posible me puedas ayudar?","replies":[{"poster":"Guilty Raven","date":"2019-12-01T23:57:35.664+0000","up_votes":2,"down_votes":0,"body":"No te van a poder ayudar si ya cambiaste el nombre no aceptan cambios","replies":[]}]}]}]},{"poster":"Exe1545","date":"2019-11-28T15:14:37.093+0000","up_votes":4,"down_votes":0,"body":"Y los que ya se vieron obligados a cambiar de usuario ? A mi no me importa haber tenido que cambiar pero No registre una cuenta de vacaciones y NO abri cuentas que me haya olvidado, no entiendo como un nick random como el mio pueda ser usado. Salvo que se haya vinculado automaticamente con la cuenta que existe en NA que es la primera que cree alguna vez antes de que existiera este servidor y no tiene actividad desde hace años porque ni siquiera jugue al juego hasta tiempo despues. No entiendo la verdad.","replies":[{"poster":"Riot Ezkii","date":"2019-11-28T16:26:29.361+0000","up_votes":1,"down_votes":3,"body":"Hey Exe, en tu caso parece ser que efectivamente la redundancia eras tú mismo con otra cuenta. Podemos ayudar a hacer un switch de usuarios con la otra cuenta, pero para eso necesitamos que abras un ticket con la solicitud.","replies":[{"poster":"Exe1545","date":"2019-11-28T17:37:42.540+0000","up_votes":1,"down_votes":0,"body":"Que pena que se haya vinculado esa cuenta primero cuando esta sin actividad hace años. Si me gustaria que borrarla o vincularla para tenerla por si acaso, mejor si no se pierde la cuenta de NA esta abierta desde 2013 cuando escuche por primera del juego aunque no la haya usado nunca","replies":[{"poster":"Riot Ezkii","date":"2019-11-28T17:45:35.008+0000","up_votes":1,"down_votes":1,"body":"No se va a perder ninguna cuenta. Lo único que va a pasar es que las cuentas intercambian nombres de usuario, eso es todo. Porfa abre un ticket para apoyarte.\n\nSaludos!","replies":[{"poster":"Exe1545","date":"2019-11-28T18:09:04.545+0000","up_votes":1,"down_votes":0,"body":"Abri un ticket, gracias por responder {{sticker:slayer-jinx-catface}}","replies":[]}]}]}]}]},{"poster":"Nísta","date":"2019-12-04T03:45:43.709+0000","up_votes":1,"down_votes":0,"body":"¿Alguien se piensa que uno es tan tonto de vincular todas las cuentas? Si te permabanean una por error suyo seguro caen todas las demás","replies":[{"poster":"Del0reaN","date":"2019-12-07T19:27:57.331+0000","up_votes":1,"down_votes":0,"body":"Las sanciones no debieran ser por cuenta general. ¿Estás seguro que funcionaría de esa forma?","replies":[{"poster":"Nísta","date":"2019-12-08T00:41:23.919+0000","up_votes":1,"down_votes":0,"body":"No me refiero a que te baneen todas las cuentas sino que te la podrían tener fichada para que a la mínima te la suspendan como a la otra","replies":[{"poster":"Del0reaN","date":"2019-12-08T14:01:25.319+0000","up_votes":2,"down_votes":0,"body":"Es el mismo criterio. Tener una misma cuenta no debiera hacer que tu comportamiento en un juego influya sobre el otro. Y si así lo fuera, ¿te parecería mal? Primero: dudo mucho que te permabaneen \"por error suyo\". Más bien será por error propio. Y segundo: si fuese de esa manera, sería mucho mejor. Mientras sirva para castigar a los que hacen las cosas mal, me parece perfecto.\n\nNo es lo mismo hacer las cosas bien que hacer las cosas mal.","replies":[]}]}]}]},{"poster":"PBiersakop","date":"2019-11-28T16:23:04.433+0000","up_votes":2,"down_votes":0,"body":"Antes de ayer Cambie el nombre de mi cuenta main, ayer fue imposible entrar a mi cuenta, quiza me equivoque al escribir la nueva o no se, la cosa es que no tengo acceso al correo de esa cuenta creada hace mas de 6 años.","replies":[]},{"poster":"J  Ø  K  Ą","date":"2019-11-28T02:12:44.657+0000","up_votes":1,"down_votes":0,"body":"no me deja iniciar sesión ya revise la contraseña y esta bien tambien el nick de usuario, he estado leyendo sobre el tema de que tenes que cambiar el nick de tu cuenta pero eso es dentro, no tu nick de inicio de sesión me explico? la cuestion es que mi nick ya lo habia cambiado hace rato y es algo nuevo por ende no me llego ningun mensaje para que cambiara de nombre y demas, pero una vez que estoy en casa y abro el cliente inicio sesión normalmente como siempre pero me dice que es incorrecto  siendo que pongo todo correctamente, http://prntscr.com/q33i71 aqui pueden fijarse, la cosa es que no se si tengo que cambiar de nick de inicio de sesiòn  (que nose como hacer eso) porfavor si alguno sabe algo que me ayude con este problemita porque la verdad me va a dar algo.\nAgradeceria que me puedas ayudar Riot Ezkii o si alguno esta informado en esto","replies":[{"poster":"Sofia ADCarry","date":"2019-11-28T11:30:20.647+0000","up_votes":2,"down_votes":0,"body":"me pasa exactamente lo mismo desde ayer y todavia sigo sin solucionarlo","replies":[]},{"poster":"NazzaSaint","date":"2019-12-02T17:04:25.664+0000","up_votes":1,"down_votes":0,"body":"X2","replies":[]}]},{"poster":"Socialismo","date":"2019-11-28T07:42:11.649+0000","up_votes":2,"down_votes":0,"body":"yo me puse de nick riot devolveme mi nombre, asi que el nick viejo mio de toda la vida para cuando?","replies":[]},{"poster":"Julián Azkhargen","date":"2019-11-28T01:38:12.526+0000","up_votes":1,"down_votes":0,"body":"A mí no me ha llegado nada al cliente ni al correo, por lo que al parecer, mi nombre de usuario es único en el mundo; qué suerte :3","replies":[{"poster":"Riot Ezkii","date":"2019-11-28T01:48:55.251+0000","up_votes":2,"down_votes":1,"body":"Si te conectaste entre ayer y hoy temprano y no te pidió cambio, entonces no tienes que hacerlo dado que no hay redundancia, de igual se estarán mandando los mails en el transcurso de los siguientes días es lo que nos han informado.   :)","replies":[{"poster":"Julián Azkhargen","date":"2019-11-28T14:22:09.182+0000","up_votes":1,"down_votes":0,"body":"Me conecto a diario al LoL y reviso mi correo de igual manera, y no me ha llegado nada. Gracias por responder :3","replies":[{"poster":"Riot Ezkii","date":"2019-11-28T14:39:24.714+0000","up_votes":2,"down_votes":1,"body":"Igual para tu paz mental, he revisado y me parece que no tienes redundancia, así que ntp.","replies":[{"poster":"Julián Azkhargen","date":"2019-11-28T15:48:50.023+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias :D","replies":[]}]}]},{"poster":"NazzaSaint","date":"2019-12-02T19:42:59.127+0000","up_votes":1,"down_votes":0,"body":"El correo que use para crear la cuenta lleva más de 5 años bloqueado y aún no me lo devuelven. Te paso mi contraseña y nombre de usuario anterior si es necesario pero quiero mi cuenta invertí mucho tiempo y dinero.","replies":[{"poster":"Riot Ezkii","date":"2019-12-02T22:12:44.208+0000","up_votes":1,"down_votes":0,"body":"Tendrías que mandar un ticket como \"Recuperación de cuenta\" de esta manera no te pide logearte. Se validará información de la cuenta y el agente te podría apoyar a cambiar el correo asociado.","replies":[{"poster":"TasteMyOrange69","date":"2019-12-06T02:51:44.609+0000","up_votes":1,"down_votes":0,"body":"Podrias ayudarme un poco porfavor?, intento hacer el ticket de recuperacion de cuenta pero me pide el nombre de usuario y al momento que lo cambie cuando lo pidieron, ya no lo recuerdo y ahora que uso la opcion de que \"olvide mi cuenta de usuario\" pongo el correo vinculada con la cuenta y solo me llega el de la cuenta \"pequeña\" que tengo, ya que con ese correo tenia las 2 cuentas\n\nPorfavor ayuda :(","replies":[]}]}]}]}]},{"poster":"Rod Flanders","date":"2019-11-28T00:27:51.908+0000","up_votes":1,"down_votes":0,"body":"No sé, a mi me pasó con una de las cuentas y no tuve problema en cambiar el nombre de inicio de sesión... Claro que tenía una cuenta con el mismo nombre en NA y supongo que por eso pasó.","replies":[{"poster":"Riot Ezkii","date":"2019-11-28T00:55:17.288+0000","up_votes":2,"down_votes":1,"body":"Es correcto, es posible que tú mismo seas la redundancia por la cual te está saliendo el mensaje. Si después de cambiar el user en la cuenta de NA aún te sale en mensaje en la cuenta de LAS, significa que   o tienes otra cuenta con el mismo user que no recuerdas   o  2. alguien más tiene el mismo user y se tendrá que alterar/cambiar","replies":[{"poster":"Rod Flanders","date":"2019-11-28T01:13:46.920+0000","up_votes":1,"down_votes":0,"body":"Sí sí, comprendo perfectamente por qué sucede. Igual lo hice anteayer y no tuve ningún tipo de problema, ya logueo con el usuario nuevo y demás.","replies":[{"poster":"Riot Ezkii","date":"2019-11-28T01:47:48.202+0000","up_votes":2,"down_votes":1,"body":"{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Rod Flanders","date":"2019-11-28T06:03:51.247+0000","up_votes":1,"down_votes":1,"body":"Ya que respondés muy amablemente. ¿Tenés idea a quién puedo recurrir para ser voluntario del foro? Podrás ver en mi historial cómo he (no desde ahora sino años) dedicado a ayudar. Pasa que a veces por ser un simple user no te toman en serio (me pasó con el post del Emporio de la Esencia que pensaron que estaba dando \"información dudosa\").","replies":[{"poster":"Hnk Kenshiro","date":"2019-11-29T02:49:39.780+0000","up_votes":1,"down_votes":0,"body":"Te dije que fue ignorancia mía nomás porque no habia actualmente ninguna noticia y la anterior era de 6 meses atrás que tampoco lei asi que no sabia si se mantienen las condiciones, y faltando solo un dia practicamente solo tenía que esperar y ver que ponian y ya xd","replies":[]}]}]}]}]}]},{"poster":"Apøllyøn","date":"2019-11-28T00:04:11.366+0000","up_votes":1,"down_votes":0,"body":"se me olvido el usario c:","replies":[{"poster":"Riot Ezkii","date":"2019-11-28T00:59:12.021+0000","up_votes":2,"down_votes":1,"body":"Para recuperarlo hay de dos sopas, o abres un ticket a soporte para recuperación de cuenta (Ahorita tenemos tiempos de espera altos por el gran número de solicitudes) o entras a este link: https://recovery.riotgames.com/es-419/forgot-username?region=LA2  , pero es posible que tengas que esperar un poco porque de momento está deshabilitado por todo el tema de los usuarios :(","replies":[]},{"poster":"Syure","date":"2019-12-02T15:08:06.613+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Apøllyøn,realm=LAS,application-id=v7qsfXsE,discussion-id=uFO9mJPY,comment-id=0001,timestamp=2019-11-28T00:04:11.366+0000)\n>\n> se me olvido el usario c:\n\nA mi tambien necesito ayuda D;","replies":[]}]},{"poster":"Diegotex123","date":"2019-11-28T00:20:50.236+0000","up_votes":1,"down_votes":0,"body":"me da gusto la presencia de los rioters y los voluntarios en estos momentos \n{{sticker:sg-ahri-2}}","replies":[{"poster":"Riot Ezkii","date":"2019-11-28T00:57:02.093+0000","up_votes":2,"down_votes":1,"body":"{{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"Teemo PRO","date":"2019-11-27T23:37:48.290+0000","up_votes":1,"down_votes":0,"body":"ezkii sabes algo de esto??\n\nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/F7EFWn76-nueva-mecanica-cosecha-oscura-y-aery-rioter-que-confirme","replies":[{"poster":"Riot Ezkii","date":"2019-11-28T00:56:23.887+0000","up_votes":2,"down_votes":1,"body":"Para que le miento joven, de cosas técnicas y  jugabilidad no tengo nada de información :( , sorry","replies":[]}]},{"poster":"GranRenzo2","date":"2020-01-23T15:57:09.084+0000","up_votes":1,"down_votes":0,"body":"Disculpe gracias a este cambio mi cuenta en LAN de GranRenzo ya no es posible ingresar, en esta cuenta intente ponerle mi nombre de usuario anterior y veo que ya está ocupado y entonces que, mi cuenta ya no será posible ingresar? he tenido demasiado progreso en esa cuenta, estoy en el nivel 179 y quiero saber si me la pueden regresar o decirme que nombre de usuario nuevo le pusieron porque no me ha llegado ningún correo de cambio de nombre {{champion:32}} \n{{sticker:zombie-nunu-tears}}","replies":[{"poster":"GranRenzo2","date":"2020-01-23T16:03:01.903+0000","up_votes":1,"down_votes":0,"body":"También quiero decir que como mi cuenta de LAN es antigua no se el correo que tiene, si me quieren hacer preguntas sobre la cuenta estaré feliz de responder para verificar que es mía{{champion:82}} \n{{sticker:poppy-wink}}","replies":[]}]},{"poster":"Stephen Carry","date":"2019-12-15T17:42:42.988+0000","up_votes":1,"down_votes":0,"body":"Buenas, al registrarme en Riot no me dejo usar mi nombre de usuario (el cual me correspondia desde 2013 en league of legends) y tuve que agregarle numeros, me gustaria recuperar mi usuario de siempre por que me parece injusto que se me sea sacado, como puedo hacerlo?","replies":[]},{"poster":"RecorcholyS","date":"2019-12-13T15:27:51.835+0000","up_votes":1,"down_votes":0,"body":"Gracias Riot, sinceramente gracias por arruinar una vez mas la tranquilidad de tus jugadores. Cada dia superandote en empeorar la experiencia de usuario de todos nosotros. Atentamente, uno mas al que su hermoso sistema de notificaciones no le avisó pero que tenía que actualizar su nombre de usuario. Esta cuenta tiene tantos años que el mail ni lo recuerdo.\nAgrego la poca consideracion que tenés con los usuarios mas \"viejos\" por no darle ninguna prioridad a sus nombres de usuario.\nDoy por hecho que no van a solucionar mi problema, ni el de la gran mayoria de jugadores, como es costumbre de ustedes. \nSolo me queda anotar mi usuario para no olvidarlo y no poder recuperarla, con los riesgos de seguridad que eso conlleva.\n#RGLRMQTP\n\n{{sticker:sg-shisa}}","replies":[]},{"poster":"Altrx07","date":"2019-12-13T12:17:25.990+0000","up_votes":1,"down_votes":0,"body":"Gracias riot, gracias por obligarme a cambiar el nombre de usuario que uso hace casi 5 años y que uso en todos los juegos hace 10, siempre buscando lo mejor para todos los jugadores en esta hermosa comunidad. F.O","replies":[]},{"poster":"CIark","date":"2019-12-11T00:23:31.079+0000","up_votes":1,"down_votes":0,"body":"Me llegó un mail diciendo que tengo que cambiar mi nombre de usuario por qué tengo el mismo nombre en 2 regiones diferentes mi duda es tengo que cambiar el nombre en las 2 regiones o puedo cambiarlo solo en una","replies":[]},{"poster":"EdiGT","date":"2019-12-08T14:50:18.658+0000","up_votes":1,"down_votes":0,"body":"tengo un problema, cambie el nombre y olvide cual puse, pero hago en la pagina lo de \"olvide mi nombre de usuario\" y al mandar correo nunca me llega :( (ni siquiera al Spam","replies":[]},{"poster":"lil peëp","date":"2019-12-02T18:56:22.304+0000","up_votes":1,"down_votes":0,"body":"hola, necesito ayuda, cambie el nombre de invocador hace unos días y no lo recuerdo, el correo con el que me hice la cuenta es uno muy antiguo que no me acuerdo cual era :( , como podria recuperar mi cuenta? (tengo la sesion abierta en el navegador){{sticker:sg-janna}}","replies":[]}]}