{"poster":"TOPKEK Momso","date":"2016-06-15T13:24:43.829+0000","title":"PVP.net Patcher Kernel funktioniert nicht mehr","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo,\r\nImmer wenn ich versuche mein lol zu starten &ouml;ffnet sich stattdessen das fenster mit der meldung PVP.net Patcher funktioniert nicht mehr.\r\nIch hab schon vieles versucht als admin starten, bestimmte datein ersetzten usw. doch nichts funktioniert.\r\nIch w&uuml;rde mich sehr auf Hilfe freuen und w&auml;re sehr dankbar wenn ich diese bekommen w&uuml;rde.","replies":[{"poster":"silibum","date":"2016-06-15T13:30:16.699+0000","up_votes":2,"down_votes":0,"body":"Starte bitte mal \"lol.launcher.admin.exe\" (per Rechtsklick -> Als Administrator Ausführen) aus dem Installationsordner - geht es danach wieder wie gewohnt (beachte das \".admin\" im Dateinamen)?","replies":[{"poster":"TOPKEK Momso","date":"2016-06-15T13:32:06.960+0000","up_votes":1,"down_votes":0,"body":"nein das hab ich auch schon probiert {{item:3070}}","replies":[{"poster":"silibum","date":"2016-06-15T13:33:35.230+0000","up_votes":1,"down_votes":0,"body":"Tritt das Problem seit neusten, oder schon immer auf? Hat sich Dein System seit dem auftreten verändert?","replies":[{"poster":"TOPKEK Momso","date":"2016-06-15T13:35:02.640+0000","up_votes":1,"down_votes":0,"body":"das Problem trat heute ein\ndoch ich hatte das selbe problem schon mal damals hab ich eine datein einfach ersetzt und dann ging es wieder.\nund nein mein system hat sich nicht verändert","replies":[{"poster":"silibum","date":"2016-06-15T13:38:05.023+0000","up_votes":1,"down_votes":0,"body":"Wie lange ist damals her? Den aktuellsten Client findest Du [hier](http://client.sreeata.de/LoL%20EuW%206%2012.7z). Austauschen geht ja relativ flott. Interessant wäre warum das Problem auftaucht - findet sich etwas im Ereignisprotokoll?","replies":[{"poster":"TOPKEK Momso","date":"2016-06-15T13:42:40.079+0000","up_votes":1,"down_votes":0,"body":"nicht sehr lang paar monate genau weiß ich das jetzt leidner nicht.\nund worauf soll ich den im Ereignisprotokoll achten?","replies":[{"poster":"silibum","date":"2016-06-15T13:52:49.953+0000","up_votes":1,"down_votes":0,"body":"Fehler und Warnungen vor allem, zu dem Zeitpunkt des Clientstarts (Fehlerzeitpunkt).\n\nAnsonsten einfach den verlinkten Client ausprobieren - sollte der gehen gibt es ein Paar Dinge die wir noch prüfen könnten (Festplatte, etc. pp). \n\nManchmal ist es einfach etwas zu tauschen ('reinstall'), als das Problem tiefer zu analysieren - was ich aber gerne mit Dir tun werde, sofern Bedarf besteht.","replies":[{"poster":"TOPKEK Momso","date":"2016-06-15T14:15:25.668+0000","up_votes":1,"down_votes":0,"body":"so es funktioniert nun.\nwie sollen wir jetzt die anderen dinge prüfen ?","replies":[{"poster":"silibum","date":"2016-06-15T14:19:08.740+0000","up_votes":1,"down_votes":0,"body":"Mache bitte mal eine Prüfung der Festplatte: http://windows.microsoft.com/de-de/windows-vista/check-your-hard-disk-for-errors\n\nDas ist so der einfachste Teil. Ich gehe davon aus, dass Du den Client nun einfach ausgepackt und gestartet hast und nicht überschrieben hast?","replies":[{"poster":"TOPKEK Momso","date":"2016-06-29T14:00:10.498+0000","up_votes":1,"down_votes":0,"body":"Hallo ich bins wieder und ich kann mein lol wieder nicht öffnen es ist genau das selbe problem aufgetretten.\nkönnte mir jemand dabei helfen das Problem permanent zu beheben","replies":[{"poster":"silibum","date":"2016-06-29T17:19:01.654+0000","up_votes":1,"down_votes":0,"body":"Könnte es ggf. sein dass Du drittanbieter Software einsetzt (plays.tv oder aehnliches)? Dann kommt das schon mal vor - deaktiviere diese bitte falls vorhanden, ansonsten: Was hast Du nun alles getan, was hast Du geprüft, welche der Hilfen aus der [Toolbox](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/X3waeihA-wrenchmens-toolbox-lasungen-zu-bekannten-problemen-und-fehlern) hast Du probiert?","replies":[{"poster":"TOPKEK Momso","date":"2016-06-29T17:34:02.966+0000","up_votes":1,"down_votes":0,"body":"eigentlich schon fast alles nur damit \nhttp://client.sreeata.de/\nhat es das letzte mal funktioniert ich probier es gleich nochmal ob es wieder damit geht","replies":[{"poster":"legofreak1","date":"2016-06-30T21:08:07.558+0000","up_votes":1,"down_votes":0,"body":"Hast du bereits, wie von Silibum gefragt, die Prüfung der Festplatte durchgeführt und Drittanbietersoftware im Hintergrund deaktiviert? Deaktiviere bitte auch testweise dein Antivirenprogramm, manchmal sind diese auch etwas überempfindlich und löschen Dateien, die für den Client wichtig sind.\n\nWenn das nicht hilft, findest du unter **C:/RIOT Games/League of Legends/Rads** Dateien, die einen Namen der Form **rads_user_kernel.log** haben. Mit jedem starten des Patchers wird die Dateiendung geändert, zu .log1 bis .log9. Kannst du bitte das Log raussuchen, das zeitlich zu dem Zeitpunkt passt, an dem du den Patcher unerfolgreich versucht hast zu öffnen?\n\nDas Log kannst du mit dem Windows-Texteditor öffnen, den *kompletten* Inhalt kannst du dann kopieren, auf [pastebin.com](pastebin.com) einfügen und den Link dazu hier posten.\nIch bin die nächsten 2 Tage viel unterwegs und Silibum ist anderweitig nicht verfügbar, ich werde hier aber reinschauen, sobald ich die notwendige Zeit dazu finde.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Nippel WilIy","date":"2016-06-15T16:21:11.444+0000","up_votes":1,"down_votes":0,"body":"ich hab das selbe problem alle paar tage. Aber diesmal löst es sich nicht von aleine. meistens mach ich nur meinen pc aus, dann laufen automatisch ein paar updates und anschließend geht es wieder :D. Diesmal hab ich nun alle updates hinter mir, sowie einen repatch erzwungen und es tut sich nichts. Vielleicht liegts ja mal zur abwechslung an Riot. Sagt mir bitte bescheid wenn es wieder geht ^-^.","replies":[{"poster":"TOPKEK Momso","date":"2016-06-15T17:29:10.313+0000","up_votes":1,"down_votes":0,"body":"es geht wieder.\naber ich habe den client neu heruntergeladen","replies":[{"poster":"Nippel WilIy","date":"2016-06-16T13:09:16.758+0000","up_votes":1,"down_votes":0,"body":"Bei mir ist es das gleiche Szenario wie immer. Habe gestern noch 1,2 Sachen probiert, jedoch ohne Erfolg. Dann irgendwann den PC ausgemacht. Nun habe ich heute den PC wieder angemacht und siehe da, der Patcher öffnet sich. momentan ist er noch am Patchen, also wer weiß ob es nun geht aber ich gehe stark davon aus, dass wieder alles funktioniert.^^\nTrotzdem danke für deine Antwort :-) .\nLG DueyBoo","replies":[]}]}]},{"poster":"VanguardWarden","date":"2016-06-15T13:40:26.636+0000","up_votes":1,"down_votes":0,"body":"Also ich kann ab heute auch bei mir den client nicht starten habe das Spiel neuinstaliert und alles aber nichts geht","replies":[{"poster":"TOPKEK Momso","date":"2016-06-15T13:44:45.822+0000","up_votes":1,"down_votes":0,"body":"ja hab ich auch hat bei mir auch nix gebracht.\nvielleicht müssen wir bis zum nächsten patch warten?!\n{{item:3070}}","replies":[]}]}]}