{"poster":"Le Tourine","date":"2016-07-27T21:15:16.406+0000","title":"Que le pasa al servidor ?","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"Bueno estaba jugando bien de lo mas normal una partida. Me iba re bien todo hasta que sube el ping a 200 ms y desde ahi no bajo m&aacute;s. Se me traba todo el juego, no puedo ni hacer un combo. Porque me re cabe, consecuencia perdi 12 lp. Hay problemas con el servidor ? de Ser asi no seria correcto que el SOPORTE avisara  a la comunidad del problema que surge con su servidor ? PARA ASI EVITARNOS PERDER EL TIEMPO EN UN JUEGO O PARTIDA. QUE NO PODEMOS GANAR. YA QUE ANDA PESIMO Y HORRIBLE.","replies":[{"poster":"Carpaccio","date":"2016-07-27T21:21:26.421+0000","up_votes":1,"down_votes":0,"body":"Pues yo ando con un problema parecido,siempre juego con un Ping de 50 a 80,juego y esta asi,pero pasan 5 o 10 minutos y se elevan hasta los 280 hasta 600.","replies":[{"poster":"krispitita","date":"2016-07-27T22:00:14.326+0000","up_votes":3,"down_votes":0,"body":"Siempre juego con 70 ms, y ahora me tira 200 ms hace 5 dias. Nose cuantas veces dije esto en los foros y nadie me ayuda :,c {{summoner:3}} {{champion:17}}","replies":[{"poster":"papafrota","date":"2016-07-28T01:31:49.220+0000","up_votes":1,"down_votes":0,"body":"me pasa lo mismo desde  el jueves 21  de  julio tengo este problema","replies":[{"poster":"WeedLove","date":"2016-07-28T12:52:18.843+0000","up_votes":1,"down_votes":0,"body":"me pasa lo mismo , desde el jueves 21  comenzaron  los problemas con la inestabilidad de ms .  Antes de eso  siempre juge  con 20ms .... ,  ahora  de 60 sube a 200ms  .","replies":[]}]}]}]},{"poster":"ImProcklet","date":"2016-07-27T23:06:05.361+0000","up_votes":1,"down_votes":0,"body":"ami igual, 20 a 60 ms, a lo largo de 6 a 15 min me sube a 200 - 400 ms y no me deja hacer nada :C","replies":[{"poster":"papafrota","date":"2016-07-30T11:16:14.528+0000","up_votes":1,"down_votes":0,"body":"eso es  tu pc que esta ejecutando un programa  oculto, te recomiendo ir al firewalll y andar a confiruracion de  programas permitidos  y te va a aprecer  un listado los cuales van a tener  una  tilde, ahi fijate  y destilda a los progragas que  no uses, lo mio es constane, me pasa  ami y a mi promo que vive en la misma zona, pero solamente es  en las, xq en lan me anda bien, y mi primo juega  otros juegos que son en linea  y le anda lo mas bien, solo el lol en las  nos anda mal","replies":[]}]},{"poster":"ProFe","date":"2016-07-28T04:14:27.708+0000","up_votes":1,"down_votes":0,"body":"me acaba de pasar exactamente lo mismo recien la primer partida despues de una mini-actualizacion. a las 7pm me andaba perfecto y ahora injugable.\nISP: Telecentro 20mb argentina","replies":[]},{"poster":"papafrota","date":"2016-07-28T01:31:02.527+0000","up_votes":1,"down_votes":0,"body":"tengo el mismo problema, para ser preciso el día 20 de  julio jugué  lo mas normal  y el jueves a la noche  quise jugar  en las  y tenia 230 ms  clavados, no se me bajaban y me era  imposible  jugar , lo normal con lo que  juego era  65ms , los  fps  los sigo teniendo normal. aiuuuda","replies":[]}]}