{"poster":"zions eyebrows","date":"2015-04-09T19:59:39.155+0000","title":"It's okay to have simple champions","subforum":"Gameplay","up_votes":133,"down_votes":16,"body":"I've noticed a scary trend with recent champions and reworks (the ryze rework is what prompted me to finally say something), and it's that new champions are getting more and more needlessly complex (see: azir, gnar, bard, etc.). I'm entirely okay with that, just not when every single addition is new player-unfriendly and old champions that would be new player-friendly are meanwhile being reworked in the same way.\n\nLike... can I just get some assurance that not every new champion from here on out + reworks is going to consist of extreme attempts at trying something new to the point where there are only &lt;5 pick up and play champions in the game?\n\nPS: I don't even think the ryze rework is bad (he definitely needed one), it's the fact that Riot is moving towards unnecessary complications in champion kits as a whole; innovation is fine, just not when it applies to both new champions and champions that were previously new player-friendly.\n\nA lot of people are misinterpreting what I'm saying. I like innovation and new things being added to the game, but I'm worried the innovation is going too far since it's treading into old champion territory and not just new ones.","replies":[{"poster":"Riot Scruffy","date":"2015-04-10T01:41:30.222+0000","up_votes":55,"down_votes":2,"body":"I totally agree. Some of the best designs are the simplest. A lot of rich decision making and very complex play can come from something as simple as Singed Q. I hope that rather than try to add more mechanics we can improve our designs in the future by getting more value from less (\"elegance\" in a nutshell).  \n\nThis will be especially key on some of our historically simple mechanic champions (Taric for example). We are making it a goal to add more depth and interest to his play without over complicating the kit or increasing the mechanical floor.","replies":[{"poster":"Keevalroy","date":"2015-04-10T15:24:03.372+0000","up_votes":33,"down_votes":3,"body":"> I hope that rather than try to add more mechanics we can improve our designs in the future by getting more value from less (\"elegance\" in a nutshell).\n\nLet CertainlyT know that.","replies":[{"poster":"AMYS GRAVE","date":"2015-04-10T22:07:54.589+0000","up_votes":3,"down_votes":1,"body":"OMG have all my upvotes.","replies":[]},{"poster":"BruceTrillis","date":"2015-04-10T19:13:42.220+0000","up_votes":4,"down_votes":2,"body":"Had to log on just to upvote that","replies":[]}]},{"poster":"AMYS GRAVE","date":"2015-04-10T03:51:59.017+0000","up_votes":6,"down_votes":4,"body":"I feel like Ryze's kit has been complicated without adding any depth of gameplay and his mechanical floor has been raised (at least slightly). Perhaps i'm missing something here could you enlighten me as to the added depth?","replies":[{"poster":"The Blue Rooster","date":"2015-04-10T03:57:14.601+0000","up_votes":8,"down_votes":4,"body":"> [{quoted}](name=sixdogman,realm=NA,application-id=3ErqAdtq,discussion-id=kKVPygEO,comment-id=001f0003,timestamp=2015-04-10T03:51:59.017+0000)\n>\n> I feel like Ryze's kit has been complicated without adding any depth of gameplay and his mechanical floor has been raised (at least slightly). Perhaps i'm missing something here could you enlighten me as to the added depth?\n\nPretty much this, it really feels like all you did was raise his mechanical floor. And tried to make him more of a samey same mid-lane mage.","replies":[{"poster":"Thryale","date":"2015-04-10T04:59:23.483+0000","up_votes":5,"down_votes":3,"body":"> make him more of a samey same mid-lane mage.\n\nRiot used to have a word for that. Let's see, what was it.... Oh right, \"homogenization!\"\n\nEDIT: [rant time] And I'll be honest, with riot's recent trend for \"counter play\" and being able to \"express skill\" and stuff like that, they've really been homogenizing their champs quite a bit. Almost every new/rework they've made recently have all been given a line based skill shot nuke (veigar, ryze, bard) Not to mention the plethora of champs that already had said ability type. (zed, lux, ez, brand, karma, rengar, zix, etc)\n\nNow, I'm not trying to say line based skill shots are bad and shouldn't be used ever. But when most new champs coming out have one, and old champs are having their reliability removed and replaced with one, it's starting to stink of \"homogenizing\" the champs, ya know what I mean? I mean, what purpose does ryze's Q serve as by being a skill shot now? It literally does nothing else but dmg. What other line base skill shot in the game does nothing but dmg with no other special properties? Heck, Ryze's Q doesn't even pierce targets! At least veigar's q can pierce one target (while completely gimping my spell vamp runes and masteries I used to use on him) and even then, veig's q stacks AP on kills. Var, cait, zed, and xerath all pierce targets with theirs. Ugh, now I'm getting sidetracked... I think that's my que to shut up. :/ [/rant time]","replies":[{"poster":"mi ramfan","date":"2015-04-10T12:30:47.277+0000","up_votes":9,"down_votes":3,"body":"The thing is, skillshot nukes are just objectively better from a decisions and counterplay perspective then point and click. Take Ryze's old Q versus his new Q as an example:\n\n**Old Q**\n*Ryze thinks: I should always cast this spell if my opponent is in range for free damage.\n\n*Opponent thinks: I should never go in range so I don't get hit by Q. \n\n**New Q**\n*Ryze thinks: I should cast Q if I think there's an X% chance I can hit it.\n\n*Opponent thinks: I should move unpredictably and stay near minions to make it hard for Ryze to hit Q.\n\nCompare the amount of decisions and gameplay taking place in the first situation to the second. There's no comparison. Against a point and click spell with that low a cooldown, the optimal trading option is to just never go in range ever. Against a skillshot, you can go in range so long as you hug the minions or juke around the Q with no problem.\n\nRyze still kept his W and E point and clicks. I don't think it's really fair to say that Riot is homogenizing Ryze with his rework when his new E is a completely unique spell, his passive is completely unique, and he even kept the point and click instasnare which IMO was probably the most unhealthy aspect of his kit (becaise of how oppressive it is in lane for melees). If anything, I think people realized that **Ryze was already homogenized in the first place** and they're just now noticing it.","replies":[]}]}]}]},{"poster":"chavyy142","date":"2015-04-10T09:18:22.930+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=RiotScruffy,realm=NA,application-id=3ErqAdtq,discussion-id=kKVPygEO,comment-id=001f,timestamp=2015-04-10T01:41:30.222+0000)\n>\n> I totally agree. Some of the best designs are the simplest. A lot of rich decision making and very complex play can come from something as simple as Singed Q. I hope that rather than try to add more mechanics we can improve our designs in the future by getting more value from less (\"elegance\" in a nutshell).  \n> \n> This will be especially key on some of our historically simple mechanic champions (Taric for example). We are making it a goal to add more depth and interest to his play without over complicating the kit or increasing the mechanical floor.\n\nI love this. Someone made a thread recently about how boring singed skills are. Yet I find singed to be one of the most fun champions to play. You don't need an overloaded kit to give a champion depth. The complexity in playing singed comes from knowing your limits. Knowing when you can survive running through a team and when you can't. A good singed player has to ask himself \"can i survive the burst long enough for my team to capitalize on them chasing me?\" Or \"how can I go about baiting these guys long enough for my q to screw them over\" And these decisions are just as deep as a zed player going \"If I ult now could i kill him and get out before he bursts me?\"","replies":[]},{"poster":"gr8job","date":"2015-04-10T02:08:36.529+0000","up_votes":2,"down_votes":0,"body":"That's great to hear! That's what I was thinking during the above comparison between Ashe and Ryze. Ashe needs to decide whether it's worth the risk to send an arrow to help her teammates, and potentially miss, or save it for when she needs the stun herself. Whereas Ryze pretty much has a set ability \"rotation,\" an obvious situations under which he should and shouldn't use his ult.\n\nTaric is also quite interesting, mostly in terms of his W. He can switch between offense and defense, and I'd like to see that more in his kit. :)","replies":[]},{"poster":"Grockk","date":"2015-04-10T13:55:34.619+0000","up_votes":5,"down_votes":3,"body":"Warwick was a simple and beloved champ that the balance team nerfed into the floor this season.  That would be fine if Warwick was OP, but that wasn't the case, it was the new Devourer enchantment that synergized with his ult and started with 40 stacks.   In the same patch, Devourer was nerfed to 25 stacks AND Warwick's ult lost 100 damage AND Warwicks W duration was reduced by 40%.  This is in addition to increasing Warwick's ult cooldown earlier this season.  Before this, Warwick hasnt been picked or banned once in a championship game **since Season 1**.  Nobody considered him a competitive pick before and now he is just a joke.","replies":[{"poster":"RoyceRollin","date":"2015-04-10T15:29:48.717+0000","up_votes":3,"down_votes":1,"body":"Do you mean championship like only world championship cause sure you could say that about a lot of champs, but if you mean pro games in general then he has definitely been picked I even remember him being picked during worlds in season 3.","replies":[]},{"poster":"Dracuwulf","date":"2015-04-10T14:02:58.994+0000","up_votes":3,"down_votes":2,"body":"I agree.  Warwick exemplifies the simple champ, and Riot has shown clear bias against him.  Its sad, he was my first champ and I still love him, but what they've done to him is idiotic.","replies":[]}]},{"poster":"Xela Syab","date":"2015-04-10T04:24:58.380+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=RiotScruffy,realm=NA,application-id=3ErqAdtq,discussion-id=kKVPygEO,comment-id=001f,timestamp=2015-04-10T01:41:30.222+0000)\n>\n> I totally agree. Some of the best designs are the simplest. A lot of rich decision making and very complex play can come from something as simple as Singed Q. I hope that rather than try to add more mechanics we can improve our designs in the future by getting more value from less (\"elegance\" in a nutshell).  \n> \n> This will be especially key on some of our historically simple mechanic champions (Taric for example). We are making it a goal to add more depth and interest to his play without over complicating the kit or increasing the mechanical floor.\n\nI kinda want to chime in on this. Taric was my first support main, and honestly you guys wrecked his whole kit and tried to jam tank style mechanics into it. It was important for taric to frontline and auto alot cause he got free mana and was able to heal his carry and harass his opponent, you took that away and left his spell costs high nerfed his heal and aura and expected him to tank with weak support stats. Without a heavy engage skill like Alistar's combo Taric wont be what you want him to be. I'm just saying either give his abilities an early game mana reduction, more mana regen early game, or a way for him to get mana back. In this regard too I think you guys should remove the mana cost from Soraka's heal, it's frankly unfair to have her trade mana and health just to heal a teamate. Then again Riot really needs to fix bard, I think he's the weakest champ you guys ever had released mostly because he doesn't offer kill pressure like other roaming supports which is what he's really lacking.","replies":[]},{"poster":"Chromatic Eagle","date":"2015-04-10T02:53:12.640+0000","up_votes":3,"down_votes":1,"body":"Would you say that Ryze, and potentially other beginner champions will maintain a similar learning pattern?","replies":[]}]},{"poster":"disregardable","date":"2015-04-09T20:05:42.478+0000","up_votes":44,"down_votes":10,"body":"Honestly, Ryze is the only champion I ever thought was boring to play as. I never feel bored when I play Ashe, Yi, Annie, or any other champion players complain about, but Ryze was honestly a really lackluster champion. I can't say if this will fix that issue or not, but I'm definitely welcoming change for him.\n\nAnd honestly, all of the champions are really easy to play.","replies":[{"poster":"AMYS GRAVE","date":"2015-04-09T21:09:31.529+0000","up_votes":11,"down_votes":3,"body":"I would argue that there should be at least a few champions that feel boring to play as. As an experienced player they may feel boring, but to a new player they are not overwhelming like many other champions can be. The new player experience is pretty bad for lol and adding complexity to some of the simplest champs will only steepen the learning curve.","replies":[{"poster":"EvilRabbitt","date":"2015-04-09T22:04:12.352+0000","up_votes":3,"down_votes":4,"body":"I agree with you good sir (or madam). It's good to have simple (but clearly, once you see how the game works, weaker (though not by large margins)) champ to pick the game up with, and a complex (or more complex than your last if not outright crazy) champ to hold onto.","replies":[{"poster":"AMYS GRAVE","date":"2015-04-09T23:05:56.896+0000","up_votes":11,"down_votes":0,"body":"I would actually argue that the simple champions shouldn't be weaker than their more complex counterparts, just more reliable and steady damage dealers. that way new players have a chance to succeed against old players and it helps bridge the experience gap. As a result the champion may not feel as rewarding to play to the experienced hands, but that's not a problem to the new players because they don't have a baseline for how rewarding great play can be. As they get better they can move to higher risk/reward champions and see the difference and learn from it. \n\nAt least in theory.","replies":[{"poster":"EvilRabbitt","date":"2015-04-09T23:43:33.901+0000","up_votes":3,"down_votes":2,"body":"The problem with simple champions being steady and reliable is (like Yugioh) they start outclassing champs( or in Yugioh, decks) that require risk. If a champion is reliable, they know to not take ANY risks unless its CONFIRMED. Which is why Katarina (not op) is strong. I relate this to Yugioh because they made that mistake. And if you kept up with that game, you'd know its impossible for new players to understand- and that everything goes out of date. I don't want that to happen to League. The disparity between skilled/smart play should be known. It keeps the ladder climbing healthier imo.","replies":[{"poster":"AMYS GRAVE","date":"2015-04-10T04:04:29.457+0000","up_votes":5,"down_votes":0,"body":"Not every champion should be high risk high reward. Some do need to be stable because learning the game with a high risk high reward champion leads to some pretty frustrated players who will quit after a few bad experiences when they don't understand their mistakes. Along those same lines a champion who is weaker because they are easy to play also leads to bad experiences because they could be playing their champion perfectly fine and still get stomped by smurfs who are playing the more risky champions that they understand. \n\nCorrect me if i'm wrong but are you asserting that Katarina is a reliable champion? She is certainly high risk high reward. Either way we digress...","replies":[]}]}]}]},{"poster":"killd0zer","date":"2015-04-10T00:00:59.924+0000","up_votes":3,"down_votes":1,"body":"That's the wrong approach honestly. Designing things with the intent to be boring should get you fired. Ashe is a very simple champion. Yet she has a pretty high skill cap; low skill floor too. Using her Arrow is easy, however using it to it's fullest effect is much harder and requires more skill.\n\nChampions don't need to be boring to be easy to pick up, they just need to be intuitive. Cassiopea has a lot of inner mechanics, and optimization about her abilities. That being said, she isn't really hard to understand at the core; you land poison, and press E. She also isn't boring.","replies":[]}]},{"poster":"PaperMache7","date":"2015-04-10T04:21:10.030+0000","up_votes":2,"down_votes":1,"body":"Imma sound like an ass (or be one w/e), if all champions were \"easy\" you wouldn't in bronze 5.","replies":[{"poster":"disregardable","date":"2015-04-10T10:18:19.483+0000","up_votes":5,"down_votes":0,"body":"If that logic was sound, everyone in Bronze could get to Silver solely by playing Ashe. Not by improving their 5.5 cs/minute last hitting, warding more than twice in a game, not trying to 1v2 Jarvan+Olaf, or refusing to give up, just play Ashe because she is easy. \n\nStrange thing about that is, I play against Ashes all the time in Bronze 5. They don't automatically win lane because Ashe is easy, they don't carry for playing an easy champion, and their teams don't win the game because Ashe is easy.\n\nI'm in Bronze 5 for a lot of reasons, but playing \"hard\" champions isn't one of them.","replies":[]}]},{"poster":"KidSpectre","date":"2015-04-09T21:38:33.420+0000","up_votes":3,"down_votes":1,"body":"I don't really agree with your final statement. {{champion:268}} and {{champion:429}} are incredibly hard for me personally to play (more so Azir). And for a long time, I had trouble playing most melee champions well. That changed after I gained experience with the game, of course, but some champions are just harder for certain people to play than others.","replies":[]}]},{"poster":"KidSpectre","date":"2015-04-09T21:45:16.481+0000","up_votes":21,"down_votes":2,"body":"When I was a new player, {{champion:13}}  was the HARDEST champion for me to just pick up ({{champion:268}} was two seasons away from existing). You have to use his spells in just the right order in order to get the most out of his resets. He's simple in concept, but that doesn't really make him \"easy to use.\" \nConversely, you have a champion like {{champion:43}}. She has a ton of different effects, mostly tied to her mantra. But for me, even as a newer player, she felt intuitive, fun to use, and easy to pick up. \n\nThe point is that \"simple\" is not necessarily synonymous with \"easy.\"","replies":[{"poster":"gr8job","date":"2015-04-10T02:02:26.325+0000","up_votes":1,"down_votes":0,"body":"Personally, I struggle Ryze as well. But only because I am accustomed to skillshot champions, and he likes to have a seizure when I try smartcasting his abilities, without knowing the exact range of them.","replies":[{"poster":"MrBuffington","date":"2015-04-10T13:57:20.714+0000","up_votes":2,"down_votes":0,"body":"That's a problem I have with targeted spells too, especially when trying to combo them when I'm barely out of range. I've messed up many Annie stun procs by not landing her Q first.","replies":[]}]}]},{"poster":"AMYS GRAVE","date":"2015-04-09T21:05:03.777+0000","up_votes":10,"down_votes":3,"body":"Yeah, they are really hurting their new player experience, and it's a problem.","replies":[{"poster":"Raptamei","date":"2015-04-09T22:18:58.824+0000","up_votes":3,"down_votes":9,"body":"> [{quoted}](name=sixdogman,realm=NA,application-id=3ErqAdtq,discussion-id=kKVPygEO,comment-id=0006,timestamp=2015-04-09T21:05:03.777+0000)\n>\n> Yeah, they are really hurting their new player experience, and it's a problem.\n\nI think they have given up new players to HotS and are now just focussing on keeping their existing players.","replies":[{"poster":"AMYS GRAVE","date":"2015-04-09T23:07:44.744+0000","up_votes":5,"down_votes":0,"body":"I sincerely hope not because that will signal the decline of league. It will be slow but if they don't keep an influx of new players the game will, eventually, die.","replies":[{"poster":"kunkudunk","date":"2015-04-10T02:22:25.037+0000","up_votes":4,"down_votes":2,"body":"It won't die. The current player population is enough to keep it going for a while.","replies":[{"poster":"LeeDark","date":"2015-04-10T03:13:35.858+0000","up_votes":8,"down_votes":1,"body":"All games die if they fail to bring in new players.  It's only a question of how long before it happens.","replies":[{"poster":"Kingsgrave","date":"2015-04-10T08:28:06.019+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=LeeDark,realm=NA,application-id=3ErqAdtq,discussion-id=kKVPygEO,comment-id=00060000000000000000,timestamp=2015-04-10T03:13:35.858+0000)\n>\n> All games die if they fail to bring in new players.  It's only a question of how long before it happens.\n\nMore complex characters doesn't stop new players from joining, if anything it promotes it since this genre is popular for the complexity and the time being well spent on it due to said complexity. \n\nThe main reason people leave games is because they are too dumbed down or the community is toxic. The player experience as a new player is pretty bad, but I really doubt this game will die. Freetoplay games that are updated well almost never die.","replies":[{"poster":"LeeDark","date":"2015-04-10T09:47:36.487+0000","up_votes":5,"down_votes":0,"body":"Actually, F2P games are in greater danger of dying because of lack of new players.  While it is a very profitable business model because some number of people will spend more than they would on other games, many players like it because they spend much less.  Hell, I stopped spending money on the game completely when they announced the retcon, and before that, I spent maybe 100 bucks in a year.  That's much less than my Warcraft addiction has cost me.  F2P games need players to keep coming in a buying stuff.\n\nPeople leave games for all kinds of reasons.  Only one of those, the game being too expensive a hobby to maintain, is something League would not suffer.  Some leave because of the community, as you said, and some leave because they believe the game is getting too casual, though that one is only a very small number of idiots.  People also leave because they simply move on.  They go off to college, or graduate college and find themselves working fifty hour work weeks, or they get married or have a kid, or whatever, and they find they simply don't have time anymore.  Without having access to statistics on why people leave, I'd be willing to argue that this is the largest category.  Every year, probably every single month, even, people just stop playing the game because they have too much other stuff to do.  They'll get in a game on the weekends at first, and then that'll stop.  Then they'll come back once or twice because they kind of miss the game, but so much will have changed they don't feel like it's the same.  They don't have time to catch up, so they just let it go.  If the game fails to replace these players, it will eventually die.  But if it only loses them for that reason, the game could take a VERY long time to die.  A full generation, even.\n\nThe new player experience for this game, as it stands now, isn't just pretty bad.  It's downright awful.  It is tedious, frustrating, fraught with noob traps that you feel stupid for falling into later, and full of bots and smurfs.  If Riot fails to address these issues, eventually they will start to have a serious problem.\n\nNow, I don't think complex champion kits are driving new players away.  That is kind of ridiculous, and the simple fact is that the cheapest champions include quite a lot of easy to learn champions for new players.  Should some champions keep simple kits, though?  I think so.  There is no real reason to rework, for example, Annie the same way they are Ryze.  She already has a similar mechanic to his new passive in that she has to charge her stun, giving a window of opportunity for engaging her, but I don't think her Q should be a skillshot.","replies":[]}]}]}]},{"poster":"Raptamei","date":"2015-04-10T06:11:09.226+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=sixdogman,realm=NA,application-id=3ErqAdtq,discussion-id=kKVPygEO,comment-id=000600000000,timestamp=2015-04-09T23:07:44.744+0000)\n>\n> I sincerely hope not because that will signal the decline of league. It will be slow but if they don't keep an influx of new players the game will, eventually, die.\n\nYep.\n\nThat's what happens if you don't evolve in a meaningful way in 5 years. Competitors come and beat you. \n\nHotS has everything right now, the new player experience, the multiple maps, the constant action, the build variety, the lack of selfish play, they correctly analysed the flaws with the genre while Riot spent two years wrangling with stealth, considers recolours hard to make and can't be bothered with Twisted Treeline. \n\nRiot can still win, but they need to develop a LoL2 to do so. League is outdated.","replies":[]}]}]}]},{"poster":"mi ramfan","date":"2015-04-09T23:09:58.764+0000","up_votes":8,"down_votes":2,"body":"I'm confused as to what you want here.\n\nYou say you want not every new champion to consist of an \"extreme attempt to try something new\". The reality is that every \"simple\" niche in the game is completely filled at this point with multiple competing champions, so the only way for Riot to bring something new to the game (which is what new champion releases are supposed to do anyways tbh) is to make complicated champions. It's not anything to do with Riot not liking simple champions; there simply isn't anything new a simple champion can bring to the game anymore.\n\nCompounding this, of course, is the simple fact that Riot needs to make money. Most \"simple\" champions that are trumpeted as examples of the best kits of the \"good old days\" are boring as shit. See Taric, Ryze, Garen, and old Raka for examples of what I'm talking about. Very, *very* few players will pick Taric when he's not overpowered because he's simply no fun to play because of the lack of interesting gameplay.\n\nThat's not to say that simple champions can't be fun, because they can be. Take Ezreal, for example. Every spell in his kit is easy to grasp, so he's \"simple\", but he also creates fun gameplay through his skillshots. For another example, consider Ahri. Her kit is another very simple kit where each ability has an easily grasped effect and purpose, yet she possesses a surprising amount of depth. \n\nThe easy champions that are being reworked are invariably the ones that have play patterns that, although easy to learn, have no variety or interesting gameplay at all. Consider Ryze, for example. In the laning phase, his gameplan is to farm with tear/catalyst/shroud rush for infinite sustain and his snare to cockblock any attempt to actually kill him. In teamfights, he rolls his face on the keyboard while being incredibly bulky. It shouldn't take much to see that there's very little actually going on in his kit-no decisions or gameplay that other champions don't also offer while offering their own unique decisions. \n\nOn top of this, simple champions with straightforward, no nonsense kits are often very difficult to balance properly, as well. Consider Ryze again-he will build the same items in the same order almost regardless of his lane opponent. After his first back, he will harass the hell out of any melee laner with his low cooldown Q. If the melee ever blows their gapcloser to approach, snare, step back, and cast more Qs. Because there are no subjective decisions or even aiming for Ryze to do that other champions don't have to do more of, Ryze's laning phase is always either oppressive or terrible depending on his early base damages. If Q/E deal too much damage, it's impossible to lane against him as a melee; if they deal too little, Ryze is useless. There's no in between, either he harasses you to death or he deals more damage to your fingers than the enemy. \n\nWith complex champions like Gnar, Bard, Kallista, etc, there are definitely more difficult mechanics for new players to grasp. However, they also have many more levers by which they can be balanced. There are a thousand things they can toy around with on Kalista if she proves to be too strong. With Ryze, it's just his damage values, mana costs, and CDs. \n\nSo before I add more on to this incredibly long post, I'd like to hear more from you. What benefits do you see from creating more simple champions when there are already plenty of easily grasped champions for new players? What is so engaging about the gameplay of brainless champions like Ryze and Garen that makes them worth protecting instead of reworking them into a form that asks the player to make decisions? And where do you draw the line between \"simple\" and complex champions?","replies":[]},{"poster":"Solidair3","date":"2015-04-09T23:08:30.863+0000","up_votes":6,"down_votes":1,"body":"I see you say \"unnecessary complications\" but Ryze NOT having a skillshot and being all targeted abilities meant he could never be strong. Because when he's strong, there's no fighting back. And when he's not strong, he might as well be useless, because all he can do is hold you in place for a second... and maybe soak up some damage. But NOW, with these \"complications\" he is more interactive, more fun, and has more options.\n\nBesides, the only way he's \"harder\" to use now is you have to manage his passive, which probably won't be that bad, and you have to use a skillshot, which isn't even a straight nerf, thanks to its increased range and general functionality.\n\nThese complications allow a champion to be situationally strong and weak, instead of always overbearing or always weak.","replies":[]},{"poster":"Jungle Lux God","date":"2015-04-10T00:28:40.350+0000","up_votes":5,"down_votes":1,"body":"It's fine to have champions that are more simple, but there is a point where \"simple\" becomes \"mash your face on the keyboard\". At his base, Ryze was too simple that even players who play him for the first time aren't going to have too much fun. In addition, Ryze wasn't that simple on a macro level, as his build options were so restricted that you could not create a proper build without deeper game knowledge of the exact build you needed.\n\nIn regards to Ryze now, he's still fairly simple. Q is now a simple skillshot. W is still a targetted ability. E still has some complex mechanics, but the double-bouncing effect really isn't that much more complex than random bouncing, and seems a lot more satisfying than the random bounces. And finally, the R is the same.\n\nThe passive seems a lot more complex, but the algorithm for using it is fairly simple:\n\n1. cast spells\n2. upon x spell casts, you get super strong\n\nThere isn't too much to really understand about the passive at a basic level. Ryze is still fairly simple, as his core mechanics really haven't changed too much. However, at a higher level Ryze has truly been changed, and in terms of gameplay for the better. His kit is now so much deeper: for the Ryze player, there is now really interesting gameplay surrounding his new skillshot and the behavior of his E, and with managing his passive's uptime and activation, while his opponents now have super interesting options to play against him between abusing the downtime of his passive, dodging his Q skillshot, and positioning to mitigate damage from his E.","replies":[]},{"poster":"GreenLore","date":"2015-04-09T20:15:22.234+0000","up_votes":4,"down_votes":8,"body":"The thing is that ryze simply offered no counterplay.\n\nHe was/is a point and click champ which sounds nice and easy on paper,but the problem comes if you have to play against him,in which case he simply felt unfair since there was no way to avoid his attacks.\n\nSo while some champs become harder to play thats more because it became easier to do something against champs who simply lacked some necessary drawbacks.","replies":[{"poster":"Rebonack","date":"2015-04-09T21:49:33.536+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=GreenLore,realm=EUW,application-id=3ErqAdtq,discussion-id=kKVPygEO,comment-id=0003,timestamp=2015-04-09T20:15:22.234+0000)\n>\n> The thing is that ryze simply offered no counterplay.\n\nIf Ryze was feeling unfair, then you got counter-picked.  That, or you counter-picked yourself.  One of the prices we pay in having such a diverse group of champions to pick from is that some of them are going to shut down other champions.  Sometimes really, really hard.  There's nothing wrong with a ranged, targeted champion.  They typically pay for their reliable damage with lower range than their skillshot buddies.\n\nDo note, that when Riot dinged Ryze's range a little bit he suddenly dropped off the face of the earth.  Previously his area of control was too large for how much of a threat he was.  Then it was too low.  This is something that could *easily* be addressed by tweaking numbers instead of removing the major source of depth from his kit (combo orders).\n\nProblem is, Riot decided to treat Ryze as a game-design issue rather than a balance issue like they should have.","replies":[{"poster":"GreenLore","date":"2015-04-09T22:36:42.138+0000","up_votes":3,"down_votes":0,"body":"You know not everyone plays ranked,so counterpicking isn't always an option.\n\nAnd the problem with ryze is that he can be hard to balance because either he is going to deal good damage your enemy can't avoid or you don't.","replies":[]}]}]},{"poster":"Cpt Pants","date":"2015-04-09T21:43:51.706+0000","up_votes":6,"down_votes":3,"body":"I get your frustration, I had this conversation with a few friends...\nYet they never seem to stand up to the challenge - Make a simple champion - go.\n\nIn today's game, with over 120 champions, making something that is really unique, yet utilizes the same basis of the game: Auto attack, Skillshot, AoE, DoT, etc... There is no real way to keep it simple anymore and having it unique.\n\nJust look at your last simple champion released (fairly simple) - Aatrox.\nDoes he bring anything really unique to pick him over any other champion? Something that you never saw before and you have to have? Simple answer - no. He's a point and click delay AoE knockup binded with mobility, auto attack enhancement, skillshot slow and steroid ultimate. None of which is a reason to take him over any other initiatior / fighter. He does nothing better than any other champion (maybe sustain, but that sustain becomes completely useless mid-late game).\n\nNow look at Bard, is he simple? Hell no. Is he completely unique and you know why you would want him and not say Janna? Absofreakinglutely.\n\nTL;DR: Simple is not unique anymore with 120+ champs. What you call \"overloaded\" is actually there to make it unique.","replies":[{"poster":"WhiteGuyWannaBe","date":"2015-04-09T22:01:15.659+0000","up_votes":3,"down_votes":0,"body":"As far as I am concerned Bard is designed specifically for higher skilled players.  A different fairly recent release which is relatively complex but still very straightforward and easy to play would, imo, be Braum.","replies":[]}]},{"poster":"Matt The Hero","date":"2015-04-09T20:06:52.673+0000","up_votes":5,"down_votes":2,"body":"Needlessly complex? I disagree. Out of the champs you mentioned, the only one who is at all complex is Azir, and even then, Riot did a fantastic job at balancing micromanagement (which Riot, and most people, hate) and active play.\n\nRyze's changes make him more engaging and fun to play as _and_ against. It's a win-win. Some champs need to be a bit less brain dead.","replies":[]},{"poster":"Chenh1","date":"2015-04-10T22:31:24.256+0000","up_votes":2,"down_votes":0,"body":"{{champion:86}} \"too easy to play so he's not allowed to be strong\"","replies":[]},{"poster":"Spacesuit Spiff","date":"2015-04-10T21:07:40.753+0000","up_votes":2,"down_votes":0,"body":"You're correct in principle, but I'm not sure what your issue is with Ryze. His passive isn't overcomplicated, it just creates clear windows to fight in. The Q change is fine (although I dislike the fact that now he'll be spamming it on the way back to lane to charge his Tear, I always found that boring and I was glad they made a Tear champ with no skillshots.\n\nAlso, new players can just pick up a random champ, mash their faces on the keyboard, and in most cases do alright. It's not like they need to play the champion properly when they're that new. Take Braum for example; they'll probably never use the jump and not get much out of the shield, but as long as they try to Q and AA they'll at least be kinda useful and have some fun. Same as how new players will pick up Annie and completely ignore her passive at first, because a stun doesn't mean much in your first few games.","replies":[]},{"poster":"FreshMeat707","date":"2015-04-10T00:42:43.044+0000","up_votes":2,"down_votes":1,"body":"New champs in a nutshell:\n\nLV 1 summoner: \"Uh, what does Kalista's ult do? I can't use it....\"\n\nToxic player: \"OMG U FUKIN NUB YOU HAVE TO SOULBOUND YOUR LANE PARTNER YOU FRIKKIN MORON\"","replies":[{"poster":"Raptamei","date":"2015-04-10T09:20:31.702+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=FreshMeat707,realm=NA,application-id=3ErqAdtq,discussion-id=kKVPygEO,comment-id=001a,timestamp=2015-04-10T00:42:43.044+0000)\n>\n> New champs in a nutshell:\n> \n> LV 1 summoner: \"Uh, what does Kalista's ult do? I can't use it....\"\n> \n> Toxic player: \"OMG U FUKIN NUB YOU HAVE TO SOULBOUND YOUR LANE PARTNER YOU FRIKKIN MORON\"\n\nLvl 1: ah ok -uses black spear on toxic player in the middle of a teamfight-","replies":[]}]},{"poster":"Narasimha","date":"2015-04-09T22:58:57.100+0000","up_votes":2,"down_votes":0,"body":"While simple is nice, it becomes an issue when simple is strong. Ryze is a perfect example. In his prime, he was strong, and he dominated top lane for it. When knocked down a few numbers, he became a nonentity. Its hard to find the middle ground when there are fewer things to tune.","replies":[]}]}