{"poster":"JHINIGAMl","date":"2017-07-19T23:28:26.262+0000","title":"Constantly lagging out / FPS cutting out","subforum":"[ARCHIVED] Help & Support","up_votes":7,"down_votes":0,"body":"For the past 2 days, my games have been constantly dropping FPS/ skipping out or freezing mostly during frames where these are particles flying, including autoattacks. This makes it awful to play the game especially during the more chaotic moments. My actual ingame FPS and Ping is still constant with the ping being 38-40 and FPS being 60-70, which has not been an issue since I upgraded my system 5 years ago. Also i've tried to get some footage but apparently the game recording does not have the same issues and have smooth gameplay. I have not changed anything on my PC for like a month.","replies":[{"poster":"Horse Grenades","date":"2017-07-20T21:17:41.959+0000","up_votes":1,"down_votes":0,"body":"Yes! Me too! Looks like packet loss","replies":[]},{"poster":"Nippledix","date":"2017-07-20T17:03:34.121+0000","up_votes":1,"down_votes":0,"body":"I have the same issue and so do all of the people posting on this reddit thread : https://www.reddit.com/r/leagueoflegends/comments/6oevlj/massive_performance_issues_since_patch_75/ \n\nI really wish riot would just acknowledge that this is in fact an issue and stop implying that everyone's computers suddenly all have an issue.","replies":[]},{"poster":"Porocles","date":"2017-07-20T15:54:53.574+0000","up_votes":1,"down_votes":0,"body":"It's definitely startling to suddenly come upon these issues, and I'd like to help.  To start off, try the steps in our [FPS issues](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting) guide to help tune up potential causes like bad game files, drivers, or even updates.  \n\nIt doesn't sound like this might be due to a connection problem or lag, but run a [log reader](https://support.riotgames.com/hc/en-us/articles/209765743-Connection-Troubleshooting-Log-Reader) as well just in case to be absolutely sure.\n\nLet me know what you find!","replies":[]},{"poster":"DoYouWantAHug","date":"2017-07-20T07:35:59.373+0000","up_votes":1,"down_votes":0,"body":"Did you recently update Windows?  Because I have been having issues since I updated sounds quite similar to what you are having issues with.","replies":[{"poster":"JHINIGAMl","date":"2017-07-20T11:56:23.258+0000","up_votes":1,"down_votes":0,"body":"Nope, I haven't updated anything recently. Last time anything updated was a week ago","replies":[]},{"poster":"Rald123","date":"2017-07-20T07:43:43.121+0000","up_votes":1,"down_votes":0,"body":"I've been having the same issue and I recently updated my Windows as well. I wonder what it is...","replies":[]}]}]}