{"poster":"DarkFrost11","date":"2016-12-24T06:39:25.046+0000","title":"Veigar Guia y Consejos","subforum":"Guias y consejos","up_votes":2,"down_votes":1,"body":"{{champion:45}}Tiemblen Ante Mi Presencia{{champion:45}} \n1. Hechizos de invocador :3.\n{{summoner:12}} {{summoner:4}} o Tambien {{summoner:14}} {{summoner:4}}  Todo lo puedes modificar a tu gusto estos son solos consejos. \n2. Combo: (E+W+Q) Se utilizar&iacute;a R si sobrevive. Para matar a un Tanque tendr&aacute; que tener la vida cerca de la mitad y le aplicamos el combo ya que tienen mucha vida o resistencia m&aacute;gica. Aveces usan la R cuando no ha ca&iacute;do el meteorito (W) y es mala idea porque podr&iacute;a sobrevivir porque nuestra heroica hace da&ntilde;o completo si tienen 30% y hay que asegurar que as&iacute; tengan la vida al usar la heroica (R).) \n3. Nota: Hay que tener en cuenta que Veigar es muy fr&aacute;gil y se nos puede complicar con: Katarina, Zed, Talon. etc... Debemos mantenermos bajo torre y aprovechar para realizar nuestros combos.. Ten en cuenta que personajes como Katarina o Zed pueden teletransportarse y salir del encierro de tu stun (E) y te podr&iacute;an asesinar, aseg&uacute;rate que caigan de una en el stun.\n4. Compras: Las compras son las que yo utilizo son con las cuales llego hasta 1000 poder de habilidad y donde tambi&eacute;n me centro en el mana, pero son libres de modificar. Es recomendable tambi&eacute;n quitar las botas por otro &iacute;tem de poder de habilidad ya que tu stun puede darte beneficios en escaparte.\n{{item:3165}}{{item:3020}} {{item:3285}} {{item:3089}} {{item:3027}} {{item:3003}} o {{item:3165}} {{item:3001}} {{item:3089}} {{item:3027}} {{item:3285}} {{item:3157}} Si quieres tener mas poder de habilidad.\n5. Conclusion: Veigar puede ser un magnifico mago cuando llega a 1000 poder de habilidad el que caiga en tu stun ya estar&aacute; muerto. Podr&aacute;s ser el principal focus de los enemigos mantente detras de tus aliados y colabora desde a distancia ya que Veigar hace un buen trabajo en equipo. Veigar es muy bueno en un 1vs1 si cae en tu stun por que si no estar&aacute;s frito. Puedes salvar vidas a tus aliados si lo siguen encierra a los enemigos para que lo dejen de seguir\n6. Orden de habilidades: Sugeridas\nQ= 1, 4, 5, 7, 10\nW=3, 8, 12, 14, 17\nE=2, 9, 13, 15, 18\nR=6 ,11, 16\n    Eso fueron todo mis consejos espero que por lo menos uno les haya servido y gracias..(Construccion)\n\t ","replies":[{"poster":"faster51","date":"2016-12-24T16:22:41.875+0000","up_votes":2,"down_votes":0,"body":"no,esa build no, sinó está:{{item:3089}} {{item:3089}} {{item:3089}} {{item:3089}}{{item:3089}} {{item:3089}}","replies":[{"poster":"DarkFrost11","date":"2016-12-27T03:39:22.712+0000","up_votes":1,"down_votes":0,"body":"haha{{sticker:slayer-jinx-wink}}","replies":[{"poster":"faster51","date":"2016-12-27T14:55:54.179+0000","up_votes":1,"down_votes":0,"body":"y la de {{champion:13}} :{{item:3048}} {{item:3048}} {{item:3048}} {{item:3048}} {{item:3048}} {{item:3048}}","replies":[{"poster":"DarkFrost11","date":"2016-12-27T20:23:20.965+0000","up_votes":1,"down_votes":0,"body":":v\n\n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"faster51","date":"2016-12-27T20:24:53.274+0000","up_votes":1,"down_votes":0,"body":"ryze es como wtf, ya que sus habilidades escalan mana .__.","replies":[]}]}]}]}]},{"poster":"Høneythief","date":"2016-12-24T08:38:50.781+0000","up_votes":1,"down_votes":0,"body":"Mi build es exactamente igual a la que tú recomiendas excepto por un item que me parece vital, y sinceramente es la mejor que puede tener Veigar actualmente en mi opinión, me parece que te faltó poner el orden de compra de los items, en mi caso sería:\n1) {{item:1056}} y {{item:2003}} x2\n2) {{item:3070}} y {{item:1001}}  \n3) {{item:3165}} y {{item:3020}} \n4) {{item:3003}} \n5) En este punto, yo compro {{item:3135}}  {{item:3157}}  {{item:3089}}  dependiendo de como vaya la partida, el sombrero si es que todos vamos destrozando nuestras líneas (y no se han rendido los rivales...), el báculo lo compro cuando veo que se va regular el juego y se están buildeando defensa especial. Mientras que el zhonya puede incluso comprarse luego de las botas por si nos enfrentamos a un AD que explote campeones, en cualquier caso, no siempre se puede seguir este orden, siempre hay que estar atento al ritmo de la partida y los campeones rivales y de nuestro equipo, porque armarse lo mismo siempre puede costarte la línea y la partida. Los campeones contra los que Veigar suele sufrir son los que de una u otra forma escapen de su E, si por algún motivo se falla la E, el cual es la principal arma mortífera de Veigar, nuestro pequeño mago se convertirá en carne fresca (a menos que podamos tirar nuestro combo tan rápido que matemos al rival antes que él a nosotros), por lo que escapar de una posible pelea si se falla la E es casi obligatorio, recordando que si estamos en persecución, es bueno ir tirando la W y Q si tenemos cierta distancia con nuestro rival y sabemos que no nos alcanzará, si le quitamos la suficiente vida tarde o temprano sabrá que somos más peligrosos que seguir a un Singed... (realmente Singed es más molesto). \n\nEn fin, lamentablemente voy V2D5 en las 10 primeras rankeds... no pude tener la oportunidad de usar a Veigar hasta ahora por A o B motivos, pero siempre que puedan y hayan baneado cosas que jodan a Veigar (LB - Zed - Katarina) usarlo es muy recomendable y si se usa correctamente, no dudes en que harás un GGWP20 ;) \n\nNo soy Diamante I ni el mejor Veigar del mundo, esto es solo mi experiencia personal, si te ayuda... ¡genial! y si no, estoy seguro de que a alguien sí, si yo estoy mal en algo o estoy diciendo algo incoherente, refutarmelo por favor, que mejorar siempre es bueno y más si te ayuda alguien que sabe más. \n\nMi build: {{item:3048}} {{item:3020}} {{item:3165}} {{item:3157}} {{item:3135}} {{item:3089}} \n\nOh, y el orden de las habilidades es subir primero la Q al máximo, seguidamente la E (aumentar el tiempo de stun es primordial en mi opinión) y finalmente la W, la R cuando se pueda subir evidentemente. \n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"DarkFrost11","date":"2016-12-27T03:49:37.404+0000","up_votes":1,"down_votes":0,"body":"Gracias por el consejo, aveces uso esa build y tambien me va mucho mejor y el orden de habilidades lo uso como en mi guia por que me gusta tener igualado el W con el de la E... xD {{sticker:slayer-pantheon-thumbs}} me tarde en responder para visitar a mi mama xD que solo la veo los fines de semana","replies":[]}]},{"poster":"rokushoger","date":"2016-12-26T11:02:42.513+0000","up_votes":1,"down_votes":0,"body":"A mi criterio si el team rival tiene algún tanque resistente a magia es imperativo hacer el {{item:3135}} dado que sino aunque tengas un ap bestial no le vas a hacer ni cosquillas.","replies":[]},{"poster":"DarkFrost11","date":"2016-12-24T06:41:49.067+0000","up_votes":1,"down_votes":0,"body":"Dejen los Consejos acá en los comentarios y díganme si les sirvió\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}