{"poster":"trash sion","date":"2016-02-09T16:20:03.377+0000","title":"RIOT: Let's talk about Udyr.","subforum":"Gameplay","up_votes":85,"down_votes":16,"body":"It&#039;s pretty common knowledge now that Udyr has an extremely high winrate. Now, I know that a high winrate does not exactly mean that the CHAMPION is OP, but I&#039;ll get into that.\r\n\r\nWhen a champion has a 58% winrate, I think we can agree that something is wrong. That much is certain. However, there have been no stat changes (correct me if I&#039;m wrong) to Udyr himself in the past few patches, and yet his winrate has been on the rise.\r\n\r\nThe cause for this is unknown, but here are my observations.\r\n\r\nHis playrate has been going up. Perhaps Udyr has always been OP, but his winrate was bogged down by T2g fanboys and the &quot;eh, let&#039;s do an Udyr game&quot; type of players. I may be biased because he&#039;s my main, but it does seem that he&#039;s been quite powerful for a while.\r\n\r\nThe conclusion most people have come to, however, is an itemization change. It&#039;s highly likely that the cheap movement speed from Runic Echoes opened up an MS-centric build path that wasn&#039;t exactly viable before. A high base MS mitigates what seems to be Udyr&#039;s biggest weakness: being kited.\r\n\r\nI&#039;d have to say the latter is more likely based simply upon the winrate spike that occurred when RE was released. \r\n\r\nThe next step is to find a way to nerf Udyr in a way that brings down his winrate safely.\r\n\r\nThe first train of thought by most is to nerf Udyr directly. Nerf his R scaling, nerf his R base damage, nerf his base MS, nerf his W shield, nerf his E MS, etc. This all sounds great, until you realize that the RE build is currently his best-case scenario. If we nerf his abilities that synergize with both RE and his other build paths, it will bring the RE build to a normal winrate but cause his other builds to plumment in winrate. This destroys the diversity of his kit and build options and should be a last resort, at least in my opinion. I&#039;d hate to see Tiger Udyr ruined because some cheesy AP item made Udyr run kinda fast early on. Lol.\r\n\r\nA few days ago, in a different thread, I proposed lowering the MS on RE from 10% to 6%, to make it exactly 60% as effective as Luden&#039;s statwise. This seems like a decent option, mostly because the MS part of the stats really only synergizes with Udyr. It&#039;s more of a &quot;bonus&quot; on most others. This is somewhat of a viable way we could go about nerfing what is making him so oppressive, his ability to stick to a champion. Swifties and Deadman&#039;s are both getting price increases and Deadman&#039;s is getting a slow decrease, so all of this combined could be exactly what is needed to bring Udyr down to normal levels.\r\n\r\nHowever, someone in another thread had a great idea to nerf Udyr that I honestly think could be the solution. \r\n\r\nNo stat changes to RE, just a simple usagr change. Make the 10% MS be out-of-combat MS. Udyr likes RE purely because it lets him turn into Sanic. His AP ratios suck, so Devourer and Cinderhulk are much better on Phoenix Udyr than RE statwise. Every other user of RE (again correct me if I&#039;m wrong) doesn&#039;t really NEED this bonus MS in-combat, and since Udyr is abusing it in-combat, this could easily be all that is needed to combat his winrate (along with the aforementioned item nerfs on PBE).\r\n\r\nLet me know what you think below (:","replies":[{"poster":"Riot Sotere","date":"2016-02-09T17:12:46.054+0000","up_votes":82,"down_votes":5,"body":"Thanks for the analysis. I'll pass it forward to the developer working on Udyr. :)","replies":[{"poster":"blfUvZ8Ybu","date":"2016-02-09T18:04:59.649+0000","up_votes":6,"down_votes":81,"body":"> [{quoted}](name=Riot Sotere,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=0000,timestamp=2016-02-09T17:12:46.054+0000)\n>\n> Thanks for the analysis. I'll pass it forward to the developer working on Udyr. :)\n\nİgnoring Lux titles.Nice Riot balance team.","replies":[{"poster":"Elewd","date":"2016-02-09T18:09:16.353+0000","up_votes":31,"down_votes":0,"body":"they probably DO look at the lux threads, they just dont have as much thought put into them so the rioter felt like letting the thread poster know this info will get passed along and it was a good post.","replies":[{"poster":"blfUvZ8Ybu","date":"2016-02-09T18:10:02.871+0000","up_votes":3,"down_votes":32,"body":"> [{quoted}](name=Elewd,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=000000000000,timestamp=2016-02-09T18:09:16.353+0000)\n>\n> they probably DO look at the lux threads, they just dont have as much thought put into them so the rioter felt like letting the thread poster know this info will get passed along and it was a good post.\n\nWhy no information? People want learning about champion balance.","replies":[{"poster":"Elewd","date":"2016-02-09T18:13:36.024+0000","up_votes":29,"down_votes":1,"body":"Because a well written post is more likely to get a response compared to \"lux is broken riot needs to do x to nerf her\" this thread explained why they think udyr shot up in winrate.","replies":[{"poster":"Gypsyleeboy","date":"2016-02-09T20:29:12.475+0000","up_votes":1,"down_votes":19,"body":"That shouldn't get more attention than actual champion that need to be nerfed. I agree lux shouldn't be nerfed since her previous nerfs balanced her, but also I udyr shouldn't be nerfed either, he's already hard to play early game, and most none pro games are harder to take him to late game were he catches up.","replies":[{"poster":"Elewd","date":"2016-02-09T20:50:44.364+0000","up_votes":18,"down_votes":0,"body":"Udyr has a ridiculous winrate, and he's super safe in his first clear, saying he's difficult to play is not a good argument if the winrate is almost at 60%.","replies":[{"poster":"Crossette","date":"2016-02-09T21:56:02.276+0000","up_votes":3,"down_votes":10,"body":"He literally just presses QWER and clicks people.\n\nHe's like Garen with more speed, a bit less damage, no ult, equal tankiness and more CC.\n:^)","replies":[{"poster":"My Name Dave","date":"2016-02-10T03:42:48.567+0000","up_votes":3,"down_votes":2,"body":"can everyone stop bashing on Garen? just cause he doesn't have some stupid mini game doesn't mean his gameplay is mindless.","replies":[{"poster":"Crossette","date":"2016-02-10T03:56:47.304+0000","up_votes":6,"down_votes":1,"body":"What takes a brain in Garen's gameplay?","replies":[]}]},{"poster":"Du Ma Mi","date":"2016-02-10T01:07:31.399+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=CataclysmG,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=00000000000000000000000100000000,timestamp=2016-02-09T21:56:02.276+0000)\n>\n> He literally just presses QWER and clicks people.\n\n\nIsn't that what every champion does?","replies":[{"poster":"Crossette","date":"2016-02-10T01:10:02.713+0000","up_votes":2,"down_votes":7,"body":"Not everyone is a skillshotless tank with insane movement speed.","replies":[{"poster":"HighH1","date":"2016-02-10T01:30:51.339+0000","up_votes":4,"down_votes":0,"body":"No but the point is every champion presses their skills and clicks people.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Ayame Isaki","date":"2016-02-10T02:09:19.648+0000","up_votes":2,"down_votes":3,"body":"If you nerf the MS of Runic Echo, can you possibly (partially) revert the Elise MS nerf that was brought on by the introduction of RE?","replies":[{"poster":"Riot Sotere","date":"2016-02-10T02:55:33.725+0000","up_votes":11,"down_votes":0,"body":"If she's struggling I think that'd be a fair place to give her back power. I don't think she will struggle even with Runic nerfs. Could be wrong there, though.","replies":[{"poster":"LankPants","date":"2016-02-10T03:02:07.458+0000","up_votes":8,"down_votes":3,"body":"How about Sej, who's been struggling since tank itemisation has been nerfed. Can we ever expect to see anything done for her, or are we just giving her more time \"out of the spotlight\".","replies":[{"poster":"Kieferr","date":"2016-02-11T05:03:59.849+0000","up_votes":2,"down_votes":2,"body":"And if you look to the left ladies and gentlemen, you will see another brainwashed scrub who still thinks Sejuani is weak just because she doesn't have a 60% winrate and pickrate. \nMan you wanna talk about struggling? Look at fuckin Urgot and Kha'zix. Look at Gragas and 6.2 Rengar. That's what it looks like to struggle. Do some research before you make such a stupid claim. I'm having a blast playing Sej right now and I'm fucking glad she's not meta because noone will notice how strong she is.","replies":[{"poster":"LankPants","date":"2016-02-11T05:53:12.369+0000","up_votes":2,"down_votes":0,"body":">Do some research before you make such a stupid claim\n\nHow about you do some research before you come in waving your overinflated E-peen around like the moron you are. Right now Sej has a [negative win rate at gold+.](http://www.leagueofgraphs.com/champions/stats/sejuani) This is also considering her incredibly low 3.3% playrate meaning that she's only being played by Sej mains.\n\nThis gets far worse as you move up in ranks. [At Diamond+](http://www.leagueofgraphs.com/champions/stats/sejuani/diamond) Sej's winrate drops to 47.7% with a playrate bellow 2%.\n\n[Amumu](http://www.leagueofgraphs.com/champions/stats/amumu) is a balanced tank and his pickrate and winrate are both significantly higher.\n\n>Look at fuckin Urgot\n\n[Buffed on PBE](http://www.surrenderat20.net/2016/02/210-pbe-update.html)\n\n>Kha'zix. \n\n[Just got a new item](http://www.surrenderat20.net/2016/02/patch-63-notes.html) and [buffed in 6.2](http://www.surrenderat20.net/2016/01/patch-62-notes.html)\n\n>Look at Gragas and 6.2 Rengar.\n\n[Buffed last patch](http://www.surrenderat20.net/2016/02/patch-63-notes.html)\n\nAll of these champs have received or are receiving attention from Riot. Unlike with these champs [Riot has admitted to intentionally leaving Sejuani weak.](http://boards.na.leagueoflegends.com/en/c/miscellaneous/vWEoZ6X0-balance-team-qa-ask-us-anything?comment=00440000) This is actually what I was quoting in my first post, and I actually find this statement to be quite disturbing.\n\nIn short I have done research on this. I'm not the one who's coming in and waving around their own personal opinion as if it were a fact, that would be you.","replies":[]}]}]}]}]},{"poster":"Dr Birdie","date":"2016-02-10T16:18:46.257+0000","up_votes":2,"down_votes":0,"body":"I was actually thinking of hitting RE in a different way, because the MS is still quite attractive on some full AP's such as Fiddle.\n\nHere is my suggestion: 4% MS base and %MS scaling with AP (something like 1% MS per 50-100 AP)\n\nThis would not only hit Udyr since RE is the only AP he is building, but it would also keep Fiddle from being overly oppressive as soon as he hits level 6, but keep him doing well in the mid to late game.\n\nHope you see this Sotere. <3","replies":[]}]},{"poster":"Rebonack","date":"2016-02-09T17:23:46.214+0000","up_votes":42,"down_votes":4,"body":"Replace the AP ratios on Udyr's Phoenix with bonus AD ratios.\n\nReplace the AP ratio on his Turtle with total AD ratios.\n\nUdyr can now feel really great building Juggernaut items.  AP Udyr is ruined forever and no misses it.","replies":[{"poster":"Skarnye West","date":"2016-02-09T20:23:16.229+0000","up_votes":37,"down_votes":2,"body":"> [{quoted}](name=Rebonack,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=0003,timestamp=2016-02-09T17:23:46.214+0000)\n>\n> Replace the AP ratios on Udyr's Phoenix with bonus AD ratios.\n> \n> Replace the AP ratio on his Turtle with total AD ratios.\n> \n> Udyr can now feel really great building Juggernaut items.  AP Udyr is ruined forever and no misses it.\n\n...I do love juggernauts...","replies":[{"poster":"Malicious Metal","date":"2016-02-09T20:25:36.092+0000","up_votes":18,"down_votes":0,"body":"Who doesn't?^^\n...\n\nAh right, those poor souls who got into Melee range.","replies":[{"poster":"Sire Hippington","date":"2016-02-09T22:47:33.748+0000","up_votes":4,"down_votes":0,"body":"well, those poor souls are lost anyway, trying to get melee vs adc+peel is just as absurd as trying to melee down a juggernaut","replies":[]}]},{"poster":"Crossette","date":"2016-02-09T21:57:25.950+0000","up_votes":4,"down_votes":3,"body":"no.\n\ngo away.\n\ndon't give him more ad ratios.\n\n:^)","replies":[]}]},{"poster":"DeathBurst","date":"2016-02-09T18:24:57.893+0000","up_votes":10,"down_votes":6,"body":"> [{quoted}](name=Rebonack,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=0003,timestamp=2016-02-09T17:23:46.214+0000)\n>\n> AP Udyr is ruined forever and no misses it.\n\nThat's where you're wrong. Too few champs have multiple build paths viable, and they should be preserved. Not at all costs, mind you, but if it's possible without too much collateral damage, it should be done.","replies":[{"poster":"Spaceman5pff","date":"2016-02-09T19:22:33.499+0000","up_votes":13,"down_votes":0,"body":"Collateral Damage?\nINB4 PBE gets 90% Ap Ratio on graves Q and R","replies":[]},{"poster":"The Bearded Bard","date":"2016-02-09T20:38:26.283+0000","up_votes":5,"down_votes":1,"body":"He'll still have multiple build paths. Full tank udyr, juggernaut udyr, glass cannon udyr, devourer udyr. \n\nAP just won't be one of those build paths.","replies":[]}]},{"poster":"XIII Vanitas","date":"2016-02-09T21:48:58.166+0000","up_votes":3,"down_votes":1,"body":"Udyr isn't a juggernaut, tho. And players love to have the possibility to choose between going AP-Phoenix and AD-Tiger.","replies":[]}]},{"poster":"XIII Vanitas","date":"2016-02-09T19:24:09.568+0000","up_votes":2,"down_votes":3,"body":"I'm more inclined to lower RE's MS to 6% (and revert Elise's nerf that lowered her MS) and, if Udyr is still too powerful, lower his bear stance MS too.","replies":[{"poster":"Spicy Rice","date":"2016-02-09T20:19:24.775+0000","up_votes":12,"down_votes":1,"body":"Nerfing bearstance would kill udyr.","replies":[]},{"poster":"Alëk","date":"2016-02-09T19:44:01.597+0000","up_votes":4,"down_votes":1,"body":"NO. NONONONONONONONONONONONO. Plz no.","replies":[]}]},{"poster":"Paldor","date":"2016-02-09T23:24:16.560+0000","up_votes":10,"down_votes":1,"body":"Please nerf the items before you touch Udyr. No one ever in my games try to shut me down early, no one invades me early game or try to play around me.\n\nPlus the ap build path isn't even that great for every game, if I have an ap top and mid i don't run that build because it useless since they are already build mr against my team.\n\nPeople don't know how to deal with the map pressure Udyr can apply late game because no one try to shut him down early.","replies":[{"poster":"Jorencice","date":"2016-02-10T00:34:55.008+0000","up_votes":1,"down_votes":6,"body":"Nerf everyone else in the entire game instead of my champ...\n\nWut...","replies":[{"poster":"Paldor","date":"2016-02-10T00:42:19.399+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Jorencice,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=00260000,timestamp=2016-02-10T00:34:55.008+0000)\n>\n> Nerf everyone else in the entire game instead of my champ...\n> \n> Wut...\n\nNo1 else benefits from runic movement speed as much as Udyr does.\n\nDon't type words into my mouth.","replies":[{"poster":"Jorencice","date":"2016-02-10T01:02:39.906+0000","up_votes":1,"down_votes":1,"body":"Except literally every champion in the game benefits from movespeed.\n\nThere's NEVER BEEN A GAME EVER where someone has thought \"Man I wish I was slower so I wouldnt of been able to make it to my teammate in time\"\n\nYou should never nerf everyone because 1 champion can abuse an item.\n\nYou instead nerf that one champion.","replies":[{"poster":"Paldor","date":"2016-02-10T01:04:35.165+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Jorencice,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=0026000000000000,timestamp=2016-02-10T01:02:39.906+0000)\n>\n> Except literally every champion in the game benefits from movespeed.\n> \n> There's NEVER BEEN A GAME EVER where someone has thought \"Man I wish I was slower so I wouldnt of been able to make it to my teammate in time\"\n> \n> You should never nerf everyone because 1 champion can abuse an item.\n> \n> You instead nerf that one champion.\n\nRight because we just see so much ap junglers running around atm","replies":[{"poster":"Jorencice","date":"2016-02-10T01:08:20.360+0000","up_votes":2,"down_votes":1,"body":"Ekko, diana, amumu, fiddle the odd alistar who wants more burst.\n\nIt honestly doesn't matter if only 2 champion in the whole game use the item.\n\nIt still wouldn't be fair to the 2nd champion to nerf the item instead of udyr.","replies":[]}]}]}]}]}]},{"poster":"Gypsyleeboy","date":"2016-02-09T20:14:28.050+0000","up_votes":3,"down_votes":11,"body":"On the first column, I already knew this wasn't worth reading. Win rate means nothing. Play the champion, PLAY THE CHAMPION PEOPLE! I main Tryndamere and udyr jungle, and I can say that Tryndamere is far more useful. Ever since the cinder hulk nerf, udyr is too weak early game, which makes it hard to catch up by mid/late game. The only way you can win with udyr is a full build and late game, and plat+ players are much better in early game sustain and balanced fights, hence they make it to late game much more often than less skilled players. A nerf, will kill the champion off completely for people like me that only play normals for years now..\n\nPossibility that the reason his win rate is high, is cause NO New players are gonna buy udyr, therefore the people that play him are the rare udyr mains like me. And even then, he's hard to play.\n\nMust people like you get all our old and loved champion nerfed? Besides the fact that he don't need to be nerfed, champ nerfs are up to the team and *rarely* ever take advice from boards posts.","replies":[{"poster":"Raoul","date":"2016-02-09T20:30:20.342+0000","up_votes":7,"down_votes":0,"body":"They why dont you like this thread? He says to not nerf Udyr but Runic echo, in a way that would only hurt Udyr, meaning you could still play your main as before, after all, if your are a main, you played him before Runic Echo, right?","replies":[{"poster":"Gypsyleeboy","date":"2016-02-09T20:32:19.336+0000","up_votes":2,"down_votes":3,"body":"Hence, nerfing him.. I think he's fine how he is.","replies":[{"poster":"Raoul","date":"2016-02-09T20:34:42.719+0000","up_votes":6,"down_votes":0,"body":"Why are you as a \"Udyr Main\" so upset about a FotM OP build nerf?","replies":[]},{"poster":"Crossette","date":"2016-02-09T22:03:50.134+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Gypsyleeboy,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=001600000000,timestamp=2016-02-09T20:32:19.336+0000)\n>\n> Hence, nerfing him.. I think he's fine how he is.\n\nThat's what every main thinks.\n\nFace the truth.","replies":[{"poster":"Gypsyleeboy","date":"2016-02-09T23:02:40.776+0000","up_votes":1,"down_votes":0,"body":"I main tryndamere jungle, and udyr as my second pick. My MAIN is missfortune, but you wouldn't (regularly) take her jungle would you?\ni stated it was just a jungle main","replies":[{"poster":"Crossette","date":"2016-02-09T23:04:21.227+0000","up_votes":2,"down_votes":1,"body":"I've taken MF jungle before.\n\nIt was an amazing experience once I breached the first few clears. :^)","replies":[]}]}]}]}]}]},{"poster":"Doctor Horse","date":"2016-02-09T21:45:28.991+0000","up_votes":5,"down_votes":0,"body":"I love how all these people are coming out of the woodwork to whine about Udyr being OP even though  they neglect his glaring weaknesses. His spike in winrate and popularity is just a product of 800g Swiftness boots and 10% movement speed on Runic Echoes. All Riot needs to do is adjust the movement speed as you said. Once these items get nerfed I think he's fine.\n\nAlthough I think there is an opportunity here to rework Udyr while keeping his identity without ruining who he currently is.\n\nI think most of what people complain about can be negated by making Udyr an energy based champion. Energy would be perfect for him, I'm sure Riot could create a way to reward him for combos but stop him from just having a permanent bear stance up all the time. Monkey's Agility would just have to be adjusted to make this possible. Udyr is originally Ionian in his lore (before they updated it but he's still cool with Ionia I think) so he'd be amongst the likes of {{champion:84}} {{champion:98}} {{champion:85}} and {{champion:64}} (who is actually mentioned in Udyr's lore and brought him to Ionia) so it fits thematically.  It gets rid of his awkward early game and prevents him from all the stuff people are complaining about mid-late game. It makes sense, in the process it would also even out the difference between Tiger Stance and Phoenix Stance because one of the main reasons why Tiger Stance isn't as good in the jungle is how much mana it demands. The rest of his kit could be kept the same or similar. I'd actually be VERY EXCITED to see this change come to reality.","replies":[]},{"poster":"MealReadytoEat","date":"2016-02-09T18:29:25.784+0000","up_votes":2,"down_votes":0,"body":"According to champion.gg, devourer udyr is still the most common in plat+ ranked games, and has a 56% win rate, although yes, runic echos is higher. Swifties are a bigger part of his current dominance right now.","replies":[{"poster":"Skia Asteri","date":"2016-02-09T18:33:21.386+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=MealReadytoEat,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=0009,timestamp=2016-02-09T18:29:25.784+0000)\n>\n> According to champion.gg, devourer udyr is still the most common in plat+ ranked games, and has a 56% win rate, although yes, runic echos is higher. Swifties are a bigger part of his current dominance right now.\n\nChampion.gg only counts games where you reach 6 items. Most games where Udyr gets Runic Echos end in the mid game.\n\nHere are some better numbers for judging how common it is: http://www.leagueofgraphs.com/champions/items/udyr/jungle/platinum","replies":[{"poster":"Quepha","date":"2016-02-09T18:46:23.578+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Skia Asteri,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=00090000,timestamp=2016-02-09T18:33:21.386+0000)\n>\n> Champion.gg only counts games where you reach 6 items.\n\nNo, it does not. It takes a random sample of games and uses incomplete builds to weight what the projected full builds would be. An Udyr that ends the game with runic echoes and a warden's mail will have his build contribute to the statistical weight of every build that includes a runic echoes and something that builds out of warden's mail.","replies":[{"poster":"Skia Asteri","date":"2016-02-09T21:08:29.637+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Quepha,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=000900000000,timestamp=2016-02-09T18:46:23.578+0000)\n>\n> No, it does not. It takes a random sample of games and uses incomplete builds to weight what the projected full builds would be. An Udyr that ends the game with runic echoes and a warden's mail will have his build contribute to the statistical weight of every build that includes a runic echoes and something that builds out of warden's mail.\n\nFor item builds it does only use the portion of the sample where the champion in a role had 6 item. Which is why it will sometimes not display items builds from champions in roles they are played in really infrequently while still having a stats page for it: because in none of the sampled games did they reach 6 items.\n\nTo be clear, games they do not reach 6 items are used for other things on that site, but not for item build stats. Which is why I linked another stats site that lists item frequency on an individual basis per champion. {{item:1402}}  is built twice as often as {{item:1403}}  on him in Plat+ (those enchants with other smite upgrades being less common).","replies":[{"poster":"Quepha","date":"2016-02-09T21:49:24.227+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Skia Asteri,realm=NA,application-id=3ErqAdtq,discussion-id=LqJuQEeK,comment-id=0009000000000000,timestamp=2016-02-09T21:08:29.637+0000)\n>\n> For item builds it does only use the portion of the sample where the champion in a role had 6 item. Which is why it will sometimes not display items builds from champions in roles they are played in really infrequently while still having a stats page for it: because in none of the sampled games did they reach 6 items.\n> \n> To be clear, games they do not reach 6 items are used for other things on that site, but not for item build stats. Which is why I linked another stats site that lists item frequency on an individual basis per champion. {{item:1402}}  is built twice as often as {{item:1403}}  on him in Plat+ (those enchants with other smite upgrades being less common).\n\nDon't tell me I'm wrong when I've read the FAQ and you have not.\nhttp://champion.gg/faq/\n> Because the number of games where a full build is successfully completed is very low, it is hard to accurately determine the overall win rate of a given build. This is because completed builds typically have extremely high win rates (players that are ahead have more items completed).\n> \n> Therefore, Champion.gg places a similar weighting for partially completed builds that follow the same build path as the full build.","replies":[]}]}]}]}]}]}