{"poster":"SrPentium","date":"2020-02-25T02:08:13.912+0000","title":"El coronavirus y los RP... aprovecha el bug del dolar!","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Buenas:\r\n\r\n           Como lo dice el titulo, esta información es solamente para jugadores en Argentina..( aunque también puede afectar el resto de las regiones)\r\nComo ustedes saben el Coronavirus esta haciendo mas estragos en los mercados y principales bolsas del mundo que las personas en si, los inversionistas están desorientados en donde carajo meter su dinero y lograr el máximo rendimiento posible.\r\nPero esto no solamente afecta a los que tiene el poder adquisitivo. También a nosotros, los jugadores de LOL y otros juegos.\r\n\r\n\r\nQue téndra que ver?, yo un jugador promedio con maestría 7 con Yasuo que se tira bajo torre enemiga para conseguir la kill?.{{sticker:zombie-brand-clap}} \r\n\r\nEl primer síntoma que ya viene hace rato y ustedes los padecen y son testigos. Son el mal funcionamiento de los servidores.\r\nNo estoy especulando, es la realidad de que no hay inversión para mejorarlos.\r\nAlgunos pensaran porque somos una región toxica, pobre y manca no poseemos lo mejor que china, europa, etc.\r\nLa empresa para mi esta paralizada por su futuro financiero, sus ingresos se ven perjudicados mas aun cuando están lanzando nuevas plataformas y modos de juego.\r\nEl efecto de este virus a sido la gota que derramo el vaso, provocando el alerta a las finanzas.\r\nPero no miremos a la RIOT por esto, ellos no tienen la culpa de lo que sucede.\r\nLas empresas proveedoras de internet también están pasando por lo mismo, su falta de inversión en su infraestructura afecta nuestro modo de juego.\r\nEl aumento en la pobreza de Argentina tiene su buena porción de la torta, hay muchos jugadores que juegan con tostadoras a carbón metiéndose en el juego sabiendo que no pueden dar el rendimiento adecuado para hacer una buena partida. Los gobiernos que pasaron y el que esta actualmente, destruyen el poder adquisitivo de la gente produciendo un efecto de muchos... No poder comprarse una buena PC.\r\nNo tiremos insultos a solamente a la empresa que nos brinda este juego, hay un montón de variables que no nos dejan ser competitivos y crecer como jugadores. Dejando de lado los mismos toxicos y flamer de siempre.\r\n\r\nVolviendo a lo del Titulo.\r\nEste juego es gratuito, eso lo saben bien; peroooo que pasa con aquellos que gastan dinero para comprar RP?\r\nLa respuesta es sencilla....\r\nHay que aprovechar que en Argentina el dolar esta barato.... SI COMO LO LEISTE: ESTA BARATO!\r\nPronto la Argentina no aguantara esta presión financiera mundial en la cual Brasil que esta posicionado cien veces mejor esta provocando que su moneda se esta devaluando por esta enfermedad.\r\nEl barril de petroleo esta bajando su precio por la falta de demanda y ahora en Europa con Italia esperando que su mercado haga un efecto domino en la Unión europea ( El euro esta perdiendo valor frente al Dolar).\r\nSi tienen la posibilidad de comprar RP ó otra cosa en base a dolares, sacrifiquesen y comprenlo!\r\nLas tasa en Argentina están bajando (temporalmente), en la cual provoca que la compra de dolares con tarjeta de credito este entre 63 y 85 pesos por dolar. La tasa de interes de cuyas tarjetas lo dejan como a 72 pesos, que a mi parecer esta al alcance del bolsillo para aquellos que no pueden ir a una casa de cambio y comprarlos como dios manda.\r\nSoy un Trader y estoy metido en cuestiones politico y economicos que me dejan tomar desiciones para ganar dinero.\r\nEl dolar se va a APRECIAR en todos lados haciendo que sea mas caro para conseguirlo, los chinos empezaron una guerra psicologica por venganza a USA por hacerse los malos con la guerra comercial que iniciaron en la cual todos salen perdiendo.\r\nEste fue mi humilde resumen.\r\nSi van a comentar háganlo con toda la violencia posible pero con respeto.... Gracias.{{sticker:katarina-love}}","replies":[{"poster":"Rivotinto","date":"2020-02-25T02:29:21.062+0000","up_votes":2,"down_votes":0,"body":"Resumen: el mundo se va a la mierda","replies":[]},{"poster":"Hnk Kenshiro","date":"2020-02-25T02:14:13.198+0000","up_votes":2,"down_votes":0,"body":"Quiero vivir en una cabaña con ovejas y cultivos lejos de los problemas del mundo.\n\n######Pero con wifi","replies":[]},{"poster":"PasoPackXHonores","date":"2020-02-25T08:38:19.200+0000","up_votes":3,"down_votes":1,"body":"Tu consejo es que compren RP por que el dolar está \"barato\". \n\nMi consejo es: no gasten ni un centavo en este juego. NO ES NINGUNA INVERSIÓN.","replies":[{"poster":"SrPentium","date":"2020-02-25T13:21:27.327+0000","up_votes":1,"down_votes":2,"body":"Esta claro que este juego no es una inversion como realmente todos conocemos para que nos de rendimientos, lo cual la empresa es dueña de nuestras cuentas. si se va a la quiebra(ponele), todo se cae y el dinero que le dimos se pierde de la noche a la mañana. \nCoincido, pero cada uno es dueño de lo que hace con su dinero, puedes aprovechar esta movida ó quedarte quieto para guardar tus ahorros.\nPero en mi caso es un ejemplo de adquirir dolares baratos y darles un buen uso, en este caso comprarme una linda skin para mi inversion personal.\nGracias por tu comentario.","replies":[]}]},{"poster":"AMD Radeon RDNA","date":"2020-02-25T04:58:01.968+0000","up_votes":1,"down_votes":0,"body":"Como trader profesional decis que es un efecto externo la suba al dolar? no sabes que es emision monetaria? La expansion de la base monetaria del BCRA? Las LEBAD (ex-LELIQ)? \n\nhttps://www.cronista.com/finanzasmercados/Entre-noviembre-y-enero-la-cantidad-de-pesos-en-la-calle-crecio-al-mayor-ritmo-en-9-anos-20200205-0032.html\n\nTe lo resumo:\nLa gente solo piensa en dolares. Como va a pensar en una moneda que se vive devaluando y vale menos que papel higienico para sonarte la nariz? **NO TENEMOS MONEDA. Los activos del BCRA son D-O-L-A-R-E-S** y los pasivos, los billetitos de colores que te dicen que sirven y te revientan con impuesto inflacionario ~~rechazo a la \"moneda nacional\"~~","replies":[{"poster":"BioTron JR","date":"2020-02-25T09:27:46.043+0000","up_votes":1,"down_votes":0,"body":"llegó la (((mileikovsky))) army","replies":[{"poster":"AMD Radeon RDNA","date":"2020-02-27T00:34:32.724+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BioTron JR,realm=LAS,application-id=v7qsfXsE,discussion-id=HwWmH0lG,comment-id=00060000,timestamp=2020-02-25T09:27:46.043+0000)\n>\n> llegó la (((mileikovsky))) army\n\najajjajajaja vos sabes que lo busque asi y me salio este foro vendedor de panfletos? Dios mio \nhttps://elnacionalista.mforos.com/680889/13017649-el-agente-sionista-javier-milei-mileikovsky/-\n\nLo bueno es que la libertad avanza y mucha gente esta despertando del sueño populista. Mucha gente ya se canso de que le tomen el pelo en los medios por culpa de las formas y no en el contenido. Mucha gente empezo a buscar cada dato que tiro Milei u otro referente liberal. Es hermoso leer \"Gracias Milei. Era peronista/macrista, busque tus datos y tenes razon en todo. Desperte gracias a vos\"","replies":[]}]},{"poster":"SrPentium","date":"2020-02-25T13:32:57.820+0000","up_votes":1,"down_votes":0,"body":"Esta son una herramienta defensiva que tiene los paises para hacer frente ante las demandas internas y externas para adquirir y devolver dolares.\nLo que pasa mi estimado que tienes razon que la gente piensa en dolares porque no hay educación financiera y eso provoca que las personas se vuelquen a esta moneda ya que no conocen otra cosa como salvar su patrimonio.\nEsto tambien lo tengo en cuenta para hacer mis movimientos de trading y no lleva a ninguna parte cuestionar lo que hace el gobierno, solamente observar y actuar cuando una posibilidad de ganar dinero se hace oportuno.\nGracias por comentar.","replies":[]}]},{"poster":"Tur1nTur4mb4r ","date":"2020-02-25T04:54:22.509+0000","up_votes":1,"down_votes":0,"body":"Y en que invierto? tengo un plazo hoy en dia a 33.5% que lo renuevo todos los meses. Sigue siendo optimo comprar dolares? y si tengo dolares en que los invierto. Porque es plata que no estoy moviendo, por eso la meti en un plazo fijo, que haga algo la hija de puta aunque sea","replies":[{"poster":"SrPentium","date":"2020-02-25T13:38:32.432+0000","up_votes":1,"down_votes":0,"body":"Para empezar con esa tasa de interes ya estas perdiendo dinero ante la posibilidad de que la inflacion la supere ese porcentaje.\nSi le tienes algo de confianza a tu banco, todo organismo poseen paquetes de inversiones en donde arman un portafolio donde distribuyen tu dinero en acciones,bonos, cauciones, entre otros.\nes una manera de muchas para hacer rendir un poco tu dinero.\nSaludos.","replies":[]}]},{"poster":"Shikata ga nai","date":"2020-02-25T02:39:42.856+0000","up_votes":1,"down_votes":0,"body":"¿Con que te estás dando?\nhttps://youtu.be/-5VzTV2fgW4","replies":[]},{"poster":"Alexander    ˆ ","date":"2020-02-25T02:25:03.545+0000","up_votes":1,"down_votes":0,"body":"yo meto bitcoin a lol","replies":[]},{"poster":"WhiteMax","date":"2020-02-25T02:16:41.233+0000","up_votes":1,"down_votes":0,"body":"Resumen?","replies":[]}]}