{"poster":"Shervinator","date":"2017-07-05T08:28:23.610+0000","title":"Experience bar for the new honour system?","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"With the new honour system in place, wouldn&#039;t it be good to see how close you are to your next honour level? or even lower honour level? just something small that could really be a cool little detail","replies":[{"poster":"Ninox","date":"2017-07-05T08:37:09.076+0000","up_votes":3,"down_votes":0,"body":"As much as I think everyone would like it, I think they want to keep it a bit more ambiguous than that. There's not real harm in showing regular players a progress bar, but from Riot's perspective, knowing you aren't close to dropping an honour level removes the incentive to remain positive that honour brings to the less positive/neutral members of the community. \n\nIf you know that you have a safety net of sorts before negative behaviour will put you in any real danger of losing an honour rank, you're less likely to develop positive behaviour as a habit, and more likely to just dodge that rank drop. \n\nOf course, those that see punishments will have their honour removed entirely, but for the petty and inconsistent toxics that are little more than annoying, they're unlikely to see those punishments, so honour is how Riot communicates that their behaviour isn't great.","replies":[{"poster":"Arkangyle","date":"2017-07-05T12:42:58.216+0000","up_votes":2,"down_votes":0,"body":"It's actually genius in its simplicity. If you give people something measurable, something they can track their progress on, they'll act more directly towards a result.\n\nIf you keep it ambiguous and with no way of knowing how you're faring, you're more likely to be more consistent in your behavior to try and attain this unknown standard.","replies":[{"poster":"Ninox","date":"2017-07-05T14:29:13.145+0000","up_votes":1,"down_votes":0,"body":"Exacta. The way it is reinforces creation of good habits. Having it exact just encourages people to dodge the negatives.","replies":[]}]}]},{"poster":"Early Feed Strat","date":"2017-07-05T12:34:30.148+0000","up_votes":1,"down_votes":0,"body":"I think a heads up message telling you that you are close to leveling up would be nice.","replies":[]},{"poster":"Talon12","date":"2017-07-05T09:24:13.346+0000","up_votes":1,"down_votes":0,"body":"As Seras said, if people can see their honour levels, they will act differently, riot wants to reward people for just being cool in general, not people who realised they are about to be punished.","replies":[]}]}