{"poster":"FocusD","date":"2016-12-31T05:30:36.844+0000","title":"porque gano \"pocos\" lp?","subforum":"Charlas Generales","up_votes":1,"down_votes":3,"body":"hola, desde que empezo la season tengo un win rate aprox de 67 a 72 %, lo cual es bastante alto, pero me he dado cuenta que no gano mas de 21 lp, y con ese win rate tengo amigos que ganan 26, y la verdad afecta bastante al subir de liga, si alguien me puede decir porque gano eso y mis amigos mas?","replies":[{"poster":"Arkolico","date":"2016-12-31T13:28:17.991+0000","up_votes":1,"down_votes":0,"body":"entra a lolop.gg  y ve si tu mmr esta por debajo de la media si es asi esa es la razon","replies":[]},{"poster":"Yrox the Third","date":"2016-12-31T05:37:14.955+0000","up_votes":1,"down_votes":0,"body":"El LP depende del ELO que tienes en comparacion a tu liga, hagamos ejemplos con numeros al azar.\n\nSi tienes un elo de 1000 y estas en plata 5, adonde el elo promedio es de 1300 (te digo, son numeros hechos para esto, no los saque de ningun lado), tu elo esta por debajo del promedio asi que perderas mucho mas LP de lo que ganas al ganar una partida, ¿por que?, porque el sistema cree que no mereces estar ahi.\n\nAhora, digamos que tienes un ELO de 1300 y estas en plata 5, el sistema hara que ganes mas o menos lo mismo que lo que pierdes (osea, por cada partida ganaras mas o menos 15 lp y perderas mas o menos 15 lp), asi siempre estaras mas o menos en lo mismo, el sistema lo hace porque cree que ya quedaste en el lugar que mereces.\n\nAhora, imagina que tienes un eo de 1800 y estas en plata 5, el sistema dice que eres muy bueno para esta liga asi que te hara ganar mucho LP y perderas muy poco LP, asi subiras mas rapido ya que el sistema cree que mereces estar arriba (de esta manera, es mas facil saltarse divisiones al ganar promociones o incluso saltarse la promocion).\n\nEl LP se ve afectado por tu Win rate, si, es casi un hecho, pero no decidira todo, imagina que ya, con tu winrate ahora tienes un ELO similar al promedio de tu liga, mientras que tus amigos con su win rate tienen un elo superior al de su liga, ellos obviamente ganaran mas LP que tu.\n\nEspero que te haya servido (repito, los numeros que use no son oficiales, no los uses de referencia)","replies":[{"poster":"FocusD","date":"2016-12-31T07:02:29.954+0000","up_votes":1,"down_votes":0,"body":"oks muchas gracias, ahora entiendo porque, almenos ya se mi elo","replies":[]}]}]}