{"poster":"Veljos","date":"2017-08-09T07:51:36.611+0000","title":"Disconnecting, but everything seems fine","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"An issue started occurring, about two days ago, where I'm constantly disconnecting from the game, at least that's how it seems. My FPS is around 40-50, and my MS at around 46, which is normal for me. I've read up on some threads about this problem from a while ago, and it said it might be due to packet loss, but I just ran some analytics on my connection, and it says that everything is more than fine. I usually have 3-4 devices connected to my router (not while actually playing League) and my connection handles it pretty well. I ran a full repair, and re-installed the game, but it didn't help. Just tried a custom game, with just me and a bot, and i could barely move. Also had some problems with the client, started at the same time as the other one, where it takes a long time to connect me to client chat, friends list, whatever it's called; champion mastery also took a long time to load, while runes, masteries, and match history loaded instantly. \r\n\r\nI don't know if there was an update that might have caused this, or something. I doubt the problem is caused by my PC, because I literally didn't make any changes to or on it for months, it's at the same performance level it always is. And, as i've said, I ran analytics on my internet connection that say everything is fine, and besides that I'm not having any problems with it whatsoever (all sites, apps, other games run as usual)\r\n\r\nCan somebody please tell me how to fix this problem, or at least tell me what's causing it, so I can try and do something about it?\r\nThank you.","replies":[{"poster":"Dark Morgana","date":"2017-08-11T00:32:51.497+0000","up_votes":1,"down_votes":0,"body":"That doesn't sound like a good time, that's for sure! I want to start by having you troubleshoot your [Clients Connection to the Server](https://support.riotgames.com/hc/en-us/articles/201752664). This guide has several steps that should get you your client back up and running. If you do continue to have problems though make sure to let me know.","replies":[]},{"poster":"Veljos","date":"2017-08-09T08:02:41.919+0000","up_votes":1,"down_votes":0,"body":"Just tried another custom game, couldn't even connect.","replies":[]}]}