{"poster":"Mafed99","date":"2015-10-24T16:25:39.830+0000","title":"Kinder !","subforum":"Campioni e gameplay","up_votes":0,"down_votes":0,"body":"ciao ragazzi ho speso 5 euro per comprarmi il champion kindred poiché  mi piace molto il ruolo jungle e ho visto che questo campione è  uno dei migliori , inoltre va benissimo anche come supporto in bot o in mid .. ho comprato gli Rp  ora mi chiedo se sia  veramente il migliore? non vorrei buttare 5 euro ..  chi lo ha giocato può  gentilmente dirmi come lo trova? grazie ^^","replies":[{"poster":"A Yordle ln Heat","date":"2015-10-24T16:28:21.398+0000","up_votes":3,"down_votes":0,"body":"Non andarci ADC, praticamente sprechi la passiva.\nVacci jungle, funziona bene. Per pulire bene la giungla devi continuare a muoverti e spammare la Q quando la W è attiva.\nEnjoy your freelo.","replies":[]},{"poster":"TORREro064","date":"2015-10-24T20:21:14.426+0000","up_votes":1,"down_votes":0,"body":"quando ho letto il post già dal titolo pensavo fosse un troll KINDER (mi sembra l' ovetto di cioccolata)\npessima scelta cmq kindred è un champ da giungla molto difficile da usare. \nin giungla le rune e le maestrie fanno la differenza XD tu sei appena livello 13. quando hai sbloccato punizione? al 10?\ndovevi iniziare con champ come {{champion:19}} o {{champion:78}} o {{champion:20}} o {{champion:11}} per la giungla. campioni semplici e forti TUTTI da 450 IP.  ai livelli bassi servono campioni con DANNI BASE ALTI e SEMPLICI. \nla ulti di kindred non è facile da usare. io ti consiglio di vedere anche la vetrina campioni anche se serve a poco e a niente.\n https://www.youtube.com/watch?v=jm4KvA8gfys  e poi  perchè spendere soldi VERI per un champ? li puoi ottenere tranquillamente giocando XD. anche io spendo soldi ma li spendo per le skin che non posso prendere se non pagando con soldi veri. vedi che tra pochissimo metteranno kindred in rotazione, ti conveniva aspettare.{{champion:203}}","replies":[{"poster":"Mafed99","date":"2015-10-25T19:05:48.489+0000","up_votes":1,"down_votes":0,"body":"si hai proprio ragione è che amo questo champion e mi piace veramente molto .. ora sto facendo un po fatica ma piano piano sto imparando sono passato da 0\\3\\9 a 7\\6\\1 poi dipende anche da chi ti trovi contro però sto imparando... non ho saputo aspettare purtroppo con la frenesia di provarlo .. ormai è andata la prossima volta farmerò Ip e prenderò la skin con gli RP.. grazie per il consiglio ^^ ( tanto ho speso 2,50 euro ) perciò non lo considero un acquisto perso dato che mi adoro questo campione","replies":[]}]},{"poster":"BrattishSolid6","date":"2015-10-24T17:01:52.160+0000","up_votes":1,"down_votes":0,"body":"In futuro in ogni caso ti consiglio di non spendere soldi per comprare i champ con gli RP. Sono cose che potresti guadagnarti benissimo giocando e farmando IP. Poi ognuno è libero di fare ciò che vuole, ma se arrivi a spendere RP tanto vale usarli per contenuti altrimenti inaccessibili (ovvero le skin) C:","replies":[]},{"poster":"DEMOS92","date":"2015-10-24T16:26:56.720+0000","up_votes":1,"down_votes":0,"body":"è piu adc","replies":[{"poster":"Lee Sung Kyung","date":"2015-10-24T16:37:24.706+0000","up_votes":1,"down_votes":0,"body":"LMAO. {{champion:203}} nasce come jungler, potrebbe essere anche un pick come ADC ma Common ha gia' spiegato perche' e' meglio come jungler invece che ADC.","replies":[]},{"poster":"A Yordle ln Heat","date":"2015-10-24T16:28:39.157+0000","up_votes":1,"down_votes":0,"body":"wat","replies":[]}]}]}