{"poster":"vladmihai","date":"2017-08-25T23:14:04.173+0000","title":"About Warwick's Backstory","subforum":"Story, Art, & Sound","up_votes":3,"down_votes":1,"body":"Will you ever release Warwick&#039;s full backstory (before he got picked up by Singed) and what connections he has with Jinx, Vi and possibly Ekko? \r\n\r\nThanks!\r\n\r\nP.S   If either Jaredan or LeaoC see this I&#039;ve already asked this in Necrit&#039;s Discord but sadly got no reply.","replies":[{"poster":"Interlocutioner","date":"2017-08-27T17:11:13.293+0000","up_votes":3,"down_votes":1,"body":"Buna vladmihai, I'm the writer who worked on Warwick. Here's what I would say...\n\nThere's a certain way of looking at Warwick's backstory where it's already complete. I.e., the goal was to make memory loss a _part_ of his story, and not a _hole_ in it! It defines who he is and where he might be going. The stories we can tell. He wouldn't be Warwick if he knew everything. \n\nBut his memories are definitely (gradually) coming back, so there's room to learn more about his past... in the future.  {{sticker:slayer-pantheon-thumbs}} \n\nIn the meantime, at least Necrit showed us what would happen if Warwick and Ekko got into a fight. :D https://youtu.be/exALR-TvwSc?t=31s","replies":[{"poster":"dengen","date":"2017-08-27T20:27:26.649+0000","up_votes":1,"down_votes":0,"body":"Wait, are you actually romanian?","replies":[{"poster":"Interlocutioner","date":"2017-08-27T21:55:46.754+0000","up_votes":2,"down_votes":0,"body":"I wish. I'm just a dumb American. But I love learning new languages, English is starting to bore me. And I noticed the Romanian names. :D","replies":[{"poster":"DeadUnborn","date":"2017-08-28T06:49:34.261+0000","up_votes":1,"down_votes":0,"body":"Nothing wrong with being American, you don't have to downplay it!","replies":[]}]}]},{"poster":"Zero Drive","date":"2017-08-28T09:50:22.645+0000","up_votes":1,"down_votes":0,"body":"Wouldn't Ekko use his superior intellect and figure out a way to cause Warwick's chem filled back.. spike/cannister thing to explode or pump out enough chems to make Warwick OD though?\n\nNo bias, I actually main both of these Zaunite masterpieces.\n\nP.s: Thank you so much for making Warwick so awesome.","replies":[]}]},{"poster":"GreenLore","date":"2017-08-26T14:08:31.701+0000","up_votes":2,"down_votes":0,"body":"They will likely release it eventually,but I wouldn't expect it anytime soon.","replies":[]}]}