{"poster":"LGD Lewllyne","date":"2015-10-22T06:42:12.665+0000","title":"Why are people so mad in one for all?","subforum":"Maps & Modes","up_votes":2,"down_votes":3,"body":"I feel like this game mode should be more fun than my experience with it has been. It seems like people get way more mad way faster  that any other game mode I&#039;ve ever played. Don&#039;t like the champ that got picked? Rage about it. Match up really one sided or you don&#039;t know how to play the champ? Rage about it and throw insults at whoever picked the champ you got all game. Other team is a kill up 5 minutes in? GG surrender who picked this champ it sucks.  I&#039;ve played one game of it that hasn&#039;t ended in surrender. Nobody seems to be able to play this game for the fun of it.","replies":[{"poster":"disregardable","date":"2015-10-22T06:47:56.212+0000","up_votes":1,"down_votes":1,"body":"It's really not a very fun game mode. Played it 4 times. Won 2, lost 2, either way one side was countered and it sucked ass. I don't  know why they didn't bring back mirror mode on sr or urf.","replies":[{"poster":"GetMariahCarried","date":"2015-10-22T07:11:57.607+0000","up_votes":1,"down_votes":0,"body":"Because apparently everyone hated that? It had no interesting matchups? Because, duh, mirror mode? You apparently had 4 games in a row that were counter-based. I've had about 4 dozen games, and that sound like maybe 20% of them at most. Only champs I know of that are consistently countered are adc's. Mage's blow them up. Assassins blow them up. Fighters scale better early and overwhelm them before adc's get good. Tanks out-tank them and nerf their damage too early. A bunch of adc's with no supports/peelers are generally in for a rough ride without some master plan. But other than adc's, there's no consistent counter for most champs.","replies":[{"poster":"disregardable","date":"2015-10-22T07:43:36.484+0000","up_votes":1,"down_votes":0,"body":"It had fair matchups that didn't suck. /shrug. I really have no idea what you're talking about with the counters. This game mode is pretty much dominated by fighters. Assassins lose to fighters, adcs lose to fighters, mages lose to fighters, supports obviously lose to fighters. I guess technically tanks might not lose to fighters? maybe? Seems like it'd be even or a loss. If you go against any fighter, you lose. The squishies getting wrecked by assassins is just icing on the cake, as is adcs losing to fighters. It's hard to force yourself to play 4 dozen games of a game mode that's consistently unfun in its nature, but congratulations, I guess.","replies":[{"poster":"GetMariahCarried","date":"2015-10-22T22:44:07.243+0000","up_votes":1,"down_votes":0,"body":"So based on 4 games, once again, you're making even MORE claims. Aka, going against ANY fighter as ANY non-fighter is an insta-loss? \nIf you're gonna spout lousy claims based on lousy evidence, then the whole discussion is a waste. I'm moving onto other threads.","replies":[]}]}]}]},{"poster":"NattyV","date":"2015-10-22T19:26:58.802+0000","up_votes":1,"down_votes":0,"body":"I think people just get mad because things don't go there way. Also I think people have a problem remembering that it's a game. It's meant to be fun and enjoyable yet people think they're pro just because they get a few wins...","replies":[]},{"poster":"acidxrain","date":"2015-10-22T11:00:23.692+0000","up_votes":1,"down_votes":0,"body":"The mode likely isn't very interesting or fun because the amount of people who join up in trios+ and lop-side the votes to majority all the time is kind of absurd. I've played a few of them and have been stuck playing things like Rammus because three people were queued up together and insta-locked in. The fun in it all kind of _begins_ at champion select, where you feel you've got a chance to get your desired champion. Then another problem usually happens shortly after the majority vote, in that your teammates do not attempt to ban out clear counters to your majority vote. It makes for really one-sided games, that are major buzzkills. I've had it happen to me on just about every game, and now I'm just getting my win of the day in ARAM, as I always have. I don't want to waste 40 minutes while the enemy team is sitting at my nexus refusing to kill it simply because it's that lopsided. I'd rather just go play something else/some other mode, which is exactly what I'm doing now.","replies":[]},{"poster":"Str8Ace180","date":"2015-10-22T07:55:33.220+0000","up_votes":1,"down_votes":0,"body":"{{champion:85}} ... ban {{champion:85}} ... or play him lol that's fun... really just have to avoid bad picks... try voting for {{champion:90}} fun cuz of voidling army... {{champion:115}} MEGA boom... {{champion:26}} no one dies... {{champion:119}} can catch other {{champion:119}} axes because {{champion:119}} ... {{champion:64}} jump around... {{champion:41}} and {{champion:134}}  also I think would be fun if they can play off each other like {{champion:119}}","replies":[]},{"poster":"GetMariahCarried","date":"2015-10-22T07:07:36.760+0000","up_votes":1,"down_votes":0,"body":"#\\# OfA-Teambuilder","replies":[]},{"poster":"SoundChaosDebug","date":"2015-10-22T06:49:21.076+0000","up_votes":1,"down_votes":0,"body":"I play with a friend and we never vote surrender if we can, won the last match we played because 3 wanted to surrender and we didnt.","replies":[]}]}