{"poster":"TeamSpiritAnivia","date":"2016-03-12T01:40:12.030+0000","title":"Runeterra's Lore? Possible theory to the history of the planet","subforum":"Story, Art, & Sound","up_votes":7,"down_votes":1,"body":"Taric is from one of the other planets that the Targonians settled, since they used to be a space faring race, I&#039;m assuming that the rune wars destroyed (the space capabilities of) the homeworld of runeterra. with the squabbling that is mentioned in Aurelion Sol&#039;s lore page, I&#039;m assuming this was the council of great mages that ended up binding Sol, they disputed over what he would do, finally causing a large war between their respective groups. (groups such as the long ago peoples that formed shurima, &amp; the yordles, the human(ish) factions that formed noxus and demacia, and their respective inner portions that would form zaun and piltover. with possibly beings from the crystal scar included in the bunch and they dove underground to hide from the destruction of their home [with skarner being the only one left] and the people who settled and lived in and around ionia (which also could&#039;ve been a faction in the first group.) \n\nSol&#039;s lore says that the very old runeterrans were space-faring and this could be how and why the yordles have spaceships in bandle city. (even though they dont know or remember what they are.) These ships couldve been from so long ago that none of the beings who exist on runeterra remembering. The variety of species that exist on runeterra lead me to believe that the targonians assimilated races into their fold similar to what the covenant does in halo. with the rune wars any class system that existed could&#039;ve been thoroughly destroyed as anyone left would have to be scrounging for whatever soldiers and mages they could get their hands on. \n\nIdk if any of this would actually come true in lore, especially considering that most of it has been deemed too old to be cannon anymore(im still a little fuzzy on what rito decied to retcon out) \n\nalso leaving this here (not sure if it counts as fan art, or if it was riot drawn from years ago)\nhttp://i.ytimg.com/vi/X_SwxLhEW0Y/maxresdefault.jpg\n\n\n\nEdit: Squeeeeee!!!! A Riot employee responded! what a great evening!!!{{sticker:zombie-nunu-hearts}} \n\n\nEdit #2: Thanks for sticking around in the thread a bit jaredan. its nice having a rioter able to answer some of our questions. And guys, please don't be mean to the riot employees, if it was part of your job to sit on the forums for lets assume about two hours, would you really enjoy getting told you are failing at your job by large quantities of people? would that make this aspect of your job slightly fun? or a massive chore that you spend the hour leading up to dreading? be nice to rito, they have a lot that we want from them, and it takes time to get things sorted and working and coherent. also thank you sharjo for being civil about answering that! <3 much love to rito and the nice part of the NA community","replies":[{"poster":"Horidas","date":"2016-03-12T02:16:44.002+0000","up_votes":7,"down_votes":0,"body":"I still don't understand how the Targonians can be space-faring - or anyone on Runeterra for that matter.","replies":[{"poster":"ULTRAF0RCE","date":"2016-03-12T13:44:21.349+0000","up_votes":3,"down_votes":0,"body":"We don't really know yet what the Targonians are truellly like given that everyone in targon currently is an empowered rakkor or member of some other group in the case of Diana, its very possible the aspects that gave them the power are the true targonians.","replies":[{"poster":"Orothrim","date":"2016-03-12T14:44:35.350+0000","up_votes":4,"down_votes":0,"body":"I believe this is correct, the targonians are the aspects and they are \"space-faring In that they possess people on multiple planets a cross the universe.","replies":[]}]},{"poster":"TeamSpiritAnivia","date":"2016-03-12T05:25:47.956+0000","up_votes":4,"down_votes":1,"body":"Assuming that riot doesn't burn what they previously had for lore, it can be assumed that the targonians developed the tech to travel and colonize other planets. And then promptly blew all of the information and data for it up and out of the people of runeterra's minds. possibly destroying all of their old colonies in the process. with what were summoners (before lore changes, assuming again that they are actually removed from lore) stopping all of this to prevent the destruction of the homeland and such. think soldiers putting down their weapons and deciding not to fight, similar concept","replies":[{"poster":"Marbelara","date":"2016-03-12T22:05:32.901+0000","up_votes":1,"down_votes":0,"body":"Also Rune Wars probably took part in the destruction of this information, like the burning of Alexandria's library, with only some of the information left for us, think the key relics from Halo or Homeworld (especially Homeworld). Mayhaps it is all intact in some great library, just forgotten to the masses rn.\n\nOr maybe there was a third side, a larger enemy that quashed them, like Balrog to the Dwarves. Void definietely qualifies.\n\nMaybe it was both at the same time.","replies":[]},{"poster":"Dreampod","date":"2016-03-12T21:43:53.643+0000","up_votes":1,"down_votes":0,"body":"I would be very surprised if they took a tech based approach to space-faring rather than magic based (think Riftwar Saga) given the general theme of the game.  I can see them open portals to other planets, transforming into 'energy beings' that can travel through space, or something like that be I don't see spaceships fitting with the world as it exists and the uproar if they went that direction would dwarf the previous lore-based outrages.","replies":[]}]}]},{"poster":"Ebonmaw Dragon","date":"2016-03-12T02:29:51.010+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Hamzee Makara,realm=NA,application-id=6kFXY1kR,discussion-id=hGbep8Op,comment-id=,timestamp=2016-03-12T01:40:12.030+0000)\n>\n> also leaving this here (not sure if it counts as fan art, or if it was riot drawn from years ago)\n> http://i.ytimg.com/vi/X_SwxLhEW0Y/maxresdefault.jpg\n\nIts an actual picture of Bandle City created by Riot years ago... may be subject to change with the new lore. But is not Fan art.","replies":[{"poster":"RiotJaredan","date":"2016-03-12T06:01:03.148+0000","up_votes":4,"down_votes":2,"body":"Yup that's not current canon.","replies":[{"poster":"Super Loller","date":"2016-03-12T10:14:38.636+0000","up_votes":3,"down_votes":12,"body":"It's encouraging to see that Riot won't even stand behind it's own work.\n\n/(so much sarcasm and disappointment.)\n\n\"Shurima (we're fully aware of the need, though I wouldn't put it the way you did) - {Jaredan}, in regard to completing Champ bios.\"\n\nHere's your chance to explain yourself Jaredan. \"Put it\" the way you like in regards to this following question:\n\nIn regards to the poster who said: \"We still have Piltover, Ionia, Demacia, Noxus, Bandle City, the Void, SHURIMA (I do remind you it was never really finished, you guys really fucked that one up\" \n\nHow would you \"put that\" Jaredan?\n\nAnd more importantly, how do you explain it?\n","replies":[{"poster":"Orothrim","date":"2016-03-12T14:42:10.934+0000","up_votes":12,"down_votes":1,"body":"This is why I stopped being into the lore, cause people like you \"super loller\" seem to just attack any rioter who tries to have a conversation.  Now I avoid the lore cause if I wanna talk about it on the forum I can't except with toxic people.","replies":[{"poster":"Zeta","date":"2016-03-13T21:27:27.553+0000","up_votes":4,"down_votes":2,"body":"There's really no point in being into the lore when Riot retcons it every 2 years.  They're like DC comics but worse.","replies":[]}]}]},{"poster":"HowPlayGAEM","date":"2016-03-12T09:09:59.058+0000","up_votes":6,"down_votes":0,"body":"***","replies":[{"poster":"RiotJaredan","date":"2016-03-12T09:56:05.312+0000","up_votes":7,"down_votes":4,"body":"Shurima (we're fully aware of the need, though I wouldn't put it the way you did), in regard to completing Champ bios.\n\nThe map is being worked on toward being shown to players. No ETA as of yet, but it's progressing.","replies":[{"poster":"Super Loller","date":"2016-03-12T11:39:08.948+0000","up_votes":4,"down_votes":14,"body":"Rather than tell us anything, Jaredan didn't actually tell us anything, he tried to hide his admittance that the Shurima Lore lacked a conclusion, and champion bio's were left unfinished, within the admission that the map is still being worked on, with no solid release date in sight.\n\nI see no reason to celebrate, rather, I'm saddened by the way Riot treats it's players as uninformed person's who'll go along with pretty much anything their given.","replies":[{"poster":"Sharjo","date":"2016-03-12T13:10:22.454+0000","up_votes":12,"down_votes":2,"body":"He basically said \"Shurima's next for champ bios, no eta on a map though we're working on it\" in regards to a question where someone didn't know what was up. If you've been around then yeah, that's no news, but for some people they won't know, so it's good to spread the word around. In this case the player _was_ uninformed; OMGHalpMePlz didn't know and was asking to get information. \n\nWhile he might not have told us anything new, he answered the question presented to him. I don't see a cause for concern.","replies":[]}]},{"poster":"FrostyDog","date":"2016-03-14T15:47:55.498+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jaredan,realm=NA,application-id=6kFXY1kR,discussion-id=hGbep8Op,comment-id=0001000000010000,timestamp=2016-03-12T09:56:05.312+0000)\n>\n> Shurima (we're fully aware of the need, though I wouldn't put it the way you did), in regard to completing Champ bios.\n> \n> The map is being worked on toward being shown to players. No ETA as of yet, but it's progressing.\n\nGive my main man Azir the love he needs. <3","replies":[{"poster":"RiotJaredan","date":"2016-03-19T03:39:08.596+0000","up_votes":3,"down_votes":1,"body":"/falls down a hill\nAaaaas youuuuu wiiiiiiiiiiish.","replies":[{"poster":"FlashnFuse","date":"2016-03-19T06:45:30.617+0000","up_votes":2,"down_votes":0,"body":"https://i.imgur.com/XS5LKh.jpg","replies":[]},{"poster":"dapositiveviking","date":"2016-03-19T18:47:10.930+0000","up_votes":1,"down_votes":0,"body":"i have the princess bride sitting on the shelf right above my head and you just brought me a lot of joy w this","replies":[]},{"poster":"Hellioning","date":"2016-03-19T03:43:26.630+0000","up_votes":1,"down_votes":0,"body":"That seems a little forward of you, don't you think, Jaredan?","replies":[]}]}]},{"poster":"darkdill","date":"2016-03-12T09:59:39.994+0000","up_votes":2,"down_votes":1,"body":"Is Demacia a possible for this year, or will we have to wait until 2017?","replies":[{"poster":"Sharjo","date":"2016-03-13T01:10:34.474+0000","up_votes":2,"down_votes":0,"body":"Depends on what they decide to tackle once they're finished with Shurima, keeping in mind that if all goes to plan (which it might not; stuff happens), the Shurima lore should all be out before the middle of the year. I'd imagine foundations is already working on the next locale, wherever that might be.","replies":[]},{"poster":"5000000000000000","date":"2016-03-14T16:52:03.845+0000","up_votes":1,"down_votes":0,"body":"Demacia should really be explained in tandem with Noxus.","replies":[]}]}]}]},{"poster":"Ebonmaw Dragon","date":"2016-03-12T06:05:39.784+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Jaredan,realm=NA,application-id=6kFXY1kR,discussion-id=hGbep8Op,comment-id=00010000,timestamp=2016-03-12T06:01:03.148+0000)\n>\n> Yup that's not current canon.\n\nI must ask something about the \"New Bandle\":\n\nThe \"new bandle\" is more similar to the Video of \"The curse of the sad mummy\" and what we saw on the \"Blitzcrank Poro minigame\", Right?\n\nI guess that you cant answer due spoilers, but i dont lose anything with asking.","replies":[{"poster":"RiotJaredan","date":"2016-03-19T09:20:11.933+0000","up_votes":1,"down_votes":0,"body":"That's correct, I can't answer due to spoilers. ;) Sorry.","replies":[]}]}]}]},{"poster":"GreenLore","date":"2016-03-12T09:25:55.912+0000","up_votes":2,"down_votes":0,"body":"I think that the Targonians actually used magic to visit other planets,it would fit the setting a lot more than them having space ships.","replies":[{"poster":"Kadavik","date":"2016-03-14T15:18:23.483+0000","up_votes":1,"down_votes":0,"body":"Yeah its most likely that. However, it would be cool if they actually used extremely advanced technology. To the people living in mount targon the floating city might be magical or mystical but  remember any technology we have nowadays would seem like sorcery or godly powers to those living in the 19th century.","replies":[]}]}]}