{"poster":"LeagueOfReportss","date":"2018-11-22T05:24:37.141+0000","title":"Era plata III y ahora soy plata V","subforum":"Charlas Generales","up_votes":1,"down_votes":16,"body":"https://ibb.co/mcrAeq\r\n\r\nno se si seguire jugando mucha gente troll","replies":[{"poster":"I Pray 4 TomDrop","date":"2018-11-22T05:38:16.434+0000","up_votes":7,"down_votes":0,"body":"tapas el score porque moris 15 veces en cada partida?","replies":[{"poster":"MelgaM","date":"2018-11-22T05:52:56.569+0000","up_votes":2,"down_votes":0,"body":"No olvidemos de esas 3 partidas donde termino sin objetos.","replies":[]}]},{"poster":"Adenak","date":"2018-11-22T05:52:38.850+0000","up_votes":3,"down_votes":0,"body":"Sacaste los stats pero te olvidaste sacar el rango que sacaste en las partidas:\nC, D, D, C jaja\n\nya sabes par ala prox sacar eso tambien antes de quejarte del troleo.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"MelgaM","date":"2018-11-22T05:52:27.870+0000","up_votes":3,"down_votes":0,"body":"http://las.op.gg/summoner/userName=LeagueOfReportss\n\nHmm, que raro, en cuatro partidas te moriste como mas de 10 veces y en 3 de esas terminas sin ningun objeto ~~debe ser obra de los trolls~~\n\nChamigo, ahora en serio, veo que en las partidas sos el que mas moris, y que terminas vendiendo tus objetos, no se, eso capaz que me dice que te quedas afk (no digo que lo hagas, solo digo que pienso que sea eso).\n\nEn cualquier caso, si te estresa mucho el juego por los \"\"\"\"\"trolls\"\"\"\"\", ponete a jugar a otra cosa hasta que estees mas relajado y/o descansa, y al dia siguiente, volve a jugar mas tranquilo.","replies":[{"poster":"LeagueOfReportss","date":"2018-11-22T15:03:23.256+0000","up_votes":1,"down_votes":2,"body":"siemprevendo todo antes de terminar para que no vean mis builds","replies":[{"poster":"MelgaM","date":"2018-11-22T20:19:19.257+0000","up_votes":2,"down_votes":0,"body":"Pues si ese es el caso, es inutil.\n\nEn op.gg podes ver el historial de lo que se estuvo comprando el jugador, a si que cualquier vivo que use ese sitio web, puede entrar y ver tu build sin problemas. (Creo que en League of graphs se puede hacer lo mismo).","replies":[]}]}]},{"poster":"Fransoi ","date":"2018-11-22T11:09:07.379+0000","up_votes":2,"down_votes":0,"body":"yo en plata 2 jugué 3 en una noche en 1 a mi mid le tiraron torre al 8 deseando al otro mid a no más poder intente rotas pero ya nos morimos los 2 en la otra mi jg murió al minuto 5 contra el otro jg puso GG y se rajo afk aguantamos la partida 30 minutos con el seguro la ganamos pero no la podíamos permitir y se alargó 5 ve 4 fue GG -_- y en la última mi botlane fedeo hasta en 6 minutos 6/0 creo el otro adC y  primera torre al minuto 6 y me bajaron a plata 3 lrpm xD","replies":[]},{"poster":"Jota312","date":"2018-11-22T05:27:13.759+0000","up_votes":2,"down_votes":0,"body":"Juega al ajedrez , ahí no te trollea tu team .","replies":[]},{"poster":"Tur1nTur4mb4r ","date":"2018-11-22T15:21:49.752+0000","up_votes":1,"down_votes":0,"body":"Si a mi me paso lo mismo eh!!! Después me di cuenta que yo también era parte del problema, me ganaban en línea, farmeaba mal, no rotaba, etc. Y si quede en plata 3 y baje a 5 porque no supe jugar como debía","replies":[]},{"poster":"ghost134","date":"2018-11-22T11:53:58.325+0000","up_votes":1,"down_votes":1,"body":"Y si tambien te fijas en lo que haces mal vos tambien ?","replies":[]}]}