{"poster":"ZashUn","date":"2015-07-15T12:48:45.259+0000","title":"Platin 1 Team sucht neuen Jungler!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey ihr Teamsuchenden!\r\n\r\nWir suchen einen neuen Jungler f&uuml;r unser 5 vs 5 Team, da unser alter Jungler auf msyteri&ouml;se Weise nicht mehr da ist. Unser Ziel ist Diamant im 5 gegen 5 sowie eine gute/solide Leistung bei einigen Cups und nat&uuml;rlich die stetige Verbesserung unserer Spielweise. Um noch etwas zur Atmosph&auml;re zu sagen: Wir sind eine lustige Truppe die sehr viel Spa&szlig; hat aber w&auml;hrend der Spiele sind wir auf die Spiele fokussiert.\r\n\r\n**Was wir von euch erwarten: **\r\n-Solo Q Elo von min. Platin 3 (je h&ouml;her desto besser)\r\n-TS 3\r\n-ein verst&auml;ndliches Headset/Mikrofon\r\n-ihr solltet viel &uuml;ber die Rolle des Junglers wissen und auch dementsprechend mit der Meta vertraut sein \r\n-mindestens 17 Jahre alt sein (wir sind 18-19 Jahre alt)\r\n-Kritikf&auml;higkeit ist von Vorteil, da wir nach schlechten Aktionen/Entscheidungen, diese nochmal durchsprechen\r\n-Verf&uuml;gbarkeit au&szlig;erhalb von LoL (Facebook, Whatsapp, etc.) w&auml;re auch von Vorteil, um andere zu informieren, falls man mal nicht an einem Training teilnehmen kann\r\n\r\nUnsere bisherigen Trainingstage waren Dienstag und Donnerstag von 19 Uhr (nach Absprache auch fr&uuml;her m&ouml;glich) bis 22 Uhr. Am Sonntag haben wir meistens an Cups mitgespielt oder nachmittags nach Absprache noch ein paar Runden gespielt (ab ca. 15 Uhr mit open end).\r\n\r\nMitglieder des Teams sind:\r\nSneakyaidsrakete / Toplane / Platin 2\r\nRise Again / Midlane / Dia 5\r\nVayneTopGG / ADC / Platin 1\r\nZashUn / Support / Platin 1\r\n\r\nFalls Interesse besteht schreibt entweder in diesem Thread oder added mich bei LoL unter dem Namen &quot;ZashUn&quot;. Ich hoffe ich konnte euer Interesse wecken und m&ouml;chte mich noch kurz entschuldigen falls etwas undeutlich geschrieben wurde, Rekrutierungsthreads sind nicht meine St&auml;rke ;)","replies":[]}