{"poster":"Lady Yunalesca","date":"2015-09-18T23:54:48.816+0000","title":"Biete mich als mentor für Supporter an~","subforum":"Level Up: Guides & Tipps","up_votes":3,"down_votes":2,"body":"Hall&ouml;chen und an die Community,\r\nIch hab das Angebot schon &ouml;fter mal reingestellt und bisher ziemlich gute Erfahrungen gemacht und viele Erfolge gesehen ! :3\r\n\r\nEs richtet sich hier diesmal gr&ouml;&szlig;tenteils nur an Supporter (oder z.B auch an pre-made Bots) im Bronze bis High-gold Bereich.\r\nIch denke ich k&ouml;nnte auch bei low-plat noch viele Fehler in Replays finden,aber ich lasse das ganze mal hier so stehen.^^\r\n\r\nKurz zu mir :\r\nBin momentan Platin 3-was immer mal schwankt,da ich eher unregelm&auml;&szlig;ig SoloQ spiele.\r\nIch bin nat&uuml;rlich Main-Support und das schon seitdem ich vor 2 Jahren angefangen habe (:\r\nMit Platin 3 bin ich definitiv nicht High-Elo und mache selbst noch mehr als genug Fehler,vor allem liegt meine Schw&auml;che eher in den Mechanics - Im theoretischen bin ich ganz gut unterwegs,weshalb ich auch sehr gerne Coaching mache~\r\n\r\nMeine Main-champs auf denen Ich mich am wohlsten f&uuml;hle sind (in dieser Reihenfolge)\r\n{{champion:40}} {{champion:267}} {{champion:117}} {{champion:16}} {{champion:89}} {{champion:37}} \r\nWobei ich mit janna,Nami und Lulu die meisten spiele hab.Dass ich diese hier am meisten Spiele,hei&szlig;t aber nicht,dass ich euch zu den anderen nichts sagen k&ouml;nnte,mir pers&ouml;nlich liegen nur die Peel-supporter etwas mehr~\r\n\r\n{{item:3340}} Mit welchen Dingen k&ouml;nnen wir uns denn so besch&auml;ftigen, mh?\r\n\r\n\r\n-Runen und Masteries,Summoner-spells (Must-Haves,champ-spezifisch,situatives)\r\n-Itembuilds (mit wem kaufe ich was,wann und warum)\r\n-Warding (effizientes Warding/Wardspots,Timing,Trinkets)\r\n-Laningphase (Positioning,Trading,was f&uuml;r eine Rolle hat mein Champ auf der Lane)\r\n- Matchups (dazu geh&ouml;rt Grundwissen &uuml;ber alle Supporter und auch adcs,Begriffserl&auml;uterung Kill,-poke,- und Sustain-Lane)\r\n- Teamfights (#Hilfe wo ist mein ADC?/Positioning,Aufgaben/Focus)\r\n-Champion-in-depth guides\r\n-SoloQ tipps (Roamen,Teamcomps etc)\r\n- ich hab eine relativ gro&szlig;e Sammlung an hilfreichen videoguides von yt zusammengesammelt,geb ich dann gerne als hausaufgabe auf sich die anzuschauen ;)\r\n\r\n{{item:3340}} Gr&ouml;&szlig;tenteils wird das ganze so ablaufen,dass ihr die Spiele aufnehmt (z.b mit Baronreplay) und wir das ganze dann zusammen anschauen und auswerten.\r\nWenn ihr einen guten Pc habt,k&ouml;nnt ihr das ganze aber auch live streamen,ansonsten braucht ihr eigentlich nur teamspeak oder zumindest skype.\r\n\r\n\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n{{item:3340}} Dieses Angebot richtet sich an Leute,die ernsthaftes Interesse haben sich langfristig zu verbessern und akzeptieren,dass sie nun mal Fehler machen .\r\nich hab schon zu oft mit Personen zu tun hatten,die gecoached werden wollten,aber die ganze zeit nur jammern weil sie ja selbst so gut spielen und ihre teams halt immer schei&szlig;e. Also Geheule &uuml;ber die Elo k&ouml;nnt ihr euch bei mir sparen,denn ich bin der Meinung,dass jeder genau in der Elo stecken bleibt,in die er auch geh&ouml;rt.\r\n\r\nAber wenn euch was dran liegt und ihr Spa&szlig; am Spiel habt,Kritik einstecken k&ouml;nnt,dann bin ich immer gerne am helfen\r\nWenn ihr Bock habt,added mich einfach ingame und schreibt mir auch bitte,dass ihr euch wegen des Forums-posts meldet \r\n\r\nBisher hatten sich immer viele gemeldet,daher habt bitte Verst&auml;ndnis,wenn ich auch nicht immer zeit habe \r\n\r\nBin gespannt wer sich diesmal meldet :)\r\nLg Franzi\r\nNami used bubble","replies":[{"poster":"M4ster Yi","date":"2015-09-28T07:57:02.998+0000","up_votes":1,"down_votes":0,"body":"Uhn bin Dia V würde gerne paar grundlegende Sachen. Und auf soraka/janna lernen komm wir da was machen ? ( bin selbst Main adc)","replies":[]},{"poster":"Night Lead","date":"2015-09-28T07:17:24.432+0000","up_votes":1,"down_votes":0,"body":"Super Coaching, hab einiges gelernt sehr zu empfehlen der sich als Support verbessern will.","replies":[]},{"poster":"Fennylicious","date":"2015-09-23T21:02:27.016+0000","up_votes":1,"down_votes":0,"body":"Fenny will auch :3\nFenny ist ein Main Supp.\nWas ich am besten finde ist dein Champion Pool, weil meiner eher in Richtung Tank Dudes geht: Nauti-sama, Ali, Braum, teilweise Shen. Und ich möchte auch gerne Pieler können, besonders: Lulu und Nami. \nMeine höchste Winrate liegt mit Nautilus bei 64%\nIch add dich morgen mal. \n-LG Fenny","replies":[]},{"poster":"DerEintreiBaer","date":"2015-09-23T15:04:45.752+0000","up_votes":1,"down_votes":0,"body":"Hey :)\nhabe dich auch mal geaddet. \nbin leider gerade unterwegs sonst würde ich hier alles etwas ausführlicher schreiben :P\nDanke! :)","replies":[]},{"poster":"Night Lead","date":"2015-09-23T07:11:24.519+0000","up_votes":1,"down_votes":0,"body":"Guten Morgen,\n\nmein Pre-Made ADC haben ein großes Interesse von dir gecoacht zu werden.Wir haben noch eininge Fehler und im Theoretischen sind wir leider nicht so gut aufgestellt. Wir sind beide im Silberbereich.\nIch werde dich, wenn es für dich inordnung ist, heute abend anschreiben.\n\nLG\n\nCris aka Night Lead","replies":[]},{"poster":"Celesil","date":"2015-09-19T19:23:43.490+0000","up_votes":1,"down_votes":0,"body":"Moin,\n\nich hätte auch großes Interesse, wenn jemand mit mir mal die Replays durchgeht und mir meine Fehler eindeutig aufzeigt und erklärt bzw. versucht zu erklären wie ich es hätte besser machen können.\n\nSo wirklich weiß ich mir nicht zu helfen, seit ich gestern in Silber III gesteckt worden bin.\n\nGrüße\n\nCele","replies":[]},{"poster":"Anticodon","date":"2015-09-19T13:36:10.077+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nich finde es super, dass du dich zur Verfügung stellst und deine Zeit in den Dienst der Community stellen möchtest.\n\nWas ich dir zusätzlich zu deinem Thread empfehlen kann, ist das von den Emissaries organisierte\nNew Player Mentoring Programm.\nhttp://boards.euw.leagueoflegends.com/de/c/level-up-guides-tipps-de/jtPj1EXf-new-player-mentoring\n\nDort können sich Neulinge (also lvl 1-29) anmelden, die nach einem Mentoren suchen, \nder Ihnen hilft die steile League of Legends - Lernkurve gemeinsam zu erklimmen.\n\nÜber das Formular dort kann man sich nicht nur als Neuling, sondern auch als Mentor anmelden.\n\nVielleicht wäre das ja was für dich?\n\nAnsonsten wünsche ich dir schon einmal viel Spaß & Glück mit deinem Vorhaben ;-)\n\n\nlg Anticodon","replies":[]},{"poster":"Bemte","date":"2015-09-19T09:31:03.590+0000","up_votes":1,"down_votes":0,"body":"Ich hab auch Interesse. Meine aktuelle Lieblingsrolle ist zwar eher der Jungle, aber da ich harmonisches Spielen (jaja, in Bronze ist das ein guter Witz^^) schätze, erkläre ich mich meist bereit Supp zu machen, damit es zu keinem Streit schon vor dem Spielbeginn kommt.\nIch bin der Meinung ich kenne mich recht gut mit Wardingspots aus (kann aber auch sein, dass ich grauenhaften Müll warde^^). Mein Hauptproblem ist: wie halte ich einen ADC, der im schlimmsten Fall nicht MainADC ist sondern auch nur in die Rolle gedrängt wurde gegen (im schlimmsten Fall) Premade-Bot am Leben oder wie können wir das vllt. sogar gewinnen?\nMeine Supps sind:\n{{champion:40}} {{champion:1}} {{champion:25}} {{champion:16}}, wobei ich dazu sagen muss, dass ich Annie und Soraka bisher kaum gespielt habe, da ich mich nach meinem ADC richte und der meist Janna oder Morgana haben möchte...\nSupprunen hab ich keine, ich verwende eine Art AP-Seite (aber auch noch nicht komplett ausgebaut^^) - wie gesagt stecke ich meine IP aktuell eher in Junglerkram. :)\nWas hier noch etwas unschön ist (in meinen Augen): es ist kein tanky Support dabei. Das heißt wenn ich mal nur einen Fehler mache, bin ich tot - und ich kann auch nicht der Teamtank sein, wenn die Toplane mal wieder FullAD Irelia oder Riven nimmt und der Jungle FullAD Yi.^^\nIch hab gehört Alistair soll es kostenlos geben, wenn man irgendwas liked - aber ich hab auch gehört, dass der recht schwer zu spielen ist.\nWenn du einen Tipp hast, welcher tanky Support sinnvoll ist für jemanden, der eigentlich aktuell eher andere Rollen spielt, dann immer her damit (und wenn der nicht gerade 6300 kostet um so besser :) ).\nAh, und der Vollständigkeit halber noch: Supp ist meine absolute Lieblingsrolle - wenn ich einen guten ADC habe. Dann macht mir das Warden, das Unterstützen, das Gegner stunnen damit er sie killen kann,... richtig Spaß. Leider passiert es wie oben beschrieben viel zu oft, dass der ADC halt nicht so gut ist - und hier ist dann mein Hauptproblem: wie halte ich einen ADC am Leben, der einfach die ganze Zeit reingeht und stirbt?\nJaja, ich weiß, ich schreib zu viel - ich adde dich glaub ich einfach mal. :)","replies":[]},{"poster":"Fabulous Support","date":"2015-09-19T05:06:12.216+0000","up_votes":1,"down_votes":0,"body":"Hätte Interesse ich bin Bronze 3 und Main Sup ich glaube ich mache immer noch viele Fehler und würde mich freuen wenn du mir Hilfst.","replies":[]},{"poster":"MacDeath","date":"2015-09-19T00:09:45.310+0000","up_votes":1,"down_votes":0,"body":"Ich! Ich! Ich! ^^\n\nWobei ich ehrlich gesagt auch mehr weiß als ich tu >_>\nist manchmal echt tagesformabhängig","replies":[{"poster":"Lady Yunalesca","date":"2015-09-19T00:51:14.397+0000","up_votes":1,"down_votes":0,"body":"adde mich einfach,bin jetzt zwar erstmal nicht mehr online bis ca. 19 Uhr oder so,aber boogie ~","replies":[{"poster":"MacDeath","date":"2015-09-19T00:55:43.556+0000","up_votes":1,"down_votes":0,"body":"sure ding","replies":[]}]}]}]}