{"poster":"Imaqtone","date":"2016-07-30T01:35:41.368+0000","title":"Spielen auf der Toplane carrien","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hallo,\r\n\r\nAlso folgendes Problem:\r\n\r\nBin von Gold V auf Silber 1 gedropt.\r\nAus dem Grund heraus, dass ich das Spiel einfach nicht carrien kann. In der Laningphase ist alles recht gut, sehr oft gewinne  ich die Lane. Doch dann verliere ich die Kontrolle des Spiels. Mein Problem ist es, dass ich nicht wei&szlig;, wie ich mein Vorteil aus der Lane mitnehme. Somit falle ich weiter ab, bis dann der gegnerische Toplaner mir gegen&uuml;ber ahead ist. ( so ab der 20 min im Regelfall.) Das hat dann zur Folge, dass ich ineffizient bin und somit wenig Schaden oder Pressure hab.  Ebenfalls wei&szlig; ich nicht genau, wie ich mich im Teamfight verhalten soll und was ich wann machen sollte. ( Wann pushe ich die Lane und wann folge ich meinem Lanegegner, wenn er die Lane verl&auml;sst, oder wann gehe ich Mitte, wann Ping ich Drake, wann Force ich einen Fight etc.)\r\nMein Champion Pool:\r\nSehr gut bis gut:\r\n\r\nIrelia \r\nGankplank\r\nGnar \r\nRenekton\r\nTrundle\r\n\r\nGut bis naja:\r\n\r\nRumble\r\nFiora\r\nJax\r\nMaokai\r\nDarius \r\n\r\n\r\nIch w&auml;re jedem dankbar, der sich Zeit nimmt, mir bei meinem Problem zu helfen. Ebenfalls w&uuml;rde ich mich ggf. &uuml;ber ein Coaching auch freuen.","replies":[{"poster":"Delicious Yogurt","date":"2016-07-30T06:48:11.441+0000","up_votes":3,"down_votes":0,"body":"Ich bin Diamond Jungler, ich kenne dein Problem. Oft Smurf ich in Gold-Platin. Sehe hier immer wieder das selbe Problem .. jede Lane gewinnt aber plötzlich als die Laningphse over ist rennen alle solo über die Map, der Toplaner pushed viel zu tief, der Support rennt allein auf die Botlane während der ADC in die Mitte läuft und mit dem Midlaner um die Wette farmed. \n\nAls Toplaner, musst du dich darauf konzentrieren was dein Team so anstellt. Du kannst zum Beispiel weiter pushen, musst dabei aber wissen, dass du jetzt die Aufmerksamkeit des gegnerischen junglers und eventuell auch midlaners auf dich ziehst. (Wards wards wards). Dein Team hat den Profit, das nun andere Lanes sicherer spielen können, oder der jungler den drake machen kann wenn der gegner top ist. usw.\n\nDes weiteren hast du die möglichkeit, zu frezzen. Der gegner hat keinen tower mehr, hat also ordentlich weg zurück zu legen um save zu sein. ruf deinen jungler er wird dir helfen den gegner zu töten (save) und dann macht ihr den herold. Danach solltest du zum ersten punkt zurück gehen, denn der gegner wird mehr als 1 spieler brauchen um dich am pushen zu hindern.\n\n3 Möglichkeit ist es einfach raus zu pushen Bot zu rotieren oder durch TP Gank. Nehmt auf der Lane so viele Objectives wie möglich mit. Danach den Drake ggf. gegnerischen jungle leer räumen. rotiert midlane und nehmt da den turm. wenn ihr schnell genug seid bleibt dem gegner keine zeit zum reagieren und ihr habt unmengen an gloabal gold und pressure in kurzer zeit geschaffen.\n\nAdd mich doch einfach falls du noch anderen Fragen hast.\n\nDelicious Yogurt","replies":[]},{"poster":"SeaHorseCalamity","date":"2016-07-30T11:16:08.726+0000","up_votes":1,"down_votes":0,"body":"Wenn du die Toplane gewinnst kannst du ordentlich Druck auf der Toplane aufbauen.\nKauf dir nen Ward, und Pushe. Solange du es schaffst ohne zu sterben Druck aufzubauen hat dein Team einen ernormen Vorteil.\nWenn sie zu Zweit oder zu Dritt kommen kann dein Team nen Vorteil daraus ziehen. Wenn sie nicht vorbeischauen kannst du einen Turm nach dem Anderen hauen und evtl ein wenig counterjunglen.\nMit TP kann man wunderbar Teamfights joinen, wenn dein Gegner mal nicht auf der Lane ist um dich zu stoppen.\n\nIm Prinzip: Mach Objectives, bau Druck auf der Lane auf und sie zu, dass dein Team die Kämpfe nicht zu hart verliert.\nDas schlimmste was du mache kannst ist ziellos durch die Gegend zu stolzieren, denn dadurch verliert du XP, Gold und bekommst nichts. -> Vorteil weg","replies":[]},{"poster":"SF Pride","date":"2016-07-30T08:17:39.746+0000","up_votes":1,"down_votes":0,"body":"Da jedes Spiel individuell ist kann man dir nicht wirklich Tipps geben, die auf jedes Game passen. Ich würde dir einfach Raten weiterhin Rankeds zu spielen. Dadurch erkennst du früher oder später deine Fehler selbst, und meidest die dann automatisch. Das funktioniert viel besser, als irgendwelche Tipps von anderen Leuten umsetzen zu wollen. Auch wenn du mit dieser Methode in Silver 2 ~ Gold 5 bleiben wirst bis du deine Fehler erkennst, finde ich das es die effektivste ist.","replies":[]},{"poster":"C10Delta","date":"2016-07-30T04:33:02.994+0000","up_votes":1,"down_votes":0,"body":"Also ich bin in der Elo jetzt nichtbesser als du aber da man als Top La er besonders mit Jax, Irelia, Trundle und Fiora viel Splitousht verlässt man relativ selten die Lane und Tp't dann zum richtigen Zeitpunkt zum Teamfight.\n\nWenn du selbst nicht weißt wann man Drake, Baron oder Herald bzw Türme machen sollte lässt du das am besten die anderen das machen.\nDadurch kannst du in dem fall nichts falsch machen und nicht geflammt werden xD.\nIch hoffe ich konnte dir mit meinem bisschen Wissen helfen und wünsche dir viel Erflog;)\n\nMit freundlichen Grüßen \n\nDelta","replies":[]}]}