{"poster":"NocPat","date":"2014-11-20T04:03:06.820+0000","title":"ADCs might have become optional","subforum":"[ARCHIVED] General Discussion","embed":{"description":null,"url":"http://i.imgur.com/9pSm52M.png","image":"/api/embedly/1/image/resize?url=http://imgur.com/9pSm52Ms.png&key=a45e967db0914c7fb472fd4381e6c85b&width=425"},"up_votes":8,"down_votes":8,"body":"I'm not sure yet, but based on my experience in the PBE, and correctly seeing the details/numbers from the patch notes, I feel ADCs can finally become a *choice* and not a *requirement.*\n\nThere were a multitude of reasons why you HAD to pick an ADC/support lane to have the highest chances of succeeding:\n\n1. Quick and safe tower killing by siege.\n2. Late game extreme (safe) DPS.\n3. Safe laning phase. (easy CSing, easy escapes)\n4. Powerful laning phase.\n5. Dragon control by early presence and Baron control by late game DPS.\n\nThe combination of all these traits were why they were so needed. ADC/Support combo had all these qualities, and no other champion combination had all of them, there was one or a few missing.\nKill lanes only had 4 and 5.\nSplit pushers were usually missing 2 and 5.\nMages usually had 3 or 4 traits, but had an extremely potent drawback, usually lack of safety or only burst, no dps. (usually struggling with CSing or safety) \n\nWith the new objective and pushing changes, as well as the increased base stats and much more impactful mid game across the board, the list becomes more accessible to other champions and combos.\n\nThe biggest factor is that #1 is removed completely. A team that focuses on pushing that doesn't have an ADC, will completely outpush a standard meta team not prepared to push. Literally any champion can become good at taking down towers with the baron and item changes. ADCs will still be good at taking down towers, but not any better than other champions.\nThe new push options will also reward very aggressive early play so significantly, that ADCs will be too weak around the 20-30 minute mark to do anything about it. An ADC might be a liability in the early-mid game if the meta shifts correctly, but stay completely relevant in the late game.\n\n\\#2 stays the same. No questions asked. Might be slightly easier to kill/dive them.\n\n\\#3 is the same unless kill lanes become popular. Jungers will not gank that early, so there's more leeway to have a solid early game for ADCs.\n\n\\#4. With the boosts to stats on melee champions, they **MIGHT ** be able to finally handle ADCs in lane. If melees manage to do this, or any odd combo of champions can consistently beat/stay even vs an ADC/support, this can completely shift the meta into all in early/midgame. Before, ADC/Support is UNBEATABLE. If you beat them as a kill lane before, they'll come back and outscale you because you couldn't take enough objectives early. Now, there might be the possibility to consistently win the game before it gets to that point, and also offer backup strats by way of minion boosters and towerdiving.\n\n\\#5 is about the same. ADCs get less benefit from dragon early, and it seems that the scuttlecrab can replace the support's job of river vision control. Not sure how this will pan out.\n\n\nWe'll see what happens in the long run. I truly feel heavy push-based/objective control comps will dominate the meta, or at least provide a viable alternative strategy. It'll break my heart if ADC/Support turns out to be the best option in those comps as well.\n\n\nKeep an open mind friends, and experiment!","replies":[]}