{"poster":"o  FLOKI  o","date":"2018-11-16T14:22:27.724+0000","title":"Cuando me dan el marco de la división que quede?","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"Ya termino la temporada y y quede en Oro V , pasan los d&iacute;as y aun no tengo mi marco. Alguien sabe cuando?","replies":[{"poster":"Kromur","date":"2018-11-16T14:25:32.595+0000","up_votes":1,"down_votes":0,"body":"Hola! \n\nLas recompensas aún están siendo repartidas, lo más tardar el 12 de Diciembre todo el mundo debería de tenerlas! (siempre y cuando cumplas con las condiciones para ello claro ^^\")","replies":[{"poster":"Hasthy","date":"2018-11-16T14:58:23.714+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"WitchAgmar","date":"2018-11-16T16:06:11.162+0000","up_votes":1,"down_votes":0,"body":"Si habrá marco en la pre-temporada cuando se entreguen en la del 19 de Noviembre al 12 de Diciembre como dijo mi compañero Kromur. Lo demás si está correcto.","replies":[]},{"poster":"KnifeX","date":"2018-11-16T15:11:17.380+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hasthy,realm=LAS,application-id=v7qsfXsE,discussion-id=EAxNBiG3,comment-id=00000000,timestamp=2018-11-16T14:58:23.714+0000)\n>\n> Cabe destacar señor agente del Soporte que el Marco de Liga ya no hace parte del paquete de recompensas. En la temporada 2019 los marcos van a ser actualizables a medida que juegues, y no la representacion de tu liga en el año anterior. El nuevo marco consta de dos partes, una que mostrará tu liga actual mientras juegues en la Season 9, y un emblema que mostrará tu liga el año anterior.\n> \n> Imagen de ejemplo del nuevo marco y emblema. [Link](https://imgur.com/a/ezHZYHB)\n> Imagen de todos los marcos de todas las ligas. [Link2](https://2.bp.blogspot.com/-WHMyxmc7LXc/W9n182CHkcI/AAAAAAABJ-k/z4SopGeuxEgVR0LUfyKNS21wCI_ObrqOwCLcBGAs/s1600/Dev_RankBorders-min_ptv8l21r384e834nvzm5.png)\n> \n> Así que no deberias esperar obtener un marco de recompensa o FLOKI o , pero si darle mucha dedicacion en las rankeds a partir de la nueva temporada para tener un marco que te represente.\n> \n> Edit: Algun dia voy a trabajar en el Soporte de Riot. Me lo dicen todos mis amigos a tal punto que se convirtió en una meta para mi.\n\nEs correcto lo que dices, pero igualmente el marco viejo va a estar disponible en la pretemporada hasta que inicie la nueva en 2019. A eso se debe referir Floki.","replies":[]},{"poster":"Nabuze","date":"2018-11-16T15:29:40.808+0000","up_votes":1,"down_votes":0,"body":"Si eras platino y quedaste en diamante en pretemporada vas a tener el marco de diamante hasta que empiece la nueva season.\nLa respuesta del soporte es correcta.","replies":[]}]}]},{"poster":"Mascheranox","date":"2018-11-16T15:10:07.869+0000","up_votes":1,"down_votes":0,"body":"Entra al soporte ahi hay un cartel que dice a partir del 20","replies":[]}]}