{"poster":"Ezequiel Rose","date":"2018-03-30T03:09:54.194+0000","title":"Evento de guerra de comida sin el panadero! (Pantheon olvidado a más no poder, llamado a Buffs)","subforum":"Jugabilidad, balance y narrativa","up_votes":6,"down_votes":2,"body":"Soy el &uacute;nico que se indigna por el trato de Riot hacia Pantheon? encima de que lo tienen abandonado, le nerfean el draktharr{{item:3147}} , y poner la mayoria de champs que le dan pelea m&aacute;s op, NO APARECE EN UN EVENTO DE COMIDA! es simplemente triste.\r\n\r\n\r\nPor qu&eacute; Riot nunca le da un respiro a nuestro lancero favorito, o buffearle a E para que haga reduccion de movimiento de 40% en el area de ataque *siempre pens&eacute; en esa idea, pues sin ella, la e es una asquerosidad, y desde la 8.1 que su q ya no es una v&iacute;a muy segura de hacer da&ntilde;o* o de &uacute;ltima, que su w tenga un poquito m&aacute;s de cc, como para terminar haciendo 2 golpes de E siquiera.\r\n\r\n\r\nPodr&iacute;an intentar darle algunos cambios al campe&oacute;n, ya que a menos que haga su snowball perfectamente, despues de que use su w, o que le hagan cc, el ya esta mirandote haciendo un &quot;oh, shit&quot;{{champion:80}} \r\n\r\nPantheon lo puede todo, tiene mi apoyo siendo mi &uacute;nico champ con maestr&iacute;a jaja.\r\nsaludos gente, dejen ideas para pantheon , a ver si Riot le da una mano ya que se qued&oacute; bien atr&aacute;s mientras est&aacute;n &quot;perfeccionando&quot; a Kai&#039; sa.{{sticker:slayer-pantheon-popcorn}} \r\n\r\nSaludos gente. Buenas Noches.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Šeiya","date":"2018-03-30T03:26:31.159+0000","up_votes":4,"down_votes":0,"body":"Pantheon está bien, no necesita nada, personaje situacional super abusivo que existe para arruinarle la linea a cualquier champion de late que ose firstpickear.","replies":[{"poster":"Ezequiel Rose","date":"2018-03-30T03:33:27.269+0000","up_votes":1,"down_votes":2,"body":"No, ni creas, que aunque tenga tremendo early, hay campeones que pueden hacertela dificil si no jugas bien jajaja.\nun asesino a básicos tipo yi, yasuo, o incluso un zed (no es a básicos, pero se lleva puesta la pasiva de pantheon con la q, y si q con w ni te digo)","replies":[{"poster":"Šeiya","date":"2018-03-30T03:39:56.907+0000","up_votes":1,"down_votes":0,"body":"? \nAmigo... Yi y Yasuo haciéndosela difícil a Pantheon? De qué me estás hablando? xD\nPantheon esta hecho para destrozar a este tipo de champions.","replies":[{"poster":"Ezequiel Rose","date":"2018-03-30T03:42:29.813+0000","up_votes":1,"down_votes":0,"body":"imaginate un yi que usa su q despues de tu w, o un yasuo que sabe moverse (admito que el yasuo si que hay que ser medio medio para no ganarle, pero cabe la posibilidad, lo tiré como ejemplo)","replies":[]}]}]}]},{"poster":"EsciIa","date":"2018-03-30T03:44:38.509+0000","up_votes":1,"down_votes":0,"body":"Yo creo que deberían hacer que la pasiva de la e crezca cuando la sube de nivel, algo leve como que pegue criticos con 25% de la  vida del ene migo en late, esto escalaria conforme aumenta la habilidad,  2% de vida extra por nivel de la E y ademas darle reducción de daño a panth cuando tire la W, 10 /20/30/40/50 respectivamente, a cambio le subiria un  poco el cd de la W.\n\nPor  cierto, panth stompea facilisimo a Yasuo o Yi.","replies":[{"poster":"Ezequiel Rose","date":"2018-03-30T03:49:27.235+0000","up_votes":1,"down_votes":0,"body":"Jajaja, ya entendí que dije una estupidez con lo de yi y yasuo, perdón.\npero tu idea es genial, lo dejaría muy op en comparación a la actual {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"EsciIa","date":"2018-03-30T15:44:33.405+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ezequiel Rose,realm=LAS,application-id=xQmJPO8F,discussion-id=nGBQ9UBg,comment-id=00020000,timestamp=2018-03-30T03:49:27.235+0000)\n>\n> Jajaja, ya entendí que dije una estupidez con lo de yi y yasuo, perdón.\n> pero tu idea es genial, lo dejaría muy op en comparación a la actual {{sticker:slayer-pantheon-thumbs}}\n\nClaro, fue lo unico que se me ocurrio como para darle un late algo mas fuerte sin tocarle el early, el problema vendria en si se feedea mucho y alcanza ese late muy rapido, tambien se me ocurrio quitarle daño base a sus skills en late pero agregarle escalado (solo en late) porque con la reduccion de daño de la w quizas sacartead en early y tank en late seria muy op.","replies":[]}]}]},{"poster":"Tortuguita","date":"2018-03-30T08:05:32.115+0000","up_votes":1,"down_votes":0,"body":"Jeje tenes que buffear a la mitad de los useless top para hacerle frente a los Meta tanks ahora mismo.","replies":[]},{"poster":"EsciIa","date":"2018-03-30T03:11:09.508+0000","up_votes":1,"down_votes":0,"body":"El tema de pantheon es que es abusivisimos en los primeros niveles, y un buffo puede llevar a que quede muy op en early, ahora, sincerramente, un buff al mid y/o late game es necesario totalmente.","replies":[{"poster":"Ezequiel Rose","date":"2018-03-30T03:14:46.963+0000","up_votes":1,"down_votes":0,"body":"Podrían bajarle la vida en un 50, o 60. para que tenga más ojo en lo que hace en early, pero que escale más en late para estar al nivel de los demás. yo estuve nivel 18 con full build, y me mataban fácilmente si me agarraban desprevenido, sumale la huída pobre que tiene :c\nsu mid es bastante bueno, en lo que creo es donde más puede relucir pantheon si se hace bien, o donde empieza a decaer.","replies":[]}]}]}