{"poster":"IDeerU","date":"2018-01-13T12:50:39.243+0000","title":"real life und community","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Hallo alle zusammen,\r\nin meinem Studium sprechen wir &uuml;ber Online Spiele und die Auswikrungen auf das Real Life.\r\nViele meiner Kommilitonen haben, im Gegensatz zu mir, &uuml;berhaupt keine Ahnung von Spielen generell und was es bedeutet Spa&szlig; daran zu haben.\r\nMerkt ihr irgendwie, dass sich das Spiel auf euer echtes Leben auswirkt? Oder was macht das Spielen von LoL f&uuml;r euch zu etwas besonderem. Was macht euch daran so viel Spa&szlig;?\r\nIch w&uuml;rde mich freuen ein paar Eindr&uuml;cke von euch sammeln zu k&ouml;nnen um meinen Mitstudierenden mal einen Einblick in so eine Community wie diese geben zu k&ouml;nnen.\r\n&Uuml;ber ein paar Antworten w&uuml;rde ich mich sehr freuen. :)","replies":[{"poster":"Zyzyx","date":"2018-01-13T16:06:32.248+0000","up_votes":3,"down_votes":0,"body":"Kommt drauf an auf welche Art von Auswirkung du hinaus willst. Klar kostet Gaming Zeit, die man halt nicht für was anderes investiert. Aber das gilt auch für alle anderen Aktivitäten. \nFür mich persönlich hat sich Gaming und League insbesondere sehr positiv auf mein RL ausgewirkt. Ich habe sehr viele Leute kennengelernt mit denen ich täglich rede und die ich auch so oft wie möglich treffe, trotz der geographischen Entfernung. Außerdem hab ich durch League und meine Aktivitäten in der Community viel gelernt, ich habe mich persönlich sehr geändert und weiter entwickelt und ich habe meinen momentanen Job (Community Manager), mit dem ich sehr glücklich bin, durch diese Erfahrung bekommen. \nWie mein Leben ohne Gaming verlaufen wäre weiß ich natürlich nicht. Wäre bestimmt auch okay gewesen...aber rückblickend betrachtet kann ich sagen: Ich bereue nichts und bin sehr gerne Gamer und bewerte den Einfluss  auf mich persönlich im RL als sehr positiv.","replies":[]},{"poster":"Dr Madscientist","date":"2018-01-13T16:14:50.825+0000","up_votes":2,"down_votes":0,"body":"Ich arbeite vollzeit in Schichtdienst, in der regel 12 Tage am stück...manchmal mehr, wenn personal knapp ist.\nEs ist unmöglich Ein reales Leben zu haben bei solchen Arbeitszeiten. Es ist quasi unmöglich meine Zeitplanung und den meines Freundes und Bekanntenkreis irgendwie auf einen Nenner zu bringen.\nGaming ist da quasi die einzige Alternative. Wenn ich tatsächlich mal Freizeit habe, kann ich jeder Zeit ein oder zwei runden spielen und wenn Kumpels online sind, kann man das sogar spontan zusammen machen.","replies":[]},{"poster":"DrunkenRedPanda","date":"2018-01-13T15:47:48.866+0000","up_votes":3,"down_votes":2,"body":"ja, ich reagiere mittlerweile nur noch mit \"lul report fgt\" wenn ich kritisiert werde. bin mir unsicher ob es wirklih an LoL liegt","replies":[]},{"poster":"Kind Prow","date":"2018-01-13T21:20:59.242+0000","up_votes":1,"down_votes":0,"body":"Das Online Gaming an sich hat sich nicht viel auf mein Reallife ausgewirkt. Die größeren Wellen haben die Bekanntschaften geschlagen, die ich durch League gefunden habe. Ohne das hätte ich vermutlich nie meine eloquente Seite entdeckt und ausgelebt, das positive Feedback hat mir sehr viel Selbstvertrauen gegeben und mir damit auch im RL geholfen, zufriedener zu leben und mit neuem Mut Dinge zu machen, die ich mich nie getraut hätte. Ich habe durch League indirekt einige sehr nette Leute kennengelernt, die ich heute nicht missen wöllte. Daher +1 auf Onlinegaming.","replies":[]}]}