{"poster":"Ogdru Jahad","date":"2016-10-01T22:20:34.461+0000","title":"¿ Como reporto a alguien por eloboost? ¿reportar  al final de la partida sirve en estos casos?","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":1,"body":"&uacute;ltima partida que jugue ranked, en el team enemigo hab&iacute;a un lucian que se fedeo rid&iacute;culamente, siendo jax trate de matarlo pero siempre quedaba a poca vida y hu&iacute;a o me mataba, en una ocasi&oacute;n le dije que me la jug&oacute; bien y me respondi&oacute; &quot;no te sientas mal, esta no es mi cuenta&quot;, termino la partida nos ganaron solo por &Eacute;L y al terminar veo su historial y ten&iacute;a partidas en ranked scores rid&iacute;culos 35/10/8, 17/3/6 etc, obviamente estaba boosteando esa cuenta (adem&aacute;s que ten&iacute;a otro tipo con el en todas las rankeds que tambi&eacute;n estaba siendo boosteado al jugar en duo), me parece injusto y a pesar que lo reporte al final de la partida se que riot no hara nada","replies":[{"poster":"Auren Seven","date":"2016-10-02T00:02:55.268+0000","up_votes":2,"down_votes":0,"body":"Me paso lo mismo hace unos meses, me enfrente a un mid demaciado bueno para el elo en el que estaba(Oro). Se fedeo, mas de lo normal... bueno me puse a investigarlo despues de la partida y efectivamente estaba boosteando. Era muy notorio, hize un tema como vos en que la mayoria me comento que mandara un ticket al soporte pero bueno ahi tampoco hay una opcion clara para este tipo de casos asi que quedo en la nada lamentablemente. Riot no hace nada en este tipo de casos...","replies":[]},{"poster":"TSM BlackRaven","date":"2016-10-01T23:11:11.211+0000","up_votes":1,"down_votes":0,"body":"Si, la verdad eso es muy frustrante... arruina todo el modo \"competitivo\" porque andan smurfeando etc, pero lastimamente no veo a futuro que riot haga algo, pero bueno, tendremos que comernos las derrotas asi. saludos","replies":[{"poster":"Ogdru Jahad","date":"2016-10-06T10:15:59.077+0000","up_votes":1,"down_votes":0,"body":"es diferente que tu seas bueno y que smurfees una cuenta nueva. a tomar la cuenta de otro y jugar con ella boosteando el elo de esa cuenta.","replies":[]}]},{"poster":"Kanan","date":"2016-10-02T02:26:48.213+0000","up_votes":1,"down_votes":0,"body":"Acabo de ver tu ultima ranked y el lucian termino 19/4 y vos 6/8 y tambien el historial del lucian y de smurf no tiene nada el lucian ese si en realidad fuera smurf tendria un fajin con todo el ap de tu team :v solo tuvo suerte papu al fin y al cabo es un lucian","replies":[{"poster":"Ogdru Jahad","date":"2016-10-06T10:12:42.101+0000","up_votes":1,"down_votes":0,"body":"pero si viste el historial  hay 5 o 6 partidas con escores ultra inflados, además el mismo me dijo \"no es mi cuenta\", jugar en una cuenta smurf es diferente a eloboostear una cuenta que no es tuya.","replies":[]}]},{"poster":"chÍkorita","date":"2016-10-03T16:58:54.766+0000","up_votes":1,"down_votes":0,"body":"una palabra \" dinamyc q y smurfs\"","replies":[{"poster":"Ogdru Jahad","date":"2016-10-06T10:11:10.030+0000","up_votes":1,"down_votes":0,"body":"no era su cuenta, si fuera smurf lo entiendo pero no era su propia cuenta, jugaba con la cuenta de alguien más y se nota cuando son smurfs porque pasan de divisiones rápidamente con pocas partidas, este tipo tenia partidas con scores normales al elo en que estaba y luego una seguidilla de juegos con scores inflados.","replies":[]}]}]}