{"poster":"ServidorBIN","date":"2016-11-16T09:41:48.271+0000","title":"Me bajaron de Plata 1 a Bronce 1","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Bueno la historia es as&iacute;, ya jugu&eacute; las 10 partida clasificatorias flex las cual gane 7 de 10 y me posicionaron en plata 1 ,ahora que vuelvo a jugar la partida adicional, que gane, resulta que me re posicionan a bronce 1 ,por cierto en la temp pasada era plata 3. No se si alguien me puede explicar como funciona el nuevo sistema que hicieron en cuanto al posicionamiento","replies":[{"poster":"oO Xeneize Oo","date":"2016-11-16T09:43:39.852+0000","up_votes":2,"down_votes":0,"body":"yo si... es una estafa y en un rato furchi te pone un link con su post inservible como viene haciendo hace horas\n\nsaludos","replies":[{"poster":"rokushoger","date":"2016-11-16T10:51:36.577+0000","up_votes":1,"down_votes":0,"body":"Ya le gané yo en eso esta vez XD. Por otro lado, el post tiene la respuesta que él busca, podrá no gustarle pero la tiene.","replies":[{"poster":"exrex","date":"2016-11-16T11:20:41.225+0000","up_votes":1,"down_votes":0,"body":"La respuesta se la debe los rioters, no un usuario...","replies":[{"poster":"rokushoger","date":"2016-11-16T14:57:58.009+0000","up_votes":1,"down_votes":0,"body":"La respuesta viene de haber preguntado nosotros mismos y por eso lo transmitimos, si dudas de nuestra función, podes fijarte [acá](http://boards.las.leagueoflegends.com/es/c/charlas-generales/W6FprJAe-info-nuevos-colores-para-los-nombres-en-el-foro-avoluntarios-soporte-y-moderadores) que es lo que hacemos, que no es más que tratar de ayudarlos a ustedes.","replies":[{"poster":"exrex","date":"2016-11-16T15:44:05.686+0000","up_votes":1,"down_votes":0,"body":"No los ayudas, los confundis. Los usuarios que frecuentan el foro son muy poquitos con respecto a la poblacion total del servidor de LAS. La gente no viene a buscarlos a ustedes y no les importa que hacen ustedes, quieren que un rioter les de una respuesta oficial, y no que los atienda un usuario comun que no puede contestar mas alla de la interpretación de lo que le dijo un rioter por privado.\n\nLa verdad no me gustaria pensar que este fue el unico server en donde la respuesa oficial viene de un voluntario, que es lo que estan dando a entender espameando el post de furchi.\n\nLo correcto seria mandarlos a este link.\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/5u4GHqNi-actualizacian-sobre-las-clasificatorias-de-pretemporada\n\nYa hay muchos post sobre lo mismo y encima los voluntarios crearon un post cada uno sobre lo que entendieron de ese mensaje, despues se quejan de que los repost tapan otros temas pero ustedes terminan haciendo lo mismo. Ya que estan en contacto, por lo menos traten de organizarse para ser mas prolijos.","replies":[{"poster":"rokushoger","date":"2016-11-16T17:16:25.087+0000","up_votes":1,"down_votes":0,"body":"Mirá, la verdad tu opinión me importa bien poco. Este post lo hizo uno de nuestros compañeros y al menos yo creí bueno hacerlo circular para que la gente esté informada del asunto, no te gusta? no lo leas.\n\nNo tengo obligación de hacer nada, más que la obligación moral que tenemos todos los que participamos del foro de entregar una información veraz. El post que le puse es veraz, así que no cometí ninguna falta.\n\nPlus a eso, si tenías el link, porque no lo compartiste de una en vez criticar a otro? que aporte el tuyo! Y luego juzgas a otros?\n\nMirá que porque sea voluntario no tengo pelos en la lengua, y la verdad que tu actitud me molesta, porque resta en vez de sumar.\n\nAdemás, y por último, si el tipo hizo este post es porque o no vió el otro, o no le dio satisfacción esa respuesta, y bien, si no lo vió, este post le informa lo mismo pero resumido, y si lo vió, al menos acá tiene otra respuesta formulada diferente, pero claro, en lugar de pensar un motivo, es más fácil criticar lo que hace el otro no?","replies":[{"poster":"exrex","date":"2016-11-16T18:18:29.059+0000","up_votes":1,"down_votes":0,"body":"No se donde ves el resumen, de un párrafo se armo un post con 7 párrafos... \n\nSi ya hay un post armado con la respuesta de un rioter en donde los usuarios pueden comentar, no entiendo la necesidad de que cada voluntario arme su post para desparramar preguntas por todo el foro que despues no van a poder contestar, y que provoca que los usuarios los llenen de negativos, genere rechazo hacia ustedes y se sigan quejando sobre el mismo tema... \n\nNo aceptas criticas, como acabas de decir, los usuarios te importa poco y nada, pero aun asi decis que queres ayudarlos. Estan tan desesperados por resaltar que ya piensan que es mejor lo que dicen ustedes que los rioters. \nLes hace falta un baldazo de agua fria.","replies":[{"poster":"Hwaxinghz","date":"2016-11-16T20:40:51.564+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=exrex,realm=LAS,application-id=v7qsfXsE,discussion-id=b28zps32,comment-id=0000000000000000000000000000,timestamp=2016-11-16T18:18:29.059+0000)\n>Estan tan desesperados por resaltar que ya piensan que es mejor lo que dicen ustedes que los rioters. \n> Les hace falta un baldazo de agua fria.\n\nNunca nadie dijo que es mejor lo que decimos nosotros que los Rioters, el hecho de que nosotros resaltemos no quiere decir que seamos superiores, solo es un rango en el foro que se nos otorgó por ayudar a la gente. Antes ayudábamos mucho también, en el antiguo foro yo también aporte (de hecho bastante).\n\nTodos y cada uno de los Amarillos somos VOLUNTARIOS, ayudantes que estamos siempre en el foro compartiendo opiniones, quitando dudas y dando consejos, no somos superiores a NADIE simplemente es un resalte para que puedan ver \"a lo mejor\" algunas cosas interesantes. En el fondo cada uno de nosotros somos jugadores exactamente igual que ustedes, no tenemos ningún beneficio \"físico\" o \"ingame\" (rp o algo), el único beneficio que tengo yo es sentirme bien conmigo mismo, porque me gusta ayudar a la gente.\n\nEl único que necesita un Baldazo de agua fría acá sos vos para bajar los Humos. No creas lo que andan diciendo por ahí.\n\nAmarillos: Voluntarios\nVerdes: Moderadores\nRojos: Administradores\n\n¿Alguna duda con respecto a ESO?","replies":[]},{"poster":"rokushoger","date":"2016-11-16T19:00:29.641+0000","up_votes":1,"down_votes":0,"body":"> como acabas de decir, los usuarios te importa poco y nada\n\nNo te confundas, dije que tu opinión particularmente no me interesa, porque es la opinión de una persona que vino a criticar y nada más, porque como te dije, tenías el link y ni siquiera fuiste capaz de responderle.\n\n> de un párrafo se armo un post con 7 párrafos... \n\nFijate bien el link que vos mismo compartis por favor, donde ves un solo parrafo ahí?\n\n> la necesidad\n\nNo es necesidad, simplemente a todos se nos ocurrió la misma idea de divulgar esta información importante al mismo tiempo, y yo particularmente vi el de furchi antes de hacer el mío y por eso compartía el de él. \nEs querer ayudar y nada más.\n\n> No aceptas criticas\n\nAcepto críticas constructivas, no las acepto cuando A) vienen sin fundamentos, B) se plantean de forma agresiva, C) vienen de alguien que por su actitud no es ejemplo.\n\n> Estan tan desesperados por resaltar que ya piensan que es mejor lo que dicen ustedes que los rioters.\n\nLo que hago lo hice siempre, podes ver mi actividad en el foro si lo dudas, mucho antes de ser amarillito, de hecho vengo desde el foro viejo participando. La única diferencia es que ahora las personas que no saben con quien agarrarselas como vos me ven mejor porque resalto en amarillito, pero como dije, que no te confunda el colorcito, yo sigo haciendo lo mismo de siempre, y no tengo pelos en la lengua si tengo que ir tanto contra un usuario que no conoce modales como vos, como contra riot si se manda alguna, como de hecho ya dejé claro en múltiples post.\n\nAsi que antes de acusar a alguien de alguna cosa, trae pruebas que te respalden y dejá de tirar mala onda.","replies":[{"poster":"exrex","date":"2016-11-16T20:03:23.239+0000","up_votes":1,"down_votes":0,"body":"Pero vos te pensas que los modales se trata de tirarte flores? \"oh gran rokushoger, permitame darle a conocer mi humilde opinion sobre el maravilloso post del señor furchi, espero no se ofenda gran señor por hablarle directamente\"\nPero a quien te comiste? \n\nNo encontras fundamentos cuando las criticas no te gustan, Si no, no seguirias con la excusa de que divulgaban informacion, porque lo que hacian era espamear sus post. \n\nNi siquiera leiste el post de riot condor y despues quieren hacer un post hablando sobre eso, por favor, cada se pone peor esto, Fijate bien en donde dice \"14 de noviembre\" y conta cuantos parrafos son. \n\nSi es que de verdad tenian la necesidad de ayudar, hubiesen copiado y pegado el parrafo de Riot Condor en vez de andar poniendo los links de sus post. Y encima ni contestan a los usuarios que fueron a preguntar a los post de esos voluntarios. \n\nY ya que te interesa tanto que yo no haya compartido el link te digo que yo no tengo ninguna obligación de hacerlo y tampoco asumi esa responsabilidad. No te gusta mi actitud, pero yo no soy ando pidiendo que me cambien de color el nick para sentirme motivado para ayudar y despues decir que soy igual a los demas y que no asumi ninguna responsabilidad.","replies":[{"poster":"rokushoger","date":"2016-11-16T20:10:25.140+0000","up_votes":1,"down_votes":0,"body":"Yo no le pedí a nadie el cambio de nick, de hecho, me avisaron por acá por el foro que abriera el mail que tenía la invitación. Tanto te pica eso que lo volvés a remarcar en cada respuesta? Sabés que? Me niego a seguir perdiendo tiempo en contestarte, obviamente por alguna razón estás resentido con alguien y te la agarras conmigo, y noticia de último momento! ni soy riot, ni pertenezco, ni quiero pertencer, y por lo tanto, si no te gusta algo, no rompas a mí. Bye suerte.","replies":[]}]}]}]}]}]}]},{"poster":"Excorpion","date":"2016-11-16T20:17:01.522+0000","up_votes":1,"down_votes":0,"body":"Hace rato me pediste crear un flood de respuestas... ahora lo descalificas ?","replies":[]}]}]}]},{"poster":"TheSexyBith","date":"2016-11-16T11:52:59.326+0000","up_votes":1,"down_votes":0,"body":"lamentablemente decia claramente que no importaba cuantas ganases en las 10 primeras tenias que empezar a subir una liga menos que en la que terminaste la s6  pero eso era al comenzar la temporada... no en la pretemporada ....  terminaron haciendo cualquier cosa asi que mejor ni juegues flexibles si no quieres perder tiempo o saves que no vas a  llegar  muy lejos porque al inicio de la s7 las primeras 10 rankeds te dejaran denuevo una liga abajo \n**Podrás jugar algunas partidas de calibrado en la cola flexible de la Grieta o del Bosque durante la pretemporada, pero seguiremos ejecutando ese reinicio leve de clasificatorias cuando comience la temporada.**","replies":[]},{"poster":"JesúsMeCarrea","date":"2016-11-16T11:27:09.123+0000","up_votes":1,"down_votes":0,"body":"leel, la season pasada me bajaron de platino 5 a plata 1 xd quede 4/6 :v","replies":[]},{"poster":"rokushoger","date":"2016-11-16T10:50:01.106+0000","up_votes":1,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/charlas-generales/sV0TEEEb-por-que-te-bajaron-de-divisionliga-en-ranked-respuesta","replies":[]},{"poster":"Rapperrr","date":"2016-11-16T10:23:44.474+0000","up_votes":1,"down_votes":0,"body":"La gente que pone cosas \"subi si mereces subir vas a subir\" es porque claramente no jugaron las 10 de posicionamiento todavia y los que jugamos mas de 20/30 partidas ya te cae peor.","replies":[]},{"poster":"9081913DEL1","date":"2016-11-16T10:14:50.191+0000","up_votes":1,"down_votes":0,"body":"Mira si te preocupa tanto tu liga, juga y subi.\n\nVi 4000 post iguales, yo que vos me preocuparia si te dejan diamante, porque cuando se acomoden los elos no ganas una y vas a ser un troll. Si te dejaron bronce tenes todas las chances de llegar a plata rapidisimo. \n\nRiot no deberia buscarle tantas vueltas son colas distintas, ni siquiera deberian tener en cuenta si fuiste plata en la cola duo. Pero bueno es lo que hay siempre contentando a la mayoria bronce/plata.\n\nLo unico cierto es que si sos plata, oro, lo que sea jugando vas a salir de bronce en un dia o dos.\n\nSaludos.","replies":[{"poster":"exrex","date":"2016-11-16T10:22:13.251+0000","up_votes":1,"down_votes":0,"body":"Tenes que entender un poco tambien, algunos se jugaron como 20 para encontrarse despues que tienen que jugar otras 40 para volver a subir. Para la mayoria no es nada facil y encontrarse con estas cosas enoja.","replies":[{"poster":"9081913DEL1","date":"2016-11-16T10:35:39.311+0000","up_votes":1,"down_votes":1,"body":"Tenes toda la razon.\n\nYo lo veo desde mi lado, es decir, ranked en las se ve de una forma rara. \nLa idea de ranked es mostrar tu nivel de jugador. No es la idea subir por subir, tampoco llegar lo mas alto posible, o Ganar por ganar.\nLa idea es ser mejor jugador, desafiarse. \nPero repito tenes razon, la mayoria rankea como si fuera obligatorio salir de bronce, con otro concepto. Ni se molestan en practicar nada y esperan subir por spamear partidas.\n\nTener que jugar de nuevo puede ser muy molesto, pero hasta que mejores tu habilidad vas a quedar en tu elo asi juegues 4000 partidas. Es ambiguo pero es cierto. Lo he probado y muchos duos subidos a diamante vuelven a platino o incluso menos.\nAsique en realidad no estas perdiendo tiempo.\n\nAhora desde el otro lado hay algo que es cierto, con todo esto riot les dio la ilusion de logro alcanzado a muchos que no lo merecian y ahora al arrancar mas atras les toca las p......... Pero bueno van a llegar es cuestion de constancia.\n\nSaludos.","replies":[]}]}]}]}