{"poster":"Zeckyx","date":"2018-04-06T11:37:01.609+0000","title":"Plädoyer an Riot und die Community","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":6,"body":"Zun&auml;chst einmal vorraus gestellt:\r\n\r\nDieser Text sollte eigentlich per Supportticket raus - das lies dieses allerdings nicht zu - schde.\r\nDas geh&ouml;rt eigentlich in den Forenteil &quot;Spielerverhalten&quot; nur leider darf ich da augenscheinlich nicht posten. - nicht weniger schade\r\nLeider wurde er dann in dem Forum wo ich Posten d&uuml;rfte erstmal wieder gel&ouml;scht - h&auml;tte man denke ich auch einfach verschieben k&ouml;nnen - ein Schelm wer denkt dass ungew&uuml;nschte Themen lieber unter den Tosch gekehrt werden.\r\n\r\n\r\nAn das Riot Team (ich hoffe das wird zumindest gelesen), aber zum Teil nat&uuml;rlich auch an die Community hier.\r\n\r\nLiebes Riot Team,\r\n\r\nzun&auml;chst einmal Vorraus, ich wei&szlig; es ist schwer zu verhindern, dass sich erfahrene Spieler mehrere Accounts machen.\r\nAllerdings musste ich in den letzten Spielen feststellen, dass man als neuer Spieler, zum Teil einfach aus Unerfahrenheit, zum Teil da die Gegner einfach &uuml;berm&auml;chtig sind kaum eine Chance hat. Des f&uuml;hrt sehr h&auml;ufig dazu, dass man von (Teilen) des eigenen Teams verbal stark angegriffen wird - teilweise sogar einfach daf&uuml;r, kein Smurf zu sein. Dies zu melden mag teilweise diese Spieler vertreiben doch hilft es auf Dauer kaum. Auch wenn ich sehr viel Spass in vielen Partien habe so komme ich doch jedesmal zu einem Punkt, wo mir die &quot;Anfeinungen&quot; zu stark werden und ich damit das Spielen aufgebe.\r\nGegen Bots zu spielen um zu &Uuml;ben stellt auch keine L&ouml;sung da, da diese nach kurzer Zeit leicht zu besiegen sind.\r\nLeider f&uuml;rchte ich dass sich dieser Zustand erst &auml;ndert, wenn es mir m&ouml;glich ist Ranked Games zu spielen - was doch etwas paradox ist. Ich weiss nicht ob ich bis dahin die Lust habe dabei zu bleiben.\r\nAls Betriebwirt weiss ich nat&uuml;rlich, dass am Ende auch andere Dinge z&auml;hlen, doch zumindest f&uuml;r mcih pers&ouml;nlich kann ich sagen, dass ich aufgrund der dauerhaften Unsicherheit ob ich weiterspielen werde mich scheue geld f&uuml;r das Spiel auszugeben auch wenn ich das grundss&auml;tzlich gern t&auml;te.\r\n\r\nIch bin mir sicher ich stehe mit diesen Erfahrungen nicht alleine da und auch, dass euer entwicklerteam f&auml;hig genug ist sich zu dieser Problematik noch neue L&ouml;sungen einfallen zu lassen.\r\n\r\nVielen Dank f&uuml;r Ihre Zeit.\r\n\r\n&Uuml;ber eine R&uuml;ckantwort w&uuml;rde ich mich sehr freuen.\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\nZecky\r\n\r\nPSan die Community: All die die gern ihre Teamkameraden flamen w&auml;hrend sie als smurf unterwegs sind, denkt doch einmal daran dass ihr das macht um einfachere Gegner zu bekommen, da d&uuml;rft ihr euch dann aber auch nicht wundern wenn ihr schw&auml;chere Kameraden zugelost bekommt. Denkt auch daran, dass diese eventuell einem Gegner gene&uuml;berstehen der einen Champion spielt, den sie gar nicht kennen und/oder der einfach unheimlich viel erfahrener ist als sie selbst.\r\n\r\nZum Schluss: ich f&uuml;rchte dieser Text wird nichts ver&auml;ndern, allerdings war es mir ein Anliegen ihn doch noch irgendwie zu ver&ouml;ffentlichen.","replies":[{"poster":"Stichsaege","date":"2018-04-06T13:12:31.834+0000","up_votes":1,"down_votes":9,"body":"> [{quoted}](name=Zeckyx,realm=EUW,application-id=KYnfKGf0,discussion-id=sFdIkEcn,comment-id=,timestamp=2018-04-06T11:37:01.609+0000)\n>\nAls Betriebswirt weiss ich natürlich, dass am Ende auch andere Dinge zählen, doch zumindest für mich persönlich kann ich sagen, dass ich aufgrund der dauerhaften Unsicherheit ob ich weiterspielen werde mich scheue Geld für das Spiel auszugeben auch wenn ich das grundsätzlich gern täte.\n\nDas ist mit ein Vorteil von Smurfs für Riot.\nSmurfs sind meist erfahren Spieler, bei den diese Unsicherheit nicht da ist und Sie somit wesentlich ehr bereit sind auch auf diesen Acc Geld zu investieren.\nDer andere ist diese Spieler an LoL weiter zu binden, ihnen die Möglichkeit zugeben Frust an anderen, Schwächen aufzulassen.\n\nGlaub mir, bei Riot wirst du mit so etwas nicht erreichen .\nIch habe es über mehr als 1 Jahr versucht, mit den Ergebnis das Riot ich lange Zeit keine Kontakt mit den supp aufnehmen konnte, Ich konnte nicht mal mich beim Supp einlogen.\nDu wirst von Riot nur kören das Smurfs schnell aufsteigen und dass das System Smurf schnell erkenn und nur gegen andere Smurfst match.","replies":[{"poster":"Noxempire","date":"2018-04-06T15:14:34.316+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stichsaege,realm=EUW,application-id=KYnfKGf0,discussion-id=sFdIkEcn,comment-id=0002,timestamp=2018-04-06T13:12:31.834+0000)\n>\n> Du wirst von Riot nur kören das Smurfs schnell aufsteigen und dass das System Smurf schnell erkenn und nur gegen andere Smurfst match.\n>\n\nUnd mehr können sie auch nicht machen. Man kann eben nicht verhindern das Leute smurfen. \n(Und nein, IP Bans sind keine Lösung und würden nicht funktionieren)","replies":[{"poster":"Stichsaege","date":"2018-04-06T16:00:56.531+0000","up_votes":1,"down_votes":4,"body":"Das stimmt.\n\nAber man kann es unterstrafe stellen.\n\nMan kann auch nicht verhindern das Autos gestohlen werden, soll man es deswegen jetzt legalisieren ?","replies":[{"poster":"Lotuskobra","date":"2018-04-06T17:17:55.868+0000","up_votes":2,"down_votes":0,"body":"Der Vergleich ist ein bisschen verquert, da wir ja nicht über etwas reden, dass schon verboten ist. Passender wäre:\n\nDu darfst nur ein Auto kaufen und es auf dich zulassen (könnte man anhand vom Umwelt-, Klima- und Rohstoffdebatten ja zumindest eher verstehen). Allerdings trifft dann das ein, was ich beschrieben hab:\n\nDu musst in der Lage sein, jedem diese Accounts zuzuordnen und genau da scheitert das Ganze. Es gibt keine Kennung der genauen juristischen Person, die mit Riot einen Vertag eingeht, da es keine Personaldokumente braucht, um sich einen Account zu erstellen. Wie also soll man das Ganze überwachen?\n\nMit der IP? Fehlanzeige, die lässt sich zu einfach umgehen, zudem haben 2 Spieler in einem Haus oder im schlimmsten Fall am gleichen PC die gleiche IP, das geht also nicht...","replies":[{"poster":"Stichsaege","date":"2018-04-06T18:41:58.032+0000","up_votes":1,"down_votes":4,"body":"Nein, der Vergleich ist richtig.\n\n> [{quoted}](name=Noxempire,realm=EUW,application-id=KYnfKGf0,discussion-id=sFdIkEcn,comment-id=00020000,timestamp=2018-04-06T15:14:34.316+0000)\n>\n> Und mehr können sie auch nicht machen. Man kann eben nicht verhindern das Leute smurfen. \n> (Und nein, IP Bans sind keine Lösung und würden nicht funktionieren)\n\nEr sagt das man Smurfing nicht verbieten kann weil, man nicht verhindern kann das Leute Smurfen.\n\nWie  gesagt man kann auch nicht verhindern das Leute Autos klauen. Das wäre dann die  Begründung warum man es erlauben musste.","replies":[{"poster":"Lotuskobra","date":"2018-04-06T19:13:00.460+0000","up_votes":2,"down_votes":0,"body":"> Nein, der Vergleich ist richtig.\n\nNein, ist er nicht, da smurfen nicht seit dem Beginn von League of Legends verboten ist. Es steht jedem frei, einen zweiten Account zu erstellen, eben weil es nicht in die Rechte anderer (bezogen auf die AGB) eingreift, bzw. das Eigentum eines anderen schändigt oder entwendet.\n\nWenn ich ein Auto stehle, entwende ich Eigentum eines anderen. Wenn ich ein zweites Auto zulasse, habe ich nichts weiter getan, als mir ein zweites Auto zu besorgen. Ob ich nun am Straßenverkehr mit meinem ersten oder zweiten Auto oder mit meinem 400sten teilnehem, ist vollkommen unerheblich.\n\nWir haben diese Unterhaltung schon X-mal geführt, du hast selbst vom Support schon X-mal dazu Auskunft bekommen, ich hab dir dazu geraten, das Thema zu \"Frag Riot\" oder zur Rechtsabteilung zu schicken, du hast mit Sirraks darüber geredet und ich sehe keinen Grund dieses Thema hier weiter auszubügeln.\n\nFakt ist – und dem kannst du dich entziehen, wie du möchtest:\n\n1. Laut Riot AGB sind Smurf nicht verboten – noch nicht.\n2. Gibt es in LoL keine Möglichkeit die genaue Person hinter einem Account festzustellen, da es keine Regelung gibt, an der man diese erkennt.\n3. Kann man dieses Problem nur angehen, wenn man für alle bestehenden Mehrfachaccounts von Spielern eine angemessene Lösung findet, um deren Accounts zu verschmelzen. Viele haben jahrelang auf ihren Smurfs geld investiert, in dem Wissen, nicht gegen die geltenden AGB zu verstoßen, diese müsste Riot alle befrieden, wenn sie ein System einführen wollen, das das Smurfen unterbindet.","replies":[{"poster":"Stichsaege","date":"2018-04-06T20:04:38.071+0000","up_votes":1,"down_votes":3,"body":"Es geht nicht darum ob es verboten ist oder nicht, Es geht um Seine Begründung warum man Smurfs nicht verbieten kann.\n\nZitat:  Man kann eben nicht verhindern das Leute smurfen.\n\nDas ist Sein Argument warum Smrfing Legal ist und man es nicht unter Strafe stellen kann.","replies":[{"poster":"Lotuskobra","date":"2018-04-06T20:51:38.034+0000","up_votes":1,"down_votes":0,"body":"Das macht doch aber deinen Vergleich nicht besser...\n\nJa die Begründung an der Stelle ist zu kurz von seiner Seite. Aber deine Schlussfolgerung ist es auch. Ja, man kann weder verhindern, dass Autos geklaut werden, noch das sich Menschen einen Smurf erstellen.\n\nIch kann aber auch behaupten:\n\nMan kann nicht verhindern, dass Menschen Eis essen, so wie man nicht verhindern kann, dass ein Mensch einen anderen tötet, warum ist nicht beides verboten? Dein Vergleich bezieht sich auf Äpfel und Birnen, da du eine Straftat mit einem legalen Vertragsumstand vergleichst.\n\nAn dieser Stelle bin ich einfach mal so frei und zitiere mich selbst, abschließend mit einer Frage, wenn du mir die nicht beantworten kannst oder willst, müssen wir die Diskussion zumindest von meiner Seite nicht führen, da sich daran alles aufhängt.\n\n> 1. Laut Riot AGB sind Smurf nicht verboten – noch nicht. (Den Punkt kann man theoretisch ändern)\n> 2. Gibt es in LoL keine Möglichkeit die genaue Person hinter einem Account festzustellen, da es keine Regelung gibt, an der man diese erkennt.\n> 3. Kann man dieses Problem nur angehen, wenn man für alle bestehenden Mehrfachaccounts von Spielern eine angemessene Lösung findet, um deren Accounts zu verschmelzen. Viele haben jahrelang auf ihren Smurfs geld investiert, in dem Wissen, nicht gegen die geltenden AGB zu verstoßen, diese müsste Riot alle befrieden, wenn sie ein System einführen wollen, das das Smurfen unterbindet.\n\nWie willst du das lösen ohne die Datenschutzrichtlinien in Deutschland und der EU zu verletzen und wie soll eine ausreichende Befriedung von Multiaccountnutzern aussehen?","replies":[{"poster":"Stichsaege","date":"2018-04-06T21:20:48.282+0000","up_votes":1,"down_votes":5,"body":"1. Ändre, in Smurfs sind Verboten.\n\n3. Acc verschmelzen, nach Anmeldung bei Riot. ( Smurfs sind der Zeit laut AGB nur in Bot Games oder Mit 9 Freunden die wissen das es ein Smurf ist  erlaubt ) \n\n2. Strafen unmenschlich hoch machen, damit es sich nicht lohnt auch wenn die Chance erwischt zu werden gering ist.\n\n\nJa, man kann weder verhindern, dass Autos geklaut werden, noch das sich Menschen einen Smurf erstellen.\nDas ist Falsch. Es kommt nur auf die höhe der Stafe an.\n\nBusticke 1€\nBein Schwarzfahren erwischt zu werden 40€\nChance erwischt zu werden 1%\n\nDa wäre es billiger bei 100 Fahrten einmal die 40€ Strafe zu zahlen.\n\nBusticke 1€\nBein Schwarzfahren erwischt zu werden 400000€\nChance erwischt zu werden 1%\n\nNiemand würde Schwarzfahren ( OK fast Niemand ).","replies":[{"poster":"Lotuskobra","date":"2018-04-06T21:25:40.893+0000","up_votes":1,"down_votes":0,"body":"> Wie willst du das lösen ohne die Datenschutzrichtlinien in Deutschland und der EU zu verletzen und wie soll eine ausreichende Befriedung von Multiaccountnutzern aussehen?","replies":[{"poster":"Stichsaege","date":"2018-04-06T21:39:23.270+0000","up_votes":1,"down_votes":6,"body":"Jeder der ein Smurf hat meldet sich bei Riot und sagt welche der Main ist ( mit Passwort ) und welche die Smurf sind mit Passwort. So kenn Riot alle Acc einer Person und kann Sie zu ein Acc zusammenfassen.\nNach darf dann jeder nur noch ein Acc haben.\n\nZu dem gibt es Möglichkeiten um sicher zu stellen das man nur 1 Acc besitzen kann.\n\nZ.b ein Gamercard wie die ESL Playercard desen Code man dann bei 100 alle Onlin Games angeben muss. Wer betrügt dessen Card wird gesperrt und so verhindern das Du jemalss in den Leben wieder ein Online Spiel spielen kannst.","replies":[{"poster":"Awsane","date":"2018-04-07T19:13:37.609+0000","up_votes":1,"down_votes":0,"body":"Ich frage mal hier ganz dreist mal unabhängig von den Finanziellen folgen für Riot (weil ich denke das würde so viele Verdrängen, dass es allein deswegen schon nicht gemacht wird)\n\nob das überhaupt mit der Aktuellen Rechtssprechung konform geht.\nDarf Riot überhaupt wenn sie es wollen würden unsere Persönlichen Daten erfragen? Also nach dem Motto, du sagst uns wer du bist oder du darfst das Spiel nicht spielen. Stichwort Datenschutz und Anonymität des Internets. Weil wenn nicht bringt die Diskussion ja nix.","replies":[{"poster":"Stichsaege","date":"2018-04-08T09:21:41.788+0000","up_votes":1,"down_votes":2,"body":"Finanziellen folgen für Riot :\n\nSicher  gibt es die, Ich würde behaupten dass wenn Riot nichts durch Smurfs verdiene würde, durch weiter Skins und den halten der High Elo Spieler gäbe es schon lange kein legalen Smurfs mehr.\n\nDatenschutz : Das kommt doch jetzt ehr, Jeder Bürger soll selber über seine Daten bestimmen . Also du kommest rein wenn ich die Daten bekomme, wenn nicht bleibst du draußen.\n\nAber: bei Alkohol, Ü18 Games habt Ihr keine Probleme damit euren Perso zu zeigen ?\ndes wegen die Card, man müsste nur einmal den Perso zeigen um einen Code bekommen, der bei fehlverhalten dann gesperrt werden kann und somit Ihr nicht nur von einen Game sondern von allen gebannt werdet.","replies":[{"poster":"Lotuskobra","date":"2018-04-08T14:18:09.557+0000","up_votes":3,"down_votes":0,"body":"In Deutschland gibt es im Unterschied zu anderen europäischen Ländern ein gesetzliches Verbot eines Klarnamenszwangs.\n\nKlarnamenszwang:\n\nKlarnamenszwang bedeutet, dass man als Kommunikationsteilnehmer gezwungen wird, seine wahre Identität preiszugeben.\n\nSie steht im engen Zusammenhang mit dem Recht auf Pseudonymität im Internet.\n\nIn Deutschland existiert mit § 13 VI Telemediengesetz eine Vorschrift, die einen Klarnamenszwang bei Telemedien verbietet, wenn dies technisch möglich und zumutbar ist.\n\nDie Vorschrift lautet:\n\n„Der Diensteanbieter hat die Nutzung von Telemedien und ihre Bezahlung anonym oder unter Pseudonym zu ermöglichen, soweit dies technisch möglich und zumutbar ist. Der Nutzer ist über diese Möglichkeit zu informieren.“[1]\n\nDie Vorschrift fügt sich harmonisch in das bestehende Datenschutzrecht und das Grundgesetz ein, denn sie versucht durch Befolgung der gesetzlichen Gebote der Datensparsamkeit und Datenvermeidung (§ 3a BDSG[2]) dem Grundrecht auf Meinungsäußerungsfreiheit (Artikel 5 I Grundgesetz[3]) zur praktischen Durchsetzung zu verhelfen. Eine Beschränkung der Meinungsäußerungsfreiheit auf Äußerungen, die einem bestimmten Individuum zugeordnet werden können, ist mit Art. 5 Abs. 1 Satz 1 GG nicht vereinbar.","replies":[]},{"poster":"GotDjentleman","date":"2018-04-08T12:38:42.043+0000","up_votes":2,"down_votes":0,"body":"> How can I get a Trusted ESL Playercard?\n\n> [...]First you enter some data (name, last name, nickname, address, photo, date of birth). This is only visible to certain employees of Turtle Entertainment GmbH – not ESL admins. [...]\n\nhttps://play.eslgaming.com/playercard_portal/information/\n\nSprich ich gebe die Daten von meinen Großeltern an und habe schon 4 Karten? Die niemand außerhalb von Tunieren wirklich überprüft. Klingt ja total sicher und Weltbewegend, dein Vorschlag.","replies":[]},{"poster":"Lotuskobra","date":"2018-04-09T21:07:28.747+0000","up_votes":2,"down_votes":0,"body":"> Wie man es kontolieren, umsetzten,bestrafen kann will ich nicht wissen.\n\n**Aber genau an der Frage hängt sich doch alles auf!** Wenn es keinen rechtlich legalen Weg gibt es zu bestrafen/zu kontrollieren, wie will man es dann unterbinden?\n\nDein Problem hier im Forum liegt an deinen Formulierungen:\n\nSobald du sagst:\n\nSmurfing ist illegal – meinst du eigentlich: \"Nach meiner Auffassung ist es unfair, sollte nicht möglich sein und muss verboten werden, da es die Spielbalance ruiniert!\"\n\nDas sagt dein Satz aber nicht aus. Dein Satz präsentiert einen Fakt, der von anderen als Diskussionsgrundlage genommen wird.\n\nUnd hier ist der Haken:\n\nNach den derzeitigen AGB ist Smurfing eben nicht illegal, es ist nur hochgradig unfair. Riot könnte es nur als illegal erklären, wenn sie rechtliche Änderungen in Deutschland erwirken würden.\n\nIch kann deinen Gedankengang ja verstehen, aber du drückst dich – zumindest nach meiner Auffassung – sehr missverständlich aus.\n\n> Solange Ihr nicht Stande seid ein zu seht das Smurfing Cheating ist brauche wir nicht über Lösungen zu diskutieren.\n\nIn diesem Satz herrscht genau aus dem selben Grund Gegenwind im Forum:\n\nCheating, bezogen auf Videospiele, wird nunmal als Begriff komplett anders definiert und interpretiert, als du es hier tust. Cheating hat nichts mit einem Smurf zu tun.\n\nhttps://de.wikipedia.org/wiki/Cheat\n\nEs geht schlichtweg um die technische Beeinflussung des Spiels von außen (Scripts, Grafik-Cheats, Unsterblichkeit etc.). Smurfing fällt also auch nicht unter diese Kategorie, auch wenn du es gerne als solches bezeichnen möchtest.\n\nEntweder du benutzt die gleichen Definitionen wie alle oder du wirst auf kurz oder lang immer in Diskussionen geraten. Wenn du Theory-Crafting betreiben willst, musst du zwangsläufig einen gleichwertigen Begriffspool zulassen, den alle Teilnehmer nutzen können.\n\nVielleicht sagen dir ja Sokratische Gespräche etwas?\n\nhttps://de.wikipedia.org/wiki/Sokratisches_Gespr%C3%A4ch\n\nSo eines bräuchte man zu dem Thema vielleicht, aber sämtliche Diskussionen in dem Bereich, machen ohne solch eine stabile Grundlage keinen Sinn.","replies":[]},{"poster":"Waldschrat86","date":"2018-04-09T09:53:39.034+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stichsaege,realm=EUW,application-id=KYnfKGf0,discussion-id=sFdIkEcn,comment-id=00020000000100000000000000000000000000000000000000000007,timestamp=2018-04-08T17:11:10.200+0000)\n>\n> Sprich du begehst Urkundenfälschung.\n> \n> IN den AGB für die Card würde ich auf so etwas Strafen von 5 000 000€ oder mehr stellen. ( es dürfen sich ja auch reiche nicht freikaufen können.)\n\nDu checkst es einfach nicht, Lotuskobra hat es sogar schon ausführlich dargelegt, in kurz:\n\nWo kein Kläger, da kein Richter.\n\nWer und warum sollte bitte zu Leuten, die weit unter professionellem Bereich zocken, kontrollieren, ob nun die Oma, der Bruder, der Onkel, die Base, usw, usf. Gaming für sich entdeckt hat oder der Nerd im Keller 20 Cards gehamstert hat.\n\nOb das bei sowas überhsupt unter \"Urkundenfälschung\" fällt möcht ich mal auch bezweifeln, wäre wohl eher Datenmissbrauch. Aber das ist dir ja alles Latte.\n\nEntweder ignorierst du alle Einwende auf deine Ideen oder du gehst darauf ein, dir werden Haken an der Sache genannt und du kommst an mit, dann muss man das aber auch ändern und zwar so wie ich das im Darkworrior Duck-Style handhaben würde, würde das dann auch laufen...\nDass du schon bei den ersten Änderungen in Sphären steigst und Dinge forderst, die sogar bei trifftigenGründen hart debatiert, gar nicht verfassungskonform, ilegal, etc. sind, ist dir dann auch egal...und hier geht's nur um hobbyzocken...\n\nSpinnen wir deine Phantastereien mal durch, inkl. Todesstrafe und deiner Abschleckwünsche(freudscher Verschreiber?) usw.\nDa bleibt dir nur 146GG, wofür sich nichtmal 89/90 entschieden wurde, aber mal angenommen es kommt dazu, so gut wie keine würde \"deine neue Verfassung\" unterstützen.\n\nSchließ mal deine Logiklücken, aber du kommst ja jetzt noch mit Dingen an, die dir schon vor Jahren zerpflückt wurden. Hättest du ernsthaftes Interesse an deinem Anliegen, wären deine Dialoge auch nicht wie groundhog day.\nDu zelebrierst deinen Spleen, \"kämpfen\" ist das nicht, genausowenig wie dein Pseudotrollen, das weder Riot oder Spieler interessiert, die nicht mit dir in nem Game landen und selbst dann sicher nie alle.","replies":[]},{"poster":"drexxsack","date":"2018-04-08T14:22:52.404+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lotuskobra,realm=EUW,application-id=KYnfKGf0,discussion-id=sFdIkEcn,comment-id=00020000000100000000000000000000000000000000000000000005,timestamp=2018-04-08T14:18:09.557+0000)\n>\n> In Deutschland gibt es im Unterschied zu anderen europäischen Ländern ein gesetzliches Verbot eines Klarnamenszwangs.\n> \n> Klarnamenszwang:\n> \n> Klarnamenszwang bedeutet, dass man als Kommunikationsteilnehmer gezwungen wird, seine wahre Identität preiszugeben.\n> \n> Sie steht im engen Zusammenhang mit dem Recht auf Pseudonymität im Internet.\n> \n> In Deutschland existiert mit § 13 VI Telemediengesetz eine Vorschrift, die einen Klarnamenszwang bei Telemedien verbietet, wenn dies technisch möglich und zumutbar ist.\n> \n> Die Vorschrift lautet:\n> \n> „Der Diensteanbieter hat die Nutzung von Telemedien und ihre Bezahlung anonym oder unter Pseudonym zu ermöglichen, soweit dies technisch möglich und zumutbar ist. Der Nutzer ist über diese Möglichkeit zu informieren.“[1]\n> \n> Die Vorschrift fügt sich harmonisch in das bestehende Datenschutzrecht und das Grundgesetz ein, denn sie versucht durch Befolgung der gesetzlichen Gebote der Datensparsamkeit und Datenvermeidung (§ 3a BDSG[2]) dem Grundrecht auf Meinungsäußerungsfreiheit (Artikel 5 I Grundgesetz[3]) zur praktischen Durchsetzung zu verhelfen. Eine Beschränkung der Meinungsäußerungsfreiheit auf Äußerungen, die einem bestimmten Individuum zugeordnet werden können, ist mit Art. 5 Abs. 1 Satz 1 GG nicht vereinbar.\n\nGut zu wissen, wieder was gelernt.","replies":[]},{"poster":"Stichsaege","date":"2018-04-08T11:37:27.306+0000","up_votes":1,"down_votes":0,"body":"Ich will jetzt hier auch nicht weitere Erklärungen abgeben.\n\nEntweder versteht ihr es oder nicht.\n\nFakt ist : Es gibt die ESL Meisterschaft und bei der man ein ESL Playercard\nbenötigt um an der Meisterschaft teilnehmen zu dürfen.\n\nDiese kann man auf alle Online Games anwenden. Da braucht Ihr nicht mit Datenschutz, Pp kommen.\n\nSomit wäre es möglich Jeden spieler nur 1 Acc zu geben und Ihm im falle von Betrug ( 2 Acc , Cheaten oder Co ) von jegliche Online Games auf Lebenszeit zu Bannen.\nEs fehlt nur der Wille die zu tun, da es mit Sicherheit die Einnahmen der Publisher\nreduzieren würde.","replies":[]},{"poster":"drexxsack","date":"2018-04-08T10:43:09.404+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Awsane,realm=EUW,application-id=KYnfKGf0,discussion-id=sFdIkEcn,comment-id=00020000000100000000000000000000000000000000000000000000,timestamp=2018-04-08T10:08:11.880+0000)\n>\n> Zum Datenschutz.\n> \n> Das ist ja genau die Frage. Darf Riot sagen \n> \n> ohne Daten von dir darfst du nicht spielen? \n\nVorweg: Ich bin juristisch nicht geschult, aber die Grundzüge sind mir dennoch bekannt. Angenehmer wäre natürlich, wenn ein Jurist da wäre, der sich äußern könnte.\n\nUnter der Annahme, dass direkt beim Erstellen des Accounts die Daten angegeben werden ist die Antwort: Ja, dürfen sie.\nEs gilt die Vertragsfreiheit und du gibst deine Zustimmung zur Verwendung der Daten über die in die AGB einbezogenen Datenschutzrichtlinien(wobei es eigentlich zum guten Ton gehört zumindest die grundsätzliche Zustimmung direkt in die AGBs aufzunehmen).\n\nZweifelhaft wäre es für nachträgliche Änderungen. Ein Gericht könnte darin dann eine unangemessene Benachteiligung sehen, was diese Änderung ungültig machen würde.\n\n\nDas Problem an der Diskussion ist, dass sie sich an einer rechtlichen Position bewegt und nicht am eigentlich wichtigen Punkt: Dem Geschäftsmodell\nF2P Modelle funktionieren über ihren sehr leichten Zugang. Jede größere Zugangsbeschränkung vorab läuft dem Modell entgegen und verringert damit auf zwei weisen Gewinn, namentlich durch den zusätzlichen Verwaltungsaufwand und zweitens durch unwillige (potentielle) Kunden. \n\nIch halte es für zweifelhaft, dass derartige Modelle in größerem Rahmen ausserhalb von Abomodellen funktionieren.","replies":[]},{"poster":"GotDjentleman","date":"2018-04-08T10:38:21.992+0000","up_votes":1,"down_votes":0,"body":"> Sicher gibt es die, Ich würde behaupten dass wenn Riot nichts durch Smurfs verdiene würde, durch weiter Skins und den halten der High Elo Spieler gäbe es schon lange kein legalen Smurfs mehr.\n\nDas sind bis jetzt alles Mutmaßungen. Wie viel Umsatz macht Riot Games Inc. und wie schlüsselt sich dieser auf, also z.b. Ingame Shop und Werbung auf der LCS ?\n\nWas genau soll  - Datenschutz - bedeuten, aussagen ?\nViele werfen hier in diesem Thread, so auch du, diese Wort in den Raum ohne wirklichen Bezug darauf zu nehemn, was genau Datenschutz bedeutet. Jedenfalls werde ich meine Interpretation nun folgen lassen.\n\n> Bundesdatenschutzgesetz (BDSG)\n§ 4 Zulässigkeit der Datenerhebung, -verarbeitung und -nutzung\n(1) **Die Erhebung, Verarbeitung und Nutzung personenbezogener Daten sind nur zulässig**, soweit dieses Gesetz oder eine andere Rechtsvorschrift dies erlaubt oder anordnet oder der **Betroffene eingewilligt hat**.\n\nSoweit ich das verstanden habe, darf jeder Bürger schon jetzt, nicht in naher Zukunft, über seine Daten entscheiden, zumindest bei nicht öffentlichen Stellen.\n\nGenauer geregelt wird das denk ich mal in \"_Bundesdatenschutzgesetz (BDSG)\n§ 28 Datenerhebung und -speicherung für eigene Geschäftszwecke_\".\n\nDa ich mich in das Thema bloß grob reingelesen habe, sind meine Angaben nur untervorbehalt zu genießen.\n\nAlkohol ist ein Sammelbegriff, so darf man schon mit 14 Jahren, unter aufsicht der Eltern, Bier trinken, aber erst mit 18 Jahren darf man sämtlichen zugelassen alkoholischen Getränke erwerben und konsumieren.\n\nhttps://www.jugendschutz-aktiv.de/informationen-fuer-gewerbetreibende-und-veranstalter/die-vorschriften-im-einzelnen/alkohol.html\n\nSoweit wie ich das verstehe, greift bei der Altersabfrage für Alkohol das Jugendschutz Gesetz.\n\n> Das Jugendschutzgesetz verpflichtet Gewerbetreibende, Händler, Veranstalter und deren Beschäftigte, in bestimmten Fällen das Alter von Kundinnen und Kunden zu prüfen. Das ist immer dann der Fall, wenn es für bestimmte Produkte Altersgrenzen gibt und sie begründete Zweifel haben, dass die Kundin bzw. der Kunde das entsprechende Alter tatsächlich erreicht hat.\n\nhttps://www.jugendschutz-aktiv.de/informationen-fuer-gewerbetreibende-und-veranstalter/fragen-und-antworten.html#c43","replies":[]},{"poster":"Awsane","date":"2018-04-08T10:08:11.880+0000","up_votes":1,"down_votes":0,"body":"Zum Datenschutz.\n\nDas ist ja genau die Frage. Darf Riot sagen \n\nohne Daten von dir darfst du nicht spielen? \n\nAlso entweder verstehe ich es nicht, dann tut es mir leid, aber diese Frage hast du nicht direkt beantwortet, jedenfalls nicht so, dass ich sie verstehe.\n\nUnd das mit dem Alkohol und so ist ja dann doch für mich wenigstens etwas anderes, weil da wird ja nur abgefragt und nicht meine Daten gespeichert. Die Geschäfte dürfen ja nicht die Daten aufschreiben wenn man den perso zeigt, bzw sie dürfen nicht sagen\n\nwenn du hier was kaufen willst musst du mir aber vorher erlauben die Daten deines Persos zu speichern.","replies":[]},{"poster":"Awsane","date":"2018-04-10T08:41:29.373+0000","up_votes":1,"down_votes":0,"body":"Ich poste hier noch mal für dich die offizielle Begründung von Riot in der sie erklären, dass für sie smurfing nicht immer banbar ist.\n\nMich stört das ja auch aber hier kannst du es nachlesen\n\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/Hj86EnUY-frage-an-den-support-zum-thema-duo-q-boosting-mit-antwort","replies":[]},{"poster":"Stichsaege","date":"2018-04-09T21:50:50.117+0000","up_votes":1,"down_votes":0,"body":"Können wir machen.\n\nIch bin für alles offen.","replies":[]},{"poster":"Lotuskobra","date":"2018-04-09T21:16:28.884+0000","up_votes":1,"down_votes":0,"body":"Angebot von meiner Seite:\n\nDu kannst mich gerne im Client adden und wir können darüber philosophieren. Ich hör gerne zu und bin auch gerne bereit manch irrwitzige Theorie zu entwickeln, aber nur wenn du selbst auch dazu bereit bist!\n\nIm Forum, mit nichts als kurzen Texten, bringt das eh alles nix.","replies":[]},{"poster":"Waldschrat86","date":"2018-04-09T21:16:26.641+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stichsaege,realm=EUW,application-id=KYnfKGf0,discussion-id=sFdIkEcn,comment-id=00020000000100000000000000000000000000000000000000000009,timestamp=2018-04-09T15:09:14.729+0000)\n>\n> Hallo: Ich klage gegen das aktuelle System. Falls es dir bis jetzt entgangen ist.\n\nUnd welche Macht hast du alleine? Gar keine. Findest du mit der Art wie du die Sache angehst viele Anhänger, die das ändern könnten? Sicher nicht, eher im Gegenteil.\n\n> \n> Zudem was soll das eigentlich ?\n> Klagen das gewisse Sachen gegen den Datenschutz verstoßen, aber Personalausweis klauen, fälschen ist voll kommen in Ordnung oder wie ?\n\nNö, aber es gibt sowas wie Prioritäten. Und für deine existieren noch nichtmal passende Gesetze und werden es auf absehbare Zeit auch nicht, gerade in Bezug auf ein Spiel. Die Politik und Gerichte haben besseres zu tun.\n\n> \n> Ihr versteht es einfach nicht.\n> Smurfing ist ELO Betrug. Manipulation an System, Cheaten.\n> \n> Mir ist es egal was Ihr sagt, solange Ihr mir nicht 100% Stichhaltige Gründe nennt, die nachprüfbar sind. Ist Smurfing für mich Unfair und Betrug.\n> Was findet Ihr nur an Smurfs so toll das , man diese so verteidigen muss ?\n\nNix, aber du laberst halt Grütze und lebst in einer Traumwelt.","replies":[]},{"poster":"Lotuskobra","date":"2018-04-09T20:47:58.286+0000","up_votes":1,"down_votes":0,"body":"Es geht nicht darum, dass das niemand hier vesteht, es geht darum, dass Riot per Gesetz dagegen nichts tun kann.\n\nSIE DÜRFEN NICHT DEINE EINDEUTIGE IDENTITÄT ERFRAGEN, ergo können sie auch nicht wissen, wer hinter welchem Smurf Account steckt.\n\nDas Smurfing per se für die Spielerschaft nicht fair ist, bestreitet doch keiner, es gibt nur eben keinen rechtlich legalen Weg es zu verbieten!\n\nHab ich das wirklich so schlecht erklärt?","replies":[]},{"poster":"Stichsaege","date":"2018-04-09T20:43:12.647+0000","up_votes":1,"down_votes":0,"body":"Aber erst mal, Danke.\nDa für das du nicht gleich sagst Smurf sind Legel weil Riot nicht da gegen macht.\nIch weiß eckt nicht wie so du es verstehst und leber zusammen hänger erkennst was alle andern nicht schaffen.\n\nDas wäre dann nicht strenggenommen Smurfs. \nEs IST Smurfing.\n\nAber des wegen drückt Riot ja auch beide Augen bei Smurfs zu, weil Sie diese Spieler nicht verlieren wollen.\nMal ab gesehen davon das es den Perma Bann zu ein Lachnummer degradiert.\nDie Möglichkeit nur 1 Acc zu besitzen zu können und den dann 14 Tage zu bann wäre sinn voller als einen von X Acc zu Perma Bannen.\n\nAber das versteht hier fast niemand","replies":[]},{"poster":"Stichsaege","date":"2018-04-09T20:30:39.141+0000","up_votes":1,"down_votes":0,"body":"Ja es kommt wieder.\nDas ist eine offiziell Aussage von Riot.\n\nWas bedeutet Manipulation der Gegnersuchenwertung (Boosting)?\n\nRiot sage selber Manipulation der Gegnersuchenwertung ist Boosting.\nNicht anders machen Smurfs. somit ist und war Smufing schon immer gegen die Regel von Riot.\n\n---------------------------------------------------------------------------------------------------------------------------------------------------------------\nWie man es kontolieren, umsetzten,bestrafen kann will ich nicht wissen.\nLeider muss ich auch für solech Probleme gleich antworten geben, weil Ihr die Community nicht im stande seid zu verstehen das Smurfing schon Immer gegen die Regel war. \n\nSolange Ihr nicht Stande seid ein zu seht das Smurfing Cheating ist brauche wir nicht über Lösungen zu diskutieren.","replies":[]},{"poster":"Lotuskobra","date":"2018-04-09T18:12:04.037+0000","up_votes":1,"down_votes":0,"body":"Du verstehst es nicht, weil du entweder zu ignorant bist, um es zu lesen oder schlichtweg damit argumentierst, es nicht als stichhaltig zu empfinden.\n\nNiemand hat je behauptet, das Smurfing gegenüber Spielern, die sich das nicht aussuchen können im Ranked \"fair\" ist. Das Probelm ist, dass du mit Rechtsbegriffen um dich wirfst, die in diesem Zusammenhang nicht greifen.\n\nWir haben das Thema so oft erläutert und auch in diesem Thread bist du allen Argumenten ausgewichen, die dir exakt und nachprüfbar beschreiben, warum die von dir vorgeschlagenen Ideen nicht umsetzbar sind (im derzeitigen Rechtssystem von Deutschland). Du kannst dich so oft dagegen streuben oder das anprangern, aber solange du in dem Bereich nicht die Allmacht hast, wirst du nichts daran ändern können.\n\nIch fass das, was zu dem Thema wirklich wichtig ist einfach mal zusammen, in der kleinen Hoffnung, dass du es doch liest und auch gerne selbst anchprüfst, ob du meine Links verfolgst, ist mir ehrlich gesagt wurscht.\n\n1. Smurfing ist nicht verboten, da es für Riot keine rechtliche Grundlage in Deutschland gibt, das ganze zu verbieten. Riot darf seine Spieler nicht dazu zwingen ihre persönlichen Identifikationsdaten (Perso-Nummern, etc.) anzugeben –> \"Verbot des Klarnamenszwanges.\n\nhttps://de.wikipedia.org/wiki/Klarnamenszwang\n\n–> daraus entsteht zwangsläufig die Problematik, dass Riot nur mit Pseudonymen/Nutzern Vertraglich bindende Dinge aushandeln kann, nicht mit einer natürlichen Person. Es gibt also keine AGB zwischen dir als \"Max Mustermann\" und Riot, sondern dir als \"Stichsäge\" und Riot.\n\nNur wenn Punkt 1 rechtlich geändert werden sollte – was durchaus einige in Deutschland unterstützen würden – könnte Riot über die Account-Spezifizierung nach natürlichen Personen nachdenken und dies auch umsetzen.\n\nAnschließend könnte Riot dies in den AGB verankern und über einen angemessenen Weg der Accountverschmelzung nachdenken.\n\n–> aber das sind alles ungelegte Eier, über die wir hier spekulieren.\n\nSelbst wenn Riot Smurfing, aufgrund der Änderungen der deutschen Gesetzgebung, per AGB verbietet, könnten sie es nicht als Betrug klassieren. Betrogen werden kann nur, wer durch ein Betrugsdelikt um einen direkten Teil seines Vermögens oder seiner Daten gebracht wird.\n\n–> darauf bezieht sich zB die derzeitige Passage der AGB (Phishing Mails, etc.)\n\nNach derzeitigen deutschen Recht werden jedoch virtuelle Güter nicht als Vermögensbestandteil angesehen, sofern sie nicht in einen direkten, auf legalem Wege umtauschbaren, Geldwert zurückzuführen sind. Der Verkauf von Accounts ist verboten und eine Rückrechnung von Skins in RP und anschließend Euro nicht möglich, da es diesen Tauschweg legal nicht gibt.\n\nZudem gehört keiner der erworbenen Gegenstände, ebenso wie der Account einem selbst. Man hat sowohl für die virtuellen Gegenstände als auch den Account nur Nutzungsrechte, die einem ohne Gewährleistung zugesichert werden. Wenn du also Lp verlierst, verliert genaugenommen Riot diese Lp, da sie den Account besitzen, auf dem sie dir gestatten zu spielen.\n\nhttps://webcache.googleusercontent.com/search?q=cache:as2wqLFgLz0J:https://www.bundestag.de/blob/412052/a2ff34407556f84c8b5a31e90db0df8c/wd-10-085-11-pdf-data.pdf+&cd=6&hl=de&ct=clnk&gl=de&client=firefox-b\n\nhttps://euw.leagueoflegends.com/de/legal/termsofuse#section4\n\nMehr gibt es dazu nicht zu sagen...","replies":[]},{"poster":"Haudruppmoor","date":"2018-04-09T15:22:55.712+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stichsaege,realm=EUW,application-id=KYnfKGf0,discussion-id=sFdIkEcn,comment-id=00020000000100000000000000000000000000000000000000000009,timestamp=2018-04-09T15:09:14.729+0000)\n>\n> Hallo: Ich klage gegen das aktuelle System. Falls es dir bis jetzt entgangen ist.\n> \n> Zudem was soll das eigentlich ?\n> Klagen das gewisse Sachen gegen den Datenschutz verstoßen, aber Personalausweis klauen, fälschen ist voll kommen in Ordnung oder wie ?\n> \n> Ihr versteht es einfach nicht.\n> Smurfing ist ELO Betrug. Manipulation an System, Cheaten.\n> \n> Mir ist es egal was Ihr sagt, solange Ihr mir nicht 100% Stichhaltige Gründe nennt, die nachprüfbar sind. Ist Smurfing für mich Unfair und Betrug.\n> Was findet Ihr nur an Smurfs so toll das , man diese so verteidigen muss ?\n\nMich verwirrt diese Debatte einfach. Ich mein, wie ist das mit Leuten, die gebannt wurden, vorher auf z.B. Diamant rumhingen und sich jetzt nen neuen Acc machen. Das wären dann doch auch strenggenommen Smurfs , weil die sich doch auch erst durch alle Instanzen hochspielen müssen, oder ? Sind die auch unfair ? Ist das Betrug, sich da nen neuen Acc zu erstellen ? Also ich mein , sind ja schon einige die hier mit gebannten Acc's aufschlagen. Die dürften ja nie wieder spielen, laut Deiner Logik ?","replies":[]},{"poster":"Stichsaege","date":"2018-04-09T15:09:14.729+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Waldschrat86,realm=EUW,application-id=KYnfKGf0,discussion-id=sFdIkEcn,comment-id=00020000000100000000000000000000000000000000000000000008,timestamp=2018-04-09T09:53:39.034+0000)\n>\n\n> \n> Wo kein Kläger, da kein Richter.\n> \n> Wer und warum sollte bitte zu Leuten, die weit unter professionellem Bereich zocken, kontrollieren, ob nun die Oma, der Bruder, der Onkel, die Base, usw, usf. Gaming für sich entdeckt hat oder der Nerd im Keller 20 Cards gehamstert hat.\n> \n> Ob das bei sowas überhsupt unter &quot;Urkundenfälschung&quot; fällt möcht ich mal auch bezweifeln, wäre wohl eher Datenmissbrauch. Aber das ist dir ja alles Latte.\n> \n\n\nHallo: Ich klage gegen das aktuelle System. Falls es dir bis jetzt entgangen ist.\n\nZudem was soll das eigentlich ?\nKlagen das gewisse Sachen gegen den Datenschutz verstoßen, aber Personalausweis klauen, fälschen ist voll kommen in Ordnung oder wie ?\n\nIhr versteht es einfach nicht.\nSmurfing ist ELO Betrug. Manipulation an System, Cheaten.\n\nMir ist es egal was Ihr sagt, solange Ihr mir nicht 100% Stichhaltige Gründe nennt, die nachprüfbar sind. Ist Smurfing für mich Unfair und Betrug.\nWas findet Ihr nur an Smurfs so toll das , man diese so verteidigen muss ?","replies":[]},{"poster":"Stichsaege","date":"2018-04-08T17:11:10.200+0000","up_votes":1,"down_votes":2,"body":"Sprich du begehst Urkundenfälschung.\n\nIN den AGB für die Card würde ich auf so etwas Strafen von 5 000 000€ oder mehr stellen. ( es dürfen sich ja auch reiche nicht freikaufen können.)","replies":[]}]}]}]}]},{"poster":"Lotuskobra","date":"2018-04-06T21:55:35.286+0000","up_votes":2,"down_votes":0,"body":"> Ja, man kann weder verhindern, dass Autos geklaut werden, noch das sich Menschen einen Smurf erstellen.\n> Das ist Falsch. Es kommt nur auf die höhe der Stafe an.\n\nWarum gibt es dann Morde und Diebstahl? Auf beides sind hohe Strafen angesetzt und trotzdem passiert es Tag für Tag.\n\nWeißt du was dein Problem ist?\n\nKennst du den Film Kung Fu Panda? \n\nhttps://www.youtube.com/watch?v=DLpUev1FvS0\n\nDu hast an sich zwar fragwürdige, aber durchaus recht durchdachte Ganzheitstheorien, wie eine Ordnung auf der Welt aussehen sollte – deinem Gerechtigkeitsempfinden nach zumindest – ich will das an der Stelle gar nicht bewerten, aber die geistige Leistung dahinter möchte ich einmal anerkennen.\n\nDu hast nur leider ein Problem: Du glaubst an die Illusion der völligen Kontrolle. Du glaubst daran alles in die Bahnen lenken zu können, die du als sinnvoll ansiehst. So verhälst du dich in Unterhaltungen, so konzipierst du deine Ideen und so legst du dein Strafmaß fest.\n\nAber die Welt ist nicht unter absoluter Kontrolle, die Natur ist es nicht und auch das Universum ist es nicht. Es gibt in jedem noch so kleinen oder großen System Anomalien, Unstetigkeiten und vor allem Dingen immer etwas, das sich dem wiedersetzen möchte, wofür es gedacht ist.\n\nIn deiner Vorstellung, stellen deine Regelungen ein System ohne Ausreißer, ohne Regelbrecher und ohne WIederrede ein, aber genau das ist niemals erreichbar. Du kannst damit sicherlich einen Sachverhalt, der dir nicht gefällt eindämmen, aber du kannst ihn nicht auslöschen.\n\nMit diesem Beitrag verabschiede ich mich aus der Diskussion, leider mit dem selben faden Beigeschmack wie beim letzten Mal:\n\nEin durchaus kluger Schopf, lebt in seiner eigenen Welt, die er durchaus auf faszinierende Art durchdacht hat, aber selbst nicht einsehen kann, dass er Dinge nicht miteinbezogen hat, die sein Konstrukt stören.\n\nEs ist etwas wunderschönes in einem Traum zu leben und etwas noch schöneres ihn ausleben zu können. Ich möchte dir persönlich an dieser Stelle nichts davon nehmen – auch wenn ich weiß, dass du das nie zulassen würdest – und werde mich dementsprechend in noch folgenden Diskussionen zurückhalten.\n\nDas ist zwar auf eine gewisse Art und Weise Schade, aber für mich als Diskussionspartner ist Theory-Crafting ohne Adaption und Veränderlichkeit, schlichtweg nicht einer Unterredung wert.\n\nAlles Gute von meiner Seite!","replies":[{"poster":"Stichsaege","date":"2018-04-06T22:43:19.480+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Lotuskobra,realm=EUW,application-id=KYnfKGf0,discussion-id=sFdIkEcn,comment-id=0002000000010000000000000000000000000001,timestamp=2018-04-06T21:55:35.286+0000)\n>\n> Warum gibt es dann Morde und Diebstahl? Auf beides sind hohe Strafen angesetzt und trotzdem passiert es Tag für Tag.\n\n\nNicht hoch genug.\nMax Todesstrafe.\n\nGlaub mir, ich würde für so was Strafen verhängen, so Grausam, Unmenschlich und Abschlecken wie Sie noch kein Mensch erlebt hat.","replies":[]}]}]}]}]}]}]},{"poster":"GotDjentleman","date":"2018-04-06T18:46:11.007+0000","up_votes":3,"down_votes":0,"body":"> Es gibt keine Kennung der genauen juristischen Person, die mit Riot einen Vertag eingeht, da es keine Personaldokumente braucht, um sich einen Account zu erstellen. Wie also soll man das Ganze überwachen?\n\nEine jursitische Person ist kein Mensch. \n\nWenn Pepsi zum Beispiel ein neues koffeinhaltiges Erfrischungsgetränkt mit rotem Etikett und in weißer Schrift geschrieben \"CocaCola\" rausbringen würde, würde nicht James Quincey, CEO von CocaCola, Indra Nooyi, CEO von Pepsi, anzeigen. Sondern \"CocaCola Company\" würde \"Pepsi Inc.\"  Patetnverletzung vorwerfen. Da ein Unternehmen keine \"natürliche Person\", also ein Mensch, ist, spricht man von der sog. Juristischen Person. Grobschlächtig gesagt, sieht man das Unternehmen als \"Person\" an.","replies":[{"poster":"Lotuskobra","date":"2018-04-06T19:15:36.683+0000","up_votes":2,"down_votes":0,"body":"Begrifflichkeiten hin oder her, ja in dem Fall hast du natürlich Recht, allerdings ändert dies am Problem nichts. Auch die natürliche Person ist nicht eindeutig zuweisbar, da es schlicht keine Identitätsüberprüfung gibt. Solange es also nicht zum Rechtsstreit kommt, ist nicht bekannt, wer eigentlich hinter dem Account steckt.","replies":[{"poster":"GotDjentleman","date":"2018-04-06T20:15:24.111+0000","up_votes":3,"down_votes":0,"body":"Ich wollte bloß ein bischen klugscheißern^^.\n\nIdentitätsüberprüfung stand für mich nie zur Debatte. Es gibt einfach keine realistisch und zu gleich sichere Option.","replies":[{"poster":"Lotuskobra","date":"2018-04-06T20:46:21.565+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lulu}}","replies":[]}]}]}]}]}]},{"poster":"Lotuskobra","date":"2018-04-06T15:49:44.215+0000","up_votes":1,"down_votes":0,"body":"Es gäbe theoretisch schon einen Weg dagegen, allerdings würde er die neue Spielerschaft komplett abdrängen und das Spiel so unattraktiver machen. In Korea zB. muss man seine Sozialversicherungsnummer angeben, sobald man sich einen Account erstellen möchte.\n\nSo ein System könnte man theoretisch einführen, allerdings würde das voraussetzen, dass:\n\n1. das Spiel ab 16 freigegeben wird, damit alle diese Nummer erhalten können.\n2. man eine zweite Nummer (im besten Fall vom Perso) hinterlegen muss um die Person abzugleichen. (ähnlich dem System beim Kontoeröffnen in einer Bank).\n\nAlso Mittel und Wege gäbe es, aber der Preis dafür ist mir persönlich zu hoch. Man gibt ohnehin schon genug Daten preis, warum sollten es noch mehr werden?","replies":[{"poster":"Noxempire","date":"2018-04-06T16:15:19.936+0000","up_votes":2,"down_votes":0,"body":"Ist in Korea auch für Online Zeugs üblich. Vielleicht sogar mit der Gesetzeslage verknüpft? \nIch glaube RiotEU/NA hält nicht sehr viel von dieser Methode. Ich schätze mal, dass für das Ganze, die leitende Stelle in Korea verantwortlich ist.","replies":[{"poster":"Lotuskobra","date":"2018-04-06T17:19:25.893+0000","up_votes":1,"down_votes":0,"body":"Definitv, und nur darum ist es auch umgesetzt worden,, ich bezweifle nur, das Datenschützer in Deutschland das zulassen würden (also unseren Innenminister würde es sicher freuen). Ich bin froh drumm, dass es noch nicht so ist und das Riot darauf auch nicht in anderen Nationen umgeschwungen ist.","replies":[]}]}]}]}]},{"poster":"Megamaexx","date":"2018-04-06T12:16:36.837+0000","up_votes":3,"down_votes":0,"body":"Hallo und willkommen  Zeckyx,\nder Text würde beim Support nichts bringen vermute ich, da diese keinen Einfluss auf höhere Ebenen von Riot haben. Zumindest nicht im deutschsprachigen Bereich. \n\nHier im Forum erreichst du Riot vermutlich auch nicht, auch wenn sich wohl mittlerweile der ein oder andere Support-Mitarbeiter im Forum rumtreibt. \n\nDie Mods können übrigens Beiträge nicht verschieben, sondern lediglich löschen. Das hat nichts mit der Thematik zu tun, das Thema wurde allerdings auch schon ziemlich oft angesprochen.\n\nSo, kommen wir nun zum eigentlichen Thema: Die Spielererfahrung für Neulinge. \nIch glaube, gerade im Low Level-Bereich sind viele flamende Smurfs zu finden, weil eben diese, die bereits einen Permabann für's Flamen bekommen haben, sich uneinsichtig einen neuen Account gemacht haben. Es gibt eben Leute, die scheinbar nicht verstehen wollen, dass man mit einem Spiel auch aufhören kann, wenn es (gerade) keinen Spaß macht.\n\nEs gibt aber auch Smurfs, sie diesen haben, um neue Rollen zu üben oder um andere Neulinge aus ihrem Freundeskreis nicht direkt mit stärkeren Spielern zu konfrontieren.\n\nSobald du Ranked spielst, ändert sich allerdings nur eines. Die Smurfs werden weniger. Flamer sind weiterhin da, vermutlich mit etwas geringerer Dichte, aber trotzdem regelmäßig. \n\nAlso reagiere einfach nicht auf Flamer, mute und reporte die. Wie du selbst schon vermutest, wird dein Text nichts verändern.\n\nWenn es doch motiviert, weiterzuspielen, wenn die Flamerdichte geringer wird, dann spiel weiter. Auch die Normals werden weniger flamerisch und Smurfs über Level 30 sieht man kaum noch in Normals. Es gibt also sowas wie ein Licht am Ende des Tunnels ;)\n\nJetzt habe ich doch wieder so viel geschrieben, dass es viel ist x.x \nMfG Megamaexx","replies":[]},{"poster":"Taku2011121","date":"2018-04-06T12:42:07.666+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist klar und wie du erkannt hast leider schwer zu beheben.\n\nMeine Empfelung wäre, hauptsächlich mit tiltunempfindlichen Freunden zu spielen oder\nz.B. hier im Forum nach anderen Spielern in deiner Lage zu suchen, um dann gezielt \nmit/gegen diese zu spielen um dabei besser zu werden.\n\n\nDamit will ich natürlich nicht sagen, dass du nicht mehr alleine PvP spielen solltest,\ndeine Nerven und dem Spaß am Spiel würde es aber auf jeden Fall gut tun.","replies":[]}]}