{"poster":"Kara344","date":"2016-02-02T19:52:30.582+0000","title":"Wieso trollt man ? und wieso gibt es zurzeit zu viele trolls in den ligen ?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":9,"body":"Ich versteh echt nicht warum man trollt ist echt der scheis den ich bin zurzeit neu lvl 30 gekommen und habe ranked gespielt und sah echt viele trolls z.B Master YI supp und shaco adc ?? ich habe 4 rankeds gespielt und habe alle 4 verloren weil viele bei diesen 4 spielen getrollt haben.Nicht nur mir geht es so den allen anderen geht es auch so den zurzeit verliert man sehr viele spiele.also was sagt ihr dazu seit ihr auch dieser Meinung das es viele trolls gibt wenn ja schreibt das alles in die Kommentare","replies":[{"poster":"MeMyselfandBaal","date":"2016-02-02T21:38:03.389+0000","up_votes":6,"down_votes":0,"body":"Wieso finde ich keines der angesprochenen Beispiele in deinen 4 Spielen? Das sind alles ganz normale Spiele, zumindest was die Teamkomposition betrifft.\nUnd auf den ersten offensichtlichen Blick hat da auch keiner getrollt. Schlecht gespielt? Bestimmt. Aber das kommt vor. \n\nEines der größten Probleme bei LoL ist der Hang zur Überreaktion. Standard Beispiel ist das \"Report X for feeding\". Dabei ist feeding kein Reportgrund. Absichtliches Feeden schon, aber das ist etwas ganz anderes als seine Lane zu verlieren. \n\nWarum ist das ein Problem? Nun ja, weil einen die \"Warum kriege ich nur Trolle?\" Fragestellung vom eigentlich wichtigen abhält. Nehmen wir einfach mal dein 1-3-2 Jungle Game. Du fragst dich danach anscheinend (sonst wärst du ja nicht hier), warum deine Teammates so schlecht gespielt/ getrollt haben. Ich würde mich bei so einem Spiel eher fragen, warum der gegnerische Jungle mit seiner 16er KDA einen so viel größeren Einfluss auf das Spiel hatte, als du selbst. Die erste Fragestellung hilft dir nicht weiter, die 2. sorgt dagegen dafür, dass du ein besserer LoL Spieler wirst. Worum es dir ja eigentlich gehen sollte...","replies":[]},{"poster":"legofreak1","date":"2016-02-02T20:16:21.220+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=drexxsack,realm=EUW,application-id=KYnfKGf0,discussion-id=qA3AOn1l,comment-id=0001,timestamp=2016-02-02T19:05:35.314+0000)\n>\n> Wir treffen jetzt mal ein paar Annahmen, damit es anschaulicher ist.\n> 1. Zwei Teams haben 4 ihrer 5 Slots belegt.\n> 2. Es gibt 3 Spielstärken und alle belegen 1/3 der Spielerschaft\n> \n>     Stärker als der Schnitt\n> \n>     Durchschnitt\n> \n>     schlechter als der Schnitt\n> \n> Die Teams sehen folgendermaßen aus:\n> Dein Team\n> 1. Guter Spieler\n> 2. Schlechte Spieler\n> 3. Durchschnitt\n> 4. Durchschnitt\n> 5. Du\n> \n> Gegnerteam\n> 1. Guter Spieler\n> 2. Schlechte Spieler\n> 3. Durchschnitt\n> 4. Durchschnitt\n> 5.\n> \n> Nun sieht es folgendermaßen aus. Spieler 5 wird nun im Schnitt zu je 33% mit einem der Spielertypen belegt. Dein Slot hingegen ist zu 100% fest. Bist du schlechter als der Schnitt, ist dein Team in 66% der Fälle schwächer. Du wirst so also öfter verlieren.\n> Bist du durchschnittlich, sind 33% der Gegner schwächer als ihr, 33% so gut wie ihr und 33% stärker als ihr. Du wirst hier auf etwa 50% Winrate kommen.\n> Bist du hingegen stärker als der Schnitt deiner Liga, wirst du in 66% der Fälle, das stärkere Team haben.\n> Das ganze ist jetzt natürlich ein sehr grobes Modell, allerdings bleibt das Prinzip gleich.\n\n\nErsetze \"schlechter Spieler\" mit \"Troll\" und du hast obiges an deine Situation angepasst. Wenn du nicht aufsteigst, liegt das nicht an den Trollen, sondern an deiner eigenen Leistung.","replies":[]},{"poster":"XenesisCH","date":"2016-02-03T08:28:06.937+0000","up_votes":2,"down_votes":0,"body":"Ich empfehle dir die Sichtweise ein Spiel zu analysieren zu ändern. Wenn man verliert liegt es meistens daran, dass der Gegner einfach besser war. Zu verlieren ist vollkommen okey bzw. kann man nicht erwarten, dass man 80 % der Rankedspiele gewinnt (ausser man ist viel besser als die aktuelle ELO). Es reicht übrigens eine Winrate leicht über 50 % zu haben um aufzusteigen. Weiter geht es nicht darum wie schlecht deine Mitspieler waren (gemäss deiner Definition \"Trolls\"), sondern wie du deinen Einfluss auf das Spiel erhöhen/verbessern kannst.","replies":[]},{"poster":"Veezey","date":"2016-02-03T03:09:04.867+0000","up_votes":2,"down_votes":0,"body":"Was ich davon halten? Ist mir egal was sie spielen, solange sie ihren Job machen.","replies":[]},{"poster":"Nycaria","date":"2016-02-03T00:11:49.910+0000","up_votes":1,"down_votes":0,"body":"Nur weil etwas nicht in der Meta ist,heißt es nicht sofort das man trollt ;)","replies":[]},{"poster":"Fondle my Balls","date":"2016-02-04T12:27:43.848+0000","up_votes":1,"down_votes":1,"body":"na das geht ja noch, ich wurde gerade ebend im ranked erpresst.\n\nDie Midlane hat angefangen ohne jeglichen grund jeden zu beleidigen als man geschrieben hat das man sie muted und reported fing diese an zu schreiben das wir ihn entweder nicht reporten oder er uns das match versaut und alle reported.\n\nwas sagt man dazu? das match hatten wir sogar so gut wie gewonnen aber dann kommt die Mid und zieht sowas ab.","replies":[]},{"poster":"zuckerman","date":"2016-02-04T11:27:01.389+0000","up_votes":1,"down_votes":1,"body":"Warum man \"trolled\"? Na weil es Spaß macht, gibt nix besseres als wenn sich alle fürchterlich über dich aufregen. \nAbsichtliches verlieren oder \"Feeden\" ist jedoch kein \"Trolling\" in meinen Augen.\nManche Leute können sich halt einfach nicht benehmen (ich z.B. ich beschimpfe jedoch niemanden und feede auch nicht) und da der Mensch kein rationales Wesen ist, fangen diese dann an so einen Mist zu bauen. \nIch kann jedoch keine erhöhtes Troll aufkommen feststellen, habe aber auch noch kein Ranked gespielt diese Season.\n\nAußerdem solltest du an deinen mathematischen Kompetenzen arbeiten.","replies":[]},{"poster":"ˉºVaynovskyºˉ","date":"2016-02-02T20:05:16.132+0000","up_votes":1,"down_votes":2,"body":"wenn man alle spiele zusammen rechnet ist es 50% zu 50%\ndenn wenn 5 leute gewinnen,verlieren 5 leute,\nund leute die gold-dia waren,sind jetz in bronze-gold/plat, vieleicht ist das die ursache","replies":[]},{"poster":"Futanarî Soraka","date":"2016-02-02T20:07:18.308+0000","up_votes":1,"down_votes":10,"body":"Weil jeder der ernsthaft spielt ausschließlich bestraft wird, also kann man es auch gleich seinlassen.","replies":[]}]}