{"poster":"TJ165","date":"2013-09-23T21:40:59.901+0000","title":"PVP.net Patcher Kernel","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I keeps on saying PVP.net Patcher Kernel has stopped working, but i dont know why? Any help would be greatly appreciated.","replies":[{"poster":"Eambo","date":"2014-12-12T10:47:23.048+0000","up_votes":2,"down_votes":0,"body":"Hi IIVIIiLiOn,\n\nThis post is over a year old, please make a new thread if you continue to have issues. Glad to hear you got it sorted this time, however! :-)","replies":[]},{"poster":"Smasherbro909","date":"2017-02-22T21:38:09.464+0000","up_votes":1,"down_votes":0,"body":"I can't update my client because I can't open the new client with \"run as administrator\" please help me fix my game so I can use practice tool.","replies":[]},{"poster":"dArtagnan","date":"2013-09-24T05:00:17.353+0000","up_votes":1,"down_votes":0,"body":"Hello TJ165!\n\nIf you are experiencing this error, it may be indicative of a corruption within your installation, or a corruption in the latest patch downloaded.  Because of this, make sure that you try to complete all of the steps found in this Knowledge Base Article:\n\n- https://support.leagueoflegends.com/entries/21804747-Patcher-Problems\n\nIf you are still experiencing issues, even after completing all of the steps found here, make sure that you open a new ticket to Player Support, which you can do here:\n\nhttps://support.leagueoflegends.com/tickets/new\n\nIf you do submit a ticket, make sure that you include the following latest and most up to date information:\n\n1) Network Analysis: http://support.leagueoflegends.com/entries/20103436-obtaining-a-network-analysis\n\n2) NetworkInfo Log: http://support.leagueoflegends.com/entries/20132863-obtaining-a-networkinfo-log\n\n3) Process List: http://support.leagueoflegends.com/entries/20132988-obtaining-a-process-list","replies":[{"poster":"xXSomeoneElse","date":"2014-12-12T10:19:37.757+0000","up_votes":1,"down_votes":0,"body":"I am currently having the same problem https://support.leagueoflegends.com/entries/21804747-Patcher-Problems I clicked the link and the page said it didn't exist anymore is there a new link I could use or  new page to get the information I need?\n\nedit: I just ran the program as administrator and it seem to have fixed the issue.","replies":[{"poster":"ZyxnridTheMaster","date":"2014-12-25T21:26:01.608+0000","up_votes":1,"down_votes":0,"body":"Do you have to run it as an admin every time you open it now?","replies":[{"poster":"xXSomeoneElse","date":"2014-12-25T21:43:37.689+0000","up_votes":1,"down_votes":0,"body":"not that I know off I just did it once and it seemed to the trick.","replies":[]}]},{"poster":"ZyxnridTheMaster","date":"2014-12-25T21:24:27.333+0000","up_votes":1,"down_votes":0,"body":"Thank you very much for the edit it helped a lot!{{item:1051}}","replies":[]}]}]},{"poster":"TorinoEvolve","date":"2013-10-19T03:20:19.860+0000","up_votes":1,"down_votes":0,"body":"i get the same thing. and i'm no techy at all. the frustrating part is in order to fix all this, whoever thinks of it all wants you to do all this techy stuff that i for one don't understand. when crap like this hits, this is the reason i hate playing pc games. i don't wanna give up on LoL cause i was having a blast playing the 2 days i've had it.","replies":[]}]}