{"poster":"Sossio","date":"2017-05-18T20:38:53.052+0000","title":"IL NUOVO RAMMUS FA SCHIFO","subforum":"Campioni e gameplay","up_votes":3,"down_votes":6,"body":"Vi prego supportatemi, facciamo ritornare rammus come prima.  Q_Q","replies":[{"poster":"superkey97","date":"2017-05-18T20:58:41.846+0000","up_votes":2,"down_votes":1,"body":"No, a me sinceramente questo nuovo rammus non mi dispiace affatto, lo trovo molto piú forte e utile di prima","replies":[]},{"poster":"Sossio","date":"2017-05-20T12:30:47.379+0000","up_votes":1,"down_votes":1,"body":"ragazzi, sono disperato non si può fare una petizione o cose del genere per farlo tornare come prima?","replies":[{"poster":"Logain Ablar","date":"2017-05-20T21:49:30.227+0000","up_votes":1,"down_votes":0,"body":"basta non usarlo + ^_^ io ci ho rinunciato","replies":[]}]},{"poster":"Easlay","date":"2017-05-19T18:51:04.702+0000","up_votes":1,"down_votes":0,"body":"si ma che senso ha interrompere la W? se la uso è perchè devo tankare nella mischia, ma se appunto la uso divento piu lento di chissa che cosa e divento inutile non riuscendo a stare addosso nemmeno a un singolo avversario (lo slow della R ci mette troppo a stackare perchè compensi quello autoinflitto).\nstessa cosa per i danni, possono anche essere il quintuplo di quelli attuali, ma se non riesco a farli che senso ha averli?\npurtroppo 60% è immenso, rende la spell totalmente fuori sincronia con il ruolo e kit del champ","replies":[]},{"poster":"Logain Ablar","date":"2017-05-18T23:16:16.661+0000","up_votes":1,"down_votes":1,"body":"true story... ma rammus è uno di quei champ che è stato sempre abbandonato (cioè è l'unico champ che non ha ctrl +1/2/3) \nquindi già che lo hanno modificato è strano... \ncmq si fa cagare ... è tutto un nerf \nridotto il danno della R e rimpiazzato con cc : ci può stare \nE atk speed -> abbastanza inutile a rammus... + forte in 1v1 vs jungla... utilissimo direi :-)\nW immobile quando lo si usa (quindi non si può sfruttare il buff atk speed della E)\nQ channelling e quindi interrotto da chiunque (a sto punto dovevano mettere la possibilità di poter scegliere se fermarsi all'impatto o passarci sopra dato che se si scappa e ci son i minion in mezzo si è gia salvi normalmente, se si ha un minimo di cc ovviamente manco sto qui a parlare :-P )\nad es se si fa un tower dive con rammus è morte certa (slowi sotto torre e non riesci ad uscire dal raggio della torre)\nrammus si basa sulla W e Q per raggiungere il target e sono stati stranerfati .. quindi boh ... ho il sentore che lo bufferanno fra 1 paio di patch","replies":[{"poster":"DANJERpuntoEXE","date":"2017-05-19T05:51:34.820+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Logain Ablar,realm=EUW,application-id=cAOZwaUi,discussion-id=7QNhkppu,comment-id=0001,timestamp=2017-05-18T23:16:16.661+0000)\n>\n> true story... ma rammus è uno di quei champ che è stato sempre abbandonato (cioè è l&#x27;unico champ che non ha ctrl +1/2/3) \n> quindi già che lo hanno modificato è strano... \n> cmq si fa cagare ... è tutto un nerf \n> ridotto il danno della R e rimpiazzato con cc : ci può stare \n> E atk speed -&gt; abbastanza inutile a rammus... + forte in 1v1 vs jungla... utilissimo direi :-)\n> W immobile quando lo si usa (quindi non si può sfruttare il buff atk speed della E)\n> Q channelling e quindi interrotto da chiunque (a sto punto dovevano mettere la possibilità di poter scegliere se fermarsi all&#x27;impatto o passarci sopra dato che se si scappa e ci son i minion in mezzo si è gia salvi normalmente, se si ha un minimo di cc ovviamente manco sto qui a parlare :-P )\n> ad es se si fa un tower dive con rammus è morte certa (slowi sotto torre e non riesci ad uscire dal raggio della torre)\n> rammus si basa sulla W e Q per raggiungere il target e sono stati stranerfati .. quindi boh ... ho il sentore che lo bufferanno fra 1 paio di patch\n\nQ nerfata? Ma se va più veloce di prima? Se PROVI A LEGGERE la patch note ti spiegano perché hanno messo lo slow sulla w. Ma no, sono un italiano medio, c'è qualcosa che occorre essere imparata ma mi lamento. È bello lamentarsi.\n\nCerto, passano 2 giorni tutti a dire che fa schifo, provate a guardarvi le statistiche dei suoi match. Se ora richiede qualcosa in più oltre a fare la combo della vecchia Kata(Q EWR) non va bene. Ricordo benissimo tutti a dire che la Kata reworkata faceva schifo. Dopo un mese 2 nerf perché era strapickata e forte. L'uomo non ha mai imparato dalla storia, è un dato di fatto ormai.","replies":[{"poster":"Easlay","date":"2017-05-19T10:54:25.599+0000","up_votes":1,"down_votes":0,"body":"onestamente ci son un po di buff e nerf, il problema è che alcuni nerf sono nosense (Q channeling, W che ti slowa del 60%).\nil problema principale però sta nello slow del 60%, questo vuol dire che mandi totalmente a quel paese il potenziale di rammus di stare addosso all'adc nemico una volta finito l'effetto del taunt, in quanto diventi un paracarro che corre quanto un sasso che prova a rotolare in salita, e a quel punto tanto vale che giochi mundo.\n\ninsomma, in sostanza i cambiamenti potrebbero anche starci, se non fosse che quello slow rende inutile la W in tf, dove servirebbe","replies":[{"poster":"DANJERpuntoEXE","date":"2017-05-19T16:28:35.187+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Easlay,realm=EUW,application-id=cAOZwaUi,discussion-id=7QNhkppu,comment-id=000100000002,timestamp=2017-05-19T10:54:25.599+0000)\n>\n> onestamente ci son un po di buff e nerf, il problema è che alcuni nerf sono nosense (Q channeling, W che ti slowa del 60%).\n> il problema principale però sta nello slow del 60%, questo vuol dire che mandi totalmente a quel paese il potenziale di rammus di stare addosso all&#x27;adc nemico una volta finito l&#x27;effetto del taunt, in quanto diventi un paracarro che corre quanto un sasso che prova a rotolare in salita, e a quel punto tanto vale che giochi mundo.\n> \n> insomma, in sostanza i cambiamenti potrebbero anche starci, se non fosse che quello slow rende inutile la W in tf, dove servirebbe\n\nSapete che la w si può interrompere? 60 % è effettivamente tanto ma ha anche dei danni altini. Credo lo porteranno a 40 %.","replies":[{"poster":"Logain Ablar","date":"2017-05-19T17:37:21.763+0000","up_votes":1,"down_votes":0,"body":"è vero che si può interrompere, ma se lo fai muori (e se non lo fai muori lo stesso perchè rimani indietro e non puoi fuggire) a sto punto gli dessero il tank direttamente nella passiva e la W serve solo a riflettere i danni e non a sopravvivere (lo so è sgravo)","replies":[]}]}]},{"poster":"Logain Ablar","date":"2017-05-19T06:18:26.500+0000","up_votes":1,"down_votes":0,"body":"oltre a leggere lo hai provato? pare di no .. è + veloce ma dura di meno quindi a conti fatti è la stessa cosa","replies":[]},{"poster":"Ste the ripper","date":"2017-05-19T05:56:29.308+0000","up_votes":1,"down_votes":0,"body":"Va più veloce ma ora è una canalizzazione, ciò significa che non puoi attivare gli item mentre la usi e che i silence ti fermano.\nLa w nuova è davvero stupida.\n\n","replies":[]}]}]},{"poster":"Killer SurpRyze","date":"2017-05-19T07:29:13.138+0000","up_votes":1,"down_votes":0,"body":"in effetti il rallentamento sulla W la rende meno potente di come era prima, ma c'è anche da dire che prima veniva usata \"per forza\" (come il vecchio scudo di galio): entravi in combattimento, usavi la W. Non c'era bisogno di strategia, era una cosa automatica. Ora invece bisogna pensare a quando usarla o quando disattivarla. Miglioreranno il sistema, vedrete","replies":[{"poster":"Logain Ablar","date":"2017-05-19T08:11:45.993+0000","up_votes":1,"down_votes":0,"body":"il problema di rammus è che al contrario di altri tank ha un kit che se non attivi la W muori senza far nulla (cioè rammus se non viene attaccato non fa nulla e se attivi la W e ti immobilizzi potrebbero semplicemente ignorarti)\nse non sbaglio rammus è l'unico tank che ha CC a 0 range e l'unico gap closer non è un dash ma semplice mov speed \ngiusto per far qualche esempio\nnautilus ha l'ancora quindi può grabbare a distanza, uno scudo un hard cc R (oltre alla passiva)\namumu ha la Q per entrare in fight\nseju ha un dash\nmundo cammina solo e non ha cc... ma non è un jungler \nmalp ha cc gap closer ecc\ngalio pure\nj4 pure\nmao pure\nzac pure","replies":[]}]}]}