{"poster":"GigglesO","date":"2018-01-10T05:08:55.813+0000","title":"I can nolonger say League has a place for me.","subforum":"Gameplay","up_votes":189,"down_votes":37,"body":"I used to think that I was pretty good at this game. Then the new runes hit. \n\nAs a last two seasons Diamond. I can&#039;t even win games against silvers or golds. I may as well even be considered for a ban for intentionally feeding with how bad I do. InB4 Boosted, no, I fucking worked for it at 55% winrate over many games. I&#039;m just not allowed to play anything that has sustain or tanky, that isn&#039;t also gg one shot worthy. I don&#039;t want to fucking one shot the enemy. I want to live long enough to make meaningful decisions, or outplay the enemy through micro movements. Not just &quot;stay out of range or you deserve to die&quot;. \n\nWhy the fuck is damage so high that 1 cc means 100% chance of death?\nFor that matter why does everything hurt so much? \nI&#039;m tired of having 180 armor and taking 1/4 of my hp in one hit. At that point what the fuck is even the point of having defense items? \n\nYou know what people are complaining about on ORN... his damage... What do you nerf? His skill expression in ignoring CC... Oh great... \n\nIts like you don&#039;t get it riot. You didn&#039;t get your playerbase by having a game where everyone one shot eachother... so why are you trying to make League do that? \n\nAre you even gaining customers at this point? Because I for one barely enjoyed last season, and I&#039;m not far off from uninstalling this POS game. Even winning doesn&#039;t feel good right now. \n\nHistorically when someone did too much damage, you nerfed them... What, did we just finally decide fuck it everyone should be an assasin?\n\nWTF ever happened to surviving burst damage with tank items?\n","replies":[{"poster":"Douglas Funnie","date":"2018-01-10T05:24:54.293+0000","up_votes":75,"down_votes":11,"body":"It's not that you're a bad player... It's the fact that Riot implemented Rune's Reforged to help cater toward new players.  By adding RNG elements in-game, new players have the opportunity to shine.   When adding  excessive damage with RNG elements, the skill gap diminishes.  So, lower skilled players can equally compete against higher skilled players.    \n\nAll these years, you have gained experience through learning.  However, all of that experience and game knowledge has been diminished due to these new Rune changes which allow new players to make an impact in the game.  New players got all the tools and all the damage to power through other players and towers. \n\nWith high damage across the board and overloaded runes, there's no reason to strategize anymore.  It's all about one shotting champions and towers. \n\nIt's been over a month of preseason, yet Riot has done nothing about gameplay issues revolving around balance.  I'm certain that this is the road Riot wants to take throughout Season 8 and beyond.  Riot will continue to focus on overpowered runes / champions, and on RNG elements.\n\nIt's sad to see a veteran players like yourself feel this way.  I know exactly how you feel, bro.  I feel the same way.\n\nI invested a lot of time and money on this game over the years and I'm frustrated with Riot.  They have turned a competitive game into a casual game...  I no longer support Riot Games. ","replies":[{"poster":"Death by Glamour","date":"2018-01-10T05:51:55.891+0000","up_votes":10,"down_votes":1,"body":"I agree with what you said but what rng runes did they add besides klepto?","replies":[{"poster":"Douglas Funnie","date":"2018-01-10T06:02:56.341+0000","up_votes":19,"down_votes":11,"body":"Anything that has to do with RNG. Klepto, Zoe, Dragons, Plants. etc.","replies":[{"poster":"Chromatic Eagle","date":"2018-01-10T16:12:09.942+0000","up_votes":19,"down_votes":0,"body":"I don't think dragons are bad, and are the plants really rng?","replies":[{"poster":"AMYS GRAVE","date":"2018-01-10T16:52:09.660+0000","up_votes":7,"down_votes":3,"body":"Plant spawn locations were normalized but their spawn timers are still RNG within a window. You can check for the blast cone behind dragon and it will be down, but it can spawn while you're doing dragon which changes things dramatically, especially against low mobility junglers. If their respawn timers were deterministic you could know that the blast cone wouldn't respawn while you're doing drag based on when it was last used.","replies":[]}]}]}]},{"poster":"Śhunpo","date":"2018-01-10T07:50:51.169+0000","up_votes":5,"down_votes":0,"body":"WELCOME TO MY INN!!!!!\n\nBY FIRE BE PURGED!!!!","replies":[]},{"poster":"Aùtistic Lux","date":"2018-01-10T15:08:52.681+0000","up_votes":7,"down_votes":3,"body":"That's why I was so against the new runes and tried my best to stop them. Too bad I didn't receive *any* help from the community to stop them.\nLook how great the gameplay is now...","replies":[]}]},{"poster":"Death by Glamour","date":"2018-01-10T05:53:35.378+0000","up_votes":49,"down_votes":0,"body":"Does this kind of short gamestyle appeal to the eastern markets or casual gamers at all?\n\nBecause i am yet to meet a person that is actually enjoying this","replies":[{"poster":"GigglesO","date":"2018-01-10T05:57:39.141+0000","up_votes":28,"down_votes":0,"body":"This is what I really want to know. Why are we changing the game to be a completely different game?","replies":[{"poster":"Douglas Funnie","date":"2018-01-10T06:06:41.366+0000","up_votes":29,"down_votes":5,"body":"The simple answer. **Noobs. **\n\nRiot wants to cater toward new players. By adding RNG elements and excessive damage to both champions and runes, new players have the opportunity to shine. Flashy plays will swoop dat Polo and Gucci to the top.\n\nRiot thinks that by making League a casual friendly game, more people will play.  More people means more money.  Also, by implementing a new RNG loot system, Riot will be able to take advantage over impatient players who are keen to gambling.\n\nWhat Riot doesn't understand is that they are doing exactly what 343 Industries did with the Halo Franchise.  Bungie's Halo 1-3 provided incredible competitive gaming with E-sports backing them up. MILLIONS of players played Halo 3.  However, when 343 Industries took over, Halo 4 was released.  Halo 4 was a complete casual snooze fest where players were able to spawn power weapons under their feet (hmm, think Zoe) and spawned a One-shot mini shotgun pistol as their secondary weapon... ( Also, think about one shotting champions and towers.)  E-sports dropped Halo 4 because of it's casual atmosphere and the popularity died so fast.  Even the legendary Chris Puckett left the Halo scene... Chris Puckett...","replies":[{"poster":"Death by Glamour","date":"2018-01-10T18:37:11.695+0000","up_votes":12,"down_votes":0,"body":"you would have thought ghostcrawler would have learned something after wotlk but I guess not","replies":[]},{"poster":"Jinx Hunter","date":"2018-01-10T11:33:52.161+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Douglas Funnie,realm=NA,application-id=3ErqAdtq,discussion-id=PVrLIU1n,comment-id=000400000000,timestamp=2018-01-10T06:06:41.366+0000)\n>\n> The simple answer. **Noobs. **\n> \n> Riot wants to cater toward new players. By adding RNG elements and excessive damage to both champions and runes, new players have the opportunity to shine. Flashy plays will swoop dat Polo and Gucci to the top.\n> \n> Riot thinks that by making League a casual friendly game, more people will play.  More people means more money.  Also, by implementing a new RNG loot system, Riot will be able to take advantage over impatient players who are keen to gambling.\n> \n> What Riot doesn&#x27;t understand is that they are doing exactly what 343 Industries did with the Halo Franchise.  Bungie&#x27;s Halo 1-3 provided incredible competitive gaming with E-sports backing them up. MILLIONS of players played Halo 3.  However, when 343 Industries took over, Halo 4 was released.  Halo 4 was a complete casual snooze fest where players were able to spawn power weapons under their feet (hmm, think Zoe) and spawned a One-shot mini shotgun pistol as their secondary weapon... ( Also, think about one shotting champions and towers.)  E-sports dropped Halo 4 because of it&#x27;s casual atmosphere and the popularity died so fast.  Even the legendary Chris Puckett left the Halo scene... Chris Puckett...\n\nTSquared and Snipe down were better.","replies":[{"poster":"Douglas Funnie","date":"2018-01-10T12:29:48.890+0000","up_votes":6,"down_votes":0,"body":"Damn, I miss the good old Halo days, man.","replies":[{"poster":"Jinx Hunter","date":"2018-01-10T13:14:06.815+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Douglas Funnie,realm=NA,application-id=3ErqAdtq,discussion-id=PVrLIU1n,comment-id=00040000000000000000,timestamp=2018-01-10T12:29:48.890+0000)\n>\n> Damn, I miss the good old Halo days, man.\n\nAll of us old Halo 2/3 players do. Shit I even miss Reach. As much shit as I laid on reach it was still a halo game, unlike 4 and 5.","replies":[]}]}]},{"poster":"Azadethe","date":"2018-01-10T12:25:00.372+0000","up_votes":1,"down_votes":10,"body":"RNG doesn't help nubs unless they are playing Jinx. I guarantee a skilled player will always beat a nub whose given an RNG lead. \n\nHave you never been in a game consisting of 8 level 7-20 players and 2 Plats in a duo boosting one of those level 7-20? I have.\n\nI can beat the crap out of the Plat who is adcing as Nami. But when her Darius top comes down after we've 0/5'd his duo Caitlyn, it's over. My adc will get caught, reset Darius's ult, keep fighting, and Darius will pick up the fast Triple, and that sets the tone more than Me shutting down his 0/5 Duo did.\n\nI once had a team go literally 3/30 within 15 minutes. Those kills were all on 3 people, and I and a mid Gangplank were the only ones not feeding.  Gangplank claimed to be able to 1v5 if we just stayed in and didn't surrender. Guess what? After GP had 2 items, He and I pretty much 2v5's the other team long enough that our 3 feeders caught up enough to win the game HARD. It took about 46 minutes, but the smurf GP created the momentum for the game with his barrels and attacks. The other team never even had a chance to win.\n\nI've also been on the losing side of this equation. Shortly after Evelynn came out, I instantly went 15/1 one game, but at the same time as I was killing the other team nonstop, the other team's Zed was 1v4ing my team's other players. It was basically a war of the assassins, and I ended with 29/8/18, and he ended with 26/13/12 or something like that. He won, because his LANE pressure was better than mine. As Evelynn I just couldn't push the turrets pre new runes (not enough self heals)\n\nRNG far caters those who have the rare ability to control a game's pressure. Not those who get a couple hits off it and then lose it.","replies":[{"poster":"The JigSAW","date":"2018-01-10T13:46:14.391+0000","up_votes":4,"down_votes":0,"body":"See, this is one of the fundamental problems with the game right now. Two plats beating up level 7-20 players? Is this really a badge of honor for you? More importantly how bad is the matchmaking to allow something like this!","replies":[{"poster":"Azadethe","date":"2018-01-10T13:55:02.823+0000","up_votes":1,"down_votes":3,"body":"It's pretty common tbh. Normals don't prohibt high elos from attaching to a low person and the low person makes the lobby. Normals are also full of a CRAP TON of smurfs who are, like Tyler1, Banned for various reasons or streaming. I've seen some 13 KDA players while trying to grind an account up. I'm only about Plat II. It's annoying to see Diamond/Challengers going in and 1v5ing.","replies":[{"poster":"The JigSAW","date":"2018-01-10T14:04:33.866+0000","up_votes":7,"down_votes":1,"body":"I'd have to agree but nothing surprises me anymore about the way League is going.  Some people complain League is leaning to the casuals, I'd disagree.  God forbid the pros have anything wrong because whatever they say is the only thing Riot cares about.  Its still amazing to me how much they want us to be like the pros but remove Team Builder which guaranteed our role and champion, which is -basically- what pro players get (role, at least)","replies":[{"poster":"Crusader4213","date":"2018-01-10T22:41:53.694+0000","up_votes":4,"down_votes":0,"body":"They cater to the casuals because that's where they get their revenue...idiots that watch pro players and buy skins/champions that they see their favorite pro player using is what earns Riot millions/billions of dollars, not pros. If they catered to the pros, there wouldn't be so much broken shit and so much RNG elements to the game","replies":[]}]}]}]}]}]}]}]},{"poster":"Built to Tylt","date":"2018-01-10T05:21:42.076+0000","up_votes":48,"down_votes":10,"body":"This is why I'm boycotting League. \n\nI invite everyone to do so. :)","replies":[{"poster":"Wráthful","date":"2018-01-10T14:38:37.391+0000","up_votes":15,"down_votes":1,"body":"> [{quoted}](name=Built to Tylt,realm=NA,application-id=3ErqAdtq,discussion-id=PVrLIU1n,comment-id=0000,timestamp=2018-01-10T05:21:42.076+0000)\n>\n> This is why I&#x27;m boycotting League. \n> \n> I invite everyone to do so. :)\n\nthe biggest thing we could do is to stop buying those lame-ass loot boxes and they will start hearing to our feedback.","replies":[{"poster":"Oxyrotten","date":"2018-01-10T23:54:09.767+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Boreto,realm=EUNE,application-id=3ErqAdtq,discussion-id=PVrLIU1n,comment-id=00000000,timestamp=2018-01-10T14:38:37.391+0000)\n>\n> the biggest thing we could do is to stop buying those lame-ass loot boxes and they will start hearing to our feedback.\n\nWe aren't tencent's primary market though. Riot won't even notice us boycotting, especially not after the holiday season. \n\nThe Asian gaming community outnumbers us like 4 to 1, and the asian gaming cafe demographic is tencent's primary market, they also demand games under 30 mins. Coincidence?","replies":[]}]},{"poster":"Sugar Momma","date":"2018-01-10T19:04:44.645+0000","up_votes":9,"down_votes":0,"body":"I've had so many friends quit over the past couple months. It's kinda sad.","replies":[]},{"poster":"Hrmz","date":"2018-01-11T04:56:11.807+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Built to Tylt,realm=NA,application-id=3ErqAdtq,discussion-id=PVrLIU1n,comment-id=0000,timestamp=2018-01-10T05:21:42.076+0000)\n>\n> This is why I&#x27;m boycotting League. \n> \n> I invite everyone to do so. :)\n\nCount me in. \n\nThis feels like that dumbass Ghostcrawler. He used to do dumb shit like this to WoW until he made everyone quit.","replies":[]}]},{"poster":"Lil Homie busta","date":"2018-01-10T06:58:29.606+0000","up_votes":30,"down_votes":2,"body":"Game's balance started to go downhill since patch [5.22](https://na.leagueoflegends.com/en/news/game-updates/patch/patch-522-notes). The new runes was just the cherry on top of the turd cake.\n\nEvery class update manage to be a disaster, breaking class by class, until we reach this complete clowfiesta that the game is today.","replies":[{"poster":"Śhunpo","date":"2018-01-10T07:50:04.584+0000","up_votes":15,"down_votes":3,"body":"It happened long before 5.22. It initially started when the Juggernaut update hit. That's when we saw Riot's true colours.","replies":[{"poster":"Count Zubat","date":"2018-01-10T16:48:18.950+0000","up_votes":7,"down_votes":1,"body":"Yep, 5.16, that was the point where downfall started.","replies":[]}]}]},{"poster":"Altiverse","date":"2018-01-10T09:12:12.123+0000","up_votes":19,"down_votes":2,"body":"Yeah. I can confidently say that it feels like Riot is throwing any sort of balance or strategical perspective of the game out of the window. \nThe champion you pick apparently has more impact on your performance than how you play the game.\nPatch 8.1 \"balance changes\" seem to be a form of Riot laughing in its players' faces, ignoring any kind of feedback about balance and proceeds to roll out the new season with it.","replies":[{"poster":"Who is Taliyah","date":"2018-01-10T15:12:14.134+0000","up_votes":10,"down_votes":1,"body":"I am really excited to see how their pro-play is going to turn out.\n\nOnly thing we can hope for is that the pro players stand up against this trash balancing.","replies":[{"poster":"Crusader4213","date":"2018-01-10T23:42:31.144+0000","up_votes":7,"down_votes":0,"body":"Tons of pro players say that champs or runes are broken but they don't care, they're not balancing for the pros they \"balance\" for money. I personally think pro play is going to be terrible to watch because games being decided within minutes of starting isn't exciting to me...however I could see a lot of little kids really liking watching the LCS and seeing people solo kill their enemy laner over and over off 1 spell rotation. Kind of like a Michael Bay movie, lots of explosions and special effects but not much actual substance or gameplay in this case. I could be wrong though","replies":[]}]}]},{"poster":"MrHaZeYo","date":"2018-01-10T05:26:58.330+0000","up_votes":17,"down_votes":1,"body":"You're not wrong.","replies":[]},{"poster":"General Esdeath ","date":"2018-01-10T08:22:27.501+0000","up_votes":14,"down_votes":0,"body":"I'm just doing one game a day for FWOTD blue essence and exp\n\nThis game really lost its touch. Gonna do my 10 placements but that's probably gonna be it for me for a while.","replies":[]},{"poster":"LXII","date":"2018-01-10T08:46:24.205+0000","up_votes":13,"down_votes":0,"body":"I was gonna type out all the reasons I agree with you, then I took a second look at the name and realized we already had this conversation on my stream earlier lol. Glad you posted something, maybe after more people do they'll realize we don't want this shit.","replies":[{"poster":"GigglesO","date":"2018-01-10T09:13:53.190+0000","up_votes":8,"down_votes":0,"body":"That was actually the first time I had played in two weeks, I just can't bring myself to solo queue right now. When I don't have teammates I just feel meh about playing. This comes from me playing solo in solo queue 80-90% of the time last season across 2k games... Playing with teammates wasn't my norm. I'm glad I could be in part of your games tonight though, at least that part was fun.","replies":[]}]},{"poster":"Keitron","date":"2018-01-10T06:44:01.061+0000","up_votes":13,"down_votes":0,"body":"I really miss last season, i used to play league at least a game everyday now i play once in a blue moon.","replies":[]},{"poster":"Mordepool","date":"2018-01-10T07:54:54.109+0000","up_votes":12,"down_votes":1,"body":"What I want this game to be is long dead.  I play more dark souls and Bloodborne. Since I know its a fair balanced game","replies":[]},{"poster":"ŽeroGravity","date":"2018-01-10T06:12:15.302+0000","up_votes":12,"down_votes":2,"body":"I agree the new Rune system sucks!!! The older system was much nicer because you could individualize each champion to your play style and build them defensively or offensively based on what you went up against. No doubt the older system let you go out of the Meta with some of the champions but not nearly as much as you can now with the new runes system. Seeing Taric played top is op as fuc; Teemo has now been strong in mid lane along with a long list of other strange things. Only 15% of the champion roster is viable, then 80% of the champs aren't worth playing and the other 5% are out stuck in limbo. Riot has failed us. They should have just made all the old runes free instead of these drastic measures with the new runes system.","replies":[{"poster":"LF Annie","date":"2018-01-10T12:18:32.818+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=ŽeroGravity,realm=NA,application-id=3ErqAdtq,discussion-id=PVrLIU1n,comment-id=0006,timestamp=2018-01-10T06:12:15.302+0000)\n>\n> I agree the new Rune system sucks!!! The older system was much nicer because you could individualize each champion to your play style and build them defensively or offensively based on what you went up against. No doubt the older system let you go out of the Meta with some of the champions but not nearly as much as you can now with the new runes system. Seeing Taric played top is op as fuc; Teemo has now been strong in mid lane along with a long list of other strange things. Only 15% of the champion roster is viable, then 80% of the champs aren&#x27;t worth playing and the other 5% are out stuck in limbo. Riot has failed us. They should have just made all the old runes free instead of these drastic measures with the new runes system.\n\nthis isnt even a rune system, its a mastery system they masqueraded as a rune system to jip two learning curves into one shitshow.","replies":[]}]},{"poster":"Captainn Ginyu","date":"2018-01-10T06:21:30.511+0000","up_votes":9,"down_votes":0,"body":"no i agree this seasson is so much more frustrating then its ever been honestly it was a lot easier to deal with s1 xin then it is to deal with this entire season i know its pre season but i feel like that dosent fuckin matter any way riots not making any meaning full changes at all an for some reason \n\nidk what happened i dont get why riot refuses to listen to anyone now","replies":[]},{"poster":"TS Hokori","date":"2018-01-10T22:03:31.324+0000","up_votes":8,"down_votes":0,"body":"[](https://gfycat.com/FaroffVastAnkolewatusi)\n\n#Balanced\n\nhttps://gfycat.com/FaroffVastAnkolewatusi","replies":[]},{"poster":"RainXBlade","date":"2018-01-10T16:02:47.583+0000","up_votes":8,"down_votes":0,"body":"I want League to go back to when it was actually fun and fair. I know for a fact that this game can't be balanced, but the fun factor for all elos should be there at least. \n\nI started playing League since Season 2 and had lots of fun right of the bat. Nowadays, I'm on the same boat as you, OP. I'm also not having fun when I play and finding it hard to do so.","replies":[]},{"poster":"Aùtistic Lux","date":"2018-01-10T15:06:21.534+0000","up_votes":9,"down_votes":1,"body":"Just as much as I love this game ( more like used to*), I hate the company.\nThe Riot Balance team is a total joke, only provide unnecessary and unhealthy changes, and few hours ago I heard they're removing sightstone too, I guess I'll join you on leaving this game. Sucks to know that back at season 2/3 League was in a better state on the gameplay side. At least tanks didn't have assasin damage.","replies":[{"poster":"Banana 18 Bro","date":"2018-01-10T16:19:53.427+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Inorynn,realm=EUW,application-id=3ErqAdtq,discussion-id=PVrLIU1n,comment-id=0013,timestamp=2018-01-10T15:06:21.534+0000)\n>\n> Just as much as I love this game ( more like used to*), I hate the company.\n> The Riot Balance team is a total joke, only provide unnecessary and unhealthy changes, and few hours ago I heard they&#x27;re removing sightstone too, I guess I&#x27;ll join you on leaving this game. Sucks to know that back at season 2/3 League was in a better state on the gameplay side. At least tanks didn&#x27;t have assasin damage.\n\nI'm removing their heads if they remove sightstone. You better make april jokes here my dude lol.","replies":[]}]},{"poster":"sirwaterfles","date":"2018-01-10T18:03:44.035+0000","up_votes":7,"down_votes":1,"body":"I feel exactly the same; i used to be addicted to this game and call it chess but with action. Then last season started and for the first time i actually stopped playing the game for a while pure of how unfun it was (patch 7.2 to patch7.4) i came back and thing got slowly better until midseason; what a clusterfuck and the definite startshot for this downward spiral. I stopped playing soloq and only continued to play with my team. With the start of preseason and their falure for the firsttime to adress the faults for the first time by the end of a season and even creating a whole bunch of new shit without adressing the old stuff, i stopped playing alltogether. Now after 2 months im back only because my old team begged me. I have great fun hanging with those guys but the game itself is such an unfun generic call of duty 1 shot everything game atm that i dont think i will stick around for long if things dont change.","replies":[]},{"poster":"Urgot x BDSM","date":"2018-01-10T05:43:18.986+0000","up_votes":3,"down_votes":3,"body":"Strange... I've come back to league recently (Chinese server, but that doesn't matter) and one of my highest winrate champs is Skarner. I don't feel like I'm getting oneshot with Scar, even though in most of my games I only build tank items after warrior+trinity. The only times I got instakilled were when I got under the whole enemy team focusfire.","replies":[{"poster":"Stand Alone Wolf","date":"2018-01-10T14:26:50.268+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Urgot x BDSM,realm=EUW,application-id=3ErqAdtq,discussion-id=PVrLIU1n,comment-id=0003,timestamp=2018-01-10T05:43:18.986+0000)\n>\n> Strange... I&#x27;ve come back to league recently (Chinese server, but that doesn&#x27;t matter) and one of my highest winrate champs is Skarner. I don&#x27;t feel like I&#x27;m getting oneshot with Scar, even though in most of my games I only build tank items after warrior+trinity. The only times I got instakilled were when I got under the whole enemy team focusfire.\n\nI wonder how Vayne feels about this.","replies":[]}]},{"poster":"Banana 18 Bro","date":"2018-01-10T16:16:56.918+0000","up_votes":6,"down_votes":1,"body":"Exactly my thoughts!\n\nI'm sick of those lethality items being so over-powered it's fucking annoying the fuck out of me. I just lost a flex game against 5 AD champion (talon and rengar in that comp). We were winnig so hard early game, zac our jungle was able to build thornmale so early, I was surprised! The moment rengar and talon came with 3 lethality items and lord dominik or mortal reminder, we were dying like we had no god damn fucking items on us.\n\nI remember having 65-70% win ratio with Janna before her 2 major nerfs and the nerfs on the core items ({{item:3504}} {{item:3107}}). Now I can barely get above 55% win ratio with any of my main supports. I'm trying to get into this tanky meta and play Braum in the meantime but it seems like all those lethality items make it useless for the tanks too. \n\nMiss Fortune from an ADC went to an assassin for just couple of months. Everyone is building lethality on her too. Same for Jhin. Same for Graves (we can justify him cause he's jungle now -.-).\n\nIt was cool before when you build one armor penetration item ({{item:3036}} or {{item:3033}}) and manage to outplay the enemy. Now it's all fucked up and all your tanks are useless if someone manages to get some assists or 1-2 kills to build 2 lethality items.\n\nThis meta is pissing me the fuck off seriously.","replies":[]},{"poster":"TlT1T1T1T1T1TlT","date":"2018-01-11T15:55:33.306+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=GigglesO,realm=NA,application-id=3ErqAdtq,discussion-id=PVrLIU1n,comment-id=,timestamp=2018-01-10T05:08:55.813+0000)\n>\n> I used to think that I was pretty good at this game. Then the new runes hit. \n> \n> As a last two seasons Diamond. I can&amp;#039;t even win games against silvers or golds. I may as well even be considered for a ban for intentionally feeding with how bad I do. InB4 Boosted, no, I fucking worked for it at 55% winrate over many games. I&amp;#039;m just not allowed to play anything that has sustain or tanky, that isn&amp;#039;t also gg one shot worthy. I don&amp;#039;t want to fucking one shot the enemy. I want to live long enough to make meaningful decisions, or outplay the enemy through micro movements. Not just &amp;quot;stay out of range or you deserve to die&amp;quot;. \n> \n> Why the fuck is damage so high that 1 cc means 100% chance of death?\n> For that matter why does everything hurt so much? \n> I&amp;#039;m tired of having 180 armor and taking 1/4 of my hp in one hit. At that point what the fuck is even the point of having defense items? \n> \n> You know what people are complaining about on ORN... his damage... What do you nerf? His skill expression in ignoring CC... Oh great... \n> \n> Its like you don&amp;#039;t get it riot. You didn&amp;#039;t get your playerbase by having a game where everyone one shot eachother... so why are you trying to make League do that? \n> \n> Are you even gaining customers at this point? Because I for one barely enjoyed last season, and I&amp;#039;m not far off from uninstalling this POS game. Even winning doesn&amp;#039;t feel good right now. \n> \n> Historically when someone did too much damage, you nerfed them... What, did we just finally decide fuck it everyone should be an assasin?\n> \n> WTF ever happened to surviving burst damage with tank items?\n\nI was about to quit UNTIL these new runes.  Before you bail on my post, here is what I mean.\n\nI'm AWFUL at this game... I have no strategy... I wander off all by myself... I have no map awareness.\n\nHowever, with the new runes, holy crap... I can literally destroy ANY single person I want in any game.  I am great at chaining my items/abilities (but just once).  the way the game is now, you can just get 1 good chain off, and destroy any target.  I've never won so many games as I am now.\n\nNOTE:  I know full well that this is NOT a good sign.  \n\nTLDR:\nI am amazing with the new runes... because they reward agression and being stupid\nThe new runes are NOT good for this game as a whole.","replies":[]},{"poster":"xXRaichopXx","date":"2018-01-11T00:43:52.301+0000","up_votes":4,"down_votes":0,"body":"And even after numerous complaints about tanks not being tanky, they go and change the resolve tree to have less hp and ATTACK SPEED. Dumbass balance team needs to be fired.","replies":[]},{"poster":"Mody bird","date":"2018-01-10T23:35:18.603+0000","up_votes":4,"down_votes":0,"body":"I agree that this game lost skill. I used to dominate people lower ranks than me when i was high plat now i feel like i can struggle against golds/silvers simply because they can one shot me","replies":[]}]}