{"poster":"GigglesO","date":"2017-03-11T02:27:54.021+0000","title":"If you want to buff rammus and amumu jungle without actually changing anything Major!","subforum":"Gameplay","up_votes":138,"down_votes":11,"body":"Make jungle monsters attack a lot faster, but lower their damage so that its a net neutral. \n\nRammus w and amumu e will allow for faster clears. \n\nBut I know this won't get enough attention so.... so much for trying to help with ideas for rito balance.\n\n\nEdit: or buff those skill's interactions with monsters.","replies":[{"poster":"MunchCrunchLunch","date":"2017-03-11T03:21:21.763+0000","up_votes":30,"down_votes":1,"body":"that would create serious implications in the jungle system that are beyond our pre thoughts. idk about that\n\nso basically Riot has no problem doing it","replies":[{"poster":"GigglesO","date":"2017-03-11T03:50:04.586+0000","up_votes":5,"down_votes":0,"body":"I guess it would make the two less damage mastery stronger, didn't think of that.... not really sure if people pick it up anyways.","replies":[{"poster":"Votable Jester","date":"2017-03-12T06:23:51.631+0000","up_votes":3,"down_votes":0,"body":"It could also hurt Panth jungle.","replies":[]}]}]},{"poster":"Jesus is Savior","date":"2017-03-11T07:10:30.672+0000","up_votes":12,"down_votes":7,"body":"This is a nerf to champions who block/dodge attacks. So no.\n\nThis \"actually changes something major.\"\n\nExamples of block/dodge: {{champion:11}} {{champion:105}} {{champion:80}} \n\nIt also makes kiting harder: {{champion:28}} {{champion:104}} {{champion:29}}","replies":[{"poster":"Nogrim","date":"2017-03-11T07:19:02.235+0000","up_votes":22,"down_votes":3,"body":"out of the block/dodge this only really hurts pantheon (the other two are time based dodges) not single hit.\n\nkiting wise evelyns the only one intended as a jungler, who has a spammable slow so if you are doing it right the AS doesnt matter as they shouldnt be hitting you anyway. pretty minor effect on all of them anyway and the -2 dmg mastery will do more to reduce the damage to them anyway.","replies":[{"poster":"Jesus is Savior","date":"2017-03-11T07:41:26.301+0000","up_votes":13,"down_votes":14,"body":"> [{quoted}](name=Nogrim,realm=NA,application-id=3ErqAdtq,discussion-id=1v2xVJoM,comment-id=00060000,timestamp=2017-03-11T07:19:02.235+0000)\n>\n> out of the block/dodge this only really hurts pantheon (the other two are time based dodges) not single hit.\n> \n> kiting wise evelyns the only one intended as a jungler, who has a spammable slow so if you are doing it right the AS doesnt matter as they shouldnt be hitting you anyway. pretty minor effect on all of them anyway and the -2 dmg mastery will do more to reduce the damage to them anyway.\n\n1) They aren't \"time based dodges\" - you dodge during the monster's autoattack animation to make them cancel the AA and have to wind up again. You are literally dodging one attack.\n\n2) Evelynn doesn't have a \"spammable slow.\" Most Eves don't build Rylais anymore, and even if they did, **_NOT as a first item._**\n\nYour entire post is false.\n\nEDIT: 5 upvotes and 4 downvotes, really? I wasn't going to bring up his rank but.... The guy is bronze. He doesn't understand the game. His information is 100% false.","replies":[{"poster":"TwinkiePro","date":"2017-03-11T22:30:46.670+0000","up_votes":3,"down_votes":0,"body":"While he is indeed incorrect about evelynn, he is not wrong about the -2 damage from monsters mastery. Changing this would be an inderect buff towards it.","replies":[]},{"poster":"Clementine","date":"2017-03-11T19:00:08.602+0000","up_votes":2,"down_votes":2,"body":">This guy is Bronze\n\nComing from the Silver 3 47% winrate tho","replies":[{"poster":"Jesus is Savior","date":"2017-03-11T19:36:32.857+0000","up_votes":2,"down_votes":5,"body":"> [{quoted}](name=Lulu Hentai,realm=NA,application-id=3ErqAdtq,discussion-id=1v2xVJoM,comment-id=0006000000000000,timestamp=2017-03-11T19:00:08.602+0000)\n>\n> Coming from the Silver 3 47% winrate tho\n\nHe has never been higher than bronze in his entire league career.\n\nI just haven't bothered to climb yet.","replies":[{"poster":"Clementine","date":"2017-03-11T19:42:12.711+0000","up_votes":3,"down_votes":3,"body":"Sure sure","replies":[{"poster":"Jesus is Savior","date":"2017-03-12T09:46:51.004+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LuIú,realm=NA,application-id=3ErqAdtq,discussion-id=1v2xVJoM,comment-id=000600000000000000000000,timestamp=2017-03-11T19:42:12.711+0000)\n>\n> Sure sure\n\nI get to plat with Eve every season. I'm playing Yi right now. You do the math.","replies":[]}]},{"poster":"Nogrim","date":"2017-03-12T02:08:00.405+0000","up_votes":1,"down_votes":0,"body":"ranked rank isnt a very intelligent way to gauge some ones knowledge of the game ive been playing since season 1. played fewer than 30 ranked games in that time.\n\non the other hand ive got mastery 5 on some of the least played champions in the game while you only seem to be able to play Yi, with pretty mixed results i may add.","replies":[{"poster":"Jesus is Savior","date":"2017-03-12T09:45:34.674+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nogrim,realm=NA,application-id=3ErqAdtq,discussion-id=1v2xVJoM,comment-id=000600000000000000000001,timestamp=2017-03-12T02:08:00.405+0000)\n>\n> ranked rank isnt a very intelligent way to gauge some ones knowledge of the game ive been playing since season 1. played fewer than 30 ranked games in that time.\n> \n> on the other hand ive got mastery 5 on some of the least played champions in the game while you only seem to be able to play Yi, with pretty mixed results i may add.\n\nIf you actually looked at my stats properly, you'd see that I **_don't_** play yi, and that's why I'm still silver.\n\nI get to plat with Eve every season.","replies":[]},{"poster":"NotFreecell","date":"2017-03-12T04:46:28.272+0000","up_votes":1,"down_votes":0,"body":"its fairly accurate. someone who isnt plat+ doesnt understand mechanics as well as they should.\n\nthat goes for me as well. i notice new shit all the time. like a Mord who kills a Jhin with 4th shot, now has a ghost that always uses 4 shot for infinite crits.","replies":[{"poster":"Nogrim","date":"2017-03-12T07:47:56.595+0000","up_votes":1,"down_votes":0,"body":"it could be accurate if a person only plays ranked.\n\n i've played only enough games to get qualified for two separate seasons. got constantly paired with people who werent even rank 30 yet and had leavers in most of those games. so i just never bothered to keep playing ranked.\n\nthats not an accurate gauge of anything other than how quickly you make an uninformed judgement.","replies":[]}]}]}]}]},{"poster":"Nogrim","date":"2017-03-12T02:02:49.533+0000","up_votes":1,"down_votes":0,"body":"i dont play ranked. its full of toxic people. \ni spend most of my time in normals but i have been playing since season 1 with well over 2k games played and 208 mastery points, ive played maybe 30 ranked games in the last 6-7 years usually just quailifiers where 50% of them had a leaver or an afk (which is why i quit bothering to play ranked)\n\nnow i will admit some of my knowledge on those champs are dated.\n\n1) dodge based on glitching AA animations should be patched out period.\n\n2) you are right, its been a while since ive played eve but she is in a bad spot jungle wise for a lot of reasons, this would not be a major contributor to her already being shit.\n\n\nthe point stands that of these 6 none are really even intended to be junglers other than eve, who is terrible at the role to begin with, balancing actual junglers around them is stupid.","replies":[{"poster":"Jesus is Savior","date":"2017-03-12T08:57:08.274+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nogrim,realm=NA,application-id=3ErqAdtq,discussion-id=1v2xVJoM,comment-id=0006000000000002,timestamp=2017-03-12T02:02:49.533+0000)\n>\n> \n> 1) dodge based on glitching AA animations should be patched out period.\n> \n\nYou say \"rank isn't a good way to gauge someone\" and then say nonsense like this.\n\nYou realize this is the entire point of Master Yi, and not a glitch, right? He doesn't just dodge monster attacks. He can cancel and dodge a champion autoattack while it is winding up (and even certain skills with long cast times, like Darius and Garen ults). **_And that is what he is supposed to do (and designed to do)_**","replies":[]}]}]},{"poster":"BabeisBae","date":"2017-03-11T21:37:48.492+0000","up_votes":1,"down_votes":0,"body":"Why is this upvoted rofl! No seriously, why? First, nobody in their right mind would get Rylais on Eve anymore, like nobody does outside of silver. Hextech is a better tech item and provides more. I feel like you aren't thinking and I'm kinda triggered you bothered making a post telling someone they are wrong when you yourself are the one that is wrong. There is a reason that in 4 years you cant get out of bronze, its because you dont think about the game on a fundamental level. Raptors as they stand make most junglers skip them. But wait, your proposal for upping the AS and lowering the damage, i just wanna point out one thing, just one thing. Rammus and Amumu are 2 of the junglers who can clear raptors/krugs without a problem. Tantrum is busted for aoe clearing, and so is defensive curl. If anything is going to happen to these two champions, its going to be minor because both are fairly good just need some minor tuning to get up to Graves level.","replies":[]}]},{"poster":"An Undead brat","date":"2017-03-11T09:57:15.093+0000","up_votes":9,"down_votes":2,"body":"I know this is a weak argument, but it's also a nerf to {{champion:143}} jungle since her plants take damage per hit and she Rylai's (get it?) on them tanking the jungle monsters damage.","replies":[]},{"poster":"The Yetii Rider","date":"2017-03-11T19:27:53.107+0000","up_votes":4,"down_votes":0,"body":"That's good. Kiting SHOULD be hard, because the benefit of clearing the jungle as a DPS champ (basically you get a free lane with no harass, no ganks, no chance of feeding) is much higher than the benefit of clearing the jungle as an initiation tank (my laning is so horrible that I'm forced to jungle if I want to play this Champion at all, e.g. Amumu, Sejuani, Rammus).\n\nThe jungle is the last place where being melee is an advantage, not a hazard. Ranged champs should feel much more hazard in the jungle.","replies":[{"poster":"Jesus is Savior","date":"2017-03-11T19:38:04.600+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=1v2xVJoM,comment-id=00060003,timestamp=2017-03-11T19:27:53.107+0000)\n>\n> That&#x27;s good. Kiting SHOULD be hard, because the benefit of clearing the jungle as a DPS champ (basically you get a free lane with no harass, no ganks, no chance of feeding) is much higher than the benefit of clearing the jungle as an initiation tank (my laning is so horrible that I&#x27;m forced to jungle if I want to play this Champion at all, e.g. Amumu, Sejuani, Rammus).\n> \n> The jungle is the last place where being melee is an advantage, not a hazard. Ranged champs should feel much more hazard in the jungle.\n\nYa okay try playing Eve in a lane then, and see how much your \"range\" gives you an advantage over melee.\n\n/s","replies":[{"poster":"The Yetii Rider","date":"2017-03-11T19:41:14.101+0000","up_votes":2,"down_votes":0,"body":"Evelynn needs a VGU. Once that's done she won't need to kite monsters to clear the jungle.\n\nQuinn, Graves, Nidalee and Twitch should all have barely any health when they get done with the jungle.","replies":[]}]}]},{"poster":"Earl Eulrich","date":"2017-03-11T21:06:07.883+0000","up_votes":1,"down_votes":0,"body":"well, there would be an easy solution to just buff mumu/rammus here: add a frenzy debuff to taunt/mumu´s crying that gives jungle monsters 200%attackspeed and -66% dmg and there´s no setback for anyone else.\nAlso, Fizz would actually profit aswell as he has a flat dmg reduction in his kit, the only one that really would suffer is panth.","replies":[]}]},{"poster":"BlackFlux","date":"2017-03-11T02:50:13.690+0000","up_votes":5,"down_votes":0,"body":"{{champion:32}}  has good clears with his W/E as monsters AA regardless if you have a protection or not\n{{champion:33}} I agree needs some stuff,his passive only works with armor and not MR so if they have ONE AP champ on there team that's somebody you can hardly counter,slow clears as you have slow AS and only other damage you can do is your W which doesn't do a lot early and your ult...which is your ult. so long cooldown","replies":[{"poster":"Nogrim","date":"2017-03-11T07:22:35.921+0000","up_votes":13,"down_votes":1,"body":"rammus main, mag isnt a big deal, more often than not they just become your priority to powerball/taunt so they arent really casting on anyone so their mag damage is mostly meaningless.\n\neven when it is one mag res item is usually enough because your able to shrugg off so much of the other physical damage and have a decent hp pool anyway.\n\nive always been happy with rammus and i honestly hope they leave his kit the fuck alone. all he needs is a visual update and more than 1 voice line/taunt animation.","replies":[{"poster":"SpecterVonBaren","date":"2017-03-11T15:40:25.863+0000","up_votes":5,"down_votes":0,"body":"A lot of people forget that Rammus's W has an MR steroid alongside the armor one too.","replies":[{"poster":"Nogrim","date":"2017-03-12T01:49:42.866+0000","up_votes":1,"down_votes":0,"body":"smart mages wait for it to drop before casting.... there arent a lot who do though.","replies":[]}]},{"poster":"Toru Itai","date":"2017-03-11T15:38:08.833+0000","up_votes":2,"down_votes":0,"body":"This is the type of main i like.","replies":[]},{"poster":"Big Black Croc","date":"2017-03-12T01:18:19.732+0000","up_votes":1,"down_votes":1,"body":"Hes in list for a VGU, so get ready for ur champ to get fuked\n\n{{champion:90}} {{champion:107}} {{champion:98}}  :^)","replies":[{"poster":"Nogrim","date":"2017-03-12T01:52:28.627+0000","up_votes":1,"down_votes":0,"body":"yeah i've been dreading it since it was announced. his kit is fine, tuning some of his key items has more of an effect on him than tuning his abilities (thornmail, sunfire, warmog etc.) \n\nthe loss of the golem stun from smite was one of the most annoying round about nerfs, though i will admit it wasnt enough to really hurt his viability in most games.","replies":[]}]}]}]},{"poster":"Very Hard Engage","date":"2017-03-11T04:09:08.525+0000","up_votes":4,"down_votes":0,"body":"higher up players would hate it because they cant cancel jungle creeps autos between brushes/clones and AA moves. they would actually need to buy early armor to survive their early game clears, they depend on these things.\n\ntake wukong for example, hes only capable of surviving a full clear early on because of his resetting, if he doesn't he has to back after 2 camps. ","replies":[{"poster":"GigglesO","date":"2017-03-11T04:40:15.075+0000","up_votes":3,"down_votes":1,"body":"That would actually be really good for laners...","replies":[]}]},{"poster":"The Deckowner","date":"2017-03-11T15:07:51.048+0000","up_votes":5,"down_votes":1,"body":"or instead of changing every monster, straight up buff rammus and amumu's ability specifically against monsters.","replies":[{"poster":"Slimegoon","date":"2017-03-11T18:33:02.666+0000","up_votes":3,"down_votes":0,"body":"I don't know why this isn't the top comment.  It's the easiest change that literally doesn't change anything for any other champs, and they do it on many other champs so there's precedent.","replies":[]},{"poster":"Lyndris","date":"2017-03-12T03:46:40.982+0000","up_votes":1,"down_votes":0,"body":"I'll even drop an idea for rammus, w does 10 bonus damage to minions and monsters","replies":[]}]},{"poster":"the weeaboo","date":"2017-03-11T18:58:30.227+0000","up_votes":3,"down_votes":5,"body":"Rammus and Amumu do NOT need buffs. The point of these champs is for crushing lower ELO. Buff them and you're gonna have some unhappy bronzies.\n\nHonestly I'm tired of people thinking bronzecrusher champions need buffs. Some champs just belong in lower ELO only. (If we look at Dota 2 you'll see Ursa, Riki, etc. that only really work when you're up against people who won't bother to try and counter them)","replies":[{"poster":"Standgrounding","date":"2017-03-11T20:15:44.291+0000","up_votes":3,"down_votes":0,"body":"OR happy bronzies who main them.","replies":[]}]},{"poster":"General Esdeath ","date":"2017-03-11T07:16:11.926+0000","up_votes":5,"down_votes":13,"body":"{{champion:114}} deals 1300 true damage\n\n\"Hold on, we gotta nerf Rengar's armor\"\n\n{{champion:91}} one shotting at level 2\n\n\"I think it's time we buff Fizz\"\n\nDoes Riot's balance team even exist? I feel like they have 3 dart boards. One with champs, one with buff/nerf, and one with Q, W, E, and R.","replies":[{"poster":"Sexy Jack Rabbit","date":"2017-03-11T10:09:32.555+0000","up_votes":2,"down_votes":2,"body":"It's almost like multiple champions can be at varying stages of unbalance at the same time.\n\nFiora is kinda Unbalanced, but so is Rengar. \nFizz was weak and gimped by his ultimate's hitbox, it was a necessary change. \nTalon is quite strong due to Lethality, but so is every other AD Assassin.","replies":[{"poster":"Not xPeke","date":"2017-03-11T12:41:17.060+0000","up_votes":4,"down_votes":2,"body":"No Talon isn't just strong due to lethality. He can 100-0 at level 2.\n\nPeople used to complain about old LeBlancs QW damage at level 2.. meanwhile nowadays Talon *first blood*","replies":[{"poster":"Sp33d Zer0","date":"2017-03-11T18:51:02.155+0000","up_votes":1,"down_votes":1,"body":"The difference being that Talon's level 2 requires hitting you twice with one skill shot.\n\nSure he CAN one shot you at level two, but look at how many other champions can one combo someone at level 2...\n{{champion:92}} {{champion:103}} {{champion:43}} {{champion:53}} {{champion:240}} {{champion:80}} ...\n\nThe list goes on, but I think you get my point.","replies":[{"poster":"Not xPeke","date":"2017-03-11T19:29:59.079+0000","up_votes":2,"down_votes":0,"body":"ahri can't 100-0 you at level 2 unless you massively missplay at lvl 1 and get poked out loads and didn't pot up.\nDon't lie please. And even if she could do it, it would require her to her skill shot twice as well, same with Ekko. So I don't see how you pointed that out then proceeded to make that information rather useless since there is no \"difference\" as you tried to point out.\n\nAnd hitting it twice with that skill shot frankly isn't hard. \nA skilled Talon will be able to get it off everytime they go to CS and chip away at their health. \nThen he'll instagib you with his combo, even pre 6. \nHis 3 hit passive thingy does an insane amount of damage, pop ignite and cy@.","replies":[{"poster":"Sp33d Zer0","date":"2017-03-11T19:38:40.922+0000","up_votes":1,"down_votes":0,"body":"So you're saying that a level 1 talon will chip your health away and then all in you at level 2?\n\nhmmmmm....\n\nI mean, a level 2 talon has, we'll say, 80 AD including runes and masteries.\n\nDoing the math, you get 220 damage from his passive.\n168 from q as he likely has to jump at you.\n190 from his w.\n90 from ignite.\n\nThis is completely ignoring armor, Talon can do 670 damage. \nIf you have even 30 armor, which let's be real, is low balling it, it's usually closer to around 40 at level 2, maybe 45 on some champs, you get 31% damage reduction. This means talon's all in is 462 damage. If you don't get poked level 1, he cannot kill you level 2.","replies":[{"poster":"Standgrounding","date":"2017-03-11T20:19:13.861+0000","up_votes":2,"down_votes":0,"body":"Count 2 Basic attacks or more in. And now you see.\n+80/AA withiut armor and masteries.\n\nSince he uses W for waveclearing you will get hit by one or two at level 1.","replies":[{"poster":"Sp33d Zer0","date":"2017-03-11T20:21:12.397+0000","up_votes":1,"down_votes":0,"body":"Except that I counted for his masteries in his approximate AD.","replies":[]}]},{"poster":"Not xPeke","date":"2017-03-11T20:52:58.482+0000","up_votes":1,"down_votes":0,"body":"do all the maths you want talon's burst at lvl 2 >>>>>>>>>>>>>>>>>>>>>>>> Ahris by a mile.\n\nPut a little trading in from either side in the beginning of the lane, and he can instakill you the second he hits 2 if he combos you right and AA's you once or twice.\n\nAnyway my main point was that he can do that without lethality items yet bought. So it's not lethality that made him deal that much damage.\nAlso like I said above.. it's still alot more damage that he can pull off at level 2, if he combos correctly, than the old LB could with QW. Which many deemed to be unhealthy back in the days before her rework.","replies":[]}]}]}]},{"poster":"Sexy Jack Rabbit","date":"2017-03-11T14:22:56.345+0000","up_votes":2,"down_votes":1,"body":"Talon really wasn't too strong before Lethality changes hit.\nHe was in a pretty okay spot balance-wise.\nOnce the lethality changes hit he was pushed into insane territories.","replies":[{"poster":"Not xPeke","date":"2017-03-11T15:25:13.568+0000","up_votes":2,"down_votes":1,"body":"Lethality sure did push him into insane territories, I agree.\n\nBut ever since the rework he has been really strong to be honest, even though he still isn't picked as much as other assassins.\nThat's why I don't link lethality to how strong he is, or anyway I don't pin-point his strength into the lethality.","replies":[]},{"poster":"General Esdeath ","date":"2017-03-12T04:47:23.963+0000","up_votes":1,"down_votes":0,"body":"Except Talon's rework came at the same time as lethality, he can level 2 cheese. Before lethality even becomes relevant.","replies":[]}]}]}]},{"poster":"Sad Tyrant","date":"2017-03-11T09:30:32.257+0000","up_votes":6,"down_votes":0,"body":"I think the last one is more of spin wheel, **THUNK** oh look its Irelia **THUNK** Nerf time   *tick tick tick tick tick tick tick tick tick tick tick tick tick tick tick * oh look her Base Damage","replies":[]}]}]}