{"poster":"Glîtchy","date":"2017-11-27T19:08:52.979+0000","title":"We need more AP + Armor items","subforum":"Gameplay","up_votes":20,"down_votes":9,"body":"{{item:3191}} {{item:3157}} are literally the ONLY ones we get, yet when you towards AD + MR items we&#039;ve got\r\n\r\n{{item:3155}} {{item:3156}} {{item:3139}} which are WAY better than the other 2, hell, armguard is basically just useless.\r\n\r\nSo I think we should get something like {{item:3170}} added into the rift instead of in the treeline/abyss\r\n\r\nI mean other wise we got things like \r\n\r\n{{champion:67}} with {{item:3139}} {{item:3156}} {{item:3147}} or {{item:3142}}  then other high damage items, seriously, where&#039;s the balance here? I mean it&#039;s bad enough that {{item:3026}} was made to be in favor of AD champs instead of being MR + Armor which made it good for all champs.","replies":[{"poster":"TwinkiePro","date":"2017-11-28T03:48:44.760+0000","up_votes":4,"down_votes":0,"body":"I remember building Deadmans as my last item as Xerath. It contributing nothing in terms of damage but the armor hp and MS were incredibly helpful. I would prefer it over any AR/AP item, but thats personal taste.","replies":[{"poster":"Glîtchy","date":"2017-11-28T04:56:24.211+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TwinkiePro,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=0005,timestamp=2017-11-28T03:48:44.760+0000)\n>\n> I remember building Deadmans as my last item as Xerath. It contributing nothing in terms of damage but the armor hp and MS were incredibly helpful. I would prefer it over any AR/AP item, but thats personal taste.\n\nmeh, it'd be better to have more defensive AP items, that DON'T only go AP + MR","replies":[{"poster":"TwinkiePro","date":"2017-11-28T07:13:50.597+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lyseth,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=00050000,timestamp=2017-11-28T04:56:24.211+0000)\n>\n> meh, it&#x27;d be better to have more defensive AP items, that DON&#x27;T only go AP + MR\n\nVery few items give triple stats combat stats. It would be a very expensive item were they to add one in.","replies":[{"poster":"Glîtchy","date":"2017-11-28T14:08:45.529+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TwinkiePro,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=000500000000,timestamp=2017-11-28T07:13:50.597+0000)\n>\n> Very few items give triple stats combat stats. It would be a very expensive item were they to add one in.\n\nNo no, I'm saying we need more AP + Armor not saying AP + Armor + MR, that's messed up","replies":[]}]}]}]},{"poster":"Shablagoo","date":"2017-11-28T07:16:24.674+0000","up_votes":1,"down_votes":1,"body":"Then build an actual armor item, like deadmans, honestly you are suppose to be squishy you can't be super tanky and deal burst dmg. Also if they add one more ad champs mid lane would completely be pushed out. You probably dont see it but every champ has a nice armor scaling which works with zhonya's, if they added more mages would easily be hitting tank armor numbers which isnt healthy.","replies":[{"poster":"SB Arneeman","date":"2017-11-28T12:59:11.714+0000","up_votes":3,"down_votes":0,"body":"Yeah, because assassins are totally not reaching tank numbers with {{item:3156}} {{item:3071}} {{item:3111}} {{item:3814}} \n\nNow you can even stack cleavers with Transcendence to get massive amounts of AD and HP.\n\nAlso, mages are pretty much forced to go {{item:3020}} since flat pen is extremely valuable and you need this to deal true damage(or close to) to squishies. Also, {{item:3191}} is way less cost efficient than {{item:3155}} .","replies":[{"poster":"Shablagoo","date":"2017-11-28T19:52:57.163+0000","up_votes":1,"down_votes":1,"body":"Ok lets look at mages hp then shall we? {{item:3027}} {{item:3151}} {{item:3116}}  thats 1100 health in total compared to the eon and bc build which is 650 bonus health, and a syndra with 61 armor plus the 45 she gets from zhonya's(not sure of the current armor scaling)  106  and then talon with 32 mr plus the 80 from mr 112. That is 6 more mr then the mage build with extra hp which  helps just as much. No assassin stacks cleavers it isnt good if they do and succeed they will be doing no dmg not even close to that of a mage. You can goes liandries and void you dont have to go pen boots ppl just, considering that void removes 40% of a targets mr that plus liandries is enough with no squishies building any mr( hense the squishy aspect of them). No assassin is reaching tank numbers with those four items just to get over 112 mr which they need to build these items because of the lack of mr scaling, is no were near tank numbers. Add another ap + armor item with lets say 45 armor, thats 150 armor for a mage, at lvl 10 plus the scaling. With the health and armor that big mages would be at tank levels. And with a 112 assassin vs a mage with void staff, they lose 44 of their mr if we add pen boots and liandries, 15+18 = 33 along with 44 from the void staff thats 112 -77 = 35. So a mage with this build {{item:3151}}{{item:3020}} {{item:3116}}  {{item:3135}} {{item:3027}}  Gets to negate 77 of a 112( the tank number that the assassin is reaching) along with having 1100 health and that is just at five items.\n\n\nAlso lets not forget that trancedence also gives ap, I went on the practice tool to see how it could help mages, i built {{item:3110}} I got 40 extra ap with 196 armor with this build {{item:3089}} {{item:3165}} {{item:3020}} {{item:3135}} {{item:3157}}","replies":[{"poster":"SB Arneeman","date":"2017-11-29T09:42:08.414+0000","up_votes":2,"down_votes":0,"body":"You are forgetting that assassins have access to way more pen items than mages. The hp build is trash on nearly all mages due to the lack of cdr, and Rylais is a trash tier item. Rod of ages also have a quite bad build path and you need 10 minutes to get full stats, which is bad in this short game meta. Additionally, assassins have Sudden impact to get lethality and ridiculous extra damage from Duskblade and Electrocute. The armor build is trash since it gives no extra hp and a last whisper will remove a lot of the bonus armor.\n\nEven though assassins are burst focused, they still have heavy hitting autos for dps unlike most mages - meaning that if you both fail to burst the opponent, the assassin will win as long as he's in range.","replies":[{"poster":"Shablagoo","date":"2017-11-29T22:28:08.160+0000","up_votes":1,"down_votes":1,"body":"So? The reason they have more armor pen items is because there is more armor naturally then mr, when you look at the magic pen build for mages they can literally reach true dmg on ppl with no mr. That never happens with assassins because ppl will always buy armor items, because they must build some armor to stop adc's or ad assassins or ad jg's. Their is more armor in the game then mr naturally so more pen items. \n\nHonestly thats a subjective view tbh, but lets look rylais is a bad item thats true, it should be buffed in some area. Rod isnt bad it is core on alot of mages because it provides hp which is literally the best defensive stat in the game.{{item:3152}} {{item:3030}}  Almost forgot about these should i switch the rylais for that too. That also sounds balanced to me, you have to give up some power in order to survive seems reasonable balance wise. Are you trying to compare ad assassin builds to mage builds? You understand that assassins need to be stronger early game right? They are early game champions  because they fall off completely late game.  Yes sudden impact is for assassins, ASSASSINS in general, fizz can use it, elise, diana, kata, akali all ap so that isnt even a point because they all use it too, they also dont build the items ad assassins build and preform well so what is the point you are trying to make, they get more magic pen too?\n\nOk and once you get a void staff you can chunk through tanks and burst down squishies too, man it is like itemization in the proper sense actually helps champions in a way? Just because you get armor doesnt mean you are invincible that is the way the game is.\n\nYes he will win if he is in range, which makes it your job to kit after he gets in range, dont use cc before he uses his mobility and punish him after he does. You have to understand mages and adc's are countered by assassins, meaning you should lose unless you play right early game. If you use you zhonya's before zed ults you lose, if you miss your cc before zed uses his ult you will lose. It is the basics of the game you have to figure out how to outplay the game will not give you more options because you can't figure out what other ppl have.","replies":[{"poster":"SB Arneeman","date":"2017-11-30T11:21:07.211+0000","up_votes":1,"down_votes":1,"body":"Yeah there are some health items to choose from. However the overall mage items leaves very few viable item builds. If you are AP and want armor, while the zhonias passive won't help you, there are no good options. {{item:3191}} does not give enough stats by itself to make much of an impact, and {{item:3047}} massively decreases your damage since you lose 18 flat pen. The problem with going health items is that you lose out on pen and cdr which is necessary on all mages. {{item:3151}} is good, but the other items are situational. Not to mention there is a rune to reduce magic damage in the sorcery tree, but nothing against physical damage.","replies":[{"poster":"Shablagoo","date":"2017-12-01T00:19:01.695+0000","up_votes":1,"down_votes":0,"body":"Well then make the choice, either more hp or more ap, I dont see mages suffering in anyway from this. Lux, morg, xerath, and malz dont seem to be suffering. Zhonias is the only option yet still no mage ever builds tabi's regardless because its pretty obvious thats all they need. Considering that a mastery literally gives you a free 10% cdr I dont see anything wrong with giving up some cdr for extra hp for survival, along with Ultimate hat which decreases your ult cd by 15% regardless cdr doesnt seem to be a problem for mages. \n\nAgain you seem to not see that armor has a 3+ scaling on everything a little more for some ppl. Consider that their is natural more armor for people then mr I dont see this being an issue. Also their are two trees in the resolve tree I think which increase armor by 5, yet no mage ever thinks about taking it. Because they refuse to give some dmg up for survival.","replies":[{"poster":"SB Arneeman","date":"2017-12-01T15:05:06.398+0000","up_votes":1,"down_votes":0,"body":"Lux, Morg, Xerath and Malz don't suffer because they are out of enemy range/have the enemies locked down and then they don't need much defenses. It doesn't make sense to mention cdr runes, you could get cdr from the old system in addition to more armor.\n\nThe Resolve runes are simply not viable as a secondary tree. 5 armor is extremely cost ineffective compared to the other options, and there is no other decent rune there. They all scale with tankyness so you get very little value out of it.\n\nIt's not that mages have no defensive options. However, the AD counterparts are generally stronger, **especially** {{item:3191}} {{item:3157}}  vs {{item:3155}} {{item:3156}} . Additionally AD has {{item:3139}} and {{item:3091}} . Mages also no longer have access to {{item:3026}} . It is time for AP to get another defensive item, in addition to fixing the rest of the itemization so you are not forced to go all pen items on every single ap champ to deal good damage, while nearly all mages go Morello.","replies":[{"poster":"Shablagoo","date":"2017-12-01T15:53:11.793+0000","up_votes":1,"down_votes":0,"body":"You also just stated another advantage mages get which is range, the fact that mages can harass assassins in lane with such range really means assassins need more defensive items then normal. Considering when they harass the get minion aggro along with skill shots every now and then I dont se how it isnt unfair for them to have good defensive options. Compared to these mages who take literally no dmg from minions unless they completely all in, the only dmg is coming from poke and all ins. Also again nothing is stopping you from giving up some dmg for survival, nothing you seem to breeze over this point but it is important.  Buying {{item:3047}}  does not considerably lower you dmg when you can go both {{item:3151}} and {{item:3135}} and still do a decent amount of dmg to champions and burst them too. 40% of a targets mr is gone still along with -15 still, thats alot. Say someone have {{item:3156}} and {{item:3111}}   plus the 37 that they already have, leaves them at 50 mr left without sorc boots.  Mages should start building armor if it is a problem for them yet they dont.\n\nAgain which is because of the way the current system is. Mage, again Ill point this out cuz you dont seem to get it, have a natural armor scaling which is twice that of mr, by level  a certain level it is easy to achieve 100 armor with just one mr item. Yet ad needs Maw to survive because of the lower amounts of mr and the amount of burst and inherent ease of mpen by the current pen options. Also dont even put {{item:3091}} no ad champion builds that as a consent. It takes to long to stack and only attack speed users benefit which no adc other then Kog maybe uses it.  \n\nAlso again if you want to survive then you have to sacrifice game nullifying orb is something that lowers the potential dmg of assassins too when they take it, the miss out on the precision mastery too if they must. Same with every ad who has to take it. Why should mages not have to sacrifice too if they want to survive more. And I am taking about cdr in runes as you still benefit from them regardless, assassins benefited from more lethality too so what is your point everyone lost stuff they also benefited from 12 mr  too which they lost. Does not make the cdr any more beneficial from the tree.","replies":[]}]}]}]}]}]}]}]},{"poster":"Glîtchy","date":"2017-11-28T14:10:34.869+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shablagoo,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=0006,timestamp=2017-11-28T07:16:24.674+0000)\n>\n> Then build an actual armor item, like deadmans, honestly you are suppose to be squishy you can&#x27;t be super tanky and deal burst dmg. Also if they add one more ad champs mid lane would completely be pushed out. You probably dont see it but every champ has a nice armor scaling which works with zhonya&#x27;s, if they added more mages would easily be hitting tank armor numbers which isnt healthy.\n\nMages aren't supposed to be tanky, sure.\n\nSo why the fuck is it okay for marksmen to be tanky","replies":[{"poster":"Shablagoo","date":"2017-11-28T19:56:09.101+0000","up_votes":1,"down_votes":0,"body":"Well tbh im with on that marksmen get tanky mainly cuz supports give them way to many shields I would love for their sustain to get turned down a  notch, but in terms of getting tanky in mr scalings I dont see it. Against mages you need both mr and health for it to really be affective and marskmen are not building both. Only mr items adc's build are {{item:3139}} with a wooping 35 mr with just liandries and sorc boots you get through 33 of it so they only benefit from 2 extra mr. So tanky right? It is supports not the builds themselves.","replies":[{"poster":"Glîtchy","date":"2017-11-29T00:11:45.130+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shablagoo,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=000600010000,timestamp=2017-11-28T19:56:09.101+0000)\n>\n> Well tbh im with on that marksmen get tanky mainly cuz supports give them way to many shields I would love for their sustain to get turned down a  notch, but in terms of getting tanky in mr scalings I dont see it. Against mages you need both mr and health for it to really be affective and marskmen are not building both. Only mr items adc&#x27;s build are {{item:3139}} with a wooping 35 mr with just liandries and sorc boots you get through 33 of it so they only benefit from 2 extra mr. So tanky right? It is supports not the builds themselves.\n\nMaw and Hex are basically just giant middle fingers, negates heavy AP damage COMPLETELY then applies a spell shield, pure bullshit, Mercurial's just there so you can pull a double flip-off","replies":[{"poster":"Shablagoo","date":"2017-11-29T02:20:48.461+0000","up_votes":1,"down_votes":1,"body":"My man you are jumping all over the place. Are you taking about adc or maw. In any case It has doesnt completely negate burst it blocks 300 dmg at most from a mage combo considering how much dmg an average mage combo does it doesnt seem unreasonable.","replies":[{"poster":"Glîtchy","date":"2017-11-29T08:36:02.907+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shablagoo,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=00060001000000000000,timestamp=2017-11-29T02:20:48.461+0000)\n>\n> My man you are jumping all over the place. Are you taking about adc or maw. In any case It has doesnt completely negate burst it blocks 300 dmg at most from a mage combo considering how much dmg an average mage combo does it doesnt seem unreasonable.\n\nI tried using Veigar ult on a Vayne at 40% and when it hit, no damage occurred and the spell shield popped up, and no Morgana was not in the match.","replies":[{"poster":"Shablagoo","date":"2017-11-29T22:36:51.543+0000","up_votes":1,"down_votes":0,"body":"So she had itemization right, she had maw, which is good cuz most adc's dont build it. Also how do you expect to counter veigar too, his ult does so much dmg for being point click you need a way to counter act it. If maw didnt exist in the game Veigar would be even more nonsense then he is. an instant execute from getting poked down is no fun.","replies":[{"poster":"Glîtchy","date":"2017-11-29T23:50:42.172+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shablagoo,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=0006000100000000000000000000,timestamp=2017-11-29T22:36:51.543+0000)\n>\n> So she had itemization right, she had maw, which is good cuz most adc&#x27;s dont build it. Also how do you expect to counter veigar too, his ult does so much dmg for being point click you need a way to counter act it. If maw didnt exist in the game Veigar would be even more nonsense then he is. an instant execute from getting poked down is no fun.\n\nthe point being, it's too strong if it can negate ANYTHING ap based completely then add a spell shield, it'd be one thing to stop it and that's that, but a spell shield in addition is too much.","replies":[{"poster":"Shablagoo","date":"2017-11-30T01:28:45.558+0000","up_votes":1,"down_votes":1,"body":"So the only magic shield to reduce dmg should be morg? I dont see your point they only get the spell shield if morg is in the game. If she isnt they need something to reduce the burst, a veigars full combo isnt going to be completely negated from a 300 dmg shield thats just 300 dmg off the their burst. Which is needed to even survive. Considering the ultimate hat that ever mage has their combo will be up before the spellshield is back on{{item:3156}} . Maw has a 90 second cd, while ultimate hat reduces the cd on mages ults by 15% plus 40% which is easy to achieve. Ok even before the ultimate hat cd reduction, veigars ult cd at max lvl is 80 seconds. 80 seconds!! without cd reduction. Honestly stop complaining a shield every 90 seconds that can't even be reduced should not be a problem.","replies":[{"poster":"Glîtchy","date":"2017-11-30T02:21:06.407+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shablagoo,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=000600010000000000000000000000000000,timestamp=2017-11-30T01:28:45.558+0000)\n>\n> So the only magic shield to reduce dmg should be morg? I dont see your point they only get the spell shield if morg is in the game. If she isnt they need something to reduce the burst, a veigars full combo isnt going to be completely negated from a 300 dmg shield thats just 300 dmg off the their burst. Which is needed to even survive. Considering the ultimate hat that ever mage has their combo will be up before the spellshield is back on{{item:3156}} . Maw has a 90 second cd, while ultimate hat reduces the cd on mages ults by 15% plus 40% which is easy to achieve. Ok even before the ultimate hat cd reduction, veigars ult cd at max lvl is 80 seconds. 80 seconds!! without cd reduction. Honestly stop complaining a shield every 90 seconds that can&#x27;t even be reduced should not be a problem.\n\nAS I said, smart guy, the 100% negation is fine, but the addition of the spell shield on maw is too much, 1 is complete negation (the first effect) then the spell shield pops up afterwards","replies":[{"poster":"Shablagoo","date":"2017-11-30T04:34:31.423+0000","up_votes":1,"down_votes":1,"body":"And you ignore everything else too haha, once again ultimate hat, the cd on your spells and ult are now lower then that of the spell shield for maw. Meaning they need more shields to negate the dmg becuase we all know mr isnt enough to block mage dmg.  Can you tell me how low the cd on veigars ult gets with full cd and ultimate hat or are you gonna continue to pretend like i didnt say anything about it? Also what do you mean complete negation and then spell shield? The spell shield is the negation? Are you talking about morgs spell shield because thne just ban morg. I am not going to feel sympathy for your case considering malz can get his cd to 37 seconds. Yet mages pretend that maw is op.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Zyrannosaurus","date":"2017-11-27T19:29:19.309+0000","up_votes":3,"down_votes":0,"body":"Agreed 100%","replies":[]},{"poster":"Ariel the Cruel","date":"2017-11-28T01:14:03.876+0000","up_votes":4,"down_votes":1,"body":"AD's defensive stat is supposed to be resists.\nAP's defensive stat is supposed to be health.\n\nAt least, that used to be Riot's philosophy. Not sure if it survived the juggernaut and ADC updates. . .","replies":[{"poster":"NotAPurpleFrog","date":"2018-08-19T23:53:44.669+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ariel the Cruel,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=0003,timestamp=2017-11-28T01:14:03.876+0000)\n>\n> AD&#x27;s defensive stat is supposed to be resists.\n> AP&#x27;s defensive stat is supposed to be health.\n> \n> At least, that used to be Riot&#x27;s philosophy. Not sure if it survived the juggernaut and ADC updates. . .\n\nI know this is a 9 month old post but, MR items normally have AD or Health built into it, so they're Resisting Damage AND having more health, while Assassins (Some) Have Max health damage and a shit load of burst.","replies":[]},{"poster":"AR URF","date":"2017-11-29T08:50:37.566+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ariel the Cruel,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=0003,timestamp=2017-11-28T01:14:03.876+0000)\n>\n> AD&#x27;s defensive stat is supposed to be resists.\n> AP&#x27;s defensive stat is supposed to be health.\n> \n> At least, that used to be Riot&#x27;s philosophy. Not sure if it survived the juggernaut and ADC updates. . .\n\nThe problem now though is all the health AD items. {{item:3071}} {{item:3748}} {{item:3053}} {{item:3022}} {{item:3078}} {{item:3044}} {{item:3052}}. I mean there's no problem with having AD health items. It just seems like that philosophy must be old or out of touch.","replies":[{"poster":"Ariel the Cruel","date":"2017-11-29T09:08:24.617+0000","up_votes":1,"down_votes":0,"body":"It's old. But in the absence of a new one, it's all we've got. \n\nThe philosophy was basically this:\nAD offense scales multiplicity with multiple stats, defensively with resists.\nAP offense scales by achieving massive values (400+), defensively with health.\nTank offense pseudo-scales with supplementary effects (ex.: sun-fire), defense with health *and* resists.\nSupport scaled with wards. (Yes, it i that old.)","replies":[]}]}]},{"poster":"Ahris","date":"2017-11-27T19:11:54.229+0000","up_votes":4,"down_votes":1,"body":"Agreed. I dont build zhonyas usually because it provides not useful stats. \n\nApc needs more itemization options.","replies":[]},{"poster":"Snowplosion","date":"2017-11-28T02:16:55.566+0000","up_votes":2,"down_votes":3,"body":"Hexdrinker builds into Maw; don't know why you listed both. Also that Vayne build is probably the single most retarded thing I have seen maybe ever.","replies":[{"poster":"Glîtchy","date":"2017-11-28T03:35:40.514+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Snowplosion,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=0004,timestamp=2017-11-28T02:16:55.566+0000)\n>\n> Hexdrinker builds into Maw; don&#x27;t know why you listed both. Also that Vayne build is probably the single most retarded thing I have seen maybe ever.\n\nThe point being Hexdrinker is basically just maw with lower MR and AD","replies":[{"poster":"Snowplosion","date":"2017-11-28T05:51:17.767+0000","up_votes":1,"down_votes":0,"body":"That explains why you put Zhonya's in there as well...","replies":[]}]},{"poster":"LunarEdge7","date":"2017-11-28T07:05:57.874+0000","up_votes":0,"down_votes":1,"body":"> [{quoted}](name=Snowplosion,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=0004,timestamp=2017-11-28T02:16:55.566+0000)\n>\n> That Vayne build is probably the single most retarded thing I have seen maybe ever.\n\nHey, if it was enemy AP comp and the lethality gets the job done.. lol","replies":[{"poster":"Snowplosion","date":"2017-11-28T23:36:17.989+0000","up_votes":1,"down_votes":0,"body":"Zero AA Speed or Crit = Zero Damage Vayne.","replies":[{"poster":"LunarEdge7","date":"2017-11-29T03:07:59.175+0000","up_votes":1,"down_votes":0,"body":"Ya' think Greaves with Alacrity would be enough? Or is Botrk also needed somewhere in there","replies":[{"poster":"Snowplosion","date":"2017-11-29T03:49:56.433+0000","up_votes":1,"down_votes":0,"body":"You probably need a zeal item.","replies":[]}]}]}]}]},{"poster":"Incarceration","date":"2018-08-20T00:03:11.943+0000","up_votes":1,"down_votes":0,"body":"Mages have the ability to stack hp + Zhonyas being a broken active. \n\nIn addition, mages naturally have range advantage over AD champions and naturally groups with their team to try and siege and contribute to fights while being in the backline so they're going to have more safety in comparison to AD champions. Thus, they don't have as much of a need for defensive items in general.","replies":[]},{"poster":"Illâoi Evê Siôn","date":"2017-11-30T02:23:06.130+0000","up_votes":1,"down_votes":0,"body":"I would rather the AD + MR items were nerfed than have Mages become just as obnoxious ... but I would also welcome Moonflair Spellblade on the Rift.","replies":[]},{"poster":"Selegun","date":"2017-11-28T13:41:37.194+0000","up_votes":2,"down_votes":2,"body":"With the new runes you can get up to 40 AP for building Frozen Heart.  As long as your willing to consider all of your options then runes give you surprising flexability.","replies":[{"poster":"TwinkiePro","date":"2017-11-29T05:08:01.885+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Selegun,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=0007,timestamp=2017-11-28T13:41:37.194+0000)\n>\n> With the new runes you can get up to 40 AP for building Frozen Heart.  As long as your willing to consider all of your options then runes give you surprising flexability.\n\nI was about to call this stupid, but this sounds really solid granted you get the CDR...","replies":[{"poster":"Selegun","date":"2017-11-29T17:41:09.007+0000","up_votes":1,"down_votes":0,"body":"I know right?  I've spent more time theory crafting the runes than playing the game these last few weeks lol\n\nHourglass into frozen heart for car cap then whatever the core for your character might be.  Most likely Morello and perhaps Abyssal mask?  Even Zeke's looks tempting at this point.","replies":[]}]}]},{"poster":"AR URF","date":"2017-11-29T08:46:14.624+0000","up_votes":1,"down_votes":0,"body":"{{champion:78}} I'm with you 100%. That's everything right?","replies":[]},{"poster":"DragonShea","date":"2017-11-28T18:01:35.343+0000","up_votes":1,"down_votes":0,"body":"The way i see it, that Riot don't want tanks to abuse X AP + Armor item. if they are gonna go up against a full AD comp as ADC have low MR gains and that will fuck them up. I am not saying that Mage's shouldn't have more Armor + AP items, which they most certainly need. But that some tanks which AP scaling can become OP damage bruisers that can ruin ADC to the point it breaks the game. (another thing I would love to see for just one patch tho)","replies":[]},{"poster":"Sycoblast69","date":"2017-11-27T19:32:12.735+0000","up_votes":1,"down_votes":0,"body":"I'd settle for {{item:3191}} having more than 1 build option.","replies":[{"poster":"Glîtchy","date":"2017-11-27T20:51:48.304+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sycoblast69,realm=NA,application-id=3ErqAdtq,discussion-id=tLubhbyN,comment-id=0002,timestamp=2017-11-27T19:32:12.735+0000)\n>\n> I&#x27;d settle for {{item:3191}} having more than 1 build option.\n\nat least let it build into like another AP + Armor item, hell even Magic pen. + armor would be fine","replies":[]}]}]}