{"poster":"Glîtchy","date":"2017-11-23T22:07:04.308+0000","title":"Anyone else find overcharge as a let down?","subforum":"Gameplay","up_votes":45,"down_votes":10,"body":"Very limiting with what marksman champs we can play and even then some of the options suck like hell, of course with vayne being bullcrap as ever by being one of THE BEST picks.","replies":[{"poster":"Fedoran","date":"2017-11-23T22:18:48.368+0000","up_votes":18,"down_votes":2,"body":"Its like bloodmoon with right clicking only. kiting is nonexistent because everyone is ranged so its just stat-sticking","replies":[{"poster":"Thefrostyviking","date":"2017-11-24T13:05:03.027+0000","up_votes":3,"down_votes":0,"body":"To be fair, you rarely ever kite in bloodmoon because usually if a fight starts someone dies in 0,5 seconds. \n\nBut yah, this mode is also largely about who oneshots the other faster.","replies":[]}]},{"poster":"Tenth Leper","date":"2017-11-23T22:24:22.397+0000","up_votes":10,"down_votes":0,"body":"I did not have much fun playing it, but that is probably due to the champion and summoner restrictions and lack of runes.\n\nThe music, the map, the vision zones, even somewhat the jump zones, I thought there well done and interesting.\n\nBasically I dislike it for the exact same reason I dislike blood moon. You are forced to play it a certain way, even if it might be fun to play it differently.","replies":[{"poster":"Glîtchy","date":"2017-11-23T22:48:43.451+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Tenth Leper,realm=NA,application-id=3ErqAdtq,discussion-id=dlN8I69E,comment-id=0001,timestamp=2017-11-23T22:24:22.397+0000)\n>\n> I did not have much fun playing it, but that is probably due to the champion and summoner restrictions and lack of runes.\n> \n> The music, the map, the vision zones, even somewhat the jump zones, I thought there well done and interesting.\n> \n> Basically I dislike it for the exact same reason I dislike blood moon. You are forced to play it a certain way, even if it might be fun to play it differently.\n\nIf I could, I would play Twitch, he's the only marksman I find fun, I like Jinx too but she's trash in this mode.","replies":[{"poster":"Steelflame","date":"2017-11-24T01:16:34.257+0000","up_votes":6,"down_votes":0,"body":"Twitch would be too good in that mode by far.  He already thrives on low vision enviroments and attempting to 1v1 enemy ADCs at 1.5 items or so, don't give him his dream scenario where he'd be more busted than an Ezreal is now.","replies":[{"poster":"Glîtchy","date":"2017-11-24T04:38:26.058+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Steelflame,realm=NA,application-id=3ErqAdtq,discussion-id=dlN8I69E,comment-id=000100000000,timestamp=2017-11-24T01:16:34.257+0000)\n>\n> Twitch would be too good in that mode by far.  He already thrives on low vision enviroments and attempting to 1v1 enemy ADCs at 1.5 items or so, don&#x27;t give him his dream scenario where he&#x27;d be more busted than an Ezreal is now.\n\nEz jg should never have been a thing Twitch was originally for jg on release.","replies":[{"poster":"Z3Sleeper","date":"2017-11-24T07:57:41.426+0000","up_votes":1,"down_votes":0,"body":"Yeah, back when his W instantly slowed all enemies in a mile radius regardless of whether they had stacks or not.","replies":[]}]}]},{"poster":"Thefrostyviking","date":"2017-11-24T13:02:42.437+0000","up_votes":1,"down_votes":0,"body":"Twitch is broken beyond belief when the enemy team lacks the CC and vision to instantly shut him down when he goes around.\n\nAnd he can kill the average marksman in 3 hits with 3 items too.....from twice their range. ","replies":[]}]}]},{"poster":"Ralanr","date":"2017-11-23T22:32:58.679+0000","up_votes":9,"down_votes":0,"body":"Ezreal ruins it for me honestly. He’s so much more mobile compared to everyone else it feels like and he’s practically in every game.","replies":[{"poster":"AwesomeGuyDj","date":"2017-11-24T02:07:13.268+0000","up_votes":6,"down_votes":1,"body":"lucian is pretty fucking annoying too.","replies":[]},{"poster":"An Draoi","date":"2017-11-23T23:09:15.900+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=3ErqAdtq,discussion-id=dlN8I69E,comment-id=0002,timestamp=2017-11-23T22:32:58.679+0000)\n>\n> Ezreal ruins it for me honestly. He’s so much more mobile compared to everyone else it feels like and he’s practically in every game.\n\nnot to mention Riot included AP items in an ADC gamemode","replies":[{"poster":"RottedApples","date":"2017-11-25T04:22:28.880+0000","up_votes":1,"down_votes":0,"body":"as soon as i saw this i found my one true pick for this game mode.\n\nap sivir.\n\nGotta use that Q ratio man, and get a ludens proc on it.","replies":[{"poster":"Spoofghoul","date":"2017-11-25T11:22:26.447+0000","up_votes":1,"down_votes":0,"body":"{{champion:15}} {{item:3146}} {{item:3146}} {{item:3146}} {{item:3146}} {{item:3146}} {{item:3146}} \n\nok","replies":[]}]}]},{"poster":"Succubús GF","date":"2017-11-24T13:04:14.098+0000","up_votes":2,"down_votes":0,"body":"For me its vayne, being auto condemned sucks","replies":[]},{"poster":"Dragonmage1129","date":"2017-11-24T04:55:46.469+0000","up_votes":2,"down_votes":0,"body":"At the very right of the map (not in past the base) there's a platform with a blast cone where only ez can get to without using flash.","replies":[{"poster":"Steelflame","date":"2017-11-24T07:35:36.557+0000","up_votes":2,"down_votes":0,"body":"Wrong.  Trist, Lucian, Graves, and a few others can hop that wall without flash, and a part of the point of that one is it is a juke spot where you can blow a flash CD to potentially misdirect the enemy as to where you will go, or even more hilariously, wait out an overcharge if they don't have flash up and are not one of the champs who can easily hit you over that wall, such as Ashe or Sivir.","replies":[]}]}]},{"poster":"AL000","date":"2017-11-24T05:07:57.992+0000","up_votes":2,"down_votes":0,"body":"yes but I found MF, vayne and lucian most powerful ADC ever.","replies":[{"poster":"Glîtchy","date":"2017-11-24T05:39:23.997+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=AL000,realm=NA,application-id=3ErqAdtq,discussion-id=dlN8I69E,comment-id=0003,timestamp=2017-11-24T05:07:57.992+0000)\n>\n> yes but I found MF, vayne and lucian most powerful ADC ever.\n\nvayne is just way too strong to be fair MF is difficult to defend against and Lucian is just.....URF dashing","replies":[{"poster":"AL000","date":"2017-11-24T06:11:23.437+0000","up_votes":1,"down_votes":0,"body":"Yes, Just position after Luican dash... or bait him... or drive yourself to the safe/corner position...\n\nIt always works. ;]","replies":[]}]}]},{"poster":"Arakadia","date":"2017-11-24T09:28:31.993+0000","up_votes":3,"down_votes":0,"body":"Utility isn't very strong in the mode and dueling feels exceptionally important which causes the champion pool to be limited.","replies":[]},{"poster":"Troll for Trump","date":"2017-11-24T07:57:38.129+0000","up_votes":2,"down_votes":0,"body":"Try AP Ez, Corki, and lethality graves","replies":[]},{"poster":"Yordle Xayah","date":"2017-11-24T17:25:02.710+0000","up_votes":2,"down_votes":1,"body":"It feels **REALLY** weird... but lets me stack up Tristana games really fast for my profile c:\n\nIt's better than URF, I'll tell you that much.\n\n... Yeah, the more URF I play, the more I dislike it. Makes you appreciate how balanced the real game actually is.","replies":[{"poster":"nGio","date":"2017-11-25T02:51:18.154+0000","up_votes":1,"down_votes":3,"body":"That's because you're brainwashed into thinking balance = most fun. I like URF and One For All BECAUSE there is no balance based around it. It's a nice break from the stressful rage fest of 5's ranked, where meta picks and tilted allies suck the fun out of it. \n\nIt's actually nice to have some 'fuck around' fun without having to dial up a different game when ranked has me bored or emotionally drained to the point that my body is tired. Riot wants you to think that LC$ Simulator is the ultimate 'fun' experience, but I'm happier than shit when URF rolls around, and I can say \"fuck the balance\" to roll my face through some crazy games with rl friends and nothing on the line. \n\nBecause Riot has everyone believing that ranked SR balance is the ultimate fun, TT will finally breathe it's last breath soon and One For All will probably go another year with shit excuses about the new client.","replies":[{"poster":"Yordle Xayah","date":"2017-11-25T03:35:30.442+0000","up_votes":2,"down_votes":2,"body":"Brainwashed? No... URF is a mode where 20 champs are good and whoever gets the most of that pool wins.\n\nYou can't _\"Fuck Around\"_... try playing something fun like AD Syndra, and you'll be playing at a disadvantage. Next time you're at an URF game and your team's losing 2 - 18, remember how _\"fun\"_ you claim the mode to be.\n\nOne For all, that's fine.","replies":[{"poster":"nGio","date":"2017-11-25T03:52:07.895+0000","up_votes":1,"down_votes":2,"body":"Okay, so \"only 20 good champs\" and \"when you're losing 2-18\"? That sounds like ranked SR right now, which you praised for it's amazing balance. Yes, some champions are better than others in every game mode, so what's your point again? I've won games of URF with inferior champions. A team full of Poppy/Skarner/Voli/etc aren't winning shit in ranked, but they can win an URF game. You're a ranked meta slave, so if you don't see a traditional ADC/support bot, you deem it unbalanced and unfun.\n\nThere are more than 20 good champs in URF, and getting stomped in a custom game carries no stress. My idea of fun isn't playing AD Syndra in any mode, so I don't even know where you're trying lure me with this one.\n\nFast paced 5v5 game modes that don't make sense are a breath of fresh air when you've been smashing SR for 8 years. If you don't like them, then no one is stopping you from playing ranked SR.","replies":[{"poster":"Yordle Xayah","date":"2017-11-25T03:59:09.499+0000","up_votes":2,"down_votes":1,"body":"Why are you still here???\n\nhttps://roodepoortrecord.co.za/wp-content/uploads/sites/20/2015/02/tumblr_m5ufc4GwJ61qdhsxp.0-Medium.jpg\n\nYou're not gonna convince me, I don't agree with you and I frankly don't care enough to continue.\nWhat do you want??","replies":[{"poster":"nGio","date":"2017-11-25T04:03:07.536+0000","up_votes":2,"down_votes":2,"body":"You obviously care. You care enough to send me pictures, argue about balance, give up the argument, then ask rhetorical questions. Since you asked, I'm just here so you don't get let off the hook for stupid statements.","replies":[{"poster":"Yordle Xayah","date":"2017-11-25T06:04:09.740+0000","up_votes":2,"down_votes":1,"body":"{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]}]}]}]}]},{"poster":"nGio","date":"2017-11-25T02:40:13.379+0000","up_votes":2,"down_votes":1,"body":"It's another 'one and done' game mode, like the Thresh game, Nexus Siege, and all of the pve stuff. We see a saturation of the one and dones because it gets us back to playing LC$ Simulator(5v5 SR). \n\nWhen URF, One For All, or Hexakill come around, I see friends that I haven't seen since last time they were up, rl friends send texts letting me know it's coming, and my friends list is active as fuck. Defend the shitter modes as much as you'd like, but no one is sending texts for Poros, Blood Moon, or pve side projects. I'd like to see some SC2 style Arcade Mode, where everything is always available and the customers get to choose what and when they play, instead of being forced into RGMs like monkeys.","replies":[{"poster":"Glîtchy","date":"2017-11-25T05:44:10.832+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=nGio,realm=NA,application-id=3ErqAdtq,discussion-id=dlN8I69E,comment-id=0015,timestamp=2017-11-25T02:40:13.379+0000)\n>\n> It&#x27;s another &#x27;one and done&#x27; game mode, like the Thresh game, Nexus Siege, and all of the pve stuff. We see a saturation of the one and dones because it gets us back to playing LC$ Simulator(5v5 SR). \n> \n> When URF, One For All, or Hexakill come around, I see friends that I haven&#x27;t seen since last time they were up, rl friends send texts letting me know it&#x27;s coming, and my friends list is active as fuck. Defend the shitter modes as much as you&#x27;d like, but no one is sending texts for Poros, Blood Moon, or pve side projects. I&#x27;d like to see some SC2 style Arcade Mode, where everything is always available and the customers get to choose what and when they play, instead of being forced into RGMs like monkeys.\n\nthe difference being between this and siege vs. the thresh one is that the thresh one was ACTUALLY fun, and didn't result in you getting pinned to walls by vayne every 5 seconds at any angle she appears from.","replies":[]}]},{"poster":"Athenes Lulu","date":"2017-11-24T11:42:24.130+0000","up_votes":2,"down_votes":1,"body":"It feels like you actually have to be mechanical gods *just* to play the game mode, at least in Blood Moon you don't right click as much and picking up isn't that hard even if you're almost anti-damage throughout most of League.\n\nI know, I'm just a fucking garbage support main and that I just need to \"git gud\", but it's kinda painful trying to learn and get a good grasp of that mode.","replies":[]},{"poster":"Waljkyria","date":"2017-11-24T08:08:42.873+0000","up_votes":2,"down_votes":1,"body":"It's pure shit. Just a way to promote shitty skins forgotten by most of people.\nAlso a way to create a diversion for real problems: blue essences suck shit.","replies":[]},{"poster":"hhaavviikk","date":"2017-11-24T19:23:08.351+0000","up_votes":1,"down_votes":0,"body":"yeah it's boring, it's just aa stat-check fight like somebody else said, got more stats? gratz you win as there's no outplaying right clicks","replies":[]},{"poster":"Its All Skillzz","date":"2017-11-24T18:03:03.493+0000","up_votes":1,"down_votes":0,"body":"if ap items are in the game mode, just rush gunblade on ap ez and 1 shot everyone since they are all squishy adcs lol.","replies":[]},{"poster":"Kloqdq","date":"2017-11-24T15:39:18.282+0000","up_votes":1,"down_votes":0,"body":"When I saw it, I kind of figured it would be lackluster overall. Just kind of sucks how limiting the mode is overall.","replies":[]},{"poster":"Mhihnj","date":"2017-11-24T12:52:27.927+0000","up_votes":1,"down_votes":0,"body":"I play AP trist in  the game mode cause everything else feels the same.","replies":[]},{"poster":"Teriyaki Bukkake","date":"2017-11-24T12:06:04.003+0000","up_votes":1,"down_votes":0,"body":"It's a poorly made replica of blood moon, which is somehow LESS fun, requires less of the player, has no unique elements to it, and pretty much is just there to promote the skins","replies":[]},{"poster":"Alimentateur","date":"2017-11-24T11:58:37.553+0000","up_votes":1,"down_votes":0,"body":"Once Overcharged there is no place to hide anyway.\nChunks my FPS going from 187 to 18","replies":[]},{"poster":"ImTheSideKick","date":"2017-11-24T10:56:11.924+0000","up_votes":1,"down_votes":0,"body":"vayne? ha, graves be 1 shooting EVERY ONE","replies":[]},{"poster":"Jerry SeinfeId","date":"2017-11-24T10:51:55.512+0000","up_votes":1,"down_votes":0,"body":"I just think it's BS that twitch and kindred aren't in it","replies":[]},{"poster":"Cosnirak","date":"2017-11-24T10:07:34.929+0000","up_votes":1,"down_votes":0,"body":"I dislike a lot about the mode but I think the worst part is navigating the map. I constantly feel lost and have no idea how to get places fast enough. I think if I played it a bunch and got used to it that would help a lot, but then the mode would end and I wouldn't enjoy that process.","replies":[]},{"poster":"RottedApples","date":"2017-11-24T07:50:19.037+0000","up_votes":1,"down_votes":0,"body":"i looked at it and was like, oh this is just gonna be twitch/vayne being assassins instead of adcs.\n\nat least twitch is banned from it.\n\nstill was pretty unfun to play.","replies":[]},{"poster":"Illâoi Evê Siôn","date":"2017-11-24T09:52:25.133+0000","up_votes":1,"down_votes":1,"body":"I love running away when my enemies are powered up. There's this one spot where you can walk in circles from vent to vent, it's fun as hell. \n\nI'm only annoyed by Corki getting the package on no cooldown when he's powered up.","replies":[]},{"poster":"Pandemic Punch","date":"2017-11-24T09:45:21.028+0000","up_votes":1,"down_votes":2,"body":"-Cool map\n-Cool music\n-I hate marksman so I hate this game mode\n-Would be amazing if it was PvE\n-Would be cool if you had to sneak around and assassinate key targets without being spotted in some areas\n-Would be cool if you had to battle it out with machines in other areas with tanks and supports added","replies":[]}]}