{"poster":"Professor Ward","date":"2017-10-29T13:25:27.334+0000","title":"Heavily Disappointed in the Rune/essence Exchange Rate","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"I mean i hate to bitch, i own every rune to the level that i had to get riot to remove some to give me room for more... But the amount of essence im going to get compared to what i spent is just BLEHHHHHHH\n\nHighest cost of rune page:\n820x27= 22,140\n2050x3=6,150\n**Total 28,290 ip for ONE full rune page**.\n\nRefund:\n100x27=2700\n300x3=900\n**Total=3600 blue essence.........\n**\nEven with the essence exchange math it would be\n169k roughly for 1 page\nand the exchange would be around 20k, far worse.\n\n\nAnd i fully understand these are the highest values possible but i sincerely remember having to save the ludicrous amount of ip for these pages and it irks me.\n\nI know i deserve nothing, just seems a little grubby imo, and obviously done so that previous rune purchasers werent set upon new season.\n\n","replies":[{"poster":"ChargeItDownMid","date":"2017-10-29T17:17:21.200+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Professor Ward","date":"2017-10-29T20:43:16.601+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=magewick,realm=NA,application-id=3ErqAdtq,discussion-id=t8bmaXO2,comment-id=0000,timestamp=2017-10-29T17:17:21.200+0000)\n>\n> Realistically, would you be all that much happier if they doubled the exchange from ip to essence and then doubled the prices of all the essence items? \n> \n> The thing you have to remember is that the exchange rates are just rescaling the currency with a new system. They just picked the value that would make heroes cost the same amount of essense next season as they do ip this season. They could have tripled or quadrupled everything so on paper, it looks like you are getting a higher number but at some point, those numbers just become unwieldy.\n\nThat would make sense but champions are just going to cost around 6x more\n\nso a 6300 ip champion is going to cost around 40k blue essence, im getting 300 for a quint....... \nIt would take me 133 quint exchanges to buy 1 champ........ \n\nThats not the same exchange ratio as it currently costing 3 quints for a champ. Not even closeeeeeeeeee\n\nI get that numbers are changing, but youre losing out huge on runes.","replies":[]}]},{"poster":"Goodwill","date":"2017-10-29T17:45:04.200+0000","up_votes":1,"down_votes":0,"body":"Well you did get good use of them","replies":[]}]}