{"poster":"1800CANIGETAGANK","date":"2016-04-24T12:02:03.162+0000","title":"I highly doubt there's a legitimate solo player that enjoys playing with/against 4man dynamics.","subforum":"Gameplay","up_votes":272,"down_votes":61,"body":"So if you&#039;re going to shove dynamic que down our throats &amp; fuck over Solo players by scrapping the SoloQ ladder atleast remove 4man dynamics to remove some of the pain of soloQing.\n\nThere are so many issues, &amp; not even a single positive thing about 4man dynamics, even winning doesn&#039;t feel satifiying (similar to winning a 5v4) because you&#039;ve probably contributed nothing to the win while the 4man stomps the enemy team using voice coms.\n\nI can&#039;t imagine anyone would miss 4mans or could even provide a legitimate argument to keep them, I highly doubt there are many if any legit teams of players who only play 4man dynamic que, but there are ALOT of players who only SoloQ.\n\nHere&#039;s a list of things 4man dynamics can do if it&#039;s removed;\nsplit up into two duos\nplay 3 man\nfind a 5th\nPlay normals \n\n4 legit options, now here&#039;s a Solo players list of options if they want to avoid 4mans;\npray to the gods you don&#039;t get paired with/against a 4 man.\nlook up teammates to try figure out  if they&#039;re a 4man then dodge if they are.\nForce yourself to change how you enjoy playing the game and find dynamic partners.\n\nNone of those 3 options should have to be considered for SoloQ players.","replies":[{"poster":"ff4sk","date":"2016-04-24T12:24:35.600+0000","up_votes":66,"down_votes":7,"body":"Riot gives next to no fucks about solo players, to them we only exist to fill gaps for selfish premades.","replies":[{"poster":"High5","date":"2016-04-24T21:05:53.421+0000","up_votes":11,"down_votes":1,"body":"True.  $$ are louder than words.\n\nThe problem is when $$ decrease, companies double down on margins.  Lose lose both ways.","replies":[]},{"poster":"arrowhead21k","date":"2016-04-25T18:03:52.337+0000","up_votes":2,"down_votes":2,"body":"I don't get why you are so angry that you have to play with a team in a team game. dynamic que allows you to play with as many friends as you want instead of forcing you to only play with 1 friend or 4. If you can't handle playing with or against a team then you shouldn't be playing League Of Legends.","replies":[{"poster":"Fovere","date":"2016-04-25T23:23:15.571+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=arrowhead21k,realm=NA,application-id=3ErqAdtq,discussion-id=m3EsOhzb,comment-id=00000002,timestamp=2016-04-25T18:03:52.337+0000)\n>\n> I don&#x27;t get why you are so angry that you have to play with a team in a team game. dynamic que allows you to play with as many friends as you want instead of forcing you to only play with 1 friend or 4. If you can&#x27;t handle playing with or against a team then you shouldn&#x27;t be playing League Of Legends.\n\nPremades aren't a team, thanks.\n\nProper teams were actually taken away for DQ.","replies":[]}]}]},{"poster":"ArlanKels","date":"2016-04-24T12:28:41.702+0000","up_votes":20,"down_votes":59,"body":"I don't care if I'm against or with a group of people.\nWhy?\n\nCause I'm there to play the game.  If you can't enjoy the challenge of a coordinated group as your opponent why are you playing a team game?\nAnd if you can't stand playing with a group of premades who treat you like crap than you definitely haven't played online games before :P","replies":[{"poster":"ff4sk","date":"2016-04-24T12:42:41.359+0000","up_votes":54,"down_votes":5,"body":"Checking your op.gg I can clearly see that you're not a solo player and in fact tend to play with premades quite often.\n\nWhy do you feel the need to lie to defend your shitty unfair system?\nyour only argument right now is \"lmao if u get offended by me insulting you online and trolling then you shouldn't play\".\n\nthanks for proving that premades are not only toxic and selfish but are also liars.","replies":[{"poster":"Zedex","date":"2016-04-24T13:34:36.568+0000","up_votes":10,"down_votes":48,"body":"premades are selfish yet the smaller, vocal (whiney) demograph of solo players want a vastly superior queue removed in favor of their playground. Tell me again which one of us is selfish?","replies":[{"poster":"ff4sk","date":"2016-04-24T13:48:50.240+0000","up_votes":62,"down_votes":11,"body":"Nobody is asking for dynamic queue to be removed.\nIf you want your game mode then fine keep it.\nWhat's selfish is you expecting solo players to put up with the insults and shit they get from premades, waste 30-40 minutes of their life, all so a premade can shit on them while their own premade won't even ping ss when their lanes are empty.\n\nWhat's selfish is not wanting us solo players to have our own game mode away from you so your game mode can stay alive.\n\nWhat's selfish is you having the nerve to call me selfish for demanding a choice while you support a game mode which shits on solo players and uses them as cogs only existing to fit gaps for premades.\n\nYou pro dynamic queue players are so selfish, entitled, and delusional that it's actually disgusting.\nI feel disgusted even being in a game with someone so far up their own fucking ass.","replies":[{"poster":"Cursed Aegis","date":"2016-04-24T14:11:32.027+0000","up_votes":24,"down_votes":5,"body":"> [{quoted}](name=ff4sk,realm=NA,application-id=3ErqAdtq,discussion-id=m3EsOhzb,comment-id=0001000100010000,timestamp=2016-04-24T13:48:50.240+0000)\n>\n> Nobody is asking for dynamic queue to be removed.\n> If you want your game mode then fine keep it.\n> What&#x27;s selfish is you expecting solo players to put up with the insults and shit they get from premades, waste 30-40 minutes of their life, all so a premade can shit on them while their own premade won&#x27;t even ping ss when their lanes are empty.\n> \n> What&#x27;s selfish is not wanting us solo players to have our own game mode away from you so your game mode can stay alive.\n> \n> What&#x27;s selfish is you having the nerve to call me selfish for demanding a choice while you support a game mode which shits on solo players and uses them as cogs only existing to fit gaps for premades.\n> \n> You pro dynamic queue players are so selfish, entitled, and delusional that it&#x27;s actually disgusting.\n> I feel disgusted even being in a game with someone so far up their own fucking ass.\n\nTRUTH. Upvoted plus thousands.","replies":[]},{"poster":"Spicy Rice","date":"2016-04-24T14:33:51.125+0000","up_votes":8,"down_votes":20,"body":"Funny thing, without soloplayers, dynamic queue couldn't exist, so you basically are asking for it to be removed.\n\nAnd dont act like toxicity and lack of communication are a dynamic queue problem, its there in all game modes, at all times.","replies":[{"poster":"ff4sk","date":"2016-04-24T14:58:12.716+0000","up_votes":18,"down_votes":4,"body":"I'm asking for a choice, big difference from asking for DQ to be removed.\nIt's not my problem that riot created a failure of a queue to pander to shit players who can't climb the game on their own.\n\nToxicity is a lot higher in premades.\nGranted I've only been playing since season 5 but ever since DQ was implemented I've had a lot more people shit talk me with no worry since they know their premades will back them up.\n\nBut hey if you wanna keep dismissing valid points to defend dynamic queue fine, more power to you.\nGo do it to someone else though since I'm not interested in hearing it.","replies":[{"poster":"Fovere","date":"2016-04-24T20:56:32.801+0000","up_votes":12,"down_votes":1,"body":"> [{quoted}](name=ff4sk,realm=NA,application-id=3ErqAdtq,discussion-id=m3EsOhzb,comment-id=000100010001000000010000,timestamp=2016-04-24T14:58:12.716+0000)\n>\n> I&#x27;m asking for a choice, big difference from asking for DQ to be removed.\n> It&#x27;s not my problem that riot created a failure of a queue to pander to shit players who can&#x27;t climb the game on their own.\n> \n> Toxicity is a lot higher in premades.\n> Granted I&#x27;ve only been playing since season 5 but ever since DQ was implemented I&#x27;ve had a lot more people shit talk me with no worry since they know their premades will back them up.\n> \n> But hey if you wanna keep dismissing valid points to defend dynamic queue fine, more power to you.\n> Go do it to someone else though since I&#x27;m not interested in hearing it.\n\nThis exactly.\n\nThere are a small handful of board trolls trying disagree with everything people are saying, of the few arguments presented, they boil down to something like:\n\n- People should be able to play ranked with friends, DQ should exist\n\n- If there was DQ and SQ, DQ wouldn't work because no solo players would elect to fill the spots on that queue,  DQ and SQ cannot co-exist.\n\n- Therefore, SQ should not exist\n\n---\n\nThe issues surrounding illegitimacy of ranking, toxicity and other game experiences w/ premades, forced style of play, etc. are not addressed or acknowledged anywhere, because there is no defense against them.\n\nThe assertion here is that a minority of players that are competitive and want to queue in as a 3-4x premade should somehow take precedence over the majority of players who have happily been playing as a solo or 5x team for 5+ years. \n\nThe largely casual/social group of League players are not affected by this either way, because they are not looking to get into ranked gameplay.  The barrier is not the fact they need more than one friend to play with in order to play ranked, but simply that they don't want the pressure of having an MMR/ranking attached to their performance.","replies":[{"poster":"Elikain","date":"2016-04-24T21:49:11.880+0000","up_votes":3,"down_votes":8,"body":"There are also people who refuse to believe that DQ can offer both of the experiences without the need of separate queues.\nSome people want it removed and prior state reverted and there are those people who want both. Having both means splitting up the community and inheriting longer queue times that can't be fixed by Riot because the playerbase has been halved.\nThe whole point is to fix the matchmaking issue that is using SQ players and smaller premades as fillers because it's easier for them to fill missing spots on a team, that already has an established base (usually a premade).\n\nThe completely irrelevant issue in this argument is how they choose to climb the ladder:\n\n* they can try solo and rely entirely on their skill and mechanics\n* they can team up with friends\n\nI don't know why entitled people are trying to tell them how they should climb, every player can choose for themselves.","replies":[{"poster":"Fovere","date":"2016-04-24T23:00:11.977+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Elikain,realm=EUNE,application-id=3ErqAdtq,discussion-id=m3EsOhzb,comment-id=00010001000100000001000000010000,timestamp=2016-04-24T21:49:11.880+0000)\n>\n> There are also people who refuse to believe that DQ can offer both of the experiences without the need of separate queues.\n> Some people want it removed and prior state reverted and there are those people who want both. Having both means splitting up the community and inheriting longer queue times that can&#x27;t be fixed by Riot because the playerbase has been halved.\n> The whole point is to fix the matchmaking issue that is using SQ players and smaller premades as fillers because it&#x27;s easier for them to fill missing spots on a team, that already has an established base (usually a premade).\n> \n> The completely irrelevant issue in this argument is how they choose to climb the ladder:\n> \n> * they can try solo and rely entirely on their skill and mechanics\n> * they can team up with friends\n> \n> I don&#x27;t know why entitled people are trying to tell them how they should climb, every player can choose for themselves.\n\nBut you are still comparing apples and oranges.\n\nAny \"fix\" to the MM that would allow solo players to stay outside of the \"filler\" roles in premades is effectively making two separate queues.\n\nThere needs to be two ladders, or more, it's really not that big of a deal.\n\nThe player base in this game is massive, and the only issue I can see with multiple queues is trying to find solo players willing to support for these premades, so it may be that, in terms of DQ, a team builder-like approach might be a better fit, since it allows a lot more flexibility in roles.","replies":[]}]}]}]}]},{"poster":"EROTIC RAID BOSS","date":"2016-04-25T03:32:43.352+0000","up_votes":1,"down_votes":1,"body":"Adding solo queue will lead to increased queue times. It might lead to one of the 2 being unplayable, in fact its likely. So yeah you're being pretty selfish since you can queue up solo just fine","replies":[{"poster":"ff4sk","date":"2016-04-27T00:46:08.325+0000","up_votes":2,"down_votes":0,"body":"I don't exist to fill gaps for you or your friends.\nHow am I being selfish for choosing how I want to spend your time and you're not selfish for literally wanting to use people as filler gaps so you can get boosted by your friends.\n\nAre you really that delusional that you don't see how selfish you're being? or do you just like to act stupid?","replies":[]}]}]}]},{"poster":"1800CANIGETAGANK","date":"2016-04-24T13:06:44.597+0000","up_votes":2,"down_votes":2,"body":"My recent match history will have a fair few duo/Trio ranked games & a lot of URF groups as I've been doing all nighters at gaming Cafes with friends due to my PC crashing.\n\nBut apart from that about 95% of ranked games I play on this account are solo.\nAlso I played about 5000 ranked games over the years on my old account (1800gankmylane, if op.gg shows old stats) and I'd estermate about 4500 of them were solo games, so I don't think I'm \"lying\" or doing whatever you're trying to accuse me of with your aggressive comment","replies":[{"poster":"ff4sk","date":"2016-04-24T13:09:31.559+0000","up_votes":5,"down_votes":0,"body":"I wasn't replying too you","replies":[]}]}]},{"poster":"Reformed Dunni","date":"2016-04-24T12:49:55.614+0000","up_votes":10,"down_votes":15,"body":"> [{quoted}](name=ArlanKels,realm=NA,application-id=3ErqAdtq,discussion-id=m3EsOhzb,comment-id=0001,timestamp=2016-04-24T12:28:41.702+0000)\n>\n> I don&#x27;t care if I&#x27;m against or with a group of people.\n> Why?\n> \n> Cause I&#x27;m there to play the game.  If you can&#x27;t enjoy the challenge of a coordinated group as your opponent why are you playing a team game?\n> And if you can&#x27;t stand playing with a group of premades who treat you like crap than you definitely haven&#x27;t played online games before :P\n\nI agree with you I love the challenge of playing against premades and I haven't had a problem playing with them like people supposedly have here. I've never had a premade team that tried to troll me or feed intentionally the worst I get from premades is them not talking to me, in fact I played with some really nice premades one of them even wanted me to join their Skype call.","replies":[{"poster":"1800CANIGETAGANK","date":"2016-04-24T13:34:44.029+0000","up_votes":11,"down_votes":2,"body":"Ranked has always been about your individual skill and your ability to communicate & work well with 3-4 strangers (atleast that's how I see it).\nI do enjoy the challenge of playing vs coordinated teams, that's why I played ranked 5's last season when I wanted that challenge.\n\n\nI do play lot of online games where I'm always with groups of people I know or that will \"treat you like crap\" (WoW & competitive FPS's for example)\n\nI enjoy the feeling of balance between being able to listen to music & focus on myself ingame while and working as a team with a group of randoms to achieve personal progression & accomplishments,  games with SoloQ ladders like Mobas make this possible.","replies":[]},{"poster":"1st Movement","date":"2016-04-24T13:37:45.559+0000","up_votes":1,"down_votes":21,"body":"> [{quoted}](name=Nublu,realm=NA,application-id=3ErqAdtq,discussion-id=m3EsOhzb,comment-id=00010002,timestamp=2016-04-24T12:49:55.614+0000)\n>\n> I agree with you I love the challenge of playing against premades and I haven&#x27;t had a problem playing with them like people supposedly have here. I&#x27;ve never had a premade team that tried to troll me or feed intentionally the worst I get from premades is them not talking to me, in fact I played with some really nice premades one of them even wanted me to join their Skype call.\n\nSame low elo players like to make an excuse for losing so why not blame it on dynamic que \n\nBeing coordinated does play a factor \nBut it's all end up to mechcanics and skill","replies":[{"poster":"pulledchicken","date":"2016-04-24T14:33:27.068+0000","up_votes":3,"down_votes":8,"body":"lol  said by a very bad low elo player!","replies":[{"poster":"1st Movement","date":"2016-04-24T14:40:03.122+0000","up_votes":9,"down_votes":3,"body":"> [{quoted}](name=pulledchicken,realm=NA,application-id=3ErqAdtq,discussion-id=m3EsOhzb,comment-id=0001000200010000,timestamp=2016-04-24T14:33:27.068+0000)\n>\n> lol  said by a very bad low elo player!\n\nNublu has the right attitude for climbing\n\nwhat you are insinuating makes no sense","replies":[{"poster":"Kai Guy","date":"2016-04-25T01:15:04.985+0000","up_votes":3,"down_votes":1,"body":"Hi im a med elo soso player, and i think that his attitude is on the right track.  I also want to point out that chicken, you do not have any ranked matches in your history. If your going to trash talk some ones elo at least have the decency to do it not on a smurf account, or if this is your main, Why are you complaining in a DQ Ranked thread when its not a game mode you even play?","replies":[]}]}]}]}]}]},{"poster":"Nameless Voice","date":"2016-04-24T13:16:41.713+0000","up_votes":26,"down_votes":4,"body":"You missed one thing.\nWhy people don't want want to play with 4-man premades on their team:\n\n - Because they are usually on voice chat and so don't communicate with the 5th player at all...\n - ... except to flame them for any mistake (real or imagined)...\n - ... and as someone to blame when they lose.","replies":[{"poster":"macromite","date":"2016-04-24T15:44:58.007+0000","up_votes":5,"down_votes":17,"body":"you missed some things as well.\n\nIf you get flamed, it's probably for a reason, stupid or not.\nand if you're with a four man queue that's yelling at the random, they are also pretty much guaranteed to be yelling at each other, you just can't tell.","replies":[{"poster":"Nameless Voice","date":"2016-04-24T18:07:02.217+0000","up_votes":8,"down_votes":0,"body":"The usual reasons are \"you picked the jungler, so you're the obvious target to blame if they all lose all of their own lanes\", or \"you picked the support, so it's obviously your fault if the ADC dies a lot.\"","replies":[]}]}]},{"poster":"Hyrum Graff","date":"2016-04-24T15:16:14.496+0000","up_votes":27,"down_votes":7,"body":"#Show of hands, who enjoys playing solo w/ 4man premades?\n\n######*Raises hand*\n\n######*/hides*","replies":[]},{"poster":"Dicerson","date":"2016-04-24T15:31:41.405+0000","up_votes":24,"down_votes":8,"body":"Solo player who doesn't care who he's matched with and enjoys dynamic queue every day says hi.","replies":[{"poster":"Twiggles","date":"2016-04-24T15:50:05.937+0000","up_votes":10,"down_votes":5,"body":"Greetings. You have at least one like-minded individual here with you. :)","replies":[{"poster":"Mister Support","date":"2016-04-24T16:02:43.385+0000","up_votes":10,"down_votes":5,"body":"Make that 2! :D\nAlso don't get why people complain so much about premades, they don't even happen that much (maybe 2 times in my 120 games so far)","replies":[]}]}]},{"poster":"Dataless","date":"2016-04-24T20:34:15.387+0000","up_votes":16,"down_votes":3,"body":"I don't really agree with this. Allow me to explain:\n\nIf a multi-player party is on my team in Dynamic queue and I'm the \"solo player\" it makes no difference to me. At the end of the day they are still going to play their expected roles and do their jobs in a similar manner as would a 5 man PUG. The only REAL difference is the possibility of them being in voice comm with one another and thus possibly having better communication with one another in real time. HOWEVER this is not always the case, as playing with my friends has illustrated this time and time again. A lot of people talk shit, dick around, or even get frustrated and argue with one another when the game goes poorly in voice comm, and this lowers the \"potential play\" of the group significantly. Voice comm, in my mind, is not an innate advantage. Especially at low levels of play where people don't actually know how to play the game and just mindlessly lane phase long after towers fall, or joust down mid lane forcing bad team fights without any regard to macro-level objective based gameplay.\n\nIn these situations, it's really up to your individual skill and ability to work with 4 random strangers that determines your ultimate success or failure in game. That sounds a whole lot like solo queue to me. \n\nNow let's look at the flip side of the coin, a large multi-player dynamic party on the enemy team. In my experience (as a low Plat player) the only time I see a large grouped party on the enemy team is if there is one on mine as well, that's how the matchmaking system works, or at least attempts to work. I understand at the higher levels of play this breaks down significantly, this can be seen on many high ELO streams. However let's all be real for a moment shall we? The people posting on the boards are not high ELO players (mostly, there could obviously be exceptions). I would even be willing to make so bold a statement that, as a low plat ranked player, I am in the MINORITY of posters, and most people fall into the Bronze - Gold category. Again, I will reiterate that this is a broad-stroke statement and I could very well be wrong, I am in no way attempting to suggest I have definitive data to support my opinion. \n\nBut back to the matter at hand.\n\nIf my opinion, for the sake of argument, is correct, that means the vast majority of games played are not being ruined by the random Diamond 5 player getting shit on by Master tier/challenger premades grouping together to reduce queue time. In most cases a dynamic group on the enemy team will be 2 - 4 players of marginally equal skill, matched against a similarly sized party of equivalent skill, with solo queue players added in to round out the teams. This is my understanding of how the system works. The primary issue as far as I can tell is most likely role disparity between the two premade teams, which can most certainly feel like you're getting stomped by a higher-level player if you happen to roll the dice and lose. (especially in the case of bot lane, which is a powder keg already even without jungler intervention). I however believe that this disparity is for the most part blown out of proportion.\n\nThe low ELO community seems to be very impressionable about the state of the game, they probably watch a lot of streams and hear high level players talk about how busted Dynamic queue is, and because their hero thinks the system is flawed, any perceived imbalance in their own experience is obviously the same thing. This could not be further from the truth, but the power of expectation and preconception has a nasty habit of overriding reality. In my experiences as a low Plat ELO player, premade groups have never once ruined the quality of a game for me. Not once. The enemy team had never been so much better that defeat was an inevitable conclusion, and it has always been the actions or inaction of myself and my teammates that lead to any defeat we might experience. If the bot lane gets shit on because our duo lane (or the enemy duo lane) has better champion and player synergy, so be it. This can happen even in \"true 5 random player solo queue\" sometimes two random strangers just GET one another and play together in perfect unison, other times there is no synergy at all and you just flat out lose. This is just one example of many, the same could be said about mid/jungle or top/jungle synergy. Just because people are grouped up and talking DOES NOT MEAN they actually know how to play together well.\n\nI cannot stress this enough.\n\nI understand that this is a very volatile time in League, but no more so than in seasons past, and I urge players to not be sheep and jump on the \"I hate dynamic queue bandwagon\" simply because you wish to defer responsibility away from yourself. This will not make you a better player, and this will not call Riot to action and magically make them undo every change they have made in order to placate you. Being good at league of legends as a SOLO player is about adaptability and self-reliance. From top lane down to support, no matter what role you play, even with (or against) a 5 man premade the power is ALWAYS in your hands to win the game through concentrated effort and a willingness to play as a team. If you lose then you lose, look to your mistakes and improve upon them. If you win because you get carried by your 4 man premade, thank them for the carry and move on. Solo queue below Diamond arguably hasn't changed at all, the only difference is the name, the amount of random people grouped up together who probably have no synergy together to begin with, and the expectation that brings.\n\nDo not be a sheep, do not fall into the trap of preconception. Be a solo queue player, win by your own power or lose by it.\n\n\n*I will again reiterate that this is my OPINION and am not forcing anyone to accept it, nor am I attempting to invalidate the thoughts and opinions of others. I am offering my own unique perspective on the situation. No more no less.","replies":[]},{"poster":"AgentBlack","date":"2016-04-24T15:53:00.136+0000","up_votes":12,"down_votes":4,"body":"Provided they're not outright assholes (uncommon, in my experience, though the whining on the boards implies otherwise), I enjoy 4-man premades.  I'm a pretty flexible player, and willing to adapt to a strategy they have thought out and are in a good position to execute (through voice chat), provided I pull my weight.  In fact, whenever I group with friends, we almost always happen to end up a 4-man premade, and we never mistreat our 5th.","replies":[]},{"poster":"Laerai","date":"2016-04-24T14:31:07.588+0000","up_votes":12,"down_votes":5,"body":"I am a pretty much exclusively solo player that doesn't mind 4 man premades at all. I have never experienced the infamous 3 or 4 man dives or invades which seem to be so common, nor have I ever been ganged up on for feeding. I honestly enjoy dynamic queue more than the old ranked because of the new ban system + guaranteed roles.\n\nIn some ways, it's relieving to know you have a 4 man premades on your team because voice comms should give them a kind of coordination that makes up for any individually weak players. It's also funny imagining what the opposing premade's curse call is like after you dumpster one of their laners. Do they flame their friend or just add to the awkwardness by staying quiet?\n\nThis is just my experience but I do think there are plenty of solo players who don't mind playing with 4 man premades. It's really not so bad...","replies":[{"poster":"SSShutTheDuckUp","date":"2016-04-24T15:42:25.784+0000","up_votes":3,"down_votes":0,"body":"DQ has absolutely nothing to do with champselect","replies":[]}]},{"poster":"Scrimshäw","date":"2016-04-24T15:51:30.527+0000","up_votes":7,"down_votes":1,"body":"i only play ranked solo, and i don't really care\n\nthe only thing i hate about ranked is my team, not the enemy's.","replies":[]},{"poster":"Propheciah","date":"2016-04-25T08:39:08.667+0000","up_votes":3,"down_votes":4,"body":"Everyone who is getting angry at premades and calling them selfish need to get their sense of entitlement checked out. Dynamic queue is better. Straight up. And this is coming from someone who has played a little over 200 ranked games and I almost never duo, triple, or quadra queue. Its probably fair to say I've gone solo in about 180 of those games. I've been able to climb the ladder solo just fine. I can only recall two or three occurrences where I played with or against a larger than 2 man premade. All of you whiners just want a scapegoat as to why you can't climb, and if you think premades are the reason why you can't climb then you are delusional. Regardless, having the choice to play with friends is better than not having the choice. And don't say that Riot can just split the queues, because then good luck having insane queue times. I don't care how big the player base is, it will ruin matchmaking and create problems that simply are not worth the headache. The only time when it is justifiable to complain is if you are in challenger or masters going against LCS premade teams. But you, OP, are barely even Gold 5 so this DOES NOT APPLY TO YOU. And it doesn't apply to anybody in this thread I'm sure. You can't climb because you play poorly or not consistently enough or you don't play enough games, end of story.  Yes I agree, it is not fun at all to play against large groups of premades on the very rare occassions they come across me, but its not like its always an instant loss anyways. Contrary to what some of you might want to think, Riot is a large and successful and they know what they are doing with their game. It may not be the vision you like, but it a vision they are ever so vigilantly bringing to fruition. Having one unified queue is healthier for the game, and I personally am an advocate for that. Even as a mainly solo player.","replies":[{"poster":"Occams Raiser","date":"2016-04-25T13:17:05.568+0000","up_votes":5,"down_votes":0,"body":"USE PARAGRAPHS!","replies":[]}]},{"poster":"StealthWarden","date":"2016-04-25T12:38:00.707+0000","up_votes":4,"down_votes":0,"body":"Hi,\nI am a solo player and i love combating pre-mades in ranked, it gives me a challenge and opportunity to test my skills.\n\n\n-------------------------------------------------------------------------------------\n\n_ Somebody please save me, I've been captured by Riot Lyte and forced to play against 4 man pre-made Queues over and over again in an attempt to brainwash me into thinking i actually enjoy it. Please hurry before Phreak gets back for my daily PUN-ishment!!!_","replies":[]},{"poster":"BadmoonBC","date":"2016-04-25T05:16:38.688+0000","up_votes":4,"down_votes":0,"body":"I stopped playing this game ranked because I am always grouped with 4 shit players and I'm supposed to even out the mmr. Sure I can carry 1/3 or 1/4 games but give me a break. This game sucks for solo players now.","replies":[]},{"poster":"LaserDeathBlade","date":"2016-04-25T04:11:58.526+0000","up_votes":4,"down_votes":0,"body":"Remove 3 man queues too","replies":[]},{"poster":"CasterGilgamesh","date":"2016-04-24T16:16:40.434+0000","up_votes":6,"down_votes":2,"body":"i honestly dont care about premades i main support so im just in the back ground(as {{champion:16}} {{champion:267}}) or front line({{champion:98}} {{champion:201}})\nplus solo Q was never really a true Solo Q since you can invite a friend to carry you","replies":[]},{"poster":"ƒoes","date":"2016-04-25T22:14:24.299+0000","up_votes":3,"down_votes":0,"body":"The only thing I really dislike about playing with/against a 4-man dynamic (I really never play solo queue, but when I do this is what I get) is when you get that non-English speaking group.\n\nThe other day there were people that, I don't know if they were trolling, in a call together, or were speaking a legitimate language, but some of it looked like they had taken everything they normally would have written, and shifted it up on their keyboard (a = q, z = a, etc.). Some of it had English components, but in general they were incredibly hard to communicate with without pings.","replies":[]},{"poster":"Cirrusstrafe","date":"2016-04-25T16:56:55.229+0000","up_votes":3,"down_votes":0,"body":"Let me start this by saying I do truly believe it's unfair for there to be no solos-only queue.  I think that people who want a 1+1+1+1+1 vs 1+1+1+1+1 experience should be allowed to have it and not be forced into 1+4 v 1+4.  Two players can enjoy all kinds of team permutations in new ranked.  Three can do the same or play TT.  Five is an easy sell.  However, four players have no reliably easy way to do anything together that doesn't have the potential to make a single entity miserable.  Finding a fifth is a joke, good luck with that, normals instills much the same problem except that your solo tagalong is much more likely to randomly pair against someone way better because hashtag normal ELO matching, and splitting into two duos is probably not the reason all four people got on at the same time.\n\nThat said, I don't see what the problem is if you enter into DQ willingly and with the mindset to play knowing this.  I know of this \"problem\" and so when I soloqueue into a four man premade, I just stick with them as much as possible.\n\nIn fact, it's pretty relaxing.  I don't have to try and lead, I don't have to argue into the popular vote for or against shots called, and at least now I know these four should have some semblance of coordination and teamwork rather than the moving target experience I'd get with four more solos.\n\nIf the four man premade is a bunch of jerkwads then there's nothing you can do about it, but at least it's four jerkwads in unison, rather than four jerkwads flipping out on each other making your team a douchebag pentagon.  However, if the options are you + 1+1+1+1 and they're all dicks, then at least you + 4 and they're all dicks is a better chance at winning.","replies":[]},{"poster":"The Deckowner","date":"2016-04-25T04:10:14.091+0000","up_votes":3,"down_votes":0,"body":"You don't have to doubt. logically speaking there is no reason to enjoy playing with a 4man queue as a solo player","replies":[]},{"poster":"Daen","date":"2016-04-24T23:49:53.121+0000","up_votes":3,"down_votes":0,"body":"Overall, with Dynamic Queue **for Ranked**, here's my perspective:\n\n* Pure Solo Queue (note: **NOT** Solo/Duo, no premades whatsoever) is mathematically more fair/balanced than Dynamic Queue\n* Dynamic Queue creates a better behavioral environment for players than solo queue\n\nI'm happy to provide data on the first and I expect Riot has pretty clear data on the second, but that's not the point.  The point is, the following question needs to be asked:\n\n\"What is Ranked supposed to be?\"\n\nI expect the answer here lies on a continuum between maximum competition and minimum toxicity.  If this were a simple binary question, Pure Solo Queue is the logical choice for maximum competition and Dynamic Queue is the logical choice for minimum toxicity.  I've seen arguments saying Dynamic Queue sucks from both the perspectives of competitiveness and toxicity, and they conflict with each other pretty significantly.\n\nWhat we need to do, as a community, is figure out where on this line we want to be, **then** start trying to open up a dialogue with Riot.  It's really hard to have reasonable discourse when we're all so polarized, and it makes change pretty much impossible if we can't entertain the possibility of consensus.","replies":[]},{"poster":"Fovere","date":"2016-04-24T14:30:19.588+0000","up_votes":4,"down_votes":1,"body":"Zedex is a troll and you shouldn't let him get to you.","replies":[{"poster":"l PopstarAhri l","date":"2016-04-24T15:40:11.565+0000","up_votes":3,"down_votes":0,"body":"I've noticed that too, always responds with rude and negative comments{{champion:103}}","replies":[]}]},{"poster":"M Dragon14","date":"2016-04-24T21:57:21.693+0000","up_votes":4,"down_votes":1,"body":"I can't say how many times I have been dropped into a 4 man que as a solo..... At least 60% of the time? At the very least. And of those, I have been put against a 5 man group at least 7-8 times so far, much, much higher than the % that riot said their system allowed. Good thing I hardly play solo.... Oh wait, that's right! When ever I duo, it's almost ALWAYS a 4 man group on the enemy team with our team only having my duo, and sometimes a 2nd. The only way I don't get stuck in a 4 man now, is when I trio que. That's it.","replies":[{"poster":"Teralisan","date":"2016-04-25T17:56:23.026+0000","up_votes":1,"down_votes":2,"body":"your closing statement is contradicted by your initial statement\n\nyou liar","replies":[]}]}]}