{"poster":"Daser","date":"2018-11-04T10:21:50.555+0000","title":"Riot-support ignoriert eine Anfrage seit 6 Tagen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich hatte einen Anscheinend Bug, welcher zu einer Niederlage in meiner Soloque gef&uuml;hrt hat, als ich diesen gemeldet hab, schreib bis heute keiner zur&uuml;ck\nIch schick einen Link auf diese Anfrage bei Nachfrage.\n\nEdit:Dieser Beitrag wird ebenfalls ignoriert......{{sticker:slayer-jinx-unamused}} ","replies":[{"poster":"Bloodripper Pyke","date":"2018-11-04T11:41:01.540+0000","up_votes":2,"down_votes":0,"body":"Hey Daser22,\n\nder Support hat meistens viel zu tun und es kann ein paar Tage bis zu einer Antwort dauern. Im Zweifelsfall einfach nochmal nachhaken.\n\nEinen Bug melden kannst du auch [hier](https://boards.euw.leagueoflegends.com/de/c/melde-einen-bug) im Forum. Ein kleinen Leitfaden, wie dies richtig geht, gibt es [hier](https://boards.euw.leagueoflegends.com/de/c/melde-einen-bug/T8sd6qtH-wichtig-was-ist-ein-bug-und-wie-melde-ich-diesen-richtig).\n\nFalls du dir eine Erstattung der verlorenen LP erhoffst, brauchst du dir jedoch keine Hoffnung machen. \n\n{{sticker:sg-ahri-2}}","replies":[{"poster":"Daser","date":"2018-11-04T11:44:57.845+0000","up_votes":1,"down_votes":2,"body":"Kein wunder warum jeder mit League aufhört\nIch konnte nicht remake durch einen Bug, da der Afk nie im Spiel war.\nAber bekomme dennoch nicht meine Leaguepoints zurück\nIhr habt weder Ehre noch funktionsfähige Geschlechtorg..... Ok das wäre dann wohl doch zuviel\nIch hoffe ihr könnt meinen tilt verstehen, aber mir kommt es eben so vor, als ob ihr bei zu komplizierten Sachen extra wegschauen würdet.\nIch hab einmal 400 Rp bei einem Turnier bekommen\nDen 4 Win-Boost bekam ich, die rp aber nie\nIch beschwerte mich und mir wurde nicht geholfen\nWofür ist der Support überhaupt gut????","replies":[{"poster":"Bloodripper Pyke","date":"2018-11-04T11:54:42.131+0000","up_votes":3,"down_votes":0,"body":"Wenn du einen Remake Bug gefunden hast, dann melde ihn und er wird behoben. (Vielleicht ist der Spieler aber auch kurz connectet und du hast es einfach nicht mitbekommen?)\n\nDas mit den RP glaube ich dir wiederum nicht. Wenn du ein Ticket geschrieben hättest, hätte der Support sich auch darum gekümmert. Bei sowas sind die sehr schnell und zuverlässig.\n\nP.S. Wenn du den Support auf solch eine Art und Weise anschreibst, kann ich verstehen, wenn die sich Zeit lassen. Du hättest bestimmt auch keine Lust Leuten zu antworten, die dich beleidigen.\n{{sticker:sg-lulu}}","replies":[{"poster":"Daser","date":"2018-11-04T12:30:08.597+0000","up_votes":1,"down_votes":2,"body":"Wenn man seit 6 tagen ignoriert wird und man LP durch einen Bug verloren hat, wird man mal salzig mein Lieber","replies":[{"poster":"Daser","date":"2018-11-04T12:30:47.716+0000","up_votes":1,"down_votes":1,"body":"Und doch das mit dem Tunier stimmt","replies":[]}]}]}]}]},{"poster":"Apocryphos","date":"2018-11-04T15:46:58.869+0000","up_votes":1,"down_votes":0,"body":"Hey ya!\n\nWiss bitte, dass das Ticket am Ende der Warteschlange geht, wenn du etwas Neues im Ticket schreibst. Vielleicht hast du es gemacht und deswegen wartest du so viel auf eine Antwort. ;/","replies":[]}]}