{"poster":"BlackRevolt","date":"2018-02-18T09:54:23.546+0000","title":"Gute Ergänzung/Meinung zu meinem Championpool zum climben","subforum":"Level Up: Guides & Tipps","embed":{"description":"BlackRevolt / Bronze 2 0LP / 40W 34L Win Ratio 54% / Malzahar - 12W 8L Win Ratio 60%, Fizz - 11W 3L Win Ratio 79%, Veigar - 6W 2L Win Ratio 75%, Warwick - 4W 4L Win Ratio 50%, Ekko - 6W 1L Win Ratio 86%","url":"http://euw.op.gg/summoner/userName=blackrevolt","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":0,"body":"Hallo Comunity,\r\nich w&uuml;rde gerne wissen was ihr von meinem Ranked championpool halted. Ich spiele eigentlich nur Midlane, als zweite Rolle nehme ich eig. immer Support und picke zB. Veigar und Spiele im late einfach als normaler mage. Momentan spiele ich Veigar und Fizz abwechselnd, Malz wenn ich denke das die gegner einen Champion haben der mein Team zerst&ouml;rt und wir mehr CC daf&uuml;r brauchen (zB Nasus). Gelgentlich spiel ich auch mal Ekko, aber eher selten. Ich suche nach irgendwas, was viel Roaming potential hatt im earlygame, also evtl sogar pre 6 (Ahri?), da in Bronze bisdahin schon viel... &auml;hhh... Laggs im spiel auftauchen und Leute wegen ihrem Jungler die Lane verlieren... Ich habe bisher nur viel erfolg gehabt mit sachen mit viel stuns wie veigars E, wo jeder irgendwie freiwillige reinl&auml;uft und gutes scaling oder champions wie FIzz, mit denen ich meist die Spiele dadurch gewinne das ich den gegnerischen Jungler und Botlane campe und so die gegner durch Frustration und durch viel weniger Zeit auf der Map zum verlieren bringe...\r\nWie bei Fizz merke ich, das es schon (seit dem ich auf dem weg aus bronze bin und ich nicht jedesmal mehr die lane total stompe) jetzt immer ein klein wenig schwieriger wird total aus kontrolle zu Snowballen jedes Spiel und ich w&uuml;rde auch gerne etwas im championpool haben was gegen lanebullis gut ist, was man bei FIzz und Veigar (wegen der Reichweite) nicht behaupten kann, oder evtl. selber ein lanebulli ist.\r\nIch freue mich falls jemand viel langeweile hat und so nett ist mir Tipps zu geben,\r\nMfg Blackrevolt","replies":[{"poster":"EumeI","date":"2018-02-18T10:32:54.283+0000","up_votes":1,"down_votes":0,"body":"Spiel doch einfach deine 5 besten Champs immer. Du hast auf Malz, Fizz, Veigar, Ekko und Annie eine Winrate die über 60% ist.  Solange die Winrate so positiv ist wirst du aufsteigen. Da brauchst du keine weiteren Champs zum aufsteigen.","replies":[{"poster":"BlackRevolt","date":"2018-02-18T10:54:07.906+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Death23Stars,realm=EUW,application-id=vatevpvi,discussion-id=50FyV8eX,comment-id=0000,timestamp=2018-02-18T10:32:54.283+0000)\n>\n> Spiel doch einfach deine 5 besten Champs immer. Du hast auf Malz, Fizz, Veigar, Ekko und Annie eine Winrate die über 60% ist.  Solange die Winrate so positiv ist wirst du aufsteigen. Da brauchst du keine weiteren Champs zum aufsteigen.\n\nJa, ich denke schon das würde klappen, aber ich kann mit malz und veigar zb nicht gut die map beeinflußen, da ich meist nicht so genau weis wo der gegnerische jungler ist und ich dem nicht aleine als mage übern weg laufen möchte in den meisten fällen, und die botlane ganken ist die beste prävention davor, dass sie die lane zu hart verlieren. Deßhalb war die Frage ob ich da nicht einfach noch etwas anderes mit reinnehme. Ich werde aber glaub ich wirklich einfach bei diesen Champions bleiben, ich lerne gerade noch Kassadin und dan bin ich gut ausgestattet. Danke für die Antwort.","replies":[{"poster":"You Got My Name","date":"2018-03-09T11:45:53.738+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BlackRevolt,realm=EUW,application-id=vatevpvi,discussion-id=50FyV8eX,comment-id=00000000,timestamp=2018-02-18T10:54:07.906+0000)\n>\n> Ja, ich denke schon das würde klappen, aber ich kann mit malz und veigar zb nicht gut die map beeinflußen, da ich meist nicht so genau weis wo der gegnerische jungler ist und ich dem nicht aleine als mage übern weg laufen möchte in den meisten fällen, und die botlane ganken ist die beste prävention davor, dass sie die lane zu hart verlieren. Deßhalb war die Frage ob ich da nicht einfach noch etwas anderes mit reinnehme. Ich werde aber glaub ich wirklich einfach bei diesen Champions bleiben, ich lerne gerade noch Kassadin und dan bin ich gut ausgestattet. Danke für die Antwort.\n\nadd mich und ich helfe dir","replies":[]}]}]}]}