{"poster":"Ozayax","date":"2016-10-26T13:43:54.039+0000","title":"Katarina Rework","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Hallo Leute! Ich wollte Euch fragen was Ihr &uuml;ber die neue Katarina denkt? (PBE Assassinen Rework)\r\nFindet ihr sie sei zu op? Ist das ein gelungener Rework oder nicht?\r\n(:","replies":[{"poster":"Kata Ga Kill","date":"2016-10-27T02:17:15.212+0000","up_votes":1,"down_votes":1,"body":"Ich als Kata main finde dieses Rework schlecht und ein kompletter Nerf für sie:\n\nPassive: Nerf, da kein Speed Kill Potential mehr, mehr dazu später zu den Skills.\n\nQ: Nerf, weniger Bouncing, kein Mark zum auslösen. Dazu ist neu ein Random Ding das unterm Gegnerischen Turret klebt, weiterhin ist die dauer sehr begrenzt und die Jackpotfrage ist: **Welcher Idiot stellt sich neben Ihrem Dolch?** Ihr seht, komplett RIP die Q.\n\nW: Der größte Nerf für sie, kein aktiver DMG Spell mehr für sie, auch was die meisten an Kata lieben ist einfache ihre alte W gewesen einfach schneller Bums AoE fertig. Das war auch ihre größte stärke mit Ihrer Passiven Shunpo + Blitzschneller W auserhalb ihrer Ulti war das ihre einzige Kombo Wombo.\nJetzt ist sie ein non DMG Spell die keine wirkliche aktive Komponente mit ihrer Passiven kooperiert. Will man wirklich als Kata im Hot Spot 1,5 Sekunden warten für den Dolch? \nUm einen Zed W oder Leblanc W Mechanickzu haben zum Backjumpen muss man wirklich nicht einen kompletten Skill von Kata löschen, **da hätte man simpel die E verbessern können das sie flexibel überall wie Ezreal jumpen kann, und die E beim Mark auslösen einfach resettet wird...**\n\nE: Nerf aus 2 Gründen, wie eben angesprochen keine Wardjumps mehr bzw. anstatt flexibel wie Ezreal zu jumpen ist die ohne Vasalen oder Dolche nutzlos und steif berechenbar.\nDer andere Grund ist das sie jetzt ihren Weg per Shunpo zeigt.\nZuletzt noch wird das mit dem hin und her hüpfen nicht wirklich funktionieren da, der Shunpo beim Dolch Reset nicht vollständig resettet wird, sondern nur bis 2 Sekunden, muss sie solange ausharren bevor sie zum W Dolch zurück jumpen kann da kann man sie locker CCen oder Bursten.\n\nR: Der Radius ist für Kata Mains eher Nerf da jetzt Gegner nun wissen wo Ihr Radius liegt. Dem Kata Noob eine große nette optische Hilfe. Und als Kata Main finde ichs ne hübsche sache aber ehrlich nötig habe ichs nicht wenns meinem Gegner hilft....\nDer weitere Knackpunkt warum sie nicht im Kompetitiven Bereich gespielt wird ist das Ihre Ultimate CCbar ist wie vorhin.\nBei der Masse an koordienierten CC's ist Kata dort unspielbar.\nDa hätte man sie immun gegen CC machen können während des drehens oder Out of Combat, so das Gegner simple Rauslaufen/Jumpen sollten.\nUnd jetzt ist aktuell sogar das Scaling der Ult reduziert worden.....\n\n\nIch meine ganz ehrlich wieso sollte man mit der neuen Kata/Assassinen nicht Tanky gehen fürs rumtänzeln wie zuvor Tank-Ekko/Fizz?\nAls Full AP ist die dafür zu Squishy und aktiven DMG Spell hat sie auser Q und R keine. \nDa ist es doch besser auf Mages zurückzugreifen die noch wirklichen Burst of Doom haben + Range + Hard CC:\n{{champion:134}} {{champion:112}} {{champion:61}} {{champion:1}} {{champion:103}} {{champion:34}} {{champion:136}}\n\nOder wieso nicht gleich Full AP {{champion:154}}  spielen, der mit E einen ADC one shotten kann, wies Sola gezeigt hat letztens? \n**Wozu ein gereworkter Assassine sein der keinen One Shotten kann?**\n\nOder wieso sollte ich nicht {{champion:85}} picken der in allen belangen besser ist als Kata?\n- Schnelle, Direkte und Simplere Mechanick\n- starken CC\n- Range ist besser\n- Mobilität vorhanden\n- Seine Ulti ist nicht nur krass stark sondern auch mit CC verbunden und das Witzloseste ist die Ulti kann man nicht unterbrechen mit CC","replies":[{"poster":"Ozayax","date":"2016-11-19T23:41:29.230+0000","up_votes":2,"down_votes":0,"body":"Ich komme jetzt vielleicht etwas zu spät aber, du redest mir sowas von der Seele! Ich finde auch dass sie Kata einfach DESTROYED haben. Die haben die einfach vom Penta Killer, zum: Ich warte auf meine Daggers und versuche dann zu killen.\nSie hat eigentlich überall einen Nerf bekommen, aber hat sie es gebraucht? **NEIN** , es gibt TONNENWEISE andere Champions die sie hätten auf so einer Weise nerfen können xD\nVon allen wird Kata in meinen Augen in höheren Rängen (Wenn nicht schon bei Silber...) absolut useless³ sein, denn es ist wirklich simple ihre fallenden Daggers auszuweichen.","replies":[]}]},{"poster":"Friendly Fox","date":"2016-11-02T09:01:52.121+0000","up_votes":1,"down_votes":0,"body":"Was mir bisher nicht ganz klar ist: macht Katarinas E DMG? Es sieht in den Videos immer so aus, als würde sie Gegner, die sie auf ihrem Weg streift wenn sie E einsätzt, schaden zufügt...","replies":[{"poster":"Ozayax","date":"2016-11-19T23:42:03.247+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Silmerion,realm=EUW,application-id=Wj1wcocU,discussion-id=lo65aNqi,comment-id=0003,timestamp=2016-11-02T09:01:52.121+0000)\n>\n> Was mir bisher nicht ganz klar ist: macht Katarinas E DMG? Es sieht in den Videos immer so aus, als würde sie Gegner, die sie auf ihrem Weg streift wenn sie E einsätzt, schaden zufügt...\n\nMag auch hier zu spät kommen, aber Ja, ihre E hat schon immer Schaden gemacht ^^","replies":[]}]},{"poster":"0815xand0r","date":"2016-10-26T16:05:14.199+0000","up_votes":1,"down_votes":0,"body":"Da ich leider kein PBE-Zugang habe, kann ich nur indirekt urteilen. OP wirkt sie bisher nicht, aber um einiges spaßiger, insbesondere weil die Laningphase dank der erhöhten HP-Regeneration angenehmer sein wird. Die Dagger-Mechanik bietet auch einfach mehr Gameplay als die aktuelle Katarina, bei der man ja im Prinzip nur wissen muss, wann der richtige Zeitpunkt zum engagen ist, und die Buttons in der richtigen Reihenfolge smashen.\n\nMit dem Rework muss/kann man halt planen, wie man wo seine Dagger positioniert, um dann den Gegner zu outplayen. Außerdem hat sie dank des Shunpo-Resets beim Dagger-Aufnehmen eine unglaubliche Mobilität und extremes Chase-Potential. Sie wird sicher schwieriger zu spielen, aber dafür auch lohnender.","replies":[]},{"poster":"hi depression","date":"2016-10-26T14:51:45.365+0000","up_votes":1,"down_votes":0,"body":"Hmm müsste ich selber spielen um das genauer beurteilen zu können. Auf den ersten Blick bietet sie zwar viel outplay potential, allerdings ist es ziemlich leicht zu predicten was sie tun wird und sie ist mit ihrem main dmg ohne ult an die dolchpositionen gebunden, was ziemlich schwierig werden könnte. Aber wie gesagt, dass ist nur mein Eindruck aus den videos die ich bisher gesehen habe, gespielt und \"gefühlt\" habe ich das noch nicht :p","replies":[]}]}