{"poster":"titan kirito","date":"2016-05-30T21:16:12.066+0000","title":"el nerf de alistar","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"hola  soy main suport   platino  esta es otra cuenta ya q me banearon en el foro con la mia xd  queria iniciar esta discusion con los main suport sobre todo los main alistar no cren q fue demasiado el nerf  a su r  literalmente no tanquea nada ya lo hicieron un papel creo q se le fue la mano a riot y ali es de mis campeones favoritos  me ayudo a subir a diamante la season pasada junto a soraka pero la verdad no me gusta jugarlo ahora es un papel con o sin ulti si hay algun chalenger o diamante alto o maestro  q tenga una build para jugarlo ahora lo q si  el alistar de ahora es jugarlo mas defensivo q antes  saludos y gracias x leer esto pd: quiero la opinion de un rioter  xd me hara feliz  ajja :v","replies":[{"poster":"Pablove90","date":"2016-05-31T01:00:50.555+0000","up_votes":2,"down_votes":0,"body":"podria quedarse asi un rato mas.. siempre los mismos support estan top3 tier esta bueno que vallan rotando un poco, alistar nunca bajo del tier en estos años... demosle lugar a otros que habian quedado fuera del meta auque sea por un par de parches.. estaria bueno que si suban un par de objetos de support como {{item:3092}} (EJEMPLO) PEEEROO... sumandole que solo lo puedan comprar los supports asi no pasa lo que paso en parches anteriores con la {{item:3092}}","replies":[]},{"poster":"Whitesse","date":"2016-05-30T23:53:50.915+0000","up_votes":2,"down_votes":0,"body":"Esta bien merecido ese nerf. A nivel 6 te hacia un all-in 1v5 y nadie lo podía matar literalmente.\nEn parte esta bien así se juegan mas seguido soportes como {{champion:201}}  o {{champion:26}} que se dejaron de ver por que Alistar los dejaba muy mal parados en cuanto a utilidad e iniciación.","replies":[]},{"poster":"Rolando Magic","date":"2016-05-30T22:31:17.067+0000","up_votes":2,"down_votes":0,"body":"Te apuesto lo que quieras que en futuros parches o de acá a un año lo vuelven a subir a 70% en todos los niveles porque rito sabe como balancear","replies":[]},{"poster":"Lfdu007","date":"2016-05-30T21:19:55.507+0000","up_votes":2,"down_votes":0,"body":"hola, yo tambien soy de jugar mucho alistar y me afecto un poco .. pero tambien se que alistar estaba un poco por arriba de los suports tanque y solo era por el hecho de la gran capacidad de tanquear todo ( literalmente todo) a partir de lvl 6... es un nerf al early a partir del lvl 2 de la r ya no se siente tanto ...","replies":[{"poster":"titan kirito","date":"2016-05-30T21:30:00.850+0000","up_votes":1,"down_votes":0,"body":"se  jugando una ranked   una kiindre me deleto a 6 con ulti con su  e y basicos jajajaja quede con cara de wtf  hace mucho q no lo usaba ahora el q tanquea todo en la bot lane es el taric a nivel 6 un diveo  bajo torre  y gg pero me soprendio bastante no pense q fuera tanto el nerf a su r en early","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2016-05-30T21:49:44.682+0000","up_votes":1,"down_votes":0,"body":"Recordemos que antes asi era la ulti de alis, es decir, le quitaron ese buffo.\nAun asi es un 50% porciento menos de daño y liberacion de las debilitaciones, y aumenta el ad.\nPara tankear, sueles usar el cc para entorpecer el daño del rival, pero alistar inicia y despues solo tiene el ulti, y una pequeña curacion.\nCreo que ahora el ulti se usara más para sobrevivir a la iniciacion, aguantar algunas habilidades, y poder re-posicionarse, más que para que no salga de la front-line.","replies":[]}]}