{"poster":"resumed","date":"2016-09-10T16:42:32.973+0000","title":"locket is crowding out other support items","subforum":"Gameplay","up_votes":83,"down_votes":10,"body":"riot did a good job at carving out niches for {{item:3504}}, {{item:3222}} &amp; {{item:3174}} &amp; the new {{item:3069}} is amazing and all, but {{item:3190}} is still rushed on every support that is not soraka, sona, or a high damage mage support\r\n\r\nlocket can&#039;t be nerfed either, because even though every support is basically balanced around this item, the ones that would get hit the most is tank supports; because tank support itemization is **extremely** poor. champions like karma and morg and janna can easily find other builds, but tank supports cant. seriously {{item:2049}} {{item:3401}} {{item:3190}} every game from EVERY tank support\r\n\r\nthe only other item that can compete with {{item:3190}} in terms of stats is {{item:3050}} but falls flat because the passive is extremely unreliable and is more offensive than what a tank support is comfortable buying.\r\n\r\nsupports need items like this\r\n{{item:3024}} + {{item:3114}} which could operate like a tank version of {{item:3174}} which amplifies the next heal or shield based on the amount of damage taken\r\n\r\nor maybe we can do something risky and reintroduce runic bulwark thats built out of these\r\n{{item:3105}} + {{item:3024}} \r\nwhich can provide a flat 3% damage reduction aura or something with an active that amplifies it to 10% for 5 seconds (so like mini maokai ult)\r\nreintroducing runic bulwark like this would still leave locket viable because locket has synergy with windspeakers while this new one would have synergy with bond of stone. it would also leave locket viable for tanks who buy the previous item i suggested","replies":[{"poster":"I hate my ADC","date":"2016-09-10T17:27:32.467+0000","up_votes":50,"down_votes":4,"body":"Honestly, they need to change {{item:3050}} entirely. The item just doesn't fill the niche it is meant for.\n50% crit chance is often wasted by ADC having so much access to crit chance while the 20% AP on yourself as a Support is useless and would only serve an AP mid laner. I don't know many, if any at all, AP mid laner that builds a Zeke.\n\nI'd rather the item increase attack damage by X% or Y flat number for the target the support is linked to while giving the support something more reliable like reducing damage taken by X% or increasing move speed by Y%.\nAnd like you said, the item itself is unreliable because it comes as a passive and it's a matter of luck if it happens during a fight or not.\nIt'd be better if it was an active instead.\n\nRegarding {{item:3190}}, I don't have much problem with it being what it is. It's like the jack of all trades, master of none item for every support. It's good in almost every situation without being overbearing. The problem is that there aren't enough support items that increase health for tank supports.\nThey need to change {{item:3056}}'s active to something useful. Maybe make it so that you can link yourself to a target, when near the target, said target take less damage, when away from target, increase your move speed while moving toward said target.","replies":[{"poster":"resumed","date":"2016-09-10T17:32:16.112+0000","up_votes":1,"down_votes":2,"body":"i agree completely. trying to utilize the items passive is hell and probably the only purchasable minigame. its also more likely to go off farming than in an actual fight. it'd be like if you only had 5 seconds to use your empowered aa from deadmans or empowered spell from ludens\n\nbut yeah with locket i just feel bad playing a tank support and having to build the same thing every game because there's literally no other options","replies":[{"poster":"I hate my ADC","date":"2016-09-10T17:37:05.138+0000","up_votes":16,"down_votes":0,"body":"That's why I want {{item:3056}} to become useful for tank supports.\n300 health, 50 armor, 10% CDR and 150% base hp regen. It's the perfect stats for a tank support but the active is so useless that it makes the cost not worth it.","replies":[{"poster":"A Doorknob","date":"2016-09-10T18:37:12.229+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=I hate my ADC,realm=NA,application-id=3ErqAdtq,discussion-id=cEc1eKf6,comment-id=000000000000,timestamp=2016-09-10T17:37:05.138+0000)\n>\n> That&#x27;s why I want {{item:3056}} to become useful for tank supports.\n> 300 health, 50 armor, 10% CDR and 150% base hp regen. It&#x27;s the perfect stats for a tank support but the active is so useless that it makes the cost not worth it.\n\nIt's ability isn't bad, it's just being applied to the wrong item. Tanks have no need of this item for late game and supports just don't make money quick enough to afford burning their gold on this item that becomes pointless in to late game, and to be honest, this ability seems like it would be more beneficial in the hands of a JG and or Assassin for tower diving purposes in early game.","replies":[{"poster":"I hate my ADC","date":"2016-09-10T18:42:23.561+0000","up_votes":2,"down_votes":0,"body":"Yeah but if it was available early, it would be too strong an item.\nHonestly, the active is just a bad design altogether. It's either going to be too strong or too weak. There is no middle ground to it.","replies":[]}]}]}]},{"poster":"Oleandervine","date":"2016-09-10T18:20:09.095+0000","up_votes":5,"down_votes":3,"body":"> [{quoted}](name=I hate my ADC,realm=NA,application-id=3ErqAdtq,discussion-id=cEc1eKf6,comment-id=0000,timestamp=2016-09-10T17:27:32.467+0000)\n> \n> Regarding {{item:3190}}, I don&#x27;t have much problem with it being what it is. It&#x27;s like the jack of all trades, master of none item for every support. It&#x27;s good in almost every situation without being overbearing. The problem is that there aren&#x27;t enough support items that increase health for tank supports.\n> They need to change {{item:3056}}&#x27;s active to something useful. Maybe make it so that you can link yourself to a target, when near the target, said target take less damage, when away from target, increase your move speed while moving toward said target.\n\nLocket most certainly is overbearing, and because it is a jack of all trades item is exactly why it needs to be changed. Items like it choke out other items because of its massive utility and I've been blasted by other players when I play support and choose not to build it. The passive on the Locket needs to be hit kinda hard to reduce its utility and make it more of a niche item, or it needs to no longer build from the Aegis.","replies":[{"poster":"I hate my ADC","date":"2016-09-10T18:40:07.530+0000","up_votes":12,"down_votes":2,"body":"Except that, it isn't.\nLocket isn't game changer like {{item:3069}}, {{item:3504}} or {{item:3222}} and even {{item:3050}}.\nIt's nowhere close as powerful as {{item:3174}} on champions like {{champion:37}}.\n\nSupport isn't like other roles. Once you committed to an item path, you are stuck with it because you don't have the gold to deal with sudden changes happening in the game. We need items that are jack of all trades without giving too much of an edge so we don't get left behind because there is a sudden change in the enemy team like an enemy AP getting a triple when you build to deal with their fed AD.\n\nAnd if anything, Locket is one of the best-designed item because it accomplishes exactly what a Support wants. Allowing its team to do their job. We need more items like Locket that focus on the role rather than items that focus on the champion.","replies":[]},{"poster":"zlumpy","date":"2016-09-10T18:27:48.980+0000","up_votes":7,"down_votes":0,"body":"Or we can leave un nerfed and just make some other options better.","replies":[]}]},{"poster":"chipndip1","date":"2016-09-10T19:53:43.824+0000","up_votes":1,"down_votes":1,"body":"How is Locket a jack of all trades and *master of none*? It's the only aoe shield in this game. It's the master of aoe shielding and keeping your team alive against ap threats. It's got a good spread of survival stats and basically THE strongest team fight active in the game. Locket's fucking broken, and Crucible isn't the farthest from it.","replies":[{"poster":"I hate my ADC","date":"2016-09-10T20:05:58.559+0000","up_votes":4,"down_votes":0,"body":"Because it's the only item that provides an AoE shield doesn't mean it's the strongest item there is.\nA Mikael is much more game changer in a team fight when used properly.\nPrioritizing who you save is much more important than trying to save everyone in a team fight. It's not the Sejuani who's going to kill the enemy team, once she engaged and used her ult, she's done her job and is now expandable. It's the Twitch job to wipe out their team and it's the support job to make sure that as many people as possible manage to do their job on their team and as many people as possible fail at their job on the other team. In this case, Twitch is the one that needs to survive in order for the enemy team to die. You are more likely to save him with a Mikael than a Locket.\n\nThat's why Locket is a jack of all trades, master of none. It's good in every situation because it provides a good increase in defense for everyone, no matter what may happen in the game. It won't become useless all of a sudden because the balance power as shifted between who is carrying and who isn't and it won't ever be as game changing as more niche items are.","replies":[]}]}]},{"poster":"Meddler","date":"2016-09-12T02:22:18.848+0000","up_votes":21,"down_votes":11,"body":"Yep. We'll probably remove Locket, or at least it's aura, in the pre-season. It's made it pretty difficult to offer supports genuine item choices because of just how mandatory an option it's been, even with the nerfed aura. \n\nA couple of things have stopped us from removing it earlier though. We talked about doing so back around 6.12, taking that much mid game MR away's potentially has some pretty big impact on the balance of entire classes though. That suggested that, unless it was an urgent change, pre-season would be a better time. The other issue was that while Locket creates some problems it does fill a valuable niche of tanky item that helps you protect your allies. As a result we didn't want to remove it without adding at least one replacement item that served that same function.","replies":[{"poster":"LadyRenly","date":"2016-09-12T02:29:58.393+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=cEc1eKf6,comment-id=001a,timestamp=2016-09-12T02:22:18.848+0000)\n>\n> Yep. We&#x27;ll probably remove Locket, or at least it&#x27;s aura, in the pre-season. It&#x27;s made it pretty difficult to offer supports genuine item choices because of just how mandatory an option it&#x27;s been, even with the nerfed aura. \n> \n> A couple of things have stopped us from removing it earlier though. We talked about doing so back around 6.12, taking that much mid game MR away&#x27;s potentially has some pretty big impact on the balance of entire classes though. That suggested that, unless it was an urgent change, pre-season would be a better time. The other issue was that while Locket creates some problems it does fill a valuable niche of tanky item that helps you protect your allies. As a result we didn&#x27;t want to remove it without adding at least one replacement item that served that same function.\n\nTo be fair, it was probably good you did not remove it. It would make the likes of Leblanc a complete nightmare","replies":[{"poster":"Meddler","date":"2016-09-12T03:03:41.490+0000","up_votes":15,"down_votes":2,"body":"Yeah, mages or AP assassins with strong mid games were the biggest concern. Also some risk it'd skew bot lane and top lane excessively towards heavy AP damage picks.","replies":[{"poster":"redfeenix","date":"2016-09-12T03:21:54.954+0000","up_votes":2,"down_votes":1,"body":"Any thoughts on :\n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/csKmIrAF-opinion-rylais-is-unhealthy-it-gives-free-slows-to-mages-who-shouldnt-have-cc\n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/ptJ6zxAH-suggestion-give-flash-to-all-playerschamps-like-recall-since-its-picked-in-95-of-the-time\n\nhttp://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/lF67pLiI-rework-idea-irelia-captain-of-the-ionian-guard","replies":[{"poster":"Meddler","date":"2016-09-12T04:03:43.284+0000","up_votes":20,"down_votes":0,"body":"Rylai's is also on the list of items we'll be changing in pre-season. At present it's too universal a choice, whereas we'd prefer extra CC be something with more of a trade off to it. Not yet sure if that'll mean lowering it's damage (more of a tanky/utility thing), lowering it's health (making it a squishy kite option) or some alternate approach (making it only work with certain spell types or something like that). \n\nWe don't want to give every champion three summoner spells, that probably just results in even more mobility (assuming Ghost/TP become the most common additions). Alternatively, even if other Summoner Spells are chosen equally we're then still pumping extra power in the Summoner Spell system at the expense of champion/item power effectively. We could make Flash mandatory and only give you one Summoner spell choice, but that just hurts those champs that sometimes don't want to take it.\n\nThere's some interesting stuff in your proposed Irelia rework, intial reaction though is that it's too large a departure from Irelia's existing gameplay though. A telekinetic blade caster could work with Irelia's theme, shifting her that hard away from a fighter playstyle's a much larger change than we try to target with reworks though.","replies":[{"poster":"Malicious Metal","date":"2016-09-12T10:18:35.967+0000","up_votes":7,"down_votes":0,"body":"While I absolutely think Rylais is in dire need of changes this statement left a really icky feeling in my gut, especially the second option about making it a squishy kiting option.\n\nThere's already a lack of mana less hp+ap options and once again nerfing Rylais' HP would really hurt those champions who always wanted it for the mix of defense and offense and NOT those who simply built it because of its huge amount of AP.\n\nRylais should, IMO be the defensive utility option (Rylai is a support after all) that should be consciously built in order to make you provide more utility to your team and allow you to become a bit more durable with its slows and health.\n\nThough the last point of making it only work on certain spells seems interesting too though it's bound to screw over some champions.\n\nIn the end any changes to rylais WILL have consequences and impact some of its users either positively or negatively, knowing this I'm anxious to see what exactly you'll be planning to do to the item and IF some champions get dumpstered by it ({{champion:82}}  ) you're going to give them the attention they need.","replies":[{"poster":"Hadriel","date":"2016-09-13T01:59:24.208+0000","up_votes":2,"down_votes":0,"body":"On the contrary, seems like Rylai's has been a problem precisely because it grants defensive stats to classes that use the slows to cover their weaknesses, rather immobile, tankier than average champs. If Syndra goes RoA Rylai's and I manage to reach her, I shouldn't feel like it's nearly impossible to kill her before she does me in. I'd rather Syndra attempt to slow me with Qs than have Vladimir, who could care less about -30 AP, make me unable to disengage from him or have a chance to kill him, or having Mordekaiser's ult permaslow me while I can't contest his presence.\n\nRylai's slowing people is manageble. Rylai's reducing the incentive for you to overcome the slows and reach the champion because of its top tier tankiness isn't.","replies":[]}]},{"poster":"LongHair Fox","date":"2016-09-12T12:27:08.568+0000","up_votes":1,"down_votes":0,"body":"On the Irelia rework: Can you specify exactly what level of changes we are expected to see? I cannot remember a rework due to mismatched theme before. Your post makes it seems like it might be around gankplank size but having that confirmed would be nice.","replies":[{"poster":"Meddler","date":"2016-09-12T21:11:30.393+0000","up_votes":5,"down_votes":0,"body":"Don't know. We don't have a planned kit, target date, or even detailed goals yet. A possible Irelia rework would still be quite a way off at this point. Would expect some form of diving fighter or skirmisher though most likely still. ","replies":[]}]}]}]}]}]},{"poster":"Mysticman89","date":"2016-09-12T02:55:26.434+0000","up_votes":3,"down_votes":0,"body":"So is the issue really locket with it's aoe shield, or is the real issue actually the component aegis and its aura? Might there be an argument for keeping aegis with it's aura, but locket but losing the aura?\n\nPerhaps make lockets active be protection from just magic damage instead of all damage? That would make it a \"Ok theres lots of magic damage, let me protect my team from that\" situational item, versus \"The enemy team does damage, I need locket to protect them from that.\" do want item.","replies":[{"poster":"Meddler","date":"2016-09-12T03:02:45.749+0000","up_votes":14,"down_votes":3,"body":"The MR aura's the big problem for us. AOE shield as an active's got both better appreciability and more balance levers. We're hoping to still keep some form of that around, though details might vary (duration, range, number of targets, shield strength, type of damage etc).","replies":[{"poster":"patmax17","date":"2016-09-12T05:41:03.902+0000","up_votes":1,"down_votes":0,"body":"Like, could it affect only you and one ally, like Zeke?  Locket could become to Mr what Zeke is for armor, if you consider Zeke to be a good support item","replies":[{"poster":"Meddler","date":"2016-09-12T05:52:07.139+0000","up_votes":5,"down_votes":1,"body":"Something along those lines is one of the options we've been discussing yeah, though a constant effect when near an ally, rather than a windowed one like Zeke's.","replies":[{"poster":"Aptest","date":"2016-09-12T07:55:16.398+0000","up_votes":8,"down_votes":0,"body":"is there any thought on inserting some game-play and/or consistency into Zeke's ? \nI would love for you to trim down the item's power, if I get some game-play with it that_ I can control _and isn't instantly ruined by the ADC eyeing the small wraiths.","replies":[]},{"poster":"BLACK REALM GOD","date":"2016-09-12T08:04:59.420+0000","up_votes":2,"down_votes":0,"body":"in other words double up on tarics E with both armor AND magic resist. sounds good to me.","replies":[]}]}]},{"poster":"Dessem","date":"2016-09-13T00:44:17.085+0000","up_votes":2,"down_votes":0,"body":"What about this, then? {{item:3060}} has the same MR aura, but I only see Locket being mentioned. Is Banner not problematic compared to Locket?","replies":[{"poster":"Keepe","date":"2016-09-13T00:51:02.060+0000","up_votes":5,"down_votes":0,"body":"Touch my Donger's Banner and I will feed you to Mundo.","replies":[]}]},{"poster":"Keevalroy","date":"2016-09-12T03:17:30.202+0000","up_votes":4,"down_votes":0,"body":"My issue with this is, as someone who loved season 2 and 3 where support junglers were a thing, and became a jungle playstyle I gravitated toward and carried up until I quit League before the mage update, this would mean that the aura item the few of us left compulsively buy, is gone.  We like building this item because it allows us to be the second roaming support, and use the extra defense aura while ganking to help protect our laners. in addition to that, the real support is free to buy another item and isn't forced into that build. \n\n\n\nI understand the support concern, but support_ junglers_ are affected as well.","replies":[{"poster":"Meddler","date":"2016-09-12T04:04:44.710+0000","up_votes":4,"down_votes":1,"body":"I can understand that concern. I think there are at least moderate odds one of the support items we're testing feels like a reasonable option on some supportive junglers at least.","replies":[]}]},{"poster":"DarkRitual","date":"2016-09-12T11:16:28.094+0000","up_votes":1,"down_votes":0,"body":"Why not put the MR aura ONTO the active?","replies":[{"poster":"DeathBurst","date":"2016-09-12T17:16:30.902+0000","up_votes":1,"down_votes":0,"body":"Because the actual strength of ~~an Aura~~ a *passive stat is hard to appreciate, not satisfying and often underestimated.\n\nEDIT:\n*. Speaking about Aura here made no sense, sorry for the mistake. See my reply to DarkRitual below for more context.","replies":[{"poster":"DarkRitual","date":"2016-09-12T20:05:41.600+0000","up_votes":1,"down_votes":0,"body":"The difference is the AoE active already on the item is VERY easy to appreciate. Putting the MR boost on top of it would not affect the already appreiable active ability.\n\nAoE's on other actives still are fine. {{item:3069}} {{item:3143}} {{item:3800}}\nPart of the reason is there is a notification (audible of visual) of the effect, which makes it easy to notice, and appreciate.","replies":[{"poster":"DeathBurst","date":"2016-09-13T07:01:19.731+0000","up_votes":2,"down_votes":0,"body":"Arf, my bad, I made a typo and that changed the whole meaning of my post.\n\nI meant \"Because the actual strength of an **passive stat**\", not of an Aura/AoE. All your other examples are actually MS (de)buffs, so it's easy to see and \"feel\" the power of running faster/slower. Shields are easy too: is my remaining HP bar smaller than the shield I received? Well, then the shield saved me.\n\nOn the other hand, 15 MR is hard to appreciate. If at the end of a fight you're still alive, can you tell if those 15 MR changed something or not? Personally, I can't, I just *know* from external knowledge that this Aura is extremely strong, I don't *feel* it in-game.","replies":[]}]}]}]}]}]},{"poster":"Merxamers","date":"2016-09-12T13:17:56.610+0000","up_votes":5,"down_votes":8,"body":"I don't like how the typical Riot answer to this sort of thing is to make the game less exciting. Locket is built a lot? Instead of giving supports other items and options, you just plan to remove it?! There are few tank-support items as it is. If i'm playing as Leona, what am i supposed to build against MR if Aegis and Locket are removed?","replies":[{"poster":"Meddler","date":"2016-09-12T21:13:35.193+0000","up_votes":11,"down_votes":1,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=cEc1eKf6,comment-id=001a,timestamp=2016-09-12T02:22:18.848+0000)\n>\n> As a result we didn&#x27;t want to remove it without adding at least one replacement item that served that same function.","replies":[{"poster":"SaltyKracka","date":"2016-09-12T21:19:52.717+0000","up_votes":4,"down_votes":0,"body":"I remember Xypherous talking about the main problem with removing Locket is that it's just about all that prevents pure magic damage comp's from running over everything.\n\nSo are you guys going to be giving every champ in the game more MR, or are we finally going to get a third big ticket MR item that hasn't been nerfed to shit and forgotten? (Looking at you, Banshee's)","replies":[]}]}]},{"poster":"IcyPepper","date":"2016-09-12T21:15:49.863+0000","up_votes":4,"down_votes":1,"body":">It's made it pretty difficult to offer supports genuine item choices because of just how mandatory an option it's been\n\nI'd say {{item:2049}} is even worse than Locket in that regard...","replies":[{"poster":"SonicÐeHedgedawg","date":"2016-09-12T23:15:40.366+0000","up_votes":2,"down_votes":2,"body":"Except sightstone gives 6 options (eye of the **** upgrades and all 3 ruby sightstone + active gold generation item upgrades).  Locket isn't SUPPOSED to be core on pretty much every support... Leona, Braum, Alistar, Nautilus, Taric, sure, but when it's core on even enchanter type supports when the other team isn't a heavy AP comp, then that's an issue","replies":[{"poster":"Xonra","date":"2016-09-13T00:45:09.070+0000","up_votes":3,"down_votes":1,"body":"Except realistically there are only 3 and a half. You rarely will get ruby on supports (junglers yes), and you won't get at least 2 of the 3 tier 3 options for support items. You at BEST CASE will get {{item:3069}} but {{item:2303}} {{item:2302}} {{item:2301}} are just the best options as of right now. \n\nIt's far from 6 realistically. They are there sure, but it is like saying {{item:3056}} is an option, when we both know no one is buying this outside of trolling around with friends in normals.","replies":[]}]}]},{"poster":"LankPants","date":"2016-09-12T15:36:04.652+0000","up_votes":2,"down_votes":0,"body":"Should we expect some more interesting MR items for tanks if this goes through? Currently if you're a tank not named Mundo or Zac MR itemisation feels super wasteful since Banshee's Veil is just subpar and most tanks don't get that much from Spirit Visage.","replies":[]},{"poster":"WarlockLaw","date":"2016-09-12T07:55:31.125+0000","up_votes":2,"down_votes":0,"body":"I think the issue is more in that, supports can't go into a 'squishy ap' build. Any good AP item is too expensive for supports or gets abused in the mid lane if it isn't too niche. This reduces the good options down causing locket and mikaels to be the support items on practically every support. \n\nI wonder if it'd be possible to pursue a similar solution that was taken with jungle items, and have a support item tree (the gold generation items) be somehow locked out to champions unless the make a certain pregame choice, which could either be a summoner spell or new keystone. As long as the choice takes away something meaningful this could stop the potential abuse from other positions on what could be a really good item.","replies":[]}]},{"poster":"Sherogarth","date":"2016-09-10T20:00:21.950+0000","up_votes":13,"down_votes":0,"body":"Let {{item:3105}} buid into this:\nhttp://vignette2.wikia.nocookie.net/leagueoflegends/images/c/cd/Runic_Bulwark_item.png/revision/latest?cb=20130710101716\nonce again and u will see pure definition of \"crowding out other items\".\n\nSweet mother of tanky stats:\n> +300 health\n> +20 armor\n> +30 magic resistance\n> Unique - Legion: Nearby allies gain +10 armor, +25 magic resist and +10 health regen. \n> Nearby minions gain an additional 50% armor, magic resist and health regen.\n\nAdd old {{champion:44}}'s armor aura, armor shred from w, ult and {{item:3110}}... u were just resonating with pure awsomness \n(5-7k gold for everyone around you in stats).\n\nI miss it sometimes :(.","replies":[{"poster":"AlienPrimate","date":"2016-09-10T21:36:37.300+0000","up_votes":7,"down_votes":0,"body":"The value of Taric's ult at level 16 was 12k gold.  That was just his ult, not his other aura's from items and w.  People also forget that Taric's ult made minions stronger too.  Use ult at level 6 and suddenly you have 6 adc's hitting you if you were unlucky enough to take minion aggro as an enemy during his ult.","replies":[{"poster":"resumed","date":"2016-09-10T21:40:06.079+0000","up_votes":8,"down_votes":2,"body":"i loved old tarics ult. it made everyone sparkly\n\ni still like old taric more than new taric","replies":[]}]}]},{"poster":"Sylvant","date":"2016-09-10T18:12:14.499+0000","up_votes":4,"down_votes":3,"body":"tank supports are getting less utility because they are tanks. They have the ability to tank, while the AP supports are more focused on utility. I didnt actually understand the idea of the topic, are you complaining Locket is too strong? Tanks supports are more like 1/3 of the overall support pool, you cant expect to have too wide item option for them alone. Its rather normal that AP supports go {{item:3098}} , utility ones take {{item:3096}}  and tanks {{item:3302}} , you cant expect them to have too much options.","replies":[{"poster":"resumed","date":"2016-09-10T18:28:21.887+0000","up_votes":10,"down_votes":2,"body":"i really don't understand what you're trying to say with that post\n\ntanks arent supposed to have utility?? {{champion:98}} {{champion:57}} {{champion:14}} ???\n\nsupport tanks are a viable substitute for a frontline???? because theyre not. tank supports are actually pretty squishy and while nonsupport tanks can jump right into buying sunfire cape, tank supports wont get any tank items until the enemy adc has a ton of armor pen. they also need tank steroids in their kit to not die immediately in a fight. eg {{champion:89}}'s w, {{champion:223}}'s two health bars, {{champion:12}}'s ult.\n\nalso if tankiness was a tanks most valuable asset then alistar would be pick/ban, rather than being outclassed by every other tank support\n\nalso i just want more support items. i literally said we cant nerf locket.","replies":[]},{"poster":"Immortal spax","date":"2016-09-10T18:22:09.078+0000","up_votes":6,"down_votes":2,"body":"Did you read the thread or are you just talking random?\n\nHe clearly said that supp tank itemezation is poor, that means that after the 2 cores items, every support just go straight to solo lane tank items, but they are expensive, meanwhile utility support have 4 cheap choiches.\n\nThen he gave some idea to some possible supp tank items.","replies":[]}]},{"poster":"UnderscorBunnies","date":"2016-09-10T20:29:33.642+0000","up_votes":6,"down_votes":0,"body":"Pretty sure Aegis items will always crowd out other support items.","replies":[]},{"poster":"CaptainMårvelous","date":"2016-09-11T00:42:34.800+0000","up_votes":4,"down_votes":2,"body":"I'm sorry but where have you been?\n\nThis has been a problem since Season 1. The item is so good, so stat efficient and so useful that someone is always required to get it in a serious game. Sure, it's alternated between support and jungler but it's just too good.\n\nRiot should honestly just remove it. It's been almost seven seasons with no end in sight of this item's dominance. We tried runic bulwark, we tried banner of command, we tried nerfing and buffing it up and down.","replies":[{"poster":"Fırewall","date":"2016-09-11T01:44:15.102+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=CaptainMårvelous,realm=NA,application-id=3ErqAdtq,discussion-id=cEc1eKf6,comment-id=000f,timestamp=2016-09-11T00:42:34.800+0000)\n>\n> I&#x27;m sorry but where have you been?\n> \n> This has been a problem since Season 1. The item is so good, so stat efficient and so useful that someone is always required to get it in a serious game. Sure, it&#x27;s alternated between support and jungler but it&#x27;s just too good.\n> \n> Riot should honestly just remove it. It&#x27;s been almost seven seasons with no end in sight of this item&#x27;s dominance. We tried runic bulwark, we tried banner of command, we tried nerfing and buffing it up and down.\n\nBrilliant solution. Then what asnwer do we have to AP and high residual dmg comps?\nThe problem is LACK, here... I'll bold it. **LACK** of further itemization. The daily life of a support consists in rushing the same items over and over again. The most variation I get is \"hmmm, do I need {{item:3110}}  or {{item:3800}} ?\"\n\nThere is just a small core of  items that does the job of supporting terrifying well(in comparison to the rest of the items), and nothing else comes even close.","replies":[]}]}]}