{"poster":"bryan10690","date":"2016-02-25T21:01:04.820+0000","title":"porque ese nerf a pantheon de 6.5 :c","subforum":"Charlas Generales","up_votes":0,"down_votes":5,"body":"porqueeeeeeeeeeeee :CCCCCCC \r\n{{summoner:4}}","replies":[{"poster":"erwinchelo","date":"2016-02-25T21:03:10.228+0000","up_votes":2,"down_votes":0,"body":"que nerf?? fuente?\n\n\nEdit. asi mmmm bastante feo, mas a su escalado, al menos debieran buffearle el daño a monstruos","replies":[]},{"poster":"Torture Dance","date":"2016-02-25T21:14:27.286+0000","up_votes":1,"down_votes":5,"body":"Porque Riot solo quiere determinados champion en su meta, y cuando uno alcanza lo mínimo aceptable (por ejemplo Trundle, que de muchísimo tiempo sin ser nada, se volvió a jugar, y lo nerfearon para que volviera al olvido), le cae un nerfeo injustificable, Pantheon no esta en el meta desde hace mucho tiempo, ni lo veo demasiado bueno en el meta actual, no se si alguien hizo una build que lo deja \"OP\" o algo, pero Pantheon sigue siendo el mismo champ inútil de siempre, que no tiene ni el mas mínimo late, es super fácil de sacar de encima, ademas de que por otro lado, es totalmente aburrido y simple. Simplemente Riot no lo quiere en el meta.","replies":[{"poster":"Franja","date":"2016-02-25T22:01:42.289+0000","up_votes":3,"down_votes":0,"body":"\"Campeon inutil\" jajaja\n\nEs el segundo toplaner con mas winrate del juego xD","replies":[]},{"poster":"Whitesse","date":"2016-02-25T22:20:37.792+0000","up_votes":2,"down_votes":0,"body":"Tu comentario esta completamente errado.\nRiot no determina el meta, lo determina los jugadores. \n\nPhanteon con el item nuevo de asesino en Mid one shoteaba y se usa para hacerle counter a Lux, Zed, Anivia, LeBlanc, etc. Para hacerle counter a todos los Mid actuales. Facil roaming con su ultimate y el late de phanteon se basa en matar al ADC y su forma de entrar es con la Ultimate que a ultimo nivel hace 1.000 de Daño magico.\n\nTrundle no se usaba por su facil quiteo en top, Riot lo buffeo durante varios parches seguidos y se veia en top pero en donde mas se jugó y se abusó de el fue de Soporte y el nerf fue igual a como estaba antes su Ultimate. Le subieron el CD a la E y le bajaron la ralentización. Su Q ya no afecta a torres. Pero Trundle es un pick 100% fiable contra toplaners AD, es como todos los campeones, si no se juega es porque la gente no quiere, no porque Riot no quiere.","replies":[]}]},{"poster":"Dog Bulling","date":"2016-03-07T18:24:26.831+0000","up_votes":1,"down_votes":0,"body":"Porque tiene un winrate del 54% en top debido a su pokeo con su q, stun asegurado que tambien es un salto, exelentes dives con su pasiva, utilidad de su ultimate par romper formación y su extremadamente alto daño de la e (360% DEL DAÑO FÍSICO ADICIONAL).\n\nSi no me creen miren la descripción de la e, que encima asegura muertes con los críticos. Un buen maestro de este campeon puede reventar las partidas, aunque contra tanques como nautilus y malphite (reyes del top en estos momentos) no es muy bueno.\n\nEso sí, el nerfeo que le dieron tambien afecta su no muy buen desempeño en la jungla (49%) ya que no farmeará rápido aún con el guerrero y que consume mucho mana, aun con el talisman. Deberían hacer que almenos la q haga más daño a monstruos.\n\nAparte RITO quiere tanques en top, no semi-asesinos (termino intermedio entre luchador y asesino, de aguante decente y que pega mucho, pero no deletea a cualquiera de un combo) como jayce, riven, gangplank o pantheon. Si no es así ¿porque romperian la capa de fuego?","replies":[]},{"poster":"KG Spriggan","date":"2016-03-02T19:33:05.591+0000","up_votes":1,"down_votes":0,"body":"CUANDO VIENE LA NUEVA VERSION ?","replies":[]},{"poster":"Emperor Antares","date":"2016-02-28T06:18:17.407+0000","up_votes":1,"down_votes":0,"body":"Nah... primero le bajan el rango de la Ultimate... Nerfeaso!! Y ahora le bajan la E???? Yo siempre pensaba en que le darían un buff de 1% Reducción de Armadura por cada golpe con su E y sale Nerf... Es mi main encima... Andá a subir a ORO ahora que hay gente que no le interesa las Rankeds y te bajan de promoción...\n{{sticker:slayer-pantheon-rainbows}}","replies":[]},{"poster":"Pennywise Clone","date":"2016-02-25T22:50:50.526+0000","up_votes":1,"down_votes":0,"body":"porque su E ponia cargas de la cuchilla negra y llegaba a sacarte 1000 de vida si no llevabas armadura","replies":[]},{"poster":"Efezto","date":"2016-02-25T22:13:53.461+0000","up_votes":1,"down_votes":0,"body":"No se cuales nerfs, si son en el servidor de prueba, no cuentan, porque es, justamente, de prueba.\n\nPant igual es un campeon MUY opresivo. Ciertamente necesita cambios (en su modo/estilo de juego).","replies":[]},{"poster":"Lin Kuei","date":"2016-02-25T21:19:55.922+0000","up_votes":1,"down_votes":0,"body":"Que le hicieron al panadero? Ya me amargue el dia...","replies":[]},{"poster":"Excorpion","date":"2016-02-25T21:05:38.386+0000","up_votes":1,"down_votes":0,"body":"de que hablas ?","replies":[]},{"poster":"Fiky","date":"2016-02-25T21:04:38.595+0000","up_votes":1,"down_votes":0,"body":"es en el PBE, puede que no pero de todas maneras necesita un pequeño rework no estos cambios","replies":[]}]}