{"poster":"XadrasWrath","date":"2016-01-30T17:08:49.038+0000","title":"Storia di un Gold qualsiasi, pareri e opinioni sono ben accetti! ( Non è un \" salty post \"! )","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Season 5, fine Agosto. Finalmente riesco a raggiungere il mio tanto sudato &quot; Gold elo &quot; . \r\n\r\n&quot; In verit&agrave; pensavo fosse pi&ugrave; difficile, ero anche riuscito ad andare in promo per gold IV. Persa. Vabbe, succede.  &quot;\r\n\r\n&quot; Season 6, bella la nuova champ select. Riesco sempre ad andare dove voglio e nessuno flamma, gg riot ! &quot;\r\n\r\nEcco il punto. Faccio le dieci di piazzamento, vinco 9 su 10, silver 2. Non mi stupisco perch&egrave; avevo letto in giro e sul forum che a tutti capitava \r\ndi finire leggermente pi&ugrave; in basso a causa del reset all&#039;mmr etc. etc. etc.  \r\nTra me e me penso, &quot; vabbe se la mia media resta 9 a 1  riuscir&ograve; a salire senza problemi &quot; . \r\nOvviamente &egrave; successo l&#039;opposto, non so perch&egrave; ma sono retroscesso a silver III con pochi punti. Non vinco pi&ugrave; eppure faccio sempre le stesse cose, stessi champ di sempre cosa sta succedendo? ho provato a darmi due spiegazioni e vorrei sentire la vostra opinione ! ( non &egrave; un post &quot; salty &quot; xD veramente sono qui per _condividere esperienze &quot; \r\n_\r\n\r\n1 - Dopo, le mie place dato l&#039;elevato numero di vittorie il mio mmr &egrave; salito cosi in tanto che ora per bilanciare finisco in squadre con altri m8 che hanno un mmr mooolto pi&ugrave; basso e quindi dovrei carriare di pi&ugrave; ? ( per&ograve; dopo tutte queste sconfitte che sto facendo non dovrebbe essersi ormai bilanciato? )\r\n\r\n2 - Essendo che gioco champ che non sono in &quot; metissima &quot; come la season scorsa ( cho gath, Garen ) anche la mia &quot; abilit&agrave; da carry &quot; &egrave; diminuita? ( Per&ograve; anche qui ho da obiettare, se cosi fosse, sarebbe stato cosi dalle placemante no ? ) \r\n\r\n3 - Forse mi sto solo facendo un&#039; enorme sega mentale? ( I numeri per&ograve; parlano chiaro placemante 9W - 1L dopo la statistica &egrave; diventata 16W - 20L ) \r\n\r\n Bene ribadendo che NON &egrave; un post &quot; SALTY &quot; o &quot; RIOT PLS NERF ZED &quot; ( &egrave; sempre zed che vince da solo le partite contro me D: splitpushedimmerda xD )  Vorrei sapere le vostre opinioni al riguardo o magari le vostre esperienze e se ne avete avute di simili! . Vado a prendere un caffe e un biscotto nell&#039;attesa! {{item:2052}} {{item:2031}} {{champion:31}}","replies":[{"poster":"XadrasWrath","date":"2016-01-30T17:32:21.698+0000","up_votes":1,"down_votes":0,"body":"Sisi figurati mi trovi pienamente daccordo con te sul lungo periodo si vede il tuo valore ( tipo 500/600 ranked la scorsa season ! ) \nGrazie mille del tuo commento ! ^^","replies":[]},{"poster":"XadrasWrath","date":"2016-01-30T17:23:25.687+0000","up_votes":1,"down_votes":0,"body":"Figurati ribadisco che non era un post \" salty \" era per avere qualche punto di vista esterno. Il gold sono convintissimo che lo meritavo me lo sono guadagnato e sudato. Nessuno potrà togliermelo  ( anche se mi trovi daccordo con te che era assurdo che gente facevano il gold dopo solo le place e se lo tenevano fino a fine season ma, non è il mio caso btw )  Però ribadisco una cosa si vabene le place non contano ma se io faccio cagare, faccio cagare da subito non dopo10 game, o sbaglio ? considerando che nelle place ho giocato anche con persone di elo più alto( sai dopo le prime 3 vittorie consecutive giocavo con ex platini )  rispetto a quelle con le quali sto giocando ora o mi sfugge qualcosa ?","replies":[{"poster":"Nibbio Bianco","date":"2016-01-30T17:29:43.416+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XadrasWrath,realm=EUW,application-id=MJVj50Jw,discussion-id=wuzL6ivV,comment-id=0001,timestamp=2016-01-30T17:23:25.687+0000)\n>\n> Figurati ribadisco che non era un post \" salty \" era per avere qualche punto di vista esterno. Il gold sono convintissimo che lo meritavo me lo sono guadagnato e sudato. Nessuno potrà togliermelo  ( anche se mi trovi daccordo con te che era assurdo che gente facevano il gold dopo solo le place e se lo tenevano fino a fine season ma, non è il mio caso btw )  Però ribadisco una cosa si vabene le place non contano ma se io faccio cagare, faccio cagare da subito non dopo10 game, o sbaglio ? considerando che nelle place ho giocato anche con persone di elo più alto( sai dopo le prime 3 vittorie consecutive giocavo con ex platini )  rispetto a quelle con le quali sto giocando ora o mi sfugge qualcosa ?\n\nSi sale nel lungo periodo. Puoi aver giocato bene 10 partite di fila, ma 10 è un numero irrisorio. Sulle 100 già si inizia capire come stanno andando le cose. In ogni caso, ripeto, se ora anche i platini stanno in silver, significa che gli attuali gold che troverai saranno platini... o torneranno in platino ( difficile, visto che si scontreranno contro altri platini già in gold ), oppure devi migliorare  e giocare come un platino per meritarti l'attuale gold. Giocando ranked ora le cose andranno sempre peggio, quindi il mio consiglio è... o giochi per migliorarti e te ne freghi di vittorie e sconfitte, oppure non fai ranked per un bel pò e aspetti che almeno una parte di platino che si meritava quel rank sia arrivato lì.","replies":[]}]},{"poster":"Nibbio Bianco","date":"2016-01-30T17:17:15.018+0000","up_votes":1,"down_votes":0,"body":"Il livello di League of Legends si era abbassato molto, dopo le placements la gente veniva piazzata anche direttamente in gold molto facilmente nella vecchia season... la riot ha abbassato tutti di rank anche per equilibrare di più le cose. Evidentemente potresti essere una di queste persone che la scorsa season non meritavano il gold, ora che le cose sono diventate più difficili per tutti. Sicuramente ci saranno meno gold dello scorso anno, se pensi di meritartelo continua a giocare e lo raggiungerai. Le placement contano poco, è quello che fai dopo che ti garantiscono un rank alto o basso. \n\nIo gioco Urgot, gioca quel che ti pare, quindi. Non è tanto quello il problema. \n\nNon pensare a come stai andando e a come ti sei classificato, puoi ancora migliorare. Devi pensare solo a quello. ","replies":[]}]}