{"poster":"JnB","date":"2016-02-01T18:31:21.834+0000","title":"Para los que piden report","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":0,"body":"Bueno, este post se trata de todos aquellos que piden report en All. Hay muchos trolls y ragers que lo hacen para molestar, pero hablo de quienes consideran que hacen lo correcto.\r\nMi opini&oacute;n, muy personal, es que considero esto una actitud toxica. &iquest;Por qu&eacute;? Simple, al pedir en el chat de All el report lo &uacute;nico que generas es malestar en la mayor&iacute;a de los casos, muchas veces terminan insult&aacute;ndote del otro team por &quot;pesado&quot; (quien sabr&aacute; por que?) . Lo mejor para mi es reportar callado, sin sugerirle a nadie que debe hacer lo mismo ya que cada uno es conciente de sus decisiones y actos.\r\nSi en tu team hay un afk o un troll, el otro equipo va a notarlo y probablemente al finalizar la partida se lleve un par de reports ademas del tuyo y de tus compa&ntilde;eros. Si es un flammer, con que los de tu equipo los reporten alcanza para que termine siendo baneado, yo personalmente considero que el sistema en cuanto a los flammers si funciona a diferencia de los afk y trolls. En cambio si lo que ves es un jugador sin habilidad te recomiendo leer este post que hice hace un tiempo, y los comentarios que dejaron algunos:\r\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/xJ7k8Eik-cuando-te-toca-un-jugador-sin-habilidad\r\n\r\nYo solia escribir &quot;report x por flammer pls&quot; pero evaluando mejor la situacion me di cuenta que es mejor evitar este pedido, espero sus opiniones y gracias por leer! {{summoner:21}}","replies":[{"poster":"Clausz","date":"2016-02-01T19:01:23.914+0000","up_votes":2,"down_votes":0,"body":"has cambiado mi forma de pensar.{{summoner:6}} {{summoner:21}} {{summoner:13}} {{summoner:1}}","replies":[{"poster":"JnB","date":"2016-02-01T20:31:56.626+0000","up_votes":1,"down_votes":0,"body":"La razon de este post esta cumplida entonces :)","replies":[{"poster":"Clausz","date":"2016-02-02T21:09:50.270+0000","up_votes":1,"down_votes":0,"body":":)","replies":[]}]}]},{"poster":"ToMac4","date":"2016-02-01T23:19:48.672+0000","up_votes":1,"down_votes":0,"body":"lo que pasa amigo, es que le dan mal uso a los reports por ejemplo la razón mas usual de todos \"report por que jugo mal y fedio\" sin haber una intención mas allá de que jugo mal... y esa misma gente luego se queja de que los reports tienen poco valor.","replies":[{"poster":"JnB","date":"2016-02-02T00:54:36.874+0000","up_votes":1,"down_votes":0,"body":"Es lo que plantee en post anteriores, la gente es bastante hipocrita!","replies":[]}]},{"poster":"xXLawea777xx","date":"2016-02-01T18:55:57.187+0000","up_votes":1,"down_votes":0,"body":"pedir report en /all es como pedir que arreglen el server, no sirve para nada","replies":[{"poster":"JnB","date":"2016-02-01T20:32:17.229+0000","up_votes":1,"down_votes":0,"body":"Vamos hombre, no sea resentido","replies":[]}]},{"poster":"MzaArg","date":"2016-02-01T19:23:16.139+0000","up_votes":1,"down_votes":0,"body":"Yo he notado que el team rival se pasa por la raya si en tu team hay un troll o afk. Es más, por dentro lo deben disfrutar porque saben que tienen grandes chances de ganar la partida. \nEso si, cuando les toca un troll o afk en su team, ahí se acuerdan de reportar y pedir report.","replies":[{"poster":"JnB","date":"2016-02-01T20:31:12.646+0000","up_votes":1,"down_votes":0,"body":"Hay de todo, depende contra quien te toque, muchas veces se consiguen amigos en el otro team.","replies":[]}]},{"poster":"ghost134","date":"2016-02-01T18:48:31.984+0000","up_votes":1,"down_votes":0,"body":"Te borraron el post? jajaaj","replies":[{"poster":"JnB","date":"2016-02-01T18:49:45.580+0000","up_votes":1,"down_votes":0,"body":"Lo puse en charlas generales sin darme cuenta y me dijeron que debia ir en Comportamiento del jugador asi que lo cambie, por suerte tiene bastantes visitas ya jaja","replies":[]}]}]}