{"poster":"master123","date":"2015-11-25T01:24:11.298+0000","title":"nerf illaoi pls","subforum":"Charlas Generales","up_votes":6,"down_votes":14,"body":"quien esta deacuerdo por el nerf de illaoi loco pega demaciado deverdad nerf pls {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Franss","date":"2015-11-30T03:44:29.183+0000","up_votes":3,"down_votes":0,"body":"Em bueno por donde empezar cooldown bajos mecánicas simples  costo de mana bajo. Realmente necesita un retoque, No se asombren si un campeón en salida esta\" roto\" ,  sinceramente me ha cansado un poco league of legends en el sentido de que siempre pero siempre hacen lo mismo lanzan un campeón muy fuerte (aveces exagerado) para que se prendan a comprarlo. Es muy molesto tener que esperar 1 mes para que que se dignen a balancearlo.  Esto es obviamente predecible tantos en pruebas previas tanto como en el pbe , como para ya cuando salgan en el publico no surjan estas cosas de que se quejan millones de usuarios por la comunidad,  y unas unatas de partidas te disgustas por tener partidas un tanto desequilibradas. el trabajo con kindred no me puedo quejar siempre estubo a nivel del resto sin nada abusivo,.\n \nMI SINCERO pensamiento, creo que estaría bueno aumentar cd  y poner limites a la cantidad de tentáculos que se pueden poner tipo zyra con sus plantas estaría muy bueno que pudiese poner un limite  y  con cd alto para  colocar uno nuevo.\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"cirijolex","date":"2015-11-26T19:19:18.912+0000","up_votes":3,"down_votes":1,"body":"Ni los soldados de azir, ni las plantas de zyra, ni las torres de heimer, nada... nada en league of leguends tiene la mecanica de los tentaculos de illaoi, no puede ser que algo te pegue desde tu misma torre y esta no lo ataque. En mi opinion eso necesita nerfeo. \n\nComo segunda cosa sus costes de maná también los encuentro un poquito bajos... comparemosla con sion o cualquier otro coloso de top lane por ejemplo.\n\nComo tercera cosa su desplazamiento también es superior a lo que supone un coloso de top lane, pues aunque sea mínimo su W es un gap closer.\n\nEl heal de su Q no está capado a límite de campeones como por ejemplo Darius, y considerando que ha logrado acertar su E en team fight hay 6 objetivos para repartir tentaculasos (tentaculasos jajaj), recordemos además que el ultimate baja el cooldown de su Q.\n\nRespecto de su E considero que debería o tener más cooldown o bien mayor costo de maná, para que así illaoi tenga alguna clase de riesgo o compensación por acertar/fallar su habilidad. El zoneo que proporciona es DEMASIADO bueno versus el riesgo/coste de maná por fallarlo y su cooldown (20 a 12 seg) es muy bajo comparado por ejemplo a la E de Darius (24 a 12 seg). \nOcurre que en fase de linea está muy fuerte ésta habilidad, puesto que independientemente del daño ZONEARÁS si o si a tu oponente del farmeo.\n\nDe todas estas cosas la que más me molesta son sus costes de maná y cooldown de su E que le otorga una relación de costo/recompensa muy desiquilibrado según mi opinión.\n\nPara finalizar me gustaría comparar a la rápida sus números con Darius, un coloso roto según muchos:\n\nDaño base y mana base de niveles 1 a 18:\nIllaoi  60-145  , 300-980\nDarius 56-141 , 263-901\n\nHabilidad similar de harras en línea Q:\n\nIllaoi: costo maná 40/45/50/55/60\nCool down: 10/9/8/7/6\nRango: 800, mismo daño siempre\n\nDarius: costo maná 30/35/40/45/50\nCool down: 9/8/7/6/5\nRango: 425, daño óptimo al extremo del área.\n\nHabilidad E:\n\nIllaoi: rango 900 \nCoste de mana: 35/45/55/65/75\nCool down: 20/18/16/14/12\n\nDarius: rango 550\nCoste de maná: 45 en todos los nivelea\nCool down: 24/21/18/15/12","replies":[{"poster":"Esti","date":"2015-12-13T16:08:39.171+0000","up_votes":1,"down_votes":0,"body":"si la pasiva de darius hace que a éste le pegue la torre, Illaoi debería recibir el target de la torre cuando ataca con tentaculos","replies":[{"poster":"PARASITADO","date":"2015-12-29T22:53:19.445+0000","up_votes":1,"down_votes":0,"body":"eso sería desbalanceado total vs ella. illaoi me tira la e a mitad de linea y yo corro a la torre te parece?\n","replies":[{"poster":"Esti","date":"2016-01-02T01:10:39.284+0000","up_votes":2,"down_votes":0,"body":"Sabias que para que la torre te pegue ambos campeones deben estar en su rango? si tu le pegas al champ bajo su torre y tu no lo estas. no te pega. pero si tu estas bajo torre enemiga y el champ enemigo esta fuera de rango. le puedes atacar y no recibir daño de la torre.","replies":[]}]}]}]},{"poster":"Grafeno","date":"2015-11-29T04:08:35.415+0000","up_votes":2,"down_votes":0,"body":"y la gente pone que no....como  se nota que todos la están usando porque es un champ re izi que esta rotisimo..... buena comunidad buena, tirarse a lo roto y a lo izi buenaaaaaaaaaaa","replies":[]},{"poster":"Necrobastard","date":"2015-11-26T01:57:28.918+0000","up_votes":2,"down_votes":0,"body":"Nerfeen a esa mierda de campeón, necesita un retoque urgente. Es exagerado que en 5 vs 1 mate a 3 siendo supp. Es una burla. ¿ Juego balanceado? Claro riot.","replies":[]},{"poster":"Mailo Rorschach","date":"2015-12-28T02:34:11.591+0000","up_votes":1,"down_votes":0,"body":"Yo creo que más que nerfear, aunque suene absurdo, necesita un rework. No creo que esté fuerte, creo que el campeón no quedó bien. O sea, tiene una habilidad que es un tiro de habildad con una animación muy rápida y con bastante caja de impacto, que te saca el alma. Si te quedas te baja rápidamente la vida. Si te alejas, te aparece esa maldición en donde tienes que esperar matar 3 tentáculos para poder seguir jugando. Y cuando te la sacas por fin, llegas de nuevo a farmear, e Illaoi te mete la habilidad de nuevo. El campeón no tiene movilidad, ni cc determinante como otros, pero compensar esas carencias con ese excesivo daño, me parece que es un error. Además ni siquiera tienes que buildeártela como tanque, la armas muy ofensiva y sigue resistiendo como si tuviera 6000 de vida. Yo creo que se transformará en un ban permanente.\nSaludos.","replies":[]},{"poster":"pepooon","date":"2015-12-14T22:59:52.681+0000","up_votes":1,"down_votes":0,"body":"esta rotisima lo pega su ulti es asombroso dfihfash","replies":[]},{"poster":"Kyousuke","date":"2015-11-25T01:36:52.706+0000","up_votes":1,"down_votes":1,"body":"es un jodido tanque .-. la única manera de que te pegue es siendo un {{champion:31}}  sin botas \ncualquier pj con movilidad la humilla","replies":[{"poster":"Glaserus","date":"2015-12-13T15:53:18.203+0000","up_votes":1,"down_votes":0,"body":"Tu viste que, cuando te tira ulti a nivel 6 te baja 1200 solo con R+W+Q y ese daño lo hace en 2 seg","replies":[{"poster":"Kyousuke","date":"2015-12-13T18:00:15.545+0000","up_votes":1,"down_votes":0,"body":"este comentario fue antes de ver el desastre que hace {{champion:420}}  así que esa ya no es mi opinión, actualmente pienso que necesita un GRAN nerf","replies":[]},{"poster":"Esti","date":"2015-12-13T16:00:47.528+0000","up_votes":1,"down_votes":0,"body":"pos. te alejas","replies":[]}]}]},{"poster":"Runth","date":"2015-11-29T04:11:29.735+0000","up_votes":2,"down_votes":3,"body":"solo elige un champ con movilidad y sus tentaculos no caera ninguno a ti, solo evade su E \n\n{{sticker:slayer-jinx-unamused}} \n\nMi opinion, deberia buffear","replies":[{"poster":"Nockepo","date":"2015-12-07T02:21:39.542+0000","up_votes":1,"down_votes":0,"body":"En lo personal tu opinión revela tu falta de visión, y cito a Lee Sin, ¿Te das cuenta que hay pocos personajes que tengan movilidad en mid o en top line? Personajes como Lee Sin y Fizz en top y mid respectivamente serian los únicos que tendrían oportunidad contra ella (Si es que les alcanza el daño porque Illaoi es bastante resistente) Y piensa... \"Sólo dos personajes para que puedan hacer algo contra una tipa que pega como Garen y aguanta como Shen\" ¡Dos personajes! Osea inabilitemos a todos los personajes con baja movilidad porque aunque Zed y Yasuo también la tengan (Y estén rotísimos) la probabilidad de que te llegue el tentáculo es el mismo ¿Por qué? Porque Zed al usar energía no puede estar usando su sombra para evadir costantemente la sombra tiene un gasto y cold down muy elevado. Yasuo no puede elegir hacia donde va, osea que seguir la línea de minions que está en frente de Illaoi significaría tener que lanzar el tentáculo en medio y Yasuo se comería el ataque de todas maneras. Ahora bien, hablemos de mi personaje favorito, Twisted Fate. Twisted tiene muchas desventajas, falta de daño en early, altos costos de maná, movilidad casi nula (Porque el personaje de por sí es muy lento y su ulti no cuenta en éste ambito) Además de tener un combo que no deletea a nadie aunque éste fedeado porque siempre lo dejará en 100 o 200 de vida además de tener la desventaja que su ataque fuerte (Osea la W, donde revuelve cartas en la mano) tiene poco rango en comparación a Lux, Ahri, Syndra, Vel' Koz, etc. Esto mismo hace que lanzar una amarilla te deje en una posición vulnerable a una outplay de cualquier otro personaje. No aguanta, no mete daño y si lo mete es vulnerable, no tiene movilidad... Pero al menos Rito es bondadoso y le da la mejor ulti gankeadora del juego, quizás no te fedees tu, pero tu adc sí.\nPero volviendo al tema Illaoi aguanta, pega, tiene acercamiento, no gasta mucho maná y pega duro desde el nivel uno.\n¿El balance? No sé donde. \nY respondiendo tu opinón. En un juego que propone que cada partida sea diferente e incluso abre tu mundo jugabilistico a peldaños mucho más elevados de lo que imaginamos los que venimos de jugar Donkey Kong en la Nintendo 64 es una lástima, una pena y mucho más, una decepción que saquen un personaje que habilite sólo a un grupo selecto de dos campeones para que puedas jugarlo en contra.\n¿Se cumple el objetivo si aislamos a los demás personajes?\nNo, sinceramente creo que o todos están rotos o es mejor que hagan bien el trabajo de balancear a un campeón, que si pega, que no aguante o si pega y aguanta que tenga costos de maná y cd's altos, o si tiene daño, que no tenga tanto cc y así sucesivamente.\nDeberías mirar un poco más los alrededores, quizás si te informas y abres los ojos podrías emitir una opinión basada en conocimientos claros que aporten al desarrollo de la comunidad tan atrasada que es la Latino Americana.\n\n{{champion:36}}","replies":[{"poster":"Esti","date":"2015-12-13T16:05:56.829+0000","up_votes":1,"down_votes":0,"body":"ya probaste a TF a vel de ataque?.\nDiente de Nashor, Cañon de fuego rápido (mas rango con tu ataque básico, y también con tu W)  Botas de hechicero. una guinsoo quizá.","replies":[]}]}]},{"poster":"Abnermataivi","date":"2015-12-10T05:20:22.344+0000","up_votes":1,"down_votes":0,"body":"esta bien, los tentáculos de la Q son fáciles de esquivar, pero la E que te saca el espíritu,  tiene un rango demasiado alto, es rápida y te quita mucha vida, ataques o no a illaoi, te conviertes en \"recipiente\" y aparecen los famosos tentáculos capaces de matarte en tu propia torre, es un asco ese campeón, necesita nerfeo si o si...los que dicen q la movilidad, etc....una illaoi feed necesita a los 5 del team contrario atacándola para morir, y si hay suerte no mata a 2 o 3....no me vengan a  decir que solo necesitas movilidad, si estas en top, no hay mucha movilidad que digamos y en gral atacas melé, el problema es que cuando aparecen un montón de tentáculos en el mapa, te llevas al menos uno en la cara a la hora de tratar de destruirlos las veces necesarias para terminar con la maldición, ya si eres adc, uno de esos golpes que no esquives te manda directo a tu base o recall y gg farm...","replies":[{"poster":"Esti","date":"2015-12-13T16:02:06.884+0000","up_votes":1,"down_votes":0,"body":"regresas a tu torre. esperas aque salga el tentáculo, lo esquivas (que no es difícil) y tiras el back. recuerda que los tentáculos salen cada 10 segundos. tu back dura 8","replies":[]}]},{"poster":"Shappaw","date":"2015-11-25T14:56:45.117+0000","up_votes":1,"down_votes":0,"body":"Viejo, no pasaron nisiquiera 72 hs completas con el release y ya dicen que lo tienen que nerfear? \n\nMy godness...","replies":[]},{"poster":"Ryoga","date":"2015-11-25T01:22:53.512+0000","up_votes":1,"down_votes":0,"body":"es joda?","replies":[]}]}