{"poster":"HikenAce","date":"2015-12-18T17:53:11.067+0000","title":"Trolls en ranked","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":1,"body":"Ya me tiene cansado que cada vez que vas a jugar ranked te sale un troll o un afk y te termina afectando la partida hasta que pierdes. Hoy jugu&eacute; una ranked iba con Vladmir top y nos toco un Lee jg que en la seleccion de campeon digo bueno me voy a comer y estuvo afk por 10 minutos. Dejando eso de lado volvio pero ya el team ibamos muy mal en kills, objetivos,etc. Despues la Ashe de adc se arma como item Warmog y le pregunte porque te armas eso y me dijo no importa ya vamos a perder y empezo a regalar kills al team enemigo. Ademas la Katarina que iba mid hizo lo mismo borro todos sus items y se compro una apariencia espiritual y siguio regalando kills al enemigo. En fin solo eramos el supp que era un Thresh, el Lee afk y yo un Vladmir pero ya el otro team estaba muy feed y terminamos perdiendo. Ya no se podia  ni carrear y perdi 18 puntos por este tipo de gente, obviamente luego los reporte pero no se si los van a banear o no si se fijan en sus historial tiene la Ashe al final se armo dos tipos de botas y la Kata solo unas botas con hechizo de capitan. Espero que pueda hacer algo el tribunal. Saludos - FrancoGrille23","replies":[{"poster":"Friik","date":"2015-12-22T22:24:54.527+0000","up_votes":1,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/charlas-generales/0xZxV0Zq-solamente-yo-pienso-que-esto-no-va-mas-teamwork-op-mejorando-las {{item:3151}}  TU VOTO CUENTA {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Razek Fury","date":"2015-12-19T15:27:53.043+0000","up_votes":1,"down_votes":0,"body":"tipico.","replies":[]},{"poster":"Americans","date":"2015-12-18T18:20:16.134+0000","up_votes":1,"down_votes":0,"body":"Aprende a espaciar un texto.","replies":[{"poster":"HikenAce","date":"2015-12-19T00:50:31.765+0000","up_votes":1,"down_votes":0,"body":"Si lo que pasa es que estaba apurado, gracias por el comentario","replies":[]}]}]}