{"poster":"LAR5","date":"2019-01-20T19:31:38.144+0000","title":"El honor influye en el matchmaking?","subforum":"Comportamiento del jugador","up_votes":7,"down_votes":2,"body":"Ustedes piensan que el sistema te pone en equipos dependiendo en parte, por tu honor?\n\nEmpec&eacute; hace poco ac&aacute; y siento que puede funcionar as&iacute; el sistema de honor. Si sos alguien t&oacute;xico el sistema te pone con equipos con similar nivel de honor (supongamos honor 0 o 1). Por lo que el sistema garantizar&iacute;a que la gran mayor&iacute;a de flammers y trolls quede en ligas bajas. \n  Y otro dato... muy de vez en cuando me tocan partidas con 7 u 8 pibes que se flamean, pienso que el sistema te pone a prueba en esos casos y que si tenes un buen desempe&ntilde;o a nivel comunicaci&oacute;n el honor te sube m&aacute;s r&aacute;pido que si lo hicieras en una partida con pibes que no flammean.\n\nEn cuesti&oacute;n... antes de pasar a honor 3 me pas&oacute; esto &uacute;ltimo, por lo que deduzco que si podes lograr soportar el &quot;infierno&quot; del flammeo, tiene buenas recompensas.\n\nEntonces: Mayor hostigamiento que uno recibe+afrontarlo con buen car&aacute;cter = &quot;bonus&quot; de honor?\n\nQue piensan???\n","replies":[{"poster":"Black Dohko","date":"2019-01-20T19:50:35.203+0000","up_votes":3,"down_votes":0,"body":"Siento lo mismo op, hace 8 meses me banearon del chat, merecidamente, nunca me tocaron equipos tan toxicos despues de eso jajaj, jugaban bien lo pibes debo decir, mecanicamente y en el macro tmb, el tema es que se tiltean facil y se va todo a la bolsa.","replies":[{"poster":"LAR5","date":"2019-01-20T20:02:11.733+0000","up_votes":1,"down_votes":0,"body":"che y te costó mucho subir lp apartir de ese chat ban? Es decir, notas que hay una diferencia importante entre cada tipo de honor? a la hora de rankear","replies":[{"poster":"Black Dohko","date":"2019-01-20T20:11:18.793+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LAR5,realm=LAS,application-id=PJAKt7ph,discussion-id=UK4pZOMg,comment-id=00010001,timestamp=2019-01-20T20:02:11.733+0000)\n>\n> che y te costó mucho subir lp apartir de ese chat ban? Es decir, notas que hay una diferencia importante entre cada tipo de honor? a la hora de rankear\n\nUna banda jajaj y eso que recibo buena cantidad honor y no de premade, 8 meses despues recien llegue a honor 2, segun lei cuando recibis una sancion el grind para subir de honor es mas duro, al menos al principio.\n\nY deje de tener equipos asi de toxicos relativamente rapido, y era bastante random tambien para ser honestos, no es que era asi todas las partidas pero sentia mas seguido que lo normal. No se creo que cuando llegue a la meta 1 de 3 antes de nivel de honor 1 ya se calmo la cosa. Ahora en nivel de honor 2 estoy teniendo partidas super toxicas la verdad, pero creo que tiene que ver con la epoca del año, sin animos de ofender a nadie.","replies":[]}]},{"poster":"LAR5","date":"2019-01-20T19:58:48.861+0000","up_votes":1,"down_votes":0,"body":"todo apuntaría a eso entonces.","replies":[]}]},{"poster":"MILFortune","date":"2019-01-20T20:58:25.518+0000","up_votes":1,"down_votes":0,"body":"No lo sé, siempre soy el tóxico","replies":[{"poster":"LAR5","date":"2019-01-20T21:08:02.159+0000","up_votes":1,"down_votes":0,"body":"y en que liga estas? estas atascado? o no rankeas?","replies":[{"poster":"MILFortune","date":"2019-01-20T21:14:49.365+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LAR5,realm=LAS,application-id=PJAKt7ph,discussion-id=UK4pZOMg,comment-id=00020000,timestamp=2019-01-20T21:08:02.159+0000)\n>\n> y en que liga estas? estas atascado? o no rankeas?\n\nEstoy en varias ligas, Estoy atascado en algunas cuentas. En realidad uno siempre está atascado jajaja. Algunos días no rankeo otros días le doy duro. He notado lo que vos decís en el encabezado del post. Lo empecé a notar desde hace varios meses a mitad de año pasado. Solo pasa en elo bajo. La supuesta Isla de Aislados, ( de la cual Riot negó la existencia o planes para crearla) funciona y existe. Es un pool de gente tóxica e inters. Sucede lo mismo con las partidas de bots. Jugás con personas en Bronce 5, 4 y a partir de bronce 3 tenés bots en las partidas. Son bots de Riot, no de gente que sube cuentas. Dependiendo el elo en el que estés ( pero siempre en elo bajo , menos a Oro 5 ) encontrás estas cosas raras. Incluso las pruebas de ranked por posición. El elo bajo es una cesta de huevos de pascuas lleno de sorpresitas pero es divertido","replies":[{"poster":"LAR5","date":"2019-01-20T21:51:32.892+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MILFortune,realm=LAS,application-id=PJAKt7ph,discussion-id=UK4pZOMg,comment-id=000200000000,timestamp=2019-01-20T21:14:49.365+0000)\n>\n>  La supuesta Isla de Aislados, ( de la cual Riot negó la existencia o planes para crearla) funciona y existe. Es un pool de gente tóxica e inters.\n\nque miedo. me siento en la deep web xD","replies":[]}]}]}]},{"poster":"Hwaxinghz","date":"2019-01-20T19:34:09.279+0000","up_votes":2,"down_votes":0,"body":"Yo sospecho exactamente lo mismo que vos, tengo amigos con honor 0 y les toca CADA UNO que ¡¡¡¡DIOS MIO!!!! es terrible jugar con ellos, pienso que sí que los pone a prueba.","replies":[{"poster":"LAR5","date":"2019-01-20T19:43:04.017+0000","up_votes":1,"down_votes":0,"body":"Si, y no es descabellado.. me parece acertado lo que hacen si realmente es así. A aprovechar el flammeo!","replies":[{"poster":"Hwaxinghz","date":"2019-01-20T19:44:28.907+0000","up_votes":2,"down_votes":0,"body":"Igual se rompe un poco \"el esquema\" cuando juega en premades, el tema es cuando juega sólo, ahí siempre sospeché de que le tocan con otros flamers más. Pero bueno","replies":[{"poster":"LAR5","date":"2019-01-20T19:57:16.993+0000","up_votes":1,"down_votes":0,"body":"Ni idea, el 90% de las partidas que juego las hago solo y creo que ayer o anteayer subi a honor 3. Y empecé a jugar este juego hace 2 meses mas o menos. Por lo q no comprendo como la gente se atasca tanto así con el tema del honor.. debe ser eso, que los pibes flammean y no salen más de una liga, no sé.. algo hay","replies":[]}]}]}]},{"poster":"Just Play 4 Fun","date":"2019-01-21T05:31:06.864+0000","up_votes":1,"down_votes":0,"body":"Tengo honor 5, y la verdad que no lo había pensado antes de ver tu post, pero es muy probable ya que en 8 de cada 10 partidas mi equipo se comunica bien y mas que \"pingear mucho\" no hay toxicidad; aunque de vez en cuando puede colarse alguien jajajaj","replies":[]},{"poster":"Alba Meira","date":"2019-01-21T05:22:37.035+0000","up_votes":1,"down_votes":0,"body":"A escondidas, pero si influye bastante con el emparejamiento.","replies":[]},{"poster":"Phaedra","date":"2019-01-21T04:46:14.577+0000","up_votes":1,"down_votes":0,"body":"Es facil comprobarlo. Cada partida que jugas podes ver el honor de los otros 9 jugadores. Si vos tenes honor 3+ y TODOS tienen el mismo honor, entonces funciona como decis. \n\nYo la verdad, desde que esta esto del honor, veo 2 o 3 marcos con honor 3+ por game, lo cual es una proporcion muy baja. Y me pasa lo mismo en mi cuenta con honor 4 que en la que tengo honor 1...","replies":[]},{"poster":"asdmaskldmnkfl","date":"2019-01-21T02:23:09.914+0000","up_votes":1,"down_votes":0,"body":"El matchmaking solo funciona con las victorias y derrotas, nada más influye. Por ejemplo cuando recién tomas una cuenta tiene el mmr limpio y ganas muchas te empareja con gente mejor, pero el juego después de 100 partidas entiende cual es tu nivel y si estas muy mal te empareja con gente más mala y por ende flamer","replies":[]},{"poster":"PasoPackXHonores","date":"2019-01-21T00:09:14.044+0000","up_votes":1,"down_votes":0,"body":"No. Yo estaba en honor 1 y me metian con todos honor 5. El juego esta lleno de flamers rata. Aceptenlo","replies":[]},{"poster":"scachthach","date":"2019-01-20T23:32:47.815+0000","up_votes":1,"down_votes":0,"body":"soy honor 5  y estas equivocado. Me ponen con gente de cualquier honor y también tengo partidas en donde todos se flamean, no creo que influya, es el lol, hay flammers por todos lados","replies":[]},{"poster":"Tur1nTur4mb4r ","date":"2019-01-20T23:10:41.509+0000","up_votes":1,"down_votes":0,"body":"Es una buena teoría. Pero el honor es una mentira, y quizás, como decís vos, lo usa el sistema a modo de filtro. Nadie cambia su actitud por recibir honor, la gente es hija del rigor, eso es lo único que puede encaminar de verdad una actitud y aunque yo no veo tanto flameo, si creo que el flameo se contagia en una partida, es un choque de egos a ver quien la tiene más grande. Si te fijas la gente que recibe bans de chat o de partidas eventualmente se encamina. A mi me tomo 6 meses llegar a honor 5, de febrero a agosto. Y te soy sincero debo haber dado menos de la mitad del honor que recibi. El 80% de honor es gg de partidas no premade. Entonces no es raro lo que decís, la gente que no recibe honor quizás se tiltea y no puede salir del pozo de trolls y flamers","replies":[]}]}