{"poster":"Emeraldis","date":"2016-05-18T23:14:59.556+0000","title":"Leaver, Afker e punti ranked","subforum":"Aiuto e supporto","up_votes":3,"down_votes":6,"body":"Segnalo la **inusuale incidenza di leaver e afker durante le partite ranked**, &egrave; assurdo che debbano perdersi punti ranked a causa di giocatori che abbandonano la partita lasciando la squadra in inferiorit&agrave; numerica. **Queste partite dovrebbero semplicemente esser annullate** e neutralizzate senza perdita di punti (o guadagno) da parte degli altri giocatori. **Il giocatore che abbandona le ranked deve essere ultra penalizzato** cumulativamente in punti persi in classifica per ogni abbandono, fino ad un massimo di 3 o 5 partite abbandonate al mese che gli garantiranno un interdizione dal poter accedere alle partite classificate per periodi medio lunghi.\r\n\r\nSe non si prendono provvedimenti seri, svincolati da inutili segnalazioni che quasi mai raggiungono lo scopo prefissato, i giocatori mediocri o i sabotatori non saranno mai esclusi seriamente dalle partite classificate.","replies":[{"poster":"Skeltur","date":"2016-05-19T01:21:32.872+0000","up_votes":4,"down_votes":1,"body":"non ti è mai crashato internet o il client durante la partita? io gioco da 3 anni e sicuramente mi è successo una 20 di volte, sicuramente pure a te, però in quel caso non ti andrebbe bene perdere punti perchè non è stata colpa tua. Ora, come fa la riot a sapere se uno va afk perchè si è ricordato di avere un impegno o perchè invece ha avuto un crash? la tua proposta è assolutamente improponibile, aggiungo inoltre che, come li trovi tu nel tuo team, li avrai trovati sicuramente nel team avversario, ma finchè si vince va tutto bene ;)","replies":[{"poster":"Yamero Senpai","date":"2016-05-19T06:35:41.458+0000","up_votes":3,"down_votes":2,"body":"aggiungo che un sistema del genere possa essere abusato per non perdere mai, paghi uno che fa duoQ con te, se state perdendo lui esce dal game e GG WP, appena bannano al 1 c'è ne saranno altri 10 come lui perché tutti amiamo i soldi facili","replies":[]}]},{"poster":"GreenInch","date":"2016-05-19T06:36:48.708+0000","up_votes":1,"down_votes":1,"body":"Come abusarne poi?sto perdendo..vado afk...tanto non la contano...la domanda piu che altro è\"ancora che c'è  gente che se ne lamenta?\"...visto che gia ti sei escluso dalla categoria giocatore mediocre (perché questo sei...come lo sono io e lo sono tanti altri)le partite te le vinci anche in 4...gia fatto quindi si puo fare (cazzo non sono poi cosi tanto mediocre ahahahah ok linciatemi ora)","replies":[{"poster":"Frattaglia","date":"2016-05-19T06:47:37.978+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=GreenInch,realm=EUW,application-id=98NGV4Al,discussion-id=lhOEGxjk,comment-id=0001,timestamp=2016-05-19T06:36:48.708+0000)\n>\n> Come abusarne poi?sto perdendo..vado afk...tanto non la contano...la domanda piu che altro è&quot;ancora che c&#x27;è  gente che se ne lamenta?&quot;...visto che gia ti sei escluso dalla categoria giocatore mediocre (perché questo sei...come lo sono io e lo sono tanti altri)le partite te le vinci anche in 4...gia fatto quindi si puo fare (cazzo non sono poi cosi tanto mediocre ahahahah ok linciatemi ora)\n\nNe avevo vinta una 4v5 in gold alto/platino basso dopo che il mio mid aveva feedato ed era andato afk... sono casi fortuiti ma a volte ci si riesce uguale","replies":[{"poster":"GreenInch","date":"2016-05-19T07:05:14.215+0000","up_votes":1,"down_votes":0,"body":"Resta il fatto che si puo....e un minimo di bravura di 4 poveri martiri c'è sempre...molto spesso sono piu fortuite vittorie 5vs5 (bac calls...errori in tf...cose cosi)","replies":[]}]}]},{"poster":"Dr Gintoki","date":"2017-07-26T14:10:05.982+0000","up_votes":1,"down_votes":0,"body":"Basta che i punti li perdano solo chi è andato afk e chi era con lui nella selezione dei campioni.. così non ci può essere abuso.. mi sembra semplice.. la cosa che non è semplice è che anche se hai una percentuale di vittorie pari al 65/70% non salirai mai perché devi considerare che in una partita su 5 uno casuale va afk.. dovresti giocare un anno intero per passare dalla bronzo 5 alla Gold 1..","replies":[]},{"poster":"Emeraldis","date":"2016-05-19T18:54:35.740+0000","up_votes":1,"down_votes":0,"body":"Bhè, molte delle osservazioni che si sono fatte sono ragionevoli ma sinceramente strutturare il sistema un po come accade su DOTA, che chiaramente, non è la panacea di tutti i mali sia chiaro, potrebbe aiutare. Poi se occasionalmente mi cade la connessione , amen, sono disposto a beccarmi la penalità ma statisticamente è molto raro e comunque anche se io avessi problemi di linea cronici non è detto che debba rovinare i game altrui. Per i \"professionisti\" del \"salviamo il game a pagamento\", è chiaro che dopo \"tot\" il sistema dovrebbe farti giocare solo con gente del tuo livello, che ha cioè il tuo stesso numero di partite leftate, una sorta di \"simbolino di demerito\" al contrario di quello dell onore, cosi quando ti unisci in team con qualcuno sai che quello è un professionista del \"fail\" e puoi rifiutare la partita. A me non piace vincere facile ma neanche buttare le partite, se poi voi siete tutti bravissimi e fortissimi che vincete le partite 4 vs 5, avete la mia ammirazione ma io sono meno bravo di voi e mi piace giocare 5 vs 5^^","replies":[]},{"poster":"Ringiel","date":"2016-05-19T09:55:34.197+0000","up_votes":1,"down_votes":0,"body":"il tuo sistema potrebbe funzionare in una coda soloqueue,ma ora che si può joinare fino in 5,sarebbe un suicidio ... praticamente gran parte delle partite verrebbe annullato","replies":[]}]}