{"poster":"Hi Im not Shauna","date":"2017-02-04T19:35:41.224+0000","title":"Dat Riot!!!!!!!!!!!!!!!!!!!!!!!!!!!","subforum":"Charlas Generales","up_votes":2,"down_votes":10,"body":"Yo me pregunto ... si termino en plata 5 \r\nporque carajos en la proxima mejor de 10.\r\nganando 9 partidas y perdiendo 1, me ponen en Bronce 2.\r\npd vsalrptqlrp!{{summoner:4}}","replies":[{"poster":"Facundo0o","date":"2017-02-04T20:12:07.633+0000","up_votes":3,"down_votes":0,"body":"**Porque al terminar las placements te sale un cartel explicandotelo.....el cual dice q al inicio de esta season comenzaras en una liga menor a la q terminaste la anterior season...con 1 proposito de q si en verdad mereces estar ahi subiras....sino no.\nNunca vas a quedar igual a menos q seas diamante o mas y quedes platino 1 como siempre**","replies":[{"poster":"Daddy Yànkee","date":"2017-02-04T21:14:52.788+0000","up_votes":1,"down_votes":0,"body":"Gane 3 y quede en bronce 2 tambien","replies":[]}]},{"poster":"Excorpion","date":"2017-02-04T20:02:06.548+0000","up_votes":4,"down_votes":3,"body":"No hay error, tu desempeño no ha mejorado, por eso la baja de division es normal","replies":[{"poster":"Elige Tu Supp","date":"2017-02-04T20:18:28.114+0000","up_votes":2,"down_votes":0,"body":"ppff, la peor respuesta que vi, de echo la respuesta que dio facundo es la que corresponde, no podes decir que el desempeño del invocador no ah mejorado y por consiguiente la division que le dieron es la correcta, cuando en realidad es una cuestion de sistema que ya se habia avisado de ante mano. -1 a tu comentario que me parece totalmente irrespetuoso y desubicado\n\nSaludos","replies":[{"poster":"Excorpion","date":"2017-02-04T20:21:26.373+0000","up_votes":2,"down_votes":2,"body":"Porque irrespetuoso ?\nSi es verdad, si tu desempeño no mejora, bajas una liga\nsi mejora, llegas a la misma liga pero diferente division","replies":[{"poster":"Elige Tu Supp","date":"2017-02-04T20:28:19.832+0000","up_votes":1,"down_votes":0,"body":"No, xq se aclaro desde un principio que aunque se ganen las 10 partidas se iba a quedar una division mas baja que la que se quedo en la season pasada, es evidente que iba a quedar en bronze 1 como maximo, pero vos en vez de venir a explicar como funciona el sistema, venis a degradar diciendo que su desempeño no mejoro y por eso la division que le toco.\nA mi parecer ganar 9 de las 10 preliminares no es un mal desespeño, de echo me parece algo mas que bueno, si con eso consideras que su desempeño no mejoro, me parece que tenes un grave concepto de las cosas.","replies":[{"poster":"Excorpion","date":"2017-02-04T20:31:19.594+0000","up_votes":1,"down_votes":1,"body":"Nunca miro las V/D, porque son una estadística menor\n\nMi hermano, mi primo y yo, hicimos la prueba\nyo perdiendo 6 de 10, quede plata IV siendo plata II\nmi hermano, ganando 7/10 quedo bronce III siendo bronce I (entendible)\ny mi primo que fue Oro la season pasada\nganando 8/10, quedo bronce III\n\n\nPrefiero basarme en hechos, no en estadísticas\nque mi primo haya llegado a oro la season pasada\nno significa que haya mejorado en general\npuede que lo hayan carreado durante sus partidas\ny que por eso gano muchas veces","replies":[{"poster":"Zinc","date":"2017-02-04T20:36:17.916+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=excorpion2013,realm=LAS,application-id=v7qsfXsE,discussion-id=3ksRE0kn,comment-id=00020000000000000000,timestamp=2017-02-04T20:31:19.594+0000)\n>\n> Nunca miro las V/D, porque son una estadística menor\n> \n> Mi hermano, mi primo y yo, hicimos la prueba\n> yo perdiendo 6 de 10, quede plata IV siendo plata II\n> mi hermano, ganando 7/10 quedo bronce III siendo bronce I (entendible)\n> y mi primo que fue Oro la season pasada\n> ganando 8/10, quedo bronce III\n> \n> \n> Prefiero basarme en hechos, no en estadísticas\n> que mi primo haya llegado a oro la season pasada\n> no significa que haya mejorado en general\n> puede que lo hayan carreado durante sus partidas\n> y que por eso gano muchas veces\n\n\nEs como dice  Facundo0o, no como vos pensas.","replies":[]},{"poster":"Elige Tu Supp","date":"2017-02-04T20:36:12.118+0000","up_votes":1,"down_votes":0,"body":"Tu primo es el unico que podria llegar a pedir explicaciones, el resto esta perfecto basandonos en el sistema xq en definitiva el sistema habla de 1 division menos, no 2 divisiones y encima por 2 derrotas. eso no significa que empeoro su desempeño o que lo mejoro.\nTodos podemos tener partidas malas y que nos carren, pero no por eso somos mejores o peores jugadores, uno mejora o empeora con el tiempo, no en 10 partidas","replies":[{"poster":"Excorpion","date":"2017-02-04T20:38:32.988+0000","up_votes":1,"down_votes":1,"body":"Para nada, yo veo que juega igual que antes, los mismos errores de vision, posicionamiento, KDA similares y farm bajando porque se distrae mucho con otras cosas como la kill.","replies":[]}]}]}]}]}]}]},{"poster":"Kvøthê","date":"2017-02-04T19:42:19.536+0000","up_votes":1,"down_votes":0,"body":"siempre quedas algo abajo de lo que terminaste la season pasada","replies":[]},{"poster":"Avispaneitor","date":"2017-02-04T19:36:36.197+0000","up_votes":1,"down_votes":0,"body":"Esta perfecto.","replies":[]}]}