{"poster":"Dechsa","date":"2019-05-01T11:02:31.966+0000","title":"Dia 4 Jungler sucht Leute zum coachen :)","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":1,"body":"Hi Leute, da ich mal wieder Lust aufs Coachen bekommen habe, suche ich wieder nach ein Paar Leuten, welche den Jungle lernen wollen. Vorab muss ich dazu sagen, dass es kein Boosting ist und das ich nicht jede beliebige Person annehme, sondern es eher nach Gefühl mache, wer meiner Ansicht nach am meisten \"Potential\" hat nicht Hardstuck zu sein. Aber weg vom gelaber zu dem was ich euch überhaupt bieten kann.\r\n\r\nIch biete euch:\r\n\r\n- Ein kostenloses Coaching ! Das ist wichtig zu betonen, da ich quasi meine Zeit dafür aufopfere um euch zu helfen. Dementsprechend erwarte ich auch den nötigen Respekt mir zuzuhören sowie auch die Motivation etwas lernen zu wollen. Ein Coach bringt euch nicht´s, wenn ihr es nicht umsetzt oder es gar nicht erst versucht umzusetzen. :)\r\n\r\n- Replay Analysen, welche sich ausschließlich auf ranked Games beziehen, bei denen ihr Probleme hattet zu gewinnen etc. . Bspw. können dabei auch spezifische Fragen entstehen die vom decision making bis zum kompletten Macro und Warding gehen.\r\n\r\n- Guides bezüglich Routen etc.\r\n\r\n- Persönliche Erfahrung. Jeder musst früher oder später mal das Spiel \"lernen\" . Wie ich binnen 1 1/2 Jahren nach Dia 4 geclimbed bin und dabei sogar noch Pausen hatte, erkläre ich euch bei Bedarf auch.\r\n\r\nDie Anforderungen an euch:\r\n\r\n- Den Beitrag, der hier im Forum steht KOMPLETT LESEN. Ich finde es teilweise unverschämt, wie oft mich doch Leute bspw. bei Duo Queue Beiträgen adden und mich nach meinem Pool oder anderen dingen Fragen, welche bereits im Beitrag stehen. Deswegen einfach den Beitrag lesen und hinterfragen, ob ihr denn die mögliche Motivation dazu habt gecoacht zu werden.\r\n\r\n- Ihr solltet mindestens 30 Games in der Rolle \"Jungler\" absolviert haben in dieser Season (in Ranked Games), damit ich sehe, ob ihr denn auch bereits ein wenig gepracticed habt.\r\n\r\n- Mind. 16 Jahre alt sein\r\n\r\n- Ein Mic sowie auch TS3 ODER Discord zur Verfügung haben.\r\n\r\n- Zu guter letzt etwas von meiner Seite aus selbstverständliches: Sich vorstellen nach dem ich euch angenommen habe. Es ist anscheinend nicht mehr üblich, dass Leute sich nach dem Adden einer anderen Person vorstellen. Es ist quasi wie einer Art Mini Vorstellung, bei der ich bereits oft erkennen kann, ob die Person denn überhaupt Interesse hat.\r\n\r\nWeitere Informationen über mich:\r\n\r\n- Ich bin 18\r\n\r\n- Derzeitig Dia 4\r\n\r\nBei weiteren Fragen bezüglich meiner Person oder dem Beitrag hier, könnt ihr mich gerne adden.\r\n\r\nMit freundlichen Grüßen,\r\nDechsa","replies":[{"poster":"NiicQ","date":"2019-05-01T20:02:52.531+0000","up_votes":1,"down_votes":0,"body":"Guten Abend Dechsa. Ich bin Nico 16 und zur Zeit Silber 3. Ich war Season 7 schonmal Jungle Main (in Silber 4) und möchte jetzt wieder Jungle Main werden. Hoffe du könntest mir helfen, geaddet habe ich dich.\nMFG Nico (Ingame NiicQ)","replies":[]},{"poster":"AI SeinaruKurisu","date":"2019-05-01T13:47:20.066+0000","up_votes":1,"down_votes":0,"body":"Hey Dechsa,\n\nMein Name ist Chris (aka AI SeinaruKurisu). Ich bin aktuell Gold 4 und Jungle-Main. Ich selbst habe das Gefühl, dass ich höher kommen könnte, allerdings komme ich einfach nicht weiter.\nIch bin 18 Jahre jung, besitze sowohl TS3 als auch Discord und habe auf jeden Fall Interesse an deinem Coaching/deiner Hilfe. Ingame habe ich dir bereits eine Freundschaftsanfrage gesendet.\n\nMit freundlichen Grüßen,\nAI SeinaruKurisu | Chris.","replies":[]}]}