{"poster":"Keriken","date":"2015-06-22T22:06:20.207+0000","title":"Idee Skin Tauschhandel","subforum":"Skin- & Champion-Konzepte","up_votes":6,"down_votes":3,"body":"Hallo,\r\n\r\nMir kam eben einfach mal so Spontan eine Idee, was w&auml;re wenn wir auch Skins mit Spielern aus der Freundesliste Tauschen k&ouml;nnten?\r\nJeder kennt das.\r\n\r\nMan Kauf einen Skin aber am ende gef&auml;llt dieser einem doch nicht wirklich und der Skin verstaubt im Inventar.\r\nDann gebe es die M&ouml;glichkeit mit Freunden ein Skin gegen Skin Tausch durchzuf&uuml;hren ?\r\n\r\nNat&uuml;rlich k&ouml;nnte man Begrenzungen setzen W&ouml;chentlich und das man den Tausch nicht r&uuml;ckg&auml;ngig machen kann mit der jeweiligen Person,\r\naber vllt k&ouml;nnte man das in Betrachtung ziehen was denkt ihr :)\r\n\r\nLg Keriken","replies":[{"poster":"MeMyselfandBaal","date":"2015-06-23T03:12:52.661+0000","up_votes":5,"down_votes":0,"body":"JAAAAAAA!!!!\n\nähm Nein.\n\nVersteht bitte eins: Riot lebt von den Skinverkäufen. Von jeden 2,50, die ihr denen gebt, um euch einen on Sale Skin zu kaufen.\n\nWenn ihr jetzt sagt: Ich kaufe mir den \"On Sals Skin\" von Annie für die 2,50 und verschenke meinen vorher für mehr Geld gekauften, aber jetzt sinnlosen Skin weiter (was ich nebenbei genau jetzt machen könnte, weil ich mir Panda-Annie geholt habe und Rollentausch-Annie nicht mehr brauche)... dann macht Riot de facto Verluste. Mit jedem neu releasten Skin, weil ihr alle eure alten, nutzlosen, Skins einfach an eure Freunde weiter verschenkt.\n\nin dem Moment, wo Riot das macht, könnt ihr euch von dem wahrem Free2Play verabschieden, weil Riot dann seine Haupteinnahmequelle umstrukturieren muss. Und das wollt ihr alle nicht.","replies":[{"poster":"BM Vilich","date":"2015-06-23T05:17:39.548+0000","up_votes":1,"down_votes":0,"body":"Tauschen, nicht schenken.","replies":[{"poster":"SFG Deathstroke","date":"2015-06-23T06:04:48.089+0000","up_votes":1,"down_votes":0,"body":"Macht einen grossen Unterschied ;)","replies":[{"poster":"Keriken","date":"2015-06-23T06:19:29.060+0000","up_votes":2,"down_votes":0,"body":"Es wird Getauscht, ein anderer Muss einen Skin gegen Skin Tauschen? das bedeutet das beide ja schon Geld investiert haben nur sich die Skin Tauschen, zudem soll es eine Begrenzung geben was den Handel des jeweiligen Skin handelt wie das ein Gehandelter Skin nicht mehr gehandelt \" GeTauscht\" werden kann","replies":[{"poster":"HyperionCH","date":"2015-06-23T07:27:13.151+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Keriken,realm=EUW,application-id=L7E6lhzo,discussion-id=jiaU48yZ,comment-id=0003000000000000,timestamp=2015-06-23T06:19:29.060+0000)\n>\n> Es wird Getauscht, ein anderer Muss einen Skin gegen Skin Tauschen? das bedeutet das beide ja schon Geld investiert haben nur sich die Skin Tauschen, zudem soll es eine Begrenzung geben was den Handel des jeweiligen Skin handelt wie das ein Gehandelter Skin nicht mehr gehandelt \" GeTauscht\" werden kann\n\nUnd was denkst du, was passiert, weil es keine Tauschmöglichkeit gibt?\nZumindest ein Teil der Spieler kauft sich dann den anderen (jenen, den sie nun möchten). Dieser Umsatz würde durchs Tauschen dann Wegfallen.\n\nEntsprechend müsste Riot entweder mit dem Umsatzverlust leben (höhöhö, macht keine gewinn-orientierte Firma) oder den Umsatzrückgang irgendwie refinanzieren. Dies würde wohl bedeuten, dass Skins massiv teurer werden, damit Riot wieder den gleich hohen Umsatz erzielt.","replies":[]},{"poster":"Alustus","date":"2015-06-23T07:16:47.603+0000","up_votes":1,"down_votes":0,"body":"Und das beide evt. weniger weiter investieren.\n\nLeute die in LoL ihr geld investieren tun das gerne öfters.\n\n\nRiot würde dadrurch wahrscheinlich eine starke gewinn redzierung erhalten.\nRiot hatte im Jahr 2014 knapp 2 Mrd Umsatz (nicht gewinn).\n\nDas ist für eine Firma mit so einen hohen bekanntheitsgard und der enormen infrstruktur nicht übertrieben viel. (wenn auch genug)","replies":[]},{"poster":"SFG Deathstroke","date":"2015-06-23T06:21:41.677+0000","up_votes":1,"down_votes":0,"body":"Wie man es dreht und wendet Riot würde dabei Geld verlieren das ist dir schon klar?","replies":[]}]}]}]}]},{"poster":"Reela","date":"2015-06-22T23:56:33.570+0000","up_votes":2,"down_votes":0,"body":"Da gibt es direkt ein riesiges Negativargument: Riot verliert dadurch Geld.\na. Verliert die Firma potentielle Käufer, b. muss so eine Funktion erstmal programmiert werden, natürlich zum Gefallen der Spieler.\nAußerdem heizt es den Verkauf von seltenen Skins nochmals an.\nDann wird CS Riven einfach für 200€ bei eBay verscherbelt.","replies":[{"poster":"BM Vilich","date":"2015-06-23T05:19:38.080+0000","up_votes":1,"down_votes":0,"body":"Alles muss programmiert werden, k. A was das Argument soll.","replies":[{"poster":"SFG Deathstroke","date":"2015-06-23T06:09:51.125+0000","up_votes":1,"down_votes":0,"body":"Das Argument soll wie andere einfach heissen dass Riot wenn nicht von den Skins das Geld woanders herholen \"müsste\" wenn man diesen Tauschhandel einführen würde. Wieso Skins tauschen du hast den Skin gekauft dein fehler. Klar ich habe auch skins die ich kaum brauche bzw gar nicht aber wer weiss vielleicht hab ich mal wieder bock auf ihn und auf keinen fall will ich dass das Spiel kostenpflichtig oder (was noch besser wäre) Riot brankrott geht :D","replies":[{"poster":"Keriken","date":"2015-06-23T06:17:25.853+0000","up_votes":1,"down_votes":0,"body":"Weshalb sollte es Bankgrott gehen?, wenn ich ein Skin mit ein anderen Tausche? \nEs kommen auch immer neue Skins, dass heißt das so oder so immer welche gekauft werden.\nZudem würde Riot davon bestimmt nicht Pleite gehen.","replies":[{"poster":"Reela","date":"2015-06-23T06:28:30.873+0000","up_votes":2,"down_votes":0,"body":"Aber Riot würde Einnahmen verlieren, weil Leute Skins, die sie haben wollen ertauschen statt kaufen.\nAus wirtschaftlicher Sicht macht die Idee einfach keinen Sinn.","replies":[]},{"poster":"SFG Deathstroke","date":"2015-06-23T06:24:33.557+0000","up_votes":1,"down_votes":0,"body":"Keine sorge sie würden nicht Bankrott gehen das war Sarkasmus, eher würden sie eben wahrscheinlich irgendwas anderes Kostenpflichtig machen oder glaubst du wenn Skins getauscht werden verlieren die kein Geld? Klar kommen immer wieder neue Skins aber wenn jemand beispielsweise einen alten Skin gutfindet und ein anderer einen neuen hat. Nehmen wir an die beiden Tauschen hat Riot schon Geld an 2 Skins verloren die nicht gekauft sondern getauscht wurden jetzt überlege mal wie das auf Dauer aussehen würde","replies":[]}]}]}]}]},{"poster":"Succubin","date":"2015-06-22T22:26:42.717+0000","up_votes":2,"down_votes":0,"body":"Ich finde deine Idee nicht schlecht aber wenn diese Funktion wirklich eingeführt wird, dann sollten sie die Skins höchsten 1-2 mal tauschbar machen.","replies":[{"poster":"Flitzzy","date":"2016-04-02T18:44:17.034+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nekokatze,realm=EUW,application-id=L7E6lhzo,discussion-id=jiaU48yZ,comment-id=0000,timestamp=2015-06-22T22:26:42.717+0000)\n>\n> Ich finde deine Idee nicht schlecht aber wenn diese Funktion wirklich eingeführt wird, dann sollten sie die Skins höchsten 1-2 mal tauschbar machen.\n\nja einmalig, Accountgebunden nach dem Tausch.","replies":[]},{"poster":"Keriken","date":"2015-06-23T06:15:10.120+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt, eine Begrenzung sollte es auf jeden Fall geben :)","replies":[]}]},{"poster":"Tamm the Creator","date":"2015-06-25T14:37:21.138+0000","up_votes":1,"down_votes":0,"body":"Wie wäre es mit einer Region Abhängigen \"Tauschecke\" in der man Skins für Skins anbieten kann, aber keine Skins die derzeit verfügbar sind.","replies":[]},{"poster":"TurtleMari","date":"2015-06-23T13:51:15.217+0000","up_votes":1,"down_votes":0,"body":"Die Idee an sich finde ich gut, wenn auch Lückenhaft.\nEs gab vor kurzem eine Diskussion Skins zurückgeben \nzu können.\n\nWenn man so eine Funktion einführen würde, dann dürfte\nman nur Skins gegen andere Skins der selben Preisklasse\ntauschen und müsste eine Gebühr von 50% der RP die \ndiese Skins kosten zahlen, um die Verluste auszugleichen.","replies":[]},{"poster":"Iuvenis","date":"2015-06-23T11:38:16.273+0000","up_votes":1,"down_votes":0,"body":"Es wäre durchaus machbar, jedoch nur unter  bestimmten Bedingungen.\nWie z.B.:\n- man darf nur gleichwertige Skins tauschen\n- legacy  und limited Skins sind  vom Tausch ausgeschlossen\n- soll RP/EP kosten","replies":[]},{"poster":"Killerkante","date":"2015-06-23T01:11:27.531+0000","up_votes":1,"down_votes":0,"body":"Wäre eine ganz coole Idee, natürlich sollte man limited/legacy skins davon ausschließen, weil sonst wieder die Ebayer winken.","replies":[{"poster":"Keriken","date":"2015-06-23T06:15:43.688+0000","up_votes":1,"down_votes":0,"body":"Richtig, Vorsichtmaßnahmen müssten aufgebaut werden um zu verhindern das dies ausgenutzt wird","replies":[]}]}]}