{"poster":"HaloBabyDad","date":"2016-03-24T03:38:15.288+0000","title":"Blind pick is outdated, can we move to Draft pick?","subforum":"Gameplay & Strategy","up_votes":5,"down_votes":1,"body":"So WHEN does blind pick go? The team at riot have PUSHED for the last 2 seasons for the game to become more diverse and offering meaningful strengths and weaknesses. So in all of that, most peoples practice mode is Normal, which is only blind pick. \r\nStarting a game with a perfectly okay team comp, on the champ you want to practice, and you counter your enemy so hard it isn&#039;t funny, there&#039;s no satisfaction unless you&#039;re a sadist, and to be honest you learn nothing playing easy mode. You just get really fed dominate and then the enemy team gets SALTY and then they&#039;re too busy fighting each other saying YOU&#039;RE SO S**T C**T UNINF****NGSTALL YOU PIECE OF S**T F****T. That&#039;s how 95% of blind pick normal games end up. And people just wanted to practice, they either learn nothing or get demoralized and raged at for something the couldn&#039;t prevent. \r\nI propose a simple solution, retaining the essence of a normal game, Sequential picks visible to both teams like ranked. &quot; people would also learn alot more about champion diversity that way too, and feel more comfortable with the ranked layout&quot; BUT without the ban phase. This would clear up so many games being lost before you even start them. Save everyone salt reserves, and keep toxicity down. Its a perfect solution to the rage this causes ALOT of people. Including myself. Because the right summoner spells and right champion picks go a LONG way toward the games outcome because of the direction you guys have pushed the rift into. Blind pick is as devastating as lag to gameplay, to the point where you or more of your teammates CANNOT compete.\r\n\r\nSo my General Question is &quot;So many people have asked for this change, dating all the way back 6 years ago now. And the game is MUCH more in need of that now than it was a few years ago, a push in the right direction would be this change. There are MANY forum threads on this across different servers. But they&#039;re generally left unanswered but now it is moving from an old want to a games necessity to have this change. so i thought id ask, Is and if so WHEN will this change be implemented to keep up with your current game-state?\r\n\r\nYours Sincerely, \r\nHaloBabyDad","replies":[{"poster":"Vegathron","date":"2016-03-24T08:37:02.629+0000","up_votes":1,"down_votes":0,"body":"+1 to this i dont see why it shouldnt be exactly like how dynamic que is now but with a different set of mmrs and no rank (obviously)","replies":[]},{"poster":"Ingénue","date":"2016-03-24T06:02:38.632+0000","up_votes":1,"down_votes":0,"body":"> You just get really fed dominate and then the enemy team gets SALTY and then they're too busy fighting each other saying YOU'RE SO ST CT UNINF**NGSTALL YOU PIECE OF ST F**T. That's how 95% of blind pick normal games end up.\n\nAlso how 95% of draft pick normals end up as well. A change in queue will likely not significantly reduce toxicity, apart from the \"x role or afk/feed\" mentality.\n\n[There has been discussion about releasing normal draft pick (with the NCS)](http://na.leagueoflegends.com/en/site/2016-season-update/new-champ-select.html), however there has yet to be official word as to whether or not our cinnamon roll server will be getting it.\n If it is coming out, it will likely be updated on [this thread.](http://boards.oce.leagueoflegends.com/en/c/miscellaneous/ZzQR1haM-queue-schedule-updated)\n\nFingers crossed ♥","replies":[{"poster":"HaloBabyDad","date":"2016-03-24T06:16:30.326+0000","up_votes":1,"down_votes":0,"body":"Youre probably right, but at least youll be getting raged at because you are ACTUALLY bad not just because you actually got blind pick shafted.","replies":[]}]},{"poster":"BarryButcher","date":"2016-03-24T03:40:03.955+0000","up_votes":1,"down_votes":0,"body":"Riot promised that we would get Draft Normals when the new Champion Select moved to Normals and Solo Que came out.\n\nSolo Que has now been scraped most likely, so... RIP Draft Normals","replies":[{"poster":"HaloBabyDad","date":"2016-03-24T05:12:50.257+0000","up_votes":1,"down_votes":0,"body":":c I really hope not. That would 100% be the buzzkill i didnt want to hear :c","replies":[]}]}]}