{"poster":"2cool4nosmurf","date":"2017-10-22T11:42:58.212+0000","title":"Ehemaliger Dia Spieler sucht Clan/Coach zum Weiterentwickeln","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo Beschw&ouml;rer,\r\n\r\nIch bin ein ehemaliger Dia Spieler, der super competetiv ist und sich gerne weiter entwickeln m&ouml;chte. \r\nDeswegen suche ich ein Clan mit einen Coaching-Angebot um wieder zu mindest an mein altes Level ran zu kommen.\r\nIch versuche im Moment ADC zu mainen, meine Teamfights sind ziemlich clean, allerdings fehlt mir das allgemeine Knownledge, besonders in der Lane.\r\nIch w&uuml;rde auch gerne einen Team beitreten, allerdings erst, wenn ich mich selber daf&uuml;r bereit f&uuml;hle.\r\n\r\nEin paar Fakten zu mir:\r\n22 Jahre alt\r\nNetter und lustiger Mitstreiter\r\nFast jeden Tag zu jeder Uhrzeit bereit zu trainieren\r\nSehr ehrgeizig\r\nKEIN Flamer :)\r\n\r\nWas ich suche:\r\nEinen netten Clan\r\nEinen Coach der mich weiter bringen m&ouml;chte\r\nGgf. Sp&auml;ter ein Dia Team\r\nMenschen mit denen man auch aus Spa&szlig; ein paar Spiele spielen kann.\r\n\r\nWenn sich jemand bereit f&uuml;hlt diese Aufgabe anzunehmen und mich gerne f&uuml;r eine Vorstellung in seinen Clan einladen w&uuml;rde, k&ouml;nnt ihr mich gerne adden, oder einfach auf diesen Thread antworten.\r\nHodor!","replies":[{"poster":"2cool4nosmurf","date":"2017-10-23T12:04:24.594+0000","up_votes":1,"down_votes":0,"body":".","replies":[]},{"poster":"2cool4nosmurf","date":"2017-10-22T17:47:24.338+0000","up_votes":1,"down_votes":0,"body":".","replies":[]},{"poster":"Smøkez","date":"2017-10-22T13:45:44.975+0000","up_votes":1,"down_votes":0,"body":"Ich denke in diamond solltest du eigentlich nh lane schon cleaner spielen koennen z.B autoattacks machen auf gegner wenn deine minions low sind trades eingehen die fuer dich gut sind daran zu denken wo der jungler is das gehoert alles zu einer guten laning phase zu pingen wann ihr all in geht solche sachen zu ueben beeinflussen eine lane sehr vielleicht einen soloq partner suchen da du adc main bist mit ihm zusammen climben. Das wär jz so was ich sagen wuerde fuer weitere fragen würd ich auch weiter eingehen in die themen wenn du das willst.","replies":[]},{"poster":"2cool4nosmurf","date":"2017-10-22T13:04:30.751+0000","up_votes":1,"down_votes":0,"body":".","replies":[]}]}