{"poster":"TSS MagicZz","date":"2015-10-02T13:08:11.805+0000","title":"Apocalypse United sucht Mitglieder [Plat 5+ ->]","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Guten Tag liebe LoL Community,\nda mir die Soloqueue einfach bei weitem zu anstrengend und monoton wird, bin ich zu dem Entschluss gekommen, ein damaliges Ranked Team (Momentan Gold 1) wieder neu aufbl&uuml;hen zu lassen.\n\nIch suche Spieler, die die folgenden Lanes **Mainen**:\n* Toplane: MagicZz\n*\n* Midlane:\n*\n* Jungle:\n*\n* Adc:\n*\n*\n* Supp:\n\n**_Meine Voraussetzungen sind:_**\n1. Keine Premades. Warum? Relativ einfach zu begr&uuml;nden, ich hatte sehr schlecht Erfahrungen mit solchen in Vergangenen Teamranked Aktionen.\n2. Strukturiertes mit denken, um die Atmosph&auml;re beim spielen noch besser gestalten zu k&ouml;nnen.\n3. Einen Championpool besitzen, der nicht nur aus einem Champ besteht. Warum? Ebenfalls relativ einfach, weil wir uns nicht immer ein Team um denjenigen bauen wollen. \n4. Ihr sollten mit Konstruktiver Kritik umgehen k&ouml;nnen (!!!)\n5. Das Alter spielt in meinen Augen auch eine Rolle, daher solltet Ihr 17+ sein!\n6. Zudem solltet Ihr ingame nicht &uuml;ber Eure privat Angelegenheiten oder von Eurem Tag erz&auml;hlen.... =&gt; Konzentriertes Spielen!!!\n7. Das ganze serious nehmen (!!!)\n8. _**mindestens plat 5**_\n9. W&auml;hrend der Selection ruhig bleiben, und strukturiert vorgehen!\n\n\nSolltet Ihr die oben angesprochenen Voraussetzungen nicht erf&uuml;llen, bitte ich Euch mich nicht zu adden, weil ich dar&uuml;ber nicht diskutieren werde.\n\n\nIch biete Euch:\n-Teilnahme an Turnieren, sofern die Synergie zwischen dem Team besteht\n-Konzentriertes Spielen \n-Geregelte Trainingszeiten **3x in der Woche!** \n-Weiteres wird privat besprochen.\n\n\nZu mir:\nIch spiele bereits schon seit der Season 1 das Spiel. Momentan bin ich in der Platin Division 3, und beherrsche die Toplane dem entsprechend gut :)\nIch besitze alle Champions, alle Runen oder sonstigen Stuff, wodurch die Kommunikation untereinander (vor allem in der Selection) stark gef&ouml;rdert wird.\n\n\n~~ES H&Ouml;RT SICH ALLES EIN BISSCHEN STRANGE AN, ABER WAS MUSS, DAS MUSS!~~\n\nSolltet Ihr die oben genannten Kriterien erf&uuml;llen, so k&ouml;nnt Ihr mich ingame unter dem Namen &quot;MagicZz&quot; adden, ich werde Euch annehmen, sofern ich online bin!\n\n**_TRYOUTS WERDEN AM KOMMENDEM WOCHENENDE GEMACHT!!!_**","replies":[{"poster":"TSS MagicZz","date":"2015-10-03T17:43:57.281+0000","up_votes":1,"down_votes":0,"body":"scheiße gelaufen für mich würd ich sagen, dennoch muss man mit einem serious team, serious umgehen, relativ plausibel :)","replies":[]},{"poster":"TEMP1398733","date":"2015-10-02T13:10:36.490+0000","up_votes":1,"down_votes":0,"body":"Hi,\n-Komme aus Österreich->Kärnten (20 J.)\n-Vollblut-ADC!\n-Champianpool: so gut wie alle ADCs !!! Jinx !!! ...\n-sehr viel Spielerfahrung und ziemlich gute map-awareness\n-max. 3 Trainings unter der Woche möglich (Turniere am SA bzw. SO jedoch ausgeschlossen)\nHabe zuletzt mit einem Team mit Coach gespielt (Platinbereich)\nSpiele seit 2 Jahren LoL.\nAußerdem ist mir wichtig das regelmäßige Spielen mit dem Team! (bevorzugt feste Trainingszeiten)\nMeine Ziele sind bei diversen Turniere teil zunehmen und mit der Zeit sie auch zu gewinnen ;) … und mit dem Team stark werden!\nErreichen könnt ihr mich Ingame EU-West ->Boonslang","replies":[]},{"poster":"An1M3Tony","date":"2015-10-02T15:54:34.342+0000","up_votes":1,"down_votes":1,"body":"Hey, suche eig. nach einem Teamranked und erfülle alle Voraussetungen , aber ich mag deine Art nicht. Nur so ;) Hörst dich wie jemand an der keine Toleranz ......etc hat .","replies":[]}]}