{"poster":"YoutivBro","date":"2016-03-24T13:52:33.308+0000","title":"Hilfe!!!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo,\r\nIch wurde gerade f&uuml;r 5 spiele mit einer Zeitbestrafung von 5 min gebannt oder wie man das nennt.\r\nBegr&uuml;ndung War das ich angeblich AFK War obwohl das kompletter quatsch War. Ich habe eine normale Runde gezockt und habe eine C+ bekommen.\r\nwarum wurde ich jetzt gebannt?????","replies":[{"poster":"Untouchable ProX","date":"2016-03-24T15:01:05.103+0000","up_votes":1,"down_votes":0,"body":"Und wie sollen wir dir helfen?\nDie Bewertung bezieht nicht das ''AFK'' mit ein. Nur die KDA.\n\nZudem kannst du natürlich auch nicht mehr auf die Hextech zugreifen für ungewissen Zeit.","replies":[{"poster":"legofreak1","date":"2016-03-24T15:14:14.367+0000","up_votes":1,"down_votes":0,"body":"Die Bewertung zieht weit mehr in Betracht als die KDA. Farm und Wards werden zum Beispiel auch mit einbezogen.\n\nUnd ich meine, Low-Priority Queue hat keinen Einfluss auf Hextech-Crafting.","replies":[{"poster":"YoutivBro","date":"2016-03-24T18:01:41.840+0000","up_votes":1,"down_votes":0,"body":"Ich wurde jedoch zu unrecht bestraft.\nUnd wollte mal wissen ob man da irgendwie Rot oder so an schreiben kann.","replies":[{"poster":"legofreak1","date":"2016-03-24T18:17:32.382+0000","up_votes":1,"down_votes":0,"body":"Ich bezweifle, dass du zu Unrecht bestraft wurdest. Einfach afk in der Base rumlaufen und nichts tun wird den Leaverbuster nicht davon abhalten, dies als afk zu erkennen. Das System ist da recht effizient und zuverlässig.","replies":[]}]}]},{"poster":"Yaxtee","date":"2016-03-24T15:16:52.865+0000","up_votes":1,"down_votes":0,"body":"Das ist nicht richtig.\nVom Hextech Crafting wird man nur ausgeschlossen, wenn man gebannt wird, eine Chat oder Rankedrestriction bekommen hat, das ist hier natürlich nicht der Fall, weil der Ersteller nur ne 5 Minuten Warteschlange bekommen, hat das ist nicht dasselbe.\nJedoch arbeitet das System da recht genau, wenn du für mehrere Spiele warten musst, solltest du schon öfter vom System erkannt worden sein, das passiert nicht nach einem Mal AFK gehen.","replies":[]}]}]}