{"poster":"GrumbeerKnoll","date":"2019-09-23T01:57:01.721+0000","title":"Immer zur selben Minute laggs und Soundmeldungen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo ich bin noch recht neu hier im Forum, daher bitte nicht flamen, sollte ich fehler machen...\r\n\r\nMein Problem äussert sich wie folgt, seit 2Wochen circa in jedem Modus dieses Clients (Da ich auch auf dem PBE zum testen nen Acc erstellt habe);\r\n\r\nAb der 6. Minute fängt mein ganzer PC an zu laggen heisst >> Die Maus bewegt sich verzögert>schreibe ich etwas im Chat z.B. \"I had a lagg\" und sende diese mit Enter ab, sehe ich noch wie meine Nachricht ausgeschrieben und dann gesendet wird> Beim Raustabben \"Alt+TAB\" sehe ich im Teamspeak einen erhöhten Ping und höre in den Systemsounds ein \"beep\" das sich meiner Meinung aus die Tastendrücke im Spiel (Skills/Fähigkeiten/Autohit after Click) ableiten lässt..\r\nDiese \"Phase\" hält etwa 5minuten an. Ich habe im Spiel keine Verbindungsprobleme, der PING bleibt bei 29-35, anders wie im Teamspeak.\r\nLaufen mit dem Champ scheint noch möglich, sobald ich aber eine Fähigkeit nutze, macht mein Champ was er will>>läuft rein, bleibt stehn, skillt in falsche Richtungen etc. \r\n\r\nIch habe schon diverse Virenscans gemacht, League reinstalled, diverse Testprogramme zum ermitteln des Problems gemacht, die Versuche bleiben erfolg los. Genau wie diesen Sound den ich beim raustabben höre, finde ich in meinen Systemsounds nirgends.\r\nAuch \"google\" ich in diversen Windows-Foren nach dem Problem, da mein Computer auch nicht mehr das neuste Modell ist..\r\n\r\nLeague of Legends konnte ich bisher immer in mittleren Einstellungen und gelegentlichen kleinen und kurzen FPS dropps spielen..\r\nIch habe auch andere Spiele jetzt in dieser Zeit getestet, teils auch die Grafik höher gestellt nirgends tritt dies Problem auf.. \r\nHabe dazu extra auch auf dem PBE Client nen Account erstellt, dort ebenfalls alles \"flüssig\" also ohne Probleme..ich meine garkeine. \r\nCreativerse/Rocket League/Guildwars2(WvW/PvP) nichts.. weswegen ich mich dann letztenendes doch hier ins Forum gewagt habe..\r\n\r\nHier  noch ein paar Daten zu meinem Bambus Rechner, der laut Bekannten und mir, für Leagueallemal ausreichen sollte...\r\n\r\nDell Optiplex 755\r\n\r\n*System: Windows 7 Home Premium\r\n*CPU:  Intel Core 2 Duo E8500 3,16GHz\r\n*MB: Dell 0GM819\r\n*Speicher 8GB DDR2 \r\n*Grafik: NVIDIA GeForce GT730\r\n\r\n\r\nWoohoo Bamboo... aber mit dem PC lässt sichs noch spielen, klar suche ich schon einen neuen PC, muss aber noch mit diesem Vorlieb nehmen. Vielleicht  hat jemand den ein oder anderen Tipp noch parat, den ich nicht in einem der 100 Win7 Foren hatte. \r\nDa sich das Problem bei Google nur schwer beschreiben lässt. \r\n\r\nZu Mir noch ein paar Kleinigkeiten;\r\n\r\n*Ich bin Spätschichtler und daher meisst Abends bis in die Nacht online\r\n*Spiele seit knapp 3j League, zu beginn sehr viel Aram oder Botgames\r\n*Bin täglich mehrere Stunden online und verbringe hier gerne meinen Feierabend mit meiner Community\r\n*Jeder Modus wird gerne gespielt bevorzugt jedoch Ranglistenspiele (auch wenn ich da noch sehr \"noobig\" bin) ^_^v \r\n*Spiele hauptsächlich League, aber auch einige andere Spiele o.G. und mehr.. Ist Stimmungs bedingt, wobei ein League Game am Abend immer sein muss =)\r\n\r\nBin für jeden Rat und Tipp dankbar zu ermitteln was dieser Sound genau heisst, damit ich dem Problem weiter auf den Grund gehen kann.\r\nFalls nötig kann ich euch auch gerne weitere Infos zukommen lassen.\r\n\r\nmfg Chris / Grumbeerknoll, das Gemüse","replies":[{"poster":"ŁyGhT","date":"2019-10-06T00:48:49.712+0000","up_votes":1,"down_votes":0,"body":"Vielleicht mal den pc aus 1930 ablösen? D:","replies":[]}]}