{"poster":"Jefftiffy","date":"2014-12-12T06:10:31.810+0000","title":"So after playing Rek Sai.","subforum":"Gameplay","up_votes":1,"down_votes":1,"body":"I have been playing her awhile. And I notice a few major problems with her that are really hurting her.\r\n\r\nHer burrowing is more of a hindrance than a buff.  I can't see people unless they stand directly on top of me and if they stand still or you abilities for movement you can't see them.\r\n\r\nHer Q is nice and all in burrowed but you have 0 chase other than opening up tunnels.\r\n\r\nShe has no innate tankiness for engaging what she is supposed to be doing. Her base damages also seem to be very bad considering how poorly she scales.\r\n\r\nHer tunnels give gold for doing nothing but standing on them and denying her movement and ult. Why do you need gold for that? It's like stepping on Zyra seeds and getting 5g. 5g doesn't seem like much but it really adds up.\r\n\r\nShe needs some more chasing and a little bit of tankiness and less incentive to counter play her ult because it is so situational to begin with. It would be nice to get like an extra 50-100% minimum view range in burrowed form, considering you have 0 clue who you are chasing unless you have vision from other sources.","replies":[{"poster":"Jefftiffy","date":"2014-12-12T09:18:45.566+0000","up_votes":1,"down_votes":0,"body":"Another thing I just noticed. She has 5hp/5 at level 6. WTF is that. I know she has a healing passive but less than 1hp/5 per level? Riot...\n\nShe also is very paper no matter how you build her so its almost better to build pure damage and maybe one defense item because she just can't take any hits period. And the only time I ever did well was against a team who wouldn't kill my tunnels. Her burrowed Q does 180 damage at max rank. Just WTF. That is the same damage Lee Sin gets on his which is a lot easier to hit at level 1-2 depending on the hp of who he hits. Her ult is almost never used against competent teams due to them constantly clearing your tunnels and split pushing is near impossible because the most efficient way kills your vision.\n\nYour ult needs to scale more of your kit because you start to fall off hard with how much counter play it offers. I mean you can't use it will taking damage when it would matter, and the tunnels can be removed, plus it has a huge warning of where and when you are doing it.","replies":[]},{"poster":"Mediocre Joe","date":"2014-12-12T06:15:41.017+0000","up_votes":1,"down_votes":0,"body":"I think her burrowing is just fine as is, it is her identity and is a really cool mechanic. I agree with you on the tankiness though they put so much into her damage which I think is fine but she just get melted in team fights no matter how many defensive items she builds","replies":[]},{"poster":"Droogzy","date":"2014-12-12T06:11:07.841+0000","up_votes":1,"down_votes":0,"body":"Yeah just played a game with her...she seems incredibly underwhelming, great kit and great idea, but she's too damn weak and the burrows get taken out too quickly and too easily for them to be useful in the long run.","replies":[]}]}