{"poster":"Drakethehero","date":"2016-12-15T16:55:16.751+0000","title":"LE CRONACHE DI LEAGUE OF LEGENDS","subforum":"Discussioni generali","up_votes":13,"down_votes":3,"body":"Salve a tutti! Alcuni sicuramente si ricorderanno di me o forse no, mentre per altri sar&ograve; di sicuro un perfetto sconosciuto. Non fa niente!\nSono qui a fare questo post perch&eacute; amo questo gioco, amo i campioni e le loro storie, voglio bene persino a yasuo, ma non divaghiamo. \nDi recente ho letto i post di IBOX360 (discussioni al bar) e ovviamente mi ha ucciso dal ridere, si &egrave; trattato di un qualcosa di davvero esilarante e che ha successo dato che continua a postare e ogni post riceve svariati like e commenti positivi.\nDato che io scrivo storie di mio pugno e ho gi&agrave; creato bozze di piccole vicissitudini inerenti i campioni di LOL, ho deciso di seguire l&#039;esempio di IBOX360 che mi ha ispirato a mettere alla prova le mie abilit&agrave; narrative e ho realizzato quello che spero sia l&#039;inizio di una serie avvincente.\nOvviamente, sarete voi a decidere se &egrave; avvincente o meno. Dunque ora posto, per&ograve; prima che leggiate vi faccio una paio di raccomandazioni:\n1) Se siete allergici all&#039;ironia e siete flame dipendenti allora non visionate o commentate il post, grazie;\n2) Laddove legge N.A. sta a indicare Nota dell&#039;Autore;\n3) Se avete idee, suggerimenti o critiche costruttive, prego scrivete pure.\n\nMa ora basta con le chiacchiere e godetevi il frutto del mio lavoro. So che andrebbe alla voce creazioni della community, ma ho paura che possa non essere abbastanza in vista XD.\n\n\n\n                                                                          LE CRONACHE DI LEAGUE OF LEGENDS\n\n                                                                                                 CAPITOLO 1\nIn una tranquilla e soleggiata giornata a Ionia.\nIrelia &egrave; intenta a camminare per le vie del villaggio dove vive, quando un amico di lunga data le viene incontro in tutta fretta e con evidente agitazione.                                      \n-Ciao Lee. Dove vai cos&igrave; di corsa?-.\n-Shhhh! Zitta Irelia! Tu non mi hai visto! Verrano da te! Tu digli che non mi hai visto!-. &egrave; palesemente nel panico.\n-Cosa? Ma che?-. Non riesce a capire come una persona sempre calma e controllata come lui ora sia cos agitata.\n-Shhh! Eccoli! Non dirgli che mi hai visto ti prego. Raccontagli una balla!-.\nIrelia si volta e nota due uomini vestiti con eleganti completi neri e incravattati. \n-Che succede Lee?-.\n-Ti prego fammi questo favore senza chiedere e ti giuro che ti campero la lane per i primi 20 minuti ogni volta che siamo in squadra insieme-.                                                                                                                \nIrelia ci rimugina su qualche istante. &ldquo;Be in fondo venire camperati male non fa&rdquo;. Va bene.             \nLee sparisce in un istante e Irelia viene avvicinata dai due uomini un paio di minuti dopo.\n-Mi scusi lei &egrave; Irelia, giusto? Il volere delle lame-. \n-Sono io, s&igrave;-. \n-Ha visto il signor Lee Sin?-.\n-No. Ma voi chi siete se posso chiedere?-.\n-Siamo dell&rsquo;ufficio assistenza invalidi di Demacia e stiamo indagando su un presunto caso di truffa ai danni dello Stato perpetuata dal signor Lee Sin-.\nIrelia si mostra incredula e non &egrave; una finta. Lee? No, ma dai. Avete delle prove a sostegno di ci&ograve;?\nUno dei due uomini estrae uno smartphone.\n(https://youtu.be/PSD1cJFe9-4)\n-Oh. Accidenti&hellip;&egrave;&hellip;riprovevole-.\n-Esattamente. Se dovesse vedere o sentire il signor Lee Sin, la preghiamo di contattare noi o il nostro ufficio immediatamente-. \n-Ma certo lo far&ograve; senz&rsquo;altro. Queste cose mi danno il voltastomaco-.\nDopo essersi liberata dei due uomini, Irelia si mette in cerca di Lee Sin per ottenere spiegazioni.\n-Lee? Lee!-.\n-Che c&rsquo;&egrave;? Sono andati vero?-.\nRuota gli occhi al cielo. &ndash;S&igrave;, ma mi devi una spiegazione sul perch&eacute; credono che tu sia un falso invalido. Tu sei davvero cieco&hellip;lo sei vero?-.\nLee si passa una mano sulle bende del volto. &ndash;O-ovviamente! C-che domanda sciocca. AHAHAHAH!-. Ride nervosamente.\nGli occhi di Irelia si riducono a due fessure, poi fa un sorrisetto compiaciuto. &ndash;Ti credo. &Egrave; ovvio che non puoi essere un imbroglione, ti conosco. Infatti &egrave; un peccato che ieri tu non abbia visto i capelli tinti di viola di Karma-.  \n-I cosa? Non pu&ograve; essere, stamattina l&rsquo;ho vista e i suoi capelli erano&hellip;oh porco Azir. Senti poss&hellip;-.\n-30 minuti-. Ribatte secca.\n-Cosa?-.\n-Mi camperi per 30 minuti ogni volta che stiamo nella stessa squadra-.  \nLee Sin sospira. &ndash;D&rsquo;accordo-.\n\n\n\n\n\nSempre a Ionia, ma da tutta un&rsquo;altra parte.\n-Con la manovra di oggi saremo pi&ugrave; vicini a sottomettere Ionia una volta per tutte!-. {{champion:122}}  incita le truppe, poi si rivolge a {{champion:27}} . Deve trattenere il fiato per via della puzza emessa dai fumi del folle chimico.\n-Hai un ruolo fondamentale. Le tue&hellip;armi chimiche ci apriranno la strada-.               \nSinged ride di gusto. &ndash;No problem ({{champion:81}} cit.)  Hai scelto l&rsquo;uomo giusto. Avvelener&ograve; tutta la valle e ogni singolo villaggio al suo interno-. Parte nella sua solita corsa e mentre lo fa, stappa il boccione di scorie recuperate da Scampioxus, il quartiere delle discariche abusive di Noxus.                                      \n\n10 minuti pi&ugrave; tardi, stesso luogo.\n\n-LOLOLOLOLOLOLOLOLOLOLO! &Egrave; troppo facile-. Singed ride come un pazzo (effettivamente lo &egrave;).\nA un tratto al rumore ritmico dei suoi passi comincia ad accompagnarsi altro: il suono di calzature di legno e una voce che bestemmia in continuazione. La voce aumenta d&rsquo;intensit&agrave;. A un tratto Singed si rende conto che conosce fin troppo bene il proprietario della voce. Si gira e a momenti inciampa. C&rsquo;&egrave; {{champion:77}}  al suo inseguimento ad una velocit&agrave; incredibile (posizione dell&rsquo;orso (E) + posizione dello scaricatore di porto (MAIUSC). \n-PORCO AZIR! MANNAGGIA A NASUS! CANE RENEKTON! PORCO KINDRED-. (N.A. ho citato solo le cose meno offensive che Udyr stava dicendo XD).\nSinged non decelera e nella sua euforia fa anche lo sbruffone. &ndash;Come fai a correre e bestemmiare al tempo stesso?-. Beve un sorso della pozione magic&hellip;ups&hellip;della pozione della pazzia e prende un bello sprint alla velocit&agrave;.\nDistanzia Udyr inizialmente, per&ograve; poi sente la sua voce ancora pi&ugrave; nitidamente. &ndash;PORCO AZIR!-.           \n\n\nNel frattempo a Shurima, nel palazzo dell&rsquo;imperatore.\n{{champion:268}} -Ecci&ugrave;!-. \n{{champion:15}} -Hai preso il raffreddore? Non credevo che voi ascesi poteste ammalarvi-. Sivir giace sprofondata su una delle eleganti e ben imbottite poltrone del salotto imperiale e afferra un pasticcino nostrano di Shurima da un tavolino l&igrave; accanto.                                                                                              Azir tira su col naso. &ndash;Magari fosse il raffreddore. Quello almeno passa dopo qualche giorno&hellip;Udyr invece non passa mai-.\n\n\n\nDi nuovo a Ionia.\n\n &ndash;FERMATI! PORCO RENEKTON! MANNAGGIA ALLA MAMMA DI NASUS!-.\n{{champion:75}}  &ndash;Mmm. Dev&rsquo;essere proprio incazzato oggi. Ha nominato mia madre pi&ugrave; di dieci volte-.                    \nSinged di certo non ha intenzione di fermarsi. L&rsquo;unica cosa che Udyr fa meglio del correre e pestare a sangue. Tra l&rsquo;altro il suo percorso per avvelenare la valle &egrave; quasi completo. Fermarsi non avrebbe senso.\nAll&rsquo;improvviso la terra inizia a tremare e Singed vede un enorme muro di pietra erigersi da solo tagliandogli la strada. Il muro viene cavalcato da una giovane ragazza dai tratti tipicamente ~~messicani~~&hellip;ehm shurimani.           \nSinged fa appena in tempo a dire &ndash;Mannaggia ad Azir!-. E cerca di frenare, ma invano. Va a sbattere contro il muro e finisce a terra.                                                                                                               &ndash;No-. Riesce a dire fra un gemito e l&rsquo;altro. Nonostante abbia le terminazioni nervose bruciate quella botta l&rsquo;ha sentita.                                     \nA un tratto un&rsquo;ombra cala su di lui e gi&agrave; s&rsquo;immagina il peggio, invece &egrave; Taliyah. &ndash;Per la coda di Nasus! Ti sei fatto male?-.              \nUna confusione che non ha a che fare con la botta s&rsquo;impadronisce di Singed. &ndash;Cosa?-.                                                                                                    &ndash;Ti-ho-chiesto-se-ti-sei-fatto-male-. Taliyah scandisce ogni parole come ad essere certa che capisca.\nLa confusione aumenta. &ndash;Aspetta. Tu non stavi&hellip;cercando di fermarmi?-.                                                                                                                          Ora &egrave; il turno della ragazza di mostrarsi confusa. &ndash;Io? No! Stavo lavorando-. \n-Lavorando?-. \nTaliyha gli passa un bigliettino da visita.\n\nIMPRESA EDILE TALIYAH COSTRUZIONI S.R.L.\nCOSTRUZIONI SOLIDE E DURATURE A PROVA DI ZIGGS\nPER INFO CONTATTARE IL NUMERO 888/ 4571349 (PREFISSO DI SHURIMA)\n\nAncora incredulo Singed torna a guardare Taliyah che lo fissa con aria mortificata e spaventata. &ndash;Ti prego dimmi che non vuoi denunciarmi. Questo &egrave; gi&agrave; il terzo incidente questo mese. Se vengo denunciata di nuovo mi toglieranno il permesso di costruzione! O peggio! Stavolta finir&ograve; anche in tribunale!-.                                                                     \nIl folle chimico continua a fissare Taliyah sempre pi&ugrave; indeciso tra l&rsquo;incazzatura e l&rsquo;incredulit&agrave;. Poi l&rsquo;eco delle bestemmie di Udyr torna prepotente nei suoi timpani. \n-AZIR MAIALE! MANNAGGIA A QUEL PORCO DI RENEKTON!-. \n{{champion:268}} -Eh no. Va bene tutto, ma maiale no-.  \nSinged si rialza a fatica chiedendosi come poteva cavarsela. Non aveva vie di fuga grazie al muro di Taliyha e anche se avesse ricominciato a correre ormai Udyr aveva riguadagnato terreno a suon di bestemmie.   \nL&rsquo;eremita spirituale era a cinquanta metri da lui. Ora vedeva le vene che gli pulsavano sulla tempia e scorgeva l&rsquo;ugola ogni volta che Azir, Nasus o Renekton venivano menzionati.                    \n&ldquo;Ok sono spacciato&rdquo;. Pensa con rassegnazione.\nInaspettatamente un blocco di pietra erutta dal terreno proprio sotto i piedi di Udyr, scagliandolo a diversi chilometri di distanza. \nSinged guarda Taliyah incredulo, mentre lei guarda verso di lui con fare speranzoso. &ndash;Non mi denunci, vero?-.\nSinged fissa di nuovo il biglietto da visita. &ndash;No, no, anzi. Domani ti far&ograve; chiamare da un amico per farti avere un contratto edile a Noxus-.\n\n\n\n\nStesso giorno, all&rsquo;acquapark di Demacia.\n-Ahhhhh! Grazie di avermi offerto questa vacanza Lux. Mi serviva. A Bilgewater &egrave; sempre tutto un via vai di stress, omicidi e vendette personali-.                                       \n\n{{champion:21}} sorseggia un mojito seduta sul bordo piscina con i piedi in acqua.          \n{{champion:99}} &egrave; seduta proprio accanto a lei con un cuba libre. &ndash;Figurati. Noi support e ad carry dobbiamo aiutarci l&rsquo;un l&rsquo;altro-. \nA  MF va di traverso un sorso. &ndash;Ehm Lux? Ne abbiamo gi&agrave; parlato&hellip;Tu non sei un vero support-.                                                                                     E come accade ogni volta che si tocca l&rsquo;argomento, Lux scoppia a piangere. &ndash;Ma ho la Q! Ho la W! CC e utilit&agrave;!-. Pi&ugrave; support di cos&igrave;? {{champion:63}}  viene pickato support molto pi&ugrave; di me! E lui non ha lo scudo e fa molte pi&ugrave; ks!-.                                                                                                                                                         \nMF sospira. &ndash;Non si tratta delle ks-.\nLux fa un verso di scherno. &ndash;Si tratta sempre delle ks-.    \nMentre sono nel pieno della discussione, fa il suo ingresso in piscina un tipo bello, alto, tutto muscoli e con una lunga chioma di capelli fluenti. Delle gemme che gli fluttuano intorno. {{champion:44}} \nMF rimane travolta dalla sua bellezza. -Wow. Quello chi &egrave;? Ha una faccia familiare-.   \nLux guarda nella medesima direzione ed emette un verso di panico. &ndash;Oh mio Azir! &Egrave; Taric!-. Indossa frettolosamente gli occhiali da sole e si d&agrave; una scompigliata ai capelli. \nMF non crede a una sola parola. &ndash;Quello non &egrave; Taric. Non pu&ograve; essere-.           \nMa tu lo sai che &egrave; stato reworkato? Dicono che adesso &egrave; OP-.         \n-Ah s&igrave;? B&egrave; anche il suo personal trainer &egrave; OP&hellip;guarda che addominali-. MF spera di non avere la bava alla bocca. A un tratto nota che Lux sta facendo il possibile per nascondersi dalla vista di Taric. &ndash;Che problema hai?-.                                                                                   \n-Shhh! Ci ha provato con mio fratello! Non &egrave; finita bene. Per l&rsquo;amor di Renekton che vergogna!-.                                                                                   MF riporta gli occhi su Taric sentendo una fitta al cuore. &ndash;Che peccato che non gli piacciano le donne. Ma come &egrave; successa questa cosa con Garen?-.          \n-Frequentavano la stessa palestra-. \n-Ah-.\nEd ecco che Taric viene proprio verso di loro. MF gli sorride radiosa. &ndash;Ciao Taric. Ehi, gran bel rework. Potremmo sperimentarlo uno di questi giorni?-. \nTaric sfodera un sorriso che brilla pi&ugrave; delle sue gemme. &ndash;Grazie del complimento. Accetter&ograve; volentieri-. Poi nota Lux. &ndash;Oh&hellip;ciao Lux-.       \n-C-ciao-. Risponde lei nervosa.\n-Come sta Garen?-. \n-B-bene e&hellip;e&hellip;e mi fa piacere vederti in forma dopo&hellip;dopo quello che &egrave; successo-. \nTaric si fa scuro in volto. &ndash;Scusate, ora devo andare-.            \nMF guarda con le pupille totalmente dilatate il lato b dell&rsquo;uomo mentre se ne va. &ndash;Chiamami per quella duo bot!-. Gli grida dietro con fare sognante. &quot;Oh s&igrave;, la faremo eccome. Tu ingaggi e io ti seguo cos&igrave; potr&ograve; stare l&igrave; a guardare la parte migliore tutto il tempo&quot;. (N.A. Al prezzo di parecchi cs XD).  \nNon appena Taric &egrave; troppo lontano, se la prende con Lux. &ndash;Si pu&ograve; sapere che gli ha fatto Garen?-.\nLux si toglie gli occhiali e la fissa con una seriet&agrave; quasi mortale. &ndash;Rinnegher&ograve; mille volte Azir prima di raccontarlo-.  \n{{champion:268}} -Ti prego no. Gi&agrave; cos&igrave; ho le emicranie-. \n\n\n\n\nContinua&hellip;(forse)\n\nP.S. : pollice in su per chi ha capito il significato del prefisso di Shurima XDDDDD","replies":[{"poster":"iBox360","date":"2016-12-16T18:24:22.582+0000","up_votes":2,"down_votes":0,"body":"Buona sera !\nWow.. sono contentissimo vedere gente che si impegna a far divertire le persone :'D\nBellissimo lavoro fino ad ora ^^, continua così \n\np.s  Mi sono commosso quando hai detto che hai preso esempio da me xD","replies":[{"poster":"Drakethehero","date":"2016-12-16T18:29:37.362+0000","up_votes":1,"down_votes":0,"body":"diciamo che già avevo il materiale, ma non avevo pensato di metterlo sul forum, non ancora, cmq segui la rubrica, ora si chiama Dietro le \"quinte\" di League of Legends, non perdertelo, mentre io non mi perdo niente della tua <3","replies":[]}]},{"poster":"FuryTheFenix ITA","date":"2016-12-15T17:47:29.413+0000","up_votes":1,"down_votes":0,"body":"Un paio di risate me le sono fatte, devi solo mettere un pò di ordine nel testo.\nAspetto la prossima \"puntata\".\n\nP.s. Non dovresti chiedere a Taric di \"sperimentare\" qualcosa....potrebbero esserci effetti collaterali !\nCos'è successo a Garen ? Ahahaha","replies":[{"poster":"Drakethehero","date":"2016-12-15T18:28:13.538+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=FuryLegend1,realm=EUW,application-id=MJVj50Jw,discussion-id=nZfz4oOc,comment-id=0003,timestamp=2016-12-15T17:47:29.413+0000)\n>\n> Un paio di risate me le sono fatte, devi solo mettere un pò di ordine nel testo.\n> Aspetto la prossima &quot;puntata&quot;.\n> \n> P.s. Non dovresti chiedere a Taric di &quot;sperimentare&quot; qualcosa....potrebbero esserci effetti collaterali !\n> Cos&#x27;è successo a Garen ? Ahahaha\n\nGrazie, cmq per risponderti, ho già detto a un altro che nell'anteprima si vedeva così e non potevo farci nulla, cercherò di aggiustare la cosa per la prossima volta.\n\nper quanto riguarda Garen....lo lascio all'immaginazione del singolo lettore per il momento. Forse mi verrà un ispirazione in qualche modo o forse no, non lo so.","replies":[{"poster":"FuryTheFenix ITA","date":"2016-12-15T18:31:39.758+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Drakethehero,realm=EUW,application-id=MJVj50Jw,discussion-id=nZfz4oOc,comment-id=00030000,timestamp=2016-12-15T18:28:13.538+0000)\n>\n> Grazie, cmq per risponderti, ho già detto a un altro che nell&#x27;anteprima si vedeva così e non potevo farci nulla, cercherò di aggiustare la cosa per la prossima volta.\n> \n> per quanto riguarda Garen....lo lascio all&#x27;immaginazione del singolo lettore per il momento. Forse mi verrà un ispirazione in qualche modo o forse no, non lo so.\n\nHa a che fare con \"effetti collaterali\" XD?","replies":[{"poster":"Drakethehero","date":"2016-12-15T18:44:11.994+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=FuryLegend1,realm=EUW,application-id=MJVj50Jw,discussion-id=nZfz4oOc,comment-id=000300000000,timestamp=2016-12-15T18:31:39.758+0000)\n>\n> Ha a che fare con &quot;effetti collaterali&quot; XD?\n\nlol no, si tratta di qualcosa di molto imbarazzante avvenuto quando Taric ci ha provato con Garen. Quest'ultimo per difendere la propria virilità e reputazione etero ha fatto una cosa brutta a Taric, che come si capisce ha lasciato il segno, ma non quel segno che si potrebbe pensare XDDD","replies":[]}]}]}]},{"poster":"ilmejoop","date":"2016-12-17T11:23:31.894+0000","up_votes":1,"down_votes":0,"body":"Purtroppo per taliyah Swain è come Trump, non li vuole i messicani.","replies":[{"poster":"Drakethehero","date":"2016-12-17T14:38:06.971+0000","up_votes":1,"down_votes":0,"body":"lol\nmi raccomando, vai su creazioni della community e leggi gli altri post (il titolo è cambiato in Dietro le \"quinte\" di League of Legends","replies":[]}]},{"poster":"superkey97","date":"2016-12-16T09:50:21.357+0000","up_votes":1,"down_votes":0,"body":"Udyr che và a suon di bestemmie. Sono morto :_)","replies":[{"poster":"Drakethehero","date":"2016-12-16T10:01:50.470+0000","up_votes":1,"down_votes":0,"body":"la posizione dello scaricatore di porto XDDDD","replies":[]}]},{"poster":"Térence Fill","date":"2016-12-15T17:27:11.206+0000","up_votes":1,"down_votes":0,"body":"Allora, è bello.. Però ammetto che quando ho letto \"LE CRONACHE DI LEAGUE OF LEGENDS\" ho pensato di suggerire di buttarsi dentro l'armadio, possibilmente chiudendocisi anche, al prossimo feeder che mi manderà \"a sugo\" una Ranked in meno di 10 minuti! :P","replies":[{"poster":"Drakethehero","date":"2016-12-15T20:58:52.466+0000","up_votes":1,"down_votes":0,"body":"al prossimo feeder che mi manderà &quot;a sugo&quot; una Ranked in meno di 10 minuti! :P\n\nti prego traducimi questa parte del mex, perché dopo dieci volte che l'ho letta ancora non la capisco ahahhahaahahah","replies":[{"poster":"Térence Fill","date":"2016-12-15T21:57:53.264+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Drakethehero,realm=EUW,application-id=MJVj50Jw,discussion-id=nZfz4oOc,comment-id=00020000,timestamp=2016-12-15T20:58:52.466+0000)\n>\n> al prossimo feeder che mi manderà &amp;quot;a sugo&amp;quot; una Ranked in meno di 10 minuti! :P\n> \n> ti prego traducimi questa parte del mex, perché dopo dieci volte che l&#x27;ho letta ancora non la capisco ahahhahaahahah\n\nMandare \"a sugo\" = Mandare in poltiglia = Causare la sconfitta / Far perdere","replies":[{"poster":"Drakethehero","date":"2016-12-15T22:20:13.469+0000","up_votes":1,"down_votes":0,"body":"ahahahahh grazie","replies":[]}]}]}]},{"poster":"TerrorVodka","date":"2016-12-15T21:08:00.482+0000","up_votes":1,"down_votes":0,"body":"mi è piaciuto un sacco, aspetto il seguito\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Drakethehero","date":"2016-12-15T21:19:14.222+0000","up_votes":1,"down_votes":0,"body":"leggi il post che ho messo poco fa!","replies":[]}]},{"poster":"Kim114","date":"2016-12-15T17:19:35.164+0000","up_votes":1,"down_votes":0,"body":"stesso messaggio di Ibox: uno ogni massimo 2 giorni o ti brucio la casa XD","replies":[{"poster":"Drakethehero","date":"2016-12-15T17:37:26.712+0000","up_votes":1,"down_votes":0,"body":"vedrò che posso fare XD","replies":[]}]},{"poster":"GragasTheCatfish","date":"2016-12-15T17:15:54.326+0000","up_votes":1,"down_votes":0,"body":"dovresti essere più ordinato l'idea c'è ma mettendo più spazio e icone (basta guardare l'inizio) sarebbe più piacevole e facile da capire","replies":[{"poster":"Drakethehero","date":"2016-12-15T17:36:57.764+0000","up_votes":1,"down_votes":0,"body":"ci ho provato, ma nell'anteprima continuava a mostrarmelo così, non ho idea del perché, alla fine mi sono arreso e l'ho postato così","replies":[]}]}]}