{"poster":"Wrynn Varian","date":"2016-08-02T18:15:20.240+0000","title":"Leave Buster hülyeségei","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Sziasztok 5x 20 percre ugymond lebannoltak a m&aacute;sodik 20. percn&eacute;l tartottam majd mikor lej&aacute;rt az idő majd valamelyik csapatt&aacute;rsamnak mennie kellett majd kil&eacute;pett a v&aacute;r&oacute;list&aacute;rol akkor a rendszer megint ugy sz&aacute;m&iacute;totta  bele hogy ez m&eacute;g mindig a 2. 20. perc.Teh&aacute;t v&aacute;rhatom m&aacute;r megint ki a 20 percet mert a Riot ezt a rendszert nem gondolta &aacute;t  hogy k&eacute;ne megoldani  ha valakinek mennie kell &eacute;s ez&eacute;rt megint ki kell v&aacute;rni....","replies":[{"poster":"Wrynn Varian","date":"2016-08-04T09:23:04.715+0000","up_votes":1,"down_votes":0,"body":"De ebbe még az a hülyeség hogy ha már ki írja hogy 5xör kell kivárni egy alacsony priorítású listát akkor ha valakinek mennie kell és kilép az eléggé hatnak tűnik ._.","replies":[]},{"poster":"Sylasi Elvtárs","date":"2016-08-02T23:09:13.060+0000","up_votes":1,"down_votes":0,"body":"Igazából, eléggé átgondolta a rendszert. Az a cél, hogy kellemetlenül érezd magad (és a társaid is) amiért miattad kell 20 perceket várni és ezáltal próbál arra sarkallni, hogy ne lépj ki többet. Előfordulhat néha, hogy elmegy a net, vagy áramszünet miatt vagy képtelen folytatni a játékot, de ennek nem szabad rendszeresnek lennie. Szerintem szándékos, hogy nem számolja és nem egy hibáról van szó.","replies":[]},{"poster":"Paax1997","date":"2016-08-02T19:34:51.113+0000","up_votes":1,"down_votes":0,"body":"Nekem jobb volt. Elmentünk rankedezni egy barátommal, és már kezdődött volna meccs amikor a kliensem kiírta, hogy nincs netem, pedig tökre volt és próbáltam visszacsatlakozni, nem ment kiéptem hogy ujraindítsam a klienst, de már elkezdődött a meccs és nem tudtam visszalépni, mert a kliens elkezdte patchelni magát, és a meccs remake-elve lett, és 5x20 perces leaver bustert kaptam... kérdem én ez mi??","replies":[]},{"poster":"Temp65432","date":"2016-08-02T18:23:16.051+0000","up_votes":1,"down_votes":0,"body":"Az elindított menetek számítanak. Amikor valaki kilép a picknél, akkor azt a rendszer nem könyveli el -1nek, csak ha elindult a játék.","replies":[]}]}