{"poster":"diranpanda","date":"2015-04-07T12:14:37.914+0000","title":"Temp Bans on Leavers should have higher consequences on ranked.","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Implement something to effing fix the issue, I&#039;m SICK and TIRED of playing games and having someone effing leave at the start of the game only to lose 23 LP, Then when you win you only get 13, fix your damn system it&#039;s stupid. I don&#039;t mind losing a 5v5 but you&#039;re basically saying it&#039;s ok to AFK cause there is no real punishment, FIX UR S!@# people who do nothing wrong are getting punished for the faults of others.\r\n\r\nhigher consequences, even bans from ranked, just do something  I mean you guys do nothing to fix an issue that has been here since season 1, but you do nothing EVER. You get 1 step ahead and 3 steps backward. I like many other people devote quite a lot of time to play ranked and try and get higher ranks, but it&#039;s not going to happen because regardless of how even the teams are, 4v5, 3v5..ect we get punished for it.\r\n\r\nCan you please just put something in notion to fix it. I mean I just want to know that these people are going to be punished. \r\n\r\nAnd before I get all this stupid hate about people who disconnect. \r\nI DO NOT CARE ABOUT YOUR INTERNET.\r\nIf you are disconnecting EVERY FRIGGEN GAME, you should NOT be playing ranked games. REASONS.\r\n1. You&#039;re screwing up your own LP. \r\n2. You&#039;re screwing up 4 other peoples LP.\r\n3. You&#039;re internet issues are not the other 4 peoples problems hence they should not have to pay for them.\r\n\r\nSolutions for your bad net.\r\nGO TO A FRIGGEN INTERNET CAFE.","replies":[{"poster":"Maraudaur","date":"2015-04-08T01:56:10.560+0000","up_votes":2,"down_votes":0,"body":"Hey DiranPanda,\n\nSounds like you have gone through a few games with Leavers. Really sorry to hear about that. We have a Leaver Buster system in place that punishes players who leave games with Low Priority queue. \n\nYou can read more about Leaver Buster here:\nhttp://oce.leagueoflegends.com/en/news/game-updates/player-behavior/updates-leaverbuster\n\nYou can read more about our player behaviour initiatives here:\nhttp://boards.oce.leagueoflegends.com/en/c/announcements/L65wrRYe-player-behaviour-faq","replies":[{"poster":"diranpanda","date":"2015-04-08T02:21:04.359+0000","up_votes":1,"down_votes":0,"body":"Thankyou, this does make me feel a bit better.","replies":[]}]},{"poster":"Wumachine","date":"2015-04-07T13:07:25.848+0000","up_votes":2,"down_votes":1,"body":"yeah no, if you had lag, you would understand","replies":[{"poster":"diranpanda","date":"2015-04-07T15:07:26.396+0000","up_votes":2,"down_votes":0,"body":"I use to have lag a lot, and I respected my fellow gamers enough not to ruin their ranked games, by not playing them......\nOr when I wanted to play them, go to a net cafe where the net is descent enough to run it.","replies":[]},{"poster":"Doctor Obama","date":"2015-04-08T03:14:40.709+0000","up_votes":1,"down_votes":0,"body":"If you have lag then do not play until the lag stops? Just an idea.","replies":[]}]},{"poster":"Street","date":"2015-04-09T09:40:30.317+0000","up_votes":1,"down_votes":0,"body":"Looks like someone just failed his promos lmao{{summoner:14}}","replies":[]}]}