{"poster":"Mr4L3SSI0","date":"2017-09-10T20:58:08.416+0000","title":"Cerco team","subforum":"Reclutamento","up_votes":2,"down_votes":1,"body":"Ciao a tutti, sono un support main blitz ... b1 in scalata ex silver 4 se non ricordo .. so che a questi livelli &egrave; un po &quot;ridicolo&quot; cercare team .. ma io ci provo .. se qualcuno vuole contattarmi aggiungetemi e scrivetemi ;) grazie per ora","replies":[{"poster":"SHADOWS  GAMER  ","date":"2017-09-14T13:02:31.909+0000","up_votes":1,"down_votes":0,"body":"Sto' cercando gente per il gruppo\\ clan se interessato rispondimi qui' !!","replies":[{"poster":"Mr4L3SSI0","date":"2017-09-14T15:17:30.691+0000","up_votes":1,"down_votes":0,"body":"no grazie sono entrato negli Energy Gaming e per ora rimango qua","replies":[]}]},{"poster":"lMaRco","date":"2017-09-11T20:04:28.266+0000","up_votes":1,"down_votes":0,"body":"http://i66.tinypic.com/2cscd5h.jpg\nHola! Eravamo grandi anni fa e ora dopo un periodo di inattività lo siamo tornati! Circa 200 membri all'attivo e chi esce non è alla nostra altezza ^^\nGli Energy Gaming stanno rinascendo con un organico potenziato sia nell'elo che nell'esperienza!!!\nDetto questo se sei un giocatore interessato a creare un gruppo di amici di qualsiasi elo disposto a creare eventuali team e svagarsi con le custom night, gli Energy Gaming fanno per te :) Altri servizi come l'accademia sono messi a disposizione dei membri che a loro volta se saranno volenterosi potranno mettersi a disposizione per le persone di elo inferiore...\nPer comunicazioni e dialogo siamo UP con un sito con all'interno un forum, un server Teamspeak e un gruppo Whatsapp per rimanere sempre in contatto :D\nNon mi dilungo troppo se siete interessati venite a fare il join con periodo di prova sul forum [www.energygaming.it](http://www.energygaming.it)\n\nA prescindere ci vediamo nella landa!","replies":[]},{"poster":"REV xBlack","date":"2017-09-10T21:43:53.866+0000","up_votes":1,"down_votes":0,"body":"Hai mai pensato di entrare in una community di players??\nCome quella dei R3V3N4NT?\nNon sai chi sono i R3V3N4NT?\n\nMo te lo spiego io.\nI R3V3N4NT danno il benvenuto a tutti quei gamer in cerca di buona compagnia, risate e divertimento.\nLa multygaming &egrave; grande.\nNon siamo presenti solamente su League of Legends ma anche in altri giochi:\nCS\nDiablo\nWarframe\nRaimbow Six\nOverwatch\n... e molto altro ancora.\n\nSiamo aperti a Players di qualsiasi Elo.\nFormiamo Team per Flex e offriamo stanze free su discord per giocare incompagnia, per tutti coloro che vogliano migliorare nei loro Ruoli e inoltre organizziamo tornei interni.\nAbbiamo un canale discord tutto nostro, con tutte le stanze che volete, e se mancano ci fate un fischio e ve la creiamo al volo.\nSe volete farci un salto e parlare e fare una partita con noi siete i benvenuti \nPER MAGGIORI INFORMAZIONI INVIARE LA RICHIESTA DI AMICIZIA A [_**XBLACK99**_](https://euw.op.gg/summoner/userName=xBlack99)\n\nVI ASPETTIAMO IN MOLTI \n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}