{"poster":"ajajajaj sep","date":"2020-02-28T23:47:54.748+0000","title":"Reanudando conexión/Pérdida de paquetes cuando me conecto al servidor de LAS","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"Hola gente, soy yo de nuevo con otro post. Vengo pidiendo ayuda a Soporte de Riot y al Soporte de Telecentro y hasta ahora ninguno de los dos parece tener la culpa de este problema donde los paquetes enviados a la IP de LAS no son recibidos. (Haciendo ping y usando tracert)\r\nEsto lo vengo sufriendo hace unos meses y ahora está peor que antes, pero ninguno de los dos parece ser \"el culpable\" de este problema. He borrado, configurado, probado todo lo posible hasta ahora para corroborar cual es el problema y no tengo suerte.\r\n\r\nAlguien que tenga idea de como enviar correctamente paquetes al servidor? algo para bypassear este problema? Probé conectando el modem directo a la PC (en caso que el router sea el problema) pero aún persistió, por lo que no es eso.\r\n\r\nLiteralmente no puedo jugar y me pone de mal humor porque si juego y me da \"intentando reconectar\" 50 veces en 2 segundos le arruino la partida a otra persona, y lo peor es que ninguno de los soportes sabe como solucionarlo.\r\n\r\nSi alguien está buscando en el foro algo similar seguro use las palabras tracert, ping, pérdida, paquetes, intentando reconectar, etc\r\n\r\nPor favor gente necesito que me salven de esto","replies":[{"poster":"Diegotex123","date":"2020-02-29T07:18:00.393+0000","up_votes":1,"down_votes":0,"body":"https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/OMhNE4jg-posible-solucion-a-desconexiones-en-partida-reanudando-conexian de ultima proba eso man xd y avisame si lo pudiste solucionar suerte xd{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"ajajajaj sep","date":"2020-02-29T15:39:39.021+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Diegotex123,realm=LAS,application-id=X54mVVp0,discussion-id=mR6IWqse,comment-id=0001,timestamp=2020-02-29T07:18:00.393+0000)\n>\n> https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/OMhNE4jg-posible-solucion-a-desconexiones-en-partida-reanudando-conexian de ultima proba eso man xd y avisame si lo pudiste solucionar suerte xd{{sticker:slayer-pantheon-popcorn}}\n\nProbé con eso pero nada :/ sigue pasando y todos los pings/tracert a la IP del server siguen siendo \"Tiempo de espera agotado para esta solicitud.\"","replies":[]}]},{"poster":"iNGENiO","date":"2020-02-29T00:33:58.502+0000","up_votes":1,"down_votes":0,"body":"proba con esto: https://www.getoutfox.com/download","replies":[{"poster":"ajajajaj sep","date":"2020-02-29T01:28:52.230+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iNGENiO,realm=LAS,application-id=X54mVVp0,discussion-id=mR6IWqse,comment-id=0000,timestamp=2020-02-29T00:33:58.502+0000)\n>\n> proba con esto: https://www.getoutfox.com/download\n\nLo que noté con el servidor de Bs As es que me subio el ping a 100","replies":[]}]}]}