{"poster":"Riot Mokarran","date":"2019-12-04T20:56:13.140+0000","title":"Actualización: Caída de FPS","subforum":"Problemas Técnicos","up_votes":32,"down_votes":14,"body":"Hey gente, \r\n\r\nHubo un microparche en la madrugada de ayer con una modificación al código del juego que ha resuelto este problema para algunos usuarios. Sin embargo todavía no tenemos algo que funcione para todos. Tenemos un equipo trabajando a esto en desarrollo, y quisiera pedirle a la gente que sigue con problemas respondan con sus specs y sistema operativo.\r\n\r\nCon llenar el siguiente formato ayudarían mucho.\r\n\r\nProcesador:\r\nRAM:\r\nTarjeta de Video:\r\nOS: \r\nProblema: (No cambia nada/Se arreglo el problema de FPS pero se sigue congelando/No se caen los FPS pero se crashea el juego)\r\n\r\nGracias!","replies":[{"poster":"Riot Mokarran","date":"2020-01-23T17:50:53.944+0000","up_votes":4,"down_votes":3,"body":"Actualización: Hey gente, quiero agradecer a todos los que nos compartieron sus specs. El equipo de ingeniería no ha parado de trabajar en esto desde la ultima update, y hay buen progreso pero no una solución completa todavía. Se seguirán hacendo modificaciones dentro de cada parche, pero el trabajo no ha terminado ni estamos contentos con la situación actual.","replies":[{"poster":"EL HUMILDE v2","date":"2020-01-23T18:16:34.395+0000","up_votes":2,"down_votes":0,"body":"entonces van a dejar que el error siga por más parches.\n{{item:3340}}  nice","replies":[{"poster":"Riot Mokarran","date":"2020-01-23T18:40:47.311+0000","up_votes":2,"down_votes":1,"body":"No vamos a dejar, es tristemente donde nos encontramos pues no tenemos una solución todavía. Es como encontrar una vacuna, no queremos dejar a la gente enferma, pero hasta no encontrar esa cura no podemos hacer nada.","replies":[{"poster":"BaIdur","date":"2020-01-24T03:42:20.282+0000","up_votes":4,"down_votes":0,"body":"Colocar la antigua Grieta quizás? {{summoner:4}}","replies":[{"poster":"Natchin","date":"2020-01-27T02:49:24.238+0000","up_votes":3,"down_votes":0,"body":"y revertir a akali","replies":[]}]},{"poster":"Nidhoggur Shadow","date":"2020-02-04T09:21:36.894+0000","up_votes":3,"down_votes":0,"body":"china decodificó el gen del corona virus en como 2 dìas, y movió cartas en el asunto y el país fue aislado en como 1 dìa, encontraron como 14 posibles orígenes, y los llevan investigando desde que empezó todo eso. Por eso me pregunto, de verdad tienen la gente competente para reparar este tipo de problemas en el servidor?, lo pregunto, porque el juego sigue lleno de bugs , como azir por ej, que tenia varios, y estuvieron desde que salio y siguen la gran mayoría hasta el dìa de hoy xd, los problemas con los bugsplat siguen, la gente la siguen botando de las partidas, las caidas de fps, etcetcetc. De verdad son cosas que ya han pasado mas de una vez, y la cantidad de bugs y problemas que tiene el LoL actualmente solo lo igualan juego recién salidos. No me hace sentido que después de tantos años muchos no han sido resueltos, quizás necesitan un cambio de gabinete...{{sticker:cass-cry}}","replies":[]},{"poster":"PROYECTO ELO","date":"2020-02-04T01:58:40.213+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot Mokarran,realm=LAS,application-id=X54mVVp0,discussion-id=ZwrZY10R,comment-id=00fe00000000,timestamp=2020-01-23T18:40:47.311+0000)\n>\n> No vamos a dejar, es tristemente donde nos encontramos pues no tenemos una solución todavía. Es como encontrar una vacuna, no queremos dejar a la gente enferma, pero hasta no encontrar esa cura no podemos hacer nada.\n\nno pueden dejarnos asi, tienen un buen juego no lo arruinen por cosas como estas","replies":[]}]}]},{"poster":"LaBananaDeLimon","date":"2020-02-03T19:16:20.652+0000","up_votes":2,"down_votes":0,"body":"Es bueno ver que no se han olvidado del tema {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Tak Tak Duken","date":"2019-12-05T03:37:32.635+0000","up_votes":12,"down_votes":0,"body":"Los FPS se solucionaron pero ahora se crashea al minuto 10, una bien cada 3 meses y 50 mal","replies":[]},{"poster":"Lar1","date":"2019-12-04T21:03:50.065+0000","up_votes":10,"down_votes":0,"body":"HOLA!, me parece muy bien que esten tomando cartas en el asuntos y ya con soluciones. Se pide por favor tambien revisar el problema de \"REANUDANDO CONEXIÓN\", soy uno de los jugadores perjudicados con este problema que es externo a nuestras pc o routers. Si ven el foro hay muchos jugadores quejandose de esto y no nos han dicho nada. Solo pedimos que nos lean y escuche. Muchas gracias.\n\npd: tambien he mandado ticket y sin ninguna respuesta y vuelvo a repetir como a muchos de acá.","replies":[]},{"poster":"elerok","date":"2019-12-10T03:38:14.676+0000","up_votes":5,"down_votes":0,"body":"LOCO YO JUGABA ANTES CON 170 a 180 FPS ESTABLES AHORA NO PUEDO MOVER LA CAMARA QUE SE BAJAN EN PICADA HASTA 02 FPS \nRIOT ARREGLEN ESTO !! NO PUEDEN TENER EL JUEGO TAN MAL OPTIMIZADO!!","replies":[]},{"poster":"Happy Tragedy","date":"2019-12-09T01:44:36.435+0000","up_votes":5,"down_votes":0,"body":"Procesador: Intel (R) Core (TM) i7-2620M CPU @ 2.70GHz 2.70GHz\nRAM: 8,00GB\nTarjeta de Video: Intel (R) HD Graphics 3000\nOS: Windows 7 Professional 64 bits (6.1, compilación 7601)\nProblema: No cambia nada (los FPS se me caen repentinamente o son muy bajos, no más de 15).","replies":[]},{"poster":"LeeSinHabilidad","date":"2019-12-04T21:13:16.784+0000","up_votes":5,"down_votes":0,"body":"Procesador: Ryzen 5 2600\nRAM: 16\nTarjeta de Video: gtx 1650\nOS: W10 \nProblema: Se fueron todos los problemas pero no volvieron los FPS de antes. Si activo v-sync hay caída de FPS en baron y  dragon. Si es de viento se nota mas. Stuttering \n\nProcesador: A6 6400K\nRAM: 8\nTarjeta de Video: 8470\nOS: W10\nProblema: No se congela pero se caen los FPS cuando abro la tienda o la tabla de puntuaciones ( weird shit )","replies":[{"poster":"Rahmann","date":"2019-12-06T21:42:37.242+0000","up_votes":2,"down_votes":0,"body":"Como es posible que tengas stuttering con una GTX1650","replies":[{"poster":"LeeSinHabilidad","date":"2019-12-10T16:58:33.560+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Rahmann,realm=LAS,application-id=X54mVVp0,discussion-id=ZwrZY10R,comment-id=00020000,timestamp=2019-12-06T21:42:37.242+0000)\n>\n> Como es posible que tengas stuttering con una GTX1650\n\nEsa misma pregunta me hago","replies":[]}]}]},{"poster":"FNC Brizu","date":"2019-12-11T03:33:29.858+0000","up_votes":4,"down_votes":0,"body":"Procesador: AMD A10-5800K APU with Radeon(tm) HD Graphics  4.20 Ghz\nRAM: 4,00GB Single-Channel DDR3 @ 665MHz (9-9-9-24)\nTarjeta de Video: 512MB ATI AMD Radeon HD 7660D (ASRock) es integrada\nOS: Windows 10 Pro 64-bit\n\nProblema: desde que metieron el Parche de Pre Season se rompio todo el juego, que ni re instalandolo funciona bien, apenas puedo jugar al tft a -25 /-13 fps, antes lo jugaba a muchísimos mas, lo mismo con el lol en todo alto menos las sombras me iba a +80 ahora ni en full bajos me pasa de los 30.  Insisto en que no es mi PC por que practicamente antes me andaba de 10 el lol.","replies":[]},{"poster":"Pig Ripper","date":"2019-12-11T01:37:22.818+0000","up_votes":4,"down_votes":0,"body":"Procesador:Intel(R) Pentium(R) CPU B960 @ 2.20GHz (2 CPUs), ~2.2GHz\nRAM:8,00GB\nTarjeta de Video: Intel (R) HD Graphics\nOS: Windows 10 Pro for Workstations 64-bit \nProblema:  NO SE SOLUCIONA EL PROBLEMA DE FPS","replies":[]},{"poster":"wintermoon","date":"2019-12-11T00:24:35.697+0000","up_votes":4,"down_votes":0,"body":"Procesador: Amd Athlon 2 nucleos 3,0ghz\nRAM: 4\nTarjeta: AMD Radeon R7 250\nOS: W8.1\n\nProblema: bajones de fps, no cambió nada con el mini parche","replies":[]},{"poster":"Lukesitoc","date":"2020-01-05T02:06:23.269+0000","up_votes":3,"down_votes":0,"body":"EU LOCO TMB DISCULPEN LAS MAYUSCULAS PERO ES EL COLMO POSTA, MI PC NO ES TAN MIERDA, ANTES EL JUEGO ME IBA DE 10 Y AHORA EN ESTOS MESES ANDA PASANDO ESTO, DE 10 PARTIDAS 3 SE ME CRASHEAN, LAS OTRAS 7 AL MINUTO 8,10, 0 11 SIEMPRE SE CRASHEA, Y HAY TIRONES DEL ASCO, PORFA RESUELVAN ESTO, TENGO 30 FPS PERO JUSTO A ESOS MINUTOS SE VA A LA MIERDA TODO, HOY SE ME CRASHEO Y TENGO COLA DE 20 MINUTOS, PORFA DENLE BOLA A ESTO RIOT, SE LOS PIDO, ES INJUGABLE","replies":[]},{"poster":"Luguber","date":"2019-12-09T23:36:58.148+0000","up_votes":3,"down_votes":0,"body":"¿Sirve de algo decir las especificaciones de nuestras computadoras?. ¿Siquiera lo leen o es un pobre intento de decir \"Los estamos escuchando\"?. Ya pasaron unos 5 dias de gente diciendo sus especificaciones y todavía no han mejorado nada.","replies":[]},{"poster":"Missy Purita","date":"2019-12-06T18:22:18.686+0000","up_votes":3,"down_votes":0,"body":"Para mí sigue igual y peor...","replies":[]},{"poster":"KylorRen","date":"2020-02-03T01:06:40.408+0000","up_votes":2,"down_votes":0,"body":"Procesador: inter Core i 7 \nRAM:16 gb\nTarjeta: Radeon 4gb\nMac os\n\nMe bajan los FPS de 200 a 12 haga lo que haga. Así los ponga en lo mínimo o lo sincronice","replies":[]},{"poster":"PePeSapeee","date":"2020-01-22T01:31:20.837+0000","up_votes":2,"down_votes":0,"body":"GG fps muchachos, todavia tengo el problema.","replies":[]},{"poster":"XXTHUNDERX","date":"2020-01-17T01:08:43.601+0000","up_votes":2,"down_votes":0,"body":"YO SEGUÍ TODOS LOS CONSEJOS PARA ARREGLAR LOL, PERO ME SIGUE YENDO A 2 FPS, PERO MI PING ES BAJO","replies":[]},{"poster":"Abulafia","date":"2020-01-15T15:56:50.693+0000","up_votes":2,"down_votes":0,"body":"Arreglen el fucking problema o me desinstalo el juego. Harta de perder bro... Ya no sé más qué hacer. Desinstalé, actualicé, borré programas por posibles conflictos, probé distintas configuraciones en los gráficos y hasta los bajé AL MÍNIMO y siguen bajando los fps aleatoriamente hasta hacerlo INJUGABLE. 25, 17, 11, 04, 02, 01 fps, reanudando conexión. WTF!? Alguien haga algo. Ya van más de 2 semanas con este problema. Antes podía jugar sin problemas en la mejor resolución y ahora directamente no se puede.\n\nProcesador: **INTEL CORE i7 - 7500U CPU - 2.70 GHz 2.90 GHz**\nRAM: **8 GB**\nTarjeta de Video: **Intel HD Graphics 620**\nOS: **Win 10 64 bit**\nProblema: Lo descrito arriba. \n\nGracias","replies":[]},{"poster":"RG 4RTISTA","date":"2020-01-09T06:20:04.999+0000","up_votes":2,"down_votes":0,"body":"Alguna novedad? El juego sigue igual de mal!","replies":[]},{"poster":"Painless","date":"2019-12-31T17:39:11.199+0000","up_votes":2,"down_votes":0,"body":"Procesador: AMD A9-9420 RADEON R5, 5 COMPUTE CORES 2C+3G\nRAM: 8 gb\nTarjeta de Video: ATI AMD Radeon(TM) R8 M535DX (dedicada)/ATI AMD Radeon(TM) R5 Graphics(integrada)\nOS: windows 10 home 64 bit\nProblema: tengo bajones de fps por momentos breves en la partida (de 60 fps baja a 10 fps y luego sube a 60 de nuevo) ,hay veces que juego partidas a 30 fps como maximo, tengo configurado todo al minimo para que ande lo mas fluido posible pero aun así no sirve. ya probe todas las posibilidades y sigo siempre con el mismo problema","replies":[]},{"poster":"Juandejunin","date":"2019-12-30T02:54:51.348+0000","up_votes":2,"down_votes":0,"body":"RIOT BASTAAA HERMANOO.. desde la ultima actualizacion me anda para atras, me sube el lag a 250 en adelante, siempre juego con 80-100ms y ahora de repente suben a 250 + , me bajan los fps, me saca del juego y tira un cartelito de error... viejo cada vez q actualizan joden todo hermano... pero sacan champ y skin ultimamente que da calambre.... dediquense a un mejor servicio tecnico en lugar de tantas skin para lucrar...","replies":[]},{"poster":"CRISTOXG21","date":"2019-12-27T10:23:59.089+0000","up_votes":1,"down_votes":0,"body":"Riot Mokarran al final hay alguna noticia nueva?, se sabe algo? o que onda\ntodavía sigo teniendo inconvenientes con los fps\nsaludos desde argentina san juan.","replies":[{"poster":"Luguber","date":"2019-12-27T16:28:18.093+0000","up_votes":2,"down_votes":0,"body":"Lo mas probable es que ya hayan dejado de intentar arreglarlo. No les pagan lo suficiente parece.","replies":[]}]},{"poster":"ZeinK","date":"2019-12-21T23:05:44.345+0000","up_votes":2,"down_votes":0,"body":"Ya me tiene podrido ese system error más de  2 semanas qe tira el mismo error dejen de joder loco","replies":[]},{"poster":"yOCobain","date":"2019-12-16T19:44:54.756+0000","up_votes":1,"down_votes":0,"body":"No tengo acá mismo las especificaciones de mi notebook pero a ciencia cierta te puedo resumir como funcionaba antes de que comience el problema hace ya casi 3 meses:\n\n**Antes del parche ~~del terror xD~~: **\n\n**FPS:** 36/40 fps fijos con todo bajo (tengo notebook y no muy moderna que digamos, pero el LOL siempre corrio bien).\n**En TFs:** Bajaba a 25 pero es a lo que estaba acostumbrado, siempre pude jugar así sin problemas.\n**Con buff de dragon ancestral:** Acá si, siempre me bajaron los FPS horriblemente cada vez que aparecía el efecto del fueguito en el personaje (durante la TF 5v5, sino no había drama...bajaba algo pero no molestaba).\n\n**Después del parche:**\n\n**FPS:** 36/40 únicamente al principio de la partida. Cuando aplicaron el parche polémico aquel, se me freezeaba el juego por +-3 segundos en momentos aleatorios. la partida arrancaba así pero despues cuando caia una vez, ya los fps quedaban bajos masomenos a 25... y en peleas o incluso solo en farmeo de JG o linea, 14 (y bajones a 04 o 06)... \n\nAhora ya no se freezea como hace algunas semanas (y meses). Pero bajan los FPS en momentos totalmente random, puedo estar simplemente farmeando jungla (que siempre anduvo así a +-25/30fps de media) y de la nada mientras hago exactamente lo mismo, bajan a **06 FPS CERO SEISSSSSSSSS**. Cuando voy a hacer un gank, a veces no pasa nada, y sale todo barbaro, y otras tantas (muchisimas) veces, el juego baja los FPS a +-04/06 fps, una locura. No puedo hacer nada, en lo que muevo un poco la cámara cagué... el mouse no me reacciona en tiempo real por lo que es pésimo a la hora de tomar decisiones en una fight... es muy perjudicial.\n\nA ver, no tengo la super PC, claro está, y se que en casos como este, tener una PC viejita no ayuda, pero antes de todo este lío, podía hacer un gank, jugar una TF, y no tenía el más mínimo problema, no se si me explico... no debería haber cambiado tan drasticamente la experiencia un parche, si el motor gráfico del juego es el mismo. Luego con el freeze de pantalla, listo, date por muerto... \n\n...y ahora el freeze no está, es decir que alguna mejoría realmente hubo, pero siguen bajando horrendamente los FPS, perjudicando aún la jugabilidad... Se entiende? Mi PC me juego las bolas que no es... no es la gran cosa pero el LOL lo tiene que correr dentro de todo bien. Con todo al minimo sumado al \"lowspec experience\" va como trompada... bah, debería...porque con todo este tema, claramente, ya no xD\n\n**Otros datos de color:**\nSO: Win7 32bit\nProcesador: Doble nucleo 2puntoalgo (xD).\nVideo: Incorporado de Intel, no recuerdo bien de cuanto, pero insisto, nunca tuve drama.\nRAM: 2GB DDR2.\n\n\nGracias.,\nSaludos!","replies":[{"poster":"lolbit","date":"2019-12-16T20:06:16.756+0000","up_votes":2,"down_votes":0,"body":"Hola!. \nA mí me pasaba igual era un horror en tf o en linea, mi notebook suele andar bien en 29 30 fps(se nota lo viejita que es xd). Pero, hay un post anclado en ¨problemas técnicos¨ donde hay una ¨solución¨, que a mí me funciono y los fps no se me bajan tan bruscamente. La solución en cuestión es min.config, en el enlace que el soporte deja explica muy bien como ejecutar cada paso.\nFijate quizás te funciona, espero que si, saludos :D.","replies":[]}]},{"poster":"Tak Tak Duken","date":"2019-12-16T12:33:05.565+0000","up_votes":2,"down_votes":0,"body":"Como se que es 100% que va a andar mal solo juego aram o tft y si quiero jugar a la grieta tengo que poner cooperativo vs AI para que no me reporten!","replies":[]},{"poster":"Osiito Teddy","date":"2019-12-13T08:30:32.168+0000","up_votes":2,"down_votes":0,"body":"se vive crasheando todos los games ni rankear se puede","replies":[]},{"poster":"Miadcmiente","date":"2019-12-11T00:07:56.371+0000","up_votes":2,"down_votes":0,"body":"Procesador: Intel(R) Core(TM) i5-8300H CPU @ 2.30\nRAM: 8,00 GB \nTarjeta de Video: NVIDIA GeForce GTX 1050 Ti\nOS: Windows 10 Home Single Language\nProblema: No cambia nada","replies":[]},{"poster":"Blinded By Light","date":"2019-12-10T17:30:53.824+0000","up_votes":2,"down_votes":0,"body":"Procesador: intel(r) celeron(r) cpu b820 @ 1.70ghz 1.70 ghz\nRAM: 5GB\nGrafica: intel r hd graphics \njugaba de 60 fps a 80 y pasaron de 40 a 20 xd\n{{sticker:sg-soraka}}","replies":[]},{"poster":"xXSpYraLXx","date":"2019-12-10T13:23:29.791+0000","up_votes":2,"down_votes":0,"body":"Procesador: AMD Phenom II x6 1055 2.8Gh\nRAM: 8GB\nTarjeta de Video: AMD 7770 core 1Gb\nOS: Windows 10\nProblema: Caida de fps (comienzo la partida con 130/150 dps y al rato empiezan las caidas a 16 a 20 (durante toda la partida) y despues no sube a mas de 60 en toda la partida )","replies":[]},{"poster":"pankukà","date":"2019-12-10T11:43:33.278+0000","up_votes":2,"down_votes":0,"body":"Procesador: AMD A4 4400\nRAM: 8 Gb\nTarjeta de Video: AMD Radeon HD 7480D\nOS: Windows 7 Pro\nProblema: Se me suben los ms y los fps bajan y al cabo de un rato el juego se crashea","replies":[]},{"poster":"La Decadencia","date":"2019-12-10T06:23:31.805+0000","up_votes":2,"down_votes":0,"body":"Procesador: A6 7400K 3.5 GHZ\nRam : DDR3 1600 4 Gb\nTarjeta de Video: R5 512Mb integrada.\nOS: Windows 10 pro 64\nEl problema es frizeos desde el minuto 2 por algunos segundos, los fps bajan a 30 y pico incluso sin estar en TF","replies":[]},{"poster":"ChibiCheeks","date":"2019-12-10T02:44:00.292+0000","up_votes":2,"down_votes":0,"body":"Procesador: Intel Core i5-5200U\nRAM: 4gb\nTarjeta de Video: NVIDIA Geforce 940 M\nOS:w10\nProblema: en todas las teamfights los fps caen a 05 , y sin teamfight son 60?... que ocurre aqui ? >.>","replies":[]},{"poster":"UnSmiling","date":"2019-12-10T00:35:35.097+0000","up_votes":2,"down_votes":0,"body":"Procesador: A10-7850K\nRAM: 8gb HyperX 1866\nTarjeta de Video: GPU R7\nOS:W10\nProblema: FPS DROP","replies":[]},{"poster":"The Ice Dagger","date":"2019-12-09T23:09:29.369+0000","up_votes":2,"down_votes":0,"body":"Procesador: intel(R) core(TM) i3-4005U CPU @ 1.70ghz\nRam: 4GB\nSistema Operativo: 64 Bits\nOS: W10\nTarjeta de Video:Intel(R) HD Graphics Family\nProblema: No Cambia, aun se Bajan los Fps y se congela","replies":[]},{"poster":"VaiperFit","date":"2019-12-09T20:18:01.413+0000","up_votes":2,"down_votes":0,"body":"Procesador: Pentium(R) Dual-Core CPU\nT4300 @ 2.10GHz 2.1 GHz\n\nRam: 2 GB\n\nTarjeta de Video: Mobile Intel(R) GMA 4500M\n\nOS: Windows 7 Enterprise 32 Bits\n\nProblema: Se crashea el juego en ciertos minutos de partida y los FPS se caen constantemente\n\nEspero su respuesta y solución al problema planteado.","replies":[]},{"poster":"0VNl","date":"2019-12-09T20:01:15.404+0000","up_votes":2,"down_votes":0,"body":"Procesador: i5 2500k 3.3\nRAM: 8 gb\nTarjeta de Video: placa madre\nOS: window 7\nProblema: ping estable, fps de 60 a menos de 20","replies":[]},{"poster":"zetaaaah","date":"2019-12-05T02:22:19.895+0000","up_votes":2,"down_votes":0,"body":"ram: 4gb \n\nprocesador: celeron N3060 1.60 Ghz \n\ntarjeta: intel hd graphics 400\n \nos: windows 10 64bit\n\n\nbajones de fps (llega hasta 0 fps) en cualquier situacion","replies":[]},{"poster":"Cysne","date":"2019-12-07T23:59:47.045+0000","up_votes":2,"down_votes":1,"body":"Viendo la cantidad de gente quejandose con diferentes pcs de clases variadas podemos certificar que el problema es de ustedes, y tienen o no la posibilidad de remediarlo. No hagan que intentan ayudar... ayuden.","replies":[]},{"poster":"KooltraxD","date":"2020-03-03T00:53:59.513+0000","up_votes":1,"down_votes":0,"body":"LA CONCHA DE TU MADRE YA VAN 4 MESES LA PUTA QUE TE PARIÓ, HAGAN ALGO LOCO, SI NO LO VAN A ARREGLAR PONGAN QUE EL JUEGO NECESITA MÁS REQUISITOS ","replies":[]},{"poster":"Voy Contigo Pipo","date":"2020-02-26T14:34:46.430+0000","up_votes":1,"down_votes":0,"body":"Procesador: Intel core I7  - 6700hq\nRAM: 16Gb\nTarjeta de Video: NVIDIA GeForce GTX 950 -- Intel HD Graphics 530\nOS: Win 10\nProblema: pasa de estar a 120 fps estables a bajar a 5-15fps por como 5-7 segundos","replies":[]}]}