{"poster":"Furan Fate","date":"2016-11-27T07:45:06.997+0000","title":"The draven","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Hola buenas, antes que todo quiero se&ntilde;alar que este post va dirigido a los main Draven, a quienes lo conozcan y est&eacute;n acostumbrados al personaje.\r\n\r\nPara empezar, contarles que soy un jugador de Draven en progreso, estoy con intenci&oacute;n de mainearlo en bot y mid.\r\n\r\nTengo un par de dudas sobre la composici&oacute;n en cuanto a items y runas, y sobre las situaciones en las que me servir&iacute;a cada una.\r\n\r\nPor ejemplo, &iquest;qu&eacute; diferencia de da&ntilde;o tengo al empezar con Filo del Infinito o con Yoummu como first item? &iquest;Yoummu sigue siendo tan viable como antes del nerfeo? &iquest;Filo es la mejor opci&oacute;n de da&ntilde;o? &iquest;Qu&eacute; tan viable es armarle full criticos y Attack Speed o armarle full Ad y letalidad? &iquest;en qu&eacute; situaciones conviene cada composici&oacute;n?\r\n&iquest;Contra qu&eacute; tipo de enemigos sirve la espada del rey? &iquest;es una locura armarla?\r\n\r\nSobre armarlo, s&eacute; armarlo, y no lo armo siempre igual. Pero tengo esas dudas, sobre algunos items que quiz&aacute;, solo quiz&aacute;, por ciertos porcentajes o situaciones den m&aacute;s da&ntilde;o a mi juego.\r\n\r\nOtra duda, era sobre las runas, &iquest;conviene m&aacute;s quintas de as y glifos de resistencia? &iquest;o quintas de da&ntilde;o y glifos de as? &iquest;letalidad o da&ntilde;o en las marcas?\r\n\r\nY eso, si tienen sugerencias, y alg&uacute;n consejo para mejorar lo agradecer&iacute;a. Espero puedan resolver mis dudas.\r\n\r\nGracias de antemano. &lt;3","replies":[{"poster":"Gretta Thunberg","date":"2016-11-27T16:22:13.996+0000","up_votes":1,"down_votes":0,"body":"primero el filo te conviene mucho ahora ya que esos criticos seran rikines la yomu esta nerfeada la gracias era la velocidad de ataque pero bueee. antes la diferencia de daño la compensada la activa ahora te conviene mucho mas el filin.\nfull criticos no te conviene por que pierdes daño mejor infiti, rapid fire canon/statick/bailarin y un saqueador de escencias despues puedes irte por una sanguinaria en caso de tener muchos tank 2 o mas en el equipo rival ultimo suspiro y espada de rey en caso de haber muchos tankes te recomiendo la espada por que es muy caro el last whisper te la recomiendo mucho en todas las partidas en vez de buscar los extremos (full criticos o full letalidad) busca el centro y por ejemplo si hay mucho cc te viene muy bien la cimitarra y si no pues la sanguinaria, si hay un mundo te conviene la llamada del verdugo, y hay campeones que no se recuperan pero tiene mucha vida el otro recuerdo de lord me entiendes todo es cirscuntacial a la partida pero si quieres tener un gran impacto en la partida desde early buen farm y el filin core","replies":[]},{"poster":"Lucio22","date":"2016-11-27T08:03:02.147+0000","up_votes":1,"down_votes":0,"body":"no se por que, pero no me gusto nunca la arpen llana (hoy llamada letalidad), siempre preferi el porcentaje. debe ser porque, salvo que no tengan casi nada de armor, te sirve mucho mas el porcentaje de arpen (que, con la mastery y una last whisper, llegas como al 53%)","replies":[{"poster":"Furan Fate","date":"2016-11-27T10:12:50.266+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lucio22,realm=LAS,application-id=v7qsfXsE,discussion-id=vIf39dyE,comment-id=0000,timestamp=2016-11-27T08:03:02.147+0000)\n>\n> no se por que, pero no me gusto nunca la arpen llana (hoy llamada letalidad), siempre preferi el porcentaje. debe ser porque, salvo que no tengan casi nada de armor, te sirve mucho mas el porcentaje de arpen (que, con la mastery y una last whisper, llegas como al 53%)\n\n¿el porcentaje? ¿a qué te refieres específicamente?","replies":[{"poster":"Lucio22","date":"2016-11-27T15:13:17.408+0000","up_votes":1,"down_votes":0,"body":"Al last whisper, que da 35% de arpen. Después de mejorarlo (o bien al mortal reminder o al rojo) aumenta el porcentaje ese (creo que es 45%)","replies":[{"poster":"Furan Fate","date":"2016-11-27T16:10:40.474+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lucio22,realm=LAS,application-id=v7qsfXsE,discussion-id=vIf39dyE,comment-id=000000000000,timestamp=2016-11-27T15:13:17.408+0000)\n>\n> Al last whisper, que da 35% de arpen. Después de mejorarlo (o bien al mortal reminder o al rojo) aumenta el porcentaje ese (creo que es 45%)\n\nAhhh vale, creí que hablabas de runas, por eso pregunté jajajjaja Sí, suelo hacerme ese item generalmente","replies":[]}]}]}]}]}