{"poster":"AtmXas","date":"2016-07-25T10:53:44.053+0000","title":"20 Minuten-Sperren und trotzdem weiter leaven (ungewollt)","subforum":"Hilfe & Support","up_votes":1,"down_votes":4,"body":"Hallo LoL-Community!\r\n\r\nMein PC hat einen Hardwareschaden, ich wei&szlig; aber nicht wo und ich br&auml;uchte ein paar Tage um dieses Problem dann zu l&ouml;sen.\r\nMein PC st&uuml;rzt beim Spielen manchmal ab, sodass ich mehr als drei Minuten brauche, um wieder ins Spiel zu kommen.\r\nIch habe schon eine 20 Minutensperre, was kommt, wenn mein PC noch ein paar mal abst&uuml;rzt?\r\nDas ist nat&uuml;rlich ungewollt, ich m&ouml;chte aber trotzdem grade nicht aufs Spielen verzichten, 1-2 Spiele gehen immer!\r\n\r\nMfG\r\nAtmXas","replies":[{"poster":"Time2Whine","date":"2016-07-25T11:00:31.745+0000","up_votes":1,"down_votes":0,"body":"Wenn dein PC so unzuverlässig läuft, solltest du LoL pausieren, da eine funktionsfähige Hardware zum Spielen vorrausgesetzt wird. Spielst du weiterhin mit diesen Problemen, werden die nächsten Strafen (länger terminierte Sperren) nicht mehr lange auf sich warten lassen. \nRiot übernimmt keine Verantwortung für die Hardwareprobleme der Spieler !","replies":[{"poster":"xXBoldronXx","date":"2016-07-25T12:57:52.822+0000","up_votes":1,"down_votes":0,"body":"Der 20 min ban ist die Höchste Strafe des leaverbusters soweit ich weiß. Sollte man in den 5 Spielen aber nochmal leaven werden die Spiele halt wieder auf 5 gesetzt. Damit meine ich wenn ich im letzten Spiel der 5 leave habe ich die 5 games nunmal wieder^^","replies":[]}]},{"poster":"DanionVibit","date":"2016-07-25T11:04:58.986+0000","up_votes":1,"down_votes":0,"body":"Wenn du Hilfe willst solltest du schon mehr Infos geben.\n\n-> Wie stürzt dein Rechner ab (Bluescreen, einfach aus, freeze u.s.w.) ?\n-> Sind alle Treiber auf dem aktuellsten Stand ?\n-> Was für Hardware ist verbaut ?\n-> Existiert der Fehler nur bei LoL?\n-> Sonstige Informationen ? (Antivirus etc.)\n\nFerndiagnose ist schon schwer genug, aber ohne Infos unmöglich :)","replies":[]}]}