{"poster":"Errør 404","date":"2018-07-19T08:02:06.211+0000","title":"MEMES: Van a agregar iconos de Youtubers que no suben contenido de League of Legends!","subforum":"Charlas Generales","up_votes":17,"down_votes":2,"body":"#Un meme dice mas que mil palabras: \n\nhttps://imgur.com/YzA4PtL\n\n#Mientras tanto, en las oficinas de Riot Games: \nhttps://imgur.com/iEJcRr8\n\nhttps://www.youtube.com/watch?v=xafIDuoJPHI\n\n######PD: /all gg wp report rito ","replies":[{"poster":"exrex","date":"2018-07-19T10:52:29.630+0000","up_votes":14,"down_votes":2,"body":"Aca yo creo que los creadores de contenido españoles estan dejando pasar por alto a propósito  el hecho de que riot ya los  habia llamado varias veces para realizar ciertos eventos, incluso los invitaron a las oficinas de dublin. Es decir, no es que nunca hicieron nada por ellos...  \nAparte de que hablan como si riot les debiera algo cuando ellos viven de riot y se hicieron conocidos gracias al lol. No al revés. \nPor ejemplo, quien es coolife sin el lol? Siempre se lo incluyo en los eventos y ahora anda llorando en twitter como si nunca hubiera visto a un rioter... \n\nMe molesta esa actitud \"demandante\", eso de  \"y para mi que hay?\" , porque encima otro tema, estos chabones se ponen en papel de victima, pero cuando riot los contacta quieren que les paguen para participar, pero esta parte no la dicen.  \n\nAhora en LATAM no recuerdo que youtubers hayan sido invitados a algo. No estoy seguro.","replies":[{"poster":"Bienzahar","date":"2018-07-19T14:08:13.911+0000","up_votes":6,"down_votes":3,"body":"Y Jacky ya se fue al forntnite, juega al lol solo cuando va a hacer un vídeo y poco o nada. Sus videos últimamente son muy aburridos y los hace solo por el dinero, muchos clips son relleno que no tienen nada interesante o entretenido que mostrar.\nPor ultimo, si quiere que le saquen un icono que dedique más tiempo al lol y deje de ser tan mediocre xD","replies":[{"poster":"Nuke","date":"2018-07-19T15:27:41.770+0000","up_votes":3,"down_votes":10,"body":"> Sus videos últimamente son muy aburridos y los hace solo por el dinero\n\n¿Subjetividad? ¿DÓNDE?\nNo podés saberlo. Ninguna de las 2 cosas. \nY mira que yo dejé de verlo hace mas o menos calculo 1 año y medio. Pero lo tuyo es especulación y subjetividad pura.\n Me parece repulsivo tirar mierd*  a otros inventándote cosas de él.  \n\nQue sepas que hay mucha gente (en promedio vi que tiene 300.000 visitas por video) que ama lo que hace, que participa en sus episodios y disfruta de su contenido.","replies":[{"poster":"Bienzahar","date":"2018-07-19T18:49:45.425+0000","up_votes":3,"down_votes":0,"body":"Lo ha dicho muchas veces en video y en directos, lo hace ver como que esta cansado de todo lo que es el lol, de hecho hay un video donde habla concretamente del dinero extra que alcanzo a llevarse solo por poner clips de relleno.\nEntonces, si, creo que es objetivo mi punto de vista.","replies":[{"poster":"Nuke","date":"2018-07-19T19:20:54.426+0000","up_votes":1,"down_votes":0,"body":"> de hecho hay un video donde habla concretamente del dinero extra que alcanzo a llevarse solo por poner clips de relleno.\n\nPasá el link de ese video entonces.","replies":[{"poster":"Bienzahar","date":"2018-07-19T19:36:52.799+0000","up_votes":1,"down_votes":4,"body":"www.google.com","replies":[{"poster":"Nuke","date":"2018-07-19T20:52:57.942+0000","up_votes":2,"down_votes":0,"body":"Entonces... ¿No existe? ¿Te lo inventaste? No entiendo.","replies":[{"poster":"Bienzahar","date":"2018-07-19T20:55:04.954+0000","up_votes":1,"down_votes":1,"body":"www.youtube.com","replies":[]}]},{"poster":"bombastico","date":"2018-07-20T03:45:00.077+0000","up_votes":1,"down_votes":0,"body":"Espero que en la universidad no pongas eso como bibliografia en tus trabajos xD","replies":[{"poster":"Bienzahar","date":"2018-07-20T12:21:18.734+0000","up_votes":1,"down_votes":0,"body":"Nah, es cosa de buscar, acá yo no hago un trabajo xD","replies":[]}]}]}]}]}]}]},{"poster":"Ellora","date":"2018-07-19T21:10:46.057+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=exrex,realm=LAS,application-id=v7qsfXsE,discussion-id=4YEMaAEJ,comment-id=0001,timestamp=2018-07-19T10:52:29.630+0000)\n>\n> Aca yo creo que los creadores de contenido españoles estan dejando pasar por alto a propósito  el hecho de que riot ya los  habia llamado varias veces para realizar ciertos eventos, incluso los invitaron a las oficinas de dublin. Es decir, no es que nunca hicieron nada por ellos...  \n> Aparte de que hablan como si riot les debiera algo cuando ellos viven de riot y se hicieron conocidos gracias al lol. No al revés. \n> Por ejemplo, quien es coolife sin el lol? Siempre se lo incluyo en los eventos y ahora anda llorando en twitter como si nunca hubiera visto a un rioter... \n> \n> Me molesta esa actitud &quot;demandante&quot;, eso de  &quot;y para mi que hay?&quot; , porque encima otro tema, estos chabones se ponen en papel de victima, pero cuando riot los contacta quieren que les paguen para participar, pero esta parte no la dicen.  \n> \n> Ahora en LATAM no recuerdo que youtubers hayan sido invitados a algo. No estoy seguro.\n\nNo te consfundas, ellos crecieron gracias al lol, pero el juego tambien crecio gracias a ellos. Muchos de creadores de contenido laburaron muy bien, con videos divertidos, didacticos, etc.. eso alimento muchisimo al juego.\n\nLo que si queda claro es lo que todos especulabamos, la medida \"desesperada\" de buscar nuevo jugadores (y no de los mejores para la comunidad) significa que hay numeros en lol que no estan bien.","replies":[]}]},{"poster":"Yitán","date":"2018-07-19T17:23:51.680+0000","up_votes":6,"down_votes":0,"body":"malisimos los iconos, la verdad que hasta diria que pateticos","replies":[{"poster":"Fedefoxa","date":"2018-07-19T20:53:41.412+0000","up_votes":1,"down_votes":0,"body":"no creo que cueste nada hacer esos iconos la verdad","replies":[]},{"poster":"Ode to dark","date":"2018-07-19T20:17:28.354+0000","up_votes":1,"down_votes":0,"body":"Por no decir que es una táctica publicitaria penosa. Al menos que rito disimule la desesperación.","replies":[]}]},{"poster":"Sir Crucifix ","date":"2018-07-19T14:10:24.232+0000","up_votes":5,"down_votes":0,"body":"Vayan a laburar !!!","replies":[]},{"poster":"Jinxie","date":"2018-07-19T18:44:31.741+0000","up_votes":4,"down_votes":0,"body":"pero madre mia que haces aqui willy compañero","replies":[]},{"poster":"NS HaruDragneel","date":"2018-07-19T14:52:36.999+0000","up_votes":4,"down_votes":0,"body":"más pete y careta es ese Adrelina xD aguante GatitaMimosa, ese sí que tiene carisma >:v\n\ny falta el Messi de la jungla NeckoLol v:<","replies":[{"poster":"Sir Crucifix ","date":"2018-07-19T15:00:42.047+0000","up_votes":1,"down_votes":1,"body":"Na es un asco ese , juega ww y dice que sabe jugar","replies":[{"poster":"Nuke","date":"2018-07-19T19:22:23.902+0000","up_votes":1,"down_votes":1,"body":"¿Juega solo Warwick? Lo único que se de ese tipo es que es Challenger... Si eso no es saber jugar, ya me dirás tu.","replies":[{"poster":"Sir Crucifix ","date":"2018-07-19T21:11:44.646+0000","up_votes":2,"down_votes":1,"body":"Puede ser . no lo sigo . se que es un forro y un fanfarron . por eso no lo veo","replies":[]}]},{"poster":"Kiu Yaoi","date":"2018-07-19T17:48:00.904+0000","up_votes":1,"down_votes":2,"body":"No te metas con Neckito kappita","replies":[{"poster":"Sir Crucifix ","date":"2018-07-19T18:08:31.359+0000","up_votes":2,"down_votes":2,"body":"yo soy sir crucifix y me puedo meter con quien YO quiera ","replies":[]}]}]},{"poster":"lllHeisenberglll","date":"2018-07-20T00:22:04.542+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HaruDragneel90,realm=LAS,application-id=v7qsfXsE,discussion-id=4YEMaAEJ,comment-id=0004,timestamp=2018-07-19T14:52:36.999+0000)\n>\n> más pete y careta es ese Adrelina xD aguante GatitaMimosa, ese sí que tiene carisma &gt;:v\n> \n> y falta el Messi de la jungla NeckoLol v:&lt;\n\nSon un complemento, funcionan juntos. Separados muy poco. Y hablo por ambos eh","replies":[]}]},{"poster":"ToxicRunner","date":"2018-07-19T09:47:56.445+0000","up_votes":6,"down_votes":2,"body":"Uff.. ese icono de adre 💕👀","replies":[{"poster":"Nuke","date":"2018-07-19T15:26:28.463+0000","up_votes":1,"down_votes":0,"body":"Es el de su canal xD","replies":[]}]},{"poster":"Cuchufleitor","date":"2018-07-19T16:28:46.414+0000","up_votes":3,"down_votes":0,"body":"Es que lo hacen para meter gente nueva seguramente. No van a conseguir gente nueva promocionandose en canales que ve gente que ya juega al LOL. Aunque creo que seria acertado que en un futuro proximo agreguen iconos de streamers ya que me gustaria tener algunos de ellos =)","replies":[]},{"poster":"Distimia","date":"2018-07-19T16:01:36.926+0000","up_votes":2,"down_votes":0,"body":"Esto es fácil, el fortnite les está ganando en publicidad y realmente no hay ninguno de los \"grandes\" de habla hispana que juegue lol, si prestas atención  (o si no tenes adblocker xD) te darás cuenta que hay nuevas publicidades del lol, y no es casualidad. \n\nFortnite es un juego que se estableció pagando a los \"grandes\" y a los no tan influyentes para que hagan contenido del juego, Riot nunca le pagó a nadie para que hiciera ese tipo de contenido porque era un juego ya establecido dado que salió en el 2009. La pura verdad es que se dejaron estar, pensaron que iban a tener a sus jugadores para siempre y se dieron cuenta recién ahora de que no es así, entonces decidieron traer nuevos jugadores contratando personas influyentes y que en su mayoría su contenido es para gente joven, ojo, no niños sino gente joven desde los 14 hasta los 24 años tal vez, no sé si Riot esté apuntando a menores de esa edad.\n\nPero la pregunta acá es **¿Realmente esta comunidad es capaz de recibir jugadores nuevos?** ¿Estamos preparados para recibirlos amistosamente? Ayer mismo leí un thread de una persona que decía que era nueva y que le tocaban personas con experiencia que sólo la insultaban.\nTal vez no está mal que quieran publicitar el juego trayendo gente más influyente para que suba contenido, pero tal vez Riot debería pensar si quiere que esta comunidad los reciba, muchos de ellos son sensibles a las palabras de todos (sobre todo willyrex, que no quiso asistir al torneo de fortnite porque no quería \"problemas\" o cruzarse con gente que le cae mal) <- tal vez en una partida (si es que juegan) le toquen personas tóxicas y se lo piense si realmente quiere hacer algo con Riot y su comunidad.\n\nA pesar de todo, espero que seamos capaces de recibirlos bien (aunque ya hay muchísima gente quejándose) y que quien dice tal vez se queden un tiempo y le alarguen la vida al juego que parche a parche está decayendo.","replies":[]},{"poster":"Hell Darking","date":"2018-07-19T19:57:21.882+0000","up_votes":1,"down_votes":0,"body":"Alguien se dio el tiempo de leer lo que se subio al pbe? riot esta haciendo \"campaña\" con youtubers ajenos al mundo de league of legends para que su publico que no juega, se interese y venga a probar el juego\nes netamente por eso\nimaginate un niño que sigue a \"pepito777\" va a ver que en lol hay un icono de su youtuber favorito y vendra a jugar para comprar el icono (eso ya seria un jugador mas) imaginen todos esos youtubers que tienen millones de subs.. mas de alguno vendra a jugar aca\na eso apuntan los iconos que sacaran","replies":[{"poster":"Jörmündgandr","date":"2018-07-20T00:29:03.713+0000","up_votes":1,"down_votes":0,"body":"si ya habian montones de ratitas imaginate el apocalipsis que se vendra ahora...","replies":[]}]},{"poster":"LaChopi","date":"2018-07-19T21:42:01.987+0000","up_votes":1,"down_votes":0,"body":"La idea mas patética que han sacado.. xD","replies":[]},{"poster":"Ode to dark","date":"2018-07-19T20:16:49.039+0000","up_votes":1,"down_votes":0,"body":"RIto por favor, te estás volviendo patético :'v","replies":[]},{"poster":"Icesoul","date":"2018-07-19T15:52:04.079+0000","up_votes":1,"down_votes":0,"body":"Yo sabia que el juego estaba muriendo hace tiempo, pero atraer nuevo publico con iconos de youtubers...me soprende lo mal que debe estar el juego como para que hagan esto.\nEn cuanto a quien le den la oportunidad de poner su icono no me interesa, el comentario de \"exrex\" ya explica lo que pienso.\nSaludos.","replies":[]},{"poster":"fenixerege","date":"2018-07-19T12:21:47.795+0000","up_votes":1,"down_votes":0,"body":"son como toda persona tienen intereses en dar algo por recibir, y eso es normal.......","replies":[]},{"poster":"PússySlap","date":"2018-07-20T05:22:43.916+0000","up_votes":1,"down_votes":1,"body":"yo quiero uno de auron q pasa todo bien? todo correcto? y yo q me alegro jajaja","replies":[]},{"poster":"Neltharium","date":"2018-07-20T03:42:26.593+0000","up_votes":1,"down_votes":2,"body":"En vez de solucionar el emparejamiento basura que hay , en vez de descontarle PL al troll que se lo merece (ya que no lo van a banear) y tratar de no descontarle PL al que se re esforzó y hizo una partida inmejorable en el caso de uno que saque 'S-' o más , en vez de fijarse en la gente de solo Q , quieren atraer gente con esto jajaaj la verdad da licenciados en marketing o licenciados en idiota diría yo , poco a poco está siendo opacado por el fortnite y les duele que ya no sean el juego 1 pero no ven el verdadero problema que es ese ayudar a la gente de Solo Q mejorar los emparejamientos y no descontar para la gente que se re esfuerza loltyler1 subió un stream haciendo más daño y tankeando mas daño, haciendo ver que es una basura el meta , y eso que loltyler1 le paga riot para que stremee LoL , riot nosé en que piensa, bueno ya fueron números 1 durante tanto tiempo y los dueños super millonarios le deben chupar ya un huevo el juego , este juego vuelvo a decir no va a desaparecer pero 1 o 2 años y van a tener menos de la mitad de gente activa. El problema siempre fueron las rankeds lo que es lo atrapante del juego (no divertido) , divertido son las Urf ,hoy en día rankear es una mierda y de los 30 amigos que solía tener conectados con suerte veo 5 , sigan disfrazando al LoL pero está cayendo de a poco.","replies":[]},{"poster":"elfoks","date":"2018-07-19T22:27:56.267+0000","up_votes":1,"down_votes":2,"body":"me cag en jota no se queria ver cosas interesantes y veo esta miard* na deslike youtube y aqui puf ,no se subi videos a youtube pero no arruines la comunidad con tu pinche video. {{sticker:slayer-jinx-unamused}}","replies":[]}]}