{"poster":"Errør 404","date":"2018-05-29T08:59:58.042+0000","title":"Que linda noche que estoy pasando :'v","subforum":"Comportamiento del jugador","up_votes":19,"down_votes":4,"body":"https://imgur.com/kFsAsXI\r\n\r\nPara el colmo era una normal, donde se supone que uno prueba champs y eso... El tipo parece que esperaba que sea M7 o algo as&iacute; :&#039;v","replies":[{"poster":"Squaah","date":"2018-05-29T14:26:57.309+0000","up_votes":9,"down_votes":24,"body":"\"probar champ\" la tipica para salir 1/12 arruinarle la partida a todo tu equipo y obviamente que te vas a comer report.\nAdemas me imagino lo habilidoso que sos en el juego. Cuando yo pruebo campeón mi kd nunca es menor a 1. Farmear bajo torre, no pushear, jugar con la vision, jugar con tu jg, son cosas que los elos bajos no entienden","replies":[{"poster":"Ketfess","date":"2018-05-29T15:42:33.560+0000","up_votes":12,"down_votes":1,"body":"Elo bajo dices, eres plata 1 señor high elo.","replies":[]},{"poster":"BMG Sofia","date":"2018-05-29T16:12:57.335+0000","up_votes":7,"down_votes":2,"body":"Alto topo Silver sos, en las normales no ganas ni perdes nada no es como antes (antes te daban un poco mas de pi) no hay motivo para flamear, si queres jugar en serio con gente que juega enserio rankea, encima ''elo bajo'' decís...sos plata 1, si supieras jugar como decís no estarías ahí y lo de no es mi cuenta ya esta quemado ni te gastes.\nanda a ver unas guías salí de plata después veni a frontear por jugar bien.\n{{sticker:slayer-jinx-wink}} \n\n","replies":[{"poster":"Nerf Aery","date":"2018-05-29T18:06:10.138+0000","up_votes":1,"down_votes":0,"body":"Yo si puedo frontear?","replies":[]}]},{"poster":"Uli con azúcar","date":"2018-05-29T15:21:29.185+0000","up_votes":6,"down_votes":0,"body":"Igual tiene el mismo elo que vos xd","replies":[]},{"poster":"Marx we need you","date":"2018-05-29T17:43:12.992+0000","up_votes":1,"down_votes":0,"body":"Por gente como tú el juego está como está, no diré nada más.","replies":[]},{"poster":"MasterRightClick","date":"2018-05-29T15:56:18.091+0000","up_votes":7,"down_votes":1,"body":"En serio le decis low elo cuando tiene el mismo elo que vos? ._. Ni caradura","replies":[]},{"poster":"Nuke","date":"2018-05-29T18:14:13.780+0000","up_votes":1,"down_votes":0,"body":"AYYY BUENO CHALLENGER NOS CALMAMOS","replies":[]},{"poster":" Virtuous Violet","date":"2018-05-29T17:27:33.100+0000","up_votes":2,"down_votes":1,"body":"Me haces acordar a los tipicos plata V que le andan diciendo manco a cualquier bronce que ven. Replanteate un poco el creerte superior. Siempre habra gente que juegue mejor que tu y si no es asi, sera mejor que tu en otra cosa del juego. Tal vez wardees bien pero no sepas cuando tradear y otra persona si lo haga. He visto gente que juega mejor, estando en bronce que gente que juega en oro. Y eso del low elo es bastante abstracto, para un challenger 400 lp un d3 va a ser low elo ya que se juega muy diferente el juego entre lo que es d3-d1 y master-chall.\nNi siquiera esta planteando eso en el post el tipo este. Creo que estas un poco frustrado con tus partidas y te dejas llevar por tus emociones tipicas aunque si no es asi te faltaria un poco de comprension lectora. Relee el post cuando estes mas calmo, tal vez asi encuentres otro punto de vista","replies":[]},{"poster":"Nisman on bush","date":"2018-05-29T18:27:59.448+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Squaah,realm=LAS,application-id=PJAKt7ph,discussion-id=sTowz3GH,comment-id=0004,timestamp=2018-05-29T14:26:57.309+0000)\n>\n> &quot;probar champ&quot; la tipica para salir 1/12 arruinarle la partida a todo tu equipo y obviamente que te vas a comer report.\n> Ademas me imagino lo habilidoso que sos en el juego. Cuando yo pruebo campeón mi kd nunca es menor a 1. Farmear bajo torre, no pushear, jugar con la vision, jugar con tu jg, son cosas que los elos bajos no entienden\n\ndesde cuando plata 1 es high elo?  xD xd xD","replies":[]},{"poster":"vaVav","date":"2018-05-29T16:12:43.972+0000","up_votes":2,"down_votes":2,"body":"Plata 1","replies":[]}]},{"poster":"BluDémon","date":"2018-05-29T12:43:21.907+0000","up_votes":3,"down_votes":3,"body":"porque les borras los nombres? xd , escrachalos , a todos los toxicos hay que hacerles lo mismo, aver si de una vez por todas los banean","replies":[{"poster":"Súper Top","date":"2018-05-29T13:32:27.055+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=BluDémon,realm=LAS,application-id=PJAKt7ph,discussion-id=sTowz3GH,comment-id=0002,timestamp=2018-05-29T12:43:21.907+0000)\n>\n> porque les borras los nombres? xd , escrachalos , a todos los toxicos hay que hacerles lo mismo, aver si de una vez por todas los banean\n\n No está permitido en las reglas del Foro, solo se puede poner nombres de invocador si es por una buena causa, nunca escrachando.","replies":[]},{"poster":"TeamSayori","date":"2018-05-29T19:06:00.322+0000","up_votes":1,"down_votes":0,"body":"va contra las reglas, te lo borran si escrachas","replies":[]}]},{"poster":"TheWense","date":"2018-05-29T09:39:36.824+0000","up_votes":6,"down_votes":41,"body":"Práctica con bots weeta,si te flamean bien me parece para que aprendas a no cargar partidas","replies":[{"poster":"Koffy","date":"2018-05-29T10:48:23.547+0000","up_votes":7,"down_votes":3,"body":"Haber man tu cuando vas a probar un champ lo haces en normales no? Pprque bot no es mas que practica para los qie aun no se saben las reglas eso no demuestra la emocion de una partida 100% real por eso se prueba en normales","replies":[{"poster":"Vandta26","date":"2018-05-29T11:21:01.116+0000","up_votes":6,"down_votes":15,"body":"> [{quoted}](name=koffy04,realm=LAS,application-id=PJAKt7ph,discussion-id=sTowz3GH,comment-id=00000000,timestamp=2018-05-29T10:48:23.547+0000)\n>\n> Haber man tu cuando vas a probar un champ lo haces en normales no? Pprque bot no es mas que practica para los qie aun no se saben las reglas eso no demuestra la emocion de una partida 100% real por eso se prueba en normales\n\nEstas muy equivocado, LoL tiene diferentes modos de juegos y secciones para que puedas practicar campeones, por ejemplo se implento la herramienta de practica en donde uno puede poner bots y muñecos.. Ahora, si bien vos decis que probas campeones en las partidas de tipo normal quiere decir que seguro jugas en aram o modo rank, que pasa si yo, un jugador que solo le gusta el modo normal digo -ah, quiero probar un campeon en el modo rank- no creo que te guste pero te vas a tener que callar y asimilar ya que como bien decis, yo puedo tomar el modo rank para probar campeones, eso usando la logica tuya y la de unos cuantos. \nLoL tiene su seccion de practica, si queres probar campeones usalas, no vengas con eso de que -ay, quiero probar un campeon asi que lo voy a llevar a normal- por que hay gente que solo juega ese tipo de juego y no le cae para nada bien que un tipo vaya y por un capricho le haga perder la partida, no, hay secciones que fueron creadas para esos casos. \nAhora por otro lado, si te flammean tenes la opcion de silencio de chat y el reporte al final para que lo utilices","replies":[{"poster":"BMG Sofia","date":"2018-05-29T16:18:58.801+0000","up_votes":8,"down_votes":1,"body":"EL BOT es para niveles 1-10, la herramienta de practica solo sirve para combos  una que otra cosa.\nLa mejor manera de aprender es jugando contra jugadores reales, en las normales no ganas ni perdes nada no veo cual seria el problema de probar campeones dado que una derrota es lo mismo que una victoria.","replies":[]},{"poster":"Tortuguita","date":"2018-05-29T20:31:06.736+0000","up_votes":1,"down_votes":1,"body":"No, los bots solamente pueden darte lo mínimo de nociones básicas,cuando luchar contra gente real es casi todo el abanico de experiencia que podrías recibir para aprender como interactúa el champ frente a ellos. Cuando vas a normales se tiene que tener por lo menos las bases... y digo las bases como moverse y pegarle a los minions xD","replies":[{"poster":"Errør 404","date":"2018-05-29T22:18:02.594+0000","up_votes":1,"down_votes":2,"body":"Tu nick me parece familiar... ¿vos fuiste challenger hace unas season o algo así?","replies":[{"poster":"Tortuguita","date":"2018-05-29T22:29:35.583+0000","up_votes":1,"down_votes":0,"body":"Me encantaría pero no, solamente fui Maestro 200 puntos la season anterior, apunto de ascender y tuvo que dejarlo por temas personales qwq","replies":[]}]}]},{"poster":"LaPapitaRica","date":"2018-05-29T14:24:47.200+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Vandevil,realm=LAS,application-id=PJAKt7ph,discussion-id=sTowz3GH,comment-id=000000000000,timestamp=2018-05-29T11:21:01.116+0000)\n>\n> Estas muy equivocado, LoL tiene diferentes modos de juegos y secciones para que puedas practicar campeones, por ejemplo se implento la herramienta de practica en donde uno puede poner bots y muñecos.. Ahora, si bien vos decis que probas campeones en las partidas de tipo normal quiere decir que seguro jugas en aram o modo rank, que pasa si yo, un jugador que solo le gusta el modo normal digo -ah, quiero probar un campeon en el modo rank- no creo que te guste pero te vas a tener que callar y asimilar ya que como bien decis, yo puedo tomar el modo rank para probar campeones, eso usando la logica tuya y la de unos cuantos. \n> LoL tiene su seccion de practica, si queres probar campeones usalas, no vengas con eso de que -ay, quiero probar un campeon asi que lo voy a llevar a normal- por que hay gente que solo juega ese tipo de juego y no le cae para nada bien que un tipo vaya y por un capricho le haga perder la partida, no, hay secciones que fueron creadas para esos casos. \n> Ahora por otro lado, si te flammean tenes la opcion de silencio de chat y el reporte al final para que lo utilices\n\nPracticar un champ en la herramienta de practica puede ser, pero lo veo muy difícil, primero que todo porque no es lo mismo la inteligencia empleada en un bot, que la inteligencia de una persona controlando al campeón, segundo la experiencia de juego es diferente son 10 jugadores conectados en una partida que se comunican, en cambio un bot no se va a comunicar con vos, y eso lo de probar campeones en clasificatoria simplemente no te va a dar resultado porque no vas a tener una experiencia positiva, no se que tanto se quejan de perder una normal donde no te afecta en nada, en cambio en una clasificatoria si tenes el derecho porque tenes mucho en juego pero en una normal no.","replies":[]},{"poster":"Súper Top","date":"2018-05-29T13:31:23.959+0000","up_votes":1,"down_votes":1,"body":"\n Nada quita que puedas tener una mala partida, hayas practicado o no. y sí, las normals están para \"practicar\" para ranked, si no te sientes seguro con un campeón lo llevas a normal hasta masterizarlo, o dime tú, ¿Nunca jugaste un campeón por primera vez/no dominado en normal? es como si te obligasen a jugar tus mains.","replies":[]},{"poster":"lololes","date":"2018-05-29T19:46:37.809+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Vandevil,realm=LAS,application-id=PJAKt7ph,discussion-id=sTowz3GH,comment-id=000000000000,timestamp=2018-05-29T11:21:01.116+0000)\n>\n> Estas muy equivocado, LoL tiene diferentes modos de juegos y secciones para que puedas practicar campeones, por ejemplo se implento la herramienta de practica en donde uno puede poner bots y muñecos.. Ahora, si bien vos decis que probas campeones en las partidas de tipo normal quiere decir que seguro jugas en aram o modo rank, que pasa si yo, un jugador que solo le gusta el modo normal digo -ah, quiero probar un campeon en el modo rank- no creo que te guste pero te vas a tener que callar y asimilar ya que como bien decis, yo puedo tomar el modo rank para probar campeones, eso usando la logica tuya y la de unos cuantos. \n> LoL tiene su seccion de practica, si queres probar campeones usalas, no vengas con eso de que -ay, quiero probar un campeon asi que lo voy a llevar a normal- por que hay gente que solo juega ese tipo de juego y no le cae para nada bien que un tipo vaya y por un capricho le haga perder la partida, no, hay secciones que fueron creadas para esos casos. \n> Ahora por otro lado, si te flammean tenes la opcion de silencio de chat y el reporte al final para que lo utilices\n\nTotalmente de acuerdo.","replies":[]},{"poster":"Koffy","date":"2018-06-03T15:42:16.833+0000","up_votes":1,"down_votes":0,"body":"Eso igual no daria derecho a que te manden a callar de esa forma y jugar con bots, como dije anteriormente los bots no demuestran una pelea 100% real porque da lo mismo si no sabes como jugar con un campeon, ganaras igual esa partida. Ademas yo nunca meti las rankeds para probar campeones porque eso ya es motivo de report por usar a un campeon con el que no estas familiarizado. \nLa herramienta de practica es lo mismo solo que puedes modificar la partida añadiendole bots aumentando el dinero sin cd y cosas asi pero ami no me sirve jugar contra la maquina que nisiquiera sabe lo que hace","replies":[]}]},{"poster":"Akalimaster","date":"2018-05-29T20:02:24.979+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=koffy04,realm=LAS,application-id=PJAKt7ph,discussion-id=sTowz3GH,comment-id=00000000,timestamp=2018-05-29T10:48:23.547+0000)\n>\n> Haber man tu cuando vas a probar un champ lo haces en normales no? Pprque bot no es mas que practica para los qie aun no se saben las reglas eso no demuestra la emocion de una partida 100% real por eso se prueba en normales\n\nNo, lo pruebas en la herramienta de practica o bots (Aunque sea 1 o 2 partidas) y luego lo practicas en normales como siempre se suele hacer, no estaría de mas también ver un poco su win-rate/Build/runas/counters Etc en alguna pagina, como por ejemplo Champion.GG o algún vídeo didáctico. ¿Porque se suele hacer esto? no sirve de nada ir directamente a una normal donde casi todos van a practicar para ranked con sus mejores campeones y tu con un campeon el cual no conoces ni sus mecánicas o su capacidad de daño, no vas a aprender nada del campeón, lo máximo que vas a llevarte es una stompeada en tu linea y de paso arruinarle la partida a otras 4 personas que estarían practicando enserio.","replies":[]},{"poster":"WhiteMax","date":"2018-05-29T13:51:41.866+0000","up_votes":4,"down_votes":2,"body":"Los campeones se prueban en bots y se practican en normales","replies":[{"poster":"Sebasaurio REX","date":"2018-05-29T15:59:16.097+0000","up_votes":2,"down_votes":2,"body":"como dice el amigo los campeones se prueban contra bots, luego que ya tienes lo básico de como funcionan sus habilidades etc, puedes practicar en normales el tema variar las runas para las diversas situaciones o lineas donde lo vas a usar, pero mínimo ya teniendo el conocimiento básico de como se usa el campeón y como se puede armar  que se obtiene practicando una o dos paridas contra bots","replies":[]}]}]},{"poster":"Waninoko Main","date":"2018-05-29T14:39:21.816+0000","up_votes":1,"down_votes":1,"body":"Y si ya practicó contra bots y en la herramienta de práctica ¿que le queda? pues jugar normales obviamente. ¿Qué pasa si justo prueba un TOP y le toca contra alguien que juega bien? pues que va a estar en desventaja obviamente. No se puede carrear todas las partidas.","replies":[]}]},{"poster":"SShadowj","date":"2018-05-29T14:15:56.041+0000","up_votes":2,"down_votes":0,"body":"\"Estoy haciendoo mejor que puedo\"....\n PERO HACE MÁS LA CONCH* DE TU MADRE.\n\n Okno.\n\n Ahora enserio, que gente loco xD. Hipocresía hay para tirar al techo en este juego jajaja.","replies":[]},{"poster":"Agent Edgar Ross","date":"2018-05-30T13:34:23.588+0000","up_votes":2,"down_votes":1,"body":"Una vez probe Katarina en mid(porque no quedo otra linea), 1/6 creo que sali, todo el equipo flammeandome y amenazandome. Yo solo estaba probando a Katarina pero ellos no entendieron{{sticker:cass-cry}}","replies":[]},{"poster":"L9 Letalis Umbra","date":"2018-05-29T22:34:53.819+0000","up_votes":2,"down_votes":1,"body":"Es chistoso como subes una imágen llorando por un flameo pero tu de lo más bien que spameas cosas innecesarias en el chat para provocarlo (Cosa totalmente reportable e igualmente baneable que un rage). Más chistoso aún es saber que tienes más positivos que negativos, queda claro del por qué la gente buena se va quejándose de la comunidad, si avalan la toxicidad.","replies":[{"poster":"Errør 404","date":"2018-05-30T02:13:49.933+0000","up_votes":1,"down_votes":0,"body":"El pequeño spam que hice fue en respuesta a la crítica de Tryndamere: \"por que dos tan ******\". Cómo dije en la imágen, Shaco nos mató a ambos, con el spam quería decirle al Trynda \"a vos también te mató\".\n\nNo soy tóxico, y no ando tonteando haciendo spam porque si o pingueando a los demás. Yo juego y me centro en lo mío, de hecho, casi no hablo en el chat. El tema es que me sorprendió que Trynda me criticara, siendo que ambos habíamos muerto peleando contra el Shaco xD Y me sorprendió aún más que me criticara de forma tan directa (llamándome p*to, m4nc0 e id1ota).","replies":[{"poster":"L9 Letalis Umbra","date":"2018-05-30T03:15:19.671+0000","up_votes":1,"down_votes":0,"body":"De todos modos es una actitud negativa. Si tanto te molestaba el Tryndamere, simplemente lo muteabas o ignorabas y reportabas al final del match. Posteando esto en el foro no lograrás nada más que lo evidente y es que la comunidad es demasiada tóxica xD","replies":[]}]}]},{"poster":"snáke","date":"2018-05-30T00:09:47.145+0000","up_votes":1,"down_votes":0,"body":"si hay gente que te insulta por jugar mal, que es distinto a trolear, son personas frustradas en su vida personal, que tratan de descargarse con vos por esa razón. Simplemente los muteas y que se desenojen solos. Salu2","replies":[]},{"poster":"serfar","date":"2018-05-29T21:19:08.416+0000","up_votes":1,"down_votes":0,"body":"yo lo practico en ranked y bue sino no lo tomo enserio, tengo un problema no puedo jugar normales seriamente","replies":[]},{"poster":"LemønPykë","date":"2018-05-29T20:01:07.321+0000","up_votes":1,"down_votes":0,"body":"Este juego se volvio terriblemente toxico, yo ahora solo juego por diversion en la grieta, muy de vez en cuando, y son puro toxiqueo \"asi sos platino?\" \"free gank y no venis nunca ****(dijo el teemo supp)\" entre otros, esperan a que los carrees solo porque uno es platino, ya ni ganas..\nUltimamente ando full aram","replies":[]},{"poster":"Nabuze","date":"2018-05-29T17:34:04.953+0000","up_votes":1,"down_votes":0,"body":"Seguro es fan de algún influencers toxico o no tiene cerebro ni autocrítica.\nAsi fueras 2/10 en una normal mía lo máximo que diría sería \"mala suerte\" o a ver hasta donde llegan mis límites para ver qué puedo hacer en una situación así si me tocará vivirla en ranked y las hubo.\nBots ni te sirve para aprender un campeón, eso solo sirve para aprender cómo funciona el juego en lvl bajo.\nSi no querés entrar tan pelado en normal anda a la herramienta de práctica y fíjate que hace cada habilidad, después entra a la normal y salí 2/6 pero con estilo (?","replies":[]},{"poster":"TWO2","date":"2018-05-29T17:08:23.562+0000","up_votes":1,"down_votes":0,"body":"jajajaj no me imagino los flameos, igual es normal esta para practicar {{champion:17}} kappa\n otra cosa seria ranked aunque yo nunca flameo y no apoyo los que flamean xd, pero debiste quedarte bajo torre farmeando :v la gente no entiende que hay mas formas de conseguir dinero aparte de las kills por eso prefieren flamear a un adc con 100 minions al min 10 0/1/4 assist jajaja\n{{sticker:sg-miss-fortune}}","replies":[]},{"poster":"ToxicRunner","date":"2018-05-29T09:48:14.498+0000","up_votes":1,"down_votes":0,"body":"Lo muteas y lo reportas por medio del soporte mostrando las capturas.","replies":[]},{"poster":"Bienzahar","date":"2018-05-29T16:08:24.342+0000","up_votes":1,"down_votes":1,"body":"Prueba los champs en flex, eso hago yo xD","replies":[]},{"poster":"Naruto 2010","date":"2018-05-29T15:31:29.057+0000","up_votes":1,"down_votes":2,"body":"Hubieras dejado que sea vea su nick","replies":[]}]}