{"poster":"Errør 404","date":"2017-12-01T23:56:23.845+0000","title":"¿¿Varus??","subforum":"Charlas Generales","up_votes":7,"down_votes":4,"body":"Acabo de ver el nuevo video musical de League of Legends llamado: &quot;Varus: As We Fall&quot;, y la verdad qued&eacute; muy confundido :S O sea, emm... los hombres que salen en el video parecen un poco gays, no s&eacute; que opinan...\r\n\r\nEn su lore no dice nada sobre el otro hombre que cae en el pozo junto a &eacute;l &iquest;que se supone que debemos pensar?\r\n\r\nEn serio, estoy muy confundido \r\n\r\n{{sticker:sg-zephyr}}","replies":[{"poster":"Arondight","date":"2017-12-02T01:51:17.888+0000","up_votes":5,"down_votes":6,"body":"Lo vendieron al lobby gay. Lo que fue un héroe jonio que estaba a contra reloj para cumplir con su venganza es ahora un títere de una minoría hartante.","replies":[{"poster":"Errør 404","date":"2017-12-02T14:05:23.102+0000","up_votes":6,"down_votes":0,"body":"Eso sonó bastante homofobico :/ \n\n**¿Hay mas de 130 champs y te jode que 1 sea gay?**\n\n Vas a responderme _\"ya tienen a Taric\"_, pero Taric es un estereotipo, no representa realmente a la comunidad LGBT, sino mas bien a las impresiones homofobas y discriminatorias que los heterosexuales tienen hacia los LGBT. \n\nEn otras palabras: **Taric es una burla. **","replies":[{"poster":"Arondight","date":"2017-12-02T21:46:15.531+0000","up_votes":1,"down_votes":6,"body":"Como había dicho... hartante","replies":[{"poster":"Synnøve","date":"2017-12-04T01:26:07.220+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Arondight,realm=LAS,application-id=v7qsfXsE,discussion-id=pkZhPP4P,comment-id=000500000000,timestamp=2017-12-02T21:46:15.531+0000)\n>\n> Como había dicho... hartante\n\n¿En que sentido te parece hartante? O sea, lo único que piden es que no se los discrimine...","replies":[{"poster":"Arondight","date":"2017-12-04T20:11:32.900+0000","up_votes":2,"down_votes":3,"body":"Eso pedían antes, ahora piden más, mucho más. \n\nPiden censurar opiniones, piden callar voces, piden representaciones mayores, monumentos y privilegios sobre la ley. \nSi alguien se atreve si quiera a discutirlo, lo tachan de homofóbico(a) y lo demandan. No se cansan de marchar, de hacer ruido, de anteponerse sobre el resto, de exacerbar su \"orgullo\" como si estuvieran en la completa miseria. Nunca han tenido un mejor momento en la historia y todavía les parece poco.\n\nDetestan a los creyentes, a los conservadores y a las familias que defienden su derecho a conservar sus tradiciones.\nY para más remate, esperan que todo cambie a su imagen y semejanza como pasó ahora. Varus era hetero, viudo, pero hetero, su lore incluía un juicio en el que incluso se nombra a su único hijo. Ya no es solo ser representados o no-discriminados, sino modificar todo lo que les lleve la contraria, sea para disgusto o gusto del resto.\n\nAntes nadie me decía homofóbico por oponerme a esta extraña moda, ahora hay un sin fin de descalificaciones, fobias y despectivos para discriminiarme a mi y a los que piensan como yo. Muchos dirán que es \"discriminación inversa\", pero es lo mismo cuando lo miras desde un punto de vista no-sesgado por política o sentimientos.\n\nY si no lo crees, pues mira bien lo que te rodea, ya no importa si es buen o mal champ, toda la discusión se centra en lo \"sexual\". Solo eso importa al parecer, solo eso busca el lobby.\n\nYo elegí mi bando, no veo virtud en lo LGTBIXYZ (y consonantes que puedan unirse a la sigla a la fecha). Y si alguna vez lo tuvo, la perdió. Sobre lo de la no-discriminación, eso está hecho, casi no hay país que no puedan decirles algo sin pasar por una corte y pagarles sus compensaciones, al menos no en lo que respecta a occidente. El paso siguiente es influencia, y jamás pensé que llegarían hasta aquí, y mucho menos a un campeón que me gustaba tanto.\n\nLas empresas como Riot deberían mantenerse neutrales al respecto de este tema, solo por el respeto a todos en general, pero hoy dio un paso hacia un sesgo político-sexual que debería tener un poco de autocrítica.","replies":[{"poster":"Errør 404","date":"2017-12-05T20:06:53.272+0000","up_votes":1,"down_votes":0,"body":"No voy a responder punto por punto todo tu comentario porque sería larguísimo, solo voy a responder este: \n\n> Yo elegí mi bando, no veo virtud en lo LGTB. Y si alguna vez lo tuvo, la perdió. Sobre lo de la no-discriminación, eso está hecho, casi no hay país que no puedan decirles algo sin pasar por una corte y pagarles sus compensaciones, al menos no en lo que respecta a occidente. El paso siguiente es influencia, y jamás pensé que llegarían hasta aquí, y mucho menos a un campeón que me gustaba tanto.\n\nSi estás tan seguro sobre tu postura y en verdad crees que en occidente nadie nos discrimina y todo es perfecto para nosotros, te invito a leer leer mi historia personal en este otro foro: https://boards.las.leagueoflegends.com/es/c/off-topic-y-temas-personales/eUua3Gc3-gracias-riot-nn-varus-historia-personal-reflexian \n\nTal vez así entiendas mejor como es la vida de un LGBT, que siente y que dificultades debe afrontar por algo que no eligió y que no puede cambiar. \n\nUn saludo!","replies":[{"poster":"Arondight","date":"2017-12-05T22:35:01.303+0000","up_votes":2,"down_votes":0,"body":"Estas completamente inserto en tu propio mundo y ves la realidad desde un lugar miserable que elegiste para dar lástima... No esperaba menos, así son ustedes.\nCreo que ya lo he dicho antes, no veo las cosas desde sesgos. El bando que elegí no es el de los fascistas que te discriminan, pero tampoco es el del Lobby gay Neo marxista que impulsa estos cambios sin sentido.\nDisfruta de tu nueva mascota... Aunque claro, tu historia es digno símbolo para impulsar la agenda de los sodomitas.","replies":[{"poster":"Errør 404","date":"2017-12-06T01:23:54.194+0000","up_votes":2,"down_votes":0,"body":"No intenté dar lastima, al contrario, intenté contar una historia de superación y optimismo. La gente puede cambiar así como cambio mi familia.\n\nPor otro lado: ¿marxista? yo soy de derecha, los zurdos me dan alergia. ¿Por qué considerás que los gays son neo marxistas? Todas nuestras conquistas sociales fueron dadas en las democracias occidentales regidas bajo el sistema capitalista. De hecho, en la mayoría de los países comunistas te pueden meter en prisión por ser gay e incluso, en algunos países, hay campos de concentración para gays. \n\nhttps://es.wikipedia.org/wiki/Campos_de_concentraci%C3%B3n_gay_en_Chechenia (por si no me crees lo de los campos de concentración).\n\nSabés, me parece que tenés ideas muy erroneas sobre lo que es un gay y tendés a generalizar constantemente haciendo uso de un sinfín de prejuicios (sospecho que Agustín Laje anda tras tu ideología).\n\nLo mas irónico de todo esto es que estoy bastante seguro que vos y yo somos parecidos. Noto cierto grado de cultura en vos, pero siento que no juzgás la información de forma critica y tendés a aceptar de forma dogmática todo lo que encaja con tu sistema de valores.\n\nSolo para que veas que no todos somos iguales, yo no creo en la ideología de genero, pero si creo que los transgenero se sienten mujeres basado en la disforia de genero (diagnóstico psiquiátrico). No soy marxista, de hecho, me considero de derecha, como dije antes, los zurdos me dan alergia. Y para completar, nunca asistí a una marcha del orgullo gay, de hecho, a dichas marchas no asisten la mayoría de los gays, sino solo los mas radicales dentro de la comunidad LGBT. En lo personal considero que dichas marchas causan el efecto contrario al deseado y generan odio. Por ultimo, me parece que los destrozos que hacen las \"feminazis\" durante sus marchas son estúpidos y no hacen mas que dañar su movimiento (y a los gays de forma colateral por ser parte de los LGBT). \n\n¿Al final no opinamos tan distinto, verdad? De hecho, considero que si nos conociéramos en la vida real seríamos buenos amigos. No soy afeminado y no suelo exhibirme con mi novio en publico, considero que es algo de mal gusto. Y no, no estudio diseño de indumentaria, estudio Ingeniería en Sistemas ¬¬ Jejeje! \n\nEn fin, quisiera dar por terminada esta charla. Espero que hayas aprendido a no generalizar tanto y a juzgar critica y analíticamente la información. Respeto tu punto de vista y tus opiniones siempre que no sean extremistas (al punto de discriminar o humillar a alguien por su sexualidad). Un saludo!\n\n{{sticker:vlad-salute}}","replies":[{"poster":"Arondight","date":"2017-12-06T15:52:41.181+0000","up_votes":1,"down_votes":0,"body":"Son gente como tú la que hace sentir cierto alivio, es verdad... Como ya te dije, no soy ni un fascista ni un beato. Sólo un creyente sin costumbre, adepto a leer temas sobre política y Ciencias sociales, que claramente con el tema LGTB ACB... parecen estar bastante alborotados y sesgados en el último tiempo. Y ni siquiera es mi área de estudios, soy administrador de redes.\n\nHe trabajado mucho, y leído bastante (incluidos los aportes de Laje) , y si bien su teoría sobre el cambio de actores en la \"lucha de clases\" parece trillada, si se justifica en los movimientos radicales del Lobby.\n\nComo sea, no tengo razones para pensar que este cambio no este impulsado por actores ajenos al mismo Riot Games. No dudo de la fuerte influencia de grupos sodomitas.\n\nLo que le pasa a Varus no es correcto. El era hetero y lo volvieron gay. Algo como el caso de Luca di Tolve pero al revés. Lo que resulta en un absurdo que debería ser del desagrado de ambos grupos.\n\nEra más lógico que declararán gay a cualquier otro campeón cuya tendencia sexual ya estuviera en duda, que inventar el absurdo de una nueva historia sobre un campeón tristemente viudo.\n\nSea cual sea el bando que hayamos tomado, si lo pensamos profundamente, este cambio es una completa tontería.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"dscpnak","date":"2017-12-02T00:40:48.983+0000","up_votes":5,"down_votes":0,"body":"te perdiste un espadeo de dimensiones biblicas","replies":[]},{"poster":"Gato Brujo","date":"2017-12-02T00:04:13.466+0000","up_votes":4,"down_votes":0,"body":"cambiaron su historia, leiste el comic? jaja","replies":[{"poster":"Errør 404","date":"2017-12-02T14:06:44.034+0000","up_votes":2,"down_votes":0,"body":"Hay un comic de Varus? O_O","replies":[{"poster":"Errør 404","date":"2017-12-02T15:07:03.807+0000","up_votes":3,"down_votes":0,"body":"looooool! No habia visto el comic xD Habia encontrado el video en Youtube :p No ando jugando mucho últimamente, estoy en epoca de finales en la U y a penas tengo tiempo para dormir xD En fin, gracias por darme el dato del comic, lo acabo de leer. C:","replies":[]}]}]},{"poster":"SH Ark Knight","date":"2017-12-02T00:22:29.911+0000","up_votes":3,"down_votes":0,"body":"lee el comic, y yo crei que taric iba a ser el primer homosexual confirmado XD (o vi)","replies":[]},{"poster":"Pollo al Ornno","date":"2017-12-02T00:32:16.130+0000","up_votes":2,"down_votes":0,"body":"efectivamente son homosexuales, pero no hay que confundirse, Varus no es gay digamos, ya que es la union entre un darkin y Valmar (si es gay)","replies":[{"poster":"Este NoEs Suareh","date":"2017-12-02T00:45:31.748+0000","up_votes":1,"down_votes":0,"body":"Es la unión entre valmir, kai y el darkin de nombre varus; esos dan origen al que conocemos como \"Varus\".","replies":[]}]},{"poster":"Around the world","date":"2017-12-02T01:33:39.087+0000","up_votes":3,"down_votes":4,"body":"Varus esta formado por 2 machos alfa.","replies":[{"poster":"Arondight","date":"2017-12-06T16:08:20.306+0000","up_votes":2,"down_votes":0,"body":"Esa es tu idea de macho Alfa? El varus anterior venció un ejército de Noxianos él sólo y sin el Darkin.","replies":[{"poster":"Around the world","date":"2017-12-07T15:51:01.933+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Arondight,realm=LAS,application-id=v7qsfXsE,discussion-id=pkZhPP4P,comment-id=00040000,timestamp=2017-12-06T16:08:20.306+0000)\n>\n> Esa es tu idea de macho Alfa? El varus anterior venció un ejército de Noxianos él sólo y sin el Darkin.\n\nxD","replies":[]}]}]}]}