{"poster":"NoveroyT","date":"2015-07-04T20:06:18.573+0000","title":"Quiero rankear y nose como funciona","subforum":"Guias y consejos","up_votes":2,"down_votes":0,"body":"Hola quiero empezar a rankear y dem&aacute;s, hace poco llegue a lvl 30 y tengo campeones  pero no se como funciona el tema, nose si comienzo en bronce y de hay empiezo a subir o juego partidas para que me pongan en una liga para comenzar?  \r\n Si me dijeran que hacer o como funciona lo agradecer&iacute;a :D","replies":[{"poster":" LocaHaploide","date":"2015-07-06T03:01:14.483+0000","up_votes":2,"down_votes":0,"body":"El sistema es fácil! Al jugar tus 10 partidas te darán quedaras en una liga: Bronce, Plata, Oro, etc.\nPara ir escalando de liga deberás jugar otras partidas clasificatorias, si las ganas se te darán puntos LP. Una vez que llegues a 100 LP, entraras en promoción en la cual debes ganar 2 de 3 partidas para pasar al siguiente escalón por así decirlo.\nEs lo básico, ahora... No te recomiendo jugar rankeds de inmediato, ya que uno por muy bueno que se crea siempre se le escapa algo. Lo mas común es no comprar wards o que tengas algún conflicto con el lenguaje que se usa normalmente en las rankeds (Cuando jugué las mías no tenia idea de lo que era divear :v)  \nMis consejos son:\n-Aprendete el lenguaje.\n-Practica TODOS los roles (Una vez me mandaron jg y quede 0/7)\n-Trata de saber usar minimo dos campeones por cada rol.\n-Llega a 200 victorias minimo.\n-Si quieres usar a un campeon que no tengas, ahorra, te lo compras y lo usas. (Trata de no sustituir)\n-Timea los buffos :)\n-No seas tryhard a menos de que este tu equipo ahi para respaldarte (La mayor parte del tiempo no xD)\n-Los kills no ganan partidas, los objetivos si.\n-Armate tus runas y maestrias, las standar estan en cualquier lado.\n-Esto sonara estupido pero, practica tus skillshots.\n-Ve videos de jugadores mas experimenados! Ellos sapben xD \n-No te desesperes al inicio de la partida (Me sigue pasando esto)\n-Crea una playlist con tus canciones favoritas y disfruta, ya que despues de todo, esto es un juego.\n-Lo peor que puedes hacer es ponerte de mal humor. (Flamear)\n-Si pierdes, te levantas.\n-Y por ultimo como dice nuestro amigo Braum: \"La vision es la clave de la victoria\"\n   -Esto se entiende de dos maneras:\n      -Mira el mapa.\n      - Y COMPRA WARDS POR EL AMOR DE JEBUS.\nBueh, eso. Si se me fue algo ahi me acuerdan en los comentarios xP\nEso es todo, espero que te sirva la informacion :)\nAdieu {{champion:81}}","replies":[]},{"poster":"iFailTheSkill","date":"2015-07-05T00:24:04.565+0000","up_votes":1,"down_votes":0,"body":"Gana experiencia jugando partidas normales, podes ver a los jugadores profesionales usando el campeón que mas te guste en Youtube, aprende a ir todos los roles (MUY recomendable) e intenta no desmotivare, irte afk o flamear, Riot valora mucho a jugadores así... AH una cosita mas, usa a los campeones que mejor sepas usar en lo posible) no pruebes en ranked.\n\nSaludos!","replies":[]},{"poster":"Supernova Rigel","date":"2015-07-04T22:17:57.777+0000","up_votes":1,"down_votes":0,"body":"Antes de mandarte a clasificatorias jugá bastantes normales, para ir agarrando experiencia, esto te va a dar más confianza luego para manejarte en las clasificatorias. Antes de colocarte en una liga tenés que jugar 10 partidas en el modo clasificatoria, vendría a ser algo así como una preclasificatoria, luego de esas 10 partidas y dependiendo del resultado es que te colocan en una liga, si tenés suerte de no tener trolls y afk podés quedar en una buena posición, no fue mi caso xD en 10 partidas sólo pude jugar 3 con el team completo y sin trolls (De las cuales gané 2 y perdí 1, aunque gané 1 más con sólo 3 en mi equipo y eso me colocó en bronce IV, desde ese tiempo no juego clasificatorias, pero no que esto no te desmotive!)","replies":[]},{"poster":"Joegurt","date":"2015-07-04T21:49:14.227+0000","up_votes":1,"down_votes":0,"body":"Aqui comparto un articulo que habla sobre las partidas ranked (clasificatorias) y lo explica todo.  Espero que te ayude en algo y suerte cuando decidas comenzar las partidas en ranked.\n\nhttp://www.newtolol.com/clasificatorias.html","replies":[]},{"poster":"MatiLee","date":"2015-07-04T20:13:30.893+0000","up_votes":1,"down_votes":0,"body":"Primero que nada, no juegues las provisionales hasta que no tengas al menos 5 campeones para cada linea, y sepas usarlos todos.\nSe banean 3 campeones por cada equipo, y no es que vos cantas \"gane mid\", como haces en normales. Te toca lo que te toca.\n\nUna vez que terminaste de jugar las 10 provisionales, dependiendo de cuantas victorias hayas tenido, y cómo haya sido tu desempeño, te van a ubicar en una liga acorde a tus posibilidades.\n\nEspero haberte ayudado. Saludos.","replies":[]},{"poster":"xAsazin","date":"2015-07-04T20:13:15.010+0000","up_votes":1,"down_votes":0,"body":"Tenes que jugar 10 partidas iniciales, y ahí te emparejan una liga y división.","replies":[]},{"poster":"Ahrii Porn Star","date":"2015-07-04T20:12:45.597+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo que no juegues clasificatorias. Gana mas exp jugando normales.","replies":[]},{"poster":"newtech","date":"2015-07-05T02:31:19.471+0000","up_votes":1,"down_votes":1,"body":"nah solo juega, no hagas caso a esos consejos de esperar 3 años y dominar 100 campeones, con que sepas jugar 1 bien ya estas listo, y jugando se aprende.","replies":[]},{"poster":"FeedMyChota","date":"2015-07-04T20:41:40.532+0000","up_votes":1,"down_votes":1,"body":"1) Necesitas un mínimo de 16 campeones en tu haber (no los disponibles por semana)\n\n2) Tenes que jugar 10 partidas en ranked, para que el sistema, te ponga en una liga de acuerdo a tus resultados (bronce, plata, oro, etc)\n\n3) En la pantalla previa, los primeros de cada team, banean a 3 campeones cada uno, a veces piden consejos a los demás miembros del grupo, o banean de forma individual.\n\n4) En la selección de funciones, es por \"pick order\", esto quiere decir que si sos el segundo en elegir, tenes más chances de poder optar tu linea que si sos el último (ya que los demás 4, que estan antes que vos, van a ir las lineas que se sientan más seguro) No obstante, se puede llegar a hablar ese tema por el chat (que seas último en elegir, no implica no puedas elegir ser top o mid por ejemplo).\n\n5) También se puede \"tradear\", esto es para preservar un campeón (si vos elegis malphite, el equipo rival no puede elegirlo), entonces, el primer miembro puede elegir \"Malphite\" pero para vos (que sos el último), asi te lo reserva, y cuando te toque elegir a vos, le elegis (si tenes el campeón que el quiere, ejemplo Sona), y al final, tradean el campeón (vos usas Malphite y el Sona)","replies":[]}]}