{"poster":"Victors Demon","date":"2015-10-14T07:52:30.327+0000","title":"Nur ein Report/ eine Ehrung pro Spieler, warum?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Moin,\ngrade im letzten Spiel ist mir mal wieder aufgefallen, dass man einen Spieler nur wegen einer Sache reporten kann. _[edit: danke riot, nun gehts ja auch mit mehreren^^]_\nWas mache ich nun aber mit Leuten, bei denen diverse Punkte zutreffen w&uuml;rden?\n\nBeispiel (so in einem ARAM gehabt): \nSpieler l&auml;uft ohne Items zu kaufen bevor irgendwer anders &uuml;berhaupt die Basis verlassen hat mitten in gegnerisches Team + Turm, und statt dabei zumindest etwas Schaden zu machen wird in den Chat getippt: &quot;Yolo! It&#039;s just aram, chill...&quot;\n(feed-report?)\nnach zwei weiteren &auml;hnlichen Aktionen ist das Spiel f&uuml;rs restliche Team schonmal ruiniert, woraufhin einige zumindest ungehalten wurden und reports angedroht wurden...\nNun fing besagter Spieler an, die Weltmeisterschaft im Beleidigen gewinnen zu wollen (report daf&uuml;r?), und quittet anschlie&szlig;end nach nichtmal 7 Minuten Spielzeit. (afk/leaver report?)\n\nAlso mindestens drei gute Gr&uuml;nde... nur wof&uuml;r meldet man ihn nun wirklich?\nvor allem, wenn ein Name aus Zahlen und Buchstaben zusammengew&uuml;rfelt sowieso bestenfalls ein Smurf ist, und ihn ein Ban kaum st&ouml;ren d&uuml;rfte...\n\nIn der Regel melde ich sowas chronologisch, was zuerst drankam, und der Rest kommt dann in die Mitteilungen. Nur bei dem automatisierten System zweifel ich irgendwie daran, dass irgendwer die Mitteilungen &uuml;berhaupt jemals liest.\n\n\n&Auml;hnliches gilt f&uuml;r die Ehrungen, selten, aber eben doch manchmal hat man Spieler, die Teamgeist beweisen, dabei nett sind und (grade in aram, Botgames und &auml;hnlichem, wo viele Champs spielen, die sie noch nicht so gut kennen) dabei auch noch hilfreich sind. Ehren kann man sie dann trotzdem nur f&uuml;r eines. Obwohl grade diese wenigen Ausnahmespieler meiner Meinung nach ruhig mehr verdient h&auml;tten, kommt ja selten genug vor.\n\n\n\nAber... warum ist das jetzt eigentlich so?\nBei den Ehrungen kann ich mir noch denken, dass nunmal das auff&auml;lligste/wichtigste auch besonders herausstechen soll. Aber warum grade die ragequits nicht durch reports f&uuml;r flamen und afk von den connection lost mit nur afk-reports getrennt werden k&ouml;nnen und &auml;hnliches hab ich keine Ahnung. Vor allem weil, je nachdem wie die Mathematik im System aussieht, Spieler mit besonders schlimmen Verhalten so sogar l&auml;nger ohne Konsequenzen spielen k&ouml;nnen. Immerhin werden die Reports ja aufgeteilt, sodass es vllt. l&auml;nger dauert Chatrestriktionen zu erreichen, wenn die H&auml;lfte stattdessen wegen feed/afk reportet oder &auml;hnlichem.","replies":[{"poster":"Tungsteel","date":"2015-10-14T08:09:55.417+0000","up_votes":1,"down_votes":0,"body":"Ich würde das Schwerwiegendste reporten. Da AFK aber ohnehin vom Leaverbuster erkannt wird und der Beweis fürs Feeding vielleicht nicht optimal ist, würde ich ihn wegen den Beleidigungen reporten und den Rest in die Begründung schreiben. Ich bin mir jetzt nicht ganz sicher, aber glaube, dass prinzipiell die Zahl der Reports ausreicht, dass der Spieler genauer überprüft wird, und ,auch wenn ein Spieler zB für Feeding reportet wurde, kann er nach seiner Überprüfung für seine Beleidigungen bestraft werden.","replies":[{"poster":"Victors Demon","date":"2015-10-14T08:38:25.116+0000","up_votes":1,"down_votes":1,"body":"Schwierig wirds halt, wenn afk in der Base gestanden und dort vllt. noch ein wenig herumgealbert wird, ohne halt wirklich das Spiel zu verlassen.\n\nAber ja, nach schwere sortieren ist eigentlich das sinnvollste. Nur grade das fällt mir immer schwer:\n\nIst dauerndes geflame und dauernde Beleidigungen, die mir dadurch den Spaß nehmen schwerwiegend? (mute mag ich zumindest im Aram nicht nutzen, weil dort grade während man tot ist weit mehr \"taktik\" per chat als über pings geregelt wird bzw. geregelt werden kann)\nOder das AFK-stehen bzw. feeden, wegen dem man im Anschluss das Spiel verliert?\n\nSehr gutes Beispiel auch vor ner Weile (wieder Aram)... {{champion:81}} und {{champion:30}} im gegnerischen Team (schätzungsweise premades), ich hab sie nie gesehen außer ganz am Ende... dafür im chat sehr... öhm.. aktiv. Und gespürt haben wir sie, als sie durch den passiven Erfahrungsgewinn ihre ults freigeschaltet hatten. So professionelle killsteals hab ich nie wieder gesehen^^ Wir 5 vs. 3 in die Teamkämpfe rein, die Gegner halt irgendwie versucht unterm Turm dagegenzuhalten. Am Ende die alle Tot, bei uns etliche mit sehr niedrigem Leben. Und dann kommt ein Ez-Ult über die ganze Brücke gerollt, und triff quasi synchron mit dem Karth-Ult. Auch wenn die kaum Erfahrung hatten (standen ja nur in der Base) haben sie mit der Taktik (und passivem Goldgewinn) genug dmg gemacht, um am Ende die meisten Kills in ihrem Team und null Tode zu haben...\nUnd dabei die ganze Zeit am schreiben, was sie für ein unfähiges Team haben, die dauernd sterben etc. o.0\nUnd nun? die waren immer exakt die Abklingzeit ihrer Ults afk, geflamt haben sie auch, und irgendwie... wenns auch kein feeding war, sehe ich das doch als hilfe für den Gegner. Sehr verwirrendes Spiel, weiß nichtmal mehr, wofür ich sie dann reported habe...","replies":[{"poster":"Lord Vilich","date":"2015-10-14T08:43:11.599+0000","up_votes":2,"down_votes":0,"body":"AFK in der Base stehen wird auch vom Leaverbuster erkannt.","replies":[{"poster":"Shiggyvara","date":"2015-10-29T07:13:43.526+0000","up_votes":1,"down_votes":0,"body":"Wobei das im ARAM halt manchmal echt notwendig ist afk in der Base zu stehen, wenn z.B. 200 Gold für nen wichtiges Item fehlen (und man nicht ohnehin vorhat gleich wieder drauf zu gehen)","replies":[{"poster":"Lord Vilich","date":"2015-10-29T09:07:21.685+0000","up_votes":1,"down_votes":0,"body":"Das ist immer noch zu kurz um erkannt zu werden.","replies":[]}]}]},{"poster":"HyperionCH","date":"2015-10-14T08:48:41.835+0000","up_votes":1,"down_votes":0,"body":"Der Leaverbuster erkennt auch Spieler, die nur in der Base herumlaufen. Auch der Schaden durch globale Ultis helfen dabei nicht, das System zu umgehen.\n\nWenn sie dazu noch flamen/blamen/etc., dann einach wegen Flaming reporten. Somit werden sie zweifach bestraft: durch den Report wegen flaming (Chatrestriction, Rankedsperre, ban, perma) und wegen afk sein (längere Wartezeit, bis das Matchmaking aktiviert wird).\n\nWenn du den Ezreal bzw. Karthus wegen flaming reportet hast, dann werden sie also die Strafen kriegen.","replies":[]}]}]},{"poster":"OrangeBubble","date":"2015-10-14T14:40:53.873+0000","up_votes":1,"down_votes":0,"body":"Nicht für AFK reporten. Das bringt nichts relevantes, außer das Riot dadurch Daten sammelt, was als \"afk\" angesehen wird. AFK wird aber eigentlich automatisch erkannt und somit solltest du ihn entweder für Sabotage oder Beleidigung melden.","replies":[]},{"poster":"Powerjen","date":"2015-10-14T08:44:38.512+0000","up_votes":1,"down_votes":0,"body":"Melde den für Dich relevantesten Grund. Die Systeme springen dann schon an.","replies":[]},{"poster":"HyperionCH","date":"2015-10-14T08:32:18.485+0000","up_votes":1,"down_votes":0,"body":"Grundsätzlich das schlimmste Vergehen reporten; dies heisst: Flamen.\n\nEs gibt zudem einen \"Feederbuster\", der dies wohl automatisch erkennt (aber weiss vielleicht Humpel mehr, ob man da reporten muss oder nicht).\n\nBezüglich der ersten Szene muss man auch relativieren:\nWenn man ohne Items losrennt (kann einmal passieren, wenn man unaufmerksam war), kann man erst nach dem ersten Death wieder Items kaufen. Wenn man aber ohne Items kämpft, hat man Null impact und in einem Kampf stirbt dann nicht nur er, sondern vielleicht auch noch ein Mate, der sonst nicht gestorben wäre.\nMan kann sich also streiten, ob es sinnvoll ist, ohne Items zu kämpfen und somit ein Risiko fürs ganze Team zu sein, oder gleich zu sterben und dann dem Team besser helfen zu können (vom Kill-Gold wird der Gegner erst später profitieren können, da sie ja auch nicht einkaufen können).\nMan muss aber sagen, dass jener Spieler dies im chat auch hätte kurz erklären können.\n\nWas \"ähnliche Aktionen\" angeht, so kann ich dies nicht beurteilen. Aber da er zu Beginn bereits die Items vergessen hatte, war er offenbar grundsätzlich nicht \"fit\"/bei der Sache. Da kann man keine guten Moves erwarten (rechtfertigt jedoch sein Flaming nicht).\n\n\nBei den Ehrungen frage ich mich eh, wie genau man dies unterscheiden kann.\nEin Spieler mit \"Teamgeist\" ist für mich immer \"freundlich\" und \"hilfreich\". Grundsätzlich sind \"hilfreiche\" Spieler (die ihre Mates retten, gute Ganks machen, etc.) auch \"freundlich\". \"Freundliches\" Auftreten fördern den \"Teamgeist\" auch stets enorm. \n\n","replies":[{"poster":"Victors Demon","date":"2015-10-29T06:44:25.361+0000","up_votes":1,"down_votes":1,"body":"\"ähnliche Aktionen\" war in dem Fall in Varus mit diesem schneeball-Beschwörerzauber, der damit relativ regelmäßig als erster und einziger alleine mitten ins gegnerische team unter deren Turm gehüpft ist, obwohl nichtmal einer von denen unter 70% leben hatte... also auch nicht nur auf nen Kill aus oder sowas^^ Ich bin grade in Aram, wo viele ihre Champs nicht kennen etc. sehr tolerant was \"doofe aktionen\" angeht, aber manches ist mit ungewohnten champs oder auch nur dummheit einfach nichtmehr zu erklären. insbesondere nicht, wenn entsprechende Chatnachrichten das unterstreichen.\nWenn jemand nen schlechten Tag hat oder sowas, meinetwegen... ich spiel selber viel zu schlecht um mich über schlechte Spieler aufregen zu können/dürfen. \"geronimoooooo!\" in den chat zu schreiben und meilenweit vom eigenen Team mit einem ADC und x boots als einziger ausrüstung in gegnerisches Team/tower zu hüpfen, und auf die Bitte das zu unterlassen mit \"it's just aram, stfu [hier beliebige beleidigungen einsetzen, erinner mich nichtmehr an alle und er hatte ein großes repetoire]\" zu reagieren zählt da definitiv nicht zu^^\n\nHilfreich ist für mich Fragen beantworten etc., Teamgeist ist wenn support/tank sich  notfalls auch \"opfern\" um andere aus dem Team zu retten, auch der adc daran denkt wards zu platzieren, nida/kayle ihren heal nicht nur für sich benutzen und ähnliche dinge, freundlich ist für mich rein auf den chat bezogen. Aber da hat wohl jeder seine eigenen Definitionen... umso schwieriger so ein Wappen vollzubekommen^^","replies":[]}]}]}