{"poster":"Ciuffo18","date":"2015-06-22T20:05:59.512+0000","title":"server di merda","subforum":"Aiuto e supporto","up_votes":2,"down_votes":3,"body":"stavo facendo una ranked lol ci caccia praticamente dalla partita rientriamo e perdiamo. Adesso mi ritrovo con lol che mi dice di riconettermi ad una partita finita spiegatemi se &egrave; una cosa che abbia senso o se &egrave; solo il classico scherzo della riot che nn sa cosa fa","replies":[{"poster":"FaFFe","date":"2015-06-23T06:51:57.965+0000","up_votes":1,"down_votes":0,"body":"Se sprecate 2 minuti della vostra vita vedrete che sul forum esistono già miriadi di post a riguardo dove trovare informazioni.\nComunque visto che non cercherete mai: il drophack è un attacco dos verso un server della riot su cui sono ospitate delle partite, il server si intasa di richieste di connessione e si blocca, quindi tutte le partite vanno in crash. Quando tutti i giocatori si disconnettono la partita viene annullata come se non fosse mai esistita.\nCombattere questi attachi è molto difficile se non impossibile per ora vista la natura stessa degli attacchi e si può quindi solo tentare di attenuarne gli effetti.\nInfine nell'ulimo periodo pare che anche telecom abbia dei problemi.","replies":[]},{"poster":"Ciuffo18","date":"2015-06-22T20:26:59.877+0000","up_votes":1,"down_votes":0,"body":"ma c'è un modo per parlare con qualcuno o dobbiamo aspettare qualcuno che si ricorda che c'è un forum?","replies":[]},{"poster":"Keìron","date":"2015-06-22T20:50:19.109+0000","up_votes":1,"down_votes":1,"body":"DROPHACK 2","replies":[{"poster":"Ciuffo18","date":"2015-06-22T20:52:31.205+0000","up_votes":1,"down_votes":1,"body":"mi dispiace ma sono ignorante  non so cosa sia","replies":[{"poster":"Keìron","date":"2015-06-22T20:57:53.091+0000","up_votes":1,"down_votes":1,"body":"guarda tra i primi 4 post, dove nel titolo c'è scritto proprio DROPHACK.","replies":[]}]}]},{"poster":"Śekiro","date":"2015-06-22T20:40:29.670+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Ciuffo18","date":"2015-06-22T20:44:31.214+0000","up_votes":1,"down_votes":1,"body":"si ho capito ma com faccio a rientrare?","replies":[]}]},{"poster":"Erion94","date":"2015-06-22T20:23:17.378+0000","up_votes":1,"down_votes":1,"body":"Stessa cosa successa a me vorrei avere spiegazioni visto che perdere una ranked in promo in questa maniera è assurdo e se il server calcola la penalità e gradirei magari riuscire ad entrare magari entro questo secolo sul mio account RIOT ti prego basta chiamare raccomandati non sono capaci a svolgere il loro lavoro su WoW una cosa del genere in 12 anni di gioco nn e mai successo continuando così HOTS ci mette zero a superarvi.Pure Metin2 a un supporto migliori chiedi un gm e lo avrai anche se lui nn fa un cazzo qui sl per vederne uno mi tocca fare la processione a medjugorje e parlare cn la madonna.\n","replies":[]},{"poster":"espertomarinaio","date":"2015-06-22T20:16:28.885+0000","up_votes":1,"down_votes":1,"body":"anche a me mi è successo è desidero spiegazioni cazzo,non si può fare una partita in pace","replies":[{"poster":"Ciuffo18","date":"2015-06-22T20:19:48.667+0000","up_votes":1,"down_votes":1,"body":"si ma adesso non posso giocare perchè la schermata nn va via","replies":[]}]}]}