{"poster":"Nevectosant","date":"2016-02-28T07:31:56.684+0000","title":"Fizz, ahri, o viktor","subforum":"Guias y consejos","up_votes":1,"down_votes":1,"body":"Estoy en duda con estos 3 champs, ya los probe a los 3 y los 3 me gustaron, pero estoy en duda cual ser&iacute;a mas conveniente ya que necesito un mid ap. La dificultad no es problema, cuando compro un campe&oacute;n lo juego 1 semana completa para aprender a dominarlo.","replies":[{"poster":"Fiky","date":"2016-02-28T07:45:25.331+0000","up_votes":4,"down_votes":0,"body":"ahri, digamos tiene todo lo que quieren las wachas, daño movilidad cc más movilidad y es sexy que más queres? Fizz tiene más daño pero menos utilidad para el team y viktor es bueno pero al no tener movilidad y un cc medio pobre complica... digamos que si necesitas exclusivamente a un mid ap te recomiendo Ahri que es la más completa dentro de todo","replies":[]},{"poster":"mathi8","date":"2016-02-28T07:42:08.343+0000","up_votes":1,"down_votes":0,"body":"Fizz tiene daño, Ahri movilidad y Viktor dificultad.\nYo diría que Ahri es mejor.","replies":[{"poster":"Yachiru Kempachi","date":"2016-02-28T08:35:22.082+0000","up_votes":1,"down_votes":0,"body":"Fizz no tiene movilidad?","replies":[{"poster":"Fiky","date":"2016-02-28T08:39:52.374+0000","up_votes":2,"down_votes":0,"body":"tiene pero no la exagerada movilidad de ahri, o sea, una Q y aumentas la velocidad de movimiento, y una R que 3 flahs seguidos... es un asco, si no la gasta antes es ingakeable esa cosa","replies":[{"poster":"Yachiru Kempachi","date":"2016-02-28T08:48:23.902+0000","up_votes":1,"down_votes":0,"body":"No dije que tenga mas que Ahri... pero de ahi a separarlos como hizo el de la manera Fizz tiene daño, Ahri movilidad, como que Fizz ni la tiene me parece exagerado... Porque con  Ahri, Lb, Zed, Lissandra son los que mas movilidad tienen, Lissandra por obligacion mas que nada por la E, porque tampoco es tanto problema, amaga caminando para un lado tira la E a otro lado, y es muy predecible y en el trayecto del recorrido de la E la podes anticipar y demas...","replies":[]}]}]}]},{"poster":"Lau","date":"2016-02-28T08:52:56.034+0000","up_votes":1,"down_votes":0,"body":"Si querés un **mid** diría Ahri.\nSi querés un campeón **versátil**, diría Fizz.\nY nadie quiere a Viktor, así que no. (?","replies":[]},{"poster":"Yachiru Kempachi","date":"2016-02-28T08:36:52.189+0000","up_votes":1,"down_votes":0,"body":"Para mi te conviene Fizz, porque te guste o no.... siempre pero siempre llega el momento en que te aburris de un campeon... y Ahri y Viktor lo tenes que jugar siempre en la misma linea... en cambio Fizz tambien puede ir jg y top, lo podes hacer ad, ap, hibrido como quieras, hasta con devorador, es demasiado versatil, y a mi me divierte mucho mas....","replies":[]},{"poster":"PekeniO","date":"2016-02-28T08:22:41.857+0000","up_votes":1,"down_votes":0,"body":"Coincido con fiky metal. En mi opinion ahri es el mid mas completo del juego, tiene cc, movilidad, waveclear, y puede entrar y salir de una tf matando al carry tranquilamente (siempre que la sepas usar bien), Yo creo que hay que practicarla bastante, pero si la sabes manejar bien Es genial ! \nDespues fizz, a mi me encanta, alto champ, es facil de usar, pero dificil de masterizar ( de ser un experto con fizz ) pero le metes el pescadoscu al carry, y nos vemos en disney worl, build cdr 45 % tenes la E cada 4 seg. Ambos son muy bueno. \nViktor no sabria que decirte, pero nunca he visto a un viktor jugar bien. \n\nCon esto te podes sacar la duda: https://www.youtube.com/watch?v=zevkbefld8g","replies":[]}]}