{"poster":"MrsTigerYT","date":"2015-08-11T11:56:14.216+0000","title":"Jinx die bessere Miss Fortune","subforum":"Champions & Gameplay","up_votes":1,"down_votes":5,"body":"Hallo, warum sollte ich eine Mf Spielen wenn eine Jinx doch viel besser ist 110 extra ad besseren Slow bessere passive ich finde MF einfach nur schlecht im gegensatz zu Jinx die auch bessere reichweite hat soger die Ulti ist um weiten besser.. was sagt ihr dazu? beide unmobile nur MF ist deutlich schlechter...{{champion:32}}","replies":[{"poster":"SorisDynasty","date":"2015-08-11T12:00:24.771+0000","up_votes":4,"down_votes":0,"body":"Beide haben vollkommen unterschiedliche Kits. MF sollte Jinx im Laning dominieren können, fällt dafür aber im laufenden Spiel ab.\nUnd Jinx hat nicht 110 Extra AD, sondern die Rockets machen 110% Schaden statt 100%, also 10% mehr als mit einem normalen Angriff. Das machtn Unterschied. Dafür verzichtet Jinx in Rocketform auf die zusätzliche AS und ihre Grund-AS ist nicht die beste (zurecht).\nMF kann vermutlich noch etwas Feintuning gebrauchen, keine Ahnung. Dafür kenne ich sie zu wenig. Aber diese beiden Champions so... simpel zu vergleichen, bringt nicht viel.","replies":[{"poster":"Alustus","date":"2015-08-11T12:10:53.128+0000","up_votes":1,"down_votes":0,"body":"Da muss ich dir recht geben.\n\nAußer in einem punkt, ich finde jinx auf der lane auch besser als MF ;)\nWegen der Range (wenn sie den q aktiviert) und den Fallen ist sie sicherer gegen ganks.\nAußerdem hat Jinx besseren aoe dmg und somit waveclear.\n\n(ist aber nur meine Meinung)","replies":[{"poster":"SorisDynasty","date":"2015-08-11T13:39:27.219+0000","up_votes":1,"down_votes":0,"body":"Kann sein, ich kenne MF halt nicht sonderlich gut. ^^ Ich erinnere mich noch dran, dass ihr Laning eigentlich super stark ist, der Rest aber abfällt (wenn man nicht sowas wie Curse of the sad Bullettime hinbekommt, also Amumu+MF Wombo)","replies":[]}]}]},{"poster":"Hamrio","date":"2015-08-11T12:08:50.613+0000","up_votes":2,"down_votes":1,"body":"https://www.youtube.com/watch?v=YxzirQ7Uz3I das zählte igentlich alle probleme von miss fortune","replies":[{"poster":"Evenrider","date":"2015-08-12T11:17:27.306+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hamrio,realm=EUW,application-id=Wj1wcocU,discussion-id=HrnFErYV,comment-id=0001,timestamp=2015-08-11T12:08:50.613+0000)\n>\n> https://www.youtube.com/watch?v=YxzirQ7Uz3I das zählte igentlich alle probleme von miss fortune\n\nFand das Video recht gut.\nHabe selten so gut gelacht.\nEr zählt magischen Schaden, der mit AD skaliert, als negativ auf? WTF? MR ist wesentlich teuer, als Rüstung. Dazu macht man dank der AAs doch sowieso viel physischen Schaden. Zusätzlicher magischer Schaden ist doch nur geil. Erstrecht, wenn dieser auch noch durch deine AD gesteigert wird. Wie verteidigt man sich gegen sowas? Fast garnicht. HP allein reicht nicht, denn es ist kein Absoluter Schaden, daher sind die Zahlen höher. Rüstung geht auch nicht, denn dann macht dich der magische Schaden platt. MR aber auch nicht, schließlich kann sie auch nur AAs machen.\nUnd bei ihr wird es ja noch verrückter. Während Corki oder Koggy ihre Ult bzw. das Q spammen müssen um den magischen Schaden zu drücken, hat sie das als On Hit Effekt.\nUnd sie hat auch nicht das Problem von Darius, bei dem der magische Schaden ein DoT ist. Nein, bei ihr kommt der volle Schaden sofort. Dazu kann man den Mist auch noch mit 2 ihrer 3 weiteren Fähigkeiten übertragen.\nUnd, wenn man dem Wikia glauben kann, kann selbst Pantheons Passive den magischen Schaden nicht stoppen, selbst wenn dieser per AA übertragen wird.\nMan klingt das geil und das ist nur der passive Teil ihres Ws.\nMal schauen ob ich 3150 IP haben.....","replies":[]},{"poster":"Bergelmir32","date":"2015-08-11T13:02:07.227+0000","up_votes":1,"down_votes":0,"body":"Wow, wenn das ein ernstgemeintes Video ist, ist es einfach armseelig.\n\nEs ist also eine AP Skalierung auf iher Q. Wo ist da das Problem? Würde er auch anfangen Müll zu labern wenn man bei Caith ne AP Skallierung auf der Q hätte? Es ist ja nicht so das man desswegen irgendwas mit AP bauen muss, also nochmal wo ist das Problem?\n\"Warum sollte man SS bauen wenn mana uch PD bauen kann?\" Weis nicht, frag die Pros und Highelos warum SS ein ziemlich beliebtes Item auch da ist!\nBonus Magie Schaden auf ADCs, hab noch keinen sich darüber bei Varus oder Kog`Maw beschweren hören **und die skallieren mit AP!**\nIhr E macht magischen Schaden und skalliert mit AP. Bringt natürlich nicht so viel wenn man AD baut, genauso wenig wie es das bei ca 80% der Schützen tut die allesamt einen Utility Spell haben der Magischen Schaden macht und auf AP skalliert. Warum regen sich all die ... nennen wir sie besonderen Menschen... also bei MF so sehr darüber auf aber bei all den Anderen ist es ok?\nJa, ihre Ult ist mag ein bisschen verwirrend sein aber sie macht unter allem Schützen den meisten Schaden in Teamfights.","replies":[{"poster":"Stahlvormund","date":"2015-08-11T13:33:15.915+0000","up_votes":1,"down_votes":0,"body":"Ihre Ult in Teamfights ist tatsächlich sehr verwirrend, wenn das gesamte gegnerische Team seine Rüstung um 30% reduziert bekommt, dank {{item:3071}} .","replies":[]},{"poster":"MrsTigerYT","date":"2015-08-11T15:14:57.182+0000","up_votes":1,"down_votes":2,"body":"Ist sie in der Mitte vielleicht Besser wegen ihrer AP scalierungen das wwerde ich mal probiern {{item:3057}} {{item:3115}} {{item:3285}}","replies":[{"poster":"Corvis Rex","date":"2015-08-11T22:52:03.611+0000","up_votes":1,"down_votes":0,"body":"Habs ausprobiert. Nur ihre Ulti macht wirklichen dmg. Den Rest kannste leider vergessen! :(","replies":[]}]}]}]},{"poster":"SøftCake","date":"2015-08-13T11:02:04.327+0000","up_votes":1,"down_votes":0,"body":"Jinx ist ein Hyper Carry ihre Aufgabe ist im late Game die Gegner zu Zerstören.\nMissfortune is ein Lane Bully sie zerstört dich auf der Lane Snowballt vielleicht und läßt dich nicht wieder zurück ins Game.\nJinx ist nicht besser in der Lane  MF q w macht weitaus mehr dmg als Jinx kit in der Laning Phase.","replies":[]},{"poster":"haha weed lol xd","date":"2015-08-12T01:58:26.871+0000","up_votes":1,"down_votes":0,"body":"Hab auch gehört, dass Annie die bessere Janna ist.","replies":[]}]}