{"poster":"PROJECT Katarìna","date":"2016-11-20T05:13:31.465+0000","title":"DONT BUFF KATARINA PLS","subforum":"Gameplay","up_votes":36,"down_votes":3,"body":"She is really strong in the hands of someone who knows how to play her she only has a 40% winrate because of all the players this patch trying her out. If she gets buffed for lower elos she will be perma banned and I dont want that happening.\n\nEdit 1: you can shunpo to where a dagger would fall before it actually lands.\n\nhttps://i.gyazo.com/0ce6a49c93091d2d4ebf75cd567380cf.png","replies":[{"poster":"Succubús GF","date":"2016-11-20T05:16:25.361+0000","up_votes":3,"down_votes":6,"body":"Nobody wants to nerf kata, stop","replies":[{"poster":"PROJECT Katarìna","date":"2016-11-20T05:19:31.605+0000","up_votes":25,"down_votes":1,"body":"Im really afraid that shes gonna get buffed for no reason then hard nerfed","replies":[{"poster":"Jorencice","date":"2016-11-20T15:32:25.748+0000","up_votes":2,"down_votes":7,"body":"I know an assassian main whos high master tier.\n\nHe says katarina is terrible.\n\nHer damage needs to be buffed hardcore.\n\nAnd this man is a mechanics genius.\n\nSo it cant be him just not knowing how to play her.\n\nCourse he is playing against other master tier and challenger level players.","replies":[{"poster":"Nameless Voice","date":"2016-11-20T17:41:08.679+0000","up_votes":12,"down_votes":1,"body":"Just because he's master tier doesn't mean he can instantly learn how to play a now-complex champion.\n\nEven master-tier players need some time to learn new champions.","replies":[]},{"poster":"Battlecast Sona","date":"2016-11-20T21:20:35.491+0000","up_votes":2,"down_votes":0,"body":"and that's why I don't think I've seen a single game Voyboy has played as Kat where he hasn't popped off and gone crazy. He regularly wins games pre-20 with her...\n\nHer early game damage and laning went ++++++++, but her burst got nerfed. It was the point. Buffing her damage would literally be flying in the face of the point of the rework - make her laning less painful, but make her work harder to shred people late.","replies":[]},{"poster":"notice me Sin pi","date":"2016-11-21T02:16:50.213+0000","up_votes":1,"down_votes":0,"body":"the league we know today would no longer be the same game if it balanced champions around the highest level of play like dota","replies":[]},{"poster":"TotalJerk","date":"2016-11-21T02:21:30.426+0000","up_votes":1,"down_votes":0,"body":"I genuinely think she's weak, but the suggestion that a lack of damage is her problem is bullshit. IMO once people realize they need to stay away from her daggers she will start to struggle.","replies":[]}]},{"poster":"DJ Katarina","date":"2016-11-20T08:49:16.914+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Katàrina,realm=NA,application-id=3ErqAdtq,discussion-id=0e7duFrY,comment-id=00000000,timestamp=2016-11-20T05:19:31.605+0000)\n>\n> Im really afraid that shes gonna get buffed for no reason then hard nerfed\n\nSame.","replies":[]}]}]},{"poster":"Penns","date":"2016-11-20T09:25:14.814+0000","up_votes":7,"down_votes":1,"body":"The only change Id like to see is letting her ignore unit collision near her daggers. So annoying if you try to pick one up in lane without E but minions just dont let you do it lol.","replies":[{"poster":"MagikarpIsBoss","date":"2016-11-20T18:13:43.163+0000","up_votes":2,"down_votes":0,"body":"Yea I've been playing her recently and minion block when going for her daggers is so annoying. They should only make it within 300 units or less of a dagger.","replies":[]}]},{"poster":"bad arcade kitty","date":"2016-11-20T14:08:26.756+0000","up_votes":2,"down_votes":4,"body":"so many deaths...","replies":[{"poster":"TheOnlyJoe","date":"2016-11-20T22:06:56.552+0000","up_votes":5,"down_votes":0,"body":"because she's really risky lol","replies":[]},{"poster":"rtbf76109271","date":"2016-11-21T11:56:08.434+0000","up_votes":1,"down_votes":0,"body":"all melee dps champions will have higher deaths than others. They jump in and do as much damage as they can before they die. Talon, katarina, akali, rengar, and yasuo all have the highest average deaths per game in league. Annie and fiddle are next since they flash engage, dump spells and probably die right after. Doesn't mean the players are doing something wrong\n\nin fact with 5 or 6 average deaths on katarina in a game, I would suspect the player is not in enough of the team fights and could easily be doing worse overall than a kat with 8 or 9","replies":[]}]},{"poster":"EndlessIsolation","date":"2016-11-20T18:38:02.857+0000","up_votes":1,"down_votes":0,"body":"I still feel like too much of her power is gated behind her ult... I mean I guess its okay if that is how Riot wants it, but I just don't like it. Same reason I dislike new taric (too much put into his ult that hinders his possibilities in other places).\n\nI suppose it is what it is though. And a good Kat is still scary as hell (maybe more so because of the way her W/E work). I do fear if they buff her even a bit for \"high play\" she is going to dumpster low elo.","replies":[{"poster":"Battlecast Sona","date":"2016-11-20T21:22:12.325+0000","up_votes":2,"down_votes":0,"body":"but her power is now LESS gated behind her ultimate because with Shunpo resets it has become a viable source of damage (and they added an AD ratio to it). Prior to this rework Katarina was basically entirely dependent on her ult because if she didn't secure a kill she couldn't chase you - now she can chase you down without having to kill someone first, so she's actually **less** dependant on her ult than pre-rework.","replies":[{"poster":"EndlessIsolation","date":"2016-11-20T23:03:20.068+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Battlecast Janna,realm=NA,application-id=3ErqAdtq,discussion-id=0e7duFrY,comment-id=00090000,timestamp=2016-11-20T21:22:12.325+0000)\n>\n> but her power is now LESS gated behind her ultimate because with Shunpo resets it has become a viable source of damage (and they added an AD ratio to it). Prior to this rework Katarina was basically entirely dependent on her ult because if she didn&#x27;t secure a kill she couldn&#x27;t chase you - now she can chase you down without having to kill someone first, so she&#x27;s actually **less** dependant on her ult than pre-rework.\n\nThat is true, but still doesn't change the fact that the majority of her damage is in her ult. Though I definitely agree she is less reliant on it. Still kind of disappointing they didn't do more (but I guess they didn't want to ruin her identity?).","replies":[{"poster":"PROJECT Katarìna","date":"2016-11-21T03:02:28.588+0000","up_votes":1,"down_votes":0,"body":"All her damage is not front loaded into ult actually its just better overall has more range and a indicator also more damage overall her daggers do so much damage when you pick them up and her q has a really low cooldown in a good teamfight you gonna shunpo at least 5-8 times","replies":[]}]},{"poster":"PROJECT Katarìna","date":"2016-11-21T02:58:46.758+0000","up_votes":1,"down_votes":0,"body":"This guy knows what he's saying \nhttp://galeri2.uludagsozluk.com/364/give-that-man-a-cookie_488687.jpg","replies":[]}]}]},{"poster":"GetMariahCarried","date":"2016-11-20T19:00:52.796+0000","up_votes":2,"down_votes":0,"body":"But how else will I gain the excuse to use the term \"Buffarina\"?","replies":[]},{"poster":"Pale Pirate","date":"2016-11-20T17:24:31.263+0000","up_votes":2,"down_votes":0,"body":"Best build order?","replies":[{"poster":"PROJECT Katarìna","date":"2016-11-21T02:05:38.004+0000","up_votes":1,"down_votes":0,"body":"Genereal build for most match ups {{item:3116}} {{item:3020}} {{item:3285}} {{item:3135}} {{item:3146}} finish it off with a {{item:3089}} for squishies or {{item:3151}} for really high health tanks","replies":[{"poster":"Big Lincoln","date":"2016-11-21T02:15:19.185+0000","up_votes":1,"down_votes":0,"body":"in that order?","replies":[{"poster":"PROJECT Katarìna","date":"2016-11-21T03:11:44.322+0000","up_votes":1,"down_votes":0,"body":"If i can get {{item:1058}} Ill get it on first back if not then {{item:3020}}  I usually get rylais or ludens dependng on match ups{{item:3285}}  is good against people with a lot of dashes cause youll need to chase them down {{item:3116}} is really good against immobile champs, overall get ryalis first till it gets nerfed and yes usually this order, there is situational scenarios where you get defensive items b4 damage like {{item:1057}} or {{item:3157}}","replies":[]}]}]}]},{"poster":"invisiblecat1","date":"2016-11-20T15:18:32.278+0000","up_votes":2,"down_votes":1,"body":"Also a Kata main:\n31/12/20(Ascension)\n34/18/14(ascension)\n6/7/4 (This was just a bad game)\n22/3/3(normal)\n10/1/2(normal)\n20/4/2(normal)\nI think there are 2 more games, one of them I went like 20/2 and the other....\nkata support does not work\nBut honestly her spin damage should be toned down, and her Q damage should go up","replies":[{"poster":"Zerenza","date":"2016-11-20T22:35:21.854+0000","up_votes":1,"down_votes":0,"body":"No","replies":[]}]},{"poster":"Who Feeded You","date":"2016-11-21T14:02:17.224+0000","up_votes":1,"down_votes":0,"body":"She's good against people who have no idea how to counter her.\n\nIMO her passive should trigger faster, so she'd feel more like an assassin not a fighter. Right now you have to Q, wait for dagger to fall and then go in... Which is quite silly if you're tight on time.","replies":[{"poster":"PROJECT Katarìna","date":"2016-11-22T00:43:22.064+0000","up_votes":1,"down_votes":0,"body":"You can actually shunpo to a place where the daggers falls before it falls very interesting fact a lot of people dont know Ill add it to the main post","replies":[]}]},{"poster":"Eunson","date":"2016-11-21T04:08:03.617+0000","up_votes":1,"down_votes":0,"body":"Could do that as Ivern support in Gold V","replies":[{"poster":"PROJECT Katarìna","date":"2016-11-21T04:30:29.541+0000","up_votes":1,"down_votes":0,"body":"Ivern is strong though people just dont know how to play him lol","replies":[]}]},{"poster":"Rockm Sockm","date":"2016-11-21T02:13:32.205+0000","up_votes":1,"down_votes":0,"body":"I miss actually being able to waveclear and not an instant liability the second I pick Kat.","replies":[]},{"poster":"lolouie","date":"2016-11-20T23:08:12.092+0000","up_votes":1,"down_votes":0,"body":"Her early game definitely  needs a nerf. Should probably nerf the ad ratio on her E.\n\nI want to say her damage on her passive is a bit too strong late game,  but based off all the games I play..\n\n- people dont know how to play against Kat ( they walk toward dagger)\n- I was insanely fed on all those games cus her early is kinda strong\n- and keep in mind that she has no CC\n\nIf they DO nerf the damage on her passive, I think they should buff her Q a bit later on  in the game\n\nI'm a D5 mid lane main and love assassins. \nAlso, I was playing Kat on my G4 smurf if that makes any difference.","replies":[]},{"poster":"MagikarpIsBoss","date":"2016-11-20T18:16:58.137+0000","up_votes":1,"down_votes":0,"body":"Honestly hybrid katarina is super strong. I've been starting either boots or seal and first back getting 2 long swords. Then I go into revolver and finish gb. I've also been messing around with ad runes. After trying this, a few days later VoyBoy made a video using a similar build and it seems to work for him as well. I can't tell if this is just new Katarina being good when understanding how to play her, or if people dont understand her yet so they dont know what to do in lane verse her.","replies":[{"poster":"Battlecast Sona","date":"2016-11-20T21:23:07.712+0000","up_votes":1,"down_votes":0,"body":"Her passive has a 1:1 bonus AD ratio, and since Shunpo can reset (and gives you an auto on your target) the early AD build allows your trades to be really strong (since she's better at staying in melee range now). I think the longsword start is going to become the norm, into double longsword hextech->gunblade.","replies":[]}]},{"poster":"Leetri","date":"2016-11-20T19:44:10.546+0000","up_votes":1,"down_votes":0,"body":"I'd say another reason why it's so low is because she requires much more skill now with her dagger placements and people aren't used to it, i.e. they're playing her the same way they used to and that doesn't work all that well. A slight buff or QoL change might be appropriate, but it's far too early to tell for sure.","replies":[]},{"poster":"Nameless Voice","date":"2016-11-20T17:42:50.189+0000","up_votes":1,"down_votes":0,"body":"Luckily, Riot have so far said that they are leaving her alone until the dust settles and people learn how to play her.  Let's hope they keep that stance for now.","replies":[]},{"poster":"morris1","date":"2016-11-20T09:15:48.957+0000","up_votes":1,"down_votes":0,"body":"I saw the build of that one Rengar game and for a second I thought you played Kata there as well.","replies":[]},{"poster":"Keevur","date":"2016-11-20T14:06:41.261+0000","up_votes":1,"down_votes":1,"body":"Thus far I've never lost or won a game when Kat was on either team. Just because you can shunpo ult the adc doesn't mean you have to.","replies":[]}]}