{"poster":"PrG Torridity","date":"2015-07-29T08:05:51.236+0000","title":"Supporter/in für 5on5 Ranked gesucht!","subforum":"Clans & Teams","up_votes":2,"down_votes":2,"body":"Heyho,\r\n\r\nmein Team ist auf der Suche nach einer geeigneten Supportbesetzung.\r\n\r\nWir sind motivierte Spieler, die die Ladder hoch wollen aber auch Spa&szlig; verstehen.\r\nTraining wird ca. 3 mal die Woche als Mindestma&szlig;stab gesetzt.\r\nDie Trainingszeiten liegen eher in den abendlichen Stunden zwischen 19-22 Uhr.\r\n\r\nWas erwarten wir von einer Supporterin/einem Supporter:\r\n\r\n*     Aktives motiviertes Spielen\r\n*     zeitlich nicht zu stark eingeschr&auml;nkt\r\n*     Zuverl&auml;ssigkeit (d.h. Einhalten von Terminabsprachen)\r\n*     Teamf&auml;higkeit - gerade als Support wo ihr sowieso schon eine unterst&uuml;tzende Funktion im Game erf&uuml;llen sollt, sollte absolut kein Ego-Kopf mitspielen\r\n*     Mindestalter von 16 Jahren\r\n*     konstruktive Kritik solltet ihr verkraften k&ouml;nnen\r\n*     Bereitschaft mit dem ADC, was meine Wenigkeit ist, DuoQ zu spielen, um das Zusammenspiel auf der Botlane zu verbessern\r\n\r\nWenn Ihr diese Erwartungen erf&uuml;llt und auch mindestens Gold 5 seid, so freuen wir uns sehr auf eure Adds!\r\nScheut euch nicht :)\r\n\r\nIngame: PrG Torridity\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\n\r\nPrG Torridity - Teamleader","replies":[{"poster":"PrG Torridity","date":"2015-07-29T18:14:55.274+0000","up_votes":1,"down_votes":0,"body":"#bump","replies":[]},{"poster":"PrG Torridity","date":"2015-07-29T16:01:03.004+0000","up_votes":1,"down_votes":0,"body":"#bump","replies":[]},{"poster":"Yιkes","date":"2015-07-29T08:27:15.267+0000","up_votes":1,"down_votes":0,"body":"Hay,\n\nBin auch seit langem auf der suche nach einem Aktiven Ranked Team in das ich mich einbringen kann,\nHabe mich diese Season aus der \"Elo Hell\" Silver > in die nächste Hölle Platin hochgecarryt als main Sup,\nSolo/Duo macht mir zuwar noch spaß, aber sehe auch das sich mein Skill noch in Platin befindet, und möchte\ndiesen evtl in einem schönen Umfeld wie einem Ranked Team weiterbilden :3\n\nIch bin 18 jahre alt, und habe schon in mehreren Ranked Teams gespielt, die aber nie wirklich weiter geführt wurden.\nLetzte Season stand ich auf Silver1 (pre Gold) Diese wie gesagt auf Platin V im mom.\nSupport: Seit Anfang S3 hat mich die Rolle Support gefesselt. ich mag es im Hintergrund das Spiel zu carryen, und\nmeine Lanes so zu verstärken - um letztlich das spiel zu gewinnen.\nVon Morgana bis Taric kann ich mich mit jedem Support anfreunden, und ihn nach einer kurzen Eingewöhnung Phase\ngut spielen.\nMains: Janna, Nautilus, Morgana, Taric, Malphite (Duo q Support mit Yasuo Main)\nAber auch Champions wie Annie, Thresh und Blitzcrank sind in meinem Champion Pool.\nHeadset + Ts3 ist vorhanden.\n\nWürde mich über eine Private Nachricht//und oder ein Probegame  würde ich mich Freuen.\n\nMit Freundlichen Grüßen\n\nDirty","replies":[]},{"poster":"MomoU","date":"2015-07-29T08:16:43.454+0000","up_votes":1,"down_votes":0,"body":"Moin,\nIch wäre schon seit längerer Zeit auf der Suche nach einem ranked Team da solo/-duoqueue einfach keinen Spaß mehr macht.\nZu mir, ich bin 17 Jahre alt und hab auch schon viel Erfahrung in anderen Ranked Teams gemacht und bin somit mit dem Shotcallen etc. vertraut. Ich spiele seit season 2 war in season 3 plat 1 und hab danach ein jahr pause gemacht und jetzt bin momentan Gold IV.I, versuche aber noch diese Season Platin zu erreichen.\nIch spiele gerade eigentlich nur botlane, zwar adc überwiegend aber supporter sollte kein Problem sein da ich mich mit trades relativ auskenne:D\nMains: Thresh, nautilus, shen, braum, janna\nIch besitze sowohl ein Headset als auch Skype und TS.\n\nBei Interesse addet mich einfach in LoL ( MomoU ) würde mich über ein probegame freuen^^\nGruß MomoU ^^","replies":[]}]}