{"poster":"Thenewalcatraz","date":"2015-05-10T20:24:05.628+0000","title":"PC si spegne durante le partite","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Salve, &egrave; da qualche tempo che riscontro un problema fastidiosissimo, ho provato a usare la funzione cerca del forum e a googlare un po&#039; anche in inglese ma non ho trovato una soluzione. Durante alcune partite di League of Legends il pc  si spegne di colpo. Io non riesco proprio a comprenderne il motivo. Quando sono in partita dopo un paio di minuti lo schermo mi si spegne facendo strani  rumori e per spegnerlo devo utillizare il tasto di reset.","replies":[{"poster":"RedmasterITA","date":"2015-05-11T14:07:49.988+0000","up_votes":1,"down_votes":0,"body":"Se è solo un problema di surriscaldamento basta aprire il case e piazzare un ventilatore in quella direzione. FUNZIONA AL 100%","replies":[]},{"poster":"BluFoxer","date":"2015-05-10T22:26:08.921+0000","up_votes":1,"down_votes":0,"body":"È probabilmente un sovraccarico del computer, dovresti aprire il case e controllare se c'è polvere depositata, di solito quando non viene pulito per molto tempo il pc accumula polvere nelle ventole del processore, queste possono non riuscire a girare bene ed il pc si spegne per evitare un surriscaldamento, a me succedevaa poi ho aperto il pc per controllare la polvere e ce n'era a bizzeffe, ho preso un compressore ed ho pulito tutto bene, poi ho controllato in che stato fosse la pasta termica ( è una goccia di pasta, tipo plastilina, che sta tra il processore ed un altro pezzo del pc che non ricordo e serve a trasferire il calore in eccesso e far funzionare tutto a dovere) ed era asciutta, l'ho rimessa e dopo aver chiuso tutto il pc filava e fila che è un amore.\nP.S. si dovrebbe controllare la polvere ogni 7-8 mesi. Se non è un problema di polvere è un virus oppure bisogna fare un repair del client.\n{{champion:9}}","replies":[{"poster":"Thenewalcatraz","date":"2015-05-11T05:07:03.950+0000","up_votes":1,"down_votes":0,"body":"Grazie tanto, adesso appena posso dò una controllata dentro al case.","replies":[{"poster":"AnDGames","date":"2015-05-11T11:55:20.831+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Thenewalcatraz,realm=EUW,application-id=98NGV4Al,discussion-id=HL0a9Eg9,comment-id=00010000,timestamp=2015-05-11T05:07:03.950+0000)\n>\n> Grazie tanto, adesso appena posso dò una controllata dentro al case.\n\nil controllo fallo, ti consiglio anche di metterti all'aperto usando un compressore, se sono anni che non lo fai vedrai nuvole di polvere.\nstai attento a non far girare le ventole col compressore, richi di romperle. ti basta tenerle ferme mentre le soffi\n\nperò se sei costretto a resettarlo a mano, potrebbe non essere un discorso di surriscaldamento.\nscaricati un programmino per visualizzare le temperature delle cpu e ram, così puoi esserne certo\nfallo prima di pulire, scaricati un benchmark video così spinge a fondo il pc e osserva le temperature.\n\nche tipo di strani rumori senti?\nma si spegne e riaccende da solo o no? non è chiaro...","replies":[{"poster":"Thenewalcatraz","date":"2015-05-11T12:28:52.626+0000","up_votes":1,"down_votes":0,"body":"Ho osservato che appena esco dal gioco e lo riduco ad icona noto che la temperatura è alta. Quando si spegne fa rumori strani che non saprei come spiegarti e lo schermo mi diventa nero ma il pc non si spegne se non lo resetto manualmente.","replies":[{"poster":"AnDGames","date":"2015-05-11T12:38:05.496+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Thenewalcatraz,realm=EUW,application-id=98NGV4Al,discussion-id=HL0a9Eg9,comment-id=0001000000000000,timestamp=2015-05-11T12:28:52.626+0000)\n>\n> Ho osservato che appena esco dal gioco e lo riduco ad icona noto che la temperatura è alta. Quando si spegne fa rumori strani che non saprei come spiegarti e lo schermo mi diventa nero ma il pc non si spegne se non lo resetto manualmente.\n\ntemperatura di cosa?\n\ncerca di spiegare i rumori, hardisk? ventole?","replies":[]}]}]}]}]},{"poster":"Darkirman","date":"2015-05-11T09:03:55.905+0000","up_votes":1,"down_votes":0,"body":"Ciao! Ho lo stesso problema, solo che da me non è un sovraccarico xD A me hanno consigliato anche di guardare se la ram funziona\nSe risolverai dimmelo ^^","replies":[]},{"poster":"Keìron","date":"2015-05-10T20:59:23.607+0000","up_votes":1,"down_votes":0,"body":"a me succedeva molto spesso, ma basta uscire dalla schermata di lol per qualche secondo ogni 5 minuti e non dovrebbe accadere.","replies":[{"poster":"Keìron","date":"2015-05-10T21:00:23.475+0000","up_votes":1,"down_votes":0,"body":"forse è anche un sovraccarico del computer...","replies":[]}]}]}