{"poster":"Jinn Chi","date":"2019-02-22T17:09:18.807+0000","title":"Sentís que LAS está abandonado por Riot y que los Rioters no están?","subforum":"Charlas Generales","embed":{"description":"r/leagueoflegends: This is a subreddit devoted to League of Legends.","url":"https://www.reddit.com/r/leagueoflegends/comments/atjqlv/las_server_is_abandoned/","image":"https://b.thumbs.redditmedia.com/MDQjKWvNW82SfYXHbA9eFY1O-AFyT-4tpqWOWl3Xo-s.png"},"up_votes":91,"down_votes":1,"body":"Hice un post en Reddit sobre el estado de abandono en cuanto a información y participación de los rojos en el estado del juego.\r\n\r\nSi pensás como yo que la situación no da para más, ayudame compartiendo tu opinión o upgradeando el post en la plataforma.\r\n\r\nGracias","replies":[{"poster":"Mascheranox","date":"2019-02-22T17:10:49.176+0000","up_votes":2,"down_votes":20,"body":"A mi me responden siempre cuando hago consultas en soporte despues del bot me llega el mensaje","replies":[{"poster":"Jinn Chi","date":"2019-02-22T17:15:20.657+0000","up_votes":14,"down_votes":0,"body":"Si, no digo que no respondan. El tema es que han desaparecido. Solo hay 6 rioters (una cuenta de esas 6 se llama Riot LATAM, es decir que es como un cuenta general) y han contestado en 10 posts en 1 mes. Ya ni siquiera participan de los foros ni tampoco nos dicen por qué no hay más rioters, sumado a que hay un montón de bugs y problemas técnicos y el 95% del tiempo no hay nadie que de la cara.","replies":[{"poster":"IvVicious","date":"2019-02-22T17:49:43.328+0000","up_votes":7,"down_votes":1,"body":"Hay menos rioters porque unieron LAN y LAS, quedando toda la parte de comunidad en LAN (y en consecuencia, adiós rioters de LAS) y la parte de esports en LAS (por eso seguimos teniendo al maravilloso Maggical).\nLos rioters que dan vueltas de vez en cuando son de LAN; fijate que el foro de LAN está incluso más muerto que el nuestro, nunca tuvieron mucha participación allá así que acá es lo mismo.\n\nExtraño tanto a Gauss :(","replies":[{"poster":"L9 Letalis Umbra","date":"2019-02-23T16:48:56.907+0000","up_votes":3,"down_votes":0,"body":"Gauss y Exca eran la luz","replies":[{"poster":"Jinn Chi","date":"2019-02-25T03:18:04.804+0000","up_votes":1,"down_votes":0,"body":"si {{sticker:zombie-nunu-tears}}","replies":[]}]}]},{"poster":"StąrDust","date":"2019-02-22T17:57:48.391+0000","up_votes":2,"down_votes":0,"body":"El tema de los bugs y problemas técnicos lo deben solucionar desde la central (desconozco si esta en NA o JP). No podemos reclamarlo a la sede de LAS que lo arreglen, pero que si le informen a la central. Solo los problemas del server le podemos reclamar (desconexión y problemas de nodos).","replies":[{"poster":"Nabuze","date":"2019-02-23T11:40:23.059+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=StąrDust,realm=LAS,application-id=v7qsfXsE,discussion-id=dQw21yep,comment-id=000000000001,timestamp=2019-02-22T17:57:48.391+0000)\n>\n> El tema de los bugs y problemas técnicos lo deben solucionar desde la central (desconozco si esta en NA o JP). No podemos reclamarlo a la sede de LAS que lo arreglen, pero que si le informen a la central. Solo los problemas del server le podemos reclamar (desconexión y problemas de nodos).\n\nCuando paso lo del ping elevado en muchos paises tardaron 3 semanas en que se entere un rioter y los soportes estaban al tanto de todo.\nRecien cuando se entero el rioter demoro 3 dias en solucionarse fue decepcionante todo lo que tardo en solucionarse algo que podian solucionar en 3 dias.","replies":[]}]}]}]},{"poster":"Black Jesirez","date":"2019-02-23T01:37:39.581+0000","up_votes":6,"down_votes":0,"body":"Fui al subreddit y... bueno, encontré esto:\n> LAS server is Abandoned\n> (Eliminado)\n{{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"LST Slime Blue","date":"2019-02-22T22:50:52.231+0000","up_votes":5,"down_votes":0,"body":"El problema no es en general Riot, sino los nuevos Rioters. Los antigüos, siendo que nacieron con una comunidad que migró de NA, tuvo más conexión con los jugadores debido a ser la primera relación latina/hispanohablante del juego. Con forme fueron abandonando Riot Games los nuevos Rioters no supieron tomar el puesto de los antiguos, siendo que quedaron doblegados a unos simples  empleados que hacen presencia en las oficinas, pero que carecen de conexión alguna con los jugadores","replies":[]},{"poster":"Best GirI","date":"2019-02-22T19:11:58.910+0000","up_votes":5,"down_votes":0,"body":"***","replies":[{"poster":"Spíroz","date":"2019-02-22T19:54:29.615+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Best GirI,realm=LAS,application-id=v7qsfXsE,discussion-id=dQw21yep,comment-id=0007,timestamp=2019-02-22T19:11:58.910+0000)\n>\n> estamos condenados a jugar en el peor server del juego\n> {{sticker:sg-ahri-1}}\n\nconcuerdo,el comentario de Diosmo es mas detallado,pero los 2 van al punto.","replies":[]}]},{"poster":"Tortuguita","date":"2019-02-22T18:22:52.149+0000","up_votes":5,"down_votes":0,"body":"Esto es tierra de nadie.\nPero todavía existe gente que defiende el trabajo de Soporte, el cual en la mayoría de las veces, te responde un bot y te cierra el ticket.\n\nEsto es un foro de nada.","replies":[{"poster":"Diego Rosales","date":"2019-02-24T15:40:56.387+0000","up_votes":1,"down_votes":0,"body":"Hice 5 reclamaciones de distintos temas, me respondieron los 5 tickets, con el mismo mensaje. GG riot","replies":[{"poster":"Tortuguita","date":"2019-02-24T15:48:24.392+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Diego Rosales,realm=LAS,application-id=v7qsfXsE,discussion-id=dQw21yep,comment-id=00040000,timestamp=2019-02-24T15:40:56.387+0000)\n>\n> Hice 5 reclamaciones de distintos temas, me respondieron los 5 tickets, con el mismo mensaje. GG riot\n\nTodo tiene la misma respuesta, buscar tu felicidad (?  xD","replies":[]}]}]},{"poster":"Widuk","date":"2019-02-22T19:07:03.264+0000","up_votes":4,"down_votes":0,"body":"El contenido de tu post de Reddit fue removido :(\n\nHace unas semanas vi unos comentarios de un moredador, o creo que era un voluntario... {{sticker:sg-zephyr}} \n\nTal vez no haya mucho contenido en el foro como para que interactúen. Si omites los Post de la gente que comparte su resentimiento y/o frustración por pérdidas de partidas (matchmaking, flamers y tóxicos en la comunidad), casi todo se reduce a la sección de reclutamiento.\n\nSi no es tu obligación responder Post de gente descargándose en Riot y la comundad por perder partidas, las primeras veces les intentas explicar cómo mejorar su comportamiento y tener una mejor experiencia, pero después de una semana viendo \"los mismos\" Post te quita el interés.\n\nLo que me intriga es la cantidad de gente que ve los post pero no comenta. En la sección de reclutamiento podrían implementar algún incentivo, como un reconocimiento a nivel de foro, para aumentar la interacción entre los jugadores o equipos que buscan integrantes (Looking For Team/Team Looking For).\n\nPor otro lado si nos comparas con el foro de NA, donde hay más usuarios generando contenido como dibujos, historias, canciones, consultas, ideas y compartiendo su experiencia con el juego, tampoco tenemos la práctica de citar a otros jugadores en el foro, ya que quienes crean los post son gente que viene a desquitarse por X motivo e irse.\n\nSi quisieran un plan para integrar más a la comunidad del foro con el juego, tendrían que hacer una integración de notificación con el cliente del juego, pero eso va mucho más allá de una implementación... es todo un proyecto donde tiene que estudiar, ver los potenciales riesgos y oportunidades (tal y como pasó con URF, donde la implementación fue buena a corto plazo, pero jugadores no volvieron de jugar normal/ranked y se fueron del juego), cómo impacta el nivel de aprendizaje de nuevos/viejos jugadores, mantener la interfaz gráfica simple y mucho más.\n\n\no7","replies":[]},{"poster":"Teemo Best JoJo","date":"2019-02-23T18:06:21.076+0000","up_votes":3,"down_votes":0,"body":"Lo peor es que te borran el post , increíble como te intentan censurar","replies":[]},{"poster":"Press D to Dance","date":"2019-02-22T20:33:30.642+0000","up_votes":3,"down_votes":0,"body":"Nada que hacer, más que irse a otros juegos. En los otros servers tendríamos ping alto, y acá está lleno de flamers y Riot no hace nada. Por motivos como estos es que LoL está muriendo en LAS.","replies":[{"poster":"Demeta","date":"2019-02-23T00:27:51.875+0000","up_votes":3,"down_votes":0,"body":"Yo de 10 partidas .. al menos tengo que reportar unas 3 personas (mínimo) pero desde hace ya unos 4- 5 meses que no me llega ni una notificación que el report fue tomado en cuenta... quizás viven en vacaciones xd","replies":[{"poster":"YuGGi ","date":"2019-02-23T21:52:18.486+0000","up_votes":2,"down_votes":0,"body":"me pasa igual en 3 años de juego solo he visto 2 notificaciones de ban","replies":[{"poster":"Demeta","date":"2019-02-24T01:19:46.045+0000","up_votes":1,"down_votes":0,"body":"En verdad he reportado cosas bastante desagradables que trascienden de un flameo como homofobia, nombres sugerentes a miembros reproductores, frases denigrantes y burlas a enfermedades ....nada de nada ... Me parece que algo anda mal aquí ( ojo que dentro de mis report soy bastante especifico, bajo que contexto se suscita lo del report  y cito textualmente las palabras o frases que deberían ser penalizadas. \nComo dije anteriormente no es que no se reporte o que no sea especifico el report, al parecer es que no se hace nada al respecto...\nSaludos","replies":[]}]}]}]},{"poster":"shinji icardi","date":"2019-02-22T22:19:18.773+0000","up_votes":3,"down_votes":0,"body":"Esto es muy cierto y me causa gracia porque entré al foro recién a buscar una ayuda que un soporte no me pudo dar porque me copypasteo y me encuentro con tu post.","replies":[{"poster":"Demeta","date":"2019-02-23T00:26:38.134+0000","up_votes":3,"down_votes":0,"body":"Debes ser un poco mas incisivo con respecto a tus dudas con soporte. Si preguntas algo simple te van a dar copy paste .. te recomiendo ser muy detallado y solicitar el porque del porque ... funciona bien.","replies":[]}]},{"poster":"Visoka","date":"2019-02-23T00:11:16.022+0000","up_votes":3,"down_votes":0,"body":"Por cosas como estas es que ya no cargo mas rp hasta que vea cambios o mas compromiso con la comunidad en pequeños detalles como que no te respondan con un copy paste alguna duda al soporte","replies":[{"poster":"Identi","date":"2019-02-23T00:59:20.431+0000","up_votes":2,"down_votes":0,"body":"Yo ya ni juego en LAS si me anda para el orto !","replies":[]}]},{"poster":"Woud 1488gg","date":"2019-02-22T21:54:19.540+0000","up_votes":3,"down_votes":13,"body":"Facil, a mi me banearon 12 cuentas, juego desde 2013. Motivo de ban? Intentar motivar al equipo con el chat y decirles que farmeen tranquilos y esas cosas (abuso verbal) xD.\nEste juego, como su servicio tecnico, murieron en la season 5","replies":[{"poster":"Del0reaN","date":"2019-02-22T22:01:57.836+0000","up_votes":7,"down_votes":1,"body":"Qué raro che.. 12 cuentas baneadas por alentar a tu equipo. Este Rito hace cosas muy locas últimamente. (?)","replies":[]}]},{"poster":"LOW Minus","date":"2019-02-24T01:09:26.623+0000","up_votes":2,"down_votes":0,"body":"Tu nombre lpm JAJAJA","replies":[{"poster":"Jinn Chi","date":"2019-02-25T03:16:33.272+0000","up_votes":1,"down_votes":0,"body":"jajaja son cosas que pasan","replies":[]}]},{"poster":"Vulcano","date":"2019-02-22T23:34:18.524+0000","up_votes":2,"down_votes":0,"body":"bosta de server {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Demeta","date":"2019-02-23T00:25:32.691+0000","up_votes":2,"down_votes":0,"body":"Juega en br !","replies":[{"poster":"Cuching","date":"2019-02-23T19:03:00.087+0000","up_votes":1,"down_votes":0,"body":"Y a cuantos ms aprox te anda ahi?","replies":[{"poster":"Demeta","date":"2019-02-23T20:45:22.424+0000","up_votes":1,"down_votes":0,"body":"HUmm personalmente juego en NA (PBE) a 250/270 y en Br puedes andar desde los 55/ 130 max  esos son los ping que yo manejo con movistar. En Las me anda a 25/35 no más que eso.\n Con una conexión de 8 Megas de bajada y 0.50 de subida, espero que te sea útil la información pero siempre es mejor crearse una cuenta jugar tutorial y ver si es viable o no  tambien puedes barajar la opción de usar un proxy para jugar lol como wtfast, nptunnel, exitlag, entre otros ... claro son de paga pero nunca está mal darte las opciones para que mejores tu ping y tengas una mejor experiencia de juego en otros servidores.      \nSaludos!{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]}]},{"poster":"MILFortune","date":"2019-02-22T18:33:40.473+0000","up_votes":4,"down_votes":3,"body":"Por mí, que no vuelvan.","replies":[{"poster":"Demeta","date":"2019-02-23T00:25:19.024+0000","up_votes":2,"down_votes":0,"body":"agree","replies":[]}]},{"poster":"Diosmo","date":"2019-02-22T18:16:02.512+0000","up_votes":2,"down_votes":0,"body":"Si, esta totalmente abandonado.\nMuy de vez en cuando se lo ve a Maggical.","replies":[]},{"poster":"Dalahsurfal","date":"2019-02-22T18:11:00.303+0000","up_votes":2,"down_votes":0,"body":"Ahí deje mi comentario y le di upvote al post, agregué ademas la pésima moderación que hay en este foro, que ni siquiera sabemos como se llama el moderador y si es humano...","replies":[]},{"poster":"Playmaker","date":"2019-02-22T20:07:27.782+0000","up_votes":3,"down_votes":1,"body":"antes se presentaban mas rioters o tenían mas relación con los jugadores , me gustaria que pudiera invitarlos a unas partidas en la grieta del invocador.{{sticker:sg-soraka}}","replies":[]},{"poster":"Diosmo","date":"2019-02-22T19:36:55.010+0000","up_votes":3,"down_votes":1,"body":"Agrego una cosa, somos el peor server de todo LOL, no tenemos competitividad y ni siquiera generamos ingresos para Riot (comparado con NA o EU) por ello medio que hay que agradecer que existe.","replies":[]},{"poster":"Diego Rosales","date":"2019-02-24T15:50:52.399+0000","up_votes":1,"down_votes":0,"body":"Riot es una empresa y como empresa si no recibe dinero de algo, deja de darle mantenimiento. Por ahora agradezcamos que todavía tenemos el server. De a poco se empieza a notar que el server se va lageando, ya están dejando de darle tanta importancia a los servidores, si no, no entiendo de donde sale el lag. No hay riorters, ni gente en soporte, todo se maneja con bots, claramente automatizaron el sistema, para recortar gastos. Unieron LAS con LAN, para tener menos gente contratada. Con el aumento al precio del RP, obviamente fue a propósito, rasguñan lo ultimo que pueden de la gente que si puede pagarlo y después chau server, paso lo mismo en otros juegos, el caso mas cercano es en un server de dota 2 que abrieron por varios meses, masificaron las ventas y después, closed. No digo que cierre pronto, pero viendo como va la mano, tal vez en 1 o 2 años terminemosjugando en BR o NA.","replies":[]},{"poster":"RENUNCIAP1Ñ3R4","date":"2019-02-24T07:43:53.426+0000","up_votes":1,"down_votes":0,"body":"aveces no es el juego, es la misma comunidad de mierda que en vez de reportar a los trolls, afk, flamer, se conforman con un free wins y se rien y cuando les pasa a ellos, no se rien, hacen lo mismo que les pidieron anteriormente que no hicieron y es por eso que LAS nunca surge en nada y nos tienen abandonados.","replies":[]},{"poster":"JunglaNoGankeaGG","date":"2019-02-24T07:32:57.329+0000","up_votes":1,"down_votes":0,"body":"Post censurado como lo esperaba jaja.\n\nAmigo no sé si conoces bien el Reddit de LoL, porque es una distopía Orwelliana. Sino tenes planeado hacer un post que le chupe las medias a Riot o hable de eSports, entonces olvidate de postear ahí. Los mods de allá te van a desaparecer del mapa si te atreves a decir algo malo de sus amos.","replies":[]},{"poster":"Nísta","date":"2019-02-24T01:39:46.235+0000","up_votes":1,"down_votes":0,"body":"Mensaje removido, hay captura o algo en lo que se haya reservado?","replies":[]},{"poster":"VenomousCell","date":"2019-02-23T04:51:59.842+0000","up_votes":1,"down_votes":2,"body":"Este juego ya murio amigos... solo hay gente jugando ahora por el urf... realmente se volvio una mierda xD","replies":[{"poster":"Teemo Best JoJo","date":"2019-02-24T00:30:44.084+0000","up_votes":1,"down_votes":0,"body":"Si se murio , PERO EN LAS Y LAN. Ya que en las otras regiones existen rioters","replies":[]}]},{"poster":"YuGGi ","date":"2019-02-23T21:55:54.440+0000","up_votes":1,"down_votes":0,"body":"que asco me dan solo dejan ver mas como no les importa un carajo la region con el hecho de que te hayan bajado el post , pura impotencia porque no muestran ni la mas minima señal de vida o de que le importamos al menos un poquito , server y launcher que andan para el ogt aumento de rps toxicos a mas no poder esto va de mal en peor y no hay muestras de mejora alguna , quiza algunas cosas esten fuera de su control pero todo suma para que me llene mas de asco todo este juego que solo vale la pena de por si jugarlo con alguien mas porque hacerlo solo es una mierda","replies":[]},{"poster":"Kenbunshoku Haki","date":"2019-02-23T21:02:45.809+0000","up_votes":1,"down_votes":0,"body":"Siento lo mismo, poca interaccion de Rioters en el Foro, y siento que Soporte no es tan eficiente como antes.","replies":[]},{"poster":"Turboint Seba","date":"2019-02-23T15:40:29.049+0000","up_votes":1,"down_votes":0,"body":"Le borraron el post en reddit, que putos.","replies":[]},{"poster":"TapateLasPatitas","date":"2019-02-23T04:34:50.150+0000","up_votes":1,"down_votes":0,"body":"Es que estos ya saben que la gente no se les irá completamente, sabe que no dejan de comprar rp, sabe que no dejan de jugar salvo pequeñas cantidades, se lavan las manos, los pocos y ningunos rojos que tenemos brillan por su ausencia salvo para un comentario a modo de chiste o para borrar comentarios xd","replies":[]},{"poster":"PússySlap","date":"2019-02-23T04:24:27.682+0000","up_votes":1,"down_votes":0,"body":"hehe","replies":[]},{"poster":"Identi","date":"2019-02-23T00:58:59.052+0000","up_votes":1,"down_votes":0,"body":"Te lo eliminaron al post en Reddit !","replies":[]}]}