{"poster":"sugarqf","date":"2015-08-19T07:02:09.432+0000","title":"DC's und kein Loss Prevented","subforum":"Melde einen Bug","up_votes":1,"down_votes":3,"body":"Hi,\r\nerste Runde am Tag und unser ganzes Team bekommt 5 mal hintereinander nen DC (Gegnerteam nat&uuml;rlich nicht).\r\nNichtmal ein dreckiges Loss Prevented? Was ist nur schief gegangen bei EUW?","replies":[{"poster":"Kaitri","date":"2015-08-20T01:11:15.827+0000","up_votes":1,"down_votes":0,"body":"hey hab grad ein spiel verloren, hab aber 5min bevor es aus war den strom gezogen. das war eindeutig ein dc also wo ist mein loss prevented?\n\nso einfach gehts nicht :D","replies":[]},{"poster":"InNeedOfWombat","date":"2015-08-19T07:39:44.976+0000","up_votes":1,"down_votes":0,"body":"Loss Forgiven gibt es nur bei bekannten Serverproblemen, oder einem Patchen. Nicht bei DC's die nicht von Riot herbeigeführt werden.","replies":[{"poster":"Protective Puppy","date":"2015-08-19T08:13:41.453+0000","up_votes":1,"down_votes":0,"body":"Naja, wir hatte auch ziemlich Zeitnah DC's in unserem Spiel. Also war es schon Schuld des Servers.","replies":[{"poster":"Alustus","date":"2015-08-19T12:10:28.858+0000","up_votes":1,"down_votes":0,"body":"dann hätten die gegner auch einen DC gehabt was anscheinend nicht der fall war","replies":[{"poster":"Protective Puppy","date":"2015-08-19T14:01:22.296+0000","up_votes":1,"down_votes":0,"body":"Also bei uns wars so :D (Bei mir wars nurn Normal)","replies":[{"poster":"Alustus","date":"2015-08-19T15:46:10.263+0000","up_votes":1,"down_votes":0,"body":"Naja gestern gab es irgendein problem (denke ich zumindest)\n\nViele spieler hatten durchgehend einen ping von 140+ während andere kein Problem hatten.\n\nIst mir gestern unter anderem bei Krepos  und froggens streams aufgefallen.\n\nOb es ein verteilerknoten war oder etwas anderes weiß ich nicht, bei einigen hat anscheinend ein Router neustart geholfen. (nur hören sagen)\n\n\nAber hier geht es ja um einen Dc was ja wieder etwas anderes sein sollte, zumindest in der Theorie und in meinem begrenzten Horizont :)","replies":[]}]}]},{"poster":"Nephirelle","date":"2015-08-19T08:16:42.239+0000","up_votes":1,"down_votes":0,"body":"Muss nicht sein. Ihr könntet auch in der gleichen Region hocken und ein Netzknotenpunkt hat gestreikt, etc. pepe.","replies":[{"poster":"InNeedOfWombat","date":"2015-08-19T08:29:46.735+0000","up_votes":1,"down_votes":0,"body":"1. xpeke\n2. wenn das was du sagst zu einem loss forgiven führen würde könnten 5mann premades gleichzeitig disconnecten und sagen das der server schuld wäre, jedes mal wenn sie verlieren ^^ das system währe dann viel ausnutzbarer ^^ einfach weiter zocken nächstes gewinnst du wieder.","replies":[]}]}]}]},{"poster":"420 No Scôpe","date":"2015-08-19T07:18:58.906+0000","up_votes":1,"down_votes":0,"body":"LP Gain is total behindert in Dia und dann nichtmal loss prevented wenn alle aus meinem Team DC haben wird wohl Zeit Hots anzufangen","replies":[]}]}