{"poster":"KÐβ Śarah Iημ","date":"2019-09-19T17:44:27.660+0000","title":"Ma Tryndamere, ha bisogno di un rework?","subforum":"Campioni e gameplay","up_votes":8,"down_votes":1,"body":"Dei champ rimasti da reworkare, io da anni ormai credo che Trynda sia quello che ne ha più bisogno. Non perchè sia debole, ma perché ha delle meccaniche vecchie e grezze (è lo stesso dalla season 1), che possono lasciare l'amaro in bocca a giocarci contro. Ad esempio il 33% di critico a livello 1 è il suo punto di forza in early, però è una meccanica tutta legata al caso, alla probabilità ed alla fortuna, tutte cose completamente estranee a ciò che rappresenta la competitività ad armi pari, infatti la RIOT nel corso di questi 10 anni ha eliminato quasi tutto ciò che fosse randomico, a parte cose minime e simpatiche come la clepto e le passive di {{champion:4}}  e {{champion:41}} . Soprattutto perchè tirare 3 critici fortunati di fila a livello 2 può voler dire vincere la lane subito, così come se non ne tiri manco uno perderla. Ma non è una cosa che controlli, è un caso, come era nella beta la Dodge chance, per chi se la ricorda (Jax che divava la fontana del nexus HEM).\r\n\r\nLa ultimate stessa cosa, per me 5 interi secondi di immortalità sono una cosa boh totalmente aliena per come gira il gioco adesso. C'è anni fà si nerfò Fiddlestick perchè aveva il fear più lungo del gioco che era di 3 secondi, qui stiamo parlando di un'immortalità flat di 5 interi secondi da livello 6. Non dico che non è counterabile, ci si gioca benissimo attorno, però dà comunque quel feel di skill vecchia. Soprattutto perchè poi lo sappiamo, trynda feeddato gira per la mappa facendo CIANK CIANK CIANK sopra ogni cosa e pure quello, non sà di nuovo ecco.\r\n\r\nE in aggiunta a tutto ciò, Trynda ha delle stat di base belle alte per quanto riguarda il campo dei dps melee.\r\nPer dirne un paio, Tryndamere ha 2300 hp di base a livello 18, un champ della sua stessa categoria e che segue quasi lo stesso build path che può essere Yasuo ne ha 2000. \r\nHa 345 mv speed di base, 132 ad base a livello 18.\r\n\r\nIo ho la sensazione che Tryndamere debba essere più un bruiser, però è effettivamente un dps melee, ma che ha delle skill impensabili ad oggi per un champ della sua categoria.\r\n\r\nNon sò, per me gli andrebbe data un'effettiva identità all'interno del meta **Reworkandolo**, voi che ne dite?\r\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-09-20T05:48:51.694+0000","up_votes":2,"down_votes":2,"body":"Si indubbiamente. Ora come ora Trynda non ha senso,perde quasi tutti i matchup e ormai tantissimi campioni sciolgono le torri o comunque pushano infinitamente meglio di lui ( con la differenza di essere anche più forti in generale),inoltre ha anche un'utilità che rasenta lo 0. In altre parole é un champ che non ha un reale motivo per essere pickato.\nPersonalmente sono proprio contro la meccanica del crit chance in generale, ma la sua meccanica RNG non é diversa dagli altri campioni che buildano critico quindi non vedo il problema su questo.\nPero per quanto riguarda la direzione della riot verso il fattore RNG non sono d'accordo,anzi, negli ultimi anni hanno aumentato moltissimo il randomico","replies":[{"poster":"Luckynanix","date":"2019-09-20T06:10:07.455+0000","up_votes":3,"down_votes":2,"body":"Il fatto è che gli altri champ devono ottenere oggetti per avere crit chance mente trynda critta già da lvl 1.\nSul fatto dell'utilità mi trovi in disaccordo perché non è un champ che puoi informare in TF ne puoi burstarlo (causa ulti) o perlomeno devi usargli un cc per tenerlo fermo e se vuoi burstarlo per non farlo ultare.\nChe abbia counterplay è un conto ma inutile non è","replies":[{"poster":"Shaana","date":"2019-09-21T07:12:58.539+0000","up_votes":1,"down_votes":1,"body":"in S1 GP poteva crittare di Q da subito mettendo tutt ele rune in crit chance. Se eri fortunato devastavi con un colpo il nemico, giustamente tolsero quelle rune e resero quella cosa mooooolto difficile se non quasi impossibile per GP ai primi livelli. Ma Trynda è Trynda GP è GP e da qui si vede il modo diverso di bilanciare da parte loro negli anni.","replies":[{"poster":"liberodaniele","date":"2019-09-21T11:37:41.773+0000","up_votes":2,"down_votes":1,"body":"Le rune crit chance sono esistite fino al rework delle rune/maestrie (rip 1% critico sugli adc)","replies":[{"poster":"Shaana","date":"2019-10-10T14:58:09.593+0000","up_votes":1,"down_votes":0,"body":"infatti ho fatto riferimento di un evento di aanni e anni fà, ma anche un esempio di come non esitarono di distruggere una meccanica OP su alcuni personaggi al contrario di ora che fanno di tutto per creare un solco assurdo tra i vari Rank. Senza contare che queste nuove rune sono a mio parere terribili al 50%","replies":[{"poster":"liberodaniele","date":"2019-10-21T11:27:06.441+0000","up_votes":1,"down_votes":0,"body":"Non le hanno tolte \"per gp\" o per nerfare qualcuno (anche perchéeerano praticamente inutilizzate quelle rune) ma le hanno tolte perché hanno tolto TUTTE le vecchie rune","replies":[]}]}]}]},{"poster":"V3LK0ZMAST3R","date":"2019-09-20T11:45:02.642+0000","up_votes":1,"down_votes":1,"body":"Inutile é inutile. Non ha capacità ne di ingaggio,ne controlli (tranne uno slow a target singolo) ne potenziale peel, ne potenziamenti per i compagni.\nÉ un melee che non può buildare efficacemente resistenze quindi la sua immortalità la spreca praticamente solo per raggiungere l'avversario per dare 2 AA prima di crepare (e spesso nemmeno la supera la frontline). In tf Trynda é l'inutilità fatta a champ, il suo gameplay gira appunto su un continuo splitpush evitando qualsiasi tf dove varrebbe quanto un minion.\nNon capisco quale sia la differenza se sia nel kit o negli item,sempre dello stesso fattore RNG si tratta. Che sia un Trynda dal LV 1 o una Tristana che torna con{{item:1018}}  sempre di culo si parla.\nOgni champ che nel kit si butta in mezzo e fa danni richiede un CC per eliminarlo senza problemi, ma é tutt'altra cosa rispetto all'utility.\nPiù che la passiva (di cui comunque capisco la critica) il problema é la ulti,dato che per bilanciarla hanno dovuto dargli uno schifo nel resto del kit mantenendo però la frustrazione nell'affrontarlo.\nPS: anche fosse sotto CC pesanti può ultare comunque","replies":[{"poster":"Shaana","date":"2019-09-21T07:17:25.636+0000","up_votes":1,"down_votes":1,"body":"Il problema di Tryndamere nei rank bassi sopratutto, è che la Riot ha reso il danno talmente alto (e spesso casuale) che spesso si preferisce quello ai CC a tal punto che nei ranghi bassi usare un eroe con CC è molto difficile per vari motivi ergo spesso Tryndamere è devastante anche perchè spesso non sanno contrastarlo in lane phase. Lui si butta sotto invul farmato, ci sono pochi cc 2 hit 2 morti lui muore te perdi la torre. Oppure non ci stanno assalti ben fatti quasi sempre non si riesce aaa davanzare 4v5 e lui sopra ne distrugge 3. Easy hero per nabbi che salgono facile i livelli più bassi, si sentono pro in realtà sono scarsi e poi cozzano su chi un minimo di CC sa usare, e questi eroi sono uno dei motivi dell'inquinamento nei rank.","replies":[]}]}]}]},{"poster":"Lord ElMelloi ll","date":"2019-09-19T21:48:55.282+0000","up_votes":1,"down_votes":1,"body":"Tryndamer è il campione più sbagliato del gioco: è la passiva il problema. Mettere del RNG in un gioco di strategia è sempre sbagliato, i trade in early e la lane è basata molto sulla fortuna ed è frustrante giocarci contro peggio di yasuo, zoe o teemo. Io farei così: passiva che a massimo di furia da un colpo critico assicurato al terzo attacco (tipo la passiva di jax della r) così facendo è come se avesse 33% di critico ma con finestre di trade. Poi se compri 50% critico si ha a massima furia, 100% possibilità da crittare, come adesso con due oggetti da critico. Con questo cambiamento la lane sarebbe molto meno frustrante da giocare. Poi come dici tu i 5 secondi di immortalità sono un po' troppi forse, bisognerebbe provare se non rendono il campione veramente inutile in tf. Un altro modo da bilanciarlo sarebbe di diminuire la salute per livello in modo da burstarlo velocemente, costringendo la r prima. Un altra cosa orribile, ma necessaria, è il cd della e. Capisco che se fosse troppo alto e l' avversario dasha tryndamer non fa nulla ma 5 secondi con 2 secondo in meno per ogni critico è un po bassa per me.\n\nIo lo banno sempre e comunque, solo il vederlo è la cosa più tiltante in lol.","replies":[{"poster":"XPY99","date":"2019-09-20T00:33:00.169+0000","up_votes":1,"down_votes":1,"body":"Che poi quando se ne scordano e abbassano anche di poco il cd della e vedi sempre qualcuno ritirare fuori trynda Ap","replies":[{"poster":"Luckynanix","date":"2019-09-20T04:52:29.746+0000","up_votes":1,"down_votes":1,"body":"È una citazione a Fierik? XD","replies":[{"poster":"XPY99","date":"2019-09-21T20:23:17.481+0000","up_votes":2,"down_votes":1,"body":"Chi sarebbe?","replies":[{"poster":"Luckynanix","date":"2019-09-22T08:55:08.654+0000","up_votes":1,"down_votes":1,"body":"Uno streamer che gioca in iron con trollpick (trynda ap, Jax AP, malphite ad)","replies":[]}]}]}]}]},{"poster":"COATTOQUALUNQUE","date":"2019-09-21T17:26:09.791+0000","up_votes":2,"down_votes":1,"body":"Tryndamere va benissimo così.","replies":[{"poster":"Térence Fill","date":"2019-09-25T12:57:08.944+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=COATTOQUALUNQUE,realm=EUW,application-id=cAOZwaUi,discussion-id=jFZAtOnr,comment-id=0006,timestamp=2019-09-21T17:26:09.791+0000)\n>\n> Tryndamere va benissimo così.\n\n+1","replies":[]}]},{"poster":"Vileblood Pyke","date":"2019-09-20T00:55:28.402+0000","up_votes":2,"down_votes":1,"body":"Il mio sogno è che venga reworkato come Aatrox e gli spostino il danno dagli autoattacchi alle abilità.\n\n\nComunque la passiva di GP non ha niente di randomico...","replies":[{"poster":"liberodaniele","date":"2019-09-21T11:38:20.516+0000","up_votes":1,"down_votes":1,"body":"Trynda ap is the way!","replies":[]}]},{"poster":"Térence Fill","date":"2019-09-25T12:40:55.210+0000","up_votes":1,"down_votes":1,"body":"E' proprio il fatto che sia vecchio, rozzo, non ingaggiabile con la rage stackata (CC esclusi, che lo distruggono letteralmente), ed incredibilmente stupido e ad uso e consumo di capre e caproni, abile unicamente ad andare dritto per dritto in una Lane, nonché inutile in tutto ciò che sia differente dallo split-push, a renderlo **dannatamente bello**. Diamine!\n\nIo non ce la farei mai a reworkare una roba così ignorante: è unico, non ditemi di no! E sono uno di quelli che ha boionato in svariati dialetti, vedendo le proprie gambe segate dal roteante urlatore che fuoriusciva, senza ragione alcuna, dalle fottute pareti. **MA** lo ritengo comunque insostituibile!\n\nE' un gabinetto a pedali come Teemo, solo che a quel coso puccioso gli vogliono tutti bene perché canta filastrocche degli Scout che fanno tiltare l'avversario, anziché gridare come un ossesso quando preme R.\n\nE' l'unico Champion che ha tutto il diritto di dimenticarsi che durante il Game, nella Landa, ci sono altri 9 malcapitati che giocano (e spesso e volentieri, questo, è solamente un bene). Perchè deve split-pushare. Deve sbattere ripetutamente ferro e mattoni. \nEd i Champion avversari sono unicamente un impedimento, una perdita di tempo imprevista, che lo separa dal crollo della prossima Torre nemica. \nNon serve a niente, se non a quello.\n\nE' **FANTASTICO**!\n\n\"Mi sono andati male 13 Game di fila? Fanc*lo, picko Trynda: come va, va. Ma io mi diverto!\"\n\nChe League sarebbe senza di lui, così come è ora?\nA me, mancherebbe tantissimo!\n\nToccatemi tutto, ma NON il mio \"AAAAAAAAAAAAAHHHHHH\"!\n\n\n{{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"Erax157","date":"2019-09-19T20:36:56.743+0000","up_votes":1,"down_votes":1,"body":"Infatti il suo rework è gia stato confermato anche se non si sa per quando","replies":[]},{"poster":"FoxAnime1","date":"2019-09-20T08:48:27.511+0000","up_votes":1,"down_votes":2,"body":"Si magari la utli sarebbe da modficare,capisco che diventi\"immortale\" per finita la ulti dovrebbero far in modo che i dnni subiti quando trynda è in ulti vengano messi in conto,oppure finita la ulti lui muore,non trovo giusto che finita la ulti lui sia ancora vivo.","replies":[]},{"poster":"Shaana","date":"2019-09-21T07:10:13.418+0000","up_votes":2,"down_votes":3,"body":"Per volere dei fiinti pro che lo usano per scalare facile facile nei liv più bassi non lo toccheranno mai.","replies":[]}]}