{"poster":"Doxim","date":"2016-10-26T03:22:22.167+0000","title":"Shaco nerfs are too harsh","subforum":"Gameplay","up_votes":77,"down_votes":14,"body":"I main Shaco, and don&#039;t think he is currently that strong.\r\n\r\nI do not understand the philosophy behind nor the implementation of the PBE changes to Shaco. Here is what Riot said about the Shaco mini rework:\r\n\r\n&gt; Shaco could use a lot of love, enough that we can&rsquo;t solve all of his problems as part of a class update. However, that&rsquo;s no reason to ignore The Demon Jester. Shaco has always been known for his niche combat tricks, but we want to make those feel more relevant in teamfights and skirmishes. With that being said, his early game ganks need to be toned down. Shaco players should feel good about tricking their opponents, rather than merely appearing out of nowhere at level 3 and ruining their lane.\r\n\r\nTL;DR - The mission is to tone down Shaco&#039;s early ganks and improve his teamfighting/skirmishing. \r\n\r\nIn implementation they nerfed Shaco at every stage of the game.\r\n\r\nPassive - Backstab\r\n\r\nOld\r\n1.  20% bonus damage when striking from behind\r\n\r\nNew\r\n1.  120-145% minicrits when striking from behind (scaling by level)\r\n2.  3s Cooldown (modified by cdr)\r\n3.  200% minicrit on monsters\r\n4.  Does not work with E\r\n\r\nAnalysis - Complete nerf at every stage of the game, for every build of shaco. \r\nAP - Nerfed because it doesnt apply to E\r\nAD - Nerfed at level 1 because it essentially adds a 3s cd, nerfed at every other stage of the game because it replace&#039;s Q&#039;s crit scaling with a smaller crit %.\r\nHybrid - Nerf because Hybrid relies on E and the new Q scaling for damage, but E will not benefit from 20% backstab damage and had its ratio&#039;s cut.\r\n\r\n\r\nQ - Deceive\r\n\r\nOld\r\n1.  Shaco Becomes stealthed for 3.5s, first attack during or soon after stealth deals a 140/160/180/200/220% dmg crit.\r\n\r\nNew\r\n1.  Shaco Becomes Invisible for 1.5/2.25/3/3.75/4.5\r\n2.  Cooldown increased to 14 seconds from 11 seconds\r\n3.  Mana cost changed to 60 from 90/80/70/60/50\r\n4.  20/35/50/65/80 (+100% total AD)(+50% AP)\r\n5.  Attacking during or shortly after invisibility will reduce Deceive&#039;s CD by 2.5 seconds\r\n\r\nAnalysis - Complete nerf at every stage of the game for AD Shaco, slight buff for AP Shaco, and hybrid Shaco is garbage.\r\n1. The Invisibility time now will not be equivalent with Live Shaco until 4 points which is level 7 at earliest.\r\n2. This Invisibility change nerfs Shaco&#039;s early game as intended by the philosophy.\r\n3. The CD was increased by 3 seconds, but can be reduced by 2.5s (so its only a .5s nerf) IF shaco lands an attack. This is a nerf to all shaco play styles as it just generally means less survivability from Q (its main purpose).\r\n4. Shaco always had mana problems, so the mana cost reduction is nice.\r\n\r\nAD - Nerfed pure and simple. This change adds roughly 15 dmg per point to an ALL IN attack which leaves Shaco with no means of escape, but removes its crit scaling. This is 100% a nerf at every stage of the game, and gets worse in the late game. Remember that the 100% AD it mentions is not 100% more Attack Damage added to your next attack, it&#039;s literally just saying it&#039;s going to do _your current AD_ PLUS 20 (at lvl1).\r\n\r\nAP - I&#039;m going to say this is a nerf at every stage. Early, AP Shaco relies on stealth to survive which got nerfed. Late, an AP Shaco will have enough AP to make a .5 scaling outscale the basedmg crit/backstab increase of old shaco&#039;s Q and Passive. (220% dmg on 117.08 base damage was 258 dmg +20% lost from old passive =308 total , this means that 117 base dmg + 145% new backstab crit = 170 dmg, which means that AP shaco has to have at least 276 AP before it does more damage than a completely itemless level 18 shaco on live). **Unfortunately an AP Shaco now has the choice between two poorly scaling abilities early game, neither of which has good base damage (Q and E). **\r\n\r\nHybrid - Maybe a buff, but there are really only like two hybrid items and I don&#039;t think Riot really intends to build this playstyle beyond Jax.\r\n\r\nW - Jack in the box\r\n\r\nOld\r\n1.  60s Stealthed duration\r\n2.  0.5/0.75/1/1.25/1.5 fear when popped\r\n3.  Fires for 5s when popped\r\n\r\nNew\r\n1.  +1s **STEALTHED** duration per 20AP\r\n2.  Health scales with Shaco&#039;s level\r\n3. Can not be stacked\r\n4.  Can be placed from stealth but gives away Shaco&#039;s position\r\n\r\nAnalysis - Nerf for jungle shaco, buff for team fights\r\n\r\nJungle - No stacking means worse jungle starts, death bushes, and no double boxes to stop dashes. Also was a way to make sure a &quot;hive&quot; of boxes got some shots off before dying, hopefully health scaling will help. Unfortunately, health scaling means they start out weaker, and objectives like dragon can not be tanked by boxes until much later. Dropping boxes in stealth is a gimmick because it gives away Shaco&#039;s position anyway. Everyone will react as if you had just become visible anyway. Duration increase is nearly meaningless?\r\n\r\nTeam fights - Health scaling helps, the rest doesn&#039;t matter. Removal of stacking is a slight nerf.\r\n\r\nE - Two Shiv Poison\r\n\r\nOld\r\n1.  Slows movement by 10/15/20/25/30%\r\n2.  Slows monster attack by 20/22.5/25/27.5/30%\r\n3.  50-210 (+100% AP) (+100% Bonus AD)\r\n\r\nNew\r\n1.  5/35/65/95/125 (+90% AP) (+85% total AD) + [3-8% of target&#039;s missing health]\r\n2.  Slows movement by 20/22.5/25/27.5/30%\r\n\r\n\r\nAnalysis - Nerf at every stage of the game for every build of Shaco. Removal from backstab passive is a straight 20% situational damage nerf, regardless of build. Moving on from that, let&#039;s consider the new damage / scaling. Removal of monster attack speed slow will likely be balanced by health scaling in the later game, but clears aren&#039;t a problem then any way, and box survivability has gone down early (when it is needed most)\r\n\r\nat rank 1, a target would have to be missing 1500 HP to match the same damage as the old one.\r\nat rank 5, a target would have to be missing 1062.5 HP to match the same damage as the old one, BUT WAIT! Don&#039;t forget about the 15% AD nerf, and 10% AP nerf to scaling. Couple this with the fact that Q is &quot;Meant&quot; to be leveled up first, and that means this will be getting maxed around the late game. This means that for the losses in AP/AD scaling, your target will likely _**still have to be missing around 1500 HP**_ to make up for the last damage. If anyone argues that Shaco is meant to be played hybrid now, realize that this is a bigger nerf to Hybrid Shaco than any of his other changes can make up for.\r\n\r\nR - Hallucinate\r\n\r\nGot a Meme. A useless, useless meme. AI changes might help. ?\r\n\r\n\r\n\r\nSo in conclusion:\r\n\r\nPassive - Massive Nerf\r\nQ - Nerf\r\nW - Nerf\r\nE - Huge Nerf\r\nR - Memed\r\n\r\nI think these are all just numbers tweaks, but it needs to be fixed before the patch is released. This is too much, and Shaco will be too weak if this goes live.","replies":[{"poster":"NichtHurz","date":"2016-10-26T08:39:08.777+0000","up_votes":18,"down_votes":4,"body":"I have absolutely no idea what the intent of these changes is. I understand that Shaco's early game is quite strong and cheesy for enemy players, but right now I still deem him one of the most healthy assassins regarding his scaling. Shaco really needs to get a few kills to get rolling and delete his targets, while other assassins can do that without even being fed. Nerfing every single scaling he has AND removing his strong early game just leaves me clueless what to do with him. His Q is insanely weak now, his E can't be skilled first and lost tons of power and his passive seems just like they made it a weaker version of his old Q meaning that Q + passive now does around the same amount of dmg as his old Q if you attack the enemy from the front...\n\nI'm sad...if they leave him as it is I'll be forced to completely stop playing him, because this doesn't seem like it'll be fun to play.","replies":[{"poster":"TequilaZombie","date":"2016-10-26T16:58:30.216+0000","up_votes":4,"down_votes":0,"body":"I'm going to at least try and find a way to make AD Shaco work. If nothing else, he'll keep on being the best split pusher in the game after he gets {{item:3087}} + {{item:3074}}.","replies":[{"poster":"Doxim","date":"2016-10-26T22:37:13.400+0000","up_votes":2,"down_votes":0,"body":"Split pushing didn't get nerfed too bad, but remember that statik's effect critting is increased by shaco's old Q, so in a way even that got nerfed.","replies":[{"poster":"TequilaZombie","date":"2016-10-27T00:01:09.458+0000","up_votes":3,"down_votes":1,"body":"Thankfully he doesn't need his Q crit to clear effectively. Now we can even boost SS without having to use Q, so he will clear even faster.\n\nFuck. I can see him getting nerfed after reaching live.\n\n>Patch 6.25\n\n>Shaco's rework has given him way too much power with split pushing, so we're reducing his stealth duration to 1.5/1.6/1.7/1.8/1.9 seconds and changing his passive to bonus damage instead of crits.","replies":[{"poster":"Doxim","date":"2016-10-28T00:40:40.672+0000","up_votes":1,"down_votes":0,"body":"Clear jungle faster, yes. Clear minion wave faster, no.","replies":[{"poster":"TequilaZombie","date":"2016-10-28T08:39:32.267+0000","up_votes":1,"down_votes":0,"body":"Past early game he has no need for backstabs or Q crit to clear waves fast. It shouldn't make that big of a difference. It's probably the one thing that will stay the same.","replies":[]}]}]}]}]},{"poster":"Pus","date":"2016-10-30T06:52:37.608+0000","up_votes":3,"down_votes":0,"body":"You're right about his current state, the changes now seemed to be made by someone with no in-game knowledge. His passive having a cooldown would only make sense if they buffed his Q damage, but they nerfed it instead on every feature.\n\nAlso for his E, if they were gonna give him single digit base values because they want to give him \"execution damage\" with that also only being single digits then they need to fire whoever's been working on these champion tweaks, cause it's terrible. % Missing HP damage falls third in the tier of enemy hp scaling as damage with %Max as first and %Current as second. The lower you go down that tier the more % you can tack on and/or add base damage and still be healthy (look at Eve's R for reference, she can't kill any 1hp targets because of no base damage and it dealing only %current damage which is only tier 2 on the list, so imagine this skill).\n\nFollowing this, the way they nerfed his E base damage and scaling you'd think it would do true damage or %Max HP damage now, but it doesn't, it's backwards. Watch some shaco mains on youtube trying out the changes, they are horrible, he's gutted on every level. The only current change to the pbe changes that would literally make him somewhat viable without reverting the changes is if his new passive was something along the lines of \"all damage you do is true damage\" because he effectively lost over 50% damage in everything in his kit.\n\nA fun thing they could have done was make his E an ability first of its kind to be able to do damage to both tanks AND carries and have it do all three types of %enemy damage and split it in two parts for counter-play like this, if his shiv hits a champion it deals:\n\n3/6/9/12/15% Maximum HP + 6/12/18/24/30% Current HP as magic damage\n\nAnd if Shaco autos that target in the next few seconds he retrieves the shiv and deals  9/18/27/36/45% Missing HP damage as magic damage, with this portion of the damage only scaling off the missing HP he chunked with the damage dealt with the initial hit.","replies":[]},{"poster":"maikokk","date":"2016-10-27T02:45:13.812+0000","up_votes":2,"down_votes":0,"body":"ive been experimenting on pbe a bit. we need to bring additional base values and scalings into his build to make him viable whatsoever as an assasin. also, we need CDR. a ton. max cdr. you cant kill anyone who isnt a \"gimme\" early - mid game without it\n\nAP {{item:3100}} {{item:3285}} {{item:3115}}  seem mandatory\n\nAD {{item:3078}} {{item:3087}} {{item:3031}}  is already a build i use on many mobile spell based characters who can off-meta adc  with mixed damage and dont care about attack speed too much\n {{champion:37}} {{champion:103}} {{champion:105}} {{champion:245}} this build makes them  \"viable enough\" to compete by taking advantage of adding burst to their normal spell rotations with the IE CRit statik proc spellblade shotgun effect. \n\nit happens to be perfect for shaco. just replace{{item:3074}}   for  {{item:3078}}  then maybe {{item:3508}} after our core.  overshooting our cdr a little bit, but sealing the deal on anyone with multiple escapes","replies":[]}]},{"poster":"MrEnder","date":"2016-10-26T04:18:01.229+0000","up_votes":13,"down_votes":2,"body":"As a shaco main I'm bumping this even though Riot never reads player feedback on champs like Shaco. This is why Eve sucks now.","replies":[]},{"poster":"DanWaigand","date":"2016-10-27T04:45:24.900+0000","up_votes":7,"down_votes":0,"body":"I'm another Shaco Main who will likely be uninstalling League Of Legends when this rework goes through. \n\nI main him in the Support role, causing my team to almost immediately become heavily toxic, and it only gets worse if they start losing (as I've found that me picking Shaco support often somehow directly causes top to lose and feed 9 times?)\n\nRegardless... He isn't particularly broken. He's squishy as hell, and yes he can come out of nowhere, but I've bothered to actually learn shaco's moves. on the occasion a Jungler~Shaco shows up, I can counter him easily. I've encountered two support-shacos since I started maining him and was able to 1v2 botlane vs SupportShaco and Missfortune as Soraka, a previous main that Riot completely destroyed, accidentally made too strong, and then attempted to destroy again. \n\nNaturally I'll get bored in like a year, come back, and see how you've managed to screw up other characters, but this Shaco update is needless, pointless, and just utterly stupid. It completely ruins his character making him a non-hazard to consider, and a single (and cheap) pink ward will take most of his shock value away!\n\nknock it off Riot, you screwed up again! Just like you did with Soraka","replies":[]},{"poster":"The Planeswalker","date":"2016-10-26T19:02:36.823+0000","up_votes":7,"down_votes":0,"body":"I've tried the new shaco, and it's kind of stupid that building crit doesn't really work on him now in spite of him critting naturally. How counter-intuitive is it that his passive actually REDUCES his damage from behind as opposed to striking from the front if you can successfully crit? When riot said they'd put an AP ratio on his Q, I didn't think that meant they would sacrifice his typical AD build to do it. \n\nI absolutely love the design of the new kit, %HP is nice, Meme ult's fun and can make for a tricky escape (but fear duration should be longer), stealth duration and long CD sucks but 4.5 max rank is nice. \n\nHe seriously needs some love in terms of actual numbers and not just cool ideas. Why do the other assassins get to have SO MUCH damage when Shaco just gets put into an awkward place with his build? You can't build crit, but flat AD got nerfed, but AP doesn't proc backstab anymore, etc.\n\nAt the very least I think Q needs it's damage pumped up a LOT higher. If shaco is meant to have \"niche combat tricks\", reward us for critting in the back with the Q, don't punish us by making us think \"Ah man I've got IE and SS, I should've crit from the front instead! How stupid of me for trying to use my kit!\" Alternatively, you could do something like graves where building crit would boost said backstab damage.","replies":[]},{"poster":"Dracocrash","date":"2016-10-26T05:58:09.624+0000","up_votes":7,"down_votes":1,"body":"lol, just because u cant stack boxes doesn't mean you cant cheese the level 1 camp with multiple boxes. You just have to place the boxes a little apart from each other around the buff.","replies":[{"poster":"Doxim","date":"2016-10-26T11:39:32.990+0000","up_votes":8,"down_votes":3,"body":"Without placing them all in one spot you can't tell what way a monster will face, so you will lose backstabbing damage. Also you can't put 2 in one place so monsters will split and attack 2 boxes instead of shack tanking one while letting a box tank the other. Beyond all of this, I think it's a nerf meant to fix a spaghetti code problem, and any time you remove skill from a champion in favor of randomness that's bad.","replies":[{"poster":"My Waifu Vanilla","date":"2016-10-26T19:11:23.262+0000","up_votes":3,"down_votes":0,"body":"I mean backstab has a cooldown now so the argument that you won't know where they will face is a moot point since you only have to hit them from the back once every 3 seconds.","replies":[]},{"poster":"Limrick","date":"2016-10-26T20:24:05.846+0000","up_votes":2,"down_votes":0,"body":"There's only one monster at the buffs now.","replies":[]}]},{"poster":"Verdade","date":"2016-10-26T11:18:40.848+0000","up_votes":2,"down_votes":0,"body":"Which means slower clear time, which means slower ganks, which means weaker shaco\nIf they want to do this change, they should change it to store charges instead of normal CD, just like Teemo's traps...","replies":[]},{"poster":"Dark Warrior","date":"2016-10-27T17:58:40.910+0000","up_votes":1,"down_votes":0,"body":"lvl 1 cannot do partors as new shaco (no smite)\n\nlvl2 still cannot do raptors (without smite )\n\nlvl 3 still cant do raptors without smite ...?\n\n\nExcuse me ? play in PBE 1st then talk, ooh wait you can't nvm","replies":[]}]},{"poster":"Primaquarius","date":"2016-10-26T20:04:47.251+0000","up_votes":5,"down_votes":0,"body":"What the fk are these numbers? I don't main Shaco, but given that Ive at least played him in jungle at one point means Im also in on not liking this reworked kit. They nerfed his W, the only zone/waveclear tool he has, they nerfed Q stealth duration for no apparent reason which doesnt allow Shaco to pull off escapes or ganks nearly as well, and gave his Ability the Akali treatment with a 3s cooldown window to shave his physical damage output by a lot during 1v1s.\n\nWhy is this the meta for reworks nowadays?\n\n_Special reminder that Shaco is also an assassin_","replies":[]},{"poster":"MrEnder","date":"2016-10-26T22:00:35.568+0000","up_votes":4,"down_votes":0,"body":"I wonder if Riot will even look at this. Riot tends to never care about this kind of stuff.","replies":[]},{"poster":"Weathered","date":"2016-10-26T19:49:01.111+0000","up_votes":4,"down_votes":0,"body":"I fell out of a chair as a Shaco main when I realized the illuminati ult wasn't a joke and they are actually using it as a gameplay change.","replies":[]},{"poster":"yoshi2790","date":"2016-10-26T17:06:52.761+0000","up_votes":1,"down_votes":1,"body":"{{item:3285}} {{item:3100}} {{item:3135}}  {{item:3089}} {{item:3146}} \nIs the way to go, and it's really strong.","replies":[{"poster":"MunchCrunchLunch","date":"2016-10-26T17:08:35.956+0000","up_votes":4,"down_votes":0,"body":"ap shaco is stupid.  it doesn't help the team. in any way. other than annoying a single target on the enemy team. good luck team fighting or getting objectives or clearing jungle with that build","replies":[{"poster":"Battlecast Sona","date":"2016-10-26T20:34:49.382+0000","up_votes":3,"down_votes":2,"body":"it's almost like they added a potential AoE fear to his ultimate explosion and additional AP damage on Q to make him better at teamfighting, or something. It's almost like adding duration and HP to his boxes allows him to more easily set up around a teamfight and contribute.\n\nIt's almost like these changes were **specifically focused** at allowing AP Shaco to contribute **more to teamfights than he could previously**.","replies":[]}]}]},{"poster":"QOE","date":"2016-10-26T14:35:27.726+0000","up_votes":4,"down_votes":0,"body":"I agree, these nerfs are way too much. It seems like they gutted his current play style completely and want to change the way he is played, but they don't provide enough buffs to his late game to compensate, rip shaco","replies":[]},{"poster":"FHMarshy","date":"2016-10-26T15:38:15.302+0000","up_votes":5,"down_votes":1,"body":"From another fellow Shaco lover. \n\nPLEASE DON'T TOUCH OUR SHACO!!!!!!!!!!!!!!!!!!!!!!!!","replies":[]},{"poster":"Sylvan Lore","date":"2016-10-26T20:41:32.704+0000","up_votes":1,"down_votes":3,"body":"I think you're really missing the value in his ultimate. With all of the boxes dropping when the clone dies in the middle of a team fight, that is essentially going to fear close to the entire enemy team for a substantial period of time. This not only lets shake go in for his usual assassination, but he also gives a great large AOE fear for his team after he goes in.\n\nAlso with the huge buff of the lack of pink wards to all invisible champs, it would be completely unfair if any of them weren't scaled back a bit due to a lot less counter-play. Now that late-game 4.5 second invisibility really is going to be as strong as it should.","replies":[{"poster":"Doxim","date":"2016-10-26T22:46:14.972+0000","up_votes":4,"down_votes":0,"body":"The mini boxes are just a meme, they might have a usage after time, but they share health take time to go into stealth and even if they activate do less dmg/fear than a normal box. It's a funny meme, I like it, but it's not really that useful.","replies":[]}]},{"poster":"Sightless66","date":"2016-10-26T17:58:16.022+0000","up_votes":3,"down_votes":0,"body":"In the interest of accuracy, I have to point out one error I saw.\n\n>Unfortunately, health scaling means they start out weaker, and objectives like dragon can not be tanked by boxes until much later. \n\nThis is not actually true. The current health of the boxes on live is 150. The health scaling on the PBE is 150 - 550. They are the same at level 1, and only get healthier from there.","replies":[]},{"poster":"DrugsForRobots","date":"2016-10-26T17:32:33.311+0000","up_votes":4,"down_votes":1,"body":"It makes me want to quit the game that Riot's (20thCenturyFaux?) solution of 'toning down his early ganks' is to nerf his invis duration, rather than, IDK, playing up his unique tell-tale signs?!?\n\nHe has a puff-of-smoke and an evil laugh whenever he uses Deceive. Don't nerf his invis duration - make it more evident when Shaco has gone invis. Make the puff-of-smoke a bit larger, more vibrant, make sure it can be seen through the Fog of War if your camera is over that area. Make his evil laugh louder and audible within a huge range (2K units, the range of Vayne's passive).\n\nThis gives his opponents a chance to respond if they're paying attention (i.e. not livestreaming while jamming to music and crunching on some doritos.) It's called telegraphing and Riot does it for every other champion and ability, but not for invis??? And with changes like these, he can mind-game the enemy without actually ganking them!\n\n*sigh* Riot, please.","replies":[]},{"poster":"The Blue Rajah","date":"2016-10-26T17:57:45.664+0000","up_votes":3,"down_votes":4,"body":"The change to e isn't as bad as it looks. Going from bonus to total ad is actually a buff, and means the base damage is higher than it sounds. Also, pink wards won't reveal his invisibility anymore, and that's a significant buff too. \n\nI would still be a bit worried about whether the changes are too harsh, but wait until you can play him before you decide.","replies":[{"poster":"Weathered","date":"2016-10-26T19:52:52.219+0000","up_votes":3,"down_votes":0,"body":"However the new detection wards disable all boxes in an area. Rip lane Shaco.","replies":[]},{"poster":"Battlecast Sona","date":"2016-10-26T20:35:58.228+0000","up_votes":2,"down_votes":0,"body":"oh wait it's **total AD now**?\n\nThat means it's a net buff instead of a nerf. Kappa","replies":[{"poster":"Doxim","date":"2016-10-26T22:39:38.361+0000","up_votes":1,"down_votes":0,"body":"No, it's not. its 85% bonus AD, and its a nerf.","replies":[{"poster":"Narsicus","date":"2016-10-27T05:34:24.107+0000","up_votes":1,"down_votes":0,"body":"The info on the PBE says that it now scales with total AD, which means that the AD portion of its damage has been generally buffed.","replies":[{"poster":"JedenVojak","date":"2016-10-27T06:58:17.434+0000","up_votes":1,"down_votes":0,"body":"Except that the loss of the base damage and bonus ad ratio do not actually make up for the lost damage.\n\nOn base damage alone the maxed E will do like 15 more damage _at level 18_. At 200 AD he's at parity with the current E, with any additional AD on top of that just being worse off overall.\n\nAnd that's without factoring in the 20% backstab bonus.","replies":[{"poster":"Narsicus","date":"2016-10-27T10:27:04.482+0000","up_votes":1,"down_votes":0,"body":"Which is why I specified \"the AD portion of its damage\", it would take quite a bit of AD for 15% of bonus AD to outweigh all of Shaco's natural AD.\n\nI fully admit the overall damage of Shaco's new E might be worse overall, I haven't really looked into it but it certainly seems the case just glancing at the numbers. I was simply trying to correct the notion that Shaco's E still scales with bonus as opposed to total AD.","replies":[]}]}]},{"poster":"Schàdenfreude","date":"2016-10-27T03:57:00.603+0000","up_votes":1,"down_votes":0,"body":"Kappa*","replies":[]}]}]}]},{"poster":"Choaru","date":"2016-10-26T20:13:28.837+0000","up_votes":2,"down_votes":0,"body":"As someone who has Mastery 7, and loves him dearly.\nI hate the nerf to his Q. His overall burst potential compared to other assassins: Kitty Bug, and Blades, all who have similar kits, is terrible.\nHis new passive makes him a bruiser more than an assassin...","replies":[]},{"poster":"Saianna","date":"2016-10-26T13:34:59.467+0000","up_votes":2,"down_votes":0,"body":"> Team fights - Health scaling helps, the rest doesn't matter. Removal of stacking is a slight nerf.\n\nIf I can say I know Riot, then health stacking will suck terribly and 18 level Shaco will have like 20 hp more on JitB than what we have now (against 300AD ADC, good luck)\n\nAlso removing hive was huge fucking nerf. Shaco used to make 5-box traps. Riot nerfed it to 3~. Now to 0. With no DMG buff.","replies":[]},{"poster":"ff4sk","date":"2016-10-26T22:35:04.086+0000","up_votes":3,"down_votes":1,"body":"Bump, riot needs to fix this abortion they call a rework.\n\nWhat drugs were the rioters on when they thought of this crap? Watch them pull another dynamic queue and leave him gutted til season 8","replies":[]},{"poster":"Battlecast Sona","date":"2016-10-26T20:32:49.902+0000","up_votes":2,"down_votes":1,"body":"it's almost like they're throwing a bunch of changes at the wall to see what sticks and what works before they change numbers too heavily... People have been having quite a bit of success on Shaco currently on the PBE so, while I think it may end up being a net early nerf (which I think was intended), overall it supports interesting playstyles.\n\nTo respond though, I think this change was definitely meant to support AP Shaco more both in the jungle and in general. An AP ratio on his Q helps Shaco utilize that spell with Lichbane a LOT better, the box health and increased duration means that a single AP Shaco box used to scout has more utility. The ult changes mean even if you don't necessarily hit people with the explosion, you still bring utility, CC, and disruption from AP Shaco (which is something he was greatly lacking before - a way to contribute to teamfights). I think that post-patch people are going to find AP more reliable than AD after the changes, but I think it will take time for the conclusion to be reached. In a way this was actually a good change for AP, because previously you relied almost entirely on someone walking into a nest of boxes early to do considerable damage, but now with HP scaling and duration scaling they can be used more like actual traps, giving you a reason to pick Shaco outside of \"want to cheese at level 2\".\n\nbasically, while Shaco's damage has been nerfed outright especially early, I think the AP changes will allow him to fill a more utility-focused role than before as AP while still contributing assassination (potentially more than previous AP Shaco due to the AP ratio on Q now).","replies":[]},{"poster":"Pus","date":"2016-10-30T06:19:26.598+0000","up_votes":1,"down_votes":0,"body":"Everyone that voted yes are either riot shills or really hate Shaco lmao. I would be fine with all the nerfs if his meme ult boxes didn't share hp and if they made the first champion it feared walk in a triangle.","replies":[{"poster":"AmetDeCrypt","date":"2017-05-12T05:04:33.434+0000","up_votes":1,"down_votes":0,"body":"well I voted yes because I misread the question and thought he was asking if the nerfs were too much.","replies":[]}]},{"poster":"BooMBER34","date":"2017-04-06T15:02:23.843+0000","up_votes":1,"down_votes":0,"body":"I main Shaco too, I know how you feel. He received large nerf. I tried new full AD Shaco and he deal only 1071 crit damage with backstab and Q. Yea, old Shaco was better, he made 1900+ crit dmg, I don't joke. So, after this nerf, we should go statikk and trinity shaco for better damage.\nNew build: {{item:3077}}  {{item:3006}} {{item:3087}} {{item:3078}} {{item:3031}} {{item:3508}} {{item:3074}}\nI think Lethality Shaco is good again, but now he can't oneshot easy. This my answer for the builds. Something else is to go tank bruiser Shaco build, he is very simple. I think Shaco can die very hard with this bruiser tank build.\n**I don't know why riot nerf Shaco so disgusting...**","replies":[]},{"poster":"Dersche","date":"2016-12-12T01:35:26.997+0000","up_votes":1,"down_votes":0,"body":"is that why shaco has highest win percentage in ranked atm(55% last i checked)?? They buffed him hard since his mid-late game is strong now but the nerf on his early game isn't too harsh meaning he can still abuse his invis to gank early lanes easily but if he starts to roll it is much harder to stop him.","replies":[]},{"poster":"Deamoniakk","date":"2016-12-10T23:34:20.937+0000","up_votes":1,"down_votes":0,"body":"Nothing else to say besides things that already said here\nShaco became like...98% unplayable...\n\nBackstab is just ridiculous, E's useless, because you have to level up your Q first at least till lvl 5 to get proper invisibility time... It wouldn't be bad, but Q does almost no damage... 20-80 damage through leveling it is nothing... absolutely nothing. But you can't get a shiv leveled, because you can't do anything with 1.5s invisibility that goes with level 1 Q\n\nBoxes.. doesn't really care much about boxes, but it's still stupid to not have them stacked...\n\nSo how a proper Shaco player is supposed to play this game now after such a hit to the balls?","replies":[]},{"poster":"Sherlock Clones","date":"2016-11-19T17:48:52.711+0000","up_votes":1,"down_votes":0,"body":"Don't worry guys, riot will eventually comment and admit they made a mistake.....oh wait thats assuming they actually comment because they never do...","replies":[]},{"poster":"Filthy Rank","date":"2016-11-19T17:06:42.821+0000","up_votes":1,"down_votes":0,"body":"his splitpushing was nerfed like crazy, the cloen does only 26% damage to structures, his box only 50%, the clone can't have guardian angel or others passives...","replies":[]}]}