{"poster":"DarkFirecracker","date":"2016-08-03T03:20:16.260+0000","title":"Intentar crear una comunidad sin flamers","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Hola, soy un usuario que ah jugado mucho tiempo en lol y me gustar&iacute;a que todos lleg&aacute;semos a un acuerdo. El acuerdo seria el de no flamear, se que parece algo est&uacute;pido, pero si todos ponemos nuestro granito de arena por no trolear cuando el team va mal o no flamear cuando otro lo hace y siempre reportar a los flamers (aunque seas del equipo contrario) creo que se puede lograr una comunidad sin flamers {{summoner:14}} \r\n\r\nmuch&iacute;simas gracias por leer \r\n{{sticker:slayer-jinx-catface}} \r\n\r\nPD: como no tengo ni idea de que es lo de &quot;enlace&quot; dejare un video","replies":[{"poster":"ElkinElOsO","date":"2016-08-03T03:41:34.301+0000","up_votes":4,"down_votes":0,"body":"Yo opino que las \"palabras\" como: \"izi\" \"ez\" etc. Daña la comunidad y fomentando un ambiente de juego sucio. Por eso debemos hablar de la manera mas respetuosa posible con ese tipo de jugadores diciéndoles las razones por las que no deben decir esas \"palabras\". \nEn el caso de que hayan flamers en el equipo aliado (se supone que flamean casi siempre por que alguno de sus aliados se equivoco), todos somos humanos y cometemos errores, y toda la comunidad debería saberlo y tolerarlo.  {{summoner:14}} {{summoner:13}}","replies":[]},{"poster":"Lucrexio","date":"2016-08-03T03:29:32.266+0000","up_votes":2,"down_votes":0,"body":"Es imposible capo, en ranked yo no digo ni \"A\" y es gracioso porque estan los otros 4 flameandose entre si, lo unico positivo es que al no hablar ya directamente es como q no existis y no te reportan, flamean, etc. xD","replies":[]},{"poster":"Main Evelynn","date":"2016-08-03T03:24:29.319+0000","up_votes":2,"down_votes":0,"body":"es practicamente imposible, varios han iniciado campañas y se ha fracasado, yo he cometido el error de jugar 2 solo y fue lo peor que pude hacer, esta LLENO de flamers, toxicos, gente que desea el cancer o muerte a otro, que pide report por cualquier cosa....hay que jugar en team, no queda otra. Si queres agregame que tengo un grupito de 5 que jugamos juntos para evitar esta gente podrida.","replies":[]},{"poster":"Rohan","date":"2016-08-03T23:48:13.798+0000","up_votes":1,"down_votes":0,"body":"Ahora decis eso pero cuando vayas 10-0 y pierdas por culpa de tu equipo quiero ver que no flamees.","replies":[]}]}