{"poster":"A Loose Brick","date":"2015-03-02T06:34:14.069+0000","title":"How I would fix Veigar","subforum":"Player Creations","up_votes":4,"down_votes":1,"body":"Everybody agrees that Veigar's changes were awkward. although his q can be stacked slightly higher, his burst damage and his stun were greatly nerfed to say the least. these are the changes I would have made with the same design philosophy in mind as the recent update. hopefully someone at riot will read this and use some of my ideas.\n\nVeigar's passive is useful, but it is boring. Veigar's mana regen should be moved to one of the highest in the game and this passive should be replaced with something more fun. because of the removal of deathfire, Veigar's damage has gone down by around 30%. to counter this, without increasing his flat ratios, but allowing him to still be a burst champion how about this: \n\n* New Passive - dealing damage to an enemy champion briefly increases the number of Q stacks Veigar has by 15% for 5 seconds. this ability can stack and works with basic attacks.\n\nthis would add the necessary incentive for good players to play the Q stacking game, because everyone knows that, where he is currently, you're actually better of pushing the other champion out of lane than worrying about a bit of extra AP during the early and mid game. It is important to note that this doesn't last longer than Veigar's lowest cool down, but basic attacks will still proc this effect. this also allows good players to go for the risky play of taking down high hp champions if they can get enough basic attacks in without dying. it would be almost impossible, but if you can pull it off you deserve a large damage boost. also remember this only affects the stacks, not the AP, so at most during late game you could expect to receive around 200 extra ap on your last ability, so i am by no means giving him the sort of boost deathfire would have.\n\nI'm not sure if I enjoy the new Q, yes it gives you the opportunity to increase your stacks, but not being able to shoot over minions decreases Veigar's effectiveness in lane and in team fights. being a skill shot also means that player's being bursted by Veigar can flash away to receive less damage. this is not 'bad' but it is a questionable design choice. I think it was fine the way before, but I don't mind the change. If you really wanted to push stacking Q as the only real strategy, you could change it so that any ability of Veigar's can stack Q, although this might be a bit too much so maybe allowing basic attacks to stack Q could be a good compromise. this would put a real emphasis on a player's ability to last hit with Veigar's low basic attack damage.\n\nThe stun (E) rework was not done correctly. It went from one of the main reasons to play such a squishy champ, to one of the worst and most easily dodge able stuns in the game. since the patch It has been close to impossible to land a stun. but more importantly, it has been close to impossible to land the defensive stun at close range, which Veigar really needs to survive. How about another compromise? if you want to decrease his ability to snipe stun the opponent without massively hurting his survivability, this is the ability that should have become a skill shot. preferably similar to Ezreal's second skill-shot, that has a slow travel time, good range and can pass through multiple enemies. this also makes it harder to stun multiple enemies, but make it super easy to pull off a defensive stun. this would also help new players to Veigar, whilst giving experienced players a chance to pull off a clutch team stun.\n\nThe ultimate also hurts one of the main reason to play Veigar. the idea of one ability that does lots of damage is very attractive to players, and even though Riot tried not to hurt Veigar's burst, they really did. his Q stack isn't good enough to warrant the loss of (probably) around 200 damage. I'd rather have worse Q stack, bad stun and low mana regen then have a boring ultimate that does less damage than my other abilities. how about increasing the 80% of the opponents ability power to 100% or just removing that part and increasing the ap ratio to 1.4? or maybe use a mechanic similar to my earlier idea of using basic attacks to increase damage? I also enjoy the idea of an execute ability that resets when it successfully finishes off an enemy. \n\nA few more suggestions: I really like the idea of Veigar's abilities granting him a brief shield. this however may be too easily to over buff him. I also think the meteor would be a much more dynamic stun, this would mean that teamwork/at least 1 ally needs to be involved for Veigar to burst, otherwise he would be more vulnerable, if you really want the stun to have a delay this is the way to go and would leave open a slot for another ability. I also saw a post in the forum that suggested an ability that could pass through everything until it is activated again. this would allow more skillful poke and easier farming. Another way to encourage more teamwork or restrict Veigar's burst would be to make the ultimate ability more like the meteor as well. so basically what I'm saying is delayed attacks are great, but not on a stun that is the only thing stopping an opponent from 1 hitting you.\n\nFinally, I want to hang a disclaimer over this, I am not a pro player, or a qualified game designer, I am just a player that knows what he would enjoy playing. even if only a fraction of my suggestions are implemented, this would make me a very happy Veigar player.","replies":[{"poster":"Pathfinder0X","date":"2015-03-02T07:50:35.303+0000","up_votes":1,"down_votes":0,"body":"I like the stun idea, where close range its way easier to stun. That makes him waaaaay more defensively reliable.","replies":[]}]}