{"poster":"21 SIMBA 12","date":"2016-04-28T01:37:55.449+0000","title":"League of Legends Background Roman","subforum":"Community-Kunstwerke","up_votes":2,"down_votes":1,"body":"Hallo ihr Lieben, \r\n\r\nIch denke schon lange dar&uuml;ber nach einen Roman zu League of Legends zu ver&ouml;ffentlichen. Die Lores der einzelnen Champs haben mich schon immer fasziniert und ich habe mich gefragt, warum denn nicht einmal alles miteinander verbinden? Nat&uuml;rlich w&auml;re es beinahe unm&ouml;glich, alle Lores in einem einzigen lesbaren Buch sinnvoll miteinander zu verkn&uuml;pfen, sodass es spannend und kurzweilig zugleich w&auml;re. 130 Champs sind einfach zu viele. Ausserdem gefallen mir manche Lores weniger als andere, manche Charaktere faszinieren weniger als andere, weswegen der Roman eher eine freie Interpretation des League of Legends Universums w&auml;re, mit eigenen Charakterentwicklungen, Beziehungen, Facetten, Fehlern und Toden....(?) :) \r\nMein Fokus liegt in erster Linie auf dem politischen Gebilde von Noxus, Demacia, Ionia und Freljord und dem Leser das Leben in einem dieser Reiche nahe zu bringen, das alles betrachtet durch die Augen von Charakteren wie Riven, Talon, Katarina, Swain, Ahri, Irelia, Shen, Braum, Ashe, Garen, Lux und vielen weiteren. Der Roman erz&auml;hlt die komplexe, kriegerische Welt von Valoran vor der Errichtung der Kriegsakademie und dem System der Liga der Legenden. Anders als andere Romanversuche, wird es nicht aus einer einzigen Championperspektive berichtet.\r\n\r\n&Uuml;ber ein Dreiviertel Jahr habe ich Ideen gesammelt und habe nun angefangen, diese niederzuschreiben. Das erste Kapitel handelt von Noxus. Ich werde es vorraussichtlich in 2, sp&auml;testens 3 Wochen hier ver&ouml;ffentlichen. Es wird noch unvollst&auml;ndig sein und es handelt sich lediglich um ein Konzept. Ich bin sehr froh &uuml;ber Anregungen und bitte um Verbesserungsvorschl&auml;ge (zB : &quot;Hey du hast due Beziehung zwischen dem und der viel zu kurz dargestellt&quot;). Ich bitte davon abzusehen, &uuml;ber den Schreibstil oder Rechtschreibung zu urteilen, das alles ist noch keine finale Fassung :) Nach und nach werde ich dann weitere Kapitel ver&ouml;ffentlichen (insgesamt 6-8 grosse Kapitel). \r\nAusgenommen aus dem Roman sind : Shurima, Bilgewasser, Piltover, Zhaun (teilweise).\r\nIch freue mich auf euer feedback und gebe mir grosse M&uuml;he, euch einen spannenden Grand Scale Roman zu bieten:) \r\n\r\nEure/r Katahr&iacute;  {{champion:55}} {{champion:103}}","replies":[{"poster":"Leodiggahzz","date":"2016-06-08T16:07:59.433+0000","up_votes":1,"down_votes":0,"body":"wo kann man diesen roman lesen?","replies":[]},{"poster":"21 SIMBA 12","date":"2016-04-30T04:08:54.592+0000","up_votes":1,"down_votes":0,"body":"@Ezcabur\nEhrlich gesagt klingt dein Ansatz super interessant und ist mal was Neueres, was mir persönlich sehr gut gefällt! Ich verfolge auch einen recht ähnlichen Ansatz, da ich mich zUm Teil völlig unbekannter Charaktere bediene (General Du Couteau (Katas Vater), Boram Darkwill, Rivens Vater und anderen Charakteren, die nicht im Fokus liegen, um das Lol Universum zu erkunden). Ich werde allerdings nicht auf die Chanpions verzichten, da diese für mich der Hauptgrund und die Hauptfaszination ausmachen, deren Charaktere mit allen Facetten auszuarbeiten und zu beschreiben. Ich entferne mich aber relativ frei von den (relativ kurzen) standardlores und schaffe Verbindungen, Beziehungen, etc... Wie gesagt, eine freie Interpretation :) bin auf deine Meinunh gespannt und freue mich auf den Feedback nach der ersten Lektüre.\n@mad Musical\nDas kann ich nur zu gut verstehen, das Projekt arbeitet bei mir auch schon seit einem Dreiviertel Jahr . Aber jetzt habe ich auch auch die Grundstory und was ich euch präsentiere wird nur der Prolog mit einem Umfang von etwa 40-45 Din A4 Seiten sein. Evtl noch mehr. Freue mich auch auf dein Feedback! Lg","replies":[]},{"poster":"Ezcabur","date":"2016-04-29T10:40:28.830+0000","up_votes":1,"down_votes":0,"body":"Das klingt super :D\nUnd ja es wäre unmöglich alle Champs oder ähnliches zu erwähnen, aber das wäre irgendwie auch langweilig. Von Riots Seite kommt super viel zu den Lores der Champs und ihrer direkten Umgebung, daher würde ich vllt. weniger darauf abzielen.\n\nIch kann natürlich nicht für alle sprechen, aber was (für mich) super interessant wäre, wäre nicht ein Roman über die Champions oder eine Erzählung über die einzelnen Stadtstaaten, sondern um sagen wir \"Nachwuchs\" Helden/Villains, die durch die Straßen der einzelnen Städte ziehen oder durch Runeterra ziehen, die am Rande die Liga mitbekommen und Ihre eigenen Eindrücke der Welt sammeln und sich eine eigene Meinung daraus bilden, Der Liga und alle dem.\nWodurch halt einfach mal eine andere Sichtweise auf das Universum kommen würde.\n\nVllt. so ähnlich wie die erzählweise in \"Die Zwerge - Markus Heitz\" falls du die kennst? Mir fällt leider keine andere oder bekanntere Referenz ein sorry :(\n\nGrüße \nEzcabur","replies":[]},{"poster":"Mad Musical","date":"2016-04-28T21:27:59.528+0000","up_votes":1,"down_votes":0,"body":"Grüße,\n\netwas derartiges hatte ich auch einmal angefangen und ist hier im Forum zu finden. Es geht eher in eine Game of Thrones Richtung. Aufgrund dessen stockt es derzeit. Die nötige Muse ist afk und die bisherigen unveröffentlichten Texte erfüllen nicht ganz meine persönlichen Erwartungen. :) ... Wobei 'Die Auserwählten' es auch nicht wirklich tun. Getreu nach Drew Karpyshyn 'Gefällt dir dein Text - lösch ihn. Gefällt er dir nicht -  ist er perfekt'. Zudem sind noch andere LoL spezifische Projekte in Arbeit die meine Muse belastet.\n\nDie Stilfrage ist recht entscheidend. Manche Texte von Spielern sind sehr beliebt, jedoch mangelt es dort an Inhalt und Substanz. Zudem sind sie häufig leider sehr sehr kurz.\n\nIch würde dir empfehlen einfach mal loszulegen und zu schauen. Am Ende muss es dir Spaß machen. Man liest sehr schnell heraus, ob man einen Text einfach so abtippt oder Leidenschaft dabei ist.","replies":[]}]}