{"poster":"Washux","date":"2017-06-08T16:50:42.426+0000","title":"Error al banear los 5 campeones.","subforum":"Problemas Técnicos","up_votes":3,"down_votes":8,"body":"Esto ya lo escrib&iacute; en otra secci&oacute;n pero no se cual es la correcta.\r\nAcabo de intentar jugar una clasificadora solo d&uacute;o, en el momento de banear yo conversaba con un amigo por el chat al mandarle el mensaje a mi amigo el juego me sac&oacute; de la sala de selecci&oacute;n de baneos y campeones, pense que alguien se hab&iacute;a salido pero veo mi estado y dec&iacute;a que estaba en selecci&oacute;n de campe&oacute;n, ante esto yo presiono en el inicio el &quot;bot&oacute;n&quot; de jugar y vuelvo a la sala, pero no me dejaba seleccionar el ban y me dec&iacute;a que se produc&iacute;a un error; adem&aacute;s el cliente quedo congelado (ya terminado el tiempo de selecci&oacute;n) a causa de esto cerr&eacute; el lol (insisto, ya habia pasado el tiempo de seleccionar el ban porque eso s&iacute; pod&iacute;a ver) y cuando me vuelvo a meter me di cuenta que se me restaron los 3 puntos de liga por culpa de algo que escapa de mis manos y de mi pc. Espero la restituci&oacute;n de mis 3 puntos (aunque para algunos sea insignificante, pero es algo injusto que a los dem&aacute;s les puede pasar y de peor manera) y que se soluciones este problema.\r\nSaludos!","replies":[{"poster":"Gabvy2018","date":"2017-06-08T17:05:53.897+0000","up_votes":4,"down_votes":0,"body":"Washux, te pido que sigas los siguientes pasos para poder estudiar bien el caso: \n\n1- Descarga la [Herramienta de reparaci&oacute;n hextech](https://s3-us-west-2.amazonaws.com/player-support/tools/Hextech%20Repair%20Tool.msi)\n2- Una vez que la hayas instalado, ejec&uacute;tala, cambia su idioma a espa&ntilde;ol y luego checkea la opci&oacute;n que dice &quot;recopilar registros del sistema y Lol&quot;\n3- Crea una solicitud/chat [aqu&iacute;](https://support.riotgames.com/hc/es-419/requests/new) y adjunta este archivo que se encuentra en tu escritorio. \n4- Cualquier pantallazo que hayas podido sacar es bienvenido. \n\ndesde ya gracias.","replies":[{"poster":"ZeNch","date":"2017-06-08T23:01:12.319+0000","up_votes":1,"down_votes":0,"body":"Bueno no queria postear 20 veces pero recorde algo... \n\nPueden avisar a los developers que agreguen la opcion de silenciar club (chat)? (si bien lo mas cercano es \"cerrar\" la conversacion, el silencio al grupo se mantendria seria mas practico... no existe y para chats con contactos si, me parece una tonteria x3)","replies":[]},{"poster":"ZeNch","date":"2017-06-08T22:58:00.441+0000","up_votes":1,"down_votes":0,"body":"Quizas le sirva el truquito del reset del cliente. \nLa explicacion va para el pero asi no comento 20 veces x3.\nAbrir consola de comandos (cmd) y ejecutar este comando:\n\ntaskkill /F /IM LeagueClientUxRender.exe\n\nOtra forma de hacerlo es en un archivo de texto escribir lo mismo\n\ntaskkill /F /IM LeagueClientUxRender.exe\n\ny guardarlo como .bat luego ejecutarlo en el momento del problema.\nSe cierra el cliente y se abre automaticamente en la seleccion de campeon.\n\nQue lo pruebe en reclutamiento (personalizada) con amigos... no se si existe personalizada de reclutamiento pero seria lo mejor.","replies":[]}]},{"poster":"Yunox","date":"2017-06-08T16:55:36.667+0000","up_votes":1,"down_votes":0,"body":"No te van a reponer los 3 puntos. Manda un ticket a soporte y quizás te expliquen por qué fue, pero tus LP se fueron juntos con ese error.","replies":[]}]}