{"poster":"Subject 5","date":"2017-07-11T01:46:25.686+0000","title":"So Why Nerf Ghost But Not Flash?","subforum":"Gameplay","up_votes":2,"down_votes":2,"body":"Ghost was nerfed because it was just really good on escaping ganks or chasing down people, it was becoming a requirement in higher elos and major play.\r\n\r\n. . .\r\n\r\nSo why can&#039;t Ghost be good but Flash is still taken on literally 95% of the champion roster? How does flash escape this death trap? Ghost benefited melee more than ranged too, it was an exceptional ability for {{champion:266}}  {{champion:48}} {{champion:41}} {{champion:24}} {{champion:23}} \r\n\r\nIf ghost was used - that&#039;s a summoner spell that was lost in order to survive a gank, right? So why basically &#039;remove&#039; ghost in play when people will literally maul you in chat for not taking flash. Well, I mean, unless you&#039;re playing {{champion:35}} \r\n\r\nIMO - It is because if Flash was nerfed, melee would be pretty much nonexistent - even worse than ranged VS melee as it is - but right now, ranged is already dominating - so I can understand why flash isn&#039;t nerfed or just removed . . . but I don&#039;t understand why nerfing ghost . . .\r\n\r\nThoughts?","replies":[{"poster":"MagicFlyingLlama","date":"2017-07-11T02:00:55.114+0000","up_votes":4,"down_votes":0,"body":"At this point flash is a game mechanic, not a summoner spell.","replies":[{"poster":"Durzaka","date":"2017-07-11T02:11:39.922+0000","up_votes":1,"down_votes":0,"body":"This is honestly the answer.\n\nFlash was so powerful for so long, that the entire game and champion pool is basically built around it. It can't be changed at this point.\n\nWhereas Ghost is taken on a small subset on champions, and therefore when they deem it is overwhelming it is easier for them to tweak it.","replies":[]}]},{"poster":"UnboundHades","date":"2017-07-11T01:51:13.272+0000","up_votes":1,"down_votes":0,"body":"i still feel like flash needs to be given as a weaker version of its current self on an unused key to every champ while removing it from the summoners spell because 9/10 people in every game i see have flash and that just limits your options if you actually want to do good you need to have flash","replies":[]},{"poster":"Cocho","date":"2017-07-11T02:11:31.307+0000","up_votes":1,"down_votes":1,"body":"League w/o flash isnt league","replies":[]}]}