{"poster":"DragonsbaneGlint","date":"2017-02-06T03:31:56.015+0000","title":"The game and it's players (an open letter to riot games)","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"I&#039;ve been playing league since around season 3 but only recently have i gotten into playing ranked. I generally tend to avoid ranked play because of the massive, ungodly amount of salt (general hostilities of other players) and trolling going on. I had believed that perhaps the tribunal system had worked this out and i could enjoy playing league of legends ranked play once again. But after having finished my placements mere minutes ago i&#039;m left with a great feeling of despair. if anything ranked league has gotten worse since i played it back in season four. I&#039;ll categorize below the main problems i had while doing my placements.\r\n\r\n\r\nFirst: Queue,\r\n\r\nNow that&#039;s not to say queue times, they were fine. it&#039;s the fact that I had to sit through around ten different queues per match. from people just declining to people dodging left and right because someone banned their favorite champ or they didn&#039;t get the lane they wanted because of autofill.\r\n\r\nSecond: Skill\r\n\r\nI know ranked is meant to be a personal measure of your own skills as a player but it&#039;s hard to gather the measure of a single player when their teammates have the IQ of a rabid wolverine. I won 4 out of my ten placement games but in all but one of my games did i play what would generally be considered poorly. most of the time i won my lane but others lost theirs which led to the entire enemy team folding me over most of my games.\r\n\r\nFinally: People\r\n\r\nRanked should not be open to the general public. It should be open to those who truly wish to be there and are not just there to troll others and ruin their placements. I don&#039;t have an answer as to how to do that, but you guys get paid the big bucks and it&#039;s the players writing your checks. perhaps you should focus more on how to fix your toxic community and less on what skins will net you the biggest profit this month. you&#039;ll net more money by increasing your player base, then by catering to single facets of it.","replies":[{"poster":"Crispe","date":"2017-02-06T04:28:45.089+0000","up_votes":1,"down_votes":0,"body":"> Skill\n\nWelcome to the game, just because you win lane does not mean you get a free pass to win the game. You have to help win every lane.\n\n> People\n\nThis just in: Asset designers do not know psychology or how to code a punishment system! The Tribunal was done away with, and nothing has replaced it so far.  I don't suppose you have any proposition as to how to close ranked to the public? Make it an application system? Pay to play system? If you look at ESEA in CSGO you can kind of tell this doesn't really work.","replies":[]},{"poster":"I am Pacman","date":"2017-02-06T04:11:25.695+0000","up_votes":1,"down_votes":0,"body":"> Queue\n\nPeople dodge sometimes but tbh I personally don't get that many dodges.\n\n> Skill\n\nYou will always have terrible teammates who can't ward, get caught, lose lane or don't group.  You would think it would get better as you climb higher but no thats not the case.  Also if you are silver or bronze then it will place you in silver or bronze, if gold or plat skill level then it will not take very long to reach that.  \n\n> People\n\nLook, Any online video game is toxic, league is worse and ranked is when I go shopping for premium salt so either grow a tougher skin or just mute everyone.  Yes Riot is trying to make it less toxic but chat bans can only help so much.\n\nDid some looking as well:\n\n> I won 4 out of my ten placement games but in all but one of my games did i play what would generally be considered poorly. most of the time i won my lane but others lost theirs which led to the entire enemy team folding me over most of my games.\n\nYou had more deaths than kills in every game except one and these games are against mid to high bronze.  Look up how to improve your macro play, everyone in bronze and silver is terrible with it and you can climb really fast once you get it down.  Also main 1-5 champions max.","replies":[]},{"poster":"Zezockary","date":"2017-02-06T04:05:10.500+0000","up_votes":1,"down_votes":0,"body":"Considering that League of Legends is the worlds most played game and their population is rising, I would say that they are doing just fine increasing their player base.\n\nAlso, you seem to be under the impression that they could move people from their art teams to their player behavior teams. It doesn't work like that.\n\nRiot has made great strides in decreasing toxicity in their game. I can tell you that since I have started playing toxicity is at an all time low. We have, for the most part, moved from severe instances of behavior to minor annoyances as far as chat based things go. I haven't seen a person actually break down and feed a game or anything like that in quite some time. It does happen, but again, for the most part moving from severe things to annoyances.\n\nAlso, for your skill category, you are the only person in all of your games that stays the same. You are the constant. If everybody around you is performing worse than you, then in general, you should be winning more than you are losing. I would suggest improving on your own skill rather than complaining about your teammates, because literally everybody who is a higher rank than you had to go through games with the same people. Especially this season where everybody got placed so much lower than they were the last season.\n\nI would suggest watching the things you say to your team. Saying positive things can cause your team to play better, rather than reprimanding them for their mistakes. In my last game one of my teammates said \"If I die again I am going afk\". After that I said a few positive things, after a bit we made a couple of good plays, and then we turned the game around and destroyed them. I was support, the potential afk was our adc, and the enemy adc did not get another kill that game and ended up 3/11.","replies":[]}]}