{"poster":"White Wolf","date":"2017-10-05T02:38:15.855+0000","title":"Publicidad del lol en Youtube","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"ante que nada me disculpo si no va en este foro pero no sabia donde ponerlo.\r\n&Uacute;ltimamente estoy viendo publicidad del lol en youtube, esto me parece raro ya que nunca habia visto publicidad del lol ni cre&iacute;a necesario que gaste en publicidad para atraer jugadores, cayo la cantidad de jugadores? simplemente se pueden permitir ahora invertir en publicidad? siempre estuvo y simplemente no me di cuenta? alguno me puede aclarar las dudas? gracias de antemano{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Zafphlyn","date":"2017-10-05T15:39:35.877+0000","up_votes":3,"down_votes":0,"body":"Siempre hubo publicidad de lol, yo de hecho empece a jugar desde 2013 o 2014 no recuerdo a traves de una publicidad, y una empresa SIEMPRE tiene que continuar publicitando sus productos, es por la misma razón que coca-cola sigue haciendo publicidad cuando la conocen en todo el mundo porque es muy importante mantenerse siempre visible.","replies":[]},{"poster":"DocandMharti","date":"2018-07-22T06:51:16.423+0000","up_votes":2,"down_votes":0,"body":"es la basura más incómoda. La publicidad de Netflix dura 10 segundos o 15 maximo y se muere sola, esta basura de LoL es cringe worthy, no se muere tras terminar y dura que jode, casi un minuto entero si no es que más","replies":[{"poster":"Bot Murloc","date":"2018-07-22T11:22:54.315+0000","up_votes":1,"down_votes":0,"body":"Homunculus Indie Company\n\npor atras de la publicidad de los chaboncitos estos q agarran las armas de los campeones, esta la de los editores estos, es como ver un vlog pero con el cringe potenciado a 4, es como q tratasen de exagerar lo q es lol y cuando entras no es nada mas q una bomba de tiempo de puteadas, y van a seguir \"qui cuminidid tin tixici\"","replies":[]}]},{"poster":"Mergueler","date":"2017-10-05T04:08:34.264+0000","up_votes":2,"down_votes":0,"body":"No creo que hayan salido a buscar más clientes ... es más, capaz que la publicidad de lol la vemos sólo nosotros,que tenemos instalado el cliente ... y es una forma de Google de decirnos .... \"Lo sé todo\"","replies":[]},{"poster":"Darkfoe703","date":"2017-10-05T03:55:41.486+0000","up_votes":2,"down_votes":0,"body":"Emm, la publicidad no funcioná así (en relación a la pérdida de consumo). Un ejemplo claro es Coca-Cola. Su base de consumidores es bastante estable, y aún así se gasta millonadas todos los años en campañas de publicidad.\n\nSaludos.","replies":[]},{"poster":"Treant del DOTA","date":"2017-10-05T03:04:06.037+0000","up_votes":1,"down_votes":0,"body":"Lo de Youtube es nuevo. Es el único juego que en vez de poner publicidad al inicio de su lanzamiento lo hace 8 años después teniendo ya una base considerablemente grande de jugadores.\n\nNa hablando en serio en el 2009 también había. Más que nada en los anuncios de Google que había en Youtube y otras páginas.","replies":[{"poster":"ZanahoriaAsesina","date":"2017-10-05T03:27:16.903+0000","up_votes":2,"down_votes":0,"body":"Quieren dineros extras, tal vez.","replies":[{"poster":"Treant del DOTA","date":"2017-10-05T03:45:33.492+0000","up_votes":1,"down_votes":0,"body":"Como si no les alcanzara.","replies":[]}]}]},{"poster":"juan2396","date":"2018-07-25T11:13:34.497+0000","up_votes":1,"down_votes":0,"body":"Las publicidades apuntan a niños como si no hubiera los suficientes ya, si antes era toxica ahora ni hablar. Yo opte por cambiar de juego, pero entre a mirar que se decia del spam de la publicidad de youtube SUPERMOLESTA!! {{summoner:4}} NOS VEMOS GENTE.","replies":[]},{"poster":"Bot Murloc","date":"2018-07-22T11:24:58.629+0000","up_votes":1,"down_votes":0,"body":"na, league perdio jugadores, es obvio, pero esas publicidad no son por q perdio un numero critico de jugadores, es solo para promocionar y su numero de jugadores sigue siendo estable","replies":[]},{"poster":"Goldney","date":"2018-07-14T21:14:14.154+0000","up_votes":1,"down_votes":0,"body":"Se me hace raro, juego al lol hace 3 años, sigo la escena competitiva y hasta relato partida para pagina como hobby! pero es impresionante la cantidad de veces que me salio esa publicidad en 1 semana nomas... mas de 15 veces seguro, hasta mi novia que usa mi pc me cuenta que le salen a cada rato! \nEsta bien riot... no estoy jugando 7 horas seguidas como antes! pero aflojen!","replies":[]},{"poster":"Tumbando la lane","date":"2017-10-05T04:22:31.848+0000","up_votes":1,"down_votes":0,"body":"Tienen millones de jugadores y esta perfecto lo que hacen. No lo hacen por perder jugadores.","replies":[]},{"poster":"Grosero","date":"2017-10-05T02:44:36.906+0000","up_votes":1,"down_votes":0,"body":"Yo he visto publicidad en otros lados, pero de forma super pasiva, no es invasiva como la de otros juegos","replies":[]},{"poster":"Wawüz","date":"2017-10-05T03:23:20.974+0000","up_votes":1,"down_votes":1,"body":"Yo lo vi hace bastante en forma de aviso (cartel) publicitario en los videos, creo que lo ponen cada tanto.","replies":[]}]}