{"poster":"Sleenox97","date":"2017-01-26T17:59:39.810+0000","title":"Peticion para ms","subforum":"Discusiones sobre el Cliente","up_votes":20,"down_votes":2,"body":"Hace unos d&iacute;as envie un mensaje para ver si se puede hacer una solicitud para que pongan para poder ver los ms en nuestro launcher para poder saber si tenemos bien nuestro internet antes de ingresar a una partida, mi respuesta fue esta:\n\nSaludos Invocador,\n\n&iexcl;Gracias por la sugerencia! No podemos llevar este tipo de ideas directamente al equipo de dise&ntilde;adores, pero te recomiendo que compartas tu concepto en los foros. Los dise&ntilde;adores le dan un vistazo a estos foros para inspiraci&oacute;n de cosas que los jugadores piensan que pueden ser mejoradas, como tu sugerencia de ver los MS, y adem&aacute;s podr&aacute;s recibir los comentarios y el apoyo de tus compa&ntilde;eros invocadores.\n\nForos de League of Legends:\n\nForos de LAS: http://forums.las.leagueoflegends.com/board/\n\nSi tienes cualquier otra pregunta, no dudes en ponerte en contacto con nosotros.\n\nMikiChiyo, Kaze no Musume.\nPlayer Support Specialist.\nRiot Games.\n&quot;Always willing to help!&quot;\n\n\nEs una buena idea, quisiera que me apoyen para que lo agreguen.","replies":[{"poster":"Thails SirYordle","date":"2017-01-27T03:47:10.065+0000","up_votes":3,"down_votes":0,"body":"Ojala se haga realidad","replies":[{"poster":"Sleenox97","date":"2017-01-27T03:50:08.811+0000","up_votes":1,"down_votes":0,"body":"Gracias por el apoyo. Sirve compartir! xD","replies":[]}]},{"poster":"CadaDiaMasFacha","date":"2017-01-27T00:06:05.083+0000","up_votes":2,"down_votes":0,"body":"Pero para eso te fijas una personalizada y ves que onda los ms. Yo siempre lo hago.\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Mascheranox","date":"2017-01-27T01:20:41.080+0000","up_votes":2,"down_votes":0,"body":"pero tardarías menos, con la idea esta del post","replies":[{"poster":"CadaDiaMasFacha","date":"2017-01-28T00:19:58.626+0000","up_votes":2,"down_votes":0,"body":"Si, bueno no te hago la contra, xq a mi tmb me gustaria que lo hagan. Te apoyo +1.","replies":[]}]}]},{"poster":"NyokMc","date":"2017-01-27T00:55:13.202+0000","up_votes":2,"down_votes":0,"body":"Se puede hacer, pero es medio rebuscado.\nToca la tecla Win + R y pone ahi CMD. Cuando lo ejecutes, se te va a abrir un cuadrado negro. Eso es la ventana de comandos de windows.\nAhi pone: ping 138.0.12.3 -t\nUna vez pongas enter, vas a ver un monton de textos, dentro de los cuales hay un valor en \"ms\". Ese es el ping que tendrias In-game (tal vez un poquito elevado por el sistema de seguridad que tiene riot para proteger el IP, pero la diferencia es de 3 o 4 ms).\n\nEspero que esto te sirva, y ojala implementen esta herramienta en el launcher, seria genial!","replies":[{"poster":"Sleenox97","date":"2017-01-27T02:19:35.781+0000","up_votes":1,"down_votes":0,"body":"Gracias amigo por tu info, pero ya la sabia. Lo que estoy buscando es algo mas sencillo mucha gente no sabe ni que es el logo del sistema ni como abrirlo, con esto seria mucho mas fácil y para gente que no sabe sacar su ms soluciona su problema.","replies":[]}]},{"poster":"WilfreCheesemice","date":"2017-01-26T19:34:56.898+0000","up_votes":2,"down_votes":0,"body":"Hola!. Esto se viene pidiendo hace mucho, seguramente algún dia lo tendremos, pero riot tiene prioridades :/. Bueno,  una sugerencia es ponerlo en los foros de NA, ya que según tengo entendido ahí es donde están los creadores reales del juego en su totalidad, y seguramente te llenen de +1 (likes).","replies":[{"poster":"Sleenox97","date":"2017-01-26T19:36:53.565+0000","up_votes":1,"down_votes":0,"body":"Si estaría bueno si alguien también hiciera en NA y en otros foros","replies":[]}]},{"poster":"Rosv Stuff","date":"2017-01-26T18:15:20.320+0000","up_votes":1,"down_votes":2,"body":"Es al pedo ponerlo en el foro o donde quieras, se viene pidiendo hace años y nunca lo hacen.","replies":[{"poster":"Sleenox97","date":"2017-01-26T18:19:52.149+0000","up_votes":2,"down_votes":1,"body":"Si tiene muchos puntos son leídos, no esperes que para mañana va a estar, primero tienen prioridad para otros proyectos pero en su momento van a poner, esto puede ayudar para que lo agreguen antes porque en alguna ocasión lo van agregar.","replies":[{"poster":"Rosv Stuff","date":"2017-01-26T18:35:19.017+0000","up_votes":1,"down_votes":2,"body":"Pensas que sos el 4to o 5to que se le ocurre la idea? ya van como 300 personas que lo vienen pidiendo","replies":[{"poster":"Sleenox97","date":"2017-01-26T18:42:49.115+0000","up_votes":2,"down_votes":1,"body":"Se que no soy el único, pero si no son persistente no lo van a tener.","replies":[]}]}]}]}]}