{"poster":"INAZUMA 33","date":"2015-09-01T10:28:48.188+0000","title":"Les Jeaux sont (quasi) fait","subforum":"Esport","up_votes":1,"down_votes":1,"body":"Oramai ci avviciniamo sempre pi&ugrave; alla competizione annuale pi&ugrave; importante nell&#039;universo di League of Legends, mancano solo due squadre Cinesi e una squadra per le Wildcard tra PainGaming e Kaos Latin Gamers.\r\nVoi per chi tiferete? \r\n(a me piacevano gli UOL ma :( sappiamo che non ce l&#039;hanno fatta)","replies":[{"poster":"Fiat480 EdVeneto","date":"2015-09-01T14:33:08.367+0000","up_votes":1,"down_votes":0,"body":"Ci sono squadre filippine?","replies":[]},{"poster":"StayM","date":"2015-09-01T12:52:52.724+0000","up_votes":1,"down_votes":0,"body":"Fnatic ! quest'anno mi piacciono tantissimo, sia la composizione sia per come giocano, precisi, coordinati, sfruttano gli errori avversari punendoli pesantemente io li voglio almeno in finale se non vincitori.\nGli Origen o Fnatic v1.0 penso possano fare molto bene, sono quasi tutti giocatori esperti e daranno del filo da torcere ma non li vedo in lizza per il titolo.\nGli h2K li vedo invece come carne da macello anche se KaSing qualche sorpresa la può riservare\nPer il NA. I Clg li vedono allo stesso livello degli Origen nonostante la performance disumana di ZionSpartan ( Top che apprezzo moltissimo) e il sempreverde Doublelift che magari dopo aver battuto i Tsm si eccita. (Tsm saltiest team).\nInoltre devo fare i complimenti ai C9 dopo la vittoria di ieri, non gli avrei dato un soldo ma ehi it's DRAVEEEEEEEEEN.\n\nGli SKT sono pericolossissimi e ovviamente in lizza per la vittoria anche se li ritengo troppo faker-dipendenti. (li assimilerei al barcellona di un paio di anni fa)\nGli LGD sono, butto il flame, un fuoco di paia.\nI Koo non li conosco quasi per nulla quindi non mi esprimo\n\nQuindi io vorrei vedere un Fnatic vincitori, SKT secondi, Origen terzi. \n(nonostante questo sono rimasto delusissimo dagli EDG, ma cosa stanno facendo?)","replies":[]},{"poster":"TerrorVodka","date":"2015-09-01T10:49:23.769+0000","up_votes":1,"down_votes":0,"body":"per l'na TSM anche se non credo faranno molto\nper il resto spero vincano ancora gli skt (faker <3)","replies":[]},{"poster":"Nibbio Bianco","date":"2015-09-01T10:48:12.525+0000","up_votes":1,"down_votes":0,"body":"Tifero per i Fnatic in europa, visto il carisma di Huni e anche per vedere cosa riuscirà a fare yellowstar con la sua squadra. Degli H2k tiferò Kasing. Vorrei vedere i progressi di Soaz con gli origen, non aveva iniziato molto bene, sembrava essere il punto debole della squadra, ma sembra essere migliorato molto, sarà interessante vedere cosa potrà fare. \n\nLa mia botlane preferita è quella dei Qiao Gu, spero ce la facciano. TcT - TnT è una delle botlane più forti che abbia mai visto, rischiano di poter vincere anche il mondiale se ci si mettono d'impegno quei due, però per ora devono ancora sconfiggere gli avversari rimanenti per accedere come terzi ai mondiali. \n\nIn america W Clg, adoro Pobelter e vorrei vedere i progressi di Hai dei c9. \n\nTaiwan? W yoe flash wolves, massima stima per steak. Kappa \n\nFAKER SKT T1.","replies":[]}]}