{"poster":"INAZUMA 33","date":"2015-04-24T08:41:06.078+0000","title":"cosa succede se?","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"Ma se aatrox viene marcato dall&#039;abilit&agrave; suprema di yorick e quella di zilean, e la sua passiva (di aatrox) &eacute; attiva, ed ha come oggetto la guardian Angel, cosa si attiva prima? E se mordekaiser usa la sua abilit&agrave; suprema su un nemico morto ma resuscitato brevemente dall&#039;abilit&agrave; suprema di yorick, il fantasma si crea comunque? E se, sempre mordekaiser, uccide sion con la sua abilit&agrave; suprema, il fantasmino viene creato dopo la fine della passiva di Sion?","replies":[{"poster":"Whommy","date":"2015-04-24T08:53:49.123+0000","up_votes":4,"down_votes":0,"body":"Cioè...davvero....mettiti una mela in testa","replies":[]},{"poster":"Sorcio84","date":"2015-04-26T05:01:17.746+0000","up_votes":1,"down_votes":0,"body":"- passiva di {{champion:266}} \nquando muore resuscita, in questo caso **non*( da la kill\n- {{item:3026}} \nquando muori resusciti e **non** dai la kill\n- {{champion:82}} \nse **prende** una kill quando l'avversario è maledetto, crea il clone spirito. Basta che prenda la kill quando sei maledetto\n- ulti di {{champion:83}} \nquando muori l'avversario **prende** la kill e tu resti vivo per altri 10 secondi\n- ulti di {{champion:26}} \nresiscita un alleato e **non** da la kill all'avversario","replies":[]},{"poster":"Best Chair Euw","date":"2015-04-24T11:08:13.762+0000","up_votes":1,"down_votes":0,"body":"Per tutte queste domande c'è un Diamond straniero che ha fatto tutti questi test, si chiama Redmercy e la serie si chiama League of Myths sono una quarantina di puntate di 5-8minuti in cui vengono testate tutte le interazioni tra i vari champ e mi ricordo anche di qualcosa di simile alla tua domanda","replies":[]},{"poster":"DarkBeccio","date":"2015-04-24T09:12:03.599+0000","up_votes":1,"down_votes":0,"body":"Per la prima domanda Credo che l'abilità di zilean si attivi per prima se dovesse morire di nuovo entro i dieci secondi del ritornante di yorick allora verrà resuscitato da quest'ultimo poi si attiva guardian angel e per ultima pozzo di sangue. Il dubbio è che le abilità di zilean e yorick si annullino a vicenda(nel senso che vengano usate entrambe) ma questo sarebbe un controsenso perché ammesso che convenga avere yorick e zilean nello stesso team non potresti usufruire di entrambe le abilità. Per la seconda domanda la final di mordekaiser dice che se un campione muore quando l'incantesimo attivo si crea un fantasma, poco importa che poi torni in vita quindi il fantasma si crea lo stesso.\nPer la terza domanda ovviamente si perchè se non sbaglio ottieni la kill di sion dopo la fine della sua passiva quindi fino al suo esaurimento lui non è veramente morto. In ogni caso non ho sperimentato personalmente i casi specifici ma la mia opinione a riguardo è questa! =)","replies":[{"poster":"Phanix","date":"2015-04-24T09:24:13.612+0000","up_votes":1,"down_votes":0,"body":"mi disp ma su sion la kill la prendi quando muore poi dopo si attiva la passiva ma la kill viene assegnata a chi ha ucciso lui non la sua passiva!","replies":[{"poster":"DarkBeccio","date":"2015-04-24T09:51:45.395+0000","up_votes":1,"down_votes":0,"body":"ok scusa non mi ricordavo bene! =)","replies":[]}]}]}]}