{"poster":"ANIME IS AWFUL","date":"2019-10-07T20:27:46.515+0000","title":"Kai'Sa is extremely sexualized for no GOOD reason","subforum":"Story, Art, & Sound","up_votes":6,"down_votes":28,"body":"I'd like to start with by informing you that I'm not an SJW and I don't agree with feminist ideology in general but when it comes to Kai'Sa and her skins in this game they have a point. She's really sexualized to insane levels (probably more than any other female champion in the game if you consider her story).\r\n\r\nhttps://universe-meeps.leagueoflegends.com/v1/assets/images/kaisa-splash.jpg \r\n\r\nMost of her life she was fighting for survival among wasteland swallowed by the Void. Her first days in there she was eating rotten peaches and drinking dirty water. Then when she got her 2nd skin she was feeding on Void creatures. You're telling me during all these years she didn't get any scars? Her skin, hair and face look amazing even though she dwelled in darkness for years? She had time and concerned herself with working out and/or putting sillicon implants inside herself? When her 2nd skin grew it convinently skipped her cleavage so she can look more sexy? She likes doing makeup in her spare time too? So many questions but no answers in her lore.\r\n\r\nhttps://i.redd.it/idwegus81de21.jpg\r\n\r\nLet's talk about her skins now, specifically K/DA ones. Splash arts here are straight up ridiculously sexualized - just the right angle for the viewer to see her big, sexy bum and long legs but what strikes me the most are her ENORMOUS melons. Do you realize how big they would have to be when one of them is so visible from such angle?\r\n\r\nI know that sex sells Riot but just because you can make some quick and easy money on horny teenage boys doesn't mean it's right for you to do so. Things like these cheapen the experience - every time reasonable people see K/DA Kai'Sa during loading screen they laugh at how ridiculously bad her visual design is. The best fiction characters are the ones that are believable, not the ones that are the most sexy.\r\n\r\nThis is what Kai'Sa could have been if Riot was more focused on making a good game instead of providing a good fap material just so they can make a few extra bucks. \r\n\r\nhttps://img00.deviantart.net/5d5e/i/2018/051/5/3/void_bust_v01_by_the_bravo_ray-dc3rwgr.jpg","replies":[{"poster":"Jikker","date":"2019-12-22T02:45:50.471+0000","up_votes":1,"down_votes":0,"body":"Please do not necro old threads as doing so violates the [**Board Universal Rules**](https://boards.na.leagueoflegends.com/en/c/community-moderation/ITFIpNUE).  I'm going to lock this thread down now.\n\nIf anyone has questions about this lock, feel free to reach out to the Moderation Team via:\n\n* The [**NA Boards Discord**](https://boards.na.leagueoflegends.com/en/c/community-moderation/7rtKBZLi-boards-moderation-discord-verification)\n* The [**Discuss the Boards**](https://boards.na.leagueoflegends.com/en/c/community-moderation) sub-board\n\n{{sticker:poppy-wink}}","replies":[]},{"poster":"Reaper Soraka","date":"2019-10-07T20:32:56.771+0000","up_votes":11,"down_votes":1,"body":"You're late.  The forums have already been over this.  Like a long time ago.\n\nYou're super late.\n\nLike I'm fairly certain they changed her original splash art because of SJWs?  I don't recall if it was this one.  You already won this battle though, so congrats I think.","replies":[{"poster":"Arakadia","date":"2019-10-08T05:56:20.810+0000","up_votes":5,"down_votes":3,"body":"The fact people still unironically use the word sjw like they are some boogie man out to take your waifus away is so silly.\n\nHer design is still terrible, they never changed her splashart, the _ess jay double uws_ didn't 'win'.\n\nBesides, even if OP is beating a dead horse, that in itself doesn't invalidate their point, that would be illogical. \n","replies":[]}]},{"poster":"Pandemic Punch","date":"2019-10-08T12:14:37.083+0000","up_votes":6,"down_votes":0,"body":"https://i.kym-cdn.com/entries/icons/original/000/029/223/cover2.jpg","replies":[]},{"poster":"4 Step Cadence","date":"2019-10-07T20:35:38.304+0000","up_votes":9,"down_votes":3,"body":"You realize the in-game representation of champions are them in the present day in the lore, right? Kai'Sa already got out of the Void infested caverns, so yeah, she probably did clean herself up to the best of her ability. As for why she's uninjured, the suit protected her basically the entire time.\n\nAnd K/DA Kai'Sa is in a music group, so yeah, she does makeup and looks sexy.\n\nAnd there are so many more female champions who are worse when it comes to the sexualization, both in their base and their skins.","replies":[{"poster":"ANIME IS AWFUL","date":"2019-10-07T20:42:51.500+0000","up_votes":6,"down_votes":8,"body":"She spent years in darkness of the Void. She was feeding on rotting fruit for days, then on slimy meat for years. You don't think such lifestyle would have a LONG lasting impact on her appearance? Because of this I don't think there's a worse champion example of oversexualization than Kai'Sa. She has no business looking this hot after YEARS of struggle.","replies":[{"poster":"4 Step Cadence","date":"2019-10-07T20:51:08.892+0000","up_votes":5,"down_votes":4,"body":"Any food is enough to sustain the body. Your body only starts to degrade when you're actually starving to death. As long as she was eating, she should be fine.\nNot saying that she got any vitamins or nutrients that she actually needs, but what do you want? Its a fantasy world for a fantasy game.\n\nShe is insanely skinny, though, but any actual physical problems are likely countered by the suit, which basically makes her superhuman.","replies":[{"poster":"ANIME IS AWFUL","date":"2019-10-07T20:57:18.202+0000","up_votes":3,"down_votes":4,"body":"Nothing in the lore says the suit feeds her body required nutrients nor heals her. There are many diseases you can get if your diet is poor. For example skin and hair degredation are very common if you don't feed your body required nutrients.","replies":[{"poster":"4 Step Cadence","date":"2019-10-07T21:01:18.652+0000","up_votes":7,"down_votes":0,"body":"The suit is a living creature with its own strength. If she's weak from not eating, or has some health problems(like degraded muscles) from not eating, the suit will help her move like any suit that makes someone superhuman.\n\nAnd since it doesn't say exactly what the properties of her suit are in the lore, we can not confirm or deny that that is how it works, unless Riot stated it somewhere else.","replies":[]},{"poster":"Terozu","date":"2019-10-07T22:01:52.357+0000","up_votes":3,"down_votes":2,"body":"Actually it does, the Void suit is able to convert other voidlings into energy for her.\n\nThe suit does protect her from scars, and it reveals her cleavage so she can breath better.","replies":[{"poster":"GreenLore","date":"2019-10-07T22:27:41.851+0000","up_votes":2,"down_votes":1,"body":"That breathing aspect feels a bit contrived, since she covers her cleavage and her face during combat, which would be the moment where she would breath more heavily.\n\nGranted it'd be more comfortable for her to breathe that way, but its well established that the suit doesn't really care that much about that.","replies":[{"poster":"Terozu","date":"2019-10-07T23:03:12.098+0000","up_votes":2,"down_votes":3,"body":"Contrived, yes.  But it is logical.\n\nIf someone is having a hard time breathing, taking clothes off is a common early step.\n\nAnd I've heard girls complaining about bras that make breathing hard, let alone a catsuit.","replies":[{"poster":"Dancing Truffle","date":"2019-10-08T07:00:00.780+0000","up_votes":3,"down_votes":0,"body":"You do breathe way better without a bra or heavy clothes covering your cleavage completely. So yea when they're that big, I wouldn't cover them completely if I need to breathe well either. She covers them in combat because if she gets hit there, it would be worse then breathing more comfortably.","replies":[{"poster":"4 Step Cadence","date":"2019-10-08T07:15:39.538+0000","up_votes":2,"down_votes":0,"body":"This.\n\nI would greatly prefer not dying over being able to breath better, and I'm sure Kai'Sa does too. And besides, she can't control when the mask activates in the lore. The Voidling that is the suit activates the mask as a defense mechanism when it senses danger.","replies":[]}]},{"poster":"GreenLore","date":"2019-10-08T09:18:29.573+0000","up_votes":1,"down_votes":1,"body":"Why would the suit keep that area open if it only cares about Kai'sas survival and not her wellbeing?\n\nIf Kai'sa had trouble breathing, then the suit could open up for that moment, but that doesn't mean it would need to do that all the time. while out of combat(as sneak attacks could hit her in a vulnerable moment).\nLike I said, the suit doesn't care for Kai'sa feeling all right, as long as she survives, Kai'sa even describes the suit as feeling like thousands of needles are piercing her all the time.","replies":[{"poster":"Jaspers","date":"2019-10-08T10:10:15.969+0000","up_votes":1,"down_votes":0,"body":"Doesn't it even state (by Kai'sa) that if she doesn't keep it fed it will start feeding on her? The skin will feed on her and move on but while it's grafted to her skin, she can't rid it so she might as well feed it.\n\nIf it was a true monster it would cover her entirely (as in the face mask all the time).","replies":[]}]}]}]}]}]}]}]},{"poster":"GreenLore","date":"2019-10-07T20:44:08.858+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=4 Step Cadence,realm=NA,application-id=6kFXY1kR,discussion-id=ET1Msy30,comment-id=0001,timestamp=2019-10-07T20:35:38.304+0000)\n>\n> And there are so many more female champions who are worse when it comes to the sexualization, both in their base and their skins.\n\n\nThere are worse offenders, but most of them(like {{champion:51}} ) are from a time where riot had quite the \"sex-sells\"-mentality, because League wasn't the big success it is today, and where the designs were often made without much thought about the lore. Nowadays we are used to better standards for character design.\nKai'sa however is a much more recent example and a pretty blatant at that.","replies":[{"poster":"4 Step Cadence","date":"2019-10-07T20:55:54.296+0000","up_votes":3,"down_votes":1,"body":"Weren't people bitching about reworked Irelia's thighs and the fact that \"Frostbutt\" still showcases her ass pretty good?","replies":[{"poster":"GreenLore","date":"2019-10-07T21:05:57.653+0000","up_votes":1,"down_votes":1,"body":"There might have been a few, but they were definitely a minority, which makes sense since Irelia is not nearly as sexualized as Kai'sa.\nI mean Irelias sexualization boils down to: She has wide hips and tight pants. And the pants aren't even much of a problem since her butt is barely visible anyway.\nAnd even if she was sexualized a bit, it would have been a bit more justified in her case since she is also a dancer and dancers tend to wear sexy clothing.\n\nAnd as far as I remember, there were actually more people who complained about the frostbutt not being sexualized enough...","replies":[{"poster":"4 Step Cadence","date":"2019-10-07T21:28:43.609+0000","up_votes":5,"down_votes":1,"body":"Community: Riot please stop overly-sexualizing your champions.\nRiot: Alright. Frostbutt Irelia isn't overly-sexualized anymore.\nCommunity: Wait no that's not what we meant.\n\nAlso...\n\n* Kayle's lack of armor caused quite a stir, even though its for clarity reasons and similar reasons to Irelia and Kai'Sa. People were also pissed that she loses armor as she evolves and comapred her to a \"stripper,\" even though her doing that represents her becoming more human and separating herself more from the faceless Aspect of Justice(I think).\n\n\n* A few people complained about Morgana even though she's less sexualized than she was before.\n\n\n* Sylas being buff and shirtless caused a lot of complaints.\n\n\n* Qiyana being \"thicc\" caused some complaints.\n\nNot sure about some other champions since I wasn't very active on the boards when they were released.","replies":[{"poster":"GreenLore","date":"2019-10-07T22:25:44.413+0000","up_votes":3,"down_votes":2,"body":"And how are any of these examples worse than kai'sa?\n\nThe problem lies with sexualization that doesn't make sense. It's perfectly fine for a champ to be sexy when it fits the theme/character/story of the champ, heck its even ok if they are attractive looking even when its not necessary.\nBut when the sexualization actually doesn't make sense for the theme, then that is a problem.\n\nKai'sas sexualization literally goes against the themes that she is supposed to represent.\nShe is supposed to look dangerous, offputting and intimidating, yet she looks sexy and attractive.\nHer suit is supposed to be organic, yet it leaves some cleavage to show off some boobs, which doesn't make sense for an organic suit, making it look artificial.\nShe is a survivor and outcast who had to live in a monster infested cave since childhood, yet she doesn't show any physical or mental scars, she doesn't even look battle-hardened or anything like that in most of her art(the ingame model of her face is actually quite good in that regard).\n\nThe examples you posted above caused some people to complain a bit, but thats because there'll be always some people who complain about every bit of fanservice. But the fanservice doesn't really go against the core-themes of these champs in the first place (granted Sylas is a bit jarring since he nearly starved in his story, but at least it fits his theme, since ex-prisoners are usually depicted as pretty buff guys, who trained in prison, so while it does clash with his story, it fits his thematic core).","replies":[]},{"poster":"CaptainAntiHeroz","date":"2019-10-09T10:32:28.318+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=4 Step Cadence,realm=NA,application-id=6kFXY1kR,discussion-id=ET1Msy30,comment-id=00010001000000000000,timestamp=2019-10-07T21:28:43.609+0000)\n>\n> Community: Riot please stop overly-sexualizing your champions.\n> Riot: Alright. Frostbutt Irelia isn't overly-sexualized anymore.\n> Community: Wait no that's not what we meant.\n> \n> Also...\n> \n> * Kayle's lack of armor caused quite a stir, even though its for clarity reasons and similar reasons to Irelia and Kai'Sa. People were also pissed that she loses armor as she evolves and comapred her to a \"stripper,\" even though her doing that represents her becoming more human and separating herself more from the faceless Aspect of Justice(I think).\n> \n> \n> * A few people complained about Morgana even though she's less sexualized than she was before.\n> \n> \n> * Sylas being buff and shirtless caused a lot of complaints.\n> \n> \n> * Qiyana being \"thicc\" caused some complaints.\n> \n> Not sure about some other champions since I wasn't very active on the boards when they were released.\n\nI hate Morg's attitude now more than having more clothes on, I like the dress personally. I just think she's too much of a like \"highschool drama Queen with family issues\" rather than a powerful ancient being. I can understand having caring dialogue, but not whiny dialogue","replies":[]}]}]}]},{"poster":"14daysuspensionk","date":"2019-10-07T23:54:37.998+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=GreenLore,realm=EUW,application-id=6kFXY1kR,discussion-id=ET1Msy30,comment-id=00010001,timestamp=2019-10-07T20:44:08.858+0000)\n>\n> There are worse offenders, but most of them(like {{champion:51}} ) are from a time where riot had quite the \"sex-sells\"-mentality, because League wasn't the big success it is today, and where the designs were often made without much thought about the lore. Nowadays we are used to better standards for character design.\n> Kai'sa however is a much more recent example and a pretty blatant at that.\n\nWhich was what years? I'd say Jinx is a pretty old champion (dates back to 2013 with the old SR map), and she was barely sexualized. Just look at her base splash art, boobs barely exist. Plus her release skin even hides them.","replies":[{"poster":"GreenLore","date":"2019-10-08T09:32:09.439+0000","up_votes":2,"down_votes":2,"body":"I wouldn't even say that Jinx is a worse offender than Kai'sa, since Jinxs revealing attire still fits the whole \"punk\"-aesthetic that they were going for. She is designed to look like someone crazy from Borderlands or Mad Max and her design supports that aesthetic pretty neat.\n\nWhen it comes to illogical sexualization (there is no problem with a champ looking sexy if it makes sense),I'd say that out of the female champs Kai'sa is easily in the top 5 of the worst offenders. \nIronically I'd say that Kassadin, her father, might be one of the worst offenders of this on the male side. Like seriously, why does he run around shirtless, when he needs a protection suit?","replies":[{"poster":"14daysuspensionk","date":"2019-10-08T14:18:44.754+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=GreenLore,realm=EUW,application-id=6kFXY1kR,discussion-id=ET1Msy30,comment-id=0001000100010000,timestamp=2019-10-08T09:32:09.439+0000)\n>\n> I wouldn't even say that Jinx is a worse offender than Kai'sa, since Jinxs revealing attire still fits the whole \"punk\"-aesthetic that they were going for. She is designed to look like someone crazy from Borderlands or Mad Max and her design supports that aesthetic pretty neat.\n> \n> When it comes to illogical sexualization (there is no problem with a champ looking sexy if it makes sense),I'd say that out of the female champs Kai'sa is easily in the top 5 of the worst offenders. \n> Ironically I'd say that Kassadin, her father, might be one of the worst offenders of this on the male side. Like seriously, why does he run around shirtless, when he needs a protection suit?\n\nIn what world is Kassadin sexy looking?","replies":[{"poster":"GreenLore","date":"2019-10-08T17:45:40.036+0000","up_votes":1,"down_votes":1,"body":"Not necessarily sexy looking, but still unnecessary sexualized.\nHe runs around shirtless with a completely exposed muscular body, that looks perfectly normal except for the blue color(and given that Eve with her pale skin can look sexy I'd say that blue skin doesn't make it less sexualized), despite the fact that he is supposed to give off an eldritch vibe, with his illithid-resembling helmet and with his lore making it clear how the void corrupts/destroys his body.","replies":[]}]}]}]}]}]},{"poster":"Kazekiba","date":"2019-10-08T00:03:11.122+0000","up_votes":1,"down_votes":7,"body":"Given what Kassadin looks like ..  yes she should be a mutant monstrosity but they made her to be Vayne 2.0, skintight bodysuit included. \nShes a swimsuit model just because it sells literally millions and everyone knows it, and Riot needed to cut off the no-sexy-women rule thry followed for close to 4 years. \n\nOnly females released back then were Illaoi, Lamb, Reksai, Jinx, and Taliyah. \nIllaoi/Tali are deliberately ugly, Jinx is inhuman looking and Lamb/Rek are literal monsters - Not that Lamb isnt a sex goddess in her own right.","replies":[{"poster":"4 Step Cadence","date":"2019-10-08T00:06:39.899+0000","up_votes":7,"down_votes":0,"body":"No, she shouldn't be. I believe Kassadin was in direct contact with the Void at some point. Kai'Sa wasn't. She was in a cave system that was infested by Voidlings, not the Void itself. Thus, no corruption. Plus, she got the sybiote almost immediately, and that protected her from any corruption she would have come into contact with.","replies":[{"poster":"DerMangoJoghurt","date":"2019-10-08T08:25:37.571+0000","up_votes":2,"down_votes":0,"body":"As far as we know Kassadin didn't have direct contact with the Void either, although he is venturing as deep into the caverns as the Ascended once did. His unnatural skin color isn't caused by the Void, but by one of the artifacts he carries to protect himself.\n\n> In my other hand, I clutch the stone tightly. Its foreign magic has kept me alive this long—long enough to delve far, far beneath the wastelands of old Icathia. It holds your corruption at bay, though at what cost to my flesh and my spirit, I cannot guess, for this smallest of trinkets now thrums in time with my own heart. That fearful rhythm is not the pulse of life, or magic, or any other wholesome thing, but of oblivion itself. Of that much, I am certain.","replies":[]},{"poster":"FiendSensei","date":"2019-12-22T02:38:20.331+0000","up_votes":1,"down_votes":0,"body":"Plus:we dont really know wht kassadin looks like now without his helmt","replies":[]}]}]},{"poster":"boricCentaur1","date":"2019-10-07T20:53:11.464+0000","up_votes":6,"down_votes":1,"body":"Do you want to list the other champions that are much worst aka {{champion:517}} .","replies":[{"poster":"14daysuspensionk","date":"2019-10-07T23:56:48.511+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=boricCentaur1,realm=NA,application-id=6kFXY1kR,discussion-id=ET1Msy30,comment-id=0005,timestamp=2019-10-07T20:53:11.464+0000)\n>\n> Do you want to list the other champions that are much worst aka {{champion:517}} .\n\nI still don't understand why he's in shape and has muscles from mostly eating rats in prison, for over a decade.","replies":[{"poster":"Arakadia","date":"2019-10-08T06:04:40.815+0000","up_votes":5,"down_votes":0,"body":"Because realism is not important for League of Legends, and would only restrict creative freedom. \n\nThe fact is him being buff plays a role in his design. He's supposed to be a charismatic, capable leader for the rebellion. He is supposed to look like he's tough and has perservered through prison. These ideas don't come across if you make him scrawny and weak. \n\nMore so, it is a basic visual in media that prisoners who have been in prison for a long time are buff, because they have nothing to do but work out. So it's not realistic for Sylas to look the way he does, but it communicates this basic visual. \n\nMost importantly though he needs to be physically large because he is a melee fighter. You can't make him look squishy.","replies":[]},{"poster":"usul1202","date":"2019-10-08T06:00:39.372+0000","up_votes":2,"down_votes":0,"body":"He was makin bank as a prison stripper and could buy food. I mean, have you seen that dance?","replies":[]}]},{"poster":"Arakadia","date":"2019-10-09T01:24:40.765+0000","up_votes":2,"down_votes":1,"body":"Sylas is not nearly as bad as Kaisa. Sure he's bad, but he's also the only bad example of male sex appeal in league.","replies":[]},{"poster":"GreenLore","date":"2019-10-09T04:38:57.409+0000","up_votes":1,"down_votes":0,"body":"I wouldn't say that Sylas is worse though.\n\nThe main theme of Sylas is that he is an ex-prisoner with magic stealing abilities and his muscular body actually helps to sell the ex-prisoner idea, as its pretty common in fiction for people to train in the prison to get stronger.\nhttps://tvtropes.org/pmwiki/pmwiki.php/Main/PrisonsAreGymnasiums\n\nThat being said, it obviously still clashes with his claim that he had to eat rats in prison in order to survive, so while I wouldn't call him as bad as Kai'sa, I do agree that there is a disconnect.","replies":[]}]},{"poster":"UomoAfide","date":"2019-10-08T16:20:45.261+0000","up_votes":3,"down_votes":0,"body":"https://thumbs.gfycat.com/PinkGeneralJaeger-size_restricted.gif","replies":[]},{"poster":"4 Step Cadence","date":"2019-10-08T06:53:11.083+0000","up_votes":3,"down_votes":1,"body":"Alright I'm back with more shit to say.\n\nKai'Sa was likely never going to be anything besides a human female, because she was already basically created years before she was released.\n\n[This is Husk.](https://leagueoflegends.fandom.com/wiki/File:Camille_Kai%27Sa_Early_concept_06.jpg) Husk was scrapped, and Camille and Kai'Sa both share aspects of her design, with Kai'Sa resembling her the most.\n\n**Kai'Sa**\n\n* Sleek design, comprised of a thin frame and tight-fitting clothing.\n\n\n* Optional mask.\n\n\n* Shoulder things that basically function as a jetpack.\n\n**Camille**\n\n* The more serious expressions.\n\n\n* Thin frame, tight clothing.\n\n\n* Leg problems.\n\nThey could have kept the more serious, battle-scarred look for Kai'Sa, but seeing as how her suit protects her when it senses danger(activates the mask), its unlikely that she would have ever been injured.\n\nI think Kai'Sa is fine design wise and its only really her splash art(s) that are the problem. Seeing as how the splash arts are meant to make you want to buy the product they are showing off, she's going to be sexualized in them, and there's no way to really get around that.\n\n* She isn't walking around constantly with a plunging neckline. If the suit senses danger, the mask comes on, covering her head, neck and chest. And since she's almost always in some sort of danger, its unlikely that she is without her mask very often.\n\n\n* She's meant to be a swift hunter navigating the tight tunnels that the Void has infested, and that requires a sleek, skin-tight suit, as clothing would slow you down/get caught on things. Plus, its a symbiote. Its a part of her now, so its going to be skin-tight anyway.\n\n\n* As I pointed out before, she does appear to have suffered from her time in the caverns, being very thin and likely suffering from some other health issues. However, the suit may counter this, as being a symbiote, it basically makes her superhuman and makes her able to move/function despite possible issues.\n\n\n* Another thing I pointed out before, her in-game/slash art appearance is what she looks like in the present day lore, after she escaped the caverns. She was likely very dirty before, but the first thing she probably did was clean herself up and try to look as \"normal\" as she could without compromising her hunting abilities. Thus, the flawless hair and make up.\n\nTLDR: Kai'Sa is fine and only her \"sex sells\" splash arts are the problem.","replies":[{"poster":"GreenLore","date":"2019-10-08T09:34:59.397+0000","up_votes":1,"down_votes":1,"body":"> They could have kept the more serious, battle-scarred look for Kai'Sa, but seeing as how her suit protects her when it senses danger(activates the mask), its unlikely that she would have ever been injured\n\n\nKeep in mind that the suit slowly started to grow on her.\nIt originally only covered her hand and then grew from there.","replies":[{"poster":"4 Step Cadence","date":"2019-10-08T09:43:16.725+0000","up_votes":3,"down_votes":0,"body":"> The creature was seemingly dead, but its unnatural skin had taken hold upon the flesh of her arm. The dark shell tingled, but was hard as steel to the touch. In a panic, Kaisa broke her knife trying to remove it. But when the larger beasts came, she used it as a shield to make her escape.\n> \n> Soon enough, she realized the shell was becoming part of her. As her daily struggle to survive drew out into years, this second skin grew with her, and so too did her resolve.\n\nIt doesn't specifically say how long it took for the skin to fully cover her body. It could have taken minutes, years, or anywhere in between. It does, however, say that she immediately started using it as a \"shield\" to protect herself from larger Voidlings.\n\nAnd, seeing as how the first Voidlings she encountered were small and no bigger than her, I doubt she would have gotten injured by them outside of minor cuts and bruises, which normally don't leave big, ugly scars.","replies":[{"poster":"GreenLore","date":"2019-10-08T09:59:42.595+0000","up_votes":2,"down_votes":1,"body":"Fair point, though expecting the suit to be strong enough from the get go to effectively protect against any kind of damage is a bit illogical on its own.\nIn general the problem is that Kai'sa is supposed to look experienced and like she has been through harsh situations, but this isn't conveyed in her design at all.\nAdding a scar to her would have made this more appearant. Heck I'd say they could have also made a scar on the suit itself, to convey that.","replies":[{"poster":"4 Step Cadence","date":"2019-10-08T10:10:34.107+0000","up_votes":2,"down_votes":1,"body":"Referring back to the excerpt from her lore that I just posted, she noted how it felt \"hard as steel\" to the touch, and that she literally broke her knife trying to remove it. I don't think it can be damaged that easily.\n\nAnd I'd argue that her lack of scars proves her experience more. In a survival situation, scars are a sign you failed to keep yourself from being injured. The fact that she has no scars means she's experienced/powerful/smart enough to keep herself from getting hurt.\n\nI'd also argue that the marks on her face are scars in their own way. Maybe that's where the mask connects to her face and it sort of \"tattooed\" her when it did.","replies":[{"poster":"GreenLore","date":"2019-10-08T11:02:33.099+0000","up_votes":3,"down_votes":2,"body":"A lack of scars, be it on her suit or her actual body, makes it look more like she wasn't in a very harsh environment to begin with. The suit might have been hard as steel, but the other void monsters in that cave weren't weak either(heck her splash art actually depcits Cho'Gath in the cave, though its hard to say if that is canon or not). \n\nIt downplays the danger of her surroundings in favor of making her look perfect. And considering that her backstory sounds already quite contrived I'd say this brings her dangerously close to coming off as a mary sue.\n\n\nAnd no. Marks don't equal scars.\nA scar is a sign that you survived a bad injury, which you'd expect someone who lived in a cave filled with monsters to receive eventually.\nMeanwhile her face tatoos are essentially just there to look cool.At best they add to make her look a bit more alien, though I wouldn't say that they do a good job with that.","replies":[{"poster":"4 Step Cadence","date":"2019-10-08T11:13:49.207+0000","up_votes":2,"down_votes":4,"body":"I can't believe I have to explain to you how being a ranged champion works but I guess I have to. Since the suit started attaching on her arm, she likely developed the ability to shoot Void energy from her hands early on. The Voidlings are likely dead before they even reach her if that's the case. Kind of hard to get injured when you strike from a distance.\n\nAnd you do realize that tattoos are the result of jamming and ink covered object, usually a needle, into the flesh a fuck ton of times, right? And that she describes the touch of the Void creature as a thousand needles constantly poking her, right? The marks on her face are most definitely \"scars\" in their own way, since they show where the Void creature possibly \"stabbed\" her thousands of times every time it connected to her face.","replies":[{"poster":"GreenLore","date":"2019-10-08T12:11:46.928+0000","up_votes":3,"down_votes":2,"body":"And I can't imagine that you seriously expect her to be able to shoot every void monster dead before it could ever approach her.\nThis would mean that she'd be able to kill everything before it got to her, was never ambushed by a void monster and no other void monster ever managed to successfully shoot back. And that despite being trapped in a cave filled with monsters for years, meaning she has likely fought against hundreds, if not thousands, of void horrors.\nAnd you want to tell me  none of them appearantly managed to land a solid hit on her?That would mean that everything in the cave was extremely weak compared to her, which like I said, downplays the danger of the void monsters.\n\nAnd it doesn't matter if the marks were created in a painful way(ultimately we don't know how these came by, they might also be a result of void radiation), the fact remains that they aren't scars from a battle, they are a result of the suit being on her body. But the suit alone doesn't imply that she has fought many battles.","replies":[]}]}]}]}]}]}]},{"poster":"Arakadia","date":"2019-10-09T01:41:16.154+0000","up_votes":2,"down_votes":1,"body":"You have a lot of in-universe justifications for why she looks the way she does, but I don't really think thats an argument you can win. Her design simply isn't realistic, make up and perfect hair aren't realistic for a character like her, and thats okay. She doesn't need to be realistic, and there's no trying to pretend like her design is logical as long as it is believable.\n\nBut thats the issue. Kai'sa is supposed to be selling a fantasy, but she doesn't, it isn't believable. She's supposed to be a survivor, who has fought her entire life and now become the predator. This isn't believable though when she not only has no scars or signs of struggle, but she in fact has significant signs of beauty. The village in her short story view her as a monster, even when she has the mask down, but she clearly doesn't look like the monster her story claims her to be. These are ideas in her story, that are actively contradicted in her visuals. \n\nAnother strange contradiction is in her comic, some random dude spends an afternoon in the caves, gets murdered, and becomes a Void zombie by the end of it. Now you can argue the Void can only corrupt dead bodies, or she _immediately_ got the symbiote on her  hand and _immediately_ it made her entire body immune the Void corruption of the caves, but thats just another issue with Kai'sas design. You have to scramble to explain all the silly things. How does she speak so eloquently if she lived in isolation since youth? Why is she white with a New Zealand accent in Shurima? Where did she find quality hair conditioner and makeup after she got out of the caves? If she _really_ cares about not getting caught on things, why is her hair so long? Is it really believable that she has 0 scars from her constant fight for survival in the caves? There are legitimate answers to these questions, but it feels like we're grasping at straws in an attempt to explain them, which makes her design much less believable. \n\nThat is not a sign of solid character design. \n\nAnd don't get me started on the whole v-neck being the only way to make her look human. Give her a hood, a scarf, a poncho, literally any basic scrappy clothing and she will 100% read as a human and not a Void monster. A tattered piece of clothing would both better show the hardship she's experienced and her attempts to hold onto any remaining parts of her human life.","replies":[]}]},{"poster":"KFCeytron","date":"2019-10-07T20:56:52.519+0000","up_votes":4,"down_votes":1,"body":"First, you're extremely late. Second, Riot already stated that the reason for the low neckline is for clarity that Kai'Sa isn't a native void being like Cho'Gath or Rek'Sai but rather a human wearing a suit.","replies":[{"poster":"Arakadia","date":"2019-10-08T06:00:03.116+0000","up_votes":2,"down_votes":3,"body":"This is a hilariously bad excuse. I refuse to believe professional character artists could not think of any way to humanize a character other than showing a huge patch of skin (in this case her tits). If they didn't want her to look like a monster, PUT MORE CLOTHES ON HER. Clothes are such a basic way to communicate humanity. A total monster doesn't wear any clothes because they have no humanity, a troll might wear a loincloth or basic clothes because they are more like humans. Give Kai'sa a tattered scarf or a hood, she will 100% read as more human and more like a hunter, and it even serves as a metaphor for her trying to hold onto her humanity. ","replies":[{"poster":"KFCeytron","date":"2019-10-08T06:32:09.072+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Arakadia,realm=NA,application-id=6kFXY1kR,discussion-id=ET1Msy30,comment-id=00060000,timestamp=2019-10-08T06:00:03.116+0000)\n>\n> This is a hilariously bad excuse. I refuse to believe proffesional character artists could not think of any way to humanize a character other than showing a huge patch of skin (in this case her tits). If they didn't want her to look like a monster, PUT MORE CLOTHES ON HER. Clothes are such a basic way to communicate humanity. A total monster doesn't wear any clothes because they have no humanity, a troll might wear a loincloth or basic clothes because they are more like humans. Give Kai'sa a tattered scarf or a hood, she will 100% read as more human and more like a hunter, and it even serves as a metaphor for her trying to hold onto her humanity.\n\nExcuse me\n\nhttps://pbs.twimg.com/profile_images/3241197097/72ed778723faf2ad59aea902a4a143b8_400x400.jpeg\n\ngood sir. :P\n\nJokes aside, my guess right now is that the void aesthetic is supposed to be as strong as possible, with just enough non-void to allow people to see that she's a human, and perhaps clothing would detract from that. Or maybe they tried it and it just looked weird, or wasn't readable, or something. I dunno.","replies":[]}]}]},{"poster":"BeatzBoyFTW","date":"2019-10-08T12:39:48.691+0000","up_votes":2,"down_votes":0,"body":"FFS, didn't we had this talk like almost a year ago? Stop beating a dead horse.","replies":[]}]}