{"poster":"Tegash","date":"2018-06-12T13:17:31.372+0000","title":"Here's my question, Riot.","subforum":"Report a Bug","up_votes":2,"down_votes":0,"body":"Why is it that when I get the Skip Waiting For Stats bug, I&#039;m not awarded a chest, a key fragment, or even a grade?\r\n\r\nI took part in the game. It shows up in match history. So why is this happening?\r\n\r\n(Put it in bugs since I don&#039;t think this is intended client behaviour.)","replies":[{"poster":"Bazerka","date":"2018-06-12T16:44:31.297+0000","up_votes":3,"down_votes":0,"body":"Thanks for the post! I'm mostly commenting here so that it gets noticed :D.","replies":[{"poster":"Demesejha","date":"2018-06-12T22:15:18.554+0000","up_votes":1,"down_votes":0,"body":"This happens to me too all the time, its really frustrating because I've missed out on countless things over time.","replies":[]},{"poster":"Tegash","date":"2018-06-12T22:13:59.711+0000","up_votes":1,"down_votes":0,"body":"Thank you so much!","replies":[]}]},{"poster":"HommeGoujon","date":"2018-06-12T13:22:25.164+0000","up_votes":1,"down_votes":0,"body":"For some reason the Grade doesn't always shows up in match history, even when you don't skip results. I never get key fragments after a game (maybe we used to?). If you didn't get an S- or higher how would you receive a chest? And how would you know if your grade doesn't show up in match history?","replies":[{"poster":"Unker139","date":"2018-06-12T16:47:37.531+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HommeGoujon,realm=NA,application-id=LqLKtMpN,discussion-id=y8LnuETM,comment-id=0000,timestamp=2018-06-12T13:22:25.164+0000)\n>\n> For some reason the Grade doesn&#x27;t always shows up in match history, even when you don&#x27;t skip results. I never get key fragments after a game (maybe we used to?). If you didn&#x27;t get an S- or higher how would you receive a chest? And how would you know if your grade doesn&#x27;t show up in match history?\n\nI've noticed that if you don't hover over your icon to see the grade, you wont see it in your history.","replies":[{"poster":"HommeGoujon","date":"2018-06-12T17:39:34.376+0000","up_votes":1,"down_votes":0,"body":"Is that so? I think the moment I noticed it is when I had the message you got a S or whatever with your champ so I didnt bother checking the grade I guess. I'll try it out next time I play. Thanks!","replies":[]}]}]}]}