{"poster":"Sylvánas","date":"2017-04-18T19:01:46.865+0000","title":"2 Wochen Bann - Keine Mastery Tokens?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":4,"body":"Mal ne frage, hab jetzt meinen (berechtigten) 2 Wochen Bann abgesessen, und mir ist schon bewusst, dass man da keine Hextech Beute f&uuml;r ne Zeit lang bekommt - aber gilt das auch f&uuml;r Mastery Tokens? Ich hatte jetzt einige Spiele wo ich zumindestens ein S- bekommen h&auml;tte sollen, aber trotzdem ist es immer ein A+. Sollte das wirklich so sein, wie lange dauert es denn bitte, bis ich meine Tokens wieder bekomme? xD\r\n\r\nlg","replies":[{"poster":"TerrorRaven","date":"2017-04-18T19:11:03.481+0000","up_votes":1,"down_votes":0,"body":"Ja, weil die Mastery Token mit den Hextech-System zusammen hängen.","replies":[{"poster":"Sylvánas","date":"2017-04-18T19:14:35.727+0000","up_votes":1,"down_votes":0,"body":"kk danke für die antwort, weißt du zufällig wann man die wieder bekommt? :D","replies":[{"poster":"Sirrkas","date":"2017-04-18T19:21:47.286+0000","up_votes":1,"down_votes":0,"body":"Das weiß keiner so genau. Nach CRs haben einige von 20 bis 50 Spielen berichtet. Beim Bann kann das aber länger dauern. Zudem hängt es vermutlich auch von deinem Verhalten ab. Wenn das System bemerkt, dass du innerhalb von 30 Spielen die Leute blamst, wird es dann wohl länger dauern. \n\nIm Grunde kann man nur folgendes sagen, bleib anständig und spiel weiter. Irgendwann sollte die Nachricht aufplöppen, dass du wieder Loot erhalten kannst.","replies":[{"poster":"Sylvánas","date":"2017-04-18T19:23:32.298+0000","up_votes":1,"down_votes":0,"body":"Danke für die Antwort!\n\nJa daran halte ich mich auch ^^ Ich hab mir jetzt angewöhnt einfach gar nichts zu schreiben, höchstens mal 1 oder 2 Wörter xD Will keinen Perma riskieren ^^","replies":[{"poster":"Sirrkas","date":"2017-04-18T19:26:10.155+0000","up_votes":1,"down_votes":0,"body":"Fang mit \"gl hf\" zu Spielbeginn an und beende den Chat mit \"gg\". Dann hast du schon deine Wörter^^\n\nDen Rest kann man ohnehin mit Pings machen, außer vielleicht \"they got a lot of ad, guess we should build armor\".\n\nLetzteres kommt auch viel besser an als \"get randuins you noob\".","replies":[{"poster":"Sylvánas","date":"2017-04-18T19:28:12.853+0000","up_votes":2,"down_votes":0,"body":"Ja isso :)","replies":[]}]},{"poster":"SST Višap","date":"2017-04-18T22:10:14.612+0000","up_votes":1,"down_votes":0,"body":"Schreib es einfach und schick es nicht ab.\nSo kann ich mich immer abreagieren x3","replies":[]}]}]}]}]},{"poster":"Angel Ayume","date":"2017-04-18T19:23:01.576+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Saved By Soraka,realm=EUW,application-id=KYnfKGf0,discussion-id=pKAjJHdy,comment-id=,timestamp=2017-04-18T19:01:46.865+0000)\n>\n> Ich hatte jetzt einige Spiele wo ich zumindestens ein S- bekommen hätte sollen, aber trotzdem ist es immer ein A+. \n\nWer sagt dir denn, dass du ein S- hättest bekommen sollen? ^^ \nDie bekommst vllt keine Token für ein S-/S, aber deswegen wird deine Wertung sicher nicht absichtlich runtergesetzt.\nWenn du kein S- bekommen hast dann hat das sicher seine Gründe. ^^ Aber sicher nicht wegen dem 2 Wochen-Bann :D","replies":[{"poster":"Sylvánas","date":"2017-04-18T19:25:07.157+0000","up_votes":1,"down_votes":0,"body":"Kann auch sein ^^ Dachte nur 1/4/30 auf janna könnte ein S- wert sein ^^","replies":[{"poster":"Angel Ayume","date":"2017-04-18T19:48:27.113+0000","up_votes":1,"down_votes":0,"body":"Nicht wenn man 21 Wards nach 42 Minuten stellt. xD Extrem wenig. Das setze ich als Midlaner in der Zeit ohne Sightstone. :D","replies":[{"poster":"Bettnachleger","date":"2017-11-26T09:17:12.959+0000","up_votes":1,"down_votes":0,"body":"Machst du nicht ;D","replies":[{"poster":"Angel Ayume","date":"2017-11-26T10:52:44.434+0000","up_votes":1,"down_votes":0,"body":"Doch schon. Wenn du meine Ranked Spiele anschaust die 40 Min oder höher sind dann habe ich immer so um die 21 Wards gestellt. Nicht immer, auch mal weniger aber immer nah dran. ^^","replies":[]}]},{"poster":"Sylvánas","date":"2017-04-18T19:51:02.853+0000","up_votes":1,"down_votes":0,"body":"Da ich ohnehin schon LV 7 bin ist es ja nicht so wichtig, war nur neugierig xD","replies":[{"poster":"Angel Ayume","date":"2017-04-18T19:55:36.840+0000","up_votes":1,"down_votes":0,"body":"Aber es ist wichtig für genug Vision zu sorgen. ;)","replies":[{"poster":"Sylvánas","date":"2017-04-18T20:29:08.788+0000","up_votes":1,"down_votes":0,"body":"stimmt :) aber ich muss mich sowieso noch um einiges verbessern wenn ich climben will :)","replies":[]}]}]}]}]}]},{"poster":"RAG Ryve","date":"2017-04-19T07:37:59.030+0000","up_votes":1,"down_votes":0,"body":"Gut gemeinter Rat. Ich würde mir weniger Sorgen über die Tokens als um den Account machen.\nBei den meisten Spielern kommt der Perma schon durch bevor sie als reformiert gelten. \nIch würde dir raten den Chat gar nicht mehr zu benutzen, maximal für was nettes.\n\nDas mit dem reformiert sein kommt nach einer gewissen Menge an Spielen aber das dauert schon einige Zeit.","replies":[{"poster":"Sylvánas","date":"2017-04-19T08:54:45.281+0000","up_votes":1,"down_votes":1,"body":"Lies bitte die Kommentare, die ich hier geschrieben habe - dann wüsstest du, dass ich das ohnehin tue :)","replies":[]}]},{"poster":"Killerkante","date":"2017-04-18T20:14:06.219+0000","up_votes":1,"down_votes":0,"body":"KDA ist nicht das einzige was in die Wertung mit einfließt, wäre ja auch zu einfach","replies":[]}]}