{"poster":"Magina","date":"2015-12-16T17:05:57.434+0000","title":"Bloqueo de cuenta por \"MMR Boosting\" Equivocado","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":2,"body":"Creo un foro porque me bloquearon la cuenta por &quot;MMR Boosting&quot; y sinceramente nose que es, nunca jugu&eacute; rankeds a otras personas y menos me jugaron a mi, me costo mucho llegar a donde estoy ahora y que me quiten todas las recompensas (marcos, iconos, campeones y pieles...) me bloquean la cuenta por 2 semanas, me parece mucho por algo que nunca hice.                                                                                  \r\nQuiero preguntarle a otras personas que juegan League of legends si alguna ves le ocurri&oacute; esto y como pudieron resolverlo si pudieron.\r\nDesde ya muchas gracias...","replies":[{"poster":"ZeNch","date":"2015-12-16T17:11:56.413+0000","up_votes":4,"down_votes":0,"body":"http://www.lolking.net/summoner/las/1233720#profile\n\nLa grafica de abajo de todo a la derecha muestra como subiste en muy pocos dias... eso es razon de sospecha y ban segun riot... habal directamente con soporte, aquie no te podran ayudar https://support.riotgames.com/hc/es-419\n\npd: yo no te creo...","replies":[{"poster":"KatVay OmegaChan","date":"2015-12-16T17:29:33.960+0000","up_votes":2,"down_votes":0,"body":"Estuvo en Silver desde hace tiempo, DUDO MUCHO que le hayan hecho Elo Boost quiza solo quiso subir para las recompensas y no le gustan las Rankeds. Tambien podes tener razon pero yo le creo! :)","replies":[{"poster":"ZeNch","date":"2015-12-16T17:37:36.022+0000","up_votes":5,"down_votes":0,"body":"si te fijas la grafica extendida siempre sube a fin de año.\n\nIgual riot comprueba IPs y locaciones de la misma sin contar las rutas que toma dicha IP para contactar al server... si no lo hizo con hablar con support se soluciona.\n\nAparte tambien corrobora los hechizos, campeones utilizados si corresponden a los que el ya usaba...\n\nejemplo es muy raro que si alguien usa Flash en la D justo cuando empieza a subir use el flash en la F.\nPasa lo mismo con los campeones si nunca en su vida uso vayne y empieza a subir only vayne...\nNo digo que sea el caso pero la grafica es muy dudosa, que support lo decida, ya le deje el link n.n","replies":[{"poster":"KatVay OmegaChan","date":"2015-12-16T17:40:06.797+0000","up_votes":1,"down_votes":0,"body":"Sisi todo bien, respeto lo que vos decis pero yo por ejemplo siempre uso en flash en la D pero cuando voy jg no puedo usar el flash en la D porque ahi pongo el Smite y jugue toda mi vida asi igual, aveces me pongo el tp en la D y cosas asi, pero puede ser que haya subido asi.\nPD: el tema de la Ip no lo habia pensado +1!","replies":[]}]},{"poster":"Magina","date":"2015-12-17T02:43:02.429+0000","up_votes":1,"down_votes":0,"body":"justamente fue eso lo que paso!! (no soy de jugar rankeds porque siento que pierdo algo mas que solo una partida y queria las recompensas) gracias por entender.","replies":[]}]},{"poster":"Magina","date":"2015-12-17T02:40:58.349+0000","up_votes":1,"down_votes":0,"body":"mira te voy a decir algo no soy de jugar rankeds soy mas de las normals pero queria las recompensas y ademas siempre quise ser oro siempre estoy al borde la temporada me paso igual llegue a plata 1 y no pude subir y en esta logre pasar a oro poniendome las pilas y que me baneen por mmrboosting es injusto ya que lo consegui por mis propios medios jugue yo las rankeds y fijate que no es constante el flujo de victorias van intercaladas victorias y derrotas salgo bien y salgo mal en todas las partidas como cuando te toca un buen team o un mal team si fuera que me hubieran elo boosteado simplemete hubiera salido bien en la gran mayoria y no hubiera costado tanto pasar de plata 2 a oro nu hubiera perdido tantas partidas.. fijate mejor antes de poner cosas como no te creo....","replies":[{"poster":"ZeNch","date":"2015-12-17T02:46:48.830+0000","up_votes":1,"down_votes":0,"body":"x que? es un opinion... no significa que mi opinion sea considerada para algo... habla a soporte solo ellos pueden ayudarte ya te dije.","replies":[]}]},{"poster":"PatrickKane","date":"2015-12-16T21:14:16.496+0000","up_votes":1,"down_votes":0,"body":"No cambió los flashs (http://matchhistory.las.leagueoflegends.com/es/#match-history/LA2/1327780). Lo único sospechoso que veo es que haya jugado más de 30 rankeds en equipo y soloQ seguidas. Yo no tengo ni idea de eso, por que soy nivel 27 y aún no llego a las rankeds.\nEdito: TODAS las partidas que jugo desde mayo son clasificatorias (gran parte con un equipo clasificatorio)\nQuizas esa sea la razón, pero al contrario de como vi en perfiles de elo boosters donde cambia la posición del flash, Perdió muchas partidas además de ganar. Normalmente en los eloboosters las partidas que no jugó el dueño de la cuenta siempre son carreadas y por mucho, mientras acá veo muy pocas carreadas y resultados casi siempre equilibrados.","replies":[{"poster":"Magina","date":"2015-12-17T02:33:38.166+0000","up_votes":1,"down_votes":0,"body":"gracias por entender. No fui elo boosteado simplemente mi vi llegar la temporada encima y tenia muchas ganas de tener las recompensas juegue mas ranked en ese tiempo justamente por eso no soy de juagar muchas rankeds a menos que quiera conseguir algo llegar hasta una meta consegui llegar a oro y ahora me baneean por mmrboosting... mucha bronca","replies":[]}]},{"poster":"LaReinaPingüino","date":"2015-12-16T19:45:23.822+0000","up_votes":1,"down_votes":0,"body":"Y eso mide sólo la mejora en rankeds? \n\nPor ejemplo, yo en las primeras 10 gané 7 partidas (una con Lux mid y las otras con Janna suport) y quedé en plata 2. No jugué esas 10 rankeds bien, llegué al nivel 30 a puro aram y el conocimiento de la grieta que tenia hasta ese momento lo obtuve en youtube y la wikia del lol. Ademas  en mi pc el lol me anda aproximadamente a 15 fps, y a 5 fps en muchas team fights. Seguí jugando un poco de rankeds pero me iba mal, y baje a plata 3. Decidi dejar las rankeds hasta obtener un pc en el que me corra el lol por lo menos a 30 fps en teamfights. Pero he jugado en la grieta, en normales, y he mejorado bastante. y en rankeds solo usé a Jana Lux Tristana y Caitlyn, y creo que una sola vez a Jinx. Cuando dejé las rakeds empecé a usar otros personajes y abandonéna los de antes. Ademas un fin de semana mi papá me prestó su notebook y ahi el lol me andaba a 60 fps fijos e hizo mucho la diferencia, demasiado.\n\nCuando al principio de la temporada empiese a rankear con los personajes que uso ahora en vez de los de antes, y en el pc de mi papá, tambien me quitaran mi marco y mis skins? O no quitan las skins compradas, solo la sivir victoriosa?","replies":[{"poster":"Magina","date":"2015-12-17T02:28:52.780+0000","up_votes":1,"down_votes":0,"body":"las skins compradas no te las pueden sacar seria robar! la sivir victoriosa si lograste tenerla y te pasa lo mismo que a mi te la van a sacar.. la gente no entiende que vos puedas jugar mejor de repente tan solo por tener una mejor pc o mejor equipo para jugar la gente solo piensa mal de todos y dice cosas como que te mereces el baneo y demas... yo era plata 3 subi a hasta plata 2 y estuve como un mes sin jugar ranked cuando me di cuenta que faltaba muy poco para que termine la temporada comenze a jugar ranked probar suerte a ver si podia llegar a oro y lo conseguí.. y acá estoy baneado por mmrboosting asique todo puede pasar. suerte","replies":[]}]}]},{"poster":"Salfate Otaku","date":"2015-12-16T17:39:39.170+0000","up_votes":1,"down_votes":0,"body":"mira te voy a decir y a todos porque te banearon x que en una partida te dijeron eres un orito nomas y tu dijiste no esta es la cuenta de un amigo que ayudo dijiste eso y te la comiste con patatas era para reportarte te lo isieron por orgulloso como la mayoria de algunos asi que bien merecido asi hay menos gente creida y flamer","replies":[{"poster":"LaReinaPingüino","date":"2015-12-16T19:47:38.215+0000","up_votes":1,"down_votes":0,"body":"Y tu como sabes eso?","replies":[{"poster":"Salfate Otaku","date":"2015-12-16T21:10:29.188+0000","up_votes":1,"down_votes":0,"body":"no es la primera persona que le pasa eso y a todos lo que le han pasado han dicho lo mismo :v cuando te banean es por pruebas si no las tienes imagen o algo banean al que lo reporto por acusacion falsa algo tubo que hacer que uno tomo pruebas y las envio :v no te resulta raro huele a que esta ocultando algo no te banean por nada sin pruebas te las piden y no es 1 ves reportado tienen ser varias veces y varias pruebas para te baneen :v","replies":[{"poster":"Magina","date":"2015-12-17T02:22:29.795+0000","up_votes":1,"down_votes":0,"body":"la verdad que no entiendo cual es tu problema pero yo no estoy mintiendo y simplemente subi solo a oro no me subieron, en todo caso subi con amigos jugando en duo pero nunca nadie tubo mi cuenta y la subio eso es mmrboosting. no es necesario meter pua   y tratar mal a la gente hablas de flamer y estoy seguro que vos sos uno de los primeros en insultar en todas las partidas","replies":[{"poster":"Salfate Otaku","date":"2015-12-18T17:35:00.251+0000","up_votes":1,"down_votes":0,"body":"khe :v ? te estoy diciendo simplemente la verdad ese es motivo de baneo","replies":[{"poster":"Magina","date":"2015-12-18T21:00:49.675+0000","up_votes":1,"down_votes":0,"body":"por supuesto que es motivo de baneo el mmrboosting pero yo no soy el caso capo!!","replies":[{"poster":"g3r0g3r0","date":"2015-12-21T18:35:03.790+0000","up_votes":1,"down_votes":0,"body":"no le prestes atencion, se cree la pitonisa de matrix. \nAhora lee la mente y sabe todo.","replies":[]}]}]}]}]}]}]},{"poster":"AUTOCHESS FAN 69","date":"2015-12-19T15:40:55.515+0000","up_votes":1,"down_votes":0,"body":"Yo subí de silver III a Platino IV en 2 semanas durante la preseason, debería preocuparme? {{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"Exit","date":"2015-12-17T17:42:13.384+0000","up_votes":1,"down_votes":0,"body":"te debieron banear permanente","replies":[]},{"poster":"Americans","date":"2015-12-16T17:29:39.708+0000","up_votes":1,"down_votes":0,"body":"Nunca banearon de forma equivocada por eloboost. Y si por \"Pieles\" te referis a skins, las conservas despues del baneo (solo perdes el skin victorioso)","replies":[{"poster":"El CoLo Pa vó","date":"2015-12-16T17:42:48.013+0000","up_votes":1,"down_votes":0,"body":"como que por un baneo se pierden los skins victoriosos? porque? no es algo injusto?","replies":[{"poster":"Americans","date":"2015-12-16T18:27:14.211+0000","up_votes":1,"down_votes":0,"body":"Porque ese skin nunca lo conseguiste vos.","replies":[]},{"poster":"ikhor","date":"2015-12-16T18:07:38.098+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheColoGamer,realm=LAS,application-id=PJAKt7ph,discussion-id=IHtJerW4,comment-id=00010000,timestamp=2015-12-16T17:42:48.013+0000)\n>\n> como que por un baneo se pierden los skins victoriosos? porque? no es algo injusto?\n\nsi te banean por eloboosting es lo más lógico que te saquen los premios que vos no ganaste","replies":[]}]}]}]}