{"poster":"BOT USELESS LANE","date":"2017-01-25T10:26:42.875+0000","title":"Gold 2 Support sucht nach einem Jahr Abstinenz Leute für: DuoQ/Twisted Treeline","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey,\r\n\r\nMein Name ist Verdon, ich komme aus Hamburg und bin Student. Abseits davon bin ich Support Main. Zumindest seit 30 Minuten, aber lasst euch davon bitte nicht abschrecken. Ich spiele schon seit Season 1 und bis Season 5 war ich auch Support Main, dann habe ich teilweise aufgeh&ouml;rt, mich teilweise ausprobiert und bin jetzt wieder zur&uuml;ck zu den Wurzeln gekommen. \r\n\r\nIch war letzte Season Platin und bin diese Season Gold 5 eingestuft worden, habe mich aber schon bis Gold 2 alleine vorgek&auml;mpft. Ich versuche mich in erster Linie zu verbessern und bin dabei bestrebt, jedes Game zu tryharden und zu gewinnen, wobei ich kaum bis &uuml;berhaupt nicht flame wenn ich mal mit jemanden unzufrieden bin, dann mit mir. Ts3 und Skype sowie ein Headset ist nat&uuml;rlich vorhanden!\r\n\r\nWas ich von euch erwarte: \r\nNicht Support Main zu sein... und mindest eine Elo von Gold 5+ zu haben. Die Standardsachen lasse ich mal raus, nicht flamen, nicht absichtlich feeden usw. sollte eigentlich Standard sein. Alter, Geschlecht, Main etc. etc. ist mir egal, hauptsache ihr seid coole Dudes und Dudines.\r\n\r\nIch freue mich auf eure Freundschaftsanfragen, die ihr an &quot;Verdon&quot; schicken k&ouml;nnt. :)","replies":[{"poster":"NGC Polyxena","date":"2017-01-25T12:21:22.662+0000","up_votes":1,"down_votes":0,"body":"Hallöchen Verdon,\n\ndass ein freundlicher, respektvoller Umgang mit seinen Mit- und auch Gegenspielern Standard sein sollte sehen wir genauso. Da wir alle wissen, dass dies jedoch leider in den Matches nicht immer der Fall ist haben wir uns entschlossen eine ü18 Gemeinschaft aufzumachen um einen Zufluchtsort vor genau solchen Flamern & Ragequittern zu kreieren.\n\nUnd da ist sie -> [♣ ƝЄƦƊƧ ƓƠ ƇƛƧƲƛԼ ♣ Ü18 multigaming Community lädt zum Zocken ein ♣](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/eERAnrLZ-oe-i-a-l-oe-a18-multigaming-community-laadt-zum-zocken-ein-oe)\n\nAusgestattet mit einem annehmbaren Regelwerk, jede Menge freundlicher Spieler/innen und aktiven Kommunikationsplattformen ermöglichen wir unseren Mitgliedern eine angenehme Atmosphäre zum Quatschen, Lachen und vor allem zum Zocken!\n\nIch würde mich freuen, wenn du dir unsere Vorstellung Mal ansiehst und dir das Angebot durch den Kopf gehen lässt :) .\n\nLiebe Grüße,\nP0lyxena | Julia","replies":[]}]}