{"poster":"FePa","date":"2016-01-19T00:14:40.455+0000","title":"El problema de las botas :/","subforum":"Charlas Generales","up_votes":2,"down_votes":3,"body":"Las botas en LeagueofLegends han estado desde la beta, y en su conjunto son los objetos menos alterados directamente desde que tengo memoria, sin embargo cada peque&ntilde;os toquesitos que Riot le da, todos pierden la cabeza: todav&iacute;a recuerdo cuando las botas tier1 marcaban tanto la diferencia que se usaban de objeto inicial, prontamente balancearon eso quitando movespeed a las botas y agreg&aacute;ndole a todos los campeones la diferencia.\r\n Las botas tienen la verdad un papel que yo considero absurdo en el sentido que si no las compras en un cierto momento eres una tortuga; &quot;darle velocidad de movimiento al campe&oacute;n&quot;, punto final. Las pasivas son tan mediocres que siempre se llevan al meta las que mas rindan en costo/beneficio cosa de ver el meta actual:      {{item:3009}}  y de repente {{item:3158}} \r\nLas botas entraron por la obligaci&oacute;n de aparentar un moba, no debieran ser un objeto final, pues cuestan a lo maximo 1650, nadie se a preguntado; Y si tuvi&eacute;ramos un espacio mas en la build? \r\n\r\nMi propuesta: Las botas son perfectamente reemplazables, no hacen mas divertido el juego, cuando un campe&oacute;n necesita velocidad extra para sobresalir el jugador buscara maneras QUE NO SON LAS BOTAS!!! para obtenerla (runas, maestr&iacute;as, objetos o sinergias.)\r\n1.- Eliminar las botas, si, y por el water, las pocas pasivas ingeniosas pueden ir en otra parte.\r\n2.- Aclarar la cuantitividad del moviento, te has preguntado; que demonios signifca ese 376 de MS? si el otro corre a 350 en cuanto lo alcanzare? vez... no hay para pensar casi, todo esta en los closeups.\r\n3.- La movilidad puede venir marcada en el tiempo, estamos acostumbrados a movernos lentos en el juego temprano, porque no escalonarla con el nivel por ejemplo?\r\n4.- Los objetos serian mas estrat&eacute;gicos a la hora de elegirlos, agregarles velocidad de movimiento fija a algunos para hacerlos mas atractivos, alguien me puede decir que claridad tiene un objeto que diga +7%MS, acaso estamos con calculadora jugando? la mayor&iacute;a solo nos quedamos con: &quot;creo que con esto andar&eacute; mas r&aacute;pido, soy repro&quot; cuek.\r\n5.- Habr&iacute;a mas espacio para todo, un pink, una build en proceso, los segundos que pierdes en base de la elixir por no llevarla en el bolsillo, etc, etc, etc.\r\n6.- Beneficios indirectos que ahora no se, dragon n&deg;3 mas atractivo por ejemplo.","replies":[{"poster":"JuaNZ7","date":"2016-01-19T00:24:02.238+0000","up_votes":3,"down_votes":0,"body":"El problema es que compras 1 bota, son 1 para cada pie","replies":[]},{"poster":"quityelmejor13","date":"2016-01-19T17:43:54.235+0000","up_votes":1,"down_votes":0,"body":"prefieron q agregen un slot para colocar el pink{{item:2043}}","replies":[]},{"poster":"FePa","date":"2016-01-19T02:53:29.839+0000","up_votes":1,"down_votes":0,"body":"Exacto, pero actualmente la movilidad se traduce en las botas!, y estas no ofrecen eso, no son una carta mas que poder barajar, como daño o utilidad, simplemente es un objeto que tenemos la obligación de comprar, porque así esta planteado dentro del juego.","replies":[]},{"poster":"alop55555","date":"2016-01-19T02:34:24.867+0000","up_votes":1,"down_votes":0,"body":"una de las decisiones difíciles mientras se juega es si se debe priorizar movilidad o daño . Y la respuesta depende mucho del tipo de partida que se está jugando. Tener las botas adecuadas significa salvarse de la muerte o tener una kill más.","replies":[]},{"poster":"FurchiDC","date":"2016-01-19T02:29:12.259+0000","up_votes":1,"down_votes":0,"body":"Deberían poner un espacio para las botas, como los trinkets (baratijas), porque todo el mundo se hace botas.\n\n______________________________________\n> Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]},{"poster":"Novarum14","date":"2016-01-19T02:27:07.088+0000","up_votes":1,"down_votes":0,"body":"No estoy de acuerdo, pero me parece interesante y razonable tu inquietud","replies":[]},{"poster":"FePa","date":"2016-01-19T00:34:50.311+0000","up_votes":1,"down_votes":0,"body":"Es verdad, no planteo este cambio como algo sencillo, ciertamente es extremadamente radical, pero porque cerrarse a mas ideas, un objeto que sea tan exclusivo de velocidad de movimiento que solo le sirva a campeones que dependen el movimiento solucionaría el problema, hay un objeto de supp parecido al antiguo shurelias(ya ni me acuerdo como se escribe) {{item:3069}}  que prácticamente esta obsoleto, podria haber objetos basicos de armados actualmente {{item:3113}}  o {{item:3086}} para ir ganando velocidad tempranamente.","replies":[]},{"poster":"Yrox the Third","date":"2016-01-19T00:24:20.604+0000","up_votes":1,"down_votes":0,"body":"Seria un nerf inmenso a campeones que se benefician con velocidad de movimiento (como Rammus y Hecarim) o los junglas de por si o simplemente los supports y asesinos que hacen roaming, ya que ahora en early no podrian hacer mucho, razon por la que muchos supports se arman primero {{item:3117}} \nSinceramente, no apoyo este cambio.","replies":[]},{"poster":"alhasthor","date":"2016-01-19T00:17:55.618+0000","up_votes":1,"down_votes":0,"body":"emmm, no veo q exista un problema... saludos {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Hell Darking","date":"2016-01-19T00:34:09.629+0000","up_votes":1,"down_votes":1,"body":"Las botas bajaron cuando quitaron el enchart blanco u.u","replies":[]}]}