{"poster":"Zernichterus","date":"2015-02-20T15:26:21.274+0000","title":"Gesucht: Deutscher JUNGLER und TOPLANER für hohes Dia/Master/Challengerteam!","subforum":"Clans & Teams","up_votes":10,"down_votes":10,"body":"**Hallo liebe LOL-Community!**\n\n\nWir sind auf der Suche nach einem fähigen Jungler und Toplaner für unser 5on5 Ranked Team!\n\n\n**Details:**\n\nDrei der Spieler haben lange Zeit in Season 4 mit ihrem Team im Challengerbracket verbracht und sind dann leider kurz vor Seasonende in die Masterleague gedroppt wegen Inaktivität, da der Jungler aufgrund privater Veränderungen einige Wochen vor Seasonende aufgehört hat zu spielen.\nDiese 3 Spieler haben sich nun dazu entschlossen diese Season ordentlich durchzustarten und suchen daher noch kräftige Verstärkung für ihr Team.\n\n\n**Was bieten wir:**\n\n-drei bereits aufeinander abgestimmte Spieler die sowohl menschlich als auch spielerisch gut miteinander zurecht kommen\n-die richtige Einstellung (genügend Motivation und Ehrgeiz um sich stetig zu verbessern und um eventuell professionelles Niveau zu erreichen)\n-regelmäßiges Spielen und Trainieren (nach einem gut eingeteiltem den Spielern individuell angepassten Trainigsplan)\n-permanente Analysen und Coaching von teamexternen Personen\n-eventuelles Sponsoring/Untersützungen (natürlich nur verbunden mit dem entsprechenden Erfolg -> ohne Fleiß/Ergebnisse kein Preis)\n\n\n**Was fordern wir:**\n\n-Spieler mit ausreichend Freizeit und den richtigen Anlagen\n-eine Mindestelo von Dia 3 (Warum nicht höher? Besser ein Spieler mit niedrigerer Elo der sich stetig verbessern will, als ein Master/Challengerspieler, der     glaubt er sei unfehlbar. ->alles bereits erlebt)\n-Kritikfähigkeit (essentiell um sich überhaupt verbessern zu können)\n-soziale Kompetenz (es ist und bleibt ein Teamgame und auch wenn man manchmal den Eindruck verlieren sollte, dieses Game spielen Menschen gemeinsam)\n-Ehrgeiz und Fleiß (sich immer verbessern wollen und gleichzeitig auch den Willen haben permanent zu üben)\n\n\n**Wie erreicht ihr uns:**\n\n-einfach ingame \"Zernichterus\" adden und  anschreiben\n-oder einfach hier im Thread eurer seriöses Interesse äußern und wir melden uns bei euch!\n\nWir freuen uns darauf von euch zu hören.\n\nmit freundlichen Grüßen","replies":[{"poster":"THC Ðreamer","date":"2015-02-20T15:57:00.019+0000","up_votes":2,"down_votes":4,"body":"Hey bin zwar nur Plat 4 aber ahb diese season nciht so viel soloq gespielt, aber ich weiß das ich höheres Niveau spielen kann.\nIch ahb einen großen champpool bin 18 Jahre alt und sehr motiviert mich individuell zu verbessern.\nIch würde gerne mal ein Tryout machen, um meine Fähigkeiten unter Beweis zu stellen, falls interessiert:\nAdd me.\nchamppool fast alle meta champs:\nMaokai, Irelia, Lissandra, Rumble, Kassadin, Gnar und Renekton.","replies":[{"poster":"Zernichterus","date":"2015-02-20T16:48:27.158+0000","up_votes":3,"down_votes":0,"body":"Hallo THC DREAMER,\n\nich glaube dir gerne, dass du ein Steigerungspotential hast und ausreichend motiviert bist.\nWir werden dennoch bei unseren Mindestanforderungen bleiben und die sind leider nun einmal deutlich höher was die Soloqelo betrifft.\nDu kannst gerne deine Verbesserungsfähigkeit nutzen und dich in der Soloq steigern.\nDann kannst du dich gerne wieder bei uns melden.\n\nDanke für dein Interesse\n\nfreundliche Grüße","replies":[]}]},{"poster":"breitii","date":"2015-02-21T00:27:47.743+0000","up_votes":2,"down_votes":0,"body":"Hey, ich spreche hier aus der Sicht 2er sowohl ingame als auch reallife mates. \n Ingame name: breitii\n ingame name 2: pauzii\nWir beide sind sehr Teamranked begeisterte Spieler und suchen nach einem Team. Wir haben sehr viel Teamerfahrung und bis jetzt auch größtenteils Teamranekd gespielt. Wir sind mit unserem derzeitigem Team Diamant 4 und haben bereits gegen professionelle Teams erfahrung, nicht nur in dieser, auch in letzter Season. \nIch (breitii) spiele toplane als main position und spiele alle Toplaner. Manche besser, manche weniger gut, aber mein Favorit ist Lulu und Lissandra.\npauzii spielt jungle main und kann besonders gut Vi, Lee sin, Nidalee, Wukong, Jarvan, Amumu und viele mehr. (ich will jetzt nichts falsches behaupten ^^) \nWir spielen beide diese positionen seit anfang der season 4. Wir haben sehr gutes Teamplay, da wir ohnehin so ziemlich jedes game zusammen spielen. \nSolo q:\nbreitii S4: Diamant, Momentan: Platin 3\npauzii S4: Diamant, Momentan: Platin 1","replies":[{"poster":"Zernichterus","date":"2015-02-21T16:05:07.475+0000","up_votes":2,"down_votes":0,"body":"Danke für dein/euer Interesse. Näheres besprechen wir direkt ingame und über Teamspeak.","replies":[]}]},{"poster":"Zernichterus","date":"2015-02-23T19:02:17.042+0000","up_votes":1,"down_votes":0,"body":"Danke für die zahlreichen Rückmeldungen/Interessenten!\n\nWir testen bereits die ersten Spieler, freuen uns aber über jede weitere Option.\nAlso meldet euch weiterhin.","replies":[]},{"poster":"nîze","date":"2015-02-21T09:42:25.344+0000","up_votes":1,"down_votes":3,"body":"Hey Zernichterus,\n\nfalls du möchtest, dann kannst du  \" Kléinmoro \" mal adden. Das Zeug dazu hätte er aber ob er es möchte ist ne andere Frage. Am besten du klärst es mit Ihn Persöhnlich.","replies":[{"poster":"Zernichterus","date":"2015-02-21T16:15:56.749+0000","up_votes":2,"down_votes":0,"body":"Danke, dass du uns bei unserer Suche behilflich sein möchtest, aber wann dann muss sich die Person aus freien Stücken und Eigenmotivation heraus bei uns melden.  Das soll keineswegs zu arrogant klingen, aber ich denke nicht, dass wir es nötig haben bei Spielern betteln zu gehen, welche uns dann getrost die kalte Schulter zeigen. \nWenn ein Spieler nicht selbst die Motivation dazu hat sich seinen Möglichkeiten entsprechend umzusehen, dann bringt er sowieso die falsche Einstellung für uns mit.\n\nDanke trotzdem.\n\nmfG","replies":[]}]}]}