{"poster":"LagFiles","date":"2018-02-23T14:42:07.111+0000","title":"Suspensión a Facundo Calabró","subforum":"Esports","embed":{"description":"Riot Games sancionó al manager de Isurus Gaming, Facundo \"Kala\" Calabró por tres meses. En este video analizamos la sanción, sus motivos y otros episodios donde managers incurrieron en irregularidades y no fueron suspendidos. Twitter: @kevoesports Patreon: patreon.com/kevoesports","url":"https://www.youtube.com/watch?v=eV5rO2_545I","image":"https://i.ytimg.com/vi/eV5rO2_545I/hqdefault.jpg"},"up_votes":10,"down_votes":3,"body":"Hice un an&aacute;lisis en torno a la sanci&oacute;n a Facundo &quot;Kala&quot; Calabr&oacute;, manager de Isurus Gaming, donde lo suspendieron por tres meses como manager de ISG en su escuadra de LoL.\r\nLa sanci&oacute;n, los motivos y otros episodios donde managers obraron de mala manera y no fueron sancionados por Riot Games.","replies":[{"poster":"Nutria Deliciosa","date":"2018-02-23T15:21:16.240+0000","up_votes":1,"down_votes":0,"body":"Es pariente de Iliana y Marina Calabro?","replies":[{"poster":"LagFiles","date":"2018-02-23T15:26:21.995+0000","up_votes":1,"down_votes":0,"body":"Es una duda que siempre tuve presente, pero entiendo que no. Habría que preguntarle.","replies":[{"poster":"Nutria Deliciosa","date":"2018-02-23T15:41:48.216+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=LagFiles,realm=LAS,application-id=Ky2nrTjR,discussion-id=mwyAFEFJ,comment-id=00010000,timestamp=2018-02-23T15:26:21.995+0000)\n>\n> Es una duda que siempre tuve presente, pero entiendo que no. Habría que preguntarle.\n\nMuy bueno el video y me suscribo a el canal. Se nota la profesionalidad.","replies":[]}]}]},{"poster":"LeonardoSB","date":"2018-02-23T15:29:00.475+0000","up_votes":2,"down_votes":3,"body":"buenas, primero que nada quiero decir: \"se escucha muy bajo salu2\".\nsegundo: loco que puto asco que son las gaming house, todas las que he visto de las tienen una limpieza horrible ni hablar de alimentación.\n\ntercero y ultimo: la verdad es que le sacaron el sueldo a los equipos para poderse afanar mas guita los de riot las salu2.","replies":[{"poster":"LagFiles","date":"2018-02-23T15:53:48.511+0000","up_votes":3,"down_votes":0,"body":"Jajajaja me encantó el toque del \"salu2\"\nSobre tu segundo punto si, yo no salía de mi asombro de ver todo hecho una porquería, la única casa que tenía todo ordenado en el momento en cual viaje era KLG que tenía a Bekindra (quien ahora esta en Isurus) e hizo un excelente trabajo con los chicos de compañerismo y de cuidado entre ellos mismos, lo cual significa también cuidar la casa.","replies":[{"poster":"LeonardoSB","date":"2018-02-23T16:25:38.444+0000","up_votes":1,"down_votes":1,"body":"es que yo he visto por youtube mas que nada tours por gaming house y onda intentan lucir \"ordenadas\" onda para la entrevista pero despues ves que de un cajon sale una bolsa, o un carton de pizza de los que compras por porcion viste...\n\nno sé bldo yo llega un punto que en mi habitacion no aguanto mas la mugre, pero te imaginas el olor que debe haber ahi...\n\naparte fijate que en el video del coach de NA muestran bolsas de puros alimentos chatarra como pizza, hamburguesa, papas fritas, etc.\n\nnunca cascaras de huevos o rodajas de tomates (onda yo les corto las puntas que es la parte mas dura que no es comestible) , o un pedazo de zapallo.,..osea no sé me da asco el solo pensar jugar para un team y que esa sea la gaming house, me la pasaria mas limpiando que otra cosa...y cagandome a puteadas para el que deje algo tirado.\n\nencima sabes el olor que levanta toda esa porqueria bldo? injugable.","replies":[]}]}]},{"poster":"Bienzahar","date":"2018-02-23T15:03:06.647+0000","up_votes":2,"down_votes":0,"body":"Se escucha bajito?","replies":[{"poster":"LagFiles","date":"2018-02-23T15:11:32.833+0000","up_votes":1,"down_votes":0,"body":"Puede ser que se escuche mas bajo que otros videos, tuve problemas con la placa de audio {{sticker:sg-shisa}}","replies":[]},{"poster":"2801","date":"2018-02-23T15:10:31.753+0000","up_votes":1,"down_votes":2,"body":"No, yo lo escucho bien por ahora :P","replies":[]}]}]}