{"poster":"Gergerman10","date":"2015-10-28T20:12:39.044+0000","title":"Ich brauche Hilfe und eine Entscheidung :)","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Guten Tag!\r\n\r\nIch m&ouml;chte mit diesem Thread / dieser Diskussion eigentlich nur explizit Hilfe eines Riot-Mitarbeiters anfordern. Ich m&ouml;chte hier nicht gleich mit den ganzen Membern reden, sondern nur einen Wunsch &auml;u&szlig;ern. Unter 2 Augen sozusagen. Ich wei&szlig;, man muss eigentlich den Support direkt und anders anschreiben, aber das ist mir erst einmal egal, denn ich m&ouml;chte keine professionell oder gut und durch viel Besch&auml;ftigung beantworteten Vorschlag abgeben. Ich m&ouml;chte einmal eine menschliche Diskussion, ohne irgendwelche Vorschriften die ich normalerweise einhalten muss. \r\nIch w&uuml;rde gerne mit einem Riot-Mitglied chatten. Wo, ist mir egal. Skype, beispielsweise.\r\n\r\nPS: Das w&uuml;nsche ich mir","replies":[{"poster":"legofreak1","date":"2015-10-28T20:14:27.848+0000","up_votes":1,"down_votes":0,"body":"Du kannst versuchen RIOTer im Client anzuschreiben, wenn du Glück hast, antwortet dieser, ansonsten geht dein Weg über den [Support](http://support.leagueoflegends.com/).","replies":[{"poster":"Gergerman10","date":"2015-10-28T20:16:33.546+0000","up_votes":1,"down_votes":0,"body":"Was genau meinst du mit Client? Und wie genau ginge das ?","replies":[{"poster":"Gergerman10","date":"2015-10-28T20:20:47.843+0000","up_votes":1,"down_votes":0,"body":"Achso, du meinst ich sollte im Spiel nen Riot Mitarbeiter anschreiben? \n\nMache ich nur, sofern ich hier keine Antwort erhalten sollte von Riot.\nAber ich denke, ich bekomme eine, weil ich Riot nicht anders kenne","replies":[{"poster":"Ashuna","date":"2015-10-29T11:39:45.313+0000","up_votes":2,"down_votes":0,"body":">ich bekomme eine, weil ich Riot nicht anders kenne\n\nDie Riot Leute befinden sich relativ wenig im Forum. Sie haben einfach besseres zu tun. Die Emis sind eine Schnittstelle zwischen Community und Riot. Sofern du nicht viel Glück hast, wirst du wohl nicht mit einem Riotler schreiben können.\n\nmfg Ashuna {{champion:1}}","replies":[]}]}]}]}]}