{"poster":"Raikiribreak","date":"2015-12-02T19:45:30.530+0000","title":"Vorstellung des neuen Champs Cedar","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Hallo liebe Community ich w&uuml;rde euch gerne meinen Champion vorstellen.\n\nSein Name ist Cedar.\n\nGeschichte:\n\nIn einem immer w&auml;hrenden Krieg zwischen dem K&ouml;nigreich des Feuers und des Eises \nwerden viele Krieger eingesetzt um das verlangen seines K&ouml;nigs zu stillen mit nur ein paar dingen\nMacht,Blut und Reichtum einige Krieger werden f&uuml;r ihre Taten belohnt andere bestraft\nder Weg der bleibenden Ehre geb&uuml;hrt nur denen die dem K&ouml;nig die anspr&uuml;che gew&auml;hren\nHier kommt Cedar in&acute;s Spiel ein Gro&szlig; gebauter Krieger mit einer R&uuml;stung aus Puren Eis\nund mit dem Schwert des Besch&uuml;tzers bewaffnet der Name des Schwertes lautet\nFiredisplacer.\nSchon oft rettete unser W&auml;chter seinem K&ouml;nig der an vorderster Front mitk&auml;mpfte\ndas Leben und wurde daf&uuml;r belohnt. So siegte das K&ouml;nigreich des Eises immer\nund immer wieder gegen das Reich des Feuers, doch auch die kleinste Glut kann\neinen gro&szlig;en Brand verursachen und so war es auch, als sich das K&ouml;nigreich des Eises\nals Sieger sah und dies auch feierte kam es zu einer gro&szlig;en Katastrophe. Rie&szlig;ige Feuerdrachen\ngriffen das Herz des K&ouml;nigreich&acute;s an und in einem Moment war alles was eis war nur noch Asche \ndenn nicht mal das Eis hatte die Chance zu schmelzen und aus dem Eis K&ouml;nigreich wurde\nein schwarzes &Ouml;dland. Der Restliche Stolz des Eisk&ouml;nigreiches liegt nun in Cedar&acute;s H&auml;nden\ner Gr&uuml;ndete einen Orden der schwor sich nie aufzugeben und nie zu ruhen ehe die letzte Flamme\nerloschen ist.\n\nAttribute:\n\nSpezialisierung: Tank/Bruiser\n\nLeben: 600 - 2573\n\nLebensreg: 8.5 - 24.3\n\nMana: Keine\n\nReichweite: 220\n\nAngriffsschaden: 65 - 180\n\nAngriffsgeschwindigkeit: 0.680 (+0 - 14%)\n\nR&uuml;stung: 33 - 95\n\nMagieresistenz: 35 - 90\n\nLauftempo: 310.5\n\nSkills:\n\nPassive: In der unteren Leiste wo die Mana sein sollte ist die Macht des Eises:\n\nPassive [Name]: -340°C\n\nPassive [Effekt]: Automatische Angriffe verlangsamen das Getroffene Ziel trifft man das Ziel 3 mal in Folge\nso wird dieser in den unter 0 Zustand gesetzt erl&auml;uterung: Unter 0 Zustand verlangsamt den gegner um ein vielfaches\ntrifft der Anwender das Ziel 5 mal in Folge so wird dieser in den unter -340°C Zustand gesetzt erl&auml;uterung: Unter 340°C\nbet&auml;ubt den Gegner und l&auml;sst ihn an Ort und Stelle zu einer Eisstatue erstarren der n&auml;chste Schlag des Anwenders\nzerschellt das Eis wodurch der Gegner massiven schaden erleidet.\n\nSlow stats: Slow 35/38/40/43/50%\n\n                     Dauer 1/1.5/2.5/2.8/3\n\nDa dieser Champ keine Mana besitzt sondern Die Macht des Eises wird die Macht st&auml;rker jeh mehr gegner mit der Passive befallen sind\nsind alle gegner mindestens 1 mal getroffen worden ist die Macht auf dem Maximum wodurch die F&auml;higkeiten W und R verst&auml;rkt werden.\nOder aber auch ein Gegner ist mehrmals makiert so steigert sich die macht auch wieder doch das Maximum bleibt gleich.\n\nWenn der Getroffene Gegner nach 15 Sekunden nicht noch einmal getroffen wird dann erlischt der Effekt von -340°C\n\nQ: Schlund des Eises\n\nDer Anwender Schl&auml;gt mit seinem Schwert auf den Boden wodurch dieser zerspringt und sich ein gro&szlig;er Eisschlund vor ihm bildet\nGegner die in dem Schlund stehen werden zu dem Anwender gezogen.\n\nGegner die von dem Schwert getroffen werden wenn der Skill aktiviert wird bekommen massiven schaden.\n\nStats:\n\nPhysikalischer Schaden [Schlund]: 30/85/90/110/150 (+ 40% v. zus&auml;tzlichen Angriffsschaden)\n\nMagischer Schaden [Schlund]: 15/30/35/38/45(+ 15% v. der F&auml;higkeitsst&auml;rke)\n\n\nPhysikalischer Schaden [Schwert]: 110/145/160/176/200 (+ 4% von Cedar&acute;s maximalen Lebens)\n\nMagischer Schaden [Schwert]: ----------------------------------\n\nAbklingzeiten: 18/17/16/15/14 Sekunden\n\n\n\n\n\nW: Innerer Pfad\n\nACHTUNG DIESER SKILL IST EINE EVOLUTION!!!!\n\nAnwender muss sich entscheiden ob die Angriffs- oder die Verteidigungskraft gest&auml;rkt werden soll.\n\nBleibt dauerhaft Skaliert mit der Gesammelten Macht des Eises\n\nStats:\n\nAngriffskraft:\n\nPhysikalischer Schaden: +50/+55/+60/+65/+70 (+ die gesammelte Macht des Eises maximal 340) (1 Ziel =68)(2 Ziele = 136)(3 Ziele = 204)(4 Ziele = 272)(5 Ziele = 340)\n\nDie Macht verteilt bei Folgenden Leistungen diese Werte:\n\n1. Ziel/Makierung= 68 Macht wird 20 Absoluterschaden dazu addiert\n\n2. Ziele/Makierungen= 136 Macht wird 35 Absolutenschaden dazu addiert\n\n3. Ziele/Makierungen= 204 Macht wird 50 Absolutenschaden dazu addiert\n\n4. Ziele/Makierungen= 272 Macht wird 65 Absoluterschaden dazu addiert\n\n5. Ziele/Makierungen= 340 Macht wird 100 Absolutenschaden dazu addiert\n\n\nVerteidigungskraft:\n\nR&uuml;stung/Magieresistenz: +30/+33/+37/+40/+50 (+ die gesammelte Macht des Eises maximal 340) (1 Ziel =+68)(2 Ziele = 136)(3 Ziele = 204)(4 Ziele = 272)(5 Ziele = 340)\n\nFolgende Werte werden bei der bestimmten Anzahl der Macht gewährt:\n\n1. Ziel/Makierung= 68 Macht wird eingehender Schaden von Minnions um 50% Reduziert.\n\n2. Ziele/Makierungen= 136 Macht werden alle 3 Sekunden 10% seiner MAX HP geheilt.\n\n3. Ziele/Makierungen= 204 Macht werden die Rüstungs und Magieresi Werte um weitere 30 Punkte erhöht.\n\n4. Ziele/Makierungen= 272 Macht werden eingehende effekte von Gegnern um 25% abgeschwächt\n\n5. Ziele/Makierungen= 340 Macht. Sind die HP des Anwenders unter 25% so regeneriert er 35% des Schadens den er in den letzten 10 Sekunden erlitten hat. Besitzt der Anwender über 25% Max HP so regeneriert er 10% seines ausgeteilten Schadens in den letzten 10 sekunden als Hp wieder.\n\nAbklingzeiten: -----------------\n\n\n\nE: Fliegende Trag&ouml;die\n\nAnwender wirft sein Schwert geradeaus nach vorne getroffene Gegner werden verkr&uuml;ppelt. Und das Schwert steckt jeh nach Slow dauer auch solange im Gegner Slow stärke werden jeh nach dauer schwächer denn das Schwert schmilzt weg.\n\nDer Anwender muss für die nächsten 5 sekunden mit Fäusten kämpfen und hat so weniger Reichweite. zudem hat er weniger Angriffsschaden.\nReichweite mit Fäusten: 125\n\nAngriffsschaden: 50% des Aktuellen Schadens\n\nStats:\n\nPhysikalischer Schaden: 100/130/180/210/240 (+ 8% seines maximalen Lebens)\n\nMagischen Schaden: ---------------------------------------------\n\nAbklingzeiten: 25/20/18/15/14 Der Anwender generiert nach benutzen des Skills jeh nach CD in einer ausgeglichenen Geschwindigkeit sein Schwert so dass es etwas epischer aussieht bis er sein Schwert wieder hält.\n\nR: Blizzardcrush\n\nAnwender erschafft um sich herum (Kreisform) einen Schlund aus Eis. Gegner die sich darin befinden werden an den Anwender herangezogen. Der Anwender an sich rastet total aus und schl&auml;gt zuerst in einer Kreisform um sich danach schl&auml;gt er 5-10 mal um sich mit dem Schwert Gegner die getroffen werden bekommen massiven Schaden und werden verlangsamt.\n\nStats: \n\nPhysikalischer Schaden: 100/120/150/195/214 bei Z&uuml;ndung\n\nPhysikalischer Schaden [Schwert]: Pro treffer 100 (+ 4% seines maximalen Lebens)(+ h&ouml;he seiner Macht maximal 340) (1 Ziel =+68)(2 Ziele = 136)(3 Ziele = 204)(4 Ziele = 272)(5 Ziele = 340)\n\nFolgende Werte werden gewährt bei bestimmter Anzahl der Machtpunkte\n\n1. Ziel/Makierung= 68 Macht -----\n\n2. Ziele/Makierungen= 136 Macht Die Rüstung und Magieresi der Gegner wird um 5% gesenkt\n\n3. Ziele/Makierungen= 204 Macht Zum Schaden jedes Treffers während des Ultimativen Moduses werden 2% seines MAX Lebens als Schaden dazu addiert\n\n4. Ziele/Makierungen= 272 Macht Gegner im Schlund werden um 50% verlangsamt und das solange sie sich darin befinden [ULTI RADIUS]\n\n5. Ziele/Makierungen= 340 Macht Jeder dritte Schlag der Ultimativen Fähigkeit wird als 150 Absolutenschaden dem Ziel zugefügt.\n\nAbklingzeiten: 150/140/135/133/125 Sekunden\n\nSEHR WICHTIG!!!!:\n\nMakierungen bzw. Getroffene Ziele die diese Macht Boost´s dem Champion Cedar gewähren werden nicht Kumulativ wirken sondern jeh nach Macht Status wird dieser Effekt aktiviert. Auf gut deutsch so erklärt\n\n1. Ziel/Makierung=68 Macht gibt nur die Effekte von diesem Macht Status\n\n2. Ziele/Makierungen= 136 Macht gibt nur die Effekte von diesem Macht Status der des vorherigen Statuses wird aufgehoben.\n\nUnd das immer so weiter bis zum Maximum\n\nES WERDEN NUR DIE EFFEKTE AUSGELÖST AUF DER JEHWEILIGEN MACHTSTUFE VORHERIGE WERDEN AUFGEHOBEN\n\nHoffe dass, das jetzt jeder verstanden hat.\n\nSo das waren die Stats und Skills da es meine erste Championvorstellung ist ist einiges bestimmt &uuml;bertrieben daher brauch ich die Community\n\nKommen wir nun zum letzten Teil der Vorstellung\n\nAussehen und animationen: \n\n\nEr sieht aus wie der Rampart Golem in Dark Souls 2 scholar of the first sin blo&szlig; das er keine Lanze und kein Schild tr&auml;gt sondern ein \nUltra Gro&szlig;schwert das er hinter sich her schleift.\n\nhttp://img1.wikia.nocookie.net/__cb20141222131010/darksouls/images/8/87/15450613123_c464480cbd_o.jpg\n\nDas ist der Link zum Bild\n\nGehbewegung: Langsame Schritte mit einem erschreckenden R&uuml;stungsrascheln\n\nSpr&uuml;che:\n\nGehen:\n\nDie Zeit ist gekommen\n\nKeiner entkommt der ewigen K&auml;lte\n\nF&uuml;r das Reich des Eises\n\nTod allen Wiedersachern\n\nIn die Schlacht\n\n\n\nAngriff:\n\nNun werdet eins mit dem Tod\n\nZerspringt wie Glas\n\nNichts kann meine Macht stoppen\n\nDer Tod ist ewig genau wie das Eis\n\nW: Angriffsskallierung = Lasst den Sturm nicht Enden\n\nW: Verteidigungsskallierung = Kalt wie Eis Hart wie ein Diamant\n\nR: Aktivierung: (W&uuml;tender Schrei)\n\nJoke:\n\nFrauen stehen auf Coole Männer ich lass sie einfrieren\n\nPraktisch k&ouml;nnte ich ohne Kosten mein Getr&auml;nk K&uuml;hlen hehehehe\n\nHoHoHo hier kommt die Eisesk&auml;lte\n\nTaunt:\n\nDu bist bereits Geschichte\n\nNichtmal der Schlund des Eises m&ouml;chte dich verschlingen \n\nWärm dich nochmal auf denn hier kommt die Kälte\n\nDance:\n\nEr rammt sein Schwert in den Boden und Tanzt Slowmotion\n\nTipps:  \n\n\nMit den Champion Spielen:\n\nVersuche so viele Gegner wie m&ouml;glich zu makieren um deine Macht zu steigern\n\nSetze deine F&auml;higkeiten mit Bedacht ein der Cooldown ist hoch\n\nVersuche deine Angriffe mit deinem Team Abzustimmen damit du soviel Schaden dr&uuml;cken kannst wie m&ouml;glich\n\nDeine Automatischen Angriffe sind sehr langsam daf&uuml;r besitzen sie extrem hohen Schaden und eine krasse Reichweite\n\n\n\nGegen den Champion Spielen:\n\nCedar&acute;s Automatische Angriffe sind langsam weiche aus oder versuche ihm so viel Schaden zu dr&uuml;cken wie m&ouml;glich\n\nSeine Skills besitzen sehr hohen Cooldown warte ab bis er die skills einsetzt um danach ihn einen Konter zu verpassen\n\nLass dich am besten nicht makieren um seine Macht gering zu halten\n\nDa er nicht der schnellste im Spiel ist k&ouml;nnte man mit Skill leicht abbhauen\n\n\nSo das wars von mir hoffe die Vorstellung hat euch gefallen verbesserungen, bitte kein Geflame oder sonstigen unn&ouml;tigen M&uuml;ll das ist meine Erste Champion vorstellung also seint etwas sanftm&uuml;tig \n\nLG Raikiribreak\n\n{{sticker:slayer-jinx-wink}}    \n\n\nLove JINX &lt;3","replies":[{"poster":"One Inch","date":"2015-12-03T08:58:13.442+0000","up_votes":1,"down_votes":0,"body":"Hallo.\n\nIch habe mir mal deinen Champion durchgelesen und finde die Idee nicht schlecht, jedoch sind seine Stats viel zu stark.\n\n[**Basis Stats:**]\n• Leben: ✔\n• Lebensreg.: ✔\n• Reichweite: viel zu hoch. 150 - 175 ist meistens die Reichweite für Nahkämpfer.\n• Angriffsschaden (Lv. 1): zu hoch. Der höchste AD Wert Lv. 1 ist 63 AD und gleich einen Tank mit 80 AD auf Lv. 1 zu geben, ist etwas übertrieben.\n• Angriffsschaden (Lv. 18): viel, viel, viel zu hoch. Ein Tank der ohne AD Items auf 233 AD kommt ist ein bissle übertrieben (der höchste AD Wert auf Lv. 18 ist 146).\n• Angriffstempo: 0.250 ist viel zu langsam und würde die Laning Phase für den Champ zur Hölle machen. Hier solltest du wirklich überlegen mit einer 0.600 - 0.650 zugehen (und die Idee mit kein zusätzlichen AS verwerfen und ihm stattdessen eine niedrige AS per Lv. geben).\n• Rüstung (Lv. 1): 50 ist für Lv. 1 zu viel. Runen und Masteries mit einberechnet hätte er viel zu viel Rüstung.\n• Rüstung (Lv. 18): 121 ist ein kleines bissle zu viel. ~100 Rüstung reicht als Basis auf Lv. 18, da er als Tank sich sowieso Rüstung kaufen wird.\n• Magieres. (Lv. 1): 50 ist auch ein wenig zu viel _(siehe Rüstung (Lv. 1)_)\n• Magieres. (Lv. 18):  121 ist auch viel zu viel. Der Grundwert auf Lv. 18 sollte jedoch niedriger als die Rüstung seien, sonst wird er wirklich unkillbar.\n• Lauftempo: 285 ist zu wenig. Du wirst viel zu einfach gekited. 325 - 335 sollte am besten sein, um ihn nicht zum Kite-Opfer werden zulassen.\n\n[**Passive: Bis unter -340°**]\n• 1te Passive: wie stark ist die Verlangsamung nach 3 Schlägen? Die Verlangsamung sollte hierbei nicht zu hoch sein. (20%/30%/40%/50% @ 1/6/11/16 wäre ein Vorschlag, um den CC am Anfang noch unten zuhalten, aber dafür im Late richtig reinhauen).\n• 2te Passive: hier sollte lieber nur die Betäubung sein und evtl. einen Debuff geben, womit der Anwender Bonusschaden für die nächsten Sekunde am Ziel macht (ähnlich wie Braum nach seinen 4 Stacks). Ein Einfrieren des Gegners hört sich stark nach Hard CC an und sollte nicht in die Passive rein (vorallem da keine Freeze-Dauer angegeben wurde).\n• Anmerkung: evtl. im Namen das \"Bis unter\" entfernen und es einfach nur \"-340°\" nennen.\n\n[**Q: Schlund des Eises**]\n• Schlund: den physischen Schaden weglassen und nur den magischen Schaden behalten, da das Schwert nur physischen Schaden macht gleichst du es schon aus.\n• Schlund: den magischen Schaden pro Punkt in der Fähigkeit besser skalieren lassen. 80/130/180/230/280 (pro Punkt in der Fähigkeit sollte dieser immer um den gleichen Wert erhöht werden).\n• Schlund: Der Schaden sollte nicht mit AP skalieren, sondern mit AD (siehe Vorschlag für _W: Innerer Pfad_ an).\n• Schwert: den physischen Schaden pro Punkt in der Fähigkeit besser skalieren lassen.\n• Abklingzeit: keine statische CD. 15/14/13/12/11 CD könntest du zB. nehmen.\n\n[**W: Innerer Pfad**]\n• Anmerkung: Die Idee selbst ist gut, jedoch sind die Werte viel zu übertrieben.\n• Anmerkung: Die Fähigkeit \"Toggle\"-bar machen (ähnlich Aatrox W: Blood Thirst / Blood Price)\n• Passive: Die Passive Fähigkeit sollte sich hier nicht einmischen, macht die Fähigkeit einfach nur zu stark.\n• AD: 30/35/40/45/50 sollten ihm vollkommen genügend, dafür kannst du zB. die Q Fähigkeit eine Total AD Skalierung geben, anstatt Bonus AD.\n• Resistenz: 20/25/30/35/40 und dafür steigt die Magieresistenz um die Häfte des Wertes (10/12.5/15/17.5/20).\n• Abklingzeit: 1 - 2 Sekunden CD nach dem Wechseln.\n\n[**E: Fliegende Tragödie**]\n• Skalierung: Skalierung der Fähigkeit wieder anpassen (100/150/200/250/300) und dafür nur 4% des max. HP.\n• Wiederherstellung des Armes: es ist keine gute Idee die CD durch eine zweite CD zu verlängern.\n• Abklingzeit: 25/22.5/20/17.5/15 Sekunden (Wachstum des Schwertes mit einbezogen).\n\n[**R: Dezimieren**]\n• Skalierung mit Macht: Die Skalierung des Bonusschaden durch die Macht solltest du anpassen, diese ist etwas zu übertrieben.\n• Initialschaden: Der Basisschaden pro Punkt in der Fähigkeit hast du mit 5 Werten ausgelegt (Ultis haben meist nur 3 Werte).\n• Abklingzeit: Lv. 1 (180 Sekunden) ; Lv. 2 (150 Sekunden) ; Lv. 3 (120 Sekunden)\n• Anmerkung: Diese Fähigkeit solltest du vom DMG balancieren. Ein kleines Beispiel (mit deinen akt. Werten):\n\nR: Dezimieren ist auf max. Stufe und hat einen Initalschaden von 300.\nCedar hat akt. eine max. HP von ~3000 und trifft die Fähigkeit auf alle 5 Gegner.\nCedar hat auch volle Macht und greift die Gegner 10x an.\n\nFormel: 300 + 10 ( 5 ( 100 + ( 3000 * 4% ) + 340 ) ) = 28.300\n\nCedar würde auf 5 Gegner 28.300 DMG austeilen und um das zu überleben müsste jeder Gegner im Durchschnitt mehr als 5.7k Leben haben.\n(Anmerkung: Bin mir jetzt nicht sicher ob die Formel stimmen kann, da ich die Erklärung der Fähigkeit so verstanden habe)\n\n[**Anmerkungen von mir**]\nIch hoffe die \"kleinen\" Bemerkungen von mir können dir etwas helfen.\n\n\nLG Melo.","replies":[{"poster":"Raikiribreak","date":"2015-12-03T11:10:14.334+0000","up_votes":1,"down_votes":0,"body":"Vielen dank dann werde ich das schnell anpassen wir können das auch zusammen machen skype Name geb ich dir wenn ich zuhause bin und du ihn auch möchtest","replies":[{"poster":"One Inch","date":"2015-12-03T16:58:05.017+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir gerne helfen, wenn du möchtest.","replies":[{"poster":"Raikiribreak","date":"2015-12-03T19:22:54.018+0000","up_votes":1,"down_votes":0,"body":"ja für den nächsten champ den ich vlt. am samstag machen werde kannst gerne mitmachen so wie ich dein feedback gelesen hab und auch von dir vieles gehört habe bin ich mir sicher du kennst dich extrem gut aus","replies":[{"poster":"One Inch","date":"2015-12-03T22:01:25.454+0000","up_votes":1,"down_votes":0,"body":"Ob ich mich extrem gut damit auskenne glaube ich selber nicht, jedoch helfe ich gerne wenn man Hilfe braucht.\nGib mir dann einfach deinen Skype Namen und ich adde dich dann :)","replies":[{"poster":"Raikiribreak","date":"2015-12-04T12:29:58.065+0000","up_votes":1,"down_votes":0,"body":"gut mein skype name ist Raikiribreak/samy","replies":[]}]}]}]}]}]},{"poster":"0815xand0r","date":"2015-12-03T01:31:06.841+0000","up_votes":1,"down_votes":0,"body":"Warum 500 Range?\nAS 0.25 ohne Möglichkeit den über Items zu erhöhen? Wird nicht funktionieren.\nMS: 285? Also selbst mit ausgebauten Schuhen bist du langsamer als jeder andere\nW: Beide Optionen deutlich zu stark. Bis zu 410 AD oder 410 MR/Armor? Gratis? Und das ohne die Mastery.\nDie restl. Sachen (Passive, Q, E, R) klingen von der Mechanik her okay, an den Werten müsste man schrauben.","replies":[{"poster":"Raikiribreak","date":"2015-12-03T08:02:54.648+0000","up_votes":1,"down_votes":0,"body":"Sag ich ja is ja auch meine erste Vorstellung","replies":[]}]},{"poster":"zadok","date":"2015-12-02T20:44:59.714+0000","up_votes":1,"down_votes":0,"body":"Q: KÄSE\nW:KÄSE\nE:KÄSE\nR:GESCHMOLZENER KÄSE","replies":[]},{"poster":"Raikiribreak","date":"2015-12-02T20:20:28.988+0000","up_votes":1,"down_votes":0,"body":"Eins hab ich noch vergessen der champ kann keine zusätzliche attakspeed bekommen nicht durch items oder sonstiges","replies":[{"poster":"zadok","date":"2015-12-02T20:52:02.391+0000","up_votes":1,"down_votes":1,"body":"ok zum push mach ich mal nen kommentar : \nan sich klingt es interresant ( könnte sejus burder sein )\nnur das mit den 0,25 angriffstempo ? du wirst nicht farmen können und 500 range auf nem tank ist auch nicht normal  aber vom prinzip klingt es nicht schlecht : ein tank mit viel cc .... aber wie oben erwähnt seju hat auch viel cc und ne änliche rolle ...","replies":[]}]},{"poster":"Raikiribreak","date":"2015-12-02T20:08:09.340+0000","up_votes":1,"down_votes":0,"body":"jo geil das er dir gefällt vielen dank :D","replies":[]},{"poster":"xGenuine","date":"2015-12-02T19:56:57.635+0000","up_votes":1,"down_votes":0,"body":"Gefällt mir auf jeden fall!{{sticker:slayer-jinx-unamused}}  \n\nHATE JINX XD","replies":[]},{"poster":"sevkho","date":"2015-12-02T19:49:04.935+0000","up_votes":1,"down_votes":0,"body":"Dezz Nuts","replies":[]}]}