{"poster":"DuckQuack0","date":"2016-06-02T17:08:08.086+0000","title":"Quando la Riot vuole la DynQ ma i giocatori vogliono la SoloQ","subforum":"Discussioni generali","up_votes":4,"down_votes":5,"body":"Chiss&agrave; quanto resister&agrave; :v\r\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Frattaglia","date":"2016-06-02T20:49:39.614+0000","up_votes":2,"down_votes":2,"body":"Peccato che sono abbastanza certa che abbiano i numeri dalla loro. Secondo me molta più gente gioca ranked in questa stagione rispetto agli anni passati.","replies":[{"poster":"call me pawn","date":"2016-06-02T21:54:56.510+0000","up_votes":4,"down_votes":0,"body":"Beh sai, quando ti puoi far boostare dagli amici senza incorrere in pene.....","replies":[{"poster":"Frattaglia","date":"2016-06-02T21:57:47.031+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=xXlollomegaXx,realm=EUW,application-id=MJVj50Jw,discussion-id=LEx7Erg1,comment-id=00030000,timestamp=2016-06-02T21:54:56.510+0000)\n>\n> Beh sai, quando ti puoi far boostare dagli amici senza incorrere in pene.....\n\nIn realtà i booster e gli smurf si lamentano che ci mettono molte più partite a salire. Almeno questo avevo letto (ma avevo anche io questa impressione).","replies":[{"poster":"DuckQuack0","date":"2016-06-03T07:13:53.800+0000","up_votes":1,"down_votes":0,"body":"Se ci mettono più tempo e perchè stanno boostando qualcuno, altrimenti non meritano di salire ehehe\nIo non ho mai fatto un premade in ranked e comunque sono passato da bronzo 2 a plat (e pensare che il mio obbiettivo era il gold)","replies":[{"poster":"Frattaglia","date":"2016-06-03T07:54:24.616+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=DuckQuack0,realm=EUW,application-id=MJVj50Jw,discussion-id=LEx7Erg1,comment-id=0003000000000001,timestamp=2016-06-03T07:13:53.800+0000)\n>\n> Se ci mettono più tempo e perchè stanno boostando qualcuno, altrimenti non meritano di salire ehehe\n> Io non ho mai fatto un premade in ranked e comunque sono passato da bronzo 2 a plat (e pensare che il mio obbiettivo era il gold)\n\nHai mai giocato le stagioni passate? Io ho fatto la scalata bronzo-oro in season 4 e argento-oro in questa e la cosa che ho notato è che è molto più difficile per il singolo carriare. Nel senso... se te lo meriti sali uguale, ma ci puoi mettere più tempo. Fino all'anno scorso se eri bravo prendevi quel gregge di pecore dei tuoi compagni e li portavi di peso al nexus nemico mentre adesso, se hai dei premade in squadra, è più difficile convincerli a seguirti e questo rende più difficile carriare la partita per lo smurf/booster/tizio con capacità superiori alla sua lega.","replies":[{"poster":"DuckQuack0","date":"2016-06-03T13:31:43.688+0000","up_votes":1,"down_votes":0,"body":"ranked da 2 season, comunque è proprio quello che vuole far intendere questo post\nsalire con dei premade è difficile e sinceramente farmi un premade con gente a caso non mi pare una buona idea e neanche ci tengo a farlo, preferisco fare tutto da solo\nultimamente per \"bilanciare\" tutto ciò vado support con dei campioni che possono carriare (ex. Brand, Zilean) così oltre ai normali carry ci sono io (sempre comprando le ward eh xD)","replies":[]}]}]},{"poster":"call me pawn","date":"2016-06-02T22:01:28.806+0000","up_votes":1,"down_votes":0,"body":"Ciò non toglie che resta sempre il problema più grosso della dynamic.","replies":[{"poster":"Frattaglia","date":"2016-06-02T22:02:55.572+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=xXlollomegaXx,realm=EUW,application-id=MJVj50Jw,discussion-id=LEx7Erg1,comment-id=0003000000000000,timestamp=2016-06-02T22:01:28.806+0000)\n>\n> Ciò non toglie che resta sempre il problema più grosso della dynamic.\n\nA me in realtà spiace solo la mancanza dei ranked team, intendo proprio quelli seri...","replies":[{"poster":"call me pawn","date":"2016-06-02T22:05:25.436+0000","up_votes":1,"down_votes":0,"body":"Perché le persone dovrebbero fare un team per le ranked quando possono fare dynq? Che cosa triste :/.","replies":[]}]}]}]}]}]},{"poster":"DuckQuack0","date":"2016-06-02T17:51:27.864+0000","up_votes":1,"down_votes":2,"body":"La Riot ha confermato che non rimetterà la Solo Q, però purtroppo 3/4 di League vuole la Solo Q\n\n#bringbacksoloq","replies":[{"poster":"XIII Vanitas","date":"2016-06-02T22:13:57.803+0000","up_votes":3,"down_votes":0,"body":"Da dovi li hai tirati fuori quei dati? Perché se dai retta alle boards, Tyler1, il main di Draven con almeno 20 account permabannati, era un bravo ragazzo che salutava sempre e non meritava di esser bannato a vita da LoL.","replies":[{"poster":"DuckQuack0","date":"2016-06-03T07:10:09.071+0000","up_votes":2,"down_votes":0,"body":"Semplicemente guarda Reddit o il video in cui parlano della DynQ e vedi quanti dislike rispetto ai like\n\nLa Riot vuole comunque bilanciare il più possibile la DynQ, ma a quanto vedo molti a causa di questo sistema ranked se ne stanno andando su Overwatch\n\nPurtroppo il boosting con la DynQ è troppo facile, ma se proprio vuole i team nelle ranked perchè la Riot non permette i team da 5 e basta? \nNon è certo una novità che se sei in solo e ti trovi 3-4 premade tu sarai l'unico colpevole in caso di sconfitta e l'unico inutile in caso di vittoria, per non parlare di quei stronzetti che \"pls report X\" con una scusa inventata in all chat\n\nLa Dyn Q fa pena, i fatti sono evidenti in ogni partita e sicuramente anche tu hai avuto qualche premade che ti ha rovinato la partita, mi ci gioco 3 anni di account.\n\nSoloQ o team da 5 + nuova champ select = le ranked torneranno ad essere normali e tutti felici e contenti\n\nForse questa cosa del 3/4 di League ho esagerato, perchè pensandoci se avessi un amico che mi boosterebbe non me ne potrebbe fregare un bip della Solo Q.\nPerò stai a sentire a me, la Riot ci perderà tanto per questa decisione","replies":[]}]}]},{"poster":"call me pawn","date":"2016-06-02T17:15:21.730+0000","up_votes":2,"down_votes":2,"body":"E' questione di poco (penso e spero), non ce la faccio più a vedere la gente frignare sul forum <.<.","replies":[{"poster":"Skydago","date":"2016-06-02T18:20:21.382+0000","up_votes":1,"down_votes":0,"body":"Lol ma sappi che alla gente dai un dito e si prende il braccio, vedrai frignare per qualunque cosa.","replies":[{"poster":"call me pawn","date":"2016-06-02T21:55:41.323+0000","up_votes":1,"down_votes":0,"body":"Eh lo so, ma perlomeno frigneranno per una cosa in meno.","replies":[]}]}]},{"poster":"Darkinknight","date":"2016-06-02T17:15:36.008+0000","up_votes":1,"down_votes":0,"body":"Penso che per tutta la season non cambiera una mazza..spero davvero che per la s7 si sveglino fuori e ammettani che sia una puttanata madornale,a parte il salire o meno..non è proprio piu divertente giocare ranked","replies":[]}]}