{"poster":"DuckQuack0","date":"2016-06-11T19:07:20.247+0000","title":"Taliyah è forte ma... - Parliamone","subforum":"Campioni e gameplay","up_votes":4,"down_votes":1,"body":"Fatte un paio di partite ho fatto un quadro generale su questo campione\r\n\r\nPro Q: Danni totali molto elevati, CD buono, piccola spell AOE, basso costo\r\nCon Q: La passiva ci sta per non renderla totalmente broken, tuttavia quello che ho trovato di negativo &egrave; che il CD &egrave; sempre lo stesso nell&#039;area della passiva, visto che ha danni base estremamente bassi preferirei che fosse 50% in meno di costo o 50% di danni in pi&ugrave; nel cerchietto, un oggetto da mr e gi&agrave; hai una spell in meno per tanto tempo\r\n\r\nPro W: unico metodo di escape/CC\r\nCon W: difficilina da usare, confonde un po&#039;, costo abbastanza alto visto che si maxa anche come ultima spell\r\n\r\nPro E: &quot;counter&quot; per alcuni campioni, slow, aoe dmg\r\nCon E: costo altissimo gi&agrave; dal lvl 1\r\n\r\nPro ULT: Pu&ograve; essere usata per raggiungere facilmente un luogo, pu&ograve; essere usata per bloccare il team avversario (ex. gank bot) costringendoli ad usare il flash\r\nCon ULT: Costo troppo elevato per un CD simile ed una spell &quot;passiva&quot;\r\n\r\nVisto che non si vede praticamente mai ed un winrate del 45% cosa ne pensate? e quali sono le vostre proposte?","replies":[{"poster":"Ultan","date":"2016-06-11T20:12:30.868+0000","up_votes":3,"down_votes":0,"body":"Secondo me va bene così come e, i danni sono giusti ne troppo alti ne troppo bassi se si riesce a fare una full combo E-W-Q e quasi sempre kill;\nSui costi in mana ce da fare qualche aggiustatina ma se si gestiscono gli spot della passiva si ha un sustain mana anche decente. La E se piazzata bene in team fight porta ad un output di danni assurdi:\nesempio 1 - una leblanc che prova a shottare un carry nelle retrovie se passa sulla E di Taliyah si suicida ahah\nesempio 2 - la E sinergizza con tantissimi campioni (lee sin che ulta qualcuno mandandolo sulla E di Taliyah, oppure anche un thresh con E o Q fa proccare gli spuntoni\nCome build io cerco sempre di fare il {{item:3116}} e la {{item:3152}}  e in casi di assassin sempre {{item:3027}}  e {{item:3157}}  il resto in base alle situazioni luden se voglio pushare e ho già un po' di vantaggio in lane. Starto sempre di {{item:3165}}  che da buoni bonus e mana regen\nLa ulti è comodissima per roamare e fare gankate lampo facendo sprecare summoners all'altro team.\nPersonalmente piace davvero tanto come champion, la spammo da quando e uscita, il win rate basso, secondo me, deriva dal fatto che va imparata per bene non e sempre facile piazzare la W e sapere quando tirare la ulti (potrebbe spreddare anche il team alleato impedendo il dps per qualche sec), spero che col tempo la gente la giochi di più perchè a mio avviso è davvero un bel champ! :){{champion:163}}","replies":[{"poster":"DuckQuack0","date":"2016-06-12T00:01:07.344+0000","up_votes":2,"down_votes":0,"body":"Certo per carità il champ mi piace davvero molto, ho fatto 3 partite di fila 3 S e più danni di tutti, ci tenevo solo a precisare quelle piccole cose, ovvero il costo eccessivo e i danni bassi sulla Q nella passiva, per il resto è un ottimo champ che pochi sanno utilizzare","replies":[]}]},{"poster":"Keìron","date":"2016-06-11T19:10:59.514+0000","up_votes":3,"down_votes":0,"body":"Bisogna solo diminuire moooolto la durata del worked ground, a qualcosa come 30-50 secondi.","replies":[]},{"poster":"Ucr0niA","date":"2016-06-12T06:45:27.415+0000","up_votes":4,"down_votes":1,"body":"Un grosso problema per Taliyah, in low elo, è che la gente difficilmente comprende un \"zone control\" o meglio ancora uno \"zooning\" champ, e ancora più difficilmente riesce ad usarlo come si deve; mettici pure un side effect, ovvero un risvolto che può essere negativo anche per il suo team (vero per chiunque come lei ha un wall, tipo Anivia ) ed ecco il win rate colare a picco.\n\nMi spiego:\nLa tua {{champion:163}} decide di andare Bot, ok?\nOra, ciò che dovrebbe fare è ultare dietro la bot nemica chiudendo la via di fuga in direzione della loro torre, cavalcare il wall fino alla bot, scendere dal lato della sua di bot e partecipare al 2 vs 3 usando W ed E, semplice no?\n\nINVECE NO.\nLa tua {{champion:163}} clicca ESATTAMENTE sul punto dove si trova l'adc nemico, credendosi per un secondo {{champion:56}} ; la bot nemica quindi indietreggia durante il cast time della sua R, e il wall finisce per dividere le due botlane separando i tuoi alleati dai nemici.\nOra tutto è rovinato no?\nMa la tua {{champion:163}}  riclicca lo stesso, va li e prova a colpire di Q, morendo ovviamente, davanti alla sua bot inorridita.\n\nMi succede nel 90% delle partite con {{champion:163}} .","replies":[{"poster":"DuckQuack0","date":"2016-06-12T07:41:35.686+0000","up_votes":1,"down_votes":0,"body":"Inoltre, c'è da dire che forse non viene neanche provata più volte ad usarla, il campione il generale è buono, la combo fa danni e come hai detto tu ha un buon zooning, potrebbe facilmente carriare con le roam e la R però è vero che in quelle poche partite che l'ho avuta contro è successo esattamente come hai detto tu\nQuindi il suo win rate estremamente basso è dato dal fatto che non si riesce a sfruttare a pieno le sue potenzialità\nQualche ritocchino sul mana cost mi farebbe piacere, ma intanto Taliyah è il mio prossimo campione perchè mi ci sono trovato bene ed è un campione, per me, divertente da usare","replies":[]}]},{"poster":"zYaichi","date":"2016-06-11T19:16:48.934+0000","up_votes":2,"down_votes":0,"body":"Dargli qualcosa da fare jk","replies":[]},{"poster":"Ðarkelle","date":"2016-06-12T09:11:14.682+0000","up_votes":1,"down_votes":0,"body":"> Con Q: La passiva ci sta per non renderla totalmente broken, tuttavia quello che ho trovato di negativo è che il CD è sempre lo stesso nell'area della passiva, visto che ha danni base estremamente bassi preferirei che fosse 50% in meno di costo o 50% di danni in più nel cerchietto, un oggetto da mr e già hai una spell in meno per tanto tempo\n\nIl worked ground va saputo gestire e non è nemmeno tanto complesso. Anzi, è ottimo per pokkare e aiutarsi con il farm.\nPersonalmente io grazie a questa passiva non buildo nemmeno item mana o rigenerazione mana, non ne ho mai bisogno.\nDirettamente {{item:3116}} + {{item:3152}} e comboshotti qualunque cosa xD\n\n> Con W: difficilina da usare, confonde un po', costo abbastanza alto visto che si maxa anche come ultima spell\n\nIo c'ho fatto una decina di partite prima di capire che per lanciare il mal capitato bisognava ripremerla, ma gg.\nUna volta capito, la combo è bellissima.\n\n> Pro E: \"counter\" per alcuni campioni, slow, aoe dmg\nCon E: costo altissimo già dal lvl 1\n\nNon vederla solo come 'counter per alcuni champion'. \nRagazzi, provate a costruirci su qualche team comp  decente su questa E.\nQualunque cosa si lanci o venga lanciata su questa skill prende dei danni allucinanti! Avete provato con uno Gnar in team? O un Lee Sin? Champion di questo tipo, che dispongono di abilità con cui possono lanciare gli avversari.. magari sulla vostra E. Che spettacolo, mi sono capitati dei teamfight davvero belli.\n\n> Pro ULT: Può essere usata per raggiungere facilmente un luogo, può essere usata per bloccare il team avversario (ex. gank bot) costringendoli ad usare il flash\nCon ULT: Costo troppo elevato per un CD simile ed una spell \"passiva\"\n\nL'unica cosa che non mi è chiara di questa Ulti è chi può passarci attraverso, senza il flash. Ho visto champion dashare oltre tranquillamente, altri schiantarcisi contro.. non c'ho capito molto.\nComunque ogni volta che è up, si roamma. E' utile per darsi 'un ritmo' tra farm e roaming. Per i casi estremi, come raggiungere il tuo avversario in un'altra lane, io in ogni caso gioco col tp.\n\nIn generale comunque io non ho problemi con CD e costi in mana, per me è stata una questione di abitudine e basta.","replies":[{"poster":"DuckQuack0","date":"2016-06-12T09:19:57.500+0000","up_votes":1,"down_votes":0,"body":"Se sono mid il Rylais non lo buildo\ndi solito vado così {{item:3027}} {{item:3165}} {{item:3151}} {{item:3135}} {{item:3089}} {{item:3158}} \nPerò la sto giocando da 3-4 giorni e credo sia la build che mi trovi meglio, l'ho provata col rylais ma sinceramente uno slow già ce l'ho e preferisco il liandry poichè molto spesso ci si trova con mid laner con parecchia vita e il liandry aiuta con il poke della Q","replies":[{"poster":"Ðarkelle","date":"2016-06-12T09:42:53.842+0000","up_votes":1,"down_votes":0,"body":"Addirittura RoA e Morello xD\nNon te ne fai nulla, impara a gestire il mana.\n\nIl Rylai è indispensabile per piazzare bene la combo ed è anche una grande rottura per gli avversari.\nIdem per la Proto-Belt, comodissima.\n\nGuarda [quà](http://www.probuilds.net/champions/details/Taliyah).","replies":[]}]}]},{"poster":"x A N D R E","date":"2016-06-11T20:33:13.661+0000","up_votes":1,"down_votes":6,"body":"È troppo scarsa PUNTO.","replies":[]}]}