{"poster":"Riot Kengen","date":"2019-10-23T14:55:38.962+0000","title":"Meddlers Gameplay Gedanken - 23. August","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hallo!\r\n-------------------------------------------------------------------------------\r\n**Der übliche Haftungsausschluss**\r\n\r\nIn diesen Beiträgen sprechen wir oft über zukünftige Projekte oder Pläne, die möglicherweise nie das Licht der Welt erblicken. Konzepte können sich ändern, und je nachdem, was wir herausfinden, können Projekte verschoben werden oder sogar in der Tonne landen. Falls du jedes Mal einen Tweet sehen möchtest, wenn ein neuer Beitrag erscheint, klicke hier: https://twitter.com/RiotMeddler\r\n----------------------------------------------------------------------------       \r\n**Spielmodi und Events**\r\n\r\nIn diesem Jahr haben wir weniger temporäre Spielmodi veröffentlicht, da wir uns auf andere Dinge (vor allem TTK) konzentriert haben. Wir wollen in Zukunft aber wieder häufiger neue oder unterschiedliche Spielmodi veröffentlichen, vor allem in Zusammenhang mit großen Events. Wir sind immer noch dabei, uns die bestmögliche Herangehensweise zu überlegen, dennoch sollen die Spieler wissen, dass wir uns darüber Gedanken machen. Wir stimmen dem Feedback zu, dass die Events mehr Spaß machen, wenn es währenddessen neben den Missionen, neuen kosmetischen Inhalten usw. auch andere Spielmodi gibt. \r\n\r\nBei genauerer Betrachtung der letzten Spielmodi ist uns aufgefallen, dass die Spieler jene Modi am liebsten spielen, bei denen es sich um spaßige Variationen des normalen Gameplays handelt (z. B. Einer für alle, U.R.F., die ARAM-Events, Hexakill usw.). Daher werden wir uns wahrscheinlich auf derartige Dinge konzentrieren. Modi, die stark vom normalen Gameplay von LoL abweichen (z. B. Projekt: Überladung oder Sternenvernichter), werden anfangs sehr gut aufgenommen. Danach sinkt ihre Spielrate aber sehr schnell. Wir möchten uns aber lieber auf Dinge konzentrieren, mit denen die Spieler länger Spaß haben.\r\n\r\nWas den Zeitrahmen angeht, so werden wir mit unserer neuen Herangehensweise wohl erst im nächsten Jahr beginnen. In diesem Jahr wird jedoch U.R.F. (alle zufällig) noch einmal zurückkehren. Wir wollen auch neue Dinge ausprobieren, diskutieren aber immer noch darüber, was diese Dinge sein könnten und wann wir sie veröffentlichen sollten. \r\n\r\n\r\n----------------------------------------------------------------------------       \r\n**Ranglistenaufmachungen/-rahmen für TTK**\r\n\r\nHier eine kurze Anmerkung zu den Ranglistenaufmachungen und -rahmen für TTK. Aktuell greifen wir auf die normalen Illustrationen für die Ranglistenspiele von LoL (Rahmen, Aufmachungen usw.) zurück, da diese bei der Veröffentlichung von TTK bereits vorhanden waren. Langfristig gesehen werden wir aber eigene Illustrationen für TTK erstellen, die besser zu diesem Spielmodus passen und Aufschluss darüber geben, in welchem Modus der Spieler welchen Rang erreicht hat. Unserer Meinung nach ist es gut, wenn die Aufmachungen usw. variantenreich sind, um Spielern, die ihre Erfolge vorzeigen wollen, mehr Möglichkeiten zu geben. Es sollte auch immer klar erkennbar sein, was die Illustrationen repräsentieren, das ist aktuell jedoch nicht immer der Fall. \r\n\r\n----------------------------------------------------------------------------       \r\n**Ein paar Informationen zu den nächsten Patches**\r\n\r\n9.17 \r\n●\tMittlerweile stehen alle Änderungen fest und wir haben uns entschieden, Aatrox und Akali außen vor zu lassen. \r\n\r\n9.18\r\n●\tWir haben vor, Akali und Aatrox ein weiteres Mal zu überarbeiten. Dabei wollen wir uns jedoch nicht auf die Werte konzentrieren, sondern kleine Änderungen an den Spielmechaniken testen, um die Champions für Solo-Warteschlange attraktiver und für professionelle Spiele etwas unattraktiver zu machen. \r\n●\tAußerdem werden wir in 9.18 möglicherweise ein paar Komfortverbesserungen an Teemo vornehmen. \r\n●\tAlles in allem dürfte der Patch ziemlich klein werden, da wir unseren Fokus bereits auf die Vorsaison gerichtet haben und die Stabilität des Spiels nicht gefährden wollen. \r\n\r\n9.19 \r\n●\tHierbei handelt es sich um den Patch, auf dem die WM ausgetragen wird, daher wird es für die KB kaum Änderungen geben. Wir werden anhand der aktuellen Daten kleinere Balanceänderungen durchführen, mehr ist jedoch nicht geplant.\r\n\r\n9.20+\r\n●\tAb diesem Patch werden wir unsere Aufmerksamkeit stärker auf die Solo-Warteschlange richten. So haben wir beispielsweise vor, in dieser Phase Shaco und Garen zu überarbeiten. \r\n●\tAußerdem wird das KB-Team viel Zeit damit verbringen, die Vorsaison-Änderungen vorzubereiten.\r\n----------------------------------------------------------------------------        \r\n**Vorsaison: Mögliche Änderungen an Saum der Nacht**\r\n\r\nUnd wo wir gerade von der Vorsaison reden: Wir wollen zumindest ein paar Gegenstände in der Vorsaison überarbeiten. Aktuell führen wir gerade Tests durch und erhalten gute Ergebnisse für Saum der Nacht. Im Moment haben wir geplant, den Zauberschild so zu überarbeiten, dass er in etwa gleich funktioniert wie der von Schleier der Todesfee (damit der Schild alle X Sekunden außerhalb des Kampfes erneuert wird und nicht aktiv kanalisiert werden muss). Wir würden gerne wissen, wie die Spieler, die mit Saum der Nacht spielen oder gespielt haben, über diese Änderungen denken. \r\n\r\n \r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png           \r\n\r\n\r\nPS von Kengen: Entschuldigt bitte, dass die Gameplay Gedanken viel zu spät kommen. Ich versuchs wieder so zeitig wie möglich zu posten!","replies":[]}