{"poster":"Riot Kengen","date":"2018-11-08T16:23:59.738+0000","title":"Meddlers Gameplay Gedanken 07. November","subforum":"Dev Corner","up_votes":2,"down_votes":2,"body":"Hallo!\r\n-------------------------------------------------------------------------------\r\n**Der &uuml;bliche Haftungsausschluss**\r\n\r\nIn diesen Beitr&auml;gen sprechen wir oft &uuml;ber zuk&uuml;nftige Projekte oder Pl&auml;ne, die m&ouml;glicherweise nie das Licht der Welt erblicken. Konzepte k&ouml;nnen sich &auml;ndern, und je nachdem, was wir herausfinden, k&ouml;nnen Projekte verschoben werden oder sogar in der Tonne landen. Falls du jedes Mal einen Tweet sehen m&ouml;chtest, wenn ein neuer Beitrag erscheint, klicke hier: https://twitter.com/RiotMeddler\r\n----------------------------------------------------------------------------      \r\n**R&uuml;ckblick auf Odyssee**\r\n\r\nWir haben vor Kurzem noch einmal auf Odyssee zur&uuml;ckgeblickt und dar&uuml;ber nachgedacht, wie das Event verlaufen ist und was wir daraus lernen k&ouml;nnen. Hier sind ein paar Gedanken dazu:\r\n\r\n* Einige Spieler sind offensichtlich daran interessiert, in LoL richtige PvE-Inhalte zu spielen und nicht Ableger von PvP-Modi (kooperative Spiele gegen die KI). Die Spieler haben vor allem die M&ouml;glichkeit, die F&auml;higkeiten eines Champions stark zu beeinflussen, und raid&auml;hnliche Begegnungen hervorgehoben. \r\n* Die meisten Spieler haben diesen Modus ausprobiert und ein nicht geringer Anteil von ihnen hat sogar recht viel Zeit damit verbracht. Diese Spieler waren vor allem vom Gameplay und den speziellen Missionen des Modus begeistert. \r\n* Die gr&ouml;&szlig;te Frustrationsquelle der Spieler bestand darin, ein Team suchen zu m&uuml;ssen, das dieselben Missionen abschlie&szlig;en m&ouml;chte. Derartige Konflikte sollten wir in Zukunft vermeiden, indem wir beispielsweise das Missionsdesign &auml;ndern oder Spielern mit gemeinsamen Zielen helfen, sich gegenseitig zu finden.\r\n* Wir werden versuchen, weiter PvE-Modi wie diesen zu entwickeln. Diese Modi haben zwar nicht denselben Wiederspielwert wie die PvP-Modi, sie sind es aber definitiv wert, ihnen mehr Aufmerksamkeit zu schenken.\r\n\r\nWir werden demn&auml;chst wahrscheinlich einen Entwickler-Blog ver&ouml;ffentlichen, der sich mit den Werten von Odyssee befasst und Dinge wie die Beliebtheit der unterschiedlichen Champions, die Abschlussraten der unterschiedlichen Schwierigkeitsgrade, die Verwendung von Augmentierung usw. abdeckt. \r\n----------------------------------------------------------------------------       \r\n**Blitzpartie** \r\n\r\nWie bereits vor ein paar Wochen erw&auml;hnt, haben wir vor, mit Patch 8.24 einen weiteren Testlauf von Blitzpartie zu starten:\r\n\r\n\r\nhttps://nexus.leagueoflegends.com/de-de/2018/10/dev-up-next-for-nexus-blitz/\r\n\r\n\r\nDa wir jetzt bereits mit der Arbeit an diesem Projekt begonnen haben, m&ouml;chte ich hier ein wenig dar&uuml;ber sprechen:\r\n\r\n* Wir haben ein paar neue Ereignisse entwickelt, die wir f&uuml;r sehr vielversprechend halten. Eines davon konzentriert sich auf kleinere Teamk&auml;mpfe und steht damit im Kontrast zu einem Gro&szlig;teil der bisher existierenden Events. \r\n* Wir werden &bdquo;Schneeballschlacht&ldquo; entfernen. Obwohl dieses Ereignis f&uuml;r einige spannende Momente gesorgt hat, war das Feedback dazu h&auml;ufiger negativ als positiv.\r\n* Was die Belohnungen angeht, so werden wir ein paar nicht zufriedenstellende Dinge wie den Segen von Caitlyn und die verfluchten Vasallen entfernen und sie durch spa&szlig;igere, denkw&uuml;rdigere Belohnungen ersetzen.\r\n* Die &Uuml;berarbeitung einiger Mauern auf der Karte und einiger Standorte der Dschungellager sieht vielversprechend aus, da sie anscheinend eine eindeutigere Anfangsphase und mehr Vielfalt im Dschungel nach sich zieht.\r\n* Die Karte selbst sollte wesentlich besser aussehen und nicht mehr wie ein Prototyp wirken. Sie wird zwar nicht so gut aussehen wie die Kluft der Beschw&ouml;rer, dir sollte jedoch auffallen, dass sie wesentlich h&uuml;bscher aussieht als die erste Version.\r\n\r\n----------------------------------------------------------------------------        \r\n**Vorsaison**\r\n\r\nDie Vorsaison soll immer noch mit Patch 8.23 beginnen. Wir arbeiten gerade am finalen Feinschliff und werden das Regenerationsverm&ouml;gen wahrscheinlich ein wenig abschw&auml;chen, damit die Anfangsphase nicht zu defensiv und sicher wird. Au&szlig;erdem testen wir gerade, wie es sich anf&uuml;hlt, wenn die Vasallen zur selben Zeit auftauchen wie bisher, anstatt sie und die Dschungellager fr&uuml;her erscheinen zu lassen. Der Hauptgrund daf&uuml;r ist, dass wir uns nicht sicher sind, ob wir die wenigen Spiele, in denen &Uuml;berf&auml;lle auf den gegnerischen Dschungel zu spannenden Momenten f&uuml;hren, f&uuml;r den Gro&szlig;teil der Spiele opfern wollen, in denen die Spieler einfach nur warten, bis die Anfangsphase beginnt. \r\n\r\n \r\n \r\n \r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png","replies":[{"poster":"Vorzüglich","date":"2018-11-10T00:26:33.418+0000","up_votes":2,"down_votes":0,"body":"PvE ist natürlich nice. Bin ein großer Fan davon.\nEs ist eine Option die nur Gewinn für alle bedeutet da nichts \"wegfällt\" oder ersetzt wird.\n\nDie Q Zeiten mögen länger werden aber auch das stört mich nicht im geringsten.\n\nWas mich stört ist, das der PvE Mode doch Sinnbildlich dafür steht das der \"normale\" oder Ranked Mode schlichtweg nicht erfüllend genug  ist.\nUnd die PvE Modi da Abhilfe verschaffen sollen.\n\nEs ist ein Pflaster, das aber nichts an den Ursachen der Unzufriedenheit etwas ändern kann und wird.","replies":[]},{"poster":"Bronze7Main","date":"2018-11-09T00:41:54.587+0000","up_votes":1,"down_votes":0,"body":"Hasse Rito zwar an für sich für jeden afk den mir dieses failsystem ins team queued aber das weiter an PvE-Modi gearbeitet wird find ich mega nice. Finds auch schön zu lesen das man sich die Fehler im Vergleich zu diesem PVE-Modi und Star Guardian nochmal anschaut um für spätere Modi den Spielspaß zu garantieren  statt sich nur auf Missionen zu fokussieren. \n\n\nSchwierigkeit von Odyssee war an für sich ja recht gut gelungen auch wenn ich finde das man die leichten Schwierigkeitsgrade nicht mehr betreten können sollte sobald man eine gewisse Zahl an Augmentierungen in dem Fall zusammen hat (damit man es anfängern nicht zu leicht machen kann damit die am Ende tilten können) So das sich jeder langsam vorantasten muss.  Das Augmentierungssystem war sowieso ziemlich nice finde aber auch das man hier, sollte man noch einmal auf so ein System zurückgreifen, definitiv ein weiterer Schwierigkeitsgrad herzaubern muss für den die nahezu maximale Anzahl an Augmentierung nahezu unverzichtbar ist um den Modus zu schaffen. \n\nWas ich mir noch für zukünftige Modi dieser art wünschen würde wäre eine wesentliche Champerweiterung weil immer nur die selben 5 Champs sind so unglaublich langweilig also 40 stk oder so wäre schon nice. Außerdem sollte der RNG-Faktor wesentlich erhöht werden so das diese Modi nicht praktisch nahezu immer gleich ablaufen da man sonst in eine langweilige Schiene fährt. Die Abwechslung sollte overall einfach n bisschen erhöht werden. Fände abschnitte die auch mal defensiv verlaufen oder wie bei Star Guardian mit der Straße folgen (in diesem Kreis dingsda)  gar nicht so verkehrt. Wäre zudem nice wenn nicht nur immer die gleichen Gegner kommen also kog maw skarner und vel koz bzw rek sai. Könnte mir zb vorstellen wie hier n garen an jeder Ecke steht oder jetzt wo Kaisa existent ist auch gerne mal kaisa als pokechamp statt vel koz. Gerne auch unerwartete Effekte wie bei Doom bots die random spawnen so das man nicht vorhersehen kann was man als nächsten tun muss.","replies":[]},{"poster":"Vorzüglich","date":"2018-11-08T22:08:57.367+0000","up_votes":1,"down_votes":0,"body":"**_Damit die Anfangsphase nicht zu sicher wird..._**\n\nManchmal macht ihr mich echt sprachlos...Glückwunsch^^ \nWer kommt eigentlich auf solche Sachen?!\n \nDa bufft ihr die Tonik Rune in den Mastery derart OP, wollt aber nun die basis reg der Champs nerfen?!\nRito balance Team echt nur ein Meme.\n\nUnd wieder keine wirklich interessanten Themen.\n\nMemo an mich, Ansrpuch weiter drosseln.","replies":[{"poster":"Bronze7Main","date":"2018-11-09T00:31:12.377+0000","up_votes":1,"down_votes":0,"body":"Wo genau wurde Tonic jetzt derart op gebufft? xd \n\nund das man nicht jedem alles recht machen kann ist normal aber viele interessiert der weitere vorgang mit pve-modi und blitz halt.","replies":[]}]}]}