{"poster":"Riot Kengen","date":"2019-08-12T11:44:59.635+0000","title":"Meddlers Gameplay Gedanken - 09. August","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hallo!\r\n-------------------------------------------------------------------------------\r\n**Der übliche Haftungsausschluss**\r\n\r\nIn diesen Beiträgen sprechen wir oft über zukünftige Projekte oder Pläne, die möglicherweise nie das Licht der Welt erblicken. Konzepte können sich ändern, und je nachdem, was wir herausfinden, können Projekte verschoben werden oder sogar in der Tonne landen. Falls du jedes Mal einen Tweet sehen möchtest, wenn ein neuer Beitrag erscheint, klicke hier: https://twitter.com/RiotMeddler\r\n----------------------------------------------------------------------------       \r\n**Ein paar Zusatzinfos für die Balance der KB in Patch 9.16**\r\n\r\nSehen wir uns ein paar der Änderungen an, die mit Patch 9.16 veröffentlicht werden.\r\n\r\nVerbesserungen:\r\n\r\n* Jax: Wir wollen Jax etwas verstärken, um ihm die Anfangsphase auf der oberen Lane zu erleichtern, wenn er es dort mit Fernkämpfern zu tun bekommt (Abklingzeit seines Qs von 10–6 auf 8–6) \r\n* Lux: Jetzt, da die Änderungen mit Patch 9.14 bereits seit einiger Zeit live sind, sind wir sicher, dass wir Support-Lux etwas zu stark abgeschwächt haben. Wir wollten sie zwar bewusst stark abschwächen, sind dann aber doch über das Ziel hinausgeschossen. Daher werden wir die Ränge ihres Ws wieder etwas verstärken. \r\n* Shen: Wir werden Shen etwas verstärken, damit er im mittleren und späten Spiel leichter Lanes vorantreiben kann, vor allem, wenn ihm robuste Gegner gegenüberstehen (Erhöhung des Schadens seines Qs und seines Es). Diese Änderungen sollten sich vor allem auf der oberen Lane bemerkbar machen, da Shen sein Q dort früher ausbaut als in der Supporter-Rolle. \r\n\r\nAbschwächungen:\r\n\r\n* Azir: Wir werden Azir leicht abschwächen, damit seine Gegner im späten Spiel etwas mehr Zeit haben, mit ihm fertig zu werden (Abklingzeit von Q von 15–5 auf 15–7). Wir haben ursprünglich größere Abschwächungen für Azir getestet, da er jedoch nicht übermäßig stark ist und wir gleichzeitig andere Champions, die in der Regel auf der mittleren Lane gespielt werden, verstärken, haben wir uns für diese kleine Änderung entschieden. \r\n* Corki: Im Gegensatz zu Azir werden wir Corki weit stärker abschwächen. Dabei zielen wir vor allem auf seinen zuverlässigen Schaden ab (Grundwert für Angriffsschaden und Angriffsschaden pro Stufe). Die Änderungen sehen auf dem Papier zwar unbedeutend aus, wir wissen aber aus Erfahrung, dass kleine Änderungen am Grundwert für Angriffsschaden große Auswirkungen haben können.\r\n* Riven: Wir schwächen Riven vor allem deshalb ab, weil sie in den hohen GSW-Bereichen der Solo-Warteschlange sehr stark ist. Rückblickend hätten wir die Abklingzeit ihres Qs mit Patch 9.10 nicht verringern müssen. Daher werden wir diese Änderung zum Großteil wieder rückgängig machen. \r\n\r\n----------------------------------------------------------------------------       \r\n**Chromas für Ehrungsstufe 5**\r\n\r\nIn diesem Jahr erhalten Mittelalterlicher Twitch und Grauer Warwick ein paar Chromas. Das machen wir vor allem deshalb, um auch Spielern mit Ehrungsstufe 5 belohnen zu können, die bereits beide Skins besitzen. Das Ganze wird so funktionieren: Die „Ehrungsstufe 5“-Kapsel wird zwei „Ehrungsstufe 5“-Marken enthalten, die anschließend gegen Mittelalterlicher Twitch, Grauer Warwick oder die Chromas eingetauscht werden können. Bei der Ankündigung dieser Chromas vor ein paar Wochen haben wir noch angegeben, dass sich die Spieler nur eines der beiden aussuchen würden können. Diesen Ansatz haben wir jedoch wieder verworfen, da wir zu Beginn dieses Jahres versprochen haben, dass sie beide bekommen werden.\r\n\r\nDie Spieler, die ihre „Ehrungsstufe 5“-Kapseln für dieses Jahr bereits geöffnet haben, erhalten die Marken im Verlauf von Patch 9.16.\r\n----------------------------------------------------------------------------        \r\n**Ranglistenspiele in TTK**\r\n\r\nWir werden das Ranglistensystem von TTK überarbeiten. Wir haben unser Ranglistensystem für TTK zwar angepasst, sehen aber aufgrund unserer Erfahrungen und des Feedbacks der Spieler noch Raum für weitere Feinabstimmungen. Ich habe zwar noch keine Details, werde mich aber melden, sobald es welche gibt.\r\n\r\n----------------------------------------------------------------------------        \r\n**Der Zufallsfaktor in TTK: Gegenstände**\r\n\r\nIch werde in den nächsten paar Wochen noch einmal genauer auf dieses Thema eingehen. Das wollte ich zwar schon in dieser Woche tun, ich will dem TTK-Team jedoch nicht vorgreifen. Dennoch ist hier ein kurzer Überblick:\r\n\r\n* Unserer Meinung nach ist es extrem wichtig, dass sich jedes TTK-Spiel vom vorherigen unterscheidet, schließlich soll TTK vor allem die Anpassungsfähigkeit der Spieler auf die Probe stellen.\r\n* Daher halten wir es auch nicht für zielführend, jedem Spieler jedes Spiel dieselbe Anzahl an Gegenständen zur Verfügung zu stellen.\r\n* Wir wissen aber auch, dass das aktuelle System Spielern, die nur wenige Gegenstände erhalten, nicht genug Alternativen bietet. Daher testen wir gerade ein paar mögliche Änderungen. Ich werde mich sofort mit Details melden, sobald wir mögliche Lösungen für dieses Problem gefunden haben.\r\n\r\n\r\n\r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png","replies":[{"poster":"Vorzüglich","date":"2019-08-14T11:45:29.300+0000","up_votes":1,"down_votes":0,"body":"Können doch keine \"God Tier skin selling machine\" wie Lux abschwächen...\n\nDie Skin verkäufe von ihr sind bereits um 0,005 % gesunken...Tencent we got a problem!","replies":[]}]}