{"poster":"Schmandbob","date":"2016-07-21T11:24:40.081+0000","title":"AFK Gehen bzw das Spiel verlassen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo,\r\n\r\nich habe eine Frage bez&uuml;glich des AFK Gehens.\r\nWas kann man machen gegen Internetausfall? \r\n\r\nIch habe jetzt mehrere Spiele gespielt, indem mein Internet einfach nicht mehr will, was dazu f&uuml;hrt, dass man reported wird - nat&uuml;rlich berechtigt.\r\nJedoch w&uuml;rde ich ein Spiel niemals absichtlich verlassen und das ist nicht akzeptabel.\r\nNun muss ich 20 Minuten Wartezeit verbringen, damit ich in die Queue komme.\r\n\r\nHat irgendwer Tipps oder Hilfen wie man das umgehen kann?\r\nWeil das Internet kann ja nicht st&auml;ndig ausfallen.. nachher krieg ich noch einen Permaban deswegen.\r\nIch kann z.B. 3 Stunden vern&uuml;nftig zocken, perfekter Ping von 30, keine Laggs, und dann auf einmal f&auml;llt das Internet f&uuml;r 1 Stunde aus, einfach so..\r\ndann geht es wieder ne Stunde und dann f&auml;llts wieder aus.. ich wei&szlig; nicht was ich tun soll.\r\n\r\nAnbieter: Kabel Deutschland","replies":[{"poster":"TNP Curry","date":"2016-07-21T11:47:49.055+0000","up_votes":1,"down_votes":0,"body":"Spielst du über WLAN? Wenn ja, kann es ja daran liegen{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Schlampe des ADC","date":"2016-07-21T12:11:05.611+0000","up_votes":1,"down_votes":0,"body":"Ich spiele auch über WLan und habe dieses Problem nie :o","replies":[{"poster":"Darkr3sQ","date":"2016-07-21T13:38:12.643+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Schlampe des ADC,realm=EUW,application-id=7hciEY9w,discussion-id=ZE9kpJwE,comment-id=00030000,timestamp=2016-07-21T12:11:05.611+0000)\n>\n> Ich spiele auch über WLan und habe dieses Problem nie :o\n\nBei WLAN kommt es einerseits darauf an, was in den Wänden und Decken verbaut ist, und zusätzlich ob und wieviele andere WLAN-Netze in der Nachbarschaft vorhanden sind und auf welchem Kanal sie senden.\nIst im Grunde wie PowerLAN. Es kann funktionieren, und wenn es das tut ist es auch eine feine Sache, aber es kann genausogut Probleme machen.\n\nTrotz allem wäre es interessant zu wissen, ob hier eine WLAN- oder PowerLAN-Verbindung genutzt wird, oder ob der Rechner - und diese Variante bevorzuge ich persönlich am ehesten - per Netzwerkkabel direkt mit dem Router verbunden ist.\n\nDann wären noch folgende Fragen zu klären: \n- Ist das Internet komplett tot, oder bricht lediglich die Verbindung zu LOL ab?\n- Wenn eine WLAN-Verbindung vorliegt: reißt die WLAN-Verbindung ab, oder bekommst Du ein gelbes Dreieck mit Ausrufezeichen in der Verbindung angezeigt?\n- Wenn Du die Verbindung mit WLAN oder PowerLAN aufbaust: ändert sich das Verhalten der Verbindung, wenn Du den Rechner mit einem Netzwerkkabel direkt mit dem Router verbindest?\n- Wenn die Internetverbindung weg ist, startet der Router neu, oder verhält er sich so wie immer?\n- Hat Dein Router auf der Weboberfläche einen Ereignislog? Wenn ja, was zeigt dieser in der Zeit, wo die Verbindung abbricht an?\n- Wenn die Internetverbindung weg ist, kommst Du auf die Web-Oberfläche Deines Routers? Wenn ja, was zeigt er als Status an?\n- Hilft es, wenn Du den Router bei einem Internetausfall neu startest?","replies":[{"poster":"Schmandbob","date":"2016-07-21T15:14:05.871+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nes liegt WLAN vor, \nist mit dem Router verbunden bzw. habe so ein Powerlan \"Ding\" wo ich das angeschlossen habe, also vom PC zum Powerlan und dann in die Steckdose und unten dasselbe da steht der Router und ist damit verbunden, aber wenn es ausfällt kann im Haus keiner ins Internet ,\ndie ganze WLAN Verbindung reißt ab, ich kann nicht mehr ans Handy Whatsapp etc.. aber auf meinem PC erscheint ein gelbes Dreieck mit Ausrufezeichen.. ziemlich komisch das verwirrt mich immer.\n\ner verhält sich so wie immer..,\nich weiß gerade nicht was mit Ereignislog auf der Weboberfläche gemeint ist , \nund nein Router neu starten hilft leider nicht..\n\n- ps: Danke für deine Hilfe :) freut mich","replies":[{"poster":"Darkr3sQ","date":"2016-07-21T16:57:35.259+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Schmandbob,realm=EUW,application-id=7hciEY9w,discussion-id=ZE9kpJwE,comment-id=0003000000000000,timestamp=2016-07-21T15:14:05.871+0000)\n>\n> Hallo,\n> \n> es liegt WLAN vor, \n> ist mit dem Router verbunden bzw. habe so ein Powerlan &quot;Ding&quot; wo ich das angeschlossen habe, also vom PC zum Powerlan und dann in die Steckdose und unten dasselbe da steht der Router und ist damit verbunden, aber wenn es ausfällt kann im Haus keiner ins Internet ,\n> die ganze WLAN Verbindung reißt ab, ich kann nicht mehr ans Handy Whatsapp etc.. aber auf meinem PC erscheint ein gelbes Dreieck mit Ausrufezeichen.. ziemlich komisch das verwirrt mich immer.\n> \n> er verhält sich so wie immer..,\n> ich weiß gerade nicht was mit Ereignislog auf der Weboberfläche gemeint ist , \n> und nein Router neu starten hilft leider nicht..\n> \n> - ps: Danke für deine Hilfe :) freut mich\n\nEs sollte eigentlich eine IP-Adresse geben, mit der Du Dich auf den Router verbinden kannst. Ist häufig 192.168.0.1 oder 192.168.1.1. Wenn Du diese Adresse in Deinem Browser (Mozilla Firefox, Internet Explorer, Edge, Chrome, Safari) in der Adressleiste (wo Du sonst www.google.de oder ähnliches eingeben kannst) eingibst, solltest Du auf eine Anmeldemaske Deines Browsers kommen. Dann brauchst Du nur noch den Benutzernamen und das Passwort, und könntest dann da drauf nachschauen, was da für ein Status ist.","replies":[{"poster":"Schmandbob","date":"2016-07-22T16:24:07.221+0000","up_votes":1,"down_votes":0,"body":"Es klappt nicht, komme nur mit verfügbarem Internet in die IP-Adresse rein. :/","replies":[{"poster":"Darkr3sQ","date":"2016-07-22T18:57:57.730+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Schmandbob,realm=EUW,application-id=7hciEY9w,discussion-id=ZE9kpJwE,comment-id=000300000000000000000001,timestamp=2016-07-22T16:24:07.221+0000)\n>\n> Es klappt nicht, komme nur mit verfügbarem Internet in die IP-Adresse rein. :/\n\nWenn es alle PCs betrifft, die an dem Router angeschlossen sind, ist die Wahrscheinlichkeit hoch, dass der Router ne Macke hat.\nWenn es \"nur\" Deinen PC betrifft, der per PowerLAN angeschlossen ist, ist das PowerLAN die Ursache des Übels. Das kannst Du dadurch herausfinden, indem Du, wenn Dein Rechner kein Internet hat, beide PowerLAN-Adapter vom Strom nimmst, und dann wieder in die Steckdose steckst. Dann sollten die Adapter sich untereinander wieder verbinden, und es sollte wieder klappen. Wenn das der Fall ist, haben entweder die PowerLAN-Adapter ne Macke, oder irgendetwas stört die beiden.\nDie Möglichkeit, ein Kabel zu legen, besteht - nehme ich mal an - nicht so ohne weiteres?","replies":[{"poster":"Schmandbob","date":"2016-07-22T21:30:40.183+0000","up_votes":1,"down_votes":0,"body":"Nein, leider nicht... es liegt am Router denke ich.\nDas Problem besteht im ganzen Haus.. war gerade wieder so weit.. war im Spiel und zack halbe Stunde Ausfall.\nWieder 20 Minuten Queue Warteschlange 5 Spiele lang.. so ein Mist aber auch.\n\nAber danke für die Hilfe, ich denke es wird Zeit für einen neuen Router.","replies":[]}]}]},{"poster":"Schmandbob","date":"2016-07-21T17:39:09.084+0000","up_votes":1,"down_votes":0,"body":"Alles klar, danke vielmals für die Erklärung und Hilfe!\nIch nehme an, dass mein Internet gleich bzw. heute noch ausfallen wird, daher werde ich nachher noch mal hier etwas rein posten, wie es ausschaut.\nAnsonsten morgen.","replies":[{"poster":"Schmandbob","date":"2016-07-22T16:22:54.317+0000","up_votes":1,"down_votes":0,"body":"Also:\n\ngestern war soweit, bis auf 5 Minuten alles in Ordnung.\n\nIch kam in den 5 Minuten jedoch nicht in die IP 192.168.1.1 rein , als ich das gelbe Dreieck hatte.\nAn meinem Handy jedoch hatte ich Internet. Es muss also eine Störung zwischen PC und Router vorliegen.\nD.h. das komplette Internet an meinem PC fällt aus.","replies":[]}]}]}]}]}]}]},{"poster":"Shad0wM0on","date":"2016-07-21T11:34:04.962+0000","up_votes":2,"down_votes":0,"body":"Setz dich mal mit dem Anbieter auseinander. Sag denen was Sache ist. Die sollten das in Ordnung bringen","replies":[]},{"poster":"leonthefirefly","date":"2016-07-21T11:44:51.355+0000","up_votes":1,"down_votes":0,"body":"such dir nen vernünftigen anbieter^^ (sagte er laut und war auch bei vodafone (ist mitlerweile das selbe wie kabeldeutschland)) ganz im ernst mit diesem saftladen hab ich nur schlechte erfahrungen gemacht... Eig würde ich auch sagen setz dich mit denen auseinander nur pasierts bei denen gerne mal dass du nach 2std warteschlange jemanden am telefon hast der entweder direkt auflegt oder nur meint wenn sie nicht zufrieden sind kündigen sie hald...","replies":[]},{"poster":"Schlampe des ADC","date":"2016-07-21T11:41:59.674+0000","up_votes":1,"down_votes":0,"body":"[Kabel Deutschland Störung](http://xn--allestrungen-9ib.de/stoerung/kabel-deutschland)\n[NetCologne Störung](http://xn--allestrungen-9ib.de/stoerung/netcologne)\n[Telekom Störung](http://xn--allestrungen-9ib.de/stoerung/deutsche-telekom)\n\nFalls ich noch etwas vergessen haben sollte, Tut mir leid.\n---\nMFG - kkse Der Feeder","replies":[]}]}