{"poster":"AssauIto","date":"2016-12-21T19:03:50.110+0000","title":"What causes that smell in fish oil? [Science Discussion]","subforum":"[ARCHIVED] General Discussion","up_votes":3,"down_votes":1,"body":"FIsh oil supplements aren&#039;t just composed of Omega 3s they&#039;re a mix of varying fatty acids depending on the supplement you bought and the fish they came from. _**So which of the ingredients in fish oil is actually causing the smell?**_\r\nSome fish oil supplements are advertised as odorless, but I&#039;ve never tried any of those.\r\nMost of you don&#039;t know that much about anatomy, biology or chemistry, so here&#039;s a little bit of background info.\r\n\r\n\r\n**Fish oil usually comes from** the salmon, herring, mackerel, anchovies, and sardines since these are cold-water, oily fishes. \r\nThese fish don&#039;t make Omega 3 in them, but they consume it from algae that produce omega 3, and other fish that eat the algae that produce omega 3. \r\n\r\n**There&#039;s three types of Omega 3**: EPA, DHA, and ALA.  ALA stands for  &alpha;-linolenic acid and its usually found in plants.  EPA  stands for  eicosapentaenoic acid,  and DHA stands for  docosahexaenoic, acid  its usually found in marine oils.  Your body can convert ALA into EPA and DHA.\r\nEPA and DHA are the types you actually need. Without any omega 3 at all, ever in your diet you can actually get sick.  Most of you get small amounts of it even when you don&#039;t take supplements.\r\n\r\nOmega 3 oil reduce inflammation in your body and lower your &quot;bad&quot; cholesterol (LDL).  Also, DHA is needed for your brain&#039;s structure.  They&#039;re also supposed to improve blood circulation but according to this wikipedia page, theres not much evidence for them actually preventing heart attacks or strokes.\r\nhttps://en.wikipedia.org/wiki/Omega-3_fatty_acid\r\nWikipedia is actually reliable most of the time, and I don&#039;t feel like hunting down journal articles right now.   \r\nPersonally, I notice that large doses of fish oil reduce my inflammation to the point where I don&#039;t get sore after exercising until another day. So for me it delays pain.\r\n\r\nFish oil supplements can also have varying levels of cholesterol and Omega 6 fatty acids.  Also the gel capsule of the supplement may prevent you from absorbing the Omega 3.   If you want to absorb more you should drink it in a liquid form along with a meal. \r\n\r\nHopefully all this background info will help us find where the smell comes from.  Also, I notice that Linseed oil and plant oils high in APA omega 3 don&#039;t have the fish odor.","replies":[]}