{"poster":"Daru Kun","date":"2016-09-06T16:31:26.181+0000","title":"Zed in Late Game","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"In questi giorni, dopo aver ripreso dopo tanto tempo Zed, ho notato che in late non riesco a fare danno, nonostante in early io riesca a praticamente shottare la gente. Ho provato a comprare {{item:3036}} per cercare di avere pi&ugrave; penetrazione armatura, ma non sono neanche riuscito a togliere un quarto di vita ad una sottospecie di tank usando tutte le skill (ulti compresa).\r\nAdesso chiedo a voi pi&ugrave; esperti, qual &egrave; il mio problema?","replies":[{"poster":"zYaichi","date":"2016-09-06T18:30:59.866+0000","up_votes":2,"down_votes":0,"body":"Zed è un assassin e ha principalemente burst ,c'è bisogno di dps che di solito hanno gli adc, se propio il loro team è pieno zeppo di tank io proverei {{item:3153}} + {{item:3071}} + {{item:3035}} ma solo se il team nemico ha 3 o 4 tank","replies":[]},{"poster":"Laiho88","date":"2016-09-06T16:32:24.405+0000","up_votes":2,"down_votes":0,"body":"il problema è che devi focussare gli adc e apc, ovvio che tank e bruiser non li shotti.....","replies":[{"poster":"Daru Kun","date":"2016-09-06T16:36:21.983+0000","up_votes":1,"down_votes":0,"body":"Quando è presente solo un tank però? meglio ritirarsi?","replies":[{"poster":"ilsimptico","date":"2016-09-06T17:59:12.882+0000","up_votes":1,"down_votes":0,"body":"Io non sono un espertissimo di zed, ma ti direi di non farli un all-in, ma di picchiarlo da lontano con Q, o magari piazzando un ombra ogni tanto, provando a levargli vita, ma fargli un engage completo sarebbe solo uno spreco","replies":[{"poster":"Mytlix","date":"2016-09-06T18:35:10.565+0000","up_votes":1,"down_votes":0,"body":"Stiamo parlando di late game quando il game diventa un aram dove i due team si fightano,quello che stai parlando te è la laning-phase.","replies":[]}]},{"poster":"Linner97","date":"2016-09-06T17:49:59.436+0000","up_votes":1,"down_votes":0,"body":"Ovvio, Zed non è fatto per subire tanti danni quindi ti ritiri dal tuo team e durante il fight come ti hanno suggerito devi far esplodere gli ad/ap carry nemici e poi concentrarvi sul tank. \nEsempio:ho visto un rengar che aveva parecchie kill e farm ma ha perso perché ha ingaggiato un Malphite che col giro di spell e ignite ha preso la kill.","replies":[]}]}]},{"poster":"Torzolone","date":"2016-09-07T18:23:07.928+0000","up_votes":1,"down_votes":0,"body":"Io ogni volta che vedo Zed o con me o contro ne prende sempre tantissime....\nUna delle poche certezze.\nYasuo ogni tanto uno buono lo trovo ma Zed sono tutti sacchi da boxe...","replies":[]},{"poster":"Laiho88","date":"2016-09-06T17:23:55.499+0000","up_votes":1,"down_votes":0,"body":"aspetta qualche altro commento, magari ti danno dritte migliori ;)","replies":[]},{"poster":"Laiho88","date":"2016-09-06T16:56:42.197+0000","up_votes":1,"down_votes":0,"body":"In questo gioco ognuno ha il suo ruolo: tu devi focussare l'adc o l'apc, il resto è facoltativo e dipende dalla situazione: ho energy a sufficienza e le spell pronte? Il mio team ha bisogno ancora di un pò di aiuto? in questi casi tendo a rimanere col team, (non molto però, zed è anche un ottimo splitpusher) in caso contrario me ne vado immediatamente a splitpushare le altre lane....Tank e bruiser li lascio agli adc tranne rare eccezioni....","replies":[{"poster":"Daru Kun","date":"2016-09-06T17:01:07.105+0000","up_votes":1,"down_votes":0,"body":"Ok, capisco, grazie mille dell'aiuto :)","replies":[]}]}]}