{"poster":"DUTYIMADAR","date":"2016-03-29T13:40:08.685+0000","title":"Dynamic Queue","subforum":"Csapat- és csapattagkereső","up_votes":1,"down_votes":0,"body":"Please, Riot Games! Improve dynamic queue! I have lost countless matches,because the players of the games,had quite the differences between their elos. For E.g: We had a darius top,enemy had a yasuo. The yasou was in Gold 4 division last season, our darius was silver 5,now he is bronze 2. The enemy top laner,yasuo, was in 10/0 at about 12 minutes,rolling the game to the not fun-side. These differences are annoying,and usually really hard to deal with. I know it is not always bad but it is still unfair for either us,or the enemy team. The reason I am typing this,is the fact that I am not alone with this kind of problem,and I would like you,readers,to help each other out,because I know you have probably experienced the same kind of situation. Thank You everyone  for reading this,and good luck on the Fields of Justice!","replies":[{"poster":"Mind The Gap","date":"2016-03-29T14:15:25.468+0000","up_votes":1,"down_votes":0,"body":"Jó. De miért írsz angolul?","replies":[{"poster":"DUTYIMADAR","date":"2016-11-14T15:56:27.337+0000","up_votes":1,"down_votes":0,"body":"Asszem nem esett le,hogy a magyar lol átvette a hatalmat :D","replies":[{"poster":"Mind The Gap","date":"2016-11-14T16:13:53.687+0000","up_votes":1,"down_votes":0,"body":"Ohhohó, de még mennyire! Magyar support, magyar fórum, meg az egyéb hasonlók. Még az ajándékbolt nem magyar csak.","replies":[]}]}]},{"poster":"M4dr4c","date":"2016-03-29T16:09:51.168+0000","up_votes":1,"down_votes":1,"body":"tl;dr\nKikaptál és ez a Dynamic Queue hibája.","replies":[{"poster":"DUTYIMADAR","date":"2016-10-27T15:12:30.529+0000","up_votes":1,"down_votes":0,"body":"Ha mondjuk elolvasnád,akkor leesne,hogy nem ez a helyzet","replies":[{"poster":"M4dr4c","date":"2016-10-27T15:19:42.066+0000","up_votes":1,"down_votes":0,"body":"Talán, ha elolvasnád a ranked rendszer leírását leesne, hogy nem a rankok, hanem az MMR alapján rakja össze a csapatokat. Akár egy bronz is lehet a challanger közt, ha megvan az MMR-je hozzá (Koreában valami őrült meg is csinálta).","replies":[{"poster":"DUTYIMADAR","date":"2016-11-14T15:57:44.385+0000","up_votes":1,"down_votes":0,"body":"Mégis,hogy lehet egy  ~valami~2008 nevű,kiscsávónak goldos mmrje van? Nekem a bajom azzal van hogy ha ez így is van ahogy leírtad,akkor nagyon széles lehet az a sáv amin belül összedobja a játékosokat a rendszer. Nagyon gyakran van,hogy a csapattársakkal nem lehet szót érteni és kisgyerekek vagy azokként viselkednek és elrontják a játékot. Remélem most a 7.szezonra változtatnak ezen","replies":[]}]}]}]}]}