{"poster":"Good Guy TwoSick","date":"2015-12-23T11:24:42.864+0000","title":"2 Computer, selber Router, verschiedene Pings","subforum":"Hilfe & Support","up_votes":2,"down_votes":2,"body":"Hallo zusammen, seit einigen Tagen habe ich folgendes Problem:\r\n2 Computer sind mit demselben Router verbunden, bei dem einen habe ich ingame konstant 18 Ping,\r\nbei dem anderem schwankt er zwischen 40 und 50. Ich w&uuml;rde gerne den anderen PC auch auf konstante 18 Ping bekommen.\r\nBin dankbar f&uuml;r jeden L&ouml;sungsansatz!","replies":[{"poster":"Patty91","date":"2015-12-23T11:28:58.435+0000","up_votes":2,"down_votes":0,"body":"Netzwerkkarte vom anderen Rechner geprüft? Laufen andere Dinge im Hintergrund? LAN-Kabel ausgetauscht? LAN-Port getauscht?","replies":[{"poster":"Good Guy TwoSick","date":"2015-12-23T12:06:46.439+0000","up_votes":1,"down_votes":0,"body":"ich hab bei verschiedenen seiten nen internetspeedtest gemacht, downloadrate, uploadrate und ping sind identisch, auschließlich bei lol unterscheidet sich der ping stark","replies":[{"poster":"Patty91","date":"2015-12-23T12:09:36.155+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Coach TwoSick,realm=EUW,application-id=7hciEY9w,discussion-id=66yaRdFb,comment-id=00000000,timestamp=2015-12-23T12:06:46.439+0000)\n>\n> ich hab bei verschiedenen seiten nen internetspeedtest gemacht, downloadrate, uploadrate und ping sind identisch, auschließlich bei lol unterscheidet sich der ping stark\n\nDie Speedtests kannste in die Tonne kloppen. Richtig über die DOS-Oberfläche den Router anpingen, (Windows-Taste + r, cmd eintippen, dann ipconfig /all, damit du die IP deines Routers bekommst und dann den Router mittels ping \"IP\" (ohne \"\" und die IP dann tippen) anpingen), kann sehr gut sein, dass zwischen Router und PC iwas nicht hinhaut. Eigentlich sogar 100%. Danach mal den LoL-Server, da kenn ich die IP nicht.\nRausbekommen, ob Netzwerkkarte kaputt ist oder die Leitungsgeschwindigkeit überhaupt packt. Wie mit dem Router verbunden? Falls LAN, Kabel ausgetauscht? LAN-Port getauscht? Falls W-LAN, auf LAN wechseln. Rausbekommen, was im Hintergrund auf dem Rechner läuft. etc.","replies":[{"poster":"Good Guy TwoSick","date":"2015-12-23T14:49:31.109+0000","up_votes":1,"down_votes":0,"body":"hab meinen router angepingt, 0 ms. Bei dem LoL Server sind es 23 ms. Habe keine Kabel zum Tauschen da, werde das wohl morgen als erstes in Angriff nehmen.","replies":[]}]}]}]},{"poster":"Alustus","date":"2015-12-23T12:11:33.376+0000","up_votes":1,"down_votes":0,"body":"Wenn sie nicht die selbe hardware haben nichts ausergewöhnliches.\n\nSeid ihr mit Wlan im internet oder mit kabel.\nWenn mit kabel mit dem selben?\n\nSeid ihr mit dem W-lan mit dem Internet verbunden\nDas kann jetzt an der Netzwerkkarte liegen, dann könnte ein USB Adapter helfen.","replies":[]},{"poster":"Megamaexx","date":"2015-12-23T11:37:23.265+0000","up_votes":1,"down_votes":2,"body":"Ich hab da was ähnliches. Mein PC hat einen ping von 30 und der meiner Freundin einen von 40. Sie hatte denselben ping über WLAN mit ihrem laptop sowie über kabel mit ihrem jetzigen PC","replies":[]}]}