{"poster":"Souta Ito","date":"2015-12-11T19:22:44.177+0000","title":"Mystery Champion Box","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo! Ich habe folgendes Problem, ich kann keine Mysterie Champion Boxen mehr kaufen oO.\r\n&quot;In order to unlock a mystery item your available items pool needs to be 10, and currently your available items pool is 9.&quot;\r\nIch bin der Meinung mein Englisch ist gut genug um zu verstehen was diese Nachricht mir sagen m&ouml;chte ... Trotzdem stehe ich auf dem Schlauch.\r\nHabe ich noch nie gehabt, noch nie gesehen und im Internet finde ich dazu in den Englischen Foren auch keine Antwort.\r\nW&auml;re freundlich wenn mir jemand erl&auml;utern k&ouml;nnte wieso ich keine weiteren Mystery Boxen erwerben kann.\r\n\r\nMit freundlichen Gr&uuml;&szlig;en, Souta Ito.","replies":[{"poster":"Busty Botter","date":"2015-12-11T19:31:38.596+0000","up_votes":2,"down_votes":0,"body":"Du kannst Mystery Boxen nur kaufen wenn dir 10 oder mehr fehlen Champs/Skins je nach Box. Fehlen dir aber nur mehr 9 oder weniger Champs in deinem Fall, kannst du keine Boxen mehr kaufen.\n\nDamit will Riot verhindern, dass man teure Champs billig bekommt. Ebenso bei Skins, dann würden sich viele auf einem neuen Account zB nur Cho kaufen und hätten relativ billig 2 Legendary Skins oder NUR Udyr und eine hohe Chance auf einen billigen Ultimateskin usw...","replies":[{"poster":"Souta Ito","date":"2015-12-11T19:33:47.809+0000","up_votes":1,"down_votes":0,"body":"@Busty Rotter, vielen Dank für deine Antwort.\nOK, klingt pausibel ... allerdings fehlen mir noch 12 Champions, damit sollte ich doch noch 2 weitere Gifts erhalten \"dürfen\" oder etwa nicht?\n\nLiebe grüße ~","replies":[{"poster":"Busty Botter","date":"2015-12-11T19:36:02.531+0000","up_votes":2,"down_votes":0,"body":"Hast du auch bedacht, dass die dir fehlenden Champions teurer sein müssen als die Mystery Box?","replies":[{"poster":"Souta Ito","date":"2015-12-11T19:38:27.605+0000","up_votes":1,"down_votes":0,"body":"Oh! Stimmt 3 von den Champions die mir fehlen sind im Angebot ... ok, mein Fehler :)\nDanke für deine Schnelle Antwort & Hilfe - wünsche dir einen schönen Abend und gutes gelingen in der Kluft der Beschwörer.\n\nLiebe grüße, ~","replies":[]}]}]}]}]}