{"poster":"Shiyo18","date":"2015-08-09T20:41:22.141+0000","title":"Mankivia","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Hola, emm me gusta mucho usar a anivia, de hecho es mi &quot;main&quot; pero no entiendo por qu&eacute; riot nunca le ha hecho alg&uacute;n buff o nerf ni nada :c , solo le ha cambiado el splash y era xd, deber&iacute;an mejorarle lo visual y nose ponerle un rasho de hielo como un articuno :v jajaaj , eso :3","replies":[{"poster":"Main Lee Cýrus","date":"2015-08-09T21:56:43.702+0000","up_votes":1,"down_votes":2,"body":"No entiendo como maineas anivia te juro q cada partida q jugue con anivia me fue para el .... me puedo sacar una enta con urgot y con anivia nda ni contra bots u.u","replies":[{"poster":"tete de la pobla","date":"2015-10-01T00:22:16.074+0000","up_votes":1,"down_votes":0,"body":"Yo aprendí a jugar LOL con anivia, eso implica aprender a farmear, pushear entre otras cosas (aunque sigo aprendiendo :3) y no entiendo como es tan inpopular nunca e jugado en contra de una, por esto creo que le falta un buff que la deje dentro del meta actual\nPD: es mi main y me encanta su murito explosivo:3","replies":[]},{"poster":"Revolución","date":"2015-08-10T02:26:41.982+0000","up_votes":1,"down_votes":0,"body":"es práctica, yo tengo un pentakill con Anivia, si te sirve de ejemplo (lo malo es que fue en modo hexakill).","replies":[]}]},{"poster":"Revolución","date":"2015-08-10T02:30:03.829+0000","up_votes":1,"down_votes":0,"body":"No creo que Anivia necesite algún buff especialmente. Creo que es un campeón que está muy balanceado y en buenas manos puede ser muy fuerte, que lo único que no ha tenido quizás es ese momento de ser el campeón abusivo del parche como otros. {{champion:60}}","replies":[]},{"poster":"ALEXKOND","date":"2015-08-09T22:51:48.576+0000","up_votes":1,"down_votes":0,"body":"Deben considerar que esta balanceada y que no necesita cambios de momento. Tengo un conocido (no es amigo, simplemente nos encontramos seguido en Creador de Equipos) que lo que juega con Anivia mete miedo.\nCoincido en que una actualización visual no le vendría nada mal, aunque hay campeones que lo necesitan mucho más antes que ella.","replies":[]},{"poster":"Silver000","date":"2015-08-09T22:20:53.185+0000","up_votes":1,"down_votes":0,"body":"jajaja es que para riot esta balanceada","replies":[]},{"poster":"juuby","date":"2015-08-09T21:45:53.566+0000","up_votes":1,"down_votes":0,"body":"un rasho de articulo mmmmm","replies":[]},{"poster":"Il Bardolino","date":"2015-08-09T21:03:40.565+0000","up_votes":1,"down_votes":0,"body":"Porque no los necesita, ni nerf ni buff. Un early bastante pobre con un late MUY bestia y uno de los burst mas fuertes del juego. Si bien no esta 100% dentro del meta, los cambios a los items de AP sin duda la beneficiaron.","replies":[]}]}