{"poster":"SORA MASTER OF K","date":"2017-09-16T07:50:37.218+0000","title":"Aiuto per tasti della tastiera","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve, chiedo aiuto perch&eacute;, ultimamente ho notato che ho difficolt&agrave; a cliccare alcuni tasti per gli item attivi o le spell dell&#039;evocatore.\r\nEs. Ieri ho usato ryze Vs gp mid avevamo la stessa vita, io crepo, motivo? Non ho cliccato in tempo il barrier. \r\nAltro es. Uso sempre ryze mi fanno un gank vado nel panico e uso la zhonya prima di attivare la ulti e crepo.\r\n\r\nOra qualcuno ha qualche consiglio per il riposizionamento dei tasti, perch&eacute; attualmente uso le impostazioni standard: cio&egrave; qwer per le abilit&agrave; 123567 item 4 Ward d ed f per le spell evocatore. Cos&igrave; riesco solo ad avere le quattro di ta della mano sinistra sulle abilit&agrave; pi&ugrave; pollice su d ed f e riesco solo a cliccare 2 e 3 per gli item senza spostare la mano. Grazie in anticipo.","replies":[{"poster":"1921 Nobel","date":"2017-09-16T11:51:37.963+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"SORA MASTER OF K","date":"2017-09-16T21:00:58.615+0000","up_votes":1,"down_votes":0,"body":"Uso di fisso.","replies":[{"poster":"Mh012","date":"2017-09-16T21:20:46.404+0000","up_votes":1,"down_votes":0,"body":"Se hai uno fisso penso che di tastiera dovresti comprarla piccola e compatta, in modo che tu possa switchare velocemente le dita.","replies":[{"poster":"SORA MASTER OF K","date":"2017-09-16T22:30:45.291+0000","up_votes":1,"down_votes":0,"body":"Ok grazie del consiglio^^.","replies":[]}]}]}]},{"poster":"Mh012","date":"2017-09-16T10:53:35.722+0000","up_votes":1,"down_votes":0,"body":"Ti ci abbituerai. Di solito si mettono tre dita fisse su Q-W-E, il mignolo su Tab, il pollice tra D-Barra-Ctrl. Il medio è perfetto per cliccare sulle attive dell'1-2-3 e l'indice sul 4 del trinket. Sai che si può spostare l'ordine degli item nell'inventario vero?\n\nSe vuoi, puoi mettere gli item con attive sopra le spell che non hanno una grande \"importanza\" (Tiamat sul 2 con warwick...).","replies":[{"poster":"SORA MASTER OF K","date":"2017-09-16T11:07:40.610+0000","up_votes":1,"down_votes":0,"body":"Si prima o poi mi ci abituerò ma solo pensare che un trynda al livello 5 lo potevo Killare semplicemente premendo la tiamat mi viene l'ulcera -.-","replies":[]}]},{"poster":"Philippicus","date":"2017-09-16T08:42:00.635+0000","up_votes":1,"down_votes":0,"body":"Io personalmente preferisco usare la tastiera ma tu forse potresti trovarti meglio con un mouse con qualche tasto aggiuntivo su cui piazzare gli oggetti attivi","replies":[{"poster":"SORA MASTER OF K","date":"2017-09-16T09:53:50.797+0000","up_votes":1,"down_votes":0,"body":"Io mi trovo con la tastiera e appunto ho chiesto se qualcuno conosce un'altro set di tasti^^.","replies":[]}]}]}