{"poster":"Twisted Fate BOT","date":"2017-03-29T01:45:20.585+0000","title":"Silenciar voces del juego","subforum":"Charlas Generales","up_votes":3,"down_votes":3,"body":"No creo ser el &uacute;nico en la comunidad de LOL que piensa que algunas frases o sonidos del juego a la hora de jugar una partida suelen ser demasiado molestos y llegar a desconcentrarnos (capaz que a los de las ligas altas no, pero en mi caso que no llego ni a bronce si)\r\nAlgunos ejemplos de esto son las frases autom&aacute;ticas de por ejemplo {{champion:68}} Supergalactico que cada vez que lanza una habilidad dice alguna que otra frase que si bien al principio es buena, al tener el cuenta que la fase de carriles dura 20 min (creo, corr&iacute;janme si me equivoco) llega a irritar bastante. Otro puede ser tambi&eacute;n el caso de los b&aacute;sicos de {{champion:222}} Guardiana estelar, que hay algunos jugadores que tambi&eacute;n les molesta que al llegar al late y que la famosa tablita se transforme en la torreta letal de 2.5 b&aacute;sicos por segundo, ese sonido es como una campana que se empe&ntilde;a en romper t&iacute;mpanos. O el ejemplo mas com&uacute;n y el que mas irrita a la mayor&iacute;a, que es el t&iacute;pico jugador que abusa del tanto de la risa/broma/provocaci&oacute;n de su campe&oacute;n ({{champion:27}} el se maneja a trav&eacute;s de esto, pero no me molesta tanto como un {{champion:12}} record&aacute;ndome cada 2 segundos que no puedo orde&ntilde;arlo)\r\nLo que quiero llegar es &iquest;Hay alguna manera de bloquear esos sonidos/frases SIN necesidad de bajar el sonido del apartado de voces del juego?&iquest;O como dice el dicho, agua y ajo (AGUAntarse y AJOd@rse)?\r\n\r\nPs=&iquest;Qu&eacute; sonido o frase te molesta a la hora de jugar?","replies":[{"poster":"Ufaaaaaaaaaa","date":"2017-03-29T02:17:22.815+0000","up_votes":4,"down_votes":0,"body":"no se si es en serio o en chiste, pero si es en serio, en opciones (dentro de una partida , apretando ESC) vas a la pestaña de \"sonido\" y hay una parte que dice \"volumen de la voz\", bajas eso y no escuchás nada de lo que dicen los campeones (el anunciador tiene un slider aparte).","replies":[{"poster":"Hell Darking","date":"2017-03-29T02:28:37.951+0000","up_votes":2,"down_votes":0,"body":"yo quiero que al a opcion de voz se le pueda dar mas volumen ; - ; lo tengo al maximo (y todo lo demas mas bajo) y aun asi casi ni se escucha","replies":[{"poster":"Caraxes","date":"2017-03-29T05:36:44.225+0000","up_votes":1,"down_votes":0,"body":"Baja el resto y amplifica el sonido desde realtek.","replies":[]}]}]},{"poster":"Luxaryon","date":"2017-03-29T02:18:05.515+0000","up_votes":1,"down_votes":0,"body":"Me molesta la risa de Veigar cuando tira la ultimate, el sonido de la W de Warwick, aunque éste sí es útil, pero le bajaría el sonido. También me molesta mucho la risa de Lulu.","replies":[]},{"poster":"Maycoltf2","date":"2017-03-29T01:51:53.167+0000","up_votes":1,"down_votes":0,"body":"La risa de Lulu.","replies":[]},{"poster":"Charlôtte","date":"2017-03-29T01:49:58.087+0000","up_votes":1,"down_votes":0,"body":"No lo hagas, sino no vas a escuchar mis risas con Lulu. Jamás bajes el volumen a las voces","replies":[]}]}