{"poster":"Tschelsen","date":"2015-07-14T09:11:07.634+0000","title":"Sion Supp / Allgemeine Tips und Tricks","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Hello Guys\r\n\r\nSpiele auf meinem Smurf (dieser Name / Gold 3) gerade ein wenig Sion Supp und das relativ erfolgreich. Da ich auf dem Account kaum Champions besitze, geschweige denn Runen(-Seiten) beschr&auml;nk ich mich auch vorwiegend auf die Rollen Toplane, Jungle und Support. Was k&ouml;nnte ich bez&uuml;glich Runen/Masteries noch verbessern bzw. findet ihr Sion Support viable? Werde n&auml;mlich ausnahmslos angeschnauzt in der Champselect. \r\n\r\nAusserdem w&auml;re ich dankbar, wenn ihr mir noch ein paar Champs vorschlagen k&ouml;nntet, die ich mit den derzeitigen Runen spielen kann. \r\n\r\nDanke und Gr&uuml;sse\r\nTschelsen","replies":[{"poster":"Marksmansitter","date":"2015-07-20T03:34:12.487+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/HjcGEL54-sion-support\nhier findest du vllt etwas auf deine fragen :) hab mir das auch vor 4 Monate gefragt :p","replies":[]},{"poster":"Busty Botter","date":"2015-07-17T14:58:53.871+0000","up_votes":1,"down_votes":0,"body":"Ich halte nicht viel von Sion Support, der CC durch seine Q ist zu vorhersehbar, das Schild bringt nur ihm etwas, Leben kann er kaum stacken, dein einziger \"poke\" wäre mit E, wo du dem ADC aber wahrscheinlich mehr Farm verhaust als du poken kannst. Einzig die Ulti ist gut als Support.","replies":[]},{"poster":"MeIsTeR MaNne","date":"2015-07-14T15:55:41.821+0000","up_votes":1,"down_votes":0,"body":"Das Problem bei Sion Supp besteht ist dass er glaub durch die passive w Leben stackt was ihm ordentlich Leben gibt und er dadurch echt tanky wird aber wenn er die Vasallen abfarmt bekommt der adc weniger und ist sauer/underfarmed. Also entweder Sion ohne Farm was ihm Leben wegnimmt das er haben könnte mit Farm oder der adc ohne Farm und dadurch weniger Damage als möglich. Nicht optimal. Meiner Meinung nach.","replies":[{"poster":"Tschelsen","date":"2015-07-17T14:51:43.682+0000","up_votes":1,"down_votes":0,"body":"Und wie steht es um den Toplane-Sion?\nDanke für die Hilfe!","replies":[]}]}]}