{"poster":"Swingingthesalt","date":"2016-05-05T20:49:43.898+0000","title":"Zufalls-Drachen","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":0,"body":"Hallo Forum,\r\n\r\nich bin ehrlich gesagt ziemlich genervt von den neuen &quot;Zufalls-Drachen&quot;. Ich hatte mittlerweile bereits mehrere Spiele in denen viel zu oft hintereinander der selbe Typ gespawnt ist. An sich ist das ja noch kein Problem, aber wenn dann 2 oder 3 Feuerdrachen hintereinander spawnen und das eigene Team oder eben das gegnerische 2 erhalten wird es extrem unsch&ouml;n. Mit den ganzen prozentualen Buffs gewinnt man einen VIEL zu gro&szlig;en Vorteil gegen&uuml;ber dem anderen Team. Der Uralte Drache setzt dem ganzen dann noch Gnadenschuss.\r\n\r\nIch bin der Meinung das Spiel hat mit der Einf&uuml;hrung dieser Drachen enorm viel Konsistenz eingebu&szlig;t und ist in diesem Zustand nicht mehr wirklich kompetitiv oder ernst zu nehmend &quot;E-Sports&quot; tauglich. Kurz gesagt RNG hat ma&szlig;geblich einzug erhalten und ich bin der Meinung das hat in einem skill-basiertem Spiel einfach nichts zu suchen.\r\n\r\nDies ist nat&uuml;rlich nur meine Meinung und ich bin auf eure gespannt und w&uuml;rde gern mit euch &uuml;ber die neuen &quot;Zufalls-Drachen&quot; diskutieren!","replies":[{"poster":"HHaie tabbian","date":"2016-05-06T05:21:17.268+0000","up_votes":4,"down_votes":0,"body":"Ich sehe eins der Hauptprobleme darin, dass in einem Spiel nur 3 der 4 Drakes spawnen können. Wenn man dann bestimmte Teamcomps, z.B. splitpush, aufstellen möchte, hat man in dem Moment noch gar keine Ahnung, ob der Drake, von dem die comp stark profitieren würde, überhaupt erscheint. \nIch finde, es sollte erstens in der Champselect bekannt sein, welche Drachen erscheinen können und zweitens auch in welcher (zufälligen) Reihenfolge. Dann könnte man sich eher darauf einstellen, was einem im Spiel erwartet.","replies":[{"poster":"Spicavius","date":"2016-05-11T23:23:57.483+0000","up_votes":1,"down_votes":0,"body":"Das wäre eine super Idee.","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2016-05-05T23:47:06.144+0000","up_votes":2,"down_votes":0,"body":"naja... ein Team dass den Kampf um die Drachen (also Neutral-Objectives) mit 4-0 für sich entscheidet, gewinnt jetzt wieder, auch wenn es dafür Farm und ein paar Kills abgibt... ist zumindest meine Erfahrung des heutigen Tages, an dem ich 3 von 4 Spielen über die Drachen entschieden habe, obwohl mein Team nach Gold und Kills leicht hinten lag... Auf dem alten Patch hätte ich diese Spiele wahrscheinlich verloren, weil die Drachen 2 bis 4 den Aufwand nicht wert gewesen wären, den wir dafür betrieben haben...\nUnd neutrale Objekte sind die Würze in League of Legends. Wenn diese uninteressant werden und das Spiel nur noch (wie es für mich bisher in dieser Saison war) aus der Laningphase und aus Lategame Teamfights besteht, wird das Spiel halt auch statischer und damit langweiliger...\n\nUnd dass soll jetzt schlechter und vor allem weniger \"eSports\" tauglich sein? Warum? Weil es nicht mehr nur 1 wirklich relevanten Drachen gibt (den 5., um aller vorherigen wird nicht wirklich bis aufs Blut gekämpf) um den man sich als Profi kümmern muss... während alle anderen Drachen viel zu irrelevant sind als das man darum kämpfen würde?\n\nGanz ehrlich: Das neue Drachensystem wird gerade der Profi-Szene so gut tun... Also nicht unbedingt den Spielern, aber uns als Zuschauern, die relativ wenig Bock auf 20-30 Minuten Laneswaps und Minionverschiebungen und dann einen großen Teamfight (der dann meistens durch die strategischen Verschiebungen, die wir nicht nachvollziehen können) entschieden wird...\n\nUnd wenn du wirklich wissen willst, wie schlimm es bei den Profis gerade ist... [dann gucke dir das Spiel 1 der LCK Finals an](http://matchhistory.na.leagueoflegends.com/en/#match-details/TRKR1/1041038?gameHash=1a90fd277fa74e7f&tab=overview)... Das Spiel wurde gewonnen, weil der Ezrael 2 Summoner Spells auf Level 1 verbraucht hat... Der ist noch nicht mal gestorben... dieser Nachteil war so \"krass\", dass SKT dadurch das gesamte Spiel gesnowballed hat und Rox Tigers (seinerseits das vielleicht beste Team der Welt) NICHTS dagegen machen konnte... \n\nWeil SKT halt das ganze Spiel über komplett durch planen konnte und diesen Plan nur noch umsetzen musste... Das wird jetzt nicht mehr gehen und das wird so viel frischen Wind in die LCS bringen, dass es sich auch wieder lohnt da einzuschalten...\n\nDer alte Drache war halt viel zu irrelevant. Klar, der 5. bekommen war immer geil, aber wie oft kriegt man das (gerade in der SoloQ) hin? Jetzt kriegt man wieder sofort Effekte, die einem sofort weiterhelfen. Damit lohnt es sich auch für uns SoloQ Spieler wieder auf den Drachen zu achten...\n\nWas ich wesentlich schlimmer finde ist der neue Riftherald... denn es kann dir passieren, dass deine Toplane einen Trade verliert, recallen muss und der Gegner dadurch für 20 Minuten diesen übelst mächtigen Buff bekommst... und du hast nicht mal eine Chance, was dagegen zu tun...\n\nAber an der Stelle spricht auch jemand, der über die Strategie und nicht über das 2vs2 als Support Main kommt und der deswegen von den neuen Drachen profitieren wird (Yeah, ich kann endlich wieder Janna spielen und durch Wards Spiele gewinnen!!! Oder als Nunu Jungle Spiele dominieren, in denen ich 2 Mal auf den Lanes auftauche und immer genau da bin, wo der gegnerische Jungler nicht ist... meine Traumvorstellung von League of Legends...)... ein Spieler, der ein brillanter Laner ist aber seine Schwächen in den Global Movements hat, wird das natürlich anders sehen...\n\nWas mir zum Beispiel sofort aufgefallen ist: Alle Spieler warden mehr. Ok, in dem Janna Spiel habe iche meine Ward Statistiken künstlich nach oben getrieben, weil es sonst so schnell vorbei gewesen wäre, dass ich nicht auf meinen normalen Schnitt gekommen wäre... Aber ich hatte ein SoloQ Spiel, in dem [der Wardbattle 113 zu 122 für uns ausging](http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2649784894/21830463?tab=overview)... ohne Pink Wards... Wann habt ihr das letzte Mal ein SoloQ Spiel mit 235 Wards gespielt? Season 3 vielleicht, wenn ihr da einen übermotivierten Support in eurem Team hattet...\nNun ist meine eigenes Warding natürlich ziemlich absurd... aber dass meine Teams 2 (seriöse) Spiele in Folge auf über 100 platzierte Wards kommen, liegt nicht nur an mir... sondern auch daran, dass ich nicht mehr der Einzige bin, der sich Sorgen um den nächsten Drake macht...","replies":[{"poster":"Kakerlaknschwarm","date":"2016-05-12T20:38:25.172+0000","up_votes":1,"down_votes":0,"body":"Netter Kommentar, echt.\nIch begrüße es auch, dass der Drake wieder mehr Priorität hat, aber trotzdem.\n\nDu kannst ein Spiel verlieren, weil du das Glück hast, dass die zwei Drakes, die dein Team ergattern kann, beide Feuerdrachen waren.\nDas Gegnerteam hatte Pech und hat einen weißen und einen braunen gekriegt.\nUnd so wird ein ausgeglichenes Spiel im späteren Spielverlauf total unausgeglichen weil das eine Team im Fight 16% mehr offensive Werte hat und das andere im Fight an sich überhaupt nicht von den Drachen profitiert. Auch ohne Elder Dragon oder einen Goldrückstand.\nAuch bei gleich gut scalenden Teamkombinationen.\n\nKlar, Wahrscheinlichkeitsrechnung, mir passiert so oft wie jedem anderen auch.\nIn der Promo ist das trotzdem ärgerlich.\nOder auf den World Finals im 5ten Spiel im Finale.","replies":[{"poster":"MeMyselfandBaal","date":"2016-05-12T21:17:21.207+0000","up_votes":1,"down_votes":0,"body":"Naja... du hast halt in deiner Promo (oder im 5. Spiel des WM Finales) 6 Minuten Zeit dich darauf vorzubereiten, dass der Gegner seinen 2. Feuerdrachen nicht bekommen wird. Dann musst du als Toplaner halt mal auf deine Lane laufen. Und der Support muss halt entsprechende Wards platzieren, damit der Teleport auch genutzt und das Terrain makiert werden kann... und jeder muss auf seinen Flash und seine Ulti aufpassen... Und ja, Riot hat es bewusst so angelegt, dass der Cooldown von Summoners geringer ist als der Drachenrespawn. Ihr habt also alle die Chance in voller Ausrüstung zum entscheidenden Drachenkampf zu kommen...\n\nAber ganz ehrlich: In meinen Spielen hatte die Drachenverteilung (auf die Teams gesehen) sehr wenig mit Glück zu tun. Das in dem Moment besser positionierte Team hat sich den Drachen gesichert. Und wenn es in einem an sonsten ausgeglichenen Spiel der Gegner hat besser geschafft hat, sich die entscheidenden Drachen zu sichern, dann gewinnt der das Spiel halt... \nDu tust gerade so, als würde man nach dem gewonnenen Smite Battle festgelegt werden um welchen Drachen es gerade ging. Aber das weißt du halt im voraus...\n\nUnd ja, es wäre ärgerlich, wenn man sein Promo Spiel wegen der Feuerdrachen verliert. Aber ganz ehrlich: Ist es nicht genau so ärgerlich, wenn du das Spiel wegen eines Smite Steals beim Baron abgibst? Willst du deswegen den Baron abschaffen? Oder sagst du an der stelle nicht nur \"GG Outplayed\"?","replies":[{"poster":"Kakerlaknschwarm","date":"2016-05-12T22:09:37.247+0000","up_votes":1,"down_votes":0,"body":"Ja, sicher.\nAber geh mal davon aus, dass das Game sehr eng ist, und auf jeder Seite in insgesamt 4 Teamfights am Drake immer ein paar kleine Fehler geschehen, die das andere Team den Fight gewinnen lassen.\nJeweils 2 mal.\n\nUnd ja, vielleicht hätte man einfach keine Fehler machen dürfen und alle 4 Fights gewinnen müssen.\nAber jeder macht mal Fehler.\n\nNur wann man die macht, sollte bei gleicher Fehlerzahl und ansatzweise gleicher Ausgangslage nicht über ein Spiel entscheiden.\nIst zumindest meine Meinung.\nFrüher war es danach noch even - Seit dem Patch ist es das nicht mehr, und das stört mich.\n\n\nUnd ja, das passiert selten. Aber es passiert und wenn es passiert, finde ich es nicht richtig.","replies":[]}]}]},{"poster":"Dr Ogre","date":"2016-05-06T07:16:39.999+0000","up_votes":1,"down_votes":0,"body":"Starker Kommentar! Gefällt mir sehr und ich muss mich diesem Post auch anschließen, der Drake hat einfach wieder mehr \"Ansehen\" erhalten.\n\nAls Main Jungler gefällt mir das sehr :) \n\nVon den zufälligen Erscheinungen bin auch sehr angetan, wobei ich sagen muss, das mir der Feuerdrache bisher verwehrt geblieben ist.","replies":[]}]},{"poster":"Parunpata","date":"2016-05-06T07:20:39.197+0000","up_votes":1,"down_votes":0,"body":"Hey, die Drachen laufen den Teams ja nicht in die Arme. Man muss immernoch um sie kämpfen bzw. sie verteidigen. Es ist immernoch skill-basiert. Skill-basierter als vorher sogar.","replies":[{"poster":"Iron OTP","date":"2016-05-11T23:07:23.750+0000","up_votes":1,"down_votes":0,"body":"Ja schwer zu sgaen aber mir fehlt iwiwe was vllt. vermisse ich ihn nur ^^","replies":[]}]},{"poster":"Leinhard","date":"2016-05-07T16:58:44.362+0000","up_votes":1,"down_votes":0,"body":"Die Drachenänderung finde ich persönlich gut allerdings sollten die Drachen mindestens so Stark sein dass man schon 2 Leute für die braucht.\nDer Elder Dragon ist auch ein wenig zu schwach ich finde er sollte ungefähr die stärke von Baron Nashor haben.","replies":[{"poster":"Iron OTP","date":"2016-05-11T23:04:50.947+0000","up_votes":1,"down_votes":0,"body":"Naja zu schwach finde ihn aleine wegen zeitaufwand dem Baron gleichgestellt und dmg mäßig naja baron juckt ja auch kaum :P","replies":[]}]},{"poster":"Iron OTP","date":"2016-05-10T23:19:31.460+0000","up_votes":1,"down_votes":0,"body":"Hey\nZu den Drachen, naja ich finde dass neue System leider nicht so dolle. Nicht wegen den Random Spawn sondern finde es toll um jeden drachen zu \"geiern\" und der 5te immer ein fetten Teampfight auslöst.\nMeine Meinung\n\nmfg\n          Mf","replies":[]},{"poster":"SFCFlo","date":"2016-05-06T09:29:25.425+0000","up_votes":1,"down_votes":0,"body":"Also ich persönlich finde die Änderungen am Drachen recht interessant.\nletztes Jahr war es eben so das du mit denn ganzen tanks das spiel so hinaus gezogen hast bis du 5 drakes hattest, dann noch baron und win.\nDieses Jahr war der Drache einfach nur ein kleiner Bonus. Der erste Buff war ja noch vom Vorteil den 2ten haben sie dann im Laufe der Spring Split etwas interessanter gemacht mit der Towerpushhilfe obwohl die Türme eh schwach waren.\n\nJetzt kannst du ein Team erstellen und dann die Drachen überwachen. \nBringt dir der Buff was. Willst du darum kämpfen? Willst du nicht?\nNatürlich ist der Fire Buff ein MUST have aber bei den anderen 3 kann man ruhig spekulieren.\n\nBezüglich dem Herald Buff mache ich mir mehr sorgen.\nStell dir mal vor ein Assassin oder SplitPusher bekommt den Buff in der 15-18 Min. \nDer Buff hält dann bis zur 35-38 min. Um den down zu bekommen brauchst du mindestens 2 spieler wodurch dann aber das gegnerischer Team irgendwo anders einen Vorteil hat.","replies":[]},{"poster":"N3CROW","date":"2016-05-05T21:04:47.917+0000","up_votes":1,"down_votes":0,"body":"stimm ich zu wobei das mit dem zufall irgendwie nicht sein kann...feuerdrachen hab ich fast gar keine gesehen, die wasserdrachen aber fast jedes spiel 3, erde auch recht oft und luft glaub ich erst einmal in etwa 5 games...","replies":[]}]}