{"poster":"Loki Toki ","date":"2016-08-23T19:57:36.145+0000","title":"Kindred, jungler ?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ciao gentaglia.\r\nHo appena  finito una partita con KR e devo dire che non mi ha dato per niente la sensazione di aver usato un champ da jungler.\r\nAgli inizi KR aveva un rubavita base con la sua W mi sembra, anche se non era come WW o Fiddle, 3 campi sicuramente erano fattibili.\r\nIn caso di aiuto mancante poteva anche farcela da sola in base alle rune e alle maestrie.\r\nOra, dopo un bel pezzo che non la giocavo, mi &egrave; sembrata penalizzata. Da sola ci crepa, con le rune e maestrie che ho usato, quasi sicuramente soffre a farsi 3 campi anche se riceve aiuto.\r\n\r\nSicuramente sono scarsissimo con KR, ma nnt cc, rallenta con la W ma entro un certo raggio abbastanza limitato per i gank, nel senso che se non li prendi alle spalle saranno gi&agrave; abbastanza lontani per essere efficace. La ult per me fa schifo per diversi motivi, ma lasciamo stare.\r\n\r\nQuindi, per chi maina questo champ, che set di rune e maestrie usate? e poi  KD &egrave; ancora un jungler? \r\n\r\nche oggetti comprate per prima al fine di farmare i campi facilmente? domanda che puo&#039; sembrare strana, ma tra completare l&#039;item da jungler e le scarpe il tempo passa e anche troppo. Pi&ugrave; recall senza rubavita, meno gank, meno oro: ff20.\r\nsar&agrave; forse questo il primo oggetto che KR deve prendere ?{{item:1053}} \r\nmagari in duplice copia.","replies":[{"poster":"Kim114","date":"2016-08-23T21:41:14.904+0000","up_votes":1,"down_votes":2,"body":"Io la uso, mi sembra fuori meta\nTroppo degole, plurinerfata\nE non nerfate {{champion:157}} ??\nKindred non fa piu danni, yasuo invece è gesu","replies":[{"poster":"Jihyobda","date":"2016-08-26T13:11:42.012+0000","up_votes":1,"down_votes":0,"body":"non comprendo se sei ironico o no, comunque yasuo non è gesù, basta saperci giocare contro, come tutti gli altri  champ definiti op che non lo sono","replies":[{"poster":"Kim114","date":"2016-08-26T17:56:40.315+0000","up_votes":1,"down_votes":0,"body":"È ironico\nIntendo che Kindred è troppo debole, mi sembra ingiusto che venga merfata ogni 2 patch","replies":[{"poster":"Jihyobda","date":"2016-08-27T11:45:25.001+0000","up_votes":1,"down_votes":0,"body":"beh quello sì, ma ti dirò, l'ho provata in lane con lo smite e secondo me può funzionare... ^^","replies":[{"poster":"Kim114","date":"2016-08-27T11:53:06.164+0000","up_votes":1,"down_votes":0,"body":"Ma poi ha problemi a farsi i campi della giungla per le stack","replies":[]}]}]}]}]},{"poster":"zYaichi","date":"2016-08-23T20:19:25.268+0000","up_votes":1,"down_votes":0,"body":"Non è viabile,e se vuoi giocarla avrai un early debole e dovrai puntare a fare il lv6 credo o almeno i 4-5 camp iniziali e andare back.\nPrima faceva senza problemi lv3 con buona parte di vita giorgio e gank,i nerf sono stati pesanti quindi ti consiglio di provare a farmare fino al 4 5 meglio 6 e limitarti  ai countergank prima del 6\nPrima la usavo abbastanza ma dopo il nerf del sustain l'ho abbandonata del tutto\nCome item ti consiglio l'item As e poi ruined king col fervor of battle scelta miglior,un po di tempo fa ti avrei detto yoummu e item da as/ad adesso non so la black cleaver è un ottimo 3/4 item o vai più difensivo insieme a malmortius e ga","replies":[{"poster":"Loki Toki ","date":"2016-08-23T20:25:38.051+0000","up_votes":1,"down_votes":0,"body":"e non mi sembra viabile in altre lane, c'e' di meglio e la passiva sulla Q addio.\nPeccato, mi piaceva agli inizi.","replies":[{"poster":"zYaichi","date":"2016-08-23T20:46:18.781+0000","up_votes":1,"down_votes":0,"body":"\n\nÈ un champ pensato per la jungle per questo in altre lane non è viabile,diciamo non è viabile come champ attualmente (che è diverso da non essere in meta)non come ruolo,poi potresti giocarla adc e  sarebbe viabile come graves o quinn buttando almeno il 50% del tuo potenziale\nAgli inizi era un must agli lcs o ban e anche a elo medio alto,meno in elo basso perché non è molto immediato ma la combo E+AA+Q+RedSmite shottava ed era una kill garantita,massimo bastava flashare per chiuderla","replies":[]}]}]},{"poster":"Sorcio84","date":"2016-08-23T20:32:14.034+0000","up_votes":1,"down_votes":0,"body":"Giocata.\nÈ molto squishy.\n\nPer farmare si usa lo stesso sistema di prima\nStarti di W , fai kiting\nMaxi la Q per prima.\nSi, al terzo campo devi backare, ma poi piano piano diventa easy.\nPer prendere le kill sei dipendente dal team\n\nCome rune uso quelle standard , Aspd da adc\nRosse - AD flat\nGialle - Armor flat\nBlu - Mres flat\nQuint - Aspd\n\nMastery uso principalmente ferocia , poi te le regoli come vuoi, io faccio così.\n\nPer le build puoi vedere gli item più usati su probuilds","replies":[{"poster":"Jihyobda","date":"2016-08-26T13:06:44.016+0000","up_votes":1,"down_votes":1,"body":"praticamente ormai è un adc normalissimo quindi è viable come quinn o lucian jungle, graves è un caso apparte","replies":[]}]},{"poster":"wildfox99","date":"2016-08-23T20:15:14.644+0000","up_votes":1,"down_votes":0,"body":"l'item da jungler di per sé ti da lifesteal contro i mostri,non ha senso fare altri item per rubavita in early\nprobabilmente devi solo imparare meglio il champ,per il resto non ti so dire","replies":[{"poster":"Loki Toki ","date":"2016-08-23T20:20:45.938+0000","up_votes":1,"down_votes":0,"body":"non mi è sembrato sufficiente come rubavita.","replies":[{"poster":"wildfox99","date":"2016-08-23T20:25:13.976+0000","up_votes":1,"down_votes":0,"body":"si ma a differenza di ww ad esempio sei un ranged,attacchi e ti muovi riducendo i danni","replies":[]}]}]},{"poster":"Jihyobda","date":"2016-08-26T13:09:06.260+0000","up_votes":1,"down_votes":1,"body":"secondo me ora è quasi più viable come adc che come jungler, però è alla stregua di quinn: early fai qualcosina, mid sei inutile, late sei di nuovo utili (se hai abbastanza stacks) comunque è un po che non la gioco ne giungla ne adc, di jungler ce ne sono di più forti assolutamente...","replies":[]},{"poster":"EmptyHole","date":"2016-08-23T20:09:49.318+0000","up_votes":1,"down_votes":1,"body":"KR?\nKD?\n\nDi cosa stiamo parlando?","replies":[]}]}