{"poster":"Snable Artek","date":"2016-12-11T05:58:56.435+0000","title":"Another day in paradise...","subforum":"Discussioni generali","up_votes":3,"down_votes":2,"body":"Oramai &egrave; mio solito chiedere aiuto nel forum per consigli ecc, ma molte volte lo utilizzo a scopo critico, qui sotto ci sono alcune domande sulle ranked.\n\n**1.** Il matchmaking aiuta le persone in Lose Streak (Da 5+ partite)?\n\n**2.** Il matchmaking non dovrebbe mettere le persone che vanno afk e flammano con le medesime persone?\n\n**3.** Che fare se si &egrave; in Lose Streak e/o trovi solo troll in team, Oggi mi sono ritrovato support (Grazie AutoFill) e come sempre becco il draven che non sa giocare e che inizia a flammare peggio di un cane. Poi vado ade e mi trovo un support che dopo avermi fatto morire due volte &egrave; andando afk.\n\n**RIot, dai una sistemata al matchmaking delle ranked e inizi a bloccare le ranked a qualcuno**\n\nhttps://youtu.be/ucvcS_lHutM","replies":[{"poster":"BrattishSolid6","date":"2016-12-11T09:56:14.765+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TheArtek98,realm=EUW,application-id=MJVj50Jw,discussion-id=lLxzb4sk,comment-id=,timestamp=2016-12-11T05:58:56.435+0000)\n\n> **1.** Il matchmaking aiuta le persone in Lose Streak (Da 5+ partite)?\n\nSì e no. Il verbo \"aiutare\" è il verbo sbagliato in questo caso. Quando inizi una lose streak il tuo mmr si abbassa. Questo fa sì che tu trovi gente con un mmr più basso del solito. Ciò ti aiuta nel senso che trovi gente presumibilmente \"del tuo livello\". Non ti aiuta se tu invece vorresti trovarti contro gente più forte o di rango superiore. Il matchmaking (a parte eventuali strafalcioni che, lo sappiamo, capitano) **adatta** i giocatori che trovi al tuo attuale mmr.\n\n\n> [{quoted}](name=TheArtek98,realm=EUW,application-id=MJVj50Jw,discussion-id=lLxzb4sk,comment-id=,timestamp=2016-12-11T05:58:56.435+0000)\n\n> **2.** Il matchmaking non dovrebbe mettere le persone che vanno afk e flammano con le medesime persone?\n\nNonostante possa sembrare la scelta migliore a una prima analisi, no. Per far capire, paragoniamo i ban alla prigione. Una volta che una persona va in prigione e ne esce, lo scopo non è quello di isolarlo ed emarginarlo dalla società ma, anzi, cercare di reintegrarlo. Per questo motivo gli ex-galeotti non vivono in quartieri circoscritti e delimitati, ma vivono in mezzo agli altri, esattamente come gli altri. La stessa logica è applicata qui. Mettessimo i flamer **solo** con altri flamer, nessuno di loro si \"reintegrerebbe\", nessuno cambierebbe. Sarebbe tutto inutile.\n\n\n\n> [{quoted}](name=TheArtek98,realm=EUW,application-id=MJVj50Jw,discussion-id=lLxzb4sk,comment-id=,timestamp=2016-12-11T05:58:56.435+0000)\n>\n> **3.** Che fare se si &amp;egrave; in Lose Streak e/o trovi solo troll in team, Oggi mi sono ritrovato support (Grazie AutoFill) e come sempre becco il draven che non sa giocare e che inizia a flammare peggio di un cane. Poi vado ade e mi trovo un support che dopo avermi fatto morire due volte &amp;egrave; andando afk.\n\nIl mio consiglio è di prenderti una piccola pausa. Prendere un champ che ti piace, giocarlo lì. \"Fregatene\" dei compagni. Come hai tu dei compagni orribili a volte, li hanno anche i nemici. I feeder li trovi sia tu che i nemici. I flamer li trovi sia tu che i nemici. Tieni duro, gioca per divertirti e non farti rovinare quell'oretta di relax da un qualsiasi giocatore tiltato ^^","replies":[{"poster":"Snable Artek","date":"2016-12-11T16:20:56.085+0000","up_votes":1,"down_votes":0,"body":"Ho carriato le partite con draven","replies":[{"poster":"Dragonfield123","date":"2016-12-11T18:19:52.408+0000","up_votes":1,"down_votes":0,"body":"Baby anche io carrio con draven","replies":[]}]}]},{"poster":"SerSlayer","date":"2016-12-11T07:32:38.309+0000","up_votes":1,"down_votes":0,"body":"1 La lose streak è semplicemente dovuta a te. Se nella stessa giornata stai perdendo troppe partite, vuol dire che ormai sei in uno stato, per colpa delle partite precedenti o semplicemente per come va la tua giornata, in cui non sei più in grado di giocare bene. Semplicemente smetti di fare ranked.\n\n2 Infatti afk e flamer vengono messi insieme, ma non ce ne sono infiniti, perciò il gioco tenta di bilanciare, 2 flamer in un team 2 nell'altro e cosi via, poi spetta decidere a chi è il peggiore dei due. Poi siamo ad inizio stagione, quindi è tutto amplificato.\n\n3 Sei in lose streak? Prenditi una pausa! Non ti cambierà usare altri campioni. Troll in team? Mutali e cerca di recuperare. Auto-fill? Annulla la coda ogni 60 secondi e trova soltanto il ruolo principale che vuoi giocare. (Ci metterai ovviamente di più ma apri youtube o twitch ed ogni 60 secondi ricordati di rimettere la coda). \n\n4 (anche se non esiste, riassunto tra tutti i punti) Ricorda che è un gioco, cerca di migliorare anche se il tuo team non può portarti alla vittoria, fidati che  migliorando arriverà il giorno in cui sarai capace di vincerla in 2 contro 5.\n\nE che il signore sia lodato, ringraziamo l'esistenza del /mute all.","replies":[]}]}