{"poster":"KR Sakanade","date":"2015-07-30T10:07:56.182+0000","title":"Calls e Strategia in low elo","subforum":"Discussioni generali","up_votes":5,"down_votes":0,"body":"Salve a tutti!\nCreo questo post per chiedere consiglio riguardo i calls e l&#039;aspetto puramente strategico del gioco.\nPremetto che gioco da un anno quasi, e finora mi sono concentrato moltissimo su me stesso e ad implementare le meccaniche dei champion che preferisco e con cui ho pi&ugrave; affinit&agrave;, seguendo poco o nulla il meta. Ma tutti sappiamo che LoL non &egrave; solo una questione di Kill e gg. Bisogna usare la testa. Ho praticamente sempre giocato con amici in ts, quindi la comunicazione col team c&#039;&egrave; bene o male in ogni partita. Avendo sempre giocato con gente di elo superiore al mio (colui che mi port&ograve; in LoL era gi&agrave; gold e adesso platino, ed ho avuto la fortuna di giocare in custom anche con Diamond da cui ho imparato moltissimo prima che mi facessero rimpiangere di aver loggato xD) mi sono sempre affidato umilmente alla loro esperienza e infatti spesso e volentieri carriano loro e io mi limito a rispettare i tempi giusti (gioco in giungla) e ad imparare quanto pi&ugrave; possibile.\nVeniamo al dunque: mi rendo conto che in soloQ (sono Silver II al momento) la situazione &egrave; praticamente ingestibile per me, non riesco ad essere utile come lo sono con loro. In ranked si trova di tutto, e quando ci si trova insieme a gente (e lo dico senza superbia o flame) scarsa su ogni aspetto, beh pazienza, non &egrave; un problema, nessuno qui &egrave; Faker o pretende di giocarci insieme. Ma spesso trovo persone con buone meccaniche, che farmano bene e che poi in late game potrebbero fare tranquillamente penta. In questi casi quindi, credo, bisogna adottare qualche tipo di strategia, in primis il controllo degli obbiettivi (correggetemi se dico boiate). Perdere perchè io e i miei compagni siamo più scarsi ci può stare. Perdere perchè giochiamo senza usare la testa no, non lo sopporto.\n\nQuindi, quali sono i presupposti per far un buon call? Come farsi ascoltare? Come prendere in mano al situazione in casi di svantaggio o parit&agrave;? Come riuscire a coordinare gli engage con gente che non si conosce con cui non c&#039;&egrave; comunicazione?\nAh, un altra cosa, qualcuno pu&ograve; darmi qualche consiglio sulla team comp? Spesso vedo partite perse al champion select. Quali sono le \"regole\" base di una buona team comp? \n\nGrazie e scusate il romanzo :D","replies":[{"poster":"White Winston","date":"2015-07-30T10:18:10.515+0000","up_votes":3,"down_votes":0,"body":"Bel post...questo forum dovrebbe servire a questo e non alla marea di spam che purtroppo lo intasa! ;)\n\nComunque...essendo S4 non ho la presunzione di rispondere alle domande che hai fatto (anzi...su alcune aspetto anch'io le risposte!).\n\nAggiungo una domanda: quanto vale il drago in questa season secondo voi? Sul baron credo non ci siano dubbi...salvo possibilità di vittoria o inibitore facile, è l'obiettivo n.1! Ma il drago? Rispetto ad una delle torri esterne? E ad una torre interna? \nIo tendo quasi sempre a privilegiarlo rispetto a qualsiasi torre...ma può darsi che sbagli!\nChe poi si potrebbero fare distinzioni anche a seconda di quale drago stiamo parlando... (primo? secondo? terzo? etc.)","replies":[{"poster":"miki2212","date":"2015-07-30T14:04:41.062+0000","up_votes":1,"down_votes":0,"body":"parlo da unranked, quindi non prendere tutto per oro colato (e nemmeno solidificato u.u). Per me il drake è un obiettivo molto più importante rispetto ad una torre, perchè prendendo il drake:\n1 porti a casa soldi (che con questa crisi fanno sempre bene);\n2 ottieni un buff molto potente( il 6% di ap-ad in più con il primo drake!);\n3 togli i due punti precedenti agli avversari!","replies":[{"poster":"franz94","date":"2015-07-31T01:41:03.294+0000","up_votes":1,"down_votes":0,"body":"attualmente non ottiene soldi ne molta exp ok chi lo uccide ma da di più fare il campo, per il jungler. Per me il valore del drago dipende da tempo in cui sei in partita.\nNei primi livelli inoltre non è molto vantaggioso farlo a meno che non lo fai velocemente,  è alquanto sconsigliato farlo da solo al 3 per un jungler perche ritarda il jungler in exp è oro.\nIl buff è carino ma nei primi livelli non si sente molto, a meno che non sei già in vantaggio(pero nei primi momenti della partita una torre è superiore). Come già detto dipende da che punto della partita sei, nei primi 10 min credo sia più conveniente una torre dopo che i carry hanno un po di ap/ad il drago conviene di più.\n Il terzo drago quello dei danni alle torri è uno dei migliori è in alcuni casi è migliore del primo, il 5 vale quanto un baron per me.","replies":[{"poster":"miki2212","date":"2015-08-01T15:47:08.435+0000","up_votes":1,"down_votes":0,"body":"si ovvio, non dico che bisogna farlo da appena fatto il livello tre. Penso che il primo drake andrebbe fatto a circa 12 min, quando la squadra guadagna un pò di vantaggio.","replies":[]}]},{"poster":"kirchhoff","date":"2015-07-30T18:01:37.365+0000","up_votes":1,"down_votes":0,"body":">perchè prendendo il drake:\n> 1 porti a casa soldi\n\n?\n\n> 2 ottieni un buff molto potente( il 6% di ap-ad in più con il primo drake!);\n\nsolo primo e quinto\n\n> 3 togli i due punti precedenti agli avversari!\n\nl'unico motivo per fare i draghi n° 2 3 4","replies":[{"poster":"miki2212","date":"2015-08-01T15:44:49.931+0000","up_votes":1,"down_votes":0,"body":"vuoi spiegato i punti? 1 da soldi al jungler, 2 il testo compreso tra le parentesi era PER ESEMPIO, 3 non è vero nulla:tutti i buff del drago sono utili","replies":[]}]}]}]},{"poster":"CloudStray","date":"2015-07-30T18:37:56.427+0000","up_votes":2,"down_votes":0,"body":"Allora, per prima cosa (fondamentale della SoloQ) devi avere fortuna di trovare compagni che non siano presuntuosi, tipo io trovo molte volte persone che ragionano :\" ah lui sta feeddando/io stò andando meglio di lui, non seguo le sue chiamate\" invece bisogna sempre seguire le call, a meno che non sei sicuro al 110% di non riuscire a prendere l'obiettivo.\nGuarda questa mia partita fatta oggi ( http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2226616343/219951689?tab=overview ), ti giuro, avevo una squadra da sogno, anche se heimerdinger ha feeddato molto riven, tutta la squadra seguiva ogni mio singolo ping, senza esitazione e senza scrivere nulla. Pingavo il baron, tutti al baron, drago, tutti al drago, eravamo in 5 mid, pingavo di andare top, tutti in top... infatti i risultati si sono visti, bisogna avere fortuna a trovare team del genere, specialmente in silver :)  (sono sII).\n\nSe vuoi essere tu a fare le call, come nel mio caso della partita linkata prima, devi sempre dare un'occhiata al TAB, se i nemici hanno appena recallato, oppure sono morti, oppure è morto solo il jungler, o c'è qualcuno top mentre voi siete vicini al drago, o addirittura lasciare un drago di proposito per rushare il baron ecc..ecc... non ci sono tecniche particolari per fare calls, devi solo ragionarci bene e velocemente, vedrai che con il tempo ti verrà naturale :)  (anche se detto da me sembra un controsenso, visto che gioco da 2 mesetti, ma sono una persona che impara velocemente xD)","replies":[]},{"poster":"Sorcio84","date":"2015-07-30T11:11:38.819+0000","up_votes":1,"down_votes":0,"body":"farsi ascoltare è dura se trovi gente con una mente comlletamente casuale.\nmi ricordo un game dive i nemici erano tutti morti e la squadra si è messa a farmare margherite invece di pushare le torri... ed eravamo a 45 minuti di gioco.\nabbiamk vinto 3 teamfight e io ed un mio amico abbiamo intasato di ping e chat per farli pushare ma niente. poi abbiamo perso.\n\nquindi ho elaborato una mia strategia.\n\n- creare pressioni  alle lane\ngiocando {{champion:421}} o un champ con {{summoner:12}} , ammazzo un paio di wave di minion su una lane, poi mi teleporto su un altra e ripeto, poi recallo.\nse fatto velocemente obbloga almeno 1 avversario e tornare indietro.\n\n- drago\n1 granchio\nsi -> lo ammazzo\nno -> 2\n\n2 wardo i punti da dove potrebbero arrivare i nemici, se ho {{item:3341}} metto in sicurezza un bush per un eventuale bait\n\n3 nemici. ci sono o potrebbero arrivare ?\nsi -> macello totale e poi drago. eventualmente un bait\nno -> farsi il drago velocemente soprattutto se hanno loro il granchio e siete visibili\n\nse trovi idioti che non pushano, fai splitpush se è fattibile con il champ che hai, e se fai fuori almeno un inibitore , vedi che a loro la voglia di vincere sale, e hai più % che ti seguano. (poi potrebbero morire male ma intanto...)\n\nquesto dalla mia grande esperienza nel gioco da n1u330 kn gente ke nn cps 1 {{champion:121}} <3","replies":[{"poster":"LightIsMyPath","date":"2015-07-30T12:18:40.112+0000","up_votes":1,"down_votes":0,"body":"e se non puoi splitpushare te che fai?mi e' capitato di fare carneficina, la top pushata, nessuno di noi aveva perso la lane ma ero l'unica che aveva un punteggio particolarmente buono (ero ahri e stavo tipo 8/0), mi son fatta da sola la torre di top perche' tutti hanno recallato non si sa bene perche', anche chi era a mezza vita, e ho portato l'inibitore a mezza vita prima di essere trucidata in 1 vs 5.Giusto in tempo perche' la mia squadra fosse tutta a pushare mid e si facesse ammazzare in 4 vs 5, facendoci perdere l'inibitore di mid e la torre di bot.Come perdere roba perche' avevi vinto un tf...sono rimasta senza parole.(e ho intasato la mappa di ping)","replies":[{"poster":"Sorcio84","date":"2015-07-30T15:26:15.913+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=labarso,realm=EUW,application-id=MJVj50Jw,discussion-id=JEobyO9d,comment-id=00010000,timestamp=2015-07-30T12:18:40.112+0000)\n>\n> e se non puoi splitpushare te che fai?mi e' capitato di fare carneficina, la top pushata, nessuno di noi aveva perso la lane ma ero l'unica che aveva un punteggio particolarmente buono (ero ahri e stavo tipo 8/0), mi son fatta da sola la torre di top perche' tutti hanno recallato non si sa bene perche', anche chi era a mezza vita, e ho portato l'inibitore a mezza vita prima di essere trucidata in 1 vs 5.Giusto in tempo perche' la mia squadra fosse tutta a pushare mid e si facesse ammazzare in 4 vs 5, facendoci perdere l'inibitore di mid e la torre di bot.Come perdere roba perche' avevi vinto un tf...sono rimasta senza parole.(e ho intasato la mappa di ping)\n\nok ma potevi controllare il timer di respawn degli avversari. sai che escono con le scarpe turbo XD Manda avanti una wave di minion e ritirati.\ncapisco gli alleati tutti al mid. spesso capita anche a me. pushano fino all'estremo facendosi pelare per poi morire.\nio preferisco ritirarmi in modo da tirarli fuori dalla base, sennò stanno la 5 + la torre e non si passa. io penso che anche una buona ritirata abbia il suo valore strategico","replies":[]}]},{"poster":"Frattaglia","date":"2015-07-30T15:42:41.110+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sorcio84,realm=EUW,application-id=MJVj50Jw,discussion-id=JEobyO9d,comment-id=0001,timestamp=2015-07-30T11:11:38.819+0000)\n> \n> - creare pressioni  alle lane\n> giocando {{champion:421}} o un champ con {{summoner:12}} , ammazzo un paio di wave di minion su una lane, poi mi teleporto su un altra e ripeto, poi recallo.\n> se fatto velocemente obbloga almeno 1 avversario e tornare indietro.\n> \n\nQuando fai questo, ricordati di mettere la lane in push. \nTi spiego la meccanica: se le due ondate dei minion sono pari (6 e 6 o 7 e 7 se c'è il cannoncino), queste si bilanciano e la wave resta ferma là.\nSe invece non sono uguali (sui video di coaching le chiamano even) ad esempio 6 contro 3, lentamente dietro alla wave in vantaggio si andranno ad accumulare altri minion, perché i minion nemici (3) non riescono a uccidere tutti i tuoi (6).\nSe la differenza tra le ondate non è tanta (es, 4 o 5 contro 6), per i primi minuti non succederà nulla ma dopo due o tre minuti si formerà dietro la wave in vantaggio un'ondata enorme; se invece la differenza è maggiore, la lane pusherà prima e l'ondata che si andrà a creare sarà più piccola.\n\nDa notare inoltre che i minion caster fanno più danni di quelli melee ma sono meno resistenti; un trucco per far pushare prima è quindi puntare ai minion caster.\n\n\nSpero che sia comprensibile quello che ho scritto... comunque se cercate su youtube qualche video sulla gestione delle wave trovate più informazioni :)","replies":[{"poster":"Sorcio84","date":"2015-07-30T17:45:25.293+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=JEobyO9d,comment-id=00010001,timestamp=2015-07-30T15:42:41.110+0000)\n>\n> Quando fai questo, ricordati di mettere la lane in push. \n> Ti spiego la meccanica: se le due ondate dei minion sono pari (6 e 6 o 7 e 7 se c'è il cannoncino), queste si bilanciano e la wave resta ferma là.\n> Se invece non sono uguali (sui video di coaching le chiamano even) ad esempio 6 contro 3, lentamente dietro alla wave in vantaggio si andranno ad accumulare altri minion, perché i minion nemici (3) non riescono a uccidere tutti i tuoi (6).\n> Se la differenza tra le ondate non è tanta (es, 4 o 5 contro 6), per i primi minuti non succederà nulla ma dopo due o tre minuti si formerà dietro la wave in vantaggio un'ondata enorme; se invece la differenza è maggiore, la lane pusherà prima e l'ondata che si andrà a creare sarà più piccola.\n> \n> Da notare inoltre che i minion caster fanno più danni di quelli melee ma sono meno resistenti; un trucco per far pushare prima è quindi puntare ai minion caster.\n> \n> \n> Spero che sia comprensibile quello che ho scritto... comunque se cercate su youtube qualche video sulla gestione delle wave trovate più informazioni :)\n\ngrazie mille questa mi mancava. io infatti eliminavo 2 wave in modo che si creasse pressione sulla torre, ma così a caso. magari con questo consiglio vado meno a caso :D","replies":[]}]}]},{"poster":"kirchhoff","date":"2015-07-30T22:31:27.210+0000","up_votes":1,"down_votes":0,"body":"In bronzo non funziona, le partite le porti avanti da solo.\nDall'argento in su si incomincia a ragionare (forse).","replies":[]}]}