{"poster":"Propose","date":"2017-06-15T08:20:55.191+0000","title":"Firmennotebook League of legends installieren","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo Leute,\r\n\r\nda ich im Moment beruflich viel unterwegs bin, m&ouml;chte ich gern auf meinem Firmenlaptop abends in den Hotels auch mal CSGO oder LOL spielen. Wenn ich auf meinem Laptop etwas installieren will, muss ich ein Administrator Kennwort eingeben. Es ist also gesperrt, andere Anwendungen zu installieren.\r\n\r\nIch m&ouml;chte nun ungern die Techniker deswegen fragen.\r\nGibt es eine M&ouml;glichkeit LOL oder CSGO auf einer externen Festplatte von meinem PC zuhause aus zu installieren und diese Festplatte &uuml;ber USB 3.0 anzuschlie&szlig;en und das Spiel dar&uuml;ber zu starten? Ist USB 3.0 daf&uuml;r ausreichend? Reicht dazu auch ein USB Stick 3.0 mit 64 GB?\r\n\r\n\r\nVielen Dank f&uuml;r eure Hilfe.","replies":[{"poster":"recon","date":"2017-06-15T11:50:45.248+0000","up_votes":3,"down_votes":0,"body":"LoL kann problemlos auf einen tragbaren Datenträger (externe Festplatte, USB-Stick, etc) kopiert werden, da sich alle Konfigurationsdateien direkt im LoL Ordner befinden. Du kannst es dann direkt von dort aus starten und musst es nicht auf den Laptop kopieren.\n\nDamit LoL läuft, muss **DirectX v9.0c oder höher** installiert sein. Mit etwas Glück ist das bereits auf dem Laptop. Einfach mal testen.","replies":[]},{"poster":"Shadowscreen","date":"2017-06-15T09:17:07.227+0000","up_votes":1,"down_votes":0,"body":"Du kannst es prinzipiell so anstellen, dass du Lol auf deinem Arbeits-Notebook installierst und als Speicherpfad deine externe Festplatte auswählst.\n\nSo müllst du den internen Speicher immerhin nicht zu, aber die Registry Einträge etc werden trotzdem gesetzt.","replies":[{"poster":"Darkr3sQ","date":"2017-06-15T09:50:00.076+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FP of Bel Air,realm=EUW,application-id=7hciEY9w,discussion-id=wXJqEhhx,comment-id=0001,timestamp=2017-06-15T09:17:07.227+0000)\n>\n> Du kannst es prinzipiell so anstellen, dass du Lol auf deinem Arbeits-Notebook installierst und als Speicherpfad deine externe Festplatte auswählst.\n> \n> So müllst du den internen Speicher immerhin nicht zu, aber die Registry Einträge etc werden trotzdem gesetzt.\n\nscheitert aber - wie im Eröffnungspost geschrieben - an den fehlenden Adminrechten.\nDas einzige was das TE machen könnte wäre - sofern er die Möglichkeit hat - es einfach mal auszuprobieren. Dann weiß er es definitiv. In LOL könnte er es ja einfach mal in nem Custom probieren.","replies":[{"poster":"Meemoy","date":"2017-06-15T14:26:56.917+0000","up_votes":1,"down_votes":0,"body":"Bin ich der einzige, der gerade daran denkt, dass das Ausführen von privater Software auf dem Firmenlaptop zu Problemen führen könnte und der sich lieber nen eigenen Laptop holen würde, als das zu riskieren?","replies":[{"poster":"Darkr3sQ","date":"2017-06-15T17:18:36.409+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meemoy,realm=EUW,application-id=7hciEY9w,discussion-id=wXJqEhhx,comment-id=000100000001,timestamp=2017-06-15T14:26:56.917+0000)\n>\n> Bin ich der einzige, der gerade daran denkt, dass das Ausführen von privater Software auf dem Firmenlaptop zu Problemen führen könnte und der sich lieber nen eigenen Laptop holen würde, als das zu riskieren?\n\nDas Ausführen, solange nichts installiert wird, sollte eigentlich weniger problematisch sein.","replies":[{"poster":"Meemoy","date":"2017-06-16T07:26:40.344+0000","up_votes":1,"down_votes":0,"body":"Das kommt ganz drauf an. Also bei uns ist es so, dass die private Nutzung des Firmenlaptops, Firmenhandys usw. nicht erlaubt ist.\nViele tun es trotzdem, das weiß auch jeder und keiner sagt was, doch das ist nicht überall so und wie das aussieht, wenn irgendwas passiert, weiß auch niemand ;-)\nDas habe ich nun schon einige Male beobachtet, dass Sachen stillschweigend hingenommen werden, bis es plötzlich zu höheren Ebenen durchgedrungen ist und nach kurzer Zeit waren ein paar Mitarbeiter entlassen worden.\nUnd dass es keine Problem für die IT-Abteilung sein sollte, heraus zu finden, was genau mit den Geräten gemacht wurde, weiß sicher jeder selbst,aber das soll jeder für sich entscheiden, was es iihm wert ist {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"recon","date":"2017-06-15T18:00:42.218+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=R3sQ,realm=EUW,application-id=7hciEY9w,discussion-id=wXJqEhhx,comment-id=0001000000010000,timestamp=2017-06-15T17:18:36.409+0000)\n>\n> Das Ausführen, solange nichts installiert wird, sollte eigentlich weniger problematisch sein.\n\nWenn dein Chef was dagegen hat, dann schon ;) Darauf wollte er hinaus.","replies":[]}]}]},{"poster":"Shadowscreen","date":"2017-06-15T14:14:53.836+0000","up_votes":1,"down_votes":0,"body":"Hab ich überlesen, danke für den hinweis ~_~","replies":[]}]}]},{"poster":"Megamaexx","date":"2017-06-15T08:57:10.155+0000","up_votes":1,"down_votes":0,"body":"Du kannst LoL auf einer externen installieren. Ob das dann auch auf einen PC läuft, auf dem es nicht installiert wurde, weiß ich nicht. Bei vielen Spielen ist es jedenfalls so, dass das nicht geht, da eine *.dll Datei fehlt, die nur durch die Installation hinzugefügt wird. Diese sollte in einem Ordner landen, der Adminrechte erfordert.\n\nKannst es aber mal ausprobieren","replies":[]}]}