{"poster":"Xayah Strife","date":"2019-08-27T05:00:18.195+0000","title":"[TGSG] Meine Animetopliste Teil 1","subforum":"Allgemeiner Chat","up_votes":6,"down_votes":1,"body":"Guten Morgen meine flauschigen Freunde, \n\nhttps://vignette.wikia.nocookie.net/kaminomi/images/6/6f/Muxed-Subs_The_World_God_Only_Knows_OVA_704x396p_H264-AACBA53864D.mkv_snapshot_09.04_20.jpg/revision/latest?cb=20130329191313\n\nWeil das Ganze zu lang wird teile ich dieses \"Threadprojekt\" in 4 Threads auf und jede Woche kommt einer.\nTeil 1 ist der Bereich 9/10. (8 Stück)\nTeil 2 ist die gute 9 der fest schon eine 10 ist. Ich nenne es 9,5/10. (6 Stück)\nTeil 3 ist 10/10  (6 Stück) \nTeil 4 ist 11/10 also mein Liebling. \n\nFalls Dienstag jemand schneller sein sollte kommt es Mittwoch oder Donnerstag. :P \n\nDie nächsten 4 Spoiler sind nur dafür da das der Thread wenig lang ist. \nDie letzten drei werden auch weiterhin am Anfang stehen zur Aufklärung. \n\nSpoiler zu den nächsten Wochen: \n>###*Voilet Evergarden und No Game no Life kommen im dritten Teil. Ich hoffe Azubi schafft das. In Teil 2 sind noch Made in Abyss,High School DxD und The Seven deadly Sins offen falls jemand etwas beisteuern möchte.*\n\nDisclaimer:\n>###*Ich bin offensichtlich kein professioneller Kritiker darum sind Entscheidungen von Bewertungen häufig davon abhängig wie sich eine Serie für mich angefühlt hat. Dementsprechend kann ich mir vorstelle das ich manche Serien besser oder schlechter bewertet habe als es der Durchschnitt  bewertet also nicht sauer sein wenn ihr manche Entscheidungen nicht nachvollziehen könnte. Ich entscheide selten 100% sachlich sondern eher nach meinem Gefühl. Wenn etwas für die meisten Trash ist aber bei mir ein gutes Gefühl hinterlassen hat dann ist es halt so.*\n\nZu Spoilern: \n>###*Außerdem möchte ich noch sagen das ich in letzter Zeit festgestellt habe, das der beste Weg jemand von Serie zu überzeugen in Spoilern liegt. Jemand eine krasse Szene zu zeigen kann effektiver sein als nur Oberflächlich davon zu reden weil man nicht zu viel verraten möchte. Ich versuche eigentlich immer darauf zu achten den Leuten nicht die Spannung zu nehmen aber nur Spoiler freien Material kommt man leider nicht sehr weit...Ich werde versuchen nicht mehr zu spoilern als es Beschreibungen und Trailer zeigen allerdings steige ich immer so wenig in den Anime ein um es besser verständlich zu machen worum es dabei geht und warum ich ihn so toll finde. Ich hoffe das ist okay. Ich werde versuchen keine zu krassen Sachen zu Spoilern sondern nur kleine Details aus dem Plot verraten für das Verständnis.*\n\nRatingserklärung: \n>###*R- bedeutet das der Anime blutig ist. R+ bedeutet du siehst ein wenig mehr Haut um es mal jugendfrei auszudrücken*\n\t\nKaguya-sama: Love is War: \nDer Anime stellt gleich zu beginn die Theorie auf das es in jeder Beziehung eine dominante und eine rezessive Person gibt. Beide Hauptcharaktere stehen auf den anderen aber beide wollen die dominante Rolle in der Beziehung sein. Daraus entstehen eine menge lustiger und peinlicher Momente wo die beide immer und immer in mentale Duelle antreten um die dominante Rolle zu bekommen. \nDabei werden noch aus den kleinsten Kleinigkeiten absurde Situationen geformt. Ich erinnere mich an eine Folge wo es geregnet hat und sie ihn dazu bringen wollte unbedingt ihr anzubieten ein Regenschirm mit ihr zu teilen. Sie hat in der Zeit wo er auf Toilette war die Batterie von seinem Handy gekillt womit er nicht sieht das die Züge wieder fahren und er nun Zufuß gehen muss wo sie dann zufällig auftaucht und natürlich kein Schirm dabei hat. Allerdings war er mit dem Fahrrad...\n(Okay das war ein kleiner Spoiler aber ansonsten hätte man schlecht verstanden was ich meine) \nEs wird durch eine schöne Erzählerstimme begleitet die uns durch die einzelnen Szenarien begleitet und uns einiges Erklärt. Die Gedanken der beide Hauptfiguren sich dabei für den Zuschauer auch immer zu hören weil das ganze Spiel noch besser macht. \nAlles in allem ist der Anime extrem gut gemacht und die Szenarien machen Spaß allerdings fehlt der Höhepunkt der \"Staffel\" und es fehlt bisher auch eine 2. Staffel.Davon braucht ich unbedingt mehr. (So wie viele andere Animes auch eine 2. Staffel brauchen) \nKein deutsche Synco vorhanden.\n\nMy First Girlfriend is a Gal: (R+)\nDieser Anime ist harter Stoff. Der Subersteller hatte hier wahrscheinlich sehr viel freunde dran, denn manche Dialoge kann man schon nicht mehr als zweideutig bezeichnen die sind eindeutig unter der Gürtellinie. :D Es könnte auch eine Parodie auf Slice of Life Flirtanimes sein zumindest fühlt es sich so an. Die Dialoge sind krank, die Charaktere überspitzt und die Situationen sich häufig  pervers und lustig. Die Hauptfigur ist eine Jungfrau die nach einer Freundin zu … sucht. Eigentlich könnte man es auch als American Pie in Anime bezeichnen. Es wird viel über das eine geredet aber wirklich etwas passieren tut nur in der Phantasie des Hauptcharakters.\nDie letzte Folge fand ich btw überragend. Super Abschlussfolge ist maybe an auch ein dem hohen Rating schuld. So eine gute letzte Folge hab ich lange nicht gesehen. \nKein deutsche Synco vorhanden.\n\nZero no Tsukaima (Der Vertraute der Null): \nDieser Anime erinnert sehr vom Style her an Ranma 1/2.\nDu hast ein Paar welches  als Zuschauer leicht zu erkennen ist und jede Menge andere Girls die auf den Hauptcharakter stehen.Anderes als in Standartharemanimes wird die weibliche Hauptfigur so richtig sauer wenn sich mal wieder eine an den männlichen Hauptcharakter ranmacht.\n(Erinnert sehr an Ranma 1/2 wenn sich Shampoo mal wieder an Ranma ranmacht und Akane das mitbekommt. XD) Dazu noch ein wenig Ecchi und Comedie und man hat eine schöne Parodie mit auch ein paar ernsten Momenten. Achja es ist Magic/Fantasy und eigentlich ein Isekai weil sie ihn aus einer anderen Welt beschwört. \n(Jeder Magierschüler beschwört einen Vertrauten der ihn für sein Leben begleitet was in der Regel magische Tiere/Wesen sind und unsere weibliche Hauptfigur beschwört halt ein menschlichen Junge der als Vertrauter eine Art untergebener ist) \nDie Romanze ist dabei sogar wirklich sehenswert wenn auch ein wenig kitschig aber hier passiert im laufen der 4. Staffeln immerhin ein wenig mehr als nur ein Kuss.\nAnsonsten gibt es noch den ein oder anderen Kampf zu sehen.\nDer Anime ist btw auch abgeschlossen und das Ende ist in Ordnung. Nicht so überragend aber auch nicht enttäuschend. \nKeine deutsche Synco vorhanden. \n\nA Sister's All You Need: (R+) (Zensiert)\n3 Buchautoren und eine Studentin bilden eine Sitcom ähnliche Gruppe und treffen sich Abends zum essen, trinken(Alkohol), quatschen und lustige Spiele spielen. Wer die erste Folge überlebt hat bekommt hier einen echten Geheimtipp. :) Die Charaktere sind zwar fast alle Erwachsenen und reden teilweise auch über ernste Dinge aber sie sind deshalb auf keinenfall langweilig. \nDer Hauptcharakter schreibt Geschichten über kleine Schwester hat aber selbst nur einen Bruder. Lasst euch nicht von der Geschichte der ersten Folge abschrecken nicht der gesamte Anime ist so. Allgemein steckt in dem Anime sehr viel Mühe und Kreativität um aus dieser Gesprächsrunde etwas besonderes zu machen. Ich weiß noch ein mal wird ein Pen&amp;Papier gespielt und die Szenen werden direkt im Anime gezeigt. Die Weibliche Hauptfigur ist auch ziemlich spezielle (Sie schreibt Nackt) Die Steuerberaterin die in einer späterin Folge rankommt hat mich aber komplett gekillt.\nDie Folge mit ihr war so genial. *-* \nKeine deutsche Synco vorhanden. \n\nIn Another World With My Smartphone: \nEin Isekai mit einem Smartphone. Dieser Anime ist so mainstream und so klischeehaft das es schon eine Parodie ist. (Ein netter Typ der OP ist und zufällig immer mehr und mehr Girls in die Party bekommt...) Aber eigentlich fühlt es doch nicht so wirklich wie ein Isekai an. Es gibt keine richtig große Quest. Kein Oberbösewicht oder sowas. Stattdessen gibt es viele kleine Geschichten die natürlich immer aus der Sicht des Helden geschrieben sind. Allerdings ist dieser Anime auch kreative und unterscheidet sich gerade durch das Smartphone und die Verwendung der OP-ness des Haupthelden von anderen. Er nimmt gute Elemente von Standartisekais und mischt das Ganze mit etwas neuem. Die Mädels gefallen mir übrigens alle sehr gut und das unser Held dabei häufig schüchtern wird teilweise sogar überfordert macht es mehr lustig als wirklich Harem.\n(Nein das ist nicht wie in SAO weil er sich nämlich nicht für eine Entscheidet und so immer wieder kleine Konflikte entstehen.) \nBis auf die fehlenden Mainstory gibt es auch nicht wirklich etwas was ich groß kritisieren kann. Der Anime ist halt etwas kleines entspanntes für zwischendurch womit man eigentlich wenig falsch machen kann.\nDeutsche Synco ist vorhanden. \n\nAkashic Records of Bastard Magic Instructor: (R-)\nWurde wegen dem Dub von einer 8 auf eine 9 aufgestuft.\nDer Anime in einem Satz: Weniger als mehr^^ \nEine Magiakademie, eine fauler Lehrer (Männliche Hauptfigur) und zwei gute weibliche Hauptfiguren reichen vollkommen aus. Die Hauptfigur carryd hierbei die Serie ziemlich gerade in der deutschen Version wenn der Typ ein lässigen Spruch nach den anderen raushaut. \nDie Story spielt hierbei auch um die Charaktere herum. Soviel Worldbuilding gibt es bisher also noch nicht was aber auch nicht schlimm. Es geht in dieser „1. Staffel“ eher um die Hintergrundgeschichten der Charaktere. In der 12 Folgen passiert tatsächlich sogar eine Menge für nur 12 Folgen. Folge 2-3, 4-6,7-9 und 10-12 erzählen hierbei zusammenhängende Geschichten. \nEin paar schöne Kämpfe gibt es in diesem Anime auch. Minispoiler: In Folge 4-6 findet ein Wettbewerb zwischen den einzelnen Klasse der Akademie in verschiedenen Disziplinen statt. \nDeutsche Synco vorhanden\n\nThe World God Only Knows: \nKeima ist der größte Nerd den ich jeweils in einem Anime gesehen habe. Das einzige was er macht sind Datingsimulatoren auf seine PSP spielen. Selbst im Unterricht spielt er ohne Pause an seiner PSP rum. Er nennt sich selbst den Gott der Eroberungen zumindest gilt das für die Virtuelle Welt auf echte Mädchen hat er keine Lust die sich ihm zu langweilig.\nEines Tages bekommt er eine Herausforderung für eine Eroberung. Er nimmt diese an und schon hat er einen Pakt mit der Dämonin Elsie geschlossen. Zusammen müssen sie verlorene Seele fangen welche in den Körper von Frauen aufhalten.Und diese Seele herauszubekommen muss Keima die Frauen erobern. Elsie ist ihn damit nicht gerade eine große Hilfe sie zwar sympathisch aber auch ziemlich useless und trottelig. Daraus entsteht eine sehr lustiger \"Datinganime\" welchen ich für die bessere Variante von \"Date a Life\" halte. Die Frauen unterscheiden sich sprich haben alles was eigenes und interessantes und den Nerd zur Arbeit zu bewegen scheint für Elsie manchmal gar nicht einfach. Zumal Elsie auch eine menge scheiße baut. Als sie einmal eine Kuchen backen will nimmt sie Monstereier als der Dämonenwelt welche dann schlüpfen und die Stadt terrorisieren. \nKein deutsche Synco vorhanden.\n\nSo, I Can't Play H!: (R+)\nEin Typ trifft eines Tages im Regen vor seiner Haustür eine junge Dame die seine Hilfe braucht.\nNachdem er sie in seine Wohnung gelassen hat und sie kurz im Badezimmer war rammed sie ihn ein Schwert in seine Brust.Nach diesem Moment wird klar der er Pakt mit einer Dämonin geschlossen hat. In diese Anime brauchen Dämonen die \"Seelenenergy\" der Menschen um selbst zu Kräften zu kommen. Sie bitte ihm bei der Suche nach einem Menschen mit besonders hohe Energys im Gegenzug will sie sein Leben verlängern denn Dämonen wissen wann Menschen sterben und nehmen sich dann ihre Energy.\nUnser Hauptcharakter ist leider ein kleiner Perversling der erst durch seine perversion sein gesamtes Potenzial abrufen kann. Der Anime ist also ein mix aus einem ernsten Szenario mit Dämonen, ecchieszenen ein wenig humor und leichten Haremelemeten.\nAllerdings liegt der Focus mehr auf den ernste Szenerio welches überraschend gut ist. Gerade in den in späteren Folgen passiert noch eine Menge was ich aber nicht Spoilern möchte. \nEine Menge schöner Kämpfte gibt es wo es sein könnte das die Frauen ein Teil ihrer Kleidung verlieren. :) \nKein deutsche Synco vorhanden.\n\nIch hoffe die kleinen Spoiler welche in genutzt habe um den Inhalt der Animes verständlicher zu machen wäre in Ordnung für euch. \n\nIch weiß das es sehr viel Text ist aber ich hätte Lust dazu weil es unbedingt machen wollte. :)\nAuch wenn ihr nicht alles lest hoffe ich doch es euch irgendwie gefallen hat. \n\nSchönen Dienstag","replies":[{"poster":"Xayah Strife","date":"2019-08-27T15:50:56.006+0000","up_votes":2,"down_votes":0,"body":"Etwas fehlt noch. :)\nhttps://i.redd.it/vryecxv3j0j31.jpg","replies":[{"poster":"Haudruppmoor","date":"2019-08-27T17:53:26.532+0000","up_votes":1,"down_votes":0,"body":"Au ja ! Und ist sie nicht süüüüüß !","replies":[]}]},{"poster":"Necromant","date":"2019-08-27T06:19:46.009+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Xayah Strife,realm=EUW,application-id=YnZkMR0R,discussion-id=5XeT0tNE,comment-id=,timestamp=2019-08-27T05:00:18.195+0000)\n>\n> Guten Morgen meine flauschigen Freunde, \n\nTach\n\n> Voilet Evergarde\n> No Game no Life\n> Made in Abyss\n> High School DxD \n> The Seven deadly Sins\n\nGut, Gut, Gut, Ecchi, Gut\n\n> My First Girlfriend is a Gal: (R+)\n\nSchau ich mal rein.\n\n> In Another World With My Smartphone: \n\nSteht auf der Liste.\n\n> Akashic Records of Bastard Magic Instructor: (R-)\n\nGeschaut und für gut befunden :)","replies":[{"poster":"Xayah Strife","date":"2019-08-27T06:28:42.020+0000","up_votes":1,"down_votes":0,"body":"Ach du hast eh viel zu wenig Zeit zum schauen. :)\nDas kennen wir schon du schaffst einfach nicht mehr zuviel wie früher einmal. \n\nHast du in die deutschen Synco von Akashic Records mal gesehen?","replies":[{"poster":"Necromant","date":"2019-08-27T06:35:05.050+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Xayah Strife,realm=EUW,application-id=YnZkMR0R,discussion-id=5XeT0tNE,comment-id=00050000,timestamp=2019-08-27T06:28:42.020+0000)\n>\n> Ach du hast eh viel zu wenig Zeit zum schauen. :)\n> Das kennen wir schon du schaffst einfach nicht mehr zuviel wie früher einmal. \n\nBin halt alt :D aber stimmt schon, mehr als 2 Folgen schaff ich pro Tag atm nicht. Finde ich reicht aber vollkommen aus :) 1x schau ich nachm Stream inner Badewanne und dann noch 1x kurz vorm schlafen gehen im Bett :)\n\n> Hast du in die deutschen Synco von Akashic Records mal gesehen?\n\nDie von Crunchyrole? Jupp hab ich gesehen ...\nwar ganz ok, mich haben nur bissl die Zitate aus GameTwo etc. getriggert","replies":[{"poster":"Haudruppmoor","date":"2019-08-27T07:30:49.209+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Necromant,realm=EUW,application-id=YnZkMR0R,discussion-id=5XeT0tNE,comment-id=000500000000,timestamp=2019-08-27T06:35:05.050+0000)\n>\n> Bin halt alt :D \n\n{{sticker:sg-kiko}} Du junger Hüpper Du ! tsss\n\nDa weiß man hier gar nicht wo man anfangen mag . Ich schließ mich Deiner Meinung mal an und ergänze :\n\n\"The World God only knows\" ist einer meine Lieblingsanime. Allein der Soundtrack von Elisa https://www.youtube.com/watch?v=D3vblmtccL0 (leider ist ihr Liveauftritt mitn roten Kleid nicht mehr vorhanden)\n\n\"Zero no Tsukiama \" fand ich auch gut. Vor allem die Szene mit der/den Blumen .\n\nBei \"Seven Deadly Sins\" ist mir das Schwein in Erinnerung geblieben. Neben Happy eines der nervigsten Charaktere überhaupt\n\n>###*Hab mich riesig gefreut, als es gestorben ist, und war dann komplett am Boden zerstört, als es einfach nur noch nerviger wieder aufgetaucht ist.*\n\nDiane fand ich hingegen süß . Bei \"No Game no Life\" hat mich der Zeichstil gestört. Boah, dieses Outlining ...","replies":[{"poster":"Necromant","date":"2019-08-27T08:05:39.355+0000","up_votes":1,"down_votes":0,"body":"Mein Herr, ich glaube sie haben sich verlaufen. Zum Altersheim müssen sie eine Straße weiter :P","replies":[{"poster":"Haudruppmoor","date":"2019-08-27T08:20:24.180+0000","up_votes":1,"down_votes":0,"body":"Bei Euch fühl ich mich aber wieder jung ... {{sticker:sg-soraka}} \n\n\nIch komm mir grad wie'n perverser alter Spanner vor .","replies":[{"poster":"Metalmonni","date":"2019-08-27T09:19:33.255+0000","up_votes":1,"down_votes":0,"body":"Die Altersspanne hier schwankt natürlich, aber hier sind durchaus auch schon eher ältere Semester anwesend. \n\nZum Beispiel Tamara. \n\nUnd ich :(","replies":[{"poster":"Haudruppmoor","date":"2019-08-27T09:23:11.837+0000","up_votes":1,"down_votes":0,"body":"Also ich weiß, das der User Abasin älter ist als ich. Ich hab nächstes Jahr ein halbes Jahrhundert rum ... {{sticker:vlad-salute}} ","replies":[{"poster":"Metalmonni","date":"2019-08-27T09:25:14.755+0000","up_votes":1,"down_votes":0,"body":"Na gut, so weit bin ich noch nicht, zugegeben :). \n\nAber es ist schon befremdlich, mit Leuten zusammenzuspielen und dann herauszufinden, dass die 12, 13, 14 Jahre jünger sind als man selbst...","replies":[{"poster":"Haudruppmoor","date":"2019-08-27T10:49:59.897+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Metalmonni,realm=EUW,application-id=YnZkMR0R,discussion-id=5XeT0tNE,comment-id=000500000000000100010000000100000000,timestamp=2019-08-27T09:25:14.755+0000)\n>\n> Na gut, so weit bin ich noch nicht, zugegeben :). \n> \n> Aber es ist schon befremdlich, mit Leuten zusammenzuspielen und dann herauszufinden, dass die 12, 13, 14 Jahre jünger sind als man selbst...\n\nMich stört es eigentlich net. Da meine Kinder zocken und ich mich mit einklinke hab ich eigentlich immer mit jüngeren zu tun . Selber renn ich mitn Tristanashirt durch die Stadt. Da könnt ich mich immer amüsieren, man sieht dann genau, wer das kennt. Die sind dann immer total verwirrt, warum so nen Weißhaariger damit rumrennt xdxd","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"00 M4ddin 00","date":"2019-08-28T06:10:30.935+0000","up_votes":1,"down_votes":0,"body":"Juhu ! \n400 Kommentare!","replies":[{"poster":"Kirschkern","date":"2019-08-28T06:28:40.743+0000","up_votes":1,"down_votes":0,"body":":D Bekloppter","replies":[{"poster":"Xayah Strife","date":"2019-08-28T07:43:16.549+0000","up_votes":1,"down_votes":0,"body":"Frau Sekretärin welches TGSG hat eigentlich die meisten Kommentare?","replies":[{"poster":"Kirschkern","date":"2019-08-28T07:45:51.997+0000","up_votes":1,"down_votes":0,"body":"Azimas =p","replies":[{"poster":"Xayah Strife","date":"2019-08-28T08:17:27.183+0000","up_votes":1,"down_votes":0,"body":"Nein du hast mit ihr höchstens Thread mit 300 Kommentaren. :)\nIch sehe da nur ein Thread mit 402 Kommis und der kommt von Qbert.\nBtw ich kannte im RL mal eine Freunde die Asima hieß^^","replies":[{"poster":"Kirschkern","date":"2019-08-28T10:22:31.384+0000","up_votes":1,"down_votes":0,"body":"Verdammt! Dieser kleine Flauscheball D:","replies":[]}]},{"poster":"Xayah Strife","date":"2019-08-28T07:48:20.321+0000","up_votes":1,"down_votes":0,"body":"Welches?","replies":[]}]}]}]},{"poster":"Xayah Strife","date":"2019-08-28T07:12:57.727+0000","up_votes":1,"down_votes":0,"body":"http://www.yumtamtam.de/ytt_images/Kekse_Panty.jpg","replies":[{"poster":"Haudruppmoor","date":"2019-08-28T07:38:02.541+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-nunu-hearts}}","replies":[]}]}]},{"poster":"00 M4ddin 00","date":"2019-08-28T06:09:43.332+0000","up_votes":1,"down_votes":0,"body":"399","replies":[]},{"poster":"00 M4ddin 00","date":"2019-08-28T06:09:16.550+0000","up_votes":1,"down_votes":0,"body":"398","replies":[]},{"poster":"00 M4ddin 00","date":"2019-08-28T06:08:48.705+0000","up_votes":1,"down_votes":0,"body":"Ich mach etz die 400 voll \n\n397","replies":[]},{"poster":"00 M4ddin 00","date":"2019-08-27T10:58:00.560+0000","up_votes":1,"down_votes":0,"body":"Leute ich famer Typ bin im Aftermovie von Nature one zu sehen :D zwar nur kurz aber immerhin ^^ \n\n\nhttps://cdn.discordapp.com/attachments/312477482836295681/615862133288337418/IMG-20190827-WA0002.jpg\nhttps://youtu.be/bf0yqNY_Scw\n\nDer Typ unter der 01 bin ich ^^","replies":[{"poster":"Kirschkern","date":"2019-08-27T11:34:30.654+0000","up_votes":1,"down_votes":0,"body":"Was für eine 01? Und bei welcher Zeit? XD","replies":[{"poster":"Haudruppmoor","date":"2019-08-27T11:40:19.749+0000","up_votes":1,"down_votes":0,"body":"Ich habs geraffelt und hab ihn gefunden ! 00 M4ddin 00 ich weiß jetz wie Du aussiehst !\n\nAufm ersten Bild steht \"...2019..\" und unter der 01 is einer mit nem ? Hut ? Alu ? Papier ?","replies":[{"poster":"00 M4ddin 00","date":"2019-08-27T14:49:55.132+0000","up_votes":1,"down_votes":0,"body":"Eine rick Cap ^^ das bin ich :D \nAch Bilder und Videos gibt's viele von mir im Internet ^^","replies":[{"poster":"Haudruppmoor","date":"2019-08-27T14:54:39.010+0000","up_votes":1,"down_votes":0,"body":"Das is aber jetze nich nen Bademantel den Du da anhast, weil das Ding sieht iwie flauschig aus !?","replies":[{"poster":"00 M4ddin 00","date":"2019-08-28T06:08:02.118+0000","up_votes":1,"down_votes":0,"body":"Das ist mein Flasuche Bademantel ^^","replies":[]}]}]},{"poster":"Kirschkern","date":"2019-08-27T11:45:06.915+0000","up_votes":1,"down_votes":0,"body":"Es ist nur der echte Martin wenn er nichts weiter als einen Hut trägt!","replies":[{"poster":"Metalmonni","date":"2019-08-27T11:45:55.837+0000","up_votes":1,"down_votes":0,"body":"War Maddin nicht eh allergisch gegen Kleidung?","replies":[{"poster":"Kirschkern","date":"2019-08-27T11:48:47.807+0000","up_votes":1,"down_votes":0,"body":"... Glaub nur Bademäntel waren möglich?","replies":[{"poster":"Metalmonni","date":"2019-08-27T11:49:41.843+0000","up_votes":1,"down_votes":0,"body":"stimmt, Bademäntel und Sonnebrille, das ging. Aber auch der Bademantel muss regelmäßig gelüftet werden.","replies":[{"poster":"Kirschkern","date":"2019-08-27T11:57:01.141+0000","up_votes":1,"down_votes":0,"body":"Und nicht mal der besteht aus Stoff sondern aus ... Gummi? Ein Latex Bademantel?","replies":[{"poster":"00 M4ddin 00","date":"2019-08-27T14:50:37.476+0000","up_votes":1,"down_votes":0,"body":"Plastik :D Latex ist zu teuer ^^","replies":[]},{"poster":"Metalmonni","date":"2019-08-27T11:58:09.504+0000","up_votes":1,"down_votes":0,"body":"Stimmt, so war das... Hab lange das Knirschen nicht gehört...","replies":[{"poster":"Kirschkern","date":"2019-08-27T12:00:09.892+0000","up_votes":1,"down_votes":0,"body":"°-° Ist das jetzt was gutes oder eher nicht so?\n\nMüssen wir jetzt Angst haben das es jede Sekunde so weit sein könnte? D:","replies":[{"poster":"Metalmonni","date":"2019-08-27T12:02:11.936+0000","up_votes":1,"down_votes":0,"body":"Vermutlich nicht auszuschließen xD","replies":[{"poster":"Kirschkern","date":"2019-08-27T12:05:20.974+0000","up_votes":1,"down_votes":0,"body":"Okay. Wir sollten uns dazu bereit halten den *Alarmstufe Rot* Knopf zu drücken!","replies":[{"poster":"Metalmonni","date":"2019-08-27T12:55:44.888+0000","up_votes":1,"down_votes":0,"body":"https://media.giphy.com/media/PoCGLo1GS0tIjiTzlF/giphy.gif","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"00 M4ddin 00","date":"2019-08-27T14:51:16.119+0000","up_votes":1,"down_votes":0,"body":"Ungefähr 9:40 glaub ich plus minus ^^","replies":[]}]},{"poster":"Xayah Strife","date":"2019-08-27T11:11:03.088+0000","up_votes":1,"down_votes":0,"body":"Bist du die lange Metallstange rechts hinten?","replies":[{"poster":"00 M4ddin 00","date":"2019-08-27T14:51:36.927+0000","up_votes":1,"down_votes":0,"body":"Ich bin die Maschine da vorne im hinter Grund ^^","replies":[]}]}]},{"poster":"Kirschkern","date":"2019-08-27T05:45:42.446+0000","up_votes":1,"down_votes":0,"body":"Der letzte Anime hört sich an wie \"The Testament of Sister New Devil/ Shinmai Maou no Testament\" wo mir einfällt das ich auch sehr gerne \"Rosario + Vampire\" geguckt habe :o\n\nOh! Heute wirst du glücklich gemacht °-° \n#Zoe, Neeko, Rakan, Xayah\n\nDas sind die neuen Star Guardians. + Neeko bekommt einen SG Prestige Skin.\nHier: https://youtu.be/exrYXbC-MaU\n\nAnsonsten bin ich am Arsch. Einfach am Arsch.\n\nGestern habe ich nach der Arbeit einen früheren Zug genommen, weil Natascha eh nicht da war. Dann bin ich auf der Hälfte meines Heimweges ausgestiegen und in die Stadt gegangen weil ich noch bei Thalia rein wollte um \"Dornenherz\" von Karen Rose zu kaufen. Also ein Buch. Wofür ich ein Jahr gebraucht habe um es zu holen XD obwohl ich die Reihe letztes Jahr so hart verschlungen habe. Naja. Jetzt hab ich es! Vorher war ich aber noch Klamotten kaufen. XD ich will die aber erst anziehen wenn meine Haare gemacht sind >.&lt; \n\nAlles war so recht schnell durch und ich war trotzdem um ... boah ... 19:15 Uhr Zuhause? Hund into duschen into essen und eigentlich hätte ich dann schlafen gehen sollen. Glaub mir ist etwas dezent der Kreislauf abgeschmiert weil ich kreidebleich war .-. sogar meine Lippen. Aber mein innerer Teufel hat mich geritten und war der Meinung ich müsse noch drei TFT Spiele spielen für die EXP Kugel. Man bekommt doch mehr EXP wenn man vorher Spiele absolviert, oder? Diese fünf \"Balken\" ... \n\nWar jedenfalls eine Qual sich bis irgendwas zwischen 22Uhr und 22:30 Uhr wach zu halten. Denn die Nächte sind bei dieser Wärme/ Schwüle auch zum kotzen. Vor allem wenn man noch von so einer scheiß Mücke penetriert wird °-°\n\nAußerdem war meine Mama so nett auf dem Balkon, direkt vor meinem riesen Fenster eine Kette mit Solar-Leuchtkugeln aufzuhängen XD Wäre es wenigstens vor der Balkontüre gewesen ... da kann ich ein Rollo runter machen das auf der Innenseite befestigt ist. Aber das Fenster hat nur so ein Außenrollo und wenn ich das GANZ runter lasse, kommt auch keine Luft mehr rein. Also leuchtet mein Schlafzimmer nachts als wäre es Vollmond °-°\n\nIch frühstücke jetzt. Hab mein Wasser vergessen c.c WP\n\nP.S.\nMir tut der Finger weh beim scrollen >.&lt;","replies":[{"poster":"INoKami","date":"2019-08-27T07:06:49.255+0000","up_votes":1,"down_votes":0,"body":"> Rosario + Vampire\n\nHätte nie gedacht, dass ich diese Worte mal in den Mund nehmen darf, aber: The Manga was better! \n\nBam. Jetzt fühle ich mich auch mal cool :*","replies":[{"poster":"Kirschkern","date":"2019-08-27T07:37:15.883+0000","up_votes":1,"down_votes":0,"body":":o Du darfst alles in den Mund nehmen was du möchtest!","replies":[{"poster":"INoKami","date":"2019-08-27T07:52:24.371+0000","up_votes":1,"down_votes":0,"body":"Uuuuuuuuiiiii, darf ich?\nNa, dann komm mal her und lass mich deine... [Nutzer würde für 14 Tage vom Forum verbannt]","replies":[{"poster":"Kirschkern","date":"2019-08-27T07:54:55.738+0000","up_votes":1,"down_votes":0,"body":"O.O Wieso bekommst du einen 14 Tage Bann, wenn du doch nur was von meiner Nektarine oder der Mango haben wolltest? :o","replies":[{"poster":"INoKami","date":"2019-08-27T10:13:04.233+0000","up_votes":1,"down_votes":0,"body":"Weil ich etwas zu sehr ins Detail gegangen bin, welche Teile von dir ich mal gerne in den Mund nehmen möchte ;)\nKommt davon, wenn du mir solche Möglichkeiten eröffnest...","replies":[]}]}]}]}]}]}]}