{"poster":"Xayah Strife","date":"2019-07-30T05:39:09.378+0000","title":"[TGSG] 45% Anime, 45% TFT und 10% Hitze","subforum":"Allgemeiner Chat","up_votes":4,"down_votes":0,"body":"Guten Morgen meine flauschigen Freunde, \r\n\r\nhttps://cdn.awwni.me/1c9y5.jpg\r\n\r\nheute mal ein bisschen weniger Anime weil mir dazu kein großes Thema einfällt. \r\nIch wollte einmal kurz über Syncros mit euch sprechen. \r\nDie meisten Animes welche ich in den letzten Monate geschaut habe waren fast alle Subs darum hab ich mich auch an das Lesen gewöhnt und die Sprache gut gewöhnt. \r\nMittlerweile erkenne ich sogar teilweise Sprecher aus anderen Animes wieder. \r\nDie japanische Originalstimme von Kirito höre ich extrem oft was mich schon langsam nervt. \r\nAber japanische VA sind schon krass wenn man sich mal anschaut wie viele Animes die synchronisieren und dabei häufig sogar komplett anderes klingen. \r\nDas ist ähnlich wie mit der deutschen Stimme von Trunks die hört man auch überall...\r\nAllerdings hören sich deutsche Stimme irgendwie immer gleich an und du hast gleich ein Charakter im Kopf mit dem du diese Stimme verbindest. \r\nViolett Garden ist auf deutsch so komisch. Warum hat sie die Stimme von Arya? o.O \r\nIch will doch nicht bei einem Anime an GoT denken...\r\nWas halt nervt ist das bei Dubs nicht immer darauf geachtet wird einen VA immer von der gleichen Person sprechen zu lassen. Obwohl japanischen VA sehr talentiert sich und wie sagt  unterschiedliche Rolle sprechen können die sich alle etwas anderes anhören. \r\nWarum kriegen das deutsche Sprecher nicht hin Ihre Stimme der Rolle gut anzupassen? \r\nIm deutschen Bereich nimmt man einfach eine Stimme die irgendwie zu der Rolle passt was dann bestimmt Anspielungen kaputt macht. \r\nDas war in Shield Hero z.B. das der Schwerthero Kirito Stimme und der Waffenhändler die Stimme von Ägil was eine nette Anspielung ist. \r\n\r\nBtw ich vermisse Tommy Morgenstern...\r\nWer nicht weiß wenn er gesprochen bitte nachschauen. \r\n\r\nTFT tiltet mich langsam mehr als der normale League. \r\nIch komme mit dem Zufallsfaktor einfach nicht klar. \r\nIch brauche das Gefühlt mehr Einfluss auf das Spiel zu haben und nicht abhängig zu sein ob ich meine Karten bekommen oder nicht. \r\nWahrscheinlich ist es ein Fehler von mir häufig mit den gleichen Champions zu spielen weil diese nicht immer gleich oft vorzukommen - zumindest gefühlt was eigentlich nicht sein sollte. Aber ich habe leider mehr Erfolg mit einer Komb die ich kenne als das wieder was neues auszuprobieren. \r\nObwohl ich schon mal probiert habe Combs nachzuspielen. Bei Gegner sieht es dann so aus das ich denke \"WTF was macht der bitte an Schaden? - Der cheatet doch\r\nUnd bei mir denke ich mir dann \"Wie kann man mit so was nur Erfolg haben?\" \r\n\r\nMittlerweile gibt es auch echt krasse Leute in den Rankeds da hab ich einfach keine Chance geben aber vllt hatten die genau in dieser Runde auch nur Glück wer weiß. \r\nAber in der Rangliste sieht man ja die Siege (Hier zählt nur Platz 1) und ich habe nur lächerliche 4 Siege. Andere haben bei mir in der Liga 10 oder mehr Siege. \r\nIch glaube irgendwas mache ich noch falsch. Platz 1 ist echt schwer zu bekommen und Platz 2 - 4 recht ja auch schon was bei mir eher der Fall ist. \r\nMeine MMR scheint nun nach 50 Games fester geworden zu sein. Ich kriege für Platz 4 nur noch 10 LP und verliere dementsprechend auch weniger. Gold ist dann wohl erst mal meine Trueelo. \r\nAußerdem regt mich das Karussell so auf. Da gibt es wirklich Leute die picken nicht sondern warte extra vor einer Einheit bis jemand die haben möchte und nehmen die dann im letzten Moment weg...\r\nIch muss mich bei TFT echt mehr beherrschen sonst krieg ich bald die nächste Chatsperre - So wie ich in manchen Games rumgetiltet habe mache ich mir fast selbst Angst. o.O \r\nVllt lag es auch an der Hitze das ich so leicht reizbar bin in der letzten Woche...Ich wollte auch eigentlich weniger TFT spielen aber das Ziel Platin reizt mich noch..\r\nIch komme einfach nicht von dir los TFT. >.&lt; \r\n\r\nBtw yeah es ist endlich kühler. Ich war die letzte Woche kaum draußen weil ich es nicht ausgehalten habe. Muss jetzt unbedingt eine Menge Bewegung nachholen sonst werde ich noch fett XD. \r\nIch freue mich schon auf den Herbst der Sommer ist echt nicht mehr auszuhalten - verdammter Klimawandel.  \r\n\r\nReicht dann glaube ich auch für heute. \r\n\r\nSchönen Tag wünsche ich euch ^_^","replies":[{"poster":"NPL Husaberg","date":"2019-07-30T13:50:30.118+0000","up_votes":1,"down_votes":0,"body":"Hat irgendjemand eine Ahnung, wann man mit einem neuen ADC-Champion rechnen kann?","replies":[{"poster":"Xayah Strife","date":"2019-07-30T13:54:48.519+0000","up_votes":2,"down_votes":0,"body":"Wann nicht aber über das was kommt könnte ich schätzen:\nCaitlynn wahrscheinlich\nWarum?\nGunslinger bekommen einen 6er Boni sind aber nur 5 also brauchen noch jemanden.\nDa fällt mir atm nur Cait ein wer da noch reinpassen könnte.","replies":[{"poster":"00 M4ddin 00","date":"2019-07-30T14:13:17.263+0000","up_votes":1,"down_votes":0,"body":"Kaisa vayne ezrael :)","replies":[{"poster":"Xayah Strife","date":"2019-07-30T14:16:44.808+0000","up_votes":1,"down_votes":0,"body":"Vayne ist schon im Spiel.\nEzreal hasse ich über alles der kann gerne wegbleiben. \nKai'Sa wäre schwierig. Bogenschütze oder Revolverheld?","replies":[]}]}]}]},{"poster":"Eibert Rümmel","date":"2019-07-30T10:00:14.016+0000","up_votes":1,"down_votes":0,"body":"kennt den noch wer?\n\nhttps://www.youtube.com/watch?v=oTs0xdeMRDI","replies":[{"poster":"Xayah Strife","date":"2019-07-30T10:59:30.274+0000","up_votes":1,"down_votes":0,"body":"Kennst du eigentlich Teemo vs All?","replies":[{"poster":"Eibert Rümmel","date":"2019-07-30T11:14:22.428+0000","up_votes":1,"down_votes":0,"body":"ne","replies":[{"poster":"Xayah Strife","date":"2019-07-30T11:19:50.412+0000","up_votes":1,"down_votes":0,"body":"Der macht lustig Leagueanimationen auf Youtube und ein wenig Hentai. :) \n\nhttps://www.youtube.com/watch?v=0oKxXr8Zw98","replies":[{"poster":"INoKami","date":"2019-07-30T14:21:18.625+0000","up_votes":1,"down_votes":0,"body":"Zuerst war ich so \"Warte... Strife-san kennt den auch?\"\n\n2 Sekunden später: \"Ah... wieso überrascht mich das überhaupt?!\"^^","replies":[{"poster":"Xayah Strife","date":"2019-07-30T14:30:21.318+0000","up_votes":1,"down_votes":0,"body":"Das wird einem zwangsläufig vorgeschlagen wenn man auf Youtube Leagueanimationen anschaut.\nUnd Mann klickt da gerne drauf wenn der Titel heisst \"Sivir sexy Pentakill\". :D","replies":[{"poster":"INoKami","date":"2019-07-30T14:33:29.056+0000","up_votes":1,"down_votes":0,"body":"Ich hab jetzt nicht zwingend nach Leagueanimationen gesucht, aber es tauchte irgendwann in meinem Empfehlungen auf und ich gebe zu, die Kombination aus Titel und Thumbnail hat doch etwas neugierig gemacht... :*","replies":[]}]}]},{"poster":"Eibert Rümmel","date":"2019-07-30T12:59:59.211+0000","up_votes":1,"down_votes":0,"body":"find ich beides Langweilig. Da reicht nicht mal das Teemoim namen, dass ich mir das anschaue","replies":[]}]}]}]}]},{"poster":"4 For Maggie","date":"2019-07-30T10:35:57.033+0000","up_votes":1,"down_votes":0,"body":"Ich überlebe die restlichen 3,5 Stunden nicht x.x","replies":[{"poster":"Metalmonni","date":"2019-07-30T10:41:07.477+0000","up_votes":1,"down_votes":0,"body":"Ich bete für dich","replies":[{"poster":"00 M4ddin 00","date":"2019-07-30T10:57:31.893+0000","up_votes":1,"down_votes":0,"body":"Holy !","replies":[{"poster":"Metalmonni","date":"2019-07-30T11:04:56.224+0000","up_votes":1,"down_votes":0,"body":"Holy what? xD","replies":[{"poster":"00 M4ddin 00","date":"2019-07-30T14:15:02.588+0000","up_votes":1,"down_votes":0,"body":"Du bist wieder da das freut mich :) \nWollte dich schonmal anschreiben hab mich aber nicht getraut :D","replies":[]}]}]}]}]},{"poster":"4 For Maggie","date":"2019-07-30T12:48:50.686+0000","up_votes":1,"down_votes":0,"body":"Wieso zieht sich der Tag heute wie Kaugummi? XD\n\nWarum hab ich immer das Gefühl das die Interessenten die 'ne Besichtigung wollen fake sind?\n\nWarum ist es so warm gerade?\n\nWarum habe ich Hunger obwohl ich keinen Hunger haben kann?\n\nIch will in meinen Zug und schlafen °^°","replies":[{"poster":"Metalmonni","date":"2019-07-30T12:51:37.982+0000","up_votes":1,"down_votes":0,"body":"Der Grund:\n\nWeil Kätzchen ziemlich niedlich sind.","replies":[{"poster":"4 For Maggie","date":"2019-07-30T12:57:47.409+0000","up_votes":1,"down_votes":0,"body":"MEINE KATZEN EH ...\n\nNichts gegen Chila ... aber Nala >.&lt;\n\nSonntag: Nala macht sich meinen Kleiderschrank im Ankleidezimmer auf zerrt sich einen Pullover raus und verschleppt ihn in den Flur °^° Damit sie sich drauf legen kann.\n\nGestern: Wäscheständer steht im Flur mit den Seitenflügeldingern zusammen geklappt. Einer meiner Flauschesocken liegt oben drauf. Nala nimmt Anlauf vom Tresen und spring auf den Wäscheständer. Erst liegt sie ... dann sieht sie meinen Socken ... nimmt ihn in den Mund und läuft damit weg °^°\n\nDas hat die sich von Rocky abgeguckt. Der rennt auch entweder mit Socken weg oder klaut sich Schuhe >.&lt;","replies":[{"poster":"Xayah Strife","date":"2019-07-30T13:04:55.216+0000","up_votes":1,"down_votes":0,"body":"Ich war gestern Abend mit Robert in Wald zum laufen.\nDas war sehr angenehmen. \nIch leihe mir dein Hund die Tage vllt nochmal aus zu laufen. \nDas macht einfach viel mehr Spaß als alleine. ^^","replies":[{"poster":"4 For Maggie","date":"2019-07-30T13:09:20.397+0000","up_votes":1,"down_votes":0,"body":"Nein ó.ò","replies":[{"poster":"Xayah Strife","date":"2019-07-30T13:13:35.334+0000","up_votes":1,"down_votes":0,"body":"Okay dann hab ich das wohl geträumt....","replies":[{"poster":"4 For Maggie","date":"2019-07-30T13:48:36.311+0000","up_votes":1,"down_votes":0,"body":"°^° Hör auf von meinem Hundi zu träumen?!","replies":[{"poster":"Xayah Strife","date":"2019-07-30T13:56:57.730+0000","up_votes":1,"down_votes":0,"body":"Von was soll ich denn sonst träumen?\nVon deinen beiden Muschis?","replies":[]}]}]}]}]},{"poster":"Metalmonni","date":"2019-07-30T13:04:08.557+0000","up_votes":1,"down_votes":0,"body":"Das is doch nüdlüch ^^","replies":[{"poster":"4 For Maggie","date":"2019-07-30T13:10:37.290+0000","up_votes":1,"down_votes":0,"body":"Ist es, aber das darf sie niemals erfahren XD NIEMALS.\n\nSonst sehe ich sie als nächstes meinen Schreibtischstuhl durch die gegen rollen. Oder Nala liegt drauf während sie Chila zwingt zu schieben XD Bei der weiß man nie so recht ...","replies":[{"poster":"Metalmonni","date":"2019-07-30T13:15:22.034+0000","up_votes":1,"down_votes":0,"body":"Für so was sind meine Katzen viel zu dumm ^^","replies":[{"poster":"4 For Maggie","date":"2019-07-30T13:40:23.834+0000","up_votes":1,"down_votes":0,"body":"Ich würde gerne mal wissen wie es \"normale\" Tiere zu haben die einfach nur essen, trinken und schlafen XDDDD\n\nSogar meine Schildkröten oder Flusskrebse früher waren im ganzen Ort bekannt, weil sie die Angewohnheit hatten aus dem Teich zu krabbeln und in den Bach zu springen XD Aber ein paar Straßen weiter wurden sie trotzdem immer wieder gefunden. Als wollten sie lediglich einen klitze kleinen Ausflug machen >.&lt;","replies":[{"poster":"Xayah Strife","date":"2019-07-30T13:42:52.041+0000","up_votes":1,"down_votes":0,"body":"Herzlichen Glückwunsch!!!\nSie sind Kommentar Nummer 300. :)\nSie haben so viele Waschmaschinen wie Sie tragen können gewonnen. ;)","replies":[{"poster":"4 For Maggie","date":"2019-07-30T13:48:15.766+0000","up_votes":1,"down_votes":0,"body":"Also nur vier Stück?\n{{sticker:sg-soraka}}","replies":[{"poster":"Xayah Strife","date":"2019-07-30T13:56:06.496+0000","up_votes":1,"down_votes":0,"body":"Das würde mir sorgen machen wenn du 4 schaffst.\nDieser Frauenkörper will ich mir gar nicht vorstellen das wäre bääh.","replies":[]}]}]}]},{"poster":"Xayah Strife","date":"2019-07-30T13:27:10.028+0000","up_votes":1,"down_votes":0,"body":"Trainierst du deine Katzen denn?","replies":[]}]}]}]}]}]},{"poster":"Xayah Strife","date":"2019-07-30T12:57:05.593+0000","up_votes":1,"down_votes":0,"body":"Weil der Tag doof ist. \nWeil die nur dein hübsches Gesicht sehen wollen. \nWeil du so heiß bist. \nWeil du aus Langeweile Hunger bekommt. \n\nDie Bahn hat heute leider verspätung.","replies":[{"poster":"4 For Maggie","date":"2019-07-30T12:59:27.178+0000","up_votes":1,"down_votes":0,"body":"> Die Bahn hat heute leider verspätung.\n\nIch hatte gestern schon fast 20 Minuten Verspätung >.&lt; reicht für diese Woche!","replies":[{"poster":"Xayah Strife","date":"2019-07-30T13:01:38.261+0000","up_votes":1,"down_votes":0,"body":"20 Minuten geht ja sogar noch...\nStell dir der Zug würde ausfallen das wäre noch viel schlimmer...","replies":[{"poster":"4 For Maggie","date":"2019-07-30T13:07:44.293+0000","up_votes":1,"down_votes":0,"body":"Letzten Donnerstag oder Mittwoch hab ich den Bus zum Bahnhof so genommen das ich einen Zug früher hätte fahren können. Nur das ich am HBF angekommen bin um 16:40 und seit 16:10 Uhr nichts mehr gefahren ist XD Also drei Zugausfälle.\n\nDer Zug um 16.40 kam erst um 16.55 >.&lt; Aber glücklicherweise mit zwei langen Einheiten. Da bin ich schnell so gelaufen das ich an meiner Türe gestanden habe um sicher einen Sitzplatz zu bekommen. War zwar nicht so viel los, aber trotzdem.\n\nDer Zug ist dann um 17 Uhr abgefahren.\n\nUm 17.45 war ich fast Zuhause und hätte regulär auf den Zug um 18 Uhr warten müssen. Aber da ist ein Zug eingefahren der ebenfalls 15 Minuten Verspätung hatte XDDD Da bin ich dann raus und im Endeffekt trotzdem 15 Minuten früher Zuhause weil ich abgeholt wurde :'D","replies":[{"poster":"Xayah Strife","date":"2019-07-30T13:11:48.932+0000","up_votes":1,"down_votes":0,"body":"Das geht noch viel schlimmer.\nVor Hamburg liegt ja Hamburg-Harburg und da fahren viele Zug durch oder halten aber leider gibt es dort nur 6 Gleise.\nManchmal staut es sich ja krass vor dem Harburg gerade weil da häufig Baustelle sind. \nDa kommt gerne mal der Zug von 10 nach erst um 40 wenn da viel Stau ist.\nEinmal ist ein Zug auf dem Gleis im Bahnhof kaputt gegangen der hat dann ein Gleis blockiert wodurch alles andere später gekommen ist....","replies":[]}]}]}]}]}]},{"poster":"Xayah Strife","date":"2019-07-30T13:35:23.659+0000","up_votes":1,"down_votes":0,"body":"Es ist schon wieder fast 30 Grad...>.&lt; \nWarum? \nEs sollte doch kühler werden...\nIch wollte eigentlich noch Joggen gehen aber jetzt sinkt meine Motivation bei der Hitze.","replies":[]},{"poster":"Xayah Strife","date":"2019-07-30T11:57:03.951+0000","up_votes":1,"down_votes":0,"body":"Ich hab ein Animecharakter gefunden der perfekt zu Maggie passt. \nhttps://cdn.myanimelist.net/images/characters/16/310190.jpg","replies":[{"poster":"4 For Maggie","date":"2019-07-30T12:47:30.869+0000","up_votes":1,"down_votes":0,"body":"o.o Wieso? ich trage keine Hüte und keine Schleifen und keine .. Umhänge XD","replies":[{"poster":"Xayah Strife","date":"2019-07-30T12:50:59.327+0000","up_votes":1,"down_votes":0,"body":"1. Das ist Zauberhut und du magst Magic.\n2. Die passt sehr gut zu dir von Charakter her...","replies":[{"poster":"4 For Maggie","date":"2019-07-30T13:11:33.394+0000","up_votes":1,"down_votes":0,"body":".-. Aus welchem Anime ist sie denn?","replies":[{"poster":"Xayah Strife","date":"2019-07-30T13:13:12.815+0000","up_votes":1,"down_votes":0,"body":"Zeig ich dir heute Abend. :) \n\nDas ist witzig weil sie die ganze Zeit versucht Zaubertricks versucht zu haben aber bei jedem Trick scheitert. :D","replies":[{"poster":"4 For Maggie","date":"2019-07-30T13:15:05.639+0000","up_votes":1,"down_votes":0,"body":"°^° Statt du mir einfach den Namen sagst D:","replies":[{"poster":"Xayah Strife","date":"2019-07-30T13:19:44.339+0000","up_votes":1,"down_votes":0,"body":"Magical Sempai\nhttps://img1.ak.crunchyroll.com/i/spire2/27bef5a4d1d0832d5a57d61edb37dcc21562025344_full.jpg\nIch habe sie endlich getroffen ... eine niedliche doch auch \"seltsame\" Sempai! Angefüllt mit Liebe für die Kunst der Magie, doch auch mit Lampenfieber liegt ihre Erfolgsquote leider bei miesen 0% — und dennoch kann ich meine Augen nicht von ihr abwenden! Welchen Zaubertrick sie wohl als Nächstes präsentieren wird? Ein Hoch auf nicht-athletische Hobbys!","replies":[]}]}]}]}]},{"poster":"Necromant","date":"2019-07-30T12:52:15.295+0000","up_votes":1,"down_votes":0,"body":"Warum liegt hier eigtl. Stroh?","replies":[{"poster":"Xayah Strife","date":"2019-07-30T12:55:26.148+0000","up_votes":1,"down_votes":0,"body":"Weil wir damit die Kühe füttern müssen.\nWir brauchen schließlich Milch für unsere Cornflakes. :)","replies":[]}]}]}]},{"poster":"4 For Maggie","date":"2019-07-30T11:23:27.876+0000","up_votes":1,"down_votes":0,"body":"Irgendjemand...\n\nHat einfach Eierbecher im Treppenhaus auf den Stufen verteilt XDDDDDDDDD","replies":[{"poster":"Metalmonni","date":"2019-07-30T11:46:11.397+0000","up_votes":1,"down_votes":0,"body":"Also **DAS** ist ziemlich witzig ^^. \n\nMuss ich mir für die Arbeit merken ^^","replies":[]}]}]}