{"poster":"Xayah Strife","date":"2019-12-12T08:24:43.142+0000","title":"[TGSG] Notfallthread und so","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":1,"body":"Guten Morgen meine flauschigen Freunde, \r\n\r\nhttps://i.redd.it/icrk8fadd2441.jpg\r\n\r\neigentlich wollte ich kein Thread schreiben aber da noch kein Thread da ist muss ich wohl ein Thread schreiben obwohl ich gar kein Thread schreiben wollte. \r\nGestern ist eigentlich kaum etwas wichtig passiert. Ich habe eine Menge PVP gespielt in WoW um neuen Items zu farmen was gefühlt ewig dauert. \r\nGerade weil ich mal wieder in der Fraktion spiele die taktisch kein Plan hat aber wir spielen ja alle in der Fraktion, die kein Plan hat, wenn wir verlieren, oder? ;) \r\nDann war ich noch in der Arena und nachdem wir die ersten 4 Game verloren erstmal 6 oder mehr Games in Folge gewonnen alles super positive Winrate und so. \r\nDann kam aber das Killmatch mal wieder gegen Mage und ich hasse Mage, weil ich 50% des Kampfes im Sheep verbringen. Es war soo lame. Gefühlt 10 Minuten ging der Kampf (Es war 7 Minuten in Wirklichkeit) und es war einfach keine action drinne. \r\nIch würde einschlafen, wenn ich selbst Mage spielen müsste oder mit einem Mage in einem Team wäre. Die ziehen halt alle Kämpfe in die Länge - ätzend sowas. \r\nAufjedenfall ist mein Mate nach dem Kampf, welchen wir verloren hatte, dann instand offline gegangen was ich verstehen kann. Der Lose ist gar nicht so schlimm aber in der Zeit von dem Game hatte man gegen 3 Teams spielen können. >.&lt; \r\n\r\nDann weiter mein Twink gelevelt, weil ich keine lust mehr auf PVP hatte. Waren ja nur noch 4 Level. \r\n4 Level sind halt lang wenn überall die andere Fraktion rumfliegt. \r\nIch hatte um 18 Uhr mit dem Level angefangen und immer wieder Pausen eingelegt, weil ich von irgendwelchen Affen gecamped wurde. \r\nIch hasse PVP Server mittlerweile so sehr. Manche Affen gehen sogar soweit das sie im Flugmount ein Spell benutzen um dich onezushoten. Natürlich kriegen dann Fallschaden, weil das ausführen eines Spells während man auf einem Flugmount sitzt dazu führt das man selbst abmounten und natürlich runterfällt. \r\nAber manche Leute sind so bescheuert die tun alles, um dich zu töten. EINFACH ALLES. Okay bei einem normalen Spielen wurde das vllt auch gehen, weil ich dann auch abmounte aber ich war Druide in Flugform mir ist das egal solange sein Spell kein Oneshot ist. :D \r\n\r\nZwischendurch während ich gecamped wurde habe ich eine wunderschönen Animefilm gehen. Es war so schön, dass ich mich fragen ob ich darüber einen eigenen Thread machen sollte. \r\n\"Seishun Buta Yarou wa Yumemiru Shoujo no Yume wo Minai\" oder auch Rascal Does Not Dream of a Dreaming Girl ist eine vorsetzung der ersten Staffel und war absolut überragend. \r\nDie hohen Bewertungen finde ich vollkommen verdingt. War sehr spannend und emostional hätte mehrmals fast geweint. \r\n\r\nAchja und League hmm.. interessiert mich gerade nicht so wirklich.\r\nIch werde wohl ab und zu mal TFT spielen aber kaum League. \r\nObwohl gestern dachte ich mir - wozu führen die eigentlich Senna ein? Die gab es doch schon und gibt Lucan sogar ein Buff, wenn sie stirbt. \r\nAber das war ja nicht in TFT, sondern in dem Kartenspiel. :D \r\nDieses Soollinkding wo der eine weiterlebt bis beide sterben finde ich btw total broken. Wer hat sich das schon wieder ausgedacht? \r\n\r\nReicht das jetzt Thread oder wollt ihr noch mehr Inhalt haben?","replies":[{"poster":"G2 Slippi","date":"2019-12-12T08:53:57.708+0000","up_votes":1,"down_votes":0,"body":"Ich freu mich schon so, wenn ich heute nachhause komme :) Da wird erst mal die Switch angeworfen und ein Starterpokemon gewählt :D \nVorbereitung für Clash steht ebenso auf dem Programm. Vielleicht schaffen wir es ja dieses Wochenende zumindest eines der beiden Clashes zu gewinnen ^^\n\nArbeit sucked, will eigentlich nur nachhause xD","replies":[{"poster":"Xayah Strife","date":"2019-12-12T08:56:05.997+0000","up_votes":1,"down_votes":0,"body":"Ach Clash stürzt doch eh wieder ab...\nDa habe ich keine Hoffnung mehr.","replies":[{"poster":"G2 Slippi","date":"2019-12-12T08:58:56.159+0000","up_votes":1,"down_votes":0,"body":"Bei mir hats die letzten drei Mal funktioniert :D","replies":[{"poster":"Kirschkern","date":"2019-12-12T09:00:53.329+0000","up_votes":1,"down_votes":0,"body":"Alle die es streamen wollten konnten nicht XD ... Hab mich vertan mit dem ESG Clash. Letztes WE ging das gar nicht weil Freddy in LA war :o Deswegen hätte Broeki mit SPIN gespielt aber ... War halt Crash und nicht Clash =p","replies":[{"poster":"G2 Slippi","date":"2019-12-12T09:03:14.805+0000","up_votes":1,"down_votes":0,"body":"Hat vl doch Vorteile in Tier 4 zu spielen ^^\nWar wahrscheinlich bei den Top Tier Brackets dann schon zu sehr überlastet","replies":[{"poster":"Kirschkern","date":"2019-12-12T09:08:35.331+0000","up_votes":2,"down_votes":0,"body":"Ich spiele auch wie ein Tier!\nhttps://media.tenor.com/images/91638eefea3c9d4eafdf60566a9c475a/tenor.gif","replies":[{"poster":"Xayah Strife","date":"2019-12-12T09:20:04.453+0000","up_votes":1,"down_votes":0,"body":"Das ist super.\nViel besser als der Hund. \n{{sticker:sg-jinx}}","replies":[{"poster":"Kirschkern","date":"2019-12-12T09:41:06.128+0000","up_votes":1,"down_votes":0,"body":"=p Der kleine süße Welpe kommt wieder zum Einsatz sobald cranc sich zu Wort meldet!","replies":[{"poster":"G2 Slippi","date":"2019-12-12T10:03:51.187+0000","up_votes":1,"down_votes":0,"body":"Sollten wir nich mal versuchen cranc einfach zu ignorieren?","replies":[{"poster":"Kirschkern","date":"2019-12-12T11:01:44.245+0000","up_votes":1,"down_votes":0,"body":"Aber wieso? Er scheint nicht sonderlich aggressiv zu sein und ich hab immer das Gefühl ihn knuddeln zu müssen °^°","replies":[{"poster":"Nanary","date":"2019-12-12T11:34:50.733+0000","up_votes":1,"down_votes":0,"body":"du kannst auch mich knuddeln hrr~◝(⁰▿⁰)◜","replies":[{"poster":"G2 Slippi","date":"2019-12-12T12:22:57.942+0000","up_votes":1,"down_votes":0,"body":"Ja du hast es auf jeden Fall verdient geknuddelt zu werden. Dieser Möchtegerntroll aber nicht ^^","replies":[{"poster":"Xayah Strife","date":"2019-12-12T17:19:23.859+0000","up_votes":1,"down_votes":0,"body":"Färbe ich jetzt schon bei dir ab?\nSollte das etwa eine Anmachen in Richtung Nana sein?\nLass das bloß nicht deine Frau sehen. ^^","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"colonel cranc","date":"2019-12-12T11:58:36.283+0000","up_votes":1,"down_votes":0,"body":"Habt ihr kinder?","replies":[{"poster":"Kirschkern","date":"2019-12-12T12:01:44.381+0000","up_votes":1,"down_votes":0,"body":"https://media.tenor.com/images/ab604ce14313c4a0eadd296e78c4839d/tenor.gif","replies":[{"poster":"colonel cranc","date":"2019-12-12T12:12:41.400+0000","up_votes":1,"down_votes":0,"body":"hab mir schon gedacht, dass die \"dame\" kirschkern eher der hundetyp ist. ist so notiert","replies":[{"poster":"Kirschkern","date":"2019-12-12T12:15:46.373+0000","up_votes":1,"down_votes":0,"body":"Was sollen denn die Anführungszeichen? D:\n\nIch hab aber auch zwei Katzen :o Vielleicht mag ich ja beides?","replies":[{"poster":"colonel cranc","date":"2019-12-12T12:31:35.747+0000","up_votes":1,"down_votes":0,"body":"nun, da meine quelle, welche zu der annahme geführt hat, das es sich bei euch um eine Person des weiblichen geschlechtes, der Forennutzer \"xayah Strife\" ist und dementsprechend nicht vertrauenswürdig, sind das ganz normale sicherheitsmassnamen um allfälligen Strafen für \"missgendering\" zu entgehen. \nJa, Katzen sind auch sehr schöne Tiere. Zu Schade, dass diese Wesen in naher zukunft mit üppigen einschränkungen ihrer Lebensführung rechnen müssen oder gar ganz verboten werden, sollten sich gewissen Personen weiterhin so durchsetzen. \n\nAlas, die kinderfrage wurde mir leider immernoch nicht beantwortet. ich nehme aber die erwähnung der katzen gerne auf.","replies":[{"poster":"Kirschkern","date":"2019-12-12T12:54:21.641+0000","up_votes":1,"down_votes":0,"body":"Ich muss das erst entwirren °^°\n• nun, da meine quelle der Forennutzer \"xayah Strife\" ist und dementsprechend nicht vertrauenswürdig, sind das ganz normale sicherheitsmassnamen um allfälligen Strafen für \"missgendering\" zu entgehen.\n\nDas hätte ich schon mal. Aber das davor verstehe ich nicht XD Aber kann ich auch gar nicht, oder? Weil da irgendein Dreher drin ist der das ganze so verwurschtelt o.O\n\nOder da fehlt so etwas wie \"Da die Informationen meiner Quelle mich zu der Annahme geführt haben das [...]\" °^° \n\nUnd ... Wieso sollten Katzen verboten werden? ô.ô Zu aller erst sollte es Menschen mit Kinderwagen und Fahrrädern verboten werden in meine Busse einzusteigen. Ich meine ... die haben doch selbst Räder, hallo? Dann muss diese 40 Köpfige Familie dran glauben ... DANN fällt mir bestimmt noch etwas ein und DANN noch was und DANN kommt das Katzenthema eventuell in Frage.\n\nKinder hat hier keiner von den derzeit anwesenden. Wobei ich bin mir fast ziemlich sicher bin das uns bald ein TGSG-Kind erwartet.","replies":[{"poster":"Uranbrennstab","date":"2019-12-12T12:56:20.372+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kirschkern,realm=EUW,application-id=YnZkMR0R,discussion-id=dmZOP5RQ,comment-id=000800000000000000000001,timestamp=2019-12-12T12:54:21.641+0000)\n> Kinder hat hier keiner von den derzeit anwesenden. Wobei ich bin mir fast ziemlich sicher bin das uns bald ein TGSG-Kind erwartet.\n\n\nUnsers?","replies":[{"poster":"Kirschkern","date":"2019-12-12T13:31:30.757+0000","up_votes":1,"down_votes":0,"body":"Nein. Knuffels\n\nIch meine natürlich Knuffel °-° Ohne S","replies":[{"poster":"Xayah Strife","date":"2019-12-12T17:21:55.664+0000","up_votes":1,"down_votes":0,"body":"Wer ist Knuffels?","replies":[{"poster":"Kirschkern","date":"2019-12-12T20:36:58.454+0000","up_votes":1,"down_votes":0,"body":"QBert. Und das S gehört da nicht hin :D mein Fehler!","replies":[{"poster":"Xayah Strife","date":"2019-12-13T07:38:54.916+0000","up_votes":1,"down_votes":0,"body":"Und das musstest du mitten in der Nacht schreiben? \nGBert gibt es nicht mehr seine Zeit im Forum ist vorbei.","replies":[]}]}]}]}]},{"poster":"Xayah Strife","date":"2019-12-12T17:21:25.057+0000","up_votes":1,"down_votes":0,"body":"Ich hab erst gelesen das er uns unterstellt ein und dieselbe Person zu sein. \nAber ich habe ehrlich gesagt keine Lust dazu eine Frau zu sein. :(","replies":[]},{"poster":"G2 Slippi","date":"2019-12-12T13:04:06.223+0000","up_votes":1,"down_votes":0,"body":"Das ist schon wieder so ein schöner Nährboden für Strifes plumpe Anmachversuche xDDDD","replies":[{"poster":"Kirschkern","date":"2019-12-12T13:21:09.685+0000","up_votes":1,"down_votes":0,"body":":o Das mit dem Kind?","replies":[{"poster":"G2 Slippi","date":"2019-12-12T13:22:04.742+0000","up_votes":1,"down_votes":0,"body":"ja","replies":[{"poster":"Kirschkern","date":"2019-12-12T13:32:20.582+0000","up_votes":1,"down_votes":0,"body":"Du beschwörst ihn noch herauf wenn du ihn so mit der Nase darauf stößt D:\n\nEr ist doch afk =p Genieße die Freiheit!","replies":[{"poster":"Xayah Strife","date":"2019-12-12T17:18:04.777+0000","up_votes":1,"down_votes":0,"body":"Ich wurde festgehalten aber das ist Privat davon möchte ich hier nichts erzählen.","replies":[]},{"poster":"G2 Slippi","date":"2019-12-12T13:55:51.654+0000","up_votes":1,"down_votes":0,"body":"Hast recht, ich bin schon leise ^^","replies":[]}]}]}]},{"poster":"Xayah Strife","date":"2019-12-12T17:17:13.340+0000","up_votes":1,"down_votes":0,"body":"Nein ich möchte tatsächlich keine Kinder haben. :)","replies":[]}]},{"poster":"colonel cranc","date":"2019-12-12T13:06:58.064+0000","up_votes":1,"down_votes":0,"body":"Mein Satzbau mag tatsächlich etwas eigen sein. dafür entschuldige ich mich. \n\nZum Katzenverbot: \nhttps://www.nabu.de/tiere-und-pflanzen/voegel/gefaehrdungen/katzen/15537.html\nhttps://www.welt.de/vermischtes/article204049392/Katzen-Juristen-fordern-Ausgehverbot-zum-Schutz-von-Voegeln.html\n\nnatürlich hoffe ich, dass du diesen Umstand akzeptieren wirst zum schutze der Umwelt, du willst doch nicht etwa eine ewiggestrige sein, der der Planet komplett egal ist, oder?","replies":[{"poster":"Kirschkern","date":"2019-12-12T13:30:03.514+0000","up_votes":1,"down_votes":0,"body":"\"Eigen\" würde ich das nicht nennen :p Da fehlt eindeutig etwas oder ist falsch!\n\nAlso ich hab jetzt nur im zweiten Link gelesen \"Ausgehverbot zum Schutz von Vögeln\" .. meine Katzen sind keine Freigänger.","replies":[{"poster":"colonel cranc","date":"2019-12-12T13:36:53.157+0000","up_votes":1,"down_votes":0,"body":"es gibt Tierschützer, die das Halten von Katzen zum schutz der Vögel generell verbieten wollen, und wie es so schön ist, sind glühende befürworter dieser \"Ideologie\" derzeit mit 22% in Eurem Parlament. \n\nhttps://www.20min.ch/schweiz/news/story/Gehoeren-Haustiere-wegen-des-Klimas-verboten--20513558\nhttps://www.welt.de/kmpkt/article167384583/So-verpesten-unsere-Hunde-und-Katzen-die-Umwelt.html\nhttps://www.spiegel.de/wissenschaft/mensch/hunde-und-katzen-sind-schlecht-fuers-klima-a-1161678.html","replies":[{"poster":"Kirschkern","date":"2019-12-12T13:53:50.606+0000","up_votes":1,"down_votes":0,"body":"ich würde ja eher eine Ausdünnung der Menschheit befürworten","replies":[{"poster":"G2 Slippi","date":"2019-12-12T14:10:29.652+0000","up_votes":1,"down_votes":0,"body":"Ganz genau :) Der Mensch sollte nur über sein eigenes Leben entscheiden und nicht darüber, ob es in Zukunft Katzen gibt oder nicht","replies":[{"poster":"Kirschkern","date":"2019-12-12T14:48:36.342+0000","up_votes":1,"down_votes":0,"body":"Und ich sollte entscheiden dürfen das ich keine Kinderwagen oder Fahrräder in meinen Bussen haben will c.c Und keine 40 köpfige Familien!","replies":[{"poster":"G2 Slippi","date":"2019-12-12T14:56:54.380+0000","up_votes":1,"down_votes":0,"body":"Ja ein Bus sollte zwei Abteile haben: Eins für Familien mit Kinderwägen und eins für Einzelpersonen und Kleingruppen ohne Kinder","replies":[]}]}]},{"poster":"colonel cranc","date":"2019-12-12T14:05:42.880+0000","up_votes":1,"down_votes":0,"body":"Ich könnte nun sagen wie absolut unpassend und problematisch diese aussage ist, aber ich lasse das nun weil ich wieder zur frohn muss. \nwerde erwarten, dass die liebe forenmoderation wieder mehrere beiträge entfernt und diese konversation wie ein schweizer käse aussieht später.","replies":[]}]}]}]}]}]},{"poster":"Uranbrennstab","date":"2019-12-12T12:44:06.506+0000","up_votes":1,"down_votes":0,"body":"Es gibt Strafen für missgendering... Nein warte, es gibt missgendering?\nUnd welche Personen meinst du? Und wer bist du eigentlich?","replies":[{"poster":"colonel cranc","date":"2019-12-12T13:00:18.613+0000","up_votes":1,"down_votes":0,"body":"mein name is Bernd von Eisenstein und ich bin anscheinend ein sogenannter Forentroll. Wärend diese Bezeichnung eine klare beleidigung gegenüber meiner intelligenz ist, macht mir das nicht aus\n\nWeiter zum Thema missgendering. misgendering ist, wenn man einen mann, der sich als frau identifiziert als \"herr\" o.ä bezeichnet oder das gegenteil. auch wenn man sogenannten nicht-binären gegenüber nicht die richtigen Pronomen verwendet ist das misgendering. Es ist derzeit noch nicht in dem hochheiligen Grundgesetz der Bundesrepublik Deutschland niedergeschrieben, aber in Gorssbritannien, und den USA, genauer Califorinien, gibt es einzelne Fälle wo Journalisten und Arbeitgeber verurteilt wurden weil sie dies gemacht haben.","replies":[{"poster":"Uranbrennstab","date":"2019-12-12T13:04:12.535+0000","up_votes":1,"down_votes":0,"body":"Wo siehst du da den Zusammenhang zwischen Intelligenz und trollen?","replies":[{"poster":"colonel cranc","date":"2019-12-12T13:09:20.109+0000","up_votes":1,"down_votes":0,"body":"Trolle werden gesellschaftlich gerne als störend oder dumm empfunden. \nDie Ebene, auf der ich operiere hat nichts mit diesem zu tun","replies":[{"poster":"Uranbrennstab","date":"2019-12-12T13:21:57.555+0000","up_votes":1,"down_votes":0,"body":"Debatable, wie der Engländer sagt","replies":[{"poster":"colonel cranc","date":"2019-12-12T13:26:54.714+0000","up_votes":1,"down_votes":0,"body":"das ist ein deutsches Forum, bitte die verwendung von englischen wörtern minimal halten.","replies":[{"poster":"Uranbrennstab","date":"2019-12-12T13:45:09.799+0000","up_votes":1,"down_votes":0,"body":"AMTSSPRACHE IST DEUTSCH!\nUND DIESES AUSLÄNDISCH SOLL IN SEINEM EIGENEN LAND BLEIBEN!\n\n\nMEINE MEINUNG!","replies":[{"poster":"Xayah Strife","date":"2019-12-12T17:16:42.220+0000","up_votes":1,"down_votes":0,"body":"Du bekommst heute denn Erfolg:\nVerteidiger des TGSGs","replies":[{"poster":"Xayah Strife","date":"2019-12-12T17:40:15.253+0000","up_votes":1,"down_votes":0,"body":"Doppel Ehre an dich zurück.","replies":[]},{"poster":"Uranbrennstab","date":"2019-12-12T17:31:35.344+0000","up_votes":1,"down_votes":0,"body":"Ehre.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}