{"poster":"Lord Adimar","date":"2018-02-22T07:00:17.272+0000","title":"i get kicked for queue dodging even though i selected a champion.","subforum":"Player Behaviour","up_votes":1,"down_votes":1,"body":"Hi. I&#039;m really really annoyed at the queue dodge system in ranked solo duo. I enter the champ select lobby the first time and i select my champion, i was bot at the time. the timer runs out even though i selected my champion and i get a 5 minute queue block for it. Like wtf, i selected my champion why did this happen the 1st time. Ok so I wait it out and then enter the next match. I select my champion wayyyy before the timer finishes this time and then bam. again I &#039;Allegedly&#039; queue dodged during champ select even though i picked my champion. Now i&#039;m sitting here waiting out a completely unreasonable 30 minute queue dodge timer even though i did exactly what i was supposed to. wtf riot?\n\nI barely play league now and I still like to play occasionally, making sure to join and play matches though fully, and then i get this sort of punishment if i apparently do 2 things wrong, which as described above was something that should not have happened.","replies":[{"poster":"Husy15","date":"2018-02-22T07:49:50.134+0000","up_votes":1,"down_votes":0,"body":"Not too long ago, they added that you need to \"Lock-in\" During champion select for ranked matches (Unsure if this includes draft mode).","replies":[{"poster":"Ninox","date":"2018-02-22T12:16:55.102+0000","up_votes":2,"down_votes":0,"body":"It does include draft mode, but it's also not a recent change. This has been the norm since dynamic queue was a thing (2+ years).","replies":[]}]},{"poster":"Militant","date":"2018-08-11T06:15:41.184+0000","up_votes":1,"down_votes":0,"body":"Wow, glad I found this. I had no idea what was happening to me either. I'm not a frequent player, but get on now and then for a quick game. this really ruined my afternoon. - Honestly, why was this feature added? if you don't lock in, too bad, you get what you picked. Why does it have to disrupt an entire queue system for ten people. I would strongly urge that you reconsider this design choice, it's spanking people for no good reason. Not to mention the tooltip/popup only says for 'declining' or 'abandoning', this should be more clear. At the very least, tell people WHY you are spanking them.","replies":[]},{"poster":"Evelynnie","date":"2018-02-22T08:07:56.460+0000","up_votes":1,"down_votes":0,"body":"Did you Lock-In your champion? Unlike Normals, where you don't have to lock in, if you fail to do so in Ranked, they kick you out.\n\nHope this helps :)\n\n{{sticker:sg-ahri-2}}","replies":[{"poster":"Lord Adimar","date":"2018-04-02T06:35:32.217+0000","up_votes":1,"down_votes":0,"body":"Ahh righto. thanks for that, it does not make sense though to have it you must lock in to successfully choose you're champion, i mean you've picked them but in normals you'd wait for it to auto lock in case you needed to make quick switches or changes. ik it's draft pick in solo ranked but that option to repick ur champ if you needed seemed helpful. Idrk, suppose i'll just have to remember to lock in every time.","replies":[]}]}]}