{"poster":"P0rnstarYaxu0","date":"2018-01-01T23:30:19.178+0000","title":"Internet connection","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"My internet connection is perfectly fine. I can usually play music or watch youtube videos in the background, with absolutely no issues whatsoever. It happens only at random times throughout the game, where my ping seems where it normally is ( around 26 ) and then jumps to 9766, then down to 1847 ( actual numbers ), and I disconnect and reconnect multiple times. I lowered all the graphics to the minimum, and shut off all other applications that use up internet while playing, and the issue still persists. It is not a framerate issue, mines always at 120, just connection. I did a full repair, but with no results. Please help, this issue cost me so many games it's insane. Thank youu","replies":[{"poster":"Son of Ornn","date":"2018-01-04T04:12:29.022+0000","up_votes":1,"down_votes":0,"body":"Sorry to hear it's cost you so many games dood. <:(\n\nTo start, I want to echo Kokua's suggestion and make sure you're on a wired connection and not stressing your connection with other devices, downloads or programs. This, ensures that your connection will be stable for gaming period.\n\nBut since this only seems to happen with League for you, it could be something unrelated to just inconsistent network. Since your ping seems to be at issue here, you could try making sure your routing to LoL isn't crazy by reconfiguring your DNS. Follow the steps in [**our guide here**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#wq5) and test the results in a couple customs. Let me know if you see any similar ping spikes!","replies":[]},{"poster":"Kokua","date":"2018-01-02T02:26:31.066+0000","up_votes":1,"down_votes":0,"body":"Are you on wifi or hard lined? Do you have any other devices connected to your internet at the same time? Possible downloads or automatically scheduled virus scans in the background? More often than not when my ping spikes like this, it's usually an issue with someone else in my house starting a download, or the PS4 or Steam automatically updating a game. You could run through this guide and check for [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues).","replies":[{"poster":"P0rnstarYaxu0","date":"2018-01-14T18:24:50.009+0000","up_votes":1,"down_votes":0,"body":"Wifi. and unfortunately the answer to all of the above were no :\\ Thank you. i'll check it out!","replies":[]}]}]}