{"poster":"mortiferFURY","date":"2015-05-12T20:46:03.871+0000","title":"[GAMEPLAY] Chroma Skin bundles not available for selection in Teambuilder Que","subforum":"Report a Bug","up_votes":2,"down_votes":0,"body":"Hello all,\r\nI bought the Leona Chroma package a few days ago and I noticed when que&#039;ing in a team builder game that we cannot select the colors that would be available to other que&#039;s. (Where you would select the champion skin)\r\nI noticed however the last skin(color) that was selected in a game will be used once you load into the Teambuider game.","replies":[{"poster":"squido","date":"2015-05-12T23:24:33.993+0000","up_votes":1,"down_votes":0,"body":"Yea, seems like a minor glitch. Seems like it will be fixed soon. I mean its probably happening to a lot of people.\n\n Does it happen to {{champion:105}}  too?","replies":[{"poster":"Kürama","date":"2015-05-14T16:00:48.488+0000","up_votes":1,"down_votes":0,"body":"Fixed.","replies":[]},{"poster":"mortiferFURY","date":"2015-05-12T23:41:53.708+0000","up_votes":1,"down_votes":0,"body":"I agree it's pretty minor, I don't know if it affects the other Chromas though as i only have the {{champion:89}} one. I'd be willing to bet that it does seeing as its a pretty new thing and they just didn't (forgot to) put it into Teambuilder champ select.\nBut, if you want the skin (I tested it) and if you just make a custom and change win the champ select then exit before loading the last selected color will loaded. (in my experience)","replies":[]}]},{"poster":"Kürama","date":"2015-05-14T15:59:34.921+0000","up_votes":1,"down_votes":0,"body":"'Tis fixed.","replies":[]},{"poster":"moonstones","date":"2015-05-13T00:23:17.140+0000","up_votes":1,"down_votes":0,"body":"Hey mortiferFURY, \n\nThat's correct - chromas are not currently available in Team Builder. We're looking to add this functionality soon.","replies":[{"poster":"mortiferFURY","date":"2015-05-13T03:16:05.184+0000","up_votes":1,"down_votes":0,"body":"Hi there KateyKhaos thanks for the reply,\nI wasn't sure if this was intended and didn't see that it was posted on the boards anywhere. Just wanted to bring it to the right people's attention if it wasn't working as intended. :D\n\nAgain thanks for the reply, always happy to see the RED marker in the comments.\n*tips hat*   g'day to you","replies":[]},{"poster":"Kürama","date":"2015-05-13T00:40:09.343+0000","up_votes":1,"down_votes":0,"body":"Thursday right? I'm right, right?","replies":[]}]}]}