{"poster":"mau5trap","date":"2017-02-13T13:41:25.183+0000","title":"FIX YOUR F*****G GAME!","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Ranked game, I select adc or mid, first you give me jungle, gj dkheads. so immediately you have taken any possible control out of my hands therefore should not reflect my placements. Then you put me with an outmatched team, I mean all lanes are like bronze vs plat. as in it is just stupid how outmatched my team is. Don&#039;t give me your bullsht excuses, your match making system is utter garbage scrap it and rebuild, and while you are at it remove the loss.\r\nso so disappointed riot, but what&#039;s new? another new champion. \r\nmoney hungry *****","replies":[{"poster":"Revelstoke","date":"2017-02-24T05:16:54.463+0000","up_votes":1,"down_votes":0,"body":"Eh, recently had a daytime game in solo queue with a Platinum enemy ADC, everyone else being silver/bronze. \n\nIt was a foregone conclusion, and it was very frustrating.\nBut that's 1 game out of 20, I dont believe you are seeing 4 plat vs 4 bronze.\n\nAnd yeah I got autofilled 3 times during placements, again frustrating.\n\nLeague has a lot of problems, but Matchmaking isnt one of them imho.","replies":[]},{"poster":"SEKAI","date":"2017-02-18T13:18:35.718+0000","up_votes":1,"down_votes":0,"body":"Do you read up how that matchmaking even works? Unless you're doing VASTLY ahead of your teammates, or that you're seriously playing at odd hours when really no one is playing, otherwise the system will not go out of its ways to intentionally pair you with unfair matchups. Though there is no guarantee the teammate won't have a bad game in this one but it's not like there are ways to prevent it.\n\nAlso how do you even get autofilled into jg, in fact how can one even get autofilled into anywhere besides support nowadays? Not to mention sure you can try getting autofill out, then prepare for the hours long queue time.\n\nAlso, new champ has not much to do with being money hungry or otherwise. Different sectors in any organisation tends to only do what their own sector is supposed to do. Champ design team has no reason nor obligation to stop their work because of balance or other technical issues outside of their field of influence, this is called role boundaries.","replies":[]},{"poster":"JasonWazza","date":"2017-02-13T15:16:33.799+0000","up_votes":1,"down_votes":0,"body":">I mean all lanes are like bronze vs plat.\n\nIt's silvers vs silvers basically for the game.\n\nThe only difference is that you have at least 1 boosted account (/sold account) and 1 that is only at his rank because of dynamic queue (because riot in their divine knowledge decided to reset flex queue, and not solo queue, even though solo queue is the queue that needed said reset.)","replies":[{"poster":"mau5trap","date":"2017-02-18T10:49:49.293+0000","up_votes":1,"down_votes":0,"body":"so better to play flex q? or neither lol? do you mind to explain the difference between flex and solo.\ncheers.","replies":[{"poster":"JasonWazza","date":"2017-02-18T11:09:38.490+0000","up_votes":1,"down_votes":0,"body":"Honestly solo queue ranks aren't going to be fixed for upwards of four to five seasons due to dynamic queue ranks being taken into solo queue, meaning there are Bronze players in diamond due to Legal boosting (what dynamic queue basically was) as it takes so long for someone to be knocked back down unless they play a lot.\n\nIf you have a bunch of friends playing flex queue can be alright, otherwise it's just a shitty queue where it doesn't make sense why you would join it (which is why 4's are disabled, because fuck all solo's actually go into it.)\n\nSolo queue is the right queue to play, it's just a matter of shitty matchmaking that doesn't take into account anything but MMR (which is the hidden rating that everyone has) when really it probably should also be taking into account thing's like win rates (seeing teams with 40% win rates go up against teams with all 50%+ win rates makes no real sense.)\n\nHonestly, i have to personally DRAG myself to play ranked, and basically only play normals at the current time, and only when i have friends around (because there are too many assholes for me to be bothered playing solo.)\n\n\n**TL;DR**: The difference between Flex / Solo/Duo queue's are that Flex is mostly for playing with friend's, and that solo queue has no real integrity due to Riot (or more accurately tencent) fuckups.","replies":[]}]}]},{"poster":"Klavinmour","date":"2017-02-13T22:55:00.137+0000","up_votes":1,"down_votes":0,"body":"How'd you get auto-filled to Jungle?\nJungle and Mid are the most popular picks this season, considering they are also the strongest roles in the game at this point.\nWhile ADC is the weakest, you should be guaranteed that shit house role.","replies":[{"poster":"Gloric","date":"2017-02-14T00:04:34.646+0000","up_votes":1,"down_votes":0,"body":"Top is far more popular. I almost always got jungle as primary pick. When I recently switched to primary top and secondary jungle, I get jungle 80% of queue pops.","replies":[]}]},{"poster":"FatedSaviour","date":"2017-02-13T23:24:21.885+0000","up_votes":1,"down_votes":0,"body":"welcome to my S6 grade","replies":[]},{"poster":"Roguestoney","date":"2017-02-13T23:02:51.879+0000","up_votes":1,"down_votes":0,"body":"Get gud skrubadub.","replies":[]}]}