{"poster":"Everyone Changes","date":"2018-05-03T09:49:14.277+0000","title":"Silver 1 e Silver 2","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Salve a tutti,\r\npremetto che &egrave; il primo post che creo quindi siate clementi, detto questo\r\nsono hardstuck silver 1-2 da 3 settimane circa e ho notato che gli LP vinti diventano sempre meno tipo da 21 che ne vincevo prima ora ne vinco 19-17.{{sticker:zombie-brand-facepalm}} \r\nQuindi la mia domanda &egrave; questa: continueranno a scendere finch&eacute; continuer&ograve; a perdere e vincere rimanendo in questa divisione? E se dovessi riuscire ad arrivare gold rimarranno gli stessi?","replies":[{"poster":"Dr LouD","date":"2018-05-03T09:53:26.407+0000","up_votes":4,"down_votes":0,"body":"L'essere hardstuck sta a significare che sei arrivato ad un livello dove solo con la tua skill non riesci a vincere molte più partite di quante ne perdi, e rimani 'bloccato'. Non c'è nulla di male, vuol dire solo che hai raggiunto il tuo skillcap attuale, e per superarlo non devi far altro che allenarti e continuare migliorare\n\nRicorda sempre, le ranked sono un allenamento, non sono una competizione, sono fatte per sputarci sangue, feddare, e poi diventare sempre più forti","replies":[{"poster":"Jon Moxley","date":"2018-05-03T12:28:13.491+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dr LouD,realm=EUW,application-id=MJVj50Jw,discussion-id=A9FLA0sE,comment-id=0000,timestamp=2018-05-03T09:53:26.407+0000)\n>\n> L&#x27;essere hardstuck sta a significare che sei arrivato ad un livello dove solo con la tua skill non riesci a vincere molte più partite di quante ne perdi, e rimani &#x27;bloccato&#x27;. Non c&#x27;è nulla di male, vuol dire solo che hai raggiunto il tuo skillcap attuale, e per superarlo non devi far altro che allenarti e continuare migliorare\n> \n> Ricorda sempre, le ranked sono un allenamento, non sono una competizione, sono fatte per sputarci sangue, feddare, e poi diventare sempre più forti\n\nSi però descritto cosi più che un gioco sembra il campo d'allenamento del sergente Hartman. {{sticker:darius-angry}}","replies":[{"poster":"Koria","date":"2018-05-03T13:17:40.462+0000","up_votes":1,"down_votes":0,"body":"In effetti ha Dr LouD le ranked sono un allenamento","replies":[]}]},{"poster":"Everyone Changes","date":"2018-05-03T10:46:04.660+0000","up_votes":1,"down_votes":0,"body":"> Ricorda sempre, le ranked sono un allenamento, non sono una competizione, sono fatte per sputarci sangue, feddare, e poi diventare sempre più forti\n\nAssolutamente, ma non credo di aver raggiunto il mio skillcap, mi spiego meglio.\nNel silver 2 riesco facilmente a vincere le partite (premetto che maino jungler) ma quando passo Silver 1 ho un calo assurdo, ma (non per fare i soliti piagnistei) è quasi sempre colpa della bot... dato che nella maggior parte delle partite sta 0/7 a 5 minuti non potendomi dare l'occasione di gankare o dare un aiuto.\nIn MOLTE partite che reputo \"favolose\" trovo un team neutro che vince o perde ma senza esagerare tipo 2/0 oppure 0/3, che sono score che possono essere recuperate facilmente al contrario di un 0/8...\nComunque grazie della risposta {{sticker:vlad-salute}} se dovessi riuscire ad arrivare gold 5 vi faro sapere xd, per ora sto S2 98 LP D:","replies":[]}]},{"poster":"BabacioLegend","date":"2018-05-03T11:22:36.670+0000","up_votes":1,"down_votes":0,"body":"Idem. Ho scalato velocissimo da s4 a s1 con un wr del 70/60% ed ora per la 3 volta sono s1 0lp. Pensare che in s7 feci la stessa cosa ma la promo a gold 3 volte :D. Se vuoi aggiungimi (Bojafaus) non questo acc. Qui mmr merda. Rip.","replies":[{"poster":"Everyone Changes","date":"2018-05-03T12:44:07.394+0000","up_votes":1,"down_votes":0,"body":"Vabene ti aggiungo ma gioco solo la sera {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}