{"poster":"Nahuuueeel","date":"2015-11-30T07:36:27.600+0000","title":"Me banearon permanentemente","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":9,"body":"Bueno, yo voy a explicar lo que me paso hace 15 minutos en una partida. El tema fue que estaba jugando duo con un amigo que siempre juego, estamos en un team y nos conocemos en la vida real y bromeamos, el tema que el se hizo una jugada mal y ahi yo le explique y como le dije la verdad (por skype) se enojo, el tema fue que me reporto, pero anterior mente hab&iacute;a tocado una partida con un teemo, un panth y un renek, encima que me estaban trolleando y diciendo cosas por el chat ellos me reportan y me banean la cuenta permanentemente, osea yo les respondo obviamente y ahi estoy mal y lo reconozco pero me banearon injustamente, y que hacen con la otra gente que me flamea y yo los reporto? Que hacen con los trolls y afks? nada, yo no eh visto a alguien que lo hayan baneado, ahora quiero recuperar mi cuenta por que tengo skins, e invert&iacute; plata en ella, no se si puedo mandar algo para pedir que me las desbaneen desde ya muchas graciias osea yo se que estuve mal, pero si me van a banear que sea a todos por iguales, porque yo no soy solo el que flamea, ah y tambien es medio raro, no se dan cuenta que siempre me reporta el mismo invocador? o cuando no es Link53aoele es Joaco14pk? o KABS o tambien puede ser Cuinn.. yo quiero ver y que me den una buena respuesta de por que no me pueden dar mi cuenta de nuevo, por que tambien si juego siempre con ellos y me reportan siempre los mismos es obvio que es joda.","replies":[{"poster":"Jota312","date":"2015-11-30T08:27:47.078+0000","up_votes":7,"down_votes":0,"body":"Permaban , es permanente y no hay manera de sacarlo.\n\n\"se enojo, el tema fue que me reporto,\" , que amigo de mierda tienes jajajaajajja , ademas fue por que le dijiste que se equivoco(critica constructiva) no me lo creo ajajajjajaja , en tu cuenta nueva no jueges con el xd\n\nNo flamees nunca , no ganas nada , si te insultan mute , si te trollean report y listo y si ya no puedes y vas a colapsar andate afk es menor la sancion a la de insultar xd .\n\nPor ultimo esta lleno de estos post no te preocupes banean a bastante gente como tu y todos dicen lo mismo : \"No hay alguna manera de sacarme el permaban , me arrepinto de lo que hice , inverti dinero en esto.\n\nDe echo estos son mis post favoritos donde la mierda del server viene a suplicar y nunca seran escuchados jajaajajaaj .\n\nAPRENDE DE TUS ERRORES (\"mal amigo\" y \"nunca flamear\")","replies":[{"poster":"Nahuuueeel","date":"2015-12-07T02:23:15.553+0000","up_votes":1,"down_votes":0,"body":"Igual disfrute, y sigo disfrutando de insultar gente cancerigena como vos :3 quedate tranquilo! jajajajja","replies":[]}]},{"poster":"Tryhard X","date":"2015-11-30T08:00:49.831+0000","up_votes":6,"down_votes":1,"body":"**osea yo les respondo obviamente** Listo, tenes merecido el ban!\n\n**el tema que el se hizo una jugada mal y ahi yo le explique y como le dije la verdad (por skype) se enojo** Si hablaban por skype entonces es reporte falso!\n\n**e invertí plata en ella** No es un requisito para jugar lol, lo hacer porque queres!\n\n**ah y tambien es medio raro, no se dan cuenta que siempre me reporta el mismo invocador? o cuando no es Link53aoele es Joaco14pk? o KABS o tambien puede ser Cuinn.. \nor que tambien si juego siempre con ellos y me reportan siempre los mismos es obvio que es joda.**\n\nEsta ultima parte es la que mas gracia me dio! No se si les faltan jugadores... Pero no entiendo esa clase de amistad!\nLos reportes son algo serio y no es para nada una joda!","replies":[{"poster":"Nahuuueeel","date":"2015-12-07T01:25:32.332+0000","up_votes":1,"down_votes":0,"body":"Si ya se que lo tengo merecido, pero siempre me reportan ellos, y un par que me reporten de afuera xD ya esta, ppepeppepe perma ban :v igual tengo otra cuenta, pero ta no problem...","replies":[]}]},{"poster":"Sangaro97","date":"2015-11-30T08:03:08.918+0000","up_votes":5,"down_votes":1,"body":"Another.. One.. Bites.. THE DUST!! ♪","replies":[]},{"poster":"Khimea","date":"2015-11-30T10:58:47.045+0000","up_votes":1,"down_votes":1,"body":"Buscate otros \"amigos\" y por lo que das entiendo, sin ofender, son nenes lamentablemente siempre te van a \"cagar\" mas cuando es un juego competitivo. \nOtra cosa si te banean es por reiteraciones de reports y antes de banearte por \"flammer, actitud negativa, etc.\" te dan un aviso que te dice \"A veces tenemos partidas malas, bla bla bla bla, pero mejora tu actitud\" o algo asi.\nY cuando banean a alguien gracias a tu report te dicen \"Gracias a tu report, bla bla bla bla, baneamos a un jugador toxico para la comunidad\" o algo asi xD. Justo me llego el otro dia ami eso de \"Gracias\". Por eso te digo banean a mucha gente.\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Zevko","date":"2015-11-30T12:04:02.955+0000","up_votes":2,"down_votes":0,"body":"Buscarse otro amigo por un juegito , bien ahi.","replies":[{"poster":"Khimea","date":"2015-11-30T12:13:02.068+0000","up_votes":2,"down_votes":0,"body":"Claramente digo \"amigos\" para jugar.","replies":[]},{"poster":"Nahuuueeel","date":"2015-12-07T01:24:38.576+0000","up_votes":1,"down_votes":0,"body":"Son amigos en la life real :V ah re","replies":[]}]},{"poster":"Nahuuueeel","date":"2015-12-07T01:24:09.399+0000","up_votes":1,"down_votes":0,"body":"Y bueno cosas que pasan jajajaja, pero son unos hdps mis amigos de la vida real, no es que me enoje por un juego, pero algo tienen que hacer contra ellos aparte siempre jugamos por skype y eso :v","replies":[]}]},{"poster":"Zevko","date":"2015-11-30T12:03:01.738+0000","up_votes":2,"down_votes":0,"body":"No te banearon por que te reporto tu amigo , te banearon permanentemente por que riot viene \"investigando\" tu comportamiento y venis haciendo eso durante 1 año minimo ,y con \"eso\" me refiero a lo que riot no quiere.","replies":[{"poster":"Nahuuueeel","date":"2015-12-07T01:25:30.993+0000","up_votes":1,"down_votes":0,"body":"Riot me chupa la pija :v, la verdad ya tengo otra cuenta me la van a perma banear otra vez pero no problem xD ya me compre las skins de los champs que uso nomas...","replies":[]}]},{"poster":"N1725","date":"2015-11-30T11:14:05.066+0000","up_votes":2,"down_votes":0,"body":"no banean a nadie permanente por algo asi, lo tuyo es un acumulado de muchas mas cosas, quizas que comportamiento vienes teniendo de hace rato que decidieron eso, pero bueno en el foro son todos blancas palomas que los banearon injustamente y por nada","replies":[]},{"poster":"James Moriarty","date":"2015-12-01T13:47:03.959+0000","up_votes":1,"down_votes":0,"body":"Tenes que acumular muchos reportes confirmados de una actitud horrible, decir que te banearon solo por un report de un amigo? JA, por favor. No te suspendieron el chat, si te dan permaban es porque lo mereces.","replies":[]},{"poster":"Condor","date":"2015-11-30T17:30:24.333+0000","up_votes":1,"down_votes":0,"body":"no sé si inversión sea la palabra adecuada,mas bien, yo ocuparía ''gasté''","replies":[]},{"poster":"II Thanatos II","date":"2015-11-30T17:11:30.227+0000","up_votes":1,"down_votes":0,"body":"No fueron las ultimas 3 fueron mas de 30 0 40 partidas con ese comportamiento durante los ultimos meses y por eso te cayo el ban permanente, en resumen por flamer","replies":[]},{"poster":"Itachi7","date":"2015-12-03T04:36:29.633+0000","up_votes":1,"down_votes":1,"body":"TUM TUM TUM...ANOTHER ONE BITES THE DUST (8)","replies":[]}]}