{"poster":"D2Vincent","date":"2016-10-26T06:19:07.152+0000","title":"@Riot How is Karthus doing atm in Pre-season?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"No this isn&#039;t one of the onslaught of QQ on Edge of night blah blah blah, but since I don&#039;t have a PBE account and since it seems that Meddler is hanging around the boards I thought I&#039;d ask as to how Karthus is doing as of right now on PBE. Given that Rylai&#039;s is due to be nerfed any time now, I&#039;ll be asking again near the end of the cycle as a follow-up to see what&#039;s going on then. I&#039;m just making sure my main lich is gonna be able to compete in Season 7 :P","replies":[{"poster":"Meddler","date":"2016-10-26T06:24:04.716+0000","up_votes":4,"down_votes":0,"body":"PBE's good for feel feedback, general discussion and bug finding. It's not a good source of balance data though so we don't use it much to assess power (games aren't well matched, people don't play competitively, extremely weird team comps etc). \n\nIn Karthus's case he's one of the champs we'll want to look at once 6.22's out, see whether or not he's in need of 6.23 or 6.24 work. On one hand Edge of Night could be a good pick against him, on the other hand his passive ensures a fairly solid baseline of performance in teamfights so an assassin meta's not necessarily so bad for him.","replies":[{"poster":"Vhan8765","date":"2016-10-26T06:28:46.740+0000","up_votes":4,"down_votes":4,"body":"If you don't mind my questioning, is there a chance Karthus may just receive a new ultimate in the future?\nAs a decently frequent Karthus player, I feel that is truly the only main concern Karthus really has in regards to gameplay.\nIt is mentionable as well that his ult isn't of much use in any of the game modes on the Rotating Game Mode Queue; so I was wondering if there have been discussions of Karthus' ultimate simply being reworked into something more viable?","replies":[{"poster":"Insidious","date":"2016-10-26T06:41:38.203+0000","up_votes":2,"down_votes":2,"body":"Seconding this, from the top of my head, currently there's; \nBanshee's Veil \nZhonya's Active \nFizz's E\nVladimir W\nKled's passive\nShaco Ult\nBards Ult\nTaric's Ult\nSivir's E\nFiora's W\nKayle Ult\nKindred Ult\nKalista Ult\nAnd now Edge of Night, which can be built on any AD champion now\nHis ultimate has been made extremely redundant due to all of these changes in the past year, there is a ridiculous amount of counterplay to an ultimate which has a  long cooldown due to the potential damage it can do when it hits. The AOE protective ults are probably the biggest offenders, which have set him back further due to their implementations, this will only become worse depending on the Rylai's changes upcoming in the future, which is already seen as a core item on him.","replies":[{"poster":"EROTIC RAID BOSS","date":"2016-10-26T13:53:07.673+0000","up_votes":5,"down_votes":4,"body":"You know you don't have to kill the entire team for the ult to be worth it right?\n\nImagine if we applied this logic to ezreals ult. Which aside from being countered by all those things or stepping to the right, does no damage to anyone with a bit of mr?\n\nIt's pretty normal for there to be counters","replies":[{"poster":"Vhan8765","date":"2016-10-26T16:12:55.274+0000","up_votes":4,"down_votes":0,"body":"Except for the fact that Ezreals ult comes up every 45 second at most whereas Karthus' ult comes up roughly every 3 minutes?\nYou don't even build CDR on Karthus because it doesn't aid to any of his abilities.","replies":[]}]}]},{"poster":"Meep Man","date":"2016-10-26T13:54:22.787+0000","up_votes":4,"down_votes":1,"body":"Doubt it, it's far too iconic for most to change.","replies":[]}]},{"poster":"Jesus is Savior","date":"2016-10-26T15:17:26.139+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=iB7YkiAG,comment-id=0000,timestamp=2016-10-26T06:24:04.716+0000)\n>\n> PBE&#x27;s good for feel feedback, general discussion and bug finding. It&#x27;s not a good source of balance data though so we don&#x27;t use it much to assess power (games aren&#x27;t well matched, people don&#x27;t play competitively, extremely weird team comps etc). \n> \n> In Karthus&#x27;s case he&#x27;s one of the champs we&#x27;ll want to look at once 6.22&#x27;s out, see whether or not he&#x27;s in need of 6.23 or 6.24 work. On one hand Edge of Night could be a good pick against him, on the other hand his passive ensures a fairly solid baseline of performance in teamfights so an assassin meta&#x27;s not necessarily so bad for him.\n\nI have a suggestion (for the item).\n\nCan you give it the same cooldown as banshee veil so they both fill the same niche? If you do that, it will basically work like this:\n\nDo you want to be able to take damage between cooldowns? Buy edge of night.\n\nAre you able to flee and not take damage between fights? Buy banshee veil.","replies":[]}]},{"poster":"Woodakoodashooda","date":"2016-10-26T07:09:24.933+0000","up_votes":1,"down_votes":3,"body":"What about a slight buff to the ultimate in which enemy champions targeted by it who receive damage from allied champions cannot activate items for 3.25 seconds?\n\nEdit: This, of course, wouldn't activate more than once per enemy.","replies":[{"poster":"FaytalityHD","date":"2016-10-26T07:11:32.416+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Chocolate Frost,realm=NA,application-id=3ErqAdtq,discussion-id=iB7YkiAG,comment-id=0001,timestamp=2016-10-26T07:09:24.933+0000)\n>\n> What about a slight buff to the ultimate in which enemy champions targeted by it who receive damage from allied champions cannot activate items for 3.25 seconds?\n\nslight?","replies":[{"poster":"Woodakoodashooda","date":"2016-10-26T07:12:56.986+0000","up_votes":1,"down_votes":1,"body":"The ultimate has a 3 second channel, giving plenty of time for enemies to just shield or dodge it.","replies":[{"poster":"Quepha","date":"2016-10-26T14:38:20.321+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chocolate Frost,realm=NA,application-id=3ErqAdtq,discussion-id=iB7YkiAG,comment-id=000100000000,timestamp=2016-10-26T07:12:56.986+0000)\n>\n> The ultimate has a 3 second channel, giving plenty of time for enemies to just shield or dodge it.\n\nThat still leaves it as one of the ults with the least amount of available counterplay.","replies":[]}]}]}]},{"poster":"FaytalityHD","date":"2016-10-26T07:10:13.223+0000","up_votes":2,"down_votes":3,"body":"We all know theres only type of plalyer currently playing this champion who can keep doing what he currently does because riot has little interest or perhaps considers it \"not worth their time\" because it doesnt yield profit","replies":[]}]}