{"poster":"Mazzz","date":"2014-12-18T13:05:17.534+0000","title":"Recreating Warwick (In Depth)","subforum":"Player Creations","up_votes":3,"down_votes":1,"body":"It's fairly obvious that many people are not satisfied with Warwick's contribution to the game at the moment, particularly his scaling from on hit effects activating on his ultimate. \n\nThis isn't a complete list of how Warwick's rework should be handled,  but it is just a few ideas that I think would make him a more suitable in the current state of the game. \n\nInnate: Eternal Thirst\n\nIn my opinion,  this is still a solid passive that is also a core aspect of Warwick (being a solid 1v1 champion, and renowned for sustain), so I chose for it to remain the same.\n\nQ Rending Strike \n(10/9/8/7/6 second cooldown (remains unchanged)) (costs 70/80/90/100/110 mana (remains unchanged))\n(75/125/175/225/275 --> 55/110/165/220/275(+100% ad +100% ap) magic damage and,\n (8/10/12/14/16% --> 7/8/9/10/11% (no additional scaling) maximum health). Range 400 --> 600\n\nEssentially 'Hungering Strike', Rending Strike has slightly reduced damage, but becomes aoe with slightly larger radius. Additionally, Warwick can now activate it anywhere (isn't target based). The maximum health scaling has been nerfed due to extra magic damage and introduction of another ability. \n Visually, the ability would look more like a swipe with both hands, rather than the original little spin he does. \n\nW Terrorize \n(10/10/10/10/10 second cooldown) (costs 35/45/55/65/75 mana)\nWarwick next attack stabs his enemy with his claws twice, dealing (80/100/120/140/160 (+100% ad) (+ 80% ap) per swing plus on hit effects) magic damage and apply grevious wounds for 5 seconds thereafter. \nResets attack animation on activation. \n\nI feel this ability compensates for the change in Warwick's ultimate, still making him auto attack based, but removing the 'zero counterplay' in his ult's damage and suppression. \n\nE Blood Scent (Remains same)\n(Another signature AND original Warwick ability).\n\nR Animal Within \n(130/105/80 second cooldown) (Costs 80/100/120 mana)\nPassive: Warwick's attack speed is increased by 20/40/60%\nActive: Leaps at an enemy, dealing ( 150/250/350 (+70% ap)) magic damage,  knocking  them back by 100 range and stunning them for 1.5 seconds.\nAfter he lands the leap, Warwick is stationary for 0.7 seconds and lets out a howl that doubles Animal Within's passive (globally buffs allies for orginal passive) for 11 seconds.\nLeap can jump over walls and abilities (save Azir's ult). If it is interrupted,  Animal Within goes on Cooldown for 10 seconds and Warwick is refunded the mana. \n\nThe thought process behimd his change was to adhere to complaints about Warwick's ability to decimate squishy opponents without counterplay and also build straight tank. Logically, taking away his ultimate's scaling with items like Wits End and the Devourer enchantment, and just making it flat damage seemed to be a simple and adequate answer. Combining his old 'W' in conjuction,  helped keep Warwick familiar. \nIt is still a point and click ability,  it just seems more balanced in my opinion.  \n\nVisual changes:\nWarwick drops down on all four limbs when affected by a speed boost (includes blood scent).\n\nEnd note: I apologize for any grammatical mistakes, I wrote this on my samsung because it was too hot to sleep one night  :)  I'll do some correcting of needs be at a later date.\nLet me know what you think!","replies":[{"poster":"MrButter","date":"2014-12-18T13:26:07.956+0000","up_votes":2,"down_votes":0,"body":"Sounds like a really good idea, the changes Terence is talking about seem very reasonable, you've got to give them at least a possibility of getting out of it. I just picked up WW a little while ago and i must say it seems a little to easy to burst those squishies. i think this should give him a good chance as a popular champ pick, not to mention the fact that he is WAY overdue for an overhaul :) Riot should definitely take a serious look at this.","replies":[]},{"poster":"Klavinmour","date":"2014-12-19T07:29:33.167+0000","up_votes":1,"down_votes":0,"body":"There have already been announcements on a Warwick rework, alongside posts about a Fiora rework as well.\n\nYou could at least check back on red posts about this stuff.","replies":[{"poster":"Mazzz","date":"2014-12-21T05:57:58.917+0000","up_votes":1,"down_votes":0,"body":"I know this, and this is my input on how it I think it should turn out","replies":[{"poster":"Klavinmour","date":"2014-12-21T06:55:26.659+0000","up_votes":1,"down_votes":0,"body":"I'd rather wait and see how it turns out to begin with.\nI expect he'll have similar treatment between Master Yi and Sion. Because why does Warwick have AP scaling?","replies":[]}]}]},{"poster":"BarryButcher","date":"2014-12-19T09:02:59.656+0000","up_votes":1,"down_votes":0,"body":"A real warwick rework has been talked about since April... http://www.newsoflegends.com/index.php/tag/warwick-rework/\n\npretty sure they might be going \"sion\" level on this rework, hence why its taking so long","replies":[]},{"poster":"MadLifeJunior","date":"2014-12-18T21:15:20.969+0000","up_votes":1,"down_votes":0,"body":"How about we just make his ult cc immune!!!!","replies":[]},{"poster":"SEKAI","date":"2014-12-18T13:40:41.164+0000","up_votes":1,"down_votes":0,"body":"I think what we can do.\n\n**P**: Make his passive like this: His AA will deal true damage and heal for same amount, aka stealing hp, scale from 1 - 9 from lvl 1 to 18.\n\n**Q**: Make Warwick's Q an AA modifier (or remain as single target spell, either way), where he will bite the next target he strikes with auto, dealing magical damage and heal for a percentage of the damage. It can reset AA. (Ad scale).\n\n**W**: Remain his W as a roar, but only he will benefit the effect instead of an aoe buff. And it adds AS and grant some HP and max HP for the same amount in the duration, the bonuses are removed after the effect. (AS and HP + max HP only scales with skill level, long starting cd, medium cd when full leveled).\n\n**E**: Make his E, **passively **grant MS when a low hp enemy is near but he does not get vision of them (Fog is NOT removed), instead the enemy will have a mark floating on top of the head and WW can see the mark if he is within E's range (stimulating hunting by using smell), howling remains. He can **activate **the E to jump onto any targeted enemy, dealing physical damage and ONLY apply a slow to \"marked/weaken\" enemies while passive MS of E is halved until the cooldown is finished. (MS scales with skill level, jump's damage scales with ad but cd remains the same in all levels, medium length. Slow has no scale.).\n\n**R**: It will be the same as current ulti, except it doesn't do magic damage but physical and the jump range is shortened (heavily because it will now be a little longer than his AA range), and has an actual jump animation, same with E.\n\nWW can be interrupted mid air when jumping if enemy is fast enough. Also he is able to be peel off during ulti if being cast stun or displacements like knockup or knockback.","replies":[]},{"poster":"Rok","date":"2014-12-18T13:12:55.927+0000","up_votes":1,"down_votes":0,"body":"Its simple, the problem is the Ult. The ult has a suppression and damage that will hit no matter what after its initialised. Easiest thing to do would be give it the talon treatment.\n\nInstead of a Suppress, make it a 3 Second 99% slow, remove the 4-5 on-hit never-miss damages and replace with increased attackspeed and life steal. They already nerfed his Att speed, why not compensate it with a temporary burst of it on his ult?\n\nIt allows for counterplay that is already there but is denied by the fact that that the never-miss damage still applies regardless of QSS/ Black Shield etc. Allow for the person to create a Gap if possible but severely limit their escape with the 3 second 99% slow. Allow WW to still get his attacks off with the increase attack speed, and allow him a bit of survivability with his sustain.\n\nRiot get on it and test this out aye?","replies":[{"poster":"Mazzz","date":"2014-12-18T13:19:01.466+0000","up_votes":1,"down_votes":0,"body":"Yeah, that is pretty close to what I was fabricating, the main difference being that I want his model upgraded alongside it haha.","replies":[]}]}]}