{"poster":"72 sins","date":"2019-07-05T23:36:05.478+0000","title":"Most mechanically intense champion?","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":0,"body":"Hey im new, looking to play a mechanically intense champion so i can master them","replies":[{"poster":"Nightjar","date":"2019-07-06T01:56:04.972+0000","up_votes":1,"down_votes":1,"body":"{{champion:64}} \nwas, is, and has always been the highest skillcap champion.\nAt first he doesn't seem that bad, but watch a high elo leesin main, and you'll see that he has so many combos to master, so much flexibility, and whilst he has a strong earlygame, the difference between a pro leesin and an average one, is the pro leesin doesn't actually fall off in the lategame, whereas the average one does.","replies":[{"poster":"Broken Scripts","date":"2019-07-06T02:59:51.485+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Nightjar,realm=OCE,application-id=FjGAIbRv,discussion-id=T4kj0nLH,comment-id=0001,timestamp=2019-07-06T01:56:04.972+0000)\n>\n> {{champion:64}} \n> was, is, and has always been the highest skillcap champion.\n> At first he doesn't seem that bad, but watch a high elo leesin main, and you'll see that he has so many combos to master, so much flexibility, and whilst he has a strong earlygame, the difference between a pro leesin and an average one, is the pro leesin doesn't actually fall off in the lategame, whereas the average one does.\n\nNo, he isn't. He has a very simple kit and is mechanical simple. Lee Sin is difficult, as some say, due to decision making and when to do his combos.","replies":[{"poster":"Socon","date":"2019-07-06T21:18:47.599+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Broken Scripts,realm=OCE,application-id=FjGAIbRv,discussion-id=T4kj0nLH,comment-id=00010000,timestamp=2019-07-06T02:59:51.485+0000)\n>\n> No, he isn't. He has a very simple kit and is mechanical simple. Lee Sin is difficult, as some say, due to decision making and when to do his combos.\n\nYeah unfortunately the idea of skillcap has increase. Leesin used to be seen as an incredibly difficult champion mechanically, now hes just incredibly useless","replies":[]}]},{"poster":"Ornn","date":"2019-07-12T18:50:41.771+0000","up_votes":1,"down_votes":0,"body":"thats you opinion and its wrong.. a {{champion:41}} 1 keg combo is harder then anything lee sin can pull off, gp is also higher skill cap lmfao","replies":[{"poster":"Nightjar","date":"2019-07-19T06:09:31.817+0000","up_votes":1,"down_votes":0,"body":"I've tried them both, I don't like either of them, I'm not competent at either of them, but I felt I was doing slightly better with GPs barrel combos than Leesins wardhop insec combos.","replies":[]}]}]},{"poster":"Lord Sesshomaru","date":"2019-07-07T00:58:41.804+0000","up_votes":2,"down_votes":0,"body":"People here are talking about skillcaps, but \"Mechanically intense\" doesn't necessarily mean \"difficult\".\n\nFor example, Lee Sin and LeBlanc, are _mechanically_ complex, but that by no means makes them difficult.  They require a lot of button pushing it's true, but essentially function around a set number of core combos, playing them is mostly just your fingers memorising the right order to press buttons.  Once you've practiced the combos enough, you can play them blindfolded.\n\nMeanwhile champs like Aurelion Sol, are mechanically simple, but much more difficult to play.  80% of Sol's damage comes from 1 ability, and that ability is either on or off.  His other abilities are for the most-part just _'press the button and a bunch of cosmic fire comes spewing out'_ not a lot to it really.  Sol's difficulty comes from having to always be watching, thinking about, and predicting EVERYTHING!  Once someone gets close to you, that's it, you're gone, no buts.  If you don't have an eye on literally everything thats happening in a fight, you'll find yourself trapped in with a Talon or a Yi, and your jig is up.  Unlike Lee and LB with all their dashes and invisibility and shields, Sol has no training wheels, you make a mistake, thats a grey screen for you.  You have to predict everyone's movements including your own, and put yourself in the right position at exactly the right time.  Know when to go in, know when to get out, you have to know all the other champs and what they can do, and how fast/slow they can get to you.\n\nMoral of the story: Things aren't always as they seem.  And theres no 1 solution.\n\n___________________________\n\nBut tbh, if you're new, don't go looking for high mechanics champs.  In fact, don't go looking for any kind of champs yet.  Just try out the champs on free rotation each week, give each one a proper go.  When you get enough BE, buy champs you are interested in.  If you wanna be a wind samurai then buy Yasuo, if you want to set shit on fire then buy Brand.  Eventually you'll find two things; you'll find a champ you love, and you'll find out what kind of champs you enjoy playing.  Once you know that, nothing else matters, difficulty/mechanics/etc. it doesn't matter.  You're far more likely to succeed playing someone you love and are interested in and by sticking with them through thick and thin, than you are playing whatever happens to be 'meta' that week.  Or whoever has more mechanically difficult abilities.\n\nJust have fun, and everything else will follow.","replies":[{"poster":"Ornn","date":"2019-07-12T18:51:43.180+0000","up_votes":1,"down_votes":1,"body":"No Lee Sin and LeBlanc, are Not mechanically complex  Leblanc has 1 skillshot then rest is braindead dashes and point and click and so does lee sin 1 skillshot neither off them are hard to hit","replies":[{"poster":"Nightjar","date":"2019-07-19T06:13:15.621+0000","up_votes":1,"down_votes":0,"body":"of all the champions in this game, Leesin and Leblanc are personally the ones I find hardest to play. I can mostly pickup and play the other champions to a silver level, and I can maybe even do a flashy combo if I give it a few dozen tries.\n\n I said Leesin was hardest because I can sort of see myself learning Leblanc if I spent an entire season trying to grasp her basics, and I really really don't like wardhopping on Leesin (I can do it fine on Jax because q4 is easier for me than w4 on my keyboad), but that's just my opinion.","replies":[]}]},{"poster":"72 sins","date":"2019-07-07T05:43:39.041+0000","up_votes":1,"down_votes":0,"body":"Damn thnx man, i never thought about that and your comment put everything in a different perspective. Ill try out playing a lot of champions and see who i like, just like you said. Thnx again!","replies":[{"poster":"Lord Sesshomaru","date":"2019-07-07T07:20:41.629+0000","up_votes":1,"down_votes":0,"body":"No worries mate!\n\nLeague is a game, and the aim of all games is to have fun.\nSo just have fun, and everything else will follow.\n\nI play Azir, and I think he's really difficult _(but we all think that about our own champs)_, so I have a chip on my shoulder about that.  But I also play Swain, and he's not difficult _(the dude practically plays himself)_.  I play them because I love them, I don't need any other reason.\n\nIt took me 20 games to stop feeding as Azir, _(let alone get a positive score)_, but I enjoyed playing him so It didn't matter.\nIf I had to force myself through that if I didn't enjoy the champ.  My league days would have ended long ago.\n\nSo just have fun with it, see where the ride takes you.  Who knows, the champ you click with might not have even come out yet. So just take your time.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"Socon","date":"2019-07-06T21:26:42.994+0000","up_votes":1,"down_votes":1,"body":"Top: Irelia/Gp/Riven/Ryze\nJungle: Leesin/Shaco/Kayn/Gragas/Nidalee\nMid: Zed/Asol/Azir/Ekko/Yasuo/Taliyah\nAdc: Kalista/Caitlyn/Vayne/Draven\nSupport: Thresh/Taric/Bard/Pyke\n\nIrelia: Managing resets, getting good stuns, utilising ultimates slow and disarm potential, correct w usage.\nGp: Barrel placement, dubloon farming, positioning\nRiven: _**combos**_\nRyze: Everything\nLeesin: _**Combos**_ feat. Energy management\nShaco: Box placement, vision control, fear usage, ultimate usage, 100% premeditation\nKayn: Combo usage, health management, cooldown management, positioning, terrain scaling\nGragas: Combos, cooldown management, terrain scaling\nNidalee: Everything x2 \nZed: Energy management, cooldown management, geometry, positioning, blink/shadow management, combos, terrain scaling\nAsol: ~~Positioning~~\nAzir: Everything\nEkko: Combos, ultimate usage, terrain scaling\nYasuo: Positioning, combos, flow management, terrain scaling\nTaliyah: Combos, terrain, positioning, geometry\nKalista: Everything\nCaitlyn: Trap placement, combos\nVayne: Geometry x10, combos, stealth management, cooldown management\nDraven: Axe\nTresh: Everything\nTaric: Everything\nBard: Everything\nPyke: Everything","replies":[{"poster":"Ornn","date":"2019-07-12T18:52:11.018+0000","up_votes":1,"down_votes":0,"body":"Kayn/ ????? you run and someone and they die explain how thats michanically hard","replies":[{"poster":"Socon","date":"2019-07-18T23:21:14.012+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Grouchy Poro,realm=OCE,application-id=FjGAIbRv,discussion-id=T4kj0nLH,comment-id=00030000,timestamp=2019-07-12T18:52:11.018+0000)\n>\n> Kayn/ ????? you run and someone and they die explain how thats michanically hard\n\nDepends on the mmr you're playing at :) \nBut Kayn has many small mechanics to keep in mind to play him at his maximum potential at all stages of the game.","replies":[{"poster":"Ornn","date":"2019-07-19T05:23:13.954+0000","up_votes":1,"down_votes":0,"body":"small michanicsa? assasin run at someone spam all your abilties to 1 shot them\nred kayne spam all you're abilities and press r when you're low on hopefully a tank or high  health oponent\n\nkayne is braindead","replies":[{"poster":"Socon","date":"2019-10-10T17:03:05.042+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ornn,realm=OCE,application-id=FjGAIbRv,discussion-id=T4kj0nLH,comment-id=0003000000000000,timestamp=2019-07-19T05:23:13.954+0000)\n>\n> small michanicsa? assasin run at someone spam all your abilties to 1 shot them\n> red kayne spam all you're abilities and press r when you're low on hopefully a tank or high  health oponent\n> \n> kayne is braindead\n\nOk if you spam all your abilities then you're gonna end up losing. The idea is to maximize efficieny","replies":[]}]}]}]}]},{"poster":"Bookbash","date":"2019-09-06T03:33:47.791+0000","up_votes":1,"down_votes":0,"body":"Be prepared to lose a lot of games if you decide to master a mechanically intense champion before learning how the game works. If you want to really test yourself on both a micro and macro level, then Nidalee is your champion. Please note than very few players on this server have mastered her (can only think of 3 in fact - Shernfire, OnIy and Impaired).","replies":[]},{"poster":"Orange Caramel","date":"2019-07-21T03:09:02.258+0000","up_votes":1,"down_votes":0,"body":"I might be biased on this one, but I say the most mechanically intense champion would be:\n{{champion:7}} You need to have the perfect quick timing for your abilities to be chained in sequence correctly, as well as accurately.\n{{champion:92}} Weave in basic attacks with abilities perfectly.\n{{champion:67}} Tumbling the correct place and then basic attacking, moving and then basic attacking, positioning for e and e tricks, using invisibility...\n{{champion:203}} Similar to Vayne, jumps after every auto.\n\nHonorable mention:\n{{champion:11}} 1-ticking w and correctly using q tricks.\n\nThe most mechanically difficult:\n{{champion:35}} Pre-planning boxes, controlling ulti. Watch Pink Ward.\n{{champion:131}} RQ is probably the hardest combo in the entire game.\n{{champion:7}} Controlling clone + using jumps.\n{{champion:238}} Same as Leblanc.\n{{champion:64}} Needs really quick reaction time, thinking and precision.\n\nHonorable mention:\n{{champion:23}} Q and Ult timing needs to be perfect.\n\nNote: People think most of the champions I've listed are easy and broken.\nWhat they don't understand is that there is a difference between PLAYING a champion, and being PERFECT at them.","replies":[{"poster":"Nightjar","date":"2019-09-05T12:04:47.850+0000","up_votes":1,"down_votes":0,"body":"Shaco isn't exactly hard to play, he doesn't really have combos, his major mechanics are juggling control of the clone through ALT+click and knowing it's tether range and timing. \n\nThe boxes are more premeditation and general intuition/experiece, and the only real reason shaco is percieved as hard to play, is that he's so weak right now, that the only people who play him and can win consistently with him, are hardcore shaco mains.\n\nShaclone did a stream about what was wrong with shaco a while ago, where he invited like 10 of the most in/famous shaco mains, and they all agreed, shaco wasn't mechanically difficult, he was just so weak in base stats, you needed intense mastery of the champ to succeed with him in ranked.\n\nBack when Shaco had higher base numbers and he wasn't nerfed to the ground based solely on how well he abused duskblade compared to other assassins, he got picked up by alot of players, who handled him well with minimal experience.","replies":[{"poster":"Nightjar","date":"2019-09-05T12:05:59.335+0000","up_votes":1,"down_votes":0,"body":"also real shaco mains know that R+click doesn't always work on Shaco, and will still use the oldschool ALT+click to micromanage the clone. Because Riot coding consistency.","replies":[]}]},{"poster":"datfatguy","date":"2019-09-05T08:27:25.352+0000","up_votes":1,"down_votes":0,"body":"trynd master yi and diana all hard 🤡🤡🤡🤡🤡","replies":[]}]},{"poster":"Broken Scripts","date":"2019-07-06T03:00:16.184+0000","up_votes":1,"down_votes":0,"body":"Soraka.","replies":[]},{"poster":"axeI","date":"2019-07-06T00:32:52.342+0000","up_votes":1,"down_votes":0,"body":"Irelia. She's not just a Q dash champion - two of her abilities have 2 part activations (W &amp; E). There are varying degrees to make creative plays with her combos and making use of her marks on targets. You also would want to maximise use of her passive before going ham on an enemy. \n\nBelieve it or not, she is a 3/3 skill difficulty and is rewarding to play when mastered.","replies":[{"poster":"72 sins","date":"2019-07-06T00:40:39.030+0000","up_votes":1,"down_votes":0,"body":"ill have to try her out! What lanes does she play?","replies":[]}]}]}