{"poster":"KFCeytron","date":"2018-09-25T05:08:06.155+0000","title":"Is it just me, or is Zyra a little too strong?","subforum":"Gameplay","up_votes":2,"down_votes":4,"body":"She seems to have very strong burst damage, DPS, range, and CC, while still building reasonably tanky.","replies":[{"poster":"SwoleMcSwag","date":"2018-09-25T16:53:48.827+0000","up_votes":4,"down_votes":1,"body":"Its just you. \n\nHer snare is slow moving, her ult gives you massive time to walk out of the area of effect, her plants die to 2 autos from a ranged and a single auto from a melee (also 1 shot by mf and some others). \n\nThere is a reason she's rarely played at high elos. \n\nShe has no mobility, is super squishy, falls off. Her scalings are really bad. \n\nShe's probably going to get buffs before nerfs....especially after her plant AI was stealth nerfed a few patches ago. \n\nLMAO at builds \"reasonable tanky.\" \n\nImmobile mages have never been in a worse spot.","replies":[]},{"poster":"Pandeonor","date":"2018-09-25T06:45:00.759+0000","up_votes":1,"down_votes":0,"body":"She is strong but you see her weakness in midlane. There are others with _much_ more burst damage and so she loses early and/or need very long into the match. So she can´t often directly kill anyone but her plants drain aoe hp from all enemies around like a vlad.","replies":[]},{"poster":"Binding Eclipse","date":"2018-09-25T05:48:17.321+0000","up_votes":1,"down_votes":0,"body":"What I've noticed lately playing Zyra is that people are getting to be reckless against her. Not respecting her range, or her damage that (so far as I'm aware) hasn't been suddenly cranked up by some indirect means lately. Getting double kills off of the enemy bot lane towerdiving when my full rotation up is just...well. Typical of the meta now, I guess.","replies":[]},{"poster":"Nhifu","date":"2018-09-25T05:44:12.223+0000","up_votes":1,"down_votes":0,"body":"It's her \"trade off\" for being immobile, kind of like brand except no stun.\n\nLike you gotta be brain dead to catch her snares, stand in the ult. But her reliable poke from a super OP plant range is a bit excessive.\n\nShe's in the same category as Sona, pretty damn strong but falls off real quick if the enemy team is engage/tank heavy. \n(Both 400 base hp lol)","replies":[]},{"poster":"Daddy Ants","date":"2018-09-25T10:40:51.214+0000","up_votes":1,"down_votes":3,"body":"Gonna get worse from tomorrow when {{item:3151}}'s gets buffed.\n\n\n{{champion:63}} {{champion:143}} are gonna be even more cancer than they are now.","replies":[{"poster":"5050BS","date":"2018-09-29T00:36:16.914+0000","up_votes":1,"down_votes":0,"body":"Brand yes Zyra no.\n\nBrand hits you once and Blam! 21.5% of your HPs is gone.","replies":[]}]}]}