{"poster":"KFCeytron","date":"2018-09-24T03:09:06.026+0000","title":"The problems with Odyssey","subforum":"Gameplay","up_votes":9,"down_votes":1,"body":"* Limited time availability\n* Limited time missions\n* No specific queues for missions\n* Everyone on a different stage of the mission chain\n* No way to see teammates&#039; augments in champ select\n* No way to see number of teammates&#039; augments in champ select\n* Difficulty often increased with bigger numbers (fake difficulty)\n* Some spell effects not optimized for having dozens on screen at once\n* Some effects ignore Unstoppable\n* Some effects ignore Invulnerable\n* Some hazards invisible when cast from fog of war\n* If you die near another player and then the team wipes, it will waste a res CD when you respawn\n* Kayn&#039;s &quot;you&#039;re between the pit and me&quot; knock will happen pretty much any time (he&#039;s basically untouchable with his back against a wall)\n* Kayn&#039;s dash (basically &quot;boss is untouchable, don&#039;t stand in fire&quot; phase) is spammed several times in a row, frequently\n* The &quot;fun, kooky&quot; builds (like Malph&#039;s Brutal Strikes augments) are simply bad\n\nSome of these are easier to fix than others. For example, improving Jinx&#039;s and Sona&#039;s ults to not drop my framerate by 95% when there are ten on screen at once is kind of necessary for playability, but surely very difficult. Adding brief cooldowns to various enemy abilities (like Kayn&#039;s dash) would be moderately difficult to plan, and reasonably easy to implement.\n\nBut it wouldn&#039;t be difficult at all to just make this available as an ongoing mode, with the missions available indefinitely... just like regular content in MMOs. Yes, WoW&#039;s &quot;Gates of Ahn&#039;Qiraj&quot; event is the commonly-given excuse for the &quot;limited-time event to grab DAU&quot; epidemic in games these days, but it&#039;s not a justification. Limited-time content means people often aren&#039;t doing the content because they _want_ to for _fun_, but because they feel they _have_ to, or they risk missing out on whatever unique rewards are available (or even the content itself, like finishing an entire dessert even when you know you&#039;ll feel sick afterward). Removing the time constraint on missions and making them available indefinitely would make missions as a whole a lot less stressful.\n\nThe event starts with everyone at the same stage of the missions, but it fragments quickly. Some people have a mission for Onslaught with four augments, other people have a mission for Onslaught with five of the same champ, and so on... and everyone&#039;s tossed into the same queue. Everyone in Onslaught is on a mission, because there&#039;s a limited time to do them, and frustration of the harder missions can really kill the desire to play it. Every Onslaught I&#039;ve done has started with arguments about missions, and now we have trolls who either FF/AFK if the team doesn&#039;t do the mission they want or intentionally ruin everyone else&#039;s missions. These missions can be failed in champ select, there&#039;s no way to know when it&#039;s happened, and there&#039;s no way to ensure it won&#039;t happen because there&#039;s just one queue.\n\nMechanics that will one-shot you and can&#039;t be avoided with regular movement are fake difficulty. Mechanics that will kill you while you&#039;re ostensibly untargetable (or invulnerable) or stop you when you&#039;re ostensibly unstoppable (of which I&#039;ve seen several) are just stupid. Kayn dashing nonstop so I can literally not reach him during the round is, frankly, idiotic design that should&#039;ve been tested on the PBE.\n\nTL;DR: Removing the time constraints and providing mission-specific queues would be the most efficacious improvements to not just Odyssey but to missions in general, and would also provide the opportunity to make other improvements to these events.\n\nP.S.: I got asked for feedback on Odyssey in the client. Here&#039;s what I wrote:\n\n> Remove the time limit on mode/missions (for all events, really), add mission-specific queues, create challenge without resorting to undodgeable 1-shots, remove mechanics that ignore Unstoppable, Untargetable, and Invulnerable, make all hazards visible even when cast from fog of war, don&#039;t waste res CD when dying near a teammate before a wipe, clean up Kayn&#039;s pit knock targeting, don&#039;t let Kayn dash eight times in a row, replace the terrible augs (most of them) with good new ones, work on performance optimizations for effects that will be spammed, like Sona/Jinx ults. As it stands, this mode is such a frustrating experience that it&#039;s almost making me quit the game entirely.","replies":[{"poster":"Yautja wannabe","date":"2018-09-24T03:40:09.701+0000","up_votes":3,"down_votes":0,"body":"True that ^ it's just a fuckin grind. If you somehow manage to make it to the very end you juuuust might be able to get a skin, ward skin, and an odyssey gem. But is that really worth it? Is it worth it to punish one's self so much just to obtain cosmetics?","replies":[{"poster":"Chembaron Yamada","date":"2018-09-24T13:39:55.938+0000","up_votes":1,"down_votes":0,"body":"I did all the missions and it was definitely worth it and fun.\nOne of the best moments in League of Legends for me beating the 2 augments mission, it was extremely satisfying to do.\n\nI didn't even get anything good from the gem (got the worst skin line: candy), but the achievement itself was worth the effort.","replies":[]},{"poster":"Spank the Fox","date":"2018-09-24T04:43:50.035+0000","up_votes":1,"down_votes":0,"body":"Yes.","replies":[]}]},{"poster":"ZT Xperimentor","date":"2018-09-26T16:41:39.149+0000","up_votes":2,"down_votes":0,"body":"Biggest beef with Odyssey is the fake difficulty, specifically the times enemies can ignore you being unstoppable/invulnerable, hell I've seen some of the boss mobs straight-up ignore crowd control despite not being airborne nor having the unstoppable label. \nSome items are also absent from the game mode without notice, so I hope players weren't banking on particular builds, because odds are it's not all there.\nThere's also some hazards that start before you load into the game, couldn't tell you how many times we get into game only to have a few people die or get stunlocked immediately on spawn. \nNot to mention the missions requiring other people to play along, sure I've gotten most of them simply by asking before people pick, but it's still frustrating that you have to rely on others for your reward. \n\nAnyway I still enjoyed it more than the star guardian mode and the blitz game mode, but nicely put on it's issues.","replies":[]},{"poster":"Chä Hae In","date":"2018-09-24T13:44:56.596+0000","up_votes":2,"down_votes":0,"body":"THIS ^^^^\nI cannot stress how many times I’ve gone into a lobby, 3/4 people agree on 2 augments, then when we load into a game there’s 1 person who has all. We’re either forced to surrender or waste 15/20 minutes playing.","replies":[]},{"poster":"R107 Games","date":"2018-09-24T03:11:58.436+0000","up_votes":3,"down_votes":1,"body":"The odyssey game mode is fucking boring. I just hate pve games and games you have to grind","replies":[]}]}