{"poster":"KFCeytron","date":"2019-08-27T09:20:53.072+0000","title":"\"I haven't played a PvP match in a while. Maybe that would be a fun thing to do.\"","subforum":"Gameplay","up_votes":2,"down_votes":0,"body":"We're 10 kills behind at 10 minutes, the ADC starts screaming at people instead of even trying to CS anymore, no one else wants to ff so it goes past 20, and when we inevitably lose, the enemy team starts shrieking about how \"ez\" it was.\r\n\r\nYep, that was fun.","replies":[{"poster":"JuiceBoxP","date":"2019-08-27T10:12:08.410+0000","up_votes":1,"down_votes":0,"body":"So what you've been playing... like... co-op vs AI?","replies":[{"poster":"KFCeytron","date":"2019-08-27T10:28:08.804+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=JuiceBoxP,realm=EUNE,application-id=3ErqAdtq,discussion-id=BdOUV6En,comment-id=0000,timestamp=2019-08-27T10:12:08.410+0000)\n>\n> So what you've been playing... like... co-op vs AI?\n\nYeah. There's a lot less screaming, and if my PC decides to stop rendering frames for a full second during a teamfight and I die, it's a minor inconvenience rather than a throw.\n\nI played another PvP match right afterward, and our Panth was telling our Corki that the latter \"sucks literal ass\" for pushing bot while the rest of us were pushing mid. This was a game we won, by the way. And of course, when we did so, some of my teammates thought \"gg ez\" was appropriate.","replies":[{"poster":"JuiceBoxP","date":"2019-08-27T10:29:52.000+0000","up_votes":1,"down_votes":0,"body":"I don't even have /all chat activated... i've never seen a single ggez in a loooong time.","replies":[]}]}]},{"poster":"Linna Excel","date":"2019-08-27T15:56:57.897+0000","up_votes":1,"down_votes":0,"body":"It could have just been a couple of rough matches, I'd suggest a few more for a better sample size.  \n\nAlso, how are you able to put up with all the AFKers in bot games?  When I tried doing that late last year I did like 10 runs and every one of them had at least 1 person AFK.","replies":[{"poster":"KFCeytron","date":"2019-08-27T16:07:36.527+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Linna Excel,realm=NA,application-id=3ErqAdtq,discussion-id=BdOUV6En,comment-id=0002,timestamp=2019-08-27T15:56:57.897+0000)\n>\n> It could have just been a couple of rough matches, I'd suggest a few more for a better sample size.  \n> \n> Also, how are you able to put up with all the AFKers in bot games?  When I tried doing that late last year I did like 10 runs and every one of them had at least 1 person AFK.\n\nI mean, they're not AFKing due to losing their lane, most likely, so that's out. Common reasons are connection issues and RL stuff (pizza at the door, etc.). It's generally at most one person who leaves, they often return when possible, and it's rarely a hindrance to winning the match. Of course, if you have three players who have never played before (sometimes they think they're intermediate, don't ask me why) and the fourth player who might have carried has a power outage, and you're playing Janna with support item and half a shoe before you realize the gravity of the situation...\n\nHonestly, I'm less annoyed by an AFKer here or there in co-op than I am by people who are experiencing connection issues but still want to play, so every 20 seconds you hear \"a player has disconnected\" and \"a player has reconnected\" for the rest of the match with no way to mute it.","replies":[]}]},{"poster":"Discipl1ne","date":"2019-08-27T14:48:22.962+0000","up_votes":1,"down_votes":0,"body":"Great news!\nthe /allmute button has been introduced.","replies":[]}]}