{"poster":"AlexAdu11","date":"2019-11-24T14:01:25.788+0000","title":"Kalista skin 2015 non ricevuta dopo aver pagato 35 euro per ottenerla con i gettoni mondiali","subforum":"Aiuto e supporto","up_votes":2,"down_votes":1,"body":"io ho comprato la suddetta skin senza avere il campione in se, dopo averlo sbloccato non trovo la skin che ho comprato.\r\nVorrei sapere se esiste un modo per recuperare la skin.","replies":[{"poster":"sbepi","date":"2019-11-24T14:05:09.947+0000","up_votes":2,"down_votes":1,"body":"1) non puoi comprare o ricevere in regalo skin se non hai il campione\n2) con i gettoni compri la croma di una skin, non la skin base -----> non si possono usare le croma fino a che non compri la skin base\n3) in parole povere tu hai una croma che non puoi usare fino a che non compri la skin base\n4) i gettoni non sono restituibili","replies":[{"poster":"BrattishSolid6","date":"2019-11-24T14:22:05.190+0000","up_votes":1,"down_votes":0,"body":"> 1) non puoi comprare o ricevere in regalo skin se non hai il campione\n2) con i gettoni compri la croma di una skin, non la skin base -----> non si possono usare le croma fino a che non compri la skin base\n3) in parole povere tu hai una croma che non puoi usare fino a che non compri la skin base\n4) i gettoni non sono restituibili\n\nThis.\n\nC'è scritto molto chiaramente che si tratta della chroma dorata. La skin in sé è acquistabile solo durante il periodo dei mondiali (penso che ora non lo sia già più, dovrai attender l'anno prossimo). La skin costa 975RP. \n\nE comunque non hai pagato 35€ per quella skin. Hai pagato 35€ per un tot di gettoni mondiali, più probabilmente il pass o una vagonata di orbs. Non sei stato truffato, ti sei solo informato molto poco su quello che acquistavi.","replies":[]}]},{"poster":"Immortal Madness","date":"2019-11-24T15:18:00.561+0000","up_votes":1,"down_votes":2,"body":"Se chiedi al supporto di farti un refund dei gettoni perche ti sei accorto che non puoi usarla, probabilmente te li refundano, a me li hanno refundati quando ho preso per sbaglio il bordo True damage per qiyana e mi sono reso conto dopo che la skin prestigio usa il suo bordino unico e non quelli normali.\n\nSpero di averti aiutato! {{item:2139}}","replies":[{"poster":"BrattishSolid6","date":"2019-11-24T16:40:11.847+0000","up_votes":1,"down_votes":1,"body":"Uuuh davvero? Questo non lo sapevo!\n\n{{sticker:sg-lux}}","replies":[]}]}]}