{"poster":"RaResz","date":"2016-09-12T20:49:24.450+0000","title":"Qué hacer con los cofres?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Tengo ocho y a pesar de que juego y juego (sacado S o no), casi nunca dan llave.\r\nDeber&iacute;an agregar alguna opci&oacute;n m&aacute;s interactiva con los cofres si nunca se los va a poder abrir.","replies":[{"poster":"Fedemax","date":"2016-09-12T23:03:14.241+0000","up_votes":1,"down_votes":0,"body":"no se los demas pero yo siempre consigo mas llaves en aram.","replies":[]},{"poster":"Condor","date":"2016-09-12T21:39:58.714+0000","up_votes":1,"down_votes":0,"body":"La idea es que sea difícil de encontrar llave, si te están dando la posibilidad de obtener skins gratis xD.","replies":[]},{"poster":"Excidiar","date":"2016-09-12T21:33:54.454+0000","up_votes":1,"down_votes":0,"body":"Bueno, se supone que cada vez es más difícil conseguir fragmentos de llave. Yo el mes pasado abrí 3 cofres y me quedo un fragmento, este llevo abiertos dos cofres. ¿Que hago con ellos? Bueno, en realidad es facil de explicar. Mi primer objetivo es desbloquear todos los champs, entonces, sabiendo que:\n1) salvo los cofres de regalo, no pueden salir champs de 450 a menos que sean los unicos que te falten.\n2) salvo que tengas todos los champs, siempre te va a salir un fragmento de uno que no tengas.\n3) es MUY difícil abrir los 4 cofres de cada mes.\n4) los campeones mas caros dan y cuestan mas esencia que los baratos (lo mismo aplica a skins)\n\nentonces lo que se me ocurrio es sencillo... comprar primero todos los campeones de 1350 PI (Hice mi unica excepcion con {{champion:68}} porque me encanta, y con la mayoria de los de 450 PI porque esto no se me habia ocurrido antes) Así, cuando los tenga comprados, solo me van a salir campeones mas caros. Obvio que voy a terminar comprando campeones que no me vayan bien o que esten un poco fuera del meta, pero lo bueno de esta idea es el saturar probabilidades, entre mas rapido desbloquee campeones, mejores probabilidades hay de que toque uno bueno en un cofre.\n\nY bueno, también te felicito porque eso de tener mas cofres que llaves es normal y tan solo significa que sabes como sacar una S, que no jugas siempre el mismo campeon (los estoy viendo Main Yasuo, Zed, etc.) Y que podes adaptarte bien a los campeones que tengas.\n\nNos vemos en la grieta.","replies":[]},{"poster":"Vaendrys","date":"2016-09-12T20:52:56.784+0000","up_votes":1,"down_votes":0,"body":"La idea es abrir pocos cofres,no 300.","replies":[{"poster":"RaResz","date":"2016-09-12T20:53:49.342+0000","up_votes":1,"down_votes":0,"body":"Supongo que esto está pensado para que el que quiera abrir 300, compre llaves con RP.","replies":[{"poster":"Vaendrys","date":"2016-09-12T21:12:07.313+0000","up_votes":1,"down_votes":0,"body":"Y claro,algo bueno tiene que sacar rito con esto,es una empresa (?","replies":[]},{"poster":"Lunari Red Mask","date":"2016-09-12T21:10:54.981+0000","up_votes":1,"down_votes":0,"body":"Yo compro llaves con RP, funciona XD.","replies":[]}]}]}]}