{"poster":"Ace1997","date":"2016-04-25T03:18:05.069+0000","title":"URF-Modus","subforum":"Karten & Spielmodi","up_votes":3,"down_votes":6,"body":"An alle League of Legends Spieler, \nich frage mich ob der URF-Modus dieses Jahr nicht Rekorde gebrochen hat. Mein ganzer Freundeskreis hat diesen Modus geliebt und gesuchtet.\nDa frage ich mich ob es bei euch genauso ist das um 04:00 morgens es nur 15 sekunden dauert bis ein URF Spiel erstellt war.\nW&auml;rt ihr daf&uuml;r URF als PERMANENTEN MODE einzusetzen? Wenn genug Zustimmungen vorhanden sind unternimmt Riot vielleicht etwas :D","replies":[{"poster":"Megamaexx","date":"2016-04-25T05:13:17.000+0000","up_votes":6,"down_votes":1,"body":"Ich hab genug URF gespielt, gestern hab ich schon wieder mit normal games weitergemacht. \nIch würde mich mal auf die Doombots freuen, aber die brauchen wohl noch sehr lang...","replies":[{"poster":"Shadow l Eagle","date":"2016-04-25T10:01:56.295+0000","up_votes":1,"down_votes":0,"body":"Doombots ftw !!","replies":[]}]},{"poster":"Zaddok","date":"2016-04-25T07:58:01.957+0000","up_votes":4,"down_votes":1,"body":">Wärt ihr dafür URF als PERMANENTEN MODE einzusetzen?\n\nNein, und warum sollte ausgerechnet URF als permanenter Modus kommen?","replies":[{"poster":"Shiggyvara","date":"2016-04-25T08:22:10.281+0000","up_votes":3,"down_votes":6,"body":"Weil er von den temporären Modi der beliebteste ist (guck in Riots Statistik).","replies":[{"poster":"Rkoturdo Ndo","date":"2016-04-25T08:33:04.505+0000","up_votes":4,"down_votes":0,"body":"Heya\nIch glaube wenn er permanent werden würde würde er das gleiche Schicksal erleiden wie Dominion.\n\nMfG Rkoturdo","replies":[{"poster":"Zulwar","date":"2016-04-25T10:11:18.819+0000","up_votes":1,"down_votes":1,"body":"Vielleicht, muss aber nicht sein. Wenn ich von mir selber sprechen darf, habe ich seid dem Dominion draußen war, ein einziges Spiel gespielt und dann nicht mehr, da der Modus mich nicht ansprach.\n\nWenn aber URF draußen ist, spiele ich nur noch URF und wenn dieser Modus Permanent werden würde, würde ich auch diesen nur noch spielen, da Ranked oder normals, ja selbst ARAM für mich nicht mehr interessant wären.\nDenn dieser Modus macht spaß, egal mit welchen Champion man antritt.","replies":[{"poster":"Rkoturdo Ndo","date":"2016-04-25T10:18:35.724+0000","up_votes":1,"down_votes":0,"body":"Heya\nWie ich in [diesem Post](http://boards.euw.leagueoflegends.com/en/c/karten-spielmodi-de/vhFKAnlp-urf-modus?comment=0007) von mir schon gesagt habe, Riot hat meine Vermutung bestätigt.\n\nMfG Rkoturdo","replies":[]}]}]},{"poster":"Zaddok","date":"2016-04-25T08:28:23.429+0000","up_votes":5,"down_votes":1,"body":"Quelle? :)\n\nUnd wer sagt - nur weil er \"der Beliebteste\" ist - auch deswegen permanent wird?","replies":[{"poster":"Shiggyvara","date":"2016-04-25T08:37:57.262+0000","up_votes":2,"down_votes":1,"body":"http://na.leagueoflegends.com/en/news/game-updates/features/featured-game-modes-2014\n\n \"Based on the response from players around the world in multiple regions and languages, we extended the length of the mode (twice).\"\n\nZugegebenermaßen musst du dabei erstmal zwischen den Zeilen lesen können aber das es der einzige Modus ist, bei dem explizit erwähnt wird, dass er zweimal verlängert wurde sollte erstmal ausreichend sein.\n\nIch glaube übrigens auch nicht, dass er permanennt wird aus dem gleichen Grund, warum es keine SolQ mehr geben wird. \nEs nimmt nen par Millionen Spielerbasis aus den anderen Modi und es kann nicht sein, was nicht sein darf :)","replies":[{"poster":"Zaddok","date":"2016-04-25T08:42:10.713+0000","up_votes":4,"down_votes":3,"body":">Zugegebenermaßen musst du dabei erstmal zwischen den Zeilen lesen können\n\nDas kann ich sehr wohl, danke dafür.\n\n>aber das es der einzige Modus ist, bei dem Explizit erwähnt wird, dass er zweimal verlängert wurde sollte erstmal ausreichend sein.\n\nFür mich nicht, nein.\n\nWobei dein Link nicht mal eine Statistik ist in meinen Augen, aber gut - selbst wenn es eine wäre - ist sie veraltet und für mich demnach nicht aussagekräftig für die Meinung der Spieler gegenüber URF 2016.","replies":[{"poster":"Shiggyvara","date":"2016-04-25T08:46:36.556+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Zaddok,realm=EUW,application-id=cGRapXds,discussion-id=vhFKAnlp,comment-id=00040000000000000000,timestamp=2016-04-25T08:42:10.713+0000)\n>\n>aber gut - selbst wenn es eine wäre - ist sie veraltet und für mich demnach nicht aussagekräftig für die Meinung der Spieler gegenüber URF 2016.\n\nTja demnach akzeptierst du halt kein anderes Urteil als dein eigenes und jede Diskussion ist hinfällig und ich muss mir keine Arbeit mehr machen, wenn du Quellen aus den letzten Jahren (und von diesem kann es noch keine geben, weil die komplette Rotation noch nicht durch ist) als veraltet ansiehst.","replies":[{"poster":"Zaddok","date":"2016-04-25T08:59:39.397+0000","up_votes":1,"down_votes":2,"body":">Tja demnach akzeptierst du halt kein anderes Urteil als dein eigenes\n\nDoch, tue ich. Aber nur wenn man die eigenen Argumente - wenn man schon welche aufbringt - auch belegen kann.\n\n>wenn du Quellen aus den letzten Jahren (und von diesem kann es noch keine geben, weil die komplette Rotation noch nicht durch ist) als veraltet ansiehst.\n\nDeine \"Quelle\" wie du sie nennst ist ein Artikel und keine Statistik wie du anfänglich behauptest hast. :)\n\n---\n\nDu meinst es sei der beliebteste Modus gewesen und das kann man in Riot's Statistiken sehen.\nBelegen konntest du es aber nicht.\n\nArgumente ohne jeglichen Boden aufzuführen führt nicht zu einer Diskussion.","replies":[]}]}]},{"poster":"Alustus","date":"2016-04-25T11:04:43.774+0000","up_votes":1,"down_votes":0,"body":"Ich glaube nicht das es den selben Grund wie die SoloQ hat.\n\nWer rank spielen möchte spielt auch Rank die Spieler werden mMn nicht zu URF abwanderen.\nBeim SoloQ ist es ja mehr oder weniger offensichtlich dass dort viele DynamicQ spieler spielen würden.\n\nIch glaube jedenfalls nicht das URF da große Änderungen mit sich bringen würde.\n\nDas Problem liegt eher beim balancing bzw. der Langzeitmotivation.\nVor 2 Jahren hat man schon gesehen je länger der Modus online war desto weniger haben diesen gespielt.\n\nWobei ich aber schon glaube das er um einiges beliebter als Dominon wäre und wahrscheinlich Aram","replies":[]}]}]}]}]},{"poster":"ClAO KAKAO","date":"2016-04-25T12:39:11.917+0000","up_votes":2,"down_votes":0,"body":"Es war gestern so langweilig, jeder hat nur die OP Champs gespielt, da es auch zuwenig Bans gab. Meiner Meinung nach war nur das erste mal URF richtig gut, als keiner im Vorraus wusste was gut und schlecht ist.","replies":[]},{"poster":"Redgared","date":"2016-04-25T03:32:11.179+0000","up_votes":3,"down_votes":2,"body":"Hab gesuchtet bis zum ende <3","replies":[{"poster":"Ace1997","date":"2016-04-25T03:33:27.228+0000","up_votes":2,"down_votes":2,"body":"Bei mir genauso, bin sogar wach geblieben bis grad um zu spielen *-*","replies":[]}]},{"poster":"Rkoturdo Ndo","date":"2016-04-25T09:56:58.579+0000","up_votes":1,"down_votes":0,"body":"Heya\nRiot selbst äußert sich ja dazu:\n> The main design concern (which is personally the most important as it = less fun) is that Featured Gameplay Modes are not designed to be long term engagement experiences. They’re designed to make a big splash, with the knowledge they will be removed shortly thereafter. Adding permanency would constrain the design wiggle room we have to make each mode as unique as possible. As we’ve since learned, it would also add additional balance and maintenance costs that we’ll share some examples of later in this retro. For now though, let’s get into the modes! \n\nUnd weiterhin:\n> Featured Gameplay Modes have been shown to taper off in popularity sharply after a short period of time. People often forget that URF actually broke our golden rule of not touching Featured Gameplay Modes post-launch, but to try and keep it from becoming stale in the face of wildly toxic champion play patterns, we did anyway. And yet, despite our consecutive on the run tweaks to keep URF treading water balance-wise, we still saw the same declining engagement and burnout that we see with other modes. That doesn’t mean players don’t have a blast with each mode like this before they fade away. However, being designed as a can of whoopass in the first place ultimately means that the flame burns twice as bright and half as long. And that’s okay! \n\nUnd genau das ist der Grund warum der Mode nicht permanent kommen wird, die Leute würden einfach ihr Interesse verlieren.\n\nMfG Rkoturdo\n[\nQuelle](http://na.leagueoflegends.com/en/news/game-updates/features/featured-game-modes-2014)","replies":[]},{"poster":"SorisDynasty","date":"2016-04-25T09:06:14.388+0000","up_votes":1,"down_votes":0,"body":"Eh, ich schätze, dieses Mal kommt es so vor, weil der Modus nur 3 Tage da war. Die Leute wussten um die begrenzte Zeit und es war für die Hardcore-Fans auch nicht genug Zeit, um den Modus ausgelutscht wirken zu lassen. Die Male, als Urf 2 Wochen da war, wurden es mit anhaltender Länge weniger Spiele, einfach weil der Modus, wie jeder andere Modus auch, auf Dauer seinen Reiz verliert.\n\nIch persönlich habe es nicht gespielt, da ich den Modus nicht mag, aber ich habe gehört und auch in 'nem Stream gesehen, wie überall ständig dieselben zu starken Champions gespielt wurden und sobald etwas nicht S oder A-Tier war, hat man schlicht und ergreifend verloren. That ain't no fun.","replies":[]},{"poster":"Günther OhMad","date":"2016-04-25T08:05:06.549+0000","up_votes":1,"down_votes":0,"body":"bisschen öfter wird er ja jetzt bestimm kommen ((Spielmodirotation) aber bei permanent würde doch einfach der reiz verloren gehen","replies":[]},{"poster":"IM20I","date":"2016-04-25T07:29:42.916+0000","up_votes":3,"down_votes":3,"body":"URF sollte meiner Meinung nach definitiv öfter kommen!\nBester Spielmodus! <3","replies":[]},{"poster":"StillYasuoMain","date":"2016-04-25T05:50:18.240+0000","up_votes":2,"down_votes":3,"body":"NIcht permament, aber immer 4 mal pro Season und immer 5 Tage lang.","replies":[]}]}