{"poster":"AMO EL CHORI","date":"2017-11-20T07:46:47.813+0000","title":"¿Qué puedo hacer para volver a encontrar ese gusto por el LoL?","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Hace cosa de 2 meses que perd&iacute; las ganas de seguir en este juego, para serles sincero entro con ganas y cuando inicio sesi&oacute;n, voy a jugar para elegir el modo y se me va todo el &aacute;nimo. No s&eacute; si ser&aacute; la comunidad agotadora de LAS, o mi manera de desempe&ntilde;arme dentro del juego, o lo que fuere, pero si de algo estoy seguro es que no tengo m&aacute;s ganas de jugar LoL, no como antes. Recuerdo que hace 2 a&ntilde;os atr&aacute;s era llegar del colegio a las 17:15, o 22:30 los d&iacute;as que ten&iacute;a clase en taller (iba a t&eacute;cnica) y jugar horas y horas, o esperar a que sea viernes para jugar hasta las 6 de la ma&ntilde;ana con mis amigos... Hoy d&iacute;a pierdo el &aacute;nimo solo con ver el &quot;Blind pick&quot; y por m&aacute;s que intente jugar y reencontrar ese afecto que le tuve por tanto tiempo al juego, no puedo, no me sale y no se que puedo hacer. Me parece que es hora de ir desinstalando y enfocarme en otras cosas que si me hagan reir y no enojarme como este juego con su hermosa comunidad de nenes de 13 a 18 a&ntilde;os que te insultan por cualquier cosa que hagas, o que Riot se esmere m&aacute;s en sacar contenido $$$ que en alejar a la gente t&oacute;xica que hace lo que le da la gana. \r\n\r\nMe cans&eacute; de mandar tickets al soporte con capturas, fragmentos de chat&#039;s en partida y selecci&oacute;n de campe&oacute;n y que me digan siempre el tipico &quot;estamos trabajando en ello, pero desafortunadamente no podemos compartir detalles contigo&quot; \r\n\r\n\r\nLes pido una disculpa si redact&eacute; mal y no se entienden mis palabras, pero necesitaba decirlo y quiz&aacute; no elabor&eacute; &eacute;stas l&iacute;neas de la mejor manera posible. \r\n\r\nSuerte.","replies":[{"poster":"rokushoger","date":"2017-11-20T12:35:25.904+0000","up_votes":2,"down_votes":0,"body":"Y porqué habrías de hacer algo? Es decir, si te aburriste te aburriste y ya, podes jugar otros juegos, o hacer otras cosas. Tal vez dejandolo un tiempo lo extrañes y vuelvas.\n\nSaludos!","replies":[]},{"poster":"fenixerege","date":"2017-11-20T14:27:14.466+0000","up_votes":1,"down_votes":0,"body":"el LOL siempre esta abierto para que vuelvas si quieres descansar","replies":[]},{"poster":"Lucio22","date":"2017-11-20T07:55:35.262+0000","up_votes":1,"down_votes":0,"body":"welp:\n1. \"Hoy día pierdo el ánimo solo con ver el \"Blind pick\"\" una solucion seria dejar de jugar blind pick. anda a aram, estos juegos de finde (como ascension, no recuerdo el titulo que les dieron) o incluso contra bots, para pasar un rato tranqui e intentar boludeces (como con un amigo que fuimos garen zil unicamente para darle velocidad mientras gira)\n2. si dejas el juego, no lo desintales. capaz hoy por hoy no queres jugarlo mas, pero capaz en 2 o 3 meses queres agarrarlo de nuevo. al no desinstalarlo no te comes el garron de empezar todo de 0 (me paso, estuve 2 meses sin jugar, por suerte no lo habia desinstalado y tarde menos de media hora actualizando)\n3. siempre podes ir a otros juegos. tenes steam y origin con juegos gratuitos (algunos en el caso de origin), o juegos baratos, sobretodo ahora que steam ta en pesos argentinos. si queres alejarte de lo que es un moba, yo recomendaria rpg's o juegos de pelea (si la segunda opcion te gusto, avisame y te tiro algunos titulos)","replies":[{"poster":"AMO EL CHORI","date":"2017-11-20T08:07:13.402+0000","up_votes":1,"down_votes":0,"body":"Estoy en steam 24/7, ultimamente en pubg mas que nada y de vez en cuando juego PCards 2 o Tekken 7 para pasar el rato. Pensaba comprarme el Gmod, el DB Daylight y el Rocket League por el tema de que como están en pesos no superan los $550 (antes estaban algo de 50 usd en total lo que serían como 850 pesos o algo por el estilo) pero estamos a 5 semanas de navidad asique prefiero esperar a ver que onda las ofertas y ver que puedo comprar de piola, sino de ultima me los compro y fue porque ahi si tengo amigos con los cuales jugar.\n\n\nVolviendo a LoL, me pasa con todos los modos en general, tampoco es que me llamen mucho la atención los rotativos (aunque si disfruto mucho de One for All, Hexakill y el viejo URF, porque el ARURF no me gusta jaja) ","replies":[]}]},{"poster":"Maddïe","date":"2017-11-20T07:51:06.687+0000","up_votes":1,"down_votes":0,"body":"La única solución es jugar con premades bien piolas (?","replies":[{"poster":"AMO EL CHORI","date":"2017-11-20T08:03:56.522+0000","up_votes":1,"down_votes":0,"body":"El tema es que LoL siempre jugué con amigos, nunca me gustó hacerlo solo más allá de jugar soloq, pero como ahora ellos no juegan tanto y se fueron más para el lado competitivo de cs (uno está en aguila 2 y el otro en sheriff) no tocan lol mas que 1 vez por semana y con suerte. yo intenté jugar cs pero soy malísimo, no pude superar Gold nova II (aunque solamente tengo algo de 32 hs jugadas) y me aburrí de que me expulsen los br asique lo deje","replies":[]}]},{"poster":"IgeiTon","date":"2017-11-20T11:10:35.541+0000","up_votes":1,"down_votes":1,"body":"Lo mejor que te puede pasar en la vida es perder el gusto por el lol, ojala me pasara eso........... Fuera de joda, ami me paso un par de veces, el lol puede ser muy divertido y muy frustrante a la vez, y me paso de dejarlo varias veces por uno o dos meses, y de volver. La comunidad no solo de las sino en todas las regiones es super toxica, aunque hoy dia con el rollo del honor mejoro bastante, yo mismo mejore mucho. Si no te da ganas de jugar solo, entra cuando estes con amigos, juga sin preciuonarte por ganar, pedi jugar un a linea que realmente te divierta, juga el pik que te divierta mas alla del meta, y tomatelo como eso un juego, no rankees, menos en esta epoca, porque la podes pasar muy mal, jugate una o dos partidas y dejalo ahi. Mas que eso no te puedo decir. Saludos y mucho exito!","replies":[]}]}