{"poster":"AMO EL CHORI","date":"2016-01-29T19:45:54.319+0000","title":"ip por partida, es muy bajo riot.","subforum":"Charlas Generales","up_votes":17,"down_votes":3,"body":"El IP que recibo por partida es demasiado bajo, ej: 64 Pi por 35 minutos de juego con victoria, cuanto voy a estar para comprar un campe&oacute;n de 6300 que me gusta? 15 d&iacute;as? na, tard&eacute; 20 d&iacute;as en comprarme Lucian con el poco y miserable Pi que me dan por partida, exijo que aumenten al menos en 20 en pi que recibimos todos porque es pat&eacute;tico... me compr&eacute; el aumento de Pi de 10 victorias para ver si me daban m&aacute;s de 160 y no, 120 como maximo, es muy poco y adem&aacute;s aburre much&iacute;simo estar juntando casi 1 mes para una sola cosa.","replies":[{"poster":"lord win","date":"2016-01-31T00:50:25.501+0000","up_votes":2,"down_votes":0,"body":"\"Exijo\"","replies":[]},{"poster":"Vastorn","date":"2016-01-30T03:11:38.868+0000","up_votes":2,"down_votes":0,"body":"Pues si no quieres esperar, la solución es simple, compra RP. Actualmente están en oferta Zed, Lissandra y Jinx de 6300, para que los compres a mitad, suerte ;)","replies":[{"poster":"AMO EL CHORI","date":"2016-01-30T05:41:43.053+0000","up_votes":1,"down_votes":1,"body":"Compraría Rp, pero no puedo, el dolar está muy caro ahora ! y Zed me lo quería comprar pero no me decido porque también quiero a rengar :c","replies":[{"poster":"Rayito","date":"2016-01-31T00:20:26.869+0000","up_votes":1,"down_votes":0,"body":"A rengar lo nerfiaron ni te gastes en comprarlo...","replies":[]}]}]},{"poster":"Karrie","date":"2016-01-29T19:53:49.563+0000","up_votes":2,"down_votes":1,"body":"¿No aprovechaste el aumento de pi con amigos? me daban casi 500 por partida :)","replies":[{"poster":"AMO EL CHORI","date":"2016-01-29T20:08:15.767+0000","up_votes":2,"down_votes":0,"body":"Lo hice y nada más compré 1 campeón (Yasuo). Que suerte, a mí me daban 300 máximo por partida y eso jugando de a 5.","replies":[{"poster":"Karrie","date":"2016-01-29T20:11:18.497+0000","up_votes":1,"down_votes":0,"body":"Es que igual depende los minutos de duración de partida, en la más peleada me dio 486 de pi que duró como 48 min :S jajaja\nsi tiraban surrender obvio que da menos","replies":[{"poster":"Fharzen","date":"2016-01-29T23:02:07.534+0000","up_votes":1,"down_votes":0,"body":"A mi me daban 600 por victoria y 250 por derrota mas o menos.\nEl problema es que después de eso el RP que dan ahora parece nada jajaja.","replies":[]}]}]},{"poster":"Shake and Bake","date":"2016-01-29T20:13:33.015+0000","up_votes":1,"down_votes":2,"body":"Entonces tenemos que seguir ganando 60 pi esperando que den aumento para \"aprobecharlo\"?, 9 runas te salen mas que un champ","replies":[]}]},{"poster":"Khimea","date":"2016-01-29T19:49:54.777+0000","up_votes":4,"down_votes":2,"body":"me causa gracia leer la palabra \"exijo\" en este foro xD","replies":[{"poster":"AMO EL CHORI","date":"2016-01-29T20:08:46.882+0000","up_votes":3,"down_votes":2,"body":"Que tendría que escribir entonces? \"Si no cambian el sistema de ip los lleno de confítes\"?","replies":[]}]},{"poster":"Insane Warlord","date":"2016-01-29T19:51:59.722+0000","up_votes":2,"down_votes":1,"body":"El sistema de pi esta hecho para los que juegan todo el dia, no piensan en los que jugamos poco. En mi opinion el bonus de primera victoria que dan cada 24 horas deberia ser cada 8 o 12.","replies":[{"poster":"AMO EL CHORI","date":"2016-01-29T20:07:12.917+0000","up_votes":1,"down_votes":0,"body":"Yo ahora que estoy en vacaciones juego todo el día, pero es muy poco lo que gano... Yo también pienso que deberían poner la primera victoria del día cada 8 horas y cambiar el nombre.","replies":[{"poster":"Ellora","date":"2016-01-29T22:15:35.319+0000","up_votes":1,"down_votes":0,"body":"No digo que el sistema este bien, pero si jugas todo el dia como decis (ponele de 10 a 24, parando para comer y baño) + la 1era victoria del dia, tendrias que sacar minimo 1000 pi x dia.. en 6-7 dias tenes para el campeon de 6300pi.\n\nTe doy mi ejemplo: saco 216pi 1era victoria, juego 5 partidas con bots cuando no tengo ganas de pvp o se quema el server, hasta ahi junto 500pi. los 500 restantes son en pvp... 1000 al dia","replies":[{"poster":"AMO EL CHORI","date":"2016-01-30T05:40:03.016+0000","up_votes":1,"down_votes":0,"body":"Ahora te dígo cuando tardé en comprar a Yasuo teniendo los 300% de ip y cuando tardé en comprar a Lucian sin tener nada.\n\nLucian: El campeón que me compré antes a él fue Ahri de 4800, el 27 de diciembre del 2015, y a Lucian lo compré el 10 de enero de 2016 jugando todos los días. \n\nYasuo: El campeón que compré antes que a él fue Shen de 3150 el 16 de enero del 2016, y a Lucian lo compré el 23 de enero de 2016 jugando todos los días con el aumento de ip + la caída del servidor.","replies":[]}]}]}]},{"poster":"AuroraExecution","date":"2016-01-29T20:20:40.364+0000","up_votes":1,"down_votes":0,"body":"El sistema esta bien. Riot quiere que juegues mucho.","replies":[{"poster":"AMO EL CHORI","date":"2016-01-29T21:04:18.113+0000","up_votes":1,"down_votes":5,"body":"LAS es un asco, el servidor se cae cada 2 días, está lleno de ratas (argentinas y chilenas más que nada), trolls por todos lados, y está lo del ip... El sistema es un asco a mi parecer .","replies":[{"poster":"Hextech Man","date":"2016-01-30T01:58:02.887+0000","up_votes":1,"down_votes":0,"body":"Pues ahí tenes la puerta. Kappa","replies":[{"poster":"AMO EL CHORI","date":"2016-01-30T05:46:24.940+0000","up_votes":1,"down_votes":0,"body":"Ya lo dije en otro post si no me equivoco, me voy a ir a NA. Esto allá no pasaba.","replies":[{"poster":"NGreppi","date":"2016-01-30T21:08:09.177+0000","up_votes":1,"down_votes":0,"body":"Te quejas del ping en LAS y alla en NA vas a tener 100-120 fjo xD","replies":[{"poster":"AMO EL CHORI","date":"2016-02-07T23:22:03.115+0000","up_votes":1,"down_votes":0,"body":"Ya me hice una cuenta, y sí, tengo 100 ms clavados. Acá tengo 180 - 200 cuando cae el sv y 60 cuando anda bien.","replies":[{"poster":"NGreppi","date":"2016-02-08T17:12:58.180+0000","up_votes":1,"down_votes":0,"body":"Y bueno, andate, luego te encontraras con los ratas de alla que te diran \"taco\" entre otras cosas y veras xD. Ratas/flamers/trolls hay en todos lados","replies":[{"poster":"AMO EL CHORI","date":"2016-02-10T19:01:31.209+0000","up_votes":1,"down_votes":0,"body":"No me fuí a LAN, me fuí a NA... sé hablar inglés y entenderlo perfectamente asíque cuando me insulten los muteo y gg izi xD","replies":[]}]}]}]}]}]}]}]},{"poster":"alop55555","date":"2016-01-30T22:55:12.967+0000","up_votes":1,"down_votes":0,"body":"te apoyo con esto el sistema no es muy amigable con los jugadores que están empezando que no pueden comprar runas ni campeones para empezar a jugar lo que no es una buena forma de empezar a jugar lol","replies":[{"poster":"AMO EL CHORI","date":"2016-02-07T23:24:07.028+0000","up_votes":1,"down_votes":0,"body":"Se supone que mientras más objetivos hagas, más tiempo de partida tengas, más ip te dan, pero no, jugué una de 1:22:56 segundos y me dieron nada más 96 ip haciendo todo menos el último dragón.","replies":[]}]},{"poster":"cajaru977","date":"2016-01-30T22:32:10.524+0000","up_votes":1,"down_votes":0,"body":"Si bien, es molesto jugar tanto para comprar un misero campeon\n\nTambien estsa echo para que la gente compre RP, Ya que mucha gente quiere un campeon pero no quiere esperar tanto a comprarlo...\n\n\nBascamente el sistema esta echo para que gastes RP","replies":[]},{"poster":"Elyasviel","date":"2016-01-30T02:21:45.113+0000","up_votes":1,"down_votes":0,"body":"Opino exactamente lo mismo, en el aumento de pi de la semana pasada o la anterior a esa, no pude conseguir casi NADA porque moria de lagg en cada partida, quiero comprar campeones caros, me atraen mas los de 6300, y por no se cuantos minutos de partida conseguis maximo 65-70  y es muy aburrido, no quiero estar jugando como viciado para que despues de jugar 123912 partidas este tilteado y putee a todo el mundo, uno juega para divertirse y jugar mil partidas en un dia para comprar algo no vale la pena","replies":[{"poster":"AMO EL CHORI","date":"2016-01-30T05:48:56.370+0000","up_votes":1,"down_votes":0,"body":"Exacto, es muy pero muy aburrido\n\n Yo después de jugar 2 partidas me canso, pero sigo para poder comprar un campeón lo antes posible (ese antes posible serían 2 semanas como máximo jugando todos los días) a mí me gustaría que aumenten por lo menos el ip recibido en 20","replies":[]}]},{"poster":"Hexplosivo","date":"2016-01-30T02:32:08.281+0000","up_votes":1,"down_votes":0,"body":"Menos mal que tienes 8 campeones gratis todas las semanas para ir variando y descubriendo cosas nuevas dentro del juego, y que hay otros precios de campeones más bajos que 6300 (los más divertidos en mi opinión están en 4800), y que al parecer no tienes nada más que hacer en el día para juntar más PI.\nAsí tus quejas parecen más bien el llanto de un niño malcriado.","replies":[]}]}