{"poster":"AMO EL CHORI","date":"2016-07-27T05:06:31.988+0000","title":"LeBlanc, qué se puede hacer con ella cuando sos un adc ?","subforum":"Problemas Técnicos","up_votes":2,"down_votes":1,"body":"A ver, qu&eacute; pasa con LeBlanc? est&aacute; m&aacute;s fuerte que antes, sigue igual o que onda? porque no puede ser que con 12 kills y 151 de farm en 40 minutos me vuele con 2300 hp llevando yo 300 de farm, 150 m&aacute;s que ella. Me da bronca jugar contra ese campe&oacute;n y siempre, pero siempre termino reportando a los que la usan por decir izi, estoy re cansado de ella","replies":[{"poster":"Overlord onCRACK","date":"2016-07-27T05:12:58.869+0000","up_votes":2,"down_votes":0,"body":"Comprarse un Ángel Guardián... Pedirle ayuda al Team... Tener buena posición y rezar por que no saque kills al comienzo :'c {{item:3070}}","replies":[]},{"poster":"Nombre ofensivo","date":"2016-07-27T05:09:00.189+0000","up_votes":2,"down_votes":0,"body":"{{item:3156}} o {{item:3102}} \n\nes tedioso, pero sino saca kills en niveles bajos pierde muchisimo potencial, sugerile al mid mucha precaucion","replies":[]},{"poster":"rokushoger","date":"2016-07-27T12:29:32.094+0000","up_votes":1,"down_votes":0,"body":"Es obvio que con ese farm y esa cantidad de kills te va a borrar, porque su daño es burst, y por muchos minion que tengas sobre ella seguro los invertiste mayormente en daño y no en defensa, es su trabajo hacer eso.\n\nTenés dos \"principios\" básicos para defenderte de ella, con items o con técnica, me explico:\n\nItems: \n\nBásicamente te sugiero un par de items que te pueden salvar la vida con ella:\n\n{{item:3102}} {{item:3156}} {{item:3065}} (solo si tenés mucho life steal) {{item:3812}} (además en combinación con apariencia es muy bueno). {{item:3026}} \n\nTécnica:\n\nCon esto me refiero a como evitarla. Básicamente tenés que tenerle un ojo encima todo el tiempo y tratar siempre que entre ella y tu esté todo tu team. Jugala vos un par de veces para conocer el rango de su W y asegurate siempre de estar fuera del rango de una sola de esas. Me diras \"pero la puede castear dos veces\", si, pero el daño de leblanc viene dado por el daño de su doble sello (creo que es la Q), si no te pega doble marca entonces no pega tanto como para burstearte, el tema es que para hacer eso tiene que estar a rango tuyo y si usa la doble w para acercarse perdera el segundo casteo de su Q dejandole solo una y la E. En ese momento tenés la opción de caminar hacia un costado para esquivarle la E y que se pierda su Q.","replies":[]},{"poster":"Mathy","date":"2016-07-27T10:16:10.981+0000","up_votes":1,"down_votes":0,"body":"Es lo mismo que pasa con cualquier asesino fedeado. El adc o es boleta o es boleta. Depende siempre de como el team lo defienda. Obviamente de deleteara de un combo si no tiene nada de MR. La costumbre de todo adc es armarse full daño y bueno, así terminan =P.","replies":[]},{"poster":"4000 RAINYNIGHTS","date":"2016-07-27T05:12:03.578+0000","up_votes":1,"down_votes":0,"body":"su doble q auto dirigida, esto {{item:3102}}","replies":[]},{"poster":"BiosDarkne55","date":"2016-07-27T05:08:45.958+0000","up_votes":1,"down_votes":0,"body":"Angel guardian-velo de banshee- malmortius {{item:3102}} {{item:3026}} {{item:3156}}","replies":[]}]}