{"poster":"Matthew Hawk","date":"2015-03-10T16:06:10.902+0000","title":"Tips for advancing (and mainly surviving) Solo Que? (Silver-Gold)","subforum":"Tips & Tricks","up_votes":1,"down_votes":0,"body":"I recently made the climb from Bronze 5 to Silver 5. I know it's nothing legendary but it is a great accomplishment for me.\r\nOne major thing I want to ask is if I should coast for a bit and play more normals with my higher elo or if I should continue with ranked.\r\nI still feel like I play with those who don't understand the mechanics of the game to well or pick weird team comps while the other team assembles the Justice League leaving me to cringe on the loading screen wondering how it's going to turn out. \r\n\r\nMy reason for posting isn't so much to rant, or go on and on about my troubles; but mainly it is to ask the community for advice on continuing my journey through Solo Que. So if you guys 'n gals have any tips or advice for me it would be greatly appreciated :D\r\nThanks for reading!","replies":[{"poster":"Kapppaccino","date":"2015-03-10T20:30:58.243+0000","up_votes":2,"down_votes":0,"body":"Head imagery. Think about your main champ all day and their kits. Now think of every matchup you see. Think about what you would do if you were ahead or behind. Learn to always win your lane and then work on mid game. Mid game is the most important part of the game . 1 fuck up and you can throw a lead .","replies":[]},{"poster":"Merxamers","date":"2015-03-10T19:57:45.600+0000","up_votes":2,"down_votes":0,"body":"One tip i have (that i struggle to follow, sometimes) is to focus on what YOU could do to improve, after every game, instead of focusing on the mistakes of your allies. They will make mistakes, nothing you  can do about that;; it's much healthier to consider \"How was i CS-ing that game? Could i have prevented that enemy from snowballing by placing more wards? How did i do in executing my combos?\" etc. Also, take a break if you lose 2 games in a row; you probably won't be in the right state going into the third game. Just take a quick break and come back refreshed :)","replies":[]},{"poster":"GummyBearWookiee","date":"2015-03-10T17:23:36.588+0000","up_votes":2,"down_votes":0,"body":"Wish I could help...but I don't get it.  I'm Silver 4...played in a ranked last night and got demolished.  Looked up my team and the opposing team....everyone on my team was silver 4 or silver 3....one player was gold last season.  Opposing team had 3 silver 2's and 2 gold 5's....all of their team was gold last season.  Stupid MMR.","replies":[]},{"poster":"GundayMonday","date":"2015-03-10T17:13:45.019+0000","up_votes":2,"down_votes":0,"body":"In solo queue, pick a champion that can carry and spam games with them. The players don't consistently know what they're doing or have consistently solid mechanics until ~D3. Pick a champ like {{champion:11}} and grind your way through the ranks until you get with players that consistently understand the game.\n\nOther option, don't take it too seriously and just have fun!","replies":[]},{"poster":"The Chin","date":"2015-03-10T18:54:05.333+0000","up_votes":2,"down_votes":1,"body":"keep playing ranked, it's the best way to improve","replies":[]},{"poster":"Commando Yi","date":"2015-03-10T16:51:11.760+0000","up_votes":1,"down_votes":0,"body":"not sure what you mean here\n\nbronze 5 to silver 5 is a substantially greater climb than say gold to diamond\n\nand yes, keep playing ranked","replies":[]},{"poster":"Marcq34","date":"2015-03-10T16:11:50.508+0000","up_votes":1,"down_votes":0,"body":"I would recommend playing ranked so that you can improve your skill. The only way to get better is to play with people with a try hard mindset which isn't something you are guaranteed in normals. Try to avoid large losing sprees or playing on tilt but you should play a few ranked games every time you get on just to improve your skills and mechanics.","replies":[]}]}