{"poster":"ArN STΛB","date":"2019-04-30T19:11:04.064+0000","title":"LF COACH PER TEAM ELO PLATINO","subforum":"Reclutamento","up_votes":10,"down_votes":3,"body":"Ciao a tutti cerchiamo un coach per un team di elo platino, siamo in 10 ci alleneremo insieme e divisi in due team da 5. Partecipiamo a tornei e facciamo scrim interne ed esterne.\r\n\r\nRequisiti:\r\n- Serietà\r\n- Impegno e voglia di seguire il team per farlo migliorare\r\n- No prime esperienze\r\n- Over 18\r\n- Conoscenza del gioco e del meta\r\n- Disponibilità a 3 allenamenti variabili durante la settimana\r\n- Simpatico e carismatico\r\n\r\nNon esitate a contattarmi qui o direttamente su lol \r\n\r\n**STΛB**","replies":[{"poster":"BMP Il BodyGuard","date":"2019-05-02T14:07:06.334+0000","up_votes":4,"down_votes":0,"body":"Ho visto tanti commenti e mi è sembrato brutto non dire che kaoz è scarso {{summoner:4}}","replies":[{"poster":"OG Giacomonzi","date":"2019-05-02T15:55:14.101+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Luxifero","date":"2019-04-30T19:17:47.785+0000","up_votes":4,"down_votes":0,"body":"consigliato!","replies":[]},{"poster":"Unlucky Cuchu","date":"2019-05-01T14:35:49.724+0000","up_votes":1,"down_votes":6,"body":"Un team palesemente alle prime armi che cerca un coach esperto, per poi non ascoltare nemmeno... mah","replies":[{"poster":"ArN STΛB","date":"2019-05-01T20:05:39.361+0000","up_votes":4,"down_votes":0,"body":"beh se per coach intendi una persona che ti dice \" banna qualcosa contro irelia\" poi sta in silenzio, non guarda gli op.gg durante i tornei, non da una nozione strategica, guardando i replay non ha niente da dire apparte sei morto perchè non l'hai rispettato, tutto questo nelle 3 volte che si è presentato per 15 min, non sei sicuramente la persona di cui abbiamo bisogno. Direi che puoi risparmiare di scrivere visto che nessuno ti ha citato cosi magari conservi la tua dignità","replies":[{"poster":"ArN STΛB","date":"2019-05-01T20:08:16.269+0000","up_votes":3,"down_votes":0,"body":"sarei anche curioso di sapere le tue esperienze visto che puoi distinguere un team alle prime armi","replies":[{"poster":"Unlucky Cuchu","date":"2019-05-02T08:39:52.902+0000","up_votes":1,"down_votes":3,"body":"Sono stato in un po’ di team, non sono come molti di voi che fino a un mese fa giocava a soloq e basta.\nTi assicuro che se vi dico che siete alle prime armi è perchè è palesemente così. Prima lo capirete, prima diventerete una squadra decente.","replies":[{"poster":"OG GodKench","date":"2019-05-02T14:41:34.651+0000","up_votes":3,"down_votes":0,"body":"In realtà io personalmente ho giocato a molti tornei e con molti team. Mi ripeto, non sai fare il coach, magari sei forte a craftare picconi su minecraft.     {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Unlucky Cuchu","date":"2019-05-02T14:57:25.362+0000","up_votes":1,"down_votes":3,"body":"Sì certo, per quanto leggo immagino che tu sia stato anche a Colorado. \nDevo comunque chiederti scusa per aver dubitato del fatto che giocassi tutti i champ della midlane: Effettivamente ho visto che ne giochi un sacco, media di 5 cs al minuto ma tecnicamente li hai giocati.","replies":[{"poster":"Coach Platy","date":"2019-05-02T16:02:49.713+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Unlucky Cuchu,realm=EUW,application-id=n1bhmWE7,discussion-id=BpzEhANd,comment-id=000200000000000000000000,timestamp=2019-05-02T14:57:25.362+0000)\n>\n> Sì certo, per quanto leggo immagino che tu sia stato anche a Colorado. \n> Devo comunque chiederti scusa per aver dubitato del fatto che giocassi tutti i champ della midlane: Effettivamente ho visto che ne giochi un sacco, media di 5 cs al minuto ma tecnicamente li hai giocati.\n\na me piace kayle jungle :D","replies":[{"poster":"Josuah Flint","date":"2019-05-03T10:43:49.205+0000","up_votes":1,"down_votes":0,"body":"Ahahahhaha","replies":[]}]}]}]}]}]},{"poster":"Unlucky Cuchu","date":"2019-05-02T08:34:01.207+0000","up_votes":1,"down_votes":4,"body":"aahahahah e avete detto “no tanto con irelia batte tutto” e avete iniziato a fare i ban voi, poi vi hanno pickato contro irelia e “cazzo... lo sai giocare renekton??” ma dove siamo? E non sareste un team novello?\nOp.gg forniti 5 minuti prima ahah pensate che uno ve li deve chiedere ogni volta? così come ogni volta bisogna chiedervi di essere invitati in lobby?\nChe nozione strategica mirabolante vi aspettate? un team di PLATINI dove il jungler va top con l’infernal up, che non sa fa mezza rotazione ma stanno tutti fermi in lane fino al 15’ o che iniziano a cadere le torri (se va bene), come in soloq. Dovete capire che siete alle prime e se sbagliate la basi uno inizia da quelle. Tanto per fare un esempio, vi ho detto “al 6 pushate mid e collassate in 4 bot, li daivate e prendete il drago”. “nO lUx Ha TrOpPi cc”.... LUX??? ma anche se a torto non siete d’accordo, almeno l’umiltà di ascoltare e provare. Ma figurati, meglio ribattere e poi inventarsi che non vi è stato detto nulla. \nCosa pensate faccia un coach? Che vi dica in diretto cosa fare? (tralasciando il fatto che qualsiasi cosa dicessi c’era sempre qualcuno a ribattere).\nAbbassate un po’ la cresta perchè, pur avendo delle potenzialità, al momento ve la giocate solo coi gold e una squadra una attimo buona di platini vi asfalta.","replies":[{"poster":"ArN STΛB","date":"2019-05-02T12:51:00.288+0000","up_votes":4,"down_votes":0,"body":"Intanto se sai che il torneo, che facciamo da diverse settimane, inizia ad un orario fisso e ti presenti durante la champ select direi che non ti puoi permettere di esprimere un opinione su i nostri pick e la nostra champ select. Non hai idea di cosa giochiamo, non hai idea di cosa giocano loro, non hai idea neanche tu di cosa potremmo giocare visto che non ti sei preparato un come e non conosci neanche i tuoi player. Abbia l umiltà di stare in silenzio e organizzare il game successivo, visto che se una persona arriva all ultimo secondo non sarà mai nel mood dei player che stavano già nella mentalità di giocare. Hai parlato di \"ogni volta\" io di queste \"ogni volta\" ti ho visto 3 volte e non tutti i giorni che ci allenavamo quindi direi che sono state poche volte.\nPenso che un coach debba seguire un team e avere Umiltà di \"abdicarlo\" in caso non sia al suo livello.\n\nE comunque parlo per me, io sono stato anche in lega seconda e ho girato molto team e non so chi tu sia, quindi evita di commentare il post perché sei abbastanza ridicolo, come persona e come coach","replies":[{"poster":"Unlucky Cuchu","date":"2019-05-02T13:13:11.241+0000","up_votes":1,"down_votes":3,"body":"ormai pure mia zia dice di essere stata in lega seconda ahahah In ogni caso ho detto “molti di voi”, forse andava ribadito 2-3 volte\n A parte questo, i tuoi capitani sapevano benissimo che io avevo certi orari, che non ci sarei stato sempre e che sicuramente non vi avrei guardato giocare flex. Poi se erano troppo occupati a mandarvi rane sul gruppo invece che dirvelo, questo non lo so. \nSul fatto che non conoscevo i vostri champ. Ho ancora il file con alcuni dei vostri champ, almeno quelli dei player a cui sono riuscito (perchè guai ad organizzarvi voi e fare una cosa unica, troppo seri) a chiederlo. \nCome si organizzano sti game se non mi passate gli op.gg? Ripeto, 5 minuti prima non si può preparare una draft. Gli op.gg li manda chi li ha, a rigor di logica. \nSul fatto di essere uscito di non essere al vostro livello ahaha, confermi quanto ho detto: Vi credete un team buono ma non sapete nemmeno quando e come swappare una lane. \nIo sto ribattendo CON FATTI alle stronzate che dite 3 contro 1, tu che cos’hai detto? 2 stronzate campate per aria. Ridicoli siete voi che cercate coach esperti GRATIS per un team palesemente agli inizi.","replies":[]}]}]}]},{"poster":"OG Giacomonzi","date":"2019-05-01T20:20:31.812+0000","up_votes":4,"down_votes":0,"body":"Allora, da dove cominciare?\nPersona priva di emozioni o personalità che solo a sentirne la voce ti sale la depressione, in 1 mese si è fatto vivo si o no 3 volte senza concludere nulla, abbiamo visto solo un replay dove ci hanno stompato e non ci hai detto praticamente nulla tranne del fatto che, guarda caso abbiamo perso.\nPresenza su un torneo europeo anche abbastanza importante: inesistente, ogni partita dovevamo guardarci gli op.gg crearci una comp e decidere cosa bannare.\nUnica presenza su partita di torneo dove essendo contro un team di master-challenger ha detto semplicemente: bannate champ che danno fastidio ad irelia e, dopo che gli avversari la hanno presa se ne è uscito dal discord e ha tagliato ogni contatto con noi.\nNon credo serva aggiungere altro.","replies":[{"poster":"Unlucky Cuchu","date":"2019-05-02T08:36:55.782+0000","up_votes":1,"down_votes":3,"body":"in un mese? Ma se sono entrato tipo il 22 aprile ahahah Come jungler non eri granchè, ma pensavo che almeno sapessi contare.","replies":[{"poster":"OG Giacomonzi","date":"2019-05-02T10:50:54.502+0000","up_votes":3,"down_votes":0,"body":"non sono un granchè, ok ma un coach che pensa il \"se sei forte sali\" sia una minchiata sei da ricovero","replies":[{"poster":"Unlucky Cuchu","date":"2019-05-02T11:05:04.876+0000","up_votes":1,"down_votes":3,"body":"Ah allora anche a leggere l’italiano facciamo fatica... Mi sa che alle elementari qualcuno mangiava un po’ troppa colla","replies":[{"poster":"OG GodKench","date":"2019-05-02T12:08:47.552+0000","up_votes":3,"down_votes":0,"body":"Non sai fare il coach, non hai idea dei champ più usati dal  team (non essendo mai presente ad allenamenti o tornei), le uniche partite fatte ci siamo fidati di te, nonostante le pessime comp e gli inesistenti consigli su come giocarle. Datti all'ippica grazie.","replies":[{"poster":"Unlucky Cuchu","date":"2019-05-02T12:11:33.007+0000","up_votes":1,"down_votes":2,"body":"Proprio tu ti sei fidato ahahahahahahah Eri il primo ad avere da ridire su ogni cosa. Che champ conosco o non conosco? Come fai a saperlo proprio tu che alla domanda “quali sono i tuoi champ migliori” hai risposto “li gioco tutti”??? ahaha abbiamo il faker di aspromonte qui{{sticker:sg-miss-fortune}}\n\nps: Ah riguardo a ste comp tutte pessime. L’unica comp che sono riuscito a farvi per intera (perchè per le altre sorgevano contestazioni varie o “non ho sentito scusa”) è per i sub nella vostra scrim interna, ed uno di voi che è arrivato tardi si è pure complimentato senza sapere che l’avevo fatta io. Di che stiamo parlando? Se A TE non andava bene, le palle di dirmelo in faccia non le avevi?","replies":[{"poster":"ArN STΛB","date":"2019-05-02T12:58:18.346+0000","up_votes":2,"down_votes":0,"body":"Beh parlare di palle quando una persona è uscita senza dire niente in mezzo ad un torneo non è ti appartiene proprio","replies":[{"poster":"Unlucky Cuchu","date":"2019-05-02T13:15:28.510+0000","up_votes":1,"down_votes":2,"body":"Eh cavolo avete pure rescisso il contratto a kkOma per me :( chi vi seguirà adesso poverini :’(","replies":[{"poster":"ArN STΛB","date":"2019-05-02T18:36:23.257+0000","up_votes":1,"down_votes":0,"body":"la cosa che mi stupisce è che nessuno ti ha citato, nessuno ti ha insultato e tu non hai niente di meglio da fare che continuare a commentare con commenti stupidi. Noi stiamo cercando un coach e tu che centri qui dentro? Chi sei per chiamare gli altri un team di principianti? Se hai qualcosa da dire vieni su discord che ne parliamo a voce, non ha senso commentare un post e spalare m***** sulla gente visto che non mi sembra che il post fosse riferito a te (anche per chè si parla di coach). Se vuoi andare a coachare un altro team fatti un post e divertiti li ma non rompere sui nostri che non abbiamo tempo da perdere","replies":[{"poster":"Unlucky Cuchu","date":"2019-05-02T19:19:14.824+0000","up_votes":1,"down_votes":3,"body":"No, la gente deve sapere mi dispiace.  accontentati dei -1 e +1 che potete mettervi a vicenda, per il resto io commento dove voglio e come voglio","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Josuah Flint","date":"2019-05-03T10:58:57.308+0000","up_votes":2,"down_votes":0,"body":"Consigliato","replies":[]},{"poster":"Coach Platy","date":"2019-04-30T20:32:08.667+0000","up_votes":2,"down_votes":1,"body":"E niente","replies":[]},{"poster":"V for Oliver","date":"2019-05-02T15:17:49.293+0000","up_votes":1,"down_votes":0,"body":"E poi c'è pure chi si stupisce se l'esport in Italia è ancora al paleolitico in confronto ad altre realtà europee...","replies":[]}]}