{"poster":"LPU Salvation","date":"2019-06-27T13:57:37.777+0000","title":"Játékmódok","subforum":"Minden egyéb","up_votes":5,"down_votes":1,"body":"Lehet hogy most nagy durranás ez a taktikus csapatharc, személy szerint nekem nagyon nem tetszik és nem látok benne semmit de ez saját vélemyény!\r\nNem új játékmódot kéne behozni, hanem a régiket is kellene látni. Személyes kedvencem volt a felemelkedés, vérhold. One For all, védő támadó és stb. Ezeket remélem még látjuk majd az életben és hiányolom nagyon.","replies":[{"poster":"PowerPein","date":"2019-06-27T15:36:31.387+0000","up_votes":2,"down_votes":1,"body":"Ezaz új játék mód vmi iszonyatos katasztrófa lett sztem. Semmi élvezet nincs benne. {{sticker:slayer-jinx-unamused}} Az eventes módok sokkal jobbak voltak. Aztán persze, hogy az ilyen stílus terjed, mert itt nem kell annyit gondolkodni, meg nincs szükség a reflexekre meg az ügyességre se...","replies":[{"poster":"Shikaichi","date":"2019-06-27T15:41:23.763+0000","up_votes":1,"down_votes":0,"body":"Itt a taktika érvényesül jobban, ami ugye eddig inkább csapat szinten jött elő a játékban, egyéniként meg max a tárgyválasztásban.","replies":[{"poster":"ScreamForMeBaby","date":"2019-06-28T07:29:38.810+0000","up_votes":3,"down_votes":0,"body":"Hát amennyire lelkesen vártam ezt, akkora csalódás lett.\n\nMilyen taktikát igényel pontosan? \n\nRandom tényezők a következők:\n- Milyen hősöket kapsz\n- Milyen itemeket kapsz\n- Kit támadnak a hőseid\n\n\n\nPontosan milyen taktikai elemek azok amik nem az rng-n múlnak? Kb közöd sincs a meccshez, csak kockával dobálsz. Aki jobbakat dob, az nyert...","replies":[{"poster":"Shikaichi","date":"2019-06-28T10:42:38.646+0000","up_votes":1,"down_votes":0,"body":"Hogyan költöd el a pénzed? Fejlődni szeretnél vagy inkább pörgetsz új hősöket? Milyen csapatkompozíciót alakítasz ki? A Vad kettőse bónuszát vagy inkább a Yordle triót szeretnéd? A kapott tárgyaid kikre teszed rá, hogyan kombinálod őket? \nCsak, hogy párat említsek.\nPersze van RNG, melyik játékból lehet ezt teljesen kizárni? De itt például szerintem eléggé kiszámítható lenne a játék nélküle. Gondolj bele, ha tudnád, hogy milyen hősöket fogsz kapni, akkor hol maradna az izgalom?\nÉn inkább azt rónám fel a játéknak, hogy minden eleme egy létező, másik kisebb játékból lett összeollózva.","replies":[{"poster":"Gresident","date":"2019-06-28T11:04:01.306+0000","up_votes":2,"down_votes":0,"body":"Taktikai játék... \"persze van RNG\" \n\ncsak RNG van... nem tudod irányítani a hősöket, a hősök éppen akkor használják a képességüket, amikor nekik tetszik (ha használják egyáltalán), a hősök többnyire azt támadják aki nekik tetszik, majdnem az összes hős pozíciója teljesen mindegy.\n\nAz RNGnek köszönhetően a legszarabb kezdésnek köszönhetően is nyerhetsz, úgy, hogy 1 pontod van és utolsó vagy, és persze veszíthetsz úgy is, hogy az egész játék alatt 100pontod van, majd valami módon az utolsó ellenféllel szemben, akinek már alig van pontja, 5-7 meccs alatt leveri rólad az összes pontot.\n\nEzt a játék módot egy óvodás is megnyerheti... nem kell hozzá semmi taktika, \"ismerd fel az egyforma hősöket\", és ha mákod van 9ből összejön a 3csillagos, amikor körből választhatsz hőst, akkor nem egyedi eset, hogy a hős olyan tárgyat kap, ami nem illik rá, pl egy {{champion:555}} {{item:1058}} .","replies":[{"poster":"Shikaichi","date":"2019-06-28T11:26:53.439+0000","up_votes":1,"down_votes":0,"body":"Mondjuk az valóban zavaró, hogy sok képesség úgy megy el, hogy sehogy és nem tudod irányítani a karaktereid. A full életerőset öli a kicsi helyett. De elég gyerekcipőben jár még az egész, később jó lenne alakítani ezen.","replies":[]}]},{"poster":"ScreamForMeBaby","date":"2019-06-28T17:18:02.222+0000","up_votes":1,"down_votes":0,"body":"1. Hogyan költöd el a pénzed? Sehogy. Exp-t veszel belőle 90%-ban, újrapörgetni kvázi hülyeség, mert egyre erősebb hősöket lehet venni ahogy nő a szinted. Próbálsz ugyanolyan hősöket venni ugyan, hogy összegyűljön a 3. De mire összegyűjtöd, addigra értéktelen lesz kvázi. \n\n2. A kapott tárgyaimat nem igazán lehet variálni, a dmg dealerre kell pakolni mindent, bármit is kapsz. Minden más kontraproduktiv. Az meg végképp full lutri, hogy milyen tárgyakat kapsz. Például ha te könnycseppet kaptál, az enemy meg nagy kardot, akkor nyugodtan fel is adhatod. \n\n3. Nem tudsz variálni azon, hogy most vad bónuszt akarsz, vagy Yordle-t. Mert random kapod a hősöket. Volt egy meccsem ahol az aranyam 90%-t elpörgettem egy \"erdőkerülőért\", de nem jött össze. Full lutri az egész. Vagy összejön, vagy nem. Ez nem taktika, hanem \"itt a piros - hol a piros\". Nem a ravaszságodon múlik, hanem a vak szerencsén.\n\n\nKábé annyi taktika van benne, mint hogy egy kockadobás esetén balról dobsz, jobbról, vagy esetleg csak megnyalod a szomszédod mellbimbóját (hátha szerencsét hoz) és függőlegesen felfele hajítod a kockákat. Lehet ezen taktikázni, csak erősen megkérdőjelezhető az értelme.","replies":[]}]},{"poster":"Gresident","date":"2019-06-28T08:34:31.032+0000","up_votes":1,"down_votes":0,"body":"Nah jah... az egész meccsen folyamatosan nyertem végig, aztán az utolsó ellenfél ellen, akitől jobb hőseim voltak (3db maxos ezek közt legendás hősök) az utolsó 4 meccsen úgy kaptam ki, hogy 9 v 8ban mind a négy meccsen maradt legalább 6 ellenfelem. Fos az egész, és még pontot sem kapsz érte. Kuka mód, de legalább lehet megint mire RP-t költeni!\n\nTaktika/stratégia nulla a játékban!","replies":[]}]}]},{"poster":"Jack Eron","date":"2019-06-28T06:49:42.990+0000","up_votes":3,"down_votes":0,"body":"Azért kicsit érdekes hogy ezt éppen te hozod fel, te vagy az only aram srác, nem? :D Ha te csak azzal játszol, akkor nem értem, miért fáj, hogy itt nem kell gondolkodni és nincs szükség ügyességre meg reflexekre (ami amúgy nem igaz), hiszen te kizárólag egy szerencsére épülő kiszámíthatatlan funmódban élsz, ahol azt se döntöd el, hogy mivel játszol, ahogy a csapatod sem, és bannolni sem tudtok, ráadásul mindenki egy lanen tolja :D","replies":[{"poster":"PowerPein","date":"2019-06-28T14:09:13.953+0000","up_votes":1,"down_votes":0,"body":"Off: Igazából a múltkor is csak példaként hoztam fel az aram módot, hogy mit tapasztaltam ott és egyből le lettem hurrogva. A szövegértéssel vannak gondok. ui.: sztem aramban többet számít a gyors gondolkodás és reagálás mint ebben az új módban. Ez az én véleményem, de tisztában vagyok vele, hogy a vélemény olyan mint a az alfélen elhelyezkedő lyuk (így kellett megfogalmaznom, mert az eredeti egy szót azt cenzúrázza a rendszer, pedig nem is káromkodás, meg egy testnyílásról van szó): mindenkinek van, csak senki nem kíváncsi a másikéra {{sticker:sg-ahri-2}} \nUii.: \"only aram srác\"-> ti (a többi játékos) neveztetek el annak, mert az már nem esett le senkinek, hogy arról tudok írni a legtöbbet, amivel a legtöbbet játszok... (ha most a LoLon kívül más dolog jutott eszedbe akkor bonts ki még egy sört {{sticker:slayer-pantheon-popcorn}} )\n\nVálasz a témára: igazából én sose szerettem az ilyen fajta stratégiai játékot, ahol előre beállítasz mindent és utána csak nézed és közben látod, hogy mit lehetett volna jobban tenni. Kíváncsi voltam, hogy mit hoztak ki és miért is írják, hogy egyre jobban terjed ez a fajta játékmód. \nHa RTS változat lenne az jobb lenne (mondjuk van 5 hősöd, ők döntik el mikor aktiválják a képességet, de te tudod irányítani pl). Itt meg elég nagy része a szerencsén múlik.","replies":[{"poster":"ScreamForMeBaby","date":"2019-06-28T17:54:12.096+0000","up_votes":1,"down_votes":0,"body":"1. Nem tudom miért esett neked Jack, szóval nem a kettőtök dolgába akarok beleszólni.\n\n2. Azért azt ne hangoztassuk, hogy ARAM-on gondolkodni kell, vagy reagálni... :) Az egy full fun mód, ahol csak spammeled a képességeid és bármilyen itemet vehetsz bármilyen hősre, csak a képességeiddel kell betalálni.","replies":[{"poster":"Jack Eron","date":"2019-06-29T19:10:42.323+0000","up_votes":1,"down_votes":0,"body":"Screamnek :Nem estem neki, csak láttam már egy másik téma alatt régebben, és feltűnt az ellentmondás, arra kérdeztem rá. \n\nEgyébként még annyi, hogy ahogy ő is írta, az aram tényleg egy logikátlan funmode. \n\nDrafton van lehetőséges lane tradelni a társaiddal, szándékosan pickelhetsz countert az ellenfeledre, bannolhatod az ocsmány champeket, stb - már a választásod után is jó néhány módod lesz rá, változtass a stílusodon, de ott, ahol már a saját hősödet is érmefeldobás alapján kapod, na arra hogy építesz fel stratégiát? :D Hisz nem tudod, mit fogsz kapni. A csapattársaiddal sem építhetsz ki semmit, hiszen az ő hősük is random lesz, aztán ha van egy full ranged enemy akkor csinálhattok amit akartok és 99% lose lesz akkor is...","replies":[]}]}]}]}]},{"poster":"Dont Pick Janna","date":"2019-06-29T19:03:37.092+0000","up_votes":1,"down_votes":0,"body":"Mivel ez egy ingyenes játék, így valahonnan kell a bevétel és míg egy one for all-hoz nem nagyon tudnak plusz tartalmat gyártani amit megvehetsz addig egy ilyen játékmód ahol az \"avatarod\" -ra és a pályára is vehetsz kinézetet egyszerűen jobban megéri és most, hogy elég népszerű ez a falyta játék, így ez sokkal jobban megéri mint visszahozni egy régebbi játékmódot. Nekem a hexa kill is hiányzik :(","replies":[]},{"poster":"Gresident","date":"2019-06-27T17:36:09.446+0000","up_votes":1,"down_votes":0,"body":"Mondok egy érdekes dolgot \" 0 itemmel bedobsz 4garent azt nyertél \"... \nlehet ezért is nem érhető el?\n\nSzerintem a legjobb játék mód az Odüsszea volt, végre elvolt törölve a \"rang\",  meg a másik szörnyes pálya.","replies":[]},{"poster":"ScreamForMeBaby","date":"2019-06-27T16:11:57.467+0000","up_votes":1,"down_votes":1,"body":"A folyamatos játékosszám-csökkenés miatt nem lehet több játékmódot futtatni egyszerre. Így sem tud már 10 embert összesorsolni a matchmaking normálisan. Az, hogy most ez a játékmód került be, nekem spec tetszik, én imádom a stratégiai játékokat és ahol az agyamat kell használni. 1-2 hónap és majd beraknak valami mást is.","replies":[]}]}