{"poster":"XIII Vanitas","date":"2016-06-19T23:54:12.308+0000","title":"FEELSGOODMAN","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"Mi va di condividere con voi una piccola storiella che mi &egrave; appena capitata.\n\nStavo facendo ARAM per ottenere l&#039;ultimo frammento di chiave che mi serviva per aprire un forziere.\nIn squadra mi trovo un {{champion:24}} con {{summoner:6}} e {{summoner:1}} che all&#039;inizio della partita si tuffa per 4 volte in mezzo al team nemico, con il chiaro intento di trollare.\nFortunatamente lo convinciamo a smettere, ma ormai il danno &egrave; fatto: perdiamo una torre, siamo indietro di 7 kill e i nemici iniziano a fare i bm per tiltarci. {{champion:157}} continua a spammare la maestria e {{champion:61}} la risata, intanto che scrive &quot;rekt&quot; in all chat.\nNoi rimaniamo calmi: il nostro team scala meglio del loro in mid game ed &egrave; solo una questione di tempo prima che i nemici si prendano tutte le legnate che si meritano.\nRaggiungiamo quindi la nostra powerspike e li ingaggiamo: vengono devastati. Stranamente, Yasuo non mostra pi&ugrave; la sua maestria e Orianna non dice una parola.\nDopo aver fatto un altro ace, arriviamo al nexus nemico e la {{champion:51}} nemica scrive in all chat &quot;only noobs would finish&quot;.\n\nFu cos&igrave; che i &quot;noobs&quot; vinsero e io ottenni il frammento di chiave, mentre i nemici rimasero nella lobby di fine partita a insultarsi a vicenda e lamentarsi dei team sbilanciati dell'ARAM.\n\nP.S.: se vi interessa saperlo, le squadre erano {{champion:24}} {{champion:432}} {{champion:8}} {{champion:131}} {{champion:59}} contro {{champion:51}} {{champion:55}} {{champion:157}} {{champion:61}} {{champion:69}}.","replies":[{"poster":"RayIsBack","date":"2016-06-20T08:00:58.173+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Frattaglia","date":"2016-06-20T09:40:14.720+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Raylone,realm=EUW,application-id=MJVj50Jw,discussion-id=uB3AwkG6,comment-id=0002,timestamp=2016-06-20T08:00:58.173+0000)\n>\n> ecco perchè la all chat la tolgo, nessuno ormai la usa più per dire qualcosa di serio ma solo per insultare o sfottere, già lo spam della risata e la mastery vengono usate in quel modo, figurati se tengo la all chat attiva, piuttosto che sapere che ho contro un troglodita (KAPPA) preferisco evitare di rovinarmi l&#x27;entusiasmo mentre gioco\n\nMah, qualche volta trovi anche gente simpatica... tipo l'altro giorno mi sono fatta parecchie risate perché giocavo Singed contro Volibear e continuavamo a flipparci a vicenda contemporaneamente e a farci grasse risate :)\nPerò poi al secondo spam di maestria li muto u_u Mi fan tiltare e basta","replies":[]}]},{"poster":"Skydago","date":"2016-06-20T08:22:55.377+0000","up_votes":1,"down_votes":0,"body":"Io avrei scritto \"GG izi rekt\" in chat, così per farli rosikkare.","replies":[]},{"poster":"wellyT93","date":"2016-06-20T00:54:56.077+0000","up_votes":1,"down_votes":0,"body":"Spero tu abbia scritto a fine game \"gg ez\", sennò ti reporto.","replies":[]},{"poster":"Darki200","date":"2016-06-20T00:29:05.014+0000","up_votes":1,"down_votes":0,"body":"Rekt","replies":[]}]}