{"poster":"YoGGuex","date":"2015-06-04T00:01:12.730+0000","title":"¿Que opinan de los Multilineas?","subforum":"Charlas Generales","up_votes":1,"down_votes":4,"body":"Hola.\r\n Ultimamente not&eacute; que se esta empezando a usar una nueva posicion, multilineas. Jug&eacute; como 8 partidas con un multilineas en el equipo, y rinde mucho (Obviamente si se lo sabe usar).\r\nPara empezar, &iquest;Que es un multilineas?\r\nComo el nombre dice, es un jugador que se pasea por todo el mapa, pero no como jungla. Farmea en alguna linea, y esta moviendose constantemente, haciendo ganks, ayudando a tirar torres, etc... Se suelen usar asesinos, mas que nada por su gran movilidad, y su capacidad de hacer mucho da&ntilde;o en poco tiempo. Algunos ejemplos son:\r\nKatarina{{champion:55}} \r\nMaestro Yi{{champion:11}} \r\nAkali{{champion:84}} \r\nEntre otros...\r\n\r\nHace algunos dias, (u horas, no me fije bien) Riot public&oacute; un post hablando del Meta, si no saben lo que es les recomiendo pasarse por ese post que lo explican muy bien. El meta lo hace la comunidad, y en ningun lado dice que tiene que ir un top, un mid, dos bot y un jungla... Asi que pens&eacute; bastante y creo que si se hace muy popular, multilineas podria ser una posicion nueva, aunque riot no lo agregara en el juego, obviamente sacando el jungla.\r\nNo puedo asegurarles que un multilineas sea mejor que un jungla, ya que este quita farm de otras lineas, pero imaginense lo siguiente. Una katarina, que ande por todo el mapa, matando a todo lo que se le cruze, rompiendo torres, gankeando, seria muy OP. \r\n\r\nDespues de escribir todo esto, llega la parte en la que ustedes comentan. &iquest;Multilineas tendr&iacute;a potencial? Si creen que si, &iquest;Como conformarian las posiciones de su equipo?\r\nYo en el caso de usar multilineas en el equipo, usaria 1 top, 1 mid, 2 bot, y suplantar&iacute;a el JG por un Multilineas...\r\n\r\nSaludos!","replies":[{"poster":"rokushoger","date":"2015-06-04T17:38:11.820+0000","up_votes":1,"down_votes":0,"body":"Muy tentadora la idea de la katarina que anda por ahí matando, si no fuera por el pequeño obstáculo que al farmear poco de cada línea va a estar en bajo nivel, va a tener mucho menos items, y por ende cuando llegue a donde quiera gankear va a ser un gigantes saco de oro para el heroe enemigo. Así que por mí la respuesta es no, no rinde.","replies":[]},{"poster":"l BlackWidow","date":"2015-06-04T04:45:08.514+0000","up_votes":1,"down_votes":0,"body":"Yo pense que multilinea era uno que usaba 3 lanes , onda por ej sion supp jg top.","replies":[]},{"poster":"Runth","date":"2015-06-04T01:27:57.996+0000","up_votes":1,"down_votes":0,"body":"Multilineas?!!! omg Mejor queria decir Roaming, o rotar la linea\n\nMe quede sorprendido :o","replies":[]},{"poster":"potato support","date":"2015-06-04T00:41:24.092+0000","up_votes":1,"down_votes":0,"body":"se llama hacer \"roaming\", buscalo en internet.\n\nnormalmente es hecho por el mid/support. por la facilidad/poisicon que ocupan en el mapa.\n\n\"sacar\" al jungla no tiene sentido porque, si no pensas hacer los camps, no tenes levels, si queres agarrar los creeps de la linea, le sacas experiencia al resto sacandole el oro y lo rapido que subiran los levels y que se compran los items, sacando el impacto que tienen ellos. \n\nLa cantidad de presion que metes en el mapa es muy inferior porque no tenes los levels ni el oro para poder tener un impacto en el juego.\nSin contar que le estas dando una increible cantidad de presion al jungla enemigo, regalandole buffs, control de vision, control de objetivos.\n\n\nusemos tu ejemplo de katarina.\n\nlvl 1, donde se para?\nen una lane acompaniando\n>0 presion, le estas dando informacion al equipo contrario, le estas dando oro gratis al jungla enemigo,\n\nhaciendo jungla?\nkatarina tiene muchisimos problemas para limpiar la jungla early, le hacen couter jg y muere lvl 1. no tiene el oro para comprarse los items que necesita para poder tener impacto.","replies":[]},{"poster":"J0CS4N","date":"2015-06-04T00:40:42.642+0000","up_votes":1,"down_votes":0,"body":"Eso es Normal en las Competencias Profesionales... Es como un jungla mas pero normalmente en el Support que wardea, Invade y Gankea. De hecho así es como debiera jugarse. El concepto de tener al Support amarrado en Bot en cosa de la gente nueva.\nTambién es normal  que gankee el mid a top o bot, También se juega Off bot con solamente 1 o tri bot o tri top o off top... Eso debería ser lo normal. \"El factor sorpresa\".\n\nEstos modod de juego agresivos son originarios de juegos Brigidos como el Dota2 donde se juega asi y el Support esta en todas las lineas y gankea y wardea siendo un real support y minutos despues puedes ver 3 o 4 en una sola linea y los modos de juegos antes nombrados. Formas de juego que jugadores de Dota 2 exportaron  al LOL  cuando lo juegan.\n\nMira este video con tiempo y mira como prácticamente el support parece jungla y el ADC es capaz de cuidarse solo que debiera ser lo lógico.\n\n\nhttps://www.youtube.com/watch?v=2NPTpB_4ngo\n\nSaludos!\n\n{{champion:83}} {{champion:96}} {{champion:40}} {{champion:26}}","replies":[]}]}