{"poster":"YoGGuex","date":"2015-10-01T18:11:32.287+0000","title":"Yorick? Qué es eso? Se come?","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Hola, gente que me lee. Mas espec&iacute;ficamente, si llega a ser el caso, Rioters. &iquest;QUE ONDA CON YORICK?.\r\nS&eacute; porque no se usa, en TF no aporta, solo funciona en early. Entre otras cosas, esa son unas de las razones de que Yorick sea una fantasma :V\r\nPero... Que piensa Riot? Vamos a ponernos serios. En el juego hay un personaje mas olvidado que la 1ra muerte de Krilin, que mas de la mitad no conoce o solo escuch&oacute; hablar de &eacute;l, y que el otro % de las personas que lo jugaron en serio, no lo recomiendan. De parte de Riot, tiene solo 2 skins mas viejas que Mirtha Legrand, y hace mucho que no lo nombran en las actualizaciones. \r\nQuiz&aacute;s este mal redactado el post, soy muy malo en esto, pero mi intenci&oacute;n es pedir que antes de hacerle un Rework visual a Shen, o un Medio-Rework a Skarner y Mordekaiser, hagan un Rework a Yorick. O por lo menos, lo pongan en alguna rotaci&oacute;n semanal  :V\r\n{{champion:83}}\r\n {{item:3070}}","replies":[{"poster":"ALEXKOND","date":"2015-10-01T19:12:31.187+0000","up_votes":1,"down_votes":0,"body":"Rojo 1: \"¿Escuchaste algo?\"\nRojo 2: \"Mmm... Debe ser el viento\"\n\n{{item:3070}}{{champion:83}}{{item:3070}}\n\nLamentablemente Yorick tiene para un rato más de olvido, teniendo en cuenta que Poppy, Taric y el rework a los ADC están antes que él, mínimo hasta principios - mediados de 2016 va a quedar igual.","replies":[{"poster":"Ruphian","date":"2015-10-01T23:02:22.513+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ALEXKOND,realm=LAS,application-id=v7qsfXsE,discussion-id=TjuAvctT,comment-id=0000,timestamp=2015-10-01T19:12:31.187+0000)\n>\n> Rojo 1: \"¿Escuchaste algo?\"\n> Rojo 2: \"Mmm... Debe ser el viento\"\n> \n> {{item:3070}}{{champion:83}}{{item:3070}}\n> \n> Lamentablemente Yorick tiene para un rato más de olvido, teniendo en cuenta que Poppy, Taric y el rework a los ADC están antes que él, mínimo hasta principios - mediados de 2016 va a quedar igual.\n\nRework a los adc? donde averiguo mas? en la pagina de soporte no dice nada de eso, rework 1x1 o a la jugabilidad gral.?","replies":[{"poster":"ALEXKOND","date":"2015-10-02T00:12:33.987+0000","up_votes":1,"down_votes":0,"body":"Es un rework general como hicieron con los Colosos. Dijeron que algunos van a recibir más importantes mientras que otros simplemente un balance pero nada especifico. \n\nEn el enlace podes ver que esta anunciado.\nhttps://support.riotgames.com/hc/en-us/articles/202294884-Champion-Update-Schedule","replies":[{"poster":"Dyaebl","date":"2015-10-02T03:06:15.304+0000","up_votes":1,"down_votes":0,"body":"Es un rework casi en escala del de la jungla creo q habian dicho","replies":[{"poster":"ALEXKOND","date":"2015-10-02T03:57:24.715+0000","up_votes":1,"down_votes":0,"body":"Sería más o menos la misma cosa ya que implica cambios a campeones del rol como posibles nuevos objetos.","replies":[]}]}]}]}]},{"poster":"Dyaebl","date":"2015-10-02T03:04:15.903+0000","up_votes":1,"down_votes":0,"body":"Segun un rioter el proximo rework de un campeon solo va a ser de poppy a finales de este año, taric a principios de season y yorick antes de la mitad de la season\n\nAntes del de poppy sacan la preseason con reworks de adc","replies":[]},{"poster":"Sir Crucifix ","date":"2015-10-01T19:20:52.362+0000","up_votes":1,"down_votes":0,"body":"es un tanque ap ad asesino , y muchos se preguntan , como lo buildeo ? xDDD , ahora lo uso y subo una imagen","replies":[{"poster":"Platinum491","date":"2015-10-01T23:46:26.896+0000","up_votes":1,"down_votes":0,"body":"No seria AD offtank? puesto que solo la w creo que escala con ap, lo otro escala ad y una escala ad y tiene daño ap,","replies":[]}]},{"poster":"MatiLee","date":"2015-10-01T20:17:58.172+0000","up_votes":1,"down_votes":0,"body":"Tengo maestría 5 con Yorick. Con esto te quiero decir que tengo muchos argumentos y cosas lindas para decirte sobre él.\n\nA pesar de que los pocos que lo usan lo hacen en top, yo lo uso en un 90% de los casos en la jungla. ¡Cuando llega Yorick corran lo mas lejos posible!\n\nRespecto a su build, hay varias, y todo depende de la composición de tu team, y de la del team oponente.\nSe lo puede armar tanque, lo cual aumenta la vida de sus espectros.\nSe lo puede armar luchador, cosa que va a darle mas oportunidades frente a una superioridad numerica.\nSe lo puede armar AP (aunque no lo recomiendo. Actualmente no es su momento para eso).\nO también, se lo puede armar para el splitpush (Hidra Voraz+Grebas de Berserker+Trinidad+Céfiro+Filo del infinito(se puede reemplazar por sanguinaria o saqueador).\n\nSea como sea que lo buildees, es obligación que compres {{item:3070}}  como primer item. Luego la mejoras a {{item:3004}} \n\n\n\nEn lo personal, creo que es un campeón que tiene mucho potencial esperando a ser explotado. Quienes dicen que no sirve, o que está desactualizado, o lo que sea, es porque no lo saben apreciar.\n\n\nAnte cualquier duda me consultas :)\n\nSaludos","replies":[]}]}