{"poster":"Donato Borget","date":"2019-01-07T16:18:12.630+0000","title":"Sion feeder es sancionable?","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Trata sobre ir full vida con sion farmeando y pusheando top como un enfermo (igual que tryndamere) con demolicion y zz riot, tirando torres, inis, hasta el nexo.\r\nLo malo es morir...","replies":[{"poster":"WhiteMax","date":"2019-01-07T19:45:08.627+0000","up_votes":2,"down_votes":0,"body":"Si ya que estas muriendo intencionalmente, lo que podes hacer es decirle a tu team que no te reporte y/o jugar con premade. O tambien sacar kills/asistencias para que el juego piense que participas y que no moris por malo.","replies":[]},{"poster":"Perturbado2","date":"2019-01-07T20:59:06.453+0000","up_votes":1,"down_votes":0,"body":"La cosa es simple si van ganando nadie reporta y si vas perdiendo y fedeaste mucho spamea cosas positivas en el chat, vamos team se puede, gj team. Y al final si alguien te flamea se va ir baneado el otro y no vos. La estrategia más simple para fedear tranquilo y sin miedo a ser reportado. Saludos y a fedear tranquilo.","replies":[]},{"poster":"StąrDust","date":"2019-01-07T17:41:02.500+0000","up_votes":1,"down_votes":0,"body":"Mira hubo algunos casos en donde usaron esta estrategia y fueron baneados. Lo ideal es preguntarle a tu equipo si podés usarlo o no, si dicen q si dale para adelante, y si dicen que no mejor no lo hagas, porque te van a reportar.","replies":[]},{"poster":"TheKiller Justin","date":"2019-01-07T16:30:45.584+0000","up_votes":1,"down_votes":0,"body":"Es discutible si es o no sancionable. Después de todo no deja de ser una estrategia más que, al menos en su momento (ahora no sé) resultaba, siendo totalmente válida porque busca ganar objetivos, no es suicidarse sin más, por lo que no hay una intención final de perjudicar partidas.\nSin embargo, si el equipo no está de acuerdo con esa estrategia pienso que sí puede ser sancionable.","replies":[{"poster":"bow down","date":"2019-01-07T16:38:35.894+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=TheKiller Justin,realm=LAS,application-id=v7qsfXsE,discussion-id=aUHrnxnP,comment-id=0000,timestamp=2019-01-07T16:30:45.584+0000)\n>\n> Es discutible si es o no sancionable. Después de todo no deja de ser una estrategia más que, al menos en su momento (ahora no sé) resultaba, siendo totalmente válida porque busca ganar objetivos, no es suicidarse sin más, por lo que no hay una intención final de perjudicar partidas.\n> Sin embargo, si el equipo no está de acuerdo con esa estrategia pienso que sí puede ser sancionable.\n\nLo que el equipo quiera no tiene nada que ver. Bajo esa lógica, si mi equipo no quiere que yo saque Yasuo en MID y lo uso, es troll? xd\n\nSion feeder no es sancionable porque el objetivo sigue siendo el mismo de los 4 jugadores del mismo team; Ganar.\n\nIgual, el inting Sion con los nerfs a Demolition y el nuevo sistema de bounties, es una pésima estrategia y estoy más que seguro de que ahora se usa como excusa para trollear","replies":[{"poster":"TheKiller Justin","date":"2019-01-07T16:53:10.792+0000","up_votes":1,"down_votes":0,"body":"Dije que pienso que puede ser sancionable porque es algo bastante delicado el tema del Inting Sion, fuera de los objetivos hay alguien del otro lado que saca alguna ventaja, y un equipo que no está de acuerdo con esa estrategia le va a hechar la culpa al top por cualquier cosa y no querer jugar en equipo (Por decidir hacer algo con lo que no estaban de acuerdo). Igual es relativo eso xd\nPersonalmente me parece bien que cada quien use una estrategia que sepa manejar y sea útil","replies":[]}]}]},{"poster":"Este No Es Zelos","date":"2019-01-07T16:51:21.109+0000","up_votes":1,"down_votes":0,"body":"Hola, espera, no leas comentarios a gusto,  funciona asi, toda táctica es aceptable siempre y cuando sea entendida y compartida por el equipo, para que se entienda:\n\nVas zed top, salis 1/9 pero le comentaste al equipo que ibas a defender todo lo posible, que estabas haciendo un esfuerzo y demás, no pasa nada, aunque te reporten de mala leche, ahora vas sion, no decis nada y aunque tu equipo te pida que no mueras seguís en nada, y encima no logras impacto creeme que puedes recibir ban.\n\nEs negarse a comunicarse con el equipo, jugar a perder y muerte intencional (que mas alla de la idea es muerte intencional) entonces es sancionable en ese caso.\n\nSaludos!","replies":[]},{"poster":"Esulc","date":"2019-01-07T16:44:40.018+0000","up_votes":1,"down_votes":0,"body":"No es sancionable pero ya paso de moda.","replies":[]},{"poster":"LCD Z1 Awesome","date":"2019-01-07T16:41:21.046+0000","up_votes":1,"down_votes":0,"body":"Nope","replies":[]},{"poster":"Phaedra","date":"2019-01-07T16:31:34.239+0000","up_votes":1,"down_votes":0,"body":"Lo que es baneable es jugar a perder (cosa que dudo baneen en algun momento ya que es indetectable por el sistema de bots). SI la estrategia inti sion se usa para ganar, por que seria reportable?","replies":[]}]}