{"poster":"Donato Borget","date":"2019-02-05T14:43:42.259+0000","title":"Razones para permabanear a Nasus en elos bajos.","subforum":"Charlas Generales","up_votes":5,"down_votes":0,"body":"El equipo normalmente tarda en cerrar la partida.\nEn early game muy pocas veces ayudan a impedir que nasus farmee con su Q.\nPocas veces detienen a Nasus en las TF.\nEn elos bajos normalmente no se sabe como frenarlo.\nEsas son mis razones para permabanearlo en ranks.","replies":[{"poster":"Deigex","date":"2019-02-06T00:01:24.906+0000","up_votes":1,"down_votes":0,"body":"Hasta casi diamond si me cruzo un nasus en top sale 0/8 de lane. Es tu culpa como toplaner si el tipo farmea no que el jg tuyo no te campee para que no farmee la q. La culpa es 100% tuya viendo que tu pick principal es sion, que no sabes zonearlo ni tengas wave management.\nNo es que tu equipo no sepa frenarlo,  vos no sabes como hacerlo tampoco.","replies":[{"poster":"DragonKI2","date":"2019-02-06T06:13:08.152+0000","up_votes":2,"down_votes":1,"body":"Aun haciendolo , a veces es un poco molesto ,Se quedan muy pasivos bajo torre y no le puedes echar de linea a menos que le juegues agresivo , arriesgándote a morir bajo su torre y  que su jg lo ayude :/","replies":[{"poster":"Deigex","date":"2019-02-06T06:19:53.119+0000","up_votes":1,"down_votes":0,"body":"freezeas la linea y no toca un minion.","replies":[]}]}]},{"poster":"Santinocz","date":"2019-02-06T14:54:58.278+0000","up_votes":1,"down_votes":0,"body":"Por estas razones pierdo rankeds,  me banean a mi nasus con 77% winrate y me obligan a sacar a un sion splitpusher que sea mas molesto que un trynda con heraldo y yorick juntos","replies":[]},{"poster":" I am Tyrant","date":"2019-02-05T17:26:39.341+0000","up_votes":1,"down_votes":0,"body":"Lo que tiene nasus en LowElo es q muchos cuando pierden su linea o vos la perdes, se van de la linea y dejan q nasus stackee, entonces bueno ahí se viene la masacre en texas xD","replies":[]},{"poster":" I am Tyrant","date":"2019-02-05T17:24:26.312+0000","up_votes":1,"down_votes":0,"body":"Yo me  hice un pentakill de la nada xD ni idea de q lo habían buffeado","replies":[]},{"poster":"SecretOperator","date":"2019-02-05T15:07:21.749+0000","up_votes":1,"down_votes":0,"body":"Por elos bajos te refieres a unranked donde no conocen la existencia de teemo, vayne u ornn?","replies":[]},{"poster":"TSF Cachafaier","date":"2019-02-05T14:56:50.421+0000","up_votes":1,"down_votes":0,"body":"Eso o spamearlo","replies":[]}]}