{"poster":"StillDragon","date":"2017-09-19T06:54:18.430+0000","title":"Motivation, Spielveralten, negativer Gedanke & FOKUS","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Guten Morgen liebe Community,\r\n\r\nich spiele so lange schon League und hab gut Erfahrung. Seit 5 Jahren ca. spiele ich auf den Niveau von \r\nPlatin-Diamond..ist okey f&uuml;r diese Zeit, JETZT ist es nun soweit das ich wieder los legen m&ouml;chte und ganz OBEN mit spielen will.\r\n\r\nWie Motiviert ihr euch? guckt ihr YT Videos?..\r\nWie verhaltet ihr euch, wenn das Team feedet?, habt ihr auch direkt den negativen Gedanken zu verlieren und versucht ihn zu unterdr&uuml;cken?\r\nWie bleibt ihr fokussiert? \r\n\r\nLG.\r\nStillDragon","replies":[{"poster":"Humpelstilzche","date":"2017-09-19T07:26:50.175+0000","up_votes":3,"down_votes":0,"body":"Für League motiviere ich mich eigentlich nie. Es ist nach wie vor ein Spiel, es hat einzig und allein den Zweck, Spaß zu machen, sollte also nie etwas sein wozu ich mich zwingen oder motivieren muss, das geht irgendwie am Sinn vorbei. \n\nGanz allgemein hilft aber bei sich selbst motivieren, das Ziel im Auge zu behalten. Was willst du und wie kommst du am effektivsten da hin?\n\n> Wie verhaltet ihr euch, wenn das Team feedet?\n\nIch gebe weiterhin mein bestes. Es ist nicht so, dass ich eine andere Wahl hätte. Diesen Umständen ist man eben einfach ausgesetzt und es macht keinen Sinn sich über Dinge aufzuregen über die man keine Kontrolle hat. Du schreist ja auch nicht den Regen an, sondern akzeptiest halt dass es regnet, auch wenn es dir nicht gefällt, weil du es sowieso nicht ändern kannst. \n\n> habt ihr auch direkt den negativen Gedanken zu verlieren und versucht ihn zu unterdrücken?\n\nSelten. Es kommt vor, dass mich Spiele sehr frustrieren, das ist aber meist dann der Fall, wenn ich mich über meine eigenen Fehler ärgere. Generell ist es wichtig derartige Gedanken für sich zu behalten, weil man sonst alle anderen auch nur noch mehr runterzieht und man das Match nur noch Schlimmer macht. Wichtig: Nach solchen Spielen auf jeden Fall eine kleine Pause einlegen!\n\n> Wie bleibt ihr fokussiert? \n\nKaffee. Und idealerweise auch viel Schlaf und Sport. Also ich persönlich. \nGanz generell gilt: Wenn du Höchstleistung bringen willst, trink viel (idealerweise Wasser oder Tee...oder wenigstens nicht Limo oder sowas), schlaf viel und gut, mach Sport und ernähre dich gesund. \nDas klingt jetzt alles wie Ratschläge von der Omi, sind aber alles Fakten die dazu neigen unterschätzt zu werden. Es gibt Gründe warum ProPlayer Ernährungspläne haben und Sport machen müssen.","replies":[{"poster":"KledRekt","date":"2017-09-19T09:33:34.647+0000","up_votes":1,"down_votes":0,"body":"Ich kann den ersten Absatz, so wie er da steht, vollkommen unterschreiben. Aber zeitgleich waren viele von uns mal ambitioniert Spieler, wollten auf Biegen und Brechen an die Spitze der Liga, daher verstehe ich auch den Fragesteller.\n\nAuch wenn LOL nur ein Spiel ist - es erfordert ein gewisses Maß an Reife, das zu erkennen. Wozu ein hoher Rank? Um mit einem Rahmen nach Seasonende vor seinen Freunden anzugeben? Um Fremden zu zeigen wie krass man mit seinem Platin 1 drauf ist? Alles schön und gut, aber wenn man keinen Spaß am Spiel hat und nur auf das Ziel hinarbeitet, wozu dann überhaupt spielen?\n\n_Der Weg ist das Ziel_\n\nAußerdem spielt man weitaus besser, wenn es einem Spaß macht.","replies":[{"poster":"StillDragon","date":"2017-09-19T09:47:40.419+0000","up_votes":1,"down_votes":0,"body":"Danke - **Der Weg ist das Ziel.**\nSpaß bringt es mir ja, sonst würde ich ja nicht zocken, sollte nicht so rüber kommen!\n\nGruß","replies":[]}]},{"poster":"StillDragon","date":"2017-09-19T07:38:29.543+0000","up_votes":1,"down_votes":0,"body":"Danke für die ausführliche Meinung!! \nKonnte definitiv etwas von deiner Meinung mit nehmen! \n\nSport und gute Ernährung sind mein Hobby und somit Lifestyle. Da gebe ich dir aufjedenfall Recht.\n{{sticker:slayer-pantheon-thumbs}} \n\nFreue mich weiterhin auf mehre Meinungen!","replies":[]}]},{"poster":"Durkheim ","date":"2017-09-19T22:56:37.907+0000","up_votes":1,"down_votes":0,"body":"{{champion:48}}","replies":[]},{"poster":"KorSett","date":"2017-09-19T08:56:59.703+0000","up_votes":1,"down_votes":0,"body":"Also ich spiele hauptsächlich aus Spaß, meine Meinung ist ähnlich wie die von Humpelstilzche. Jedoch spiele ich wenig Ranked, weil viele Leute einen viel zu großen Wert auf den Rang legen. Ich hab oft erlebt das Leute in meinem niedrigen Elo-Bereich dazu tendieren schnell toxic zu werden, das hängt denke ich damit zusammen, weil diese (meist Gold für die Belohnung) ein Ziel vor Augen haben, und nur gewinnen einen (realistisch) näher bringt. Das ist der Grund warum ich (wenn ich mal ranked spiele) den Chat weitestgehend ignoriere und nur auf ernst zu nehmende Calls reagiere. Hauptsächlich hat mich das jedoch dazu gebracht Normals zu spielen, weil ich es für quatsch halte jemand auf seinen Rang zu reduzieren oder zwanghaft seine Rankeds zu absolvieren. Versuch Spaß darin zu haben und lass dir von niemanden etwas erzählen. Spiele so wie dir es gefällt und wenn du nur zum gewinnen Spielst (mag ok sein, Ehrgeiz ist nicht falsch. Aber dein Team wird deutlich schlechter Spielen wenn man das verlieren nicht mit einem lächeln akzeptieren kann).\n\nVersuch am besten herauszufinden weswegen du nach Motivation suchst, bist du durch deine Mitspieler gefrustet oder durch deinen eigenen Spielstil? Versuche keinen Frust aufzubauen wenn eine Gegner außer Kontrolle gerät, du lernst das Spiel tausendmal besser wenn du behind bist, weil dann deine Entscheidungen härtere Konsequenzen haben. \nAlso fokussiere dich nicht auf die Niederlage, sondern analysiere welche Entscheidungen dazu führen könnten das Spiel in die andere Richtung zu lenken.\n\nSilver-Scrub out\n\nLG Sauerbraten","replies":[{"poster":"StillDragon","date":"2017-09-19T09:53:27.570+0000","up_votes":1,"down_votes":0,"body":"Toller Beitrag !\n\nIch konnte aufjedenfall wieder etwas mit nehmen! Manchmal brauch ich halt ein tritt im Arsch ..\n\nSpaß haben.. das Stichwort.** Spaß am Verlieren** habe ich selten.. das ist mein erstes Ziel zu verbessern, falls ich Ranked verlieren sollte. Danke!","replies":[]}]}]}