{"poster":"Nuke","date":"2018-10-14T00:23:33.464+0000","title":"Me hierve la sangre, ¿Cómo quito esta configuración cancerosa? :/","subforum":"Problemas Técnicos","up_votes":6,"down_votes":1,"body":"No se que configuracion adapto mi teclado como para apagar con la tecla windows, que al darle al siete me salga 67 o al querer wardear con el 3 me muestra la c&aacute;mara de mi toplaner (Como si fuera el F3).\nPerd&iacute; una ranked por esta mierd* con lo bien que me estaba yendo y quiero una respuesta r&aacute;pido por favor ;-; quiero rankear. ¿Como quito esta configuracion ;-;? ¿Qué toqué?\n\nReiniciar el pc no funciona, por cierto.","replies":[{"poster":"Nísta","date":"2018-10-14T00:35:59.738+0000","up_votes":3,"down_votes":0,"body":"Lo mas probable es que se te hayan caído fluidos de dudosa procedencia en el teclado y se te haya arruinado.","replies":[{"poster":"high adc","date":"2018-10-14T03:41:14.559+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Errör 0xc00007b,realm=LAS,application-id=X54mVVp0,discussion-id=QAMxW7zR,comment-id=0000,timestamp=2018-10-14T00:35:59.738+0000)\n>\n> Lo mas probable es que se te hayan caído fluidos de dudosa procedencia en el teclado y se te haya arruinado.\n\nJAJAJAJ QUE ASCOOO","replies":[]},{"poster":"chato peludo1","date":"2018-10-14T00:39:53.425+0000","up_votes":1,"down_votes":0,"body":"Que prueba usando el teclado en pantalla. Si escribe bien ahí, es porque es problema directo del teclado.","replies":[]}]},{"poster":"exrex","date":"2018-10-14T01:20:04.510+0000","up_votes":2,"down_votes":0,"body":"Vale comer en la mesa man. Tenes que desarmar el teclado y limpiarlo.","replies":[]},{"poster":"PússySlap","date":"2018-10-14T04:53:18.168+0000","up_votes":1,"down_votes":0,"body":"me compras un taco?{{sticker:sg-soraka}} \n\notra vez ban pa mi xd","replies":[]},{"poster":"Nuke","date":"2018-10-14T02:53:34.754+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias a todos sus consejos. Los he utilizado y me han servido bastante para orientarme (y reirme xD). He solucionado el problema ya, pues ustedes ya me demostraron mediante varios métodos verificar de dónde era el problema.\nPese a que he hecho todo lo que me han dicho no he llegado a nada, por lo que cambié de teclado. Cosa que se me vino al final como último recurso pues si no uso los teclados viejos por algo será. Agarré uno que le faltaba una tecla pero la reemplacé por otra que nunca uso y anda perfecto.\n\nAl final este teclado me encanta muchisimo más, es más cómodo, escribo 1000 veces más rápido y no solo recuperé los PL si no que también mi duo ganó la promo. Asi que si, final feliz.\n\nNuevamente, muchas gracias.","replies":[{"poster":"POD2 Midnight","date":"2018-10-14T04:52:59.245+0000","up_votes":1,"down_votes":0,"body":"Cool :) aunque ya sea un problema del pasado, quiero aportar en algo: ¿Era un teclado mecánico o de membrana?\n\nLos de membrana están soldados en grupos, es decir, que con ciertas alteraciones una tecla puede agarrar muchas más. Eso describe perfectamente tu problema, y bueno, sería una causa bastante común, ya que para alterar la membrana solo se necesitan esos fluidos de dudosa procedencia que dicen en otros comentarios jajaja o bien que se te caiga el teclado, etc, todo sirve para alterar un poco la membrana y que cosas como esa ocurran.\n\nSi es mecánico dudo que ocurra eso, ya que está cada switch con una tecla correspondiente, y es un teclado que funciona a presión de los switches, a diferencia de las membranas que funcionan con la presión en la membrana, la cual manda un impulso eléctrico (Obviamente un switch genera impulsos eléctricos, pero la diferencia es que las membranas lo hacen a contacto y los switches se comportan como interruptor por cada tecla).\n\n---\n\nEso, espero haya sido de ayuda como para comprender un poco más el por qué del asunto :) Si alguien piensa o sabe que estoy equivocado, por favor corregidme :3 que lo que digo lo digo desde el empirismo (he trabajado con placas de teclado) y conocimientos vagos, en este caso. Saludos ;)","replies":[]}]},{"poster":"chato peludo1","date":"2018-10-14T00:37:41.770+0000","up_votes":1,"down_votes":0,"body":"Intenta escribir en un Word para ver si el problema es de la configuración de teclado o es del juego. Si es del juego debería bastar con volver a la configuración predeterminada.","replies":[{"poster":"exrex","date":"2018-10-14T01:20:50.436+0000","up_votes":1,"down_votes":0,"body":"No hay configuración en el juego que te haga apagar el pc.","replies":[]}]}]}