{"poster":"Krnage insiide","date":"2016-08-02T18:22:05.828+0000","title":"Perchè la gente inizia a flammare già dal primo minuto?","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"Ragazzi guardate, &egrave; una cosa incredibile. Ho appena giocato un game con una janna che dal primo minuto ha iniziato a flammare il suo adc e subito dopo tutto il team. Prendevamo una tripla e flammava comunque perch&egrave; il jungler aveva &quot;rubato&quot; la kill (neanche in bronzo si dicono ste cose). Mi spiegate perch&egrave; la gente flamma? Cosa gliene frega a lei se vayne era scarsissima? Vorrei capire le meccaniche che ci sono in quei cervelli perch&egrave; io di ipotesi non riesco a formularne","replies":[{"poster":"wellyT93","date":"2016-08-02T20:41:12.645+0000","up_votes":2,"down_votes":1,"body":"Ecco ciò che penso onestamente: \n1) Il tuo 6/7/1 (37% kill partecipation) di certo non ha aiutato una Janna già flamer di suo a calmarsi, se l'avessi carriata invece di lamentarti sul forum di come flammava (tra l'altro, esiste il tasto mute e il report) di sicuro il game sarebbe andato diversamente;\n2) Vayne aveva l'exhaust, mi pare abbastanza chiaro il motivo per cui A PLATINO un support si alteri da subito se vede un bidone del genere;\n3) Vayne ha fatto meno danni di te (e tu ne hai fatti pochissimi) che sei stato completamente inutile tutto il game, immagina lui. \n4) Vayne 125 cs/min 28 (va bhè che tu ne hai farmati 140).  \n\nTirando le somme di questo game:\n1) Janna si meritava il report? SI. \n2) Janna andava mutata? SI. \n3) Janna aveva ragione ad essere alterata? SI. \n4) Fossi stato io della Riot l'avrei bannata Janna? SI, una che flamma dal min. 1 non merita altro, anche se il suo team (e lei) di sicuro faceva cagare. \n\nChiaramente tutto questo lo considero in questo caso specifico, questo game.","replies":[{"poster":"Krnage insiide","date":"2016-08-03T08:01:42.578+0000","up_votes":2,"down_votes":1,"body":"qui non si parla del fatto che janna abbia perso da sola o meno, si parla del fatto che ha flammato come non so cosa. Cosa c'entra sta storia dei danni e blabla","replies":[{"poster":"wellyT93","date":"2016-08-03T08:20:26.123+0000","up_votes":1,"down_votes":2,"body":"C'entra, perchè se ti fossi feeddato e avessi fatto 1v5 lei avrebbe finito ben presto di flammare (dato che non sei in grado di mutare a quanto pare), invece anche tu hai contribuito a metterci il carico da 90. \nL'unico modo di far star zitti i flamer (che flammano per cose riguardanti il game) è carriarli, punto e fine. \nPoi ovviamente si reportano.","replies":[]}]}]},{"poster":"Ste the ripper","date":"2016-08-02T22:52:06.630+0000","up_votes":2,"down_votes":1,"body":"Quando il tuo adc o il tuo supp è scarso te ne accorgi subito, al primo trade sai già chi hai in lane, per questo flammava.\nIl motivo per cui flammava è probabilmente il fatto che fosse stressata, magari era in loss streak, magari aveva le sue cose, il real, magari aveva appena perso una partita perché l'adc pirla di turno si era distratto a causa del telefonino che si era scaricato ( mi è successo davvero, 40 minuti di ranked, partita quasi vinta, l'adc si distrae muore perché dopo aver distrutto l'inib rimane fermo, il team per aiutarlo muoiono in 3, i nemici fanno il baron e 5 minuti dopo vincono, è stata di gran lungo la ranked che più mi ha tiltato nella mia vita)\n\nCi sono molti motivi per cui puoi flammare, con ciò non dico che avesse ragione ( dico solo che uno di solito non flamma a caso, ma per un motivo), ma quando è così mutali e reportali senza pensarci.","replies":[]},{"poster":"JRobich","date":"2016-08-03T09:40:31.711+0000","up_votes":1,"down_votes":0,"body":"io ho la soluzione:\n\nnon appena inizia il game tieni premuto tab e muta tutti anche quelli dell'altra squadra... e gioca... i ping bastano e avanzano per far capire le tue intenzioni","replies":[]},{"poster":"Etoclas","date":"2016-08-03T09:23:12.573+0000","up_votes":1,"down_votes":0,"body":"Appena senti solo l'odore del flam, muta il flamer, SUBITO. Poi gioca, continuando a scrivere in chat, ma GIOCA. Sai quante partite ho vinto mutando l'INTERA SQUADRA? Parlo anche di ranked. Benedetta RIOT per il pulsante muto, usalo SEMPRE. Giocare senza vedere i commenti ti aiuterà molto di più, fidati :)","replies":[]},{"poster":"Sexy Win","date":"2016-08-02T18:42:40.263+0000","up_votes":1,"down_votes":1,"body":"Race, Milieu et Moment.\n1) Razza (eredità genetica) \n2) Ambiente\n3) Momento storico \n\nOgni cosa dipende da questi u.u","replies":[{"poster":"SirGGtheWanderer","date":"2016-08-02T19:20:51.465+0000","up_votes":1,"down_votes":1,"body":"Il naturalismo al giorno d'oggi:\n- Storia di una toplaner\n- Il supportatoio\n\nOvviamente non dimentichiamo la declinazione italiana con:\n- Rosso malSion\n- Mastrodon Garen\n- Gli amumuvoglia","replies":[{"poster":"Sexy Win","date":"2016-08-02T20:48:39.324+0000","up_votes":1,"down_votes":0,"body":"xD","replies":[]}]}]},{"poster":"Dr LouD","date":"2016-08-02T18:56:20.477+0000","up_votes":1,"down_votes":0,"body":"Perchè il mondo virtuale è una via facile per sfogarsi dalle frustrazioni della vita","replies":[]},{"poster":"I Homura I","date":"2016-08-03T10:56:38.586+0000","up_votes":1,"down_votes":1,"body":"Mutare i mestruati è il primo passo per divertirsi","replies":[]},{"poster":"Pls Buff Shen","date":"2016-08-02T21:51:45.104+0000","up_votes":1,"down_votes":1,"body":"Sinceramente ignorali, si sfogano, è capitato anche a me dopo avere battuto in 1 vs 1 il mio nemico il lane ho scritto \"ahaha you are bad\" e io odio flammare ma era stata una giornata frustrante, ignorali e fai un favore sia a te che a lui :)","replies":[]}]}