{"poster":"ExZeption","date":"2018-05-22T15:06:33.432+0000","title":"Gibt es irgend eine Möglichkeit Spieler zu reporten wenn man nicht in den AfterGame Screen kommt?","subforum":"Spielerverhalten & Moderation","embed":{"description":"Post with 0 views. Shared by Exi758.","url":"https://imgur.com/a/b0IQwwX","image":"https://i.imgur.com/YYEwhOE.jpg?fb"},"up_votes":2,"down_votes":1,"body":"Wie man sehen kann ist der Client einmal wieder am rumbuggen und das direkt nach einem game wo 2 leute den anderen 3 den tag verderbt haben.  Gibt es nun andere Wege einen report nachzureichen oder sind die beiden nun weggelucked?","replies":[{"poster":"Lotuskobra","date":"2018-05-22T15:08:40.454+0000","up_votes":4,"down_votes":0,"body":"Du kannst dem Support ein Ticket schreiben:\n\nhttps://support.riotgames.com/hc/de\n\nDort kannst du als Kategorie die Meldung eines Spielers auswählen und denn Fall erklären.","replies":[{"poster":"ExZeption","date":"2018-05-22T15:09:54.997+0000","up_votes":2,"down_votes":0,"body":"Danke für die schnelle Antwort","replies":[{"poster":"Lotuskobra","date":"2018-05-22T20:23:34.159+0000","up_votes":2,"down_votes":0,"body":"Bitteschön :)","replies":[]}]},{"poster":"TFH Mytronic","date":"2018-05-22T15:40:55.794+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lotuskobra,realm=EUW,application-id=KYnfKGf0,discussion-id=FjjEAs7x,comment-id=0000,timestamp=2018-05-22T15:08:40.454+0000)\n>\n> Du kannst dem Support ein Ticket schreiben:\n> \n> https://support.riotgames.com/hc/de\n> \n> Dort kannst du als Kategorie die Meldung eines Spielers auswählen und denn Fall erklären.\n\nGeht leider nicht {{sticker:cass-cry}} \nIch hab von einem Spieler mal eine stark beleidigende und rasistische Nachricht bekommen. Direkt an den Supp geleitet mit screens und \ndie Antwort war das wenn das ingame passiert ich die report Funktion benutzen soll. War leider nicht ingame. {{sticker:zombie-brand-mindblown}} Ich weiß nicht obs da ausnahmen gibt wenns ingame ist.","replies":[{"poster":"Lotuskobra","date":"2018-05-22T20:23:11.229+0000","up_votes":2,"down_votes":0,"body":"Wenn es nicht Ingame oder in der Post-/Pregame Lobby passiert, bist du selbst für die Kommunikation verantwortlich. Wenn dich derjenige also added, du dessen Anfrage annimmst und er dich anschließend beleidigt, liegt es rechtlich nicht mehr in Riots Hand, da du ja denjenigen nicht adden musst. Im Spiel kannst du dich bis zum Mute-Befehl ja nicht vor sowas schützen, daher versucht Riot es in der Regel auch genau dort einzuschränken. Da jedoch die Nachrichten, die man im Client-Chat schreibt zur Privatssphäre der Spieler gehören, darf Riot diese Daten nicht speichern und auch nicht einsehen, da sie sonst gegen Datenschutzrichtlinien verstoßen würden.\n\nSollte, wie im Fall vom TE, jedoch ein Report durch einen Bug nicht möglich sein, kann man sich immer an den Support wenden. Da man in diesem Fall ja das entsprechende Spiel angeben kann (aus seiner eigenen Match-History), kann der Support anschließend auch die Chatlogs einsehen und so beurteilen, was mit diesem passieren soll.","replies":[]}]}]},{"poster":"5 Dunks 1 Darius","date":"2018-05-22T15:16:29.425+0000","up_votes":2,"down_votes":0,"body":"Ist bei mir eben auch passiert, wie gesagt kann man ganz leicht beim Support einreichen ^^","replies":[]}]}