{"poster":"I say Facts","date":"2020-01-20T15:23:33.813+0000","title":"Shouldn't Vastayans be all covered in fur?","subforum":"Story, Art, & Sound","up_votes":11,"down_votes":14,"body":"They should be considered as furries, no skin seen, all of their skins covered with fur.\r\nWe don't have furries, so Vastayans would be the perfect for that, and there are already way too many humans in the game. Making Vastayans similar to humans is borderline boring.\r\n\r\nAlso, if Sett is half Vastayan half Noxian, at least make him more furry, and not mentioning beard.","replies":[{"poster":"WAAARGHbobo","date":"2020-01-20T23:38:05.263+0000","up_votes":17,"down_votes":1,"body":"A common misconception is the vastaya are furries.  Actually they are shapeshifters.  And notably most of the creatures which inspired the early champions in this group are shape-shifters too.  (A kumiho, the monkey king, a werecat etc..)   \n\nThe vastaya are often in a shape that they have chosen both consciously and unconsciously based on tribe, environment, and personality.  They can change shape depending upon the availability of magic, amount of time required for the change, and in the depth of their connection to their ancestry (vastayashairei). \n So a radical change that might take Rakan three days, totally exhaust him, and be hard for him to hold for more than a few minutes... well Neeko could do that in 2 seconds and hold it for several days.  (Thus shapeshifting is a part of her gameplay kit and not a part of his, but in lore they both have some level of this ability.) \n\n The vastaya generally avoid looking purely human or animalistic because it's uncomfortable and not ideal for fighting.  (Xayah would find having a human foot about the same comfort and ease as you would wearing 8 inch platform heels, two sizes two small.  You could do it, but you wouldn't want to fight those shoes and you wouldn't want to wear them for long either.)    But yes this does mean they excell at spying and intrigue. \n\nI didn't work on Sett but, one imagines Sett has some of this shapeshifting ability but it's pretty weak and probably not something he can control very well compared to his mother. (But also that looking more human is easier and more comfortable for him than it is for his mom).\n\nPersonally, I would love to see a more human looking Rengar canon skin and a less human looking Rakan and Xayah canon skins... cause it'd be cool to choose a canon skin before the fight. ","replies":[{"poster":"GreenLore","date":"2020-01-21T00:44:20.582+0000","up_votes":8,"down_votes":3,"body":"Honestly Sett being human looking makes quite a lot of sense, the problem is that the last vastaya who looks more animalistic than human was Nami, who was released in season 2(over 7 years ago) before the term \"vastaya\" was even a thing.\n\nIts kinda getting monotone seeing all these vastaya looking more like human cosplayers","replies":[{"poster":"Academy Kayn","date":"2020-01-21T18:47:56.704+0000","up_votes":2,"down_votes":0,"body":"Well I understand the sentiment behind this, I think the point is that Rakan and Xayah are the baseline for Vastaya when it comes to them being more 'Human than animal'. Yes, we *have* several vastayan like Rengar, Nami and Wukong who are more animal than human, but can we use the champions who were kinda added in post-launch to the Vastayan origin and hold them as what should be more common?\n\nI guess to simplify, if Rengar, Nami, and Wukong were never rebranded into Vastayan, would we have the same complaints about Sett that we do now? Cause the point of Vastaya looking human but not completely seems to be an intentional point for the Vastayan's story, and those \"More animal than human\" champions don't really add to said story. Rengar's story is about hunting Kha'zix, Nami's is about going to get the moonstone, Wukong's is about becoming a Warrior to protect Ionia. \n\nMeanwhile Ahri, the more human-animal of the folk rebranded as Vastayan, her story has everything to do with her nature as a Vastayan, and her struggles and problems relate directly to it. In short, the more-animal Vastayan have stories that have nothing to do with being Vastayan outside of a cosmetic choice, while the more-human Vastayan stories all struggle in some form or fashion for being Vastayan, be it their deadly nature like Ahri, rebelling against Humans who hate them like Xayah and Rakan, or being half-breed like Sett who was disowned by both Vastaya and humans, making the underworld his only choice.\n\nAll their stories have more to do with being Vastayan than any of the more-animal ones, which I think is entirely purposeful. Said animal ones don't contribute to the same themes as the more humans Vastaya do, and so they were rebranded and shoved to the side with isolated stories. Nami, Rengar and Wukong could all be made human (Maybe less Nami since underwater, but you could easily make that a beach side tribe that specializes in deep diving) without their stories being affected. Rakan, Xayah, and Sett can't, so which of the two groups are really vastayan? \n\n~~Of course this argument is null and void if people just want a more beastial champion lmao~~","replies":[{"poster":"GreenLore","date":"2020-01-21T21:02:43.290+0000","up_votes":2,"down_votes":0,"body":"The question at that point would be then: \nWhy make the baseline of the vastaya so humanlike in the first place when most of the vastaya champs at that time were closer to animals?\n\nReally the only humanlike vastaya before xayah and Rakan was {{champion:103}} and her story is essentially based around becoming more human and using magic to become more humanlike.","replies":[]}]}]},{"poster":"Ebonmaw Dragon","date":"2020-01-21T00:14:35.950+0000","up_votes":2,"down_votes":1,"body":"So... in theory... a Vastaya could look like a yeti, a dragon, a troll or a yordle (or a mix between all of those) if he/she wanted to?","replies":[{"poster":"Jaspers","date":"2020-01-21T10:21:22.217+0000","up_votes":3,"down_votes":1,"body":"Based on the idea of they can shapeshift, Nami could change her look to be like a yeti. \n\nKinda why I don't like the idea that Vastayan's can shapeshift at all (no offence to the idea, WAAARGHbobo, just don't like it). I'd prefer fixed forms. Negates their purpose, strifes and design if they can just change forms. Neeko, fine, part of her tribe and character and closer ties to her descendants than the rest. The rest? Nah, just ditch it, make it so their evolution means they are in the forms they are and it comes with the struggles those forms should have.\n\nNami still has a tail when she could just grow legs and walk on land, not using her magic? Xayah and Rakan have non-functioning wings (that are basically just capes)... why not just grow wings?\n\nWhatever, another thing for me not to like in the lore. :P","replies":[{"poster":"DeathBurst","date":"2020-01-21T14:36:43.351+0000","up_votes":3,"down_votes":0,"body":"She *could*, yes. The question then is, for how long, and at what cost. There seem to be an important aspect of self-image, identity, etc. If, to convince herself that she looks like a yeti, she has to abandon her water healing magic, yeah, she *could* shapeshift, but is that really worth it?\n\nSo, why not \"just\" grow legs? Why not just grow wings? Because it's not \"just\", it's not free, it has a cost.","replies":[]}]}]},{"poster":"WarWork","date":"2020-01-21T00:24:48.411+0000","up_votes":4,"down_votes":1,"body":"I think this might have made me more confused or at least a raised a lot of questions. Like what are the limits of their shape-shifting abilities? Can't Rengar just shapeshift his missing eye into a new working one? If Vastayah all are shapeshifters, why would Rengar's clan make his size and issue? That's a pretty physical reason for people that can (somewhat) freely change their appearances. Do Vastaya have a way to detect each other than appearance, because Sett was discriminated for being half human and he looks similar to Ahri, human with animal ears (minus tails)?","replies":[{"poster":"Robertsmash","date":"2020-01-21T03:37:45.719+0000","up_votes":3,"down_votes":0,"body":">Can't Rengar just shapeshift his missing eye into a new working one? If Vastayah all are shapeshifters, why would Rengar's clan make his size and issue?\n\nAs the rioter said it might take Rengar like a week to \"shapeshift\" an eye, and maintaining it might be so strenuous for him that it only lasts minutes. Same thing with size, taking hours and hours to enlarge, probably having to concentrate solely on shapeshifting for the whole duration making him useless for anything else, only to deflate back to normal when he can't maintain it anymore. Maintaining a shapeshift seems like holding your breath. It's not natural, gets harder as time goes on, and other actions that require exertion becomes much more difficult. That plus the added caveat that shapeshifting takes much longer to get going (it can take Rakan days to get another form), but you can start holding your breath instantly. This is just my opinion. Idk about the discrimination thing, but Ahri's tails are kind of a huge extra vastaya thing to have compared to just ears.","replies":[]},{"poster":"YDy2ZkRq02","date":"2020-01-21T21:29:38.785+0000","up_votes":2,"down_votes":0,"body":"On that very comment Odin has said most changes arent permanent. And they're also tied to their subconcious thoughts and personalities, so you could say that Rengar's defeat against Kha'Zix has marked him psycolagically and the scar on his eye reflects that in a way that he cant change, by that logic it's even possible that he can only shapeshift the eye back into a working one if he kills Kha'Zix. The size bit is a bit harder to answer but I think you can still explain it though shapeshifting limitations(he could get larger but not for long etc) and later on his subconcious(represetative of the clan's denial of him).\n\nAbout Sett, the Vastaya page say this: \n\n> No new vastaya have been born in several mortal lifetimes, and it could be that this ancient race now perceives another time of great change approaching… \n\nSince Vastaya havent been born for a long time, any Vastaya birth would become a very known event, and since they're very spiritual and stuff, yes, there's probally a way to notice the difference beyond visuals and Sett's mom case with a Noxian probally became well known anyway. Also looking similiar to Ahri doesnt mean much since he isnt from Ahri's tribe. I would say there are bigger differences between different Vastaya tribes than there is between Vastaya and humans.","replies":[]}]},{"poster":"Sexy Jack Rabbit","date":"2020-01-22T11:54:43.198+0000","up_votes":2,"down_votes":0,"body":"I think this whole explanation kind of helps to make Neeko a way more disappointing character design.\nShe's meant to be the most vastayashairei out of all of our current Vastaya and yet she's significantly more human than the rest. \nShe doesn't even have the hands or feet of a chameleon, just a tail and some body paint. \nIt's just kind of disappointing that Xayah and Rakan have more animalike qualities then her when she's meant to be the most Vastayan. \n\nThat said kind of knowing that she was the last champion designed by her (and by extension Xayah's) concept Artist before they left Riot . It kind of leads me to believe her design was a case of \"good enough ship it\" since they were leaving anyways and didn't care to make her design more interesting then it end up being. ","replies":[]},{"poster":"Oleandervine","date":"2020-01-21T19:07:50.321+0000","up_votes":2,"down_votes":0,"body":"Ehh, I think having them be general shapeshifters is a lore direction that's going to lead to a lot of consistency issues down the line. The Vastaya are already very \"catch-all\" as it is in terms of being a race of creatures with such a wide diversity of appearances, so having them be even more of a \"we can literally do anything we want with this race\" is not a good direction.","replies":[{"poster":"AnotherPurple379","date":"2020-01-23T00:27:11.681+0000","up_votes":1,"down_votes":0,"body":"Yeah, I agree. I'm surprised this is actually the lore direction they're going in, when I don't think they've explicitly mentioned this before.\n\nNeeko being an exception since she's more similar to their ancestors makes some sense, but having every Vastayan be able to do this is... Well, it's confusing.\n\nAt least I finally know the proof to where people were saying they were shapeshifters all along...","replies":[]}]},{"poster":"I say Facts","date":"2020-01-21T01:06:19.763+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=WAAARGHbobo,realm=NA,application-id=6kFXY1kR,discussion-id=hXlFYTGf,comment-id=0005,timestamp=2020-01-20T23:38:05.263+0000)\n>\n> A common misconception is the vastaya are furries.  Actually they are shapeshifters.  And notably most of the creatures which inspired the early champions in this group are shape-shifters too.  (A kumiho, the monkey king, a werecat etc..)   \n> \n> The vastaya are often in a shape that they have chosen both consciously and unconsciously based on tribe, environment, and personality.  They can change shape depending upon the availability of magic, amount of time required for the change, and in the depth of their connection to their ancestry (vastayashairei). \n>  So a radical change that might take Rakan three days, totally exhaust him, and be hard for him to hold for more than a few minutes... well Neeko could do that in 2 seconds and hold it for several days.  (Thus shapeshifting is a part of her gameplay kit and not a part of his, but in lore they both have some level of this ability.) \n> \n>  The vastaya generally avoid looking purely human or animalistic because it's uncomfortable and not ideal for fighting.  (Xayah would find having a human foot about the same comfort and ease as you would wearing 8 inch platform heels, two sizes two small.  You could do it, but you wouldn't want to fight those shoes and you wouldn't want to wear them for long either.)    But yes this does mean they excell at spying and intrigue. \n> \n> I didn't work on Sett but, one imagines Sett has some of this shapeshifting ability but it's pretty weak and probably not something he can control very well compared to his mother. (But also that looking more human is easier and more comfortable for him than it is for his mom).\n> \n> Personally, I would love to see a more human looking Rengar canon skin and a less human looking Rakan and Xayah canon skins... cause it'd be cool to choose a canon skin before the fight.\n\nInteresting, I didn't know they were shapeshifters but that explains why their structure differs from another. Also, Human looking Rengar in the same structure as Rakan might be weird but I would be curious to see how that will end up looking. Speaking of skins and the overall concepts. Is it possible that Riot make more furry animal champions? or just animals in general. My favorite looking champion is warwick because he is a perfect furry animal, and Volibear will my second favorite looking because of the incoming VGU. I would like to see more of such concepts. The game already has so many waifus and human characters.","replies":[]},{"poster":"d00mface","date":"2020-01-21T00:21:10.363+0000","up_votes":2,"down_votes":1,"body":"Speaking of furries... here's a potentially silly question for you. Ascended - their forms are based on Shuriman symbolism which relates animals to ideals they might want to represent... Is it possible to ascend into just... a big human? Humans are technically animals too. :U I imagine that might be weird. All these ascended get cool half-beast bodies and you.... you just got taller and buffer lol.","replies":[]},{"poster":"PMMeYordleThighs","date":"2020-01-23T04:23:18.868+0000","up_votes":1,"down_votes":0,"body":"And yet, we still have no idea how yordle glamors work or why they even exist.... But hey Vastayans can get entire mini-essays on their idle lore.","replies":[]},{"poster":"zounet","date":"2020-01-21T17:04:02.841+0000","up_votes":1,"down_votes":0,"body":"So vastayas are not at all linked with animals or animals spirits? They just enjoy taking the appearance of beings( human or not) is that what you meant?","replies":[]}]},{"poster":"Infernape","date":"2020-01-20T15:34:09.132+0000","up_votes":12,"down_votes":1,"body":"Sett's appearance does technically make perfect sense. \n\nVastayans are part Vastayashai’rei, part human. That would essentially mean that Sett is basically 2/3rds human. It would make sense that the obvious animalistic Vastayan traits like fur and the such wouldn't necessarily manifest themselves as something that obvious in someone that is closer to a human and would manifest in another way (ie his ears, his size and his physical abilities).","replies":[{"poster":"I say Facts","date":"2020-01-20T15:45:02.980+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Infernape,realm=EUW,application-id=6kFXY1kR,discussion-id=hXlFYTGf,comment-id=0001,timestamp=2020-01-20T15:34:09.132+0000)\n>\n> Sett's appearance does technically make perfect sense. \n> \n> Vastayans are part Vastayashai’rei, part human. That would essentially mean that Sett is basically 2/3rds human. It would make sense that the obvious animalistic Vastayan traits like fur and the such wouldn't necessarily manifest themselves as something that obvious in someone that is closer to a human and would manifest in another way (ie his ears, his size and his physical abilities).\n\nGood point, now I understand that","replies":[]},{"poster":"Sexy Jack Rabbit","date":"2020-01-22T11:49:30.011+0000","up_votes":1,"down_votes":0,"body":"Small correction but Sett would be Half Vastaya, Half Human. But since Vastaya themselves aren't full Vastayashai'rei, he'd actually be far less tahn others. It'd be easier to say he's half-Vastaya and an even smaller percent Vastayashai'rei","replies":[]}]},{"poster":"GreenLore","date":"2020-01-20T15:56:38.408+0000","up_votes":6,"down_votes":2,"body":"In general I feel like most new vastaya are far too human looking.\nI mean they are shapeshifters, so they could really do something creative with them instead of humans with a few animal parts glued to them.","replies":[{"poster":"I say Facts","date":"2020-01-20T16:30:59.853+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=GreenLore,realm=EUW,application-id=6kFXY1kR,discussion-id=hXlFYTGf,comment-id=0003,timestamp=2020-01-20T15:56:38.408+0000)\n>\n> In general I feel like most new vastaya are far too human looking.\n> I mean they are shapeshifters, so they could really do something creative with them instead of humans with a few animal parts glued to them.\n\nHonestly, that is exactly what came to my mind, but I thought people would not agree with me.\n\nI feel like they could use a bit more \"animalistic features\", it's just a thought but from my point of view, it makes sense on them more than closer to humans.","replies":[]}]},{"poster":"CasterGilgamesh","date":"2020-01-20T17:03:03.271+0000","up_votes":2,"down_votes":1,"body":"at least {{champion:62}}  and {{champion:107}} look like what Vastayans you picture look like. i think Vastayans (at least modern ones) should look like Xayah and Rakan more or less as the Vastayans are already a cross between humans and the Vastayashai’rei","replies":[]},{"poster":"Arcade Lulu","date":"2020-01-20T15:32:55.163+0000","up_votes":7,"down_votes":7,"body":"Neeko, Xayah and Rakan covered in fur\n{{sticker:sg-lux-2}} \n\nNami covered in fur\n{{sticker:sg-ahri-1}}","replies":[]},{"poster":"Pyrosan","date":"2020-01-20T15:38:54.955+0000","up_votes":3,"down_votes":7,"body":"no","replies":[]}]}