{"poster":"LFT His Support","date":"2015-09-30T18:32:58.304+0000","title":"Ideen/Anregungen","subforum":"Champions & Gameplay","up_votes":3,"down_votes":2,"body":"Hallo,\n\nIch habe mir gedacht es wird mal wider Zeit Ideen in den Raum zu schmei&szlig;en, da sich wider sehr viele in meinem Gehirn gesammelt haben :).\nDeshalb fange ich ohne gro&szlig;e umschweife an.\n\n_Nach jeder Idee gibt es eine **sehr kurze zusammenfassung** von der Idee. F&uuml;r alle die zu faul zum lesen sind ;)._\n\n---\n**1. Champion und Skin R&uuml;ckgabe**\nIch bin der Meinung man sollte das R&uuml;ckgabe System &uuml;berarbeiten. Sch&ouml;n und gut das man 3 Skins/Champions zur&uuml;ckgeben kann, aber die meisten Anf&auml;nger hauen diese 3 mal meistens sehr schnell und un&uuml;berlegt raus. So kommt es das man sp&auml;ter im Spiel wirklich einen Fehlkauf macht und diesen dann nicht mehr ungeschehen machen kann. Deshalb w&auml;re mein Vorschlag das sich diese R&uuml;ckgabe &quot;Punkte&quot; regenerieren und zwar das man alle 3-6 Monate einen R&uuml;ckgaben &quot;Punkt&quot; wider krigt. Dies w&uuml;rde die Spiel Balance nicht zerst&ouml;ren da man sich trotzdem nicht nur einmal RP kaufen muss und danach einfach immer wider umtauschen kann. Es w&auml;re einfach nur eine tolle &Auml;nderung die, denke ich mal, viele freuen w&uuml;rde.\n\n_Kurzfassung f&uuml;r alle die zu faul zum lesen sind ;): Riot sollte es so machen das die R&uuml;ckgabe &quot;Punkte&quot; sich regenerieren. _\n\n---\n**2. Server Stabilit&auml;t**\nJa ja, jeder kennt es, jeder liebt es: Die tollen Server (Spieziel bist du gemeint EUW!) von Riot. Ich behaupte einfach mal das bei jedem von uns die Server von LoL schon mindestens einmal im Spiele gecrashed sind. Daran sollte gearbeitet werden! Ich wei&szlig; das LoL urspr&uuml;nglich f&uuml;r 20.000 Personen ausgelegt war aber, nach 3 Jahren in denen das Spiel popul&auml;r war/ist sollte man die Server doch wohl langsam mal in den Griff bekommen. Ich glaube ich spreche f&uuml;r alle wenn ich sage das verlorene Spiele durch Highping nicht sonderlich sch&ouml;n sind. Deshalb: Arbeitet dran, Riotler! ;)\n\n_Kurzfassung: Die Server (Vorallem EUW) sollten stabiler werden!_\n\n---\n**3. Champion Anpassungen** _(Patch 5.19)_\nWelche Champions ich damit meine, ist glaube ich jedem klar. {{champion:34}} , {{champion:83}} , {{champion:6}} , etc. sind alle schon etwas alt und passen einfach nicht in das momentane LoL. Ob es nun die Spells oder die autoattack animation ist, irgendwas von beidem ist bei diesen Champions einfach zu langsam f&uuml;r das Spiel. Wie zum Beispiel soll die aktuelle {{champion:34}}  &quot;Q&quot; denn bittesch&ouml;n die aktuelle {{champion:7}}  treffen? {{champion:7}}  oder auch {{champion:103}}  werden zu 95% dieser F&auml;higkeiten easy ausweichen da sie einfach mega Mobil sind. Ich finde diese &quot;&auml;lteren&quot; Champions sollten der aktuellen Geschwindigkeit des Spiels angepasst werden. Zumal {{champion:6}} und {{champion:83}} so oder so nen Rework brauchen wenn wir mal ehrlich sind. **(An alle mains dieser Champs: Ich wei&szlig; f&uuml;r euch sind die Champions das st&auml;rkste auf der Welt ,aber der gro&szlig;teil von uns findet sie einfach nur schwach)**\n\n---\nIch m&ouml;chte noch Anmerken das ich nichts gegen {{champion:34}} , {{champion:6}} oder {{champion:83}} habe. Im gegenteil ich Spiele {{champion:6}}  sogar hin und wider mal. Trotzdem w&auml;re es besser sie w&uuml;rden alle mal ein kleines Update bekommen :)\n---\n\n_Kurzfassung: Alte Champions wie {{champion:34}} , {{champion:6}} , {{champion:83}} , etc. **brauchen dringend** eine Anpassung an die aktuelle Spielgeschwindigkeit!!!_\n\n---\n**4. Mehr Events**\nIch erinnere mich noch an die alten Zeiten (Season 1-3) wo man zu weihnachten und anderen Festen ein Geschenk bekommen hat. Dies w&uuml;nsche ich mir vom ganzen Herzen zur&uuml;ck. Auf meinem alten account habe ich beispielsweise meinen ersten Skin nur durch diese kleinen Geschenke gekauft. Ich erwarte ja nichtmal irgendwas &uuml;bertriebenes, aber ich finde 50-100 RP sind gerechtfertigt und auch menschlich. Versteht mich nicht falsch, die Events in letzter Zeit waren echt nicht schlecht (Pool Party, Weihnachts-&Uuml;berraschungsskins, etc.) und ich will auch garnicht das ihr sowas abschaft, aber diese kleinen RP Geschenke von fr&uuml;her fehlen einfach. :(\n\n_Kurzfassung: F&uuml;gt bitte wider die kleinen RP Geschenke von fr&uuml;her zu Weihnachten etc. ein. :( _\n\n---\n**5. Balancing**\nHierbei meine ich vorallendingen die Champions. Denn es gibt wie weiter Oben schon erw&auml;hnt (Punkt 3) Champions die einfach zu schwach in der momentanen Meta sind. Allerdings gibt es auch Champions die einfach zu stark sind (Ja Dampfwalzen ich schaue euch an!). Daran sollte gearbeitet werden, auch wenn momentan ziemlich viele Champions gespielt werden, w&uuml;rde es nochmal besser aussehen wenn statt 60% aller Champions 80-90% aller Champions gespielt werden, vorallendingen im Pro Bereich. W&uuml;rde einfach noch  mehr Abwechslung in das Spiel bringen.\n\n_Kurzfassung: Hier Empfehle ich den ganzen Text zu lesen, da es zu schwer ist hier die Botschaft in kurzform zu &uuml;bermitteln._\n\n---\n**EDIT 1.0**\n**6. TS/Voicechat in LoL (Idee von KillerEinhorn200)**\nEin LoL Voicechat wäre teils schon super, da man teils keine Zeit hat Teammates vor Ganks etc. zu warnen! Da stimmen mir glaube ich auch alle zu. Allerdings birgt dies auch die Gefahr das aus diesem Voicechat ganz schnell eine Art CoD 2.0 wird, denn genauso wie in CoD ist auch die LoL Community sehr jung im durchschnitt. Im Endeffekt eine sehr gute Idee die aber auch sehr schnell nach hinten gehen kann!\n\n_Kurzfassung: Eine Art Teamspeak für LoL um seine Teammates zu warnen wäre teils echt Nützlich birgt aber auche einige Gefahren._\n\n---\nSo dass war&#039;s erstmal von meiner Seite, bitte schreibt eure Meinung in die Kommentare und bitte seit dabei m&ouml;glichst konstruktiv, ich brauche kein rumgeheule von den {{champion:34}} Mains ;). Desweiteren k&ouml;nnt ihr Rechtschreibfehler gerne bei euch behalten, da ich jegliche Berichtigungen (abgesehen von dem Inhalt) ignorieren werde :). Falls ihr weitere Ideen habt schreibt sie ebenfalls in die Kommentare und ich werde, solange ihr es erlaubt sie hier als update einf&uuml;gen (nat&uuml;rlich werde ich eure Namen erw&auml;hnen). Ich w&uuml;nsche einen sch&ouml;nen Morgen/Mittag/Abend/Nacht.","replies":[{"poster":"Chaosthunder","date":"2015-09-30T21:00:08.761+0000","up_votes":2,"down_votes":1,"body":"Bitte realisiert diesen Lux Skin http://cmorilla.deviantart.com/art/Void-Lux-470197532","replies":[{"poster":"LFT His Support","date":"2015-10-01T11:28:45.370+0000","up_votes":1,"down_votes":0,"body":"Ich glaub du bist hier Falsch, Skin Ideen gehören zu Champ und Skin Vorschläge nicht zum gameplay :P\nTrotzdem sieht der Skin gut aus\n\nMfG Trolled4HD","replies":[]}]},{"poster":"HyperionCH","date":"2015-10-01T12:29:40.274+0000","up_votes":1,"down_votes":0,"body":"Zu 1.:\nFrei nach Schiller: \n\"Drum prüfe, wer sich ewig bindet,\nOb sich das Herz zum Herzen findet!\nDer Wahn ist kurz, die Reu ist lang.\"\n\nGilt auch beim Kauf von Skins (bzw. Käufen allgemein). ;)\nRiot kommt mit den 3 Rückgaben bereits kulant entgegen. Dazu wäre Riot nicht verpflichtet. \n\nDie Rückgaben sind für Fehlklicks gedacht; nicht für Fehlkäufe (z.B. weil man bemerkt, dass man jenen Champ gar nicht gut spielt oder der Skin nicht so gefällt wie man es dachte).\n\nZu 2.:\nAlso in den letzten Monaten hatte ich gerade einmal sehr starke Lags; wo auch alle Mitspieler dieses Problem hatten.\nSonst ist der EUW-Server recht stabil; kein Vergleich zu jenen Zeiten, als der Amsterdam-Server noch nicht nicht on war.\n\nZu 3.:\nReworks sind schwerer als neue Champs. Schliesslich will man nicht den Stil des Champs durch den Rework über den Haufen werfen. Ja, 1 Jahr ist recht lange. Jedoch sind diese Champs (zumindest Urgot und Yorick) doch sehr speziell und ein Rework ist gerade dort nicht einfach.\n\nZu 4.:\nRiot macht dies aus meiner Sicht sehr clever.\nSie veranstalten spezielle Events, wo es Geschenke gibt, die man jedoch erarbeiten muss. Dies finde ich wesentlich interessanter.\n\"Reine RP-Geschenke\" wird es wohl nicht mehr geben. Da würden wohl auch zu viele Spieler einfach nur smurf-Accounts erstellen, um dann beim Main-Account Skins zu schenken. Riot lebt von RP-Käufen und möchte kaum so etwas noch fördern.\n\nZu 5.:\nIn diesem Jahr ist mir aufgefallen, dass im Vergleich zu Season 4 die Pros doch öfters u nterschiedliche Champs pickten. Da scheint Riot also darauf zu achten, dass mehr Möglichkeiten bestehen.\nPerfektes Balancing wird es jedoch nie geben, das es immer das \"Pokemon-Prinzip\" gibt (Pokemon: Feuer schlägt Pflanze, Pflanze schlägt Wasser, Wasser schlägt Feuer / LoL: Tank schlägt Assassine, Assassine schlägt (AD)Carry, etc. -> wobei dies in LoL etwas komplexer ist)\n\nZu 6.:\nMan kann bereits mit Pings vor Ganks warnen. Dies hat sogar den Vorteil, dass dies jeder versteht, auch wenn man nicht gut Englisch kann.\nDie Flaming-Gefahr sehe ich auch als gross an. Bringt ja dann nichts, wenn man dann eh alle mutet.\nRiot hat fürs Team-Ranked so etwas geplant. Aber ob dies sinnvoll ist? Im Team-Ranked hat man meist bereits TS (oder ähnliches) und Riots Voice-Chat müsste weniger Ressourcen benötigen als TS etc. Das wird schwer, weil TS sehr wenig Ressourcen benötigt.\n\n\nIch sehe also nur bei Punkt 3, was Riot verbessern könnte.\nWobei es doch sehr viele Champs gibt und wenn ein halbes Dutzend Champs länger für ein Rework benötigt, ist dies für den Spielfluss kein grosser Impact.\nKlar, wäre es schön, wenn Yorick und Urgot angepasst werden (wobei Urgot für eine gewisse Zeit dieses Jahr sogar Meta war in der Pro-Szene). Aber besser mehr Zeit für ein gutes Rework investieren, als wenig Zeit für ein schlechtes Rework.","replies":[{"poster":"LFT His Support","date":"2015-10-11T19:36:06.050+0000","up_votes":1,"down_votes":0,"body":"Es sind halt meine eigenen Ideen und es ist völlig normal das jeder anders denkt, ich wollte hier lediglich aufführen was vorallendingen ich gern zurück hätte. trotzdem danke, dass du dir so viel Zeit genommen hast, um diesen Kommentar zu schreiben\n\nSorry für die späte antwort, war im Urlaubt :D\n\nMfG Trolled4HD","replies":[]}]},{"poster":"Veezey","date":"2015-09-30T23:01:10.425+0000","up_votes":1,"down_votes":0,"body":"1. Ja könnte man machen. Wäre aber für maximal 1 Punkt pro Season. \n2. Ich bin mit den Servern sehr zufrieden. Klar passiert es, dass die Server mal spinnen, aber das ist äußerst selten.\n3. Daran arbeitet Riot bereits.\n4. Ich hab da lieber Events wie mit Bilgewasser und Freljord. Beim Bilgewasser Event gab es sogar einen gratis Skin. Da kann ich auf die paar RP verzichten :P\n5. Das Spiel ist meiner Meinung nach recht gut gebalanced. Es wird halt immer so sein, dass einige Champions stärker sind und andere schwächer.\n6. Halte ich für keine gute Idee :D","replies":[{"poster":"LFT His Support","date":"2015-10-01T11:32:25.219+0000","up_votes":1,"down_votes":0,"body":"1. Stimm ich dir zu ;)\n2. Ich hatte es scho öfter, aber jeder hat da glaube ich andere Erfahrungen.\n3. Riot arbeitet daran halt schon über ein Jahr :P Das finde ich zu lange!\n4. Ich sage ja auch nicht das die Events abgeschafft werden sollen, ich meine nur das die alten rp gifts wider dazukommen sollten ^^.\n5. Ich glaub da muss man auch immer von Elo zu Elo gehen, aber hast schon recht ein champ wird immer zu stark / schwach sein.\n6. Ehrlich gesgat ich auch nicht, aber da hier anregungen rein kommen, hab ichs einfach mal aufgenommen :P.\n\nMfG Trolled4HD","replies":[{"poster":"Veezey","date":"2015-10-01T12:43:32.538+0000","up_votes":1,"down_votes":0,"body":"2. Das hängt wohl auch eher mit dem eigenen Internetanbieter zusammen. Denn wenn die Server spinnen merkt das eigentlich jeder hier^^ \nEdit: Wenn du glaubst, dass die Server nicht stabil sind, hättest du mal zu der zeit spielen sollen, als Euw und Eune zusammen waren. Das war der Horror xD\n3. Da stimmt ich dir zu, aber Riot hat auch ihre Prioritäten^^\n\nmfg","replies":[]}]}]},{"poster":"arcânist","date":"2015-09-30T18:42:19.634+0000","up_votes":1,"down_votes":0,"body":"Hi :) interessante Ideen hast du da ^^. Beim Punkt mit der Serverstabilität kann ich nur zustimmen, zum Rest kann ich leider wenig sagen :). Was ich mir noch Wünschen würde, wären kleine Sprachnachrichten/ts in LoL, da man manchmal einfach keine Zeit hat, bzw. nicht schnell genug schreiben kann, um jemanden rechtzeitig zu warnen. Klar, dass diese Funktion oft zum Beleidigen verwendet werden wird, aber vielleicht würde sich ja dafür eine Lösung finden. Außerdem bin ich der Meinung, dass des Ban-/Reportsystem von Riot überarbeitet werden sollte, viele haben das Gefühl, dass es nichts bringt, wenn man Trolls und Feeder reportet. MfG  KillerEinhorn","replies":[{"poster":"LFT His Support","date":"2015-09-30T18:48:49.786+0000","up_votes":1,"down_votes":0,"body":"Danke für dein Kommentar :3\n\nEs fühlt sich vlt so an das gegen flamer nichts getan wird, ich kann aber ruhigen gewissens sagen das riot da sehr konsequent ist! Einer meiner freunde flamed teils sehr viel und wird wenn er komplett mad ist nach spätestens einem Tag gebant oder krigt instant nen chat/rankedban.\nAnsonsten finde ich die Idee mit dem Voice chat sehr interessant, ich glaube aber da die LoL community sehr Jung ist wird daraus nichts, da wahrscheinlich dann so ein voice chat wie bei CoD entstehen würde ^^ Und da LoL sowieso schon ein Flame Problem hat wäre das glaube ich nicht grade förderlich. :)\n\nTrotzdem vielen Dank für deine Ideen!\n\nMfG Trolled4HD","replies":[]}]}]}