{"poster":"coachcartier1","date":"2017-12-08T12:02:35.680+0000","title":"\"Organisiertes\" Reporten","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":11,"body":"Hallo Community hab dar&uuml;ber auch schon nen Ticket er&ouml;ffnet was aber leider nicht bearbeitet wird.\r\n\r\nIch bin zurzeit daran meinen Account zu leveln und erwische &ouml;fter Leute die zusammen im Team ( Premades ) spielen.\r\nWenn diesen etwas nicht passt muss es so gemacht werden wie sie es sagen sonst gibts am ende nen Report ( laut derer Aussage ) das miese ist jetzt !!!!! Sie haben mich am ende des Games zu 3. Reported und ich habe innerhalb von 10 Sekunden nach dem Match eine Chat Restriction erhalten was TOTAL UNBEGR&Uuml;NDET war. Deren Worte im Match : If we 3 Report you - you will get banned no matter what because we are 3 People and youre 1. Was &uuml;bersetzt hei&szlig;en soviel wie wenn wir dich zu 3. reporten spielt es keine Rolle warum weshalb du wirst gebannt / bestraft. Gestern ist mir dies zum 2. mal Passiert und ich wurde sauer bin und drauf eingegangen zu schimpfen und habe einen von ihnen &quot;Idiot&quot; genannt EINMALIG - aber sie haben mich ganze Zeit runter gemacht seit minute 5 bis Ende jeder hat mich bis zum Ende geflamed und am ende habe ich wieder 3 Reports kassiert obwohl ich NICHTS falsch gemacht habe ( was man 100% aus dem Chat lesen kann ) jetzt hab ich eine Chat Restrictions von 25 Games total unbegr&uuml;ndet zum 2. mal. Kann man nichts gegen diese Leute unternehmen ?\r\n\r\nLG \r\ncoachcartier1","replies":[{"poster":"CMan","date":"2017-12-08T12:29:24.085+0000","up_votes":5,"down_votes":0,"body":"Da kann ich echt nur mit dem Kopf schütteln.\n\n\nEs ist doch so einfach: Reports lösen genau eine Sache aus, nämlich eine Überprüfung des Verhaltens von demjenigen der reportet wurde. Mehr nicht.\nUnd eine Strafe gibt es nur dann, wenn bei dieser Überprüfung etwas gefunden wurde, was nicht ok ist.\n\n**Wer sich anständig benimmt wird nicht bestraft, scheißegal wie oft er gemeldet wird!**\n\nFalls du wissen möchtest, was an deinem Chat nicht ok war, kannst du hier die Chatlogs posten.\n\nAber im Ernst: Du hast jetzt schon die zweite Strafe kassierst (!) und meinst immer noch, unschuldig zu sein. Das ist doch Unsinn.\n\nEs wird jetzt allerhöchste Zeit, dass du verstehst, dass das was du im Chat machst ziemlicher Mist ist, und das schnell änderst. Wenn du so weitermachst wie bisher, dann hast du den Account recht bald im Permabann versenkt.","replies":[]},{"poster":"legofreak1","date":"2017-12-08T12:05:19.969+0000","up_votes":5,"down_votes":0,"body":"Das Fehlverhalten anderer rechtfertigt nicht dein eigenes Fehlverhalten. Wenn andere Spieler flamen, kannst du diese muten und nach dem Spiel melden. Reagierst du auf Flame mit Flame brichst du nur selbst die Regeln und erhältst damit selbst eine Strafe. Möchtest du deinen konkreten Fall diskutieren, veröffentliche bitte deinen dir zugeschickten Chatverlauf in Form von Screenshots.\nZu Reports: Es ist unerheblich, wie oft man pro Spiel gemeldet wird. Es zählt, *dass* man gemeldet wird, ob dies ein mal oder 9 mal in einem Spiel passiert, ändert nichts.","replies":[]},{"poster":"Abasin","date":"2017-12-09T01:14:18.998+0000","up_votes":3,"down_votes":0,"body":"> TOTAL UNBEGRÜNDET\n\n\nSicher nicht, wenn Du patzig warst. Chatlog zeigen.","replies":[]},{"poster":"SORRYFORSCOPE","date":"2017-12-08T18:45:01.329+0000","up_votes":3,"down_votes":4,"body":"Nö. Wenn du nichts gemacht hast, kann dich von mir aus der Papst, Trump und Merkel zeitgleich reporten. Das System erkennt das und bestraft Personen die unnötigerweise Reporten. \n\nFakt ist doch, du wurdest zurecht bestraft, da du auf den Flame eingestiegen bist. Womöglich wurde das Premade Team ebenfalls mit einer Chatrestriction belegt. \n\nEInfach muten oder höflich zurecht weisen und selbst reporten. Aber weder flamen noch beleidigen, versuch einfach ma' das Team zu triggern und reporte sie im Anschluss :D.","replies":[{"poster":"Angel Ayume","date":"2017-12-08T20:22:15.317+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=SORRYFORSCOPE,realm=EUW,application-id=KYnfKGf0,discussion-id=PYjiZ8WI,comment-id=0008,timestamp=2017-12-08T18:45:01.329+0000)\n>\n> Nö. Wenn du nichts gemacht hast, kann dich von mir aus der Papst, Trump und Merkel zeitgleich reporten. Das System erkennt das und bestraft Personen die unnötigerweise Reporten. \n\nWenn man jemanden zu unrecht reportet, dann wird man dafür nicht bestraft. Und auch wenn es das mal gab, die Reports verlieren auch nicht an Glaubwürdigkeit. \n\n> \n> EInfach muten oder höflich zurecht weisen und selbst reporten. Aber weder flamen noch beleidigen, versuch einfach ma&#x27; das Team zu triggern und reporte sie im Anschluss :D.\n\nJemanden triggern, damit er was schreibt, weswegen du ihn reporten kannst ist nicht in Ordnung und absolut nicht nett. Und je nachdem wie man es anstellt kann man sogar auch dafür zurecht reportet werden. Also bitte empfehle den Leuten nicht so nen Stuss!","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-08T20:27:34.613+0000","up_votes":2,"down_votes":1,"body":"--> Quelle\n\n--> Ach, aber sich von einem Premade Team zu Unrecht beleidigen lassen ist 'nett'? Du darfst dich gerne weiterhin beleidigen lassen Angel Ayume. Wenn du dich auf diese Weise erhaben fühlst :). Aber ich schlag da doch lieber zurück.\n\nLG <3","replies":[{"poster":"Sirrkas","date":"2017-12-08T21:53:40.785+0000","up_votes":3,"down_votes":0,"body":">Bitte beachte, dass ein regelmäßiges Melden von Beschwörern für Verstöße gegen den Weg der Beschwörer, die sie nicht begangen haben, dazu führen kann, dass dein Konto aufgrund von Missbrauch des Meldesystems gesperrt wird. Wenn die Umstände der Meldung für jemanden, der nicht am Spiel teilgenommen hat, nicht sofort eindeutig sind, nutze bitte das Textfeld, um den Grund für die Meldung zu verdeutlichen oder zusätzliche Informationen bereitzustellen. Auch wenn du das Feld nicht verpflichtend ausfüllen musst, empfehlen wir dir sehr, eine Beschreibung für ein genaueres Verständnis über das Verhalten des Spielers beizufügen.\n\n\n[Quelle](https://support.riotgames.com/hc/de/articles/201752884)\n\nWobei mir aber kein Fall bekannt ist, dass wirklich mal jemand dafür gebannt wurde, für nichts zu melden. Das letzte in der Richtung war wohl, als Riot mal überprüft hat, was das für Spieler mit einem Reportgewicht von 0 sind (sehr lange her, das gibt es nicht mehr) und da darunter viele Flamer waren, haben sie an jene eine  Welle von Banns verteilt.","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-08T22:07:07.090+0000","up_votes":1,"down_votes":0,"body":"Also hatte ich Recht damit ~","replies":[{"poster":"Sirrkas","date":"2017-12-08T22:57:54.481+0000","up_votes":2,"down_votes":1,"body":"Nicht so ganz. Es ist möglich, aber dafür alleine, habe ich noch nie eine Strafe gesehen oder davon gehört, dass man dafür mal gebannt wurde. Ich würde es eher so bezeichnen, dass Riot sich die Möglichkeit offen hält.","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-09T18:51:29.503+0000","up_votes":1,"down_votes":1,"body":"Weißt du was? Einfach mal aus reiner Interesse werde ich das testen. Ich werde ab jetzt für 3 Monate hin jeden Spieler reporten. Sobald etwas passiert werde ich mich melden.","replies":[{"poster":"Sirrkas","date":"2017-12-09T20:04:25.831+0000","up_votes":1,"down_votes":0,"body":"Von solchen Tests kann ich nur abraten.","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-09T20:14:41.886+0000","up_votes":1,"down_votes":0,"body":"Für die Wissenschaft!","replies":[]}]}]}]}]}]},{"poster":"Angel Ayume","date":"2017-12-08T21:09:58.582+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=SORRYFORSCOPE,realm=EUW,application-id=KYnfKGf0,discussion-id=PYjiZ8WI,comment-id=000800000000,timestamp=2017-12-08T20:27:34.613+0000)\n>\n--> Quelle\n\nKann dir da leider keiner Quelle geben, da ich nicht weiß, wo es steht. Ich weiß nur, dass es mal ne Zeit gab, wo Reports mit der Zeit mehr unglaubwürdiger wurden und weniger gewogen haben, wenn man zu häufig zu unrecht reportet hat. Das wurde aber, falls ich mich richtig erinnere, mit dem Instant Feedback System abgeschafft.\nUnd eine Strafe für einen Falschreport gab es soweit ich weiß noch nie. Ich wüsste auch nicht, was der Sinn dabei wäre. Wenn es ein unrechter Report war, dann passiert auch dem der reportet wurde nichts. Ergo macht es auch keinen Sinn zu bestrafen, nur weil man mit dem Report vllt ein bisschen Luft ablassen will. Immerhin gab es mal ne zeitlang den Report für schlechtes Spielen. Der hat zu keiner Strafe geführt sondern war lediglich dafür da, dass man sich danach besser fühlt, zum Luft ablassen, als Wutventil.. Ein Placeboreport. :) \n\n> --&gt; Ach, aber sich von einem Premade Team zu Unrecht beleidigen lassen ist &#x27;nett&#x27;? \n\nWo hab ich gesagt, dass das nett ist? Natürlich ist das NICHT nett. \n\n>Du darfst dich gerne weiterhin beleidigen lassen Angel Ayume. Wenn du dich auf diese Weise erhaben fühlst :). Aber ich schlag da doch lieber zurück.\n\nIch fühle mich keineswegs erhaben oder sonstiges. Aber ich lasse mich nicht auf deren Niveau herab. Ich hab besseres zutun, als mit Spielern zu diskutieren oder zu streiten, nur weil die der Meinung sind, dass ich oder wer anders schlecht gespielt hat. \nDafür ist mir meine Zeit dann doch zu schade. :)\nIch denke, ich bin da einfach zu erwachsen. \nAber wenn du willst, dass ein weiterer Account von dir gebannt wird, dann schlag du nur weiter zurück und begebe dich auf das niedrige Niveau der Flamer. :)","replies":[{"poster":"Bettnachleger","date":"2017-12-09T10:19:26.938+0000","up_votes":2,"down_votes":0,"body":"> Und eine Strafe für einen Falschreport gab es soweit ich weiß noch nie. Ich wüsste auch nicht, was der Sinn dabei wäre.\n\nDoch, gab es. Es gab mehrere banwellen gegen Leute, die das Reportfeature ausgenutzt haben. (ich kannte gar eine Person, die davon betroffen war)","replies":[{"poster":"Angel Ayume","date":"2017-12-09T20:36:58.641+0000","up_votes":1,"down_votes":0,"body":"Wurde sie denn wirklich nur dafür bestraft? Also war es der einzige Grund für die Strafe und flossen da noch andere Dinge in den Bann ein? \nDas würde mich interessieren.","replies":[{"poster":"Bettnachleger","date":"2017-12-10T08:08:59.333+0000","up_votes":2,"down_votes":0,"body":"Nein. Soweit ich mich erinnere wirklich nur dafuer das sie das Reporttool missbraucht haben. \nSie haben quasi in jedem Spiel die Mitspieler / Gegner reported, und  joar, das war glaube ich so ~ S2, vor dem IFS. (nun sind falsereports ja ziemlich ladde)\n\nEvtl. suche ich nacher mal ein offizielles statement dazu raus, wenn ich Zeit habe ;D (und halt was finde)","replies":[]}]}]},{"poster":"SORRYFORSCOPE","date":"2017-12-08T21:28:18.869+0000","up_votes":1,"down_votes":0,"body":"Ohje. Erwachsen... was ist schon erwachsen... Erwachsene sind auch nur große Kinder. Ich würde mit meinen 22 Jahren behaupten, dass die Welt ein einziger, großer Kindergarten ist. \n\nNein, natürlich begibt man sich keineswegs auf das Niveau dieser halbstarken Affen. Nein, ganz im Gegenteil. Es ist nicht schwer solche Personen auf gesittete Weise in ihre Schranken zu weisen, sei es durch Aktionen ingame oder durch 'nicht reportbare' Sticheleien. Gewonnen hast du, wenn du ein \"KYS\" hörst. Freu mich ungemein über sowas :D. Er konnte mir eine Beleidigung an den Kopf werfen und verliert dafür seinen Account.\n\nDie Mute-Funktion wäre eine Option, aber was lernen halbstarke Affen daraus? Nichts. Ein 14-Tage oder Permaban wirkt dagegen ganz anders uns zähmt den dümmsten Aggressor.","replies":[{"poster":"Angel Ayume","date":"2017-12-08T21:52:53.290+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SORRYFORSCOPE,realm=EUW,application-id=KYnfKGf0,discussion-id=PYjiZ8WI,comment-id=00080000000000000000,timestamp=2017-12-08T21:28:18.869+0000)\n>\n> Ohje. Erwachsen... was ist schon erwachsen... Erwachsene sind auch nur große Kinder. Ich würde mit meinen 22 Jahren behaupten, dass die Welt ein einziger, großer Kindergarten ist. \n> \n\nMit 22 ist man auch noch nicht zwingend erwachsen. Hängt ja vom geistigen Alter ab und da du alles als großen Kindergarten ansiehst, scheint deine Umgebung noch nicht die nötige Reife zu haben. \nIch bin einfach zu alt dafür mit Spielern zu diskutieren. Das hab ich schlichtweg nicht nötig. Wenn sie meinen ihr eigenes Spiel kaputt zu machen oder einfach eine zu geringe Toleranzgrenze haben, dann soll das nicht mein Problem sein. Ich mute diese Leute und spiele weiter. Ich muss mir doch nicht von einem Fremden, den ich wahrsch. nie wieder sehe meine Laune verderben lassen. Na so weit kommts noch xD\n\n> Nein, natürlich begibt man sich keineswegs auf das Niveau dieser halbstarken Affen. Nein, ganz im Gegenteil. Es ist nicht schwer solche Personen auf gesittete Weise in ihre Schranken zu weisen, sei es durch Aktionen ingame oder durch &#x27;nicht reportbare&#x27; Sticheleien. Gewonnen hast du, wenn du ein &quot;KYS&quot; hörst. Freu mich ungemein über sowas :D. Er konnte mir eine Beleidigung an den Kopf werfen und verliert dafür seinen Account.\n\nJa mag sein, dass es ne gewisse Genugtuung ist, wenn man weiß, dass ein Flamer seinen Account verliert. Aber du sollst spielen und nicht irgendwen provozieren. Wenn du Spieler einfach nur auf den Keks gehst und sie versuchst zu provozieren, dann bist du genauso nervig und störend für das Game wie der, der flamed. Denn du förderst das Ganze ja sogar noch. -.-\nMit deinem Verhalten verhinderst du genauso einen angenehmen Spielfluss für die restlichen Spieler in deinem Team. Sogar für die Gegner, wenn ihr das Ganze im Allchat austragt. Und verhinderst so vllt sogar die Chance auf den Sieg. Du begibst dich ergo auf eine andere Art und Weise auf sein Niveau. ;) \nDas ist unnötig. \n\n> \n> Die Mute-Funktion wäre eine Option, aber was lernen halbstarke Affen daraus? Nichts. Ein 14-Tage oder Permaban wirkt dagegen ganz anders uns zähmt den dümmsten dümmsten Aggressor.\n\nDas lernen sie auch ohne, dass du sie provozieren musst. Ein Flamer flamed auch ohne deine \"Hilfe\". Der wird auch so seine Strafe bekommen, wenn er so weiter macht.","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-08T22:05:48.649+0000","up_votes":1,"down_votes":1,"body":"--> Laune verderben? Also mir macht es unheimlich Spaß Personen die es verdient haben zu provozieren und sie evtl. in einen Ban zu reiten :'D. Ach  Apropos \"Erwachsen\" siehe Politik und Weltgeschehen. Glaub mir, es ist alles eine reine Farce. Erwachsen heißt dass du Saufen, Rauchen und KFZ steuern darfst. Damit hat sichs auch. \n\n-->Naja hier geht es um Premade Teams. Darunter verstehe ich 3 bis 4 Mates die gemeinsam auf einen kloppen da sie es können. Außerdem passiert sowas wiiiirklich selten. Vielleicht alle 300 Spiele mal? Daher völlig akzeptabel. Ich bin eigentlich ein Spieler der kaum Probleme mit anderen Spielern hat, da ich eine ziemlich soziale Art zu spielen pflege (no shit o: ich bin ingame ein Musterspieler) \n\n-->Naja oft provozieren diese Personen auf eine Art und Weise die selten durch Reports bestraft wird aka \"You play so baaaaad omggg go afk!!!\"","replies":[{"poster":"Angel Ayume","date":"2017-12-08T22:24:53.393+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SORRYFORSCOPE,realm=EUW,application-id=KYnfKGf0,discussion-id=PYjiZ8WI,comment-id=0008000000000000000000000000,timestamp=2017-12-08T22:05:48.649+0000)\n>\n> --&gt; Laune verderben? Also mir macht es unheimlich Spaß Personen die es verdient haben zu provozieren und sie evtl. in einen Ban zu reiten :&#x27;D.  \n\nDas ändert nichts daran, dass du dich genauso falsch verhältst wie der der flamed. Und wenn du das bei allen machst, nicht nur bei Premades, dann verdirbst du vllt jemand anderem die Laune. Du sollst dich auf das Game konzentrieren und nicht darauf, dass ein Spieler was beleidigendes schreibt, damit er instant gebannt wird. -.- \n\n> \n> --&gt;Naja hier geht es um Premade Teams. Darunter verstehe ich 3 bis 4 Mates die gemeinsam auf einen kloppen da sie es können. Außerdem passiert sowas wiiiirklich selten. Vielleicht alle 300 Spiele mal? Daher völlig akzeptabel.\n\nAuch ein Premadeteam darf nicht flamen. Tun sie es doch, kann man sie reporten und sie werden entsprechend bestraft, wenn sie das häufiger machen. \n\n\n>Ich bin eigentlich ein Spieler der kaum Probleme mit anderen Spielern hat, da ich eine ziemlich soziale Art zu spielen pflege (no shit o: ich bin ingame ein Musterspieler) \n\nxD Sicher nicht. Du bist nicht ohne Grund auf Honorlevel 1 abgestuft worden. Und in deinem erstellten Thread warst du SEHR unhöflich und auch beleidigend. \nWenn du ein sozialer Spieler bist und ein Musterbeispiel für vorbildliches Verhalten bist, dann werd ich morgen die Igel fliegen sehen. xDDD\n\n> \n> --&gt;Naja oft provozieren diese Personen auf eine Art und Weise die selten durch Reports bestraft wird aka &quot;You play so baaaaad omggg go afk!!!&quot;\n\nDas ist bannbar. Wenn man sowas zu oft schreibt, dann gibt es auch dafür irgendwann eine CR und kann bis zum Perma führen. Vllt nicht so schnell wie bei anderen Vergehen, aber irgendwann ist da auch das Fass übergelaufen. ^^","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-08T23:00:48.719+0000","up_votes":1,"down_votes":1,"body":"Schon klar dass du mir das nicht glaubst, aber es ist wirklich so. Mein Problem ist der Alk. Wenn ich dicht zocke, also jeden Samstag Abend, nja flame ich eben gerne :D. Das resultiert dann immer in Chat Sperren. Aber nüchtern? Jesus selbst wäre stolz auf mich ♡","replies":[{"poster":"Waldschrat86","date":"2017-12-09T14:16:17.456+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=SORRYFORSCOPE,realm=EUW,application-id=KYnfKGf0,discussion-id=PYjiZ8WI,comment-id=000800000000000000000000000000000000,timestamp=2017-12-08T23:00:48.719+0000)\n>\n> Schon klar dass du mir das nicht glaubst, aber es ist wirklich so. Mein Problem ist der Alk. Wenn ich dicht zocke, also jeden Samstag Abend, nja flame ich eben gerne :D. Das resultiert dann immer in Chat Sperren. Aber nüchtern? Jesus selbst wäre stolz auf mich ♡\n\nMan merkt richtig wie erwachsen du bist und auch bereit für dein Verhalten geradezustehen ohne Ausreden zu suchen. \n\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-09T17:24:40.927+0000","up_votes":1,"down_votes":0,"body":"Ich hab mich doch grad verschluckt als ich das gelesen habe :'D. Danke für den Lacher. \n\nWas für eine Ausrede, ich stehe zu  meinem Alkohol-Konsum! Du willst mir doch nich' wirklich weißmachen, dass du dich nach einer durchzechten Nacht völlig unter Kontrolle hättest.\n\n","replies":[{"poster":"Angel Ayume","date":"2017-12-09T20:35:48.863+0000","up_votes":2,"down_votes":0,"body":"Ja, du stehst dazu. Nutzt den Alkohol aber als Ausrede dafür, dass du dich ingame wie ein Arsch benimmst und dieses damit rechtfertigst. \nSo nach dem Motto: \"Ich kann nichts dafür, der Alkohol ist Schuld.\"\nAls ob es dann nicht so schlimm wäre. \nDu stehst absolut nicht zu deinem schlechten Verhalten, schiebst es auf den Alkohol und damit ist die Sache für dich erledigt. Alleine, dass du es immer und immer und immer wieder machst, zeigt schon, dass es dir egal ist, dass du anderen Spielern damit das Game versaust und überhaupt nicht verstehst, dass DU dich falsch verhältst. \nUnd DAS ist eben kein erwachsenes Verhalten.","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-09T20:39:57.366+0000","up_votes":1,"down_votes":1,"body":"_Alleine, dass du es immer und immer und immer wieder machst, zeigt schon, dass es dir egal ist, dass du anderen Spielern damit das Game versaust und überhaupt nicht verstehst, dass DU dich falsch verhältst._\n\nNö, mir ist es einfach egal xD. \n_\nUnd DAS ist eben kein erwachsenes Verhalten._\n\nWas ich von dem Gewäsch halte weißt du ja mittlerweile :D.","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-09T22:00:52.950+0000","up_votes":1,"down_votes":0,"body":"Wolltest du nicht längst aufhören dich mit mir zu unterhalten :D?","replies":[]},{"poster":"Angel Ayume","date":"2017-12-09T21:07:17.324+0000","up_votes":1,"down_votes":0,"body":"Traurig.","replies":[]}]}]}]}]},{"poster":"Angel Ayume","date":"2017-12-08T23:22:38.580+0000","up_votes":3,"down_votes":1,"body":"Dann sei doch so intelligent und spiele nicht besoffen. -.- Du versaust anderen Spielern damit jedesmal das Game. Und das jedesmal vorsätzlich. Du weißt ja, was passiert. \nFür mich keine Entschuldigung. \nIch diskutiere jetzt aber nicht mehr. \nKeine Lust mehr.","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-09T17:30:06.716+0000","up_votes":1,"down_votes":1,"body":"Eigentlich nicht... Selbst besoffen spiele ich besser als manch einer :'D. Apropos besoffen, ich habe besoffen all meine Ranked-Games gespielt... Silber 2 juche :D.","replies":[{"poster":"Angel Ayume","date":"2017-12-09T20:29:34.451+0000","up_votes":2,"down_votes":0,"body":"Es hat doch nichts damit zutun wie du spielst, sondern wie du dich verhältst. -.-  Das ist ein riesen Unterschied. \nIch würde lieber mit einem Spieler zusammen spielen, der nicht besonders gut spielt als mit einem Spieler, der anderen nur auf die Nerven geht dafür aber gut spielt. \n\nMan merkt echt, dass du geistig noch nicht die nötige Reife hast.","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-09T20:31:54.910+0000","up_votes":1,"down_votes":0,"body":":(  \n\nNaja scheiß mal auf Reife, solange ich Geld und Wohnung habe ist mir das auch recht xD.","replies":[]}]}]}]}]}]}]}]},{"poster":"eingew","date":"2017-12-09T07:46:55.642+0000","up_votes":1,"down_votes":0,"body":"Bist du Student? Dann würde ich nicht davon ausgehen, dass du mit 22 bereits in einer erwachsenen Umgebung (oder selbst erwachsen) bist. Die meisten Akademiker werden erst später erwachsen, wenn sie in den Beruf einsteigen.","replies":[{"poster":"SORRYFORSCOPE","date":"2017-12-09T17:28:42.076+0000","up_votes":1,"down_votes":0,"body":"Wir befinden uns hier auf einem Forum für League of Legends. Ich möchte hier wirklich nicht weiter über die Definition von 'Erwachsen' diskutieren :^).","replies":[{"poster":"eingew","date":"2017-12-10T08:12:19.762+0000","up_votes":1,"down_votes":0,"body":"Seit wann ist ein Forum ungeeignet zum diskutieren? Wenn ich mir deine anderen Kommentare so durchlese liegt es wohl eher daran, dass dir das Thema auf den Geist geht.","replies":[]}]}]}]}]},{"poster":"Lantami","date":"2017-12-09T15:50:27.591+0000","up_votes":2,"down_votes":0,"body":">--> Quelle\n\nhttp://en.volu-eu.org/pbkb_general_user_view.php?art=36\nHier ist deine Quelle.","replies":[]},{"poster":"Released Ape","date":"2017-12-08T21:14:30.344+0000","up_votes":2,"down_votes":0,"body":"Es gibt keine Gewichtung mehr, das man für übermäßiges Reporten eventuell gebannt werden kann ist nicht ganz klar. Dazu hat man sich schon länger nicht mehr klar zum Spielerverhalten-System geäußert. Einziger Anhaltspunkt gibt uns die Support Seite, welche schreibt das es immer noch der Fall ist:\n\nhttps://support.riotgames.com/hc/de/articles/201752884\n\nTrotz eher alter Bilder, scheint der Artikel zumindest auf einen aktuellen Stand zu sein (2017). Wobei Riot es mit der Kommunikationspolitik ohnehin nie ernst nahm - da waren schon häufiger ältere Informationen mit neuem Datum.","replies":[{"poster":"hshtagniemehrcdu","date":"2017-12-08T22:04:56.167+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=GainZ this,realm=EUW,application-id=KYnfKGf0,discussion-id=PYjiZ8WI,comment-id=0008000000000001,timestamp=2017-12-08T21:14:30.344+0000)\n>\n\n> https://support.riotgames.com/hc/de/articles/201752884\n\nEhm...\nRiot Website kann man als Quelle leider vergessen.\nDie Informationen sind nicht selten Monate alt - oder noch älter.\nKann mich noch gut dran erinnern da etwas über 1-3 Tages Banns gelesen zu haben, als die schon lange abgeschafft waren..\n\nEs ist zwar sehr schade, aber als Quelle kann man deren Website nicht verwenden - sie ist schlichtweg unzuverlässig und keine Erwähnung wert.","replies":[{"poster":"Released Ape","date":"2017-12-09T00:54:57.455+0000","up_votes":2,"down_votes":0,"body":"Bin darauf im letzten Abschnitt auch kurz darauf eingegangen. Leider ist unklar wie aktuell die Informationen sind, aber die Support-Seite zeigt häufig zumindest die letzte Aussage auf Deutsch zu dem Thema. Die Datums-Anzeige auf der Seite ist ohnehin purer Irreführung, da jeder Artikel immer das aktuelle Datum mit der gleichen Uhrzeit hat.","replies":[]}]}]}]}]}]},{"poster":"Nordwolf87","date":"2017-12-08T16:21:43.580+0000","up_votes":3,"down_votes":0,"body":"Gibts echt immer noch leute die glauben 3 reports > 1 report.\n\nDachte nach hunderten threats zu dem thema hätte es sich mitlerweile rumgesprochen, dass das schlichtweg nicht (mehr) stimmt...","replies":[]},{"poster":"coachcartier1","date":"2017-12-08T12:36:29.764+0000","up_votes":1,"down_votes":5,"body":"Die Sache ist doch einfach. Ihr sagt es muss erst überprüft werden ? Der Spieler in meinem Team sagte mir provozierend im Chat : Wenn wir dich zu 3. Reporten genügt es keine Überprüfung und du wirst sofort bestraft. 10 Sekunden nach dem Match wurde ich ernsthaft bestraft - es kann doch keine 10 Sekunden dauern um einen Chat vom ganzen Spiel verlauf zu lesen und dann mich zu bestrafen - außerdem müssen das doch mehrere Leute lesen oder nicht ? Ich poste gerne den Chat hier.","replies":[{"poster":"hshtagniemehrcdu","date":"2017-12-08T14:24:40.448+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=coachcartier1,realm=EUW,application-id=KYnfKGf0,discussion-id=PYjiZ8WI,comment-id=0003,timestamp=2017-12-08T12:36:29.764+0000)\n>\n> Die Sache ist doch einfach. Ihr sagt es muss erst überprüft werden ? Der Spieler in meinem Team sagte mir provozierend im Chat : Wenn wir dich zu 3. Reporten genügt es keine Überprüfung und du wirst sofort bestraft.\n\nKompletter Bullshit.\nDu solltest nicht einfach alles blind glauben, was man dir erzählt.\nReports von Premades haben nicht mehr Wirkung als die von anderen auch.\nBei dir wirken sie schneller, da du bereits Vorbestraft bist und das System dementsprechend empfindlicher reagiert.\n\n>  10 Sekunden nach dem Match wurde ich ernsthaft bestraft - es kann doch keine 10 Sekunden dauern um einen Chat vom ganzen Spiel verlauf zu lesen und dann mich zu bestrafen - außerdem müssen das doch mehrere Leute lesen oder nicht ? \n\nWeil das System automatisch arbeitet, jeden Fall einzeln anzuschauen ist viel zu ineffektiv.\n\n> Ich poste gerne den Chat hier.\n\nSolltest du auch.\n2.te CR un immer noch im Glauben, Unschuldig zu sein....\nDu hast schon mehr als die Hälfte des Weges zum Perma Bann hinter dir.","replies":[]},{"poster":"HyperionCH","date":"2017-12-09T09:36:35.484+0000","up_votes":3,"down_votes":0,"body":"Selbst das automatische System braucht normalerweise ca. 15 Min.\nKann es sein, dass du wegen dem vor jenem bestraft wurdest? (zu sehen im chatlog).\n\nAber warum glaubst du völlig unbekannten Leuten?\nIch kann ja auch sagen, dass du mir 5000 Euro geben musst, sonst zeige ich und zwei meiner Freunde dich bei der Polizei wegen Diebstahl an. Denn wenn 3 Anzeigen eingereicht werden, kommt man sofort und ohne Untersuchung ins Gefängnis. Weiss doch jeder. ;)","replies":[]},{"poster":"Enderized","date":"2017-12-08T12:40:23.658+0000","up_votes":2,"down_votes":1,"body":"Automatisches System.\nEntsprechende Rechenkapazität ... geht verdammt schnell, da der Chat nur nach Keywords untersucht werden muss.","replies":[]}]},{"poster":"coachcartier1","date":"2017-12-08T12:38:00.572+0000","up_votes":1,"down_votes":1,"body":"Kann mir jemand sagen wo ich diesen Chat finden könnte ?","replies":[{"poster":"eingew","date":"2017-12-09T07:52:21.330+0000","up_votes":2,"down_votes":0,"body":"Da wurde vom Chatlog gesprochen, den du erst erhältst, wenn du eine Strafe erhältst. Der wird dir dann für die Dauer der Strafe jedes Mal beim einloggen angezeigt. Normalerweise fordern wir diese auch bei einer Diskussion über die Rechtfertigung eines Bans. Da du aber scheinbar noch gar nicht (wieder) bestraft wurdest, kannst du uns entsprechend natürlich auch keinen Chatlog vorlegen.\n\nKleiner Tipp: Wenn du unten links auf \"antworten\" klickst wird dein Kommentar in der Diskussionsansicht an den Kommentar angeheftet, auf den du dich beziehst. Das macht es für alle übersichtlicher, mit wem du eigentlich gerade sprichst und noch dazu bekommt die entsprechende Person eine gesonderte Benachrichtigung, wie du jetzt eine erhalten hast, die tauchen oben rechts in der Ecke links von deinem Namen auf. ;)","replies":[]}]},{"poster":"Kolivanne","date":"2017-12-08T12:19:51.324+0000","up_votes":2,"down_votes":0,"body":"> erwische öfter Leute die zusammen im Team ( Premades ) spielen.\n\nich musste schmunzeln. das klingt als gehörte es verboten :P\n\nkann mich der aussage von  lego nur anschließen. gib den leuten kein futter für reports. ja am besten schiebst du den ingame chat komplett aus deiner sicht.\nder chat wird in fast jedem spiel zweckentfremdet. du brauchst ihn nicht zum gewinnen.\n\ndennoch viel spass in der kluft","replies":[]},{"poster":"coachcartier1","date":"2017-12-08T12:42:34.378+0000","up_votes":1,"down_votes":4,"body":"Ja ich mute jetzt die Leute direkt wenn ich ins Spiel komme. Spart mir Kopfschmerzen und sonstiges. Das Problem ist bei meinem 1. Report wurde ich reported aus gründen die ich nicht kenne weil ich alle gemuted hatte und nichtmal gechatted habe. Ich habe nicht gefeedet ich habe nicht getrolled. Es waren 3 Premades die unzufrieden mit mir waren. Haben mich reported und zack hatte ich ne Sperre drin. Sowas darf es nicht geben.","replies":[{"poster":"Enderized","date":"2017-12-08T13:19:51.496+0000","up_votes":3,"down_votes":0,"body":"''Bei deinem 1. Report''\n\nDiese Aussage ist vollkommender Humbug-\nDu kannst gar nicht wissen wann du das erste mal gemeldet wurdest.\n\nWenn du wegen dem dir genannten Game bestraft wurdest, dann wohl nicht fürs Chatverhalten sondern andere Vergehen (FALLS du überhaupt wegen diesem Game bestraft wurdest)","replies":[]}]},{"poster":"Qbert","date":"2017-12-08T12:39:44.772+0000","up_votes":1,"down_votes":0,"body":"Du wirst etwas bestrafungswürdiges im Chat fallen gelassen haben.\nGanz einfach.\n\nLass dich nicht provozieren, zur Not mute die Leute und fertig, dann kann dir kein Report etwas anhaben.","replies":[]},{"poster":"Webturnier","date":"2017-12-09T00:21:43.667+0000","up_votes":1,"down_votes":6,"body":"Gar nichts machen kannste. Das ist ne Gang, die lässt dich bannen, wenn sie Lust hat. Du hast keine Chance dagegen.","replies":[]}]}