{"poster":"AppleEnte","date":"2017-08-26T14:28:13.958+0000","title":"Kein Impact","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo,\r\nich spiele des &Ouml;fteren Ranked, jedoch verliere ich in letzter Zeit so gut wie jedes Spiel.Ich bin Toplane Main und spiele Fighter.Meine meistgespieltesten Champions sind Riven,Kayle und Irelia.Seitdem ich Silber bin habe ich keine Erfolge mehr.Es liegt jedenfalls nicht an meinen Championpool oder Spielstil, da ich in 9 von 10 F&auml;llen die Lane Gewinne oder even rausgehe.Toxic bin ich auch nicht.Wenn ich w&uuml;tend bin lass ich es am Ende des Spieles aus und nicht im Spiel, da dass Team so umso schlechter spielt.\r\n\r\nMeiner Meinung liegt es daran, dass ich keinen impact im early Game als Toplaner habe.Ich kann nicht bestimmen, was die Botlane tut, oder ob der Jungler im Gegner Jungle invaded und stirbt.\r\n\r\nLeider gibt es so gut wie jedes Game einen der den Gegnern durch seine &quot;greedy&quot; Art zuspielt und bevor ich impact bekomme ist das Spiel beendet.Ich habe schon jede Art von Toplaner im Ranked getestet.Fighter wie Riven, Irelia etc.Tanks wie Shen, Maokai und Poppy.Und auch Fernk&auml;mpfer wie Kennen oder Kayle(?)\r\n\r\nKennt ihr das?Habt ihr Tipps?Schlie&szlig;lich schaffen es auch andere als Toplaner zu climben?\r\nLG Ente{{champion:92}}","replies":[{"poster":"Das Mahin","date":"2017-08-26T14:39:38.468+0000","up_votes":2,"down_votes":0,"body":"Es heißt nicht umsonst: Auf der Toplane herrscht 15-20 Minuten 1v1-Situation und n Jungler schaut auch nie (oft) vorbei. Natürlich gibts auch Ausnahmen^^. Wenn du impakt haben willst, rate ich dir Teleport-Ganks zu üben. Brauchst dafür aber gute Mapawairness.\n\nHoffentlich konnte ich dir helfen. {{summoner:12}}","replies":[{"poster":"AppleEnte","date":"2017-08-26T15:30:56.162+0000","up_votes":1,"down_votes":0,"body":"Ja hast du danke.Eine Frage hab ich noch oft ist es so das mein TP Gank fehlschlägt, da der tp viel zu lange braucht und die Gegner weg sind.Oft ist es auch so dass ich dadurch mein turret verliere.Gibt es gute Spots für TP Ganks?","replies":[]}]},{"poster":"Dreadlord Mike","date":"2017-08-27T21:42:30.519+0000","up_votes":1,"down_votes":0,"body":"Einfach Pantheon Toplane spielen und ab lvl 6 die Ult zum roamen benutzen.\nSehr leicht mit Pantheon games zu carrien, du solltest nur sehr auf dein warding achten da jungler dich gerne campen.\nFlash ignite +lethality runes ist ein Muss auf Pantheon","replies":[]},{"poster":"Nordwolf87","date":"2017-08-26T21:39:07.274+0000","up_votes":1,"down_votes":0,"body":"MMn hat man im early in der top 2 impacts\n\n1. Man pusht und hält damit vl den jgl von anderen lanes weg.\n\n2. Roams zur mid bzw teleport zum teamroam)\n\nViel mehr ist mmn nicht drin (vl als shen mim R)","replies":[{"poster":"AppleEnte","date":"2017-08-26T22:49:11.559+0000","up_votes":1,"down_votes":0,"body":"Okay den ersten Tipp kannte ich noch garnicht.Danke  :)","replies":[]}]},{"poster":"Oriius","date":"2017-08-26T20:23:18.718+0000","up_votes":1,"down_votes":0,"body":"als Toplaner hast du im early game nunmal kein impact . Höchstens durch gut platzierte tp roams oder in vorbereitung auf drake objective indem du einfach nachdem du b2b bist mal zur botlane hinläufst. Mit riven kann man impact haben wenn man riven einigermaßen gut beherrscht vorallem in silber jedoch glänzt riven dort wenn nicht fed eher durch ihren cc als durch ihren early damage. Maokai sowie irelia können auch impact haben vorallem weil mao im early game vergleichsweise schon recht stark wird und irelia viele 1v1 oder 1v2 gewinnen kann. jedoch ist da im vergleich zu riven die zeit zum roamen wesentlich länger.\n\nDas du verlierst muss nich zwingend an deinem Spielstil liegen oder daran das du kein Impact hast sondern einfach daran das du in Silber bist. in Silber kriegt man letztens oft die größten Pfeifen teilweise zugeteilt so das du auch mit ner 30:0 riven teilweise nicht mehr carryn könntest. Toplane spielt eigentlich immer recht solide aber vorallem die Jungler werden zunehmend schlechter. Kann jetzt deine Spiele zwar nicht bewerten aber in silber climben kann ich persönlich nur wenn ich entweder extremes glück habe was sogut wie nie passiert oder wenn ich einfach DuoQ gehe mit höherem Gold - Diaspielern.\n\nBin zwar mit sicherheit nicht extrem \"gut\" aber komischerweise habe ich keine Probleme gegen gold- low Dia zu spielen während ich gegen Silberteams dauerhaft lose einfach weil ich in besagten Gold-Diamatches nahezu kaum wen im Team habe der reinfeedet was in silber einfach komplett gegenteilig der Fall ist.","replies":[{"poster":"AppleEnte","date":"2017-08-26T22:47:53.004+0000","up_votes":1,"down_votes":0,"body":"Ja duo queue wäre eine Möglichkeit.Ich teste es mal aus.Danke für die Tipps :)","replies":[]}]},{"poster":"Allerbester Biss","date":"2017-08-26T16:58:44.302+0000","up_votes":1,"down_votes":0,"body":"Die Frage ist, wieso bekommen die Gegner auf der Borlane Kills und du auf der Toplane nicht.\n\nAußerdem solltest du nicht Riven spielen. Auf Keinen Fall!!","replies":[{"poster":"AppleEnte","date":"2017-08-26T17:18:57.653+0000","up_votes":1,"down_votes":0,"body":"Ich dominiere des öfteren die Lane und verliere sie kaum.Riven ist meiner Meinung nach mein sicherster Champion.Ich habe sehr viel Erfahrung mit ihr und kenne jede Combo (250k).Daran liegt es nicht.Es liegt eher daran, dass ich im early nicht beeinflussen kann was meine Mates machen.","replies":[{"poster":"Nerkahl","date":"2017-08-26T19:35:57.535+0000","up_votes":1,"down_votes":0,"body":"las dir nicht einreden was du spielen sollst oder nicht und gerade mit riven sollst du mehr tp-ganks machen um ihr vollen potenzial auszuschöpfen. (bin kein riven main hatte aber genug in eigenen oder ihm gegner team herumgeistern um es zu beobachten) \n die ganzen gold aufärts riven machen das soga ziemlich früh .","replies":[{"poster":"AppleEnte","date":"2017-08-26T22:46:40.301+0000","up_votes":1,"down_votes":0,"body":"Ok danke für den Tipp werde es mir mal antrainieren <3","replies":[]}]}]}]},{"poster":"Nubetto","date":"2017-08-26T19:18:49.308+0000","up_votes":1,"down_votes":0,"body":"fabian... du bist low elo du darfst NUR wirklich NUR malphite poppy garen oder Jax spielen sonst wirst du nie aufsteigen!","replies":[{"poster":"Nerkahl","date":"2017-08-26T19:30:43.032+0000","up_votes":1,"down_votes":0,"body":"was du reden? wenn man genug erfahrung hat kann man mit allen champs aufsteigen es liegt da nicht am champ, gut manche sind mehr team orientierter als andere aber zu sagen das nur dieser oder jener champ dazu geeignet ist zum aufsteigen ist bullshit. \nman kann mit allen aufsteigen wenn es dem eigenen skill entspricht mir drückens beispiel 32 punkte in ranks auf,  wenn ich mal rank spiele und dan troll ich weil es sonst zu langweilig wär.","replies":[{"poster":"AppleEnte","date":"2017-08-26T22:44:32.993+0000","up_votes":1,"down_votes":0,"body":"Er meinte dass aus Spaß :D.Er hasst die Leute, die das behaupten.","replies":[]}]},{"poster":"AppleEnte","date":"2017-08-26T19:20:55.265+0000","up_votes":1,"down_votes":0,"body":"Natürlich :D","replies":[]}]},{"poster":"vin919","date":"2017-08-26T19:18:20.787+0000","up_votes":1,"down_votes":0,"body":"El classico","replies":[{"poster":"Nubetto","date":"2017-08-26T19:19:38.408+0000","up_votes":1,"down_votes":0,"body":"Genau! das ist richtig","replies":[]}]},{"poster":"lolibus","date":"2017-08-26T16:16:19.808+0000","up_votes":1,"down_votes":0,"body":"Dieser gbay99 Typ ist Toplane Irelia main und Diamond, da findet sich bestimmt ein zwei Videos die dir helfen:\nhttps://www.youtube.com/watch?v=HNhR6-uLSYs\n\nAnsonsten versuchs mal mit Splitpushen:\nhttps://www.youtube.com/watch?v=V5n5Z6X12RY","replies":[{"poster":"AppleEnte","date":"2017-08-26T17:13:34.729+0000","up_votes":1,"down_votes":0,"body":"Okay Danke ich werd es mir mal anschauen! :)","replies":[]}]}]}