{"poster":"D10Z","date":"2017-12-25T23:46:51.984+0000","title":"Cansado de los Troll en los pick","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":4,"body":"Hola, soy nuevo en el foro, creo que es el primer topic que abro, desde que comenc&eacute; a jugar. \r\nPero ya me canse de los que trollean pickeando cualquier cosa que no va en la linea y dicen que van a trollear.. lo peor es que si salis una ves son 5 min y despues son 15...\r\n\r\ndenle una soluci&oacute;n a esto es impresionante como joden al juego!!!","replies":[{"poster":"xaxesis","date":"2017-12-26T00:07:44.238+0000","up_votes":2,"down_votes":1,"body":"2 puntos:\n\nla primera es la ignorancia enterese que elegir campeones en cualquier posicion es libertad de cada invocador no hay sanciones por elegir campeones \n\nla otra es un troll confeso si tiene uno asi si elige el campeon que mas le guste a usted no interesa porque ya confeso que va trolear y por tal va perder\n\nambos puntos son distintos","replies":[]},{"poster":"Eowyn Eorl","date":"2017-12-26T01:05:40.040+0000","up_votes":1,"down_votes":0,"body":"Hay varios troll pick y troll builds que de verdad sirven.\nSi no me creés, mirate los videos de Renzoh (?","replies":[]},{"poster":"D10Z","date":"2017-12-26T00:40:05.620+0000","up_votes":1,"down_votes":0,"body":"nose entendió, si pickean soraka jg y dicen que van trollear, me comi un montón de partidas con un lee sin supp y de adc sona y terminaban 1/12....\n\nla verdad es que no me interesa lo que pickean... el tema es cuando ya te dicen que van a trollear","replies":[]},{"poster":"Desergt Pander","date":"2017-12-26T00:05:36.114+0000","up_votes":1,"down_votes":0,"body":"Si te quedases la partida ya verás como cartean con Zilean JG, como se nota que no saben nada del meta en Corea del Norte","replies":[]},{"poster":"Nôll","date":"2017-12-26T01:12:08.962+0000","up_votes":1,"down_votes":1,"body":"Muchísima gente me agredía vervalmente durante la selección de campeones por ir Zoe Supp, incluso algunos decían: como él va troll, yo también (todo el drama durante la selección de campeones, les recuerdo). Después ya al empezar la partida podían pasar 3 cosas:\n1) \"encima zoe m7, alto rata\" (y sus comentarios derivaros).\n2) Ej: El adc se tira malee a pelearle al adc y supp enemigos cuando está el jg enemigo viniendo a gankear bot (vale aclarar que tengo hasta el blue enemigo wardeado), le pingeo para que corra, le tiro mi E al adc enemigo, el extenuar al jg pero el supp y jg enemigos se lo comen vivo igual. Acto seguido: \"gg zoe supp\", \"report supp troll\", \"gg no supp\", \"nah así no se puede 0 peel\". Terminamos perdiendo por la mala actitud del adc que no se molesta en jugar bien siquiera, me dejan morir cuando podrían ayudarme con una curación, se van afk, etc, etc, etc.\n3) Todo mi equipo aliado hace 0 comentarios durante todo el early (la m7 y el honor 5 que tengo obviamente, y si, estoy alardeando). Muchas veces gano cuando tienen esas actitudes porque no me molestan y juegan con normalidad. \n\nA lo que voy: estoy del otro lado del charco, me encantan los picks que son no convencionales (ya tuve un taric mid una vez y nos carreó la partida), y estoy de acuerdo con que es muy molesto que digan \"voy troll\" en cualquier momento de la partida (selección de campeones o ya durante la partida).\nEl tema es que vos estás haciendo referencia a los que van picks no convencionales y además van troll, el punto sería más compartido si simplemente se hablara de la gente que trollea porque sí... \nInsisto, me encanta que la gente juegue con champs que no fueron pensados para ese rol, pero no que lo hagan exclusivamente para trollear.","replies":[]}]}