{"poster":"option paralysis","date":"2017-04-26T12:09:29.071+0000","title":"Holy shit, Rakan is so fun to play!","subforum":"Gameplay","up_votes":42,"down_votes":9,"body":"As a Soraka support main, the amount of mobility Rakan has is fucking amazing! From Soraka that can barely walk away from someone to Rakan&#039;s EWE is sooooooo fun.\r\nAs far as how champion is good, Idk yet... if I could main him and climb with him, remains to be seen.\r\nAnyone played more games of him or in ranked ? What are your thoughts ?","replies":[{"poster":"Ralanr","date":"2017-04-26T13:01:22.050+0000","up_votes":23,"down_votes":1,"body":"He's honestly really fun, but half the time I forget he has an ult. His W just takes the cake and his E is basically if you decided to play Lee Sin support. \n\nNow I know why Lee Sin players love mobility.","replies":[{"poster":"crippler38","date":"2017-04-26T17:20:40.586+0000","up_votes":5,"down_votes":0,"body":"try ulting then using your mobility skills like w, you charm them into the knockup.","replies":[]}]},{"poster":"Riot Ellarian","date":"2017-04-26T22:21:30.081+0000","up_votes":20,"down_votes":2,"body":"I KNOW RIGHT, HE'S SO FUN.  \n\nLEE SIN FOR SUPPORT MAINS LET'S GO","replies":[{"poster":"Raoul","date":"2017-04-26T22:23:55.289+0000","up_votes":4,"down_votes":13,"body":"Nah, for Lee Sin level, his Shield dash needs about double range, half the Cooldown, and he has to shield himself too...\n\nIts kinda funny how Lee Sins Shield Dash is better in nearly every aspect (at least the double cast is unique to Rakan) and its not even the whole spell...","replies":[{"poster":"Riot Ellarian","date":"2017-04-26T22:48:47.823+0000","up_votes":19,"down_votes":1,"body":"I don't find 1:1 ability comparisons like that to be particularly useful since you're trying to analyze two abilities in a vacuum instead of in the context of each champion's full kit  - and I think Rakan is actually more mobile overall than Lee is (three dashes and a 200% movespeed ult).","replies":[]}]},{"poster":"KoKoboto","date":"2017-04-26T23:44:47.080+0000","up_votes":6,"down_votes":10,"body":"Downvoted because fuck lee sin. Rakan players are Rakan players and Lee Sin players are something else entirely, please don't group the two even though both have great mobility Rakan is way less annoying. Even though his thematic is being a distracting guy.","replies":[{"poster":"Riot Ellarian","date":"2017-04-27T01:32:57.882+0000","up_votes":12,"down_votes":1,"body":"Please note I didn't call him \"A support for Lee Sin mains\", I called him the exact opposite.  \n\nAlso I play both... :(","replies":[{"poster":"Lee Cinderella","date":"2017-04-27T17:37:48.874+0000","up_votes":6,"down_votes":0,"body":"People just ride the salty lee sin train for upvotes. From someone who enjoys lee sin for his mobilty and bouncing around, I immediately had that feel when playing Rakan. I had played lee sin support before and jumping in and out- damaging enemy and shielding teammate when they try to trade, was the core of his supp potential and that is spot on with Rakan with more potential!","replies":[]}]}]},{"poster":"Shadow Hazard","date":"2017-04-26T22:24:05.213+0000","up_votes":1,"down_votes":0,"body":"so he will defs be getting buff for worlds for those big plays I guess huh","replies":[{"poster":"Riot Ellarian","date":"2017-04-26T22:43:21.227+0000","up_votes":6,"down_votes":0,"body":"I'm honestly not sure where he sits balance wise, but he is a treat to play (and I bet to watch, too!)","replies":[{"poster":"Nevrankroaton","date":"2017-04-27T05:57:36.544+0000","up_votes":2,"down_votes":0,"body":"Just don't make the mistake to buff his heal mindlessly (not like your guys are stupid but don't take suggestion on reddit/board as good ones), if Rakan had good sustain capacity along with such versability and mobility, even if the Q is kinda a weak spell, it would give him way too much power in lane and add frustration. If anything, you can increase the Q range so he can poke a little better but I honestly don't feel it is necessary in his lane. Especially when his Q actually has good base heal amount.\n\nI would let him sink a little before buffing him, we can't forget that champ like Ivern or Taliyah proved before when it come to \"Let people work on it\".","replies":[]}]}]},{"poster":"Chønklord","date":"2017-04-27T17:38:26.218+0000","up_votes":2,"down_votes":0,"body":"The only true lee sin support for support mains is... Lee sin. \n\nBuck up and play lee sin if you want a \"lee sin style\" support. \n\nI'll take my lee sin supp vs a Rakan any day. \n\n#god fist ftw","replies":[{"poster":"Riot Ellarian","date":"2017-04-28T19:23:51.308+0000","up_votes":2,"down_votes":0,"body":"I respect your commitment, sir.  I've tried Lee support a couple times, and it's a ton of fun, but it generally makes my ADC uncomfortable unless they enjoy cheesing as much as I do...","replies":[]}]},{"poster":"AgeOfTheMage","date":"2017-04-27T18:05:56.538+0000","up_votes":1,"down_votes":0,"body":"Don't tempt me mantikles, i've allready gone diana and ezreal support, don't make me go lee sin.","replies":[]}]},{"poster":"morris1","date":"2017-04-26T15:05:21.679+0000","up_votes":13,"down_votes":0,"body":"It's weird that Rakan can _EWE_ but Soraka can't.","replies":[{"poster":"KoKoboto","date":"2017-04-26T15:39:45.772+0000","up_votes":1,"down_votes":0,"body":"Soraka has Q->W","replies":[{"poster":"SSJTribe","date":"2017-04-26T15:43:07.763+0000","up_votes":16,"down_votes":0,"body":"it's a joke, a ewe is a female sheep.","replies":[{"poster":"Glory ln Death","date":"2017-04-26T16:53:37.685+0000","up_votes":13,"down_votes":0,"body":"In that case, it isn't weird at all that Soraka can't do it, since she's a goat, not a sheep.","replies":[]}]}]}]},{"poster":"JackMcSnipeyz","date":"2017-04-26T12:12:14.510+0000","up_votes":1,"down_votes":0,"body":"I've only had him support me once and i was disappointed, i dont know if it was the player or the champ, but even as xayah with him for longer dashes and extra damage, he felt like he didnt do much.\nHe definitely looks fun though..","replies":[{"poster":"HypeLock99","date":"2017-04-26T12:20:26.905+0000","up_votes":1,"down_votes":0,"body":"You definitely fly around/have fun, you can do stuff and hit, but it never hits hard, honestly imo he needs a buff to his healing and W damage, It's almost embarrassing unless your comp is knockup dependant.","replies":[{"poster":"Dokkaebi","date":"2017-04-26T12:26:45.537+0000","up_votes":14,"down_votes":0,"body":"His mobility takes a lot out of his power budget. He would propably become too op with dmg/heal buffs. It's like his own niche. \nIf he got the dmg/heal of Soraka for example, he would become almost like a Soraka with a lot of mobility.","replies":[{"poster":"It Hertz When IP","date":"2017-04-26T19:59:59.267+0000","up_votes":1,"down_votes":0,"body":"If I had to choose between looking cool and actually doing shit, I'm probably going to go with the latter.","replies":[{"poster":"SolarisCorvus","date":"2017-04-27T11:33:56.619+0000","up_votes":1,"down_votes":0,"body":"Weong answer. You should be the coolest and most useless vastaya in the rift.","replies":[]}]}]},{"poster":"VexingRaven","date":"2017-04-26T18:03:51.176+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HypeLock99,realm=NA,application-id=3ErqAdtq,discussion-id=PnjWA2Nz,comment-id=00010001,timestamp=2017-04-26T12:20:26.905+0000)\n>\n> You definitely fly around/have fun, you can do stuff and hit, but it never hits hard, honestly imo he needs a buff to his healing and W damage, It&#x27;s almost embarrassing unless your comp is knockup dependant.\n\nSo kind of like Bard? Really fun to play, but not all that impactful outside of specific situations?","replies":[{"poster":"DeathBurst","date":"2017-04-27T07:53:01.666+0000","up_votes":1,"down_votes":0,"body":"Both Bard and Rakan are really impactful. It's not a matter of hitting hard, it's a matter of making the hits that count.","replies":[]}]}]},{"poster":"Dokkaebi","date":"2017-04-26T12:17:42.377+0000","up_votes":3,"down_votes":4,"body":"While playing him it doesn't feel like you do much either, lol.","replies":[{"poster":"Dokkaebi","date":"2017-04-26T20:13:25.114+0000","up_votes":1,"down_votes":1,"body":"Why am I getting downvoted? Lmao\nHis heals/shields are not massive and his damage/tankiness is a joke.\nAll you do is hop around and cc people.","replies":[{"poster":"DeathBurst","date":"2017-04-27T07:53:40.046+0000","up_votes":3,"down_votes":0,"body":"Which is already a ton of work, and that's why you get down-voted.","replies":[]}]}]},{"poster":"DragonManSquid","date":"2017-04-27T06:12:33.994+0000","up_votes":2,"down_votes":0,"body":"It was the player. Rakan get's $#%^@ done.","replies":[]}]},{"poster":"Friendly Ram","date":"2017-04-26T15:28:29.448+0000","up_votes":8,"down_votes":0,"body":"he is really fun but after so many games with xayah i keep overestimating his e range and my adcs refuse to be close enough to save me.","replies":[{"poster":"Riot Ellarian","date":"2017-04-27T01:30:52.708+0000","up_votes":4,"down_votes":0,"body":"SAME","replies":[{"poster":"Krys Star","date":"2017-04-27T07:12:34.432+0000","up_votes":1,"down_votes":0,"body":"Isn't that a flaw, though? That Rakan gets a potentially advantageous bonus to his dash if Xayah is present in the game and on his team? That just makes it feel like a slight detriment to picking any other carry besides Xayah if your support is going to be Rakan. I understand the point of the ability having a longer reach with Xayah, but it's such an advantage you'd be silly not to pair them up together.\n\nWhy not just remove the bonus range and add half of it onto his dash in general?","replies":[{"poster":"SuperLuigiLXIV","date":"2017-04-27T13:10:40.974+0000","up_votes":3,"down_votes":0,"body":"They'll have to, eventually. Otherwise, Rakan and Xayah will either be balanced without their paired bonuses, and too strong with them, or balanced with them and lacking without them.","replies":[{"poster":"Krys Star","date":"2017-04-28T03:06:41.165+0000","up_votes":1,"down_votes":0,"body":"Agreed. The bonus animation to their recall is great, they can give him a bonus animation when he dashes to Xayah. Otherwise, it's a huge balance flaw to just give him extra range with Xayah. I don't know what they were thinking.","replies":[]}]},{"poster":"Zielmann","date":"2017-04-28T22:28:55.862+0000","up_votes":1,"down_votes":0,"body":"An alternative: Make it so he can bind to an ally at the start of the game, like what Kalista does. Assuming he binds to his ADC, he'l always have the range bonus available to his lane partner, but the range remains limited for all other allies.","replies":[]}]}]}]},{"poster":"Into The Aether","date":"2017-04-26T22:30:41.914+0000","up_votes":3,"down_votes":0,"body":"I do kinda like that one of these obscenely mobile champions finally came home to roost(Heh) in the support role.\n\nIt seemed weird to me that kind of utility was sprawling out into the non-utility roles, but not really showing up in the actual utility role.","replies":[]},{"poster":"TotalJerk","date":"2017-04-26T19:24:16.455+0000","up_votes":3,"down_votes":0,"body":"My main problem is that Q is a filler ability and that he has a similar problem as old Alistar: Once he uses his key spells (W, E, and ult) he just runs around doing nothing until his cooldowns come back up.","replies":[{"poster":"Supreme Senpai69","date":"2017-04-27T13:57:42.671+0000","up_votes":1,"down_votes":0,"body":"Why do you think his Q is filler? Healing/sustain in lane is super valuable!","replies":[{"poster":"TotalJerk","date":"2017-04-27T17:49:02.139+0000","up_votes":1,"down_votes":0,"body":"The heal is actually garbage. It's as bad as Taric's heal. It's almost a waste of mana to use. It's obvious Rakan was designed around his W, E and R, and they just threw in Q to give him a fourth ability.","replies":[{"poster":"Sir Poodle","date":"2017-04-30T04:43:23.513+0000","up_votes":1,"down_votes":0,"body":"Nah, once you get to late game you can heal yourself and 2 other people and it's pretty powerful. Taric's heal is actually even more powerful- all 5 at once.\n\nPlus, even though it looks like poke, playing him a little, it feels like an incentive to go in and not just play super safe. I wouldn't say it's absolutely core, but waste of mana it is not.","replies":[]}]}]}]},{"poster":"crippler38","date":"2017-04-26T17:24:56.057+0000","up_votes":2,"down_votes":0,"body":"I love him, especially the fact that his scalings with AP are huge meaning I can get by with low amounts of Ap to make the shields strong with a standard support build.\n\nThe amount of times someone has gotten away thanks to a heal and a few shields by me is getting close to a dozen since I've been spamming him and it's a pretty great feeling.\n\nThat and his ability to run in, charm the backline then E back and charm the frontline for peel is pretty great.","replies":[]},{"poster":"kitcat300","date":"2017-04-26T15:05:18.903+0000","up_votes":2,"down_votes":0,"body":"Ehh, I think I'm playing him wrong.\n\nI think I have won just as many as I have lost so far with him, but none of my victories felt like I was a big contributor and more like I just got carried. \n\nFor starters, his laning phase seems, abysmal? When playing against him I was either Karma or Nami, and I just poked the poor basterd out of lane, or killed him. Playing as him myself, when I go in to engage, many of my lane partners are unable to follow up effectively, or they just choose not to, which means I just gave up a third of my health bar for nothing. \n\nAnd then there is the fact that his stats/scaling conflict his play style. One says build tank, the other says AP, and I cant figure out which I should be doing. \n\nThe guy can be fun, but I seem to just be bad as him.","replies":[{"poster":"Supreme Senpai69","date":"2017-04-27T13:58:41.398+0000","up_votes":1,"down_votes":0,"body":"I've noticed he can get to the enemy but his ADC can't get there nearly in enough time. I think he'd work better with Ezreal or Lucian honestly.","replies":[]},{"poster":"Morgan le Fey","date":"2017-04-26T16:20:27.501+0000","up_votes":1,"down_votes":0,"body":"Long-range poke makes his laning phase really rough, especially if it's from a champ with a lot of mobility. He definitely has some really hard lane counters. Laning against Ezreal is almost as painful as laning vs. Sona as Janna. He's really great against most tank supports who aren't Thresh, though, and immobile ADCs like Ashe are agony.\n\nEngaging is all about decisiveness and decision-making. He has a little bit of safety in that his trades (EWQW) are really similar to his hard engage (WR, QEW once W is back up), so it's not as disastrous if you engage and your ADC just ignores you. That said, you have to have a sufficiently aggressive ADC to really succeed - otherwise, the best you can do is to roam to mid early and go for a 3-man gank mid. It's a weird thing where your ADC has to be okay with waiting for you to engage, and then committing hard, and you in turn can't afford to be anything but the best deliberateness, confidence, decisiveness, and caution in your engages and time things properly. Mis-positioning is deadly.\n\nLeona and Braum come to mind immediately when it comes to skills required to play him, but you also have to have a certain mage-like understanding of your own mortality. Interestingly, having very strong Janna play is a great boon when playing him. My Janna is much weaker than it once was, but esp. her hard-engage ([E]FR) and peel take similar positioning, timing, and surety. They both value speed similarly, too.\n\nBuilding him is fun, honestly, but it takes a lot of game knowledge. He has so many options! You have to know exactly what you want in any given game. His passive gives him moments to trade or dive if he builds AP, which gives him a much more skirmish-y playstyle and long-term sustain, but building tank gives you more room for error on really hard dives. Utility goes well with him, but it also can put him in a very hard spot if he's not careful. I've not done much of the tank build, but otherwise in my experience the options are great.","replies":[{"poster":"It Hertz When IP","date":"2017-04-26T20:01:39.623+0000","up_votes":1,"down_votes":0,"body":"Except if Leona dives into the enemy bot and her ADC kind just waffles around, at least Leona can tank the retaliation damage while she backs out.","replies":[{"poster":"Morgan le Fey","date":"2017-04-26T22:37:00.069+0000","up_votes":1,"down_votes":0,"body":"That's the problem, yes. Definitely one of his biggest weaknesses, if not _the_ biggest. If your ADC doesn't run away and you don't get hard CCed or instantly bursted (lot of ifs) you can E out, but otherwise you're probably a bit screwed. Jungle ganks help a lot, of course, giving you another E target _and_ someone to use to trigger his Q instant-heal.\n\nIt's a problem out of lane, too. It's not just a laning issue. I don't care to count the number of times I've died to my ADC running away at the same speed as me and staying 10 units out of my E range. T.T","replies":[{"poster":"Kitty Pix","date":"2017-04-27T00:45:20.620+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Neddoreo,realm=NA,application-id=3ErqAdtq,discussion-id=PnjWA2Nz,comment-id=0008000000000000,timestamp=2017-04-26T22:37:00.069+0000)\n>\n> That&#x27;s the problem, yes. Definitely one of his biggest weaknesses, if not _the_ biggest. If your ADC doesn&#x27;t run away and you don&#x27;t get hard CCed or instantly bursted (lot of ifs) you can E out, but otherwise you&#x27;re probably a bit screwed. Jungle ganks help a lot, of course, giving you another E target _and_ someone to use to trigger his Q instant-heal.\n> \n> It&#x27;s a problem out of lane, too. It&#x27;s not just a laning issue. I don&#x27;t care to count the number of times I&#x27;ve died to my ADC running away at the same speed as me and staying 10 units out of my E range. T.T\n\nThat last bit you described was previously the Braum W-syndrome. No one ever wants to stand in hop range, and it's even bigger than Rakan's ally shield dash! Feelslobsterman","replies":[]}]}]}]},{"poster":"Mech0p","date":"2017-04-27T00:23:20.973+0000","up_votes":1,"down_votes":0,"body":"yea it would be nice if xayah got a buff playing with rakan like he does... Maybe  like a spd buff for xayah when he knocks them up or a dash like iverns... I find it a bit weird how only rakan gets the duo active where xayah doesntr get anything from him being in lane... On the flip side I'm glad they made them playable without each other and not like a kalista who can really only be played in one lane or else her ult is useless","replies":[]}]},{"poster":"Dokkaebi","date":"2017-04-26T12:11:15.229+0000","up_votes":3,"down_votes":2,"body":"People have different tastes. I got level 5 on him and it honestly got really boring.","replies":[]},{"poster":"Scien","date":"2017-04-26T18:53:52.576+0000","up_votes":2,"down_votes":1,"body":"In a meta full of Karma, Lulu, and Nami, a champ like Rakan is certainly refreshing. I've been enjoying him a lot so far (currently level 6).","replies":[]}]}