{"poster":"BaronofDreams","date":"2017-01-09T11:40:48.709+0000","title":"Client freezing during Champ Select","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":1,"body":"Like the title states, the past week my client has been freezing during champ select. Timer will go down to 0 then just stop. I've done a reinstall plus a repair before that and its still going on, lost 15ish lp now because of it.","replies":[{"poster":"Targons Blade","date":"2017-01-10T00:33:24.302+0000","up_votes":2,"down_votes":1,"body":"I typically see these symptoms pop up in champ select if there's an unstable connection between you and the matchmaking servers. Usually, this happens as a result of specific network settings being configured on your local network, so I'd recommend going through our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to ensure this isn't the case.\n\nPlease let me know if this resolved your issues in champ select or not.","replies":[]},{"poster":"fritsfrets","date":"2017-11-05T05:01:28.197+0000","up_votes":1,"down_votes":0,"body":"Same issue, like 1/5 games in champion select timers go 0 and no button works, like for example if I try to change heal to smite it just keeps loading it..  A lot of LP lost because of that, I guess over 200LP already. Also, I have no internet issues, everything on the internet at the same time works flawlessly.","replies":[]},{"poster":"N3rve","date":"2017-05-15T19:04:09.588+0000","up_votes":1,"down_votes":0,"body":"Like seriously? Are you kidding me riot? This is the second time today and the I don't know how many-eth time in weeks that my client has frozen in champ select, usually during banning. My connection is fine, my internet is not going down, but it is losing me LP and giving me queue timer punishments due to no fault of my own. If you're going to disable the legacy client and stick us on this shit, then for the love of god, at least have the damn thing be functional. Fix your stuff riot. This has been going on for months.","replies":[]},{"poster":"JGMatrix","date":"2017-04-13T06:38:31.303+0000","up_votes":1,"down_votes":0,"body":"I am having the same issue. I am losing LP because I can't lock in. Its stupid, I love this game, and I lose 3 lp every other game due to my client bugging out in champ select..","replies":[]}]}