{"poster":"Ollowain SF","date":"2016-11-02T11:33:29.159+0000","title":"Top-Laner [Gold+] für RankedTeam [Lazy] gesucht","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hi,\r\n\r\nunser Team [Lazy] bestehend aktuell aus 4 Stammspielern und 2 Substitutes. Leider musste unser Top-Laner studiumsbedingt seine Position freigeben und so suchen wir einen neuen Top-Laner [MAIN] um unser Team zu vervollst&auml;ndigen.\r\nZu uns:\r\nWir sind aktuell im Alter von 20-25 Jahren, sind sehr TS-affin. Shootcaller vorhanden. Uns pers&ouml;nlich ist Zuverl&auml;ssigkeit und Kommunikation sehr wichtig, da es nichts schlimmeres gibt, als Probleme eskalieren zu lassen, oder ewig auf einen Spieler warten zu m&uuml;ssen, wenn man das vorher einfach h&auml;tte kurz kl&auml;ren k&ouml;nnen. Aktuell gibt es im Team auch eine klare Linie f&uuml;r Champs und Combs mit Ziel nach vorn. Planung daf&uuml;r wird in Google-Docs. vorgenommen. Folglich sind wir nicht nur ein zusammengew&uuml;rfelter Haufen, sondern versuchen so fot es geht zusammen zu spielen und auch au&szlig;erhalb der festen Zeit da zu sein, wenn es die Zeit zul&auml;sst. Verpflichtungen in seinem Leben hat aber jeder und das ist auch gut so.\r\n\r\nWas wir uns w&uuml;nschen w&uuml;rden:\r\n\r\n*    Meta-entsprechenden Champion-Pool\r\n*    18+\r\n*    TS nicht nur als nervige Pflicht ansehen\r\n*    Zuverl&auml;ssigkeit in Sachen Absprachen [WhatsApp etc.]\r\n*    aktuelle Trainingstage werden dann neu angesetzt sobald das Team vollst&auml;ndig ist\r\n*    Engagement verschiedene Builds zu lernen und die Taktik im Team zu verbessern (e.g. Team-Combs)\r\n*    realistische Zielsetzung zwecks Fortschritt und Ein&uuml;ben versch. Champs + Combs\r\n\r\nFalls Ihr Interesse haben solltet, meldet euch am besten kurz und schreibt bitte kurz etwas dazu, damit wir uns ein Bild machen k&ouml;nnen, mit wem wir es grob zu tun haben.\r\n\r\nIch hoffe bis bald,\r\n\r\nOllowain SF","replies":[{"poster":"lRivenl","date":"2016-11-02T17:25:40.498+0000","up_votes":1,"down_votes":0,"body":"Hallo ich möchte mich mal bei euch bewerben,\nSuche aktuell ein rankedteam\nBin 18 jahre alt Gold 5, eig Riven main gehe aber der meta nach an,\nwürde mich freuen wenn wir in kontakt tretten.\n\nMfg lRivenl","replies":[]},{"poster":"Froozwnice","date":"2016-11-02T13:05:01.495+0000","up_votes":1,"down_votes":0,"body":"Was wir uns wünschen würden:\n\n    Meta-entsprechenden Champion-Pool\n    18+\n    TS nicht nur als nervige Pflicht ansehen\n    Zuverlässigkeit in Sachen Absprachen [WhatsApp etc.]\n    aktuelle Trainingstage werden dann neu angesetzt sobald das Team vollständig ist\n    Engagement verschiedene Builds zu lernen und die Taktik im Team zu verbessern (e.g. Team-Combs)\n    realistische Zielsetzung zwecks Fortschritt und Einüben versch. Champs + Combs\n\nIch Antworte einmal chronologisch hierzu.\n1. Die Meta ist für mich nichts festes, aber da ich Kennen, Rumble, Jayce oder Maokai derzeit in der \" Meta \" sehe, denke ich, dass ich diese Champions gut bis befridigend behersche.\n2. Ich erfülle das Mindestalter von 18 Jahren.\n3. Im TS könnte und würde ich ziemlich jeden Tag sein.\n4.Ich möchte noch viel lernen in LOL, weiß aber auch schon  einiges, ich hoffe das Ihr mich in eurem Team willkommen heißt und wir viel erreichen können. \nWürde mich über Rückmeldung freuen","replies":[]}]}