{"poster":"Ollowain SF","date":"2017-05-27T08:22:17.242+0000","title":"Team [LyKo] sucht Bot-Lane","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hallo an alle Suchenden da drau&szlig;en,\r\n\r\nUnser Team LyKo ist aktuell auf der Suche nach einer Bot-Lane, bevorzugt eingespielte/sich kennende Spieler. Es gab einige personelle Umstrukturierungen, nach absehbaren &Auml;nderungen im realen Leben.\r\n\r\nF&uuml;r uns ist es sehr wichtig, dass die Sache auf menschlicher Ebene stimmt, denn es wird im Team nicht immer alles rund laufen oder wie man es sich vorstellt. Gr&uuml;nde daf&uuml;r sind zahlreich aber manchmal nicht zu verhindern. Folglich suchen wir jemanden der aktiv das Team mitgestaltet und nicht nur mit der Masse mitschwimmt und beim erst besten Problem verschwindet.\r\n\r\nFragt euch bitte bevor ihr anfragt, ob das eure Vorstellungen sind, oder ihr doch eher auf der Suche nach der schnellen Nummer in Richtung Team seid.\r\n\r\nDann kurz zu uns:\r\n- Team besteht seit guten 8 Monaten\r\n- aktuell G5-P5\r\n- sehr kommunikativ im Messenger und TS\r\n- 20-25 Jahre\r\n- Trainingszeiten aktuell So u. Mi. (genaueres l&auml;sst sich absprechen)\r\n- 2 Substitutes f&uuml;r Ausf&auml;lle bzw. Terminproblemen\r\n\r\nWas suchen wir:\r\nADC + Sup\r\n- 18+\r\n- Elo zw. Gold und Platin\r\n- TS etc sollte selbstverst&auml;ndlich sein\r\n- entpr. Metapool bedienen k&ouml;nnen\r\n- Engagement f&uuml;r Turniere etc.\r\n\r\nTryout: Ist f&uuml;r Sonntag Abend ab 18 Uhr geplant. N&auml;heres dann nach individueller Absprache!\r\n\r\nFalls ihr Interesse haben solltet meldet euch bei: Bin ab ca. 15 Uhr online, also nicht wundern wenn vorher keine Antwort kommt. Und bitte nicht einfach adden und hoffen ich schreibe euch. Am besten kurz etweas zu euch schreiben.\r\n\r\nOllowain SF","replies":[{"poster":"ΞΩωΩΞ","date":"2017-06-08T14:02:16.300+0000","up_votes":0,"down_votes":0,"body":"Hallo Ollowain,\n\nsie habe, dank ihrer Stellen anfrage, mir eine große Interesse an eurem Team gebracht. \nIch hatte schon immer davon geträumt in einen \"kompetitiven Team\" beizutreten. \nUnd Würde somit um den Beitritt eurem Team anfragen.\n\n\n\n    Mein Profil: \n-Supp Main/(flexibel)\n-17 Jahre\n-Diamant 5 in Soloq \n-TS, Skype und Discord\n-Großer Champ Pool (Fehlen 10 Champs die nicht Meta sind)\n-Lernbereitschaft\n\nIch würde gerne die Rolle des Supporters übernehmen. Ich bin ziemlich flexibel und kann auch an alle anderen Lanes Carrien.\n\nIch habe überlängere Zeit mehr Freiraum im Thema Arbeit und Freizeit. Somit kann ich mit hocher Wahrscheinlichkeit an jeder der Trainingszeiten zur Stelle sein.\n\nWenn Ich Ihre Interesse an mir geweckt habe, bitte schicken Sie mir eine Freundschaftsanfrage und Schreiben Sie mich an.\n\nIch würde mich aus ganzem Herzen darüber freuen.\n\n\nMit schönen Grüßen Ihr Beschwörer\n\n\n\nMyrut","replies":[]}]}