{"poster":"plantaVoladora","date":"2017-09-11T06:00:33.441+0000","title":"se puede recuperar una cuenta permabaneada?","subforum":"Problemas Técnicos","up_votes":1,"down_votes":9,"body":"llevo 2 a&ntilde;os jugando league of legend, reconozco que en algun momento dije algo molesto para las personas, pero no era algo reiterativo, aparte he invertido muchos dolares en el juego y quiero seguir jugando obviamente, y muchas de las veces que &quot;flameo&quot; son respondiendo el flameo ajeno, queiro saber si puedo recuperarla o k, no creo que sean tan basuras para banear asi como asi","replies":[{"poster":"FurchiDC","date":"2017-09-11T06:17:12.239+0000","up_votes":5,"down_votes":1,"body":">_\"queiro saber si puedo recuperarla o k\"\n\nLamentablemente no. No importa qué tanto hayas invertido, es irrelevante. La única forma de recuperar tu cuenta es si el baneo fue por una cancelación de compra de tu tarjeta de crédito, que no parece el caso.\n\n>_\"muchas de las veces que \"flameo\" son respondiendo el flameo ajeno\"_\n\nNo es excusa válida. Cuando te reportan el sistema te evalúa a vos, no a los demás. Espero que esta sanción te sirva como aprendizaje y si volvés a jugar con una cuenta nueva, no te fijes en cómo se comportan los demás, si no en vos mismo. Muteá a todos, jugá, sé positivo, y si hay alguna persona negativa la reportás sin decir nada. \n\n>_\"no creo que sean tan basuras para banear asi como asi\"\n\nPara nada. Si te banearon es porque hay una razón válida. Los casos de equivocación son muy escasos y puntuales. \n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[{"poster":"Deterok","date":"2017-09-11T06:40:47.071+0000","up_votes":2,"down_votes":0,"body":"Excelente respuesta FurchiDC, como todas {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"FurchiDC","date":"2017-09-11T06:43:37.733+0000","up_votes":1,"down_votes":1,"body":"¡Gracias Salvatore!\n\nhttps://k60.kn3.net/taringa/4/F/2/7/D/B/YerardGallego/8F1.gif\n\n[](http://.)\n[](http://.)\n_________________________________\n>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;http://i.imgur.com/2GnAbBM.png?noredirect\n>#&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;**Saludos**","replies":[]}]}]},{"poster":"TSW Rorschach","date":"2017-09-11T06:22:00.503+0000","up_votes":4,"down_votes":1,"body":"1-Flammear es flammear, no lo justifica que te hayan insultado a vos previamente, eso no te saca la culpa de algo que se sabe que no se tiene que hacer.\n\n2-Que inviertas dinero en el juego tampoco es una razón para devolverte la cuenta, está en el contrato al que todos le ponemos \"De acuerdo\" sin leer.\n\nSe banea lo justo: Si insultaste y el permaban fue por esa razón, **no hay forma alguna de que se pueda recuperar dicha cuenta**, ya que tus propias acciones hicieron que la perdieras.\n\nQueda crearte una cuenta nueva y empezar de cero, caso de que quieras seguir jugando. \n\n> no creo que sean tan basuras para banear asi como asi\n\nEs cosa de hacerte cargo de tus propias acciones, más que quejarte por un castigo merecido, diría yo.","replies":[]},{"poster":"Hendrix","date":"2017-09-11T11:56:16.641+0000","up_votes":2,"down_votes":0,"body":"Todavia no se si esta clase de post la hacen con la esperanza de recuperar la cuenta o solo para que los que los hemos padecido en algun momento podamos divertirnos un rato\n\nSuerte con la cuenta nueva!","replies":[]},{"poster":"Caap Buscapina","date":"2017-09-11T07:11:14.144+0000","up_votes":2,"down_votes":0,"body":"Me toco una partida ranked con vos y tu premade , sos muy flamer muuuuuy molesto, flamearon los 40 minutos que duro la partida al team , me acuerdo bien de tu nombre por que al final de la partida dijiste mejor un \"flamer pro\" que un manco calladito como vos.Que bueno saber que si funciona el sistema de baneo por que hasta ahora lo dudaba mucho.","replies":[]},{"poster":"Nozarashi","date":"2017-09-11T11:27:05.563+0000","up_votes":2,"down_votes":1,"body":"Un toxico menos.\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"RedKi","date":"2017-09-11T16:50:47.379+0000","up_votes":1,"down_votes":0,"body":"ññiñiñiñiñiñiiii mi cuenta, gasté mucho dinero ñiñiñiñiñiñii","replies":[]},{"poster":"ZyXEL 001","date":"2017-09-11T06:23:18.201+0000","up_votes":1,"down_votes":1,"body":"Existen las plantas voladoras?\n\nEso contesta tu pregunta.","replies":[]}]}