{"poster":"THeDarkPRayer188","date":"2019-01-08T20:50:26.799+0000","title":"silber noob braucht hilfe","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hey ich bin Silber 3 zuzeit komme locker auf Silber 2 aber danach nicht mehr weiter suche jemanden der mir helfen kann aus silber zu kommen ( kein boosten sondern mir sachen beibringen das ich auf plat komme und das verdient )","replies":[{"poster":"Skagerak","date":"2019-01-09T12:58:33.500+0000","up_votes":1,"down_votes":0,"body":"Ich würde dir am ehesten https://koreanbuilds.net/ empfehlen. Da ist immer der beste koreanische Spieler für den jeweiligen Champion angezeigt mit Runen etc und das wird jeden Patch neu aktualisiert. So hast du immer die besten Runen und Items für den jeweiligen Champion von den besten Spielern der Welt.\n\nAnsonsten kann ich dir schon den alleinigen Grund nennen warum du noch kein Gold bist. Du hast keine main lane und keine main Champions. Wenn du nur Mitte oder ADC spielen würdest (sind die Rollen wo du die höchste Winrate hast) mit 2-3 Champions dann wärst du schon längst Gold ohne Probleme. Ich mein selbst mit dieser Spielweise hast du sogar noch ne 54% winrate du könntest also selbst so auf Dauer aufsteigen wenn du mehr ranked spielen würdste dauert eben nur viel länger. Ansonsten solltest du vielleicht etwas mehr ranked spielen und nicht so viele normals weil du dich im ranked schneller verbesserst. \n\nSo an sich hast du gute Voraussetzungen um aufzusteigen, du schaust dir Videos an und versuchst dich aktiv zu verbessern und nicht nur durch Zocken. Du weißt gar nicht  wie viel das bringt, du lernst wahrscheinlich durch 1 Lernvideo zu LoL soviel wie in 100 games selbst spielen. Du musst also weitaus weniger Zeit investieren. Ansonsten das Farmen weiter üben, und die generellen Grundmechanicken  von LoL auch. Dann noch weniger Champions spielen welche nicht so mechanisch schwer sind (Ekko ist z.B schon ne sehr gute Wahl und dann eben noch Einen höchstens Zwei) auf einer main Rolle und dann kann das climben beginnen.\n\nDas Hauptproblem bei fast jedem Low Elo Spieler ist es das Sie keine main rolle oder Champions haben das alleine würde bei den meisten schon ausreichen um Gold zu kommen. Ist eben für viele langweilig weswegen Sie dann 50 verschiedene Champions spielen und in der Low Elo Stucken.","replies":[{"poster":"OT Riku","date":"2019-01-12T07:41:21.481+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skagerak,realm=EUW,application-id=vatevpvi,discussion-id=xmO05AwY,comment-id=0002,timestamp=2019-01-09T12:58:33.500+0000)\n>\n> Ich würde dir am ehesten https://koreanbuilds.net/ empfehlen. Da ist immer der beste koreanische Spieler für den jeweiligen Champion angezeigt mit Runen etc und das wird jeden Patch neu aktualisiert. So hast du immer die besten Runen und Items für den jeweiligen Champion von den besten Spielern der Welt.\n> \n\nNaja ist zwar ganz cool einen Hinweis zu bekommen. \nAber Runen 1 zu 1 übernehmen ist nie richtig genau wie itembuilds.\nWenn ich auf der Seite Talon  meinen Main anschaue, dann nimmt der Spieler Nullyfinig Orb und 2 mal adaptive Kraft und 1 mal Mr mit.\nGegen ein Heavy AP Team macht das schon sehr viel Sinn. \nAber gegen heavy AD Teams würde ich es nicht empfehlen.\n\nWas du geschrieben hast ist aber zum generellen anschauen nicht verkehrt und absolut richtig. \nNur leider habe ich die Erfahrung gemacht, daß Menschen es sich gerne leicht machen und nicht viel selbst denken wollen.\nDeswegen habe ich das hier noch beigefügt.","replies":[]}]},{"poster":"DrakoniaDRK","date":"2019-01-09T11:12:12.348+0000","up_votes":1,"down_votes":0,"body":"Ich kann Dir dieses Video empfehlen von Silphi:\n\nhttps://www.youtube.com/watch?v=GBt0GWdQjDE&index=3&t=1s&list=FLm-ZK1sDmndE_n4mvnB9dKw","replies":[{"poster":"THeDarkPRayer188","date":"2019-01-09T11:51:53.212+0000","up_votes":1,"down_votes":0,"body":"Das habe ich schon angeschaut hab fast jedesvideo geschaut von ihm","replies":[]}]},{"poster":"DiamondYasuo","date":"2019-01-09T10:20:55.184+0000","up_votes":1,"down_votes":0,"body":"Wo hapert es denn? Eher bei den Mechanics oder beim Makro?","replies":[{"poster":"THeDarkPRayer188","date":"2019-01-09T10:33:20.584+0000","up_votes":1,"down_votes":0,"body":"Ich glaube bei den Mechaniks kann ich besser werden aber das ist sicher nicht das Hauptproblem. Eher wie ich das spiel carrien kann aleine und wie gewinne ich meine lane zu 100%.\nIch spiele am anfang zu save oder zu agressive und bekomme aufs maul.\nMeine main champions sind auch nicht gerade die besten fūr teamfights oder zum carrien auf low elo.\nWards stelle ich regelmässig hind und an den richtigen spots ( silphi playershub von dort habe ich sie kopiert) der farm ist am anfang ganz okey und je länger das spiel geht umso schlechter wird der farm.\nIch versuche zu oft mein team zu retten","replies":[]}]}]}