{"poster":"CLG Factor","date":"2015-06-13T03:34:04.117+0000","title":"stuck in bronze cuz im bad","subforum":"Tips & Tricks","up_votes":1,"down_votes":0,"body":"how do I play something other than annie mid and jungle fizz?","replies":[{"poster":"Riot 10YearSanta","date":"2015-06-13T08:01:10.280+0000","up_votes":3,"down_votes":0,"body":"The first thing I do with a new game is play all the different stuff I can.  Then I learn not only who I like to play the most, but also the way that I like to play the most.  I'm playing all the champs in each role/lane in alphabetical order right now (in blind pick) and my mmr has dropped like a rock, lol.  But that's OK because I'm finding out that I like people I didn't think I'd like (ahri) and disliking people I thought I'd like (thresh).  You'll find that some champs will just \"make sense\" to you, and those are the champs you should start spamming.\n\nThere's a secondary benefit to playing through everyone in the game too, and that is that you understand what they do, so you know how to not only counter them better, but also work with them better when your teammates play them.  Truly understanding what each champion is capable of is probably enough to pull you into silver.\n\nAs you're going through this, work on fundamentals - cs and map awareness.  Once you know who you like to play, take the time to [learn to cs with them](https://www.reddit.com/r/leagueoflegends/comments/204xyb/learn_to_cs_like_a_challenger_with_elyndar_a/)  CSing with poppy is very different than csing with Varus for example.\n\nMap awareness though, that is the same no matter who you are.  So you can work on that the entire time you're playing.  When you're about to engage, look at the map.  When you disengage, look at the map.  When your spells are on cooldown, look at the map.  When you're walking back to lane, look at the map.  Every time you don't actually need to be looking directly in front of you, look at the map.\n\nIf you do the above, you're probably going to hit gold.","replies":[]},{"poster":"The Ellimiist","date":"2015-06-13T09:13:35.883+0000","up_votes":2,"down_votes":0,"body":"biggest thing I can say about bronze is learn cooldowns and damage of every skill. Most fights in lower mmr is 2 people who don't even truly know if they can kill the other person or not. Some champs like zed/fizz/darius etc are alot stronger when you aren't keeping track of shadow/pole cooldowns and knowing when you can harass.\n\nFirst step should be learning what every champion does exactly, cooldowns and damage, I swear you can get to gold with just this knowledge. If you don't own all the champs to play them all (and aren't in region with PBE) then at least wiki the enemy team during loading/champ select.","replies":[]},{"poster":"M0N0SHIN0","date":"2015-06-13T05:50:56.927+0000","up_votes":2,"down_votes":1,"body":"by playing jungle annie and support fizz of course","replies":[]}]}