{"poster":"TheNthDimention","date":"2018-02-16T20:24:42.206+0000","title":"Rammus","subforum":"Gameplay","up_votes":2,"down_votes":0,"body":"Rammus&#039;s early game is too weak. Sure his late game is great, he&#039;s a fantastic tank. But the fucking games are all surrender at 20 now because of how fast snowballing is, so Rammus will never get to see his late game anymore. He gets bullied too easily early on. The enemy jungler will constantly steal his buffs or kill him early on because he knows how weak the Rummus is before he&#039;s geared. Compare Udyr or Hecariam who can each clear the entire jungle before Rammus finishes his second camp. His early game could use some help.","replies":[{"poster":"Peritheus","date":"2018-02-16T20:41:15.513+0000","up_votes":1,"down_votes":0,"body":"Are your teammates not blocking the routes to his other jg buff early game? Is the rammus not ganking as soon as his red/blue buff taken cause his lvl 2 is reallly realllllllly strong enough to put pressure on your lanes enough to be 1st blood or wasted sums then like a seabear loop back again constantly ganking a hypercarry lane so if he gets strong enough to clear the jungle?","replies":[{"poster":"TheNthDimention","date":"2018-02-16T20:55:14.442+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Peritheus,realm=NA,application-id=3ErqAdtq,discussion-id=tg6gEQAO,comment-id=0000,timestamp=2018-02-16T20:41:15.513+0000)\n>\n> Are your teammates not blocking the routes to his other jg buff early game?\n\nNever. I can ping all day long, they will never ward or guard the other buff for me. I don't get matched with teammates anymore.","replies":[{"poster":"Merevel","date":"2018-02-17T00:24:23.398+0000","up_votes":1,"down_votes":0,"body":"I barely play rammas and find him one of the easier junglers. He tends to fall a little late game for me.","replies":[]}]}]},{"poster":"TheProfezzor","date":"2018-02-17T01:11:35.304+0000","up_votes":1,"down_votes":0,"body":"Yeah no.","replies":[]},{"poster":"heroikc","date":"2018-02-16T21:17:54.479+0000","up_votes":1,"down_votes":0,"body":"I got a level two first blood as Rammus top lane once...I don't see how it can't be done in jungle.","replies":[]}]}