{"poster":"kuepps","date":"2015-08-07T10:01:23.379+0000","title":"Allrounder (Gold-Elo) sucht Team für Teamranked","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hi Leute,\r\n\r\nEinleitung/Hintergrund:\r\nWie viele andere vermutlich auch, bin ich gelangweilt von Trolls/AFKs/Toxic people in der SoloQ. Auch davon, dass dort nur SoloQ-Picks funktionieren und in den seltendsten F&auml;llen eine Team-Synergie hergestellt werden kann. Deshalb m&ouml;chte ich - gerade weil LoL nun einmal so ein sch&ouml;nes Teamgame ist - das Spiel gerne so spielen, wie es gespielt werden soll. N&auml;mlich mit **netten Mates**, mit denen man **Comps erstellen** und **ingame Taktiken besprechen** kann. Das ist f&uuml;r mich die K&ouml;nigsdisziplin, und daher suche ich hier ein Team. :)\r\n\r\nZu meiner Person:\r\n- ich bin **26 Jahre** alt\r\n- berufst&auml;tig\r\n- aus NRW/Ruhrpott (mich gibts nur mit &quot;dat&quot; und &quot;wat&quot;)\r\n- ruhig/freundlich (was aber nicht hei&szlig;t, dass ich nicht auch mal fluche wenn ich mich &auml;rgere) ;)\r\n- Freund von Sarkasmus und schwarzem Humor\r\n\r\nZu meinem Account:\r\n- ingame Name: **kuepps**\r\n- spiele seit 3-4 Jahren LoL\r\n- wenn ich eine **Main-Lane** nominieren m&uuml;sste, w&auml;re das die **Botlane**. Habe gerade zum Anfang sehr viel ADC gespielt. In den letzten Monaten habe ich aber auf jeder Lane meine Hand voll Champs, die ich beherrsche und auch die Matchups kenne. Mir ging diese &quot;mid or afk&quot;-Mentalit&auml;t in der SoloQ auf die Nerven, weswegen ich den Ergeiz hatte auf jeder Lane gut klarzukommen. Deswegen w&uuml;rde ich mich eher als **Allrounder** bezeichnen, wie im Titel zu lesen ist. In der SoloQ spiele ich immer was das Team gerade ben&ouml;tigt; m&ouml;chte dass sich alle auf ihren Positionen wohl f&uuml;hlen.\r\n- mein Ranking von stark bis schwach w&auml;re so: **ADC &gt; SUP &gt; MID &gt; TOP &gt; JGL**\r\n- h&ouml;chste Einstufung: **Gold I** (aktuell **Gold IV**, komme aktuell aus dem Gold-Keller nicht heraus (siehe erster Satz der Einleitung)) ;)\r\n\r\nBevorzugte Champions (aktuell):\r\n**ADC:** Caitlyn, Tristana, Corki, Sivir, Ashe, Jinx\r\n**SUP:** Nautilus, Leona, Morgana, Janna, Braum\r\n**MID:** Diana, KogMaw, Lulu, Morgana, Cassiopeia Ahri\r\n**TOP:** Gnar, Maokai, Mundo, Lulu\r\n**JGL:** Sejuani, Zac, RekSai, Diana, Nidalee, Amumu\r\n\r\n**ICH SUCHE:**\r\n- ein Team f&uuml;r Teamranked\r\n- Elo plus/minus Gold\r\n- Mitglieder sollten circa im Bereich zwischen 20-35 Jahre sein\r\n- ich bin nicht unbedingt ein Freund von festen Spieltagen (da im Privatleben ja auch immer kurzfristig mal was sein kann). Ich f&auml;nde es am angenehmsten, wenn einfach ein paar aktive Spieler im Team w&auml;ren, die sich auch spontan zum RankedGame zusammen finden k&ouml;nnen :)\r\n- einen TS Server h&auml;tte ich zur Not auch, den man benutzen k&ouml;nnte\r\n- ihr solltet haupts&auml;chlich Spa&szlig; an der Sache haben, aber das Game schon &quot;ernst&quot; nehmen (ich meine damit nicht todernst, sondern einfach mit einem gewissen Ansporn, ohne dabei gleich mad zu werden wenn jemand mal einen Fehler macht)\r\n\r\nDanke f&uuml;r die Aufmerksamkeit, freue mich auf eure Nachrichten! :)\r\n\r\nPS: Falls ihr noch jemanden braucht, h&auml;tte ich noch einen guten Freund von mir (30 Jahre, main mid/sup), den ich bestimmt dazu &uuml;berreden k&ouml;nnte. Wir spielen eigentlich fast t&auml;glich zusammen.\r\n\r\nBeste Gr&uuml;&szlig;e,\r\nk&uuml;pps","replies":[{"poster":"Sophie973","date":"2015-08-07T10:36:24.944+0000","up_votes":1,"down_votes":0,"body":"Ich würde gerne, aber ich finde es nicht gut, dass man eine Elo begrenzung bzw eine Altersbegrenzung dort macht. Weil das können und das naja \"Angenehm \" sein hängt eben nicht vom Alter bzw der Elo ab ^^\n\n\nEDIT: Ich bin auch Allrounder, wobei Adc meine schwächste und Support + Top meine beste position ist :D","replies":[{"poster":"Babe Itz So Big","date":"2015-08-07T10:51:17.369+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=fanum85,realm=EUW,application-id=ElKI1ocy,discussion-id=LaRYRKAs,comment-id=0001,timestamp=2015-08-07T10:36:24.944+0000)\n>\n> Ich würde gerne, aber ich finde es nicht gut, dass man eine Elo begrenzung bzw eine Altersbegrenzung dort macht. Weil das können und das naja \"Angenehm \" sein hängt eben nicht vom Alter bzw der Elo ab ^^\n> \n> \n> EDIT: Ich bin auch Allrounder, wobei Adc meine schwächste und Support + Top meine beste position ist :D\n\nIch habe mit meinem Zitat meines Gesuchs auf den Post des Threaderstellers geantworted.\n\n:D\n\nWo die Elo- und Altersbegrenzung leider nicht passen (glaub mir, dass ich aus Erfahrung sagen kann, dass es meistens sinnvoll ist, vor allem, wenn man nicht nur \"just 4 fun\" spielt, um mal eben die Teamranked Belohnungen einzuhamstern), greift bei dir leider die Levelmindestgrenze: \n\nDu kannst erst ab Level 30 Teamrankeds spielen. \nIch nehme an dir fehlen bis LvL 30 auch noch ne Menge an Runen, Hintergrundinfos, Taktikverständnis & Champsknowledge und sicher auch die competitive Spielerfahrung in einer Teamsynergie.\n\nDas ist jetzt nicht böse gemeint, weil das war bei mir immerhin genauso.\n\nLG, Yihu","replies":[{"poster":"Sophie973","date":"2015-08-07T11:04:32.078+0000","up_votes":1,"down_votes":0,"body":"Haha ich weiß eine menge über LoL, das ist es nicht was mir fehlt, mir fehlt bloß ein Team mit dem ich spielen kann, weil mir die ganzen Flamer und afkler/Troller auf die nerven gehen ^^\n\nUnd weil man dadurch erst überhaupt LoL spielen kann ^^","replies":[{"poster":"Babe Itz So Big","date":"2015-08-07T11:29:01.765+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=fanum85,realm=EUW,application-id=ElKI1ocy,discussion-id=LaRYRKAs,comment-id=000100000000,timestamp=2015-08-07T11:04:32.078+0000)\n>\n> Haha ich weiß eine menge über LoL, das ist es nicht was mir fehlt, mir fehlt bloß ein Team mit dem ich spielen kann, weil mir die ganzen Flamer und afkler/Troller auf die nerven gehen ^^\n> \n> Und weil man dadurch erst überhaupt LoL spielen kann ^^\n\nDann solltest du dir ein \"Team\" in deinem Levelbereich suchen oder eines zusammen stellen.\n\nMfG, Yihu","replies":[{"poster":"Sophie973","date":"2015-08-07T11:48:06.460+0000","up_votes":1,"down_votes":0,"body":"Woher weißt du denn mein level bereich? ^^","replies":[{"poster":"Babe Itz So Big","date":"2015-08-07T16:02:09.580+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=fanum85,realm=EUW,application-id=ElKI1ocy,discussion-id=LaRYRKAs,comment-id=00010000000000000000,timestamp=2015-08-07T11:48:06.460+0000)\n>\n> Woher weißt du denn mein level bereich? ^^\n\nDa du so viel über LoL weißt :D rate doch mal. \n\nDer Account mit dem du im Forum schreibst ist LvL 26.\nIm Normal 5vs5 hast du 83 Wins mit insgesamt 790 Kills & 1849 Assists. Du hast in diesem Modus 86 Türme zerstört und 13.622 Minions getötet.\nVor 22 Minuten hast du mit Heimerdinger ein Aram verloren. \nDein Lieblingschamp ist Gnar mit einer winrate von 64%\n\nUnd du spielst die meisten Spiele mit einem Mate namens BiggestHuxxxxx und Richexxxxx (Namecalling ist verboten, daher die X)\nBiggestHuxxxxxx ist LvL 28 und gewinnt nur 25% seiner Overall Games. Sein Lieblingschamp ist Yasuo mit einer winrate von 36%\nRichexxxxxxx ist LvL 21 und gewinnt 40% seiner overall games. Sein Lieblingschamp ist Vlad mit einer winrate von 62%\n\nWenn du kein Smurf bist, der sich ein wenig wichtig machen will, dann überlegst du jetzt mal bitte.\n\nDanke.","replies":[]}]}]}]}]}]},{"poster":"Babe Itz So Big","date":"2015-08-07T10:12:12.705+0000","up_votes":1,"down_votes":0,"body":"Hallo :D\n\n\nWir suchen gerade nach einem Allrounder/Ersatz für unser Team, allerdings haben wir mehr oder weniger feste Termine. Lies dir das einfach mal durch und dann kannst du dich ja entscheiden, ob es was für dich wäre (und evtl. deinem Kumpel, können ja nicht immer alle spielen), achso wir sind zwischen 19 - 31 Jahre alt:\n\n> Für unser bestehendes Team suchen wir noch nach einem kleinen \"Allrounder\"\n> mit Focus Sup/ADC ab Silber 1 / Gold als Springer / Ersatz (näheres per PN im Forum).\n> \n> Was du mitbringen musst ist Spaß am Spiel und folgende Kriterien:\n> \n> Voraussetzungen:\n> \n>     Du solltest mind. 16 Jahre alt sein.\n>     Kein Flamer, konstruktiv kritsich ist erwünscht.\n>     Man sollte sich auf dich verlassen können (!)\n>     Elo hohes Silber bis Platin (sind derzeit Gold - Platin)\n>     Du solltest einmal pro Woche fähig sein Termine im Teamforum zu bestätigen oder abzulehnen & ggf. eine Zu- oder Absage früh genug revidieren können.\n>     Interesse an kleineren \"Amateurturnieren\" haben.\n>     Spaß daran haben evtl. eine Turnieranmeldung oder ähnliches zu organisieren.\n> \n> \n> Zu uns:\n> \n> Wir bespielen unser Team (derzeit Sil1) aus Spaß an der Freude, jedoch wollen wir schon stetig voran schreiten und haben gewisse Ziele,\n> die allerdings realistisch gesteckt sind (u.a. kleinere Amateurturniere bestreiten, mit dem Team in Gold aufsteigen etc.) Allen voran hat bei uns der\n> \"competitive\" Spielspaß vorang und wir versuchen dem auch gerecht zu werden. Aktuell haben wir drei feste Termine für das wöchentliche ranked\n> Gezocke und einen sporadischen (Anmeldungen via Forum werden bevorzugt, sollten einmal mehrere Leute aus dem Team online sein und Zeit haben).\n> \n> Wenn du Lust hast und die o.g. Kriterien auch erfüllst und zu uns passt, würden wir uns über ein paar Probegames freuen.\n> \n> Bei Interesse oder wenn noch Fragen offen sind und/oder etwas unklar sein sollte, dann schreib bitte hier im Anschluss oder eine PN an mich oder xXBruciucXx ( http://greenhell.xobor.de/ )\n> \n> Danke für dein Gehör, Yihu","replies":[{"poster":"kuepps","date":"2015-08-07T11:14:37.070+0000","up_votes":1,"down_votes":0,"body":"Hi Yihu,\n\nhätte schon Interesse, aber was genau heißt \"Ersatz\", bzw. wie oft kommt es vor, dass ihr darauf zurückgreifen müsst? Ich suche schon nach einem Team, in dem ich regelmäßig spielen kann, und nicht nur wenn gerade mal einer seine Tage hat. :D\n\nGrüße,\nPhil","replies":[{"poster":"Babe Itz So Big","date":"2015-08-07T11:25:49.864+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=kuepps,realm=EUW,application-id=ElKI1ocy,discussion-id=LaRYRKAs,comment-id=00000000,timestamp=2015-08-07T11:14:37.070+0000)\n>\n> Hi Yihu,\n> \n> hätte schon Interesse, aber was genau heißt \"Ersatz\", bzw. wie oft kommt es vor, dass ihr darauf zurückgreifen müsst? Ich suche schon nach einem Team, in dem ich regelmäßig spielen kann, und nicht nur wenn gerade mal einer seine Tage hat. :D\n> \n> Grüße,\n> Phil\n\nErsatz im Sinne von Lane auffüllen als Springer :D\nAlso dass du quasi nicht immer Sup, oder ADC oder MID bist.\n\nIch denke du wirst auch nicht an allen 4 Tagen immer Zeit und/oder Lust haben zu spielen.\nSporadisch kann man natürlich immer ein Ranked starten.\n\nMfG, Yihu","replies":[]}]}]}]}