{"poster":"Joly0","date":"2016-01-14T23:06:10.208+0000","title":"Erst richtig gut, dann ultra schlecht","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Kennt das jemand: Ihr spielt ranked games, seid wirklich gut und seid mehr als 2 stufen aufgestiegen, ihr seid gerade dabei die serie f&uuml;r das 3 mal zu erledigen und bumm, ihr verkackt das. Ihr denkt euch egal, mache ich halt das ganze nochmal, habe es ja schonmal geschafft. Aber aufeinmal bekommt ihr nur noch noobs im team die ragen und meckern und die ganze zeit afk sind, egal wie gut ihr seid, auch wenn ihr eine mf mit 25/1 seid, ihr gewinnt einfach nurnoch jedes 5 game und so steigt ihr ab, bis ihr eine ganze elo absteigt, und da geht das weiter, weil die leute halt nicht auf dem level sind, was ihr seid und du auch nicht an das level gew&ouml;hnt bist. Ihr gebt euch echt m&uuml;he, aber es will einfach nicht klappen. Also, wer kennt das? Liegt das nur an mir, oder vergibt rito automatisch schlechtere mitspieler and richtig gute spieler um diese in grenzen zu halten? irgendwie habe ich das gef&uuml;hl....","replies":[{"poster":"Powerjen","date":"2016-01-15T06:47:52.395+0000","up_votes":3,"down_votes":0,"body":"Ich erlebe es gerade in ARAM. Vor dem Poro-Event habe ich mir einen Vorsprung von 25 Siegen herausgespielt. Der ist in den letzten 7 Tagen auf gerade mal 5 Siege geschrumpft. Ich will das nicht auf meine Mates schieben, jedenfalls nicht das spielerische, da läuft es bei mir auch nicht immer.\nWas mich aber maßlos ärgert, sind Leute, die von Beginn an afk sind oder mittendrin immer wieder DC kriegen. Von dem Kaliber hatte ich gefühlt in 80 % der verlorenen Spiele jemanden bei mir, gestern wieder in 4 Spielen in Folge (ist schon komisch, wenn Janna mehr Kills als Poppy hat...). Da kann sich kein kontinuierlicher Spielfluss aufbauen. Dann ist mir ein einem meiner Spiele (vor ein paar Tagen) ein Account aufgefallen, der zumindest zeitweise seinem Champ offenbar nur \"zusieht\". Den habe ich reported, mal sehen was da rauskommt.\n\nUm jetzt dem TE direkt zu antworten: Auch Deine Leistung ist keine Konstante, sondern hängt von vielen Faktoren ab. Tagesform von Dir, Deinen Mates, dem Gegner. Dem MMR-System wohnt auch eine gewisse Trägheit inne. Da Du offenbar recht schnell viele Siege hattest, bist Du nach Erreichen einer kritischen Schwelle mit Spielern gematcht worden, die auf einmal erheblich besser spielen als noch 2 Spiele zuvor. Jetzt musst Du Dich also neu bewähren und zahlst offenbar massiv Lehrgeld. Mit der Zeit sollten aber die Ausschläge weniger heftig werden und Du findest Dich dann auf Deinem ELO-Level ein. Deine Mates und der Gegner sind übrigens in etwa auf Deinem Leistungsniveau, sonst wäre das Matchmaking krass ungenau.","replies":[]},{"poster":"BajaminBlümchen","date":"2016-01-15T05:08:05.954+0000","up_votes":3,"down_votes":0,"body":"Kommt vor einfach nicht aufgeben. Man kann nicht alle games gewinnen aber mehr als 50% sind drin und reichen aus.\nJeder hat mal ne schlechte phase mitm Loss Streak uvm, nutz dies einfach um aus den losses zu lernen denn Fehler\nmacht man in jedem Game","replies":[]},{"poster":"Ireliα","date":"2016-01-18T15:11:12.276+0000","up_votes":1,"down_votes":0,"body":"Überarbeite bitte deine Runen ...\n\nChampion.gg\nprobuilds.net\n\nJeweils den Champion Namen eingeben und sich was heraussuchen, das wird es dir schon deutlich einfacher machen.","replies":[]},{"poster":"Alustus","date":"2016-01-15T11:04:49.620+0000","up_votes":1,"down_votes":1,"body":"Du steigst also ab weil deine gegner schlechter sind als du? interessant.\n\nDas hast du nämlich indirekt gesagt.\n\n\n> Liegt das nur an mir, oder vergibt rito automatisch schlechtere mitspieler and richtig gute spieler um diese in grenzen zu halten? \n\nNein.\n\nAber die subjektive wahrnehmung unterscheidet sich oftmals sehr stark von einer obejktiven wahrnehmung.\nIch würde wenn ich es nicht besser wüsste alles darauf wetten das in meinem Teams öfters Trolle/Flamer/Afk sind als im Gegnerteam und auch alle meine Freunde würden das wahrscheinlich sagen.\nSprich im eigenem Team fallen solche Spieler viel öfters auf als im gegnerteam, rein statistisch gesehen ist aber eher das gengenteil der Fall solange man nicht selber eine Troll/Flamer/Afk ist und auch nicht seine mitspieler dazu bringt  zu Flamen/Trollen oder afk zu gehen.\n\n> \n> Aber aufeinmal bekommt ihr nur noch noobs im team die ragen und meckern und die ganze zeit afk sind, egal wie gut ihr seid, auch wenn ihr eine mf mit 25/1 seid, ihr gewinnt einfach nurnoch jedes 5 game \n\nWoher willst du das wissen ich sehe bei dir öfteres negative stats als positive. Und nie 5 spiele in folge in denen du 21/1 spiele hast.\nMal davon abgesehen das Stats nur einen Bruchteil deines könnens wiedergeben und ein 1/21 Spieler sinnvoller für das Team sein kann als ein 21/1.","replies":[{"poster":"Cayce","date":"2016-01-15T22:53:56.644+0000","up_votes":1,"down_votes":0,"body":"Gerade Flamer fallen einem im Gegnerteam selten auf, da der kleinere Teil auch im All-Chat rummault, lediglich über Reportaufrufe kann man sonst mitbekommen, dass jemand flamed - und dann ist das sehr unsicher, hab schon so einige Reportaufrufe gesehen, bei denen der Grund halt nicht sonderlich ernst zu nehmen war.\n\nBei der statistischen Herangehensweise ist es halt wichtig zu bedenken, dass eine gewisse Spielzahl dafür benötigt wird. So kann man durchaus 10 Games nacheinander mehr Afks als die Gegner haben - auf lange Sicht gleicht es sich aber aus.\n\nAuch bei einer Gesamtzahl von ~100 Rankedgames ist das Gleichgewicht oft noch nicht eingependelt (wenn man jetzt aber 1000+ Games pro Season macht, dann muss man wohl akzeptieren, dass die Gegner wohl häufiger die Idioten abgekriegt haben.)","replies":[]},{"poster":"Abasin","date":"2016-01-15T11:28:48.413+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=ip27PlEH,discussion-id=12dQEg8m,comment-id=0004,timestamp=2016-01-15T11:04:49.620+0000)\n>\n> Mal davon abgesehen das Stats nur einen Bruchteil deines könnens wiedergeben und ein 1/21 Spieler sinnvoller für das Team sein kann als ein 21/1.\n\nDas ist jetzt aber leicht überzogen. 21 Kills dem Gegner \"schenken\" ist schon nicht ganz so sinnvoll. {{sticker:zombie-brand-clap}}","replies":[{"poster":"Alustus","date":"2016-01-15T11:36:38.706+0000","up_votes":1,"down_votes":0,"body":"Das hat auch keiner Behauptet.\n\nAber wenn ich jemanden habe der 21/1 ist du die ganze zeit jungelt und eine 0/21 Spieler der mit dem Team mitläuft ist kann dieser sinnvoller sein.\n\nAußerdem kann es sehr wohl sinnvoll sein dem gegner 21 kills zu \"schenken\"(auch wenn ich das nicht gesagt habe) wenn mein Team dafür im ausgleich alle Trüme einreißen kann weil das gegnerische team sich immer wieder von mit ablenken lässt.\n\nKlar ist es besser eine gute statistik zu haben, aber das heißt noch lange nicht das man auch SInnvoll für das Team ist, genausowenig wie eine Schlechte statistik zu bedeuten hat dass man sinnlos ist.","replies":[{"poster":"Abasin","date":"2016-01-15T12:26:39.627+0000","up_votes":1,"down_votes":0,"body":"Ich wollte nur andeuten, dass Du eine Extremsituation beschreibst. Deswegen auch meine Anführungsstriche.","replies":[]}]}]}]},{"poster":"Dr Untenrum","date":"2016-01-15T07:23:38.760+0000","up_votes":1,"down_votes":0,"body":"Das was du da beschreibst, ist eine klassische Losing Streak und die kommt nunmal. \nEin Beispiel: Ich habe mich diese Season bis Platin 1, teilweise sogar bis Diamant 5 gespielt, die Season aber mit Platin 3 abgeschlossen, da ich später keine Zeit für rankeds hatte und ich Platin safe hatte. \nJetzt bin ich Platin 5 0lp, und der Grund dafür ist, dass ich mit der Schnelligkeit der Preseason absolut nicht klar kam.\n**Es lag nicht an meinen Teammates, sondern wirklich an mir.** \n\nUnd das ist auch schon der Tipp, den ich dir hiermit indirekt auf den Weg gebe.","replies":[]},{"poster":"Lasse Laufen","date":"2016-01-15T13:21:24.546+0000","up_votes":0,"down_votes":0,"body":"Ich war Silber 1 mit 80 Punkten, danach hatte ich eine Lose-Streak bis Silber 4. Jetzt hänge ich da. Macht mir aber nichts aus, als ich früher in Bronze war, waren die Spiele auch nicht besser.","replies":[]},{"poster":"Obscurita","date":"2016-01-15T03:34:31.705+0000","up_votes":1,"down_votes":4,"body":"Ich kenne das... erst läufts richtig gut, das man schon Angst bekommt und plötzlich nur noch Vollpfosten. Ich glaub manchmal Riot will mich einfach nur trollen :D\nAber who cares? Flamen doch eh alle nur noch rum.","replies":[]}]}