{"poster":"Ahrmadyl","date":"2017-03-23T02:46:03.469+0000","title":"El Roam del Mid","subforum":"Guias y consejos","up_votes":9,"down_votes":1,"body":"Tenia pensado empezar este post como una de esas publicidades de &quot;esta harto de que lo gankee el mid enemigo y el suyo no haga nada?&quot;, pero me di cuenta de que los odio, entonces decidi hacerlo normal. Pero bueno, muchas veces pasa (especialmente si sos de la bot lane) que el mid enemigo roamea y los matan a los 2, mientras que el tuyo esta ahi farmeando. Basicamente queria explicar como se trata un roam (desde ambas perspectivas) asi sabes si cagar a pedos al mid o no. Y si en caso de que si, decir algo con sentido.\n\nPara los que no conocen el termino &quot;Roam&quot;: Es cuando un campeon se va de su linea a proposito para hacer algo en otro lado del mapa (abierto a discusion si piensan que el jungla roamea todo el tiempo, o si no se considera roam porque su rol consta de moverse tanto). Ejemplos: El mid baja a bot y gankea; el top baja a mid y gankea; el supp sube a mid y gankea; incluso si alguno se va a la jungla enemiga para wardear, esperar al jungla enemigo en un bush para emboscarlo, tambien es roam.\n \nEl roam sirve para poder crear presion en el mapa ademas de tu linea. Ayudar a tus compa&ntilde;eros moviendote de tu linea, por decirlo asi. Voy a hablar del roam de mid porque es el rol que juego, y creo que cazo bastante bien los roams de los supp, pero no se si da para hacer un post de eso por la validez de la info que tengo.\n\nACLARACION: Si el equipo contrario pickea {{champion:55}} (por ejemplo) no implica que tu mid juega contra ella. Implica que TODOS juegan contra ella. O sea que no es el rol de tu mid estar SIEMPRE donde esta el otro mid (ahora digo por que, y en que casos si).\n\nHay campeones que tienen mejor roam que otros. Ya sea por movilidad barata, buen push y gank, velocidad de movimiento alta. Algunos son: {{champion:103}} {{champion:55}} {{champion:7}} {{champion:91}} {{champion:136}} {{champion:4}} {{champion:163}} {{champion:245}} . Son algunos. Y esto **NO** quiere decir que si tu mid es alguno de estos TIENE que roamear, ni que si lo pickea el otro team. que SI O SI va a roamear. Ni tampoco que si tu mid tiene otro champion aparte de estos no va a roamear.\n\nLo que predispone a un mid para roamear es: tener la linea pusheada, y una linea gankeable. Lo de la linea pusheada es por 2 razones: El otro mid tiene que gastar su tiempo en limpiar la oleada de minions que tiene enfrente, o si no se pierde de mucha experiencia y oro, dandote ventaja; y que si la lane esta contra tu torre (o incluso a la mitad de la linea), el otro mid pushea rapido y ademas de perder XP y oro, tu torre se come bastante da&ntilde;o. Esto no quiere decir que si los junglas estan peleando cerca de tu lane y vos estas con los minions en tu torre, no podes ir. Son decisiones del momento que corresponden al contexto en el que se esta (Llego antes de que mi jg se muera? Puede solearlo mi jg? El otro mid esta yendo? Etc). No se tomen todo tan a pecho de lo que leen aca, a veces vale la pena perder muchos minions por salvar al jg o que se yo (desarrolla en un dragon, o mejor, que se yo).\n\nA lo que voy es: va a haber veces que el otro mid va a poder roamear y tu mid no lo puede seguir. Lo que tiene que hacer ahi es pinguear. Pero no 1 vez. Seria avisar en mid la MIA (el &quot;?&quot;), y POR LO MENOS &quot;Peligro&quot; en ambas lanes. Y con tiempo ademas. Si de ahi nadie se aviva... Buen. NV. Esto es en caso de que no lo pueda seguir al roam (si tenes la lane contra la torre basicamente hablando). Si puede, tiene que seguirlo (y preferiblemente ir por el camino de su propia jg, para que no lo embosquen en el rio). Ahi es un 3v3 y que pase lo que pase. Puede ser tambien que tu mid gane mucho mas quedandose en lane farmeando que yendo al countergank (gank que responde al gank original). Por ejemplo {{champion:112}} . La verdad es que antes de sus primeras 2 mejoras del item no hace una mierda. Entonces lo que yo haria ahi es spammear la MIA y el peligro y quedarme farmeando. Simplemente gano mas, es una jugada mucho mas segura, y mas razonable. La posta seria ahi que el team pueda absorber esta presion que hace el otro mid, asi pierde tiempo. Tipo si la bot lane esta pusheada y cantan MIA en mid... Vayanse para atras esperando el gank, aunque cueste 2 o 3 minions.\n\nLas otras 2 opciones son:\n\n1. Si esta en posicion de roamear pero no llega (por tiempo) al countergank, hacer presion en el otro lado del mapa en respuesta, para equilibrar. Los pings van igual, nunca se queden cortos de estos, a mi siempre me llega el mensaje de que no puedo enviar mas pings en el chat porque los spammeo mal. Rompo un toque las bolas, pero la gente se aviva.\n2. Pushear MUCHO y generar presion en la misma mid lane. A menos que pueda tirar la torre, esta opcion no es la mas copada que digamos. La presion que ejerce el otro mid roameando es mucho mayor a la que el tuyo hace solo pusheando. Pero a veces es lo que hay...\n\nTodo esto no significa que el mid siempre tiene una excusa para no roamear. Es completamente posible (hasta probable) que el mid se equivoque de desicion, o sea, nos equivocamos todos. Pero ya me rompia las bolas cuando (despues de spammear pings) y que mi mid mate a la bot lane, me spammean el ? ? ? a mi. Les digo &quot;cante la MIA&quot;. Y dicen &quot;y seguilo&quot;. Cuando la verdad es que no tenia sentido...\n\nCampeones con Roam en su kit de habilidades {{champion:4}} {{champion:136}} {{champion:163}}  hay que tratarlos con mas cuidado todavia. Hay que estar SIEMPRE listos para que te caiga un TF atras, o te tiren un muro de la nada.","replies":[{"poster":"Gretta Thunberg","date":"2017-03-23T04:35:38.608+0000","up_votes":3,"down_votes":0,"body":"pero si tu mid le bota primero la torre es worth","replies":[{"poster":"Ahrmadyl","date":"2017-03-23T17:35:04.301+0000","up_votes":1,"down_votes":0,"body":"Para mi, depende. Porque el intercambio de objetivos puede ser:\n\n1. Torre de Mid X algunos summoner spells (esto seria lo ideal)\n2. Torre de Mid X 2 kills y torre de bot (esto seria lo mas probable).\n\nEn caso de que sea 2, ahi esta en uds decidir si es worth o no. Tipo si tu botlane estaba ganando fuerte, y el otro team consiguio el oro de 2 Shut downs (Se acabo!), que es mucho mas que una kill cualquiera. Y encima de eso, la torre. Ahi no creo que sea tan worth. Pero buen, depende de las circunstancias y de como jueguen el mapa a partir de ahi.\n\nPero si, si es torre por kills nomas, es completamente worth.","replies":[{"poster":"Gretta Thunberg","date":"2017-03-23T18:49:17.138+0000","up_votes":2,"down_votes":0,"body":"Si pero uno tiene que intentar leer al enemigo, saco un talon o un zed? ahi tienes un 90% de posibilidades de que romee tanto a mid y a bot y a la jg alida que haces? juegas pasiva hasta nivel 6 le dices a tu supp que se haga de primer objeto el item de los wards, y no pushear como loco intentar congelar un poquito la linea","replies":[]}]}]},{"poster":"Icesoul","date":"2017-03-23T03:45:57.788+0000","up_votes":2,"down_votes":0,"body":"El otro tema por tratar es cuando podes romear y esta perfecto para entrar pero la botlane no entra y perdes el tiempo al pedo, el otro mid se quedo en linea, farmeo, perdiste minions bajo torre ya volviendo los fuiste a farmear y el otro medio backeo y volvió con más ítems por lo que se puso a la delantera, por lo menos contra vos. Es un garron cuando no saben recibir un gank, y lo peor es que es bastante común, generalmente el top es mas eficiente cuando le gankeas para ayudarle pero la bot...ay la bot lane...jajaja","replies":[{"poster":"Adeptus","date":"2017-03-23T04:21:57.403+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Icesoul,realm=LAS,application-id=8sKIclmi,discussion-id=j3YFxlN6,comment-id=0000,timestamp=2017-03-23T03:45:57.788+0000)\n>\n> El otro tema por tratar es cuando podes romear y esta perfecto para entrar pero la botlane no entra y perdes el tiempo al pedo, el otro mid se quedo en linea, farmeo, perdiste minions bajo torre ya volviendo los fuiste a farmear y el otro medio backeo y volvió con más ítems por lo que se puso a la delantera, por lo menos contra vos. Es un garron cuando no saben recibir un gank, y lo peor es que es bastante común, generalmente el top es mas eficiente cuando le gankeas para ayudarle pero la bot...ay la bot lane...jajaja\n\nYo maineo mid, para hacer roam ni trato de ir a bot a no ser que sepa que puedo entrar y hacerles 2vs1 a su linea, lo que vos tenes que hacer es ir a wardearle la jungla al enemigo para saber donde esta y cuando menos se lo espera le caes y lo matas, ademas con esa misma vision haces que todos sepan donde esta y le cagas todos los ganks.","replies":[]},{"poster":"Ahrmadyl","date":"2017-03-23T03:47:25.409+0000","up_votes":1,"down_votes":0,"body":"Eso es mas un problema de comunicacion que de decisiones. Pero si, una garcha perder el tiempo asi.","replies":[]}]},{"poster":"GameMode","date":"2017-03-23T06:47:36.681+0000","up_votes":1,"down_votes":0,"body":"Los roams con asesinos terminan siempre en kill. La cosa es pushear full e irte a la línea más pusheada.","replies":[{"poster":"rokushoger","date":"2017-03-23T13:30:07.450+0000","up_votes":1,"down_votes":0,"body":"A menos que el otro mid sea bueno y lo siga, o que el jungla se avive y haga un contragank.","replies":[{"poster":"GameMode","date":"2017-03-24T02:18:54.294+0000","up_votes":1,"down_votes":0,"body":"Si pusheas bien la lìnea dudo que te siga.","replies":[{"poster":"rokushoger","date":"2017-03-24T11:31:14.111+0000","up_votes":1,"down_votes":0,"body":"Depende, si veo que los minion y torre pueden bancarsela yo te seguiría para que no saques ventaja, pero depende de muchos factores.","replies":[{"poster":"GameMode","date":"2017-03-24T19:27:09.546+0000","up_votes":1,"down_votes":0,"body":"Pero generalmente se hace roaming cuando el mid contrario backea o lo obligas a backear. Pusheas línea rápido y te vas a las otras líneas.","replies":[{"poster":"rokushoger","date":"2017-03-24T21:38:51.025+0000","up_votes":1,"down_votes":0,"body":"Y eso es lo ideal... pero viste que dentro de la fauna de lol encontrás de todo XD","replies":[{"poster":"GameMode","date":"2017-03-24T21:40:31.721+0000","up_votes":1,"down_votes":0,"body":"Y cuando decís de todo, es literalmente de todo jaja.","replies":[]}]}]}]}]}]}]},{"poster":"Blackhawk6","date":"2017-03-23T04:13:48.305+0000","up_votes":1,"down_votes":0,"body":"Buen tema. Estoy cansado de los bronces que me reclaman por esas cosas cuando simplemente no se puede ir, de paso que ellos ni wardean (siendo dos personas en el caso de bot).","replies":[]},{"poster":"Ks Erwyn","date":"2017-03-23T04:16:15.508+0000","up_votes":1,"down_votes":1,"body":"**resumen bien chotero: **\ntu mid es un manco no canta las mias y el mid rival siempre sera el que haga roam primero y los mate en la bot lane....","replies":[]}]}