{"poster":"JuliaNN123","date":"2017-09-11T15:39:35.897+0000","title":"Sancion ijusta","subforum":"Problemas Técnicos","up_votes":1,"down_votes":20,"body":"Realmente me decepciona Rito por que embes de banear a los trollean encerio me banean a mi espero que se pueda arreglar y envestigar por favor,yo flamee 2 partidas raked,1 por que ashe se fue afk 10 m y yo no podia hacer nada,la otra era mi supp que se fue ad por que tube 14 de ap.Espero que me tomen encuenta mi caso y no baneen a los inocentes por favor Rito as algo.","replies":[{"poster":"More Powder CLEO","date":"2017-09-11T15:40:54.421+0000","up_votes":7,"down_votes":0,"body":"Y cito:\n\n> yo flamee 2 partidas","replies":[]},{"poster":"SparkkNimoTV","date":"2017-09-11T16:28:18.527+0000","up_votes":6,"down_votes":0,"body":"Ese ban no venía con un diccionario? :v","replies":[{"poster":"SparkkNimoTV","date":"2017-09-11T16:29:08.476+0000","up_votes":2,"down_votes":0,"body":"Pd: igual bien merecido el ban,no hay motivos para flamear,vos que sabes si a esa ashe no se le cortó la luz o le pasó algo? A todos nos puede pasar,no por eso vas a flamear,que lo disfrutes","replies":[]}]},{"poster":"Nozarashi","date":"2017-09-11T15:56:44.230+0000","up_votes":4,"down_votes":0,"body":"un pobre e  inocente toxico menos.\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Hwaxinghz","date":"2017-09-11T15:52:33.947+0000","up_votes":4,"down_votes":0,"body":"Tienes que entender que es muy raro que una sanción sea realmente injusta.\n\nTú mismo lo dices, flameaste en 2 partidas, motivo suficiente para sancionarte con.... Suspensión de 14 días, creo, o restricción de Chat (este último más probable). No tienes que insultar a nadie bajo ningún motivo, eso genera odio y le hace mal a la comunidad.\n\nSugiero que para la próxima no molestes a la gente, mutea el chat, mutea señales, evita dirigirle la palabra a alguien en la partida. Si quieres flamear, respira profundo y cambia de opinión, una persona no va a reaparecer si te pones a putear, una persona no va a jugar mejor si le dices \"L# C#NCH# DE TU M@DR# JUGÁ BIEN\", en todo caso explícale como \"jugar bien\" y ayudalo, no lo hundas más.\n\nEspero que comprendas y hayas entendido que no debes tener las actitudes que estás teniendo. Si te trolean, deci: \"Amigo, me equivoqué de runas/maestrías porque se me bugeó el cliente, disculpa\", mentile en todo caso, pero no lo flamees porque te trolea porque llevaste AP en vez de AD, son errores menores, irrelevantes en muchos casos. Si te dice algo, demostrale que jugarás bien, no le demuestres que sos NEGATIVO, sino te van a reportar con mucha razón y posiblemente un Baneo extra.\n\nTrata de comportarte. Entiendo que frustren los trolls y gente que \"juegue mal\", pero intenta hablar bien con ellos, si el pibito tiró mal una ulti, no lo flamees, explícale como lanzarla bien, en todo caso dile que la tire a quemarropa, pero bueno. La cuestión es que digas las cosas de buena manera. \n\nSi no sos negativo no te cae el Ban, caso contrario te cae un Ban. Simple y lógico.\n\n{{sticker:poppy-wink}}","replies":[]},{"poster":"iH3RN4Ni","date":"2017-09-11T15:44:10.369+0000","up_votes":3,"down_votes":0,"body":"Perfecta sancion, vos mismo dijiste que flameaste. Adios suerte","replies":[]},{"poster":"DarksWaves","date":"2017-09-11T15:42:18.254+0000","up_votes":4,"down_votes":1,"body":"Segun mis registros broncescos, tenes una partida con soraka ad, lo cual se considera troll. Tenes 7 partidas en este año donde claramente estas toxiqueando por chat. Y tenes 3 leaves no sancionados.\n\nBan merecido.\n\nhttp://s2.quickmeme.com/img/2b/2bb4b0a3a5c5286af881efed5100b77413bbf1464777132acfe4c78f0f46368f.jpg","replies":[]},{"poster":"RedKi","date":"2017-09-11T16:28:37.242+0000","up_votes":2,"down_votes":1,"body":"Un toxiquito menos ;). Bye","replies":[]},{"poster":"Rebkans","date":"2017-09-11T16:17:27.510+0000","up_votes":1,"down_votes":0,"body":"No tenes ni una gota de inocencia.\nSos un flamer que recibió su merecida sancion ya que no hay justificacion  para flamear.\n\nAdemas, te banearon por acumular muchos reports justificados en varias partidas, no solo en dos...","replies":[]}]}