{"poster":"RasberryBlue","date":"2016-08-11T02:51:11.918+0000","title":"Is Sona the best support to rank up with? :D","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"I&#039;ve been trying to rank up  a lot, still in bronze :D. XD\r\nI&#039;m a Sona {{champion:37}} main and I was wondering if she was the best champ to rank up with :)","replies":[{"poster":"BananaSlayerAMO","date":"2016-08-11T03:52:40.345+0000","up_votes":4,"down_votes":0,"body":"I'm also a bronzie so take my advice with a grain of salt, but Sona seems to be a great support to level up with - she can push leads if ahead or play defensively if behind. However, sticking to just Sona is not ideal incase you get aggressive counter picks like {{champion:53}} {{champion:12}}, or  {{champion:16}}, who can neutralise your poke.\n\nIn the end, it's best to play champions that you are proficient at, but if you are open to champs, here are some suggestions:\n\nI believe that an aggressive support would be ideal for snowballing and pushing out leads. However, you would need to be consistently good at them since they don't do so well when they fall behind. These champs include {{champion:89}} {{champion:53}} {{champion:12}} {{champion:44}} {{champion:412}}{{champion:25}} , maybe even {{champion:40}}. Doing well with these champs also requires a decent adc.\n\nDefensive supports are a safer pick, but they don't abuse leads as well. Some defensive supports are {{champion:16}} {{champion:223}}{{champion:201}} .  Compared to aggressive supports, winning the game depends more on the skill of your teammates and less on you.\n   \n{{champion:40}}{{champion:25}}  and {{champion:44}} can also be played defensively, making them quite flexible champs to pick. ","replies":[]},{"poster":"Lord Sesshomaru","date":"2016-08-11T03:16:57.141+0000","up_votes":1,"down_votes":0,"body":"Well if your ranked games are anything like mine, your team will pick 4 assassins (Zed, Ekko, Yasuo and Vayne most likely) and 0 tanks, then lose and blame everything except themselves.\n\nSo my advice would be to pick the tankiest motherfucker possible, and make it your full time job to save assassins from their own stupidity.\n\nOn paper, Sona has the highest win rate in the game, but no one knows how little/much the recent nerf has affected her, so i cant say if thats true anymore.\n\nBut if you have 3 or 4 squishies already on your team, you will be wanting a tank.\n\nSo maybe choose Sona and Alistar, and go Sona when your team has 2 **proper** tanks or more, and go Alistar when they have 1 or less.","replies":[{"poster":"Gr1fter","date":"2016-08-11T03:22:50.541+0000","up_votes":3,"down_votes":0,"body":"This is true. Team comp can also be an issue in solo q. So, pick the right support for the right job.","replies":[]}]},{"poster":"4fy9bEOt7y","date":"2016-08-11T04:09:50.973+0000","up_votes":1,"down_votes":3,"body":"Ignore everyone. Sona can be built AP and two hit ADCs with a Q + auto. If your Just rush a lich and a ludens and enjoy the free kills botlane. Blitz and alistar don't counter Sona. If your ADC gets hooked just ult them and kill the ADC. Sona is busted.","replies":[{"poster":"BananaSlayerAMO","date":"2016-08-11T04:48:31.651+0000","up_votes":3,"down_votes":0,"body":"There are reasons why people don't rush two damage items on Sona support...\n\n. It takes too long - Sona doesn't get farm! By the time you've got those two items, your opponents will be so far ahead, your damage definitely won't be enough to 'two hit' them. That's why supports get gold income items first...\n. Sona's hella squishy. You're a support; no one's protecting you, at least get some defensive stats early game so that you can poke the enemy without dying.\n. Where's the vision items? (But when you get ganked your adc's taking all the damage, at least you're not the one dying, right?) <-- sarcasm btw\n\nFull AP Sona support may work on normals if the enemy feeds, but if you're going on ranked, be an actual support.","replies":[{"poster":"4fy9bEOt7y","date":"2016-08-11T12:58:21.084+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=BananaSlayerAMO,realm=OCE,application-id=Ntey9fRZ,discussion-id=8bdOwfvX,comment-id=00030000,timestamp=2016-08-11T04:48:31.651+0000)\n>\n> There are reasons why people don&#x27;t rush two damage items on Sona support...\n> \n> . It takes too long - Sona doesn&#x27;t get farm! By the time you&#x27;ve got those two items, your opponents will be so far ahead, your damage definitely won&#x27;t be enough to &#x27;two hit&#x27; them. That&#x27;s why supports get gold income items first...\n> . Sona&#x27;s hella squishy. You&#x27;re a support; no one&#x27;s protecting you, at least get some defensive stats early game so that you can poke the enemy without dying.\n> . Where&#x27;s the vision items? (But when you get ganked your adc&#x27;s taking all the damage, at least you&#x27;re not the one dying, right?) &lt;-- sarcasm btw\n> \n> Full AP Sona support may work on normals if the enemy feeds, but if you&#x27;re going on ranked, be an actual support.\n\nSona supports herself and that's it. You don't need vision. If you get ganked, just ult the jungler and Q + auto and he's dead. If you're taking damage buy Rod of Ages. Actually, rush RoA.\n\nBuild path.\n{{item:3027}} {{item:3100}} {{item:3285}} {{item:3135}} {{item:3089}} {{item:3020}}\n\nWards are a waste of gold as they don't last all game. Plus, you can just use your trinket. If you're bronze, then your ADC is bad and you should carry.\n\nAlso, just take the farm, your ADC doesn't need it.\n\n\"Where's the vision items? (But when you get ganked your adc's taking all the damage, at least you're not the one dying, right?)\" Yes, good. let the ADC take damage and you run. You needn't waste your time saving a low skilled player.","replies":[]}]},{"poster":"Nightjar","date":"2016-08-11T08:13:01.459+0000","up_votes":1,"down_votes":0,"body":"is this sarcasm? A good adc with good farm should get their damage alot earlier than sona (even rushing damage over a sightstone, the enemy adc will have a bf sword before you have your sheen and their Ie before you get your lichbane), sure her poke hurts but in a proper fight the adc will be dealing more damage. Alistair does counter sona since a good ali will just wq combo on you and then his adc will mop up the squishy on a platter, though blitzcrank will only work if she gets grabbed though even this is a huge threat for you. Outside of your q poke doing a large chunk you don't have sustained damage and you are fundamentally a support meaning you don't scale as well as most mages with damage. Sona appears strong due to her chunking poke but her high winrate is more due to the changes to her w shield and heal for her adc than her poke damage. You go full ap damage and stop 'supporting' the adc and you will lose since utility>damage for supports since utility scales without a huge gold requirement. You sound like the guy who goes annie support (good only at low elo) and rushes mejais over sightstone and takes all the kills for themselves leaving their adc penniless and pitifully outscaled in lategame by the enemy adc. I main support and I hate supports who do this. You don't need raw damage to carry a game, cc, peel, tanking, vision control, objective control and zoning are much more important especially in a role where you have less gold to work with.","replies":[{"poster":"Nightjar","date":"2016-08-11T08:15:37.516+0000","up_votes":2,"down_votes":0,"body":"I'm not saying supports can't do damage (though most of it should come from your spells base damage); but don't forgo your utility and job as the 'support' to try to solo win the botlane with a cheeky deathcap.","replies":[]},{"poster":"4fy9bEOt7y","date":"2016-08-11T13:02:31.920+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Nightjar,realm=OCE,application-id=Ntey9fRZ,discussion-id=8bdOwfvX,comment-id=00030001,timestamp=2016-08-11T08:13:01.459+0000)\n>\n> is this sarcasm? A good adc with good farm should get their damage alot earlier than sona (even rushing damage over a sightstone, the enemy adc will have a bf sword before you have your sheen and their Ie before you get your lichbane), sure her poke hurts but in a proper fight the adc will be dealing more damage. Alistair does counter sona since a good ali will just wq combo on you and then his adc will mop up the squishy on a platter, though blitzcrank will only work if she gets grabbed though even this is a huge threat for you. Outside of your q poke doing a large chunk you don&#x27;t have sustained damage and you are fundamentally a support meaning you don&#x27;t scale as well as most mages with damage. Sona appears strong due to her chunking poke but her high winrate is more due to the changes to her w shield and heal for her adc than her poke damage. You go full ap damage and stop &#x27;supporting&#x27; the adc and you will lose since utility&gt;damage for supports since utility scales without a huge gold requirement. You sound like the guy who goes annie support (good only at low elo) and rushes mejais over sightstone and takes all the kills for themselves leaving their adc penniless and pitifully outscaled in lategame by the enemy adc. I main support and I hate supports who do this. You don&#x27;t need raw damage to carry a game, cc, peel, tanking, vision control, objective control and zoning are much more important especially in a role where you have less gold to work with.\n\nWhy build a sightstone when you don't get AP from it? What a useless item.","replies":[{"poster":"Nightjar","date":"2016-08-12T00:19:51.198+0000","up_votes":2,"down_votes":0,"body":"If you want to go full ap go mid, stop trying to play mid in the support role because you obviously don't know what you are doing as a support.","replies":[]}]}]}]},{"poster":"DipperOCE","date":"2016-08-11T14:55:37.220+0000","up_votes":1,"down_votes":0,"body":"If you want to rank up and not just get out of bronze you need to play mechanically requiring supports. Healers and buffers are good, but have a lot of counter play and are so binary, plus don't provide good CC.\n\nHealers are only good if you already have a lot of hard CC on your team. By \"healers\" I mean buffers including Nami, Janna, Sona, Soraka.\n\nChampion like Blitzcrank, Leona, Thresh, Taric or Morgana are really good under the right fingertips. Alistar is slightly easier and as such lacks long range engage.\n\nBut with the mechanics of Sona right now, she is a god like champion and could get you to gold easily.","replies":[{"poster":"Nightjar","date":"2016-08-12T00:28:22.340+0000","up_votes":2,"down_votes":0,"body":"I don't feel nami is binary since if you can hit her bubble she has good kill potential and she does decent damage so if you position right you can bully pretty hard. That said imo if you want to climb tank engage supports are probably your best option since at low elo statistically the team to initiate a fight (even in a bad situation) will usually come out on top, so if you pick say alistair, leona, braum, nautilus your odds of winning rise, especially if you can pick the right engages. Personally I find that since your team might be a little slow to followup having a knockup might be useful since if you have a yasou on your team, you can abuse their yasou syndrome and know that at least 1 other person will follow up on your play.","replies":[{"poster":"DipperOCE","date":"2016-08-12T07:04:51.132+0000","up_votes":1,"down_votes":0,"body":"I was more referring to Sona and Soraka. Nami has a lot of combos and playstyles but Sona and Soraka are out poke, heal and CC.","replies":[]}]}]},{"poster":"Ingénue","date":"2016-08-11T06:15:51.847+0000","up_votes":2,"down_votes":0,"body":"I went from bronze to plat this season playing almost only support. \n\nI wouldn't say Sona is _the_ best support for climbing, as there isn't really one. \nI would advise drafting a champ pool of a couple of supports that you can use to fit team comps. Play what you feel comfortable on, making sure that you have a variety to pick from. \n\nFor example, my champ pool:\n{{champion:267}} comfort pick, pick all the time. Great sustain\n{{champion:201}} pick if we absolutely need a tank\n{{champion:40}} Pick with Caitlyn and Draven\n{{champion:25}} Pick when nami has been taken \n\nYou also have to take into account what your enemies are likely to be playing. Blitzcrank is a really popular bronze pick, and  not a lot of people can dodge efficiently. Morgana would be a good choice here. \n\nLikewise, looking at your own team is also important. Bronze soloq comps usually lack cc and engage, something Braum fills perfectly. Yasuo is a popular pick, so knock ups provided by Alistair and Nami would be great here.","replies":[{"poster":"Nightjar","date":"2016-08-11T08:25:00.143+0000","up_votes":1,"down_votes":0,"body":"Another note is that in bronze against blitzcrank, alistair is a good pick too imo (I'm bronze and used to play alistair though I haven't played him in months) and sometimes the blitzcrank will grab you even when he shouldn't and you get a free gapclose, then knock them under your tower and up combo for free kill.","replies":[]}]},{"poster":"Légs","date":"2016-08-12T09:29:06.630+0000","up_votes":1,"down_votes":0,"body":"I found {{champion:40}} and {{champion:16}} got me out of bronze pretty quickly. I also like to ban {{champion:53}}  in bronze. Although you may be good at dodging skillshots, chances are your adc isnt and I find that blitzcrank can just abuse the hell out of this elo and snowball the lane heavily in his favor.","replies":[{"poster":"Qoki","date":"2016-08-12T11:38:30.115+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jencarna,realm=OCE,application-id=Ntey9fRZ,discussion-id=8bdOwfvX,comment-id=000a,timestamp=2016-08-12T09:29:06.630+0000)\n>\n> I found {{champion:40}} and {{champion:16}} got me out of bronze pretty quickly. I also like to ban {{champion:53}}  in bronze. Although you may be good at dodging skillshots, chances are your adc isnt and I find that blitzcrank can just abuse the hell out of this elo and snowball the lane heavily in his favor.\n\nYeah, I can attest to that. Pretty much spammed {{champion:16}} and got out of bronze after my first round of placements within 1-2 days. Also, bronze blitz's pretty much only pick the champ to try and cheese you, but few know how to get off a good pull so its pretty manageable if your ADC isn't too terrible.","replies":[]}]},{"poster":"SlySi","date":"2016-08-12T08:01:31.532+0000","up_votes":1,"down_votes":0,"body":"Sona is bad if you're not aggressive in the laning phase. If you can't harass well with Sona, she's garbage.\n\nIf you are a passive player, pick someone with a good crowdcontrol that's easy to land (Trundle).","replies":[]},{"poster":"Sneed","date":"2016-08-11T22:03:31.032+0000","up_votes":1,"down_votes":0,"body":"playing support in bronze is like looking after disabled kids except you get nothing out of it.\n\nwhy do bronze players play support? you have to support dipshit adcs. may as play teemo support because \"he counters adcs xd\"","replies":[{"poster":"Lord Sesshomaru","date":"2016-08-12T00:03:34.381+0000","up_votes":1,"down_votes":0,"body":"You're obviously not in Bronze, if you were you'd know thats **exactly** how it is already:\n\n_\"Zed support op! trust me ill carry\"_\n\n_\"No tanks in our team? Ok I'm going Teemo support!\"_\n\n_\"Fuck support, we're going duo ADC, dodge if you can't handle it!\"_","replies":[{"poster":"Sneed","date":"2016-08-12T00:49:27.508+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=Ntey9fRZ,discussion-id=8bdOwfvX,comment-id=00080000,timestamp=2016-08-12T00:03:34.381+0000)\n>\n> You&#x27;re obviously not in Bronze, if you were you&#x27;d know thats **exactly** how it is already:\n> \n> _&quot;Zed support op! trust me ill carry&quot;_\n> \n> _&quot;No tanks in our team? Ok I&#x27;m going Teemo support!&quot;_\n> \n> _&quot;Fuck support, we&#x27;re going duo ADC, dodge if you can&#x27;t handle it!&quot;_\n\nim glad im not in bronze","replies":[]},{"poster":"Nightjar","date":"2016-08-12T00:31:51.392+0000","up_votes":1,"down_votes":0,"body":"yeah or you were going to go morgana mid but your garen who picked last even though you already have a toplaner goes mid and builds full ap to protest not getting top and you end up having to go morg support, which isn't the worst case scenario I guess since you main support but the ap garen makes you cry when he builds his second deathcap.","replies":[]}]}]},{"poster":"dslxk","date":"2016-08-11T15:38:39.232+0000","up_votes":1,"down_votes":0,"body":"{{champion:89}} {{champion:201}} {{champion:16}}","replies":[]},{"poster":"Brucey","date":"2016-08-11T07:42:42.042+0000","up_votes":1,"down_votes":0,"body":"Honestly saying i think she's no longer #1 not even in the top 5 anymore they took most of her damage they nerfed the crap out of her heals and they've nerfed her movement speed too much, base scaling and ap scaling also they nerfed her early game so much with the passive reduction on ult. She didn't need to be changed in the first place...","replies":[]},{"poster":"Gr1fter","date":"2016-08-11T03:15:06.023+0000","up_votes":1,"down_votes":0,"body":"Depends. If you're playing solo or in a pre-made. As far as solo goes she is probably the best as she has potential to carry. If you're playing in a pre-made you might be better off with {{champion:16}} \n\nBut, {{champion:37}}  is sitting at a 55% win rate while {{champion:16}} is at 52%... So, either way, you should be climbing.","replies":[]}]}