{"poster":"Danielfrshmv","date":"2015-02-19T22:20:37.464+0000","title":"Ranked hilfe","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":7,"body":"Hallo bin 16 m und suche jmd der mir hilft vom silber 2 auf gold 5 zu kommen , ein smurf account wäre nett.  Zur kommunikation habe ich ts3, skype und curse voice . Selber schaffe ich es nicht da ich  der schule bedingt  kaum zeit habe und vor der promo immer alle pkt verlieren. Freue mich auf positive antworten, kommt nicht mit du schaffst es selbst oder  für so und soviel euro booste ich dich .. danke :D","replies":[{"poster":"HansMowlWurf","date":"2015-02-19T22:34:25.276+0000","up_votes":3,"down_votes":0,"body":"Solltest du schon selber schaffen.\nMoegeln ist doch irgendwie ... bloed.","replies":[]},{"poster":"Danielfrshmv","date":"2015-02-20T12:04:56.348+0000","up_votes":1,"down_votes":4,"body":"Und mal wieder einen großen dank an die LoL-Comunity für diese sehr \"ich betone sehr\" hilfreichen antworten !","replies":[{"poster":"HansMowlWurf","date":"2015-02-20T12:18:04.207+0000","up_votes":2,"down_votes":0,"body":"Du fragst nach einem eloboost durch duoQ ....\nWas erwartest du?!\nWenn du gut genug fuer Golld bist, dann erreichst du es auch. Wenn nicht, dann nicht.\nEs kann nunmal nicht jeder Gold+ sein und die Belohnungen einsacken.\n\nUnd dann auch noch ohne Gegenleistung ;D\nIn was fuer einer Traumwelt lebst du eigentlich? ;D","replies":[]},{"poster":"Sirrkas","date":"2015-02-20T12:21:37.643+0000","up_votes":1,"down_votes":0,"body":"Bist du denn nicht selbst ein Paradebeispiel für eine schlechte Community? Du kommst ins Forum und bettelst darum, dass dir jemand mehr oder weniger ein Goldranking schenkt.","replies":[]}]},{"poster":"gluecks","date":"2015-02-20T14:03:41.618+0000","up_votes":1,"down_votes":0,"body":"Elo-betteln hier eher wenig verloren. \n\nDu hast du zwar nicht so formuliert, ok, aber es ist trotzdem damit gleichzusetzen, da du im Grunde genommen nur jemand einen Gold+ Spieler samt Smurfaccount suchst, der dich hochcarried.\n\nAußer vielleicht ein kurzes Glücksgefühl, würde es dir doch auch nix bringen, da du ziemlich schnell dann wieder demotet werden würdest, wenn du nicht nach Gold 5 gehört - wovon man stark ausgehen muss, da du es nach eigenen Ansagen her aus eigener Kraft nicht schaffst dahin zukommen.","replies":[]},{"poster":"Veezey","date":"2015-02-20T12:32:39.326+0000","up_votes":1,"down_votes":0,"body":"Was nützt es dir in Gold zu sein, wenn du da gar nicht hingehörst? Nur weil du in Gold bist, heißt das ja nicht, dass du besser spielst.","replies":[]},{"poster":"Madchickendinner","date":"2015-02-19T22:58:14.846+0000","up_votes":1,"down_votes":0,"body":"Was willst du in Gold?","replies":[]},{"poster":"Danielfrshmv","date":"2015-02-20T13:49:53.332+0000","up_votes":1,"down_votes":2,"body":"Ich gibs auf mit euch...eh keinen sinn. Da nutzt man einmal das Forum und wird sofort dumm angemacht. Außerdem habe ich nicht um hilfe gebettelt sonder nur gefragt ob jmd so freundlich wäre um mit mir zsm ranked zu machen ....","replies":[]}]}