{"poster":"FrogKillerFrog","date":"2016-04-27T20:44:56.289+0000","title":"Ich brauche dringend hilfe :/","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"Ich habe mir gerade eben wieder lol installiert und beim ersten spiel ist mir aufgefallen dass ich nicht auf den H&auml;ndler zugreiffen kann, egal wie ichs mache, &uuml;ber P, die geldleiste oder auf den H&auml;ndler zu klicken, ich bekomme immer nur meine spielerstats aufgeploppt, hab schon versucht die Einstellungen zrk zu setzen aber das hat nichts gebracht und auch wenn ich die tastenk&uuml;rzel &auml;ndere komm ich nie in den shop sondern immer nur in das statistiken men&uuml;....     BITTE  HILFE :/","replies":[{"poster":"FrogKillerFrog","date":"2016-04-28T18:59:02.844+0000","up_votes":1,"down_votes":0,"body":"DANKE LEUTE!!!!!!!!!!!!!! ES GEHT ENDLICH!!!!!!!!!! ICH LIEBE EUCH *-*","replies":[]},{"poster":"FrogKillerFrog","date":"2016-04-28T06:48:32.657+0000","up_votes":1,"down_votes":0,"body":"Ich verzweifel langsam wirklich noch, ich kann einfach nicht auf den verdammten Händler zugreiffen, immer wieder koomm ich aufs spielerstatistikenmenü\nhatte auch schon die im supportbereich genannte Methode gemacht indem ich eben diese 3 orner lösche um die Einstellungen wieder zrk zu stellen aber es hat einfach nichts gebracht","replies":[{"poster":"p0hil","date":"2016-04-28T06:57:38.360+0000","up_votes":1,"down_votes":0,"body":"Wenn du die Einstellungen zurücksetzen willst, musst du nicht 3 Ordner löschen, sondern ALLES was sich im Config Ordner befindet. Hast du dies auch so versucht ?","replies":[{"poster":"FrogKillerFrog","date":"2016-04-28T12:01:15.807+0000","up_votes":1,"down_votes":0,"body":"bringt das wirklich was?","replies":[{"poster":"Yaxtee","date":"2016-04-28T18:00:35.297+0000","up_votes":1,"down_votes":0,"body":"Ja, dazu musst du aber mit deinem Account eingeloggt sein, da das ganze Accountgebunden ist :)","replies":[{"poster":"FrogKillerFrog","date":"2016-04-28T18:02:49.805+0000","up_votes":1,"down_votes":0,"body":"wenn ich also in meinen Dateien den ordner lösche muss ich dabei in lol angemeldet sein ? :o","replies":[{"poster":"Yaxtee","date":"2016-04-28T18:13:32.002+0000","up_votes":1,"down_votes":0,"body":"Wenn du den Config Ordner löschst, schon :) Das ganze wird auf dem Server gespeichert. Wenn du ihn löschst, und du bist nicht online, bringt das gar nichts, weil er beim nächsten einloggen die Datei einfach wieder ersetzt, weil sie noch erhalten ist.","replies":[{"poster":"FrogKillerFrog","date":"2016-04-28T18:19:08.459+0000","up_votes":1,"down_votes":0,"body":"okay das versuch ich gleich, danke :D","replies":[]}]}]}]}]}]}]},{"poster":"NoFlameWinsGame","date":"2016-04-28T00:09:45.087+0000","up_votes":1,"down_votes":0,"body":"Hallo, Versuche mal Deine Einstellung in LoL zurückzusetzen falls dass nicht Funktioniert schau mal auf deine Tastenbelegungen wie du diese den Verteilt hast ein Freund hatte das mal in der selben art als er z.B die P Taste Drückte Öffnete sich im Hintergrund Irgendein Ordner sollte sich das problem nicht durch die Einstellungen Gelöst haben einfach noch mal an mich wenden.","replies":[{"poster":"FrogKillerFrog","date":"2016-04-28T06:26:21.284+0000","up_votes":1,"down_votes":0,"body":"ich hab die einsellungen schon immer wieder zrk gesetzt und auch die Tastenbelegung fürn Händler geändeert aber egal auf was ichs leg, da kommt immer dasselbe :/","replies":[]}]},{"poster":"The Demon Child","date":"2016-04-27T22:09:50.870+0000","up_votes":1,"down_votes":0,"body":"Manchmal hilft es ejnfach alt esc zu drücken, und dann wieder in das spiel zu gehen, so löse ich zumind. Normalerweise das problem","replies":[{"poster":"FrogKillerFrog","date":"2016-04-28T06:25:21.382+0000","up_votes":1,"down_votes":0,"body":"das bringt iwie auch nichts :/","replies":[]}]}]}