{"poster":"SanKkK","date":"2018-06-19T21:45:15.413+0000","title":"Decreción de MMR","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"Holaaaa a todos/as!!!\r\nComo dice el t&iacute;tulo, tengo la siguiente duda, pero primero una breve descripci&oacute;n de lo que me paso recientemente.\r\nHace 2 partidas atras estaba jugando mis clasificatorias solo/duo (las primeras 10) en ese momento solo tenia 7 partidas jugadas con un MMR de 947(aprox.) de Bronce IV , luego empece otra , y el mid se fue afk desde el comienzo, resultado = remake, comenc&eacute; otra partida , y la gane (mi score : 5 / 3 / 12 ), al finalizar la partida teniendo 6 Victorias y 2 derrotas( sin contar 2 remakes ) 8 partidas jugadas, termine con un MMR de 927 (Bronce V) , mi duda es la siguiente: &iquest; Porque habiendo ganado la ultima partida que jugu&eacute; hasta reci&eacute;n , me bajo el MMR de 947 a 927?\r\nAcaso me bajaron el MMR por que el mid se fue afk en mi septima partida?? , si alguien sabe responderme se lo agradecere.\r\nGracias por su atenci&oacute;n!!!! {{sticker:slayer-jinx-wink}}","replies":[{"poster":"SanKkK","date":"2018-06-20T00:19:46.432+0000","up_votes":1,"down_votes":0,"body":"Gracias por las respuestas, se los agradesco!! {{champion:64}}","replies":[]},{"poster":"iNGENiO","date":"2018-06-19T22:41:08.885+0000","up_votes":1,"down_votes":0,"body":"Las paginas que te dicen un MMR APROXIMADO, es eso... MMR APROXIMADO.\n\nOsea no es un valor REAL.\n\nEs de mentiritas. El verdadero MMR lo tiene Riot y no se puede saber.","replies":[{"poster":"Katastrofica","date":"2018-06-19T23:26:58.275+0000","up_votes":1,"down_votes":0,"body":"This.\n\nEn su momento OP.GG decia que terminaría oro 4 con mi MMR y dije \"izi pizzi maokai victorioso en bici\" \nPero gane la ultima ranked y quede plata 2 alv :'v","replies":[]}]},{"poster":"I WAS IN ALPHA","date":"2018-06-19T22:20:58.242+0000","up_votes":1,"down_votes":0,"body":"Pues siempre las preguntas sobre el MMR quedan sin una respuesta 100% segura ya que este numero permanece oculto y las paginas externas a riot solo dan un calculo aproximado (y vete a saber que tan aproximado sera...), aunque si, puede que para la pagina las ''derrotas'' que tengas debido a un remake cuenten para hacer el calculo (lo cual seria algo estupido y de nuevo hace que uno dude aun mas de la veracidad del numero que te proporcionan), como sea aca termino mi dialogo con mi opinion xd\n\nsuerte","replies":[]}]}