{"poster":"Malkàv","date":"2015-09-20T00:33:57.082+0000","title":"Helo hell?","subforum":"Discussioni generali","up_votes":1,"down_votes":4,"body":"Se consideriamo l&#039;elo hell come una linea sottile che distingue partite normali da quelle di livello inferiore al tuo si possono capire molte cose. Se perdi due partite di fila per esempio questa linea inizia a spezzarsi, ti trovi con gente sia contro che in team pi&ugrave; debole e non sai mai cosa pu&ograve; capitarti. Trovare molti ex gold e platinum in silver &egrave; cos&igrave; semplice proprio per questo. Non &egrave; normale in 6 giorni riuscire a vincere 22 partite su 30 arrivando cos&igrave; in silver 3, poi perdere 3 promo consecutivamente e non riuscire pi&ugrave; a vincere una partita, scendendo in silver 4. L&#039;elo hell &egrave; il nome che viene dato ad un mmr sfavorevole, che per andare in positivo necessita di 4/5 vittorie consecutive, per andare in negativo necessita solamente di 2/3 sconfitte. Poi se sei nettamente superiore ai tuoi compagni nella rispettiva divisione (come potrebbe essere per un diamond in silver) sali senza alcun problema ma se sei &quot;normale&quot; o leggermente superiore alla tua attuale divisione devi sperare inizialmente in una serie consecutiva di vittorie e solamente dopo ci&ograve;, puoi giocare normalmente senza problemi fino a che non trovi quelle fatidiche due partite che ti rovineranno l&#039;mmr, in quel momento dovrai iniziare nuovamente da capo.\r\n\r\nNon credo che questa situazione dipenda da divisione o lega, questo discorso vale per ogni player che non sia ancora stabile in master o challenger","replies":[{"poster":"Dr LouD","date":"2015-09-20T00:51:13.264+0000","up_votes":10,"down_votes":0,"body":"L'elo hell si presenta quando un giocatore momentaneamente non sale più (arriva ad un tot di skill e non ha le conoscenze per migliorare), quando si arriva al punto tale che sia gli alleati che i nemici sono di skill molto simili al tuo, per questo si presentano situazioni nelle quali ci si trova in netto svantaggio e non si riesce a ribaltare la partita con le proprie forze, arrendendosi al fatto che quella partita non è carrabile\n\nDal fantomatico elo hell si esce semplicemente diventando più bravi,imparando a carriare i game che prima sembravano impossibili, per poi riproporsi piu tardi, sempre per la medesima causa.\n\nL'elo hell è un ciclo continuo che esiste solo nella mente del giocatore che si trova momentaneamente davanti ad un muro, non riuscendo a capire che quel muro puo essere scavalcato agilmente solamente con un minimo di conoscenze in più.\n\nSpero si sia capito il concetto, altrimenti \nTL;DR: l'elo hell non esiste","replies":[{"poster":"NiraBlade","date":"2015-10-12T23:51:56.904+0000","up_votes":1,"down_votes":0,"body":"un carro di +1 per ILouD plz :V","replies":[]},{"poster":"73668109_DEL","date":"2015-09-20T07:52:04.581+0000","up_votes":1,"down_votes":0,"body":"D'accordo con tutto quello che hai scritto , ma l'elo hell esiste , è uno stato mentale come dici tu ma è una cosa reale.","replies":[{"poster":"Dainsleif09","date":"2015-09-20T08:51:17.302+0000","up_votes":1,"down_votes":0,"body":"lo sai che quello che dici e paradossale? hai appena detto che l elo hell e uno stato mentale ma poi dici anche che e reale? non puo essere sia astratto che concreto diciditi","replies":[{"poster":"73668109_DEL","date":"2015-09-20T09:06:18.714+0000","up_votes":1,"down_votes":0,"body":"E' reale nel senso che non è vero che non esiste .\n\nEsiste ma è diverso da cio' che crede la gente .\nDi solito si chiama l'elo hell quando \" si perde a causa del team \" , è sbagliato l'elo hell è il limite delle tue abilità .","replies":[{"poster":"Dainsleif09","date":"2015-09-20T10:06:28.535+0000","up_votes":1,"down_votes":0,"body":"ecco ora la spiegazione mi e piu chiara grazie","replies":[]}]}]}]},{"poster":"Collassina","date":"2015-09-20T01:50:20.617+0000","up_votes":1,"down_votes":0,"body":"> L'elo hell si presenta quando un giocatore momentaneamente non sale più (arriva ad un tot di skill e **non ha le conoscenze per migliorare)**\n> L'elo hell è un ciclo continuo che esiste solo nella mente del giocatore che si trova momentaneamente davanti ad un muro\n_** l'elo hell non esiste**_\n\n^","replies":[]}]},{"poster":"BrattishSolid6","date":"2015-09-20T08:45:29.506+0000","up_votes":3,"down_votes":0,"body":"Il problema secondo me è che la gente non capisce che appartiene a una divisione. Se il mio \"livello di bravura\" è proporzionale al \"Silver\", non posso pretendere di poter arrivare a Gold, così come gioco ora. È inutile continuare ostinatamente a voler salire pensando che ci spetti il Diamond. \n\"Gne gne non riesco a salire gne gne\" significa che non ti meriti di salire, che il tuo posto è lì dove già sei. Questo significa che non si può migliorare? Assolutamente no, ma bisogna riconoscere dove si può arrivare in questo momento e quanta strada c'è ancora da fare per raggiungere traguardi più alti. Se dopo (la butto lì) 4 mesi di ranked partendo dal Silver non riesco ad arrivare al Gold, beh, significa che non sei ancora abbastanza bravo da essere riconosciuto come Gold.\n\nPoi personalmente io chiamo \"elo hell\" solo quelle situazioni in cui la partita viene rovinata da trollers/afk, dove è volutamente rovinata e non è più considerabile una partita normale. Ma questa è una definizione che ho dato io personalmente, non ho idea se ne esista una \"più vera\" :3","replies":[]},{"poster":"Frattaglia","date":"2015-09-20T11:09:20.978+0000","up_votes":2,"down_votes":0,"body":"La mia serie di vittorie sull'account non ha mai superato le tre o quattro di fila, eppure l'anno scorso ho fatto bronzo 3 -> gold 5.\n\nQuello che tu non consideri è che l'umore (nell'e-sport ma anche negli sport normali) conta tanto. Se tu parti già con l'idea di \"ah ne ho vinte una serie, ora questa la perderò per via delle congiunzioni astrali oppure perché la mia botlane è francese\", sicuramente già parti male e giocherai male andando probabilmente anche in tilt.\n\nEdit: no scusa, quando ero in bronzo ne ho vinte sei di fila.","replies":[]},{"poster":"Otivnaig","date":"2015-09-20T11:09:30.691+0000","up_votes":2,"down_votes":1,"body":"Ancora con 'sta storia? Ma non vi stancate mai di dire babbionate? E ancora dite che non esiste? \nNon vi riposate mai.","replies":[]},{"poster":"lucanomax1994","date":"2015-09-20T08:30:11.844+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Sorcio84","date":"2015-09-20T10:57:02.120+0000","up_votes":1,"down_votes":0,"body":"{{champion:223}} minchia guaddi ?\n{{champion:64}}  io ? niente\n{{champion:223}} bravo bravo...","replies":[]}]}]}