{"poster":"Langhow","date":"2017-01-26T09:06:55.514+0000","title":"Hey riot.. thanks for the free skin.. but question! :)","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"so i just relogged into my client and was notified with a little pop up window and a chest saying \" thank you you've earned riot kayle from riot games \" ... im not sure why you decided to give me a gift but thank you, however the gift you decided to give me i already had, i've had riot kayle for a very long time :( so i was wondering if i could get this gift changed? i mean i do appreciate the gesture but .. you didnt really give me anything :P love you Riot \r\n\r\n-long time fan.\r\n\r\nalso i took a pic with my phone i can attatch if you want just let me know","replies":[{"poster":"Porocles","date":"2017-01-26T18:45:17.674+0000","up_votes":1,"down_votes":0,"body":"No gifts were sent I'm afraid.  We enabled toast notifications for testing on the updated client.  Per the current [support ticker](https://support.riotgames.com/hc/en-us/articles/115002024567--Jan-26-Click-here-if-you-are-getting-notifications-about-receiving-gifts-in-the-updated-client-), what you're seeing is a backlog of content you've already received.  Sorry for the confusion!","replies":[{"poster":"Langhow","date":"2017-01-26T20:33:16.460+0000","up_votes":1,"down_votes":0,"body":"Fair enough.. *Cough* i deserve a skin for my troubles, and the emotional roller coaster*cough*\n\nThanks for the response Riot Porocles <3 Keep up the great work","replies":[{"poster":"Porocles","date":"2017-01-26T22:26:26.882+0000","up_votes":1,"down_votes":0,"body":"I totally understand, it's like that feeling when your toaster dings but your bread is still soggy.  Or when you toast bread but forget, so you hear the pop and freak out.  \n\nhttp://i0.kym-cdn.com/photos/images/original/000/185/722/1318563689003.jpg","replies":[{"poster":"ReZisT Lust","date":"2017-01-27T13:12:47.317+0000","up_votes":2,"down_votes":0,"body":"why would bread be soggy? Unless it was dipped in water... You should keep water away from toasters and just dry it in the oven{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]}]}]}