{"poster":"Bessere","date":"2014-10-20T12:47:06.709+0000","title":"Ranked team felálás","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Miért van az hogy bármikor rankedezek haverommal mindketten silverbe vagyunk és csapatársnak ilyen silver 4-5 és bronzosokat kapunk ellenfélnek meg goldosokat?","replies":[{"poster":"KuvinFukinAtya","date":"2014-10-20T12:51:32.370+0000","up_votes":1,"down_votes":0,"body":"GOndolom gyeng az elotok.","replies":[{"poster":"Bessere","date":"2014-10-20T12:55:21.295+0000","up_votes":1,"down_votes":0,"body":"az oké de akkor gyenge elos ellenfeleket kéne kapnunk de ehelyett igen erőseket kapunk","replies":[{"poster":"KuvinFukinAtya","date":"2014-10-20T13:40:17.460+0000","up_votes":1,"down_votes":0,"body":"Gyenge elo golban is van.Amúgy nyugi szerintem direkt csinálja riot ezt:D\nNekem is ez van","replies":[{"poster":"Bessere","date":"2014-10-20T14:01:52.332+0000","up_votes":1,"down_votes":0,"body":"meg azért arra kitalálhatnának valamit hogy ha leavel valaki akkor ne számolja losnak mert ez is elég sűrűn van nekem :(","replies":[{"poster":"Zooty","date":"2014-10-20T14:10:20.468+0000","up_votes":1,"down_votes":0,"body":"És ugye ezt úgy gondoltad hogy a wint se adja meg nektek hogyha az ellenfélbe van afk. Ah, hogy így már nem is olyan jó ötlet...","replies":[{"poster":"Bessere","date":"2014-10-20T14:58:57.968+0000","up_votes":1,"down_votes":0,"body":"dehogynem ha van 1 leaver akkor senki se kapjon se loset se wint és aki leavelt banolják 1 hétre","replies":[{"poster":"Zooty","date":"2014-10-20T16:43:32.521+0000","up_votes":2,"down_votes":0,"body":"És ha egyszer csak elmegy valakinek a nete, akkor ő is kapjon 1 hetes bannt?","replies":[{"poster":"GODLIKE Kha Zix","date":"2014-10-20T18:14:37.072+0000","up_votes":1,"down_votes":0,"body":"Meg a teljes csapata és az összes online barátja is!","replies":[{"poster":"VampVik","date":"2014-10-25T21:27:28.874+0000","up_votes":1,"down_votes":0,"body":"A szervert ne küldjék offline-ra 1 hétre?","replies":[]}]}]},{"poster":"VampVik","date":"2014-10-25T21:26:44.864+0000","up_votes":1,"down_votes":0,"body":"Az tök jó ötlet, mostantól az ellenfélben csak olyan premade-k lesznek akikből az egyik e-bay acc és ha vesztésre állnak a smurf kilép, no lose, no -LP...\nSzóval innentől ha vesztesz -LP-t kapsz ha meg nyersz akkor semmit. Hogy hangzik?","replies":[]}]}]}]}]}]}]},{"poster":"Szakálgyepál","date":"2014-10-20T14:35:56.409+0000","up_votes":1,"down_votes":0,"body":"Ha leaver miatt állandóan \"loss forgiven\" (statisztikán kívüli vereség) lenne akkor ha az egyik csapat nagyon kikapásra állna valaki csak egyszerűen kilépne :) főleg ha duoznak.\n\nErre szerintem esetleg -LP csökkenés lenne talán a legjobb, bár még így is visszaélnének vele tuti.( -15 lp veszteség helyett -10 vagy valami ilyesmi :D )","replies":[{"poster":"VampVik","date":"2014-10-25T21:46:55.455+0000","up_votes":1,"down_votes":0,"body":"Szerintem meg a leaveres problémára az egyetlen megoldás a megszüntetése lenne.\nErre két lehetőség van:\n1. Felbérelni egy rakat zsoldost, hogy álljanak minden egyes LoL játékos háta mögé a tarkójukra szegezett fegyverrel, de mivel tudjuk, hogy én úgy is leverném a rám állított zsoldost, így ez a rendszer se lenne tökéletes.\n2. Írni egy raklapnyi MI szinten működő bot-ot, külön minden hőshöz, minden divízióba. Ha kilép egy bronzos Teemo akkor átveszi a helyét egy bronzos Teemo bot (a kari, a tárgyai, meg a már megszerzett pénze változatlan marad, csak a jövőbeni döntéseket fogja a gép hozni), ha egy csellengő Kata lép ki akkor egy chalangeres Kata bot veszi át a helyét. Természetesen reconnect-nél a bot visszaadja a stafétát, ha meg nem tér vissza a delikvens akkor megy a büntetés, de a csapat nem kerül emberhátrányba.\n3. Világuralom.\nPersze ezekhez az ötletekhez 3 medencényi pénzre lenne szükség méghozzá Fontban, szóval akinek elege van az afk-kból az kezdjen gyűjtést és adjon be petíciót, hogy valósítsák meg ezen ötletek valamelyikét.","replies":[]}]},{"poster":"Zooty","date":"2014-10-20T14:08:45.068+0000","up_votes":1,"down_votes":0,"body":"Ne a ligát nézd, csak az mmr számít. Ha duóztok, akkor azt is beleszámolja a rendszer, és erősebb ellenfelet ad azért, hogy kompenzálja azt hogy duoba vagytok..","replies":[{"poster":"Kadegrow","date":"2014-10-21T13:43:57.258+0000","up_votes":1,"down_votes":0,"body":"Nálam is így szokta erősebb ellenfél. De sajnos csak az ellenfelet nézi és hozzám meg kezdőket rak be. (4.13)\nLegalább, akkor hozzám is erőseket rakjon vagy legalább hozzám hasonlóan az ellenfél és a csapattársaim egyenlőek legyenek.\nMert nem fer, hogy minden goldos meg platinás azért jut fentebb mert gyengéket kapnak ki, hogy azoknak erős legyen ők alig tesznek valamit mi meg vért izzadunk.\nNem lenne gond, ha ritka lenne az ilyen, de sajnos 10-ből 8-9-et így rak be és ez mellé még jönnek a Trollok is ami még rá tesz egy lapáttal.","replies":[]},{"poster":"Bessere","date":"2014-10-20T15:00:11.636+0000","up_votes":1,"down_votes":0,"body":"értem na ezt jó tudni köszi szépen :)","replies":[]}]}]}