{"poster":"yokpo93","date":"2017-12-23T06:41:13.379+0000","title":"juego solo, no quiero 4 premade","subforum":"Charlas Generales","up_votes":28,"down_votes":12,"body":"SI JUGAS SOLO, NO TENES QUE SER EMPAREJADO CON 4 PREMADE, POR RAZONES, CHISTES INTERNOS, REPORTAN JUNTOS Y AMENAZAN SI NO SEGUIS SUS \"INDICACIONES\", ES INJUSTO Y MOLESTO PARA EL JUGADOR. Eliminen los premades de 4 en TODAS las colas. \r\nIGUAL SEGURAMENTE BANEARAN ESTE POST, POR QUE LES MOLESTA LOS CONSEJOS PARA AYUDAR A MEJORAR ESTA \"HERMOSA COMUNIDAD\"","replies":[{"poster":"Desergt Pander","date":"2017-12-23T13:34:00.137+0000","up_votes":8,"down_votes":0,"body":"Sí llegasen a borrarlo es por el uso de mayúsculas, no por otra cosa xd","replies":[{"poster":"La corrupción","date":"2017-12-23T16:11:17.818+0000","up_votes":1,"down_votes":0,"body":"Creo que como en el título no es, lo van a dejar pasar","replies":[]}]},{"poster":"Priestess Winda","date":"2017-12-23T06:47:41.120+0000","up_votes":6,"down_votes":2,"body":"me han tocado muchas veces premades de 4 amenazando con reportar, y aun asi jamas tuve ninguna sancion. Si crees que estan siendo toxicos reportalos a final de la partida y ya. \nNo hay mucho que hacer, ademas no podes hacer que les eviten jugar a 4 amigos juntos, eso no es un buen aporte a la comunidad realmente","replies":[{"poster":"yokpo93","date":"2017-12-23T06:57:33.018+0000","up_votes":5,"down_votes":4,"body":"A esta perfecto jugar amenazado, como dijeron arriba, en flex no hay premade, por 2 razones, dificil emparejar y por que imagínate jugar una flex con cuatro premade y que a uno de ellos le toque una posicion que no les gusta","replies":[{"poster":"Priestess Winda","date":"2017-12-23T07:10:57.389+0000","up_votes":8,"down_votes":1,"body":"los reports sin justificacion se descartan, asi que sus amenazas no deberian preocuparte a menos que seas toxico.\n\nPodes dodgear, podes darle tu posicion. Tenes opciones para lidiar con la gente que \"no le toca la posicion que queria\", esta en vos tomarlas o no","replies":[{"poster":"Borriic III","date":"2017-12-24T02:48:25.576+0000","up_votes":1,"down_votes":0,"body":"Falso, hoy me suspendieron chat 10 partidas porque el flamer del team se invento que yo lo flamiaba a el e hizo que los rivales y su premade me reportaran, solo importa la cantidad de reportes o te pensas que van a leer uno por uno cada report?\n\njugar con  una premade de 4 es por lejos la peor experiencia y si tanto quieren jugar juntos el grupo de amiguitos que jueguen 2 y 2 o que se consigan un quinto, no es tan dificil","replies":[{"poster":"Priestess Winda","date":"2017-12-24T03:28:01.142+0000","up_votes":1,"down_votes":0,"body":"Pueden haber excepciones y que te haya caido una sancion injusta quiza, pero a mi jamas me paso y uso mas de 5 cuentas diferentes de las cuales ninguna fue sancionada ni tuvo restricciones de ningun tipo. Segun mi experiencia, los reportes sin sentido son descartados, si algun dia me sancionan te comentare si fue injusto o no.\n\nSaludos{{champion:34}}","replies":[{"poster":"Borriic III","date":"2017-12-24T03:56:07.338+0000","up_votes":3,"down_votes":0,"body":"te creo bro, yo juego desde finales de season 1 y nunca me suspendieron chat o algo asi antes, pero justo hoy cuando a un flamer se le ocurre inventar por chat all que yo lo insultaba (cuando fue el quien lo hizo toda la partida) y que luego sus premades confirmaran su mentira tambien por chat all, si te comes 7 u 8 reportes de golpe te cae un castigo injusto y es un poco logico, si uno no ve el chat de los rivales y luego el equipo rival completo esta acusando a uno de insultar por muy mentira que sea uno no tiene el por que dudar de los otros 4\n\nsupongo que eso tambien es parte del juego, pero soy fiel partidario a eliminar las premades de 4, sinceramente siento que es una de las cosas que dañan muchisimo este gran juego","replies":[{"poster":"Priestess Winda","date":"2017-12-24T04:12:24.856+0000","up_votes":2,"down_votes":1,"body":"Como dije antes, me parece raro mandale ticket al soporte de ultima, pero como dije nunca me paso nada contra premades y no premades asi que no puedo decir mucho.\n\nYo no creo que deban sacar las premades de 4.","replies":[{"poster":"Borriic III","date":"2017-12-25T07:26:58.373+0000","up_votes":1,"down_votes":0,"body":"el soporte de este juego es espectacular en practicamente todas las areas excepto en la parte de baneos y sanciones, el sistema en esa parte esta mayoritariamente automatizado (igual seria re pesado ir revisando caso a caso, se entiende, en especial en LAS), cualquier problema que tengas son geniales y tienen una disposicion de oro para resolverlos, excepto si se trata de sanciones XD \n\nde cualquier modo 10 partidas no es mucho, en arams se hacen rapido, ademas no es lo mio eso de flamear y la gente normalmente me da honor por jugar bien o hacerlos reir asi que esta sancion mas que hacerme pasar un mal rato temporal y quitarle un poco de risa a mis partidas, no me dolio, se que volvere a recuperar rapidamente el nivel de honor y tal (aunque ya no tendre mi syndra justiciera (?) xd )\n\nlo bonito del foro es que podemos pensar distinto y esta genial, yo si creo que las premades de 4 deben desaparecer pero respeto tu posicion de mantenerlas \n\nsaludos compa :D","replies":[]}]}]}]}]},{"poster":"20th CenturyBoys","date":"2017-12-23T17:17:27.055+0000","up_votes":2,"down_votes":1,"body":"los reports se basan en la cantidad, asi funciona el sistema, te reportan 4 personas por feeder y vos moriste 2 veces en 50 minutos y te comes el ban o un aviso o lo que sea","replies":[{"poster":"Priestess Winda","date":"2017-12-23T20:18:42.979+0000","up_votes":2,"down_votes":1,"body":"A mi jamas me paso, aun llendo 1/7 en una partida y todos amenazandome de troll xd","replies":[]}]}]}]}]},{"poster":"Deigex","date":"2017-12-23T13:41:40.751+0000","up_votes":3,"down_votes":0,"body":"Juga flex o soloq y chau problema, negar en una normal que 4 amigos jueguen y si les falta uno tenga que quedar afuera no me parece, por algo cuando somos 4 y no podemos jugar flex jugamos normal reclutamiento.","replies":[{"poster":"Nuke","date":"2017-12-23T18:54:26.793+0000","up_votes":1,"down_votes":0,"body":"Bueno, voy a jugar Flex. Pero luego no vengan con post tipo \"Está mal probar campeones en ranked\", eh xD\nY si termino 0/10 no me digan nada.","replies":[{"poster":"IroNNNN","date":"2017-12-23T20:56:04.674+0000","up_votes":1,"down_votes":0,"body":"Si no decis nadie sabe, vos juga como se te cante, mientras no digas que es tu primer game nadie te va a flamear, reportar y menos banean por jugar un champ que no sabes en ranked...","replies":[]},{"poster":"Deigex","date":"2017-12-23T19:03:44.676+0000","up_votes":1,"down_votes":0,"body":"Yo no te voy a cruzar así que hace lo que quieras, el que destruye su elo en la cola sos vos.","replies":[{"poster":"Nuke","date":"2017-12-23T19:43:10.214+0000","up_votes":1,"down_votes":0,"body":"Pero ahi estás jodiendo a otras 4 personas man","replies":[]}]}]}]},{"poster":"Champi4UP","date":"2017-12-23T06:42:28.174+0000","up_votes":4,"down_votes":1,"body":"En las flex no hay premade 4 mmm xD\nJuega flex :3","replies":[]},{"poster":"MILFortune","date":"2017-12-23T10:48:15.865+0000","up_votes":4,"down_votes":3,"body":"Ah.... cómo olvidar a esos pre-made que tuve que trolear por molestarme. Bueno, en realidad ni los recuerdo pero ellos no se han olvidado de mí.","replies":[{"poster":"UnMainMordeTonto","date":"2017-12-24T06:05:16.355+0000","up_votes":2,"down_votes":0,"body":"JAJAJAJAAJAJJAJAJAAJAJAJJAJAJAJ.","replies":[]},{"poster":"iLegault","date":"2017-12-23T11:16:30.876+0000","up_votes":1,"down_votes":6,"body":"Pobre tipo.","replies":[]}]},{"poster":"KillgoreZ","date":"2017-12-23T09:58:55.123+0000","up_votes":3,"down_votes":2,"body":"Si sos inocente no tenés nada que perder {{champion:119}}","replies":[]},{"poster":"20th CenturyBoys","date":"2017-12-23T17:16:23.894+0000","up_votes":2,"down_votes":1,"body":"me pasa todos los dias, es asqueroso que encima en el otro equipo te toquen tambien 4 premades y que juegan mejor que los tuyos como si los de tu team hicieran premade sin skype o teamspeak solamente para romper los quinotos","replies":[]},{"poster":"vaVav","date":"2017-12-23T21:35:32.061+0000","up_votes":1,"down_votes":1,"body":"No, probablemente eliminen este post por SPAM.","replies":[]},{"poster":"Nuke","date":"2017-12-23T18:51:07.663+0000","up_votes":1,"down_votes":1,"body":"Siempre dejan una razón válida antes de borrar un post.\nOtra cosa se que no la leas/la ignores y empieces a especular con cosas re conspiracionistas como que Riot nos quiere jod*r sin razón aparente y porque si, asi que censura todo contra su postura.","replies":[]},{"poster":"El Impostor","date":"2017-12-23T14:29:22.659+0000","up_votes":3,"down_votes":3,"body":"O sea que no debería jugar con 3 amigos porque un boludito entra a jugar poniendose parches antes de la herida?","replies":[]},{"poster":"EnsaladaViolenta","date":"2017-12-23T14:28:35.338+0000","up_votes":2,"down_votes":2,"body":"Juga Flex corta. Mira  si van a sacar la posibilidad de tener cuatro persona por que al señorito le gusta jugar solo, es un juego de 5 aguántatela si no anda a jugar al maincra","replies":[]}]}