{"poster":"The Great Blade","date":"2015-06-05T11:10:31.914+0000","title":"Vintis, The Creator","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"Vintis, The creator\r\n\r\nBase Stats\r\nHealth: 420 (+34)\r\nHealth Regen: 1.3 (+.45)\r\nMana: 794 (+17)\r\nMana regen: 3.4 (+.8)\r\nRange: 545\r\nAttack Damage: 26 (+3)\r\nAttack Speed: 1.05 (+0.1)\r\nArmor 5 (+3.0)\r\nMagic Resist 39 (+1)\r\nMovement Speed: 325 (-5 for every drone active)\r\n(All movement speed bonuses are halved)\r\n\r\nAbilities\r\n\r\nPassive: Adaptive Turret\r\nVintis&#039;s guard turret that flys around him is his basic attack. Every shot he does to an enemy increases damage done to them by 5% stacking up to 4 times. Slows them by 1.5% up to 10 stacks. Increases turret attack speed by 4% stacking 4 times.\r\nTurret has overheat. Every attack on a minion and monster increases it by 3 and every attack on a champion increases it by 7. Has 100 overheat. If not attacking for 5 seconds it starts to cool down at 10 per seconds.\r\nWhen overheated all bonuses are removed and turret&#039;s attack speed is reduced by 45%, attack damage by 50%, and attacks decrease Vintis&#039;s movement speed by 30% for 0.5 seconds, and range is decreased to 500 for 7 seconds, but when it finishes cooling down the bonus&#039;s it gets when attacking are doubled for 4 seconds\r\n\r\nPassive: \r\n\r\nQ - Scouting Drones\r\nCooldown: 10 seconds per drone used\r\nDamage: None\r\nMana Use: 90 per/ 85 per/ 80 per/ 80 per/ 75 per\r\nDescription: Can throw three drones across a distance for a certain amount of time. while flying to their destination they have shortened vison. When they arive at their destination their vision is increased 450 units and they stay there for one second every level.. For everyone that gets shot down by an enemy the cooldown is creased to 25 per drone (capping at 60 seconds). When killed they fly back to Vintis and enemies gain sight of him for 2 and 0.5 for every level.\r\n1st Range: 300\r\n2nd Range: 500\r\n3rd Range: 600\r\n1st Health: 500\r\n2nd Health: 350\r\n3rd Health: 125\r\n\r\nW - Guard Drone\r\nCooldown: 12/10/8/4/2 Seconds\r\nRange: 350/380/410/430/450\r\nMana Use: 120 \r\nDescription: Vintis spawns another guard drone and throws it to a target location. It has 50% of all of Vintis&#039;s stats. It stays there for 8 if in own base, 6 if in lanes (If under tower lasts for 8) or jungle and 4 seconds if in enemy base. If killled increases cooldown by 50%. For every drone active it adds a consecutive extra 40 mana.\r\nEvery 7th turret strike launches a special, slow moving projectile that does 50% of Vintis&#039;s AP.\r\n\r\n\r\nE - Augmented Shield Drone\r\nCooldown: 24/23/22/21/20 Seconds\r\nShield: 50/75/100/125/150\r\nAP Scaling (For shield): 2.5 AP for one shield \r\nEffect: Can shield self or Drone within 400 units for 4 seconds. Adds 20 health regen per second and 10 mana regen (can target inner, inhib and nexus towers)\r\n\r\n\r\nR - Drone Wave. \r\nCooldown: 300/250/200\r\nMana Use: 350\r\nEffect: Opens a portal within 200 range that spawns a wave of minion-like drones that Vintis can command with pressing R again or using the alt key and moving. They cannot move out of 1200 range of Vintis. They regen 5 health every second out of combat. They refuse to enter enemy base.\r\n\r\nWarrior Drone:\r\nDamage: 25% of Vintis&#039;s AD\r\nHealth: 95% of Vintis&#039;s health\r\nMovement Speed: 325\r\nRange: 200\r\nArmour: 50% of Vintis&#039;s\r\nMagic Resist: 20% of Vintis&#039;s\r\nSpecial: Takes 50% less damage from champions.\r\n\r\nMage Drone:\r\nDamage: 25% of Vintis&#039;s AP is converted into AD\r\nHealth: 50% of Vintis&#039;s health\r\nMovement Speed: 325\r\nRange: 400\r\nArmour: 20% of Vintis&#039;s\r\nMagic Resist:  50% of Vintis&#039;s\r\nSpecial: Deals 250% damage to Champions\r\n\r\nCannon Drone:\r\nDamage: 100% of Vintis&#039;s AD and 10% of Vintis&#039;s AP\r\nHealth: 200% of VIntis&#039;s health\r\nMovement Speed: 325\r\nRange: 450\r\nArmour: 50% of Vintis&#039;s\r\nMagic Resist:  50% of Vintis&#039;s\r\nSpecial: Deals 400% damage to siege minions and slows them by 30% every attack for 2 seconds.\r\n\r\nChampion description: Vintis excells extremely well at fortifying but not so much at pushing. Vintis will not push lanes to the Nexus and win the game, but he will certainly defend the base while allies push. (Mainly designed to help deal with... &#039;special&#039;... Bronzies who should not even be allowed to play Ranked.   If you&#039;re team is beyond winning, Vintis won&#039;t shine, and will do quite badly if he attempts to push, but he does shine like gold when you&#039;re down on you&#039;re luck and the enemy has pushed to nexus turrets","replies":[{"poster":"Parvius","date":"2015-06-05T12:40:54.059+0000","up_votes":1,"down_votes":0,"body":"an AD {{champion:112}}?","replies":[]}]}