{"poster":"RealSlimShadey","date":"2017-06-16T01:55:21.892+0000","title":"Snowballen vs Farmen","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"**Hallo erstmal :D**\r\n\r\nMeine Frage bezieht sich darauf ob es besser ist die erste Halbe Stunde des Spieles nur zu farmen um einen Gold- und Levelvorteil zu erhalten und daf&uuml;r das roamen aufzugeben oder ob es vielleicht doch besser w&auml;re, wenn m&ouml;glich, sehr aggressive zu spielen und so viele Kills wie m&ouml;glich zu schaffen.\r\n\r\nJa die Frage ist recht kurtz aber ist die Antwort genauso knapp?","replies":[{"poster":"ü ö","date":"2017-06-16T05:37:48.708+0000","up_votes":4,"down_votes":0,"body":"Ja ist sie, denn es gibt keine Antwort drauf.\n\nWäre eine Methode grundsätzlich effektiver als die andere, gäbe es die andere gar nicht, warum auch? Jedes Spiel ist anders und in jedem Spiel musst du dich neu entscheiden.","replies":[]},{"poster":"Humpelstilzche","date":"2017-06-16T06:59:42.539+0000","up_votes":2,"down_votes":0,"body":"Das kann man wirklich nicht so allgemein sagen, das hängt von der Situation ab. \nTendenziell würde ich aber sagen, dass meistens das was du hier \"snowballen\" nennst die bessere Option ist, wobei der Fokus weniger auf \"so viele Kills wie möglich\", sondern auf \"so viele Objectives wie möglich\" liegen sollte. \nLoL ist nach wie vor sehr teamlasting und als einzelner Spieler einen gewaltigen Vorteil zu haben, bringt nicht soooo viel. Auf jeden Fall nicht so viel, wie wenn alle Teammates einen kleinen Vorteil haben. \n\nDaher sollte man nie vergessen, dass ein Lane-Vorteil quasi wertlos ist, wenn man keinen Weg findet wie die Teammates davon profitieren. Wie genau man das macht, hängt von der Situation ab. Bei manchen Champs und Situationen ist Splitpushen die beste Option. Manchmal sind es Ganks oder Teleport-Ganks. Manchmal ist es der Harald, manchmal Drachen. Manchmal der gegnerische Jungel. Manchmal irgendwas anderes.","replies":[{"poster":"LustigeLandmine","date":"2017-06-16T15:40:43.129+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=vatevpvi,discussion-id=3EodsQl3,comment-id=0001,timestamp=2017-06-16T06:59:42.539+0000)\n>\n> Das kann man wirklich nicht so allgemein sagen, das hängt von der Situation ab. \n> Tendenziell würde ich aber sagen, dass meistens das was du hier &quot;snowballen&quot; nennst die bessere Option ist, wobei der Fokus weniger auf &quot;so viele Kills wie möglich&quot;, sondern auf &quot;so viele Objectives wie möglich&quot; liegen sollte. \n> LoL ist nach wie vor sehr teamlasting und als einzelner Spieler einen gewaltigen Vorteil zu haben, bringt nicht soooo viel. Auf jeden Fall nicht so viel, wie wenn alle Teammates einen kleinen Vorteil haben. \n> \n> Daher sollte man nie vergessen, dass ein Lane-Vorteil quasi wertlos ist, wenn man keinen Weg findet wie die Teammates davon profitieren. Wie genau man das macht, hängt von der Situation ab. Bei manchen Champs und Situationen ist Splitpushen die beste Option. Manchmal sind es Ganks oder Teleport-Ganks. Manchmal ist es der Harald, manchmal Drachen. Manchmal der gegnerische Jungel. Manchmal irgendwas anderes.\n\nFiora mit einem Kill tötet dich auch und danach dein Team :^)","replies":[{"poster":"GilleteDaniel","date":"2017-07-13T10:13:02.163+0000","up_votes":1,"down_votes":0,"body":"Und wenn Fiora tod ist ist dein Team am Arsch.","replies":[]}]}]},{"poster":"dugg","date":"2017-06-19T10:05:29.105+0000","up_votes":1,"down_votes":0,"body":"Es gibt hier schon viel schlauere Antworten als meine, trotzdem komme ich nicht umhin, meinen Senf dazuzugeben.\n\nGrundsätzlich hängt es von der Gesamtsituation des Spiels ab und ist eigentlich nicht mit das oder das zu beantworten.\n\nDennoch habe ich für Farmen gestimmt. Wenn auch nur mit ganz knappen Vorsprung vor beides gleicheffektiv. Farmen ist für mich immer die bessere Alternative, da man in meinen Low-Elo-Bereich nicht den Gegner unnötig füttern sollte. Trades einmal öfter meiden, als hart in sie reingehen. Der Grund ist einfach, weil man den Trade als Lowby mal ganz schnell verlieren kann und das ist einfach das schlechteste. Man gibt dem Gegner Gold, hat Respawnzeit verliert dadurch jede Menge Gold und Erfahrung. Nicht zu sterben ist immer wichtig. Daher geht mein Punkt an Farmen und die damit verbundene Vorsichtig nicht zu jeden Kampf zu führen.","replies":[]},{"poster":"Holokom","date":"2017-06-19T09:38:57.026+0000","up_votes":1,"down_votes":0,"body":"Die Antwort ist simpel: beides gleichzeitig , spiel passiv und lass den Gegner pushen dann bekommst du mehr farm UND mehr kills , wenn der gegner schleu genug ist nicht zu pushen, push ihn rein und geh roamen.\n\nnennt sich minionwave managment , oder makroplay.","replies":[]},{"poster":"Pandeonor","date":"2017-06-16T09:51:06.684+0000","up_votes":1,"down_votes":0,"body":"Hm. Frage in die Runde -- bringt ein Kill nicht automatisch durch das fehlen eines Gegners für einen gewissen Zeitraum nicht auch ein Vorteil beim farmen?","replies":[{"poster":"Euronymus88","date":"2017-06-19T08:16:35.096+0000","up_votes":1,"down_votes":0,"body":"Doch auf jeden Fall, es geht auch gar nicht darum wieviel Farm man während des Kills verpasst (sondern wieviele Unterschied man zum Gegner holt), denn dein Gegner kann ja in der Regel auch nicht farmen, wenn es zum Kampf kommt.\n\nWenn man die Lane nach dem Kill rauspusht resultiert das immer in einem Farmvorteil, je nach Minionwave kann der grösser oder kleiner sein.\n\nIst das selbe wie wenn der Gegner zurückporten muss, obwohl es auf der Lane genügend Minions zum farmen hätte, da verliert er so oder so Minions je nach Situation mehr oder weniger.\n\nIm Endeffekt ist aber ein Zurückporten viel besser als getötet zu werden, da man neben dem Gold das man dem Gegner giebt noch mehr Minions verliert.\n\n\nZum Thema: Wie gesagt wurde ist das immer schwer zu sagen, am besten ist natürlich bei beiden Dingen einen guten Schnitt zu haben, dass bringt schlussendlich am meisten XP und Gold. \n\nEntweder oder ist aber sehr abhängig vom Champion oder der Situation, die einen Champs müssen sogar fast Ihr starkes early Game verwerten, damit Sie gut ins mid-late kommen andere können auch die Lane verlieren und werden trotzdem eine grosse Bedrohnung.\n\nIm Endeffekt sind Objektivs am wichtigsten, denn selbst wenn man als Team einen grossen Goldvorsprung hat ist es vorbei wenn der Nexus down ist.\nAusserdem geben Sie einem im ganzen Team einen Vorteil und ist erst mal ein Turm down dann bleibt das so.","replies":[]},{"poster":"RAG Ryve","date":"2017-06-16T11:42:37.500+0000","up_votes":1,"down_votes":0,"body":"Es gleicht maximal den Farm aus den du während des Kampfes nicht genommen hast, außer vlt bei sehr schnellen Kills.\nIn der Regel bekommst du dann aber auch meist nur 1-2 Waves bis man Base gehen sollte um gleichzeitig mit dem Gegner wieder auf der Lane zu sein. Ein wirklicher Vorteil ist es also nicht ganz.","replies":[]}]}]}