{"poster":"Steinwehr","date":"2016-06-30T14:21:24.519+0000","title":"Wurde ,,gehackt''","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich bin mir dem Account meines Freundes hier online, da mein anderer Account abgezogen wurde. Ich warte seit 4 Tagen auf eine Antwort von dem Ticket aber nichts passiert. Ich habe Geld investiert was jetzt weg ist. Ich weis weder wie ich mir helfen kann, noch ob mir der Support hilft. Der ,,Hacker&#039;&#039; hat mein Passwort und wahrscheinlich auch die E-Mail Adresse ver&auml;ndert. Der Name meines verlorenen Accounts ist ShooterTim. Kann mir wer helfen?","replies":[{"poster":"ikslhairtuz","date":"2016-06-30T16:17:44.245+0000","up_votes":1,"down_votes":0,"body":"Und auf welcher Freeriotpoints Seite hast du dich rumgetrieben wenn er gleich dazu deine E-mail hat? :)","replies":[]},{"poster":"Steinwehr","date":"2016-06-30T14:54:29.187+0000","up_votes":1,"down_votes":0,"body":"Genau das habe ich versucht, aber es kommt einfach keine Email an. Deswegen bin ich ja so verwundert","replies":[{"poster":"HHaie tabbian","date":"2016-06-30T15:07:31.177+0000","up_votes":1,"down_votes":0,"body":"Da gibt es dann zwei Möglichkeiten. Entweder du hast doch eine andere Emailadresse verwendet. Oder du hast irgendwo dein emailpasswort eingegeben oder es ist sogar identisch mit dem von LoL","replies":[{"poster":"Steinwehr","date":"2016-06-30T15:36:22.929+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tabbian,realm=EUW,application-id=7hciEY9w,discussion-id=Tqnr0e08,comment-id=00040000,timestamp=2016-06-30T15:07:31.177+0000)\n>\n\n\nSo an der Email lag es dann leider nicht. Mir gehen die Ideen aus was ich tun soll. Der Support hilft mir auch nicht weiter.","replies":[]}]}]},{"poster":"Steinwehr","date":"2016-06-30T15:25:13.148+0000","up_votes":1,"down_votes":0,"body":"Ja. Ich checke grade eine andere Email Adresse. Nur so falls es das auch nicht ist, wie kann ich mir weiterhelfen?","replies":[]},{"poster":"Steinwehr","date":"2016-06-30T14:25:26.820+0000","up_votes":1,"down_votes":0,"body":"Ja. Ich bin langsam verzweifelt. Ich habe was geschrieben und alle Infos gegeben die benötigt wurde (die Rückgaben, Geschenke...). Jetzt warte ich schon ne ganze weile. Mir wurde gesagt es dauert nur 3 Werktage aber naja. Weder eine Email noch weiteres...","replies":[{"poster":"HHaie tabbian","date":"2016-06-30T14:28:11.228+0000","up_votes":1,"down_votes":0,"body":"Sicher, dass du nicht nachträglich noch dem Ticket etwas beigefügt hast? Dabei wirst du in der Warteschlange nämlich wieder an den Anfang gesetzt. In der Regel antwortet der Support innerhalb von maximal zwei Tagen.\nHast du keine Kontrolle mehr über deine Emailadresse?","replies":[{"poster":"Steinwehr","date":"2016-06-30T14:35:57.814+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tabbian,realm=EUW,application-id=7hciEY9w,discussion-id=Tqnr0e08,comment-id=00010000,timestamp=2016-06-30T14:28:11.228+0000)\n>\n> Sicher, dass du nicht nachträglich noch dem Ticket etwas beigefügt hast? Dabei wirst du in der Warteschlange nämlich wieder an den Anfang gesetzt. In der Regel antwortet der Support innerhalb von maximal zwei Tagen.\n> Hast du keine Kontrolle mehr über deine Emailadresse?\n\nKönnen sie/du mir weiterhelfen was ich tun soll?","replies":[{"poster":"HHaie tabbian","date":"2016-06-30T14:44:52.865+0000","up_votes":1,"down_votes":0,"body":"Wenn der \"hacker\" keinen Zugriff auf deine Mail hatte, kann er doch, soweit ich weiß, gar nicht die Mailadresse geändert haben. Und wenn das so ist, kannst du doch einfach dein Passwort wiederherstellen lassen.","replies":[{"poster":"Steinwehr","date":"2016-06-30T14:47:38.964+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tabbian,realm=EUW,application-id=7hciEY9w,discussion-id=Tqnr0e08,comment-id=0001000000000000,timestamp=2016-06-30T14:44:52.865+0000)\n>\n>\n\nWie mache ich das? Er hat mein Passwort verändert und ich kann mich nicht mehr mit meinem Account anmelden. Ich weis nich weiter, da ich gerne wieder meinen Account haben möchte um zu spielen.","replies":[{"poster":"HHaie tabbian","date":"2016-06-30T14:52:42.561+0000","up_votes":1,"down_votes":0,"body":"Wenn dich auf der offiziellen LoL-Seite (diese hier gehört dazu) anmelden möchtest (dazu musst du dich logischerweise erstmal von dem Account, auf dem du gerade angemeldet bist, abmelden), gibt es dort ein Feld \"Passwort vergessen\". Wenn du da draufklickst, solltest du zu einer Seite weitergeleitet werden, auf der du deinen Benutzernamen angeben kannst, daraufhin sollte dir eine Email zugesandt werden, wo das weitere Vorgehen erklärt wird. Das ist das übliche Verfahren bei den meisten Passwortwiederherstellungen.","replies":[]}]}]}]}]}]},{"poster":"Steinwehr","date":"2016-06-30T14:31:09.306+0000","up_votes":1,"down_votes":0,"body":"Ich war öfters mit meiner Email Adresse online um nach neuen Nachichten zugucken, da nur meine Account Daten genommen wurden. Pishing war der Grund wodurch ich meinen Account verloren habe.","replies":[]},{"poster":"Steinwehr","date":"2016-06-30T14:29:53.910+0000","up_votes":1,"down_votes":0,"body":"Ja. Ich gebe zu ich habe am ERSTEN Tag nochmal per Email geschrieben. Naja jetzt sind halt schon 4 Tage vergangen, ohne das ich was nachträglich eingetragen habe.","replies":[]},{"poster":"Parunpata","date":"2016-06-30T14:22:43.326+0000","up_votes":1,"down_votes":0,"body":"Wir leider nicht, Das kann nur der Support. 4 Tagen warten ist aber auch schon ungewöhnlich.","replies":[]}]}