{"poster":"akiraco","date":"2016-03-31T16:09:12.721+0000","title":"solo a me è capitato?(ekko)","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"helloooo, vado diretto alla questione, primo punto: &quot;l&#039;ologramma&quot; (non mi viene il nome) della ulti appare circa 5 secondi prima dello scadere del cooldown, so che non dovrebbe fregare anessuno ma a volte ho premuto la ulti appena visto l&#039;ologramma e invece mancavano ancora 4 secondi. secondo punto: usando la E  per attraversare il muro per capirci...parte della mappa della squadra blu, zona del gromp, il muro che divide il fiume dalla zona del gromp, ecco quella, ho usato la E e dopo averlo superato mi ha portato dove ero prima dell&#039;utilizzo della skill. nonostante il salto fasico &egrave; riuscito e sono saltato al di l&agrave; del muro, &egrave; come se fosse tornato indietro o non avesse &quot;letto&quot; il superamento dell&#039;ostacolo, siccome mi &egrave; capitato gi&agrave; pi&ugrave; di una volta, ora so che non &egrave; stato un caso. {{summoner:4}} {{champion:245}}","replies":[{"poster":"Pls Buff Shen","date":"2016-03-31T16:29:43.643+0000","up_votes":2,"down_votes":0,"body":"Io ho notato un'altra cosa creepy, ero {{champion:35}} e giustamente stavo invadendo il red di {{champion:245}}  quando a un certo punto noto il suo ologramma passarmi davanti, io, che mi stavo cagando sotto visto che non avevo mana e smite, ho usato la Q per saltare oltre il muro ma dopo 3 secondi vedo dalla mappa che stava togliendo la pink che gli avevo piazzato al blue, non è la prima volta che capita. Pure in midlane mi capita di vedere passare l'ologramma della ulti di ekko, sto parlando di circa mezzo secondo in cui lo vedo, ma ekko 4 secondi fa non era assolutamente li. Ormai è chiaro {{champion:245}}  sta diventando il nuovo {{champion:268}}","replies":[{"poster":"Darkinknight","date":"2016-03-31T21:07:01.752+0000","up_votes":1,"down_votes":0,"body":"Ma quello lo fa da quando è uscito mi sa,di vedere per un attimo il suo ologramma sfrecciarti davanti anche se lui è dall'altra parte della mappa","replies":[{"poster":"Pls Buff Shen","date":"2016-03-31T21:31:27.223+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hellknight1994,realm=EUW,application-id=cAOZwaUi,discussion-id=AcRRE4ln,comment-id=00010000,timestamp=2016-03-31T21:07:01.752+0000)\n>\n> Ma quello lo fa da quando è uscito mi sa,di vedere per un attimo il suo ologramma sfrecciarti davanti anche se lui è dall'altra parte della mappa\n\nserio? quanti anni di vita ho sprecato vedendo quell'ologramma apparirmi in faccia....","replies":[{"poster":"Darkinknight","date":"2016-03-31T22:08:09.610+0000","up_votes":1,"down_votes":0,"body":"Non dirlo a me, fra flash e quant'altro..poi ci ho preso l'abitudine😂..non so perche non sia stato messo a posto in un anno che ha questo problema,magari non lo sanno nemmeno","replies":[]}]}]}]},{"poster":"Morion75","date":"2016-03-31T16:12:21.961+0000","up_votes":1,"down_votes":0,"body":"Se vai ha vedere uno degli ultimi video di Night Blue gli capita la stessa cosa. Io non sono main ecco ma anche a me capita di cliccare la ulti quando non la posso ancora usare. Quindi si, non sei il solo{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}