{"poster":"Karüra","date":"2015-07-25T17:39:47.539+0000","title":"informazione ban","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"salve a tutti, vorrei sapere in quali casi si pu&ograve; essere permanentemente bannati, cosa devo fare per esserlo? verr&ograve; avvisato prima? ci saranno ban pi&ugrave; lievi che antecedono il permaban o pu&ograve; essere che venga subito permabannato senza aver avuto limitazioni ranked o ban temporanei? grazie a tutti","replies":[{"poster":"Karüra","date":"2015-07-25T18:07:07.275+0000","up_votes":1,"down_votes":0,"body":"può esserci una limitazione ranked senza chat restricted? e un ban temporaneo senza limitazione ranked? e un ban permanente senza ban temporaneo?","replies":[{"poster":"kirchhoff","date":"2015-07-25T18:16:12.815+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Karüra,realm=EUW,application-id=MJVj50Jw,discussion-id=bZliYbt5,comment-id=0003,timestamp=2015-07-25T18:07:07.275+0000)\n>\n> può esserci una limitazione ranked senza chat restricted?e un ban temporaneo senza limitazione ranked? \n\nNon saprei ma penso sia progressivo.\n\n>e un ban permanente senza ban temporaneo?\n\nSi, nei casi:\ncheat/hack\nminacce\nrazzismo\neloboost","replies":[{"poster":"Karüra","date":"2015-07-25T18:23:09.787+0000","up_votes":1,"down_votes":0,"body":"come fai a sapere che può esserci solo in quei casi?","replies":[{"poster":"kirchhoff","date":"2015-07-25T18:24:46.600+0000","up_votes":1,"down_votes":0,"body":"La lista non è esaustiva.","replies":[]}]}]}]},{"poster":"kirchhoff","date":"2015-07-25T17:56:48.490+0000","up_votes":1,"down_votes":0,"body":"Tossicità estrema (flame)\nLinguaggio offensivo generico (se recidivo) minacce/razzismo/ecc. (basta una volta sola)\nCheat/hack/programmi che alterano i file del gioco (tipo skin, timer giungla)\nEloboost (fatto e subito)\nCercare di far saltare i server\nAfk a livelli assurdi (ma non sono sicuro)\n\n\nnel caso di afk e flame ci sono varie punizioni che vanno dalle chat ristrette alla coda a bassa priorità alle classificate ristrette","replies":[]},{"poster":"73668109_DEL","date":"2015-07-25T17:48:50.226+0000","up_votes":1,"down_votes":0,"body":"Puoi essere permbannato , anche senza prima aver avuto altre restrizioni.\nIl ban permanente diretto si da per uso di programmi di terze parti , elobusting , account comprati.\nIl permban puo' anche venire dopo una serie di ban da 14 giorni per gravi offese.\n\nSe qualcuno sa qualche altro caso intervenga.","replies":[]},{"poster":"Collassina","date":"2015-07-25T17:46:56.819+0000","up_votes":1,"down_votes":0,"body":"A chi è che vuoi fare uno scherzo di pessimo gusto? \n\nA parte gli scherzi, puoi essere pemabannato per tutti i motivi (più o meno) che vedi nella listina che ti piace tanto aprire a fine game per segnalare quel poveraccio nella tua squadra che sta 1 10 3.\nI più comuni sono per linguaggio offensivo, afk e uso di programma di terze parti.\nIl primo è preceduto da restrizioni della chat e da un ban di 14 giorni. Dopo di quello scatta il permaban.\nPer gli afk, ci sono le code a bassa priorità (5, 10, 20 minuti prima di cominciare una partita), ma devi arrivare a livelli davvero estremi nell'abbandonare partite per ricevere il permaban.\nQuello per i programmi di terze parti scatta senza preavviso.","replies":[]}]}