{"poster":"EV Milandri","date":"2017-03-06T17:18:14.058+0000","title":"Nerf Yi PLZ","subforum":"Champions & Gameplay","up_votes":2,"down_votes":3,"body":"Also ich muss echt sagen YI ist einfach viel zu Stark oder was meint ihr?\r\nAber anstatt Ihn zu Nerfen wwurde er gebufft -.-","replies":[{"poster":"SoloQisMentlBoom","date":"2017-03-06T17:52:32.560+0000","up_votes":2,"down_votes":0,"body":"Keine der beiden Antwortmöglichkeiten...Yi ist underpowerd","replies":[{"poster":"GankMeOrLose","date":"2017-03-09T07:24:45.262+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ruaga,realm=EUW,application-id=Wj1wcocU,discussion-id=lXVn98mT,comment-id=0002,timestamp=2017-03-06T17:52:32.560+0000)\n>\n> Keine der beiden Antwortmöglichkeiten...Yi ist underpowerd\n\nErläutere diese Behauptung doch bitte","replies":[{"poster":"SoloQisMentlBoom","date":"2017-03-09T17:52:57.416+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dragonyx44,realm=EUW,application-id=Wj1wcocU,discussion-id=lXVn98mT,comment-id=00020000,timestamp=2017-03-09T07:24:45.262+0000)\n>\n> Erläutere diese Behauptung doch bitte\n\n1. Yi ist ein Powerfarm-Jungler. Während der andere Jungler die Lanes aktiv mitentscheiden kann hat Yi eher Probleme damit, bzw. will das nicht unbedingt.\n\n2. Yi ist zu Beginn kein starker Duellant und kann somit einfach invaded und damit komplett aus dem Spiel gebracht werden.\n\n3. 1 Stun oder Root und Yi kann im Fight nichts mehr machen.","replies":[{"poster":"GankMeOrLose","date":"2017-03-12T02:39:27.168+0000","up_votes":1,"down_votes":0,"body":"> 1. Yi ist ein Powerfarm-Jungler. Während der andere Jungler die Lanes aktiv mitentscheiden kann hat Yi eher Probleme damit, bzw. will das nicht unbedingt.\n\nWenn die Laner CC haben kann Yi genauso viel ganken wie ein Lee. Hängt nunmal stark von der Spielweise des Spielers und der Laner ab\n\n> 2. Yi ist zu Beginn kein starker Duellant und kann somit einfach invaded und damit komplett aus dem Spiel gebracht werden.\n\nEin kluger Yi Spieler kann um diesen Umstand herrumspielen\n\n> 3. 1 Stun oder Root und Yi kann im Fight nichts mehr machen.\n\nSo wei bei JEDER Glaskannone. Kahzix? Zed? ADC's? Jeder tot sobals sie von einem Tank nur angestarrt werden. Yi hat zumindest noch die möglichkeit On-Hit Fighter zu bauen was ihm tankyness gibt die Assassins nicht haben. Somit steht er sogar noch sehr gut da im vergleich zu anderen Full Damage Junglern.","replies":[{"poster":"SoloQisMentlBoom","date":"2017-03-13T17:08:10.763+0000","up_votes":1,"down_votes":0,"body":"Man kann immer Argumente finden, warum etwas gut oder schlecht ist bzw. nicht gut oder nicht schlecht ist.\n\nDu gehst hier viel zu sehr ins Detail.\n\nJa der Laner kann CC haben. Aber was ist wenn der Laner keinen hat, dann muss der Gegner schon unterm eigenen Tower stehen das Yi ganken kann. Oft kommt ein Yi auch trotzdem nicht zum ganken. Ebenso muss der Laner seinen CC auch erstmal treffen bzw. nicht zu offensiv gehen nachdem er sich hat pushen lassen, weil es dem Gegner sonst sofort auffällt.\n\nKlar kann ein kluger Yi um diesen Umstand herumspielen, das können 5 Gegner aber auch!\n\nDer Unterschied bei deinem aufgezählten Jungler bzw. Champions ist zum einen ihr Early. Sie haben um einiges mehr \nImpact und wenn sie ihren Job gut machen, kümmert es sie auch nicht mehr ob sie mal CCed werden oder nicht. Ebenso haben sie um einiges mehr an Dodgepotential. Yi kann maximal sein Q machen wenn er aber auch in Range ist. Kha z.B. hat sein E und sein R.\n\nZu jedem deiner \"Argumente\" kann ich auch 1000 \"Gegenargumente\" finden. Das es sich hier eher um Beispielszenarien handelt ist wohl klar.\nIm Allgemeinen betrachtet ist Yi zZ einfach viel schlechter als die meisten Jungler! Und das ist Fakt.\n\nYi´s Winrate sinkt je höter man in der SoloQ-Elo geht, wobei sie bei anderen wie Kha´Zix massig ansteigt, ebenso zeigt sich das durch die Bannrate.\n\nEin Kha´Zix OTP wird ebenso mehr Erfolg haben als ein Yi OTP.\nVom Teamranked und Proszene brauchen wir gar nicht anfangen.","replies":[]}]}]}]}]},{"poster":"Ireliα","date":"2017-03-06T17:21:12.228+0000","up_votes":2,"down_votes":0,"body":"Gegen bestimmte Konstellationen (Viele squishys, wenig CC) ist er sehr stark. Gerade wenn das Game sehr lange geht oder er snowballt. Champions wie {{champion:111}} countern ihn aber so hart, dass er keinen Nerf vertragen kann.","replies":[]},{"poster":"Youtube GM Nasus","date":"2017-03-10T00:55:41.239+0000","up_votes":1,"down_votes":0,"body":"Also ich finde Yi zurzeit sehr schwach ... früher war er 1000 mal stärker ...... ABER wenn man ihn feedet dann sieht es ganz anders aus (wie bei alle champs)","replies":[]},{"poster":"EV Milandri","date":"2017-03-06T18:55:14.691+0000","up_votes":1,"down_votes":0,"body":"Danke für die Antworten ;)","replies":[]},{"poster":"Nycaria","date":"2017-03-06T17:35:05.565+0000","up_votes":1,"down_votes":0,"body":"Lern Champions mit CC zu picken & den CC auch sinnvoll einzusetzen und Yi kann nicht mehr viel machen :)","replies":[]}]}