{"poster":"Yago","date":"2015-01-16T18:50:59.290+0000","title":"Ingyen skin késés","subforum":"Általános beszélgetés","up_votes":1,"down_votes":3,"body":"Nos már olvastam 1 ezer fórumot de most külön akarok egy kis sztorival írni. Tehát ma feljöttem és látom ( nem látom) hogy meg kaptam a skinem és ez alapjáraton nem is baj mert gondolná az ember majd jön DE írták hogy pénteki nap folyamán január 16.-án meg kapja mindenki aki eddig kimaradt bár szerintem ez nem igaz. Mindegy is feljött  haverom és ő se kapta meg és egy kicsit elszomorodott ő is VISZONT ezután 2.dik haverom aki nem játszott 3 HÓNAPJA és BRONZE 4 es feljött játszani velünk csak a skinért és mit látunk megkapta egyből ahogy feljött. Na már most egyikünket se bannolták még és a bronze havernak volt chat banja meg mondjuk nekem is nyár elején de az most mind1. a kérdésem annyi a riothoz hogy mi a búbánatért adják oda a 3 hónapja afk bronze 4 esnek elöbb mint a gold 3 as aktív játékosnak aki eddig a játékot nem fikázta ócsárolta nem volt soha bannolva. teljesen készen vagyok és itt már nem is a skinről van szó de akkor is","replies":[{"poster":"iSPZ","date":"2015-01-16T19:02:06.571+0000","up_votes":2,"down_votes":1,"body":"Komolyan mondom, kezd viccessé válni a sztori. Nem értem, Ti szülitek egyébként ezeket az elméleteket, hogy hétfőig, meg 16.-ig meg múlthét keddig osztogatják a kinézeteket? Nem hiszem el, hogy képtelenek vagytok várni és elolvasni 1 nyamvadt cikket, vicc. A kinézet az kell, de 30 másodpercet képtelenek vagytok rászánni, remélem lesz még harminc téma ezzel kapcsolatban.\n\n16.-a, az...\n\nOlvasd el [ezt](https://support.riotgames.com/hc/hu/articles/204008900-2015-janu%C3%A1r-12-A-j%C3%B3-viselked%C3%A9s%C3%A9rt-beszerezhet%C5%91-zs%C3%A1kbamacsk%C3%A1k-jelenleg-is-kioszt%C3%A1s-alatt-vannak-), talán ezzel már megnyugszol és képes leszel várni pár napot, ha már csak a bronz négyes kapja meg, aki inaktív, bezzeg az aktív játékosokat nagy ívbe... gratulálok.","replies":[]},{"poster":"Code name Bullet","date":"2015-01-16T22:51:19.683+0000","up_votes":1,"down_votes":1,"body":"Kedves Ispz, megint alkottál ahogy látom. Nem vagy lekezelő? De. \nNem tudom ingyen csinálod-e vagy fizetett moderátor vagy, de így nem \"beszélhetsz\" emberekkel, főleg te nem. \nElhiszem ,hogy eleged van az ilyen jellegű témákból, de erőt vehetnél magadon. \nPersze, hogy sokan várják, és írogatnak ezerrel. \n\nÖtlet: Mi lenne ha felszögeznétek a fórum tetejére egy témát, hogy az ajándékozás még mindig tart. Vagy úgy ahogy a játéktámogatás oldalán fel van tüntetve.","replies":[{"poster":"iSPZ","date":"2015-01-16T23:54:27.364+0000","up_votes":1,"down_votes":0,"body":"Megint alkottam, igen, biztosan igazad van, ki más lenne ismét a bunkó, lekezelő és tapló mint én, meg sem lepődök rajta. Belekezdhetünk felőlem ismét egy \"ki is a lekezelő/kinek van igaza\" és társai beszélgetésbe. Elképesztő lekezelő volt, hogy körülbelül 1 hét leforgása alatt a 20. hozzászólást írtuk ugyan azzal kapcsolatban le, ha 500-szor nem írtam le (én egyedül) akkor egyszer sem, hogy 30 másodpercet szánjatok/szánjanak rá, nézzenek szét a fórumon, ne adj isten használják a keresőt, ennek ellenére azért sem. Biztos vagyok benne, hogy Te százszor jobban végeznéd a \"munkámat\", lehet természetesen engem is jelenteni, közvetlen kapcsolatot is felvehetsz Riot Daedalusszal vagy Riot CéciDog-al, hogy én miért is nem érdemlem meg, vagy mit tettem amit nekem nem lehetne (mert én aztán elképesztően különbözök bárkitől is a fórumon, de aztán tényleg...).\n\nKicsit nézd már vissza a hozzászólásaimat és utána mond, hogy vegyek magamon erőt, köszönöm.\n\nA probléma az (mint jó pár nappal ezelőtt erre tökéletes példa is volt), hogy kb. teljesen felesleges kitűzni egy témát a fórum tetejére, mert még ezt is nagy ívben elkerülik, vagy azért is létrehoznak egyet, ugyanazzal kapcsolatban. RADS Error-al kapcsolatban lett csinálva egy téma, amit azonnal a fórum tetejére ragasztottam, ennek ellenére aznap legalább 6-7 témát csináltak. Zsákbamacskával kapcsolatban legalább a harmincadik témánál járunk, ne haragudj de nincs naponta 25 órám (igen, tudom hány óra egy nap) arra, hogy állandóan új és új témát csináljak valamit szögezzem a fórum tetejére ha valami \"új\" dolog be jön. Ha már milliószor leírtuk és abból nem értik meg, akkor vessenek magukra, még a játékostámogatás oldalára is piros csíkkal kirakták a cikket, még csak keresni se keljen, de ez sem elég... már ne is haragudj de egyesével nem vehetek fel mindenkit, hogy pontos dátumot dugjak az orra elé. Ingyen kapják, ajándék, ennyire nem képesek cserébe? Én mit kapok azért, hogy folyamatosan segítek? Hébe-hóba egy köszönöm-öt, talán.\n\nÍgy van, ismét én vagyok a gyökér admin, meg sem lepődök.","replies":[{"poster":"Code name Bullet","date":"2015-01-17T01:16:08.544+0000","up_votes":1,"down_votes":0,"body":"Semmi rosszat nem mondtam rád. Egyszerűen ilyen a munkád. Naponta 500 témát nyitnak ugyanazzal kapcs. Sajnálom, elhiszem,hogy idegesít. Viszont tényleg egy picit lekezelő tudsz lenni.  \nÉn is emberekkel dolgozom ,tudom milyen fárasztóak tudnak lenni. \nSzoktam én is segíteni, ha látom hogy egy témához még nem írtatok. \nNem azért mondom mindezt, mert én jobban csinálnám, vagy moderátor akarok lenni.  Valószínű  egy idő után én is unnám az ismétlődő kérdéseket. \nDe jól leteremtetted a kis fickót.  Hidd el senki nem azért nyit új témát, hogy téged idegesítsen.","replies":[{"poster":"iSPZ","date":"2015-01-17T10:02:03.715+0000","up_votes":1,"down_votes":0,"body":"Kértem, hogy nézd meg az előző válaszaimat, engem nem az érdekel, hogy új témát nyitott ugyan azzal kapcsolatban, hanem hogy azt hogyan tette. Ha értelmesen nyit egy témát akkor úgy is válaszolok mint mindig, de egy ilyenre? Ne vicceljünk már...\n\nÉn tudok értelmes, intelligens módon kérdezni, válaszolni akkor ha ő kér segítséget legalább ennyit megtehetne, a témában kb, lenézi a saját \"haverját\" meg így ... Riot úgy ... Riot, egy **AJÁNDÉK** miatt.\n\n(Kérlek ne használd az idézést ha ugyan arra a hozzászólásra válaszolsz, mert teljesen felesleges és kissé zavaró is, természetesen arra van, hogy használjuk, ha például más hozzászólásából szeretnél idézni egy másik hozzászólás alá, azzal nincs semmi probléma, de ne ugyan oda ahova írsz, és ugyan azét. Hisz, ha például az én hozzászólásomra válaszolsz, akkor tudom hogy nekem címzed és a hozzászólásra válaszolsz, így felesleges... köszönöm.)","replies":[]}]}]}]},{"poster":"Yago","date":"2015-01-16T20:44:32.035+0000","up_votes":1,"down_votes":0,"body":"Mindenkitől hatalmas elnézést kérek sajnálom hogy egy büdös csicska vagyok sajnálom hogy mertem kiállni ide fórumra meg bántam tényleg és soha nem követem el még1 szer ezt a hibát sajnálom vége nem kell akkor a skin majd veszek igazatok van nem is érdekes végülis én egy gyökér vagyok tehát téma letudva nem kell többet kommentelni","replies":[{"poster":"orgencs","date":"2015-01-16T22:56:18.407+0000","up_votes":1,"down_votes":0,"body":"Senki nem mondta, hogy csicska vagy, csak ha rászántál volna 5 percet, hogy szétnézz a fórumon, akkor láthattad volna, hogy legalább 20 ilyen post van mint a tied...és ha csak egyet is elolvasol, akkor nem kellett volna ezt a postot megírni...","replies":[]}]},{"poster":"Kadegrow","date":"2015-01-16T19:04:06.371+0000","up_votes":1,"down_votes":0,"body":"A harmadik milyen haver? Honnan láttad, hogy az mistery skin? Rá volt írva? :D\nAmúgy meg, ahogyan írtam már több részben is, hogy ne azon az 1000 FT-os ládikóért kapja már fel a vizet mindenki.\nÉn se kapok mert még 2014 elején volt bannom. Megtoldom 600 Ft-al oszt olyan skint veszek amilyet akarok a 975-ből.\n\n> itt már nem is a skinről van szó\n\nEz kiütött a székből! Az egész Téma a skinről a szól.","replies":[]}]}