{"poster":"Magneto81","date":"2016-09-08T21:07:26.488+0000","title":"Can't play, account was transferred to another region + can't check my ticket","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So I made a ticket, but I can't check the status because I can't log into the ticketing system anymore. Luckily I am still logged into the forum, but I tried logging in at work and it won't let me. Also the name it shows is not my IGN.... Any suggestions? I do have a low level account I can use for now, but I can't even play ranked with it.  :(\r\n\r\nAt least I was able to change the password... Please help - waiting to play my favorite game feels bad man. My name should be showing here as Magneto81\r\n\r\nThanks in advance!","replies":[{"poster":"Magneto81","date":"2016-09-10T01:45:36.777+0000","up_votes":1,"down_votes":0,"body":"OK - I'm back. It says I'm posting as Kinkyinkky still. Also, if I go to the 'boards profile' page, it says \"Error 404\" and shows me a cool picture of Ezreal. I'll post back to Support@Riot to let them know.","replies":[]},{"poster":"Magneto81","date":"2016-09-10T01:42:33.353+0000","up_votes":1,"down_votes":0,"body":"It's all good now, except most of my skin chards are gone and the two I have now I never had before. Thanks for the response, I'm thrilled to be back online!\n\nHmm... odd that my name still appears wrong. Will log out of the forums and back in to see if that fixes it.","replies":[]},{"poster":"Porocles","date":"2016-09-08T21:15:36.931+0000","up_votes":1,"down_votes":0,"body":"You can reach out to us through your preferred email address via support@riotgames.com.  You will receive email notifications to continue correspondence there.  You can also use your other account to ticket in as well!  I also suggest going over the [account recovery](https://support.riotgames.com/hc/en-us/articles/201751694-Recovering-Your-Account) to see if you can do anything on your side to recover the account.  We'll respond asap!","replies":[{"poster":"Magneto81","date":"2016-09-09T23:49:17.519+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=r4yEUKaq,comment-id=0000,timestamp=2016-09-08T21:15:36.931+0000)\n>\n> You can reach out to us through your preferred email address via support@riotgames.com.  You will receive email notifications to continue correspondence there.  You can also use your other account to ticket in as well!  I also suggest going over the [account recovery](https://support.riotgames.com/hc/en-us/articles/201751694-Recovering-Your-Account) to see if you can do anything on your side to recover the account.  We&#x27;ll respond asap!\n\nAny idea what the normal turnaround time is on these requests? I know you said ASAP, but I'm so sad for days now... A friend of mine said it took a week to get his account back...","replies":[]}]},{"poster":"Magneto81","date":"2016-09-08T23:03:53.441+0000","up_votes":1,"down_votes":0,"body":"Awesome - email sent. Thanks - hopefully I get a response that way :) Cheers","replies":[]}]}