{"poster":"UjwYs6OLju","date":"2016-11-27T15:48:50.867+0000","title":"Fix your broken ass new client. Or stop suggesting we Upgrade.","subforum":"[ARCHIVED] Help & Support","up_votes":4,"down_votes":2,"body":"Constantly having problems, had to dodge a game because I couldn't change my masteries. Was getting \"an unexpected error\" whenever I clicked on a mastery, stuck at 17 Ferocity and nothing else. The old client was bad enough, don't suggest players upgrade to an ever more broken client.","replies":[{"poster":"Save","date":"2016-11-27T16:17:23.425+0000","up_votes":2,"down_votes":1,"body":"Agreed, client has been nothing but trouble for me as well. Give or take this is the \"beta\" but this client has been unusable for many players including myself, thus making the legacy client a MUST. Multiple times I have gotten a \"Error, could not change skin\" also. This client is a lagfest.","replies":[]},{"poster":"Targons Blade","date":"2016-11-28T00:07:01.895+0000","up_votes":1,"down_votes":0,"body":"It's certainly to be a bit unstable since it is a Beta, after all. You don't have to use it if it's causing problems for you, but so far it isn't causing issues for the majority of testers, which is why we're still suggesting players give it a try.\n\nYou can launch back into the *Legacy Client* by hitting the button as shown below at the login screen:\n\nhttps://support.riotgames.com/hc/en-us/article_attachments/215576628/Launch-Legacy-Client.jpg\n\nLet me know if you have any questions.","replies":[{"poster":"UjwYs6OLju","date":"2016-11-29T19:59:18.231+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Targons Blade,realm=NA,application-id=osqw6G4M,discussion-id=bltl79cB,comment-id=0002,timestamp=2016-11-28T00:07:01.895+0000)\n>\n> It&#x27;s certainly to be a bit unstable since it is a Beta, after all. You don&#x27;t have to use it if it&#x27;s causing problems for you, but so far it isn&#x27;t causing issues for the majority of testers, which is why we&#x27;re still suggesting players give it a try.\n> \n> You can launch back into the *Legacy Client* by hitting the button as shown below at the login screen:\n> \n> https://support.riotgames.com/hc/en-us/article_attachments/215576628/Launch-Legacy-Client.jpg\n> \n> Let me know if you have any questions.\n\nThe legacy client is terrible as well, work on fixing the original before making a new one. Spaghetti code to the max.","replies":[{"poster":"Targons Blade","date":"2016-11-29T22:02:48.900+0000","up_votes":1,"down_votes":0,"body":"If you offered me a more detailed explanation of what issues you're specifically encountering on the Legacy Client, I'd be more than happy to assist you in resolving them. ^.^","replies":[{"poster":"UjwYs6OLju","date":"2016-11-30T17:44:15.989+0000","up_votes":1,"down_votes":0,"body":"The times when the client crashes when getting into champion select, when it doesn't even let me access the store, the times the client doesn't activate the game launcher when I'm finished with champ select. So many issues that were never fixed.","replies":[{"poster":"Targons Blade","date":"2016-11-30T23:51:13.714+0000","up_votes":1,"down_votes":0,"body":"All of those issues occur under the condition that your connection to the servers is pretty poor. I strongly recommend working through our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to address the most common misconfigurations of your network that are likely to cause these issues.\n\nLet me know if those steps helped!","replies":[{"poster":"Hammer Gaidin","date":"2016-12-01T01:25:58.949+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Targons Blade,realm=NA,application-id=osqw6G4M,discussion-id=bltl79cB,comment-id=00020000000000000000,timestamp=2016-11-30T23:51:13.714+0000)\n>\n> All of those issues occur under the condition that your connection to the servers is pretty poor. I strongly recommend working through our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to address the most common misconfigurations of your network that are likely to cause these issues.\n> \n> Let me know if those steps helped!\n\nThere are many well thought out replies to the new client in the category for it here on the boards(and many many nonconstructive ones).  However, I notice they get no love from Riot.  I'm sure the people that put the time into writing thoughtful feedback would love communication.  That's what the boards are for right?","replies":[]},{"poster":"UjwYs6OLju","date":"2016-12-02T21:01:25.467+0000","up_votes":1,"down_votes":1,"body":"Well you're wrong, because it's not due to connection. I live outside of chicago and NEVER have connection issues. \n\nOT: Found the issue with selecting masteries. If you are in the middle of changing a mastery page and someone locks in a champion, it freezes your mastery page and you can no longer change it. New Client","replies":[]}]}]}]}]}]},{"poster":"Saturnalia9","date":"2016-11-30T01:42:24.505+0000","up_votes":1,"down_votes":0,"body":"Here's a list of my own complaints about the new client:\n\n Let the new client update in the launcher/patcher. The new client lags enough as it is without having to wait on the lag from an ongoing update combined with the base lag.\n\nTake out the second client while in-game. This makes my taskbar pop up and blocks part of my screen, so I have to tab out of the game (and get heavily poked for free) while either suppressing the second client for a few seconds (until another person messages me), or moving the in-game client far enough to one side to keep the taskbar from interfering with my game.\n\nThirdly, let us minimize the friend list please. I don't want to stare at all the names of the people who added me and will never invite me to another game. (Otherwise my friend list will drop from about 100 to 6 or 7 people.)","replies":[]},{"poster":"HelixIsAlmighty","date":"2016-11-27T19:21:40.494+0000","up_votes":1,"down_votes":0,"body":"It's the beta, they want as many people on it as possible so that they can iron out all the bugs. Of course it's not as reliable as the old client yet.","replies":[{"poster":"UjwYs6OLju","date":"2016-11-29T20:00:24.104+0000","up_votes":1,"down_votes":0,"body":"The old client isn't even reliable lmfao","replies":[]}]},{"poster":"Im that DUCK","date":"2016-11-28T05:08:48.359+0000","up_votes":1,"down_votes":0,"body":"You can just use the legacy client... all you have to do is click \"LAUNCH LEGACY CLIENT\" and, amazingly enough, you get the legacy client! Also it's in beta, still being tested and whatnot. It's unlikely to be as, or more, stable than the legacy client.","replies":[]},{"poster":"lourina123","date":"2016-11-28T02:16:10.465+0000","up_votes":1,"down_votes":0,"body":"no im not","replies":[]}]}