{"poster":"Pie Cubed","date":"2017-09-04T16:16:23.231+0000","title":"About Sona's Kit","subforum":"Gameplay","up_votes":11,"down_votes":2,"body":"So, I used to want to main Sona. I loved the thematic so much, but this was back when I was newer, around season 5-6. Her kit just doesn&#039;t inspire any sort of &quot;music&quot; feel, it just feels like braindead facerolling. While I&#039;m not a Sona player, I almost was long ago. To me, her kit has so much so potential, but it&#039;s wasted into lack-of-skill-expression bits.\r\n\r\nI feel like she could be reworked into something of a combo caster, like Riven or Ryze, where you have to weave your abilities in the right way to get the desired effects. That would really bring out the &quot;music&quot; thematic, as playing music requires playing the right notes with control and timing, and knowing what you&#039;re doing.\r\n\r\nDisclaimer: not saying she needs a rework, but the thematic has so much wasted potential on what could&#039;ve been a beautiful kit.","replies":[{"poster":"waiting for WoW","date":"2017-09-04T16:33:31.527+0000","up_votes":1,"down_votes":7,"body":"I don't care what Riot does to Sona as long as it gets her out of the mid lane. Riot mentions Janna and Lulu mid being degenerate when Sona is just as bad. \n\nRiot has to stop the double standard of changing mid laners turned support like Malzahar but allowing supports like Sona that are so overloaded to remain viable mid laners.","replies":[{"poster":"Tribbles Foxfolk","date":"2017-09-04T17:09:35.351+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Blessed1990,realm=NA,application-id=3ErqAdtq,discussion-id=AsbHm7Jr,comment-id=0002,timestamp=2017-09-04T16:33:31.527+0000)\n>\n> I don&#x27;t care what Riot does to Sona as long as it gets her out of the mid lane.\n\nAssassins (Talon), Mages, and even the couple ADCs in mid will make Sona's laning phase a nightmare. She's not a strong solo champion; her ratios are too low to take full advantage of getting solo farm, her mana costs are ridiculously high (Ahri punts her out of lane in a hurry), she doesn't have any real safety against ganks (Ult to stop a gank? Yeah, enjoy that 130s CD when Kayn comes back for some booty), and about a dozen other flaws.\n\nEither the midlaners you're playing aren't good in the mid and get poked out of lane easily or you're really bad at all-ins.","replies":[{"poster":"waiting for WoW","date":"2017-09-04T23:47:46.284+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Eevee Girl Alex,realm=NA,application-id=3ErqAdtq,discussion-id=AsbHm7Jr,comment-id=00020000,timestamp=2017-09-04T17:09:35.351+0000)\n>\n> Assassins (Talon), Mages, and even the couple ADCs in mid will make Sona&#x27;s laning phase a nightmare. She&#x27;s not a strong solo champion; her ratios are too low to take full advantage of getting solo farm, her mana costs are ridiculously high (Ahri punts her out of lane in a hurry), she doesn&#x27;t have any real safety against ganks (Ult to stop a gank? Yeah, enjoy that 130s CD when Kayn comes back for some booty), and about a dozen other flaws.\n> \n> Either the midlaners you&#x27;re playing aren&#x27;t good in the mid and get poked out of lane easily or you&#x27;re really bad at all-ins.\n\nI personally know someone who 1 tricked sona mid to diamond 1 so yeah you can't convince me otherwise when I already know Sona mid is viable at both low and high elo.","replies":[{"poster":"Tribbles Foxfolk","date":"2017-09-05T00:09:12.728+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Blessed1990,realm=NA,application-id=3ErqAdtq,discussion-id=AsbHm7Jr,comment-id=000200000000,timestamp=2017-09-04T23:47:46.284+0000)\n>\n> I personally know someone who 1 tricked sona mid to diamond 1 so yeah you can&#x27;t convince me otherwise when I already know Sona mid is viable at both low and high elo.\n\nOne-tricks can do some really absurd stuff, though; hardly a fair comparison. That guy's probably put in a thousand or so games with Sona mid exclusively. Possible?\n\nI never said Sona mid was never impossible, but it's just not convincing against something more meta, namely Syndra and Malzahar. Hard CC is her bane since she has no way to wriggle around without being able to move uncontested. If she gets hit by anything above a 35% Slow, she's going to be incredibly sad as she gets her tits punched in.\n\nI've played Sona mid quite a few times, mainly for \"lulz\" factor and had plenty of fun. I held my own against my laners, but when their jungler showed up, I had to either burn ult, Flash away, or try to run around like a Jesus Lizard and pray MY jungler showed up. Sona does well in even fights, but tends to struggle in uneven fights. Her ult only repairs a disadvantage so much; live or die on your positioning!","replies":[]},{"poster":"LightIsMyPath","date":"2017-09-05T00:09:10.618+0000","up_votes":3,"down_votes":0,"body":"I Know a guy who onetricks toplane soraka in diamond and the guy onetricking ADC Ahri got to master I think. Your point?","replies":[]}]},{"poster":"Fairyfleur","date":"2017-09-05T16:11:44.908+0000","up_votes":1,"down_votes":0,"body":"Along with next to no waveclear unless you want to buy {{item:3030}} or {{item:3152}} .","replies":[]}]}]},{"poster":"Tribbles Foxfolk","date":"2017-09-04T17:15:34.305+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Pie Cubed,realm=NA,application-id=3ErqAdtq,discussion-id=AsbHm7Jr,comment-id=,timestamp=2017-09-04T16:16:23.231+0000)\n>\n> Disclaimer: not saying she needs a rework, but the thematic has so much wasted potential on what could&amp;#039;ve been a beautiful kit.\n\nI want to disagree, but I'm not actually sure I can. Then again, music doesn't tend to translate very well to gameplay (pen-and-paper not withstanding), so I'm not totally sure how they could fix it. Maybe they could add a hidden passive that she plays music for all nearby champions, changing as she casts spells and levels up. Kind of the DJ Sona gimmick, but not global and not near as the central focus.\n\nMaybe while one of her Auras are active, little music notes fly around inside and she plays part of a song that, if you combo'd abilities together in quick succession, would become complete and could begin playing.","replies":[]},{"poster":"Snake Prince","date":"2017-09-05T15:08:43.026+0000","up_votes":2,"down_votes":1,"body":"I tried to play her with the {{item:3504}} meta it sounded like a good call . But this champ either roll over or get rolled on .","replies":[]},{"poster":"aj2493","date":"2017-09-05T15:17:37.445+0000","up_votes":1,"down_votes":0,"body":"Sonas kit is based around empowering the adc. This lets the adc stay in lane and win almost any trade. but sona lacks cc before lv 6. With tris, ali, or anyone can jump on her or the adc and sh e cant do much but heal and empower them. Also she lacks tackiness making the main difficulty positioning like raka she can be cc'd and bursted down before she can do anything.","replies":[]},{"poster":"zero356","date":"2017-09-04T19:45:39.728+0000","up_votes":1,"down_votes":0,"body":"Unfortunately, Rito has all but already shot down that idea.\nThe idea you're looking for is Invoker from DOTA (go look it up) or a watered down version of it. While I think a simpler version could definitely work, Riot has completely shot down that idea. \n\nAnd, for the record, I'm not entirely sure it's the best idea. A good idea and good option, but not inherently the best.\n\n\nMaking her basic abilities feel more like music would definitely help. I personally suggest making them act like waves that flow out and do whatever it is they do. \n\n\nAnd, interestingly enough, the only people who seem opposed to reworking Sona is Riot. Most Sona mains I've heard talk about her agree she needs a significant overhaul (myself included)\nUnfortunately, Riot Meddler basically hates Sona, so that's not going to work out very well.","replies":[{"poster":"Redesignated","date":"2017-09-04T20:44:20.335+0000","up_votes":1,"down_votes":0,"body":"A while ago, I was brainstorming what might make Sona more interesting, and having her auras expand as a wave from around her was one of the ideas that I and the handful of people I shared it with enjoyed.\n\nThen they did her joint mini-update with Leona where they screwed her laning phase in exchange for scaling, followed by successive nerfs to both, and I realized they really don't care that much.","replies":[{"poster":"zero356","date":"2017-09-04T20:49:38.808+0000","up_votes":1,"down_votes":0,"body":"Dude, check my posts\nNot calling you out or anything, but it's actually an idea some other people have had\nAnd maybe you'll like what I was thinking\n\nIn fact, there are plenty of ideas floating out there that people have in general agreed with. Rito ignores all of them.","replies":[]}]}]},{"poster":"Jeddite","date":"2017-09-04T20:46:50.798+0000","up_votes":1,"down_votes":0,"body":"ITT: we pretend that every champion must have complex/overloaded kits like Lee Sin, Jayce, Elise, or Thresh.","replies":[]},{"poster":"Redesignated","date":"2017-09-04T20:46:15.701+0000","up_votes":1,"down_votes":0,"body":"Bard's not really much of a bard, despite his name. Sona doesn't play out as much of a musician, despite her profession.\n\nSince Riot doesn't want to take the Invoker route (see [Zero356's post](https://boards.na.leagueoflegends.com/en/c/gameplay-balance/AsbHm7Jr-about-sonas-kit?comment=0006) \\) she's probably about as musically-themed as she's going to get, unfortunately.\n\nRiot doesn't particularly like her, either. She's been a balance \"problem child\" in the past (part of which was just knee-jerk nerfing, part of which was justified) and apart from skins she's usually left to her own — either she works OK due to item synergies, or she struggles due to a lack thereof.","replies":[]},{"poster":"Hellioning","date":"2017-09-04T19:40:53.515+0000","up_votes":1,"down_votes":0,"body":"She's already a bard; she plays music to buff her allies. There's more than one way to make 'musician' as a character trait work, you know.","replies":[]},{"poster":"chipndip1","date":"2017-09-04T17:15:33.241+0000","up_votes":1,"down_votes":0,"body":"You're not the only one. Sona is most criticized for being way too simple, but people, and apparently Riot themselves, defend it, so it is what it is. I don't think it'll ever change.","replies":[]},{"poster":"DeathBurst","date":"2017-09-04T16:32:06.217+0000","up_votes":1,"down_votes":0,"body":"So there is a tiny bit of the feeling you're looking for in the proper use of Power Chords. You get a bonus on your basic attack every 3 spells, and the bonus depends on the last spell you used, so you have to use your spells in the right order to get the right Power Chord at the right time.\n\nBut granted, you can play a decent Sona without ever using her Power Chords consciously. That's just the difference between a good Sona and a great Sona, and if that's the feel you are looking for, it's not obvious in Sona's kit.","replies":[]},{"poster":"KoKoboto","date":"2017-09-04T16:22:16.453+0000","up_votes":1,"down_votes":0,"body":"What if Sona's aura's had a little wave moving out from the center. Timing your spell casts when the wave reaches the end of the aura would amplify the ability slightly? It'd also go in tune with the music.\n\nI don't really know how combos could work with Sona's kit because I'm thinking music and I'm thinking she only has 3 notes to play with lol.","replies":[{"poster":"Pie Cubed","date":"2017-09-04T16:29:14.131+0000","up_votes":1,"down_votes":0,"body":"About the three notes, yeah. But a lot can be done with few notes, as you can see in music. I've no idea where this can go, but it's just to fuel some thinking.","replies":[]}]}]}