{"poster":"Get Troll Poled","date":"2016-10-31T19:10:17.211+0000","title":"Looking to start a Freljord team","subforum":"[ARCHIVED] Player Recruitment","up_votes":1,"down_votes":0,"body":"Hey guys and girls alike. I&#039;m really interested in getting a group together and making this a thing. Basically it would be a team where we only(or at least 90% of the time) used...you guessed it.. Freljord champs. Luckily there is a broad enough spectrum so that the team doesn&#039;t have to be comprised of the same champs every game, but few enough that we would be able to play the same champ often enough to become very proficient singularly and as a team. The exception to that really is bot lane, basically going to be the same combo every time. I have an idea for the team name already, I just have to wait until I&#039;m back on land to check it and create the team.\n\n*This is a Ranked Team, LVL 30 is required*\n\nThe Freljord Champion pool to choose from is:\n**ADC**: Ashe\n**SUPP**: Braum\n**MID**: Lissandra, Anivia\n**JUNG**: Olaf, Volibear, Udyr, Gragas, Nunu, Sejuani\n**TOP**: Tryndamere, Trundle\n\nNow clearly these can be mixed and matched, I&#039;m not against breaking the meta at all, I&#039;m here to have fun and win while doing it. I typically play Mid/Top/Jungle lately but I don&#039;t play much Liss or Aniv so I would lean more towards a Top/Jung role since I do play Olaf/Trundle/Tryn.\n\nSo, anyway, if you guys are interested please look me up and shoot me a message, \n**IGN: FeelzRivenMan\nEmail- kronikmagii@hotmail.com**\n\nAlso, please bare with my schedule as of late, I&#039;m in the Navy and we have a lot of underways/inspections to do before deployment next year. I will try to be on as much as possible.\n\nLastly, if you are interested try to be proficient in at least a couple of the champs already, if you don&#039;t play any of them that much but are still interested we can still work with it and you can just hone your skills with them. On that note if you aren&#039;t interested but know someone who is proficient with any of them champs and may be interested please kick them our way, it would be much appreciated.\n\nLet&#039;s make this a things people. I&#039;m looking forward to hearing from some people. Thanks for your time,\n\n-_Kronikmagii_","replies":[{"poster":"ZANNARdinZIDANE","date":"2016-10-31T19:23:29.564+0000","up_votes":1,"down_votes":0,"body":"Hi there I am level 15 and I main warwick jgl and I don mind getting a group together","replies":[{"poster":"Get Troll Poled","date":"2016-10-31T19:27:45.860+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZANNARdinZIDANE,realm=EUW,application-id=K6EGEal2,discussion-id=umg4Rn8M,comment-id=0000,timestamp=2016-10-31T19:23:29.564+0000)\n>\n> Hi there I am level 15 and I main warwick jgl and I don mind getting a group together\n\nI'm sorry for not specifying, but this would be a ranked team so you wouldn't be able to join. Also, WW isn't a freljord champ :(","replies":[{"poster":"ZANNARdinZIDANE","date":"2016-10-31T19:39:40.415+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FeelzRivenMan,realm=NA,application-id=K6EGEal2,discussion-id=umg4Rn8M,comment-id=00000000,timestamp=2016-10-31T19:27:45.860+0000)\n>\n> I&#x27;m sorry for not specifying, but this would be a ranked team so you wouldn&#x27;t be able to join. Also, WW isn&#x27;t a freljord champ :(\nAhh ok no worries Wat is frejlord btw just curious","replies":[{"poster":"Chronic Klown","date":"2016-10-31T19:44:57.924+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ZANNARdinZIDANE,realm=EUW,application-id=K6EGEal2,discussion-id=umg4Rn8M,comment-id=000000000000,timestamp=2016-10-31T19:39:40.415+0000)\n>\n> Ahh ok no worries Wat is frejlord btw just curious\n\nit is a place where all the champs are from ever champ has a region frejlord is where all the champs listed above are from","replies":[]}]}]}]},{"poster":"Loony Russian ","date":"2016-10-31T19:30:27.455+0000","up_votes":2,"down_votes":0,"body":"Ranked huh? I would be down to do this once in a while for trolls and giggles. I can't see this becoming a serious tourney team. But I'm a gold 2 support main. I can play braum for you once in a while.","replies":[{"poster":"Get Troll Poled","date":"2016-10-31T19:36:26.629+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Loony Russian ,realm=NA,application-id=K6EGEal2,discussion-id=umg4Rn8M,comment-id=0003,timestamp=2016-10-31T19:30:27.455+0000)\n>\n> Ranked huh? I would be down to do this once in a while for trolls and giggles. I can&#x27;t see this becoming a serious tourney team. But I&#x27;m a gold 2 support main. I can play braum for you once in a while.\n\nYes I realize it probably won't be a mejor success story, but fun is fun. And you never know, maybe we will all just be that good, Lol. But yeah if I can get this thing started I'll be sure to look you up.","replies":[]}]},{"poster":"Get Troll Poled","date":"2016-11-02T02:07:31.716+0000","up_votes":1,"down_votes":0,"body":"Nightly bump, have a good night everyone.","replies":[]},{"poster":"Get Troll Poled","date":"2016-11-01T13:39:53.860+0000","up_votes":1,"down_votes":0,"body":"Hope everyone had a great Halloween, welcome to No-Shave November","replies":[]},{"poster":"Stuffnthings","date":"2016-11-01T02:34:11.848+0000","up_votes":1,"down_votes":0,"body":"I'd be interested.  My girlfriend and I normally duo bot.  She mains ashe, and i can play braum.  I main jungle olaf as well, if the support is filled.  Let me know! We're on and looking to grind ranked teams tonight","replies":[{"poster":"Get Troll Poled","date":"2016-11-01T03:55:49.005+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stuffnthings,realm=NA,application-id=K6EGEal2,discussion-id=umg4Rn8M,comment-id=0005,timestamp=2016-11-01T02:34:11.848+0000)\n>\n> I&#x27;d be interested.  My girlfriend and I normally duo bot.  She mains ashe, and i can play braum.  I main jungle olaf as well, if the support is filled.  Let me know! We&#x27;re on and looking to grind ranked teams tonight\n\nYeah man, I'll for sure look you guys up. I get back Friday-ish. but it might not be until later in the week, I have to visit family.","replies":[]}]},{"poster":"Get Troll Poled","date":"2016-11-01T02:03:08.221+0000","up_votes":1,"down_votes":0,"body":"Nightly bump","replies":[]},{"poster":"Chronic Klown","date":"2016-10-31T19:26:52.131+0000","up_votes":1,"down_votes":0,"body":"give me {{champion:23}} in the jungle and im down","replies":[]},{"poster":"Skinny Latte","date":"2016-10-31T19:23:37.718+0000","up_votes":1,"down_votes":0,"body":"i play mid and i would do this","replies":[]}]}