{"poster":"Woodla","date":"2017-01-08T12:19:26.688+0000","title":"Probleme mit Zilean Ult?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo Gemeinde.\r\nMir ist es gerade (bei einem Aram) und auch in diversen anderen Spielen mit Zilean aufgefallen, dass das R oftmals nicht z&uuml;ndet.\r\nAls Beispiel aus dem heutigen Aram:  Nach 40 Minuten entstand ein Teamfight, bei dem mein Team alle auf einem Fleck stand. Ich wollte 3 mal mein Ult z&uuml;nden und es hat nicht funktioniert. \r\nJetzt kann man argumentieren, dass ich Spieler X eventuell nicht erwischt hab, aber wenn alle auf einem Haufen stehen, ist das dann doch sehr, sehr unwahrscheinlich. Zumal das nicht nur einmal passiert ist. Ganz zu schweigen davon, dass es oft nicht funktioniert, wenn ich mein Ult auf mich selbst setzen will. \r\nInsbesondere beim Zil Ult ist schnelle Reaktion gefragt, da das Ult nur Sinn macht, wenn ich oder ein Mate kurz davor ist zu sterben. Wenn das nat&uuml;rlich dann nicht funktioniert, wird die Ult ad absurdum gef&uuml;hrt.\r\nHat jemand von euch &auml;hnliche oder gleiche Probleme gehabt?","replies":[{"poster":"Woodla","date":"2017-01-08T13:34:18.248+0000","up_votes":1,"down_votes":0,"body":"Blitz war ein bot, der hat mich kein einziges mal gehookt, daran kanns also nicht liegen.\nZu AreNbee: Ich lasse es mir ja eingehen, wenns 1 oder 2 mal nicht funktioniert, dann lasse ich mir ein missclick eingehen. Aber 5 oder 6 mal hintereinander? Kam mir halt sehr, sehr komisch vor, zumal ich nach dem 3. mal nat체rlich extrem drauf geachtet hab auch ja den Champ anzuklicken.","replies":[]},{"poster":"ikslhairtuz","date":"2017-01-08T13:17:03.715+0000","up_votes":1,"down_votes":0,"body":"Hast du ein Video davon? Ansonsten gehe ich mal davon aus das dich Blitz seine R erwischt hat?!","replies":[]},{"poster":"areNbee","date":"2017-01-08T13:14:13.897+0000","up_votes":1,"down_votes":0,"body":"Ich denke das du entweder zu sp채t gedr체ckt hast oder mit der Maus nicht richtig drauf warst. Manchmal ist es besser die Champion Icons von deinem Team (links oben) zu benutzten um auf Nummer sicher zu gehen ;) Derzeit ist ein Bug oder 채hnliches bzgl Zilean Ult nicht bekannt.","replies":[]}]}