{"poster":"Stitch20XX","date":"2016-09-09T06:01:08.921+0000","title":"Qué pasa con los pitufos (smurf)","subforum":"Nuevos jugadores","up_votes":6,"down_votes":5,"body":"Llevo un tiempo jugando a este juego y la verdad es que cada d&iacute;a me decepciona mucho m&aacute;s que el anterior\r\n\r\nQuieren una comunidad que sea respetable y todo... claro XD MIENTRAS DICEN GG IZI\r\nINSULTOS ALL&Aacute; Y AC&Aacute;\r\n\r\nYa no decir si eres nuevo y te tocan los ya famosos pitufos Smurf, que por alguna raz&oacute;n juegan en cuentas nuevas (o lo banearon o quiere sentirse pro matando a los nuevos o sin runas ni maestrias.\r\n\r\nAcabo de jugar contra un d&uacute;o oro lv 30 full todo y est&aacute; dem&aacute;s decir que nos violaron como quisieran. M&aacute;s encima se sienten orgullosos de ello de abusar\r\n\r\nRiot contestadme de manera sincera\r\n\r\n&iquest;Diganme que se siente que el balanceo de un juego llamado Adventure time battle Party, que se juega con web... ya no decir JAVA... y que es un moba... Tenga MEJOR BALANCEO QUE ESTE JUEGUITO QUE SE JUEGA A NIVEL MUNDIAL A MODO DE COMPETITIVO???? DIOS MIOOO, ES UN JUEGO JAVA MALDICI&Oacute;N!!! Y LES GANAN EN ESO!!!!\r\n\r\nQU&Eacute; CLASE DE MATCHMAKING ES ESO??? el emparejamiento es de mentira, de put* broma que no hace gracia alguna.\r\n\r\nY otra cosa m&aacute;s... empiezo a notar que el server es muuuy inestable... y vivo en el pa&iacute;s  donde se aloja el server... mientras que en otros juegos no hay lag, ya no decir jugar en NA tener menos lag que en su propio server... es como el chiste del contratar un hosting con un DNS, MALISIMO.\r\n\r\nPorqu&eacute; rayos no existe el report de &quot;&quot;jugador smurf&quot;&quot; P&aacute;gina que vaya veo gente diciendo que LAS es el peor.. EL PEOR SERVER DE TODOS los que tiene rito, ya por la comunidad y por la calidad del server en si. Y m&aacute;s encima los nuevos que entran a jugar se sienten intimidados porque no pueden jugar bien sin que un pitufo de damier los venga a insultar.\r\n\r\nNo s&eacute;, tomenlo como un lloriqueo, pero no soy el &uacute;nico que est&aacute; cabreado con el sistemita que tiene el juego, Ni los report funcionan y no sirve de nada bloquear a los molestosos porque igual te salen en las partidas solo que muteado... UN CHISTE QUE NO HACE REIR A NADIE NI POR ERROR DEL DESTINO.\r\n\r\nNo me extra&ntilde;a que existan memes de &quot;oh  pis&eacute; caca&quot; y sale la marca del lol en los pies, el que se vayan los jugadores nuevos porque la comunidad es una **ta basura.\r\n\r\nSigan toxiqueando y arruinando la experiencia de juego a los que intentaron darle una oportunidad a esta bazofia.\r\nNo me extra&ntilde;a que la gente prefiera irse al overwatch.\r\n\r\ntanto el juego como el server tienen seeeeeeeeeeeeeeeeeeeeeeerios problemas, como yo escribiendo esta basura que probablemente nadie lea porque no est&aacute;n ni ah&iacute; con la experiencia de juego en este &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;juego&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot; para &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;divertirse&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot; (como el doctor malito entre sus comillas) \r\n\r\n-Smurf cagan2 partidas a los nuevos\r\n-lag indescriptible\r\n- Sin honor los jugadores, no humildad\r\n-No balanceo correcto en los matchmaking\r\n\r\ntODO ESto licuado para tener como resultado: Rito pls games, it&#039;s better than nothing, crapcom is my god.\r\n\r\nDios hasta sonic se burla de esto... y es sonic.\r\n\r\n[](https://www.google.cl/search?q=sonic+better+than+nothing&amp;espv=2&amp;biw=1366&amp;bih=643&amp;tbm=isch&amp;imgil=nooslx_CThfiyM%253A%253Bh03BtKYKP4DecM%253Bhttps%25253A%25252F%25252Ftwitter.com%25252Fsonic_hedgehog%25252Fstatus%25252F745311041987371008&amp;source=iu&amp;pf=m&amp;fir=nooslx_CThfiyM%253A%252Ch03BtKYKP4DecM%252C_&amp;usg=__Iy7cII58vtqWNfEqF8D8-Qdv3W0%3D&amp;ved=0ahUKEwii_7CpzYHPAhVIHJAKHd0UAM8QyjcIMQ&amp;ei=eU_SV-LeEMi4wATdqYD4DA#imgrc=nooslx_CThfiyM%3A)","replies":[{"poster":"IB Xul","date":"2016-09-09T06:08:59.712+0000","up_votes":4,"down_votes":3,"body":"Parece que te desquitaste xD, pues realmente tienes que entender que la mayoria de los smurf usan la cuenta para o aprender nuevas lanes y su juego o cambiar de \"rutina\" pues mientras mas juegas en una cuenta mas monotono se vuelve y empezar de 0 es bastante agradable{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Stitch20XX","date":"2016-09-09T06:12:36.104+0000","up_votes":3,"down_votes":0,"body":"Y porqué no prueban los campeones en normal en sus lv 30... si supuestamente son \"\"normals\"\" y no deberian llorar por si pierden. o con bots que tienen que venir a burlarse de los nuevos o regañar nuevos?\n\nEso es lo que me emputece. Que sean tan mari**s o molestosos","replies":[{"poster":"IB Xul","date":"2016-09-09T06:21:38.313+0000","up_votes":1,"down_votes":2,"body":"Por el pi amigo, en lvl bajo el pi es mas facil de conseguir, ya que en elos altos ganar y perder es muy facil(mas perder), otra cosa es que cuando eres lvl 30 aprender a usar champs es dificil ya que o te violan o los violas si es simple el champ o se te da bien, si quieres jugamos 1 partida despues o mañana ^^","replies":[{"poster":"Stitch20XX","date":"2016-09-09T06:24:25.445+0000","up_votes":1,"down_votes":0,"body":"ok pero igual que sentido tiene recaudar PI en una cuenta distinta para adquirir campeones si no estará en la otra cuenta... a no ser que exista el transferir campeones like pokemon XD o para probar campeones distintos? no se igual ya es tarde\n\npara mañana quiza este topic ya ni esté","replies":[{"poster":"IB Xul","date":"2016-09-09T06:27:01.181+0000","up_votes":1,"down_votes":0,"body":"cuando empiezas en una cuenta te dan bonificacion de pi y una caja premiun, sumando lo de ganar tras ganar y los 400 pi del tutorial(creo) te da bastante pi para comprar campeones que no tengas en tu cuenta principal, al menos eso pienso yo","replies":[{"poster":"CoronavirusC0V","date":"2016-09-09T16:22:37.565+0000","up_votes":1,"down_votes":0,"body":"sos uno de esos smurf cierto?","replies":[{"poster":"IB Xul","date":"2016-09-09T18:55:19.695+0000","up_votes":1,"down_votes":0,"body":"Ser smurf no es malo amigo, por que crees que los proplayers tienen mas de 8 cuentas?","replies":[]}]}]}]}]}]},{"poster":"IB Xul","date":"2016-09-09T06:15:21.884+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=IB Xul,realm=LAS,application-id=njUm58At,discussion-id=MJtUEMnL,comment-id=0001,timestamp=2016-09-09T06:08:59.712+0000)\n>\n> Parece que te desquitaste xD, pues realmente tienes que entender que la mayoria de los smurf usan la cuenta para o aprender nuevas lanes y su juego o cambiar de &quot;rutina&quot; pues mientras mas juegas en una cuenta mas monotono se vuelve y empezar de 0 es bastante agradable{{sticker:slayer-jinx-catface}}\n\npd: el honor y todo eso se ve en elos altos, yo si estoy jugando una normal y veo a un tipo afk no me lanzo a matarlo con todo eso es muy mala onda y egoista de parte del que lo hace, el balanceo de lol siempre fue un mistero pero va como por: partidas ganada/perdidas ej(solo un ejemplo) 50 ganadas 40 perdidas que te da un mmr de 1500 esto haria que te emparejaran con gente de ese mmr(que es como el lp pero fantasma) y si el 80% de lo platas tienen 1500 de mmr te emparejaran con ms platas que oros, asi funciona mas o menos, un consejo, si te molesta lo que pasa, los toxicos y eso solo mutea a la primera y CONCENTRATE EN JUGAR de eso se trata, pero no veas al lol como algo de concentrarte mucho como un cubo de rubik, velo como algo divertido, aveces la comunidad no es tan mala, si no que es opacada por los ratas, yo igual pase por lo del smurf, dehecho desde que empece a jugar jugaba con lvl 30 ya que jugaba con mis amigos y obvio me violaban pero nunca se pierde, ya que al \"perder\" ganas la experiencia de lo sucedido {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Stitch20XX","date":"2016-09-09T06:18:59.330+0000","up_votes":1,"down_votes":0,"body":"okey pero con lo del final... qué experiencia ganas de perder contra locos lv 30? yo aprendí que un tipo lv 30, ya no decir oro, en el enemigo que se mata a un team completo, hará que pierdas sin poder hacer mucho y desear no haber jugado y haber ganado horas de sueño.\n\nY por lo que veo, salió ese graves lv 30 oro porque en nuestro team habia un teemo lv 30. Así que en parte estuvo \"\"\"\"\"\"\"\"\"\"\"\"\"\"parejo \"\"\"\"\"\"\" en cuanto a lv de cuentas","replies":[{"poster":"ZayDusk","date":"2016-10-15T00:07:46.813+0000","up_votes":1,"down_votes":0,"body":"puedes ganar muchas experiencias , que no las veas es otra cosa","replies":[]}]}]},{"poster":"LastHope17","date":"2016-09-09T06:11:40.990+0000","up_votes":1,"down_votes":0,"body":"Sep, tengo dos smurfs porque quiero aprender a usar adcs y en mi cuenta que soy platino es medio dificil xD, (tambien por tener cuentas por nombres graciosos igual) y ver si es dificil subir desde bronce a platino devuelta","replies":[]}]},{"poster":"Aioria99","date":"2016-09-11T22:35:35.039+0000","up_votes":2,"down_votes":0,"body":"De que te quejas, si tambien sos smurf...","replies":[]},{"poster":"Quo","date":"2016-09-09T07:30:50.623+0000","up_votes":2,"down_votes":0,"body":"Smurf cagan2 partidas a los nuevos: Meh, no veo que las caguen.\n\nLag indescriptible: viejo, estoy a 3000 km del servidor y son contadas las veces que he tenido problemas de conexión xD\n\nSin honor los jugadores, no humildad: ¿eres nuevo en los juegos online? esto es el pan de cada dia en casi todo lo que tenga competitivo.\n\nNo balanceo correcto en los matchmaking: te doy la razon en un 50%.\n\nTodo esto licuado para tener como resultado: cry post por stomp y mala actitud de un smurf.","replies":[]},{"poster":"Nahko","date":"2016-09-11T15:30:23.103+0000","up_votes":1,"down_votes":0,"body":"dijiste \"Llevo un tiempo jugando a este juego\" y \"Acabo de jugar contra un dúo oro lv 30 full todo\" supongo q sos lvl bajo, ademas es mejor que te toquen con gente mejor q vos asi aprendes algo y no sigas teniendo 50 de farm min 20, nose desde mi punto de vista cuando me tocaba contra alguien mejor aprovechaba y me fijaba como jugaba.","replies":[]},{"poster":"Loli de Grafo","date":"2016-09-09T08:15:01.280+0000","up_votes":1,"down_votes":0,"body":"Yo tengo mi smurf pa probar campeones como 100pre","replies":[]},{"poster":"Nasfari","date":"2016-09-09T06:12:53.497+0000","up_votes":1,"down_votes":0,"body":"Me podrías decir que partida fue? Solo para ver si la información es cierta.","replies":[{"poster":"Stitch20XX","date":"2016-09-09T06:21:58.073+0000","up_votes":1,"down_votes":0,"body":"busca en el historial donde sale un graves\nse llama Zebload","replies":[]}]},{"poster":"LastHope17","date":"2016-09-09T06:10:11.874+0000","up_votes":1,"down_votes":0,"body":"Cuando empece a jugar lol hace dos años no habian tantos smurfs como ahora eso es verdad xD","replies":[]},{"poster":"Stitch20XX","date":"2016-09-09T06:03:38.904+0000","up_votes":1,"down_votes":0,"body":"no faltará quien diga \"\"y si eres nuevo como es que estás en NA\"\" es muy fácil, vengo de probarlo ahora con otra cuenta.","replies":[]},{"poster":"Sonya Kyron","date":"2016-09-09T13:42:39.986+0000","up_votes":1,"down_votes":1,"body":"El 90% de los smurf no llegan a subir la cuenta suficiente porque se las banean por flamer o porque sufren distintas denuncias de abuso.\nLos verdaderos smurf andan en ORO 2 para arriba en sus cuentas smurf, si ves uno por abajo de eso a fin de season es un elobooster (siempre cuando tenga mas de 20 rankeds jugadas). Ahora si tiene solo 10 rankeds jugadas es normal verlos plata 1.\n\nLos mejores smurf no rankean mas que las 10 que necesita para tener algún escudito, se manda solo Q en todas y se queda con los puntos para jugar con el marco plata/oro, tienen muchas normales para acumular PI (o champs) y dejarla como posible cuenta principal si sufren un ban en la otra/otras.","replies":[]}]}