{"poster":"Wiggy","date":"2015-01-18T05:23:15.639+0000","title":"This is the system you built riot, enjoy.","subforum":"Miscellaneous","up_votes":1,"down_votes":2,"body":"I just had a game with where top lane went 1/9, intentionally..\r\n\r\nthe jungler didnt \"feel like ganking\"\r\n\r\nand mid got thrashed so hard his ancestors are crying\r\n\r\ntop then decided to rage quit, because you know, feeding isn't quite enough. \r\nthe trist i was supporting bot lane (who was literally our only hope at winning rage quit after him) so we were forced to surrender 3v5, or wait for another ten minutes while they stomped their way down mid, so we did just that, we gave up on a completely hopeless fight knowing that trist and vlad were not coming back.\r\n\r\nthe real cherry on top was when i hit the end game lobby, and was hit with a 26 LP loss, cuz you know, the whole 3v5 surrender is a crucial part of the league system\r\n\r\nso thanks a lot riot, how about you fix loss prevention because shit like this happens far too often.","replies":[{"poster":"Arcanopulse","date":"2015-01-18T05:45:28.797+0000","up_votes":3,"down_votes":0,"body":"It's okay, I'm sure you have won games from that very same thing happening to the other team.","replies":[{"poster":"SnowingGnat","date":"2015-01-18T06:19:47.991+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=your hero batchy,realm=OCE,application-id=Ntey9fRZ,discussion-id=a9MozOPt,comment-id=0000,timestamp=2015-01-18T05:45:28.797+0000)\n>\n> It's okay, I'm sure you have won games from that very same thing happening to the other team.\n\nThat doesn't make it right. However I'm not siding with your point OP, your true problem lies with human nature and the current state of our generation - not Riot.","replies":[]}]},{"poster":"Chicken4dinner","date":"2015-01-18T15:26:33.866+0000","up_votes":1,"down_votes":0,"body":"I got a loss prevention after someone quit just before they blew our nexus.\nLol, not helping I know","replies":[]},{"poster":"Ingénue","date":"2015-01-18T08:12:04.626+0000","up_votes":1,"down_votes":0,"body":"Loss prevention is for things like the servers screwing up. I mean, if loss prevented occurred for this type of thing it would be GG. The enemy team wouldn't get a win they deserved (if they were stomping you that hard) and members of your team could freely rage quit and take turns coping the punishment.","replies":[]}]}