{"poster":"MalditoInfeliz","date":"2017-06-27T03:36:21.695+0000","title":"dudas sobre el juego, jugador nuevo","subforum":"Nuevos jugadores","up_votes":5,"down_votes":1,"body":"hola soy un jugador relativamente nuevo en LOL, aproximadamente  2 meses, mi pregunta es que es lo que pasa con los AFK&#039;s los que insultan y se burlan etc, la verdad he tenido una p&eacute;sima experiencia con el juego y veo que  no cambia nada pareciera que el boton de reportes esta de bonito ya que me an tocado gente que entra directamente  a da&ntilde;ar la experiencia de otros al juego aparte de que no hay un control de los insultos ni nada...  que pasa ? y cuales son las reales acciones que un usuario debe tomar para que las personas que comenten estas acciones sean castigadas o sancionadas?  la verdad es extremadamente  frustrante ver  todo esto y no saber a quien recurrir ( me sorprende que la comunidad de un juego tan divertido sea tan toxica )","replies":[{"poster":"rokushoger","date":"2017-07-23T17:15:51.082+0000","up_votes":1,"down_votes":0,"body":"> que es lo que pasa con los AFK's los que insultan y se burlan etc\n\nDepende de la falta son diferentes los castigos:\n\n- Para los afk se los manda a una cola de baja prioridad, donde tienen tiempo de espera larguísimo antes de iniciar cada partida, y deben jugar un cierto número de ellas antes de poder salir.\n- Para los que insultan (flamers solemos decirles), o se burlan, al reportarlos y llegar a cierto nivel el sistema automático los castiga dandoles primero ban de chat, luego un ban de chat más largo, luego 14 días de ban del juego (no pueden jugar por 14 días) y el último escalón es ban permanente. Si el insulto es muy grave puede que se salte escalones.\n- Para los que trolean (pierden a propósito) se les da directo al escalón de 14 días de ban, y la segunda es permaban.\n- Para los que hacen fraude con las compras se los banea hasta que paguen lo que deben si es por primera vez, y sino se van permabaneados hasta el olvido.\n- Para los que eloboostean (personas que le dan la cuenta a otras personas para que jueguen partidas clasificatorias por ellos para quedar en divisiones que ellos no podrían llegar por si mismos) la primer advertencia es un ban de 14 días y la pérdida de premios de ranked, y para la segunda permaban.\n- Para los que usan hacks (alteran el juego de formas que te den ventaja, como ser algo que apunte automático los hechizos, o que te deje usar infinitas veces una habilidad, etc) es permaban de una.\n\n> pareciera que el boton de reportes esta de bonito\n\nNo te preocupes, tu reporta que ya les llegará su castigo. El tema es que en general salvando que sea muy grave el tema no se castiga por una sola partida, además que tal vez reportaste a alguien, lo sancionaron con tu reporte, y ni te enteraste, porque Riot no siempre te avisa cuando tu reporte hizo saltar un castigo para que no puedan medir el sistema.","replies":[]},{"poster":"TheMartinFly1","date":"2017-07-21T03:07:32.443+0000","up_votes":1,"down_votes":0,"body":"hola buenas , bueno si es verdad de que la comunidad de las puede ser toxica pero tu puedes mutear a la gente presionando tab y hay 2 botones en cada rectangulo de cada invocador que dicen \"Silenciar jugador\" y\"Silenciar alertas\". pero bueno si hay alguien afk puedes tirar remake (antes de los 5 minutos de juego) pero bueno hay un lugar que esta en america sur que es el server de brazil (nunca eh estado ahi) pero no entenderias nada y tendrias poca comunicacion.\n\nlo que te recomiendo es de que en el foro de reclutamiento busques gente para normalear,rankear o tirarte a torneos asi podras tener mejor comunicacion de juego y poder jugar en paz \n\nespero que te sirva \n\nSaludos invocador :3{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"DestroyYou1222","date":"2017-07-13T17:34:23.582+0000","up_votes":1,"down_votes":0,"body":"Hola, si queres evitar el flameo entra a la partida pon el chat y pon esto: /mute all así te ahorras flameas e insultar a los demás evitando reportes en tu contra por \"Abuso Verbal\" si de los AFK quieres hablar, ahí si no tengo muchos consejos, pero si al inicio se va AFK lo mejor es dar remake y si se fue a mitad de la partida un reporte. Aunque posiblemente Riot no haga caso al reporte, hay excepciones, por lo que si el jugador es reportado varias veces será sancionado con un ban temporal de unos días. Bueno ante todo te recomiendo usar el /mute all te ahorras demasiados problemas. Bueno espero que te haya servido.","replies":[]},{"poster":"JMinato","date":"2017-07-06T15:37:29.769+0000","up_votes":1,"down_votes":0,"body":"bro un consejo no hagas lo que ellos te hacen ya que puedes salir con unos ricos reporte y aparte arruinas la experiencia de los otros. en conclusión no las insultes ni nada solo mutealas y veras el cambio.......... un saludo  JMinato {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Cosmonautt","date":"2017-06-28T23:41:41.643+0000","up_votes":1,"down_votes":0,"body":"Incita al jugador que insulta a seguir haciéndolo, pero nunca lo insultes tu, Haz que escriba hartos insultos provocalo siempre con buenas palabras. te aseguro que lo banean yo ya he recibido notificación de baneo de 2 jugadores jajaja asi que hazlo, provocalo con buenas palabras que siga tu juego y no caigas en sus insultos. al final de la partida pide que lo reporten por toxico\n\n\nsaludos","replies":[]},{"poster":"9081913DEL1","date":"2017-06-27T11:06:51.721+0000","up_votes":1,"down_votes":0,"body":"Las acciones del usuario/jugador son claras y sencillas. Tu reportas lo que consideres apropiado al final de la partida. \n\nLuego esta en potestad de riot el que hacer al respecto, como en todos los demas juegos del mundo. No se rinde cuentas de si banean a pepito o pedrito salvo que asi quiera hacerlo en algun caso testigo.\n\nEl juego no se basa en que se castiguen a los malos, no es tu problema, no deberias estar detras de un sentido \"personal\" de justicia, es un juego diviertete, luego con tus reportes y los de los demás riot trabajara sobre ello.\n\nPor otro lado la comunidad no es tan toxica, puedo decir que el 50% de las partidas cada uno tira algun comentario pero queda ahi, es decir mas alla de la descarga de frustracion de cada uno, hay que saber entender que se juega bajo presion y con ganas de ganar, con lo cual a todos se les puede escapar algun comentario. reportando es que se controlan estas actitudes.\n\nSaludos!","replies":[{"poster":"MalditoInfeliz","date":"2017-06-27T16:37:14.342+0000","up_votes":1,"down_votes":0,"body":"primero no es un sentido personal el que busco, mucho menos que me rindan cuentas, la comunidad es toxica eso que lo niegues tu u otro  me da igualen su mayoría   todos dicen q LAS es la comunidad mas toxica del juego... por otro lado si existiera un control tan agudo como dices no seria tan frecuente encontrar este tipo de personas...","replies":[]}]},{"poster":"rokushoger","date":"2017-06-27T11:06:40.583+0000","up_votes":1,"down_votes":0,"body":"Lamentablemente no hay forma de \"reportar por adelantado\", es decir, te tienen que insultar o trolear para que vos puedas reportar. Luego de eso el sistema se encarga de los castigos.","replies":[]}]}