{"poster":"BchYouGotMeFkdUp","date":"2016-09-27T07:03:09.652+0000","title":"MAKE AR URF AND URF A PERMANENT","subforum":"Gameplay & Strategy","up_votes":0,"down_votes":5,"body":"NORMALS AND RANKED ARE JUST GETTING BEYOND BORING. PLEASE MAKE URF A PERMANENT GAMEMODE.","replies":[{"poster":"Roguestoney","date":"2016-09-27T23:15:26.403+0000","up_votes":1,"down_votes":0,"body":"Nah","replies":[]},{"poster":"Knuuckles","date":"2016-09-27T14:29:05.118+0000","up_votes":1,"down_votes":0,"body":"Q time would be disgusting for other modes for the first week then the mode would die out and be baron for all eternity","replies":[]},{"poster":"Nijel","date":"2016-09-27T16:35:12.872+0000","up_votes":1,"down_votes":1,"body":"If URF was to be made a permanent game mode it would quickly become apparent **exactly** how broken or unfun certain champions are to play against, likely to the point where most people would simply stop playing unless the mode was properly balanced. Realistically, we're talking about URF here - I have no clue how much effort it would take to balance every single champion until the mode reaches an ideal state. You'd probably just keep revealing a new OP in the next tier until you throw your hands up and walk away. Even alternative ways to \"balance\" the mode such as ARURF are problematic, mostly in regards to it's questionable degree of popularity within the community.\n\nURF is kinda like candy, even though it tastes good and you crave it sometimes there's a point you realise it just isn't  good for you to have it all the time.","replies":[]},{"poster":"Jason","date":"2016-09-27T07:31:49.691+0000","up_votes":1,"down_votes":1,"body":"One of the best things about URF is that it's temporary. Think about it.\n\nYou're bored of Normals and Ranked games because you play them a lot. Now, URF releases permanently, you'd probably see players in that queue drop to 25% in 2 weeks.\n\nThings get old.\n\nMore info can be found at the end of [this post.](http://oce.leagueoflegends.com/en/news/game-updates/gameplay/rotating-game-mode-queue-now-live)","replies":[]}]}