{"poster":"nightdarkess","date":"2015-03-14T15:28:22.586+0000","title":"[peticion] quitar capa solar en la build recomendadas de tanques","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"no es nada del otro {{champion:36}}  pero teniendo coloso (el nuevo) no es necesario tneer capa solar y yo quiero que en la build recomendada de por ej la de zac mundo etc le quiten ya en la build recomendada solo eso gracias de antemano :D\npd:nose si aca se pone o es en soporte .....\n\nedit:lo hago mas facil quiero que cambien la recomendacion de capa solar por otro item para los tankes jg ya que en elo bronce y tambien otros elos la gente se confunde y compran la mejora verde y la capa solar solo digo que para la gente inexperta no se confundan che -_-","replies":[{"poster":"Ionian Blade","date":"2015-03-14T15:46:56.688+0000","up_votes":1,"down_votes":2,"body":"No entiendo bien la razon del post\n¿Que es Coloso?¿Te refieres a {{item:3725}} {{item:3721}} {{item:3717}} {{item:3709}} ?\nEstos objetos solo se pueden usar con Smite/Castigo como hechizo de invocador\nTambién, en tu Perfil de invocador, tienes una pestaña llamada \"**Objetos**\" donde puedes personalizar las builds recomendadas, elegir para que campeones y que mapas","replies":[{"poster":"Zogisv","date":"2015-03-14T15:55:54.428+0000","up_votes":2,"down_votes":0,"body":"si pero los nuevos encantamientos verdes son una capa de fuego solar, la cual no se stackea con la original. es solo un detalle cambiar los recomendados pero a veces puede confundir que te vean con 2 capas solares","replies":[{"poster":"Ionian Blade","date":"2015-03-14T16:00:14.866+0000","up_votes":3,"down_votes":0,"body":"Actualmente los objetos que cambian cuando tenes o no smite son solo los iniciales (si no me equivoco)","replies":[{"poster":"Saykan","date":"2015-03-14T16:03:00.961+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LBW Jack Agts,realm=LAS,application-id=v7qsfXsE,discussion-id=kHqwfhr7,comment-id=000000000000,timestamp=2015-03-14T16:00:14.866+0000)\n>\n> Actualmente los objetos que cambian cuando tenes o no smite son solo los iniciales (si no me equivoco)\n\nsi si exacto ejp si sos  un ADC te ponen la doran {{item:1075}}  pero si te pones smite te ponen el machete {{item:1039}}","replies":[]}]}]},{"poster":"Saykan","date":"2015-03-14T15:59:42.387+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LBW Jack Agts,realm=LAS,application-id=v7qsfXsE,discussion-id=kHqwfhr7,comment-id=0000,timestamp=2015-03-14T15:46:56.688+0000)\n>\n> No entiendo bien la razon del post\n> ¿Que es Coloso?¿Te refieres a {{item:3725}} {{item:3721}} {{item:3717}} {{item:3709}} ?\n> Estos objetos solo se pueden usar con Smite/Castigo como hechizo de invocador\n> También, en tu Perfil de invocador, tienes una pestaña llamada \"**Objetos**\" donde puedes personalizar las builds recomendadas, elegir para que campeones y que mapas\n\nA lo que se refiere es que en la pestaña de recomendacion de los junglas (TANKS). \n En los tank aparece el Coloso que es la mejora de esos objetos {{item:3709}} {{item:3717}} {{item:3721}} {{item:3725}} , pero se penaliza directamente no se aplica con la capa solar {{item:3068}}  al tener este objeto por que sus pasivas son UNICAS","replies":[{"poster":"Ionian Blade","date":"2015-03-14T16:57:07.133+0000","up_votes":1,"down_votes":2,"body":"Pregunte que es Coloso por que a mi me aparece Gigante no sé que y no estaba seguro\nSi, se que se penaliza con la {{item:3068}}  pero como dije\nNo veo la razon del POST, hay un sistema para crear tus builds personalizadas si te molesta tenerlo a mano para nada\nLa capa solar es un objeto muy util en tanques, y sirve mucho tenerlo como recomendado\nYa sea que te recomienden el encatamiento de jungla verde o no, por que MUCHAS veces personajes tank prefieren comprarse el encantamiento de AP o AD, y luego comprar la {{item:3068}}  por el simple hecho de que tienen una ventaja de oro y prefieren sacar primero daño para abusar de su oponente","replies":[]}]}]},{"poster":"lordeman10","date":"2015-03-14T17:08:50.673+0000","up_votes":2,"down_votes":0,"body":"la capa solar no es solo un item importante para AOE en tf (que es importante tenerlo), tambien es necesario para pushear la linea además tiene una receta facil de armar y es muy efectiva\n\nestá bien que cada uno tenga su estilo de juego pero es lo más común","replies":[]},{"poster":"potato support","date":"2015-03-15T16:51:07.429+0000","up_votes":1,"down_votes":0,"body":"en las builds recomendadas solo es una recomendacion, si no lees o sabes lo que te estas comprando asi vas a quedar, no van a sacar corazon helado de las recomendacions, porque comparte una pasiva con randuins. porque son diferentes cosas.\n\ncinderhulk no te da la armadura que te da sunfire. que un item comparta la pasiva no significa que sea lo mismo, tampoco significa que podes ir como salame y comprar trinity y ibg porque son diferentes.","replies":[{"poster":"nightdarkess","date":"2015-03-16T14:55:12.424+0000","up_votes":1,"down_votes":0,"body":"pero en mi liga hay gente que no saben jugar y te tenes que comer por ejemplo gente con nasus trinity y guantelete de hielo ademas los objetos recomendados sirve para optimizar la forma de juego es decir para no estar buscando todo los items ademas no es algo de otro mundo es solo quitar  de recomendado a sunfire no que lo quiten del juego o que lo bloqueen a los tankes jg no le veo nada malo es solo una opinion personal","replies":[]}]},{"poster":"oh95","date":"2015-03-15T05:51:25.376+0000","up_votes":1,"down_votes":0,"body":"Muchos malentendieron al pibe, lo que quiere decir es que, por ejemplo, en Dr. Mundo aparece en Objetos Esenciales:\nEl item de jg tanque y la capa solar, y que pasa con esto? Que ambos son pasiva única y en la gente que esta aprendiendo o no tienen conocimiento del champ sacan los 2 perdiendo un hueco en otro item.\nLo que el chabón pibe es que cuando vayas con Smite/Castigo, eliminen la Capa Solar de lo recomendado, para no confundir a los jugadores menos familiarizados con estos champs","replies":[]},{"poster":"Revolución","date":"2015-03-14T16:01:58.419+0000","up_votes":1,"down_votes":0,"body":"No comparto tu punto porque el item en sí sigue siendo muy bueno, pero sí comparto que con los cambios en campeones y en items deberían actualizar los recomendados de cada campeón.","replies":[]},{"poster":"kasper","date":"2015-03-14T17:24:44.114+0000","up_votes":1,"down_votes":1,"body":"no cambiaran la build recomendada por tu opinion, jugadores profesionales compran como primer item la capa solar y es por algo...","replies":[]}]}