{"poster":"Valvalis","date":"2018-03-13T09:11:09.912+0000","title":"Niedrige FPS seit Pre-Season beginn.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo,\r\n\r\nkleine Hintergrundinformation, vor dem Pre-Season Update hatte ich eine uncapped FPS von 300-500, seit dem Pre-Season Update und bis heute, kriege ich uncapped nichtmal mehr 144 FPS zustande.\r\nDesweiteren sinkt meine FPS immer weiter desto l&auml;nger das Spiel andauert, am Anfang habe ich 110 aber sp&auml;testens im Mid bis late sinkt diese auf 80 und schwankt stark in jedem Teamfight.\r\nAlle anderen Spiele funktionieren wie immer, nur League hat grottige Performance. H&auml;tte irgendjemand vielleicht eine Idee wieso ich &uuml;ber 300 FPS verliere?\r\nHardware wurde nichts ver&auml;ndert, habe sogar WIN10 neu aufgespielt um eventuelle Software Konflikte zu beheben.\r\n\r\nInformationen zu meinen Specs:\r\n\r\nMSI GTX970\r\nXeon e3-1231 v3\r\n8GB RAM\r\n\r\nGr&uuml;&szlig;e","replies":[{"poster":"silibum","date":"2018-03-13T17:14:03.618+0000","up_votes":1,"down_votes":0,"body":"[Du könntest mal ein Hexttech-Repair-Tool-Archiv erstellen vll sieht man dort irgendwas.](https://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool) und abgesehen davon gillt folgende Grundhilfe:\n\n>*   Manche Computer/Notebooks besitzen eine zusätzliche Grafikkarte welche direkt im Prozessor verbaut ist. Es kann sein, dass dein System diese anstatt der Richtigen nutzt und du daher niedrige FPS hast. Schau am Besten einfach in den Gerätemanager ob dort unter **Grafikkarte** mehrere aufgeführt sind. Falls ja, kannst du die interne Karte einfach mal deaktivieren. Meist beginnt der Name solcher Karten mit **Intel HD**.\n*   Wenn du **Windows 10** verwendest, stelle sicher, dass [GameDVR deaktiviert](http://support.xbox.com/de-DE/xbox-on-windows/social/record-game-clips-game-dvr-windows-10#160cb39808a54d38acdc54c564943140) ist.\n*   Aktiviere im Client die Option “**Client während eines Games schließen**”.\n*   **Hinweis**: Da der Client nach jedem Game wieder gestartet werden muss, dauert es länger bis du in die Lobby kommst.\n*   Weitere Lösungen findest du in der [Knowledge Base](https://support.riotgames.com/hc/de/articles/115005102387-Niedrige-Bildwiederholrate-Lags-)\n\nZum hochladen einer Datei verwende einfach unser [Upload-Portal](https://files.wrenchbox.de). Dort hochgeladenen Dateien können nur von uns [Wrenchmen](https://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/EhBWl18X) eingesehen werden und nach 3 Tagen automatisch gelöscht. Solltest Du eine Linkwarnung erhalten (externer Link) musst Du die URL dieser Seite auf der Datei-Upload-Seite eingeben und am besten die Funktion zur Warnung vor externen Webseiten deaktivieren, dann funktioniert das in Zukunft direkt :-)","replies":[]}]}