{"poster":"wbwb","date":"2017-06-19T11:48:06.474+0000","title":"Game wont launch after champion select.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So recently, last couple of months, I've had some major issues with the League client not allowing me to patch. I tried uninstalling and reinstalling, didn't work. I finally manage to fix it while running my computer in safe mode, and was very pleased with myself when it managed to patch and I could log in. However, the issues didn't stop there. I cannot for the life of me get into a game. I, stupidly enough, queued up for a matchmade game at first which i failed to join, but after that i've just been trying with custom games. But none of them start. The client doesn't even seem to try and launch the gameclient and just keeps me at the \"reconnect\" screen. I ran the hextechtool to gather some logs. I have tried running to game in compability mode and without any firewall on. I also don't use an anti-virus so that should not be the issue either. I'll post a link to my logs here:\r\nhttps://ufile.io/7s6rd\r\n\r\nBest regards.","replies":[{"poster":"Broporo","date":"2017-06-19T21:56:21.870+0000","up_votes":1,"down_votes":1,"body":"Hmmmm it almost sounds like your network is having problems getting a solid connection with the game server you're being placed in. Let's first try looking over your [**network settings**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to see if anything might have been reset at some point, but let me know if that doesn't help!","replies":[{"poster":"wbwb","date":"2017-06-19T21:58:18.024+0000","up_votes":1,"down_votes":0,"body":"I've brought my computer with me to different locations i.e different internet connections. Could it have something todo with my hardware?","replies":[{"poster":"Broporo","date":"2017-06-20T00:27:11.923+0000","up_votes":1,"down_votes":1,"body":"It could be! If nothing else has helped so far, hit up our tech guys in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new) and they can take a closer look at what might be going on!","replies":[]}]}]},{"poster":"Flambarge","date":"2017-06-19T21:02:30.774+0000","up_votes":1,"down_votes":0,"body":"having same issue, i can jsut see my mouse (the lol mouse, changed) after champ select nothing else loads.","replies":[]}]}