{"poster":"WP BeHappy","date":"2016-01-27T04:38:22.630+0000","title":"Que el post llegue a las 100 paginas. Den respuestas !","subforum":"Charlas Generales","up_votes":4,"down_votes":10,"body":"Sea quien fuere el responsable de estos &uacute;ltimos d&iacute;as o &uacute;ltimos meses de paup&eacute;rrimo servidor &quot;LAS&quot; que tome cartas en el asunto. El juego no es F2P, much&iacute;sima gente gasta dinero poco o mucho pero lo gasta, se hacen torneos y campeonatos de todo tipo, esto conlleva a una recaudaci&oacute;n millonaria, el juego es el mas popular en todo el mundo, en estos momento LAS es el peor continente en cuanto a todo, a que voy con esto, a que los responsables si quieren seguir teniendo gente en LAS inviertan en mejores equipos, conexiones o lo que fuese, muevan esos millones porque de apoco la comunidad LAS se va achicando ahora porque est&aacute;n en vacaciones ven a miles nuevos pero cuando comience el ciclo electivo muchos van a dejar de jugar y se va a notar el descenso de gente.\r\nPorque no se hacen mantenimientos como antes ? o como los dem&aacute;s juegos con 4/5 hrs. por semana en estado &quot;OFF&quot; esto no tendr&iacute;a que pasar, todos los juegos tienen mantenimientos, este no para nunca. Porque no funcionan los reporte ? llegan muchas notificaciones ? hagan que funcione el &quot;bloquear&quot; sean estrictos, si yo bloqueo a alguien por tal o cual motivo no lo quiero ver jugando nunca mas en una partida conmigo, esto cambiara la conducta de TODOS no la m&iacute;a, la de TODOS.\r\n\r\nLo &uacute;nico que espero y deseo no es la respuesta de un Admin o quien fuese, sino que el post se haga masivo.\r\nQue los responsables inviertan porque plata/dinero sobra y los pa&iacute;ses tanto Chile/Argentina/Peru/Uruguay estan perfectamente actos para tener un hosting de league of legend. \r\nSi la gente de marketing del juego ve el post alguien le comenta del pauperismo servidor LAS que trabaje duro por la calidad del gamer, por la calidad del que pone dinero en el juego, y para que LAS sea cada mas mejor y no el peor servidor de todo el mundo, los directivos del jueguito se tendr&iacute;an que mover y poner a la altura.","replies":[{"poster":"Pëstdoktor","date":"2016-01-27T05:00:10.679+0000","up_votes":2,"down_votes":0,"body":"En parte estoy de acuerdo y en otra no.. Riot se preocupa por lo servidores, pero pensá que no por tener el dinero que puedan tener hacen todo por arte de Magia.. \nSegundo, es tan bueno el juego que no hace mantenimientos, y si los hace los hace en horas donde la cantidad de personas alcanza el minimo, para no interrumpir a los jugadores.\nTercero, el juego SÍ es F2P, nadie absolutamente nadie te obliga a comprar nada, ya que además, cargar RP no te da ni un solo beneficio ante el otro jugador.\n\nDeberias informarte más, y no comportarte como un caprichoso.","replies":[]},{"poster":"Pablidoc","date":"2016-01-27T04:57:36.937+0000","up_votes":2,"down_votes":0,"body":"Estas equivocado, el juego es F2P, gastar es algo opcional RiotGames no te obliga a hacer ningún tipo de compra sin tu consentimiento","replies":[{"poster":"WP BeHappy","date":"2016-01-27T05:03:43.638+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Pablidoc,realm=LAS,application-id=v7qsfXsE,discussion-id=IlauXvEV,comment-id=0000,timestamp=2016-01-27T04:57:36.937+0000)\n>\n> Estas equivocado, el juego es F2P, gastar es algo opcional RiotGames no te obliga a hacer ningún tipo de compra sin tu consentimiento\n\nF2P = Organización sin ánimo de lucro. Riot lucra millones. Abrazo.","replies":[{"poster":"Eva","date":"2016-01-27T05:13:10.512+0000","up_votes":1,"down_votes":0,"body":"Free to play (videojuego gratuito en inglés, gratis para jugar traducido literalmente) es un modelo de negocios dentro de la industria de videojuegos que engloba los videojuegos y aplicaciones móviles que los jugadores y usuarios pueden descargar y jugar sin necesidad de pagar.\n Fuente: https://es.wikipedia.org/wiki/Free_to_play","replies":[{"poster":"WP BeHappy","date":"2016-01-27T05:16:34.457+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=LadyInvader,realm=LAS,application-id=v7qsfXsE,discussion-id=IlauXvEV,comment-id=000000000000,timestamp=2016-01-27T05:13:10.512+0000)\n>\n> Free to play (videojuego gratuito en inglés, gratis para jugar traducido literalmente) es un modelo de negocios dentro de la industria de videojuegos que engloba los videojuegos y aplicaciones móviles que los jugadores y usuarios pueden descargar y jugar sin necesidad de pagar.\n>  Fuente: https://es.wikipedia.org/wiki/Free_to_play\n\nSeguí dejandole plata a un servicio últimamente pauperrimo, de paso se te cagan de risa. Osea, te roban en tu cara.","replies":[{"poster":"Pablidoc","date":"2016-01-27T05:21:47.209+0000","up_votes":1,"down_votes":0,"body":"Cualquier juego que vos digas Free To Play tiene un metodo de pago para ofrecer mejoras o ventajas (Visuales, desbloquear contenido exclusivo, como otros MMO) , vos no estas obligado a adquirir dicho producto sin tu consentimiento, la opción esta vos la elegís.\n\nSaludos.","replies":[]},{"poster":"Eva","date":"2016-01-27T05:18:35.422+0000","up_votes":1,"down_votes":0,"body":"Ah, yo no compro RP.","replies":[]}]}]}]}]}]}