{"poster":"Razorshell","date":"2015-05-04T05:25:02.326+0000","title":"Can we make it so that Shaco's Q (Decieve) isn't seen by the enemy team when they can't see him?","subforum":"Report a Bug","up_votes":2,"down_votes":1,"body":"When **{{champion:35}} Shaco** is ganking, it can be tough to pull it off if your enemy is observant enough. This still applies even when the enemy doesn&#039;t use wards. This is because, as a primary initiation tool, his **Q (Decieve)** is almost always used at the beginning of a gank.\r\nHowever, as a **{{champion:35}} Shaco** main, I&#039;ve noticed that observant players can spot the _animation_ of his **Q** in the bush, even when they don&#039;t see him standing there. I was wondering if this was intentional from Riot, or if it&#039;s something that could be fixed in the next update.\r\n(I put this under &quot;Report a Bug&quot; because I&#039;m _assuming_ that it was unintentional)\r\nThanks guys.","replies":[{"poster":"Meddler","date":"2015-05-04T08:11:58.701+0000","up_votes":6,"down_votes":1,"body":"The puff of smoke from Deceive being visible a short distance through Fog of War/in brush is a deliberate effect, not a bug. As an instant blink with stealth attached Deceive's a challenging spell for other players to interact with. That smoke signal's there as a result to give a very brief warning period in some circumstances.","replies":[{"poster":"Roaranor","date":"2015-05-04T10:04:00.233+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=LqLKtMpN,discussion-id=WqLGaA5c,comment-id=0001,timestamp=2015-05-04T08:11:58.701+0000)\n>\n> The puff of smoke from Deceive being visible a short distance through Fog of War/in brush is a deliberate effect, not a bug. As an instant blink with stealth attached Deceive's a challenging spell for other players to interact with. That smoke signal's there as a result to give a very brief warning period in some circumstances.\n\nSlightly related: Has there been any talk about giving Shaco boxes some kind of scaling with level or a dmg reduction from aoe skills? Early game is fine atm, but Gromp can one shot it after awhile (I think two hits from red), and a lot of times champions like Riven will just rofl stomp it with inadvertent damage.","replies":[]},{"poster":"Jesus is Savior","date":"2015-05-04T13:49:39.760+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=LqLKtMpN,discussion-id=WqLGaA5c,comment-id=0001,timestamp=2015-05-04T08:11:58.701+0000)\n>\n> The puff of smoke from Deceive being visible a short distance through Fog of War/in brush is a deliberate effect, not a bug. As an instant blink with stealth attached Deceive's a challenging spell for other players to interact with. That smoke signal's there as a result to give a very brief warning period in some circumstances.\n\nWhat about the fact that every jungle smite buff, blue/red/baron buff, and even the PERMANENT dragon buff can be seen, visually, on the real shaco, and not his clone?\n\nWhy hasn't that been addressed in some way? Is it intentional? It's really the only reason I have never played him (I main Eve and I'd like a new stealth champ, but the permanently visible dragon buff isn't a handicap I'm willing to play with).","replies":[]},{"poster":"Cuix","date":"2015-05-04T08:43:07.350+0000","up_votes":2,"down_votes":1,"body":"The blink range feels tiny, warding is easier than ever, and the \"short distance\" on its visibility feels like a very generous assessment of \"short\".\n\nI'm not saying you should buff him or anything, but I think it's fair to assume that Shaco is currently in the old \"Evelynn\" spot of being left intentionally weak.","replies":[]},{"poster":"Cenobite Azaziel","date":"2015-05-05T00:50:41.307+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=LqLKtMpN,discussion-id=WqLGaA5c,comment-id=0001,timestamp=2015-05-04T08:11:58.701+0000)\n>\n> The puff of smoke from Deceive being visible a short distance through Fog of War/in brush is a deliberate effect, not a bug. As an instant blink with stealth attached Deceive's a challenging spell for other players to interact with. That smoke signal's there as a result to give a very brief warning period in some circumstances.\n\nSo, shouldnt the brush shake violently when **anyone** is standing there?\nWhat is it good for a skill that turns you invisible so you can engage if it gives the enemy vision that he shouldnt have?\nAnyone can react to shaco. His hard cc is crammed in  the Jitb that has a windup time, can receive aoe damage when visible and is countered by a trinkey. \n\nGive the same treatment to eveyone else so we can where they are at the map.","replies":[]},{"poster":"Razorshell","date":"2015-05-05T00:25:20.470+0000","up_votes":1,"down_votes":0,"body":"As the poster of this thing, thanks for the feedback, **Meddler.** The noticeable visual effect wasn't really a big problem, but I was just wondering if nobody had noticed it yet or if you guys meant to do it. Thanks!","replies":[]},{"poster":"biomaster","date":"2015-05-04T16:41:46.898+0000","up_votes":1,"down_votes":0,"body":"could we at least have it so shaco isn't revealed until he completes a attack. I'm so sick of breaking stealth because he trys to kill a minion, if I don't hit anything I shouldn't be revealed. I feel this would be a pleasant quality of life buff.\nBTW is there a way the death recap can inform me im revealed, or give me some sort of indication im revealed. It's really sad when a pink is out of my sight and im walking around thinking im invisible, some sort of exclamation mark would be nice.","replies":[]}]},{"poster":"Jamaree","date":"2015-05-04T05:25:43.362+0000","up_votes":2,"down_votes":1,"body":"I don't know, can we make it so he isn't cancer early game to solo laners. #fuckShaco. (Yes, this is purely bias, don't care, fuck the clown.)","replies":[]}]}