{"poster":"Sl1p","date":"2017-03-31T06:36:46.552+0000","title":"Random fps drops","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"I've played league for awhile without any issues but all of the sudden my frames started dropping. I usually get 80-90fps but recently it's been jumping around anywhere from 10 to 50. It does not do this early game only late game and it is not only during team fights i could simply just be farming a jungle minion and it will drop. I've been having a hard time playing because i will suddenly drop to around 15 fps for a few seconds then it goes back to 80-90 then a couple seconds later it happens again.","replies":[{"poster":"Dugora","date":"2017-04-04T16:39:24.969+0000","up_votes":1,"down_votes":0,"body":"its their 7.4 patch.. they refuse to fix it and have been blaming others","replies":[]},{"poster":"Porocles","date":"2017-03-31T16:28:18.425+0000","up_votes":1,"down_votes":0,"body":"These frame drops can happen if a game file is failing to load an asset, like a spell during a team fight.  It could just be an outdated driver too, so I suggest going over the steps in the [FPS issues](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting) guide to rule out possibilities and get things tuned up.  Let me know if you have any questions!","replies":[{"poster":"Sl1p","date":"2017-04-01T01:45:21.305+0000","up_votes":1,"down_votes":0,"body":"Thanks a lot, i did a full game repair it and fixed my issue with fps. However, I forgot to mention but my ping is also spiking, the full game repair did not fix my ping issue. Ever since i started playing I have had a steady 24-27ms but recently it has been spiking to 80-100. I've reset my router and canceled everything in my task manager. I use ethernet as well if that helps.","replies":[]}]},{"poster":"Sl1p","date":"2017-03-31T15:59:38.537+0000","up_votes":1,"down_votes":0,"body":"I also just checked, it is only league that i am having frames drops in, not other games.","replies":[]}]}