{"poster":"K a l i g u l a","date":"2016-07-20T16:00:04.753+0000","title":"[IDEA] Kickear o penalizar a un jugador en el transcurso de una partida +1 PARA QUE RIOT LO VEA","subforum":"Charlas Generales","up_votes":1,"down_votes":31,"body":"Bueno, se me ocurrio esto y me gustaria plantearlo por aca..{{summoner:2}} \nResulta que ya estoy HARTO, pero HARTO de los jugadores que regalan kills al team enemigo, y tambien estoy cansado de que cada 3 de 5 partidas me toque gente con lag, porque, hay gente que a pesar de tener 2000ms o una computadora primitiva siguen jugando, y por supuesto, cuando los matan dicen &quot;lag&quot; &quot;LAG&quot; &quot;bajon de fps&quot;.\nY nose, aca va la idea:\nEstaria bueno que RIOT cree un nuevo comando o funcion que nos permita al equipo poder &quot;kickear&quot; o sacar de la partida a un compa&ntilde;ero que no este aportando nada mas que kills al team enemigo o tenga una actitud molesta.\n-Ej: El comando podria ser /drop &quot;nombre de invocador&quot; o /kick &quot;nombre de invocador&quot; , y al iniciar un jugador ese comando se haga una votacion (como en el surrender) que requiera como maximo 3 votos a favor (ya que si son 5, el &quot;molesto&quot; va a poner que no obviamente, y seran 4, suponganse que alguien se opone, pero quedan 3 votos mas y con eso alcanza).\n\n-Una vez acabada la votaci&oacute;n, el jugador es desconectado de la partida automaticamente, y como penalizacion, se a&ntilde;ada una cola de 2 min o algo por el estilo.\n\n-Una vez desconectado, quedar&aacute;n 4 jugadores, los cuales podran tirar surrender at 20, o, continuar con la partida, pero sin preocuparse de que siga empeorando.\n{{sticker:slayer-jinx-wink}} \nBueno, solo es algo que se me ocurri&oacute;, porque verdaderamente fastidia no poder hacer nada cuando te toca un mal player que aunque ganes mid, se planta ahi, lo peor, es tener que esperar al minuto 20.Seguramente no sea la &quot;idea perfecta&quot; y le falten cosas, pero esta seria la base para la solucion.\n+1 para que RIOT LO LEA PLS!","replies":[{"poster":"AuroraExecution","date":"2016-07-20T16:17:22.063+0000","up_votes":9,"down_votes":0,"body":"-1 para que riot no lo vea","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-07-20T16:48:51.801+0000","up_votes":4,"down_votes":0,"body":"Por ideas como esas no conquistamos el mundo Pinky.","replies":[]},{"poster":"UmTi","date":"2016-07-20T16:15:18.042+0000","up_votes":3,"down_votes":0,"body":"Amigo mio, sabes que ni en pedo van a hacer eso porque es estupido y ademas si juegan en una Pc mala o tienen mal internet es responsabilidad de el y si aporto kills al team enemigo vas a y lo reportas cuando termina la partida y pones sacrificio intencional y explicas el porque y asi le van a dar una penalizacion a el y tu vas a estar feliz no ¿? ademas yo cuantas veces no eh jugando con tipos que tienen lag y Pc malas y aun asi las gano y no me quejo por eso y si pierdo las partidas me da igual :) solo te digo que nunca van a poner eso por ahora en el futuro tal ves nadie sabe pero si estas harto de eso pues hace lo que te digo al finalizar la partida y lo reportar. {{champion:12}} {{champion:201}}","replies":[{"poster":"TheQuietFox","date":"2016-07-20T16:30:22.913+0000","up_votes":1,"down_votes":0,"body":"Tenes el cora {{item:3110}} sensible :v ?","replies":[]}]},{"poster":"Cangrejo del rio","date":"2016-07-20T17:06:38.946+0000","up_votes":2,"down_votes":0,"body":"Parece que jugaste mucho rakion amiguito  :v \nYo juego con menos de 6 fps y eh tenido muy buenas partidas xd","replies":[]},{"poster":"Rebkans","date":"2016-07-20T16:27:22.575+0000","up_votes":2,"down_votes":0,"body":"y los trolls que se aprovecharian de eso?\nSeria un quilombo si pusieran esta idea...","replies":[]},{"poster":"LeonxLoL","date":"2016-07-20T16:16:17.711+0000","up_votes":1,"down_votes":0,"body":"y eso como afecta a las premades troll?{{sticker:zombie-brand-mindblown}}","replies":[]}]}