{"poster":"K a l i g u l a","date":"2016-12-11T12:26:28.966+0000","title":"Que piensan de los supuestos comentarios \"racistas\" de Vendetta y Elmo?","subforum":"Charlas Generales","embed":{"description":"Comentario que tomado de una forma negativa, el cual segun vendettha no fue con alguna mala intención","url":"https://www.youtube.com/watch?v=OftArr8CjTA","image":"https://i.ytimg.com/vi/OftArr8CjTA/hqdefault.jpg"},"up_votes":5,"down_votes":1,"body":"Yo creo que fue un poco exagerado suspenderlos, fue con humor,  pero no se, Riot y la quien organiza todo sabran lo que hacen.\r\n&iquest;Que piensan? {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"KEVlN","date":"2016-12-11T14:50:42.540+0000","up_votes":6,"down_votes":4,"body":"Primero no fue ninguna conducta racista, imitar un acento no tiene nada que ver con el racismo. Segundo, no creo que haya ningun chino ni asiatico ofendido por esto, y si lo esta es un poco tonto con todo el respeto. Y el tercero es la gravedad de la reaccion, todos escuchamos alguna ves imitar a algun acento o imitaron el acento de nuestro pais y puede gustarnos no pero JAMAS nos sentiriamos ofendidos al punto de desearle pasarlo tan mal y echarlos de donde estan (Que es mucho peor que una simple ofensa).\n\n Personalmente me sentiria mil veces peor si me echan de un stream que casteo que porque alguien imite el acento argentino o se burle de nosotros","replies":[{"poster":"support girl uwu","date":"2016-12-11T15:49:20.012+0000","up_votes":8,"down_votes":1,"body":"Es que si es bastante agresivo, es como si ponen en cámara un player argentino y dicen ''debe estar pensando: che boludo cuantas copas tenes jejejeje'' , ''sisi debe pensar: voy a robar el baron con la nariz'', a vos podrá no ofenderte, pero a varios miles sí. \n\nY también depende de quien lo hace, no es lo mismo lo que hace un random a lo que hace alguien ''famoso'', menos un caster, por ej, cuando vino Obama, veías miles de personas quemando banderas de EEUU, y como eran randoms nadie dijo nada, pero el día que Justin Bieber tiró una bandera argentina del piso del escenario querían crucificarlo, y todavía hay algunos ofendidos por eso, porque es alguien famoso. \n\nPor ahí con tus amigos te la pasas haciendo chistes así, y está perfecto, pero si estas casteando un stream, que le va a llegar a millones de personas, algunas súper sensibles, otras hiper nacionalistas, y otras que pueden ofenderse por cualquier cosa, simplemente tenes que evitar comentarios así, porque no estas en tu canal de youtube con tono humorístico, estas casteando un evento...","replies":[{"poster":"Callate Vos","date":"2016-12-11T16:22:14.409+0000","up_votes":3,"down_votes":2,"body":"No creo que sea lo mismo hacer un chiste imitando la forma de hablar de un chino, que decirles amarillos, petisos, miembro pequeño.","replies":[]}]},{"poster":"Dyaebl","date":"2016-12-11T15:48:36.812+0000","up_votes":4,"down_votes":2,"body":"No imitaron acento, las palabras \"chang ching chong\" son consideradas insulto, si decian cualquier otra cosa no habia problema","replies":[{"poster":"KerneI panic","date":"2016-12-11T16:38:25.311+0000","up_votes":5,"down_votes":0,"body":"no no no, mira yo conozco un chino que vende wantan y royos primavera fuera de la U, le dije esas palabras y le pregunte si le sonaba a  algo, me dijo que no significa nada, que amarillistas son de verdad la jodieron como si ubiera sido un chiste antisemita","replies":[{"poster":"Dyaebl","date":"2016-12-11T16:43:06.403+0000","up_votes":1,"down_votes":4,"body":"Puede ser que para alguien acostumbrado no, en china reportaron a los casters y es algo que se usa como insulto.\n\nSiguiendo esa logica, porque un judio tiene mas derechos que un chino? esta bien insultar a un chino peroa un judio no?\nEstaria perfectamente justificado ir a china a hacer grafitis en estatuas historicas pero deberia estar muerto si quemo un koran enfrente de una sinagoga?\n\n\nSvenskeren tubo un ban de competitivo por usar las mismas palabras en el server de taiwan, tubo el ban porque muchisima gente lo reporto como ofensivo igual que como paso aca","replies":[{"poster":"KerneI panic","date":"2016-12-11T17:00:42.056+0000","up_votes":3,"down_votes":0,"body":"no te enseñaron a leer no?","replies":[]}]}]}]},{"poster":"Zesc","date":"2016-12-11T15:55:32.407+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Falls,realm=LAS,application-id=v7qsfXsE,discussion-id=PBEZRdHY,comment-id=0004,timestamp=2016-12-11T14:50:42.540+0000)\n>\n> Primero no fue ninguna conducta racista, imitar un acento no tiene nada que ver con el racismo. Segundo, no creo que haya ningun chino ni asiatico ofendido por esto, y si lo esta es un poco tonto con todo el respeto. Y el tercero es la gravedad de la reaccion, todos escuchamos alguna ves imitar a algun acento o imitaron el acento de nuestro pais y puede gustarnos no pero JAMAS nos sentiriamos ofendidos al punto de desearle pasarlo tan mal y echarlos de donde estan (Que es mucho peor que una simple ofensa).\n> \n>  Personalmente me sentiria mil veces peor si me echan de un stream que casteo que porque alguien imite el acento argentino o se burle de nosotros\n\nNo es imitación de acento para empezar, no trato de decir una palabra en chino. Es el equivalente a que te digan \"ahi va el team taco representando a Latinoamérica del sur\" \"no pudo robar ese barón, probablemente se distrajo pensando en tacos el argentino....\"\n\nSegundo, fue ofensivo porque fue debido a la reacción de las comunidades de otros países lo que llevo a que se discuta en Reddit.\nNo fue con mala intención, es obvio,  pero las acciones se deben tomar, hay una falta de viveza de entender que hay ciertas cosas que no podes decir en una transmisión.\nEstuvieron perfectas las acciones de Riot, hay una falta de profesionalismo en los casters de e-sports en todo el mundo. Decime un relator de cualquier otro deporte en donde digan algo parecido y que no fuesen sancionados.... fíjate en las olimpiadas a ver que referencias hay sobre los brasileros, rusos , chinos... El caster tiene que tener una conducta profesional, no esta haciendo un streaming personal, mucho menos esta tomándose un café con los amigos.","replies":[{"poster":"KEVlN","date":"2016-12-11T21:38:16.582+0000","up_votes":2,"down_votes":0,"body":"Si vieras lo que dijo un relator de futbol de argentina sin ser sancionado","replies":[{"poster":"Zesc","date":"2016-12-12T00:58:44.798+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Falls,realm=LAS,application-id=v7qsfXsE,discussion-id=PBEZRdHY,comment-id=000400020000,timestamp=2016-12-11T21:38:16.582+0000)\n>\n> Si vieras lo que dijo un relator de futbol de argentina sin ser sancionado\n\nDecime quien cuando y a que pais discrimino. Igual esta mas que claro que una cosa no quita la otra, sobre todo en el futbol hay una gran diferencia entre el profesionalismo de estos tipos y el de los casters de e-sports.","replies":[]}]}]}]},{"poster":"Thails SirYordle","date":"2016-12-11T15:05:39.572+0000","up_votes":3,"down_votes":1,"body":"Nose pero hace unos años los de NA y EU hicieron algo parecido cagandose de risa y no paso nada que yo sepa, al menos el video que pasaron\n\nPD: Yo ni sabia que eso era una frase ofensiva...","replies":[{"poster":"Dyaebl","date":"2016-12-11T15:47:55.653+0000","up_votes":2,"down_votes":3,"body":"El problema no es hablar como chinos para reirse, el problema es que las palabras que usaron \"chang ching chong\" son consideradas insulto en asia del este.\n\nLo mismo pasa cuando dicen \"wildcard\" en un torneo internacional y no hacen nada porque es con humor, pero si dicen taco taco burrito mexicano, sudaca, etc van a tener suspenciones y multas.","replies":[{"poster":"Thails SirYordle","date":"2016-12-11T17:43:21.242+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Dyaebl,realm=LAS,application-id=v7qsfXsE,discussion-id=PBEZRdHY,comment-id=00050000,timestamp=2016-12-11T15:47:55.653+0000)\n>\n> El problema no es hablar como chinos para reirse, el problema es que las palabras que usaron &quot;chang ching chong&quot; son consideradas insulto en asia del este.\n> \n> Lo mismo pasa cuando dicen &quot;wildcard&quot; en un torneo internacional y no hacen nada porque es con humor, pero si dicen taco taco burrito mexicano, sudaca, etc van a tener suspenciones y multas.\n\nEl Chang ching chong es una manera de burla del habla inglesa en forma de imitación al habla de los asiáticos que a veces no comprendemos lo que dicen, y el chang ching chong no tiene significado alguno, es lo mismo que hablar como chino.\n\nChan Ching Chong= Método de burla hacia el habla de un Chino y se considera racismo\n\nHablar como Chino= Imitar el habla de un Chino, por lo que también seria racismo","replies":[]}]}]},{"poster":"support girl uwu","date":"2016-12-11T13:42:50.462+0000","up_votes":5,"down_votes":3,"body":"Me acuerdo que una vez suspendieron a un player de un torneo (creo que fue a Svenskeren), por ponerse ''Taipeichingchong'' de nombre en una smurf en Taiwan, si le metieron un ban del competitivo solamente por el nombre de una cuenta, es lógico que a un caster por hacer un ''chiste'' así les metan una sanción. Por lo parte igual lo veo 100% innecesario y nada gracioso el comentario que hicieron, son casters, no humoristas, si no se les dan bien los chistes que no los hagan y listo...","replies":[{"poster":"resnov15","date":"2016-12-11T14:37:47.477+0000","up_votes":1,"down_votes":0,"body":"Seguro si ayer hubieras esuchado mi chiste te habrias reido","replies":[]},{"poster":"SpecTyte","date":"2016-12-11T14:54:21.675+0000","up_votes":3,"down_votes":3,"body":"Ching Chong y Ching Chang Chong son peyorativas términos a veces empleadas por los hablantes de Inglés para burlarse o jugar en el idioma chino , las personas de ascendencia china , u otros asiáticos del este percibidos como chino. Varios comentaristas públicos han caracterizado el término como un insulto al tiempo que observa que las agresiones o intimidación física de los asiáticos orientales suelen ir acompañados de insultos raciales o imitación china.\n\nEs como insultarlos más que un chiste","replies":[]}]},{"poster":"LeonardoSB","date":"2016-12-11T12:31:32.384+0000","up_votes":4,"down_votes":3,"body":"yo recien hoy me enteré de esos comentarios, como que ni bola le doy a los caster de las y lan, prefiero verme a los de NA que tienen mas sentido y fundamentan sus opiniones, que los de aca que basicamente se cagan de la risa como en una reunion de amigos, en vez de un trabajo.","replies":[]},{"poster":"Vanguard","date":"2016-12-11T16:39:21.377+0000","up_votes":2,"down_votes":1,"body":"Fue un chiste. No merecen perder la posibilidad de trabajar casteando el allstar. Rito deja a tanto toxico suelto, que hace amenazas de muerte, insultos homo/xenofobicos, pero hecha del allstar a 2 caster mas buenos que el pan por un chiste.","replies":[]},{"poster":"OG uwusaurio","date":"2016-12-11T13:21:34.913+0000","up_votes":2,"down_votes":1,"body":"Ya hay un tema con esto :D http://boards.las.leagueoflegends.com/es/c/charlas-generales/FhjAxELo-acusacian-contra-casters-de-las","replies":[]},{"poster":"sipios","date":"2016-12-12T02:57:09.959+0000","up_votes":1,"down_votes":0,"body":"{{champion:36}} mundo no enterder chiste","replies":[]},{"poster":"Shion Archimago","date":"2016-12-11T14:20:15.792+0000","up_votes":2,"down_votes":5,"body":"molestar a los chinos? cuando la empresa q compro riot el año pasado es china? oye son unos genios :v\n\nbien hecho x riot a ver si asi vendeta se da cuenta q ya no esta en su twich personal y piensa un poco antes de decir las cosas","replies":[]}]}