{"poster":"Me Das Un Ibu400","date":"2015-11-15T15:02:52.632+0000","title":"Mi propuesta para esta Season, para la selección de campeones!  ¿Opiniones?","subforum":"Charlas Generales","embed":{"description":"Nunca les ha pasado sobretodo en Ranked, que tiene que elegir un campeon y a veces entre tantas opciones (cuando tenes mas de 50..60 campeones como minimo) te perdés y muchas veces no encontras bien a tu campeon o tal vez no te acordabas que tenias un campeon bueno para pickear porque no lo viste y pickeaste otra cosa?","url":"https://youtu.be/UIl3QhzhqNU","image":"https://i.ytimg.com/vi/UIl3QhzhqNU/hqdefault.jpg"},"up_votes":1,"down_votes":2,"body":"Nunca les ha pasado sobretodo en Ranked, que tiene que elegir un campe&oacute;n y a veces entre tantas opciones (cuando tienes mas de 60..70 campeones como m&iacute;nimo) te perd&eacute;s y muchas veces no encontras bien a tu campe&oacute;n o tal vez no te acordabas que ten&iacute;as un campe&oacute;n bueno para pickear porque no lo viste y pickeaste otra cosa?\nBueno, a mi me ha pasado miles de veces, de por ejemplo, Del otro lado tener una {{champion:92}}  y empezar a buscar entre mis champs un buen Top para jugarle en contra, en ese momento no vi a {{champion:23}}  y no se me ocurri&oacute; pickearlo, termine pickeando {{champion:58}}  creo o no me acuerdo bien, la cuesti&oacute;n es que por no ver a {{champion:23}} , me olvide que ten&iacute;a esa opci&oacute;n,y sin duda si lo hubiera visto lo hubiera pickeado a el.\n\nAs&iacute; que mi propuesta ser&iacute;a algo m&aacute;s o menos asi, desde ya que yo no se editar muy bien y qued&oacute; medio mal la edici&oacute;n, pero se entiende lo que quiero proponer.","replies":[{"poster":"Yaderx","date":"2015-11-15T16:14:45.015+0000","up_votes":1,"down_votes":0,"body":"Lamento informarte que la selección de campeones nueva ya esta decidida\nhttps://www.youtube.com/watch?v=SqvRvcAeED4","replies":[]},{"poster":"Ricardob4n","date":"2015-11-15T16:11:40.662+0000","up_votes":1,"down_votes":0,"body":"Por que a la gente le gusta ver el mundo de Riot arder?\nPrimeroe está lo de escribir el nombre del campeón a elegir, o lo otro poner Asesino-Tirador....\nAdemás de los cambios que tiene riot en la S6 especto a la seleccion de campeón,launcher, está el cambio de elegir el campeón antes de pickear....\nLean los post que pone riot, para algo estánn omg.","replies":[]},{"poster":"Lazengan","date":"2015-11-15T15:18:45.909+0000","up_votes":1,"down_votes":0,"body":"Yo creo que sería mas cómodo, poder hacer tipo, una división personal, como por ejemplo con los objetos, pero que se yo, por linea, por ej, dividido entre TOP, JG, MID, ADC y SUP, y vas poniendo los campeones que vos consideras para esas lineas... no se si se entiende","replies":[]},{"poster":"ZeinX1","date":"2015-11-15T15:47:17.706+0000","up_votes":1,"down_votes":1,"body":"Tambien me gustaría que en cñasificatorias exijan un minimo de Maestrias para pickear un champ y no salgan gente jugandolos en ranked sin siquiera haberlo practicado :)","replies":[]},{"poster":"leoogonz","date":"2015-11-15T15:33:47.033+0000","up_votes":1,"down_votes":1,"body":"Jajaja tiene razòn Zendax ,pero yo nunca lo uso,seria mucho mas facil que pongan esa opcion","replies":[]},{"poster":"Zeran","date":"2015-11-15T15:05:54.601+0000","up_votes":1,"down_votes":1,"body":"Lol pero si escribes \"Tirador, Asesino etc etc\" en el buscador se filtran y aparecen los tiradores, asesinos etc etc :l","replies":[{"poster":"Omega Squad","date":"2015-11-15T15:13:00.597+0000","up_votes":1,"down_votes":1,"body":"Totalmente! Igual , recomiendo que visiten el micrositio de la peseason porque ya esta definido como va a ser el nuevo metodo de champ select para las ranks.\n\nSaludos!!","replies":[]},{"poster":"Me Das Un Ibu400","date":"2015-11-15T15:08:15.186+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Zendax,realm=LAS,application-id=v7qsfXsE,discussion-id=3qANk4LW,comment-id=0000,timestamp=2015-11-15T15:05:54.601+0000)\n>\n> Lol pero si escribes \"Tirador, Asesino etc etc\" en el buscador se filtran y aparecen los tiradores, asesinos etc etc :l\n\n\nEs chiste? 3 Años jugando lol y recién ahora me entero? Me voy a pegar un tiro ya vengo jajajaja, bueno, igual me parece algo bueno, ya que es mas rapido y no todos saben eso que dijiste :P ","replies":[]}]}]}