{"poster":"BeatzBoyFTW","date":"2018-11-11T07:48:24.134+0000","title":"I missed when Tanks can be, y'know, TANKS","subforum":"Gameplay","up_votes":42,"down_votes":18,"body":"I missed the time when a Tanks&#039; job is to be as resistant as possible and to absorb most of the damage in for the team while comes at the cost of not being highly mobile &amp; damaging. But...\r\n\r\n- {{champion:14}} Damage &amp; resistance buffed up to a point where he can build HP/AD, and just straights up chunking turrets down whilst ignoring everything else around him, hence introduces the unhealthy &quot;Inting Sion&quot; strat. I mean as a Sion main myself, I love the buffs they granted him, but I felt that it&#039;s just too much. Maybe just the W buff is good enough, but the Q damage should&#039;ve stayed the same rather than being buffed just for the sake of prioritizing Q maxing than E.\r\n\r\n- {{champion:516}} Most of his CC power &amp; self-protection got nerfed/removed a lot in exchange for more damage &amp; highly calculated CC duration depending on the usability of his kit. I can&#039;t say much for now, so we&#039;ll see in preseason.\r\n\r\n-  {{champion:113}} Was already in a bad spot to being with, and still resulted in having more of her CC removed for more damage. As of now, her changes is REVERTED, but I&#039;m just more worried about how her future state could&#039;ve ended up as.","replies":[{"poster":"Aionius","date":"2018-11-11T08:59:17.962+0000","up_votes":17,"down_votes":4,"body":"Honestly if I had to say which meta was the most balanced, it was the tank meta in Season 5. While tanks were FotM, everyone was viable and all the lanes had value. Nowdays you have so much broken stuff it's not even funny.","replies":[{"poster":"SuffocateMeDaddy","date":"2018-11-11T10:18:34.324+0000","up_votes":3,"down_votes":26,"body":"Balanced in your opinion is making entire fighter champion roster useless huh? Balanced in your opinion means {{champion:222}} {{champion:67}} {{champion:96}} {{champion:145}} those are only viable ADCs? Balanced in your opinion means slashing entire top lane roster to 1/4 of picks and making 4 adcs mandatory. Cool balance I guess. All because tank meta is \"balanced\" in your opinion.","replies":[{"poster":"no to toxic","date":"2018-11-11T10:47:49.904+0000","up_votes":27,"down_votes":2,"body":"Guy mentions season 5. Mention a adc wich didn´t even exist during that time. hmmmmmmmh","replies":[{"poster":"LordGeovanni","date":"2018-11-12T04:09:52.980+0000","up_votes":3,"down_votes":0,"body":"Adcs were just fine during season 5 they just werent dominating 3 lanes and killing things in 3 seconds.","replies":[]},{"poster":"MooooooooreDakka","date":"2018-11-12T19:20:24.199+0000","up_votes":1,"down_votes":0,"body":"I believe Kaisa was included since while she wasn't around during the season 5 tank meta, she would be powerful if another one would occur along with the other hypercarries that he listed that were really strong during that meta.","replies":[]}]},{"poster":"TheSingularity","date":"2018-11-11T11:18:37.256+0000","up_votes":16,"down_votes":0,"body":"Actually almost all of the marksman were viable. Despite cait being weaker, she was still strong in her roll as a lane bully to shut down the enemy. And many fighters were also viable. Notable picks being yi, udyr, vi, fiora and jax on top of juggernauts","replies":[{"poster":"SuffocateMeDaddy","date":"2018-11-11T13:19:39.154+0000","up_votes":1,"down_votes":16,"body":"yeah right, these {{champion:236}} {{champion:498}} {{champion:15}} {{champion:119}} {{champion:202}} {{champion:81}} {{champion:22}} were viable xd. JAX was viable in tank meta XD. Without conqueror Jax would be completely useless against anyone who can afford to build this {{item:3110}} . Udyr was viable XD, he didnt exist until they literally doubled his tiger stance damage and made his healing independent on damage dealt. Ergo Udyr didnt exist until he was made to counter tanks. Yi is a joke abusing on hit effects. Vi is still useless. Fiora was picked to counter only fighter viable {{champion:122}} .","replies":[{"poster":"TheSymbolÔfPeace","date":"2018-11-11T15:58:19.088+0000","up_votes":8,"down_votes":0,"body":"Using the \"XD\" face will only make your points more insignificant and take less seriously Xd","replies":[{"poster":"SuffocateMeDaddy","date":"2018-11-11T16:09:23.472+0000","up_votes":3,"down_votes":7,"body":"Its because I cant take seriously anyone who said something so stupid like \"All marksmen were viable\" as if forums werent fucking full of \"I am tired of hyper carries deciding the game\", \"I just want to play Lucian for once\", \"Why have you forsaken Ashe\". I guess those times didnt happen. And then dude continuted with JAX BEING FUCKING VIABLE IN TANK META??? Really? Jax is splitpusher that has dog shit teamfight. In tank meta he couldnt duel tanks, which means he couldnt split push and he couldnt teamfight because tanks are made for teamfighting. I honestly cannot believe how dumb tank mains are. How blind they are to factual evidence and how they dismiss any claims of their favorite class being unhealthy, unfair and fundamentally broken part of this and any pvp game.","replies":[{"poster":"TheSymbolÔfPeace","date":"2018-11-11T17:07:10.966+0000","up_votes":7,"down_votes":0,"body":"For me, I prefer tank meta more than this current meta. Yes tanks were annoying with how much HP sand damage they dealt, but I'd rather have a chance to fight back than dying in less than <1second, and that hoenstly doesn't get much longer for tanks.","replies":[]}]}]},{"poster":"SithesisLord","date":"2018-11-11T16:13:55.777+0000","up_votes":9,"down_votes":1,"body":">Without conqueror Jax would be completely useless against anyone who can afford to build this\n\nImplying Conqueror is the only problem with Jax and not the fact he's an ancient, unhealthy stat-check.","replies":[{"poster":"SuffocateMeDaddy","date":"2018-11-11T16:20:36.785+0000","up_votes":2,"down_votes":11,"body":"And what exactly are tanks? Which one of the tanks posses interactive well thought out gameplay? Because as far as I am aware, tanks that do posses skill based mechanics are actually outplayable. Outplay fucking malphite. Outplay fucking amumu that mised his single and only skillshit but hit minion next to you and ulted you entire fucking team. Outplay Maokai in late with his point click snare, his instad knock back bash with ridiculous base damage, his free sustain when ever you try to retaliate and please do fucking outplay his ult in size of a lane. Only tank that doesnt feel like stat check and people might consider somewhat skill based is Sion. You can actually dodge his entire kit, you can destroy his shield before it detonates, he doesnt beat you without clear indication of why are you loosing. And even then he has to have 55% win rate in Diamond + to be somewhat popular pick. Tanks are stat check just like Jax is and their only counter play is waiting out their overpowered early game and praying to fucking god that they suck in team fights.","replies":[{"poster":"EndlessSorcerer","date":"2018-11-11T16:29:22.099+0000","up_votes":7,"down_votes":0,"body":"> Outplay fucking malphite. \n\nIf you have a blink up (and half-decent reaction times), you can easily avoid his ultimate.  While it's cooldown is significantly lower than Flash, it's his main contribution to teamfights and he can't really do much until it comes back up.\n\n> Outplay fucking amumu that mised his single and only skillshit but hit minion next to you and ulted you entire fucking team. \n\nIf your entire teams is grouped up near an opponent with AOE CC, you screwed up.  It's like complaining that Fiddlestick's ultimate murdered your entire team when you grouped and had no vision of the area.","replies":[]},{"poster":"SithesisLord","date":"2018-11-11T16:32:35.850+0000","up_votes":3,"down_votes":1,"body":"Outplay a Jax who has a low CD jump, AA reset and AoE stun (and has been batshit broken for more than 12 patches).\n\nThere´s a reason that out of the top 10 best top laners in Diamond+, [he rarely drops below the 4th position.](https://lolalytics.com/ranked/worldwide/diamond/plus/champion/Jax/Top/)","replies":[{"poster":"LordGeovanni","date":"2018-11-12T04:16:27.089+0000","up_votes":2,"down_votes":0,"body":"if jax jump is low cooldown these mobility options dont have cooldowns {{champion:119}} {{champion:84}} {{champion:114}} {{champion:81}} {{champion:105}} {{champion:121}} {{champion:133}}  etc","replies":[]}]}]}]},{"poster":"TheSingularity","date":"2018-11-12T00:19:27.055+0000","up_votes":1,"down_votes":0,"body":"Draven, lucian, ashe and ezreal were very strong as the first decimated the others in laning phase while the rest synrgised with anti tank builds.\nJax built BOTRK+tri into tank back then and scaled like a god like always. He simply out lasted them. udyr had feral flare and sated devourer at different points during season 5. He was build as phoenix stance udyr, not tiger stance udyr.\n\"Yi is a joke abusing on hit effects\" he is hence why he worked. Vi is useless, but she wasn't back then. Fiora was picked to counter everyone during that season, she was rather oppressive up top","replies":[{"poster":"SuffocateMeDaddy","date":"2018-11-12T09:20:09.139+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KrakenKnight,realm=OCE,application-id=3ErqAdtq,discussion-id=H1M5EWdg,comment-id=00020000000100000002,timestamp=2018-11-12T00:19:27.055+0000)\n>\n> Draven, lucian, ashe and ezreal were very strong as the first decimated the others in laning phase while the rest synrgised with anti tank builds.\n\nWHAT are you talking about???? NOONE PICKED THEM https://www.leagueofgraphs.com/champions/stats/lucian/euw/diamond His pick rate during season 5 was as low as his pick rate at start of this season. EXCEPT HE WASNT PICKED ENTIRE FUCKING SEASON.  \n\nhttps://www.leagueofgraphs.com/champions/stats/ashe/euw/diamond Her pick rate spiked for while after rework and then she wasnt picked until season 5 ended. \n\nhttps://www.leagueofgraphs.com/champions/stats/draven/euw/diamond By the end of season 2015 his pick rate was at all time lowest.\n\nhttps://www.leagueofgraphs.com/champions/stats/ezreal/euw/diamond High pick rate at the beginning at the start of season because people actually though you can kite tanks. LOWEST PICK RATE BY THE END OF SEASON. \n\nTHERE IS DATA RIGHT THERE ON THE FUCKING INTERNET.\n\nBut sure lets look at hyper carries shall we?\n\nhttps://www.leagueofgraphs.com/champions/stats/vayne/euw/diamond Highest pick rate in season 5\n\nhttps://www.leagueofgraphs.com/champions/stats/jinx/euw/diamond highest pick rate in season 5\n\nI dont fucking get it why are tank mains so stupid?\n\n> Jax built BOTRK+tri into tank back then and scaled like a god like always. He simply out lasted them. \n\nhttps://www.leagueofgraphs.com/champions/stats/jax/euw/diamond LOWEST PICK RATE DURING TANK META AND EVEN ONE OF THE LOWEST WIN RATES. WHAT THE FUCK ARE YOU TALKING ABOUT. DID YOU PLAY IN SEASON 5 AT FUCKING ALL?\n\n>udyr had feral flare and sated devourer at different points during season 5. He was build as phoenix stance udyr, not tiger stance udyr.\n\nAs if that was somehow healthy gameplay.\n \n> &quot;Yi is a joke abusing on hit effects&quot; he is hence why he worked. \n\n\n>Vi is useless, but she wasn&#x27;t back then. \n\nBy saying she is still useless I was implying that she never was useful. \nhttps://www.leagueofgraphs.com/champions/stats/vi/euw/diamond\nHigh pick rate by the start lowest by the end of season 5. WHY? Because % max hp physical damage means JACK SHIT ON FIGHTERS THAT CANT LAST WHOLE MINUTE IN FIGHT LIKE TANKS DID.\n\n>Fiora was picked to counter everyone during that season, she was rather oppressive up top\n\nFiora doesnt counter tanks. Say what you fucking what, Fiora counters fighters, not class of champions that can rush tabi thornmail and deal more damage than her.","replies":[]}]}]}]},{"poster":"Aionius","date":"2018-11-13T14:38:47.823+0000","up_votes":1,"down_votes":0,"body":"Yet 13+ people agree with me hmmm.... Also you don't understand that the Fighter champion roster is SUPREMELY useless minus {{champion:122}} {{champion:39}}  {{champion:420}}  . Literally every fighter you could post has their highest win rate in the Mid Lane or Jungle minus the champions I have posted plus {{champion:24}} . People either tank up, or go AP or ranged top. Also your \"only viable adc\" roster is short. {{champion:21}} {{champion:119}} {{champion:29}} {{champion:51}} would shut you down had you played wrong and were the most prominate lane bullys ever (who still are). You clearly have never played Season 5 much. Because if you had you'd note that there were a lot more ADCs picked then, instead of 5 in a row games of straight up {{champion:145}} ","replies":[{"poster":"SuffocateMeDaddy","date":"2018-11-13T15:18:50.933+0000","up_votes":1,"down_votes":0,"body":"A lot more adcs were picked back then? REALLY NOW?\nhttps://www.leagueofgraphs.com/champions/stats/lucian/euw/adc/diamond\nWeird how he had one of the lowest pick rates in tank meta, especially if you consider how broken he was bakc then. Okay what about Draven?\nhttps://www.leagueofgraphs.com/champions/stats/draven/euw/adc/diamond\nLowest pick rate out of his entire history by the end of season 5? That is supposed to support your claims? \nhttps://www.leagueofgraphs.com/champions/stats/twitch/euw/adc/diamond\nLowest pick rate out of his entire history again during season 5? What a weird claim.\nhttps://www.leagueofgraphs.com/champions/stats/caitlyn/euw/adc/diamond\nOne of the lowest pick rates out of entire pick rate if you dont mind the time when they gutted her? What a weird claim. Not to mention, adc roster grew in size, but their pick rates only increased after tank metas ended? Do you look at statistics at all?\n\nAlso my list is short? Maybe looking at graphs here might fucking open your god damn eyes\nhttps://www.leagueofgraphs.com/champions/stats/vayne/euw/adc/diamond\nhttps://www.leagueofgraphs.com/champions/stats/jinx/euw/adc/diamond\nSorry i missed one hyper carry https://www.leagueofgraphs.com/champions/stats/tristana/euw/adc/diamond\n\nMaybe its time to stop looking at past through your opinion lenses and start using factual fucking data.","replies":[{"poster":"Aionius","date":"2018-11-14T01:30:36.329+0000","up_votes":1,"down_votes":0,"body":"https://u.gg/lol/tier-list/?role=adc&rank=diamond_plus. Hmm let's see here.. oh wait! Only 5 Champs picked as ADC actually have positive win rate in Diamond+ and looky here! {{champion:157}}  is in the top 5 beating {{champion:222}} {{champion:145}} and {{champion:15}} . Oh and look at the pick rates. {{champion:236}} and {{champion:145}} over 40% picks, literally over 3x Ezreal and over 4x any other ADC, and you call that variety? Haha okay.","replies":[]}]}]},{"poster":"Aionius","date":"2018-11-13T14:03:53.230+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"SuffocateMeDaddy","date":"2018-11-13T14:05:53.273+0000","up_votes":1,"down_votes":1,"body":"Tank echo chamber. Nothing else.","replies":[{"poster":"Aionius","date":"2018-11-13T14:46:00.778+0000","up_votes":1,"down_votes":0,"body":"I'll take Tank {{champion:245}} over the Inting {{champion:14}} auto win strategy any day. Stop fooling yourself if you actually think  Season 8 is balanced. Oh and Tank {{champion:245}} has been replaced with Tank {{champion:112}} , who has better teamfighting abilities while doing more damage.","replies":[{"poster":"SuffocateMeDaddy","date":"2018-11-13T15:10:29.481+0000","up_votes":1,"down_votes":0,"body":"What? Do you know what echo chamber is? Or are tank mains actually that disabled?","replies":[{"poster":"Aionius","date":"2018-11-13T23:30:50.095+0000","up_votes":1,"down_votes":0,"body":"OKay what does reinforcement have to do with the fact that a tank in S8 can do shit they weren't able to in S5? Nothing actually so a moot point. Good try with fancy words though.","replies":[]}]}]}]}]}]}]},{"poster":"BenLegend443","date":"2018-11-11T15:02:25.661+0000","up_votes":7,"down_votes":0,"body":"{{champion:31}}  still tries to be as tanky AF. He's got a ton of CC and can still insta-delete ADCs for some reason.  By about 35 minutes he has 5000+ hp and a Karthus R does no shit to him. He takes like 200 damage. And trying to be tanky in the old days worked. You face tanked everything, making the enemy team waste all their CDs. Then you killed them. But now there's so much more damage you can't do that. You have to kill them first. You needed to kill that {{champion:145}} before she could proc passive or you take 1000 damage(15% of a 5000+ health tank). Even if you built armor the passive goes right through it. Or ADC's just built {{item:3036}} and shredded you in a few autos. The only champ I see face tanking everything is Karthus/Sion because {{champion:30}} wants to commit suicide(sometimes) and Sion's got his pseudo-revive.  Trying to be resistant isn't going to work when their mage has got a {{item:3165}} and Void Staff, and their Caitlyn has got a {{item:3036}} . They'll shred you in a few seconds. I actually play Caitlyn(Mastery 5) and I could auto their Ezreal once and he dies(in late game of course). I'd also kill their Cho'Gath in a few seconds.  As Karthus, three of my Q and a squishy is dead. Even if you managed to kill me/run, I have my passive and R. With full build Karth gets at least 1000+ AP. Adding that to Requiem's base damage, it totals out to about 1500-2000. 550+(1000 x 0.75). That's not even counting runes like Celerity or Gathering Storm. Remember he's not going to ult anybody without hitting some Qs and W. By now, the game has changed. It is no longer viable to take a ton of damage and live. There is too much global damage for this to work.","replies":[]},{"poster":"Valkyrie","date":"2018-11-11T08:55:12.975+0000","up_votes":10,"down_votes":3,"body":"im currently waiting for the next tank meta if that ever happens, as a seju player ive missed playing against cinderhulk junglers and tank tops every single game. I just love tanks its like seeing titans fight each other, i dont like that everyone dies in a few autos, spells now","replies":[]},{"poster":"Nea104","date":"2018-11-11T13:56:30.415+0000","up_votes":7,"down_votes":1,"body":"Season 8, just more and more mindless damage.\nDefences, sustain and actual teamfights have been almost removed. Intentionally.\n\nThey didn't care about that, and actually they made it worse along the whole Season. I don't think S9 will be better.","replies":[]},{"poster":"Illuminatra","date":"2018-11-11T07:55:55.039+0000","up_votes":8,"down_votes":29,"body":"imagine posting this after laning against a tank poppy as a melee.\n\njust imagine.\n\nuntil then please stop talking about tanks as if they are absolute dogshit which they are no where close to being","replies":[{"poster":"BeatzBoyFTW","date":"2018-11-11T07:57:05.387+0000","up_votes":19,"down_votes":6,"body":"> [{quoted}](name=Illuminatra,realm=NA,application-id=3ErqAdtq,discussion-id=H1M5EWdg,comment-id=0000,timestamp=2018-11-11T07:55:55.039+0000)\n>\n> imagine posting this after laning against a tank poppy as a melee.\n> \n> just imagine.\n> \n> until then please stop talking about tanks as if they are absolute dogshit which they are no where close to being\n\nAccording to your level, you must be very new here to not know how Tank champions used to be few seasons back.","replies":[{"poster":"Illuminatra","date":"2018-11-11T08:03:40.784+0000","up_votes":12,"down_votes":11,"body":"i was here since the beginning and im still here getting my ass dove level 8 by a full tank poppy that can chunk me walk away and continue to do it until im dead or forced to recall.\n\n\ni was here when sion maxed e and took 0 damage all while shoving lane and negating interaction\n\ni was here when ornn was released building full tank and chunking any non tank with a press of his w and an auto attack and then perma ccing them while the jungler cleaned up.\n\ni was here when ekko built full tank and was chunking anyone in sight while healing for 800 with his r.\n\n\nive been here since s2.\n\nsmurfs exist. :)","replies":[{"poster":"BeatzBoyFTW","date":"2018-11-11T08:09:16.951+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=Illuminatra,realm=NA,application-id=3ErqAdtq,discussion-id=H1M5EWdg,comment-id=000000000000,timestamp=2018-11-11T08:03:40.784+0000)\n>\n> i was here since the beginning and im still here getting my ass dove level 8 by a full tank poppy that can chunk me walk away and continue to do it until im dead or forced to recall.\n> \n> \n> i was here when sion maxed e and took 0 damage all while shoving lane and negating interaction\n> \n> i was here when ornn was released building full tank and chunking any non tank with a press of his w and an auto attack and then perma ccing them while the jungler cleaned up.\n> \n> i was here when ekko built full tank and was chunking anyone in sight while healing for 800 with his r.\n> \n> \n> ive been here since s2.\n> \n> smurfs exist. :)\n\nStill counts as horrible times(_even Ornn_), although I do missed building full Tank J4 in the jungle & still stayed relevant, until when Duskblade got introduced & just fucks everything up.\n\nI still don't quite understand the point of having smurfs tho, honestly wasted tons of time unless your main is at risk of being banned.","replies":[]},{"poster":"Frog goes moo","date":"2018-11-11T12:34:55.462+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Illuminatra,realm=NA,application-id=3ErqAdtq,discussion-id=H1M5EWdg,comment-id=000000000000,timestamp=2018-11-11T08:03:40.784+0000)\n>\n> i was here since the beginning and im still here getting my ass dove level 8 by a full tank poppy that can chunk me walk away and continue to do it until im dead or forced to recall.\n> \n> \n> i was here when sion maxed e and took 0 damage all while shoving lane and negating interaction\n> \n> i was here when ornn was released building full tank and chunking any non tank with a press of his w and an auto attack and then perma ccing them while the jungler cleaned up.\n> \n> i was here when ekko built full tank and was chunking anyone in sight while healing for 800 with his r.\n> \n> \n> ive been here since s2.\n> \n> smurfs exist. :)\n\nIf you're having trouble with poppy lmao you might want to uninstall. Also the guy never said that tanks were bad, In fact, if anything it seems like he's they're exceeding what their class should be doing that they're given damage when they should be tanking. \n\nI'll give you some help. \"**chunking turrets** down whilst **ignoring everything else around him**\"\nThis was when he was speaking on sion. \n\nOrnn he said \"nerfed/removed a lot in exchange for more damage\"\n\nand then sej: \"resulted in having more of her CC removed for more damage\"","replies":[]},{"poster":"KOGMIDONLY","date":"2018-11-11T12:16:50.389+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Arzurag","date":"2018-11-12T16:48:11.890+0000","up_votes":1,"down_votes":0,"body":"Since when are poppy and sion not considered tanks? ^^","replies":[]}]}]}]},{"poster":"GigglesO","date":"2018-11-11T16:25:36.468+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Illuminatra,realm=NA,application-id=3ErqAdtq,discussion-id=H1M5EWdg,comment-id=0000,timestamp=2018-11-11T07:55:55.039+0000)\n>\n> imagine posting this after laning against a tank poppy as a melee.\n> \n> just imagine.\n> \n> until then please stop talking about tanks as if they are absolute dogshit which they are no where close to being\n\nYou mean someone that deals high damage but isnt really a tank?","replies":[{"poster":"AirKingNeo","date":"2018-11-11T23:46:27.565+0000","up_votes":1,"down_votes":2,"body":"poppy is a pretty ideal design for tanks though\n\nprotects, has some cc, but also has dueling power and MUST INTERACT","replies":[{"poster":"GigglesO","date":"2018-11-12T00:03:11.494+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AirKingNeo,realm=NA,application-id=3ErqAdtq,discussion-id=H1M5EWdg,comment-id=000000010000,timestamp=2018-11-11T23:46:27.565+0000)\n>\n> poppy is a pretty ideal design for tanks though\n> \n> protects, has some cc, but also has dueling power and MUST INTERACT\n\nThats a fighter design...","replies":[{"poster":"AirKingNeo","date":"2018-11-12T00:04:30.274+0000","up_votes":1,"down_votes":0,"body":"fighters lack 'protect' for real dueling power.","replies":[{"poster":"GigglesO","date":"2018-11-12T01:25:20.874+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AirKingNeo,realm=NA,application-id=3ErqAdtq,discussion-id=H1M5EWdg,comment-id=00000001000000000000,timestamp=2018-11-12T00:04:30.274+0000)\n>\n> fighters lack &#x27;protect&#x27; for real dueling power.\n\nSo Lee Sin is a tank?\n","replies":[{"poster":"AirKingNeo","date":"2018-11-12T01:42:50.147+0000","up_votes":1,"down_votes":2,"body":"He very much as dueling mechanics and less protection.","replies":[{"poster":"GigglesO","date":"2018-11-12T04:40:21.418+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AirKingNeo,realm=NA,application-id=3ErqAdtq,discussion-id=H1M5EWdg,comment-id=0000000100000000000000000000,timestamp=2018-11-12T01:42:50.147+0000)\n>\n> He very much as dueling mechanics and less protection.\n\nLook, you can't say what you did in your previous statement about poppy not being a fighter because of peel and cc and whatnot, and then say that lee sin is a tank. Either poppy is a fighter, or lee sin is a tank.","replies":[{"poster":"AirKingNeo","date":"2018-11-12T22:58:57.931+0000","up_votes":1,"down_votes":0,"body":"lee is definitely more offensive than poppy.","replies":[{"poster":"GigglesO","date":"2018-11-13T02:14:48.884+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AirKingNeo,realm=NA,application-id=3ErqAdtq,discussion-id=H1M5EWdg,comment-id=000000010000000000000000000000010000,timestamp=2018-11-12T22:58:57.931+0000)\n>\n> lee is definitely more offensive than poppy.\n\nChampions aren't identical... just how morde and darius aren't the same....","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"FNC 6ixGOD","date":"2018-11-11T12:40:30.720+0000","up_votes":5,"down_votes":0,"body":"*cries in a corner* {{champion:113}}","replies":[{"poster":"Iota Theta","date":"2018-11-11T20:58:21.583+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FNC 6ixGOD,realm=EUW,application-id=3ErqAdtq,discussion-id=H1M5EWdg,comment-id=0005,timestamp=2018-11-11T12:40:30.720+0000)\n>\n> *cries in a corner* {{champion:113}}\n\n* Grumbles in a corner* {{champion:516}}","replies":[{"poster":"3TWarrior","date":"2018-11-12T02:24:40.645+0000","up_votes":1,"down_votes":0,"body":"{{champion:32}}  :  just wants a friend as he cries","replies":[{"poster":"FNC 6ixGOD","date":"2018-11-12T08:32:54.398+0000","up_votes":1,"down_votes":0,"body":"Luckily my highest point champion is Amumu XD","replies":[]}]}]}]}]}