{"poster":"BeatzBoyFTW","date":"2015-09-09T08:53:24.495+0000","title":"Dear players who wants to play their mains, aka Leona/Lucian/Yi/Fiora/Yasuo/Zed","subforum":"[ARCHIVED] Miscellaneous","up_votes":2,"down_votes":6,"body":"Please expect a lot of autolockers of those champs in both Normals &amp; Rank games, where their job is to show off their flashy Project skin and then make you lose the game.\n\nBut what can I say? Guess the money is worth it for about a week or 2 til they stop playing them again, especially to those 10 yo brats paying with their mom's money......\n\n_Tip 1:_ In Team Builder:\n\nIf you're the group leader, reject all Leona/Lucian/Yi/Fiora/Yasuo/Zed players. Trust me, about 90% of them are fake mains.\n\nIf you're looking for a group, and you suddenly happen to join a group consisting of one of those champions, leave.\n\n_Tip 2:_ Ban at least 3 of those champs(altogether with the enemy's bans I mean). Don't let them ruin your promos/rank games just because your teammates are here only to show off their Project skins instead of winning LP.\n\n-----\n\nBut if you guys are the type of guys who doesn't really care about winning &amp; just wants to have fun, then so be it. I won't be there to stop you. Just make sure those guys aren't toxic.","replies":[{"poster":"AntiSkillshot","date":"2015-09-09T10:58:47.757+0000","up_votes":1,"down_votes":0,"body":"If you're going to reject people just based on the champion they're playing, there's a huge problem with you.  I see Team Builder as what Blind Pick should've been.  A place to actually practice a champion.","replies":[]},{"poster":"The3cho","date":"2015-09-09T09:10:44.154+0000","up_votes":1,"down_votes":0,"body":"I find it as an opportunity to learn how to play against some of the most oppressive champions in the game.\n\nBring on the learning and the first timers! ;)\n\nNOTE: I say this because I just played against 3/5 PROJECT champs in 1 game. (they weren't that good imo...)\n\nhttp://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/1945301259/33882607?tab=overview","replies":[]},{"poster":"SEKAI","date":"2015-09-09T08:54:51.603+0000","up_votes":1,"down_votes":0,"body":"If it's norms I can't see why you wouldn't let people play whoever, it doesn't count towards anything.","replies":[{"poster":"BeatzBoyFTW","date":"2015-09-09T08:58:18.403+0000","up_votes":1,"down_votes":1,"body":"There are those who are toxic as fk in any games because they want to win. But since youre one of the types who just wants to have fun, then just go ahead. I ain't forcing :p","replies":[]}]}]}