{"poster":"BeatzBoyFTW","date":"2017-03-04T09:13:40.542+0000","title":"Why are there players building Bloodrazor on Warwick, instead of Cinderhulk?","subforum":"[ARCHIVED] Miscellaneous","up_votes":1,"down_votes":1,"body":"What are the actual benefits of it really? Is it just to proc the passive on his ult 3 times more or something?","replies":[{"poster":"JRobin31","date":"2017-03-06T19:11:50.902+0000","up_votes":1,"down_votes":0,"body":"Players have slowly been moving away from Bloodrazor and the Warwick win rate has finally hit 50% now that only die hard Bloodrazor fans (and those that don't know better) still build it.  Cinderhulk is okay, but the real Warwick build is to go Tiamat and worry about completing a jungle item some other time.\n\nThere are still plenty of strong (Challenger/Master/Diamond) players that prefer to build Bloodrazor, but don't confuse this to mean Bloodrazor is actually a better item choice.  If you are good enough, then it won't matter that you chose Bloodrazor.  The data on players that are platinum+ has been showing that Warwick's win rate has improved steadily as more players choose Cinderhulk over Bloodrazor.  But like I said, the jungle item isn't even that important to complete on Warwick.\n\nThe main reason players still build Bloodrazor is that they just don't know any better.  Warwick used to benefit hugely from building attack speed.  Bloodrazor still gives %damage, but the attack speed from Bloodrazor is basically wasted gold.  Almost any other stat is more useful than building attack speed on the new Warwick.","replies":[]},{"poster":"Zezockary","date":"2017-03-04T09:56:44.120+0000","up_votes":1,"down_votes":0,"body":"If your target is low health ww gets a huge attack speed buff letting him abuse the on hit effect, and the attack speed on the item lets him proc his passive more so he has better sustain and damage from that.\n\nThe item synergises really well with him, and if you go that into frozen mallet you can catch people out well and still be tanky.\n\nCinderhulk is better if your team is super squishy but if you have like a Braum support or Poppy top bloodrazor is a good choice.","replies":[]}]}