{"poster":"BeatzBoyFTW","date":"2015-02-06T06:48:16.688+0000","title":"If you had a chance to become a Rioter for a week....","subforum":"Memes & Games","up_votes":13,"down_votes":4,"body":"What would you do?\n\nMine is to simply disguise myself as an ordinary player (since to be a rioter, your username had to include the name \"Riot\", eg. Riot KateyKhaos or Riot Phreak), and then play any normal or rank games. When someone will go say something like** \"going mid\"**\"but I called mid first\"**\"fine ill feed\"**, or when he afk-ed either for fun or  feeds first blood and thinks the game is lost, or anything troll-related, I will send them to a straight 3 years suspension, cause perma-ban is too heavy & a \"little bit\" too punishing, amirite ;)","replies":[{"poster":"EnvyDragon","date":"2015-02-06T23:28:53.324+0000","up_votes":22,"down_votes":0,"body":"> [{quoted}](name=BeatzBoyFTW,realm=NA,application-id=Ir7ZrJjF,discussion-id=gcxJqzTq,comment-id=,timestamp=2015-02-06T06:48:16.688+0000)\n>\n> What would you do?\n\nMy job.\n\nHopefully well enough to convince them to keep me on after day 8.","replies":[{"poster":"MrBuffington","date":"2015-02-07T01:06:44.397+0000","up_votes":6,"down_votes":0,"body":"^ this ~~person~~ dragon knows what's up","replies":[]}]},{"poster":"moonstones","date":"2015-02-06T23:19:06.275+0000","up_votes":11,"down_votes":0,"body":"Pssst, our names don't have to have \"Riot\" in them. :]","replies":[{"poster":"BeatzBoyFTW","date":"2015-02-07T00:50:28.117+0000","up_votes":3,"down_votes":0,"body":"But....but it's right there O.o","replies":[{"poster":"moonstones","date":"2015-02-07T01:02:26.521+0000","up_votes":3,"down_votes":0,"body":"Totally optional. :D","replies":[{"poster":"BeatzBoyFTW","date":"2015-02-07T01:25:15.723+0000","up_votes":1,"down_votes":0,"body":"Wait, so does it mean, if I were to search for names like \"Phreak\", \"Morello\", or \"Kateykhaos\" into the summoner search bar, I would be looking at an actual Rioter's profile? Or just someone who wants to copyright a certain Rioter?\n\nP.S. Im definitely not stalking. I swear :p","replies":[{"poster":"moonstones","date":"2015-02-07T01:27:57.470+0000","up_votes":2,"down_votes":0,"body":"Sometimes there's a non-Riot version, and sometimes there isn't, haha. If you watch Phreak stream, you'll see it's just Phreak.\n\nI have another account that I leveled up, but it has nothing to do with KateyKhaos.","replies":[{"poster":"ChimeiTekinaNasu","date":"2015-02-07T02:12:55.882+0000","up_votes":1,"down_votes":0,"body":"I bet it has something to do with KhaosKatey.\n\nP.S. How did you decide on your summoner name. Like what's the story behind it =3","replies":[{"poster":"moonstones","date":"2015-02-07T02:16:26.505+0000","up_votes":10,"down_votes":0,"body":"I got the nickname Katey Khaos in college. A friend had given it to me 'cause I was always suggesting crazy ideas of things to do on the weekend, and just being pretty chaotic personality wise. (My friends and I always joked that this was some kind of dumb scene name, so I nicknamed the kid who gave it to me, Mikey Malice, appropriately.) It stuck, and I made it my IGN tag for pretty much everything. Once I started working at Riot, just added Riot to the front of it.","replies":[{"poster":"godsmustbecrazy3","date":"2015-02-08T04:06:17.418+0000","up_votes":1,"down_votes":0,"body":"Was Jinx created from your personality model?\n\nI love Jinx Video music you guys made. I love Jinx.","replies":[{"poster":"moonstones","date":"2015-02-08T05:23:37.257+0000","up_votes":3,"down_votes":0,"body":"I wish, haha. \n\nSome people have said the Firecracker Jinx face looks like me 'cause I had the same hair, only red. xD","replies":[]}]}]}]}]}]}]},{"poster":"MrBuffington","date":"2015-02-07T01:02:06.092+0000","up_votes":4,"down_votes":0,"body":"A lot of Reds don't have \"Riot\" in their name (ie. Pendragon, Ghostcrawler, Morello, Meddler, etc)","replies":[]}]},{"poster":"Drunk Rummate","date":"2015-02-12T04:21:10.053+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot KateyKhaos,realm=NA,application-id=Ir7ZrJjF,discussion-id=gcxJqzTq,comment-id=0004,timestamp=2015-02-06T23:19:06.275+0000)\n>\n> Pssst, our names don't have to have \"Riot\" in them. :]\n\nI figured that out last week! I got to play a team builder game against Triggs from infosec.  Wouldn't have even known he was Rito but he was queued with Riot Reaper and a bunch of other guys/gals.  Triggs was really nice, stuck around and chatted for awhile in post game lobby :D","replies":[]},{"poster":"RedTrinketGoneHa","date":"2015-02-28T16:01:37.186+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot KateyKhaos,realm=NA,application-id=Ir7ZrJjF,discussion-id=gcxJqzTq,comment-id=0004,timestamp=2015-02-06T23:19:06.275+0000)\n>\n> Pssst, our names don't have to have \"Riot\" in them. :]\n\n\n\nKassadin:\n\nE Damage changed to 100/140/180/220/260 + 0.85 AP\n\nR Range increased from 450 => 575 or 600","replies":[]}]},{"poster":"Lwnt","date":"2015-02-07T00:01:09.171+0000","up_votes":6,"down_votes":0,"body":"If I got to work for Riot my first thing will be to help improve the support class.\n1) Improve the itemization of support \n- either make new items with different actives or passives and not just put a 10% cool down on it. \n- Make more ap support items for ap utility support.\n- Make this {{item:2045}} more useful so support player wants to spend money on it.\n2) Make support feel like they are important in the game \n-Either call out players who have gotten 10 assist in row without dying or gotten a kill. It will be nice to hear the announcer to say\n\"ALLY IS ON AN ASSIST SPREA!!!!\"\n-When the game ends let support players see cool stuff on match history and not just assist, wards and how much heals.\n Example\n How much damage was absorbed by your shield either on ally or yourself.\n How many times you slowed, stuned, knock-back, polymorph and other cc  an enemy. Also show where you did it and who you did  it on.\n\n\nWell this is my dream probably will never happen.","replies":[]},{"poster":"Declined","date":"2015-02-07T03:37:56.283+0000","up_votes":4,"down_votes":0,"body":"This reminds me of when I was made moderator of an online game, on my very first day I banned another moderator, because he broke the rules, wasn't an easy decision to make, but it was the right one.\n\nSo what would I do if given the chance? Make it worthwhile.\n\nI already know that a lot of projects are under development and as such there's not much to be done for a 'rookie', what I can do is participate and argue for (or against) subjects I am knowledgeable in, and take in as much in the subjects I am uncertain of.\n\nBut most importantly, when the week is up, make sure to leave it a happier place than when I found it, cause at the end of the day these guys are the reason we have a game.","replies":[]},{"poster":"Big Bang Bob","date":"2015-02-07T01:17:40.931+0000","up_votes":3,"down_votes":0,"body":"On the last day, I would secretly buff those who were left behind.\n\n{{champion:33}} {{champion:131}} {{champion:6}} {{champion:110}} {{champion:44}} {{champion:133}} {{champion:3}} {{champion:79}} {{champion:48}} {{champion:8}} {{champion:102}} {{champion:78}} {{champion:83}} {{champion:4}} {{champion:68}} {{champion:76}} {{champion:34}} {{champion:63}} {{champion:28}} {{champion:60}} {{champion:38}} {{champion:101}} {{champion:111}} {{champion:82}} {{champion:24}} {{champion:154}} {{champion:29}} \n\nConsidering some of these guys are probably just hidden picks, there would be some seriously screwed up champs. XD","replies":[{"poster":"Xx420n0sc0p3sxX","date":"2015-02-13T13:14:02.560+0000","up_votes":1,"down_votes":0,"body":"Nidalee is considered op right now......Yorick isn't buffed for a good reason. Most of these champs would probably become op if buffed.","replies":[{"poster":"Big Bang Bob","date":"2015-02-13T13:21:51.609+0000","up_votes":2,"down_votes":0,"body":"Better to hear the hilarious cries of \"Urgot OP\" and \"Nerf Taric\".","replies":[]}]}]},{"poster":"Major Sparkles","date":"2015-02-06T23:39:20.371+0000","up_votes":3,"down_votes":0,"body":"I'd make waffles for everyone!!","replies":[]},{"poster":"4nth0l0gy","date":"2015-02-06T06:50:53.704+0000","up_votes":3,"down_votes":0,"body":"Well, you seem like a dick.\n\nIf I were a Rioter for a week, I would fix the lore. All of it.\n\nAlso I would go to an Aviary with Ironstylus.","replies":[]},{"poster":"Gunpoint","date":"2015-02-09T02:51:03.764+0000","up_votes":2,"down_votes":0,"body":"You know you can just apply for a job at Riot on their website, they have many different jobs in many different locations all around the world.","replies":[]},{"poster":"SlackerboyTC","date":"2015-02-06T23:20:41.191+0000","up_votes":3,"down_votes":1,"body":"Fix lore, get rid of or rework lee sin so he inst a jack of all trades","replies":[{"poster":"SecretAgentHulk","date":"2015-02-07T16:48:57.779+0000","up_votes":1,"down_votes":0,"body":"Delete Lee Sin and buff Zed.\n\nAHAHAHAHAHAHAHAHAHAHAHA","replies":[]}]},{"poster":"Rainbow Wasp","date":"2015-02-08T09:40:17.223+0000","up_votes":2,"down_votes":1,"body":"Hmmm...\n\n* Put in Team Fortress 2 skins with new voicelines for certain champions (Soldier {{champion:18}}, Spy {{champion:28}}, Demoman {{champion:115}} or Engineer {{champion:74}} anyone?).\n* Secretly nerf Riven for a day just for the hell of it.\n* Make expired gamemodes playable in custom games at the cost of getting no rewards, so URF whiners can stop whining.\n* Replace the entire LC$ thing with awesome art made by the community, viewable in a handy gallery on the website and in the launcher.\n* Speaking of LC$, ban popular LC$ champions for every game and see what happens.","replies":[]},{"poster":"Maximum Zilean","date":"2015-02-06T07:53:46.697+0000","up_votes":2,"down_votes":1,"body":"Finally rework Lee sin and make him not overloaded beyond reason. Seriously, no matter how they change the jungle. Lee sin finds a way to be overpowered in it! I'd just flat out remove some of the stuff he doesn't need while keeping his identity in check as that highly mobile early game brute.\n\nWhat he doesn't need is the power to be a huge threat late game just by being there! He needs some reasonable way of falling off late game.","replies":[]},{"poster":"Sirsir","date":"2015-03-01T02:53:38.016+0000","up_votes":1,"down_votes":0,"body":"I would convince them to make cheaper recolors again!","replies":[]},{"poster":"BastionKross","date":"2015-02-28T15:57:29.283+0000","up_votes":1,"down_votes":0,"body":"Day 1 - Goodbye {{champion:17}}, spend rest of day dining on bacon with a certain avian Rioter.\n\nDay 2 - Rework {{champion:64}} kit completely with the overall goal being him not being viable in every team comp.\n\nDay 3 - {{item:2049}} now has different enchantments like the jungle items and boots instead of the {{item:2045}} upgrade.\n\nDay 4 - Ash Williams skin for {{champion:41}}, complete with new VO that says \"Groovy\" after every kill.\n\nDay 5 - Create brand new item similar to {{item:3060}} whose primary purpose is to boost the stats of champion pets.\n\nDay 6 - {{summoner:31}} is now a permanent addition to all ARAM games.\n\nDay 7 - Challenge Phreak to a pun contest, make the champion rework team write \"You will remember Yorick Mori\" a thousand times each, and then get fired by telling Tryndamere that he most certainly can not milk those.","replies":[]},{"poster":"Starlight Knight","date":"2015-02-28T15:35:19.851+0000","up_votes":1,"down_votes":0,"body":"I'd scramble everyone's abilites! Ever see a Lissandra toss out a tornado? ({{champion:127}}  {{champion:157}} )\n\nEver think about  Annie tossin' out kegs left and right? ({{champion:1}} {{champion:79}} )\n\nEver imagine the all mighty Demacian Garen throwing sparkles at his enemies? ({{champion:86}}  {{champion:117}})\n\nI don't know but it'd be hysterical to see people playing their favorite champs only to has weird ability set ups.","replies":[]},{"poster":"Woodsy2575","date":"2015-02-17T03:28:04.349+0000","up_votes":1,"down_votes":0,"body":"Design a champion, I want to rival CertainlyT","replies":[]},{"poster":"BlackestJesus","date":"2015-02-13T03:25:24.306+0000","up_votes":1,"down_votes":0,"body":"I would honestly just pop into games and just play the game and prove that Rioters can be scrubs too.","replies":[]},{"poster":"the Marth","date":"2015-02-10T15:59:20.085+0000","up_votes":1,"down_votes":0,"body":"I would take suggestions for skin concepts and ***try*** to actually make them happen.","replies":[]},{"poster":"RogueWill","date":"2015-02-10T05:24:33.176+0000","up_votes":1,"down_votes":0,"body":"I would gift all the skins to another account. I love free goodies!","replies":[]},{"poster":"Purodyuusaa","date":"2015-02-09T02:30:27.402+0000","up_votes":1,"down_votes":0,"body":"I would do the responsible thing and challenge all my favorite Rioters to a game of poker.  I give a lot of them hell on occasion when things come out I don't agree with, but I also praise them when things happen that I like.  \n\nKateyKhaos, Frosthaven, IronStylus, Sweet, Penguin, Meddler, Tamat, and the rest of you.  I hope you know a Full House beats a Flush because I'm ready to own you.","replies":[{"poster":"BeatzBoyFTW","date":"2015-02-10T04:56:00.032+0000","up_votes":1,"down_votes":0,"body":"Hey, you didn't mention Phreak. After all the spotlights he gave you.... -_-","replies":[{"poster":"Purodyuusaa","date":"2015-02-10T05:08:12.430+0000","up_votes":1,"down_votes":0,"body":"That's why I said \"all the rest of you.\"\n\nBesides, he probably has that kind of luck where he gets a royal flush on the flop.","replies":[]}]}]},{"poster":"ExecutorDill","date":"2015-02-10T02:55:46.434+0000","up_votes":1,"down_votes":0,"body":"Learn everything I can from everyone ans persuade them to make an item and champ based of of me :3 Implement a game mode on a new map where players pick a handful of champs and are randomly switched to a different eveytime the die unti their are out, i'll call it \"Gamble Scramble\" Rework my favourite champ  Shen, who is one of the few champs I feel soul linked with, the other being mal but I find him very balanced. Win or Lose everything just seems right with Mal.","replies":[]},{"poster":"Puri Puri Taric","date":"2015-02-10T02:17:03.158+0000","up_votes":1,"down_votes":0,"body":"I would work on a taric rework 7 days straight (Hehe straight) and give him The polish he deserves\nThen when im done From The coffee induced workrage, i would present rito my 1 shtty drawing i made\n.... JK i would release The Best gem Knight rito has ever Seen.\nAnd i will play him all Night long shattering Faces and stomping goons.{{champion:44}}","replies":[]},{"poster":"Vantooth","date":"2015-02-09T03:08:49.958+0000","up_votes":1,"down_votes":0,"body":"If I was a rioter for a whole week... That would mean after 1 week I'm not anymore right?\nIn that case, I would read the hell out of all archive and on-going project, maybe leak some afterwards if I feel generous. But probably only hint to get some hype.","replies":[]},{"poster":"AranciaMechanics","date":"2015-02-08T09:53:28.110+0000","up_votes":1,"down_votes":0,"body":"Re-Estabilish some form of real control over reports, both in normal games and ranked ones, making it truly effective. \"Normal\" is not an excuse for ruining gaming experience to other people.\n\nBalance the actual jungle by re-estabilish a true diversity of pick (no more holy trinity Lee Sin/J4/Vi).\n\nGut Zed to the ground as he deserves it, in a way he will still be viable of course: I'm no scumbag balance team Rioter who favours a champ over others.\n\nI'll focus more on re-working/re-balancing old glories than focussing on getting new champs with 27 spammable gap closers, hard CCs, soft CCs, lifesteal, spell vamp, shields, steroids and executes, all in a new, satisfacting, brillant, LC$PROBIGPLAYZ kit.\n\nI'll make a game for the people who love and enjoy playing it, not just for a few bunch of teams who have to make money around it.","replies":[]},{"poster":"RavenHusky","date":"2015-02-08T09:51:23.322+0000","up_votes":1,"down_votes":0,"body":"I'd figure out what's keeping Lux's skin from coming out, and then move it to the top of the skin priority list.","replies":[]},{"poster":"Griefer","date":"2015-02-08T09:39:34.677+0000","up_votes":1,"down_votes":0,"body":"I would make Lee Sin's kit scales so hard he can one shot early game.\n\nBut I think we can all agree that Teemo is going to get deleted.","replies":[]},{"poster":"Klax002saur","date":"2015-02-08T06:54:11.472+0000","up_votes":1,"down_votes":0,"body":"Nerf lee sin and delete teemo. Basically remove the cancer killing league","replies":[]},{"poster":"RickyInFlow","date":"2015-02-08T06:28:29.578+0000","up_votes":1,"down_votes":0,"body":"I would make Ao Shin the next champion to be released due to his idea is very neat and wanted by many people.","replies":[]},{"poster":"UdoIkOSc4u","date":"2015-02-07T22:01:23.416+0000","up_votes":1,"down_votes":0,"body":"i would nerf lee cause no one at riot want do it","replies":[]},{"poster":"CupcakeTrap","date":"2015-02-07T19:45:35.367+0000","up_votes":1,"down_votes":0,"body":"I would wear a purple hoodie and call everyone Summoner until Narrative had me removed from the building. At which point I would shout, \"The Council will hear of this outrage! The Riotous Fists Clan has gone too far this time! BY THE MOTHERSHIP I SWEAR I SHALL HAVE SATISFACTION FOR THIS INSULT!\"\n\nIt would be a glorious forty-five minutes.\n\nAlternatively: I would print out lots of **[Kalista comics](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/M7Gzow4d-isnt-kalistas-passive-supposed-to-give-the-other-person-a-choice)** and tape them to the walls.","replies":[]},{"poster":"Rarrum","date":"2015-02-07T18:23:22.846+0000","up_votes":1,"down_votes":0,"body":"Put some color back into Ahri's skin.\n\nAt least in her icon.  You thought I was talking about something else?","replies":[]},{"poster":"injourn","date":"2015-02-07T17:17:37.384+0000","up_votes":1,"down_votes":0,"body":"I'd finally have friends. {{champion:32}}","replies":[]},{"poster":"Jay bone78","date":"2015-02-07T05:51:04.545+0000","up_votes":1,"down_votes":0,"body":"I would ban every person in my blacklist for a year and put myself in a queue with a 'fair' team consisting of players hand-picked for skill/ability. in the last year I have had a lot of trouble having fun with this game. Instead of playing just to play, I am constantly in matches where there is a zero percent chance to win and I want to have what I can not have and this causes frustration with my teammates and in turn it causes angry teammates which results in my being reported and a very long string of issues that lead up to my somber opinion if this game.","replies":[{"poster":"SecretAgentHulk","date":"2015-02-07T16:49:42.218+0000","up_votes":1,"down_votes":0,"body":"You know you can hand pick players already right? And form a team?","replies":[]}]}]}