{"poster":"Policia Federal","date":"2015-07-23T21:48:47.517+0000","title":"Bug en la salida de una partida y sin dejar entrar a otra","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"Lo que sucede es que yo termine una partida por surrender enemigo y cuando termino me fui al inicio y le di a saltar estad&iacute;sticas luego quise jugar a otra partida pero me dec&iacute;a que ya estaba en una partida sal&iacute; de el LoL y y volv&iacute; a entrar y segu&iacute;a diciendo lo mismo luego reinicie mi ordenador y en vez de decirme eso me salio que si quer&iacute;a volver a conectar a la partida que me pareci&oacute; algo extra&ntilde;o le di y se me queda la pantalla en negro todas las veces que le doy e reiniciado mi ordenador 2 veces y no se soluciona le pedir&iacute;a a alguien si sabe como se puede solucionar este problema","replies":[{"poster":"AfterAllThisTime","date":"2015-07-23T22:00:01.009+0000","up_votes":3,"down_votes":0,"body":"no puedo jugar mas ahora x ese problema","replies":[]},{"poster":"ReyArtas","date":"2015-07-23T21:58:03.491+0000","up_votes":3,"down_votes":0,"body":"tengo el mismo problema me aparece lo mismo","replies":[]},{"poster":"FAD Lord Zarox","date":"2015-07-23T21:51:54.549+0000","up_votes":3,"down_votes":0,"body":"Lo mismo me pasa a mi \nllevo como 40 min esperando respuesta","replies":[]},{"poster":"Gjerssem","date":"2015-07-23T22:13:46.626+0000","up_votes":2,"down_votes":0,"body":"Yo hace 2 horas que termine de jugar, y sigo poniendo reintentar, pero nada.","replies":[]},{"poster":"hunteraas","date":"2015-07-23T21:59:49.370+0000","up_votes":2,"down_votes":0,"body":"yo tambien, con un amigo llevamos esperando un largo rato esperando y no pasa nada","replies":[]},{"poster":"Niceshott","date":"2015-07-24T01:07:22.557+0000","up_votes":1,"down_votes":0,"body":"Lo unico que podemos hacer es esperar yo llevo esperando como 1 hora lei en un lugar que se arregla solo hay que esperar minimo 1 dia maximo 2 y si no se arregla en 2 dias habra que esperar a que Riot lo arregle sino riot TODOS NOSOTROS NOS VAMOS YO ME CARGE RP ESE MISMO DIO Y NO QUIERO GASTAR PLATA AL PEDO PORFAVOR RIOT NO NOS PODES HACER ESTO.","replies":[]},{"poster":"MonkeyDMatute","date":"2015-07-24T00:51:47.507+0000","up_votes":1,"down_votes":0,"body":"Malditooooooossssssss, no puedo jugar por lo mismo","replies":[]},{"poster":"LordBlacktyde","date":"2015-07-24T00:09:28.999+0000","up_votes":1,"down_votes":0,"body":"riot por favor solucionen el problema este con el tema de las estadisticas, me aparece que sigo en partida, no puedo jugar otra{{champion:32}}","replies":[]},{"poster":"King Bear","date":"2015-07-23T22:40:58.217+0000","up_votes":1,"down_votes":0,"body":"yo tambien tengo el mismo problema y para no crear un tema nuevo respondo aca, ayuda rioooot! no podemos jugar con nuestras cuentas y terminaron hace como 1 hora y no nos deja entrar debuelta.","replies":[]}]}