{"poster":"TehRackoon","date":"2019-04-28T21:51:57.994+0000","title":"Yuumi is Busted","subforum":"Gameplay","up_votes":1,"down_votes":1,"body":"Calling it now.  Total immunity (except towers) in laning phase while attached is busted.  I bet riot wont even put a mana cost on her attach. \n\nExpect Yuumi to be a unkillable and unfocusable support as she attaches over and over to allies as they die in the team fight making her the last target killed every time since reattach has no CD.\n\nAlso expect to never dodge her Q until they nerf the range on it. Cause it looks like its way to long from the trailer.\n\nHer attach will be reworked/adjusted within a month of release.\n\nHer carry ability in low elo will be garb due to the Yuumi surrendering her position skills to the adc who won't have a clue whats going on.\n\nCheck back in one month.","replies":[{"poster":"kuzzy47","date":"2019-04-29T00:03:14.665+0000","up_votes":3,"down_votes":0,"body":"She'll probably be op as shit in pro and for us 99,999999% useless af.","replies":[{"poster":"Doge2020","date":"2019-04-29T06:03:09.176+0000","up_votes":1,"down_votes":0,"body":"For more examples please see: {{champion:429}} {{champion:150}} {{champion:268}} {{champion:127}}","replies":[]}]},{"poster":"Galaxyburstz","date":"2019-04-28T22:46:05.107+0000","up_votes":2,"down_votes":0,"body":"Wait, is Yuumi on the PBE?","replies":[{"poster":"jocomotion","date":"2019-04-29T01:23:06.827+0000","up_votes":2,"down_votes":0,"body":"Nope. Welcome to the boards where people complain about literally everything,","replies":[{"poster":"Galaxyburstz","date":"2019-04-29T01:30:41.480+0000","up_votes":1,"down_votes":0,"body":"Ah, welcome to the boards lol","replies":[]}]},{"poster":"2Charmnot2Charm","date":"2019-04-29T03:17:33.040+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Galaxyburstz,realm=NA,application-id=3ErqAdtq,discussion-id=0KwabE5s,comment-id=0002,timestamp=2019-04-28T22:46:05.107+0000)\n>\n> Wait, is Yuumi on the PBE?\n\nShe will be this Tuesday, but there is gameplay footage from the Yuumi player's perspective out already.","replies":[]}]},{"poster":"Bot Bullet","date":"2019-05-06T21:50:12.678+0000","up_votes":1,"down_votes":0,"body":"her immunity isn`t that op as you would think. In laning, stand in your minion wave, and try to force her q, which will not hit, in that way you attack her mana forcing her to get out to use her passive, attack her hp if you can, while she is inside, attack the adc, since theres only 1 health bar, and she can`t aa. With proper fundamentals it isn`t that op. Abuse that she is squishy, abuse her mana and her passive.\nTeamfighting her q is a slow to tanks, but if you have good engage its not janna.","replies":[]},{"poster":"Done25","date":"2019-04-29T02:18:53.221+0000","up_votes":1,"down_votes":0,"body":"I can confirm that her W currently has no mana cost.","replies":[]},{"poster":"2Charmnot2Charm","date":"2019-04-28T22:26:33.080+0000","up_votes":1,"down_votes":0,"body":"I doubt it. \n\nHer hp level 1 is 433 lmfao. She will get blown up the moment she is CC'd in laning phase, and she will have to detach if she wants to get any shields from her passive for herself, or her W target when she reattaches.","replies":[]},{"poster":"SnupRawr","date":"2019-04-28T21:57:58.958+0000","up_votes":1,"down_votes":0,"body":"Its totally cool to call out things that are unbalanced. Its just that when riot takes over 4 months to listen to us its pathetic.","replies":[]},{"poster":"Illabethe","date":"2019-04-29T01:14:30.771+0000","up_votes":1,"down_votes":1,"body":"She will still take untargetted aoe damage, and cannot heal herself while attached.\n\nIn other words, like every other champ with Untargetable, skills like Amumu's, Alistar's, etc, will hit them both.","replies":[]}]}