{"poster":"JhinAndDrugs","date":"2018-05-29T20:20:28.827+0000","title":"Wann geht Fanliebe/Championliebe zu weit?","subforum":"Allgemeiner Chat","embed":{"description":"Kostenlos und anonym Bilder und Fotos hochladen ohne Anmeldung link speichern. Schnell, einfach und effizient! Kinderleichter free upload service zum Grafiken hosten lassen. Dateiformate jpg|jpeg|gif|png 100% Gratis Dienstleistung ohne Altersbeschraenkung","url":"http://www.123upload.de/image.php?id=38a50f72796ae2ff537926b45643babc","image":"http://www.123upload.de/image.php?id=38a50f72796ae2ff537926b45643babc&show=raw"},"up_votes":1,"down_votes":0,"body":"Ich habe mir vor einiger Zeit ein die Maske von Jhin t&auml;towieren lassen, weil dieser Champion mir einfach unendlich viel bedeutet. Ich spiele ihn seit dem Tag als er auf den PBE gekommen ist. Jeden Tag, damals mehrere Games am Tag. Habe ihn nach 3 Tagen auf Level 7 gespielt und ich kriege immer noch nicht genug von ihm. \r\nIch habe lange &uuml;berlegt ob ich ihn mir verewigen lasse, habe auch bedacht, dass ich in einigen Jahren vielleicht gar kein League mehr spielen werde, aber ich bin mir sicher, dass mir Jhin dann trotzdem noch so viel neideten wird wie heute. \r\nWas denkt ihr, wann geht Fanliebe/Championliebe zu weit? W&uuml;rdet ihr euch auch ein Tattoo eures absoluten Lieblingschamps stechen lassen?","replies":[{"poster":"Schroppel","date":"2018-06-13T02:26:51.784+0000","up_votes":2,"down_votes":0,"body":"Ich persöhnlich bevorzuge Narben. \nEin schöner Krallenabdruck von einem Bären auf der Brust, das wäre was.\nFrage ist nur ob der Bär von selbst aufhören würde mir Männertattoos zu stechen.\nIch bin sehr tierlieb und würde ihn nur ungern verprügeln müssen damit er aufhört.","replies":[]},{"poster":"Noxempire","date":"2018-05-30T11:26:06.950+0000","up_votes":2,"down_votes":0,"body":"Bin ich der einzige, der bei dem Titel als erstes an Hentai gedacht hat? xD","replies":[{"poster":"Mjölnir Kind","date":"2018-05-30T11:37:03.626+0000","up_votes":1,"down_votes":0,"body":"Ich dachte zuerst, er wolle ein Champion heiraten :D","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2018-05-29T20:59:23.722+0000","up_votes":2,"down_votes":0,"body":"Mein persönliches Lieblingsgespräch (auch wenn ich selber keine Tätowierungen habe, aber meine Schwester hat sich das komplette Meer auf ihre rechte Seite machen lassen... vom Grund bis zum Segelschiff...) ist ja:\nTatoo-Gegner: \"Im Alter, wenn deine Haut schrumpelig wird, sehen die bestimmt beschissen aus.\"\nTatoo-Träger: \"Wenn im Alter beschissen aussehende Tattoos mein größtes Problem ist, habe ich einen entspannten Lebensabend\"...\n\nIch sag das mal so: Andere tätowieren sich den Namen ihrer Liebsten und haben dann auf ein Mal ein Problem, wenn die wechselt... was halt vorkommt... Bei Jihn kannst du später wenigstens mal deinen Kindern erklären: \"Das Ding habe ich mir wegen des Spieles geholt, welches ich damals leidenschaftlich gezockt habe...\" Was immer noch besser ist als \"Papa, wer ist diese Chantal?\" Ok, Kids, let me tell you how I met your mother... starting with the women in my life before your Mother...\"\n\nIn einer traumhaften Welt machen dir deine 16 jährigen Kinder Vorwürfe, warum du dir diesen Kackchampion geholt hast, andere sind doch viel cooler...","replies":[]},{"poster":"SeaHorseCalamity","date":"2018-05-29T20:24:00.895+0000","up_votes":2,"down_votes":0,"body":"Wenn man so sieht, was sich Leute ales stechen lassen, dann sind Videospielcharaktere wohl noch in der besseren Hälfte der Möglichkeiten. Hau rein!","replies":[]},{"poster":"El Pingu","date":"2018-05-29T21:54:04.945+0000","up_votes":3,"down_votes":1,"body":"Auf Pingu ist zu wenig Platz für Mundo :/","replies":[{"poster":"JhinAndDrugs","date":"2018-05-30T06:31:56.626+0000","up_votes":1,"down_votes":0,"body":"Nawww tut mir leid :/","replies":[]}]},{"poster":"Asulia","date":"2018-05-30T06:25:08.330+0000","up_votes":2,"down_votes":1,"body":"Hack dich zu, von Kopf bis Fuß ;o)\n\nWas mir etwas aufstößt, ist die Qualität des Tätowierers.\nMein erster Gedanke war, beim Kumpel daheim.\nWarst du im Studio oder Privat?","replies":[{"poster":"JhinAndDrugs","date":"2018-05-30T06:33:01.876+0000","up_votes":1,"down_votes":0,"body":"Ich war im Studio auch in nem sehr guten Studio hab 6 Monate auf einen Termin gewartet. Es haben schon mehrere gesagt, dass die Qualität nicht so krass ist aber eigentlich sehe ich das anders :o","replies":[{"poster":"Asulia","date":"2018-05-30T07:14:11.188+0000","up_votes":1,"down_votes":0,"body":"Das ist die Hauptsache, dir muß es gefallen.\nIch darf da eh nichts sagen.\nWo Ich mit der Tätowiererei angefangen habe, galt das noch als asozial.\nNur Seefahrer und Knackis hatten da Tattoos.\nTattoostudio? \nPfff, mit Nadel und Faden ist mein erstes Tattoo gewesen, das hab Ich heut noch so im Original, ich mach ma foto, so grausam ist das^^.\nPunkt für Punkt sag Ich nur.\n\nDas mit der Frage zu später habe Ich da auch schon gehört, Ich hab auch immer gesagt, niemals werde Ich das bereuen.\n\nStimmt eigentlich auch, nur war Ich damals noch ein Unikat mit Statement. Heute hat fast jeder ein Tattoo und da stechen komischerweise die herraus, die nicht tätowiert sind.\n\nWie die Zeit sich dreht, lach^^\n\n","replies":[{"poster":"JhinAndDrugs","date":"2018-05-30T21:22:28.836+0000","up_votes":1,"down_votes":0,"body":"Krass würd ich voll gerne mal sehen :)","replies":[{"poster":"Asulia","date":"2018-05-31T11:25:05.749+0000","up_votes":1,"down_votes":0,"body":"https://www2.pic-upload.de/img/35407601/IMG-20180504-00541.jpg\nVoll peinlich, lach, aber da war ich 13 ^^\n\nFinger und Hals sollten aber sauber bleiben, bei aller Liebe^^\nFinger hab Ich mir Lasern lassen, das war sauschmerzhaft.\nHab teilweise immer noch Pigmente drin, bin dann nimmer hin, lol^^","replies":[]}]}]}]}]},{"poster":"Zingiber","date":"2018-06-06T01:31:50.805+0000","up_votes":1,"down_votes":0,"body":"Als jemand mit vielen Tattoos denke ich, das jeder sich (sofern er will) das stechen lassen sollte was ihm gefällt. Man erzählt mit seinen Tattoos halt doch immer eine Geschichte.\nUnd wie eine Freundin so schön zu dem Thema \"Tattoos im Alter\" sagte: \"Es gibt die Menschen die später im Schaukelstuhl ihr Fotoalbum zeigen und Geschichten erzählen, ich hab die Geschichte meines Lebens auf der Haut!\" Und abgesehen davon, gehört junge und schöne Haut genauso zum Leben. Wenn man immer nur an das Alter denkt können wir auch gleich aufhören unsere Jugend zu genießen^^\nAllerdings muss ich auch sagen, die Qualität von dem Tattoo lässt arg zu wünschen übrig Oo Aber solange es dir gefällt und du Freude damit hast ist alles in bester Ordnung ^-^","replies":[]},{"poster":"Canis858","date":"2018-05-30T17:27:43.518+0000","up_votes":1,"down_votes":0,"body":"Ich sage dazu nur eines:\nDie armen Annie-Mains! :)","replies":[]},{"poster":"RainerKilltKeina","date":"2018-05-30T11:10:15.459+0000","up_votes":1,"down_votes":0,"body":"Großvater, was hast du da für ein Bild?\nAch das mein Junge, dass stammt noch aus der Zeit, wo Millionen von Menschen noch mit Tastatur und maus an einem Bildschirm gegeneinander gespielt haben. Riot, die das Spiel vertrieben hat, übernahm im Jahre 2025 die Weltherrschaft und wir sind nun die Minions in der Kluft der Beschwörer :`(","replies":[{"poster":"Mjölnir Kind","date":"2018-05-30T11:39:20.285+0000","up_votes":1,"down_votes":0,"body":"xD I like that one\nEin Job als Minion also :D?","replies":[{"poster":"RainerKilltKeina","date":"2018-05-30T11:40:33.507+0000","up_votes":1,"down_votes":0,"body":"Ja... \nnennen wir es Job.","replies":[{"poster":"Mjölnir Kind","date":"2018-05-30T11:41:33.417+0000","up_votes":1,"down_votes":0,"body":"Oder halt Zwangsarbeit..\nIST DOCH ALLES DAS GLEICHE","replies":[{"poster":"RainerKilltKeina","date":"2018-05-30T11:43:45.422+0000","up_votes":1,"down_votes":0,"body":"Karawane des Todes wird sie auch genannt.","replies":[{"poster":"Mjölnir Kind","date":"2018-05-30T11:45:17.879+0000","up_votes":1,"down_votes":0,"body":"Wann wird man dann zum Cannonminion bzw. Super-Minion befördert?\nWie oft muss man dafür die Mitte runterlaufen?","replies":[{"poster":"RainerKilltKeina","date":"2018-05-30T11:48:16.149+0000","up_votes":1,"down_votes":0,"body":"Wenn man es schafft, zwei gegnerische minions zu Töten, dann wird man als Canon wiedergeboren,\nwenn man jedoch einen Champion Tötet, dann wird man als strahlender Held wiedergeboren und darf als Supervasall wieder gen Ruhm und Ehre ziehen.","replies":[{"poster":"Mjölnir Kind","date":"2018-05-30T11:49:01.071+0000","up_votes":1,"down_votes":0,"body":"Und beim Tower D: ?","replies":[{"poster":"RainerKilltKeina","date":"2018-05-30T11:52:37.304+0000","up_votes":1,"down_votes":0,"body":"Wenn man den letzten Hit auf einen Tower gibt, darf man gleich nochmal in Richtung gegnerischen Nexus ziehen = ohne Beförderung.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Dr Madscientist","date":"2018-05-29T20:23:01.071+0000","up_votes":1,"down_votes":1,"body":"Immer dann, wenn sie Teemo betrifft.\nTeemo mögen ist zuviel.\nAch, was rede ich: Teemos existenz auch nur dulden ist schon zu viel.","replies":[{"poster":"RainerKilltKeina","date":"2018-05-30T11:35:04.875+0000","up_votes":1,"down_votes":0,"body":"*Rainer teebeutelt während er mit teuflischem Lachen alle Teemo Skins kauft*\nHuahaha","replies":[]}]},{"poster":"Megamaexx","date":"2018-05-30T07:49:36.378+0000","up_votes":1,"down_votes":0,"body":"Hab gestern eine gesehen, die sich fast komplett mit Pokémon zutätowiert hat. Viele machen sich eben ein Tattoo davon, was sie mögen. Warum solltest du das anders handhaben?^^","replies":[]},{"poster":"Necromant","date":"2018-05-30T06:36:44.567+0000","up_votes":1,"down_votes":0,"body":"Die Maske ist schon ok bzw. das Tattoo aber ich würde es nicht weiter machen :) Weil wie du schon erwähntest, spielst du in den kommenden Jahren evtl. kein LOL mehr und naja was mit Tattoos dann im Alter passiert, weißt du auch :D","replies":[]},{"poster":"e621 Rengar","date":"2018-05-30T00:40:43.825+0000","up_votes":1,"down_votes":0,"body":"Naja bei der Maske wissen ja nur LoL Spieler  das es wirklich Jhin ist :D\nAndere denken da eher  ist irgend ne Maske.\nIch finds gut :D\n\nNur die Patrone (ist doch ne Patrone oder nicht ^^? )  hätt ich vergelassen :D  aber das ist deine entscheidung","replies":[{"poster":"JhinAndDrugs","date":"2018-05-30T06:33:57.460+0000","up_votes":1,"down_votes":0,"body":"Ja die Patrone haben wir später noch draufgeklatscht weil ich fand das nur die Maske so nackt aussieht :D","replies":[]}]},{"poster":"Marofion","date":"2018-05-29T23:31:29.673+0000","up_votes":1,"down_votes":0,"body":"Also nen Champion oder so würde ich mir auch nicht tatoovieren lassen, ein Logo eines Spieles hingegen schon (Die Schläfermaske von Gothic). \nIch persönlich bin der Meinung: Mach mit deinem Körper was du willst, welches Recht habe ich darüber zu urteilen, wie du dir deinen Körper schmückst? Ich habe das Recht es nicht schön zu finden, tu ich unter umständen eventuell auch nicht, aber dennoch ist das Motiv eines Tatoos doch dir überlassen.","replies":[]},{"poster":"Untouchable ProX","date":"2018-05-29T20:28:26.676+0000","up_votes":1,"down_votes":0,"body":"Ganz ehrlich - es gibt kein zu weit bei Tattoos.\n\nWenn ich sehe was sich Menschen sonst so stechen lassen ... sei froh das du Jhin hast! :P\nIch finde, wenn du es schön findest und es dir was bedeutet - wieso nicht?\n\nAuch wissen viele nicht Zocker damit nichts anzufangen und interpretieren dort vll nur eine ästhetisch ansprechende Gestalt.\n\nUnd zum Schluss eine kleine Anekdote:\nEine Freundin stand mit 16 total auf Hello kitty - Bei Gott - nichts und wirklich nichts sieht so schlimm aus wie eine 50 x 50 cm Hello Kitty auf den Rücken :D\n\nAb da schaute ich sie nur noch von vorn an... half aber trotzdem nicht^^","replies":[]}]}