{"poster":"Chewi90","date":"2020-01-04T00:35:41.439+0000","title":"Illaoi/Kled","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":3,"body":"In welcher Welt ist Illaoi oder Kled balanced?\r\nWenn du den Champ spielen kannst stompst du JEDE Toplane. Random Tentacle, unsichtbarer Shit klatscht dir von allen Seiten in die Fresse. Was soll das?\r\nKled mit seinem Remount.. Im ernst.. Dann hast du den endlich von seinem Gaul unten, dann hat er seine W und hat einen Instant Remount und alle CD'S back und sein Gaul hat auch wieder volles Leben.. \r\n\r\nRITO PLS\r\n\r\nWie soll man gegen sowas spielen ?","replies":[{"poster":"Zavolta","date":"2020-01-04T05:46:50.881+0000","up_votes":2,"down_votes":0,"body":"Spiel die Helden doch mal selber... dann siehst du zum einen, dass diese keine unaufhaltbaren Dampframmen sind, sondern regelmäßig von Gegnern zerlegt werden... da es aber immer Helden gibt, die von anderen total ausgekontert werden... ist es dann natürlich dumm, wenn man in der Heldenauswahl - wenn man schon sieht, dass der Gegenüber Illaoi oder Kled hat - ein \"Opfer\" der beiden nimmt. Oder man bannt seinen Hass-Gegner in der Auswahl, auch eine Möglichkeit.","replies":[{"poster":"Zavolta","date":"2020-01-04T06:47:20.447+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Zavolta,realm=EUW,application-id=YnZkMR0R,discussion-id=w4G20Mlo,comment-id=0002,timestamp=2020-01-04T05:46:50.881+0000)\n>\n> Spiel die Helden doch mal selber... dann siehst du zum einen, dass diese keine unaufhaltbaren Dampframmen sind, sondern regelmäßig von Gegnern zerlegt werden... da es aber immer Helden gibt, die von anderen total ausgekontert werden... ist es dann natürlich dumm, wenn man in der Heldenauswahl - wenn man schon sieht, dass der Gegenüber Illaoi oder Kled hat - ein \"Opfer\" der beiden nimmt. Oder man bannt seinen Hass-Gegner in der Auswahl, auch eine Möglichkeit.\n\nNochwas: mir fällt immer wieder auf, dass die Leute nach Illaois Ulti in der Ulti stehen bleiben und in den Nahkampf gehen/bleiben, so als ob die Tentakel keinen Schaden machen und Illaoi sich nicht hochheilen würde...","replies":[]}]},{"poster":"Crοnοs","date":"2020-01-07T12:06:48.212+0000","up_votes":1,"down_votes":0,"body":"Spiel {{champion:82}} gegen {{champion:420}} \n\nund {{champion:24}}  gegen {{champion:240}} \n\n\nViel Spass mit der Freeelo\n{{sticker:poppy-wink}} ","replies":[]},{"poster":"Megamaexx","date":"2020-01-04T12:40:31.780+0000","up_votes":1,"down_votes":0,"body":"Die Tentakel sind immer sichtbar und klatschen auch nicht random auf dich nieder. Sie ist enorm nervig, dafür aber auch recht stationär, so wie Heimer seine Turrets braucht, braucht Illaoi Tentakel. Sie wird versuchen, gegen sich zu kämpfen, vermeide Kämpfe in ihren Tentakeln. Oder weiche gut aus. Stehenbleiben wird schlecht für dich sein.\n\nKled ist recht anfällig für Poke. Auch kleinere Trades mag er nicht so gern, seine 4 Autoattacks seiner W will er schon durchbringen, die sind auch effizient. Wenn du die überstehst, kannst du ihn danach aber noch weiter bekämpfen. Wenn er gerade nicht auf Skaarl sitzt, achte auf die Leiste unter seinem Leben, das sagt dir, wann Skaarl wieder da ist. Das lädt sich aber durch Championtreffer wieder auf, wenn er seine W up hat, wird er also im 1v1 schnell wieder aufsitzen. Warte, bis er ein Minion macht und die W dadurch auslöst und dann wird er nicht so schnell wieder aufsitzen dürfen. In der Regel wird Kled das dann aber auch nicht wirklich versuchen und seine Shotgun zum Distanz bewahren nutzen.","replies":[{"poster":"Veezey","date":"2020-01-04T15:07:25.584+0000","up_votes":1,"down_votes":0,"body":"Manchmal sieht man die Hits wirklich nicht bzw erst, wenn die Tentakeln zugeschlagen haben. Keine Ahnung woran das liegt.","replies":[{"poster":"Alekra","date":"2020-01-04T15:23:51.392+0000","up_votes":1,"down_votes":0,"body":"Das liegt daran, dass die Ult die Hotboxen verschwinden lässt. {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Veezey","date":"2020-01-04T15:42:37.910+0000","up_votes":1,"down_votes":0,"body":"Nein ich meine ohne die Ult. Das passiert, wenn man von der E getroffen wurde und außerhalb der Reichweite läuft. Dann spawnen die Tentakeln und dann kan man auch immer schön die Hitboxen sehen und weiß wann sie zuschlagen. Aber manchmal spawnen sie und schlagen instant zu.","replies":[]}]}]}]},{"poster":"Cenâreth","date":"2020-01-04T07:43:34.721+0000","up_votes":1,"down_votes":0,"body":"Wir haben eine Bruiser Meta was erwartest du aktuell?","replies":[{"poster":"Alekra","date":"2020-01-04T15:37:34.962+0000","up_votes":1,"down_votes":0,"body":"Aatrox: 44.19%\n\nDarius: 50.06%\n\nFiora: 49.58%\n\nGaren: 53.28%\n\nGnar: 48.38%\n\nIrelia: 45.88%\n\nJax: 48.65%\n\nJayce: 45.72%\n\nMordekaiser: 52.67%\n\nOlaf: 52.03%\n\nPantheon: 46.13%\n\nRenekton: 49.64%\n\nRiven: 46.73%\n\nRumble: 47.43%\n\nSion: 50.55%\n\nTrundle: 51.34%\n\nTryndamere: 47.85%\n\nWukong: 47.05%\n\nXin Zhao: 50.77%\n\nYorick:  52.33%\n\nOb du jetzt manche von diesen Champs nicht als Bruiser siehst oder nicht, wir haben vor allem mit vielen Mages und manchen ADCs die gut Top gespielt werden können (Ryze, Cassio, Lucian, Vayne; etc..), definitiv keiner Bruiser Meta. Vor allem deswegen weil der Focus gerade sehr auf der Bot- /Midlane und den Drakes liegt.\n\nIch würd sogar soweit gehen um zu sagen, dass mit den vergangenen Nerfs von Conqueror und dem Buff für Aftershock sich so langsam wieder eine Tankmeta anbahnen könnte.\n\n{{sticker:slayer-jinx-catface}} ","replies":[]}]},{"poster":"611FVNKBlv","date":"2020-01-04T06:53:29.615+0000","up_votes":1,"down_votes":2,"body":"Stimmt du hast recht . Wann wird Illaoi endlich mal gebufft? die ist seit 2 jahren oder so F-Tier und wird weniger gespielt als azir LUL","replies":[{"poster":"Allerbester Biss","date":"2020-01-04T12:28:52.183+0000","up_votes":1,"down_votes":0,"body":"Umm überleg nochmal :D","replies":[]},{"poster":"Enderized","date":"2020-01-04T06:56:27.193+0000","up_votes":1,"down_votes":0,"body":"Reden wir von der gleichen Illaoi?","replies":[]}]},{"poster":"Eroticat Nimar","date":"2020-01-04T04:05:31.811+0000","up_votes":1,"down_votes":0,"body":"Kled in der Miniform erst melee fighten wenn sein W auf CD ist.\n\nHat nen hohen cooldown und man merkt sehr gut wann es aktiviert wurde, dann kann man sich distanzieren und anschließend drauf hauen.\n\nIm ranged Matchup kann man einfach weiter draufhauen.","replies":[]},{"poster":"Reaz83","date":"2020-01-04T00:50:16.517+0000","up_votes":1,"down_votes":0,"body":"Gegen illaoi ist ryze / morde / teemo / darius / tryndamere ganz gut \n\nKled hat auch seine counter aber habe ich noch nicht so oft gespielt deswegen kann ich dir keine nennen","replies":[]}]}