{"poster":"Chewi90","date":"2019-11-20T01:24:48.694+0000","title":"Wie wird das bestraft?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi Leute,\n\naus dem nichts kam ein solcher Spieler. \nIst das ein permabann ?\nRennt die mitte runter, flamed hart etc.\n\nEr hat seinem Champ wohl alle Ehre gemacht.\n\nLG\n\nhttps://www.bilder-upload.eu/bild-d35321-1574212982.png.html","replies":[{"poster":"Chewi90","date":"2019-11-20T21:21:11.203+0000","up_votes":1,"down_votes":0,"body":"Hey Chewi90! XY hier.\n\nErstmal tut es mir echt Leid zu hören, dass du einen solchen Spieler im Team hattest! Ich habe ihn nur für alle Fälle nochmal überprüft.\n\nNormalerweise bauen sich die Strafen aufeinander auf und verstärken sich in Heftigkeit in folgender Reihenfolge: Chat-Sperre -> Chat-Sperre -> 2-wöchiger Bann -> Permanente Sperre. Es besteht auch eine 0-Toleranz-Politik gegen homophobische und rassistische Beleidigungen und auch gegen solche, die auf psychischer Gesundheit oder Selbstmord bezogen sind. Spieler, die solche Beleidigungen benutzen werden direkt mit 2-wöchigen Sperren bestraft. \"Get aids\" und \"kys\" zählen dazu und werden direkt mit einer 2-wöchigen Sperre bestraft.\n\nDiese Themen sind echt ernsthaft und alle Spieler, die gegen diese 0-Toleranz-Politik verstoßen, werden bestraft. Melde solche Spieler immer nach dem Spiel oder hier im Ticket!\n\nHoffentlich habe ich auf deine Frage eingehen können!\n\nLass es mich bitte wissen, falls ich weiterhelfen könnte!","replies":[]},{"poster":"Unlucky Black T","date":"2019-11-20T09:35:06.122+0000","up_votes":1,"down_votes":0,"body":"Aus eigener Erfahrung:\nNichts wird passieren.\n\nWenn du es dem Support zukommen lässt und sich ein Mitarbeiter direkt drum kümmert kann ich nicht beurteilen.\nAus dem InGame System heraus passiert nix.","replies":[{"poster":"You Got My Name","date":"2019-11-20T10:20:39.849+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CoolioNRW,realm=EUW,application-id=7hciEY9w,discussion-id=EvsLzfhd,comment-id=0003,timestamp=2019-11-20T09:35:06.122+0000)\n>\n> Aus eigener Erfahrung:\n> Nichts wird passieren.\n> \n> Wenn du es dem Support zukommen lässt und sich ein Mitarbeiter direkt drum kümmert kann ich nicht beurteilen.\n> Aus dem InGame System heraus passiert nix.\n\nKlar... Wörter wie kys etc sind auf der Blacklist ganz weit oben und werden meinst hart bestraft und auch erkannt vom System.","replies":[{"poster":"Yuiwara","date":"2019-11-20T13:53:06.535+0000","up_votes":1,"down_votes":0,"body":"hab auch mal wen gemeldet, weil er mir tod wünschte und denke der wurde gebannt, weil recht zeitnah danach ne systemmeldung kam. hab mich aber direkt an support gewandt, also ka ob das system in der richtung wirklich durchgreift. bei solchen fällen einfach auf nummer sicher gehen und support anschreiben.","replies":[]}]}]},{"poster":"Yuiwara","date":"2019-11-20T13:49:17.474+0000","up_votes":1,"down_votes":0,"body":"18 deaths in 15 minuten + Hassrede\n\n14+14 tage bann. je nach extreme mit glück vllt sogar direkt perma. Schreib dem Support direkt und fordere einen menschen an.","replies":[]},{"poster":"Amycos Cyrus","date":"2019-11-20T10:06:21.123+0000","up_votes":1,"down_votes":0,"body":"Durch die Eindeutigkeit der Chatinhalte kann man mit dem 14-Tag-Bann rechnen.","replies":[]},{"poster":"Angel Ayume","date":"2019-11-20T08:46:15.328+0000","up_votes":1,"down_votes":0,"body":"Ich würd den Fall tatsächlich dem Support per Ticket melden für den Fall, dass das System es nicht erkennt. \n\nWie Megamaexx schon sagte, die Erkennung bei Inting ist leider nicht so gut. Was allerdings auch seine Gründe hat. :/","replies":[]},{"poster":"Superbahamut","date":"2019-11-20T08:32:43.135+0000","up_votes":1,"down_votes":0,"body":"Ich geh mal anhand deines post davon aus, dass das im chat der twitch ist.\nObs für ein perma reicht ka. Aber mind 14, wenn nicht sogar 28\nJe 14 für hatespeech und inten","replies":[]},{"poster":"Megamaexx","date":"2019-11-20T07:02:22.283+0000","up_votes":1,"down_votes":0,"body":"Bei Erstvergehen gibt's nen 14-Tage-Bann, beim zweiten mal Permabann. Die Strafstufen sind recht hart, aber die Erkennung ist mangelhaft.","replies":[]}]}