{"poster":"ifuifuwrafncydrs","date":"2017-09-15T00:28:34.838+0000","title":"Was war die längste Niederlagen-Serie, die Ihr durchlebt habt? (LOL-Quit inside) (LOL@LOL)","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":5,"body":"Jo, die Frage steht in der Headline.\n\nIm Normallfall gewinne ich rund 45% meiner Matches als Jungler - bis gestern war die Tendenz steigend.\nSamplesize über 200-400 Matches. Bis gestern warens, wenn wir nur 20 Matches anschauen sogar über 60%.\n\nNachdem ich gestern allerdings in die 4. Liga aufstieg, lief nichts mehr.\n\n5 Niederlagen in Liga 4, bei denen ich haupts&auml;chlich mit Liga5-Spielern im Team war, besiegelten meinen Abstieg.\n\nIn Liga 5 gings bis gerade so weiter. \n\n#**Aktuell stehe ich bei 10 beschissenen Niederlagen in Folge**. So viele hatte ich noch nie.\n\n\nUnd ich bef&uuml;rchte, dass es so weitergeht.\n\nImmer ist irgendwas:\n- Mal sind die Spieler nach n paar Mal defeated werden eingeschnappt und leaven das Match.\n- Mal verlassen sie einfach ihre Lane, weil der Gegner zu stark ist, ohne Support oder ne Rotation zu requesten.\n- Mal machen se einfach nur braindead-Moves\n- Mal sind wir auch einfach zu schwach\n- Mal suchen se sich irgendeinen Champ und im Spiel meinen se, dann, dass sie ne andere Lane spielen wollen^^\n- oder sie ragen und wollen andere für die eigenen Fehler runtermachen, um sich besser zu fühlen und die Leute, die dann beklingelt werden, haben dann keinen Bock mehr\n- oder so ne Kinderkacke wie sich beim Supporter beschweren, dass er oder sie doch keine Vasallen töten soll - selbst, wenn man meilenweit vom Tower in der Basis entfernt ist.\n- Mal rennen se wie Hühner durch die Gegend\n- Mal ignorieren sie Signs und rennen genau in die andere Richtung\n- mal rennen die Spinner weg während ich ihnen das scheiß Schild gebe anstatt genau dann nachzusetzen\n- mal rennen se weg, weil se einem den Kill nicht gönnen.\n\nIch will mich da spieltechnisch selbst nicht rausnehmen. Mache auch hier und da keine optimalen Moves oder kaufe ungünstige Setups zusammen. \nEs Ist ein Team-Game. \n\nAber ich brauch Leute im Match, die wissen was sie tun, wann sie es tun, wie sie es tun. Nicht alle, aber die Mehrheit.\nDann kann ich gut zuspielen, Leute protecten, Lanes pushen, Leute attackieren. \n\nKommen, killen/supporten und wieder abzischen. Ninjastyle eben.\n\nAber mit 0Brainern geht das nicht.\n\n#10 Schei&szlig; verfickte Mal. \n\nIch quitte das Spiel. Keinen Bock mehr. Arschlecken. Da kann ich mir in der Zeit auch einen fappen oder was anderes machen. Aufräumen, irgendwas Lernen, Training, Rausgehen.\n\nScheiß Spiel. \n\nHauptsache, ich finde mal ne Freundin, die auf das Spiel steht und die passenden Kostüme im Schrank hat XDDDDDDDDD\n#readmyname","replies":[{"poster":"Time2Whine","date":"2017-09-15T06:40:45.701+0000","up_votes":2,"down_votes":0,"body":"Als ich mir deine Matchhistory angeschaut habe sah ich genau so aus {{sticker:zombie-brand-mindblown}} \n\nIch weiß gar nicht wo ich bei dir anfangen soll......aber Full AD Shen Jungle mit Ghost ist .....nun...ja....sehr speziell. Ich habe kein Problem mit Off Meta Picks, aber wenn man einen Champion fast 300 Spiele spielt und dabei eine 45 % Winrate solltest du schleunigst einsehen, dass du etwas an deinem Spiel ändern solltest!\n\nDu kannst doch nicht ernsthaft dein Team blamen, wenn du trotz viel Erfahrung auf dem Champion grottenschlecht auf dem bist. Deine KDA ist bei einer offensiven Spielweise schlecht und von deinem Damage will ich gar nicht erst reden! Du hast in den letzten Spielen mit Abstand am wenigsten Schaden gemacht obwohl du auf Full Dmg gehst! Selbst ein Blitzcrank oder Leona ohne Damage Items hat mehr Schaden gemacht als du! Was machst du eigentlich auf der Map? Dein Farm ist grauenhaft und deine Runenauswahl (Lethality ? Warum?) ist ebenfalls käse.\n\nDeine Teammates befinden sich auf deinem Spielniveau, das heißt dass du einer dieser \"0Brainer\" ist, denn deine ganze Spielweise ist vieles aber nicht so gut, wie es deinen Augen aussieht.\n\nSorry dass ich hier so herablassend rede aber anscheinend hast du ein komplett falsches Bild von dir und deinen Spielleistungen! Du bist aktuell sehr gut in Bronze 5 aufgehoben, denn so spielst du auch. Hör auf dich über deine Teammates und deine Losingstreak aufzuregen, die ja nur von deinen Mitspielern verursacht wird. Dass du selbst aber ein Großteil des Problems bist solltest du jedoch schleunigst erkennen, denn sonst kommst du aus deinem Loch nicht mehr so schnell heraus.","replies":[]},{"poster":"Mikele","date":"2017-09-15T00:57:46.514+0000","up_votes":2,"down_votes":0,"body":"xD","replies":[{"poster":"Mikele","date":"2017-09-15T00:59:19.410+0000","up_votes":1,"down_votes":0,"body":"Liga 4 / Danke Diggi, da hat ich zur später Stunde noch was zu schmuntzeln :)","replies":[]}]},{"poster":"Leylania","date":"2017-09-15T00:48:03.885+0000","up_votes":2,"down_votes":0,"body":"Haha ich glaub das ist der klassischste low bronze Post den ich seit langem gesehen hab. Blamed die Teammates und liefert dann so ne Matchhistory ab xD http://euw.op.gg/summoner/userName=ifuifuwrafncydrs","replies":[]},{"poster":"Webturnier","date":"2017-09-15T17:34:49.365+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Angel Ayume","date":"2017-09-15T17:03:20.857+0000","up_votes":1,"down_votes":0,"body":"20 Niederlagen in Folge","replies":[]},{"poster":"ELOW Cronos","date":"2017-09-15T09:18:02.594+0000","up_votes":1,"down_votes":0,"body":"18 Niederlagen in Folge, hat meine Winrate von 65% auf 49% runtergeballert. 2 Monaten Ranked Pause hat mir da rausgeholfen und mich mehrere Divisionen climben lassen. Meine längste Winnig Spree waren übrigens 12 Games ^.^","replies":[]},{"poster":"Sylvánas","date":"2017-09-15T08:21:16.372+0000","up_votes":1,"down_votes":0,"body":"Haben ja alle schon was dazu gesagt...\n\nMeine war 8. Das war genau nachdem ich Gold 5 geworden bin. Keine Ahnung was da falsch gelaufen war - meistens wars aber einfach die Teamcomb, die vom Gegner einfach besser war als die eigene","replies":[]},{"poster":"Humpelstilzche","date":"2017-09-15T07:49:56.895+0000","up_votes":1,"down_votes":0,"body":"Woher deine ganzen Niederlagen kommen, haben die anderen dir ja schon in deutlichen Worten erklärt. Dem hab ich nichts hinzuzufügen. \n\nAber ich kann deine Frage beanworten: 13. Ja, richtig, 13 Niederlagen in Folge sind mein Rekord. Im Ranked. Ohne speziellen Grund. Ich hab nicht getiltet (die Spiele waren zeitlich nicht alle direkt nacheinander), meine Teammates waren so wie immer, ich selbst habe meine üblichen Fehler gemacht, alles ganz normal. Nur halt eben einfach wahnsinnig Pech gehabt. Shit happens.","replies":[]}]}