{"poster":"MadLifeJunior","date":"2014-11-25T04:50:09.619+0000","title":"Champion Leak","subforum":"Player Creations","up_votes":2,"down_votes":1,"body":"I'm not usually one to speculate but I have a pretty good feeling about this one.\r\n\r\nEbirah, the Terror of the Deep\r\nhttp://leagueoflegends.wikia.com/wiki/User_blog:SpartanJ014/Ebirah,_the_Terror_of_the_Deep\r\n\"They say she hunts those that run, and kills those that fight.\"\r\n\r\nHappy speculating,\r\nlols =)","replies":[{"poster":"MadLifeJunior","date":"2014-11-25T22:21:47.862+0000","up_votes":1,"down_votes":0,"body":"Looks like some massive remodelling has been done. But Ebirah sounds like the original draft for the champion. \nhttp://na.leagueoflegends.com/en/champion-reveal/reksai-the-void-burrower","replies":[]},{"poster":"GoldenTomat0","date":"2014-11-25T05:38:14.199+0000","up_votes":1,"down_votes":1,"body":"honestly seems so bad from that leak.\nthe passive vaynes but worse\nthe q seems really strong, like talons q but stronger.\nthe w is a mix between fiora's and trynds q. sure it gives more ad but below 15% hp, unless you're building tanky you're not gonna have that long to use it.\nthe e is also jinx's q but worse.\nult is just a mix between noc, vi and xin ult.","replies":[{"poster":"SkarSkarSkarner","date":"2014-11-25T05:46:09.018+0000","up_votes":1,"down_votes":0,"body":"The kit will probably be a lot different when she enters PBE.","replies":[]}]},{"poster":"SkarSkarSkarner","date":"2014-11-25T05:02:54.156+0000","up_votes":1,"down_votes":0,"body":"If that is it, looks like the champ was originally male because it says \"his claws\" in the Q ability description.","replies":[{"poster":"MadLifeJunior","date":"2014-11-25T05:24:39.850+0000","up_votes":1,"down_votes":0,"body":"> If that is it, looks like the champ was originally male because it says \"his claws\" in the Q ability description.\n\nRemember that this wiki was last updated in May. The champion development team has probably done extensive modifications. In addition this is unverified. Just speculation.","replies":[{"poster":"SkarSkarSkarner","date":"2014-11-25T05:35:23.917+0000","up_votes":1,"down_votes":0,"body":"Yeah. Champs change a lot though in production because they're worked on for a long time. For an example, Braum was originally female.\n\n> Gameplay, lore and art are the pillars of how we approach making a champion. The initial idea can be any of the above - someone's got an image they'd like to draw, a story they'd like to tell or an ability they'd like to play with. Working from that starting point we then explore what the rest of the champion might look like and what opportunities there are to offer something new. Braum for example started off as a female Piltover engineer, with a giant mechanical shield. We tested a kit for that initial idea in game and hit on some abilities we really liked (similar to Braum's current passive and E), the art and personality weren't coming together however. We consequently took another look at who such a kit could fit on and, after a fair bit of exploration of different possible personalities and origin factions hit on Braum.\n\n(Quote by Meddler http://boards.na.leagueoflegends.com/en/c/champions-skins/niH3APAB-meddler-qa)","replies":[]}]}]},{"poster":"BarryButcher","date":"2014-11-25T05:08:50.840+0000","up_votes":1,"down_votes":0,"body":"Looks like she'd make a fairly decent Jungler. Very Warwick-esque with those abilities. A targeted CC/Nuke Ult and a \"bloodscent\" passive.\n\nW seems cool. Kinda like Olaf, will be able to bait people into thinking they can finish you off and you melt them.\nThe E seems pretty awful. Bad version of Volibear W.","replies":[]},{"poster":"73514","date":"2014-11-25T04:59:09.307+0000","up_votes":1,"down_votes":0,"body":"Dem claws (terrible pics incoming xD)\n\nhttp://i.imgur.com/X918jzo.png\n\nhttp://i.imgur.com/JQKsS2Z.png","replies":[]}]}