{"poster":"Rexxi","date":"2015-03-20T22:23:38.737+0000","title":"Come counterarli.","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Volevo chiedervi qualche consiglio su come counterare questi tre champion:sejuani,annie e lissandra.Ogni volta che me li trovo contro fanno i macelli...e non vedo mai nessuno che riesce a batterli in lane(riferito ad annie e lissandra).Sejuani è un tank molto forte ma fa anche dei danni elevati nonostante poco ap...Annie invece ogni volta che la vedo vince la lane in modo ridicolo e poi oneshoota praticamente un nemico ogni 3 secondi.....se prendi un assassino ti può battere lo stesso,se prendi un mago ti batte in late comunque perchè ha sempre un po più di vita.Poi c'è lissandra...non imbattibile in lane ma in late è micidiale.Non riesci a focussarla(se ulta se stessa e usa lo zhonya) e perdipiù puoi ingaggiare molto facilmente e fare fuori o l'adc o l'ap carry nemico.Eppure riesce a fare molti danni anche se le compri alcuni oggetti per la salute.Non so come fare a counterarli :( ,forse sono molto forti al momento o  forse sono tutti bravi a usarli....e chi lo sa.","replies":[{"poster":"IrrationalNumber","date":"2015-03-22T17:15:17.720+0000","up_votes":2,"down_votes":0,"body":"Tre champions che non sono praticamente mai cambiati dalla loro uscita/rework di almeno due anni\n\nE ora la gente piange\n\nBoh\n\nvi auguro il bronzo","replies":[]},{"poster":"Player A","date":"2015-03-22T16:52:50.387+0000","up_votes":1,"down_votes":0,"body":"usa lissandra contro annie o annie contro lissandra così vedi che uno lo riesci a battere","replies":[]},{"poster":"Firenheit","date":"2015-03-20T22:36:01.953+0000","up_votes":1,"down_votes":0,"body":"Annie devi tenerti a distanza e colpirla quando non ha lo stun. In fight è parecchio difficile, sopratutto se è feeddata. Ma muore con poco, quindi devi agire quando no ha difese, cioè la passiva!\nSu Sejuani non sono molto ferrato, cioè io la uso spesso e posso dirti che senza la R è un \"semplice tank\". Non è l'unico tank che fa danni e il segreto e concentrarsi sui carry avversarii e solo in fine focussare il tank. Ovviamente dopo che questo abbia missato i controlli! Cerca comunque di tenerti a distanza, tra W E e sunfire fa molti danni \"a contatto\". \nLissandra, invece, in lane \"basta\" schifare. Tra il dire e il fare c'è di mezzoil mare, lo so. Tieniti sotto torre per renderle inutile il suo spostamento (credo sia la Q, non la ho scusa). In fight è un altro paio di maniche e qualcuno potrà dirti molto più di me su come batterla. Tra E, R e Zhonya non la colpisci mai, quindi l'unico modo è la solita cosa, colpirla durante il suo momento di vulnerabilità. Costringila ad ultare su se stessa e nel frattempo cambia bersaglio!","replies":[{"poster":"Rexxi","date":"2015-03-20T22:45:23.545+0000","up_votes":1,"down_votes":0,"body":"Non so che errori ho fatto l'ultima partita sinceramente(persa proprio cntro due di questi champ),ma penso che sia difficile counterarli,in quanto di feedano molto speso,comunque grazie per i consigli. Credo che l'unico mtodo per counterarli è imparare a giocarli :). Ps;forse tutti questi problemi li ho proprio perchè non li uso mai.","replies":[{"poster":"Firenheit","date":"2015-03-21T08:31:15.210+0000","up_votes":1,"down_votes":0,"body":"Questo è verissimo, quando hai un problema con un champ non c'è metodo migliore che acquistarlo ed impararlo! Io ora sto imparando Zed e sto scoprendo molti punti deboli che non sapevo avesse!","replies":[]},{"poster":"Firenheit","date":"2015-03-20T23:16:12.118+0000","up_votes":1,"down_votes":0,"body":"sono sbronzo adesso, non so rispondeti , dopani ti dico","replies":[]}]}]},{"poster":"Stigran","date":"2015-03-21T08:25:00.710+0000","up_votes":1,"down_votes":0,"body":"Come ti hanno già detto, Lissandra ha una marea di CC ma i suoi danni sono in realtà abbastanza mediocri. La cosa più importante da fare è wardare la mappa, in questo modo eviti che ulti a sopresa il tuo carry vincendo lo scontro 5v5. Se ulta se stessa, a meno che non sia 10/0 al 20 minuto, non farà molti danni e verrà disintegrata appena diventa di nuovo targettabile.\nPer annie in primo luogo chiedi a tutto il team di scrivere quando usa il flash, così ti regoli e sai quando tenerti a distanza. Poi hai due scelte: prendi un champ che ha burst ancora più forte del suo e cerchi di farla fuori prima che possa reagire/con range superiore al suo (ahri, viktor, brand, lux, ecc) oppure prendi un champ tankoso e con danni decenti e ti becchi tibbers al posto dei tuoi compagni (udyr, sion, maokai, swain). Se feddata accetta che, a meno di errori da parte sua, instakillerà uno dei tuoi e lavora di conseguenza.\nPer sejuani basta non sottovalutare il suo danno con gromp e, se sei carry, evitare il suo engage in teamfight.","replies":[]},{"poster":"Jay Kenton","date":"2015-03-21T04:28:10.284+0000","up_votes":1,"down_votes":0,"body":"Visto che ti sei ben posto ti sussurrerò ben tre jungler che possono workare contro Sejuani:\n\nFizz: in questo momento è particolarmente in meta. Fizz può schivare facilmente la ulti di Sejuani con la sua mobilità, e non è troppo impensierito dagli slow visto che specie dopo che ha buon cdr disingaggia facilmente. Buildandolo come antitank non ha troppa difficoltà a dullerare Seju in ogni fase della partita, anche se deve stare attento ai followup.\n\nMaster Yi: Master Yi batte Sejuani a condizione di dodgiare la ulti di Q e la W di Meditate. Il suo kit, spesso potenziato da una Botrk, è in generale ben disegnato per fare danni continuati (true damage) e la sua immunità agli slow lo rende particolarmente efficace.\n\nOlaf: Prima di tutto Olaf è capace di junglare più velocemente di Sejuani, quindi a differenza di molti altri jungler parte con un piccolo vantaggio. La sua immunità ai CC ed i danni sostenuti più il true damage lo rendono adatto se si decide di invaderla attorno al livello 6.\n\nPer quanto riguarda la top, al momento il toplaner più avvantaggiato è Irelia, ma comuque anche Fizz e Kassadin possono workare.","replies":[]},{"poster":"Frattaglia","date":"2015-03-20T23:43:30.740+0000","up_votes":1,"down_votes":0,"body":"Stavo pensando: e provare a invadere sejuani in early?","replies":[]},{"poster":"Lord Valotz","date":"2015-03-20T23:11:49.642+0000","up_votes":1,"down_votes":0,"body":"Perchè non hai mai incontrato me con Lissandra... feedo pure i minion caster con lei... secondo me una volta che le fai  sprecare la sua E non credo che possa fare molto è un palo, gli autoattacchi sono ridicoli e la Q che è la tua fonte di danno principale la hai solo una volta ogni 3 secondi in early, ma credo che sia un tempo sufficiente ad eliminarla, ma probabilmente sono io che non ci ho capito nulla di come usarla e nemmeno quindi di come giocarci contro :'(","replies":[]},{"poster":"tiè","date":"2015-03-21T11:59:39.669+0000","up_votes":1,"down_votes":1,"body":"annie la counteri con zed per esempio, facilmente, o con talon o con fizz con tanti. Annie come mid nn va bene viene subito killata. Il problema è più lissandra, sejuani non la conosco bene ma un buon melee con CC e dmg mi sembra che vada bene. Forse con kassadin e diana puoi counyterare lissandra.","replies":[]},{"poster":"Fappelion Dong","date":"2015-03-21T10:18:46.700+0000","up_votes":1,"down_votes":1,"body":"Questi 3 champ andrebbero bannati sempre in ranked a mio parere, sono quasi \"press R to win\" o in generale i vantaggi che danno al team sono enormi.\n\nIn ogni caso do il mio parere:\n\n{{champion:1}} se te la trovi contro midlane (e tu stai midlane ovviamente) il modo migliore per batterla è devastarla prima che abbia l'ultimate o in generale prima che abbia abbastanza spell  di fila per farti uno stun veloce (prima che finisca il {{item:3165}} insomma). Altrimenti puoi sempre basarti sui **poke** per ucciderla pian piano e impedendole di ingaggiare ({{champion:101}} {{champion:101}} {{champion:101}} )\nSe invece è il support nemico il meglio è focussarla in early, visto che tranne l'ultimate il danno grosso lo fa solo se passano 40 minuti è-è\n\n{{champion:127}} ha i danni bassi ma dei buoni control per aiutare i jungler se ganka. Quindi se si trova mid quasi tutti fanno più danno di lei (basta non farsi pokare dalle Q) ed è relativamente facile. Se invece si trova toplane o prendi {{summoner:14}} per tentare di ucciderla subito e snowballare, altrimenti se vuoi rimanere sul {{summoner:12}}  ti conviene usare un counter diretto come {{champion:86}}  e {{champion:31}} . Anche se in generale vai di esperienza, ovvio che un {{champion:17}} sucherà contro di lei ma se è il tuo main magari sai come affrontare il tutto.\n\n{{champion:113}} è una donna che cavalca un maiale, invaderla è quasi d'obbligo (magari aspettando che abbia esaurito i cd ^^). Per esperienza il modo migliore di vincere contro di lei è fare l'adc con {{item:3153}} {{item:3139}} {{summoner:1}} e riesci a tirarla giù sempre (vero {{champion:96}} ? Grwll :3 )","replies":[]},{"poster":"Giovarco","date":"2015-03-20T22:37:52.292+0000","up_votes":1,"down_votes":1,"body":"Sejuani: non devi essere tu a difenderti, bensì il tank. Stai lontano dai suoi CC/ingaggi e sei tranquillo.\nLissandra: Bella domanda. Lissandra ha tanti CC, ma i suoi danni come mago sono sotto la media. Inoltre, ha costi alti in mana, quindi deve regolarsi. Non farti beccare da ogni singola sua Q.\nAnnie: Essenzialmente ingaggia quando non ha la passiva attiva e vincerai il trade facilmente. Attenzione al suo flash + R al livello 6. Ti può 100-0 in un attimo. Può essere battuta da chi ha più harass a lunga distanza.\n\nIn generale, farma al tuo meglio e non morire mai e sei apposto.","replies":[]},{"poster":"Br0ken Sword","date":"2015-03-21T16:46:24.658+0000","up_votes":0,"down_votes":0,"body":"Esistono champion che fanno molti più danni e riescono a resistere ai loro, Riven ci riesce benissimo contro Lissandra e Sejuani e ha un pò di difficoltà contro i danni di Annie, Katarina è Katarina e in late oneshotta anche i tank, L'imprendibile LeBlanc come Katarina mid game e late, anche in early appena prende il 6 oneshotta chiunque, se ti ritrovi contro uno di quei 3 champ che hai citato o tutti e tre le migliori opzioni per counterarli sono: Il pirata che mangia arance, il Notturno, la discendente del piccione (Sivir), l'angelo caduto che ti snara per 20 minuti e il tuo team ti reporta per afk e il pesce pescatore","replies":[]}]}