{"poster":"Rexxi","date":"2015-03-21T11:47:07.348+0000","title":"Cosa non va...","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"E anche oggi perdo tutte le ranked che faccio....non ricordo più l'ultima vittoria.Vado a contare le sconfitte....12 di fila.Eppure ripensando alle partite non capisco il perchè.Le ho provate tutte ma non funziona niente.Sono a pezzi,sembra che non riesco più a fare niente.Ogni cosa che faccio risulta inutile.Vado adc e non riesco a vincere nemmeno con una marea di kill(poche morti comunque).Vado jungle usando due tattiche opposte:farmare o gankare molto....nessuna delle due funziona.Vado top,vinco la lane e perdo il game lo stesso.Faccio lo splitpusher e perdo lo stesso...po qualche partita l'ho giocata male,questo  scontato,anche i challenger possono avere delle brutte giornate.Ma non capisco il perchè di cio:più mi impegno,più perdo facilmente....sembra una presa in giro.Nelle normal invece,quando sono spensierato e senza impegno,riesco a vincere molto più facilmente.Sarà forse l'ansia?","replies":[{"poster":"tiè","date":"2015-03-21T11:49:51.286+0000","up_votes":1,"down_votes":2,"body":"sono gli stronze, senza armor e senza MR, fanno boiate pazzesche e nn imparano mai. Anche io sono nella stessa situazione.","replies":[{"poster":"A Yordle ln Heat","date":"2015-03-21T11:55:37.770+0000","up_votes":2,"down_votes":0,"body":"Sempre colpa degli altri, certo ...","replies":[]}]},{"poster":"anagoor","date":"2015-03-21T13:14:18.817+0000","up_votes":1,"down_votes":0,"body":"Guarda, il fatto già di morire qualche volta significa che qualcosa hai sbagliato (e giustamente l'hai ammesso), detto questo ti posso solo dire che capita a tutti, è capitato a me (dal 70% win rate al 45%, due leghe perse,solo ieri sono riuscito a risalire a gold 3) e ad altri come a me e a te.\nPosso soltanto dirti di non pensarci e di giocare per divertirti, magari stacca un po' dalle ranked e aspetta che passi questo periodo.","replies":[]},{"poster":"A Yordle ln Heat","date":"2015-03-21T11:52:43.704+0000","up_votes":1,"down_votes":0,"body":"Ti sconsiglio di fare così tante ranked in un giorno.\nCioè, ieri ne hai fatte sei di fila, e oggi in nemmeno una mattinata ne hai fatte due.\nInnanzitutto calmati: fai meno ranked e concentrati di più su quelle che fai; e non fare così, che appena ne perdi una ti fiondi subito a farne un'altra.\n\nFai poche ranked e con la mente sgombera, magari trovati degli amici con cui farti delle duo e, possibilmente, scaricati un programma per i replay e guarda le tue partite, oppure chiedi ad un tuo amico più abile di te di spectarti e di farti dire come sbagli.\nNon su lol, ma fidati, l'ho imparato a mie spese: se qualcosa va male, fatti aiutare da qualcuno; non andare a testa dura a ripetere e ripetere la stessa cosa aspettandoti qualche miglioramento; questa si chiama follia, non perseveranza.","replies":[{"poster":"Vahlia","date":"2015-03-21T11:58:33.879+0000","up_votes":1,"down_votes":0,"body":"Nah, non c'entra la quantità. Che ne abbia fatte sei o mille di fila, cambia qualcosa? Se hai la 'mente' adatta per poter stostenere molte partite di fila, perché non farle? Io ne ho fatte quattro da stamattina e non ne ho risentito: tutto sta nel saper prendere il gioco come tale. Vinci, vinci. Perdi, perdi. Stop, finiscile lì la cosa.","replies":[{"poster":"A Yordle ln Heat","date":"2015-03-21T12:01:54.911+0000","up_votes":1,"down_votes":0,"body":"Devo essermi spiegato male: il punto non è di farne poche, il punto è di farne poche quando si vede che si gioca male.\nSe ne fai un paio e le perdi entrambe, mettersi a muso duro e continuare a giocarne finché non ne si vince almeno una aumenta lo stress, diminuisce l'impegno e l'attenzione e ti fa, in generale, giocare peggio.","replies":[{"poster":"Vahlia","date":"2015-03-21T12:20:06.960+0000","up_votes":1,"down_votes":0,"body":"Ah, ecco. Allora sì ;)","replies":[]}]}]}]},{"poster":"Rexxi","date":"2015-03-21T11:56:51.786+0000","up_votes":1,"down_votes":0,"body":"Una domanda:secondo voi un problema può essere i fatto che maino champion non adatti alle ranked?","replies":[{"poster":"A Yordle ln Heat","date":"2015-03-21T12:00:14.224+0000","up_votes":1,"down_votes":0,"body":"E quali sarebbero questi champ non adatti alle ranked?\nInnanzitutto no, un bravo giocatore è capace di salire anche usando Urgot (ne conoscono un paio), Yorick o champ considerati ormai morti come Skarner, Swain, Kassadin, Taric e chi più ne ha più ne metta.\nE poi tu stai giocando le ranked con champ molto in-meta, come J4, Corki, Blitzcrank, Vayne ... Questa gente è adattissima nelle ranked.","replies":[]}]},{"poster":"Vahlia","date":"2015-03-21T11:50:29.454+0000","up_votes":1,"down_votes":0,"body":"Ansia da prestazione :P\nComunque, quando vedi che ne stai perdendo troppe di fila ti conviene fermarti. Fatti un giro, mangia un panino, spippati.. Qualsiasi cosa, ma fermati. Datti il tempo di riposare e tranquillizzarti, poi riprova a giocare ;)","replies":[]}]}