{"poster":"Rexxi","date":"2015-07-15T22:47:25.637+0000","title":"Lega gold.","subforum":"Discussioni generali","up_votes":3,"down_votes":3,"body":"Dopo vari tentativi di raggiungere questa benedetta lega ci sono riuscito :).Dopo alcune partite ho capito alcune cose(forse mi sbaglio).\r\nCominciamo dalle cattive,perch&egrave; sono pi&ugrave; belle da elencare :3:\r\n- Non si sa come fanno alcuni giocatori  a stare in quella lega(ci ho messo 3 season per raggiungerla...).Alcuni si fanno letteralmente massacrare dal nemico in lane....tipo 0-5 al 10&deg; minuto e vanno lo stesso a buildare danno :/.Altri splitpushano mentre la squadra nemica sta facendo il nostro nexus.Altri continuano a pickare lo stesso champion nonostante una media di 3-8-5 a partita.Potrei scrivere un libro su quello che ho visto,non solo nel mio team,ma in generale.\r\n-La gente picka quei champion che gli piacciono,senza fregarsene della teamcomposition.Spesso ne esce fuori un team o full ad,o senza tank o quant&#039;altro.Ex: abbiamo jungler ad,top ad,supp tank,adc e il nostro mid seglie uno yasuo o zed.Puoi essere anche bravo ma cosi facendo aiuti i nemici...a meno che non sei fottutamente bravo da giocare contro 3 thornmail e fare i macelli.\r\n-Il flame &egrave; sempre lo stesso del silver e del bronzo(uno dice ss,la bot se ne frega,muore,e dopo inizia il flame totale)\r\n-Ho notato una bassissima comunicazione durante le selezioni dei campioni rispetto alle leghe piu basse.Si swappa molto poco e si picka senza a volte specificare la lane.\r\n-Ci sono parecchi afk....(4 su 5 partite una volta....sempre in generale,non solo nel mio team)\r\n-Alcuni giocatori si sovvrastimano decisamente troppo....se sbagli ammettilo &egrave; inutile che inizi a dire che &egrave; colpa del tuo jungler se perdi\r\nNon mancano tuttavia delle cose positive:\r\n-Alcuni giocatori sono molto bravi e positivi(ricordo certi jungler carriare il team da veri leader)\r\n-C&#039;&egrave; un interesse per la visione della mappa maggiore;molti top e mid comprano wards(in silver era raro...).\r\n-Si pinga di pi&ugrave; durante la partita.\r\n-Molti mutano i tossici senza rispondere(fanno bene).\r\nNon so se ci sia grossa differenza tra gold alto e gold basso,ma l&#039;esperienza mi dice che ci dovrebbe essere.Una cosa &egrave; certa:\r\n-Il gold rientra sicuramente nell&#039;ELO HELL(stolto colui che creddette di esserne uscito,io in pratica ^^)","replies":[{"poster":"Firenheit","date":"2015-07-16T08:09:34.100+0000","up_votes":3,"down_votes":0,"body":"tu ancora credi che gold=bravura? XD","replies":[{"poster":"Ste the ripper","date":"2015-07-16T08:16:17.152+0000","up_votes":1,"down_votes":2,"body":"Beh fino a prova contraria gold>silver>bronze...\nMa inferiore a plat e dia.\n\nè una lega intermedia, la gente inizia a sapere un minimo quello che fa e smette di fare superschifo, non sono bravi, ma non fanno schifo, tutto qua.","replies":[{"poster":"Firenheit","date":"2015-07-16T08:28:57.136+0000","up_votes":2,"down_votes":2,"body":"Beh fino a prova contraria gold>silver>bronze...\nSe ne sei convinto buon per te XD \n\nFinché continui a giudicare i giocatori da ciò che hanno scritto non riuscirai mai a capire veramente cosa può fare una persona. L'unico modo per capire il livello di un giocatore è giocarci assieme. Dire che gold>silver>bronze è la cosa più scontata, triste e sbagliata che la maggior parte dei player hanno inculcato in testo. \nAnche tu stesso sarai stato massacrato da chiunque, dal bronzo 5 al Gold1, quindi imparate a capire che quella scrittina non vuol dire una sega :)\n\nCerto, man mano i giocatori iniziano a sfoltirsi, ma fidati di me, di sicuro non in gold :)","replies":[{"poster":"Ste the ripper","date":"2015-07-16T08:33:39.973+0000","up_votes":2,"down_votes":2,"body":"Ah già, vero, vado a farmi rektare da huntik...\nTanto il bronzo è il nuovo gold, no?","replies":[{"poster":"Firenheit","date":"2015-07-16T08:34:46.256+0000","up_votes":3,"down_votes":1,"body":">Tanto il bronzo è il nuovo gold, no?\n\nNoto che non hai capito una sega di quello che ho scritto.\nE lo so, vanno tutti mad quand gli dici che se sei gold non vuol dire che hai 33 cm :D","replies":[{"poster":"Ste the ripper","date":"2015-07-16T08:35:59.253+0000","up_votes":2,"down_votes":2,"body":"Comunque in bronzo non ci arrivi per caso :)\nPrima capisci i tuoi errori, prima inizierai veramente a salire","replies":[{"poster":"Firenheit","date":"2015-07-16T08:39:46.995+0000","up_votes":2,"down_votes":0,"body":"Grazie per il commento fine a se stesso, questa discussione ne aveva bisogno, si.\n\n*\"Capisci i tuoi errori e diventi bravo\"*\nGrazie Ovvio, menomale che esisti guarda, una manna dal cielo.\n\nSpoiler:\n se ti sembra una risposta ipocrita rileggi i miei commenti 8)","replies":[{"poster":"Ste the ripper","date":"2015-07-16T08:50:34.545+0000","up_votes":1,"down_votes":2,"body":"Bene, se capendo gli errori sali, siamo d'accordo su questo, come mai il bronzo è il fondo della scala? :)","replies":[{"poster":"Firenheit","date":"2015-07-16T08:57:28.187+0000","up_votes":2,"down_votes":1,"body":">Spoiler:\nse ti sembra una risposta ipocrita rileggi i miei commenti 8)\n\nNon lo hai fatto, l'ho scritto proprio perché so che stai capendo quello che vuoi capire 8)\n\nAspetta ti aiuto perché evidentemente da solo non ci arrivi, so che sei ancora mad perché non lo hai da 33 8)\n\nTieniti stretto alla sedia: Non tutti, i gold, sono bravi! Non tutti, i bronzo, sono, pessimi! Non tutti, i silver, non... Prova a completare la frase, ti risponderò a mo' di Clementino...","replies":[{"poster":"Exploooooosion","date":"2015-07-16T09:41:44.475+0000","up_votes":3,"down_votes":2,"body":"se sei bronzo 5 fidati è perché non sai giocare.\nIo quando ho iniziato a giocare avevo già molti amici che giocavano a questo gioco uno di loro era al 30 e rompeva molto quando sbagliavo ( di solito la sua farm a 20 minuti era sui 80 minion) e io pensavo che era veramente tanta arrivato al 30 facciamo entrambi le 10 rank di posizionamento io vengo messo b1 lui silver 5 non c'èra tanta differenza ansi lui era migliore di me ma poi il tempo ha dimostrato chi era più forte e che le lege contano, lui e sceso fino al b5 e io son salito fino al gold5... \nDire che i bronzi son forti quanto i gold è una bugia ( è vero che nei gold almeno 2 player su 3 so boostati ma se la riot banna questi player il gold diventerebbe veramente una bella lega).\nCordiali saluti","replies":[{"poster":"Firenheit","date":"2015-07-16T09:43:50.416+0000","up_votes":2,"down_votes":1,"body":">Dire che i bronzi son forti quanto i gold è una bugia\n\nPer favore, imparate a leggere... \nNon devi neanche considerare la lega.\nVuoi sapere se una persona è brava? Giocaci!\n\nUna persona può essere brava o no a prescindere dall'icona che ha. \nDovete seriamente smettere di pregiudicare le persone.","replies":[{"poster":"Exploooooosion","date":"2015-07-16T10:24:17.949+0000","up_votes":2,"down_votes":1,"body":"Si ma se si trova in bronzo un motivo ci sarà non credi ? e non mi dire che è colpa del team perché a tutti capitano team ti tardi .\nTi elenco i motivi per cui uno si trova in bronze di solito:\nscarsa farm;\nscarsa visione di gioco;\nflamer ( e questo lo si trova fino a plat);\nbassa capacità di comunicazione;\nmancanza di conoscenza dei campioni;\necc.\nGiocarci contro o insieme non risolve nulla perché può anche essere bravo ma se si trova in bronzo significa che anche il gioco si è accorto che c'è qualcosa che non va","replies":[{"poster":"Firenheit","date":"2015-07-16T10:41:29.747+0000","up_votes":2,"down_votes":1,"body":"Quindi se sono bronzo faccio schifo, domani salgo a Silver perché gioco tutto il giorno e sono più bravo agli occhi degli altri (y) \nLa vita è bella :)\n\nPer questo la SoloQ fa schifo, per chi la pensa così.","replies":[{"poster":"Dr LouD","date":"2015-07-16T11:29:49.255+0000","up_votes":3,"down_votes":0,"body":"Scusami ma questo discorso francamente non mi piace.\n\nLa skill di una persona si può giudicare dal rank (ovviamente se non boostata)\n\nSe un tizio è bronzo, al 99% sarà meno bravo di un gold, questo è un dato di fatto.\nNon regge la questione del \"eh ma se non ci giochi non puoi giudicare\".\n\nQuesto discorso però vale solo se le persone che si mettono a confronto hanno giocato tante ranked da poter dire con certezza che si sta nella lega che si merita.\n\nOvviamente se fai 10 ranked e ti posizioni in bronzo e smetti di giocare è un altro discorso, magari ti sei allenato tanto in normal e adesso vali come un gold, ma il fatto è che puoi tranquillamente dimostrarlo iniziando a fare ranked, se resti con il rank bronzo chi non ti conosce può, giustamente, pensare che vali quanto un bronzo, perchè la tua skill vera non la dimostri salendo.\n\nPoi se la SoloQ non ti interessa e non vuoi giocarla imho dovresti tirarti fuori da questi discorsi dal principio.","replies":[]},{"poster":"Exploooooosion","date":"2015-07-16T12:37:24.412+0000","up_votes":2,"down_votes":1,"body":"a te pensi che se uno fa 200 rank in una settimana diventa plat o diamond solo perché gioca tutto il giorno ? uno sale solo se è bravo e se esci dal bronze significa che sei miglirorato ( anche solo leggermente)","replies":[]},{"poster":"Firenheit","date":"2015-07-16T12:16:35.405+0000","up_votes":1,"down_votes":0,"body":">Questo discorso però vale solo se le persone che si mettono a confronto hanno giocato tante ranked da poter dire con certezza che si sta nella lega che si merita.\n\nSi Loud, questo è vero.\nIl problema è che non sempre se ne giocano molte, senza considerare chi parte bronzo e chi parte gold (si, un paio di amici sono stati messi direttamente gold).\n\n> ma il fatto è che puoi tranquillamente dimostrarlo iniziando a fare ranked\n\nEsatto Loud, il problema sai qual è? Che tu questo lo hai capito, invece la gente critica ed esprime sentenze senza sapere nulla.\n\nSicuramente anche tu, ne ho conosciuto di persone stra-boostate, giusto l'altro giorno una quasi platino che ha il ragazzo che le gioca le ranked. \nNo, io non pregiudico le persone, mi dispiace.","replies":[]},{"poster":"Firenheit","date":"2015-07-16T12:51:38.865+0000","up_votes":1,"down_votes":1,"body":"Continua a pensarla così e non capirai mai quando veramente migliori :)","replies":[]}]}]}]}]},{"poster":"Ste the ripper","date":"2015-07-16T09:45:58.949+0000","up_votes":2,"down_votes":0,"body":"Ti rivelerò un segreto, ma tieniti stretto, tutti i gold ( non boostati) sono più forti di un qualunque bronzo :)\nTra gold e silver la questione è più complicata perché gold5 e silver1 sono vicini, ma il gold medio è più forte del silver medio, parola di boyscout\n\nE per la cronaca, si, se sei bronzo non sai giocare, uscire dal bronzo è la cosa più facile del gioco, chiunque non faccia schifo ci riesce in massimo 30 partite","replies":[{"poster":"Firenheit","date":"2015-07-16T09:47:37.657+0000","up_votes":1,"down_votes":0,"body":"Ao Ste, se sei il tipo di persona che giudica la gente da vestito, peggio per te. \nIo te l'ho detto, se vuoi sapere se una persona è brava, guardala giocare. \nSe ti basta vedere un'icona, affari tuoi.","replies":[{"poster":"Ste the ripper","date":"2015-07-16T09:49:08.241+0000","up_votes":1,"down_votes":0,"body":"Esistono le classifiche per un motivo...\nNon ho bisogno di giocare con Federer per scoprire che è più bravo di me a tennis","replies":[{"poster":"Firenheit","date":"2015-07-16T09:51:02.558+0000","up_votes":1,"down_votes":1,"body":">Esistono le classifiche per un motivo...\n\nRanked team :)","replies":[{"poster":"Firenheit","date":"2015-07-16T10:39:52.014+0000","up_votes":1,"down_votes":0,"body":">Prendi una qualunque classifica team ranked e già in silver/ bronzo 1 nessun team avrà bronzi al suo interno\n\nVeramente si, per favore non inventiamoci statistiche e affini. E' triste.\n\n>Le team ranked sono molto più difficili della soloq\n\nNo, le teamranked sono ranked. Le soloQ sono caramelle. \nLo dicono stesso loro, fatti un giretto su reddit ^^","replies":[]},{"poster":"Ste the ripper","date":"2015-07-16T09:53:10.870+0000","up_votes":1,"down_votes":0,"body":"Prendi una qualunque classifica team ranked e già in silver/ bronzo 1 nessun team avrà bronzi al suo interno\nLe team ranked sono molto più difficili della soloq","replies":[]}]}]},{"poster":"Polarize","date":"2015-07-16T09:49:43.265+0000","up_votes":1,"down_votes":0,"body":"Di solito i giocatori hanno l'icona che si meritano.\nNon sempre, ma di solito.","replies":[{"poster":"Firenheit","date":"2015-07-16T09:50:28.959+0000","up_votes":1,"down_votes":0,"body":":)","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Rexxi","date":"2015-07-16T14:04:50.217+0000","up_votes":1,"down_votes":0,"body":"Probabilmente molti silver e bronze non riescono a salire a gold per insufficienza di skill.Cosa fanno?Semplice,cercano qualcuno che li boosti ,che sia un amico o qualcun'altro.Arrivano così a gold,molto probabilemnte per la skin vittoriosa,e dopo che il boost è finito cominciano a giocare come sanno fare veramente.Questa è l'unica spiegazione possibile per alcuni player.Ve ne faccio qualche esempio:\n-Un gnar nel nostro team contro un garen.Questa lane è netamente a favore di gnar,a meno che il jungler nemico interviene.Ma allora se sei gold,perchè non wardi,dato che al 100% sarai campato e perchè non usi al meglio il tuo champ per counterare garen?Risultato:0-5 gnar al 10 minuto,sotto di 70 cs,e si lamenta se gli altri lo rimproverano.Può capitare una partita negativa,ok,ma la sua media non è assolutamente buona dato che muore 8 volte a partita e uccide 3 volte.Spiegazione:o il matchmaking è letteralmente impazzito,o semplicemente ti sei fatto boostare dato che un bronzo 5 non sa pockare un garen....\n-Un trynda top che ha praticamente splitpushato tutto il game consapevole della superiorità del team avversario nei tf 5 vs4(anche 5 vs 5 avrebbero vinto).Risultato:i nemici si fanno il nexus nostro,lui una torretta inutile.Come ha risposto?\"I'm trynda....I'm meant to splitpush\".\n-Un fizz contro una lb che è stato arato in 3 minuti...nessun ss,nessun ping.\nConclusioni:in silver con c'è un grosso dislivello di skill,in gold SI,cioè in gold si trovano giocatori VERAMENTE scarsi,ma anche VERAMENTE bravi,in silver invece non c'è questo dislivello:o sono leggermente piu bassi della norma o più alti.\nOra però se ti trovi questo boostati in team rischi di essere reportato...a meno che non sei un santo.Chi è che non accenna al flame dopo che un mid sta feedando senza fermarsi?Il problema è che per flame si viene instareportati,per feed quasi niente(non ricordo nessuno bannato per intentional feed o cose simili).Come conclusione si arriva quindi a bannare giocatori che inevitabilmente sono costretti a flamare anche se non vogliono.E come se volessi cotruire una piramide con le carte(il player che si impegna) e arriva uno(il boostato) che te la rovina.Cosa faresti?Il 90% dei giocatori si innervosirebbe.Quindi facendo dei calcoli:i silver e bronze costituiscono la grande maggioranza dei giocatori di lol.Cosa vogliono?Raggiungere il gold per la skin.Non ci riescono?Ricorrono al boosting.Cosa succede?Si rovina il matchmaking della lega gold.Conclusione:il boosting rovina questo gioco.","replies":[{"poster":"Firenheit","date":"2015-07-16T17:14:36.477+0000","up_votes":1,"down_votes":0,"body":"Sul PBE è partito il testito per punire chi è stato boostato, ma mi chiedo come facciano a capirlo.","replies":[]}]},{"poster":"Fiat480 EdVeneto","date":"2015-07-16T14:11:56.004+0000","up_votes":1,"down_votes":0,"body":"sono plat, nn lo so, scs!! tvb","replies":[]},{"poster":"Invisible Bonny","date":"2015-07-16T11:54:22.605+0000","up_votes":1,"down_votes":0,"body":"Dal gold qualcuno iniizia ad avere visione del gioco, cosa che enl bronzo e nel sivler non si ha... Ma noi gold non siamo bravi. \nDal platino si diventa Abili, dal Diamante sì è un bravo player","replies":[]},{"poster":"NxG Asfer","date":"2015-07-16T10:12:35.806+0000","up_votes":1,"down_votes":0,"body":"Solo dal platino 2 in su si sente la differenza abissale...ovviamente ci sono alcuni player che sono bravi anche ad elo più basso ma solo da là si inizia a sudare veramente molte partite e la maggior parte sa giocare.","replies":[]},{"poster":"Exploooooosion","date":"2015-07-16T09:36:39.949+0000","up_votes":1,"down_votes":0,"body":"guarda io da quando sono arrivato gold rimpiango ogni giorno il silver in quanto almeno li c'era competizione, qua c'è gente che pikka singed senza averlo mai usato contro darius, ti insultano se non vai a contestare un drago ( si gioco quasi solo jng in rank) da solo vs 5 mentre stavi facendo un gank in top visto che il drago precedente lo avevano killato senza darci visione e quindi non sapendo quando rinasceva, gente che si crede ci sa chi e poi fanno 0-20 e flammano tutti girando le colpe, altri che si trovano li solo grazie alla carta di credito di papino ecc.ecc.","replies":[]},{"poster":"Ste the ripper","date":"2015-07-16T08:00:21.614+0000","up_votes":1,"down_votes":0,"body":"> Alcuni si fanno letteralmente massacrare dal nemico in lane....tipo 0-5 al 10° minuto e vanno lo stesso a buildare danno \n\nDipende chi sei ^^\nSai l'adc, l'apc, l'assassino se builda tank è peggio...\n\n> -La gente picka quei champion che gli piacciono,senza fregarsene della teamcomposition\n\nsoloq... Cosa ti aspettavi?\n\n> Il flame è sempre lo stesso del silver e del bronzo\n\nEd è così fino in challenger\n\nComunque io grazie ad una winstreak ho provato il gold alto, cambia ancora parecchio il gioco rispetto al gold basso, fidati :)","replies":[]},{"poster":"HonorOfEma","date":"2015-07-16T07:43:34.465+0000","up_votes":1,"down_votes":0,"body":"In gold ci sono una marea di smurf che rovinano un bel po' delle partite","replies":[]},{"poster":"DioRamato","date":"2015-07-16T07:12:43.662+0000","up_votes":1,"down_votes":0,"body":"Sicuramente nelle \"leghe alte\" di gold hai una possibilità piu alta di trovare gente che gioca seriamente (nella speranza giustamente di arrivare a platino). Stessa cosa era in argento. Tranne che in I e II trovi solo troller, afk e flamer. Anche a me è successo di trovare jungler o top che da soli vincono la partita ma le conto sulle dita di una mano. Resto comunque dell'idea che il matchmaking sia fatto senza criterio. Veramente c'è tanta gente, ma tanta che non meriterebbe nemmeno di stare in silver. E una valanga che per provare per la prima volta un champ lo fanno in ranked. E' un gioco fatto male soprattutto per la questione dei bann. Io vengo bannato 14 giorni con rischio perenne perchè flammo una kalista 0-9 (dicendo nub, l2p, kid e al massimo idiot e io mi son beccato un \"tua mamma p*****a\"dal suo amico shen supporter) mentre a questi intentional feeder, gli afk e i troll picker non viene fatto MAI niente.","replies":[]},{"poster":"Oaken Arrow","date":"2015-07-16T01:05:59.283+0000","up_votes":1,"down_votes":0,"body":"Ma quindi mi domando: se la gente gioca a caso a tutti i livelli, perché giocare ancora? E questa era la domanda seria.\n\nPoi...\n\nSi fa un bell'esamino per l'ammissione alle ranked, e quando il focus diventa Kayle che ha ultato sé stesso si mandano tutti a ripetizione e gli si mette una bella fascia da asino visibile anche in chat, in modo che tutti lo sappiano?","replies":[]},{"poster":"l Sinon l","date":"2015-07-16T00:21:00.542+0000","up_votes":1,"down_votes":0,"body":"L'elo hell è ovunque. Per ora mi sono fermato a constatarlo fino al platinum 3","replies":[]}]}