{"poster":"MeIIow","date":"2016-06-27T17:38:25.766+0000","title":"Tresh der ketten fuchtler","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hi leute,\r\n\r\nich spiel sehr gerne tresh und es macht mir auch spa&szlig; aber ich glaube das ich da 1-2 fehler sowohl in den runen als auch beim skillen der f&auml;higkeiten habe :X (bin plat 5)  ich skill die Q und danach die E bzw W in den meiserschaften spiel ich mit thunderlord da ich diese dmg verringerung f&uuml;r zu schlecht halte wenn der adc im focus ist, kommt er endweder weg oder is tot nach meinem kentnisstand  zudem nehm ich als sum gerne ignite mit um zus&auml;tzlich druck aufzubauen. Also biite lasst eure meinung da egal ob &#039;&#039;boosted animal&#039;&#039; ;) oder &#039;&#039;nicht ganz verkehrt aber.....&#039;&#039;\r\n\r\ninterssiert mich einfach mal was andere leidenschaftliche tresh spieler dazu sagen und eventuell auch weinen wenn sie das lesen.\r\n\r\nOb hier im thread oder per PN ist mir egal erwartet bei einer frage hier im forum aber nicht eine sofortige antwort.","replies":[{"poster":"DontKillMySoraka","date":"2016-06-27T17:48:19.020+0000","up_votes":1,"down_votes":0,"body":"Ich spiele zwar Thresh nicht, aber ich finde, dass man die E zuerst nehmen sollte, da man dann auf lvl 1 den Gegner schon mit AA poken kann und einen lvl 1 engage abwenden, mit der Q stehste halt beim Gegner... cool.. ^^.\nWenn die weiterhin die Damage-Verringerung nicht gefällt, nimm doch diese Maximale Lebenssteigerung. Braucht zwar Zeit um zu Stacken, hast dann aber später 300 Leben mehr, was wiklich viel ausmacht.","replies":[{"poster":"MeIIow","date":"2016-06-27T17:53:07.916+0000","up_votes":1,"down_votes":0,"body":"ging ja nicht um lvl 1 skill sondern allgemein ^^","replies":[{"poster":"Pitayah","date":"2016-06-27T17:54:14.010+0000","up_votes":1,"down_votes":0,"body":"Wird nicht die E gemaxed? Zum lashitten der Minions und nerven der Feinde","replies":[{"poster":"the7ofthe7","date":"2016-06-27T19:17:06.854+0000","up_votes":1,"down_votes":0,"body":"Doch{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"SorisDynasty","date":"2016-06-27T19:37:14.572+0000","up_votes":1,"down_votes":0,"body":"Nicht zwangsweise. Es ist eine Option - kein Muss. Ich persönlich spiele entweder mit drei frühen Punkten im E für besseren Laneharass(oder wenn ich gegen Morgana spiele), ansonsten Q zuerst für mehr Hooks / Burst.","replies":[]}]}]},{"poster":"OrangeBubble","date":"2016-06-27T19:18:08.441+0000","up_votes":1,"down_votes":0,"body":"Gängige Skillung ist R > E > Q > W\n\nIst aber auch möglich R > Q > E > W zu skillen , wenn du viele Hooks trifft.\nEs gibt auch welche die R > 3xE > Q > E > W skillen. \nOder aber R > E > Q > E > Q > E .... > W\nJe nachdem, wie du spielst.\n\nThunderlord kann man anscheinend machen, kommt halt drauf an, was man präferiert. \n\nhttp://probuilds.net/champions/details/Thresh","replies":[]},{"poster":"DontKillMySoraka","date":"2016-06-27T18:24:39.527+0000","up_votes":1,"down_votes":0,"body":"Oh, achso, das habe ich falsch verstanden ^^.","replies":[]}]}]}]}