{"poster":"ShutUp89","date":"2015-04-20T16:06:38.249+0000","title":"Base Gadgets/Upgrades , Was haltet ihr davon?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo Community,\r\nich h&auml;tte einen Vorschlag, und zwar das man sich im Game &quot;Gadgets&quot; f&uuml;r die eigene Base freischalten kann. Ich stelle mir das z.B. so vor , dass jeder aus dem Team zu einem speziellen H&auml;ndler geht , und einen Goldbetrag einzahlen kann. Es kann ein Spieler alleine das &quot;Gadget&quot; bezahlen oder er zahlt einen Teil und der Rest des Teams zahlt nach und nach den Restbetrag ein. Wenn die n&ouml;tigen Kosten f&uuml;r ein Gadget erreicht wurden, wird es freigeschaltet. Bei \r\nGadgets denke ich an bestimmte Upgrades f&uuml;r die Base , wie zum Beispiel kleine Golems die sie verteidigen oder sonstige Verteidigungseinrichtungen. Schreibt mir was ihr davon haltet!\r\nMfG","replies":[{"poster":"Titanium70","date":"2015-07-14T22:18:38.735+0000","up_votes":1,"down_votes":0,"body":"Naja ich sehs so: Basegadets würden per Definition eh nur dem gewinnenden Team helfen seinen Sieg gegen unerwartete Fehler zu sichern, ein verlierendes Team, dass auch noch Gold in eine Verteidigung investiert hätte nur einen noch größeren Gold-Rückstand und könnte sich so von sämtlicher Map-controll verabieden, Fights außerhalb der Base während völlig ausgeschlossen. \n\nDennoch halte ich Basiserweiterungen an sich für eine gute Idee, gerade gegen schnelle Rotations-Team oder Splitpush wäre es wirklich hilfreich. ^^ Allerdings sollten diese unabhängig von Gold sein. Wie genau ist mir jedoch schleierhaft (Zeitaufwand scheint mir recht interessant zu sein). :P","replies":[]},{"poster":"DerZermetzelte","date":"2015-07-14T18:06:53.763+0000","up_votes":1,"down_votes":0,"body":"Mal ne sinnvolle Antwort:\nAn sich hört es sich echt gut an. Das Problem das Ich sehe: Lange Spiele würden sich noch mehr ziehen, wenn Teams Ihr überflüssiges Gold in Base Infrastruktur investieren und dann jeder push bei der Base Mauer endet, da man als angreifendes Team nun unterlegen ist.\nAn sich ne gute Idee, aber meiner Meinung nach nichts was Riot verwirklichen würde oder sollte, wenn sie auf interessante Spiele Wert legen.","replies":[]},{"poster":"Taloz","date":"2015-04-20T20:56:30.503+0000","up_votes":1,"down_votes":0,"body":"Wer weiß. Vielleicht gibts sowas sogar in 2 oder 3 Seasons, da Rito ja immer was neues brauch um das Spiel interessant zu halten.\nFinds ansich gar nicht mal schlecht. Im late, -lategame hat man eh oft Goldüberschuss wenn man sehr gefeedet ist.","replies":[]},{"poster":"Dermel","date":"2015-04-20T20:43:16.730+0000","up_votes":1,"down_votes":0,"body":"Und das Spiel ziiiiiiiieeeeeeht sich, das würde das Spiel so ziemlich um 3 Stunden verlängern, weil es schwer genug ist, die Base zu zerstören und dann auch noch sowas, wenn man dann ein Spiel versammelt spielt man den ganzen Tag keins mehr ... Vielleicht mal als Funmodus, das wär ganz lustig, aber für in das normale Spiel rein passt es einfach nicht, ach Kauf dir einfach ein {{item:3512}} Wird dir gefallen","replies":[]},{"poster":"malleusmintaka","date":"2015-04-20T16:30:32.335+0000","up_votes":1,"down_votes":4,"body":"Kurz: Nein.\nLang: NEINNEINNEINNEINNEINNEINNEINNEINNEINNEINNEINNEIN\nDie Begründung: 0/10","replies":[]}]}