{"poster":"Bleik66","date":"2016-02-25T16:26:21.499+0000","title":"El Mute.","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"No les a pasado que est&aacute;n flameando y como un boludo respondes sabiendo que es al pedo, pero una vez que te enganchaste no podes para de responder , porque te indigna , te molesta lo que dicen y al final te terminas enojando. Bueno me suele pasar muy seguido aun sabiendo que puedo mutearlos no lo hago y esto hace que se me vayan las ganas de jugar y es triste porque es un juego que me divierte","replies":[{"poster":"Razek Fury","date":"2016-02-25T17:04:07.283+0000","up_votes":1,"down_votes":0,"body":"el mute es el facil remedio de los platinos que quieren entregar esa actitud TOXICA a todos para que todos hagan lo mismo, no divierte que mucha gente te insulte, pero tampoco divierte que no puedas ni siquiera hablar 1 palabra porque entonces no juegas con bots? es ridiculo, en nuestro lenguaje esta el insultar ya sea en argentina o chile es siempre lo mismo, somos asi, lamentablemente aqui creen que por censurar palabras lograran algo, y es todo lo contrario, lo empeoran mas.","replies":[{"poster":"Seraus Leunamme","date":"2016-02-25T17:32:51.531+0000","up_votes":1,"down_votes":0,"body":"No es excusa decir \"en nuestro lenguaje está el insultar\", eso es algo completamente sin sentido. Yo soy argentino y soy de decir \"malas palabras\" cada dos por tres, pero eso no me justificaría en ningún modo si me pusiera a decir cualquier cosa como un descerebrado en el juego.\nHay reglas específcas en cuanto a la comunicación y las actitudes dentro de League of Legends, y no cuesta absolutamente ningún esfuerzo comportarse correctamente. \nA aquel que no le guste, que no juegue o se banque los reportes.","replies":[{"poster":"Bleik66","date":"2016-02-25T21:51:06.273+0000","up_votes":1,"down_votes":0,"body":"El anonimato , hace que esas personas crean que están seguras sin importar lo que digan, por eso son toxicos , flamer, ratas , etc","replies":[{"poster":"Seraus Leunamme","date":"2016-02-25T21:53:31.552+0000","up_votes":1,"down_votes":0,"body":"Eso es cierto, es más que evidente... pero fijate el de arriba... justificando que la gente flamee \"porque insultar está en el lenguaje\"? por favor...","replies":[{"poster":"Razek Fury","date":"2016-02-26T03:23:00.904+0000","up_votes":1,"down_votes":0,"body":"no defiendo a los flamers, todo lo contrario, me aburren, a lo que me refiero es que esta en nuestra cultura mandar un insulto, es taan dificil encontrar gente educada, a veces me toca poder leer ese lado educado de LAS pero luego BANG 2 o 3 flamers que les dices algo como \"hace esto asi\" en mi caso yo diciendole a mi sup {{champion:412}} que lance su  gancho al lvl 2 para yo continuar el combo, y me responde \"cerra la cola bludo\" a este tipo de actitud deberia tomarse enserio y castigar de forma correcta...","replies":[]}]}]}]}]},{"poster":"wildganja","date":"2016-02-25T17:30:45.537+0000","up_votes":1,"down_votes":0,"body":"Respondiendo estas aumentando la toxicidad, hay que mutear y listo","replies":[]},{"poster":"Casandra Lange","date":"2016-02-25T16:49:46.003+0000","up_votes":1,"down_votes":0,"body":"Lo hacía, pero flammear me hace perder concentración y empiezo a hacer las cosas super mal, entonces muteo y ya.","replies":[]},{"poster":"Zetha","date":"2016-02-25T16:34:32.741+0000","up_votes":1,"down_votes":0,"body":"Acostumbrarte al mute si te flamean, porque por responder a un flamer de la misma forma en la que el te habla (flameandolo) podes ir baneado. Reportalos al final de la partida que vas a ver que esos reports funcionan (el foro esta lleno de \"Me banearon injustamente\" \"Ban permanente\" o cosas asi y la mayoria son por flamear).\nSaludos! {{champion:51}} {{champion:119}} {{champion:90}} {{champion:106}} {{champion:236}} {{summoner:31}}","replies":[]}]}