{"poster":"CMDName","date":"2015-05-29T20:53:02.944+0000","title":"Nerf Ekko pls","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Para cuando el nerf a ekko? Es el nuevo Yasuo {{champion:245}}","replies":[{"poster":"Zęd Mîd","date":"2015-05-30T02:26:38.987+0000","up_votes":2,"down_votes":0,"body":"Yasuo? Te digo que recientemente tuve una muy mala experiencia contra un ekko.\n\nJugué normal, siempre había querido ver esa pelea, el champ nuevo vs mi main, más aún que verla, vivirla. Hice lo mismo de siempre, esquivar skillshots, sacar primera sangre y un par de kills antes de min15.\n\nLuego el udyr enemigo comenzó a campearme y su stun + el stun de ekko, era imposible de esquivar, era un deleteo sin posibilidades de escape instantáneo.\nCreía tener posibilidades jugando bajo torre, nada que ver, se metio bajo torre, me mató con el udyr y salío con ulti, totalmente impune.\n\nNi aunque le ganes el early vas a ganar la partida, este mijo con un par de items te instadeletea y más su jg campeándote, es gg para tí.","replies":[]},{"poster":"Amenotejikara","date":"2015-05-30T06:52:53.052+0000","up_votes":1,"down_votes":0,"body":"Tú lo haz dicho, es el nuevo Yasuo, solo que mejorado. Su ulti simplemente te arruina todo lo que hayas hecho (un buen combo, una buena jugada), además de volverle al menos la mitad de vida. No creo que haya champ que lo counteree hasta el momento, espero que le hagan un nerf prontísimo porque a medida que nos toquen Ekkos con más experiencia, mid será bastante injugable...","replies":[]},{"poster":"SKT T1 Smoke","date":"2015-05-29T23:17:51.725+0000","up_votes":1,"down_votes":0,"body":"Siempre sacan los champs rotos al primer patch, para que sea un champ op y luego gasten dinero en su skin, luego al proximo parche lo nerfean, siempre es asi.\n\nSaludos","replies":[{"poster":"Deigex","date":"2015-05-30T03:01:52.192+0000","up_votes":1,"down_votes":0,"body":"Hasta donde se bardo gnar azir no salieron op es mas hasta los bufearon. Asi que estas mas que equivocado.","replies":[]}]},{"poster":"Adrien Agreste","date":"2015-05-29T23:52:05.716+0000","up_votes":1,"down_votes":0,"body":"supongo q es sarcasmo no ?","replies":[]},{"poster":"darnius","date":"2015-05-29T21:17:16.880+0000","up_votes":1,"down_votes":0,"body":"{{champion:84}} {{champion:429}} {{champion:55}} {{champion:238}} {{champion:92}} que eso se come????\n\n{{champion:38}}  mejor ni pidas nerf que me terminar nerfeando a mi :c","replies":[]}]}