{"poster":"Theta Floz","date":"2015-05-23T15:20:36.402+0000","title":"Why is D5 MMR is so screwed?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I&#039;m just genuinly confused as to why Diamond 5 mmr is such a massive clusterf*ck.\r\n\r\nWhat is going on there?\r\n\r\nI joined the division and was earning 22lp per game and losing 24 straight away (with good MMR). A few months later, still there and I need to win 3 games to match one loss now. I understand the argument of &quot;your MMR is just too low&quot; but that seems a bit odd to me. My MMR will be lower than D5 atm, but I don&#039;t get how anyone is meant to get out of D5 unless they are incredibly lucky, or a MUCH better player than the people they are playing with and can carry &gt;10 games in a row (which is reallllly hard as a support main).\r\n\r\nCan someone please explain to me Riot&#039;s logic behind this system.\r\n\r\nCheers,\r\nFloz","replies":[{"poster":"Wumachine","date":"2015-05-27T09:39:28.568+0000","up_votes":1,"down_votes":0,"body":"I think it's because master tier fucked everything over","replies":[]},{"poster":"Mr Sushi San","date":"2015-05-24T18:12:10.573+0000","up_votes":1,"down_votes":0,"body":"I have this same problem..... it feels like it actually doesn't reflect on how well you do.....  but i gain 14 and lose 26 or 32.... \nlol..... and i was challenger for some time last season... Trust, i have hit the promo 15 times, there is always going to be a troll or the occasional tryndamere sweep in the top lane.... i am a support main as well :D","replies":[]},{"poster":"kJs","date":"2015-05-24T02:44:54.192+0000","up_votes":1,"down_votes":0,"body":"Doesn't your LP gains reflect how well you do in matches? \nIf you get heavily carried all the time you're going to win less LP and lose more LP. \n\nI'm just speculating.","replies":[]},{"poster":"RNG Remilia","date":"2015-05-24T02:36:15.299+0000","up_votes":1,"down_votes":0,"body":"I was placed P4 and in 2 days I climbed to D5 with over a 90% W/L gaining 30 LP per win yet the instant I hit D5 I started gaining under 10 LP and losing over 30 LP... Pretty sure it's something to do with Master Tier being added .","replies":[]}]}