{"poster":"Propulsionator","date":"2019-11-28T03:10:02.094+0000","title":"Automated players ... botting","subforum":"Player Behavior","up_votes":4,"down_votes":1,"body":"Is there anything that can be done about all of the automated players in bots?\r\n\r\nI understand that some may say that it is 'just bots' but at my age .. 'old' and skill level (none) that is where I play.\r\n\r\nNearly every game this last week has had bots on the player side.\r\n\r\nIts pretty easy to find them more than half run cleanse and buy boots first thing, then run up and feed.","replies":[{"poster":"CaptainAntiHeroz","date":"2019-11-28T03:17:22.539+0000","up_votes":3,"down_votes":1,"body":"they run {{summoner:7}} {{summoner:6}}  buy {{item:1001}}  first item and run it down all game","replies":[]},{"poster":"Nightsky Pirate","date":"2019-11-28T07:05:13.703+0000","up_votes":1,"down_votes":0,"body":"You know what's amusing about this? It's probably for players who have been banned and need to be leveled, and don't really care about the rules.","replies":[{"poster":"e46 Fanatic","date":"2019-12-04T16:37:52.480+0000","up_votes":1,"down_votes":0,"body":"that and people who want a fresh ranked status","replies":[]}]},{"poster":"Propulsionator","date":"2019-12-04T16:30:21.655+0000","up_votes":1,"down_votes":0,"body":"Hello.... ?","replies":[]},{"poster":"RasCaelestis","date":"2019-11-29T21:55:22.753+0000","up_votes":1,"down_votes":0,"body":"My friend just recently started playing League, and I'm getting back into the game after about a 3 year hiatus. I've been using AI games to teach him basic skills, and practice champions that were added in the time I was gone. \n\nEvery AI game we play, there's at least one bot on our team. It's obviously a bot and not just a new player. They all buy boots as their first item, and throw out  abilities at totally random times. \n\nThere was one game a few days ago where it was me playing Cho (one of my old mains), my friend trying Sona for the first time, and 3 bots. The bots did nothing but run down lanes and die to enemies. The enemy AI got fed to the point where I couldn't out-tank them, and they just instagibbed the poor Sona. It was the first time I can remember actually losing an AI game, and it felt worse than getting curbstomped in a PVP game. \n\nMy friend was really mad (understandably so), but I think I was able to convince him that this isn't as much of a problem at higher levels. That said, I can't even imagine what the experience is like for new players.","replies":[]},{"poster":"Yin Yang Taoist","date":"2019-11-28T17:08:49.433+0000","up_votes":1,"down_votes":0,"body":"Just add me OP. If I see you doing AI games, I'll join up and help you win.","replies":[]}]}