{"poster":"WOFL Hairab","date":"2016-09-19T19:10:11.889+0000","title":"Ayuda Sobre El TILT ¿Que me pasa?","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Hola mi nombre es WOFL Hairab\r\n\r\n\r\nYo suelo tener mucho TILT pero capas lo que yo tengo no es TILT . Yo siento que cuando no juego lol por 3 dias,  o mas cuando empiezo otra ves a jugar parezco challenger mejor dicho me siento challenger (una  manera de decir) pero hay partidas que siento que juego mal que no hago las cosas que corresponde , me siento manco , siento que no tiro bien las habilidades y juego mal .\r\nyo la verdad no flameo intento no hablar en el chat pero sin embargo siento como si estuviese tilteado , hay partidas que mis amigos juegan mal y entiendo tiene una mala partida , voy a poner un ejemplo JUEGO UNA PARTIDA SALGO 20/0 MI AMIGO SALE 4/15 PIERDO BUENO NO PASA NADA JUEGO OTRA Y ME SIENTO MANCO E INCOMODO JUGANDO NO SE QUE SERA","replies":[{"poster":"Shion Archimago","date":"2016-09-19T20:49:41.483+0000","up_votes":1,"down_votes":0,"body":"juga para divertirte","replies":[]},{"poster":"lPikachu","date":"2016-09-19T19:47:26.368+0000","up_votes":1,"down_votes":0,"body":"Evitar jugar cuando te sientas asi, sal a caminar, descansa, come algo, haz otra cosita! {{champion:105}}","replies":[]},{"poster":"Lunari Red Mask","date":"2016-09-19T19:39:05.579+0000","up_votes":1,"down_votes":0,"body":"Hola,\njuega solo cuando tengas ganas. Cuando te va mal en una partida, aunque no quieras, te afecta. Y hay veces que por eso te terminas tilteando. Lo que debes hacer es descansar entre partidas.\nSaludos.","replies":[]},{"poster":"9081913DEL1","date":"2016-09-19T19:25:51.493+0000","up_votes":1,"down_votes":0,"body":"Trata de jugar y no de obligarte a pasar partidas. Algo comun por lo que challenger es un lugar de conocidos es porque sobre que hay pocos se dividen en ciertas horas, asi podes encontrar a rod (nombre incompleto por normas) a las 21-23 por ejemplo.\nLo que digo es que no hace falta estar 10 hs o jugar todo el dia, juga cuando tengas ganas, lo demas lo haces por \"compromiso\" pero si no estas haciendolo profesionalmente (que te lo tomas como un trabajo siguiendo una meta) pues solo te cargas de negatividad.\nPasas partidas sin mas que pasarlas, eso no es tilt, se llama halo, es algo facil de quitar, cuando ya no tenes ganas de jugar, y solo jugas para juntar pi, pl, xp, porque los demas juegan y demas, deja de jugar o cambai de modo. y si es si o si que tenes que jugar eso, ponete una meta.\nA ver, voy a ir zed, en vez de pensar en el poke en el harass y eso, pensa voy a jugar a no morir, asi jugas con un objetivo muy simple y facil. Si moris, ok a tratar de nuevo, no vas a ser el carry pero vas a tener un mach mas tranqui.\nAl no ser frenetico te detenes a ver tus errores y analizas lo que haces.\n\nSaludos.\n\nFinalmente si estas cansado, juga otra cosa, o anda a escuchar musica navegar etc.","replies":[]},{"poster":"Lince Salvaje","date":"2016-09-19T19:15:14.484+0000","up_votes":1,"down_votes":0,"body":"http://m.memegen.com/y5f6rx.jpg","replies":[{"poster":"WOFL Hairab","date":"2016-09-19T19:16:56.273+0000","up_votes":1,"down_votes":0,"body":"mmm iiiziiii","replies":[]}]}]}