{"poster":"DynD BEAG","date":"2017-07-04T18:09:27.754+0000","title":"Die Dynamite Ducks suchen für ihr LOL Team einen Main Jungle","subforum":"Clans & Teams","up_votes":1,"down_votes":8,"body":"Unser LOL Team sucht einen Main Jungle\r\n\r\nDas Team besteht bisher aus folgenden Spielern:\r\n\r\nTop: kazjon Dia 3\r\nMid: Ravenfails Dia 3\r\nJungle: gesucht\r\nADC: Ventii Plat 1\r\nSupport: Su&iacute;cide Bomber Dia 4\r\n\r\nTrainingszeiten:\r\n\r\nDienstag 18-22 Uhr\r\nMittwoch 18-22 Uhr\r\nDonnerstag 18-22 Uhr\r\n\r\nSonntags bei Turnieren oder nach Absprache\r\n\r\nWas wir von euch erwarten:\r\n\r\n-Mainrolle Jungle\r\n-DynamicQue Wertung von mindestens Diamant 3\r\n-Erfahrung im Teamranked\r\n-Einen Teamrankedf&auml;higen Championpool\r\n-Ein funktionierendes Headset + Teamspeak 3\r\n-Kritikf&auml;higkeit (im &auml;u&szlig;ern wie auch annehmen)\r\n-Zuverl&auml;ssigkeit\r\n-Aktivit&auml;t (mehr als nur zu Trainingszeiten spielen)\r\n\r\nSollten wir dein interesse geweckt haben, so kannst du dich gerne ingame bei DynD BEAG vorstellen um dich aussagekr&auml;ftig f&uuml;r einen Tryout Termin zu bewerben.","replies":[{"poster":"tahmett","date":"2017-07-04T18:53:37.300+0000","up_votes":4,"down_votes":1,"body":"Ich rate sehr von dieser hinterhältigen Organisation ab oder rate den Spielern sich hier Verträge und Versprechungen genau durchzulesen !!!\nDynamite Ducks hat den Haupthintergrund Spieler auszunehmen !\nDen Versprechungen von Sebastian aka Beag sowie Andreas aka Sarukar ist null Glauben zu schenken !","replies":[]},{"poster":"DynD BEAG","date":"2017-07-04T21:18:03.638+0000","up_votes":1,"down_votes":1,"body":"Schön Mr unbekannt hier die Lügen im Schutze der Dunkelheit aufzustellen. \n\nDer Hauptteil des Teams besteht aus Spielern die seit Jahren Teil der Community sind. \n\nIch weiß wir haben Leute die uns nicht gesonnen sind, weil wir Flamer und Leute mit kindischem verhalten direkt aussortieren. Im Endeffekt bestätigst du uns ja wieso.\n\nAllerdings Fragen sich gerade einige wie man sich Versprechungen durchlesen kann.","replies":[{"poster":"tahmett","date":"2017-07-04T21:39:07.717+0000","up_votes":1,"down_votes":0,"body":"Es ist mir bewusst, dass ihr nicht zugeben werdet, Teams um sehr viele Gelder betrogen zu haben. \n\n\"Der Hauptteil des Teams besteht aus Spielern die seit Jahren Teil der Community sind\" - Alleine diese Aussage ist eine massive Übertreibung, da die oben genannten Spieler im Dezember 2015 noch keine Mitglieder eurer Community waren. \n\nAber um zumindest allen die dies hier lesen einen Anreiz zum Nachdenken zu geben:\nDie sogenannte \"Lüge\" hat sich im Bereich von November 2015 bis Januar 2016 abgespielt, als eines eurer Teams um mehrere hundert Euro Gehälter, sowie andere Bonuszahlungen betrogen wurden. \nGlücklicherweise hat dieses Team euch rechtzeitig Verlassen, um nicht noch die Preisgelder an Dynamite Ducks zu verlieren.\n\nDes weiteren wurden diese Spieler auch betrogen, indem ihnen Verträge auf \"Die Dynamite Ducks\" ausgestellt wurden, während \"Die Dynamite Ducks\" keinerlei rechtsfähige Person waren. \nSomit waren diese Verträge auch nicht einklagbar, womit sich Andreas (Sarukar) damals sehr schön aus der Affäre gezogen hatte. \n\nWas sehr schön mitanzusehen ist, ist dein letzter Satz, welcher wohl dazu dienen soll, das Thema abzulenken und lediglich ein lächerlich perfider Versuch, nachdem du selbst wahrscheinlich das Thema gut kennst, einen Ausweg, über ein analogistisch anzusehen Satz, zu finden, welchen jeder richtig verstehen kann, wenn er im Schulunterricht den Deutschunterricht wenigstens zu 20% genossen hat.","replies":[{"poster":"DynD BEAG","date":"2017-07-04T22:09:59.888+0000","up_votes":1,"down_votes":0,"body":"Also zumindestens erklärt es sich wieso du dich verstecken musst, da deine Informationsquellen recht dürftig sind.\n\n-Den Versprechungen von Sebastian aka Beag sowie Andreas aka Sarukar ist null Glauben zu schenken !\n\nIch war zu dem Zeitpunkt nur für News zuständig und Streaming. Ich habe die Community erst nach dem verlassen des Teams übernommen. \n\nDerjenige der die Preisgelder geklaut hat, war DynD Crescam, der übrigends hinterücks mit dem Team abgehauen ist. Wir haben bis Heute noch Kontakt zu den Spielern. Die Spieler haben mittlerweile sogar ihr Geld.\n\nDynD Crescam hat bei uns Hausverbot, da wir uns von solchen Kriminellen Machenschaften distanzieren.\n\nWir sind mit dem Thema offen umgegangen und haben jederzeit Stellungnahme im TS dazu bezogen. \n\nWenn du von deiner Meinung so überzeugt bist, wieso versteckst du dich dann ? Wieso warst du nie zu einem Gespräch im TS? Wenn man doch nur Informationen von außerhalb hat und bei dem Geschehen garnicht dabei war, sollte man sich doch eher bedeckt halten.","replies":[]}]}]}]}