{"poster":"T2TheWitch","date":"2017-06-27T09:13:12.811+0000","title":"Bronzenoob sucht platin+ Spieler zur Unterstützung","subforum":"Level Up: Guides & Tipps","up_votes":3,"down_votes":0,"body":"Hallo zusammen,\r\n\r\nzu meiner aktuellen Situation: Stecke im oberen Bronzebereich fest, ab und an mal eine gute Winningstreak, war auch schon in den Silberpromos.\r\n\r\nDie Mehrzahl der low-elo Spieler kennt es, man hat oft einen Mate der afk ist oder auch mehr Tode als Farm hat.\r\nIch will mich hier keinesfalls dar&uuml;ber beklagen, dass ich nicht aufsteige weil meine Mates so schlecht sind, sondern ich suche Hilfe/Tipps um besser zu werden, damit ich eben nicht mehr diesem Mitspielergl&uuml;ck/-pech ausgesetzt bin.\r\n\r\nGrunds&auml;tzlich denke ich, dass ich das Spiel im Gro&szlig;en und Ganzen verstehe, viele Mechaniken kenne. Themen wie Rotationen, aa-canceln, Trades, objective-plays sind keine Fremdw&ouml;rter. Nur jetzt brauche ich jemanden, der mir zeigt wie ich das umsetze, der mir Tipps gibt, oder aber auch meinen Spielstil analysiert um den Champion richtigen Champion zu w&auml;hlen\r\n\r\nZu mir:\r\n24 Jahre alt, berufst&auml;tig, daher wird eher abends gespielt.\r\nMain adc/jgl.\r\n\r\nGesucht:\r\nCoach ab Platin oder h&ouml;her .\r\n\r\nIch bedanke mich f&uuml;r die Tipps und Hilfestellungen. Wer Lust und Interesse hat, soll mich ingame adden.\r\n\r\nGru&szlig;\r\nT2thewitch","replies":[{"poster":"T2TheWitch","date":"2017-06-27T11:52:08.486+0000","up_votes":2,"down_votes":0,"body":"Hallo zusammen,\n\nvorab: Vielen Dank für die Rückmeldungen und Tipps. Das Kriterium Plat+ ist\nauch nur eine Richtschnur, gesucht sind Anmerkungen von \"besseren\",\n\"erfahrenen\" Spielern.\n\nSind auf jedenfall Ratschläge die ich befolgen sollte und zum Teil auch\nmache. Wie richtig geschrieben wurde, muss man primär auf sich schauen,\ngenau das ist auch der Punkt worauf ich hinaus will. Ich will mein Spiel im\nRahmen meiner Möglichkeiten verbessern und perfektionieren. Ich muss/sollte\nmöglichst viel richtig machen. Wenn dann das Spiel durch AFK/troll verloren\ngeht, ist das so. Das passiert auf rot, wie auch auf blau in gleichen\nMaßen.\n\nKluftdeko ich danke dir und werde dich auf jedenfall mal ingame adden und\nhoffe, dass wir das ein oder andere Spiel zusammen bestreiten können. Genau\ndas ist das, was ich suche und brauche. Jemand der mir u.U. direkt auch\ningame sagen kann, was ich besser machen sollte, warum ich gestorben bin,\nob ich falsch stande, ob ich den falschen angegriffen habe oder auch was\njetzt zu tun ist. Ich will an den Punkt kommen, an dem ich zu 65-70% meine\nlane gewinne und ahead (z.b. 4:0, 5:1, +farmlead) hervorgehe und danach\nauch in der Lage bin das Spiel zu Ende zu bringen (natürlich im Rahmen\nmeiner Möglichkeiten im low-elo Bereich).\n\nBei dem Punkt mit dem OTP kann ich beiden Recht geben. Ab oberen\nGoldbereich, denke ich mit meiner bescheidenen Meinung, dass man vom\nOTP-Gedanken langsam wegkommen sollte. Spieler fangen an Picks für das Team\nzu machen, Spieler picken Counter etc. In dem Bereich, in dem ich rumdümpel\nist ein OTP dennoch nicht schlecht. Ähnlich gehts mir mit Olaf jgl. Bei\nknapp 50 Games komme ich auf ein Winrate von 63,2 %.\n\nNichtsdestotrotz sind das keine Werte, die zufriedenstellend sind und bei\ndenen man sagen kann, dass man seine Gegner in der Luft zerreist....was in\nBronze möglich sein sollte.\n\nDanke Kluftdeko..wir sprechen uns sicherlich ingame.\n\nFreue mich über weitere Hilfe, oder wenn sich jemand sogar die Zeit nimmt\nmal 1-2 Reviews anzuschauen und mir Fehler aufzeigt.","replies":[{"poster":"TwTv Kluftdeko","date":"2017-06-28T10:03:28.481+0000","up_votes":1,"down_votes":0,"body":"Ich freue mich, dass dir mein Beitrag weiterhelfen konnte und werde gerne mal ein paar Spiele mit dir machen. \n\nIch selbst habe erst ab Gold angefangen einen einen Champion zu OTPn und habe bisher nur sehr positive Erfahrungen damit gemacht. Es gibt auch sehr viele Challenger oder Masterspieler, die ebenfalls fast nur ausschließlich den selben Champion spielen(Yasuoo, Heinzman, Annie Bot etc.) was ja zeigt, dass man selbst bis in die höchste Elo mit nur einem Champion kommen kann. Natürlich ist das ein gutes Argument mit den Counterpicks, aber ich denke trotzdem, dass man wenn man einen Champion sehr gut spielen kann, auch in einem nicht so guten Matchup trotzdem noch gute Karten hat, seine Lane zu gewinnen und das Spiel zu carrien.\n\nPS.: Ich werde denke ich mal heute Abend online sein(gegen 8Uhr spätestens). Vielleicht schickst du mir nochmal eine Ingame-Einladung, da ich gestern eine abgelehnt habe, die ich nicht zuordnen konnte. Ich hoffe das bist nicht du gewesen :D","replies":[{"poster":"T2TheWitch","date":"2017-06-28T11:25:35.573+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank!\n\nHabe dir gestern eine Anfrage geschickt, es kann daher gut sein, dass du meine abglehnt hast :D\n\nIch werde dir nochmal eine senden, allerdings erst voraussichtlich morgen, heute wird es zeitlich nicht drin sein. :/","replies":[{"poster":"TwTv Kluftdeko","date":"2017-06-28T13:13:27.797+0000","up_votes":1,"down_votes":0,"body":"Ok. Dann schicke ich dir heute Abend einfach eine. \n\nDann sieht man sich die Tage ja mal in der Kluft :)","replies":[]}]}]}]},{"poster":"Pure Cynicism","date":"2017-07-06T15:11:35.436+0000","up_votes":1,"down_votes":0,"body":"Ich bin aktuell Gold I und Adc Main, denke ich kann dir kurz ein paar Tipps geben. \n\n- setze auf Early Champs, spiele keine Hypercarries wie Jinx, Twitch etc. Als Hypercarry brauchst du Peel, und Late Game ist reine Glücksache. Vorschläge gibts hier: http://imgur.com/tXoMzD7\n\n- deine KDA und CS ist ok, wobei du locker noch 20 CS pro Game mehr mitnehmen könntest im Schnitt. Daher schließe ich, dass du die Games im Late Game durch dumme Catches oder Misspositioning throwest. Steh als Adc immer hinten und greife stumpf deinen nächsten Gegner an. Wenn das der Sion mit 5k HP und 300 Armor ist, ist das halt doof, aber nicht zu ändern. Renne niemals mitten in den Teamfight, um den Carry zu focussen. Sogar Supporter können Adcs oneshotten. Du hast als Adc zwei Aufgaben: Überleben und falls möglich Schaden. Aber Überleben ist immer wichtiger. Wenn ein Teamfight zu Ende geht, gewinnt meist das Team, das noch einen Adc hat.","replies":[]},{"poster":"KleinTyli","date":"2017-06-30T21:07:17.945+0000","up_votes":1,"down_votes":0,"body":"OTP ist grundsätzlich besser als zu viele verschiedene Champs zu spielen.\n\nTrotzdem finde ich aber auch dass man eine gewisse Vielfalt mitbringen sollte.\n\nFalls mal der OTP champ gar nicht in die Teamcomp  passt , oder irgendwann mal plötzlich OP ist und ständig weggebannt wird.","replies":[]},{"poster":"Dâfuq","date":"2017-06-27T16:10:31.511+0000","up_votes":1,"down_votes":0,"body":"Ich hab mir mal deine champion statistiken angeschaut... Für Bronze ist das schon ziemlich gut was die KDA angeht. Die Frage ist jetzt einfach warum du trotz sehr guter KDA als ADC die Mehrzahl der Spiele verlierst. Ich vermute du machst Fehler im Mid bis Lategame wie etwa nicht groupen / mit Team pushen und jagst stattdessen kills oder CS nach (was deine gute KDA trotz hoher lossrate (41% auf twitch) erklären würde)...\n\nDeine Olaf winrate/kda ist auch sehr gut. Der schnellste Weg aus Bronze zu climben wäre einfach Olaf  als OTP zu spielen bis du keine Lust mehr drauf hast oder dein winrate unter 50% fällt. Als OTP kann man sehr wohl bis Dia spielen (bin selber fiddle Mid OTP und war seit s3 jede season min. d5). Solltest du ADC spielen wollen versuche mehr Wert auf Mid/Lategame Objectives wie Baron/Dragon und Türme zu setzen. Ich hab dich mal geadded, dann können wir mal 1-2 Runden spielen.","replies":[{"poster":"T2TheWitch","date":"2017-06-27T19:42:54.906+0000","up_votes":1,"down_votes":0,"body":"Hi,\n\nvielen Dank für das Lob und gleichermaßen für die Kritik.\n\nIch behaupte, dass ich mit Olaf recht weit kommen könnte, doch ab und an will ich doch mal einen anderen Champ spielen. Des Weiteren geht es mir darum allgemein in dem Spiel besser zu werden.\n\nTwitch ist auch der Champ mit dem ich am Meisten gespielt habe, sowohl adc, als auch Jgl. Trotzdem kann ich damit nicht wirklich das Spiel entscheiden. Was muss ich da besser machen?\n\nDenke das ist ein Punkt, der mir ebenfalls aufgefallen ist. Ich schaffe es nicht mein Team zu lenken und meine Überlegenheit dem anderen adc gegenüber auszuspielen. Was muss ich tun sobald der erste Turm fällt? Wann muss ich zum Team, wann besser weiterfarmen? Mir ist bewusst, dass es dafür keine allgemein gültige Antwort gibt, doch sicherlich kann der ein oder andere mir ein gutes Gespür verschaffen.","replies":[{"poster":"TwTv Kluftdeko","date":"2017-06-28T09:56:55.299+0000","up_votes":1,"down_votes":0,"body":"Meiner Erfahrung nach kann man durch das OTPn von einem Champion schneller Sachen wie Objective-Controll etc lernen. Das kann zwar für jeden persönlich anders sein, aber für mich lerne ich wesentlich schneller, wenn ich nicht so viel über die Mechanics des einzelnen Champions konzentrieren muss. \nDie Spielmechanik eines Champions lernt man meist schneller, da mein sich einfach einmal alle Skills genau durchliest und überlegt, welche Kombinationen der Skills den meisten DMG austeilen können. Wenn man das einmal weiß, dann braucht man sich nicht mehr darauf konzentrieren und kann somit während des Spiels besser Wert auf Objectives, Teamfights, Warding oder so legen. \n\nDie Championmechaniken werden in den meisten Fällen für einen Bronzespieler auch nicht der Grund sein, warum man in Bronze hängt. Vielmehr wissen viele die angesprochenen Punkte nicht richtig umzusetzen, weshalb sie nicht aus Bronze herauskommen.","replies":[]}]}]},{"poster":"TwTv Kluftdeko","date":"2017-06-27T09:47:42.370+0000","up_votes":1,"down_votes":0,"body":"Ich bin zwar kein Platinspieler oder höher(nur Gold 3 im Moment), habe mir aber in letzer Zeit auch Tipps von einem Platin 2 Spieler geben lassen und seitdem läuft es für mich viel besser im Solo q als vorher. Daher würde ich dir einfach mal die Sachen auflisten, die er mir empfohlen hat und die sich für mich persönlich zu einem besseren spielen geführt hat. \n\n1) Lege dich auf eine Position und auf einen Champion fest, der \n       - dir erstens Spaß macht\n       - dir zweitens Erfolg bringt.\n\nIch habe zuvor hauptsächlich xADC und als zweite Position Jungle gespielt . Auf der ADC-Position habe ich je nach Matchup meine Champion gewählt und im Jungle habe ich das gespielt worauf ich grade Lust hatte(meistens Lee Sin). Der Nachteil daran war, dass ich auf keinem Champion mit der Zeit die Grundlagen des Champions verinnerlichen konnte und deshalb mich nicht auf die wichtigen Dinge konzentrieren konnte(wie auf die Map schauen, Warding etc.).\nIch war einfach zu sehr mit dem Champion ansich beschäftigt, da ich in den wenigen und unregelmäßigen Spielen einfach keine Routine entwickeln konnte. Seitdem ich nurnoch Gragas im Jungle spiele, den ich ebenfalls vorher ab und zu gespielt habe, habe ich meine Winrate auf diesem Champion von nur 44% auf 59% erhöhen können und bin innerhalb kurzer zeit von Gold5 auf Gold3 gestiegen(ich denke das wird auch so weiter gehen).\n\n2) Mach den Ingame-Chat immer aus\n\nIch denke du kennst das: Deine Teammates schreiben irgendeinen Schwachsinn in den Chat den man sich während des Spiels durchliest und einen selbst vom eigentlichen Spiel ablenkt. Ich habe persönlich noch nie etwas im Chat gelesen, dass mir im Spiel wirklich weitergeholfen hat. Die Pings, die man wesentlich schneller dem Team schicken kann, reichen an Information vollkommen aus, besonders nachdem man sogar Cooldowns von Summonerspells oder der Ultimate senden kann. Der Chat bringt einen persönlich meistens nur zum tilten und man gibt schneller Spiele auf, die eigentlich noch gewonnen werden können.\n\n3) Konzentriere dich auf deine eigenen Fehler\n\nDaran tue ich mich ehrlich gesagt auch oftmals schwer, da man manchmal Troller im Spiel hat, AFKs oder ähnliche Leute, die einem ein Spiel versauen. Aber es ist nicht so, dass die Gegner nicht dasselbe Problem hätten. Es ist wahrscheinlicher, dass im Gegnerteam ein Troller etc ist als in deinem eigenen Team, wenn du selber keiner von diesen Leuten bist(du hast 4Randoms und im Gegnerteam sind 5). Es kann zwar sein, dass man mal ein paar Spiele hintereinander Pech mit seinen Teammates hat, aber wenn man so 200 Games insgesamt gespielt hat und immernoch eine negative Winrate im Ranked hat, dann sollte man doch mal anfangen zu überlegen, ob man selber nicht vielleicht das Problem ist.\n\n4) Verbessere deine Teammates nicht\n\nWenn man sieht, dass ein Teammate etwas aus der eigenen Sicht falsch macht, dann sollte man ihn einfach machen lassen. Die wenigsten nehmen sich den Tipp zu Herzen. Die meisten reagieren einfach nur genervt, welch sie denken: \"Der Idiot ist nicht besser als ich. Wieso sollte ich auf ihn hören.\" Da wäre man dann auch wieder bei Punkt 2(CHAT AUS!), dann kommt man gar nicht erst in Versuchung diese Tipps loszuwerden. Und die Zeit, die man daran verschwendet einem Teammate einen Tipp zu geben, den man sowieso nie wieder im Spiel hat(bei den Millionen von Spielern) kann man besser dafür nutzen um seine eigenen Fehler zu finden, da man ja in jedem Spiel von sich vorhanden ist und somit auch den größten Einfluss die Gesamtheit an Spielen hat ;).\n\nIch hoffe, ich habe dich hier jetzt nicht vollkommen Überrannt mit Text und dass du einfach mal über das nachdenkst, was ich geschrieben habe. Mir haben die Tipps nämlich ebenfalls geholfen, nachdem ich versucht habe diese zu befolgen(und das klappt nicht immer).\n\nViele Grüße, Klufdeko\n\nPS: Kannst mich ja adden, falls du Lust hättest ein wenig zu Spielen um besser zu werden. Das ist nämlich auch grade mein Ziel :)","replies":[{"poster":"ü ö","date":"2017-06-27T10:19:21.983+0000","up_votes":1,"down_votes":0,"body":"Dem ersten Punkt würde ich definitiv nicht zustimmen, ein OTP sein reicht normalerweise nicht. \n\nCleverer wäre es, mindestens 2 (wegen Offrole) Positionen zu beherrschen mit je 3-4 Champs (Bans, Matchups etc.)\n\nRest passt aber ganz gut.","replies":[{"poster":"TwTv Kluftdeko","date":"2017-06-27T10:31:47.344+0000","up_votes":1,"down_votes":0,"body":"So wie du das verstanden hast war das auch nicht gemeint. Es war so gemeint, dass man eine Hauptposition hat(in meinem Fall Jungle). Und immer wenn man diese Position bekommt und die Möglichkeit dazu hat seinen einen Hauptchampion zu spielen diese auch nutzt. Natürlich muss man auch eine Zweitposition haben(in meinem Fall adc), da man ja sowieso 2 Lanes auswählen muss um überhaupt rankeds spielen zu können. Und für diese Position hat man ebenfalls einen Champion, den man in dem Fall spielt. \nEinen Supporter, den man einigermaßen spielen kann, sollte man auch besitzen, da man ja mal outofilld wird.\n\nSo hätte man das Problem mit Offrole gelöst. Matchups beachte ich in meinem Fall garnicht, da es als OTP eigentlich keine Matchups gibt, die man nicht Meistern kann. Man kennt seinen eigenen Champion und deren Schwächen wie Stärken so gut, dass man jedes Matchup mit der Zeit einschätzen kann und weiß, wie man sich zu verhalten hat.\n\nAls Vorteil kann sich auch herausstellen, einen Champion als sein OTP zu wählen, der nicht im Focus der allgemeinen Community steht. Ich spiele im Moment ausschließlich Gragas Jungle und dieser wird weder gebannt, noch oft gepickt. Schwach ist dieser Champion ebenfalls nicht und macht meiner Einschätzung nach sogar sehr viel Spaß zu spielen(also ein perfekter OTP Champion).\n\nDanke für das positive Feedback meines Beitrages. Hat mich gefreut :)","replies":[]}]}]}]}