{"poster":"OlafRagnarson","date":"2015-11-06T00:03:36.873+0000","title":"Perfect Aatrox Buffs","subforum":"Gameplay","up_votes":38,"down_votes":10,"body":"I have TONS of ranked matches with him (700).  80 percent of the time, at least, I win my lane easily. Sometimes we go on to win the game, and sometimes my team has no idea how to take advantage of me snowballing. Sometimes I play bad in team fights because I&#039;m red/green color blind and I lose track of where my cursor is on some days.  Riot has yet to bother to allow players to change the god damn color of the cursor--as if that would be SO hard to do. Anyways....\r\n\r\nAatrox is very strong in lane, and very strong in team fights. He can do very well in many team comps, and sometimes carry and end the game in 30 minutes.\r\n\r\nI see many suggestions. Some from myself. The thing is, he is just on the cusp of being OP.  But instead of him being OP, he instead has been doomed to be under-powered.  Neither are good.\r\n\r\nHis main point is sustain. That is what makes Aatrox Aatrox. However, if he gets busted down he can&#039;t sustain. If he gets crowd controlled he cant sustain.\r\n\r\nI really do like him a lot where he is at....but he is pulled in too many directions. He needs AD for his W...but he needs armor to not be squishy, but he needs tenacity and attack speed so CC doesn&#039;t kill him, but he also needs life steal to offset the cost of his Blood Price  (meanwhile, Jax gets to do bonus damage passively with every 3rd hit with no cost...yeah, that&#039;s fair).\r\n\r\nFurthermore, he is very dependent on landing that Q, which as a very small area of impact and has a pretty long cool down compared to other champions CC, such as Riven.\r\n\r\nThe solutions are simple and reasonable:\r\n\r\n1)Blood well grants attack speed but ALSO, bonus tenacity depending on how full it is\r\n\r\n2)Dark Flight Knock up radius and cool down remains the same, but enemies in the larger radius are stunned for 0.5 seconds\r\n\r\n3)His Blood Price/Blood Prince toggle should be immediate. Too many times you think you toggled it, but you were CCed at the same time...and you have the wrong one one etc. Its super annoying since you literally can lose a fight because you bonus damaged instead of lifestole or visa-versa\r\n\r\n4)Blades of torment can stay as they are\r\n\r\n5)Ult rework. Aatrox draws in the blood of his foes, dealing magic damage to nearby enemy champions and filling his Blood Well filling Blood Well by 20% of its maximum value for each enemy hit and forming a blood magic shield absorbing damage\r\n\r\nBlood Shield (10% of max health x number of enemies hit)\r\nMagic Damage: 200 / 300 / 400 (+ 100% AP)\r\nAdditionally, Aatrox gains bonus attack speed and attack range for 12 seconds.\r\nAttack Speed: 40 / 50 / 60%\r\n\r\nThese changes keep his play mechanics the same for the most part. The blood magic shield rewards team fighting. Notice that the bonus shield would only be 200 if he was fighting 1v1 while at 2000 hp. Its a small buff at that point, a moderate one 1v2 and a strong one in a full on team fight with a well placed ult.\r\n\r\nThis is the most reasonable solution that I have come up with. It keeps his play mechanics, makes him a little less susceptible to CC, gives him a tiny bit more CC and gives the player a reason to build HP and provides incentive for team fights and rewards well timed ults.","replies":[{"poster":"Meddler","date":"2015-11-06T07:29:48.779+0000","up_votes":28,"down_votes":3,"body":"Thanks for the well written post. I don't personally feel that significant buffs like those proposed are appropriate for Aatrox (he's got some issues, satisfaction in particular, but I don't believe he's overall weak). The suggestion of making W useable while CC'd on the other hand's an excellent one and something we'll add to Aatrox and other characters with similar toggles (no meaningful CD abilities that don't consume resources on toggle/while toggled or do anything passively while toggled).","replies":[{"poster":"Wulfy","date":"2015-11-06T08:16:56.465+0000","up_votes":5,"down_votes":0,"body":"Such as Jinx Q?","replies":[{"poster":"MarimbaMaster","date":"2015-11-06T08:57:08.084+0000","up_votes":4,"down_votes":1,"body":"Yeah that sounds like Jinx Q, Aatrox W, Jayce R, Nidalee R, etc.","replies":[{"poster":"Meddler","date":"2015-11-06T09:32:34.377+0000","up_votes":17,"down_votes":0,"body":"Yes on Jinx Q, plus Cho'gath E. No on the transforms, since those have both some immediate effect and an at least slightly meaningful cooldown.","replies":[{"poster":"Penns","date":"2015-11-06T10:39:35.439+0000","up_votes":4,"down_votes":1,"body":"I kind of wonder why Trynda can cast his ult while CCd then. Like it makes sense on all the other champs that can do this ({{champion:74}} {{champion:43}}.. ) since they would have to spam 2 buttons for 1 ability... but {{champion:23}} ? ._.","replies":[{"poster":"Wolfeur","date":"2015-11-06T13:45:00.970+0000","up_votes":4,"down_votes":1,"body":"Both thematically and balance-wise.\n\nTrynd's ult is supposed to be his absolutely unstoppable rage, no matter what happens to him, he can't be stopped.","replies":[{"poster":"BeatzBoyFTW","date":"2015-11-06T14:15:24.684+0000","up_votes":2,"down_votes":3,"body":"{{champion:54}} Ult's labeled \"Unstoppable Force\", and can still be prevented by being Silenced or Stunned.","replies":[{"poster":"Rysophage","date":"2015-11-06T14:21:32.148+0000","up_votes":14,"down_votes":1,"body":"Yasuo's ult is named last breath but people still come out of it alive","replies":[{"poster":"Ariel the Cruel","date":"2015-11-06T19:36:32.366+0000","up_votes":3,"down_votes":0,"body":"{{champion:9}} Technically,\n{{champion:3}} I don't\n{{champion:101}} need to\n{{champion:54}} breathe.","replies":[]}]},{"poster":"DrCyanide","date":"2015-11-06T18:03:23.992+0000","up_votes":5,"down_votes":0,"body":"The CC made it an Un**Start**able Force, not an Un**Stop**able Force. Once he's going he isn't stopped.","replies":[]},{"poster":"Narasimha","date":"2015-11-06T18:14:21.337+0000","up_votes":2,"down_votes":0,"body":"Fun fact, it IS Unstoppable.\n\nWhen he's doing it. If he's just sitting there, then it's not really a force, is it?","replies":[{"poster":"IcyPepper","date":"2015-11-07T00:08:33.375+0000","up_votes":1,"down_votes":0,"body":">If he's just sitting there, then it's not really a force, is it?\n\nAccording to Newton's Second Law, then yes. Unstoppable Force makes sense since you cannot stop his acceleration (which has equal magnitude to the force) in either direction as he ults.\n\nYou can only stop him before and after his ult is done accelerating him in both directions.","replies":[]}]},{"poster":"Wolfeur","date":"2015-11-06T16:10:00.742+0000","up_votes":1,"down_votes":0,"body":"The goal of his ult is to engage in a fight. Trynd's ult is for survival.","replies":[]}]}]}]},{"poster":"Dark Trennow","date":"2015-11-06T21:16:30.146+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=NIEd1mBL,comment-id=0004000000000000,timestamp=2015-11-06T09:32:34.377+0000)\n>\n> Yes on Jinx Q, plus Cho'gath E. No on the transforms, since those have both some immediate effect and an at least slightly meaningful cooldown.\n\nMeddler, how do you feel about Aatrox's ult? Im a huge aatrox fan, hes my favorite champ. His ult has always been unique IMO, but it can feel really underwhelming at times or overbearing for the opponent, since most people don't realize its range extent or the steroid bonus. Do you think he could get more of a benefit from it?","replies":[]},{"poster":"AMYS GRAVE","date":"2015-11-06T16:00:55.749+0000","up_votes":1,"down_votes":0,"body":"amumu tears?\n\nbasically if you can switch it without breaking recall animations it gets changed? ","replies":[{"poster":"Narasimha","date":"2015-11-06T18:15:01.946+0000","up_votes":1,"down_votes":0,"body":"I would probably say no, since that does do damage by itself.","replies":[{"poster":"AMYS GRAVE","date":"2015-11-06T19:53:03.442+0000","up_votes":1,"down_votes":0,"body":"You're probably right, but imo if you can toggle it while recalling then it feels legit to be able to toggle it while under cc. \n\nIn the case of amumu tears maybe just be able to toggle it off but not back on until the cc wears off? I've definitely had it where i got cced under turret and my tears drew turret aggro because of it. Maybe that's just good play on the other team but it kinda feels like bs to draw turret aggro without being able to stop it. just my opinion though.","replies":[]}]}]},{"poster":"Sohleks","date":"2015-11-06T19:47:19.903+0000","up_votes":1,"down_votes":0,"body":"Isn't that an actual tangible buff for Jinx if she could switch guns during CC though? ( switching to mini to duel if jumped) Unlike Cho or Aatrox, Jinx gun switching has a short animation intended to interrupt her attacks very briefly?\n\nThough maybe Jinx can learn to swap in the heat of combat better.","replies":[]},{"poster":"pripustas","date":"2015-11-06T15:47:38.001+0000","up_votes":1,"down_votes":1,"body":"Just please don't do that for Elise. She is extremely powerful as it is, we don't want her spamming rappel every time she gets caught. That counts for every single hybrid champion (Jayce knockback, Nidalee jump) that would be a buff, rather than a QOL change.","replies":[{"poster":"darkdill","date":"2015-11-06T17:56:24.835+0000","up_votes":1,"down_votes":0,"body":"They won't for Elise. Changing to her Spider form has a meaningful cooldown and changes up her abilities. It also summons her Spiderlings, which can defend her while she's CC'd.","replies":[]}]},{"poster":"darkdill","date":"2015-11-06T17:55:52.230+0000","up_votes":1,"down_votes":0,"body":"You'd have to have it so that Jinx can't swap while Silenced, though. Otherwise it'll make the effect somewhat pointless against her.","replies":[]}]}]}]},{"poster":"MasterVidallis","date":"2015-11-06T15:21:38.049+0000","up_votes":4,"down_votes":0,"body":"Aatrox may not be very weak but he sees very little play, specially at higher ranks. So I don't agree that he doesn't need some significant changes, maybe not all buffs but he needs a small rework. I like him thematically and have tried to play him often and make him work so I'll tell you what makes him, as you said, _not satisfying _to me.\n\nAatrox doesn't know what it wants to be. His W says sustained damage duelist. But he has neither the hyper mobility or inherent tankyness of other champions that are auto dependent duelists like Shyvana, Xin, Yi and Olaf. Equally fed those champions will all do your face in during an extended duel. Against ranged he is too easily kited to survive extended fights. On the other hand all the instant high damage and long cooldowns on the rest of his kit seems to make you want to stack AD and focus on bursting.  But since he doesn't have the escapes an assassin does though he needs to build some tank or die too quickly in teamfights if you attempt to burst their backline.\n\nSo his kit seems to be asking you to build sustain, high ad, mobility and tank all at once just to work, and since you can't do that all at once he just  ends being not that good at anything unless you get really fed early. He has enough to make an impact, but it's  rubber-banded by really good sustain during the laning phase and the passive, whatever he can do in actual teamfights and duels there are other champions who can just do it better, there is nothing about him that makes you want to bring him over someone else for the team other than specifically just wanting to play him.\n\nPersonally I feel like with his limited mobility, kit and thematics you should make him into a proper tank/fighter. So lower the burst damage on the Q, remove the damage on the R on cast and lower the W damage proc and make him significantly more naturally tanky. The remove the attack speed on his ult so he isn't so reliant on building AD, and give him some something to make him a better engager. Maybe his ult could drain a percentage of life from everyone around him while slowing them or something like that. So that when you pick him you think, we need a sustain damage meat shield that's annoying to kill and will do well against health stacking teams. Some kind of niche or purpose.","replies":[]},{"poster":"OlafRagnarson","date":"2015-11-08T16:52:48.189+0000","up_votes":1,"down_votes":0,"body":"What makes you think he's not weak? He has less staring health than Ahri or Akali! He's not played much at low levels, hes not played much at high levels. \n\nHe can go great if you are amazing with him and the team conditions are just right.  Otherwise, you are behind the curve.\n\nI have 700...SEVEN HUNDRED...ranked matches with him. I've tried every possible combo of builds/runes/masteries. He is just not up to snuff.","replies":[]},{"poster":"OlafRagnarson","date":"2015-11-07T00:34:10.421+0000","up_votes":1,"down_votes":0,"body":"Well like I said, I do rather like him where he is at. Its just little things such as  W toggle and and ult that is a little underwhelming, since if you miss with the AoE its basically just attack speed.\n\nBut I have to ask, why don't you think those buffs are appropriate? Why does Jax get passive damage with his ult? Why does Riven get a lower CD on her Q and not even need mana, let alone costing health? \n\nWhy does he have less starting health than Ahri or Akali?\n\nIt just seems like he gets the short end of the stick because he has sustain and a revive.  If he stops attacking he can't sustain, but if hes not careful  he gets killed fast...yet he needs to keep attacking to sustain, but if he dies and revives his attack speed bonus is gone making it hard to sustain....it puts him in tough spot all the time. \n\nI feel like my opinion should carry some weight regarding all of this. I have tried so many build/rune/mastery combos its insane over the 700..SEVEN HUNDRED...ranked matches. Conclusion: He needs a little bit of help.\n\nThe other suggestion would be is to simply reset the cool down on his Q and E upon activating his ult. That would add so much functionality to him.","replies":[]},{"poster":"NightOfLight","date":"2015-11-07T00:04:39.641+0000","up_votes":1,"down_votes":0,"body":"Why not do something minor like lower the healthcost for the w bonus damage and his e  and see if he will see more play.","replies":[]},{"poster":"Zydron","date":"2015-11-06T15:45:45.393+0000","up_votes":1,"down_votes":0,"body":"Is the buggy interaction with his w and devourer going to be fixed too? Or is it already fixed, idk","replies":[]},{"poster":"pripustas","date":"2015-11-06T15:41:04.451+0000","up_votes":1,"down_votes":0,"body":"I'm sorry, but have you played Aatrox recently? I know he's decent at best with sated, but he's so bad in top lane. Yes, he can sustain for a very long time, but he can't duel anyone really, unless enemy is bad, or he gets some amazing action from ganks. I even made a thread about my recent experience where I wasn't able to 1x1 a Twitch while having better items, and him not even trying to kite or dodge my stuff. He just stood there auto attacking me, and I wasn't able to kill him. Melee champions should be rewarded for getting close, but Aatrox isn't, and he has to deal 10% of true damage to himself, to get to you.","replies":[]}]},{"poster":"Dunkrius2g","date":"2015-11-06T01:41:26.900+0000","up_votes":7,"down_votes":1,"body":"2 things that might help him. When he Q, he is immune to cc. When he ults, there is no animation so that the amount of time he couldve spent with that 1 or 1.5 sec, could be spent aa 2 or 3 times.","replies":[{"poster":"OlafRagnarson","date":"2015-11-06T01:51:07.582+0000","up_votes":4,"down_votes":0,"body":"Yes, I thought about that. It would make his dive a fail safe escape though. That might be too much. I am a fan of certain things not affecting him while he is in flight, but some things should.","replies":[{"poster":"Skias","date":"2015-11-06T18:15:53.514+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=darkinlegend,realm=NA,application-id=3ErqAdtq,discussion-id=NIEd1mBL,comment-id=00020000,timestamp=2015-11-06T01:51:07.582+0000)\n>\n> Yes, I thought about that. It would make his dive a fail safe escape though. That might be too much. I am a fan of certain things not affecting him while he is in flight, but some things should.\n\nThe problem you run into is, if ahead hes like a brick wall. This leaves even smaller windows to fight back and match him. Vlad is the same. When ahead, hes absolutely crazy to try and beat. Its just the crux of being a drain fighter. When ahead, they are super frustrating and when behind are completely unsatisfying.","replies":[]}]}]},{"poster":"thumbnail9","date":"2015-11-06T14:11:22.167+0000","up_votes":1,"down_votes":1,"body":"Meddler thinking personally instead of objectively. \n\nThe only problem I have with those changes is that shield gets too big for how much damage the ability does.","replies":[{"poster":"OlafRagnarson","date":"2015-11-06T23:34:17.008+0000","up_votes":2,"down_votes":0,"body":"I never liked the AoE magic damage...but if hes drawing in their blood, it makes sense that it should damage them.  We cold also do soemthing like a shield of 100/150/200 +.20% for each enemy hit.  So something like 200 x .60 if he hits three enemies he would get a shield of 320.","replies":[{"poster":"thumbnail9","date":"2015-11-07T00:39:03.074+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=darkinlegend,realm=NA,application-id=3ErqAdtq,discussion-id=NIEd1mBL,comment-id=00090000,timestamp=2015-11-06T23:34:17.008+0000)\n>\n> I never liked the AoE magic damage...but if hes drawing in their blood, it makes sense that it should damage them.  We cold also do soemthing like a shield of 100/150/200 +.20% for each enemy hit.  So something like 200 x .60 if he hits three enemies he would get a shield of 320.\n\nThat is much more reasonable. All in all these changes would be pretty decent.","replies":[]}]}]},{"poster":"Carlos Archer","date":"2015-11-06T00:58:54.839+0000","up_votes":3,"down_votes":1,"body":"DONE\nalso\nI had a game not long ago, I was aatrox, the other top was trundle, I got a botrk, he had only a cutlass and 2 daggers, I charged my well and went for the kill w/ult on....\n\nHe procd my passive and I had to flash away...\n\njust my experience with a champion I used to love. T_T","replies":[{"poster":"OlafRagnarson","date":"2015-11-06T00:59:37.650+0000","up_votes":1,"down_votes":0,"body":"Did he have his ult?","replies":[{"poster":"Carlos Archer","date":"2015-11-06T09:20:06.225+0000","up_votes":1,"down_votes":0,"body":"Yes but that shouldn't matter if i over-itemize him, he did NOT outplay me, both champs are right clickers and this only shows that trundle is stronger objectively.","replies":[{"poster":"elon wątroba","date":"2015-11-06T10:54:13.774+0000","up_votes":2,"down_votes":1,"body":"Trundle is a duelist, which steals your ad, armor and mr, while draining your max hp.","replies":[{"poster":"Abyssphere","date":"2015-11-06T11:29:11.069+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zuom,realm=EUNE,application-id=3ErqAdtq,discussion-id=NIEd1mBL,comment-id=0001000000000000,timestamp=2015-11-06T10:54:13.774+0000)\n>\n> Trundle is a duelist, which steals your ad, armor and mr, while draining your max hp.\n\nI think the problem here is that Aatrox is supposed to be a duelist too. Agreed that Trundle should win most duels he takes part in, but if Aatrox was working as intended he probably should too. The item difference probably should have ensured a win.","replies":[{"poster":"TDubH","date":"2015-11-06T14:58:28.814+0000","up_votes":2,"down_votes":0,"body":"No, it should've, saying \"they're a duelist, the one with more gold should win\" is stupid if it was that way it'd be one dimensional and boring to all hell...\nAatrox has generically strong power maintained, he starts as an OK duelist and ranks to a somewhat good duelist depending on his passive being up\nTrundle has a very low power maintained but a very high switch point, he goes from, OK duelist being able to steal AD and have an AD steroid to stealing % health, armor and MR for several seconds, at that point ANYONE should lose to him... at that point Aatrox walks away, uses W to lifesteal up, and THEN uses his stronger power level to defeat trundle... \n\nTake a different match up...\nJax Vs. Yi (something i have a bit of experience with)\nYi's ult will turn yi into a better duelist than jax with his ult, especially if yi dodges jax's counterstrike\nhowever what jax does is \"counterstrike\" yi responds \"alphastrike\" jax respons \"Leaping strike away\" Yi responds with \"crud i can't catch up right now.\" after both ultimates are down jax is a stronger duelist than yi due to counterstrike and his enhanced damage it doesn't matter if i have botrk over his Cutlass/dagger he's inherantly stronger than i am while highlander is running, but i know that i am inherantly stronger if i can get rid of highlander.... \n\nthats what makes duelists duelists because per different points each duelist has either points where they're constantly good at dueling or EXTREMELY good at dueling at certain points,\nThe latter (trundle) will beat out the former (Aatrox) if he is at his certain point even if there is a 1350 gold difference in items","replies":[]}]},{"poster":"OlafRagnarson","date":"2015-11-06T23:39:07.721+0000","up_votes":1,"down_votes":0,"body":"Exactly. Trundles ult fucks attrox hard.","replies":[]}]},{"poster":"OlafRagnarson","date":"2015-11-06T23:39:42.109+0000","up_votes":1,"down_votes":0,"body":"I never EVER try to 1v1 Trundle when he ults unless I am a couple of levels ahead or more!","replies":[]}]},{"poster":"ABcmaSter","date":"2016-02-16T01:07:32.147+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=darkinlegend,realm=NA,application-id=3ErqAdtq,discussion-id=NIEd1mBL,comment-id=00010000,timestamp=2015-11-06T00:59:37.650+0000)\n>\n> Did he have his ult?\nwell one thing that i still have a problem with is that he still doesnt have anything that fits his lore that has to do with buffing allies. Maybe when aatrox's allies are withing a certain radius of aatrox they get the base stats of the blood thirst affect _**flat**_. This doesnt scale with anything and you do not get the 200% increase healing below half health if ur an ally. Whatever the base stats of blood thirst are at level one they heal every 3 attacks. Not sure if this is great so i want you to hear me out if this is a good idea to fit his lore thing a little better.","replies":[]}]}]},{"poster":"ABcmaSter","date":"2016-02-16T01:09:49.907+0000","up_votes":1,"down_votes":0,"body":"With aatrox q i think what can be done is that when he is rising from the ground he becomes untargetable, and when he comes slamming down again, he becomes targetable quickly. This can help aatrox engage better without fear of getting knocked back, but also can reward players who are fast enough to knock him down as soon as he starts landing","replies":[]},{"poster":"junglerboy16","date":"2015-11-06T14:54:48.149+0000","up_votes":1,"down_votes":0,"body":"I would actually change a few things around with this:\n\n* Passive:\n * Adding tenacity is a really good idea, helps reinforce his identity as the fighter that just keeps on fighting eternally. Something like 30/35/40/45/50/55% bonus tenacity *when at max blood well*. This may seem huge (because to be honest, 55% *is* huge) but the majority of the time he will not be at full blood well (usually more like 2/3rds from what I tend to see), and this also rewards enemies for proccing his revive, thus draining his tenacity.\n * I would suggest actually increasing his Attack speed bonus significantly at later levels, say 30/45/60/75/90/105%, and then *remove* the AS bonus from his ult.\n\n* Q:\n * I think the primary issue with this ability is that it feels so unreliable that you don't want to use it in a fight because of how vulnerable it makes you. Instead of adding a micro-stun, the dash animation should be shortened so that the ability completes more quickly. He'd still be interuptible (healthy play for enemies trying to stop an engage) but it is less punishing and unfair to the Aatrox (you would know that if they interrupted you, it was because they read you well and reacted quickly).\n\n* W:\n * I think rather than just being \"immediate\" (i.e. no delay between the two stances), what you mean is that it should be toggleable while under the effects of CC, like how Heimerdinger and Karma can activate their ults while CCed because it doesn't provide any immediate effect. This is a good idea and I really like it.\n * The one thing about this that has always really irked me is that the health cost is relative to his bonus AD, which heavily discourages building as any sort of threatening late game DPS fighter. Instead it should cost a flat base plus a % of his current health, much like any of his other abilities.\n * The last thing is that I think his normal heal should only be *doubled* when below 50% health, but also heal him for a % of his bonus health. This system allows damage Aatrox to coexist with drain tank Aatrox in a healthy way, since DPS Aatrox would be allowed to deal damage if he weren't healing so much, and Tank Aatrox would be allowed to exist since his sustain wouldn't be linked solely to his offensive capabilities. This separation is essential to making Aatrox healthy and not the current binary \"either OP as hell or trash tier UP\" champ he is.\n\n* E:\n * Yeah, this seems fine by my book.\n\n* R: \n * I love the blood shield idea, but up to 50% max health as a shield on a relatively offensive champ seems like a bit much. Maybe instead have it at more like 7%? Also, is your intent that this shield lasts as long as the rest of his ult?\n * I feel like there is a really missed opportunity to incorporate some team buff style gameplay that would tie in nicely with his lore. Maybe he could create an aura around himself where he heals for any damage his allies deal, or his allies deal bonus damage based on some of his stats, or a combination of those types of effect? You could also go for some sort of enemy debuff, like \"Aatrox's attacks and abilities during this time mark enemy units, causing his allies who attack a marked enemy to deal bonus damage equal to X stat (i.e. % of his bonus AD, or % of his max health, or % missing health, etc.), consuming the mark.\n *As I mentioned before, I think his Ult should not have AS on it anymore. Having two mediocre AS buffs generally feels worse than having one significantly powerful steroid of equivalent strength.","replies":[{"poster":"OlafRagnarson","date":"2015-11-06T23:30:44.478+0000","up_votes":1,"down_votes":0,"body":"I would suggest the shield last as long as his ult or until depleted. If we perma increase his passive attack speed buff, we could add an aura during his ult for his teammates benefits.\n\nWell, if has 2000 hp and gets 200 shield from his ult x5 if he hits all enemies...so yes, that would be 1000 or 50% of his health. It is a lot...but how many times will he actually be able to hit all 5? \n\nThe other option would be to just include an attack speed bonus for nearby champions and reset the cool down on his Q and W upon activating his ult.","replies":[{"poster":"junglerboy16","date":"2015-11-07T00:37:45.032+0000","up_votes":1,"down_votes":0,"body":"Yeah, I was unclear, I meant 7% max health shield per person, or 35% max health for all 5, which feels much more reasonable. Using your 2k HP example, that's a 700 HP shield as opposed to 1000. To me at least it feels like a more realistic value.","replies":[{"poster":"OlafRagnarson","date":"2015-11-07T00:38:43.090+0000","up_votes":1,"down_votes":0,"body":"Yeah, I agree.","replies":[]}]}]}]},{"poster":"MAN OF INTELLECT","date":"2015-11-06T23:53:47.043+0000","up_votes":1,"down_votes":0,"body":"Keep in mind, Aatrox WILL need buffs soon given all of the grievous wounds effects and items that are coming through. The shield is a nice touch, but I'm not too keen on adding CC to Aatrox's kit with the Q... the tenacity is nice though. Overall, this was a well thought-out post. Good job.","replies":[{"poster":"OlafRagnarson","date":"2015-11-06T23:58:01.104+0000","up_votes":1,"down_votes":0,"body":"The tenacity bonus would be my 1st choice if I could only have one of the buffs I listed.","replies":[]}]}]}