{"poster":"Rexxiee","date":"2018-07-23T17:27:01.298+0000","title":"As much as you guys complained about adcs and supports, they are what keept the meta balanced","subforum":"Gameplay","up_votes":20,"down_votes":19,"body":"Now you&#039;re complaining theres no champion to keep assassins and bruisers like darius in check?Quinn 55% wr in 3 different roles? No downside in picking 2 mages bot lane?15 min games? Oh i wonder why!\n\nWell enjoy it the super snowball 15~20 min games with fiesta team comps of bruisers/mages/assassins, you guys literally asked for it.","replies":[{"poster":"Eedat","date":"2018-07-23T18:18:41.377+0000","up_votes":9,"down_votes":2,"body":"> As much as you guys complained about adcs and supports\n\nLUL\n\nhttps://boards.na.leagueoflegends.com/en/c/gameplay-balance/UhFzgt29-supports-have-compeltely-taken-over-bot-lane\n\nHere's a thread from 2 months ago from ***YOU complaining about supports being OP***\n\nhttps://boards.na.leagueoflegends.com/en/c/gameplay-balance/k7wFIA36-support-itemization-needs-to-be-nerfed-hard-asap\n\nHere's one of you demanding support items be hard nerfed\n\nhttps://boards.na.leagueoflegends.com/en/c/gameplay-balance/usMaU4BK-the-fact-they-are-gutting-crit-adcs-further-on-pbe-without-support-nerfs-is-absurd\n\nA third of you QQing that they arent nerfing support\n\nYeah dude, its all everyone else and you never complained at all xD","replies":[{"poster":"Rexxiee","date":"2018-07-23T18:44:24.899+0000","up_votes":2,"down_votes":7,"body":"> [{quoted}](name=Eedat,realm=NA,application-id=3ErqAdtq,discussion-id=Efoq4imd,comment-id=0005,timestamp=2018-07-23T18:18:41.377+0000)\n>\n> LUL\n> \n> https://boards.na.leagueoflegends.com/en/c/gameplay-balance/UhFzgt29-supports-have-compeltely-taken-over-bot-lane\n> \n> Here&#x27;s a thread from 2 months ago from ***YOU complaining about supports being OP***\n> \n> https://boards.na.leagueoflegends.com/en/c/gameplay-balance/k7wFIA36-support-itemization-needs-to-be-nerfed-hard-asap\n> \n> Here&#x27;s one of you demanding support items be hard nerfed\n> \n> https://boards.na.leagueoflegends.com/en/c/gameplay-balance/usMaU4BK-the-fact-they-are-gutting-crit-adcs-further-on-pbe-without-support-nerfs-is-absurd\n> \n> A third of you QQing that they arent nerfing support\n> \n> Yeah dude, its all everyone else and you never complained at all xD\n\nSo what?\n\nSupports defenitely deserved to be nerfed, but they just randomly nerfed janna and lulu and the items AFTER mages were already starting to take over the bot lane, i even made a thread about on how the janna lulu nerfs were so late that they were actually in a really bad timing to the point they shouldnt even happen, funny how you dont bring up that thread.","replies":[{"poster":"SanKakU","date":"2018-07-23T19:05:57.494+0000","up_votes":1,"down_votes":1,"body":"An irrelevant thread because those support nerfs only mattered when it came to the items. For each of the shield duration nerfs, there's very little to no impact. The biggest difference is to Janna but since maxing shield first on her isn't viable anymore, the shield doesn't last long enough for the nerf to matter.","replies":[]}]}]},{"poster":"saltran","date":"2018-07-23T18:10:50.878+0000","up_votes":6,"down_votes":6,"body":"Is kinda funny that after months and months of the Gameplay Boards crying about adcs and enchanters they both get huge nerfs and suddenly this is the worst meta ever acording to the Gameplay Boards.\n\n{{sticker:slayer-pantheon-popcorn}} \n\nIs like they all hated the game apparently for the adcs and enchanters but now they still hate the game plus there are more adc mains and some enchanters crying here aswell in add to the first group.","replies":[{"poster":"Eedat","date":"2018-07-23T18:55:18.635+0000","up_votes":6,"down_votes":1,"body":"> suddenly this is the worst meta ever acording to the Gameplay Boards.\n\n\nSuddenly? It's gameplay lol. ***Every meta is the \"worst meta ever\"***. This board says every. single. meta. is. the. worst. no. exceptions.","replies":[]},{"poster":"Athenes Lulu","date":"2018-07-23T21:40:02.682+0000","up_votes":1,"down_votes":0,"body":"\"but gameplay consists of different people having different opinions!!!\"","replies":[]}]},{"poster":"Khristophoros","date":"2018-07-23T18:10:46.117+0000","up_votes":6,"down_votes":2,"body":"What? No. People were unhappy with the state of the game in season 7, and preseason 8, and season 8, and season 8 post-ADC nerfs.\n\nThe underlying problem is Riot just doesn't care about making the game fun or at least tolerable.","replies":[]},{"poster":"Mokuto Bunshi","date":"2018-07-23T17:37:35.225+0000","up_votes":3,"down_votes":1,"body":"I agr... Hold up... \nHow did a nerf to adc's increase the power of assassins when there are now other champions (ala swain) who can be your bot carry and also be tank?\n\nShouldn't assassins be LESS useful in this meta?","replies":[{"poster":"DuskDaUmbreon","date":"2018-07-23T17:55:54.631+0000","up_votes":1,"down_votes":0,"body":"Good logic, but not quite.\n\nAs OP said, it's the lack of enchanters and proper supports. The less proper ADCs there are, the less proper supports there are. The less proper supports there are, the stronger assassins are (as most enchanters tend to be the ONLY counterplay to assassins).","replies":[{"poster":"Khristophoros","date":"2018-07-23T18:14:13.201+0000","up_votes":1,"down_votes":0,"body":"The support situation is due to direct nerfs to enchanters (which were needed tbh) but now the problem is point and click 100-0 assassins have a much easier time.","replies":[{"poster":"Aseraan","date":"2018-07-23T18:33:38.669+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Khristophoros,realm=NA,application-id=3ErqAdtq,discussion-id=Efoq4imd,comment-id=000100010001,timestamp=2018-07-23T18:14:13.201+0000)\n>\n> The support situation is due to direct nerfs to enchanters (which were needed tbh) but now the problem is point and click 100-0 assassins have a much easier time.\n\nAs they had  long before when you had to know and use the proper knowledge how to react and play around them, now you just \"SHIELD ME OMG THEY HAVE A ZED PLS SHIELD ME MOM PLS IM GONA DIE SHIELD ME AGAIN PLS.\n\nAnd no thats not  over exaggerated.","replies":[{"poster":"Khristophoros","date":"2018-07-23T18:37:17.193+0000","up_votes":2,"down_votes":0,"body":"Nerfs didn't only make it harder for the general playerbase to counter assassins while playing enchanters. It also (more importantly) encouraged players to pick different supports entirely.","replies":[{"poster":"Aseraan","date":"2018-07-23T19:52:28.799+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Khristophoros,realm=NA,application-id=3ErqAdtq,discussion-id=Efoq4imd,comment-id=00010001000100000000,timestamp=2018-07-23T18:37:17.193+0000)\n>\n> Nerfs didn&#x27;t only make it harder for the general playerbase to counter assassins while playing enchanters. It also (more importantly) encouraged players to pick different supports entirely.\n\nPLS STOP WHIT \"enchanters\"  they are a fking subrole that contains 5 champ and 4 of them are the most uninteractive most selfis most annoying and most fuckable champs this is a fact wich puts Akali to shame.\n\nAlso lemme remind you that ecnhanters are absolutly nowhere near good counters to assasins as tank supps whit fukcload of cc as maokai naut tresh tahm etc........but enchanters became the general pick agaisnt them, spoiler alert, because they got soo much fucking overlaoded items whit free stats and  number of buffs it made avaible  comps like 1 adc 4 ardent wich is wonderfull in itself(AA wait a sec i trow up a little).\n\nSo ye there are counters to assasins outside of e-girl and their uninteractive pice of dirt skillsets but u will need a litle more handywork than pressing e on  the adc...............","replies":[{"poster":"DuskDaUmbreon","date":"2018-07-24T21:42:10.522+0000","up_votes":2,"down_votes":0,"body":"How do we interact with a Talon jumping at us? We can dodge the W (which is honestly just a pathetic amount of damage outside of lane, not to mention that you don't have *time* to dodge the outgoing W without a blink, and that you can't realistically dodge to the side when he's going straight at you), or we can burst him before he reaches us (no DPS champion can do that unless absurdly fed).\n\nHow do we react to a Zed pressing R on us? We can't dodge his E or Q without a blink, because *all* he has to do is press it as soon as he comes out of R - meaning it's just not feasible to dodge it if you're a human. Sure, a scripter can do it, and you can do it against a Zed who is half-asleep, but the only counterplay to him outside of lane should not be {{item:3157}} or the team pulling him off me.\n\n---\n\nYou blame enchanters for being braindead? Well, fine. Whatever. Whether or not they are is irrelevant. What does matter is that **regardless of how braindead enchanters were, there's basically 0 counterplay to most assassins, as basically every single one of them is point and click, or all but.**\n\nSo, the question is: Which is more fair: Assassins killing all squishies without counterplay, or enchanters completely negating all assassins without counterplay? Be objective, here, and actually think about it. And don't just think of it from the standpoint of \"just group lul\" (because, realistically, only enchanters **were** able to stop them), or from the standpoint of an assassin (which is just to burst them faster). Think of it from a fair standpoint. What is most fair to tanks, bruisers, mages, assassins, marksmen, *and* enchanters? One class being invalidated when one other class is nearby, or one class completely wiping the floor with the entirety of two classes, and all of a third class that isn't more skilled than them?","replies":[]},{"poster":"Khristophoros","date":"2018-07-24T00:17:55.653+0000","up_votes":2,"down_votes":0,"body":"Assassins are also uninteractive unless they have stupid counterplay minigames built into their kits but even then not really.\n\nThe only thing that really kept them in check were equally uninteractive defensive support champs and now those champs are weaker/less picked so assassins are ruining the game because they're also uninteractive except it's offense instead of defense.\n\nAnd btw the best tank supports for this are also less picked. I never see Ali/Braum/Kench anymore.","replies":[]}]}]}]}]},{"poster":"Fízz v2","date":"2018-07-23T18:02:02.440+0000","up_votes":3,"down_votes":1,"body":"Proper supports are still the only thing thats played support tho","replies":[]},{"poster":"Aseraan","date":"2018-07-23T18:30:07.736+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=DuskDaUmbreon,realm=NA,application-id=3ErqAdtq,discussion-id=Efoq4imd,comment-id=00010001,timestamp=2018-07-23T17:55:54.631+0000)\n>\n> Good logic, but not quite.\n> \n> As OP said, it&#x27;s the lack of enchanters and proper supports. The less proper ADCs there are, the less proper supports there are. The less proper supports there are, the stronger assassins are (as most enchanters tend to be the ONLY counterplay to assassins).\n\nLEmme fix that for you:\n\n\"As most enchanters tend to be the easy counterplay to anything.","replies":[]}]},{"poster":"deadlychuck","date":"2018-07-23T21:42:08.796+0000","up_votes":1,"down_votes":0,"body":"you'd think, but the AD assassins benefit from ADCs being both strong and weak. If ADCs are strong then they still benefit from the extra damage scaling (particularly the \"skirmisher\" style assassins), but if ADCs are weak then they can build their tailored items without much concern over not being able to take down the ADCs. \n\nThey still have the damage to completely obliterate anything that isn't a pure tank, but also the mobility to pick their fights to avoid tanks. While having enough DPS to 1v1 tanks.\n\nThe best solution would be to give assassins their own primary stat, but it's by no means the easiest solution. Not that they haven't already put more net effort into numerous class item reworks than it would take to add a new primary. ","replies":[]},{"poster":"Rexxiee","date":"2018-07-23T17:38:50.139+0000","up_votes":5,"down_votes":5,"body":"> [{quoted}](name=Mokuto Bunshi,realm=NA,application-id=3ErqAdtq,discussion-id=Efoq4imd,comment-id=0001,timestamp=2018-07-23T17:37:35.225+0000)\n>\n> I agr... Hold up... \n> How did a nerf to adc&#x27;s increase the power of assassins when there are now other champions (ala swain) who can be your bot carry and also be tank?\n> \n> Shouldn&#x27;t assassins be LESS useful in this meta?\n\nThats the support part, adcs kept bruisers/juggernauts like darius in check, supports like janna and lulu kept assassins in check, both together made it so you have to draft proper team comps to win rather than pick random bruisers and assassins/mages in every lane.\n\nAnd most adc + sup lanes dont snowball as fast (even a 5-0 adc takes like 20 mins to get a good powerspike) as bruiser vs bruiser lane or assassin vs assassin and they offer no comeback potential, leading to the 10 minute games you're seeing everywhere (coupled with the shit towers ofc).","replies":[]}]},{"poster":"Akali is SO HOT","date":"2018-07-23T18:39:28.708+0000","up_votes":3,"down_votes":1,"body":"The game was super snowbally before ADCs and Support nerfs and it's still super snowbally after.  Most of the people who were crying for ADC and Support nerfs are probably happy with the game right now.  Other people who didn't cry are now crying because they don't like how it changed the game.  Different people.  There are also just some people who complain even if what they asked for gets addressed so their opinions don't matter as much.","replies":[]},{"poster":"Aseraan","date":"2018-07-23T18:26:59.787+0000","up_votes":3,"down_votes":2,"body":"I still dont miss adc in my elo wich is trash ppl still play quinn sorka janna vayne mf jhin tristana ashe ezreal soo they are still picked here and have no problem laning if they arent totaly mentaly ill ppl.\n\nAll i got from this thread is a \"im adc/e-girl main pls  buff my mains cuz i dont like being average i wanna be broken again.\nThis  reasoning that adc kept brusers in check is dumb and ur just trying to pull a wet blanket on it so ur role gets a buff for no valid reason.","replies":[{"poster":"Rexxiee","date":"2018-07-23T18:47:35.140+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=Aseraan,realm=EUW,application-id=3ErqAdtq,discussion-id=Efoq4imd,comment-id=0007,timestamp=2018-07-23T18:26:59.787+0000)\n>\n> I still dont miss adc in my elo wich is trash ppl still play quinn sorka janna vayne mf jhin tristana ashe ezreal soo they are still picked here and have no problem laning if they arent totaly mentaly ill ppl.\n> \n> All i got from this thread is a &quot;im adc/e-girl main pls  buff my mains cuz i dont like being average i wanna be broken again.\n> This  reasoning that adc kept brusers in check is dumb and ur just trying to pull a wet blanket on it so ur role gets a buff for no valid reason.\n\nIts not dumb at all.\n\nWhy do you think even garen, a champion who doesnt even have a good kit, has a 53% wr right now in DIAMOND with a 10% pick rate?\n\nBecause adcs that arent draven/lucian (the champs that keeps him in check) are literally OUT of the game, same thing for darius.","replies":[{"poster":"Aseraan","date":"2018-07-23T19:39:29.675+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Rexxiee,realm=NA,application-id=3ErqAdtq,discussion-id=Efoq4imd,comment-id=00070001,timestamp=2018-07-23T18:47:35.140+0000)\n>\n> Its not dumb at all.\n> \n> Why do you think even garen, a champion who doesnt even have a good kit, has a 53% wr right now in DIAMOND with a 10% pick rate?\n> \n> Because adcs that arent draven/lucian (the champs that keeps him in check) are literally OUT of the game, same thing for darius.\n\nI will tell you why ppl who can play him wins games whit him when dumb players picks atrox irelai riven or yasuo into him and get dumpstered.\n\nAlso im kinda biased i will be honest i dont fuking care for adc or e-girl supps fk them all they need to sit the fk down for a year or two.","replies":[]}]},{"poster":"RyzeTheSmurfMage","date":"2018-07-23T18:45:05.427+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Aseraan,realm=EUW,application-id=3ErqAdtq,discussion-id=Efoq4imd,comment-id=0007,timestamp=2018-07-23T18:26:59.787+0000)\n>\n> I still dont miss adc in my elo wich is trash ppl still play quinn sorka janna vayne mf jhin tristana ashe ezreal soo they are still picked here and have no problem laning if they arent totaly mentaly ill ppl.\n> \n> All i got from this thread is a &quot;im adc/e-girl main pls  buff my mains cuz i dont like being average i wanna be broken again.\n> This  reasoning that adc kept brusers in check is dumb and ur just trying to pull a wet blanket on it so ur role gets a buff for no valid reason.\n\nThe truth has finaly been spoken.  Now bruisers may be a bit strong,  but that doesn't mean we have to make games be \"better botlane wins\" again","replies":[]}]},{"poster":"Athenes Lulu","date":"2018-07-23T21:39:26.040+0000","up_votes":1,"down_votes":0,"body":"nah dude clearly adcs and supprots r soooooo evil cuz they destroy diversity!!!!!1\n\n/s","replies":[]},{"poster":"deadlychuck","date":"2018-07-23T21:37:19.073+0000","up_votes":1,"down_votes":0,"body":"Not really. \n\nThey were a symptom of the problem, but not the problem itself.\n\nThe real problem is that the \"assassin fantasy\" doesn't fit into the game, but more importantly it absolutely can't exist in the game if you're going to attach them to the stats of the classes which they are intended to counter (which is apparently mages and marksmen). If they wanted assassins to exist effectively in the game, without causing the constant arms race and issues that now plague the game, then they needed to add them with a new primary stat other than AD/AP/Health.","replies":[]},{"poster":"Death by Glamour","date":"2018-07-23T20:44:49.248+0000","up_votes":1,"down_votes":0,"body":"hmm\n\nyou seem to have forgotten that bot lane also spiralled out of control and resulted into a 20min game","replies":[]},{"poster":"Larriet","date":"2018-07-23T19:59:00.714+0000","up_votes":1,"down_votes":0,"body":"While I agree, and I would've been fine with things staying that way indefinitely (having specific champs designed for the duo lane just seems way more intuitive), I think the overall direction of this is still good.  I'd be happy for non-Marksmen in Bot, and I'll be happy if some of those Marksmen can find success in other roles (not that they should totally migrate, of course).","replies":[]},{"poster":"Anatera","date":"2018-07-23T19:34:47.976+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rexxiee,realm=NA,application-id=3ErqAdtq,discussion-id=Efoq4imd,comment-id=,timestamp=2018-07-23T17:27:01.298+0000)\n>\n> Now you&amp;#039;re complaining theres no champion to keep assassins and bruisers like darius in check?Quinn 55% wr in 3 different roles? No downside in picking 2 mages bot lane?15 min games? Oh i wonder why!\n> \n> Well enjoy it the super snowball 15~20 min games with fiesta team comps of bruisers/mages/assassins, you guys literally asked for it.\n\nNo one asked for this. There is a thing called a \"middle ground,\" if you  haven't heard of it let me give you the definition: \n\n**_an area of compromise or possible agreement between two extreme positions, especially political ones._**\n\nThis is meta IS entirely Riot's fault. They have a history of balancing between one extreme to another and this meta is no different. Just because people asked for more damage does not mean they asked for this or are the cause of it.","replies":[]},{"poster":"PopcornBunni","date":"2018-07-23T19:13:15.253+0000","up_votes":1,"down_votes":0,"body":"Tanks use to be the answer to all of those. ADCs and supports aren't what stopped assassins and all-in attacks.\n\nYou'd think with marksmen and damage over time being out of favor, tanks would be seeing a huge spike in winrate, but they get deleted just as much as any other class.","replies":[]},{"poster":"xJLx MCHammer","date":"2018-07-23T23:28:48.689+0000","up_votes":1,"down_votes":2,"body":"S8>S7 \n\nS8 is much better.\n\n\nADC didn't keep the game balanced. It kept it that Riot was allowed ADC's to be the constant. It wasn't balanced. The entire game focused and revolved around the ADC role. Now, with the ADC's SLIGHTLY nerfed, you see comps that revolve around non-adc champion. You can funnel/protect the assassin.\n\nSure, some people will complain but for the most part, the game is much healthier today, than it was during S7.","replies":[{"poster":"Alex h8721","date":"2018-07-23T23:42:11.665+0000","up_votes":1,"down_votes":1,"body":"This 100%.  Do people even remember season 7 worlds? it was so boring and dumb, hypercarry adc on either side and a teamcomp built around them (even to the point where we were seeing LULU in the Jg LMFAO).\n\nFarm for 30 min and then watch 1 adc be slightly better at melting the enemy team.\n\n\nGetting E> 2x Auto>R and dying to 2 item tristana if you were any champ that didnt build hp.  no reason for jg's to gank/camp any lane but botlane and adc's being the center any teamcomp.\n\n\nNow we actually have diversity all over the rift, i agree crit adc's need a bit of love but i think right now most picks CAN work and thats something that was not a thing in season 7, season 7 the meta was much more strict and picking a shittier champ meant your chances of winning went way down, but now off meta stuff has a much better shot at working.  Im largely enjoying this season as well.","replies":[]}]},{"poster":"Noor Sakata","date":"2018-07-23T18:32:19.507+0000","up_votes":2,"down_votes":2,"body":"agreed","replies":[]},{"poster":"Aseraan","date":"2018-07-23T18:22:38.663+0000","up_votes":1,"down_votes":1,"body":"Oh im sry i had the impresion that the game balance is all about how balance team is sht at balancing.... no? Did i miss something?","replies":[]},{"poster":"Whisper87","date":"2018-07-23T17:33:05.309+0000","up_votes":4,"down_votes":5,"body":"The monkeys all just want fighting, it's all the plebs care about is more fighting earlier and more often.\n\nWhere are all of the thoughtful, patient, cerebral players? What game are they playing now? I may have to move over to that.","replies":[]},{"poster":"MasterDClone","date":"2018-07-23T17:44:20.000+0000","up_votes":2,"down_votes":12,"body":"I am enjoying this meta, i haven't had this much fun in league in ages, to go zed adc everygame and just shit on the marksmen all game, this is the greatest shit. Wasn't even aware it was asked for but i am glad it is, i don't have time for 40 min farm till late games, that was so fkkin boring. \n\nOn a side note i rarely see quinn but when i do it is an ez fucking game because its another target i can one shot.","replies":[]}]}