{"poster":"Yotsuko","date":"2015-08-31T06:56:41.344+0000","title":"Problema tecnico gioco fps","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Salve, vi scrivo perch&eacute; ho un problema. Giocavo tramite nvidia su lol con un fps costante di 60, qualsiasi livello di qualit&agrave; mettessi, low o high sempre 60. Un giorno feci un download e mi scasso tutto, gli fps tornarono bassi, 10-20 con high e fino a 40 con low. decisi di fare un ripristino di sistema, e oggi ho installato nuovamente nvidia geforce experience, ma ancora nulla, non torna come prima D:.... avete qualche consiglio ?","replies":[{"poster":"Yotsuko","date":"2015-08-31T13:34:47.195+0000","up_votes":1,"down_votes":0,"body":"Grazie mille a tutti ho risolto. Ho fatto un bel po di test, ci ho sprecato circa 4 ore... Ma ora posso dire finalmente di essere soddisfatto\n\n\nPRIMA:\nPing -> 115 -> Fps 35\nDOPO:\nPing -> 98 -> fps 95  \n\n\n\nPer quanto riguarda gli fps ho risolto il problema con nvidia e anzi, ora è migliorato xD\nPoi per quanto riguarda il ping ho installato un programma, non ha fatto miracoli ma vabbè 17 di ping in meno non è poi cosi male{{summoner:31}}","replies":[]},{"poster":"NIGERUNDAYO JoJo","date":"2015-08-31T07:50:48.007+0000","up_votes":1,"down_votes":0,"body":"Scarica un programmino per monitorare le temperature, puo darsi che qualcosa scalda un po troppo causando rallentamenti..\nA parte la temperatura, puo darsi che sulla CPU ci sia un carico abbastanza grosso e di conseguenza tu vedi dei rallentamenti in game..cos'altro hai aperto mentre giochi? Se è tutto regolare allora prova ad usare \"process explorer\" lo trovi in rete, è un task manager più dettagliato..","replies":[{"poster":"Yotsuko","date":"2015-08-31T08:34:18.378+0000","up_votes":1,"down_votes":0,"body":"ti lascio le immagini cosi puoi dirmi tu perchè ne capisco poco io","replies":[{"poster":"Yotsuko","date":"2015-08-31T08:34:43.063+0000","up_votes":1,"down_votes":0,"body":"2","replies":[{"poster":"Yotsuko","date":"2015-08-31T08:35:10.304+0000","up_votes":1,"down_votes":0,"body":"e 3","replies":[{"poster":"NIGERUNDAYO JoJo","date":"2015-08-31T08:46:46.293+0000","up_votes":1,"down_votes":0,"body":"Niente di anomalo..temperature ottime e nessun processo strano o che prende tanta memoria..\nTi direi di provare ad aggiornare i driver della scheda video/monitor e se continua a darti cali di fps prova a disinstallare e re-installare league..\nAltro non so, dovresti provare a rivolgerti a qualche altro forum o al supporto","replies":[{"poster":"Yotsuko","date":"2015-08-31T08:48:18.307+0000","up_votes":1,"down_votes":0,"body":"ma infatti il problema è che senza nvidia avevo questi fps bassi, con nvidia invece si. Tuttavia all'inizio nvidia lavorava, cosi per dire, su league of legends, ora invece non ci lavora più è come se quando apro lol nvidia non lo calcola xD","replies":[{"poster":"FaFFe","date":"2015-08-31T11:28:48.272+0000","up_votes":1,"down_votes":0,"body":"So che sembra una cazzata, ma sei sicuro di usare la grafica nvidia mentre giochi e non la grafica integrata della mobo?","replies":[]},{"poster":"NIGERUNDAYO JoJo","date":"2015-08-31T09:29:40.787+0000","up_votes":1,"down_votes":0,"body":"Nvidia experience è un tool che consente di mantenere i driver sempre aggiornati in modo da ottenere performance migliori  con molti giochi..\nSe adesso come dici tu, lol non lo conta proprio, o c'è stato qualche problema durante la nuova installazione o non saprei proprio cosa possa essere..anche se hai effettuato un ripristino di sistema, qualche problema potrebbe essere rimasto..\nCome ti ho già detto, prova a disinstallare e re-installare league, se non risolvi manco così allora o ti rivolgi a qualche forum competente nvidia o provi a formattare","replies":[]}]}]}]}]}]}]}]}