{"poster":"JinJu","date":"2017-03-08T13:54:25.914+0000","title":"Trainer gesucht !!!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Wir das Team High 5 suchen einen Coach !\r\n\r\nHey Du ! \r\nJA, dich meine ich. Du liest die Anzeige und denkst du hast Bock ein Team dabei zu helfen alle ihr Ziele zu verwirklich und dabei ein Teil des Gro&szlig;en ganzen zu werden? \r\nDu hast schon immer gedacht Strategisch macht dir keiner was vor und deine Leidenschaft f&uuml;r LoL ist genauso gro&szlig; wie unsere ? \r\n\r\nDann passt Du genau in unser Team. Bewirb dich beim Team, sprich vor und erz&auml;hle uns was deine ersten Schritte w&auml;ren. Dann bist Du auch bald unseres Teams. \r\n\r\nAnforderungen : \r\n-  Erfahrung als Trainer \r\n-  Strategisch ein Ass\r\n-  Gut Erkl&auml;ren und dabei nicht pers&ouml;hnlich werden\r\n\r\nWas wir mit bringen :\r\n-  Ein 7 K&ouml;pfiges Team\r\n-  Kretikf&auml;hige Spielkollegen \r\n-  Spa&szlig; am spiel \r\n-  Ergeiz mit dem ziel in den esports Bereich zu landen \r\n\r\nWenn dir die Anzeige zusagt dann Adde mich einfach unter Jinju in LoL und wir machen einen termin aus.\r\n\r\nUnsere Trainingszeiten sind Montag 20 Uhr, Mittwoch 20 Uhr und Sonntag nach absprache. Am besten ihr Addet mich noch Heute. Denn wer zu erst kommt malt zu erst ;D","replies":[{"poster":"SoloQisMentlBoom","date":"2017-03-08T14:22:20.346+0000","up_votes":5,"down_votes":1,"body":"Tipps fürs nächste Mal:\n\n1. Erwähne euren Elobereich im Thread.\n\n2. Stell nicht so große Anforderungen. Du zumindest bist zZ Bronze V, wenn es bei den anderen ungefähr gleich aussieht könnt ihr euch schon über jemanden freuen der Gold1+ ist und mal das Coachen ausprobieren möchte.\n\n3. Besser im Deutschunterricht aufpassen. Wenn eSport euer Ziel ist, dann würde dieser Coach sehr lange bei euch bleiben müssen. Wenn ihr euch nicht mal die Mühe macht einen ordentlichen Thread zu erstellen, der sowohl inhaltlich als auch grammatikalisch korrekt ist, wirkt das eher gegen euch.\n\nHoffe, ich konnte euch wenigstens auserhalb eurer Erwartungen etwas helfen :)","replies":[]}]}