{"poster":"Karma Roam","date":"2015-04-06T13:00:48.564+0000","title":"Karma: It's spelled Karma, it's pronounced: Bad Game.","subforum":"Campioni e gameplay","up_votes":3,"down_votes":0,"body":"Ciao a tutti! Scrivo perch&eacute; dopo svariato tempo speso nell&#039;accumulare Punti Influenza sono alla fine riuscito a racimolarne a sufficienza per comprare il mio nuovo campione: Karma.\r\nIl champ. promette bene in tutta la fase di laning iniziale. Ero insieme a Sivir in bot lane. Karma si rivela capace di dare un certo apporto al pushing, riuscendo, insieme a Sivir, a lasciare gli avversari in fin di vita, senza per&ograve; mai riuscire a ucciderne uno o a creare una situazione da assist. Questo fino al livello 5. Non mi aspettavo moltissimo dato che &egrave; un support. Fatto sta che ho riscontrato, di l&igrave; in poi, una forte falla nella nel suo gameplay: La sua pressoch&eacute; totale &quot;circolarit&agrave; ristretta&quot; delle sue abilit&agrave;, ossia la genericit&agrave; e l&#039;inconsistenza delle sue abilit&agrave; e la sua incapacit&agrave; di spiccare in una qualsiasi funzione particolare salvo il farming iniziale. Forse l&#039;ho giocata male, anzi, di sicuro l&#039;ho fatto, ma mi &egrave; parso che non riuscisse a nessun punto della partita a fare una delle seguenti cose:\r\n1) Support di gruppo (assente). Support su singolo (fragilissimo e limitato allo Shield e indirettamente allo stun su UN bersaglio):\r\nNon &egrave; possibile supportare in maniera davvero efficace utilizzando la sua shield (E), data, non la debolezza di questa, ma la mancanza di abilit&agrave; complementari che ne spingano ulteriormente l&#039;efficacia ad un punto apprezzabile. Questo potrebbe essere, l&#039;infusione di armor multipli a pi&ugrave; membri del gruppo una volta usato il mantra (R).\r\n2) Esecuzione di kill o assist efficace.\r\na) Portare a termine una kill data la dipendenza da skill dell&#039;evocatore come ignite, o altri (che non avevo durante il game) risulta estremamente difficile. Questo &egrave; uno dei maggiori problemi. Non credo che debba essere in grado di gestire una kill intera nell&#039;1 contro 1, ma che almeno sia in grado di uccidere un normale champion al 35-25% della sua vita senza arrecare danno ai propri compagni morendo e feedando il champion (moribondo) nemico oppure lasciandosi scappare un opportunit&agrave; di guadagno.\r\nb) Questo &egrave; dovuto anche alla lentezza del suo stun, che si cancella nel caso si volesse aumentare il danno con una Q oppure se il nemico fa una qualunque mossa di scatto. Sarebbe bello poter usare entrambi senza dover scegliere o uno o l&#039;altro dato il basso damage. \r\nc) R applicabile ad una sola skill. Sarebbe infinitamente meglio avere una R temporanea che duri 8-10 secondi e non una sola skill a volta. Ovviamente questo comporterebbe un maggiore cooldown, ma sarebbe estremamente pi&ugrave; efficace. \r\n3) Autosufficienza in lane:\r\nDal momento che ci si trova da soli la lane &egrave; finita. Si &egrave; costretti a rimanere confinati in prossimit&agrave; della torre piazzando di tanto in tanto colpi inefficaci sull&#039;avversario. Qua entra in gioco la sua bassa vitalit&agrave;, la sua incapacit&agrave; di curarsi e di ottimizzare l&#039;uso del mana. BG.\r\n\r\nPer questi motivi e con in mente il forte senso di scompenso provato durate la mia prima game con Karma (0/14/9) richiedo, con quanto voce mi &egrave; concesso avere, di dare un occhiata e magari in una futura patch potenziare Karma di modo da renderla pi&ugrave; forte in almeno uno di questi tre aspetti. Siete voi gli esperti. Grazie, un giocatore alle prime armi.","replies":[{"poster":"Ste the ripper","date":"2015-04-06T13:24:39.262+0000","up_votes":4,"down_votes":2,"body":"> Grazie, un giocatore alle prime armi.\n\nIl riassunto dell'intero post in una frase","replies":[{"poster":"Jay Kenton","date":"2015-04-06T21:35:50.680+0000","up_votes":1,"down_votes":0,"body":"Mi dispaice ammetterlo ma concordo, nonostante una esposizione forbita non sono nemmeno riuscito a capire che tipo di problematiche ha riscontrato con Karma.\n\nCon Karma PUOI giocare l'ignite, niente te lo vieta; è corretto pushare e lo shield lo si usa per la mspeed; più che da trade lo si tiene per evitare le ganks.\n\ninoltre grazie alla sua versatilità, Karma da sola non sfigura: la natura dei suoi cooldown le permette essenzialmente di concentrarsi a tirare una Q mantrata su tutti e 6 i minions dopo averli attirati attorno a se, poi finirli di autoattacchi.","replies":[]},{"poster":"SKFF1R SubZero","date":"2015-04-06T13:31:34.322+0000","up_votes":1,"down_votes":0,"body":"Commento conciso e che va dritto al punto: meriti un +1","replies":[]}]},{"poster":"Frattaglia","date":"2015-04-06T13:36:36.769+0000","up_votes":1,"down_votes":0,"body":"Karma non è semplice da giocare e al momento è un po' out of meta, ma questo non vuol dire che non sia un buon champ.\nTi porta ad avere una lane da poke e sta molto bene con adc da poke o forti early; data la mancanza di una ultimate vera e propria, perde un po' dopo il 6.\n\nAd ogni modo è un champ che va giocato aggressivo, utilizzando anche gli autoattacchi per il poke.\nRicorda che lo scudo aumenta anche la movement speed e, se lo usi mantrato, viene applicato a tutta la squadra fornendo un buon engage/disengage.\n\nÈ un support mago e come tale va giocato, quindi ha bisogno di un po' di ap e di un posizionamento particolare: non sei e non devi essere la front lane.\n\nMi linki la partita in questione, che magari ti posso dare qualche altro consiglio?","replies":[]}]}