{"poster":"IVIantis","date":"2016-10-26T00:06:44.663+0000","title":"Teamorganisation (welche Programme/Dienste verwendet ihr?)","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hallo zusammen,\r\nich bin inzwischen stolzer Gr&uuml;nder von gleich 2 Rankedteams und nun stellt sich f&uuml;r mich die frage, wie organisiert man sich als Team am besten (Terminfindung, Kommunikation au&szlig;erhalb des gemeinsamen Spielens, to do Listen, Disskussionen usw.)? \r\n\r\nDazu wollte ich mal fragen, was f&uuml;r Erfahrungen ihr gemacht habt und welche Programme oder Dinste ihr (falls ihr selber ein Team habt) verwendet? Also Habt ihr zb. ein eigenes Forum? Benutzt ihr eine Website oder eine App zur Terminfindung oder zur Kommunikation au&szlig;erhalb des eigentlichen Spielens und wenn ja welche? Und auch gerne allgemein welche ERfahrungen ihr mit der Organisation von Teams habt und eure Tipps. Die Teams sind noch ganz neu bzw. eins fast noch in der Gr&uuml;ndung, ich freue mich also &uuml;ber jeden Erfahrungsbericht, jeden Ratschlag und generell &uuml;ber jede Antwort :) \r\n\r\nPS. Ich wei&szlig; nicht ob ich hier im richtigen Forum bin, es erschien mir aber das passenste. Falls ich falsch bin bitte ich um Verzeihung.","replies":[{"poster":"Kata Ga Kill","date":"2016-10-26T00:46:48.987+0000","up_votes":1,"down_votes":0,"body":"Also dies kann während eurer Besprechungen ein große Hilfe sein:\nhttp://map.riftkit.net/\n\nGenrell sollte man feste Trainingszeiten/Spielzeiten haben, wie im RL halt.\nWann und wie oft ist euch überlassen nur der Punkt diese Termine sollten eingehalten werden als würde man zum Fußballtaining gehen, sonst funktioniert ein Team nicht, das sollte selbstverständlich sein.\n\nUnd eure Treffzeiten könnt ihr euch anteilen wir ihr mögt nur sollte eine feste Struktur vorhanden sein.\nAls Beispiel: \n19:00 Uhr Treffen im TS, \nDann Besprechungen führen, über Teamkonstelationen, neue Kombos aus der LCS/Youtube, Fehler von letzen mal erwähnen, usw.\nDann Trainiert man gezielt das was man möchte mit dem Team.\nNach dem Training wird geguckt ist mehr Training nötig  oder Normals Testen, oder direkt Ranked.\n\nEin Team das sich nicht bespricht und direkt Rankeds zoggen will, wird schnell untergehen.","replies":[{"poster":"IVIantis","date":"2016-10-27T17:38:28.391+0000","up_votes":2,"down_votes":0,"body":"Hey, vielen dank für deine Antwort. Die Internetseite sieht wirklch sehr hilfreich aus, werde ich in Zukunft wohl verwenden und auch vielen dank für die guten Ratschläge.","replies":[]}]}]}