{"poster":"Mickey Donnerudo","date":"2016-04-18T18:11:01.597+0000","title":"People are complaining about premades making them lose, but winning with premades isn't fun either.","subforum":"Gameplay","up_votes":188,"down_votes":26,"body":"Simply being with a large premade is unfun. Being stuck with a majority of your team being non-solo (and the enemy team also likely being in the same situation) means that the solo players have much less impact on the games. Bad premades will feed like there is no tomorrow, BUT good premades will make the other team feed like there&#039;s no tomorrow and you are just sitting in lane 2/1/0, a close match in the top lane, and suddenly the game is pretty much over. The score is 30 - 3.\r\n\r\nYou didn&#039;t get to do anything.","replies":[{"poster":"Athenes Lulu","date":"2016-04-18T18:38:48.210+0000","up_votes":34,"down_votes":3,"body":"Yeah, it just doesn't feel rewarding.\n\nGetting a bunch of randoms to cooperate and win with actually feels like a legit accomplishment, especially as team-reliant champs.","replies":[{"poster":"Fovere","date":"2016-04-18T20:35:37.421+0000","up_votes":15,"down_votes":1,"body":"I completely agree.\n\nWhile people feel the effects of the losses more than the wins, its not really about winning or losing. It's about the game experience being undermined by the premade group(s).\n\n\n> [{quoted}](name=Cancerous Lulu,realm=NA,application-id=3ErqAdtq,discussion-id=pzRd3gG5,comment-id=0001,timestamp=2016-04-18T18:38:48.210+0000)\n>\n> Yeah, it just doesn&#x27;t feel rewarding.\n> \n> Getting a bunch of randoms to cooperate and win with actually feels like a legit accomplishment, especially as team-reliant champs.\n\nI've always found this to be one of the more rewarding aspects of League as well","replies":[{"poster":"Athenes Lulu","date":"2016-04-20T05:54:13.977+0000","up_votes":1,"down_votes":0,"body":"I don't mind soloing if premades actually listen to solo players, especially when there are actually smarter ones making really good shotcalling. Or even just any given day where a solo player leads and made plays so well that we thought he was part of a different premade.\n\nBut with the rise of dynamicQ, it just doesn't happen as often anymore.","replies":[{"poster":"Fovere","date":"2016-04-20T11:39:39.222+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Cancerous Lulu,realm=NA,application-id=3ErqAdtq,discussion-id=pzRd3gG5,comment-id=000100000001,timestamp=2016-04-20T05:54:13.977+0000)\n>\n> I don&#x27;t mind soloing if premades actually listen to solo players, especially when there are actually smarter ones making really good shotcalling. Or even just any given day where a solo player leads and made plays so well that we thought he was part of a different premade.\n> \n> But with the rise of dynamicQ, it just doesn&#x27;t happen as often anymore.\n\n\nI could say the same, but its too variable the type of premade you get, or the opposing team.  People will nature be more responsive to their friends than the solo players, regardless of performance.  I see it all the time and its really discouraging.\n\nForcing everyone to interact with premades is not the way to encourage teamplay and community building in League","replies":[]}]},{"poster":"Zaryelle","date":"2016-04-19T20:00:08.069+0000","up_votes":1,"down_votes":0,"body":"I wish that actually happened, but usually either 1-2 of the premades start raging or the person who is playing alone doesn't talk at all, most often it just wrecks the entire purpose of the game.","replies":[]}]}]},{"poster":"Urgonnalearn2day","date":"2016-04-19T01:50:38.214+0000","up_votes":17,"down_votes":1,"body":"Yep.... that's the issue, but no one gets it.  The solo person is just along for the ride.  Riot thinks this is fun, but its just removing solo play from the game.","replies":[{"poster":"Fisk","date":"2016-04-19T03:55:13.532+0000","up_votes":5,"down_votes":1,"body":"What about a club queue? Where you basically gain points as a whole with your club. Then we bring back solo queue http://boards.na.leagueoflegends.com/en/c/gameplay-balance/r8UEtqTA-instead-of-dynamic-queue-how-about-club-queue","replies":[]}]},{"poster":"lofi n chillhop","date":"2016-04-18T23:36:42.654+0000","up_votes":12,"down_votes":0,"body":"ah so, then this highlights an issue with dynamic queue philosophy in combination with the current elo system. there is no way to judge a group's actually elo accurately. the only way is to approximate based off of solo performance, but then when a group can freely pick up, drop, or exchange one or multiple members, there isn't any strong way to keep track of how these changes affects the group's real MMR/ELO. \n\nin order for Dynamic Queue to be a success in regards to this issue, there would need to be MMR or ELO or similar practices that tracks an individual's contribution to a group.\n\n\nadditionally, something that I strongly feel is that if Riot wants to move towards dynamic Queue, they NEED to implement a voice chat standard, so that they CAN assume all members of the team have the ability to voice chat with the team. because they can't stop players from using third-party voice chat programs, and whether or not voice chat is being used would dramatically affect the team's coordinations and would prevent any good read on MMR/etc","replies":[{"poster":"EfficientDynamo","date":"2016-04-19T08:40:23.561+0000","up_votes":4,"down_votes":1,"body":"The problem with implementing in-client voice chat is that it would invalidate a lot of their infrastructure aimed at punishing and prevent trolls and ragers. It would be a great gameplay addition, but would also turn league into CoD. \n\nPersonally, I think a better option would be to find ways to allow communication nonverbally (e.g. by a more sophisticated ping system). Won't solve everything, but it would be a good start.","replies":[{"poster":"ForeverLaxx","date":"2016-04-19T16:35:37.963+0000","up_votes":1,"down_votes":2,"body":"There's always going to be a downside to something, and choosing not to put in the best and most reliable option for communication because \"some people will abuse it\" is shortsighted at best. That precious ping system people talk about so much can be spammed, and there's no way to prevent a player from doing such because you can't remove their pings. You can mute a mic, and you can mute their text spam, but that ping spam will always be there. Adding even more ping options just crowds and overcomplicates the system, reducing the speed with which you can alert your allies.\n\nAn official voice system is the way League needs to go. Unfortunately, they're not going to do it and it's not because \"people can abuse it\". It's because League has no way currently to police a voice chat system and punish people. The proof is in their doctored data: premades are less toxic, at least according to Riot. Why is that? Because these people are using third-party chat programs and never chatting in-game, so all their toxic behavior is being contained in a system Riot can't see and therefor can't include in their data.","replies":[{"poster":"Xonra","date":"2016-04-19T20:28:29.388+0000","up_votes":3,"down_votes":1,"body":"\"There's always going to be a downside to something, and choosing not to put in the best and most reliable option for communication because \"some people will abuse it\" is shortsighted at best. \"\n\nNo, choosing to ignore all the downsides because you want voice chat is shortsighted. Maybe ignore isn't the right word, but choosing to write them off as \"acceptable\" is far more shortsighted in my personal opinion.\n\nIt would make a few aspects of League better, but make it overall worse.\n\n\nWhat about the people that stream? \n- they aren't going to want a bunch of screaming ragers or attention whores (knowing they are being streamed) talking over them while streaming.\n\nWhat about people that prefer music when playing?\n- Guess they are screwed. You get silence, ping spam, and nothing but strangers voices.\n\nWhat about those that don't like seeing toxic ragers let alone HEARING them?\n- Too bad for them I guess.\n\nWhat about the premades that are already using their preferred chat method (discord, skype, whatever)?\n- They aren't going to suddenly log out of skype just because of that 1 or 2 extra people they won't see after the game is over.\n\n\nIt sounds good in theory, and I understand the valid arguments FOR it, but I can see far more issues with adding it than I see benefits.","replies":[]}]}]},{"poster":"Faceless Voidz","date":"2016-04-19T07:54:48.053+0000","up_votes":2,"down_votes":0,"body":"This post needs attention.","replies":[]}]},{"poster":"Grashnim","date":"2016-04-18T18:12:30.520+0000","up_votes":17,"down_votes":4,"body":"My favorite are the 4+ premades who aren't using voice chat. Riot says they match similar premade numbers, but as usual, never release any true information.","replies":[{"poster":"Athenes Lulu","date":"2016-04-20T05:51:14.832+0000","up_votes":2,"down_votes":0,"body":"What's worse is you'll *never* know what kinds of premades you're matched against.\n\nKnowing whether a botlane pair is premade or not makes a *huge* difference, for instance, and that it can either turn in favor or against you.","replies":[]},{"poster":"Zaryelle","date":"2016-04-19T20:01:55.082+0000","up_votes":1,"down_votes":0,"body":"That's because the matching is horrible, they're always saying 'it matches people of equal skill' or 'equal amount of premades' but over and over again it becomes more of a rarity to have a match where people are actually close in skill.","replies":[]}]},{"poster":"stealthfox94","date":"2016-04-19T00:09:22.108+0000","up_votes":9,"down_votes":0,"body":"As annoyed as I am by the complaints, I actually agree with this statement, getting solo matched with a. 4 man premade sucks for multiple reasons.","replies":[]},{"poster":"Osaka 778","date":"2016-04-19T01:49:10.190+0000","up_votes":10,"down_votes":1,"body":"But Riot is almighty, and Riot knows what you enjoy and what you want. You are just salty. /s","replies":[]},{"poster":"Saianna","date":"2016-04-19T05:44:05.193+0000","up_votes":5,"down_votes":0,"body":"in 1 game about 3-5 days ago, someone and I  died like total retards leaving only 3 teammates alive\n\nThey were enough to win against 5 others using synced combo-wombos AOE dmg.\n\nYes. They were premades.\n\nI have to admit lately I doo feel kinda useless in my team.. Even when i try to contribute there's still this sticky unpleasant feeling of getting my ass carried. I dislike it. And I can't even check my MMR and others MMR, because Riot doesn't want to aid us with data that could solve issues like \"why the fuck I, as silver 2, am playing vs Diamond 1\"?","replies":[{"poster":"Zaryelle","date":"2016-04-19T20:02:42.138+0000","up_votes":1,"down_votes":0,"body":"This is the exact same problem with smurfs going into low level. 2-3 people carrying the entire game while the other people just watch or are so new they don't even know they are winning.","replies":[]}]},{"poster":"AwesomeChad","date":"2016-04-19T01:42:38.598+0000","up_votes":5,"down_votes":0,"body":"Hi, I am a solo player playing dynamic ranked and I feel useless every game i'm in with premades because 1 of two things happen:\n\n1. My team stomps the enemy team in laning phase, making all these coordinated plays elsewhere on the map before 10 minutes into the game while i'm just farming at bot lane.\n\n2. The enemy team sends their jungle, mid, and top lane down to bot lane to constantly gank while my top lane is still farming with tp up, my mid lane is coming late in the rotation, and my jungle is farming. \n\nI have no control over these scenarios.","replies":[{"poster":"Choaru","date":"2016-04-19T11:36:45.226+0000","up_votes":3,"down_votes":0,"body":"The worst one is when you are Soloqueing as a support, and all of the sudden you get 4 man dove under turret while the rest of your lanes are not using this chance to push the enemy's tower and you just have to write in chat \"Q_Q\".","replies":[{"poster":"Zaryelle","date":"2016-04-19T20:04:51.767+0000","up_votes":1,"down_votes":0,"body":"Whenever I support with a team of premades.. for some reason they are just toxic as hell. Last time I was Soraka they would try to insult me every time they died even if I was nowhere around to heal them, and even though I wasn't doing THAT great, I was obviously doing way better than all 4 of them, I didn't say a word all game just tried to heal and keep them alive as much as possible cause they kept diving, and at the end they all said to report me and I'm sure they did.","replies":[{"poster":"Choaru","date":"2016-04-19T21:19:50.776+0000","up_votes":1,"down_votes":0,"body":"i just wrote  long ass reply to this...but i ended up hitting the back button...\nfuck this Q_Q\n\nso uhh... I bet you did great! even thought you were playing fucking Goat Lady of Hell.","replies":[]}]}]}]},{"poster":"Vekkna","date":"2016-04-18T18:57:13.934+0000","up_votes":8,"down_votes":3,"body":"With nobody talking, nobody pinging, nobody ganking. You just get ignored the entire game except for when a teammate wants to KS.","replies":[]},{"poster":"DexterousGecko","date":"2016-04-19T01:51:07.425+0000","up_votes":9,"down_votes":10,"body":"I don't get how having a premade on your team means you have no say in the game. destroy your lane, gank other lanes, make tp plays. I'm willing to bet 90 percent of solo players are in the same elo range as they were last season without dynamic queue. Stop using premades as an excuse for why you can't climb. the new 'elo hell' is dynamic queue.","replies":[{"poster":"Fovere","date":"2016-04-19T11:47:52.321+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=DexterousGecko,realm=NA,application-id=3ErqAdtq,discussion-id=pzRd3gG5,comment-id=000c,timestamp=2016-04-19T01:51:07.425+0000)\n>\n> I don&#x27;t get how having a premade on your team means you have no say in the game. destroy your lane, gank other lanes, make tp plays. I&#x27;m willing to bet 90 percent of solo players are in the same elo range as they were last season without dynamic queue. Stop using premades as an excuse for why you can&#x27;t climb. the new &#x27;elo hell&#x27; is dynamic queue.\n\nIt's not hard to understand.  Friends respond to friends more than strangers.  They are going to play around you rather than with you.","replies":[]},{"poster":"LoveEmma","date":"2016-04-19T05:13:26.253+0000","up_votes":1,"down_votes":4,"body":"Funny how they downvoted you. I see nothing wrong with this post.","replies":[{"poster":"Stemw3","date":"2016-04-19T09:50:45.489+0000","up_votes":3,"down_votes":0,"body":"Like 2/3 of the post is \"wrong\". More exactly: \" I'm willing to bet 90 percent of solo players are in the same elo range as they were last season without dynamic queue. Stop using premades as an excuse for why you can't climb. the new 'elo hell' is dynamic queue.\" \nThe OP does not talk about not being able to climb playing solo. He/she is talking about having an impact in the game.","replies":[]}]},{"poster":"The Queen Viper","date":"2016-04-19T11:39:48.282+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DexterousGecko,realm=NA,application-id=3ErqAdtq,discussion-id=pzRd3gG5,comment-id=000c,timestamp=2016-04-19T01:51:07.425+0000)\n>\n> Stop using premades as an excuse for why you can&#x27;t climb.\n\nIt's easier than ever to climb now, if you abuse the stacking / grouping.\n\nBeing a solo player, sure it's a bit harder to climb due to premades.\n\nRegardless, mixing up solo players and premades is retarded and should never happen in the first place... since it creates imbalanced games.","replies":[]}]},{"poster":"xl Kirito lx","date":"2016-04-18T18:43:17.359+0000","up_votes":6,"down_votes":19,"body":"So, you didn't roam as top lane, and didn't accomplish anything?  That's not a premade preventing you from having an impact, that's you not leaving your lane.","replies":[{"poster":"Troll for Trump","date":"2016-04-18T20:42:31.654+0000","up_votes":10,"down_votes":2,"body":"*tps bot*\n*premade bot lane backs away*\n*spam ? pings*\n\"report noob top\"","replies":[{"poster":"LittleBlast","date":"2016-04-19T16:50:37.064+0000","up_votes":2,"down_votes":0,"body":"Is that really a problem with the premade tho? I find that people do that in non premade games alot aswell. Your talking about idiots/trolls. They can be premade but they arent always.","replies":[{"poster":"Troll for Trump","date":"2016-04-19T19:26:59.826+0000","up_votes":1,"down_votes":0,"body":"The difference is, that when the others are nonpremade, you might get something like this:\n\n\"Noob support Thresh no land hook\"\n\nPlayerthatisn'tBot: \"Stfu Vayne, you're 0/5, you don't ward etc.\"\n\nBasically with solo queue you might get someone that supports you, games won't be as snowbally, people might actually help and talk sense","replies":[{"poster":"Zaryelle","date":"2016-04-19T20:06:27.222+0000","up_votes":1,"down_votes":0,"body":"Had the same type of bullshit with premades. I come to help their lane and they have over half health/mana and they still recall. Any time I go to help they just blow it off and recall, or any time they die it's my fault if I'm support","replies":[]}]}]}]}]},{"poster":"KetiaX","date":"2016-04-18T20:29:22.413+0000","up_votes":1,"down_votes":12,"body":"I'll take the freelo any day.","replies":[{"poster":"Xonra","date":"2016-04-19T03:21:29.784+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=KetiaX,realm=NA,application-id=3ErqAdtq,discussion-id=pzRd3gG5,comment-id=0004,timestamp=2016-04-18T20:29:22.413+0000)\n>\n> I&#x27;ll take the freelo any day.\n\nSome of us like to play this game for fun. Not everyone is worried about ONLY winning and ONLY climbing. If I enjoyed none of my games and got to challenger tomorrow, I would hate this game, because I wouldn't enjoy it.\n\nIf I never ever go past silver, but enjoy this game, I will be perfectly fine with that.","replies":[{"poster":"KetiaX","date":"2016-04-19T15:55:52.963+0000","up_votes":1,"down_votes":0,"body":"Try and find something positive that you can gain from it. Just focusing on the \"fun\" part of it isn't gonna help you enjoy the game, because the game community is already insanely toxic that more often than not you play with people that are toxic. I take the freelo as something positive I can gain from such games, because like you said, nothing fun can be gained from a 5v4.","replies":[{"poster":"Xonra","date":"2016-04-19T20:32:54.047+0000","up_votes":2,"down_votes":0,"body":"I already find ways to have fun, and I don't have to just try and climb to have fun. There is nothing fun about being bullied by a premade, or being against a premade (whether you have one or not). \n\nYou are basically saying you are okay with a system that adds more negativity because it is \"already bad enough\". That is a rather sad statement to make, and sad that someone argues that point as if it is valid (I'm not saying you are completely wrong, just saying that someone making that statement is a huge bummer).","replies":[{"poster":"KetiaX","date":"2016-04-19T22:11:24.973+0000","up_votes":2,"down_votes":0,"body":"I'm not okay with the bad system. It's more like there's nothing I could do to change it. So many people have requested for changes, and did they get anything? Nope. Good example would be Solo Queue. People want it, but if Riot doesn't implement it, then nothing people can do about it. It's Riot's game. Are you gonna argue that Riot will lose a chunk of their customers if they don't? Well, they won't, as we've seen from the past complaint about the lack of Sandbox mode.\n\nYou may think my statement and my way of thinking is sad because you're North American, but as someone born in a 3rd world country, I feel your way of thinking is the one saddening, because you're trying to change what you don't have the power to, to fit it in the way you like it. It's great and admirable, but I'd rather find other ways to make use and/or enjoy them rather than making futile attempts in changing them.","replies":[]}]}]},{"poster":"Karma Deified","date":"2016-04-19T14:06:04.743+0000","up_votes":2,"down_votes":0,"body":"Well said.","replies":[]}]}]},{"poster":"Eevee In A Jar","date":"2016-04-19T15:10:33.195+0000","up_votes":3,"down_votes":0,"body":"I don't see how Riot believes working with the same people over and over constitutes as being a good teammate. If anything it makes them a bad team player overall; I can best describe this by comparing it to anime called Haikyuu; about volleyball. There are two different setters in different teams. One is a prodigy genius but for the longest time someone named Oikawa who was inferior in skill was considered better because no matter what team Oikawa played in, he utilized his team to the best.","replies":[]},{"poster":"SSShutTheDuckUp","date":"2016-04-19T13:41:48.395+0000","up_votes":3,"down_votes":0,"body":"This is pretty much the reason why I want a Solo queue. Feeling that I do not have impact on the game outcome is the most demotivating feeling in a game.","replies":[]},{"poster":"a doomed carry","date":"2016-04-19T16:49:45.360+0000","up_votes":2,"down_votes":0,"body":"Was teamed up with a trio que yesterday while I was solo Q. They had Mid/ adc / supp roles taken. Went with Yasuo adc. While we did well and actually won the game pretty easily, it wasn't fun , they weren't great teamates ( I asked them to check red for me or ward it  at the start simple reply was \"No \" ) It wasn't a game I enjoyed playing , Not sure if they were higher elo smurfs and trolling around or what it was, but I often feel like elo is so random and climbing is very lucky this season. Yasuo adc at Gold 2 seems a little strange.","replies":[]},{"poster":"brexnation21","date":"2016-04-19T15:03:46.068+0000","up_votes":2,"down_votes":0,"body":"I will be completely honest.   Solo que was a lot easier to win then this new DQ shit.  While youd occasionally get the troll duo or salty ass SINGLE person you could mute them and force their sorry asses to win.  Now with that going up to a potential of 4 trolls on your team its becoming a nightmare.  On my main i was able to get to gold within 2 weeks because i placed silver 1 start of season. On this account i placed silver 3 and have been failing to get into gold ever since (i could blame runes which i want to cause holy shit this accounts screwed there, but no i cant)  i get premades that are shit, premades that refuse to listen, premades that \"carry the game\" but shit talk and make me feel useless and like an idiot.  The compettitive scene is not fun anymore.  The removal of playing in a seperate environment with friends then solo got removed and we all hate it.\n\n\npoof im ranting :D","replies":[]},{"poster":"zmmby","date":"2016-04-19T14:20:13.822+0000","up_votes":2,"down_votes":0,"body":"I love premades! \n\n\"Pedro3923320932\" \ngoes leona bot, hit E twice under the entire game\n1/11/3\n\nlissandra mid\n1/10/5\n\ngoes into a unwarded bush in their area for no reason solo and dies \n\n\"jajajajajajajjaja xD huehehuehuehu\"","replies":[]},{"poster":"Pheron","date":"2016-04-19T09:34:29.055+0000","up_votes":2,"down_votes":0,"body":"I already said something like that: even if I'm doing a good game I feel that the outcome of the match isn't in my hands at all.\n\nBtw:  http://boards.na.leagueoflegends.com/en/c/gameplay-balance/j61l64En-flaws-of-dynamic-que,","replies":[]},{"poster":"Average Bard","date":"2016-04-19T07:11:07.148+0000","up_votes":2,"down_votes":0,"body":"A top laner?  {{champion:412}}  Please, I was born in the ignorant teammates, molded by them. I didn't see a good ADC until I was a man. You simply adopted them. Lol, but seriously being a support main in bronze/low silver is like asking to be punched in the face with a sledgehammer.","replies":[]},{"poster":"Fisk","date":"2016-04-19T03:54:40.285+0000","up_votes":2,"down_votes":0,"body":"Just curious on what you guys would think about this system. Its a club queue with solo duo queue back. Just looking for feedback and stuff. Thoughts? http://boards.na.leagueoflegends.com/en/c/gameplay-balance/r8UEtqTA-instead-of-dynamic-queue-how-about-club-queue","replies":[]},{"poster":"Invictus Unbent","date":"2016-04-19T11:40:45.264+0000","up_votes":3,"down_votes":1,"body":"Upvoted & signed. \n\nBring back **solo queue**","replies":[]},{"poster":"Tobias Brackner","date":"2016-04-19T05:29:57.540+0000","up_votes":3,"down_votes":1,"body":"I never notice if I'm playing with or against a premade.\n\nAll the premades I've formed from rando invites have been no more coordinated than regular randos.","replies":[]}]}