{"poster":"LoveTheWayYouDie","date":"2015-08-26T17:24:10.483+0000","title":"Botlane sucht Team/Teammitglieder","subforum":"Clans & Teams","up_votes":2,"down_votes":1,"body":"Unsere Botlane besteht aus mir als Supporter und nifi1011 als ADC. Wir sind auf der Suche nach Jungler, Toplaner und Midlaner, welche Interesse daran haben, mit uns ein Team aufzubauen.\n\nElo sollte so im Silber-Gold-Bereich sein.\n\nWir haben noch weitere (eigentlich selbstverst&auml;ndliche) Vorraussetzungen f&uuml;r unsere Interessenten:\n\n- Wir wollen keinen Flamer/Ragequitter/Schuld-von-sich-selbst-Wegschieber.\n- Man muss geistige und soziale Kompetenzen vorweisen k&ouml;nnen.\n- Wir wollen Leute haben, die sich in der ADC/Jungler-Rolle wohlf&uuml;hlen und sie wirklich mainen oder zumindest &uuml;ber genug Ahnung &uuml;ber die Champions und Spielweisen dieser Rollen verf&uuml;gen.\n- Man braucht TeamSpeak 3, sonst k&ouml;nnen wir uns schlecht unterhalten und absprechen.\n- Wir wollen ein Team aufbauen, also brauchen wir auch Teamspieler! Man muss sich also an Abmachungen halten k&ouml;nnen und f&uuml;r sein Team spielen k&ouml;nnen, nicht nur f&uuml;r sich selbst.\n- Wir wollen uns auf Trainingszeiten einigen k&ouml;nnen.\n- Uns geht es schon ums Gewinnen, aber wir wollen keine Tryharder.\n- Wir sind auf der Suche nach netten Menschen, mit denen wir Spa&szlig; haben k&ouml;nnen, damit wir alle eine nette Zeit miteinander verbringen.\n\nWir freuen uns schon auf euch! &hearts;\n\nEdit: Einfach ingame adden und anschreiben.","replies":[{"poster":"TorChs","date":"2015-08-26T21:03:05.886+0000","up_votes":1,"down_votes":0,"body":"hi ich bin ben gold 5 main top und wäre bestimmt eine bereicherung für das team JEDOCH verstehe ich den punkt mit den tryharden nicht wenn man teamranked macht und das mit trainingszeiten etc sollte man schon tryharden oder verstehe ich eure definition von rtyharden falsch","replies":[{"poster":"LoveTheWayYouDie","date":"2015-08-29T16:03:03.792+0000","up_votes":1,"down_votes":0,"body":"Meine Definition von Tryharder ist diese:\nJemand, der sich, sagen wir mal Challenger, als Ziel gesetzt hat und jeden flamet, wenn er einen kleinen Fehler macht. Man sollte Fehler von anderen und sich selbst akzeptieren können und immer daran denken, dass es auch um Spaß geht.\nNatürlich soll man sich bei Rankeds Mühe geben, aber man sollte sich nicht über das Team stellen und versuchen, alleine zu gewinnen, weißt du?\nWir können gerne Testgames machen.","replies":[{"poster":"TorChs","date":"2015-09-02T11:56:31.944+0000","up_votes":1,"down_votes":0,"body":"ja gut ich hatte gedacht ihr wollt so halbwegs trollen ich werde dich ingame mal adden bin aber zu main jungle geswaped kann aber immer noch beides auf einem silber gold niveau spielen{{summoner:30}} {{summoner:31}}","replies":[]}]}]},{"poster":"Xoor","date":"2015-08-26T20:11:18.223+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"LoveTheWayYouDie","date":"2015-08-29T15:58:40.301+0000","up_votes":1,"down_votes":0,"body":"Hallo ^^\nHab angenommen und kann ebenfalls nur sagen, dass wir regelmäßig abends in sind :D\nEin paar Testgames an diesem IP-Boost-Wochenende wären doch ganz cool? ;D\n\nLG","replies":[]}]},{"poster":"AnnoyingFish","date":"2015-08-27T01:46:54.687+0000","up_votes":1,"down_votes":0,"body":"Hey Main Jung mit eher Tanks wie Zac VI Voli","replies":[]},{"poster":"Drizzlek","date":"2015-08-26T19:55:31.752+0000","up_votes":1,"down_votes":0,"body":"Hey ich hätte interesse an der Toplane position hab euch beide mal in lol geaddet ^^{{item:3612}}","replies":[]}]}