{"poster":"iNQ MentalBoomer","date":"2016-07-22T08:45:37.265+0000","title":"Silver Support sucht einen ADC (für Ranked)","subforum":"Clans & Teams","up_votes":0,"down_votes":0,"body":"Hiho wie du schon oben lesen kannst suche ich derzeit einen ADC. Ich selbst bin 19 und war Support Main bevor ich vor 6 Monaten dann anfing Midlane zu mainen. Das hat auch ganz gut geklappt aber der Spa&szlig; ging nach einer Weile verloren und als ich dann wiedermal nach einer langen Zeit Supportet habe, habe ich mich entschieden wieder zu Supporten. Zurzeit bin ich leider noch ein {{champion:412}} OTP, da er der Champion mit den h&ouml;chsten Mastery Points bei mir ist, aber ich versuche gerade noch andere Supporter zu finden die ich spielen kann. Ich bevorzuge Mechanic Supporter wie {{champion:412}} und Tank Supporter wie {{champion:111}} und {{champion:201}}, die ich auch einigerma&szlig;en behersche. Welche Supporter ich nicht so gut kann sind AP Supporter wie {{champion:40}}, {{champion:432}} und {{champion:267}} wobei ich {{champion:16}} zur not auch noch spielen kann.\r\n\r\nMeine Anforderungen and den ADC w&auml;ren, dass er wenigstens Silber 5 ist, Keiner ist der gleich Ausrastet sollte ich mal einen Fehler machen (da ich ja erst wieder in Supporten reinkommen m&ouml;chte und ich keineswegs Perfekt spiele), TS sollte vorhanden sein (ich h&auml;tte einen Channel), Jemand der vllt Tipps geben kann und Spa&szlig; am Spiel haben m&ouml;chte. &lt;3\r\n\r\nFalls du Interesse hast adde einfach Yuuji v2. \r\n\r\nHauter Rein vllt sieht man sich ja.^^\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"KAPPOBY","date":"2016-07-22T08:56:16.712+0000","up_votes":1,"down_votes":0,"body":"Du hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]}]}