{"poster":"Nabbomaster","date":"2015-08-18T13:45:50.489+0000","title":"Nuova thormail debuff","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"qualcuno sa spiegarmi perche&#039; sul pbe mettono la nuova thormail come un debuff?\r\nmi pare di aver capito che adesso rifletta il 15% + 25% dell&#039;armatura bonus\r\nconsiderando che solo coi 100 armor della thormail sono altri 25% di base riflette 40% o sbaglio?\r\nanche se costa 200 gold in piu&#039; non mi pare un debuff anzi secondo me fare l&#039;adc sara molto piu&#039; difficile\r\nsi vedranno cose tipo 100% e passa di danni riflessi senza considerare gente come malphite","replies":[{"poster":"kirchhoff","date":"2015-08-18T20:23:44.229+0000","up_votes":1,"down_votes":0,"body":"danno = 0.15 x [autoattacchi del nemico] + 0.25 x [tua armatura bonus]","replies":[]},{"poster":"PolloPowa","date":"2015-08-18T13:48:34.579+0000","up_votes":1,"down_votes":0,"body":"La thornmail non la buildiamo contro gli adc ma solo casi rari come yi yasuo irelia\n\nContro gli adc meglio randuin e frozen rallentano l'atk speed e danno bonus ottimi\n\nSe buildo la thornmail non hai vita\nse hai vita e la thornmail non ha danni\nse hai tutto sei strafeddato e l'adc se ne fa una ragione","replies":[{"poster":"Elraton94","date":"2015-08-18T18:21:05.381+0000","up_votes":1,"down_votes":0,"body":"Non la buildiamo chi? Perché parli al plurare?","replies":[{"poster":"PolloPowa","date":"2015-08-18T20:04:35.509+0000","up_votes":1,"down_votes":0,"body":"So io,tu buildarla quello che vuoi","replies":[]}]},{"poster":"Giovarco","date":"2015-08-18T14:25:21.283+0000","up_votes":1,"down_votes":0,"body":"Proprio contro Yi e Irelia non serve a molto la TM perché loro fanno danni puri.","replies":[{"poster":"PolloPowa","date":"2015-08-18T17:34:04.466+0000","up_votes":1,"down_votes":0,"body":"Proprio Yi che di thornmail esplode da solo anche perchè all'inizio di lancia su un carry e non su uno con la thornmail asd (provato e assicurato ero Vi thornmail si è sciolto da solo)\nirelia ok ma comunque i danni gli tornano e non hanno costantemente le attive per fare danni puri in teoria\n\nAllora se come dici te non buildiamo ci un minimo di armor che tanto è inutile facciamoci esplodere k.","replies":[{"poster":"Giovarco","date":"2015-08-18T18:18:09.004+0000","up_votes":1,"down_votes":0,"body":"I campioni sopracitati normalmente si fanno almeno un po' di lifesteal, specialmente Yi. I danni puri fanno il resto, visto che scalano con l'attack speed e non con l'AD. Inoltre per counterare la thornmail ci sono tantissimi mezzi come la LW oppure stackare lifesteal può essere un'idea con alcuni campioni.","replies":[{"poster":"PolloPowa","date":"2015-08-18T20:03:43.575+0000","up_votes":1,"down_votes":0,"body":"Devo veramente rifare un game con te presente facendoti vedere che pur essendo vi messa così è così vado su un yi feddato e si fa un sacco di danni da solo?con tutto che aveva un BT\n\nAllora la thornmail non a senso anche gli adc si fanno lifesteal\n\nCioè è un item inutile lol tanto c'è chi fa danni puri \nesistono anche i ninja tabi comunque","replies":[]}]}]}]}]},{"poster":"SennaFirstPick","date":"2015-08-18T16:58:15.117+0000","up_votes":1,"down_votes":0,"body":"Thornmail\n1. Cost increased to 2300 from 2100. \n2. Passive: Now reflects [15% of pre-mitigation damage and 25% of your bonus Armor.] instead of [30% pre-mitigation damage]","replies":[]},{"poster":"IrrationalNumber","date":"2015-08-18T14:06:55.235+0000","up_votes":1,"down_votes":0,"body":"No aspe\n\nil 25% di 100 e' 25, non 25%. Vuol dire che rifletti 15% di danno dell'adc nemico + 25 in danno magico. E' un debuff perche' non si basa piu' sul \"danno\" dell'adc nemico, si basa su quanta armatura hai tu. Vuol dire che e' piu' forte lategame ma anche  leggermente piu' inutile perche' lategame l'adc avversario ha molta lifesteal.","replies":[{"poster":"Giovarco","date":"2015-08-18T14:24:06.736+0000","up_votes":1,"down_votes":0,"body":"Infatti, a tal proposito, stavano pensano di diminuire passivamente il lifesteal di chi attacca il personaggio con la thornmail perché ovviamente la versione nel PBE è un nerf.","replies":[{"poster":"IrrationalNumber","date":"2015-08-18T14:29:53.053+0000","up_votes":1,"down_votes":0,"body":"Piu' che altro rendono la thornmail inutilizzabile: o la rusho (e come secondo o terzo item non e' molto utile) e non la sfrutto adeguatamente perche' non ho abbastanza vita/armor, o la faccio come quinto/sesto oggetto quando ormai e' inutile perche' a meno di essere molto feedato io (cosa difficile per un tank), l adc nemico avra' abbastanza sustain da ignorare l'effetto thornmail quasi completamente. Quindi qualcosa come annullare la lifesteal nemica, specie con tutti sti jungler che rushano botrk, e' indispensabile  a meno di inculare i tank a morte.","replies":[]}]},{"poster":"Nabbomaster","date":"2015-08-18T14:22:02.875+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tomatotimer,realm=EUW,application-id=MJVj50Jw,discussion-id=zZ7qGgov,comment-id=0001,timestamp=2015-08-18T14:06:55.235+0000)\n>\n> No aspe\n> \n> il 25% di 100 e' 25, non 25%. Vuol dire che rifletti 15% di danno dell'adc nemico + 25 in danno magico. E' un debuff perche' non si basa piu' sul \"danno\" dell'adc nemico, si basa su quanta armatura hai tu. Vuol dire che e' piu' forte lategame ma anche  leggermente piu' inutile perche' lategame l'adc avversario ha molta lifesteal.\n\nah ok io pensavo che fosse il 25% dei danni del nemico, se e' cosi adesso fa schifo","replies":[]}]}]}