{"poster":"GregGuitar","date":"2016-09-26T17:04:37.714+0000","title":"Comportamento negativo da parte di altri giocatori e penalità","subforum":"Discussioni generali","up_votes":1,"down_votes":3,"body":"Salve a tutti evocatori.\r\n\r\nQuello di cui vorrei discutere &egrave; il comportamento negativo e scorretto da parte di moltissimi dei giocatori di LoL.\r\nQuesto &egrave; un topic sicuramente gi&agrave; molto affrontato e non vorrei creare l&#039;ennesimo post uguale a tutti gli altri, quindi eventualmente informatemi o eliminate la discussione, ma vi prego prima di leggere quello che ho da dire.\r\n\r\nMi &egrave; capitato oggi di giocare una partita con fiora contro una irelia che non sapeva giocare. E per non sapeva giocare intendo il commettere degli errori come rimanere in lane con veramente poca vita contro una fiora full con tanto di ulti e flash e simili.\r\nPer tutto il tempo questa irelia non ha fatto altro che insultarmi dandomi del noob e facendo volare insulti su mia madre e quant&#039;altro, nonch&egrave; accusarmi di cheat e uso di script, minacciando di reportarmi a fine partita. Per tutto il tempo &egrave; stata insopportabile (l&#039;ho anche mutata).\r\nLa goccia che ha fatto traboccare il vaso &egrave; stata che, nonstante tutto, abbia vinto la partita. Non contesto la vittoria, in quanto il loro team ha giocato in generale meglio ed il mio vantaggio &egrave; stato di poco aiuto al mio di team, quanto il fatto che sia stato veramente scortese da parte sua coprirmi di insulti ed esultare per una vittoria ottenuta non per merito suo.\r\n\r\nOra, lo so che molti subito mi faranno presente che esistono i ban per cose di questo genere (infatti a fine partita l&#039;ho reportata), ma vi spiego perch&egrave; sto creando una ennesima discussione sull&#039;argomento.\r\n\r\nQuesta partita ha rovinato la mia esperienza di gioco come nessun&#039;altra (perch&egrave; tanto di giocatori tossici se ne incontrano) e mi &egrave; parso che un semplice report non avrebbe comunque &quot;punito&quot; il giocatore come invece si meriterebbe. Penso che i report di lol non siano abbastanza efficaci quanto, in certi casi, dovrebbero. Vorrei che per i giocatori che rovinano una partita e l&#039;esperienza di gioco fino a questo punto non ricevessero una semplice scritta che li informa sul loro recente comportamento scorretto e fine, ma qualcosa di pi&ugrave; marcato che _realmente_ li persuadesse a non continuare a comportarsi in modo cos&igrave; tossico.\r\n\r\nCapisco che a volte qualcuno possa avere delle giornatacce o si possa arrabbiare perch&egrave; magari un champ &egrave; sbilanciato o altri problemi (personali) che rovinano la loro esperienza di gioco, anche io ho avuto delle giornate decisamente negative, ma al massimo mi sono limitato ad urlare allo schermo del computer e a cercare di capire i miei errori, invece di insultare altri per il semplice fatto che stanno giocando una partita migliore della mia.\r\n\r\nOra, io vorrei chiedere una miglioria al sistema di report e ban che lo renda effettivamente pi&ugrave; efficace, affich&egrave;, anche se un giocatore incontra persone di questo genere, abbia, se non altro, la soddisfazione di sapere che un tale comportamento non rimarr&agrave; impunito. Almeno, per l&#039;esperienza che ho avuto con i report, mi ha sempre dato l&#039;idea di non essere un sistema efficace (ma posso sbagliare io).\r\n\r\nQuesta &egrave; semplicemente una cosa che volevo portare all&#039;attenzione, e cio&egrave; che sia pieno di giocatori cos&igrave;.\r\n\r\nSe qualcuno, leggendo questa discussione, noti che non &egrave; messa in una sezione adeguata o che ce ne sono altre 100.000 identiche, me lo faccia notare e vedr&ograve; di correggermi.\r\n\r\nInoltre se qualcuno sa se sia possibile mandare email a qualcuno del supporto per questo tipo di lamentele me lo dica.","replies":[{"poster":"JRobich","date":"2016-09-27T07:47:43.121+0000","up_votes":1,"down_votes":0,"body":"allora vorrei premettere che in tutti gli elo ci sono i flame...\n\nma in bronzo, in bronzo... OMG....\n\nho giocato ieri con un amico che è bronzo e ho preso l'account dove faccio solo normal e li sono tipo livello 26...\n\nho visto cose assurde gente che stava più tempo a scrivere che a giocare...\n\ntaric support che mi dice (io mid) \"gg mid laner no ward....\" e lui non aveva neanche la {{item:2049}} ......\n\ngente che in team selection decide di giocare {{champion:55}} ma il mid è già preso allora ci vanno support....\n\n\npoi ovviamente non voglio commentare gli errori tipo in team fight il focus sul tank... li non voglio dire niente le persone (io compreso) sbagliano e si devono migliorare...\n\nma il flame è veramente una cosa pessima in bronzo visto che:\n\nnon flammano se fai un errore flammano random....\n\ncmq il massimo che puoi fare a mutare e reportare a fine game....\n\nio credo che la cosa migliore sia limitare 5 messaggi a game per ogni utente....","replies":[]},{"poster":"Chroniicles","date":"2016-09-26T22:13:10.913+0000","up_votes":1,"down_votes":0,"body":"Non voglio commentare il tuo sì ripetitivo ma anche legittimo sfogo/pensiero, però volevo informarti che\n>Inoltre se qualcuno sa se sia possibile mandare email a qualcuno del supporto per questo tipo di lamentele me lo dica.\n\nNo, non è possibile. Non sono gli addetti al supporto che si occupano di impartire punizioni, possono però aiutarti in caso sia tu a riceverne una","replies":[]},{"poster":"ZZALA","date":"2016-09-26T20:52:27.054+0000","up_votes":1,"down_votes":0,"body":"Se non capite che League Of Legends non può cambiare le persone che flammano e che dovrebbe permabannarle per IP così non inquinano il sistema come stanno facendo , c'è poco da dire .\n\nCon sta storia \" esperienza di gioco \" stai solo giocando non c'è nessuna esperienza .","replies":[]},{"poster":"Dreggarr","date":"2016-09-26T18:45:51.218+0000","up_votes":1,"down_votes":0,"body":"Mi dispiace dirlo anche perchè sono relativamente nuovo pure io (qualche mese di esperienza) ma... Benvenuto su League of Legends! ^^ L'unico consiglio che posso darti che ho capisco pure io da pochissimo tempo è : Muta la gente che flamma te o altri ti aiuta solo a perdere concentrazione e non flammare a tua volta, purtroppo la gente toxic ci sarà sempre e questa è l'unica soluzione. \nIl report funziona a volta, mi capita che dopo aver reportato qualcuno dopo un paio di minuti compaia un messaggio \"Un tuo report è stato utile per bla bla\" non ricordo benissimo... Comunque per concludere, Muta e divertiti ^^","replies":[]}]}