{"poster":"barbarianskull","date":"2016-06-02T11:29:06.217+0000","title":"Riot you forgot to add the best gamemode to the rotating queue","subforum":"Gameplay","up_votes":552,"down_votes":84,"body":"Solo Queue","replies":[{"poster":"MotrColt","date":"2016-06-02T11:34:03.867+0000","up_votes":49,"down_votes":0,"body":"lol, respect","replies":[{"poster":"3ofGot40ve","date":"2016-06-02T14:38:50.462+0000","up_votes":6,"down_votes":0,"body":"http://www.auplod.com/u/auldop7ebf8.jpeg\n\nPut some respeck on it","replies":[]},{"poster":"Valhalla Rising","date":"2016-06-02T17:09:40.906+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MotrColt,realm=NA,application-id=3ErqAdtq,discussion-id=Av35hKfH,comment-id=0000,timestamp=2016-06-02T11:34:03.867+0000)\n>\n> lol, respect\n\nOhh my god get rekt rito","replies":[]}]},{"poster":"TyroneWatermelon","date":"2016-06-02T11:48:32.821+0000","up_votes":24,"down_votes":87,"body":"So expected.\nTypical upvote farm\nNow with braindead gameplay users keep upvoting trash threads Riot will keep sitting silent and not communicating.\nInb4 downvoted in coming.","replies":[{"poster":"Sir Hammerlock","date":"2016-06-02T11:55:50.388+0000","up_votes":18,"down_votes":68,"body":"Upvote from me, downvoted the OP. It's true, people are just using this news to upvote farm and continue hate mongering.\nThey wonder why Riot barely interacts with the community anymore, compared to how they used to interact with it back between 2010-2012.\n\nThis community has no one to blame but themselves for being so ignorant when creating thousands upon thousands of hate-threads.","replies":[{"poster":"BakedLotion","date":"2016-06-02T11:58:41.671+0000","up_votes":55,"down_votes":8,"body":"> [{quoted}](name=Sir Hammerlock,realm=NA,application-id=3ErqAdtq,discussion-id=Av35hKfH,comment-id=00040000,timestamp=2016-06-02T11:55:50.388+0000)\n>\n> Upvote from me, downvoted the OP. It&#x27;s true, people are just using this news to upvote farm and continue hate mongering.\n> They wonder why Riot barely interacts with the community anymore, compared to how they used to interact with it back between 2010-2012.\n> \n> This community has no one to blame but themselves for being so ignorant when creating thousands upon thousands of hate-threads.\n\nOr you know, they actually want solo queue back.","replies":[{"poster":"Slythion","date":"2016-06-02T12:04:04.689+0000","up_votes":33,"down_votes":5,"body":"nah man, that concept is too hard to grasp","replies":[{"poster":"Combozone","date":"2016-06-03T00:01:35.165+0000","up_votes":8,"down_votes":0,"body":"I guess you could say...\nThe want for solo queue is the GRASP OF THE UNDYING","replies":[{"poster":"Slythion","date":"2016-06-03T01:44:24.388+0000","up_votes":3,"down_votes":0,"body":".........................................................................................that tilted me","replies":[]},{"poster":"Outta Sippies","date":"2016-06-03T02:51:25.508+0000","up_votes":2,"down_votes":0,"body":"after reading this comment, I proceeded to lose multiple games as fizz, going negative somehow","replies":[]}]}]}]},{"poster":"Miss Mommy","date":"2016-06-02T12:20:45.331+0000","up_votes":35,"down_votes":4,"body":"> [{quoted}](name=Sir Hammerlock,realm=NA,application-id=3ErqAdtq,discussion-id=Av35hKfH,comment-id=00040000,timestamp=2016-06-02T11:55:50.388+0000)\n>\n> Upvote from me, downvoted the OP. It&#x27;s true, people are just using this news to upvote farm and continue hate mongering.\n> They wonder why Riot barely interacts with the community anymore, compared to how they used to interact with it back between 2010-2012.\n> \n> This community has no one to blame but themselves for being so ignorant when creating thousands upon thousands of hate-threads.\n\nIt's almost like the community fucking hates Dynamic Queue or something.","replies":[{"poster":"DarkRitual","date":"2016-06-02T14:32:56.607+0000","up_votes":6,"down_votes":25,"body":"A non-majority portion of the comminity*","replies":[{"poster":"Slappybiscuit","date":"2016-06-02T17:02:12.503+0000","up_votes":12,"down_votes":2,"body":"I love it! Its both an upvote farm AND a non-majority. It's almost like the two contradict each other.","replies":[{"poster":"Registeel1234","date":"2016-06-02T18:02:13.369+0000","up_votes":6,"down_votes":3,"body":"The majority of the players do not come to the forums/reddit. Hence the non-majority of the community.\n\nHowever, we can't say that the majority of the community like (or dislike) Dynamic Queue. We would have to make a survey across the entire community (so it cannot be in the forums, since most of the people that are here right now are because they really hate dynamic queue).\n\nWe would have to host a survey on another website and send the link in post-game lobby, asking the players to fill out the survey.","replies":[{"poster":"Miss Mommy","date":"2016-06-02T18:10:14.310+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=Registeel1234,realm=NA,application-id=3ErqAdtq,discussion-id=Av35hKfH,comment-id=000400000001000100010000,timestamp=2016-06-02T18:02:13.369+0000)\n>\n> The majority of the players do not come to the forums/reddit. Hence the non-majority of the community.\n> \n> However, we can&#x27;t say that the majority of the community like (or dislike) Dynamic Queue. We would have to make a survey across the entire community (so it cannot be in the forums, since most of the people that are here right now are because they really hate dynamic queue).\n> \n> We would have to host a survey on another website and send the link in post-game lobby, asking the players to fill out the survey.\n\nWhen even professional players hate DQ and a former Master tier player QUIT because of one game in DQ that he WON, you know your system is fucked.  It's not just us.  Scarra fucking hates DQ.  A majority of actual high elo players hate DQ.\n\nYeah, the majority of the community does not visit boards, but I can take a wild guess that if they did, this would still ring true on boards that DQ sucks to nearly everyone.\n\nAnd Riot isn't gonna do shit to fix it.  They went back on something AGAIN.  I'm honestly not even surprised anymore why people trust this company.  Magma Chamber, Bruiser Rework, Camera Flip, GD being forced to move to Boards even after promising not to do such a thing?\n\nIs there ANY reason to believe Riot whatsoever now?","replies":[{"poster":"Registeel1234","date":"2016-06-02T18:31:09.103+0000","up_votes":3,"down_votes":0,"body":"I totaly agree with you: DQ has major flaws that the previous system didn't had. The least they should do is prevent Premade 4 to enter the queue.\nI also do think that the majority of the community hates DQ (as seen from the like/dislike ratio on Rito's video)\n\nI'm just saying that we can't say that the majority of the community like/hates DQ for sure, since we only have the vocal community's point of view.","replies":[]}]},{"poster":"GayFluffyUnicorn","date":"2016-06-03T17:02:54.116+0000","up_votes":1,"down_votes":0,"body":"How about: \n\"the majority of the players simply doesn't care about the game enough to voice their opinions on the forums/reddit/youtube/ w/e\". \nOr to say it in other words: \nIf you avoid going to elections you shouldn't complain about the political situation.\nSo just stop defending DynQ and let those who want a change/try to achieve their goal voice their opinions. \nThe rest of the community simply doesn't matter if they don'T use their given right to voice their opinion in this topic.\nIf DynQ is so beloved you can make a thousand threads to defend it but since the majority doesn't care we don't care either how big the SoloQ supporters actually are.","replies":[]}]}]}]},{"poster":"AninLegions777","date":"2016-06-02T13:01:51.123+0000","up_votes":3,"down_votes":2,"body":"Oh wait...","replies":[]}]}]},{"poster":"Slythion","date":"2016-06-02T11:56:04.833+0000","up_votes":20,"down_votes":3,"body":"Wait, so when someone actually makes a witty joke while still pointing out we want SQ it's an \"upvote farm\" thread. Did it ever occur to you that we simply just *agree* with him?\n\nAnd why call everyone \"braindead\" and call this thread \"trash\"? You're obviously trying to pick a fight simply because we have a different preference in queues than you lol, kinda petty.\n\nAnd how can you say that Riot has kept silent when they just came out with a video where they discuss DQ and state that SQ wont be coming (and how did you miss all the response posts on the boards after?)\n\nThere is just so much wrong with your incredibly negative post... facepalm","replies":[{"poster":"DarkRitual","date":"2016-06-02T14:34:11.698+0000","up_votes":6,"down_votes":12,"body":"One or two threads about soloq is fine, 57268 posts a day is just upvote farming.","replies":[{"poster":"Slythion","date":"2016-06-02T14:49:14.978+0000","up_votes":12,"down_votes":3,"body":"upvote farming or expressing our opinion on a subject? Just because there are a lot of us that dislike DQ means that we're just upvote farming, what kind of logic is that?\n\nSounds to me like you're just tired of seeing an opinion that differs from your own","replies":[{"poster":"TyroneWatermelon","date":"2016-06-02T16:19:14.161+0000","up_votes":1,"down_votes":13,"body":"Another ape with small brain who won't read someone's opinions.\nLet me make it clear;\nI'm not Against BUT NEITHER With the idea of DQ,and I stay neutral.\nWhat I DO say is that not every soloQ QQ with unintelligent meaning or polite discussion/idea,literally \"muh solo q\" needs to be upvotes,it's just shows Riot how the sheeps care nothing but their own opinions.\nMaybe you should look from Riot perspective,perhaps if Riot released a legit poll people who want soloQ may or may not be even 50% of the community.\nDon't forget muh soloQ for free upvotes","replies":[{"poster":"Slythion","date":"2016-06-02T17:43:18.115+0000","up_votes":12,"down_votes":1,"body":"Look at you, hiding behing primitive insults (hehe, \"ape\") because your jimmies were rustled (puns 100% intended).\n\nIn case you don't know, saying that you have no preference *is an opinion*, meaning that it differs from those who have opinions that favor SQ. I didn't realize that was a hard concept to understand :3\n\nAlso, you seem to enjoy the calling people \"sheep\" (proud of being independent or something?). You pride yourself on calling players out for not wanting to have a conversation, yet your comments are riddled with insults and everything designed to *end* a conversation (or at least create a poor one). Perhaps you should look in the mirror.\n\nIf you looked through my posts, you'd find one that I made stating exactly what you said: Riot should release a poll on the client for players to *really* say if they want SQ or DQ (or no pref of course). \n\nAnd also:\n\n> it just shows Riot how the sheeps care nothing but their own opinions\n\nI mean like...duh. The boards have always been a place for players to express their opinions and find others who agree/disagree. Telling a company what the playerbase wants is pretty important for any game, and unfortunately that requires *every* person to tell Riot what they want. We've all seen the arguments for/against DQ so having more conversations about it seems repetive. You are literally salty for players expressing their opinions lol","replies":[]}]}]}]}]},{"poster":"General Esdeath ","date":"2016-06-02T15:18:12.265+0000","up_votes":11,"down_votes":2,"body":"\"hurr ppl disagree wit me, must b upvote farm h8\"\n\nOr you know, we want fucking solo queue back.","replies":[{"poster":"TyroneWatermelon","date":"2016-06-02T16:22:22.383+0000","up_votes":1,"down_votes":13,"body":"\"Hurr durr muh soloQ\" how many times I need to explain you,intelligent gameplay surfers,that I don't have an opinion about the subject,therefore people can't disagree with me,and that the point of my post is to raise awareness of how the braindead sheeps of Gameplay upvote any single thread that has soloQ in it.","replies":[{"poster":"Velzard of Koz","date":"2016-06-02T16:52:37.439+0000","up_votes":6,"down_votes":2,"body":"I upvoted it because I found it funny, in connection wit Dominion removal, not because I'd want SoloQ back. And I believe many did it from the same reason. You stated your opinion about him upvote farming, it is you with luck of understanding who offends others to be unintelligent apes.","replies":[{"poster":"General Esdeath ","date":"2016-06-02T17:15:16.832+0000","up_votes":6,"down_votes":2,"body":"We can't disagree with him or we're morons, remember? :^)","replies":[]}]}]}]},{"poster":"MrWasjig","date":"2016-06-02T12:35:05.199+0000","up_votes":19,"down_votes":4,"body":"Did it not cross your mind that perhaps the reason these threads keep popping up is because people want SoloQ back?\n\nClearly not or else you wouldn't have called it upvote farming.","replies":[{"poster":"DarkRitual","date":"2016-06-02T14:36:54.008+0000","up_votes":3,"down_votes":11,"body":"There's a difference between discussion about wanting it back, and the boards being spammed with threads that offer 0 discussion or even thoughts by the poster.\nQuality over quantity. SoloQ threads have been pretty low-quality for several months, worse this week obviously. Almost none of them actually SAY anything other than \"I WANT IT BACK GIVE IT TO ME FUCK RIOT.\"","replies":[{"poster":"Slythion","date":"2016-06-02T14:50:53.477+0000","up_votes":7,"down_votes":1,"body":"and stating that you want something is bad? I don't see you going around berating people for posting all the \"qq nerf plz\" threads","replies":[]},{"poster":"Dextix LT","date":"2016-06-02T16:11:09.710+0000","up_votes":5,"down_votes":0,"body":"Because all of the arguments have been said already. Somehow they were ignored.","replies":[]}]}]}]},{"poster":"Lirik","date":"2016-06-02T14:28:18.677+0000","up_votes":16,"down_votes":0,"body":"i don't think they forget to add it, i think they lack of ressources to do it, you know just like they lacked of ressources for doniminon.","replies":[]},{"poster":"SlyTactician ","date":"2016-06-02T14:25:08.314+0000","up_votes":15,"down_votes":0,"body":"Definitely Not Solo Queue coming soon to a client near you?","replies":[{"poster":"AsphodelNext","date":"2016-06-02T16:19:52.319+0000","up_votes":3,"down_votes":1,"body":"Solo queue, but replace the dragon with a giant Gromp, supports are now indestructible but deal 20% damage, and when you kill the ADC you spawn a super minion.","replies":[]}]},{"poster":"bulldoggamer","date":"2016-06-02T13:09:53.776+0000","up_votes":11,"down_votes":3,"body":"This should be in memes and games","replies":[{"poster":"LankPants","date":"2016-06-02T13:21:20.242+0000","up_votes":4,"down_votes":4,"body":"How can you say it's not a legit request for Solo queue to be on rotation? ","replies":[{"poster":"Mecha MaIphite","date":"2016-06-02T14:01:42.735+0000","up_votes":7,"down_votes":1,"body":"I made a joke about \"buffing\" Fiora's W to last for two hours so she couldn't move, back when Fiora was strong. It was a request to get her nerfed but it just got deleted for being in the wrong section.","replies":[{"poster":"Velzard of Koz","date":"2016-06-02T14:16:28.216+0000","up_votes":2,"down_votes":1,"body":"The moment when not even mods take you seriously.","replies":[]}]},{"poster":"bulldoggamer","date":"2016-06-02T13:29:42.972+0000","up_votes":3,"down_votes":1,"body":"It doesn't change the games mechanics or goals at all. Thats what the rotating game modes do. And i think people are reacting to this as a meme and not a legitimate request.","replies":[]}]}]},{"poster":"TyroneWatermelon","date":"2016-06-02T16:13:03.780+0000","up_votes":2,"down_votes":8,"body":"***","replies":[{"poster":"Velzard of Koz","date":"2016-06-02T16:56:27.970+0000","up_votes":9,"down_votes":0,"body":"Funny how you call yourself to be \"the intelligent [person] [who] [is] getting downvoted\" yet you're not intelligent enough to understand OP was just jesting, obvious as hell. You want serious discussion? In joke thread? Should the discussion be without muh SoloQ crying? And is there any direct SoloQ crying in the OP's thread? No just joke. Misplaced when talking about section, but still joke. So it's really you with poor skill of understanding.\n\nAlso, I like when intelligent discussion starts with:\n> The braindead apes of Gameplay still upvotes trash threads...\n\nLook into the mirror, please.","replies":[]}]},{"poster":"barbarianskull","date":"2016-06-02T22:04:14.389+0000","up_votes":3,"down_votes":0,"body":"Holy crap this post blew up...","replies":[]},{"poster":"HoneyDewMelon","date":"2016-06-02T15:22:37.108+0000","up_votes":4,"down_votes":1,"body":"SAVAGE rofl.","replies":[]},{"poster":"Friendly Ram","date":"2016-06-02T11:44:14.767+0000","up_votes":6,"down_votes":3,"body":"Nah they need DOOMY DOOMBOTS OF DOOM.","replies":[]},{"poster":"GhastlyGhoulMan","date":"2016-06-03T14:38:02.619+0000","up_votes":2,"down_votes":0,"body":"I almost thought it was going to be talking about Doom Bots or something. Then I got this sneaking suspicion I would see the words \"solo queue\" instead.\n\nGlad to see I wasn't disappointed. :)","replies":[]},{"poster":"Arybus","date":"2016-06-02T21:56:52.980+0000","up_votes":2,"down_votes":0,"body":"savage","replies":[]},{"poster":"MigYalle","date":"2016-06-02T21:19:09.321+0000","up_votes":2,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/gameplay-balance/hOnG1hFk-the-reaction-to-solo-q-not-returning-and-the-community-backlash\nThis is a very serious post I made, please take a moment to check on it if you are serious about Solo Queue and the effect on Riot this decision made","replies":[]},{"poster":"MigYalle","date":"2016-06-02T18:18:20.975+0000","up_votes":2,"down_votes":0,"body":"daNG MAN.  \nhttps://gfycat.com/IncompleteAncientJanenschia","replies":[]},{"poster":"Magneto81","date":"2016-06-02T17:51:38.714+0000","up_votes":2,"down_votes":0,"body":"ROFL - I love you :)","replies":[]}]}