{"poster":"DörpenMcDörp","date":"2018-04-01T17:04:04.664+0000","title":"Warteschlange mit geringer Priorität","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":1,"body":"Hi,\r\n\r\nich habe seit ungef&auml;hr 10 Spielen jedesmal die Wartenachricht &quot;Warteschlange mit geringer Priorit&auml;t&quot;. Ich habe vorher einmal ein Game vorzeitig verlassen (nicht cool, ich wei&szlig;) und ich versteh ja auch, dass Strafe sein muss, aber grade heute versuche ich, seit 1h ins Game zu kommen und kann nicht, weil mich der Leaverbuster hindert. Immer 10min warten (was ich tue) und dann neue 10min warten. Ich habe meine Strafe akzeptiert und w&uuml;rde gerne wieder spielen k&ouml;nnen.","replies":[{"poster":"Angel Ayume","date":"2018-04-01T19:31:25.069+0000","up_votes":2,"down_votes":0,"body":"Wenn du deine Strafe akzeptieren UND verstehen würdest, dann würdest du sie auch ohne Murren absitzen anstatt dich nun drüber zu beschweren.","replies":[]},{"poster":"DörpenMcDörp","date":"2018-04-01T19:12:02.221+0000","up_votes":1,"down_votes":0,"body":"wtf ich wrte 20min, nur um dann aus der liste gekickt zu werden, weil jmd anders cancelt. Und hab.. wieder nen Warteschlange.","replies":[{"poster":"Released Ape","date":"2018-04-01T21:13:25.975+0000","up_votes":1,"down_votes":0,"body":"Solange du selbst nicht abbrichst (oder einer deiner Premades) ist das kein Problem. Würde für möglichst schnelles abspielen 3v3 co-op spielen und  da man eher Bots im Team hat mit ca. 12 min. Spielzeit rechnen.\n\nDie 20 Minuten Sperre spricht dafür, dass du nicht nur einmal das Spiel verlassen/untätig im Spiel warst (dazu zählt auch längere Zeit in der Base im Kreis zu laufen).","replies":[]}]},{"poster":"OvErKiLl156","date":"2018-04-01T20:50:33.016+0000","up_votes":1,"down_votes":10,"body":"Warum regst du dich da drüber auf?? Ich hab n 14 Tage bann bekommen weil ich mich gegen nen extremen Flamer gewehrt habe...Da ist das noch chillig was du hast.","replies":[{"poster":"Süße Möpse","date":"2018-04-02T12:27:48.452+0000","up_votes":4,"down_votes":0,"body":"Ja wie hast du dich denn \"gewehrt\"? Zurückflamen oder muten? Ich vermute du hast geflamed und die Strafe damit auch verdient.","replies":[]},{"poster":"colonel cranc","date":"2018-04-02T03:53:55.706+0000","up_votes":1,"down_votes":0,"body":"naja","replies":[]}]}]}