{"poster":"RellenatsuPanes","date":"2018-11-16T20:32:25.001+0000","title":"Jugadores de hoy en día.","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":0,"body":"Usuarios de lol ultimamente m&aacute;s insultibos y toxicos.\r\nRazon por la cual la comunidad muere lentamente.\r\n&iquest;Por qu&eacute; digo esto? Ya que a lo largo del tiempo que he jugado lol he leido y conocido gente bastante toxica capaz de hacer lo que sea para molestar.\r\nO incluso jugadores bastante innapropiados\r\nComo por ejemplo que una jugadora te pida numero de telefono para solamente darte pack a cambio de una skin.\r\nJugadores toxicos por el echo de que uno juega mal o tuvo una mala partida, tenga el descaro se insultarlo sabiendo que es el principal problema.\r\nLa experiencia que tuve fue muy asquerosa, estupida y amarga.\r\n&iquest;Como simples amigos se convierten en personas tan toxicas convencidos de packs a cambio de skin, hayan cambiado tanto por una simple jugadora?\r\nNo lo se.\r\nEsta comunidad, o la gente de este mundo o de la comu.\r\nTienen varios problemas.\r\nDime que...&iquest;Qu&eacute; opinas?","replies":[{"poster":"Runth","date":"2018-11-16T20:41:49.221+0000","up_votes":2,"down_votes":0,"body":"opino que eres igual q ellos","replies":[]},{"poster":"Slavik","date":"2018-11-16T21:38:16.191+0000","up_votes":1,"down_votes":0,"body":"hay link del pack?","replies":[{"poster":"JudioPobre2","date":"2018-11-16T23:43:13.697+0000","up_votes":1,"down_votes":0,"body":"es raro encontrarse voxeros en este antraso kjjj","replies":[{"poster":"Slavik","date":"2018-11-22T17:36:46.285+0000","up_votes":1,"down_votes":0,"body":"es que aca solo entran nenazos moralfags jijo","replies":[]}]}]},{"poster":"guck fonzi","date":"2018-11-19T16:57:24.990+0000","up_votes":1,"down_votes":0,"body":"Lo que mata la comunidad de LoL no son los toxicos, es la sancion de los mismos sin atacar el problema de fondo.\n\nDesde la era Lyte, League of legends escomo ir al medico con gangrena en una pierna, y que te pongan una crema y un vendaje. Si, te vas a ir sin ver el problema que tenes, probablemente te sientas mejor temporalmente (placebo), pero tu verdadero problema te sigue comiendo por dentro.\nEn el caso del LoL, siempre se \"ataco la toxicidad\", pero no la causa de la misma, al punto de que hoy todo se caratula bajo \"toxicidad\".\n\nOtro ejemplo:\n\nSali 1-7 de mi linea.. pero no jugue mal! Ajam! es que mi equipo me trato mal, no es mi culpa!\n\nLa realidad es que tu equipo te trato mal porque jugaste mal, y no al revez. Una cosa justifica la otra? No, pero ahi es donde esta el problema. \nHay personas que son \"jugadores malos seriales\", \"victimas de los toxicos\". Esta es la gente que el sistema debería sancionar, que nunca se hace, y que terminan frustrando al resto de la playerbase. Y esta frustración es lo que lleva a la toxicidad.\n\nComo en todo caso de estudio hay gente que sea toxica porque es toxica y hay gente que genuinamente no sabe jugar, pero en lineas generales, en cualquier orbe de la vida, si no atacas el problema de fondo no vas a poder dejar de ver las consecuencias.","replies":[]},{"poster":"POETA DEL TRUENO","date":"2018-11-17T14:27:42.561+0000","up_votes":1,"down_votes":0,"body":"Jaja, no es la Comunidad del lol, es algo  \"natural\" en los hombres, no todos se llevan bien, y menos en una comunidad así donde nadie da la cara (físicamente) por que estoy seguro que la mayoría de personas en el día a día tienen comportamientos medianamente \"morales\" pero cuando están detrás del monitor insultan y hacen cosas estúpidas para molestar a los demas, cosa que cara a cara no lo harían ni en sus sueños por que no tienen cojones, Ya sabes...\n\nCon respecto a la chica es así... Los amigos cambian cuando tienen novia y más cuando tienen pareja, dejan de lado muchas cosas para complacer a su amada o deseada... Normal, así es la vida...\n\nY sobre los problemas, todos sin excepción los tenemos, por más chicos que sean... \"normal\" la vida es así...\n\n{{sticker:sg-ezreal}}","replies":[]},{"poster":"Annakiya","date":"2018-11-17T06:03:11.252+0000","up_votes":1,"down_votes":0,"body":"Jajaja me paso algo parecido con un grupo de amigos xD. Un vago se puso de novio con una jugadora y nos mando a todos a la casa. La mina era tóxica en todo y el la re defendía. {{sticker:sg-miss-fortune}} espero que haya tenido buen pack (? Jajaja","replies":[]},{"poster":"el papu escanor","date":"2018-11-16T22:56:48.349+0000","up_votes":1,"down_votes":0,"body":"eso del pack me interesa :v {{sticker:sg-lulu}}","replies":[]},{"poster":"Axoh","date":"2018-11-16T21:47:00.176+0000","up_votes":1,"down_votes":0,"body":"Holaaaa, me apena que digas eso sobre la comunidad, no es la solución mágica pero subir de liga empareja con mentalidades mas serias en la mayoría de los casos, nada te salva de un toxico o un rage quit pero sin duda jugar en oro o platino(hablando de mi experiencia) mejora el sabor de boca que uno tiene de este juego.","replies":[]},{"poster":"Bae Joo Hyun","date":"2018-11-16T21:24:33.159+0000","up_votes":1,"down_votes":0,"body":"les juro que últimamente no me estoy cruzando con ningún toxico y/o troll, tengo demasiada suerte por lo que veo.","replies":[]}]}