{"poster":"Reisfleisch","date":"2017-10-26T21:15:49.954+0000","title":"Ist Ornn der bessere Sion?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"So ich hab vor kurzem ein paar Runden Ornn gespielt und dieser hat sich ziemlich &auml;hnlich wie Sion gespielt. In der Lane sind beide ziemlich nah an der Grenze zu Bullies da Sion seinen permanenten Poke hat und Ornn seine q w Autoattack Combo.  Hier hat Ornn bereits seinen Vorteil mit der Tatsache das er Items kaufen kann. Ornn gewinnt sooft die Lane da die Leute vergessen das der Typ in der Lane shoppen kann und nicht bemerken das er auf einmal mit{{item:3057}}  und {{item:3024}}  ruml&auml;uft. Sion hat hier seine Hp Stacks die aber nur relativ schwach im Early sind\r\nKommen wir nun zum F&auml;higkeitenvergleich. Beide haben 2 Aoe Knockups Maxhp Schaden einen Schild und einen Slow. Und wenn man sie hier vergleicht wird es traurig f&uuml;r Sion. Sions 1er Knockup ist sein Q. Er muss es aufladen und kann sich dabei nicht bewegen. Dann ist da Ornn dessen Knockup gleichzeitig ein Dash is wobei man sagen muss er braucht Terrain das aber fast immer vorhanden ist. Also Ornn hat Knockup plus Engage in einem Spell w&auml;hrend man sich auf Sion Q fast nie verlassen kann da heutzutage jeder rausrenne dashen oder einfach Sion abbrechen kann. Man k&ouml;nnte sagen Sion ist tankier mit seinem Schild und hat auch guten Schaden aber Ornn macht hier alles besser. Sions Schild kann zerst&ouml;rt werden um den Schaden zu verhindern aber Ornn spuckt immer Feuer und ist dabei auch noch Unstoppable und belegt Leute mit Brittle den er dann auch ausl&ouml;sen kann f&uuml;r noch mehr Cc und Schaden. Ihre slows sind zu einem Sions e und Ornn q. Wieder hat Ornn einen Vorteil da Sions slow single Traget ist es sei denn er kann einen Minion anschreien. Der einzige Faktor der diesen Spell gut macht ist die Tatsache das er R&uuml;stung durchdringt. Nun zu den Ultis wo Sion komplett im Dreck liegt. Beide Aoe Knockups jedoch muss Sion wieder seinen erst aufladen und er kann locker ausgewichen und geblockt werden w&auml;hrend Ornns Ziege durch alle durchfliegt sie hochknockt und mit Brittle belegt und die Ziege ist nicht wirklich einfach ohne viel Mobility zu dodgen. Sions Ult hat als einzigen Vorteil das sie mehr Schaden macht. \r\n\r\nAus welchem Grund w&uuml;rde ich Sion statt Ornn picken. Ornn hat eine brutalere Laningphase mann kann sich mehr auf seinen Cc verlassen er debufft Gegner er gibt deinem Team bessere Items. Er kann sehr gut Gegner aus grosser Entfernung bedrohen und sein Schaden ist nicht zu untersch&auml;tzen. Ornn kann alles was Sion kann nur irgendwie besser und gleichzeitig noch viel mehr.\r\nGebt mir einen Grund Sion statt Ornn zu picken denn mir f&auml;llt nichts ein bis auf die Extra Hp im Lategame.\r\n\r\nWirklich wenn euch ein Grund einf&auml;llt wo Sion Ornn &uuml;berlegen ist schreibt ihn hier rein denn gerade hinterfrage ich warum ich Sion lvl 6 gemacht habe.\r\n\r\n{{item:3070}} {{champion:14}} {{item:3070}}","replies":[{"poster":"Werner404","date":"2017-11-06T17:18:06.912+0000","up_votes":1,"down_votes":0,"body":"Dann spielst du Sion nicht richtig. Haben beide ihre Vorteile und Nachteile aber das Ornn nur besser ist kann ich nicht vereinbaren.","replies":[]},{"poster":"chatblocked","date":"2017-10-27T05:41:36.747+0000","up_votes":1,"down_votes":0,"body":"Sion hat 1000 mal besserer Poke. Als Orrn muss man immer so nah ran.\nDie besseren Items für das Team von Orrn sind meiner Meinung nach \"määh..\"\nLohnen sich nur wenn man schon Fullbuild ist. Das Preis/Leistungverhältnis von Orrns Spezialitems ist mässig.","replies":[{"poster":"Qbert","date":"2017-10-27T11:22:49.303+0000","up_votes":1,"down_votes":0,"body":"also die early IE mit 100ad ist schon heftig. auch das verbesserte Locket ist ziemlich stark.","replies":[{"poster":"chatblocked","date":"2017-10-27T12:20:09.697+0000","up_votes":1,"down_votes":0,"body":"{{item:3371}} 1000 Gold ist ein stolzer Preis für +30 AD.\nZum Vergleich die {{item:1037}} kostet 875 Gold und bietet +25 AD mit der Möglichkeit es weiter auszubauen.","replies":[{"poster":"Qbert","date":"2017-10-27T12:28:02.654+0000","up_votes":1,"down_votes":0,"body":"und was machst du dann mit der Pickaxe als ADC? :)","replies":[{"poster":"chatblocked","date":"2017-10-27T20:04:02.713+0000","up_votes":1,"down_votes":0,"body":"Als ADC würde ich was anderes als Pickaxe holen. Aber ich bin ja auch unranked ^^","replies":[]}]}]}]}]},{"poster":"1xVisionx1","date":"2017-10-27T19:07:18.173+0000","up_votes":1,"down_votes":0,"body":"sion<ornn<Moakei{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"The mute Swan","date":"2017-10-27T10:18:45.298+0000","up_votes":1,"down_votes":0,"body":"Meinen ap sion midlane kann man nicht mit Ornn kopieren. \nEs ist immer wieder schön eine wave mit einem e clearen zu können :3","replies":[]},{"poster":"2Face1Evil","date":"2017-10-26T22:06:50.850+0000","up_votes":1,"down_votes":0,"body":"Du kannst als Sion einen Auf herald machen und türme crushen ^^","replies":[{"poster":"Enderized","date":"2017-10-26T22:11:53.831+0000","up_votes":1,"down_votes":0,"body":"Mir Ornn auch ;.....;\n\nMfG\nLevel 7 Ornn","replies":[{"poster":"2Face1Evil","date":"2017-10-26T22:41:21.793+0000","up_votes":1,"down_votes":0,"body":"huh und wie genau ?","replies":[{"poster":"Ηastur","date":"2017-10-27T07:27:52.139+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=2Face1Evil,realm=EUW,application-id=Wj1wcocU,discussion-id=pdVKl5iO,comment-id=000000000000,timestamp=2017-10-26T22:41:21.793+0000)\n>\n> huh und wie genau ?\n\nulti\n\nDie beiden sind zwar Bullies aber spielen sich denke ich doch unterschiedlich. Ich hab allerdings auch nie Ornn gespielt. Denke mal mit Sion kann man aber viel besser Cheesen und das Early abusen. (Invaden, Buff stealen etc) Wie siehts denn mit Ornns AD scalings aus? Sin AD Sion tut schon ordentlich weh.","replies":[]}]}]},{"poster":"Reisfleisch","date":"2017-10-26T22:32:15.265+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=2Face1Evil,realm=EUW,application-id=Wj1wcocU,discussion-id=pdVKl5iO,comment-id=0000,timestamp=2017-10-26T22:06:50.850+0000)\n>\n> Du kannst als Sion einen Auf herald machen und türme crushen ^^\n\nSion SMAAAAASH!!!!!!!!!!","replies":[]}]},{"poster":"Ηastur","date":"2017-10-27T07:26:35.200+0000","up_votes":1,"down_votes":0,"body":"Siornn?","replies":[]}]}