{"poster":"GetMariahCarried","date":"2016-10-27T16:14:15.120+0000","title":"When You Criticize QoL Suggestions for Jungling in Featured Game Modes...","subforum":"Gameplay","up_votes":1,"down_votes":4,"body":"... on the grounds that jungling in featured game modes is bad.\n\nhttps://i.imgflip.com/11gn1b.jpg\n\nWhen you complain about junglers wanting QoL improvements because featured game modes are currently laner-centric.\n\nhttps://i.imgflip.com/11gn1b.jpg\n\nWhen you complain about people wanting QoL improvements to jungle because the QoL issue won&#039;t affect them if they don&#039;t jungle.\n\nhttps://i.imgflip.com/11gn1b.jpg\n\nAll the hate people have towards those dudes that jungle in featured game modes, they IMMEDIATELY direct it towards the people who ask for solutions that DON&#039;T involve shafting an entire sub-demographic of mains. Imagine if you used the SAME logic for other balances fixes. You hate all those people picking a low winrate champ, say, Kog, in ranked, so you when you see this:\n\n> I have a few suggested changes that will make Kog more useful in ranked. Right now, he&#039;s at a 43% winrate, and needs some changes.\n\nYou say:\n\n> Here&#039;s another suggestions: Don&#039;t \\*\\*\\*\\*ing play Kog in ranked.\n\nReplace &quot;Kog in ranked&quot; with &quot;jungle in the Teemoing&quot;, and you basically get the crap I got some days ago. It also doesn&#039;t help that, when you see the OP reply with this:\n\n> You&#039;re missing the point entirely.\n\n.\n> Did you even read the post?\n\n.\n> This thread has nothing to do with currently preferred playstyles. Why are you even bringing this up?\n\n.\n> Please pay attention to what the post is actually about.\n\nYou say:\n\n> You&#039;re rude.\n\nReally? REALLY? {{sticker:zombie-brand-clap}}","replies":[{"poster":"LXII","date":"2016-10-27T16:26:21.777+0000","up_votes":2,"down_votes":1,"body":"Oh man, the doombots jungler is at it again.","replies":[{"poster":"GetMariahCarried","date":"2016-10-27T16:35:37.593+0000","up_votes":1,"down_votes":1,"body":"I don't even jungle in this game mode. Still missing the point. Shocker.","replies":[{"poster":"LXII","date":"2016-10-27T16:39:01.495+0000","up_votes":1,"down_votes":1,"body":"Yep **everyone but you is missing the point**.\n\nWait a minute... That sounds like... Maybe you're just wrong?","replies":[{"poster":"GetMariahCarried","date":"2016-10-27T17:16:29.008+0000","up_votes":1,"down_votes":1,"body":"Sarcasm doesn't equal a counterargument.","replies":[]}]}]}]},{"poster":"CerealBoxOfDoom","date":"2016-10-27T16:18:04.031+0000","up_votes":2,"down_votes":1,"body":"https://d37nk263jfz2p8.cloudfront.net/image/1/450/0/uploads/comments/bdfd18518bafd2f8a1c19a35515c5802.jpg","replies":[]},{"poster":"Zero Skill Tank","date":"2016-10-27T16:21:13.653+0000","up_votes":1,"down_votes":1,"body":"Featured game modes are optimized to maximize Entertainment per Minute.\n\nJungling works directly against that, as one player spends big portion of their time not interacting with other players - thus, only contributing to their own entertainment.\n\nAnd yes, it does affect other players. Somebody is forced to 1v2, which is #notfun, which is why nobody wants this in weekend modes.\n\nAsking for more jungling in Featured Game Modes is extremely selfish.","replies":[{"poster":"GetMariahCarried","date":"2016-10-27T16:33:46.859+0000","up_votes":1,"down_votes":1,"body":"To rephrase:\n\n> Featured game modes are suppose to be as fun as possible\n\nOh really?\n\n> Unless I'm interacting with all 4 allies all the time, I'm not having as much fun as I can.\n\nYou're right, we should just delete jungling from mobas entirely. It's not fun.\n\n> And yes, it does affect other player's fun when the QoL status requires doubled side lanes in order to be fun.\n\nOh really? \n\n> Asking for CHANGES to featured game modes to resolve all the issues I JUST MENTIONED is the same as asking for more players to jungle without those changes, and is therefore selfish.\n\nOnce again, missing the point, entirely.\n\nThere won't BE 2v1 heavy lane pressures with the right QoL improvements. There won't BE lack of interactions without the right QoL improvements. The QoL improvements I specifically gave as examples in my QoL suggestions thread were designed to target these EXACT issues. But please, keep ignoring everything that's being stated while you continue to argue against OTHER statements that weren't even made, and FOR ideas that were, in fact, SUPPORTED by the original post.","replies":[{"poster":"LXII","date":"2016-10-27T16:37:14.385+0000","up_votes":1,"down_votes":1,"body":"You need to stop getting so defensive over your dumb idea. There is **literally no way** that you jungling won't leave somebody in a 2v1. **LITERALLY NO WAY**. Aside from making camps all 1 hp so you can speed clear then join the guy you abandoned in top lane it won't happen. The bots will push that guy under turret and take it before you can complete your first clear.\n\nLet it go already. You didn't get downvoted **2 times now** because we think it's fun to downvote people. You got downvoted because the idea doesn't make any sense no matter what \"QoL improvements\" you throw at it.","replies":[{"poster":"GetMariahCarried","date":"2016-10-27T17:14:30.854+0000","up_votes":1,"down_votes":1,"body":"> There is literally no way that you jungling won't leave somebody in a 2v1. LITERALLY NO WAY\n\nWhat I suggested: Take perma-aggro from doombots in response to certain jungle kills. That's one of a few ideas I threw out there. You're not criticizing that. You're not criticizing ANYTHING I suggested. You're just ignoring it, and whining about the THOUGHT of bringing up ideas. You don't like the suggestions? ADDRESS THEM.\n\n> Let it go already.\n\nIf you don't like hearing it, why are you here? Let it go already.\n\n> You got downvoted because the idea doesn't make any sense.\n\nWhat idea? WHICH idea? YOU HAVEN'T ADDRESSED THEM. And neither has anyone else who's responded after downvoting.","replies":[]}]}]}]}]}