{"poster":"GetMariahCarried","date":"2016-01-02T06:53:54.410+0000","title":"Ezreal's AP Scalings Too High?","subforum":"Gameplay","up_votes":1,"down_votes":7,"body":"Maybe this is just a Howling Abyss thing (been spamming that a lot lately), but I&#039;m pretty sure I&#039;ve seen it on other maps too. It seems every time an AP ezreal so much as sneezes, everything in a 30 foot radius goes nuclear.\n\nHis burst seems to far outweigh that of many other AP champs, and his synergy with AP seems to far outweigh any synergy with AD. I mean look at these postgame stats with a pure AP Ezreal (lower) compared to an Ezreal who spent two thirds of the game full AD (upper) and then switched to AP after realizing the futility of AD against a team with a Rammus (or just the futility of AD Ezreal versus logical Ezreal)\n\nhttp://i.imgur.com/m58a4wU.jpg\n\nThe Ezreal that spent most of the game AD still did almost FIVE TIMES as much magic damage as he did physical damage, and heck, even in physical, did less than the Ezreal who started AP and had more exp and gold from tearing up opponents 10 minutes sooner.\n\nI think Ez found far more synergy with the Rab&#039;s buff and Luden&#039;s intro than other AP champs, and then when thunderlord&#039;s came onto the scene? ... well, Ez just does a better job than most champs at synergizing with almost everything burst related.\n\nAny counter-thoughts to this? Or are other people feelin&#039; the AP Ez hurt as well this season?","replies":[{"poster":"FadedFreezy","date":"2016-01-02T07:02:36.678+0000","up_votes":4,"down_votes":1,"body":"You didn't even mention landing his skill shots which has the variables of how good the Ezreal is and how good the opposing team is. Ezreal is fine, imo. He does damage and has a gap closer but no CC unless he builds for some slows.","replies":[{"poster":"GetMariahCarried","date":"2016-01-02T20:55:12.358+0000","up_votes":1,"down_votes":0,"body":"Skillshots, you mean like almost every mage out there? That doesn't stand out as a unique weakness for him.","replies":[{"poster":"DrCyanide","date":"2016-01-02T21:14:10.203+0000","up_votes":1,"down_votes":0,"body":"Q: blocked by first object in its path. AP Ezreal's Q took a nerf with the mastery changes as well, losing some scaling.\n\nW: on par with other mage spells\n\nE: a dash that requires you to jump *towards* the enemy, and make your target the *closest* thing to you if you want to hurt them. Basically an assassin style move, and if you don't kill them you're in trouble.\n\nR: cross map, good scaling, but losses power as it hits other things.\n\n----\n\nThe weakness of AP Ezreal is stand behind/near your minions /teammates and you dramatically lower his damage. He's weaker now than he was a few months ago.","replies":[]}]}]},{"poster":"Guyy Fieri","date":"2016-01-03T21:00:48.606+0000","up_votes":2,"down_votes":0,"body":"AP Ez is pretty sick for team fights.","replies":[]},{"poster":"Princess Emma","date":"2016-01-02T07:14:38.327+0000","up_votes":2,"down_votes":0,"body":"Ez always had some pretty good AP scalings and burst from it, and Ez has received nothing but buffs the past few patches (save for nerfs to balance things out).\n\nRuneglaive Ezreal some months ago had some pretty unholy damage before the nerf to the item. Ezreal is not really unfun to play against nor too overbearing since he has some obvious weaknesses and other mages / marksmen bring much more to the table than him.","replies":[]},{"poster":"MLDzXnRRR","date":"2016-01-02T08:18:05.710+0000","up_votes":2,"down_votes":1,"body":"AP Ez has mana problems, no waveclear, Q physical dmg gimping his dmg potential, skillshots, weak early game, (weak late game vs tanks), has to use his blink for dmg with the AP build.\nI guess you can see why isn't the AP build more popular.","replies":[]},{"poster":"137434","date":"2016-01-02T21:03:51.373+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=GetMariahCarried,realm=NA,application-id=3ErqAdtq,discussion-id=5s9FaVuE,comment-id=,timestamp=2016-01-02T06:53:54.410+0000)\n\n> The Ezreal that spent most of the game AD still did almost FIVE TIMES as much magic damage as he did physical damage, and heck, even in physical, **did less than the Ezreal who started AP and had more exp and gold from tearing up opponents 10 minutes sooner.**\n\n\nWell yes. Obviously if that Ez was tearing up opponents 10 minutes sooner than he was hitting a lot more aa's and Q than your AD Ez despite being AP, boosting his physical damage output.","replies":[{"poster":"GetMariahCarried","date":"2016-01-03T00:04:52.303+0000","up_votes":1,"down_votes":0,"body":"Yes... he was tearing up 10 minutes sooner, because he was AP. That was the point.\n\nPeople here are way too quick to state what has already been stated.","replies":[{"poster":"137434","date":"2016-01-03T14:37:16.351+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=GetMariahCarried,realm=NA,application-id=3ErqAdtq,discussion-id=5s9FaVuE,comment-id=00040000,timestamp=2016-01-03T00:04:52.303+0000)\n>\n> Yes... he was tearing up 10 minutes sooner, because he was AP. That was the point.\n\nCorrelation does not equal causation. There are many reasons why he could have been tearing it up 10 minutes sooner (better player, better team, more experiences with Ez, just pure early luck that he was able to capitalize on, etc). You don't know that the reason is because he was AP. It is entirely possible that your Ez was AP and theirs was AD and the enemy's Ez still would have been tearing it up 10 minutes sooner than yours. If you haven't noticed people in this game, even on HA, can snowball.\n\nAnd that is not even considering how of course different builds have different power spikes. AP Nasus, for example, is strong early but generally falls off as the game drags on while regular Nasus is typically the opposite. ","replies":[{"poster":"GetMariahCarried","date":"2016-01-03T20:49:10.052+0000","up_votes":1,"down_votes":0,"body":"That was an example case, as was obvious, from how I presented it. I'm referring to every Ezreal game I've seen over the past month, which at this point, is probably a few dozen. If you want to abuse a phrase to pretend a 100% trend of every AP ezreal owning compared to every AD ezreal over dozens of games is pure coincidence, fine. Talking to you is a waste of time then.","replies":[]}]}]}]},{"poster":"The Deckowner","date":"2016-01-02T21:37:31.991+0000","up_votes":1,"down_votes":0,"body":"did u know that ezreal was designed as an ap caster until some player found the   ad scaling on his q is quite nice so they decided to go adc ezreal and that eventually became the majority?\n\nthe reason why ap ezreal seems to deal so much dmg is because any ap ezreal who can land there skillshots will land more q and w than the regular skillshots of other mages due to his q reducing the cd on all abilities once it his an target.\n\nalso another reason why his dmg is so high on the chart is probably cause the enemy team is very bad at dodging skillshots with poor positioning/thr ezreal is very good/both at the same time.","replies":[{"poster":"GetMariahCarried","date":"2016-01-03T00:10:58.641+0000","up_votes":1,"down_votes":0,"body":"I think the original spotlight for him defined him as a hybrid carry from the get-go. I could be wrong though.","replies":[{"poster":"The Deckowner","date":"2016-01-03T00:19:14.697+0000","up_votes":1,"down_votes":0,"body":"i am not even entirely sure, but he wasnt designed as adc that is for sure.","replies":[]}]}]},{"poster":"IllllllIIIIlllll","date":"2016-01-02T07:27:58.228+0000","up_votes":1,"down_votes":0,"body":"a lot of ezreal's damage to champions comes from firing random trueshot barrages (magic damage) at the enemy team, which is vastly less useful than the same damage in a teamfight","replies":[{"poster":"GetMariahCarried","date":"2016-01-03T00:09:08.842+0000","up_votes":1,"down_votes":0,"body":"It's higher, but that's not even half of it. An AP ez with lich and luden's still has over 2000 damage from an e, w, q combo, half of which is aoe. That's often enough to get a triple kill from a bush on a few enemies at 2/3ds health, all for nothing more than a few seconds of cooldown. Sure, using E offensively puts him in danger, but if he's done that much, he's already a) done his job for a fight, and b) doesn't have many enemies left to worry about.","replies":[]}]},{"poster":"Dominick Destine","date":"2016-01-02T21:27:07.322+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GetMariahCarried,realm=NA,application-id=3ErqAdtq,discussion-id=5s9FaVuE,comment-id=,timestamp=2016-01-02T06:53:54.410+0000)\n>\n> Maybe this is just a Howling Abyss thing\n\nARAM is not balanced... it's a joke mode meant for effing around.","replies":[{"poster":"GetMariahCarried","date":"2016-01-03T00:03:46.794+0000","up_votes":1,"down_votes":0,"body":"... Hence why I noted that? Thank you Captain Obvious.","replies":[]}]},{"poster":"The Bearded Bard","date":"2016-01-02T21:18:37.727+0000","up_votes":1,"down_votes":0,"body":"Definitely a nonissue on any map other than howling abyss","replies":[]}]}