{"poster":"GetMariahCarried","date":"2015-11-24T08:20:29.811+0000","title":"Time to Ditch \"Afterthought\" AP Scalings?","subforum":"Gameplay","up_votes":2,"down_votes":2,"body":"Riot put a lot of ap scalings on various champs just to make certain primarily physical-damage items with ap more gold-efficient on those champs - those items being:\n\n* sheen\n* nothing else...\n\nSeveral seasons later, they said, &quot;wait... why are we doing this?&quot; Boom. AP gone on sheen. Who would have EVER thought to do that?!\n\nNow, that leaves certain ap and hybrid mains up a creek about one of their fav items (seems almost like... I don&#039;t know... liche shouldn&#039;t be based off a physical-damage item! But picking apart LoL&#039;s convoluted item/stat &quot;system&quot; full of so many misnomers, it&#039;s not really a system, is a lost cause. I digress.)\n\nGiven that Quinn no longer is gonna buy a single AP item, why is an AP scaling still on Quinn&#039;s Q? Caitlyn&#039;s net? Kha&#039;zix void spike? True there are a few hybrid carries, but these are clearly not some of them, and that goes for a lot of other strictly ad champs with &quot;afterthought&quot; ap scalings. We&#039;d probably have a lot less Xin&#039;s abusing rageblade right now if Riot would undo the massive compensation-system of ap scalings on ad champs JUST TO MAKE SHEEN WORK. (Of course, maybe Xin&#039;s actually meant to be hybrid-ish. We can argue about whether he needs to be patched or not separate from the main argument here.)","replies":[{"poster":"GetMariahCarried","date":"2015-11-24T22:01:18.229+0000","up_votes":1,"down_votes":0,"body":"Patch 5.23:\n\nQuinn: Blinding Assault\nRatio:\nBefore: 0.7/0.75/0.8/0.85/0.9 total AD + 0.35 AP\nNow: 0.8/0.95/1.10/1.25/1.40 total AD + _**0.5 AP**_ OH MY GOSH RITO WHY!","replies":[]},{"poster":"lee350852302","date":"2015-11-24T10:35:04.223+0000","up_votes":1,"down_votes":0,"body":"agreed some things are pretty nuts like khazix having ap scaling\n\nlike seems sometimes these random ap scalings were thrown in for who knows why... maybe just \"because they can\" and make them low enough to not matter","replies":[]},{"poster":"Critmaster Garen","date":"2015-11-24T09:04:05.585+0000","up_votes":1,"down_votes":0,"body":">natural talent\n>\n> +10 attack damage and  +15 ability power at lvl 18","replies":[]},{"poster":"honorablenoob","date":"2015-11-24T08:23:45.757+0000","up_votes":1,"down_votes":7,"body":"Rito did one thing wrong and one thing only. They bumped their head when tripping over a teemo shroom (tripping in both senses  both meaning to fall over and to become high from). After this they continued to pussify the game  modeling their governing sense from Obama's presidency.","replies":[]}]}