{"poster":"GetMariahCarried","date":"2015-10-30T15:54:04.551+0000","title":"\"GOUGE'EM VALOR\" is so much less sadistic now","subforum":"Gameplay","up_votes":14,"down_votes":3,"body":"Why people play quinn:\n\n* See a squish solo pushing half-way across the map.\n* &quot;Meh I guess I&#039;ll go kill that now.&quot;\n* Ult.\n* 5-second interim, play some relaxing jazz music.\n* e, q, r, done.\n* Spam valor comments in all-chat.\n\nHOW AM I SUPPOSE TO COMPLETE THE LAST STEP IF VALOR NO LONGER SWOOPS IN AND GOUGES PEOPLE&#039;S EYES OUT.\n\nYes, I know I can just kill people the old fashioned way, &quot;pew! pew! pew!&quot; but... ugh... it just won&#039;t be the same. *sniffle*\n\nP.S. To those who are confused by this thread, I&#039;m referring to Quinn reworks on the PBE.","replies":[{"poster":"Penns","date":"2015-10-30T16:38:51.467+0000","up_votes":3,"down_votes":0,"body":"Lets just say Valor got old. Now he cant hit his opponents eyes anymore, he just marks them :[","replies":[{"poster":"GetMariahCarried","date":"2015-10-30T17:00:26.231+0000","up_votes":5,"down_votes":0,"body":"How can you mark people you can't even see?! Could you magic marker your sleeping college roommates if you don't even know where they are?! On that note, MY suggested tooltip:\n\n_Valor periodically magic-marks enemy's faces with mustaches and other insulting depictions, leaving them feeling emotionally compromised and vulnerable, open to bonus damage from Quinn's next basic attack._\n\n_Quinn: \"Valor... that's just mean!\"_\n\nEDIT: Somehow I thought you said something about Valor's eyesight getting old... guess not ... ... MY POINT STANDS.","replies":[{"poster":"Penns","date":"2015-10-30T17:05:32.188+0000","up_votes":1,"down_votes":0,"body":"Lamb can mark champs she cant see and Wolf can mark Monsters that he cant see ( ͡° ͜ʖ ͡°)","replies":[{"poster":"kaltenashes","date":"2015-10-30T23:06:30.788+0000","up_votes":1,"down_votes":0,"body":"So Lamb can mark champs she cant see and Wolf can mark Monsters that he cant see ( ͡° ͜ʖ ͡°)\nbut ~~Graves cant have a cigar~~ Valor cant blind","replies":[]}]}]}]},{"poster":"TedBearSurvival","date":"2015-10-30T17:05:39.716+0000","up_votes":3,"down_votes":0,"body":"I wish they could keep Quinn and valor the way they are.","replies":[]},{"poster":"Karn Bishop","date":"2015-10-31T10:49:42.698+0000","up_votes":1,"down_votes":0,"body":"Well the solution to this is rather simple, just delete the lines and replace them with something else and the problems solved.\n\nQuinn mains should also consider that if riot listened to leave my champ alone its not broken posts we would still have stuff like old jax, AD fizz, ap yi, and ap tryndamere to name a few, im sure the mains of these playstyles also felt offended and \"unfairly targeted\" over a \"balanced\" mechanic as well.","replies":[]},{"poster":"ADepressedLeona","date":"2015-10-30T23:33:00.416+0000","up_votes":1,"down_votes":0,"body":"....\n\nAre you the same person who has \n\n\"SHURIMA!\" bound as well?","replies":[]},{"poster":"Manwalrus","date":"2015-10-30T23:29:36.229+0000","up_votes":1,"down_votes":0,"body":"But Graves can't have a cigar...","replies":[]},{"poster":"RottedApples","date":"2015-10-30T22:36:08.170+0000","up_votes":1,"down_votes":0,"body":"for some reason when you said relaxing jazz music i thought of this:\n\nhttps://www.youtube.com/watch?v=gpqmoBYkQfc\n\nnot sure why","replies":[{"poster":"GetMariahCarried","date":"2015-10-30T23:13:45.616+0000","up_votes":1,"down_votes":0,"body":"Well, the somber overtone DOES parallel the emotions rushing through victims' heads as they spot a serial-killer falcon incoming.\n\nI say we place this music in every Quinn montage/replay youtube vid during every ult sequence. Also put it on loop here:\n\nhttp://www.twitch.tv/teemodies\n\nEDIT: Awwwe it's offline. Hope that's not permanent. I haven't visited that channel in ages. Anybody know if it's still maintained?","replies":[]}]},{"poster":"BuzzinTate","date":"2015-10-30T22:45:01.619+0000","up_votes":1,"down_votes":0,"body":"I wish quinn is what Rosalina and Luma are in Smash bros","replies":[]}]}