{"poster":"GetMariahCarried","date":"2015-12-09T04:23:15.388+0000","title":"How to spot \"ninja griefing\" in the tribunal?","subforum":"Player Behavior","up_votes":2,"down_votes":4,"body":"I don&#039;t mind tactics I don&#039;t agree with, but sometimes, you&#039;re in these games with allies, and you can tell by 20 minutes in that they&#039;ve likely been banned before for toxic behavior. Not because they&#039;re chat is toxic. Oh no, they&#039;re not chatting ANYTHING. They&#039;ve just found systematic ways to be extremely subversive the moment you mute the first person who IS toxic in chat. Clever rage-tactics that won&#039;t get them flagged and banned again, but still allow them to be total jerks, deliberately ruining the experience for other players while spiraling the team into defeat.\n\nExample: recently, while I was jungling, our top kalista kept dueling fiora on purpose. Literally, Kalista went in. She didn&#039;t get caught out trying to grab cs in a frozen lane or anything. Half the time, I&#039;d be 10 seconds away. All she had to do was wait and not pretend a ranged adc could duel the master duelist melee assassin fighter. THAT&#039;S not where the &quot;clever rage-tactics&quot; comes in. She wasn&#039;t griefing. Just bad plays. But after she dies about 5 times, she goes &quot;jungle useless&quot;, etc. (again, STILL not what I&#039;m referring to. This is OBVIOUSLY reportable chat behavior. I&#039;m about to get the sticking point.) So I mute, after laying out the truth of the situation in detail... at which point, her, and two other allies start systematically taking all my jungle mobs. Mind you, I&#039;m a devourer jungle, and I need those. They weren&#039;t even trying to regain gold/experience, most of them were ahead in their lanes. Especially mid, which had already taken two towers. They could have roamed bot or top and helped the situation. They could have done ANYTHING. Instead, they&#039;d always go straight for jungle mobs as soon as they were up. I didn&#039;t get sated that whole game. I can only assume they were grouped with Kalista, and didn&#039;t want to say anything directly, once they knew she was getting reported and, most likely, banned. But at the same time, they felt it was time to turn on League-of-Children mode. Not surprisingly, we started incrementally losing from that point onward, as they continued to engage in &quot;anti-teamwork&quot; to no end.\n\nNow, the problem is, how do you interpret that behavior in the tribunal? They&#039;re not feeding. They&#039;re not raging. They&#039;re not afking. They&#039;re not doing anything that&#039;s overtly GRIEFING BEYOND A REASONABLE DOUBT (other than Kalista in chat). Can you really say in the tribunal, that someone getting a little extra farm is griefing? But at the same time, I KNOW they&#039;re griefing. It&#039;s like I&#039;m watching a procedural crime drama. Ya know, where a common plot device is to have a high-class criminal get off in court on technicalities.\n\nI&#039;m just wondering, any thoughts on how to ban these suckers? You don&#039;t want to ban people for non-meta tactics, or not agreeing with teammates on strategy (welcome to every other League game ever.) But people shouldn&#039;t get away with this crap.\n\nPlus, on another note, Riot keeps messing up their report categories. Griefing covers a wide range of behaviors, and yet they can&#039;t stop tagging &quot;intentionally feeding&quot; on it. Camping platform is griefing, and it&#039;s different from disconnecting/afking. Oh they&#039;re not afk. They&#039;re spamming dance too much to be afk. CSing in jungle while you actively ignore every objective, enemy champ, teamfight, and literally make no attempts to win the game for 15 minutes straight, is also griefing. If you&#039;re Yi early game, sure, you&#039;re farming up sometimes that way. But if you&#039;re ahead, and you&#039;re team is losing, and you have several chances to kill enemies with 2 bars of health nearby, or kill towers that aren&#039;t defended for several minutes, heck, the enemy team is pusing your base... you&#039;re most certainly griefing.\n\nNONE of the behaviors described in the last paragraph are feeding. But the last one, in particular, is sinister, because it&#039;s so hard to definitively characterize. Nasus players do something SIMILAR to that a lot, because they love their Q, not because they&#039;re griefing (I still hate Nasus players for that, but if they started getting banned for it, I&#039;d be pissed. Restricting strategies is NOT what the tribunal is for.) So how to you catch this under-the-radar griefing?","replies":[{"poster":"disregardable","date":"2015-12-09T05:38:12.418+0000","up_votes":4,"down_votes":0,"body":"I think that AFK farming in general isn't griefing, but there's a difference between AFK farming and intentionally denying camps. Real talk here. You don't get banned for one game for misbehaving. I HIGHLY doubt that they systematically steal the farm of all of their junglers. If they do, the system will note a weird influx of reports that the it doesn't understand, so a human being at Riot will review the case. That's what the written boxes are for. That said, there's probably a one in a million chance that who you're talking to does that every game and the system will not understand it. Those boxes are still a waste of time.","replies":[{"poster":"GetMariahCarried","date":"2015-12-09T08:28:00.969+0000","up_votes":1,"down_votes":0,"body":"_\"I think that AFK farming in general isn't griefing, but there's a difference between AFK farming and intentionally denying camps.\"_\n\nThat's exactly what I was saying.\n\n_\"That said, there's probably a one in a million chance that who you're talking to does that every game and the system will not understand it. Those boxes are still a waste of time.\"_\n\nAnd that's exactly what I'm concerned about.","replies":[]}]},{"poster":"nimabi69","date":"2015-12-09T05:51:35.714+0000","up_votes":2,"down_votes":2,"body":"riot  doesnt care dude i  dare you to play the games i had in b5 , theres no way to maintain sanity . you can troll a persons  ranked game any way imaginable but DONT YOU DARE TELL A TROLL TO GO FUCK HIMSELF chat banned 20 games","replies":[{"poster":"GetMariahCarried","date":"2015-12-09T08:26:36.396+0000","up_votes":1,"down_votes":1,"body":"That... is not what I'm talking about. If there's a troll (w/e you define that to be), you report them. You don't rage, you just report. That's apparently not what you did. You got what was coming to you.","replies":[]}]}]}