{"poster":"Deebs","date":"2016-11-07T09:30:22.193+0000","title":"Season rewards,aun puedo cierto?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola,me faltan 8 partidas para quedar en una liga y resulta que deshabilitaron los rankeds unos minutos atras y quisiera saber si todavia puedo completarlos hasta hoy 23:59 horas como lo dice en el post.\r\n\r\nTodavia puedo o es tarde?\r\n\r\nEn el post dice que entre el 7 y el 8 de noviembre del 2016.\r\n\r\nGracias.","replies":[{"poster":"martincarp","date":"2016-11-07T13:29:06.804+0000","up_votes":2,"down_votes":0,"body":"Como dijeron, el horario en el que se deshabilitan las clasificatorias es de 6 a 8 AM TODOS LOS DÍAS.\n\n¿Motivo? Simple, falta de gente. Como muy poca gente juega durante la madrugada, los emparejamientos se ven afectados, haciendo que las partidas sean cualquier cosa y realmente no se puedan crear partidas con niveles similares en ambos equipos.","replies":[]},{"poster":"JHIN ES AMOR","date":"2016-11-07T09:40:48.980+0000","up_votes":2,"down_votes":0,"body":"Las rankeds siempre son desactivadas a este horario. A lo que te digo que si, todavia podes jugar las provisionales que te quedan\n\nMuchisima suerte en las partidas :)","replies":[{"poster":"Deebs","date":"2016-11-07T09:44:16.717+0000","up_votes":1,"down_votes":0,"body":"Wow,me dio mucho susto,revise una y otra vez la publicacion de riot y era muy confusa hasta que lo logre entender pero no entendia el porque nos interrumpen a esta hora...  tengo que dormir un par de horas para recuperarme,porque mi cerebro ya no tiene neuronas por el momento y volver a terminar mis provisionales con mucha energia.","replies":[{"poster":"JHIN ES AMOR","date":"2016-11-07T09:47:31.801+0000","up_votes":2,"down_votes":0,"body":"Si somos dos, tuve que leer unas veces la publicacion. Asi que nada a descansar y a ganar :)","replies":[{"poster":"Deebs","date":"2016-11-07T10:06:26.913+0000","up_votes":1,"down_votes":0,"body":"Siempre todo es confuso cuando ponen los horarios.Si fuera yo no lo escribiria asi.Deberian ponerlos mas entendible y sin errores que nos ponen a todos confusos como locos xD.\n\nLos numeros en grande para que se noten bien.Me pase como 1 hora tratando de entender lo que decia y despues vienen con que hubo un error y tuve que recurrir al foro...","replies":[]}]}]}]},{"poster":"AC Wolf","date":"2016-11-07T09:38:31.975+0000","up_votes":2,"down_votes":0,"body":"clarroo aun puedess! supongo que dentro de unas horas la habiltaran ^^, si es que no estoy mal informado D:  por ciertoo buena suertee en esas ranked!","replies":[{"poster":"Deebs","date":"2016-11-07T09:41:07.267+0000","up_votes":1,"down_votes":0,"body":"Ah,muchas gracias por responder amigo.Por cierto,para que lo deshabilitan si lo pueden hacer al final? porque es necesario hacer eso? estas seguro de que aun puedo? Solamente quiero el borde dorado o plateado si es que puedo y el skin de maokai,lo demas no me interesa jaja xD.El ward tambien esta bueno.","replies":[{"poster":"AC Wolf","date":"2016-11-07T09:56:16.336+0000","up_votes":1,"down_votes":0,"body":"siempre son debilitadas ... no se bien el porque creo que para ser monitoria das o evitar problemas como el \"me robaron la cuenta y jugaron ranked en mi ausencia bajandome todo los puntos de liga\" o quizas sea por si ocurre algun bug con campeones o lag en el sv sean debilitadas","replies":[{"poster":"Deebs","date":"2016-11-07T10:07:35.483+0000","up_votes":1,"down_votes":0,"body":"se deshabilitan todos los dias a las 6:30AM o todos los lunes? alguien sabe con exactitud y con que razon lo hacen? gracias.","replies":[]}]}]}]},{"poster":"Aluneth","date":"2016-11-07T10:47:11.906+0000","up_votes":1,"down_votes":0,"body":"Siempre las deshabilitan de 6:00 a 8:00 am","replies":[{"poster":"Deebs","date":"2016-11-07T10:59:53.450+0000","up_votes":1,"down_votes":0,"body":"todos los dias?","replies":[{"poster":"ErsepHone","date":"2016-11-07T11:13:56.812+0000","up_votes":1,"down_votes":0,"body":"Si, Deebs. Las ranked son deshabilitadas todos los días a las 6:00 am y son habilitadas un rato después, normalmente a las 8:00 am. Saludos","replies":[{"poster":"Deebs","date":"2016-11-07T21:08:53.819+0000","up_votes":1,"down_votes":0,"body":"Solamente pasa esto en LAS y LAN?","replies":[{"poster":"ErsepHone","date":"2016-11-11T18:49:57.491+0000","up_votes":1,"down_votes":0,"body":"No se decirte, pero me imagino que los horarios de LAN son distintos, como los de los otros servidores. Cada uno debe tener su hora de desactivación de rankeds","replies":[]}]}]}]}]},{"poster":"LeonardoSB","date":"2016-11-07T11:01:18.618+0000","up_votes":1,"down_votes":0,"body":"sisi podes ^^","replies":[]}]}