{"poster":"Vinzzz 001","date":"2019-07-10T16:51:53.886+0000","title":"'Play 5/10 games of TFT to Round 20' missions suck.","subforum":"Teamfight Tactics","up_votes":5,"down_votes":1,"body":"In the Teamfight Tactics missions, there is are two missions that require you to reach round 20 for an X amount of times. This sucks. The reason? Because to complete the mission is unoriginal, punishes bad luck early game and does not reward people for getting further, or even winning the game. Currently, it would be the most efficient strategy to reach round 20, and then lose after which one can start a new match earlier.\n\nThe other missions that require certain classes/origins are more fun as they make people experiment with those classes/origins and build around them. The other missions are mostly luck-based, but unique and not too hard to complete with a solid plan. (Save money and reroll for 3 same champs in a round. etc.)\n\nNow my suggestion would be to change to: **'Complete 200 rounds in TFT.'** This would still require players to play 200 rounds, but wouldn't make longer games be as punishing anymore and would make the players that are having a bad day still see some progress being made. \n\nIf this is too easy, the rounds could be increased to 250 or changed to something such as: 'Win 100 rounds in TFT.'","replies":[{"poster":"Pluggy","date":"2019-07-10T18:50:22.225+0000","up_votes":2,"down_votes":0,"body":"If you play the game just for the mission, ur suggestion to surrender after round 20 is right.\n\nI know a lot of people, myself included, that play the game for fun and to enjoy it and to compete against eachother.\nBy that perspective it still seems quite interesting to play to the end.\n\nIt's up to your own goals but ur reasoning does hopefully not represent the majorities mindset.","replies":[{"poster":"Vinzzz 001","date":"2019-07-10T19:36:26.003+0000","up_votes":2,"down_votes":0,"body":"I don't say it isn't fun, or that I don't play for the enjoyment I get from it; Rather, I want to point out that these specific missions feel bad. \n\nWhen I get the mission 'play 20 nobles' and use a bunch of them in a game because of that, I see meaningful progress being made after the game. When I focussed on it completely I get 4-5 progress for that quest, and when I don't focus I don't get that. My effort is being rewarded here. \n\nWhen I got the mission where I had to be LVL 6 by the second shared draft -which asked planning and luck- but felt made me have a 'YES! moment' when it finally worked out. \n\nThe play X game missions only give 1 progress. Every time. No matter how many rounds after 20 I complete, I only get 1 progress. It doesn't feel worth it. (and this mission is always 1 of the 3, keeping me away from 'fun' missions)\n\nI am suggesting an alternative which -on average- should be about just as hard to get, but shows your progress in a way that you can influence: A good game giving more progress than a bad one; my effort being rewarded. ","replies":[]}]},{"poster":"Rock Lee4","date":"2019-07-28T07:04:38.836+0000","up_votes":1,"down_votes":0,"body":"I love the Complete 200 rounds in TFT idea. It's way better than this. When you are in a hurry to complete the mission, you need to surrender to get to a new game faster and repeat until you get to round 20 again. I know that this makes the player waste time on the game(by playing allot of more games) just for the mission but that should never be the case if you encourage them to get to higher rounds by surviving through it would be way better and immersive.","replies":[]},{"poster":"Gergor","date":"2019-07-20T06:29:13.692+0000","up_votes":1,"down_votes":0,"body":"What bothers me about the mission is that nothing IN the game tells you when round 20 is. The stages don't even have consistent numbers of rounds, so it's unclear whether you've reached it if you do wanna think about. Make it say \"to round 4-2\" or 3-6 or w/e the heck it is.","replies":[]},{"poster":"Porglit","date":"2019-07-11T00:25:12.089+0000","up_votes":1,"down_votes":0,"body":"It's a safeguard against going AFK or bombing on purpose to go through games very quickly.  Round 20 isn't very far into the game, so unless you getting 8th or 7th or something, it should count toward the mission.","replies":[{"poster":"UnstoppableMaybe","date":"2019-07-12T03:25:44.620+0000","up_votes":1,"down_votes":0,"body":"Agreed, it's not a bad mission at all in my opinion. Also the level 6 mission by round 11 is working now as well, so it's not so bad either. I haven't ran into a seriously bad mission yet, but I can admit the 1's where everyone is looking for the same champions do suck to a reasonable extent, and can be fixed by making the champion requirement different for each handful of players, so not everyone is doing the same mission going for the same champs at once.","replies":[]}]}]}