{"poster":"Gangplänk","date":"2016-09-29T03:00:02.621+0000","title":"Homofobia en el lol? .-.","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":6,"body":"Bueno resulta que jugando encontr&eacute; a un jugador que desde un comienzo demostr&oacute; ser alguien toxico, insultando cada vez que lo mataban e insultando tanto a su equipo como al nuestro. Algo que se ve todos los dias, el problema surge cuando este jugador empieza a decirme homosexual(Con insultos claramente) y en un principio no me hago problema, pero le dije que algo como la eleccion sexual de alguien no es algo malo, y continuo insultandome por eso toda la partida, lo mas extra&ntilde;o fue ver que habia gente que lo apoyaba, estoy dispuesto a publicar el nombre del jugador si Riot me lo permite pero por ahora solo quiero saber que piensan, Saludos :D","replies":[{"poster":"Little T","date":"2016-09-29T03:13:29.785+0000","up_votes":3,"down_votes":0,"body":"https://www.youtube.com/watch?v=LoHGTzqJTM0","replies":[]},{"poster":"Shappaw","date":"2016-09-29T09:04:02.988+0000","up_votes":2,"down_votes":0,"body":"Bienvenido a Internet y al mundo de los videojuegos online. ¿Es su primera vez por aquí?.","replies":[]},{"poster":"Esguein","date":"2016-09-29T06:31:08.194+0000","up_votes":2,"down_votes":0,"body":"Loco, en serio. Hay una función que se llama \"Mutear\" no es tan difícil hacerlo...","replies":[]},{"poster":"AuroraExecution","date":"2016-09-29T03:49:33.145+0000","up_votes":2,"down_votes":0,"body":"JAJAJAJAJAJA\n\nEn lol? En el mundo hay homofobia.","replies":[]},{"poster":"Sergan","date":"2016-09-29T22:51:23.838+0000","up_votes":1,"down_votes":0,"body":"Si ven que alguien esta insultando, por que lo continuan leyendo si lo pueden simplemente mutear y pasar de el?\n\nEso si, no olviden reportar para que el sistema haga su trabajo.","replies":[]},{"poster":"martincarp","date":"2016-09-29T05:45:47.891+0000","up_votes":1,"down_votes":0,"body":"Sinceramente me parece que le están dando demasiada importancia a alguien que lo único que quería era descargarse y un poco de atención, algo que claramente logró.\nPersonas con poca educación hay en todo el mundo, y no creo que un juego de 25 o 30 minutos de duración sea el lugar indicado para intentar enseñarle algo que va en contra de lo que le hicieron creer a lo largo de sus 13, 15, 18, 20 o la cantidad de años que haya vivido. Simplemente se los mutea en la partida, report al final, y a seguir viviendo felices como si nada hubiera pasado.","replies":[]},{"poster":"TheBloz","date":"2016-09-29T03:04:58.521+0000","up_votes":1,"down_votes":0,"body":"Report esa gente no merece vivir ( digamos de una forma q no juege lol)  cada uno elije lo q quiere ser :)","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-09-29T03:03:44.708+0000","up_votes":1,"down_votes":0,"body":"Si lo publicas te banean.\n\nReporte al final de la partida y chao, si es grave, capturas al soporte.","replies":[]},{"poster":"SATIV","date":"2016-09-29T03:03:41.163+0000","up_votes":1,"down_votes":0,"body":"Hay de todo xd","replies":[]},{"poster":"ghost134","date":"2016-09-29T05:41:14.525+0000","up_votes":1,"down_votes":3,"body":"elección sexual... mmm..no se si se lo pude llamar así, uno no elige ser homosexual o heterosexual .","replies":[]}]}