{"poster":"ATR S04","date":"2015-05-30T14:14:40.652+0000","title":"ARAM","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":0,"body":"Hi Beschw&ouml;rer/innen,\n\nich wei&szlig; nicht wie es euch geht aber ARAM geht echt garnicht mehr. Es gibt da zwei Punkte von mir:\n\nZufallsauswahl --> Das ich nicht lache. Ich hab ca. 105 Champions und bekomme andauernd die selben ( Skarner, Pantheon und Gangplank)\n\nNat&uuml;rlich sind noch 3-4 andere dabei die auch andauernd kommen. Aber das war es. Also das ist definitiv keine Zufallsauswahl.\n\nDer zweite Punkt:\n\nSollte ich mal Gl&uuml;ck haben und einen AP Fernk&auml;mpfer bekommen (was ca. 1 mal im Monat vorkommt) dann hat irgendeiner in meinem oder im Gegnerteam die Auswahl verlassen! \n\nDa sollte mal was dagegen gemacht werden. Diese st&auml;ndigen Leaver im ARAM gehen mir so auf den Sack. Ich w&auml;re f&uuml;r -10.000 EP und 30 Minuten Spielsperre f&uuml;r jeden Modus.\n\nWenn ich nen bl&ouml;den Champ hab (was ja meistens der Fall ist) dann spiel ich trozdem und versuch alles zu geben f&uuml;r den Sieg.","replies":[{"poster":"Tungsteel","date":"2015-05-30T15:28:02.878+0000","up_votes":2,"down_votes":0,"body":"Es kommt einem oft auch nur so vor. Ich denke auch, dass bei mir immer Ryze im Aram kommt. Wenn ich mir dann meinen eigenen Spielverlauf anschaue, dann seh ich, dass genügend andere ebenso oft kommen. Das ist eben die selektive Wahrnehmung, die hier wieder einmal zuschlägt.","replies":[]},{"poster":"erzi222","date":"2015-05-31T11:19:43.290+0000","up_votes":1,"down_votes":0,"body":"in aram ist jeder champ viable, manche mehr und mal weniger, und es kommt auch auf das eigene als auch das gegner team an.\n\naram basiert eben auf zufalle und naja manchmal hat man echt pech und bekommt nur die selben champs.\ndas hört dann aber auch irgendwann wieder mal auf und dann bekommst du nur die ap champs xD !\n\nder schneeball finde ich persönlich ....... naja nicht toll. die meisten gehen damit sowieso schlecht um und naja ....\n\nbzw ich wäre ja dafür, dass man sich mit vielen einflusspunkten, noch einen dritten würfelversuch kaufen kann. müsste dann aber schon teuer sein, und naja man kann mal das geld loswerden also die ip die sich ja bei den meisten ansammeln ohne ende.","replies":[]},{"poster":"Kaitri","date":"2015-05-30T15:07:46.244+0000","up_votes":1,"down_votes":0,"body":"letztens hatten wir einen im team der hatte braum... hat ihn rerolled für elise... hat elise rerolled und bekam... braum :D\ner meinte er besitzt jeden einzelnen champ.\n\ngab auch ne zeit da hatte ich iwie 4 malz spiele in folge obwohl ich zu der zeit auch jeden champ hatte (außer velkoz der war da neu)\n\naber irgendwer hat mir damals erklärt das menschen in allem ein muster suchen und erkennen wollen auch wenn keines da ist","replies":[]},{"poster":"Daryl Dixon","date":"2015-05-30T14:21:43.694+0000","up_votes":1,"down_votes":0,"body":"> Zufallsauswahl --> Das ich nicht lache. Ich hab ca. 105 Champions und bekomme andauernd die selben ( Skarner, Pantheon und Gangplank)\n\nso funktioniert aber der zufall.\n\n\n> Da sollte mal was dagegen gemacht werden. Diese ständigen Leaver im ARAM gehen mir so auf den Sack. Ich wäre für -10.000 EP und 30 Minuten Spielsperre für jeden Modus.\n> \n\nxD","replies":[]},{"poster":"HyperionCH","date":"2015-05-30T14:26:36.425+0000","up_votes":1,"down_votes":1,"body":"Also ich finde, gerade mit den Schneeball, den es nun gibt, sind Champs wie Gangplank und insbesondere Skarner sehr wohl viable. \nGerade Skarner kann einen gegnerischen Carry mit seiner Ulti aus dem Spiel nehmen.","replies":[]}]}