{"poster":"Jesus Is My King","date":"2016-11-12T02:57:05.087+0000","title":"I actually want to know if anyone is debating on quitting league soon","subforum":"Gameplay","up_votes":15,"down_votes":14,"body":"due to the reworks on assassins. (if you dont play assassin then i guess it would make sense that you wont quit) but for those that do, what are your thoughts?\n\nit&#039;s like riot wants us to quit the game, but without actually saying it, &quot;here&#039;s this giant mess, we hope you get the message&quot; I dont know, just kinda strange to me.\n\nLegit just wondering, not implying any sorta hate here. just wanted to see what people thought.","replies":[{"poster":"TyrekGoldenspear","date":"2016-11-12T03:26:28.013+0000","up_votes":3,"down_votes":0,"body":"But... I like new {{champion:91}} .\n\nParkour!","replies":[{"poster":"Unstoppable Monk","date":"2016-11-12T04:10:33.207+0000","up_votes":5,"down_votes":0,"body":"Peter Parkour.\n\nTalon-man, Talon man, does whatever a Noxian can...","replies":[]}]},{"poster":"Mordepool","date":"2016-11-12T05:10:42.709+0000","up_votes":4,"down_votes":0,"body":"I've been trying to get back in after 9 month Break. the Mordekaiser Rework  caused me  some trauma. I don't know if I'll ever come back.  Waiting for a reason to. So far little has changed.  I know where you guys are at though.  \n Feels bad man","replies":[]},{"poster":"FancyKiwi","date":"2016-11-12T03:25:12.919+0000","up_votes":3,"down_votes":0,"body":"If they remove normal draft pick I probably will cause blind pick is the worst thing ever and I don't play ranked.","replies":[]},{"poster":"zrWQMdGHtY","date":"2016-11-12T03:01:59.227+0000","up_votes":2,"down_votes":11,"body":"I would, if I wasn't blindly loyal to Katarina... If they actually force a romance with Garen or change her actress/appearance, I'm most definitely leaving. I was on the edge with the Project skin... I was even closer to that edge with the kit... One more BS like that, no matter how undying my loyalty is to her, I'll be done and done... as the girl I'm loyal to wont exist in LoL anymore... So I wont even be breaking my own dignity and loyalty to anyone at that point... But a majority of my friends already uninstalled the game and bough overwatch instead thanks to this patch... So... \n\nso...\nsoo...\n\nKilling is my duty, fun is yelling surprise!","replies":[{"poster":"cope moment","date":"2016-11-12T03:48:49.217+0000","up_votes":3,"down_votes":1,"body":"no offense to you, but I'd like to ask other commenters here as this is something I've been seeing often: do you actually care when somebody says their friends have quit league? because I sure don't.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-12T03:50:27.999+0000","up_votes":1,"down_votes":8,"body":"wasn't the question if  consider to leave? Yeah I do consider to leave, imagine I answered the question and added a bonus to it, because my friends don't use boards and I just added their opinion on it as a bonus. Do you really need to downvote and be rude about it?","replies":[{"poster":"cope moment","date":"2016-11-12T04:02:28.070+0000","up_votes":2,"down_votes":1,"body":"well I apologize if I came off as rude, but I did say no offense and I was simply asking for the views of other commenters.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-12T04:16:10.198+0000","up_votes":1,"down_votes":5,"body":"Oh great! IF Riot was God, I'm treated like the Lucifer, both by them and the community... Oh adorable. Okay then, guess I ain't part of the community, my opinion doesn't count for anything... I'll just sit in my hellhole and pretend I'm okay then...","replies":[{"poster":"cope moment","date":"2016-11-12T04:24:56.639+0000","up_votes":2,"down_votes":0,"body":"\"All of these elements, but you choose to be salty.\"\n-elementalist lux","replies":[{"poster":"Limmie","date":"2016-11-12T13:15:55.469+0000","up_votes":2,"down_votes":0,"body":"Is that an actual quote from her? If it is then that skin just got even more awesome.","replies":[{"poster":"TyrekGoldenspear","date":"2016-11-12T19:00:00.327+0000","up_votes":1,"down_votes":0,"body":"This so much.\n\nI need that skin even more now.","replies":[]},{"poster":"cope moment","date":"2016-11-12T13:18:23.512+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure it is.","replies":[]}]},{"poster":"zrWQMdGHtY","date":"2016-11-12T04:38:17.138+0000","up_votes":1,"down_votes":4,"body":"Clearly if I'm treated that way.","replies":[{"poster":"cope moment","date":"2016-11-12T04:54:34.797+0000","up_votes":2,"down_votes":0,"body":"It doesn't matter; I apologized, you didn't accept it, nothing to fight over.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-12T04:58:43.393+0000","up_votes":1,"down_votes":2,"body":"Actually it does matter... You cant prove that I'm the devil to treat me like I'm it... Under all my arrogance and confidence there's still some feelings that could get hurt... some times... maybe...","replies":[{"poster":"ShaolinToilet","date":"2016-11-12T06:54:02.447+0000","up_votes":1,"down_votes":0,"body":"Why do u get so many downvotes ur funny","replies":[{"poster":"Dynamiku Entry","date":"2016-11-12T10:02:50.938+0000","up_votes":2,"down_votes":0,"body":"Because they are a self absorbed troll that is incapable of debating with another person.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-12T12:10:38.308+0000","up_votes":2,"down_votes":2,"body":"Never trolled except when I pretend im cute, because  I clearly arent. I dont try hard to debate anymore because people like you just go 1 setance opinion post.","replies":[]}]},{"poster":"zrWQMdGHtY","date":"2016-11-12T12:10:01.124+0000","up_votes":1,"down_votes":2,"body":"Because you can see yourself which part of the community is at the boards...","replies":[{"poster":"ShaolinToilet","date":"2016-11-12T17:19:56.749+0000","up_votes":2,"down_votes":0,"body":"U silly goofball","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-12T18:39:27.414+0000","up_votes":1,"down_votes":2,"body":"huh?","replies":[{"poster":"ShaolinToilet","date":"2016-11-12T18:46:33.504+0000","up_votes":2,"down_votes":0,"body":"Ur a goober","replies":[]},{"poster":"zrWQMdGHtY","date":"2016-11-12T18:54:50.391+0000","up_votes":1,"down_votes":1,"body":"Look... I'm justa stupid Kat... you need to explain more deeply for me to understand.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Big Lincoln","date":"2016-11-12T03:52:16.823+0000","up_votes":2,"down_votes":1,"body":"i think you're overreacting my dude\n\nthey're going to buff the assassins that people think are weak. now, if their playstyle has changed to the point where you don't enjoy them anymore, that's nobody's fault, and you're totally justified to quit if nobody else tickles your fancy. \n\nbut, even if these reworks have been a mess so far, riot's at least had a ~~good~~ an _okay_ track record so far of keeping an eye on them post-launch.","replies":[]},{"poster":"EmittingXs","date":"2016-11-12T03:44:56.088+0000","up_votes":2,"down_votes":1,"body":"is there anything that Riot does these days that DOESN'T trigger people like this guy? every new patch brings people onto the boards who claim they're going to quit league but none of you people leave. you complain then come right back to the game. just vent and hurry back into the game please, i don't want to be in queue much longer.","replies":[]},{"poster":"Sona x Rubick","date":"2016-11-12T10:19:57.128+0000","up_votes":1,"down_votes":0,"body":"Didn't play since 2 months, used to play jhin and sona non-stop in normal games but as a master tier player it isn't encouraging to play pre-season nor season 7 (yet)\nhttp://www.lolking.net/summoner/euw/21335235\n\nI play every role since years, and yet what can i get from season7?\n\n-assassins aren't that much assassins anymore, rengar remaining the only one with maybe kha'zix.\n-ADC are still picked in every games giving no chance to players to do a team centered around an other class like juggernaut. Juggernauts are like adc with the only difference that they trade range for tankiness(even if most of adc have more utility) they need a team that protect them and CC the enemy team to prevent kitting.\n-support role is getting more and more braindead with redemption and knight's vow\n-ranged toplane remain bullying melees\n-mages are still making midlane unplayable\n\nonly way i would play league, is Ice-frog fucking up with 6.90","replies":[]},{"poster":"Seenan","date":"2016-11-12T09:42:39.217+0000","up_votes":1,"down_votes":0,"body":"Honestly, I just want the Diamond border. It looks so cool. I was Silver S5, Plat S6, preferably Diamond S7 if I have the time and patience. I couldn't care less if I hit Master/Challenger.\n\nEDIT: And I don't wanna boost for it, cause I hate boosters.","replies":[]},{"poster":"A Basic Island","date":"2016-11-12T04:17:56.213+0000","up_votes":1,"down_votes":0,"body":"im just glad i happen to enjoy and be somewhat not terrible at lee sin\n\nrito is making it hard to play with two of their reworks destroying champs i like to play (shaco/morde)","replies":[{"poster":"Specter027","date":"2016-11-12T07:14:54.714+0000","up_votes":1,"down_votes":0,"body":"I just promised myself I was going to only Lee Sin when I jungle. Tried playing a few immobile champs and I can't catch any of the reworked assassins.","replies":[]}]},{"poster":"Specter027","date":"2016-11-12T07:13:08.219+0000","up_votes":1,"down_votes":0,"body":"Played one game with my friend. We usually League together.\n\nHalfway through the game (we were vs Khaz/Talon/Kat, I was Voli and all I did was chase shit I couldn't catch) he said \"i'm uninstalling after this\" and we played CS:GO and L4D2.\n\nI hate pre-season with a passion. The first one I experienced wasn't that bad, but this one and the past two have rendered the game unplayable and unenjoyable to me until the pro-season starts and Riot actually seems to make an effort to put out an playable product.\n\n> due to the reworks on assassins. (if you dont play assassin then i guess it would make sense that you wont quit\n\nI like playing tanks. The only ADCs and a few of the mids I like to play are relatively immobile ({{champion:21}} {{champion:115}} {{champion:29}}. The hyper mobility of Kata and Talon, the power of Khaz coupled with the mobility creep in this game anyways (Looking at you {{champion:114}} {{champion:245}} {{champion:236}} {{champion:157}} ) has made my favorite champs unplayable. I can't do anything on a tank, I just get shredded by assassins. When I play immobile squishy I just get jumped on by mobile squishy and 100 - 0'd. I also trend towards being a Jungle main when I'm not filling support, and since the preseason started I don't gank mid and top, instead they come looking to cheese me in my jungle. Fun times when Talon is backflipping through the woods.\n\nSometime during one of my breaks on Riot's yearly beta mode I'm going to not bother returning.","replies":[]},{"poster":"Lord Coffee","date":"2016-11-12T06:10:34.035+0000","up_votes":1,"down_votes":0,"body":"I usually just take breaks.","replies":[]},{"poster":"Daxanater","date":"2016-11-12T04:47:54.491+0000","up_votes":1,"down_votes":0,"body":"{{champion:13}} \n\nbeard and blue\n\nblue on the outside and the inside\nlike me\n\n{{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"Unstoppable Monk","date":"2016-11-12T04:09:19.557+0000","up_votes":1,"down_votes":0,"body":"I'm sure all the assassin players that finally have relevance in the meta are flocking to some other game because their reworked champions can now carry games.","replies":[]},{"poster":"Nameless Voice","date":"2016-11-12T04:08:34.641+0000","up_votes":1,"down_votes":0,"body":"The champions who aren't fun to play against are far more likely to make me quit than the ones that aren't fun to play.\n\nThat being said, I'm undecided on the assassin reworks so far.\nI think it's too early to say.","replies":[]},{"poster":"oSEXYPLATYPUSo","date":"2016-11-12T03:47:10.832+0000","up_votes":1,"down_votes":0,"body":"i play for fun when im bored... dont care alot about meta, patches, rank etc sooo ill casually play when i have nothing else to do and when i have something to do i wont . its as simple as that for me","replies":[]},{"poster":"BeeCuz","date":"2016-11-12T02:59:26.587+0000","up_votes":1,"down_votes":0,"body":"I only play bot matches. No 4v5 bs","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-12T03:02:34.823+0000","up_votes":1,"down_votes":2,"body":"So I heard you enjoy playing with 9 bots in the player vs AI modes. xD","replies":[{"poster":"BeeCuz","date":"2016-11-12T03:20:04.270+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kitty Katarina,realm=EUW,application-id=3ErqAdtq,discussion-id=qIyRpA6n,comment-id=00010000,timestamp=2016-11-12T03:02:34.823+0000)\n>\n> So I heard you enjoy playing with 9 bots in the player vs AI modes. xD\n\nSo I heard they're releasing a testing sandbox just like that, so we can practice various skills.","replies":[{"poster":"zrWQMdGHtY","date":"2016-11-12T03:44:36.386+0000","up_votes":1,"down_votes":4,"body":"Optimist.","replies":[]}]}]}]},{"poster":"ShinkoMinori","date":"2016-11-12T02:57:42.124+0000","up_votes":1,"down_votes":0,"body":"I only play aram.","replies":[{"poster":"Jesus Is My King","date":"2016-11-12T02:59:12.016+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ShinkoMinori,realm=NA,application-id=3ErqAdtq,discussion-id=qIyRpA6n,comment-id=0000,timestamp=2016-11-12T02:57:42.124+0000)\n>\n> I only play aram.\n\ni guess thats a wise decision.","replies":[]}]},{"poster":"HongChongDong","date":"2016-11-12T03:21:44.464+0000","up_votes":1,"down_votes":1,"body":"I haven't played fizz in ages as it is as he's been lacking for awhile with the changes in meta. However, if they put in some number changes and remove the 2 second delay on his W then I'd be fine. Like they could do anything else like taking damage away from his E but that 2s delay is just too much.","replies":[]},{"poster":"420 grams","date":"2016-11-12T03:07:22.207+0000","up_votes":2,"down_votes":2,"body":"Nope. It's still a pretty fun game and I like that they change things to make it feel different. Keeps the game fun and interesting.","replies":[]}]}