{"poster":"Kriplee","date":"2018-02-22T11:22:12.005+0000","title":"A Nyomolvasó kése","up_votes":1,"down_votes":0,"body":"Sziasztok ism&eacute;t!\r\n\r\nIgaz&aacute;b&oacute;l csak egy k&eacute;rd&eacute;sem lenne &eacute;s ez pedig,hogy: MI&Eacute;RT?\r\nTeh&aacute;t a Riot,a magasabb szinten l&eacute;vő j&aacute;t&eacute;kosok,a profik is azt tan&aacute;csolj&aacute;k hogy v&aacute;s&aacute;rolj wardot mert nagyobb sz&aacute;zal&eacute;kban d&ouml;nthetsz el vele m&eacute;rkőz&eacute;st ak&aacute;r,meg alapvetően nagyon sokat sz&aacute;mit hogy l&aacute;ss a p&aacute;ly&aacute;n hisz ezzel segithetsz a csapatnak főleg(!) ha &eacute;ppen a jungel-ban j&aacute;tszol.\r\n&Eacute;s erre olvasgatom reggel az &uacute;j frissit&eacute;st &eacute;s megakad a szemem ezen az &quot;apr&oacute;cska&quot; dolgon,hogy kivesszik a j&aacute;t&eacute;kb&oacute;l a wardot ad&oacute; jungel itemet.\r\nNa most ez igy ez...MI?\r\n\r\nBocs&aacute;nat egy kicsit sz&eacute;tsz&oacute;rt ir&aacute;s lett de &eacute;nse vagyok a top form&aacute;mban jelenleg :D\r\nKiv&aacute;ncsian v&aacute;rom a v&eacute;lem&eacute;nyeket ;)","replies":[{"poster":"kalamona90","date":"2018-02-22T13:33:56.589+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lényegében igaz az amit mondtál túlságosan is. És a riot a profikra mérte most ezt a frissítést. Ott csak a nyomolvasót veszik meg teljesen elnyomja a többi kést. És riot logika ha valami elnyomja a többit (még ha csak egy bizonyos div-ben) ki kell szendi vagy változtatni kell rajta. Elméletileg kísérleteztek vagy kísérleteznek azzal hogy csak egy kés lesz ami ad sok mindent. köztük 1 db kontroll wardot. És régebben is elnyomta a nyomolvasó kése a többi tárgyat de az új rúnák több wardot adnak (szellem meg poro) Így viccesen sok ward van 1 bokorban egy LCS meccsen. Ez nem tetszik a riotnak. Az meg hogy mi van soloq ban lb nem számít.","replies":[{"poster":"Ks Elek","date":"2018-02-22T18:48:22.486+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igazad van, de ezzel a húzásukal kinyírták a lee sint. Emlékszem, hogy amikor még nem volt ez a jungler item anno még sightstone-t vettek, de két frissítéssel ezelőtt az is távozott a boltból.\nNem igazán szoktam játszani a vak kopaszt, de az tény, hogy sokkal gyengébb lesz majd, mert szinte lehetetlen lesz wardjumpok kivitelezése a számára. \nUgyanakkor az is igaz, hogy a trinketből tartalékolhat, de a junglerek az első pár hazatérésük után le szokták azt is cserélni.","replies":[{"poster":"Kriplee","date":"2018-02-23T08:33:47.576+0000","title":null,"up_votes":1,"down_votes":0,"body":"Kiváncsi leszek,hogy a nagyok a profi ligákban hogyan pótolják majd ezen wardok hiányát.\nAnnyi bizonyos,hogy a Riot egyre jobban ássa el magát azzal,hogy a mezei játékosok igényeit figyelembe se veszi.","replies":[]}]},{"poster":"Kriplee","date":"2018-02-22T14:57:35.772+0000","title":null,"up_votes":1,"down_votes":0,"body":"Akkor nem csak én látom igy a dolgokat :(","replies":[]}]},{"poster":"Rantnad","date":"2018-02-22T12:50:36.847+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mivel átvariálták a supportos itemeket, sok dzsungeles bőven jól jár azzal, hogyha azt veszi meg (főként gondolok itt a bűbájtolvaj pengéjére, de adott esetben a másik két tárgy is jó lehet), innentől kezdve pedig már nincs szükség a wardos itemre.","replies":[{"poster":"Kriplee","date":"2018-02-22T13:05:09.029+0000","title":null,"up_votes":1,"down_votes":0,"body":"Aham értem nagyjából,de most akkor mindenki support itemekkel fog rohangálni az erdőben? Ez eléggé kaotikus jövőkép :/","replies":[{"poster":"Rantnad","date":"2018-02-22T13:19:02.690+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mindenki végülis nem, de akik könnyen tudnak sebezni, azok mindenképp vinni fogják a bűbájtolvaj pengéjét, már ha a későbbiekben wardolni is szeretnének. Ez persze azért is jó, mert ha esetleg egy gank nem sikerül jól, de volt a dzsungelesnek találata, legalább egy kis goldot el tud hozni, a passzív aranyról nem is beszélve.","replies":[]}]}]}]}