{"poster":"She Who Wanders","date":"2016-04-20T23:18:47.913+0000","title":"Comunidad de LAS... un asco total?","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":5,"body":"Hola. Admito que nunca escribo en el foro, pero llego un punto en que esta situaci&oacute;n ya me supera. Quiz&aacute;s me digan que tengo que aguantarme estas situaciones si quiero jugar, me dir&aacute;n que me joda, etc. etc. etc. Quiz&aacute;s alg&uacute;n otro me de alguna clase de soluci&oacute;n. O quiz&aacute;s sirva para hacer consciencia. \r\n\r\nAcabo de perder una partida ganada. A muchos les habr&aacute; pasado por una mala jugada, una pelea en equipo perdida, o alguna otra cosa inherente al juego.   \r\n\r\nNo, acabo de perder por un... como llamarlo? Troll? Nene de mam&aacute;? no se, como quieran decirle.\r\n\r\nLo que pas&oacute; fue lo siguiente. Nasus, de nuestro equipo, insulta a Rammus, de nuestro equipo, por sacarle unos 6 u 8 minions (siendo que era min 20 o 25 y tenia mas de 350 stacks, vamos, que no los necesitaba tanto). Rammus lo insulta, como es de suponer. Despues de eso, Nasus amenaza con irse o dejar de jugar si Rammus no se disculpa. Obviamente, Rammus NO se disculpa. Nasus obviamente deja de jugar. \r\n\r\nEl equipo enemigo pushea y en 5 minutos ganan una partida que ten&iacute;an totalmente perdida de no ser por el capricho de dos... digamosles, &quot;nenes de mama&quot;, muy orgullosos como para bancarse insultos por un lado, y pedir disculpas por el otro.\r\n\r\nIntent&eacute; mediar la situaci&oacute;n, pidiendo que uno se disculpe, que el otro siga jugando y no preste atenci&oacute;n a esas cosas, etc. Nada surti&oacute; efecto, como imaginaran. La contestaci&oacute;n de Nasus fue: &quot;a ver si as&iacute; aprenden a jugar callados estos flammers de mierda&quot; \r\n\r\nComo dije antes, una se tiene que bancar esta clases de cosa? No se puede jugar en paz sin que se insulten, sin que uno se vaya afk, o que deje de jugar? Perder por esta clase de cosas? Como puedo mejorar asi? Cambiarme de servidor y perder los amigos que tengo en LAS?\r\n\r\nDiganme que lloro mucho, pero no me parece correcto que esto pase en un juego &quot;de equipo&quot;. \r\n\r\nSaludos","replies":[{"poster":"Efezto","date":"2016-04-20T23:27:57.094+0000","up_votes":2,"down_votes":0,"body":"Decir comunidad a alguno que no encaja, esta muy mal. \nNo es la comunidad de LAS, es la comunidad de cualquier juego online (incluso fuera de LoL).\n\nTrata de rodearte de buena gente para jugar, hay personas que valen la pena.","replies":[]},{"poster":"Tesnologo1","date":"2016-04-21T01:12:53.407+0000","up_votes":1,"down_votes":0,"body":"Estimado, lol es un juego que lo juega mucha gente, desde los 8-10 años hasta más de 30 años. No pidas que un nene de 10 se comporte como uno de 20, es normal cuando son malcriados. Perdiste la partida? Es frustrante, lo se, me ha tocado gente en mi equipo así. Pero como cosuelo, la partida se perdió por \"tu culpa\"???? Fedeaste mucho? Farmeaste como la basura? No cantaste las mias? No compraste wards? Chaseabas la kill en vez de ir por un objetivo? Tranquilo amigo. Paz.","replies":[]}]}