{"poster":"ryK","date":"2015-04-28T07:02:19.494+0000","title":"Suchen Mitspieler für Ranked 5vs5 Team (S3 bis G1) - Alter ab 25+","subforum":"Clans & Teams","up_votes":3,"down_votes":1,"body":"Moin,\r\n\r\nwir suchen derzeit mehrere Mitspieler f&uuml;r unser Ranked- Team. Ihr solltet im Elo- Bereich von Silber 3 aufw&auml;rts sein.  \r\n\r\nWir sind derzeit zu dritt und entsprechend eine eher gediegener Zockerrunde, d.h. wir sind 30+ Jahre alt. Deswegen suchen wir Spieler, die &auml;hnliche wie wir ab und an Zeitprobleme haben, aber trotzdem in Team spielen m&ouml;chten und allen Widrigkeiten zum Trotz auch spielen wollen(!). Angedacht sind zwei Abende die Woche zu trainieren. Fest ist bis dato Sonntag ab 19:00 Uhr.\r\n\r\nWir selber k&ouml;nnen weitestgehend jede Lane spielen, zurzeit sieht aber das Lineup wie folgt aus:\r\nMaddin (jungle) - S2\r\nLord of Beer (adc) - S2\r\nryK (support) - S1\r\n\r\nAufgrund von Spielzeiten und Ausf&auml;llen suchen wir aber mehr als 2 weitere Spieler, um die &uuml;brigen Position Mid und Top zu f&uuml;llen.\r\n\r\nIhr k&ouml;nnt Euch bei mir oder Lord of Beer melden. \r\n\r\nBeste Gr&uuml;&szlig;e,\r\nryK","replies":[{"poster":"Δ Shock Δ","date":"2015-04-28T07:21:26.616+0000","up_votes":2,"down_votes":0,"body":"Hey das hört sich doch ganz gut an für mich und  meinen Duo-Partner\n\nWir mainen genau diesen beiden position . Ich habe manl eine Anfrage in lol rausgeschickt\nwas den zeitlichen Aspekt angeht kann  ich mich nur anschließen auch wenn ich jetzt im moment was das angeht ziemlich flexibel bin.\n\nIch bzw. wir wüden uns über eine rückmeldung freuen.","replies":[{"poster":"ryK","date":"2015-04-28T08:39:06.505+0000","up_votes":1,"down_votes":0,"body":"Habe dich wieder geaddet - dachte vom Namen her, du wärst ein Spambot mit Elo Boosting. Habe jetzt erst den Forumbeitrag gesehen :)","replies":[]}]},{"poster":"ryK","date":"2015-05-04T07:59:36.007+0000","up_votes":1,"down_votes":0,"body":"wir sind vorläufig voll - danke für die zahlreichen nachfragen :)","replies":[]},{"poster":"AUTplayed1337","date":"2015-04-28T12:47:37.335+0000","up_votes":1,"down_votes":0,"body":"hey falls ihr einen sub spieler im jungle/top sucht hätte ich interesse. 28 jahre aus österreich\n\nlg","replies":[]},{"poster":"CrysheyX","date":"2015-04-28T14:03:15.573+0000","up_votes":0,"down_votes":0,"body":"Hallo :D \nWir wären hier 3 Leute die leidenschaftlich gern Lol spielen . \nAlter her wären wir 3 alle 19.\nIch (CrysheyX S1 Mid/adc) dann \nDeathscared ( B3 Top) und \nGoreth8888 ( B3 Top/Mid/Jungle)\n\nIch weis auch das die 2 nicht eurer Wunschelo entsprechen , aber ich kann aus Erfahrung reden die 2 Spielen auf besserem Niveau .\nHab dich und Lord mal ingame geaddet .\nFreue mich auf eine Antwort :)\nMFG \nCrysheyX","replies":[]}]}