{"poster":"ryK","date":"2015-10-30T07:46:09.639+0000","title":"Teamsuche - direkt aus der Hölle!","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hey, \n\nich suche jetzt schon seit rund 3 Wochen ein gescheites Team. Ich habe zahlreiche Leute geaddet aus diesem Forum, die angeblich einen Jungler oder Support f&uuml;r ihr Team suchen. Den Elo- bereich habe ich nat&uuml;rlich auf meine Elo - also Silber eingegrenzt. \n\nIronischerweise kam es bis dato bei bestimmt 10 Kontaktaufnahmen, also wo ich auch in die Friendlist aufgenommen wurde, zu keinem einzigen Spiel. Mindest doppelt so viele Kontaktanfragen wurden nicht angenommen. \n\nDer Knaller ist allerdings auch, dass diese 10 Kontakte, die sich tats&auml;chlich ergeben haben - zu rein gar nichts gef&uuml;hrt haben. Die Jungs, die suchten - hatten &uuml;berwiegend solche Spielverl&auml;ufe: \n\nTag 1 online 2 Spiele, \nTag 2 offline\nTag 3 offline\n...\nTag 11 online 3 Spiele\nTag 12 online 1 Spiel\nTag 13 offline\nTag 14 offline\n...\n\nIch war selber jahrelang Leader von Teams und dem Clan Versus.Pro, aber sowas ist mir schon lange nicht mehr untergekommen.\n\nKeine Ahnung, wenn man keine Zeit f&uuml;r ein Team und sogar LOL hat, dann sollte man nicht die Zeit anderer so verschwenden. Warum schreibe ich dazu, weil ich es selbst für \"League of Legends\"- Verhältnis für unheimlich hoch empfinde. \n\nThumbs up für den Threads, wer es zurzeit ähnlich erlebt. Bin offen für Tipps für Foren, in denen man tatsächlich Teams findet.","replies":[{"poster":"ryK","date":"2015-10-30T11:05:54.250+0000","up_votes":1,"down_votes":0,"body":"Sorry, ein Coach muss wesentlich mehr können, als das, was du da beschreibst.","replies":[{"poster":"Zulwar","date":"2015-10-30T11:12:08.357+0000","up_votes":1,"down_votes":1,"body":"Kannst du mir das dann bitte erklären, wie du das siehst, was die Aufgaben eines Coach sind? Würde mich interessieren, um dies auf mich Reflektieren zu können, um so meine Handlungsweise zu überdenken.\n\nEdit: Achja Thema Online-Aktivität. Du siehst nur Ranked spiele hier im Forum jedoch mache ich auch Aram spiele ab und zu wodurch dann die ein oder andere Lücke entstanden sein kann.","replies":[{"poster":"ryK","date":"2015-10-30T11:54:57.603+0000","up_votes":2,"down_votes":0,"body":"> Edit: Achja Thema Online-Aktivität. Du siehst nur Ranked spiele hier im Forum jedoch mache ich auch Aram spiele ab und zu wodurch dann die ein oder andere Lücke entstanden sein kann.\n\nnope, dein Spielverlauf im Client zeigt alles an. traurig oder ;)","replies":[{"poster":"Zulwar","date":"2015-10-30T13:12:13.563+0000","up_votes":1,"down_votes":1,"body":"Ok hast im CLient geschaut. Guter Junge. Jedoch taucht beispielsweise in deiner liste nicht auf das ich am 27.10. auch gespielt hatte nur so als beispiel. Andere Tage fehlen auch, aber wollte jetzt mal nicht kleinlich sein.","replies":[]}]}]}]},{"poster":"ryK","date":"2015-10-30T11:43:08.743+0000","up_votes":2,"down_votes":0,"body":"ein paar Aspekte eines Coaches:\n\n+ Theoretische Entwicklungen von Taktiken und Kombos unter Berücksichtigung der jeweiligen Championspools seiner Spieler,\n+ Praktische Hilfestellung bei der Umsetzung des vorgenannten, \n+ stetige Analyse von Spielen, um Verbesserungspotential zu finden,\n+ Individuelle Hilfestellung / Analyse für alle Spieler im Team - d.h. Championpick, Build, Runen / Masteries (auf niedrigen Elo- Niveau), Spielstil,\n+ Diskussionen, Teamsprechung, Einzelgespräche ... und wieder von vorne***\n+ er muss Up2date sein!***\n+ vor allem aber Konfliktmanagement im Team; Mediation zwischen Spielern im Ernstfall, ggf. aber auch für Einschnitte sorgen***\n+ Förderung und Verbesserung des Spielklimas im Team, das impliziert regelmäßige Anwesenheit(!)***\n+ permanente Ansprechbarkeit; Coach ist Muddi und Papi zugleich!***\n\n***= ohne das bist du kein Coach, sondern allerhöchstens ein \"Berater\", dem aber die High- Elo- Erfahrung fehlt. Du spielst sogar so unregelmäßig, dass du wahrscheinlich jedes Mal, wenn du LOL startest, den Client updaten musst. Du kannst einfach niemand etwas von Meta erzählen, z.B. Kindred schon gespielt?\n\n\n**ansonsten: wie willst du das alles an einem Abend schaffen, an dem du eigentlich spielen willst? **\n\nrichtig, das geht nicht - du kennst ja nicht einmal deine Mates, weil du sie einmal die Woche siehst. Ergo - was wird passieren, wenn du anfängst sie zu kritisieren. Wenn es ein eingeschworene Gruppe ist, werfen sie dich den Unruhegeist und Besserwisser (in ihren Augen) raus, oder ... sofern sie schon zerstritten sind, lösen sie sich auf und du merkst es erst eine Woche später.","replies":[{"poster":"Zulwar","date":"2015-10-30T13:30:29.457+0000","up_votes":1,"down_votes":0,"body":"Danke erstmal für die schöne Liste. Das hilft mir um den Begriff Couch mal aus einer andern Perspektive betrachten zu können.\n\nWer sagt das ich das an einem Abend machen will?\nTheoretische Entwicklungen sind nicht Ortsgebunden. Sowas kann man unterwegs auch machen bespielsweise oder wenn man ein bisschen luft hat, aber es sich nicht lohnt den Rechner anzumachen.\nAnsprechbarkeit kann über andere Systeme dann auch erfolgen, wo ein Spontanes online kommen, eingerichtet werden muss. Aber das versteht sich ja von selbst.\n\nÜber die anderen Dinge denke ich dann mal nach, wobei ich dir sicher in den meisten direkt zustimme, das diese als Couch wichtig sind.","replies":[]}]},{"poster":"ryK","date":"2015-10-30T13:23:05.882+0000","up_votes":1,"down_votes":0,"body":"scheint ein neuer bug zu sein,... bei mir selbst wird alles angezeigt. deine lolking historie ist aber tatsächlich eine andere als dein client matchverlauf... \n\nreport rito!","replies":[]},{"poster":"ryK","date":"2015-10-30T09:05:20.263+0000","up_votes":1,"down_votes":0,"body":"Sorry, wenn ich deinen Spielverlauf anschaue - weiß ich überhaupt nicht, warum du ein Team suchst. Ein Team ist nicht nur zum Spielen da, sondern auch miteinander bissle Zeit zu verbringen, labbern und abhängen. Deine Online- Aktivität: 28.10., 12.10., 11.10., 10.10., 13.09.(!) \n\nSorry, nimm es nicht böse - aber so jemanden würde ich auch nicht aufnehmen wollen. Ein Team coachen wollen, aber kein Spiel wirklich da sein - um die tatsächlichen Schwächen zu analysieren (das riecht schon nach alle anderen kritisieren, aber den Gegenbeweis selbst schuldig bleiben) - und 5vs5 Ranked ist was anderes als nur SoloQ. \n\nEin Teamgefüge ist wesentlich komplexer, weil unterschiedlicher Charakter zusammenspielen müssen. Besonders in LOL ist das einige Ecken schwerer als beispielsweise in Shootern.","replies":[{"poster":"Zulwar","date":"2015-10-30T10:50:33.555+0000","up_votes":1,"down_votes":1,"body":"Sicher deine Argumente sind berechtigt, aber ich sage mal an mindestens einem Tag in der Woche würde ich 1-2 Spiele zuzuschauen aufjedenfall schaffen und wenn die Teammitglieder spiele selber auch aufnehmen auch mehr.\nIch behaupte jetzt auch, das wenn die Leute eine Woche zeit haben um sich zu verbessern sind Fortschritte besser zu erkennen, da man da nicht so Berufsblind dann wird (Abstandgewinnung).\n\nIch weiß auch nicht, wie alt du so bist, aber in meinem Alter empfinde ich eine Woche als garnichts mehr. Wenn ich bedenke, wir haben schon wieder Freitag und Ende des Jahres. Dann bin ich gefühlt noch nicht so weit. Womit mindestens ein mal die Woche mit den Leuten zeit verbringen, labern, abzuhängen und zu zocken doch ganz passabel ist.\n\nAber Böse bin ich dir nicht. \n\n(das riecht schon nach alle anderen kritisieren, aber den Gegenbeweis selbst schuldig bleiben)\nDiese Unterstellung möchte ich gerne zurückweisen, da ich mich in meinem Alter als Geistig reif genug sehe um Fehler zu erkennen, ob die nun bei mir sind oder nicht, ist da egal, da ich die Dinge sehr Objektiv betrachte und somit dementsprechend damit umgehe.\n\nDie Frage ist jetzt was du als schwäche direkt betrachtest in Bezug auf die Anschuldigung oben. Denn zb. Wie spiele ich den Champion muss jeder selber wissen, denn jeder muss ja mit seinem Champ klar kommen, wenn jemand möchte kann man dem sicher den ein oder anderen Tipp geben und er muss dann wissen was er mit der Info anfängt.\nIch betrachte die Aufgabe als Couch eher so, das man grobe Fehler Anspricht und das wenn jemand mit einer Situation im Spiel unzufrieden war diese dann mit allen bespricht um so als Neutrale Person zu dienen. Sicher gehört es auch dazu das man lernt wie die einzelnen Leute spielen, um beispielsweise eine Homogene Teamstärke zu schaffen. Das heißt Stärken und Schwächen perfekt miteinander zu verbinden und das ist dann die Teamstärke je besser das ist. Und als Teamcoach geht es ja nicht darum zu sagen was der einzelne falsch macht sondern, was das ganze Team falsch macht.","replies":[]}]},{"poster":"Ashuna","date":"2015-10-30T08:09:04.358+0000","up_votes":1,"down_votes":0,"body":"Selber einen Post erstellen und Leute suchen ;-) Wenn man ein Team erstellen will sollte man es selber machen.\n\nmfg Ashuna {{champion:1}}","replies":[{"poster":"ryK","date":"2015-10-30T08:16:20.438+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ashuna,realm=EUW,application-id=ElKI1ocy,discussion-id=V6BO0Ewo,comment-id=0001,timestamp=2015-10-30T08:09:04.358+0000)\n>\n> Selber einen Post erstellen und Leute suchen ;-) Wenn man ein Team erstellen will sollte man es selber machen.\n> \n> mfg Ashuna {{champion:1}}\n\ngebe dir recht - es ist aber extrem zeitaufwendig. ich habe das 15 Jahre lang gemacht - in verschiedenen Spielen. Zulettzt auch wieder erfolgreich in Modern Warfare 3 als Top5 Team in Deutschland. Aber ich will das nicht mehr machen, weil ich halt weiß, dass ich als Captain dann immer gefordert bin - oft da zu sein, Problemchen zu lösen oder neue Spieler zu suchen. Den Job gebe ich dankend ab ;)","replies":[]}]},{"poster":"ryK","date":"2015-10-30T08:14:53.702+0000","up_votes":1,"down_votes":0,"body":"In den Communities finde ich es derzeit auch sehr erschreckend. \n\nMan lernt zwar viele Spieler kennen, aber daraus ergeben sich in der Regel keine spielfähigen Teams. Bei Community A habe ich nach zwei vergeblichen Versuchen durch die Community Manager Teams aufzumachen, selbst ein Team gegründet, dass immerhin 6 Monate durchweg lief. Leider brach es dann tatsächlich wegen beruflicher Veränderungen zweier Spieler auseinander. Dort war ich sogar \"Gameorganisator\" - hust.\n\nBei Community B musste man innerhalb von 1 Monat Gold werden, um dabei bleiben zu dürfen. Die Leader waren absolute Kinder, die im Bewerbungsgespräch völlig herumgespackt haben. Community C hatte nur Spielzeiten um 22:00 - bis 1:00 Uhr morgens und die drei Teams, die vorhanden waren - waren zu 2/3 inaktiv. Der Knaller war aber Community D: 10 Teams - 1,5 aktiv - und nur arrogante Schnöselspieler, die sich trotz Silber 2 Elo sQ für Xpeke hielten ;). Community E war mehr ein Team als eine tatsächliche Community. Das ging dann schon wieder besser, war ich fast 3 Monate, bis ich mehr oder weniger als Spieler ersetzt wurde. Und nein, ich flame nicht und beschuldige andere, wenn es nicht läuft - vielleicht ist aber das genau mein Problem ;). Community F ist nun die 6. und auch dort sucht niemand Spieler für ein Team. Zudem sind von 60 Mitgliedern abends vielleicht 15 online - am Sonntag vllt. sogar 20.","replies":[]},{"poster":"Rei Danna","date":"2015-10-30T07:59:57.794+0000","up_votes":1,"down_votes":0,"body":"kann das nur bestätigen^^ letztens auch 12 anfragen gehabt einmal gesprochen testgames für samstag vereinbart samstag alle offline... ka wenn man es nicht ernst meint dann doch bitte garnicht erst einen Post anfangen geschweige denn darauf reagieren.","replies":[]},{"poster":"Zulwar","date":"2015-10-30T08:52:58.117+0000","up_votes":1,"down_votes":2,"body":"Ich suche derzeit auch ein Team, aber ich kann sicher nur 1 mal die Woche lol spielen. Weil ich halt Berufstätig bin und auch noch ein reales Leben habe. Somit wäre ich gut als Ersatzspieler oder als Coach der sich dann einmal die Woche die Spiele ansieht und den Leuten mitteilt wo sie noch schwächen haben.\n\nWarum trotz so wenig zeit ich in einem Team spielen will ist, das ich sehr Teamorientiert bin und somit Ranked spielen will und auch versuchen möchte so hoch wie möglich zu kommen, jedoch dies dennoch unter der Berücksichtigung das ich nicht so viel zeit dafür habe. Was das auch schwierig gestaltet, da viele Teams 4-5 mal die Woche trainieren möchten.\n\nWarum ich mich in der Lage sehe jemanden zu coachen, um die Frage direkt vorwegzunehmen, obwohl ich Bronze bin, ist die das ich schon seid Season I lol spiele und ich aus dem Grunde viel Erfahrung habe und weiß wie man im Team zu spielen hat, das heißt wie die einzelnen Rollen funktionieren und so weiter.","replies":[]}]}