{"poster":"Scarfacé","date":"2015-06-16T18:11:48.049+0000","title":"Und wieder werde ih ohne Grund aus dem spiel diconncted und kann nicht mehr rein.","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"Mein spiel l&auml;uft gerade aber ich kann einfach nicht rein. Weder liegt das an meinem PC noch an meiner inet leitung. Dieses verfickte schei&szlig; spiel hat nur noch probleme. Kommst nach einem ganzen Tag arbeit nachhause und musst die diese unf&auml;higkeit von Riot reinziehen. Das spiel regt nur noch auf auf. Jeden Gott verdammten Tag ist was anderes. Kriegt ihr auch das spiel auch einmal zum laufen ohne Probleme. Das kann doch nicht so schwer sein.","replies":[{"poster":"Stoffverticker","date":"2015-06-16T19:34:47.190+0000","up_votes":1,"down_votes":0,"body":"Am schlimmsten ist es noch, wenn man seinen Smurf levelt.. :(\nEUW = Katoffelserver","replies":[]},{"poster":"iTrvp Lajin","date":"2015-06-16T19:01:58.665+0000","up_votes":1,"down_votes":0,"body":"geht mir genauso und das seit gestern abend schon =(","replies":[]},{"poster":"MYM Kreigon","date":"2015-06-16T18:32:54.986+0000","up_votes":1,"down_votes":0,"body":"jo hat ich auch , bei mir wurde das spiel iwann aufgelöst (wurde nicht aufgeführt in der matchhistorie)\nIch sag nur \"better fix EUW\" ^^","replies":[{"poster":"Róxàs","date":"2015-06-16T22:21:42.624+0000","up_votes":1,"down_votes":1,"body":"Das ist nicht die schuld von Riot  Kreigon :) \nDas ist \"drophacken\". Beim drophacken bringt einer der 10 Spieler den Server zum abstürzen sodass dass Spiel nicht aufgelistet als hätte es nie stattgefunden. o:\nMfg,\nPawn of death","replies":[]}]},{"poster":"Einachten","date":"2015-06-16T22:17:49.564+0000","up_votes":1,"down_votes":1,"body":"Leute omg,{{summoner:11}} \nbei diesen Problem handelt es sich um ein Spiel in dem jemand gedrophackt hat. Das solltet ihr mal langsam wissen. Der dazu gehörige Thread wurde on Riot angeheftet, bzw hier der Link: http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/JJH9QXmY-erhahtes-aufkommen-von-drophacks-mai-2015\n\nDu müsstest nach ca 15-45 minuten auf dem ACC das Spiel wieder antreten können, das betroffene Spiel wird gelöscht und taucht nicht in der Spiele Historie auf.{{summoner:6}} \n\nAch ja: Und das ist nicht die Schuld von Rito oder den Servern{{summoner:2}} , lediglich die Einstellung von gewissen Spielern zum Thema \"Gemeinschaft vs EGO\"{{summoner:3}} ","replies":[]}]}