{"poster":"maes98","date":"2016-03-04T12:49:39.340+0000","title":"comando \"colpire solo campioni\"","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Salve!! Ultimamente stavo imparandoa usare il comando di &quot;colpire solo campioni &quot;ed &egrave; molto utile; solo se; per usare questo comando devo mettere per forza shift + un tasto della tastiera senza shift nn funziona e questo lo rende molto scomodo ho provato molti modi anche dal file di testo input.ini ma se metto solo ad espemio &quot;spe&quot; o &quot;mb1&quot; il gioco non me lo legge. Vorrei sapere come devo fare x usare questi due comandi senza l&#039;uso di shift :)","replies":[{"poster":"Re Sombra","date":"2016-03-04T12:54:45.727+0000","up_votes":1,"down_votes":1,"body":"Perdonami c e un tale tasto ? Qual e ? \nCmq sia se c e; e ti scomodo puoi metterlo tramite il menu opzioni dove vuoi; io ad esmpio lo metterei sulla t; sarebbe un ottima cosa per fare caiting come adc.","replies":[{"poster":"Sexy Win","date":"2016-03-04T14:52:57.666+0000","up_votes":2,"down_votes":0,"body":"kiting , caiting è veramente brutto xD","replies":[]}]},{"poster":"Ucr0niA","date":"2016-03-04T12:56:56.405+0000","up_votes":2,"down_votes":1,"body":"Puoi cambiarlo nei comandi, comunque si, è utilissimo, lo uso da oltre 1 anno.\nAltro comando valido è quello per il selfcast","replies":[]},{"poster":"B3L14R","date":"2016-03-04T18:01:00.334+0000","up_votes":1,"down_votes":0,"body":"Spulciando nelle impostazioni l'ho trovato anche io questo tasto, mi spieghereste come funziona ed in che caso vale la pena usarlo?","replies":[]},{"poster":"maes98","date":"2016-03-04T19:47:10.155+0000","up_votes":1,"down_votes":1,"body":"c'è qualcuno che sa come risolvere il mio problema cioè che riesco a usare questa abiltà premendo solo shift+ un altro tasto. Io lo volgio impostare sulla barra spaziatrice ma se lo metto il gioco non lo legge con shift invece sì.","replies":[]},{"poster":"maes98","date":"2016-03-04T13:00:59.383+0000","up_votes":1,"down_votes":1,"body":"non avete capito la domanda è che se lo metto solo un tasto ad esempio T il gioco nn me lo legge però se faccio shift + t me lo da, ma xche??? E troppo scomodo con lo shift. Io lo volevo mettere sulla barra spaziatrice o sul tasto sinistro del mouse","replies":[]}]}