{"poster":"EsD Swiftcast","date":"2018-11-08T21:29:28.143+0000","title":"Wo sind meine gratis Champions?","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":11,"body":"Hi,\r\n\r\nich habe seit einer Weile nicht mehr aktiv lol gespielt und kürzlich wegen eines Freundes wieder angefangen. Auf seinem neuen Account hat er bereits ähnlich viele Champions wie ich! Darius, Ahri, Lux ... Champions die ich nur für viel BE kaufen kann, während er sie einfach gratis bekommt. Ich würde gerne diese Ahri Mission machen, dummerweise habe ich den Champion nicht. \r\n\r\nIch habe mir, wie wahrscheinlich jeder Spieler, bereits eine Liste gemacht. Eine Reihenfolge von Champion, welche ich gerne spielen würde/kaufen möchte.\r\n {{champion:114}} {{champion:39}} {{champion:4}} {{champion:164}} {{champion:38}} {{champion:112}} {{champion:122}} {{champion:104}} {{champion:121}} {{champion:202}} {{champion:412}} {{champion:67}} {{champion:238}} {{champion:268}} \r\nDas macht 63.300 BE (235{{champion:40}} Championsplitter)\r\nSagen wir mal, ich bekomme 1200 BE pro Kapsel und 2500 pro 10er Kapsel (momentan lvl** 43**) - dann bräuchte ich noch **47** Level!\r\nIch schaffe pro Tag ca. 35% eines Levels - demnach müsste ich dafür **135 Tage** spielen (da ich nicht jeden Tag spiele und an freien Tagen etwas mehr, könnte das sogar hinkommen).\r\nNun, durch den ersten Sieg des Tages bekomme ich jedoch 50BE mehr, als in meiner Rechnung. Mit diesem Bonus verringert sich die Spielzeit auf **122 Tage** (17 Wochen). \r\nJetzt gehe ich mal von 3.3 Splittern pro Kapsel aus (eingeschlossen die 10er, da in den 1ern oft nur 1-2 Splitter sind) - demnach bekomme ich in etwa 155 Championkapseln. Ich hoffe wirklich, dass es nicht nur {{champion:40}} Splitter werden.\r\nIch habe also 155 mal eine 9.8% Chance, dass einer der Champions als Splitter mit einem Rabatt gekauft werden kann. Die Chance verringert sich natürlich, nach dem ersten Champion aus der Liste. Ich gehe davon aus, dass ich für 3 Champions einen Rabatt kriegen werden.\r\n\r\nWie ich es auch drehe und wende, letzten endes wird es mich mehr als **115 Tage** kosten, diese 14 Champions zu kaufen - wenn ich nicht exzessiv spiele. Durch neue Missionen schaffe ich es vielleicht sogar in **100 Tagen. \r\n**\r\n\r\nDa nur selten neue Champions dazu kommen, wird sich Diese auch nicht so schnell ändern. Auch wenn ich bei der Reihenfolge noch unentschlossen bin, fällt sofort auf dass {{champion:122}} auf meiner Liste steht. Wieso bekommen tausende von neuen, nicht mal bewiesen loyalen Spielern; die weder {{item:2419}} noch {{item:2319}} investiert haben, soviele Dinge geschenkt? Icons, Champions, wer weiß was noch alles. Ich meine, klar, Riotgames möchte das Spiel attraktiv für Neuzugänge machen - kein Grund es für treue Spieler nicht zutun. Ich komme von einer langen Pause zurück, wäre schön wenn ich einen Willkommensbonus hätte.\r\n\r\n{{champion:122}} alleine wird mich schon ca. 9 Tage kosten. Und neue Spieler bekommen den einfach gratis? Fürs nichts tun? Hm ....\r\n\r\nNun, gibt es eine Möglichkeit diese Champions gratis zu bekommen?\r\nFalls nicht, - wieso?\r\n\r\nVG","replies":[{"poster":"Veezey","date":"2018-11-09T15:35:28.813+0000","up_votes":5,"down_votes":0,"body":"Das ist einfach mimimi. Warum die und ich nicht? Wenn es dich wirklich so stört mach dir einfach einen neuen Account und dann bekommst du auch alles gratis.","replies":[{"poster":"EsD Swiftcast","date":"2018-11-10T10:12:06.308+0000","up_votes":1,"down_votes":2,"body":"bewirb dich doch als riot supp ... ich sehe potenzial .... (nicht) - danke für deinen kommentar","replies":[{"poster":"Veezey","date":"2018-11-10T14:51:47.228+0000","up_votes":2,"down_votes":1,"body":"Ist das denn nicht so? Du meckerst du hier doch nur, weil du die Champions nicht gratis bekommst.","replies":[]}]}]},{"poster":"Amycos Cyrus","date":"2018-11-08T22:02:28.034+0000","up_votes":3,"down_votes":1,"body":"> Nun, gibt es eine Möglichkeit diese Champions gratis zu bekommen?\n> Falls nicht, - wieso?\n\nNein gibt es nicht.\nLösung:\n\n - Die Shard die ein neuer Spieler erhält sind: Caitlyn XinZhao Janna\n - Bereits freigeschaltet sind: Ashe Garen und Brand.\n\nWeiterhin ist das freischalten dieser Events an ein bestimmtes Level gebunden.\nEine Liste findest du hier: http://leagueoflegends.wikia.com/wiki/Experience_(summoner)\n\nAls letztes muss man die Shards ja auch noch aufwerten bzw. freischalten, was ja ebenfalls etwas kostet. Somit gibt es nur Ashe Garen und Brand gratis.","replies":[{"poster":"EsD Swiftcast","date":"2018-11-09T05:24:19.789+0000","up_votes":1,"down_votes":6,"body":"falsch ... man bekommt caitlyn, brand, lux, ahri, darius, mf und yi als permanente champion shards für die ersten missionen ... man kann sie entweder für sehr viel BE verkaufen oder gratis freischalten ... imformier dich mal besser bevor du kommentierst","replies":[{"poster":"dugg","date":"2018-11-09T07:09:06.969+0000","up_votes":5,"down_votes":0,"body":"Eigentlich wollte ich dir eine sachliche Antwort zu diesem Thema zuschicken, aber mit diesen Kommentar vergeht mir die Lust.\n\nWenn du dich besser informieren kannst, als andere User, die dir versuchen zu helfen, dann tu es bitte selbst.\n\nViel Spaß beim Champions freispielen.","replies":[{"poster":"Qbert","date":"2018-11-09T09:03:19.007+0000","up_votes":4,"down_votes":0,"body":"Es handelt sich hier um jemanden, der einfach alles geschenkt haben möchte. Klarer Fall von falschem Unrechtsbewusstsein ... da hilft auch Sachlichkeit nicht.","replies":[{"poster":"EsD Swiftcast","date":"2018-11-09T13:59:53.908+0000","up_votes":1,"down_votes":4,"body":"bitte was? ich möchte lediglich die gleichen bedingungen wie andere? was ist los mit dieser communtiy","replies":[{"poster":"Qbert","date":"2018-11-09T14:06:27.677+0000","up_votes":2,"down_votes":0,"body":"Wenn du einen neuen Account anlegst, hast du diese auch.\nDa die Änderungen aber offenbar eingeführt wurden, als du schon lvl30 (oder so) warst, betrifft es dich nicht.\n\nIst nun mal so, find dich damit ab und verdien dir die Champions einfach. Wie kann man nur so faul/gierig sein?","replies":[{"poster":"EsD Swiftcast","date":"2018-11-09T14:13:09.777+0000","up_votes":1,"down_votes":2,"body":"Faul? Gierig? Wow, ich wiederhole meinen vorherigen Kommentar \"\".\n\nEs ist nicht gierig gleiche \"Rechte\" zu verlangen. Ich muss es mir erarbeiten, sie bekommen es gratis. Klar muss ich mich damit abfinden, muss ich dem zustimmen? Nein\n\nEin einfaches Beispiel für dich - vielleicht erinnerst du dich daran wie Runen einiges an IP gekostet haben. Weißt du noch wie Spieler (die alle Runen gekauft/erarbeitet habe) reagiert haben, als Riot die Runenkosten entfernt hat? \n\nWenigstens gab es dafür Entschädigung. Gleiches Prinzip, andere Situation. Ich muss(te) mir diese 7 Champions hart erarbeiten und andere, neue Spieler, die sie noch nicht gekauft haben, bekommen diese Gratis. \n\nJetzt beleidigst du mich als Faul und Gierig, weil ich das nicht gut heiße? Respekt","replies":[{"poster":"Pure Cynicism","date":"2018-11-09T16:19:28.467+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=xGhost Bifix,realm=EUW,application-id=YnZkMR0R,discussion-id=4QMvjoHr,comment-id=0000000000020000000000000000,timestamp=2018-11-09T14:13:09.777+0000)\n\n> Es ist nicht gierig gleiche &quot;Rechte&quot; zu verlangen. \n\nDu verstehst deine Position wohl nicht so ganz. Du hast kein Recht, von Riot irgendetwas zu verlangen, außer dass sie dir für den Kauf von RP diese gutschreiben und dir den damit gekauften Inhalt freischalten. Insofern ist diese ganze Diskussion fruchtlos. \n\nFinde dich damit ab, dass ein Spielentwickler für neue Accounts gewisse Annehmlichkeiten einführt. Das ist bei Online-Spielen Standard. Früher musste man in WoW für sein Mount monatelang farmen, heute bekommt man die Mounts hinterhergeworfen. Ist dasselbe Prinzip.","replies":[{"poster":"EsD Swiftcast","date":"2018-11-10T10:13:04.520+0000","up_votes":2,"down_votes":1,"body":"gewohnheitsrecht ... bin es gewohnt dass riotgames alle spieler fair und gleich behandelt ... demnach ist es sehr verständlich dass ich es anspreche wenn sich das ändert","replies":[{"poster":"Pure Cynicism","date":"2018-11-10T12:45:22.492+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=EsD Swiftcast,realm=EUW,application-id=YnZkMR0R,discussion-id=4QMvjoHr,comment-id=000000000002000000000000000000000000,timestamp=2018-11-10T10:13:04.520+0000)\n>\n> gewohnheitsrecht ... bin es gewohnt dass riotgames alle spieler fair und gleich behandelt ... demnach ist es sehr verständlich dass ich es anspreche wenn sich das ändert\n\nGewohnheitsrecht? Bitte hör auf, Fachbegriffe falsch zu benutzen. Du hast im vertraglichen Bereich nur sehr eingeschränkt Anspruch auf Gleichbehandlung.","replies":[{"poster":"Qbert","date":"2018-11-10T19:56:50.558+0000","up_votes":1,"down_votes":1,"body":"Da schlägt das gefährliche Halbwissen zu ... Leute gibt's","replies":[]}]}]}]},{"poster":"Sirrkas","date":"2018-11-10T11:46:50.460+0000","up_votes":1,"down_votes":0,"body":">Weißt du noch wie Spieler (die alle Runen gekauft/erarbeitet habe) reagiert haben, als Riot die Runenkosten entfernt hat?\n\nAlso ich habe mich darüber gefreut. Obwohl ich keine Runen mehr brauchte. Ich hatte 7 Jahre Zeit, die Runen, die ich für EP erworben hatte, zu benutzen. Es wurde langsam Zeit, dass die Kosten hier wegfallen. Im Grunde hat davon am Ende jeder profitiert. Neue Spieler müssen keine IP mehr dafür verschwenden und alte konnten die Runenseiten behalten. Wer eh schon zu viele IP hatte, den hat es nicht wirklich betroffen.","replies":[]}]}]}]}]},{"poster":"EsD Swiftcast","date":"2018-11-09T14:00:26.330+0000","up_votes":1,"down_votes":3,"body":"wenn du versuchst etwas sachlich zu beantworten und dabei falsche fakten gibst, erwartest du resignierte zustimmung oder was?","replies":[{"poster":"dugg","date":"2018-11-10T13:45:29.075+0000","up_votes":2,"down_votes":1,"body":"Nein, aber Respekt und eine höfliche Umgangsform. An beiden mangelt es dir in dem kompletten Thread.","replies":[]}]}]},{"poster":"Angel Ayume","date":"2018-11-09T06:01:31.657+0000","up_votes":2,"down_votes":0,"body":"Und du solltest nicht so unhöflich sein, wenn dir jemand versucht zu helfen!","replies":[]},{"poster":"Megamaexx","date":"2018-11-09T06:42:13.896+0000","up_votes":1,"down_votes":0,"body":"Deine Aussage widerspricht der Quelle, die er mitgeschickt hat. Kannst du deine Aussage auch belegen?\nÜbrigens hat eine Freundin auch vor kurzem angefangen zu spielen und auf den ersten Leveln hat sie nicht so extrem viele Champions. Sie hat übrigens keine Caitlyn sondern Annie laut ihrer Aussage. \n\n(Edit: In ihrem Besitz befinden sich Annie, Ashe, Garen. Brand war vermutlich als Shard dabei)\n\nSolltest du aber weniger als 30 Champions, keine Shards und wenig BE besitzen, kannst du ja mal den Support fragen, ob er deinen Account komplett zurücksetzt. Keine Ahnung, ob die das bei Champions und Leveln machen, aber Fragen kostet nix","replies":[{"poster":"Amycos Cyrus","date":"2018-11-09T07:33:43.151+0000","up_votes":1,"down_votes":0,"body":"Man bekommt halt recht oft Shards bestimmter Werte bevor man auf Level 30 ankommt. Daher fällt auch viel wieder raus, da man ja auch BE für ihre Aufwertung benötigt.\n\nDas mit Caitlyn. Ich habe keine Ahnung ob alle Infos der Seite so stimmen, jedoch ist sie seit dem 29.9.18 nicht verändert worden, was bei einem Wiki in meinen Augen dafür spricht dass der Inhalt durch niemanden geändert wurde, da er bereits korrekt sei. Caitlyn besitzt ja eh nur eine Chance (70%) die anderen 30% sind mit Zufälligen Shards bestückt, wobei sie mindestens 1350BE wertige Champs enthalten sollen. (Spricht gegen Annie bzw. gegen die Fehlerfreiheit der Quelle XD)","replies":[{"poster":"Megamaexx","date":"2018-11-09T07:50:28.500+0000","up_votes":1,"down_votes":1,"body":"Hmm, vielleicht wurde da irgendwas verändert. Garen, Ashe und Brand hat sie auch erwähnt, wobei sie Brand scheinbar disenchanten konnte (und gemacht hat, weil Mädchen und hässlicher Champion xD). Ich glaube, ich muss das irgendwann mal selbst in Erfahrung bringen :D","replies":[]}]},{"poster":"EsD Swiftcast","date":"2018-11-09T14:03:17.777+0000","up_votes":1,"down_votes":2,"body":"man bekommt caitlyn shard fürs tutorial ... permanent shard .. nicht nur normales shard ... was sie damit gemacht hat ist was anderes. zumindest seit 3 monaten. ich habe keine lust den account kurz vor season ende wieder auf 30 zu leveln nur um ein paar gratis champs für missionen zu bekommen ... hätte lieber einfach die mission ....\n\n\"spiele ein draftpick game um darius permanent splitter zu erhalten\"\n\"schließe tutorial 3 ab um caitlyn/brand permanent splitter zu erhalten\"\nusw","replies":[{"poster":"Sirrkas","date":"2018-11-10T11:44:50.724+0000","up_votes":1,"down_votes":0,"body":"Du kannst das Tutorial selbst spielen. Habe ich erst letzte Woche gemacht und die EP erhalten.\n\nWenn es dafür einen Caitlyn shard geben sollte, wirst auch du den erhalten. Da ich keinen habe, gibt es wohl keinen dafür. Allerdings waren das grob 500 EP, die ich für ein paar sehr einfache \"Spiele\" erhalten habe.","replies":[]}]}]}]}]},{"poster":"Qbert","date":"2018-11-09T09:02:30.555+0000","up_votes":3,"down_votes":0,"body":"Du bekommst die Champions während der Levelphase.\nDa du bereits mehr als genug Zeit gehabt hättest, weil du ja schon eine Weile Level30+ bist, musst du sie dir eben erspielen.\n\nDas ist nun mal das Prinzip, Ende.","replies":[{"poster":"EsD Swiftcast","date":"2018-11-09T14:07:10.582+0000","up_votes":1,"down_votes":3,"body":"endlich mal eine ordentliche antwort, auch wenn es die situation nicht grade besser macht.\nes geht mir darum dass sie gratis champions bekommen, die ich nicht habe. ich weiß noch wieviele sich aufgeregt haben dass runen gratis sind ... genug dass riot entschieden hat die älteren spieler zu entschädigen---gleiches prinzip, andere situation.","replies":[]}]},{"poster":"legofreak1","date":"2018-11-09T08:42:39.912+0000","up_votes":2,"down_votes":0,"body":"Hier findest du eine Auflistung, welche Inhalte einem auf dem Weg zu level 30 freigeschaltet werden:\nhttps://support.riotgames.com/hc/de/articles/201752824\nInsgesamt sind dies, wenn ich mich nicht vertippt habe, 27280BE. Das sind im Durchschnitt etwas ueber 900BE/Level.\n\nAb level 30 erhaeltst du pro Level Splitter, die mindestens 810BE Wert sind und jedes 10te Level eine glorreiche Kapsel, welche Splitter im Wert von mindestens etwas ueber 2kBE enthaelt. Damit bekommst du im Durchschnitt etwas mehr BE pro Level als jemand unter Level 30. Der einzige wesentliche Unterschied fuer Spieler unter Level 30 ist, dass diese ein paar zusaetzliche kosmetische Inhalte erhalten und dass diese auf niedrigen Leveln weniger EXP benoetigen, um ein Level aufzusteigen. So gross ist der Unterschied also nicht.","replies":[{"poster":"EsD Swiftcast","date":"2018-11-09T14:06:40.122+0000","up_votes":1,"down_votes":3,"body":"es geht mir darum dass sie gratis champions bekommen, die ich nicht habe. ich weiß noch wieviele sich aufgeregt haben dass runen gratis sind ... genug dass riot entschieden hat die älteren spieler zu entschädigen---gleiches prinzip, andere situation.","replies":[{"poster":"legofreak1","date":"2018-11-09T16:13:24.252+0000","up_votes":1,"down_votes":0,"body":"Der Wert der Champions, den neue Spieler auf dem Weg zu Level 30 erhalten, entspricht in etwa dem Wert an BE, welche du innerhalb von 30 Leveln bekommst. Im Gegensatz zu neuen Spielern kannst du dir sogar vollständig aussuchen, wofür du diese BE ausgeben möchtest, manche der Champions sind für Neulinge fest vorgegeben oder aus einer kleinen Auswahl zusammengestellt.\n\nFür die Runen wurden Spieler \"entschädigt\", weil Inhalte entfernt wurden, welche man sich bis zu diesem Zeitpunkt im Spiel mit BE kaufen musste. Hier wird dir nichts weggenommen und du wirst auch nicht benachteiligt. Unabhängig davon hättest du gemäß der AGB sowieso keinen Anspruch auf eine \"Entschädigung\".","replies":[{"poster":"EsD Swiftcast","date":"2018-11-10T10:14:56.675+0000","up_votes":1,"down_votes":2,"body":"> vollständig aussuchen\n\nsie können buchstäblich die permanenten splitter für so 2400 BE das stück verkaufen...btw...ich sage nur, hätte ich meinen account nicht 2011 sondern vor drei monaten erstellt ... hätte ich jetzt sehr viel mehr champions","replies":[{"poster":"Heavenly Sir","date":"2018-11-10T11:35:05.845+0000","up_votes":2,"down_votes":0,"body":"Entweder Du kommst damit klar das neue Spieler diese Champions geschenkt bekommen oder Du hörst mit League of Legends auf.\n\nZumal neue Spieler halt eine Auswahl an Champions am Anfang haben sollen.\n\nAls lvl 30 ging man davon aus das Du schon eine gute Anzahl an Champions hast. Ein lvl 1 hat nur die die auch in der Zeit gratis sind.\nDamit dieser aber etwas mehr Vielfalt hat bekommt er halt ein paar gratis. \n\nUngerecht ist es auch nicht da alle Spieler die lvl 30 waren auch keine Champions geschenkt bekommen haben.\n\nSchlussendlich kann man sich freuen das neuen Spielern etwas besser geholfen wird als uns früher und diese damit das Spiel vielleicht länger spielen und bereichern.\n\nAlso entweder Du hörst mit League of Legends auf wenn Du dich so sehr angegriffen fühlst oder Du spielst weiter und akzeptierst es.","replies":[]},{"poster":"Veezey","date":"2018-11-10T16:01:26.966+0000","up_votes":1,"down_votes":0,"body":"Also ich hab meinen Account seit 2011 und hab alle Champions. Selbst, wenn du jeden Tag nur den ersten Sieg des Tages abgeholt hättest, wärst du jetzt im Besitz aller Champions.","replies":[{"poster":"Sirrkas","date":"2018-11-10T16:48:04.271+0000","up_votes":1,"down_votes":0,"body":"Ich habe inzwischen haufenweise Splitter. Ich muss mal durchgehen, wie viele BE das wären. Ich will von jedem Champ immer 2 behalten, falls ich doch mal Mastery 6 oder 7 erreichen möchte. Auch wenn das bei Champs wie Zed und Talon nie der Fall sein wird.","replies":[]}]}]}]}]}]},{"poster":"Dr Madscientist","date":"2018-11-10T20:08:00.251+0000","up_votes":1,"down_votes":0,"body":"Ich las grad ein Buch über die Klassenlose Gesellschaft.\nHab sehr gelacht.","replies":[]}]}