{"poster":"Im a Papaya","date":"2017-04-28T15:50:09.797+0000","title":"\"Schwere\" Supporter","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Ich spiele gelegentlich als Support weil die Rolle mir Spa&szlig; macht aber ich hab das Gef&uuml;hl das die Supporter Mechaniken auf Champions bezogen immer sehr simpel gehalten werden nicht um den Spieler des Champions das Leben leicht zu machen sondern um allein das spielen des Champions attraktiv zu halten. Auf gut Deutsch: Wenn ein Support Champion zu schwer zu verstehen ist f&uuml;r deine Mates kannst du mit deinem Champ noch so gut sein aber deine Mates reagieren nicht passend darauf und du bist ziemlich nutzlos. \r\nMeine Frage ist: Welche Champs z&auml;hlen mehr oder weniger dazu ? Ivern w&auml;re mein pers&ouml;nliches Lieblingsbeispiel. Du siehst selten einen gefeedeten Ivern nur ein gefeedetes Team das mit einem Ivern zusammen spielt.\r\nIch hoffe mein Post ist zwischen meinen Gedanken nicht unverst&auml;ndlich geworden ^^","replies":[{"poster":"Vorzüglich","date":"2017-04-28T16:49:06.841+0000","up_votes":1,"down_votes":1,"body":"Ich würde es anders formulieren.\n\nAlle Supports deren CC direkt auf die **eigenen** Allys wirken können z.B Schilde oder Heals sind von der Mechanik, einfach für das eigene Team zu verstehen.\n\nBei CC die direkt auf den **Gegner** wirkt, z.B. Hooks, Slows, Stuns ist grundsätzlich mehr Aufmerksamkeit gefordert. \nSprich beim \"follow up\" wird es darauf ankommen wie gut der eigene ADC oder Teammate deine CC auf den Gegner wahrnimmt.\n\nIch spiele daher Offensive Supports wie Annie, Brand etc. lieber Premade.","replies":[]},{"poster":"Quinn der Woche","date":"2017-04-28T16:12:47.556+0000","up_votes":1,"down_votes":0,"body":"ivern ... ?! du weißt aber schon das er ein supporter im Jgl ist und extrem gut ist?","replies":[{"poster":"Im a Papaya","date":"2017-04-29T09:40:48.995+0000","up_votes":1,"down_votes":0,"body":"Ich hab nie gemeint das Ivern schwach ist, nur das Ivern kein Champ wie xin oder Yi ist der Solo Carry spielt sondern auch eher als Supporter eingestuft werden soll.","replies":[]},{"poster":"Oriius","date":"2017-04-28T16:40:33.897+0000","up_votes":1,"down_votes":0,"body":"Hat nicht ohne grund höchste winrate von den junglern (wenn ich mich nicht verlesen hab) :D Ich persönlich find ihn jedoch recht schwach, das einzige was mich nervt das Schilde mir im moment recht op vorkommen. Kp wieso aber schilde sind grad iwie richtig nervig xd","replies":[{"poster":"Sylvánas","date":"2017-04-28T17:16:31.515+0000","up_votes":1,"down_votes":0,"body":"Ivern ist ein ausgezeichneter Jungler und meiner Meinung nach einer der wenigen Champs, die tatsächlich OP sind. Ivern hat von allen Champs die wenigsten Probleme Camps zu clearen - einfach wegen seinem Passiv. Und das macht ihn eigentlich schon stärker als die meisten anderen Junglers. Ivern kann mit einem Spell den gegnerischen Buff auf Level 2 stehlen und weil er es so schnell machen kann, wird ihn dabei auch niemand aufhalten können. \n\n\nIvern hat übrigens nicht nur höchste Winrate unter Junglern, sondern von allen Champs im Game mit 57%. Das ist schon ein extrem hoher Wert.","replies":[]}]}]},{"poster":"BMW E39 525d","date":"2017-04-28T18:26:08.537+0000","up_votes":1,"down_votes":0,"body":"Beim Supporter ist natürlich auch relativ wichtig wie die Synergie ist. Es gibt durchaus Champs die du mit jedem ADC spielen kannst, vorrangig Healer. Was halt keinen Sinn macht wäre z.B. Braum und Draven, weil Draven early kills braucht und Braum nicht offensiv genug spielen kann. Genau wie man einen Kog Maw eher beschützen muss und ein Thresh oder Annie relativ schlecht sind. Thresh ist aber sowieso eher allround, da hängt das auch einfach vom ADC ab, weil Thresh guten Peel hat und die Laterne sehr wichtig sein kann. Dadurch kann der ADC etwas offensiver stehen. Dabei muss der ADC aber ganz genau wissen, dass er nie schlecht traden darf, weil er sonst nach 3 Minuten mit 10%hp unterm Tower steht, Thresh kann rein oder raus, aber stay/sustain bietet er nicht.\n\nNen Kog unterstützt du meiner Meinung nach sehr gut mit agressiven supporten, die trotzdem etwas peelen können (Zyra) oder mit \"Healern\" (Soraka/Janna/Lulu). Malzahar ist natürlich irgendwo dominant und nervig, aber trotzdem wäre die Lane anfällig für Ganks.\n\nAlso einfache für Supports für Mitspieler sind i.d.R. alle Healer/Shielder und DMG Supports. Bei Healern/Shieldern ist das Problem, dass die ADCs sehr agressiv spielen können und müssen, manche können aber das Potenzial von Schilden und Heals (z.B. Janna/Soraka) nicht einschätzen. DMG Supports machen einfach nur Schaden ohne Ende und werden später ggf. zum typischen Mage, da ist in der Regel das Positioning von dir selbst sehr entscheidend.\n\nAber ich meine die Winrate an sich spricht auch schon Bände ich hatte früher 68% WR auf Soraka und das in 150 Games in der Season oder so und mit Thresh 51% auf 250 Games. Mit Thresh kommst du definitiv nicht hoch, ist einfach so.","replies":[]},{"poster":"Sihari","date":"2017-04-28T16:33:53.322+0000","up_votes":1,"down_votes":0,"body":"Deine Beschreibung vom gefeedeten Team das mit einem Ivern zusammen spielt kommt mir ein bisschen so vor, als würdest du weder verstehen was ein Support überhaupt macht, noch wie die Goldverteilung in diesem Spiel funktionieren sollte... :/\nEin Ivern, eine Janna oder ein Thresh carrien dann, wenn sie dem eigenen Team Dinge, wie zB Kills oder Objektives, ermöglichen, ohne diese selbst zu nehmen. Für Leute, die nur auf die KDA, oder besser sogar nur auf die KD schauen, sieht ein 2/1/34 Ivern, der mit seinen Lanern schon zum Anfang alle Tower geforced hat natürlich nicht eindrucksvoll oder gefeedet aus. Dabei hat er das Team eigenhändig zum Sieg geführt!","replies":[]},{"poster":"Vorzüglich","date":"2017-04-29T15:32:46.509+0000","up_votes":1,"down_votes":1,"body":"Passive Champs, das würde ich eher als Mentalität bezeichnen.\n\nWas viel mit der eigenen Erfahrung zu tun hat oder der persönlichen Spielweise.\n\nDraven / Soraka kann eine super Aggressive lane darstellen, genauso gut kann man auch mit Janna pushen und trades eingehen.\n\nSprich es hängt alles wie du bereits sagt davon ab wie gut man seine Chancen und  die gegnerische Skill cooldowns ausnutzt.\n\nDer eigentliche unterschied liegt doch im Premade oder im Solo Q ob ich mich absprechen kann via TS oder ob ich das erste mal dem ADC als Support gegenüber stehe.\n\nUnd da empfinde ich es wesentlich leichter mit Champs zu spielen, die ihre Skills auf das eigene Team setzen können als umgekehrt.\n\nEinfach weil man nicht auf die follow up angewiesen ist, was \"erfolgreicher\" ist, das noch eine ganz andere frage.","replies":[]},{"poster":"Sylvánas","date":"2017-04-28T17:20:01.585+0000","up_votes":1,"down_votes":1,"body":"Naja.. würde mal sagen dass Thresh Teammates braucht, damit er useful wird. Er kann noch so viel hooken, solo killen wird er zb. einen ADC kaum, und wenn sein Team nichts aus dem Engage macht, ist Thresh ziemlich nutzlos. Blitz finde ich da nicht so schlimm weil der Hook von dem weniger Aufmerksamkeit des Teams benötigt.\nBard ist auch eher so einer, der etwas Verständnis von den Teammates braucht, wegen der Ult, und Malzahar sowieso.","replies":[]}]}