{"poster":"Ghost I WarZz","date":"2015-04-10T20:22:58.477+0000","title":"LOL BUG KANN MICH NICHT BEWEGEN","subforum":"Hilfe & Support","up_votes":2,"down_votes":1,"body":"Hallo Liebe Community- Und zwar ich spiele LoL. Ich joine in ein game und ein paar minuten sp&auml;ter kann ich mich nicht mehr bewegen, mein Ping ist gut ( ca 30 ) und fps ist auch konstant auf 60. Ich sehe alles ok, also ich sehe wie andere spieler sich bewegen und kann auch an sich im chat schreiben. Dieses Problem habe ich mitlerweile seit 4 spielen, alle heute gespielt. Wenn ich Get&ouml;tet werde durch einen anderen Champion kann ich mich wieder bewegen aber nicht lange darauf kommt wieder dasselbe problem. Ich habe nun schon versucht wenn ich den LoL Launcher &ouml;ffne auf &quot; repair &quot; zu drcken da hat es auch vollst&auml;ndig alles repariert. Leider kann ich LoL nicht nochmal neu Installieren da ich nicht die Rechte dazu habe, und derjenige der das so eingestellt hat verweilt leider nichtmehr auf dieser welt. Was kann ich nun tun um dies zu beheben. PS ich m&ouml;chte ehrlichgesagt auch nicht einen support fragen da dies mindestens 2 tage dauern w&uuml;rde und ich ja eig. noch heute spielen will. Ich hoffe ihr habt eine Antwort darauf! MFG Ghost I WarZz","replies":[{"poster":"M4UR1C31234","date":"2015-04-10T20:42:41.859+0000","up_votes":1,"down_votes":0,"body":"Ist das nicht einfach nur ein DC? Habe kommplett dasselbe aber bei mir war es 100% ein DC (wo sich dennoch andere Champions noch bewegt haben teilweise).\n\nMit Freundlichen Grüßen","replies":[{"poster":"Ghost I WarZz","date":"2015-04-10T20:47:37.433+0000","up_votes":1,"down_votes":0,"body":"nein nicht nur ein dc das ist nun grad das 5. game","replies":[{"poster":"Kùrby","date":"2015-04-10T20:53:41.110+0000","up_votes":2,"down_votes":0,"body":"Ich habe ein ähnliches Problem gehabt. \nBlitz im Rank game gespielt und ich habe in unterschiedlichen Abständen einen \"slow\" auf mir gehabt.. das hat tierisch genervt, gerade als Blitz wenn man rein rennen will um jemanden zu \"hooken\" und dann den slow bekommen.. genauso wie beim escapen.. \n(Nein! ich wurde nicht geslowed, ich bin ganz normal durch unseren Jungle gelaufen und kein Gegner war in der nähe : auch kein Teemo ) ..","replies":[{"poster":"legofreak1","date":"2015-04-10T21:07:13.451+0000","up_votes":1,"down_votes":0,"body":"Patchnotes gelesen?\nBlitzcranks W slowt ihn jetzt selber, nachdem der aktive Effekt abgeklungen ist.","replies":[{"poster":"pulledchicken","date":"2015-04-10T21:50:10.519+0000","up_votes":1,"down_votes":0,"body":"da war ja was ... dennoch gibt es den Bug der einem zum stehen bringt !","replies":[]}]},{"poster":"pulledchicken","date":"2015-04-10T20:58:27.865+0000","up_votes":1,"down_votes":0,"body":"kann die Bärenfalle von Nida gewesen sein oder von der Cait oder doch Teemo :O ?\n\n\n\nKappa","replies":[{"poster":"Kùrby","date":"2015-04-10T21:00:55.777+0000","up_votes":1,"down_votes":0,"body":"Die einzige Nida war in meinem Team :D \nNein, war kein Champ im Spiel der/die mit traps etc slowen kann :D \n\nKappa!","replies":[{"poster":"pulledchicken","date":"2015-04-10T21:03:51.390+0000","up_votes":1,"down_votes":0,"body":"eventuell  eine Lulu die dich angeschossen hat durhc die Wand und du es nicht mitbekommen hast XD ich weis ich kann nerven :P \n\nka man müsste sich eben mal mehr Zeit nehmen für das alles","replies":[]}]}]}]}]}]},{"poster":"GagaManamanga","date":"2015-04-10T20:23:29.867+0000","up_votes":2,"down_votes":0,"body":"nicht nur du","replies":[]},{"poster":"Frôzen Throne","date":"2016-07-25T08:13:16.263+0000","up_votes":1,"down_votes":0,"body":"Hatte bis jetzt den gleichen Fehler. Habe nun folgende Einstellungen geändert und werde testen, ob es Verbesserung bewirkt hat:\n\n- Stellt deaktiviert unter \"Netzwerk und Freigabecenter\" --> \"Verbindungen\" --> \"Eigenschaften der aktuellen Internetverbindung\" --> \"deaktiviert IP 6\"\n- direkt nach dem Starten des LOL Clients --> \"Einstellungen\" (kleines Zahnrad oben rechts) --> deaktiviert \"Peer To Peer erlauben\"\n\nSollte laut Support Abhilfe für die Laggs sorgen. ;)","replies":[{"poster":"Zyten","date":"2016-07-25T08:14:58.333+0000","up_votes":1,"down_votes":0,"body":"Du hast grade einen ein Jahr alten Thread ausgegraben, bei dem vor 9 Monaten das letzte Mal geantwortet wurde ^^'","replies":[{"poster":"Frôzen Throne","date":"2016-07-25T08:58:02.328+0000","up_votes":1,"down_votes":0,"body":"Das macht ja nichts. Ich selbst habe das Problem trotz der Einstellungen immer noch. Seitdem wir von Telekom zu Kabel Deutschland gewechselt sind... schade eigentlich. =/","replies":[{"poster":"Zyten","date":"2016-07-25T09:05:18.993+0000","up_votes":1,"down_votes":0,"body":"Vielleicht liegt das Problem auch bei Kabel Deutschland selbst. \nEs gab zeitweise ja auch mal extreme Probleme bei Verbindungen mit Unitymedia. Dort hatte ich dann ähnliche Probleme. So lange aber weder Kabel Deutschland noch Riot da was zu sagt, kann man nur spekulieren.","replies":[]}]}]}]},{"poster":"banshee1988","date":"2015-10-22T14:42:35.584+0000","up_votes":1,"down_votes":0,"body":"Habe den Bug auch und es ist definitiv kein DC sonst könnte ich nicht alles andere sich ganz normal weiter bewegen sehen. Meine Maus kann ich während dessen auch ganz normal bewegen, nur passiert dann halt leider nicht, wenn ich mit dem Champion irgendwo hin gehen will.","replies":[]},{"poster":"Vn Quan","date":"2015-06-24T17:33:36.987+0000","up_votes":1,"down_votes":1,"body":"ich hatte auch dieses Problem. und ich habe auch internet bei Kabel Deutschland benutzt :((. Wie kann ich dieses Problem loesen?","replies":[{"poster":"NΟT NEEKΟ","date":"2015-06-24T17:45:31.457+0000","up_votes":1,"down_votes":0,"body":"Aktuell garnicht. Es gibt im Moment keine Lösung. Die einzige Lösung die zu wirken scheint ist IPv6 auf IPv4 umzustellen, aber sowas wird normal nur in Ausnahmen gemacht. Ich rufe mittlerweile zum 3. mal an, aber sagen mir immer das gleiche.","replies":[]}]},{"poster":"NΟT NEEKΟ","date":"2015-06-21T21:50:19.741+0000","up_votes":1,"down_votes":0,"body":"Das Problem betrifft sehr viele im Moment. Es betrifft interessanterweise meines Wissens nach nur deutsche Spieler. \nZufällig bei Kabel Deutschland? Das scheint für viele nämlich ein Problem zu sein. Wenn du im Hilfe Forum schaust, solltest du den Forenbeitrag dazu finden. \n\nLG\nLuc","replies":[{"poster":"Ghost I WarZz","date":"2015-06-22T18:54:58.865+0000","up_votes":1,"down_votes":0,"body":"Ja ich habe Kabel Deutschland. Leider","replies":[{"poster":"Ghost I WarZz","date":"2015-06-22T18:55:38.913+0000","up_votes":1,"down_votes":0,"body":"das krasse ist ich habs vor 2 monaten gepostet. Rate mal. Genau heute hatte ich bei 4 games dasselbe problem","replies":[]}]}]},{"poster":"eZarox","date":"2015-06-21T21:41:58.954+0000","up_votes":1,"down_votes":0,"body":"Hab auch diesen Bug, kann nix casten oder mich bewegen. Muss immer erst Reconnecten.","replies":[]},{"poster":"pulledchicken","date":"2015-04-10T20:28:17.088+0000","up_votes":1,"down_votes":0,"body":"Diesen Bug haben einige aus meinem Freundeskreis auch , sogar ich besitze ihn ab und zu ....\n\nIch habe auch schonmal ein Thema dies bezüglich auf gemacht doch leider ohne erfolg auf eine Lösung .....","replies":[{"poster":"Ghost I WarZz","date":"2015-04-10T20:32:45.469+0000","up_votes":1,"down_votes":0,"body":"ALSO hast du diesen bug auch immernoch?","replies":[{"poster":"pulledchicken","date":"2015-04-10T20:38:19.193+0000","up_votes":1,"down_votes":0,"body":"yep und nicht nur ich andere auch ....\n\nhatte mal ein Game mit Riven und wollte nen bard tower diven der dann aber weg lief und ich auf einmal bewegungsunfähig war sodass ich vom tower gekilled wurde wo sogar er gesagt hat das es ihm leid tue und es nicht versteht ....\n\ngleiche hatte ich mal mit Yasuo wo ich auf einmal nur noch stehen geblieben bin .... und und und","replies":[{"poster":"Ghost I WarZz","date":"2015-04-10T20:40:14.728+0000","up_votes":1,"down_votes":0,"body":"Ich habe grade ein game am laufen und das ist nun das 5. wo ich mittendrinn fpr 5 minuten stehen bleibe","replies":[{"poster":"pulledchicken","date":"2015-04-10T20:43:15.338+0000","up_votes":1,"down_votes":0,"body":"ja aber Riot juckt es leider nicht ...... keine ahnung genauso wie man mit Nautilus über die Map rutschen kann oder Yasuo's W verbuggt ist","replies":[{"poster":"Ghost I WarZz","date":"2015-04-10T20:45:54.790+0000","up_votes":1,"down_votes":0,"body":"Also du hast auch keinen schimmer was zu tuhen ist?  :(","replies":[{"poster":"pulledchicken","date":"2015-04-10T20:48:05.835+0000","up_votes":1,"down_votes":0,"body":"doch ! Riot müsste Patchen !","replies":[]}]}]}]}]}]}]}]}