{"poster":"xXNERBXx","date":"2015-10-07T17:13:44.460+0000","title":"Elo","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":4,"body":"Hei leute\r\n\r\nIch bin momentan silber und ich Kann nicht aufsteigen ich bin eigentlich auf der Land sehr solide ich feede nicht und ja farme okey ich wollte euch fragen mit welchen Champs auf jeder Land ein paar es einfacher ist elo zu steigen oder Beispiele von Pros. Oder so danke viel mal","replies":[{"poster":"xXNERBXx","date":"2015-10-08T16:30:08.101+0000","up_votes":1,"down_votes":1,"body":"Ich will aber keine Champs wie Annie gären Master ich will was was nicht jeder kann","replies":[{"poster":"Powerjen","date":"2015-10-12T14:26:43.666+0000","up_votes":1,"down_votes":0,"body":"Garen und Yi kann ich nicht und Annie nur ein wenig. Passt schon.","replies":[]},{"poster":"OrangeBubble","date":"2015-10-08T16:58:33.581+0000","up_votes":1,"down_votes":0,"body":"Dann spiel Azir ~","replies":[]}]},{"poster":"Skagerak","date":"2015-10-08T15:53:29.061+0000","up_votes":1,"down_votes":0,"body":"Du musst selber entscheiden welchen Champion du spielst schaffen kann man es mit allen.","replies":[]},{"poster":"OrangeBubble","date":"2015-10-08T09:36:19.694+0000","up_votes":1,"down_votes":0,"body":"Nimm einen Champ der einfach zu lernen ist, aber viel Einfluss hat?\nBeispielsweise Annie? Simpel zu spielen, hat aber viel Einfluss dank ihrer Passiven + Ult.","replies":[]},{"poster":"xXNERBXx","date":"2015-10-07T18:09:55.610+0000","up_votes":1,"down_votes":1,"body":"Also glaubst du ich schaffe mit Cassio Viktor fitz in Platin?","replies":[{"poster":"Skagerak","date":"2015-10-07T19:11:22.382+0000","up_votes":1,"down_votes":0,"body":"Ehm ka :D du bist erst S5 setz dir doch lieber erst mal das Ziel Gold danach kann man weiter schauen es wird auch etwas dauern bis du ausfsteigst diese Season wirst du wohl noch in Silber sein was du nächste Season erreichst liegt an dir.","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2015-10-07T17:48:38.043+0000","up_votes":1,"down_votes":0,"body":"Beispiele von Pros sind immer mit Vorsicht zu genießen... die empfehlen dir Azir... weil sie den halt können.\n\nDas wichtigste an der Stelle ist: Picke einfache Champions. Stumpf ist Trumpf. Und übe Champions die Flexibel sind... also am einfachsten...Annie. Ein extrem einfaches und trotzdem nützliches Kit. Die \"Skillshots\" werden instant gecastet. Und die kannst sie auf Support, Mitte und notfalls Top spielen.\n\nIm Gegensatz dazu hat ein Azir unfassbar viele Möglichkeiten... aber kaum jemand in unserer Elo kann diese wirklich effektiv ausnutzen. \n\nMeine Empfehlung lautet also:\nADC: Caitlyn. Hohe Reichweite plus Escape= Sicherer Carry.\nSupport und Mid: Annie. \nJungle: Warwick.\nToplane: Mokai.\n\nSuche dir 2 dieser Champions raus. Über sie ein paar mal in Normals. Und dann picke sie jedes Mal, wenn du kannst. Dann wirst du auch recht schnell die Kurve kriegen.","replies":[]},{"poster":"Skagerak","date":"2015-10-07T17:33:00.881+0000","up_votes":1,"down_votes":0,"body":"Man kann mit jedem Champion aufsteigen dein  Problem ist eher das du jeden Champion einmal gespielt hast und keinen main hast. Mit Tristana bist du eigentlich ganz solide versuche sie mehr zu spielen dann wirst du schneller aufsteigen.  Wenn du dich im Farmen verbessern willst geh einfach in ein freies Spiel und versuche in 10 min 100 Farm zu bekommen. Wenn du das schaffst hol dir einfach dann einen bot als Gegner. Am besten ist es du schaust dir mal deine History an und suchst dir die Champions aus mit denen du die höchste Win quote /Kda hast.","replies":[]},{"poster":"giselaschlachter","date":"2016-12-11T21:10:42.761+0000","up_votes":1,"down_votes":3,"body":"Das einzige was ihr dürft ist \"euch der Meta anzupassen!!!\" (Zitat Riot würde ich sagen, nachdem auch noch Leute wie der 2,9Mio singed gebannt wurden, den wir mitlerweile alle nach dem Skandal kennen)\nDas System an sich wird meiner Meinung nach schlechter anstatt besser ... von der Champion-balance ganz zu schweigen wo anscheinend buffs und debuffs gewürfelt werden. \n\nAuf meinem Main war ich vor 2 Jahren Silber 2 und bin jetzt Bronze 5 das zweite mal in Folge.... \nDas einzige was sich geändert hat ist meine Spielerfahrung von mitlerweile ca.3000 Spielen+,  was glaube ich alles sagt. \n\nWenn hier jemand auf die Idee Kommt mal alle Champions zu spielen kann er sich das sofort au dem Kopf schlagen vorallem auf niedriger Elo wo keiner in der Lage ist MITDEMANDEREN ZU SPIELEN...\n\nIch würde sagen Riot sollte Rankeds erst nach sowas wie Level 50 oder einfach 500 Spielen erlauben da die Leute wenigstens nciht komplett auf den Kopf gefallen sind.\n\nSolange ich ein Game nicht einfach alleine carrien kann, durch einen beliebigen Champion was hier irgenwie unmöglich scheint, weil man ja permanent alles ändern muss nur nicht die Spielbalance werde ich ab sofort auf meinem Main zum Spaß feeden un reporten... weil das zusätzlich zu Riots inkompetenz auch noch die anderen Leute hier in der community machen. \n\nViele Grüße an alle die das Lesen.... und wenn ihr mal einen richtigen Spieler sehen wollt schaut euch Tyler 1 an, denn er hat Recht mit dem was er tut... mir gehts genauso .... wenn ich schonwieder einen Aatrox instalock im Team habe {{champion:266}} \n\nLeague of Legends wird dann jetzt nach 100 Games (in Folge mit 3 wins 3 Loses) keinem mehr empfohlen sondern mit Balnceproblemen verbreitet!{{sticker:slayer-jinx-catface}} \n\n\nAls Tipp and Riot .... wenn dan richtig:\nVerbietet doch einfach bspw. Teemo für Leute die als Support in das Team kommen","replies":[{"poster":"Sirrkas","date":"2016-12-11T22:07:21.568+0000","up_votes":1,"down_votes":0,"body":"Erst einmal, du hast gerade einen 1 Jahr alten Thread ausgegraben, warum tust du das?\n\n>Das einzige was ihr dürft ist \"euch der Meta anzupassen!!!\" (Zitat Riot würde ich sagen, nachdem auch noch Leute wie der 2,9Mio singed gebannt wurden, den wir mitlerweile alle nach dem Skandal kennen)\n\nDer Singed wurde nicht dafür gebannt, dass er non-meta spielt. Er wurde dafür gebannt, dass er auf Teufel komm raus seine Taktik aufzwingen wollte. Er hat immer ADC/Support gewählt und seinen Lanepartner alleine gelassen, egal ob er oder das Team damit einverstanden waren oder nicht. Du würdest dich sicher auch darüber aufregen, wenn dein Support einfach Doublemid spielt, statt Support und den Farm für sich beansprucht. \n\nIch werde hier auch nicht weiter darüber reden, dazu gibt es schon genug Threads.\n\n>Auf meinem Main war ich vor 2 Jahren Silber 2 und bin jetzt Bronze 5 das zweite mal in Folge....\nDas einzige was sich geändert hat ist meine Spielerfahrung von mitlerweile ca.3000 Spielen+, was glaube ich alles sagt.\n\nDie 3000 Spiele sagen nichts. Ich habe auch schon jemanden gesehen, der Bronze 5 mit 0 LP und 2000 Rankedsiegen in der Mitte der Season war. Die Anzahl der Spiele hat nichts mit dem Können zu tun.\n\n>Ich würde sagen Riot sollte Rankeds erst nach sowas wie Level 50 oder einfach 500 Spielen erlauben da die Leute wenigstens nciht komplett auf den Kopf gefallen sind.\n\nDas macht keinen Unterschied. Dann kommen die \"auf den Kopf Gefallenen\" lediglich später ins Ranked. Das verschiebt dein eingebildetes Problem nur und löst es nicht. \n\n>Viele Grüße an alle die das Lesen.... und wenn ihr mal einen richtigen Spieler sehen wollt schaut euch Tyler 1 an, denn er hat Recht mit dem was er tut... \n\nDa du einen der toxischsten LoL-Spieler als Vorbild nennst, kann ich nur hoffen, dass du kein LoL mehr spielst. Sein Verhalten war einfach untragbar, sonst hätte Riot keinen Lifetimebann ausgesprochen.\n\n>wenn ich schonwieder einen Aatrox instalock im Team habe\n\nDu beschwerst dich also erst darüber, dass man nur Meta spielen darf, jammerst aber dann darüber, dass jemand einen Champion wählt, den du nicht im Team haben willst? Dir ist hoffentlich klar, dass dich nach solch einem Fauxpas keiner mehr ernst nehmen wird.","replies":[]}]},{"poster":"xXNERBXx","date":"2015-10-07T20:10:04.984+0000","up_votes":1,"down_votes":1,"body":"Ne istant Challenger ich wollte nur fragen ob du denkst das ich es mit Cassio schaffen könnte oder denkst mit Viktor fitz bessere chance","replies":[]}]}