{"poster":"xXNERBXx","date":"2016-09-18T07:52:54.862+0000","title":"chamionpool (midlane)","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"hallo zusammen \r\n\r\nich mache gerade mein championpool und bin auf diese champs gestossen dif mur gefallen. \r\n\r\nahri anivia brand cassio corki diana ekko fizz kassa kata kennen lux ryze syndra veigar vel koz xerath sona\r\n\r\nIch will ein championpool von 6-8 champs welche w&uuml;rdet ihr mir empfehlen\r\n\r\ndanke viel mal","replies":[{"poster":"Shadowscreen","date":"2016-09-20T11:59:43.240+0000","up_votes":1,"down_votes":0,"body":"Ahri\nAnivia\nCassio\nKassa/Ekko\nLux\nVelkoz\n\nDa hast du meiner Meinung nach ne gute Mischung aus starken Champs","replies":[]},{"poster":"Awsane","date":"2016-09-18T08:59:23.211+0000","up_votes":1,"down_votes":0,"body":"Willst du damit ranked spielen und aufsteigen?\noder willst du spass in normals haben?\n\ndas macht für die auswahl irgendwie nen unterschied, weil im ranked wärst du wesentlich eingeschränkter und meine vorschläge wären anders\nals wenn du normals zum spass spielen willst","replies":[{"poster":"xXNERBXx","date":"2016-09-18T09:55:47.406+0000","up_votes":1,"down_votes":1,"body":"ranked um mich zu verbessern","replies":[{"poster":"Awsane","date":"2016-09-18T10:19:01.756+0000","up_votes":1,"down_votes":0,"body":"Also spiel das, woran du Spass hast und erfolgreich bist\n\nich würde sonst Annie Vorschlagen zu mainen\nund Lux und einen der Assassins als ausweich picks, damit bist du recht gut aufgestellt, \nwobei deine ahri/Leeblanc/syndra auch gar nicht schlecht aussehen von den stats her, die sind zwar deutlich schwerer zu spielen und daher würde ich diese picks niemanden vorschlagen der im casual bereich aufsteigen will, aber wenn sie dir spass machen und du erfolgreich mit ihnen bist spiel sie\n\nLG Awsane","replies":[]}]}]},{"poster":"xBlitzlichTx","date":"2016-09-18T08:16:31.377+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nAlso ich würde alle Champions die dir gefallen ein paar Spiele spielen und dann entscheiden welcher dir am meisten Spaß gemacht hat.\n\nIch denke 6-8 Champion ist schon sehr viel und man kann dann erst nach sehr sehr langer Zeit alle richtig gut. Ich würde mich eher auf 2-3 Champions beschränken und diese lernen. Wenn man diese Champions dann kann, kann man seinen Championpool immer mal wieder um den einen oder anderen Champion erweitern.\n\nDer Vorteil weniger Champs zu spielen ist auch, dass man dann schneller eine größere Anzahl an Matchups spielen wird. Man hat also Erfahrung mit dem Champion gegen eine Vielzahl anderer Champs auf der Lane die man spielt.\n\nViele Champs spielen zu können ist natürlich auch von Vorteil, da man sich dann dem eigenen Team oder dem Gegnerteam anpassen kann (z.B. mehr CC, mehr Tanks, mehr AD/AP Schaden.)\n\nBei mir persönlich war es bisher immer so, dass ich nie aktiv meinen Championpool erstellt habe. Ich habe einfach immer gespielt und dann hat mir der ein oder andere Champion besser gefallen sodass ich diesen mehr und mehr gespielt habe. Schlussendlich war dies für mich die erfolgreichste Taktik um Champions zu finden mit denen ich aufsteigen kann.","replies":[{"poster":"xXNERBXx","date":"2016-09-18T09:57:09.827+0000","up_votes":1,"down_votes":1,"body":"zb im ranked 2-3 und in normals die anderen 3-4","replies":[]},{"poster":"xXNERBXx","date":"2016-09-18T09:56:26.334+0000","up_votes":1,"down_votes":1,"body":"ja kann ich verstehen aber 6 champs und dann spuele ich nicht alle glich viel aber einfach 6 um mich zu verbessern","replies":[]}]},{"poster":"Zovers","date":"2016-09-20T11:50:51.741+0000","up_votes":1,"down_votes":1,"body":"{{champion:112}}","replies":[]},{"poster":"xXNERBXx","date":"2016-09-18T09:55:25.637+0000","up_votes":1,"down_votes":1,"body":"ja es ist für ranked um mich zu verbessern (als spieler)\ndas spiel macht mir spass nicht der champ ich will einfach besser werden","replies":[]}]}