{"poster":"neo45lol","date":"2017-05-17T13:33:35.118+0000","title":"Graves o Gragas???","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Soy nivel 30 y ya llevo tiempo en la jungla y he pensado comprarme a alguno de estos dos campeones y quiero que me ayuden a elegir.Ya lo tenia casi decidido pero vi el nerfeo a graves de la 7.10 y me lo pense.Si hay otro jungla que me querais recomendar se agradece =)","replies":[{"poster":"neo45lol","date":"2017-05-17T16:37:07.601+0000","up_votes":1,"down_votes":0,"body":"Voten que asi me queda mas claro.Pero por favor no voten otro","replies":[]},{"poster":"Un Alma Más","date":"2017-05-17T14:05:25.124+0000","up_votes":1,"down_votes":0,"body":"de hecho Graves full ad ahora pega mas que antes, es un balance no un nerf.","replies":[{"poster":"neo45lol","date":"2017-05-17T14:13:14.123+0000","up_votes":1,"down_votes":0,"body":"Es decir que es un nerf al early de graves pero un buff a su late???","replies":[{"poster":"9081913DEL1","date":"2017-05-17T14:27:08.138+0000","up_votes":1,"down_votes":0,"body":"Fin del Trayecto\nDAÑO BÁSICO DE LA Q1 55/70/85/100/115 ⇒ 40/55/70/85/100\nTASA DE LA Q1 0,75 de daño de ataque adicional ⇒ 0,8 de daño de ataque adicional\nDAÑO BÁSICO DE LA Q2 80/125/170/215/260 ⇒ 80/110/140/170/200\nTASA DE LA Q2 0,4/0,6/0.8/1,0/1,2 de bonificación de daño de ataque ⇒ 0,4/0,7/1,0/1,3/1,6 de bonificación de daño de ataque\nR: Daño Colateral\nENFRIAMIENTO 100/90/80 segundos ⇒ 120/100/80 segundos","replies":[{"poster":"neo45lol","date":"2017-05-17T14:40:20.718+0000","up_votes":1,"down_votes":0,"body":"Si lo vi pero es que entonces escala mas por eso lo dije","replies":[]}]}]}]},{"poster":"Diegotg2","date":"2017-05-17T14:06:08.792+0000","up_votes":1,"down_votes":0,"body":"Depende de tu estilo de juego en la jungla,hay un mundo de diferencia entre esos dos campeones, a mi por ejemplo me gusta ser mas utility\n\njunglas utility que estan fuertes:\n\n{{champion:20}}, excelente jungla clear, sustain se arma tank, puede llegar a hacer un dragon a level 3, gankear con nunu requiere un poco mas de practica, no es un campeon que haga daño, si no que tiene su E para ralentizar y su W para aumnetar velocidad de ataque y movimiento\n\n{{champion:427}}, excelente jungla clear, es el jungla con mayor win rate tiene CC, y se arma casi como un supp healer\n\nSi te gustan los offtanks en la jungla:\n\n{{champion:59}} {{champion:5}} {{champion:24}} {{champion:102}} \n\nPersonalmente de estos  yo te recomiendo que compres a sejuani vale 4800, esta bastante poderosa y es completa , tiene CC, buen daño, se tanquea, su jungla clear no esta mal y gankear con ella no es complicado\n\nY si te gustan los carrys en la jungla:\n\n{{champion:107}} {{champion:121}} {{champion:11}} {{champion:104}} {{champion:203}} , de estos yo te recomiendo a {{champion:35}} ,\n\nen mi opinion si preguntas por la dificultad de los champs en general los carrys son mas complicados y los utilitys mas simples\n\nAhora entre {{champion:79}} {{champion:104}}  \n\njungla clear - es mejor el de graves\nDificultad -  mas dificil graves\nGank - es mas facil el de gragas y mas efectivo, el combo Flash - E it's super effective\nCC - gragas gana por mucho\nMovilidad - andan mas o menos igual, diria que es mejor la de gragas\nDaño - obviamente mejor graves\nCapacidad de recuperarse si empezaste mal - mejor gragas\nSe ajusta a mas composiciones de campeones - gragas, si ves que no hay tank en tu equipo y eres ultimo pick si sacas graves eres un mongolico\n\nPD: si quieres ver estadisticas mira champion.gg aunque ojo esas son de high elo, low elo es otro mundo pero aun asi algo te dicen\n\n","replies":[{"poster":"neo45lol","date":"2017-05-17T14:15:42.489+0000","up_votes":1,"down_votes":0,"body":"A shaco lo tengo y es mi main actual y a nunu y ivern los probe y no me interesan ya que para jugar un jungla soporte te pillas un suport y ya.En cambio sejuani no me llama la atencion aunque sepa que este rota","replies":[{"poster":"Diegotg2","date":"2017-05-17T14:24:04.842+0000","up_votes":1,"down_votes":0,"body":"probaste a {{champion:64}}  ?","replies":[{"poster":"neo45lol","date":"2017-05-17T14:39:36.315+0000","up_votes":1,"down_votes":0,"body":"Si y no me gusto÷(","replies":[]}]}]}]},{"poster":"neo45lol","date":"2017-05-17T14:21:12.657+0000","up_votes":1,"down_votes":0,"body":"Y una pregunta mas:\nVeis a graves muy mal en el parche por el nerf de la 7.9 o sigue estando bien o esta op(en mi opinion no esta op ni en broma)","replies":[]},{"poster":"FedecarboneroUY","date":"2017-05-17T14:17:49.664+0000","up_votes":1,"down_votes":0,"body":"{{champion:79}} : \n\n-primer despeje de la jg pésimo\n- buena itemización (como carajos se escribe xD) pero en early - mid game le falta mucha vida\n- muchísimo cc, y daño en área\n- muy buen zoneo\n- en mid game/late tiene un despeje de la jg bastante bueno\n- buenísimo haciendo peel, es muy útil\n- si no te armas algo de ap no pega nada de mid game en adelante\n- no tanquea tanto como parece o debería, su pasiva y w tienen ese fin, pero contra campeones que peguen de \"verdad\" ({{champion:63}} {{champion:41}} {{champion:222}} {{champion:96}} {{champion:67}} ,etc) te quedas muy corto, no es el {{champion:79}} de la s5 xD\n\n{{champion:104}} : \n\n- buen despeje de la jungla durante toda la partida (buenísimo)\n- 1vs1 buenísimo, no sé ahora con los nerfs (ojo)\n- carece de utilidad para las tf, solo tiene la W, aún así aporta mucho daño, y en área\n- gankeos un poco flojos, si llegás bien al gankeo lo haces muy bien, y en los countergankeos es buenísimo, pero el gankeo en si no es tan bueno como el de otros junglas","replies":[]},{"poster":"Chisolino","date":"2017-05-17T13:36:44.941+0000","up_votes":1,"down_votes":0,"body":"{{champion:80}} {{champion:19}} Estos 2 me sirvieron para subir en soloQ, y voy por el mismo camino en flex, aunque me cuesta un poco mas (wtf)","replies":[{"poster":"neo45lol","date":"2017-05-17T13:41:51.389+0000","up_votes":1,"down_votes":0,"body":"Ya los probe y no me interesan demasiado.Aun asi gracias","replies":[]}]},{"poster":"9081913DEL1","date":"2017-05-17T13:41:25.835+0000","up_votes":1,"down_votes":0,"body":"Gragas es un pick mas solido, porque tiene su ult para desarmar un engaje. Ademas al ser semitank podes darle mas aire al carry. \n\nGraves es mas divertido de jugar pero es basicamente otro carry. En mi experiencia me conviene mas gragas, pero por soloq, depende de como lo vayas a jugar. Ya que es inutil usar un campeon fuerte si no podes coordinar con nadie.\n\nSi queres tomar objetivos graves es mejor, pero para trabajar en conjunto me gusta mas gragas. por el zoneo y la ult.\n\nSaludos.","replies":[]}]}