{"poster":"FH Keltic","date":"2014-12-21T03:01:45.647+0000","title":"Yes plz.","subforum":"Gameplay","up_votes":1721,"down_votes":103,"body":"The picture says it all. And there is no logical argument not to implement this into the LoL ranked system.","replies":[{"poster":"Derako","date":"2014-12-21T05:03:35.869+0000","up_votes":109,"down_votes":51,"body":"Rito said that this would be abused by people who would bitch out their teammates into quitting.","replies":[{"poster":"Prometheus856","date":"2014-12-21T19:54:58.755+0000","up_votes":323,"down_votes":23,"body":"everything can be abused by anyone. If you're too afraid of change, you'll never make any progress.","replies":[{"poster":"iLuv Dongs","date":"2014-12-21T22:52:28.231+0000","up_votes":63,"down_votes":5,"body":"Which is why the core game is almost the same as it was 5 years ago.\n\nThere's so many replay programs out there, they're so easy to make yet there's still no replay system in league. Also abusable?","replies":[]}]},{"poster":"LeeDark","date":"2014-12-22T09:56:10.507+0000","up_votes":45,"down_votes":2,"body":"I have never left a game because people were being abusive to me.  If I left, I wouldn't get to report them at the end of the game.  How about, instead of nixing good ideas because of a minority of players who might abuse them, Riot does a better job of rooting them out and banning them?  These chat restrictions are light slaps on the wrist.","replies":[]},{"poster":"Saevum","date":"2014-12-21T05:27:51.202+0000","up_votes":28,"down_votes":9,"body":"> Rito said that this would be abused by people who would bitch out their teammates into quitting.\n\nI can see that too. Some blatant punks can make a kind hearted/newcomer player (kiddo) to do something like quitting (they may regret later) without knowing it may be severely punished. There are also \"down-talkers\" who may abuse feeble minded/low auto-esteem players making them quit (cause they seem to know who) and then, proceed to accomplish the evil deed (and maybe another guy \"reads between lines\" what does the down-talker tries to accomplish) and he/they may join up the down-talking. World out there is evil. I agree with Riot this time. Its a sincere call. Gj Rito, you show hope (and i usually do not flatter Rito. This is my first time actually).","replies":[]},{"poster":"Junkο","date":"2014-12-22T13:11:31.410+0000","up_votes":7,"down_votes":1,"body":"How exactly? The enemy team decides if you get mercy or not. Not to mention people bitch at other people to leave already.","replies":[]},{"poster":"ColdSteeler","date":"2014-12-21T22:50:48.913+0000","up_votes":6,"down_votes":1,"body":"probably that's why it needs to be a vote","replies":[]}]},{"poster":"Alljoy","date":"2014-12-21T03:03:49.258+0000","up_votes":23,"down_votes":179,"body":"But people can still be dicks and click, 'no'.","replies":[{"poster":"SOS Tsubaki","date":"2014-12-21T03:05:26.604+0000","up_votes":139,"down_votes":2,"body":"> [{quoted}](name=Ginnjii,realm=NA,application-id=3ErqAdtq,discussion-id=I1AEkXGZ,comment-id=0000,timestamp=2014-12-21T03:03:49.258+0000)\n>\n> But people can still be dicks and click, 'no'.\n\nP.S. But it works for the people who aren't dicks. Morale of the story: Don't piss the enemy team off.","replies":[{"poster":"Alljoy","date":"2014-12-21T03:08:35.751+0000","up_votes":11,"down_votes":64,"body":"The problem with that moral is that people have the rather unfortunate predilection to being unpleasant dicks regardless.","replies":[{"poster":"Delioth","date":"2014-12-21T05:38:32.302+0000","up_votes":10,"down_votes":1,"body":"> The problem with that moral is that people have the rather unfortunate predilection to being unpleasant dicks regardless.\n\nWhen asked to do something over and above what they must do. However, when given a direct choice that they have to make one way or another, many will choose to be nice. Especially when they're pleased due to a win.","replies":[{"poster":"Wheatloaf","date":"2014-12-21T05:55:09.652+0000","up_votes":19,"down_votes":0,"body":"I am usually not at all pleased to win with an enemy AFK.","replies":[{"poster":"Mistress Madoka","date":"2014-12-21T18:37:48.559+0000","up_votes":17,"down_votes":0,"body":"I personally Find it Boring, but I also Sympathize with the enemy team.\n\n\nUnless they're being assholes about it. Then all bets are off.","replies":[{"poster":"Poke Bot","date":"2014-12-22T22:24:22.842+0000","up_votes":4,"down_votes":1,"body":"Unfortunately people are rarely as sportsmanlike as you would like it. There really would be a great deal of players who would click no, and it would feel even worse to be denied mercy in addition to losing unfairly. This could seriously increase the hostility between the teams, and I wouldn't want it.\n\nI would like for there to be features to combat AFK, but not in a way that would give players the power to be even more of an asshole to the enemy team.","replies":[]}]}]},{"poster":"Solaxo","date":"2014-12-21T10:32:43.329+0000","up_votes":1,"down_votes":20,"body":"> [{quoted}](name=Delioth,realm=NA,application-id=3ErqAdtq,discussion-id=I1AEkXGZ,comment-id=0000000000000000,timestamp=2014-12-21T05:38:32.302+0000)\n>\n> When asked to do something over and above what they must do. However, when given a direct choice that they have to make one way or another, many will choose to be nice. Especially when they're pleased due to a win.\n\nHow do you know that? Are you a psychologist?","replies":[{"poster":"Verandure","date":"2014-12-21T10:43:20.843+0000","up_votes":22,"down_votes":0,"body":"Depends on if they're a Locke or a Hobbes kinda person (They appear to be aligned with Locke).","replies":[{"poster":"Bismuthinite","date":"2014-12-21T10:47:25.600+0000","up_votes":18,"down_votes":1,"body":"I never expected to read something like that on the internet.","replies":[{"poster":"Yandere Carry","date":"2015-02-20T03:01:53.240+0000","up_votes":3,"down_votes":0,"body":"I did... On a website dedicated to John Locke and Thomas Hobbes.\n\nI disagree with this idea.","replies":[]}]}]}]}]}]}]}]},{"poster":"Saevum","date":"2014-12-21T03:56:34.168+0000","up_votes":51,"down_votes":8,"body":"Still somewhat exploitable in duo queue.\n\n**Fictional** context: \n\nL. Van Pelt: *\"oh man! we are going to lose Charlie!\"*\n\nCharlie: *\"I cant lose this way! im in my promos for the next league!\"*\n\nL. Van Pelt: *\"Hey! i could get out of the game and, that way, they may show us mercy!\"*\n\nCharlie: *\"Oh and, that way, i can try again next game! but, you'll do that for me?\"*\n\nL. Van Pelt: *\"Sure. Besides, this is an alternate account, not my main\".*","replies":[{"poster":"DeynaTaggerung","date":"2014-12-21T04:06:28.745+0000","up_votes":46,"down_votes":5,"body":"But then the opposing team will see he only afk'd after they were already going to lose. They probably wouldn't show mercy. Mercy would only be for teams that really did well for having a 4v5 for a majority of the game (oh the system could be set up so it only shows up if the person dc'd for 20 minutes or more of the game. There, problem solved)","replies":[{"poster":"SOS Tsubaki","date":"2014-12-21T04:09:56.374+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=DeynaTaggerung,realm=NA,application-id=3ErqAdtq,discussion-id=I1AEkXGZ,comment-id=00070001,timestamp=2014-12-21T04:06:28.745+0000)\n>\n> But then the opposing team will see he only afk'd after they were already going to lose. They probably wouldn't show mercy. Mercy would only be for teams that really did well for having a 4v5 for a majority of the game (oh the system could be set up so it only shows up if the person dc'd for 20 minutes or more of the game. There, problem solved)\n\nAgain, fix the exploit. If X left for X amount of time, team X shall be granted the option of mercy. All that would be needed is to figure out what X amount of time would be reasonable. ","replies":[{"poster":"Delioth","date":"2014-12-21T05:46:49.679+0000","up_votes":4,"down_votes":1,"body":"I'd say 15% or more of a game would be acceptable for being long enough to allow. In a 20 minute game, that adds up to three minutes or more, and a 40 minute game it's 6 minutes.\n\nMaybe something where it's a fixed time + % of game time. Like 2 minutes + 10% of game time (Going up by 1% for every 2 minutes past 20 or something.) This would be leaving at 16 minutes for a 20 minute game (Or giving 4 minutes of gametime to reconnect. However, a game with a late start often ends up being much longer, IME) As it goes up, a 40 minute game would require 2 mins+(10+(20/2=10)=20%=)8 mins= 10 minutes of game time to allow a mercy.","replies":[]}]}]},{"poster":"Vaysum","date":"2014-12-22T01:48:19.502+0000","up_votes":16,"down_votes":1,"body":"Man, what a hero, that L Van Pelt.","replies":[]}]},{"poster":"BloodDelmar","date":"2014-12-21T03:46:56.235+0000","up_votes":66,"down_votes":28,"body":"Why would I want to show mercy during a ranked game, when the next 5 I could have an afk'er on my team and not get any mercy?\n\nRiot needs to do the following, in this order:\n\n1. FIX THE FKN SERVERS. 5 years a BILLION DOLLAR COMPANY still has unstable servers and no East Coast servers. \n2. Ranked game ping meters, in CHAMP SELECT. So I don't have to wait until mid lane feeds to hear, \"400 ping WTF\"\n\nBut Riot doesn't give a sh!t. LCS or nothing.","replies":[{"poster":"Rinky Dinky","date":"2014-12-21T04:51:36.057+0000","up_votes":15,"down_votes":4,"body":"That doesn't make any sense. There would be no reason for you to not show Mercy, unless you were a dick, or the enemy team was a team of ****'s \n\nLets say the enemy team has an afk, and the toplane Riven flames the entire game about how she is God and she could carry if they didnt have an afk. No mercy would be given by me.\n\nIf the enemy team was \"Graceful in defeat\" however, show them mercy, and feel the power of smiley faces and dead teemo's. \n\nNo reason not too, you lose nothing.","replies":[{"poster":"BloodDelmar","date":"2014-12-21T05:26:04.337+0000","up_votes":3,"down_votes":13,"body":"> [{quoted}](name=Cameron2325,realm=NA,application-id=3ErqAdtq,discussion-id=I1AEkXGZ,comment-id=00040000,timestamp=2014-12-21T04:51:36.057+0000)\n\n> No reason not too, you lose nothing.\n\nExcept for however long the game took to queue, select champs, play, plus the LP you wouldn't get, because in order to show mercy, you'd have to lose some of your winning LP...\n\nSeems to me EVERY game would have someone leaving just so people like you will show mercy... Duo Queue sounds even more BS.","replies":[{"poster":"Rinky Dinky","date":"2014-12-21T05:34:40.043+0000","up_votes":13,"down_votes":3,"body":"You, (The winning team) do not lose any LP. Did you even read the picture captions?\n\nLets not forget that leaving a game, if this was to be installed, bigger penalties for afking would also be implemented.\n\nThe player whom afk'd will not recieve any mercy, meaning, no LP loss reduction. Furthermore, they will be banned from ranked queue's for an hour. If they afk again that day? 3 hours. Again? A 1 day restriction. etc etc.","replies":[{"poster":"BloodDelmar","date":"2014-12-21T06:11:26.899+0000","up_votes":2,"down_votes":17,"body":"> [{quoted}](name=Cameron2325,realm=NA,application-id=3ErqAdtq,discussion-id=I1AEkXGZ,comment-id=0004000000000000,timestamp=2014-12-21T05:34:40.043+0000)\n>\n> You, (The winning team) do not lose any LP. Did you even read the picture captions?\n> \n> Lets not forget that leaving a game, if this was to be installed, bigger penalties for afking would also be implemented.\n> \n> The player whom afk'd will not recieve any mercy, meaning, no LP loss reduction. Furthermore, they will be banned from ranked queue's for an hour. If they afk again that day? 3 hours. Again? A 1 day restriction. etc etc.\n\nHow is it fair that you'd get full LP while the losing team gets reduced loss of LP? It's not. You both would have to have reduced LP gains and losses.\n\nWhere do you think that LP you're basically \"gifting\" them comes from?","replies":[{"poster":"Emperor of Arima","date":"2014-12-21T07:15:01.264+0000","up_votes":10,"down_votes":0,"body":"Pretty sure that's not how LP works. It's not like in a match you're stealing the enemy's LP. Remember when the servers were in a really bad state and Riot had 'Loss Forgiven' turned on. Do you think the winning teams had 'Victory Forgiven' to prevent the winners from stealing those with Loss Forgiven's LP? lol...\n\nPersonally I think it would be better if no one gained/loss any LP for a 4v5... but then humans would abuse such a system so we don't get that. Mercy where you get to keep your LP while not having 4 ppl lose LP through no fault or shortcoming of their own is pretty good imo (but then, there will still be those abusers who force someone to quit so that they get mercy [Duo queuers especially])","replies":[{"poster":"Rinky Dinky","date":"2014-12-21T07:21:37.511+0000","up_votes":15,"down_votes":2,"body":"People are so against the idea of making solo q a more enjoyable experience. I will never understand.","replies":[]}]}]}]}]},{"poster":"SOS Tsubaki","date":"2014-12-21T05:46:25.671+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Rinky Dinky","date":"2014-12-21T05:51:28.764+0000","up_votes":5,"down_votes":0,"body":"Sorry, but I believe you misread what I typed in. \n\nIf the enemy team was #flaming in all chat, you would not give them mercy, becuase they were being rude dudes.\n\nI don't see how that makes me an idiot. I also don't see what your point is. \n\n>You're an idiot if you're going to do that. I guarantee... GUARANTEE! That you sir are guilty of saying, \"We could've had this if I didn't have an afk\".\n\nUm, yes, but at the same time, I do not flame my teamates or the enemy team, which was what I provided in my example. So Uh,  try again? :3\n\nP.S: Reading comprehension will save your life on these boards.","replies":[]}]}]}]},{"poster":"SOS Tsubaki","date":"2014-12-21T03:04:27.106+0000","up_votes":29,"down_votes":2,"body":"Beautiful! SIMPLY BEAUTIFUL! I LOVE IT! I LOVE YOU! RITO PLS MAKE THIS HAPPEN! BUMP BUMP BUMP BUMP ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^","replies":[]},{"poster":"Verandure","date":"2014-12-21T10:36:25.924+0000","up_votes":21,"down_votes":1,"body":"***To combat abuse:***\n\n* If one member of a duo queue drops, neither member is given mercy (though the extra punishments are only levied against the person that left).\n \n* Implement an algorithm looking through the chat of the game as a condition for mercy to be offered. If certain keywords are used before the DC, disallow mercy for the entire team (anything interpreted as coercion to leave; taking into account the champion that dropped and any number of phrases that could prompt somebody to leave -- just don't tell players the list of keywords.) \n\n* Make it so that Leaverbuster would have to be triggered as a condition for mercy to be offered. \n\n***To incentivize use:***\n\n* Offer a \"Merciful Opponent\" ribbon at the end-game lobby. If I read correctly; Lyte is wanting to revamp the ribbon system with the roll-out of the new Tribunal.\n\n* Have players that show mercy seeded in the Tribunal for positive review, giving more access for the TBD (to be determined) rewards offered through the new system.\n\n* Make some kind of Karma skin to commemorate the event -- maybe even make it an unlockable if you maintain a certain level of mercy throughout the season.","replies":[]},{"poster":"VeniVidiVici42","date":"2014-12-22T03:02:18.237+0000","up_votes":13,"down_votes":0,"body":"I don't think people are understanding the suggestion here... the proposed system is as follows:\n\nWhen your team has more players than the other team (e.g. 5v4, 5v3, 4v3, etc.), you may start a mercy vote. If a supermajority (3/4 or 4/5 etc.) of you elect to show mercy, then the other team gets the option to accept mercy or reject it.\n\nIf they accept mercy, the following happens:\n\n* The game immediately ends, similar to surrender\n\n* The team giving mercy gets the same rewards as if they had won normally\n\n* The team receiving mercy gets reduced (~75%) penalties (MMR/LP) and do not have promotion games counted as losses.\n\n* The AFK/DC(s) get increased (~double) penalties.\n\nIf they don't accept mercy (or you don't offer it in the first place), the game continues as it normally would. You do not have to accept mercy if, for example, you are winning the 4v5. But there is generally no good reason to not offer mercy, as all it does is accelerate your win. Now, if you want to play out the 4v5 you're perfectly welcome to, but given the odds of winning you wouldn't generally want to.\n\nTypical objections to systems that handle AFK/DC:\n\n* Actually encourages DCing in bad situations\n\nThis system most certainly doesn't encourage this. I highly doubt anyone would be willing to take double penalties to help out a few strangers, even if said strangers are in their series. \n\n* Encourages flaming in the hopes that someone doing badly will ragequit\n\nThis is a valid argument, but it's really a separate issue from properly handling AFK/DCs. Keep in mind that being granted mercy still results in a significant LP hit, so you wouldn't be trying to get mercy unless the game was seriously unwinnable. At that point, anyone who is going to be flaming in the first place would probably be flaming anyway, so I don't think there would be a significant increase in such behavior (would you really risk a ban for flaming in the hopes that your teammate might ragequit, thus saving you 4 LP?). Nonetheless it is an issue, but one that I think would be far less prevalent than the rampant AFK/DC problem there is now.\n\n* Unfairly punishes players who AFK/DC through circumstances beyond their control\n\nI don't think double penalties are particularly unfair, since if you're DCing more than once in a while that's likely more of your issue than Rito's (this has been less true over recent periods where the servers are collapsing, but even among that period I haven't permanently DCed from a game more than once every couple days). Notably, the institution of this system would allow LeaverBuster to be a bit more lenient (since there are already implicit penalties for disappearing), which would probably be a more welcome to chronic DCers than the current system (I'd sacrifice ~20 LP to get rid of my week-long ban any day). \n\n* Results in MMR/LP inflation\n\nThe losing team loses the exact same amount of LP/MMR in total under this system, so there is no inflation at all. The sole exception MAY be interactions with promotion series. I'm not 100% sure how LP/MMR works in conjunction with those, but the effect would be negligible at best. To put it into context, a single push of the \"Loss forgiven\" button probably results in more inflation than this system would produce in a year.\n\nIn short, this system may not be 100% perfect, but it is far more preferable to the current state of affairs that amount to \"life sucks, move on\". I personally don't think there's any good way to justify *not* implementing it, except obviously technical matters. Of course it shouldn't be a particularly difficult thing to program (it's basically an extension of surrendering), but \"this should be easy to program\" very often turns into a year-long project so I'll refrain from making such a statement :P","replies":[{"poster":"Verandure","date":"2014-12-22T06:01:04.513+0000","up_votes":1,"down_votes":0,"body":"This is not the system suggested. The picture clearly shows that the game has to run its full course; where the winning team, if they outnumbered the losing team, has the option to offer mercy to the opponents before being able to leave the game.","replies":[{"poster":"VeniVidiVici42","date":"2014-12-22T08:38:26.014+0000","up_votes":3,"down_votes":0,"body":"The picture demonstrates the option to show mercy after the game has concluded, which is in addition to the ability to give mercy during the course of the game. You might wish to read the actual proposal (http://forums.na.leagueoflegends.com/board/showthread.php?t=3512300) first.","replies":[{"poster":"Verandure","date":"2014-12-22T08:57:58.011+0000","up_votes":5,"down_votes":0,"body":"Apologies; there was no indication in the original post that the image was representing a fraction of a suggestion. With the  phrase \"The picture says it all...\" I had simply assumed that this was the suggestion in its entirety.","replies":[]}]}]}]},{"poster":"Maestro80","date":"2014-12-21T15:06:19.027+0000","up_votes":6,"down_votes":3,"body":"Mark my words... This post and any like it will be totaly ignored by reds.  Riot appears to be dead set on punishing people for having teammates who DC/AFK.","replies":[{"poster":"Lao Fu the Tiger","date":"2014-12-21T15:22:58.389+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Maestro80,realm=NA,application-id=3ErqAdtq,discussion-id=I1AEkXGZ,comment-id=0025,timestamp=2014-12-21T15:06:19.027+0000)\n>\n> Mark my words... This post and any like it will be totaly ignored by reds.  Riot appears to be dead set on punishing people for having teammates who DC/AFK.\n\nOn the contrary, this post was CREATED by a red before he became a red a couple years ago. I'll go look for the post.","replies":[]}]},{"poster":"atodtniasiht","date":"2014-12-22T10:11:36.236+0000","up_votes":6,"down_votes":1,"body":"13/4/17{{champion:103}} \"Okay, it may be a 2v5, but we have two of their inhibs and a 3 level advantage! all we have to do now is--\"\n\n*The enemy team has given you mercy*\n\n14/4/17{{champion:103}} \"What?\"\n\n*End of game lobby*\n\n2/8/4{{champion:17}} \"LOL  GG NOOBS EASIEST GAME EVER HAHA\"\n\n{{summoner:3}} \"Sigh.. I hate the mercy option\"","replies":[]},{"poster":"Dirgo","date":"2014-12-21T06:52:35.246+0000","up_votes":6,"down_votes":1,"body":"As much as i love this idea, they cannot do it without changing  a decent amount of other things, think it through.{{champion:74}}","replies":[]},{"poster":"TheGreatBardini","date":"2016-06-22T18:40:12.457+0000","up_votes":4,"down_votes":0,"body":"Yes please.  It wouldn't even be that hard and it would solve the problem of someone going AFK past the /remake point.","replies":[]},{"poster":"Umio","date":"2016-06-11T05:58:31.723+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=FH Keltic,realm=NA,application-id=3ErqAdtq,discussion-id=I1AEkXGZ,comment-id=,timestamp=2014-12-21T03:01:45.647+0000)\n>\n> The picture says it all. And there is no logical argument not to implement this into the LoL ranked system.\n\nup vote this","replies":[]},{"poster":"razthesummoner","date":"2014-12-21T04:37:46.161+0000","up_votes":4,"down_votes":0,"body":"Good idea but there should be some trigger for mercy to be enabled. 4v5 victories do happen and it would suck if a 5 man team gets an easy win if they are losing to a 4 man team who deserves to win.","replies":[]},{"poster":"FantasySniper","date":"2014-12-21T03:51:25.285+0000","up_votes":6,"down_votes":2,"body":"The incentive to get mercy by being honorable no matter what.\n\nRito Plz","replies":[]},{"poster":"Sichem","date":"2018-01-13T20:23:01.133+0000","up_votes":2,"down_votes":0,"body":"{{sticker:sg-janna}} \nTHIS IS NEEDED!!!\nWait, isnt that just remaking the game?","replies":[{"poster":"MagicalDemons","date":"2018-04-10T23:34:33.276+0000","up_votes":3,"down_votes":0,"body":"3 years ago we didn't have remake lol","replies":[]}]},{"poster":"IIlavalII","date":"2018-01-13T05:49:55.171+0000","up_votes":3,"down_votes":0,"body":"when ya carried team at the nexus and ur team surrendered {{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"The 2nd Horseman","date":"2016-04-17T02:21:56.418+0000","up_votes":3,"down_votes":0,"body":"I don't like the idea of people having tallies for how many mercies they give but if Riot could tell the difference between actual DCs and Rage quits then yeah sounds good. Also should add an ability for teams to request mercy because of trolls, BUT disable 3 or higher premeds from being able to pile the lost onto one person. Some fine tweaking and it would make the game a little less of  field of salt. Maybe I'd actually try ranked.","replies":[]}]}