{"poster":"duvalgv","date":"2016-06-10T07:54:37.107+0000","title":"Mute de pings","subforum":"Charlas Generales","up_votes":35,"down_votes":4,"body":"Hola, quisiera saber por que el mute no silencia los pingeos de los jugadores muteado la verdad cuando juego no falta alguna persona toxica que no para de hablar o pedir ayuda al perder solo la linea  generalmente para esto acudo al silencio o mute ya que no me gusta perder el tiempo discutiendo, pero siempre empiezan con los pings y las se&ntilde;ales estoy arto de por ejemplo morir y que no agan mas que pingear con el signo de interrogaci&oacute;n o que alguien que pierda la linea no pare de pedir ayuda al final siempre termino quitando el sonido de los pings pero encuentro que esto esta mal ya que esta es una via de comunicaci&oacute;n r&aacute;pida con la cual me puedo ahorrar el escribir y poder reaccionar mas rapido en ciertas situaciones en resumen me gustaria saber por que riot no aplica el silencio a los pings o si es que estan pensando ne agregar una opci&oacute;n ya que no creo ser el unico jugador al que le ocurra esta situacion, comenten su opiniones y espero les aya parecido interesante este post Adios.  {{summoner:31}} {{summoner:31}}","replies":[{"poster":"Diclofenaco","date":"2016-06-10T15:32:24.312+0000","up_votes":10,"down_votes":0,"body":"Dioos, que alguien le de vida a este post. Esto es sumamente necesario, todos nos hemos topado con gente que insulta, la solución es simple: Mutearlo. Pero surge otro problema, cuando se da cuenta del mute empieza el pingea, es horroroso. Normalmente silencio las alertas pero eso influye en mi coordinación con el resto de jugadores.\n\nEn Dota, si no me equivoco, cuando muteas a alguien sus Alertas se  restringen, sólo las veces cada 1 min o algo así. Deberían hacer algo así.","replies":[]},{"poster":"Woud","date":"2016-06-10T17:00:07.007+0000","up_votes":5,"down_votes":0,"body":"Mute individual a cada uno, porque podria solo ser uno el que molesta y los pings de los demas podrian ser importantes.","replies":[{"poster":"duvalgv","date":"2016-06-11T01:18:18.760+0000","up_votes":1,"down_votes":0,"body":"Buen punto por eso al igual que al muteo el mute de ping solo deberia ser individual para que solo no ves los ping de aqullos jugadores que te molesten aproposito no los de tus demas compañeros que podrian ser importantes","replies":[]}]},{"poster":"Dxxx","date":"2016-06-11T04:06:51.136+0000","up_votes":1,"down_votes":1,"body":"los ping son necesarios tácticamente, es estúpido silenciarlos...","replies":[{"poster":"Maedme","date":"2016-06-11T15:33:30.993+0000","up_votes":2,"down_votes":0,"body":"Estúpido es tu comentario, está pidiendo un botón que permita silenciar los pings de ciertos players,\nque tiene de tactico que te esten marcando 20 veces \"Ayuda\" si vos ya sabés que necesita ayuda pero no quiere esperar?","replies":[]},{"poster":"Aenar Targaryen","date":"2016-06-12T06:12:01.876+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dxxx,realm=LAS,application-id=v7qsfXsE,discussion-id=F8usj8Hj,comment-id=0007,timestamp=2016-06-11T04:06:51.136+0000)\n>\n> los ping son necesarios tácticamente, es estúpido silenciarlos...\n\nEs una contradicción, técnicamente lo son, pero cuando se utilizan solamente para molestar deberían poder silenciarse.","replies":[]}]},{"poster":"Runth","date":"2016-06-12T08:17:11.849+0000","up_votes":1,"down_votes":0,"body":"el chat y los ping spam mal usados provoca distraccion, debe ser restringido eso, pero por algo baje el volumen de las alertas a 0 y dicen q es importante?\n\nprefiero mi mapa q esas  distracciones\n","replies":[]},{"poster":"Borriic II","date":"2016-06-11T21:27:39.656+0000","up_votes":1,"down_votes":0,"body":"+1\n\nNunca falta el jugador con retraso que lo matan en su linea y comienza a pingear (?) (?) (?) (?) al jungla de su team por todo el mapa, dios que molesto es eso -.- y no hay forma de callarlo al punto que tenes que bajar el volumen a las alertas de todos solo por un subnormal :( \n\nojala la idea de silenciar por completo a un pibe toxico llegue pronto a los desarrolladores y sea implementada :)","replies":[]},{"poster":"Spellhowler","date":"2016-06-11T01:19:07.385+0000","up_votes":1,"down_votes":0,"body":"Y bue.. si mastereas la vision de mapa \nBajale el sonido al juego jaja\nEn definitiva tampoco es que se pueda hacer tanto ping seguido y es una herramienta util  XD\nSalu2","replies":[{"poster":"duvalgv","date":"2016-06-11T01:21:27.813+0000","up_votes":1,"down_votes":0,"body":"la idea no es mutear todos los ping si no de forma individual especificamente de un jugador molesto como dijiste e suna herramienta util,  al igual que el chat y deberia de poderse mutear al que abuse de ete tipo de herramientas solo para molestos almenos esa es la idea que presento espero avertelo aclarado :3","replies":[]}]},{"poster":"Gonzalitt","date":"2016-06-11T00:19:38.933+0000","up_votes":1,"down_votes":0,"body":"Muy buena idea, Pero que sea aparte del mute por chat, xq si quers mutearlo por chat pero queres ver señales, estaria bueno que sea por separado el mute","replies":[]},{"poster":"Blue Striker","date":"2016-06-10T16:56:39.165+0000","up_votes":1,"down_votes":0,"body":"A mi lo que me molesta es que de la nada te pingean donde estas parado, pero toda la partida, y nadie dice quien es. Es sumamente molesto","replies":[{"poster":"wattefak","date":"2016-06-10T21:42:02.101+0000","up_votes":1,"down_votes":0,"body":"Estar cerca de algún objetivo para que lo marque sin querer y report seguro por molesto","replies":[]}]},{"poster":"FC Robin","date":"2016-06-10T20:12:02.176+0000","up_votes":1,"down_votes":0,"body":"La idea esta genial, estaría bueno dos tipos de mute, el común del chat y el de los pings. Es realmente molesto si te ponen el signo de interrogación constantemente o te distraen con los pings comunes como leí en comentarios anteriores.{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"LemønPykë","date":"2016-06-11T02:42:34.258+0000","up_votes":1,"down_votes":2,"body":"Eso no se puede mutear, por el hecho de que no tendrias ningun tipo de comunicación con el equipo, o con esa persona, a la larga termina de manera negativa en la totalidad de  partidas, serian mas los contra, que los pro.\nEsos que son molestos con los pings son casos, muy particulares.","replies":[{"poster":"Aenar Targaryen","date":"2016-06-12T06:13:13.358+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GMING96,realm=LAS,application-id=v7qsfXsE,discussion-id=F8usj8Hj,comment-id=0006,timestamp=2016-06-11T02:42:34.258+0000)\n>\n> Eso no se puede mutear, por el hecho de que no tendrias ningun tipo de comunicación con el equipo, o con esa persona, a la larga termina de manera negativa en la totalidad de  partidas, serian mas los contra, que los pro.\n> Esos que son molestos con los pings son casos, muy particulares.\n\nUltimamente son bastantes. Se debería poder mutear al jugador en chat y que haya otra opción para mutear sus pings cuando se pasa de molesto.","replies":[]}]},{"poster":"Seven Teemo Army","date":"2016-06-11T05:24:58.720+0000","up_votes":1,"down_votes":3,"body":"No, los spamers de pings se aburren rápido, los flamers no, por eso hay mute de chat y no de pings.","replies":[]}]}