{"poster":"Auren Seven","date":"2015-12-03T04:43:09.166+0000","title":"Necesito un mid, ¿Azir o Quinn?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Tengo 6300 y nose cual comprar. Hay 3 cosas que me fijo cada vez que compro a un campeon, una es si me gusta esteticamente, otra es si esta fuerte actualmente y por ultimo la movilidad. Los 2 cumplen los requisitos pero nose por cual decidirme, mi estilo de juego es mas pasivo que otra cosa, me gusta esperar el error del rival y por eso necesito un poco de movilidad. \r\nSegun su experiencia, cual me recomiendan?","replies":[{"poster":"potato support","date":"2015-12-03T12:12:53.367+0000","up_votes":3,"down_votes":0,"body":"anivia. es el mejor de los 3 pajaros para mid.","replies":[]},{"poster":"TheLegend21","date":"2015-12-03T19:00:08.096+0000","up_votes":1,"down_votes":0,"body":"Compra a Quinn Azir es un bugaso","replies":[]},{"poster":"ShurimaSands","date":"2015-12-03T14:58:33.702+0000","up_votes":1,"down_votes":0,"body":"Amigo te recomiendo azir  ....eso si juegale unas 60 partidas en normales contra todos los rotos de mid xD .... y aprende a estar en movimiento  cada vez que peges a un champ ...,mira unos cuantos videos para aprender y ser rapido  dando la w e q  para llegar mas lejos  ...cualquier duda aqui estoy.....adicto al palomo xD{{champion:268}}","replies":[{"poster":"xRenard","date":"2015-12-03T15:16:06.294+0000","up_votes":1,"down_votes":0,"body":"Tengo una consulta, he usado mucho a Azir y es un champ que disfruto harto, pero a pesar de todo no me considero en un nivel avanzado con el. Mis problemas son dos, me cuesta administrar el maná cuando empiezo con Diente de Nashor, y lo segundo es que a veces me cuesta meter bien el ulti al final del combo, entonces mis dudas son, ¿es mejor empezar con morello u otro item en lugar del nashor? y la otra, ¿es mejor empezar el combo con el ulti o dejarlo solo para rematar?\n\nSaludos","replies":[{"poster":"ShurimaSands","date":"2015-12-03T15:32:06.334+0000","up_votes":1,"down_votes":0,"body":"El problema de todos es que piensan que el mana es infinito xD .... no tienes que gastar tanto sacando soldados ...saber cuanto gasta  y cuanto mana tienes ....yo farmeo sin soldados hasta ser lvl 3 .....en lvl 3 denpiendo de lo que tenga en frente lo voy gastando poco a poco con soldados  y a la vez farmeando para ir recuperando mana ......y de inmediato me armo diente ......  lo de la ulti es sies que estas seguro que  tienes que tirarla ...\npor ejemplo : tu Jg es un Lee ( que ya es re tipico xD )  el esta con su ulti  gankea por la parte de abajo  ....tu tiras la ulti para que levante al enemigo y le metas todos los soldados  luego el lee igualmente tirara la r  al enemigo con direccion a tu ulti y otra vez lo levantaraas xD ...es algo asi como una pelota....pero funciona de 10.... no te gastes pensando tanto en cuando tirarla y cuando no ...recuerda que estas contra otras personas , no contra maquinas xD  y las cosas pueden no resultar .\n.y como te digo es solo saber administrar el mana   ya que tampoco gasta tanto.....si quieres jugamos una partida ....estoy conectado todo el dia ..saludos! :) {{champion:268}}","replies":[]}]}]},{"poster":"Sorao","date":"2015-12-03T08:02:17.947+0000","up_votes":1,"down_votes":0,"body":"La Paloma es un gran campeón, con un hermoso Late e increíble repartiendo daño en peleas grupales manteniendo la distancia, pero no todo lo que brilla es Shurima.\n\n- Su early es algo flojo (En especial si te enfrentas contra un campeón con gran movilidad o daño temprano)\n- Es muy **manadependiente** (Y quema mana como condenado), por otro lado el poseer el **buffo azul** te da un increíble aumento de poder (Hostigamiento)\n- Item dependiente (No esperes conseguir kills en el juego temprano,** tu farm es tu vida** los primeros 15 minutos)\n- Necesita una consistente** frontline** para poder desempeñarse con seguridad en las tfs y repartir daño sin que te caigan de lleno los 5 enemigos (Puedes valerte solo, pero hasta cierto grado solamente, por ende necesitas que tu team entienda tus intenciones y te acompañe)\n- Posees una buena cantidad de** counterpicks** que te harán sufrir en linea seas el mejor Azir de LAS o no.\n- Que la verdad sea dicha, necesitas un buen **par de manos** y un pie bien entrenado para jugarlo\n\nEntre tus dos opciones en lo personal me decantaría por Quinn en este momento, los Ap Mids de late game están pasando por una muy mala temporada en estas fechas, saludos invocador!","replies":[{"poster":"ShurimaSands","date":"2015-12-03T14:54:48.705+0000","up_votes":1,"down_votes":0,"body":"Mas que nada recomiendo que lo primero que termine sea  {{item:3115}} tenga quien tengas delante ....es lo mejor .....","replies":[]}]},{"poster":"Rohaerlynn","date":"2015-12-03T09:17:27.012+0000","up_votes":1,"down_votes":0,"body":"Quinn no es un mid.\nque se mueva rapido y pueda gankear facil no significa que eso la haga automaticamente un mid, el mid no es el unico que puede hacer roam.","replies":[]},{"poster":"Nasfari","date":"2015-12-03T05:16:12.707+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo Quinn, es un campeón mucho mas sencillo de usar ademas de que esta op en estos momentos.\nAzir es un campeón que necesita mucha practica si quieres sacar todo su potencial, tiene campeones que le ganan muy fácil, lo que puede que te resulte un poco frustrante y lo dejes de lado.","replies":[]},{"poster":"DayronDrakend","date":"2015-12-03T05:00:37.431+0000","up_votes":1,"down_votes":0,"body":"Ve por Azir si quieres un desafío.","replies":[]}]}