{"poster":"xFreezy17","date":"2017-11-10T18:13:06.577+0000","title":"Non ricordo dell'ultima volta che ho vinto una partita","subforum":"Discussioni generali","up_votes":4,"down_votes":0,"body":"Sto perdendo ogni partita. Non capisco cosa sia, mi sembra di non riuscire a sfruttare il mio vantaggio, che il team faccia davvero cagare, che il late game sia solo determinato dalla migliore team comp, che ci&ograve; che determina la vittoria da qualche mese &egrave; solamente determinato dalla bravura della botlane. Io come midlaner sceso a platino 3, non capisco cosa sbaglio per non riuscire a vincere. Questo &egrave; il mio profilo: euw.op.gg/summoner/userName=xFreezy17\nMi serve qualcuno che mi dia qualche consiglio, possibilmente anche a voce.\nEdit: Sono sceso a P4\nEdit: Voglio morire","replies":[{"poster":"AthlonX860","date":"2017-11-10T18:37:52.363+0000","up_votes":1,"down_votes":0,"body":"a volte capita anche a me avere 10 o più partite perse. Mi faccio forza e vado avanti, altro non puoi fare, prima o poi una la si vince.\n{{sticker:garen-swing}}","replies":[{"poster":"xFreezy17","date":"2017-11-10T18:52:09.673+0000","up_votes":1,"down_votes":0,"body":"Si vede che non hai visto il mio profilo","replies":[{"poster":"vK7s","date":"2017-11-10T20:10:17.996+0000","up_votes":2,"down_votes":1,"body":"vb ma non ci fare caso... ha 31 anni ed e silver 4 e normale che la prende con superficialita.\n\ncmq anche nel platino alto, se arriva il momento dove ti mette solo con boostati in team scendi.\n\nho visto il tuo profilo, non fai partite di merda altrimenti si vedeva dagli score, quindi adesso non pensare che e colpa tua, che devi migliorare ecc.. perche non puoi perdere 6 game di fila con score medio/buoni, e evidente che ti ha messo i deficenti in team...quindi non ti abbattere.\n\nho fatto il d5 facilmente 2 volte... una volta in preseason 7 e un altra volta in s7, in s7 con sole 90 vittorie, dopo di che mi sono fermato poiche il gioco non ti da stimoli per continuare a salire (a parer mio).\n\ncmq il platino 1 e tosto perche trovi un sacco di boostati che hanno pagato per il d5.\n\nps:il game dove sei: 12/6/7 mi spieghi cosa pretendi? jax 2/10 hahaha, l'altro dove hai fatto:19/9/3 hai nidalee jungler...quindi stavate in 4,  gia il fatto che avevi 3 assist significa che stavi quasi da solo, l'altro dove stavi:15/8/6 avevi teemo 3/8 e nami 3/12 che volevi fa? per carita, qualcuna si potrebbe carriare ma se per caso non ci riesci non vuol dire che sei scarso....stavi in mezzo ai spastici.","replies":[{"poster":"xFreezy17","date":"2017-11-10T21:58:42.637+0000","up_votes":1,"down_votes":0,"body":"C'è anche da calcolare la demoralizzazione. Purtroppo ho perso ogni sentimento, non provo più niente. Davvero, non provo più alcun sentimento per ogni cosa accada, ho sempre la stessa faccia.","replies":[{"poster":"vK7s","date":"2017-11-11T00:14:53.759+0000","up_votes":1,"down_votes":0,"body":"prendila tranquilla non hai perso niente e successo in preseason:)","replies":[]}]}]},{"poster":"AthlonX860","date":"2017-11-10T19:43:47.043+0000","up_votes":1,"down_votes":0,"body":"lo ho visto, fidati ho avuto momenti peggiori dei tuoi, non è così drastica la situazione dai il massimo e vedrai che una la vincerai prima o poi","replies":[]},{"poster":"DavisGTI","date":"2017-11-10T19:37:34.784+0000","up_votes":1,"down_votes":0,"body":"Però ha ragione. Davvero, statisticamente parlando è impossibile che tu le perda tutte. E se hai avuto una losing streak così grande, be', sappi che non continuerà all'infinito. E' frustrante, parecchio, lo so bene anche io come tante altre persone. Ho saputo di gente avere oltre le 20 sconfitte di fila.\nSe senti di essere parecchio stressato/tiltato, prova a prenderti del tempo per rilassarti. Il che significa che magari dovresti giusto staccare da LoL, anche solo per uno o due giorni. Vedrai che ti aiuterà a pensare e giocare senza fattori negativi che possano tirarti giù.","replies":[]}]}]},{"poster":"Dexiner","date":"2017-11-12T07:56:39.306+0000","up_votes":1,"down_votes":0,"body":"Te lo avranno già detto ma te lo dico anche io: prenditi una pausa.\nFatti un mesetto su qualche altro gioco, con amici almeno ti rilassi e stacchi un po' da lol, poi quando torni sarai meno frustrato e tornerai a vincere","replies":[{"poster":"xFreezy17","date":"2017-11-13T10:17:51.282+0000","up_votes":1,"down_votes":0,"body":"Ma non mi sembra di essere il peso della squadra, è quello il fatto. Vorrei solo capire cosa sbaglio.","replies":[{"poster":"Dexiner","date":"2017-11-17T12:23:39.109+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xFreezy17,realm=EUW,application-id=MJVj50Jw,discussion-id=1eXQyOVH,comment-id=00030000,timestamp=2017-11-13T10:17:51.282+0000)\n>\n> Ma non mi sembra di essere il peso della squadra, è quello il fatto. Vorrei solo capire cosa sbaglio.\n\nNon sei tu il peso della squadra spesso, di solito è la squadra che ti pesa addosso","replies":[]}]}]},{"poster":"Ryouzetsu","date":"2017-11-11T10:39:12.172+0000","up_votes":1,"down_votes":0,"body":"anche io da quando sono arrivate le nuove rune sto sempre a 0 PL visto che ne vinco 1 e ne perdo 2 :D","replies":[]},{"poster":"PrinceUsuiTakumi","date":"2017-11-10T18:34:29.302+0000","up_votes":1,"down_votes":0,"body":"Ti sconsiglio di giocare ranked durante la preseason,è molto meglio fare pratica giocando normal con amici;è anche un modo per distendere in nervi dopo mesi di ladder.","replies":[]}]}