{"poster":"Nocte Perpetua","date":"2017-09-22T15:46:20.427+0000","title":"Montage solo ADC","subforum":"Creazioni della community","embed":{"description":"Clips are mostly from unranked games. ( ITz Me Jolly - Eu West I love playing as Ezreal, Lucian and Vayne and do video montages when I have time! Song: Dead By April - Losing You (https://www.youtube.com/watch?v=4xFDmYl3l6w)","url":"https://www.youtube.com/watch?v=l_2Iezl596Y&amp=&feature=youtu.be","image":"https://i.ytimg.com/vi/l_2Iezl596Y/hqdefault.jpg"},"up_votes":2,"down_votes":1,"body":"Un appunto importante:\r\nHo avuto **svariati problemi** probabilmente con quelle clips che ho &quot;ripescato&quot; nella cartella replay (Non ne sono sicuro, &egrave; solo una supposizione) per registrarle poich&eacute; la cronologia partite &egrave; andata troppo avanti (Problema comune: Nella preview laggava troppo e mi &egrave; venuto difficile editarle, ho dovuto fare ad occhio dopo averle renderizzate varie volte e riguardate su Media Player per controllare se fosse tutto ok!)\r\nAd esempio quello zoom mentre utilizzo la R di Ez &egrave; l&#039;unico errore rimasto, ma dopo aver passato quasi 1 ora  a bestemmiare dietro a problemi post-rendering ho lasciato perdere, non condannatemi per favore xD\r\n\r\nHo creato questo video e lo posto qui solo per puro divertimento e passatempo (E per fuggire dal mio studio matto e disperato, lol), non per mostrare la mia bravura od altro!\r\n\r\n Con questo detto mi auguro che vi piacciano sia il mio stile molto semplice sia la canzone che ho utilizzato!\r\n\r\n(Le clip vengono quasi tutte da partite **non** classificate)","replies":[{"poster":"Zanarkand III","date":"2017-09-29T10:53:51.695+0000","up_votes":1,"down_votes":0,"body":"Ciao, purtroppo qui sul forum non troverai solidarietà per i tuoi video. A nessuno interessa fare critiche sensate e la maggior parte delle volte ti metteranno un -1 senza nemmeno vederlo. Bel video comunque, sia il montaggio che le giocate... adcarry è un ruolo veramente tosto da imparare a giocare","replies":[{"poster":"Nocte Perpetua","date":"2017-09-30T15:13:17.762+0000","up_votes":2,"down_votes":0,"body":"Tu lo hai guardato e questo mi basta! ^^\nGrazie mille","replies":[]}]}]}