{"poster":"waffen SS","date":"2016-04-12T20:37:11.942+0000","title":"esta muy debil kog maw de nuevo","subforum":"Charlas Generales","up_votes":1,"down_votes":21,"body":"eso dejaron a kog maw muy d&eacute;bil una vez mas, no tiene velocidad de ataque al comienzo y ya q este sube con su aumento de nivel, en early lo dejan demasiado debil, entonces para farmear tenes q apretar la W q antes no quitaba mana pero ahora si, usando la W para farmear te quita todo el mana ya q lo usas en 4 oleadas y sin mana, ahora tenes 2 opciones, armarte velocidad de ataque y no tener nada de da&ntilde;o sumado a q ninguna de las habilidades de kog de por si tiene da&ntilde;o o armarte da&ntilde;o q es lo mas viable ya q tratado de usar un poco la falta de mana podes sortear pero con muy pocas posibilidades de hacer alguna kill dependiendo de tus kills exclusivamente q te vengan a gankear\r\n\r\nasi q otra vez dejaron al champ inutil","replies":[{"poster":"Nasfari","date":"2016-04-12T21:37:12.840+0000","up_votes":6,"down_votes":0,"body":"CONSEJO deja tu arrogancia de lado si quieres subir, porque ya mucho gente te ha dicho que estas haciendo las cosas mal pero tu insistes que tus forma de jugar te da resultados cuando NO es así. Malas builds, runas y maestrías.\nSi quieres mejorar pide ayuda y no te cierres, también puedes agregarme te puedo ayudar sin ningún problema. Saludos","replies":[]},{"poster":"lPikachu","date":"2016-04-12T22:07:10.048+0000","up_votes":5,"down_votes":0,"body":"solo lo estas armando mal :V","replies":[]},{"poster":"Shiny Teemo","date":"2016-04-12T21:54:15.586+0000","up_votes":5,"down_votes":0,"body":"Lamentablemente no sabes armarte y por eso te va mal, kog es el adc con mas win rate en este momento. La build con la que mejor le va  a pesar de que no lo quieras aceptar es esta\n\nhttp://i.imgur.com/v1qxexL.png","replies":[]},{"poster":"dinamoooo","date":"2016-04-12T21:36:58.616+0000","up_votes":5,"down_votes":0,"body":"Y entonces porque es el adc que mas winrate tiene ? \n\nhttps://www.champion.gg/statistics/#?sortBy=general.winPercent&order=descend&roleSort=ADC\n\n\nEDIT :\n\nMirando tu historial ya vi el problema , es que no lo sabes armar , aca te dejo la pagina con la build mas ganadora y la mas usada \n\nhttps://www.champion.gg/champion/KogMaw/ADC","replies":[]},{"poster":"Zeran","date":"2016-04-12T20:40:41.633+0000","up_votes":6,"down_votes":1,"body":"La historia de waffen SS, el plata 4 main Kog Maw desde la beta, luego de perder una partida con un score de 4-8, con una build muy poco recomendada con Kow (Bailarin luego filo) dice que Kog es debil :,(","replies":[{"poster":"waffen SS","date":"2016-04-12T20:45:20.091+0000","up_votes":1,"down_votes":8,"body":"baje a plata 4 de plata 3 y la guinso y el rey no los pienso comprar nunca, por q esas cosas no rinden, no tienen probabilidad de critico y eso las hace inutiles para adc","replies":[{"poster":"Hwaxinghz","date":"2016-04-12T21:11:15.091+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=waffen SS,realm=LAS,application-id=v7qsfXsE,discussion-id=PrdsGFJR,comment-id=00000000,timestamp=2016-04-12T20:45:20.091+0000)\n>\n> baje a plata 4 de plata 3 y la guinso y el rey no los pienso comprar nunca, por q esas cosas no rinden, no tienen probabilidad de critico y eso las hace inutiles para adc\n\nComo se nota que no tienes ni idea de como usar un Hyper Carry como Kog.\nBajaste a plata 4 porque es obvio, ni armarte sabes.\nTe quiero ver una sola partida que te toque contra un Kog Maw que se arme Espada del Rey Arruinado con una Guinso y veremos si le hacen falta críticos (según vos {{item:3153}} {{item:3124}} no sirven), ya verás, te acordarás de mi cuando algún día te toque uno que salga 10/0 de línea (contra vos por supuesto, por confiarte a que \"no tiene críticos no sirve\").\n\nCreo que te falta experiencia. No debes rankear sin siquiera saber que ítems usan los campeones. Por dios, esta gente toca después en Ranked (Y no es broma).","replies":[{"poster":"Boram","date":"2016-04-12T21:21:31.382+0000","up_votes":2,"down_votes":1,"body":"x2\n\nal menos las partidas de amig@s bronces-platas que he visto parten con {{item:3124}} + {{item:3006}} + {{item:3085}} + {{item:3153}} + {{item:3053}} o {{item:3022}} \n\nAlgunos en lugar de las botas de velocidad de ataque compran {{item:3009}}","replies":[{"poster":"Boram","date":"2016-04-12T21:22:32.043+0000","up_votes":2,"down_votes":0,"body":"No opino de elos mas altos porque no tengo amigos por esos rincones del servidor ._.","replies":[]}]},{"poster":"waffen SS","date":"2016-04-12T21:30:55.342+0000","up_votes":1,"down_votes":8,"body":"y vos q podes opinar si no usas a kog vi tu historial no debes tener ni idea anda y metete en conversaciones q usen los champ q te carren solos y no necesites manos como los q usas","replies":[{"poster":"Quo","date":"2016-04-12T21:45:20.938+0000","up_votes":3,"down_votes":0,"body":"Adivina que, el chabon tiene mas razon que vos a la hora de comentar y un poco mas de cabeza, es tan simple como echarle un vistazo a \"champion.gg\" esa pagina forma builds con el mejor win ratio contando partidas de platino hacia arriba y adivina que?\n\n{{item:3124}} + {{item:3006}} +{{item:3085}} +{{item:3153}} + {{item:3053}} + {{item:3036}} Es la build mas usada y recomendada con un 58.01 de win ratio.","replies":[{"poster":"waffen SS","date":"2016-04-12T23:05:01.319+0000","up_votes":1,"down_votes":2,"body":"vieja esa build la sacas de una pagina yo le e ganado a otros kog maw 1 vs 1 con esa misma build no duran ni 2 autoataques con mi build osea esa build solo te sirve para farmear y ser un bicho pasivo como aurelion sol","replies":[{"poster":"Quo","date":"2016-04-12T23:59:51.475+0000","up_votes":2,"down_votes":0,"body":"Wow, eso explica porque estas diciendo que kog esta nerfeado jajajaja, que lastima que seas tan cerrado :3","replies":[]}]}]},{"poster":"Hwaxinghz","date":"2016-04-12T21:48:14.928+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=waffen SS,realm=LAS,application-id=v7qsfXsE,discussion-id=PrdsGFJR,comment-id=0000000000020001,timestamp=2016-04-12T21:30:55.342+0000)\n>\n> y vos q podes opinar si no usas a kog vi tu historial no debes tener ni idea anda y metete en conversaciones q usen los champ q te carren solos y no necesites manos como los q usas\n\nJajaja, es una broma verdad?\n\nNo uso ese campeón por que no me gusta, puedo opinar todo lo que se me da la gana. Es un foro libre para que la gente se comunique y ayude, y gente como vos que no acepta ninguna crítica merece estar en lo más profundo de Bronce 5 y que se te haga imposible salir. ¿POR QUÉ? Porque sos egoísta y no aceptas que alguien que sabe te ayude, no ayudas ni dejas recibir ayuda.\n\nMi historial no muestra ni el 1% de lo que soy como jugador, nunca viste mis chats, mi forma de jugar o la gente con la que juego. Mi DUO es main Kog Maw y suelo supportearlo, tengo 100% de experiencia con todo tipo de ADC'S, y no estoy en bronce PULIDO (como vos), entiendo el juego no al 100% pero SEGURAMENTE un 70-80%. Y viendo tus runas (por dar un ejemplo) ninguna de tus 7 páginas de runas son óptimas para jugar normalmente (Ni hablar de tu poca o casi NULA experiencia en el juego) y ¿me vienes a decir a mi que no tengo idea?. Dios mio, cada día estos trolls evolucionan a proporciones bíblicas.\n\nAhora de seguro me dicen \"no seas un malote\" por una \"denuncia\", es obvio, no puede ser que no acepten consejos de nadie y siempre le perjudicado es el que ayuda, genial, el mundo está así por gente como vos que no acepta la ayuda de los demás, AHHH pero tampoco ayuda.\n\nTe pregunto lo siguiente ¿Para qué escribes en un foro público si no aceptas ninguna crítica?\n\nYo, literalmente, mis posiciones Principal, secundaria y terciaria son ADC, Mid y Soporte, conozco todos y cada uno de los campeones (de hecho me faltan solo 20 campeones por comprar y ni me interesa tener porque son muchos de ellos Top's y jungla's) y no me puedes decir nada por \"no sabes nada porque nunca los usaste\", sí que los usé, los usé a todos, pero no RANKEO con ellos, no puedo rankear con 130 campeones, tengo mis campeones preferidos y no vengas a decir \"campeones Sin manos\" Cuando MAINEAS A TEEMO (si, lo tienes con maestría 5). Te quiero ver algun dia en una partida para DEMOSTRARTE como los \"campeones sin manos\" te revientan en un santiamén y lo débiles que son ante un gran número de campeones, y que requieren un posicionamiento bastante específico (cosa que con teemo no hace ni falta porque pones 3-4 hongos y fue, se acabó el teemo).\n\nNingún campeón carrea solo, te lo digo desde ya. Yo no estoy en PLATINO porque me carrearon, estoy por mi habilidad, si no puedes subir porque pierdes 10 partidas seguidas y le echas la culpa a los trolls y afk, el factor común eres tu, sin resistencias a línea y encima no te buildeas bien, no esperes subir a más allá de plata 3 como EXTREMO.\n\nOJO, aclaré TODO ESTO sin insultar ni nada por el estilo, pero la gente como vos me saca bastante.","replies":[]}]}]},{"poster":"teemo reumatico ","date":"2016-04-12T20:56:54.561+0000","up_votes":4,"down_votes":0,"body":"la guinso es el objeto que mas vel de ataque te da y te lo da de gratis por que las estadisticas de ad y ap q da por el precio son las mejores <3 el rey murio hace mucho solo es recomendable vs tanques .","replies":[]},{"poster":"MH Narugakuruga","date":"2016-04-12T20:53:39.536+0000","up_votes":4,"down_votes":0,"body":"si buscas adc full critico, lo mejor es que dejes de usar kog maw, y uses algo como ashe, vayne, draven\n\nSaludos{{champion:34}}","replies":[]},{"poster":"TheFalc","date":"2016-04-12T21:55:48.088+0000","up_votes":3,"down_votes":0,"body":"Kog tiene interacción con el crítico?\nNo\nQuinn?\nSi, su pasiva\nGraves?\nSi, su pasiva\nSivir?\nSi, su W\nLucían, Ezreal, (casters que usen esens river(Re mal escrito xD))? \nSi, aumenta la reducción de enfriamiento con respecto al crítico\nKog'Maw no tiene relación con el golpe crítico ni con el essence reaver. Kog'Maw es un adC de puro dps, daño por segundo, daño sobre tiempo como se quiera llamar. Por eso se usa el Fervor de Combate, aumente el dps a básicos, lo mismo el Rey Arruinado y el guinso. El crítico sólo añade un pequeño burst que a Kog'Maw no le beneficia tanto como a otros campeones. :-/","replies":[{"poster":"waffen SS","date":"2016-04-12T23:02:06.594+0000","up_votes":1,"down_votes":2,"body":"draven tampoco tiene interaccion y mete un monton de criticos, en daño por segundo velocidad de ataque con W y critico es el q mas daño hace","replies":[{"poster":"LagedByNetflix","date":"2016-04-13T00:11:18.522+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"TheFalc","date":"2016-04-13T10:23:55.865+0000","up_votes":1,"down_votes":0,"body":"Iba a comentar lo mismo, la Q es afectada por el golpe crítico, el daño adicional se duplica","replies":[]}]}]}]}]},{"poster":"waffen SS","date":"2016-04-12T20:52:56.983+0000","up_votes":1,"down_votes":8,"body":"y te digo runas 25% daño critico 10 daño fisico\n\nmaestrias en fervor de batalla \n\nobvio q estas maestrias y runas no funcionan hasta un mid game o late, pero eso no seria ningun problema si kog tuviera un poco mas de early como antes de q lo toqueteen y le metan toda esa mierda como si de verdad estuviera roto el adc la guinso le puede servir a jax pero a distancia esta nerfeada, sacarle un rey es inutil ya por q te la haces de 3 items ya cuando no dependes tanto del mana y hacertela te quita 100 puntos de daño en comparacion a una sanguinaria q te da lugar a matar al mid o al jg antes q te mate a ti por q no tenes mucho escape mas q el flash y necesitas daño explosivo para sobrevivir un focus q obviamente te lo vas a comer","replies":[]}]},{"poster":"Rebkans","date":"2016-04-12T21:24:03.984+0000","up_votes":4,"down_votes":0,"body":"Como se nota que no tenes idea del champ. Kog maw no es un adc que debe tener critico, hay adc's mejores que él para eso.\nKog'maw es un adc de velocidad de ataque y daño, por lo tanto, espada del Rey arruinado sirve bastante al igual que Guinso.\nYo uso este champ desde que era lvl 10 en la S2 y las build de Kogy han ido variando y hay que aceptarlas.\n A mi tampoco me gusta usar guinso pero la compro porque es un item fundamental para este champ al igual que Runnan. El bailarin Espectar ya no le sirve tanto como antes tampoco.\nCon la build recomendada para este meta, Kog´maw es uno de los mejores adc del juego ( en mi opinion), ya que es muy OP en late principalmente.","replies":[]},{"poster":"Boram","date":"2016-04-12T21:11:28.580+0000","up_votes":4,"down_votes":0,"body":"Quien gasta mana para farmear? basta dar last hits y ya está, y si te pushean la linea y te meten bajo torre recien usas mana para perder la menor cantidad de minions posibles. Kogmaw es y desde que empecé a jugar LoL, ha sido siempre un adc de lategame, si juegas con Kogmaw centrate en farmear, que cuando ya tengas Guinso y Runan tendrás daño suficiente para teamfights, esto suponiendo que te posiciones de buena manera.","replies":[{"poster":"waffen SS","date":"2016-04-12T21:27:59.417+0000","up_votes":1,"down_votes":5,"body":"no podes dar last hit por q sin la W tenes menos rango q vayne o casi el mismo pero vayne tiene muchisima mas movilidad","replies":[]}]},{"poster":"KarmaUnder","date":"2016-04-12T22:49:13.208+0000","up_votes":2,"down_votes":0,"body":"JAJAJAJAJAJAJJAJAJAJAJAJAJAJ ESTO ES UN CHISTE XDDD\nKOWMAG SIN GUINSO Y REY JAJAJAJAJAJAJAJAJAJAJJAJAJA\nDECIME KAPO QUE TE SIRVE MAS, METER POR SEGUNDO 5 EFECTOS DE IMPACTO O METER MAXIMO 2 O 3 CRITICOS ?","replies":[{"poster":"waffen SS","date":"2016-04-13T01:45:53.893+0000","up_votes":1,"down_votes":1,"body":"con mi build completa meto mas daño q disque guiso y rey arrugado y esa build q los gorditos diamantes usan, esa build q le arman saca mucho menos solo tiene mas early q la mia pero en late se queda por atras y en late q kog maw es de late lo deja por detras de otros champs","replies":[]}]},{"poster":"erwinchelo","date":"2016-04-12T21:34:40.155+0000","up_votes":2,"down_votes":0,"body":"Kog actualmente es el adc mas potente, pero, sus debilidades son muy resonantes debido a sus dependencias...desdeuna compo formada entorno a el, a un fase de linea pasiva orientada a farmear y llegar a una fase de juego donde su impacto sea determinante","replies":[]},{"poster":"Ufaaaaaaaaaa","date":"2016-04-12T21:26:43.016+0000","up_votes":2,"down_votes":0,"body":"hace 3 dias supporteé a un kog. Fué el que mas daño hizo en la partida (37.6 k) y obviamente ganamos. Y jugando ranked en oro. Inluso la grabé en op.gg si querés chusmearla. Incluso cuando no lo usaban me pedían que lo baneé.","replies":[{"poster":"waffen SS","date":"2016-04-12T21:35:56.920+0000","up_votes":1,"down_votes":6,"body":"yo tambien hice ese daño pero a nivel bajo y no teniendo suport q se crean mid full ap como todas las morganas q me vienen tocando desde hace 3 partidas seguidas, y hablo q a nivel bajo perdes absolutamente todos los intercambios hasta incluso en mid game seguis perdiendo todos los intercambios por mas q esquives las Q de lucian o las de jinx seguis perdiendo intercambios por q hasta q no te armas bien salis perdiendo siempre","replies":[]}]},{"poster":"Puynsi","date":"2016-04-13T13:39:02.824+0000","up_votes":1,"down_votes":0,"body":"Dejen al chico creer que va a ser challenger con un kog full critico.\nMientras mas abajo quede menos rankeds le jode al resto cuando suban.","replies":[]},{"poster":"MyDear 2k15","date":"2016-04-13T00:12:04.118+0000","up_votes":1,"down_votes":0,"body":"No maineo {{champion:96}}  en ranks soloQ, pero si es mi champ favorito y el cual mejor logro usar.\nEl gusano es un champ de late game, obviamente necesita un early de puro farmeo y juego pasivo (con un peel decente), entrando a un mid game en donde una vez se tenga guiso y huraca, mete un daño aceptable.\n\nLa build es tipica y en orden, {{item:3124}} >{{item:3085}} > {{item:3009}} (prefiero 3 veces mas estas que las de AS) > {{item:3153}}  > {{item:3036}}  o {{item:3053}} (contra champs AD) o {{item:3156}} (contra champs AP burst) o {{item:3072}} .\n\nUso 6 glifos de Atk Speed + 3 de Magic resist. o a la inversa, dependiendo el daño que pueda meter el supp contrario.\n\n\nClaramente se logra notar la diferencia entre el parche anterior a su \"nerfeo\", pero sigue siendo el mismo champ OP de siempre.\n\nhttps://www.youtube.com/watch?v=JoQ1HR1Fk34","replies":[]}]}