{"poster":"Moument","date":"2015-05-17T15:23:27.540+0000","title":"Spiel gecrashed, kann nicht reconnecten oder ein neues anfangen. Tipps ?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Habe ein ARAM gespielt vorhin um die Zeit zu &uuml;berbr&uuml;cken wo mein Duo-Partner essen war. Im Spiel war alles wunderbar keine lags oder &Auml;hnliches und pl&ouml;tzlich hei&szlig;t es Attempting to reconnect und das Spiel ist gecrashed.\r\nIch kenne mich mit der Materie nicht wirklich aus und kann nicht sagen ob es sich hier um den ber&uuml;hmt ber&uuml;chtigten Drophack handelt oder einfach nur ein Fehler der Server jedenfalls steht hier seit 3(!!!) Stunden dass das game gecrashed ist und ich bitte reconnecten soll allerdings komme ich weder ins Spiel noch kann ich ein neues beginnen.. \r\nHat irgendjemand Erfahrung damit und kann mir sagen was ich nun tun kann damit besagte Meldung verschwindet ? Ich bin mir n&auml;mlich ziemlich sicher, dass das Spiel inzwischen vorbei ist :D \r\n\r\nDanke und Liebe Gr&uuml;&szlig;e","replies":[{"poster":"EkoUchiha","date":"2015-05-17T19:21:42.798+0000","up_votes":1,"down_votes":0,"body":"das ist ein drop ahck leute viel spaß da laufen gerade übelst viele rum und den support juckt es nicht^^^und nicht vergessen ihr seit die opfer und bekommt dan von riot noch nen leav booster reingedrückt","replies":[{"poster":"EkoUchiha","date":"2015-05-17T19:23:18.357+0000","up_votes":1,"down_votes":0,"body":"aso ja die lol mitarbeit arbeiten fleißig daran ;D (wers glaubt wir seelig lieber nen neuen champ rausbringen)","replies":[{"poster":"EkoUchiha","date":"2015-05-17T19:23:50.351+0000","up_votes":1,"down_votes":0,"body":"Die titanic scheiterte an einem eisberg lol am drophack RIP LOL\nrettet euch und geht nich mit dem schiff unter","replies":[]}]}]},{"poster":"Kingkade","date":"2015-05-17T18:18:37.257+0000","up_votes":1,"down_votes":0,"body":"jop bin auch grad ausmnem ranglistenspiel geflogen ...... und reconnect geht nicht...... hab schon pc neugestartet und router neugestartet ...... bringt alles nix ..... selbst als ich mich innen smurf eingeloggt hab und auf zuschauen gegangen bin komm ich nur in den loadscreen und häng dann da fest also wird wol das komplette game gecrashte sein","replies":[]},{"poster":"Bansaya3188","date":"2015-05-17T16:30:14.538+0000","up_votes":1,"down_votes":0,"body":"Das selbe Problem hier -.- \nGerade im Ladebildschirm gewesen für ein Game, kommt die Meldung, jegliche Versuche von Neustarts des PCs bis hin zu zahlreichen Reconnectversuchen blieben leider erfolglos, da werde ich sicher erstmal schön dick reported, danke Riot :D","replies":[]},{"poster":"TheFreak2004","date":"2015-05-17T15:51:23.865+0000","up_votes":1,"down_votes":0,"body":"Bei mir ist das gleiche Problem und ich warte schon ca. 2 Stunden :(","replies":[]},{"poster":"RoyalPain","date":"2015-05-17T15:45:12.985+0000","up_votes":1,"down_votes":0,"body":"Hab das gleiche Problem und kann seit über ner Stunde nicht reconnecten geschweige denn ein neues Spiel starten...\nWeiß zufällig jemand was genau passiert wenn das Problem im Ranked aufgetreten ist also ob ich lp verliere ?\nSchließlich ist das ja nicht meine Schuld.","replies":[]},{"poster":"Moument","date":"2015-05-17T15:36:00.079+0000","up_votes":1,"down_votes":0,"body":"Neu gestartet hab ich schon zwei mal und warte nun mittlerweile schon über 3 stunden :c","replies":[]},{"poster":"FailerOfWorld","date":"2015-05-17T15:30:09.851+0000","up_votes":1,"down_votes":0,"body":"versuch mal lol neu zu starten","replies":[]},{"poster":"Brucé Łeé","date":"2015-05-17T15:29:04.200+0000","up_votes":1,"down_votes":0,"body":"Ist mir vorhin ebenfalls passiert, einfach Warten bei mir ist es erst nach ner Stunde wieder normal gewesen.","replies":[]}]}