{"poster":"99Power","date":"2015-06-07T16:07:42.213+0000","title":"Chi tra questi?","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Salve, sapere il vostro voto riguardo a questi 2 Champion! \nPrincipalmente per giocare Top!\nIo so che Gnar pu&ograve; attaccare a distanza e quando diventa Mega Gnar &egrave; pauroso...\nMentre so che Maokai &egrave; un tank Sia top che jungler... Chi mi consigliate?\nPotete scrivere motivo?\n","replies":[{"poster":"NIGERUNDAYO JoJo","date":"2015-06-07T21:06:54.967+0000","up_votes":1,"down_votes":0,"body":"Gnar --> Bei danni,si builda off-tank,attacca a distanza e ha uno slow (q da normale), un escape (la e) e lo stun (mega gnar)..non è poi così difficile da usare una volta imparato a gestire la trasformazione\nMaokai --> Bei danni (più o meno stiamo la con gnar..),puoi buildarlo tank,off-tank e ap (ho provato sia tank che ap, mi è sembrato più pericoloso buildato tank),ha tre cc (slow,knockup e quella specie di stun della W), in tf c'è bisogno di molta coordinazione,stessa difficoltà di gnar","replies":[]},{"poster":"Ringiel","date":"2015-06-07T16:38:47.686+0000","up_votes":1,"down_votes":0,"body":"io ti consiglio maokai ...\nè molto più semplice da utilizzare che gnar e,come detto da white terror,non è dipendente dalla trasformazione per ingaggiare.","replies":[]},{"poster":"99White Terror99","date":"2015-06-07T16:17:11.663+0000","up_votes":1,"down_votes":0,"body":"gnar è più forte di maokai, ha anche uno stun se riesce a metterlo a segno più l'escape quando rimbalza e la Q per harassare\nil lato negativo è che diventa indistruttibile quando diventa mega gnar ma tutti prontamente se ne allontanano e non puoi trasformarti quando vuoi (i teamfight sono quindi subordinati un pò a quando ti trasformi)\nmaokai invece rimane sempre maokai, un grosso legnoso tank difficile da abbattere, tuttavia fa meno danni di gnar (ma non sono sicuro) e dipende dal mana problema che gnar non ha\nquesto è quello che so, ci ho giocato poche volte io personalmente, ancora meno con e contro ma le poche volte che li ho visti erano devastanti, dei colossi","replies":[]}]}