{"poster":"99Power","date":"2015-02-26T23:00:17.749+0000","title":"Suggerimenti sui campioni da acquistare (2)","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Salve a tutti, vorrei avere una vostra opinione...\r\nSto per raggiungere nuovamente i miei 3600 Punti Influenza...\r\nCosa mi suggerite da comprare?\r\nVorrei un parere su {{champion:161}} {{champion:421}} e{{champion:429}}  in modo che io possa scegliere quale comprare.","replies":[{"poster":"Nibbio Bianco","date":"2015-02-26T23:16:56.603+0000","up_votes":2,"down_votes":0,"body":"Vel'Koz è un support, non un midlaner, Rek'sai è un jungler, Kalista va bene sia top che adc, ma meglio adc. Prendi il campione del ruolo che preferisci.","replies":[{"poster":"Ucr0niA","date":"2015-02-26T23:22:20.277+0000","up_votes":1,"down_votes":1,"body":"Vel'Koz è un support e Kalista è un top.\n\nOk....","replies":[{"poster":"Akujii","date":"2015-02-26T23:45:07.479+0000","up_votes":1,"down_votes":0,"body":"Si .-.\nVelkoz ha  problemi di mobilita  nella midlane e molti pick popolari tipo zed, yasuo,ahri etc lo devasterebbero troppo per non  parlare che non ha un vero e proprio CC pesante.\nMolto meglio supp dove puo pokare l'adc nemico fino alla morte.\nMentre kalista top è come vayne, se i toplaner nemici sono  malee e nn hanno gap closer è molto viabile","replies":[{"poster":"Ucr0niA","date":"2015-02-27T06:53:20.011+0000","up_votes":1,"down_votes":1,"body":"Si, infatti quando vai Kalista top hai la fortuna di avere il tuo fidato support affianco su cui ultare e su cui hai la passiva sui basic.\nMa per piacere.\n\nChe vogliate giocare gli adc top è una cosa apparte, ma io personalmente non è che gradisca fortemente la cosa di suo.>\n\nTi ritroverai in late con: 2 adc e un mid, già hai 3 champ fatti di burro, se avevi pure il jungler assasino siete proprio tenerelli nei teamfight.\nE questo perchè uno deve pickare l'Adc solo per andare \"a quel posto\" al top avversario che magari avrà fatto *una cosa stranissima*, avrà pickato un tank.\nDi tutte le scelte poi, vadano Quinn e Vayne, ma Kalista a fare il legame con il jung, bah, fattibile? Si. Bello? Nzomma.","replies":[{"poster":"Dr LouD","date":"2015-02-27T10:00:54.699+0000","up_votes":1,"down_votes":0,"body":"Si, Kalista è viable in top quanto Vayne, in più fai il patto con il Jungler ed è una easy gank.\n\n(Ovviamente non è un pick competitivo in top, come non lo è Vayne, ma è comunque giocabile, soprattutto se sei contro melee senza ctg)\n\nVel Koz è più giocato support che Mid, è un support AP che porta tanta utility e danni, viene scoraggiato nella mid a causa della sua scarsa mobilità e le sue spell non sono proprio le più facili da landare in un 1v1","replies":[{"poster":"Ucr0niA","date":"2015-02-27T10:03:23.833+0000","up_votes":1,"down_votes":0,"body":"MI chiedo a cosa serva il matchfinding a questo punto.","replies":[{"poster":"Dr LouD","date":"2015-02-27T10:04:01.291+0000","up_votes":1,"down_votes":0,"body":"Non capisco il collegamento, cosa centra il matchfinding?","replies":[{"poster":"Ucr0niA","date":"2015-02-27T10:09:59.527+0000","up_votes":2,"down_votes":0,"body":"Tanto giustifichiamo ogni tipo di ADC top, persino quelli che si basano sul Duo; completamente a discapito di tank e fighters.\nI mage non ce li caghiamo, in virtù dei nerf, se non quelli che ancora potete dire \"Meta\" e gli altri in un certo qual senso li \"cestinate\" bot, come se Support fosse un'offesa, e poi venite a dirmi che Vel è un support funzionale.\nPuò funzionare? Si, ma non perchè sia support, a questo punto ci sarebbero una miriade si altri mage giocabili in quel ruolo, ma non per questo contano support.\nSpopolano assassini ovunque, e utilizziamo un dato pick visto agli lcs come giustificazione a qualunque cosa, vedendo lo spopolare di Nida jung con catastrofici risultati wannabe.\n\nE in tutto ciò la formazione del team va a farsi benedire; mettiamo support senza utility ma solo snowballing, nessuno a prendersi i danni, e si vedono solo team ignorantissimi in cui tutti corrono al last hit.\nSecondo me tutto ciò è un incubo.","replies":[{"poster":"Dr LouD","date":"2015-02-27T10:19:00.993+0000","up_votes":3,"down_votes":0,"body":"- Nessuno sta giustificando qualsiasi adc top. Mi sembrerebbe folle mettere un Draven o una Jinx top, per esempio.\nUn altro esempio valido di adc impiegato in altri ruoli è Twitch Jungler. Adesso è un pò difficile trovarlo dato l'incremento della forza dei mostri in giungla, ma prima non era affatto raro vederlo, e funzionava anche bene.\nMa poi perchè non dovrei usare un adc top se funziona? Mettendo caso di avere un jungler e un support con tankiness e buon engage, perchè non posso pickare un adc top con cui posso counterare hard un determinato champ?\n\n- Vel koz \"cestinato\" bot???? Really? Al momento è il ruolo che gli riesce meglio, ha un burst enorme e una utility grazie al knock up aoe non indifferente, allora non avrebbero senso di esistere nemmeno Annie o Zyra Support, giusto? \nPoi da quando il Support è un'offesa?\n\n- Mage non cagati più? Vallo a dire ad Ahri, Syndra, XERATH (giusto per fare 3 esempi) che non vengono calcolati più.\n\nQui l'unica persona che sembra dipendere dal \"meta\" sei te.\n\nQuello di cui parli te è una composition che solo a low elo può esistere, nessuno con almeno due neuroni che collaborano pickera determinati champ (adc top) avendo una determinata team comp (support e jun da danni)\n\nPS: Nida jungle esiste praticamente da sempre, è solo dopo il buff alla passiva che è applicabile anche ai mob in giungla che adesso si vede molto di più, non perchè \"L'hanno pickata agli LCS\"\n\nTutto IMHO, ovviamente.","replies":[]},{"poster":"Akujii","date":"2015-02-27T12:40:22.055+0000","up_votes":1,"down_votes":0,"body":"Mamma mia va a farti una partita invece di discutere .-.\nBei tempi erano quando nella s1  potevi prendere ashe top con ryze  mentre il jungler non esisteva ç.ç\nE comunque chi ha detto la cosa che ogni champ deve essere  usato in un ruolo specifico?!\nOgni champ puo ricoprire minimo 3 ruoli  diversi...\nMi viene in mente ora come ora pantheon che è fortissimo sia mid che top che jungler.\nTu parli delle formazioni team.. ma va va .-.\nSi ci sono formazioni migliori delle altre ma basta che uno snowballi e se vanno a far benerdire.\nGioco i champ dove li vuoi giocare.","replies":[{"poster":"99Power","date":"2015-02-27T15:43:34.505+0000","up_votes":1,"down_votes":0,"body":"Ragazzi state tranquilli volevo solo un voto su chi secondo voi dovrei prendere.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"TheAwesomeJ","date":"2015-02-27T02:07:33.866+0000","up_votes":2,"down_votes":0,"body":"Rek Sai se non hai dei main jungle, potrebbe essere lui il tuo futuro prescelto ;) è molto \"tosto\" in jungla, all'inizio ha qualche problema ma subito dopo il livello 4 è un farmatore nato, per non parlare della mobilità che è a livelli altissimi\n\nKalista invece se sei in cerca di un bel adc differente dalle solite meccaniche, è agile e fa un sacco di male, premia il kiting ed è estremamente versatile in qualsiasi situazione.\n\nVel Koz al momento te lo sconsiglio, come midlaner non è facilissimo da usare dato la scarsa mobilità e i costi di mana elevati e come support invece c'è già brand che copre il suo ruolo e lo svolge molto meglio ;)\n\nTi consiglio quindi di puntare sui primi 2 Reksai o Kalista ;)","replies":[{"poster":"99Power","date":"2015-02-27T15:41:50.989+0000","up_votes":1,"down_votes":0,"body":"Penso che prenderò... {{champion:421}} Grazie.","replies":[]}]}]}