{"poster":"Saint LucÎfer","date":"2017-04-15T07:07:32.636+0000","title":"disconnecting","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"Is anyone else having problems with getting disconnected. I've been playing league for a full year now and have only lagged when there were problems with the servers. I get on today and I got disconnected almost every minute I was in game. I want to know if anyone else has this problem or if something is going on with my internet. I can get on the internet just fine and watch YouTube videos, get on Facebook, etc. Any recommendations on what to do or if anyone else is having the same problem would be greatly appreciated. Thank you.","replies":[{"poster":"Porocles","date":"2017-04-15T21:28:49.452+0000","up_votes":1,"down_votes":0,"body":"Your network could be unstable or even blocked by some software, maybe from some change in settings or even just wear and tear.  Even though you can still access other sites, you can have problems reaching specific services like the game server.  Run through the steps in the [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to troubleshoot and restore any blocks.  You can also use our [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) to auto-configure your firewall settings too.  Hopefully that will get you back in without issue!","replies":[]},{"poster":"RageQ2","date":"2017-04-15T09:18:43.561+0000","up_votes":1,"down_votes":0,"body":"I got the same problem aswell, posted my stuff in a report the bug because I knew it was for sure not on my part, but riots. A few tips for you to keep in mind when coming to terms with internet related issues is these few steps:\n\n1 - tab out of the game and search the words \"ping test\", whether you're on google or bing it should bring up an in browser ping test that checks your download speed, if you find this unusually low then it is to do with issues in your house with bandwidth (how many things are using your internet)\n2 - look for malicious software that could cause your pc to have a lot of processes (bandwidth issue) go into task manager, details, and then click the memory bar to see how much something is taking, look for suspicious software, you can do this by looking at it's description because most go by stuff like Microsoft and some can be identified by just knowing what it is. If you find something fishy then search it up online and check it's location by right clicking on the process and selection \"open file location\".\n3 - Reset your internet, if in any case you have no clue on what could be the problem, just reset your router, you can do this by turning it off for 5-10 seconds and then turning it back on.\n\nIf all else fails then you're like me, trying to figure out a problem you have no clue to what else it could possibly be.","replies":[]}]}