{"poster":"Waninoko Main","date":"2018-05-02T11:19:17.495+0000","title":"Guía de Taric \"El escudo de Valoran\"","subforum":"Guias y consejos","embed":{"description":"Espero disfruten esta guía y les sea de utilidad","url":"https://www.youtube.com/watch?v=fMF0hBskEbs","image":"https://i.ytimg.com/vi/fMF0hBskEbs/hqdefault.jpg"},"up_votes":3,"down_votes":2,"body":"Aqu&iacute; les dejo una gu&iacute;a de **Taric**{{champion:44}} , un campe&oacute;n muy util debido a que posee: Curaci&oacute;n en area, escudos, aturdimiento en area y ademas invulnerabilidad en area. Aparte de ser un buen tanque, en cierto modo podr&iacute;amos decir que tiene todo lo necesario para ser un gran soporte, espero que les sea de utilidad","replies":[{"poster":"BG King Fratus","date":"2018-05-02T13:07:05.063+0000","up_votes":2,"down_votes":0,"body":"Muy bien video, apoyo este tipo de guias ya que son las que estan faltando en LAS. Lo que si me gustaria ver es que hagas diversas guias dependiendo de un rol especifico, asi puedas mostrar mas las builds. Y algo que tambien estaria bueno (aunque obvio lleva mucho mas tiempo) es que muestres los consejos y formas de aplicar algo contra otros jugadores. Es decir, que mientras vas explicando se pueda ver en una partida.\n\nhttps://k46.kn3.net/taringa/4/F/9/E/0/2/lannss/623.jpg","replies":[{"poster":"Waninoko Main","date":"2018-05-02T15:40:35.986+0000","up_votes":1,"down_votes":0,"body":"1. diversas guías dependiendo de un rol específico tengamos en cuenta que Taric solo tiene un rol Soporte, casi nadie lo juega en otro lugar ya que sería antimeta.\n2. mostrar consejos y formas de aplicar algo contra otros jugadores, si es cierto que lleva tiempo, pero planeo hacer algo parecido en el caso de campeones como Taric ya que no estas solo en la línea y la coordinación es importante: Es decir como jugar JUNTO a Taric, cuando un compañero lo lleva  pues sacar probecho de eso\nEjemplo: si el Taric aliado marca en el chat que tiene ultimate y luego marca \"voy en camino\" significa que quiere iniciar, si cuando tira ultimate solo se fueran hacia atras perderían un valioso recurso. o por ejemplo dar sorpresas con la E, etc.\n\nEn cuanto a mostrarlo durante una partida no lo hice en la guía pues para que la gente no se centre en la partida sino en el campeón ya que tiene un fin unicamente didáctico.\nSi te gustaría ver una partida con Taric tengo un ARAM con mi main\n\nMuchas gracias por tu apoyo ñ.ñ","replies":[]}]},{"poster":"DIOS TUTI","date":"2018-05-02T11:20:15.451+0000","up_votes":2,"down_votes":0,"body":"dejo ward, estoy x entrar partida.","replies":[{"poster":"Waninoko Main","date":"2018-05-02T15:33:37.301+0000","up_votes":1,"down_votes":0,"body":"jaja no van a poder gankearte XD","replies":[]}]},{"poster":"ImNw","date":"2018-05-02T20:45:44.969+0000","up_votes":1,"down_votes":0,"body":"Yo cambiaria el Mikael por la promesa de caballero, el resto de la build me parece impecable, depende la partida, rara vez saco mikael por el hecho de que taric queda muy flan para ser un enchanter tank,pero promesa del caballero aumenta en parte tambien un poco tus habilidades defensivas y tu supervivencia. En si para mi Taric es uno de los pocos supp que su build es extremadamente amplica, pudiendo ser un support tanke,Support hibrido o support enchanter total.\n\nEn cuanto al off meta tank top, lo deje de jugar antes me parecia un excelente toplaner con un daño brutal, actualmente es muy dificil sacarlo adelante en top x q el poco sustain que tiene en top y lo item dependiente que es.","replies":[{"poster":"Waninoko Main","date":"2018-05-03T13:30:19.564+0000","up_votes":1,"down_votes":0,"body":"A mi tambien me parece muy buena idea la promesa del caballero para redirigir el daño hacia tí en lugar del mikael pero como cada partida es diferente el mikael podría ser útil en ciertas partidas para quitarle un control de masas a tu compañero. Como siempre cada partida es su mundo y la gracia del juego.\n\nY lo de Taric TOP pues si, ya es mucho mas dificil debido al nerf a concentración profunda con la que podías tomar ventaja desde lvl 2, aunque tal vez organizando un campeo en los primeros niveles se pueda llevar aún debido al efecto bola de nieve de la nueva concentración profunda.\n\nEra un risa con la antigua concentración profunda cuando se activaba en combinación con {{item:3025}} {{item:3748}} y {{item:3065}}  pero bueno RIP Taric TOP jajaja XDDD algún día lo jugaré top en pvp para el canal jajaja ñ.ñ","replies":[]}]}]}