{"poster":"Phaedra","date":"2018-02-04T21:03:00.830+0000","title":"Campeones que carrean \"solos\"","subforum":"Guias y consejos","up_votes":7,"down_votes":4,"body":"Lamentablemente, en algunos elos y, sobretodo, en vacaciones, no se puede pensar en jugar un game 5 vs 5. Es necesario saber que al menos uno de tu team no va a saber jugar, o va a estar probando el campeon, o simplemente va a tener ganas de fastidiarte el game. \r\n\r\nTeniendo en cuenta esto, cuales son los campeones que, una vez que se logra &quot;mainearlos&quot;, pueden llegar a carrear un game con estas condiciones?\r\n\r\nHabia probado con illaoi, y me venia bien, pero con el ultimo nerfeo a klepto ya no me esta rindiendo mucho. \r\n\r\nSe agradecen las sugerencias:","replies":[{"poster":"FedecarboneroUY","date":"2018-02-04T22:09:07.193+0000","up_votes":3,"down_votes":0,"body":"{{champion:114}} {{champion:105}} {{champion:41}} {{champion:55}} {{champion:11}} {{champion:75}} {{champion:58}} {{champion:92}} {{champion:67}} {{champion:157}}","replies":[{"poster":"Jigøku","date":"2018-02-05T05:14:01.893+0000","up_votes":1,"down_votes":0,"body":"Nasus necesita tiempo, del que no suele haber mucho, porque lo que no creo que deba estar en la lista","replies":[]}]},{"poster":"Tortuguita","date":"2018-02-04T21:17:43.472+0000","up_votes":3,"down_votes":0,"body":"illaoi sin klepto sigue siendo uno de los tops mas rentables de la season en cuestión de soloq y aun mas las (?. Luego tienes a todo el elenco de tank-asesinos  que te carrean aunque no tengas pulgares oponibles , Ejem: Kled , Vlad , Ornn , Cho'gath , Kennen , etc.\n\nObviamente tenes que reventarle el cráneo al adversario de tu linea (con ninguno de los mencionados es tan difícil) te metes el buen roam tp y antes del min 20 ganas la partida de una forma pasmosa.\n\nSobre \"Lamentablemente, en algunos elos y, sobretodo, en vacaciones, no se puede pensar en jugar un game 5 vs 5\" lamento informarte que siendo vacaciones o no hasta Maestro 200 puntos sigues estando sin team , que esta bien , esto es SOLOq debemos recalcar :P","replies":[]},{"poster":"Káÿn","date":"2018-02-04T21:14:16.842+0000","up_votes":2,"down_votes":0,"body":"Para mi:\n\nDiana{{champion:131}} \nIrelia{{champion:39}} \nYasuo{{champion:157}} \nTryndramere{{champion:23}} \nYi{{champion:11}} \nVayne{{champion:67}} \n\nEntre otros, la gran mayoria que puse acá tienen gran poder en las tf y además tienen la capacidad de poder limpiar una linea bastante rapido lo cual , beneficiaria si tenes la estrategia de realizar un split push, ya que la unica forma de \"ganar solo\" es realizando split push.","replies":[{"poster":"Šeiya","date":"2018-02-04T21:15:39.450+0000","up_votes":3,"down_votes":0,"body":"{{champion:92}}","replies":[{"poster":"Káÿn","date":"2018-02-04T21:16:45.302+0000","up_votes":1,"down_votes":0,"body":"Claro! no puse todos porque sino estaria una hora jaja.","replies":[]}]}]},{"poster":"KzG Arconte","date":"2018-02-05T06:17:41.781+0000","up_votes":2,"down_votes":0,"body":"Ninguno.\n\nhttps://drive.google.com/file/d/0B1YmQ7AnpduJYmdubGtMZ2hkTEU/view?pli=1 LEE.","replies":[{"poster":"thearsonist","date":"2019-01-27T01:21:07.440+0000","up_votes":1,"down_votes":0,"body":"Gracias por la guia! Voy a probar que tal me va.","replies":[]}]},{"poster":"Pedrigo","date":"2018-02-04T23:41:49.865+0000","up_votes":2,"down_votes":0,"body":"El juego está balanceado de forma de que no puedas carrear solo almenos de que seas extremadamente bueno, aún así hay champs que se valen muy bien por si mismos, y pueden llegar a matar a múltiples enemigos o fedear a sus aliados, y creo que en la línea donde mejor se puede lograr esto es en mid, si lográs ganar tu línea podés hacer estragos en bot, top o hasta en la jungla, te recomiendo champs como orianna, lux, o algunos asesinos con buen roaming como fizz o talon, de forma de que puedas meter mucho daño de forma rápida dejando atrás a los enemigos, o desgastandolos de forma segura y haciendo las team fights practicamente solo si estás muy fed","replies":[{"poster":"Phaedra","date":"2018-02-05T02:00:15.475+0000","up_votes":1,"down_votes":0,"body":"Mira, hace como 3 años que mi rol principal es mid. Tenia buenos win ratios con lux y velkoz...este ultimo mas que nada en partidas con tanques, donde gracias a la pasiva los deleteaba sin que se dieran cuenta. Pero desde la season 8 no puedo casi ganar con ellos. Es como si fuera una lane distinta, no se. Incluso con veigar o annie que me servian, ahora no. Estoy encontrando mucho mas placentero y facil de carrear el top o adc.","replies":[{"poster":"Pedrigo","date":"2018-02-05T02:24:21.397+0000","up_votes":1,"down_votes":0,"body":"Y eso que es dificil carrear de adc, por que dependes del support bastante, habrá sido suerte nomás la tuya, o muy mala suerte, pero con mid tenés mucha más independencia y se nota más tu desempeño individual","replies":[{"poster":"Phaedra","date":"2018-02-05T02:48:03.872+0000","up_votes":1,"down_votes":0,"body":"Estoy usando MF adc, con el build de lethalidad. basicamente oneshotea al adc enemigo en lane. Asi que si tu sup es bueno carreas, y si es malo lo usas de carnada. Q, E R y mueren los dos. No le das tiempo a un taric de que ultee directamente","replies":[{"poster":"Pedrigo","date":"2018-02-05T03:57:04.885+0000","up_votes":1,"down_votes":1,"body":"Entonces si ya podés carrear bien... Por qué el post? xd","replies":[{"poster":"Phaedra","date":"2018-02-05T18:09:47.528+0000","up_votes":1,"down_votes":0,"body":"Que carrea en una situacion normal, en la fase de lane. Pero es muy dificil cuando tu team fedea mucho o no aporta. por eso el motivo del posteo, que campeones carrean \"solos\".","replies":[]}]}]}]}]},{"poster":"Pedrigo","date":"2018-02-04T23:43:37.129+0000","up_votes":1,"down_votes":1,"body":"Cabe recalcar que si bien jungla es el rol donde tu rendimiento es más determinante para fedear a tu equipo, si tu equipo es muy malo no podrás hacer casi nada por que tu desempeño se basa en tus compañeros desde muy temprano, cosa que no pasa en mid o top","replies":[]}]},{"poster":"OzymandiasV","date":"2018-02-06T11:28:26.889+0000","up_votes":1,"down_votes":0,"body":"{{champion:84}} {{champion:245}} {{champion:55}} {{champion:238}} {{champion:105}} {{champion:126}} {{champion:121}}","replies":[]},{"poster":"Rumshum","date":"2018-02-06T02:32:44.203+0000","up_votes":1,"down_votes":0,"body":"Complicado de explicar amigo, hay campeones y campeones. \nCon esto me refiero a que cada campeon pertenece digamos a una \"mini catagoria\" ejemplo... \nLux! Lux sirve para deletear 1-2 champs con su full combo. Y tras eso es una presa facil. \nLuego hay campeones de juego solitario, Nasus/trynda. \nHay tiradores (Lo mas parecido a lo que buscas, que como te comentaron te recomiendan a vayne y yo te recomiendo a Jinx ;)) \nY asi sucesivamente. \nSi te tuviera que decir campeones asi rapidamente\nYi\nYasuo\nFizz\nNasus\nTryndamer\nJinx\nVayne\nZac\nLeona\nNami\nSaludos! Pero acordate, no es lo mismo un tipo 10/3 que juega solo a el contra 5 que van 1/2\n:) 1 vs 5 mala idea amigo! Por lo que de todas formas necesitaras de tu equipo! Saludos y suerte!","replies":[]},{"poster":"POETA DEL TRUENO","date":"2018-02-06T00:40:20.398+0000","up_votes":1,"down_votes":0,"body":"Hmm yo pienso que yasuo , por que no usa maná y sus CD son muy bajos ayer subí a b4 con el y otro puede ser akali con el ítem sablepistola más botas de penetración deleteas al adc y al mid y a los tanque también otra cosa es que se la pudes armarla  híbrido entonces aunque tengan armadura o res mágica pega mucho , también la podes jugar top , la clave de estos champs y muchos otros es hacer snowbool , haciendo roaming a bot cuando puedas y estés seguro de poder matar al adc y al supp en bronce si pasa eso ya ganaste por que se flamean estre  ellos y no es raro que empiecen a trolear o a andar solos y es gg.","replies":[]},{"poster":"Marcelitou","date":"2018-02-05T01:51:33.773+0000","up_votes":1,"down_votes":0,"body":"En mi opinión, campeones que pueden generar la victoria solos son: Yasuo, Jax, Nasus, Vayne, etc. A mi por lo general me resultan bastante esos campeones, el problema se encuentra que si el equipo enemigo tiene mucho hard cc quizás se complique.","replies":[]}]}