{"poster":"Phaedra","date":"2017-12-28T22:30:08.564+0000","title":"No cry post","subforum":"Guias y consejos","up_votes":4,"down_votes":1,"body":"Parece un cry post, pero no lo es. Tengo un problema, el cual necesito solucionar y es el siguiente:\r\n\r\nHace varios d&iacute;as, subo de divisi&oacute;n y autom&aacute;ticamente me pone con gente MUY MALA. Bajo de divisi&oacute;n. Autom&aacute;ticamente, los games son normales, con equipo parejos, gano o pierdo, pero buenos games. Subo de liga y autom&aacute;ticamente de nuevo gente MUY MALA. No hablo de unrankeds. Gente probando picks raros, flamers, gente que se va afk o simplemente gente MALA para ese elo. \r\n\r\nOpt&eacute; por ayudar, no di&oacute; resultado. Opt&eacute; por splitpushear, no di&oacute; resultados. Son games IMPOSIBLES, al menos para alguien como yo. Se supone que este juego es 5 vs 5, as&iacute; que abstenerse los que digan que no subo por mi nivel: se supone que tus compa&ntilde;eros te tiene que ayudar, no es un juego donde te pones 4 tipos en una mochila.\r\n\r\nPor lo tanto, sin flammear, con cr&iacute;ticas constructivas: &iquest;Qu&eacute; consejos me dan para poder superar esta barrera? o simplemente tengo que esperar a marzo y el fin de las vacaciones? \r\n\r\nGracias.","replies":[{"poster":"Ootel","date":"2017-12-28T22:47:49.793+0000","up_votes":1,"down_votes":0,"body":"ahii esta tu techo, aceptarlo es el primer paso.","replies":[{"poster":"Phaedra","date":"2017-12-28T23:18:05.896+0000","up_votes":1,"down_votes":0,"body":"Es que justamente es el tema. Si los games fuesen parejos, yo no pudises estar al nivel, muriendo mucho, quedando corto en el farm, etc...te diria: Si, es mi techo. \n\nPero cuando perdés por gente mala no me parece. Además, no hay un mucha diferencia entre 80pts en una division y 20pts en la siguiente. Es el mismo elo.","replies":[{"poster":"TiToldero","date":"2017-12-29T00:27:56.414+0000","up_votes":2,"down_votes":0,"body":"Te tenes que poner al team en la mochila pa no queda otra. Te recomiendo no jugar mas de 2 rankeds por dia, sino te tilteas y cuando te toda el team bueno sos vos el problema. Ya va a pasar segui probando!!","replies":[{"poster":"Phaedra","date":"2017-12-29T15:12:09.278+0000","up_votes":1,"down_votes":0,"body":"Creo que jugar menos podria ser la solucion. Pero me aburren tanto las normales...jeje. Saludos!","replies":[]}]}]}]},{"poster":"exrex","date":"2017-12-29T00:58:10.468+0000","up_votes":1,"down_votes":0,"body":"Es que hace como 5 años que jugas y siempre te pasa lo mismo, no es solo de ahora. \nIntenta jugar otra linea o un campeon distinto. Fijate cual es tu mejor campeon en cada linea y juga nada mas con esos.\n","replies":[{"poster":"Phaedra","date":"2017-12-29T15:16:03.773+0000","up_votes":1,"down_votes":0,"body":"Juego desde S1. Fui bronce y silver en NA, silver en LAS. LLegue a gold 1 promo a platino y deje de jugar. Volví, sin tiempo por laburo y estudio, y cometí el error de rankear y arruinar el elo. El año pasado, con paciencia, volvi a subir a oro en ambas colas. \n\nJugue toda mi vida mid y jg, ahora juego top (con un 61% de win rate, lo cual no es tan malo) y adc.\n\nComo dijeron mas abajao, creo que lo mejor es jugar menos rankeds diarios por el tilteo.","replies":[]}]}]}