{"poster":"Gammelfritzen","date":"2015-11-07T13:54:42.328+0000","title":"Diamant V Supporter sucht nach Ranglistenteam für S6","subforum":"Clans & Teams","embed":{"description":"Summoner Lookup with statistics, ratings, LoLSkillScore and more for Gammelfritzen, a League of Legends summoner on the Europe West region.","url":"http://www.lolskill.net/summoner/EUW/Gammelfritzen/summary","image":"http://static.lolskill.net/img/tiers/192/diamondV.png"},"up_votes":1,"down_votes":0,"body":"Hallo.\r\n\r\n**&Uuml;ber mich:**\r\nIch hei&szlig;e Alexander, bin 17 Jahre alt und stamme aus NRW. Ich besuche zur Zeit noch das Gymnasium und bin in der 12. Klasse. Mein momentanes Elo ist Diamant V und ich war am Ende der Season 4 Platin II.\r\nSo genau wei&szlig; ich nicht mehr seit wann ich spiele. Jedenfalls gab es zu der Zeit noch kein EUW- und EUO- Server, weil ich deswegen auf dem amerikanischen Server gespielt habe.\r\nMeine Hobbys sind neben League of Legends, Schwimmen, Animes und (selten) andere Spiele. \r\nIn League of Legends hei&szlig;e ich Gammelfritzen und spiele sehr gerne als Supporter\r\nMeine Onlinezeiten sind Wochentags von ~18Uhr- 23:00Uhr und am Wochenende bin ich flexibel.\r\nDie Onlinezeiten k&ouml;nnen variieren durch z.B. Klausurvorbereitungen.\r\nKontaktm&ouml;glichkeiten sind Whatsapp, Skype und Curse Voice.\r\n\r\n\r\n**Mein(e) Wunsch/Vorstellung:**\r\n\r\nIch selber besitze eine gewisse Kritikf&auml;higkeit und w&uuml;rde mir w&uuml;nschen, dass bei Problemen die durch mich verursacht werden mit mir &quot;normal&quot; gesprochen wird und mir zur Not, bei vorhandener Unwissenheit, Verbesserungsvorschl&auml;ge von Teammitgliedern gegeben werden um solche Fehler nicht zu oft zu wiederholen. \r\nMeiner Meinung nach ist es wichtig, dass jeder aus einem Team bereit ist sich zu verbessern und dazu geh&ouml;rt nun mal die Kritik anderer, welche aber nur auf einer sachlichen Ebene, meines Erachtens, seinen Zweck erf&uuml;llt. Es sollte das Ziel von jedem sein sich stetig zu verbessern und nicht mit einem begrenzten Wissen zufrieden zu sein. Ich w&uuml;rde mich freuen, neue Bekanntschaften zu machen.\r\n\r\n\r\n\r\n**Das sollte mir das Team bieten:**\r\n\r\nIch selbst w&uuml;rde gerne mein eigenes Spielverhalten verbessern. Deswegen bin ich auf der Suche nach einem Ranglistenteam, welches das Spiel gerne, aber auch ernst spielt. W&uuml;nschenswert w&auml;re es f&uuml;r mich auch, mit dem Team zusammen an Cups teilnehmen zu k&ouml;nnen. Ein weitere Bedingung ist, dass das Team auch auf meinem Niveau ist und dadurch die Teammitglieder Erfahrung mitbringen und mir hoffentlich auch Ratschl&auml;ge geben k&ouml;nnen um besser zu werden. Teamspeak w&auml;re eine weitere Vorraussetzung, da Kommunikation bei einem Teamspiel unerl&auml;sslich ist. Als auch regelm&auml;&szlig;iges im vorraus geplantes Training.\r\n\r\n\r\nDankesch&ouml;n an dieser Stelle, dass die Zeit aufgebracht wurde um meinen Thread durchzulesen.\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\n\r\nAlex \r\n \r\nP.S.: Ich habe mich noch nicht so lange die Lane Support f&uuml;r mich entdeckt. Seitdem spiele ich diese aber intensiv. Leider nur noch auf Platz 544 mit Veigar in der Weltrangliste. Best 364.","replies":[{"poster":"Gammelfritzen","date":"2015-11-08T18:46:03.614+0000","up_votes":1,"down_votes":0,"body":"Pushkick! {{champion:64}}","replies":[]}]}