{"poster":"TheUrps","date":"2015-02-07T03:03:11.275+0000","title":"[Championvorschlag] Velfanthir [vəlfɑɴθir']","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":0,"body":"Hallo Zusammen, ich würde euch gerne mal Velfanthir (der Geist des Hohen Nordens) vorstellen.\n\nDieser Champion ist vollkommen von mir erdacht und ich bitte euch, ach was ich flehe euch an, Kritik an ihm zu hegen! Das was in der Überschrift nach Velfanthir in den eckigen Klammern steht ist übrigens die Phonetische oder auch Lautschrift des Namens, also wie er ausgesprochen wird!\n\nHerkunft: [Frejlord](http://img3.wikia.nocookie.net/__cb20130823193315/leagueoflegends/de/images/thumb/a/a8/Valoran.jpg/1280px-Valoran.jpg) (streitet dies aber ab, daher nennt er seine Herkunft \"Hoher Norden\") Quelle der Karte: http://de.leagueoflegends.wikia.com/\n\nLeben:                         520 (+ 75 Pro Stufe)                            \nLebensregeneration: 7 ( + 0,25 Pro Stufe)\nMana:                          300 (+ 60 Pro Stufe)                           \nManaregeneration:    6 ( + 0,5 Pro Stufe)\nAngriffsschaden:        50 (+4 Pro Stufe)                                 \nRüstung:                     21 ( + 3 Pro Stufe)\nAngriffstempo:           0,792 (+3% Pro Stufe)                        \nMagieresistenz:         15 ( + 2,5 Pro Stufe) \nLauftempo:                350\n\nVorgeschlagene Rollen: Support(Fernkämpfer), AP-Midlaner(Fernkämpfer)\n\n\n\n***Fähigkeiten***\n\n*Passive Fähigkeit - Weisheitsend*\n\nBeim Töten von Champions erreichen Velfanthir mit einer warscheinlichkeit von 20% Geistesblitze, welche 5 Sekunden anhalten. In dieser Zeit verursacht er um 50% verminderten Absoluten Schaden mit seinen Fähigkeiten und Normalen Angriffen (Aktivierungen von Items sind von diesem Effekt ausgeschlossen und beenden diesen.)\n\n\n\n*Q - Erdachtes Leid*\n\nKosten: 85 Mana pro Sekunde\nReichweite: 900 Einheiten\nAbklingzeit: 12/15/17/17/17 Sekunden\n\nAktiv: Velfanthir maniupuliert einen Gegner, über seine mentalen Kräfte, so dass dieser Schmerzen erleidet! \nErdachtes Leid wird durch Hochwerfen, Verstummen oder Unterbrechungen (wie z.Bsp:{{champion:133}} 's E) unterbrochen, nicht aber durch Festhalten ({{champion:25}}'s  Stun), Blenden {{champion:17}} 's Q) oder Verspottungen!\n\nMagischer Schaden: 65/80/90/120/145 (+50% Fähigkeitsstärke)\n\nVelfanthir kann sich in der Zeit in der er Erdachtes Leid verwendet nicht bewegen, kann keine anderen Fähigkeiten wirken und auch keine Angriffe vollziehen. Durch erneutes Aktivieren kann die Fähigkeit beendet werden\nSein Ziel kann sich aus der Fähigkeiten befreien in dem es aus der Reichweite entfernt.\n\n(Kann auch auf Monster und Gegnerische Vasallen angewendet werden)\n\nPassiv: Velfanthir lernt hinzu, wobei er für jede ausgeführte Sekunde von Erdachtes Leid  5 Reichweite[für Erdachtes Leid] (bis zu einem Maximum von 1100 Einheiten) hinzubekommt!\n\n\n\n*W - Wissen ist Macht*\n\nAbklingzeit: 20/19/18/16/14 Sekunden\n\nVelfanthir verstärkt einen Verbündeten wodurch dessen Attribute verbessert werden!\n\nAngriffsschaden: +5%/ +10%/ +15%/ +18%/ +22%\nFähigkeitsstärke: +5%/ +7%/ +9%/ +12%/ +16%\nRüstung:               +5%/ +10%/ +15%/ +17%/ +20%\nMagieresistenz:   +5%/ +7%/ +12%/ +15%/ +17%\nLauftempo:          +1%/ +3%/ +5%/ +7%/ +10%\n\n(Wissen ist Macht kann auch auf Vasallen angewendet werden!)\n\n\n\n*E - Gesammeltes Wissen*\n(Passive Fähigkeit)\n\nFür jedes Item in welchem \"Boshafter Kodex\"[{{item:3108}}] oder \"Verstärkender Wälzer\"[{{item:1052}}] verwendet wurde erhält Velfanthir +15 Fähigkeitsstärke. Durch Tötungen und Unterstützungen von Champions erhält Velfithar Wissen! Jede Steigerung von Wissen erhöht den Passiven Effekt von Gesammeltes Wissen um +5%  (bis zu einem Maximum von +100%)! Wird Velfanthir getötet so verfällt die Hälfte der Steigerungen von Wissen.\n\n\n\n*R - Aus den Angeln geraten*\n\nAbklingzeit: 120 / 90 / 60 Sekunden\n\nVelfanthir ist so erbost über das stupide daherkommen seiner Gegner das er seine gesamte Fähigkeitsstärke für 20/25/30 Sekunden in Angriffsschaden umwandelt.\n\nVelfanthir verursacht nur noch mit seinen normalen Angriffen, welche zu Nahkampfangriffen werden, Schaden, sein Schaden durch Fähigkeiten wird zu 0 und \"Gesammeltes Wissen\" setzt aus! Erneutes Aktivieren von \"Aus den Angeln geraten\" beendet die Fähigkeit vorzeitig!\n\nAngriffsschaden: +100% / +150% / +200% Fähigkeitsstärke (Stand: Vor Aktivierung von \"Aus den Angeln geraten\")\nFähigkeitsstärke: -100% / -100% / -100% Fähigkeitsstärke (Stand: Vor Aktivierung von \"Aus den Angeln geraten\")\n\n\nNach Ablaufen der Dauer, oder erneuter Aktivierung, erhält er seine zuvor verlorene Fähigkeitstärke wieder, sein Angriffsschaden wird wiederhergestellt, und er erhält ein temporäres Schild (über 5/7/10 Sekunden) in Höhe von 50% des an gegnerischen Champions verursachten Schadens!\n\n\n\n\n\n***Geschichte***\n\n\nÜber Velfanthir ist nur wenig bekannt. Viel wird berichtet und viel wird erzählt, aber was davon wahr ist oder was nichts weiter als Kokolores darstellt!\n\nEs ist bekannt das er aus Frejlord stammt, auch wenn er dies nicht wahrhaben will, ja dies sogar abstreitet! Auch ist bekannt das er sich in einem Wissenskampf mit Anivia befand, diesen gar Gewann!\n\nDoch, wer seine Eltern seien, von welchem Stamm er stammte, oder gar sein Name ist nicht bekannt!\n\nVelfanthir ist nichts als ein Deckname, ein Name welcher in einer alten Vergessen sprache einmal \"Niemand\" bedeutet haben muss!\n\n\n\"Wissen ist Macht, und ich geben euch keine Macht über mich!\" - Velfanthir\n\n\n\n\n\n\n\n***Aussehen***\n\n\nVelfanthir sollte eine stark pigmentierte Person sein (ein \"Schwarzer\"). \nEr sollte ziemlich gebildet Aussehen, mit einem Buch in der Hand welches Stark wie ein {{item:3165}} aussieht.\nBesonders zeichnet ihn sein fliegendes Voranbewegen aus, welches in seiner Ultimativen Fähigkeit in ein wütendes Laufen übergeht.\n\n\n\n\nIch würde mich sehr über eure Rückmeldungen freuen und natürlich auf Verbesserungsvorschläge oder allgemeine Kritik, und natürlich auch auf Hinweise auf Rechtschreibfehler :D!\n\n\n\nMFG TheUrps/Philipp\n\n\nedit: \n- etwaige Rechtschreibfehler behoben\n- Abklingzeiten für die Fähigkeiten hinzugefügt\n- vorgeschlagene Rollen hinzugefügt\n","replies":[{"poster":"Alone Musk","date":"2015-02-07T22:01:46.696+0000","up_votes":3,"down_votes":0,"body":"Schicke idee eigentlich. also den sollte man ins game einfügen :D","replies":[{"poster":"TheUrps","date":"2015-02-07T23:24:45.145+0000","up_votes":1,"down_votes":0,"body":"ouhhh danke :D","replies":[]}]},{"poster":"4ssec93","date":"2015-02-07T09:04:25.022+0000","up_votes":2,"down_votes":0,"body":"kleiner rechtschreibfehler: manupuliert -> manipuliert. sehr gute idee, insbesondere die Ult finde ich ganz passabel. aber sind seine normalen Angriffe eher fernangriffe oder nahkampfangriffe? ich denke mal fernkampfangriffe. würde es sich dann nicht mehr lohnen ihn als ap-attackspeed zu spielen, wie man das des öfteren bei Kayle sieht? Dann finde ich, dass er ein bisschen zu sehr in die Richtung geht, wie die e von kayle. aber ich finde Velfanthir sehr gut mit seinen Abilities\n\nLG 4ssec67 und 4ssec93","replies":[{"poster":"TheUrps","date":"2015-02-07T13:08:19.565+0000","up_votes":1,"down_votes":0,"body":"Danke für die Idee, das hatte ich leider noch nicht einbezogen!\n\n\nEr wäre ein ein Fernkämpfer,wobei er sich in seiner Ultimativen Fähigkeit in einen Nahkämpfer wandelt (praktisch die Umkerung Kayle's E)","replies":[]}]},{"poster":"henshi","date":"2015-02-07T06:24:38.786+0000","up_votes":2,"down_votes":0,"body":"Alles sehr Schön gute idee , nur 'Schwarz' mag ich selber nicht so ich bitte 'Dunkelhäutig' zu sagen :)","replies":[{"poster":"TheUrps","date":"2015-02-07T13:05:48.748+0000","up_votes":1,"down_votes":0,"body":"ja \"Schwarz\" war auch nur die einfache Formulierung von \"Maximal pigmentiert\" :D","replies":[]}]},{"poster":"Skalety","date":"2015-02-07T03:32:54.159+0000","up_votes":2,"down_votes":0,"body":"Die Q-Reichweite von 900 ist definitiv zu hoch. Das sollte man an Fiddlesticks Entziehen-Reichweite anpassen, denn wenn man es mit Nidalees Speeren vergleicht, sie hat eine maximale Reichweite von 1200, glaub' das war so. \nRechtschreibfehler, die ich spontan gefunden habe: \"gesammte[...]\" > gesamte ; \"Gegner das[...]\" > Gegner, (so)dass\nAber sonst klingt es sehr interessant. :)","replies":[{"poster":"TheUrps","date":"2015-02-07T13:06:47.752+0000","up_votes":1,"down_votes":0,"body":"1. 900 Einheiten ist so die Reichweite der Ahri Q, noch dazu er sich in seiner Q nicht bewegen kann halte ich diese Reichweite eigentlich für passabel\n2. Danke für die Hinweise, ich werde das mal Fix ändern :;D","replies":[]}]},{"poster":"PANBU","date":"2015-02-08T04:18:01.243+0000","up_votes":1,"down_votes":1,"body":"du must das noch mal beabeiten .iCh meine die fähigkeiten sind schon cool aber ich denke das dieser camp auch etwas aleine hinkriegen muss denn alle fähikeiten basiren darauf eine VB zu buffen","replies":[{"poster":"TheUrps","date":"2015-02-08T17:20:58.612+0000","up_votes":1,"down_votes":0,"body":"Ich muss dir hier Unterstellen das du etwas kognitiv suboptimiert bist, denn keine Fähigkeit mit Ausnahme seiner W Bufft einen Verbündeten, jegliche weitere Fähigkeiten machen Schaden oder geben ihm einen Effekt","replies":[]}]}]}