{"poster":"LL whettergreen","date":"2015-11-05T16:30:33.247+0000","title":"baneado hasta el 18","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"yo igual estoy baneado hasta el 18 supuesta mente es por cambio de ip y yo viajo demasiado por Chile no duro mas de un mes en una ciudad la causa que soy militar y me acaban de banear soy platino 4 reviso mi cuenta con otra acc y sale que no tengo ni mi marco y riot ni responde y ya a varios le ah pasado pliz incluso me dedico a hacer vídeos en youtubbe enseñando como jugar con los campeones .-. y en mis mismos vídeos digo que tuve que viajar o que problemas estoy teniendo u que tengo que ir donde mis amigos a jugar para grabar un vídeo https://www.youtube.com/watch?v=mLRLzlYLuvM aqui esta la muestra de mi canal ","replies":[{"poster":"Khimea","date":"2015-11-05T16:59:36.162+0000","up_votes":2,"down_votes":1,"body":"Siendo militar ¿no te enseñan a escribir?... {{champion:32}} \n\nSos militar, haces videos en youtube, viajas mucho y cambias de IP, no entiendo como te da el tiempo para tanto, cuando un militar trabaja dias dentro de los objetivos xD.{{champion:59}}","replies":[{"poster":"LL whettergreen","date":"2015-11-05T17:34:32.512+0000","up_votes":1,"down_votes":0,"body":"siendo militar me hacen cambiar de regimiento para instruir a los nuevos conscriptos y tengo el tiempo que me sobra para grabar los vídeos siempre hay tiempo para todo men y se que escribo bastante mal y no todos los militares trabajamos días enteros es dependiendo que cargo uno tiene","replies":[{"poster":"Khimea","date":"2015-11-05T17:42:28.587+0000","up_votes":1,"down_votes":0,"body":"Yo trabajo con horario de oficina, luego gymnacio 2 horas y me da el tiempo para jugar solo 1 hora, sigo sin entender jajaja, pero bueno. Si jugas en los regimientos, esta genial y te lo acepto xD.","replies":[]}]}]},{"poster":"ShäG0","date":"2015-11-07T02:19:59.046+0000","up_votes":1,"down_votes":0,"body":"Realmente aun no pasa nada, quiero jugar :G!!!","replies":[]},{"poster":"CNdeF","date":"2015-11-06T18:30:49.676+0000","up_votes":1,"down_votes":0,"body":"Me paso exactamente lo mismo! Es por un supuesto MMR Boosting, y nos van a quitar todos los premios que ganemos por las clasificatorias (skin, marco,etc..) Y yo tambien me contacte con el soporte porque tiene que ser un error, y todavia sigo esperando respuesta. Fue hace 2 dias tambien. Puse un post tambien recien para ver si alguien me da bola por aca por lo menos. Es un garron esto que vos subis luchando como podes y te banean mal.  Es una verguenza. Saludos","replies":[]},{"poster":"ShäG0","date":"2015-11-06T00:20:36.537+0000","up_votes":1,"down_votes":0,"body":"Me paso lo mismo,  la solución que dan es notificar a través del Soporte de RIOT pero lo envié cerca de las 11 AM y aun no dan respuesta. Que es lo que debemos esperar si aun no dan una respuesta. \n\nSaludos.","replies":[]},{"poster":"Curtedz","date":"2015-11-05T16:38:37.644+0000","up_votes":1,"down_votes":0,"body":"Contacta con Soporte de Riot para poder arreglar tu problema. Ahí ellos te pueden dar la respuesta adecuada y precisa.\nhttps://support.riotgames.com/hc/es","replies":[{"poster":"LL whettergreen","date":"2015-11-05T16:39:11.876+0000","up_votes":1,"down_votes":0,"body":"si lo eh echo pero nada","replies":[]}]}]}