{"poster":"MoNaZeR","date":"2017-11-08T15:55:16.254+0000","title":"Banned and absolutely no reason provided.","subforum":"Player Behavior","up_votes":10,"down_votes":7,"body":"Hello , i&#039;ve been playing this game for 5 years now. I&#039;ve got many weird shit from riot before (like banning me for 14 days then just saying &quot;we&#039;re sorry it was a mistake&quot; back in season 5)\r\nNow i logged in and found that i am permanently banned ; after days of confirming my ownership they told me that my account was permanently banned because &quot;it got hacked many times&quot;.\r\nWOW! Literally my account was never hacked and i never reached them to recover it. I told them maybe because my ip is moving alot recently cuz im moving alot , they refused to give an answer nor a proof.\r\nIf any of riot agents sees this , you&#039;re a thief and a liar; you stole my money and banned me without even giving a proof.\r\nAlso looks like its not the first time riot does smething like this , here read this https://boards.euw.leagueoflegends.com/en/c/player-behaviour-en/UpcBltau-wrongfully-banned-please-help-me\r\nI allow any agent to discuss publicly private informations about my account here infront of everyone , but i know that you wont answer.","replies":[{"poster":"Jo0o","date":"2017-11-08T16:23:04.923+0000","up_votes":6,"down_votes":0,"body":"Keep submitting support tickets. Security issues can get resolved, assuming you are who you say you are.","replies":[]},{"poster":"Riot Tantram","date":"2017-11-08T22:45:18.926+0000","up_votes":5,"down_votes":0,"body":"This account isn't banned. Are you talking about a different account?","replies":[{"poster":"MoNaZeR","date":"2017-11-09T11:16:05.703+0000","up_votes":1,"down_votes":1,"body":"yeah its not this account , looks like i cant even post from the banned account \ni have posted this on the na boards because i often see moderators reply here \nthe banned account's USERNAME is : maitreyi2003 \nserver : euw","replies":[{"poster":"Riot Tantram","date":"2017-11-09T19:06:15.146+0000","up_votes":3,"down_votes":0,"body":"There are quite the number of case notes on your account. It's shouldn't be a surprise as to why you are banned, and you should be well aware what is going on. I'm not going to share any information here because I cannot validate that it your account. You will need to contact player support. They will be more than happy to provide further information for you.","replies":[{"poster":"MoNaZeR","date":"2017-11-10T01:36:02.092+0000","up_votes":1,"down_votes":4,"body":"This is their final answer , 0 proofs and reasons given for this ban,  if you can help me please send me a message or something\n\"We will not be able to disclose anything related to the investigation done in regards to this account due to security reasons.\n\nIf you have other questions related to another different topic, please let me know. If not, future responses related to it will be left unanswered.\"","replies":[{"poster":"SparklingLama","date":"2017-11-11T21:20:29.956+0000","up_votes":1,"down_votes":5,"body":"typical riot response.","replies":[]}]}]}]}]},{"poster":" Eridu","date":"2017-11-10T01:48:01.144+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"MoNaZeR","date":"2017-11-10T09:46:01.267+0000","up_votes":1,"down_votes":1,"body":"yeah but how did i exactly violate thode terms? at least give me a proof as a respect for the time, money and effort i did put in this game","replies":[]}]},{"poster":"wet pool bread","date":"2017-11-08T18:39:10.672+0000","up_votes":2,"down_votes":15,"body":"they dont care, they got their money off u lol... have fun trying and good luck","replies":[{"poster":"General Esdeath ","date":"2017-11-11T10:01:16.356+0000","up_votes":2,"down_votes":1,"body":"\"They don't care\" because they removed a toxic player","replies":[{"poster":"MoNaZeR","date":"2017-11-11T13:53:06.438+0000","up_votes":1,"down_votes":3,"body":"<REMOVED BY MODERATION> my account got banned because it got hacked many times as they say","replies":[{"poster":"General Esdeath ","date":"2017-11-11T20:08:42.747+0000","up_votes":2,"down_votes":0,"body":"Looks like someone is not only toxic, but can't protect their account. At some point, it's more likely you're just account sharing. And besides, that account has many strikes on it.","replies":[{"poster":"MoNaZeR","date":"2017-11-12T16:05:54.134+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"General Esdeath ","date":"2017-11-12T20:48:32.383+0000","up_votes":1,"down_votes":0,"body":"Actually boards are monitored too, and your comments can be removed and eventually you can be banned from the boards. \n\nYou could have just dragged chat box off screen lol","replies":[]}]}]},{"poster":"Ulanopo","date":"2017-11-12T20:46:12.217+0000","up_votes":1,"down_votes":0,"body":"Please remember to be respectful of other posters.","replies":[]}]}]}]},{"poster":"Pixie Storm","date":"2017-11-12T18:51:51.981+0000","up_votes":1,"down_votes":0,"body":"Truth be told: The account was confiscated because it was bought.","replies":[]}]}