{"poster":"elias2201","date":"2015-12-29T21:58:53.143+0000","title":"Teemo, Fanatismo o Rinde de Verdad?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"hola, hace una semana me compre a {{champion:17}}  y la verdad me a facinado juego casi todos los puestos con el(ya que para mi es polifuncional), el tema es el siguiente estuve ganando 6-7 partidas de 10. con esa cantidad puedo asumir que rinde o solo es mi fanatismo por jugarlo???","replies":[{"poster":"ZeNch","date":"2015-12-29T22:20:55.493+0000","up_votes":3,"down_votes":0,"body":"se lo esta viendo en clasificatorias como un pick pusher... siempre que lo vi dejaba pocas setas en el mapa, las usaba para pushear (diamante para arriba)\nsi sabes sacarle provecho jugalo.... no importa si esta en meta no importa si es bueno o malo vs quien sea... importa que a VOS te vaya bien y que VOS lo sepas jugar","replies":[]},{"poster":"Clostridium","date":"2015-12-29T22:35:52.816+0000","up_votes":2,"down_votes":1,"body":"En mi opinion es mas fanatismo, yo nunca he visto un teemo carrear, por lo menos en plata y el unico con score decente que he visto fui yo que lo use de soporte que saque 19/5 (una cosa asi) solo una ves y el otro team era muy muy muy malo.\n\nEn mi opinion no es un campeón muy solido sobre todo con ese relampagete de la maestria sin escape es instakill de hecho por casualidad hoy me he jugado tres partidas con talon y en dos me salio un teemo de oponente y es instakill es que revienta no tiene nada que hacer, con panteon me ha pasado lo mismo pfff explotan.\n\nEn la buena onda te recomiendo otro campeón viejo, yo lo uso de soporte en todo si te sirve y rinde bastante mas que de top; considerando que no dejas al team sin un tank o un offtank o con menos ceceo y contra adcs es bastante decente; pero en resumen te diria que no.\n\nAparte es un campeon con muy mala reputación el pick selección te van a flamear de lo lindo por tomarlo.\n\nComo otro punto yo no lo encuentro tan facil de usar, si te metes mucho en una tf o no mides bien la distancia esta pero muertisimo no tiena nada que ahcer no tiene ceceo, no tiene saltos, a lo mas corre pero nunca te subieras de primero eso.","replies":[{"poster":"Boku wa senpai","date":"2015-12-29T22:54:46.795+0000","up_votes":1,"down_votes":1,"body":"Si Teemo carrea lo hace en el late y tiene que estar fed. Si el adc, mid o el support pisan una seta, aunque tiren health lo más seguro es que mueran o queden con menos de un 10% de su vida.\n\nLas únicas forma de carrear que conozco es tirar todo solo, o que el otro equipo tire surrender antes de que entiendan que podes explotar con un básico.\n\nMe ha pasado de sobra terminar 30/0 y perder porque con cualquier cosa te hacen instakill si tu equipo no te defiende, digamos que no es del todo un buen carry.","replies":[{"poster":"Axitas Alexis 99","date":"2015-12-29T23:42:36.842+0000","up_votes":1,"down_votes":0,"body":"no solo Ap, recuerdo que en mi promo a oro me toco un teemo enemigo que era el que los estaba carreando, iba ad pero con mazo de hielo, y splitpusheaba todo el rato, al final la terminamos ganando pero ese teemo fue un dolor de huevos,","replies":[{"poster":"Boku wa senpai","date":"2015-12-30T23:35:31.793+0000","up_votes":1,"down_votes":0,"body":"Sep, Teemo \"rinde\" en todas las posiciones y con todas las builds.\n\nAP, AD o tanque, sirve.","replies":[]}]}]}]},{"poster":"Lazuli Finn","date":"2015-12-30T17:38:46.769+0000","up_votes":1,"down_votes":0,"body":"Sinceramente creo que realmente rinde de verdad, primero que todo porque es un champ que a pesar de ser muy blando en los primero niveles puede molestar bastante e incluso sacarte de linea o de balance facilmente. Aunque no lo creas Teemo le puedo a muchos campeones y una vez que se arma su daño ap puede ser muy dificil de ganarle. Eso si, siempre vas a precisar un team que te de una mano porque solo no vas a poder tanto. De cualquier forma, es bastante bueno, especialmente en top donde los tanques y ADs sufren bastante al yordle enano. \n\nIgualmente si te gusta, usala, al fin y al cabo cualquier champ se puede lucir en linea si se maneja bien e incluso carrear {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"DarkRyo","date":"2015-12-30T12:52:13.833+0000","up_votes":1,"down_votes":0,"body":"Yo lo uso, y gano casi la mayoria de mis partidas con el.\nEs un noob champ? Si, eso creo. \nPero la cuestión es que divertido de usarlo xD Puedes jugar de TOP y MID AP, ADC AD y Support AP. Jungla no creo que le vaya bien, sufre mucho los primeros momentos.\nCuando estas en linea, acostúmbrate a poner cetas en los lugares donde un jungla promedio puede venir a gankearte (por ejemplo en top cuando ven un teemo, los junglas acostumbran a pasar por los costados porque piensan que ahí no hay cetas, es AHÍ MISMO donde tienes que colocarlas, en los bush en forma de wards por la jungla xD, o cuando ya tienes el {{item:3151}} y vas a pushear una linea, siempre dejar una ceta por el camino asi cuando te persiguen vayas directamente hacia ellas.\nTeemo es un personaje que no tienes vías de escape como otros magos pero si sabes usar sus habilidades al máximo puedes zafarte de unas cuantas situaciones. Por ejemplo, si estas contra un melee con tirar una Q y con una W vas hacia las cetas te salvas si o si, por que al cegar a un melee se queda sin fuente de daño por unos segundos considerables, lo cual te da la chance de correr por tu vida xD incluso si te llega a alcanzar un golpe, no te afectaría en nada justamente por que esta cegado. Aparte que pierde vida considerable por la pasiva de la E por cada ataque básico y si estas bien armado el tendrá que retroceder. Si es un retazado e igual te sigue, con lanzarle una ceta ya se muere xD.\nPero eso si, nunca estés solo por mucho tiempo, siempre mirando al mapa si no ves a los 5 enemigos ahi, consigues matar la oleada de minions y sal de la linea porque fijo que van detrás tuyo. Si no ves al adc enemigo y estas armado a tal punto de hacerle 1 vs 1 puedes tomarte el riesgo.\n\nNos vemos por la grieta :D {{summoner:4}}","replies":[]},{"poster":"DiegoEdward","date":"2015-12-30T03:59:20.609+0000","up_votes":1,"down_votes":0,"body":"Que pasa con los items? como se arma en esta Pre 6? pienso que los item como {{item:3364}} ha bajado demasiado el peligro que ocasionaba o representaba Teemo. He pensado usarlo de supp junto a una {{champion:51}} para minar todo el terreno. En fin, lo otro que me pregunto es si rendiría con un {{item:3116}} para no morir tan fácil","replies":[]},{"poster":"DayronDrakend","date":"2015-12-30T00:20:06.296+0000","up_votes":1,"down_votes":0,"body":"Si eres bueno te va a rendir.","replies":[]},{"poster":"vaz2001","date":"2015-12-29T23:41:22.910+0000","up_votes":1,"down_votes":0,"body":"Yo uso a Teemo porque lo amo, y tambien porque me parece un buen champ. Contra algunos campeones no puede hacer nada, como Pantheon. Tiene una movilidad buena(no es un Hecarim, pero tampoco una Ashe), es el unico champ que tiene ceguera=\"gg izi adc\"(a los adc como Varus y Lucian no les afecta mucho). Un buen Teemo puede llegar a carrear [Te dejo una partida mia con Teemo que carree con un Nasus amigo mio](http://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/260370642/201011574?tab=overview)","replies":[]},{"poster":"La corrupción","date":"2015-12-29T22:28:42.870+0000","up_votes":1,"down_votes":0,"body":"Es un campeon muy facil de usar, si bien algunos le sacan mas provecho que otros cualquiera puede y no le va a ir MAL, pero si lo usas decentemente no importa que no sea lo mejor usalo tranqui.","replies":[]}]}