{"poster":"nfzeta","date":"2016-09-23T07:52:16.856+0000","title":"Reoccuring Ping Problems","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"It seems that since early season 5 whenever I have a serious DC in game my ping from then to about a few months down the road gets about 40-50ms added on. \n\nAt first I thought it was a problem on my or my provider's end because some of those times were initiated by electricity outages or net crashes but it also happens when those things don't happen as long as i have a serious DC. By serious here i mean a few seconds of packet loss gameplay followed by the 500 ping dc.\n\nNow this has happened again and my ping has moved yet again from 80-90 to 130-150 and when I'm playing at night there seems to be some packet loss and occasionally i would get a fairly serious DC after which my in-game ping would return to showing 80-90 for that game. Now while all of this is happening, when i ping the LoL server the only change is that instead of showing 65-70 it now shows 90 ms. However this is only for LoL, streaming is fine and other games play at the ping they show when i ping their server.\n\nLast time this happened was only around may and at the time there was talk of it being a problem the LoL server has with Fibre. However this time the one difference is that while simply pinging would give me 90ms a trace route would give me the in-game 140. This time the trace route gives me the same 90 but in-game its still 140ms.\n\nI'm here wondering if there is some kind of easier fix in place for this problem since it doesn't only seem to be me and happens so regularly or if there is at least something i can do on my end to alleviate it.\n\nTracing route to 104.160.131.1 over a maximum of 30 hops\n\n  1     2 ms     1 ms     1 ms  Calix.Home [192.168.1.1] \n  2     7 ms     5 ms     4 ms  162.246.104.229 \n  3     6 ms     3 ms     3 ms  162.246.104.228 \n  4    47 ms    45 ms    44 ms  63.245.3.209 \n  5    54 ms    45 ms    45 ms  63.245.107.100 \n  6    47 ms    46 ms    46 ms  mai-b2-link.telia.net [62.115.14.5] \n  7    62 ms    62 ms    63 ms  atl-b22-link.telia.net [62.115.143.102] \n  8    83 ms    84 ms    83 ms  dls-b21-link.telia.net [80.91.246.75] \n  9    84 ms    84 ms    86 ms  riot-ic-315570-dls-b21.c.telia.net [62.115.63.70] \n 10    85 ms    86 ms    84 ms  104.160.134.35 \n 11    91 ms    91 ms    91 ms  ae35-br02.chi01.riotdirect.net [104.160.159.24] \n 12    92 ms    89 ms    89 ms  ae1-br01.chi01.riotdirect.net [104.160.159.8] \n 13    89 ms    89 ms    90 ms  104.160.131.1 \n\nTrace complete.","replies":[{"poster":"Porocles","date":"2016-09-23T17:49:15.922+0000","up_votes":1,"down_votes":0,"body":"It looks like your routing is jumping up well before you even reach the game servers.  To be fair, it looks like you're playing from a pretty long way, so the physical distance itself can cause issues with your ping.  You can use our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to help tune up your connection strength, and contact your ISP to see if they can improve how your service is routing to us.  Keep in mind that, that any improvement can't exceed that physical distance.  Best of luck!","replies":[]},{"poster":"Roit Gums","date":"2016-09-23T10:49:52.955+0000","up_votes":1,"down_votes":0,"body":"Yea. same here i dont understand the servers literally, all my other online games work perfectly, its only league that has these fkin weird ass problems","replies":[]}]}