{"poster":"Warrickthebeas","date":"2016-06-18T10:47:31.383+0000","title":"Blitzcrank auf der Toplane?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\n\r\nich bin ein gro&szlig;er Fan von Blitzcrank und spiele ihn gerne im moment auf der Botlane als Supporter. Mir geht aber nicht der Gedanke aus dem Kopf, dass man ja Blitzcrank auch auf der Toplane spielen k&ouml;nnte. Nur ich stelle mir dann halt immer die Fragen: Was soll ich mir kaufen? Welche F&auml;higkeit soll ich maximieren? Und da wollte ich das Forum halt fragen: Kenn ihr ein gutes und erfolgreiches Itembuild auf Blitzcrank? \r\nW&uuml;rde mich sehr freuen wenn es ein paar Antworten g&auml;be! :D \r\n\r\nVG","replies":[{"poster":"Balmung","date":"2016-06-18T11:41:52.491+0000","up_votes":4,"down_votes":1,"body":"Ich frage mich weshalb man Blitzcrank auf irgendeiner Position außer Support picken will - außer dem Q gibt es doch überhaupt kein Argument überhaupt Blitzcrank zu picken, da der Rest des Kits ohne den Q praktisch irrelevant ist.\n\nAls Suprise-Pick kann man's sicher gerne mal machen, aber ernsthaft würde ich es nicht in Erwägung ziehen. Dafür fehlt es dem guten einfach an Argumenten neben seinem Q.","replies":[{"poster":"Im a Papaya","date":"2016-06-18T12:21:33.752+0000","up_votes":1,"down_votes":3,"body":"Gerade auf der Toplane bist du nicht so stark von dem Skillshot abhängig wie auf der Bot Lane. Versuch mal straight auf ne Vayne zu rennen oder auf irgendeinen Kämpfer. W -> E knock up -> Q und zwischendurch ein paar Autos ist auf Meele Champs einfacher als auf Ranged Champs.","replies":[{"poster":"Balmung","date":"2016-06-18T12:29:00.183+0000","up_votes":3,"down_votes":0,"body":"Und was hab ich davon?\n\nSelbst wenn du als Blitzcrank die Lanephase überlebst wirst du danach auf deinen Q reduziert sein - und dabei ist es völlig egal ob du 0 oder 500 AP hast, da ein weiches Ziel eh stirbt wenn es in deinem Team steht. Einen Tank sollte man so oder so nicht hooken.\n\nWenn du den Q nicht triffst ist deine AP ebenso völlig wumpe, da du dann in etwa einen so guten Engage wie Garen hinbekommst.\n\nAlso ist man wieder bei: Blitzcrank hat nur seinen Q und dafür reicht auch der Supportplatz.","replies":[{"poster":"Im a Papaya","date":"2016-06-18T12:37:09.384+0000","up_votes":2,"down_votes":3,"body":"Wer redet von Ap ?","replies":[{"poster":"Balmung","date":"2016-06-18T12:45:11.896+0000","up_votes":2,"down_votes":1,"body":"Stimmt, nachdem ich deinen Beitrag weiter unten überflogen habe merke ich das du ernsthaft Dinge wie \"Crit-Blitz\" oder \"ArP-Blitz\" spielst und empfiehlst - ehrm...ja...","replies":[{"poster":"Im a Papaya","date":"2016-06-18T13:13:03.409+0000","up_votes":3,"down_votes":1,"body":"Nun ich habe Erfolg damit und Spaß. \nWenn du immer nur Meta Zeug spielst und Spaß damit hast ist das deine Sache aber das es Leute gibt die alles was ungewöhnlich ist einfach nur \"haten\" ist armselig und zeigt das man einen Teil dieses Spiels verloren hat, nämlich das Kreative und interessante im Spiel. \nIch spiele einige Spiele um Spaß zu haben, andere um zu gewinnen du scheinst diesen Spaß nicht mehr zu haben.\nbtw. Da wir beide zu stur sind um uns zu einigen und ich keinen 200 Beiträge Thread erschaffen will beende ich die Diskussion an diesen Punkt. ","replies":[{"poster":"Balmung","date":"2016-06-18T14:06:11.051+0000","up_votes":1,"down_votes":1,"body":"Erfolg bezweifle ich - Spaß vielleicht.\n\nManche Leute haben auch Spaß am Erfolg.\n\nDas \"kreative und interessante\" am Spiel stirbt zum Teil weil das Spiel älter wird, zum anderen weil Riot die Möglichkeiten ungewöhnlicher Spielstile immer weiter einschränkt um das Spiel klarer zu definieren.\nSelbes Phänomen gibt es bei WoW und Konsorten...\"die gute alte Zeit\" - ja, die war nur so gut weil keiner inklusive der Betreiber Ahnung von genauem Spieldesign o.Ä. hatte.\nSeit sie ihre Vorstellung von LoL als E-Sport stärker durchziehen und bestimmte Champions bestimmte Nischen erfüllen sollen verlieren auch in meinem Bekanntenkreis viele den Spielspaß -> Weil eben nicht mehr so viel Spielraum für \"kreativen Unfug\" bleibt.\n\nAber stimmt schon: Wenn kein Argument außer \"Spaß\" für etwas da ist, ist eine Diskussion schwer zu führen.","replies":[]}]}]}]}]}]}]},{"poster":"ELOW Cronos","date":"2016-06-18T11:24:09.305+0000","up_votes":2,"down_votes":0,"body":"Was willst du mit Blitzcrank auf der Toplane? Irelia graben? Trundle graben?  Darius graben? Da laufen nur Tanks und Bruiser rum, die sich über den free Gap Closer und den wehrlosen Gegner freuen. Tut mir leid aber da finde ich Blitzcrank Mitte/Jungle sogar noch eine bessere Idee.","replies":[{"poster":"Megamaexx","date":"2016-06-18T15:34:42.855+0000","up_votes":1,"down_votes":0,"body":"Reduzier ihn nicht auf den Grab, sondern mehr auf sein Potential auf der W. Gegen Darius ist er wohl ein ziemlich mieser Pick, gegen Irelia besteht die Option, dass das was werden kann, würde ich sagen. Ich hab auch schon mal einfach Blitzcrank Top gegen einen Gnar gespielt und den kleinen Kerl ziemlich zerstört. Die Q dient da nur dazu, dass dein Gegner nicht wegrennen kann. Sowas wie Renekton kann also nicht einfach nach seiner Combo wieder abhauen. Wie das am Ende aussehen wird, müsste man testen.","replies":[]}]},{"poster":"Revelate","date":"2016-06-18T10:51:13.819+0000","up_votes":1,"down_votes":1,"body":"Blitzcrank -> AP Bauen -> Ult macht bis zu 4000-5000 dmg -> Gegner Oneshoten.\n\nViel mehr ist da nicht zu sagen. Im vorletzten Spiel habe ich eine 478 dmg Blitzcrank ult bekommen. naja hatte ja nur 113 MR ne, kann man ja mal machen ohne AP items.........","replies":[{"poster":"Teemo Main","date":"2016-06-18T11:12:48.317+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Revelate,realm=EUW,application-id=Wj1wcocU,discussion-id=9mMnKl1x,comment-id=0000,timestamp=2016-06-18T10:51:13.819+0000)\n>\n> Blitzcrank -> AP Bauen -> Ult macht bis zu 4000-5000 dmg -> Gegner Oneshoten.\n> \n> Viel mehr ist da nicht zu sagen. Im vorletzten Spiel habe ich eine 478 dmg Blitzcrank ult bekommen. naja hatte ja nur 113 MR ne, kann man ja mal machen ohne AP items.........\n\nmit einem 1,0 AP Scaling 4-5 tausend schaden scheint mir ein wenig übertrieben","replies":[{"poster":"Revelate","date":"2016-06-19T21:25:07.747+0000","up_votes":1,"down_votes":0,"body":"jetzt darf man nicht mal mehr übertreiben *heul\n\nNaja ich habe schon AP Blitzes gesehen, die Flashen in ein Team und machen mit der Ult Triple kill. \n5000 Schaden sicher nicht, aber so 1500-1700 Schaden war schon da :D","replies":[]}]},{"poster":"Megamaexx","date":"2016-06-18T11:08:13.898+0000","up_votes":1,"down_votes":0,"body":"Ist ineffizient gegen sehr mobile oder tankige Toplaner.","replies":[]}]},{"poster":"Megamaexx","date":"2016-06-18T11:19:04.688+0000","up_votes":1,"down_votes":0,"body":"Ich hatte es so gemacht: \nGegner war Gnar. Hochgeskillt hab ich die W. Items: Eingeborenen Handschuh, Klinge des gestürzten Königs, Sonnenfeuerumhang.\nDa die W Attack speed gibt, synergiert das wunderbar mit der Botrk. Sonst bist du dennoch der Tank/Offtank, den man auf der Top braucht. Ich glaube aber, dass er gegen Fulltanks nicht so effizient ist und nach dem Update von Stärke der Dreieinigkeit klingt dieses auch etwas passender.","replies":[]},{"poster":"Im a Papaya","date":"2016-06-18T11:38:20.613+0000","up_votes":2,"down_votes":2,"body":"Es gibt mehrere Versionen von Top Lane Blitz die ich spiele. \n1. Off Tank Blitz Mit boots of Swiftness und, da man meistens AD Matchups bekommt, Iceborn Gauntlets. Panzer des Toten Mannes ist auch ganz angenehm und Steraks kann den Gegner sehr überraschen wenn es zusammen mit deiner passiven proct.\n2. Crit Blitz mehr Spaß aber mehr Risiko: Träne, Trinity, Boots of Swiftness oder Berserker Schuhe, IE, Phantomdancer + Ein anderes Crit Item oder ein defensives Item je nach Spielstil.\n3. Flat armor pen Bc wenn du im early aggressiv spielen willst: Youmus, Black cleaver, Trinity, Berserker Schuhe, Schlund, Duskblade. Manaprobleme ohne Ende aber Hook = Rip\n\nBoots of Swiftness baue ich gerne um den W Debuff einigermaßen zu umgehen, den man sich auf der Top Lane oft antun muss, da sie den Slow verringern. Maxen tue ich die W für mehr Attack Speed und besseres Trading, Sheen Effekte finde ich einfach wunderbar auf Blitzcrank deswegen baue ich einen davon in jeden Blitzcrank Build ein.\nLaneing: Ich skille die E zuerst und versuche immer mal wieder einen Hit auf den Gegner zu landen was gegen alles was keinen eigenen Sustain hat oder ein Lane Bully ist ziemlich viel Schaden machen kann. Je nach Build lasse ich mich auch gerne einpushen weil manche Gegner unachtsam werden und sich in den Tower hooken lassen oder bei einen Gank cc'n lassen.\nDas Mid und Late Game ist ganz ähnlich wie das von Support bc nur kannst du alleine mehr reißen und gut flanken um einen Squishy zu oneshotten, wenn du Off Tank Blitz spielst kannst du eigentlich Resistenzen kaufen und genau das gleiche tun was ein Support Blitz tut nur mit etwas mehr Schaden.\n\nIch hoffe ich konnte dir bei deiner persönlichen Entdeckung von Top Lane Blitzcrank helfen denn letzten Endes hat jeder seinen eigenen Stil den man sich ruhig von anderen inspirieren lassen kann.","replies":[]},{"poster":"Corvis Rex","date":"2016-06-18T11:10:05.674+0000","up_votes":1,"down_votes":1,"body":"Blitzcrank ist ein %%%%%%%%%!","replies":[]}]}