{"poster":"BadMjoelnir","date":"2016-10-15T11:49:33.055+0000","title":"Alpha client startet nicht !","subforum":"Client Diskussion","up_votes":1,"down_votes":0,"body":"Hi leute mein alpha client startet einfach nicht ich f&uuml;hre ihn ganz normal aus und dann kommt der client als gr&uuml;n/graues bild das bleibt dann ca. ne minute und verschwindet dann danach kommt nix mehr !\r\nWenn ich dann versuche meinen alten Clienten zu starten sagt mein rechner mir client wird schon ausgef&uuml;hrt ...\r\nAnsonten l&auml;uft mein alter client aber reibungslos ,,, kann mir da jemand helfen ?","replies":[{"poster":"Wort","date":"2016-10-15T12:08:27.325+0000","up_votes":3,"down_votes":0,"body":"Du musst zuerst den normalen lol client löschen, danach geht es.\n","replies":[{"poster":"BadMjoelnir","date":"2016-10-15T14:43:13.544+0000","up_votes":1,"down_votes":0,"body":"Rito meint man kann beide clienten noch behalten ... ich versuchs mal :D","replies":[]}]},{"poster":"Usernameexis","date":"2016-11-16T09:14:42.655+0000","up_votes":1,"down_votes":0,"body":"du musst den alpha client starten, also wenn du auf den dateipfad von dem normalen client gehst siehst du etwas darüber den alpha client. den musst du einfach starten und du bist in einem anderen log in screen^^","replies":[{"poster":"TooFameForFlame","date":"2016-11-16T19:59:06.789+0000","up_votes":1,"down_votes":0,"body":"Ich habe auch das Problem, und bei mir funktioniert es mit dieser Methode auch nicht. Hab alles ausprobiert bei mir startet der Client einfach nicht .... :c","replies":[{"poster":"oBeatZzo","date":"2017-01-06T16:02:26.781+0000","up_votes":1,"down_votes":0,"body":"Hab so ein ähnliches problem.\nWenn ich lol starte, startet es sich nur mit dem alten client, dann kommt ein fenster wo steht ''Neuen client aktualisieren'' und wenn ich da drauf clicke passiert nix.\nUnd wenn ich lol mit dem alten client starten möchte kommt jedesmal ein fehler und es startet nicht.\nHab es schon öffters mit neuem downloaden und starten versucht aber es ändert sich nichts.\nBitte Hilfe :)","replies":[]}]}]}]}