{"poster":"gona geims","date":"2017-07-07T01:40:26.038+0000","title":"Jajajaja me encantan estos tipos de jugadores jajaja","subforum":"Comportamiento del jugador","up_votes":9,"down_votes":1,"body":"Los tipicos ratas, que van bien en la partida y se ponen a decir por all: isi, ff pls, que facil, lo que juegoo! \r\n\r\nMe encantan esos jugadores terminar ganandoles una partida que la tenian super ganada y ver como de a poco se van callando la boca, hablan cada vez menos por el chat a lo ultimo tratan de desaparecer y al final piden report para su team jajajaja\r\n\r\nAyer una leona en un invade, yo iba nunu jg, salio mal el invade murieron 2 de nosotros y volaron flash para todos lados, &quot;LO QUE JUEGOOOOOO DIOS&quot; decia leona, el lee de ellos: &quot;ME VAS A INVADIR A MI CTM!&quot; pone jajaja\r\n\r\nEstaban stompeando bot seguia diciendo isi bla bla bla, una sola decision, cambio la partida, solearme el heraldo apenas salio, tirarlo en top dar ventaja, tp del top en bot cuando iba a gankear yo todos muertos 2 torres y se les dio vuelta la cosa jajajaja\r\n\r\nPedazos de ratas se querian matar, en mid game me lo soleaba al lee como queria, peor aun es no haberle contestado nada a nadie hasta el momento que estabamos tirando el inibidor y ahi no me aguante decirle: LO QUE JUGAMOS MAAN LO QUE JUGAMOS!!\r\n\r\nIncreible como se empezaron a flamear entre ellos y pedirse reportes mutuamente pedazos de ratas jajaja","replies":[{"poster":"Crua Chan Prodan","date":"2017-07-07T02:31:13.264+0000","up_votes":4,"down_votes":0,"body":"Yo propongo que los Rioters se creen cuentas desde cero y jueguen su juego a ver cuanto duran sin pegarse un tiro, esta comunidad es cremita. \n\nGG Wp!","replies":[]},{"poster":"JunglaNoGankeaGG","date":"2017-07-07T07:16:34.577+0000","up_votes":2,"down_votes":0,"body":"Buena historia. Le faltaron dragones pero buena historia.","replies":[]},{"poster":"handrix","date":"2017-07-07T17:54:52.257+0000","up_votes":1,"down_votes":0,"body":"Jajaja es un cago de risa en el sentido de que parece la misma persona con otro nick porque siempre hablan igual, es como spamear su maestría... maestría de rata, el problema es que hay gente que se come eso y se frustra o distrae mal :v","replies":[]},{"poster":"Nalk","date":"2017-07-07T17:16:41.803+0000","up_votes":1,"down_votes":0,"body":"Vos porque no viste el \"fasil con s de sencillo\"","replies":[]},{"poster":"iEban","date":"2017-07-07T03:09:30.547+0000","up_votes":1,"down_votes":0,"body":"Son una risa esos jaj.","replies":[]},{"poster":"Dagaseverywhere","date":"2017-07-07T02:12:19.208+0000","up_votes":1,"down_votes":0,"body":"ajajjajaja llamentablemente esas ratas terminan ganando en mis partidas :p","replies":[]},{"poster":"One Punch Vi","date":"2017-07-07T01:53:08.443+0000","up_votes":1,"down_votes":0,"body":"Y esto en que afecta a Demacia?","replies":[]},{"poster":"Hell Darking","date":"2017-07-07T03:43:41.839+0000","up_votes":2,"down_votes":2,"body":"ojo, yo soy de los que dice \"lo que juego papu\" \"esto es muy facil\" y cosas asi, pero solo cuando voy perdiendo y mi score se ve 2/8/1 o cosas peores, lo hago por humor y por sacarle una sonrisa a alguien para que no se frustre..","replies":[]}]}