{"poster":"MadDetective","date":"2016-08-09T01:52:30.997+0000","title":"Losing internet connection when loading a match of League.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So sometimes (1 in 10-15 games usually) when me and/or my girlfriend load in to a League match, the internet will go down for us. Not failure to connect, I can't even browse the internet, so completely down. This only ever happens while playing League and only specifically when starting to load in, there's no way to predict it.\n\nThis problem is more recent, (for the last week) Before this I NEVER left matches, but now I've gotten a leaver queue about 4 times because of this. I've reset my router, changed routers, opened the ports, flushed DNS, set up static IP addresses on our computers, disabled firewalls, nothing works. The issue persists randomly, at one point my internet was down for over an hour, usually it's back in 1-10 minutes without having to restart my router and googled the issue non-stop. Anytime I google the issue that any issues like mine come up there's never any solution to it other than the usual obvious stuff, which the poster always says didn't work. (All of which I tried anyway)\n\nI've never intentionally left a game (since before season 1 at least and after I was level 30) and don't ever do so intentionally except in emergencies and getting punished for this is extremely frustrating when nothing I can do works. So if anyone can give me a straight answer on what's causing this I'd appreciate it.\n\nP.S. ISP's technicians are no help at all, don't understand what I'm trying to say when I explain the problem, and the issue has only recently cropped up and is only League related, nothing else causes this issue.","replies":[{"poster":"Targons Blade","date":"2016-08-09T17:10:40.784+0000","up_votes":2,"down_votes":0,"body":"Having your entire network go down while using a specific application or Game is definitely out of the ordinary. There would be logs in your modem of what's going on when this happens and I definitely recommend having your ISP start there. Based on your post, you've already tried the first steps I would have recommended, so at this point, your best course of action is to continue working with your ISP to investigate why you're losing complete connectivity.\n\nLet me know if you have any questions.","replies":[]}]}