{"poster":"SK PRECISION","date":"2019-02-24T16:39:04.278+0000","title":"[Kritik] Ranked Reset für Highelo?","subforum":"Ligen & gewertete Spiele","up_votes":3,"down_votes":3,"body":"Hey!\r\nMein Name ist \"JP\" und ich bin ein Highelo spieler aus voller Leidenschaft - das war ich schon immer. Begonnen habe ich auf meinem ersten Account im Jahre 2011. Ich hatte mir 2016 dann aber eine Auszeit genommen - von alledem.. dem tilt, der community, von allem, was mich moralisch und ein stückweit psychisch herunter gezogen hatte. Ja League of Legends war ein Teil davon. Zu den Zeiten, als ich Master - Challenger war, erstellte ich mir nun auch diesen Account, er war mein Smurf, welchen ich auf Diamant 5 mit voller Mühe, Geduld, aber auch Spaß am Spiel auf eben diese Liga gebracht hatte. Nach 3 Jahren Pause, ergab es sich also, dass ich wieder anfing zu spielen, ich spiele ab jetzt auf meinem Smurf, eine Art Neuanfang für mich - Dementsprechend hatte sich die Lange Pause auch auf meine Liga ausgeübt - Ich spielte meine Placements,  ungewohnterweise lief alles nach Plan - zuerst Bronze, dann Silver, dann Gold und Platin - Jetzt sogar schon Diamant. Ich bin stolz darauf, auch frühere Teammates freuten sich sehr für mich. Fast wie ein kleines Kind, voller Elan und Motivation spielte ich, und spielte ich, und spielte ich. Ich wollte immer mehr - immer höher - vorallem aber wollte ich wieder Master werden. \r\n\r\nDoch heute, vielen mir fast all diese positiven Emotionen aus dem Gesicht. Ich checkte Twitter, mal dies mal das - so wie  immer eben. Doch ein Post oder genauer gesagt 7 von meinem Feed gefielen mir garnicht. MagicSap, ein Developer, kündigte einen eventuellen Elo-Resett an. Und ich fing an zu lesen - Wort für Wort wurde ich immer trauriger. Trauriger darüber, dass eine Elo resettet wird, eine Elo, über welche ich mich so gefreut hatte - Diamant +.\r\nIch frage mich nun eins - Wieso? Ja, es ist traurig, dass wir teilweise mit Gold spielern letzen Jahren gematched werden, aber ein Ranked-system ist nunmal eben genau dieses - eine Leiter voll mit Menschen, welche absteigen werden, voll mit Menschen, die aufsteigen werden, weil sie es eben verdient haben. Zu eben diesen Menschen, die sich einen Aufstieg hart erarbeiten möchte ich mich zählen. Ich habe jetzt also geschlagene 4-6 Tage dauerhafte Spielzeit hinter mir, in der ich viel Spaß hatte, oft wurde ich mad, manchmal richtig sauer. Aber am Ende des Tages bin ich doch eben eins - in meiner Liga. In der Liga, für die ich besonders hart gekämpft habe. Braucht ein bestimmtes Ranglistensystem wie League of Legends es besitzt, nicht einfach etwas Zeit, um jedem Spieler seine gerechte Elo zu zuweisen? Immerhin gibt es ab Platin doch nicht umsonst den automatischen Demote bei längerer Inaktivität. Ich persönlich muss auch ehrlich sagen, dass ich selten in diamant das Problem hatte, dass meine Teammates einfach nicht in diese Liga gehörten, denn im Endeffekt verliert man klar ab und an ein paar games, aber mit Sicherheit nicht nur, weil Spieler nicht gerecht gemachted werden. Das halte ich für eine reine Ausrede des eigenen Versagens, das Spiel ist und bleibt ein Teamspiel. An ein Teamspiel geht man nicht wie folgt herran: Hey schaut mal, er war last season unranked also ist er schlecht, sondern man spielt - gibt calls, befolgt calls. So war und ist das schon immer.\r\n\r\nIch finde es extrem Ungerecht uns Diamant plus Spielern einen hart erkämpften Rang wegzunehmen, und damit einfach absolut jeden im Kollektiv zu bestrafen. Damit habe ich erfolgreich zahlreiche Stunden meiner begrenzten Lebenszeit in den Sand gesetzt. Und ich überlege nun erst recht mich einfach auf platin demoten zu lassen, indem ich nun absichtlich schlecht spiele, vielleicht werden wir,  als Diamant, Meister oder Herrausforderer- Spieler dann mal ernst genommen, nicht nur Pro-Player, lcs mitglieder oder Streamer mit 10.000 Zuschauern. Desweiteren weis ich, als absoluter Fan des League Universums, welcher bereits in Challenger 2014-2016 spielte, nicht mehr, ob ich dieses Spiel dann noch spielen möchte. Dabei geht es mir um das Prinzip, um die zahlreiche Zeit, welche ich aufgebracht habe um auf diese Liga zu kommen - daher zählt eine Aussage wie - \"Aber du kannst dich doch, wenn du so gut bist, wieder zurück spielen\" nicht.\r\n\r\nVielen Dank fürs Lesen. Es belastet mich sehr, und ich sah hier eben den perfekten Ort, meinen Gefühlen freien Lauf zu lassen.\r\n\r\nMit Freundlichen Grüßen,\r\nJP\r\n\"Trust in your Spirit\"\r\n{{champion:43}}","replies":[{"poster":"Sedros","date":"2019-02-25T13:56:38.511+0000","up_votes":1,"down_votes":0,"body":"Also ich finde es gut, wenn es diesen Reset wirklich gibt. Die Leute sind teilweise mit 40% winrate master geworden obwohl sie unteres Dia waren. Wo ist da der Sinn? Riot hat einen Fehler gemacht und die Spiele in highelo sind nicht mehr ansehnlich. Bei den Streamern die ich schaue sieht man die teilweise riesigen Wissens und Skillunterschiede. Seien wir auch mal ehrlich wer will bitte sagen: \"Boah geil bin Dia geworden mit 50% Winrate.\" Also ich wäre darüber nicht gerade stolz. \nUnd wie soll man es sonst machen? Elo reset ist wohl sehr sinnvoll. Natürlich nicht toll aber aus meiner Sicht schon die beste Lösung. Ich meine wer nen Smurf hochhaut in dia.. Ich finde da sollte man schon eher auf den normalen Spieler schauen der seinen Main spielt. Generell einfach eine missliche Situation","replies":[{"poster":"SK PRECISION","date":"2019-02-25T14:16:18.858+0000","up_votes":1,"down_votes":0,"body":"Hey, das ist ja schön und gut, jedoch habe ich als Spieler mit einer Winrate von 78% (!!) Darunter extrem zu leiden. Eventuell kannst du das auch nicht ganz nachvollziehen, da du vielleicht nicht auf dieser Liga spielst, aber es ist einfach nur eine extrem dumme Kollektivmaßnahme, die vorallem dazu dient 30% der Highelo Spieler glückllich zu machen (Oberes Master - Challenger) und 70% der Spieler in dieser Liga finden es total unangemessen. Immerhin sind wir jetzt die Jenigen, die die Fehler von Riot ausgleichen müssen. Das ist eine absolute Schande von Seitens des Entwickler-Teams, das haben sie auch soweit eingesehn und denken in andere Richtungen, ein Elo-Reset sei nach SapMagic wohl \"unlikely\". \n\nMfG","replies":[{"poster":"Sedros","date":"2019-02-25T15:03:07.006+0000","up_votes":1,"down_votes":0,"body":"Also denke mal du hast dich einfach vertippt. Deine Winrate ist 68% und ganz ehrlich wenn man in bronze anfängt nichts erstaunliches. Keine Angst meine Accounts leiden auch darunter, aber ich hab lieber gute Spiele als mir zu viel aus dem Rang zu machen und ganz ehrlich natürlich beschweren sich die ganz oben. Die haben keine Lust auf schlechte Spiele durch diesen Skillunterschied. Sie können halt schlecht noch mehr climben um den Spielern zu entgehen.\nIch preise einen Eloreset auch nicht an aber was soll Riot tun. Es wird immer ggn kollektiv gehen. Damit haben wenigstens alle die gleichen Rechte. Sollen sie pro Lose mehr verlieren? Werden wieder die gepunisht die mehr spielen. Schön ist das echt nicht.\nAber wenn man es ehrlich sieht haben wir nun mal auch diesen bonus gehabt und mit unter 50% trotzdem noch mehr punkte bekommen als verloren.","replies":[{"poster":"SK PRECISION","date":"2019-02-25T16:27:54.944+0000","up_votes":1,"down_votes":0,"body":"Ich muss wirklich sagen, ich hatte bisher nicht einmal das Problem dass es wirklich ausnahmslos an dem Spielverhalten meiner Mates lag - viel eher an dem Teamplay. Nun gut, aktuell bin ich auch kein hohes Diamant aber trotzallem - Wenn der Reset kommt, dann kommt er klar werde ich dann (eventuell) wieder hochspielen aber es kann doch nicht alles komplett umsonst gewesen sein. Das wiederstrebt mir einfach komplett - das wäre ja echt unfair. Und wie gesagt, ich demote lieber auf  platin 1 und mache meine dia promo erneut als zu sagen ja, ich will nen kompletten resett um dann im low platin oder gold zu landen. Wenn du verstehst wie ich das meine. \n\nlg","replies":[{"poster":"Sedros","date":"2019-02-25T18:03:28.748+0000","up_votes":1,"down_votes":0,"body":"Es sind nun mal Fehler gemacht worden und die ohne Schaden rauszubekommen keine Ahnung wie soll das funktionieren? Ok was ich vllt mir denken könnte, dass sie alle nach ihrer Win/Lose und ihrer Startelo neu einordnen. Damit wäre nicht alles unnütz aber ist das fair? Auch nicht ganz aber wäre eine Idee. Also iwie hat alles seine Nachteile und am Ende sucht man das mit dem kleinsten Übel.\nDas Ding einfach zu sagen alle sind jetzt bisschen tiefer löst das Problem ja nicht. Ich meine du bist halt ein Sonderfall mit deinem \"Smurf\". Normalerweise climbt kein Spieler auf einmal aus Bronze zu Dia nur weil er in der Preseason was gelernt hat. Und wenn man dann sagt darauf wird keine Rücksicht genommen (kleinstes Übel) könnte ich das gut verstehen. Ist nun mal ne Scheiß Situation und Riot sollte sich überlegen ob die wenigstens den Spielern im Gegenzug etwas geben.","replies":[{"poster":"SK PRECISION","date":"2019-02-25T18:12:12.122+0000","up_votes":1,"down_votes":0,"body":"Ja im Endeffekt bring alles Jammern ja nichts. Hochspielen könnte ich erneut mit Sicherheit aber das ist einfach in meinen Augen nicht gerecht. Mag sein, dass das andere nicht so sehen, ich könnte mir trotzdem vorstellen, dass einige eine andere Variante mehr begrüßen würden. Es geht mir ja auch mehr ums Prinzip - Ich hoffe du verstehst mich soweit - denn wir Spieler sind am Ende die, die dafür Buße tun müssen, dass Riot schlichtweg versagt hat. Ich z.b. bin da ein großes Extrem ich hatte mir sogar Urlaub für den Spaß genommen, Zeit, die ich nicht wieder bekommen werde. \n\nWir warten ab und hoffen das Beste. Das wünsche ich dir, genauso wie jedem Anderen, der etwas damit zutun hat.\n\nLG","replies":[]}]}]}]}]}]},{"poster":"MyKogInYourLulu","date":"2019-02-25T08:58:39.132+0000","up_votes":1,"down_votes":0,"body":"Aber nicht ernsthaft oder? Ich tryharde seit Season 3 um endlich mal Dia zu kommen, schaffe es diese Season endlich und jetzt wird Dia resettet? Ich geh unter die Dusche heulen...","replies":[{"poster":"SK PRECISION","date":"2019-02-25T11:27:46.903+0000","up_votes":1,"down_votes":0,"body":"Genau mein reden, bzw das worauf ich keine Lust habe. Verständlicher Weise. Und ich war auf dem weg zu Meister. Das ist echt absurd..\n\nHier mal der einzel (Quellennachweis für meinen beitrag): \n\nhttps://mobile.twitter.com/RiotSapMagic/status/1098820557385084928","replies":[]}]},{"poster":"00 M4ddin 00","date":"2019-02-25T06:27:28.413+0000","up_votes":1,"down_votes":0,"body":"Also könnten die ganzen Low elo Spieler die über das MM Jammer auch recht haben ? :D \n\nMir ist fast Egel welcher Rang meine Mitspieler haben solange ich das Gefühl hab das sie noch selbständig atmen können ....","replies":[]},{"poster":"ImTheFox115","date":"2019-02-24T16:48:37.760+0000","up_votes":1,"down_votes":0,"body":"naja jeder der dia4 oder höher war hat plus 25 minus 10 bekommen, welche wr oder mmr dieser auch hatte...\nDas resultiert jetzt darin, dass super viele Dia Spieler in Master sind und da halt nicht hingehören...\n\nDie Frage die sich mir jetzt auch noch stellt: Was ist denn aus dem Rang deiner letzten Season geworden, für den so so gekämpft hast?\nDen hast du nach dem Reset auch verloren und musstest dir den wieder erkämpfen....\n\"Damit habe ich erfolgreich zahlreiche Stunden meiner begrenzten Lebenszeit in den Sand gesetzt\"","replies":[{"poster":"SK PRECISION","date":"2019-02-24T16:53:08.024+0000","up_votes":1,"down_votes":1,"body":"Dann sollte man darüber nachdenken, einige Spieler im Meisterbereich zu demoten, aber doch nicht jeden.\nWeisst du, League spielt man klar, des Prestige'es Willen - Wenn ich eine Belohnung für meine Harte Arbeit bekomme, dann ist das eben genau das, was ich wollte - einen Rahmen, Ein icon, den Skin uvm. Aber einfach meine Elo zu resetten, damit ich wieder auf Bronze anfangen darf grenzt an kompletten Irrsinn, da ich davon genug habe - denn ICH will auch auf meiner Elo spielen und nicht wieder in Bronze - Platin umher spielen bis ich ENDLICH mal mit Mates meiner Liga spielen darf. Ist das echt nicht nachzuvollziehen? \nP.s.: Ich bin ein sehr offener Mensch für sowas, und steigere mich oft in bestimmte Themen herrein, das sollte mir auch keiner Übel nehmen.\nLg, JP","replies":[{"poster":"ImTheFox115","date":"2019-02-24T17:59:31.498+0000","up_votes":1,"down_votes":0,"body":"Natürlich ist das nachvollziehbar :D\n\nNur 1. Problem: „Einige Master Spieler zu demoten“ \nWie soll man da objektiv vorgehen? Alle ab 100Lp abrufen? Alle die letzte Season unter Dia1 waren?\n\n2. Du wirst nicht auf 0 resetted :D es passiert einfach (geh ich mal von aus) das selbe wie am Seasonanfang, ein Soft Reset...\nDann muss man sich hochspielen, HAT ABER NOCH SEINE MMR!\n\n3. Wenn man Dia ist, braucht man nicht lange um dahin zu kommen... Dann spielst du halt mal 30 Spiele und clappst die Gegner weg...","replies":[{"poster":"SK PRECISION","date":"2019-02-24T18:19:41.959+0000","up_votes":1,"down_votes":0,"body":"Das würde die ganze Sache aber extrem sinnfrei machen, wenn du deine mmr behälst, werden auch spieler wegen denen genau das getan wird wieder in die elos kommen, in die sie nicht gehören.. Ich bekomme das ganze vorgehen absolut nicht in meinen Kopf. Die Hoffnung auf eine komplett andere Variante bleibt - so heißt es, dass binnen der nächsten 7 tage neue (entgültuge) vorgehenweisen vorgestellt werden sollen.","replies":[{"poster":"Avorox","date":"2019-02-24T19:17:16.025+0000","up_votes":1,"down_votes":0,"body":"Nein werden sie nicht, weil sie nicht so gut spielen. Wenn der LP-Gain diesmal normal ist bleiben die in low Dia oder wo auch immer sie vorher waren.","replies":[{"poster":"SK PRECISION","date":"2019-02-24T19:42:22.539+0000","up_votes":1,"down_votes":0,"body":"Hattet ihr denn Erfahrungen mit unangemessen schlechten Spielern in euren Teams? Ich nicht. Das ist so der Haken der ganzen Sache.","replies":[{"poster":"Avorox","date":"2019-02-24T19:57:02.403+0000","up_votes":1,"down_votes":0,"body":"Ich hab massenhaft sehr schlechte Spieler gesehen die teilweise mit Platinrahmen und negativer Winrate in D1 waren, also das war diese Season schon echt krass.","replies":[{"poster":"SK PRECISION","date":"2019-02-24T19:58:02.508+0000","up_votes":1,"down_votes":0,"body":"Immernoch? Die sollten sich ja nun langsam in ihrer elo eingefunden haben. Ich pendle aktuell zwischen D3 D2 und D4.","replies":[{"poster":"Avorox","date":"2019-02-24T20:37:17.150+0000","up_votes":1,"down_votes":0,"body":"Ka kann ich nichts zu sagen, habe diese Season nur fix Diamond gemacht und dann aufgehört, da mir das Meta nicht wirklich Spaß macht. Ich weiß nur wie es in meinen Games war und das war echt krass.","replies":[]},{"poster":"SK PRECISION","date":"2019-02-24T20:03:52.032+0000","up_votes":1,"down_votes":0,"body":"Wens interessiert - hier ist die Meinung des Dev auf meine Reaktion zu dem ganzen:\nhttp://prntscr.com/mpj4qq","replies":[]}]}]}]}]},{"poster":"ImTheFox115","date":"2019-02-24T18:54:54.403+0000","up_votes":1,"down_votes":0,"body":"Der Unterschied wäre aber, dass man nicht die ganze Zeit 28 Lp bekommt und nicht minimal was verliert :D\n\nAber wir werden sehen...","replies":[{"poster":"SK PRECISION","date":"2019-02-24T18:58:40.178+0000","up_votes":1,"down_votes":0,"body":"Ich meine, dich betrifft es ja auch, also ich finde das schon extrem, wenn das durch kommt. Einer meiner Freunde (Challenger aktuell) meint dazu folgendes: „bin der meinung das war weil die leute duoq abused haben und halt dieses neue rank System was die bei sich probieren. eu hatte das noch nicht.“. Er macht sich also nichtmal Sorgen darum, dass es in Euw überhaupt passiert. Er selbst hat damit auch absolut keine Probleme gehabt.","replies":[{"poster":"ImTheFox115","date":"2019-02-24T19:01:09.951+0000","up_votes":1,"down_votes":0,"body":"Sprichst du jetzt von NA oder Euw?","replies":[{"poster":"SK PRECISION","date":"2019-02-24T19:02:49.554+0000","up_votes":1,"down_votes":0,"body":"Mein kollege meint in EUW wird der Resett nicht kommen - egal was passiert. Ich bin auf EUW, daher auch der post hier - er meinte es betrifft nur na und korea","replies":[{"poster":"ImTheFox115","date":"2019-02-24T19:06:09.969+0000","up_votes":1,"down_votes":0,"body":"ACHSOOOOO XD\nDas ändert alles xD\nIch dachte hier kommt ein Reset!","replies":[{"poster":"SK PRECISION","date":"2019-02-24T19:08:10.661+0000","up_votes":1,"down_votes":0,"body":"Dachte ich bis eben auch. Da we aber ein challenger ist will ich ihn einfach mal vertrauen","replies":[{"poster":"ImTheFox115","date":"2019-02-24T19:12:49.140+0000","up_votes":1,"down_votes":0,"body":"Ich hab aber auch irgendwas offizielles gehört, ich weiß aber nicht mehr wo..","replies":[{"poster":"SK PRECISION","date":"2019-02-24T19:13:57.202+0000","up_votes":1,"down_votes":0,"body":"Davon dass einer kommt, oder dass keiner kommt?","replies":[{"poster":"ImTheFox115","date":"2019-02-24T19:26:00.806+0000","up_votes":1,"down_votes":0,"body":"Das einer kommen soll...","replies":[{"poster":"ImTheFox115","date":"2019-02-24T20:08:31.338+0000","up_votes":1,"down_votes":0,"body":"Das haben wir alle...","replies":[]},{"poster":"SK PRECISION","date":"2019-02-24T19:59:02.968+0000","up_votes":1,"down_votes":0,"body":"Leider ja. Traurig ist das, denn ich habe mich echt angestrengt immer gut zu spielen - damit ich mit meiner MMR was erreichen kann.","replies":[]},{"poster":"ImTheFox115","date":"2019-02-24T19:56:08.058+0000","up_votes":1,"down_votes":0,"body":"Bei deiner WR auf Plat zu droppen dauert aber ein bissln...\nDann kann ich mich ja auch mal demoten lassen :p","replies":[]},{"poster":"SK PRECISION","date":"2019-02-24T19:43:04.362+0000","up_votes":1,"down_votes":0,"body":"Ich bin äußerst gespannt und verfolge das ganze weiterhin aufmerksam. Wenn ein resett im raum steht, werde ich mich auf platin 1 demoten lassen.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}