{"poster":"DonCavallo","date":"2019-01-01T23:08:53.021+0000","title":"La Landa è Divertente","subforum":"Campioni e gameplay","up_votes":3,"down_votes":1,"body":"Dopo 1 mese e passa di blitz al nexus, ho pensato fosse il caso di fare una partita in landa, credendo fosse esagerato il mio &quot;non-amore&quot; verso di essa. Si, insomma, pure per cambiare un p&ograve;. Ovviamente normal.\r\nPrendo un campione per la top con cui non sono bravissimo, ma nemmeno schifoso. Muoio due volte prima dei dieci minuti e quando torno il linea dopo la seconda morte, mi trovo 4 livelli sotto. Minchia, mi sento proprio utile.\r\nE siccome il jungler non &egrave; il mio schiavetto mi trovo a guardare il telefono mentre sono sotto torre aspettando la wave, perch&egrave; ovviamente l&#039;altro freezava.\r\nMinchia che divertimento... Ah, gli altri erano almeno due livelli sopra, e gankare non mi sembrava furbo. Non so, magari s&ograve; io che mi diverto in maniera diversa, ma cos&igrave; &egrave; proprio una rottura di palle.","replies":[{"poster":"chaoswarrior204","date":"2019-01-02T10:42:38.409+0000","up_votes":1,"down_votes":1,"body":"\"muoio 2 volte prima dei 10 minuti\"\n\n Già da questa frase sai il motivo per cui non hai giocato. \n\n\nOgnuno si diverte come vuole ma è inutile dare la colpa alla modalità di gioco per il fatto di essere più scarsi di qualcun'altro (perché se Qualcuno ti battee 1 Vs 1 vuol dire che è più bravo), io la penso al contrario di te e la modalità Blit mi fa schifo perché troppo clownfiesta e soprattutto tutte le partite mi sembrano uguali","replies":[{"poster":"DonCavallo","date":"2019-01-07T15:00:51.815+0000","up_votes":2,"down_votes":0,"body":"Non si muore sempre nei primi dieci minuti, ma converrai con me che capita? Vuoi per un lagspike, vuoi perchè sei oom, vuoi per altre ragioni. Qualunque ragione.\nE' quindi giusto, per caso o circostanza, diventare un minion per 40 minuti?\nNo, non lo è. \n\nViceversa, nelle forfun l'abilità esce comunque e permette a tutti di giocare. Giocate.\nLasciate la competitività negli sport veri.","replies":[{"poster":"chaoswarrior204","date":"2019-01-07T22:35:08.448+0000","up_votes":1,"down_votes":0,"body":"Io sono silver, anche se gioco soprattutto normal, e sono molto scarso però difficilmente muoio 2 volte in meno di 10 minuti 1 Vs 1, e comunque se muori 1 Vs 1 l'abilità si vede: l'avversario è più bravo.\n\nComunque non è vero che se vai 0 2 sei un minion per 40 minuti, dipende da champ a champ ma puoi comunque stringere i denti, giocare Safe, sopravvivere alla laning phase ed essere utile più avanti.\n\nLe modalità for fun sono appunto for fun e l'abilità in quelle conta molto meno che sulla landa, in Blitz riguardando le partite ho scoperto di aver giocato con e contro gente diamond e sinceramente non vedevo la differenza in game mentre se sulla landa becchi un diamond che gioca serio lo noti","replies":[]}]}]},{"poster":"Cyberpop Ashe","date":"2019-01-08T17:56:43.481+0000","up_votes":1,"down_votes":0,"body":"La cosa peggiore è quando sei ADC 10/0 perché hai massacrato la bot lane e pure il jungler quando gankava, sei Dio e puoi massacrare chiunque, ma arriva l'assassin di turno dalla Mid Lane che ti oneshotta prima ancora che tu riesca a fare un auto attacco, e magari in Mid era pure 0/4 con 4 livelli sotto di te, ma solo perché lui è assassin e tu sei ADC lui può oneshottarti prima ancora che tu te ne renda conto.\n\nErano belli i tempi in cui i bilanciamenti erano pensati per rendere il gioco healthy, cioè ogni abilità doveva permettere a chi la subiva di salvarsi, prevederla, schivarla, reagire in qualche modo...e invece ora ti trovi Zed che appena ti ulta sei morto, Akali che missa tutte le Skill ma poi ti prende con la seconda R, fa ignite ed auto e sei morto, Leblanc che si avvicina a te con W-E-Q-R e sei morto (o qualsiasi altra combinazioni di tasti, Leblanc oneshotta e basta). Ho visto una Katarina missare tutto per poi fare solo la R e oneshottare l'ADC usando la E su di lui appena si allontanava dal range. Senza contare poi tutti gli item attivi AP che fanno danno extra (che esistono anche per gli ADC ma fanno così poco danno che non sono considerabili)","replies":[]},{"poster":"Killer SurpRyze","date":"2019-01-08T11:04:31.702+0000","up_votes":1,"down_votes":0,"body":"motivo per cui non gioco nella landa: il primo che diventa più forte, rende il gioco noioso per gli altri. E il gioco dura pure parecchio.","replies":[]},{"poster":"Dr LouD","date":"2019-01-02T10:52:43.186+0000","up_votes":1,"down_votes":0,"body":"Essendo un gioco improntato sulla competizione, è normale che non ci si diverta in situazioni dove l'avversario è dominante","replies":[{"poster":"DonCavallo","date":"2019-01-07T15:02:23.366+0000","up_votes":1,"down_votes":0,"body":"Il problema è proprio il recupero di errori, che in questo gioco non c'è. In blitz, invece, tutto è recuperabile, dato che siamo tutti simili.\nE' come se nel calcio, dopo un gol, la squadra acquisisse 3 giocatori in più. Recuperare è impossibile così.","replies":[{"poster":"Dr LouD","date":"2019-01-08T10:29:01.286+0000","up_votes":1,"down_votes":0,"body":"È stato introdotto il sistema delle bounty nuovo proprio per facilitare il recupero ed evitare lo snowball estremo, e funziona pure decisamente bene","replies":[]}]}]},{"poster":"Rickycek","date":"2019-01-01T23:24:36.602+0000","up_votes":1,"down_votes":0,"body":"Se crepi é normale che resti indietro, se non subissi conseguenze per i tuoi sbagli, non saresti motivato nel provare a resistere e a migliorare, ma andresti allo sbaraglio a morire senza senso, ora smettila di fare lo yasuo main della situazione e fatti una partita dove ti impegni.","replies":[{"poster":"DonCavallo","date":"2019-01-01T23:58:11.397+0000","up_votes":1,"down_votes":0,"body":"Restare indietro è una cosa, diventare un minion è un'altra.\nE non avendo visto la partita, forse non lo sai, ma mi sono impegnato come in qualunque altra. L'unico mio sbaglio era avere un campione da fine partita, contro uno da early. Ma era una blind e non potevo saperlo.","replies":[{"poster":"Rickycek","date":"2019-01-02T08:33:13.005+0000","up_votes":1,"down_votes":0,"body":"Eh va beeeeeee, sai cosa faccio io quando non riesco a fare una minchia in lane? Inizio a gankarena caso e mi rubo le kill dei compagni, tanto a loro non servono.","replies":[]}]}]}]}