{"poster":"Redenctional","date":"2019-03-25T01:19:57.760+0000","title":"Falla en emparejamiento ( Error típico de Riot )","subforum":"Problemas Técnicos","up_votes":2,"down_votes":1,"body":"Como puede  ser posible que en una clasificatoria, siendo mi rango oro 2, me coloquen en el equipo 4 unranks 2 lv 30,40 y los otros 2 100+... pero ese no es el principal problema, sino que en el equipo contrario habían 3 oros 1 platino y 1 diamante de jg, me imagine que los de mi team tenían el mmr alto jugaban muy bien o algo por el estilo, resulta ser que no fue así, regalaron 4 kills al min 2 en la jg y para colmo 3 kills al de mi linea sin dejarme posibilidades, como se imaginaran para el minuto 10 la partida ya estaba totalmente definida sin posibilidad de revertir el resultado con las stats de mi team en 1/7  0/8  etc.. , Como expliquenme puede ser que esto siga pasando?, por que no es nada nuevo, en un pasado yo habia dejado el lol justo por este emparejamiento totalmente defectuoso en el que las partidas son un forma de frustración total y aun seguimos con el mismo problema? es tan sencillo como que pongan oros en mi team, oros en el team enemigo, la verdad no se que factores toman en cuenta para los emparejamientos pero como yo lo veo estos factores estan bastante defectuosos, en un principio no pensaba publicar nada por que esto siempre fue asi en el Lol, pero creo que despues de tantos años ya es hora de que se pongas las pilas y vayan solucionando esto por que me gusta el juego pero lamentablemente se les esta yendo a la mierda. Sin mas que agregar, me despido atentamente y espero escuchen mis plegarias.\r\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"Kanja","date":"2019-03-25T14:39:48.767+0000","up_votes":1,"down_votes":0,"body":"eso... eso en los parentesis deben significar algo como... mmm... un \"insulto indirecto\"?\n\ntus rankeds perdidas no van a volver por quemarte las yemas de los dedos escribiendo lloriqueos en los foros","replies":[]},{"poster":"Ogata Isshinsai","date":"2019-03-25T13:15:14.743+0000","up_votes":1,"down_votes":0,"body":"Ñiñiñiñiñi... llantos es lo unico que leo ñiñiñiñi llantos y excusas","replies":[]},{"poster":"iNGENiO","date":"2019-03-25T02:05:53.333+0000","up_votes":1,"down_votes":0,"body":"La verdad que vi las stats de la partida y los rangos de todos. Si bien no fue como vos lo contaste.\n\nIgualmente el emparejamiento no fue a tu favor claramente.\n\nPuede que tengas el mmr alto.","replies":[]},{"poster":"Tortuguita","date":"2019-03-25T01:41:30.221+0000","up_votes":1,"down_votes":0,"body":"Solo existen dos cosas que el sistema de Riot permite y es por ello que se sigue jugando Rankeds:\n\n* ¿Se puede subir con tu skill solamente? Si\n\n* ¿Va ser un disgusto total el tener que tragarse estas partidas? Si\n\nY ya esta, desde la S3 que es así y no creo que lo cambien. Plus están haciendo reset en diamante porque se les fue de las manos el sistema, tengo amigos que subieron 3 divisiones como si nada y siguen jugando igual de mal xD","replies":[]}]}