{"poster":"LeagueOfLegendš","date":"2015-05-20T03:06:31.116+0000","title":"IP into RP","subforum":"Miscellaneous","up_votes":3,"down_votes":2,"body":"**Okay firstly, please read the full wall of text prior to commenting; as I suspect this is will be a toxic inflamed thread.**\r\n\r\nI would like to straight off the bat like to mention I own 510+ skins, and have spend well and truly over $3500 AUS within league of legends, The reason I mention this is because I&#039;m not trying to throw myself at the community and come up with a suggestion (which yes I realize has been brought up many times over)\r\n\r\nI myself have owned all the champions, and runes for a long time; every time a new champion comes out, I buy the Champion+Skin bundle as I have OCD about owning a skin for every champion. Anyways the point I&#039;m trying to make Is As I own everything obtainable via IP, my IP balance just climbs and climbs I&#039;m now sitting on 140&#039;000 IP and nothing to spend it on. Now yes I could buy the new champions that get released with my IP but like I mentioned above I am a skin collector and need a skin for each champion.\r\n\r\nI&#039;m not an overly big fan of the idea of have an IP to RP converter, and I do agree with everyone&#039;s opinions on that Riot needs their income as that&#039;s basically their only source; but in saying this they have already made their way to the top of the food chain in terms of player base, and now with the recent 2.9 million drop of subscribers on World of Warcraft, as well as the recent &#039;Monster ban-wave&#039; that happened, that&#039;s knocked even more out from World of Warcraft, games such as Minecraft, Runescape, Battlefields/Call of Duties, all constantly drop in player base, and as them players leave, one game in the end does shine above all and take them gamers, and fulfill their desires, that being League of Legends.\r\n\r\nAnyways I wanted to point out a few things I have brainstormed and placed together via reading multiple other threads which suggests the same idea of IP to RP,\r\n\r\n1. A above normal rate of conversation for example 10k IP to 600-975RP or even more dramatic such as 10k IP to 100RP, now really think about this; is this going to drastically change the economy to a point Riot would no longer make money? The answer is fairly clear, and that&#039;s a &quot;No&quot;\r\n\r\n2. RP to IP is a silly idea, as this game would then become a Pay2Win, which would only be a negative effect on the player-base.\r\nIn saying this though, IP boost are purchasable and these in a sense are a P2W just capping a player for a shorter time limit comparing to others.\r\n\r\n3. If said suggestion ever were a possibility then make it an unlock-able feature, for players which have unlocked absolutely every thing which is buyable via IP, and for when a new champion is released, have the feature then turned off for individual players with it unlocked.\r\n\r\n4. Tag the RP which has been converted, so the RP can not be spent on new skins that have been released within the past 1-3 months, This now reduces the amount of summoners which will spam exchange their IP as lets be honest &#039;skin&#039; collector outright buy old skins, they only buy new skins, and waits for sales for them ratty old skins.\r\n\r\n5. Limit the amount of exchanged Ip to RP per week, so no spammed conversion can be made. This also draws back the player base to re log in and keep their accounts active and the traffic volume high.\r\n\r\n6. Other games like Heroes of the Storm have this conversion already implemented into the game features allowing players to purchase cosmetic upgrades to their champions for both In-game currency and real-life currency.\r\n\r\n7. This comment is purely for the players who are instantly going to flame this post, obtaining Ip is a very tedious and repetitive act, and realistically collecting X amount of IP to exchange into Y amount of RP would take a very long time, But what you have to remember and this is where a lot of players who bring this touchy subject up fail to mention is a future headed thought process with this.\r\n\r\nE.g Summoner Jack, own every champion and ever rune/pages, he no longer requires a use for IP, he then exchanges X IP for Y RP and now can buy the a skin, Summoner jack now has a balance of 20IP he now can not afford anything within the LoL Store, he now has to play multiple games to earn enough IP to either 1. buy the new champion just released or 2. buy another new skin. He now has to log in and continusely play to keep earning the IP, this means Traffic for Riot. which end game yes payments to employee&#039;s is important, it&#039;s what keeps the game updated and running, but traffic is what keeps the numbers high, what keeps new players to join in on the fun filled action.\r\n\r\nThe Pro&#039;s and Con&#039;s to this suggestion are listed here, more in depth then what other posters have come up with; No one is looking at the bigger picture here.\r\n\r\n**Pro&#039;s**\r\n* Players with enormous amounts of IP are finally able to use it for something other then collecting dust.\r\n* As players now find out about a IP to RP exchange tool it will draw old summoners and new summoners alike to re-enter the fields of justice.\r\n* It keeps the traffic high as players will keep playing more games, but also bring in new traffic as the player-base is higher then usual.\r\n* Because the player base is high means new players will come with their wallets, and old summoners will return with their wallets.\r\n\r\n**Con&#039;s**\r\n* Less money to the riot employee&#039;s and CEO&#039;s of Riot\r\n* Less money towards the company could mean less updates and a decline in staff\r\n\r\nThere&#039;s a strict _Formula_ to this method which a lot of you posters which I&#039;m sure are raging to flame about but please read this part if you choose not to read/listen to the rest.\r\n\r\n_Formula_ \r\n_RP to IP conversion draws new/old players back to the game = More traffic to the game and a higher volume of player-base = Secretly a higher income base to the Riot store ~~minus~~ The very small Micro-transactions which players won&#039;t make because of the conversion system = Loss of profit + a much higher Player-base as well as a higher income from new and old players alike = Win/Loss/Win scenario _\r\n\r\nUltimately Riot would not have a negative over positive effect, and would actually have a positive effect to\r\n1. Keeping players which have abundance amount of IP happy = Less toxic players\r\n2. Less toxic players in general as players would finally have their skin they have wanted\r\n3. Draws a new crowd of players which don&#039;t &quot;spend&quot; money on F2P games\r\n4. High player-base to keep on top of other games\r\n5. Higher long-term income rather then the very short lived short-term income drop.\r\n\r\nReally consider what&#039;s been put in front of you and before judging and saying &quot;you&#039;re stupid y u make rito die?&quot; take into consideration this isn&#039;t a ~~SUGGESTION~~ this is rather a brainstorm of idea&#039;s to come to a possibly conclusion.\r\n\r\n{{champion:134}} Regards - Summoner","replies":[{"poster":"LemonHunter","date":"2015-05-20T03:25:00.971+0000","up_votes":3,"down_votes":0,"body":"I'm not too sure if a straight IP to RP converter system would work. You raise many valid points. Perhaps the way to approach this could be you can X amount of IP to get a discount off your next RP purchase?\n\nRP is there to be a premium currency. Yes IP does take a long time to grind, but IP can be earned by investing time, no money. I think discount on RP by using RP would be a good middle ground on this.\n\nJust my thoughts.","replies":[{"poster":"TouchMyKimchi","date":"2015-05-20T04:23:20.206+0000","up_votes":1,"down_votes":1,"body":"Lel.\n\nThis guy smacked the whole OP in a couple of sentences. \nGood Idea.","replies":[{"poster":"noogai","date":"2015-05-20T08:55:05.759+0000","up_votes":2,"down_votes":0,"body":"\"this guy smacked the whole OP in a couple of sentences.\"\n\nNo. What he did was offer a differing opinion, and a bit of insight. He didn't shoot down or directly debate/rebutt anything the OP stated, just stated his own opinion.\n\nYou need to learn a few things about the english language. First up, is a thing called \"context\".","replies":[]}]},{"poster":"LeagueOfLegendš","date":"2015-05-20T03:37:28.412+0000","up_votes":1,"down_votes":0,"body":"This is a valid point and It raises my thoughts to what you have said, even if said X IP to Y RP is to far fetched, then I do like the idea of a Discount of your next RP purchase or a middle ground of putting more purchasable content for IP within the game.","replies":[]}]},{"poster":"DRAG0NFEU","date":"2015-05-20T12:02:11.393+0000","up_votes":2,"down_votes":0,"body":"We need to stop inflation but this isn't the way to do it.\n\nSomething expensive, for sure, but not IP/RP, Riot will never agree ahaha","replies":[]},{"poster":"DrMattie","date":"2015-05-20T09:06:18.819+0000","up_votes":2,"down_votes":0,"body":"I think that he has made valid points, I own every champion and now I just stack up IP and insta-buy the newest champions. I just sit here with shit tons of IP and nothing to do with it except wait. However for Riot to continue making a profit the exchange rate would have to be low as possible for people to still buy RP.","replies":[{"poster":"ShuffledPancake","date":"2015-05-20T09:22:23.423+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FuckHead,realm=OCE,application-id=Ntey9fRZ,discussion-id=EprFGqjh,comment-id=0006,timestamp=2015-05-20T09:06:18.819+0000)\n>\n> I think that he has made valid points, I own every champion and now I just stack up IP and insta-buy the newest champions. I just sit here with shit tons of IP and nothing to do with it except wait. However for Riot to continue making a profit the exchange rate would have to be low as possible for people to still buy RP.\n\nIp giveaways... lol so ez","replies":[]}]},{"poster":"GoldenTomat0","date":"2015-05-20T03:58:26.399+0000","up_votes":1,"down_votes":0,"body":"why don't you buy the champ with IP and then the skin with RP? that way you spend less RP and have a way to get rid of your IP.\n\nand how will riot earn money if people can convert IP into RP? there's no real money being transacted there. doubt it'll ever happen.","replies":[{"poster":"LeagueOfLegendš","date":"2015-05-20T04:39:42.453+0000","up_votes":1,"down_votes":0,"body":"Easier to buy as a bundle, also you can purchase at a cheaper rate buying as a bundle, plus to add on to this, the first week of release is a lot more expensive for IP.\n\nIn terms of Riot earning money id you even read my discussion as it's mainly base around they could and would still earn money.","replies":[{"poster":"Wumachine","date":"2015-05-20T08:51:52.472+0000","up_votes":2,"down_votes":0,"body":"um, but if you have 140000 ip stacking up, and a champ is only released every few months. please enlighten me, in what world is buying the bundle **CHEAPER** than just the skin, and the champ seperately with your **140000**ip","replies":[]},{"poster":"kJs","date":"2015-05-20T14:43:49.569+0000","up_votes":1,"down_votes":0,"body":"Buy champions with IP, I always do. The reason why new champions are priced higher than 6800 IP is because it allows old players to spend some of their stacked up IP. I really don't think it's efficient to use all RP to buy bundles when you could theoretically get a champion for free with a seemingly infinite amount of IP.","replies":[]}]}]},{"poster":"vicelore","date":"2015-05-20T03:19:10.940+0000","up_votes":2,"down_votes":3,"body":"You need to get out more lol..","replies":[{"poster":"LeagueOfLegendš","date":"2015-05-20T03:26:06.086+0000","up_votes":2,"down_votes":0,"body":"This is a very one sided statement, as it's my life and my decision on the choices i make and the thing I spend money on.","replies":[]}]},{"poster":"BladeSensual","date":"2015-05-20T03:24:53.704+0000","up_votes":2,"down_votes":0,"body":"maybe not this exactly but something else to buy with ip would b nice, maybe like chromas for ip or have a wide array of icons/ward skins that become available for playing the game for so long. in the 3 years i have played i have spent alot and earned alot. i may not have over 100,000 ip but something to compensate like an icon for 1000 wins that you can buy with ip would b nice i think","replies":[{"poster":"Wumachine","date":"2015-05-20T08:49:26.115+0000","up_votes":1,"down_votes":0,"body":"chromas for 6300 ip would be great","replies":[]},{"poster":"LeagueOfLegendš","date":"2015-05-20T03:38:34.287+0000","up_votes":1,"down_votes":0,"body":"This is a valid point and It raises my thoughts to what you have said, even if said X IP to Y RP is to far fetched, implementing a middle ground of putting more purchasable content for IP within the game could be a good move upon Riots case.","replies":[]}]},{"poster":"Fruitlewp","date":"2015-05-20T14:07:03.308+0000","up_votes":2,"down_votes":1,"body":"If you're gonna spend $3500+ on skins for a free-to-play then I think their model is working better than anticipated (on your part especially) and is thus highly unlikely to warrant change.\n\nOld players with enormous amounts of IP have obviously already played as much of the game as they were going to. The ability to purchase a skin probably won't change that. A converter isn't going to massively increase the game's playerbase - why would it? Old players may return for any number of reasons but I doubt a converter would be high on the list. New players - if they really are new - have a small roster that they'll gradually increase with IP, to whom the suggested converter is rather pointless as they're not going to have any build-up.\n\nAnyway, as I originally said, the system's obviously working as intended. Heaps of people have skins now for most of their champs; it's highly unlikely you'll find a game in which everybody is using the default skin. There's no reason for riot to change that. At the most they could release some other IP-based commodity, a host of summoner icons or badge changes associated with IP. The IP build-up is inevitable when you've been playing for so many years, and unfortunately league isn't the sort of game to give you a new level cap or persistent benefits; skins are different because they're purely cosmetic items bought with a premium currency, that have no effect on gameplay. \n\nBesides, no matter how ridiculous the conversion rate, if people can farm it, they will. You'll potentially open the game up to farmers and bots designed to build up heaps of IP, convert it, and sell the RP to players at a reduced cost. They'll call it the skin black market. :P","replies":[]},{"poster":"Yasei Doubutsu","date":"2015-05-20T03:12:36.242+0000","up_votes":2,"down_votes":1,"body":"I actually like this. \nIve sent multiple said concerns to riot about IP inflation and left over (waste) RP.","replies":[{"poster":"LeagueOfLegendš","date":"2015-05-20T03:39:22.589+0000","up_votes":1,"down_votes":0,"body":"This ^","replies":[]}]},{"poster":"oops","date":"2015-05-20T06:05:45.344+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=LeagueOfLegendš,realm=OCE,application-id=Ntey9fRZ,discussion-id=EprFGqjh,comment-id=,timestamp=2015-05-20T03:06:31.116+0000)\n>\n> **Okay firstly, please read the full wall of text prior to commenting; as I suspect this is will be a toxic inflamed thread.**\n> \n> I would like to straight off the bat like to mention I own 510+ skins, and have spend well and truly over $3500 AUS within league of legends, The reason I mention this is because I&#039;m not trying to throw myself at the community and come up with a suggestion (which yes I realize has been brought up many times over)\n\n>I myself have owned all the champions, and runes for a long time; every time a new champion comes out, I buy the Champion+Skin bundle as I have OCD about owning a skin for every champion.\n\nPeople like you are the reason IP will never be interchangeable with RP.","replies":[]}]}