{"poster":"Save","date":"2016-08-05T19:46:24.715+0000","title":"Ping","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"Throughout my time of playing League of Legends I&#039;ve never really had any issues with my ping in-game, until recently. I live on the east coast of the U.S. and on average I play on a ping of 30-50, before the server switch a few months ago I played on about 50-60, neither are a problem. However, these past few days since the patch BEFORE the PROJECT: theme client and even after the PROJECT: patch itself, my ping has been spiking, A LOT. Maybe every few games I would get ping spikes mid game of 100-150 that would last just about a minute so it was tolerable. As mentioned, my ping has been spiking a lot more often than usual and it peaks higher to an unplayable 200-400 that lasts for about 5-10 minutes, this has been happening about every other game, it&#039;s really annoying. **This has also been happening to some of my friends but their situation hasn&#039;t been as bad as mine.\r\n\r\nI&#039;m posting this to simply put out notice to Riot that something happened to my ping with these past client changes. If anyone knows any solutions, feel free to post.\r\n\r\nThanks.","replies":[{"poster":"Deep Terror Nami","date":"2016-08-05T19:58:07.828+0000","up_votes":1,"down_votes":0,"body":"Please follow the steps (if there are any you haven't completed) on the [Connection Troubleshooting Guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to make sure your connection is set up properly.\n\nIf those steps don't help, you can view your connection by running a traceroute, and sharing the results might show us where it's going wrong. I suggest downloading the [WinMTR Network Diagnostic Tool](http://winmtr.net/download-winmtr/), then use that to run a traceroute to the following IP (allow this to run for 5-15 minutes);\n\n> 104.160.131.1\n\nExport the results to a text file and paste them here if you need help reading them. If you need further assistance, please post over on the **Help & Support** board and they will be happy to help you out (they may direct you to a [Support Ticket](https://support.riotgames.com/hc/en-us/requests/new) if you cannot resolve the issue).","replies":[]}]}