{"poster":"Obstler","date":"2016-08-18T00:55:29.666+0000","title":"Team mit Coach und Analyst sucht ADC [D5+]","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Wir, von Smart Solution Gaming (SSG), sind eine Organisation, welche zur Zeit aus 30 aktiven Mitgliedern und mehreren Teams besteht. Wir sind momentan noch im Aufbau. Der Hauptteil der Spieler befindet sich im Platin und Diamant Bereich. \r\nIm Fokus steht die Teilnahme an offiziellen Tunieren, Cups und Veranstaltungen und streben als Organisation die ESL an. Aber auch die Verbesserung der einzelnen Spieler, Teams sowie die Harmonie in der Organisation haben bei uns oberste Priorit&auml;t.\r\nDabei helfen sich die Teams untereinander durch pers&ouml;nliche Erfahrungen, interne Testspiele (scrims) und professionelles Coaching.\r\n\r\nEin kleiner Vorgeschmack auf die Organisation ist der folgende Link: \r\nhttps://drive.google.com/open?id=1YG7jvIRVG0Ybbgk5OQUNZ8qlWTsEWqFVjpvltbi3Bt4\r\n\r\nWas Ihr erf&uuml;llen solltet:\r\n-aktive Teilnahme, d.h mind. 2x Training in der Woche\r\n-nach Absprache der Zeiten, diese auch einzuhalten\r\n-jede bzw. jede zweite Woche die Teilnahme an Tunieren und Cups\r\n-gro&szlig;es Interesse als Team zusammenzuarbeiten und sich als Team zu verbessern\r\n-Engagement und Euphorie\r\n-geistige Reife\r\n\r\nWir suchen zur Zeit daher vor allem:\r\nADC\r\n\r\nder sich im Diamant 5+ befinden. Auch wir wollen von Euch neue Sachen, Mechanics, Strategien usw. lernen. \r\n\r\nWichtig dabei: Step for Step!\r\nDieser Prozess wird eine lange Zeitdauer in Anspruch nehmen und wir wollen etwas langanhaltendes, weil wir selber auch eine gewisse (Semi-)Professionalit&auml;t erreichen m&ouml;chten. Denn die Kommunikation/Synergie muss stimmen!\r\n&ldquo;Rom wurde auch nicht an einem Tag erbaut&rdquo;\r\n\r\nWenn wir Euer Interesse geweckt haben, dann addet:\r\nCoach: &ldquo;Obstler&rdquo; \r\nOrganisation: &ldquo;Webzec&rdquo;","replies":[{"poster":"Sebbo99","date":"2016-08-18T07:11:43.454+0000","up_votes":1,"down_votes":0,"body":"Falls die frage niemandem was aussmacht...\nWas ist ein analyst?","replies":[{"poster":"Vandaro","date":"2016-08-18T08:29:09.564+0000","up_votes":1,"down_votes":0,"body":"Analysiert Games von dem Team und bespricht sie mit dem Coach um z.B. neue Taktiken zu finden oderso","replies":[]}]}]}