{"poster":"WolfSunny","date":"2018-10-26T17:35:57.605+0000","title":"FPS bassi con una buona configurazione","subforum":"Aiuto e supporto","up_votes":1,"down_votes":3,"body":"Salve amici evocatori, da qualche giorno sono passato dal mio vecchio ed obsoleto portatile ad un pc asseblato da gaming con (gtx nvidia 1070ti,16gb di ram e un i5 di ottava generazione) il fatto &egrave; che con il portatile giravo su una media di 120 FPS ora invece sono sui 40 FPS se tutto va bene! alle volte ho dei cali paurosi. Qualcuno pu&ograve; aiutare un povero jungler a risolvere questo problema grazie a tutti.","replies":[{"poster":"Saibbo","date":"2018-10-26T23:10:04.214+0000","up_votes":1,"down_votes":0,"body":"Controlla che stai usando la GPU e non la grafica integrata intel","replies":[]},{"poster":"Giunco171","date":"2018-10-26T18:17:02.486+0000","up_votes":1,"down_votes":0,"body":"se il portatile ti dava 120 fps perchè diavolo ti sei assemblato un pc nuovo? Comunque dai pochi dati che hai scritto nessuno ti può dire il problema ma solo ipotizzarlo, e forse indovinarlo, si più specifico e dimmi che non hai fatto questa configurazione solo per giocarci. Per favore!\n\n\nEdit: è più importante avere dati riguardanti hard disk ed eventuale ssd piuttosto che la ram. https://support.riotgames.com/hc/it/articles/201752654-Requisiti-di-sistema-minimi-e-consigliati\nguardando il link capisci che non può essere un problema di potenza della ram, visto che ne richiede 2GB come requisito ottimale. Credo che non esistino nemmeno più PC con 2 gb di ram.","replies":[{"poster":"WolfSunny","date":"2018-10-26T19:17:52.188+0000","up_votes":1,"down_votes":0,"body":"Di certo ho fatto il cambiamento per giocare a giochi più pesanti come magari il nuovo CoD ma non unicamente per Lol. Comunque ho un ssd e un Harddisk da 1 TERA L'UNO.","replies":[{"poster":"Giunco171","date":"2018-10-26T19:23:20.945+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WolfSunny,realm=EUW,application-id=98NGV4Al,discussion-id=3EngWqg3,comment-id=00010000,timestamp=2018-10-26T19:17:52.188+0000)\n>\n> Di certo ho fatto il cambiamento per giocare a giochi più pesanti come magari il nuovo CoD ma non unicamente per Lol. Comunque ho un ssd e un Harddisk da 1 TERA L&#x27;UNO.\n\nIl mio problema è proprio che sprecate certe bestie per giocare a video giochi , ma so soldi vostri quindi non mi interessa. Hai preso la configurazione da qualche video/lista o l'hai fatta tu? se è il primo caso linka il video/lista, a prescindere da tutto, potrebbe essere un errore del client di lol, quindi ti consiglio di usare l'Hextech Reparing tool della Riot, prendere i dati e inviarli al supporto tramite ticket, quantomeno hai una sicurezza concreta.\n\nEDIT: non so quando tu abbia comprato il PC ma mi auguro che tu abbia formattato l'hard disk prima di installarci LoL, alle volte riordinare i quadranti dell'HD è essenziale.","replies":[{"poster":"WolfSunny","date":"2018-10-26T19:33:28.184+0000","up_votes":1,"down_votes":0,"body":"Sono andato ad un negozio che si occupa di configurazioni e me ne hanno fatto uno su misura per il mio budget, i componenti sono tutti nuovi","replies":[]}]}]},{"poster":"BonderWind","date":"2018-10-26T19:22:51.206+0000","up_votes":1,"down_votes":0,"body":"Bell'acquisto, ho letto in una recensione che con quella scheda dovrebbe girarti con a 200 210 fps. Non ho idea, quando risolvi avvisa, l'unica cosa è l'i 5 di ottava generazione che mi viene in mente. Hanno una potenza base abbastanza bassa che pero overclocka alla grande. Hai configurato dal pannello di controllo il pc su \"prestazioni elevate\"?","replies":[{"poster":"WolfSunny","date":"2018-10-26T19:25:55.538+0000","up_votes":1,"down_votes":0,"body":"A me basterebbero anche 100 fps anche percè dopo i 120 nemmeno percepirei la differenza, comunque ho impostato tutto da li, ho provato a disinstallare e rinstallare LOL ma nulla. :(","replies":[{"poster":"BonderWind","date":"2018-10-26T19:28:56.161+0000","up_votes":1,"down_votes":0,"body":"È su prestazione elevate o bilanciato nelle impostazioni di risparmio energetico? Potrebbe non essere un problema di lol, controlla il sistema operativo","replies":[]}]}]}]},{"poster":"RGM Player","date":"2018-10-26T18:08:05.314+0000","up_votes":1,"down_votes":0,"body":"È troppo generica come descrizione del problema, devi controllare da gestione attività l'utilizzo della CPU e della memoria mentre sei in game ed escludere che ci siano programmi in background che utilizzano un'elevata quantità di CPU e memoria.","replies":[]}]}