{"poster":"SchattenkriegerX","date":"2016-09-05T21:36:02.809+0000","title":"Rengar mal stark und mal schwach?!","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hi, ich habe momentan vor mit rengar zu trainieren um ihn zu meinen, das er nicht einfach zu spielen ist war mir schon vorher klar und so sahen auch meine erstem spiele mit ihm aus. Jetzt hab ich schon einige Spiele mit ihm hinter mir und Wunder mich etwas wie unterschiedlich meine spiele mit ihm ausfallen, in einem Spiel bin ich komplett nutzlos und im darauffolgenden carry ich mein Team 0.o an meinem bzw dem gegnerischen Team kann es eigentlich kaum liegen da ich sowohl in spielen gut/schlecht bin in den wir problemlos gewinnen als auch in spielen in denen mein Team kaum eine Chance hat. Jetzt frag ich mich nat&uuml;rlich wieso das so ist, ich spiele immer mit der selben Masterie (auf thunderlord)  und mit den selben Runen (Ad, R&uuml;stung, Mage resi und armor pen). An sich ist es doch sehr unwahrscheinlich, dass ich mal in spielen rutsche in denen die anderen Spieler komplett besser sind als ich und mal in welche in denen ich besser bin als der Rest (also ausnahmslos besser bzw schlechter als 9 andere spieler). Brauche ich vielleicht einfach mehr &Uuml;bung mit ihm und es ist quasi Gl&uuml;ck, wenn ich gut bin? \r\n\r\nUnd noch eine andere Frage n&auml;hmlich: kann es sein, dass rengar im Lategame ziemlich nachl&auml;sst?  (eigentlich doch nicht oder?) hatte jetzt schon mehrfach spiele in denen ich im early und mid keine Probleme hatte Und einen kill nach dem anderen gemacht habe, aber im late einen Tod nach dem anderen bekommen habe. Liegt das also an rengar oder eher daran, dass ich mich evtl &uuml;bersch&auml;tze wenn ich mit rengar gefeedet bin und das im late ja nichts mehr bringt?","replies":[{"poster":"Câstiél","date":"2016-09-06T12:05:17.871+0000","up_votes":1,"down_votes":0,"body":"Ich bin grade am arbeiten, aber wenn du magst können wir heut Abend im Client mal schreiben. \nBin auch seit etwas länger hauptsächlich Rengar-Main (Nur Gold), mit Rengar ist das tatsächlich so ne Sache... Kanns dir aber gern heut Abend oder wann anders erklären was ich mein, dir vllt auch helfen, wenn du Lust hast :)","replies":[{"poster":"SchattenkriegerX","date":"2016-09-06T15:43:57.708+0000","up_votes":1,"down_votes":0,"body":"Ja gerne danke :)","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2016-09-06T02:58:28.950+0000","up_votes":1,"down_votes":0,"body":"Rengar ist halt ein extremer Snowball Champion. Etwas übertrieben (also auf LCS Niveau hoch gerechnet) gilt da folgende Formel: Dein erste Level 6 Gank muss sitzen und 2 Kills für dein Team sichern.\nIn der Low Elo SoloQ hat man natürlich auch die Chance, vorher über seinen Sprung aus dem Busch Kills abzugreifen (bin vorhin deswegen echt dämlicher Weise gestorben...). Aber wenn du diese Early Game Kills nicht kriegst... dann springst du den gegnerischen ADC an, tötest ihn nicht, stirbst danach selber.... und das ist dein einziger Beitrag zum Teamfight...\nGenau deswegen ist Rengar ja auch entgegen aller Gerüchte gebalanced. Ja, man muss seine Spielweise gegen ihn ein wenig anpassen (#BuyPinks). Man muss verhindern, dass er ins Laufen kommt. An sonsten ist man komplett nutzlos. Und dieses Komplett Nutzlos tritt halt öfters ein als das \"ich oneshotte alles und jeden\"... \nUnd das wirklich schöne an LoL ist ja: Rengar Main zu spielen, ist trotzdem (also obwohl ich es bei meiner Spielweise als komplett sinnlos erachte... mein Fokus liegt halt woanders) komplett viable... Dadurch wird dieses eigentlich sehr monotone Spiel doch überraschend Abwechslungsreich. Man muss aber halt immer wissen, wann seine Champions stark sind und genau diese Stärken ausnutzen...","replies":[{"poster":"SchattenkriegerX","date":"2016-09-06T06:31:40.456+0000","up_votes":1,"down_votes":0,"body":"Also wenn es mein Team nicht interessiert, dass ich ihre Lanes am Anfang ganke ist ihre gerechte Strafe dafür quasi, dass ich (unabsichtlich) feede oder zumindest nichts bringe?","replies":[]}]},{"poster":"Balmung","date":"2016-09-06T01:37:18.620+0000","up_votes":1,"down_votes":0,"body":"Das du so gemischte Ergebnisse hast liegt an mehreren Dingen:\n\n1. Rengar ist Hit or Miss. Entweder du packst es weich(-ere) Ziele zu picken/oneshotten oder nicht.\nBei ersterem bestimmt du das Spiel für die Gegner - bei letzterem kann man froh sein wenn du nicht feedest.\nDa deine Skills zusätzlich mit Level scalen und die Passive mit Kills erst brauchbar wird...ehrm, ja - entweder man snowballed oder man ist eher ein Klotz am Bein.\n\n2. Du selbst hast sehr inkonsistentes Gameplay, wie ~95% der Community. Das ist völlig normal und liegt auch nicht an Rengar - ich würde jedoch Champions mit weniger Mechanic und nötiger Mapawareness empfehlen. Falls es nur um's climben geht, gerade da Rengar vergleichsweise viel Planung erfordert um Farm und Ganks und einen Hut zu bekommen...und gleichzeitig nicht die einfachste Zeit im Jungle hat.\n\n3. Rengar ist für Picks oder zum splitten konzipiert, was einfach in den unteren Elos quasi nie geschieht. Da entwickelt sich häufig einfach ein ARAM in der Mitte oder irgendwer rennt eh so stumpf in der Gegend rum, dass man ihn einfach engaged und dann die nächstbeste Lane runterollt.\nDafür spielt sich Rengar eigentlich zu taktisch. Das können Champions wie Amumu oder Volibear besser.","replies":[]},{"poster":"TerrorRaven","date":"2016-09-05T21:43:22.271+0000","up_votes":1,"down_votes":0,"body":"Rengar hat das selbe Problem wie Riven oder Yasuo: Wenn er hinten liegt, ist er völlig nutzlos. Es muss in Führung liegen, um Relevant zu bleiben. Daher wechselt sein Late vom Spiel zu Spiel. Mal feedet er wie blöde und mal zerstört er 1v5. Deswegen bekommt er beim Assassine-Update in der nächsten Pre-Season eine Überarbeitung.","replies":[]}]}