{"poster":"SchattenkriegerX","date":"2016-06-21T21:00:07.635+0000","title":"Panthen zu schwach im Lategame?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hallo, ich habe vor kurzem angefangen mit pantheon zu spielen, es l&auml;uft auch ganz gut aber ich habe gemerkt (und auch gelesen), dass er im Lategame immer nutzloser wird.  Am Anfang im jgl ist es schwer durch zu kommen aber ab lvl 3 (und einem back) ist alles super,  danach fange ich an zu ganken und fange an kills zu machen (und nebenbei jgl ich weiter wenn es gerade nichts zu ganken gibt)  das ist dann auch die Zeit in der ich die meisten kills mache aber ab so ca lvl 15 - 17 wird es wirklich schwer und wenn ich auch nur kurz gegen zwei oder mehr Gegner k&auml;mpfen muss bin ich Tod oder auf dem besten Wege dahin. Da ich auch in den toturials schon gelesen habe dass es f&uuml;r im im Lategame wirklich schwer wird kann das ja nichtcht nur an mir liegen. Aber wie soll ich ihn im Lategame spielen damit er mehr beachtet wird als ein unterfeedeter adc?  Oder muss ich versuchen das Spiel gewinnen bevor das Lategame &uuml;berhaupt beginnt? Ich mag diesen Champion echt gerne aber das nimmt einem schon etwas den spielspa&szlig; :(","replies":[{"poster":"SchattenkriegerX","date":"2016-06-21T21:30:07.033+0000","up_votes":1,"down_votes":0,"body":"Das ist ja auch keine Kritik daran dass er zum Ende hin schwächer wird... Mich würde nur interessieren ob es eine Möglichkeit gibt (bzw eine Technik) mit der Manager Ende immernoch mitspielen kann (wenn das Spiel doch mal länger dauert)  oder ob es wirklich quasi unmöglich ist überhaupt noch etwas auszurichten, da man ja auch nicht a la nautilus alleine schon mit stuns und slows helfen kann","replies":[{"poster":"SorisDynasty","date":"2016-06-21T21:38:52.109+0000","up_votes":1,"down_votes":0,"body":"Splitpushen, Ult für globalen Druck nutzen, Carrys versuchen zu oneshotten(mit Hilfe der Ult)... viel mehr fällt mir für Pantheon nicht ein, da ich ihn nicht selber aktiv spiele. Das ist auch sehr allgemein halten, weil man sonst 100 Spezialfälle durchgehen könnte, und das will niemand.","replies":[{"poster":"SchattenkriegerX","date":"2016-06-21T21:44:35.820+0000","up_votes":1,"down_votes":0,"body":"Ok Danke :) dann Üb ich noch etwas mit ihm das Lategame und spiele vorerst etwas defensiver im Lategame :)","replies":[]}]}]},{"poster":"SchattenkriegerX","date":"2016-06-21T21:07:34.267+0000","up_votes":1,"down_votes":0,"body":"Und wenn das nicht möglich ist? Ist er im Lategame überhaupt noch spielbar oder ist es sinnvoller aufzupassen möglichst nicht zu nahe an einen Gegner zu kommen?","replies":[{"poster":"SorisDynasty","date":"2016-06-21T21:24:51.247+0000","up_votes":1,"down_votes":0,"body":"Spielbar ist jeder noch im Lategame. Nur für ihn wird es unangenehm, da er keinen zuverlässigen Gapclose hat, auf Damage schnell sterben kann und mit einem tanky Build nicht genug Schaden haben wird.\nWenn du es im Lategame schaffst, 1-2 Carrys rauszunehmen dank einer guten Ult, hast du auch so deinen Job gemacht. Nur das zu bewerkstelligen... ist was anderes.\n\nWenn dir Pantheon Spaß macht, spiel ihn weiter. Solche Sachen verlangen auch Übung. Und Lategame erreicht man nunmal auch nicht so häufig, das man das oft üben kann.  Daher wird es eventuell noch eine Weile so sein, dass du im LG keine Ahnung hast, was du machen sollst. Aber früher oder später wird das schon. Ansonsten... lerne, das Spiel frühzeitig zu beenden als Pantheon. :)","replies":[]}]},{"poster":"Chadoo","date":"2016-06-21T21:17:25.798+0000","up_votes":1,"down_votes":0,"body":"Mal gegen Pantheon gelaned? Macht keinen Spaß meistens killt er seinen Gegner wenn dieser sich nicht komplett passiv verhält und selbst das führt dann natürlich dazu dass man outfarmed wird. Wäre ja auch noch schöner wenn Panth im lategame auch noch stärker wird. \n\nGanz ehrlich ich empfehle dir nimm einen anderen Champ oder versuche das Spiel schnell zu beenden.","replies":[]},{"poster":"JannaTheSecond","date":"2016-06-21T21:03:43.507+0000","up_votes":1,"down_votes":0,"body":"Das ist genau richtig so. Pantheon soll alles im Early zerstören. (Er ist gerade der stärkste Champ im Early). Du musst versuchen im Midgame das Spiel zu beenden.","replies":[]}]}