{"poster":"Achilles53","date":"2015-07-23T22:12:09.839+0000","title":"Accountsperrung","subforum":"Hilfe & Support","up_votes":2,"down_votes":3,"body":"Hey Leute, mein Account wurde wegen Beleidigungen Permanent gesperrt. Es hiess das ich den Support anschreiben soll, um den Vorfall zu erl&auml;utern. Dies habe ich auch getan und warte jetzt auf eine Antwort. Meine Frage w&auml;re dann: Wird mein Account wiederhergestellt und wie lange wird das etwa dauern? Ich finde es sehr schade, dass man direkt Permanent gebannt wird, wenn man ein mal im Chat Flucht. Klar kann ich das nachvollziehen, doch eine Permanente Sperre? Jeder hat mal einen schlechten Tag. Ich spiele jetzt schon seit 1.5 Jahren und ich f&auml;nde es sehr schade wenn ich wegen dies jetzt Permanent gebannt werde und alles erneut erspielen muss. Auf eure Antwort w&uuml;rde ich mich sehr freuen .\r\n\r\nLiebe Gr&uuml;sse Achilles53","replies":[{"poster":"Snowgen","date":"2015-07-23T22:21:19.157+0000","up_votes":1,"down_votes":0,"body":"Nun, da man nicht sofort einen Permabann bekommt , musst du auch schon vorher geflamed haben.\n\nUnd sei ehrlich zu dir selbst, du hast nicht nur einmal geflamed.\n\nRiot zieht sogut wie nie permabanns zurück, ausser es war ein Fehler. Also finde dich schonmal damit ab,\n\nMfG\n\nLaw{{champion:42}}","replies":[{"poster":"Rkoturdo Ndo","date":"2015-07-23T22:24:40.554+0000","up_votes":2,"down_votes":0,"body":"Heya\n>Nun, da man nicht sofort einen Permabann bekommt , musst du auch schon vorher geflamed haben.\n\nNicht umbedingt. Beim neuen System kannst du auch nach einem Spiel permagebannt werden, wenn du zu den Extremfällen zählst.\n\nMfG Rkoturdo","replies":[{"poster":"Sirrkas","date":"2015-07-23T22:29:26.581+0000","up_votes":1,"down_votes":0,"body":"Ich frag mich wie ein Chatlog aussehen muss, um wirklich beim ersten mal einen Permabann zu kriegen. Sogar der \"%%%%%% and die in pain\"-Typ hat nur 14 Tage geschafft.","replies":[{"poster":"Snowgen","date":"2015-07-23T22:58:01.592+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt, es ist nicht möglich und er versucht sein Flame schön zu reden , da es ja angeblich nur einmal war :)","replies":[{"poster":"Rkoturdo Ndo","date":"2015-07-24T06:28:05.203+0000","up_votes":1,"down_votes":0,"body":"Heya\nWie gesagt, es ist möglich, aber halt echt nur für die Extremfälle. Iwo auf ASKfm hat Lyte das mal bestätigt (ich glaube es war askfm). \nGespannt auf den Chatverlauf wäre ich aber auch :D\n\nMfG Rkoturdo","replies":[]}]}]}]}]},{"poster":"MeMyselfandBaal","date":"2015-07-23T22:42:56.633+0000","up_votes":1,"down_votes":0,"body":"Riot kann es sich gar nicht leisten, Leute beim ersten Fluchen perma zu bannen... da es dann doch recht schnell sehr einsam auf den Servern werden dürfte. Dementsprechend musst du schon irgendwas richtig krasses rausgelassen haben. Aber hey, wenn der Riot Support dir schreibt, woran es gelegen hat, kannst du dich hier ja nochmal melden...","replies":[]},{"poster":"Rkoturdo Ndo","date":"2015-07-23T22:22:12.526+0000","up_votes":1,"down_votes":0,"body":"Heya\nChancen stehen schlecht. Permabanns werden eigentlich nur dann aufgehoben wenn das System einen Fehler gemacht hat. Und du sagst ja selbst das du geflucht hast.\n\nMfG Rkoturdo","replies":[]}]}