{"poster":"Sperim","date":"2015-04-05T08:34:33.119+0000","title":"#DOITFORURF","subforum":"Discussioni generali","up_votes":0,"down_votes":13,"body":"La riot ha sempre detto che accontenta la comunity.\r\nFategli sentire quanto volete la URF permanente!!!\r\n#DOITFORURF {{summoner:12}} {{summoner:4}}","replies":[{"poster":"dreadful despair","date":"2015-04-05T09:04:07.407+0000","up_votes":3,"down_votes":0,"body":"Pls,basta con 'sti movimenti \"infantili\".Se la Riot mettesse permanentemente la Urf poi passerà la voglia di giocarci dopo un po.Alla fin fine ci sarà gente che studierà i champ piu forti della mod e li userà per farmare e rendere il gioco spiacevole a chi ci gioca contro.Pensa uno che userà solo e soltanto Urgot e Katarina in Urf.\nIl bello delle mod è che arrivano quando meno te li aspetti e te li puoi godere per il tempo che sono attive.Se fossero tutte permanenti dopo un po ti annoieresti molto.\nQuesto è il mio parere.Poi se non siete d'accordo fate voi.","replies":[{"poster":"Sperim","date":"2015-04-05T09:16:14.164+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Dark KiWi 23,realm=EUW,application-id=MJVj50Jw,discussion-id=86LgAz1K,comment-id=0001,timestamp=2015-04-05T09:04:07.407+0000)\n>\n> Pls,basta con 'sti movimenti \"infantili\".Se la Riot mettesse permanentemente la Urf poi passerà la voglia di giocarci dopo un po.Alla fin fine ci sarà gente che studierà i champ piu forti della mod e li userà per farmare e rendere il gioco spiacevole a chi ci gioca contro.Pensa uno che userà solo e soltanto Urgot e Katarina in Urf.\n> Il bello delle mod è che arrivano quando meno te li aspetti e te li puoi godere per il tempo che sono attive.Se fossero tutte permanenti dopo un po ti annoieresti molto.\n> Questo è il mio parere.Poi se non siete d'accordo fate voi.\n\nLasciare permanente la urf non implica il togliere le altre modalità.\nConcordo su quello che dici ma sono convinto che se ci fossero più modalità come la one for all, l'ascension, ecc...\nQuesto porterebbe solo ad avere più modalità invece delle solite 4 5v5 normal aram dominion e 3v3","replies":[{"poster":"TheAwesomeJ","date":"2015-04-05T11:10:37.167+0000","up_votes":3,"down_votes":0,"body":"Come già detto dalla riot, queste modalità devono essere occasionali per 2 motivi:\n- **Bilanciamento**. La riot non vuole mettersi a bilanciare una modalità \"demenziale\", ed ha ragione, perchè subito dopo il rilascio non sono mancati i millemila post della gente che si lamentava.\n- **Coinvolgimento**. Una modalità permanente fraziona le altre disperdendone i giocatori, senza contare che dopo 1 anno che c'è NESSUNO ci giocherebbe più. Le code per trovare una partita urf arriverebbero a 5 minuti minimo\n\nQuindi fidati, urf, hexakill, ascension, one for all e poro king sono modalità che è bene inserire a momenti/temi nel corso dell'anno.","replies":[]}]}]},{"poster":"Ste the ripper","date":"2015-04-05T08:59:20.349+0000","up_votes":3,"down_votes":0,"body":"Io non la voglio...","replies":[]},{"poster":"Firenheit","date":"2015-04-05T13:35:53.581+0000","up_votes":1,"down_votes":1,"body":"Guarda, io AMO la URF, la AMO da morire. E la giocherei 24H. Ma mi dispiace, ammetterlo, ma non può esistere per sempre. Ti immagini se fosse sempre Natale? Ecco... Sarebbe carino avere la certezza che la URF tornerà ancora e magari prima che passi un altro anno, ma di certo non può stare per sempre. E' una normal \"più bella\", una vacanza e tale deve rimanere. Purtroppo.","replies":[]}]}