{"poster":"KúronúmaSótay","date":"2016-09-20T17:49:49.930+0000","title":"Meine Meinung Nach 2 Jahren League of Legends Spielen","subforum":"Champions & Gameplay","up_votes":1,"down_votes":3,"body":"Diese Dinge die ich Schreibe ist keine Private Beleidigung also bitte nicht Pers&ouml;nlich nehmen.\r\n\r\nPositive Dinge: \r\n- Viele neue Updates Champions Bugfixes usw...abwechselnde Events, Spielmodie preise, Gewinnspiele ...  Tolle Einfallsreiche Champions  Mit Guten Geschichten und F&auml;higkeiten.\r\n\r\nNegative Dinge:\r\n- Ungleiche Teams, Unfaire Spieler,  Dauerhaftes Provozierendes Verhalten von Teammates/Gegner und Gespamme im Global chat, Chatblock in der championauswahl...\r\nBeispiele: \r\n- Ungleiche teams, Bronze Gegen Gold  Spieler (ich Gegen Gold spieler) \r\n- Unfaire spieler, Spielen unfair obwohl sie wissen das man unterlegen ist wenn einer afk gegangen ist oder einer feedet(Feed taker)\r\n- Verhalten, &quot; eZ Rekt,Noobs, Bronze kiddys, Boosted, To ez, Noob champ.&quot; mehr Brauch ich dazu ja nicht schreiben.\r\n- Gespamme,&quot; NOOB NOOB NOOB NOOB NOOB NOOB NOOB NOOB NOOB...&quot; Kein Kommentar mehr dazu.\r\n- Chat Block, Man Kopiert einmal &quot;Top&quot;(STRG+c) und Kopiert diesen EINMAL!!! in den Chat der Championauswahl (STRG+v) und Man Wird sofort vom chat ausgeschlossen... WIESO??!?.\r\n\r\nich w&uuml;nsche mir in zukunft  das dieses negative Was ich aufgeschrieben hatte Gefixt wird, ansonsten macht lol &Uuml;berhaupt kein spa&szlig; mehr.\r\n\r\nUnd Jetzt Brauchen Mir Leute nicht wieder erkk&auml;ren was ich daran falsch gemacht habe das man dies tun kann was du daran &auml;ndern K&ouml;nntest\r\ndas ist nur meine Eigene meinung nach 2 Jahren LoL Spielen also bitte tut mir einfach den Gefallen und Schreibt nichts Un&uuml;berlegtes drunter\r\n\r\nDanke...","replies":[{"poster":"haha weed lol xd","date":"2016-09-22T01:03:05.994+0000","up_votes":1,"down_votes":0,"body":"Du solltest versuchen nach 2 Jahren mal von Blind Pick weg zu kommen und mehr Draft Pick zu spielen. Da sind die Leute meistens erwachsener","replies":[]},{"poster":"OT Riku","date":"2016-09-20T18:08:36.307+0000","up_votes":1,"down_votes":0,"body":"Also ich verstehe den Punkt afk und unfair nicht ganz, League ist ein kompetitives Spiel.\nWenn der Spieler durch unzureichende Hardware Software nicht Spielen kann ist dass schieße.\nAber anders gesehen wieso sollte man auf Sowas Rücksicht nehmen.\nIm Fußballs wenn jemand die Entscheidung trifft eine tätlichkeit begehen oder sonst was und Rot zu bekommen. \nDa wird das andere Team nicht sagen gut dann werden wir halt nur mit 10 Mann Spielen.\nIch verstehe den Punkt flame ect. Ist halt schieße aber du kannst als Spieler td gegen solche Leute was tun.","replies":[]},{"poster":"Nycaria","date":"2016-09-20T17:59:37.224+0000","up_votes":1,"down_votes":0,"body":"> ich wünsche mir in zukunft das dieses negative Was ich aufgeschrieben hatte Gefixt wird, ansonsten macht lol Überhaupt kein spaß mehr.\n\nWie soll Riot denn die Spieler \"fixen\" ? Für negatives Verhalten gibt es bereits Chatsperren und Banns. \n\n> Ungleiche teams, Bronze Gegen Gold Spieler (ich Gegen Gold spieler)\n\nIch denke mal du redest von Normals. Dort gilt Normal MMR =/= Ranked MMR. Außerdem kann dort jeder mit jedem Premade sein,was das Matchmaking dort etwas verzerrt ( bspw Challenger mit Bronze ). \n\n\n> Unfaire spieler, Spielen unfair obwohl sie wissen das man unterlegen ist wenn einer afk gegangen ist oder einer feedet(Feed taker)\n\nInwiefern spielen diese Spieler unfair ? Sie wollen eben gewinnen,so wie vermutlich fast jeder,der dieses Spiel spielt. Sollen sie etwa aufhören vernünftig zu spielen,nur weil einer im Gegnerteam keine Lust hast vernünftig zu spielen ?\n\n\n> Verhalten, \" eZ Rekt,Noobs, Bronze kiddys, Boosted, To ez, Noob champ.\" mehr Brauch ich dazu ja nicht schreiben.\nGespamme,\" NOOB NOOB NOOB NOOB NOOB NOOB NOOB NOOB NOOB...\" Kein Kommentar mehr dazu.\n\nDafür gibt es die Mute Funktion. /mute <Name> eingeben oder einfach bei Tab auf das Mute Symbol klicken und nach dem Game reporten :)","replies":[]},{"poster":"Encrux","date":"2016-09-20T17:56:07.700+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=xXAiiMStarZzXx,realm=EUW,application-id=Wj1wcocU,discussion-id=V3R8gEWZ,comment-id=,timestamp=2016-09-20T17:49:49.930+0000)\n>\n> - Ungleiche teams, Bronze Gegen Gold  Spieler (ich Gegen Gold spieler) \n\nWow, wichtig ist natürlich die Klammer. Mein größter Kritikpunkt an den Spielern ist nicht das geflame, nicht die \"noob teammates\", sondern genau das.\nDer eigene Rank ist das wichtigste. Ich erlebe das sogar in meinem eigenen Freundeskreis, wer nicht mindestens Platin ist wird als noob abgestempelt.\n\n\n> - Unfaire spieler, Spielen unfair obwohl sie wissen das man unterlegen ist wenn einer afk gegangen ist oder einer feedet(Feed taker)\n\nDas macht mal absolut keinen Sinn wenn du mich fragst. In lol kann man eigentlich nicht \"unfair\" spielen. Klar gibts tilt-abuser, afk-abuser und und und. Aber das ist die Natur von solo queue, und statistisch gesehen würdest du davon eher profitieren.","replies":[]}]}