{"poster":"KúronúmaSótay","date":"2016-05-18T18:13:48.116+0000","title":"Keine Marken erhalten trotz S+","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo ich w&uuml;rde mich gerne beschweren das ich mit Yasou keine Marke erhalten habe  ich bin mit yasou lvl 5 und Habe ein Normales S erhalten ich wurde aber mal vor ca 3 Wochen 14 tage Lang Von lol gebannt da dachte ich das es damit zusammenh&auml;ngt weil auch da steht wegen fr&uuml;herer verhaltenseinsch&auml;rnkung bist du nicht berechtigt beute zu machen so jetzt sagt mir mal einer WAS DIESE MARKEN MIT BEUTE ZU TUN HAT richtig NICHT DAS GERINSGTE! so da wollte ich mich beschweren das das sehr unfair ist meine Freunde wurden auch mal Gebannt haben aber trotzdem eine Marke erhalten das finde ich sehr unfair mir gegen &uuml;ber das meine Freunde die das gleiche passiert ist eine Marke Bekommen haben und ich nicht und ich w&uuml;rde gerne yasou lvl 7 machen da mir der Champion viel spa&szlig; macht ich habe mich auch gerade in diesen game sehr angestrengt das ich &uuml;berhaupt ein S erhalte damit ich ihn lvl 6 machen kann aber ich habe es nicht bekommen weil ich ja gebannt wurde w&uuml;rde ich mal vermuten w&auml;re echt korrekt wenn man das bearbeiten k&ouml;nnte \nMfG: AiimstarZz -_-","replies":[{"poster":"MICHALORD52","date":"2017-09-30T13:49:16.349+0000","up_votes":1,"down_votes":0,"body":"servus \n\nich weis nicht woran es lag dass du keine marken mehr bekommen kannst aber das ist champion abhängig...\n\nzb. ich bekomme mit vel koz, yi und lux die letzte lvl 6er marke zum aufwerten meines champs nicht... lustiger weise bekomme ich mit quinn oder morgana eine marke xDDD\njetzt ist die frage warum macht das riot denn ich hatte keine banns in letzter zeit oder sonstiges...\n\nich habe in der vergangenen zeit(letzten 14tage) mehrfach mit dem support geschrieben aber die einzigste antwort die es gab war:\n\nDAS SIE MIR DAS MARKENSYSTEM ERKLÄRTEN!!!!!! (ich spiele seit 5 jahre lol)^^\n\nmit freundlichen Grüßen\n\nMicha","replies":[]},{"poster":"TerrorRaven","date":"2016-05-18T19:00:22.884+0000","up_votes":1,"down_votes":0,"body":"Da die blauen Essenzen ebenfalls eine Rolle spielen, hängt das sehr wohl mit den Beutesystem zusammen. Wie lange ist die Strafe von deinen Freund her? Schon mal was von Absatz und Zeichensetzung gehört?","replies":[{"poster":"KúronúmaSótay","date":"2016-05-18T19:41:13.383+0000","up_votes":1,"down_votes":0,"body":"1. er wurde am gleichen Tag gebannt und am gleichen tag entbannt und 2. ja kenne ich nur ich schreibe halt sehr schnell und hatte keine zeit oder habe einfach keine zeit es zu machen^^","replies":[]}]},{"poster":"Corvis Rex","date":"2016-05-18T18:16:00.573+0000","up_votes":1,"down_votes":0,"body":"Benutz die \"Enter\" Taste in einem dichteren Satz, dann ist das angenehmer zu lesen, was du geschrieben hast.","replies":[]}]}