{"poster":"invisiblecat1","date":"2018-08-03T17:24:21.561+0000","title":"Akali has a 38% winrate mid","subforum":"Gameplay","up_votes":99,"down_votes":11,"body":"GOOD\r\nLEAVE HER THAT WAY\r\nfor at least 1-2 patches\r\nGive people time to get used to her new skill oriented kit\r\nTHEN decide whether or not she needs buffs/changes\r\n\r\nDon&#039;t hotfix her because her winrate is low\r\nGive it a few weeks before we Aatrox her","replies":[{"poster":"DuskDaUmbreon","date":"2018-08-03T17:25:55.304+0000","up_votes":12,"down_votes":58,"body":"38% is too low, though.\n\nA small buff in the meantime (*not* large-scale, just a tiny one to her armor/mr/hp or whatever) wouldn't be the worst of ideas.","replies":[{"poster":"invisiblecat1","date":"2018-08-03T17:28:49.579+0000","up_votes":32,"down_votes":8,"body":"This is exactly the way Riot thinks when they see winrates of new champions\nAatrox's winrate was low on his release, and riot gave him a _TINY_ buff and his winrate skyrocketed\nWe just need to wait and see","replies":[{"poster":"Akali is SO HOT","date":"2018-08-03T17:33:50.520+0000","up_votes":34,"down_votes":5,"body":"The Aatrox buffs were far from tiny.  He got hotfixed twice in one patch with substantial buffs almost immediately after release.","replies":[]},{"poster":"SpecterVonBaren","date":"2018-08-04T07:36:10.851+0000","up_votes":5,"down_votes":1,"body":"After the boards and reddit squealed about how trash he was.","replies":[]},{"poster":"Pika Fox","date":"2018-08-03T17:37:35.283+0000","up_votes":2,"down_votes":27,"body":"Aatrox NEEDED the buffs. The nerfs, for the most part, took power out that wasnt put in.\n\nAkali likely needs the same.\n\nDesign wise, you want your champ to be a bit too good on release, and round out the champ taking power out as people get better. If the champ is just straight too weak, youll get no useful data other than needs buffs.","replies":[{"poster":"Beacon Academy","date":"2018-08-04T23:30:49.365+0000","up_votes":3,"down_votes":0,"body":"Why would you want your champion to be too good and get nerfed to feeling relatively worse?\n\nThats terrible planning.\n\nI'd rather be weak or decent on release and receive QoL buffs for 5-6 years *cough*{{champion:90}}*cough*","replies":[{"poster":"Pika Fox","date":"2018-08-05T15:58:57.299+0000","up_votes":1,"down_votes":0,"body":"Works much better for devs, as it allows them better information to fine tune whats needed.","replies":[]}]}]}]},{"poster":"SugeMinPikk","date":"2018-08-05T16:01:38.081+0000","up_votes":1,"down_votes":0,"body":"We should wait for the winrate to stabilize before she's touched. Which would you rather happen: \n---\nShe's bad for a while then gets nudged up to around 50% winrate over the course of several patches {{champion:432}} \n\nor\nShe's bad on release, overbuffed, pick/ban in LCS, then gutted {{champion:516}} \n---\nBesides, look at blade. Having no trouble making her work. A champion is truly garbage if blade struggles on it. ","replies":[{"poster":"DuskDaUmbreon","date":"2018-08-06T14:41:46.703+0000","up_votes":1,"down_votes":0,"body":"You ***do*** realize there is a middle ground between \"overbuffing\" and \"Waiting 2 months before we change them\", right?","replies":[{"poster":"SugeMinPikk","date":"2018-08-06T16:08:04.903+0000","up_votes":2,"down_votes":0,"body":"That middle ground doesn't exist for riot, evidently xd","replies":[]}]}]}]},{"poster":"Elite4Runner","date":"2018-08-03T18:03:32.609+0000","up_votes":10,"down_votes":9,"body":"The problem with this logic is, if a new champion, or a champion who has been significantly changed/reworked has a low winrate, they are not likely to be played/mastered. Riot needs champions to be played in order to identify what aspects of a champion are too strong or too weak. The PBE does not accomplish this because there is no honest ranking system, and characters are not in beta long enough for them to really be mastered. The function of the beta environment is to be sure that the character functions properly.","replies":[{"poster":"invisiblecat1","date":"2018-08-03T18:38:33.373+0000","up_votes":27,"down_votes":4,"body":"Akali's playrate is still really high though","replies":[{"poster":"Elite4Runner","date":"2018-08-03T21:38:25.768+0000","up_votes":4,"down_votes":18,"body":"It is only the second day. \n\nMy point is, Riot prefers that she is strong, or even overpowered, as opposed to weak .. or even balanced. \n\nA low winrate is bad for testing purposes because the community generally places a lot of stock in things like that. If a champion has a very low winrate, players are unlikely to even try to play or learn them because they prefer to win games.","replies":[{"poster":"Tobykachu","date":"2018-08-04T04:19:34.365+0000","up_votes":6,"down_votes":3,"body":"This logic is killing the game though. Not only are they releasing more and more champions with toxic and frustrating to play against kits, but now we have to deal with them being completely bonkers too?","replies":[{"poster":"Elite4Runner","date":"2018-08-04T18:41:40.041+0000","up_votes":1,"down_votes":3,"body":"This is not a new concept. It isn't killing the game. They have done this as long as I've been playing.","replies":[{"poster":"Tobykachu","date":"2018-08-04T19:22:39.140+0000","up_votes":3,"down_votes":0,"body":"Except newer champions have much more frustrating kits to play against. Look no further than Zoe and Camille","replies":[]}]}]}]},{"poster":"Andrey0345","date":"2018-08-05T16:23:45.650+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=invisiblecat1,realm=NA,application-id=3ErqAdtq,discussion-id=7iBFQBR0,comment-id=00020000,timestamp=2018-08-03T18:38:33.373+0000)\n>\n> Akali&#x27;s playrate is still really high though\n\nsry can't stop playing her","replies":[]}]},{"poster":"Beacon Academy","date":"2018-08-04T23:32:28.229+0000","up_votes":1,"down_votes":0,"body":"If it takes OPOP stats to make a champion want to be played, then the maker of the kit should be disappointed in themselves.","replies":[{"poster":"Elite4Runner","date":"2018-08-05T06:11:05.577+0000","up_votes":1,"down_votes":0,"body":"There are 141 champions. ...","replies":[{"poster":"Beacon Academy","date":"2018-08-05T06:25:07.749+0000","up_votes":1,"down_votes":0,"body":"And? That has nothing to do with making a kit and character that people can find enjoyable.\n\nUnless you play all 141 champions each day.","replies":[{"poster":"Elite4Runner","date":"2018-08-06T03:04:21.417+0000","up_votes":1,"down_votes":0,"body":"Did you even read what I said earlier?? The whole point is for Riot to gather information on the champion's balance by having players play that champion frequently, giving them data to identify strengths and weaknesses, while taking into account a player's mastery of that champion (their pickrate with that champion) .. So it does matter because NO, most people do not play 141 champions every day, which is exactly why there needs to be an incentive for player to pick THIS ONE champion out of the 141 champions that they have the choice to pick from. Even if you look at the frequency of champions picked, there are champions who are so rarely picked because they are not strong in the meta. Think about the champions that you rarely see currently. A lot of them have low WINRATES so they have low PICKRATES. \n\nIt doesn't matter if they have an enjoyable kit if people are not likely to win with them because people have a habit of playing to win, instead of playing for fun. Sad but true.","replies":[{"poster":"Beacon Academy","date":"2018-08-06T08:55:15.123+0000","up_votes":1,"down_votes":0,"body":"Then let me ask you this:\n\n\"Why does a champion have to be rebalanced with nerfs or buffs right after their release?\"","replies":[{"poster":"Elite4Runner","date":"2018-08-06T16:56:38.869+0000","up_votes":1,"down_votes":0,"body":"I answered this already. The Public Beta Environment is meant to ensure that a champion's kit functions properly. It is not possible for Riot to get an accurate sense of the character's strengths and weaknesses when played competitively. This can only be evaluated after the champion has been released to live servers. The more this character is played, the more data they are able to collect, and the more accurately they are able to move the champion closer to balance.  ","replies":[]}]}]}]}]}]}]},{"poster":"Anatera","date":"2018-08-04T05:59:49.816+0000","up_votes":1,"down_votes":18,"body":"Or, you know, Riot can actually TRY and aim for 50%?","replies":[{"poster":"Daddy Ants","date":"2018-08-04T08:25:03.057+0000","up_votes":16,"down_votes":1,"body":"> [{quoted}](name=Anatera,realm=NA,application-id=3ErqAdtq,discussion-id=7iBFQBR0,comment-id=0009,timestamp=2018-08-04T05:59:49.816+0000)\n>\n> Or, you know, Riot can actually TRY and aim for 50%?\n\nOr, you know.\n\nRiot can stop giving Training wheel buffs and give people a CHANCE TO LEARN THE KIT.\n\n\nShe's just been given an entirely new kit.\n\nNo one is gonna learn it overnight.","replies":[{"poster":"Anatera","date":"2018-08-04T08:44:44.796+0000","up_votes":1,"down_votes":13,"body":"> [{quoted}](name=Antenora,realm=EUW,application-id=3ErqAdtq,discussion-id=7iBFQBR0,comment-id=00090000,timestamp=2018-08-04T08:25:03.057+0000)\n>\n> Or, you know.\n> \n> Riot can stop giving Training wheel buffs and give people a CHANCE TO LEARN THE KIT.\n> \n> \n> She&#x27;s just been given an entirely new kit.\n> \n> No one is gonna learn it overnight.\n\nNot really saying they will, but the onus is not entirely on the players and shouldn't be treated as such by dumping it in their lap.","replies":[{"poster":"Daddy Ants","date":"2018-08-04T08:51:19.107+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Anatera,realm=NA,application-id=3ErqAdtq,discussion-id=7iBFQBR0,comment-id=000900000000,timestamp=2018-08-04T08:44:44.796+0000)\n>\n> Not really saying they will, but the onus is not entirely on the players and shouldn&#x27;t be treated as such by dumping it in their lap.\n\n\nThey said on Twitter that they are hotfix nerfing Fizz on Monday and assessing Akali.\n\n\nThey should leave her alone for the next 2-3 weeks.\n\nGive people including her mains a chance to fully learn her new kit.\n\nIF after that time they are still struggling then give Akali slight buffs.\n\n\nNo one wants a repeat of {{champion:516}} {{champion:266}} {{champion:145}}.\n\n","replies":[{"poster":"Anatera","date":"2018-08-04T08:57:02.950+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=Antenora,realm=EUW,application-id=3ErqAdtq,discussion-id=7iBFQBR0,comment-id=0009000000000000,timestamp=2018-08-04T08:51:19.107+0000)\n>\n> They said on Twitter that they are hotfix nerfing Fizz on Monday and assessing Akali.\n> \n> \n> They should leave her alone for the next 2-3 weeks.\n> \n> Give people including her mains a chance to fully learn her new kit.\n> \n> IF after that time they are still struggling then give Akali slight buffs.\n> \n> Going full Training wheels mode and buffing a new champion/rework shortly after release leads to Aatrox or Ornn situations where the champ has to be nerfed repeatedly due to being overbuffed.\n> \n> \n> They did it to Kai&#x27;Sa as well and she had to be nerfed repeatedly.\n\nOr maybe they could just do both? By giving her small incremental changes, while the community gets used to her? It's not hard, there are plenty other games that do it. It's called active observation, as opposed to wait they are currently doing, which is either \"wait and see\" or \"pointless unnecessary panic.\"","replies":[{"poster":"Daddy Ants","date":"2018-08-04T08:58:05.343+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Anatera,realm=NA,application-id=3ErqAdtq,discussion-id=7iBFQBR0,comment-id=00090000000000000000,timestamp=2018-08-04T08:57:02.950+0000)\n>\n> Or maybe they could just do both? By giving her small incremental changes, while the community gets used to her? It&#x27;s not hard, there are plenty other games that do it. It&#x27;s called active observation, as opposed to wait they are currently doing, which is either &quot;wait and see&quot; or &quot;pointless unnecessary panic.&quot;\n\nThey shouldn't be giving new champions/reworks any buffs for the first 2 or so weeks.\n\nWin rates are low because players are learning the kit and play style, not because the champion's strength is low.","replies":[{"poster":"Anatera","date":"2018-08-04T09:15:45.105+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Antenora,realm=EUW,application-id=3ErqAdtq,discussion-id=7iBFQBR0,comment-id=000900000000000000000000,timestamp=2018-08-04T08:58:05.343+0000)\n>\n> They shouldn&#x27;t be giving new champions/reworks any buffs for the first 2 or so weeks.\n> \n> Win rates are low because players are learning the kit and play style, not because the champion&#x27;s strength is low.\n\nI said small. Small changes.","replies":[{"poster":"mikemcparty","date":"2018-08-04T15:20:42.967+0000","up_votes":3,"down_votes":2,"body":"How about this? No...","replies":[]}]}]}]}]}]}]}]},{"poster":"LeftyRaydy","date":"2018-08-03T17:26:22.482+0000","up_votes":13,"down_votes":7,"body":"nah lets give her a big nerf cause I never want to see a Shroud again.","replies":[]},{"poster":"BLACK REALM GOD","date":"2018-08-04T02:44:42.869+0000","up_votes":6,"down_votes":2,"body":"I've gotten used to her. she's not god awful, but I honestly feel her kit needs a few numbers slightly adjusted around. she's too feast or famine right now.\n\nwhat i've learned to do is aim for first blood on a super squishy opponent.\n\n*edit*\n\nbut i agree to waiting at least through 8.17 before patching her.","replies":[{"poster":"Ultîma","date":"2018-08-04T13:38:22.567+0000","up_votes":1,"down_votes":1,"body":"She's feast or famine with her classic Gunblade AP build. She's actually _very_ consistent as a top lane bruiser. I don't think Riot should touch her at all, if anything she's actually super oppressive in melee matchups.","replies":[{"poster":"BLACK REALM GOD","date":"2018-08-04T16:19:03.772+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Ultîma,realm=NA,application-id=3ErqAdtq,discussion-id=7iBFQBR0,comment-id=00070001,timestamp=2018-08-04T13:38:22.567+0000)\n>\n> She&#x27;s feast or famine with her classic Gunblade AP build. She&#x27;s actually _very_ consistent as a top lane bruiser. I don&#x27;t think Riot should touch her at all, if anything she&#x27;s actually super oppressive in melee matchups.\n\nno. she's super oppressive against vayne and teemo. i'd argue that she's not too bad against tanks and fighters. they typically have higher armor/magic resist and hp/hp regen.\n\nnot always, but usually. with the 8.16 tank changes i doubt she'll survive in top. she's too easy to destroy with 1 single ability.","replies":[]}]},{"poster":"DKM Bismarck","date":"2018-08-04T04:10:30.747+0000","up_votes":1,"down_votes":1,"body":"I don't think her damage is the problem, as far as I know her base stats are quite low compared to old Akali. But I also just don't think Akali is even remotely weak or in need of any buffs at all right now, she's only been out for like 2 days and she is very hard as far as I can tell.","replies":[{"poster":"Ryrynounet","date":"2018-08-04T10:49:46.141+0000","up_votes":1,"down_votes":1,"body":"Tbh I got good games with akali but my problem is the early cd on the ult since you mostly rely on it to be able to gap close efficiency or to pick-up kills and for me to be able to play well akali it's needed for the player to know what to do with her. I think her winrate will raise soon even without buffs","replies":[]}]}]},{"poster":"I am bIack","date":"2018-08-04T23:22:31.634+0000","up_votes":2,"down_votes":0,"body":"Isn't her winrate low though because inexperienced players are trying her and there is a learning curve for Akali? So it would imply to be able to successfully \"master\" Akali, you'd have to play a set amount of games to get a feel for the champion with combos, etc. \n\nIt wouldn't make sense to just outright buff her with so little time to accustom to her playstyle/abilities/combos. \n\nSo uh.. yeah leave it that way xD","replies":[]},{"poster":"Real Sexy Yoona","date":"2018-08-04T09:04:55.527+0000","up_votes":3,"down_votes":1,"body":"Thank God, after reading the title, I thought you were about to complain and ask for buffs. \n\nI agree on waiting at least 2-3 weeks before making adjustments. I mean, she might not need any","replies":[]},{"poster":"TheInnocentdevil","date":"2018-08-04T05:00:41.471+0000","up_votes":3,"down_votes":1,"body":"It's not even really damage thats the problem, her kit has awkward issues. Her energy cost on her q is really high and her regen is really low, so when you factor in how long it takes to get the heal from her q, it ends up being like 5-6 health a second. Then her q super short range and makes it really hard for her to deal with most mages, or anyone with aoe really. She's also super feast or famine.","replies":[]},{"poster":"Attticus Finch","date":"2018-08-04T20:21:44.550+0000","up_votes":2,"down_votes":1,"body":"If god is real and merciful she'll stay at a 38%wr for the duration of the game's lifespan.","replies":[]},{"poster":"lolipopevelynn","date":"2018-08-04T17:11:10.761+0000","up_votes":2,"down_votes":1,"body":"diana litterally does what old akali did, and diana right now is simply better than new akali because of it. new akali  isnt bad, she just requires alot of set up compared to just Q+Ring someone to death. she needs to connect her entire kit of abilities to burst someone, but once people learn that she can just set up while in shroud she wont be able to be 1v1ed.","replies":[]},{"poster":"inplane","date":"2018-08-04T17:10:26.609+0000","up_votes":2,"down_votes":1,"body":"So many champs have suffered from the \"New Champion Syndrome.\" I'm surprised Riot and the community haven't taken a hint yet. At this point, we shouldn't need topics like these to point us in the right direction.","replies":[]},{"poster":"Power Cosmic","date":"2018-08-04T16:17:39.324+0000","up_votes":2,"down_votes":1,"body":"Sounds perfect, I like her how she is, dont buff.","replies":[]},{"poster":"Last Breàth","date":"2018-08-04T15:25:59.434+0000","up_votes":2,"down_votes":1,"body":"idc about the others but i like her that way she is\nno changes needed imo\nthe players cant adapt to her reworked gameplay or they suck","replies":[]},{"poster":" CURSEÐ REVENANT","date":"2018-08-04T15:19:17.670+0000","up_votes":2,"down_votes":1,"body":"She needs her sustain changed. Before rework, you sustained in lane so that you could put pressure the enemy laner through multiple trades. She was also able to sustain in all in fights as a sort of drain tank type bruiser thing. Now her sustain is pretty shitty. Other than her sustain and energy usage i think she is fine.","replies":[]},{"poster":"FixHealsRemoveGW","date":"2018-08-04T14:10:56.540+0000","up_votes":2,"down_votes":1,"body":"Well, you could just stop banning new champions, then their winrate would stabilize much faster.\n\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Sugarlicious","date":"2018-08-04T12:56:09.624+0000","up_votes":2,"down_votes":1,"body":"I love going vs Akali as Lissandra, it always makes me lol when they use her E right as I move in front of my turret. They are so clumsy with the E, it's a joy to watch them fail it xD\nWhat I did notice, though, is that her Q has a surprisingly short range. She's pretty much not even a threat to most mages with a decent cc.","replies":[{"poster":"Quort","date":"2018-08-04T17:25:04.921+0000","up_votes":1,"down_votes":1,"body":"I just played Lissandra into Akali the other day and at Level 2 she landed an E and took out like 70% of my HP with E Auto Q Electrocute... I was really surprised. x_x","replies":[]}]},{"poster":"Skorch","date":"2018-08-04T12:08:45.216+0000","up_votes":2,"down_votes":1,"body":"I dont like your tone... but i agree","replies":[]}]}