{"poster":"Addyyy","date":"2016-09-10T19:53:31.097+0000","title":"Keine angst mehr vor Soloq(Ranked)?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":1,"body":"Hi Guys,\r\nIch bin akt. Silber 2 und spiele die meiste zeit duq. Nur bei soloq werde ich nerv&ouml;s und mache mehr Fehler ingame.\r\nKennt jemand paar Tricks oder Tipps?\r\n(Und keine Binsenweisheiten, wenn ich die will frag ich mine Gro&szlig;mutter. jk)\r\nDanke im voraus! HF GL =)","replies":[{"poster":"TBSVegar","date":"2016-09-16T12:21:37.406+0000","up_votes":2,"down_votes":0,"body":"Grundsätzlich müsstest du den Grund finden, warum SoloQ Spiele dich nervös machen.\nWir können nur Vermutungen anstellen, bzw Tipps geben.\n\nAls Tipps kann ich dir nur einen geben:\nWie meine Vorredner bereits geschrieben haben, hilft es schon einfach mehr SoloQ zu spielen. \n\nEine Mögliche Ursachen für die Nervosität:\n\n- Deine Einstellung zum Ranglisten-System ist sehr darauf bedacht nach deinem aktuellen Rang, dies musst du versuchen abzulegen und in ein Denkmuster zu kommen, wo du darauf bedacht bist deine Performance zu verbessern.","replies":[]},{"poster":"Allisrem2","date":"2016-09-10T20:33:50.881+0000","up_votes":1,"down_votes":0,"body":"Kenn ich, das kommt davon weil du zu wenig spielst. Einfach spammen, spammen, spammen, mit der Zeit gehts von alleine weg. Das liegt eben daran, weil du dich nicht daran gewöhnt bist.\nVersuch dir auch ganz klar bewusst zu machen, dass du zum Spass spielst, und es im Grunde genommen keine Rolle spielt, wie viele Spiele du gewinnst.","replies":[]},{"poster":"Nycaria","date":"2016-09-10T20:06:18.534+0000","up_votes":1,"down_votes":0,"body":"Warum wirst du bei SoloQ nervös ? Wenn du dir das selbst beantworten kannst,findest du auch eine passende Lösung :)","replies":[]},{"poster":"Senpai Zetsu","date":"2016-09-10T21:59:34.203+0000","up_votes":1,"down_votes":1,"body":"Soloq nervös? Warum? Einfach machen ist egal wenn du dropst oder Steigst btw falls du dropst warst du halt zu schlecht für diese Liga. Dann einfach weiter zocken. Mit der Zeit wirst du auch besser","replies":[]}]}