{"poster":"Jiyagi","date":"2016-07-30T20:00:00.886+0000","title":"Wann kommt der Abstieg?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hallo ich bin gerade Gold 5 0 LP, zu meiner Frage: Wie oft darf ich verlieren bis ich absteige?","replies":[{"poster":"Maexle","date":"2016-07-30T20:20:51.985+0000","up_votes":2,"down_votes":1,"body":"Du steigst erst ab, wenn deine MMR dem Niveau von Silber 5 entspricht.\n{{champion:17}}","replies":[{"poster":"DontKillMySoraka","date":"2016-07-30T23:09:24.731+0000","up_votes":1,"down_votes":0,"body":"Meiner Kenntnis nach ist es Silber 3","replies":[{"poster":"Legendary Shadow","date":"2016-07-31T07:48:46.503+0000","up_votes":1,"down_votes":0,"body":"Letzte saison war es silber 5 jetzt ist es silber 3 :) bin die season selbst schon gedroppt von ner 5er division :DD","replies":[]}]}]},{"poster":"alminlp","date":"2016-07-30T22:32:30.294+0000","up_votes":1,"down_votes":3,"body":"Soweit ich weiß kann man nicht absteigen","replies":[{"poster":"need elo police","date":"2016-07-30T23:49:10.060+0000","up_votes":1,"down_votes":0,"body":"natürlich kann man absteigen, nicht durch Inaktivität aber sehr wohl wenn man zu schlecht für die Elo ist. Glaube erst ab Platin kann man durch Inaktivität absteigen.","replies":[{"poster":"CYPHΕR","date":"2016-08-01T14:18:07.570+0000","up_votes":1,"down_votes":0,"body":"Exakt. Den sogenannten \"Elo-Decay\" (der Abzug von LP durch Inaktivität) gibt es erst ab Platin V. Alles darunter kann nur durch aktives Spielen beeinflusst werden.\n\nDie MMR muss dafür etwa der MMR zwischen Division 3 und 5 der darunter liegenden Liga entsprechen. Sollte das der Fall sein erhält man auch eine Meldung im Client soweit ich weiß.","replies":[]}]}]},{"poster":"Skagerak","date":"2016-07-31T02:01:12.033+0000","up_votes":1,"down_votes":0,"body":"Du kannst natürlich auch einfach gar nicht mehr ranked bis Ende der Season spielen in Gold kann man nicht durch afk sein absteigen. \nFalls du ranked weiterspielen willst solltest du einfahc auf die Elo deiner Gegner schauen wenn die Gold bis high Silber sind bist du im grünen bereich. \nWenn die aber Low Silber sind solltest du dir Gedanken machen dann bist du kurz davor abzusteigen. Das hier ist aber nur ein Anhaltspunkt genau sagen kann dir niemand wann du wirklich absteigst.","replies":[]},{"poster":"Shad0wM0on","date":"2016-07-30T21:53:08.208+0000","up_votes":1,"down_votes":1,"body":"können 5 sein aber auch 10, kann man nicht genau sagen","replies":[]}]}