{"poster":"Darkarcher","date":"2014-12-01T06:01:31.435+0000","title":"Will this computer run League Of Legends?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"* So I'm looking to buy a new pc and we are about to get this one.http://www.harveynorman.com.au/computers-tablets/computers/desktops/hp-pavilion-500-132a-desktop.html\nCan someone tell me if this can run league and about what settings I can run it on. Thanks","replies":[{"poster":"Geldour","date":"2014-12-01T06:19:12.791+0000","up_votes":1,"down_votes":0,"body":"harvey norman are so over priced :/ \n\nbuild your own mate, wayyy cheaper and better\n\n\nhttp://www.pccasegear.com/sc/lhP\n\nthere we go ^^\n\ndone! just add a few cables and wack her together, will run anything like a dream :)","replies":[{"poster":"RichCont","date":"2014-12-01T07:19:01.938+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Geldour","date":"2014-12-01T08:18:18.064+0000","up_votes":1,"down_votes":0,"body":"because vaule for money it is amazing.\n\nand i own one so i know its amazing.","replies":[]}]}]},{"poster":"Darkarcher","date":"2014-12-01T06:21:19.756+0000","up_votes":1,"down_votes":0,"body":"Thanks for the suggestions but I want to know what settings I am able to run league on this PC","replies":[{"poster":"RichCont","date":"2014-12-01T08:06:23.440+0000","up_votes":1,"down_votes":0,"body":"Any sht stain of a brick will max this game out, that's what people are telling you. LOL. It really isn't complicated, do a google search of all GPU's compared to get an idea of low-mid-high tier, will take 5 minutes, most low tier GPU's will max this game, if league is the ONLY thing you want to play it is very well possible to put a computer together for $500 - $600 that will max this, this is stupid though, if you're going to build a PC just build a PC that'll run anything, you don't need an amazing GPU to run anything, GPU technology is pretty amazing nowadays like a mid range GPU will destroy almost anything, the real high end ones up for wierdos who get hard ons about running absolutely everything on max on the most demanding game in the world on a 4056k (or whatever it is) monitor on 120 fps. \n\nYou shouldn't be worrying about maxing this game out is what I'm saying because any GPU will I don't know of a semi-mainstream game less demanding then league, you need to worry about cost efficiency and the other components, if you find something you like or think is good google the individual parts watch benchmark vids. etc.","replies":[]},{"poster":"KingDinger","date":"2014-12-01T07:44:50.241+0000","up_votes":1,"down_votes":0,"body":"follow richconts advice, he is spot on about that GPU, and how bad the choice of GPU is with all the higher value stuff. no idea how overall that costs 1800...1200 at most imo.\n\nbuild your own is by far the best method. but the one rich suggested also from harvey norman prebuilt looks fine. the R7 is awesome.","replies":[]}]},{"poster":"RichCont","date":"2014-12-01T07:58:25.516+0000","up_votes":1,"down_votes":0,"body":"LOL so I had a bit of a look through Harvery Normans desktops and found a a brand that is trying to cater to the gaming community specifically but they must be fking trolling. http://www.harveynorman.com.au/computers-tablets/computers/desktops/pryon-pry-nba10-02-nebula-desktop.html <-- Ok so no disk drive and stuff pretty standard for a PC solely for gaming but then look at those specs.\n\nhttp://www.harveynorman.com.au/computers-tablets/computers/desktops/pryon-pry-nba10-02-nebula-desktop.html\n\n16 GB of ram LOL why??? Like they make PCs for a living surely they know anything over 8 is 95% of the time completely pointless for gaming.\n\nA 4 TB HARD DRIVE?? LOL??? WHY, WHY IS THAT THERE???\n\nThe cpu is basically irrelevant because the GPU will choke it inevitably.\n\nAnd then here it is, the star of any Gaming PC the GPU, and for some reason they thought crossfiring an integrated graphics with a cheap GPU (AMD Radeon 250) would be a good way to go about it LMEO. if they were to strip back 3 TB's of that hard drive, 8 gigs of that ram, a CPU that isn't disgustingly cost ineffective (just put some intel i5 cheap fker in there that'll get the job done) and then front load all of the savings from the above into a semi decent GPU and price it in the $1000 - $1200 range they could probably make a killing. but like if you're selling a \"gaming PC\" for $2000 and all you manage to get in it is a $90 GPU like seriously all I can say is you're taking the pisss, like this isn't even over pricing it's just straight but being uncompetitive terrible cost efficiency from the build, I'm not even into computers let alone own a fking company selling the things and I can only conclude that these guys must be trolling. This like Braum mid full ap with a lich bane tier trolling, makes no fking sense just no idea.","replies":[]},{"poster":"RichCont","date":"2014-12-01T07:38:16.528+0000","up_votes":1,"down_votes":0,"body":"Btw, http://www.harveynorman.com.au/computers-tablets/computers/desktops/hp-pavilion-500-201a-desktop.html <--- This will max out league and is $700 cheaper also from Harvery norman, the 240 will run Battlefield 4 on medium quite easily I believe. The lesser CPU will have 100% zero effect on your gaming, assuming the i5 in that is a Quad core should be cbf googling it. (The GPU in the cheaper PC is better than the GPU in the expensive PC in every way)\n\nThese computer retailers have always confused me, like they could easily cater to the gaming community if they want it's like they just ignore it, for example, they load up a PC with a 4770 i7 16gb of ram and a 3tb hard drive and then they give it a $30 - 50 GPU? It's like lol???? would it kill you to put a $150 - $200 one in so that PC can run ANYTHING. I just feel there is a market there that isn't being taking advantage of, meh. And surely the big computer companies like HP could get all their GPU's at a huge discount compared to your average joe that buys one GPU for their one computer their building. \n\n","replies":[]},{"poster":"csm","date":"2014-12-01T07:04:12.398+0000","up_votes":1,"down_votes":0,"body":"I could literally take a dump on the floor, plug some cords in to it, and it would run LoL on max settings.\n\nDo not buy a PC from Harvey Norman","replies":[]},{"poster":"Sackboy","date":"2014-12-01T06:18:04.943+0000","up_votes":1,"down_votes":0,"body":"Lol.\n\nI'm pretty sure my tablet can run League of legends. Don't bu ya pre-built PC, it'll be full of bloatware, build your own.","replies":[]}]}