{"poster":"TroubleAU","date":"2016-03-19T06:14:15.652+0000","title":"Tier1 is looking to expand into League of Legends!","subforum":"Team Recruitment","up_votes":2,"down_votes":1,"body":"Hello Everyone. Tier1 is a gaming organisation currently looking for members to join as League of Legends players. We decided to make this push with the success we currently are having with the csgo team. We will provide everything you need from entry&#039;s to jerseys.\r\nWe don&#039;t want to have to tell you guys what to do. So I am looking for players that are at a high skill level and knowledge about the competitive scene to play in this organisation. What your requirements need to be is as follows.\r\n\r\n- Mature is a big one. If you can not comply to follow rules of your captain or are toxic in game. Please do not bother.\r\n\r\n- Rank must be Diamond+ as we are looking to put you guys into OCS and further events.\r\n\r\n- Your IGN needs to be respectful\r\n\r\n- You need to have an open timetable for events and practice\r\n\r\n- Must speak English \r\n\r\n- Must be able to have fun!\r\n\r\nWe are currently looking for a:\r\n\r\nMid Laner\r\nTop Laner\r\nJungler\r\nADC\r\nSupport\r\nCoach/Analyst\r\n\r\nIf you meet all the above requirements Please reply to this thread with the following information:\r\n\r\nIGN:\r\nRANK:\r\nBIO:\r\nPREVIOUS LoL EXP:\r\nCOMPETITIVE EXP:\r\nLOCATION:\r\n\r\nThank you for your time in reading this. Hopefully you can join the squad one day  \r\n\r\nKind Regards,\r\nTrouble","replies":[{"poster":"abnormalx","date":"2016-03-24T02:12:43.387+0000","up_votes":1,"down_votes":0,"body":"IGN: abnormalx\nRANK: d5\nBIO: sup main, but can perform for the team in other roles, amazing peels and willing to play 100% for the team, quick learner, been a high warlord/2300 3s on wow BG9\nPREVIOUS LoL EXP: started end of s3 only played soloq\nCOMPETITIVE EXP: soloq\nLOCATION: melb","replies":[]},{"poster":"TRASH MARKSMAN","date":"2016-03-21T08:13:41.283+0000","up_votes":1,"down_votes":0,"body":"IGN: trash marksman\nRANK: d3\nBIO: adc main - god mechanics - good at shotcalling - adapt well\nPREVIOUS LoL EXP: idk fkn around\nCOMPETITIVE EXP: nothin much\nLOCATION: vic","replies":[]},{"poster":"catch this work","date":"2016-03-20T09:42:05.761+0000","up_votes":1,"down_votes":0,"body":"IGN: EternalEmVy\nRank: D5\nPrevious LoL Exp: Yes\nCompetitive Exp: High, I play Smash 4, Hearthstone and LoL competitively \nLocation: Murwillumbah, NSW\n\nBiography: I'm a mid laner/jungler who mainly plays aggressive based champions such as Talon, Rengar, Yi and Volibear. I'm open to change, such as learning meta picks as I'm doing currently e.g. Elise+Nid. When I play, I play to win, having fun is still good, however if I must make choices that win me the game, then I'll make those decisions accordingly. I've never had a fully functional team, so I'm looking forward in the days ahead to having a team that is non-casual and clicks with me in terms of synergy. As for me, as I've said before many times, I'm quite devoted to learning specific things and I'm always open for change+when it comes to tilt, I'm not one to be tilted in teams. \n\nAs for practice times, anytime between Mon-Fri: 4:15 onwards, excluding Wednesday+Thursday which is 6:15 onwards. Weekends: whatever is needed.","replies":[]}]}