{"poster":"Sumday","date":"2017-05-20T01:01:55.698+0000","title":"Mein Vorschlag: Free Skins für Alle!","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":3,"body":"**Warum jetzt?**\n\nJa; Ich gebs zu! Der Titel ist ein bisschen  &uuml;berzogen;\nIch habe letztens Heroes Of The Storm gespielt nach dem 2.0 Update und bevor jetzt der Hate of Doom kommt:\nIch spiel immer noch gern League und habe nicht vor aufzuh&ouml;ren oder euch zu bekehren!\n\nTrotzdem fand ich das Belohnungssystem in HotS 2.0 super und ich kann nicht aufh&ouml;ren dar&uuml;ber nachzudenken,\nwie gut es in LoL funktionieren w&uuml;rde!\nSchlie&szlig;lich habe ich das Blizzard MOBA davor echt komplett ignoriert, nach 2.0 habe ich HotS gespielt und bin dort sogar Platin gerankt!\n(das System ist das Gleiche wie in LoL)\n\n\n**Wie soll das mit den Free Skins funktionieren?**\n\nAlso in HotS kriegt man mit jedem Accountlevel Aufstieg eine kostenlose Truhe; sowie in LoL das Championlevel im Profil\nDie Schl&uuml;ssel w&uuml;rde ich einfach in LOL zuk&uuml;nftig abschaffen und die Truhen sollten ohnehin nicht so teuer sein wie jetzt!\n\nJeder sollte also anfangs so viele Truhen aufmachen k&ouml;nnen wie er Championlevel auf seinem Account hat!\nChampions sollten bis Level 5 gelevelt werden k&ouml;nnen wie bisher. Mit Level 5 bekommt man den roten Rahmen um den Champion und das Zeichen/Ingame Emote etc.\nAb Level 5 sollten die Exp bis zum n&auml;chsten Level nicht mehr steigen, sondern gleich bleiben!\nAb Level 10 sollte man dann das lila Abzeichen/Emote freischalten was es aktuell auf Level 6 gibt\nAb Level 20 sollte man das gro&szlig;e kriegen was es aktuell auf Level 7 gibt usw\nVielleicht gibt es ja danach neuere Zeichen, dass kann ja alles noch kommen ist ja nur ein Vorschlag.\n\n\n**Aber dann wird Riot doch arm und keiner kauft mehr Skins mit echtem Geld!**\n\nNein! Ich kenne viele Leute die keinen Cent in HotS gesteckt haben und seit dem neuen System geben Sie Geld f&uuml;r Juwelen aus!\n(die neue Echtgeldw&auml;hrung im Spiel)\nDurch meinen Vorschlag h&auml;tten die Leute einfach nur mehr Kisten und somit Champion/Skinsplitter auf ihrem Account.\nDiese w&uuml;rden Sie dann ohnehin weiter rerollen/benutzen/entzaubern und dann wieder neue Kisten kaufen.\n\nEs ist einfach motivierender sich zu unterhalten welche Skin man gezogen hat, für welchen Champion und ob man den spielt; welchen Champion man noch meistern will und wie gut man schon bereits geworden ist auf Champs die man so vielleicht nicht so oft spielt usw.\n\n\n**2 Beispiele**\n\nIch kenn z.B. jmd, ich w&uuml;rde ihn jetzt als Viel-Spieler bezeichnen, der schon viel Geld ca. 500&euro;+ in LoL investiert hat und f&uuml;r jeden seiner Main Champs wirklich alle Skins besitzt!\nDer kauft sich aber keine Skins mehr, weil er mittlerweile die Preispolitik von Riot seit der Einführung der Hextechwerkstatt sehr kritisch betrachtet und seine Favourite Skins eh schon hat (Ihn gehts also gar nicht um seine Skins wir finden das Truhen/Schlüssel System nur nicht perfekt). Die E-Sport MSI Kapseln finde ich auch sehr teuer. (600 RP für eine Kiste ohne permanente Skin ist schon teuer und es ist ja immer noch random)\n\nDann kenne ich eine andere Person; eher Casual die schon 10&euro; in LoL investiert hat und entt&auml;uscht war, wie wenig man doch f&uuml;r sein Geld kriegt!\nDie Person wird nicht wieder so schnell Geld für LOL ausgeben denke ich. Schade.\nMan kann jetzt nat&uuml;rlich sagen: Ja die wusste ja vorher schon wie viel man f&uuml;r 10&euro; kriegt, aber seid mal ehrlich, wenn man etwas j&uuml;nger oder neu in League ist sch&auml;tzt man Preise doch oft falsch ein.\n\n**Du selbst hast bestimmt viele Champion Level und schreibst das nur im eigenen Interesse!**\n\nJa, Ich habe 400+ Championlevel auf meinem Account, aber die habe ich komplett ohne Belohnung einfach nur aus Spa&szlig; erspielt (man glaubt es kaum) Jemand der so viele Championlevel hat; hat meistens eh alle Champions (Ich habe alle Champs und viel IP &uuml;brig)\nAlso w&uuml;rden mir Championshards gar nichts mehr bringen.\n\nBei den Skins sieht das nat&uuml;rlich anders aus, aber ich zahl eigentlich gerne, wenn ich denke das es fair ist!\nIch habe mir z.B. zu den MSI den {{champion:43}} Skin gekauft, weil ich den einfach super finde und Aktionen wie der angepasste Shop f&uuml;r einen selbst finde ich auch gut und habe ich auch genutzt. Aber die Inhalte der Hextechwerkstatt sind mittlerweile nicht mehr neu und sollten preislich angepasst werden.\n&quot;Meine Beispiele&quot; gibt leider es wirklich und vor der Hextech Werkstatt hat auch jeder gesagt, dass Riot niemals free Stuff releasen w&uuml;rde, weil dann ja keiner mehr weiterhin Echtgeld bezahlen w&uuml;rde, aber ich finde mit der richtigen Motivation und Fairness w&auml;ren vielleicht beide Seiten zufriedener.","replies":[{"poster":"BigSnipe","date":"2017-05-20T01:59:07.963+0000","up_votes":1,"down_votes":0,"body":"Wie die anderen schon gesagt haben, gibt es schon genug Free Skins. Wenn es mehr geben würde, würde ich keine mehr kaufen. \nNiemand zwingt dich Kapseln oder truhen zu  kaufen, du kannst auch einfach so Skins holen. Mache ich zB generell immernoch. \n\nNaja, dazu wird es bald eh noch mehr Free Stuff für arbeit geben. \n\nJedoch gibt es einen großen unterschied zwischen LoL und Hots. Ja ich spiele auch mal gerne Hots, jedoch ist Hots einfach nicht beliebt. -> Blizzard macht zwar viel für Hots jedoch kommt es nicht so gut an und Blizzard verdient nicht genug an Hots. Daher wurde das System vn overwatch implementiert und man bekommt sehr viel Free stuff. Sowas hat LoL finde ich nicht nötig. Skins sollten etwas besonderes bleiben, sonst kann man es auch direkt sein lassen.\n\nIch finde es viel besser wenn man unregelmäßig/abundzu  Skins bekommt, dann freut man sich auch eher darüber. zb die riotskins die es bei der Gamescom gab. oder Pax Skins. WM Skins. etc. \n\nWenn dann soll man auf SKins hinarbeiten können , jedoch nicht mit Lootboxen und noch mehr Lootboxen.","replies":[]},{"poster":"Nycaria","date":"2017-05-20T01:11:20.986+0000","up_votes":1,"down_votes":0,"body":"Es gibt genug Möglichkeiten an free Skins zu kommen. Einmal das von dir erwähnte Hextechcrafting und noch einen free Skin, wenn man in einer Season nach Gold kommt. Außerdem wird es wohl bald noch [das hier](http://euw.leagueoflegends.com/de/news/game-updates/features/dev-uber-missionen) geben, was wohl auch kostenlosen Kram geben wird. Das reicht meiner Meinung nach vollkommen.","replies":[{"poster":"Bryen91","date":"2017-05-20T01:50:04.433+0000","up_votes":1,"down_votes":0,"body":"^this\nIch finde, dass sich LoL in den letzten Jahren wirklich sehr verbessert hat was Sachen für free angeht.\nSo wie es jetzt ist, reicht das meiner Meinung nach vollkommen - klar, Skins sind eine coole Sache, aber kein must have - das sollte man nicht vergessen.\nAußerdem bin ich wirklich sehr gespannt wie das ganze mit den missions wird, das wird neue Abwechslung in's Spiel bringen und außerdem auch noch rewards geben - was will man mehr? :D","replies":[]}]},{"poster":"eXo500","date":"2017-05-20T01:45:39.431+0000","up_votes":1,"down_votes":0,"body":"wenn du skins free wilst mach bei tunieren mit .. ich kenn jemand der hat 540 skins weil er die letzten 3 jahre immer wieder tuniere gewonnen hat er hat nicht 1 ct in lol gesteckt ...","replies":[{"poster":"Sumday","date":"2017-05-20T01:55:22.091+0000","up_votes":1,"down_votes":1,"body":"Ja, also Danke für den Tipp aber ich denke nicht das jeder mal eben so bei einem Turnier mitmachen kann\nIch habe persönlich aus Spaß schon ein paar Turniere gespielt aber nie weil ich etwas gewinnen wollte,\nes geht mir hier wirklich eher um die Hextechwerkstatt weil ich das System einfach nicht fair finde.\nMan sollte für Random Inhalte nicht soviel Geld zahlen ich bin auch kein Fan von CS GO Skin Wetten und so","replies":[]}]},{"poster":"Oriius","date":"2017-05-20T01:31:56.929+0000","up_votes":1,"down_votes":0,"body":"Finde ich an sich gut hat auch ganz einfache Gründe für mich\n\n1. Ich hab nicht wirklich viel kleingeld über um teilweise für nen Skin 20 euro zu zahlen wenn man bedenkt wv skins es hier gibt.\n\n2. 1 Free skin pro Season KRASSE SACHE 1 Jahr pro skin xd \n\n3. Hextech crafting ja ok gut ist zwar n bisschen was aber da stört mich das einfach das man erstmal 3 Truhen brauch für 1 Skin und 2. das da auch noch champsplitter rauskommen können. einfach mal von 5 truhen 3 championsplitter gg rito also joa für ne möglichkeit an free skins zu kommen wäre ich schon soll halt nicht zu leicht sein\n\nZudem brauch man für höhere skinklassen mehr truhen (durch die essenzen) .... ","replies":[]}]}