{"poster":"PumpGuNz","date":"2019-06-27T20:52:17.554+0000","title":"Riot WTF","subforum":"Champions & Gameplay","up_votes":5,"down_votes":9,"body":"Ich hab mal ne frage wieso muss man chars überarbeiten und dann so op machen das sie ein spiel allein regieren können ... seit ihr so geldgeil oder einfach nur zu schlecht beim erstellen der stats??? \r\nEs ist ja wohl nicht so schwer einen mortekaiser ein wenig zu verändern ohne ihn gleich zum super held zu machen .. aber naja wer seine server ned mal gebacken bringt und betas an start bringt die nicht gehen , von dem ist vermutlich nix besseres mehr zu erwarten ...\r\n\r\nihr habt sowas von abgebaut, weder server , noch spiel modus oder char überarbeitung läuft bei euch .. Traurig wirklich traurig!!!!\r\nliegt das daran das es euch scheiss egal ist , weil ihr ja jetzt ganz dicke ne liga habt und so n tolles großes event game seit ... oder wirklich nur an eurer geldgeilheit ... billige server für randoms und op chars zum besser verkaufen!!! \r\n\r\nhauptsache ihr habt euren spass dabei .. also mir ist der Spass die letzten tage so  ziemlich vergangen... ihr solltet euch mal wirklich gedanken machen ob eier super neuer spiel mod sinn macht wenn ihr eure server ned mal ordendlich am laufen halten könnt .. :P \r\n\r\naber eigendlich drauf geschissen , den wie vor 5 jahren wird die antwort sein wir arbeiten im hochdruck an den problemen ...  und 3 wochen später sind sie immer noch da oder schlimmer.. :P Peinlich wirklich peinlich für RIOT !!!!","replies":[{"poster":"Most Salty Keggy","date":"2019-06-28T06:05:04.525+0000","up_votes":5,"down_votes":0,"body":"So\n1. Das Team was Champs macht ist ich für der Server Verantwortlichen!\n2. Es gab reworks die nicht so \"OP\" waren\n3. Ich glaube nicht das riot Geld geil ist, du kannst via Hexteccrafting skin bekommen die Geld kosten also schenkt riot dir eine menge\n4. Morde ist keines Wegs mehr \"OP\", mobile Champs gewinnen ständig gegen ihn!\nUnd ein kleiner zusatz\nDu kannst League kostenlos spielen und im Spiel gibt es so viel. \n150 + Champs und bestimmt 3 mal so viele skins.\n4 Spiel Modi und Events wenn du meinst du kannst es besser dann versuche dich mal selber an ein rework oder ein relevanten neuen champ der einzigartige Fähigkeiten besitzt. \n\nAlso bevor du hier dich beschwerst denke mal drüber nach was riot dir alles gibt und das kostenlos.\n\nPS und nur aram und 3v3 spielen und sich über Balance zu beschweren macht keinen Sinn 👌","replies":[{"poster":"PumpGuNz","date":"2019-06-28T10:40:27.745+0000","up_votes":2,"down_votes":0,"body":"1. is mir scheiss egal wer verandwortlich ist und wer in welchem team ist.. \n2. ja von 20 reworks sind 2 nicht op ...  haha geiler scheiss \n3. Was du glaubst , kannst weiter glauben. dann informiere dich, wer Riot und LoL geplant und gemacht hat und was das ziel war... \nwer verdient mehr ein spiele betreiber der 40 euro für sein game verlangt oder einer der ligas mit fans hat, junge fans die mit ihren 14 noch muttis geld für chars und skins ausgeben ... \n4. dann hast du ihn noch nicht von nem guten spieler gesehen, der ist unschlagbar mit seinen items^^\n\nund ein kleiner zusatz:\n\nwow danke das du mir die fakten aufzähst die jedes kind weiß!!!!  Also ich kann es nicht besser weil 1 person so einen konzern nicht leiten kann..\nRiot ist keine kleine familien betriebene firma, also vergleiche keine apfel mit bananen.. oder kannst du scheisse in glod verwandeln?","replies":[]}]},{"poster":"Megamaexx","date":"2019-06-28T05:38:19.380+0000","up_votes":5,"down_votes":0,"body":"Ich bezweifle mal, dass die Riot-Server billig sind. Ich denke mal, dass die Probleme eher mit dem alten Spaghetti-Code zusammenhängen, da das Spiel im Kern halt immernoch Elemente von damals verwenden wird. \n\nDie Server laufen übrigens ganz gut, wenn Riot mal keine neuen Sachen reinbringt xD vor TFT lief ja alles.","replies":[]},{"poster":"ItachiXAK","date":"2019-06-27T21:00:02.639+0000","up_votes":3,"down_votes":4,"body":"Stimme dir voll und ganz zu ! Neue champs sind IMMMER seeeehr stark. Wie kann das sein den ihn beherscht doch keiner?! Warum gibts eigentlich Test server? um starke buggs zu beheben  und mehr nicht? Dort solltet ihr sowas immer erst balancen.\n\nEin winrate von über 30% sagt aus das wenn dieser auch beherscht wird kann ihn niemand mehr halten. Und meist sind diese weit über 30%","replies":[{"poster":"Megamaexx","date":"2019-06-28T05:43:25.806+0000","up_votes":3,"down_votes":0,"body":"> Ein winrate von über 30% sagt aus das wenn dieser auch beherscht wird kann ihn niemand mehr halten. Und meist sind diese weit über 30%\n\nOder der Champion ist nicht allzu kompliziert zu verstehen? Wie Warwick zum Beispiel, den beherrschte man überwiegend bereits in der zweiten Runde. Eine niedrige Winrate ist nur bei Champions mit hohem Skillcap okay.","replies":[]},{"poster":"Barbara Drusel","date":"2019-06-28T04:56:42.713+0000","up_votes":4,"down_votes":2,"body":"Yuumi hatte ne winrate von ca. 30-52% aufsteigend über die Spielzeit.\nMordekaiser teils bei 75%.\nDas mag ja stimmen, dass neue Champs meistens zu stark sind, aber die Sache mit den Servern würde ich nicht unterschätzen. Und da du es selber nicht hinbekommen würdest, solltest du dich nicht beschweren,  wenn der Server 5-6 mal im Jahr Probleme macht. Vorallem wenn ein so gehypter Spielmodus wie TFT rauskommt. So wie du hier rumweinst bist du wahrscheinlich einfach nur ein hardstuck Iron Yasuo Spieler. Es ist nur ein Spiel und mehr nicht und bei Live Patches kommt es halt mal zu Problemen, das passiert einfach, auch wenn man es schon vorher auf dem PBE getestet hat.","replies":[{"poster":"PumpGuNz","date":"2019-06-28T10:14:58.010+0000","up_votes":2,"down_votes":1,"body":"Ich würde es sicher nicht hinbekommen , aber ich wütrde jemand finden der es hinbekommt^^ \nich habe lol seit anfang gespielt und bis heute sind immer noch die gleichen probs im code... \nDu bist ja ein richtiger pro.. und erzählst hier was von rumweinen, alter das sind fakten. die probleme von riot sind bekannt und du flachzange greifst mich dafür an das ich es ausspreche weil es mich stört .. du bist hier der rumheult weil einer sein geliebtes LOL kritisiert, das dich von deinem reallife ablenkt...","replies":[{"poster":"Crow911","date":"2019-06-28T10:26:16.128+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=PumpGuNz,realm=EUW,application-id=Wj1wcocU,discussion-id=9GAx3BnA,comment-id=000000000000,timestamp=2019-06-28T10:14:58.010+0000)\n>\n> Ich würde es sicher nicht hinbekommen , aber ich wütrde jemand finden der es hinbekommt^^ \n> ich habe lol seit anfang gespielt und bis heute sind immer noch die gleichen probs im code... \n> Du bist ja ein richtiger pro.. und erzählst hier was von rumweinen, alter das sind fakten. die probleme von riot sind bekannt und du flachzange greifst mich dafür an das ich es ausspreche weil es mich stört .. du bist hier der rumheult weil einer sein geliebtes LOL kritisiert, das dich von deinem reallife ablenkt...\n\nJa das sind immer die verkackten riot fanboys die jeden scheiss verteidigen was riot macht.\nHaben mich downgevotet weil ich riots serverstabilität in bezug auf tft kritisiert hab.\nIst mir eigentlich egal, aber mal euer hirn anschalten und objektivität bewahren ihr dämlichen riot fanboys wäre nicht zuviel verlangt!!!!\n{{sticker:zombie-brand-mindblown}}","replies":[]}]}]}]},{"poster":"RAID ShdwLegends","date":"2019-06-28T13:15:39.764+0000","up_votes":1,"down_votes":2,"body":"Ich hab mal **eine **Frage wieso muss man ***Chars überarbeiten und dann so op machen das sie ein ***Spiel allein regieren können ... ***seid ihr so geldgeil ***, oder einfach nur zu schlecht beim ***Erstellen der ***Stats???\nEs ist ja wohl nicht so schwer einen ***Mordekaiser ein wenig zu verändern ohne ihn gleich zum ***Superhelden zu machen .. aber naja wer seine ***Server ***nicht mal gebacken ***bekommt und ***Betas an ***den ***Start bringt die nicht gehen, von dem ist vermutlich ***nichts besseres mehr zu erwarten ...\n\n***Ihr habt sowas von abgebaut, weder ***Server, noch ***Spielmodi- oder ***Char-Überarbeitung läuft bei euch .. Traurig***, wirklich traurig!!!!\n***Liegt das daran das es euch scheiss (&lt;-- das akzeptier ich, weil du evtl aus der Schweiz oder Österreich kommst. Sonst: ***scheiß) egal ist, weil ihr ja jetzt ganz dicke ne liga habt und so ***ein tolles großes ***Eventgame seid ... oder wirklich nur an eurer ***Geldgeilheit ... billige ***Server für ***Randoms und ***OP-Chars zum ***besseren verkaufen!!! &lt;-- Der Satz ergibt im Allgemeinen keinen grammatikalischen Sinn\n\n***Hauptsache ihr habt euren ***Spass (evtl. ***Spaß) dabei .. also mir ist der Spass (Hey, hier war das S richtig!) die letzten ***Tage so ziemlich vergangen... ***Ihr solltet euch mal wirklich ***Gedanken machen ob ***euer super ***, neuer ***Spielmodus ***Sinn ***ergibt ***, wenn ihr eure ***Server ***nicht ~~mal ordendlich am laufen halten könnt~~ ***mal vernünftig laufen .. :P\n\n***Aber eigendlich ***darauf geschissen, ***denn wie vor 5 jahren wird die ***Antwort sein ***: \"Wir arbeiten im ***Hochdruck an den ***Problemen\" ... und 3 ***Wochen später sind sie immer noch da ***, oder schlimmer.. :P Peinlich ***, wirklich peinlich für RIOT !!!!\n\n\nMein Lieber Freund. Das einzige was hier peinlich ist, ist dein Verhalten im Internet und deine Rechtschreibung. Ich empfehle dir nocheinmal die Schule von der zweiten Klasse an zu besuchen. Ein Verhaltensseminar könnte auch nicht schaden.\n\nMit freundlichen Grüßen Manuel","replies":[{"poster":"PumpGuNz","date":"2019-06-28T15:44:43.942+0000","up_votes":2,"down_votes":0,"body":"Das einzig was noch peinlicher als meine rechtschreibung ist, sind s leute die kein plan habe aber überall mitreden wollen... bist auch so n geiler fan boy der kein reallife hat... und wieder mal kommt ein böser bube und kritisiert deine besten freund, Mr. LOL ...\n\nAlso das du leute und ihre rechtschreibung kritisiert aber Riot die fehler durchgehen lässt, das zeigt ja schon was du für ein mensch bist, große fresse hinterm pc haben und mitreden ohne plan. das sind mir die liebsten. kein sachlicher inhalt zum thema nur dumm auf rechschreibung anspielen.. hahahaha Richtig gut Manuel du musst auch noch lernen zu dissen oder einfach Fresse halten\n\nWas ein opfer ...","replies":[{"poster":"RAID ShdwLegends","date":"2019-06-28T19:09:10.093+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PumpGuNz,realm=EUW,application-id=Wj1wcocU,discussion-id=9GAx3BnA,comment-id=00040000,timestamp=2019-06-28T15:44:43.942+0000)\n>\n> Das einzig was noch peinlicher als meine rechtschreibung ist, sind s leute die kein plan habe aber überall mitreden wollen... bist auch so n geiler fan boy der kein reallife hat... und wieder mal kommt ein böser bube und kritisiert deine besten freund, Mr. LOL ...\n> \n> Also das du leute und ihre rechtschreibung kritisiert aber Riot die fehler durchgehen lässt, das zeigt ja schon was du für ein mensch bist, große fresse hinterm pc haben und mitreden ohne plan. das sind mir die liebsten. kein sachlicher inhalt zum thema nur dumm auf rechschreibung anspielen.. hahahaha Richtig gut Manuel du musst auch noch lernen zu dissen oder einfach Fresse halten\n> \n> Was ein opfer ...\n\nwow, du hast dir echt die mühe gemacht, darauf zu antworten xD\nich würde sagen, ich bin nicht der typ ohne leben :D","replies":[{"poster":"PumpGuNz","date":"2019-06-29T08:42:27.497+0000","up_votes":1,"down_votes":0,"body":":) naja wenn du meinst .. im gegensatz zu dir brauche ich für so n text 3-4 min...  aber kann mir schon vorstellen das das bischen text für dich ne lebensaufgabe ist.. weil mehr wie LOL zocken ist bei dir vermutlich nicht drin^^","replies":[]}]}]}]},{"poster":"xxDeepGamesxx","date":"2019-06-28T08:33:46.544+0000","up_votes":2,"down_votes":1,"body":"Also ich verstehe dein rumgeheule garnicht.\n\nKlar sind neue bzw reworked Champs am Anfang OP, da nicht alle kapieren, wie sie nun gegen sowas Spielen und zum anderen müssen sie erst einmal gebalanced werden. \nSowas wird auf dem PBE nicht gemacht, da dort weniger Spieler unterwegs sind= auch weniger Feedback, als auf dem Live. \nAuf dem Live Server kann man auch besser testen, wie sich der Champ verhält, wiw die Spieler ihn spielen und wie sie gegen ihn klarkommen. \nAll das kann man nicht wirklich auf dem PBE austesten, da niemand auf dem PBE ernst spielt oder sich gedanken drum macht (hier spielt keiner Ranked) \nWenn du Probleme mit Mordekaiser hast, solltest du ihn mit mobilen Champs countern, ihn selber spielen oder einfach bannen, bis er balanced ist. \n\nDie Server sind keineswegs billig. Man hat nur bei Updates und neuen Modi, wie TFT Probleme. Das ist völlig normal, wenn Server geupdated werden, dass nich immer alles Glatt läuft. Würdest du selbst ein paar Programme schreiben, wüsstest du das. Ich besitze selber zuhause einen eigenen Server, auf dem Voice-Server (TS), Clouds usw laufen und das funzt auch nicht immer auf Anhieb, wenn ich neue Versionen draufspiele.\n\nRIOT ist keinesweges Geldgeil. Du kannstbdir jeden Champ easy selbst kaufen, idem du mal anfängst das Spiel zu spielen, anstatt sich drüber aufzuregen. \nRIOT hat schon das Hextech Crafting eingeführt, mit dem sie uns gratis Skins schenken. Würdest du schon lange spielen, wüsstest du, dass es früher NIX umsonst gab. \n\nGeh bitte woanders über solche Probleme weinen, oder schreib den Support direkt. In letzter Zeit, gibt es auch einfach zu viele \"Frust-Posts\" wie deinen und es nervt langsam","replies":[{"poster":"PumpGuNz","date":"2019-06-28T10:49:57.096+0000","up_votes":1,"down_votes":0,"body":"Dafür brtaucht man keine programme schreiben um zu wissen das es firmen gibt die halb fertige releases raushauen ... \noder anderst herum ... die releases verschieben um ein perfectes ergebniss zu liefern.\n\nMal was schief gehen sagt sicher keiner was, aber es ist leider nicht mehr nur MAL...\n\nWenn dein Acc seit 2009 besteht kannst mitreden, ich weis das Hextech ein tolles entgegenkommen von riot war, weist du auch wieso sie das gemacht haben?   weil sie soviele leute an ein anderes spiel verlohrten haben ...  nicht aus nächsten liebe....","replies":[]},{"poster":"PumpGuNz","date":"2019-06-28T10:20:30.844+0000","up_votes":1,"down_votes":0,"body":"ohh es gibt zur zeit viele frust posts ... woran das wohl liegt sicher nicht an LOL die habe top server und balancen ja ihre neuen chars nachdem se paar wochen verkauft wurden ^^  hahaha   das hat nix mit weinen  zu tun was ich geschrieben habe ..    das hat was mit frust zu tun weil es vor 5 jahren  5 mal so gut lief ... is einfach fakt ^^\n\nIhr seit mir die liebesten wo direkt flamer schreien weil man das sagt was los ist..","replies":[]}]}]}