{"poster":"DrakeAland","date":"2016-08-10T17:58:30.980+0000","title":"Lagging","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So Ive played for about 8 months, and this game is fun as hell. Yet, recently Ive had lag spikes starting this August. I'll be fighting 1v1 and die when i freeze when it becomes a 3v1. No Im not making excuses as i have button mashed when I was ahead and gotten a triple the same way. Its just super annoying. Same wifi and data plan as January! I had high quality since January, but now i lagg spike at medium low quality! i disabled eye candy and done a ton of trial and errors! I just cant seem to get it to stop laging. What can i do to reduce this? Is this due to recent patches?","replies":[{"poster":"Targons Blade","date":"2016-08-10T23:20:53.081+0000","up_votes":1,"down_votes":0,"body":"Can you test on a wired connection to see if you still experience the issue? While WiFi is convenient, it doesn't always offer a stable connection, which League relies **heavily** upon. \n\nLet me know if using a wired connection changed the issue.","replies":[{"poster":"DrakeAland","date":"2016-08-12T05:17:45.313+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Targons Blade,realm=NA,application-id=osqw6G4M,discussion-id=6Hkvw02T,comment-id=0001,timestamp=2016-08-10T23:20:53.081+0000)\n>\n> Can you test on a wired connection to see if you still experience the issue? While WiFi is convenient, it doesn&#x27;t always offer a stable connection, which League relies **heavily** upon. \n> \n> Let me know if using a wired connection changed the issue.\n\nI tried a wired connection and it seemed to work for 3-4 games. Now its back to normal tho so it may have just been luck XD","replies":[{"poster":"Targons Blade","date":"2016-08-14T15:18:47.000+0000","up_votes":1,"down_votes":0,"body":"That's interesting that it only seemed to work for a few games. I recommend taking a look at the rest of the steps in our [connection troubleshooting guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to see if there's anything else in there that may help resolve your issue.\n\nLet me know the results of those steps.","replies":[]}]}]},{"poster":"REDSUPERCARR87","date":"2016-08-10T22:10:06.595+0000","up_votes":1,"down_votes":0,"body":"You can't do anything but quit league honestly lol. They will never fix it. Everyone is having problems with League of Lag.","replies":[]}]}