{"poster":"Chromatic Eagle","date":"2016-09-04T21:07:42.371+0000","title":"Will we ever explore the aquatic side of League?","subforum":"Story, Art, & Sound","up_votes":48,"down_votes":1,"body":"We have a few water based champions, but what goes on beneath the sea is a mystery. Perhaps that&#039;s intentional, but I&#039;d love to see what crazy creatures live in the deeper parts of the ocean.","replies":[{"poster":"Legacy Hydralpha","date":"2016-09-04T22:54:47.965+0000","up_votes":36,"down_votes":0,"body":"Rito Games: We heard you guys wanted aquatic champs.\n\nSo Ocean Drake is a champ now.","replies":[{"poster":"dragon1xx","date":"2016-09-05T03:38:38.608+0000","up_votes":34,"down_votes":0,"body":"https://media.giphy.com/media/3oEjHBe9FG25sGar6g/giphy.gif\nyou want more champs like fizz? \nNew champ:","replies":[{"poster":"SlntReaper","date":"2016-09-05T15:11:40.765+0000","up_votes":17,"down_votes":0,"body":"http://imgur.com/a2fdh3N","replies":[{"poster":"IEatLouis","date":"2016-09-05T18:13:53.781+0000","up_votes":2,"down_votes":1,"body":"I laugh...\n...\n...\nSo hard... xD","replies":[]}]}]},{"poster":"AzureLobster","date":"2016-09-05T02:25:04.500+0000","up_votes":9,"down_votes":0,"body":"I read that as Ocean Draven for some reason","replies":[]}]},{"poster":"Trolosaurus","date":"2016-09-05T00:43:25.886+0000","up_votes":15,"down_votes":0,"body":"To review\n{{champion:105}} Lore conflicts with canon. Was not part of Bilgewater update despite being an established part of it. \n{{champion:111}} Lore conflicts with canon. Same as above. \n{{champion:267}} Lore hasn't been touched since 2012 and since she wasn't part of either the Bilgewater or Targon updates despite having implied connection to the Lunari so....\n\nRito plz.","replies":[{"poster":"Decrit","date":"2016-09-05T10:56:13.233+0000","up_votes":3,"down_votes":0,"body":"I think nami just does not give a fuck of anything and does her thing.","replies":[{"poster":"TurquoiseYoshi","date":"2016-09-05T12:16:32.960+0000","up_votes":12,"down_votes":0,"body":"She went to Kanto to find her moon stone.","replies":[]}]},{"poster":"MavenSong","date":"2016-09-05T07:56:44.514+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Trolosaurus,realm=NA,application-id=6kFXY1kR,discussion-id=b8gUrQoI,comment-id=0007,timestamp=2016-09-05T00:43:25.886+0000)\n> {{champion:267}} Lore hasn&#x27;t been touched since 2012 and since she wasn&#x27;t part of either the Bilgewater or Targon updates despite having implied connection to the Lunari so....\n\n\nI really dont think Lunari had anything to do with moonstones despite the name. A moonstone is needed every 100 years but the Lunari were missing long before.","replies":[{"poster":"The Last Ballad","date":"2016-09-06T20:20:45.123+0000","up_votes":1,"down_votes":0,"body":"How long before? Because to a human, a century is quite the long time...","replies":[{"poster":"MavenSong","date":"2016-09-06T20:21:52.754+0000","up_votes":1,"down_votes":0,"body":"Its not specified but it has to be a while for them to have been forgotten. Something like a society isnt really forgotten over a couple generations.","replies":[]}]}]}]},{"poster":"THE RlVER KlNG","date":"2016-09-05T00:59:11.744+0000","up_votes":14,"down_votes":0,"body":"{{champion:223}} wouldnt't be surprised if it's just this fucker singing 'Under the Sea' with Fizz 24/7","replies":[{"poster":"theArtifacts","date":"2016-09-05T15:06:00.636+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=THE RlVER KlNG,realm=NA,application-id=6kFXY1kR,discussion-id=b8gUrQoI,comment-id=0008,timestamp=2016-09-05T00:59:11.744+0000)\n>\n> {{champion:223}} wouldnt&#x27;t be surprised if it&#x27;s just this fucker singing &#x27;Under the Sea&#x27; with Fizz 24/7\n\nAnd Crabgot ofcourse","replies":[]}]},{"poster":"Insanity Song","date":"2016-09-04T23:03:07.929+0000","up_votes":13,"down_votes":0,"body":"{{champion:111}} I JUST WANT TO KNOW WHAT HAPPENS TO THIS POOR SMUCK","replies":[]},{"poster":"Aeszarck","date":"2016-09-05T05:07:13.549+0000","up_votes":4,"down_votes":0,"body":"We have [this thing](http://am-a.akamaihd.net/image?f=http://news.cdn.leagueoflegends.com/public/images/articles/2015/august_2015/BBA/Bilgewater_Serpent01notext_1920x1550.jpg&resize=1024:).","replies":[{"poster":"Jhin UItd JFK","date":"2016-09-05T05:47:45.759+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Aeszarck,realm=NA,application-id=6kFXY1kR,discussion-id=b8gUrQoI,comment-id=000c,timestamp=2016-09-05T05:07:13.549+0000)\n>\n> We have [this thing](http://am-a.akamaihd.net/image?f=http://news.cdn.leagueoflegends.com/public/images/articles/2015/august_2015/BBA/Bilgewater_Serpent01notext_1920x1550.jpg&amp;resize=1024:).\n\nNagakabourous is already \"embodied\" through {{champion:420}}'s vessel that she hauls around. So it technically is a champion, just through another champion :P","replies":[{"poster":"Bioluminescence","date":"2016-09-05T06:10:12.113+0000","up_votes":10,"down_votes":0,"body":"> [{quoted}](name=Jhin UItd JFK,realm=NA,application-id=6kFXY1kR,discussion-id=b8gUrQoI,comment-id=000c0000,timestamp=2016-09-05T05:47:45.759+0000)\n>\n> Nagakabourous is already &quot;embodied&quot; through {{champion:420}}&#x27;s vessel that she hauls around. So it technically is a champion, just through another champion :P\n\nI don't believe that's Nagakabourous, though.  It's a piece of concept art that turns up in the \"[Building Bilgewater](http://na.leagueoflegends.com/en/news/game-updates/special-event/building-bilgewater-pirate-renovation)\" article with the following annotation:\n\n> _Bilgewater has a thriving industry built around hunting sea monsters. Fleets leave port at sunset each night, seeking these mighty beasts. If successful, they return to the Slaughter-Docks to render the once-great creatures down to meat, bones and armored hide._\n\nSo, that's not a god - that's what's for dinner!  (And for trousers and hats, and medicine, and lubricant, and armor plating, and building materials, and anything else they can think of!)\n\n######(Standard Bioluminescence disclaimer - I'm not part of the Narrative discipline, however, from my name you might guess that I do love some underwater stuffs myself.  I may have also put some thought into Runeterran ocean floor topography in the past.  Not sure if it'll go anywhere though.)","replies":[{"poster":"Duke Anax","date":"2016-09-05T18:22:19.342+0000","up_votes":2,"down_votes":0,"body":"As I understood it, the hunters would be really surprised to find a monster quite like that.\n\nI saw somewhere that that is a depiction of what people in Bilgewater generally think the Bearded lady looks like.\n\nIf they thik that is a God, I doubt the ones they regularly catch are quite near that size.\n\nI guess most of them are closer to ship sizes, so they can atually be hauled back, whith the ocational one being a bit larger, like that Wyrm Olaf fought.","replies":[{"poster":"Bioluminescence","date":"2016-09-05T18:49:58.670+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Duke Anax,realm=EUW,application-id=6kFXY1kR,discussion-id=b8gUrQoI,comment-id=000c000000000002,timestamp=2016-09-05T18:22:19.342+0000)\n>\n> As I understood it, the hunters would be really surprised to find a monster quite like that.\n> \n> I saw somewhere that that is a depiction of what people in Bilgewater generally think the Bearded lady looks like.\n> \n> If they thik that is a God, I doubt the ones they regularly catch are quite near that size.\n> \n> I guess most of them are closer to ship sizes, so they can atually be hauled back, whith the ocational one being a bit larger, like that Wyrm Olaf fought.\n\nAll I have to go off is the background from Burning Tides:\nhttp://i.imgur.com/WqpQlJq.jpg\n\nYou can see the carcasses of a few sea creatures already hacked up.  There's one dude in the picture background to help us with scale, but maybe more useful is the pair of [longboats](https://en.wikipedia.org/wiki/Longboat) further towards the back.  That hanging carcass looks at least 6.5 longboats long.\n\nLongboats are around 25ft long (7.6m) so that'd make that particular critter around 162ft (50m).  I'm going to guess that's a pretty normal size for a catch round there, seeing as the cranes and ramps look easily capable of handing a fish that big.\n\nAs for the bearded monster in the original image... uh that looks like a brig to me?  They're pretty big.  Pretty sure that's not a toy boat that you play with in the bath.","replies":[{"poster":"Duke Anax","date":"2016-09-05T20:47:48.719+0000","up_votes":2,"down_votes":0,"body":"Fit's whith what I thought, 50 meter is a fair size for a vessel of that setting, a large Brig or average Galleon (the Black Pearl for example is almost 60m).\n\nThere are some creatures that seem a bit larger than the hanging one, but overall \"about ship sized\" seems right.\n\nNow for the \"Bearded Lady\", measuring curves is a bit finicky, but I say it's at least 50 of that ship's lengths. Even if we take that for a smaller Brig (30m) we are looking at a creatures that measures at least a mile, possibly two.","replies":[]},{"poster":"Chromatic Eagle","date":"2016-09-05T19:31:14.607+0000","up_votes":1,"down_votes":0,"body":"How big is Baron Nashor?","replies":[{"poster":"Aeszarck","date":"2016-09-05T21:44:12.087+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chromatic Eagle,realm=NA,application-id=6kFXY1kR,discussion-id=b8gUrQoI,comment-id=000c00000000000200000000,timestamp=2016-09-05T19:31:14.607+0000)\n>\n> How big is Baron Nashor?\n\nI'd guess he'd probably be on the same scale as Cho'Gath and Rek'Sai, probably bigger. (A Cho'Gath and a quarter maybe.)","replies":[{"poster":"Chromatic Eagle","date":"2016-09-05T21:58:52.064+0000","up_votes":1,"down_votes":0,"body":"How big is Cho'Gath? I think Rek'Sai was said to be as big as a house.","replies":[{"poster":"Aeszarck","date":"2016-09-05T22:23:03.684+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chromatic Eagle,realm=NA,application-id=6kFXY1kR,discussion-id=b8gUrQoI,comment-id=000c0000000000020000000000010000,timestamp=2016-09-05T21:58:52.064+0000)\n>\n> How big is Cho&#x27;Gath? I think Rek&#x27;Sai was said to be as big as a house.\n\nAccording to this [user-made chart](http://i.imgur.com/gXOQp2N.jpg) based on estimations, he's 16 meters tall when he's full.","replies":[{"poster":"The Last Ballad","date":"2016-09-06T20:24:22.668+0000","up_votes":1,"down_votes":0,"body":"He is that big _now_... But you'll have to measure him after every meal...","replies":[{"poster":"Aeszarck","date":"2016-09-06T21:19:15.015+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Last Ballad,realm=NA,application-id=6kFXY1kR,discussion-id=b8gUrQoI,comment-id=000c000000000002000000000001000000000000,timestamp=2016-09-06T20:24:22.668+0000)\n>\n> He is that big _now_... But you&#x27;ll have to measure him after every meal...\n\nThe chart says he's 6 meters normally, so he probably poops after he gets to 16 meters.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"BloodyTompon","date":"2016-09-05T06:20:46.387+0000","up_votes":1,"down_votes":0,"body":"The thing that most concerns me about that is there are no other fishies. The sea is more barren than my literary (not literally) womb!","replies":[{"poster":"Bioluminescence","date":"2016-09-05T18:31:57.776+0000","up_votes":4,"down_votes":1,"body":"Well, it's not much (and you could argue they're reptiles, rodents, crustaceans, and cephalopods - not fishies) but there are the ironbacks, razorfins, (whatever-is-the-base-creature-of-the-)plundercrabs, and ocklepods from [Black Market Brawlers](http://leagueoflegends.wikia.com/wiki/Brawler).  \nPersonally, I loved the introduction of those little critters, but I agree it'd be neat to see more.\n\nHopefully without sounding too much like a scripted PR-bot, what sort of things were you thinking?  Opening it up to the thread.\n\n(I don't believe your 'literary womb' is as barren as you make out.)","replies":[{"poster":"Veraska","date":"2016-09-05T20:09:54.714+0000","up_votes":1,"down_votes":0,"body":"i'd love to see nami's people explored a bit more, i think i heard a red call them \"marai\" or something like that\nsame with fizz for that matter","replies":[{"poster":"MeilinII","date":"2016-09-05T20:39:04.642+0000","up_votes":2,"down_votes":0,"body":"according to her lore, they are the Marai, yes.\n> http://gameinfo.na.leagueoflegends.com/en/game-info/champions/nami/","replies":[]}]}]}]},{"poster":"rtbf225618241","date":"2016-09-05T08:25:26.428+0000","up_votes":2,"down_votes":0,"body":"Looks more like a sea-baron than a god.","replies":[]}]},{"poster":"Mogarl","date":"2016-09-04T23:57:43.233+0000","up_votes":3,"down_votes":1,"body":"We need a sea monster champion. No VO or sentience just gurgling/ocean sounds. A giant sea serpent could be cool but would probably end up looking too much like Aurelion. A giant crustacean would probably end up too much like Skarner or Reksai. A manta ray would be really cool, and is the one I think they should go with because it would be pretty visually distinct.","replies":[{"poster":"Davarril","date":"2016-09-05T00:30:06.367+0000","up_votes":6,"down_votes":0,"body":"Deep Sea Aurelion Sol","replies":[]},{"poster":"Xenos von Faneli","date":"2016-09-05T09:20:13.055+0000","up_votes":1,"down_votes":0,"body":"I feel like maybe it's possible you also just really like mantas... Also have you considered amalgam sea monster","replies":[{"poster":"Mogarl","date":"2016-09-05T18:32:54.835+0000","up_votes":1,"down_votes":0,"body":"Well mantas are really cool, but there is a bit beyond that. Rek'sai is violent, territorial, and down-right mean. To set another non-sentient champion apart from her a \"gentle giant\" approach would be good. So barring making up a completely new creature (which runs the risk of being too alien) starting with a base of whale or manta ray. I would avoid most fish because I don't believe that the side to side motion of their tales would look good in game. The primary reason I thought of mantas is that compared to other sea creatures they would look non-offensive hovering above the ground.\n\nSo while you may combine other things into the ray form, or change the details of it to make it more magical. I think that keeping the flattened form is what would look best in game.","replies":[{"poster":"Tyto Mors","date":"2016-09-06T07:52:32.878+0000","up_votes":1,"down_votes":0,"body":"things deep in our oceans look alien to us, far what we are used to, a god-like creature in the depths of runeterra would definitely be open to looking \"alien\". and for a new sea based champion, i think a turtle would work for a tank. currently nami is the only sea champion without feet that, and she seems to just float on mist.","replies":[{"poster":"Mogarl","date":"2016-09-06T08:32:51.869+0000","up_votes":1,"down_votes":0,"body":"Oh shit I forgot about turtles. I have no idea how they slipped my mind but a sea turtle could also look really cool. The reason I look talk about using a familiar creature as a base is mostly because of the [second page of monsters](http://artbook.na.leagueoflegends.com/en_US/volume-one#chapter/summoners-rift/section/monsters) in the art book. Where they mention that everything looked like void babies. If you don't want it to be confused with creatures from the void it's important that it looks \"natural\" in some way. \n\nBut yeah a giant turtle would be a totally viable source of inspiration.","replies":[{"poster":"Tyto Mors","date":"2016-09-07T06:58:33.516+0000","up_votes":1,"down_votes":0,"body":"i can see what you mean about the monsters looking alien and from the void, and that should probably be avoided, unless its a creature that came from the black water that {{champion:111}} feel in. that would be nice and maybe even add some back story to the black water.\n\nbut for the turtle, i mean its probably just my lack of creativity, but im having trouble at the moment picturing anything that doesnt deal with \"big ass turtle that is basically carrying an island on its back\" but im still thinking of the god-like aspect of things. and something smaller, say no bigger then a lvl 16 4 stack cho is even harder to think of a way to smoothly incorporate it into the game.\n\nbut back to the god-like aspect again, its hard to think of something that would fit the game, {{champion:136}} is suppose to be fucking massive at least from his lore that his what you come to understand, but in game he's quite small. i would imagine that a god-like creature even if its from the sea, would end up the same, so trying to think of a creature that would fit the script would be hard, i imagine even hard for riot to do properly.","replies":[{"poster":"Mogarl","date":"2016-09-07T07:48:20.119+0000","up_votes":1,"down_votes":0,"body":"But what if Riot has already tried making a Manta Ray champion. Hmm?\nhttp://a.disquscdn.com/uploads/mediaembed/images/841/1355/original.jpg\nhttp://a.disquscdn.com/uploads/mediaembed/images/841/1898/original.jpg\nHMMMMMMM?\n\nGoing to be honest most of my manta ray related thoughts came from these. I think that there is a fair chance that Riot has tried to make one of a sort and it was ice-boxed.\n\nTbh the only bit about what it looks like that really matters is that it has a unique silhouette. This rules out most serpents, cephalopods, or crustaceans. I'm not saying Riot couldn't make one just that it's unlikely do to loss of distinction.","replies":[{"poster":"Tyto Mors","date":"2016-09-07T07:59:50.892+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mogarl,realm=NA,application-id=6kFXY1kR,discussion-id=b8gUrQoI,comment-id=0004000200000000000000000000,timestamp=2016-09-07T07:48:20.119+0000)\n>\n> But what if Riot has already tried making a Manta Ray champion. Hmm?\n> http://a.disquscdn.com/uploads/mediaembed/images/841/1355/original.jpg\n> http://a.disquscdn.com/uploads/mediaembed/images/841/1898/original.jpg\n> HMMMMMMM?\n> \n> Going to be honest most of my manta ray related thoughts came from these. I think that there is a fair chance that Riot has tried to make one of a sort and it was ice-boxed.\n> \n> Tbh the only bit about what it looks like that really matters is that it has a unique silhouette. This rules out most serpents, cephalopods, or crustaceans. I&#x27;m not saying Riot couldn&#x27;t make one just that it&#x27;s unlikely do to loss of distinction.\n\nyou got me there, but i would thing this would be an airborne creature, then again it doesnt look like it has any feet so maybe. it would be weird though because that creature looks like its flying above the rest. would have to be some magical as fuck manta ray to be able to fly (or a pokemon).","replies":[{"poster":"Mogarl","date":"2016-09-07T08:21:16.636+0000","up_votes":1,"down_votes":0,"body":"I would assume that any Champion native to the sea, whether it is a god or a fish. Will likely float on Summoner's Rift. So any non-humanoid champion that comes from the sea, manta ray or not, I would bet that it will get a skin that makes it out to be flying. On other note it's likely that any great sea leviathan/god will be magical as fuck, otherwise what makes it special compared to all the sea beasts that Bilgewater drags in every day.","replies":[{"poster":"Tyto Mors","date":"2016-09-08T04:04:05.382+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mogarl,realm=NA,application-id=6kFXY1kR,discussion-id=b8gUrQoI,comment-id=000400020000000000000000000000000000,timestamp=2016-09-07T08:21:16.636+0000)\n>\n> I would assume that any Champion native to the sea, whether it is a god or a fish. Will likely float on Summoner&#x27;s Rift. So any non-humanoid champion that comes from the sea, manta ray or not, I would bet that it will get a skin that makes it out to be flying. On other note it&#x27;s likely that any great sea leviathan/god will be magical as fuck, otherwise what makes it special compared to all the sea beasts that Bilgewater drags in every day.\n\nfirst off, i love your wording, \"likely that any great sea leviathan/god will be magical as fuck\", just perfect. but to add something, it would be n'th times bigger then anything bilgewater has every pulled in, and then it would be magical. then league will shrink it like they did aurelion.","replies":[]}]}]}]}]}]}]},{"poster":"Xenos von Faneli","date":"2016-09-06T20:54:42.331+0000","up_votes":1,"down_votes":0,"body":"A big problem I see right off the bat would be animating its turning to look natural, as they faced with Aurelion, only he could bend Mantas can't, so logistically it'd be a bit weird","replies":[{"poster":"Mogarl","date":"2016-09-06T21:14:55.686+0000","up_votes":1,"down_votes":0,"body":"You don't have the same problem with Cho'gath, Elise, or Zac turning (just to name a few largeish champions). Aurelion had special problems because of his long tail, but by going with a turtle/Manta base the tale is a very small portion of the body mass. Whereas half of Aurelion's body is tail, and so he had special needs. You'd have more problems going with a serpent, shark, or porpoise. Although a serpent you could potentially swipe the movement from Aurelion, but at that point you might as well do a 1350 or legendary deep sea Aurelion skin.","replies":[{"poster":"Xenos von Faneli","date":"2016-09-08T03:00:03.224+0000","up_votes":1,"down_votes":0,"body":"it's not the tail that was the problem it was the large model, a manta type champ would likely be very large and flat, Elise and Zac aren't even that big and Cho only is when stacked at which point he looks weird, the big problem really comes from the fact that in game turning is more just instantly facing a direction, on a top down human it doesn't look weird, but make a larger flatter model and it starts to","replies":[{"poster":"Mogarl","date":"2016-09-08T06:55:11.887+0000","up_votes":1,"down_votes":0,"body":"That's a fair point, lack of turn speed makes some things more difficult. A ray form creature does a 180 turn instantly and people start asking questions.\n\nIf you look above you'll see some pictures I posted of a ray form entity popping up a few times. Possibly a champ concept that got ice boxed for similar reasons you stated.","replies":[]}]}]}]}]}]}]},{"poster":"Sharjo","date":"2016-09-04T22:57:47.066+0000","up_votes":6,"down_votes":0,"body":"Yes please. There's so much potential in underwater themes, and given the culture already in place around Bilgewater and the Serpent Isles, as well as the creatures we already know inhabit Runterra's seas and oceans, it's basically right there for the taking. Come on Riot let's delve back in to the depths again!","replies":[]},{"poster":"Kyrrion","date":"2016-09-05T23:11:59.890+0000","up_votes":3,"down_votes":0,"body":"Water/aquatic themed Marksman plz.  Full ocean team needed.","replies":[]},{"poster":"Mystic Delibird","date":"2016-09-05T15:03:38.286+0000","up_votes":3,"down_votes":0,"body":"well we had some new underwater lore not too long ago\n{{champion:111}}  \"Ekko's from the deep.\"\n-secrets now revealed {{champion:245}} -","replies":[]},{"poster":"Teh Song","date":"2016-09-05T22:02:00.945+0000","up_votes":2,"down_votes":0,"body":"I'm just waiting for the day Riot just goes \"Eh, lets add another continent on the other side of the planet.\" \n\nAfter all, none of the map images I've seen go all the way around, and those seas do have different names. They could just tell us nobody had ever sailed out far enough to find the other land. \n\nAnd whether they have somebody from that land pop up on Valoran or have someone from Valoran discover it, they could make a big event out of it, like when they originally brought in ascension and Shurima lore.\n\nActually you know what I hope they do it because adding a new land would allow them more freedom of creativity, in that they could make up new species or what have you without having to fit it into what's already in Valoran.","replies":[]}]}