{"poster":"Giovarco","date":"2015-03-04T20:19:56.024+0000","title":"Una domanda sull'MMR: quanto vale la mia prestazione in partita anche se perdo?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"So che le normali e le classificate hanno MMR diverso, tanto che nelle normali gioco con e contro diamanti e plantino, mentre nelle classificate gioco solo con Argento, dove trovo un quantitativo immagine di flamer e troll. Va beh, a parte questo, la mia domanda è: ma se io perdo una partita, il mio MMR verrà ricalcolato indipendentemente dalla mia prestazione in partita? Cioè, io sono capace, e la gente che gioca con me lo sa, farmo come un boss, non muoio mai in lane e supporto il team, ma se poi c'è un mio compagno che è 0/15 e con 35 minion a venti minuti, ovvio che perdo la partita.\n\nNon è un QQ, più che altro una curiosità.","replies":[{"poster":"Ediwir","date":"2015-03-05T02:08:53.327+0000","up_votes":3,"down_votes":1,"body":"La variazione di MMR è determinata dalla differenza di MMR tra te e gli avversari.\nSe vinci contro avversari più abili di te, sali molto. Se perdi, perdi poco.\nSe vinci contro avversari più scarsi di te, sali poco. Se perdi, perdi molto.\n\nQuindi se giochi molto bene, ma perdi contro un team di bronzo V... Beh, forse non stavi giocando così bene.","replies":[{"poster":"Giovarco","date":"2015-03-05T10:52:15.329+0000","up_votes":1,"down_votes":0,"body":"Ma quando dici \"se vinci\" o \"se perdi\", ti riferisci solo a me o anche alla mia squadra?","replies":[{"poster":"Ediwir","date":"2015-03-06T01:45:22.813+0000","up_votes":3,"down_votes":0,"body":"Non siamo francesi. Si vince solo quando si vince.","replies":[]},{"poster":"Frattaglia","date":"2015-03-05T11:35:41.706+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Giovarco,realm=EUW,application-id=MJVj50Jw,discussion-id=45RytAGK,comment-id=020000,timestamp=2015-03-05T10:52:15.329+0000)\n>\n> Ma quando dici \"se vinci\" o \"se perdi\", ti riferisci solo a me o anche alla mia squadra?\n\n\nDipende in maniera secca da se vinci o perdi la tua partita.\nSe la perdi ma sei 20/6, l'hai comunque persa :P","replies":[]}]}]},{"poster":"IrrationalNumber","date":"2015-03-04T20:41:31.468+0000","up_votes":1,"down_votes":1,"body":"Non si sa in verita'. C'e' chi dice che non conti il tipo di prestazione, ma l'algoritmo riot lo sa solo la riot.","replies":[{"poster":"Giovarco","date":"2015-03-04T22:46:44.350+0000","up_votes":3,"down_votes":0,"body":"Secondo me fa acqua da tutte le parti quest'algoritmo lol","replies":[]}]},{"poster":"omeomorfismo","date":"2015-03-05T11:14:30.574+0000","up_votes":1,"down_votes":0,"body":"beh, se i tuoi avverasi (silver come te) riescono a farmarsi i tuoi compagni fino a farli arrivare 0/15 e con 35 mininion in 20 minuti mentre te no, magari così capace non lo sei e molto probabilmente avrai trovato solo molte farm lane...","replies":[{"poster":"Giovarco","date":"2015-03-05T12:31:26.475+0000","up_votes":1,"down_votes":0,"body":"Oppure mi piacciono i tank puri che non fanno danno? Non giudicarmi se non mi conosci, anche perché non era il punto della discussione.","replies":[{"poster":"omeomorfismo","date":"2015-03-05T13:16:58.996+0000","up_votes":1,"down_votes":0,"body":"\"ti piacciono\" non è una risposta valida. stai facendo soloQ, un qualcosa che dovrebbe essere competitivo, non si picka per il piacere, ma per l'ottimizzazione.\nnon riesci a far fruttare la tua superiorità? colpa tua....","replies":[{"poster":"Janeseonline","date":"2015-03-06T13:23:03.037+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=omeomorfismo,realm=EUW,application-id=MJVj50Jw,discussion-id=45RytAGK,comment-id=000300000000,timestamp=2015-03-05T13:16:58.996+0000)\n>\n> \"ti piacciono\" non è una risposta valida. stai facendo soloQ, un qualcosa che dovrebbe essere competitivo, non si picka per il piacere, ma per l'ottimizzazione.\n> non riesci a far fruttare la tua superiorità? colpa tua....\n\nCerto certo, vorrei vedere te a giocare con quei XXXX che ti matchano in squadra, che non vanno in team fight, non wardano, feeddano, trollano, vanno afk, flammano, pickano katarina supp e ridono quando muoiono... vorrei proprio vedere se la pensi ancora così... sei unranked quindi ti consiglio di rimanere in silenzio, non sai cosa significa giocare con dei silver capitati li per caso perchè hanno vinto 2/10 e sono silver III. (P.S.) ai miei tempi della season 2, tutti partivano da bronzo, adesso... guarda che sfacelo...","replies":[{"poster":"omeomorfismo","date":"2015-03-06T13:31:47.939+0000","up_votes":1,"down_votes":0,"body":"mi consigli di rimanere in silenzio? ma sti cazzi, perchè mai dovrei rovinarmi il fegato in soloQ? per te? ma non farmi ridere\n[sborone mode on]poi me lo viene a dire un silver 3? nemmeno le 10 di piazzamento mi mette così in basso [sborone mode off]","replies":[]}]}]}]}]},{"poster":"Frattaglia","date":"2015-03-04T21:14:05.678+0000","up_votes":1,"down_votes":0,"body":"Non conta, ma dopo un tot di partite (>100) avrai vinto/perso abbastanza partite da avvicinarti alla tua lega/divisione.\n\nPuoi pure giocare proxy singed e morire una media di 10 volte, ma se riesci comunque a carriare abbastanza partite da vincerne, sali comunque.","replies":[{"poster":"Giovarco","date":"2015-03-04T22:44:24.977+0000","up_votes":1,"down_votes":0,"body":"Io non ce la faccio a carriare i silver. Sono veramente, veramente scandalosi {{champion:44}}\nMe ne torno a giocare le normali con i diamand che mi sento più stimolato.","replies":[{"poster":"Janeseonline","date":"2015-03-06T13:25:43.188+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Giovarco,realm=EUW,application-id=MJVj50Jw,discussion-id=45RytAGK,comment-id=00010000,timestamp=2015-03-04T22:44:24.977+0000)\n>\n> Io non ce la faccio a carriare i silver. Sono veramente, veramente scandalosi {{champion:44}}\n> Me ne torno a giocare le normali con i diamand che mi sento più stimolato.\n\nnon si possono carriare i silver di questa stagione... la maggior parte non sà neanche che uno dei 5 champ nel team, dovrebbe andare giungla...","replies":[]}]}]}]}