{"poster":"Giovarco","date":"2015-08-21T14:51:53.496+0000","title":"Il sistema delle punzioni","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"Come molti gi&agrave; sapranno sono all&#039;estero e, pur avendo una connessione che mi permetterebbe di giocare a 40 di ping (testato), ho avuto problemi a connettermi alle partite, tanto che ho dovuto farmi aiutare dal supporto giocatori per risolvere il problema. A causa delle varie prove fatte, anche se non sono mai stato punito in vita mia (a essere precisi, mi sono beccato un ban di 2gg al livello 3 quando ho iniziato a giocare), mi sono beccato la coda a bassa priorit&agrave;. Cosa ne penso? Che &egrave; una situazione schifosa in cui trovarsi (figuriamoci essere bannati!), ma non ho scuse: sono risultato AFK per quasi 8 partite di fila e il sistema mi ha subito punito e, diamine, se me lo meritavo. Sconto la mia pena e me ne torno a trollare con Common e SirZeel.","replies":[{"poster":"Ste the ripper","date":"2015-08-21T14:53:48.270+0000","up_votes":2,"down_votes":0,"body":"Non ho capito il senso del post, né perché tu sia dovuto arrivare a ben 8 partite afk di fila...","replies":[{"poster":"Giovarco","date":"2015-08-21T14:56:21.735+0000","up_votes":1,"down_votes":0,"body":"Il post è solo una riflessione che dovrebbe, in qualche modo, far scattare un dibattito.\n\nNon ho abbandonato partite, ma non mi ci faceva entrare, quindi mi si sono accumulate partite. Io, come un deficiente, invece di fare prove per la connessione sulle custom, le facevo sulle partite normali. Non chiedermi perché D:","replies":[{"poster":"Ste the ripper","date":"2015-08-21T15:21:15.414+0000","up_votes":2,"down_votes":0,"body":"Non c'è molta riflessione da fare...\nLa riflessione possiamo farla su cosa comportava in game e sul perché sia sbagliato, non di certo sul resoconto degli avvenimenti che hanno portato alla tua coda a bassa priorità, quelle sono solo scuse.\nBoh mi sembra assurdo, inoltre non è che sei migliore ora che hai avuto l'illuminazione, cioè ti sei dovuto prendere la punizione per capire che era sbagliato? O forse credevi che andando afk 8 volte di fila non sarebbe successo nulla?\n\nPs: so benissimo qual era il tuo problema, eri afk anche in una partita con me, quella in cui tra l'altro avevi lockato khartus jung... 20 minuti della mia vita presi e buttati nel cesso perché se fossi andato afk a fare qualcos'altro poi mi beccavo pure io la punizione...\nHo passato 20 minuti a giocare una partita già persa in principio, in cui non facevamo altro che venir stuprati da tutte le parti, funny :/\nMa un conto era fosse stata una casualità, allora ci sta, ma quando ho saputo che tu eri già al corrente del problema che avevi e che non hai nemmeno provato a rientrare in partita, beh, te lo dico, quello mi ha dato fastidio.\n\nIo sono uno che lagga spesso, so di cosa stiamo parlando, ho dei giorni, talvolta delle settimane in cui non posso giocare perché la mia connessione fa schifo, ma veramente molto schifo, ma non mi sono mai beccato una coda, ti devi davvero impegnare per prendertela...","replies":[{"poster":"Giovarco","date":"2015-08-21T15:42:21.886+0000","up_votes":1,"down_votes":0,"body":"In realtà, ti dirò, sono da 15+ giorni fuori. Sistemavo configurazioni e facevo una singola prova ogni due giorni. Questo è il motivo per cui non mi sono accorto di essere stato così tanto AFK.\n\nSi, si. Mi ricordo la partita con Karthus. C'era Common che giocava Soraka ADC bot. Ci credo che vi hanno stuprati lol\nIo ci provavo a ricollegarmi, ma non ci riuscivo. La cosa strana era che, ogni qual volta pensavo d'aver risolto perché mi faceva giocare una custom, iniziavo una normale e non mi faceva entrare. Misteri delle configurazioni.\n\nAdesso, credo che il supporto mi abbia dato il giusto input. Ho fatto 2 custom e poi 1 normale senza problemi e col ping a 38. Spero che il problema sia risolto al 100%, così possiamo riprovare a giocare insieme con Raka ADC e Karthus jungle :D\n\nAh, per la cronaca, \"riflessione che dovrebbe, in qualche modo, far scattare un dibattito\" doveva essere qualcosa del tipo \"Oh, finalmente qualcuno che non si lamenta per un ban/coda a bassa priorità ingiusta.\". Non ha attecchito a quanto pare. Mi hanno anche messo -1 >_>","replies":[{"poster":"Ste the ripper","date":"2015-08-21T15:48:30.575+0000","up_votes":1,"down_votes":0,"body":"Devi negare l'evidenza per poter dire che il sistema non sia giusto :/\nTant'è che quelli che vengono a lamentarsi vengono trollati\n\nAddirittura mi stupisce che ti abbia lasciato 8 volte, pensavo che già solo con 3 partissero le code","replies":[]}]}]}]}]},{"poster":"Skydago","date":"2015-08-22T18:16:16.066+0000","up_votes":1,"down_votes":1,"body":"A mio parere dovrebbero fare in modo che si possa distinguere che va afk da chi crasha.\nVoi direte \"è vero, ma comumqie stai rovinando il gioco a altre 4 persone in entrambi i casi.\"\nSi, anche questo è vero, e non dico che bisogna non punire chi crasha, ma almeno avere una punizione minore. È vero che si sta rovinando il gioco ma vi sembra giusto che uno che crasha per via della sua connessione/pc che veniva usata/o da alessandro magno ai tempi della riunificazione dell'asia venga punito allo stesso modo di uno che esce per il semplice gusto di lasciare la squadra in 4 e far perdere il team?","replies":[{"poster":"Giovarco","date":"2015-08-23T08:39:32.516+0000","up_votes":1,"down_votes":0,"body":"Il problema è: il server non vede nessuno collegarsi. Come sa che mi sono scollegato involontariamente?","replies":[]}]},{"poster":"lucanomax1994","date":"2015-08-21T15:04:42.150+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Giovarco","date":"2015-08-21T15:42:55.053+0000","up_votes":1,"down_votes":0,"body":"^","replies":[]}]}]}