{"poster":"Giovarco","date":"2016-01-29T13:47:08.539+0000","title":"Resoconto sulle traduzioni della lore e sulla mia fan fiction","subforum":"A Runeterra si parla italiano","up_votes":6,"down_votes":4,"body":"Buonasera a tutti!\n\nApro questo thread, riprendendo [il discorso che ho fatto poco fa](http://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/TQtMzqaA-il-giornale-degli-emissari-1-edizione), per fare il punto della situazione riguardo alle traduzioni sulla lore di League of Legends e la mia fan fiction La Rosa Rosso Sangue.\n\n\n#Traduzioni\nCome saprete, di recente sia io che NiraBlade siamo diventati emissari. Questo ci ha portato ad avere molto meno tempo libero per dedicarci alle traduzioni. Ecco un resoconto dettagliato della situazione:\n\n* Io e NiraBlade stiamo lavorando alla traduzione su Quinn. Confido che il risultato finale sia migliore rispetto alle traduzioni precedenti (niente spoiler, per&ograve;!). Siamo arrivati a met&agrave;, ma procediamo come lumache, visto gli impegni.\n\n* Abbiamo poi le prime due edizioni del giornale della giustizia di 8ttoAtomicBoy e PaxxerelloL0L. Uno &egrave; pronto e deve essere solo impaginato, mentre l&rsquo;altro ancora &egrave; in revisione.\n\nVorrei scusarmi con entrambi per tutti i ritardi che ci sono stati e ci saranno. Difatti, sono stato io a prendermi l&rsquo;incarico di revisionare ed impaginare i documenti per rendere il tutto gradevole visivamente nonch&eacute; coerente dal punto di vista contenutistico, ma, come ho spiegato sopra, mi sono trovato a dare priorit&agrave; ad altre cose. Tuttavia, il vostro tempo non andr&agrave; sprecato. Anche se c&rsquo;&egrave; stato una reiterata mancanza di comunicazione da parte mia, non preoccupatevi perch&eacute; non mi sono dimenticato di voi!\n\n\n#La Rosa Rosso Sangue\nAll&rsquo;incirca si ripropone la stessa situazione di prima, ma con una piccola variante. \n\nNessuno lo sa, ma inizialmente ero riluttante a condividere la mia fan fiction con tutti voi. Infatti, scriverla era una pura sfida personale, che volevo - s&igrave; - fosse portata a termine, ma con i miei tempi. Tuttavia, non ho tardato ad accorgermi che scrivere qualcosa senza ricevere feedback era un&rsquo;arma a doppio taglio, difatti questo mi portava a rischiare di commettere sempre gli stessi errori ogni capitolo, senza possibilit&agrave; di migliorarmi. Allorch&eacute;, alla luce dei miei nuovi impegni, ho deciso di prendermi piccola pausa dalle traduzioni per continuare a scrivere.\n\nDato che il mese a seguire dovrei essere un po&#039; pi&ugrave; libero di spostarmi, prevedo di fare un giro per le librerie della zona per cercare il mio caro e quanto mai anelato &ldquo;Le Leggende del Mondo Emerso&rdquo;. La speranza &egrave; che riprendere in mano questa trilogia mi ridia la carica necessaria per riprendere a scrivere.\n\n___\n\nGrazie a tutti quelli che hanno avuto la pazienza di leggere i miei thread e commentare. Voglio ricordare a colore che fossero interessati a ricevere quanto prima aggiornamenti sulla stesura dei nuovi capitoli, sulle nuove traduzioni oppure vogliono semplicemente contattarmi in privato, sono reperibile alla [mia pagina Facebook](https://www.facebook.com/LaRosaRossoSangue/).","replies":[{"poster":"Sky Striker Ace","date":"2016-02-01T11:08:27.940+0000","up_votes":1,"down_votes":0,"body":"Ah, io sto ancora traducedo il giornale lì (Volume 01, Issue 02), l'ho detto che sono molto lento in quanto traduco più o meno 2 o 3 frasi al giorno (Beh, non ho troppo tempo), tanto per dire che non me ne sono dimenticato.","replies":[{"poster":"Giovarco","date":"2016-02-01T11:53:34.562+0000","up_votes":1,"down_votes":0,"body":"Prenditi il tempo che serve.  Tanto dobbiamo finire quello di Quinn prima.","replies":[]}]},{"poster":"Ary9229","date":"2016-01-31T13:29:35.426+0000","up_votes":1,"down_votes":0,"body":"Ti auguro buona fortuna per la Rosa. Vi ringrazio per aver dato importanza a Quinn, non vedo l' ora di vedere il risultato.\n\n{{champion:133}}","replies":[{"poster":"Giovarco","date":"2016-01-31T14:12:51.845+0000","up_votes":1,"down_votes":0,"body":"Grazie mille!\n\nComunque Nira mi ha consegnato una bozza della traduzione. Direi che con un po' di impegno non dovremmo tardare troppo a pubblicarlo e a farti (-vi) rimanere a bocca aperta :)","replies":[]}]}]}