{"poster":"Giovarco","date":"2015-07-12T16:54:59.120+0000","title":"Gangplank: strategie e consigli testati nel PBE dal sottoscritto","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"**PASSIVA**\nNon c&#039;&egrave; molta da dire qui: approfittate della passiva ogni qual volta che potete per fare trade in lane, che ovviamente vincerete, oppure buttare gi&ugrave; torri.\n\n**Q**\nIl costo in mana &egrave; diminuito. Non avrete pi&ugrave; problemi di mana. Per il resto, fate big money e prendete serpenti.\n\n**W**\nNon ha bisogno di spiegazioni\n\n**E**\nQui viene il bello perch&eacute; i barili hanno mille usi.\n1. Riducendo i minion a poca vita e last hittando la wave di barili con la Q **&egrave; considerato come last hittare ogni singolo minion di Q**, quindi **avrete oro bonus e serpenti per ognuno di essi!** Dunque non andate a lamentarvi dalla Riot se non avete abbastanza serpenti per potenziare la ultimate! Appena avrete la {{item:3077}}, riuscirete a shottare le ondate in un attimo. Potenziare la ultimate due volte &egrave; abbastanza fattibile e rapido se last hittate di barile, ma in early game vi anticipo che &egrave; difficile da fare, quindi preoccupatevi di usarli per tradare.\n\n2. I barili sono ottimi per zonare gli avversari dai minion oppure per zonarli da voi stessi, se tendono ad andare aggressivi. Me la son cavata cos&igrave; con match-up difficili tipo {{champion:58}} \n\n3. Colpire un barile resetta la passiva. Potete fare tanti bei giochetti con i barili. Per esempio: piazzate un barile nel cespuglio (senza farvi vedere possibilmente) a met&agrave; lane e lasciatelo con un HP. Aspettate la vostra passiva. AA l&#039;avversario con la passiva + E sopra l&#039;avversario + Q sul barile nel cespuglio + Tons of DMG dall&#039;esplosione concatenata + AA con passiva all&#039;avversario. Avr&agrave; perso almeno la met&agrave; degli HP senza grande counterplay. State attenti per&ograve; che i barili devono stare abbastanza vicini per concatenare l&#039;esplosione.\n\n4. Piazzate un barile in un cespuglio e aspettate un malcapitato. Usate la stessa tecnica del punto 3.\n\n5. Usate i barili come Claymore quando splitpushate, cos&igrave; se vi vengono a gankare, il barile li rallenta dell&#039;80%!\n\n6. Se avete copertura in ward ( prendete il trinket che da 2 ward appena potete ) usate i barili per attivare pi&ugrave; volte di fila la vostra passiva, cos&igrave; da sciogliere le torri avversarie pi&ugrave; velocemente\n\n7. Se siete all&#039;inibitore, avrete problemi a fuggire se gankati. Piazzate in linea i barili dietro di voi, ma abbastanza lontani l&#039;un l&#039;altro per non farli detonare a catena. Quando scappate, fate esplodere i barili uno ad uno per ottenere velocit&agrave; di movimento gratis... e non dimenticatevi di tauntare gli avversari\n\n8. Anche se GP &egrave; migliorato tantissimo, continua ad avere il suo solito early game debole, quindi dovete essere bravi e veloci per fare trade in early game. In generale, la mia build &egrave; tipica da splitpush e si incentra sulla wave clear e sull&#039;AD, che fa scalare bene la passiva in mid game contro le torri:\n{{item:3077}} {{item:3158}} {{item:3074}} {{item:3046}} {{item:3031}} {{item:3046}} (oggetto situazionale)\n\n**Cose che non ho ancora capito**\nQuanti danni puri fa la tua ultimate e come si calcola. Bisognerebbe fare chiarezza a tal proposito.","replies":[{"poster":"Pizz Uh Jin","date":"2015-07-12T22:48:54.905+0000","up_votes":1,"down_votes":0,"body":"Quindi è sempre una specie di assassin?","replies":[{"poster":"Giovarco","date":"2015-07-13T05:22:29.406+0000","up_votes":1,"down_votes":0,"body":"Esatto.","replies":[{"poster":"miki2212","date":"2015-07-13T18:07:54.962+0000","up_votes":1,"down_votes":0,"body":"io non lo vedo tanto da assassin, quanto da splitpusher che porta utility: anche se magari in tf non ha moltissima utility, può sia far da bait che lanciare una ult dalla top per slownare i nemici o semplicemente per intrappolarli. In più mi immagino già i peggio bait: una pink per pulire il bush, gli alleati tutti li dentro, gp piazza barili; poi l'adc fa da \"esca\", li porta tutti li dentro e gp da inizio alle danze :D","replies":[]}]}]},{"poster":"StitchedClone","date":"2015-07-12T18:08:43.912+0000","up_votes":1,"down_votes":0,"body":"Potresti spiegarmi il ruolo di GP in teamfight?, premetto che ho usato 1 volta GP vs i bot al livello 12 e i GP che ho visto in ranked andavano a shottare gli altri champ e stavano in lane a splitpushare, tiravano una ulti per prendere l'assist e basta.","replies":[{"poster":"Giovarco","date":"2015-07-12T21:15:45.135+0000","up_votes":1,"down_votes":0,"body":"GP è uno splitpusher e non ha un ruolo in teamfight, ma se proprio vuoi farlo partecipare può:\n- Iniziare un teamfight con la ultimate\n- Può tirare una Q a un carry fuori posizione\n- Se è abbastanza late game, può piazzare i suoi barili strategicamente e fare danni ad area trementi, anche se per fare ciò deve esporsi.","replies":[{"poster":"StitchedClone","date":"2015-07-13T10:25:42.385+0000","up_votes":1,"down_votes":0,"body":"ok grazie del chiarimento","replies":[]}]}]},{"poster":"IrrationalNumber","date":"2015-07-13T07:05:58.970+0000","up_votes":1,"down_votes":0,"body":"Secondo me full ham non funzionera'. Lo vedrei come bruiser, non assassin. Hydra, trinity e il resto tank. Non ha gapclosers, preso una volta fuori posizione esplode con quel build.","replies":[{"poster":"Giovarco","date":"2015-07-13T07:43:26.456+0000","up_votes":1,"down_votes":0,"body":"Potrebbe funzionare, ma il problema è: che cosa offre GP al team? Beh, sicuramente meno di quello che potrebbe offrire una {{champion:113}} o {{champion:79}}. A quel punto, se proprio si vuole un engager, è meglio giocare {{champion:14}}. Dipende dai punti di vista, ma anche dalla comp del team avversario.","replies":[{"poster":"IrrationalNumber","date":"2015-07-13T08:38:24.032+0000","up_votes":1,"down_votes":0,"body":"Seju, Gragas e Sion son tank puri, non bruisers, e di sicuro non un poke \"facile\" come la q o la passiva di gp.\n\nAl limite se fai gp full assassin ad, why not rengar/talon/zed etc...e ti rilancio la palla\n\nCon il kit che ha adesso lo vedo come un bruiser dotato di utility. Ha poca mobility pero' e come splitpusher mi sembra mediocre (dovrei testare il waveclear ma dubito sia nulla di eccezionale). Il difetto di gangplank e' sempre stato che fosse mediocre in qualsiasi cosa e con questo rework gli stan solo dando un po' piu' di utility e harass decente in early e late. Sicuro puoi farlo critplank vecchio stile, ma si porterebbe dietro i difetti di prima. \n\nA onor del vero, la cosa migliore che questo gangplank sembra poter fare e' peeling. Puo' pokare o puo' proteggere la retroguardia al meglio. Non buon initiator, ma con due slow e la W per assorbire CC, lo vedo bene a peelare per i carry.","replies":[]}]}]},{"poster":"INAZUMA 33","date":"2015-07-12T17:57:05.732+0000","up_votes":1,"down_votes":0,"body":"Quello che mi piace é che il barile infligge danni in proporzione al danno che ha subito per esplodere :3 quello che mi dispiace, un po', e che i barili concatenati non infliggono danni aggiuntivi :<","replies":[{"poster":"Giovarco","date":"2015-07-12T21:15:52.664+0000","up_votes":1,"down_votes":0,"body":"Eh si, ma se il danno staccasse sarebbe OP. Considera che hanno un ottimo scaling e ignorando il 60% delle resistenze.","replies":[]}]},{"poster":"Firenheit","date":"2015-07-12T17:00:02.174+0000","up_votes":1,"down_votes":0,"body":"Per non la statikk?\nE io ho ancora dubbi con la E... \nPraticamente metto dei barili, con un massimo di due, che se colpiti da me esplodono, \"tutto qui\", giusto?","replies":[{"poster":"Giovarco","date":"2015-07-12T17:02:09.753+0000","up_votes":1,"down_votes":0,"body":"Esatto. Niente di trascendentale. Il massimo numero di barili piazzabili scala con la ultimate, se non ricordo male, quindi va da 3 a 6.","replies":[{"poster":"Firenheit","date":"2015-07-12T17:02:46.196+0000","up_votes":1,"down_votes":0,"body":"Io ho letto che se il barile è colpito dal nemico, viene eliminato senza debuff, è vero?","replies":[{"poster":"Giovarco","date":"2015-07-12T17:14:16.506+0000","up_votes":1,"down_votes":0,"body":"Certamente. Da 10 gold e non esplode. I barili non hanno tanto range, quindi farli esplodere al momento giusto prima che l'avversario si avvicini abbastanza per last hittarlo non è facile.","replies":[{"poster":"Firenheit","date":"2015-07-12T17:15:33.187+0000","up_votes":1,"down_votes":0,"body":"Appena esce me lo provo ben bene...\nPensa che io prima che il rework fosse stato svelato, immaginavo una Q simile a quella di Jinx, attivandola l'AA cambiava in ranged, sparando :s \nSo much OP","replies":[{"poster":"Ringiel","date":"2015-07-12T18:45:31.839+0000","up_votes":1,"down_votes":0,"body":"coff coff ... jayce ... coff coff","replies":[{"poster":"Firenheit","date":"2015-07-12T19:08:34.720+0000","up_votes":1,"down_votes":0,"body":"Jayce cambia set, non solo l'AA","replies":[{"poster":"Ringiel","date":"2015-07-12T19:15:14.314+0000","up_votes":1,"down_votes":1,"body":"però switcha da meele a ranged o viceversa ... secondo me era un esempio più azzeccato che jinx,visto che lei rimane cmq un ranged dopo il cambio arma","replies":[{"poster":"Firenheit","date":"2015-07-12T19:44:26.385+0000","up_votes":1,"down_votes":0,"body":"Dire come Jayce, è una cosa più ampia come ti ho già spiegato :) \nLa Q di Jinx varia l'effetto solo dell'AA :)","replies":[]}]}]}]}]}]}]},{"poster":"INAZUMA 33","date":"2015-07-12T17:53:30.849+0000","up_votes":1,"down_votes":0,"body":"Aumentano con l'aumentare del grado della E :)","replies":[]}]}]}]}