{"poster":"Giovarco","date":"2016-01-31T12:03:13.187+0000","title":"Il futuro della nuova selezione dei campioni","subforum":"Discussioni generali","up_votes":10,"down_votes":2,"body":"Circa 6 ore fa, [Riot Socrates ha condiviso alcuni punti sul futuro della nuova selezione dei campioni](http://boards.na.leagueoflegends.com/it/c/riot-official/zJ4kqlHZ-the-future-of-new-champ-select). A seguire il contenuto tradotto in italiano.\r\n\r\n___\r\n\r\nSalve a tutti,\r\n\r\nadesso che la nuova selezione dei campioni &egrave; stata rilasciata ed &egrave; stabile, volevano condividere gli aggiornamenti che abbiamo intenzione di fare nelle prossime settimane e mesi.\r\n\r\n1. Le proprie scelte non verranno pi&ugrave; mostrare al team avversario quando il vostro turno ha inizio\r\n2. Aggiunta di nuovi filtri per suddividere la griglia dei campioni per ruolo\r\n3. Possibilit&agrave; di calibrare la griglia dei campioni in ogni momento\r\n4. Accorciare i timer di pre-selezione, selezione e ban\r\n5. Possibilit&agrave; di acquistare nuovamente gli aspetti\r\n6. Diversi bugfix:\r\n6.1. Correggere alcuni piccoli blocchi quando si entra o si lascia la stanza\r\n6.2. Correggere alcuni problemi quando si entra o esce durante il matchmaking (per esempio essere considerati dodger, se non si accetta un match dove un giocatore &egrave; gi&agrave; nella selezione dei campioni)\r\n6.3. Correggere diverse imprecisioni sul tempo stimato di coda\r\n6.4. I campioni gratuiti della settimana non saranno pi&ugrave; giocabili nelle classificate\r\n6.5. Correggere un problema dove il client non appare in primo piano ogni volta che un&#039;azione (AFK check, ban, pick) &egrave; richiesta\r\n\r\nStiamo continuando a regolare il matchmaking in termini di tempi e qualit&agrave; (misurati come la probabilit&agrave; per entrambi i team di avere la stessa percentuale di vittoria) e la patch 6.2 ha gi&agrave; portato alcune feature come la selezione degli aspetti per i lumi e dei chroma pack. Nota: la lista al momento non &egrave; esaustiva.","replies":[{"poster":"IamTheDream","date":"2016-01-31T13:21:11.642+0000","up_votes":1,"down_votes":2,"body":"6.4. I campioni gratuiti della settimana non saranno più giocabili nelle classificate\n\n...nel senso che** se non hai acquistato quale champ non potrai usarlo** oppure basta che è nella free week ed è automaticamente bannato nelle classificate?","replies":[{"poster":"Giovarco","date":"2016-01-31T14:21:43.297+0000","up_votes":5,"down_votes":1,"body":"Se il campione è acquistato, lo potrai usare in ranked, altrimenti i campioni in rotazione non ti appaiono.\n\nQuesta feature esisteva già nelle ranked prima della nuova selezione dei campioni.","replies":[]},{"poster":"Firenheit","date":"2016-01-31T14:17:54.557+0000","up_votes":2,"down_votes":0,"body":"Se non lo hai acquistato non puoi usarlo neanche se è in rotazione :)\n\nIn parole semplici puoi usare solo i campioni che hai comprato ^^","replies":[]},{"poster":"Náos","date":"2016-02-01T10:26:55.316+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IamTheDream,realm=EUW,application-id=MJVj50Jw,discussion-id=hYmQILYE,comment-id=0002,timestamp=2016-01-31T13:21:11.642+0000)\n>\n> 6.4. I campioni gratuiti della settimana non saranno più giocabili nelle classificate\n> \n> ...nel senso che** se non hai acquistato quale champ non potrai usarlo** oppure basta che è nella free week ed è automaticamente bannato nelle classificate?\n\nSecondo te bloccheranno un champ ad un giocatore che lo s ha acquistato o faranno come nelle vecchie ranked?","replies":[]}]},{"poster":"NicogenFTW","date":"2016-01-31T12:12:54.040+0000","up_votes":2,"down_votes":3,"body":"In che senso le proprie scelte non verranno mostrate al proprio turno?","replies":[{"poster":"Firenheit","date":"2016-01-31T12:26:21.431+0000","up_votes":4,"down_votes":1,"body":"Quando è il tuo turno di pickare, il team avversario può vedere il campione che hai pickato nella fase di intenzione!","replies":[{"poster":"Groox II","date":"2016-01-31T23:30:06.927+0000","up_votes":1,"down_votes":0,"body":"Effettivamente mi seccava che i nemici vedessero cosa volevo usare dal principio.","replies":[]}]},{"poster":"Nibbio Bianco","date":"2016-01-31T12:15:31.201+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=NicogenFTW,realm=EUW,application-id=MJVj50Jw,discussion-id=hYmQILYE,comment-id=0000,timestamp=2016-01-31T12:12:54.040+0000)\n>\n> In che senso le proprie scelte non verranno mostrate al proprio turno?\n\nQuando picki fai vedere al tuo avversario che campioni stai cliccando. Credo che era non lo possano vedere più fino al tuo lock.","replies":[{"poster":"NicogenFTW","date":"2016-01-31T12:28:10.175+0000","up_votes":1,"down_votes":2,"body":"Ok, quindi una cosa comunque di ben poca rilevanza ^^","replies":[{"poster":"Judge Drakoo","date":"2016-02-01T10:31:26.804+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=NicogenFTW,realm=EUW,application-id=MJVj50Jw,discussion-id=hYmQILYE,comment-id=000000000000,timestamp=2016-01-31T12:28:10.175+0000)\n>\n> Ok, quindi una cosa comunque di ben poca rilevanza ^^\n\nLa cosa era (è ancora fino alla modifica) molto fastidiosa in Classificata, dove magari decido di swappare con qualcuno ma intanto la squadra avversaria scopre cosa avrei voluto prendere per me. Per questo negli ultimi giorni in classificata molti non preselezionavano un campione, o ne preselezionavano uno \"fasullo\".","replies":[]},{"poster":"LightIsMyPath","date":"2016-01-31T13:33:37.077+0000","up_votes":2,"down_votes":1,"body":"Non direi. Se io picko per esempio {{champion:117}}  i nemici non sanno se sarò mid, top o support. Se mi vedono cambiare da Janna a Lulu però sapranno che sarò una Lulu support...","replies":[{"poster":"NicogenFTW","date":"2016-01-31T14:44:41.096+0000","up_votes":1,"down_votes":0,"body":"Beh mi sembrano cose molto \"superflue\" soprattutto se non stai giocando con amici ma in solo q, in ogni caso ho capito l'intenzione della cosa ;)","replies":[]}]},{"poster":"Giovarco","date":"2016-01-31T12:43:32.760+0000","up_votes":3,"down_votes":2,"body":"Non esattamente. Poteva essere rilevante perché avresti potuto indirettamente svelare al tuo avversario la corsia in cui saresti andato e con quale campione. Era indubbiamente una cosa non voluta.","replies":[]}]}]}]},{"poster":"Ary9229","date":"2016-01-31T13:24:54.723+0000","up_votes":1,"down_votes":1,"body":"A me piace un casino la nuova selezione. E' più, bilanciata. Avrei aggiunto però la possibilità di cambiare lane con uno dei giocatori nel caso ipotetico di trovarsi un counter o roba simile. Lo so lo so... il ruolo che mi è stato assegnato devo rispettarlo, malauguratamente però nella nuova selezione avrei dato questa piccola chance. Del resto funziona benissimo. Complimenti Riot.\n\n{{champion:90}}","replies":[{"poster":"Giovarco","date":"2016-01-31T14:20:35.185+0000","up_votes":2,"down_votes":0,"body":"Beh, in realtà puoi ancora farlo, scambiare personaggio o lane con qualcuno. Basta comunicare, anche perché il tempo adesso c'è perché la Riot ha rimosso tutto il flame iniziale per le posizioni da prendere ^_^","replies":[]}]},{"poster":"Firenheit","date":"2016-01-31T12:28:31.550+0000","up_votes":2,"down_votes":1,"body":">Accorciare i timer di pre-selezione, selezione e ban\n\nPer far leftare la lobby prima 8)","replies":[{"poster":"ViaMalinconiaN9","date":"2016-01-31T12:57:55.958+0000","up_votes":2,"down_votes":2,"body":"Io avrei sperato che l'aumentassero D=\nCioè i pick prima dei ban, sono fatti per \"organizzare\" (oltre a non far bannare chi vorresti) il tempo a disposizione è pochissimo, non so a voi, ma io scelgo l'adc a seconda del supp, ma se il supp ci mette 30'anni io poi non posso riflettere su quale adc dovrei pickare per funzionare bene!\nStessa cosa con il jungle, io lo scelgo (non sempre, ma quasi) in base al team completo (sopratutto mid e top) se manchiamo di ap prendo Diana, se manchiamo di engage o di tank prendo Vi, ma se non mi danno il tempo di \"organizzarmi\" perde molto valore questa fase.\nDiminuire il tempo? bah..","replies":[{"poster":"Firenheit","date":"2016-01-31T13:04:01.689+0000","up_votes":1,"down_votes":1,"body":"Sinceramente, per me, quello che fanno, sbagliano.\nMolto opinabile ma la penso così!","replies":[{"poster":"ViaMalinconiaN9","date":"2016-01-31T13:13:11.717+0000","up_votes":2,"down_votes":1,"body":"Esprimiti ù.ù","replies":[]}]},{"poster":"Groox II","date":"2016-01-31T23:32:13.660+0000","up_votes":1,"down_votes":0,"body":"Beh, la preselezione anche se non la scegli non è importante.","replies":[]}]}]},{"poster":"Groox II","date":"2016-01-31T23:34:42.069+0000","up_votes":1,"down_votes":0,"body":"La lista non è esaustiva, e forse già l'hanno considerato, ma in caso non l'avessero fatto dovrebbero mettere l'impossibilità di essere invitati se si è già nella selezione. Arrivano inviti durante il ban o durante la fase di pick. Se qualcuno per un qualsiasi motivo per sbaglio clicca sull'invito annulla tutto.","replies":[{"poster":"Giovarco","date":"2016-02-01T11:57:17.352+0000","up_votes":1,"down_votes":0,"body":"Se devo dirla tutta, non mi è mai capitato, ma dovresti segnalarlo in \"Aiuto e supporto\" perché mi sembra un bug un po' antipatico (oppure sarà voluto?).","replies":[]}]},{"poster":"Mughichan","date":"2016-02-01T09:02:36.527+0000","up_votes":1,"down_votes":0,"body":"Io eliminerei al momento la pre-selezione dei campioni. Quei 30-35 secondi sono del tutto inutili. Non influenzano per nulla la pick e ban successiva. Pure se voglio giocare un champ, se in quel momento è permabannato comunque le bannano anche se l ho pre-selezionato. Quel mezzo minuto me lo risparmieri volentieri. Per il resto sono molto contento per ora. Ognuno gioca ciò che vuole e il flame/troll almeno nelle mie partite è diminuito drasticamente.","replies":[]},{"poster":"Elle C","date":"2016-01-31T22:18:57.232+0000","up_votes":1,"down_votes":0,"body":"Nessuno parla del fatto che con la combinazione mid sup è impossibile ottenere la mid? Porca puttana su dieci partite pref mid poi sup sono andato otto volte sup... Scherziamo? Dai cazzo dovrebbe essere l'inverso... Attualmente è impossibile selezionare quei due ruoli puntando alla mid... Per avere la mid bisogna mettere tipo mid top o mid jng poi se ti capita il secondo ruolo che fai? Trolli? Cazzo dovrebbero darti la possibilità di aspettare più tempo per avere la mid! Non voglio una queque di due secondi se non mi da il primo ruolo! Ci vuole tanto a capirlo?","replies":[]}]}