{"poster":"Giovarco","date":"2015-07-11T22:24:24.810+0000","title":"Doppiaggio GP: DanielSAN questa volta hai toppato!","subforum":"A Runeterra si parla italiano","up_votes":5,"down_votes":1,"body":"Il doppiaggio di GP fa spavento. Non &egrave; piratesco neanche la met&agrave; di quello di Kratos e non ha confronto con la versione inglese! Sembra Turtleman! Eddai io volevo mainarlo sto GP, ma non con questa voce  non si può :(\n\nNOTE: Non sono di parte, infatti ho il client italiano in live.","replies":[{"poster":"Riot DanielSAN","date":"2015-07-13T18:11:00.246+0000","up_votes":3,"down_votes":0,"body":"Per questo campione, su cui gravita tutto Bilgewater, avevamo in mente svariate voci. Pannofino era ovviamente una di quelle (sicuramente avrei registrato un \"APRI TUTTO!\" e \"SMARMELLA!\" per la suprema ahahah), la voce italiana di LeChuck era un'altra, ma l'immenso Pier Luigi Zollo è deceduto dieci anni fa. Per vari motivi abbiamo optato per il valido Melazzi, che ci sembra una scelta buona. A volte abbiamo un nome in mente da quando sappiamo che tipo di voce cerchiamo, ma, soprattutto per personaggi impegnati nel cinema e in tv, fare coincidere le nostre esigenze di doppiaggio con i loro impegni, non è sempre facile. Secondo voi non ci avevamo pensato al doppiatore di Leonida per Pantheon? Abbiamo scelto per altro a causa di vari motivi, non perché ce ne siamo dimenticati o perché volevamo risparmiare! \n\nIl nuovo Gangplank è un po'meno macchietta di quello vecchio, e più verso un  quindi abbiamo scelto una voce un po'più profonda che ci piaceva per il ruolo. Ovviamente non può piacere a tutti (sono rimasto piacevolmente stupito dalle vostre reazioni di Ekko e Tahm Kench!) ma penso sia abbastanza adatta al personaggio :)","replies":[{"poster":"KamenRider KAITO","date":"2015-07-15T18:22:22.223+0000","up_votes":2,"down_votes":0,"body":"adoro Melazzi dopo i grandi lavori che ha fatto sopratutto come Max Payne, quindi a me la voce piace e parecchio ( sopratutto le frasi dell'annunciatore per l'evento di Bilgwater), però Pannofino sarebbe stato proprio una vera chicca. {{item:3070}} {{item:3070}}","replies":[]},{"poster":"Giovarco","date":"2015-07-13T20:32:59.586+0000","up_votes":1,"down_votes":0,"body":"Sai, noi giocatore abbiamo il paraocchi, me compreso, e non vede il lavoro che c'è stato dietro per voi. Io ho sempre trovato epica la voce di GP ed era uno dei motivi per cui lo giocavo, infatti ci son rimasto veramente male quando avete cambiato doppiatore. Col senno di poi, giocando di più sul PBE con la voce italiana, mi sono accorto che non è così male come avevo percepito al primo impatto, anche se mi mancherà il vecchio GP. Sarebbe possibile invece sapere il nome dall'attuale voce di GP (quello in live)?\n\nP.S: A me la voco di Ekko e TK piacciono molto e di ottima fattura :)","replies":[]}]},{"poster":"Vileblood Pyke","date":"2015-07-11T23:34:14.780+0000","up_votes":3,"down_votes":0,"body":"Boh, più l'ascolto e meno problemi mi dà... Anzi, inizia quasi a piacermi.\n\nIl doppiaggio resta ben fatto, anche se la nuova voce può essere \"meno piratesca\" di quella vecchia...","replies":[]},{"poster":"Nibbio Bianco","date":"2015-07-11T23:11:41.593+0000","up_votes":3,"down_votes":0,"body":"Questa è la voce più piratesca. \n\nè quella di MR 2 BON KURE! http://api.ning.com/files/cF26NCR-GLnX55K6PIfb4cmroSQ5WaD4274enygWQBNE04pEPI0xPqNMh1tBsp8eTEcoQH1SuUYh1RrcWxAZPbEQnS1fTHcb/Mr.2BonKurei4.jpg\n\nOk, è la meno piratesca possibile.\n\nComunque, il doppiatore è un mostro, è bravissimo. ","replies":[{"poster":"INAZUMA 33","date":"2015-07-12T12:57:04.591+0000","up_votes":1,"down_votes":0,"body":"Kung fu gay ftw!","replies":[]}]},{"poster":"SideshowEMS","date":"2015-07-11T22:37:35.106+0000","up_votes":3,"down_votes":0,"body":"\" Userò i loro intestini come reggicalze ! \"\nDafuq ? GP mi stai nascondendo qualcosa ?","replies":[{"poster":"Riot DanielSAN","date":"2015-07-13T18:16:46.104+0000","up_votes":2,"down_votes":1,"body":"I reggicalze maschili esistevano in passato, e sono ancora usati oggi (molto raramente) da persone estremamente eleganti e attente ai dettagli:\n\n\nhttp://www.pfgstyle.com/wp-content/uploads/2013/09/io1.jpg\n\n\nCome lo è anche la spilla al coletto della camicia:\n\nhttp://camiciaecravatta.com/wp-content/uploads/2013/02/spilla-per-colletto-2.jpg","replies":[{"poster":"SideshowEMS","date":"2015-07-13T18:29:30.380+0000","up_votes":1,"down_votes":0,"body":"Lo so, ma appena gli ho sentito pronunciare quella frase, l'immagine che si è formata nella mia testa è stata un'altra !","replies":[]}]},{"poster":"Firenheit","date":"2015-07-11T22:47:27.432+0000","up_votes":1,"down_votes":0,"body":"Che perversioni ha.","replies":[{"poster":"Tr0nt0n","date":"2015-07-12T07:44:20.198+0000","up_votes":1,"down_votes":1,"body":"Ha dei gusti molto.... peculiari.\n-50 Sfumature di Arance.","replies":[]}]}]},{"poster":"Firenheit","date":"2015-07-11T22:45:53.288+0000","up_votes":1,"down_votes":0,"body":"Non è malissimo, ma dovrebbe essere più bassa e grottesca secondo me. Sembra Spugna di Peter Pan.\nL'attuale voice over di Gang è migliore sotto ogni punto di vista...\nSe posso approfittare, posso dissentire sul doppiaggio italiano di Azir? Lo trovo veramente pessimo, a livello di voce intendo...\n\nAttuale: https://www.youtube.com/watch?v=deS5bt4kmVo\nNuovo: https://www.youtube.com/watch?v=sJ4y-c9y77w\n\n","replies":[{"poster":"Giovarco","date":"2015-07-11T22:47:35.879+0000","up_votes":1,"down_votes":0,"body":"Sicuramente. La voce di adesso sembra quella di Turtleman.\n\nComunque, il doppiaggio di Azir è diverso da quello inglese, ma alla fine non è malaccio. Ci si fa l'abitudine.","replies":[{"poster":"Firenheit","date":"2015-07-11T22:50:07.773+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=H9NzS-cqcTs\nhttps://www.youtube.com/watch?v=ZLodLmAOOy8\n\nMa è troppo diversa, anche l'effetto usato, mentre quello inglese è quasi cruento, qualcosa di cupo e mistico, quello italiano è senza sentimento. \nNon voglio criticare troppo il doppiatore, ma più enfasi e cattiveria la vorrei. Come in inglese.\n\n---\nTornando a Gang, la voce inglese è molto buona.\nhttps://www.youtube.com/watch?v=IsqFHF796vs\n\nIo Gang me lo immagino pari pari a Barbanera. La voce dev'essere bassa, virile.","replies":[{"poster":"Giovarco","date":"2015-07-11T22:57:53.968+0000","up_votes":1,"down_votes":0,"body":"Lasciando stare Azir, mi viene da piangere a sentire questa voce. Spero che DanielSAN si faccia vivo.","replies":[{"poster":"INAZUMA 33","date":"2015-07-12T07:18:23.528+0000","up_votes":1,"down_votes":1,"body":"Questo succede quando un'unica persona ha tutto sto potere decisionale! Che culo non dover render conto a nessuno!","replies":[{"poster":"Tr0nt0n","date":"2015-07-12T07:36:55.579+0000","up_votes":2,"down_votes":0,"body":"Ma che davvero credi che in Riot ci sia solo una persona a decidere tutto? Se non sbaglio c'è anche Riot MizarPrimus da qualche parte e sicuramente molti altri Rioter.","replies":[{"poster":"INAZUMA 33","date":"2015-07-12T08:26:22.380+0000","up_votes":1,"down_votes":1,"body":"Ciascuno ha il proprio compito, non é che se io sono capo marketing vengo a dire a te Responsabile Personale come svolgere il tuo lavoro no? O magari sbaglio io che non conosco i loro ruoli quindi mea culpa e scusa la mia \"aggressività\"(?)","replies":[{"poster":"Riot DanielSAN","date":"2015-07-13T18:12:46.305+0000","up_votes":2,"down_votes":0,"body":"Le voci vengono proposte da tutti i rioter italiani che sono interessati alla cosa, ma alla fine quello che decide, basandosi sulle varie opinioni e su consiglio dello studio di doppiaggio, sono io. Quindi venite a menare me !","replies":[]}]}]}]},{"poster":"Firenheit","date":"2015-07-11T23:02:07.827+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=8iRMxyqhe1U #pernondimenticare\nahah\n\n","replies":[]}]}]}]},{"poster":"Xehanört","date":"2015-07-13T00:44:59.771+0000","up_votes":2,"down_votes":1,"body":"E' dalla release (quasi un anno?) che dico che il doppiaggio di Azir è orribile rispetto all'inglese. Credo sia uno dei pochissimi champ, se non l'unico, che trovo migliore in inglese piuttosto che in italiano... Ogni volta che sento quel \"soldati, avanti\" mi viene da ridere. Al prossimo sondaggio sarà il primo che voterò, imho.","replies":[{"poster":"Firenheit","date":"2015-07-13T01:26:24.416+0000","up_votes":1,"down_votes":1,"body":"Concordo","replies":[]}]}]},{"poster":"IlTu0Dio","date":"2015-07-13T15:58:14.749+0000","up_votes":1,"down_votes":0,"body":"a me personalmente non piace perchè non mi da l'idea nè di un pirata nè di un marinaio","replies":[{"poster":"Giovarco","date":"2015-07-13T18:09:54.384+0000","up_votes":1,"down_votes":0,"body":"Non problema non è GP, ma il suo doppiaggio, secondo me, che ti da questa sensazione.","replies":[{"poster":"IlTu0Dio","date":"2015-07-13T20:05:57.048+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Giovarco,realm=EUW,application-id=PqgdRhzF,discussion-id=yYKolcvV,comment-id=00080000,timestamp=2015-07-13T18:09:54.384+0000)\n>\n> Non problema non è GP, ma il suo doppiaggio, secondo me, che ti da questa sensazione.\nEsatto è quello che intedevo lo spash art è molto bello cosi come il champ in game ma quel doppiaggio sinceramente a me sa di niente.La stessa voce che potrebbe avere il kebbabaro sotto casa.","replies":[]}]}]},{"poster":"ubercodlegend200","date":"2015-07-12T10:23:06.414+0000","up_votes":1,"down_votes":0,"body":"niente barbossa :,(\n\n\nil doppiaggio però è fatto molto bene","replies":[]},{"poster":"Tr0nt0n","date":"2015-07-12T07:36:28.771+0000","up_votes":1,"down_votes":0,"body":"A me a volte ricorda il doppiatore di {{champion:80}} a volte il doppiatore di {{champion:119}}  bho. Però c'è da dire che in fondo è carina!","replies":[]},{"poster":"INAZUMA 33","date":"2015-07-12T07:14:58.183+0000","up_votes":1,"down_votes":0,"body":"Ma daii é lo stesso che doppiò l'ispettore gadget haha, personalmente, credo, che Pannofino su GP sarebbe stato una chicca!","replies":[]},{"poster":"Pizz Uh Jin","date":"2015-07-11T23:01:12.624+0000","up_votes":1,"down_votes":0,"body":"E' vero che non è molto piratesca, ma non è così male per me. E poi mi ha fatto ricordare Imperium: le Guerre Puniche :') (è la stessa voce di Annibale in quel gioco).","replies":[]}]}