{"poster":"XExiliadoX","date":"2017-11-16T06:17:59.429+0000","title":"Duda existencial!!!","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Siguen saliendo aspectos en cofres?{{sticker:sg-ahri-1}}","replies":[{"poster":"2801","date":"2017-11-16T12:09:23.769+0000","up_votes":1,"down_votes":0,"body":"''Duda existencial''\nEsa duda la tienes de recién, es simplemente un titulo llamativo, porque eso de las skin es nuevo desde el 8 de noviembre xD.","replies":[{"poster":"XExiliadoX","date":"2017-11-16T19:13:04.308+0000","up_votes":1,"down_votes":0,"body":"eso te llevo a responder rapido jaja , pero que onda no salen mas o si ? , nadie me responde {{sticker:sg-zephyr}}","replies":[{"poster":"Fiora Freebola","date":"2017-11-16T20:13:07.293+0000","up_votes":1,"down_votes":0,"body":"Si tienes esa duda, la verdad es que siguen saliendo.\n\nPero imagínalo de la siguiente forma:\n\n1. - Antes de los gestos, solamente habían 5 probabilidades. Éstas eran: Aspecto - Campeón - Ícono - Caja y Llave - Gema.\n\nAhora supone lo siguiente, sacar un Aspecto era mucho más fácil que sacar una Gema, obviamente todos saben eso.\nYa, ahora incluye OTRA probabilidad... Los gestos. Son 6 probabilidades...\n\nLo que significa que: \n- En una cajita hay una probabilidad (desconocida matemáticamente) de 1/6 de que saques un Aspecto. Lo que significa que es posible que hayas tenido tanta mala suerte, que de 6 cajas que abriste (o pudiste haber abierto, es un ejemplo) en ningúna hayas obtenido aspectos.\n\nLas probabilidades de obtener gestos, son altas por experiencia propia, creo que casi tan altas como sacar una caja y llave extra. Pero es algo que no podemos controlar. Lo único que aprendí de haber abierto esas 20 cajas, es que no voy a volver a gastar RP en cajas hextech normales. Solo en especiales, como la cápsula épica que te daba sí o sí 3 aspectos y uno era Épico.\n\nEso es todo lo que puedo decirte...\n\nMejor suerte para la próxima camarada,\n\nGLHF","replies":[]}]}]},{"poster":"Fiora Freebola","date":"2017-11-16T06:30:54.598+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-miss-fortune}} \n\nAjaj pa k kieres saber eso saludos.\n\nTe cuento mi triste historia, ayer abrí 20 cofres Hextech, y me salieron 6 gestos, y el de Taric se repitió. Y no, no me salió ninguna skin legendaria ni menos definitiva.\n\nPero todo se basa en la probabilidad (Excepto con los gestos, esos te salen sí o sí cada dos cajitas :'v)...\n\nSaludos coleguita,\n\nGLHF","replies":[{"poster":"XExiliadoX","date":"2017-11-16T07:16:12.663+0000","up_votes":1,"down_votes":0,"body":"Jajaja gracias por responder , como vengo abriendo cofres solo me toco puro campeon :C\n{{sticker:zombie-brand-facepalm}}","replies":[]}]}]}