{"poster":"låan","date":"2016-03-26T04:55:18.091+0000","title":"Fragmentos de llave","subforum":"Charlas Generales","up_votes":16,"down_votes":2,"body":"¿No se podría subir el porcentaje de probabilidades de que te salga un fragmento de llave?\nHonestamente, se hace  bastante pesado conseguirlos, puesto que de 5 games ganados solo en 1 se me ha dado un fragmento, independientemente del kda que yo tenga, no varía el resultado.\nLlega a ser frustrante tener cajas y no poder abrirlas por el tan bajo % que tienen los fragmentos.","replies":[{"poster":"låan","date":"2016-03-26T21:50:43.923+0000","up_votes":5,"down_votes":1,"body":"Teniendo en cuenta y basándonos en mi experiencia personal. Ganar 5 partidas para ganar un fragmento de llave es un poco excesivo, puesto que para ganar 1 fragmento, harían falta 5 partidas de las cuales no todo el mundo tiene tiempo para jugar. A ello le sumamos que no todas las partidas que jueguen las van a ganar, esto implicaría lo siguiente; jugar 10 partidas aproximadamente, con un 50% de win ratio. Y teniendo en cuenta que para hacer una llave necesitaríamos 3 fragmentos. Esto nos llevaría a una media de partidas de 20 respectivamente ( por no poner 30 ya que consideraría un número bastante exagerado y considerando que yo tuve mala suerte en las 5 partidas que jugué).\nSí, para mi es excesivo, a pesar de tener bastante tiempo libre el cual invierto en jugar LoL.\nContinuemos con que después de todas estas partidas, hay probabilidades bastante altas también de que nos salgan iconos, campeones, wards, gemas y por último skins.\n¿A qué me refiero con este ultimo párrafo?\nBien, pues es una respuesta para todos aquellos que comentaron este post que este sistema de verdad tiene que ser así de difícil y dando por hecho que cada cofre que abras con los 3 fragmentos de llave automáticamente y 100% sea un fragmento de aspecto.\n\nPor favor, tengan en cuenta que esto es una experiencia propia, por lo tanto no espero que a todos ustedes les tome lo mismo que a mi conseguir fragmentos de llave, y como menciono arriba, lo tomo como mala suerte y de ahí el sentido de este post.","replies":[{"poster":"Jeremías 17 5","date":"2016-03-27T04:39:30.353+0000","up_votes":2,"down_votes":0,"body":"El problema es que riot quiere ganar dinero hasta con lo mas mínimo... Podrían haber puesto las llaves con PI, total, el maximo de cofres ganados sera de 4 y si queres mas tendrás que comprar. También podrían haber puesto un ratio de fragmentos mayor... Pero bueno, es Rito, después te dan un server con lag...","replies":[{"poster":"låan","date":"2016-03-27T05:21:57.969+0000","up_votes":1,"down_votes":1,"body":"No se trata de que quiera ganar dinero, sino no habrían puesto la Artesanía Hextech, una forma de conseguir skins a base de jugar y jugar.\nEl objetivo de este post es que se tenga en cuenta la opinión de los usuarios acerca de la probabilidad que hay de que salga un fragmento de llave, nada relacionado con el lag, la plata y un largo etcétera.","replies":[{"poster":"Jeremías 17 5","date":"2016-03-27T06:02:08.286+0000","up_votes":2,"down_votes":1,"body":"Recién termine una partida con Shen, con una S y nada... Y si, rito puso esa probabilidad de mierda para que la gente compre las llaves... Negocio... No seas ingenuo.","replies":[]},{"poster":"Starhunter","date":"2016-04-03T00:33:43.956+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=llIIllII,realm=LAS,application-id=v7qsfXsE,discussion-id=AsTAoA94,comment-id=000b00000000,timestamp=2016-03-27T05:21:57.969+0000)\n>\n> No se trata de que quiera ganar dinero, sino no habrían puesto la Artesanía Hextech, una forma de conseguir skins a base de jugar y jugar.\n> El objetivo de este post es que se tenga en cuenta la opinión de los usuarios acerca de la probabilidad que hay de que salga un fragmento de llave, nada relacionado con el lag, la plata y un largo etcétera.\n\n\"No se trata de que riot quiera ganar dinero\"  ah bueno mira que lei boludeces pero ya se pasan algunos, ahora riot es de la cruz roja.....","replies":[{"poster":"låan","date":"2016-04-03T22:02:01.965+0000","up_votes":1,"down_votes":0,"body":"¿Falta de comprensión lectora hermano? Lo que ponés esta totalmente sacado de contexto, a lo que voy es que se nombró un tema que no tenía nada que ver con el texto en cuestión y por ello mi respuesta, por favor. Abstenete de comentar un post de hace 1 semana casi, donde no lo va a leer nadie exceptuando yo, que soy el creador del post.\nRe leete lo que escribiste y vemos quién leyó una boludez y quien no.","replies":[]}]}]}]}]},{"poster":"Puertexcino","date":"2016-03-26T14:08:55.029+0000","up_votes":1,"down_votes":6,"body":"tengo entendido y creo que es verdad que si sacas triple kill en una partida te dan un fragemneto puesto a que he jugado 2 partidas seguidas y em ambas he sacado una triple y siempre al final me da un fragmento de llave pero solo a mi no al equipo","replies":[{"poster":"Elyasviel","date":"2016-03-26T17:08:37.919+0000","up_votes":2,"down_votes":0,"body":"No tiene absolutamente nada que ver.","replies":[{"poster":"Snip3rKill3r","date":"2016-03-26T22:24:31.100+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Elyasviel1,realm=LAS,application-id=v7qsfXsE,discussion-id=AsTAoA94,comment-id=00050000,timestamp=2016-03-26T17:08:37.919+0000)\n>\n> No tiene absolutamente nada que ver.\n\nSaque Penta con S+ en dos seguidas y nada ¬¬","replies":[{"poster":"Jeremías 17 5","date":"2016-03-27T04:35:47.495+0000","up_votes":3,"down_votes":0,"body":"Solo sirve con las triple (?","replies":[]}]}]}]},{"poster":"BeamOeste","date":"2016-03-26T05:10:48.291+0000","up_votes":2,"down_votes":1,"body":"Pensa que si seria facil  a las pocas horas tendras una skin, por algo esta la tienda que venden cajas y llaves entendes? riot no pone la artesania hextech para que tengamos skins faciles.. la idea es que gastando 125rp compras una llave , entonces para acelerar el asunto la gente compra rp\nPero si no te importa jugar 20 partidas y que te salga 1 llave  entonces dale para adelante","replies":[{"poster":"Migoth","date":"2016-03-26T09:37:39.232+0000","up_votes":3,"down_votes":0,"body":"Es verdad, una skin practicamente, no se consigue en unas partidas, es algo que cuesta dinero. Y si subirian el % de la probabilidades que salgan llaves, estarían regalando dinero, ¿no lo creés?","replies":[]}]},{"poster":"Camatta","date":"2016-03-26T23:41:16.272+0000","up_votes":2,"down_votes":0,"body":"5 cada 1 , todos me dicen l omismo pero yo llevo jugando como 20 partidas y me solo 1 me salio.","replies":[]},{"poster":"lordeman10","date":"2016-03-26T22:08:08.394+0000","up_votes":3,"down_votes":1,"body":"igual que se yo, es el primer día y todos quieren tener a ezreal pulso de fuego\n\nno, la idea de esto es que sea permanente y que digas wow me gane una llave si ponen que te salga una llave cada dos partidas en diciembre vas a tener 300 llaves de sobra\n\nel que no tiene tiempo a jugar puede optar por comprarlas con RP de todos modos no es como los cofres que te tenés que apurar para sacar 1 por semana las llaves las sacás cuando querés","replies":[]},{"poster":"Doubl3Jump","date":"2016-03-27T15:09:36.631+0000","up_votes":2,"down_votes":1,"body":"No entiendo porque todos se quejan del %, es decir, nosotros jugamos para entretenernos y divertirnos, no solo por la recompensa. Si nos ponemos a pensar están dándonos recompensas solo por jugar partidas, solo por jugar a un juego que nos encanta.\n\nBueno, esa es mi opinión.","replies":[]},{"poster":"Yrox the Third","date":"2016-03-26T05:00:50.614+0000","up_votes":2,"down_votes":1,"body":"La idea es que sea difícil de conseguir.","replies":[]},{"poster":"Sir Owen","date":"2016-04-21T20:05:30.298+0000","up_votes":1,"down_votes":0,"body":"yo voy jugando mas de 50 partidas gane 37 partidas con A y S y no me dieron nada !! solo cofres ! a mi novia sacando B le dieron fragmentos !! puede ser que se bugeen las cuentas o algo parecido ? {{summoner:1}}","replies":[{"poster":"Khamet","date":"2016-04-23T21:35:53.998+0000","up_votes":1,"down_votes":0,"body":"Me pasa lo mismo :( ya me olvidé cuando fue la ultima vez que saque un fragmento{{item:3151}}","replies":[]}]},{"poster":"Dreyco","date":"2016-04-11T17:20:08.030+0000","up_votes":1,"down_votes":0,"body":"yo creo que hace unas semana que no me dan un fragmento de llave y juego diariamente entre 3 o 8 partidas. en conclusion no puede ser que no dropeen aunque este muy bajo el % ¿estara desactivado?","replies":[]},{"poster":"Starhunter","date":"2016-04-08T16:52:05.123+0000","up_votes":1,"down_votes":0,"body":"El tema es asi:\n                             Riot establecio este sistema para captar el interes de los jugadores haciendoles creer que conseguirian muchas skins solo jugando, una vez que lograron entusiasmar a los jugadores pjusieron en venta con rp llaves y cofres. Extrañamente cada vez es mas dificil que salgan fragmentos de llave que coincidencia no?, Aparece la promocion para comprar llaves y cofres justo cuando cada vez es mas dificil que salgan dichos cofres y fragmentos.\n                             Esto es muy simple, riot es una empresa y quiere facturar y no es que este mal, lo malo es que algunos piensen que riot es la madre teresa y piense en el bienestar del jugador de manera desinteresada, no sean tan inocentes, estamos hablando de un server que estuvo 6 meses con caidas y lag de 220ms, tengan memoria sean mas vivos...","replies":[]},{"poster":"95DarkFlameMaste","date":"2016-04-02T15:48:30.581+0000","up_votes":1,"down_votes":0,"body":"yo estoy jugando desde el domingo 27/3 y no me dieron ni un mísero fragmento de llave.\n{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"BlackEyes","date":"2016-03-30T04:47:13.198+0000","up_votes":1,"down_votes":0,"body":"hoy eh jugado 6 partidas, 5 ganadas, en todas han habido S y en las ultimas 2 fuimos 5 premades y 3 S como resultado en ambas partidas, en 3 de las wins yo fui una de las S.\n\ntotal de fragmentos? 0   Ultimo fragmento?  hace por lo menos 15 partidas (9wins).\n\nHay limites de fragmentos por campeon? algun requisito extra?.. ya no se me ocurre que hacer para conseguir fragmentos.","replies":[]},{"poster":"Snip3rKill3r","date":"2016-03-26T23:23:30.396+0000","up_votes":1,"down_votes":0,"body":"a la mierda con el %, es un chiste? \n\nhttp://i.imgur.com/oCvosmu.jpg 3S+ (incluido yo) y no hay llave. (Los 5 eramos premade)\n\nhttp://i.imgur.com/fSEM2Gt.png - Mi historial, en ninguna de esas saqué llave. Todas son S o S+ Excepto el de jinx. (Sumenle la de la primera foto que no figura)\n\nAun sigo esperando la 3er llave... (Las primeras 2 llaves me cayeron como si nada en 4 games..)","replies":[]},{"poster":"Cacanello","date":"2016-03-26T21:47:48.252+0000","up_votes":1,"down_votes":0,"body":"Actualmente tengo dos fragmentos que me salieron a lo largo de 5 o 7 partidas. Solo me falta un fragmento y ya jugue 5 partidas (ganadas) y nada.","replies":[]},{"poster":"Revivax","date":"2016-03-26T21:47:32.574+0000","up_votes":1,"down_votes":0,"body":"yo de 3 partidas que he ganado me han dado 2 :P","replies":[]},{"poster":"Glorfindel esdla","date":"2016-03-26T20:51:11.258+0000","up_votes":1,"down_votes":0,"body":"jugaste 5 y sacaste 1 fragmento, esta bien, considerando que el limite de cofres mensuales es 4 y no hay limite de llaves si en vez de jugar 1 dia y quejarte jugas todo el mes al final vas a poder abrir los 4 cofres, Salu2\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Rolando Magic","date":"2016-03-26T17:55:17.590+0000","up_votes":1,"down_votes":0,"body":"La verdad que cuesta bastante y sumado a que es un fragmento eso implica muuuuuuuchas partidas para una única llave lo cual no entiendo porque ni siquiera es la llave entera lo que cuesta tanto, por un fragmento me parece mucho, aunque seguro lo van a ajustar la probabilidad porque están testeando todavía","replies":[]},{"poster":"Teckmoh","date":"2016-03-26T06:44:00.837+0000","up_votes":1,"down_votes":3,"body":"Asi? Porque yo hoy dia me saque una skin de Ward bien bonita y ha Shyvana de campeonato :o .","replies":[{"poster":"iFunkyPunch","date":"2016-03-26T13:10:24.993+0000","up_votes":1,"down_votes":0,"body":"Permíteme vender esa H y comprarte el diccionario.","replies":[]},{"poster":"Elyasviel","date":"2016-03-26T17:09:15.882+0000","up_votes":1,"down_votes":0,"body":"Ah sí?* a * ... \nTeemo sálvanos de ésta ortografía.","replies":[]}]},{"poster":"Exor Might","date":"2016-03-26T20:00:46.745+0000","up_votes":1,"down_votes":1,"body":"jugué 3 partidas (las gane), en 2 partidas tuve S y me dieron fragmentos y en la otra nada, creo que hay mas probabilidad de que te den fragmento si sacas S\n\n\n{{champion:112}} {{item:3116}} {{item:3198}}","replies":[]},{"poster":"Jherico","date":"2016-03-26T06:58:22.433+0000","up_votes":1,"down_votes":1,"body":"yo juegue 4 partidas  seguidas en una saque cofre en la otra perdi y en las dos ultimas seguidas saque fragmento de llave y eso que juego support","replies":[]},{"poster":"Kyousuke","date":"2016-03-26T05:00:50.839+0000","up_votes":1,"down_votes":1,"body":"de poder se puede pero no lo harán XD la gracia es que cueste y decidan pagar por las llaves. lo mejor es que ignores las llaves y solo juegues cuando te quieras dar cuenta vas a conseguir una llave.\n\nyo jugué hoy y en 4 partidas arme una llave pero ahora jugué 3 y no me salio nada XD","replies":[]}]}