{"poster":"Stailuz","date":"2018-03-11T20:56:50.079+0000","title":"¿Carreas y no te dan honor?","subforum":"Charlas Generales","up_votes":2,"down_votes":7,"body":"Lo del t&iacute;tulo, hace un rato jugu&eacute; una partida con olaf, la cosa es que el singed del otro team no se si era troll, no lo sabia usar o que pero la cosa es que me fedee gracias a el, despu&eacute;s empec&eacute; ya a moverme de top, callear objetivos, ayudar a romper torres, iniciar tf que generalmente sal&iacute;an worth, y termina la partida y no me dan honor, tampoco es algo que hago todos los d&iacute;as ni me importe, porque no soy nunca el que carrea pero al menos la vez que lo hago me gustar&iacute;a sentirme &quot;valorado&quot; &iquest;Se podr&iacute;a decir?","replies":[{"poster":"Hiei ValianT","date":"2018-03-11T21:05:49.668+0000","up_votes":2,"down_votes":1,"body":"yo e sido el mvp de mi team un monton de veces.\ne salido en la jg 18/0/10 con todos los drakes a mi favor.\npero nada . al final la gente le da honor a quien quiere no mas . por buena onda. \ny si eres el mejor del team en general no todos. les molesta eso . y no te dan honor.\nojala vuelva el rival honorable. por que ahora solo se farmea honor por simpatia.","replies":[{"poster":"Stailuz","date":"2018-03-11T21:11:04.079+0000","up_votes":1,"down_votes":0,"body":"Yo depende, doy honor al que se lo merece, en esa partida fue a kaisa, en la partida anterior que jugué con nasus, fue al noc porque se canso de gankearme, o que se yo, siempre le doy honor al que más cosas hace o más me ayuda, ya cuando perdemos empiezo a ver pero generalmente no le doy honor a nadie a no ser que lo tenga bien merecido.","replies":[]}]},{"poster":"TheFalcon85","date":"2018-03-11T21:44:01.405+0000","up_votes":1,"down_votes":0,"body":"mi amigo, con todo respeto esto es un foro, no es un lugar de quejas :P agrega a amigos a tus compañeros que no te dan honor y preguntales porque, saludos y suerte en tus proximas partidas!","replies":[{"poster":"Stailuz","date":"2018-03-11T21:49:16.263+0000","up_votes":1,"down_votes":0,"body":"Y... ¿Donde me estaría quejando? Yo solo dije lo que me paso en una partida hoy. Por otro lado, es un foro, hay libre expresión y puedo escribir lo que quiero, cuando quiero y donde quiero, si no te gusta y lo único que vas a venir a decir es \"no es lugar para quejarse\" y demás cosas que no tienen sentido, es preferible que no digas nada.","replies":[{"poster":"TheFalcon85","date":"2018-03-16T22:30:06.650+0000","up_votes":1,"down_votes":0,"body":"flaco, te lo dije bien, te lo dije, bien y vos me respones mal, tenes razon, sabes porque? porque miles de personas piensan igual que vos, y por eso viven haciendo crypost como vos, me pierdo un monton de posteos que realmente valen la pena por gente como vos que viene a llorar porque carreas en bronze y no te dan honores, gente que apenas sabe que en el lol se puede caminar, asique como te dije, si te vas a quejar este no es tu lugar, anda a soporte a reclamar, GRACIAS. si te dignas a responderme, respondeme bien y yo te contesto bien, no vallas a hacer otro crypost porque alguien te contesto mal eh.","replies":[]}]}]},{"poster":"bombastico","date":"2018-03-11T21:47:03.727+0000","up_votes":1,"down_votes":0,"body":"El honor es para el que fue buena onda durante la partida, se robo el baron o el dragon, no flameo y/o a pesar del flameo intenso conservo la calma o para aquel que por una jugada decidio la partida. \n\nSiempre alguien carreara una partida, pero lo que expuse anteriormente es mas raro de encontrar.","replies":[{"poster":"Stailuz","date":"2018-03-11T21:51:33.082+0000","up_votes":1,"down_votes":0,"body":"Hay uno que es de \"decisiones\" y justamente se trata del calleo de objetivos.","replies":[{"poster":"bombastico","date":"2018-03-12T00:38:17.421+0000","up_votes":1,"down_votes":0,"body":"La verdad no lo especifican, para mí el de \"decisiones\" es para alguien que forzó una tf en el momento oportuno, se robo un objetivo o realizó un backdoor exitoso, el \"callear\" que entiendo es el de señalar objetivos (y si no es eso me disculpo) no es suficiente.","replies":[]}]}]},{"poster":"xaxesis","date":"2018-03-11T21:54:00.974+0000","up_votes":1,"down_votes":0,"body":"el honor es por el disfrute de jugar con alguien no porque sea mejor o peor que alguien varias veces partidas perdidas que dan honor a alguien por las intenciones continuas de esforzarse\n\ny es vergonzoso pedir honor abiertamente en foro","replies":[]},{"poster":"Tortuguita","date":"2018-03-11T21:22:43.713+0000","up_votes":1,"down_votes":0,"body":"Me parece que el honor tiene merito al ser difícil de conseguir por que debes ser absolutamente excelente y no solo carrear las partidas. Literalmente salgo 12/3 muchas partidas y las gano pero por ello no me siento merecedor de ningún honor  por que sé que desde ya este sistema solo quiere incentivar a la actitud deportiva y en mi caso los incentivos me parecen irrelevantes.\n\nEsto debes tener en la cabeza cuando te relacionas con el sistema de honor : Debo ser honorable,no por las recompensas o por que quiero ser reconocido, sino por ser mejor contrincante para mi y para con el enemigo.","replies":[{"poster":"Stailuz","date":"2018-03-11T21:44:02.546+0000","up_votes":1,"down_votes":0,"body":"Osea que callear objetivos, llevar tu ventaja a las otras líneas, tirar torres, divear, comerse el daño, pasar entre 3 enemigos para buscarles el carry, etc. ¿No tiene mérito?","replies":[{"poster":"Tortuguita","date":"2018-03-11T21:48:16.601+0000","up_votes":1,"down_votes":0,"body":"Tiene merito obviamente pero es personal.Al decir \"Sentirme valorado\" no es en absoluto lo que el honor quiere transmitir. No debes buscar el honor luego de hacerte la partida del clip de twitch solo debes sentirte alegre de poder haber realizado esa jugada , el buscar la gloria o hasta \"exigirla\" como algunos lo hacen luego de terminar la partida y terminar 12/4 me parece que no es a lo que va el sistema.\n\nLo que importa del honor no se centra solamente en que lo hagas excepcional sino que ademas debes tener actitudes positivas de forma natural y no que al terminar la partida piensas \"uff , lo hago tambien y deberia tener honor\" Ese no es el punto.","replies":[]}]}]},{"poster":"Katastrofica","date":"2018-03-11T21:24:13.761+0000","up_votes":1,"down_votes":0,"body":"Diría que al menos el 30% de los jugadores, no da honor.\n\nA partir de ahí, el 50% de los que dan, le dan honor al que les cayo bien, un 25% a su premade y el resto si le da el honor al carry.\n\nFuente: Link expirado, pero es 100% confirmado HD4k , confia en mi, soy main estadisitcas.","replies":[]}]}