{"poster":"Chaosphilip","date":"2017-09-23T18:44:05.171+0000","title":"Ist Fiora die einzige Lösung gegen Tanks?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Fiora wurde in den letzten zwei Patches (23.9.17) gebufft um die Tanks wieder zur&uuml;ckzuschlagen, aber ist Fiora die einzige Antwort gegen Tanks? Ich finde Riot sollte andere Tankschreder wie{{champion:41}} {{champion:6}}  buffen und nicht Fiora","replies":[{"poster":"SCG Nicolaion","date":"2017-09-24T00:16:25.313+0000","up_votes":2,"down_votes":0,"body":"Nicht vergessen {{champion:48}} ist zwar atm nicht mehr so in der Meta, schredert aber immer noch jeden Tank im 1v1 und im TF","replies":[]},{"poster":"Oriius","date":"2017-09-24T05:26:00.353+0000","up_votes":1,"down_votes":0,"body":"gegen tanks gibts genug alternativen als fiora zu spielen. sei es vayne quinn oder tryndamere. urgot ist halbwegs selber n tank und macht ab dem midgame auch genügend schaden.\n\nIrelia zerschreddert jeden tank und olaf ebenso.\n\n{{champion:80}} {{champion:92}} {{champion:27}} {{champion:48}} {{champion:8}} {{champion:157}} \n\nalles easy tankschreddern  gibt also genug alternativen auch auf der toplane :)","replies":[{"poster":"ƒäker","date":"2017-09-26T07:58:03.057+0000","up_votes":1,"down_votes":0,"body":"Viel erfolg dabei mit einem Yasuo oder Pantheon gegen einen Tank Malphite mit Omen und Dornenpanzer ein 1v1 zu machen","replies":[{"poster":"BlackAjani","date":"2017-09-26T14:56:22.699+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=King Balu,realm=EUW,application-id=Wj1wcocU,discussion-id=kHAVhJUs,comment-id=00050000,timestamp=2017-09-26T07:58:03.057+0000)\n>\n> Viel erfolg dabei mit einem Yasuo oder Pantheon gegen einen Tank Malphite mit Omen und Dornenpanzer ein 1v1 zu machen\n\nWeil jeder Malphite von beginn an einen Dornenpanzer als Unterwäsche trägt!\n{{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"Hmto AkA Oliver","date":"2017-09-24T04:02:40.142+0000","up_votes":1,"down_votes":0,"body":"Es gibt im Augenblick recht viele Stärken gegen Tanks, zumal es im aktuellen Meta eben weniger um die Tanks geht, als viel mehr um die Botlane und den Jungle und dort findest du größtenteils keine Tanks, sondern eben viel DMG und Utility. \n\nAber um Dir mal jemanden zu sagen, der recht gut gegen Tanks ist und im Augenblick super op ist: {{champion:96}} , {{champion:498}} , {{champion:29}} , {{champion:222}} \n\nAlles Picks die mit einem Ardent Supporter in der Regel kein Problem sind. Gerade Kog´Maw schreddert eigentlich jeden Tank kurz und klein.","replies":[{"poster":"D4RKEVA","date":"2017-09-25T05:46:28.526+0000","up_votes":1,"down_votes":0,"body":"Ahh\n\nBot lane stimmt, jedoch sind tanks zurzeit trotz allem viel vertreten und das auch im jungle(rammus/seju und gragas in den besten junglern)","replies":[]}]},{"poster":"Allerbester Biss","date":"2017-09-24T09:44:35.784+0000","up_votes":1,"down_votes":0,"body":"Ich weiß nicht ob Dia hob was von Adcs gehört hast, die sollen aber mit ardent ziemlich egfektiv gegen Tanks sein.","replies":[]},{"poster":"mondmann97","date":"2017-09-23T22:55:18.413+0000","up_votes":1,"down_votes":0,"body":"Urgot ist gegen Tanks stark genug! Wenn er noch stärker wäre, würde man als Tank die lane ja automatisch verlieren...\nFiora ist zudem immernoch extremst stark gegen Tank, nur gegen andere Champions ist sie nicht mehr ganz so stark wie vor den ganzen nerfs.\n\n\nAm besten gegen Tanks sind Weitkampfchampions mit Mobilität. \n{{champion:85}} {{champion:17}} {{champion:150}} {{champion:126}} {{champion:10}} {{champion:6}} \n\nGegen Tanks dominieren Toplane die meisten Chamions, jedoch verlieren sie das Spiel da der Tank einen größeren Einfluss auf TFs hat, besonders da Hypercarrys zZ Meta sind. Also entweder du spielst einen Splitpush Champion oder einen Champion der im Lategame/oder TF besser als der gegnerische Tank ist.","replies":[]},{"poster":"Schesam","date":"2017-09-23T20:18:13.737+0000","up_votes":1,"down_votes":0,"body":"Fiora wurde nich gebuffed - nur die letzten Nerfs rückgängig. UNd das tun sie doch, Vayne bekommt bald ein Rework! Urgot wurde auch erst etwas gebuffed","replies":[{"poster":"mondmann97","date":"2017-09-23T22:48:04.521+0000","up_votes":1,"down_votes":0,"body":"Vayne wird ein wenig angepasst, also die Ult und evtl. die Q. Das ist kein Rework.","replies":[]}]},{"poster":"Urogi","date":"2017-09-23T20:22:39.645+0000","up_votes":1,"down_votes":0,"body":"Die ganzen Black Cleaver Champs sind gegen Tanks auf der Toplane ziemlich stark, wie ich finde. {{champion:150}} {{champion:126}}","replies":[]}]}