{"poster":"3ofGot40ve","date":"2016-08-10T18:45:16.428+0000","title":"Can we ban new champions from being played in ranked untill a few days after their release?","subforum":"Gameplay","up_votes":179,"down_votes":26,"body":"Literally, as soon as Kled comes out, I have people trying to play him in ranked with no games on him in normal or even bots at all. You made it so people can&#039;t play free-to-play champs in ranked if they didn&#039;t own them, but Ide rather have that going then new champs in ranked because at least most of the community actually knows their kits.\r\n\r\nPlease?","replies":[{"poster":"Scary Door","date":"2016-08-10T18:52:54.964+0000","up_votes":42,"down_votes":3,"body":"This is suggested every time a new champ is released and I have to agree with it 100 percent!  I figure about a two week period would be acceptable prohibition from ranked for a newly released champion.  \n\n\"What about people that have played [champion x] on PBE?\"  is one common counter-argument, but that's such a niche group that I don't think it's worth the frustration of someone playing the new champ for the first time.  \n\n/upvoted /signed","replies":[{"poster":"Nautoday","date":"2016-08-10T18:57:59.945+0000","up_votes":6,"down_votes":25,"body":"Two weeks to play a new champ?\nSay Nautilus or Blitzcrank was the new champ of the week this week.\n\nYou think it takes two weeks for people to understand the kit?\nYou can fully learn what those champs do just by watching a short video, and your only thing to learn is to understand how far the hook/pull goes.\n\nIf any limitation as to when the champ could be played in ranked after release it should be one day (or two day max).","replies":[{"poster":"DrCyanide","date":"2016-08-10T20:21:28.290+0000","up_votes":17,"down_votes":1,"body":"1. Not a single champion released in the last two years has a kit as simple as Nasus or Blitzcrank\n2. When a new champion is released, everyone has to try them Top/Jungle/Mid/Support/ADC, as well as try AD/AP/AS/Tank/Crit builds on them. Those combos are particularly true if Blitz was new.\n3. Asking players to play the champion in Normals for a week after release is not the end of the world. They can watch what others are trying, see what works, and then go forward with it.","replies":[{"poster":"OrfinNoche","date":"2016-08-11T17:17:44.980+0000","up_votes":1,"down_votes":4,"body":"Ok for example, now we ask people to play new champs in normals for one week after their release. What next? We gonna ask riot to only let players play with those champs with whom they have at least a certain mastery level? This is absurd. It wont get us anywhere. People should have the freedom to chose whom to play unless of course they have been banned.","replies":[{"poster":"DrCyanide","date":"2016-08-11T17:30:25.515+0000","up_votes":3,"down_votes":0,"body":"A slippery slope argument doesn't hold water here.\n\nWith any other champion you can see what's been done, what's worked, what hasn't, look up guides, etc. It doesn't matter if it's your first time playing Azir, you still know you can summon a soldier, slide them, and while they're sliding you can move to them, getting yourself as far away as possible. You've seen it done enough you have an idea of how a champion should be played, regardless of if the execution is there or not. Enough players have smurfs that it's unreasonable to think that a Mastery requirement will be implemented, since a player can learn a champion on one account (or even one server) and play them just fine on a different account.\n\nWith a new champion you have *none* of that. There's nothing for you to base your play style off of, no past experience to fall back on, nothing. Spending 7 days (or less, depending on when you got them) figuring that stuff out in Normals is perfectly acceptable. No, I don't consider the mess that is the PBE to count for experience playing the champion, do it on live for 7 more days if you really think they're your new main.","replies":[]}]}]}]},{"poster":"Braum Mechanics","date":"2016-08-11T01:53:04.687+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Scary Door,realm=NA,application-id=3ErqAdtq,discussion-id=wEZphQAp,comment-id=0001,timestamp=2016-08-10T18:52:54.964+0000)\n>\n> This is suggested every time a new champ is released and I have to agree with it 100 percent!  I figure about a two week period would be acceptable prohibition from ranked for a newly released champion.  \n> \n> &quot;What about people that have played [champion x] on PBE?&quot;  is one common counter-argument, but that&#x27;s such a niche group that I don&#x27;t think it&#x27;s worth the frustration of someone playing the new champ for the first time.  \n> \n> /upvoted /signed\n\nLatest champ should not be allowed in ranked for atleast a month since his/her release.\n\nI remember when Aurelion Sol came out and everyone in ranked wanted to play him. If you banned him they would troll or become toxic. If you don't ban and they would pick them then they would feed.\n\nIf a month is too much then atleast till their IP price drops to 6300 or they have been a part of the free champ rotation so that people know how to play with him and against him.\n\nThis has been brought up every single time a new champ comes out but Riot for some reason chooses to ignore it.","replies":[{"poster":"warpenguin555","date":"2016-08-12T00:42:13.756+0000","up_votes":1,"down_votes":0,"body":"a month is a bit long, 1-2 weeks should suffice","replies":[]}]}]},{"poster":"420 grams","date":"2016-08-10T19:29:02.929+0000","up_votes":3,"down_votes":8,"body":"While I agree with what you're saying, I don't think it's something riot should have to fix rather than the players knowing that they shouldn't do that.","replies":[{"poster":"3ofGot40ve","date":"2016-08-10T19:33:30.416+0000","up_votes":10,"down_votes":1,"body":"> While I agree with what you're saying, I don't think it's something riot should have to fix rather than the players knowing that they shouldn't do that.\n\nLol, were talking about an online game here, you can't just expect people to ever abide to what you just suggested.","replies":[{"poster":"Keepe","date":"2016-08-10T21:02:51.868+0000","up_votes":5,"down_votes":0,"body":"WHAT? People should have COMMON SENSE?! SCEW THAT!\n\nSKARL! GET YER SCALY BACKSIDE OVER HERE.","replies":[]}]}]},{"poster":"blkKalameet","date":"2016-08-10T22:37:00.915+0000","up_votes":9,"down_votes":2,"body":"community -  \"riot please\" \n\nriot - \"no.......\" \n\ncommunity - ..... \n\nriot - ..... \n\ncommunity -  \"then we want mor-\" \n\nriot -  \"no more bans either!  3 bans for each team in a game with 120+ champs is strategic and fair.\"","replies":[{"poster":"Not xPeke","date":"2016-08-11T10:43:23.020+0000","up_votes":2,"down_votes":9,"body":"> [{quoted}](name=blkKalameet,realm=NA,application-id=3ErqAdtq,discussion-id=wEZphQAp,comment-id=0006,timestamp=2016-08-10T22:37:00.915+0000)\n>\n> community -  &quot;riot please&quot; \n> \n> riot - &quot;no.......&quot; \n> \n> community - ..... \n> \n> riot - ..... \n> \n> community -  &quot;then we want mor-&quot; \n> \n> riot -  &quot;no more bans either!  3 bans for each team in a game with 120+ champs is strategic and fair.&quot;\n\nYou'll never be satisfied, no matter how many bans Riot gives you. Wish people would stop crying their eyes out on \"only\" 3 bans x team.\n\nDo you even stop and think that if you were to add too many bans, certain champions could virtually get close to 0 playtime? ZERO. Not fair.","replies":[{"poster":"It Hertz When IP","date":"2016-08-11T13:11:56.282+0000","up_votes":4,"down_votes":2,"body":"Then we've identified the toxic/problem champions that no one likes seeing in game, and Riot has hard numbers showing which champs need nerfing/buffing/reworks the most.","replies":[{"poster":"Not xPeke","date":"2016-08-11T16:13:56.115+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Darien Juranas,realm=NA,application-id=3ErqAdtq,discussion-id=wEZphQAp,comment-id=000600000000,timestamp=2016-08-11T13:11:56.282+0000)\n>\n> Then we&#x27;ve identified the toxic/problem champions that no one likes seeing in game, and Riot has hard numbers showing which champs need nerfing/buffing/reworks the most.\n\nMate, so many champions are unhealthy, adding even up to 5 bans x team won't fix it. People will always complain. People will always find another OP champ that they believe is 100% ban worthy.\nYou'll never be happy. That's just the reality.\n\nI've always thought that if Riot did indeed add extra bans it should be limited to just one extra ban per team. Not any more.\nNot only because of the reasons I stated above, but also because imagine all the times people dodge champ select, which makes the search for a game tedious as it is already. Imagine having to go through that but with extra time everytime you're in a draft.\nIt must have happened to you or someone you know, a relatively long wait because you might have actually had 5 or even more lobbies dodged, maybe even at the last pick, after probably a good 8 minute queue time.\n\nNo thanks.","replies":[{"poster":"Komatose","date":"2016-08-11T16:32:00.926+0000","up_votes":3,"down_votes":1,"body":"I agree with this. Adding more bans would make a lot of people unhappy. I play {{champion:114}} a lot, and she is occasionally banned right now. Adding more bans would probably get her a guaranteed ban, and since I've spent money on skins for this champion, not being able to play her would upset me quite a lot. There are too many champions that are good, but not good enough for a ban with only 6 bans, and extra bans would give people incentive to make these champions pick/ban.","replies":[{"poster":"Not xPeke","date":"2016-08-12T02:26:41.815+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Scared Famous,realm=NA,application-id=3ErqAdtq,discussion-id=wEZphQAp,comment-id=00060000000000000000,timestamp=2016-08-11T16:32:00.926+0000)\n>\n> I agree with this. Adding more bans would make a lot of people unhappy. I play {{champion:114}} a lot, and she is occasionally banned right now. Adding more bans would probably get her a guaranteed ban, and since I&#x27;ve spent money on skins for this champion, not being able to play her would upset me quite a lot. There are too many champions that are good, but not good enough for a ban with only 6 bans, and extra bans would give people incentive to make these champions pick/ban.\n\nExactly. Adding too many bans will lead to certain champions never seeing the light of day.\nBasically like Kassadin back in the days. \n\nSome champs depending on the Elo, pretty much go through that already right now. Just imagine with even more bans.\n\nWe should not just cancel a champion from the game by banning him out. It would go against the game's integrity. If a champion is that overpowered, it is up to Riot to balance him out. Not up to us to delete him from the game because we are salty or can't play against him.\n\nBesides I would like all of the people that perma ban 1 champion every time to just think about if it was their main being banned out every day, every game.\nYour main could have got buffed or received an increase in popularity, and all of a sudden you can't play him anymore.\n\nNo thanks, I'm happy as it is.","replies":[{"poster":"warpenguin555","date":"2016-08-12T03:06:34.587+0000","up_votes":1,"down_votes":0,"body":"certain champions never seeing the light of day isnt that bad of a thing...","replies":[{"poster":"Not xPeke","date":"2016-08-12T13:59:17.279+0000","up_votes":1,"down_votes":0,"body":"except when it's your main champion who wasn't in the \"overpowered\" state, or wasn't as popular and that toxic of a pick.\n\nA sudden change in meta, a rework, or a buff makes him really oppressive and people starts hating your favourite champion.\n\nAll of a sudden you'll never get to play him.\n\nBefore judging, try and put yourself in other people's shoes thank you.\n\nAnd overall, having certain champions never see the light of day only sounds like a good idea to salty people. But looking at it from an objective point of view, champions should never be perma banned or we might aswell delete them from the game all together. \n\nIf that is what you want, take it up with Riot.","replies":[]}]}]},{"poster":"blkKalameet","date":"2016-08-11T18:33:50.210+0000","up_votes":1,"down_votes":0,"body":"so you're saying that the problem with additional bans is a lack of game balance? \n\nthis goes back to what we've asked for many times, for all champs to have equal power. \n\n\nright now bans are used to get rid of op things and not even a though spared to team comp counters. that's the problem.","replies":[{"poster":"Not xPeke","date":"2016-08-12T13:57:23.175+0000","up_votes":1,"down_votes":0,"body":"Even if you increase bans to 10 bans, there will always be another champion someone wants to ban. There will always be another champion someone deems to be OP.\n\nLike you said, the real problem is the lack of game balance.\nAdding more bans will not and will never fix this. It's just a bandage, and not even a good one.\n\nIt's in our nature on a game like this to complain, moan, cry. People will never be satisfied.\n\nI do agree that bans are used to get rid of OP things without much thought to team comp counters. And yes that is sad and annoying when we think about it.\nBut don't kid yourself, adding more bans won't fix that!\nIt will only result in even more bans of OP picks.","replies":[]}]}]}]}]}]}]},{"poster":"Not HeIping You","date":"2016-08-11T07:21:17.158+0000","up_votes":6,"down_votes":1,"body":"This whole article is a complete waste of time, your all missing the main point of any of this.\n\nThey make new champions, to sell more rp, thats it, its plain and simple, riots in business to make money, not cater to your whims.\n\nIf they blocked kled or any other new champion from ranked for a week or two it just loses them sales, and riot losing sales is a big no no. I know for sure there is a lot of people that are Platinum and up that haven't touched more then 5 normal games in over a year because they consider them to be a waste of time, if their blocked out of playing kled because of a various reason, they may never buy him.\n\nRiot will never do anything ever that puts them in the position of possibly losing a few nickels and dimes here and there.","replies":[]},{"poster":"Livin like Riven","date":"2016-08-11T07:43:35.662+0000","up_votes":1,"down_votes":0,"body":"Upvoted, my friend literally does this with every new release, just spams ranked on the new champ/new updated kit champ till people learn how to play against it, but he doesn't know how to play it, either. He logged on about 30 minutes after he knew Kled was available, bought him, and charged into ranked with it. ._.","replies":[{"poster":"Gary B Enkelis","date":"2016-08-11T20:36:52.195+0000","up_votes":1,"down_votes":1,"body":"Good for him. He has guts. He's probably going to have fun while the rest of us nitpick.","replies":[{"poster":"Hot Belly Dancer","date":"2016-08-11T22:57:15.656+0000","up_votes":3,"down_votes":0,"body":"have fun while ruining the experience for others? scum mentality!","replies":[{"poster":"Gary B Enkelis","date":"2016-08-11T23:20:36.385+0000","up_votes":1,"down_votes":0,"body":"Maybe your experience. I don't think you speak for everyone.\n\nI don't care if he's playing Sona Jungle (is that a bad pick?), if he's honestly trying to win. I mean yeah I'd rather something more familiar (aka meta?) but that's because I'm gutless.\n\nCheck out the hilarious picture for \"3) DO NOT REPORT A SUMMONER FOR TACTICAL DISAGREEMENTS\": https://support.riotgames.com/hc/en-us/articles/201752884-Reporting-a-Player#h2q3","replies":[{"poster":"Supreme Senpai69","date":"2016-08-12T12:10:10.984+0000","up_votes":1,"down_votes":0,"body":"If you have experience with Sona jungle and are confident if you give it your all you can win then I would welcome it with open arms (She wouldn't be able to do her early clears cuz she's too squishy and relies on Sheen/Thunderlord's to deal damage which can't be used on jungle monsters so it wouldn't be a good pick.) \n\nBut with new champions people don't have experience and aren't confident they can win, they just want a cheese win through the hopes of the enemy not knowing how to play against the new champion and winning that way. But it gives the enemy the advantage because they can just play safe and cautious whereas you don't know how to play the matchup either. They don't need to but you do.","replies":[{"poster":"Gary B Enkelis","date":"2016-08-12T12:23:45.326+0000","up_votes":1,"down_votes":0,"body":"Yeah but if you're familiar with their champion and you are on Kled or something new then you're not going in totally disadvantaged.","replies":[{"poster":"Supreme Senpai69","date":"2016-08-12T12:38:14.557+0000","up_votes":1,"down_votes":0,"body":"That's true","replies":[]}]}]}]}]}]},{"poster":"Hot Belly Dancer","date":"2016-08-11T08:57:47.199+0000","up_votes":1,"down_votes":0,"body":"report him :3","replies":[{"poster":"Dracoenix","date":"2016-08-11T22:13:32.916+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hot Belly Dancer,realm=NA,application-id=3ErqAdtq,discussion-id=wEZphQAp,comment-id=00150000,timestamp=2016-08-11T08:57:47.199+0000)\n>\n> report him :3\n\ni'm positive there isn't an option to report someone for using a new champ","replies":[]},{"poster":"Mr Bruce Swain","date":"2016-08-11T10:27:41.511+0000","up_votes":2,"down_votes":1,"body":"You can't, there is no reason for report, players can play with whatever they own and suck donkey ballz, as long as they do not troll on purpose.","replies":[]}]}]},{"poster":"DrCyanide","date":"2016-08-10T18:47:31.697+0000","up_votes":6,"down_votes":3,"body":"Fully agree, there should be at least a 1 week period before they're enable in Ranked.","replies":[{"poster":"3ofGot40ve","date":"2016-08-10T19:35:54.018+0000","up_votes":1,"down_votes":1,"body":"Ehh, 1 weeks a bit long. I just wanted enough time so that they can actually learn what the champions abilities do so they aren't running around helplessly with no clue of how to trade or skirmish.","replies":[{"poster":"DrCyanide","date":"2016-08-10T20:26:05.866+0000","up_votes":3,"down_votes":0,"body":"1 week is the perfect amount of time then. \n\nNot everyone plays or watches League every day, and those that do are the most likely to know what the new champions abilities do anyway. Riot specifically made the 2-week ban as long as it is (as oppose to a 3 day ban) to make sure players who only play once a week notice it, why shouldn't a similar mentality be taken with Ranked?\n\nIt's not like you're preventing them from playing the champion at all that first week, just not letting them in Ranked. There's still several other queues to pick from where they can play the champion and practice first.","replies":[]}]}]},{"poster":"Moesnd","date":"2016-08-10T19:06:45.890+0000","up_votes":2,"down_votes":1,"body":"I agree but i dont think it should be as long as some are suggesting.\nI was thinking more like 2 or 3 days.","replies":[{"poster":"3ofGot40ve","date":"2016-08-10T19:32:18.883+0000","up_votes":3,"down_votes":0,"body":"Title:\n\n> untill a **few** days after\n\nDats what I'm saying mang.","replies":[]}]},{"poster":"Hauling Ashe","date":"2016-08-10T21:05:08.568+0000","up_votes":4,"down_votes":1,"body":"I just got out of a game with a player who declared Kled in champ select. Being a ranked game, we begged him not to pick a champ that has only been out for about 5 hours. We eventually had to resort to flat-out banning Kled.\n\nHe curses at us and proceeds to feed on Hecarim. Goes 0/17 until the final few seconds. I don't know how he got a kill at all, must have been an accidental auto. Surrendered at 20 and mourned my LP and MMR.\n\nPlease ban brand new champs from ranked. And please ban that player.","replies":[{"poster":"Academy Kayn","date":"2016-08-11T01:38:23.140+0000","up_votes":4,"down_votes":2,"body":"Honestly, just let the guy play Kled. He either does well and you lose nothing, or he did what he did on Hec anways and feed his brains out. Only difference being is that he has a chance of being good with Kled.\n\n(of course that doesnt excuse feeding)","replies":[{"poster":"Supreme Senpai69","date":"2016-08-11T07:26:06.316+0000","up_votes":2,"down_votes":1,"body":"It's the same when they pick intent Vayne mid. It probably will end with them feeding, but if you ban Vayne or choose Vayne yourself (as an ADC) they'll simply feed intentionally. So you have to just grab your knees and make it easier for them and sure enough, they still feed. \n\nIt's easier to just dodge tbh.","replies":[{"poster":"Gary B Enkelis","date":"2016-08-11T20:22:34.644+0000","up_votes":2,"down_votes":1,"body":"Why do you think someone who plays Vayne mid is probably going to feed? Because you saw it before? Will the next time a Vayne goes mid be the same as the last time? That's clairvoyance.\n\nWhy don't you give them what they want to play? Do you know anything about them? And why would you pick Vayne away from them? Do you think you are better at Vayne than them?","replies":[{"poster":"Supreme Senpai69","date":"2016-08-12T10:07:23.352+0000","up_votes":1,"down_votes":0,"body":"Because I've seen only a few Vaynes mid but they have all fed. Mostly because Vayne mid is a terrible idea with plenty of disadvantages working against you. Why play something with disadvantages at the start? Will the next Vayne mid be the same as the last? You don't know for sure, but they most likely will. \n\nI get you're just playing the devil's advocate here but you don't need to be \"politically correct.\" Vayne mid is a bad idea and it was just one example of many. The point was it's easier to dodge rather than ban someone's pick intent, because potential feeding becomes definite feeding.","replies":[{"poster":"Gary B Enkelis","date":"2016-08-12T10:28:00.529+0000","up_votes":1,"down_votes":0,"body":"I would say that Vayne mid in the right circumstance can work, but I don't know.\n\nProbably my Vayne mid wouldn't work. I'm terrible at Vayne and at mid. But maybe someone else is good at it?\n\nAnd I mean if I enjoy Vayne mid and you want to pick or ban it away from me... That's kinda jerky. But I understand why someone would do that, I suppose.\n\nDo you assume I would feed, or be as bad as I say I am, or what?\n\nI mean what if you got really good at Vayne mid? Do you think that is possible?","replies":[{"poster":"Supreme Senpai69","date":"2016-08-12T12:05:53.369+0000","up_votes":2,"down_votes":0,"body":"If you're really good at Vayne you should play her bot lane or top lane though. A good Vayne would know that, and with the way the new queue works, you're promised to get one of those two roles. She goes bot lane because she has a super weak early game and needs gold to be relevant but not levels. She can afford to have someone else in her lane to mooch off of her experience (the support) because she only needs gold. Her weak early game is compensated by the support protecting her. \n\nShe can go top, however, because tanks like to go top and Vayne is a tankbuster. Top lane doesn't get ganked as much as the other lanes (usually? sometimes it does) because bot lane has dragon. \n\nShe should not go mid because that lane isn't long at all, so her passive won't be used to its fullest. She can't really run people down mid lane as easily as the other lanes because it's easier for them to run away. Additionally, it's the most dangerous lane because since it's in the middle it gets ganked the most. She is super squishy and can't really get away from a gank in the mid lane. \n\nBasically, if you're really good at Vayne mid then you're even better at Vayne ADC. And if you see a Vayne mid, it's more likely that they're just bad at the game and don't know that Vayne shouldn't go mid. \n\nMy point though was that you shouldn't pick or ban someone else's champion. If you think they're gonna feed then simply dodge. We're sorta saying the same thing.","replies":[{"poster":"Gary B Enkelis","date":"2016-08-12T12:28:15.203+0000","up_votes":2,"down_votes":0,"body":"My mistake, and I think you gave a very good explanation too. I want to poke holes in it. :D","replies":[]}]}]}]},{"poster":"warpenguin555","date":"2016-08-12T03:13:00.742+0000","up_votes":2,"down_votes":0,"body":"yes. i cant wait to see a guy pick Lux ADC, but with your logic even though the last 20 fed this one wont right.","replies":[{"poster":"Gary B Enkelis","date":"2016-08-12T03:30:56.089+0000","up_votes":1,"down_votes":0,"body":"I'm not saying they will. I'm saying it can't be known (if you have some huge supply of Luxes, and I doubt you've met every Lux). That is my logic. How often do you correctly call heads or tails when flipping a coin? Come on, bro. :D\n\nI mean I don't know....","replies":[]}]}]}]}]}]},{"poster":"Supreme Senpai69","date":"2016-08-11T07:22:42.689+0000","up_votes":1,"down_votes":1,"body":"I have people building MR against Kled and asking \"who the hell is he??1??\"\n\nIt's so frustrating like keep up on the patch notes or don't play ranked","replies":[{"poster":"Gary B Enkelis","date":"2016-08-11T20:41:33.951+0000","up_votes":1,"down_votes":1,"body":"Rank is a personal thing. If I go in to rank uninformed and lose then it's my problem, not yours. Yes you're on my team and we share LP. We weren't intentionally losing, so what is the problem? You want me to play the same champ every single game? Boring. I could also say there are many things you do not know about this game. Of course you would still play? I dare you to honestly say you know everything about this game and therefore deserve to play.\n\nI mean if you're so good then losing one game with me on your team isn't such a setback, is it?","replies":[{"poster":"Supreme Senpai69","date":"2016-08-12T10:09:59.644+0000","up_votes":1,"down_votes":0,"body":"Ey? Don't play the same champ every game. I would never. That's boring. I didn't even remotely say that, though. You put words in my mouth my other post about the Vayne mid too, stop doing that. I just said keep up on the patch notes if you're going to play competitive. That's all.","replies":[{"poster":"Gary B Enkelis","date":"2016-08-12T10:25:02.846+0000","up_votes":1,"down_votes":0,"body":"Ok, you are saying to keep up with patch notes or don't play ranked / competitive.\n\nI get that. I want informed teammates. Is that what you're saying you want? Are you also saying uninformed people can't play ranked?","replies":[]}]}]}]}]}