{"poster":"Socon","date":"2016-01-11T13:56:35.396+0000","title":"Yorick Rework Suggestion","subforum":"Player Creations","embed":{"description":null,"url":"http://img03.deviantart.net/94c1/i/2014/353/1/0/yorick_the_gravedigger_fanart_by_shev14th-d8agpq9.jpg","image":null},"up_votes":1,"down_votes":0,"body":"So Yorick&#039;s rework has been thrown under the bus for far too long and I don&#039;t think Riot still has any idea of where to go with him. Personally, and I&#039;m sure many would agree, playing against Yorick in his current state is no fun at all and I&#039;m sure after a few games, actually playing Yorick is no fun at all. I don&#039;t play Yorick much however I do like his lore and I do have a fair bit of imagination so I thought why not suggest some of my own ideas for the Yorick rework. \n\n**Abilities**\n\nPassive - Creation: When Yorick **kills** an enemy, they are reincarnated, becoming invulnerable and untargetable ghouls of themselves, which begin to attack the closest non-champion target and ignoring neutral monsters (Champion pets such as Annie&#039;s tibbers and Elises spiderlings will be targeted). These ghouls last for 3/6/12/24 seconds (increasing with ultimates level). If that target is a champion, the duration is increased to 10/15/25/30 seconds. Yorick can prioritise targets that his ghouls attack by Alt + Clicking them.\n\nQ - Portent of Conquest: Yorick creates a dark circle to appear on the ground briefly before causing hands to reach up from the ground and grab at all enemies inside the zone doing damage and briefly rooting them as well as marking them for conquest. Champions marked for conquest take 5% more damage from Yorick. Attacking enemies marked for conquest increases attack speed and refreshes the duration. Conquest marks last for 3 seconds.\n\nW - Portent of War: Yorick sends a flurry of ghostly apparitions in a wide direction in front of him, fearing all enemies for 1 second and then slowing all enemies by 20/25/30/35/40% for 3 seconds. Applies mark of war, reducing the armour and magic resist of all target hit by 5/10/15/20/25.\n\nE - Portent of Famine: Yorick siphons the soul of a target (including friendly minions) dealing damage and healing Yorick for % of the damage dealt to the target. Refreshes duration of mark of conquest on targets. Applies mark of famine, inflicting grievous wounds for 5 seconds. If Yorick kills a friendly minion with this ability the cooldown is halved and the gold of that minion is given to the closest enemy within a radius.\n\nR - Passive - Omen of Death: Whenever a ghouls duration ends, Yorick gains a mark of death, stacking up to 6. Yorick gains 4/5/6 Armour and magic resist for each stack. \n\nActive - Omen of Death: Yorick can create a ghoul reverent of an allied champion which is untargetable and invulnerable. This ghoul lasts for 10/17/24 seconds and begins attacking the closest non-champion target, ignoring neutral monsters. Yorick may command this ghoul to focus targets with ALT + Clicking. During this time Yorick loses all stacks of &quot;Mark of death&quot; and will not be able to gain them until the duration is over, instead it is replaced with &quot;Portent of Death&quot;. If the allied champion dies during this time, they take over the ghoul for the rest of its duration and are able to use their abilities and target all enemies and neutral monsters however, they deal only 40/50/60% of their original damage. When the allies ghoul duration is over he is granted full stacks of &quot;Mark of Death&quot; and &quot;Portent of Death&quot; is replaced with &quot;Omen of Death&quot; (Passive).\n\nPortent of Death: When Yorick gains an assist in killing an enemy champion, that enemy champion comes back as a ghoul for 10 seconds.\n\n\n**Explained**\n\nI decided to re-work him in this way for a couple of reasons. Mainly being that League lacks hard split pushing that works or that is reliable, additionally, sieging can get long tedious and boring. This rework turns Yorick into a fighter/tank that offers his team some nice utility and sieging power (specifically for poke compositions), as well as split pushing power while still being a useful asset in team fights. His passive becomes fun to use, almost like you're commanding a small army of your own and when the conditions are right in team-fights, he can have extremely rewarding payoffs from making good decisions. As far as laning goes, his passive gives him strong pushing power, which his e allows him to offset for the early game lane control. I imagine that his e would have a fair mana cost, to prevent him from abusing it to his advantage. \n\nUltimately, Yorick becomes fun by being a rewarding champion to play when played correctly. When played poorly he is punishing, but when behind he has the utility to still be useful, and when ahead can snowball if consistently played well. \n\nThese have been just some suggestions and my vision of Yorick. There are many other paths that can be taken with him, e.g one of my own other ideas was making his passive attack champions as priority, then turrets, then minions.","replies":[{"poster":"Shana Rei","date":"2016-01-11T22:51:45.659+0000","up_votes":1,"down_votes":0,"body":"I enjoy playing yorick a lot. I don't get the hate. Going into him is a challenge sure but I don't think it deserves the hate he gets. He is old we all get that but he is still incredibly useful. Ever since all the item changes I find he works as a support very well  also.","replies":[{"poster":"Socon","date":"2016-01-12T02:54:16.245+0000","up_votes":1,"down_votes":0,"body":"He's not a fun champion to play against. Back when he was strong (before riot nerfed him) There was a saying. \"If you're in yoricks lane you don't get to play league today\" And it's still true to an extent. He is basically an anti-fun champion. Don't get me wrong. His kit is strong, the only downside to him is his mana-costs and lack of engage. It's very difficult to get Yoricks full damage in unless you're already in a fight. He has a lot of stats that just go to waste, you basically have to be a robot to play him to his full potential every game. Most of the time his ult doesn't even get used properly in fights and is basically just a small steroid for 10 seconds. As he is, there's no counter play, there's no out-play potential, you either pick a ranged champion top-lane like jayce, or get bashed in the face until he runs out of mana.","replies":[{"poster":"DipperOCE","date":"2016-01-12T03:27:04.958+0000","up_votes":1,"down_votes":0,"body":"He doesn't need engage, because he isn't an assassin nor a tank really. He is a tanky damage dealer / bruiser, most commonly played in top lane. And I disagree with the no counter play judgement, because you listed the flaws of him in your own paragraph.\n\nYeah he's a pain in the ass to deal with in top, with his healing, damage and strong slow, but champions like Fiora, Xin Zhao and Sion do his job better. They also counter him. If you want to defeat a Yorick, you need someone with decent mobility, but a lot of dueling power.\n\nOf course, if you're dealing with a critical strike Yorick, then that is a whole different story.\n\nWhile Yorick has set backs in mobility, he has his W to slow someone and speed up, and he offers a lot of damage if someone on the enemy team gets caught out. He's pretty good at focusing in team fights, and can lock someone down with his W. You can ult a carry and pretty much instantly win a teamfight, and his laning phase is quite strong. \n\nDespite the mana problems, Yorick is in my opinion quite balanced, and in no need of a rework. Every champion has their pros and cons, and Yorick is no different. They are going to do Shen and Taric first though, at least.","replies":[]}]}]},{"poster":"CHEESYLEEKS","date":"2016-01-11T17:11:26.702+0000","up_votes":1,"down_votes":0,"body":"> When Yorick kills an enemy\n\nso an enemy champion or enemy in general? ie minions aswell.\n\ni like it,well done. i heard someone on the forum say he will be reworked this year.","replies":[{"poster":"Socon","date":"2016-01-12T02:17:02.336+0000","up_votes":1,"down_votes":0,"body":"Any enemy, (this ignores neutrals). So minions, champions, pets","replies":[]}]}]}