{"poster":"Armpitpleasures","date":"2015-09-17T23:24:15.971+0000","title":"Reported for picking the \"wrong\" champ","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"So was playing ranked silver and was told to go top (I was last pick as usual).  Normally i sup/mid or jungle.  So i picked a champ that was off the meta and the rest of my team said they reported me.  \r\n\r\nThey told me who they preferred I  play  I said that I was unfamiliar with those champs and would probably end up feeding (in which case they would report me anyways probably).\r\n\r\nCan I be reported and banned for picking off meta champs for roles  even If you&#039;re half decent with them?","replies":[{"poster":"Sephyre3","date":"2015-09-17T23:38:31.747+0000","up_votes":2,"down_votes":0,"body":"You're not going to get punished for playing something off meta in the current system. \n\nThat said there's a lot to be said for communication, like asking your team if they mind if you try something a little different? I've had a lot of success with that method, for a while I was convinced that LeBlanc support could be a thing and I just asked my team if they were OK with it and went from there.","replies":[]},{"poster":"KidConfucius","date":"2015-09-18T05:56:16.692+0000","up_votes":1,"down_votes":0,"body":"Picking off meta is fine , you should never accept anyone telling you what you can and cant pick , and you certainly shouldnt be reported for it , but you should still be attempting to pick someone that , A: compliments and fits with the other picks on your team as a whole , and B: that matches up against what your lane opponent is. Ranked isnt the place for trying random things out though , you should do that in normal games where there is less pressure , you should really be picking things that your experienced using .If you dont have enough depth in champions your comfortable with to cover all roles , maybe you should consider finding one to cover that gap and practice with it. Just out of curiosity , what did you pick?","replies":[]}]}