{"poster":"GottDaKohle","date":"2017-10-26T08:52:56.261+0000","title":"BRAUCHE DRINGEND HILFE BEI DER PC/RECHNER/TASTATUR/MAUS AUSWAHL!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi\nIch w&uuml;rde gerne mit dem LOL spielen anfangen jedoch habe ich absolut keine Ahnung was ich kaufen soll ^^\nMeine Frage ist k&ouml;nnt Ihr mir sagen welchen PC/Rechner/Tastatur/Maus etc. ich kaufen soll.\nIch will auf keinen Fall haben das es w&auml;hrend dem Spielen lagt oder sonstiges!\n\nPREISVORSTELLUNG:             Bis 1000€ wenn möglich wenn es etwas teurer ist geht das auch\n\nPS: Ich habe absolut keine Erfahrung mim Zusammen bauen würde daher einen fertigen kaufen wenn möglich :)\n\nVIELEN DANKE F&Uuml;R DIE HILFE :)))","replies":[{"poster":"Erdbeermilch","date":"2017-10-26T10:43:12.739+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Qbert","date":"2017-10-26T11:26:29.693+0000","up_votes":1,"down_votes":0,"body":"Du musst echt aus dem Vertrieb sein xD\nEr sagt schon 1000er, vllt. bissl drüber ... du bietest einen PC mit 20% drüber an PLUS einen Monitor mit Maus etc. für 400 Euro, was in Summe also 60% über seinem Budget liegt :P\n\n> Es bringt dir nichts einen PC zu kaufen der in 2 Jahren wieder so veraltet ist, das du dir gleich einen neuen kaufen musst. \nIst übrigens totaler Quatsch.\n\nDie schnelle Entwicklung von Hardware im Consumer-Bereich stagniert schon seit 6-7 Jahren und wird es noch mind. 10 Jahre. Vielleicht mal deutliche Sprünge im RAM-Bereich sind möglich.\nAber GraKa und CPU werden keine suuuuuuuuuuper Sprünge mehr machen. Nächster Schritt: Quantencomputer.","replies":[{"poster":"Erdbeermilch","date":"2017-10-26T11:39:16.034+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Gin","date":"2017-10-26T12:19:49.995+0000","up_votes":2,"down_votes":0,"body":"Das Problem ist, dass er dafür 1600 Euro braucht. Und ich denke nicht dass er mit \"kann auch etwas mehr sein\" 600 Euro meinte, und ich bezweifle auch dass der Threadersteller seine Steuererklärung selber macht.\n\nKann natürlich sein. Würde ich allerdings nicht drauf setzen. \n\nEr hat außerdem nicht nach einem PC gefragt der die neusten Spiele schafft, sondern nach einem Rechner der Lol problemlos schafft und sich im Preisrahmen hält. \n\nEin guter Anfang um Geld zu sparen ist der Monitor den du ihm empfohlen hast. Der Bildschirm ist viel zu überteuert. Er bezahlt mehr für die Marke und das Aussehen, als für die Leistung.\n\n[Dieser Monitor](https://www.notebooksbilliger.de/tft+monitore/iiyama+prolite+b2483hs+1) hat zwar 3'' weniger, kostet allerdings weniger als die Hälfte und ist absolut ausreichend.\n\nWie Qbert schon geschrieben hat, sollte er seinen Monitor den er aktuell für die xBox verwendet allerdings auch für seinen Rechner benutzen können.\n\nEDIT: Das heißt nicht dass du deine Antworten gleich löschen musst. ","replies":[]},{"poster":"Qbert","date":"2017-10-26T11:47:51.929+0000","up_votes":1,"down_votes":0,"body":"Ja das ist so.\nDer große Sprung in der GraKa war durch die GTX 1060, Prozessoren verwenden seit bestimmt 4 oder 5 Jahren schon 9nm und diese werden nicht weiter fortschreiten können(physikalische Gründe).\nAlso ich weiß ja nicht was du für einen Prozessor hattest ... aber mein 7 Jahre alter PC(der letzte Woche das zeitliche Segnete) konnte alle aktuellen Spiel und einiges davon auf hoch spielen.","replies":[]}]}]},{"poster":"BlackAjani","date":"2017-10-26T11:23:20.330+0000","up_votes":1,"down_votes":0,"body":"> Du musst halt bedenken, dass die Erstanschaffung bei einem PC etwas teurer ist (Jeder der sagt selbst zusammen bauen ist billiger gehört verschlagen, es ist dann ERST BILLIGER, wenn man schon einen bestehen PC hat/hatte welchen man umbauen kann). Es bringt dir nichts einen PC zu kaufen der in 2 Jahren wieder so veraltet ist, das du dir gleich einen neuen kaufen musst.\n\nSelbst zusammenstellen + Zusammenbau kommt natürlich günstiger und macht sogar spaß.\nGibt nichts befriedigenderes als alle schönen Teile selbst auszuwählen, auszupacken und dann zusammenzufügen.\nAußerdem ist es dann mit 10 mal mehr Liebe und Sorgfalt zusammengebaut, als i-ein Student der diese Arbeit sonst verrichtet.","replies":[{"poster":"Qbert","date":"2017-10-26T11:27:34.368+0000","up_votes":1,"down_votes":0,"body":"Ich muss dich korrigieren, selbst zusammen bauen ist heutzutage nur noch unmerklich günstiger.\nFür Ahnungslose (wie er ja selber einer ist) auch absolut nicht zu empfehlen... allein schon den CPU-Lüfter aufsetzen kann eine Katastrophe werden :P","replies":[{"poster":"BlackAjani","date":"2017-10-26T11:32:14.792+0000","up_votes":1,"down_votes":0,"body":"Bei Alternate habe ich bspw. so auch 50 Euro gespart :)\nMit ein wenig Geschick und Glück kann man auch im Outlet meist stark reduzierte Ware erhalten. \nBei mir z.B. Gehäuse hatte einen Kratzer = 40 Euro billiger \n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Homunculi","date":"2017-10-27T06:56:34.332+0000","up_votes":1,"down_votes":0,"body":"Man kann aber auch ganz schnell 200 Euro in den Sand setzen. Kurz nicht aufgepasst, CPU falsch eingesetzt, zuviel Kraft eingesetzt und Haarrisse aufm Mainboard, Kabel falsch gelegt etc.\n\nFür jemanden der keinen Schimmer hat, wie ein PC von innen aussehen sollte, würde ich empfehlen einen \"Fertig PC\" zu kaufen, bei one.de oder mifcom.de (hat nichts mit Frauen zutun :P).\n\nWenn man jetzt noch ein wenig Geduld und Recherche Arbeit investiert, kann man auch dort ein paar Euro sparen und hat dann einen Service den man als \"Eigenbau\" nicht hat.","replies":[{"poster":"BlackAjani","date":"2017-10-27T07:07:10.816+0000","up_votes":1,"down_votes":0,"body":"Ich habe mir auch schon einen Fertig-Pc bestellt. \nSo ist es ja nicht und ich verteufel das auch nicht. Meine ja nur, wenn man Interesse, Zeit hat und ein wenigen Geld sparen will, dann kann man das machen.\nGibt bestimmt zahlreiche YouTube Guides dazu.","replies":[]}]}]}]},{"poster":"Erdbeermilch","date":"2017-10-26T11:42:50.759+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"BlackAjani","date":"2017-10-26T11:48:57.404+0000","up_votes":1,"down_votes":0,"body":"Ja, wir leben in einer grausamen Welt.","replies":[]}]}]}]},{"poster":"ΔRC RΔFUNZΞL","date":"2017-10-26T13:30:08.145+0000","up_votes":1,"down_votes":0,"body":"https://www.amazon.de/Dubaro-Intel-i5-7500-GTX1060-Festplatte/dp/B01N4PNZOG/ref=as_li_ss_tl?s=computers&ie=UTF8&qid=1508762137&sr=1-1&keywords=Dubaro&linkCode=sl1&tag=wwwyoutub0e1b-21&linkId=2ba55dbc64f5fdf9c28ed7ed2ec98d31 der ist recht gut für den preis https://www.amazon.de/Asus-VS248HR-Monitor-Reaktionszeit-schwarz/dp/B014RKZ81O/ref=sr_1_1?s=computers&ie=UTF8&qid=1509024406&\n\nund bei maus und tastatur musst du selber entscheiden was dir gefällt. ich z.b. habe eine corsair m65 (maus) und finde die super aber auch viele leute mögen razer mehr. da kommts halt drauf an was du mehr magst ich muss aber sagen der pc ist echt gut und der wäre für lol alleine zu wenig","replies":[]},{"poster":"Qbert","date":"2017-10-26T09:15:20.472+0000","up_votes":1,"down_votes":0,"body":"Schau mal bei Alternate oder bei deinem Fachhändler um die Ecke.\nDie verkaufen ganz gute Komplett-PCs. Da du ja eine komplette Ausrüstung brauchst(ich denke mal auch Monitor) würde ich dir einen Fachhändler empfehlen.\n\nAus welcher Stadt kommst du?","replies":[{"poster":"GottDaKohle","date":"2017-10-26T09:18:12.061+0000","up_votes":1,"down_votes":0,"body":"Ich hätte eine Curved monitor von Samsung den ich zum XBOX spielen benutze aber  keine ahnung ob der gut zum LOL spielen wäre :/ Komme aus der nähe von München","replies":[{"poster":"Qbert","date":"2017-10-26T09:24:28.465+0000","up_votes":1,"down_votes":0,"body":"hmmmm, dann gehe ich mal so von 27\" aus, oder ist das ein Widescreen mit um die 37\"?\n\nWie dem auch sei, wichtig ist nur, dass du den Überblick behalten kannst.\nSolltest du noch einen Monitor zum PC benötigen, ist das bei 1000 Euro eben schon ein großer Posten, denn einen guten Monitor(ohne 4k) bekommst du für ca. 200 Euro.\n\nWie gesagt, wenn du einen Fachhandel bei dir hast(kein MediaMarkt oder so) gehe dort hin.\nAnsonsten bspw. sowas hier:\nhttps://www.alternate.de/ALTERNATE/RYZEN-1500X-V2-PC-System/html/product/1378101?\n\nDa hättest du dann noch ein wenig Luft für eine gute Tastatur und Maus. Beides solltest du übrigens selber testen(MediaMarkt bspw.) denn die Ergonomie ist mit das wichtigste. Beides muss einfach zu dir und deinen Händen passen.\n\nP.S.\nes sei gesagt, Lol hat wirklich keine enormen Ansprüche, da reicht auch schon ein PC für 500 Euro!","replies":[{"poster":"GottDaKohle","date":"2017-10-26T09:40:45.128+0000","up_votes":1,"down_votes":0,"body":"ok vielen dank :)","replies":[{"poster":"Gin","date":"2017-10-26T10:30:05.325+0000","up_votes":1,"down_votes":0,"body":"Vergiss nicht dass du auch ein Headset oder Lautsprecher brauchst um Sound zu haben, da ein PC von sich aus keinen Ton abspielen kann. \n\nDas gleiche gilt natürlich auch für ein Mikrofon.\n\nSolltest dein Budget für ein Headset nicht mehr reichen, kannst du auch einfach In-Ear Kopfhörer verwenden die du bei dir rumliegen hast. Du hättest dann zwar immer noch kein Mikrofon, aber einfach nur für Ton sollte es reichen.","replies":[{"poster":"Qbert","date":"2017-10-26T11:29:17.723+0000","up_votes":1,"down_votes":0,"body":"DAS hab ich in der Tat nicht bedacht ._.","replies":[]}]}]}]}]}]},{"poster":"Necromant","date":"2017-10-26T09:02:40.429+0000","up_votes":1,"down_votes":0,"body":"LOL läuft aufm Toaster. Der kostet 30€ :)\n\nWillst dir den PC selbst zusammen bauen (hast Erfahrung mit?) oder dir n fertigen Kaufen?","replies":[{"poster":"Megamaexx","date":"2017-10-26T09:19:47.164+0000","up_votes":1,"down_votes":0,"body":"Also auf meinem 150€ Win10 Tablet lief es nicht so gut :/ hatte nur 5-20 fps","replies":[{"poster":"BlackAjani","date":"2017-10-26T09:54:31.311+0000","up_votes":1,"down_votes":0,"body":"Tablet xD","replies":[]}]},{"poster":"GottDaKohle","date":"2017-10-26T09:09:42.552+0000","up_votes":1,"down_votes":0,"body":"HI :) ich habe keine Ahnung vom zusammen bauen von daher würde ich einen fertigen bevorzugen ;)","replies":[]}]}]}