{"poster":"Genuwhine36","date":"2016-10-26T09:00:54.863+0000","title":"I really dont get how some players are so bad","subforum":"[ARCHIVED] Miscellaneous","up_votes":3,"down_votes":2,"body":"Like been playing since season 3 or 4 they hardly move up a tier and play alot and yet they still go like 1-9-1 in super low elo games. The games not even that hard lol if you play a decent amount for over a period of years you should atleast be d5. And \"I dont try\" isnt an excuse you have thousands of games over years in ranked if you didnt care you would play normals like my friends that actually dont care. I just really dont understand rofl.\n\nFor instance reckful is gold and has been playing like 4 months? and some players have been playing for 4 years still silver/gold and shit talk xD","replies":[{"poster":"Zelorxon","date":"2016-10-26T09:47:05.655+0000","up_votes":2,"down_votes":0,"body":"1) not gamers\n2) don't give a shit\n3) lazy\n4) ignorant\n5) unmotivated\n6) focus on different aspect such as attention whoring and killing time rather than self improving, winning or having fun\n7) never learned the game\n8) nobody taught them the game\n9) riot doesn't do anything in order to teach the game to new players\n10) i can keep going forever","replies":[{"poster":"reaperteaser","date":"2016-10-26T09:59:53.587+0000","up_votes":1,"down_votes":0,"body":"i just lost \"the game\"","replies":[]}]},{"poster":"Yooba","date":"2016-10-26T15:10:47.715+0000","up_votes":1,"down_votes":0,"body":"Those people you describe have brain disorders. They are failures at life. No human with a functioning brain will be stuck in silver for 4 years or so.","replies":[]},{"poster":"ItsOrval","date":"2016-10-26T15:05:12.793+0000","up_votes":1,"down_votes":0,"body":"It is mostly because they are not taught correctly, and will not listen even when given advice. \n\n\"Group mid\" -Nope \"Play safe\" -Nope \"Gank?\" -Nope \n\nAre just a few examples. Players do not care about your win, they care about themselves. Which is why tilting is a thing. \n\nRiot also does not have a good tutorial. Sure for beginners its good, but once you get to like level 10, you should get a new tutorial teaching you the advanced mechanics. This way the new players can take a little bit from the first tutorial, apply it for 10 levels, then take the new stuff they learned at level 10, and go from there. Stuff like deciding the right items/masteries/runes, how to counter, how to freeze lane, the importance of farming, split pushing, ganking correctly. using brushes correct, etc. There are many things new players will not know for a long time. This is my first year of playing this game (Although I took a 6 month break because of garbage internet a while ago), and the only reason I found out about this stuff was reading pro guides.","replies":[]},{"poster":"Dukues","date":"2016-10-26T14:55:56.523+0000","up_votes":1,"down_votes":0,"body":"You do realize only 2% of players make it to diamond right........ Yes I have played this game a ton just like my friends but most people don't spend that time trying to become great at it. They spam games and champs thinking it will make them better but if you are not actively trying to improve then you won't. Its really simple concept actually......\n\nI make fun of myself for playing so much and only being gold. But the fact of the matter is I have never been hardcore about learning the game or trying to improve . And even though I got gold right away this season instead of trying to improve and rank up I played on two alt accounts instead ranking them to gold as well.  Just don't really care about trying to reach a higher rank. I know lots of people who just play for fun and could care less and just play ranked once in awhile but not enough to actually try and rank up. Or they hit a certain rank and just stop giving a shit. \n\nI do believe people can reach D5 if they actively tried and it was their goal and used resources available. But honestly most people don't care that much..\n\nSo honestly piss off....","replies":[]},{"poster":"Bad2Bone","date":"2016-10-26T09:35:21.396+0000","up_votes":1,"down_votes":0,"body":"Game is hard Period.","replies":[{"poster":"Zelorxon","date":"2016-10-26T09:47:26.774+0000","up_votes":1,"down_votes":0,"body":"HAVE A KEK GOOD SIR","replies":[]},{"poster":"Genuwhine36","date":"2016-10-26T09:43:29.395+0000","up_votes":1,"down_votes":0,"body":"Its really not LOL. Thats why people like reckful can be already gold.","replies":[]}]},{"poster":"NiamhNyx","date":"2016-10-26T09:42:02.818+0000","up_votes":1,"down_votes":0,"body":"You dont know how hard the game is untill you have to carry a melee team as tank raka.... good god, i almost never want to play her again after that.","replies":[{"poster":"Genuwhine36","date":"2016-10-26T09:43:52.462+0000","up_votes":1,"down_votes":0,"body":"i mean its raka so freelo amirite","replies":[{"poster":"NiamhNyx","date":"2016-10-26T09:46:42.285+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Genuwhine36,realm=NA,application-id=cIfEodbz,discussion-id=Ze6QNJEs,comment-id=00010000,timestamp=2016-10-26T09:43:52.462+0000)\n>\n> i mean its raka so freelo amirite\n\nhahahaha yea, freelo with a melee team against a poke comp. not so much.","replies":[]}]}]}]}