{"poster":"gomaevaxx","date":"2017-08-01T03:50:26.720+0000","title":"Consulta sobre un ban","subforum":"Off-topic y temas personales","up_votes":5,"down_votes":1,"body":"Estuve conversando con un amigo que fue recientemente baniado (aproximadamente 4-5 semanas), y me dice que le quitaron lo que seria el sistema de honor (En su lugar quedo sin nada). mi pregunta es si alg&uacute;n d&iacute;a se le devolver&aacute; eso, &iquest;y si ese d&iacute;a sera dentro de la temporada actual o la pr&oacute;xima?","replies":[{"poster":"Rebkans","date":"2017-08-01T03:53:18.986+0000","up_votes":3,"down_votes":0,"body":"Preguntas frecuentes sobre el sistema de honor:\n\n> **¿Cómo puede bajar mi nivel de honor?**\n\n> Solo bajarás de nivel si recibes una sanción. Una restricción de chat baja el nivel de tu Honor a 1, o 0 si ya estás en nivel 1. Una suspensión de dos semanas hará que tu nivel caiga hasta 0 (aunque haya sido mayor). En ambos casos, el progreso de tu honor estará bloqueado, lo que hace a tu cuenta inelegible para recompensas de artesanías hextech. El progreso de tu honor será desbloqueado en algún momento después de tu restricción, siempre y cuando muestres señales de reforma.\n\n> **¿Qué quieren decir con que bloquearán mi nivel y recompensas de honor?**\nVerás un candado en tu nivel de honor en tu perfil. Esto significa que no estás haciendo ningún avance hacia el siguiente nivel y que no recibirás ninguna recompensa. Desbloquea tu nivel de honor consiguiendo partidas limpias. Recibirás una notificación cuando desbloquees tu nivel de honor.\n\n> **¿Qué ocurre con los niveles 1 y 0?**\nSi bajas del nivel 2, tuviste una o dos penalizaciones, el primer paso es conseguir partidas limpias para desbloquear tu nivel de honor. Cuando lo logres, tus partidas te ayudarán a conseguir mejores recompensas, como siempre ha funcionado desde que lanzamos el Botín.\n\n> **¿No hay recompensas en estos niveles?**\nEn el nivel 1 ganarás menos fragmentos de llaves de lo normal. En el nivel 0, conocido como Deshonroso, no ganarás nada. Es una lástima, pero puedes recuperarte jugando partidas","replies":[{"poster":"gomaevaxx","date":"2017-08-01T04:15:22.789+0000","up_votes":2,"down_votes":0,"body":"gracias por aclarar mi duda{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Rebkans","date":"2017-08-01T17:14:08.697+0000","up_votes":1,"down_votes":0,"body":"No problem! :)","replies":[]}]}]}]}