{"poster":"singl3play3r","date":"2017-04-26T06:36:04.633+0000","title":"Fehlermeldung? oder ist das normal?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Gr&uuml;&szlig;t euch Beschw&ouml;rer,\r\n\r\nheut morgen wollte ich eine entspannte Runde League spielen und musste feststellen, dass im Login-Client ein Fehler aufgetreten ist.\r\n&quot;wir haben diese installation auf eine &auml;ltere version von league of legends zur&uuml;ckgesetzt. Jetzt versuchen wir, sie auf die neueste Version zu aktualisieren&quot;\r\nWei&szlig; jemand von euch was ich dagegen tun kann? -Ich kann mich zwar ganz normal einloggen, wenn ich dann jedoch auf &quot;Spielen&quot; gehe, steht da die n&auml;chste Fehlermeldung: &quot;Du kannst gerade nicht spielen, weil du scheinbar offline bist. Falls du diese Nachricht liest, obwohl dein Internetzugang funktioniert, steige bitte auf den klassischen Client um, bis wir das Problem behoben haben.&quot;\r\n-Was kann ich dagegen tun?\r\nWenn ich danach n&auml;mlich auf den alten Client zur&uuml;ckgreife und ein Ranked spiele, bekomme ich &auml;rgerlicher Weise keine League Punkte. :(\r\n\r\nDanke im Voraus.","replies":[{"poster":"Enderized","date":"2017-04-26T06:52:17.324+0000","up_votes":2,"down_votes":0,"body":"Man bekommt auch in Rankedspielen im Legacy Client LP.","replies":[]},{"poster":"SUΡΡORT","date":"2017-04-26T12:39:25.876+0000","up_votes":1,"down_votes":0,"body":"Heya, singl3play3r!\n\nIch würde dir empfehlen mal das Hextech-Repair-Tool auszuprobieren. Mit diesem Programm kannst du die meisten Fehler direkt ohne große Probleme beheben! (Du kannst auch, wenn gewünscht, League of Legends **komplett** reparieren lassen oder gar neuinstallieren.)\nDies löst möglicherweise auch dein Chat-Problem, welches vermutlich mit der Firewall zusammenhängt und League of Legends daran hindert zu den Chat-Server zu verbinden. \n\n>[Download Hextech-Repair-Tool](https://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool) von RiotGames.com\n\nIch hoffe sehr, dass ich dir helfen konnte,\n\nSUPPORT\n\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Time2Whine","date":"2017-04-26T08:51:23.035+0000","up_votes":1,"down_votes":0,"body":"Ich würde dir raten die Datei zu reparieren oder League einmal komplett neu aufzusetzen, eventuell wird der Fehler dadurch behoben.","replies":[]}]}