{"poster":"Locojoa14","date":"2016-03-18T23:49:44.132+0000","title":"Riot, cada vez la cagas mas con los campeones...","subforum":"Charlas Generales","up_votes":2,"down_votes":11,"body":"Yo solo vengo a dar aqui mi opinion y a descargar un poco la put* furia que tengo por soportar gente asquerosa en ranked.....Miren, les explico cual es el problema, me vengo a desahogar mas que nada y a contarles a los &quot;genios&quot; de Riot como cada vez cagan mas el juego.    \r\nHay miles de cosas para inventar, cientos de champs tenemos ya. &iquest;Por que inventan un campeon tan asqueroso como Jhin? Les juro que estoy harto...totalmente HARTO de perder docenas y docenas de rankeds porque pickeen ese champ en mi team, ya sea en mi team o en el otro...NO SIRVE, simplemente ese campeon asquero** no sirve! Lo unico que hacen las personas que lo ocupan es ultear (r) en medio de una tf...pegar los 4 tiros y listo, se lavan las manos, como los mejores adcs del mundo, harto de perder rankeds por campeon asi de inutiles....Muchos van a decir. &quot;Ay, pero si es buen campeon&quot;. &quot;Ay, yo lo maineo y no es asi&quot;....Hacele 1vs1 a cualquier adc....CUALQUIER ADC vs Jhin y contame quien gana....simplemente es un champ que no sirve, no es por nada pero vengo a descargar mi furia aca, harto ya de perder docenas de rankeds por gente asi, les pido amablemente que pickeen otras cosas y se cagan en todo, entran, regalan partidas y yo tengo que andar perdiendo por culpa de ellos, no solo yo...si no tambien 3 pibes mas que intentan ganar...y por un rata terminamos perdiendo, mi comentario o post no va a cambiar nada en el champ, nada en los jugadores, nada en Riot...pero simplemente era eso, contarles lo mierd* que me parece su campeon y lo inutilmente inservible que es. GG Riot, cagando champs desde tiempos inmemorables{{champion:202}} {{champion:202}} {{champion:202}}","replies":[{"poster":"iCasteGoDx","date":"2016-03-18T23:59:24.159+0000","up_votes":1,"down_votes":0,"body":"Varias partidas (rankeds) fui carreado y humillado por este pj, no es un simple adc, como los demás, cambiaron la mecánica de este, tiene un alcance exagerado y habilidades con mucho daño.\nPensa lo siguiente, estas en un juego de guerra, estas con el rifle campeando, obviamente tenes que estar bien posicionado para que no te maten y lograr matarlos, Jhin es algo parecido, tiene que tirar bien sus trampas, su stun, su r, sus 4 básicos y alejarse. \nPara mi es uno de los adc mas difícil de jugar, mas que nada por su poca movilidad y muy vulnerable al cc.\nNo veo que sea un campeón inútil, simplemente no es para cualquiera, tiene que tener un buen supp que haga disengage y demás.\nNo entiendo tu post, no culpes a los campeones, sino a los malos jugadores.\nUn saludo y suerte","replies":[{"poster":"Chimichanga Boy","date":"2016-03-19T00:23:52.741+0000","up_votes":1,"down_votes":0,"body":"en mi opinion hasta el momento los 2 campeones mas conos que existen EN MI OPINION es bardo y illaoi jaja","replies":[]}]},{"poster":"Iulos Dageim","date":"2016-03-19T00:22:57.058+0000","up_votes":1,"down_votes":0,"body":"Es excelente este champ, el tema es que es un hipercarry. Trata de hacer 1 vs 1 a Jhin full build, te moris de 2 tiros y una Q (sin contar las 2 habilidades con rango grosero del champ que te matan antes de que lo llegues a ver siquiera). Posiblemente te tocó solo con gente que no lo sabía usar.","replies":[]},{"poster":"Chimichanga Boy","date":"2016-03-19T00:22:52.818+0000","up_votes":1,"down_votes":0,"body":"emm hola, te doy mi punto de vista, al principio apenas lo compre tambien pensaba algo parecido a lo tuyo, es mas muchos amigos piensan igual que vos, pero jhin tiene que llegar mucho al late y si es posible que el supp lo acompañe la mayoria del tiempo porque si, es verdad, dispara los 4 tiros y esta 2 horas en cargar, por eso mientras carga el supp lo cubre ya que es un campeon que no dura nada y es muy facil de deletear, igual yo me armo filo, el segador y el bailarin y reparto criticos muy rapido jaja, por eso me gusta, igual no es facil de usar bien, a mi me costo bastante pero se podria decir que al menos la manejo :p","replies":[]},{"poster":"Tutancadead","date":"2016-03-19T00:19:02.699+0000","up_votes":1,"down_votes":0,"body":"Justo te quejas de los champion nuevos y originales?\nJusto de lo que tiene bien Riot ahora..","replies":[]},{"poster":"ImNotARapper365D","date":"2016-03-19T00:18:16.802+0000","up_votes":1,"down_votes":0,"body":"CC y hasta luego Jhin","replies":[]},{"poster":"SenbonZakura 1","date":"2016-03-18T23:59:49.267+0000","up_votes":1,"down_votes":0,"body":"estoy de acuerdo","replies":[]},{"poster":"PCtronix","date":"2016-03-18T23:57:47.844+0000","up_votes":1,"down_votes":0,"body":"si te quieres desahogar no vengas a los foros .. aca nadie le ``interesa´´ un nerfeo o un campeon ``inutil´´ para algunas personas ...","replies":[]},{"poster":"wintermoon","date":"2016-03-18T23:57:05.021+0000","up_votes":1,"down_votes":0,"body":"Banealo cuando podas...","replies":[]}]}