{"poster":"Jezzyx3","date":"2016-04-05T16:04:55.239+0000","title":"Anfängerin sucht freundliche Leute zum Zocken :)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo liebe Mitspieler :)\r\n\r\nIch hei&szlig;e Jessy, bin** 19 Jahre** alt und momentan noch **Level 20**. Momentan level ich also noch, w&uuml;rde sp&auml;ter aber gerne auch in Ranked einsteigen. Am liebsten spiele ich **Top, Jungle oder Support** (w&uuml;rde dabei auch gerne bleiben und mich weiter spezialisieren).\r\n\r\nDa bei zuf&auml;lligen, fremden Mitspielern eigentlich immer jemand dabei ist, der einem durch flamen etc. das Spiel verdirbt, bin ich auf der Suche nach ein paar Leuten/einem Team, mit denen sich das vermeiden l&auml;sst. Leute die einfach **Spa&szlig; am Spiel** haben, **nicht flamen** und mir evtl. auch helfen mich zu verbessern.\r\n\r\nWenn ihr Fragen oder Interesse habt, dann schreibt mir hier oder added mich und schreibt mir ingame: **J3ZZY**\r\nW&uuml;rd mich freuen wenn sich ein paar Leute finden :)","replies":[{"poster":"Xisannity","date":"2016-04-06T09:48:43.923+0000","up_votes":1,"down_votes":0,"body":"Gleichzeitig sich verbessern und keine Kritik (Flame) entgegennehmen lässt sich schwer vereinbaren. Aber das verstehen die Wenigsten anscheinend.","replies":[{"poster":"HHaie tabbian","date":"2016-04-06T10:42:47.329+0000","up_votes":1,"down_votes":0,"body":"Kritik ist nicht gleich Flame. Wie kommst du darauf?","replies":[{"poster":"Xisannity","date":"2016-04-06T10:47:37.954+0000","up_votes":1,"down_votes":0,"body":"da viele Kritik als Flame bezeichnen. Ich spreche aus Erfahrung.","replies":[{"poster":"HHaie tabbian","date":"2016-04-06T10:49:10.080+0000","up_votes":1,"down_votes":0,"body":"Das ist nicht richtig. Allerdings wenn du Kritik im Chat während eines Spiels äußerst, ist es in vielen Fällen flame, u.a. weil derartiges dort in der Regel nichts verloren hat.","replies":[{"poster":"Xisannity","date":"2016-04-06T10:55:42.672+0000","up_votes":1,"down_votes":0,"body":"Ja. Dann kann man aber auch gleich den Chat abschaffen und der Zensur freien Lauf lassen. Kritik soll und muss erlaubt sein. Und idealerweise sollte die Kritik - wenn sie nach Prüfung gerechtfertigt ist - auch in einer Umsetzung erfolgen.","replies":[{"poster":"Jezzyx3","date":"2016-04-06T13:24:15.748+0000","up_votes":3,"down_votes":0,"body":"Um mich auch mal dazu zu äußern: Kritik und Flamen sind nicht ein und dasselbe. Konstruktive Kritik ist immer gern gesehen, ich weiß dass ich Fehler mache und wenn mich jemand darauf hinweist und mir erklärt wie ich es besser machen kann ist das gar kein Problem. Flamen hingegen, einen für Fehler beleidigen oder des feeden beschuldigen etc, das ist lächerlich und hat bei einem Spiel nichts zu suchen meiner Meinung nach.","replies":[]}]},{"poster":"Xisannity","date":"2016-11-14T13:51:24.366+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tabbian,realm=EUW,application-id=ElKI1ocy,discussion-id=wekpANTI,comment-id=0005000000000000,timestamp=2016-04-06T10:49:10.080+0000)\n>\n> Das ist nicht richtig. Allerdings wenn du Kritik im Chat während eines Spiels äußerst, ist es in vielen Fällen flame, u.a. weil derartiges dort in der Regel nichts verloren hat.\n\nDas ist relativ","replies":[]}]}]}]},{"poster":"Parunpata","date":"2016-04-06T10:47:21.220+0000","up_votes":1,"down_votes":0,"body":"Kritik und Flame sind unterschiedliche Dinge. \nAber das verstehen die Wenigsten anscheinend.","replies":[{"poster":"Xisannity","date":"2016-04-06T10:56:56.704+0000","up_votes":1,"down_votes":0,"body":"Ja, aber wie gesagt, die Mehrheit sieht es wohl als dasselbe. Kritik will ja sogut wie keiner hören, da man sich nicht gerne schlecht darstellen lässt. Dabei ist es überhaupt nichts Negatives sondern eine Notwendigkeit, um Fehler zu erkennen und diese auch zu beseitigen.","replies":[{"poster":"Parunpata","date":"2016-04-06T13:25:08.343+0000","up_votes":2,"down_votes":0,"body":"Natürlich hast du Recht. Aber es gibt unterschiede zwischen Kritik und Flame. In einem normalen Ton kann man mir Tipps geben wie man will und die nehme ich auch gerne an.","replies":[]}]}]}]},{"poster":"scorbi","date":"2016-04-06T08:13:59.559+0000","up_votes":1,"down_votes":0,"body":"Hey J3ZZY\n\nwie sie sich alle auf dich stürzen, weil du angibst eine Frau zu sein finde ich immer wieder aufs neue erstaunlich !\n\nIch wünsch dir dennoch viel glück bei der Auswahl deiner Helferchen! \n\nZum Thema Jungle oder Support kann ich dir sicher das ein oder andere erzählen. Perfekt bin ich aber selber auch nicht...\n\nMeld dich falls du magst oder ebend nicht! \n\nAuf alle Fälle wünsch ich dir einen schönen Tag \n\nlg Scorbi EU West","replies":[{"poster":"Mognytoff","date":"2016-04-06T10:33:28.486+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=scorbi,realm=EUW,application-id=ElKI1ocy,discussion-id=wekpANTI,comment-id=0004,timestamp=2016-04-06T08:13:59.559+0000)\n>\n> Hey J3ZZY\n> \n> wie sie sich alle auf dich stürzen, weil du angibst eine Frau zu sein finde ich immer wieder aufs neue erstaunlich !\n\n\nIch möchte dazu grade mal mich selbst zitieren weils so gut rein passt und sich auch anbietet. \n\n\"Ich muss sagen mir ist schon öfters aufgefallen das Leute sich grade auf Posts von der weiblichen Fraktion stürzen. Ich hab auch schon mitbekommen wie 2 \"Mädels\" aus meiner FL nach dem Aufruf für Mitglieder zum erweitern des Teams innerhalb von einer Stunde 60 Freundes -Anfragen bekommen haben, wohingegen Leon, (ebenfalls im Team) mit einem abgewandelten Beitrag fürs gleiche Team, grade mal 2 bekommen hat.\n\nEhrlich gesagt finde ich die Entwicklung auch recht schäbig das Frauen grade in Streams oder in Games allgemein mehr als Sexobjekt definiert werden und nicht als würdige Mitspieler/ Contentersteller (was Streams angeht).\n\nDas geht teilweise soweit das wenn ich mal das Glück habe mit neuen Leuten, grade mit Damen, ins Gespräch zu kommen beim Daddeln, man sich ehrlich für seine Mitspieler schämen muss, weil man in den Konversationen genau mitbekommt was die eigentlich für Absichten haben. grade im TS oder Skype... Frauen/ Mädels sind nicht definiert weil sie Boobs haben Leute, man kann auch einfach so zwischenmenschliche Kontakte knüpfen ohne einen Sexuellen Hintergedanken.\n\nIch will damit auch gar nicht sagen das der/die Ersteller von dem Post hier solche Absichten haben, aber um meinen Vorpostern Recht zu geben, es macht schon einen gewissen komischen Eindruck - und grade hier im Forum hat man schon ein paar kranke Sachen erlebt.\n\nVersteht mich nicht falsch, ich bin auch ständig bestrebt neue Mitspieler/rin zu finden, aber versucht euch da einfach ein bisschen aus eurem Gedanklichen Korsett zu lösen und auch Architekt eurer eigenen Gefühle zu sein, das spricht glaube ich mehr für euch als wenn man mit Gewallt gezielt danach sucht. \"\n\nIn diesem Sinne, viel Glück noch beim lernen J3ZZY.","replies":[]}]},{"poster":"SeaHorseCalamity","date":"2016-04-05T16:15:32.320+0000","up_votes":1,"down_votes":4,"body":"und wie immer biete ich meine hilfe an :)\n\nich spiele immer mal wieder mit anfängern, um sie auszulachen, wenn sie feeden... (natürlich erkläre ich auch was die fehler waren)\n\nfalls du lust darauf hast: adde mich einfach.","replies":[{"poster":"HHaie tabbian","date":"2016-04-05T16:19:07.445+0000","up_votes":1,"down_votes":0,"body":"ich bin mir nicht so sicher, ob du dich damit qualifizierst :D","replies":[{"poster":"SeaHorseCalamity","date":"2016-04-05T16:20:28.244+0000","up_votes":1,"down_votes":1,"body":"versuch ist es immer wert :D\ndie meisten padawane von mir sind zufrieden damit","replies":[{"poster":"Jezzyx3","date":"2016-04-05T16:28:54.651+0000","up_votes":2,"down_votes":0,"body":"Hm...ausgelacht wurd ich schon immer gern :D (Achtung Ironie) ;)","replies":[]}]}]}]},{"poster":"MSY Shinks","date":"2016-04-07T15:10:41.267+0000","up_votes":1,"down_votes":0,"body":"Hey hab dich mal geaddet, sind ne lustige und gut gelaunte Truppe, zum teil auch Anfänger dabei und ein paar erfahrene spieler die durchaus den einen oder anderen Tipp geben können können ;)","replies":[]},{"poster":"Bodycounter","date":"2016-04-07T12:15:11.254+0000","up_votes":1,"down_votes":0,"body":"Dieser Thread ist beim Lesen sehr amüsant. Aus eigener Erfahrung kann ich nur berichten, dass es sich im Durchschnitt mit Frauen tatsächlich deutlich angenehmer spielt. Die Grundeinstellung ist oft eine gesündere und kommunikativere.\n\n@ OP: Falls du noch Leute zum Zocken suchst, kann du mich gerne adden. Wir spielen regelmäßig in kleineren Gruppen, jedoch meist erst am Abend. Gerne auch ARAMs oder 5vs5 custom games, alles entspannt. Außer du spielst Teemo :)","replies":[]},{"poster":"ColdPriest","date":"2016-04-05T22:15:54.425+0000","up_votes":1,"down_votes":0,"body":"Wenn du willst kann ich dir beibringen zu supporten. Ich mach das schon nen paar Jahre^^  Adde mich einfach wenn du bock hast","replies":[]},{"poster":"Simstaa","date":"2016-04-05T16:58:23.738+0000","up_votes":1,"down_votes":0,"body":"#","replies":[]},{"poster":"eX Vênox","date":"2016-04-05T16:22:34.746+0000","up_votes":1,"down_votes":0,"body":"Habe dich mit meinem Lv20 geaddet, wenn du magst einfach anschreiben & wir können paar Spiele machen.","replies":[]}]}