{"poster":"MrNuclearPumpkin","date":"2017-11-21T16:02:36.414+0000","title":"@Riot. Listen. Don't touch Zoe for at the very least a month or two.","subforum":"Gameplay","up_votes":150,"down_votes":24,"body":"You flat out said she has a high skill ceiling. People are probably gonna go &quot;Zoe sucks! She needs buffs&quot; \r\n\r\nShe&#039;s going to have a low win rate. She&#039;s going to have people saying she&#039;s bad. But this sounds like Yasuo all over again. Yasuo came out, everyone said he sucked (when he didn&#039;t) and he got buffed. Then people figured out how to play him and he became god like levels of OP.\r\n\r\nPlease, just let players figure out how she plays. There&#039;s no point of a high ceiling, if you don&#039;t give players a chance to climb up the ladder to reach the ceiling.","replies":[{"poster":"Quepha","date":"2017-11-21T16:10:04.103+0000","up_votes":99,"down_votes":2,"body":"They still haven't realized that they have way overbuffed Ornn.","replies":[{"poster":"Catastrop","date":"2017-11-21T16:42:04.401+0000","up_votes":37,"down_votes":0,"body":"I'm honestly amazed that no one made any fuss about 20% max HP damage in 2 seconds.","replies":[{"poster":"Chembaron Yamada","date":"2017-11-21T17:23:31.124+0000","up_votes":44,"down_votes":0,"body":"If it would be 2 seconds, that would be a blessing.\n\nThe fire belching just lasts 0,75 seconds, add an AA afterwards and you get 33% max health damage in 1 second time investment.\n\nI never understood why they did this massive buff. He has too much max health damage in his kit for the amount of CC and tankiness he brings.","replies":[{"poster":"Firethorn","date":"2017-11-21T18:55:40.895+0000","up_votes":4,"down_votes":0,"body":"Yep, I'm just glad he's not as popular or I would be perma banning him every game. Definitely think they need to nerf his W dmg.","replies":[]}]}]},{"poster":"GelsominoKiller","date":"2017-11-21T21:35:51.359+0000","up_votes":14,"down_votes":2,"body":"I am amazed by Riot at times.\n\nHas anybody on the balance team ever laned against Ornn? \n\nThe experience is quite depressing.","replies":[{"poster":"T4underbolt","date":"2017-11-21T21:42:57.764+0000","up_votes":3,"down_votes":14,"body":"Balance team is consisted of hard stuck diamond 5 that got there playing only busted champs that were in meta or overbuffed at times. So basically their game knowledge is not more than silver level.","replies":[{"poster":"Abibyama","date":"2017-11-21T23:23:13.304+0000","up_votes":18,"down_votes":0,"body":"So we’ve gone from silver balance team to hard stuck diamond 5 balance team ","replies":[]}]}]},{"poster":"Shadow Hazard","date":"2017-11-21T21:04:47.717+0000","up_votes":2,"down_votes":0,"body":"I was thinking this same thing with all the repeated buffs. I know for a fact he is going to be P/B among tanks when pro games start up again unless something even crazier comes around","replies":[]}]},{"poster":"Riot Fauxfox","date":"2017-11-22T01:05:39.073+0000","up_votes":56,"down_votes":3,"body":"From what I understand internally, we actually think she might be a _tad_ _strong_.\n\nSo, I can see a future where, in a month or two, we will be nerfing, rather than buffing her. \n\nZoe is tough, super tough, and it's going to take people a while to learn. But during this time, we are OK with future Zoe mains going 1/17/13 (within reason :P)\n\nAgain, I'm not sure if we will buff or nerf her in the upcoming months, but we are definitely taking into account the difficulty of the champion into her winrates and power.","replies":[{"poster":"DeadUnborn","date":"2017-11-22T02:53:32.494+0000","up_votes":5,"down_votes":0,"body":"hey what about clarity revises?\n\nThe amount of times I confuse them when using Zoe's W is too darn high{{summoner:12}} {{item:3142}}","replies":[{"poster":"Riot Fauxfox","date":"2017-11-22T03:45:50.118+0000","up_votes":13,"down_votes":0,"body":"> [{quoted}](name=DeadUnborn,realm=NA,application-id=3ErqAdtq,discussion-id=7X6s6tVu,comment-id=00150004,timestamp=2017-11-22T02:53:32.494+0000)\n>\n> hey what about clarity revises?\n> \n> The amount of times I confuse them when using Zoe&#x27;s W is too darn high{{summoner:12}} {{item:3142}}\n\nLooking into this too. I think the big one tho is in a Zoe Mirror matchup. Peeps are having trouble figuring out who's summoner spell belongs to who.","replies":[]}]},{"poster":"Who is Taliyah","date":"2017-11-22T02:23:05.987+0000","up_votes":8,"down_votes":0,"body":"is 6/17/10 good too?\nhttps://image.prntscr.com/image/IFqb05KHTEeltWrFSdyisA.png\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Riot Fauxfox","date":"2017-11-22T03:44:39.401+0000","up_votes":10,"down_votes":0,"body":"> [{quoted}](name=JungleTaliyahWTF,realm=EUW,application-id=3ErqAdtq,discussion-id=7X6s6tVu,comment-id=00150001,timestamp=2017-11-22T02:23:05.987+0000)\n>\n> is 6/17/10 good too?\n> https://image.prntscr.com/image/IFqb05KHTEeltWrFSdyisA.png\n> {{sticker:slayer-jinx-wink}}\n\nSo close to a 1.0 Ratio. YET SO FAR.","replies":[]}]},{"poster":"ZURELL","date":"2017-11-22T01:50:24.490+0000","up_votes":8,"down_votes":1,"body":"she hurts. but if she doesnt get nerfed then imma be mad. you guys nerfed all the fun out of ivern :( ..... all i want is my w range back.....\n\nand also for league to actually open.... >.> i finished a game earlier today but never made it to the post game menu, it just closed and now it wont open....","replies":[]},{"poster":"Rozeria","date":"2017-11-29T12:45:31.974+0000","up_votes":2,"down_votes":0,"body":"I think zoe is in a good place atm she isnt easy to play and not so hard, it just takes a bit of practice. shes doesnt need nerfs or buffs atm im sure the people going 1/17/13 are playing or building her differently. ive found a new build that lets me get fed alot of the time (not all the time) but its not bad so if people are interested go this build ! Roa into sorc boots liandrys void or ludens or zhonyas depends on team comp lots of squishys get ludens or someone who bursts get zhonyas then void if you choose ludens or zhonyas then last item deathcap and ill send a rune page as well. i linked a pic of a game i didnt do so well in but won the build allows you to tank up a bit and one shot still its pretty good try it if you want \nhttps://gyazo.com/10f1723d71c3c577037562883ec3d6b0\nhttps://gyazo.com/cfbecbd2692329c226eb7b1a4fdeddae\nhttps://gyazo.com/bd2a4ce3ae6c9cee1bb36573251d85ff \nhttps://gyazo.com/feac80e14c4f396c4f0ce3772264b87d\nhttps://gyazo.com/6d5a9b95af5edfb220222f81260ff712","replies":[]},{"poster":"Magearna","date":"2017-11-22T02:40:00.651+0000","up_votes":2,"down_votes":1,"body":"That seems fair. She seems _slightly_ strong right now, I agree. But other than that from what I've experienced playing her AND playing against her, she seems really average. But like OP said, I'd like to see how those feelings change when people get closer to her skill ceiling.","replies":[{"poster":"Electro522","date":"2017-11-22T03:08:32.566+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Magearna,realm=NA,application-id=3ErqAdtq,discussion-id=7X6s6tVu,comment-id=00150003,timestamp=2017-11-22T02:40:00.651+0000)\n>\n> ...when people get closer to her skill ceiling.\n\nIf there even is one. Seriously, the combos you can do with her is just insane.","replies":[{"poster":"The Space Cowboy","date":"2017-11-23T04:00:42.465+0000","up_votes":1,"down_votes":0,"body":"I know, I do all these cool things thinking I'm outplaying somebody just to miss them by a pixel and die. It's really nice and adds to the gratification of landing stuff. No matter how much damage her Q does she will always get owned by Akali, Ekko, Talon, etc so I don't think she will be pick or ban anytime soon.","replies":[{"poster":"Electro522","date":"2017-11-23T04:14:46.484+0000","up_votes":2,"down_votes":0,"body":"This is true. She may seem mobile, but, she really isn't. She just has good sticking power, and the capability to pop up out of nowhere and make you go \"poof!\"\n\nSo, it's more like psuedo-mobility than anything else.....of which actual assassins will just eat right up.","replies":[]}]}]}]},{"poster":"BajungaDustin","date":"2017-11-22T04:18:26.353+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Riot Rainslight,realm=NA,application-id=3ErqAdtq,discussion-id=7X6s6tVu,comment-id=0015,timestamp=2017-11-22T01:05:39.073+0000)\n>\n> From what I understand internally, we actually think she might be a _tad_ _strong_.\n> \n> So, I can see a future where, in a month or two, we will be nerfing, rather than buffing her. \n> \n> Zoe is tough, super tough, and it&#x27;s going to take people a while to learn. But during this time, we are OK with future Zoe mains going 1/17/13 (within reason :P)\n> \n> Again, I&#x27;m not sure if we will buff or nerf her in the upcoming months, but we are definitely taking into account the difficulty of the champion into her winrates and power.\n\nYeah she is tough.. she has a high damage output..\n\nBUT...\n\nher kit is not only very technical with multiple combos to learn.. learning to use them on the fly and what combo to use makes her probably one of the hardest champions i have ever had to learn. \n\nIts like when you play her you cant think straight. \n\n_\"Do i R backwards then Q wait for pop and Q... or do i Q than R forward and Q?\"_ that kind of thing. \n_Q then pop up over a wall then Q_\n_Q then pop up over a wall then E or E through the wall_\n_do i Q to the side then Q the enemy or do i Q back and R over and Q the enemy?_\n\nThe combinations are amazing and they take thought and planning and skill. \nand on top of all of that... the Q is very hard to hit on an enemy with a redirect because it takes so long. and 70% of them in lane ive throne have been dodged. \n\nSo the reward for the skill shots and the forethought that goes into making her kit work... is what makes her damage justified. \n\n\ni will say that her level one potential is nasty and may need to be scaled down a bit.. look what i did at level 1 with the starting speed boost\nhttps://goo.gl/GHTWQK","replies":[{"poster":"LordGeovanni","date":"2017-11-22T12:21:00.104+0000","up_votes":2,"down_votes":0,"body":"Closer enemy R backward.\n farther enemy r forward.\ni cant even pretend that is a hard kit to understand or use\nthats like saying trundle put down w now i can run omni directionally so he  is far harder.\nno its w edge toward enemy if you need to engage w edge away from enemy if you need to retreat.  e behind enemy to engage e ahead of enemy to retreat.\nzoe's q is basically viktors e in application although not in damage.","replies":[]},{"poster":"Riot Fauxfox","date":"2017-11-22T09:57:54.919+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=BajungaDustin,realm=NA,application-id=3ErqAdtq,discussion-id=7X6s6tVu,comment-id=00150007,timestamp=2017-11-22T04:18:26.353+0000)\n>\n> Yeah she is tough.. she has a high damage output..\n> \n> BUT...\n> \n> her kit is not only very technical with multiple combos to learn.. learning to use them on the fly and what combo to use makes her probably one of the hardest champions i have ever had to learn. \n> \n> Its like when you play her you cant think straight. \n> \n> _&quot;Do i R backwards then Q wait for pop and Q... or do i Q than R forward and Q?&quot;_ that kind of thing. \n> _Q then pop up over a wall then Q_\n> _Q then pop up over a wall then E or E through the wall_\n> _do i Q to the side then Q the enemy or do i Q back and R over and Q the enemy?_\n> \n> The combinations are amazing and they take thought and planning and skill. \n> and on top of all of that... the Q is very hard to hit on an enemy with a redirect because it takes so long. and 70% of them in lane ive throne have been dodged. \n> \n> So the reward for the skill shots and the forethought that goes into making her kit work... is what makes her damage justified. \n> \n> \n> i will say that her level one potential is nasty and may need to be scaled down a bit.. look what i did at level 1 with the starting speed boost\n> https://goo.gl/GHTWQK\n\nJa. And that's even WITHOUT accounting for her W. \n\nZoe is insane, she has an infinite number of combos with an infinite number of executions, but as players (specifically Zoe Mains) get better _collectively_ (See Yasuo) and people find the optimal runes and items (Release Yasuo where people rushed IE first xp), these things will be easier  and her WR will go up. That's why eventually we will probably need to scale her back. ^^\n\nEDIT: Also level 1 Q is stronk, but I think  it's mainly because her passive combined with her Q is a lot of early dmg x3","replies":[]}]},{"poster":"Fedoran","date":"2017-11-22T04:29:07.653+0000","up_votes":2,"down_votes":0,"body":"@Riot RainSlight \n\nHow do you think the balance team is going to handle such a high skill cap champion with the Pro Scene?\nWe don't want this to be like Kalista or Azir where they are nerfed to the ground simply because pros can play at such a higher level than normal Elo.\n\nI am really interested to hear any thoughts","replies":[]}]},{"poster":"karolmo","date":"2017-11-21T16:06:37.654+0000","up_votes":3,"down_votes":30,"body":"***","replies":[{"poster":"MrNuclearPumpkin","date":"2017-11-21T16:09:32.022+0000","up_votes":31,"down_votes":1,"body":"> [{quoted}](name=karolmo,realm=EUW,application-id=3ErqAdtq,discussion-id=7X6s6tVu,comment-id=0000,timestamp=2017-11-21T16:06:37.654+0000)\n>\n> People said yasuo sucked?\n> \n> in what world do you live on\n\nActually yeah. When Yasuo first came out, people said that he was trash. No one knew how to play him. So he had a pretty low winrate on release. So Riot decided to buff him. Problem was, when people finally learned how to play him, he was incredibly too strong and had to get nerfed.","replies":[{"poster":"Kai Guy","date":"2017-11-21T16:37:44.619+0000","up_votes":12,"down_votes":0,"body":"Let me back this up. People would TILT massively if you picked Yasuo for about the first week and a half. It took a pro or streamer building{{item:3087}}  and showing its massive impact on his laneing for the community to not flame if you picked him. Also on the list of \"bad\" on release champions. {{champion:126}} {{champion:432}} {{champion:223}} {{champion:136}} {{champion:163}}    Now I do concede that some of them did require some adjustments from riot but at one point all of the above received what I consider excessive buffs because community was playing them inefficiently.","replies":[{"poster":"Kloqdq","date":"2017-11-21T18:19:29.389+0000","up_votes":11,"down_votes":1,"body":"{{champion:516}} \n\nForgot one.\n\nIf we count bad as in buggy than we also have {{champion:427}} {{champion:268}}\n\nLike Azir was legit unplayable on release.","replies":[{"poster":"Nevrankroaton","date":"2017-11-21T21:23:01.375+0000","up_votes":9,"down_votes":0,"body":"Na, Ornn was very clunky and had too much window of mistake with not enough combat stat. Honestly, you just tune accordingly his W and he will be perfect. They went from letting W be 'weak' to be 'I am the real shyvana biatch'.","replies":[]},{"poster":"flibitydoo","date":"2017-11-21T21:02:37.781+0000","up_votes":5,"down_votes":0,"body":"I remember one of the first bugs on azir was literally \"he presses w on a tower\" \"tower stops shooting. forever\".\n\nand then they made him unplayable by disabling him from being played and I think they also shut down ranked queues because doing that was broken AF","replies":[{"poster":"Kloqdq","date":"2017-11-21T21:28:22.553+0000","up_votes":2,"down_votes":0,"body":"God if you go down the patch notes there was always like 3-5 bug fixes for Azir. His buffs were bug fixes lol.","replies":[]}]},{"poster":"SpecterVonBaren","date":"2017-11-21T20:26:42.854+0000","up_votes":3,"down_votes":0,"body":"Because he was disabled people. When he says he was legit unplayable, he means that literally. \n\n(Not talking to you but to those who read your post)","replies":[{"poster":"Kloqdq","date":"2017-11-21T20:30:10.869+0000","up_votes":2,"down_votes":0,"body":"He was live for a bit though but yeah he was disabled.\n\nIt was a meme to have Azir in the patch notes just for bug fixes for like a whole year since his release.","replies":[]}]}]}]},{"poster":"nm1010","date":"2017-11-21T16:12:33.036+0000","up_votes":3,"down_votes":0,"body":"It was buffs and bug fixes, if I remember right on release it was pretty common for his e q to just not do any damage or knock up.","replies":[]}]}]},{"poster":"Lord Phazanor ","date":"2017-11-21T19:46:05.971+0000","up_votes":14,"down_votes":2,"body":"She's not mechanically difficult, she requires you to aim correctly. She needs damage nerfs.  \nBut since their goal is apparently allowing everyone to one shot each other, I guess that's not gonna happen.","replies":[]},{"poster":"Alimentateur","date":"2017-11-21T19:50:27.497+0000","up_votes":7,"down_votes":3,"body":"She is so fucking broken xD\nI mean her Q does 200dmg on lv 1\nwith around 200ap you get her Q dealing up to 900dmg .. what happens if you go for 600ap? xD \nI mean an Enemy leaves their Spawn Point and instantly recieves 730dmg  xD this is so broken \n\nAnd yes i dont understand why ppl say she is hard to play .. im Bronze 3\n\nAlso yes she is very fun to play, but what i love the most about her is that you can see her completly ingame. \nFor alot of Champs you cant even see their Face ingame no matter the way you move them around and this was bothering me all these years, but now finally .. shes so adorable","replies":[{"poster":"Fairyfleur","date":"2017-11-21T21:17:11.297+0000","up_votes":3,"down_votes":6,"body":"I mean, okay? Her Q is telegraphed, takes a long time to set up, and is very thin and easy to miss. It sounds like you're just fighting bad people. Any sensible player would move out of the way or stand behind their minions.","replies":[{"poster":"Alimentateur","date":"2017-11-21T21:58:37.764+0000","up_votes":3,"down_votes":2,"body":"you do realise that her Q is an Aoe that one-shots the minions?\n\nJust played on an alt Acc with her where we had Darius and Garen as Enemy vs me as Zoe and Morgana. \n\nIf your Lane Partner knows that Sleep Targets recieve double the Damage as TRUE Damage .. bye bye tanks :D \nAlso its so fun to use her ulti to lurk into their Jungle and then she shows them this \"you will never catch me\" face and jumps back xD \n\nI wanna reach lv 17 on that alt acc just to see how broken she is with kleptomancy .. through her W she can easily get 20+ active Items&summoner Spells within the first 10min. Once that Match i got 2 Redemptions which you can imagine how the Minion Wave popped","replies":[{"poster":"Fairyfleur","date":"2017-11-21T22:34:40.738+0000","up_votes":2,"down_votes":3,"body":"Her Q won't kill the minions early on, and even if they do that doesn't mean the projectile doesn't stop at the minions. The bonus damage on asleep targets is increased up to a cap of how much the first hit does.","replies":[{"poster":"Somebody Love Me","date":"2017-11-22T00:06:57.922+0000","up_votes":4,"down_votes":1,"body":"Rank 2 Q with enough range is enough to oneshot the caster minions","replies":[{"poster":"Ardond","date":"2017-11-22T02:36:36.451+0000","up_votes":2,"down_votes":1,"body":"but to get that range either all the melee minions have to be dead (which happens but by that point your wave is small enough that the enemy laner can deal), or you have to be almost perpendicular to the wave which leaves you open to getting poked and/or jumped on, especially since you a using your damage to farm instead of poke.","replies":[{"poster":"Somebody Love Me","date":"2017-11-22T03:04:05.372+0000","up_votes":2,"down_votes":1,"body":"No, you can cast it to the side, walk up, then recast it in like a 45 degree angle, to completely dodge the melees, but hit the casters","replies":[{"poster":"Ardond","date":"2017-11-22T03:06:00.412+0000","up_votes":3,"down_votes":1,"body":"this wouldn't get you enough distance to kill the minions, it would deal good damage but it would be about half their hp at best.","replies":[]}]}]}]}]}]}]},{"poster":"Montÿ","date":"2017-11-22T04:31:41.058+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Alimentateur,realm=EUW,application-id=3ErqAdtq,discussion-id=7X6s6tVu,comment-id=0007,timestamp=2017-11-21T19:50:27.497+0000)\n>\n> She is so fucking broken xD\n> I mean her Q does 200dmg on lv 1\n> with around 200ap you get her Q dealing up to 900dmg .. what happens if you go for 600ap? xD \n> I mean an Enemy leaves their Spawn Point and instantly recieves 730dmg  xD this is so broken \n> \n> And yes i dont understand why ppl say she is hard to play .. im Bronze 3\n> \n> Also yes she is very fun to play, but what i love the most about her is that you can see her completly ingame. \n> For alot of Champs you cant even see their Face ingame no matter the way you move them around and this was bothering me all these years, but now finally .. shes so adorable\n\none damaging ability ITS OP NERF :Rage:","replies":[]}]},{"poster":"lolipopevelynn","date":"2017-11-21T20:39:48.005+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=MrNuclearPumpkin,realm=NA,application-id=3ErqAdtq,discussion-id=7X6s6tVu,comment-id=,timestamp=2017-11-21T16:02:36.414+0000)\n>\n> You flat out said she has a high skill ceiling. People are probably gonna go &amp;quot;Zoe sucks! She needs buffs&amp;quot; \n> \n> She&amp;#039;s going to have a low win rate. She&amp;#039;s going to have people saying she&amp;#039;s bad. But this sounds like Yasuo all over again. Yasuo came out, everyone said he sucked (when he didn&amp;#039;t) and he got buffed. Then people figured out how to play him and he became god like levels of OP.\n> \n> Please, just let players figure out how she plays. There&amp;#039;s no point of a high ceiling, if you don&amp;#039;t give players a chance to climb up the ladder to reach the ceiling.\n\nwe go over this every new champion update or release, and every update/release they dont listen.","replies":[{"poster":"Hibeki","date":"2017-11-21T22:28:42.580+0000","up_votes":3,"down_votes":6,"body":"And every new release they are still horribly overtuned. 570 base damage on Q....","replies":[{"poster":"Fairyfleur","date":"2017-11-22T00:37:22.150+0000","up_votes":2,"down_votes":1,"body":"{{champion:516}} {{champion:163}} {{champion:427}} {{champion:497}} {{champion:432}} to name a few.","replies":[{"poster":"Hibeki","date":"2017-11-22T00:42:05.097+0000","up_votes":2,"down_votes":1,"body":"Onnly Rakan and Ornn were not nerfed after release","replies":[{"poster":"Fairyfleur","date":"2017-11-22T00:51:42.201+0000","up_votes":2,"down_votes":1,"body":"Taliyah and Ivern were nerfed? I find that really hard to believe.","replies":[{"poster":"Automated Riven","date":"2017-11-22T01:25:28.365+0000","up_votes":2,"down_votes":0,"body":"Tahliyah was buffed right away, followed by quite a few nerfs. She was actually super OP on release just people didnt like her because of her casting on w. back then you could almost 1 shot with just your e w combo.","replies":[{"poster":"Fairyfleur","date":"2017-11-22T01:38:43.342+0000","up_votes":1,"down_votes":1,"body":"I guess you could do a lot of damage to somebody but that means you'd have to E first and then W; which was really hard because they knew it was coming.","replies":[]}]}]}]}]}]}]}]}