{"poster":"MutedForFeeding","date":"2018-07-26T15:20:56.726+0000","title":"League of Legends y Runa Terra tienen material de sobra para hacer un MMO","subforum":"Charlas Generales","embed":{"description":"Should we build a MMO? Yay or nay? https://t.co/doZs8zkLNX","url":"https://twitter.com/MarcMerrill/status/1021932688259743744","image":"https://pbs.twimg.com/profile_images/923615047963746304/muaEfw79_400x400.jpg"},"up_votes":19,"down_votes":1,"body":"Buenos d&iacute;as a todos/as.\r\n\r\nEn estos d&iacute;as se lanz&oacute; el mapa de Runaterra y un comentario en Twitter del co-fundador de Riot Games haciendo alusi&oacute;n o mejor dicho una broma la aceptaci&oacute;n y apreciaci&oacute;n que tendr&iacute;a un MMO de Runaterra y por consecuencia Reddit, twitter, medios de prensa gamers explotaron con la posible idea de un MMO de League of Legends, y de eso te quiero hablar. LOL tiene una historia riqu&iacute;sima en cultura, lore, etc. est&aacute; tan al nivel de Blizzard cuando sac&oacute; Warcraft o Warhammer  de Games Workshop -aunque Warhammer es mucho m&aacute;s complejo y mucho m&aacute;s largo-.\r\n\r\nEs una jugada arriesgada ya que los MMO&#039;s no gozan de buena salud actualmente pero es por la falta de buenos juegos del g&eacute;nero y el WoW -soy fan de Warcraft y WoW desde hace 10 a&ntilde;os- est&aacute; un poco oxidado y es lo mejor que hay actualmente sin destacar mucho y dentro de poco piensa lanzar su nueva expansi&oacute;n BoA (Battle of Azeroth).\r\n\r\nPero una expansi&oacute;n de LoL? LoL tiene todo para sacar un MMO, tiene ciudades formadas, historias, cultura, folclore y con un equipo de desarrolladores puede sacar un juego de alt&iacute;simo nivel.\r\n\r\nSe imaginan elegir una facci&oacute;n entre las que hay? Se imaginan elegir ser una facci&oacute;n de Freljord y pelear por el ascenso del poder de Ashe, rivalizar con la tribu de Sejuani o pelear contra la bruja de hielo Lissandra? O elegir un bando entre Noxus y Demacia para disputarse la soberan&iacute;a de Runaterra, ser de Ionia y proteger tu pueblo contra los invasores noxianos, o ser un pirata de la llamativa isla de Bilgewater? O ver el legado de Shurima realzarse una vez m&aacute;s, ser un miembro de la isla de las sombras, pelear entre ciudades cient&iacute;ficas como Zaun y Piltover donde predominan la tecnolog&iacute;a steampunk, ponerte a prueba a ti mismo y subir el monte Targ&oacute;n como lo hicieron Pantheon o Tarick, o ser un peque&ntilde;o Yordle en la prospera ciudad de Bundle City, o ser un buscador de tesoros como Ezreal, vivir bajo las profundidades del mar buscando un poder para salvar a tu pueblo como Nami, vivir en las profundidades como Nautilus y muchas cosas m&aacute;s que nos puede ofrecer el grandioso mundo de Runaterra, yo personalmente sue&ntilde;o con que saquen este MMO, la gente necesita algo como esto.\r\n\r\nSaludos y espero que les haya agradado el post si quieren opinar al respecto de manera negativa/positiva o alimentando la imaginaci&oacute;n de lo que podr&iacute;a ser un MMO de LoL bienvenidos.\r\n\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Thotiana","date":"2018-07-26T15:33:47.985+0000","up_votes":8,"down_votes":4,"body":"***","replies":[{"poster":"Shijim4 de Virgo","date":"2018-07-26T15:42:11.643+0000","up_votes":9,"down_votes":0,"body":"Y RIOT tardo 9 años en cambiar el puntero xD","replies":[{"poster":"ImNw","date":"2018-07-26T23:02:03.220+0000","up_votes":1,"down_votes":0,"body":"9 y vamos por mas, para el recap de muerte","replies":[]}]}]},{"poster":"Nabuze","date":"2018-07-26T20:02:31.948+0000","up_votes":7,"down_votes":0,"body":"Creo que tienen miedo porque muchos de los que están en este juego podrían pasarse a ese mmo y abandonar lol. Cuando pase el boom del mmo se van a ir de ambos juegos.\n\nHay un miedo general en agregarle la s con otro juego a riot gameS.\nComo jugadores de lol si hay algo nuevo de riot seguro muchos de nosotros lo probaría y dejaría descuidado el lol aunque sea por un breve periodo de tiempo y no se animan a tomar ese riesgo","replies":[{"poster":"Hensei","date":"2018-07-27T21:31:01.127+0000","up_votes":2,"down_votes":0,"body":"Blizzard sacó World of Warcraft, después sacó Heroes of the Storm, y Overwatch (sin contar a Diablo III y Starcraft II). La gente fue y vino entre sus títulos sin alterar de manera negativa la base de jugadores. \nDespués de todo, mientras los usuarios no dejen de jugar sus juegos ellos no pierden.","replies":[]},{"poster":"Ode to dark","date":"2018-07-26T21:18:43.904+0000","up_votes":1,"down_votes":1,"body":"Oye, es un buen punto y no lo había pensado!!","replies":[]}]},{"poster":"Osid","date":"2018-07-26T17:29:10.753+0000","up_votes":5,"down_votes":0,"body":"Razas:\nVastaya`s\nYordle´s\nHumanos demacianos y noxianos\nHabitantes del desierto de Yurima\nHabitantes de Freljorn\n\nIsla nivel 80 o mazmorras: Jonia - portal al vacio - Isla de Aguas turbias e Islas de las sombras\n\nGG, si Riot no lo hace es por que no quiere..","replies":[]},{"poster":"Humaguaca","date":"2018-07-26T21:39:50.571+0000","up_votes":4,"down_votes":0,"body":"Pienso igual! Mientras veía las cinemáticas pensaba en todo ello. No seria una mala idea en lo absoluto","replies":[]},{"poster":"EdxxEdxx","date":"2018-07-26T16:37:18.818+0000","up_votes":4,"down_votes":0,"body":"Oye, yo lo compraría si fuera de pago, yolo xD","replies":[]},{"poster":"Genthix","date":"2018-07-27T14:26:57.362+0000","up_votes":3,"down_votes":0,"body":"La idea es brillante, hace un tiempo, cuando me entere que riot tenia este proyecto me emocione mucho, WoW y LoL son 2 de mis juegos favoritos y tener un MMo sobre el lore del famoso MOBA es algo que definitivamente tengo qie probar.{{sticker:sg-kiko}}","replies":[]},{"poster":"Ghost Sentinel","date":"2018-07-26T23:34:19.262+0000","up_votes":3,"down_votes":0,"body":"Aparte de jugar lol juego Lineage, es la gran razón por la cual no rankeo seguido en el lol ... Y la verdad me gustaría crearme un pj con los rasgos de mi champ favorito, rengar...\nE ir descubriendo ciudades aventuras quest y todo lo que lleva, seamos honestos Lineage es un juego que murió que fue furor y que perdió muchos Users desde la llegada de dota, lol dota 2 etc... Y es verdad creo que league of Legends perdería mucha gente si crearán este nuevo juego, no obstante creo que ya perdieron muchos Users ... El método de penalizacion del lol es muy malo, se prioriza el chat antes que la actitud si bien insultar está de más, el juego siempre penaliza al que se queja con o sin razón no al que te arruina una partida por capricho, un mmo sería distinto, ya no se necesitaría tanto el trabajo en equipo ... Sería bueno verlo y probarlo. Ojalá llegue a verlo ... Saludos.","replies":[]},{"poster":"MolotovKiller","date":"2018-07-26T15:30:38.518+0000","up_votes":5,"down_votes":2,"body":"Riot tiene un problema para crear un MMO de facciones. Tiene DEMASIADAS. WOW por ejemplo se saca de encima ese problema estableciendo que es un conflicto entre las dos fuerzas mas grandes: Horda y Alianza. Warhammer tiene mas facciones si, pero es un juego de estrategia. TESO podria ser el que mas se le acerca, pero siguen siendo tres que pelean por el control de Cyrodiil y la Capital.\nUn MMO donde el jugador se pudiera unir a x facción daria pie a sobrepoblaciones o a que determinadas facciones queden \"rodeadas\" por otras, como el Vacio. Eso sin contar de la enorme carga y gasto de recursos que implica un MMO.\nAhora, si se animan a hacerlo, lo mejor que podrian hacer es darle rienda suelta al jugador y que ellos manejen todo, economia, manufactura, construcción, etc. El jugador se une a una ciudad inicial y despues dejarle hacer la suya. Si quiere unirse a los conflictos con su facción, se une, si quiere ser un herrero o comerciante más, lo hace. Si quiere recorrer el mundo cual aventurero, que lo haga y si quiere ser un Freljordiano que quiere sumarse a las filas noxianas, demacianas o lo que sea, también. \nSi lo hacen asi estoy casi al 100% seguro de que triunfan y no solo eso, sino que le podrian plantar cara a titanes como Warframe o WOW.","replies":[{"poster":"Ðreizehn","date":"2018-07-27T21:33:16.049+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MolotovKiller,realm=LAS,application-id=v7qsfXsE,discussion-id=Ay2otUgg,comment-id=0000,timestamp=2018-07-26T15:30:38.518+0000)\n>\n> Riot tiene un problema para crear un MMO de facciones. Tiene DEMASIADAS. \n\nseria buenisimo si lo hicieran bien, imaginate que tendrian material para hacer muchisimos eventos (imaginate una guerra entre piltover, shurima, zaun, noxus, demacia, etc) si lo hacen bien podrian llegar a superar al wow (PD: soy un fanatico del wow y si se que seria dificil superarlo)               \n {{sticker:slayer-pantheon-rainbows}}","replies":[]},{"poster":"Shijim4 de Virgo","date":"2018-07-26T15:41:19.676+0000","up_votes":2,"down_votes":0,"body":"Guild war 2 tiene 6 creo y con lol podrian hacer lo mismo.","replies":[{"poster":"MolotovKiller","date":"2018-07-26T16:19:42.001+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shijim4 de Virgo,realm=LAS,application-id=v7qsfXsE,discussion-id=Ay2otUgg,comment-id=00000000,timestamp=2018-07-26T15:41:19.676+0000)\n>\n> Guild war 2 tiene 6 creo y con lol podrian hacer lo mismo.\n\nPatinaste pa, no tiene seis facciones, tiene cinco razas, no es lo mismo.","replies":[]}]}]},{"poster":"Plomonator","date":"2018-07-27T18:41:07.764+0000","up_votes":2,"down_votes":0,"body":"Al leer eso la emoción me saco lagrimas{{champion:32}}","replies":[]},{"poster":"Yosoyuntomate","date":"2018-07-27T17:31:24.150+0000","up_votes":2,"down_votes":0,"body":"Yo entro solo para hacer misiones y a veces aram. Un mmorpg estaría bueno pero creo que debería ser algo entre ragnarok y diablo de ser online o un oblivion o fable si es offline.","replies":[]},{"poster":"Bloshan","date":"2018-07-26T17:51:52.841+0000","up_votes":2,"down_votes":0,"body":"WOW. Me encantaria y sin dudas me la pasaria jugando ahi todo el tiempo. Pero ese es un problema porque si lanzan un mmo de lol el lol en si va a morir. Y los de riot lo que menos quieres es eso. Por otro lado no creo que vaya a salir ya que es MUY complicado hacer todo eso pero creo que si lo hacen  va a ser lo mejor del mundo.","replies":[]},{"poster":"Geeik","date":"2018-07-26T16:45:43.266+0000","up_votes":3,"down_votes":1,"body":"Y si en vez de facciones no hay nada que te reprima? Siempre y cuando tengas un significado?\n\nEjemplo: Eres freljordiano, pero naciste en X filas y te quieren unir a las de trundle, lo haces y pimpam, pero si vuelves a las otras, no tendras las mismas recompensas por chaquetero.\n\nEres shurimano pero no quieres ir a conflictos de Shurima, sino que te vas a Zaun a armar líos.\n\nOsea tu no eliges la faccion pero te vas uniendo lentamente a una u otra, puedes ser espía, etc.","replies":[]},{"poster":"ParedSinRevoque","date":"2018-07-26T17:23:47.912+0000","up_votes":4,"down_votes":2,"body":"Yo creo que es mas seguro sacar un juego de cartas.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"MolotovKiller","date":"2018-07-28T00:13:38.472+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ParedSinRevoque,realm=LAS,application-id=v7qsfXsE,discussion-id=Ay2otUgg,comment-id=0004,timestamp=2018-07-26T17:23:47.912+0000)\n>\n> Yo creo que es mas seguro sacar un juego de cartas.\n> \n> {{sticker:slayer-pantheon-popcorn}}\n\nDe hecho es todo lo contrario. Actualmente hay una suerte de trinidad dominando el mercado, Hearthstone de Blizzard (El rey practicamente), The Elder Scrolls Legends de Bethesda (que anda medio medio) y el Gwent de CD Projekt Red (que es bastante solido). Todos los que salieron despues cayeron como piedras por la sobresaturación de ese modelo.","replies":[]}]},{"poster":"jumpalo","date":"2018-07-28T01:30:41.457+0000","up_votes":1,"down_votes":0,"body":"yo me conformaría con una película","replies":[]},{"poster":"Phantasm","date":"2018-07-27T07:38:07.928+0000","up_votes":1,"down_votes":0,"body":"sin animos de ofender a nadie, no creo q sea rentable para ellos el publico de este juego esta dirigido a los adolescentes menores de 15 y uno se da cuenta q no cuentan con una pc ni de gama media para jugar lol uno lo ve a diario pocos fps razones de algunos afk en los juegos. Además si no es mensual como wow tendrá microtransaciones y muchas otras dificultades mucho menos te van a hacer un juego con graficos al minimo otra vez volvemos a wow donde algunos no pueden jugar legion porque pide mas requisitos y pagan apenas la mensualidad se lee mucho este tipo de cosas en los foros sobre esa parte técnica. Otro ej de un juego q comenzó bien y termino mal black desert.","replies":[{"poster":"MolotovKiller","date":"2018-07-28T00:15:33.788+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Phantasm,realm=LAS,application-id=v7qsfXsE,discussion-id=Ay2otUgg,comment-id=000d,timestamp=2018-07-27T07:38:07.928+0000)\n>\n> sin animos de ofender a nadie, no creo q sea rentable para ellos el publico de este juego esta dirigido a los adolescentes menores de 15 y uno se da cuenta q no cuentan con una pc ni de gama media para jugar lol uno lo ve a diario pocos fps razones de algunos afk en los juegos. Además si no es mensual como wow tendrá microtransaciones y muchas otras dificultades mucho menos te van a hacer un juego con graficos al minimo otra vez volvemos a wow donde algunos no pueden jugar legion porque pide mas requisitos y pagan apenas la mensualidad se lee mucho este tipo de cosas en los foros sobre esa parte técnica. Otro ej de un juego q comenzó bien y termino mal black desert.\n\nLa edad no es impedimento pá. Y las microtransacciones, si son netamente cosmeticas, no traen problemas. Sin contar de que no necesitas un pc de la nasa para mover un MMORPG. Guild Wars 2 se ve bastante bien con una placa medio baratita. Y en su momento me acuerdo de poder jugar Archeage con una integrada sin problemas la verdad.","replies":[]}]},{"poster":"Deathtrooper","date":"2018-07-27T05:33:38.577+0000","up_votes":1,"down_votes":1,"body":"Con todo esto del mapa nuevo, nadie penso en un juego de estrategia tipo el civilization o age? Elegís una faccion y peleas por el dominio de Runaterra, vas mejorando tu partida y vas consiguiendo capitanes o campeones de tu faccion (que serian los campeones del lol), ejercitos de yordles. humanos, muertos vivientes peleando entre si. Tendrias la partida normal y pvp online. No tendria tanto exito como un mmo quizas pero no necesariamente tiene que ser actualizado todo el tiempo. Sale el 1, luego de un par de años el 2 y asi, ademas abriría las puertas a que nuevos jugadores se interesen en el LOL.","replies":[]},{"poster":"Galiers","date":"2018-07-27T02:09:16.595+0000","up_votes":1,"down_votes":1,"body":"mmm naaa con lo que demoran en sacar un parche... además con lo money lover que son en riot quizas te cobren por todo:\n\nacceso a la  alpha cerrada $30 dolares\nacceso a la beta cerrada $30 dolares\npack de inicio beta abierta $30 dolares\npack de inicio lanzamiento $30 dolares\nskins\nser premium\nmateriales\netc\n\nseria muy Pay to Win","replies":[]},{"poster":"Emissang","date":"2018-07-26T17:55:02.770+0000","up_votes":1,"down_votes":1,"body":"Más que un MMO preferiría algo tirando mas a lo que fue TES:Skyrim, ya que aveces en los mmo se pierde la inmersión por el grindeo y la cantidad de players random que te encontras, (al menos a mi me suele pasar muchísimo)\nAdemás que tener muchas facciones en un mmo termina siendo engorroso y difícil de balancear, en un rpg es más fácil ya que solo las desparramas a lo ancho y largo del mapa y esperas que el personaje principal se tropiece con alguna y decida o no unirseles.\nTambién podrían poner algo como en mount and blade, donde vos podías elegir como comenzar tu camino (Siendo una bandido, un don nadie, el hijo de un rey caido en desgracia, etc)\nEn realidad creo que Riot TIENE que hacer un juego más relacionado con el mundo que ya crearon, muchos que jugamos este juego (yo mi incluyo) lo seguimos jugamos más por el lore que por el juego en sí. \nNo digo que tiene que ser si o si un MMO, puede ser tipo skyrim, dark souls, the witcher etc.","replies":[]}]}