{"poster":"Il Re Gilgamesh","date":"2019-01-08T15:49:50.038+0000","title":"Sono di più i troll/AFK o gli smurf?","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Salve a tutti,\r\nprima di continuare a leggere ti vorrei chiedere di votare nel sondaggio pi&ugrave; sotto, in modo da non influenzare il tuo voto. Quando parlo di smurf, comunque, mi riferisco a Plat+ che giocano in Silver-, non Silver che giocano in Iron.\r\n\r\nCome ben saprete ormai, nelle proprie partite &egrave; pi&ugrave; probabile imbattersi in un troll/AFK nella squadra avversaria piuttosto che nella propria. Il motivo sta nel fatto che nella vostra squadra oltre a voi, che naturalmente non potete essere un troll/AFK, ci saranno solo altre 4 persone, in quella avversaria invece saranno addirittura 5 i potenziali troll/AFK. \r\nSono d&#039;accordo la statistica non fa una piega.\r\nC&#039;&egrave; un altro fattore per&ograve; a &quot;sbilanciare&quot; il matchmaking e quindi la partita. Gli smurf. E quelli, per lo stesso motivo, sono pi&ugrave; facili da incontrare nella squadra avversaria e quando capita, sono cavoli amari. Certo, da queste persone c&#039;&egrave; davvero molto da imparare anche affrontandole, per&ograve; purtroppo questo rovina un po&#039; l&#039;esperienza di chi vuole migliorare e salire fronteggiando gente del suo stesso ELO.\r\nNegli ultimi anni ho notato che gli smurf sono davvero tanti, soprattutto negli elo pi&ugrave; bassi.\r\nLo scopo di questa discussione non &egrave; flammare gli smurf o i troll/AFK o la Riot, lo scopo della discussione vuole essere quello di capire assieme quale &egrave; la reale situazione attuale. Gli smurf &quot;bilanciano&quot; i troll? Quanti smurf ci sono in low elo? Al crescere dell&#039;elo il rapporto smurf/trollo rimane costante?\r\n\r\nSpero abbiate votato prima di arrivare alla fine come richiesto, in caso contrario spero che siate sinceri mettendo ci&ograve; che veramente vi frulla per la testa.\r\nInoltre spero che la discussione rimanga serena e costruttiva.\r\n\r\nP.S. non ho idea di come risolvere il &quot;problema&quot; degli smurf \r\n\r\nCiao!","replies":[{"poster":"Pellah","date":"2019-01-08T17:24:03.000+0000","up_votes":4,"down_votes":0,"body":"A diamond ci sono relativamente più smurf e meno afk/troll rispetto all'elo basso btw.\nComunque sotto il plat credo ci siano più troll/afk che smurf.\n\nParlo per esperienza personale :)","replies":[]},{"poster":"The Prey","date":"2019-01-10T22:09:58.003+0000","up_votes":1,"down_votes":0,"body":"Una cosa triste, i troll esistono in tutti elo  perche senno LOL non ha piu senzo senza di loro{{summoner:13}} . Anche persino in Challenge vedere 0/10/0{{champion:157}}  e' tutto normale~{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Giggio","date":"2019-01-09T11:00:02.884+0000","up_votes":1,"down_votes":0,"body":"Più smurf in bronzo ferro che altro poi per  me un gold che sta in silver con un altro account non è uno smurf sta solo finendo di livellare","replies":[]},{"poster":"Clearωay","date":"2019-01-09T00:03:28.109+0000","up_votes":1,"down_votes":0,"body":"In low elo gli smurf sono pochi e i troll/afk tanti, in elo più alto ci sono più smurf e meno afk/troll. Semplicemente perché uno smurf diamond in silver nemmeno ci passa (lascia stare il bug dell'mmr che risolvono prossimamente), o se ci passa ci sta 3 game e poi va oltre.","replies":[]}]}