{"poster":"Nathan Explosion","date":"2016-11-13T23:46:33.716+0000","title":"GG riot no avisa que el emparejamiento esta roto","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":5,"body":"https://k60.kn3.net/89927469B.png\nQuise jugar una flex q y me encuentro con esto, 3 silvers y dos oros low vs 1 diamante, 1 platino, 1 oro y 2 silver obviamente me sali y que tiren remake antes de que todos en mi team pierdan tiempo\n\nEntro a reddit y todos se estan quejando del emparejamiento https://www.reddit.com/r/leagueoflegends/comments/5cpv4w/iwilldominate_from_nalcs_to_bronze_5_in_one_season/\n\n&iquest;tanto cuesta poner un cartel que diga que las flex Q no se emparejan logicamente?\n\n\nPara colmo me borraron el tema de la seccion charlas generales para que no sea visible y me mandaron a crearlo aqui, si no me estoy quejando de la comunidad me estoy quejando de como manejan estas situaciones ¿que culpa tienen los jugadores del emparejamiento ?","replies":[{"poster":"Chocolatada Fria","date":"2016-11-13T23:50:46.645+0000","up_votes":6,"down_votes":2,"body":"Anoche me toco jugar contra dos diamantes un bronce y dos golds, y en mi team eramos todos golds nomas muy desequilibrado","replies":[]},{"poster":"K I N G K U K I","date":"2016-11-13T23:50:50.487+0000","up_votes":3,"down_votes":5,"body":"Es obvio que se juntarán todos contra todos, si es una clasificatoria NUEVA donde todos vendrían siendo Unrankeds, si no te sientes con el nivel de jugar ranked contra gente de mejor elo, juega normal hasta que saquen las SoloQ/DuoQ, así de simple.","replies":[{"poster":"Nathan Explosion","date":"2016-11-13T23:54:43.534+0000","up_votes":5,"down_votes":3,"body":"El problema es que ya jugue las diez de posicionamiento en ese modo y por lo tanto me tendria que tocar con gente de elo bajo ya que perdi todas no contra un diamante y un platino, no me deberian tocar unrankeds ya que segun el sistema soy peor que el jugador promedio","replies":[{"poster":"K I N G K U K I","date":"2016-11-14T00:04:25.891+0000","up_votes":3,"down_votes":5,"body":"Y cómo sabes tú que ese Diamante de SoloQ no quedó en bronce en las Flex? Es un todos contra todos, la gente de elo bajo que no se sienta capaz ni tenga la habilidad para subir que no las juegue y ya, puede estar desbalanceado de alguna manera, eso no lo niego, pero va en ti si entras a jugar o no, nadie les obliga a jugar las Flex sí o sí, sin embargo todos lloran luego de hacerlo.","replies":[{"poster":"Nathan Explosion","date":"2016-11-14T00:54:02.277+0000","up_votes":4,"down_votes":0,"body":"Ese tipo no habia completado las de 10 emparejamiento, es totalmente estupido que me toque jugar con el ya sea viendo que es diamante en soloQ o unranked en flex, es mejor en todos los sentidos que yo y lo mismo con el platino","replies":[]},{"poster":"HA2AN","date":"2016-11-14T00:59:29.521+0000","up_votes":3,"down_votes":0,"body":"si todos \"lloran\" es por que no funciona bien el emparejamiento es aburrido ser stompeado y stompear siempre","replies":[]},{"poster":"Nathan Explosion","date":"2016-11-14T20:14:09.841+0000","up_votes":1,"down_votes":0,"body":"Te llenaron de negativos y sacaron la cola por lo mismo que me estuve quejando encima de plus a faker le toco jugar vs bronces, suerte en tu vida de foro comentando cosas sin saber\n\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/0im5Vi06-inconvenientes-con-la-cola-flexible-deshabilitada","replies":[]}]}]}]},{"poster":"Zaroiy","date":"2016-11-14T00:43:24.963+0000","up_votes":1,"down_votes":0,"body":"si sumas V I IV IV IV  = 18 al igual que el otro team","replies":[]},{"poster":"Chisolin","date":"2016-11-13T23:47:29.034+0000","up_votes":2,"down_votes":7,"body":"¿Tanto cuesta leer las notas del parche?","replies":[{"poster":"Mad Marx","date":"2016-11-13T23:49:25.173+0000","up_votes":6,"down_votes":3,"body":"Para avisar que Tham kench esta bugeado en ascension se avisa en el juego pero para cosas importantes las notas del parche que bien...","replies":[]}]}]}