{"poster":"warrior530","date":"2016-01-13T13:34:04.052+0000","title":"Lol Portable?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Creo que ser&iacute;a una buena opcion para aquellos que trabajamos desde distintas pc (y si, tengo la posibilidad de jugar), o somplemente juegan en otros computadores, y no tener que estar 2 horas descargando o media hora copiando archivos\r\n\r\nActualmente lo tengo en USB y lo juego desde ah&iacute; (obviamente en mi pc instalado ._.), pero en ocasiones al jugar desde otra pc me causa problemas y ocupa mucho espacio :V","replies":[{"poster":"Galiers","date":"2016-01-13T14:29:04.711+0000","up_votes":1,"down_votes":0,"body":"lol es portable, tu juego instalado puedes copiarlo a un disco duro externo y luego copiarlo a otro pc sin tener que descargar todo de nuevo\n\nlamentablemente si lo que estas pensando es en una versión resumida de lol, sin audios por ejemplo no se puede ya que el check de archivos del juego pide tener todos los archivos y con sus respectivos tamaños... por lo que tampoco te sirve tener todos los archivos pero los audios con 0Kb","replies":[{"poster":"NoxusOP15","date":"2016-01-13T14:36:22.549+0000","up_votes":2,"down_votes":0,"body":"El verificador del parcheador es una porquería. Solamente verifica si estan presentes los archivos, no si estan integros sin errores,\n> [{quoted}](name=Galiers,realm=LAS,application-id=v7qsfXsE,discussion-id=nare4M2e,comment-id=0001,timestamp=2016-01-13T14:29:04.711+0000)\n>\n> lol es portable, tu juego instalado puedes copiarlo a un disco duro externo y luego copiarlo a otro pc sin tener que descargar todo de nuevo\n> \n> lamentablemente si lo que estas pensando es en una versión resumida de lol, sin audios por ejemplo no se puede ya que el check de archivos del juego pide tener todos los archivos y con sus respectivos tamaños... por lo que tampoco te sirve tener todos los archivos pero los audios con 0Kb\n\nY el lol no es portable, porque si dices que lo es todos los juegos, programas, etc son portables. Portable es aquel programa que se puede copiar en un dispositivo de almacenamiento. Cuando instalas un juego en este caso el LoL, el instalador crea registos para hacer que el juego sea correcto, es complicado. El portable en cambio, no registra nada porque no se instala, y al no hacer eso, la computadora no \"entiende\" como instalado, solo como un programa que se ejecuta","replies":[]},{"poster":"NoxusOP15","date":"2016-01-13T14:33:58.269+0000","up_votes":1,"down_votes":0,"body":"El verificador del parcheador es una porquería. Solamente verifica si estan presentes los archivos, no si estan integros sin errores,","replies":[]}]},{"poster":"DarkAngelSebasu","date":"2017-03-11T22:16:36.251+0000","up_votes":1,"down_votes":0,"body":"Yo quiero saber si esto se puede hacer con un juego como tf2, sé como convertir en portable un juego instalado, sin embargo no sé si se hace lo mismo con uno como aquel que funciona con una plataforma de juegos.\nAlguien versado en el tema que por favor me aydue.","replies":[]},{"poster":"Sonya Kyron","date":"2016-01-13T23:19:30.615+0000","up_votes":1,"down_votes":0,"body":"Yo tengo el LOL subido a internet en 7 partdes tipo \"instalador\" es lo que mejor me funciono, copiar 1 archivo de 1GB es mas rapido que 10.000 archivos que suman 1Gb.","replies":[]},{"poster":"FrozenTracker","date":"2016-01-13T15:42:50.303+0000","up_votes":1,"down_votes":0,"body":"en una parte de riot soporte  dice que si lo conectas a un cable de inter (para las pc de escritorio) carga mas rapido los archivos :$ no se si te sirva xd{{summoner:4}}","replies":[]},{"poster":"NoxusOP15","date":"2016-01-13T14:14:18.963+0000","up_votes":1,"down_votes":1,"body":"Yo lo que hice fue pasar el juego completo de raíz, a la memoria usb (SD Card), y lo dejo ahi y se puede jugar en cualquier lado, solo que si sale una actualización se descarga una vez en el usb y no se descarga de nuevo. Eso es ventajoso. Por otro lado el problema es la memoria libre que le quede al usb, el juego pesa 5 gb, hasta ahora. Se recomienda una usb de 8 gb (te quedan 7,41 gb, te mienten con el \"8 gb\"), pero mejor una de 16 gb, porque nunca se sabe cuanto puede pesar, ademas las transacciónes de archivos hacen que crezcan bastante, pasa cuando se actualiza, de 4,91 gb, puede pasar a 5,90 gb.","replies":[{"poster":"JACKY FANBOY","date":"2016-01-13T15:40:40.001+0000","up_votes":1,"down_votes":0,"body":"intento pasarlo a una SDcard de 16, pero demoro mucho\nestoy copiando los archivos pero no se si existe alguna manera mas facil","replies":[]}]},{"poster":"Galiers","date":"2016-01-13T15:27:29.282+0000","up_votes":1,"down_votes":0,"body":"yo lo he copiado desde mi pc a un disco externo y de ese disco externo a otro pc recien formateado y ha funcionado sin ningun problema","replies":[]},{"poster":"josuke","date":"2016-01-13T15:40:41.259+0000","up_votes":1,"down_votes":3,"body":"http://2.bp.blogspot.com/-QPaP3fTml8I/VSkjLUZIK3I/AAAAAAAABYk/5RPORcyY9JQ/s1600/Locos-Adams-Denunciado-vagonettas.gif","replies":[]}]}