{"poster":"Sharjo","date":"2015-07-23T23:05:00.305+0000","title":"And while we dig in to Act 2, here, Extended Stories for GP, TF and Graves!","subforum":"Story, Art, & Sound","up_votes":67,"down_votes":2,"body":"Long stories were added to the champion pages of Malcolm Graves, Tobias \"Twisted\" Fate and Gangplank! Go check &#039;em out at these links.\n\nhttp://gameinfo.na.leagueoflegends.com/en/game-info/champions/gangplank/\n\nhttp://gameinfo.na.leagueoflegends.com/en/game-info/champions/graves/\n\nhttp://gameinfo.na.leagueoflegends.com/en/game-info/champions/twistedfate/\n\nI just wanna stop for a second and pay respect to Gangplank, the dude who stole from Zed _and_ Swain. All hail to the Reaver King baby!","replies":[{"poster":"Solidair3","date":"2015-07-23T23:55:44.523+0000","up_votes":29,"down_votes":0,"body":"So his name is really Tobias... I thought we'd never know!\n\nThis is such a nice thing. Thank you, @Riot!","replies":[{"poster":"RiotJaredan","date":"2015-07-24T00:43:18.940+0000","up_votes":27,"down_votes":2,"body":"You're welcome! Glad you are enjoying it so far.","replies":[{"poster":"Siachi","date":"2015-07-24T00:55:37.561+0000","up_votes":6,"down_votes":0,"body":"Woo! So does this mean the tech issues are (maybe) resolved and longer lores can start rolling out? Haven't checked in-client yet.","replies":[{"poster":"RiotJaredan","date":"2015-07-24T01:00:07.276+0000","up_votes":17,"down_votes":1,"body":"Yup. Still work to do on formatting and links etc. but we can start putting some of the text up that we want. I've done a dev blog to explain a few things that will likely go out next week. I hope you like the new content.","replies":[{"poster":"Scarborough Fair","date":"2015-07-24T01:02:33.393+0000","up_votes":5,"down_votes":0,"body":"I'm loving the flood of new lore!\nI hate to be that person but, are we going to see extended Shurima/Shadow Isles lore after the event is over?","replies":[{"poster":"RiotJaredan","date":"2015-07-24T01:31:42.889+0000","up_votes":13,"down_votes":1,"body":"There will be some, yes, at least a couple of short story additions. Eventually, full character introductions in the same vein as those you see for Graves, T (for Tobias) F, and Gangplank.","replies":[{"poster":"BetaDude40","date":"2015-07-24T02:20:30.737+0000","up_votes":8,"down_votes":0,"body":"Well congratulations Jaredan. Not only have you passed my expectations, but you also seem to somehow be doing better than some of the other departments (at least in this specific point in time).\n\nNow please, for the love of god, do not stop doing stuff like this. If this trend continues, then I will be willing to absolve most of my previous grudges against the lore team.","replies":[]}]}]}]}]}]}]},{"poster":"Ebonmaw Dragon","date":"2015-07-23T23:37:01.717+0000","up_votes":20,"down_votes":0,"body":"{{champion:238}} Ninjas vs {{champion:41}} Pirates\n\n.... Soon\n\nPS: My favorite part of the Graves lore is the \"[Boxed Text]\" ","replies":[{"poster":"RiotJaredan","date":"2015-07-24T00:52:54.678+0000","up_votes":17,"down_votes":1,"body":"Whoops. We'll look into that.","replies":[{"poster":"DrCyanide","date":"2015-07-24T16:19:15.386+0000","up_votes":1,"down_votes":0,"body":"Could you also look into Twisted Fate being \"an infamous card sharp\" (his lore, the event page). I'm fairly certain you meant \"shark\".","replies":[{"poster":"RiotJaredan","date":"2015-07-25T22:28:10.467+0000","up_votes":5,"down_votes":0,"body":"Nope, we meant \"sharp.\" It's the original usage. Card shark is a later version of the phrase (possibly a malapropism that has become common usage). They're virtually the same in regard to meaning, but card sharp (or cardsharp) has a longer history of being used to imply cheating.","replies":[{"poster":"Sharjo","date":"2015-07-25T22:41:21.400+0000","up_votes":2,"down_votes":0,"body":"See I automatically assumed it was incorrect because I've only ever heard \"cardshark\", but now I've looked it up and yes, Jaredan's totally right. Now to see how many more people will get tripped up by this!","replies":[]}]}]},{"poster":"UncIe Zed","date":"2015-07-24T20:20:41.166+0000","up_votes":2,"down_votes":0,"body":"With a legendary zed skin teaser plz {{item:3070}} {{champion:238}} {{item:3070}}","replies":[]}]},{"poster":"SaltyToplaneGoat","date":"2015-07-23T23:43:36.408+0000","up_votes":3,"down_votes":0,"body":"That will deserve it's own event...\n\nAnd... maybe we will get a ninja-pirate champion? xD I mean, it's Riot, so it's possible xD","replies":[{"poster":"Sharjo","date":"2015-07-23T23:46:39.972+0000","up_votes":7,"down_votes":0,"body":"The captain of a crew of ninjas who are also pirates. \n\nMy body is ready.","replies":[]}]}]},{"poster":"Kei143","date":"2015-07-24T01:34:53.263+0000","up_votes":9,"down_votes":0,"body":"You might want to add this (new lore announcement) to the event website for those that don't read forums. It'll get you a bit more exposure for all the hard work !!\n\nQuestion, since I don't know how these work, as I'm not a Lore camper: Would the event lore still be available after the event ends? You guys spent so much time onto it, I hope you can provide a link from the main web to it!!\n\n\n\nAnd I'm Loving this lore for the event! It makes me engage in it so much more than just playing league.","replies":[{"poster":"Pabro","date":"2015-07-24T01:45:31.252+0000","up_votes":19,"down_votes":0,"body":"The Bilgewater Microsite will stay on after the event, so yes.","replies":[{"poster":"RiotJaredan","date":"2015-07-24T01:57:15.648+0000","up_votes":18,"down_votes":0,"body":"By the way all, Pabro is a huge reason all of these lovely things are here for you to see. He rocks you like a hurricane.","replies":[{"poster":"Legacy of Xion","date":"2015-07-24T05:17:13.916+0000","up_votes":4,"down_votes":3,"body":"Jaredan, can you explain why you change get TF and Graves' rival from one of betrayal (which worked and was a great idea) to one where Graves is too thick-skulled to listen to T.F to hear what really happened?\n\nWhy. Why, praytell, did you changet their betrayal dynamic to a single fucking misunderstanding?","replies":[{"poster":"RiotJaredan","date":"2015-07-24T05:21:07.444+0000","up_votes":13,"down_votes":1,"body":"You're assuming that T.F.'s side of things is completely correct. Let's chat about it after Act 3. This isn't the right time.","replies":[{"poster":"Legacy of Xion","date":"2015-07-24T15:46:53.720+0000","up_votes":4,"down_votes":1,"body":"I'm not referring to the Acts of Burning Tides I'm referring directly at T.F's long lore on the website that directly retcon and changes the Gambler's entire motivation. There's no mention of the betrayal in his lore, and it makes it seem like he has had the magic for his entire life. That COMPLETELY changes the motivations of each charcter.","replies":[{"poster":"Gorgannan","date":"2015-07-24T22:34:01.739+0000","up_votes":2,"down_votes":1,"body":"Yeah, while Graves lore is great, I'm really not liking the new TF. It completely changes the lore I've loved since the beginning of my time playing League and it's a cop out \"They can both be perfect characters minus a misunderstanding.","replies":[{"poster":"RiotJaredan","date":"2015-07-25T22:33:32.696+0000","up_votes":2,"down_votes":0,"body":"They're definitely not perfect characters, it's their flaws that have led them into the present conflict, and the events that separated them long ago.","replies":[]}]}]}]}]}]},{"poster":"5000000000000000","date":"2015-07-24T03:12:54.923+0000","up_votes":7,"down_votes":0,"body":"Wait, is your title \"Event Broducer?\"\nGreat title, bro. Could you share some of the job descriptions?","replies":[]}]}]},{"poster":"SaltyToplaneGoat","date":"2015-07-23T23:22:06.869+0000","up_votes":19,"down_votes":1,"body":"*dies of Lore overload*\n\nThere is so much... information. (O_O)","replies":[{"poster":"UomoAfide","date":"2015-07-23T23:32:32.592+0000","up_votes":6,"down_votes":0,"body":"Same for me, just can't wait to se what the long lore for Shuriman characters will be","replies":[]}]},{"poster":"Hellioning","date":"2015-07-24T00:20:10.726+0000","up_votes":5,"down_votes":0,"body":"Having the short stories and the biographies in the same place threw me for a bit; I'd like to see those more obviously separated. Other than that, I like all three.","replies":[{"poster":"Jeddy017","date":"2015-07-24T00:35:56.990+0000","up_votes":2,"down_votes":1,"body":"Yeah,they could use some form of separation & not have it all run together.\n\nSomething like:\n>*Summary*\n\"Blah blah bla\"\n\n>*Extended lore*\n\"Blah blah bla\"\n\n>*Short Story #1*\n\"blah blah bla\"\n\nBut formatting the stuff should be very simple to do & I'm sure they'll get it done eventually.\n\nEDIT:I just realized we all thought the same thing about the \"adding long lore to website while summary in client\" & that took nearly a year to get done because of issues.So I suppose I shouldn't say \"it should be simple to do.\"","replies":[{"poster":"RiotJaredan","date":"2015-07-24T00:54:57.495+0000","up_votes":9,"down_votes":0,"body":"This is much more simple to take care of. Once Bilgewater: Burning Tides sails off into the sunset, we'll sort the format out.","replies":[{"poster":"Jeddy017","date":"2015-07-24T01:18:44.382+0000","up_votes":1,"down_votes":0,"body":"I hope so.\nI don't want to wake up one day to find out you guys can't format the lore because Riot Bob spilled coffee all over Riot's computers & on the same day Riot Mary's pet dinosaur ate all the written lore she was holding on to while everyone celebrated RiotTeemo4Lyfe's birthday & wedding.","replies":[{"poster":"RiotJaredan","date":"2015-07-24T01:32:39.659+0000","up_votes":13,"down_votes":0,"body":"Riot Bob really needs to take care of his shaky hand problem. Ironically, it's the coffee.","replies":[]}]}]}]},{"poster":"RiotJaredan","date":"2015-07-24T00:54:04.772+0000","up_votes":6,"down_votes":0,"body":"Yup, we've got work to do on format, but we just wanted to get the info up on there first. Thanks for the feedback!","replies":[]}]},{"poster":"WutsKraken","date":"2015-07-24T04:27:08.344+0000","up_votes":10,"down_votes":0,"body":"Why does Gangplank have no Taunts vs Zed or Swain? After that lore dang he needs them","replies":[]},{"poster":"A Superb Villain","date":"2015-07-24T00:21:13.659+0000","up_votes":8,"down_votes":1,"body":"So... Twisted Fate now leaves behind a card as his... well... calling card.\n\nHmm...\n\n{{champion:51}}","replies":[{"poster":"Sharjo","date":"2015-07-24T00:23:50.114+0000","up_votes":3,"down_votes":0,"body":"You and I think alike it seems...\n\n( ͡° ͜ʖ ͡°)","replies":[{"poster":"A Superb Villain","date":"2015-07-24T00:27:19.363+0000","up_votes":10,"down_votes":0,"body":"Not only that, but there is a \"flame-haired woman\" with \"a matching pair of pistols\" trying to collect the _bounty_ on his head in the short story.\n\n{{champion:21}}","replies":[]}]}]},{"poster":"RiotJaredan","date":"2015-07-24T00:42:16.101+0000","up_votes":9,"down_votes":0,"body":"You beat me to it, Sharjo! Thanks for pointing it out.","replies":[{"poster":"Sharjo","date":"2015-07-24T00:45:48.835+0000","up_votes":5,"down_votes":0,"body":"I watch the champion pages like a Hawk now, but today I got distracted and remembered almost as soon as I was done taking in Burning Tides Act 2. I was pleasantly surprised!","replies":[]}]},{"poster":"Jeddy017","date":"2015-07-23T23:52:49.845+0000","up_votes":7,"down_votes":0,"body":"1 thing to say about TF's lore,it doesn't mention anything about Dr. Xavier Rath or his experiment.I guess it's something not mentioned yet or Riot decided to retcon it to focus in on TF's gambler nature.I wonder if he still have [his desire for magical power](http://leagueoflegends.wikia.com/wiki/Twisted_Fate/Background).","replies":[{"poster":"Sharjo","date":"2015-07-23T23:55:44.802+0000","up_votes":9,"down_votes":0,"body":"If you look at the earlier part of his description, it says he learned card magic from his original home. So TF's had this magic for a good many years.","replies":[]},{"poster":"Acolyte of Steel","date":"2015-07-24T04:43:12.596+0000","up_votes":6,"down_votes":2,"body":"I do wish they'd kept Rath around. It made TF and Graves two victims of circumstance, and showed that neither of 'em was truly evil despite that TF sold Graves out....under the assumption that Graves was stealing from him! Priggs was the real snake.\n\nBah... I was feeling so good about Act II a minute ago, but now that I've learned this, I've come to realize that TF just isn't the TF I held dear. Fuckin' Riot...\n\nI think this is the moment I finally give up on lore entirely. {{item:3110}}","replies":[{"poster":"GoForkUrself","date":"2015-07-24T05:10:33.249+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Summoner Ezraqel,realm=NA,application-id=6kFXY1kR,discussion-id=BH3csgmK,comment-id=00040001,timestamp=2015-07-24T04:43:12.596+0000)\n>\n> I do wish they'd kept Rath around. It made TF and Graves two victims of circumstance, and showed that neither of 'em was truly evil despite that TF sold Graves out....under the assumption that Graves was stealing from him! Priggs was the real snake.\n> \n> Bah... I was feeling so good about Act II a minute ago, but now that I've learned this, I've come to realize that TF just isn't the TF I held dear. Fuckin' Riot...\n> \n> I think this is the moment I finally give up on lore entirely. {{item:3110}}\n\nThe lore hints at Graves not knowing the true story behind what happened. I am liking the new lore.","replies":[{"poster":"Acolyte of Steel","date":"2015-07-24T05:19:44.889+0000","up_votes":7,"down_votes":1,"body":"Ye, but it's largely obvious that the old lore between them was abandoned. Graves wanted to get rich, and TF backed out knowing it was too dangerous - for **whatever** reason, that being irrelevant given the circumstance between them. That was almost said outright during Graves and TF's bickering in Act II: What happened doesn't matter anymore. \n\nIndeed, it was the same in the old lore. Graves and TF were going to have to kill each other at some point, but the reason why it was so was much more thought provoking and told a stronger moral lesson. I get the impression Riot has given up on the whole \"moral lesson\" thing that I loved so much. Hell, the whole moral lesson thing is why I'm a Summoner! I loved the way the IoW interjected, and all this time have been eagerly waiting and aching to see what they would do with a living world!\n...They threw it away, that's what they did. RIP, too hard.","replies":[]}]}]}]},{"poster":"A Superb Villain","date":"2015-07-24T00:09:15.880+0000","up_votes":8,"down_votes":0,"body":"Gangplank's hobby is pretty much trolling every dangerous figure of authority in Runeterra by stealing their belongings.\n\nEdit:\nAlso, Noxus now has blood cults.\n\n{{champion:8}} \"I always wanted to start a cult... so I did!\"","replies":[{"poster":"SaltyToplaneGoat","date":"2015-07-24T00:14:33.869+0000","up_votes":3,"down_votes":0,"body":"Wait. Did I overread something? Where did you find that about the cult?","replies":[{"poster":"A Superb Villain","date":"2015-07-24T00:19:29.933+0000","up_votes":5,"down_votes":0,"body":"Gangplank's lore; the Noxian that speaks up is described as \"a huge warrior with blood-cult tattoos upon his face .\"","replies":[{"poster":"SaltyToplaneGoat","date":"2015-07-24T00:23:58.067+0000","up_votes":6,"down_votes":0,"body":"Ah, I almost missed that.\n\nWell, no surprise. Now we have the old aristocracy, the black rose and the blood cult fighting for power in Noxus, Swain and the military somewhat inbetween. Why do I get this feeling that the state is in some kind of constant internal behind-the-scenes civil war?","replies":[{"poster":"OuttaControl56","date":"2015-07-24T05:02:24.622+0000","up_votes":5,"down_votes":0,"body":"Because that's basically Noxus in a nutshell. Ambition against Ambition is always going to lead to that sort of friction!","replies":[]}]}]}]}]},{"poster":"Brutusness","date":"2015-07-24T01:02:48.431+0000","up_votes":7,"down_votes":0,"body":"He took my boy {{champion:50}} 's boat! This won't be tolerated!","replies":[{"poster":"Crowe Stalker","date":"2015-07-24T02:38:42.932+0000","up_votes":3,"down_votes":0,"body":"I find it really weird how Gangplank stole Swain's Warship. I mean, aside from that, these two seem like a great match for each other: Swain rose through the Military with a Crippled Leg, Gangplank shows none of his pain or weakness. Gangplank commands near absolute loyalty from his crew and rewards them, some Noxian commands asked for **DEMOTIONS** to join Swain's unit and now he's in a position to reward them, having already awarded Darius with the title 'The Hand of Noxus'\n\nNow if Gangplank stole Demacia's Flagship then these two'd make absolutely amazing allies, near inseparable arguably. Instead, Gangplank has to be So Evil or So 'Badass' that he steals from the Bad Guys.","replies":[]}]}]}