{"poster":"Sharjo","date":"2016-01-13T20:27:10.035+0000","title":"Jhin's VO is here!","subforum":"Story, Art, & Sound","embed":{"description":"This is the voice for the new champion Jhin. Note: The Voice might not be final, you never know what tweaks Riot might make to it. For League of Legends Related News Check Out Surrender@20: http://www.surrenderat20.net/ Feel Free to Follow me on Twitter as well: https://twitter.com/SkinSpotlights","url":"https://www.youtube.com/watch?v=QwQ3i9L0j74&feature=youtu.be&a","image":"https://i.ytimg.com/vi/QwQ3i9L0j74/maxresdefault.jpg"},"up_votes":44,"down_votes":0,"body":"Have a listen to League&#039;s newest serial killer!","replies":[{"poster":"Stars Shaper","date":"2016-01-13T20:35:27.010+0000","up_votes":4,"down_votes":0,"body":"I really like that there is music playing in background each time.","replies":[{"poster":"Sharjo","date":"2016-01-13T20:36:28.651+0000","up_votes":30,"down_votes":0,"body":"Best part is that it's only present in the VO only a Jhin player would here, implying it's all in his head.\n\nI LOVE IT.","replies":[{"poster":"Stars Shaper","date":"2016-01-13T20:38:43.448+0000","up_votes":5,"down_votes":0,"body":"http://images.popmatters.com/film_art/p/phantom-of-the-opera.jpg Intensifies (6:22 too)","replies":[]}]}]},{"poster":"Trolosaurus","date":"2016-01-13T20:52:44.102+0000","up_votes":15,"down_votes":0,"body":"\"Red _is_ a primary color\"\n\nhttp://i1.kym-cdn.com/photos/images/original/001/062/429/a5e.png\n\noh shit\n\nAlso in one quote he says good isn't enough, it needs to be perfect\nA few minutes later he says perfection isn't good enough\nOh dear I think I've fallen in love with this guy","replies":[{"poster":"KING OF MASKS","date":"2016-01-13T21:36:14.259+0000","up_votes":17,"down_votes":0,"body":"I was hoping for \"Green is not a creative color\" as a follow-up line","replies":[]}]},{"poster":"Rendarkan","date":"2016-01-13T22:19:02.246+0000","up_votes":13,"down_votes":0,"body":"\"I thought diamonds were a girl's best friend.\" - Taunt to {{champion:44}} \n\nhttp://i.ytimg.com/vi/uZYktoPTB9Q/hqdefault.jpg","replies":[{"poster":"Pikmints","date":"2016-01-14T05:59:40.133+0000","up_votes":4,"down_votes":0,"body":"http://imgur.com/gallery/LlRDVXf","replies":[]}]},{"poster":"Stars Shaper","date":"2016-01-13T20:58:20.128+0000","up_votes":4,"down_votes":1,"body":"HOLY SHIZELORDS\n\nSo.. from what I could grasp from the final sentences in his VO.. this guy have been imprisoned by the Order of Twilight (and probably tortured, hence his prothesises) and specifically by Shen's father (No wonder his VU/Rework came along :P).\n\nAlso, the Noxian invasion is canon now.","replies":[{"poster":"Sharjo","date":"2016-01-13T21:04:39.708+0000","up_votes":12,"down_votes":0,"body":"The invasion's always been canon, we just aren't sure on how it was resolved, if it even has been in the new lore.","replies":[{"poster":"RiotJaredan","date":"2016-01-16T07:05:35.991+0000","up_votes":3,"down_votes":0,"body":"Not telling until we do some showing.","replies":[{"poster":"Sharjo","date":"2016-01-16T14:20:21.388+0000","up_votes":2,"down_votes":0,"body":"DAMN YOU JAREDAN. Ah well, I'm looking forward to finding out regardless!","replies":[]}]}]}]},{"poster":"A Superb Villain","date":"2016-01-13T21:49:57.291+0000","up_votes":4,"down_votes":0,"body":"I feel. . . inspired.","replies":[{"poster":"Vellich0r","date":"2016-01-13T23:50:47.143+0000","up_votes":3,"down_votes":0,"body":"Ahh, but you make such crude art. Too... Quick, and not nearly enough... _music_","replies":[{"poster":"A Superb Villain","date":"2016-01-14T00:00:06.282+0000","up_votes":4,"down_votes":0,"body":"My work is poetry, and brevity is the soul of wit.","replies":[{"poster":"Vellich0r","date":"2016-01-14T00:08:21.469+0000","up_votes":9,"down_votes":0,"body":"So are you saying you prefer your work to be short?","replies":[{"poster":"A Superb Villain","date":"2016-01-14T00:12:45.185+0000","up_votes":6,"down_votes":0,"body":"ಠ_ರೃ","replies":[]},{"poster":"HighH1","date":"2016-01-14T01:42:34.395+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Marik Winters,realm=NA,application-id=6kFXY1kR,discussion-id=eA8WqcgK,comment-id=000e000100000000,timestamp=2016-01-14T00:08:21.469+0000)\n>\n> So are you saying you prefer your work to be short?\n\n{{champion:45}} IS THAT A SHORT JOKE","replies":[]}]},{"poster":"Ralanr","date":"2016-01-14T01:10:17.787+0000","up_votes":2,"down_votes":0,"body":"You're a poet?  Cool.","replies":[]}]}]},{"poster":"Ralanr","date":"2016-01-13T23:36:36.619+0000","up_votes":2,"down_votes":0,"body":"Perhaps a villainous team up?","replies":[{"poster":"A Superb Villain","date":"2016-01-13T23:46:10.238+0000","up_votes":2,"down_votes":0,"body":"Ha ha!\n\nWhile I can appreciate his vivid technique, Jhin lacks a certain vision. He is too invested in his performance and its execution, completely disregarding the consequences.\n\nDeath is a means to an end, not the end itself.","replies":[{"poster":"Noam Braumsky","date":"2016-01-14T03:10:29.772+0000","up_votes":1,"down_votes":0,"body":"But Death is merely the catalyst, which leads to true art.","replies":[{"poster":"A Superb Villain","date":"2016-01-14T03:15:07.279+0000","up_votes":1,"down_votes":0,"body":"Exactly!\n\nWhy devote so much energy to a spark when the real beauty lies in the eruption that follows? He glorifies the cause, not the effect.","replies":[{"poster":"Dreamspitter","date":"2016-01-14T04:40:04.698+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=A Superb Villain,realm=NA,application-id=6kFXY1kR,discussion-id=eA8WqcgK,comment-id=000e0000000000000000,timestamp=2016-01-14T03:15:07.279+0000)\n>\n> Exactly!\n> \n> Why devote so much energy to a spark when the real beauty lies in the eruption that follows? He glorifies the cause, not the effect.\n\nMaybe because, that would be something static. Unmoving. \n\nI wonder, would Illaoi say he is \"in motion\"?","replies":[]}]}]}]}]}]},{"poster":"Splision","date":"2016-01-13T20:50:04.732+0000","up_votes":8,"down_votes":0,"body":"\"When they find you... they will cry.\"\n\nThat one actually scared me a little. Awesome VO and a great job to the voice actor and Riot.","replies":[]},{"poster":"ArbiterOfTruth","date":"2016-01-13T20:34:32.689+0000","up_votes":7,"down_votes":0,"body":"It has a certain unnerving effect to it. It's full of passion, but crazy as hell.","replies":[]},{"poster":"Decrit","date":"2016-01-13T21:36:02.225+0000","up_votes":6,"down_votes":0,"body":"Guys.\nChill for a second.\n\nHe has some interaction with many Ionians, mostly about killing obviously.\n\nthen, he drops this:\n\n\"I remember your master. He was worth remembering\"\n\n...Yasuo? \n\nHe has exactly later on an interaction, presumably with Zed, that says \"You were wrong to kill your master, I needed him for this performance\", sooo","replies":[]},{"poster":"Trolosaurus","date":"2016-01-13T20:38:31.068+0000","up_votes":6,"down_votes":0,"body":"....Mr. Jefferson?","replies":[]},{"poster":"SpecterVonBaren","date":"2016-01-13T21:40:38.032+0000","up_votes":2,"down_votes":2,"body":"I think its all but confirmed that we finally have the mysterious C from Caitlyn's background. Listen to his voice lines in the last four minutes, he says things like, \"Your father tried to censor me\" and such. We totes got a Hannibal Lector scenario in the game now.","replies":[{"poster":"Sharjo","date":"2016-01-13T21:49:41.236+0000","up_votes":5,"down_votes":0,"body":"Or it's a directed at Shen, considering his Ionian origins.","replies":[{"poster":"SpecterVonBaren","date":"2016-01-13T21:54:38.241+0000","up_votes":1,"down_votes":1,"body":"And where are you getting that he's from Ionia? He seems to have comments towards lots of different people and he looks like he's from Piltover.","replies":[{"poster":"Sharjo","date":"2016-01-13T22:03:41.241+0000","up_votes":3,"down_votes":0,"body":"\"My dear countryman, you remind me how little our culture has advanced.\"\n\"The Noxian invasion should be a wake-up call. We need more elaborate productions.\"\n\nSome champion taunts from Jhin, that seem to be directed at Lee Sin specifically.","replies":[{"poster":"A Superb Villain","date":"2016-01-13T22:08:43.669+0000","up_votes":1,"down_votes":0,"body":"Is it possible the invasion is the catalyst for his madness? It is implied that he performed in Ionia, and considering how reserved the nation is, I sincerely doubt he indulged in his _exceptional_ tastes on stage.","replies":[{"poster":"Decrit","date":"2016-01-13T22:19:14.193+0000","up_votes":1,"down_votes":0,"body":"There is the short bio that states he is Ionian","replies":[{"poster":"A Superb Villain","date":"2016-01-13T22:29:16.749+0000","up_votes":1,"down_votes":0,"body":"I never said he wasn't?","replies":[{"poster":"Decrit","date":"2016-01-13T22:35:35.848+0000","up_votes":1,"down_votes":0,"body":"Sorry, i replied to the wrong comment :P","replies":[{"poster":"A Superb Villain","date":"2016-01-13T22:36:30.726+0000","up_votes":1,"down_votes":0,"body":"I was so confused.","replies":[{"poster":"Decrit","date":"2016-01-13T23:23:51.362+0000","up_votes":1,"down_votes":0,"body":"It was a though, full, and weird day mate xD\n\nIt' s the witching hour where I live @_@","replies":[{"poster":"A Superb Villain","date":"2016-01-13T23:31:24.837+0000","up_votes":2,"down_votes":0,"body":"Get your beauty sleep. We need you looking your best.","replies":[]}]}]}]}]}]}]}]},{"poster":"Stars Shaper","date":"2016-01-13T22:01:15.692+0000","up_votes":2,"down_votes":0,"body":"\"Our land should have learnt from Noxian invasion that we need innovation\" or smt like that","replies":[]}]}]}]},{"poster":"Brutusness","date":"2016-01-14T03:33:39.657+0000","up_votes":4,"down_votes":0,"body":"It seems a lot of people are comparing Jhin to Sander Cohen, from Bioshock. However, I think his personality resembles Dr. Steinman as well, especially if you remember what Steinman yells at you before your fight.\n\n\"What can I do with this one, Aphrodite? She won't stay still! I want to make them beautiful, but they always turn out wrong! That one, too fat! This one, too tall! This one, too symmetrical! And now... what's this, goddess? An intruder! He's ugly, ugly, ugly... UGLY!\"","replies":[]},{"poster":"Dreamspitter","date":"2016-01-13T22:05:04.878+0000","up_votes":4,"down_votes":0,"body":"Your life had no value before me.\n\nArt is worth the pain.\n\nBeauty is pain.\n\nI will make you FAMOUS!\n\nYou WILL perform!\n\nHow can we make this fresh?\n\nSmiles everyone, smiles!\n\nWhen they find you, they will cry.\n\nPlaces everyone, places!\n\nSing for me!\n\nThere is NO drama is a peaceful death!\n\nStart the music. I will make them dance.\n\nArt must exist beyond reason.\n\nThey call me mad, all artists are mad.\n\nI am misunderstood -beauty cant be evil.\n\nI am PURE. My work is PURE.\n\nArt should terrify. \n\nI am a slave to this passion.\n\nI swear every performance is the last, but I lie every time.\n\nSmiles, and screams, I bring both.\n\nThe **ecstasy** of opening night!\n\nA costume, some make up, a spray of blood...\n\nI provide catharsis for my clients, and my victims.\n\nI get nervous before every performance, but I need that feeling.\n\nMmm -the **ecstasy** of killing. \n\nThis would be easier, if blood came in more colors.\n\n_Yes_, the gun is ironic.\n\nI can't live without the euphoria of performance (laugh)\n\n","replies":[{"poster":"Decrit","date":"2016-01-13T22:18:36.242+0000","up_votes":4,"down_votes":0,"body":"\"FABULOUS\"","replies":[]}]},{"poster":"Rakvir","date":"2016-01-14T03:16:48.129+0000","up_votes":1,"down_votes":0,"body":"I know it's appropriate for him but I was aggravated by the music accompanying his voice. It was quite aggravating. I am so, SO glad that others have a new champion to look forward to but I can guarantee you he will not be ever purposely bought by me.","replies":[{"poster":"Dreamspitter","date":"2016-01-14T04:30:52.976+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Rakvir,realm=NA,application-id=6kFXY1kR,discussion-id=eA8WqcgK,comment-id=002a,timestamp=2016-01-14T03:16:48.129+0000)\n>\n> I know it's appropriate for him but I was aggravated by the music accompanying his voice. It was quite aggravating. I am so, SO glad that others have a new champion to look forward to but I can guarantee you he will not be ever purposely bought by me.\n\nDid you hear the story behind how they created it? It was fascinating, this technique.\n\n\n\n>[RiotUtora](https://www.reddit.com/r/leagueoflegends/comments/40typ9/voice_jhin_the_virtuoso/cyxb541?context=3) 186 points 4 hours ago* \n\n>Thanks everyone for the kind words re: Jhin’s VO! I’ve seen alot of questions and a few misconceptions so I thought I’d take some time to answer questions, clear up a few things, and provide you guys with some info about how we made the voice for this creeper!\nFirst off - Jhin’s VO processing. Jhin has two different processing “recipies” for his VO kit. One for the lines only Jhin can hear (Move / Attack / Recall ) and the other for lines that everyone can hear (Spell Efforts, Taunts, Emotes, etc).\n>\n>Only Jhin can hear the lines infused with the choir. The idea here is that this is how Jhin hears himself - the choir music plays in his demented mind. You’ll notice he has several lines referencing opera, the stage, performance, music, etc etc. The choir background was done to support all of this. So hopefully players after a few games playing as Jhin and then playing against him will understand he’s thinking to himself instead of actually speaking. The choir sounds come directly from the choir used in the promo teaser music as well as the upcoming login music.\n>\n>All of the other lines - taunts, spell efforts, emotes - anything allies and enemies can hear - are all processed with a more standard “normal dude behind a mask” filter. This was done intentionally to create contrast between lines Jhin actually speaks vs lines Jhin thinks to himself - the thought here is that this will further solidify his sadistic and psychopathic mentality. There is actually one interaction with Jhin’s kit where an enemy champion will hear Jhin’s choir infused VO - i’ll leave that for you guys to discover.\nThe idea for the choir came very early on when EdtheConqueror (Kindred’s composer) and I had our first talk about Jhin. I asked “What are you thinking for his music?” Ed already knew and immediately replied “24 piece choir”. And that was that. That was the hook and I knew from that conversation that the choir was going to play a critical role in his SFX and VO package.\n>\n>Like all Champ VO - it’s a group effort. Jhin’s writer Odin (Tahm Kench, Illaoi) wrote some incredible lines. Actually let's be honest - he wrote a bajillion lines because when we went to record - we didn’t have a complete kit from design and we had a tight deadline. So normally we’d write like 70-80 move lines and pick the best from that pool leaving us with 40-50 of the best lines. Odin wrote HUNDREDS so we could cover our bases when the kit was finally complete and then pick and chose what worked best. There are also lines for abilities that didn’t exist after we recorded them and lines written for abilities that were too long or just didn’t work. Now every champ has lines that are cut, but I think it’s safe to say that Jhin has the largest pool of unused lines and I’m wondering if we couldn’t do a director's cut type thing where we process them all out and just release all of them for fun. And obviously our voice actor nailed the character perfectly in every way.\n>\n>While all of Jhin’s spoken lines are finished - I still have some fun non-verbal easter eggs in store for him that’ll I’ll be adding during his run on PBE. I really love watching people experience new champs on PBE because I can identify some cool places to implement these little polishing tweaks.\n>\n>Now for some background on how the choir sound was achieved. Sorry if this gets too technical or too rambly - hopefully some of you will find this interesting.\n>\n>The choir sound in the lines were achieved through an audio design process that has been around for awhile but this was my first time trying to use it. So this was very much a grand experiment for me - and it almost didn’t happen (for reasons we can maybe get into later.) The process involves Reverb and utilizing things called Impulse Responses (from here on out we’ll call them IRs). An IR is a recording of the reverberation caused by an acoustic space. So really what we’re talking about is a recording of how fast a sound travels across a space, how quickly it fills a space, and how many times the sound bounces around and in what direction, before finally diffusing, ending it’s reverberation. Think about the difference in reverberation if you were to clap your hands in your bedroom versus clapping your hands inside a cave or concert hall. The ringing out - or reverberation is immensely different.\n>\n>Audio Designers nowadays have access to very, very powerful reverb applications where we can import our own IRs and “fake” a sound playing in any space we want. I can record the sound of myself clapping in my studio and then import the impulse response from Radio City Music Hall or the impulse response from the Sistine Chapel, making the recording of my hand clap sound like it was emitting from a particular location in those spaces.\n>\nNow for Jhin we did something a little weird and imported various processed clips of the choir music from the promo teaser and the upcoming login music as the IR. These are not typical IRs, they’re pieces of music. But hopefully you guys can hear how the choir kind of ebbs and flows and wraps and weaves around his dialogue. We’re not playing choir samples on top of his voice. It’s literally as if the sound of the choir is the space, and Jhin’s VO is being played inside of that space. Does that make sense?\n>\n>Jhin has seven different choir IRs that yield vastly different effects. “And now...the curtain….rises”. This IR is a choir sample pitched waaaaaaay down to create that ominous dark atmosphere vibe. The other IRs sound, well, more like an actual choir. I think 70% or so of the lines use the same IR because it was just so good. The way the choir sound bends and wraps around the words change so much from line to line. It’s almost as if the choir is singing specifically to those exact words. It's difficult to explain - hopefully this makes sense.\n>\n>Ok this is way too long - sorry guys. I hope you enjoy his VO as much as I enjoyed working on it.","replies":[]}]},{"poster":"Starfish H","date":"2016-01-14T02:49:03.453+0000","up_votes":3,"down_votes":0,"body":"Jesus Christ I think I need to clean my pants now.","replies":[]},{"poster":"nosafterburn","date":"2016-01-16T14:33:25.614+0000","up_votes":2,"down_votes":0,"body":"lol \"That hat is rediculous. XD Who let you wear that horrible thing?\" best line in there","replies":[]},{"poster":"Hollandiae","date":"2016-01-14T02:18:37.295+0000","up_votes":2,"down_votes":0,"body":"Sander Cohen, is that you?\n\nAh! That Beatles reference at 14:16! Now I'm hyped.","replies":[]},{"poster":"A Superb Villain","date":"2016-01-14T01:42:31.286+0000","up_votes":2,"down_votes":0,"body":"Some additional notes posted by Riot Utora on Reddit:\n\n> Thanks everyone for the kind words re: Jhin’s VO! I’ve seen alot of questions and a few misconceptions so I thought I’d take some time to answer questions, clear up a few things, and provide you guys with some info about how we made the voice for this creeper!\n> \n> First off - Jhin’s VO processing. Jhin has two different processing “recipies” for his VO kit. One for the lines only Jhin can hear (Move / Attack / Recall ) and the other for lines that everyone can hear (Spell Efforts, Taunts, Emotes, etc).\n> \n> Only Jhin can hear the lines infused with the choir. The idea here is that this is how Jhin hears himself - the choir music plays in his demented mind. You’ll notice he has several lines referencing opera, the stage, performance, music, etc etc. The choir background was done to support all of this. So hopefully players after a few games playing as Jhin and then playing against him will understand he’s thinking to himself instead of actually speaking. The choir sounds come directly from the choir used in the promo teaser music as well as the upcoming login music.\n> \n> All of the other lines - taunts, spell efforts, emotes - anything allies and enemies can hear - are all processed with a more standard “normal dude behind a mask” filter. This was done intentionally to create contrast between lines Jhin actually speaks vs lines Jhin thinks to himself - the thought here is that this will further solidify his sadistic and psychopathic mentality. There is actually one interaction with Jhin’s kit where an enemy champion will hear Jhin’s choir infused VO - i’ll leave that for you guys to discover.\n> \n> The idea for the choir came very early on when EdtheConqueror (Kindred’s composer) and I had our first talk about Jhin. I asked “What are you thinking for his music?” Ed already knew and immediately replied “24 piece choir”. And that was that. That was the hook and I knew from that conversation that the choir was going to play a critical role in his SFX and VO package.\n> \n> Like all Champ VO - it’s a group effort. Jhin’s writer Odin (Tahm Kench, Illaoi) wrote some incredible lines. Actually let's be honest - he wrote a bajillion lines because when we went to record - we didn’t have a complete kit from design and we had a tight deadline. So normally we’d write like 70-80 move lines and pick the best from that pool leaving us with 40-50 of the best lines. Odin wrote HUNDREDS so we could cover our bases when the kit was finally complete and then pick and chose what worked best. There are also lines for abilities that didn’t exist after we recorded them and lines written for abilities that were too long or just didn’t work. Now every champ has lines that are cut, but I think it’s safe to say that Jhin has the largest pool of unused lines and I’m wondering if we couldn’t do a director's cut type thing where we process them all out and just release all of them for fun. And obviously our voice actor nailed the character perfectly in every way.\n> \n> While all of Jhin’s spoken lines are finished - I still have some fun non-verbal easter eggs in store for him that’ll I’ll be adding during his run on PBE. I really love watching people experience new champs on PBE because I can identify some cool places to implement these little polishing tweaks.\n> \n> Now for some background on how the choir sound was achieved. Sorry if this gets too technical or too rambly - hopefully some of you will find this interesting.\n> \n> The choir sound in the lines were achieved through an audio design process that has been around for awhile but this was my first time trying to use it. So this was very much a grand experiment for me - and it almost didn’t happen (for reasons we can maybe get into later.) The process involves Reverb and utilizing things called Impulse Responses (from here on out we’ll call them IRs). An IR is a recording of the reverberation caused by an acoustic space. So really what we’re talking about is a recording of how fast a sound travels across a space, how quickly it travels across a space, and how many times the sound bounces around, resonating across a space before finally diffusing, ending it’s reverberation. Think about the difference in reverberation if you were to clap your hands in your bedroom versus clapping your hands inside a cave or concert hall. The ringing out - or reverberation is immensely different.\n\n> Audio Designers nowadays have access to very, very powerful reverb applications where we can import our own IRs and “fake” a sound playing in any space we want. I can record the sound of myself clapping in my studio and then import the impulse response from Radio City Music Hall or the impulse response from the Sistine Chapel, making the recording of my hand clap sound like it was emitting from a particular location in those spaces.\n> \n> Now for Jhin we did something a little weird and imported various processed clips of the choir music from the promo teaser and the upcoming login music as the IR. These are not typical IRs, they’re pieces of music. But hopefully you guys can hear how the choir kind of ebbs and flows and wraps and weaves around his dialogue. We’re not playing choir samples on top of his voice. It’s literally as if the sound of the choir is the space, and Jhin’s VO is being played inside of that space. Does that make sense?\n\n> Jhin has seven different choir IRs that yield vastly different effects. “And now...the curtain….rises”. This IR is a choir sample pitched waaaaaaay down to create that ominous dark atmosphere vibe. The other IRs sound, well, more like an actual choir. I think 70% or so of the lines use the same IR because it was just so good. The way the choir sound bends and wraps around the words change so much from line to line. It’s almost as if the choir is singing specifically to those exact words. It's difficult to explain - hopefully this makes sense.\n> \n> Ok this is way too long - sorry guys. I hope you enjoy his VO as much as I enjoyed working on it.","replies":[]},{"poster":"Ralanr","date":"2016-01-13T23:37:42.669+0000","up_votes":1,"down_votes":0,"body":"\"There is no drama in a peaceful death!\"\n\nOh my fucking god I love this.  He's obsessed, he's insane, and oh my god this character...This is gonna be sweet.\n\nEdit: \"I love to perform, but hate crowds.\"\n\nStage fright?","replies":[{"poster":"The Goldmeister","date":"2016-01-14T00:56:39.261+0000","up_votes":2,"down_votes":0,"body":"Maybe that's why he's long ranged and can hide and ult and stuff 0_0 \n\nWooooah","replies":[]}]}]}