{"poster":"JavelinJoe","date":"2016-11-14T21:14:13.585+0000","title":"Towers should gain attack speed based on the ratio of enemy to ally champions underneath them","subforum":"Gameplay","up_votes":3,"down_votes":4,"body":"The default value (0.83) would remain the same, but when the number of enemy champions under a tower is greater than the number of allied champions defending underneath, the attack speed is raised by the difference. Ex, 3 enemies go top lane to pressure the tower. Being a solo top and the jungle is not their yet, the ratio is 3:1. So the tower would gain 2 attack speed (2.83 total). This works out really well because it really pressures tower dives to become much more clean and efficient, which honestly they should be because you are &quot;risking&quot; your life for a kill advantage. You do not want to mess that up and end up giving a kill. Also, more champions means more damage / DPS to that tower and its defending champions. So this should not impact the ability to take towers too much. You just would need a coordinated attack to minimize how much time you needed.\n\n This provides some relief to those champions who struggle against tower diving experts ({{champion:23}} {{champion:64}} {{champion:60}}  {{champion:240}} {{champion:2}} etc...) because they would need to worry about the tower if they manage to kill the defending champion or the defending champion leave the range. This change would not denying them the ability to tower dive like they currently can as long as the ratio would still be 1 there for making the attack speed buff not able to apply (there needs to be more enemies than allies to apply the buff).","replies":[{"poster":"I am Pacman","date":"2016-11-14T21:35:51.914+0000","up_votes":2,"down_votes":0,"body":"You realize what kind of Gatling guns towers would become?","replies":[{"poster":"JavelinJoe","date":"2016-11-15T01:07:53.296+0000","up_votes":1,"down_votes":0,"body":"how often are 4-5 champions taking an uncontested tower where they dont have a buff of some kind?","replies":[]}]},{"poster":"Koala Calamity","date":"2016-11-14T21:20:01.319+0000","up_votes":1,"down_votes":0,"body":"An extra attack per second is more than a little overtuned. Tower sieging would generally be made more difficult since the more enemy champs present, the faster the tower waveclears. Bot lane CSing under tower would also be negatively affected. Super, promoted, and cannon minions would be killed super fast too, reducing the value of taking inhibitors, banner of command, and baron.","replies":[]}]}