{"poster":"Imsomnio","date":"2019-07-26T02:41:07.833+0000","title":"Trampas, bugs, y personas que se aprobechan","subforum":"Teamfight Tactics","up_votes":4,"down_votes":2,"body":"Buenas gente, eh estado jugando en clasificadoras y hay personas que usan trampas y bugs, me han tocado casos de que tengan todos los pjs con items y mas en el inventario (utilizando un bug para hacerlo), gente que gano con 100 de vida sin posibilidad de que pierdan en ningún momento, personas con pjs a lvl 3 siendo la 5 o 6 ronda (tanta suerte van a tener). \r\nEspero que se venga el ban-hammer en algun momento.\r\n\r\nSaludos.","replies":[{"poster":"romanelpro2","date":"2019-07-26T03:16:11.167+0000","up_votes":2,"down_votes":0,"body":"Tenes alguna prueba que verifique que usan \"trampas\", bugs o programas?, sino no te va a tomar nadie en serio, mucho menos Riot.","replies":[{"poster":"Imsomnio","date":"2019-07-26T23:42:54.907+0000","up_votes":1,"down_votes":0,"body":"En las proximas tft voy a sacar screen shoot, la verdad es desalentador asi, gente con economia perfecta y 3 pjs lvl 3 a lvl 6 gg wp. apenas me toque denuevo saco screen, pero supongo que riot tiene una forma de ver esto en los servidores, es cuestion de tiempo que pongan a alguien a ver esto o como hizo blizzard que pongan un bann-bot cada vez que detecte una trampa.","replies":[{"poster":"romanelpro2","date":"2019-07-27T07:03:55.354+0000","up_votes":2,"down_votes":0,"body":"https://imgur.com/a/x77Z15D\n\nUltima partida, la termine 3:52 am, hace 13 min desde que estoy escribiendo esto, antes de los golems que son los primeros bichos, LOS PRIMEROS, ya tenia practicamente un lucian al 3.\n\nUse hack?, use programas externos?, algo?, no nada, simplemente fue suerte.\n\nHay que bancarse perder, asi y todo perdi la partida, quede cuarto, me gaste 85 de oro, si, OCHENTA Y CINCO de oro buscando una miserable Kayle para hacer nobles, y no me salio.\n\nSabes que hice cuando termine?, decir y bueno... mala suerte, estuve cerca, no vine a crear un post de por que no me salio Kayle si tire 600 rerolls?","replies":[{"poster":"Imsomnio","date":"2019-07-28T22:42:54.205+0000","up_votes":1,"down_votes":0,"body":"Me acaba de pasar lo mismo con kayle ni 1 en todo el game, quede tercero lvl 9 y todos los rerrolls posibles, esperemos que rito lo soluciones. 1 pjs a lvl 3 siendo lvl 5 te creo, pero cuando escribi el post me toco una persona que tenia 3 pjs lvl 3 a lvl 5 o 6 no recuerdo.","replies":[]}]}]}]},{"poster":"Muerto el 9del12","date":"2019-07-26T03:15:49.883+0000","up_votes":1,"down_votes":0,"body":"o los hijos de su madre que se llenan el inventario y en la fase de picks dejan el campeon que elijen, manga de chupachichis","replies":[]}]}