{"poster":"0110100001101001","date":"2015-01-28T16:17:04.070+0000","title":"¿Odias a Fizz? Te doy un consejo para que ellos te odien","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"Con los recientes cambios a {{champion:105}}  en que le han nerfeado muchísimo la Q, la W y un pequeño aumento a la E a costa de darle a la ultimate un debuff de 20% amplificación de daño, te recomiendo que compres {{item:3140}} \r\n\r\nCon ese item te quitaras el pescadito (dejará de estar pegado en tu campeón) por lo tanto, no te hará daño el tiburón y mucho menos, no tendrás el debuff que aumenta el daño que te haga {{champion:105}} por 20%. Como resultado, el potencial de asesinato es comparable a una banana de Soraka.\r\n\r\n¡Muerte al pescado!","replies":[{"poster":"HiroChi","date":"2015-01-28T16:25:03.997+0000","up_votes":2,"down_votes":0,"body":"Ojo que el {{item:3140}} está op para otras ultis como la de Zed","replies":[{"poster":"0110100001101001","date":"2015-01-28T16:27:31.046+0000","up_votes":5,"down_votes":0,"body":"Exacto, mucho más útil si sos adc porque podes mejorarlo a {{item:3139}} \n\nAunque el mejor counter de Zed es el ban (? jajaja","replies":[{"poster":"Runth","date":"2015-01-28T16:33:08.713+0000","up_votes":2,"down_votes":0,"body":"Ejem... tambien la R de WW Ejem... R de skarner... y otros xD","replies":[]}]}]},{"poster":"rokushoger","date":"2015-01-28T16:46:20.365+0000","up_votes":2,"down_votes":0,"body":"También podés intentar evitar al pescadito, que va a dos por hora XD","replies":[{"poster":"0110100001101001","date":"2015-01-28T16:52:32.932+0000","up_votes":1,"down_votes":0,"body":"Si, eso además. Tiene un hitbox de espanto ese proyectil pero a veces te lo tiran en la cara a quemarropa.","replies":[{"poster":"rokushoger","date":"2015-01-29T13:20:02.037+0000","up_votes":1,"down_votes":0,"body":"Si, ahí no hay chance de esquivar, solo moverte constantemente con la esperanza de que lo tire a la luna tratando de acertarte.","replies":[]}]}]},{"poster":"Runth","date":"2015-01-28T16:19:08.210+0000","up_votes":2,"down_votes":0,"body":"Pobre fizz , antes fue chevere, ahora veremos cena para los tiburones a fizz xD","replies":[]},{"poster":"Liquid FeniX","date":"2015-01-29T00:17:00.171+0000","up_votes":1,"down_votes":0,"body":"Para que.. si el pobre pescado no quita ya nada de una WQ, la R es fácil de esquivar ademas de ser difícil para Fizz atinarle al objetivo.\nRIP FIZZ {{champion:105}} ","replies":[{"poster":"0110100001101001","date":"2015-01-29T00:43:56.360+0000","up_votes":1,"down_votes":0,"body":"Justamente por eso. Para verlo sufrir aun más y se sienta useless. Que pague la pena por ser la cosa más molesta por 2 años seguidos. jajajajaja (lo siento Fizz mains T_T)","replies":[]}]},{"poster":"matixzz","date":"2015-01-28T19:04:03.843+0000","up_votes":1,"down_votes":0,"body":"Se que en el caso de un ap es viable, pero a late ¿por que lo remplazo?","replies":[{"poster":"0110100001101001","date":"2015-01-29T00:42:25.398+0000","up_votes":1,"down_votes":0,"body":"{{item:3102}}  o  {{item:3026}}","replies":[]}]},{"poster":"RNGesus","date":"2015-01-28T19:33:46.434+0000","up_votes":1,"down_votes":0,"body":"{{champion:105}}  tiene mucho counterplay xD , y de  {{champion:238}}  ni hablar , pero este  ultimo es mas op al ser el unico que hay...osea sin {{item:3140}} o {{item:3157}}  estas practicamente muerto :S , creo que algo parecido sucedia con  {{champion:91}} pero a el si lo nerfearon :S","replies":[]},{"poster":"Tokita Ohma","date":"2015-01-28T16:33:04.675+0000","up_votes":1,"down_votes":0,"body":"decime como evitar que riven me delete con tf","replies":[{"poster":"0110100001101001","date":"2015-01-28T16:50:36.395+0000","up_votes":1,"down_votes":0,"body":"Es un tanto complicado, porque ella se mueve muchísimo vs TF que no tiene movilidad y su única esperanza es una carta dorada.\n\nEn lane:\n\n-Jugar a la distancia si o si. Cuando Riven está en línea cerca de los minions, usa la carta roja para obtener CS + hacerle daño. Warning: al haber usado tu carta Riven intentará tradear haciendo all-in. \n-Más defensivamente: cada vez que intente venir encima tuyo, carta dorada. Cuando veas que se le va el escudo de la E, usa tu Q. Será un trade completamente a favor tuyo.\n-Prestar absoluta y máxima atención cuando Riven está por llegar a lvl 6. Hará si o si todo su combo.\n-Podés salir con {{summoner:4}} {{summoner:3}}. Cuando se te tira podes denegarle gran cantidad de todo su combo con el exhaust. Además exhaust te servirá durante toda la partida.\n-{{item:3157}} también será tu gran amigo.\n\nSi lográs jugar defensivo contra ella, sobrevivir y gankear las otras lanes con tu ultimate, considerate logrado como TF player. \n\n\nEn teamfight:\n\nSiempre atrás pokeando con Q. Si Riven se tira, carta dorada para que tu team la destroce. De todas formas, una Riven inteligente no hará eso. Podés guardar el exhaust","replies":[]}]}]}