{"poster":"Zhui Aalimor","date":"2015-02-04T06:25:21.511+0000","title":"This is a joke right?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":6,"body":"Don't get me wrong, the new skins and champions are all very pretty but learn to prioritize please Riot! The OCE community is going down the shitter, getting more toxic by the day and you are giving us an Ocean week event? Seriously?! Fix the community or the OCE server will die. Reporting does nothing at present and server stability? It is a joke!","replies":[{"poster":"Slim Chaedi","date":"2015-02-04T07:59:56.679+0000","up_votes":2,"down_votes":0,"body":"Different.\nDepartments.\nOf.\nRiot.\n\nThe art department has nothing to do with administration.","replies":[{"poster":"Zhui Aalimor","date":"2015-02-04T08:04:54.611+0000","up_votes":1,"down_votes":2,"body":"My point is that it seems all the funding and energy goes to the art department. I am not a complete moron :P","replies":[{"poster":"Ingénue","date":"2015-02-04T09:36:44.500+0000","up_votes":1,"down_votes":0,"body":"'seems'...\nThe projects in the other departments of riot usually take a bit longer but you will know when they arrive (like leaverbuster).","replies":[]},{"poster":"Slim Chaedi","date":"2015-02-04T09:06:07.871+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zhui Aalimor,realm=OCE,application-id=FjGAIbRv,discussion-id=05LLWjsm,comment-id=00010000,timestamp=2015-02-04T08:04:54.611+0000)\n>\n> My point is that it seems all the funding and energy goes to the art department. I am not a complete moron :P\n\nI've encountered a lot of people who for some reason think Riot's employees are all working in art and ignoring as stuff, like every staff member in the company is an artist, haha.","replies":[{"poster":"Zhui Aalimor","date":"2015-02-04T09:53:26.405+0000","up_votes":1,"down_votes":1,"body":"True that, I used to get that from our players back at my old gaming studio :P Although I was an artist and everyone assumed that we were all programmers","replies":[]}]}]}]},{"poster":"mid or feed k","date":"2015-02-04T07:53:38.037+0000","up_votes":2,"down_votes":1,"body":"to be honest it probs wont die theres way to may kids that play it would be nice tho to have some sort of thing where when you get so many reports you get a ban from playing and have to play so many bots. im talking about like 5-10 reports would be harsh on some but werf in the long run","replies":[]},{"poster":"Maraudaur","date":"2015-02-05T02:46:54.374+0000","up_votes":1,"down_votes":0,"body":"Hey Zhui,\n\nI can assure you there is a lot of work done to work on improving player behaviour. Right now we have multiple automatic systems in place to punish negative behaviour; for example\n\nLive\n\nLeaverBuster\nChat restrictions\nIntentional feeder bans\nManual audits\n\nCurrently testing\n\nAutomatic verbal abuse bans\n\nThe above systems all use **your reports** to build player profiles and determine which players should be punished or not.\n\nThis is of course just the negative stuff, we are also working on ways to promote and recognize positive play within our community as well!\nhttp://oce.leagueoflegends.com/en/news/game-updates/special-event/celebrating-end-years-snowdown\n\nOur player behavior philosophies include punishment, reform, and positive reinforcement. There's no silver bullet to improving player behavior in online games, and you always need a mix of punishments and rewards. You can read more about our design philosophies here: http://oce.leagueoflegends.com/en/news/game-updates/player-behavior/exploring-player-behavior-design-values\n\nIf you're really interested in player behaviour give this video a watch it is Jeffrey \"Lyte\" Lin talking about \"The Science Behind Shaping Player Behavior in Online Games\".\nhttp://gdcvault.com/play/1017940/The-Science-Behind-Shaping-Player","replies":[]}]}