{"poster":"tuccielric","date":"2015-03-21T23:29:09.392+0000","title":"Sejuani","subforum":"Charlas Generales","up_votes":1,"down_votes":8,"body":"Este bicho esta rotisimo, super tank, una ulti muy buena, te slowea todo el tiempo, es imposible de sacarsela de encima\r\n\r\nQue espera rito?\r\n\r\n57% win rate tiene\r\n\r\nO al menos pongan de una vez Draft pick asi no me tengo que fumar los niños rata que sino agarran el champ roto del momento no juegan\r\n\r\nCuando realmente se van a poner las pilas y balancear bien a todos los champions? siempre hay 4 o 5 OP por patch viejo","replies":[{"poster":"The Inceptionist","date":"2015-03-22T01:59:57.016+0000","up_votes":2,"down_votes":0,"body":"EL juego nunca va a estar totalmente balanceado. Porque si se nerfea a un campeón, otro campeón que antes no era OP va a quedar OP.","replies":[]},{"poster":"Zogisv","date":"2015-03-22T00:29:40.283+0000","up_votes":2,"down_votes":0,"body":"amigo, sejuani ha tenido ese cc y este daño hace muchos parches, lo unico que ahora pusieron una capa de fuego mas barata y bufearon a todos los tankes. todos, absolutamente todos los tanks estan asi, o pensas que a Zac no le subio el winrate, o a nunu, el cual tiene un slow del 60% que dura 4 segundos cada 4 segundos. simplemente tenes que aprender a hacerles counter, pero la gente ve mas facil pedir nerf a aprender a jugar contra el meta","replies":[{"poster":"The Inceptionist","date":"2015-03-22T04:58:13.873+0000","up_votes":1,"down_votes":0,"body":"Pienso lo mismo que vos. Siempre lloran, no aprenden a jugarles a los campeones. Muy pocos son lo que si lo hacen... También es verdad que si esta muy OP el campeón haya que nerfearlo, pero bueno.","replies":[]}]},{"poster":"GarIand","date":"2015-03-21T23:38:40.068+0000","up_votes":1,"down_votes":2,"body":"> *  Sejuani\n> *  Glacial Prison [R] - Slow reduced to 30% (down from 90%)\n> *  Permafrost [E] - Damage increased to 60/95/130/165/200 (up from 60/90/120/150/180)\n> *  Flail of the Northern Winds [W] - Enemy %max hp on-hit damage lowered to 4%/5.5%/7%/8.5%/10% (down from 4/6/8/10/12%)\n \nNerf en el PBE... leve nerf a la W, teniendo en cuenta que son dos componentes.\nY el nerf a la R. Dios? Como si usaran el slow...","replies":[{"poster":"tuccielric","date":"2015-03-21T23:44:14.094+0000","up_votes":1,"down_votes":3,"body":"Eso es todo? se nota que de balancear no tienen idea","replies":[{"poster":"GarIand","date":"2015-03-22T00:14:33.468+0000","up_votes":2,"down_votes":1,"body":"Y... generalmente es un ciclo de buff - nerf - buff - ~~rework~~, hasta que se llega a un lugar *ideal*.\nPor algo se dice que el equipo de balance en Riot esta compuesto de monos fumadores (?.\n\nLa única cosa que realmente siento que falla Riot es en el balance. Entiendo que es complicado, pero muchas veces nerfean todo menos lo problematico, ya sea porque es la identidad del champ o esto y aquello.","replies":[{"poster":"ragunaover","date":"2015-03-22T00:43:14.827+0000","up_votes":1,"down_votes":0,"body":"Elimina la tacha en el \"rework\" y tienes el ciclo de vida de kassa.","replies":[{"poster":"GarIand","date":"2015-03-22T01:16:07.989+0000","up_votes":1,"down_votes":0,"body":"Es parte del chiste. Ya paso con muchos champs de la nueva generación;\n\nGnar, Vi (QoL), Azir (buffs & QoL), Lucian (kit modificiado), y así con todo.","replies":[{"poster":"ragunaover","date":"2015-03-22T03:00:58.211+0000","up_votes":1,"down_votes":0,"body":"Lucian ? no recuerdo que al negro se le haya cambiado nada.","replies":[{"poster":"GarIand","date":"2015-03-22T04:02:26.124+0000","up_votes":1,"down_votes":0,"body":"Mala memoria sera :P\nAnda hasta el final del [articulo](http://leagueoflegends.wikia.com/wiki/Lucian/Background) y vas a ver todos los cambios.","replies":[]}]}]}]}]}]}]},{"poster":"Arielx","date":"2015-03-21T23:53:19.108+0000","up_votes":1,"down_votes":0,"body":"Acordate como explica riot siempre, el minimo \" balanseo \" es aventajar al otro campeon o en su defecto volverlo \" op \" contra la mayoria, el juego nunca va a poder estar balanceado al maximo no va a ser el Balance perfecto 100%\n\nSejuani es \" op \" cuando alguien practica con ella no cuando la nerfean o no, es el Invocador no El personaje\n\nespero averte sido almenos de ayuda con este comentario\n{{champion:432}}","replies":[]}]}