{"poster":"elwachinango","date":"2019-01-09T12:34:24.334+0000","title":"Alguna manera de ganar mas partidas por cuenta propia?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"como dice el titulo,busco algunos consejos y demas para cerrar partidas o en si ganarlas de manera que no tenga que participar con un equipo que solo se dedica a insultarse,morir y no asegurar objetivos y demas.\r\nYa he perdido como 7 promos a oro por culpa de esto y pues ya saca bastante de quizio.","replies":[{"poster":"YuGan","date":"2019-01-11T00:06:14.372+0000","up_votes":1,"down_votes":0,"body":"Deberías intentar entender las cuestiones inherentes a tu línea (depende de dónde juegues). Es decir: Para empezar, busca un YouTuber o streamer que se dedique a la posición que querés mejorar, y de sus partidas (Si es que no tiene un vídeo más didáctico), hacé el siguiente análisis:\n\n-¿Cómo hace para no perder?\n-¿Qué hace distinto de lo que hago yo? ¿Por qué?\n-¿Qué hace para generar ventaja? (Muy distinto de la primera pregunta)\n-¿Cómo juega cada fase del juego? ¿Por qué? ¿Tiene que ver con el matchup específico?\n\nEtc xD. En resumen, podés sacar mucha información por tu cuenta, pero vas a tener que chocarte muchas veces para ir probando tus conclusiones. Eventualmente, si conseguís un juego consistente (pocos errores y muchos méritos), vas a terminar subiendo. ¡Éxitos!","replies":[]},{"poster":"Diego Rosales","date":"2019-01-09T13:53:18.793+0000","up_votes":1,"down_votes":0,"body":"Esta bastante complicado esto, a Riot Games y a los llorones del juego, les molesta que alguien que juega mejor suba mas rapido por cuenta propia o jugando campeones o builds en meta. Asi que se han dedicado a nerfear campeones, builds, etc a mas no poder, haciendo que dependas mas del equipo. En fin, juga, si o si, campeones meta, te da una minima ventaja sobre el resto. Mejora Micro game si o si, para poder hacer outplays de 2 vs 1 por asi decirlo, de esta forma si te gankea un jg salis beneficiado, despues macro game. Mejora tu tomas de decisiones, trata de ser el lider y nada eso.","replies":[]},{"poster":"Falkon","date":"2019-01-09T13:13:51.581+0000","up_votes":1,"down_votes":0,"body":"Primer paso.\nTira mute all.\nSegundo paso, macrogame, trata de mejorarlo, si ves a 5 en bot y tu team esta entre top y mid, hagan baron, o tiren todo top/mid.\nTercer Paso, las kills no son tan importantes, deja de perseguirlas si hay un 60% de chances de que escapen.\nCuarto paso, cuando vayas a hacer algo \"tryhard\" preguntate antes de hacerlo \"¿A que costo?\"","replies":[]}]}