{"poster":"surferfijio","date":"2017-04-16T15:09:59.652+0000","title":"A dodge counts as a Loss in promos.","subforum":"Help & Support (OCE)","up_votes":7,"down_votes":1,"body":"when you dodge a a champion select because of a troll or other wise something else, it should not count as a loss in promos and u should not lose LP. this really needs to be updated and fixed, can RIOT not actually see why this idea was really bad. \r\n\r\ndodge game in promos because of trolls, counts as a loss, dodge when not in promos. lose 5LP. please RIOT make changes to this bullshit. \r\nthink about this shit honestly... >.&lt;","replies":[{"poster":"TzuyuLovesYou","date":"2018-08-29T08:22:31.883+0000","up_votes":1,"down_votes":0,"body":"{{champion:32}} {{item:3073}}  Legit just lost one cause i dodged. I needed to take a poop that why i dodged, what wrong with dodging champ select, i guess its waste time but, its the same as waiting 20+ min because someone decides to troll and you can't dodge cause you are in your promos\n","replies":[]},{"poster":"Conanman","date":"2018-07-09T23:04:48.427+0000","up_votes":1,"down_votes":0,"body":"Super lame I almost never dodge but if I'm in a promo and someone announces there trolling I'm supposed to what just waste 30 min on a loss?","replies":[]},{"poster":"ArmedNPotatoed","date":"2017-12-04T09:54:24.740+0000","up_votes":1,"down_votes":0,"body":"so the 5 minutes after 1 dodge 25 minutes after 2 dodges and so on isnt enough to prevent that? i doubt anybody is going to bother to wait 3 ducking hours just to pick chogath mid or something. maybe after 3 or so dodges you start losing lp but for people like me who dodge maybe once a week because of a troll, is being punished for someone else ruining my game is kinda stupid","replies":[]},{"poster":"DarthWalrus","date":"2017-12-01T18:42:44.421+0000","up_votes":1,"down_votes":0,"body":"Yeah this is really lame. I dodged a game because I play ADC and my sup \"got autofilled and does not own any supports\" so was going to play xin as sup. If you play ranked, you need to own at least a champ for every role in case of this situation, and I should not be punished for dodging something like that. I can see if it gets excessive, but as someone who very rarely dodges, it seems like a pretty inappropriate punishment and the increasingly long que timers should be sufficient as punishment and deterrent for excessive dodging.","replies":[]},{"poster":"Tele","date":"2017-04-18T12:29:28.974+0000","up_votes":1,"down_votes":0,"body":"It does seem a bit counter-intuitive, you're right. As far as I'm aware this is done to prevent people from endlessly dodging promo-games until they get a really good team, and then playing.","replies":[]}]}