{"poster":"WendyOWilliams","date":"2017-08-17T11:46:49.952+0000","title":"Illaoi per noobies","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Consigli su Illaoi?\r\n\r\nIo personalmente inizio sempre con {{item:1027}} {{item:3340}} e 3x {{item:2003}}.\r\n\r\nNon pusho molto all&#039;inizio, ma vorrei non spostarmi dalla lane fino allo sviluppo di R  - poi {{summoner:12}} .\r\n\r\nSenza tentacoli Illaoi &egrave; piuttosto vulnerabile - puntare sulla difesa oppure tutto attacco? Quali oggetti consigliate? Quando?\r\n\r\n\r\nGrazie :)","replies":[{"poster":"Financial Issues","date":"2017-08-17T14:14:52.097+0000","up_votes":2,"down_votes":0,"body":"Il {{item:1027}} fa schifo, non ti da nessuna statistica utile. Inizia di {{item:2033}} nel 99% dei casi, o al massimo di {{item:1054}} contro roba tipo Rumble o Swain.\n\nLe rune AD che utilizzi adesso vanno benissimo. Per quanto riguarda le Masteries, molto meglio una pagina di [questo](http://i.imgur.com/vDaTKxd.png) oppure di [questo](http://i.imgur.com/Wmqt5iX.png) tipo rispetto a quella che utilizzi di solito. C'è anche chi preferisce usare [Stormraider](http://i.imgur.com/Q29MBm4.png), ma sono dell'idea che Grasp sia molto meglio su Illaoi.\n\n___\n\nPer quanto riguarda gli oggetti, sono due quelli fondamentali:\n{{item:3071}} - HP, danni e CDR. Riduce l'armatura ad ogni persona colpita dai tentacoli.\n{{item:3053}} - HP, danni ed uno scudo gigante. Evita che tu muoia istantaneamente quando ti lanci in mezzo a cinque persone.\n\nOggetti offensivi:\n{{item:3812}} - Danni e riduzione danni, nonché CDR che fa sempre comodo. Anche questo oggetto evita che tu muoia istantaneamente quando ti lanci in mezzo a cinque persone.\n{{item:3078}} - Da sostituire alla Black Cleaver nel caso in cui i nemici non comprino Armor. Ottima sinergia con la Sterak's.\n\nOggetti difensivi:\n{{item:3143}} - Contro Yasuo, Ashe e tutta la gente che compra l'Infinity Edge.\n{{item:3742}} - Ti aiuta a lanciarti in mezzo a cinque persone. E a non morire.\n{{item:3193}} - Ti aiuta a non morire quando ti lanci in mezzo a cinque persone. Finché l'effetto è attivo, i tuoi danni vengono ridotti del 60%, quindi usalo con intelligenza.\n{{item:3065}} - Contro i danni magici. Aumenta pure le cure dei tentacoli.\n{{item:3194}} - Contro i danni magici ripetuti, tipo Malzahar, Cassiopeia o Rumble.\n{{item:3111}} - Contro i CC. Quando ti butti in mezzo a cinque persone, l'unico modo che hai per rimanere in vita è premere tutti i tasti fortissimo e curarti coi tentacoli. Se ti tirano i CC addosso non puoi premere i tasti, e crepi.\n{{item:3047}} - Se non hanno tanti CC, di solito questa è la scelta migliore.\n ____\n\nPer guide su come giocare Illaoi, guarda le partite di [Quas](https://www.youtube.com/results?search_query=Quas+Illaoi).","replies":[]},{"poster":"Darkinknight","date":"2017-08-17T19:56:01.461+0000","up_votes":1,"down_votes":0,"body":"{{item:2033}} come start. La {{item:1027}} la fai solo occasionalmente al secondo back se hai intenzione di fare {{item:3025}}  e continuare a pushare e non dare possibilita di lasciare mai la top vuota.\nIllaoi ha il lv 1-2 molto deboli,quindi li stai safe ma continua ad harassare di Q. Se missi una E indietreggia subito.\nCon illaoi lo scopo è pushare,quindi a parte i primi livelli il tuo scopo sara sempre stare sotto la torre avversaria a pushare e attirare il jng avversario. Gli 1 vs 2 sono fattibilissimi gia dal lv 5 una volta che impari ad usarla.\nQuasi tutto AD,hp,cdr e sustain. Tankala un minimo ma non troppo,non worka.{{item:3071}} {{item:3053}} {{item:3812}} {{item:3111}} /{{item:3047}} /{{item:3009}} sono d'obbligo. Gli altri 2 variano,personalmente fra f{{item:3742}} /{{item:3075}}  {{item:3033}} /{{item:3025}} /{{item:3065}} /{{item:3022}}/{{item:3194}} . Anche la pozza finale preferisco solitamente {{item:2140}} ","replies":[{"poster":"WendyOWilliams","date":"2017-08-19T16:54:19.887+0000","up_votes":1,"down_votes":0,"body":"Grazie :)","replies":[]}]}]}