{"poster":"mapleleeaf","date":"2015-06-28T18:29:32.087+0000","title":"Gaming / E-Sport Hotel möglich?","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":0,"body":"W&auml;re ein Gaming Hotel m&ouml;glich?\r\n\r\nDiese Frage stelle ich mir f&uuml;r meine Diplomarbeit an der H&ouml;heren Tourismusfachschule (HFT Luzern), nun bin ich auf m&ouml;glichst viele Antworten angewiesen und als passionierte Teilzeit LoL-Gamerin m&ouml;chte ich die LoL-Community nat&uuml;rlich als erstes miteinbeziehen.\r\n\r\nF&uuml;llt die Umfrage unter folgendem Link aus! https://surveyplanet.com/558b1115b599d9823f420d85\r\nEs dauert nur 5min und ihr habt die Chance auf einen Amazon Gutschein (50$)! Und wer weiss mit gen&uuml;gend Antworten gibt es vielleicht bald ein Gaming Hotel!!\r\n\r\nDanke f&uuml;r eure Hilfe!!\r\nmapleleeaf","replies":[{"poster":"AUTplayed1337","date":"2015-06-29T08:42:41.906+0000","up_votes":1,"down_votes":0,"body":"ich glaub was du meinst is einfach ein gamging house wo man plätze mieten kann. sowas gibts zB in wien www.area52.at nur halt ohne übernachtung. \nkA ob man sowas braucht, ich wohn in wien und war bisher noch nie dort ^^. wär aber sicher mal lustig für einen abend mit paar freunden \nwär sicher praktisch eine schlafmöglichkeit dabei zu haben. kann funktionieren, aber ob du genügend auslastung übers jahr hinweg kriegst ist aus meiner sicht fraglich. zocken tu ich lieber gemütlich zu hause.","replies":[{"poster":"mapleleeaf","date":"2015-07-14T03:01:28.448+0000","up_votes":1,"down_votes":0,"body":"Hey, danke fürs Feedback. Naja es geht schon eher darum dieses Gaming ins Hotel fix miteinzubinden. Und ja die Auslastung übers ganze Jahr ist ganz klar die grosse Frage und vorallem der \"zocken kann ich auch zu Hause\"-Aspekt. Sehr wahrscheinlich wäre eine gute Lösung das Konzept als Differenzierung zu nutzen und vielleicht einen Teil des Hotels umzufunktionieren, jedoch benötigt man da wieder Sponsoren nur schon das Game Equipment phuuu $$$$... Naja es ist und bleibt spannend ich bin gespannt auf welche Schlüsse ich ende monat komme :)","replies":[]}]},{"poster":"CCG Juuzou","date":"2015-07-01T19:30:18.919+0000","up_votes":1,"down_votes":0,"body":"Ich hab da einfach mal mitgemacht","replies":[]},{"poster":"Zero000","date":"2015-06-28T19:26:59.830+0000","up_votes":1,"down_votes":0,"body":"Bevor man fragt ob ein \"Gaming Hotel\" möglich ist, sollte man erstmal klären was ein \"Gaming Hotel\" überhaupt ist.\nIst es ein Hotel für Professionelle Spieler die dort üben können?\nIst es ein Hotel für Amateur Team damit die dort üben können und eventuell bei entsprechenden Turnieren in der unmittelbaren Nähe antreten können?\nIst es ein Hotel für E-Sport Zuschauer?\nOder ist es einfach ein Hotel das zusätzlich PC und Spielekonsolen anbietet.","replies":[{"poster":"mapleleeaf","date":"2015-06-28T20:45:55.531+0000","up_votes":1,"down_votes":0,"body":"Hey danke für den Kommentar! Wirklich gute Frage!\n\nDer Begriff Gaming Hotel ist ein sehr roher Begriff und vielleicht gäbe es bessere Ausdrücke, je nach Entwicklung der Arbeit kristallisiert sich hier noch einiges heraus.\n\nDie Idee mometan ist es ob ein Hotel Gamer im Allgemeinen ansprechen kann durch anbieten von z.B. Gaming Stations - also Stationen mit professioneller Infrastruktur (ob nun im Zimmer oder in Public Areas). Die Frage ob Interesse daran ist und was für jedem Einzelnen dabei wichtig wäre ist in diesem Stadium das vorerst wichtige.\n\nSpäter geht es dann weiter mit detaillierteren Fragen. Gibt es Interesse und die Möglichkeit dies mit dem professionellen E-Sport in Verbindung zu setzten, gibt es die Möglichkeits auf Events, werden nur Zuschauer angesprochen falls in der Nähe des Hotels ein grosser Wettkampf stattfinden sollte usw. Vielleicht ist dies dann auch jedem Hotel selbst überlassen und mehr als Entwicklungsstrategie eine Idee, ich weiss es nicht.\n\nVielen Dank für deinen Input ich halte dich gerne auf dem Laufenden ;)","replies":[]}]}]}