{"poster":"Bronzie Bjergsen","date":"2016-02-10T09:17:24.064+0000","title":"(In My Opinion) Jhin Feels Weak and Underpowered","subforum":"Gameplay & Strategy","embed":{"description":"Why Does Jhin Feel So Underpowered & How To Buff Him! 'Like' if you enjoyed & want MORE 💙 →Jhin Interactions Tested: http://bit.ly/1PJttc9 →Subscribe For More!: http://full.sc/1gukNqq Follow me here! →My Stream: http://twitch.tv/redmercylol →My Twitter: http://twitter.com/RedmercyLoL →Facebook: https://www.facebook.com/RedmercyLoL →My Instagram: http://instagram.com/redmercylol →My 2nd YouTube Channel: https://www.youtube.com/redmercygaming Redmercy Merchandising Now Available!","url":"https://www.youtube.com/watch?v=mDju_kmgkFY","image":"https://i.ytimg.com/vi/mDju_kmgkFY/hqdefault.jpg"},"up_votes":1,"down_votes":1,"body":"Hey guys!~ ^_^ Now on to the main point :)\nThe hype for Jhin was incredible he&#039;s a very unique champ with the whole ammo system, I love him to bits and I bought him as soon as he was released. I say I&#039;m pretty good at him I&#039;m Bronze V tho, I&#039;m not very good xD. His kit is okay but  the ulti being my favorite &lt;3. His champion concept is amazing.\n\nThe Negatives To This Amazing Champ -\nHis win rate is really low for ADC and MID, with (ADC) 43.94% and (MID) 39.52%  {{item:3070}} \n\nNext is Jhin&#039;s passive with the ammo system is... it&#039;s okay, but you can&#039;t do anything to make that reload faster like Graves. But Graves is just uber broken (I might&#039;ve stolen that from the video but.. hush..). With the assassin&#039;s everywhere and the new item (Which I love &lt;3) Jhin just kinda.. dies and back to the reload thingy in team fights you&#039;ll probably lose that fight. (Maybe) The time you&#039;re reloading is time wasted whilst the other ADC is pumping out autos every.. (idk, but still) \n\nThe next problem I have with him is his &#039;E&#039;, the traps they do okay-ish damage but they&#039;re kinda useless (well in my opinion) \n\nUlti.... I mean it&#039;s fucking legendary but other enemy players can just get in the way and if it&#039;s a tank... {{item:3070}} . Then there&#039;s Yas&#039; Wind Wall... (Yasuo mains I&#039;m looking at you... {{item:3070}}  )\n\nI&#039;m fine with the ulti it just makes me mad that it can be blocked so easily. His passive makes me cringe every time I reload as Jhin, and his traps are just a waste of mana.\n\nOverall I wish to change/buff Jhin&#039;s kit and make his win rate a bit higher and make him viable in ranked! ^_^ {{champion:202}} \n\nSO RITO YOU HEAR ME! MAKE THIS CHAMP VIABLE! \n\nComment down below if you think these changes should happen, or if you&#039;re fine with how Jhin is now\n\nThanks for taking some of your time to read this &lt;3\n\n{{champion:202}}  {{summoner:14}} {{champion:202}}\n\n(I'm trying not to steal Redmercy's video/product, the video belongs to the owner and I wish to not make an 'profit' of it.)","replies":[{"poster":"Maximum Spice","date":"2016-02-10T11:13:29.374+0000","up_votes":2,"down_votes":0,"body":"i 100% disagree, you can't ALWAYs pick him since he is easily countered since he lacks escapes but my god is he strong, and the pick potential he brings with his w. I played a couple of games with a jayce mid, jayce would fire the long rage poke, and i would root the target allowing thresh then to set up for 3 kills IN a row done the EXACT same way. His ult is amazingly strong too. \n\nHe is good, when used properly with a good comp to help protect him","replies":[]},{"poster":"GigaPube","date":"2016-02-10T16:06:14.672+0000","up_votes":1,"down_votes":0,"body":"wtf am i reeeaaadiiiing....\n\n\"his winrate is really low\"\nyeah cos he just got released....im honestly offended you would think everyone would be an expert on him instantly, win rates never mean anything when a champs just released. warwick can be great but if he got just released as he is now he wouldnt have the 55% winrate he does now would he? people would be making posts about how low his winrate is and they'd call for riots head on a stick\n\n\"the traps they do okay-ish damage\"\nits not about how much they do. i would say \"obviously you dont try to just poke em with traps\", but now i cant because you've said this statement and i read it so now i have to lower my judgement of peoples logical capability.  so not-so-obviously you're supposed to follow up on the CC of the traps with damage since the enemy is debuffed. you're supposed to take advantage of the traps going into stealth, you find ways to get your opponent to walk on it like placing them in choke points or on the edge of corners or brushes and you'll be (hopefully) waiting nearby taking advantage of having the upper edge, supposedly, for a while\n\n\"his passive makes me cringe\" \nyeah things on the internet make me cringe too\n\n\"SO RITO YOU HEAR ME! MAKE THIS CHAMP VIABLE! \"\n....","replies":[]},{"poster":"lordofrage","date":"2016-02-10T09:24:44.838+0000","up_votes":1,"down_votes":0,"body":"ru stealing redmercys vid","replies":[{"poster":"Bronzie Bjergsen","date":"2016-02-10T09:26:14.713+0000","up_votes":1,"down_votes":0,"body":"No, I probs should've done the whole 'the video belongs to the owner and stuff'","replies":[{"poster":"lordofrage","date":"2016-02-10T09:32:49.280+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kirito Senpai,realm=OCE,application-id=FjGAIbRv,discussion-id=1sp4X9m6,comment-id=00000000,timestamp=2016-02-10T09:26:14.713+0000)\n>\n> No, I probs should've done the whole 'the video belongs to the owner and stuff'\n\nyeh u should of","replies":[{"poster":"Bronzie Bjergsen","date":"2016-02-10T09:33:48.319+0000","up_votes":1,"down_votes":0,"body":"Sorry for the confusion dude {{item:3070}}","replies":[]}]}]}]}]}