{"poster":"SSG Darkness","date":"2015-04-02T16:59:53.171+0000","title":"Malvinas, palabra ofensiva?","subforum":"Off-topic y temas personales","up_votes":12,"down_votes":4,"body":"pues hoy, como argentino que soy, quise poner en mi estado malvinas argentinas!, y me doy con que malvinas es una palabra ofensiva. no quiero que se arme una discusion por esto, solo quiero saber, por qu&eacute; riot pone malvinas como una palabra ofensiva?\r\nacaso ofendo a alguien queriendo recordan como cientos de personas murieron por una causa que hasta el dia de hoy no tiene fin?","replies":[{"poster":"Platinum491","date":"2015-04-02T18:59:52.400+0000","up_votes":12,"down_votes":0,"body":"por gente de mi pais con falta de marteria gris","replies":[]},{"poster":"Zima Blue","date":"2015-04-02T17:08:05.582+0000","up_votes":11,"down_votes":2,"body":"Esta prohibida por algunos chilenos que lo usan para ofender a los Argentinas, pero de todas formas para mi no tendria que estar prohibido.","replies":[{"poster":"SrElite","date":"2015-04-02T19:50:23.066+0000","up_votes":5,"down_votes":10,"body":"Solo chilenos? ._. Eso es indirectamente ser racista.","replies":[{"poster":"vk0utsider","date":"2015-04-02T20:16:20.225+0000","up_votes":10,"down_votes":1,"body":"No, es ser realista, solo los chilenos la usan como modo de ofensa contra jugadores argentinos.","replies":[{"poster":"Yrox the Third","date":"2015-04-02T22:03:35.488+0000","up_votes":4,"down_votes":1,"body":"Yo he visto mas que a solo Chilenos, aunque si, es una palabra que la usan de ofensa a los Argentinos.","replies":[]}]}]}]},{"poster":"Cedriel","date":"2015-04-02T19:34:13.292+0000","up_votes":9,"down_votes":2,"body":"DarkMero, como señalan otros jugadores el uso más común bajo el cual sale la palabra \"malvinas\" es para insultos xenofóbicos en contra de Argentinos. Teniendo en cuenta que para tí y otras personas es un tema sensible, preferimos restringirlo para que un uso ofensivo del tema no les haga pasar un mal rato.\n\nEntendiendo que levantar esta restricción probablemente lleve a pocas buenas discusiones y bastante trolleo / provocación, ¿qué opinan? Me interesan perspectivas tanto de jugadores Argentinos como de Chile, Uruguay, Peru y Paraguay: son pocos los canales en que nos toca convivir en una comunidad integrada todos los países de América del Sur, y sería bueno pensar en cómo podemos generar más respeto entre todos, independiente del país en que uno haya nacido.","replies":[{"poster":"Maldichion","date":"2015-04-02T20:46:46.870+0000","up_votes":7,"down_votes":0,"body":"Gracias por la respuesta al autor del post...\n\nSi me permiten me gustaría dar mi opinión...\n\nLa censura de palabras ofensivas consideradas insultos como las que todos conocemos, hijo de p... put...,etc. Son perfectamente entendibles que estén bloqueadas, pero un sustantivo propio como es \"Malvinas\" no debe ser bloqueado...\nEs completamente irrisorio, es lo mismo que bloqueen, \"Uruguay\", \"Chile\", \"Argentina\",etc.\n\nAparte de no solucionar nada, ya que el problema esta en las personas y no en las palabras... Es hasta inútil, ya que si yo quiero vulnerar el sistema lo hago de igual manera poniendo una doble letra en el misma palabra \"Malvvinnas\" y la xenofobia va a seguir estando.\n\nMe resulta mas ofensivo de Riot que me bloquee a mi, Argentino, la posibilidad de poner la palabra Malvinas, que me lo diga una persona extranjera en modo de insulto, ya que si lo hace lo tomo como de quien viene...\n\nA la gente se la educa, no se la restringe, ya que la restricción solo genera mas rebeldía... \nComo no somos \"escuela\" y eso depende de sus familias, hay reglas... Y el que las rompe se tiene que ir... Las sanciones por xenofobia tienen que ser implacables... Gente que sea racista y xenófoba tiene que ser permanentemente baneada...\nLes puedo asegurar que cuando los baneen por eso y la gente lo diga, se acabo la historia o se disminuyo drásticamente...\n\nEspero que no incomode a nadie mi pensamiento, si es así no era mi intención...\n\nSaludos!\n\nJavier...","replies":[]},{"poster":"RIP Tomex","date":"2015-04-02T20:31:44.901+0000","up_votes":4,"down_votes":1,"body":"Por que no mejor educar a los players que utilizan mal la palabra? Mucho esfuerzo? Es mas facil suprimir el problema que solucionarlo, no ?","replies":[{"poster":"El Predador","date":"2015-04-02T22:29:53.371+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=iEt91,realm=LAS,application-id=J8qpiO2I,discussion-id=EIJ1cQ3k,comment-id=00080000,timestamp=2015-04-02T20:31:44.901+0000)\n>\n> Por que no mejor educar a los players que utilizan mal la palabra? Mucho esfuerzo? Es mas facil suprimir el problema que solucionarlo, no ?\n\nEso no es problema de Riot basicamente, eso viene desde la cuna (padres); si no les enseñan a respetar desde crios no tiene caso. Como veo varios \"niños\" sosteniendo a muerte que Las Malvinas son Inglesas.....cero libros de historia, cero educacion, cero respeto.....","replies":[]},{"poster":"Daidaros","date":"2015-04-02T21:20:55.998+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iEt91,realm=LAS,application-id=J8qpiO2I,discussion-id=EIJ1cQ3k,comment-id=00080000,timestamp=2015-04-02T20:31:44.901+0000)\n>\n> Por que no mejor educar a los players que utilizan mal la palabra? Mucho esfuerzo? Es mas facil suprimir el problema que solucionarlo, no ?\n\nPorque eso hay que hacerlo desde chicos. Aca en Argentina por lo menos, la educación es cada vez peor, la falta de respeto e ignorancia cada vez mayor, y solo porque les conviene a unos pocos del poder.","replies":[{"poster":"Fede4512","date":"2015-04-03T00:29:51.350+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Daidaros","date":"2015-04-03T00:32:47.003+0000","up_votes":2,"down_votes":0,"body":"No vivo en chile, hablo solo por mi país, que conozco. Si chile anda mal, alla ellos, pero que le podes exigir a otro país si el propio tiene los mismo problemas? Exactamente eso, siempre es mejor echarle la culpa al otro y no mirar para adentro.. no... Primero cambiemos lo nuestro, y despues ayudemos al resto a mejorar.","replies":[]}]}]}]},{"poster":"extracted","date":"2015-04-03T04:15:57.576+0000","up_votes":2,"down_votes":0,"body":"Es preferente que siga asi. No porque sea una \"mala palabra\" sino porque los nenes que juegan a este juego tienen poco respeto por todos aquellos que fueron enviados por obligacion a pelear por una causa incierta. Conozco a 1 ex combatiene y me enorgullese el solo verlo levantarse todos los dias y trabajar tratando de dejar atras las atrocidades que se vio forzado a hacer por el beneficio de unos terceros. Me emociona verlo izar la bandera con lagrimas en los ojos, de ORGULLO POR SU PAIS. \nLamentablemente mucha gente le parece gracioso que en nuestra historia nos haya tocado participar y perder una batalla que nunca deberia haber ocurrido. No porque perdimos, sino porque no lleva a ningun lado. Pero anda a hacerle entender eso a un nenito de 14 años que se cree gracioso, grande y piola por burlarse de la desgracia ajena que el ni nadie de su entorno vivió. En cualquier caso, ellos la llamar \"Falkland\" porque para ellos esa palabra nos molesta. \n\nLlamenla como quieran, pero si para 150 paises del mundo, las malvinas son Argentinas, por algo será. Pensar que una guerra resuelve un problema, es un pensamiento arcaíco o de gente retrograda. Sin animo de ofender a nadie, no importa de que pais que sea. A mi personalmente no me afecta lo que diga un nenito atras de un monitor, pero por respeto a los muertos, tanto ingleses como argentinos, es mejor no hablar al respecto o hablar de una manera constructiva, cosa que por lo menos ingame, nunca vi en mi vida y aca todos se hacen los buenos porque hay admins y no quieren perder su cuenta.","replies":[]},{"poster":"Fantastic Mou ","date":"2015-04-02T23:48:09.933+0000","up_votes":2,"down_votes":0,"body":"Se ve que a los de riot no les importa defender lo que nos corresponde por derecho","replies":[]},{"poster":"Daidaros","date":"2015-04-02T20:34:31.127+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Cedriel,realm=LAS,application-id=J8qpiO2I,discussion-id=EIJ1cQ3k,comment-id=0008,timestamp=2015-04-02T19:34:13.292+0000)\n>\n> DarkMero, como señalan otros jugadores el uso más común bajo el cual sale la palabra \"malvinas\" es para insultos xenofóbicos en contra de Argentinos. Teniendo en cuenta que para tí y otras personas es un tema sensible, preferimos restringirlo para que un uso ofensivo del tema no les haga pasar un mal rato.\n> \n> Entendiendo que levantar esta restricción probablemente lleve a pocas buenas discusiones y bastante trolleo / provocación, ¿qué opinan? Me interesan perspectivas tanto de jugadores Argentinos como de Chile, Uruguay, Peru y Paraguay: son pocos los canales en que nos toca convivir en una comunidad integrada todos los países de América del Sur, y sería bueno pensar en cómo podemos generar más respeto entre todos, independiente del país en que uno haya nacido.\n\nSe podría simplemente reabrir el tribunal, banear a este tipo de personas (basta de chat ban, no sirve, ban por dias o permanente por reincidencia). Te gusta insultar? Perfecto, create otra cuenta porque esta no la tenes más. Con el tiempo (porque al principio no va a haber cambios, va a ser a la larga siempre y cuando siga funcionando como se debe), el chat se va a empezar a usar para lo que debe ser, comunicarte con tu equipo para progresar.\n\nSaludos.","replies":[]},{"poster":"Fausto GP","date":"2015-04-02T21:25:16.139+0000","up_votes":5,"down_votes":3,"body":"Querido Cedriel... ¿Y que hay de los argentinos cuando dicen cosas relacionadas con terremotos y tsunamis para insultar a los chilenos, diciendo cosas como: \"Ojala que tengan mas terremotos/tsunamis para que mueran mas chilenitos petes\".\nO cuando insultan a los uruguayos llamando el país como: \"provincia argentina\".\n\n- ¿Por que los argentinos tienen trato especial cuando se trata de insultos xenofóbicos de moda?\n- Otra cosa... ¿por que censuran modismos que no son insultos como: wea, weon?. Muchos amigos que simplemente me quieren saludar con un: wena weon como estas?, o indicarme algo con un: mira esta wea, son censurados cuando escriben esos modismos.\nSi van a estar censurando modismos inofensivos háganlo con todos los países, por ejemplo el \"CHE\" que usan los argentinos como muletilla al igual que lo hacen los chilenos con el \"weon\".\n- Curiosidades: ¿Por esta censurada la palabra \"leche\" y no \"semen\"? XD. Yo pensaba que estaba censurada para evitar referencias sexuales, pero la palabra original se puede usar perfectamente. \n\nHay muchas censuras que realmente no tienen mucho sentido o están poco justificadas.","replies":[{"poster":"Ruphian","date":"2015-04-03T00:22:34.944+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fausto GP,realm=LAS,application-id=J8qpiO2I,discussion-id=EIJ1cQ3k,comment-id=00080003,timestamp=2015-04-02T21:25:16.139+0000)\n>\n> - Curiosidades: ¿Por esta censurada la palabra \"leche\" y no \"semen\"? XD. Yo pensaba que estaba censurada para evitar referencias sexuales, pero la palabra original se puede usar perfectamente. \n> \n> Hay muchas censuras que realmente no tienen mucho sentido o están poco justificadas.\n\nXDDDDDD","replies":[]}]},{"poster":"SSG Darkness","date":"2015-04-03T00:47:22.867+0000","up_votes":1,"down_votes":0,"body":"pues yo creo que como palabra en un estado de un jugador no deberia estar restringido por el simple hecho de que tu estado solo lo ve gente que con la que jugaste y te haya gustado u forma de jugar/hayan sido respetuosos contigo etc etc.., por lo tanto el racismo no se veria aplicado en este caso, que la dejen bloqueada en chats generales en las cuales te puedas encontrar personas con un sentimiento aparte. ademas, que me ha de molestar que utilizen esto como insulto? por mi parte me daria bastante igual que un chileno/persona de nacionalidad desconocida insulte utilizando esta palabra como pilar de su insulto, todos sabemos que los unicos que la utilizan con niños de 12 años que no saben simplemente como contestar, por que dudo que un adulto racional sea capaz de utilizar esto como insulto.","replies":[]},{"poster":"nahuelrami","date":"2015-04-09T00:24:53.726+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Cedriel,realm=LAS,application-id=J8qpiO2I,discussion-id=EIJ1cQ3k,comment-id=0008,timestamp=2015-04-02T19:34:13.292+0000)\n>\n> DarkMero, como señalan otros jugadores el uso más común bajo el cual sale la palabra \"malvinas\" es para insultos xenofóbicos en contra de Argentinos. Teniendo en cuenta que para tí y otras personas es un tema sensible, preferimos restringirlo para que un uso ofensivo del tema no les haga pasar un mal rato.\n> \n> Entendiendo que levantar esta restricción probablemente lleve a pocas buenas discusiones y bastante trolleo / provocación, ¿qué opinan? Me interesan perspectivas tanto de jugadores Argentinos como de Chile, Uruguay, Peru y Paraguay: son pocos los canales en que nos toca convivir en una comunidad integrada todos los países de América del Sur, y sería bueno pensar en cómo podemos generar más respeto entre todos, independiente del país en que uno haya nacido.\n\nyo soy argentino, y opino que esta bien la censura de la palabra,ya que (como ya dijiste) provoca mas discuciones que verdaderas conversaciones la verdad yo prefieo que este censurado.\nYa que cuando leo \"sin malvinas\" me toca la moral y mas abajo la verdad :D","replies":[]}]},{"poster":"Dildo de Moria","date":"2015-04-02T18:00:48.887+0000","up_votes":5,"down_votes":0,"body":"De seguro que es porque se ha utilizado a las Malvinas como tema de insulto xenofóbico de moda, al ser esta la causa, Riot ha decidido censurarla por si tenes un amigo en el juego que es algo xenofóbico, no te empieze a ``verduguear´´","replies":[]},{"poster":"Electric5and","date":"2015-04-02T23:14:45.701+0000","up_votes":4,"down_votes":0,"body":"Estaria mejor que revisen los reports en vez de estar censurando palabras rebuscadas\nPD: acabo de tomar *leche* con cereal","replies":[]},{"poster":"KinderOfficial","date":"2015-04-02T17:32:28.686+0000","up_votes":4,"down_votes":0,"body":"Ojala esto lo lea riot , es increible que te dejen escribir isla de pascua y no malvinas :/","replies":[]},{"poster":"kamuika","date":"2015-04-03T00:01:03.701+0000","up_votes":3,"down_votes":0,"body":"Yo soy argentino y creo que es demasiado bloquear la palabra Malvinas, por que si si bloquea por que se utiliza como insulto a jugadores de Argentina, con ese criterio un día  no se va a poder escribir ni siquiera una nacionalidad, es muy importantes para nosotros hoy y siempre este tema y creo que desbloquearlo y se permita escribir seria un gran gesto por parte de riot. Y si se utiliza de una manera ofensiva que se reporte y ustedes por medio de eso baneen al usuario y listo todo solucionado no hay mejor de manera de educar a los invocadores que el baneo permanente y esas cosas antes que lleguemos al hecho extremo que no halla chat.","replies":[]},{"poster":"LGBT Valentina","date":"2015-04-02T22:25:09.054+0000","up_votes":2,"down_votes":0,"body":"te hago una pregunta:\nCual es la necesidad de usar esa palabra cuando sabes que el 90% de las personas la van a usar de forma ofensiva?","replies":[]},{"poster":"NGreppi","date":"2015-04-02T18:30:35.398+0000","up_votes":2,"down_votes":0,"body":"Seguro fue porque los otros paises la usan para ofendernos pero deberian sacarla antes de que se arme el bardo.","replies":[]},{"poster":"LGGT Max Power","date":"2015-04-03T00:01:55.817+0000","up_votes":3,"down_votes":1,"body":"Y qué tendrán que ver las Malvinas con el LoL?.. digo empecemos por ahí.","replies":[]},{"poster":"El Predador","date":"2015-04-02T19:59:32.679+0000","up_votes":3,"down_votes":1,"body":"No tiene sentido esa restriccion, como tantas otras restricciones..... \"kike\", \"leche\", \"malvinas\". Con la misma logica que siguen esas restricciones tendrian que banear la palabra \"terremoto\". Useless....como tantas otras cosas de Riot......","replies":[]},{"poster":"Vintorez","date":"2015-04-02T19:21:52.643+0000","up_votes":3,"down_votes":1,"body":"No tiene contexto dentro del juego y además pueden usarla para joder. Me parece bien que este bloqueada.","replies":[]},{"poster":"Fausto GP","date":"2015-04-02T21:42:06.286+0000","up_votes":4,"down_votes":3,"body":"¿Y que hay de los argentinos cuando dicen cosas relacionadas con terremotos y tsunamis para insultar a los chilenos, diciendo cosas como: \"Ojala que tengan mas terremotos/tsunamis para que mueran mas chilenitos petes\".\nO cuando insultan a los uruguayos llamando el país como: \"provincia argentina\".\n\n    ¿Por que los argentinos tienen trato especial cuando se trata de insultos xenofóbicos de moda?\n    Otra cosa... ¿por que censuran modismos que no son insultos como: wea, weon?. Muchos amigos que simplemente me quieren saludar con un:\" wena weon como estas?\", o indicarme algo con un: \"mira esta wea\", son censurados cuando escriben esos modismos.\n    Si van a estar censurando modismos inofensivos háganlo con todos los países, por ejemplo el \"CHE\" que usan los argentinos como muletilla al igual que lo hacen los chilenos con el \"weon\".\n    Curiosidades: ¿Por esta censurada la palabra \"leche\" y no \"semen\"? XD. Yo pensaba que estaba censurada para evitar referencias sexuales, pero la palabra original se puede usar perfectamente.\n\nHay muchas censuras que realmente no tienen mucho sentido o están poco justificadas.","replies":[{"poster":"Fantastic Mou ","date":"2015-04-02T23:55:54.072+0000","up_votes":1,"down_votes":0,"body":"Y en ves de \"che\" que se usaría para llamar a una persona, \"oye\" o \"hey\" ?","replies":[]}]},{"poster":"Darkchaz","date":"2015-04-03T00:57:48.695+0000","up_votes":3,"down_votes":2,"body":"las malvinas son chilenas","replies":[]},{"poster":"Sonatic","date":"2015-04-03T00:01:04.991+0000","up_votes":1,"down_votes":2,"body":"De hecho tú eres el que esta pasando por alto las normas de lol queriendo provocar con tu \"Malvinas argentinas\", el problema es netamente tuyo. Encima innecesario, basta.","replies":[{"poster":"SSG Darkness","date":"2015-04-03T01:01:25.182+0000","up_votes":1,"down_votes":1,"body":"de hecho te estas equivocando, ya que decir malvinas argentinas es solo un punto de vista, estamos muy lejos de decirlo en forma de verdad hoy en dia. y si al bloquear esta palabra cortan la libertad de opinion, como terminaremos despues? sera ban permanente decir tu punto de vista de algo? si solo vienes a comentar por que te molesta el termino malvinas argentinas, puedes ir retirandote por la puerta trasera.","replies":[{"poster":"Sonatic","date":"2015-04-03T05:06:37.071+0000","up_votes":1,"down_votes":1,"body":"Punto de vista nada, eso ya es otra cosa, pero bueno, allá tú.\nEncima supones que me molesta lo de \"Malvinas argentinas\" como si me afectara, ¿De qué vas?","replies":[{"poster":"SSG Darkness","date":"2015-04-03T14:15:57.395+0000","up_votes":1,"down_votes":0,"body":"solo te dire una cosa, es por la cual dude de publicar el tema, y es por gente como tu, que solo vienen a buscar pelea/bardo, siendo que en el post principal dije que se abstengan de hacer este tipo de comentarios. hasta ahora no has dado ni aportado nada al tema.","replies":[{"poster":"Sonatic","date":"2015-04-03T21:20:59.490+0000","up_votes":1,"down_votes":0,"body":"¿Buscar pelea? Tú eres el que la busca que en varios de tus comentarios generalizas hacia los chilenos, mejor evita hablar en general que tu punto ahí se cae y mal. ¿Malvinas argentinas? Buen estado, genio.","replies":[{"poster":"SSG Darkness","date":"2015-04-03T22:19:14.784+0000","up_votes":1,"down_votes":1,"body":"y dime, alguna vez has visto algun uruguayo o peruano insultando esta palabra? ustedes son los unicos que lo hacen, por algo lo digo, y por lo que veo, eres el tipico que se cree descendiente de ingleses, que no aceptan el punto de vista de los demas y solo cree en el suyo, por eso hoy por hoy estamos asi. te invito a no volver a comentar en este tema, eres el unico que a iniciado una discusion sin sentido, todos los demas han puesto su punto de vista y se lo ha respetado, contigo es con el unico que se ha tenido problema, por algo sera no?","replies":[{"poster":"Sonatic","date":"2015-04-03T22:26:44.868+0000","up_votes":1,"down_votes":0,"body":"Claro que si he visto, si no es propio de chilenos insultar a otros, ustedes de igual forma lo hacen como peruanos y uruguayos y mira lo que me dices ahora, vaya forma de defender tu punto tienes, por cada cosa que te digo sacas algo nuevo hacia mi, ahora resulta que me creo descendiente de ingleses de la nada, deja de inventarte cosas y de generalizar tanto, no es necesario y te dejas mal.","replies":[{"poster":"SSG Darkness","date":"2015-04-04T14:29:08.247+0000","up_votes":2,"down_votes":1,"body":"de nuevo pones a los demas como ejemplo.... acaso si los de uruguay matan personas por diversion ustedes tambien tienen derecho a hacerlo? el que nosotros los insultemos tambien les da derecho a hacerlo? eso sinceramente no los hace mejor que nosotros, ya tienen un pasado muy mal visto por toda latinoamerica no solo en la guerra de las mismas, sino por discusiones de terreno y cosas q no vienen a cuento ahora. y repito, parece que no leiste la parte que dice explicitamente por qué digo lo de ingleses, no aceptas el punto de vista de los demas. por eso hasta hoy seguimos discutiendo sobre el dominio de malvinas, por que ellos queren tener algo que por derecho nos pertenece.","replies":[{"poster":"Sonatic","date":"2015-04-04T21:54:58.541+0000","up_votes":1,"down_votes":0,"body":"¿Perdón? Eres tú el que generaliza, el que supone de los demás porque otros no están de acuerdo con su punto de vista. Si según tú yo me creo ingles solo por decirte que estas mal generalizando sobre los chilenos, diciéndome que no aceptar el punto de los demás es propio de ingleses, qué tontería más grande. Yo solo te respondí que no es cosa de chilenos molestar a los argentinos, si todos se molestan entre si y no puedes negarlo. Pero dudo que lo entiendas, ya quedo claro.","replies":[]}]}]}]}]}]}]}]},{"poster":"Maldichion","date":"2015-04-03T00:24:52.923+0000","up_votes":1,"down_votes":0,"body":"Las normas del LoL? Decime cual es la que rompe, se ve que las sabes todas...\n\nQueriendo provocar? Porque dice \"Malvinas Argentinas\"?\n\nGuau... Que pensamiento mas cerrado...\n\nSe nota que no sos Argentino, por eso opinas de algo que no sabes...","replies":[{"poster":"Sonatic","date":"2015-04-03T05:03:15.100+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Maldichion,realm=LAS,application-id=J8qpiO2I,discussion-id=EIJ1cQ3k,comment-id=00120000,timestamp=2015-04-03T00:24:52.923+0000)\n>\n> Las normas del LoL? Decime cual es la que rompe, se ve que las sabes todas...\n> \n> Queriendo provocar? Porque dice \"Malvinas Argentinas\"?\n> \n> Guau... Que pensamiento mas cerrado...\n> \n> Se nota que no sos Argentino, por eso opinas de algo que no sabes...\n\nPor algo se bloqueo, encima ponerlo en un estado, ¿Con qué motivación? Es una simple provocación.","replies":[{"poster":"SSG Darkness","date":"2015-04-03T14:16:58.947+0000","up_votes":1,"down_votes":0,"body":"en un estado que nadie mas que los que tienes en amigos veran, leete el post completo antes de hablar. se supone que el estado esta para eso, para que lo lean tus amigos.","replies":[]}]}]}]},{"poster":"Anniequiladora","date":"2015-04-02T20:39:00.727+0000","up_votes":2,"down_votes":1,"body":"Por esa misma regla , entonces deberían prohibir la palabra diccionario , cuando un argentino te dice \"she vo shilenito pt comprate un diccionario y aprendé a abla pt\"","replies":[{"poster":"Fantastic Mou ","date":"2015-04-02T23:58:40.192+0000","up_votes":1,"down_votes":1,"body":"Comparte un diccionario porque no sabes escribir","replies":[{"poster":"Anniequiladora","date":"2015-04-03T16:38:10.273+0000","up_votes":1,"down_votes":0,"body":"Y quieres que te \"comparta\" un diccionario o que te \"compre\" un diccionario?","replies":[]},{"poster":"Anniequiladora","date":"2015-04-03T16:37:29.444+0000","up_votes":1,"down_votes":0,"body":"Te refieres por lo que te dicen los argentinos? pues así me dicen , y dicen que nos compremos nosotros diccionario jaja","replies":[]}]}]},{"poster":"nahuelrami","date":"2015-04-09T00:26:41.940+0000","up_votes":1,"down_votes":0,"body":"ah y por favor no pongan racismo PLS, es xenofogo racismo = raza, xenofobia = pais :D","replies":[]},{"poster":"Chance Time","date":"2015-04-07T06:03:25.897+0000","up_votes":1,"down_votes":0,"body":"Falkland Islands tambien esta baneado ?{{summoner:14}}","replies":[]}]}