{"poster":"DIOS TUTI","date":"2018-03-04T10:29:48.970+0000","title":"Guia Udyr completa s8","subforum":"Guias y consejos","embed":{"description":"DLG TUTI DIOS / Diamond 3 56LP / 92W 46L Win Ratio 67% / Udyr - 141W 65L Win Ratio 68%, Zilean - 7W 2L Win Ratio 78%, Malphite - 4W 3L Win Ratio 57%, Shyvana - 2W 3L Win Ratio 40%, Dr. Mundo - 1W 2L Win Ratio 33%","url":"http://las.op.gg/summoner/userName=DLG+TUTI+DIOS","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":16,"down_votes":3,"body":"Hola, hoy me pidieron una guia de {{champion:77}} , mi main, y ya que estoy la comparto, espero que le sirva a alguien.\n\nVoy a centrarme en estos tips, si tienen alguna duda agreguenme al lol y se las resuelvo, o respondan al post, lo voy a estar leyendo.\n\n**ROL DE UDYR EN LA PARTIDA Y LAS TEAMFIGHTS.\nTIGRE: RUNAS, BUILDS, MAXEO DE HABILIDADES, COMBOS.\nFENIX: RUNAS, BUILDS, MAXEO DE HABILIDADES, COMBOS.\nRUTAS DE JUNGLA.\nMATCHUPS: TODOS LOS JUNGLAS.\nAGRESIVIDAD EN EARLY GAME.**\n\n_Rol de {{champion:77}} en la partida:_\n\n-Denegar lo mas posible al jungla rival. (**Si no se puede, tratar de fedear a tus aliados**)\n-Si no hay un tanque en tu equipo, tenes que ser la frontline del mismo.\n-Nunca dejar de ganar oro, de farmear, de sacar torres, dragones, heraldo, etc.\n-Si vas bien en la partida, podes hacer un buen splitpush, es muy efectivo, Udyr es de los mejores champs para hacer esa estrategia.\n\n_Rol de {{champion:77}} en teamfights:_\n\n-Focusear al carry enemigo y llamar la atencion de la mayor cantidad de gente en el equipo enemigo por el mayor tiempo posible, y si es posible, matarlo.\n-En caso de que haya tanque en el equipo, y el equipo enemigo tenga un iniciador que necesite estar cerca tu equipo para aplicar su cc, podes contrarrestarlo con tu stun, quedandote cerca de tus carrys.\n\n_Udyr tigre:_\n\n-Runas: Precision y brujeria.\n\nPrecision:\nEstrategia ofensiva\nTriunfo\nLeyenda: Tenacidad\nGolpe de gracia\nBrujeria:\nCeleridad\nCaminata sobre agua\n\n_El porque de estas runas:_\nEstrategia ofensiva que se activa con 3 basicos, core en Udyr.\nTriunfo + golpe de gracia (**daño adicional al asesinar a un enemigo por 10 segundos, mas las curaciones de triunfo, te hacen imparable apenas conseguis un asesinato**)\nLeyenda: tenacidad: Udyr necesita tenacidad, ademas de que hace sinergia con el sterak y las botas de mercurio.\nCeleridad: velocidad de movimiento, y cuanto mas velocidad de movimiento tenes, mas ad ganas, core en udyr.\nCaminata sobre agua: da AD en rio y velocidad de movimiento, que hace sinergia con celeridad, y lo vuelve muy potente al nivel 3, y al sacar objetivos.\n\n_-Build:_\nComienzo: {{item:1041}} {{item:2031}} {{item:3340}} \n\nRush: {{item:3077}} , {{item:3706}} y {{item:1001}} \n\nCore:{{item:1416}}, {{item:3111}} o {{item:3047}} y{{item:3078}} \n\nItems situacionales ofensivos: {{item:3748}} o {{item:3074}} ,{{item:3053}} y {{item:3026}} \nItems situacionales defensivos: {{item:3065}} {{item:3083}} {{item:3068}} {{item:3075}} {{item:3110}} {{item:3800}} {{item:3143}} {{item:3194}} {{item:3742}} {{item:3512}} {{item:3060}} {{item:3190}} {{item:3109}} \n\nvisión y pociones: {{item:2138}} {{item:2055}} {{item:3364}} \n\n_El porque de esta build:_\n\nRush tiamat para tener daño en area, y poder limpiar con el tigre, sin necesidad de maxear fenix.\nSmite azul en la mayoria de los casos, roba un 25% de velocidad de movimiento al rival (**y te lo da a vos, dandote un 50% mas de velocidad de movimiento contra el rival que smiteaste, lo que te asegura que llegues a el, o que queme un summoner**)\nSmite rojo en el caso de un duelista ({{champion:23}} {{champion:11}} {{champion:266}} {{champion:39}} {{champion:24}} {{champion:2}} {{champion:421}} {{champion:5}} {{champion:106}} {{champion:48}})\nNavaja de sangre + trinidad: 2.5 de attack speed con el tigre maxeado = mas daño, mas curaciones, mas movilidad con la e y celeridad.\nCon la build ofensiva (** {{item:1416}} {{item:3111}} {{item:3078}} {{item:3074}} {{item:3053}} {{item:3026}} **) logras tener un daño demasiado alto (**3 basicos = 1 muerte del carry**) y tener un aguante medio, que ante un focus moris, pero tenes el angel guardian.\nCon la build defensiva (**por ejemplo: {{item:1416}} {{item:3111}} {{item:3078}} {{item:3748}} {{item:3110}} {{item:3065}}**) logras tener un aguante medio/alto sin sacrificar tanto daño (lo suficiente para matar a un carry, pero no deletearlo), esta build te da un late decente, pero es debil frente a supports de peel en hiper late.\n\nSi vas muy bien, te armas la build ofensiva, pero llega el minuto 30-35, no tengas miedo en vender el angel guardian y sacar un item de tanque que te sirva, quedando por ejemplo asi: {{item:1416}} {{item:3111}} {{item:3078}} {{item:3074}} {{item:3053}} {{item:3110}} o {{item:3065}} .\n\n_Maxeo de habilidades:_\nLvl 1 al 3: q > w > e.\nOrden del 1 al 18: q > w > e > q > q > e > q > e > q > e > e > w > w > w > w > r > r > r.\n\n_Combos:_ (**Priorizar tener las 3 cargas de la pasiva, no quedarse mucho tiempo en la misma posicion**).\n\n_Iniciacion:_ E > Basico > Q > 4 Basicos (**2 ataques de tigre**) > E (**si el rival corre**) o W (**si el rival pelea**).\n\n_Pelea:_ teniendo el ataque de tigre cargado, Basico (**ataque de tigre**) > Q > 4 basicos (**3 ataques de tigre en 5 basicos**) > E (**si el rival corre**) o W (**si el rival pelea**)\n\n\n\n_Udyr Fenix._\n\nRunas: Valor y Precision.\n_Valor:_\nReplica/Aliento del agonico\nDemolicion\nPiel de hierro\nRevitalizar.\n_Precision:_\nTriunfo\nGolpe de gracia.\n\n_El porque de estas runas:_\nReplica da aguante en la teamfight y un poco de daño adicional.\nAliento del agonico da sustain en las peleas largas y vida permanente.\nDemolicion ya que udyr fenix es bueno para el splitpush, ya que tiene mucha limpieza de oleadas.\nPiel de hierro debido a que la primera ruta de jungla de udyr es mas lenta con el fenix, para no perder vida.\nRevitalizar para dar mas escudo y curacion con la w al estar en vida baja.\nTriunfo + golpe de gracia porque al matar un enemigo, obtenes daño y curaciones, y te volves muy poderoso si empezas a matar enemigos, dificilmente te puedan matar.\n\n_Build:_\n\n_Comienzo:_ {{item:1039}} {{item:2031}} {{item:3340}} \n\n_Rush:_ {{item:3751}} {{item:3706}} {{item:1001}} \n\n_Core:_ {{item:1401}} {{item:3047}} o {{item:3111}} y {{item:3078}} \n\n_Items situacionales ofensivos:_ {{item:3115}} {{item:3091}} y {{item:3053}}\n\n_Items situacionales defensivos:_ {{item:3065}} {{item:3193}} {{item:3083}} {{item:3110}} {{item:3075}} {{item:3060}} {{item:3800}} {{item:3001}} {{item:3742}} {{item:3512}} {{item:3143}} {{item:3109}} {{item:3190}} {{item:3194}} \n\n_El porque de esta build:_\nComienza con {{item:1039}} , ya que el daño de la posicion del fenix, nos cura segun la cantidad de objetivos a los que le peguemos (**lobos, golems y pajaros curan demasiado**).\nCon {{item:3078}} y {{item:3115}} o {{item:3091}}, se logra bastante daño magico, y bastante aguante ya que hay 3 items defensivos, botas y 2 agresivos, dando daño suficiente para ganar duelos y aguantar mucho en teamfights.\nCon esta build se logra gran aguante y un daño medio, siendo una buena frontline con daño decente para tu equipo.\nSiempre sacar {{item:3091}} o {{item:3115}}, nunca los 2 juntos.\n\n_Maxeo de hablidades:_\nLvl 1 al 3: R > W > E.\nLvl 1 al 18: R > W > E > R > R > E > R > E > R > E > E > Q > Q > Q > Q > Q > W > W.\n\n_Combos:_ (**Priorizar tener las 3 cargas de la pasiva, para mayor velocidad de ataque y mas ataque de fenix**).\n\n_Iniciacion:_ E > Basico > R > 4 basicos (**2 ataques del fenix**) > Q (**Para la velocidad de ataque**) > E (**Si el enemigo corre**), R o W (**Si estas low hp, con las runas cuanta menos vida tenes mas escudo y curacion te da**) si el enemigo pelea.\n\n_Pelea:_ con ataque de fenix cargado, Basico > R > 4 Basicos (**3 ataques del fenix en 5 basicos**) > Q > (**velocidad de ataque**) > E (**Si el enemigo corre**), W (**Si estas low hp**) o R > Basicos para hacer mas daño/Curarte.\n\n\n_Rutas de jungla (Tigre)_\n\n_Lado rojo:_\n_Ruta agresiva lvl 3 (**la que mas uso yo**):_\nRed (**Leash de botlane**) > Blue > Gromp > Invade/Gank (**Preferible invade, ya que udyr tiene 10 segundos de ventaja si kitea bien la jungla y no missclickea**)\n_Ruta pasiva lvl 4_ > Red (**leash de botlane**) > Pajaros > Lobos > Blue (**Smite**) > Gromp > Escurridizo (**Matarlo con la w, asi ganas bastante vida**) > Gank top/mid.\n\n_Lado azul:_\n_Ruta agresiva lvl 3 (**la que mas uso yo**):_\nBlue (**leash de botlane**) > Lobos > Red > Invade/gank (**Preferible invade, ya que udyr tiene 10 segundos de ventaja si kitea bien la jungla y no missclickea**)\n_Ruta pasiva lvl 4:_ (**Es mejor de este lado, ya que no necesitas el escurridizo y no perdes tanta vida, porque tenes el blue al lvl 2 y podes spamear w**)\nBlue (**Leash de botlane**) > Lobos > Pajaros > Red (**Smite**) > Golems > Gank top/mid.\n\n_Rutas de udyr (Fenix)_\n\n_Lado rojo:_\n_Ruta agresiva lvl 3:_\nRed (**Leash de botlane**) > Lobos (**por el daño en area del fenix**) > Blue > Gank/Invade (**Preferible gank, ya que udyr fenix no tiene un early tan bueno como tigre, pero se compensa en mid/late**).\n_Ruta pasiva lvl 4:_ Red (**Leash de botlane**) > Pajaros > Lobos > Blue (**Smite**) > Gromp > Escurridizo (**matar con w, para curar hp**) > Gank top/mid.\n\n_Lado azul:_\n_Ruta agresiva lvl 3:_\nBlue (**Leash de botlane**) > Lobos > Red > Gank/Invade.\n_Ruta pasiva lvl 4:_\nBlue (**Leash de botlane**) > Lobos > Pajaros > Red (**Smite**) > Golems > Gank top/mid.\n\n\n_Matchups (Todos los junglas):_\n\n{{champion:266}} _Aatrox:_ Match facil hasta lvl 6, invadirle en earlygame, a partir de su nivel 6 evitalo, empeza a gankear y no tanto a buscar el versus.\n{{champion:32}} _Amumu:_ Match facil en todo momento, invadirle todo lo que puedas, y hace objetivos/counterjunglear cuando el gankee.\n{{champion:164}} _Camille:_ Match facil hasta lvl 6, camille va a gankear nivel 2, asi que la podes matar en su buff, robarselo, y counterjunglear en esa zona, si lo logras, ganaste.\n{{champion:131}} _Diana:_ Match facil hasta lvl 6, de todas maneras tenes las de ganar despues de ese nivel.\n{{champion:60}} _Elise:_ Match facil hasta nivel 9, despues te puede burstear. invadir en early.\n{{champion:28}} _Evelynn:_ Match facil hasta nivel 6, invadir todo lo posible hasta ese nivel, despues campearla en un bush o evitarla.\n{{champion:9}} _Fidlesticks:_ Match facil, invadir todo lo posible ya que es lento en limpieza de jungla.\n{{champion:79}} _Gragas:_ match facil 1vs1, dificil 2vs2, invadir y cuidado con el countergank.\n{{champion:104}} _Graves:_ match facil, 2 junglas de farmeo, pero udyr es mas rapido, invadir.\n{{champion:120}} _Hecarim:_ match facil hasta nivel 6. invadir todo lo posible hasta ese nivel.\n{{champion:427}} _Ivern:_ match facil hasta minuto 20, despues de ese minuto, dificil. poner vision en las entradas de la jungla y tradea objetivos, si te lo cruzas solo, matalo. BANEAR.\n{{champion:59}} _Jarvan:_ Match facil 1vs1, dificil 2vs2, cuidado con el countergank, invadir todo lo posible.\n{{champion:24}} _Jax:_ Match dificil 1vs1, pero facil en 2vs2, countergankealo y tradea objetivos, evita pelear contra el. BANEAR.\n{{champion:141}} _Kayn:_ Match facil hasta que se transforme en rhaast, invadir en earlygame.\n{{champion:121}} _K6:_ Match dificil si lo sabe usar, facil si se planta a melé, pelearle si es malo. BANEAR.\n{{champion:203}} _Kindred:_ Match favorable en todo momento, campear las marcas, invadir todo lo posible.\n{{champion:64}} _Lee:_ Match facil, seguro al nivel 3 te lo cruces en rio, lo podes matar, adelante.\n{{champion:11}} _Yi:_ Match facil si no saca kills, sacar smite rojo ya que con su ultimate es inmune a las ralentizaciones, por lo cual el smite azul no sirve. invadir todo lo posible, buscar pelea contra el.\n{{champion:57}} _Maokai:_ Match facil hasta minuto 25, invadir todo lo posible y terminar la partida, sino se pierde.\n{{champion:111}} _Nautilus:_ Match facil hasta minuto 25, invadir todo lo posible y terminar la partida, sino se pierde.\n{{champion:76}} _Nidalee:_ Match facil si es mala, difícil si es buena. buscar pelea nivel 3 para corroborar eso, si es buena, tradea objetivos y gankea lineas.\n{{champion:56}} _Nocturne:_ Match dificil, no stunearlo hasta que gaste su w, tradea objetivos y invadirlo en early.\n{{champion:20}} _Nunu:_ Match facil, wardear entradas de la jungla y busca pelea con el 1vs1, match dificil en 2vs2, cuidado con countergank.\n{{champion:2}} _Olaf:_ Match dificil de lvl 3 hasta lvl 9, despues es un match facil, gankear lineas y evitarlo hasta ese nivel.\n{{champion:80}} _Pantheon:_ Match dificil hasta lvl 9, despues es un match facil si no se fedea, gankear lineas y cuidado al nivel 6 con su ultimate.\n{{champion:78}} _Poppy:_ Match facil en todo momento, busca peleas 1vs1, 2vs2 e invadile su jungla.\n{{champion:33}} _Rammus:_ Match facil hasta nivel 6, despues de ese nivel evitarlo, antes de que tenga su ultimate, invadirlo todo lo posible. 2vs2 debil, cuidado con el countergank.\n{{champion:421}} _Reksai:_ Match dificil si la sabe jugar bien, facil si no la sabe jugar, corroborar eso al nivel 3, invadir todo lo posible hasta que tenga ultimate. BANEAR\n{{champion:107}} _Rengar:_ Match facil hasta nivel 6, invadir todo lo posible.\n{{champion:113}} _Sejuani:_ Match facil hasta nivel 6, invadir todo lo posible. BANEAR.\n{{champion:35}} _Shaco:_ Match dificil, wardear entradas de la jungla para evitar invades, y tradea objetivos. evitarlo hasta nivel 9.\n{{champion:102}} _Shyvana:_ Match facil, pero puede huir de vos hasta nivel 11 (e y q maxeadas), buscar pelea e invadir.\n{{champion:72}} _Skarner:_ Match facil hasta nivel 6, invadir hasta ese nivel.\n{{champion:48}} _Trundle:_ Match facil hasta nivel 6, invadir hasta nivel 6, despues de ese nivel, gankear lineas y evitarlo.\n{{champion:23}} _Tryndamere:_ Match facil hasta lategame, aprovechar al maximo el early, invadilo.\n{{champion:29}} _Twitch:_ Match facil, twitch va a gankear al nivel 2, lo podes matar en su segundo buff lvl 3 vs lvl 2, y robarle la jungla de ese lado, quedando lvl 4 vs lvl 2 y ganas, queda useless.\n{{champion:254}} _Vi:_ Match facil, esquivar la q. Match dificil desde lvl 6, evitarla despues de ese nivel, counterjunglear.\n{{champion:106}} _Volibear:_ Match dificil, no se le gana en ningun momento de la partida. Rushear vesta espinosa (Mini cota de espinas). BANEAR.\n{{champion:19}} _Warwick:_ Match dificil, cuando tire su E, stunearlo y correr hasta que termine su efecto. evitarlo despues del nivel 6 o esquivar su ultimate, pelearle kiteando en circulos.\n{{champion:62}} _Wukong:_ Match facil hasta nivel 6, aprovechar tu early game, invadilo, despues de nivel 6 evitarlo si tiene ultimate, countergankealo despues de ese nivel.\n{{champion:5}} _Xin Zhao:_ Match favorable, pero desfavorable en 2vs2, buscar 1vs1, cuidado con el countergank.\n{{champion:154}} _Zac:_ Match favorable hasta min 25, aprovechar tu earlygame, invadilo y hace objetivos, no puede responder hasta ese minuto.\n\n\n_Agresividad en early game:_\nUdyr tiene el mejor nivel 3 de todos los jungleros, y es uno de los que lo saca mas rapido (**min 2:20**), aprovecha esto, salvo que tengas un match desfavorable (**leer matchs**) e invadi, saca ventaja sobre el otro jungla, robale campamentos, matalo.\nUdyr decae en lategame, es conveniente cerrar todas las partidas antes del minuto 25, su winrate baja despues de ese minuto.\n\n_Consejos generales:_ Nunca dejar de farmear, 7cs/min minimo (**1 campamento cada 30 segundos**)\nSi tenes ventaja, aprovechala, un Udyr fedeado puede hacer 1vs2 tranquilamente.\nEs mejor invadir que gankear con Udyr, salvo que tengas un match desfavorable.\nEsquiva habilidades, ellos no pueden esquivarte (**salvo jax y teemo**) aprovecha eso, tenes mucha movilidad.\nUdyr es uno de los personajes mas completos, tiene movilidad, sustain, daño fisico, daño magico, cc, no tengas miedo de cambiar tu build, ni tu estrategia, con udyr podes.\n\nGracias por leer hasta aca, estuve 4 horas escribiendo todo :P (Valio la pena totalmente)\n\nPd: Si tuve un error de tipeo, haganmelo saber, asi corrijo.\n\nUn saludo, TUTI.","replies":[{"poster":"SAD Katarina","date":"2018-03-04T11:45:36.701+0000","up_votes":3,"down_votes":0,"body":"Amigo, no juego Udyr ni lo tengo pensado jugar, pero esta guia es util hasta para jugarle en contra. Re bien explicada y extensa, un poco dificil de leer en ciertas partes pero sin ser por eso 10/10, totalmente util.","replies":[{"poster":"DIOS TUTI","date":"2018-03-04T11:55:12.961+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SAD Katarina,realm=LAS,application-id=8sKIclmi,discussion-id=7MrIvVI5,comment-id=0000,timestamp=2018-03-04T11:45:36.701+0000)\n>\n> Amigo, no juego Udyr ni lo tengo pensado jugar, pero esta guia es util hasta para jugarle en contra. Re bien explicada y extensa, un poco dificil de leer en ciertas partes pero sin ser por eso 10/10, totalmente util.\n\ntotalmente, es invertir todo lo que puse en matchups segun el champ que juegues, me alegro que te sirva en ese sentido :P\n\nen donde es dificil de leer? lo puedo modificar.","replies":[]}]},{"poster":"Ivanhoe","date":"2018-05-25T17:28:21.262+0000","up_votes":1,"down_votes":0,"body":"buenas! che con los cambios en la jungla y muchos jgs que ahora cambiaron de perfil.. que recomendas hacer? (path y eso)","replies":[{"poster":"DIOS TUTI","date":"2018-05-25T17:33:54.298+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ivanhoe,realm=LAS,application-id=8sKIclmi,discussion-id=7MrIvVI5,comment-id=000b,timestamp=2018-05-25T17:28:21.262+0000)\n>\n> buenas! che con los cambios en la jungla y muchos jgs que ahora cambiaron de perfil.. que recomendas hacer? (path y eso)\n\nhttps://boards.las.leagueoflegends.com/es/c/guias-y-consejos/QEI9jRgB-guia-udyr-tigre-completa-s8-actualizada-parche-810","replies":[]}]},{"poster":"Ahegao best Drug","date":"2018-03-04T17:10:00.808+0000","up_votes":2,"down_votes":0,"body":"Una guia muy completa y muy detallada, pero que aun asi solo explica cosas muy básicas de udyr.\n\nEsas builds, son apenas las Standars para cada Stance, porque al tigre te lo podes armar tanto daño como off tank como dijiste pero tambien critico, tank, DPS. El fenix mas de lo mismo, se puede armar Full AP, AP off tank, Efectos de impacto, splitpush. Tambien está la build hibrida de DPS, es un campeon que pongas lo que le pongas si lo sabes usar podes hacer destrozos, podes armarlo soporte y aun asi ganar, podes armarlo full critico o letalidad y ganar, lo que quieras. Por eso es mi main, podes hacer lo que se te cante con el, no estas limitado a una sola build como otros champs.","replies":[{"poster":"DIOS TUTI","date":"2018-03-04T19:47:45.134+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RicosTraps UwU,realm=LAS,application-id=8sKIclmi,discussion-id=7MrIvVI5,comment-id=0005,timestamp=2018-03-04T17:10:00.808+0000)\n>\n> Una guia muy completa y muy detallada, pero que aun asi solo explica cosas muy básicas de udyr.\n> \n> Esas builds, son apenas las Standars para cada Stance, porque al tigre te lo podes armar tanto daño como off tank como dijiste pero tambien critico, tank, DPS. El fenix mas de lo mismo, se puede armar Full AP, AP off tank, Efectos de impacto, splitpush. Tambien está la build hibrida de DPS, es un campeon que pongas lo que le pongas si lo sabes usar podes hacer destrozos, podes armarlo soporte y aun asi ganar, podes armarlo full critico o letalidad y ganar, lo que quieras. Por eso es mi main, podes hacer lo que se te cante con el, no estas limitado a una sola build como otros champs.\n\nPuse las mejores builds en tigre y las mejores builds en fenix, vos no vas a ir a ranked con udyr full critico, ni full ap fenix, ni tigre tanque con 150 de daño por golpe, porque no escalas.","replies":[]}]},{"poster":"4V4D4 K3D4VR4","date":"2018-03-04T16:24:56.825+0000","up_votes":2,"down_votes":0,"body":"Excelente guía tuti querido!","replies":[]},{"poster":"Zelos From Jonia","date":"2018-03-04T14:02:16.113+0000","up_votes":2,"down_votes":0,"body":"Hola, buena guia.\n\nMuy apuntada al trade 1 v 1. Por ejemplo, con mao suelo serle muy rompe con el pimpollo, es mas se lo maxeo para joderlo por todo el mapa.\n\nCon zac y voly creo que tengo ganks mas efectivos, dependiendo del laner.\n\nCon udyr sos muy previsible y muy \"visible\" si pones un soloward es practicamente eso. Solo romperle la planta explosiva y ya no tiene gank.\nLa condicion de victoria es muy directa. Si lo invadis se queda terriblemente atras. Los champs meta lo derriten y le ganan en fuerza de gankeo.\n\nOjo con amumu, a amumu lo tenes que trakear y a nunu tambien, aunque les \"ganes\" no se olviden que tienen ganks muy buenos y son especialistas en joder al laner rival.\n\nXin te puede hacer un gank lvl, 2 tenes que avisar al equipo que no lo trackeas a lvl bajo si sos udyr.\n\nBueno eso basicamente, es un trinda con stunt y sin inmortalidad, es mecanicamente repetitivo, y si se queda atras no escala. A mi mucho no me gusta, pero la guia esta buena. \n\nP.D.: Falto vs alistar jg y ezreal. \n\nCreo que alistar supp zyra te hacen la vida imposible. \n\nSaludos!","replies":[{"poster":"DIOS TUTI","date":"2018-03-04T19:53:10.217+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zelos From Jonia,realm=LAS,application-id=8sKIclmi,discussion-id=7MrIvVI5,comment-id=0002,timestamp=2018-03-04T14:02:16.113+0000)\n>\n> Hola, buena guia.\n> \n> Muy apuntada al trade 1 v 1. Por ejemplo, con mao suelo serle muy rompe con el pimpollo, es mas se lo maxeo para joderlo por todo el mapa.\n> \n> Con zac y voly creo que tengo ganks mas efectivos, dependiendo del laner.\n> \n> Con udyr sos muy previsible y muy &quot;visible&quot; si pones un soloward es practicamente eso. Solo romperle la planta explosiva y ya no tiene gank.\n> La condicion de victoria es muy directa. Si lo invadis se queda terriblemente atras. Los champs meta lo derriten y le ganan en fuerza de gankeo.\n> \n> Ojo con amumu, a amumu lo tenes que trakear y a nunu tambien, aunque les &quot;ganes&quot; no se olviden que tienen ganks muy buenos y son especialistas en joder al laner rival.\n> \n> Xin te puede hacer un gank lvl, 2 tenes que avisar al equipo que no lo trackeas a lvl bajo si sos udyr.\n> \n> Bueno eso basicamente, es un trinda con stunt y sin inmortalidad, es mecanicamente repetitivo, y si se queda atras no escala. A mi mucho no me gusta, pero la guia esta buena. \n> \n> P.D.: Falto vs alistar jg y ezreal. \n> \n> Creo que alistar supp zyra te hacen la vida imposible. \n> \n> Saludos!\n\nes justamente eso, aprovechar tu early al maximo, y no te olvides de que tener el flash para hacer un gank seguro a midlane o botlane","replies":[]},{"poster":"Ahegao best Drug","date":"2018-03-04T16:01:14.476+0000","up_votes":1,"down_votes":0,"body":"Que no escala? Primero que nada es el mejor jungla duelista de early, en late es inmortal si lo buildeas y sabes jugar, podes entrar entre 5, matar al ADC y salir corriendo con vida.\n\nUdyr es el rey de la jungla. Puede invadir a cualquier jg, puede hacer buenos counterganks por su velocidad de movimiento y stun asegurado, puede meter presion haciendo split y rapidamente ir a otra parte del mapa que otro jg tardaria mucho más, las torres las bajas como a los minions, y eso. Alguien que sepa jugar bien a udyr puede hacer tremendas locuras que otro jg no puede, si no mira trick2g, se mete 1 vs 5 en torres de nexo, mata al adc, le da tiempo a vacilar con la maestria y despues irse y si los enemigos se ceban se termina matando a otro mas.","replies":[]}]},{"poster":"Galeon","date":"2018-03-04T21:55:03.782+0000","up_votes":2,"down_votes":1,"body":"¡Muy buena guía, gracias por compartir! {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Hnk Kenshiro","date":"2018-05-19T18:55:46.716+0000","up_votes":1,"down_votes":0,"body":"¿En que casos deberia escoger udyr fenix sobre el tigre?\n\nSiempre le encontre más debil.","replies":[{"poster":"DIOS TUTI","date":"2018-05-19T20:15:02.644+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=8sKIclmi,discussion-id=7MrIvVI5,comment-id=000a,timestamp=2018-05-19T18:55:46.716+0000)\n>\n> ¿En que casos deberia escoger udyr fenix sobre el tigre?\n> \n> Siempre le encontre más debil.\n\nacabo de actualizar la guia, respondiendo justamente a lo que me preguntas, toma. https://boards.las.leagueoflegends.com/es/c/guias-y-consejos/QEI9jRgB-guia-udyr-tigre-completa-s8-actualizada-parche-810","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2018-05-15T23:12:25.018+0000","up_votes":1,"down_votes":0,"body":"Que opinas de udyr tigre con cazador voraz?\n\nEn teoría te curas el 5-25% del daño de la Q, en jg, minioms y campeones.","replies":[{"poster":"DIOS TUTI","date":"2018-05-15T23:29:54.035+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=8sKIclmi,discussion-id=7MrIvVI5,comment-id=0009,timestamp=2018-05-15T23:12:25.018+0000)\n>\n> Que opinas de udyr tigre con cazador voraz?\n> \n> En teoría te curas el 5-25% del daño de la Q, en jg, minioms y campeones.\n\nno lo probe, pero sacrificaria celeridad + caminata sobre agua que son demasiado buenos con udyr","replies":[]}]},{"poster":"Ivanhoe","date":"2018-05-14T22:32:15.996+0000","up_votes":1,"down_votes":0,"body":"como haces para jugar jungla sin que te reporten todos los partidos (incluso cuando los carreas?)\nesa es la tip mas importante que me estaria faltando.\n\nno puedo jugar 1 mes jungla sin que me baneen el chat. vivo \"deshonroso\".\npracticamente no respondo y no insulto.\n\ny la temporada pasada tarde 2 meses en ser honor 5... pero claro, jugaba full suport\n\nsobre todo encuentro imposible flex. podes ir 10/2 que el yasuo mid que va 1/4 te va a flamear y empezar a contrajunglearte.\ny despues el y sus 2 amigos te van a reportar. es fija.","replies":[{"poster":"DIOS TUTI","date":"2018-05-14T23:05:09.662+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ivanhoe,realm=LAS,application-id=8sKIclmi,discussion-id=7MrIvVI5,comment-id=0008,timestamp=2018-05-14T22:32:15.996+0000)\n>\n> como haces para jugar jungla sin que te reporten todos los partidos (incluso cuando los carreas?)\n> esa es la tip mas importante que me estaria faltando.\n> \n> no puedo jugar 1 mes jungla sin que me baneen el chat. vivo &quot;deshonroso&quot;.\n> practicamente no respondo y no insulto.\n> \n> y la temporada pasada tarde 2 meses en ser honor 5... pero claro, jugaba full suport\n> \n> sobre todo encuentro imposible flex. podes ir 10/2 que el yasuo mid que va 1/4 te va a flamear y empezar a contrajunglearte.\n> y despues el y sus 2 amigos te van a reportar. es fija.\n\nyo no juego a gankear lineas, yo juego a invadir y meter presion psicologica al enemigo.\n\nyo no dependo de que los laners ganen las lineas para ganar la partida, es mas, con mi estilo de juego suelo sacarles presion, ya que obligo a los laners enemigos a ayudar a su jungler en vano, porque si hago bien las cosas, no me matan, y obviamente, no lo dejo gankear al jungla enemigo, y no me suelen flamear porque si pierden es 100% culpa de ellos.","replies":[{"poster":"Ivanhoe","date":"2018-05-15T01:06:36.250+0000","up_votes":1,"down_votes":0,"body":"maldicion... en mi ELO (oro 4-3) el mundo es tanto menos amigable :S","replies":[]}]}]},{"poster":"Akimoren ü","date":"2018-04-29T20:23:33.741+0000","up_votes":1,"down_votes":0,"body":"bro quiero ser tu amigo agregame","replies":[]},{"poster":"1471juan","date":"2018-03-04T13:30:03.564+0000","up_votes":1,"down_votes":1,"body":"No nene... ahora la gente sabe que existe otro champ con 55 de wr. gracias por hacer que lo nerfeen ...","replies":[{"poster":"DIOS TUTI","date":"2018-03-04T19:52:01.101+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=1471juan,realm=LAS,application-id=8sKIclmi,discussion-id=7MrIvVI5,comment-id=0001,timestamp=2018-03-04T13:30:03.564+0000)\n>\n> No nene... ahora la gente sabe que existe otro champ con 55 de wr. gracias por hacer que lo nerfeen ...\n\nesta bastante fuerte udyr por suerte, si le nerfean algo seria el escalado de la q, no veo otro nerf posible.","replies":[{"poster":"1471juan","date":"2018-03-04T20:14:57.136+0000","up_votes":1,"down_votes":0,"body":"era sarcasmo, no me importa el campeon, pero si esta fuerte y es free elo si sos un meta abuser.","replies":[]}]}]},{"poster":"Warwiick","date":"2018-03-04T15:10:24.136+0000","up_votes":1,"down_votes":0,"body":"Udyr le hace counter a {{champion:19}}  en late y nadie lo sabe D:","replies":[{"poster":"DIOS TUTI","date":"2018-03-04T19:51:16.430+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Warwiick,realm=LAS,application-id=8sKIclmi,discussion-id=7MrIvVI5,comment-id=0003,timestamp=2018-03-04T15:10:24.136+0000)\n>\n> Udyr le hace counter a {{champion:19}}  en late y nadie lo sabe D:\n\nes un match dificil, tiene que modificar su build para ser efectivo vs warwick, por ejemplo tenes a un ww jungla enemigo y un vladimir y un azir en el mismo team, pero vos te tenes que comprar una cota de espinas para hacerle algo. y al minuto 25 recien tenes la vesta espinosa, despues del item de jungla, trinidad y botas.","replies":[]}]}]}