{"poster":"Nîghtcast","date":"2017-02-15T07:17:15.299+0000","title":"Suche Partner für FlexQ","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Juhu ppl :)\n\nda ich nun erfolgreich meine SoloQ-Placements hinter mich gebracht habe und dadurch meine alte elo halten konnte (Platin), habe ich somit wenig Anreiz, mich weiter in der SoloQ aufzuregen. Jetzt zu meinem Anliegen. die FlexQ-Plazierung lag nicht wirklich in meinem Sinne (Silber 1) und w&uuml;rde mich gerne dort mit 1-2 anderen lustigen ppl reinst&uuml;rzen. Falls du dazu Lust h&auml;ttest, mit mir diesen Weg zu gehen (und in etwa die elos hast wie ich), sei herzlich eingeladen, weiterzulesen :)\n\nIch suche einen/mehrere Partner, mit denen ich mich gut verstehe und nicht stumpf und ohne Synergie wortlos im ts zu hocken. klar will man tryharden und gewinnen pipapo, aber der Spa&szlig; und das untereinander darf f&uuml;r mich einfach nicht fehlen :)\n\nRandnotizen zu mir: \n- 23 Jahre alt\n- Azubi zum examinierten Altenpfleger\n- nebenbei Fernstudium  (IT-Systemintegration)\n- wohne mit meiner gf zusammen ( nehme diesen Punkt mit rein, wegen ggf Hintergrundger&auml;uschen oder dass ich zwischendurch mal au&szlig;erhalb des ts rede)\n- spiele gerne alles au&szlig;er die Toplane (die anderen 4 Lanes wechseln sich in der Beliebtheit ab)\n\nNotizen zu dir (was ich w&uuml;nschenswert finde):\n- dein Alter sollte nicht an der 12 kratzen\n- kein stilles M&auml;uschen\n- flamen gerne im ts, aber nicht im ingamechat\n\nFalls du immernoch Interesse hast, feel free mich unter N&icirc;ghtcast zu adden :3\n\nEinen wundersch&ouml;nen tag noch^^","replies":[{"poster":"Nîph","date":"2017-02-15T08:43:16.545+0000","up_votes":1,"down_votes":0,"body":"Hey, klingt sehr gut was du schreibst. Auch wenn ich kein plan hab wasn GF sein soll... Kann man das essen?{{sticker:zombie-brand-facepalm}} \n\nBin aktuell Silber 4 in Solo und Flex. Zwischenzeitlich bin ich in Gold gewesen und hab mir für die Season Plat als Ziel gesetzt.\nSpiele seit season 1 und seit season 2 erst ranked. Sollte dich meine current Elo trotzdem nicht stören, feel free to sag bescheid und so {{sticker:slayer-jinx-wink}} \n\nBin 21, single und mache meine Ausbildung zum Optiker momentan ^^","replies":[]},{"poster":"fess123","date":"2017-02-16T08:31:20.184+0000","up_votes":1,"down_votes":1,"body":"Hi Nightcast,\n\ndu hast es satt alleine in der Flex Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/EB1PsvTk-aequilibritas-esports-sucht-rekruten-community-esports-organisation)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]}]}