{"poster":"para5yte","date":"2015-02-18T00:56:16.258+0000","title":"How can i improve in my ranked games?","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":0,"body":"Hey guys, i recently played my provs thinking i'll get into silver at least because of my kda through normal games however i was put in bronze 4 which i was fine with because a few friends watched me play and said i'll climb the ladder out of bronze pretty easy. Once i was in my division i played 3 ranked in a row and won all of them which made my really happy, however a few days later i played 5 ranked in a row and lost all of them (played {{champion:91}}  3 times in those also one of the games had 2 trolls/feeders which just brought boots and ran through mid lane.) I main talon mid which in normal i have a 80% chance win rate however in all my ranked games when i play talon, i usually win my lane 70% of the time, if not i usually roam to bot to get feed by 1-3 kills from their adc and sup. After getting a couple of kills in bot i usually rek the mid lane after. I always try my best to carry the game through out mid to late game, but some how my team usually don't take the advantage of me helping them and still ends up feeding or losing, and i know sometimes it's also my fault to but i'm really trying really hard to improve my game play so i can also help the team i play with win.\r\nSo if anyone has any suggestions please feel free to post it. :\")","replies":[{"poster":"Maraudaur","date":"2015-02-18T03:27:30.069+0000","up_votes":3,"down_votes":0,"body":"I recommend a few things:\n\n1. CSing seems to be a big issue for you. In your 5 losses you were mostly well below the **Creep Score** you should have at a given time. Missing out on so much gold hinders your ability to hit power spikes at relative times in the game.\ne.g. in your 3 talon losses you had **77 cs in 21 minutes**, **255cs in 47 minutes** and **94 cs in 25 minutes**! (remember the standard should be about 80-100cs every 10 minutes)\n\n2. You're dying too much. In your last 20 games you average 5.8 kills, **5.9 deaths** and 6.9 assists, which gives you an average KDA of **2.14**. Try to stay under 3 deaths a game and keep your KDA above 5. You will notice most of the games you win are highly correlated with your KDA being above 5. You need to find a way to make a greater impact on the game (csing and dying less can help!).\n\nBelow are also two great links to help you improve\n\nAttitude - Gbay99 ELO HELL vid\nhttps://www.youtube.com/watch?v=5MTO2a7ZFcc\n\nGame knowledge/skill - UNSW LoL Soc Leaguecraft lectures\nhttps://www.youtube.com/user/unswlolsoc","replies":[{"poster":"para5yte","date":"2015-02-18T09:46:43.443+0000","up_votes":1,"down_votes":0,"body":"Thanks man, i watch abitt of UNSW lol soc already. I'll start practicing more on the pointers you gave me. thanks again :)","replies":[{"poster":"Slim Chaedi","date":"2015-02-18T10:02:18.877+0000","up_votes":1,"down_votes":0,"body":"I don't know if you have ever done this, but I am assuming you haven't since your CS is low. My average CS is still pretty low, but I am a support/jungle main. I know I should still work on last hitting but I am lazy :P\nAnyway, it can help to just go into a custom game with no bots and practice last hitting with minimal AD, just to get good timing and patterns up a bit. You can also add a bot so you have to be mindful of some harass, although bots won't be the best for that it helps.","replies":[{"poster":"para5yte","date":"2015-02-18T10:48:22.506+0000","up_votes":1,"down_votes":0,"body":"Yea i do that sometimes, however one of my mistake is that i stop csing after laning phase unless i'm pushing a lane. Also all 2 of the talon games i played had trolls so i couldn't cs at all as the other team were really fed.","replies":[]}]}]}]},{"poster":"Schakle","date":"2015-02-19T07:57:39.575+0000","up_votes":1,"down_votes":0,"body":"CS more, Roam more, Ward more, and destroy more nexuses","replies":[]},{"poster":"Dawaraven","date":"2015-02-18T07:16:43.185+0000","up_votes":1,"down_votes":0,"body":"When you play talon be careful of selecting targets, see who has zhonyas, be mindful of exhaust, and who has GA. Also add rav he will duo u boost to silver :^)","replies":[]}]}