{"poster":"DiLsR","date":"2018-10-11T17:28:47.727+0000","title":"por que no se puede poner el nombre de un jugador","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"hola gente una pregunta por q no se puede poner el nombre de un jugador? para mi seria lo mejor poner el nombre del jugador que te trollear la partida, recien acabo de jugar una y me toca un veigar que trolleo y no ayudo la verdad el juego se vuelve dia a dia una mierdaa total no se cual es peor el dota 2 o el lol","replies":[{"poster":"Lee Sin Dinero","date":"2018-10-11T17:36:16.845+0000","up_votes":4,"down_votes":0,"body":"Desconozco el motivo exacto del porque no se puede, pero piensa que muchas veces uno juega mal y lo tachan de troll, o nunca tuviste una mala partida y te trataron de troll? en ese caso todos tendríamos nuestros nicks en el foro","replies":[{"poster":"DiLsR","date":"2018-10-11T18:25:54.107+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lee Sin Dinero,realm=LAS,application-id=v7qsfXsE,discussion-id=hA9nez8K,comment-id=0000,timestamp=2018-10-11T17:36:16.845+0000)\n>\n> Desconozco el motivo exacto del porque no se puede, pero piensa que muchas veces uno juega mal y lo tachan de troll, o nunca tuviste una mala partida y te trataron de troll? en ese caso todos tendríamos nuestros nicks en el foro\n\nuna cosa es que tengas una partida mala y otra cosa es que trollees y que lo digas en el chat del juego. Yo tuve malas partidas y no es el hecho que voy a trollear el juego a los demas este jugador lo hizo aproposito y le decia en el chat que no iba a jugar queria que perdamos","replies":[{"poster":"Shulys","date":"2018-10-11T18:58:54.265+0000","up_votes":1,"down_votes":0,"body":"Con sacarte fotos al chat y a la partida en esos momentos cruciales, serian buenas pruebas para mandar a soporte. Pero no se puede hacer mas.","replies":[]}]}]},{"poster":"Player1 Ryzen5","date":"2018-10-11T17:38:06.686+0000","up_votes":4,"down_votes":1,"body":"Te lo planteo al revez, ¿por que seria bueno ponerlo?\n\nEn definitiva, la partida ya paso, si lo reportaste ya esta hecho el trabajo, y por mucho que lo debatamos no vamos a volver el tiempo atrás. Saber su nombre no nos cambia nada, y quizás no aparezca en ninguna de nuestras partidas.\n\nSi quieres que lo vea algún responsable del sistema, pues el foro es para los usuarios, somos nosotros (que no tenemos nada que ver con esa partida en particular) los que lo vamos a ver. E incluso es probable que ningún responsable llegue a leer eso en el mar de post. \nTampoco se va a ir buscando nicks para sancionar a dedo, han hecho mucho incapie en ese punto en varios post.\n\nPara finalizar, si no llegaste/pudiste reportar la actitud, podemos enviar un ticket a un responsable, donde te aseguras que a alguien llegue (aunque si podría no satisfacerte la respuesta).\n\nVuelvo, ¿por que seria bueno ponerlo?","replies":[]},{"poster":"Puynsi","date":"2018-10-11T18:35:53.245+0000","up_votes":1,"down_votes":0,"body":"Porque rito usa la palabra magica \"toxico\" y ya no podes hacer como antes que tenias el chat que cuando aparecia un troll se lo reportaba en collectivo y aparecia en 3 dias en la pagina del tribunal para clavarle ban.","replies":[]},{"poster":"Shulys","date":"2018-10-11T18:26:24.996+0000","up_votes":1,"down_votes":0,"body":"Es ilegal según las reglas del foro.\nEl foro es para opinar entre los jugadores, no es para reportar, y no nos interesa quien te fastidio la partida pues puede que en la nuestra no nos toque con el o incluso si pasa, quizás juegue bien.\n\n¿Esperas que lo reportemos si lo encontramos en alguna partida? ¿Suponiendo que recordemos su nombre? \n\nSi nos toca y vemos un mal comportamiento, somos gente grande y sabemos reportar post partida.\nPuedes venir y desahogarte que nosotros que  trataremos de consolarte y apoyarte en tanto tengas razón, y en ocaciones podemos guiarte para que no caigas a su nivel.\nPero no nos sirve saber quien fue, quizás a Riot si, pero el no esta aquí.\n\n{{sticker:sg-ahri-2}}","replies":[]}]}