{"poster":"SkaylamM","date":"2018-02-08T19:52:37.264+0000","title":"nerf draven","subforum":"Jugabilidad, balance y narrativa","up_votes":2,"down_votes":12,"body":"como es posible que un draven con 1 item pegue 315 con las hachas y un adc comun tenga que tener 4 item para que pegue lo mismo que un draven","replies":[{"poster":"TSW Rorschach","date":"2018-02-08T21:48:08.512+0000","up_votes":2,"down_votes":0,"body":"Porque daño en juego temprano es **lo único** que lo hace fuerte frente a otros adcs. Sin eso, el campeón sería completamente inútil porque no destacaría en nada. \n\nEs de los adcs que más se castiga el morir, ya que te puede dejar afuera de la partida gracias a perder el 75% de tus cargas (y olvidate si no te dejan kills de conseguir ventaja sobre el otro adc). \n\nTiene problemas para freezear  (por ende, es propenso a gankeos y romeos del mid) y aparte es muy zoneable. \n\nSufre los tradeos cortos donde no pueda llegar a responder cuando farmea, y si llega a perder las hachas se lo comen crudo (especialmente en tf donde muchos pierden el posicionamiento). Consideremos que esto no es cosa no muy difícil si sabes zonear con habilidades específicas, como la Q de morgana por ejemplo.\n\nAparte y para agregar, Draven es un campeón como Vayne que es más efectivo contra un solo objetivo. Así que en tf tiene que concentrarse en un solo personaje. Con ver la dirección de sus hachas es fácil saber hacia dónde apuntar el focus.\n\nOtra cosa y no menos importante, hay muchos Draven que confiados en el daño, se venden.\n\n\n\nDraven tiene muchas contras, aunque no lo parezca. {{champion:119}}","replies":[]},{"poster":"Saiko 113","date":"2019-02-02T15:57:43.122+0000","up_votes":1,"down_votes":0,"body":"Draven esta muy balanceado, de hecho habría que bufearlo algo jaja","replies":[]},{"poster":"Pola369","date":"2018-02-08T20:28:00.451+0000","up_votes":1,"down_votes":0,"body":"Para contrarestarlo en early fijate donde cae su hacha y tirale alguna habilidad ahi y lo hostigas","replies":[]},{"poster":"LoIo","date":"2018-02-08T19:56:54.690+0000","up_votes":1,"down_votes":0,"body":"Es lo que tiene el early de Draven, bienvenido al League of Draaaaaaven.\nDespués en late decae y cualquier otro adc se lo come en TFs, Draven no tiene TF o stompeas el early o quedás useless.","replies":[]},{"poster":"Lucio22","date":"2018-02-08T19:56:40.088+0000","up_votes":1,"down_votes":0,"body":"Porque draven siempre se basó en la q para hacer daño. Si te fijas la ulti no hace tanto daño como otras (por lo menos lo siento asi), su w es un buff de velocidades y su e sólo sirve por el poco cc que aplica, mientras que su pasiva sólo da oro circunstancialmente. Su q es literalmente su única fuente de daño, marca a donde va a caer el hacha para que el enemigo pueda castigarlo si se manda mucho y funciona como un básico (por lo que los blind lo joden mucho), so...","replies":[]}]}