{"poster":"Cracked1234","date":"2015-09-11T17:30:55.451+0000","title":"Zed, Tipps und Tricks?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hey Liebe Community,\r\nIch bin ein {{champion:238}}  Main und m&ouml;chte mich gerne verbessern.\r\n\r\nEs w&auml;re gut wenn ihr mir Tipps sagen k&ouml;nntet oder Matchups, die gut oder Schlecht f&uuml;r Zed sind und wie man mit diesen Umgehen soll.\r\n\r\nDanke im Vorraus und Liebe Gr&uuml;&szlig;e","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-11T22:37:43.582+0000","up_votes":2,"down_votes":0,"body":"Da sich leider noch niemand meldete mach ich das mal (ich hasse {{champion:238}}  -.-)\n\n1. Tipps:\nWie gesagt bin ich kein Faker auf Zed, kenne aber einige Aspekte von ihm. \nZed hat ein verdammt hohes Outplaypotential mit seinen Schatten. Diese richtig einzusetzen ist für viele überfordernd. Diesbezüglich brauchst du einfach Übung.\nIm Early kannst du mit deinen Spells entweder sicher Farmen oder Harassen. Da Zed dank seiner Passiven gut unter dem Tower farmen kann, ist beides immer eine Option.\nAls Zed solltest du auf die Itembuilds deiner Gegner achten. Fällt dir dort ein {{item:3157}} oder {{item:3140}} auf, hast du ein UItimatetarget weniger. Diese Items machen deine Ultimate relativ effektlos und es wäre Schade diese zu verschwenden.\nZeds Spellabfolge ist oft Situationabhängig. Grob gesagt: Gegen unmobile Champions sollte man meistens versuchen nach einer Ultimate 3 Qs zu treffen (also Ultimate, W und dann Q). Gegen mobile Champion sollte man sich das W zum Chasen/Disengagen erstmal aufbewahren.\n2. Gute Matchups\nZed ist stark gegen Champions mit vielen Skillshots, da er mit seinen Shadows viel Dodgen kann. Folglich sind z.B. {{champion:99}} und {{champion:45}} ein leichtes für ihn. \nEbenso haben Melee AP Champions Probleme gegen ihn, da er meist mehr Schaden als diese verursacht, diese jedoch an ihn heranmüssen. Folglich sind {{champion:38}} und {{champion:55}} auch eher schlecht gegen Zed.\n3. Schlechte Matchups\nZed hat Probleme mit CC und Spells die seine Ultimate blockieren können. Folglich hat Zed Schwächen gegen (z.B.) {{champion:10}} , {{champion:127}} , {{champion:90}} und {{champion:8}}.\n4. Umgang mit guten Matchups\nGegen Champions die Zed countert kann man gerne offensiv spielen (vor allem ab Level 6). Die Chance hier einen Kill zu ergattern ist recht hoch und lässt Zed aufgrund des leichten Matchups stark snowballen.\n5. Umgang mit schlechten Matchups\nHier kann man meist (wenn überhaupt) bis zu Level 6 offensiv spielen und sollte versuchen vor dem Gegner Level 6 zu werden. Schafft man dies ist meist ein Kill garantiert. Sollte dies unmöglich sein, sollte man sich auf Roamen vorbereiten, da man z.B. gegen eine {{champion:127}} auf der Lane wenig ausrichten kann.\n\nIch hoffe ich konnte dir damit helfen und stehe natürlich für weitere Fragen offen :)","replies":[{"poster":"Phridolin","date":"2015-09-11T23:47:22.291+0000","up_votes":1,"down_votes":0,"body":"Super erklärt! Zu erwähnen sei vllt noch, dass man mit Zed gut Poken kann (W,E,Q Combo) Man aber immer aufpassen sollte, das nicht zu oft zu machen da man sonst bei 'nem Gank 'nen kostbaren Flash raushauen muss. (Abhilfe schafft da natürlich_ warden_, aber als Zed will man ja viel Dmg schon early machen :P)\n\n(ich hasse **abgrundtief** {{champion:90}} und {{champion:8}}  XD)","replies":[{"poster":"Staatsanwalt","date":"2015-09-12T19:30:09.675+0000","up_votes":1,"down_votes":0,"body":"gegen Malz hilft QSS und er ist nutzlos","replies":[{"poster":"Phridolin","date":"2015-09-13T00:02:09.063+0000","up_votes":1,"down_votes":0,"body":"Was hilft mir eine einsteigerfreundliche Routertaste gegen Malz?","replies":[{"poster":"Staatsanwalt","date":"2015-09-13T08:24:03.270+0000","up_votes":1,"down_votes":0,"body":"Oh ein Witzbold","replies":[{"poster":"Phridolin","date":"2015-09-13T09:13:51.774+0000","up_votes":1,"down_votes":0,"body":"Immer doch mein Herr :)","replies":[{"poster":"Phridolin","date":"2015-09-13T09:14:25.771+0000","up_votes":1,"down_votes":0,"body":"oder Dame","replies":[]}]}]}]}]},{"poster":"SoloQisMentlBoom","date":"2015-09-11T23:59:41.114+0000","up_votes":1,"down_votes":0,"body":"Ja das habe ich vergessen. Wie gesagt spiele so gut wie nie Zed.\n\n{{champion:90}} war Season 3 mein Main :D","replies":[{"poster":"Phridolin","date":"2015-09-12T09:26:13.804+0000","up_votes":1,"down_votes":0,"body":"Neeeeeeeeeeee wirklich? :=o \n\nIst doch nicht schlimm! Hab ja nur was \"dran gesetzt\"","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-12T12:32:21.075+0000","up_votes":1,"down_votes":0,"body":"Yep. Ersten 11 Spiele mit ihm 11 Siege :D\nIm Ranked wohlgemerkt","replies":[{"poster":"Phridolin","date":"2015-09-13T00:03:49.676+0000","up_votes":1,"down_votes":0,"body":":D TOP! Malt ist auch wirklich ein starker Champ (in den richtigen Händen ;-) )","replies":[]}]}]}]}]}]},{"poster":"Bluefersan","date":"2015-09-18T14:46:32.094+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=Faee5i913d4\n\ndas wichtigste ist drinn , hf beim üben.","replies":[]},{"poster":"Merimor","date":"2015-09-12T19:11:11.553+0000","up_votes":1,"down_votes":0,"body":"So hallo erstmal\n\nIch maine Zed jetzt seit Season 3 und kann dir daher schon in gewisser Weise weiterhelfen.\nAllerdings würde ich es vorziehen, das ganze Irgendwie auf nem TS zu klären, da der Champion meiner Meinung nach einfach zu umfangreich ist, um das in nem einzelnen Beitrag zusammenzufassen.\nAlso wenn du Lust hast adde mich einfach Ingame ;)","replies":[{"poster":"areNbee","date":"2015-09-18T14:43:14.731+0000","up_votes":1,"down_votes":0,"body":"Und nach 2 weiteren Seasons immer noch Gold? Ich will ja nicht flamen, aber das klingt doch echt komisch Dude. Wie willst du jemandem etwas beibringen, wenn du es selber nicht mal schaffst mit deinem Main aus Gold zu kommen? :D","replies":[]}]}]}