{"poster":"doubleonerd","date":"2017-03-19T00:17:31.178+0000","title":"Mac game allows me to play for about a minute, then black screen and forced reboot!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hi guys! \r\n\r\nI play league on a MacBook pro 15\" 2011 model, and I have never had any issues. Recently as of 18 March 2017 I have had a few issues, culminating in a recurring issue. The current issue is that league lets me play for a minute or so, and then the screen goes black. Through the speakers is the sound of the track skipping on loop. Then, the MacBook restarts automatically after about 20 seconds of this. Rebooted, got back into game, happened again! No other apps open etc.... Never had any issues like this before. Immediately prior to this, I had an issue where it would close because I was having an issue getting it to scale to my new monitor and it would just crash. Not using it now and this new issue has begun. \r\n\r\nPlease help!","replies":[{"poster":"Broporo","date":"2017-03-19T02:01:33.722+0000","up_votes":1,"down_votes":0,"body":"If your computer is forcing itself to shut down entirely on its own after playing for only 20 seconds, there's a decent chance that it could be overheating. All computers have a safety precaution built in that will cause it to shut down. It does this in an effort to help prevent melting its internal hardware or to stop it from causing a fire. \n\nSince there could be a number of different issues causing this, I'd like to have you get in touch with our tech guys through a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new). They'll be able to give much better context into what's happening.","replies":[]},{"poster":"Man In Sky","date":"2017-03-19T00:39:03.201+0000","up_votes":1,"down_votes":0,"body":"It happened to me once, the only temporary fix was to put it in full screen mode. Mind you that mines did not go permenantly black, it flashes extremely fast into black screen then game play and it was hurting my eyes. So putting it in full screen gave me 30 fps because it looked like it tried to do it, but it was restricted.\n\nI just restarted and it fixed it.","replies":[]}]}