{"poster":"manial fly","date":"2018-03-06T14:23:50.250+0000","title":"Das Reportsystem muss geändert werden!","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":14,"body":"Ich wei&szlig; das hier t&auml;glich Diskussionen &uuml;ber das derzeitige Reportsystem gef&uuml;hrt werden, aber ich hatte gerade wieder mal so ein Spiel was mir verdeutlicht hat wie traurig diese ganze Situation in der Community ist.\r\nZu 90% spiele ich schon nur mit Premades weil es wirklich schon nahezu unm&ouml;glich ist ein gescheites Spiel mit Randoms auf die Reihe zu bekommen, aber gut gerade hatte ich dann doch mal wieder ein Spiel alleine und mir ist auch direkt wieder bewusst geworden warum ich nur noch so selten alleine spiele.\r\n\r\nAn sich lief es alles gar nicht so bescheiden, der gegnerische Jungler und Midlaner haben etwas genervt und wir standen auch kurzzeitg mal 4/12, konnten aber durch nen guten Teamfight wieder einiges rausholen und ein St&uuml;ck weit ausgleichen. Bedauerlicherweise standen unser Midlander und unser ADC (beide Premades) nach 15 Minuten 1/8 und 0/4, hatten deshalb keine Lust mehr auf das Spiel und wollten surrendern. Wir anderen drei nat&uuml;rlich nicht weil noch alles drin war und wir gerade auf dem Weg waren wieder gut aufzuholen. Nachdem der Vote dann auch 3 zu 2 ausgegangen ist, haben sich die beiden afk in die Base gestellt und nur rumgetanzt f&uuml;r die darauffolgenden f&uuml;nf Minuten. Demnach durften wir dann zu dritt versuchen gegen f&uuml;nf Leute unsere Base zu verteidigen was nat&uuml;rlich nicht geklappt hat. Einer von den anderen beiden meinte dann wir sollten aufgeben weil 3vs5 sowieso verloren ist, worauf hin ich geschrieben hab das wir gerade deshalb nicht aufgeben sollen weil die beiden sonst nur ihren Willen durchbringen. Was wiederum von den beiden AFK Typies damit kommentiert wurde das es ihnen egal ist wie lang das Spiel dauert und sie solange etwas anderes spielen w&uuml;rden. Als dann geschrieben wurde das wir sie f&uuml;rs AFK sein reporten kamen dann nur so Kommentare nach dem Motto, macht doch es passiert sowieso nichts. Und genau das ist der springende Punkt, es passiert wirklich nichts obwohl ganz offensichtlich ist das die beiden das Spiel sabotiert haben.\r\n\r\nWeshalb verh&auml;lt sich denn die Community so schei&szlig;e? Weil jeder wei&szlig; das es zig Jahre brauch bis Riot mal aktiv wird. Du kannst jedes Spiel flamen wie du willst, solang du nicht &quot;kys&quot; oder &quot;fgt&quot; schreibst passiert ewig nichts. Du stehst ein paar Minuten tanzend in der Base rum? Solang du das nicht noch ein paar mal machst passiert wieder nichts. Riot muss endlich mal anfangen seine Toleranzgrenze deutlich runter zuschrauben, ich komme mir n&auml;mlich langsam als Spieler der sich immer vorbildlich verh&auml;lt ziemlich verarscht vor.","replies":[{"poster":"WC9 Umbra","date":"2018-03-06T15:05:27.862+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=manial fly,realm=EUW,application-id=KYnfKGf0,discussion-id=1QEAXMsb,comment-id=,timestamp=2018-03-06T14:23:50.250+0000)\n>\n Du kannst jedes Spiel flamen wie du willst, solang du nicht &amp;quot;kys&amp;quot; oder &amp;quot;fgt&amp;quot; schreibst passiert ewig nichts. \n\nUnd hier haben wir das Problem.","replies":[{"poster":"Sirrkas","date":"2018-03-06T17:12:30.441+0000","up_votes":7,"down_votes":1,"body":"Auch wenn ihr beide der Ansicht seid, dass man nur für Faggot und KYS bestraft wird, wird es dadurch nicht zur Tatsache, sondern bleibt falsch.","replies":[{"poster":"WC9 Umbra","date":"2018-03-06T17:24:08.695+0000","up_votes":2,"down_votes":6,"body":"Ich habe nicht ausgeschlossen, dass man für andere vergehen nicht bestraft wird. Die Toleranz ist nur unterschiedlich. Richtig toxische leute sind riot nicht so wichtig wie Spieler, die ein paar mal fgt schreiben. \nLeider ist es für die Spieler schlimmer einen Toxischen nerfidioten zu haben, als jemanden, der sie faggot nennt,","replies":[{"poster":"Sirrkas","date":"2018-03-06T17:43:13.798+0000","up_votes":6,"down_votes":0,"body":"Doch hast du. Lies mal deine älteren Beiträge:\n\n> [{quoted}](name=Óne Dunk Man,realm=EUW,application-id=KYnfKGf0,discussion-id=HEh7pimV,comment-id=0005,timestamp=2018-03-06T07:24:02.410+0000)\n>\n> Faustregel:\n> \n> Du kannst so toxic sein wie du willst, solange du nicht Begriffe wie &quot;fgt&quot; benutzt.\n> Willkommen bei Riot games.\n\nHier bitte.","replies":[{"poster":"WC9 Umbra","date":"2018-03-06T17:48:56.621+0000","up_votes":1,"down_votes":5,"body":"Achso machen wir das jetzt so? An Formulierungen festhalten, ohne Sinn und Verstand? Hinter den Zeilen lesen kann helfen.","replies":[{"poster":"Sirrkas","date":"2018-03-06T19:41:27.574+0000","up_votes":8,"down_votes":0,"body":"Ich kann durchaus lesen, ich habe dir nur aufgezeigt, wo sich deine Aussagen widersprechen. Es ist nicht meine Schuld, wenn du behauptest, man wird nur für etwas wie fgt bestraft, hier eine Aussage zitierst und der zustimmst, die das gleiche Bild zeichnet, wie deine vorherige und jetzt behauptest, du hättest das nicht so gemeint.","replies":[]},{"poster":"Homunculi","date":"2018-03-07T20:02:13.408+0000","up_votes":6,"down_votes":0,"body":"Sorry aber deine eigene Argumentation wurde gegen dich verwendet, aber du willst es nicht verstehen, mal die eigenen Zeilen lesen, kann helfen.","replies":[]}]}]}]}]}]},{"poster":"5weeds","date":"2018-03-06T14:37:09.842+0000","up_votes":6,"down_votes":1,"body":"Zuallererst: ich kann absolut verstehen, dass sich so viele Spieler darüber ärgern.\nMich würde es auch (pardon) ankotzen, wenn ich solche Leute in meinem Spiel hätte.\n\nTatsächlich kann ich aber nicht von solchen Erlebnissen berichten.\nGut, der ein oder Andere feedet mal, aber toxisch ist keiner in meinen Spielen (vereinzelt tritt auch mal ein Flamer auf, aber eher selten).\n\nIch weiß ehrlich nicht woran das liegt, ich weiß nur, dass das seit dem Honorsystem so ist.\nKann sein, dass RIOT Leute mit hohen Honorstufen zusammen tut, aber so fühlt es sich zumindest für mich an.\n\n> ich komme mir nämlich langsam als Spieler der sich immer vorbildlich verhält ziemlich verarscht vor.\n\nIch spiele \"vorbildlich\" und treffe (beinahe) nur auf andere, ebenfalls vorbildliche Spieler.","replies":[{"poster":"manial fly","date":"2018-03-06T14:57:07.685+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=5weeds,realm=EUW,application-id=KYnfKGf0,discussion-id=1QEAXMsb,comment-id=0000,timestamp=2018-03-06T14:37:09.842+0000)\n>\n> Zuallererst: ich kann absolut verstehen, dass sich so viele Spieler darüber ärgern.\n> Mich würde es auch (pardon) ankotzen, wenn ich solche Leute in meinem Spiel hätte.\n> \n> Tatsächlich kann ich aber nicht von solchen Erlebnissen berichten.\n> Gut, der ein oder Andere feedet mal, aber toxisch ist keiner in meinen Spielen (vereinzelt tritt auch mal ein Flamer auf, aber eher selten).\n> \n> Ich weiß ehrlich nicht woran das liegt, ich weiß nur, dass das seit dem Honorsystem so ist.\n> Kann sein, dass RIOT Leute mit hohen Honorstufen zusammen tut, aber so fühlt es sich zumindest für mich an.\n> Dass RIOT AFKler und Flamer in eine Q packt, wurde ja (soweit ich mich nicht irre) bestätigt.\n> \n> Ich spiele &quot;vorbildlich&quot; und treffe (beinahe) nur auf andere, ebenfalls vorbildliche Spieler.\n\nOk vlt bin ich dann auch nicht vorbildlich, ich weiß nur das ich in vier Jahren LoL noch nie eine Strafe oder Verwarnung bekommen habe, und zur Zeit auf Honor Level 3.1 bin. Wenn ich mich irgendwie noch vorbildlicher verhalten soll damit ich von solchen Leuten verschont bleibe bin ich offen für Vorschläge. \nVielleicht habe ich aber auch Pech das ich Mitspieler habe die sich rein zufällig immer nur im Spiel mit mir daneben benehmen?\n\nVersteh mich nicht falsch, ich habe auch nicht jedes Spiel so Leute ihm Team, aber trotzdem immer noch regelmäßig und es kann einfach nicht sein das so Leute wie in dem oben genannten Spiel mit ihrem Verhalten durchkommen. Ich bin der letzte der schreit das Leute die 0/10 stehen oder das halbe Spiel aus unerklärlichen Gründen afk sind bestraft werden. Aber Spieler die so offensichtlich die Verhaltensregeln mit Füßen treten müssen auch sofort verdeutlicht bekommen dass so etwas nicht in Ordnung ist. \n\nIch weiß auch nicht wrm meine Post direkt wieder massig Down Votes hat. Anscheinend sieht es der Großteil der Community so wie Riot und findet so ein Verhalten ok.","replies":[{"poster":"Temudschinn","date":"2018-03-06T15:02:50.568+0000","up_votes":3,"down_votes":0,"body":"Ich denke niemand hier findet leaven etc. Ok, die downvotes kommen vermutlich eher daher dass die Lösung \"Toleranzwerte runter\" nicht besonders durchdacht ist.","replies":[{"poster":"Sirrkas","date":"2018-03-06T17:14:03.419+0000","up_votes":3,"down_votes":1,"body":"Vermutlich deshalb und weil der Teil mit, man wird nur für KYS und Fag bestraft falsch ist.","replies":[]}]}]},{"poster":"Temudschinn","date":"2018-03-06T14:47:25.068+0000","up_votes":3,"down_votes":0,"body":"Ein \"Prisoners Island\", also eine queue für leaver und flamer, wurde bisher von Riot immer abgelehnt. Worauf also stützt du deine Aussage?","replies":[{"poster":"5weeds","date":"2018-03-06T14:49:06.504+0000","up_votes":2,"down_votes":0,"body":"Verzeih, dann lag ich da einfach falsch.\nZeile wurde gelöscht.","replies":[]}]},{"poster":"Nocì","date":"2018-03-06T14:49:49.208+0000","up_votes":2,"down_votes":0,"body":"> Ich weiß ehrlich nicht woran das liegt, ich weiß nur, dass das seit dem Honorsystem so ist.\nKann sein, dass RIOT Leute mit hohen Honorstufen zusammen tut, aber so fühlt es sich zumindest für mich an.\nDass RIOT AFKler und Flamer in eine Q packt, wurde ja (soweit ich mich nicht irre) bestätigt. < \ndas ist falsch!\nEs gibt keine \"Strafqueue\" wo afkler, flamer, etc. vorkommen. Auch das Honorlevel hat keinen Einfluss auf das Matchmaking. Sonst würde ja das ganze System Matchmaking nicht funktionieren. Es würde Parallelwelten geben zwischen netten spielern und flamern. \n\nIch treffe auch sehr selten solche leute aber es wird nicht aktiv getrennt.\n\n\n\n\nMeiner Meinung sollte wenn jemand \"im afk bc u suck\" oder in der Basis rumTANZEN direkt mit dem 14-Tage bestraft werden.\nWenn jemand soetwas einmal macht UND vorher im chat noch androht, ist es gerechtfertigt. \nVorallem dann hat man ja noch die Beweislage das es absichtlich war, weil es steht ja im Chat oder man hat Strg+4 gedrückt (war doch Tanzen oder?). Oder auch Leute die sagen \"i int\" und dann die Mitte runter rennen. Gibts wohl auch. Die machen das nur einmal und laufen dann nurnoch rum damit das nicht als AFK erkannt wird. \nDa müsste man einen BOT einrichten der erkennt ob es gerade Sinn macht was ein Spieler macht oder ob es Trolling/Inting/etc. ist. Vorallem wenn es im chat angedroht wurde.","replies":[]}]},{"poster":"Temudschinn","date":"2018-03-06T14:55:41.816+0000","up_votes":4,"down_votes":0,"body":"Toleranzwerte runter klingt erstmal gut.\n\nDas ganze hat leider ein paar Haken: Wenn ich ein Hardwareproblem habe, denke ich hätte es gefixt und dann doch wieder rausfliege, bin ich eigentlich sehr froh um eine Toleranzschwelle die mich nicht bestraft.\nDer grössere Haken aber sind Falsch-positive Ergebnisse. Deren Anzahl nimmt massiv zu, wenn du die Toleranzwerte senkst. Falsch-positive Bans sind aber ein grosser imagesvhaden für Riot, und mehr noch: sie senken die Glaubwürdigkeit und Effektivität der Bans. Wenn ein Spieler jetzt gebannt wird, weiss er klar dass er schuldig ist. Entsprechend ist die Chance auf Einsicht massiv höher.\nWenn allerdings immer mehr falsch-positive Fälle im Internet rumgeistern, nimmt keiner mehr die Bans ernst - aich nicht die, die zu Recht ausgesprochen wurden. Das erhöht langfristig die Toxizität und kann sogar dazu führen, dass trotz mehr Bans mehr toxische Spieler unterwegs sind.","replies":[{"poster":"manial fly","date":"2018-03-06T15:07:57.685+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Temudschinn,realm=EUW,application-id=KYnfKGf0,discussion-id=1QEAXMsb,comment-id=0001,timestamp=2018-03-06T14:55:41.816+0000)\n>\n> Toleranzwerte runter klingt erstmal gut.\n> \n> Das ganze hat leider ein paar Haken: Wenn ich ein Hardwareproblem habe, denke ich hätte es gefixt und dann doch wieder rausfliege, bin ich eigentlich sehr froh um eine Toleranzschwelle die mich nicht bestraft.\n> Der grössere Haken aber sind Falsch-positive Ergebnisse. Deren Anzahl nimmt massiv zu, wenn du die Toleranzwerte senkst. Falsch-positive Bans sind aber ein grosser imagesvhaden für Riot, und mehr noch: sie senken die Glaubwürdigkeit und Effektivität der Bans. Wenn ein Spieler jetzt gebannt wird, weiss er klar dass er schuldig ist. Entsprechend ist die Chance auf Einsicht massiv höher.\n> Wenn allerdings immer mehr falsch-positive Fälle im Internet rumgeistern, nimmt keiner mehr die Bans ernst - aich nicht die, die zu Recht ausgesprochen wurden. Das erhöht langfristig die Toxizität und kann sogar dazu führen, dass trotz mehr Bans mehr toxische Spieler unterwegs sind.\n\nWie bereits in ein anderem Post von mir geschrieben sage ich ja nicht das jeder Spieler der AFK ist gebannt werden soll. Spieler bei denen ich mir selbst nicht sicher bin ob sie mit Absicht AFK sind reporte ich nicht mal. Es geht mir wirklich nur um die Spieler die ganz offensichtlich ein Spiel sabotieren - und die beiden aus meinem Spiel haben sich ja nicht mal bemüht es so aussehen zu lassen als wären sie aus verständlichen Gründen afk. Und wenn sowas halt nicht direkt betraft wird machen sie das in fünf Spielen wieder, hat ja gut geklappt, das Spiel wurde aufgegeben und es gab nicht mal ne Strafe.\nDas gleiche ist auch bei Flamern, keiner verlangt das jemand der \"noob\" schreibt nen 14-tage Bann bekommt. Aber es kann auch nicht sein das bestimmte Sachen in diese Null-Toleranz Kategorie fallen sofort bestraft werden und andere Sachen erst nach zig Spielen bestraft werden. \nWie viele Leuten könnte ich an den Kopf schmeißen das sie das Spiel deinstallieren sollen weil sie scheiße spielen, stinken oder idiotische Autisten sind bis was passiert?","replies":[{"poster":"Temudschinn","date":"2018-03-06T16:02:37.792+0000","up_votes":1,"down_votes":0,"body":"Ich teile deine Meinung, dass die momentaen Toleranzwerte eher etwas hoch sind (ausser bei einigen \"Blacklist\"wörtern, da sind sie dann wieder eher tief). Ich sehe nur auch, dass es auf die Akzeptanz der Strafen einen gewaltigen Einfluss haben kann, wenn die Anzahl falsch-positiver Ergebnisse ansteigt (das momentane Level ist ja sehr nahe bei Null). Und ich habe lieber ab und zu nen Flamer, der nicht bestraft wird im Team, als eine Community die alle Strafen ignoriert und einfach neue Accounts erstellt.","replies":[{"poster":"manial fly","date":"2018-03-06T17:20:12.009+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Temudschinn,realm=EUW,application-id=KYnfKGf0,discussion-id=1QEAXMsb,comment-id=000100010000,timestamp=2018-03-06T16:02:37.792+0000)\n>\n> Ich teile deine Meinung, dass die momentaen Toleranzwerte eher etwas hoch sind (ausser bei einigen &quot;Blacklist&quot;wörtern, da sind sie dann wieder eher tief). Ich sehe nur auch, dass es auf die Akzeptanz der Strafen einen gewaltigen Einfluss haben kann, wenn die Anzahl falsch-positiver Ergebnisse ansteigt (das momentane Level ist ja sehr nahe bei Null). Und ich habe lieber ab und zu nen Flamer, der nicht bestraft wird im Team, als eine Community die alle Strafen ignoriert und einfach neue Accounts erstellt.\n\nDu sagst selber die Toleranzgrenze ist eher zu hoch, keiner verlangt das sie so niedrig angesetzt wird, so das jemand nen Perma bekommt weil er einmal Noob schreibt.Du beschreibst da grad nur die beiden Extreme. Wenn man nach so einem Verhalten wie in meinem Bespiel geschrieben, kein Verständnis für seine Strafe zeigt, gehört man auch nicht in diese Community.\nAber wenn man sich so Verhalten kann ohne auch nur Ansatzweise eine Strafe befürchten zu müssen, läuft in diesem System grundsätzlich etwas komplett falsch.","replies":[{"poster":"Temudschinn","date":"2018-03-06T17:42:21.055+0000","up_votes":1,"down_votes":0,"body":"> Du sagst selber die Toleranzgrenze ist eher zu hoch, keiner verlangt das sie so niedrig angesetzt wird, so das jemand nen Perma bekommt weil er einmal Noob schreibt.Du beschreibst da grad nur die beiden Extreme\n\nNein, tue ich nicht. Selbst ein winziges Absenken der geltenden Toleranzwerte erhöht sofort die Anzahl falsch-positiver Ergebnisse. Das hat nichts mit Extremen zu tun, sondern mit Statistik.\n\nDer Unterschied zwischen uns ist halt, dass ich zwar denke dass die Toleranzwerte eher hoch sind, aber einsehe dass ich micht nicht genug auskenne um sicher zu sagen dass die Vorteile die Nachteile überwiegen, während du erstmal rumschreist wie schlimm alles sei und dass die Toleranzwerte UNBEDINGT gesenkt werden müssen, ohne auch nur anzuerkennen dass dies potentiell massive negative Effekte hat.","replies":[{"poster":"manial fly","date":"2018-03-06T18:02:55.005+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Temudschinn,realm=EUW,application-id=KYnfKGf0,discussion-id=1QEAXMsb,comment-id=00010001000000000000,timestamp=2018-03-06T17:42:21.055+0000)\n>\n> Nein, tue ich nicht. Selbst ein winziges Absenken der geltenden Toleranzwerte erhöht sofort die Anzahl falsch-positiver Ergebnisse. Das hat nichts mit Extremen zu tun, sondern mit Statistik.\n> \n> Der Unterschied zwischen uns ist halt, dass ich zwar denke dass die Toleranzwerte eher hoch sind, aber einsehe dass ich micht nicht genug auskenne um sicher zu sagen dass die Vorteile die Nachteile überwiegen, während du erstmal rumschreist wie schlimm alles sei und dass die Toleranzwerte UNBEDINGT gesenkt werden müssen, ohne auch nur anzuerkennen dass dies potentiell massive negative Effekte hat.\n\nIch sehe keinerlei Nachteile darin will Leute wie aus meine Spiel eben, oder welche die sich toxisch verhalten direkt nen 14-Tage Bann oder ne CR bekommen. \nDas Reportsystem wird einfach von niemandem ernst genommen. Dann soll Riot es einfach so machen das nur noch Leute bestraft werden, welche diese Kys-Schiene fahren dann hätte man es wenigstens schwarz auf weiß das man es sich sparen kann alles andere zu reporten.","replies":[{"poster":"Temudschinn","date":"2018-03-06T18:35:29.612+0000","up_votes":1,"down_votes":0,"body":"> Ich sehe keinerlei Nachteile darin will Leute wie aus meine Spiel eben, oder welche die sich toxisch verhalten direkt nen 14-Tage Bann oder ne CR bekommen.\n\nDann lies halt meine Kommentare einmal richtig.\nNochmals in ganz langsam: Je höher der Wert der Falsch-Negativen (das sind nicht bestrafte Flamer etc.), deso geringer der Wert der Falsch-Positiven (zu Unrecht gebannte Spieler). Bedeutet im Umkehrschluss: Je weniger Spieler straflos davonkommen, desto mehr Unschuldige werden bestraft - natürlich nur bei gegebener Rechenleistung und Datenmenge. Das ist Statistik 101.\n\nWenn du jetzt den Wert der Falsch-Negativen senken willst, aber ohne die Technologie zu verbessern oder Zugang zu mehr Daten zu haben (also genau das, was du vorschlägst) dann erhöht sich die Anzahl unschuldig bestrafter. Dass dies einen ganzen Rattenschwanz von Problemen nach sich zieht muss ich wohl nicht erklären.","replies":[{"poster":"manial fly","date":"2018-03-06T19:44:33.657+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Temudschinn,realm=EUW,application-id=KYnfKGf0,discussion-id=1QEAXMsb,comment-id=0001000100000000000000000000,timestamp=2018-03-06T18:35:29.612+0000)\n>\n> Dann lies halt meine Kommentare einmal richtig.\n> Nochmals in ganz langsam: Je höher der Wert der Falsch-Negativen (das sind nicht bestrafte Flamer etc.), deso geringer der Wert der Falsch-Positiven (zu Unrecht gebannte Spieler). Bedeutet im Umkehrschluss: Je weniger Spieler straflos davonkommen, desto mehr Unschuldige werden bestraft - natürlich nur bei gegebener Rechenleistung und Datenmenge. Das ist Statistik 101.\n> \n> Wenn du jetzt den Wert der Falsch-Negativen senken willst, aber ohne die Technologie zu verbessern oder Zugang zu mehr Daten zu haben (also genau das, was du vorschlägst) dann erhöht sich die Anzahl unschuldig bestrafter. Dass dies einen ganzen Rattenschwanz von Problemen nach sich zieht muss ich wohl nicht erklären.\n\nDann lies du dir auch meine Kommentare mal richtig durch. Du magst zwar grundsätzlich mit deiner ganzen Statistik recht haben aber dann erklär mir mal wie jemand der kein Fünkchen toxisches Verhalten an den Tag legt zu Unrecht bestraft werden soll? Ich habe nie davon gesprochen das jeder Report direkt eine Strafe mit sich ziehen soll sondern Leute die für ihr Verhalten so oder so i.wann eine Strafe kassieren würden diese nicht erst nach dem X-ten vergehen erhalten sondern direkt. Leute die jemandem \"Kys\" oder \"Fgt\" an den Kopf schmeißen bekommen direkt nen 14-Tage Bann, wrm dann nicht auch Leute die ein Spiel ganz eindeutig sabotieren oder mit anderen schlimmen Beleidigungen um sich schmeißen?","replies":[{"poster":"Temudschinn","date":"2018-03-06T20:36:23.040+0000","up_votes":2,"down_votes":0,"body":"Okay, beschränken wir uns mal auf Int. Feeding da das Konzept dort wohl am einfachsten zu Verstehen ist.\n\nSagen wir, wir können jeden Spieler irgendwo zwischen 1 und 100 einordnen (diese ganzen Zahlen sind frei erfunden in der Hoffnung, dir  klarzumachen warum ein einfach runtersetzen der Toleranzschwelle nur bedingt eine gute Idee ist; ein solcher \"Feedindex\" existiert vermutlich nicht). 1 wäre \"gibt sein bestes\", 100 wäre \"kauft mobiboots und rennt in der Mitte in den Turm\". Natürlich gibt es dazwischen ganz, ganz viele Abstufungen.\nRiot muss jetzt entscheiden, ab welchem Wert (=Verhalten) sie jemanden bannen. Ab 80 (macht 15sec. lang nichts und wird dann getötet)? ab 90 (verkauft seine Items und stirbt anschliessend 2mal)? oder ab 95 (towerdivt konstant und stirbt alle 2 Minuten)?\nDiese Entscheidung ist noch relativ einfach. Man einigt sich darauf, welches Verhalten noch ein Versehen sein kann und ab wo man von Absicht sprechen muss und bestraft alle, deren Wert darüber ist.\nNur ein Problem: Dieser Wert muss ja erstmal festgelegt werden. Also schreibt Riot ein paar Zeilen Code, die das Verhalten der Spieler auswerten und einen Wert zuteilen.\nUnd jetzt kommt das wirklich, wirklich grosse Problem: Das von Riot geschriebene Programm wird die Spieler anders einordnen als dies Menschen tun würden. Nicht immer, und auch nicht allzuweit daneben. Aber halt falsch. Da wird auch schonmal jemand, der eine 75 wäre als 71 bewertet, ganz selten mal als 93. Eine 10 kann auch mal 30 sein, eine 30 mit viel Pech eine 60. Der vom Programm ermittelte Wert streut mehr oder weniger normalverteilt um den Wert, den ein Supportmitarbeiter verteilen würde.\n\nWenn Riot alle Spieler über 85 bannen will (diesen Satz nicht aus dem Kontext reissen!), können sie also nicht einfach jedem der einen Wert von über 85 ne zwei Wochensperre geben. Dann könnten ja auch Spieler, die sich an sich nur etwas grenzwertig, aber nicht wirklich toxisch benommen haben, gesperrt werden. An Riots bisherigen Reaktionen sieht man, dass für sie ein zu Unrecht gebannter Spieler eine mittlere Katastrophe ist, weitaus schlimmer als jemand der Intet und nicht gleich erwischt wird. Riot setzt den Wert also etwas höher an - z.b. auf 95.\nDas bedeutet aber, dass einige leute die eigentlich als 96 beurteilt werden müssten, durch suboptimale Bewertung allerdings nur ne 94 erhalten, ohne Strafe bleiben - und das obwohl sogar diese 94 weit über dem kritischen Wert von 85 liegen, einfach weil es nicht möglich ist vom beobachteten Wert auf den wahren Wert zu schliessen. Nur weil jemand vom Feederbuster als 94 beurteilt wird weisst du nicht ob er eine 94, eine 96 , eine 83 oder gar eine 50 ist - auch wenn der letzte Wert natürlich sehr, sehr, sehr unwahrscheinlich ist.\n\nBereits jetzt werden in sehr, sehr, sehr seltenen Einzelfällen Strafen zu Unrecht oder zu harsch ausgesprochen. Wenn du den Toleranzwert jetzt runtersetzt, erhöht sich diese Anzahl - nicht wahnsinnig stark, aber sie erhöht sich. Das will Riot offensichtlich nicht.\n\nDas ganze stimmt natürlich nur, falls Riot nicht Tausende Mitarbeitende eingestellt hat, um manuell Spiele nachzuprüfen. Wobei, natürlich würden auch Supportmitarbeiter Fehler bei der Beurteilung machen, aber die Streuweite wäre wohl massiv geringer.\nWas du verstehen musst ist dass es Sicherheit nicht gibt, nur Wahrscheinlichkeiten. Selbst wenn es für dich absolut glasklar war dass jemand absichtlich gestorben ist, kann der Feederbuster zu nem anderen Resultat kommen. Und sogar wenn der Feederbuster sich ziemlich sicher ist dass jemand absichtlich stirbt kann es gut sein dass keine Strafe ausgesprochen wird, da der Feederbuster weiss dass er Fehler macht.\n\nBeim flaming hast du grundsätzlich dasselbe Problem, wenngleich die Unsicherheit ob jemand geflamt hat gegen Null geht - die Frage ist dann eher, ob er es wieder tun wird oder nicht (und dann ist man wieder beim exakt selben Problem).","replies":[]}]}]}]}]}]}]}]},{"poster":"Nack321","date":"2018-03-06T15:05:51.364+0000","up_votes":1,"down_votes":0,"body":"Es ist aber ein enormer unterschied ob ich feede oder Hardware Probleme habe weil Hardware probleme hast du 1 mal danach weist du es und wenn du dann noch ein Ranked spielst obwohl  du weist das du Probleme hasdt bist du selbst schuld wenn du nen bann bekommt da du wusstest das es Probleme gibt und du damit den anderen Reinpfuscht","replies":[{"poster":"Temudschinn","date":"2018-03-06T15:30:33.651+0000","up_votes":1,"down_votes":0,"body":"Nein, es ist kein enormer Unterschied in Bezug auf die von mir geschilderte Problematik, dass du falsch-negative Ergebnisse immer nur gegen falsch positive austauschen, aber nie eliminieren kannst (ausser durch technologische Verbesserungen oder mehr Daten). Diese Problematik besteht in allen Fällen.","replies":[]}]}]},{"poster":"Time2Whine","date":"2018-03-08T08:19:20.363+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=manial fly,realm=EUW,application-id=KYnfKGf0,discussion-id=1QEAXMsb,comment-id=,timestamp=2018-03-06T14:23:50.250+0000)\n>\n> Und genau das ist der springende Punkt, es passiert wirklich nichts obwohl ganz offensichtlich ist das die beiden das Spiel sabotiert haben.\n\nIch mache dir mal einen Vorschlag. Schnapp dir eine Packung Popcorn, gib in die Suchfunktion Begriffe wie \"Permabann\" oder \"14 Tage Bann\" ein und lies dir die Beiträge durch. Du wirst schnell merken, dass die Leute auch für permanent negatives Chatverhalten ohne harte Beleidigungen wie KYS oder Faggot gebannt werden, was viele Spieler leider nie verstehen werden.\n\nHier auch noch ein paar Beispiele dafür dass Leute fürs AFK sein eine Strafe erhalten haben/der Leaverbuster funktioniert.\nhttps://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/NbefZMA8-im-ernst\nhttps://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/Z4qAYE1f-why-the-fuck-hell-am-i-afk\nhttps://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/ZUvUA9fN-entbannungsantrag","replies":[]},{"poster":"Oriius","date":"2018-03-06T16:33:18.528+0000","up_votes":2,"down_votes":9,"body":"Man kanns nur immer wiederholen. So lange es genug Spieler gibt die es so unterstützen wie es ist und sich nicht beschweren bist du nur jemand der Zeit&Geld kostet aber nichts einbringt und somit sind deine Interessen für eine Firma die am Ende riesige grüne Zahlen schreiben möchte völlig irrelevant.\n\nImmer wird das seitens Riot auf die Wahrnehmung einzelner Spieler geführt immer wird da irgendeine Problematik gesucht die nicht auf Riot sondern auf die Community selber zeigt und das ist der Punkt wieso die Situation so miserabel in League ist. Mittlerweile ist es auch kein Geheimnis mehr das immer mehr Spieler sich league abwenden weil man ordentliche und spaßige Runden nur noch erwarten kann wenn man wirklich 2x 5 Premades gegenüber stellt. \n\nDa in League teamplay unverzichtbar ist und man hier im Gegensatz zu vielen anderen Spielen kein 1v3 oder so \"fair\" gewinnen kann wird das natürlich irgendwann langweilig.\n\nSpaß haben ist hier einfach nur noch Fehlanzeige und das schiebe ich klar einerseits auf die Community , jedoch wenn Riot nicht durchgreifen will dann schiebe ich 95% der Schuld auf Riot selber . Die ermöglichen denen das , die bleiben untätig , die sorgen bewusst dafür das die Spieler so handeln wie sie es tun.\n\nNatürlich kann man nicht jede kleine Sache verfolgen oder auch nen Dc o.ä ist immer mal möglich aber der typ den ich als letztes 8 x oder so in Folge wegen 8 afk games reported habe der queued immer noch weiter in die Games und geht immer weiter afk und es passiert nichts. Entweder ist die Toleranz sehr hoch oder Riot ist es wirklich mehr als 100% egal.\n\nDie Mittel und Möglichkeiten hat Riot allemal. Vielleicht werden die es irgendwann lernen , spätestens wenn ein qualitativ hochwertiges Spiel wie League rauskommt wird Riot erst sehen in was für einem Zustand league ist aber dann wird es längst zu spät sein um das noch zu beheben. Naja müssen die selber wissen , ich wart mal ab was hier noch so passiert.","replies":[{"poster":"Sirrkas","date":"2018-03-06T17:17:18.543+0000","up_votes":3,"down_votes":0,"body":">Man kanns nur immer wiederholen. So lange es genug Spieler gibt die es so unterstützen wie es ist und sich nicht beschweren bist du nur jemand der Zeit&Geld kostet aber nichts einbringt und somit sind deine Interessen für eine Firma die am Ende riesige grüne Zahlen schreiben möchte völlig irrelevant.\n\nUnd warum investiert Riot dann überhaupt in ein Playerbehaviour Team? Nach deiner Argumentation sollten die das ja eigentlich einstampfen müssen. Spart dann Geld.","replies":[]}]}]}