{"poster":"TerraMarique","date":"2020-01-30T16:09:26.104+0000","title":"Wie bewertet Riot Mechanics","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo Community\r\n\r\nMir ist Heute in einer Diskusion wieder aufgefallen, dass Riot anscheinend verschiedene Maßstäbe bei Mechanics anlegt.\r\nGenauer gesagt bei Riven, Fiora und Graves.\r\nIch denke vielen Spielern ist noch der Knockback-cancel auf der Gravesultimate ein Begriff. {Graves konnte mit seinem E-Dash den Rückstoß seiner R umgehen um so z.b. weiter chasen zu können)\r\nRiot hat das Seinerzeit mit der klaren Begrundung entfernt : Graves ist in der Lage mit dieser Mechanic einen Schwachpunkt in seinem Kit permanent zu disablen. Solche Möglichkeiten verschieben das Balance und sind nicht erwünscht.\r\n\r\nMeine Frage ist : warum wird mit der selben Begründung nicht Rivens Doublecast [E->W/Q entfernt da sie ja den zwingenden Nachteil des kurz stehenbleibens bei ihrem W umgeht. \r\n[Mir ist kla dass sollte man Riven diese Mechanics nehmen man ihr Stärke woanders geben müsste und dies ist auch nicht meine Forderung]\r\nMir geht es eher darum ob Riot sowas wahrnimmt aber solche sachen viel zu niedrig auf der Agenda stehen. [Graves war im vergleich ja sehr präsent im proplay]\r\n\r\nDie andere Sache wäre für mich Fioras Q/W . Sie kann so z.b. mit ihrem Q durch einen Veigarcage dashen ohne CC-Wirkung und ihn ggf damit auch noch stunnen. Lauf meinem Verständniss sollte Fioras W doch ein zwingender Selfroot sein. Somit umgeht sie hier diese deutliche Schwäche . Auch hier gilt das selbe wie bei den Riven mechanics oben in der klammer .\r\n\r\nIch möchte hier auch nochmal differenzieren : Mir geht es nicht um animationcanceling oder inputbuffering, sondern um die parallele anwendung mehrerer Fähigkeiten um schwächen aus dem Kit zu negieren.\r\n  \r\n\r\nAlso was sagt ihr ? \r\nRiot will einfach fiora und Riven atm nicht patchen und solang diese Sachen kein großes Problem Verursachen ist es erstmal egal?\r\n\r\nBetreffen euch diese Sachen ingame ? Wie geht ihr damit um ?\r\n\r\n\r\nMit freundlichen Grüßen\r\n\r\nTerraMarique","replies":[{"poster":"mondmann97","date":"2020-02-04T15:35:48.825+0000","up_votes":1,"down_votes":0,"body":"Du hast dir doch deine Frage schon beantwortet!\n\nMir ist es ingame relativ egal. Generell stört es mich aber, dass Champions so verschieden mit animationcanceling, inputbuffering, multicasts umgehen. Entweder sollten diese Dinge auf jedem Champion möglich sein oder eben nicht. Sie gehören nicht zum Design eines Champions und somit auch nicht zu lernkurve und damit aktuell auch nicht ins spiel. Es sind bugs die as mechanic gerebranded wurden und mehr nicht.","replies":[]},{"poster":"Aymira","date":"2020-01-30T22:42:38.069+0000","up_votes":1,"down_votes":0,"body":"Solche Mechaniken find ich völlig okay, die müssen eben auch noch richtig ausgespielt werden und das unterscheidet einen guten Spieler auch vom schlechten Spieler.\n\nWas mich damals gestört hat, war dieses \"einflashen\" von Fähigkeiten (wie es im Deutsch genannt wird) \nDas war bei der ultimativen Fähigkeit von Cassiopeia immer sehr beliebt. \nAn sich ist die Mechanik völlig in Ordnung, es störte mich nur sehr, das die Animation hängen geblieben ist bzw manchmal auch völlig absurd in irgendeine Richtung gegangen ist.","replies":[{"poster":"Tatze137","date":"2020-01-31T00:23:07.324+0000","up_votes":1,"down_votes":0,"body":"wie hier schon erwähnt nicht jeder spieler kann es auch theoretisch ist vieles machbar aber wieviel der spieler können es effektiv nutzen  und wenns wirklich stört wird ja entfernt siehe maschine-gun caitlynn  den wenns danach geht muss du flash auch entfernen da viele play auf flash bassieren zum beispiel mordekaisers flash-q oder weitere manche mechanics können schon bleiben den es kann nicht jeder umsetzen selbst wenn du es im custom game schaffst muss es nicht heisen das es im rank oder normals auch geht weil die bedihungen andere sind die spieler laufen anders ect","replies":[{"poster":"Aymira","date":"2020-01-31T00:43:04.797+0000","up_votes":1,"down_votes":0,"body":"Hab ja an sich auch nichts dagegen. Bin auch nicht der Meinung das irgendwas entfernt werden sollte. Wenn es die Mechanik gibt, dann kann man sie lernen, wie jeder das dann für sich umsetzt ist die andere Sache. \n\nBei dem Cassio Beispiel finde ich es auch völlig in Ordnung, wenn das funktioniert, was mich daran nur stört ist eben das es wissentlich im Spiel ist und die Animationen komplett daneben sind. \n\nHätte ich dem Kram ausweichen können wenn die Animationen richtig gewesen wären? Nein. Bin ich zu schlecht für. Aber es fühlte sich einfach maximal falsch an, wenn eine Cassio optisch in ihren eigenen Turm ultet, dabei nach vorne blitzt und man gegenüber getroffen wurde... :D","replies":[]}]}]},{"poster":"Eroticat Nimar","date":"2020-01-30T20:12:31.333+0000","up_votes":1,"down_votes":0,"body":"Es gibt gewollte und ungewollte Mechaniken und wenn Riot etwas ändern möchte weil ihnen eine Funktion nicht gefällt dann.. ja dann ändern sie es halt.","replies":[]},{"poster":"Alustus","date":"2020-01-30T16:41:48.293+0000","up_votes":1,"down_votes":0,"body":"Naja es geht Riot glaube ich mehr darum das Champions nicht zu stark sind und wieviele andere schwächen sie haben.\nAls oh mit dieser Mechanic wird eine schwäche ausgebügelt.\n\nIch sehe da jetzt auch kein Problem an auch wenn es vllt der philosophie von Riot wiederspricht.\n\nIngame stören mich persöhnlich viele andere dinge viel mehr als soetwas.","replies":[]},{"poster":"Necromant","date":"2020-01-30T16:41:37.711+0000","up_votes":1,"down_votes":0,"body":"Ich denke schon, das sie irgendwo \"Mechanics\" berücksichtigen, da irgendwo jeder Champ einen Cancel besitzt und sei es nur durch Item gegebene z.B. AA Titanics, was auch den Delay zwischen den AA's nutzt und so einen \"Schwachpunkt\" umgeht.","replies":[]}]}