{"poster":"Soul Dealer","date":"2019-08-14T00:57:19.254+0000","title":"Name and shame should be allowed","subforum":"Player Behavior","up_votes":4,"down_votes":21,"body":"If riot won’t take action against trolls then we need to be able to warn people about them so if someone gets into a game with that person they can dodge and not have to deal with said person. The mods have always been against this idea but have yet to gives us a legitimate reason to not allow this. Their so called “witch hunting” is actually a good thing as players that troll and ruin games should be publicly known so people can avoid them at all costs. The only other option is riot actually does something meaningful about this issue but that does not seem to be happening anytime soon.","replies":[{"poster":"The Djinn","date":"2019-08-14T01:34:54.551+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=Soul Dealer,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=,timestamp=2019-08-14T00:57:19.254+0000)The mods have always been against this idea but have yet to gives us a legitimate reason to not allow this. \n\nWe've given a legitimate reason you happen to disagree with:\n\n>Their so called “witch hunting” is actually a good thing as players that troll and ruin games should be publicly known so people can avoid them at all costs.\n\nYou think it's a good thing. We (and our experience with seeing it happen on the boards -- both justified and unjustified) believe it isn't. The rule will not be changing at this time.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T01:40:53.632+0000","up_votes":1,"down_votes":10,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=0004,timestamp=2019-08-14T01:34:54.551+0000)\n>\n> We've given a legitimate reason you happen to disagree with:\n> \n> You think it's a good thing. We (and our experience with seeing it happen on the boards -- both justified and unjustified) believe it isn't. The rule will not be changing at this time.\n\nYou remove a post as soon as it happens so you can’t even gather evidence as to if it works or not. If you want to actually test it out and see if it is a good thing or not you would have to allows us to do that for at least a week .","replies":[{"poster":"The Djinn","date":"2019-08-14T01:44:48.354+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Soul Dealer,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=00040000,timestamp=2019-08-14T01:40:53.632+0000)You remove a post as soon as it happens so you can’t even gather evidence as to if it works or not. If you want to actually test it out and see if it is a good thing or not you would have to allows us to do that for at least a week .\n\nIf we needed *new* evidence and our past experience were insufficient, yes. I don't believe that is the case though.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T01:46:59.097+0000","up_votes":1,"down_votes":9,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=000400000000,timestamp=2019-08-14T01:44:48.354+0000)\n>\n> If we needed *new* evidence and our past experience were insufficient, yes. I don't believe that is the case though.\n\nWhat past experience.  As far as I know name and shame has never been allowed so you could never have gathered evidence to prove if it was a good thing or not. It could have been allowed before I started playing but I started at the end of season 3 and it has not been allowed since I started.","replies":[{"poster":"The Djinn","date":"2019-08-14T01:48:20.131+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Soul Dealer,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=0004000000000000,timestamp=2019-08-14T01:46:59.097+0000)As far as I know name and shame has never been allowed so you could never have gathered evidence to prove if it was a good thing or not. It could have been allowed before I started playing but I started at the end of season 3 and it has not been allowed since I started.\n\nWe don't get everything right away, and we've seen how those threads tend to develop. It's not great, and it's not something I think is a good idea to allow. It just leads to -- at best -- more negativity and frustration on the boards, and, at worst, leads to harassment and insults.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T01:53:32.519+0000","up_votes":1,"down_votes":10,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=00040000000000000000,timestamp=2019-08-14T01:48:20.131+0000)\n>\n> We don't get everything right away, and we've seen how those threads tend to develop. It's not great, and it's not something I think is a good idea to allow. It just leads to -- at best -- more negativity and frustration on the boards, and, at worst, leads to harassment and insults.\n\nOk that’s fair but there is something that can be done. You can allow posts that warn about certain player actively ruining games but have it moderated and under control. You could simply make a new subsection of the boards where someone could warn people about a player that is ruining game but not allow people to comment on it that way there is no witch hunting on the boards and people can still avoid said player if they come across them in game. There are many things that could be done. I apologize if I’m coming across as being a dick I’m not trying to be it is just very frustrating running into trolls and not being able to warn people about them or even report them and have no idea if it even did anything.","replies":[{"poster":"The Djinn","date":"2019-08-14T02:31:59.840+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Soul Dealer,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=000400000000000000000000,timestamp=2019-08-14T01:53:32.519+0000)You can allow posts that warn about certain player actively ruining games but have it moderated and under control. \n\nThat increases moderation burden hugely (we have to make sure those rules are being followed in all cases) *and* is largely useless, as most players will A: not encounter that player themselves and B: not remember the name if they do. It's only good for venting, and you can already vent on the Rant board if you just avoid player names.","replies":[]},{"poster":"GatekeeperTDS","date":"2019-08-14T02:12:26.322+0000","up_votes":2,"down_votes":0,"body":"Or maybe, you could _simply_ make your own forum where the rules are yours and witch hunts are allowed.","replies":[]}]}]},{"poster":"MagicFlyingLlama","date":"2019-08-14T02:01:08.193+0000","up_votes":4,"down_votes":1,"body":"> What past experience.\n\n40 years of internet history.\n\nOr, this board before that rule existed.","replies":[]}]}]}]}]},{"poster":"CharDeeMcDenniz","date":"2019-08-14T01:14:41.855+0000","up_votes":3,"down_votes":0,"body":"absolutely not","replies":[{"poster":"Soul Dealer","date":"2019-08-14T01:15:56.480+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=CharDeeMcDenniz,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=0001,timestamp=2019-08-14T01:14:41.855+0000)\n>\n> absolutely not\n\nProvide a good reason why please.","replies":[{"poster":"CharDeeMcDenniz","date":"2019-08-14T01:33:18.138+0000","up_votes":6,"down_votes":0,"body":"what would the point be?\n\nsay they even give that it's own subsection (like rant) it would accomplish nothing. Lets say I play a game on NA, and I get an int'er on my team. I get so salty about it that I come to the boards and go to the witchhunt section and make a post saying \"player XXYYZZ is a stupid int'er\"\n\nthen what?\n\neveryone else is just supposed to keep a massive list of UNCONFIRMED trolls on a notepad or something and then cross reference in every lobby?\n\nnah man, you just want vengeance","replies":[{"poster":"GatekeeperTDS","date":"2019-08-14T02:14:32.924+0000","up_votes":3,"down_votes":0,"body":"The chances of you running into that person in a game are also sooooooo fucking small.","replies":[]}]}]}]},{"poster":"GatekeeperTDS","date":"2019-08-14T01:02:27.537+0000","up_votes":5,"down_votes":1,"body":"Here is my copypasta reply to you from the other thread, since you had to turn this into your own epic idea.\n\n>No, it is not basically the same at all. This is a video game. This is not real life. If you have an issue with a player, Riot has a way for you to have yourself heard, which is by reporting after game or filling out a support ticket. Because, guess what, nobody on a forum knows if you're telling the truth about what happened or not. And even if the accused person did what you said they did, Riot has decided that reform is what they want from players, not public humiliation on their own forums.\n\n> You, by all means, can create a forum of your own with your own rules where people can have all the witch hunts they want.\n\nEDIT: Here's my other reply from that thread that needs to be copypastad.\n\n> How exactly is naming and shaming a single person on the board going to prevent you from playing games with them.\n\n> Do you have any grasp of exactly how small of a chance you have at running into any one single player?","replies":[{"poster":"Soul Dealer","date":"2019-08-14T01:11:29.584+0000","up_votes":1,"down_votes":11,"body":"> [{quoted}](name=GatekeeperTDS,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=0000,timestamp=2019-08-14T01:02:27.537+0000)\n>\n> Here is my copypasta reply to you from the other thread, since you had to turn this into your own epic idea.\n> \n> EDIT: Here's my other reply from that thread that needs to be copypastad.\n\nI never made a thread about this before so nice try there. And reporting does nothing. This have been proven time and time again so unless you have a better idea don’t defend riot.","replies":[{"poster":"Hotarµ","date":"2019-08-14T01:17:38.603+0000","up_votes":6,"down_votes":1,"body":">And reporting does nothing. This have been proven time and time again so unless you have a better idea don’t defend riot.\n\n\n That is 100% false.\n\n Just because someone wasn't punished doesn't mean the entire system is a failure.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T01:22:16.824+0000","up_votes":1,"down_votes":9,"body":"> [{quoted}](name=Hotarµ,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=000000000000,timestamp=2019-08-14T01:17:38.603+0000)\n>\n> That is 100% false.\n> \n>  Just because someone wasn't punished doesn't mean the entire system is a failure.\n\nReally? Then why are there hundreds of people constant complaint that they are still getting trolls game after game. If riot really wanted to they could do something about this and severely cut back on the amount of trolls in game but they don’t. Yes people do get punished but so many of them don’t and we don’t even get to know if they do because the ifs is terrible. If riot really wants me to report people in order to make the game better then at least let me see that it is doing something. Hell they could go the route of csgo where you get rewards for consistently reporting people that get punished. There is so much riot could do but they don’t so it’s up to us to stop the trolls and this is the only way to do it unless you have a better idea.","replies":[{"poster":"Hotarµ","date":"2019-08-14T01:31:45.261+0000","up_votes":6,"down_votes":0,"body":">Really? Then why are there hundreds of people constant complaint that they are still getting trolls game after game.\n\n Because people don't understand what the word \"troll\" means. \n\n A troll is not someone going Teemo ADC. A troll is not someone dying 5 times in 10 minutes. A troll is not someone AFK farming. \n\n A troll is someone _actively trying to lose the game or grief their teammates._ Someone underperforming or playing a different way =/= a troll. \n\n>If riot really wanted to they could do something about this and severely cut back on the amount of trolls in game but they don’t.\n\n 2 things.\n\n1 - That doesn't make any sense. Think about it from a logical standpoint rather than one of anger. _Why_ would a video game company allow people to break the rules and piss off their playerbase? _How_ does that benefit them? _What_ might be limiting them from stopping the rulebreakers?\n\n2 - No, they really can't do much more. First off, again, most people don't understand what the word \"troll\" means. Someone playing a different way or underperforming doesn't make them a troll. Secondly, make the system too strict and innocent players get punished. Make it too lenient and actual griefers/trolls slip by undetected. It's not as simple as pressing a few buttons.\n\n I suggest you check out this comment [**right here**](https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/d2OEE3FE-seriously-chat-banned-for-pointing-out-someone-was-inting?comment=0000000000010000000000000000) for a more in-depth explanation.\n\n> If riot really wants me to report people in order to make the game better then at least let me see that it is doing something. Hell they could go the route of csgo where you get rewards for consistently reporting people that get punished. There is so much riot could do but they don’t so it’s up to us to stop the trolls and this is the only way to do it unless you have a better idea.\n\n Again, your dissatisfaction with the system does not mean it's a failure. Trolls, inters, and griefers _do_ get punished, just because it's not at a rate you might like doesn't mean it's a failure.\n\n Also, Riot doesn't owe us anything. Our reward is keeping the game free of people who actively break the rules.","replies":[]},{"poster":"GatekeeperTDS","date":"2019-08-14T01:24:48.465+0000","up_votes":3,"down_votes":0,"body":"> Then why are there hundreds of people constant complaint that they are still getting trolls game after game.\n\nBecause those hundreds of people out of the **millions who play every day** think that everything anyone does is \"trolling\" and they come to the forums to bitch about it instead of understanding that not everything revolves around them.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T01:27:29.768+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=GatekeeperTDS,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=00000000000000000000,timestamp=2019-08-14T01:24:48.465+0000)\n>\n> Because those hundreds of people out of the **millions who play every day** think that everything anyone does is \"trolling\" and they come to the forums to bitch about it instead of understanding that not everything revolves around them.\n\nRight because someone saying in chat at the start of the game “I’m trolling gg” and then running it down is not trolling. People constantly make posts about this type of behavior yet riot does nothing. I have run into 3 people that have done this TODAY.","replies":[]}]}]}]},{"poster":"GatekeeperTDS","date":"2019-08-14T01:20:18.031+0000","up_votes":2,"down_votes":0,"body":"> I never made a thread about this before so nice try there.\n\nI was talking about the other thread where I replied to you, not a thread you created. Perhaps you should try harder.\n\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/50glctjK-deleting-threads-that-have-player-names","replies":[]}]}]},{"poster":"rujitra","date":"2019-08-14T01:19:07.415+0000","up_votes":6,"down_votes":2,"body":"Need I Photoshop an image that makes you look like you're doing something wrong to prove to you how this could be abused? Would take 5 minutes top, and you wouldn't be able to tell that it's altered or fake.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T01:24:18.440+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=0003,timestamp=2019-08-14T01:19:07.415+0000)\n>\n> Need I Photoshop an image that makes you look like you're doing something wrong to prove to you how this could be abused? Would take 5 minutes top, and you wouldn't be able to tell that it's altered or fake.\n\nI hope you realize how flimsy of an excuse that is. There is probably like 5 people who would actually take the time to do that. If people won’t take the time to send in a support ticket about trolls then they won’t take the time to photoshop a fake image.","replies":[{"poster":"rujitra","date":"2019-08-14T01:27:59.758+0000","up_votes":6,"down_votes":2,"body":"You have no way of proving anyone would or wouldn't do this.\n\nYou read these boards frequently, you know that almost 5 people per **day** are exaggerating facts about their games that cant be confirmed in match history.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T01:32:57.822+0000","up_votes":2,"down_votes":5,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=000300000000,timestamp=2019-08-14T01:27:59.758+0000)\n>\n> You have no way of proving anyone would or wouldn't do this.\n> \n> You read these boards frequently, you know that almost 5 people per **day** are exaggerating facts about their games that cant be confirmed in match history.\n\nAnd how would you know people are exaggerating? Your are notorious for not even bothering to check facts before you respond to posts and you haven’t played since season 7 so you probably don’t even know what the game is like right now.","replies":[{"poster":"rujitra","date":"2019-08-14T02:21:35.146+0000","up_votes":2,"down_votes":1,"body":"You are making multiple accusations about me with no proof here.\n\n1. I do look into posts before I comment. I will not say I am perfect - sometimes I do miss something, or I'll look at the wrong game in the match history when the OP is referring to a different game. We all do. I will admit my mistakes when this happens (and I've edited/deleted posts when this is the case before). Feel free to provide a link to where this hasn't happened and I'll be happy to correct it.\n\n2. This was a smurf account I used to play with a friend back in season 6/7 timeframe, then the friend stopped playing and I've had no reason to go back on it. I don't have time to swap accounts during a day given I play 3-4 games per day on average at most, but I play on my main.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T02:24:54.021+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=00030000000000000000,timestamp=2019-08-14T02:21:35.146+0000)\n>\n> You are making multiple accusations about me with no proof here.\n> \n> 1. I do look into posts before I comment. I will not say I am perfect - sometimes I do miss something, or I'll look at the wrong game in the match history when the OP is referring to a different game. We all do. I will admit my mistakes when this happens (and I've edited/deleted posts when this is the case before). Feel free to provide a link to where this hasn't happened and I'll be happy to correct it.\n> \n> 2. This was a smurf account I used to play with a friend back in season 6/7 timeframe, then the friend stopped playing and I've had no reason to go back on it. I don't have time to swap accounts during a day given I play 3-4 games per day on average at most, but I play on my main.\n\nNo you have publicly stated before that you have 0 intention into looking into posts. I would love to find the post where you said that but it was about 3 months ago and was probability deleted to not make you look bad.","replies":[]}]}]}]}]}]},{"poster":"TrulyBland","date":"2019-08-14T13:10:01.290+0000","up_votes":4,"down_votes":1,"body":"If your only argument for witch hunts is essentially that real witches deserve to be hunted, you have understood neither what the problem with historical witch hunts was, nor what the problem with metaphorical witch hunts nowadays is.\n\n- The evidence against the witch is mostly very circumstantial and can't be verified by the general public.\n- Only the witch-hunting party is able to present any evidence.\n- And despite both those points, the burden of proof is essentially placed on the \"witch\". If she can't prove her innocence, she is guilty in the eyes of the public (or historically: guilty in the eyes of the public **and** the authority).\n\nEven if one believes that a troll deserves to be publicly shamed (which is an understandable but still debatable point of view) the problem at its core is that it's impossible to verify in all but very few fringe cases whether somebody actually is a troll.\nIt's not about protecting witches/trolls, it's about protecting people from being (in some cases maliciously) **accused** of being witches/trolls and being subjected not to a fair trial but to the equivalent of a lynch mob.\n\nThere is a reason why somebody's guilt is not decided by the general public (and as a small sidenote: even the concept of a jury deciding over somebody's guilt is pretty weird in countries without them)\n\nNow you could ask \"but what about the really obvious cases?\"\nThe first problem with that is that it's difficult to really draw a line there. A lot of people come to these forums being completely convinced that their case is very obvious, even when it is not. Apart from the negative effects that can have, this also makes moderating super hard:\nThose people can believably claim that they thought it was obvious, so it's not even really possible to punish those people for what may very well have been a malicious attempt to tarnish somebody's reputation. It also makes it much more difficult for mods to even judge whether a thread should be deleted in the first place, which will inevitably result in inconsistent decisions by mods.\n\nThe second problem is that the chance that a particular individual runs into a troll (low-ish chance), that they have happened to read about on the forums (really low chance) **and** that was one of the few verifiable trolls (extremely low chance) is so abysmal that the benefit for any individual person in those cases is virtually non-existent.\nThe chance that somebody runs into a troll that they \"heard about\" on the forums, supplied with some circumstantial evidence, on the other hand, is… well... still low. But it's significantly higher than the previous chance.\nBut those cases will beyond any doubt include people who are actually not trolls, which ultimately results in a negative effect on both parties, as everybody involved has their queue time increased without any valid reason. Worse still: The chance that an individual runs into a \"troll\" they read about on the forums is significantly lower than the chance of that \"troll\" running into somebody who has heard about them.\n\nSo the benefit that people can make an actually well-informed decision to dodge a verifiable troll is **extremely** low, while there is the low - but realistic - chance that both the target and the readers of a thread are being inconvenienced by somebody who - best case - was holding a grudge, or - worst case - had malicious intent.\n\nSo, now that somebody has given you a legitimate reason not to allow this…\nIs that really worth it to you?","replies":[]},{"poster":"Nik Nikerson","date":"2019-08-14T01:18:48.975+0000","up_votes":4,"down_votes":1,"body":"The irony here is that you're exactly the sort of player that's being protected by this policy.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T01:25:19.988+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Nik Nikerson,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=0002,timestamp=2019-08-14T01:18:48.975+0000)\n>\n> The irony here is that you're exactly the sort of player that's being protected by this policy.\n\nHow am I being protected by this? I am not a troll and I always try in every game I play. I constantly try to help my team and encourage them to not give up. I am not the person being protected by this policy.","replies":[{"poster":"Nik Nikerson","date":"2019-08-14T02:03:00.082+0000","up_votes":3,"down_votes":0,"body":"Let's just say, hypothetically, you have a bad game. You go like, I dunno, off the top of my head, 1/10 in a game we play together. Maybe you're trying your best, but I'm pissed that I lost LP because you got crushed in lane. I then come on here and complain that you're a feeder and a troll, and should be punished for ruining my game, and no one should play ranked with you ever again. Does that really seem like something I should be able to do?\n\nAnd if you think that isn't something that would happen, you clearly haven't spent enough time on the boards.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T02:06:14.821+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Nik Nikerson,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=000200010000,timestamp=2019-08-14T02:03:00.082+0000)\n>\n> Let's just say, hypothetically, you have a bad game. You go like, I dunno, off the top of my head, 1/10 in a game we play together. Maybe you're trying your best, but I'm pissed that I lost LP because you got crushed in lane. I then come on here and complain that you're a feeder and a troll, and should be punished for ruining my game, and no one should play ranked with you ever again. Does that really seem like something I should be able to do?\n> \n> And if you think that isn't something that would happen, you clearly haven't spent enough time on the boards.\n\nSomeone would just spend 20 seconds looking at your match history and know that’s not true.","replies":[{"poster":"Nik Nikerson","date":"2019-08-14T02:22:55.316+0000","up_votes":3,"down_votes":0,"body":"Or 20 seconds looking at yours, see that you have double digit deaths in a bunch of games, and make a snap decision about you. They aren't going to look any further than your KDA and decide that you're the problem.\n\nListen, I'm not trying to give you shit. I'm sure you're a fine player that really does try hard, and I have no reason to believe you're anything other than a treat to play with. But that's exactly the sort of person that's going to get wrongly crucified by angry idiots that want to start a lynch mob because they lost a game.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T02:27:12.767+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Nik Nikerson,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=00020001000000000001,timestamp=2019-08-14T02:22:55.316+0000)\n>\n> Or 20 seconds looking at yours, see that you have double digit deaths in a bunch of games, and make a snap decision about you. They aren't going to look any further than your KDA and decide that you're the problem.\n> \n> Listen, I'm not trying to give you shit. I'm sure you're a fine player that really does try hard, and I have no reason to believe you're anything other than a treat to play with. But that's exactly the sort of person that's going to get wrongly crucified by angry idiots that want to start a lynch mob because they lost a game.\n\nSo the what do you recommend happen? Something has to change because trolls are getting more and more out of hand and it is becoming very difficult to believe riot actually does something about this issue. The reason I am so adamant about name and shame is because it’s the best solution i can think of right now but if there is a better one then I would absolutely be on board with it.","replies":[{"poster":"Nik Nikerson","date":"2019-08-14T02:34:11.117+0000","up_votes":2,"down_votes":0,"body":"If I had the answer, I'd be pitching it to Riot for a boat load of cash. Unfortunately I don't. \n\nBut I do know that, in all things, the boards are not the answer. Already the boards are flooded with people that just want to complain about how they are hard stuck in Iron because of their teammates. Letting them call out other players isn't going to be a positive move for anyone.","replies":[]}]}]},{"poster":"GatekeeperTDS","date":"2019-08-14T02:15:42.149+0000","up_votes":1,"down_votes":0,"body":"I looked at your match history. You have a 1/10 Jax game. I have now determined that you are a feeder and a troll. You ruined that game and caused some poor souls to lose LP and possibly get demoted.\n\nAm I right? Am I wrong? Who knows, because **none of us were there**.","replies":[{"poster":"Soul Dealer","date":"2019-08-14T02:21:49.047+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=GatekeeperTDS,realm=NA,application-id=ZGEFLEUQ,discussion-id=6GdJy3LV,comment-id=00020001000000000000,timestamp=2019-08-14T02:15:42.149+0000)\n>\n> I looked at your match history. You have a 1/10 Jax game. I have now determined that you are a feeder and a troll. You ruined that game and caused some poor souls to lose LP and possibly get demoted.\n> \n> Am I right? Am I wrong? Who knows, because **none of us were there**.\n\nYou can look at the stats of that game, how the other players performed, or even download the replay. You can judge a book by its cover just like you can’t judge a player by their kda alone.","replies":[{"poster":"GatekeeperTDS","date":"2019-08-14T02:25:17.036+0000","up_votes":1,"down_votes":0,"body":"> You can judge a book by its cover\n\nI think you meant \"can't\" but anyway...\n\nExcellent. You've agreed with the point that everyone here is trying to make. Just because one person comes here with an analysis about a player **doesn't goddamn mean it's accurate**. Glad we're on the same page for the first time in a year.","replies":[]}]}]}]}]}]},{"poster":"GatekeeperTDS","date":"2019-08-14T01:21:16.951+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"KFCeytron","date":"2019-08-14T02:36:31.453+0000","up_votes":2,"down_votes":0,"body":"http://giphygifs.s3.amazonaws.com/media/POql6zsXZbmcE/giphy.gif","replies":[]},{"poster":"Savage the King","date":"2019-08-14T02:50:34.150+0000","up_votes":1,"down_votes":4,"body":"What I have to give to this OP's argumentation is, while I would not agree with name &amp; shame, negative players are present on a consistent basis (there seems to be little reduction in occurrence of toxic in-game behavior) and we have no means of knowing whether the reports we give produce results, proof No. 1 is that there is a consistent occurrence of toxic in-game behavior. Even tickets seem of no use, and the last time I wrote a ticket for some extreme behavior (2 tickets in 6 years I think I'm being moderate), this blitzcrank bot telling me \"we got your stuff into the system\". Talk about feeling powerless. Why does there seem to be always as much toxic behavior? Does the system work at all? I would be tempted to answer \"no\".","replies":[{"poster":"GatekeeperTDS","date":"2019-08-14T03:01:46.210+0000","up_votes":4,"down_votes":2,"body":"**Report DOES NOT EQUAL punishment.** Period.\n\nReport flags the system to review the player in question. If they've met the criteria to be punished, they will be punished. If they have not met the criteria to be punished, they will not be punished. Why is this so terribly hard for people to understand?\n\nEven if the dude was negative as all hell, he's not going to get punished just because you reported him **unless** the system has determined his **PATTERN OF BEHAVIOR** has reached punishment level.\n\nPeople need to stop expecting instant gratification out of this system, release the bad mojo, and **move on with their lives after reporting someone.**","replies":[{"poster":"Savage the King","date":"2019-08-14T03:08:55.822+0000","up_votes":1,"down_votes":5,"body":"I don't think any sort of caps will add strength to your argumentation. You don't address the point I bring which is \"there is a consistent occurrence of toxic in-game behavior\". If with increasing time, it does not decrease, then there are legitimate reasons to believe the system doesn't work. Your level of trust in it is as relevant as the point of view of an individual, and mine is most probably just as good as far as opinions go.\n\nWhen people don't trust the system to work, things like this original post happen. It's simple as that and I encourage you to work your mind around this problem, that you apparently oversimplify to \"report and go on\". With time increasing, the toxicity problem makes people hate playing this game. It's hard to go on when you are hating the game. We are not all zen masters like you, but I assure you we'd all like to be.\n\nIn the meantime, I think it's fair for me to voice that I believe Riot should work towards making players who hate playing this game, hate it less.","replies":[{"poster":"GatekeeperTDS","date":"2019-08-14T03:14:16.441+0000","up_votes":2,"down_votes":1,"body":"> In the meantime, I think it's fair for me to voice that I believe Riot should work towards making players who hate playing this game, hate it less.\n\nAnd unfortunately, Riot can't please everyone. That's you, that's Soul Dealer.\n\nThere are far, far more players who are either neutral in opinion on this system or believe it's had a positive influence than the 10 people a day who come on here because they can't climb due to an unusual amount of trolls and inters and AFKs.\n\n> I encourage you to work your mind around this problem\n\nI can't do that, because **I don't have a problem with the current system**. My own ability to tune out assholes helps me primarily, and on the very, very, very rare occasion where I've had a legitimate intentional feeder (which I can count on two hands since I started playing at the end of Season 1) I trust they'll get what's coming to them.\n\nYou are in the minority whether you choose to believe it or not.","replies":[{"poster":"Savage the King","date":"2019-08-14T03:42:02.685+0000","up_votes":1,"down_votes":4,"body":"It's your opinion. Mine's mine. Show me the stats. Occurrence of board threads is not a reliable indicator. Don't choke on people's input if it's legit. Makes you someone that kills the conversation. You are being emotional about your replies in a way that is borderline toxic. I still encourage you to work your mind around this problem, which is not \"do I feel okay with the system\" but \"why some players hate the game?\". If they say they do then they do and your thinking they're a minority is not a valid argument to dismiss them.","replies":[{"poster":"GatekeeperTDS","date":"2019-08-14T03:50:01.892+0000","up_votes":2,"down_votes":2,"body":"Lol, we're done here. You're doing an awful lot of attacking of me rather than the arguments. I don't have to prove the negative, you all need to prove your claim that the system isn't working. Have a good night!","replies":[{"poster":"Savage the King","date":"2019-08-14T04:10:14.310+0000","up_votes":1,"down_votes":9,"body":"Buddy, I will add that you completely discredit yourself by playing only normals; as reports are essentially irrelevant in normals, so is your perspective on the report system.","replies":[{"poster":"Imperial Pandaa","date":"2019-08-14T04:44:49.891+0000","up_votes":4,"down_votes":1,"body":"I feel this discredits you.\n\nNormals, Ranked, ARAM, and RGM are all part of the game. You don't get to go \"Well, fuck this game mode. No one cares about it.\" Things only change slightly between them, like no role stealing exists in Blinds since Blinds don't have assigned roles.","replies":[{"poster":"Savage the King","date":"2019-08-14T04:55:11.138+0000","up_votes":1,"down_votes":9,"body":"I think in 900 or so normal games I must have used the report function less than 10 times because I don't care much about the game outcome. The report function essentially _is _ irrelevant in that game mode. That user's perspective _is _ irrelevant on the subject matter, sorry.","replies":[]}]}]}]}]}]}]}]}]}]}