{"poster":"Don Pasota","date":"2017-09-08T03:41:35.943+0000","title":"Dificultad altísima invasion","subforum":"Charlas Generales","up_votes":9,"down_votes":5,"body":"Con respecto al nuevo evento de Invasi&oacute;n me parece exagerada la dificultad ojal&aacute; lo arreglen pronto ya que solo entre premades de 5 se podr&iacute;a ganar","replies":[{"poster":"Lucio22","date":"2017-09-08T03:45:33.296+0000","up_votes":5,"down_votes":6,"body":"a mi me parece perfecta, sino no seria un reto y se volveria aburrido, como con los doom bots originales (que pasabas los 20 min y les agarraba una embolia gigante)","replies":[{"poster":"SShadowj","date":"2017-09-08T04:09:09.990+0000","up_votes":3,"down_votes":1,"body":"El tema es la franja que separa lo de que sea un reto y lo que sea imposible. Porque eso nisiquiera tiene cosas lógicas como para que pueda ser pasable. No te dan mucho oro para buildearte, te reducen la curación (Pobre Soraka se vuelve useless más adelante entonces) y básicamente como tenes límite de champs para usar no todos rinden tanto como otros.","replies":[{"poster":"Aslicolly17","date":"2017-09-08T05:20:04.603+0000","up_votes":2,"down_votes":0,"body":"tambien te limitan los hechizos de invocador y los items, estoy seguro que un limpiar, o hasta el smite servirían más","replies":[{"poster":"rokushoger","date":"2017-09-08T11:18:12.971+0000","up_votes":2,"down_votes":0,"body":"El smite sería genial","replies":[]}]},{"poster":"Lucio22","date":"2017-09-08T05:37:11.143+0000","up_votes":2,"down_votes":1,"body":"en realidad, lo que reducen es la armadura, mr y lifesteal, no curacion\n\npor otro lado, recien jugue con 4 que nos conocimos en ese juego, llegamos hasta la mitad del coso final por lo menos. si te metes con 4 amigos que se conozcan entre si (tanto por como son como por como juegan), no deberia resultar dificil (me parece perfecto que hagan eso, ya que limita el tema de meter 4 randoms para simplemente llenar el cupo)","replies":[{"poster":"SShadowj","date":"2017-09-08T12:12:14.015+0000","up_votes":1,"down_votes":1,"body":"Es verdad, pero igual que te saquen fuente de vida en un modo como este es una boludes, mas teniendo en cuenta que los ADC's les cuesta una bocha porque ni llegas a buildearte full en el modo entonces les cuesta bastante.\n Supongo que si, no probe premade implacable todavía pero si tengo que hacer todo un equipo para poder ganar las misiones una pena la verdad, demasiado quilombo.","replies":[]}]},{"poster":"Sexrex","date":"2017-09-08T13:08:00.490+0000","up_votes":1,"down_votes":0,"body":"Soraka gana sola.","replies":[]}]},{"poster":"Kevinggg","date":"2017-09-08T04:35:50.275+0000","up_votes":2,"down_votes":0,"body":"Mi meta en la vida no es pasar este modo horrible, quiero las recompensas con una misión normal o secundaria no una misión imposible con 40 requisitos","replies":[]}]},{"poster":"SShadowj","date":"2017-09-08T04:10:53.621+0000","up_votes":2,"down_votes":0,"body":"Yo lo pase en implacable con Poppy, pero ya te digo. Nos tocaron stages fáciles dentro de todo, en el de escape el más fácil es el de los Cho'gath y Rek'sai porque los de Vel'koz son imposible por lo que veo al menos. Después en la final la pudimos pasar bastante bien que nos pusimos las pilas, básicamente no se como uno hará para las misiones que por ejemplo te piden sin ADC's o Ap's porque por ejemplo ya te digo que Poppy es obligatoria en ese modo, por su W para prevenir gap closers y porque es tanke y puede revivir a los demás.","replies":[{"poster":"LeøniN","date":"2017-09-08T04:31:57.698+0000","up_votes":2,"down_votes":0,"body":"tal cual yo creo que gane 2 o 3 en implacable y fue solo con poppy, fue parecido a lo que vos decis. En una fue una miss y yo corriendo del boss final mientras una soraka y una janna cubrian a la jinx. En resumen tendrian que cambiar las misiones. Pero es verdad esto no se lo puede tomar como reto es imposibol xD","replies":[{"poster":"SShadowj","date":"2017-09-08T11:50:47.569+0000","up_votes":1,"down_votes":0,"body":"Jajajaja no te cuentan las misiones si jugas solo Poppy eso si que es una lastima :'(, lo que si Soraka no se si rinde tanto porque a medida avanzas la curación se reduce y ademas en este modo para un personaje que cura con su propia vida, tiene que mirar que no la ataquen a ella también, teniendo en cuenta que curas y te sacas vida, y los bichos ya de por si te hacen mierda la vida la perdes enseguida xD.\n Con Poppy el boss final es bastante fácil porque tankeas una banda y lo podes llevar a todos lados para que ellos ataquen, lo único es que si te quedas delante de él cuando tira ese spiral de ataques te oneshotea litera, me paso, tenia 3k y esos 3k me los esfumo en 1 segundo porque creí que podía tankearme eso que iba a tirar.","replies":[]}]}]},{"poster":"Dragonhex","date":"2017-09-08T03:47:36.864+0000","up_votes":2,"down_votes":0,"body":"yo aun no veo a nadie que lo pueda pasar en dificultas implacable, yo lo máximo que pude fue dejar al jefe final a 700 de vida y nos mato \n{{sticker:cass-cry}}","replies":[{"poster":"The Steel Shadow","date":"2017-09-08T05:56:21.125+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Dragonhex,realm=LAS,application-id=v7qsfXsE,discussion-id=R94ga6lz,comment-id=0002,timestamp=2017-09-08T03:47:36.864+0000)\n>\n> yo aun no veo a nadie que lo pueda pasar en dificultas implacable, yo lo máximo que pude fue dejar al jefe final a 700 de vida y nos mato \n> {{sticker:cass-cry}}\n\nya gané las de guardianas primigenias y las de las nuevas, y adivina, las nuevas no podia pickear poppy y igual ganamos","replies":[]},{"poster":"Ursus Niger","date":"2017-09-08T05:34:37.381+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-nunu-tears}} \nque sad man (me pasó lo mismo xd)","replies":[]}]},{"poster":"Jieuno","date":"2017-09-08T04:56:23.444+0000","up_votes":3,"down_votes":2,"body":"no lleva ni un día y ya se estan quejando que es imposible xD es un poco de práctica y entender lo que se está jugando y de a poco podrás terminarlo. no seas impaciente","replies":[]},{"poster":"Sexrex","date":"2017-09-08T13:07:19.431+0000","up_votes":1,"down_votes":0,"body":"Por qué se quejan tanto? Es cuestión de práctica. El modo salió hace literalmente menos de 24 horas.\n\nArranqué con 15 derrotas consecutivas, jugando derecho en Implacable (un amigo habia instaperdido una en normal y la creo él y nos desbloqueó el modo a todos) y ahora creo que ando en 10 W 16 L o algo así.\n\nYa me pasé todas las misiones salvo la de sacar S (lo más alto que conseguimos fue A).\n\nSoraka: redencion, pebetero, warmog, solari y botas de mr y ganas solo.\nEl dificil es el de no pickear supports xD.\n\nA mí particularmente me encantó el modo, y sinceramente me gustó más que el LoL en general XD, estaría bueno que hagan más cosas así.","replies":[{"poster":"SShadowj","date":"2017-09-08T15:25:27.337+0000","up_votes":1,"down_votes":0,"body":"Eran todos premade o como? Sinceramente vengo jugando varias y como Soraka no se como les resulta tán fácil... ser un support que para curar se saca vida y teniendo en cuenta que tenes que protegerte vos de que los rayos o cualquier cosa no te bajen la vida no es una tarea fácil a mi parecer xD, cuando te das cuenta entre que curaste y pegaste te garcharon totalmente.\n El modo me encanto a mi, me gustan los retos mucho, siempre soy de cada juego en el que entro ponerle la máxima dificultad para luego sentir satisfacción al pasarlo pero esto me esta resultando muy complicado la verdad xD. Supongo que es como dicen todos que es cuestion de coordinación pero todavía no encontre un equipo así, hasta ahora juego todo random.","replies":[{"poster":"Sexrex","date":"2017-10-13T20:14:02.885+0000","up_votes":1,"down_votes":0,"body":"Pebetero, Redención, Solari, Botas de MR y warmog y ganás solo xD","replies":[]}]}]},{"poster":"Mecha Sétt","date":"2017-09-08T21:17:37.587+0000","up_votes":1,"down_votes":0,"body":"Hola, El modo esta pensado para ser un desafió y solo aquellos equipos organizados y con habilidad puedan lograrlo, no conozco a nadie que lo haya logrado aun pero porque no he aplicado la guia completa filtrada en ingles, de todos modos la pase al español. Se que no sera mucho, pero espero te pueda ayudar esta guia. https://boards.las.leagueoflegends.com/es/c/guias-y-consejos/6X000Zl1-invasion-de-guardianes-de-estrellas-desde-redditcom","replies":[]},{"poster":"The Steel Shadow","date":"2017-09-08T05:55:13.346+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"SShadowj","date":"2017-09-08T11:48:31.912+0000","up_votes":1,"down_votes":0,"body":"En implacable. No normal.","replies":[]}]},{"poster":"Mephazo","date":"2017-09-08T03:45:35.260+0000","up_votes":1,"down_votes":0,"body":"(._\\)...","replies":[]}]}