{"poster":"Kwen","date":"2017-08-20T20:52:38.225+0000","title":"Ban Appeal to Riot?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Does anyone know the email for ban appeals to Riot? I got banned for two weeks, and I understand why I was banned but when they sent me the notification the only thing I could click was \"I understand\" The guy that reported me was being extremely toxic and racist but when I received my ban the only thing that showed was my chat history as if I had been talking to myself the entire game, then after the match the guy added me, I didn't know it was him because I didn't look at his screen name; and he was threatening me telling me to kill myself and that he would hunt me down and find my family and kill us all. A troll I know, but I would like to report it to Riot and hopefully have my ban reversed and gave this guy banned. {{summoner:1}}\n\nAlso, I didn't report the guy because as stupid as it sounds I figured that since he was being more toxic than I was that it was no big deal. So I don't expect to get my ban reversed, I'd just like to report this guy to riot since they seem to care more now.","replies":[{"poster":"Sardonic Sloth","date":"2017-08-21T16:51:21.087+0000","up_votes":2,"down_votes":0,"body":"it IS  a big deal though, you are not allowed to be toxic, even against toxic people, if you are toxic in response, even if your toxicity is objectively not as toxic as theirs, it still makes you punishable.","replies":[]},{"poster":"Broporo","date":"2017-08-21T00:15:00.298+0000","up_votes":1,"down_votes":0,"body":"If you ever need more context for a ban, or are simply curious why you got it in the first place, you can always feel free to hit up our player behavior team in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new). They'll be able to answer any questions you might have concerning that 2 week suspension, and if you have any screenshots of what the other person said they can look over that as well.","replies":[]}]}