{"poster":"Akivir","date":"2015-09-18T06:21:44.922+0000","title":"Should I study a Bachelor of Games Development?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"I&#039;ve heard from many sources that working your way up through the ranks of games development is more beneficial than a University course dedicated to games development. \r\n\r\nIs this true?\r\n\r\nIf not which University in QLD would seem best. Looking at QUT currently. If I could afford it I probably would have applied to AIE in NSW.\r\n\r\nRiot input would be handy as they have actual knowledge in the field. However anyone with experience would be a help. \r\n\r\ntyty ~Akivir","replies":[{"poster":"SEKAI","date":"2015-09-18T08:27:36.703+0000","up_votes":1,"down_votes":0,"body":"I think it's better to learn a more general tech degree like say Science, Engineering, Applied Mathematics/Physics etc before you dive into the gimmick side of technologies such as Game Development.\n\nBecause that way you won't be a 1 trick pony and your views/perspective on things wouldn't be limited by what a smaller scale degree offers as well.\n\nHowever if you really are not interested in those courses it's fine to just find one that suits yourself more as long as you know full well of the risk behind it. Don't be like me, who chose a degree based solely on \"security\" reasons which I only end up hating and getting stuck as a result.\n\nMa 2 cents.","replies":[{"poster":"ninjaIRL ","date":"2015-09-20T18:01:04.863+0000","up_votes":1,"down_votes":0,"body":"security reason? What did you choose?","replies":[{"poster":"SEKAI","date":"2015-09-20T18:49:27.979+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ninjaIRL ,realm=OCE,application-id=Ntey9fRZ,discussion-id=7zqAaVpL,comment-id=00020000,timestamp=2015-09-20T18:01:04.863+0000)\n>\n> security reason? What did you choose?\n\nElectrical Engineering.\n\nIt's more secured they say, which they're right, but that doesn't mean I am interested in or capable of it though.","replies":[{"poster":"ninjaIRL ","date":"2015-09-22T14:19:54.421+0000","up_votes":1,"down_votes":0,"body":"Is that a branch of IT or is it a synonym for IT consultant?\nor is it more labour intensive like changing cable lines?\nI was thinking of doing that as well, maybe more on the mental side.\n\nBecause people don't run out of electrical things to fix or make, they're right. ","replies":[{"poster":"SEKAI","date":"2015-09-22T14:57:05.291+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ninjaIRL ,realm=OCE,application-id=Ntey9fRZ,discussion-id=7zqAaVpL,comment-id=0002000000000000,timestamp=2015-09-22T14:19:54.421+0000)\n>\n> Is that a branch of IT or is it a synonym for IT consultant?\n> or is it more labour intensive like changing cable lines?\n> I was thinking of doing that as well, maybe more on the mental side.\n> \n> Because people don't run out of electrical things to fix or make, they're right.\n\nEverything you can think of that has electricity running in it can be included into the field of Electrical Engineering.\n\nYou're not fixing cables when you do this particular course, but rather you'd learn to understand, utilise and design electrical systems.\n\nThe topics can vary from general wiring, power generation/utilisation, microchip systems to programming depending on which particular route you decide to head towards. As a graduated electrical engineer, one can involve with power plants, telephone/internet providers, electronic production line or even space programs if they have the skill requirement met.\n\nElectrical Engineering, Software Engineering and Mechatronics are related to each other and can all be quite hard to get by (still holds no water against things like idk, Quantum Physics though), so I really wouldn't recommend everyone to test their luck with these subjects unless you're really interested in these kind of stuff. \n\nI'm not.\n\nI made the wrong choice of enrolling into Elec Eng because I was pretty much only thinking about securing a job position that time when I finished HSC, and has since got stuck with it. My overall grade is too low to warrant a transfer and there are other issues holding me back too. It's not really pleasant, at least for me.","replies":[{"poster":"ninjaIRL ","date":"2015-09-22T23:35:48.271+0000","up_votes":1,"down_votes":0,"body":"That sucks man. \nI hope it gets better.","replies":[]}]}]}]}]}]},{"poster":"JasonWazza","date":"2015-09-18T09:12:12.570+0000","up_votes":1,"down_votes":0,"body":"Honestly, there is no real point to doing so, if you think about the games market right now most are either massive companies, or indie developers.\n\nBeing indie doesn't require any qualifications it just requires you understand how to make a game and go from there.\n\nAs for the massive companies, you'd do better developing something indie and having a portfolio of good work over just the piece of paper, demonstration of the knowledge is better then a piece of paper saying you have it.","replies":[]},{"poster":"Essembie","date":"2015-09-18T08:19:41.192+0000","up_votes":1,"down_votes":0,"body":"You may have to work overseas.  There is going to be a Senate enquiry into fostering the games business but for the moment i am not sure what the employment prospects are like in oz.","replies":[]},{"poster":"laststanding6","date":"2015-09-18T06:43:00.490+0000","up_votes":1,"down_votes":0,"body":"if you like it enough than yeah, sure. problem is, how you gonna use it? Indie games? Mobile apps? Cause it is unlikely you are gonna make it with the big American companies.","replies":[]}]}