{"poster":"Lord Mufa","date":"2016-11-18T03:59:45.887+0000","title":"[INICIATIVA E IDEA] Nuevo método de sanción accesible para los usuarios mediante repeticiones.","subforum":"Charlas Generales","up_votes":23,"down_votes":2,"body":"**Muy buenas!!  Me presento en los foros para compartir libremente a todos ustedes mi visi&oacute;n e idea acerca de un posible &quot;m&eacute;todo&quot; o modo de revisi&oacute;n que podr&iacute;a existir (o por lo menos ser tomado en cuenta) e implementar en un futuro lejano para poder sancionar a un jugador malintencionado. **\n\n***** Me gustar&iacute;a que lean toda la publicaci&oacute;n ya que me tom&oacute; tiempo escribirlo y pensarlo de tal manera que sea entendible mi enfoque para todos!.\n\n***** Cualquier aporte, duda o comentario es bienvenido para mejorar la idea y llegar a mas personas para que pueda ser visto y apoyado!\n\n{{summoner:4}}  _Desde ya empecemos!_\n\n**INTRODUCCI&Oacute;N---------------------------------------------------------------------------------------------------------------------------------**\n\nPara empezar, quisiera enfocarlos en el tema  reflexionando con ustedes sobre cuantas veces hemos reportado a esos infames usuarios totalmente t&oacute;xicos y/o molestos que hacen lo posible para arruinarte la partida a prop&oacute;sito pasando de morir 25 veces intencionalmente o &quot;feedear&quot; al laner contrario solo para ver tu reacci&oacute;n en plena partida competitiva cuando estas dando el 200% de vos y al momento de enviar el reporte lo &uacute;nico que recib&iacute;s es un &quot;gracias por tu reporte, lo tomaremos en cuenta&quot; (ahora mismo no recuerdo exactamente que dice pero te agradece y dice que ser&aacute; revisado) y nunca mas vuelves a saber de ese esperado mensaje de que fue sancionado y sigues viendo su historial activo con la misma actitud negativa  ya sea porque ese reporte solo vos o compa&ntilde;eros mas de tu equipo hizo el debido reporte mientras que el resto no le import&oacute; en lo absoluto o se aprovech&oacute; de esa mala intenci&oacute;n?\n\n(Por mi parte estoy desconforme con el m&eacute;todo actual de reportes pero no del todo porque muchas veces cumplen su funci&oacute;n y penaliza a quien se lo merece pero much&iacute;simas otras veces puede pasar mucho tiempo en que te haga caso, a tal punto que no pasa o sino cuando recibes el mensaje de que ese usuario fue sancionado vos pones cara de &quot;Han pasado 84 a&ntilde;os desde el ultimo reporte que me hicieron caso&quot;)\n {{item:3151}} \n\n**MI IDEA -------------------------------------------------------------------------------------------------------------------------------------------**\n\nComo sabemos hace poco se implement&oacute; el sistema de repeticiones de partidas lo cual era algo que la comunidad ped&iacute;a hace un tiempo ya y es una herramienta muy &uacute;til al momento de querer guardar tus mejores momentos o lo que quieras retocarle  pero.. yo pienso que se puede exprimir mucho mas el potencial con esta herramienta, y  es exactamente para reportar.\n\n**voz de comercial* *\nQu&eacute; les parece si ustedes mismos pudieran ser los jueces de una persona reportada mediante la repetici&oacute;n de una partida a trav&eacute;s de un sistema X y que puedan decidir si mediante sus acciones ese jugador es merecedor de sanci&oacute;n o no?\nAlgo as&iacute; como justicia por mano propia invocadores!! {{summoner:11}} (? \n\nUstedes mismos podr&iacute;an ayudar a limpiar los campos de la justicia contribuyendo mediante esta herramienta, que opinan? {{summoner:13}}  \n\n{{item:3348}} **_Requisitos para formar parte de este sistema:_**    \n\n-Tener buena actitud, ser nivel 30 y tener cierta cantidad de tiempo jugado. (Son las 2 mas aceptadas y que se ha podido plantear).\n\n{{champion:17}} _**Por qu&eacute; estos requisitos? **_\n\n*-La buena actitud porque es la misma que se aplic&oacute; al momento de dar recompensas. 0 penalizaciones = buena actitud.\n*\n\n-Cierto tiempo jugado porque conlleva experiencia de juego, lo cual ser&iacute;a un buen requisito para acceder a esta herramienta.\n\n{{item:2054}} _**Recompensa por participar?: **_\n\nEstuve pensando en un peque&ntilde;o incentivo para que, con el pasar del tiempo,  estos jugadores  asignados sigan contribuyendo con este sistema sin perder el auge o ganas y mi mejor idea ser&iacute;a una recompensa de **bonificaci&oacute;n de PI** en X partidas por participar! (posiblemente).\n\n{{item:3462}} _**Dato importante!**_\n\nObviamente no todos los que sean reportados caer&iacute;an a revisi&oacute;n en este sistema (con pensarlo ser&iacute;a un caos) pero s&iacute; que sean llevados a revisi&oacute;n despu&eacute;s de cierta cantidad de reportes emitidas por los usuarios para que los que sean asignados tengan la posibilidad de ver la repetici&oacute;n de la partida del reportado y as&iacute; llegar a una resoluci&oacute;n justa y  colectiva {{champion:51}} .\n\n\n\n_**-MI CONCLUSI&Oacute;N Y FINAL-----------------------------------------------------------------------------------------------------------------------------**_\n\nCon esta nueva herramienta los propios usuarios podr&iacute;an contribuir con el juego y la comunidad misma participando en un sistema de penalizaci&oacute;n comunitaria y leg&iacute;tima 100% real no fake penalizando a los que merecen  mejorando la calidad de juego.\n\nMe gustar&iacute;a saber si opinan lo mismo y si apoyan esta idea! como saben existe la posibilidad de que se pueda hacer realidad o por lo menos tomado en cuenta siempre y cuando tenga apoyo de muchas personas!! por lo que estoy abierto a recibir ideas/consejos/rechazo total de todo esto/etc.\n\n_**Desde ya me despido y muchas gracias por entrar a cureosear o haber le&iacute;do todo!**_ {{summoner:31}}","replies":[{"poster":"Doomenator","date":"2016-11-18T06:30:31.692+0000","up_votes":8,"down_votes":0,"body":"Yo soy diamante 5 y acá hay más flamers aún que en ligas bajas, así que no le veo la lógica a el requisito de ligas.","replies":[{"poster":"SalchichonSion","date":"2016-11-18T07:40:11.739+0000","up_votes":2,"down_votes":0,"body":"En cualquier liga tenes buenos jugadores.. buena gente.. las malas decisiones los atan a sus elos y la mala gente. \npero la diferencia es que en bronce los que juegan bien se cagan de risa de todo.. y en sus ligas, generalmente, donde les comentas algo respecto a su estilo de juego suelen ofenderse y se ponen a discutir, ponerse flamer o peor y se van afk por ragequit o trolean... y ademas tenes los famosos \"elobusteados\" que simplemente mirando en las paginas \"op gg\" los perfiles, partidas, win rate con los campeones y escores te podes dar cuenta si es elobusteado o no...","replies":[{"poster":"Doomenator","date":"2016-11-18T16:55:50.292+0000","up_votes":1,"down_votes":0,"body":"Y denuevo, eso pasa en todas las ligas xD\n\nY de hecho es peor en elo alto, o sea, ¿Quién eloboostea a silver? ¿¡bronce!? para nada, los eloboosteados están en gold mínimo xd","replies":[{"poster":"Lord Mufa","date":"2016-11-18T20:16:16.139+0000","up_votes":1,"down_votes":0,"body":"La verdad que sí, y es algo que no se puede controlar ya que es algo que a simple vista pasa por desapercibido por la mayoría de las personas :/","replies":[{"poster":"Doomenator","date":"2016-11-18T22:50:48.394+0000","up_votes":1,"down_votes":0,"body":"Es bastante obvio pero ese no es el problema, simplemente saca la restricción de ligas y tu idea es perfecta","replies":[]}]}]}]},{"poster":"Lord Mufa","date":"2016-11-18T20:14:33.766+0000","up_votes":1,"down_votes":0,"body":"Es verdad, tuve muchas dudas al considerarlo pero creí que sería lo \"correcto\", por eso puse el algo así entre rayado jaja pero de todas formas es una idea.  Gracias por comentar!","replies":[]}]},{"poster":"Shion Archimago","date":"2016-11-18T17:46:30.946+0000","up_votes":1,"down_votes":5,"body":"no.me gusta es innecesarias riot hace bn su trabajo deberian eliminar los replay solo genera toxicidad","replies":[{"poster":"pajarit0","date":"2016-11-18T17:52:31.089+0000","up_votes":4,"down_votes":0,"body":"tiene miedo de que lo manden al frente por un replay minecrafteero jajaja","replies":[{"poster":"Shion Archimago","date":"2016-11-18T18:57:40.533+0000","up_votes":1,"down_votes":0,"body":"https://img.buzzfeed.com/buzzfeed-static/static/2016-04/5/13/enhanced/webdr06/enhanced-3790-1459878831-1.jpg","replies":[{"poster":"pajarit0","date":"2016-11-21T18:52:23.299+0000","up_votes":1,"down_votes":0,"body":"júntate 13900 de pi hacete el favor a vos","replies":[]}]}]},{"poster":"Lord Mufa","date":"2016-11-18T20:23:17.676+0000","up_votes":1,"down_votes":0,"body":"A que te refieres con eso de toxicidad? gracias por comentar","replies":[]}]},{"poster":"Fiky","date":"2016-11-18T06:07:28.626+0000","up_votes":3,"down_votes":0,"body":"el requisito de ligas es algo ambiguo, es como decir que los pobres roban porque son pobres y los ricos no, por ser ricos. Mi punto, tiempo jugando si, liga no, todo lo demás me parece bastante bien dentro de todo","replies":[{"poster":"Lord Mufa","date":"2016-11-18T20:22:51.340+0000","up_votes":2,"down_votes":0,"body":"Muchos comentaron lo mismo, es algo que dudé en si colocarlo o no jaja, pero bueno si se toma en cuenta todo esto obviamente eso de las ligas se debería cambiar, gracias por comentar!","replies":[]}]},{"poster":"Font","date":"2016-11-18T12:43:17.891+0000","up_votes":1,"down_votes":0,"body":"Muy buena idea {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Lord Mufa","date":"2016-11-18T20:31:25.518+0000","up_votes":2,"down_votes":0,"body":"Gracias! :D","replies":[]}]},{"poster":"Darkfoe703","date":"2016-11-18T14:28:45.616+0000","up_votes":1,"down_votes":0,"body":"El requisito de liga está mal.... Es como un Tribunal 2.0 y no creo que lo contemplen por ahora.","replies":[{"poster":"Lord Mufa","date":"2016-11-18T20:28:35.629+0000","up_votes":2,"down_votes":0,"body":"Muhos comentaron lo mismo! concuerdo también con su pensamiento. Gracias por comentar!","replies":[]}]},{"poster":"bertox","date":"2016-11-18T14:14:43.596+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Lord Mufa","date":"2016-11-18T20:30:56.609+0000","up_votes":1,"down_votes":0,"body":"Si bien sabemos que riot castica a esos usuarios que estan con la pesada en alto, muchas veces pasa por alto éste sistema. Ya lo he vivido varias veces y he visto usuarios con un historial pésimamente malo con build aleatorias y con racha de derrotas a propósito de los cuales nunca fueron castigados. Hasta el día de hoy siguen jugando y es molesto saber que esas personas pueden andar por ahí haciendo lo que se les cante y que el sistema actual no funcione del todo correcto ya sea porque no recibió la cantidad necesaria o algo parecido, que dices? \n\nGracias por comentar!","replies":[]}]},{"poster":"rokushoger","date":"2016-11-18T10:57:44.947+0000","up_votes":4,"down_votes":2,"body":"> Cierta liga porque es lo que determina donde deberías estar y al ser así indirectamente se aplica lo que eres como jugador, si eres bueno estarás en cierta liga, por lo que podría considerarse como requisito o algo así.\n\nNo estoy de acuerdo. Yo llevo más de 6 o 7 años jugando y soy unranked, la liga no determina la habilidad de todos los jugadores. Aparte una actitud negativa todos podemos reconocerla, y por supuesto que estar en cierta liga no te hace mejor o peor persona.\n\nEn cuanto a tu idea, básicamente lo que sugerís es como el sistema que estaba antes (tribunal) pero con la repetición de la partida, lo cual la verdad no me parece muy óptimo por varias razones:\n\n1- No se puede asegurar la imparcialidad del que vota. Es decir, un día te levantaste de mal modo y todos los casos los ves castigables, a la hora te enteraste que ganaste el 5 de oro y todo te parece leve, me explico?\n\n2- Se pueden dar errores humanos (votos por error, la repetición fue mal subida, etc).\n\n3- Es mucho más lento. Nunca un humano va a trabajar tan rápido como un sistema automático, ni va a ser tan imparcial como dicho sistema.\n","replies":[{"poster":"Lord Mufa","date":"2016-11-18T20:21:27.109+0000","up_votes":1,"down_votes":0,"body":"Por supuesto, pero imaginemos que si existiera este sistema, no sería solo tu juicio el que decida si penalizar al usuario o no, sino que sería por un grupo de personas que tomaran una decisión final. Como lo habia dicho antes, una resolución justa y colectiva! Obviamente es un proceso largo pero aseguraría la sanción poco a poco de esas personas indebidas ya sea poco a poco, me explico?\n\nAsí como lo fue el tribunal, éste no tendría que ser necesariamente el único método ya que sería lento pero sí satisfactorio para la mayoría, ademas es una responsabilidad al que se le asigna que debería tener en cuenta supongo. Pero bueno es un grano de arena la idea, tampoco que tenga que ser el único método así como dije antes. \n\nMuchas gracias por comentar!","replies":[{"poster":"rokushoger","date":"2016-11-19T18:27:41.648+0000","up_votes":1,"down_votes":0,"body":"Una decisión de una mayoría no la hace justa, sino mirá los sistemas politicos democráticos, paises arruinados por presidentes que eligió su pueblo mismo, y se equivocaron. En cambio un sistema automático no hay forma de corromperlo, y va a tomar decisiones basado en su programación y listo.\n\nY me parece que sería un gasto de recursos tener dos sistemas funcionando a la vez solo para darle una sensación de poder a la masa, que en los hechos no tendrán ningún control, dado que los casos que ellos revisen serán miles de veces menos que el sistema automático.\n\nLa única excepción que le veo a eso sería para los casos \"grises\" como el del singed que apareció hace poco, pero generar un sistema entero de votación para que, 10 casos al año? Me parecería una mala inversión.","replies":[]}]},{"poster":"Zoliza","date":"2016-11-18T11:39:22.731+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=v7qsfXsE,discussion-id=nvP2skdJ,comment-id=0004,timestamp=2016-11-18T10:57:44.947+0000)\n>\n> No estoy de acuerdo. Yo llevo más de 6 o 7 años jugando y soy unranked, la liga no determina la habilidad de todos los jugadores. Aparte una actitud negativa todos podemos reconocerla, y por supuesto que estar en cierta liga no te hace mejor o peor persona.\n> \n\nHay gente en liga superior a otros jugadores y tienen menor habilidad, solo que rankean mas. Vos sos unranked nunca rankeaste por ende no sabes tu nivel real ya que nunca rankeaste para saber donde esta tu limite y no podrias subir mas, lo mismo va para las personas que juegan poco ranked, en mi  caso nunca me estanque en ninguna liga, esta fue la season que mas ranked jugue desde la season 3 y entre las 3 cuentas debo tener 81 ranked aprox jugadas y nunca me estanque en una liga o jugue 500 ranked para saber cual era mi nivel.\nUna persona que juega hace muchos años como vos o yo puede tranquilamente tener el nivel de un platino o diamond 5 sin rankear, pero hay gente que cree que en normal no podes aprender nada y no se puede jugar seriamente, cuando el aprender depende de la actitud del jugador y no de la cola que utilice, por ejemplo los bronces 5 con 500+ ranked por temporada en la misma division.","replies":[{"poster":"rokushoger","date":"2016-11-18T14:03:23.584+0000","up_votes":1,"down_votes":1,"body":"Perdón pero no entendí el punto de lo que me estás quoteando, podrías explicarlo?","replies":[{"poster":"Zoliza","date":"2016-11-18T14:33:25.568+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=v7qsfXsE,discussion-id=nvP2skdJ,comment-id=000400000000,timestamp=2016-11-18T14:03:23.584+0000)\n>\n> Perdón pero no entendí el punto de lo que me estás quoteando, podrías explicarlo?\n\nSolamente estoy de acuerdo con tu punto de vista en esa parte del post respecto a la habilidad de los jugadores y su liga y me explaye un poco... un poco MUCHO, talvez? xD","replies":[{"poster":"rokushoger","date":"2016-11-18T16:54:34.641+0000","up_votes":1,"down_votes":0,"body":"Ahhh no, perdón, es que pensé que no estabas de acuerdo no se porqué, y lo que leía me sonaba justamente a que estabas de acuerdo, perdón, mala interpretación mía, es lo que pasa cuando trabajas a mil por hora y mirás 5 minutos el foro a la apurada XD.","replies":[{"poster":"Zoliza","date":"2016-11-18T17:11:43.809+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=v7qsfXsE,discussion-id=nvP2skdJ,comment-id=00040000000000000000,timestamp=2016-11-18T16:54:34.641+0000)\n>\n> Ahhh no, perdón, es que pensé que no estabas de acuerdo no se porqué, y lo que leía me sonaba justamente a que estabas de acuerdo, perdón, mala interpretación mía, es lo que pasa cuando trabajas a mil por hora y mirás 5 minutos el foro a la apurada XD.\n\nEs lo bueno de tener dos monitores en el trabajo (?)","replies":[{"poster":"rokushoger","date":"2016-11-18T17:13:51.935+0000","up_votes":1,"down_votes":0,"body":"No, es lo bueno de que tu jefe trabajo en una oficina bieeeeeeeeeeeeeeeeeeeeen lejos jajajajaja","replies":[{"poster":"Zoliza","date":"2016-11-18T17:31:38.513+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=v7qsfXsE,discussion-id=nvP2skdJ,comment-id=0004000000000000000000000000,timestamp=2016-11-18T17:13:51.935+0000)\n>\n> No, es lo bueno de que tu jefe trabajo en una oficina bieeeeeeeeeeeeeeeeeeeeen lejos jajajajaja\n\nTrabajo con mi jefe enfrente justo jaja esta en un escritorio frente al mio asi que no ve lo que hago (?)","replies":[]}]}]}]}]}]}]}]},{"poster":"hOITemmie","date":"2016-11-19T18:42:12.334+0000","up_votes":1,"down_votes":0,"body":"Me encantaria poder ayudar a esta comunidad. No queremos otro Tyler1, verdad?","replies":[]},{"poster":"Runth","date":"2016-11-18T04:39:54.929+0000","up_votes":1,"down_votes":1,"body":"eso esta en contra las reglas de codigo","replies":[{"poster":"Lord Mufa","date":"2016-11-18T23:41:28.124+0000","up_votes":1,"down_votes":0,"body":"No entendí tu comentario, igual gracias por comentar!","replies":[{"poster":"Runth","date":"2016-11-19T06:42:13.172+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Flakooo,realm=LAS,application-id=v7qsfXsE,discussion-id=nvP2skdJ,comment-id=00010000,timestamp=2016-11-18T23:41:28.124+0000)\n>\n> No entendí tu comentario, igual gracias por comentar!\n\nusar evidencias contra otros q puede provocar demandas, los unicos q tienen sus derechos al ser juzgados es riot y el tribunal y tus propias pruebas con imagenes anonimas","replies":[]}]}]},{"poster":"Zevko","date":"2016-11-18T23:01:44.767+0000","up_votes":1,"down_votes":0,"body":"que los usuarios dedican quien es sancionado = catástrofe.","replies":[{"poster":"Lord Mufa","date":"2016-11-18T23:43:09.950+0000","up_votes":1,"down_votes":0,"body":"Creeme que no, como dije antes no todos podrían acceder a esta herramienta. O al menos es mi idea jaja, deberían cumplir ciertos requisitos los cuales son 2 actualmente. Gracias por compartir tu idea!","replies":[{"poster":"Zevko","date":"2016-11-18T23:59:23.840+0000","up_votes":1,"down_votes":0,"body":"de que requisitos estamos hablando? porque aca solo veo gente baneando a otra por bronca que no le dieron el azul o no los gankearon, tenes que mirar el lado malo también de las cosas, no asumir que la gente va a hacer 100% lo correcto.","replies":[]}]}]},{"poster":"KHAMER","date":"2016-11-18T22:44:54.594+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Lord Mufa","date":"2016-11-18T23:44:01.420+0000","up_votes":1,"down_votes":0,"body":"Estaría muy buena la idea de revisar el chat también, en un pasado se hizo eso con el tribunal. Por que no devuelta? \n\nGracias por comentar!","replies":[]}]},{"poster":"Hell Darking","date":"2016-11-18T04:34:59.690+0000","up_votes":1,"down_votes":0,"body":"Tomando en cuenta que las es la region con mayor cantidad de platas y bronces.. el segundo requisito no me gusta mucho (hay muchos platas y bronces que soy buenos jugadores, siguen el codigo de lol, reportan cuando es debido y felicitan cuando la situacion lo amerita)\nlas otras dos si tienen mas sentido para mi, ser nivel 30 y tener X tiempo jugado.\nvolviendo a la idea original, lo veo muy poco probable que se implemente esta iniciativa, imaginate la cantidad de personas que juegan lol al dia, ahora fijate la cantidad de partidas al dia, te das cuenta la cantidad de videos que se enviarian a la semana? revisar y tomar una decision sobre si es baneable o no X persona tomaria semanas, en lo que se sanciona esa persona.. dicha persona ya volvio a hacer lo mismo en otras 40 partidas (volviendo al otro punto de revisar las partidas y tomar una decision si sancionar o no) sin tomar en cuenta las premades troll que incitan a trollear, porque en las repe no se ve lo que se escribio en el chat","replies":[{"poster":"Lord Mufa","date":"2016-11-18T23:41:54.428+0000","up_votes":1,"down_votes":0,"body":"Ya esta arreglado, si puedes difunde esta publicación así mas gente la puede apoyar! gracias por comentar :D","replies":[]}]},{"poster":"Thails SirYordle","date":"2016-11-18T15:31:28.349+0000","up_votes":1,"down_votes":0,"body":"La idea esta buena excepto por lo de la liga, de igual modo ya saben como es Rito, no lo hara...","replies":[{"poster":"Lord Mufa","date":"2016-11-18T20:28:02.746+0000","up_votes":1,"down_votes":0,"body":"Puede que sí :D , puede que no :( quien sabe jaja. Gracias por comentar!","replies":[]}]},{"poster":"girlrules","date":"2016-11-18T17:16:33.351+0000","up_votes":1,"down_votes":0,"body":"Hacen falta los castigos(aparte de los ya existentes), un tribunal no vendria mal. acabo de ganar una ranked con una ashe flamer desde la seleccion ´´ con esos bans ya es gg``  ´´esos picks gg´´ ´´no pegas una q´´ ´´yasuo conseguite manos´´ ´´top sos un asco´´ , etc (la ashe flameo a toooooodo el mundo)  y como ganamos (y la verdad es que jugaba bien)  nadie la reporto {{summoner:1}}  Así que mande mi reporte para que esa mala persona siga flameando porque a la gente solo le importa ganar.","replies":[{"poster":"Lord Mufa","date":"2016-11-18T20:27:18.010+0000","up_votes":1,"down_votes":0,"body":"Muchos extrañan el tribunal jaja, yo en lo personal no lo pude experimentar ya que no conocía el juego aun, pero venía de 10 hasta que lo sacaron por mantenimiento y nunca mas se supo nada puede ser? ésto sería algo parecido, solo que con pruebas en video. Gracias por comentar!","replies":[]}]},{"poster":"Sweet Pony Pls","date":"2016-11-18T13:24:41.407+0000","up_votes":1,"down_votes":0,"body":"tipo el overwatch del cs go","replies":[{"poster":"Doctor Rata","date":"2016-11-18T19:50:34.864+0000","up_votes":1,"down_votes":0,"body":"Y el de wow","replies":[{"poster":"Lord Mufa","date":"2016-11-18T20:25:54.441+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Super Rata,realm=LAS,application-id=v7qsfXsE,discussion-id=nvP2skdJ,comment-id=00060000,timestamp=2016-11-18T19:50:34.864+0000)\n>\n> Y el de wow\n\nExactamente! de todas formas es una herramienta que facilmente puede ser implementada en LoL y aun así podría funcionar perfectamente! Si funciona en esos 2 juegos, por qué no podría funcionar en éste? gracias por comentar!","replies":[]}]}]}]}