{"poster":"metaworldpeace10","date":"2016-04-12T01:00:27.474+0000","title":"You know there's a problem when Dynamic queue threads are deleted on Reddit","subforum":"Gameplay","up_votes":139,"down_votes":21,"body":"Because of the overwhelming hatred for this stupid dynamic queue. It&#039;s time to fix this bullshit\n\nEDIT: I feel like I need to explain this. **THE NEW CHAMP SELECT (picking your role/secondary role) IS NOT DYNAMIC QUEUE.** Dynamic queue is when you can queue with any number of players (solo, duo, 3s, 4s and 5s) The problem with Dynamic queue is the ranking of players playing with the premade is hyper inflated to those that play solo. Because of the inflation, solo players have a tougher time dealing with and against premades. I can't play with my friends in this system, because I'm Gold and they're bronze. We used to be able to play on our RANKED 5s team, but now we can't play, unless I find a smurf account.","replies":[{"poster":"Keevalroy","date":"2016-04-12T02:10:23.413+0000","up_votes":45,"down_votes":9,"body":"Are you really surprised that the nazi Reddit mods are policing everything about this so Riot doesn't have to see it everywhere?  Without the \"bring back solo queue\" posts all over the place, they can pat themselves on the back for a job well done and show Riot that people are still happy with the game's direction and their choices.  \n\nLike...mindless white knight drones disgust me, but the LoL Reddit mods have an extensive history of taking it to extreme levels - this being one of the many cases.   Let's delete everything that could be seen as offensive to Riot so we can make room for memes, drama, and the ever-popular pro scene content that gets barfed all over the front page whenever an event is going on.  Is Dynamic supported?  Fuck no?  Welp, it's not useful information to Riot is it? (Deleted)  Sven actually did somethi - ? WOAH THAT FLASH #LCSBIGPLAYS _fap fap fap fap!_ (Upvote botted to the front page along with everything else that happened in the series.)","replies":[{"poster":"612X0dbmDS","date":"2016-04-12T06:31:56.526+0000","up_votes":12,"down_votes":3,"body":"> [{quoted}](name=Keevalroy,realm=NA,application-id=3ErqAdtq,discussion-id=X4fi3ZOG,comment-id=0001,timestamp=2016-04-12T02:10:23.413+0000)\n>\n> Are you really surprised that the nazi Reddit mods are policing everything about this so Riot doesn't have to see it everywhere?  Without the \"bring back solo queue\" posts all over the place, they can pat themselves on the back for a job well done and show Riot that people are still happy with the game's direction and their choices.  \n> \n> Like...mindless white knight drones disgust me, but the LoL Reddit mods have an extensive history of taking it to extreme levels - this being one of the many cases.   Let's delete everything that could be seen as offensive to Riot so we can make room for memes, drama, and the ever-popular pro scene content that gets barfed all over the front page whenever an event is going on.  Is Dynamic supported?  Fuck no?  Welp, it's not useful information to Riot is it? (Deleted)  Sven actually did somethi - ? WOAH THAT FLASH #LCSBIGPLAYS _fap fap fap fap!_ (Upvote botted to the front page along with everything else that happened in the series.)\n\nWell said.it's just pissing the community off more because they put censorship on the hottest topic right now.","replies":[]},{"poster":"General Esdeath ","date":"2016-04-12T15:47:46.864+0000","up_votes":6,"down_votes":0,"body":"Shit like that is why I never got into reddit.","replies":[{"poster":"Forn ala creme","date":"2016-04-12T20:29:24.480+0000","up_votes":3,"down_votes":5,"body":"Reddit is probably my favourite social network site ever. The moderation depends entirely on the subreddit though. I do understand the reason for removing QQ SoloQ threads though. Riot knows that you want it, spamming every day won't make a difference about that.","replies":[{"poster":"General Esdeath ","date":"2016-04-12T22:26:19.250+0000","up_votes":5,"down_votes":1,"body":"Lyte said the majority wants dynamic, so we're gonna spam to show how many people want solo q.","replies":[{"poster":"Forn ala creme","date":"2016-04-13T08:26:30.413+0000","up_votes":3,"down_votes":2,"body":"Either way you are a vocal minority. 1% of the playerbase QQing on Reddit or Boards will, at this point, not make a difference.","replies":[]},{"poster":"Trip Makaveli","date":"2016-08-05T15:03:47.651+0000","up_votes":1,"down_votes":0,"body":"lyte quit riot. where have u been for 3 months?","replies":[{"poster":"General Esdeath ","date":"2016-08-05T20:39:15.784+0000","up_votes":1,"down_votes":0,"body":"I know he left, but he was the leader of this project and convinced Riot it's what people wanted.","replies":[]}]}]}]}]},{"poster":"TotalJerk","date":"2016-04-12T07:17:16.387+0000","up_votes":11,"down_votes":5,"body":"The Riot pls list is there so that the front page isn't 99% the exact same demands all day every day. People use them to karma whore really hard.","replies":[]},{"poster":"Secretlolz","date":"2016-04-13T00:41:33.448+0000","up_votes":3,"down_votes":0,"body":"They are behaving like a communist government. I'm not fucking touching this game again until they fix their shit","replies":[]},{"poster":"Trip Makaveli","date":"2016-08-05T15:02:41.126+0000","up_votes":1,"down_votes":0,"body":"filthy redditors. 4chan is where its at uncensored freedom. oh btw its summer now so expect the quality of players to go way down during the day.","replies":[]}]},{"poster":"Packun Flower","date":"2016-04-12T01:04:39.432+0000","up_votes":33,"down_votes":4,"body":"Dynamic Q backfired, plain and simple, it cannot exist without SoloQ, and here we are with a mob full of angry Dynamic Q haters and a rank system that is in complete devastation and shambles because of it.","replies":[]},{"poster":"Wulf Helhammer","date":"2016-04-12T03:44:50.878+0000","up_votes":12,"down_votes":23,"body":"Maybe it's so the same topic doesn't flood the front page and something else can actually happen on the sub? I mean, we get it. A lot of people don't like it (nearly everyone but pros for, in my opinion, stupid and baseless reasons). So stop spamming about it.","replies":[{"poster":"Critmaster Garen","date":"2016-04-12T06:41:26.678+0000","up_votes":33,"down_votes":2,"body":"> [{quoted}](name=AvantelWings,realm=NA,application-id=3ErqAdtq,discussion-id=X4fi3ZOG,comment-id=0002,timestamp=2016-04-12T03:44:50.878+0000)\n>\n> Maybe it's so the same topic doesn't flood the front page and something else can actually happen on the sub? I mean, we get it. A lot of people don't like it (nearly everyone but pros for, in my opinion, stupid and baseless reasons). So stop spamming about it.\n\nyea, but heres the thing. after initial negative feedback, lyte still wanted to sell dynamic que as a large success amongst the player base, and claimed its liked by more people than its disliked.\n\nhe used a highly suggestive question in a poll that was guaranteed to get more positive answers than negative, and tried to sell this as a success for dynamic que.\n\nthe poll didnt include a neutral question like \"how do you rate dynamic que?\"\n\nbut something like \"i like that i can play games with my friends\" - \"yes\" \"no\"","replies":[{"poster":"Vistha Kai","date":"2016-04-12T13:49:45.430+0000","up_votes":5,"down_votes":1,"body":"The other question was, \"_Do you consider Dynamic Queue a good addition to the game? Y/N_\".\n\nMy opinion? It wouldn't be bad as an actual \"**addition**\".","replies":[{"poster":"Chocolate Frog","date":"2016-04-12T15:26:25.683+0000","up_votes":16,"down_votes":0,"body":"**\"Addition to the game\"** is different than **\"replacement for a core system.\"**\n\nSo that's a leading question as well.","replies":[{"poster":"Vistha Kai","date":"2016-04-12T17:41:26.713+0000","up_votes":2,"down_votes":0,"body":"That was exactly my point in mentioning it here.","replies":[{"poster":"Chocolate Frog","date":"2016-04-12T20:52:09.218+0000","up_votes":2,"down_votes":0,"body":"Oh, my bad, it didn't come off that way before you edited your comment.\n\nGlad we agree though.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"Jungle Brungus","date":"2016-04-12T15:26:51.453+0000","up_votes":5,"down_votes":0,"body":"Which it is, as long as we can have SQ as well. \nThat to me is the whole problem, just give us both! The playerbase will decide which one flourishes but at the end of the day we'd still have the option to play with friends in parties against friends in parties, or as a solo vs solos.\nAnd I still believe some of the little support for DQ there is comes from people confusing it with new champ select.","replies":[]}]},{"poster":"Jorencice","date":"2016-04-12T16:34:06.817+0000","up_votes":5,"down_votes":8,"body":"Does it really matter? \n\nEven if lyte could 100% PROVE that 99.99% of player's prefer dynamic que.\n\nMost of the people bitching would still be bitching.","replies":[{"poster":"Critmaster Garen","date":"2016-04-12T20:18:42.026+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Jorencice,realm=NA,application-id=3ErqAdtq,discussion-id=X4fi3ZOG,comment-id=000200000001,timestamp=2016-04-12T16:34:06.817+0000)\n>\n> Does it really matter? \n> \n> Even if lyte could 100% PROVE that 99.99% of player's prefer dynamic que.\n> \n> Most of the people bitching would still be bitching.\n\nyes, it matters lol. theyre using manipulative strategies because they know dynamic que didnt go over well with the actual player base.","replies":[{"poster":"Jorencice","date":"2016-04-13T10:40:32.342+0000","up_votes":2,"down_votes":1,"body":"And where did you get that info? \n\nThat is somehow more complete than riots?\n\nI like dydnamic que and I'm a pure solo players think I've played like 5 games total with freinds this season.\n\nThe forumns have NEVER been the entire leauge community not even close.\n\nHell even if the ENTIRE FORUMNS agreed (which they don't it looks to be a 80/20 split). That's still only represenititce of MAYBE 10% of the playerbase.\n\nAlot of people don't use forumns.\n\nAlot of people also like dynamic que or just don't care either way thus have no need to go to the forumns to talk about it.\n\n It's a proven scientific fact that people are 10x more likely to bitch about things they hate rather than promote things they like.\n\nI'm sorry sir but I honestly think it's just the vocal minority complaining.\n\nAnd no not ONLY COMPETITIVE people are whales so they won't suddenly lose shit tons of revenue either so that argument is moot as well.","replies":[{"poster":"Critmaster Garen","date":"2016-04-13T11:00:59.128+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jorencice,realm=NA,application-id=3ErqAdtq,discussion-id=X4fi3ZOG,comment-id=00020000000100020000,timestamp=2016-04-13T10:40:32.342+0000)\n>\n> Alot of people don't use forumns.\n\ndoesnt matter. the forums make up a larger sample group than what lyte used in his surveys (1000 people)\n\nif dynamic que was widely preferred over solo que, then the threads conserning it wouldnt get massive upvotes like they do.\n\nsecond argument is, that the only reason solo que was scrapped, is because almost all solo player would move over to solo que, and dynamic que would quickly die due to long que times. but at the same time this means that a larger amount of players who play this game actually prefer playing solo que most of the time.\n\nif you want dynamic que, fine. no one is gonna take that away from you. but we still want solo que to go along with it.","replies":[{"poster":"Jorencice","date":"2016-04-13T11:50:39.293+0000","up_votes":1,"down_votes":2,"body":"Lol if dynamic que was a thing solo q would also die due to long que times.\n\nMy freind already has 30 minute que times.\n\nCan't imagine what it would look like with less people.","replies":[{"poster":"Critmaster Garen","date":"2016-04-13T12:36:53.765+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jorencice,realm=NA,application-id=3ErqAdtq,discussion-id=X4fi3ZOG,comment-id=0002000000010002000000000000,timestamp=2016-04-13T11:50:39.293+0000)\n>\n> Lol if dynamic que was a thing solo q would also die due to long que times.\n> \n> My freind already has 30 minute que times.\n> \n> Can't imagine what it would look like with less people.\n\nbullshit. before dynamic que we had solo que and ranked teams. the amount of solo players will be a hell of a lot more than teams simply due to how much faster it is to que up on your own, than to get  group of people together.","replies":[{"poster":"Jorencice","date":"2016-04-13T14:03:41.886+0000","up_votes":1,"down_votes":0,"body":"Oh so your talking about completely removing dynamic que? Because 100% of solo players WILL NOT go to solo q. Thus causing que times to be longer than before dynamic que came out.\n\nI for one won't I quite enjoy dynamic que. So even if solo q comes out I wouldn't transfer over.","replies":[{"poster":"Critmaster Garen","date":"2016-04-13T14:15:18.750+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jorencice,realm=NA,application-id=3ErqAdtq,discussion-id=X4fi3ZOG,comment-id=000200000001000200000000000000000000,timestamp=2016-04-13T14:03:41.886+0000)\n>\n> Oh so your talking about completely removing dynamic que? \n\nno, it doesnt need to be removed. but almost all solo players would end up switching over to solo que. if not immediately, then over time.\n\nno one wants to play against premades as a solo player. its a shitty experience.","replies":[]}]}]}]}]},{"poster":"Flawless Fetus","date":"2016-04-13T15:39:51.110+0000","up_votes":1,"down_votes":0,"body":"> I like dydnamic que and I'm a pure solo players think I've played like 5 games total with freinds this season.\n\nI'm not trying to be an ass - I'm genuinely curious.  Why do you like dynamic queue?  I'm mainly a solo player as well, and am curious as to why we have such different opinions.  I'm not on the \"fuck dynamic queue, we need solo queue\" bandwagon, but I'm definitely not a fan of DQ.","replies":[{"poster":"Jorencice","date":"2016-04-13T17:53:46.633+0000","up_votes":1,"down_votes":0,"body":"Because it just doesn't affect me. \n\nI'm I'm a fill main so 4 ques don't bother me. I've also only had 1 or 2 bad 4 ques in the 5 years I've been playing because I'm not an asshole and fairly good at reading thr flow of games so even if I'm not in voice chat with them it isn't a problem.\n\nAnd I only play for my self so if every single person gets high diamond through abusing group que and I'm the only gold left I could care less. \n\nBecause I've done the best I could and other people's ranks are simply fluff to my life.","replies":[{"poster":"Flawless Fetus","date":"2016-04-13T20:02:12.651+0000","up_votes":1,"down_votes":0,"body":"What does being a fill main have to do with dynamic queue, though?  All that's related to is the new champ select, I'm a fan of that as well.  I don't typically have bad queues either, but if I were to \"only get gold\", while the silvers who are worse than me get diamond I'd feel a bit ripped off.  I suppose we just differ there.","replies":[]}]}]}]}]}]}]},{"poster":"Secretlolz","date":"2016-04-13T00:45:38.700+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Wulf Helhammer","date":"2016-04-13T01:16:31.430+0000","up_votes":2,"down_votes":0,"body":"Wow, really helps sell your pint when the first thing you do is insult me.\n\nAnd maybe to you the biggest topic is DQ, but it isn't to everyone. And besides that: the point has been made. Multiple times, to such an extent that no actual discussion takes places in those threads, just mindless yelling and complaining. As such, when a spam thread pops up, the mods do their job and remove it.","replies":[]}]}]},{"poster":"Oerba No Naja","date":"2016-04-12T15:30:56.224+0000","up_votes":12,"down_votes":1,"body":"Socrates and lyte were bored to see their faillur thrown at their face** every day with thousands of upvotes** .","replies":[{"poster":"Lauchmelder","date":"2016-04-12T19:19:39.455+0000","up_votes":2,"down_votes":7,"body":"Actually every sane person would delete spam threads. Keep it civilized and in 1 thread and nobody will care, but if the whole first page is filled with threads about the same goddamn thing it's OBVIOUS that they will delete some of them.","replies":[{"poster":"General Esdeath ","date":"2016-04-12T19:49:59.165+0000","up_votes":3,"down_votes":1,"body":"That's like saying we only need 1 person protesting something like a war, saying x amount of people are against it, and the government will know the exact number.","replies":[{"poster":"Lauchmelder","date":"2016-04-13T06:37:38.378+0000","up_votes":1,"down_votes":2,"body":"Your logic is flawed there. Will the government talk about certain issues if they get a request from their citizens if everybody just shouts their concerns or will they do something when the people sign a petition?\n\nThe first one is how you don't do it, the second one (signing petitions) is how you actually are able to change things. (But to be fair I don't expect Spammers to know this)","replies":[{"poster":"General Esdeath ","date":"2016-04-13T13:54:03.357+0000","up_votes":2,"down_votes":1,"body":"We don't have petitions, we have threads, that they ignore. And most governments have a law that if a petition reaches X signatures they have to talk about it, Riot doesn't have something like that.","replies":[{"poster":"Lauchmelder","date":"2016-04-13T14:09:15.848+0000","up_votes":1,"down_votes":2,"body":"Ok, you obviously have no idea how to properly read other arguments due to your blind hate for something. I'm gonna try to explain it very slowly now, so you may understand it now:\n\n**Government case:**\nEvery day there are 10-15 People shouting their opinion in front of the gov office. Nothing will happen\nPeople sign a Petition. Something will happen (because they have to talk about it if it reaches a certain number of signatures)\n\n**Riots case:**\nEvery day there are 50-100 threads about SoloQ. Nothing will happen.\nPeople make ONE mega thread and vote, vote, vote. Riot will see that there might be a Problem because there is a **collective** thread.\n\nDo they have to acknowledge this? No. Will they do it? If enough People vote for it, they will.\nAnd now think before commenting again.","replies":[{"poster":"General Esdeath ","date":"2016-04-13T14:44:48.154+0000","up_votes":2,"down_votes":1,"body":"I read your argument, but you're wrong. And we've voted on their megathread about dynamic queue. It has so many downvotes (It was at -536 last time I looked at it) so where's Riot's response? They're not obliged to make one, same way we're not obliged to keep it all in one thread. :^)\n\n\nThe thread:\n\nhttp://boards.na.leagueoflegends.com/en/c/riot-official/6WuZKauE-new-champ-select-update","replies":[{"poster":"mogonk","date":"2016-04-13T14:55:55.338+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AngusBoomPants,realm=NA,application-id=3ErqAdtq,discussion-id=X4fi3ZOG,comment-id=000a000000010000000000000000,timestamp=2016-04-13T14:44:48.154+0000)\n>\n> I read your argument, but you're wrong. And we've voted on their megathread about dynamic queue. It has so many downvotes (It was at -536 last time I looked at it) so where's Riot's response? They're not obliged to make one, same way we're not obliged to keep it all in one thread. :^)\n> \n> \n> The thread:\n> \n> http://boards.na.leagueoflegends.com/en/c/riot-official/6WuZKauE-new-champ-select-update\n\nYeah, there's not going to be an official response on this. Would defeat the purpose of pretending they were going to make a Solo Queue in the first place.","replies":[]}]}]}]},{"poster":"Nyhver","date":"2016-04-13T14:11:27.713+0000","up_votes":2,"down_votes":0,"body":"Reddit censoring the topic is ridiculous\n\n> [{quoted}](name=AvantelWings,realm=NA,application-id=3ErqAdtq,discussion-id=X4fi3ZOG,comment-id=0002000100000000000000000000,timestamp=2016-04-13T07:14:35.922+0000)\n>\n> Because the conception that solos play against premades is quite wrong, as that situation rarely if ever happens (again, except in very high elos *where it is already being fixed*)\n> \n> And the whole \"premade gangs up on you\" is not a problem related to DQ, but rather to toxicity as a whole, and I don't think you can stand there and tell me that 4 people all ganging up on one person didn't happen when people were only queued up as solo players.\n> \n> I have played games where I click with complete strangers better then my own friends that I play with ~90% of the time, and we completely stomp the other team\n\nWhere are your numbers or proof of 'rarely if ever happens'?\n\nPrimarily people seem frustrated with solo queue because you are put into the same match making that quasi teams or even whole teams are. Now you don't have to deal with two people on voice communications together, now you have to potentially deal with three or more. You can do the same, but that's different from solo queue. Is that inherently a bad thing? It is when we're talking about the majority of the player base being solo queue players.\n\nThe chances of you being carried in solo queue were not common which most people can probably agree with, too many variables, so your own skill mattered more in the sense that you had to be notably good or just play it right to win games and climb at a fast rate- the less good you were, the more bad luck you had, the more games you had to play.\n\nThere's less variable about teams, though, and while that's a good thing in terms of consistency and not having raging tilt feeder fire open middle, it sets a bad precedent for the integrity of rank when solo queue and team queue are put in the same queue and MMR. That's because you can legitimately get carried by a team or a few players, over and over because they're on your team, repeatedly. \n\nDynamic queue makes boosting people to higher rating easier, not that it wasn't a thing in the past, it was, but dynamic queue makes it easier.\n\nInherently, playing to win in communicated team play is different than playing solo queue, what works in solo queue might not work as well in team 5's, and what might work well in team 5's might not work well in solo queue. This just isn't the same game or environment that a lot of people are accustomed to, and people had options, if you wanted to play team 5's and had friends, go play team 5's, you could even have a widely varied MMRs while doing so.\n\nI don't hate dynamic queue, it just seems inherently imbalanced. When a professional team or semi-professional team can queue as 5's and start stomping over solo or less-grouped players and have it count towards the same MMR, there's something wrong.\n\nI like the 'select your role' that came with dynamic queue, which I suggest they keep along with reverting it back to solo queue, but that's not something that is exclusive to dynamic queue.\n\n> [{quoted}](name=MadKnife IV,realm=EUW,application-id=3ErqAdtq,discussion-id=X4fi3ZOG,comment-id=000a000000010000,timestamp=2016-04-13T06:37:38.378+0000)\n>\n> Your logic is flawed there. Will the government talk about certain issues if they get a request from their citizens if everybody just shouts their concerns or will they do something when the people sign a petition?\n> \n> The first one is how you don't do it, the second one (signing petitions) is how you actually are able to change things. (But to be fair I don't expect Spammers to know this)\n\nThere's many ways to get certain issues addressed or passed- one such way is related to 'shouting', rioting. Not that I suggest people start raiding Riot HQ.\n\nSomeone else mentioned there's no petition to sign on these forums, there isn't. What's wrong with being vocal about your opinions to a company or as a customer? Nothing. Doing so in a harassing, aggressive or obtuse manner is something else.","replies":[]}]}]}]}]},{"poster":"YondorDaChrusher","date":"2016-04-12T07:58:45.651+0000","up_votes":11,"down_votes":1,"body":"I'm having an issue justifying this one to MMR. I was just in a game in which 3 of 5 opponents where silver and my entire team was bronze. Here below is a screenshot of the games results. I researched all team member names on http://na.op.gg.\n\nGame Link: http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2155427206/34373539?tab=overview\n\nHere are the profiles for the opposing team.\nhttp://na.op.gg/summoner/userName=mere Silver 5\nhttp://na.op.gg/summoner/userName=IIemnuelII Bronze 2\nhttp://na.op.gg/summoner/userName=liberty+dogs Silver 5\nhttp://na.op.gg/summoner/userName=enjoyingg Bronze 1\nhttp://na.op.gg/summoner/champions/userName=armadillojackal Silver 5\n\nNow, the profiles for my team\nhttp://na.op.gg/summoner/userName=seniorcheesycake Bronze 2\nhttp://na.op.gg/summoner/champions/userName=zerofatburger Bronze 2\nhttp://na.op.gg/summoner/userName=medoc Bronze 1\nhttp://na.op.gg/summoner/userName=selbbup Bronze 2\nhttp://na.op.gg/summoner/userName=selbbup Bronze 1\n\nHere is another\nGame Link: http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2151968646/34373539?tab=overview\n\nhttp://na.op.gg/summoner/userName=+BarrenCity SILVER 1 (6 Divisions higher than the lowest summoner on my team)\nhttp://na.op.gg/summoner/userName=+CLG+Arkese Unranked\nhttp://na.op.gg/summoner/userName=+Discount+Xpeke69 Bonze 4\nhttp://na.op.gg/summoner/userName=+McDustyy Unranked\nhttp://na.op.gg/summoner/userName=+BrokenTown Bronze 2\n\nhttp://na.op.gg/summoner/userName=Kinato+Keaton Bronze 2\nhttp://na.op.gg/summoner/userName=VindictiveIntent Unranked\nhttp://na.op.gg/summoner/userName=Someguyrb Silver 5\nhttp://na.op.gg/summoner/userName=Sohcahtoa82 Bronze 2\n\nCan someone please explain to me how the matchmaker would justify these game ever being made?","replies":[{"poster":"A Miss Fortune","date":"2016-04-12T08:53:28.758+0000","up_votes":3,"down_votes":15,"body":"Bronze 5 - Silver 5 really isn't much of a difference at all. The matching system was still garbage last season, I was Silver 1 but almost all of my teams were Gold 5 - Plat 5 in both Normals and Ranked.","replies":[{"poster":"EddardStark84","date":"2016-04-12T13:07:20.581+0000","up_votes":10,"down_votes":2,"body":"> [{quoted}](name=A Miss Fortune,realm=NA,application-id=3ErqAdtq,discussion-id=X4fi3ZOG,comment-id=00030000,timestamp=2016-04-12T08:53:28.758+0000)\n>\n> Bronze 5 - Silver 5 really isn't much of a difference at all. The matching system was still garbage last season, I was Silver 1 but almost all of my teams were Gold 5 - Plat 5 in both Normals and Ranked.\n\nWait what?? Silver 1 is light years ahead of bronze 5..","replies":[{"poster":"General Esdeath ","date":"2016-04-12T15:49:44.259+0000","up_votes":4,"down_votes":1,"body":"No, let him believe the circlejerk that bronze and silver are the same.","replies":[{"poster":"A Miss Fortune","date":"2016-04-12T19:17:35.655+0000","up_votes":2,"down_votes":4,"body":"Generally the differences are minimum between a Bronze 5 - Silver 5 player.","replies":[{"poster":"General Esdeath ","date":"2016-04-12T19:48:39.910+0000","up_votes":3,"down_votes":0,"body":"Then why isn't everyone silver 5? Why is there a bronze at all? I've played in Bronze and silver, let me tell you right now there's a huge difference in them.","replies":[]}]}]}]}]},{"poster":"Starcraft243ver","date":"2016-04-12T08:58:33.918+0000","up_votes":3,"down_votes":2,"body":"Because bronze I with a winrate > 50% equals silver 5 with winrate <=50%, one of the B1 you had in your team has over 60% winrate, he is definitely worth more than b1.\nOne or 2 divisions difference has nothing to do with bad matchmaking, a bronze 1 50 LP is only 5 wins away from silver 5, do you really think his skill level is going to change and makes the match unbalanced if he gets these 5 wins ?\n\nWhen master and plat are matched together, ok, there is a problem. but bronze 2 vs silver 5 ? LOL, sorry but no, your argument is invalid.\n\n(And for the second one, there was a 3 man premade and a lot of unranked, so you can't evaluate their level.)","replies":[]}]},{"poster":"Sogreth","date":"2016-04-12T16:28:10.185+0000","up_votes":1,"down_votes":3,"body":"I like Dynamic Queue, honestly. I pick my role. I get my role.\n\nThe thing I *don't* like are the 3,4 and 5 man premades in ranked.","replies":[]}]}