{"poster":"Calyad","date":"2017-08-25T00:00:46.865+0000","title":"How can I get a champion removed from my \"Owned Champions\"?","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"The TL;DR is the title.  Here's some details!\r\n\r\nI got an \"Honor Capsule\" from playing a bunch with some cool people. Yay!\r\nIt contained:\r\n\r\n* 2 key fragments\r\n* 1 champion that I am lousy with\r\n* 1 skin for that champion\r\n\r\n\r\nNow this may sound great, but not so much to me.  I only play LoL with my friends, and I am really not very good with all the champions.  This wouldn't be a problem except that my friends love ARAM, and we play it more than anything else.\r\n\r\nSo now, I have a champion I specifically am lousy with mixed in with the champions I was pretty careful about buying (so that I only owned champions I was halfway good at using).  \r\n\r\nIf I had known that I would simply permanently unlock a champion (rather than having to go through the crafting system, which all items up til now made me do), I would simply never opened it, ever. \r\n\r\nIn the Account settings, it says that the champion is \"Not Refundable.\"  That's fine, but I would like him to simply be deleted.\r\n\r\nHow do I make that happen?","replies":[{"poster":"dArtagnan","date":"2017-08-25T00:38:48.948+0000","up_votes":4,"down_votes":1,"body":"I definitely get where you are coming from.  Sometimes you just wanna to shun certain champions.\n\nWe should be able to help out with that though!  I found the champion in question, and I've gone ahead and deleted it from your account (along with the skin).  This is a one-time kinda deal, so you won't be able to request it again.\n\nHopefully this keeps the fun you have in ARAM's going!  Let me know if you have any other questions!","replies":[{"poster":"EROTIC RAID BOSS","date":"2017-08-25T01:30:37.679+0000","up_votes":2,"down_votes":0,"body":"don't enable aram abusers :S","replies":[]},{"poster":"Calyad","date":"2017-09-01T17:35:06.574+0000","up_votes":1,"down_votes":0,"body":"Thank you so much!! Seriously.","replies":[]},{"poster":"MagicAtLast","date":"2017-08-25T10:58:21.444+0000","up_votes":1,"down_votes":0,"body":"I wish I could delete Urgot from my account too. I made a grave mistake when i decided to re-roll champ shards and got him. never re-rolling again, EVER. I got the ONE EFFING CHAMP i never wanted to get, and now cant get rid of him T_T {{item:3070}} {{item:3070}}","replies":[]}]},{"poster":"Mansana","date":"2017-08-25T02:04:24.907+0000","up_votes":1,"down_votes":0,"body":"What was the champion and skin? For science of course...","replies":[{"poster":"NotAOG","date":"2017-08-25T06:54:32.859+0000","up_votes":1,"down_votes":0,"body":"Wait so... does he get a refund? LUL","replies":[{"poster":"Mansana","date":"2017-08-26T03:58:36.045+0000","up_votes":1,"down_votes":0,"body":"No. I've been on boards for awhile. I remember there used to be a guy who made an oath  to never buy Teemo. He ended up making a post and ticket about how he got it from a mystery gift from a friend or loot... he eventually got it removed thanks to a Rioter. \n\nI wouldn't say it'say it's refund because it was a gift from riot for honor.And it's a simple request that he doesn't want it. Same thing for the Teemo guy I believe.","replies":[]}]}]}]}