{"poster":"DimensionDragon","date":"2015-05-22T15:35:45.902+0000","title":"[AFK - Momente] Ersatzspieler.","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Ich h&auml;tte einen Vorschlag bez&uuml;glich des AFK-Problems in Spielen.\r\n\r\nWie w&auml;re es, wenn ein Freund des Teams oder sogar ein neuer Random-Spieler die M&ouml;glichkeit h&auml;tte den Champion des AFK Spielers zu &uuml;bernehmen?  Nat&uuml;rlich nur unter bestimmten Regeln.\r\n\r\nZum Beispiel: \r\n\r\nDer AFK-Spieler kann im Game die Erlaubnis erteilen, sollte er die Verbindung verlieren oder selbstst&auml;ndig AFK gehen. Damit ein Freund / Random / Ersatzspieler eintreten kann.\r\n(eine weitere M&ouml;glichkeuit die mir aber selber nicht gef&auml;llt: ) Hat ein Spieler das Spiel verlassen und eine bestimmte Zeit &uuml;berschritten , kann ein anderer Spieler joinen.\r\nEin Spieler sollte die M&ouml;glichkeit haben aus dem Zuschauer-Modus beitreten zu k&ouml;nnen.","replies":[{"poster":"xJustplay","date":"2015-05-26T07:21:20.899+0000","up_votes":1,"down_votes":0,"body":"Wäre ne tolle Idee, da man doch in sehr vielen Spielen gerade in rankeds afk teammates hat und dies auf den spielverlauf erheblichen Einfluss nimmt!","replies":[{"poster":"Rkoturdo Ndo","date":"2015-05-26T08:10:39.467+0000","up_votes":2,"down_votes":1,"body":"Heya\nAlso mathematisch betrachtet sind Leaver in Rankeds zu deinem Vorteil....wenn du es nicht provozierst oder selbst der Leaver bist.\n\nMfG Rkoturdo","replies":[]}]},{"poster":"Nuix","date":"2015-05-27T12:04:25.806+0000","up_votes":1,"down_votes":0,"body":"Das macht nur dann Sinn, wenn der \"Ersatzspieler\" vor betreten des Spiels sehen kann, wie es steht. Also beteiligte Champions, lvl, Gold, Gegenstände seines Champions, eroberte Drachen und Barons, zerstörte Türme etc. Dann wäre dies durchaus möglich aber immer noch wenig sinnvoll. Denn seien wir mal ehrlich, wer verlässt ein gewonnenes Spiel? Und wer möchte einen ADC spielen, der 3 Level hinterher hängt, weder farm noch items hat und gegen eine15/2/12 Le Blanc spielen muss?","replies":[{"poster":"DimensionDragon","date":"2015-05-27T14:47:14.876+0000","up_votes":1,"down_votes":0,"body":"Das der Beitretende Ersatzspieler Informationen bekommt, sollte eigentlich klar sein (evtl. mit 2 minuten verspätung...)\n\nSchonmal diesen Satz gehört? \" Sry have to eat\" ?\nund manchmal möchte man einfach seinen Freund aushelfen. Ob er afk ist oder ein anderer.","replies":[]}]},{"poster":"Shiggyvara","date":"2015-05-26T07:49:58.104+0000","up_votes":1,"down_votes":0,"body":"Warum sollte jemand einem Spiel beitreten wollen, dass vermutlich verloren wird?","replies":[{"poster":"DimensionDragon","date":"2015-05-26T08:39:05.260+0000","up_votes":1,"down_votes":0,"body":"Konterfrage: Warum sollten denn dann alle anderen 4 Spielern die am verlieren sind weiterspielen?","replies":[{"poster":"Shiggyvara","date":"2015-05-26T16:38:08.069+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DimensionDragon,realm=EUW,application-id=YnZkMR0R,discussion-id=H8JAwbB2,comment-id=00020000,timestamp=2015-05-26T08:39:05.260+0000)\n>\n> Konterfrage: Warum sollten denn dann alle anderen 4 Spielern die am verlieren sind weiterspielen?\n\nSie wussten am Anfang nicht, dass einer leaven würde. \nIn sofern ist die Frage meiner Meinung nach kein richtiger Konter.\n\nWas ich mit meiner Frage eher ausdrücken wollte ist folgendes:\nWas führt denn meist zum afk sein?\n1. tatsächliche technische Probleme \n-> kommt vor und ist nicht zwangsläufig spielentscheidend. Hier wäre ein Randomspieler sogar theoretisch möglich, wobei die Gefahr besteht, dass er sich nicht mit dem Champ/der Position auskennt.\n2. Frustafk auf Grund starker Übermacht der Gegner\n-> Ich glaub einfach nicht, dass sich so viele (random) Spieler finden, die es interessant find in Minute 30 in ein Spiel einzutreten, in dem es 30:5 für das gegnerische Team steht, wobei sie vielleicht einen Champion bekommen, den sie nicht können mit Runen, die sie als suboptimal empfinden etc...\n3. Frustafk auf Grund von Flame im Team\n-> Jep macht bestimmt Spaß in das erwähnte 30:5 Spiel einzutreten und das erste, was man im CHat liest ist ein: \"Man that stupid player from Champ was sooo dumb i hope u are not such a noob as him\".\n\nUnd dann kommt natürlich noch dazu, was macht man, wenn der Spieler tatsächlich nur einen kurzen Verbindungsabbruch hatte er aber weswegen auch immer neustarten muss, die 5 Minuten vergehen er wird als afk markiert und als er dann versucht zu reconnecten bekommt er ein \"Sorry jemand anderes spielt gerade in deinem Spiel\".\nOk den Punkt hast du habwegs abgedeckt, indem du sagst, dass der Spieler im Spiel selber erlauben muss,dass diese Maßnahme getroffen wird.","replies":[]},{"poster":"HyperionCH","date":"2015-05-26T09:39:50.419+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DimensionDragon,realm=EUW,application-id=YnZkMR0R,discussion-id=H8JAwbB2,comment-id=00020000,timestamp=2015-05-26T08:39:05.260+0000)\n>\n> Konterfrage: Warum sollten denn dann alle anderen 4 Spielern die am verlieren sind weiterspielen?\n\nWeil man immer noch gewinnen kann.\nIch hatte (wobei nur Normal) gerade letzte Woche ein Game, wo der Midlaner nach 20 Min. dc war. Wir spielten 30 Minuten lang also in Unterzahl und haben trotzdem gewonnen (Toplane war btw. die einzige Lane, welche dominierte). So etwas kommt sogar noch öfters vor bei mir und ich glaube nicht, dass meine MMR derzeit zu tief ist (was ein Grund sein könnte, dass man öfters 4vs5 gewinnt).\n\nKlappt also auch so; gerade wenn der eine oder andere Champ im late stark war (z.B. unsere Vayne, die dann viel DMG austeilte, obwohl sie die Lane nicht gewonnen hat).\n\n\nAber noch zum Vorschlag:\nIch frage mich wirklich, warum jemand dann Ersatz spielen soll. Denn da gibt es einige Probleme/Situationen, die es nicht wirklich als sinnvoll erscheint:\n\n- Technische Probleme des Mate:\nDa kann er ja gar keinen Vorschlag machen, wer für ihn Ersatz spielen soll.\n\n- Ragequit aufgrund Flamer im Team:\nDer Ragequiter wird hier wohl eh keinen Freund als Ersatz vorschlagen. Aber bei einem automatisierten System (es wird Random jemand zugeteilt) würde ich mich nicht als Ersatz bereitstellen, weil ich befürchte, in einem Flamer-Team zu landen.\n\n- Afk, weil das Game verloren ist (zu grosser Rückstand):\nAuch hier wird der afkler kaum einen Freund als Ersatz vorschlagen. Auch mit Random-Mate-System wird sich kaum jemand als Ersatz zur Verfügung stellen. Es ist zwar eine gewisse Herausforderung, aber es ist auch demotivierend, einfach verlorene Games für andere zu Ende zu spielen.\n\n- Champ ist vorgegeben\nViele Champs kann ich gar nicht gut spielen (z.B. viele Toplane-Champs, da ich dies selten spiele). Klar, als \"freiwilliger Ersatzmann\" (auch bei Random-Mate-System) muss ich nicht annehmen, wenn ich den Champ nicht kann. Aber dies verlängert die Warteschlange nur, bis sich ein geeigneter Ersatz findet.\n\n- MMR muss stimmen.\nDer Ersatz muss die gleiche MMR besitzen wie der afkler. Sonst ist Missbrauch möglich. Kleines Beispiel: Ich gehe DuoQ mit einem Spieler meiner Elo (ich war letzte Season Gold 4). Mein Spieler geht dann afk und einer unserer Freunde übernimmt seinen Platz. Zuuuuufälligerweise ist dieser Dia-Spieler (ich habe 2 Dia-Spieler, mit denen ich gelegentlich Normals spiele; zudem einige gute Platinspieler und smurfs haben diese Spieler zum Teil auch). Das Game ist dann natürlich gewonnen. ;)\nDeshalb ist schon der Vorschlag, dass man einen eigenen Freund als Ersatz einsetzen kann, schon völlig sinnfrei. Bei \"Random-Mate-System\" würde natürlich das System die MMR beachten und nur diese Spieler werden als Ersatz vorgeschlagen. Doch wenn die Zahl der verfügbaren Ersatzmänner gering ist (und diese teilweise ablehnen, weil sie den Champ nicht können), dann ist die Warteschlange entsprechend lange und es kommt dann doch kein Ersatz.\n\nKurz gesagt:\nin der Praxis nicht umsetzbar.","replies":[{"poster":"DimensionDragon","date":"2015-05-26T13:39:03.692+0000","up_votes":1,"down_votes":0,"body":"Ich versuche mal bei deinen Punkte einige Ideen und/oder Argumente entgegenzubringen :)\n\n* \"Technische Probleme des Mate\"\nMan Könnte VOR dem spiel dem Client erlauben einen Random/Freund usw. das einspringen zu erlauben. Die eigenen Teammates könnten die Möglichkeit haben das rejoinen eines Fremden zu blockieren.\n\n*  \"Ragequit aufgrund Flamer im Team\"\nMan sollte natürlich erst die Möglichkeit haben das Spiel einzusehen, Daten (evtl. vllt. sogar den Chat?)\n\n*  \"Afk, weil das Game verloren ist (zu großer Rückstand)\"\nErstmal das gleiche wie bei dem Punkt oben, dazu könnte man den Spieler mit extra IP belohnen je mehr das Team im Nachteil ist.\n\n*  \"Champ ist vorgegeben\"\nMusst nicht unbedingt denen helfen wenn du diesen Champ nicht magst. Schließlich soll es ja deine Entscheidung sein.\n\n*  \"MMR muss stimmen\"\nIch persönlich finde dieses Punktesystem extremst rau, wenn ich ehrlich bin, aber hier kann und will ich nicht diksutieren :P","replies":[{"poster":"HyperionCH","date":"2015-05-26T14:13:30.681+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DimensionDragon,realm=EUW,application-id=YnZkMR0R,discussion-id=H8JAwbB2,comment-id=0002000000000000,timestamp=2015-05-26T13:39:03.692+0000)\n>\n> Ich versuche mal bei deinen Punkte einige Ideen und/oder Argumente entgegenzubringen :)\n> \n> * \"Technische Probleme des Mate\"\n> Man Könnte VOR dem spiel dem Client erlauben einen Random/Freund usw. das einspringen zu erlauben. Die eigenen Teammates könnten die Möglichkeit haben das rejoinen eines Fremden zu blockieren.\n\nDie Missbrauchsmöglichkeit besteht natürlich immer noch. ;)\nDa spielt einfach ein Dia-Spieler (bzw. ein smurf) und wenn das Game mehr oder weniger gewonnen ist, verlässt er das Game und sein Kollege geht rein. Die Teammates nehmen natürlich an, da sie keinen sicher geglaubten Sieg (besonders weil der stärkste Spieler nun afk ist) vergeben wollen.\nSo kann man natürlich ganz leicht Elo-Boosting betreiben. ;)\n\nZudem: wer bitte wartet schon ein ganzes Ranked ab, damit man bei einem möglichen technischen Problem als Ersatz spiele?\nWas passiert denn, wenn der angegeben Ersatzmann nun selber ein Game gestartet hat? Vorzeitige Angabe des Ersatzspielers ist aus meiner Sicht alleine deswegen nicht praktikabel.\n \n> *  \"Ragequit aufgrund Flamer im Team\"\n> Man sollte natürlich erst die Möglichkeit haben das Spiel einzusehen, Daten (evtl. vllt. sogar den Chat?)\n\nOK, aber dann bleibt man natürlich immer noch in Unterzahl. Denn wer spielt schon gerne Ersatz in einem Flamer-Team?\n\n> *  \"Afk, weil das Game verloren ist (zu großer Rückstand)\"\n> Erstmal das gleiche wie bei dem Punkt oben, dazu könnte man den Spieler mit extra IP belohnen je mehr das Team im Nachteil ist.\n\nGenauso hier:\nKaum jemand würde spielen, wenn das Game bereits verloren ist.\n\nBei technischen Problemen ist es also nicht praktikabel (da keiner die ganze Zeit wartet und wohl selber ein Game startet) und bei absichtlichen afk gehen (wegen verlorenem Game oder wegen Flamer) will keiner Ersatz spielen.\n\nDie Extra-IP ist wohl keine allzu gute Lösung.\nWenn der Bonus zu gering ist, kommt niemand. Ist der Bonus zu gross, spielen die Leute nur noch als Ersatz. Wobei ich eher ersteres vermute. Langjährige Spieler haben oft genug IP (bzw. genug Runen, Champs, etc.). Da wird ein IP-Bonus nicht allzu viel bringen. Am meisten Interesse dürften da wohl Level-Bots etc. haben. Aber die möchte man nicht als Ersatz. ;)\n\nAm Ende wird man wohl nur dann Ersatz finden (mit Random Mates -> wie gesagt mit FL-Ersatzspielern nicht umsetzbar), wenn das Game eh schon gewonnen ist (und wenn das Game ein Ranked ist).\nDa werden sich einige Spieler sicherlich finden, denn langfristig müssten die dann Challenger werden (man nimmt ja nur die Games an, welche man mit hoher Sicherheit gewinnen kann -> winrate müsste über 50% sein).\n\n> *  \"Champ ist vorgegeben\"\n> Musst nicht unbedingt denen helfen wenn du diesen Champ nicht magst. Schließlich soll es ja deine Entscheidung sein.\n\nTja, und schon wieder kein Ersatzmann gefunden. ;)\nWas bringt ein solches System, wenn dann doch kein Ersatzmann ins Spiel kommt?\n\n> *  \"MMR muss stimmen\"\n> Ich persönlich finde dieses Punktesystem extremst rau, wenn ich ehrlich bin, aber hier kann und will ich nicht diksutieren :P\n\nAber genau hier ist das grosse Problem, wenn du sogar vorschlägst, dass Spieler aus der FL als Ersatz kommen können. Elo-Boosting wird Riot sicherlich nicht fördern und dein Vorschlag macht Tür und Tor auf für Elo-Boosting.","replies":[]}]}]}]}]},{"poster":"Yuci","date":"2015-05-22T16:00:06.733+0000","up_votes":1,"down_votes":0,"body":"Sehr Praktisch sowas. Wirklich geil, wenn Riot sowas einbauen würde ^^ {{champion:150}}","replies":[]}]}