{"poster":"KeepCalmIamKIRA","date":"2015-09-17T14:24:20.877+0000","title":"Riven heruntergesetzt? 16.09.2015","subforum":"Champions & Gameplay","up_votes":0,"down_votes":12,"body":"Also.....Omg zun&auml;chst mal!!! Riven ist momentan nicht spielbar....Ich kann Sie schon seit langer Zeit nicht zocken um genau zu sein, seit zwei Tagen( 16-17.09.2015) Ich zocke LOL nur wegen Riven! Wird Sie etwa heruntergesetzt?! Wenn das passiert deinstallier ich das Spiel direkt!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! \r\n\r\nBitte Antworten","replies":[{"poster":"Alustus","date":"2015-09-17T14:32:12.049+0000","up_votes":1,"down_votes":0,"body":"Es gibt einen Fehlerbehebung. Spätestens nächsten Patch wird sie wieder spielbar sein.\n\n\nWas meinst du mit heruntergesetzt?","replies":[{"poster":"Veezey","date":"2015-09-17T14:36:25.766+0000","up_votes":1,"down_votes":0,"body":"Ich glaube er denkt, dass sie generft wird.","replies":[{"poster":"Alustus","date":"2015-09-17T14:42:03.403+0000","up_votes":2,"down_votes":0,"body":"Wird sie hoffentlich demnächst, jetzt haben die patches keinen Einfluss mehr auf die Worlds, jetzt muss Riot auch nihct mehr schauen das sie dort gespielt werden kann.\n\nSelbiges gilt auch für die offtanks, welche meiner Meinung nur so stark geblieben sind das man sie evt. auch bei den Worlds auspackt, auch wenn man dort wahrscheinlich wenn Fiora, Morde oder GP sehen wird.\nDarius, Garen, Skarner sind im high elo Teamrank nicht sonderlich gut.","replies":[{"poster":"Veezey","date":"2015-09-17T16:06:19.496+0000","up_votes":1,"down_votes":0,"body":"Naja ich finde jetzt nicht, dass sie unbedingt einen Nerf braucht. Vielleicht die Skalierung auf dem Schild etwas senken, aber ansonsten finde ich sie gut so. \nIch hoffe man wird Fiora ein paar Mal sehen, würde mich zumindest echt freuen :D","replies":[]}]}]},{"poster":"Maexle","date":"2015-09-17T14:57:59.251+0000","up_votes":1,"down_votes":0,"body":"Vielleicht hat er ja Angst, dass sie aus dem Spiel genommen wird :D\n{{champion:17}}","replies":[]}]},{"poster":"Armaderschaden","date":"2015-09-17T16:39:01.765+0000","up_votes":1,"down_votes":0,"body":"Wieso heulen alle jetzt rum, ja Riven ist wegen eines Problems deaktiviert. Aber über Corki heult niemand, der ist auch deaktiviert.\nIch verlange Gleichberechtigung!!!","replies":[]},{"poster":"Tokogawaruf","date":"2015-09-17T15:12:23.111+0000","up_votes":1,"down_votes":0,"body":"Kritischer Treffer auf die Gefühle eines Riven Mains. \nGG Riot.\n\nOkay Spaß beiseite, warte n paar Tage, schau täglich, früher oder später ist sie wieder in. Außerdem wäre es gut auch andere Champs zu können und mögen.\n Bei mir hab ich grade 3 (bald 4 yey Kindred) Adcs, 2 Supps, 4 Top und 2 Jungler die ich oft und sehr gern spiele. \nIch rate dir das auch zu tun. Vorallem jetzt wo du musst.\n{{champion:119}} {{summoner:6}}","replies":[]},{"poster":"The Truth","date":"2015-09-17T14:50:28.877+0000","up_votes":1,"down_votes":0,"body":"sie wird nur gefixed, ihre Q hatte bugs bzw wenn man ne richtige kombo bringt, hat sie keine cd auf ihre Q und kann sie 4-5 mal einsetzen hintereinander.","replies":[]},{"poster":"TheUnknown98","date":"2015-09-17T14:33:22.540+0000","up_votes":1,"down_votes":0,"body":"42! \n\nUnd weißt du wieso? Weil diese zufällige Zahl mehr Sinn ergibt als dein Post ;)","replies":[]}]}