{"poster":"rujitra","date":"2020-01-11T14:32:53.017+0000","title":"Player admits to board smurfing","subforum":"Discuss the Boards","up_votes":17,"down_votes":15,"body":"https://boards.na.leagueoflegends.com/en/c/general-discussion/VFfFjcV7-to-aerowaffle-please-read-this-message-is-for-you\r\n\r\nWas pretty obvious when this account came out of nowhere and just randomly starts posting multiple threads per hour sometimes, and targeting a certain individual. Posting this here because, to be quite blunt, I don't have time to wait hours in the discord for a response when multiple moderators are active on the boards and/or on Discord, yet simply can't take a simple thread link and take an action that should take 5 seconds.\r\n\r\nI get that moderators are overworked - but the response time on the Discord which is advertised for \"urgent\" issues is too high. Riot should give you guys the tools to either make people want to work more, or more moderation \"budget\"/time so that you can have more moderators.","replies":[{"poster":"Wuks","date":"2020-01-11T18:16:25.068+0000","up_votes":2,"down_votes":1,"body":"Currently working on some improved tools. It has been a while since we had moderator recruitment, though, so that's not completely off the table either.","replies":[{"poster":"Crylium","date":"2020-02-05T05:58:53.707+0000","up_votes":8,"down_votes":3,"body":"Also, harassment on these boards is a big issue, If you could develop a feature that allows us to block certain people from veiwing and commenting on our posts that would be greatly appreciated.  I just had An issue with a player going to all of my post harassing me so I felt the need to delete all the post he was in just so he would stop harassing me, Reporting doesn't solve issue with toxic harassment, all moderators do is delete your comment, but that same person can still view and comment on our posts. So In the interest of getting him to stop harassing me I contact him and threatened to harass him on his posts if he didn't stop. He replied \"making online threats gets you no where\", this guy knows he can do and say what he wants and nothing will happen, And ofcaorse because I deleted all my posts he was on, the only thing that showed up was me harassing him after I told him Id harass him if he continued. He reported my attempt to confront him, I got contacted by moderators and the comments of me confronting my bully got deleted and Moderators threatened to punish me further if my actions continued, so not only does reporting not stop harassment, but when we confront our harassers, moderators see it as us threatening them, which it is a threat I don't deny that, but we get in trouble for protecting ourselves. We can report if we are feeling harassed all we want but if a moderator doesn't feel like the comment is harassing whether we the player feels harassed or not, nothing happens. All of these issues im having with trying to protect myself from harassment, are solved if you guys develop a feature that allows us to create a block list, and those on the block list cant view or comment on our posts. I bet with a system like that in place, most of all the issues of toxicity on this website go bye bye. This website is way more toxic then the actual game is, and you see the number of players complaining about the games toxicity...","replies":[{"poster":"AeroWaffle","date":"2020-02-05T06:33:17.530+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Crylium,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=00040000,timestamp=2020-02-05T05:58:53.707+0000)\n>\n> -snip-\n\nBecause I was curious about who you're talking about, jeez. If you have a problem with someone's behavior, report them. But don't follow them around and make irrelevant posts **to specifically harass them**.\n\nI count five posts that had nothing to do with the topic at hand, all replying to the same person. You later admitted to be stalking them because you had a vendetta. At this point, I trust their story that they only commented on two of your posts more than your story.","replies":[{"poster":"Crylium","date":"2020-02-05T06:41:25.282+0000","up_votes":2,"down_votes":1,"body":"Don' t actually care what you think actually happened. There is no vendetta period. when the moderator asked me to report him so he could look into punishing the guy I told him I didn't want him to get punished, only that we had this feature to block our harassers.\n\nhttps://i.imgur.com/sO1NHRAh.png","replies":[{"poster":"AeroWaffle","date":"2020-02-05T06:45:58.424+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Crylium,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=0004000000000000,timestamp=2020-02-05T06:41:25.282+0000)\n>\n> Don' t actually care what you think actually happened. There is no vendetta period. when the moderator asked me to report him so he could look into punishing the guy I told him I didn't want him to get punished, only that we had this feature to block our harassers.\n> \n> https://i.imgur.com/IflckmAh.png\n\nWhat else would you call, \"Yep, He harassed me so I'm making it my personal goal to harass him right back. \"?\n\n> [{quoted}](name=Crylium,realm=NA,application-id=GgNYATV4,discussion-id=ZEkVo3d2,comment-id=00030000,timestamp=2020-02-05T02:38:20.417+0000)\n>\n> Yep, He harassed me so I'm making it my personal goal to harass him right back. This reporting system is a joke, these moderators are a joke, I asked them for help and they shut the door in my face, So if my harassment case isn't going to be handled then I'll harass right back. That is the type of environment these moderators promote.\n> \n> Something as simple as letting us block people on league of legends boards, talked to this moderator on my post and asked him to get a team together and make it possible for players to block people who are harassing them he said \"No I don't think so\".\n\nOr;\n\n> [{quoted}](name=Crylium,realm=NA,application-id=yrc23zHg,discussion-id=ffL1rTpb,comment-id=0005000000000000000000010000,timestamp=2020-02-04T12:59:45.503+0000)\n>\n> Look its simple, I do not want you on my posts ,You can sort forums and newest all you want, the moment I see your name on my post, just know ill be lurking on every single comment you've posted in the last 5 days.\n\nThis is pretty clear cut case of targeted harassment. You've even admitted as such. And you've also admitted you're doing so because they've commented on your posts.\n\nThat's called a **vendetta**. If you don't want this person punished, don't be a hypocrite and harass them in some sort of vigilante justice. The moderator already recommended an addon that allows you to block people.","replies":[{"poster":"Crylium","date":"2020-02-05T06:48:50.904+0000","up_votes":2,"down_votes":1,"body":"Ya I threatened to harrass him \"AFTER\" he harassed me, no different from a bully bullying someone and then the person being bullied snapping and seriosuly hurting the person who was bullying him. Its just odd to me how you are flocking to the defense of someone who was harassing me. says a lot about your character.\n\nIf im shoving your head in the toilet everyday, and you tell your teachers about it and they do nothing, are you just going to take it? or you going to fight back? I decided to fight back, I asked moderators for help, they decided to look at my profile and his and said he did nothing wrong instead of believing me. I would post, and he was follow each and every post knowing I didn't want him on my posts. All im asking for from them is for them to create a system that allows us to block people, but instead of seeing my message for what it is you attack me. says a lot about your character.","replies":[{"poster":"AeroWaffle","date":"2020-02-05T06:51:09.256+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Crylium,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=000400000000000000000000,timestamp=2020-02-05T06:48:50.904+0000)\n>\n> Ya i threatened to harrass him \"AFTER\" he harassed me, no different from a bully bullying someone and then the person being bullied snapping and seriosuly hurting the person who was bullying him. Its just odd to me how you are flocking to the defense of someone who was harassing me. says a lot about your character.\n\nYou didn't just threaten to harass them. You harassed them. Not only that, but you stalked their posts with the explicit purpose to harass them.\n\nHarassing someone in retribution is still harassment. I'm not judging their actions here since I don't see where they harassed you, but your actions are clear as day and it's your actions that you are responsible for.","replies":[{"poster":"Crylium","date":"2020-02-05T06:58:04.367+0000","up_votes":2,"down_votes":2,"body":"I do not care, I'm the type where if you shoot at me, im shooting back. And im sure if someone shoots at you you are doing the same thing, shooting back, stop white knighting and look at what im asking for and tell me im wrong, tell me that being able to block people who are harassing you wouldn't solve this problem. because if you say other wise, I know you aren't here to be truthful, you are just here to feel like you are right about something, just like 80 percent of everyone on boards post, arguing just to be right about something regardless of logic.","replies":[{"poster":"AeroWaffle","date":"2020-02-05T07:04:04.297+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Crylium,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=00040000000000000000000000000000,timestamp=2020-02-05T06:58:04.367+0000)\n>\n> I do not care, I'm the type where if you shoot at me, im shooting back. And im sure if someone shoots at you you are doing the same thing, shooting back, stop white knighting and look at what im asking for and tell me im wrong, tell me that being able to block people who are harassing you wouldn't solve this problem.\n\nThe moderator on the discord already recommended an addon. BEK (boards enhancement kit).\n\n>I know you aren't here to be truthful, you are just here to feel like you are right about something, just like 80 percent of everyone on boards post, arguing just to be right about something regardless of logic.\n\nI'm giving my opinion because all I see now is a bully that's trying to play the victim. Trying to gather up sympathy despite what they are actually doing. Someone made you upset and you're trying to get other people to agree with your justification for your actions. It's better to quickly banish that disillusion.\n\nHad you not come to this thread with your claim I wouldn't have even bothered looking into it. If you don't want people to comment on the situation you didn't have to post.","replies":[{"poster":"Crylium","date":"2020-02-05T07:10:37.617+0000","up_votes":1,"down_votes":1,"body":"But its had nothing to do with you? and for reasons just like this, people sticking there nose into something that has nothing to do with them, I shouldn't have to convince you im telling the truth, I already admitted I harassed him in retaliation but you are hard stuck on believing other wise. does what you think matter? Here im asking you about the topic I discussed on being able to block persons who harass, but instead of being on that topic you would rather be toxic and argue with me to be right about something that has nothing to do with you. With this feature I'd block you, and you would never see me or another one of my posts ever again. and guess what? we do not argue as a result of it. its like you WANT to fight and argue... when I do not. What I want is a non toxic environment, I'm tired of it, and that's also part of the reason I decided to harass back, because im tired of it, league of legends boards is all toxic, i can't even type to a board dev without being flamed by people like you wanting to be right about something. I already told you i admitted to harassing him in retaliation, if you continue to flame me over it im reporting you for harassment. I do not want to argue, I want you to leave me tf alone.","replies":[{"poster":"AeroWaffle","date":"2020-02-05T07:13:43.290+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Crylium,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=0004000000000000000000000000000000000000,timestamp=2020-02-05T07:10:37.617+0000)\n>\n> But its had nothing to do with you?\n\nThis is a public board. If you wanted the discussion to remain a private conversation with mods the discord is your available option.\n\n>and for reasons just like this, people sticking there nose into something that has nothing to do with them, I shouldn't have to convince you im telling the truth, I already admitted I harassed him in retaliation but you are hard stuck on believing other wise. does what you think matter? Here im asking you about the topic I discussed on being able to block persons who harass, but instead of being on that topic you would rather be toxic and argue with me to be right about something that has nothing to do with you. With this feature I'd block you, and you would never see me or another one of my posts ever again. and guess what? we do not argue as a result of it. its like you WANT to fight and argue... when I do not. Says a lot about your character.\n\nYou don't get to choose what content other people see. If you want to block someone, that's fine (you can do this with BEK), but you'll only be blocking you from seeing their posts. You don't get to change what **they** see. They have the same right to discussion as everyone else as long as they are not breaking the rules. No matter how much you dislike their opinion.","replies":[{"poster":"Crylium","date":"2020-02-05T07:18:00.413+0000","up_votes":1,"down_votes":1,"body":"You are talking about the system that is already in place, i've talked this through with the moderators already, You telling me this means nothing because what I was asking has nothing to do with the system already in place, Im asking for them to create a system to block people from seeing profiles, post and comments. That features alone stop conversations like this meanless conversation from ever taking place, and the community would be less toxic because of it.","replies":[{"poster":"AeroWaffle","date":"2020-02-05T07:26:02.731+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Crylium,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=000400000000000000000000000000000000000000000000,timestamp=2020-02-05T07:18:00.413+0000)\n>\n> You are talking about the system that is already in place, i've talked this through with the moderators already, You telling me this means nothing because what I was asking has nothing to do with the system already in place, Im asking for them to create a system to block people from seeing profiles, post and comments. That features alone stop conversations like this meanless conversation from ever taking place, and the community would be less toxic because of it.\n\nIf someone is using post history to harass you, report them (since that **IS** against the rules). But using post history to point out a lie or point how much was downplayed in the story that is directly related to a comment is fair game.\n\nJust like how pointing out someone's match history to ridicule them is against the rules but it's fine to point out that they were lying when they make a claim related to their match history.\n\nJust because you don't like it when someone uses a person's own words as proof for counter arguments doesn't mean that the boards should protect your poor arguments from that.\n\nEdit:\nOh yeah, and this block feature wouldn't even work now that I think about it. All they would need to do is log out to see your profile. Or simply log into another account. The people whom would abuse the post history feature to harass someone is also someone who would likely have multiple accounts. Such people often use mutliple accounts to upvote/downvote when they feel like their opinion is more important than others as well.","replies":[{"poster":"AeroWaffle","date":"2020-02-05T07:49:45.998+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Crylium,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=00040000000000000000000000000000000000000000000000000000,timestamp=2020-02-05T07:45:26.381+0000)\n>\n> I'm reporting you, you are harassing me right now, I asked you to leave me alone, You continue to flame me, when someone says, leave me alone, and you repeatedly attack them that is harassment.\n> You did use my history to flame me, and call me a liar, I have nothing to lie about. leave me alone. stop  messaging me. what part of that don't you understand?\n\nLook. This is a public board. Your comments and posts are available to the public to offer their opinion on. If you feel like I'm breaking the rules you're free to report me, but you don't get to dictate who is or is not allowed to comment on your posts.\n\nIf the person commenting on your posts are following the rules and remaining on topic they are allowed to comment wherever they please. You're free to disagree with them, counter their argument, or ignore them. But you don't get to exclude them.","replies":[]}]},{"poster":"Periscope","date":"2020-02-05T17:29:50.805+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Crylium,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=000400000000000000000000000000000000000000000000,timestamp=2020-02-05T07:18:00.413+0000)\n>\n> You are talking about the system that is already in place, i've talked this through with the moderators already, You telling me this means nothing because what I was asking has nothing to do with the system already in place, Im asking for them to create a system to block people from seeing profiles, post and comments. That features alone stop conversations like this meanless conversation from ever taking place, and the community would be less toxic because of it.\n\nHey, so I'm going to make an identical post to you on Discord, but BEK actually does have the ability to block you from seeing other users' posts. Just use one of those links for whatever browser you have, and it'll download an extension to your browser: https://boards.na.leagueoflegends.com/en/c/general-discussion/U8uw8k1l-04-boards-enhancement-kit-may-7\n\nThat being said, I will be evaluating some of this content on this discussion. If you do have concerns on the boards unrelated to this post (regarding smurfs) you should just make your own discussion.","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Crylium","date":"2020-02-05T07:06:17.118+0000","up_votes":2,"down_votes":1,"body":"This user Aero, also proves another point, people being able to view our history and post, only creates toxicity, And we the users have no way of protecting ourselves from these kinds of attacks.  Why does the system in place allow for all of this negativity? I honestly just want it to stop, No more moderators deciding whether we continue to be harassed or not, We the players should be given the controls for who we allow onto our board post discussions, who can view our profile, who we block ect. As you can see I post a concern and this summoner jumps at the opportunity to flame me and be right about something. I'm not denying that I harassed in retaliation, I got fed up and reacted. But these conversations with people I'm not friends with, able to view my profile and dig up dirt on my history, what makes sense about that?  and now that him and I disagree on something, what stops him from harassing me in my future post? Once people decide they dont like someone its a wrap, everything that person says or does will be attacked. Like How I told him I retaliated by harassing the guy who harassed me, his responce, \"oh you are just the bully playing the victim\" as if Im mad and harassing this guy because he did nothing to me, If I had the ability to block Aero, these toxic environments do not take place.","replies":[]}]},{"poster":"GonahtanuGepardi","date":"2020-01-11T14:41:19.634+0000","up_votes":4,"down_votes":6,"body":"\"Boards smurfing\" is not against the rules.","replies":[{"poster":"rujitra","date":"2020-01-11T16:14:30.853+0000","up_votes":10,"down_votes":5,"body":"It is when a boards banned player keeps violating the rules on a new account. That is clearly what’s happening here.","replies":[{"poster":"GonahtanuGepardi","date":"2020-01-11T16:36:23.797+0000","up_votes":1,"down_votes":2,"body":"I mean yeah that would be against the rules but \"smurfing\" on boards in itself is not.","replies":[{"poster":"rujitra","date":"2020-01-11T16:44:13.247+0000","up_votes":8,"down_votes":3,"body":"True. I should've made more clear that when I said \"smurf\" I meant using another account *to violate the rules* - not simply using another account.","replies":[{"poster":"Silent Gravity","date":"2020-01-13T19:01:41.826+0000","up_votes":1,"down_votes":0,"body":"The term used in the Universal Board Rules [[here]](https://boards.na.leagueoflegends.com/en/c/community-moderation/ITFIpNUE) is \"Evading Board Bans\" \n\n>Do not use alternate accounts to post rule-breaking content if you have an account serving a Boards suspension. Do not post rule-breaking content on behalf of an individual serving a Boards suspension.","replies":[]}]}]}]}]},{"poster":"Bianca Colt","date":"2020-01-11T19:18:44.912+0000","up_votes":5,"down_votes":2,"body":"> I don't have time to wait hours in the discord for a response when multiple moderators are active on the boards and/or on Discord\n\nJust because someone is shown as \"Online\" in our server doesn't mean they're actively and exclusively watching the server and waiting for someone to show up. I myself use Discord for **numerous** different things, not just for modding, and I'm sure this applies to pretty much the majority of the team.","replies":[{"poster":"rujitra","date":"2020-01-11T19:23:00.119+0000","up_votes":11,"down_votes":7,"body":"I fully understand this. I was referring to moderators who are participating in discussions in the #off-topic channel in the boards discord, and/or posting on the boards at the time. Not simply being \"online\" on discord.\n\nForgive me for the edit, but I'd also like to ask (probably a herald response needed): **What is an \"acceptable\" response time to an urgent issue?** Is it 30 minutes? Is it 2 hours?\n\nLet's say, for example, that there was a board-breaking issue that I had evidence of and needed to give the moderators. Let's say someone's posting veiled pornography that likely wouldn't be seen by your moderator passing by. What is the acceptable amount of time that a response to someone in the Discord should go unanswered?\n\nWhatever that time is, unless you're saying that it's okay to leave things like that unanswered for 12+ hours, then it's not being met and moderators need to be recruited that can cover time gaps.","replies":[{"poster":"KFCeytron","date":"2020-01-11T21:26:54.479+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=00050000,timestamp=2020-01-11T19:23:00.119+0000)\n>\n> I fully understand this. I was referring to moderators who are participating in discussions in the #off-topic channel in the boards discord, and/or posting on the boards at the time. Not simply being \"online\" on discord.\n> \n> Forgive me for the edit, but I'd also like to ask (probably a herald response needed): **What is an \"acceptable\" response time to an urgent issue?** Is it 30 minutes? Is it 2 hours?\n> \n> Let's say, for example, that there was a board-breaking issue that I had evidence of and needed to give the moderators. Let's say someone's posting veiled pornography that likely wouldn't be seen by your moderator passing by. What is the acceptable amount of time that a response to someone in the Discord should go unanswered?\n> \n> Whatever that time is, unless you're saying that it's okay to leave things like that unanswered for 12+ hours, then it's not being met and moderators need to be recruited that can cover time gaps.\n\nI'm pretty sure I've waited in Discord for several hours without getting an answer, yeah. The mods aren't paid, and they don't treat moderation as a job... not even a volunteer job. It's a hobby they do for fun, because they like LoL. I've requested that they post their irregular, for-fun hours of operation and been met with scorn, even though all I wanted was to be able to look at the Discord and know that no one will be there today so I don't need to waste my time sitting in front of my computer waiting for a response (because if you step away for five minutes and they respond in that time, they leave and you missed your opportunity). I've found it a bit less stressful to use the \"message-staff\" channel, which just sends a message rather than going for a live conversation. Of course, sometimes I ping a mod and get an immediate response. It's like a box of chocolates.\n\nBut what do you expect when not even Riot treats Boards as their job? It's just a place they go to when they want to see some gushing praise for their Story, Art, &amp; Sound (which they sometimes outsource anyway).\n\nThe best thing for a regular user to do _for the sake of your own sanity_ is to report any issues you see (with the built-in report feature) and leave it at that. The next best thing is to use the message-staff channel when you see something that hasn't been handled for a while and you can't leave it alone. After that is pinging a mod to have a live chat with \"look at all these trash threads you gotta remove\" and then you can hopefully both have a laugh about all the trash. After _that_ is arguing with the mods over a moderation action/inaction/policy you disagree with, because everyone already has their own opinion on Boards policies and you have about as much chance of changing someone's mind about that here as you do of changing someone's mind about politics on Facebook.\n\nTL;DR: Try not to care too much.","replies":[{"poster":"rujitra","date":"2020-01-11T21:34:11.219+0000","up_votes":12,"down_votes":12,"body":"I've complained about this. It's not a hobby. It is a job. A volunteer job is **still a job**. There is no other volunteer job where any semblance of accountability is discounted under \"it's just volunteer\". The bar for competence and professionalism should not be lower simply because they're volunteers - but it is.\n\nIf the current moderators are unable to meet higher bars, **then they shouldn't be picked to be moderators**. If they balk at having set time requirements, **they should not be moderators**. If they don't understand that it's not appropriate to \"meme\" at a user with a serious concern about an action, **they should not be moderators**. It does not matter that they're volunteers - at this point they're basically some anarchist militia with no oversight because any oversight would infringe on them being \"volunteers\".\n\nIt honestly pisses me off because I've seen forums do this exact thing before, and been a part of teams that refuse to have oversight and go to shit because of it. Unfortunately, none of the heralds have the guts to stand up to the others and actually make changes to make this volunteer job actually have standards. The heralds are all okay with \"no time requirements\" because **they themselves would be burdened by them**. They are fine with \"not being professionals\" because they themselves don't want to worry about being professional when they're posting/talking *as a moderator*. They are fine with \"it's okay to reply to a boards user with 'lol' instead of a substantive response\" because **their friend was the one who did it**.\n\nTo be quite blunt, and I know there's no chance in hell that this happens, **the heralds need to step up and lead the moderators**. Period. If they're unwilling to step up, set policies/procedures, and make a moderation team that works, then they need replaced. I get that many of them have been in the moderation team forever. That does not excuse this lack of effort and lack of professionalism from the team. **Yes, that means some moderators/volunteers will need 'fired'**. There's at least two moderators now that should have been fired long ago given unprofessional responses to boards users. **Volunteer does not mean unprofessional** - unless you're this herald team, in which case it means \"whatever we want it to mean\".","replies":[{"poster":"Ulanopo","date":"2020-01-12T00:19:31.796+0000","up_votes":8,"down_votes":11,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=0005000000000000,timestamp=2020-01-11T21:34:11.219+0000)\n>\n> I've complained about this. It's not a hobby. It is a job. A volunteer job is **still a job**. There is no other volunteer job where any semblance of accountability is discounted under \"it's just volunteer\". The bar for competence and professionalism should not be lower simply because they're volunteers - but it is.\n\nI feel the disconnect here is in our differing definitions of \"competence and professionalism\". We very much hold the team to standards. That our standards are not identical to yours does not change that.\n \n> If the current moderators are unable to meet higher bars, **then they shouldn't be picked to be moderators**. If they balk at having set time requirements, **they should not be moderators**. \n\nThis is a great way to find ourselves with zero volunteer moderators. \n\n>If they don't understand that it's not appropriate to \"meme\" at a user with a serious concern about an action, **they should not be moderators**. It does not matter that they're volunteers - at this point they're basically some anarchist militia with no oversight because any oversight would infringe on them being \"volunteers\".\n\nThat situation was addressed. AS always, we're not going to discuss internal affairs. \n\n> It honestly pisses me off because I've seen forums do this exact thing before, and been a part of teams that refuse to have oversight and go to shit because of it. **Unfortunately, none of the heralds have the guts to stand up to the others** and actually make changes to make this volunteer job actually have standards. The heralds are all okay with \"no time requirements\" because **they themselves would be burdened by them**. \n\nHave you fucking met me??? I'm sorry, but the idea that we don't have standards for ourselves and the team is absolute nonsense. You're more than welcome to ask any moderator if they've seen the Heralds take someone to task for not handling something appropriately. Hell, you're more than welcome to ask the moderator responsible for that memeing incident whether or not I've ever had a serious talk with them. Let me know how that goes. \n\n>They are fine with \"not being professionals\" because they themselves don't want to worry about being professional when they're posting/talking *as a moderator*. They are fine with \"it's okay to reply to a boards user with 'lol' instead of a substantive response\" because **their friend was the one who did it**.\n\nThis is frankly laughable. \n\n> To be quite blunt, and I know there's no chance in hell that this happens, **the heralds need to step up and lead the moderators**. Period. If they're unwilling to step up, set policies/procedures, and make a moderation team that works, then they need replaced. I get that many of them have been in the moderation team forever. That does not excuse this lack of effort and lack of professionalism from the team. **Yes, that means some moderators/volunteers will need 'fired'**. There's at least two moderators now that should have been fired long ago given unprofessional responses to boards users. **Volunteer does not mean unprofessional** - unless you're this herald team, in which case it means \"whatever we want it to mean\".\n\nI think you're overstating the transitive quality of that incident to the team as a whole. Yes, we had a moderator who did some things they shouldn't. We didn't ignore that, however. As I said, you're more than welcome to come to the Discord, ping that moderator and ask if the Heralds just \"let it slide.\"","replies":[{"poster":"rujitra","date":"2020-01-12T02:11:46.670+0000","up_votes":12,"down_votes":11,"body":"You still refuse to put time requirements on it. If all you have are moderators unwilling to commit to a bare minimum of say 5 hours per week spread across multiple days, then that makes clear why this issue happens.\n\nThink about it - if implementing time requirements would leave you with “zero volunteer moderators” then you guys aren’t onboarding the right people. Plenty of volunteer organizations work while requiring a minimum time commitment and booting those who don’t meet it. Why can’t this one?","replies":[{"poster":"UltimateShield13","date":"2020-01-12T03:10:01.778+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=000500000000000000000000,timestamp=2020-01-12T02:11:46.670+0000)\n>\n> You still refuse to put time requirements on it. If all you have are moderators unwilling to commit to a bare minimum of say 5 hours per week spread across multiple days, then that makes clear why this issue happens.\n> \n> Think about it - if implementing time requirements would leave you with “zero volunteer moderators” then you guys aren’t onboarding the right people. Plenty of volunteer organizations work while requiring a minimum time commitment and booting those who don’t meet it. Why can’t this one?\n\nWeren't you staff at one point? What happened to that?","replies":[{"poster":"Modi","date":"2020-01-12T04:05:03.077+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=UltimateShield13,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=0005000000000000000000000001,timestamp=2020-01-12T03:10:01.778+0000)\n>\n> Weren't you staff at one point? What happened to that?\n\nNo, he was a specialist, a title denoting a specialty in a subboard (with zero power). The title was revoked after...let's just say, controversy.","replies":[]}]},{"poster":"The Djinn","date":"2020-01-12T03:04:42.609+0000","up_votes":6,"down_votes":11,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=000500000000000000000000,timestamp=2020-01-12T02:11:46.670+0000)Think about it - if implementing time requirements would leave you with “zero volunteer moderators” then you guys aren’t onboarding the right people.\n\nIn your opinion, perhaps. Your opinion is something you are certainty entitled to, but we do not have to agree with it or adjust our program to fit it if we do not agree with it.","replies":[{"poster":"rujitra","date":"2020-01-12T05:20:33.123+0000","up_votes":10,"down_votes":11,"body":"And I will continue to call you unprofessional and lax until you do. You certainly don’t have to agree with standards and actual care put into a volunteer job.\n\nThere is no volunteer job in the world that is like this with no minimum time requirement. Even if it’s “one admin action within 3 years” to continue being an administrator on Wikipedia, one exists that makes sense (Wikipedia’s being so long for various reasons, including editing but not adminning).\n\nOne hour per day, an average of 5 days per week. If you don’t have moderators willing to commit to that, then you need new moderators.\n\nVolunteer work should never be “whatever whenever”. It should have some modicum of scheduling - whether that’s the general “having mods from various time zones” just so coverage is expected, to having mandatory checkins on holidays every couple hours, or whatever. **Something**.\n\nPart of the reason controversies with moderators being “toxic” occur is because of your lax treatment of it as whatever. If you treated it like a professional volunteer job, like all other volunteering in the world, then they would not act unprofessionally.","replies":[{"poster":"GatekeeperTDS","date":"2020-01-12T10:51:05.217+0000","up_votes":8,"down_votes":2,"body":"Dude, you need to cool it. Like seriously.\n\nDo you know the phrase \"not my monkeys, not my circus?\"\n\nYou aren't staff. Giant tirades accusing the staff of unprofessionalism aren't going to get you anywhere. You can disagree with how certain things are done, but just because you say something doesn't mean you're correct.\n\nAs I tell people who get upset with League as a game, if the boards upset you, **then find something else to do with your time.** You owe that to yourself.","replies":[{"poster":"rujitra","date":"2020-01-12T18:01:48.778+0000","up_votes":12,"down_votes":9,"body":"They may not. But maybe they’ll help other people from wasting time on these boards or trying to get anything done with moderators.\n\nThe most minimal semblance of time balancing is not even present. It’s “whatever” - no matter how much Djinn tries to walk around it. They have no method of ensuring moderation coverage, no enforcement of response to discord pings (which could let urgent issues such as porn stay up for a while), and they have not ensured that moderators various time zones line up to ensure coverage.\n\nIt is run poorly compared to other volunteer jobs, and even compared to other internet volunteer jobs. That’s objective based on the results - huge gaps in time coverage, no response to pings or way to contact urgently, and more issues of unprofessional behavior than I’ve ever seen in this sort of organization.\n\nSure, it’s wasting my time because the heralds won’t care. They don’t see me as someone worth listening to. They probably think I’m fuming over losing my specialist tag or something. I didn’t ever give a fuck I had it in the first place. I simply want them to stop acting like this isn’t a job, and put some effort into commitment.","replies":[{"poster":"GatekeeperTDS","date":"2020-01-12T22:13:48.217+0000","up_votes":4,"down_votes":2,"body":"Again, not your monkeys, not your circus. If the boards aren't being moderated to your standards, don't use the boards. \n\n> Sure, it’s wasting my time because the heralds won’t care. They don’t see me as someone worth listening to.\n\nGuilt trips aren't a good look for you. The Heralds addressed you here several times, and you're just going to have to accept the fact that they don't agree with you.\n\nAgain, as I tell people who rage and complain about League itself, if the boards are making you unhappy or you don't like the way they're moderated, the best protest you can make is **not participating**. It will save yourself an awful lot of aggravation, because no matter how much you stamp your feet, it's not going to make Riot replace the staff when they aren't doing anything wrong. This is not your battle.","replies":[]}]}]}]}]},{"poster":"Modi","date":"2020-01-12T04:05:57.369+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=000500000000000000000000,timestamp=2020-01-12T02:11:46.670+0000)\n>\n> You still refuse to put time requirements on it. If all you have are moderators unwilling to commit to a bare minimum of say 5 hours per week spread across multiple days, then that makes clear why this issue happens.\n> \n> Think about it - if implementing time requirements would leave you with “zero volunteer moderators” then you guys aren’t onboarding the right people. Plenty of volunteer organizations work while requiring a minimum time commitment and booting those who don’t meet it. Why can’t this one?\n\nAnd who would you suggest? Yourself? I would rather have no moderation staff than that...","replies":[]}]}]}]}]}]}]},{"poster":"KFCeytron","date":"2020-01-13T08:45:10.160+0000","up_votes":2,"down_votes":0,"body":"I don't mind if the mods have a \"whenever\" schedule; I just want to know it. If I want to talk to a mod on Discord at 2 pm and I go in there and it says \"the next mod will be available tomorrow between 8 and 8:30 am,\" I may or may not be around tomorrow morning but at least I don't waste my time sitting there for ten hours before giving up and going to sleep.","replies":[{"poster":"Ulanopo","date":"2020-01-13T22:14:45.609+0000","up_votes":3,"down_votes":10,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=0008,timestamp=2020-01-13T08:45:10.160+0000)\n>\n> I don't mind if the mods have a \"whenever\" schedule; I just want to know it. If I want to talk to a mod on Discord at 2 pm and I go in there and it says \"the next mod will be available tomorrow between 8 and 8:30 am,\" I may or may not be around tomorrow morning but at least I don't waste my time sitting there for ten hours before giving up and going to sleep.\n\nWe've looked into things like this, but haven't found anything that works.","replies":[{"poster":"KFCeytron","date":"2020-01-14T03:07:59.856+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ulanopo,realm=NA,application-id=6heBIhQc,discussion-id=EIdGM756,comment-id=00080001,timestamp=2020-01-13T22:14:45.609+0000)\n>\n> We've looked into things like this, but haven't found anything that works.\n\nhttps://images-na.ssl-images-amazon.com/images/I/5151KsaM2DL.jpg\n\n:P\n\nBut seriously, really nothing? An informal or casual system would be fine. I'm sure no one would mind if it's just a new Discord channel with little updates about mod availability during the next couple days. Or maybe a Google Doc with a bunch of lines like \"PoultryGyro: at work but checking a couple times an hour.\" Even a Boards sticky with info like that would be helpful.\n\nActually, I just thought of a downside to having such information available: \"all the mods are watching the Big Game? time to post 'dw ill initiate' page 2 threads!\" Is that the difficult part of this?","replies":[{"poster":"rujitra","date":"2020-01-22T21:49:15.968+0000","up_votes":10,"down_votes":6,"body":"Yes. The difficult part is that the herald team refuses to set any form of schedule to ensure moderator availability. They'd rather it be this crapshoot where nothing ever gets done in a reasonable time because even moderators that are active are too lazy/don't care enough to handle it.\n\nThree separate moderators were active in either the Off Topic channel of the boards discord or in other Riot-affiliated servers - yet none of them responded to the moderator ping. You know the reason for this? Because they know that moderating is a \"whatever\" job. They know that they can ignore it and **literally nothing will happen to them** - they get to keep their hat, keep their buttons, and don't have to ever actually do shit.\n\nThis should not be acceptable. If the issue is that no moderator wants to \"cover the big game\", then **they need more moderators**. But instead, the heralds sit around and take the \"well it's not my job\" approach - it's not their job to force anyone to do anything or to implement standards for the program.\n\nThis isn't going to get fixed until Riot either gets new heralds or steps in themselves. There's no other volunteer job in the world that doesn't have some way to ensure coverage and availability.","replies":[]}]}]},{"poster":"rujitra","date":"2020-01-13T19:00:06.991+0000","up_votes":11,"down_votes":8,"body":"Don't expect them to make **any** changes.\n\nThat would make sense - having *expected* times at least. I'm not asking for moderators to be instantly vaporized if they miss one time by one minute or if they have legitimate emergencies/things come up. But committing to having at least some time frame they will be active so that we know should be doable.\n\nBut again, the heralds here are completely fine with multiple boards users turning from staunch supporters to \"haters\" (such as myself). They don't care. There's obviously nothing wrong with them - people are just hating them for no reason, right? I have and will support the moderators for their rule-enforcing and/or interpretation of the rules because they do a good job of that in almost all cases. But the **mod team organization** is piss poor and they would rather tell me \"you're allowed to disagree, fuck your opinion, we're always right\" than actually look into making changes.","replies":[]}]},{"poster":"AeroWaffle","date":"2020-01-11T21:56:43.151+0000","up_votes":2,"down_votes":0,"body":"Well damn. I must have missed the fallout that this person caused. Shame I didn't get to see how deep they dug the hole. I've only just gotten back to my computer after this morning.\n\nThe discord response time could definitely use some work, since I did try to inform the mods about them once I spotted that they had changed their name to \"Aerowaffie\". Figured could nip the problem in the bud since that should be an easy verdict. But I gave up waiting after a while and ended up deleting @moderator message.\n\nBut standard board response time seems fine. I mean, I didn't get to see any of this after the messages of yesterday.","replies":[]},{"poster":"Beerstein","date":"2020-01-11T16:14:14.034+0000","up_votes":2,"down_votes":0,"body":"Lol @the term board smurfing.","replies":[]},{"poster":"Julevi","date":"2020-01-11T14:52:04.277+0000","up_votes":2,"down_votes":0,"body":"Could it be that his other accounts are already banned on boards and therefore he needs the current one?","replies":[{"poster":"rujitra","date":"2020-01-11T16:13:28.793+0000","up_votes":7,"down_votes":5,"body":"Which is why the moderators should ban the new accounts when they continue violating the rules: spamming and harassment of another user","replies":[]}]},{"poster":"Eryl Fauna","date":"2020-01-12T22:00:53.745+0000","up_votes":1,"down_votes":7,"body":"Some people just have that much free time. I just assumed this wasn't against the rules since so many people do it and admit to doing in the boards.  Don't the mods all have smurfs to upvote their replies anyway?","replies":[]}]}