{"poster":"XxDragonitexX","date":"2018-04-04T18:36:23.649+0000","title":"que opinan del nuevo rework de ireli ap ad tanque of tanque roto?","subforum":"Charlas Generales","embed":{"description":"Las cuchillas de Irelia pueden ser una danza llena de gracia... o una furiosa tempestad. Haz clic en ''mostrar m치s'' para ver todo lo que la Cuchilla Danzante es capaz de hacer.","url":"https://www.youtube.com/watch?v=KOLb5PKnZVU","image":"https://i.ytimg.com/vi/KOLb5PKnZVU/hqdefault.jpg"},"up_votes":1,"down_votes":1,"body":"bueno queria saber su opinion de este champ para saber como jugarlo debilidades fortalezas para poder destrozarlo y no terminar humillado{{summoner:3}} y para los que lo probaran que les parecio su jugabilidad es buena o mala{{sticker:slayer-jinx-wink}} \r\no es un campeon early o late y lo mas importante  puedo deletear {{champion:157}} y hacerlos enojar{{sticker:sg-miss-fortune}}","replies":[{"poster":"IgeiTon","date":"2018-04-04T19:21:15.391+0000","up_votes":2,"down_votes":1,"body":"Estan los campeones rotos y luego esta Irelia, parece que riot no aprendio con yasuo y saco a irelia al live. Personalmente me encanta, la estuve probando en la herramienta y creo que paso de ser un camp low skill, a ser muy pero muy mecanica, el reseteo de la Q le en sinergia con otras habilidades le da un potencil de movilidad y chaseo sin igual, la reduccion de da침o escala de manera ridicula, y los da침os estan mas que correctos. Tiene todo el potencial para romper el juego tal y como paso con yasuo cuando aparecio, y lamentablemente cuando eso pase, va a correr el mismo destino, nerfs interminables hasta que el champ quede en el pozo del olvido. Ojala me este equivocando.","replies":[{"poster":"Champi4UP","date":"2018-04-04T21:21:16.849+0000","up_votes":2,"down_votes":0,"body":"Esto nunca terminar치 ni con reworks:\nBetter Nerf Irelia","replies":[]},{"poster":"Cuchufleitor","date":"2018-04-04T20:45:43.722+0000","up_votes":1,"down_votes":0,"body":"Yasuo olvidado? ojala, lo veo siempre por desgracia (-.-)","replies":[]}]},{"poster":"Rito JeZylZ","date":"2018-04-04T20:55:08.535+0000","up_votes":1,"down_votes":0,"body":"{{champion:24}} {{champion:48}} {{champion:23}}","replies":[]},{"poster":"CoronavirusC0V","date":"2018-04-04T19:10:52.149+0000","up_votes":1,"down_votes":0,"body":"pues mucho no alcanze a jugarla ya que esta perma pickeada, sino sos usain bolt con los dedos es probable que te lo ganen, en cuanto a la poca exp que tuve pos se ve bastante entretenida, revienta lindo armandote trinidad e hidra titanica, el reseteo y el stun en area da mucho juego y la ulti esta buenisima, si solo te interesa saber si podes deletear a yasuos pues si, con la ulti sola ya le quitas todo el potencial imaginate eso xD","replies":[]},{"poster":"Hell Darking","date":"2018-04-04T18:49:27.287+0000","up_votes":1,"down_votes":1,"body":"Riot games, un mundo magico donde los tankes quitan demaciado de la forma que se armen","replies":[]}]}