{"poster":"HastaKalistaBaby","date":"2015-09-02T13:59:32.561+0000","title":"Kalista - Entwicklung und Zukunft","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"**Hallo LoL Community &amp; Riotler,**\r\nich m&ouml;chte in diesem Thread einige Denkanst&ouml;&szlig;e und Feedback f&uuml;r Kalista geben.\r\n\r\nAls Kalista released wurde, wurde gesagt, dass sie eine neue Art von Marksman darstellen soll und das viele neue Mechaniken eingef&uuml;gt werden sollten.\r\nErstmal vorab: Die neue, andere und vor allem interessante Art von Marksman ist sehr, sehr gut gelungen. Ich habe Kalista direkt ins Herz geschlossen und ihr Spielstil hat mir sehr gut gefallen.\r\nWeiterhin wurde gesagt, dass an ihr immer noch herum experimentiert wird, was ich pers&ouml;nlich sehr sch&ouml;n finde, da Ver&auml;nderungen meistens gut sind :) Ich bin sehr gespannt auf weitere &Auml;nderungen.\r\n\r\nALLERDINGS scheint mit es so, als w&uuml;rdet ihr, Riot, nicht mehr viel an Kalista **&auml;ndern**. Das Champion Modell hat sehr viel Potential und es w&auml;re eine Schande dieses zu veschenken. Am Anfang war Kalista nat&uuml;rlich zu stark, allerdings auch interessant. **Meine Bitte w&auml;re, weiter an Kalista zu arbeiten und sie nicht nur zu nerfen.**\r\n\r\nNerfs sind notwendig und erhalten das Balancing, allerdings kann man es auch &uuml;bertreiben. \r\n➤ Ich sehe ein, dass sie zu stark war, aber k&ouml;nnte man sie denn nicht **&auml;ndern**, anstatt nur **schw&auml;cher** zu machen?\r\n➤ Muss man, z.B. bei dem genutzen Attack Speed w&auml;hrend des Springens, direkt von 100% auf 66% gehen?\r\n➤ Muss man direkt von 25% mehr Reichweite des Sprunges nach hinten auf 0% gehen?\r\n➤ Oder warum nerft man den Schaden von Rend (E) an Dragons und Barons nicht? Kalista kann einen Nunu outsmiten. Das f&auml;nde ich wiederum zu stark.\r\n\r\nTL;DR: Kalista hat sehr viel Potential f&uuml;r ihre neue Mechanik als Marksman. Ich w&uuml;rde mich &uuml;ber **&Auml;nderungen** freuen, die nicht nur Nerfs sind. Ich hab nichts gegen Anpassungen, allerdings sind nur Nerfs bis zur Unspielbarkeit eines Champions nicht gerade geil. Mein Appell an Riot: Bitte arbeitet weiterhin an Kalista. &Auml;ndert Sachen, versucht was Neues, probiert herum, aber bitte nerft sie nicht nur.\r\n\r\nWas haltet ihr von meiner Sichtweise und wie sieht eure aus?\r\nW&uuml;rde mich &uuml;ber Antworten von der Community sowohl auch von Riotlern freuen!\r\n\r\nMit freundlichem Gru&szlig;,\r\nHastaKalistaBaby","replies":[{"poster":"Leeerzeichen","date":"2015-09-02T16:29:05.263+0000","up_votes":2,"down_votes":0,"body":"Ich spiele sie zwar nur vlt. 4-5 mal per nerf, weil ich auf die free week warten muss, aber ich habe das Gefühl das sich kalista immer sperriger anfühlt. Der AS Scaling change, der kein q während jump, geringere AA schaden lassen sie irgendwie nicht mehr so Smooth anfühlen","replies":[]},{"poster":"Evenrider","date":"2015-09-02T14:33:56.171+0000","up_votes":2,"down_votes":2,"body":"Sie kam raus und war zu stark.\nAlso muss man sie nerfen.\nNach dem Nerf war sie aber immer noch zu stark.\nNächster Nerf.\n......\n\nKapiert? Kalista wurde bisher fast nur generft, weil sie eben nur zu stark war.\nMan kann schlecht zu starke Champions buffen und hoffen, dass das Balancing erhalten bleibt.","replies":[{"poster":"HastaKalistaBaby","date":"2015-09-02T15:54:15.972+0000","up_votes":2,"down_votes":3,"body":"Du hast es wohl nicht kapiert.\nIch rede hier nicht darüber, dass Kalista gebufft werden soll.\n\nLies nochmal gründlich und hinterlasse einen anständigen Kommentar :)","replies":[{"poster":"Th3is","date":"2015-09-04T11:19:49.825+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HastaKalistaBaby,realm=EUW,application-id=Wj1wcocU,discussion-id=g1YcsVEB,comment-id=00010000,timestamp=2015-09-02T15:54:15.972+0000)\n>\n> Du hast es wohl nicht kapiert.\n> Ich rede hier nicht darüber, dass Kalista gebufft werden soll.\n\nDarüber habe ich auch nichts gesagt, ich habe lediglich in deineer Meinung zugestimmt, dass Kalista nicht NUR generft werden soll.","replies":[{"poster":"HastaKalistaBaby","date":"2015-09-04T14:59:05.665+0000","up_votes":1,"down_votes":0,"body":"Bist du verrutscht? :D\nIch hab dir unten auf deinen Kommentar geantwortet :^)","replies":[{"poster":"Th3is","date":"2015-09-04T15:59:07.918+0000","up_votes":1,"down_votes":0,"body":"Ah okay, sorry. ^^","replies":[]}]}]},{"poster":"Evenrider","date":"2015-09-04T12:06:57.778+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HastaKalistaBaby,realm=EUW,application-id=Wj1wcocU,discussion-id=g1YcsVEB,comment-id=00010000,timestamp=2015-09-02T15:54:15.972+0000)\n>\n> Du hast es wohl nicht kapiert.\n> Ich rede hier nicht darüber, dass Kalista gebufft werden soll.\n> \n> Lies nochmal gründlich und hinterlasse einen anständigen Kommentar :)\n\nWas willst du denn verändern?\nKalista basiert zum großen Teil auf ihrer Passiven. Das heißt, ihre Passive ist das, was Kalista ausmacht.\nLeider ist ihre Passive, eben ihre immunität gegen Movementslows, das was sie auch extrem stark werden lässt. Gerade wenn es nur wenig starken CC gibt, da MS-Slows 0 bewirken.\nUm sich zu ändern, müsste man diese Passive anfassen. Das will Riot aber nicht, denn gerade diese Passive ist es, die Kalista ausmacht. Also hagelt es Nerfs für andere, nicht ganz so wichtige Sachen, sodass Kalistaspieler ihre Passive auch wirklich ausnutzen müssen.","replies":[{"poster":"HastaKalistaBaby","date":"2015-09-04T14:56:56.099+0000","up_votes":1,"down_votes":0,"body":"MS Slows bewirken 0? Schon mal Kalista gespielt und einen Nasus Slow auf dir gehabt?\n\nUnd was man genau ändern könnte weiß ich auch nicht. Ich bin aber auch kein Champion Designer/Modder. Riot meinte sie experimentieren und das ist das Schöne an LoL. Ständig kommt etwas Neues/Anderes. Allerdings bei Kalista beschränken sich die \"Experimente\" auf Nerfs.\n\nUnd nochmal an Leute wie dich: Ich hab nichts gegen Nerfs, im Gegenteil. Ich versuche nur Riot daran \"zu erinnern\", dass in Kalista viel Potential für mehr steckt. + ich versuche die Community mit einzubeziehen. Stell dir vor hier postet einer einen genialen Vorschlag und der wird übernommen. Wäre doch cool? :)","replies":[{"poster":"Evenrider","date":"2015-09-04T15:21:51.321+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HastaKalistaBaby,realm=EUW,application-id=Wj1wcocU,discussion-id=g1YcsVEB,comment-id=0001000000010000,timestamp=2015-09-04T14:56:56.099+0000)\n>\n> MS Slows bewirken 0? Schon mal Kalista gespielt und einen Nasus Slow auf dir gehabt?\n\nDu weißt, dass Nasus Slow ein MS **und** ein AS-Slow ist.\nDer Slow trifft dich, weil dein AS ebenfalls in den Keller geht. Der MS-Slow bewirkt 0. Denn du kannst weiter hüpfen.\nz.b. wie reagierst du, wenn du von Sejuani gefrostet bist und sie dann ihr E nutzt und dich damit trifft? 70% Slow und Kalista kann es getrost ignorieren.\n\n> Und was man genau ändern könnte weiß ich auch nicht. Ich bin aber auch kein Champion Designer/Modder. Riot meinte sie experimentieren und das ist das Schöne an LoL. Ständig kommt etwas Neues/Anderes. Allerdings bei Kalista beschränken sich die \"Experimente\" auf Nerfs.\n\nDas liegt daran, dass Kalista so wie sie ist gut ist. Wieso willst du etwas einzigartiges Verändern? Garen brauchte eine Veränderung, weil man statt Garen auch Darius, Renek,... spielen kann. Spielten sich nahezu vollkommen gleich. Also experimentieren sie dort mit Veränderungen. Aber warum bei einem Champion rumbasteln, der mehr als genug einzigartige Mechaniken (Passiv, Ult, Item,...) hat? Der Champion hat mehr als genug Alleinstellungsmerkmale und mehr als genug gründe warum sie gepickt wird. Gibt genug Champions bei denen Kitveränderungen wichtiger wären.\n\n> Und nochmal an Leute wie dich: Ich hab nichts gegen Nerfs, im Gegenteil. Ich versuche nur Riot daran \"zu erinnern\", dass in Kalista viel Potential für mehr steckt. + ich versuche die Community mit einzubeziehen. Stell dir vor hier postet einer einen genialen Vorschlag und der wird übernommen. Wäre doch cool? :)\n\nUnd warum bei Kalista, die so schon mehr als Genug Merkmale hat, warum man sie spielt? Warum nicht Garen, der wie Darius nur ein dämlicher Lanebully ohne Alleinstellungsmerkmal war?\nWarum willst du einen der neusten Champions ändern, obwohl gerade bei denen darauf geachtet wird, dass sie mehr als genug einzigartige Effekte haben und dadurch sogar noch in 100 Jahren funktionieren?","replies":[]}]}]}]}]},{"poster":"rαbies","date":"2015-09-02T19:14:05.946+0000","up_votes":1,"down_votes":0,"body":"Hast du denn Guide geschrieben :o?\n\nBtw bin voll deiner Meinung","replies":[{"poster":"HastaKalistaBaby","date":"2015-09-03T13:27:07.880+0000","up_votes":1,"down_votes":0,"body":"Ja, hab ich und danke für deine Unterstützung :)","replies":[]}]},{"poster":"Th3is","date":"2015-09-02T14:14:38.062+0000","up_votes":1,"down_votes":1,"body":"Kann dir als Kalista Main nur zustimmen.\n\nBtw. ich habs nicht so mit abkürzungen, was heist \"TL;DR\"?","replies":[{"poster":"HastaKalistaBaby","date":"2015-09-02T15:13:18.393+0000","up_votes":1,"down_votes":1,"body":"Too Long; Didn't Read:\nAlso eine Zusammen-/Kurzfassung","replies":[]}]}]}