{"poster":"Fraqx","date":"2016-04-13T16:55:43.474+0000","title":"Platin Jungler sucht Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Da durch Rito jetzt einiges verbaut wurde, kann ich kaum mit meinen alten Teammates spielen, traurig aber wahr.\r\nBin daher aktuell auf der Suche nach 4 neuen Menschen, da zu 5 spielen einfach wesentlich mehr Spa&szlig; macht als allein.\r\n\r\nBin selbst aktuell Platin 5, war mal 3, SoloQ l&auml;sst mich aber hier nicht raus...\r\nBin 24, ihr solltet also auch dem entsprechend alt sein.\r\n\r\nBin vorwiegend Abends da (irgendwo muss das Geld ja her kommen), ab ca. 17 Uhr, dann aber bis locker 23 Uhr\r\n\r\nNat&uuml;rlich soll mit gewissem Ernst gespielt werden, aber nur weil man mal ein paar Games verliert, geht nicht die Welt unter.\r\nKann auch vorkommen dass man w&auml;hrend dem Spiel ein bisschen tiltet, aber wie hei&szlig;t dann so sch&ouml;n:\r\n&quot;Neues Spiel, neues Gl&uuml;ck&quot;\r\nNat&uuml;rlich hat auch jeder mal ein schlechtes Spiel, also immer locker bleiben, Spa&szlig; haben und besser werden.\r\nHab nichts dagegen wenn sich derjenige aufregt w&auml;hrend dem spielen, mach ich selbst auch,\r\nvorwiegend &uuml;ber mich selbst.\r\nAllerdings brauch ich keinen der die Gegner oder seine eigenen Teammates flamet, shit happes.\r\nEinen f... drauf geben und spielen.\r\n\r\nHab leider schon die Erfahrung gemacht dass Leute nach einem verlorenen Spiel gleich wieder offline sind. \r\nWenn gespielt wird, sollten mehr als nur 2 Spiele gemacht werden - Ausnahmen best&auml;tigen die Regel.\r\n\r\nAbgesehen davon lege ich sehr gro&szlig;en Wert auf P&uuml;nktlichkeit!\r\nWenn eine Zeit ausgemacht wird, steht diese Zeit. Und ja, 2 Minuten zu sp&auml;t z&auml;hlt bei mir als unp&uuml;nktlich.\r\nHat in meinen Augen einfach was mit Anstand und Respekt zu tun :)\r\n\r\nSollte sich hier jemand rum treiben der &auml;hnlich f&uuml;hlt wie ich denke, bitte sch&ouml;n.","replies":[{"poster":"Kaos Jungler","date":"2016-04-13T18:10:09.556+0000","up_votes":1,"down_votes":0,"body":"Heyho \nDeine Ansprache hat sich recht gut angehört und würde mich freuen wenn wir das mal probieren könnten .\nIch bin Main top bzw jungler . war letzte season in d3 und bin gerade noch in den placements .\nKannst dich hier ja melden wenn du Lust hast.\nMfG Kaos Jungler","replies":[]}]}