{"poster":"need VlCTlMS","date":"2016-01-20T19:30:06.748+0000","title":"Premade bot sucht ranked Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo, \r\nich bin need VlCTlMS (Ren&eacute;/18) ADC und war letzte Season Plat V, mein Freund Eat SIeep Hook (Domi/18) SUPP ist Silber II gewesen! ABER bevor ihr nur das Silber zwei seht er spielt nur mit mindestens Gold Leuten und wir haben gar kein Problem gegen eine Platin bot zu spielen. Soviel zu uns :D \r\n\r\nWir suchen ein Team  das richtig tryharden, etwas erreichen und langfristig bestehen will, dazu geh&ouml;rt auch das man Kritikf&auml;hig, Aktiv, Lern bereit und freundlich ist.\r\n\r\nWir freuen uns auf R&uuml;ckmeldung und w&uuml;rden gerne mit euch reden oder spielen um zu sehen wie man sich versteht! \r\n\r\nGL&amp;HF im ranked euer Ren&eacute;  \r\n\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"FreshSpeedy","date":"2016-01-21T15:59:07.787+0000","up_votes":1,"down_votes":0,"body":"Hallo René\n\nWir suchen gerade genau nach euch ;)\nsind derzeit 2 Premates (Mid + Jungle) haben vorraussichtlich auch noch einen Toplaner (wenn nicht finden wir diesen sicherlich Zeitnah)\nund suchen ein (optimalerweise) Premate Bot Team um abends (ab 21, 22 Uhr) die Ranked Leiter hochzuklettern. Mit Festen Positionen und richtig gutem Teamplay. Bei interesse adde einfach \"**Deathhero123**\" und schreib mich an. Teamspeak ist vorhanden und Vorraussetzung (ohne Kommunikation geht nichts). Ob wir Kompatibel sind ergibt sich dann auf der Rift. \n\nMfG Speedy","replies":[]},{"poster":"D0VAHKllN","date":"2016-01-21T14:08:45.273+0000","up_votes":1,"down_votes":0,"body":"Hallo René ! :)\n\nWir von Feral Gaming haben gerade gelesen, dass ihr nach einem Team sucht? Nun, vielleicht können wir euch ja dabei helfen. Wir haben rund 150 aktive Member in unserer Community, in der auch viele auf Teamsuche sind - und auch so gut wie in jeder Elo vertreten. Möglicherweise werdet ihr ja bei uns fündig! \n\nSchaut doch einfach mal bei uns auf dem TS vorbei : 212.227.136.32 - oder adde mich ingame! \n\nBeste Grüße,\n\nBonnie23 (FeG)","replies":[]},{"poster":"Carideen","date":"2016-01-20T19:55:59.982+0000","up_votes":1,"down_votes":0,"body":"Jo ich bin 14 und wolte vlt auf die top lane oder midlane dann brauchen war noch nen junger und noch nen top oder mid sollte es noch Fragen geben ingame Name : Carideen","replies":[]}]}