{"poster":"Monnti","date":"2016-04-19T19:33:21.256+0000","title":"Tengo un problema con los fps","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Buenos d&iacute;as. Hasta ayer pr&aacute;cticamente todo iba bien, pero a partir de la actualizaci&oacute;n sent&iacute; un cambio en los fps. Se que no es un problema de mi pc, tiene todos los requerimientos y el juego me corri&oacute; siempre bien. Anteriormente me hab&iacute;a pasado lo mismo, pero en el launcher presion&eacute; un bot&oacute;n que dec&iacute;a &#039;&#039;reparar&#039;&#039; en la esquina superior izquierda y logr&eacute; solucionarlo. Ahora intent&eacute; repetir ese paso, pero no encuentro el bot&oacute;n por ning&uacute;n lado. He pasado de 40 fps por segundo en teamfights a 6 u 8. Cualquier soluci&oacute;n es bienvenida. Gracias","replies":[{"poster":"Hernan Bozzano","date":"2016-04-19T19:55:05.865+0000","up_votes":1,"down_votes":0,"body":"con el pasar de los años (lol existe desde 2009) los requerimientos minimos para jugar han aumentado conforme el avance de la tecnologia, los ejemplos mas claros son mirando el 1° mundial o el 2° mundial comparado a los graficos de ahora.\n\nEs razonable entonces pensar que patch tras patch vayamos \"perdiendo\" fps por una cuestion razonable que Riot mejora sus graficos y consumos de ram y demas.\n\nLa solucion es sencilla: conseguir plata y mejorar la computadora.\n\nSi Riot NO HICIERA ESTO los graficos serian los mismos que hace 3 años (muy malos comparados a la actualidad) y la gente se quejaria porque los graficos son malos. En definitiva, siempre hay motivos para quejarse.","replies":[{"poster":"Monnti","date":"2016-04-19T21:45:58.296+0000","up_votes":1,"down_votes":0,"body":"Claro que entiendo eso y lo tengo presente. Pero siendo que comencé a jugar la season pasada y hasta hace dos días me corría a 40 fps descarté esa opción. No puede ser que tras una actualización dentro de una temporada me baje de 40 a 10","replies":[{"poster":"Hernan Bozzano","date":"2016-04-20T15:26:10.935+0000","up_votes":1,"down_votes":0,"body":"bueno, en el 90% de los casos es porque windows se pone lento de manera directamente proporcional al tiempo que uno lo usa, lo aconsejable es cada 6 meses hacer un \"borron y cuenta nueva\" formateando y empezando de cero.\n\nDicho esto, tambien vale la pena instalar las aplicaciones necesarias, usando como guia el refran \"todo lo que no sea parte de la solucion, es un problema\" podriamos decir \"todo programa que no uses, es basura\".\n\nSino,proba bajarte el razer cortex que es gratis y bien configurado te desactiva TODO lo innecesario mientras jugas LOL y te aumenta muchisimo los fps.","replies":[]},{"poster":"Fipilla","date":"2016-04-20T01:54:01.897+0000","up_votes":1,"down_votes":0,"body":"A mí me pasa exactamente lo mismo, solo que a mí me va a 120fps al iniciar la partida y va decayendo mientras la misma transcurre, todo esto tras la última actualización, antes me andaba a 120 fijos.","replies":[]}]}]},{"poster":"Sonya Kyron","date":"2016-04-20T06:03:22.803+0000","up_votes":1,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/9vXai3FF-windows-10-optimizado-para-el-lol-2\n\nNo baja de a 30 FPS, baja de a 1 FPS cada 2 o 3 parches, pero te das cuenta cuando te topas con los campeones reworkeados mas que nada.\nIgual soy el único jugador que sabe configurar el LOL para que de el máximo rendimiento de FPS en cada PC a medida, a veces cambiar los drivers de video, otras cambiar configuraciones, otras optimizar el windows,otras simplemente cambiar todos incluso sistema operativo...","replies":[]}]}