{"poster":"Xolute","date":"2017-02-10T09:09:24.916+0000","title":"How do you deal with a bad support???","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Just had a vayne game where my sup went 0/3 within first 6 minutes, then refused to listen to anything I said and kept dying and blaming me. Now I&#039;m not saying that I am a god vayne or anything, but the enemy adc was super stacked and I just feel like I couldn&#039;t do anything. Any tips for these situations.","replies":[{"poster":"Qoki","date":"2017-02-10T09:35:20.642+0000","up_votes":3,"down_votes":0,"body":"Looking at your game history I guess it was with the Janna support? Looking at his games he barely plays support (bot/mid), let alone Janna. \n\nBesides that try to imagine yourself in the guys shoes, he's off-roling and feeding. Flaming him probably won't help (not saying you were, but this happens a lot), but what you can do is ask him to play safer and honestly just chill. MF + Thresh (w/ ignite) are all about getting those early kills, while you're on a lategame powerhouse with a defensive/passive support. \n\nYou are prob going to lose lane if your support dies a bunch, just make sure you minimize the loss and pray to the elo gods that your team can carry you. Not a silver bullet response, but screw it - its a rough situation.","replies":[]},{"poster":"Main Line","date":"2017-02-10T11:46:00.978+0000","up_votes":2,"down_votes":0,"body":"Mute them and then tell them if they do another stupid engage, don't expect backup.","replies":[]},{"poster":"Knuuckles","date":"2017-02-10T10:55:18.444+0000","up_votes":3,"down_votes":1,"body":"Run it down mid","replies":[]},{"poster":"Corvo Attano","date":"2017-02-12T07:10:53.546+0000","up_votes":1,"down_votes":0,"body":"I recommend you find a duo queue support player on the team recruitment page, i even wouldn't mind doing it myself. <3","replies":[]},{"poster":"traloop","date":"2017-02-12T05:52:37.451+0000","up_votes":1,"down_votes":0,"body":"Don't play like a pussy, try to adapt to their playstyle. \nIf they are super aggro, play aggro so long as the river is warded and they. \nIf you are behind/ think it is a really bad idea to go in, then I guess just tell them that you want to play passive and won't be following them up","replies":[]},{"poster":"Veloshotz","date":"2017-02-10T09:35:26.907+0000","up_votes":1,"down_votes":0,"body":"Let him die and play under tower and farm for rest of game till late game team fights.\n\nif your team survives for that long?\n\nalso hide your chat so u dont see him type doesnt matter if someone is saying:    MID FLASH, ANNIE HAS NO FlASH   ignore it better to have a clean mindset apposed to a tilted one becouse ur sup is flaming u.\n\nyour just gonna have to except your gonna get those game most people who are adc mains get those games time to time\n\nits about how u deal with it.","replies":[{"poster":"Veloshotz","date":"2017-02-10T09:37:25.972+0000","up_votes":1,"down_votes":0,"body":"Hope this helps{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}