{"poster":"ΑΗRΙ","date":"2017-04-12T23:41:51.878+0000","title":"Ich brauche eure Hilfe!","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":2,"body":"Liebe Community, \r\nich h&auml;tte eine Frage an euch und zwar wie ich am besten climben soll. Die Frage mag zun&auml;chst einmal etwas seltsam klingen aber ich m&ouml;chte euch mein Problem etwas genauer schildern. Ich befinde mich zur Zeit in Gold II und versuche zu climben. Jedoch wird mir dieses erschwert durch das Matchmaking. \r\nIch bin nicht jemand der sich beschwert sondern ich m&ouml;chte Euch fragen ob ihr mir helfen k&ouml;nnt und wie ich mit diesem Problem umgehen soll. Das Problem besteht hier, ich gewinne 1 Spiel und das n&auml;chste verlier ich immer weil mein Team schon in Minunte 5, 7 Kills zur&uuml;ck liegt und deswegen von early auf immer sehr behind ist. \r\nIch w&uuml;rde gerne etwas hinzuf&uuml;gen auch wenn das zun&auml;chst unwichtig erscheint. Jedes Spiel das ich verliere liegt meist daran das jede Lane 0/7/1 bis 0/9/0 steht. \r\nAlso nun m&ouml;chte ich euch fragen wie gehe ich mit diesem Problem um? \r\nDanke f&uuml;r eure Antwort :)","replies":[{"poster":"thefire7","date":"2017-04-13T10:06:02.354+0000","up_votes":2,"down_votes":0,"body":"Stirb niiiiiiiiiieeeeee im early nie egal was nieeeeee\n\nSich opfern, dass jemand anderes nen kill kriegt lohnt sich nicht\n\nVersuche alle kills zu nehmen und /mute all direkt am Anfang\n\n(Ausnahme: Support)","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-04-13T03:43:16.233+0000","up_votes":2,"down_votes":0,"body":"Als jemand, der selber in Gold I festhängt: Ich kenne das Gefühl, aber das täuscht. Also auf dem Niveau sind die Spiele, in denen du Zitat \"schon in Minunte 5, 7 Kills zurück\" liegst, sind extrem selten. Wahrscheinlicher ist es schon, dass du 4 zu 7 Kills zurück liegst... und dann denkst \"OMFG, warum feeden die schon wieder?\" Obwohl der Rückstand wirklich nicht sooo dramatisch ist...\n\nWie löst du dieses Problem? Nun ja... lerne zu Teamfighten, das hilft extrem. Ich weiß, dass ich selber in Teamfights meine persönliche große Stärke habe... also dort weniger grausam bin als sonst überall. Das führt dazu, dass es mir relativ egal ist, wie das Spiel nach 5 Minuten steht. Sowohl was die eigene als auch was andere Lanes betrifft. Wenn wir mit 3-4 Kills hinten liegen (und 2 von den 4 Toden auf meine Kappe gehen), denke ich mir nur \"Kein Problem, das reißen wir in Teamfights wieder raus.\" Und ja, ich bin relativ gut darin, Spiele die bis Minute 20 ausgeglichen sind in meine Richtung zu \"snowballen\"...\nUnd ja, es gibt diese Spiele, die wirklich genau so laufen, wie du es beschreibst. Wo du nach 12 Minuten denkst \"Ok, das Ding verlieren wir\". Kommt vor. Aber halt nur in 2 von 10 Spielen. Die viel spannendere Frage ist aber: Was machst du in den anderen 8 Spielen? Und vor allem: Wie entscheidest du die Spiele, die sich nach Minute 20 im 2K Goldvorsprungs-Rahmen bewegen.","replies":[]},{"poster":"Sayo My Caity","date":"2017-04-13T08:33:48.246+0000","up_votes":3,"down_votes":1,"body":"Also ich kann dir das bestätigen das gold matchmaking suckt hab von meinem gold smurf ne schlechtere winrate als auf meinem plat smurf xD","replies":[]}]}