{"poster":"NiraBlade","date":"2015-06-14T10:28:32.234+0000","title":"Consiglio jungler","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ciao a tutti, vorrei ricevere delle opinioni su quale jungler acquistare. Al momento ho solamente ww e diana consapevole che non sono esattamente la creme de la creme della giungla. Vorrei che il mio terzo jungler sia abbastanza tankoso, abbia dei gap closer che gli consentano dei buoni engage, che non sia permabannato nelle ranked e possibilmente che possa gankare in early. Ci sono alcuni jungler a cui avevo pensato:\n-amumu \n-j4\n-rek&#039;sai \n-wukong\nSe ne avete altri scrivete pure :)\n\nedit: dimenticavo, anche Vi non mi dispiace :)","replies":[{"poster":"BioS iP","date":"2015-06-14T11:07:58.034+0000","up_votes":2,"down_votes":0,"body":"I jungler devi analizzarli su 5 aspetti:\n1) clear dei campi\n2) sustain\n3) early gank potential\n4) objective control\n5) late game scale\n\nAnalizziamo questi aspetti su tutti e 4 quei jungler da te citati(considerando che tu richiedi tankyness) e aggiungiamoci il mitico Volibear:\n{{champion:32}} \n1) meh nella prima route; buono se AP o con un blue\n2) fai smite viola aoe\n3) buono ma poco danno e dipendente da una singola spell\n4) non ha un gap-closer \"a prescindere\" e non può zonare bene senza la R(la cui utility in fight è ottima, ma non zona da un obiettivo, se anche tu devi stare vicino ad esso)\n5) ottimo! Fatto hybrid ap-tank può shottare i carry e cambiare le sorti di una fight\nVoto 3/5\n\n{{champion:59}} \n1) meh, ma meglio di amumu\n2) da dopo il nerf, userei solo smite viola aoe\n3) fantastico = danno, knock up e slow\n4) eccellente (combo R per zonare, E+Q per uscire fuori e prendere l'obiettivo; gapcloser che ti permette anche un leggero \"over-smite\")\n5) buono se {{item:3071}} ; in caso di snowball early, puoi optare per andare \"full-danno\" con triforce, ecc\nvoto 4/5 (occhio alla combo E+Q)\n\n{{champion:421}} \n1) molto buono\n2) lo ha di passiva/W\n3) ottimo grazie al knock-up \"target-lock\"\n4)  ottimo grazie al sistema dei tunnel e al riposizionamento, Q che rivela e W che mostra i passi\n5) ottimo se full tank con {{item:3071}} ; in caso di snowball puoi fare anche una {{item:3074}}  o la triforce, ma te li sconsiglio salvo elevatissimo snowball\nvoto 5/5\n\n{{champion:62}}  (ecco il mio preferito)\n1) buono se feddato, quindi consiglio smite viola\n2) no sustain. Usi la W per tankare i minion e non morirci...smite viola obbligatorio\n3) danno molto buono e possibilità di arrivare \"sneaky sneaky\"\n4) niente gap-closer \"a prescindere\", niente \"oversmite\"...indecente! (la R aiuta ma si torna al discorso di amumu)\n5) fantastico! Full tank + {{item:3071}}  è mostruoso; full AD + mostruoso\nvoto 3/5 (se snowballi è il migliore di tutti; se sei behind è quasi peggio di J4). Richiede molta abilità per fare la build giusta, warding per non essere invaso e capacità di movimento...un invade o una morte in early possono rovinarti la partita.\n\n{{champion:106}} \n1) meh, forse il peggiore\n2) elevata health-regen, per cui non si lamenta\n3) early, mid o late gank potential sempre uguale, in pratica...attendi che sprechino l'escape per andare a testa bassa; un knock-up, uno slow e un danno molto elevato di W...soffri molto gli slow, knock-up, knock-back e tutti i control del movimento(quindi contro Tresh e Janna dimenticati di giocarlo)\n4) come Wukong e Amumu; non ha una R da utility ma compensa con la Q che lo fa correre e la W che fa over-smite; se fatto triforce ti dà ottimo clear e velocità nel fare obiettivi, ma te la sconsiglio\n5) buon tank, ha slow e danno ad area; se prende il carry senza un vero escape lo massacra, ma lo consiglio più per carry-protection che per vero engage sui carry avversari(è difficile trovarne senza escape o che lo usano ad inizio fight senza motivo)\nvoto 3/5 per semplicità di utilizzo","replies":[]},{"poster":"kirchhoff","date":"2015-06-14T16:20:32.279+0000","up_votes":1,"down_votes":0,"body":"{{champion:113}} {{champion:102}}","replies":[]},{"poster":"Matthew981","date":"2015-06-14T13:25:04.010+0000","up_votes":1,"down_votes":0,"body":"Io mi trovo bene con {{champion:113}}  buildata con {{item:3725}} {{item:3800}} {{item:3110}} {{item:3065}} {{item:3143}} poi con gli stivali in base a come si mette la partita...Ciao","replies":[]},{"poster":"narcotek92","date":"2015-06-14T13:22:28.074+0000","up_votes":1,"down_votes":0,"body":"a seconda della tua disponibilita liquida..\nsejuani \nxin zao( fino a gold è ottitmo)","replies":[]},{"poster":"JœL","date":"2015-06-14T12:34:41.839+0000","up_votes":1,"down_votes":0,"body":"{{champion:113}} oppure {{champion:54}} ,...secondo me sono due champ che indifferentemente da come stà andando la partita ti daranno sempre una possibilità di vincere se usati nel modo giusto al momento giusto","replies":[]},{"poster":"Lord Valotz","date":"2015-06-14T10:42:21.663+0000","up_votes":1,"down_votes":0,"body":"Wukong soffre abbastanza in jungla non avendo sustain nel primo giro e ganka bene dal 6.\nJ4 era god tier, con il nerf alla bandiera che non prende più armatura soffre al primo giro anche lui, soprattutto perché lo scudo early non è un granché, però ha un buon gank già dal 3, c'è da dire che la sua ulti se non si impara ad usarla bene fa più danni che altro.\nRek'say bisogna abituarsi alla meccanica della visione sotterranea che non è proprio immediata e a come piazzare il tunnel durante i gank, poi è ottima per presenza sulla mappa, gank e teamfight, nonostante i ripetuti nerf è ancora performante, anche se ora si tende più a farla full tank con un oggetto da ad come la mannaia oscura rispetto a come si usava prima.\nAmumu estremamente semplice da usare, gank dal 3 (non sono ottimi se in lane dormono) dal 6 servi le kill su un piatto d'argento, nonostante quello che si pensa pulisce la jungla abbastanza in fretta secondo me grazie alla coppia W E e grazie alla E non prende neanche troppi danni, penso che in teamfight sia uno dei jungler più utili, molti sottovalutano i suoi danni nel tempo soprattutto se gli buildi oggetti come la maschera, inoltre non lo bannano mai.\nHecarim se non lo bannano è freeElo, pulizia veloce, gank dal 3, al 6 con la ulti se la sai piazzare sono mostruosi, può ribaltare un fight (ed è un pony)\nVi ottimi gank dal 3, fulltank non è ottima, ma con trinity ed oggetto ad da jungler e poi tank soprattutto in schermaglie da 2vs2 o 3vs3 da il massimo, in teamfight da 5vs5 non da il meglio se è lei ad ingaggiare perché se non è fulltank ti trovi in mezzo e ci puoi fare poco.\nSejuani non so se dopo il nerf sia il jungler tank più forte, ma di certo ti garantisce dei perma CC in fight, la pecca è che la ulti è uno skillshot (ma è facile da piazzare)\nGragas come Sejuani danni, CC, ma per la ulti ci vuole pratica.\nNautilus, sei un muro di acciaio che pesta con un ancora, anche il solo guardare male un nemico fa da cc, ma non fai danni.","replies":[{"poster":"NiraBlade","date":"2015-06-14T10:59:26.063+0000","up_votes":1,"down_votes":0,"body":"bene direi di escludere Wukong, champion con gank after 6 ne ho già due xD\nRek'sai la adoro proprio per questo kit così particolare con cui mi ci sono trovata subito :) il problema è il ban rate :/\nAmumu visto che costa così poco e dopo quello che hai scritto penso proprio lo prendo al volo :) (raga scrivetevi questo: ora martedì sicuro esce in free)\nSej, Heca e Gragas sono inarrestabili ma sono permabannati xD (50%, 48% e 75%)\nProbabilmente prenderò Vi/Nautilus e Amumu, grazie dei consigli :)\n\nUn'ultima cosa, come builderesti Amumu? (Aggiungici anche le rune se riesci, conosco molto poco di questo champion xD)","replies":[{"poster":"Lord Valotz","date":"2015-06-14T11:38:50.399+0000","up_votes":1,"down_votes":0,"body":"Ti posso dire che Hecarim incredibilmente tra silver alto e gold basso non lo bannano, bannano sejuani e basta, poi di solito  i vari zed, leblanc, katarina, yasuo, ekko e qualcuno gragas. Per Amumu come rune io lo gioco(vorrei giocare non le ho tutte) glifi 6mr per level 3 cdr, quinte Ap, sigilli armor, marchi penetrazione magica, su di lui al contrario che per gli altri jungler tank ap mi trovo meglio con la penetrazione magica rispetto l'attack speed perché  la W la tieni sempre  attiva non è  un colpo singolo. Per la build uso smite viola con gemma verde, prendo il viola perché è  abbastanza affamato di mana in early e per avere sustain (il secondo blu lo prendo io dal terzo lo cedo di solito) , altri oggetti stivali da magic resist o da armor dipende dai nemici poi {{item:3800}}  {{item:3110}}  {{item:3102}}  e come ultimo o {{item:3151}}  o {{item:3075}}, può  andare bene anche lo scettro dell'abisso se la maggioranza dei nemici sono ap alcuni fanno il rilay per il permaslow io personalmente non lo ho mai provato. Ti consiglio di partire da rana e blu, anche se pure da golem più  rosso funziona. Bisogna prestare attenzione  ad eventuali invade da jungler bully in early ed ai countergank pre 6. Difficilmente  puoi sostenere degli 1vs1 a meno che tu non sia avanti in early, in late attivi la w e attendi che muoiano tanto è  solo alcuni adc alla vayne e kogmaw fanno danni sufficienti ad ucciderti prima che tu lo faccia con loro. Per 450 ne vale la pena. Per Nautilus provalo per bene questa settimana, ma  io quando lo uso più  dura la partita mi sento inutile perché  sono si immortale, ma non  riesco a fare nulla se non prendere schiaffi al posto dei compagni, cosa che accade anche con un Gragas, Sejuani o Amumu, ma in risposta gliene dai molti di più.","replies":[]}]}]},{"poster":"Rokman","date":"2015-06-14T10:32:11.842+0000","up_votes":1,"down_votes":0,"body":"{{champion:111}} , ti giuro che è divertente","replies":[{"poster":"NiraBlade","date":"2015-06-14T10:37:33.477+0000","up_votes":1,"down_votes":0,"body":"yep l'ho provato; le sue abilità sono fantastiche il mio problema con lui è gestirne la mole da tank (non so se sono solo io, con gli extra large sento proprio la pesantezza del movimento). \n\nCome lo buildi jungle? Full tank o gli dai 1-2 oggetti offense?","replies":[{"poster":"Rokman","date":"2015-06-14T10:46:12.981+0000","up_votes":1,"down_votes":0,"body":"In realtà dipende dalle esigenze del tuo team... Essendo molto lento solitamente delle {{item:3117}} ce la butto dentro (in late le cambio btw), poi puoi giocarlo full tank, dato che la sua forza sta nel cc e non nel danno, o puoi buildarci {{item:3075}} , {{item:3001}} , {{item:3800}} , {{item:3091}}  (non per forza tutti insieme) \n\n\nAh... per la cronaca.... {{item:3091}} è un item che personalmente adoro su nautilus (non so perchè, ma mi mette allegria)","replies":[{"poster":"Giacux","date":"2015-06-14T11:17:06.858+0000","up_votes":1,"down_votes":0,"body":"Io Nauti lo buildo full tank, se mi serve un jungler con danni prendo altro.\n{{item:3110}} ,{{item:3083}} e{{item:3800}} sono secondo me gli oggetti più importanti su di lui, ottieni uno scudo in grado di parare sugli 800 damaggi. Anche il{{item:3190}} è fantastico su di lui.\nComunque, parlando all'autore del post, Nauti ha tutte le caratteristiche che hai richiesto: la Q ha un range enorme (e usarla contro i muri è bellissimo), è mega tank, ogni suo gank equivale a un uccisione, con la R se riesci a colpire il carry (quindi quello che sta più indietro) è gg.\nQuindi, Nirablade, GIOCA NAUTI ADESSO","replies":[]}]}]}]},{"poster":"Dantazzo","date":"2015-06-14T10:40:48.782+0000","up_votes":1,"down_votes":0,"body":"Vi, Sion e Cho'Gath, con Sion ci vuole un pò di pratica per gankare in ealry però.","replies":[{"poster":"NiraBlade","date":"2015-06-14T11:01:43.061+0000","up_votes":1,"down_votes":0,"body":"meh sion ha un unico gap closer che è pure una cosa atroce da direzionare xD non saprei, come lo utilizzi di solito in giungla?","replies":[{"poster":"Dantazzo","date":"2015-06-14T11:15:13.875+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NiraBlade,realm=EUW,application-id=MJVj50Jw,discussion-id=fzP8glgP,comment-id=00010000,timestamp=2015-06-14T11:01:43.061+0000)\n>\n> meh sion ha un unico gap closer che è pure una cosa atroce da direzionare xD non saprei, come lo utilizzi di solito in giungla?\n\nIn genere parto dal campo o dal rosso, in modo tale che quando sarò al 3 sarò vicino alla  top, puoi partire da dove vuoi perchè una volta che sei al 3 la jungla non ti fa più danno.\nParto dal campo opposto alla top (o dal rosso), faccio il buff, faccio i polli, faccio l'altro buff e poi ganko o mid o top, se sono entrambe pushate continuo a farmare. Una volta che arrivi al 6 ogni volta che hai la carica usala in botlane. La build che uso è più o meno questa {{item:3709}} {{item:3009}} {{item:3078}} {{item:3110}}   poi vario a seconda della partita, in generale proseguo a tankarmi e come altro oggetto da danno se necessario faccio la {{item:3071}} . Ti consiglio di provarlo perchè è davvero divertente.","replies":[]}]}]}]}