{"poster":"janjiis","date":"2019-12-19T16:04:44.895+0000","title":"Die Website suckt  leider rein","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hallu, \r\n\r\nIch bin immer mal wieder auf den Boards unterwegs und bin immer wieder von der optischen Darstellung im Jahre 2019 enttäuscht. Bisschen in die Jahre gekommen und nicht mehr das neuste Design. ABER als ich dann den Start gesehen habe, fühlte ich mich wie in 2012, als die Website gerade so richtig entstanden ist. Es gibt uralte Beiträge und werden nicht entfernt oder verbessert. Die Website gibt lauter falsche (=nicht aktuell richtige) Informationen und ist optisch im Gegensatz zu der Riot Website oder der Community Foren längst zurückgeblieben bzw. in Vergessenheit geraten. Es folgen nun ein paar Beispiele.\r\nhttps://1drv.ms/w/s!AtEupNOwATRZmA8fPMLYqq5hkT75\r\nBild 1: In Blau zu sehen das Neue und schöne allgemeine Design der Website und in Rot das alte Design (welches dort immer noch verwendet wird), welches garnicht passt und zurückgeblieben scheint.\r\nBild 2: In Rot erkennt man den Ersten Fehler schon: Gewundener Wald?? Wo zum **** ist der denn noch im Spiel. EIN RIESIGER FEHLER, seit Sommer 2019 weiß Riot, dss Sie diesen Modus entfernen wollten und hatten Zeit sich darauf vorzubereiten: Et voila. Der ist noch da. Ich verlink mal Zahlreiche Links, indem etwas falsch ist:\r\nhttps://euw.leagueoflegends.com/en/game-info/game-modes/the-twisted-treeline/\r\nhttps://euw.leagueoflegends.com/en/game-info/items/\r\nAllgemein Fast alle Champion seiten: Hier ein Beispiel:\r\nhttps://euw.leagueoflegends.com/en/game-info/champions/Akali/\r\n\r\nUnd noch viele mehr. Natürlich möchte ich nicht nur auf die schlechten Seiten eingehen, es gibt auch sehr schöne, wie die überarbeiteten Universum Seiten, Esport Seiten und paar Mehr.\r\n\r\nSchlussendlich bin ich leider trotzdem enttäuscht, dass Riot es nicht schafft diese Websiten neuzugestalten. Davon abgesehen, dass Diese richtig vom Inhalt sind.\r\n\r\nGl Hf\r\nJanjiis","replies":[{"poster":"This is Destıny","date":"2019-12-20T10:28:26.244+0000","up_votes":1,"down_votes":0,"body":"Naja mich stört es nicht bisschen nostalgie kann nie schaden","replies":[]}]}