{"poster":"Hyde","date":"2015-07-05T00:24:50.120+0000","title":"How worth is a minion?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I have been thinking about the worth or different things in LoL and watching professional plays. getting crazy amounts of farm super quick. I know that it will be a long time before I am good enough to get even close to that much farm but say I am playing ADC and I have 1450 gold and I want to buy a BF Sword so I can wait in lane a little bit longer even with low health and get that experience and some more gold to buy the item. but what I want to know is how worth is an individual minion should I be using lots of mana and crazy skill shots risking my life and a bit of HP to get just one minion or should I just leave it? \r\nThanks :)","replies":[{"poster":"iZulu","date":"2015-07-05T10:37:55.932+0000","up_votes":2,"down_votes":0,"body":"I have personally found taking damage for farm is not worth, you are better off staying in experience range and if you are afraid to trade, wait for it to push under your turret and farm there, this is where champions who have easy farming abilities come in handy, such as zed.","replies":[]},{"poster":"Legends man1","date":"2015-07-05T08:28:53.965+0000","up_votes":2,"down_votes":0,"body":"Farm safely. If you're adc, and you're learning, just worry about last hitting and farming adequately.. let your support make a play and then go in to deal damage. It's really important to farm especially early game.. Late game it's still important but by then if you're fed off kills you're better off sieging for the enemy's nexus or grouping up rather than farming up a few more waves of minions. \n\nWhen I play adc, I keep in mind what the enemy laner can do at all times. Meaning if i know he's got flash and heal and has a hp advantage or i know that he just recently backed with items and pots, i tend to either farm extremely safe letting him zone me a bit, or back. If river's warded and they're lower than you in hp or not trying to really poke you, then just farm away.. Farm as much as possible before you back. That way as an adc, you hit your late game spike really early and can be more helpful for the whole team a whole lot quicker.","replies":[]},{"poster":"McRuthless","date":"2015-07-05T03:39:22.209+0000","up_votes":2,"down_votes":0,"body":"Try to think about what it will cost you in the long run. If using a bunch of hp/mana/cooldowns to get a couple of minions will mean you get zoned/miss several more/have to back earlier than you were planning, then its probably not worth it. If you know youre backing to get a bf sword or something in 30 seconds time, you dont care about taking a bad trade or using all your spells to get those last couple of minions as long as youre not risking dying. Also think carefully when using aoe spells to farm. Getting one or two minions with an aoe can sometimes put several other minions on awkward amounts of hp and make it impossible for you to farm them under tower or get them before they die to your minions, so be wary of that. Try not to ever put yourself in a position where you can die while trying to farm. Not only does it give your enemy gold, but being dead makes you miss out on farm you would otherwise have got.","replies":[]},{"poster":"noogai","date":"2015-07-05T02:39:00.906+0000","up_votes":2,"down_votes":0,"body":"I always try to back with 1550 gold. If you feel you're in a bad spot though, back, and take a pickaxe and boots instead. If your other laners are warding, and you can see the jungler up top or mid, and your lane opponents just got wiped (by you, hopefully), you can farm for a little bit to get 1550, preferrably just over 50 so you can afford some pots too.","replies":[]}]}