{"poster":"vollkornbeet","date":"2018-11-08T11:19:31.683+0000","title":"Ungerechtfertigter Ban","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":8,"body":"Gestern wurde ich wegen MMR/ELO Boosting f&uuml;r 14 Tage gebannt. Allerdings ist dieser komplett ungerechtfertigt und ich verstehe absolut nicht warum ich diesen erhalten habe da ich einfach nur normal Ranked gespielt habe. Ich spiele die selben Champs wie immer fast die selben Iteam Builds und dazu ganz wichtig.. mein playstyle ist IMMER gleich. Es sollte also kein Problem sein zu erkennen das nur ICH auf meinem Account Ranked spiele und ich kein Boosting in Anspruch nehme. Der einzige Grund warum Riot das vl glaubt ist wegen einem 150lp loosing streak (den jeder mal hatte) und wonach ich danach mich wieder hochgespielt habe (aber noch immer nicht ganz). (Neben Info dabei ist das meine MMR am Anfang davon bei Gold 4 war und am ende bei Silber 2, allerdings habe ich danach meine MMR wieder normal zu Gold 4 heben k&ouml;nnen wo nichts unnormales dabei war).\r\n\r\nIch finde diesen Ban doch recht ungerechtfertigt und eig jeder normale mensch sollte wenn er sich nur ein BISSCHEN erkundigt klar sein das Boosting bei mir kein fall war. (Der 14 Tage Ban st&ouml;rt mich nicht so stark eher das ich wegen diesem wohl keine Season Beolohnung bekomme und dank dem Honor reset dann wahrscheinlich auch kein Clash spielen kann).","replies":[{"poster":"CYPHΕR","date":"2018-11-09T12:26:46.987+0000","up_votes":3,"down_votes":0,"body":"Kurz zu den Fakten:\n\nDu warst 1 1/2 Seasons in unterem Bronze unterwegs. Hast dann angefangen mit einem Spieler DuoQ zu spielen, der zu diesem Zeitpunkt Bronze 4 war und dessen höchstes jemals erreichtes Ranking Silber 5 0LP war. Dieser Spieler hat sich bis dahin kreuz und quer durch die verfügbaren Champions gespielt.\nAb dem Zeitpunkt der DuoQ spielt er nur noch 4 Champions und geht damit im Schnitt ~15/~2/~10. Ihr climbt in Duoq von Bronze 4 0 LP ziemlich easy und straight hoch bis Gold 4, was für beide Einzelspieler vorher über Seasons mehr als 800LP entfernt war.\n\nSoweit zu dem was man als Fakten sehen kann.\n\nMein letzter Stand war, dass nur direktes Boosten (also das Einloggen in den zu boostenden Account und spielen von Rankeds) bestraft wird. Dabei wird der geboostete Account, als auch soweit erkennbar/nachvollziehbar der Booster selber bestraft.\n\nIn diesem Falle liegt die Vermutung sehr nahe, dass dein DuoQ-Mate ein Booster war/ist.\n\nDie Frage die sich mir also stellt: fängt Riot an extrem deutliche DuoQ-Boosting Fälle ebenfalls zu bestrafen?","replies":[{"poster":"vollkornbeet","date":"2018-11-09T13:36:46.605+0000","up_votes":1,"down_votes":2,"body":"Damals habe ich recht wenig vom spiel gewusst und war GANZ am Anfang auch noch ein Riven otp und habe immer nur die Promos gespielt und danach die ganze Season eigentlich kein einziges Game mehr. Erst als ich angefangen habe mehr ranked zu spielen hat sich mein Support main sein bemerkbar gemacht und ich habe DuoQ mit leuten mit denen es spaß gemacht hat zusammen zu spielen DuoQ gespielt. Oft total zufällige Leute aus SoloQ. Damals wusste ich noch nicht mal was boosting war und habe einfach nur ranked gespielt weil ich nicht immer von meinen freund geärgert werden wollte weil ich Bronze war. Und da ich damals gesagt habe das ich besser wäre als Bronze ich aber einfach kein ranked spiele habe ich dann halt angefangen ranked zu spielen um ihnen zu beweisen das ich besser bin als Bronze. Weißt du zufälligerweise eigentlich den Namen von der Person mit der ich DuoQ gespielt habe? Meines Wissens habe ich damals nur mit randoms gespielt die ich cool fand und mit denen ich spaß am spielen hatte. Damals war ich noch relativ jung und hatte keine Ahnung von vielen sachen. Ich wusste z.B. auch nicht was Twitch.tv war damals usw einfach weil meine Internet Reichweite recht klein war und ich weil ich noch ziemlich jung war keinen richtigen überblick über das große ganze hatte.","replies":[]}]},{"poster":"Shacoláde","date":"2018-11-08T13:49:37.928+0000","up_votes":1,"down_votes":0,"body":"dein Mate Peypyro, da muss man schon sagen, das er exterm stark aufspielt \"obwohl\" er nur Silber II ist.\nSmurft er und bossted dich so indirekt? \nDu hast Ranked recht häufig mit ihm gespielt. Während du mit einer KDA von 1.2-2 rumtigerst,\ncarried Peypryro das game fast alleine. Auffällig ist das schon.\nVllt hat da das Boostsystem angeschlagen...","replies":[{"poster":"LegendaryXenon","date":"2018-11-08T14:06:17.299+0000","up_votes":3,"down_votes":0,"body":"Das Boostsystem kann da nicht anschlagen, weil das völlig legal ist, zumindest war das der Status Quo, der mir bekannt ist und im Forum kommuniziert wird.","replies":[{"poster":"Angel Ayume","date":"2018-11-08T14:17:37.030+0000","up_votes":3,"down_votes":0,"body":"DuoQ ist halt noch nie verboten gewesen. Deswegen is das mit dem Partner der carried auch legitim. \nIch glaub es wird erst dann problematisch, denn man dafür Geld verlangt, aber wer will das schon nachweisen? ^^","replies":[{"poster":"Shacoláde","date":"2018-11-08T14:36:26.515+0000","up_votes":2,"down_votes":0,"body":"https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/Hj86EnUY-frage-an-den-support-zum-thema-duo-q-boosting-mit-antwort\n\n\nda steht \n\n> Kurz geschrieben, sehen wir bezahltes Boosting nicht als im Grunde verschieden von von einem Freund kostenlos geboostet zu haben. Situationen, wo wir sicher sind, dass ein Konto geboostet wurden, werden beide Kontos - das geboostete und dieses des Boosters - bestraft werden.\n\n\nAber alles wohl Auslegungssache... das haben andere zu entscheiden.\nIch seh halt bei ihm sonst keinen Grund, was mich dazu veranlassen würde, ihm wegen \"boosting\" zu bannen.\nEuch?\n\nDa aber Peypyro noch spielt wird es wohl auch nicht der Grund sein...\nIch hab ehrlich keine Ahnung.\nSoll der Support beantworten.","replies":[{"poster":"Dreadlord Mike","date":"2018-11-08T16:40:47.273+0000","up_votes":3,"down_votes":0,"body":"Jop wie du schon gesagt hast, sieht mir stark danach aus dass Peypyro in im duoq boosted.\nMeiner Meinung nach sollten sie noch immer Solo/duo in nur Solo umändern damit es solche Fälle nicht mehr geben kann.\nAber wird ws niemals passieren, nur ich am tagträumen.","replies":[{"poster":"MeMyselfandBaal","date":"2018-11-08T17:30:23.174+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Dreadlord Mike,realm=EUW,application-id=KYnfKGf0,discussion-id=VUmpjkk5,comment-id=00050000000000000001,timestamp=2018-11-08T16:40:47.273+0000)\n>\n> Jop wie du schon gesagt hast, sieht mir stark danach aus dass Peypyro in im duoq boosted.\n> Meiner Meinung nach sollten sie noch immer Solo/duo in nur Solo umändern damit es solche Fälle nicht mehr geben kann.\n> Aber wird ws niemals passieren, nur ich am tagträumen.\n\nDas ist doch... Blödsinn. Also Riot toleriert Smurfs und fördert das Gemeinsame Spielen in der Duo Que. Dann können sie jetzt nicht Spieler bannen, weil er sich an die von Riot festgelegten Regeln hält? Das kann nicht der Grund sein...\n\nNebenbei... müsste dies bedeuten, dass mein bester Freund nen Perma bekommt, weil er 85% seiner Ranked mit meinem Smurf als Duo Que gemacht hat... Ich wage mal zu behaupten: Da mein bester Freund jegliche Spiele selber absolviert hat, wird er deswegen nicht gebannt werden...","replies":[{"poster":"eingew","date":"2018-11-09T07:20:50.849+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=KYnfKGf0,discussion-id=VUmpjkk5,comment-id=000500000000000000010000,timestamp=2018-11-08T17:30:23.174+0000)\n>\n> Das ist doch... Blödsinn. Also Riot toleriert Smurfs und fördert das Gemeinsame Spielen in der Duo Que. Dann können sie jetzt nicht Spieler bannen, weil er sich an die von Riot festgelegten Regeln hält? Das kann nicht der Grund sein...\n\nNaja, ich denke mal *wenn* so ein Ban ausgesprochen werden *würde*, dann weil Riot von einer entsprechenden Bezahlung wüsste. Anders kann ich mir das nicht vorstellen. Ich glaube aber nicht, dass Riot so einen Ban aussprechen würde, weil DuoQ eigentlich ja komplett erlaubt ist.","replies":[{"poster":"Awsane","date":"2018-11-09T19:54:55.786+0000","up_votes":2,"down_votes":0,"body":"Eine Bezahlung spielt gar keine Rolle, dass hatte ich doch schonmal in nen Post geschrieben \n\nwenn du willst suche ich den nochmal raus, aber ich hatte deswegen ja mal länger mit dem Riot support korrespondiert. \n\nWas hier der fall sein kann und mMn höchstwahrscheinlich eintrifft ist, dass wenn man duo q mit einem Acc. Share Booster spielt ebenfalls bestraft wird, weil das schon sehr System ist.\n\nSolange der \"Booster\" auf seinem eigenen Account spielt kann man ihm 1000+ Euro bezahlen und wird nicht dafür gebannt.","replies":[]}]}]}]},{"poster":"Awsane","date":"2018-11-08T19:47:55.857+0000","up_votes":2,"down_votes":0,"body":"Für Duo Q (boosting) wird man auch nur seltenst gebannt, weil\n\n-smurfen nicht verboten ist\n- und somit smurfen und dann mit einen Freund spielen auch nicht verboten ist.\n\nEs ist auch nicht verboten am Ende als Freundschaftsdienst nen paar Spiele mit nen Kumpel zu machen um ihn nach Gold oder so zu ziehen.\n\nSoweit ich das verstanden habe ist es nur dann verboten, wenn manes Systematisch macht, z.B. man macht mehrer smurf accounts um seine MMR immer wieder zu resetten.","replies":[]},{"poster":"vollkornbeet","date":"2018-11-08T15:05:28.566+0000","up_votes":1,"down_votes":1,"body":"Peypyro ist ein irl freund der zwar nur S2 ist aber auch nur weil er nicht gerne Ranked spielt. Allerdings ist das sein main account und ich spiele eigentlich kein Ranked mit ihm. (Normals schon weil er halt n irl freund ist). Und ich meine wenn jemand der Bronze 5 ist (auf seinem main) mit mir spielen würde aber er spielt so gut wie jemand der Plat ist wäre das dann auch boosting? (Aber wie gesagt das sollte es nicht sein da ich 2-3 runden ranked mit ihm gespielt habe seit ich League spiele also daran liegt es sicherlich nicht.","replies":[{"poster":"Angel Ayume","date":"2018-11-08T15:29:08.001+0000","up_votes":3,"down_votes":2,"body":"Wenn ihr wisst, dass er nicht auf S2 Niveau spielt und er eigentlich kein Ranked spielt und plötzlich mit dir doch Ranked spielt, dann ist es Boosting, ja.","replies":[]}]}]}]}]},{"poster":"vollkornbeet","date":"2018-11-08T15:09:13.354+0000","up_votes":2,"down_votes":1,"body":"Ich spiele SEHR selten mit Peypyro ranked ich habe insgesamt nur 3-4 games mit ihm gespielt in dem sinne. Da er ein Irl freund ist spielen ich er und n paar andere freunde oft einfach anstatt normals Flex weil man da für einen Win wenigstens etwas bekommt aber jeder von uns trollt da eig nur und spielt so als wäre es ein normal. (Dazu es ist kein Smurf account das ist sein main account seit er LoL spielt, er hat nur früher nie ranked gespielt daher :/). Es wäre dann doch recht dumm wenn Flex mit freunden spielen die wahrscheinlich besser sind als man selbst als boosting zählt,","replies":[]}]},{"poster":"Julevi","date":"2018-11-08T11:56:34.877+0000","up_votes":3,"down_votes":0,"body":"Falls du Fragen zu deinem Ban hast oder vielleicht weitere Informationen dazu möchtest: der Support ist dafür immer da.\n\nWas mir mit einem Blick auf deine Runden auffällt: du baust verdammt selten dein Supportitem aus, genauer gesagt: fast nie. Da wirft es automatisch die Frage auf - was war genau in den Runden los, wo du von deinem festen Muster abgewichen bist? Diese Angewohnheit zieht sich nämlich auch in deinen Normals durch, egal welchen Supporter du pickst, du ignorierst dein eigentliches Pflichtitem in letzter Zeit fast komplett.","replies":[{"poster":"Mjölnir Kind","date":"2018-11-08T12:08:15.842+0000","up_votes":2,"down_votes":3,"body":">Was mir mit einem Blick auf deine Runden auffällt: du baust verdammt selten dein Supportitem aus, genauer gesagt: fast nie. In über 40 Rankeds (Solo Q) hast du knapp 6x jenes vervollständigt. Da wirft es automatisch die Frage auf - was war genau in den 6 Runden los, wo du von deinem festen Muster abgewichen bist? Diese Angewohnheit zieht sich nämlich auch in deinen Normals durch, egal welchen Supporter du pickst, du ignorierst dein eigentliches Pflichtitem fast komplett.\n\nDas ist wohl die größte Verschwörungstheorie ive ever read. :D\nIch bau auch kaum mein Support item aus, aber wenn ich mir denke ein paar HP wären jz ganz gut und ich kaum Gold habe dann bau ich es aus.\nBin ich jz auch geboostet?","replies":[{"poster":"Julevi","date":"2018-11-08T12:18:04.626+0000","up_votes":3,"down_votes":0,"body":"Das ist keine Verschwörungstheorie und auch kein Fakt meinerseits, das ist nur ein Punkt, der in meinen Augen komisch ist. Das heißt nicht, dass dies der Wahrheit entsprechen muss, noch, dass ich ihm unterstellen würde, dass er boosted ist. \n\nWenn der Ban ungerechtfertigt war, dann muss er es mit dem Support klären, hier können wir ihm ja nicht wirklich helfen sondern nur diskutieren. Sollte der Ban aber gerechtfertigt sein, dann muss Riot das aufgrund eines Beweises/Feststellung/Überprüfung herausgefunden, beziehungsweise bestätigt, haben. In solchen Diskussionen, gerade wenn der TE nicht wirklich weiß woher der Ban denn eigentlich kommt, werden sich oft gemeinsam grobe Änderungen im Profil des Nutzers angeschaut - vertauschte Spells, veränderte Spieltaktik oder stellenweise Unterbrechungen bei Angewohnheiten.","replies":[{"poster":"vollkornbeet","date":"2018-11-08T17:22:27.883+0000","up_votes":1,"down_votes":2,"body":"Ich habe den Support schon angeschrieben dass sie mir doch bitte sagen sollen woher sie schließen das ich geboosted wurde, habe darauf aber nur eine Bot nachricht bekommen das: \"Deiner Sperre ist eine eingehende Untersuchung vorausgegangen, die ergeben hat, dass du die ELO-Wertung manipuliert hast.\" Daher werde ich die jetzt so lange nerven bis die mir eine Erklärung geben.\nHabe diesen Post nur gemacht um vl ein paar Vorschläge zu erhalten warum es denn so sein könnte und weil ich ziemlich wütend war und das mal raus hauen musste.","replies":[]}]}]},{"poster":"vollkornbeet","date":"2018-11-08T12:11:15.812+0000","up_votes":2,"down_votes":2,"body":"Ich baue mein Supp iteam eig immer aus aber erst recht spät. Wenn ich gerade 950 Gold in der Tasche habe und mir diese 950 Gold in meinen Iteam pathing zu dem Moment wenig bringt baue ich mein Supp iteam komplett aus aber sonst baue ich es nur auf die 2 Stufe und fast nie aus im early. Wenn die Games aber länger gehen und ich das GOld habe baue ich es aus.","replies":[{"poster":"Julevi","date":"2018-11-08T12:21:23.433+0000","up_votes":1,"down_votes":0,"body":"Danke für die Erklärung! {{sticker:sg-ahri-2}}","replies":[]}]}]},{"poster":"Qbert","date":"2018-11-09T13:45:54.736+0000","up_votes":3,"down_votes":1,"body":"Ich persönlich erkenne da keine Boost-Tendenzen.\nSieht für mich aus, als würden da zwei Leute spielen, die des Öfteren zusammen spielen.\n\nIhr habt keine besonders hohe Winrate, auch eure Builts sind nicht gerade komisch und die Stats sind jetzt auch nicht herausragend.\n\nEventuell kann dir der Riot-Support da mehr Informationen geben, für mich ist das schon merkwürdig.","replies":[{"poster":"vollkornbeet","date":"2018-11-09T13:51:28.821+0000","up_votes":1,"down_votes":1,"body":"War auch sehr verwundert als ich den Ban dafür bekommen habe.\nDas einzige wo das System das vl gedacht haben kann ist halt nach meinem 150lp lose wo meine MMR von G4 auf S2 und dann wieder auf G4 gegangen ist :/. \nAber warte gerade einfach nur auf den Support das der mir das erklärt, habe bis jetzt aber nur eine bot Nachricht bekommen, werde da aber den Support so lange am bein hängen bis die mir das erklären und begründen.","replies":[{"poster":"Qbert","date":"2018-11-09T14:00:11.438+0000","up_votes":2,"down_votes":0,"body":"Wenn dir ein Bot antwortet, einfach noch mal antworten.\nBleib nett und hartnäckig und man wir dir sicherlich Rede und Antwort stehen.\n\nEs wäre schön, wenn du das Ergebnis hier mal reinschreibst.","replies":[{"poster":"vollkornbeet","date":"2018-11-10T00:10:32.501+0000","up_votes":2,"down_votes":0,"body":"Mache ich aber habe noch keine richtige Antwort erhalten.","replies":[]}]}]}]},{"poster":"Shadowscreen","date":"2018-11-08T11:23:00.333+0000","up_votes":2,"down_votes":0,"body":"Hast du deine Accountdaten mit jemandem geteilt? Auch wenn dieser nur Normals gespielt haben sollte fällt das dennoch unter Acc sharing und ist somit bannable. Ansonsten würde ich einfach nochmal den Support anschreiben und da etwas hartnäckiger sein.","replies":[{"poster":"vollkornbeet","date":"2018-11-08T12:13:14.614+0000","up_votes":1,"down_votes":1,"body":"Niemanden :/","replies":[]}]},{"poster":"Jastol","date":"2018-11-08T11:43:18.717+0000","up_votes":3,"down_votes":1,"body":"Wenn außer dir wirklich niemand mit deinem Account gespielt hat (Egal in welcher Q) solltest du dich beim Support melden. Dort auch ruhig hartnäckig bleiben, wenn du am Anfang nur irgendeine Standard Antwort zurück bekommst.","replies":[]},{"poster":"Izaya Kumiho","date":"2018-11-08T11:24:15.407+0000","up_votes":5,"down_votes":3,"body":"Wir sind nur die Community und nicht der [Support](https://support.riotgames.com/hc/de). Für mehr Infos, solltest du dich also auch eher an den [Support](https://support.riotgames.com/hc/de) wenden.\nSelbst wenn niemand Zugriff auf deinen Account hatte, kannst du für's Boosting erwischt worden sein.\nSowohl der \"Booster\", als auch der \"boosted Account\" können eine Strafe bekommen.","replies":[{"poster":"vollkornbeet","date":"2018-11-08T12:12:44.606+0000","up_votes":1,"down_votes":1,"body":"Habe ich aber bekomme (denke ich) gerade nur BOt antworten das \"Deiner Sperre ist eine eingehende Untersuchung vorausgegangen, die ergeben hat, dass du die ELO-Wertung manipuliert hast.\" Werde die noch n bissl nerven das dieser Ban kein bisschen gerechtfertigt ist. Wollte das ganze aber mal raus kriegen da es mich echt aufregt.","replies":[{"poster":"XenesisCH","date":"2018-11-08T12:45:25.732+0000","up_votes":2,"down_votes":1,"body":"Am Anfang bekommst du immer solche Copy&Paste antworten. Einfach hartnäckig und freundlich auf eine Überprüfung deines Banns pochen, dass sich das nochmal jemand genauer anschaut ;)","replies":[]}]}]},{"poster":"Allerbester Biss","date":"2018-11-08T14:23:45.626+0000","up_votes":1,"down_votes":0,"body":"Frag mal den Support was du jetzt anders machen solltest, damit du keinen Perma Ban bekommst xD","replies":[]},{"poster":"Necromant","date":"2018-11-08T11:26:48.625+0000","up_votes":1,"down_votes":4,"body":"Log or didnt happend.","replies":[{"poster":"Izaya Kumiho","date":"2018-11-08T11:36:21.583+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=Necromant,realm=EUW,application-id=KYnfKGf0,discussion-id=VUmpjkk5,comment-id=0002,timestamp=2018-11-08T11:26:48.625+0000)\n>\n> Log or didnt happend.\n\n...n..necro?\nDas ist ein Boosting-bann. Kein chatlog-dingens D:","replies":[{"poster":"Necromant","date":"2018-11-08T11:37:17.287+0000","up_votes":1,"down_votes":1,"body":"oh sorry, macht der Gewohnheit hier im Forum :D","replies":[]}]}]}]}