{"poster":"Girl VS Nuubs","date":"2017-06-16T08:24:09.104+0000","title":"Silber 5 Adc Main Sucht Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hmmm..{{sticker:slayer-jinx-wink}} \r\nHallo Liebe Spieler und Spielerinnen.\r\nErstmal danke das ihr euch die Zeit nehmt um meinen Beitrag durch zu Lesen.\r\n\r\nMein Name ist Mina, ich bin 20 Jahre jung und suche schon seid l&auml;ngeren ein Team. Leider hatte es nie so ganz geklappt wie ich es mir,\r\neigentlich vorgestellt hatte aber es ist jetzt nun mal so. Ich suche schon seid ca. fast 2 Jahren ein Team, werde aber irgendwie nie f&uuml;ndig.\r\nNaja entweder hatte es nicht gepasst oder diese Teams wurden Inaktiv wo man dann nur noch zu 2 oder zu 3 da stand ist auch nicht so sch&ouml;n.\r\n\r\nIch erwarte vom Team Spa&szlig; am Spiel, kein Flame oder sonst was damit zutun hat weil das will keiner und ganz wichtig Geistige reife klar kann man mal\r\nSpa&szlig; machen bzw. immer aber es muss auch Interesse da sein an einen Turnier und eine Elo von Bronze 3 bis Gold 3.\r\n\r\nZu mir:\r\nWie schon gesagt mein Name ist Mina, ich bin 20 Jahre jung.\r\nIch Spiele seid 2014 League of Legends und seid dem her auch nur Main ADC.( Spiele in Normals auch mal andere Rollen aber meist Main ADC).\r\nIch besitze alle Adc Champs kann die meisten auch Spielen, aber so wie jeder Spieler besitze ich auch Main Champs womit ich die meiste zeit auch Spiele.\r\nMain Champs:\r\nJinx (Stufe 7), Vayne (Stufe 7), Caitlyn (Fehlt noch eine Marke zu Stufe 7), Ashe (Fehlt noch eine Marke zu Stufe 7), Kalista (Stufe 6).\r\nIch spiele auch noch Xayah wobei ich sie noch sehr stark &uuml;ben muss.\r\nIch bin in SoloQ Zurzeit noch Silber 5 wird sich aber hoffe noch auf Gold &auml;ndern, in Flexi bin ich noch Bronze 2, aber ich hoffe das sich das auch noch &auml;ndern wird.\r\nMein Farm als Adc liegt so bei 10 mins 60-80 Farm, bei 30 mins meist 250-280 Farm, wenn ich mich anstrenge meist noch besser, aber auch so wie jeder Spieler ist das nicht immer so der Fall weil man nicht immer einen guten Tag haben kann.\r\nMich w&uuml;rde es auch nicht st&ouml;ren einen Clan bei zu treten, wenn es hilft ein Team zu finden w&uuml;rde mich das nicht wirklich st&ouml;ren. Au&szlig;erdem Freut man sich immer &uuml;ber neue Spieler.\r\nMeine St&auml;rken sind, Farmen, auf Calls h&ouml;ren, Map Kontrolle ( nicht immer).\r\nMeine Schw&auml;chen sind, bin Relativ Sch&uuml;chtern (zum Anfang in Gruppen), meine Position ( wird aber noch verbessert) und bestimmt noch einiges.\r\nAchja was ich noch sagen sollte man kann mir so viele Kills nehmen wie man will aber nimmt man mir als Main Adc den Farm dann werde ich leicht mad weil das, dass wichtigste ist f&uuml;r mich und ich ihn brauche.\r\n\r\nIch besitze ein Funktionierendes Headset sowohl auch TeamSpeak und Skype.\r\nIhr k&ouml;nnt mich Ingame erreichen weil ich eigentlich jeden Tag Online bin.\r\nIGN: MinaMaus\r\n\r\nMit Freundlichen Gr&uuml;&szlig;en \r\nMina{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Flauschischste","date":"2017-06-16T13:28:34.701+0000","up_votes":1,"down_votes":0,"body":"Hi Mina,\nWOW - Dein Beitrag verdient echt respekt. Ich hoffe meine Antwort ist Deinem Gesuch würdig.\n\nIch bin Flauschi und möchte Dir gerne die Ü18 Community “[Nerds Go Casual](https://nerdsgocasual.de/community)” empfehlen.\n\nWir existieren seit 2016 und legen vor allem Wert auf gepflegten Umgang (d. h. kein Flamen) und angenehme Zocker-Atmosphäre.\nWir haben bereits Teams in verdiedenen Elos und unterstützen unsere Member auch bei der Teamgründung. \n\nSomit hättest Du die Möglichkeit einem bestehenden beizutreten oder Dir Dein eigenes aufzubauen. \nBei über 100 aktiven LOL-Spielern, sehe ich da ein gewisses Potential.\nIn erster Linie muss die Chemie stimmen, aber das findest man nur durch ausprobieren heraus. \n\nNeben LOL findest Du bei NGC auch Bereiche wie z. B. Overwatch und Pen&Paper, falls Du mal was anderes als LOL sehen möchtest.\n\nWenn ich Dein Interesse geweckt habe, schau’ doch bitte auf unsere “[Homepage](https://nerdsgocasual.de/community)”. Dort findest Du noch ein paar Infos über NGC und einen Link zum Bewerbungsformular.\n\n\nWürde mich sehr freuen, wenn Du auch ein \"Nerd\" werden wollen würdest. ;)\n\n\nLG\n\nFlauschi","replies":[]}]}