{"poster":"Tazztania","date":"2016-11-25T22:36:34.623+0000","title":"Disfrutas jugar Supp?","subforum":"Charlas Generales","up_votes":70,"down_votes":6,"body":"Me siento tan sola... leo cada cosa sobre los supp... sal&iacute; de bronce y llegu&eacute; a platino jugando supp... ahora voy ADC/TOP/SUPP/MID/JG en preferencia pero... si me toca jugar supp lo sigo disfrutando.\r\n\r\nPregunto para ver si existimos m&aacute;s... les gusta jugar supp? y si es as&iacute;... que supp creen que se viene con todo en esta temporada de asesinos?\r\nYo estoy full {{champion:89}} {{champion:201}} {{champion:267}}, creo que ser&aacute;n mis favoritos a usar, ya venia extra&ntilde;ando a Leo :)","replies":[{"poster":"NerfAutoFill","date":"2016-11-26T02:12:10.629+0000","up_votes":33,"down_votes":4,"body":"Es genial suportear cuando tu adc no es un sida.\n\nSaludos.","replies":[{"poster":"EnterTheParanoia","date":"2016-11-26T02:20:57.776+0000","up_votes":10,"down_votes":0,"body":"https://k61.kn3.net/F/5/5/D/D/3/1D9.gif","replies":[]}]},{"poster":"asdmaskldmnkfl","date":"2016-11-25T22:51:34.890+0000","up_votes":7,"down_votes":5,"body":"Es genial jugar support, pero la gente que juega adc es idiota asi que me he tirado un poco a jugar jungla.","replies":[{"poster":"Mazoku","date":"2016-11-25T22:55:05.260+0000","up_votes":3,"down_votes":4,"body":"Que tiene que ver el ADC?","replies":[{"poster":"Tazztania","date":"2016-11-25T22:59:29.457+0000","up_votes":23,"down_votes":2,"body":"hay adc que te critican TODO lo que haces, si eres agresivo tabla, si eres pasivo tabla, si no wardeas tabla, si lo dejas solo por wardear tabla... y así... xd","replies":[{"poster":"Mazoku","date":"2016-11-25T23:00:34.802+0000","up_votes":8,"down_votes":1,"body":"Eso pasa porque el support maneja el tempo de la lane y por ende al sentir impotencia putean. Es cuestion de mutear y listo.","replies":[]},{"poster":"Celta","date":"2016-11-26T05:16:13.769+0000","up_votes":4,"down_votes":4,"body":"Si eres buen supp, debes adaptar tu juego de acuerdo a la habilidad del adc, así no tendrás problemas de ningun tipo con los adc","replies":[{"poster":"girlrules","date":"2016-11-26T16:05:37.728+0000","up_votes":3,"down_votes":1,"body":"´´debes adaptar tu juego´´ claro , pero si pickeas un sup tank  y te tiras y el adc se queda farmeando no sirve, o si pockeas y dejas al adc enemigo a 10 de vida y tu adc se queda mirando el techo tampoco sirve. Ni hablar de cuando en early vos tenes solo 1 ward (muchas veces 2 si contamos mi pink inicial) y le pedis que wardee (el tiene 2 acumulados sin usar) y prefiere que lo gankeen a ayudarte a wardear {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Celta","date":"2016-11-27T01:58:01.877+0000","up_votes":2,"down_votes":2,"body":"Por eso dije adaptarse al adc. Si sabes que tu adc no tradea, para que tirarse?, mejor quedarse cerca de el y protegerlo.","replies":[{"poster":"NickW","date":"2016-11-27T03:13:26.247+0000","up_votes":2,"down_votes":1,"body":"En todo caso deberían adaptarse los dos.\nSi se dan las posibilidades que plantearon arriba y el adc no reacciona no es culpa del support por \"no adaptarse\", sino del adc por dormido.\nHay que perder esa mentalidad de que el support es niñera y debe adaptarse a lo que el adc quiera, deben estar los dos atentos para optimizar las posibilidades que se les presenten en la partida.","replies":[]}]}]}]}]},{"poster":"Nisman on bush","date":"2016-11-26T23:39:09.882+0000","up_votes":2,"down_votes":0,"body":"que los adc a veces son altos conos, te explico el otro dia jugue cn karma y como el jg empezo en el otro lado de la botlane no pooleamos, le empiezo a pegar a los minions magos y le digo al jhin que pushee asi sacamos lvl 2 rapido (no habia llegado todavia la botlane) me empezo a pinguear y a putear (no le hice perder ningun minion) y le digo dale pushea asi cuando llegan le sacamos lvl y tradeamos me dice para que? y empezo a pinguear a morir le meti mute y como la botlane no llego me fui a roamear a mid a lvl 3 dejandole wardeado el rio matamos al mid de ellos y ve que bajaba la shyvana el estaba pegandole a la torre mil pings le hicimos no hizo caso murio y empezo a trolear se compro 6 botas y termino 0/15 o 1/15 no recuerdo.. en eso tienen q ver los adc","replies":[]}]}]},{"poster":"Runth","date":"2016-11-25T22:43:52.663+0000","up_votes":7,"down_votes":1,"body":"frustrante, ya q siempre me tocan team q ni conocen sinergias q prefieren ir champ brokens como un veigar con morello con 60 cs al min 20 y un graves de adc q es como regalarte 3 o 4 basicos mientras cargas, .......\n\nBronces q no aprenden, jamas mejoraran su juego","replies":[{"poster":"Hnk Kenshiro","date":"2016-11-25T22:59:05.231+0000","up_votes":13,"down_votes":0,"body":"{{champion:40}}  Chicos, es oportunidad de dragon.\n\n{{champion:64}} {{champion:236}}  _Se quedan robando golems, se flamean por quien se lo queda, van al drg cuando ya llego el team rival, y mueren._","replies":[{"poster":"Blinded by Light","date":"2016-11-25T23:07:49.019+0000","up_votes":3,"down_votes":1,"body":"Pero si lee es el soporte no deberías tener ese problema (?","replies":[{"poster":"Hnk Kenshiro","date":"2016-11-25T23:11:46.138+0000","up_votes":3,"down_votes":0,"body":"Me has pillado,\n\nTienes derecho a un deseo.","replies":[]}]}]}]},{"poster":"SpectreChazer","date":"2016-11-25T22:41:22.255+0000","up_votes":10,"down_votes":1,"body":"A mi me gusta mucho jugar supp, pero lo malo es que al acabar la partida nadie reconoce tu esfuerzo ni tus jugadas. ni cuando te sacrificas para que no maten a tu adc... Me gustaría un pequeño reconocimiento por lo menos :/","replies":[{"poster":"Tazztania","date":"2016-11-25T22:44:12.120+0000","up_votes":4,"down_votes":2,"body":"Es verdad... uno hace una jugada EPICA y al final felicitan al que esta fed jajaja pero bueno, somos los heroes que no nos llevamos la recompenza pero que estamos ahí para el trabajo sucio! \n\nigual hay veces que me dicen \"TE AMO\" cuando salvo a alguien XD","replies":[{"poster":"Flánn","date":"2016-11-26T05:06:42.449+0000","up_votes":3,"down_votes":0,"body":"Me recuerda al meme de Optimus Prime el cual decia \"Nosotros los protejemos aunque ustedes no noten nuestra presencia\" es asi solo que creo le cambie algunas palabras.","replies":[]}]}]},{"poster":"Yo la amaba wum","date":"2016-11-26T01:01:54.797+0000","up_votes":5,"down_votes":0,"body":"Sinceramente, no, no disfruto jugar Supp, soy mas de cualquier cosa, menos ADC y Supp, pero si me toca ir cualquiera de esos roles, no me quejo, igual depende de la partida, hay partidas taaaaan aburridas y eso hace la diferencia, ademas de que los support son muy poco emm reconocidos le podria decir, el mid se manda una play, por ejemplo una Syndra, Q + Q + R, \n\n{{champion:122}} : GJ Syndra\n{{champion:64}} : Buena Syndra\n\nEn cambio, un supp se manda la tremenda play, salva a su adc, salva a su jg, pero que pasa? Si andas con suerte a lo mas te llegara un \"gj\", o cuando fedeas a tu adc, si, esas Vaynes que salen 8/0 de linea y te vas a wardear un rato o a roamear y la pobre en ese rato queda 8/3 y las puteadas adivina para quien son... \"Dale gil sos el support, por que no estas conmigo, pone wards, ayudame en algo\"... Pero bueno, son cosas que pasan, yo ultimamente elogio mucho a los support, por que se lo que se siente mandarse tremenda jugada y nadie te reconozca, o todos los elogios se los lleva el que mas mato, siendo que sin el trabajo del support, ni sabrian lo que es una kill, en pocas palabras, recuerden siempre apoyar a todos los del equipo y si logran  sacar una kill, drag, o cualquier objetivo, felicitarlos, eso al menos a mi me hace jugar mejor.","replies":[]},{"poster":"Dildo de Moria","date":"2016-11-25T23:10:59.599+0000","up_votes":5,"down_votes":0,"body":"La verdad prefiero ir otra cosa, ahora con tanto Rengar, Zed y otros asesinos tengo que, con mis supports de utilidad, lograr que no maten a mi adc en 0.2, y lo peor es que cuando ves la marca de Rengar y la sombra de Zed haces lo posible para hacer que el chabon viva pero es imposible.","replies":[]},{"poster":"BlueDragon17","date":"2016-11-26T18:09:32.466+0000","up_votes":4,"down_votes":0,"body":"Es demasiado aburrido ir support por que casí nadie reconoce tus buenas acciones :c {{summoner:3}} Aguante MID {{champion:134}}","replies":[{"poster":"FurchiDC","date":"2016-11-27T04:26:35.191+0000","up_votes":2,"down_votes":1,"body":"¿Me llamaban :D? Ah xD\n\n[](http://.)\n[](http://.)\n_________________________________\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]}]},{"poster":"Texter Redrum","date":"2016-11-25T22:52:57.445+0000","up_votes":4,"down_votes":0,"body":"¿Antes no se jugaba leona? Siempre jugué leona y me fue bien, no entiendo por qué decían que estaba fuera de meta.\n\nSobre el tema del post, me da igual, me gusta jugar a mi y supp es una línea en la que me mentalizo de que puedo jugar más relajado sin consentrarme en el daño.","replies":[]},{"poster":"megotron","date":"2016-11-26T11:58:12.226+0000","up_votes":6,"down_votes":2,"body":"{{champion:201}} {{champion:44}} {{champion:12}} {{champion:111}}  con estos champs yo logre carrear partidas q parecian perdidas,saben porq?\nporq un supp no se rinde nunca y va a dar lo maximo hasta el ultimo momento de la partida","replies":[]},{"poster":"Inspirado","date":"2016-11-26T18:41:23.980+0000","up_votes":3,"down_votes":0,"body":"jugar supp en elos bajos es horrible.\n\nTodos los mejores adc saben jugar supp, yo mismo lo expiremente mi peor linea era adc pero desde que pusieron esa cola q demora años en encontrar partida jugue mucho supp y me di cuenta de muchas cosas y mejore muchisimo como adc .\n\nEn resumen si disfruto jugando supp pero es muy frustrante cuando tu adc es menso jaja.{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Ellora","date":"2016-11-26T15:19:59.434+0000","up_votes":3,"down_votes":0,"body":"El tema que el rol de supp (los convencionales) pierde peso en ligas bajas porque la gente es bastante manca, necesitas que el team sea minimamente entre decente/bueno para poder carrear como soporte.\nPara que se entienda, en un equipo de futbol podes tener un arquero impenetrable, pero si los de tu equipo no coordinan los 2 pies olvidate.","replies":[]},{"poster":"FedecarboneroUY","date":"2016-11-26T00:39:00.229+0000","up_votes":3,"down_votes":1,"body":"{{champion:432}} y {{champion:412}} .. lo más divertido que debe de existir.\n\nen especial {{champion:432}} , el troll por excelencia de este juego (incluso más que {{champion:7}} ,{{champion:35}} o {{champion:17}} ).","replies":[{"poster":"La corrupción","date":"2016-11-26T01:03:44.926+0000","up_votes":2,"down_votes":0,"body":"{{champion:8}} es el unico que lo iguala a bardo","replies":[{"poster":"FedecarboneroUY","date":"2016-11-26T01:36:38.802+0000","up_votes":2,"down_votes":0,"body":"mmm pero el vladi nuevo? mmm..","replies":[{"poster":"La corrupción","date":"2016-11-26T02:29:08.294+0000","up_votes":3,"down_votes":0,"body":"charquito y deja pasar el cohete de jinx a su adc con 200 de vida...\n\nni hablar de como trollea a los enemigos","replies":[]}]}]}]},{"poster":"feed no jutsu","date":"2016-11-26T01:27:27.386+0000","up_votes":3,"down_votes":0,"body":"Me encanta jugar support la mayoría de las veces pero cuando te toca un adc flamer que cuando avisas que vas a wardear un bush se tira 1 vs 2 y te echa la culpa o el adc que te quiere corregir por todo, esto se hace así, esto no, que asco que sos, etc, o el típico adc que no sabe lo que hace el escudo reliquia.\n\nCuando tu adc muere por un asesino va a echar la culpa al soporte, esta medio dificil ahora con el nuevo item para los asesinos mientras llevas un supp de utilidad, pero se hace lo que se puede.","replies":[]},{"poster":"TSW Rorschach","date":"2016-11-26T00:48:23.462+0000","up_votes":4,"down_votes":1,"body":"Soporte es el único rol en el que puedo disfrutar bien el juego, en los otros me pongo demasiado serio xd (sobretodo con adc y el asunto del farmeo, tengo complejo de Nasus). No me estreso, no lo sé :v me es divertido jugar supp y correr cuando alguno de tu team se suicida (o con Tahm que te comés a uno para salvarlo y el salame se va a morir de nuevo), o cuando todos te focusean y tu team gana tf, supongo que es un conjunto de cosas.\n\nNo soy bueno con el asunto de qué campeón estará mejor en la temporada, pero a {{champion:89}} {{champion:412}}  {{champion:12}} {{champion:223}} {{champion:201}} {{champion:267}} {{champion:40}} los veo fuertes si son bien usados(?) yo ando jugando mucho {{champion:89}} y {{champion:201}} ahora que están gratis.","replies":[]},{"poster":"Mazoku","date":"2016-11-25T22:38:14.467+0000","up_votes":5,"down_votes":2,"body":"Disfruto jugar support. Sin embargo, me enferma mal no poder seleccionarlo como rol primario o secundario porque SIEMPRE te toca y me aburre SIEMPRE jugar el mismo rol.","replies":[]},{"poster":"Neo Gaussrik","date":"2016-11-26T22:01:30.538+0000","up_votes":6,"down_votes":3,"body":"+1 aca!\n\nMi soporte favorito para la \"temporada de asesinos\" es {{champion:26}} por razones obvias, pero no me queda tan claro que tengamos un meta de asesinos despues de todo. ;)","replies":[{"poster":"Seven Teemo Army","date":"2016-11-26T22:43:07.774+0000","up_votes":2,"down_votes":0,"body":"El meta es de tanques y luchadores.","replies":[{"poster":"wattefak","date":"2016-11-26T23:52:18.795+0000","up_votes":2,"down_votes":0,"body":"https://media.giphy.com/media/rxfCALcFg8EOA/giphy.gif","replies":[]}]},{"poster":"XMasterLasheronX","date":"2016-11-26T22:58:10.491+0000","up_votes":2,"down_votes":0,"body":"Riot Gaussrik una Pregunta: Piensan Rewordkiar el Splash Art De Jax ? a uno mas moderno porque veo que Jax se esta usando un poco mas :3","replies":[]}]},{"poster":"Fedejp","date":"2016-11-26T19:55:03.024+0000","up_votes":2,"down_votes":0,"body":"es lindo ser support cuando tu team es una mierd4 y podes hacer nada siendo support jajaja poop de post","replies":[]},{"poster":"GøD Cąrry","date":"2016-11-26T09:12:01.370+0000","up_votes":2,"down_votes":0,"body":"tengo epocas, no es mi linea preferida pero no me desagrada ir, el unico problema es que es complicado jugar sup si no es con un duo que conozcas bien","replies":[]},{"poster":"Ghalen","date":"2016-11-26T00:29:07.226+0000","up_votes":1,"down_votes":0,"body":"Hay mucha gente a la que le gusta ser soporte (incluyéndome), pero es una posición que suele usarse como chivo expiatorio (al igual que el jungla) cuando las cosas empiezan a salir mal.\n\nSi a eso le sumamos que su función no se basa en matar, sino en hacer de custodio / niñero y que los campeones soportes naturales, no son precisamente los más \"cool\", entonces termina quedando bastante atrás en popularidad, especialmente en una comunidad donde el jugador promedio es un puberto que quiere ser un ninja, samurái o cualquier otra cosa estilo \"badass\" que mate rápido y mucho.\n\nPor eso es que el soporte tiene el \"estigma\" totalmente infundado y erróneo a mi entender, de ser una posición típicamente femenina.\n\nRespecto a soportes poderosos para la S7, no es un área donde pueda opinar ampliamente, porque siempre fui bastante antimeta, así que lo dejo para alguien más.","replies":[{"poster":"La corrupción","date":"2016-11-26T01:06:17.688+0000","up_votes":2,"down_votes":0,"body":"Riot debería simplemente sacar soportes con kits divertidos, no tiene mucha ciencia, los unicos asi hasta ahora son bardo thresh y en todo caso zilean taric y poppy, 5, de 30 supps mas o menos 5 son realmente divertidos en su kit... al menos en mi opinión","replies":[]}]},{"poster":"pajarit0","date":"2016-11-26T19:41:23.843+0000","up_votes":3,"down_votes":1,"body":"No","replies":[]},{"poster":"KennyZambada","date":"2016-11-26T13:27:12.069+0000","up_votes":3,"down_votes":1,"body":"Me Gusta jugar supp mientras me dejen usar a : {{champion:202}} {{champion:254}} {{champion:222}} {{champion:51}} {{champion:99}} AD \n:v","replies":[]},{"poster":"Runth","date":"2016-11-26T02:36:29.986+0000","up_votes":3,"down_votes":1,"body":"si quieres ser un supp de verdad tienes q arriesgarte para proteger el adc , he tenido varios sacrificios tirando flash con las ultis de impactos de cait o jinx o hasta una tf de 4 haciendome sushi y el adc corriendo con la vida baja focuseado y salio ileso y yo cagado con pantalla gris, las malas partidas q tuve y ver si el adc no es de utilidad, no puedo hacer nada para ayudarle\n\nhasta q el adc vio la situacion y chatea un gran \"gracias\"\nhe robado drakes y baron con una habilidad, y pocos dan cuenta\n\npor eso me frustra ir ese rol, no todo es poner warcitos y pasear feliz y cantando mias , odio esos supp asi, casuales son, soporte no es una mamadera , es un rol de un jugador mas","replies":[]},{"poster":"ALEXKOND","date":"2016-11-26T01:54:10.764+0000","up_votes":3,"down_votes":1,"body":"Si\n\nHonestamente no creo que cambie mucho el soporte con los asesinos ya que si se popularizan lo más probable es lo hagan más los tanques en top, por ende los soportes actuales que pueden mantener a sus aliados protegidos van a seguir siendo usados.","replies":[]},{"poster":"EclipseOfWinter","date":"2016-11-26T01:14:01.815+0000","up_votes":3,"down_votes":1,"body":"Yo empecé a jugar la temporada 5 y con {{champion:37}}  llegué a platino, ésta season no tuve mucho tiempo para jugar pero {{champion:89}} me llevó a platino también, cuando recién empecé a jugar me gustaba ir mid con {{champion:34}} pero me gusta mucho jugar support, ahora me está llendo bien con {{champion:43}} aunque recién la estoy empezando a usar.","replies":[]},{"poster":"TecheX","date":"2016-11-25T23:49:45.166+0000","up_votes":3,"down_votes":1,"body":"no me gusta ir soporte... ya que estas veces el sistema me obliga a irme esa linea, y lo juego de mala gana y aun yendome de soporte los ADCs no tienen la mas palida idea de como kitear,cuando tradear o que hacer. y yo que voy JG o ADC no me toca esos roles, me veo un poco mas ducho en esas lineas, no digo que sea re bueno ni mas.. pero bue....{{sticker:zombie-brand-clap}}","replies":[]},{"poster":"Rikka Takänashi","date":"2016-11-25T22:42:29.256+0000","up_votes":3,"down_votes":1,"body":"a mi me divierte supp, es una de las lineas en que mejor me va y mis favoritos son {{champion:53}} {{champion:201}} {{champion:111}} {{champion:98}} {{champion:89}} {{champion:427}}","replies":[]},{"poster":"LukerioLok","date":"2016-11-25T23:12:25.184+0000","up_votes":3,"down_votes":2,"body":"Me encanta ser supp es un rol que maineo (no lo juego tanto, pero es el que mas me gusta).\nEn si soy bastante variado a la hora de elegir rol, me da lo mismo jugar un rol, los que mas disfruto esta season son supp y mid","replies":[]},{"poster":"Nisman on bush","date":"2016-11-25T22:39:55.223+0000","up_votes":3,"down_votes":2,"body":"ami me encanta pero cuando te encontras cada personaje que te trolea por querer pushear a lvl 1 la wave para conseguir el lvl 2 primero (sin robarle minions) te pinguean a morir y empiezan a trolear xq no haces lo que dicen... o cuando te tocan los carrys ya sean adc o mid que se posicionan como un alistar en una tf... te sacan todas las ganas,... y lamentablemente en ranked 0% de win rate como sup asi que hice re roll a mid y top :/\n\n\nmis sup favoritos son {{champion:40}}  {{champion:16}}  {{champion:267}} {{champion:43}} ","replies":[]}]}