{"poster":"sillystorm","date":"2016-07-09T11:42:24.832+0000","title":"A Draconian Understanding","subforum":"FanFiction","up_votes":3,"down_votes":2,"body":"Shyvana was waiting by a gnarled and dormant tree while a familiar breeze rustled its branches. There wasn&rsquo;t anything particularly special about this place; the view was simple, the tree similar to many, and the ground worn with patches of dust. There was no sentimentality either. Even so, she would return for a brief time to rest in the dusk, and her once lone respite from the eyes of the people she walked amongst every day calmed her. Alas, a comet which lanced the grey twilight some days past intruded on Runeterra, as did Shyvana&rsquo;s regular late reprieve. \r\nHer cool skin took a bluish light as the awaited creature of stars and fire approached the isolated tree. Aurelion Sol never really was subtle, yet Shyvana had long since allowed his presence. She didn&rsquo;t mind his company so much after the first few challenges upon meeting an all-powerful, conceited being. As usual there was only a moment of silence before Aurelion Sol spoke, &ldquo;Evening, Shyvana. I trust that you have thought on my suggestion?&rdquo;\r\n\r\n&ldquo;I understand you feel I am more entitled but I am half human. Not to mention spurned regardless.&rdquo; Shyvana replied.\r\n\r\n&ldquo;Hmph.&rdquo;\r\n\r\nThey lapsed into silence. It was peculiar since Aurelion Sol simply did not let a point rest until Shyvana would literally walk away. She always did return the next day as long as some crisis hadn&rsquo;t occurred within the Demacian ranks. Glancing over to try and determine why Aurelion Sol was uncharacteristically quiet, she noticed him spinning his stars tightly above his claw, as if in deep thought. He breathed a sigh before broaching his next question. \r\n\r\n&ldquo;As you are part of the Demacian guard, wouldn&rsquo;t you say they have accepted you? Unworthy as they are regardless of how formidable you claim them to be.&rdquo; Aurelion Sol dubiously asked.\r\n\r\n&ldquo;Possibly. It doesn&rsquo;t change who I am, and how the humans think of me. They fear me, as I feel they should, yet I still wonder if any of them would be so accepting if it weren&rsquo;t for their Prince.&rdquo;\r\n\r\n&ldquo;Ah yes. Loyalty to blood. Primitive really.&rdquo;\r\n\r\n&ldquo;It is still more than what the Runeterran dragons have shown me. Considering how my father and I were ostracised and hunted, one may think I am not the only halfling Runeterra has seen but perhaps the only one to have survived so long.&rdquo; Shyvana bitterly retorted.\r\n\r\nAurelion Sol considered her for a moment. The sky was gradually getting darker and the brightest of stars were slowly being revealed in the deep purple night. It made discerning Shyvana&rsquo;s expression difficult, but it was obvious that she felt little other than contempt towards the dragons of this world. She breathed out slowly as she glanced up to decide if she should linger any further.\r\n\r\n&ldquo;Before you leave, tell me a joke, Shyvana.&rdquo; Aurelion Sol requested.\r\n\r\nShyvana turned to him with an eyebrow raised as if to say &lsquo;what?&rsquo;. He simply looked at her expectantly. The corner of her mouth rose slightly as she replied,\r\n\r\n&ldquo;What do you get when a dragon sneezes?&rdquo;","replies":[{"poster":"Sexy Jack Rabbit","date":"2016-07-09T16:11:01.766+0000","up_votes":1,"down_votes":0,"body":"GAH QAQ You can't leave it like that!!","replies":[{"poster":"sillystorm","date":"2016-07-13T09:29:43.124+0000","up_votes":1,"down_votes":0,"body":"It's Shyv's joke man xD \n\"What do you get when a dragon sneezes?\" *chuckles* \"... out of the way.\"","replies":[]}]}]}