{"poster":"Goontaker","date":"2017-11-30T08:17:59.749+0000","title":"I got an S in a ranked game but did not get a mastery token","subforum":"Help & Support (OCE)","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"https://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/193435884/200112624?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":4,"down_votes":0,"body":"As the title says, I finished a ranked game and got an S but did not get a token. I re-logged and checked my loot but it still wasn&#039;t there. Something similar happened when I got an S- in a normal game and did not get a chest. Please enlighten me on my situation {{summoner:13}}","replies":[{"poster":"Ninox","date":"2017-12-02T01:53:21.379+0000","up_votes":1,"down_votes":0,"body":"Okie dokie guys, I've been told if you submit a support ticket about the issue I believe they can compensate you, it was a known issue and has since been fixed. I will warn you now though that they won't be able to give you the actual tokens, for much the same reason they can't compensate with LP when that messes up.","replies":[]},{"poster":"JTD","date":"2017-12-01T21:27:54.861+0000","up_votes":1,"down_votes":0,"body":"i also submitted a bug report for this issue as i received 2 S' in consecutive games received no chest or mastery token.\nalso in match history the rank of my play does not show up next to the exp as it does in earlier games.","replies":[]},{"poster":"Ninox","date":"2017-12-01T13:20:33.110+0000","up_votes":1,"down_votes":0,"body":"Sorry for the late reply, I'll see what I can dig up for you, not sure if this is a known/isolated issue.","replies":[]},{"poster":"SteveDala","date":"2017-11-30T12:55:30.171+0000","up_votes":1,"down_votes":0,"body":"I just went S- with Janna in a bloody difficult ranked game and I didn't receive a 6 token either. I only need one more for level 6 mastery. What's going on here?","replies":[]},{"poster":"Shmillon","date":"2017-11-30T10:11:23.917+0000","up_votes":1,"down_votes":0,"body":"Same with me I currently have level 5 mastery on ezreal, and gotten multiple S's and no mastery token in ranked. However I got an S on lee in a normal and got a token. So I'm wondering if this is a ranked bug?","replies":[]},{"poster":"Chromatex","date":"2017-11-30T09:03:49.352+0000","up_votes":1,"down_votes":0,"body":"I'm having the same problem. I've earnt Ss on my past few ranked games, however, have received no mastery tokens. I've also found that a few of my grades don't show up in my match history. Some help would be much appreciated! :)","replies":[]}]}