{"poster":"Riot NeuroCat","date":"2018-06-20T17:29:07.928+0000","title":"Fizz Change Heading to PBE","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hi all,\n\nI&rsquo;m NeuroCat, a Game Designer at Riot. I previously worked on Remake and Honor, and I&rsquo;m now working with the Champions team on some smaller projects, starting with Fizz.\n\nWe&rsquo;re shipping some small Fizz changes to PBE for feedback. Since the Assassin Rework, we&rsquo;ve heard a lot of dissatisfaction from Fizz players around his current W. The waiting game around the charging bleed mark is healthier (by increasing Fizz&rsquo;s burst window), but feels awkward to use and unintuitive to a lot of you. Our **primary goal** with these changes is to replace the mark charging mechanic and Fizz&rsquo;s current W with a more satisfying and intuitive version of W (while maintaining the delay on Fizz&rsquo;s full burst).\n\n**Current Changes to W**\n\n* REMOVED - W passive marking targets for 6s (note: the 3s bleed DOT still exists!)\n* REMOVED - W active dealing triple damage when hitting a mark-primed target\n* NEW - W active now has second cast, similar to the first, but dealing more damage (especially against low health enemies)\n * Bonus Damage on Hit:\n   * First W: 10/20/30/40/50 + 40% AP\n   * Second W: 35/50/65/80/95 + 50% AP (+0-100% increased damage based on enemy % health missing)\n * 1s lockout on recasting W\n   * Using W on a target slowed by Chum the Waters allows W to be recast instantly\n* Mana refund amount reduced 20/28/36/42/50 &gt;&gt;&gt; 10/14/18/22/26\n * Mana refund applies to both casts individually\n* REMOVED - Cooldown reduction when killing any unit with W active\n\nThe updated W has two casts, both reset Fizz&rsquo;s auto-attack and deal bonus damage on hit. The first deals lighter damage; the second deals heavier damage, especially when the enemy is low on health. There is a lockout between the two casts, so you&rsquo;ll need to stay in combat if you want to get your full damage off (or play around priming his W casts). We still want you to be able to unload your full combo onto enemies you hit with your shark, so you&rsquo;ll be able to recast instantly when you W a &ldquo;sharked&rdquo; target. Along with these changes, we&rsquo;ve also tuned his damage a bit so Fizz&rsquo;s ability to scrap in lane at early levels should be higher (instead of having to sit back and wave clear until 6).\n\nKeep in mind, with these changes, we&rsquo;re not looking to update Fizz or make large scope changes, just smooth down a consistent pain point for Fizz players. We&rsquo;ll be listening to feedback and iterating as we let these changes sit on PBE for a little while, so to be clear, these changes **will not ship in 8.13**.\n\nIf you play with these changes on PBE, please leave some feedback if you&rsquo;re able. Thanks!\n\n-NeuroCat\n \n&nbsp;\n------\n&nbsp;\n&nbsp;\n    **6/21/18 Update**\n\nFirst, I want to thank you all for the feedback, especially for you who have had a chance to try him out on the PBE. I'm trying to read it all, even if I don't have time to respond to it all. \n\nI'm going to try to summarize the broad themes of feedback I'm hearing from you all, and my brief thoughts:\n\n* **\"Revert Fizz's W to pre-Assassin Rework\"** \n * We aren't planning on doing this, since we believe that this model isn't particularly healthy, especially with a high AP assassin. While I agree that the deceptive damage and 'whittling-you-down' feeling around the empowered bleed do feel \"tricky\" and playing into Fizz's nature, we ultimately want to make Fizz's windows of power and burst more clear and consistent to Fizz players and opponents.\n* **\"Make Melee Range Shark Viable/Revert the Shark changes\"** \n * We aren't bringing back the old R, but we intend to make your melee range ult a bit more effective with these changes. In the case where you do land a melee range ult, you can unload your W burst immediately, which should make this case feel more powerful/give you more options.\n* **\"Will this change make Tank or On-Hit Fizz crowd out AP Assassin Fizz?\"**\n * We will be trying to make sure we aren't shifting too much power away from AP Assassin Fizz. You'll notice in some of the changes below we're shifting more power into his AP ratios.\n* **\"His Damage Seems Low\"**\n * From the PBE testing we've seen, we think his damage numbers are around where we intended, but it doesn't feel as impactful, due to the missing health execute damage on the second W. I'm trying an iteration below where we remove this in favor of just flatter damage on his second W.\n* **\"Without the W reset on kill, his laning/farming under turret is going to be terrible\"**\n * We tried some iterations of the new W with this, but they either had really unintuitive interactions or gave him a lot of strong wave-clearing power with no real downtime for his opponents to play around. So we aren't currently planning on adding this back, but want to make sure his laning phase and ability to farm still holds up without it (even if it might be less safe to just farm with it under turret). Below I'm increasing the mana refund on his W, and I'll be looking for other ways to increase his farming ability if we find it insufficient - keep in mind, the second cast is free, so this change will effectively make it mana neutral for him to last hit with it.\n\nHere are some changes that will land on PBE tomorrow:\n\n* Mana refund on kill with W: 10/14/18/22/26 >>> 15/20/25/30/35\n* W2 Damage:  35/50/65/80/95 + 50% AP (+0-100% increased damage based on enemy % health missing) >>>  35/50/65/80/95 + 90% AP\n\nThank you again for your feedback so far. Over the weekend, please give it a shot on the PBE and let me know how it feels. I'll likely have another update like this sometime next week.\n\n&nbsp;\n------\n&nbsp;\n&nbsp;\n    **6/25/18 Update**\n\nHey all,\n\nI want to thank you for all the feedback being posted. On these Boards, Reddit, Youtube, Twitter - we've been listening to your thoughts on these Fizz changes. \n\nOur initial goal with the new W was to make a lightweight change and see if Fizz players enjoyed a different input for W. But from what we've heard from the majority of Fizz players, you enjoy the current live W over the experimental changes. So we're going to be pulling these changes out from PBE. If there is a clear opportunity for the right Fizz changes in the future, we're open to it, but we don't want to force changes to live that Fizz players don't want.\n\nThank you again for your input. {{champion:105}} ","replies":[{"poster":"hackney24","date":"2018-06-21T06:59:51.443+0000","up_votes":15,"down_votes":1,"body":"All the outcrys of fizz mains are for the W to be shifted back to the old dot, if riot isnt willing to do that then just leave him the same as he is. These changes are just making him worse. Trading cs reset and overall damage for 1 sec less on his gate and some early kill pressure is laughable.","replies":[]},{"poster":"FancyKiddo","date":"2018-06-20T21:43:19.706+0000","up_votes":18,"down_votes":5,"body":"Interesting.  I'm glad to see Fizz getting work, even if I'm not super on board with this first iteration.  And I'm glad they don't have Phroxzon on it again: I think he burned all the bridges with the Fizz community the last time y'all touched the fish.\n\nI've long been a Fizz player, and his rework in the assassin update killed not just the champion for me, but also was the start of the end of playing at all.  I haven't played since Kai'sa's release, I think.  I'm hoping that the changes to Fizz will be good enough to convince myself to get back into it!\n\nOne thing I'm curious about: why are y'all so hesitant to bring back the old \"W empowers your AAs for a while\" paradigm?  As I see it, the best change for Fizz's health was \"guppy shark\" in close range, the removal of the \"jump on someone and slap an unmissable ult on them from melee range\" playstyle.  As for the newer versions of W, it just seems like they've all tried to do what the previous W already did, except they've been more clunky and worse for (my favored position) jungle Fizz.\n\nAs far as I see it, old W spread out its damage just fine, and created real decision-making that is lacking in the current iteration of Fizz.  Old W, you _didn't_ want to stab someone, pole, and stab them again, where their only counterplay is to try to move out of your range (since you're invulnerable in the W cook time).  You wanted to stay in melee range, getting off as many AAs as possible.  If they forced you to pole during your W uptime, you traded damage for safety.  It was a good interaction between Fizz and his opponent.\n\nAs for this new version of W, I don't see how it's better than the current one, and I definitely don't see how it's better than the old one.  I guess it lets you get two Lich Blade procs?  Even that doesn't seem like a great thing, since it ties him even more to an item.\n\nIf you wouldn't mind, would you address why old W is bad, and how you think new W is an improvement over current W?  Thanks!","replies":[{"poster":"Forsyte Vann","date":"2018-06-21T05:48:32.108+0000","up_votes":11,"down_votes":2,"body":"Honestly? I wouldn't mind either a full revert to Fizz or him staying as he is right now, rather than this.","replies":[]},{"poster":"Sw4de","date":"2018-06-21T01:54:33.175+0000","up_votes":10,"down_votes":4,"body":"Just completely revert this failed rework, there is nothing intuitive or logical about a 100% melee champion who literally can't fight you at all outside of melee range being punished for engaging a fight in melee range, it is absolutely absurd and illogical for his kit, if they had problems with his q into R being an undodgeable ult then nerf that interaction and put a lockout on his Q, the roundabout way they chose to remove that interaction by destroying everything that was fun or interesting about the champion just left every former fizz main with a bad taste in their mouth\n\nWe are getting the shit sandwhich all over again, this does nothing to change his disgustingly linear playstyle of long range ult-> mash all the buttoms -> is enemy dead? good? is enemy alive? you lose because now youre practically a glorified fucking canon minion with nothing to do\n\nWe had a nice defined power curve of very weak early->scale with game time, now we have disgusting rubbish early-> OP midgame-> disgusting rubbish late game again, theres just nothing fun or intuitive at all with what they did to this champion that was in a fine spot before the failed assassin rework that was based on a failed premise, nearly every other failed rework was reverted or close to completely reverted and fizz should get the same treatment rather than being given another shit sandwhich and telling us to enjoy","replies":[]}]},{"poster":"Fizz n Flips","date":"2018-06-21T05:50:21.353+0000","up_votes":11,"down_votes":0,"body":"First I was interested in the rework, but after testing, thinking about and considering a few things I'm sadly just disappointed...\n\n\nThe rework missed its intended target completely in my opinion.\n\n**Laneing-Phase/Fights:**\nThe new W has no CD-refund anymore which makes the Laneing-Phase worse. You can now easier be punished by pushing you under the tower because your W has a 10 / 9.5 / 9 / 8.5 / 8 cd per 2 cs. Makes the wave-clear from {{champion:105}}  even worse. Even in Fights if he manages to last hit, the W goes on CD which is basically a big dissadvantage.\n\n**Lock-Down:**\nThe lock-down is basically the current W but worse. The Refund is heavy dependent on the Ult R slow, which can be removed ({{item:3140}} ,{{summoner:1}},{{champion:25}}-shield) and reduced ({{item:3111}}, which makes it really hard to retain the Lock-Down refund. Additionally its really harder to use it in time considering no visuals and the distances and close-ups. (basically 1.5secs to reaction time) (6 seconds against 3.5 seconds if I'm generous)\n\n**Damage: **\nThe damage difference is noticeable, too. The damage basically is lower than the old one if you don't junk your enemy by 50-55% its health, which basically is a tough act in alot scenarios. [Damage Graph. \n](https://ggbm.at/qJwGPTbJ) (Please correct me if I did something wrong. I missed out the bleeding damage, because it didn't changed)\n> Along with these changes, we’ve also tuned his damage a bit so Fizz’s ability to scrap in lane at early levels... \n\nNot at all. The damage is highly depending on the enemy but overall I would consider Fizz' damage clearly nerfed.\n\nEdit: **Range**\nI'm not certain about this but: is the Empowered W ranged now gone? Because what many people don't know is the proc of the Empowered W has a higher range and can sometimes hit enemy dashing. Which was currently a good counter tool to the limited range/time problem... if this is gone now it makes the W even worse.\n\n**Ideas:**\n{{item:3057}}/{{item:3100}}: We all know in a fight it has to go fast so you basically want to pull off you damage fast. Especially Assassins which aren't tanks. (duh) Best case scenario with the new W: W(AA) + W(Single Cast) + 1sec* + W(recast) \n(*1 sec ignored by Ult slow)\nYou might think: You can proc {{item:3057}}/{{item:3100}} multiply times, right? Wrong! Your cast lock down is 0.5 to short. Basically even this idea to use this disadvantage to an advantage is not given.\n\n**Review:**\nI know it is hard to come up with a good idea for a rework... I can't tell it for sure but I feel people want to have the old W back, but not considering the problems involved with it. I can understand that people see the W as clunky but the current W is not the worst. _(The old W probably never come back. That is something people just need to understand.)_\nThe suggested rework feels not good to play because you have to much to consider now (over-complicated/not really fluently/natural). The trade-offs are mostly not worth the effort (low damage) and the Lock down feels like barrier more than the waiting time now.\nThe current idea for a rework is the worst out of both worlds (prerework and now) in my opinion and I would highly prefer a different idea (from scratch)\n\nI'm really sorry if that sounds to hard. But this is clearly a nerf to me and missed the idea of this rework completely...\n\nI hope I could give some constructive feed-back.","replies":[]},{"poster":"Forsyte Vann","date":"2018-06-20T19:44:15.576+0000","up_votes":15,"down_votes":4,"body":"\"Awkward an Unintuitive\"\nTo... hit once, wait, and hit again?\n Im sorry, but i fail to see how a doublecast with lockout (I know is the same amount of damage) is more intuitive, specially if you put a condition to remove the lockout with the shark. \nAnd even then, it's a nerf on the damage, considering you'd get the triple amount of damage if the target has low health, rather than this being a set flat amount. If you wanted to poke, you simply WQ'd into the enemies and then jumped out.\n{{champion:105}} _Hmm... Something's Fishy_\n(edit: I remembered that lich bane exists and this could help you proc it twice, so my point for damage is invalid. Still, it does not seem more intuitive)","replies":[{"poster":"Forsyte Vann","date":"2018-06-20T19:54:48.033+0000","up_votes":9,"down_votes":2,"body":"Another point is, what's wrong with Fizz? As in, in the sense that he was first a bruiser/assassin, with the W that enhanced autos for a while.\nThen you turned him into a hit and run, full  assassin. (right now)\nUpcoming changes  : A weird... hybrid...? \nIt doesn't seem healthy, IMO, to have players change their playstyle so much for a character.","replies":[]},{"poster":"Riot NeuroCat","date":"2018-06-20T20:47:28.162+0000","up_votes":9,"down_votes":7,"body":"I'd encourage you to give it a shot on the PBE and see how it feels (more or less awkward/intuitive). To give you an idea, the cadence is similar to last hitting a minion with W on live and it getting the cooldown reset. In terms of damage, I think it should be higher when they are low health, but we can always tune numbers if things are off.","replies":[{"poster":"Forsyte Vann","date":"2018-06-20T20:56:10.986+0000","up_votes":6,"down_votes":1,"body":"The problem with that is that is not the same thing. last hitting a minion with a W now was just a small mana sacrifice with the refund. Now is the mana sacrifice and the cooldown.  If the cadence is more or less the same thing, it might solve that corcern, but the cooldown reset allowed this slippery boy to actually perform in teamfights. Example, hit your shark or Q to multiple champions. Manage to kill a champion with the  active W, you can keep doing damage.\nIf that's gone, that'll force him to.. sit it out until he has  the W again. Even if the CD starts at first cast, it'll still leave a  3-4 seconds difference he has to... just sit out. He might be able to sit half of that out with his E, but then you're forcing a set pattern of combo to survive and deal damage. and still have to wait out , rather than being a trickster and use your E in the best moment: Offensively and defensively at once.\nThat's just talking  about teamfights. Minion clear will suffer HORRIBILY from the reset removal. Now you have to kill two  minions in  an 8  second cooldown doublecast.","replies":[]}]}]},{"poster":"Riot NeuroCat","date":"2018-06-21T21:02:12.393+0000","up_votes":11,"down_votes":28,"body":"**6/21/18 Update**\n\nFirst, I want to thank you all for the feedback, especially for you who have had a chance to try him out on the PBE. I'm trying to read it all, even if I don't have time to respond to it all. \n\nI'm going to try to summarize the broad themes of feedback I'm hearing from you all, and my brief thoughts:\n\n* **\"Revert Fizz's W to pre-Assassin Rework\"** \n * We aren't planning on doing this, since we believe that this model isn't particularly healthy, especially with a high AP assassin. While I agree that the deceptive damage and 'whittling-you-down' feeling around the empowered bleed do feel \"tricky\" and playing into Fizz's nature, we ultimately want to make Fizz's windows of power and burst more clear and consistent to Fizz players and opponents.\n* **\"Make Melee Range Shark Viable/Revert the Shark changes\"** \n * We aren't bringing back the old R, but we intend to make your melee range ult a bit more effective with these changes. In the case where you do land a melee range ult, you can unload your W burst immediately, which should make this case feel more powerful/give you more options.\n* **\"Will this change make Tank or On-Hit Fizz crowd out AP Assassin Fizz?\"**\n * We will be trying to make sure we aren't shifting too much power away from AP Assassin Fizz. You'll notice in some of the changes below we're shifting more power into his AP ratios.\n* **\"His Damage Seems Low\"**\n * From the PBE testing we've seen, we think his damage numbers are around where we intended, but it doesn't feel as impactful, due to the missing health execute damage on the second W. I'm trying an iteration below where we remove this in favor of just flatter damage on his second W.\n* **\"Without the W reset on kill, his laning/farming under turret is going to be terrible\"**\n * We tried some iterations of the new W with this, but they either had really unintuitive interactions or gave him a lot of strong wave-clearing power with no real downtime for his opponents to play around. So we aren't currently planning on adding this back, but want to make sure his laning phase and ability to farm still holds up without it (even if it might be less safe to just farm with it under turret). Below I'm increasing the mana refund on his W, and I'll be looking for other ways to increase his farming ability if we find it insufficient - keep in mind, the second cast is free, so this change will effectively make it mana neutral for him to last hit with it.\n\nHere are some changes that will land on PBE tomorrow:\n\n* Mana refund on kill with W: 10/14/18/22/26 >>> 15/20/25/30/35\n* W2 Damage:  35/50/65/80/95 + 50% AP (+0-100% increased damage based on enemy % health missing) >>>  35/50/65/80/95 + 90% AP\n\nThank you again for your feedback so far. Over the weekend, please give it a shot on the PBE and let me know how it feels. I'll likely have another update like this sometime next week.","replies":[{"poster":"Fizz n Flips","date":"2018-06-21T21:26:01.753+0000","up_votes":22,"down_votes":3,"body":"In my opinion: Just revert these changes. \n\nI personally know its hard to come up with a good solution (I personally know there is not really a easy one) but these changes clearly make just everything worse.\n\nIts more than just damage (besides its clearly weaker than the current Fizz... dunno how you testing it).\n\nIt feels awful and mechanically just not thoughtful. At all.\n[-] Ult synergy almost none-existing and easy counter able.\n[-] Double-cast- Lock-down feels unnatural/not fluently\n[-] Counter potential increased\n[-] CS'ing without CD-refund bad\n[...]\n\nMy best bet (because of lack of good options), is just keep it like it is. Every adjustment might/probably make him worse.\n\n[I would recommend my complain-list... ](https://boards.na.leagueoflegends.com/en/c/developer-corner/huEn04VG-fizz-change-heading-to-pbe?comment=003d) and don't hesitate to destroy it, bit by bit, to maybe come up with a better and different concept-\n\nJust say at least... Increasing damage doesn't do the trick... I personally don't care about the damage at first place if the mechanic feels like a crutch.","replies":[]},{"poster":"MidasRegality","date":"2018-06-21T22:25:01.735+0000","up_votes":6,"down_votes":1,"body":"Whatever happened to getting on the FizzMains subreddit? There's been a lot of good feedback there.  Personally, i disagree with your sentiment of a revert. Just lower his damage if you guys are that afraid of him.","replies":[{"poster":"Clôude","date":"2018-06-22T19:13:22.416+0000","up_votes":8,"down_votes":1,"body":"Tank fizz wasn't even strong and ap fizz was in a good spot before the assassin rework hit.","replies":[]}]},{"poster":"Forsyte Vann","date":"2018-06-22T11:30:28.913+0000","up_votes":4,"down_votes":1,"body":"+90% of the people here are begging Riot to not make these changes, to either revert him or just leave him as it is, as they are just terriible. Again, the problem is NOT the mana for the farming. Is the cooldown. You can't lower the base cooldown because that'd be too much damage, and without his W reset on kills, he can't consistently farm, as the extra damage made it for him relatively safe to actually secure a minion.\n\nWe are giving you our feedback, and the team seems to be outright ignoring it. If these go through, i am not going to touch him ever, again.","replies":[{"poster":"Dont gank Mîd","date":"2018-06-23T01:15:35.153+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Forsyte Vann,realm=EUW,application-id=A7LBtoKc,discussion-id=huEn04VG,comment-id=004f0016,timestamp=2018-06-22T11:30:28.913+0000)\n>\n> +90% of the people here are begging Riot to not make these changes, to either revert him or just leave him as it is, as they are just terriible. Again, the problem is NOT the mana for the farming. Is the cooldown. You can&#x27;t lower the base cooldown because that&#x27;d be too much damage, and without his W reset on kills, he can&#x27;t consistently farm, as the extra damage made it for him relatively safe to actually secure a minion.\n> \n> We are giving you our feedback, and the team seems to be outright ignoring it. If these go through, i am not going to touch him ever, again.\n\nexactly! Once you get use to that w reset, you are addicted to it.","replies":[]}]}]},{"poster":"FattyDrake","date":"2018-06-21T01:56:36.821+0000","up_votes":9,"down_votes":0,"body":"I've tried Fizz for a bit on the PBE today (will still keep playing thru the week) and I have an honest question (and legitimately not trying to be snarky or anything):\n\nRiot NeuroCat, what do you want Fizz to be?\n\nDo you want him to remain an assassin, or push him more into an AP fighter space?\n\nWith this W change, he feels less smooth, which I think is the opposite intent of this change. The differences of W in lane and W during ult make him feel clunky, which is the best way I can put it. Yes, I can get two W's off during ult, but the AA W reset W then delay on AA feels worse than just having AA W reset, AA W reset in lane (maybe because that feels closer to what his W is now. Honestly, the way it is on live, if not ideal, is at least satisfying to use. The new W isn't satisfying.) I can see the new W opening up a couple more options in lane with regards to fighting.. but, it doesn't feel like an assassin's ability.\n\nJust for kicks, I tried a Triforce, Ravenous Hydra, Rageblade build. Just for kicks. But it honestly _feels so much smoother_ with this build than with AP items. Nashor's Tooth also seems better on him now (and helps with his burst) but you still have to deal with the clunky W delays.\n\nWith the non-optimal build I just listed, I was able to Q AA W AA Hydra W AA very quickly and it just felt great. But that's a fighter combo, not an assassin one. (He did significant damage with that too, and his ult burst was only very slightly less than if he had a 3 item AP build that includes Nashors (plus Lich Bane and Zhonya's.)\n\nI can't stress this enough though: Fizz _felt_ better to play with those items. But that's the style of a fighter. You want him to stay in combat (and risk being CC'd and bursted down because he's squishy), but again, that's the style of a fighter. Yet you don't want to let him have the durability to survive staying in a fight. And you don't want him to be a trickster and get out thanks to the high cooldown of his E. He's melee yet he is punished on multiple levels for being in melee range. There's other hybrid fighters that do the job much better than Fizz. There are other assassins that do a better job than Fizz.\n\nHe doesn't even feel good or smooth to play anymore. There are smoother, more slippery, more tricky champions than the Playful Trickster.\n\nI feel that Riot does not know exactly what they want Fizz to be anymore.","replies":[]},{"poster":"edoxbox1","date":"2018-06-20T18:27:15.663+0000","up_votes":2,"down_votes":1,"body":"> ~~* Mana refund amount reduced 20/28/36/~~ **42**/**50 ** ~~>>> 10/14/18/~~ **22**/**26**\n>  ~~* Mana refund applies to both casts individually~~\n\nEhm\nWhy not **21**(+21=42) and **25 **(+25=50) ? lol","replies":[{"poster":"Riot NeuroCat","date":"2018-06-20T18:47:28.246+0000","up_votes":8,"down_votes":0,"body":"Because holy hell the fact that it jumped from +8/+8/+6/+8 per rank made the OCD side of me want to change it.","replies":[]}]},{"poster":"Kadexe","date":"2018-06-20T19:04:02.420+0000","up_votes":5,"down_votes":5,"body":"Why can't his ult be reverted to deal the same damage at any range?","replies":[{"poster":"Riot NeuroCat","date":"2018-06-20T19:36:05.595+0000","up_votes":7,"down_votes":6,"body":"The ult changes in the Assassin rework created healthier counterplay for opponents and introduced some elements of decisionmaking, so I don't think we're looking to change those anytime soon. However, you'll notice with these changes that Fizz's burst case from melee range ulting someone is better, since you don't have to wait for your mark to prime (and instead double cast W instantly).","replies":[{"poster":"Kadexe","date":"2018-06-20T20:41:41.338+0000","up_votes":13,"down_votes":5,"body":">The ult changes in the Assassin rework created healthier counterplay for opponents and introduced some elements of decisionmaking\n\nNow wait a minute, one of the most common complaints I've seen about the rework is that Fizz is now pigeonholed into combos that lead with Chum the Waters. Which removes a lot of decisionmaking. His combos have nowhere near the same breadth and flexibility as assassins like Talon, Ekko, or even Evelynn. That's why players stopped playing him even though he's just as strong as he was before the rework.","replies":[{"poster":"Forsyte Vann","date":"2018-06-20T21:10:25.234+0000","up_votes":8,"down_votes":1,"body":"Not... really, in my opinion. Before  the first update, the thing you could do: Start with Ult to have some crowd control to reach them, or use it as massive damage for a finish off.\nThere is decision now: The range: DO you want a sure hit at short distance for  a small reward? Or do you want to risk it and give your enemies time to react with your ult, giving you more power and area of effect as a reward?\nYou do have more choices now. Just less rewarding when used close range","replies":[{"poster":"Fisherman Fizz","date":"2018-06-20T23:23:15.599+0000","up_votes":5,"down_votes":0,"body":"With how drastic the difference is between ults, there is no real decision making because the small one is almost always wrong. Hitting the melee ult is more of a mistake than a conscious decision.\n\nAnd then because the bigger ult is almost always the correct decision, it means that you're more limited in how you approach a fight because you have to start with the ult every time.\n\nSo then your decision making is almost always the same: once their hp is in lethal range throw out the longest range ult you can, and then use the standard burst combo after because they can't do anything about it at that point. If it misses then go back to farming until ult is up again. Whether you want the smaller but easier to hit ult or the larger, more difficult one is a non-factor.","replies":[]}]}]}]}]},{"poster":"Murr Wurr","date":"2018-06-20T18:44:40.521+0000","up_votes":2,"down_votes":1,"body":"Could you explain the logic behind removing the CD reset of his W after killing a minion?\n\nA lot of Fizz mains actually liked this change and it greatly helped getting through tough laning phases like Azir, Ryze, Malz, Brand etc.\n\nI just feel like his laning phase either playing agressively or defensively have been severely weakened by this change.","replies":[{"poster":"Riot NeuroCat","date":"2018-06-20T19:19:49.156+0000","up_votes":3,"down_votes":1,"body":"The CD reset on killing a minion did feel really good to play with I agree, so I tried to keep in on the ability is long as I could. However, different iterations on the new W with this either had really unintuitive interactions or gave him a lot of strong wave-clearing power with no real downtime for his opponents to play around. So we killed it, but want to make sure his laning phase still holds up without it (putting power into his scrapping vs his passive farming ability).","replies":[{"poster":"The Djinn","date":"2018-06-20T20:01:25.725+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Riot NeuroCat,realm=NA,application-id=A7LBtoKc,discussion-id=huEn04VG,comment-id=000b0000,timestamp=2018-06-20T19:19:49.156+0000)\n>\n> The CD reset on killing a minion did feel really good to play with I agree, so I tried to keep in on the ability is long as I could. However, different iterations on the new W with this either had really unintuitive interactions or gave him a lot of strong wave-clearing power with no real downtime for his opponents to play around. So we killed it, but want to make sure his laning phase still holds up without it (putting power into his scrapping vs his passive farming ability).\n\nOut of curiosity, have you considered making his DoT have a bit of an execute buffer to help him with that? The ability to stick a DoT on a minion that's ALMOST dead and then do something else knowing that you won't randomly have it time out and lose the kill by 3 health might make his farming feel significantly better, so having the DoT do something like automatically kill minions it leaves below 5% health or something might be worth exploring.","replies":[]}]}]},{"poster":"Riot NeuroCat","date":"2018-06-25T19:35:15.650+0000","up_votes":10,"down_votes":3,"body":"Hey all,\n\nI want to thank you for all the feedback being posted. On these Boards, Reddit, Youtube, Twitter - we've been listening to your thoughts on these Fizz changes. \n\nOur initial goal with the new W was to make a lightweight change and see if Fizz players enjoyed a different input for W. But from what we've heard from the majority of Fizz players, you enjoy the current live W over the experimental changes. So we're going to be pulling these changes out from PBE. If there is a clear opportunity for the right Fizz changes in the future, we're open to it, but we don't want to force changes to live that Fizz players don't want.\n\nThank you again for your input. {{champion:105}}","replies":[{"poster":"hackney24","date":"2018-06-26T01:11:38.032+0000","up_votes":4,"down_votes":0,"body":"We don't \"enjoy\" current W, or we wouldn't be asking for changes.. Its just that the pbe changes were that bad lol.","replies":[]},{"poster":"Landorin","date":"2018-06-25T22:32:18.075+0000","up_votes":4,"down_votes":0,"body":"What is the outlook on getting a more comprehensive look at Fizz? Or even a consideration of partial revert? I'm glad these changes didn't go through because I don't think they improved much, but Fizz is still in Rengar/Leblanc territory after the assassin reworks and a lot of his dedicated player base isn't really happy with his current state at all, despite him being fairly strong.","replies":[]},{"poster":"BleKz","date":"2018-06-26T03:08:37.323+0000","up_votes":3,"down_votes":0,"body":"Please try a version of old W but without the % missing health on dot or tide it to entire AP scalings. You'll kill tank builds if uou force him to build ap to make W do damage and will retain what Fizz players liked, fluidity","replies":[]},{"poster":"Cosnirak","date":"2018-06-26T03:07:22.130+0000","up_votes":4,"down_votes":1,"body":"Thank you! Thanks for doing the right thing despite it being the hard thing. And thank you for putting in the work to test out changes in the first place. They may have not worked out but it's still good that you tried and did a good job talking to the community about it.","replies":[]}]},{"poster":"Garzevogghg","date":"2018-06-20T19:56:13.968+0000","up_votes":11,"down_votes":4,"body":"How is this supposed to be more intuitive? This just seems clunky.","replies":[]},{"poster":"Fisherman Fizz","date":"2018-06-20T21:26:09.319+0000","up_votes":7,"down_votes":1,"body":"Hey, I'm glad there's finally some Fizz changes coming! I'll add a new post to this when I'm home tonight and can try out changes, but for now I'll try to say my initial thoughts.\n\nFor perspective, I've maimed Fizz since his release date in 2011. I'm currently Dia in NA and peaked in master/challenger in Season 4 before any of his previous rework.\n\nI have 3 main pain points around the current state Fizz is in:\n\n1. Lack of DPS/loss of fighter characteristics. This is caused by both the loss of meaningful DoT damage and shift in W towards one single AA nuke.\n\n2. Linear/binary gameplay and lack of variability with how you can use skills. This is caused by the conditionals added to his W/ult limiting the amount of viable combos you can pull off. All ins generally have to start with ult because its useless once you've closed into melee. General trades force you to use E to stall out W timer instead of getting to use it skillfully to dodge stuff.\n\n3. His ult feels awful. I want to fight people in melee range. I could not possibly care less about being a teamfight initiator. Just let me start fights in close range please.\n\n__________\n\nFirst impression of this W change is neutral towards addressing those things. It helps some areas but makes others worse. A bigger question that comes into my head is \"why not just revert it instead? That's what most Fizz mains want.\"\n\nFor dps fighter elements, this changes seems like it can sort of \"feel\" more like a fighter since you get an extra auto to work with, but appears to make his DPS worse. The CD starting after the 2nd cast drastically lowers how many times you get to use it as well as losing the reset on champion kill when timed right. Overall this seems like a neutral change or maybe a bit worse than before.\n\nFor lack of options with using abilities this seems like it marginally helps. No longer having a 2 second timer means that you're less restrained on how you use your E, which is great, but the new W still has a timer on it. His all in also stays pretty binary and boring, but thats because of his ult and can't be fixed with W changes. \n\nThird pain point doesn't really get addressed at all here since this is only changing his W, so no feedback there, other than reiterating that I really think if youre going to change fizz, you should consider adjusting the scope to include the ult as well.\n\n______\n\nOther feedback:\n\nHow does this new W interact with his Q? Does it still aoe apply the dot? Honestly if it does you can just get rid of it as it seems like a waste of power budget without the mark. Before you could AoE to out lots of marks on and W them faster, but now this seems unnecessary.\n\nI feel like this many auto resets isn't needed or could get clunky. He now has two auto resets + you can auto cancel again with Q. I'm worried this is going into clunky territory but ill have to confirm this on PBE.\n\nThe timer on W seems a bit awkward/unintuitive. The timer is one second, but to get the most out of it you'll want to wait 2 seconds for the extra sheen proc. When ulting it seems weird that the timer just goes away, and you still have to wait for the ult to go off anyway to get more damage amp from missing hp anyway. Camille Q seems much more fluid in execution and flows better in her kit than this W appears to.\n\nFarming/waveclear seems to be hurt here. I think that's ok or can be a good thing, although I'm worried this change could go to far towards hurting his farming. Id like to see a middle ground where he can choose to give up his burst cd for farm without it taking to long to come back.\n\nWhy exactly is reverting his kit like you did with LB/Rengar so bad? A lot of your things you're saying like delaying damage or having to stay in range longer still work with his old kit. You have to stay in melee range to get off multiple autos with his old W as well as having more reliance on the DoT/missing hp damage  I feel like if bruiser Fizz was an issue it could be resolved through adjusting base damage/ap ratios to require higher amounts of AP.\n\n_____\n\n\nAnyway these are my thoughts now. I'll play him on PBE and give feedback on that as well. I'll also try to make some video clips if any good moments for feedback show up.","replies":[{"poster":"Fisherman Fizz","date":"2018-06-21T06:03:03.870+0000","up_votes":6,"down_votes":0,"body":"Hey, I've tried him a bit on PBE. I'll keep adding more to this as I try it out more/get used to the new damage values and such, and hopefully I'll be able to add video soon, but Plays.TV wasn't working on PBE for some reason so I don't have any for now.\n\nAnyway here's my feedback after trying changes out a bit. I would say overall my reaction to the changes is more negative after trying it than I was expecting.\n\n1. The amount of awkwardness/clunkiness was much higher than I expected. I was expecting it to be fairly straightforward to pick up since I've played every version of Fizz so far, but it was actually rather unintuitive trying to use the new W at first and still is now. Trying to time the second W cast to fit in an extra sheen proc feels really awkward and in general it feels like the amount of conditionals that have to be met to get your ideal damage off is a bit overwhelming. This is really bad for me personally, because one of my main issues with Fizz is that he already had too many conditionals added into his kit. I wanted to see less, not more.\n\n2. Tbh I was expecting this new W to be doing some spicy damage. What I got felt sort of underwhelming for the amount of extra effort that's needed to proc it, as well as the farming ability I'm sacrificing for this thing. It doesn't really feel like it has the \"oomph\" factor the current W has, nor does it really have the fighter/dps feel that the old W has. Not good.\n\n3. The ideal sort of pattern of getting your auto resets off feels like it's pretty unfeasible to actually do in practice unless you're really ahead or playing in a lower Elo. And giving up your auto resets feels bad when you need to get your damage out faster. It feels like you're too squishy a lot of the time to actually be getting this off realistically, and when you do it feels too clunky to actually be satisfying anyway. I tried playing bruiser once to see if this helped, and it feels much easier to actually get this sort of trading pattern off that way, but at the same time it felt like I was just playing an inferior version of camille when I tried bruiser items.\n\n3a. I was hoping this would open up more fun builds like on-hit with Nashor's Tooth and such, but they feel pretty bad still because of reason 3.\n\n4. I have an easier time farming/clearing waves as Pyke mid than I do this version of Fizz. Not much else to really say here, it's just that bad. I'm actually in favor of removing some of his farming ability that the W resets gave him, but this feels like too much was taken away. I think Fizz's original W was a nice middle ground because you had a window where you could farm with it and usually get most of the wave, and when it went on CD you were more vulnerable, but the CD wasn't too long so it felt ok. The current cooldown for his W feels awful especially when you run into a situation where you have nothing to auto and just have to let the timer run out. \n\n5. The Q is still applying the DoT in aoe. Honestly just remove this, the DoT is so weak that you can barely even notice it anyway and it doesn't do nearly enough to fix his farming issue.\n\n6. It seems like maybe there's a bit more room to use the shorter range ults and still have lethal on someone? I'm pretty happy about that. I still think the disparity between the two ults is too large though, but maybe doing something to flatten the damage numbers on each a bit to be closer together would help alleviate this pain point rather than a full mechanic revert? Imo I don't mind that the shorter range ult has such a smaller AoE; it's the damage being so much lower than makes it feel so bad.\n\n7. Overall I don't feel like these changes have really done much of anything to address my pain points, but have instead added new issues that make him less fun to play than even the current Live version. I'm happy that you guys are looking into Fizz changes, but I really don't think this is the right direction to go in. I would be ok with waiting a bit longer and getting a larger scope revert more like what LeBlanc/Rengar got. I don't mind waiting more to get the same level of care that those champs got.\n\nAlso just to reiterate, just because most of my feedback is negative doesn't mean I'm annoyed. I'm just trying to give my honest thoughts so yall can make the best changes possible. ","replies":[]}]},{"poster":"Slusher","date":"2018-06-22T00:16:54.597+0000","up_votes":7,"down_votes":1,"body":"I honestly don’t understand how you can reconcile not reverting Fizz ult for gameplay health with the Leblanc revert.","replies":[]},{"poster":"BleKz","date":"2018-06-21T22:44:07.951+0000","up_votes":7,"down_votes":1,"body":"Not really a fan of this changes. As someone who played a lot of games at Fizz and achieved Master on EUW with him as my main champ, I think I understand where the bad feeling come from and can speak for the entire Fizz community with my proposed changes : \n\nMake W Empower the next 2 AA (Ala Nami's E, but 2 hits instead of 3), won't feel clunky due to not having recasts and won't be 2 different from 1 second recast due to Fizz's AS values.\n\nIf the first hit kills a minion, its cooldown and mana are refunded but will consume the second charge.\n\nAnd that's about it, another option will be to give him 3 charges instead of 2 and adjusting the damage accordingly, tho I still don't understand why it can't just be a on-hit damage spell like it used to be but without % missing health ratios anywhere/them scaling with ap. Its just Rengar and LeBlanc all over again, in those cases also someone at Riot refused to gave us something that at the end it has been proved to be perfectly balanceable (Both LeBlanc and Rengar atm have stuff that was tagged as impossible to balance). Funny enough, both of them are one of the most balanced champs in league of legends history at this exact moment.","replies":[]},{"poster":"NotRed","date":"2018-06-21T07:24:46.670+0000","up_votes":5,"down_votes":0,"body":"Please just keep it as it is now or revet it to how it was. I love fizz hes my top played champ but ever since  the rework it just fees so bad, dont get me wrong iv had a hand full of fun games with him but its no where near what he use to be and this change is going to take away the only thing that was some what working with his rework. Please just give him his dot back or leave him be till you will.","replies":[]},{"poster":"EyesOfTheFox","date":"2018-06-20T17:40:20.534+0000","up_votes":3,"down_votes":7,"body":"I think this is a good quality of life change. I didn't realize I was getting one shot because it did triple dmg just for having auto'd me one time. The fact he has to recast it to get the bonus dmg adds a little more skill and some people will probably mess that up from time to time meaning it's not even guaranteed. He also has to pick his targets more carefully to get that extra dmg due to the target having to be low health. Hopefully this feels better to play against.","replies":[{"poster":"BobaFlautist","date":"2018-06-20T18:21:06.107+0000","up_votes":5,"down_votes":0,"body":"You have to recast it on live too - the way it works, his auto or ult puts that little trident indicator above your head, and when the indicator fills up his w on you will consume it to do 3x damage.","replies":[]}]},{"poster":"farmwolf","date":"2018-06-24T12:15:47.375+0000","up_votes":4,"down_votes":0,"body":"takling about another though smaller Fizz rework raises the question why he was even changed first place.\n\nFizz' dot was not OP or unfair back in season 3, it perfectly fitted his style, helped with last hitting and it taught people to be careful and not to underestimate his damage and slipperyness if they were low and he still had enough mana -  and not to feed him too much.\n\nInstead of tuning the dot and forcing players to learn how to deal with him, rito chose to remove it in order to protect them, taking power and fun away from Fizz.\n\nIt felt so satisfying diving somebody who overstayed under his turret, jumping out and watching his last few HP trickle down while you walk away in Fizz' relaxed walking style. It made up for all those games where you got smashed by someone out-ranging and out-poking you so hard that you couldn't even dream of assassinating some half-dead cannon minion.\n\nHaving an ability which does more damage to low-health champions and enabling you to use it at the beginning of a fight if your ult hits seems a clueless and slightly desperate thing to do.\nTotally opposed to having your ult amplifying all damage you dealt, which is straight-forward and feels rewarding.\n\nPlus, different behaviour of an ability under different circumstances is really counter-intuitive in itself.\nI don't like his present W at all, but this..  slightly clueless try-and-error - approach on the topic is not leading anywhere, IMHO.\n\n\non the topic of champions becoming less fun to play and more and more complex, I highly recommend ipavs videos on the topic: \npt. I  https://www.youtube.com/watch?v=MoBz_Z24xwA\npt- II https://www.youtube.com/watch?v=LasZ0TmwLkE","replies":[]},{"poster":"boulhyalmoujahid","date":"2018-06-21T08:43:45.857+0000","up_votes":3,"down_votes":0,"body":"I just miss the Q+R combo and I don't know why it was removed","replies":[{"poster":"Bakhti Arakeel","date":"2018-06-21T09:22:51.668+0000","up_votes":1,"down_votes":1,"body":"Because it was cancer to play against.","replies":[{"poster":"spØilers1","date":"2018-06-22T03:23:46.494+0000","up_votes":4,"down_votes":0,"body":"oh yeah and leblancs w-q-r-e definitely wasn't cancer, and neither was rengars triple q combo, but they got reverted, so why can't fizz be?","replies":[]}]}]},{"poster":"Xiao Long Bae","date":"2018-06-21T01:39:00.373+0000","up_votes":4,"down_votes":0,"body":"> REMOVED - Cooldown reduction when killing any unit with W active> \n\nwait how am i gonna farm early...","replies":[]},{"poster":"La Bello","date":"2018-06-20T21:10:47.477+0000","up_votes":4,"down_votes":0,"body":"was hoping for something a LOT bigger than just more auto resets.\n\nFizz right now has a problem for me at least where he feels way too binary and flowchartish.\n\nYou max range your R fish\n\nwait for the knock up and get on the troll pole\n\nslam down and hit em with a Q+W.\nNot only is this pretty much Fizz's optimal combo its like his ONLY combo ever since the R changes.\nnot gonna lie im super disappointed but then again its expected considering how much you guys hate outright replacing abilities vs smaller functionality changes.\n\nIF you ever take another look at Fizz please consider adding\n\n1. a REAL innate passive like other champions get (why not put his DoT passive here or something if you think its so important to Fizz's kit personally I never cared much for it tbh. I never understood how seawater/brine worked as poison)\n2.  W reworked into another tool that lets him outplay his targets somehow. a third re-positional ability would be awesome but I feel like its kinda pushing it. I want to have to same crazy high octane moments Shadow Swap/Shunpo give. Right now  I feel like Fizz has to use Playful/Trickster for Damage 80% of the time so you dont really get to have these same sort of cool skill expressive moments outside of lane trades in my experience.\n3. Changes to R to make it less... browbeating in how it wants to be used. I want to go back to using the Q+R mini combo (that shit looks so cool!) and not losing like half of my damage for using it point blank. Maybe you could change R to execute damage?OR make the Slow scale with fizz size rather than damage? just tossing some ideas out there...\n4. For some reason Fizz's damage is like EXTREME overkill from beginning to end( this might be because he literally has 4 burst abilities). Im not sure how much of this is because of electrocute but I wouldnt mind toning down the damage in trade for more utility or mobility. Lategame I feel like Fizz is way WAY WAYYYY too dependent on Zhonya's to get anything done and not die INSTANTLY.It would be really nice to see something that alleviates how mandatory this item is. (maybe introduce a way for Fizz to reset Playful Trickster?!)","replies":[]},{"poster":"Fisherman Fizz","date":"2018-06-25T22:53:25.798+0000","up_votes":3,"down_votes":0,"body":"I'm glad you guys are listening instead of forcing the changes through. Are there any plans to revisit Fizz sometime soon? I think most people would still like some changes even if this specific W change wasn't the right one.","replies":[]},{"poster":"H30N","date":"2018-06-20T18:28:28.517+0000","up_votes":2,"down_votes":4,"body":"No Dot? Sure. But no cool down reduction???? Riot what? Also, the trident system before was fine. First of all, it gave fizzes time to move around and dodge skill shots while it charged if they were engaging without ult, and if they were engaging with ugly then, ult-> q->full E w/slow->W was enough time to price the 3x damage. No one asked for this change... leave it alone.","replies":[{"poster":"Riot Scruffy","date":"2018-06-20T18:34:44.273+0000","up_votes":4,"down_votes":1,"body":"W still has the passive dot - just not clearly mentioned in the post. We'll update it.","replies":[{"poster":"Pommel Knight","date":"2018-06-20T18:47:55.076+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RiotScruffy,realm=NA,application-id=A7LBtoKc,discussion-id=huEn04VG,comment-id=00070000,timestamp=2018-06-20T18:34:44.273+0000)\n>\n> W still has the passive dot - just not clearly mentioned in the post. We&#x27;ll update it.\n\nWhats the DMG on it, is it the same or higher. We would love for it to do more because at the moment hp pot heals over it even if you max W?\n\nOn a side note What is the cdr on new w and will we get some compensation for farming. More Base AD and scaling or flat scaling dmg on aa with w, like Kayle and Kassadin?","replies":[{"poster":"Riot NeuroCat","date":"2018-06-20T18:51:23.889+0000","up_votes":2,"down_votes":2,"body":"The bleed and the CDR are same as live right now. In tests, Fizz's farming is less consistent (more reliant on E to farm), but he has significantly more trading power in lane. Farming is ez when your lane opponent is dead/recalled.","replies":[]}]}]}]}]}