{"poster":"Glyñn 2Ø","date":"2016-11-13T02:24:49.212+0000","title":"CAN YOU GET A PERMA BAN FOR LEAVING??!?","subforum":"Player Behaviour","up_votes":1,"down_votes":1,"body":"Just wondering if you could get permabanned for leaving? Yesterday I left a game when our nexus was about to be destroyed so i could skip the cutscene. Next thing I know, I got a two week ban. I dunno if that counts as toxicity or not but now im scared that I might get perma banned. Does anyone know if you can or not? Also, is there a cooldown on ban times","replies":[{"poster":"Glow","date":"2016-11-20T18:47:31.468+0000","up_votes":1,"down_votes":0,"body":"Yes, you can. The punishments are typically as follows: \n\n- First Offense: 10 Game Chat Restriction\n- Second Offense: 25 Game Chat Restriction\n- Third Offense: Two Week Suspension\n- Fourth Offense: Permanent Suspension\n\nAs you can see, you have the two week suspension, and the next one is a permanent suspension. I would ensure that you no longer AFK/leave games for _any_ reason, and make sure you have a good internet connection/uninterrupted playtime so that you don't risk getting permanently banned. Good luck.","replies":[{"poster":"Project Xayah","date":"2016-11-20T22:55:17.217+0000","up_votes":1,"down_votes":0,"body":"If I'm not mistaken, that's the punishment \"list\" for chat related offences. In the case of leaving/AFKing in games, I believe it would be \"5 minute LPQ for 5 games\" into \"10 minute LPQ for 5 games\" into \"20 minute LPQ for 5 games\" into \"2 week suspension\".","replies":[{"poster":"Glow","date":"2016-11-22T05:07:17.034+0000","up_votes":2,"down_votes":0,"body":"My bad, you're right. The support website says it goes from 5 minute LPQ to 20 minutes, then I'm assuming after that the suspensions kick in. Thanks for the correction :)","replies":[]},{"poster":"Ninox","date":"2016-11-22T13:27:33.756+0000","up_votes":1,"down_votes":0,"body":"You are indeed correct, thanks for the update. It's also worth mentioning that if you leave in ranked you'll see those suspensions a lot faster.","replies":[]}]}]},{"poster":"Glyñn 2Ø","date":"2016-11-13T08:20:12.273+0000","up_votes":1,"down_votes":0,"body":"Just to clear a few things up:\nA. I already left a game before but that was because of unexpected lag which saw me going up to 5000 ping (Not even kidding)\nB. i didnt mean 'ban cooldown' in that sense (mb for not explaining well). What I meant was eg. if i were to stop leaving/being toxic etc for say 5 months, would my next ban (if i actually DO get banned) be permanent? or will it go back to low priority/3 day ban","replies":[{"poster":"Project Xayah","date":"2016-11-13T10:43:03.438+0000","up_votes":2,"down_votes":0,"body":"> A. I already left a game before but that was because of unexpected lag which saw me going up to 5000 ping (Not even kidding)\n\nDefinitely seems like there would be more to it than that, considering it's a 2 week ban and not an LPQ.\n\n> B. i didnt mean &#x27;ban cooldown&#x27; in that sense (mb for not explaining well). What I meant was eg. if i were to stop leaving/being toxic etc for say 5 months, would my next ban (if i actually DO get banned) be permanent? or will it go back to low priority/3 day ban\n\nIn that case then yes, the \"punishment tier\" should drop after enough time has passed without another offence of the same type. It would likely take several months to drop each individual punishment tier, so it may take several years before it reset completely.\n\nIf all the AFKs/DCs that occur for you are the rare instances that would be considered \"average\" (ISP/Computer/WIFI problems etc) then you should be fine, as it should remain inconsistent enough that the system passes it off as normal.","replies":[]}]},{"poster":"YellowFish","date":"2016-11-13T12:08:05.641+0000","up_votes":1,"down_votes":0,"body":"its legit a 10 second cut scene, idk but thats your own fault. probs got ban for doing something in game more than leaving cause of cut scene","replies":[]},{"poster":"NoMoreChillies","date":"2016-11-13T09:56:51.561+0000","up_votes":1,"down_votes":0,"body":"you  leave games you ruin it for others.\nDeserve a ban imo\nRiot needs to clean this up","replies":[]},{"poster":"Moonland","date":"2016-11-13T07:30:06.839+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure you can't get banned for 'leaving' a game like that. I'm pretty sure you need to have left the game for significantly longer than just to skip the nexus explosion. You must've left games in the past or for a much longer duration before the nexus explosion to have a leaving ban.\n\n{{sticker:slayer-jinx-wink}} ","replies":[]},{"poster":"Project Xayah","date":"2016-11-13T04:34:19.289+0000","up_votes":1,"down_votes":0,"body":"If you leave games consistently enough, you *will* receive a perma-ban. Leaving doesn't count as \"toxicity\" per-say, but it is *definitely* against the rules and does go a way to ruin the experience for *many* other players when done consistently. And no, there are no \"cooldowns\" on punishments. If you receive a punishment (like a two-week ban) then immediately continue the behaviour that got you that punishment once it ends, you are liable to receive the next punishment as early as your next match.\n\nAs a note, Leavebuster will only kick in if a player leaves/AFKs in a match for longer than 3 minutes (or 5, I'm not entirely sure). Leaving games because \"you don't want to wait for the win/loss cutscene\" is a ridiculous reason and actually doesn't save you any time, so I don't even understand why you do it in the first place.","replies":[]},{"poster":"kaboomblah","date":"2016-11-13T03:20:46.632+0000","up_votes":1,"down_votes":0,"body":"Wow, seriously? First time leaving ever and you got a two-week ban?\n\nNo past toxicity, no past leaving, no previous punishable behaviour? Just this and, bam, two-week ban?","replies":[]},{"poster":"Roguestoney","date":"2016-11-13T02:35:36.001+0000","up_votes":1,"down_votes":0,"body":"If you do it a lot sure.","replies":[]}]}