{"poster":"RazorToddy","date":"2019-07-06T19:14:02.076+0000","title":"[TFT] ¿No sabes qué build hacer? ¡Entra aquí!","subforum":"Charlas Generales","up_votes":9,"down_votes":0,"body":"https://imgur.com/6CygJuc.jpg[IMG]\r\n\r\nLo saqué de[Twitter](https://mobile.twitter.com/y0iy0_/status/1147126900759977984) y el de Twitter lo sacó de Reddit","replies":[{"poster":"TSW Rorschach","date":"2019-07-06T20:33:13.961+0000","up_votes":3,"down_votes":0,"body":"Con esto del tft para aprender siento que volví a la época donde tenía una listita pegada a la pc con los trucos del GTA.\n\nSe agradece~","replies":[]},{"poster":"ToramaruH","date":"2019-07-11T17:31:06.270+0000","up_votes":1,"down_votes":0,"body":"Digamos que estas recomendaciones muchas veces marean mas de lo que ayudan, de las composiciones que yo me armo solo encontré una mas o menos parecida que es la de caballeros y cazadores, pero aun así hay otras 4 composiciones al menos que yo uso y que ahí no están.\nY las que yo digo no son composiciones que ganan, son composiciones que explotan, con esas composiciones e remontado partidas con 5 de vida y e ganado.\nLa realidad es que todo va mas al ingenio propio que a copiar builds de la web, pero bueno a cada quien le sirve lo que le sirve.","replies":[]},{"poster":"ImNw","date":"2019-07-07T03:41:46.844+0000","up_votes":1,"down_votes":2,"body":"Este tipo de post arruinan la integridad del modo, siempre crear metas para ganar y no para divertirse, solo tryhardear","replies":[{"poster":"TSW Lifewasser","date":"2019-07-08T21:37:57.401+0000","up_votes":1,"down_votes":1,"body":"No es la integridad bro, a menos que a vos te guste perder todas las partidas de tft con el unico argumento de \"divertirte\" no tiene sentido, el chiste es ganar y divertirse, perder tambien, pero siempre se intenta buscar la victoria, no conozco a nadie que le divierta perder","replies":[{"poster":"ImNw","date":"2019-07-08T22:01:53.171+0000","up_votes":1,"down_votes":1,"body":"Ganen un monton de partidas jugando con distintas combinaciones y no sacando pyke con 2 Shojin pa.\nGane con casi todas las comps, menos con los espadachines y los luchadores que son una mi*** los 2, necesitas buffs.\nSi vos jugas para ganar dale segui sacando todas las partidas pyke con 2 shojin, re triste tu forma de divertirte.","replies":[{"poster":"TSW Lifewasser","date":"2019-07-09T01:22:15.356+0000","up_votes":1,"down_votes":0,"body":"Nunca dije que mi forma de diversion era sacar pyke con 2 shojin, tampoco dije que era la unica manera de ganar, en la imagen muestra las compos mas rentables, que a vos te guste leer lo que quieras es tu problema PA.\nY por cierto, felicitaciones por ganar, gracias por el dato.","replies":[]}]}]}]},{"poster":"Bärdero","date":"2019-07-06T22:58:19.789+0000","up_votes":1,"down_votes":0,"body":"Hola razor :v tanto tiempo xd","replies":[{"poster":"RazorToddy","date":"2019-07-07T05:47:15.097+0000","up_votes":1,"down_votes":0,"body":"Holiwis","replies":[]}]}]}