{"poster":"deusexodus","date":"2017-08-21T22:30:39.273+0000","title":"Idee für eine Verbesserung des Report Systems","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":10,"body":"Guten Tag!!!\r\n\r\nDa ich selbst in einer eher niedrigeren Elo angesiedelt bin (aktuell Gold 2), f&auml;llt einem &ouml;fters mal Fehlverhalten von Spielern auf. (ja ich denke Flame, Int,etc sind in Low elo mehr vertreten als bei h&ouml;heren r&auml;ngen.) Daher habe ich an einer kleinen M&ouml;glichkeit &uuml;berlegt, um das Report system vielleicht zu verbessern.\r\nW&auml;re es nicht hilfreich, wenn man es technisch schaffen w&uuml;rde, einen Mechanismus in das Spiel zu implementieren, welcher, wenn ein Spieler aufgrund von &quot;intentional Feeding&quot; oder einem &auml;hnlich schweren Vergehen, eine Art Ampelsystem aufgezeigt wird, damit dieser bemerkt:&quot; Oh! Ich habe mich gegen die Regeln versto&szlig;en...&quot;. Auch wenn das nat&uuml;rlich eine Wunschreaktion w&auml;re (haha). Und vielleicht nach einem gewissen Zeitraum geht die Ampel wieder zur&uuml;ck auf Gr&uuml;n und bei Spielern mit gr&uuml;ner Ampel kann man ja noch ein Ribbon anf&uuml;gen f&uuml;r wie oft, dieser im gelben oder roten Bereich war und dann &quot;Reformed&quot; wurde. Dann kann ein &quot;Instant Feedback System&quot; vielleicht auch besser &uuml;ber Au&szlig;ma&szlig; und Notwendigkeit einer Strafe entscheiden. Damit w&uuml;rde ein variables Wertesystem eingef&uuml;hrt, welches &uuml;ber das Verhalten der Spieler wacht. (Einzige Schwachstelle an dieser Idee, ist dass es bestimmt schwierig f&auml;llt die Richtigkeit eines Reports zu bestimmen...)\r\n\r\nEtwas Feedback zu der reinen Idee und weitere Verbesserungsvorschl&auml;ge w&uuml;rden mich freuen :)\r\nLG","replies":[{"poster":"MeMyselfandBaal","date":"2017-08-21T23:44:37.359+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=deusexodus,realm=EUW,application-id=KYnfKGf0,discussion-id=cX2rELZH,comment-id=,timestamp=2017-08-21T22:30:39.273+0000)\n>\n> W&amp;auml;re es nicht hilfreich, wenn man es technisch schaffen w&amp;uuml;rde, einen Mechanismus in das Spiel zu implementieren, welcher, wenn ein Spieler aufgrund von &amp;quot;intentional Feeding&amp;quot; oder einem &amp;auml;hnlich schweren Vergehen, eine Art Ampelsystem aufgezeigt wird, damit dieser bemerkt:&amp;quot; Oh! Ich habe mich gegen die Regeln versto&amp;szlig;en...&amp;quot;. Auch wenn das nat&amp;uuml;rlich eine Wunschreaktion w&amp;auml;re (haha). Und vielleicht nach einem gewissen Zeitraum geht die Ampel wieder zur&amp;uuml;ck auf Gr&amp;uuml;n \n\nDamit was passiert? Der Intentional Feeder Bescheid weiß, ab wann er sich mal wieder ein absolutes Trollgame erlauben kann ohne permanent gebannt zu werden?\n\nDerzeit sieht das Intentional Feeder System so aus: Wer dabei erwischt wird, kriegt sofort einen 14 Tages Bann. Wer dann mehrmals dabei erwischt wird, verlierst seinen Account. Das \"Problem\" ist halt, dass Intentional Feeding ziemlich selten ist und die meisten es nicht von \"hat mal ein schlechtes Spiel, welches dann snowballed, so was passiert\" unterscheiden können.","replies":[{"poster":"deusexodus","date":"2017-08-22T00:42:58.324+0000","up_votes":1,"down_votes":0,"body":"Der Gedanke dahinter war eher das man es den Spielern visualisieren kann, da es nach dem \"Instant Feedback Report\" den man ab und zu bekommt doch eher ja ich würde schon fast witzlos anfühlt. Also wenn man jemanden reported hat. \nVielleicht würde auch diese \"Brandmarkung\" einige (ich denke vorallem an  die unter 18 jähringen Spieler) \"abschrecken\".\nDen Unterschied zwischen snowballen und feeden kennen tatsächlich weniger als man sich denkt bzw diese wollen den unterschied gar nicht wissen, da jeder der mal 0/3/0 steht ein feeder ist. Selbst wenn man ohne kills trotzdem nützlich für das team sein kann, z.b. cc oder meat target","replies":[{"poster":"HyperionCH","date":"2017-08-22T07:05:25.752+0000","up_votes":2,"down_votes":0,"body":"Aber das Problem bleibt doch bei deiner Idee: sobald die Ampel wieder auf grün ist, weiss der Spieler, dass er wieder die Sau rauslassen kann.\n\nDein Vorschlag ist deshalb eher kontraproduktiv.","replies":[{"poster":"CYPHΕR","date":"2017-08-22T07:17:06.247+0000","up_votes":1,"down_votes":0,"body":"Es würden eher Spieler zu Fehlverhalten noch animiert werden, die sonst zu viel Respekt vor dem Strafsystem haben. \"Ich hab Lust nen Game so richtig zu trollen. Ampel ist noch grün? Haja ez, auf geht's!\"","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2017-08-22T10:11:43.267+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=deusexodus,realm=EUW,application-id=KYnfKGf0,discussion-id=cX2rELZH,comment-id=00020000,timestamp=2017-08-22T00:42:58.324+0000) \n> Vielleicht würde auch diese &quot;Brandmarkung&quot; einige (ich denke vorallem an  die unter 18 jähringen Spieler) &quot;abschrecken&quot;.\n\nEine öffentliche Brandmarkung hätte exakt einen Effekt: Ich würde mir, wenn ich die im Ladebildschirm sehe, sofort denken \"Shit, nen toxischer Spieler, das Spiel wird kacke.\" Oder ich würde in der Champselect sogar darüber nachdenken, dass Spiel zu dodgen... Das ist echt das Dümmste, was Riot machen kann, denn es sorgt dafür, dass du nicht mehr unvoreingenommen ins Spiel gehst...\n\nUnd nach dem ich auf einen Toxicer getroffen bin, werde ich mich nach dem Spiel fragen, warum der denn keine Rote Ampel hat... was mein Vertrauen ins Strafsystem weiter abschwächt...\nAber ja, vielleicht gäbe es 2 Spieler, die mehr Angst vor der öffentlichen Schande als vor dem Permabann haben und deswegen nicht mehr Flamen/Trollen....","replies":[]}]}]},{"poster":"necxqn","date":"2017-08-21T23:30:17.457+0000","up_votes":1,"down_votes":9,"body":"***","replies":[{"poster":"CYPHΕR","date":"2017-08-22T07:15:41.933+0000","up_votes":4,"down_votes":1,"body":"Wieso? Eher das Gegenteil würde der Fall sein, da jeder Spieler sieht wie lange er sich noch so daneben benehmen kann bevor die ersten Strafen drohen.","replies":[{"poster":"necxqn","date":"2017-08-22T12:54:46.979+0000","up_votes":1,"down_votes":7,"body":"***","replies":[{"poster":"Sirrkas","date":"2017-08-22T13:13:12.445+0000","up_votes":5,"down_votes":1,"body":"Oder, wenn das System ihn so schon nicht erkennen konnte, die Ampel würde für ihn nie von grün auf gelb wechseln.","replies":[{"poster":"necxqn","date":"2017-08-22T13:21:23.447+0000","up_votes":1,"down_votes":9,"body":"***","replies":[{"poster":"Temudschinn","date":"2017-08-22T13:49:52.753+0000","up_votes":4,"down_votes":1,"body":"Die Ampel muss aber auch von irgendwas ausgelöst werden...also hat sirrkas absolut recht.","replies":[{"poster":"necxqn","date":"2017-08-22T13:56:34.510+0000","up_votes":1,"down_votes":7,"body":"***","replies":[{"poster":"Sirrkas","date":"2017-08-22T14:00:20.549+0000","up_votes":4,"down_votes":1,"body":"Weil du so tust, als ob das die Lösung aller Probleme wäre, obwohl es mindestens eben so viele Probleme hat, wie das aktuelle System.","replies":[{"poster":"necxqn","date":"2017-08-22T14:13:27.666+0000","up_votes":1,"down_votes":9,"body":"***","replies":[{"poster":"Temudschinn","date":"2017-08-22T14:43:58.398+0000","up_votes":6,"down_votes":1,"body":"Sorry, aber der einzige Unterschied von der vorgeschlagenen Idee zum bisherigen System ist die Geschwindigkeit, mit der Strafen ausgesprochen werden (und die Tatsache dass man die Spieler ausführlicher vorwarnt). Bisher wird beim ersten klaren Inten eine 2-Wochen-Strafe ausgesprochen, neu würde einfach die Ampel auf Gelb wechseln. DAS IST DER EINZIGE UNTERSCHIED. Und jetzt kommst du und meinst, dass dies helfen würde, bisher unentdeckte Sabotage zu finden. Und wenn man dich dann darauf hinweist, dass dies keinen sinn ergibt, kommt\n\n> man merkt bei dir jedesmal aufs neue, wie kritisch du einer freien Meinung eines anderen gegenüberstehst.","replies":[{"poster":"necxqn","date":"2017-08-22T15:33:38.726+0000","up_votes":1,"down_votes":9,"body":"***","replies":[{"poster":"Temudschinn","date":"2017-08-22T16:02:37.772+0000","up_votes":4,"down_votes":1,"body":"Ist dir eigentlich klar dass das, was du schreibst, logisch absolut keinen Sinn ergibt?\n\nDa steht ein Vorschlag, der die Bestrafung von Intentional Feeding weniger drastisch machen soll. Du findest das gut. Ich sage dir, was dieser Vorschlag bewirken würde und jetzt meinst du plötzlich es sei dir EGAL, was der vorschlag eingentlich war! Stattdessen schreibst du Dinge über unmöglich/möglich, die einfach NICHTS mit dem hier besprochenen Vorschlag zu tun haben.\n\nUm bei deinem Mondflug-Beispiel zu bleiben: 1927 hat jemand ein Auto erfunden, das Furzgeräusche macht beim Fahren. Einige fandens witzig, die meisten nervig, nur Necxqn stand nebendran und fand \"hm, lass uns mit dem Ding zum Mond fliegen\". Die Menge lachte ihn aus und erklärte ihm, dass ein Auto nicht fliegen kann. Daraufhin meinte Nexcqon aber nur \"mir ist doch egal WOMIT wir zum Mond fliegen. Irgendwie wirds schon möglich sein!\".","replies":[{"poster":"necxqn","date":"2017-08-22T23:14:49.866+0000","up_votes":1,"down_votes":6,"body":"***","replies":[{"poster":"Temudschinn","date":"2017-08-23T16:30:11.830+0000","up_votes":2,"down_votes":1,"body":"> Ich habe doch nie darum gebeten, das jemand mir sagt, was es bewirkt geschweige dich nach deiner Meinung gefragt ! was ist daran bitte nicht zu verstehen? wenn du unbedingt diskutieren musst, wende dich an den herrausgeber des Threads und nicht an mich , meine Güte bist du nervig...\n\n1. Du schreibst in einem öffentlichen Forum und fragst damit JEDEN nach seiner Meinung.\n2. Wenn dich der Inhalt des Threads und dessen Auswirkungen nicht interessieren, sondern es dir um etwas völlig anderes geht, schreib dieses völlig andere doch in einen passenden Thread oder eröffne einen passenden.\n3. Wenn ich dich nerve: Antworte halt nicht mehr :)\n\nAlles in allem muss man wohl sagen, dass Shadir Recht zu haben scheint :D","replies":[]}]}]},{"poster":"Shadir","date":"2017-08-22T15:59:40.488+0000","up_votes":2,"down_votes":1,"body":"Troll detected","replies":[]}]}]}]}]},{"poster":"CYPHΕR","date":"2017-08-22T14:07:19.390+0000","up_votes":4,"down_votes":0,"body":"Es klingt halt grade nach:\n\n\"Negatives und desktruktives Verhalten muss bestraft werden!\" - \"Ja aber wie willst du das umsetzen?\" - \"Ja was weiß denn ich?!\"\n\nDass es schlecht ist, dass solche Spieler es schaffen unbemerkt durch das System zu rutschen, das wissen wir alle. Aber einfach nur zu sagen \"macht das besser!\" ohne auch nur die kleinste Idee der Umsetzung zu haben... Und nein, das Ampelsystem wie bisher beschrieben ist kein Lösungsansatz, da es nur eine Umschreibung für \"negatives Verhalten muss bestraft werden\" ist, was niemanden weiter bringt.","replies":[]}]}]}]}]}]}]},{"poster":"Temudschinn","date":"2017-08-22T09:06:49.380+0000","up_votes":3,"down_votes":1,"body":"Stimmt. Die heutige Strafe ist ja ein Witz, wen kümmert schon ein 2Wochen-Ban. Stell dir nur vor, du hättest ne Ampel, die durch inten auf Gelb geht. AUF GELB! Da würdens sich die Leute sicher zweimal überlegen.","replies":[]}]},{"poster":"Sirrkas","date":"2017-08-22T11:11:59.128+0000","up_votes":2,"down_votes":1,"body":"Zum einen bin ich mir nicht sicher, ob du meinst, dass die Ampel dann im Profil oder der CS für alle ersichtlich sein soll. Zum anderen, wäre das eher ein Freifahrtschein für Fehlverhalten, da jeder genau weiß, wie weit er von einem Bann entfernt ist.","replies":[]},{"poster":"Kind Prow","date":"2017-08-22T14:38:36.905+0000","up_votes":1,"down_votes":0,"body":"Würdet ihr euch als Reformed bezeichnen?\n\nHachja, wer war das noch mal....?","replies":[]},{"poster":"Time2Whine","date":"2017-08-22T09:26:12.158+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=deusexodus,realm=EUW,application-id=KYnfKGf0,discussion-id=cX2rELZH,comment-id=,timestamp=2017-08-21T22:30:39.273+0000)\n>\n> Guten Tag!!!\n> \n> Da ich selbst in einer eher niedrigeren Elo angesiedelt bin (aktuell Gold 2)..................... (ja ich denke Flame, Int,etc sind in Low elo mehr vertreten als bei höheren rängen)\n\nIn höheren Elos ist das gefühlt mehr vertreten als in lower Elo, weil die Leute einfach aufgrund deiner Elo erwarten dass du keine/kaum Fehler machst. Sobald welche passieren geht der Tilt los. Die Gründe mögen andere sein, doch sind alle Elos von der Toxitity eher gleich, die Flamer/Feeder/Inter gibts überall.\n\nZu deiner Fragen:\n\nDieses Ampelsystem gibts doch schon gerade bei Flame. Die Stufen lauten:\n\n10 Spiele Chatrestriction\n25 Spiele Chatrestriction\n14 Tage Bann\nPermabann\n\nBeim 14 Tage Bann wird noch einmal deutlich darauf hingewiesen, dass jeder nächste ach so kleine Flame zum Permabann führen kann. Wenn man es dann immernoch gecheckt hat sein Verhalten zu ändern verdient den Bann, daher braucht man keine weitere Andeutung dass man mit seinem Verhalten zu weit geht. Zumal jeder bei seinem Bann seinen Chatlog erhält der zum Bann geführt hat. Mehr Hinweise auf Fehlverhalten braucht man meiner Meinung nicht.","replies":[]},{"poster":"thefire7","date":"2017-08-21T23:21:36.047+0000","up_votes":1,"down_votes":0,"body":"Meiner Meinung nach in 1er division und diamond viel mehr\n\n\"Flame, Int,etc sind in Low elo mehr vertreten als bei höheren rängen.)\"","replies":[{"poster":"deusexodus","date":"2017-08-22T00:44:31.281+0000","up_votes":1,"down_votes":0,"body":"Mag sein, aber durch das was man so nebenbei auf yt oder twitch mitbekommt hab ich persönlich mehr im niedrigeren bereich gesehen. kann da natürlich auch falsch liegen","replies":[{"poster":"Allerbester Biss","date":"2017-08-22T07:25:02.513+0000","up_votes":1,"down_votes":0,"body":"Flamen können die meisten in Plat+ auf jeden Fall besser als jeder Bronze oder Silber\n\nInten ist auch eine schöne Angewohnheit","replies":[]}]}]}]}