{"poster":"Skutnik","date":"2016-11-26T16:39:10.529+0000","title":"Error...?","subforum":"Problemas Técnicos","up_votes":1,"down_votes":1,"body":"Desde ayer que sigo teniendo el mismo error/bug, cuando intento meterme en una partida, dice &quot;Retrieving data from server&quot; (Lo tengo en ingles) y tarda bastante, luego al aceptar una partida, tarda en entrar en el chat (Entro en la sala pero no en el chat, por alguna razon..) Hasta ayer, no era mucho problema. \r\nYa hoy, tengo problemas tambien al cambiar de runas y maestrias, ademas de que sigue tardando en entrar al chat. Desloguee para ver si era por alguna estupidez pero ahora ya no puedo ni loguear...\r\nQuizas a alguno ya les alla pasado, intente reseteando el router, pero tampoco hace que se arregle el error... Y ver 100 veces el cartel de que lo sienten y todo eso no ayuda. &iquest;Alguien sabe que hacer? :/","replies":[{"poster":"Sonya Kyron","date":"2016-11-26T16:43:08.072+0000","up_votes":2,"down_votes":0,"body":"se llama lag, no es un erro ni un bug.\ntenes que resetear la RED.","replies":[{"poster":"Skutnik","date":"2016-11-26T16:45:53.620+0000","up_votes":1,"down_votes":0,"body":"Pero si hoy jugue una partida y tenia 70 de ping constante y eso no es lag.. Y de un dia para el otro que pase algo asi, es raro","replies":[]}]},{"poster":"AresC","date":"2016-11-26T18:22:49.143+0000","up_votes":1,"down_votes":0,"body":"Hola Skutnik!\n\nPara poder ayudarte necesito que me digas el país en el que resides y el nombre de tu proveedor de Internet. Si hay algún problema ya reportado te lo haré saber.\n\nSaludos {{summoner:31}}","replies":[{"poster":"Skutnik","date":"2016-11-27T14:43:39.922+0000","up_votes":1,"down_votes":0,"body":"Yo soy de Argentina y mi compania de internet es \"Telefonica\", ayer abri el cliente en una casa distinta para ver si enrealidad era el juego, o mi computadora, pero al parecer con un internet distinto, anda bien.\nQuizas es que como se acerca el verano, y mi ciudad es una ciudad pequeña, pero de turismo, las redes y el servicio esta sobresaturado lo que hace que no ande como realmente tendria que funcionar.\nGracias por tu ayuda igualmente! {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"AresC","date":"2016-11-27T14:45:21.586+0000","up_votes":1,"down_votes":0,"body":"Es probable. ¿Estás usando una conexión cableada? Por lo general, las conexiones inalámbricas (WIFI o Bluetooth) suelen generar pérdidas de paquetes.","replies":[]}]}]},{"poster":"PhysicalGraffiti","date":"2016-11-26T16:52:55.101+0000","up_votes":1,"down_votes":0,"body":"Es el servidor, es un asco... Esta andando cada vez peor, ese Sonya Kyron al parecer es un troll de riot...","replies":[]}]}