{"poster":"POETA DEL TRUENO","date":"2018-01-06T21:09:18.415+0000","title":"por que no buffean a yasuo ?","subforum":"Charlas Generales","up_votes":2,"down_votes":22,"body":"Me ha tocado perder en la l&iacute;nea de top contra cualquier tanque que se ponga enfrente , no puede ser que yasuo sea tantan debil contra tanques , por ejemplo un top dr. Mundo y un jg Cho gath o ramus y es gg izi (report yasuo troll), adem&aacute;s que te divean como quieren y medio de la diveda le pegan 500 a la torre con la runa demolici&oacute;n osea no hay forma , en conclusion este meta tanque es muy malo no se puede jugar rankeds con campeones as&iacute;, ni zed puede matar a un dr mundo a level 6 ni hablar en late que son inmortales los tanque , estar&iacute;a bueno que le dieran m&aacute;s letalidad como para poder competir contra ellos sin llegar a ser reportado en Cada partida por perder l&iacute;nea.","replies":[{"poster":"ZanahoriaAsesina","date":"2018-01-06T21:16:25.212+0000","up_votes":4,"down_votes":0,"body":"{{champion:157}} PBE: Parche 8.01:\n_** MR growth increased from 0.5 to 1.25**_\n_** Last Breath (R) range increased from 1200 to 1400**_\n_**Steel Tempest (Q) damage increased from 20/40/60/80/100 to 20/45/70/95/120**_\n\n https://2.bp.blogspot.com/-t8Qh6_gVgcw/WimvPR2RGGI/AAAAAAAA1AM/2DqBr940qdU-SzRx_NS0Hs3oYlsAPqInQCEwYBhgL/s640/yasuoq.jpg","replies":[{"poster":"jal243","date":"2018-01-06T21:19:17.382+0000","up_votes":3,"down_votes":1,"body":"Lo quieren devolver a mid? me parece bien, ahí es el lugar de yasuo.","replies":[]},{"poster":"POETA DEL TRUENO","date":"2018-01-06T21:25:54.399+0000","up_votes":1,"down_votes":3,"body":"Cuando será ese parche ?","replies":[{"poster":"ZanahoriaAsesina","date":"2018-01-06T21:28:22.456+0000","up_votes":1,"down_votes":0,"body":"16 de Enero pero hay  tener en cuenta que es el PBE por lo tanto puede que estos cambios se reviertan y no lleguen al cliente oficial.","replies":[]}]}]},{"poster":"Liliths","date":"2018-01-06T21:21:15.618+0000","up_votes":1,"down_votes":0,"body":"Si un tanque no puede matar a un asesino, nose que mierda va a matarlo.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T21:23:31.072+0000","up_votes":1,"down_votes":5,"body":"Una Morgana , una lux mata a un yasuo fácilmente. Yasuo es luchador .","replies":[{"poster":"jal243","date":"2018-01-06T21:29:16.835+0000","up_votes":1,"down_votes":0,"body":"Yasuo es luchador si le armas resistencias además de daño. Por ejemplo, si tenes un adaptive helm y un randuin. Si le armas solo daño, ningún luchador va a poder matar un mago  porque se lo borra de un combo.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T21:37:47.149+0000","up_votes":1,"down_votes":2,"body":"Suena bien pero por ejemplo las habilidades de ryze que pega. Cómo críticos mágicos te destrozan con o sin resistencia , akali sin ir más lejos (q, r ,e) =deleteado!!!","replies":[{"poster":"jal243","date":"2018-01-06T21:46:56.359+0000","up_votes":1,"down_votes":0,"body":"Akali es una asesina, no un mago, Ryze es un mago de batalla, y uno contra el que tenes que jugar bien en early porque es un lategame carry.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T21:54:23.248+0000","up_votes":1,"down_votes":4,"body":"Akali es ap, al igual que ryze! Para eso la resistencia te la metes en el bosillo .","replies":[{"poster":"jal243","date":"2018-01-06T21:57:43.714+0000","up_votes":1,"down_votes":0,"body":"Akali no solo arma ap, primero. Y segundo, que sea AP no significa que sea un mago. Un mago es un personaje que utiliza hechizos, a distancia media- alta, para explotar enemigos, y carece de movilidad. Akali es una asesina como Zed o Talon, solo que escala con items diferentes.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T22:04:11.225+0000","up_votes":1,"down_votes":1,"body":"Te respondo con respecto a las resistencias no a los magos , aunque ni la malmortius ni apariencia espiritual pueden parar el deleteo de Zoe , ni el de veigar !","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T22:14:45.416+0000","up_votes":1,"down_votes":0,"body":"A Zoe le esquivas lo que te duerme (que no es muy difícil con Yasuo por su movilidad) y listo, juga normales hasta que te acostumbres a jugar contra ellos, o banealos si jugas ranked's.","replies":[{"poster":"jal243","date":"2018-01-06T22:20:29.376+0000","up_votes":1,"down_votes":0,"body":"Con yasuo, si zoe te encaja una burbuja, podes tirar el muro y pegarte a él para que te proteja de la estrella.","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T22:30:09.606+0000","up_votes":1,"down_votes":0,"body":"A Morgana y Lux que también menciona, le puede cancelar la Q con el muro de viento y con su movilidad matarlas fácilmente, nose porque se queja tanto.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T22:40:33.328+0000","up_votes":1,"down_votes":1,"body":"La discusión empezó por un Buff a yasuo para poder competir contra tanques , lo de los magos surgió pero nada tiene que ver con los magos en realidad","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T23:10:48.103+0000","up_votes":3,"down_votes":0,"body":"Pero es que tenes problemas con todos, con los tanques, con los magos, con todos los junglas porque siempre te gankean, proba otro campeon, otra linea, nose que mas queres, el chiste es que con la practica mejores y puedas hacerle frente a esas cosas.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-07T14:36:33.396+0000","up_votes":1,"down_votes":0,"body":"si comprendo.","replies":[]},{"poster":"ˉ Foxclaws ˉ","date":"2018-01-07T08:00:50.129+0000","up_votes":1,"down_votes":0,"body":"Pero es que tratas a Yasuo como si fuera un campeón discapacitado que no puede matar ni a una morgana, si tu problema son los tanques, anda mid, no siempre la solución es culpar al juego, aveces vos tenes que buscar la solución.","replies":[]}]}]}]}]}]},{"poster":"jal243","date":"2018-01-06T22:07:35.259+0000","up_votes":1,"down_votes":0,"body":"Zoe es un caso especial. No creo que nadie diga que la nena está balanceada, en especial por el casino que tiene en la w. \n\nVeigar siempre fue así, como escala infinitamente, tiene uno de los mejores snowball del juego.  La mejor manera de evitarlo es con una scimitarra mercurial  y botas de mercuario.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T22:12:10.671+0000","up_votes":1,"down_votes":1,"body":"Entonces por que no darle un poco más de daño al señor yasuo ? Te opones a eso o estás de acuerdo ?","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T22:29:17.622+0000","up_votes":1,"down_votes":0,"body":"Pero si porque unos campeones están rotos no tiene porque caerle un buff a Yasuo porque si xD","replies":[]},{"poster":"jal243","date":"2018-01-06T22:16:04.301+0000","up_votes":1,"down_votes":0,"body":"que ya hay cambios en el PBE, a ver. \n\nEl tema es que a los magos deberías ganarles si els esquivas el cc o se lo bloqueas, a los tanques NO. Un asesino no puede ir por la vida matando tanques, porque si hace eso está desbalanceado.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"jal243","date":"2018-01-06T21:25:59.086+0000","up_votes":2,"down_votes":0,"body":"Es como que a la gente se le escapa el concepto de los \"piedra papel tijera\" de roles.","replies":[]}]},{"poster":"jal243","date":"2018-01-06T21:42:42.441+0000","up_votes":2,"down_votes":0,"body":"Es más, te voy a dejar una lista de algunos campeones que podes llevar a top y  su especialidad es matar o suprimir tanques:\n\nTrundle: Luchador. Su definitiva es de las mejores del juego contra tanques. \n\nGnar:  Cada 3 ataques hace daño porcentual. Periodicamente recupera vida cuando se transforma. Es un luchador. \n\nWarwick: Luchador. daño hibrido en básicos, daño porcentual en la q. Si el enemigo saca Vest  él todavía puede curarse atacando minions. \n\nQuinn/Jayce: Daño a distancia, ambos son lane bullys y no dependen en el life steal o en las curaciones para permanecer en linea.  \n\nY hay otro montón de ejemplos , incluyendo los magos de top, que joden el early de los tanques al no dejarlos farmear, Teemo, que básicamente hace llorar al 80% de los meele.  De ejemplo de maog nadie mejor que Vladimir, que gana la linea  farmeando más que el oponente y zoneandolo con la Q...\n\nTenes decenas de opciones en top, es una de las lineas con mayor variabilidad de opciones viables porque está aislada del resto del mapa, y vos te quejas porque pensas que Yasuo o Zed tienen que poder matar  aun personaje que arma pura vida y resistencias.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T21:50:40.228+0000","up_votes":1,"down_votes":3,"body":"Trundle, ganar y ww se suelen armar tanque y ganan mucho , con respecto a los top de rango puede ser pero un Flash y te comen o te vas de línea y te tiraron la torre o media torre sin duda , que pensas de eso ?  Y con lo decenas de opciones , quien gasta mil horas de su vida para tratar de masterizar un champ y le digas \"déjalo para normales que no vale nada\" es duro me entiendes. ","replies":[{"poster":"jal243","date":"2018-01-06T21:53:32.164+0000","up_votes":1,"down_votes":0,"body":"Trundle, Gnar y WW se arman luchadores, ya que suelen llevar 1 o 2 items de daño, hasta 3 a veces.  Si queres jugar yasuo contra sus coutners, no es culpa nuestra, es tuya, guardalo para cuando alguien saque un top blandito que puedas asesinar. \n\nY por algo top se juega con TP, para que no caiga la torre.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T22:07:11.030+0000","up_votes":1,"down_votes":3,"body":"Se claro 20 segundos muerto media torre minimo, si no es la torre completa. Ni el tp te ayuda en ese caso por que la runa demoler está muy desbalaceada ","replies":[{"poster":"Marveilano","date":"2018-01-06T23:07:49.838+0000","up_votes":3,"down_votes":0,"body":"Por lo que veo tu problema no es contra los tanques, no le podes ganar a nada, de todo te quejas.","replies":[]},{"poster":"jal243","date":"2018-01-06T22:09:25.181+0000","up_votes":1,"down_votes":0,"body":"Demoler seguramente va a ser retocada, pero ese no es un problema de yasuo. Cualqueir top que se muera peude despedirse de su torre, o de media torre.","replies":[]}]}]}]}]},{"poster":"jal243","date":"2018-01-06T21:12:16.676+0000","up_votes":3,"down_votes":1,"body":"Asesino mata a adc, adc mata a tanque, tanque mata a asesino. Siempre que hay un meta sano esa relación se respeta. Si zed o yasuo no peuden matar a mundo, es porque se supone que no deberían matar a mundo!","replies":[{"poster":"zelaya19","date":"2018-01-06T21:39:39.601+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"jal243","date":"2018-01-06T21:45:37.171+0000","up_votes":2,"down_votes":1,"body":"Nah, el meta de top está jodido por la Vest, pero un yasuo no debería ganarle nunca a un mundo a menos que  haya una diferencia grande de skill.","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T22:08:41.956+0000","up_votes":3,"down_votes":0,"body":"La pregunta es porque no va mid con Yasuo, así no le toca tanques.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T22:17:53.602+0000","up_votes":1,"down_votes":5,"body":"Por que es tan blando que una Zoe , una lux, una Morgana , un rize , una sindra , una akali lo revientan, además    que el jungla lo campea todo el erly .como si no necesitará una beffeada !","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T22:24:07.406+0000","up_votes":2,"down_votes":0,"body":"A Zoe la van a nerfear, a cualquiera revienta con su Q con distancia, Lux y Morgana esquivando su Q ya le ganaste siendo Yasuo, Ryze tenes que bajarlo en early, en late va a ser imposible y Akali es una asesina, aprendele a jugar, aparte en tu post te estas quejando de los tanques, no de los magos, practica en normales, y lo del jungla, no todos los junglas son iguales, aprendelo a jugar, fin, no necesita ningún buff.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T22:49:25.994+0000","up_votes":1,"down_votes":3,"body":"Es cierto , el problema es con los tanques no con los magos si lo dije fue como un comentario nunca pedí que le den resistencia mágica a yasuo ni CD de su escudo , no! Solo un poco de daño o letalidad para poder competir con los tanques de top sin feedear en el intento !","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T23:07:22.200+0000","up_votes":1,"down_votes":0,"body":"Anda mid, si ves que en top no podes, deja de intentarlo y proba de mid, fin de tu problema.","replies":[]}]}]}]}]}]}]},{"poster":"POETA DEL TRUENO","date":"2018-01-06T21:20:18.622+0000","up_votes":2,"down_votes":4,"body":"Suena lógico , lo voy meditar y le diré a mis premade que subiremos a diamante jugando tanques solamente osea (asco) más de 100 champs y solo se pueden usar tanques para ganar ? Wtf? Para que ahorrar o gastar RP en otros champs si los tanques son lo más roto siempre.  si el juego se trata de tirar torres cada uno con más de 3000 de vida te tiran torres diveando en segundos. Osea chicos !!! No compren a Zoe compren tanques y llegarán muy muy alto !!! Antes te quedas sin maná que matar un tanque !","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T21:22:43.364+0000","up_votes":2,"down_votes":1,"body":"Bueno si esa es tu opinion, ¿porque no estas llegando a challenger ya? si tenes el truco del juego.\n\n{{sticker:leblanc-funny}}","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T21:31:53.720+0000","up_votes":1,"down_votes":4,"body":"Si sería tan fácil jajaja llegue casi a m7 con dr mundo , pero el team no usa tanques en solo q","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T22:07:49.612+0000","up_votes":2,"down_votes":0,"body":"Dije a challenger, no a m7, yo vivo viendo gente con Yasuo y Riven con m7, y no tienen pinta de challenger.\n\n{{sticker:fiora-cool}}","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T22:12:52.433+0000","up_votes":1,"down_votes":1,"body":"Dije mundo m7, no todos lo team usan tanques , (suelen ganar quien más tanques tenga ) y llegar a diamante es sarcasmo por si no entendiste.","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T22:25:32.480+0000","up_votes":2,"down_votes":0,"body":"Si para vos es asi el juego, busca alguien que juegue con vos y vayan con 2 tanques, asi aseguras la partida.\n¡A COSECHAR ELO!\n\n{{sticker:slayer-jinx-wink}}","replies":[]}]}]}]}]},{"poster":"Diosmo","date":"2018-01-06T21:25:06.407+0000","up_votes":2,"down_votes":1,"body":"Y mas de 100 champs y siempre terminan en Yasuo o Zed?","replies":[]},{"poster":"jal243","date":"2018-01-06T21:25:14.499+0000","up_votes":1,"down_votes":0,"body":"qué parte no entendiste de que el counter de los tanques es el daño sostenido a distancia?\n\nLlevate un ADC o un APC top, es más,si queres joderlos en early, a muchos tanques les podes hacer bullying con teemo, Jayce o Vladimir.","replies":[{"poster":"POETA DEL TRUENO","date":"2018-01-06T21:30:29.913+0000","up_votes":1,"down_votes":1,"body":"Con un Ítem te hacen Counter y (report Teemo troll no puede matar a un cho )","replies":[{"poster":"jal243","date":"2018-01-06T21:44:27.371+0000","up_votes":1,"down_votes":0,"body":"Cho es un caso especial porque tiene rango en las habilidades y su daño no depende de efectos on hit, podes ganarle fácil con un luchador agresivo.","replies":[{"poster":"ˉ Foxclaws ˉ","date":"2018-01-06T22:27:47.998+0000","up_votes":1,"down_votes":0,"body":"A un Cho le haces counter con una Vayne.\n¿que item le hace counter a Vlad?\n¿que item le hace counter a Jayce?\nSi tenes problemas con los tanques, anda mid, fin.","replies":[{"poster":"jal243","date":"2018-01-06T22:34:17.232+0000","up_votes":1,"down_votes":0,"body":"A Vlad podes hacerle counter mostrandole una fotod el testamento de los antiguos. \n\nSe queda toda la partida llorandolo en base, comprando tomos y revolveres para tratar de recuperarlo.","replies":[]}]}]}]}]}]}]}]}