{"poster":"shunpo script","date":"2020-02-09T09:10:48.205+0000","title":"Why don't they just have universal bans that are specific to pro play instead of gutting champions?","subforum":"Esports","up_votes":1,"down_votes":4,"body":"Like why don't they just disallow the use of champions like {{champion:84}} {{champion:39}} {{champion:429}} {{champion:13}} {{champion:517}} etc., in pro play?\r\n\r\nIt's like 90% of the time the reason for the nerfs is \"they are too dominant in the pro scene\" OK well why don't you just say \"you can't use these champions in the pro scene\" instead of gutting them, then bring them back for test runs during scrims in the off-season when you think you've got the balance properly worked out?","replies":[{"poster":"Jng Account","date":"2020-02-09T10:19:44.794+0000","up_votes":2,"down_votes":1,"body":"Ok\n\nAkali - pick/ban in high elo\nIre - pick/ban in high elo\nKalista - really strong in high elo\nRyze/Sylas - you got the idea\n\nStop ignoring their presence in high elo, thank you.\n\nFew others Azir, Seju, Aatrox.\n\nTwo champs that we could call gutted bcs of proplay are Galio and TK, thats about it(and again, their presence in high elo was quite big, but lower than others).","replies":[{"poster":"shunpo script","date":"2020-02-09T10:25:52.406+0000","up_votes":2,"down_votes":1,"body":"I was just giving a short list of examples to demonstrate a point, not write a comprehensive guide on the subject...","replies":[{"poster":"Jng Account","date":"2020-02-09T10:41:34.829+0000","up_votes":3,"down_votes":1,"body":"But your whole premise was \"Some champs are too dominant in proplay while unplayable in soloQ, let's disable them for pro\" which would solve nothing unless you are going to disable them for certain elos as well, in that point, where do you draw the line(from masters on? From GM? Only challanger?)? \n\nNot to talk about how the whole \"Let's make champs so casuals and noobs can play them\" concept is stupid and one of the reasons this game is in current state.","replies":[{"poster":"ProphetOfDraven","date":"2020-02-09T12:05:04.893+0000","up_votes":2,"down_votes":1,"body":"You mean certain elos that are 1% of the league of legends playerbase. If it solves the problem for 99.5% of players than I think thats a good solution.","replies":[{"poster":"Jng Account","date":"2020-02-09T12:22:30.296+0000","up_votes":1,"down_votes":0,"body":"Balancing games around players that cant play the game is way to hell.\n\nIf character requires time investment in order to provide full powerbudged, there is nothing wrong with it. Not all champs should be noob friendly.\n\nLook what Streetfigher did to allow bad players to feel like they are good, skill expression was beaten up and it surely pleased noobs, but it just hurted anyone who knew how to play the game.\n\nRiot is, (un)fortunately, trying to please everybody.","replies":[{"poster":"ProphetOfDraven","date":"2020-02-09T12:39:48.782+0000","up_votes":3,"down_votes":1,"body":"No they are unfortunately trying to please 1% of the playerbase instead of the other 99%.","replies":[{"poster":"Jng Account","date":"2020-02-09T12:53:43.184+0000","up_votes":2,"down_votes":1,"body":"Any proof of that? I might be blind, bcs I don't see any particularly op champs in low elo, only ones that need time investment to unlock full powerbudged or aren't able to solocarry.\n\nIf they cattered to 1% as you said, they would totally aim for making majority of champs playable there, which isn't the case.","replies":[]},{"poster":"DuskDaUmbreon","date":"2020-02-09T15:08:17.673+0000","up_votes":1,"down_votes":2,"body":"Nerfing problematic champions in high elo=! Exclusively pandering to them.\n\nIf they were pandering to just proplay then Talon, Nasus, and Yi would be pushing 70% winrate in low tier just to make them viable in high tier.","replies":[{"poster":"ProphetOfDraven","date":"2020-02-09T15:51:03.747+0000","up_votes":2,"down_votes":1,"body":"Lets just ignore that champions are constantly nerfed to 45% winrate due to being played a bit too much in pro play.\n\n{{champion:13}} {{champion:517}} {{champion:266}} {{champion:84}} {{champion:268}} {{champion:42}} {{champion:39}} {{champion:126}} {{champion:145}} {{champion:498}}  {{champion:3}} {{champion:350}} {{champion:223}} \n\nLiterally non of these were problems in high elo except Akali.\n\nWhile champions like {{champion:245}} are able to dominate soloque for months before getting a slight tap on the wrist.\n\n{{champion:91}} {{champion:11}} {{champion:75}} will never be good champions in coordinated play. Nasus has no gapclosers, no escapes, is melee, no hard cc, and has a weak laning phase. Talon is a melee midlaner, an assassin, doesn't have cc, and doesn't have scaling damage. His roams are weak in coordinated play. Yi is a weak early game carry jungler in the jungle role, which is the easiest role to put behind ( literally every carry jungler isn't playable in coordinated play not just Yi ).\n\nIt's not that they balance EVERYTHING around pro play. It's that they will specifically destroy certain champions beyond playability due to pro play.","replies":[{"poster":"Jng Account","date":"2020-02-09T16:34:16.895+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ProphetOfDraven,realm=NA,application-id=9hBQwnEU,discussion-id=FpvM7zKG,comment-id=00000000000000010000000000010000,timestamp=2020-02-09T15:51:03.747+0000)\n>\n> Lets just ignore that champions are constantly nerfed to 45% winrate due to being played a bit too much in pro play.\n> \n> {{champion:13}} {{champion:517}} {{champion:266}} {{champion:84}} {{champion:268}} {{champion:42}} {{champion:39}} {{champion:126}} {{champion:145}} {{champion:498}}  {{champion:3}} {{champion:350}} {{champion:223}} \n> \n\n\n> Literally non of these were problems in high elo except Akali.\n> \n> While champions like {{champion:245}} are able to dominate soloque for months before getting a slight tap on the wrist.\n> \n> {{champion:91}} {{champion:11}} {{champion:75}} will never be good champions in coordinated play. Nasus has no gapclosers, no escapes, is melee, no hard cc, and has a weak laning phase. Talon is a melee midlaner, an assassin, doesn't have cc, and doesn't have scaling damage. His roams are weak in coordinated play. Yi is a weak early game carry jungler in the jungle role, which is the easiest role to put behind ( literally every carry jungler isn't playable in coordinated play not just Yi ).\n> \n> It's not that they balance EVERYTHING around pro play. It's that they will specifically destroy certain champions beyond playability due to pro play.\n\nYou are just showing how little knowladge about high elo you actually have.\n\nEvery single champ on that list was abused in high elo, even Galio and TK. Stop embarrassing yourself.\n\nNo champs were destroyed bcs of proplay, but bcs of skilled players knew/know how to execute them properly.\n\n(Talon would be played in pro btw, but qiqi is just better version)","replies":[{"poster":"ProphetOfDraven","date":"2020-02-09T16:54:59.104+0000","up_votes":1,"down_votes":0,"body":"Yes Sylas was abused so hard in high elo soloque where 90% of his strength comes from being a flex pick. Yes Aatrox is such a good first in high elo soloque when you have no choice over when pick your champion. Yes Ryze is so strong in high elo soloque where they are so coordinated they can 1 3 1 perfectly. Yes Jayce was abused so hard in high elo soloque where you can guarantee your jungler will camp your lane. \n\nExcept none of these are true.\n\nYour entire arguement is that high elo = pro play when that simply isn't true. A champion like Aatrox becomes infinitely more useful when you have voice comms and you focus people to guarantee resets. He does benefit from player skill but thats no where near half the reason he's stronger in pro play than solo que. A champion like Ryze or Sylas benefits so much from when you have a coach perfectly planning out drafts for you.\n\nSome of those champions like Irelia and Akali truely are stronger just because of player skill though.","replies":[]}]}]}]}]}]}]},{"poster":"shunpo script","date":"2020-02-09T10:50:11.979+0000","up_votes":1,"down_votes":3,"body":"I mean, in high elo they would just be banned. I'd rather ban {{champion:105}} than {{champion:84}} playing in Gold 3 because I've never had to face a GM+ Akali main, and the rest are pretty bad, doesn't matter how strong she is, people in my Elo mostly stuck on her besides OTPs, which I am as well so it balances out.\n\nFizz is just braindead and shits on Kat by accident.","replies":[]}]}]}]},{"poster":"ProphetOfDraven","date":"2020-02-09T12:03:13.275+0000","up_votes":1,"down_votes":1,"body":"Realistically rather than just taking them out of pro play, just give them pro play exclusive nerfs. Kind of like how certain champions are nerfed in Aram or Urf or Nexus blitz. \n\nAatrox was a fine champion in soloque but because of his pro play presence he gets multiple nerfs. Sometimes the problem is dealt with by reworking the champion like Ryze and Sylas but that's unnecessary. If Sylas being a three lane flex is only a problem in pro play then nerf his passive and Q damage IN PRO PLAY.","replies":[{"poster":"GeminiRune","date":"2020-02-09T13:27:33.096+0000","up_votes":1,"down_votes":0,"body":"Pro play exclusive patches would require turning the tournament realm server into an entirely different build of the game on top of their live and PBE clients. That's a bit overkill given that no other game has to or needs to go that far out of their way. Plus that burdens the pros and analysts even more on what they would need to assess between live, TR, and PBE. AND given that a hefty amount of meta following comes from pro play and high elo, what would be the point for fans of following something that's not the same as the live client? It would only go to form a rift out between live and pro.","replies":[{"poster":"ProphetOfDraven","date":"2020-02-09T14:12:38.197+0000","up_votes":2,"down_votes":1,"body":"No other game has this much of a discrepancy between low elo, mid elo, high elo, and pro play.\n\nOh no its slightly harder for players to meta slave oh no. Some of us want our main champions to be playable.","replies":[{"poster":"Jng Account","date":"2020-02-09T14:33:40.275+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ProphetOfDraven,realm=NA,application-id=9hBQwnEU,discussion-id=FpvM7zKG,comment-id=000200000001,timestamp=2020-02-09T14:12:38.197+0000)\n>\n> No other game has this much of a discrepancy between low elo, mid elo, high elo, and pro play.\n> \n> Oh no its slightly harder for players to meta slave oh no. Some of us want our main champions to be playable.\n\nEvery. Single. Champ. Is. Playable. Under. Challanger.\n\nAnd even there are players like that one Teemo jngle main etc.\n\nIt's just about how much time you are going to sacrifise. What's your main that was \"destroyed\" bcs of high elo? If TK or Galio, I can somehow understand. If Kalista, I can kinda relate since her slow mechanic is bullshit. But other champs? Nah. Just excuses, get better.\n\n>No other game has this much of a discrepancy between low elo, mid elo, high elo, and pro play.\n\nDota, Startcraft and many fighting games has as much if not more discrepancy.","replies":[]}]},{"poster":"KFCeytron","date":"2020-02-09T13:43:27.640+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GeminiRune,realm=NA,application-id=9hBQwnEU,discussion-id=FpvM7zKG,comment-id=00020000,timestamp=2020-02-09T13:27:33.096+0000)\n>\n> Pro play exclusive patches would require turning the tournament realm server into an entirely different build of the game on top of their live and PBE clients. That's a bit overkill given that no other game has to or needs to go that far out of their way. Plus that burdens the pros and analysts even more on what they would need to assess between live, TR, and PBE. AND given that a hefty amount of meta following comes from pro play and high elo, what would be the point for fans of following something that's not the same as the live client? It would only go to form a rift out between live and pro.\n\nYeah, it would be like being able to buy a basketball hoop that's shorter than NBA regulation standard height so that your kids can play in the backyard and get a score higher than 0. It would be absolute and utter chaos. Basketball would die.","replies":[]}]},{"poster":"ChompyWulf","date":"2020-02-10T08:42:19.029+0000","up_votes":1,"down_votes":0,"body":"On top of what Gemini had to say, you're forgetting another huge issue. If you have nerfs _specific_ to pro play, then you make it completely different from the public game. Would-be pros have to re-learn champs. Pros cannot properly scrim and practice. It would be a big issue for them. Huge. It would be like pro basketball players only getting to practice with normal basketballs but in game they have to use 3-lb medicine balls the same size as a basketball. It's a horrible idea.","replies":[{"poster":"ProphetOfDraven","date":"2020-02-10T09:40:20.300+0000","up_votes":1,"down_votes":0,"body":"No, not really. I'm talking about numbers nerfs like Aatrox's wave clear and passive sustain and health regen, All nerfs that don't require you to relearn the champion. Are they really going to have to relearn Ryze if his Q does 15 less damage in pro play vs soloque.\n\nPros spend most of their time scrimming anyway. Which Riot could make be on the pro play patch.","replies":[{"poster":"GeminiRune","date":"2020-02-10T14:40:11.531+0000","up_votes":1,"down_votes":0,"body":"Can that be proven that scrims are most of their time? Not only that, but I can assume scrims are on the competitive week's patch which is regularly behind the live patch schedule anyway (especially at internationals). \n\nAnd what of the off seasons? Team play isn't a year round thing if you aren't in the international running. \n\nThe point stands that you'd still be expecting pros to juggle up to 3 variations of a champion at a time. Again I ask what kind of game has to do that?","replies":[{"poster":"ProphetOfDraven","date":"2020-02-10T15:28:49.711+0000","up_votes":1,"down_votes":0,"body":"I mean does it really matter in the first place? They are less than 1% of the people that play league.","replies":[{"poster":"GeminiRune","date":"2020-02-10T18:31:57.288+0000","up_votes":1,"down_votes":0,"body":"And then you should ask yourself. If you were that 1%, would you want to invest into that much mental gymnastics for a game you are striving to prove yourself one of the undisputed best?","replies":[{"poster":"ProphetOfDraven","date":"2020-02-10T19:34:47.692+0000","up_votes":1,"down_votes":0,"body":"For the betterment of 99% of league players, Yes.","replies":[]}]}]}]},{"poster":"ChompyWulf","date":"2020-02-10T17:32:23.219+0000","up_votes":1,"down_votes":0,"body":"Maybe you don't realize some of the depth involved. \nIf you tweak numbers to reduce wave clear, now a player has to change their wave manipulation, how they trade in lane based on enemy minions up, champs they went even with can now bully and counter them, they have to change when they back to buy...it might sound simple, but that alters a lot of little things that can lead to a pretty drastic change in the lane phase and the rest of a game.","replies":[]}]}]}]},{"poster":"Inkling Commando","date":"2020-02-10T19:44:25.305+0000","up_votes":1,"down_votes":0,"body":"why make a champion to begin with if you're gonna prevent players from using them?","replies":[]},{"poster":"Posui Gart","date":"2020-02-09T12:03:37.441+0000","up_votes":1,"down_votes":0,"body":"They want everyone else to grow and play like pros.\nThey want highest level games to be balanced\nThey want \"git gud\" to be actually a solution to balance problems, instead of \"well you gud now, but the meta sucks here, no fun, go make a smurf or whatever\"","replies":[]},{"poster":"KFCeytron","date":"2020-02-09T10:44:45.212+0000","up_votes":1,"down_votes":0,"body":"They buff/nerf problematic champs until the problem goes away.\n\nProblem: Akali is much stronger for experts than noobs but she's super flashy. Solution: nerf until she's viable but not overbearing in pro play.\n\nProblem: Lee was a bit weak but he's super flashy. Solution: buff the hell out of him until he's viable for Worlds (and then somehow forget to revert afterward).\n\nProblem: Tahm Kench is stronger for experts than noobs and ruins flashy plays. Solution: nerf him until he's totally unviable for pro play (and everywhere else).","replies":[]}]}