{"poster":"Esulc","date":"2018-12-24T13:33:19.705+0000","title":"Preguntas que no me dejaron dormir cuando estaba despierto.","subforum":"Off-topic y temas personales","up_votes":7,"down_votes":0,"body":"&iquest;El presente en verdad existe?\n\nLo que estas pensando pasa a ser parte del pasado, lo que acabas de leer ahora es parte del pasado. &iquest;EL presente en verdad existe o es una ilusion?\n\n&iquest;Abajo es abajo o en verdad es arriba pero no tan arriba?\n\n&iquest;Por que Annie queria ayudar en algo dificil y no en algo facil?\nhttps://i.imgur.com/x5ggO9c.png&amp;noredirect\n\n\nSi alguien fuera tan amable de responder las preguntas que tanto me queman la cabeza le agradeceria. Wenos dias a todos c:!","replies":[{"poster":"TheKiller Justin","date":"2018-12-24T14:27:16.343+0000","up_votes":4,"down_votes":0,"body":">¿El presente en verdad existe?\n\nTanto el tiempo, como la verdad o la existencia son productos del entendimiento humano.\nY funciona así, las cosas existen porque podés percibirlas y relacionarlas con un concepto y función.\nEl presente sí existe, pero pienso que no tenemos tiempo de vivir en el, porque así sean milésimas de segundo en que tarde el cerebro en percibir el tiempo actual ya no sería presente. Aunque, la percepción del tiempo depende de cada uno, es decir, si percibís que estás en el presente, tu presente es un instante y pasa a ser pasado.\nAsí no pudiésemos estar en él, el presente sigue existiendo, porque es necesario para definir qué es pasado y qué es futuro.\n\n>¿Abajo es abajo o en verdad es arriba pero no tan arriba?\n\nDepende el punto de referencia que tomés. Si hablas desde tu punto de vista, el abajo es abajo de tu ubicación actual. Si decís \"abajo de la mesa\" estás tomando como referencia la mesa. El \"abajo\" o \"arriba\" está ligado a un punto de referencia sí o sí, así no sea explícitamente.\n\n>¿Por que Annie queria ayudar en algo dificil y no en algo facil?\n\nPorque entra en conflicto con su propio entendimiento de lo que está bien y lo que está mal","replies":[{"poster":"Esulc","date":"2018-12-24T14:39:34.125+0000","up_votes":1,"down_votes":0,"body":"Gracias por la explicacion.","replies":[]}]},{"poster":"AMD Radeon RDNA","date":"2018-12-24T13:58:28.461+0000","up_votes":6,"down_votes":8,"body":"No se que tanta verdad sea lo de Annie, pero me parecio completamente enfermo lo de KaiSa. Ojala ese pibito nunca tenga que pasar por esas situaciones.","replies":[{"poster":"Javo Trypod","date":"2018-12-24T14:04:19.462+0000","up_votes":10,"down_votes":9,"body":"Es humor... como estan los hipersensibles este año eh, tooooodo les molesta a ustedes. Relajense un poco","replies":[{"poster":"AMD Radeon RDNA","date":"2018-12-24T14:19:37.194+0000","up_votes":4,"down_votes":7,"body":"> [{quoted}](name=Javo Trypod,realm=LAS,application-id=J8qpiO2I,discussion-id=9BZbWwHB,comment-id=00010000,timestamp=2018-12-24T14:04:19.462+0000)\n>\n> Es humor... como estan los hipersensibles este año eh, tooooodo les molesta a ustedes. Relajense un poco\n\nUstedes? no se de quien o por quienes hablas pero no me metas en la misma bolsa jajajaja\n\nPerdona, pero tengo otros niveles de \"humor\". Tal vez te parezca graciosa la idea de que fajen a tu madre pero cada quien, no?","replies":[{"poster":"Javo Trypod","date":"2018-12-24T14:30:58.268+0000","up_votes":7,"down_votes":3,"body":"Como no te voy a meter en la bolsa si justamente fuiste vos el del comentario","replies":[]}]},{"poster":"Yamisuke","date":"2018-12-24T17:08:26.904+0000","up_votes":2,"down_votes":2,"body":"Noo con eso no se jode por que es un tema que no es para joder así que no jodas con eso que no se jode, jodón(?","replies":[{"poster":"Tur1nTur4mb4r ","date":"2018-12-24T17:17:13.649+0000","up_votes":2,"down_votes":0,"body":"Yo le hubiera recomendado que invoque al Tibers\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Yamisuke","date":"2018-12-24T17:27:20.462+0000","up_votes":2,"down_votes":0,"body":"Alto piñón te mete el Tibbers JAJA","replies":[]}]}]}]},{"poster":"ModderGod","date":"2018-12-24T20:56:48.927+0000","up_votes":1,"down_votes":0,"body":"Bueee calmate, es un poco de humor. Si no te gusta lo muteas y listo.","replies":[]},{"poster":"Nísta","date":"2018-12-24T20:49:35.122+0000","up_votes":1,"down_votes":0,"body":"Te faltó decir \"niunamenos\" y ya estaba completo el comentario","replies":[]}]},{"poster":"LolisOfLove","date":"2018-12-24T15:05:21.495+0000","up_votes":2,"down_votes":1,"body":"Bueno, la Kai'Sa le dio una solución {{champion:35}}","replies":[]},{"poster":"Corchito","date":"2018-12-24T17:39:16.594+0000","up_votes":1,"down_votes":0,"body":"Tus ojos siempre miran el pasado. La luz tarda un determinado tiempo desde el objeto hasta tus ojos, desde milésimas de milésimas de segundos en lo que te rodea en la vida cotidiana hasta millones de años como las estrellas.\n\n{{sticker:sg-ezreal}}","replies":[]},{"poster":"Pipo UWU","date":"2018-12-24T17:32:13.279+0000","up_votes":1,"down_votes":0,"body":"No tomes droga, toma zumito :p","replies":[]},{"poster":"diabetín","date":"2018-12-24T13:36:52.454+0000","up_votes":1,"down_votes":0,"body":"el presente es este mismo instante, es tanto pasado como futuro, es, fue y será el ahora.\nesa annie si que sabe de lo que habla (?)","replies":[]},{"poster":"Nuke","date":"2018-12-24T17:30:43.700+0000","up_votes":1,"down_votes":1,"body":"> ¿EL presente en verdad existe o es una ilusion?\n\nEl presente asi como el pasado es un concepto creado por el hombre. Y ambos existen. El presente es ahora, el pasado es antes, no necesitas darle más vueltas. Ambos existen pues asi como si no acontecen los hechos nunca, jamás pueden formar parte del pasado.","replies":[]}]}