{"poster":"Esulc","date":"2018-09-21T23:05:37.692+0000","title":"Como pueden existir estos campeones?","subforum":"Charlas Generales","up_votes":4,"down_votes":26,"body":"{{champion:40}} : Se queda afk bajo torre poniendo escudos todo el rato.\r\n{{champion:117}} : Lo mismo.\r\n{{champion:37}} : Maldita sea, apretar todas las teclas en la TF mientras que en early solo diste Q&#039;s+Basicos\r\n{{champion:267}} : Lo peor es que nami da para mucho, PERO NOO, kurazion kurazion uwu \r\n{{champion:16}} : Esto es lo peor que hay.\r\n\r\n&iquest;Como pueden existir esos campeones?, son la causa de que haya gente sin habilidad en Diamond, Master, y hasta Challenger. Son una gran mentira los tipos que usan esos champs. Cada vez que veo a una persona pickear uno de esos champs o que son M7 con ellos, me da algo, No se puede estar tranquilo sabiendo que me esfuerzo para subir mientras estos seres sin neuronas pickean esas cosas para ser carreados. Encima sacando la MALDITA MAESTRIA 7, como si fueran algo mas que solo un S H I E L D, HA. \r\n\r\nCuando estaba escribiendo esto senti que algo iba a explotar en mi. Lo unico satisfactorio es saber que seran humillados cuando jueguen en otra linea que no sea support, aunque seguro salgan en tu equipo... \r\n\r\nBuenas tardes a todos.","replies":[{"poster":"Yellow Sphere","date":"2018-09-21T23:38:42.487+0000","up_votes":7,"down_votes":0,"body":"Yo lo único que veo en este post es \"ñiñiñiñi, ¡¿por qué tienen que existir estos champs?!, es muy injusto\".\nhttps://i.makeagif.com/media/7-15-2015/7yD1BX.gif","replies":[{"poster":"Esulc","date":"2018-09-21T23:45:13.301+0000","up_votes":1,"down_votes":11,"body":"Se, injusto que unos se esfuercen en mejorar para luego ver a esos mains supps que terminan 0/7 fuera de linea.","replies":[]},{"poster":"Roxguel","date":"2018-09-22T01:31:05.499+0000","up_votes":1,"down_votes":0,"body":"Por qué no aprovechan y borran a Master Yi, Yasuo y Zed. Me harían un gran favor, gracias, saludos a la familia.","replies":[]}]},{"poster":"bombastico","date":"2018-09-22T01:12:29.801+0000","up_votes":3,"down_votes":0,"body":"Si no tienes la habilidad para ganarles no es culpa del campeon, es tuya.\n\nAdemas, si pusheaste como loco la linea y los otros estan bajo torre colocando escuditos, creo que deberias replantearte tu estrategia. ","replies":[]},{"poster":"Perturbado2","date":"2018-09-22T01:10:56.507+0000","up_votes":3,"down_votes":0,"body":"pero el juego no trata solo de habilidad, también de pensar o crees que un mono con buenas mecánicas sube?","replies":[]},{"poster":"WhiteMax","date":"2018-09-22T00:26:59.105+0000","up_votes":2,"down_votes":0,"body":"Pero mira esa tormenta de arena papa.","replies":[]},{"poster":"wintermoon","date":"2018-09-21T23:44:15.582+0000","up_votes":3,"down_votes":1,"body":"Creo que alguien no sabe jugar support, kurazion kurazion uwu","replies":[{"poster":"Esulc","date":"2018-09-21T23:47:01.122+0000","up_votes":1,"down_votes":8,"body":"He tenido un tiempo de ir solo ADC y pude apreciar el gran trabajo que hacen los soportes que mencione, = ai kurazion uwu 7u7 :3 ai kurazion","replies":[]}]},{"poster":"Warisan","date":"2018-09-24T12:54:07.874+0000","up_votes":1,"down_votes":0,"body":"jajajajajajaja\n\nLo dices en serio? entonces deja reírme más fuerte\n\nJAAAjajajajajajajajajjajajajajajajahajajajajaja","replies":[]},{"poster":"Mr Society","date":"2018-09-22T02:28:53.165+0000","up_votes":1,"down_votes":0,"body":"tu tienes unos pocos problemas, pero la verdad {{champion:16}} y {{champion:37}} carecen de mecanicas complecas ya que se basan en la mayoria point and click","replies":[]},{"poster":"Winter Lion","date":"2018-09-22T02:18:41.977+0000","up_votes":1,"down_votes":0,"body":"Parece que nadie te explicó,  los supps de utilidad estan para cuando tienen un adc debil en juego temprano y tienes que asegurarte que sobreviva hasta juego tardio. No puedes suportear a un twitch con un trynda y pretender que gane la linea. No todo se trata de mecanicas y pensar en tu propio score, jugar en función de lo que el team necesita es una forma mas inteligente de jugar que tu \"uy voy 12/11/1 y mi nepe mide 5 milimetros mas\"","replies":[]},{"poster":"Ulphurus","date":"2018-09-22T01:45:02.155+0000","up_votes":1,"down_votes":0,"body":"A ver si es tan sencillo pickea esos campeones y sube a challenger, aa cierto No puedes...","replies":[]},{"poster":"Mioen","date":"2018-09-22T01:01:26.702+0000","up_votes":1,"down_votes":0,"body":"Nami puede hacer bastante. De hecho tiene \"las misma habilidades que sona pero con AoE y movi\". Como decirlo muchos no saben que Nami da Vel.Mov con las burbujas XD.\n\nComo Main soporte, te puedo asegurar que pueden llegar a ser molestas, pero cada una tiene sus counter pick. El tema es que cuando esta fuerte algún item de la meta de utilidad, estas pasan a ser como Diosas intocables y es completamente molesto.\n\nDe hecho todas son debiles a los campeones de All In. Y si bien son molestas en su fase temprana, esta es tambien la fase en la que son mas debiles.\n\n{{champion:89}} {{champion:201}} {{champion:12}} {{champion:53}} {{champion:43}} {{champion:412}} Si tienen cabeza las destrozan.","replies":[]},{"poster":"Ks As Oxígeno","date":"2018-09-21T23:53:47.821+0000","up_votes":1,"down_votes":0,"body":"Yo estoy maineando {{champion:117}} haci que si me encuentras ya sabes lo que te pasara :v","replies":[]},{"poster":"Diosmo","date":"2018-09-21T23:31:57.453+0000","up_votes":1,"down_votes":0,"body":"No todos los campeones pueden ser como {{champion:157}} o {{champion:238}}","replies":[{"poster":"Esulc","date":"2018-09-21T23:48:21.618+0000","up_votes":1,"down_votes":7,"body":"Lo entiendo, \"para gustos colores\". Para gente sin habilidad \"{{champion:40}} {{champion:117}} {{champion:37}} {{champion:16}} {{champion:267}}\".","replies":[]}]},{"poster":"Christoph","date":"2018-09-21T23:39:11.330+0000","up_votes":1,"down_votes":1,"body":"La verdad que si, son enteros petes los main sup que usan esos champs pero\nIgual tienen mas elo que tu \n{{sticker:sg-shisa}}","replies":[]}]}