{"poster":"InsaneSamurai","date":"2017-03-11T18:00:12.875+0000","title":"So why is GP allowed to have a 1000+ dmg aoe that's not even an ult?","subforum":"Gameplay","up_votes":7,"down_votes":22,"body":"I&#039;m just curious how that fits into game balance.\n\nEdit: Forums are great.  Ask a logical question, get downvoted by GP players who are afraid of losing the highest aoe dmg skill in the game :P","replies":[{"poster":"Packun Flower","date":"2017-03-11T18:23:39.501+0000","up_votes":10,"down_votes":2,"body":"> [{quoted}](name=InsaneSamurai,realm=NA,application-id=3ErqAdtq,discussion-id=Z5ObOdMw,comment-id=,timestamp=2017-03-11T18:00:12.875+0000)\n> \n> Edit: Forums are great.  Ask a logical question, get downvoted by GP players who are afraid of losing the highest aoe dmg skill in the game :P\n\nhttp://cdn.someecards.com/someecards/usercards/you-sir-are-a-salty-bastard-43807.png","replies":[]},{"poster":"Shadòw","date":"2017-03-12T16:01:59.676+0000","up_votes":3,"down_votes":0,"body":"well it's basically GP entire basic combo.\n\nHis W does no Damage and he uses his Q to activate his E.\n\nwhen you look at the numbers, it's huge, but it's all the Damage he can pull off with his basic combo.\n\npretty much every other Damage champion can pull off the same Damage with 2 basic abilities\n\njust take {{champion:99}} for example, she has a W Shield too like GP has a heal on that key.\nwhen Lux hits Q and E, she can pull off pretty much the same Damage.","replies":[{"poster":"BastionKross","date":"2017-03-12T16:55:02.171+0000","up_votes":1,"down_votes":0,"body":"Yeah, one of the things that makes GP such a balance nightmare is that outside of his ult and an expertly set up barrel explosion, he really doesn't do much in a teamfight. Either he lands his barrels and is a god, or he fucks up his barrels and eats shit. So much of his kit's power is in those barrels. That's not the way a champion should play, where one ability is all you got to make a difference.\n\nThe trouble is that what are you going to improve if you take power from his barrels? His ult is already damn good, his Q is point and click so you don't want that too good, his passive is an option but that's true damage so you have to be careful about buffing it, and his W is already strong by being a cleanse and a huge heal at the same time.","replies":[{"poster":"Shadòw","date":"2017-03-12T17:06:31.934+0000","up_votes":1,"down_votes":0,"body":"high risk high reward.\n\nthat's not unhealthy but GPs playstyle.","replies":[{"poster":"BastionKross","date":"2017-03-13T23:34:30.087+0000","up_votes":1,"down_votes":0,"body":">high risk high reward.\n\nThe proper term for GP now is \"binary\".\n\nA binary champion is rarely healthy. Taking some power from barrels and giving GP a fallback pattern for when he whiffs his explosions would improve his game health significantly. He can still be high risk high reward, but he also won't become a glorified melee minion in a teamfight if the risk doesn't pay off.\n\nThe trouble is, where do you give him that fallback? Buff his Q? Give W a MS boost? Let his passive tick longer? No, those just aren't great solutions. It's hard to give power to the rest of his kit because the rest of his abilities lack counterplay. If Q were to be made into a skillshot ala Ryze, then you could put some power there since he could miss or enemies could evade. Perhaps we'd see shades of the old GP where one Q could take half a squishies healthbar. This time it would be healthier, since it would no longer be point and click and would take skill to fire through the frontline to land it.","replies":[]},{"poster":"InsaneSamurai","date":"2017-03-13T14:31:31.784+0000","up_votes":1,"down_votes":0,"body":"It is unhealthy when your top laner can't do anything to stop him and he ends up winning every teamfight because he knows how to chain barrels.  Someone ganks him? Either it's a double kill for GP cause of barrels, or he just eats oranges and wastes everyones time.  \n\nUnless he's straight up countered, you can't stop him from farming.","replies":[]}]}]}]},{"poster":"HeresyHorus","date":"2017-03-11T20:26:38.860+0000","up_votes":2,"down_votes":1,"body":"gp problem is the barrel chain from fog of war or range as it have 0 counterplay.\n\nthe barrels need to have a delay upon placement before being able to interact with other barrels.\n\nthis or nerf his barrels as they are overloaded as fuk (armpen + apply on-hits + aoe + slow + movespeed + passive reset + manaless)","replies":[{"poster":"Moooose3","date":"2017-03-12T07:31:22.029+0000","up_votes":1,"down_votes":1,"body":"His entire kit.","replies":[{"poster":"HeresyHorus","date":"2017-03-12T09:50:36.053+0000","up_votes":2,"down_votes":0,"body":"nope, he can use aa to detonate barrels and still have his Q + W + R + Passive.\n\nusually its better to use aa to detonate barrel chains and use Q to finish targets from range, and his normal aa still apply sheen to barrels i think.","replies":[]}]}]},{"poster":"Leaf on Bush","date":"2017-03-11T18:42:23.027+0000","up_votes":1,"down_votes":1,"body":"I don't play GP but without his barrel he would be useless. It's already hard enough to set up barrels depending on the situation and it should be rewarding for him to land a barrel combo, especially since 1 auto attack can simply disarm it.","replies":[{"poster":"InsaneSamurai","date":"2017-03-11T18:44:11.002+0000","up_votes":2,"down_votes":4,"body":"I agree it should be useful, but popping several people for 1200 damage with only a half build is a bit much.  At the least, I really don't see the need for them to crit.  They do plenty of damage as is.","replies":[{"poster":"Leaf on Bush","date":"2017-03-11T19:06:41.308+0000","up_votes":1,"down_votes":1,"body":"I suggest you play GP yourself so you understand his point of view because its not always that easy...","replies":[{"poster":"InsaneSamurai","date":"2017-03-11T21:05:31.789+0000","up_votes":2,"down_votes":0,"body":"I have, and while its far from automatic, its not nearly as difficult as some people are saying on here.  You think everyone in a teamfight is paying enough attention to auto his barrels perfectly between the timer and his gunshot?","replies":[{"poster":"Sir Fuzzi","date":"2017-03-12T10:20:05.371+0000","up_votes":1,"down_votes":1,"body":"It's not difficult if people never, ever watch their ass around bushes, play away from barrels, or basic the barrels from a distance (or knowing they'll outrun Gangplank.\n\nYou can't balance around bad play. You do, and you gut a champion.","replies":[{"poster":"InsaneSamurai","date":"2017-03-12T15:58:31.001+0000","up_votes":1,"down_votes":0,"body":"Who honestly has time to pay that much attention to barrels in a 5v5 fight AND is in perfect position to auto them in the extremely small window between the last tick and his shot?\n\nYou can call people bad for getting hit by them all you want but you know just as well as I do you completely wreck teamfights with them easily.","replies":[]}]}]}]}]}]},{"poster":"Hailey Hayato","date":"2017-03-11T18:55:17.756+0000","up_votes":2,"down_votes":0,"body":"Tbh they should give his barrels mana costs like 30 or 20 mana per barrel.","replies":[{"poster":"Sir Fuzzi","date":"2017-03-12T10:24:03.031+0000","up_votes":1,"down_votes":0,"body":"He itemizes into Sheen easy street, give a mana cost and he's still not going to care. The only GP you'll punish with this is the bad one who isn't good enough for the barrel minigame in the first place. The cost will just exacerbate his placement issues.","replies":[{"poster":"InsaneSamurai","date":"2017-03-12T16:37:58.110+0000","up_votes":1,"down_votes":0,"body":"I agree, the height of the problem has nothing to do with the lack of mana cost. It's that he gets an AOE attack that applies all his auto modifiers and crits on top of everything it already adds.  The counterplay might be ok in lane(though I disagree when it's a vs melee matchup), but blowing up his barrels before he does in a late game teamfight is almost nonexistent.","replies":[]}]}]},{"poster":"Woodakoodashooda","date":"2017-03-11T18:02:59.317+0000","up_votes":3,"down_votes":3,"body":"His barrels? The barrels he has to prepare and measure and time and can be countered or avoided altogether? That AoE? It's the mini game Riot gave him to make him fun and interesting. Top lane is boring as fuck most games. Some players need something to do to occupy their time.","replies":[{"poster":"Warlord Scrap","date":"2017-03-11T18:04:47.343+0000","up_votes":3,"down_votes":1,"body":"If your melee it extremely hard to beat the barrels though","replies":[]},{"poster":"InsaneSamurai","date":"2017-03-11T18:14:03.412+0000","up_votes":2,"down_votes":9,"body":"Without some serious movement skill, a melee champ can't really do anything about the barrels.  Even if he can, one mis-timed move and he eats the insanely overpowered ability to the face.  Fun and interesting is one thing.  Having a non ultimate move that if not specifically countered in the middle of madness(how many of your ADCs ever stop in the middle of a teamfight to shoot a GP barrel?) wins the entire fight due to its unbelievable damage is another thing entirely.\n\nThis is also ignoring the fact that he can drop a barrel chain and shoot it much faster than you can move over and destroy the initial barrel.","replies":[{"poster":"PureSilvrr","date":"2017-03-11T18:19:21.592+0000","up_votes":2,"down_votes":2,"body":"then destroy the middle barrel....","replies":[{"poster":"InsaneSamurai","date":"2017-03-11T18:20:01.926+0000","up_votes":2,"down_votes":3,"body":"The time it takes a champ to run past the barrel he places on you is plenty enough for him to shoot the one you're running at.  Maybe if the GP you're fighting is half asleep that'd work :P","replies":[{"poster":"Moooose3","date":"2017-03-12T07:33:34.544+0000","up_votes":1,"down_votes":0,"body":"Or if you played a ranged champ. Or if you shoved him under turret. Or let him shove you under turret. Or did anything besides let lane freeze in the middle of the lane and stare as he sets up a barrel chain.","replies":[{"poster":"InsaneSamurai","date":"2017-03-13T14:27:26.575+0000","up_votes":1,"down_votes":0,"body":"Sometimes you have to pick first, ya know :P  And sometimes(read: nearly every time) the team so desperately needs a tank that you have to just eat a bad laning phase and play one anyway.\n\nAlso, this is interesting: \"Or did anything besides let lane freeze in the middle of the lane and stare as he sets up a barrel chain.\"  Didn't you spend several posts belittling anyone who ever walks near a barrel? :P  Do you propose we jedi mind trick him into detonating them randomly?","replies":[]}]}]}]},{"poster":"Mecha MaIphite","date":"2017-03-11T18:31:09.906+0000","up_votes":2,"down_votes":1,"body":"You can realise that him chaining barrels is a possibility, and position accordingly when he puts one down.","replies":[{"poster":"InsaneSamurai","date":"2017-03-11T18:34:30.889+0000","up_votes":2,"down_votes":2,"body":"So it's balanced for him to just completely control whatever zones he wants with barrels?  This is also ignoring the inevitable teamfight barrel he throws in that nearly one shots all your teams squishies in one go.  If he misses?  Thanks to charges he'll be able to drop 2 more in no time.  I don't see the reasoning here.","replies":[{"poster":"Moooose3","date":"2017-03-12T07:32:43.335+0000","up_votes":1,"down_votes":1,"body":"If you want to talk about zone control why not talk about caitlyn traps. It's a part of his kit and is fine as it is, you just can't counterplay apparently.","replies":[]}]}]}]}]},{"poster":"Moooose3","date":"2017-03-11T18:48:17.184+0000","up_votes":3,"down_votes":2,"body":"Probably because it takes huge setup, and is basically his entire kit, without ult. You sir, are an idiot.","replies":[{"poster":"InsaneSamurai","date":"2017-03-11T18:49:45.399+0000","up_votes":2,"down_votes":4,"body":"Pressing a button, waiting a second, then pressing it again is a huge setup?","replies":[{"poster":"Moooose3","date":"2017-03-11T18:50:45.458+0000","up_votes":3,"down_votes":2,"body":"Maybe when you see him setting up his barrels, you don't walk into range of one. Just an idea.","replies":[{"poster":"InsaneSamurai","date":"2017-03-11T18:53:21.834+0000","up_votes":2,"down_votes":4,"body":"So it's ok for him to completely control whatever zones he wants?   And as I mentioned before, this is ignoring teamfight barrels.","replies":[{"poster":"GankedByWindows","date":"2017-03-11T20:13:08.769+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=InsaneSamurai,realm=NA,application-id=3ErqAdtq,discussion-id=Z5ObOdMw,comment-id=0003000000000000,timestamp=2017-03-11T18:53:21.834+0000)\n>\n> So it&#x27;s ok for him to completely control whatever zones he wants?   And as I mentioned before, this is ignoring teamfight barrels.\n\nmany champions control zones of their choosing. Riot even has a category for the AP variants called Control Mages. Are you going to say it is unfair that Viktor can completely block a jungle avenue with an AOE stun? Or that rumble zones melee champions in front of him with Flamespitter? Or that blitz has a large area of control because people have to respect his hook? Every champion in the game zones, that is a fundamental part of the game. \n\nTeamfight barrels are easier to land in the chaos, true enough. But there is still a lot you can do. Off the top of my head you can:\n1) Kite the fight away from GP so he can't reach\n2) Stun him and prevent him from blowing them up\\\n3) AA the barrels to fuck with his timing/getting the final shot (even easier with hurricane ADCs)\n4) respect the barrels and don't fight where he has set up, or the possiblity. It is the same concept as avoiding walking through jungle chokepoints against a rumble with Equalizer available. \n5) Destroy him early game (his early game is pretty awful, even with barrels landing) when he doesn't have farm from his Q and bandit, and win the game before he gets 6 items. If he is allowed to stall out the game, he should be powerful. That is his compensation for having a bad early game is a good late game.","replies":[{"poster":"InsaneSamurai","date":"2017-03-11T21:04:15.382+0000","up_votes":2,"down_votes":1,"body":"Those are similar, but they have way less uptime than the barrels do.  With stuff like viktor or blitz, you can attempt to bait it and choose a fight when it's on cd.  In GP's case, he can just slap down a couple more if he happens to miss one and you're back to square one.  \n\nAs for the ways to go against it, they're kind of spotty if you ask me.  1 and 3 aren't really doable by most melee champs. 2 only works if he doesn't have oranges AND is in a position where you can reliably hit a stun. 4 can work temporarily but if he's zoning you with barrels his farm is just going to get insane before long.  5 is pretty much matchup based. Some champs just can't bully him enough to matter.  \n\nI feel like it's too situational to shut him down compared to the immense swing one landed barrel shot can do.  Seeing your back line vanish due to one crit barrel in a teamfight just doesn't seem right at all.  Pretty much everyone engaged has a lot more to worry about than timing autos on GPs barrels, so that's the spot where they hit the hardest, and all it takes is one success to win the entire fight due to the damage.","replies":[]}]},{"poster":"Moooose3","date":"2017-03-11T19:38:27.691+0000","up_votes":1,"down_votes":2,"body":"have you tried autoing the barrels yet? or playing to the opposite side of the lane. It's possible that gp is just good against melee champs unless u actually play correctly.","replies":[{"poster":"InsaneSamurai","date":"2017-03-11T21:06:20.893+0000","up_votes":2,"down_votes":1,"body":"If you let him free farm he's going to ruin the game with his barrel crits, so that's not really a viable option.  Obviously you can auto the barrels, but the thing about top lane is its very commonly used for melee champions.  If you go try to auto a barrel against a GP with a melee champ and he doesn't blow it up in your face, I'd say you were lucky :P\n\nAlso in case you didn't know, GP can immediately place a barrel on top of you for a chain.  It's not like they need a second to arm or something.  If you mean don't go within a barrel's range of any barrel, that allows him to constantly keep you off farm the entire time by just placing one barrel near each wave, which in that case he could keep it up more or less indefinitely.  I don't think that's good gameplay when you can't even attempt to farm just because someone knows how to use barrels","replies":[{"poster":"Moooose3","date":"2017-03-12T07:30:40.257+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"InsaneSamurai","date":"2017-03-12T16:03:03.993+0000","up_votes":1,"down_votes":0,"body":"Based on your comparison down there, your insult laden defense partially makes sense now.  If you think a GP barrel is as easy to dodge as a Cait trap, I'm sorry bud.  Those two skills have vastly different levels of zoning and teamfight power, and its far easier to hit barrels mid fight than traps.  Not to mention one sneaky cait trap won't swing an entire teamfight anywhere near as often as a barrel will.\n\nWhile I'm sure raging and trolling is a wonderful defense for your champion in your mind, in reality it just makes you look immature and lose all credibility.  If you're unable to have a reasonable conversation like a normal human being, I'm not going to continue it with you.\n","replies":[{"poster":"Moooose3","date":"2017-03-12T16:31:54.276+0000","up_votes":1,"down_votes":0,"body":"I'm perfectly aware they have different strengths. Again, you're in bronze. They're easy to dodge, but they're also easy to hit if you're good at him. So basically you need to understand that if he barrel chains you you lose a fight if you take it with him. It's really not that hard. For the record, I don't think I've played a single game of gangplank in my life, but I have laned and played against it multiple times. His barrels are basically his entire kit, and the only reason he is played because of the armor pen and extra damage they give. That's it. Saying \"omg nerf the barrels\" is absolutely ridiculous. Watch a high elo stream when they play against gangplank. He is very counterable, you just have to understand the matchup, and you obviously don't.","replies":[{"poster":"InsaneSamurai","date":"2017-03-13T14:26:39.712+0000","up_votes":1,"down_votes":0,"body":"If you think your average teammate will perform with even a fraction of what you see on your high elo streams, I think you're expecting a bit much.\n\nI'm bronze because i'm not lucky, just like everyone in bronze.  Nothing about skill matters down here, it's a complete crap shoot and always will be.","replies":[{"poster":"Karhtel","date":"2017-03-13T23:45:16.379+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=InsaneSamurai,realm=NA,application-id=3ErqAdtq,discussion-id=Z5ObOdMw,comment-id=0003000000000000000000000000000000000000,timestamp=2017-03-13T14:26:39.712+0000)\n>\n> If you think your average teammate will perform with even a fraction of what you see on your high elo streams, I think you&#x27;re expecting a bit much.\n> \n> I&#x27;m bronze because i&#x27;m not lucky, just like everyone in bronze.  Nothing about skill matters down here, it&#x27;s a complete crap shoot and always will be.\n\nLol. No. You're in bronze because you're bronze. Luck has nothing to do with it","replies":[{"poster":"InsaneSamurai","date":"2017-03-14T05:32:24.018+0000","up_votes":1,"down_votes":0,"body":"The most important thing in this elo is which team has more feeders, trolls, griefers, or people who spend more time arguing with each other than playing the game.  No matter how good you think you are, you can't force a win when nobody on your team will work together against a team that is.  \n\nSure every once and a while a normal game happens down here where individual play sometimes matters, but it's not very common, and even when it does the result of the game is often due to one person refusing to work with their team.  \n\nOne persons skill level will never make a griefer stop griefing, it will never make someone stop charging their fed lane opponent(s) and dying, and it will never make that guy who thinks he can 1v5 stop thinking he can 1v5 and try to group for a change.  Those things are what costs games down here, not good plays.","replies":[{"poster":"Karhtel","date":"2017-03-14T20:38:36.406+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=InsaneSamurai,realm=NA,application-id=3ErqAdtq,discussion-id=Z5ObOdMw,comment-id=000300000000000000000000000000000000000000010000,timestamp=2017-03-14T05:32:24.018+0000)\n>\n> The most important thing in this elo is which team has more feeders, trolls, griefers, or people who spend more time arguing with each other than playing the game.  No matter how good you think you are, you can&#x27;t force a win when nobody on your team will work together against a team that is.  \n> \n> Sure every once and a while a normal game happens down here where individual play sometimes matters, but it&#x27;s not very common, and even when it does the result of the game is often due to one person refusing to work with their team.  \n> \n> One persons skill level will never make a griefer stop griefing, it will never make someone stop charging their fed lane opponent(s) and dying, and it will never make that guy who thinks he can 1v5 stop thinking he can 1v5 and try to group for a change.  Those things are what costs games down here, not good plays.\n\nBut a plat player or probably gold in bronze and they will climb out with a 75 percent win rate. Bronze is a joke. I mean im only in silver right now got placed in bronze 3 this season and climbed out in like 25 games. It's easy lol. Dont blame others on your inability to climb","replies":[{"poster":"InsaneSamurai","date":"2017-03-15T06:57:46.901+0000","up_votes":1,"down_votes":0,"body":"No matter how good you are you can't force people to not throw.","replies":[]}]},{"poster":"Incarceration","date":"2017-03-14T15:46:20.900+0000","up_votes":1,"down_votes":0,"body":"Learn how to climb, and maybe, maybe, you might understand how much counterplay GP has, and how much skill he actually takes.","replies":[]}]}]},{"poster":"Moooose3","date":"2017-03-13T20:11:52.149+0000","up_votes":1,"down_votes":1,"body":"No, you're bronze because you suck at the game.","replies":[{"poster":"InsaneSamurai","date":"2017-03-13T22:18:25.618+0000","up_votes":1,"down_votes":1,"body":"It's cute that you think individual skill matters in this elo","replies":[{"poster":"Moooose3","date":"2017-03-13T22:37:51.170+0000","up_votes":1,"down_votes":0,"body":"It's cute, because I've done a bunch of bronze 5/4/3 to diamond runs and I get out of there in like 20 games tops.","replies":[{"poster":"Moooose3","date":"2017-03-14T23:26:02.245+0000","up_votes":1,"down_votes":0,"body":"No, bronze to silver in 20 games tops. Good try though.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}