{"poster":"InsaneSamurai","date":"2015-07-16T18:05:26.174+0000","title":"So Kalista+Tahm isn't a bug?","subforum":"Gameplay","up_votes":19,"down_votes":6,"body":"Why?  You specifically disabled Thresh lanterns and Bard passages to prevent abuse of devour.  Why allow this?  Is it really ok to you that a duo can control an entire lane just for hitting level 6?","replies":[{"poster":"Fred Fuchs","date":"2015-07-16T19:58:27.499+0000","up_votes":8,"down_votes":3,"body":"you do realize there there have been other interactions in the game like this well before tahm don't you? people could have done the same thing with scarner and blitz as well as plenty of other combos that just as good. this isn't some brand new op thing. the fact that tahm has to even stack his passive before eating someone means that this should be pretty avoidable. just don't play overly aggressive against such a defensively powerful champion and you wont get comboed.","replies":[{"poster":"InsaneSamurai","date":"2015-07-16T23:16:19.751+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Fred Fuchs,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=0002,timestamp=2015-07-16T19:58:27.499+0000)\n>\n> you do realize there there have been other interactions in the game like this well before tahm don't you? people could have done the same thing with scarner and blitz as well as plenty of other combos that just as good. this isn't some brand new op thing. the fact that tahm has to even stack his passive before eating someone means that this should be pretty avoidable. just don't play overly aggressive against such a defensively powerful champion and you wont get comboed.\n\nYeah just never get auto-ed by Tahm...  That's super easy to do while trying to get cs while he's standing behind your minion wave :P  \n\nHe only needs to land two random autos and then you have to flash or die unless you're almost at your own turret already(even then you're probably dead).\n\nSkarner doesn't really support, so I have no idea if it works the same way, but even if it does it still doesn't give you such a huge window to abuse it. Blitz and Kalista can't do this at all.","replies":[{"poster":"ScurryLizard","date":"2015-07-16T23:47:52.265+0000","up_votes":2,"down_votes":1,"body":"If he's standing behind your minions just kill him. He's not exceedingly tanky before getting some items and if your support has any CC it should be an easy kill if he tries to go in because he'll be taking minion aggro and autos from an ADC (with a BF Sword at the point you're lvl6) with no way of getting out immediately. His mobility is pretty much none tbh so it should be easy to scare him off.","replies":[{"poster":"InsaneSamurai","date":"2015-07-16T23:56:49.581+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ScurryLizard,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=000200010000,timestamp=2015-07-16T23:47:52.265+0000)\n>\n> If he's standing behind your minions just kill him. He's not exceedingly tanky before getting some items and if your support has any CC it should be an easy kill if he tries to go in because he'll be taking minion aggro and autos from an ADC (with a BF Sword at the point you're lvl6) with no way of getting out immediately. His mobility is pretty much none tbh so it should be easy to scare him off.\n\nYeah see i thought so too, but you cant kill him without him autoing you 2 times.  That's all it takes then he Qs you, devours, and you're under enemy turret 1v2.","replies":[{"poster":"DeynaTaggerung","date":"2015-07-17T13:51:45.988+0000","up_votes":1,"down_votes":0,"body":"Well you will have to keep kiting back. If you play it right the only thing he should be able to land on you is his q. Plus if your support is helping (we're assuming kailsta is standing back to get a max range ult) then he should just die for stepping forward on his own, just cuz.","replies":[{"poster":"InsaneSamurai","date":"2015-07-17T14:27:11.955+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=DeynaTaggerung,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=00020001000000000000,timestamp=2015-07-17T13:51:45.988+0000)\n>\n> Well you will have to keep kiting back. If you play it right the only thing he should be able to land on you is his q. Plus if your support is helping (we're assuming kailsta is standing back to get a max range ult) then he should just die for stepping forward on his own, just cuz.\n\nIf the guy is half decent, hes going to get more than his q off on either you or the sup, then it's free kill time.  Plus his q has a 5 sec cd.  Even if you do kite him for maybe 3 autos and a poke, he heals it back and does it again, basically giving his adc free farm.  Unless you have a really specific sup to punish him for it, the lane is over at that point.  Enemy adc freezes lane and if you try and farm you or the sup die instantly.  Under no circumstance should this actually be considered a legit strategy and not an abuse of something Riot overlooked.\n\nDisabling lanterns and magical journeys kinda makes this obvious.  They did not want a devour to displace someone that far on top of making them unable to act for such a long time.","replies":[]}]}]},{"poster":"InsaneSamurai","date":"2015-07-17T14:43:06.050+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ScurryLizard,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=000200010000,timestamp=2015-07-16T23:47:52.265+0000)\n>\n> If he's standing behind your minions just kill him. He's not exceedingly tanky before getting some items and if your support has any CC it should be an easy kill if he tries to go in because he'll be taking minion aggro and autos from an ADC (with a BF Sword at the point you're lvl6) with no way of getting out immediately. His mobility is pretty much none tbh so it should be easy to scare him off.\n\nHis passive makes him laugh at a couple autos and a second or two of minion aggro.   His Q is rather fast, so you're not going to dodge too many of these.  Then, if you are close enough(remember, you're slowed), then he just waltzes up and gets the last auto off.  Sure he took a few hundred dmg, but you're automatically dead.\n\nThe dude can stack potions and when combined with his e regen he basically doesn't lose health for doing this.  If it didn't work, you still spent all that time messing with him while the adc free farms and you had no choice but to back off or die to devour.  You wait for the stacks to fall off, and try again, right?   He can easily do this and maintain more health than the ADC, as once his regen and potions kick in(and you basically have to let them kick in while you wait for stacks to fall off) the ADC is going to be taking more dmg than he is, especially considering you probably don't have any more lifesteal than a doran's at this point.  All the while your farm is being reduced to almost nothing. \n\nAlso, the lane becomes ungankable, that's really balanced :P","replies":[]}]},{"poster":"Fred Fuchs","date":"2015-07-17T00:35:11.227+0000","up_votes":4,"down_votes":2,"body":"if you get autoed by a melee range champion with no gap closers 3 times as an adc then your positioning is really poor. he has no hard cc before 3 stacks. all he has before 3 stacks a mid range skill shot that slows very minimally. this combo is so easy to avoid and honestly im not sure why anyone would think this is a reliable \"op\" combo. i mean unless you are bronze... are u bronze? no offense if you are but it would make more sense i guess","replies":[]}]},{"poster":"RedCyclone","date":"2015-07-16T20:42:30.732+0000","up_votes":3,"down_votes":1,"body":"Not quite the same as getting eaten, being made untargetable (no heals or shield for you, you know, the thing what supports tend to have in botlane to save their carries) THEN Tahm being made untargetable so you can't CC him as he tries to run away with your carry (another thing what supports tend to have) THEN in the space of less then 3 seconds come out the other end of the enemy tower that 3 seconds ago you was 2000 units away from.\n\nNot quite the same...","replies":[{"poster":"Fred Fuchs","date":"2015-07-16T20:58:34.643+0000","up_votes":1,"down_votes":2,"body":"it actually is quite the same. like i said, scarner can do the same thing, u cant stop the combo as soon as it starts its no different with blitz or tahm. none of these combos can be countered when they are being done. the only way to counter them is to stop them before the combo is pulled off, if you cant stop tahm from devouring you before the combo can be done then you aren't playing the match up right. he has to stack his passive 3 times with a low auto range and relatively low cc. (before his passive stacked) my main point was more so the last 2 sentences. what i was saying is that if you cant avoid such an obvious combo then you played the match up wrong. you cant just call something op because you dont know how to avoid it.","replies":[{"poster":"John JJ Schmidt","date":"2015-07-17T13:47:40.110+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Fred Fuchs,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=000200000000,timestamp=2015-07-16T20:58:34.643+0000)\n>\n>he has to stack his passive 3 times with a low auto range and relatively low cc\n\nand a very slow attack speed.\n\nAnd then he has to devour you, which means he's still standing directly on top of you; the range is tiny.\n\nThat's way too long to allow him to be that close to you.","replies":[{"poster":"InsaneSamurai","date":"2015-07-17T14:30:48.038+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=John JJ Schmidt,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=0002000000000000,timestamp=2015-07-17T13:47:40.110+0000)\n>\n> and a very slow attack speed.\n> \n> And then he has to devour you, which means he's still standing directly on top of you; the range is tiny.\n> \n> That's way too long to allow him to be that close to you.\n\nDevour is far from \"standing right on top of you\" range, and the dude has a 5 sec cd slow.  You basically cannot farm while the adc freezes lane or you will be attacked.  If you are hit one time you have to back off or he might q, hit you again, and instantly kill you.  This is not even remotely balanced.","replies":[{"poster":"John JJ Schmidt","date":"2015-07-17T16:13:54.021+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=InsaneSamurai,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=00020000000000000000,timestamp=2015-07-17T14:30:48.038+0000)\n>\n> Devour is far from \"standing right on top of you\" range, and the dude has a 5 sec cd slow.  You basically cannot farm while the adc freezes lane or you will be attacked.  If you are hit one time you have to back off or he might q, hit you again, and instantly kill you.  This is not even remotely balanced.\n\nI just don't understand what you and your support are doing while he's out front of the wave, within melee range, and auto attacking you twice. You should be pounding the hell out of him with your huge range disparity. And that's without considering any type of CC you or you support bring to the table.","replies":[{"poster":"InsaneSamurai","date":"2015-07-17T16:28:24.751+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=John JJ Schmidt,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=000200000000000000000000,timestamp=2015-07-17T16:13:54.021+0000)\n>\n> I just don't understand what you and your support are doing while he's out front of the wave, within melee range, and auto attacking you twice. You should be pounding the hell out of him with your huge range disparity. And that's without considering any type of CC you or you support bring to the table.\n\nHave you played against a decent Tahm doing this?  It sure sounds like you're just making theories assuming the only way he can devour is to run up to you and auto.\n\nAll he has to do is hit one q when your sup doesn't have CC ready and that's it.  We're talking an instant guaranteed kill unless you have flash as soon as he hits that 2nd auto.  He will take risks for it and take damage for it, because if he lands it, you're dead and his adc gets (more)free farm.","replies":[{"poster":"John JJ Schmidt","date":"2015-07-17T20:36:57.452+0000","up_votes":1,"down_votes":0,"body":"I'm level 5 on Tahm, been playing him support since he launched. If I tried to go in and AAx2+devour every time I q'd, I'd feed like crazy. You, your sup, and most likely the minion wave, can do a crapload of dmg to me long before I can devour you, walk you three steps at 90% slowed, and spit you out. Assuming I was maxing Q first for the increased slow, my W would do crap damage.\n\nCompare that to Blitz instantly pulling you past the wave and onto the ADC, or Thresh hooking and flaying, or Morg Binding and soiling. Those all happen way faster, from long distance, and are much more dangerous.","replies":[]}]}]}]}]}]}]},{"poster":"GundayMonday","date":"2015-07-17T15:08:51.652+0000","up_votes":1,"down_votes":0,"body":"{{champion:72}} {{champion:429}} XD Oh man, I'm going to have to try that.","replies":[]}]},{"poster":"LetsGtFckinNasty","date":"2015-07-16T19:53:34.711+0000","up_votes":3,"down_votes":3,"body":"you can do it with blitz too.  its not broken.","replies":[{"poster":"junglerboy16","date":"2015-07-16T22:22:10.444+0000","up_votes":2,"down_votes":1,"body":"in fact, Blitz does it better anyway since his grab is ranged and doesn't require stacking hits on the enemy first.","replies":[{"poster":"InsaneSamurai","date":"2015-07-16T23:17:46.757+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=junglerboy16,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=00010000,timestamp=2015-07-16T22:22:10.444+0000)\n>\n> in fact, Blitz does it better anyway since his grab is ranged and doesn't require stacking hits on the enemy first.\n\nI think we're talking about different things.","replies":[{"poster":"Durzaka","date":"2015-07-16T23:21:08.898+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=InsaneSamurai,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=000100000000,timestamp=2015-07-16T23:17:46.757+0000)\n>\n> I think we're talking about different things.\n\nYoure referring to Tahm Devour into Kalista ult.\n\nHe is talking about Blitz grab into Kalista ult.\n\nThe exact same result without the required build up.","replies":[{"poster":"3TWarrior","date":"2015-07-17T02:17:37.389+0000","up_votes":3,"down_votes":0,"body":"blitzcrank doesn't \"hold\" the enemy though\n\nas another post mentions, skarner does, but put it this way\n\nfor the duration of devour, Tahm kench and the enemy are considered as the same unit.  Kalista's ult places tahm into a stasis-like state which freezes his timers.  Tahm then reemerges about 900 distance away from kalista after a 2-3 second delay, then can continue moving for another 1-3 seconds depending upon how good kalista was with her timing\n\nblitzcrank if ulted separates from the enemy, although able to be thrown directly onto the enemy for an additional stun on top of his combo, is not the same as taking the enemy to your tower\n\nnow put it simply, kalista can ult her soul-bound from X distance away...I think it's also 900, then can walk about 600 or so in the time of her ult\n\nso, optimal scenario, tahm 900 units away devours an enemy, kalista ults him, walks 600 distance, spits tahm out 900 more distance, tahm walks about 450\n\ntotal, you just moved someone a pantheon's ult from their original position","replies":[{"poster":"Durzaka","date":"2015-07-17T03:18:20.241+0000","up_votes":1,"down_votes":1,"body":"and?\n\nThat is an amazing combo that requires a very specific set of circumstances to happen. It also requires the use of an ultimate and a skill that requires 3 hits from Tahm and him being in melee range.\n\nCombos are combos and they should exist in the game.","replies":[{"poster":"InsaneSamurai","date":"2015-07-17T14:29:08.204+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Durzaka,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=000100000000000000010000,timestamp=2015-07-17T03:18:20.241+0000)\n>\n> and?\n> \n> That is an amazing combo that requires a very specific set of circumstances to happen. It also requires the use of an ultimate and a skill that requires 3 hits from Tahm and him being in melee range.\n> \n> Combos are combos and they should exist in the game.\n\nA very specific set of circumstances?  Getting attacked 2 times by a tanky support who stands between you and your minions(or slowed, attacked once, and slowed again)?  That is really not that specific or hard to accomplish, and its surely not so difficult to pull off that they should be awarded the lane immediately.","replies":[{"poster":"3TWarrior","date":"2015-07-17T15:57:21.504+0000","up_votes":1,"down_votes":0,"body":"it's pretty much just the LCS manager's solution to \"ban thresh\" or \"ban blitz\"\n\nwhy have an off tank bruiser support when you can have  an ubertank whose damage scales with hp\n\nIf mundo scaled with hp, no one in league could stop him XD.  his healing does, but not his damage and damage tends to outvalue healing","replies":[]}]},{"poster":"3TWarrior","date":"2015-07-17T15:59:30.514+0000","up_votes":1,"down_votes":0,"body":"specifically as a response, it's not a combo but a bug induced by bad coding\n\nor in this case, an unintentional mechanic introduced by good coding that riot does not put into practice with other champions","replies":[{"poster":"Durzaka","date":"2015-07-17T17:34:07.104+0000","up_votes":1,"down_votes":0,"body":"So was ward hopping.\n\nWhat's your point?","replies":[]}]}]},{"poster":"JustMyBassCannon","date":"2015-07-17T18:11:24.207+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=3TWarrior,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=00010000000000000001,timestamp=2015-07-17T02:17:37.389+0000)\n>\n> blitzcrank doesn't \"hold\" the enemy though\n\nNo, he just bursts the fuck out of them with E-R, while the rest of his team doesn't have to wait 2 seconds to start killing the target.\n\nBeing in stasis for 2 seconds between getting pulled and getting the shit beat out of you doesn't make Tahm worse than Blitzcrank.\n---\nAs for your math, Blitzcrank Q is 925 range, and Kalista's ult pull range is 1400. Blitz+Kalista can pull someone a total distance of 2325 within 1 second.\n\nTahm's W is 250 range to eat, 650 to spit up, and the dash range on Kalista's ult is 1200. Total distance, Tahm+Kalista is a 3500-range pull over 4 seconds, not including time spent building stacks for Devour.\n\nFancy that, the combo that requires a hell of a lot more setup and time can pull enemy champs further away.","replies":[]},{"poster":"InsaneSamurai","date":"2015-07-17T14:46:34.738+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=3TWarrior,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=00010000000000000001,timestamp=2015-07-17T02:17:37.389+0000)\n>\n> blitzcrank doesn't \"hold\" the enemy though\n> \n> as another post mentions, skarner does, but put it this way\n> \n> for the duration of devour, Tahm kench and the enemy are considered as the same unit.  Kalista's ult places tahm into a stasis-like state which freezes his timers.  Tahm then reemerges about 900 distance away from kalista after a 2-3 second delay, then can continue moving for another 1-3 seconds depending upon how good kalista was with her timing\n> \n> blitzcrank if ulted separates from the enemy, although able to be thrown directly onto the enemy for an additional stun on top of his combo, is not the same as taking the enemy to your tower\n> \n> now put it simply, kalista can ult her soul-bound from X distance away...I think it's also 900, then can walk about 600 or so in the time of her ult\n> \n> so, optimal scenario, tahm 900 units away devours an enemy, kalista ults him, walks 600 distance, spits tahm out 900 more distance, tahm walks about 450\n> \n> total, you just moved someone a pantheon's ult from their original position\n\n^ This :)","replies":[]}]},{"poster":"junglerboy16","date":"2015-07-16T23:52:04.672+0000","up_votes":2,"down_votes":0,"body":"Precisely :D","replies":[]}]}]}]},{"poster":"Theorchero","date":"2015-07-17T14:29:36.588+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nastyyy,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=0001,timestamp=2015-07-16T19:53:34.711+0000)\n>\n> you can do it with blitz too.  its not broken.\n\nBut it's insanely difficult and requires godly timing.","replies":[]}]},{"poster":"brad","date":"2015-07-16T19:22:45.628+0000","up_votes":1,"down_votes":0,"body":"what","replies":[{"poster":"Profirix","date":"2015-07-16T19:40:44.467+0000","up_votes":3,"down_votes":1,"body":"Devour + kalista ult drags eaten champ along for the ride. You can eat, pull and throw an enemy under your turret from miles away.","replies":[{"poster":"brad","date":"2015-07-16T19:44:12.335+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=profirix,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=00000000,timestamp=2015-07-16T19:40:44.467+0000)\n>\n> Devour + kalista ult drags eaten champ along for the ride. You can eat, pull and throw an enemy under your turret from miles away.\n\nholy shit","replies":[]}]}]},{"poster":"InsaneSamurai","date":"2015-07-16T23:24:14.835+0000","up_votes":2,"down_votes":1,"body":"Blitz grabbing you into a Kalista ult can't put you behind the enemy turret from halfway down the lane(or farther), unless that is also bugged in some way I haven't seen yet.  \n\nIf so, I'm imagining it works the same way as the old thresh lantern thing(which they disabled, right?), but in that case I'd still be surprised if Blitz could launch out of Kalista before the pulled champ stopped moving.","replies":[]},{"poster":"InsaneSamurai","date":"2015-07-17T19:05:58.638+0000","up_votes":1,"down_votes":0,"body":"That's assuming they could time the blitz pull with 100% efficiency.  The Tahm thing is ridiculously easier to execute.  You're acting like that extra time makes it worse.  It doesn't.  All that extra time, the ADC or sup is helpless inside his belly, waiting to be deposited under the turret for a free kill.  You can't do anything about it, the extra time just helps the enemy make it worse on you.","replies":[{"poster":"JustMyBassCannon","date":"2015-07-17T20:40:38.884+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=InsaneSamurai,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=0006,timestamp=2015-07-17T19:05:58.638+0000)\n>\n> That's assuming they could time the blitz pull with 100% efficiency.  The Tahm thing is ridiculously easier to execute.  You're acting like that extra time makes it worse.  It doesn't.  All that extra time, the ADC or sup is helpless inside his belly, waiting to be deposited under the turret for a free kill.  You can't do anything about it, the extra time just helps the enemy make it worse on you.\n\nAnd **you** are assuming they can execute the Tahm/Kalista combo with 100% efficiency. Which is **harder,** because you have to account for *the rest of the enemy team disrupting your combo.*\n\nBlitzcrank sits at the edge of vision, throws a fist, disappears, suddenly you're in the middle of the enemy team. But you're okay with that.\n\nTahm *walks up to you,* slaps you a few times, then munches you and gets a free ride from his teammates, and you're in the middle of the enemy team. It's the same scenario, taking much more time.","replies":[{"poster":"InsaneSamurai","date":"2015-07-17T21:36:33.577+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JustMyBassCannon,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=00060000,timestamp=2015-07-17T20:40:38.884+0000)\n>\n> And **you** are assuming they can execute the Tahm/Kalista combo with 100% efficiency. Which is **harder,** because you have to account for *the rest of the enemy team disrupting your combo.*\n> \n> Blitzcrank sits at the edge of vision, throws a fist, disappears, suddenly you're in the middle of the enemy team. But you're okay with that.\n> \n> Tahm *walks up to you,* slaps you a few times, then munches you and gets a free ride from his teammates, and you're in the middle of the enemy team. It's the same scenario, taking much more time.\n\nI know you really like arguing with me, but come on man.  The entire team is rarely going to be bot lane during the laning phase, and you're once again acting like it's just as easy to pull off the extremely specific timing of the Blitz+Kalista(which also shouldn't exist, so why even argue about it in the first place?) as it is to land the Tahm combo, which is point and click with a very generous combo window.","replies":[{"poster":"JustMyBassCannon","date":"2015-07-17T22:19:18.313+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=InsaneSamurai,realm=NA,application-id=3ErqAdtq,discussion-id=8lUc7lU6,comment-id=000600000000,timestamp=2015-07-17T21:36:33.577+0000)\n>\n> I know you really like arguing with me, but come on man.  The entire team is rarely going to be bot lane during the laning phase,\n\nAnd I'm not arguing just lane phase. I'm arguing on the premise of the game as a whole. The laning phase is *easier* to handle than team fights.\n> and you're once again acting like it's just as easy to pull off the extremely specific timing of the Blitz+Kalista(which also shouldn't exist, so why even argue about it in the first place?) as it is to land the Tahm combo, which is point and click with a very generous combo window.\n\nA generous combo window also has a generous interrupt window. There is counter-play to the combo. CC Kalista. CC Tahm. Kill one or the other. Pull your own teammate out of the fight, if you have that ability. Don't stand there and watch him do it, then complain that he got away with it.","replies":[]}]}]}]},{"poster":"ChaosThief","date":"2015-07-17T16:48:18.846+0000","up_votes":1,"down_votes":0,"body":"But... but the clown cars...","replies":[]},{"poster":"SeductiveGrandpa","date":"2015-07-16T20:47:21.414+0000","up_votes":3,"down_votes":3,"body":"No. IGNORE THIS THREAD, DONT SAY ANYTHING, STOP IT FROM BEING POPULAR! WE NEED THIS! **WE NEED THISSSSSSSSSSSSSSSSSSSS**","replies":[]}]}