{"poster":"InsaneSamurai","date":"2015-03-12T10:56:25.076+0000","title":"\"Shitting on people is fun. Therefore, Lee Sin is very fun. But Lee Sin probably shouldn't...","subforum":"Gameplay","up_votes":48,"down_votes":10,"body":"just shit on people.\"\n\nSo maybe do something about it?  Another patch going by with nothing done to him is just sad.  You're losing players to this biased madness at this point.\n\nEdit: BTW, Morello said that, so they do actually know he's a problem.","replies":[{"poster":"Gank in Progress","date":"2015-03-12T11:31:42.025+0000","up_votes":7,"down_votes":16,"body":"im stopping to play league more often because of vi lee and j4 still being the only viable junglers aside from some newcomers like seju or nidalee\n\ntank buffs are nice and all, lee is still outdoing EVERY other tnak in the game","replies":[{"poster":"Schteltzer","date":"2015-03-12T14:23:22.755+0000","up_votes":16,"down_votes":2,"body":"if you think they are the only viable junglers then you are definitely wrong..","replies":[{"poster":"Junkο","date":"2015-03-12T19:52:22.566+0000","up_votes":4,"down_votes":5,"body":"You have clearly never been counterjungled by Vi, Lee Sin or Jarvan if you think other junglers can stand up to them","replies":[{"poster":"Schteltzer","date":"2015-03-12T20:24:23.052+0000","up_votes":4,"down_votes":1,"body":"oh my god there are champs who can counterjungle\n\nguess what, they are also not the only ones who have a strong 1v1 and can counterjungle you","replies":[{"poster":"Junkο","date":"2015-03-12T21:18:31.116+0000","up_votes":3,"down_votes":1,"body":"Most of them can only fight the jungler if he is weak from clearing camps and usually die if they get caught out. Vi, Lee Sin and Jarvan (and Rek'sai, but she actually got nerfed aside from lovetaps, though Vi did too a bit) can all fight and win even when the enemy jungler  isn't at low health and if they get caught out they just use their mobility to get away.","replies":[{"poster":"Schteltzer","date":"2015-03-12T21:49:32.175+0000","up_votes":1,"down_votes":0,"body":"that's what they have always been doing\n\nalso all of them have a main damage spell that if dodged will reduce their damage output and 1v1 potential significantly (especially Jarvan)","replies":[{"poster":"Chessburger","date":"2015-03-13T00:11:55.123+0000","up_votes":1,"down_votes":0,"body":"You can curbstomp a lee with pretty much anything you can think of if you play the matchup well. Not 1v1 most of the time of course but in terms of having an effect on the game. I snicker with delight when the enemy picks lee and I'm jungle.\n\nHe's only good if you're extremely good with him or if the people you're stomping aren't.","replies":[]},{"poster":"Juicyman","date":"2015-03-13T00:47:04.776+0000","up_votes":1,"down_votes":2,"body":"Yes they have always been doing that. Why do you think jungler diversity has been terrible for 4 seasons now? Why do you think these are typically the only junglers picked?","replies":[]}]}]}]},{"poster":"Chespin2013","date":"2015-03-13T06:56:00.297+0000","up_votes":1,"down_votes":0,"body":"this guy was made for that purpose {{champion:20}}","replies":[{"poster":"Junkο","date":"2015-03-13T14:54:19.509+0000","up_votes":1,"down_votes":0,"body":"Ah the good old days of walking into enemy jungle solo as Nunu and stealing the buff and getting out alive. Surprisingly without any decent mobility too","replies":[]}]}]},{"poster":"Oelyk","date":"2015-03-12T19:54:38.849+0000","up_votes":1,"down_votes":0,"body":"Glad i don't have to listen to the meta in silver. took heal by accident on kha jungle and had to back after every 1-3 camps but ended 6-2 by snowballing mid and top (nasus and lux) viable jungles don't have to be strong in one way each has there own strengths. like slicing people apart. thats always good.","replies":[{"poster":"Chessburger","date":"2015-03-13T00:21:51.199+0000","up_votes":2,"down_votes":0,"body":"Kha gets really good at 11 if you're not too behind. The evolved Q + safety with resets on E is awesome.\n\nBtw just for fun do what I do. See a Lee complaint thread, look at their lolking. 9/10 they're bronze or low silver, the former is the case with our original poster.\n\nAlso as a side note. Almost anything is viable if you're good with it and it makes sense in theory.","replies":[{"poster":"Klatn Yelox","date":"2015-03-14T01:22:12.173+0000","up_votes":1,"down_votes":0,"body":"I don't see what OP being bronze has to do with anything. I'm bronze, and I see Lee Sin as one of the funniest things to see on the enemy. Really. Lee Sin has one of the highest skill floors in the game, and its hilarious. I know for sure I can't play him, so I play different champs. And when Lee Sin invades my jungle at level 7 against me as Nunu, and steals blue, and still thinks he can get out, I find it funny. So he ward jumps the blu buff wall. I got flash. So he flashes over the inner wall of the river. I got him slowed with my second q and a speed boost, and he is at 1/3 health. I get one more q on him, and he will be critically low. Easy peasy to kill him usually. Happened at least 5 times in memory.","replies":[{"poster":"Chessburger","date":"2015-03-14T01:47:47.373+0000","up_votes":1,"down_votes":0,"body":"I don't mean to berate but it's just a funny observation that it's mostly very low elos complaining about a champion with a really high skill cap that is very underwhelming when not played up to a standard. \n\nIt is all relative to the skill of other people in the game but still.... Do people realize how much something extremely straight-forward like a Xin Zhao can sky-rocket you out of bronze/silver if you have a half patched up understanding of the jungle and the game in general?\n\nAnyone who would beat you so hard in low elo so as to make you come on the forums and cry about it is generally not somebody who deserves to be in the elo he's in and is going to rise out eventually.\n\nI like your attitude though, you seem like a player who will learn fast and rank up. :)","replies":[{"poster":"Klatn Yelox","date":"2015-03-14T02:04:13.453+0000","up_votes":1,"down_votes":0,"body":"Well thanks, I like to think so too. Though being I no longer play Solo Queue, it will be hard, unless I find a good team who thinks like me. \n\nOn another note, I do see people with Gold borders in about 1/3 of my normal queue games now, and very often see Silver borders, so I know I probably should say I am Bronze anymore. \n\nAnd on a third note, I have decided I don't care too much about my ELO rating, because I can see that as I get into higher skill tiers, I will have fewer \"Good\" games, as the champions with a high skill floor will become more viable, and bring more snowballing potential and late game outscaling potential. I value the good games, and while I can have fun playing AP Nasus top, pushing lanes all day and generally making it impossible for the enemy to group in a team fight, I don't do so often because it feels too onesided. I don't feel rewarded for my skill, but rather for my build. Which should never be the sole reason you can win, especially on such a gimmicky build. However, there is good news for that build, as Luden's Echo essentially adds 15% more AP Ratio to that E we all know and love. It does more for other champs, but hey! when the item fits, use it.","replies":[]}]}]},{"poster":"RikoZerame","date":"2015-03-13T03:26:04.941+0000","up_votes":0,"down_votes":0,"body":"I don't think I'll ever get that. I've only rarely had a good Lee Sin here in mid-Bronze.\n\nMy last game was a welcome exception. Guy was good; didn't have any \"When the Q Lands\" moments.","replies":[{"poster":"InsaneSamurai","date":"2015-03-13T17:37:00.837+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RikoZerame,realm=NA,application-id=3ErqAdtq,discussion-id=BKhriQ0J,comment-id=00010000000100000000,timestamp=2015-03-13T03:26:04.941+0000)\n>\n> I don't think I'll ever get that. I've only rarely had a good Lee Sin here in mid-Bronze.\n> \n> My last game was a welcome exception. Guy was good; didn't have any \"When the Q Lands\" moments.\n\nWhen they aren't new to Lee, they basically take over both jungles and starve the enemy jungler, and there's nothing you can do about it because Lee scales better early game than everyone else, and he's impossible to catch on the rare occasion you actually start winning a fight.","replies":[{"poster":"Chessburger","date":"2015-03-13T23:34:18.623+0000","up_votes":1,"down_votes":0,"body":"http://www.lolking.net/summoner/euw/19690690#matches/2010615602 the 10 2 11 nautilus game. Toggle details. \n\nI went from kruggs to red and he did gromp and invaded and killed me at red at lvl 2. I curb stomped the game back in his face by playing well, predicting his movements and pulling a few successful counter-ganks back to back. After that he was useless.\nI'd put more examples but as I may have mentioned Lee is kinda rare atm.\n\nAnd do note the guy is a Master 1 lee sin main with a 22/7 W/L record on him this season against other high diamonds+.\n\nAnd no he wasn't \"messing around in normals.\" Even if he was playing it on 20% of his capability he would still beat the bloody hell out of most of the player base.","replies":[]}]}]}]}]}]}]},{"poster":"SmokingPuffin","date":"2015-03-12T17:40:13.334+0000","up_votes":6,"down_votes":0,"body":"Nerfing Lee is challenging.  It's not a matter of simply adjusting numbers -- they've done that a dozen times and it never sticks.\n\nWhat he needs is real weaknesses.  Right now the only one you can really point at is \"it's easy to fail on this guy\".  He needs to have downsides that good players actually care about.  \n\nMaybe \"isn't very good at killing jungle monsters\", \"is pretty squishy when you catch him\", or \"has a hard time initiating teamfights\" -- these aren't actually true about him today, but if you picked one or two and made it true about him tomorrow, possibly he wouldn't be this obnoxiously good at everything guy that works in every rendition of the jungle ever.","replies":[]},{"poster":"FHMarshy","date":"2015-03-12T14:18:07.114+0000","up_votes":4,"down_votes":6,"body":"Even tho they said Lee is a problem, I really don't feel all that threatened when up against a Lee compared to other junglers like Vi , J4, Rek, Nid, or even Amumu or Fid. \n\nHe requires good mechanics and decision making to do well, which....unfortunately not a lot of people posses the skills to play him well.","replies":[{"poster":"Thefriendlyorc","date":"2015-03-12T18:19:38.506+0000","up_votes":4,"down_votes":0,"body":"If he can land a skill shot with barely any cd and let's face it, no cost, he can get scary. His r deals far too much damage imo for a bruiser, it out scales some mages ults with one item he can do 700+ in an aoe while being as tanky and evasive.","replies":[{"poster":"junglerboy16","date":"2015-03-12T20:09:04.988+0000","up_votes":1,"down_votes":0,"body":"That's because he wasn't supposed to be a bruiser, he was an assassin. They just screwed up his numbers in a way that forces the \"erm mer gersh mer ferce is meltin'!\" early damage but falls off tremendously late game if not ahead by a ton. if they rebalanced him into a proper, squishy assassin that had to worry about blowing up in a fight (but also didn't just fall off damage-wise), that would address a lot of his problems because you would have a chance to kill the b**tard.","replies":[{"poster":"Thefriendlyorc","date":"2015-03-12T20:24:10.684+0000","up_votes":4,"down_votes":0,"body":"Yup,  he's an assassin with fighter stats. Meaning he can burst hard early without being punished for his mistakes. As all his cool downs are low. Besides, Late game he builds like a fighter and his insane utility carry him beyond his damage numbers. On other words,  he has no weak point in the game.","replies":[{"poster":"Black Paper Moon","date":"2015-03-13T03:36:15.833+0000","up_votes":2,"down_votes":1,"body":"Lee Sin has the highest ability damage and scaling of any mainstream jungler with his Q E R Q combo, dealing over 1,100 base damage with 480% bonus AD scaling on it plus an 8% missing health execute.\n\nAnyone who thinks Lee \"scales badly\" is delusional: what's happening is that his base numbers are so high that he can afford to just build a Warrior Enchant and then go full tank while still being having kill potential on anyone that doesn't build tanky. Offensive Lee Sun may die easily in team fights, but that applies equally to all melee bruisers. It doesn't change the fact that his ratios are ridiculously high.\n\nRegarding counterjungling, Lee Sin's kit will demolish virtually anyone else 1v1. While some champs like J4 or Vi need to use their mobility abilities to deal damage and win a 1v1 and can thus be caught easily by lane mates if they commit to fight your jungler, Lee Sin can unleash his full offensive combo and still ward-hop over a wall if things turn south. The degree of risk that Lee Sin is exposed to while counterjungling is far too low considering that a lot of potential junglers are getting their ass kicked in the first 2 clears.\n\nBut really, none of this should be news: every jungler who played during season 4 should know this. The S4 jungle meta amounted to \"play Lee Sin and people that Lee Sin doesn't shit on\", like Elise or Kha'Zix. Anyone else was just meat thrown to the grinder.","replies":[{"poster":"Thefriendlyorc","date":"2015-03-13T14:31:35.519+0000","up_votes":1,"down_votes":0,"body":"Its been true for a long time yes, play lee or someone he cant instagib in order to survive the swarm of lee wins. He's got a low ban rate because his skill set is intimidating to noobs in the lower ranks but in the hands of the barely competent, he becomes a force to be reckoned with.","replies":[]}]}]}]}]}]},{"poster":"junglerboy16","date":"2015-03-12T20:04:06.958+0000","up_votes":1,"down_votes":0,"body":"They said they intended to hit him this/the next PBE patch, once they have better changes set up that don't outright destroy him but still make him not be so oppressive. You do realize they can only fit in so much stuff each patch or else the patches take a lot longer to put out (because bug fixing requires more time for more stuff needing bugs fixed, obviously). They knocked down J4 last patch, knocked down Nidalee this patch, addressed *some* issues with Vi's early game power, and clearly have their sights set on Lee as the next of the god tier junglers they want to finally topple.","replies":[{"poster":"Ariel the Cruel","date":"2015-03-12T22:02:03.511+0000","up_votes":2,"down_votes":0,"body":"Given the back lash (we all know it'll come). Lee will probably be the sole inhabitant of that patch.\n\n. . . Gotta make room for all that hot air.","replies":[{"poster":"junglerboy16","date":"2015-03-13T01:39:00.028+0000","up_votes":2,"down_votes":0,"body":"I think Riot may finally have gotten to the point where they're like \"yeah, that backlash against our last Lee changes was pretty big, but it was nowhere near as annoying as the constant 'nerf Lee so OP!' threads we have to read every day are.\"","replies":[{"poster":"Ariel the Cruel","date":"2015-03-13T02:23:50.733+0000","up_votes":1,"down_votes":0,"body":"> ***'nerf Lee so OP!' threads*** we have to ***read*** every day are.\"\n\nThat statement borders on oxymoron. (x_x)","replies":[{"poster":"junglerboy16","date":"2015-03-13T20:22:35.334+0000","up_votes":1,"down_votes":0,"body":"You're right, I should have said:\n> 'nerf Lee so OP!' threads we have to ***ignore*** every day are.\"","replies":[{"poster":"Ariel the Cruel","date":"2015-03-13T20:39:59.615+0000","up_votes":1,"down_votes":0,"body":"Theeeere we go.\nBoards should be happy now. XD","replies":[]}]}]}]}]}]},{"poster":"Ice Weasel X","date":"2015-03-12T14:35:52.918+0000","up_votes":3,"down_votes":1,"body":"> Lee Sin is very fun. Shitting on people is fun. Therefore, Lee Sin is very fun. But Lee Sin probably shouldn't just shit on people.\n\nI can't help but laugh at the visual ({{champion:64}}: ...) that statement gave me.  Lee Sin flies from target to target with Resonating Strike, Safeguard, and Dragon's Rage.  He does his best impression of a city pigeon, literally leaving turds on everyone's heads and muttering about smelly opponents under his breath.","replies":[]},{"poster":"Retillin","date":"2015-03-12T13:41:31.081+0000","up_votes":1,"down_votes":0,"body":"(I'm not knocking you or your post here) This has been posted a few times already. Even with a link to the Game Spot article. http://www.gamespot.com/articles/balancing-an-esport-and-designing-the-jungle-an-in/1100-6425770/ But for some reason people just don't seem to comment on these posts. I thought for sure they would be busy.","replies":[{"poster":"Envy Sin","date":"2015-03-12T14:32:21.690+0000","up_votes":3,"down_votes":1,"body":"We used to, Then we gave up.\n\nRiot will only nerf lee when the LC$ big plays he makes get boring, In other words, When a more retardedly broken/overloaded jungler comes out.","replies":[{"poster":"Ariel the Cruel","date":"2015-03-12T22:03:53.991+0000","up_votes":1,"down_votes":0,"body":"Bard says, \"Hi\".\n\n(This is a joke)","replies":[]}]}]},{"poster":"Sarutobi","date":"2015-03-12T11:20:24.724+0000","up_votes":4,"down_votes":3,"body":"i think the community has known that the people working at Riot know about Lee's problems, as well as other champs. the main reason nothing is done is because of big LCSPlays! you gut champs like Lee people will not watch LCS!","replies":[{"poster":"Chessburger","date":"2015-03-13T00:34:34.747+0000","up_votes":1,"down_votes":2,"body":"Pretty much nobody has played lee and done well with it this season in NA EU LCS as far as I remember and I did watch a lot of those games. It's kind of a rarity to see him in competitive atm.","replies":[]}]},{"poster":"Kuroi86","date":"2015-03-13T11:29:05.396+0000","up_votes":1,"down_votes":0,"body":"Gee, Riot is working on a problem, but since they refuse to gut a champion players continue to complain and make empty threats.\n\nHere's a thought, if you're ready to leave the game, just leave.","replies":[{"poster":"InsaneSamurai","date":"2015-03-13T17:47:15.678+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kuroi86,realm=NA,application-id=3ErqAdtq,discussion-id=BKhriQ0J,comment-id=000f,timestamp=2015-03-13T11:29:05.396+0000)\n>\n> Gee, Riot is working on a problem, but since they refuse to gut a champion players continue to complain and make empty threats.\n> \n> Here's a thought, if you're ready to leave the game, just leave.\n\nI pretty much have.  The community was the main issue that never got improved, but once I realized that Riot is running this train full speed in the wrong direction with no regard for what the non-pro players think, I lost hope. I still have friends that play, and they are good people so I will still hop on from time to time just to hang out with them, but I will do so knowing this game will be more and more about mobility, more about having a support role that people don't want to play but Riot feels it needs to be reinforced outside the meta, and more about having a small handful of viable junglers.  The core game is still great, and Riot still does a great multitude of things very well with this, but at this point I just don't see this progressing toward being a better game anymore.  It's also quite refreshing to play a different game where the general focus of players is to *play the game* instead of complain, blame, and insult each other.","replies":[{"poster":"Kuroi86","date":"2015-03-13T20:19:19.035+0000","up_votes":1,"down_votes":0,"body":"> It's also quite refreshing to play a different game where the general focus of players is to play the game instead of complain, blame, and insult each other.\n\nReally my only major gripe with this game.\nThe community has been horrible from day one.  It has only been the core experience of the game and the rare super close heated game that has kept me interested. \n\nThere are good players on League, smart and capable players willing to admit when they are wrong.\nBut the number of entitled pricks and a'holes that need a swift kick to the {{champion:17}} is simply staggering. =/","replies":[]}]},{"poster":"Trylobyte","date":"2015-03-13T11:37:49.489+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kuroi86,realm=NA,application-id=3ErqAdtq,discussion-id=BKhriQ0J,comment-id=000f,timestamp=2015-03-13T11:29:05.396+0000)\n>\n> Gee, Riot is working on a problem, but since they refuse to gut a champion players continue to complain and make empty threats.\n> \n> Here's a thought, if you're ready to leave the game, just leave.\n\nWhat's funny is if they do gut the champion like they accidentally did to Kassadin, people will complain *even louder.*\n\nAll of you who keep saying LCSBigPlays are obviously not watching the LCS because Lee has, by LCS standards, a mediocre pick rate, negligible ban rate, and almost perfectly even win rate.  He is the very definition of 'boring vanilla jungler' and I remember one commentator even stating that.","replies":[]}]},{"poster":"Jarrito232","date":"2015-03-13T03:00:13.598+0000","up_votes":1,"down_votes":0,"body":"Next patch. It takes time to nerf or buff without destroying the game.","replies":[{"poster":"InsaneSamurai","date":"2015-03-13T17:39:24.137+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jarrito232,realm=NA,application-id=3ErqAdtq,discussion-id=BKhriQ0J,comment-id=000d,timestamp=2015-03-13T03:00:13.598+0000)\n>\n> Next patch. It takes time to nerf or buff without destroying the game.\n\nIt didn't take time for them to gut/ruin other champs.   They just won't do it to the precious mobility champs who aren't Kassadin.","replies":[{"poster":"Jarrito232","date":"2015-03-13T18:58:08.244+0000","up_votes":1,"down_votes":0,"body":"Wasn't the community whining about Kassadin's insane mobility before the nerfs?","replies":[]}]}]},{"poster":"The Fat Punisher","date":"2015-03-13T11:38:49.945+0000","up_votes":1,"down_votes":0,"body":"What exactly makes lee sin so broken? when i play against he just fucks my team and i never know why. when i play him none of his abilities really have significant damage.\n\nwhat the fuck am i missing? what is he doing that is so great.","replies":[]},{"poster":"Athelious","date":"2015-03-13T08:11:40.745+0000","up_votes":1,"down_votes":0,"body":"I just don't get the mentality of these forums you guys whine that jungle diversity is low, so what do you do? You complain and whine that they need to nerf Lee Sin....so let me get this right you guys want jungle diversity but at the same time you want to lower it by kicking Lee out? Immediately you contradict yourself by saying this and by supporting Lee to get nerfed, you as a player only want to hurt the jungle even more. On a second note don't give me the crap that he's a good jungler right now, because junglers like sejuani and vi have become more dominate than he has, but why do i even bother i am probably going to get downvoted because these forums act like a dictatorship if anyone lacks any common sense there is a reason why riot likes their reddit forums more than these.","replies":[]},{"poster":"Budupops","date":"2015-03-12T23:00:35.286+0000","up_votes":1,"down_votes":0,"body":"Riot has known he was going to be a problem when they started designing him.","replies":[]},{"poster":"Crett","date":"2015-03-12T18:14:42.768+0000","up_votes":1,"down_votes":0,"body":"The simple answer is that Lee Sin is *not* a simple problem for Riot","replies":[]},{"poster":"Yfrappefort","date":"2015-03-12T17:35:19.028+0000","up_votes":1,"down_votes":0,"body":"I'm guessing it's only a matter of time now. Probably in 5.6 or 5.7\n\nIf it goes further then that, Riot is gonna feel even less credible...","replies":[]},{"poster":"Ragnar42","date":"2015-03-12T11:52:11.950+0000","up_votes":1,"down_votes":0,"body":"I think we should withhold judgement for this new patch.  Easier Jungle, new items that are kinda cool.  It may make for a more interesting and varied champion pool.","replies":[]}]}