{"poster":"AntiqueRoses","date":"2017-11-24T20:01:52.318+0000","title":"Unsere orangenen Essenzen wurden uns geklaut!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich bin so w&uuml;tend und f&uuml;hle mich gezwungen mich mal zu melden. Die ist ein Beitrag wo &uuml;ber die Ver&auml;nderungen in der Preseson gesprochen wird : https://nexus.leagueoflegends.com/en-us/2017/09/upcoming-changes-to-leveling-ip-rewards/\r\n\r\nDu wurde NIE &uuml;ber ORANGENE ESSENZEN gesprochen. Auch im Cilent wurde nur auf die Championchards hingewiesen da war nichts mit entzaubert auch eure Skinshards.... Ich besitze 2 Legendary und 2 Epic Skins ich h&auml;tte sie gerne noch entzaubert ABER niemand hat irgendwem etwas gesagt. \r\n\r\nIch habe heute einen Beitrage gesehen von vor 3 Monaten da spricht ein Riot Mitarbeiter dar&uuml;ber das auch die orangenen Essenzen an wert verlieren: https://boards.euw.leagueoflegends.com/en/c/help-support-en/mYrwk2cY-a-question-about-orange-essence-in-preseason\r\n\r\nDoof nur das das wie offiziell angek&uuml;ndigt wurde. Es ist eine schweinerei ohne Vorwarung einfach den Preis zu senken. Man h&auml;tte ja mal ein Wort sagen k&ouml;nnen ich meine ist ja schon ein wichtiger Spielaspekt.\r\n\r\nIch m&ouml;chte meine Skins f&uuml;r den alten Preis entzaubern k&ouml;nnen! Wieso durften wir das nicht!","replies":[{"poster":"legofreak1","date":"2017-11-24T21:03:57.209+0000","up_votes":1,"down_votes":0,"body":"> Du wurde NIE über ORANGENE ESSENZEN gesprochen. \n\n-\n\n> **LOOT REBALANCING**\nSince you’ll be getting so many more shards thanks to the new leveling system (and with other recent changes to honor and events), we’ll tune down the relative value of the essence you get from disenchanting shards of all types—champ shards, skin shards, and ward skin shards.\n\nDer Teil ist aus demselben Beitrag, den du verlinkt hast.\nhttps://nexus.leagueoflegends.com/en-us/2017/09/upcoming-changes-to-leveling-ip-rewards/","replies":[{"poster":"AntiqueRoses","date":"2017-11-25T18:58:20.269+0000","up_votes":1,"down_votes":0,"body":"AUßERDEM wurde im LOL Launcher auch nur auf Championshards hingewiesen! warum weist man nicht auch auf Skinshards hin oder erwähnt das mit den Skinshards in diesem Beitrag: https://nexus.leagueoflegends.com/en-us/2017/09/upcoming-changes-to-leveling-ip-rewards/ das ist eine Schweinerei ....","replies":[{"poster":"legofreak1","date":"2017-11-25T20:21:22.353+0000","up_votes":1,"down_votes":0,"body":"Der von mir zitierte Teil stammt aus dem von dir verlinkten Artikel. Du musst dazu recht weit scrollen, der Artikel ist allerdings auch etwas länger, da kann nicht alles im ersten Absatz stehen. Im Client wurde außerdem geschrieben, dass Splitter an Wert verlieren werden. Dort wurden Championsplitter genauso wie Skinsplitter beide nicht explizit erwähnt.","replies":[]}]},{"poster":"AntiqueRoses","date":"2017-11-25T18:53:06.794+0000","up_votes":1,"down_votes":0,"body":"JA IN EINEM FRAG RIOT! Ich habe mich über die Veränderungen in der Preseson informiert da lese ich doch kein Frag RIOT!\nhttps://nexus.leagueoflegends.com/en-us/2017/09/upcoming-changes-to-leveling-ip-rewards/ DAS SIND DIE VERÄNDERUNGEN FÜR DIE PRESESON UND DA WURDE NIE ÜBER SKINSHARDS GESPROCHEN!","replies":[]}]},{"poster":"Herr Hübsch","date":"2017-11-24T20:20:36.852+0000","up_votes":1,"down_votes":0,"body":"ca 95% haben das gemacht, die anderen 5% waren einfach zu faul sich zu informieren","replies":[{"poster":"AntiqueRoses","date":"2017-11-24T20:50:00.341+0000","up_votes":1,"down_votes":0,"body":"es wurde immer nur von championshards gesprochen","replies":[]}]},{"poster":"Nycaria","date":"2017-11-24T20:26:03.519+0000","up_votes":1,"down_votes":0,"body":"Streng genommen wurde in dem Hinweis auf der Website und im Client von Splittern geredet, nicht nur spezifisch von Championsplittern.","replies":[]}]}