{"poster":"Hacell","date":"2015-10-23T04:03:33.266+0000","title":"Talon Rework Suggestion","subforum":"Gameplay","up_votes":1,"down_votes":7,"body":"While I do love Talon, I believe his kit needs some attention as a melee assassin since an all in champ is either crazy over powered or nerfed to be most viable in bronze league.\n\nTalon Rework\nPassive: If Talon has not attacked anything for 6 seconds, his next melee basic attack against an enemy champion deals 300% damage(only based on his basic attack damage) and gains 150 range while also blinking him in front of his enemy.\nQ(note: I am not putting names down): Talon teleports to a location while resetting his attack timer. (The range is much smaller compared to his original E but he can go over walls). Talon becomes a rift walker gaining 50% additional movement speed, becoming untargetable and unaffected by crowd control for 1 second. Note that he will still take damage from skill shots. Talon's next basic attack within 2 seconds will cancel the duration of this skill and inflict extra bleeding damage for 3 seconds. 6 seconds cooldown. Leveling increases bleeding damage.\n\nW(Passive): Talon generates a throwing dagger every 10 seconds. Stacking up to 2. Talon's next basic attack from outside his melee zone gains 300 range. This passive can be used in cooperatively with Talon's passive to get into melee distance of enemies.\n\nW(active): Talon throws an invisible dagger in a direction. This skill will deal decent physical damage to the first target hit also slowing him or her by 30% for 1 second. This skill will not cancel Talon's E. When using this skill, both allies and enemy players will only see talon move his hand. While it is invisible the width of this skill is smaller than Nidalee's Q. (This skill does more damage than Talon's old W). 7 seconds cooldown. Leveling increases damage. The speed of this skill shot should be quite fast though.\n\nE: Talon turns invisible and gains 700% movement speed as he runs towards the desired destination while ignoring all unit collisions. Talon can at anytime cancel this skill by moving, attacking, or using a skill setting it on an additional 6 second cooldown plus its own cooldown time. Talon cannot jump over walls with this skill. If Talon reaches his destination he stays invisible for 2 second. 14 seconds cooldown. Leveling increases travel distance and invisibility duration.\n\nR: Talon sends out a volley of 6 daggers in a direction. Their angles are based on Talon's original W. For each dagger that targets are hit by, they are dealt damage equal to Talon's W and are slowed by 20% for 1 second. The slow will max out at 100%. This damage and slow can stack based on the numbers of daggers the targets are hit by. Enemy champions hit will also receive a debuff reducing healing, shielding, and regeneration effects on them for 5 seconds. These thrown daggers will lay on the ground and stay visible for 7 seconds. During this time Talon can fire of 2 additional daggers using his W which will also stay visible as well while only dealing damage equal to his W. After 6 seconds Talon can recast this skill to direct all the grounded daggers to fly from their destination towards one destination at an increasing speed ending this skill and dealing minor magic damage this time around but also slowing enemies by 60% for 1 second. 100 seconds cooldown. Leveling decreases cooldown timer and increases damage.\n\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\nThis page has been reedited again. I have edited his ulti to include physical damage. In all these new changes would give talon a lot more utility which is what I am aiming for here. \n\nThis Talon I am suggesting is an assassin please do not think this makes him a duelist. Talon is already too strong of a duelist as it is...\n\nOkay now on to more info. This Talon set I am suggesting should make talon the assassin to turn to if enemy players have too much CC or other supporting skills to be able to reach targets. My suggested combo would be to use this new E to get into position, fire of a W to deal some damage and retain your invisibility, immediately use your R to half support heals and shields towards your target, use your passive to close the gap between you and your target and then use the additional counts on your W to keep your target from escaping you completely. Keep your Q in hand to escape or dodge CC if you know it's coming. Note: This might only work in platinum+ because from what I've seen people below that seem to never want to be with you when team fights are starting. So if that isn't the case be ready to die when you start. \n\nThe new passive I've suggested is like a more amplified damage version of Talon's old passive and E bonus. Truthfully I believe this new one deals just about the same amount of damage or more if his original W is not included. It is also more useful since Talon wont have to wait on his W to pluck his passive anymore. Having his passive be the gap closer just gives more variety to his approaches.\n\nThis new Q will be more useful in evading enemies while also being useful to close the gap between targets. The added immunity to be targeted and CCed is meant to give him a small edge on killing his target in case they have too much CC.\n\nThe new W is actually to weaken his current W. While very useful, I find it unnecessary for an assassin to have such a broken harassing skill. It has massive width and deals decent damage which is great for killing minions and also killing enemies. This skill just had to go as it didn't give enemy players much chance to counter him. My new skill suggested will give Talon both an extra passive and a more counterable skill even if it is invisible. The new passive is designed to be his new tool for farming minions or killing unreachable sight wards. This will nerf his ability to take out all minions like he would be able to with his old W giving enemy players atleast some bonus damage from winions if a Talon jumps in to get them. It is still possible to harass with this skill but now his new active W will only hit the first target hit making it more required to find an opening and taking that opening with Talon. Also making the skill invisible guarantees the possibilities of this skill hitting as I am suggesting the skillshot to have a width smaller than nidalee's Q to make it easier to pass through minions but harder for Talon players to aim it. This width also makes it harder to hit at longer range making this a close range skill.\n\nThe new E is something I am suggesting. Instead of waiting for Talon's ulti to even go in to get a kill and come out alive by turning invisible or using it to go in, I am making his E the engaging or escaping tool. This new E is a replica of the invisibility from Talon's original ulti  but comes with a lot more restrictions such as having to choose where you're planning on going before you can turn invisible. This tool will be great for setting down that trap needed to take down unwavering carries who might never leave their teams. IF you get caught atleast you can Q out right?\n\nThis new ult is designed to be combat ready without the need to hold it in for an escape tool. Also it is really similar to Grave's old Q but is now an ult. I figured why not make his W his new Ulti while also making it more affective? This new ulti will still feature 6 daggers but this time they're aimed to kill instead of tossing them around Talon in a circle. At point distance they will definitely have great burst damage. The real feature though is the greivious wound like-effect I am suggesting. This skill is meant to help isolate a foe even further as it will break off some supporting factors by taking away half of the healing and shielding from all sources. The last part of this skill is actually a defensive tool meant to keep enemies back if Talon needs to slow down the enemies for a second. The magic damage is actually just for bonus damage since TALON IS NOT SUPPOSED TO GO AP. The essence in the daggers is forcing these daggers to hit enemies one more.\n\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\n","replies":[{"poster":"Zezockary","date":"2015-10-23T04:12:00.366+0000","up_votes":3,"down_votes":0,"body":"As a talon main, i dont feel like this fits him at all. This is more of an evasive duelist skillset than a burst damage assasin.\n\nI really like the skills though and think they would be great on a different champ, maybe former general DuCatue or however it is spelled (kat's dad).","replies":[{"poster":"Hacell","date":"2015-10-23T04:20:06.517+0000","up_votes":1,"down_votes":0,"body":"I get what you mean but his current skills still lacks some touches. His all in style is a bit out of place in competitive plays and also his ulti being that only escape really just waistes his potentials. I'd give fiora as an example since her new skill set totally makes her feel a bit different but also gives her a new and more differentiable playstyle. Oh and also, a boost in damage can be added to his passive and skills as he levels giving him a more late game burst assassin feel still. Landing a backstab with the skill set I suggested will also deal good burst damage. Truthfully I think this will atleast make Talon less overpowered enough to not be nerfed to a degree of extinction.","replies":[{"poster":"JayenKei","date":"2015-10-23T21:58:41.462+0000","up_votes":1,"down_votes":0,"body":"The all in style that talon brings is what I like about him and I'm pretty is what most talon mains like about him. Talon is unique in the sense that he's not mechanically difficult but you need to be wise about who you kill and when you kill. \n\nYour rework makes him closer to a zed. Talon doesn't have to be a duelist like every champ in the game now. Let him keep his identity as a super burst champ","replies":[{"poster":"Hacell","date":"2015-10-28T17:00:30.465+0000","up_votes":1,"down_votes":0,"body":"It's impossible to keep his super burst in game. Let me be very clear, it's very hard to outplay a good Talon ingame and because of this he deals with constant nerfs when anything new affects him. His blinking ability must be removed. it is the only way to reform Talon into something that wont get nerfed constantly. The new E I suggested opens up a bit of room for fighting against him since it takes time rather than just immediately popping before the back of your enemy. Now I'd really like to have you define what you mean by duelist though. I believe he was always a duelist, his current kit always seemed meant for beating your opponent in lane through a strong gap closer.","replies":[{"poster":"JayenKei","date":"2015-10-29T16:03:24.392+0000","up_votes":1,"down_votes":0,"body":"Duelist tend to have more sustained damage and actually excel in longer fights\n\nEx. Fiora, zed, riven, Yi, etc\n\nDuelists also tend to have much lower cooldowns or are aa reliant. Talon is neither of those. Talon is jump in unload your kit and walk out and then wait for cds. Someone like fiora can constantly be on the move switching from target to target or being sticky on one target. \n\nI'm not saying I don't like your rework, I just don't like it on talon personally. Talon is infamously known to be cold and calculating and his kit fits that theme. He is one of the very few assassins that leave for no mistake unlike zed, LeBlanc, fizz, etc. For this reason, I like him. Not ever champ needs to be over complicated and built in with natural escapes. Talon is unique because he's easy mechanically but tactically more difficult and far more unforgiving than his fellow assassin champions.","replies":[]}]},{"poster":"ShatoSummoner","date":"2015-10-28T17:32:09.202+0000","up_votes":1,"down_votes":1,"body":"Thing is though, talons current kit as an all in champion who uses every ability to kill someone with no method of escape, doesn't fit the theme of a master assassin almost on par with katarina's father AT ALL. An assassin is not a suicide bomber, going in and out like zed is a far better idea for an assassin than what talon currently is. Even kha'zix, assuming evolved e, is a much better thematic example of an assassin.","replies":[]}]},{"poster":"Hacell","date":"2015-10-23T05:17:57.869+0000","up_votes":1,"down_votes":0,"body":"BTW I think I said it but an E into Q combo is pretty much the same as talon's blink and Q combo. only difference is that it requires aiming. Use E to Dash behind the enemy and then use Q to apply damage. the 30% damage boost from backstabbing is actually stronger than what Talon's original E and passive could've dealt. Pretty much I gave him better harassing with his W, a better ult, and evasive ways to utilize his E and Q.","replies":[]}]}]},{"poster":"Hacell","date":"2016-05-02T22:19:20.130+0000","up_votes":1,"down_votes":0,"body":"Reedited the page.","replies":[]},{"poster":"Hacell","date":"2016-03-19T07:09:23.304+0000","up_votes":1,"down_votes":0,"body":"Revamped my suggestion. While he is slightly okay now with the new update I'm gonna keep suggesting changes lol","replies":[]},{"poster":"pripustas","date":"2015-10-23T09:15:52.327+0000","up_votes":1,"down_votes":0,"body":"1. How is he supposed to kill anyone with those small skillshots? Where is the damage coming from?\n2. How are you supposed to build him? Why does ult deal magic damage?\n3. How is he supposed to get to the back side of the enemy? What if the enemy turns around? What then?\n\n2/10 on your rework.. Just for the effort.","replies":[{"poster":"Hacell","date":"2015-10-26T00:51:19.805+0000","up_votes":1,"down_votes":0,"body":"1. yes...they're small, as I said you can \"barely\" see the skillshot meaning your enemies cant see them either. His W has a passive granting range on his next basic attack. upon lvl 6 you would have 2 ranged basic attacks meaning you can't get cut off on your pursuit as soon as you attack. Range might have to be relocated.\n\n2.a. Magic damage on his ulti is just a precaution. My kit suggestion does not rely heavily on using his ult to burst down enemies. In my suggested kit his Ult is meant to cut off outside spell effects like soraka's heal or even lux's shield. This makes it easier to pick off targets who can also lifesteal strongly or spellvampers like akali. The other part of this skill is meant for throwing off pursuers if he went all in. think of it as a last effort to evade enemies.  More importantly, if he gained another strong damaging ult, I don't see how to make it unique in comparison with other assasins.\n\n2.b. Still ad, as I said his Ult does small bits of ap damage. ap ration might be as low as 0.2.\n\n3. Still thinking of what movement speed to give his E. He is an assassin, right timing is everything. The W passive is meant to take out pink wards if u cant reach them. Players tend to have one on the field against strong invisibility characters. He can not go over walls but that does not mean he cant walk behind his enemies with his E. HIs E gives him invisibility also so there isn't anything but oracle lens to worry about when trying to get behind your target. I guess i'll take away being unable to cancel off his E to make it possible to Q when u see the opening. Also, can you spend some time to try to imagine how my E>Q combo would feel? In my mind he pretty much follows his old kit on his E. You do not click on you target and just pop up behind them any more instead you tell Talon to basicly run behind them and attack, same thing just less undodgeable.","replies":[{"poster":"pripustas","date":"2015-10-26T07:20:27.804+0000","up_votes":1,"down_votes":0,"body":"Small skillshot means almost impossible to hit, even without enemy dodging.\n\nNot a burst assassin anymore? That's what an assassin does, he bursts you down. It's his job.\n\nMaking him unreliable in assassinations will make him unplayed and with a very low winrate.","replies":[{"poster":"Hacell","date":"2015-10-28T17:33:21.948+0000","up_votes":1,"down_votes":0,"body":"I do not understand what you mean by him no longer being a burst assassin. The passive I included completely destroys his current one by 20% more increased damage and while his E gives 3% increase in damage, it does not even come close to the whopping 30% damage boost I wrote in. WIth the right aim, he would burst down his target even better than before. Now taking out the damage he could make with his ult might be a downside but the bonus of having taken away his target's lifesteal and spellvamp more than makes up for it even including the 50% reduction on healing, shielding and regeneration. Spotting a low health target and keeping him or her that way while attacking, what more can an assassin ask for?\n\nNow taking a character who barely needs to aim to kill and making him into a high precision and timing assassin may be crazy but it will improve him greatly giving more ways to counter him while giving him more ways to fight an enemy as well. I do not agree with small skillshot meaning impossible to hit. I can catch a dodging kalista with lux's rooting skill, what's more for there to say? The passive to his W more than makes up for it. It lets Talon farm from a distance or harass whichever one feels more convenient. As he waits for that opening or if a target decides to stand alone it makes for easy picking. I may make further adjustments to this though. He may seem different but he still plays boldly as a melee lover who stays on target. If you really look into my suggested E you'd understand that he just doesn't blink he moves, but to the area you announce theres nothing different except the timing and the fact that you don't target the enemy, you target his location. The new Q is just to make up for mistakes on his E. I believe the new Ult I suggested is by far, more useful than a getaway ult and the ability to use his new E and Q evasively makes it viable.\n\nNow for his W, it may be unreasonable to cut out his range for a single target hitting skill but I believe it makes sense not to have so much range with an assassin. The passive on his W makes up for that lost range and keeps him as a basic attacking assassin even if it isn't melee. I for one knew Talon as a melee champ who relied a lot more on basic attacking over skillshots. The new W though might be rough to deal with but being invisible means your opponent cannot simply dodge it by sight. They will have no way of knowing that you used the skill and as hard as it may be to use this skill correctly, perfecting your aim would make you an unstoppable bursting assassin. You may not even need to go in on your opponent if you were too far ahead.","replies":[{"poster":"pripustas","date":"2015-10-28T18:31:34.552+0000","up_votes":1,"down_votes":0,"body":"Assassin's job is to delete.\nLook at it this way: Would you rather buy a car that is faster, but only works every other day (depending on luck)\nOr would you buy a car that is slower, but does the same job, and will take you wherever you want to go whenever?\n\nI can hit Lux binding on Kalista: so what? If you hit it with Lux, you delete the enemy, because he cannot dodge your skills. When you miss, she has other choices (waveclear, zoning, or just standing back, because she is ranged)\nIf you miss your skillshot on an assassin, that will make you a walking ward for the cooldown duration. And to hit it, you must get closer to the enemy.\n\nI won't answer to your comments anymore, don't bother. It's clear to me that you do not understand the basics of an assassin's kit.","replies":[{"poster":"Hacell","date":"2015-10-29T22:08:39.620+0000","up_votes":1,"down_votes":0,"body":"Well thanks anyways, you've helped me specify this set a little. Now on to commenting (You can go):\n\nYou aren't keeping an open mind here. This set is still a deleting set. I've amplified Talon's damage here not reduced it, his ult was never for damage to begin with so it was fine to change it. Only real difference in this set is that W. Talon is an assassin who can get near any enemy. This set still follows that idea, as you said he must get closer to be more precise but his W shows no sign of usage and is invisible so it really can hit targets. Look I've really been trying to stay calm here but you aren't listening. This set keeps everything about Talon in place but just with adjustments. I've moved his invisibily to his Q and E. His E targets a location not an enemy's backside. The ult feel is still on his ult just magic damage because it would be too useful for nuking down targets and is a volley direction over forming a circle over Talon. If I could actually put visuals in you would see only that his W feels particularily different. I really don't see why his W being a precision shot is a bad thing, assassin's need skills above all things. Firstly though, that passive giving him extra range is solely to finish targets that survive and get out of his range. His main focus in this set is to damage an opponent from behind utilizing trinity edge to burst their hp from just his Q. The skillshot is less useful for killing minions but it can still be used to slow down targets. (I've readjusted it to slow if it hits instead of from their backside only). It's pretty easy to accurately aim at almost anyone anyways.","replies":[]}]}]}]}]}]},{"poster":"Zezockary","date":"2015-10-23T06:36:40.243+0000","up_votes":1,"down_votes":0,"body":"I think having little to rely on for escapes is what allows him to be strong now, power budget wise. I think he is in a good spot, he has decent but costly harass, awesome but risky engage, and burst to back it up.\n\nWhat your build seems to be suggesting is that you want him to be a duelist rather than what he is, an assasin. This would, in my opinion, damage his overall theme when they could just make a new champ with an \"invisible duelist\" theme instead of forcing it onto talon. If you want him reworked i would say keep his high burst assasin theme intact even if the skills were changed drastically.\n\nAlso, you keep saying his only escape is his ult when he also has a powerful, lowish cd, aoe slow on his W. I have used that to kite people so hard that i had to stop and wait for them to get back in range so i could hit them with it again.","replies":[{"poster":"Hacell","date":"2015-10-26T01:34:26.917+0000","up_votes":1,"down_votes":0,"body":"One more thing, having little escape potential and all in burst damage is fine if you have ranged otherwise it just makes you a broken champ or nerfed champ. He gets an automatic good ranged teleport behind enemies but he cant easily return once using it...His blinking ability is just impossible for most mid players to deal with since it has no counter-play. Giving his Q a small dash just helps to restore his current set back to its original form. So basicly you run and then dash to reach behind your enemy instead of blinking to get behind your enemy. Its the same just more time and can be dodged.","replies":[]},{"poster":"Hacell","date":"2015-10-26T01:06:04.738+0000","up_votes":1,"down_votes":0,"body":"My intention was not to make him a duelist. It was to make playing against him possible while improving him. He is still a high burster in my kit, The passive on my W gives decent harass as it increases his next basic attack's attack range and making it a basic attack means he's giving off a normal \"Talon\" attack with even trinity force as a possibility. The passive damage I put in is actually bigger than his passive and E combined if you look up his current kit. 30% is beyond helpful if his current 13% can help so much.  Look towards nidalee when saying this new W active is not for burst damage. The smaller width means he can also pass it through minions easier even if hard and also makes it even more sneakier than nidalee's. Although maybe adding a blind effect to make it easier to trade off damage when harassed would be nice especially against ADCs. I do not believe my theory of his ulti being his only escape to be false. His W does help to kite a bit but from my experience many players are relying on heavy gap closing champs when playing ranked or draft to counter all in champions like Talon.","replies":[]}]}]}