{"poster":"Sangu Unchained","date":"2016-12-05T13:40:58.626+0000","title":"Matshmaking flex Q","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Ja wie auch immer man es schafft noch Silber zu kommen in Flex Q ich mein komm mir da gerade vor wie ein Dia Spieler k&ouml;nnte einfach daran liegen das ich permanent nur silber und gold leute bei mir im team hab und das gegner team aus dia und platin besteht ja warum auch nicht ist halt sehr aufbauend wenn die dann einen noch als noob abstempeln etc also mal im ernst die &gt;Flex Q kann entfernt werden\r\n\r\nMFG","replies":[{"poster":"Sałtyy","date":"2016-12-05T14:11:19.832+0000","up_votes":1,"down_votes":0,"body":"Dann hör auf zu spielen?\nOder werd besser? Lern aus deinen Fehlern anstatt rum zu heulen oder what ever. \n\nFinde es so unnötig, spiels einfach ned und fertig, problem gelöst.","replies":[{"poster":"IWhiteBoyI","date":"2016-12-07T00:38:01.683+0000","up_votes":1,"down_votes":0,"body":"Macht Sinn direkt aufzuhören wenn man einen Fehler anspricht :) \nUnrecht hat er nicht was die Balance angeht...vor Wochen hieß es noch \"wartet erstmal 2-3 Wochen ab bis sich die FlexQue eingespielt hat\"\nSo 4 Wochen sind vorbei und im Match spielt Bronze 2 Toplane Gegen platin 5 !\nEin sehr Spannendes match wenn man es sich genau anguckt, der Bronze spieler lernt sicher richtig viel wenn er auch noch vom enemy jungle gecampt wird und dauerhaft stirbt obwohl er save am tower farmt :) Lerneffekt = 0 .\n\nAnderes Match 2 Silber 3 Gold spieler gegen 2 Diamond 3 gold :) Viel Spaß und Spannung für jedermann...Vor allem wenn die Dias noch anfangen zu flamen z.B Noobs/lächerlich etc. ( Ist nicht immer aber öfters der Fall das weiß ich)\n\nFazit aus der Sache ist einfach das du Flex nur mit minimum 2 guten Premades spielen kannst und selbst dann auf Glück hoffen musst was die Enemys angeht. \n\nKp ob das gewollt ist oder auch nicht aber es saugt einem schon die gute laune wenn man an solchen Spielen teilnimmt.\n\nPS. Das ist kein Geheule oder Gemeckere sondern einfach die reine Wahrheit wie ich sie momentan vorgestellt bekomme. Vieleicht bin ich auch der einzige der das so sieht. ;) passiert dann halt\n\nVieleich äußert sich auch jemand Mit Ahnung der mir das ganze in Ruhe und vor allem sachlich erklären kann .\n\nMfg WEcko","replies":[]}]}]}