{"poster":"I Stef I Nator I","date":"2018-01-10T23:50:44.974+0000","title":"Nazis und Toxic Spieler sind erlaubt?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":12,"body":"Hallo LoL-Community.\r\n\r\nIch hatte vor 2 Tagen ein Game wo ein Gegner einer meiner m8`s als J densau und man sollte dich verg sen beleidigt hat. Wir alle haben ihn reported f&uuml;r Beleidigung und Hetzreden. Habe ihn danach mal geaddet und geschaut wann er bestraft wird daf&uuml;r. Aber bis heute spielt er ein spiel nach dem anderen. Ich wei&szlig; leider nicht ob er weiterhin solche Sachen schreibt aber trotzdem. 1 Mal sollte schon Grund genug sein ihn mal f&uuml;r 14 Tage zu bannen. F&uuml;r k*s wird man ja sofort vom System gebannt f&uuml;r 14 Tage oder Perma. Warum d&uuml;rfen Nazis unbestraft einfach weiterspielen?. \r\n\r\n\r\nIn jedem 3-4. Game trifft man immer einen Flamer. Nat&uuml;rlich Muten geht immer aber die M8`s in einem Team muten diese Person dann nicht und gehen dann Trollen oder Quitten einfach das Game. Ich frage mich warum gibt es so viele Toxic spieler in der LoL Community? Am schlimmsten ist es ganz am Anfang Lvl 5+ da gibts die meisten. Wahrscheinlich weil einer gebannt wurde und er sich dann einfach einen neuen gemacht hat und weiter flamed bis er den n&auml;chsten Bann bekommt. (Ich wurde einmal Perma Gebannt wegen Flamen. Habe aber mein Verhalten verbessert und bin jetzt kein Spieler mehr der Toxic ist. &Uuml;brigens wurde mein Perma Bann dadurch ausgel&ouml;st weil ich 2x Report in den Chat geschrieben habe. Aber wenn ich sehe was leute so in den Chat schreiben und ungebannt bleiben, maybe bekommen die einen Chat Bann aber wer schreckt davor zur&uuml;ck?). \r\n\r\n\r\nWie oft habt ihr einen Toxischen Spieler in eurem Team?\r\n\r\nIch wei&szlig; nicht ob ich diese oben genannten W&ouml;rter in einem Forum Post nenne darf darum fehlen Buchstaben","replies":[{"poster":"Vogeljunges","date":"2018-01-11T06:13:01.933+0000","up_votes":6,"down_votes":0,"body":"\"...ich wurde einmal perma gebannt wegen Flamen...\"\n\n...also wenn ich sowas schon lese. Im Grunde ist dein Thread doch nix anderes, als die anderen \"ich wurde gebannt, aber die anderen sind schlimmer und werden aber nicht bestraft und überhaupt und so..\" - Beiträge hier in dieser Sektion. \n\nSorry, aber ich kann dich da irgendwie nicht ernst nehmen. Worauf willst du denn hinaus? Dass die LoL-Welt, ja sogar das ganze Internet voll ist mit bösen Menschen, wissen wir doch alle. \n\nAber um deine Frage zu beantworten - ich weiss nicht wie oft ich toxic Player in meinem Team habe, einfach weil es mich nicht interessiert und ich den Chat ignoriere wenn da einige meinen, Nettigkeiten austauschen zu müssen. Ob da jetzt eine Nazikram schreibt oder den anderen mit harmloseren Sachen auf den Sender geht, ist mir völlig egal. Report am Ende und gut ist.\n\nIch hab oft genug Reportfeedback-Meldungen bekommen und muss ja nur in dieses Forum schauen um zu sehen dass die Leute schon ihre Strafe bekommen. Ob nun früher oder später ist mir völlig egal.","replies":[{"poster":"Qbert","date":"2018-01-11T06:15:21.108+0000","up_votes":2,"down_votes":0,"body":"*high five!*\n\nIch hatte gestern erst wieder ein Instant Feedback :)\n\nAber so üblen nationalsoz. Flame hatte ich echt sehr sehr selten.","replies":[{"poster":"Vogeljunges","date":"2018-01-11T06:22:14.266+0000","up_votes":2,"down_votes":0,"body":"Jau, ich glaube grade diese Sparte ist deutlich zurückgegangen, eben weil es mittlerweile härter bestraft wird. \n\nWenn ich das mit meiner Anfangszeit vergleiche, in der ich mir doch einigermaßen oft die \"german nazi\"-Keule anhören musste, sehe ich das kaum noch eigentlich. Und wenn da mal doch einer mit anfangen sollte, finde ich da höchstens amüsant, weils mich halt nicht interessiert und ich weiss, dass der Junge da grad seinen Acc riskiert und sich irgendwann schrecklich ärgern wird :D","replies":[{"poster":"Qbert","date":"2018-01-11T06:23:01.657+0000","up_votes":2,"down_votes":0,"body":"yep ... wenn sie mitbekamen du bist Deutscher, kamen sofort die Standard-Sprüche ... \nDas ist wirklich sehr zurück gegangen.","replies":[{"poster":"DrunkenRedPanda","date":"2018-01-11T11:21:46.692+0000","up_votes":2,"down_votes":0,"body":"Hatte vor langer Zeit mal einen Italiener im Team, der hat irgendwann mitbekommen das ich Deutscher bin. Er meinte das alle Deutschen Nazis sein und man doch Deutschland mit Atombomben angreifen sollte. War bisher der schlimmste Fall den ich erlebt habe was solche Feindlichkeiten angeht, egal gegen welches Land. Ich fand es ehrlich gesagt sogar unterhaltsam, vor allem wenn man bedenkt wer Hitlers Vorbild war :-)","replies":[]}]}]},{"poster":"Y Θ ω Θ M","date":"2018-01-11T06:21:07.857+0000","up_votes":1,"down_votes":0,"body":"Also bei mir wird gefühlt auch in jeder zweiten Runde geflamed, aber nationalsoz. Flame oder ähnliches bis jetzt nur einmal und das in Form eines Spielernamens 0.o","replies":[]}]},{"poster":"Nordwolf87","date":"2018-01-11T07:34:47.266+0000","up_votes":1,"down_votes":0,"body":"Sehe ich ähnlich. für mich verbraucht der chat hauptberuflich nur platz am bildschirm. Ein gg oder gl könnte man mit (gratis)sticker machen, dann könnte man von mir aus den chat ganz aus dem spiel entfernen. \n\nAll chat hab ich erst gar nicht aktiviert und teamchat ist zu 99% belangloser unsinn oder blame/flame...wenn da was drin steht (falls ichs überhaupt mitkrieg - gibt bedeutend wichtigeres was am bildschirm abgeht) ein report am ende und fertig...","replies":[]}]},{"poster":"BlackAjani","date":"2018-01-11T08:04:57.018+0000","up_votes":2,"down_votes":0,"body":">Aber bis heute spielt er ein spiel nach dem anderen.\n\nweil 2 Tage einen immensen Zeitraum bilden xD\n\nVor langer langer Zeit - gestern.","replies":[{"poster":"eingew","date":"2018-01-11T08:10:37.788+0000","up_votes":1,"down_votes":0,"body":"Zugegeben, der TE weiß das vermutlich nicht, aber der Ban würde ja spätestens 15 Minuten nach dem Spiel ausgesprochen. Da er noch spielt wurde er also tatsächlich nicht bestraft, der Zeitraum ist da ja erst mal egal.","replies":[{"poster":"BlackAjani","date":"2018-01-11T08:31:09.543+0000","up_votes":2,"down_votes":0,"body":"Ja, aber das System ist ja auch nicht perfekt/allwissend und er wird über kurz oder lang schon eine Strafe erhalten.","replies":[{"poster":"Y Θ ω Θ M","date":"2018-01-11T08:40:21.364+0000","up_votes":1,"down_votes":0,"body":"Ist der zeitliche Unterschied dabei so groß ? \nBei intentional feeden dauert es nämlich deutlich länger","replies":[{"poster":"BlackAjani","date":"2018-01-11T08:44:37.580+0000","up_votes":1,"down_votes":0,"body":"Weil viele das auch immer falsch einschätzen.\nEs gibt viele, die gecampt werden oder einfach mal ein richtig schlechtes Game haben und dann schreien alle bei einem 0-4 Typen gleich nach Reports.","replies":[{"poster":"Y Θ ω Θ M","date":"2018-01-11T08:46:57.403+0000","up_votes":1,"down_votes":0,"body":"ich wurde nähmlich erst eine woche später für das Spiel gebannt ^^","replies":[{"poster":"BlackAjani","date":"2018-01-11T08:56:28.890+0000","up_votes":2,"down_votes":0,"body":"Weil hier auch mehr überprüft werden muss.","replies":[{"poster":"Y Θ ω Θ M","date":"2018-01-11T09:02:43.753+0000","up_votes":1,"down_votes":0,"body":"inwiefern denn genau ? bei intentional feeding ist es doch meistens relativ eindeutig","replies":[{"poster":"Vogeljunges","date":"2018-01-11T09:12:51.826+0000","up_votes":2,"down_votes":0,"body":"ja eben - meistens...\n\naber ich finde das doch deutlich schwieriger zu beurteilen... um die Floskel zu bemühen \"jeder hat mal ein schlechtes Spiel\"...aber es kommen ja auch manchmal richtig miese Stats zustande, wo man so 20min relativ gut steht und dann nur noch auf die Fresse bekommt und die KDA nach dem Game dann aussieht, als wär man der letzte Mensch...und hat eigentlich nur versucht, das Ding zu drehen, falsche Entscheidungen getroffen und sich am Ende nicht mehr konzentriert und getilted...\n\nDa muss man schon ziemlich detailiert hinschauen, denn nicht jeder Feeder kauft sich 6 Tränen und geht 0/25/0 und die Sache ist klar.","replies":[{"poster":"Y Θ ω Θ M","date":"2018-01-11T09:18:17.200+0000","up_votes":2,"down_votes":0,"body":"okay, da muss ich dir leider recht geben. Gestern erst eine Botlane gehabt die zum schluss zusammen 7/27 stand. Leider aber kein Grund für ein Report.","replies":[{"poster":"DrunkenRedPanda","date":"2018-01-11T11:34:13.497+0000","up_votes":2,"down_votes":0,"body":"Das Wort \"Leider\" zerstört den ganzen Kommentar. Das klingt so als wärst du traurig darüber.","replies":[{"poster":"Y Θ ω Θ M","date":"2018-01-11T11:44:07.569+0000","up_votes":1,"down_votes":1,"body":"Genau, weil sie leider nur derart schlecht gespielt haben und dabei nicht geinted haben. \nLeider ist schlecht spielen kein Report Grund.","replies":[{"poster":"Sirrkas","date":"2018-01-12T08:58:39.304+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=JHINIRL 108914,realm=EUW,application-id=KYnfKGf0,discussion-id=UGQVT27E,comment-id=00030000000000000000000000000000000000000000000000000008,timestamp=2018-01-12T08:49:39.139+0000)\n>\n> Nein ich bin kein Troll lol\n> Es war nirgends die Rede von Bannen.\n\nWenn du dich darüber beschwerst, dass schlecht spielen kein Reportgrund ist, implizierst du damit, dass die Leute dafür bestraft werden sollten. Da ist dann das naheliegendste ein Bann. Wenn du dir darunter etwas anderes vorstellst, musst du das zumindest erwähnen.\n\nAnsonsten führt das eben dazu, dass die anderen davon ausgehen, du willst dafür Banns sehen.","replies":[{"poster":"Pandeonor","date":"2018-01-12T10:12:24.276+0000","up_votes":1,"down_votes":0,"body":"Wenn  die zusammen 7/27 stehen und das Spiel immer noch nicht beendet ist würde ich die **Gegner** bestrafen. {{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Homunculi","date":"2018-01-12T10:08:50.519+0000","up_votes":1,"down_votes":0,"body":"Einer allein oder beide zusammen?","replies":[]},{"poster":"Pandeonor","date":"2018-01-12T10:06:37.474+0000","up_votes":1,"down_votes":0,"body":"_\"**Vergehen** bezeichnet eine minderschwere **Straftat**, die mit einer nicht allzu hohen Freiheitsstrafe oder mit Geldstrafe bedroht ist.\"_\n\nführt zu\n\n_\"Eine **Straftat** liegt vor, wenn drei Bedingungen erfüllt sind: \n1. Die Tat muss im Strafgesetzbuch oder einem anderen Gesetz als verbotene Tat beschrieben und mit einer Strafe bedroht sein. \n2. Der Täter muss **schuldhaft**, also bei vollem Bewusstsein, gehandelt haben.\n 3. Der Täter muss rechtswidrig gehandelt haben, also ohne Rechtfertigungsgründe (z.B. Notwehr bei einer Tötung)._\n\nführt zu\n\n_\"Intentional Feeding ist ein Vergehen\"_\n\nUnd Du so:\n\n_\"nicht jedes kleine Vergehen muss ein Bann als Folge haben.\"_\n\nÜbersetzung/eingesetzt: _nicht jedes kleine absichtliche feeden muss ein Bann als Folge haben._ Wobei Du eigentlich meintest (siehe davor \"Genau das würde ich wollen.\")   _nicht jedes schlechte Spiel muss ein Bann als Folge haben._\n\nUnd das lustigerweise mit diesem davor:\n_\"ich habe das soweit als logisch betrachtet \"_\n\n\nAw: Nein, hast Du nicht.\n\neod","replies":[]},{"poster":"Y Θ ω Θ M","date":"2018-01-12T09:55:30.700+0000","up_votes":1,"down_votes":0,"body":">schlechtes Spiel ist also ein Vergehen \n\n\nist 4:14 und 3:13 als botlane für dich ein schlechtes Spiel ? ;p","replies":[]},{"poster":"Pandeonor","date":"2018-01-12T09:44:04.198+0000","up_votes":1,"down_votes":0,"body":"Ein schlechtes Spiel ist also ein Vergehen.... soso....\n\nIch hätte da andere Vorschläge ^^","replies":[]},{"poster":"Y Θ ω Θ M","date":"2018-01-12T09:19:25.153+0000","up_votes":1,"down_votes":0,"body":"ich habe das soweit als logisch betrachtet ^^ nicht jedes kleine Vergehen muss ein Bann als Folge haben.","replies":[]}]},{"poster":"Nordwolf87","date":"2018-01-11T12:37:24.807+0000","up_votes":3,"down_votes":0,"body":"Gott sei dank ist schlecht spielen kein report grund wolltest du sagen oder?","replies":[{"poster":"Y Θ ω Θ M","date":"2018-01-12T08:49:39.139+0000","up_votes":1,"down_votes":0,"body":"Nein ich bin kein Troll lol\nEs war nirgends die Rede von Bannen.","replies":[]},{"poster":"DrunkenRedPanda","date":"2018-01-11T14:42:39.517+0000","up_votes":1,"down_votes":0,"body":"Also entweder bist du ein Troll wovon ich jetzt einfach mal ausgehe. Sollte es allerdings nach dir gehen würdest du selbst irgendwann gebannt werden, eventuell nicht wenn du auf Faker-Level spielen kannst, ich zweifel einfach mal an, dass du das kannst.","replies":[]},{"poster":"Y Θ ω Θ M","date":"2018-01-11T13:49:14.399+0000","up_votes":1,"down_votes":0,"body":"Ist es eigentlich so schwer eine Diskusion von Anfang an zu lesen ?","replies":[]},{"poster":"Vogeljunges","date":"2018-01-11T13:46:29.109+0000","up_votes":1,"down_votes":0,"body":"Du spielst mit schlechteren, die werden nach und nach aussortiert, bis nur noch bessere als du mit dir spielen, ergo wirst du aussortiert.","replies":[]},{"poster":"Y Θ ω Θ M","date":"2018-01-11T13:39:21.336+0000","up_votes":1,"down_votes":0,"body":"> \"Leider aber kein Grund für ein Report\" legt nahe das du \"schlechte Spieler bestraft sehen willst.\n\nGenau das würde ich wollen.","replies":[]},{"poster":"clair de lune289","date":"2018-01-11T13:29:00.831+0000","up_votes":1,"down_votes":0,"body":"\"Leider aber kein Grund für ein Report\" legt nahe das du \"schlechte Spieler bestraft sehen willst.","replies":[]},{"poster":"clair de lune289","date":"2018-01-11T13:13:04.210+0000","up_votes":1,"down_votes":0,"body":"dir ist aber schon klar wenn man schlechte Spieler fürs schlecht spielen bestraft es irgendwann keine Spieler mehr gibt?\nda die untere Elo immer mehr und mehr weggebannt wird sind dann eben auch die Profis irgendwann dran,da es eben keinen mehr gibt der schlechter als sie spielt.","replies":[]},{"poster":"Y Θ ω Θ M","date":"2018-01-11T12:43:23.904+0000","up_votes":1,"down_votes":1,"body":"Nein leider das genaue Gegenteil xD","replies":[]}]}]},{"poster":"Snowgen","date":"2018-01-11T12:46:41.976+0000","up_votes":2,"down_votes":0,"body":"Ja er ist traurig darüber, dass er sie nicht reporten kann. Wegen solchen Leuten kann er nämlich nicht climben. \n\nKappa","replies":[{"poster":"Nordwolf87","date":"2018-01-12T12:16:41.311+0000","up_votes":1,"down_votes":0,"body":"Was bedeutet kappa eigentlich?{{sticker:sg-soraka}} ","replies":[{"poster":"Homunculi","date":"2018-01-12T13:35:46.309+0000","up_votes":1,"down_votes":0,"body":">Wer sich gelegentlich auf der Streaming-Seite Twitch aufhält, der hat garantiert schon mal dieses Gesicht gesehen: Das Emoticon „Kappa“, ein Chat-Symbol, das am Ende des Satzes genutzt wird, um Ironie oder Sarkasmus auszudrücken.\n\nEinmal kurz nach \"Was bedeutet kappa\" googeln :).","replies":[]}]},{"poster":"Y Θ ω Θ M","date":"2018-01-11T13:20:09.974+0000","up_votes":1,"down_votes":1,"body":"lol wurde nirgends behauptet. Lerne erstmal lesen","replies":[]}]}]}]}]},{"poster":"Nordwolf87","date":"2018-01-11T09:35:09.670+0000","up_votes":2,"down_votes":0,"body":"\"MEIST RELATIV eindeutig\"...mehr kann man das wort \"eindeutig\" wohl nicht relativieren xD","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Abasin","date":"2018-01-11T08:49:23.516+0000","up_votes":3,"down_votes":0,"body":"Hm. Das ist schon sehr seltsam. Manch einer scheint wirklich ein Magnet für solche Äusserungen zu sein. Mir sind zwar einige Leute mit unpassendem Summonernamen untergekommen - alle reportet - aber NS-Jargon ist mir in mittlerweile fast 2000 Spielen noch nie begegnet. \nFlamer gibt es auch, aber jetzt nicht alle 3-4 Games, das erscheint mir zu hoch gegriffen. Wobei aber die Häufigkeit auch von der Queue abhängig ist.\n\nIn den ranked Queues ist am meisten los, da habe ich aber auch schon hinreichend Feedback bekommen, dass aufgrund meiner Meldung ein Spieler \"bestraft\" wurde. Für Deinen speziellen Fall vermute ich mal, dass da irgendwas nicht ganz rund gelaufen ist. Wer weiss?\n\nWas mir bei Deinem Post allerdings aufstößt, ist diese provokante Unterstellung der Inaktivität RIOTs. Da Du ja schreibst, selbst schon mal gebannt worden zu sein, solltest Du wissen, wie es läuft, denn RIOT tut schon etwas. Man muss sich manche Fälle aber sicher genauer ansehen, bevor etwas passiert. Also Geduld.","replies":[]},{"poster":"Time2Whine","date":"2018-01-11T08:22:49.569+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=I Stef I Nator I,realm=EUW,application-id=KYnfKGf0,discussion-id=UGQVT27E,comment-id=,timestamp=2018-01-10T23:50:44.974+0000)\n>\n>Übrigens wurde mein Perma Bann dadurch ausgelöst weil ich 2x Report in den Chat geschrieben habe.\n\nDein Permabann wurde ausgelöst weil du dich trotz Vorwarnungen (Chatrestrictions, 14 Tage Bann) weiterhin wie ein Arschloch verhalten ist und andere beleidigt hast und nicht weil du 2 x Report geschrieben hast, denn das ist schlichtweg gelogen. \nWenn ich schon sowas lese kann ich deinen Thread sowieso nicht mehr ernst nehmen und sehe den so an, als ob du darüber eingeschnappt bist, dass andere weiterspielen dürfen und du gesperrt wirst.\nSo viel sei dir aber gesagt, früher oder später werden solche Spieler bestraft. Zwischen \"Nazis und Toxic Player sind erlaubt\" und \"Nazis und Toxic Player werden im Verlauf der Zeit bei beibleibendem Verhalten gebannt\" besteht ein riesen Unterschied und hast ja durch deinen Permabann am eigenen Leib erfahren, dass Toxic Player gebannt werden.","replies":[]},{"poster":"Qbert","date":"2018-01-11T06:04:48.062+0000","up_votes":3,"down_votes":0,"body":"Also im Ernst, ich hatte in meinen 7 Jahren Lol solche Äußerungen echt selten ... kann ich an einer Hand abzählen.\n\nToxisches Verhalten legen die Leute meiner Erfahrung nach in ungefähr 4/10 Spielen an den Tag(Ranked).","replies":[{"poster":"The mute Swan","date":"2018-01-11T06:16:50.303+0000","up_votes":1,"down_votes":3,"body":"Dann hattest du einfach Glück.\n\nDie Anzahl an spielen mit/gegen Spielern mit Rassistisch motivierten/Antisemitischen Äußerungen geht bei mir auf die hundert zu über die letzen 2 Jahre, \n\nZum Glück spiele ich aber auch teilweise auf dem Pbe, wo mir sowas nicht passieren kann, weil Riot da nur leute ohne Vorgeschichte rauflässt...\n\n*hust* nicht mehr *hust*\n\nWar da was? Oh, ja, stimmt, sie haben das so geändert, dass jeder Dulli mit nem neuen Account drauf kann.\nSomit habe ich noch nicht mal mehr auf dem PBe meine Ruhe vor Leuten, die mir auf höchst freundliche Art und Weise vorschlagen, mich doch mal zu meinen Großeltern in Treblinka zu gesellen.","replies":[{"poster":"Qbert","date":"2018-01-11T06:21:49.947+0000","up_votes":1,"down_votes":0,"body":"hast du eine ausgeglichene Menge Ranked/Normals oder spielst du nur Normals oder nur Ranked?\nAlso ich muss schon sehr sehr viel Glück gehabt haben ... okay, ich spiele zu 95% ranked, ganz selten mal Normals ... am WE dann gerne ARAM/Sondermodus und ehrlich, ich habe flame bzgl. NS nahezu nie.","replies":[{"poster":"The mute Swan","date":"2018-01-11T07:11:58.664+0000","up_votes":1,"down_votes":0,"body":"70% normals/aram/rgm aufm main/pbe\n30% rankeds auf smurfs\n\nTatsächlich bekomme ich sowas eher auf normals und rgms mit, im Aram eher selten.\nIn Rankeds kommt es auf die Spiellänge an. Meist kommt sowas als Flame nach dem tilt, weshalb auch immer.\n\nIm normal dagegen ist es gemischt, einerseits tilter, andererseits leute, die von Anfang an sowas abziehen.","replies":[]}]}]}]},{"poster":"eingew","date":"2018-01-11T08:16:21.017+0000","up_votes":1,"down_votes":0,"body":"Tatsächlich sieht Riot das genauso wie du und vergibt für Nazikram und Rassismus direkt zweiwöchige Bans. Das bedeutet allerdings nicht, dass das System keine Lücken hat, es kann also durchaus vorkommen, dass das System bei diesem Spieler einen Fehler gemacht hat.\n\nIch glaube übrigens nicht, dass jeder der Nazikram in den Chat haut auch tatsächlich ein Nazi ist. Viel wahrscheinlicher hattest du es einfach mit jemandem zu tun, der dich um jeden Preis provozieren wollte.\n\nWir bestrafen bei der Forenmoderation übrigens für das Beleidigen von anderen Spielern. Das reden über Beleidigungen ist natürlich nicht gegen die Regel, tatsächlich ist die Forensektion, in der du dich hier befindest, sogar ausschließlich dafür gedacht, über spielerisches Fehlverhalten zu reden und dabei geht es in erster Linie um Beleidigungen aller Art.","replies":[]},{"poster":"Miniphiri","date":"2018-01-11T00:14:55.628+0000","up_votes":1,"down_votes":5,"body":"in nahezu jedem game ist mindestens einer.","replies":[{"poster":"eingew","date":"2018-01-11T08:12:23.942+0000","up_votes":1,"down_votes":0,"body":"Wenn das stimmt, frage ich mich, was du anstellst, um die Leute dazu zu provozieren, bist du doch eine absolut Ausnahme und letztendlich hat niemand sonst so oft Nazikram in seinem Chat.","replies":[]}]}]}