{"poster":"KaynMid","date":"2018-01-11T02:26:32.578+0000","title":"Literally fuck you riot.","subforum":"Miscellaneous","up_votes":40,"down_votes":10,"body":"When the fuck will you finally start banning people for gameplay, instead of just fucking words.\r\n\r\nI literally out of a fucking game, where all fucking 4 players, did not give a shit, just ran around went 0 and fucking 7 and had the excuse of \"bro why are you so mad its just a game\"\r\n\r\nThis is a fucking playerbase of fucking 12 year olds, punish them accordingly.\r\n\r\nI dont fucking care if someone calls me a %%%%%%, i could give less of a fucking shit about words.\r\n\r\nBut when a player WASTES HALF A FUCKING HOUR, of my life, because and i quote \"its just a game\"\r\n\r\nHALF A FUCKING HOUR THAT I WONT GET BACK.\r\n\r\nYOU KNOW DAMN WELL IM GOING BE FUCKING PISSED.\r\n\r\nHell i dont even care if you ban them from the game, just remove them fucking ranked.\r\n\r\nTheres what 6 fucking game modes they could be playing?\r\n\r\nDraft blind flex solo rotating and customs.\r\n\r\nIn only 2 of those fucking game modes, are players required to give a shit, you can literally run it down mid and int feed in norms, and no ones going to give a shit, because norms winrates is worthless.\r\n\r\nBut the second you do it in ranked, you are admitting you are terrible fucking human being.\r\n\r\nBecause you are purposely fucking choosing the one game where people actually care if they win or not to play \"just a game\"\r\n\r\nAgain, provide a fucking queue thats ranked, where you have $10 a month to play, and require id verification.\r\n\r\nIll fucking pay it, ill fucking provide my id.\r\n\r\nAnd ill exclusively fucking play that queue.\r\n\r\nBecause atleast ill fucking know that every game i queue up for, everyones trying to win.\r\n\r\nFuck you riot, you dont know how to handle your fucking playerbase at all.","replies":[{"poster":"esp","date":"2018-01-11T09:24:37.156+0000","up_votes":7,"down_votes":4,"body":"riot supports inting. instead of raging at your team just run it down mid, it's all good because atleast that way you feel you got some revenge and you won't be punished because you didn't say anything ! What a good system!","replies":[{"poster":"KAYN BRINGS PAIN","date":"2018-04-23T01:12:30.753+0000","up_votes":11,"down_votes":1,"body":"Hahaha well said. Riot are pretty stupid when it comes to common sense. lmao","replies":[]}]},{"poster":"collects","date":"2018-05-05T16:00:25.440+0000","up_votes":9,"down_votes":1,"body":"I am cool with this. Make a 10$ entry for the year with drivers license / proof of age card. Ranked is such a shit show right now.","replies":[]},{"poster":"ChokeMeDadee","date":"2018-05-05T15:44:53.426+0000","up_votes":8,"down_votes":1,"body":"I just want to have a good game of league but every time I log on and play Riot says \"lol fuck you\"","replies":[]},{"poster":"LAKIGR","date":"2018-01-11T02:42:54.487+0000","up_votes":1,"down_votes":25,"body":"All I can say it chill out you got a bad team deal with it","replies":[{"poster":"somecheeseplease","date":"2018-04-22T13:51:45.462+0000","up_votes":12,"down_votes":0,"body":"its not the team being bad, its that they just dont care. they jump in and run around and ruin the experience for otheres","replies":[]},{"poster":"KaynMid","date":"2018-01-11T02:56:53.857+0000","up_votes":9,"down_votes":2,"body":"lol ill chill out when theres a queue where the only people in it want to win.\n\nBecause quite frankly, this isnt about a bad team, i could care less if my team is less skilled than the opposing team, yeah its annoying but thats still atleast carriable.\n\nIts when people arent even trying that i get pissed the fuck off.\n\nBecause if you arent trying then you are no better than a troll or int feeder in my eyes, take that shit to norms.","replies":[{"poster":"LAKIGR","date":"2018-01-11T05:44:04.421+0000","up_votes":4,"down_votes":9,"body":"> [{quoted}](name=KaynMid,realm=OCE,application-id=Ntey9fRZ,discussion-id=bem0xA8o,comment-id=00010000,timestamp=2018-01-11T02:56:53.857+0000)\n>\n> lol ill chill out when theres a queue where the only people in it want to win.\n> \n> Because quite frankly, this isnt about a bad team, i could care less if my team is less skilled than the opposing team, yeah its annoying but thats still atleast carriable.\n> \n> Its when people arent even trying that i get pissed the fuck off.\n> \n> Because if you arent trying then you are no better than a troll or int feeder in my eyes, take that shit to norms.\n\nI mean it’s great and all to say that they aren’t trying but simple fact is your bronze 3 people don’t really care about ranked games even in ranked games or they r just plain up bad so again it’s just a game get over it","replies":[{"poster":"KaynMid","date":"2018-01-11T10:34:49.847+0000","up_votes":10,"down_votes":2,"body":"\"it’s just a game get over it\"\nSo why not play norms instead of ranked then?\n\nWhat is so alluring about ranked that you just HAVE to queue for it despite not wanting nor caring to win.","replies":[{"poster":"LAKIGR","date":"2018-01-11T11:33:43.681+0000","up_votes":1,"down_votes":9,"body":"> [{quoted}](name=KaynMid,realm=OCE,application-id=Ntey9fRZ,discussion-id=bem0xA8o,comment-id=0001000000000000,timestamp=2018-01-11T10:34:49.847+0000)\n>\n> \"it’s just a game get over it\"\n> So why not play norms instead of ranked then?\n> \n> What is so alluring about ranked that you just HAVE to queue for it despite not wanting nor caring to win.\n\nBecause the simple fact is and try to stay with me here you are bronze 3 people at your elo will just give up the second things go wrong on top of that I hate to point this out u have a 44% win rate with over 300 ranked games so I’m pretty sure it isn’t just some of the teams your getting that are the reason u aren’t climbing","replies":[]}]}]}]}]},{"poster":"AlexDotP","date":"2018-01-11T04:29:54.511+0000","up_votes":5,"down_votes":0,"body":"I understand what you are saying here, I mean you need your team and league is one of the most team base game. People should take it little more serious there. \nTheres nothing wrong to make a post about it, i reckon its good to spread out but getting mad and posting  like this makes people as well as riot to ignore. Let's just calm down a bit and post it more sensible way.\nBut I do agree on some points there, it can be really frustrating when you have a troll that messes up your game to climb the rank ladder","replies":[]},{"poster":"Roguestoney","date":"2018-01-11T02:41:21.158+0000","up_votes":6,"down_votes":2,"body":"😂","replies":[]},{"poster":"SOOM","date":"2018-01-11T03:17:49.662+0000","up_votes":3,"down_votes":14,"body":"Lmao mad","replies":[]}]}