{"poster":"Zerenza","date":"2020-02-29T06:31:11.812+0000","title":"Worst type of League Player.","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"The \"I'm an Expert\" player. NO ONE LIKES YOU!\r\n\r\n\"Hey whats your rank?\"\r\n\"What's your Max Order?\"\r\n\"Why are you building that?\" \r\n\"You should have done this, not that.\"\r\n\r\nLike, why? Why do you feel the need to constantly give advice when NO ONE asked you for it. This is the FASTEST way to tilt a teammate, hands down you'll tilt whoever you do this to instantly. It's so pretentious and annoying to be constantly judged by someone who thinks they're always right even though your performing better than them. \r\n\r\nNO ONE WANTS YOUR OPINION! Stop shoving it in their faces, UNLESS THEY ASK DO NOT GIVE ADVICE, EVER! It's annoying, Unnecessary and just makes you out to be a jerk when in truth i know your TRYING to help but fact is i don't want your \"Help\" half the time nothing these player's say is actually helpful it's obvious to the person playing the champion but they think they need to point it out JUST IN CASE you don't know already with your 500k mastery points.","replies":[{"poster":"Theorex","date":"2020-02-29T07:37:57.132+0000","up_votes":1,"down_votes":1,"body":"I generally give advice to people of lower rank than me.  To correct their mistakes.\n\nIf they can't handle a bit of criticism that isn't on me.  I don't aim go come off as a \"Rankist\" or a \"Egotistical\" asshole.  \n\nWhen I give you solid advice, and the first thing you want to think of is \"Why are you flaming me?\" or \"I didn't ask for your help.\"  Then you have a ego problem, and you are going to have to run your face against a fucking wall until you learn the lesson I was trying to teach you.  \n\nThere are three types of people in these cases.\n\nThe wise, who learn from other peoples mistakes.\n\nThe smart, who learn from their own mistakes.\n\nThe vigilant, who run their faces into a brick wall until it makes sense to them.\n\nI went from the vigilant in bronze to being the smart.  \n\nIt is extremely hard to be wise in this game, you can only be wise to a point.  Normally these points are coined as laning, post laning, and macro.","replies":[{"poster":"Zerenza","date":"2020-02-29T08:29:48.819+0000","up_votes":2,"down_votes":0,"body":"Why do you feel the need to give a Lesson? I understand someone being a lower rank than you by why can't they just learn on their own? I might be a low rank myself but i don't really like getting advice especially when it's pointless like, as i said \"Why are you building X Item.\" if i wanted to answer their Elitist ass i'd say \"Because i started building it and it was a bad idea.\" but i'm not going to answer them because then they just tell me why it was a bad idea, why i made a bad decision, what i should do.\n\n I already know that i made a mistake a don't need someone else to tell me about it and then continue to go through a whole dictionary and try to tell me what to do the whole game. I understand someone being a higher rank and therefore, in general, being better than me in most cases but i also don't want to be Coached the entire game because all it does is it make that person out to be an Elitist who just enjoy's telling other's what to do and how to play. There's also the fact that tbh pretty much all of us in the game aren't as good at the game as we think we are and everytime someone starts telling me what to do i just think \"This person has a massive ego and nothing to back it up yet.\" because most of the time they don't have anything to back it up yet, the game just started and they haven't done anything to prove that i need to listen to them.","replies":[]}]},{"poster":"Woodakoodashooda","date":"2020-02-29T09:14:38.960+0000","up_votes":1,"down_votes":0,"body":"Wrong.\n\nAll of that can be muted and ignored.\n\nI almost always play with chat AND pings muted. \n\nThe worst kind of league player is an actual troll.\n\nSomeone who idles at random locations on the map and occasionally deals damage to something just to avoid being afk.\nSomeone who runs it down a lane and deliberately dies to enemies.\nSomeone who AFK farms while the enemy attacks their nexus.\nSomeone who sabotages the role of another ally either by turning a solo lane into a duo lane and steals the player's farm or by taking all of the allied jungle's farm.\nSomeone who uses all chat to alert enemies of ally locations and intentions.\n\nThere is nothing stopping a person from doing any of these things.\n\nSomeone wants to tell me what to do all the fucking time. IDGAF, I mute all and play the game in peace and quiet.","replies":[]},{"poster":"Jng Account","date":"2020-02-29T07:17:23.962+0000","up_votes":1,"down_votes":0,"body":"I think there is nothing wrong with genuine advice. Like is your ego so big you cant take it?\n\nI told our adc to stop sidelaning when they had Rengo, nothing happened and he ended up 6/14.\n\nI told our adc to get QQS if she want to win and survive Mordes ult.\n\nI told our Seju that Adaptive mask is indeed good vs Cassi.\n\nI told Yi to stop engaging like rambo, bcs he is too quick and we have hard time following him.\n\nI could go on and on, like why is it hard to swallow your ego and at least give it quick thought? Maybe its actually helpfull...","replies":[{"poster":"Zerenza","date":"2020-02-29T08:22:29.447+0000","up_votes":1,"down_votes":0,"body":"Those are different than what i was referring to, asking useless questions like why a person is building X item, and before you say \"Well what item is it, if it's stupid i'll tell them.\" that's not for you to say. Plenty of time's i started building an item and in hind sight i shouldn't have, i know that, i don't need someone else to tell me that i made a mistake. \n\nAsking about someone's rank so you can get on to them and put yourself on a pedestal and tell them what to do is just plain not fun for the other person. If you have to ask someone's rank to make yourself feel better then why are you being matched with people who \"Aren't as good as you.\" \n\nThings like that where you keep pointing out the obvious non-game knowledge related issue's is what i'm talking about, i don't need help, no one needs your help and in the end all you do when you give out advice like this is make yourself out to be an Elitist.  (Again the things that you listed are fair and you should say things like that it can help but never put yourself above other's because it just makes them hate you and not want to listen to you because your an Elitist.)","replies":[]}]},{"poster":"Zezockary","date":"2020-02-29T07:32:59.958+0000","up_votes":1,"down_votes":0,"body":"I give advice to people fairly often and usually the response is \"oh thanks I didn't think of that\" or something like that.","replies":[]},{"poster":"5050BS","date":"2020-02-29T06:58:51.995+0000","up_votes":1,"down_votes":0,"body":"Smurfs","replies":[]},{"poster":"LanceTheJungler","date":"2020-02-29T06:53:20.454+0000","up_votes":1,"down_votes":2,"body":"Nah most of those 500k mastery players are hardstuck silvers for a reason.","replies":[]},{"poster":"94372148","date":"2020-02-29T08:35:17.396+0000","up_votes":2,"down_votes":3,"body":"The worst type of league player (and human in general) is any piece of shit that plays an assassin. We get it, you want to shove your dick up people's asshole without any counterplay, you're a piece of shit and every horrible thing that happens to you you deserve.","replies":[]}]}