{"poster":"Mi3zekatze","date":"2017-01-05T21:22:10.286+0000","title":"Neue APC auf der Botlane Meta","subforum":"Champions & Gameplay","up_votes":2,"down_votes":4,"body":"Ich wollte mal fragen was ihr so davon haltet und wie ihr es seht das immer mehr APC (Ability-Power-Carrys) als ADC fungieren. \r\nWie beeinflusst dies den Spielfluss? Findet ihr das gut oder nicht?\r\nWie countert man APC auf der Botlane?\r\nSt&auml;rken und Schw&auml;chen? \r\n\r\nDa ich kp habe (sehr wohl aber eine eigene Meinung xd) wollte ich fragen wie ihr das seht!","replies":[{"poster":"Sihari","date":"2017-01-05T22:23:37.022+0000","up_votes":3,"down_votes":0,"body":"An sich mag ich diese neue \"Meta\", da sie mir endlich die Lux-Morgana Combo ermöglicht, für die ich vor einer Weile noch ausgelacht wurde. \nAndererseits wird das auch in der Meta der Supports etwas ändern und ich weiß nicht, ob ich da soooo glücklich mit bin. Gerade eben habe ich erst Gefallen an Janna gefunden, die sich mit einem APC nicht so toll macht. Und auch meine Nami ist ohne jemanden, der permanent die Stacks der E auf die Gegner bringt, nicht mehr ganz so effektiv. :c","replies":[{"poster":"ninju7su","date":"2017-01-06T09:38:15.028+0000","up_votes":1,"down_votes":0,"body":"Das würde heißen, das Supports dann auch nicht immer nur Bot-Lane gehen werden in Zukunft vllt..\nVllt Supported man dan hin und wieder die Toplane oder findet sich gar in der Mitte wieder? Ich halte die meisten AP-Champs für nicht spielbar auf der Botlane und das der Ziggs und evt auch Cassio auf der Bot gezoggt werden war glaube ich eher so ein,.. \"hoppla was ist da denn lustiges passiert\" von Rito. \n\nIch glaube, dass sobald ADC wieder ein wenig stärker werden, wird sich das auch alles wieder einpendeln.","replies":[{"poster":"OrangeBubble","date":"2017-01-06T13:49:56.117+0000","up_votes":1,"down_votes":0,"body":"Nja, das Problem ist, dass viele auch High Elo ADC's Main wohl nicht mehr so einen starken Einfluss auf's Spiel haben, wärend APC eben eher einen Einfluss haben. Ziggs kann Tower auch gut durchpushen, Cassio hat den DPS für Objektiv. \nWieso einen ADC spielen, wenn es APC gibt, die Teilbereiche eines ADC's viel früher gut erledigen können.\nWerden ADC's gebufft, dann verschwinden die APC von der Botlane, denn ADC's können die Aufgaben eigentlich besser erledigen, nur ist ihr Powerspike viel zu weit hinten. \n\nEvtl. würde es wohl auch reichen, andere Lanes etwas zu schwächen.","replies":[]}]},{"poster":"DontKillMySoraka","date":"2017-01-06T00:43:51.633+0000","up_votes":1,"down_votes":0,"body":"genau deshalb stehe ich dieser Änderung mit Bedenken gegenüber.","replies":[]},{"poster":"Mi3zekatze","date":"2017-01-05T22:27:57.001+0000","up_votes":1,"down_votes":0,"body":"Stimmt klassiche Supports werden dadurch genervt weil sie ohne ADC, Bonus AD-Werte (Janna E) AS (Lulu E) oder Onhiteffekte (Nami e?) Nicht nutzen können. Stimmt ist mir gar nicht aufgefallen! ;)","replies":[]}]},{"poster":"Megamaexx","date":"2017-01-06T00:03:16.160+0000","up_votes":2,"down_votes":0,"body":"Ich finde es ganz gut, dass es mal nicht heißt, “welcher ADC geht bot“ sondern “kommt da jetzt AP oder AD“, das macht das Spiel vielfältiger.\nCountern kann man APCs mit viel waveclear und auch so ein all in tut einem mage weh. \nHextrinker wird sich vielleicht zum core item für die verbliebenen ADCs entwickeln. \nAktuell gibt es aber gar nicht so viele APCs, die sich lohnen. Manche sind zu gankanfällig, andere haben nicht die Pushkraft oder werden outranged. So ein autoattack eines ADC tut schließlich mehr weh als von einem APC. Dem APC geht irgendwann das Mana aus und wenn bis dahin nicht gut genug gepusht wurde, kloppt ein ADC auf den eigenen Turm ein.\n\nIch rechne künftig jedenfalls mit sehr viel Vielfalt auf der Bot.","replies":[]},{"poster":"Yamató","date":"2017-01-06T00:24:55.423+0000","up_votes":2,"down_votes":1,"body":"Ich finde es etwas ignorant, dass Riot das jetzt als \"frischen Wind\" abstempelt anstatt die ADCs einfach mal wieder spielbar machen, damit auch diese wieder mehr Einfluss im Midgame haben. Ich bin überhaupt nicht begeistert von den APCs aber das ist auch nur meine Meinung.","replies":[]},{"poster":"XenesisCH","date":"2017-01-05T22:49:54.831+0000","up_votes":1,"down_votes":0,"body":"Bisher ist es vor allem um Ziggs, weil er halt neben gutem Dmg und Scaling auch Türme wie nichts klein macht. Hast du  denn noch von andern APC gehört, die erfolgreich auf der Botlane fungieren?","replies":[{"poster":"BM Vilich","date":"2017-01-06T09:30:31.179+0000","up_votes":1,"down_votes":0,"body":"Azir, Karthus, Talya und Cassiopeia. Vor allem konstanter Schaden ist dabei wichtig.","replies":[{"poster":"XenesisCH","date":"2017-01-06T17:39:28.816+0000","up_votes":1,"down_votes":0,"body":"Und wer spielt diese?","replies":[]},{"poster":"OrangeBubble","date":"2017-01-06T13:52:08.210+0000","up_votes":1,"down_votes":0,"body":"Eine Lux z.B. würde demnach nicht so gut funktionieren oder?","replies":[{"poster":"BM Vilich","date":"2017-01-06T14:28:33.321+0000","up_votes":1,"down_votes":0,"body":"Bei Lux sind vor allem auch die Manakosten ein Problem. Nach ner Weile wirst du halt eingedrückt.","replies":[]}]}]},{"poster":"Megamaexx","date":"2017-01-05T23:53:42.084+0000","up_votes":1,"down_votes":0,"body":"Cassiopeia soll noch gut sein.\nIch persönlich habe nur Morgana getestet (mit einer Nami). Hat gut funktioniert, Lanedominanz hat man dadurch.","replies":[]}]},{"poster":"BM Vilich","date":"2017-01-06T09:28:34.275+0000","up_votes":1,"down_votes":0,"body":"Vielfalt ist immer gut, daher begrüsse ich die neuen Möglichkeiten. Dadurch könnte man nun  auch wieder gewisse ADCs in der Mitte spielen, denke jetzt da spontan an MF, Ezreal, Varus ohne magic dmg einbüssen zu müssen.","replies":[]}]}