{"poster":"Ficha9","date":"2017-01-26T18:11:25.846+0000","title":"Codigo del invocador?","subforum":"Comportamiento del jugador","embed":{"description":"Aunque un juego como League of Legends se afronta con ambiciones y expectativas individuales, una vez que estás en medio del campo de batalla, todos los jugadores forman parte de un equipo. Para bien o para mal, nuestros destinos están entrelazados con los de nuestros compañeros.","url":"http://gameinfo.las.leagueoflegends.com/es/game-info/get-started/summoners-code/","image":"https://lolstatic-a.akamaihd.net/global-elements/0.0.31/images/esrb.jpg"},"up_votes":3,"down_votes":2,"body":"Luego de jugar varias partidas en esta ultima semana y de ver que en la mayor&iacute;a de mis derrotas tuve un afk, un troll o un toxico, me pareci&oacute; oportuno leer el c&oacute;digo del invocador.\r\nAca no pretendo decir que &quot;tal es malo porque perdi&oacute; linea&quot; o &quot;fue teemo supp y trolleo&quot;. No, ac&aacute; no hablo de troll por un pickeo o por perder una linea, algo que puede suceder en cualquier game (siempre va a haber alguien que pierda linea, sea de tu equipo o del otro indefectiblemente). Por lo tanto nos centramos en realmente alguien que juega para perder, que no ayuda al equipo de forma intencional, que se burla de sus compa&ntilde;eros o del equipo contrario o que insulta a uno o varios jugadores.\r\nRealmente luego de varios d&iacute;as en los cuales me cruc&eacute; con gente muy toxica y muy troll, llegue al punto de ponerme a pensar y hacerme la siguiente pregunta que se la hago a los moderadores del foro y a todos aquellos que pertenezcan al staff de Riot &quot;LAS&quot;:\r\n\r\n&iquest;Quien debe hacer respetar el c&oacute;digo del invocador?\r\n\r\nUna pregunta muy simple pero que es la base del juego si uno se pone a pensar. Uno cuando se registra e inicia por primera vez el juego, lo primero que se le aparece es este famoso &quot;c&oacute;digo&quot;. Y lo primero que te dice es &quot;Apoya a tu equipo&quot;.\r\nRespondiendo desde mi punto de vista a la pregunta, es posible que en cierto punto nosotros (los invocadores) debamos hacer respetar el c&oacute;digo. Pero todos sabemos que esto es imposible. Que tipo de &quot;justicia&quot; podemos impartir si todos sabemos que haciendo 1 reporte por partida no logramos nada. Todos sabemos que por mas que pidamos al equipo contrario que reporte a X troll-toxico la mayoria de las respuestas es &quot;jajaja suerte&quot; &quot;surrendeen y reporto&quot;. Insisto, aca no me enfoco en un invocador que perdio linea o que haya dicho &quot;che wn no molestes&quot; o &quot;pelotudo juga en equipo&quot;. No, aca estoy enfocado en la gente realmente toxica y la gente realmente troll.\r\n\r\nEs sorprendente que el primer post sea &quot;5 pasos para banear toxicos&quot;. Staff de riot, uno invierte plata (no por obligacion, sino porque le gusta el juego y considera que es la unica forma de colaborar a mejorar y a que siga creciendo el juego) para que ustedes &quot;staff&quot; encuentren soluciones. Pero esto es un tema que no pudieron encontrarle solucion nunca y al parecer dejaron de buscarla ya. Entonces volviendo a la pregunta central. Es nuestra responsabilidad realmente hacer respetar el codigo del invocador? No, claramente no. Nosotros podemos informar que X jugador rompio el codigo mediante los reportes pero los que deben hacer cumplir el codigo son ustedes (staff).\r\nMe causa gracia la dedicacion que le dan a ciertas cosas como hacer chistes dentro de las notas de la version, mostrar el &quot;modelo de negocio&quot; de riot o el armado de los cortometrajes. Vamos gente, en que va a mejorar mi experiencia dentro del juego el saber que puedo ser el mejor jugador del mundo sin gastar plata? o va a haber menos flamers por saber que la voz del cortometraje la hizo &quot;X persona&quot;?\r\nTodos estos son datos de color que a mucha gente le puede gustar, pero todos sabemos que el principal problema es la toxicidad y la poca importancia que le dan al codigo y esto se debe a que el nivel de penalizacion es minimo (para no decir nulo). Ya que en una partida podes ser el peor troll pero si tenes suerte de que te reporten solamente 2/3 personas, no lo van a penalizar.\r\n\r\nFinalizando, staff nosotros los invocadores queremos jugar para divertirnos (la mayoria, se que es asi). Si ustedes imponen un c&oacute;digo del invocador, deberian hacerlo respetar el mismo. No me interesa que en una nota de version pongan &quot;draaaaaaaaaaaaaaaaaaaven, no lo nerfeamos pero lo queriamos nombrar&quot; (por poner un ejemplo). Queremos tener una mejor experiencia dentro del juego y eso se logra con premios y castigos, los mismos no deben venir de parte de los mismos jugadores ya que la mayoria considera de que el reporte es inutil (el tiempo, que es sabio, demostro la inutilidad del sistema de reporte) y ni mencionar el sistema de honores (hace cuanto no veo un liston de honores?).\r\nLo ultimo que pido, busquen soluciones, hace a&ntilde;os que decidieron hacer silencio respecto a este tema y hace a&ntilde;os que el problema viene creciendo cada vez mas. El juego necesita un cambio en este sentido, era mas efectivo el sistema donde uno podia ser &quot;juez&quot; y mirar 10 casos por dia o algo similar. Hay cosas que se pueden hacer, eso seguro, pero el no hacer nada es lo peor de todo.\r\n\r\nSin mas.\r\nFicha9.-","replies":[{"poster":"Yrox the Third","date":"2017-01-26T18:22:11.209+0000","up_votes":1,"down_votes":0,"body":"Para empezar, estas muy equivocado en como funciona el sistema de castigos.\n\nEn una partida, recibir uno o 9 reportes (validos, no falsos) ya es suficiente para llamar la atencion del sistema, pero no es suficiente para castigar a alguien, esta persona debe ser reportada correctamente en una cierta cantidad de partidas para que sea castigada.\n\nY no puedes decir que la cantidad es casi nula si cada dia en estos foros llega una cantidad considerable de gente quejandose de que los banearon \"injustamente\", y considerando que no todos los que son baneados vienen a quejarse en el foro, te puedes imaginar de la cantidad de gente que es castigada diariamente (ademas, si logras encontrar alguno que otro post debes saber que no es nada en comparacion a la cantidad masiva que entra diariamente, ya que muchos de estos post si no es que son todos, son borrados del foro ya que rompen las reglas de este).\n\nPara terminar, estas equivocado, el Tribunal fue el peor error de Riot.","replies":[{"poster":"Ficha9","date":"2017-01-26T19:18:27.756+0000","up_votes":1,"down_votes":0,"body":"Nro 1: Te equivocas, en el sistema salta distinto si son 9 reportes en una misma partida o 1 solo.\nNro 2: Los baneados existen, no lo niego, pero a veces no es suficiente o no es la mejor solucion. Yo no estoy planteando que ante la primer trolleada sea baneado X invocador. Por eso digo que el sistema de penalizacion deberia ser mas dinamico y mas profundo a solo basarse en \"report-Ban\". Es un ida y vuelta muy simple que no soluciona en profundidad el problema. A mi no me da satisfaccion perder una partida ranked que estaba completamente ganada, reportar al final y saber que banearon al player ese. Esos 35/40 minutos los tuve perdidos y con una experiencia pesima y muchas veces hay una consecutividad de partidas que sucede y te hace pasar unas horas que dedicaste a disfrutar la terminas pasando pesimo. Por eso digo que el sistema deberia ser mas dinamico y basarse en otro tipo de \"Premios y castigos\"\nNro 3: El tribunal no considero q haya sido un error. Por ahi estaba mal implementado, pero el hombre siempre quiere Justicia por lo tanto aquel que entraba al tribunal (como era mi caso) siempre intentaba tomarselo en serio, ya que para que se aplique la sancion debia de haber una coincidencia en varios jugadores que analizaban cada caso. Insisto, no me parece malo el sistema, me parecia mal implementado. Un sistema automatico, que brilla por su ausencia y que lo unico que genera es silencio por parte del staff si es un sistema malo.\n\nSaludos y gracias por la rta!","replies":[{"poster":"Yrox the Third","date":"2017-01-26T19:39:00.415+0000","up_votes":1,"down_votes":0,"body":"1) Bueno, quizas ahi me explique mal, a lo que me referia es que con solo 1 report valido es necesario para que el sistema lo considere y es lo importante, si recibe varios reportes (algo que no dije antes) va a hacer que el sistema lo castigue un poco mas rapido, pero no hara que lo castiguen inmediatamente.\n\n2) Tienes que considerar algo, se entiende tener que perder casi 40 minutos de tu vida solo para saber que ayudaste a castigar a alguien puede frustrar a mucho, sin embargo, es la unica manera de saber que alguien esta haciendo algo malo.\n\n3) El Tribunal fue sacado por el abuso masivo de este sistema, ademas habian muchos errores, por ejemplo, ese sistema no tenia una diferenciacion entre \"report valido\" y \"report falso\", si te reportaban entonces podias aparecer en el Tribunal y por ende, podias ser castigado, y era algo bastante probable ya que facilmente el 90% o mas de los jugadores que entraba en el tribunal, no leia nada e iba directamente al boton de \"castigar\" ya que estos se sentian increiblemente poderosos, y era asi, los jugadores tenian DEMASIADO poder en esos tiempos y con eso aprendi algo, los jugadores deberian tener el poder de acusar, reportar y/o decir directamente quien esta rompiendo las reglas y avisar al sistema o a los que tienen el poder de hacer algo y que ellos los castiguen, pero no puedes darles a todos este poder.\n\nEste sistema funciona perfectamente bien, y escuchar casos de bans que DE VERDAD son injustos es muy raro, facilmente, el 0.0000000001% de los castigos hechos por este sistema fueron completamente injustos, y las personas que avisaron esto fueron \"recompensadas\" (creo que les dieron bono de ip o algo por el estilo), pero ahora en el Tribunal, era mucho mas normal saber que hubo gente castigada injustamente.\n\nObviamente no es necesario que el Staff hable de esto, porque no se necesita, el sistema funciona y hay pruebas de eso, no necesitan cambiar nada porque el sistema cada ves va aprendiendo mas y mas, asi que cada vez castigara mucho mas rapido.\n\nEn lo personal, prefiero un sistema silencioso, para ya se sabe que eso fue por un desperfecto que no arreglaron, el sistema solo da el mensaje de que cierta persona fue castigada a la ultima persona que hizo un report, osea, si 100 personas reportan a alguien y este es castigado, solo la ultima persona que dio el report sabra que castigaron a alguien, los otros 99 no tendran idea.","replies":[]}]}]},{"poster":"Shion Archimago","date":"2017-01-26T18:18:42.485+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Ficha9","date":"2017-01-26T19:19:19.029+0000","up_votes":1,"down_votes":0,"body":"No entiendo la ironia de tu \"facepalm\" si podrias expresarte con palabras seria mejor.","replies":[]}]},{"poster":"9081913DEL1","date":"2017-01-26T18:19:19.702+0000","up_votes":1,"down_votes":0,"body":">  si todos sabemos que haciendo 1 reporte por partida no logramos nada\n\nHasta ahi llego, desde ahi en adelante ya te estas basando en algo que juras pero que no es cierto.\n\nLos bans existen y hay milesy miles de cuentas baneadas y permabaneadas. Tratar de mitigar la frustracion en el soporte no te va  a ayudar.\nPiensa en lo siguiente, como podria ser permisivo un sistema que es AUTOMATICO?\nPor logica no puede, es imposible es un robot. Te reportan una otra y otra vez, el robot ve que te reportan por morir mucho entonces el robot busca en la historia tus muertes y ve que en la mayoria no hay intercambio de daño, uso de habilidades y que todas son bajo la torre. Luego observa que 8/10 reportes son por la misma razon, entonces BAN. Listo, no tiene margen de error.\n\nTodo es sencillo, solo hay que aceptar que no se puede pretender encontrar gente seria en un juego con una edad de rango tan baja. (un error a mi criterio en un juego tactico), pero sabiendo eso ya de por si la respuesta es simple juega en equipo o juega a TU JUEGO.\n\nSaludos.","replies":[{"poster":"Ficha9","date":"2017-01-26T19:10:20.601+0000","up_votes":1,"down_votes":1,"body":"Nadie dijo que no existian los bans. Pero todos sabemos que son infimos con respecto a la cantidad de trolls-toxicos que hay ingame.\nInsisto, es un sistema permisivo por default justamente. \"Hecha la ley, hecha la trampa\" dice el dicho, todos sabemos como es el sistema, por lo tanto yo puedo jugar tranquilamente \"trolleando\" sin ser detectado por el sistema, como? Simple, no colaboro con el equipo, inicio tfs y me escapo, hago malos trades de habilidades, \"flasheo\" mal. Sistemas automaticos no detectan esas cosas.\n\nTe dejo un pequeño ejemplo que me toco hace un par de dias, jugue con una elise que no conocia las habilidades, no conocia como se usaba rapel (lo tiro varias veces y no sabia como activarlo por 2da vez y con que podia activarlo). Esto sucedio en ranked de platino, hasta ahi podes decir nada fuera de lo comun. Pero en una situacion del game, sucedio que la cait contraria ulteo a jinx, elise estaba para cubrirla y que hizo cuando venia el proyectil? Uso rapel y dejo morir a jinx. Entonces cual fue su respuesta? \"Mi primo me dijo que lo haga\". Como detecta ese \"trolleo\" el sistema automatico, contame.\n\nCoincido plenamente en el rango de edad tan bajo para un juego tactico y estrategico.","replies":[]}]}]}