{"poster":"Lord Stair","date":"2015-06-08T23:15:06.209+0000","title":"Hi im a argentinian boy","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"Hi guys, im a argentinian boy, i used to play in this account 3 years ago, in NA, and when it have free transfer to OCE i just transfer ( 3 years ago) and now i need this account, could i  get a free transfer to LAS? i dont have credit cards to buy RP, and my local cards cant use it, and dont have any manual charge.\r\n\r\nSorry for my bad english, can someone help me? i really need the transfer, and i cant play in OCE, im many kilometres away ( argentina ) and i just play a game today and all the time with 420 ms.\r\n\r\nCan someone help me pls, can i get a free transfer? i cant buy rp, someone help me please!!!!!!!!!!\r\n\r\nthanks you and sorry for my bad english, i just learned it in school","replies":[{"poster":"Alamo","date":"2015-06-10T02:16:47.466+0000","up_votes":1,"down_votes":0,"body":"troll or serious? That is the question.","replies":[]},{"poster":"SEKAI","date":"2015-06-09T10:47:20.568+0000","up_votes":1,"down_votes":0,"body":"It's would be free once you've paid the transfer fee.","replies":[]},{"poster":"sparklefart","date":"2015-06-09T01:41:42.647+0000","up_votes":1,"down_votes":0,"body":"Did noone realise this is a troll post?","replies":[]},{"poster":"Chicken4dinner","date":"2015-06-08T23:57:51.019+0000","up_votes":1,"down_votes":0,"body":"I don't have money for rp myself, Maybe ask riot...\nProbably use the oce service if there is one, there is likely more infrastructure here (more giving a fuck)","replies":[]},{"poster":"GoldenTomat0","date":"2015-06-08T23:33:12.082+0000","up_votes":1,"down_votes":0,"body":"Shouldn't have transferred if you aren't from the OCE region. if you got the free skin, why would they send your account to LAS for free?","replies":[]},{"poster":"Lord Stair","date":"2015-06-08T23:16:06.186+0000","up_votes":1,"down_votes":0,"body":"Im from argentina i dont have any way to buy rp, someone help me please, i only want the transfer to LAS","replies":[]}]}