{"poster":"Renato Balestra","date":"2016-02-04T16:25:40.829+0000","title":"Spiegatemi....(piccolo sfogo)","subforum":"Discussioni generali","up_votes":4,"down_votes":7,"body":"C&#039;&egrave; un qualche motivo preciso per il quale capito solo con team pieni di incapaci? No veramente non ce la faccio pi&ugrave;, pi&ugrave; mi impegno a giocare bene, ad aiutare la squadra e a non flammare gente che meriterebbe di essere bannata, pi&ugrave; perdo. Sono l&#039;unico? C&#039;&egrave; una sorta di maleficio? Non lo so veramente. Ormai vinci se hai culo, culo di capitare con qualcuno che un minimo sappia giocare. Sono stanco....capita anche a me di giocare male ogni tanto....ma ogni tanto!! Non &egrave; possibile che capiti sempre con incapaci. Sono stanco. Ripeto, sono l&#039;unico?\r\nUscire dal bronzo &egrave; un&#039;impresa. Non dico che sia colpa della riot ma non c&#039;&egrave; la possibilit&agrave; di adottare un sistema per accorpare tutti gli incapaci e farli giocare insieme, non lo so, qualcosa del genere, e non parlo di gente che anche se gioca male &egrave; ingrado di collaborare comunque in qualche modo, parlo di INCARRIABILI.\r\nScsate per questo piccolo sfogo ma non ne potevo pi&ugrave;. Spero di non essere l&#039;unico.","replies":[{"poster":"I Homura I","date":"2016-02-04T16:58:14.562+0000","up_votes":7,"down_votes":0,"body":"Da bronzo a gold è così, mettiti l'anima in pace. La gente inizia ad essere brava MINIMO dal platino alto in su (più o meno).\nComunque un po' dipende anche dalla fortuna un po' dalla bravura ma tieni conto di alcune cose:\n1. non si carrya un game da soli, a meno che c'è una differenza notevole di capacità \n2. se non guardi prima i tuoi errori anzichè incolpare gli altri non migliorerai mai come giocatore\n3. se tilti ti deconcentri e inizi a diventre un peso per il team\n\nPer il resto posso dirti che ogni volta che vado mid o top ricevo gank al livello 2, in media dai 3 ai 7 gank in 10 minuti. Magari vi chiederete \"e vabbè se pushi..\" No non pusho mai troppo per questo motivo, a meno che vedo che il jungler è in altre lane. Evidentemente ho l'attira-babysit.\nIl mio amico ha una sfortuna peggiore della mia, ogni volta che gioco con lui mi trovo gli italiani che feedano e flammano.","replies":[{"poster":"Killer SurpRyze","date":"2016-02-05T08:41:33.416+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Poro May Cry,realm=EUW,application-id=MJVj50Jw,discussion-id=ZTEtUccW,comment-id=0005,timestamp=2016-02-04T16:58:14.562+0000)\n>\n> Da bronzo a gold è così, mettiti l'anima in pace. La gente inizia ad essere brava MINIMO dal platino alto in su (più o meno).\n> Comunque un po' dipende anche dalla fortuna un po' dalla bravura ma tieni conto di alcune cose:\n> 1. non si carrya un game da soli, a meno che c'è una differenza notevole di capacità \n> 2. se non guardi prima i tuoi errori anzichè incolpare gli altri non migliorerai mai come giocatore\n> 3. se tilti ti deconcentri e inizi a diventre un peso per il team\n> \n> Per il resto posso dirti che ogni volta che vado mid o top ricevo gank al livello 2, in media dai 3 ai 7 gank in 10 minuti. Magari vi chiederete \"e vabbè se pushi..\" No non pusho mai troppo per questo motivo, a meno che vedo che il jungler è in altre lane. Evidentemente ho l'attira-babysit.\n> Il mio amico ha una sfortuna peggiore della mia, ogni volta che gioco con lui mi trovo gli italiani che feedano e flammano.\n\nlascia stare la sfiga, che la mia è viva! Anzi, non sono io ad avere sfiga, è lei ad avere me.\nSe per una volta mi avvicino ad un cespuglio senza ward, dentro c'è il team nemico ; contro ho spesso i counter pick (perché l'avversario è telepatico) ; se decido di giocare safe, potevo prendermi una kill, ma se decido di giocare aggressivo, spuntano fuori il jungler e il mid insieme per una gangbang (con una precisione al secondo, che neppure se ci si dà appuntamento) ; ecc...\nOrmai ci ho fatto l'abitudine, così ho deciso di \"pensare sempre al peggio\" -.-'","replies":[{"poster":"I Homura I","date":"2016-03-02T15:09:02.563+0000","up_votes":1,"down_votes":0,"body":"Un errore comune è entrare in un bush non wardato -> gang bang nel 70% dei casi. Comunque so cosa intendi, succede spesso anche a me ma quello che posso consigliarti è di essere sicuro almeno di avere qualcuno vicino a te prima di fare engage o simili.\nI counterpick sono limitati, nel senso che ciò che countera più di tutto è l'abilità del giocatore.","replies":[]}]}]},{"poster":"99White Terror99","date":"2016-02-04T17:04:00.789+0000","up_votes":2,"down_votes":0,"body":"prendi un champ stupido, che ai bassi livelli non si sa come counterare e spammalo, vinci e poi puoi giocare come preferisci\nanch'io sono stato buttato giù a bronze 4 (se non ricordo male) so già che per uscirne dovrò spammare illaoi visto che ai bassi livelli non ci sanno giocare contro (nemmeno io so farlo xD) comunque per ora va così, non sei l'unico","replies":[]},{"poster":"JoyBoy39","date":"2016-02-04T16:40:13.081+0000","up_votes":2,"down_votes":0,"body":"Io sto unranked e fava al vento","replies":[]},{"poster":"YDN HeLLBreaKer","date":"2016-02-04T17:26:39.031+0000","up_votes":1,"down_votes":0,"body":"{{champion:23}} impari a giocarlo, e passi 30 minuti a partita top a splittare :3","replies":[]},{"poster":"Frattaglia","date":"2016-02-04T16:54:33.393+0000","up_votes":2,"down_votes":5,"body":"Sarà il periodo.","replies":[{"poster":"l  Ferox  l","date":"2016-02-04T17:02:52.844+0000","up_votes":1,"down_votes":0,"body":"Quel periodo ?","replies":[]}]},{"poster":"Nabbomaster","date":"2016-02-04T16:45:39.880+0000","up_votes":1,"down_votes":0,"body":"uscire dal bronzo un imprese? quando stavo in bronzo 2 season fa e' stato semplice spamma yi in tutti i ruoli top mid adc supp jugler, yomou e gg, adesso puoi rankere decidendo la lane meglio di cosi","replies":[]},{"poster":"mansitkd","date":"2016-02-04T16:34:49.048+0000","up_votes":1,"down_votes":0,"body":"mi sono auto carriato da bronzo 3 a silver 5, ed ora ho il tuo stesso problema. e dico se perdo è anche colpa mia perchè sono ignorante. ma i bronzi non lo ammettono{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Dr LouD","date":"2016-02-04T16:52:11.889+0000","up_votes":2,"down_votes":2,"body":"Uscire dal bronzo è un'impresa? No.\n\nL'impresa è iniziare a capire che non sai giocare.\nUna volta capito, puoi solo migliorare.","replies":[]}]}