{"poster":"Famous Gay Actor","date":"2019-11-20T01:21:18.638+0000","title":"Is it just me or is the League community getting super soft?","subforum":"Player Behavior","up_votes":3,"down_votes":19,"body":"Like I feel like you can get banned nowadays even if like 99% of all of your chat is relatively neutral banter or casual trash talk. You say one mean thing - doesn't even have to be involving cursing or anything - and the system bans you outright because someone got butthurt. I mean, come on, fellas. Grow a pair and don't get so butthurt over every little insult. It's pathetic.\r\n\r\nLike no joke, you can't even be realistic in this game - especially when it's negative. Like you can't even say the game is over, because Riot wants everyone to believe every game is \"winnable\" even if it isn't. Like I subscribe to the 40 - 40 - 20 rule. I win 40% of my games no matter what, I lose 40% of my games no matter what, and the other 20% is up for grabs. But I can't even be realistic with these people or risk a permanent ban. I can't even say \"it's over\" without being told I'm toxic or a griefer, even when there is nothing - LITERALLY. NOTHING. - going for us. I have bad games, I get carried, I sometimes shit the bed and realize while I'm shitting the bed, my team is winning elsewhere, all I need to do is stop shitting the bed and I'll get carried. All I can say is, Riot bring back the tribunal. Stop letting a bot judge us. I know it makes y'all's life easier but bots don't have any sense about them.","replies":[{"poster":"GatekeeperTDS","date":"2019-11-20T02:10:14.335+0000","up_votes":15,"down_votes":4,"body":"Is it just me, or is the community full of super insecure people who need to insult their teammates and spew negativity in a video game for 45 minutes?","replies":[{"poster":"Ph03n1xb1rd","date":"2019-11-20T10:54:52.719+0000","up_votes":4,"down_votes":3,"body":"How is it being insecure that you do not want somebody to intentionally ruin your game? Please elaborate, since i have literally no idea what you mean by this....","replies":[]}]},{"poster":"Tele II","date":"2019-11-20T04:29:14.038+0000","up_votes":7,"down_votes":1,"body":"Its because when you call my teammate an idiot (most would say a pretty light insult) it can potentially derail an entire game and cause a loss purely because of that. Now my insecure teammate is gonna have to insult you back, and youre gonna have a smart ass response for that. Then hes gonna match you with some other bullshit, and suddenly we lose because two people on my team are focused on insulting eachother and telling eachother how little they care about this unranked match. Sometimes they even start trolling to prove they dont care lol. So yeah, get banned. I dont wanna play with kids who prioritize protecting their fragile egos over playing the damn game. The game comes first. If it disrupts the game, you can get banned for all i care. I dont play to socialize with strangers, and a lot of the time, strangers socializing is actually just them pissing eachother off and tilting off the earth. Its unfortunate that people are that defensive, but thats the reality of society today. Riot cant change that. They can only adjust to it.\n\nFor me, its not about being soft. Its about disrupting the game. Fuck off with that. You dont hurt my feelings, you annoy the shit out of me.\n\n(P.s. i havent heard the 40/40/20 rule in like 3 years or so. I used to tell people about it lol)","replies":[{"poster":"Famous Gay Actor","date":"2019-11-30T21:27:41.224+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tele II,realm=NA,application-id=ZGEFLEUQ,discussion-id=NpYgrTaT,comment-id=0003,timestamp=2019-11-20T04:29:14.038+0000)\n>\n> Its because when you call my teammate an idiot (most would say a pretty light insult) it can potentially derail an entire game and cause a loss purely because of that. Now my insecure teammate is gonna have to insult you back, and youre gonna have a smart ass response for that. Then hes gonna match you with some other bullshit, and suddenly we lose because two people on my team are focused on insulting eachother and telling eachother how little they care about this unranked match. Sometimes they even start trolling to prove they dont care lol. So yeah, get banned. I dont wanna play with kids who prioritize protecting their fragile egos over playing the damn game. The game comes first. If it disrupts the game, you can get banned for all i care. I dont play to socialize with strangers, and a lot of the time, strangers socializing is actually just them pissing eachother off and tilting off the earth. Its unfortunate that people are that defensive, but thats the reality of society today. Riot cant change that. They can only adjust to it.\n> \n> For me, its not about being soft. Its about disrupting the game. Fuck off with that. You dont hurt my feelings, you annoy the shit out of me.\n> \n> (P.s. i havent heard the 40/40/20 rule in like 3 years or so. I used to tell people about it lol)\n\nI call people idiots daily. It's just not something I type... frequently. Generally I try to stick to (actual) verbal insulting as Riot can't penalize me for something I scream at a screen. When I get insulted, I tend to just go AFK. I feel like if we're going to go there, then you're more interested in arguing with me and insulting me than playing the game - and I can find plenty of other ways to waste my time than \"listen\" to you typing harrassing things in League chat. If you don't value my time, I don't value your RP - simple as that.","replies":[]}]},{"poster":"MikeJ122O","date":"2019-11-20T12:12:49.424+0000","up_votes":2,"down_votes":0,"body":"Sorry I don't like my random adc calling me a bot every 5 minutes because I died once.\n\nCalling me a feeder doesn't make me happy and it turns me off so I won't type anything back to that person.\n\nI don't like it when a teammate says gg ff@15 because they want to give up. Instead of saying it's over, say what your team can do to increase your odds of coming back and winning the game. I've come back from every tower/structure being destroyed only to have the enemy team throw hard and loss the game.\n\nThere's a big difference between friendly trash talk and being toxic.","replies":[]},{"poster":"Yin Yang Taoist","date":"2019-11-20T11:35:52.459+0000","up_votes":2,"down_votes":0,"body":"They don't want you to trash talk. Games that are lost are lost. I've never suffered any punishment for saying so. Frankly, I don't even say anything, anymore. Just hit the surrender vote. \n\nNo system is perfect. I definitely enjoyed the Tribunal while it was active. The problem was that some people joining the Tribunal would do it just to throw troll verdicts and I think that it got a little bit out of hand. They should have just not let _everyone_ join the tribunal. Give it as a perk with incentives. Giving the right judgement would reward you with extra gifts &amp; honor while wrong verdicts would remove you from it. Anyway, this doesn't really matter now since I doubt that its coming back.\n\nBut yes, the Tribunal was definitely more 'humanly'?! I could say. What you said about the bot reminds me of this one manga/light novel where the Arch Angels basically judged you as either black _or_ white. There was no gray. So a child stealing some buns to feed his sick mother in bed would be decapitated because 'stealing is wrong'. There was no reasoning, no understanding or compassion because it was not sentient. It was based on a set of rules. Of-course, that was that. Here, its just a punishment.. nothing super serious. But my point is, a bot will do as it is programmed to do. They simply don't have the man power to actually handle all these cases manually. Think about it, how many games are being played in a single day and how many of those games have toxic reports?! \n\nWhile it does feel difficult to accept some judgments; I think that I've gotten around it by simply muting chat. I never started anything and I am a pretty tolerant person. So if my chat is muted and I never see any nonsense from people I play with, I'd not get into trouble at all. There are very few times where I'll leave chat unmuted in AI games or ARAMs. And I noticed that even those have toxic people in them. In ranked, when my team runs around clueless, I get exasperated enough to /unmute for a moment to see what's going on. But that's about it. And that's how you deal with the bot system.","replies":[]},{"poster":"NF Remilia","date":"2019-11-22T13:49:44.592+0000","up_votes":1,"down_votes":0,"body":"Interesting, I'm playing this game since season 1 , I use the chat all of the time. I'm chatting a lot actaully and focusing on the game too :) I never got punished. I only got 5 min ques because of my internet at the time ( it was horrible ) but other than that nothing really happened :) I'm not offensive towards any1 maybe thats the reason? :O no idea...","replies":[]},{"poster":"Aminumbra","date":"2019-11-20T08:45:36.807+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Famous Gay Actor,realm=NA,application-id=ZGEFLEUQ,discussion-id=NpYgrTaT,comment-id=,timestamp=2019-11-20T01:21:18.638+0000)\n>\n> Like I feel like you can get banned nowadays even if like 99% of all of your chat is relatively neutral banter or casual trash talk. \n\n\"Casual trash talk\" This is already something quite bordeline, and is not completely accepted. It exists at very high level, where proplayers trash talk each other. The difference is that they don't do it DURING the match, but rather before or after; they know each other; they often face each other. Therefore, it can be seen or interpreted as \"Ironic trash talk between two friends, before a competition, while having to face the consequence of it\" (i.e. people meme-ing on Twitter, Reddit and so on. It IS a difference, in the sense that you actually risk something when doing so. Not much, but still: popularity, potentials sponsors, etc).\nIn your typical soloQ game, your \"casual trashtalk\" is simply insulting a complete stranger.\n\n>You say one mean thing - doesn't even have to be involving cursing or anything - and the system bans you outright because someone got butthurt. I mean, come on, fellas. Grow a pair and don't get so butthurt over every little insult. It's pathetic.\n\nI mean, you're wrong. If the guy got butthurt, he will report you. However, if you end up getting *banned*, it's because Riot has decided that what you've done in banworthy, independently from what the guy who reported you felt or said. Moreover, when you're banned for what you said in chat - i.e. not a gameplay-related ban, such as trolling -, it is always for curse or negative behaviour that has no reason to be there in the first place.\n\n> Like no joke, you can't even be realistic in this game - especially when it's negative. Like you can't even say the game is over, because Riot wants everyone to believe every game is \"winnable\" even if it isn't.\n\nYou think the game is over ? Start a surrender vote. It doesn't work out ? It means that there are still people in your team who want to try &amp; win it (it has its flaws, I know, but this is the principle). Therefore, as you agreed to play this game, you have to tryhard until it is *actually* over, that is, when one of the two Nexus is down or when one team surrenders.\nBesides, it is EXTREMELY unlikely that those games are actually definitely, 100%, absolutely lost. Even at high ELO, people throw all the time, and the soloQ uncoordinated environment makes it frequent for team with a lead to have trouble finishing the game. Thefore, if everyone in your team stays focused and keep tryharding, it is generally possible to comeback even from seemingly lost situations.\n\n>Like I subscribe to the 40 - 40 - 20 rule. I win 40% of my games no matter what, I lose 40% of my games no matter what, and the other 20% is up for grabs. But I can't even be realistic with these people or risk a permanent ban. I can't even say \"it's over\" without being told I'm toxic or a griefer, even when there is nothing - LITERALLY. NOTHING. - going for us.\n\n1/ There is NEVER \"Litterally nothing going for you\". If you keep tryharding, there will at least be the will to win and to do your best until the end, instead of a negative mindset.\n\n2/ If the game is actually over, you don't have to say it in the chat, because your Nexus has just fallen or the surrend vote has been accepted. Otherwise, it's not over, and so you're using chat for nothing except tilting your teammates.\n\n> I have bad games, I get carried, I sometimes shit the bed and realize while I'm shitting the bed, my team is winning elsewhere, all I need to do is stop shitting the bed and I'll get carried. All I can say is, Riot bring back the tribunal. Stop letting a bot judge us. I know it makes y'all's life easier but bots don't have any sense about them.\n\nThere are way too much players now to handle this process humanly. It won't happen, ever.","replies":[]},{"poster":"Prandine","date":"2019-11-20T07:49:54.780+0000","up_votes":1,"down_votes":0,"body":"Depends on what you mean by \"super soft/sensitive\". If it's the ones complaining about being held accountable for their actions and punished for them then yes I would say they are super soft/sensitive. If it's the ones refusing to put up with overly disruptive and poor behavior regardless of the excuses those people in question try to justify it with then no I would say they're not super soft/sensitive.\n\nI've been playing since S2 and I use chat frequently in my games. Sometimes to joke around but mostly for gameplay related stuff like \"mid mia\", \"gj\" for a successful play, \"farm for late\" when we're behind or \"they're mostly physical so prioritize armor if possible\" for an AD heavy team. I have yet to receive a warning or punishment. Do I get mad and frustrated? Oh yes, absolutely. Do I flame in chat and/or start trolling/inting when things don't go my way? No, I instead vent at the screen so I don't compromise my teams chances of success.\n\nIf you're having so much trouble with communication that you feel like you can't say things like \"bot mia\" or \"group for baron\" then you should look at how exactly you're saying and delivering it rather than being so quick to cry \"sensitive community\" if your delivery and behavior is causing you to get in trouble.","replies":[]},{"poster":"Need Gold 4 Tent","date":"2019-11-22T14:10:39.584+0000","up_votes":1,"down_votes":1,"body":"Yes. Not just LoL community, but the entire world in general. Everyone's offended by everything. Say something that unfortunately offends someone or some group, and SJW squad appears to condemn you and your life choices. To the point that a snarky \"gg ez\" is offensive enough to be a bannable offense. Damn right these people are soft, bring on the downvotes.","replies":[]},{"poster":"AronCartman","date":"2019-11-20T04:33:30.462+0000","up_votes":1,"down_votes":13,"body":"No its not you, Riot lyte (remember this fucker), he basically added the nanny bot which removed my precious 3000 chat restrictions and started P banning for simply pointing out facts like kda, cs, ward score and elo /wr which is kind of ironic because negativity is also punished the same as facts","replies":[{"poster":"TrulyBland","date":"2019-11-20T07:15:33.374+0000","up_votes":3,"down_votes":0,"body":"So, the system which **tried** to punish you by giving you 3000 chat restrictions was okay, but the system which punishes the same behaviour in a way that actually affects you is a \"nanny bot\"?\nSeems to me like you don't really oppose the system out of principle as much as you oppose it now being effective enough to *actually* punish you.","replies":[]}]},{"poster":"KVbqbFsC8e","date":"2019-11-20T01:29:48.190+0000","up_votes":2,"down_votes":11,"body":"The League community has always been super soft.","replies":[{"poster":"Imperial Pandaa","date":"2019-11-20T05:39:42.298+0000","up_votes":1,"down_votes":0,"body":"#FleshbagProblems.\n\nEdit: Didn't realize pound sign/hashtag would do that.","replies":[]}]},{"poster":"Nightsky Pirate","date":"2019-11-20T03:40:21.778+0000","up_votes":1,"down_votes":10,"body":"Yes, and the current system will keep pushing it to be more extreme. I strongly disagree with it, though I've never been punished by it. Seeing silence in a game even when someone is full on feeding (which I reported just today)...\n\nIt's bad.","replies":[]}]}