{"poster":"CortaLaGonna","date":"2016-10-24T08:37:55.435+0000","title":"Sono main support","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"Gioco campioni come blitzcrank e morgana li so usare abbastanza bene,sono bronzo 4 e non riesco ad uscire  per colpa del mio pc che va a 4 fps in teamfight,mi potete consigliare campioni con molta utility ma semplici da usare?\r\nGrazie in anticipo","replies":[{"poster":"Dr LouD","date":"2016-10-24T08:41:38.899+0000","up_votes":3,"down_votes":0,"body":"Quante volte te lo devo ripetere che il tostapane non va bene come PC??","replies":[]},{"poster":"Hariberü","date":"2016-10-24T09:18:09.995+0000","up_votes":2,"down_votes":0,"body":"Se ti va a 4fps prova a mettere le impostazioni very low, altrimenti smetti di giocare che nessun chiamp lo usi con 4fps.","replies":[]},{"poster":"Nice Doggo","date":"2016-10-24T10:44:52.612+0000","up_votes":1,"down_votes":0,"body":"Ciao quando non sai cosa pickare o nel team avversario hanno Blitz o Thresh o magari sei First pick vai giù di Braum, se nel team avversario vedi qualche champ che in fight va circa 49538 di danni al secondo picka leona, se hai già un tank in team magari opta per zyra o altri champ ap ignoranti.\n\nTi sconsiglio Blitz, se sbagli il grab è semplicemente finita, il tuo team ti flamma a prescindere se il grab di prima era buono ecc, e l'utilità e 0.\nPure Janna la lascerei perdere, in bronzo basso è un 4vs5.\n\nPER IL RESTO puoi ignorare semplicemente tutto quello che ho appena detto, perché sono un misero s4 e giocare il support che più ti aggrada... che penso sia la miglior cosa.","replies":[]},{"poster":"Zanarkand III","date":"2016-10-24T09:14:53.712+0000","up_votes":1,"down_votes":0,"body":"In bronzo dimenticati dei support da utility, vai di zyra brand o al massimo gioca blitzcrank se sei bravo a grabbare... altrimenti vai di danno, builda le ward e poi full ap con liandry e rilay.. soprattutto se hai 4 fps che sono un grosso problema, è come se fossi perma stunnato in ogni teamfight ed è impossibile giocare cosi. I support da utility implicano focus precisi nei fight, oggetti attivati e exaust sul champ giusto al momento giusto e con 4 fps non puoi fare assolutamente niente di tutto questo.\n\nSe mi dici quali caratteristiche ha il tuo pc posso aiutarti a capire se è un problema di hardware oppure puoi risolverlo con qualche click","replies":[]},{"poster":"Kalenax","date":"2016-10-24T09:06:22.895+0000","up_votes":1,"down_votes":0,"body":"Per gli fps metti la grafica al minimo (cosa che sicuramente avrai già fatto) e assicurati di chiudere qualsiasi cosa inutile, magari scaricando qualche programma che lo fa in automatico quando avvii il gioco e, cosa che dovresti fare sempre,  stai attento al positioning (te lo dice una che in fight scende a 8 fps).\nPer i campioni ti consiglio Braum e Janna, dopo che impari un po' di meccaniche base è abbastanza facile salire con loro (sono main support, ho fatto il gold principalmente con loro due e Thresh). Soprattutto con Janna attento al positioning.\nPoi ti consiglio anche Thresh, che in poche parole è una versione migliore di Blitzcrank.\nP.S: il titolo è strano owo","replies":[]},{"poster":"Linkimaru OP","date":"2016-10-24T08:51:44.916+0000","up_votes":1,"down_votes":0,"body":"A 4 fps qualsiasi champ diventa ingiocabile, fai prima a cambiare pc o disinstallare se veramente lagghi così manco ti diverti.","replies":[]},{"poster":"UnknownEV","date":"2016-10-24T08:41:27.533+0000","up_votes":1,"down_votes":0,"body":"1- non capisco il titolo che senso ha...\n2- non capisco perchè chiedi un champion facile da usare se tanto lagghi o.o\n3- se vuoi mobilità... prendi questi {{item:3117}} \n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}