{"poster":"Barco Basureroo","date":"2017-01-04T20:24:58.163+0000","title":"no me deja descargar las repeticiones","subforum":"Problemas Técnicos","up_votes":2,"down_votes":1,"body":"no me deja descargar las repeticiones, aprieto el bot&oacute;n de descargar y queda cargando y en un par de minutos me dice error de descarga en todas, ya no se que hacer","replies":[{"poster":"NoPidasGank","date":"2018-08-24T08:08:02.511+0000","up_votes":2,"down_votes":0,"body":"Hace poco tuve ese problema \nCreo que se produjo al actualizar Windows 10 porque antes andaba bien\nLo logre solucionar cambiando la ruta de descarga de las repeticiones","replies":[]},{"poster":"Gabvy2018","date":"2017-01-05T15:18:07.663+0000","up_votes":3,"down_votes":2,"body":"Como andas ? \n\nTe fijaste si estás corriendo el cliente nuevo en modo administrador ? por lo general intenta guardar el archivo de la replay en esta ubicación: \n- C:\\Users\\tu usuario\\Documents\\League of Legends\\Replays\n\nsino tiene permisos de administrador, no puede bajar la replay y listo.","replies":[]},{"poster":"TSM Bad Bunny ","date":"2017-08-28T00:53:54.529+0000","up_votes":1,"down_votes":0,"body":"por lo menos no soy el unico, ojala arreglen este problema rapido","replies":[]},{"poster":"Lil Sugu","date":"2017-01-30T18:11:54.539+0000","up_votes":1,"down_votes":0,"body":"Hola a mi me pasa lo mismo, probé lo del modo administrador y se \"descargo\" (en la carpeta no aparece) me parece el icono para darle play pero nunca abre :c. Solo queda el icono de League en medio de la pantalla.","replies":[]},{"poster":"Barco Basureroo","date":"2017-01-05T18:41:01.132+0000","up_votes":1,"down_votes":0,"body":"Bien gracias por preguntar\n\nMira yo entro en modo administrador y me la deja descargar pero cuando aprieto para verlas me dice repetición no encontrada. Yo nunca jugué partidas  en modo administrador, solo entre en modo administrador para ver si se podía descargar la partida puede ser esa la razón ? \n\nGracias","replies":[]}]}