{"poster":"Pixiehorse","date":"2016-02-02T21:10:11.828+0000","title":"Azir wall and Jayce","subforum":"Report a Bug","up_votes":2,"down_votes":0,"body":"When Azir casts his wall, why wouldn&#039;t Jayce&#039;s leap to the sky Q be able to jump over it if Azir was in range.  Happened to me last night but the wall bounced me back.","replies":[{"poster":"Riot Exgeniar","date":"2016-02-02T22:52:22.695+0000","up_votes":2,"down_votes":0,"body":"League effectively works in a 2D plane. Every vertical movement you see in the game is pretty much for visuals, and has no gameplay implications. So just treat Jayce's Q as a dash strike, and Azir's wall is intended to block movement. \n\nSorry for any confusion.","replies":[{"poster":"Vistha Kai","date":"2016-02-06T10:35:23.420+0000","up_votes":1,"down_votes":0,"body":"Speaking of confusion, can I suggest lowering Lux's Final Spark's point of origin to match the hitbox?\n\nAs you said game is basically 2D, meaning hitboxes are at ground level.\nMeanwhile some abilities, like Lux's in question, are elevated and, depending on the angle, appear really misaligned.\n\nIn case of Lux it's pretty significant as visuals can appear as far as the whole width of the hitbox away when fired horizontally(left to right, right to left) while vertically(top to bottom, bottom to top) they appear nearly perfect, except at the end of the Final Spark.","replies":[]},{"poster":"Pixiehorse","date":"2016-02-02T23:04:17.044+0000","up_votes":1,"down_votes":0,"body":"Thank you for your time.","replies":[]}]},{"poster":"Mantra","date":"2016-02-03T12:37:54.557+0000","up_votes":1,"down_votes":0,"body":"What would be purely visual standpoint answer not related to technicalities xD\n\nTeeechnically Azir's wall is made of alive soldiers who bump the target away if someone tries to go past them and Jayce doesn't jump high enough for them not to be able to shieldpunch him away :)","replies":[]},{"poster":"stealthfox94","date":"2016-02-02T22:59:24.475+0000","up_votes":1,"down_votes":0,"body":"Wall is meant to block dashes. I think {{champion:105}} can jump over it but that's because he is untargetable.","replies":[]},{"poster":"The Frostbooty","date":"2016-02-02T21:15:18.527+0000","up_votes":1,"down_votes":0,"body":"thats what the wall does is stop dashes.","replies":[{"poster":"Pixiehorse","date":"2016-02-02T21:41:14.761+0000","up_votes":1,"down_votes":0,"body":"The tool tip does not say dash though, its says leaps and the animation clears the wall.  And it does let you leap at him but you bounce off, even though you clear it.  It should clear the wall technically by the tool tip.\n> To The Skies!: Jayce leaps to an enemy, dealing 30 / 70 / 110 / 150 / 190 / 230 (+1.0 per bonus attack damage) physical damage and slowing enemies by 30 / 35 / 40 / 45 / 50 / 55% for 2 seconds.","replies":[]}]},{"poster":"Boulderox","date":"2016-02-02T21:15:24.323+0000","up_votes":1,"down_votes":0,"body":"The wall blocks everything  and above , nothing can jump over it, only blink","replies":[]}]}