{"poster":"YOU BEEN WARNED","date":"2015-05-17T00:35:12.238+0000","title":"\"We reworked Zilean bombs because taking point click damage is oppressive\"","subforum":"Gameplay","up_votes":93,"down_votes":32,"body":"{{champion:8}}","replies":[{"poster":"FalconPawwwwnch","date":"2015-05-17T00:58:58.545+0000","up_votes":72,"down_votes":5,"body":"Meanwhile ad carries breaking the game for 4 years","replies":[{"poster":"52847732_DEL","date":"2015-05-17T02:48:45.379+0000","up_votes":27,"down_votes":3,"body":"\"All AD carries now have skillshots as their basic attacks.\"\n\nThat actually sounds pretty cool.","replies":[{"poster":"Only Play Darius","date":"2015-05-17T03:01:29.908+0000","up_votes":6,"down_votes":2,"body":"{{champion:157}}","replies":[{"poster":"Hammerion","date":"2015-05-17T03:03:51.394+0000","up_votes":10,"down_votes":2,"body":"I think this is better seen on Smite.\n\nFor Yasuo, it's a spell and therefore some people find it to be hitting unfairly hard. (crit {{champion:41}} 's Q does this too lategame)","replies":[{"poster":"The Ecdysiast","date":"2015-05-17T15:25:21.942+0000","up_votes":6,"down_votes":2,"body":"But for Yasuo, at 256 AD, the 25% damage reduction on its crits makes it do less damage than his autos.","replies":[{"poster":"Thryale","date":"2015-05-17T18:54:32.376+0000","up_votes":3,"down_votes":1,"body":"uh, yas only has a 10% crit penalty, not a 25%","replies":[]}]},{"poster":"Rew711","date":"2015-05-17T03:19:26.286+0000","up_votes":1,"down_votes":0,"body":"{{champion:21}}...","replies":[{"poster":"ZPIN2WIN","date":"2015-05-17T03:23:46.330+0000","up_votes":2,"down_votes":0,"body":"{{champion:81}}","replies":[]}]}]}]},{"poster":"Ancestor007","date":"2015-05-17T04:41:26.451+0000","up_votes":5,"down_votes":0,"body":"Are we playing smite?","replies":[]},{"poster":"NapaIm","date":"2015-05-17T03:14:03.618+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Pupge,realm=NA,application-id=3ErqAdtq,discussion-id=2ZMZbutj,comment-id=00040002,timestamp=2015-05-17T02:48:45.379+0000)\n>\n> \"All AD carries now have skillshots as their basic attacks.\"\n> \n> That actually sounds pretty cool.\n\nSooooo...we are playing Smite now?","replies":[]},{"poster":"4nth0l0gy","date":"2015-05-17T13:14:52.968+0000","up_votes":3,"down_votes":0,"body":"Well then it'd just be an FPS","replies":[]},{"poster":"Zydron","date":"2015-05-17T16:39:17.129+0000","up_votes":2,"down_votes":0,"body":"{{summoner:11}}","replies":[]}]},{"poster":"FantasySniper","date":"2015-05-17T02:40:52.390+0000","up_votes":6,"down_votes":3,"body":"Vlad gets defense scaling off of his offense and offense scaling off of his defense.","replies":[]}]},{"poster":"Vistha Kai","date":"2015-05-17T00:46:49.350+0000","up_votes":34,"down_votes":2,"body":"If you want to give example of point'n'click you can't do nothing about.\n{{champion:50}}","replies":[{"poster":"NoMoreRules","date":"2015-05-17T00:59:02.735+0000","up_votes":26,"down_votes":3,"body":"Yet almost nobody complained about him. Incoming Riot rework, then people will bandwagon with Riot and say: \"he was so toxic, if you get in range of his Q you died\"","replies":[{"poster":"Bethor Kookalian","date":"2015-05-17T04:57:27.723+0000","up_votes":10,"down_votes":4,"body":"1.Swain -is- pretty toxic, design-wise.  This is irrespective of both his popularity and balance(a champ with a 25% win-rate can still have a toxic design).\n\n2.Y'know, its really hard to tell bandwagoners from people who just don't talk except when they agree with an issue because they don't like arguing on the internet.  Personally, when I actually engage people, they almost always actually believe what they're espousing to believe at the time they posted it.  That's admittedly kinda anecdotal, but its better than nothing.","replies":[{"poster":"Migrañaboy","date":"2015-05-17T08:25:04.131+0000","up_votes":4,"down_votes":1,"body":"Why it's toxic? Because point and click is unavoidable? What's toxic?","replies":[{"poster":"Wheatloaf","date":"2015-05-17T15:33:09.648+0000","up_votes":3,"down_votes":0,"body":"If your damage is too reliable, fights just turn into a check of whether you have enough stats to beat your opponent, which usually feels pretty bad for both sides. See: two oom ADCs dueling.","replies":[]}]}]}]},{"poster":"Xietnin","date":"2015-05-17T05:15:01.201+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Vistha Kai,realm=EUNE,application-id=3ErqAdtq,discussion-id=2ZMZbutj,comment-id=0001,timestamp=2015-05-17T00:46:49.350+0000)\n>\n> If you want to give example of point'n'click you can't do nothing about.\n> {{champion:50}}\n\nThe fun part is he has no push potential. That lane-bullying is merciless, but at least he can't push lanes at all. Not until level 6 with a lot of mana anyway.\nIf you ever see a Swain and you're playing as Ziggs/Malzahar/Azir/etc., just go crazy on the minions at a safe distance with lots of basic attacks. Just be careful of those Nevermores (the pink bind-circle), keep moving in different directions and keeping out of his range to have the enemy Swain get a hard time leading his spell. Good luck to anyone having problems against Swain. =)","replies":[{"poster":"Wheatloaf","date":"2015-05-17T15:37:54.666+0000","up_votes":2,"down_votes":0,"body":"This is the other side of the problem with swain's design: His strengths are almost unavoidable for his opponent, so his weaknesses are almost unavoidable for him. Reliability is a double-edged sword in PvP game design, because everything has to have a tradeoff of some sort to be balanced.","replies":[]}]}]},{"poster":"The Storm Dragon","date":"2015-05-17T00:55:56.877+0000","up_votes":28,"down_votes":1,"body":"The main problem with Vlad is that he's a manaless champion that's ranged with sustain. Riot has always talked about how ungated sustain is terrible design and that Vlad's existence alone is what is keeping spellvamp from becoming 'viable'. Because if they make spellvamp stronger, then Vlad would become totally overwhelming.","replies":[{"poster":"shadowstorm32","date":"2015-05-17T02:05:38.568+0000","up_votes":19,"down_votes":3,"body":"{{champion:82}} {{item:3070}}","replies":[]},{"poster":"Freljordan","date":"2015-05-17T04:10:50.557+0000","up_votes":4,"down_votes":0,"body":"That and then also the fact that his ranged sustain is so closely tied with his character in both fantasy and kit that they could never really significantly change it without entirely destroying vladamir as we know him. Which makes the problem with spellvamp near unfixable.\nI feel as though Akali also keeps spell vamp down in addition to vladamir, but I can't think of anyone else who would just completely be broken otherwise","replies":[{"poster":"WarlockLaw","date":"2015-05-18T03:32:08.599+0000","up_votes":2,"down_votes":0,"body":"Morde is far more frequently mentioned when talking about spell vamp than akali. While morde doesn't break it nearly as hard as vlad does both usually build will of ancients so that the no longer have a cost associated with their abilities","replies":[]}]}]},{"poster":"1000angrybees","date":"2015-05-17T00:43:57.145+0000","up_votes":6,"down_votes":12,"body":"well I mean technically if we're just singling out champs with those {{champion:7}} {{champion:84}} {{champion:9}} {{champion:55}} {{champion:238}} (and some others I'm forgetting) but a lot of them have travel time or are actually a projectile or something so","replies":[{"poster":"YOU BEEN WARNED","date":"2015-05-17T00:51:48.566+0000","up_votes":13,"down_votes":2,"body":"I'd argue travel time is worse than cast time. Zilean's bombs need to go through a clunky cast time animation to go through, while slow projectiles like {{champion:84}} are going to hit the target either way, allowing the caster to move at the same time.","replies":[]}]},{"poster":"lDontLiftIcarry","date":"2015-05-17T03:39:53.408+0000","up_votes":7,"down_votes":0,"body":"Every adc in the game.","replies":[]},{"poster":"brad","date":"2015-05-17T04:14:17.603+0000","up_votes":10,"down_votes":3,"body":"\"we at riot games hella said this 100% true quote\" -riot games\n(citation needed)","replies":[]},{"poster":"OyddAWqJ5r","date":"2015-05-17T03:36:22.000+0000","up_votes":7,"down_votes":5,"body":"Vlad does nowhere near as much click target damage as Zilean did. Zilean could 100-0 squishies in ~2 seconds with click target damage. Vlad does about 25%-40% of a squishy's health with a Q depending on how ahead he is.","replies":[{"poster":"SpecterVonBaren","date":"2015-05-17T07:20:19.858+0000","up_votes":4,"down_votes":0,"body":"I think the issue is that after a Vlad player gets revolver, he proceeds to smash his e and q keys until the enemy dies and because he's getting health back from doing this, prevent any retaliation the enemy inflicts on him from sticking.","replies":[]}]},{"poster":"rG Thundrag","date":"2015-05-17T02:49:18.983+0000","up_votes":5,"down_votes":3,"body":"Vlad is the only champion riot has actually apologized for making to date.","replies":[{"poster":"Hammerion","date":"2015-05-17T03:00:39.022+0000","up_votes":4,"down_votes":0,"body":"? really ?","replies":[]},{"poster":"Audiomancy","date":"2015-05-18T03:42:39.183+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=rG Thundrag,realm=NA,application-id=3ErqAdtq,discussion-id=2ZMZbutj,comment-id=0009,timestamp=2015-05-17T02:49:18.983+0000)\n>\n> Vlad is the only champion riot has actually apologized for making to date.\n\n{{champion:78}}","replies":[]}]},{"poster":"Bethor Kookalian","date":"2015-05-17T04:52:12.588+0000","up_votes":8,"down_votes":4,"body":"#notthesamething\n\n1.Vladimir is on the extended \"toxic game design, needs to be reworked\" backlog list somewhere, so its not like he's actually an example of Rito-hypocrisy or something, but.....\n\n2.Vladimir is actually a different design from Zilean in ways that make it less toxic to have a point&click damage skill.  To list them:\n\nA)Old-Zilean could do 640 base damage plus 1.8 AP worth of damage of targeted damage as pure burst from 700 range in .25s.  Vladimir's Q 230 base and .6 AP worth of damage at 600 range.  At level 9.  One of these things is not like the other, man.\n\nB)Targeted spells become more toxic with range and less toxic with game time.  A targeted nuke in a teamfight is *WAY* less toxic than a proportionally relevant targeted nuke in the laning phase.  This is why Ryze had to be reworked.  Vladimir, unlike most, is very late-game oriented, and thus, his early game is focused around surviving and farming, not bullying, which is why he can be \"healthier\" with a targeted nuke than others.  His Q is also rather short ranged, a feature that means he opens himself up to a lot of gap-closers in order to use it offensively.\n\nC)Vladimir lacks decent burst at *EVERY* point in the game.  His 1s burst, even with a fully stacked E, is 616 base + 1.176 AP damage.  That's pathetic.  He'll never, ever, ever burst someone to death.  He needs *TIME* to kill people, and without, they either can kill him back or get to the safety of shields and peel before he finishes them off.  Even Ryze didn't suffer this problem, as old-Ryze could QWRQEQ someone and deal pretty respectable damage in the space of cast times plus 1.1s(between the 2nd and 3rd Q).\n\nI'm not saying Vladimir is 'healthy', but he's definitely more healthy than old-Zilean.","replies":[{"poster":"SUPER RQ INCOMIN","date":"2015-05-17T08:35:06.267+0000","up_votes":4,"down_votes":1,"body":"My ass, I'd play against old zilean a zillion times before playing against toxic ass vlad in lane.\n\nZilean's combo costs him 4 fucking spells, E->Q->W->Q Zilean is fucking oom if he has to do this all the time, not to mention he had one of the lowest hps and armors in the game back then. Vlad's combo costs him nothing and it discourages trading with him since it heals him a fuckton, no drawbacks whatsoever.\n\nIf you're saying that you rather play against pre-nerf Syndra in lane than Zilean; you're one delusional motherfucker my friend.","replies":[]}]},{"poster":"58738074DEL1","date":"2015-05-17T05:26:17.665+0000","up_votes":3,"down_votes":0,"body":"***","replies":[{"poster":"Kynami","date":"2015-05-17T08:55:38.399+0000","up_votes":2,"down_votes":0,"body":"I've actually smacked Garen with exhaust completely trashing his ult damage on the carry I was supporting a few times... It may be unmissable once cast animation begins (now that they've fixed vision juking his ult), but with say a hexdrinker on ADC, aegis on support, or an exhaust and his kill potential nosedives.","replies":[]}]},{"poster":"The Bearded Bard","date":"2015-05-17T14:01:56.435+0000","up_votes":1,"down_votes":2,"body":"I'll let you guys in on a few ways to deal with Vlad.\n\n1. Pick any of these champions {{champion:63}} {{champion:69}} {{champion:31}} {{champion:122}} {{champion:131}} {{champion:36}} {{champion:9}} {{champion:81}} {{champion:114}} {{champion:105}} {{champion:3}} {{champion:86}} {{champion:150}} {{champion:120}} {{champion:39}} {{champion:24}} {{champion:64}} {{champion:10}} {{champion:38}} {{champion:126}} {{champion:127}} {{champion:90}} {{champion:57}} {{champion:82}} {{champion:133}} {{champion:2}} {{champion:92}} {{champion:68}} {{champion:98}} {{champion:102}} {{champion:14}} {{champion:72}} {{champion:50}} {{champion:17}} {{champion:5}} {{champion:62}} {{champion:112}} or {{champion:154}}  The chose is really up to you, any of them will absolutely destroy Vlad. \n\n2. Take either {{summoner:4}} {{summoner:12}}  or {{summoner:14}}. If Vlad is any kind of decent he'll take Flash + Ghost (I used to say this was dumb until I tried it and lemme tell you, I'll never be going back with the exception of extreme cases like they're building a bd or early drag team and I need TP) That frees you to have the teleport advantage, bring ignite to wreck his already bad early game, or bring Flash and just flash away every time he tries to actually fight since he has no way to keep up with you. \n\n3. Build any of these items first. {{item:3153}} {{item:3151}} {{item:3211}} {{item:3155}}  or of course {{item:3165}}. I would bet money that at least half if not most of the people complaining about Vlad are the ones that build absolutely nothing to counter him. Are you a tank? Build {{item:3211}} first item and all your troubles are gone! Are you an AD champion? Good news! You've got multiple options with {{item:3155}}  and {{item:3153}}! A mage top? Awesome! You can either build {{item:3151}} or {{item:3165}} or both for maximum Vlad fucking! \n\n4. Play aggressive. The healing might be intimidating, but I assure you, it starts out on an extremely long cooldown. 10 seconds. That's 10 seconds you could be dealing damage while he can't. I'm sure you can do more than the 15-70 health his Q heals for early game. So be aggressive early on and see my next tip for why this doesn't always work for you.\n\n5. BUT MAOKAI, I LISTENED TO YOUR ADVICE AND WAS AGGRESSIVE AND IT WORKED FOR A LITTLE WHILE BUT THEN HE CAME BACK AND WRECKED ME BECAUSE I COULDN'T DIVE HIM THIS TIME! Well children, that's because of tip number 5: Learn when you have to stop being aggressive. If you're like me, when you're ahead, you feel like nothing will stop you no matter how stupid you play. That shit doesn't fly against Vlad. He's got two peaks, level 9 and level 18 when he's full build. The one we're gonna talk about is level 9. This is when his Q is on its lowest CD, he should have his vamp item and maybe even his spirit visage by now, and this is his time to shine. But you're all hyped up because you went aggressive early on, you're 3/0 he's 0/3 and you guys even got a dragon all thanks to your ability to use teleport while he was unable. Things are going great! Let's keep it goi- oh no. Vlad just killed me. Wtf so broken I only tried to all in him while he was full health under his tower while building nothing to counter him! Wtf is this champion so dumb, I hate Vlad nerf pls. \n\nThis is basically half the people that play against Vlad. The other half don't go aggressive early on and just get tower dove because they let Vlad poke them down with no retaliation. You, the readers of this post, need to break the mold. Go aggressive early on, then when it gets to mid game and that Vlad has a couple items under his belt, do not try to fight him. Use your brains, draw him into fights he can't win, bait him, Hell, if you're playing any of those champions I mentioned and build any of the items I mentioned, you probably can beat him at his power spike, if that's the case, feel free to keep going as aggressive as you want. Just know your limit. Know when he can win the fight and know when you can't (and run using the mobility God gave you and took away from Vlad). \n\nSix. I believe this will be the final piece of advice I give you guys. Teamfighting against Vlad. Vlad may not bring CC, but he does bring quite a bit of damage, and the ability to stall off dying like no other. So, that being said there are a few ways to beat him in teamfights, the place where he excels. 1. Don't bunch up. If he can only get 1 or 2 of you with his ult, that significantly increases the chances of you winning the fight. If he gets all of you then you should see the next sentence of this paragraph. 2. If his ult hits a bunch of you, DISENGAGE, I REPEAT DISENGAGE. (I can't help but think of that one scene from The Incredibles when I say that, good times) Anyways, if a lot of you get hit with the ult, let's say 3 or more, just leave the fight. I don't know about the rest of Vlad's team, but Vlad sure as hell isn't going to catch up to you guys. Add Janna and Nami to the list of champions that beat Vlad just because of their ability to choose when fights happen. 3. Slap an ignite on Vlad (or if you built Morellos you don't even have to do that) and focus the hell out of him. Without his healing he dies pretty damn fast. 4. Backdoor, no one on their team has teleport. 5. Ward up and catch the enemy team while they're missing a champ, or catch that missing champ. \n\nThat's it folks, that's how you deal with Vlad. Very complicated I know, but it all starts with you picking just one of the like 30 champs that beat him in lane, and building the right items.","replies":[{"poster":"EffectFX","date":"2015-05-18T10:20:29.083+0000","up_votes":2,"down_votes":0,"body":"You picked several champions that a competent **(and by incompetent I mean putting themselves into a position where they take poke/trades they can't heal back/Building pure glass cannon and expecting to survive some negative matchups)** vlad shouldn't have any problem dealing with or that are purely 50/50.","replies":[]}]},{"poster":"Keyoshi","date":"2015-05-18T04:19:30.749+0000","up_votes":2,"down_votes":0,"body":"we NEED point and click abilities, You know how much harder it would be to kill adcs in this game? I think its fair for vlad to have the point and click thing because he brings 0 cc to the table.","replies":[]},{"poster":"Creamy Seaman","date":"2015-05-17T19:13:07.290+0000","up_votes":1,"down_votes":0,"body":"{{champion:1}}","replies":[{"poster":"IcyPepper","date":"2015-05-18T03:40:01.196+0000","up_votes":2,"down_votes":0,"body":"Her range tho.\n\nEven Zed outranges her, and he's supposedly melee.","replies":[]}]},{"poster":"IcyPepper","date":"2015-05-18T03:39:20.080+0000","up_votes":2,"down_votes":0,"body":"*insert every adc ever*\n\ndem autoattacks","replies":[]},{"poster":"Dr Poro","date":"2015-05-17T20:17:20.765+0000","up_votes":2,"down_votes":0,"body":"A Rioter said a while ago that releasing Vlad was their biggest mistake (in his opinion). A champion that is based on tapping life is hard to balance, so they've been keeping him down a bit until he gets reworked. The most likely solution will be making his Q a skillshot, I guess. They've done it with Zilean, Ryze, Veigar, Sion, Soraka, ...\n\nBut maybe they're looking for a way to add more counterplay in a fun way that's not based on dodging. Because I think Riot doesn't want to make every champ skillshot based. While skillshots are a healthy mechanic that inherently allow for counterplay, it shouldn't be the only mechanic in the game.","replies":[]},{"poster":"TheRainInSpain","date":"2015-05-17T20:05:20.022+0000","up_votes":2,"down_votes":0,"body":"All auto attacks are now skill shots.","replies":[]},{"poster":"Silents429","date":"2015-05-17T17:20:25.567+0000","up_votes":2,"down_votes":0,"body":"Okay what the hell a few months ago I was complaining about how BS Vlad top is with infinite sustain, no mana, escapes etc. And I got downvoted and told all about his \"counterplay\" and while I got Swain to defeat him and ended up kicking his face in, this champion is still a pain in the ass.\n\nThere is NO justification for anything about him.","replies":[]},{"poster":"Burnt Light","date":"2015-05-17T03:34:28.515+0000","up_votes":2,"down_votes":0,"body":"{{champion:44}}","replies":[]},{"poster":"Deep Terror Nami","date":"2015-05-17T00:56:19.339+0000","up_votes":7,"down_votes":5,"body":"A huge number of champions have at least 1 point-and-click ability. This is a pointless argument especially when their decision to rework a champion isn't that simple.","replies":[]},{"poster":"Rikari","date":"2015-05-17T02:41:17.814+0000","up_votes":4,"down_votes":5,"body":"Don't you mean {{champion:1}} {{champion:84}} {{champion:114}} {{champion:69}} {{champion:105}} {{champion:7}} {{champion:90}} {{champion:57}} {{champion:25}} {{champion:111}} {{champion:56}} {{champion:6}} {{champion:45}} {{champion:254}} {{champion:19}} {{champion:83}}","replies":[{"poster":"AbsoluteSadman","date":"2015-05-17T04:06:04.271+0000","up_votes":3,"down_votes":0,"body":"nocturne? really? the rest i can sorta maybe understnad if you gave me enough time but nocturne?","replies":[]}]}]}