{"poster":"FOV120","date":"2016-11-08T21:52:32.317+0000","title":"Consejos y Tips Básicos para Mejorar :)","subforum":"Guias y consejos","up_votes":2,"down_votes":0,"body":"Hola Gente!\r\n\r\nDurante los &uacute;ltimos meses/semanas de temporada 2016, vi mucha gente que busca ayuda para mejorar en lol. S&eacute; que a m&iacute; me falta mucho por mejorar, pero si puedo ayudar con algunos tips que me fueron muy &uacute;tiles. Hay 3 aspectos importantes en los que me enfoqu&eacute; &eacute;sta temporada:\r\n\r\n**Fuerza Mental**\r\n1. Peace of Mind: Si est&aacute;s enojado o tilteado o frustrado mejor no rankear, simplemente porque no se toman decisiones correctas. No tradeas adecuadamente en lane, o no te enfocas en objetivos.\r\n2. Autocontrol: No flamear, no bardear, no hacer cr&iacute;ticas que no sirvan a ganar la partida. Muchas veces he visto como a compa&ntilde;eros los flamean y se van afk, o trolean o simplemente se ponen tan nerviosos que cometen m&aacute;s errores. Tener una mala actitud no har&aacute; que tu equipo juegue mejor, de hecho contribuyes a la p&eacute;rdida de la partida. Tal vez me extiendo mucho aqu&iacute;, pero es importante, porque he visto a jugadores que juegan muy bien, pero que por esa actitud terminan botando partidas a la basura. Esto no ayuda al trabajo en equipo, y una partida se gana de a 5.\r\n3. Autocr&iacute;tica: Comprender cu&aacute;les son tus errores y ensayar para no volver a cometerlos, ya sea en el farmeo o posicionamiento o focus. Tienes que tener la capacidad de aprender con cada partida. Si encuentras que hiciste todo bien&hellip; cuesti&oacute;nate a&uacute;n m&aacute;s, o s&eacute; m&aacute;s autocr&iacute;tico contigo&hellip; siempre se puede mejorar.\r\n4. Autoaprendizaje: Siempre es importante estar al tanto del patch en el que se juega, mira videos en youtube, prueba builds de proguides o mobafire u otra p&aacute;gina informativa. A medida que vayas estudiando, m&aacute;s conocimiento del juego obtendr&aacute;s&hellip; sonar&aacute; geeky pero &ldquo;con m&aacute;s informaci&oacute;n, tomas decisiones m&aacute;s informadas&rdquo; &ndash; esto aplica directamente en el tradeo o combos o builds, tanto tuyos como de los oponentes.\r\n5. Comunicaci&oacute;n: Si necesitan algo de tu equipo o si quieres ofrecer ayuda a tu equipo, puedes hacerlo. Pero hay que tener la precauci&oacute;n de hacerlo de una manera clara y efectiva&hellip; idealmente sin agresiones verbales xD. Ejemplos:\r\n* Pings de alerta para avisar que inicias o backeas.\r\n* Pings para avisar que viste al jungla enemigo cerca de alg&uacute;n lane.\r\n* Pings de MIA\r\n* Informar al jungla cuando t&uacute; o tu oponente queman alg&uacute;n summoner spell.\r\n* Pedir preparar alg&uacute;n objetivo &ldquo;Dragon en 50, compro y voy&rdquo;\r\n\r\n**Mec&aacute;nicas de Campeones**\r\n1. Champion pool: Por cada rol que juegues por lo menos ten 2 campeones que manejes a la perfecci&oacute;n. Es decir, que manejes sus habilidades y cooldowns, combos,  da&ntilde;o que hace con o sin &iacute;tems, con o sin buffs, rangos, y por &uacute;ltimo y m&aacute;s importante saber c&oacute;mo tradear da&ntilde;o con tu oponente.\r\n2. Buildeo: Un campe&oacute;n se puede buildear de muchas maneras, algunas efectivas y otras no. Tienes que tener claro qu&eacute; &iacute;tems maximizan a tu campe&oacute;n, pero sobre todo saber que partida a partida la itemizaci&oacute;n cambia. Si hay mucho tanque, penetraci&oacute;n. Si hay mucho ap, mr. Si hay mucho cc, cimitarra o mikeal. Si hay muchos pokeo, tanquearse. Si mueres muy r&aacute;pido, &aacute;ngel. Si hay mucha curaci&oacute;n, morello o recordatorio mortal. Etc etc tec\r\n3. Vocabulario: Hay conceptos que entender antes de elegir un campe&oacute;n, porque necesitas comprender sus fuerzas y sus debilidades. Campeones de burst, assessins, attack speed, casters, bruisers, tanks. Esto te ayuda a entender t&uacute; estilo de juego&hellip; ejemplo, si te cuesta hacer da&ntilde;o desde atr&aacute;s, usa bruisers o tanks para estar en la frontline. O si estas m&aacute;s c&oacute;modo fuera de las tf, una asesinos y busca oportunidades. Dejo un link con un extenso y claro vocabulario: http://es.leagueoflegends.wikia.com/wiki/Terminolog%C3%ADa_de_League_of_Legends\r\n4. Elecci&oacute;n de campeones: Personalmente esto es m&aacute;s sencillo, eres bueno en las skillshot o no? Si estas empezando te recomiendo usar campeones f&aacute;ciles, sin skillshots&hellip; Hay algunos bien rotos que hacen mucho da&ntilde;o (annie, riven, sona). Y una vez que hayas practicado y te sientas preparado, comienza a usar campeones con skillshots en ranked. Personalmente prefiero los champs que no requieren skillshot porque me cuesta xD pero hay gente que se les d&aacute;. Yo no puedo poner ni un gancho de blitz ni de thresh jaja por eso me quedo con leona.\r\n5. Meta: Es bueno estar al tanto de lo que se considera meta o no. Meta es el campe&oacute;n que esta buffeado en el parche actual, es decir, que tiene buen porcentaje de winrate. Siempre es recomendable conocerlos para saber si usarlos o banearlos en las ranked. Por otro lado, hay campeones no meta que tambi&eacute;n funcionan, incluso tienen buenos resultados por el factor sorpresa, por ejemplo no muchos saben c&oacute;mo contrarrestar un velkoz en bot. Personalmente no lo recomiendo en low elo, simplemente porque se olvidan que tienen un rol definido. Por ejemplo, el mismo velkoz support no comprar&aacute; muchos wards y farmeara quit&aacute;ndole experiencia a los carrys. Hay muchos factores a considerar, por eso sugiero terminar de leer estos consejos y que cada uno tome las decisiones que quiera.\r\n\r\n**Entendimiento del juego**\r\n1. Objetivos: El juego se gana logrando objetivos, inhibidores y torres. Eso debiera ser la prioridad para romper. Para ayudar a romper los ini y las torres, est&aacute;n los dragones o barones, por lo que tambi&eacute;n son objetivos importantes. Recorrer una kill por medio mapa, no es un objetivo, eso es retrasar el avance a tu victoria. Si puedes matar, dale, pero no mientras interfiera con un objetivo&hellip; la idea es ganar no?\r\n2. Oro: Para ganar los objetivos, generalmente tendr&aacute;s que ganar tf (teamfights), y casi siempre el que gana las tf son los que tienen m&aacute;s oro, porque son los que tienen mejores &iacute;tems y por lo mismo hacen m&aacute;s da&ntilde;o. Para obtener el oro b&aacute;sicamente farmea lo mejor que puedas (m&iacute;nimo 75 minions al minuto 10), si no logras farmear el m&iacute;nimo, mejor no rankees hasta que lo mejores. Las Kills obviamente dan oro, siempre trata de matar al invocador enemigo que cueste m&aacute;s oro. Aqu&iacute; es importante saber qui&eacute;n se debe llevar la kill, de preferencia siempre trata de dej&aacute;rselo a los carrys de tu team. La primera sangre de torre, y primera sangre en kill dan 400 oro cada una, lo cual cuenta en early. Los objetivos - los torres y barones dan oro, y aunque los dragones no lo dan expl&iacute;citamente, facilitan su obtenci&oacute;n. Y por &uacute;ltimo pero muy importante niega oro a los enemigos, evitar que el equipo enemigo obtenga m&aacute;s oro que el tuyo, ya sea protegiendo a aquellos jugadores con &ldquo;killing spree&rdquo;, o simplemente negando farm.\r\n3. Composiciones: En la selecci&oacute;n de campeones idealmente trata de ponerte de acuerdo con tus compa&ntilde;eros qu&eacute; composici&oacute;n usar&hellip; en low elo no se da mucho esta instancia&hellip; pero no por eso no se debe tratar. Las m&aacute;s comunes son AoE (combo wombo), splitpush, protege al adc&hellip; Es un tema m&aacute;s extenso, por eso dejo este link para aquellos que quieran averiguar m&aacute;s: http://www.taringa.net/post/juegos-online/18441348/Composiciones-de-equipos-League-of-Legends-LOL.html\r\n4. Wardeo: La visi&oacute;n gana partidas, siempre que puedas compra pinks. El support siempre debe comprar el &iacute;tem de wards (piedra de visi&oacute;n). Y POR FAVOR actualicen sus baratijas, idealmente el jg y supp deben llevar la baratija para sacar wards, el top mantienen la baratija de wards y el adc  y el mid lleva la orbe. M&aacute;s importante que todo esto, traten de negar visi&oacute;n cada vez que puedan, revisen los bush por pinks enemigos y estar atentos donde wardearon para evitar cruzar esos puntos.\r\n5. Conocer al team enemigo: Basado en los puntos anteriores, puedes identificar c&oacute;mo el team enemigo va a pelear, seg&uacute;n tu rol puedes evitar o romper su tf. Si ves que te inician, trata de retroceder o no pelear&hellip; hasta que tu equipo tenga lo necesario para pelear bajo sus t&eacute;rminos y condiciones, no las condiciones del enemigo. En otras palabras, adelanta el juego de tus enemigos.\r\n6. Conciencia del mapa: Siempre tienes que estar viendo el mapa, cada 2 segundos xD Debes tratar de mantener en visto d&oacute;nde est&aacute; el jg enemigo, o ver cuando alg&uacute;n enemigo no est&eacute; en su lane&hellip;. Si esto pasa, s&eacute; precavido y retrocede, no esperes el MIA de nadie, de hecho t&uacute; has el aviso si nadie lo ha hecho.\r\n7. Ayuda del Jungla: En este punto quiero darles un respiro a los jungla, creo que siempre son los m&aacute;s flameados xD Hay que dejar que ellos hagan su trabajo, si no te gankean es por algo. Ellos tienen ruta y objetivos que tomar, esto incluye privar de visi&oacute;n e incluso negar campamentos a los junglas enemigos. Por otro lado, si vas mal y el jungla no te ayuda, tiene raz&oacute;n, generalmente hay que ayudar a las lanes que a&uacute;n se pueden reponer, y hay que aceptar que hay veces en donde ya perdiste el lane y s&oacute;lo debes tratar de aguantar y no morir. Por &uacute;ltimo, si tienes al otro jungla campeando tu lane, aguanta y avisa&hellip; no para pedir ayuda, sino para que el otro jungla aproveche de ir a otro lane que est&eacute; pusheado, o dragon o robar campamentos. Recordar que el gank es s&oacute;lo una herramienta para sacar ventaja, pero el juego se gana haciendo objetivos. A trav&eacute;s de la visi&oacute;n se pueden evitar gankeos, y se debe saber cu&aacute;ndo entregar la torre o defenderla.\r\n8. Partidas Largas: Esta parte me encanta. Hay partidas tan largas, en donde ya todos est&aacute;n full build, y el que gana la partida es el que aproveche un error del otro team. Es importante no andar solo en este punto, todos tomados de las manos van a pushear, van a hacer drake o van a invadir. Aqu&iacute; se empiezan a vender los zz rot, y los &aacute;ngeles usados, para comprar da&ntilde;o, y cuando pase el cooldown se vuelven a comprar.\r\n9. Entender tu Rol: El rol que uno desarrolla durante la partida depende del campe&oacute;n o la composici&oacute;n a usar. Si eres el da&ntilde;o, mantente atr&aacute;s y hace la mayor cantidad de da&ntilde;o de manera segura. Si eres tanque o bruiser, eres el encargado del engage y disangage, no esperes que el mid comience a pelear. Si eres asesino, mantente fuera de las tf hasta que veas que han utilizado todo el cc y sea seguro entrar. Si eres de utilidad, aseg&uacute;rate de estar cerca de los carrys para dar vida/escudos necesarios. En una composici&oacute;n donde se requiere tanque, aunque sea aburrido, no te hagas da&ntilde;o, tu equipo ya lo tiene. Hay que confiar en el criterio de cada uno al momento de pelear, siempre y cuando se tenga claro el rol que uno cumple. Desde mi punto de vista, es lo m&aacute;s dif&iacute;cil de comprender para la mayor&iacute;a de jugadores.\r\n\r\nHay muchas cosas que dej&eacute; fuera, porque simplemente esto se estaba alargando m&aacute;s de lo planeado, pero dejo conceptos para que averig&uuml;e al que le interese:\r\n* Picks y builds mas usadas en LAS: http://las.op.gg/champion/statistics\r\n* Otros temas: Pushear o congelar l&iacute;nea - C&oacute;mo tradear adecuadamente &ndash; Countering -  tele transportaci&oacute;n efectiva &ndash; dodging skill shots &ndash; autoattacking disabling &ndash; smartcast - kitteo.\r\n\r\nTrat&eacute; de escribir esto de manera simple y detallada. Espero que a alguien le sirva y si tienen cualquier duda siempre esta google xD \r\n\r\nSaludos!!","replies":[{"poster":"WesterKest","date":"2016-11-08T22:55:57.220+0000","up_votes":1,"down_votes":0,"body":"Gracias por tu aporte, lo voy a tener en cuenta c:","replies":[]},{"poster":"faster51","date":"2016-11-08T21:55:56.526+0000","up_votes":1,"down_votes":0,"body":"este post es mas largo que la biblia y los contratos argentinos!! O.O","replies":[]}]}