{"poster":"NRG","date":"2015-05-20T13:52:19.864+0000","title":"Riot you opened up a can of worms","subforum":"Esports","up_votes":5,"down_votes":1,"body":"Recently Riot released news about the new switches in the pro scene and I was stunned to see a player &quot;Incarnation&quot; somehow become unbanned? It is said Riot monitored this player for 6 months concluding he was fit for play. \r\n\r\nSo my question is, don&#039;t all the banned players deserve this? Or do you simply make exceptions to top players only?","replies":[{"poster":"Vixanys","date":"2015-05-21T13:17:11.873+0000","up_votes":2,"down_votes":0,"body":"I'll just leave this here from one of the other \"OMG Incarnati0n\" posts:\n\n>Why is this such a hard thing to understand, he was contacted by Riot (after they updated their banning policies) and told he gets \"Parole\". By which they would aggressively monitor his play. He passed this period and was allowed back to play League of Legends once again.\n>\n>http://na.lolesports.com/articles/competitive-policy-revision-permabanned-players\n>\n>In addition, there was never any evidence of DDoS in his games. It was an unsubstantiated claim. Without proof, you are inherently innocent until proven guilty.\n>\n>He has apparently changed and for that we can enjoy his mechanical plays.","replies":[{"poster":"TheGrandAlliance","date":"2015-05-21T22:09:02.720+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Vixanys,realm=NA,application-id=9hBQwnEU,discussion-id=rlNZ6jjc,comment-id=0004,timestamp=2015-05-21T13:17:11.873+0000)\n>\n>In addition, there was never any evidence of DDoS in his games. It was an unsubstantiated claim. Without proof, you are inherently innocent until proven guilty.\n\nThis is not true... player lag CAN be observed and reported.  Simply because RIOT denied that the source of the lag was DDOS vs \"normal internet latency\" is a judgment and denial by RIOT and not evidence.  Also you fail to mention that he *admitted to doing it*.\n\nFurthermore his other actions such as language is not contested.  Indeed there is no reason this player should be allowed anywhere near LCS indeed.","replies":[{"poster":"Vixanys","date":"2015-05-22T12:47:47.497+0000","up_votes":1,"down_votes":1,"body":"My god, why perpetuate this discussion on this specific forum, I have spent hours on the other one (you know the one with like 15x the upvotes and have passed this discussion by.\n\nhttp://www.dailydot.com/esports/riot-games-incarnation-lcs/","replies":[]}]}]},{"poster":"Ada Wong","date":"2015-05-20T19:24:34.114+0000","up_votes":2,"down_votes":1,"body":"Banning players from online games is joke you just make a new account and come back, my IP, Hardware change everyday.\n\nHowever with that said Riot should allow toxic players to come back if they have truly been gone for a year or longer off League OF Legends would be fine, (However) if they come back and they start being (Toxic Again) Riot would manually Audit the accounts after so many games played and the players would just be (banned again) for another year.\n\n Think of it as Probation, if they mess up and Riot sees it Banned again another year, however if the truly reformed then allow them to actually stay. \n\nRiot should also make penalty much harder, as well as Role Selection Option for ranked matches, and help reduce the over-all toxicity. (Get rid of the automated system) and lay down (Specific Set OF Rules) instead of letting the community define toxic because to me toxic could be defined as talking about your household pet in a game to a friend.\n\n**I can tell you if Riot didn't have an (Automated System) or a (Tribunal) Players would actually be less toxic because.**\n\n. Players wouldn't spam threats to report each-other as much\n. Role selection allows players to get what they want and less toxicity\n. Role Selection allows players to open communication more when there are only two bot lane players who selected the roles its easier to talk to one another.\n\nRole selection in champion select is one of the big issues right now from personal game-play because players don't take champion select seriously (Some do) But a lot of matches they just don't care and games go badly then harassment will start.","replies":[]},{"poster":"TheGrandAlliance","date":"2015-05-21T22:28:52.116+0000","up_votes":1,"down_votes":0,"body":"BTW in terms of this threads OP statement... indeed when Riot allows for \"Toxic Players\" to play in LCS... what is to discourage attempts to remedy these behaviors in SOloQ?.  Riot basically has made a case that Toxic Players==Rewarded and Nontoxic==NOOB therefore.","replies":[]},{"poster":"PoisonedTea","date":"2015-05-20T19:50:45.110+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nrg,realm=NA,application-id=9hBQwnEU,discussion-id=rlNZ6jjc,comment-id=,timestamp=2015-05-20T13:52:19.864+0000)\n>\n> Recently Riot released news about the new switches in the pro scene and I was stunned to see a player &quot;Incarnation&quot; somehow become unbanned? It is said Riot monitored this player for 6 months concluding he was fit for play. \n> \n> So my question is, don&#039;t all the banned players deserve this? Or do you simply make exceptions to top players only?\n\nHe is not the first banned player to be allowed to play pro. Also his accounts are still banned and will be.\n\nRiot has done this before it is not really a big deal.","replies":[]},{"poster":"Stillname","date":"2015-05-20T19:33:43.564+0000","up_votes":1,"down_votes":0,"body":"His accounts that were banned are still banned they just unbanned him from play in the LCS","replies":[]},{"poster":"Vixanys","date":"2015-05-20T19:20:24.648+0000","up_votes":2,"down_votes":2,"body":"There are like 15 posts about this. Why did you feel you needed to make another one?","replies":[]}]}