{"poster":"Unknown Helper","date":"2016-11-23T06:15:54.581+0000","title":"Supports, hasta donde estan dispuestos a llegar?","subforum":"Guias y consejos","up_votes":8,"down_votes":1,"body":"Buenas comunidad, estoy haciendo este post como una propia para poder ayudar a los que estan incursionando dentro de este rol tan maravilloso como lo es el de support. \n\nInicialmente, uno entra en un juego del tipo MOBA (como es el caso de este) y ve que se divide dentro de varios roles, esta el que mata sin piedad a cualquiera {{champion:202}} , el que aguanta a mas no poder {{champion:78}} , el que de dos habilidades te deja la vida en 0 {{champion:7}} , el que cuando miras un segundo el mapa lo ves dando vueltas por ahi y no entendes que le pasa {{champion:64}} (probablemente porque es ciego y no ve los campamentos), y despues esta el que se encarga de dar todo por su equipo, sacrificandose si fuese necesario para salvar a un aliado, el que prioriza los centinelas antes que sus propios items (por lo menos asi era en la season 2 D:), si, me refiero al support {{champion:412}} (que buena comp arme con esos picks).\nBien, pero que signifca ser support? Ok, la respuesta no es facil. Porque ultimamente veo que todos dicen, &quot;si se supportear&quot;, &quot;si es un rol facil&quot;. Nop, lamento decirles que no. Desde mi punto de vista, la lista de dificultad por rol seria algo asi\n\n1. ADC.  Considero que es el rol mas importante ya que si bien en el juego temprano un adc no tiene mucho impacto, llegado el juego tardio o medio, si el jugador tiene experiencia en el rol, puede aprovechar las oportunidades que su equipo genere para explotar los errores enemigos.\n2. Jungla. Debido a que su manera de movilizar las lineas y generar cambios en los patrones del equipo contrario tiene un gran impacto en lo que seria late game (juego tardio). \n3. Support. Sin ustedes el adc estaria desnudo. Una vez me dijeron: &quot;A tu adc tenes que verlo como un Pokemon, al principio necesita que lo lleves a farmear, lo entrenes, lo hagas subir de nivel, y cuando llegue el momento, el te lo va a compensar carreandote el match&quot; Y es totalmente cierto. Sin ustedes el no puede hacer NADA. Y su equipo depende muchisimo tambien, ya que sin vision o sin items que los ayuden (llamese solari, knights vow, mikael, etc) sus chances de ganar son demasiado bajas.\n4. Mid. Tiene una gran importancia dentro del juego, ya que sin este, el rival podria convertirse en un segundo jungla, rotando para todos lados (aunque generalmente pasa cuando nuestro mid no pushea o se impone en linea). O bien el podria ser el que rote y ayudar.\n5.  Top. Si bien el top es importante, hasta el minuto 14 o 15, es raro que en low elo (me refiero a platino, eso consiero low elo) un toplaner tenga impacto en el juego. Pero mas adelante bien podria convertirse en un poke entrenador (?, por ejemplo un shen, quien es muy bueno a la hora de hacer peel, o mismo un maokai.\n\nContinuando. \nEntonces, que me gustaria enseniarte (no tengo enie en este teclado y NO, no pienso cambiar las configuraciones regionales a latino por un post)?. Bueno, me gustaria darte con los consejos basicos y si estas mas interesado podes agregarme in game o responder a este post que lo sigo con todo gusto ^^.\nPrimero y principal. \nTu mentalidad: http://cdn.memegenerator.es/imagenes/memes/full/24/66/24669970.jpg\nEsa debe ser. Tu vida no vale tanto como la de algun otro miembro del equipo. Si luego de usar todas tus habilidades e items, ves que alguien no podria salvarse y sabes que si vos dieras tu vida dejarian de seguirlo. HACELO. Aunque no te diga gracias lo va a apreciar (o eso elijo creer).\nNota: No aplica para alguien que se haya ido a suicidar o se haya mandado MUUUUUUY mal, en ese caso es mejor no morir ya que podria generar que a tu equipo le tiren toda la base.\n\nSegundo.\nTus items.\nhttp://cdn.memegenerator.es/imagenes/memes/full/24/66/24669982.jpg\nSi, es tonto decirlo pero es importante.\nDependiendo de que configuracion de maestrias utilices dependeran tus item.\nSi usas la maestria esa que aumenta la cura y escudos (windspeakers blessing creo que es no me acuerdo el nombre), deberias aprovechar estos item:\n1. {{item:3222}} \n2.  Knights vow (no esta el iconito todavia en el foro, riot pls staph trolling me)\n3.  {{item:3050}} \n4. {{item:3190}} \n\nCabe aclarar que son situacionales y depende pura y exclusivamente del juego.\nCuando usar el mikael? Cuando tengas en contra una composicion con un control de masas (el buen cc, nada le gana)\nCuando usar el knights? Cuando tengas un personaje como por ejemplo karma que se basa en escudos, un item como este combinado con un mikael generaria que su adc tenga muy pocas probabilidades de morir.\nCuando usar el zeke? Cuando tengas un adc que dependa del critico y los escudos de tu personaje escalen en ap, denuevo karma por ejemplo, o incluso un thresh, que si bien no se basa en el escudo, la reduccion de enfriamiento le beneficia, pero esto es para mas adelante.\nCuando usar el solari? Mi respuesta antes del cambio habria sido, SIEMPRE. Pero actualmente, conviene usarlo mas con personajes tank o que requieran serlo como por ejemplo una soraka. Si, el personaje es cuadrado, pero vamos... No han visto nunca una soraka tank  que nadie la baja? Ok, eso se debe a sus resistencias (y bueno si, un poco a las manos tambien).\n\nTercero. \nMaestrias (esto quizas debio ir antes pero ya fue)\nhttp://cdn.memegenerator.es/imagenes/memes/full/24/67/24670033.jpg\n\nLas maestrias dependeran del personaje que uses y de tu modo de juego.\nPor ejemplo, si nos encontramos usando {{champion:48}} , y tenemos un estilo de juego agresivo. La mejor maestria seria la que se utiliza en top con el mismo personaje (esa que roba vida cada 3 golpes como se llamaba? Undying will? Creo que si) O lo mismo con un {{champion:223}}\n* Si tu estilo de juego es mas conservador, seguramente utilices {{champion:12}} o {{champion:44}}. Con ambos, yo recomiendo usar la maestria Bond of Stone (algo asi era) que te permite hacer que tus aliados aguanten un poquitito mas.\n* Si tu estilo de juego es el de curandero o dar escudos, la mejor maestria es sin dudas el windspeakers blessing, por ejemplo con {{champion:40}} o {{champion:267}} o incluso {{champion:43}} , ya que eso aumentaria tus habilidades\n* Si tenes un estilo de juego entre agresivo y conservador, un miti miti por asi llamarlo. Recomiendo usar thunderlords decree. Se aplica muy bien con personajes como {{champion:412}} o {{champion:43}} (si, tambien ella entra en esta seccion). Ya que al momento de realizar un intercambio o pokear (molestar, romper la paciencia, como quieran llamarlo) es muy util para sacar una pequenia ventaja.\n\nCuarto y finalizando por ahora el post hasta que alguien me de un like (?\nLo basico. Que comprar al momento del juego temprano.\nBien, mi recomendacion es que evalues como esta tu ingreso de oro, es decir. Supongamos esta situacion:\nYo soy un thresh que va caminando por ahi (usando la moneda, con thresh NO SE USA la reliquia NO!) y veo que mi botlane esta tranquila, jugandose al farm, no tengo posibilidades de roamear (eso lo explicare mas adelante). Que me conviene mas? Y... si noto que el jungla esta ensaniado con gankear top y a nosotros no nos molesta, primero iria a mejorar la moneda, ya que seria un ingreso mas alto de oro que podria darme una ventaja en el juego medio. Si fuese el caso contrario, SIGHTSTONE (piedra vidente), sin lugar a dudas.  **_LAS WARD GANAN MATCH_**. \nSiempre intenten buscar lo mejor para su equipo, un support que sabe entender el juego y que necesita su equipo tiene un gran impacto y puede carrear un match.\n\nPor ahora es eso, se que la guia es larga pero espero que ayude a aquellos que se esten aventurando dentro de este hermoso rol.\n\nSaludos ^^ {{sticker:slayer-jinx-catface}}\n\nPD: http://cdn.memegenerator.es/imagenes/memes/full/24/67/24670085.jpg","replies":[{"poster":"Lucrexio","date":"2016-11-23T07:12:28.896+0000","up_votes":3,"down_votes":1,"body":"Un consejo más, frecuenta picks de daño por si el adc del equipo es una porqueria inutil, {{champion:143}} me ahorró varios dolores de cabeza que no podría haber carreado con {{champion:201}} o {{champion:16}}, si el equipo no hace daño y usas este tipo de campeones de puro tank o utilidad estas en el horno.","replies":[{"poster":"Unknown Helper","date":"2016-11-23T14:31:59.102+0000","up_votes":3,"down_votes":0,"body":"No realmente, he visto muchos braum o thresh carreando match, sin necesidad de ser pura y exclusivamente dmg, pero es una opinion y la respeto como tal.","replies":[]}]},{"poster":"BUSCANDO A JORGE","date":"2016-11-23T07:12:51.569+0000","up_votes":2,"down_votes":1,"body":"A la verga, se supone que lea esto?\n\nPD: Solo vi las fotitos.","replies":[{"poster":"Unknown Helper","date":"2016-11-23T14:31:17.742+0000","up_votes":3,"down_votes":0,"body":"Depende. Encontraste a jorge?","replies":[]}]},{"poster":"Nombre ofensivo","date":"2016-11-23T12:27:26.479+0000","up_votes":3,"down_votes":0,"body":"Un verdadero supp no necesita ver este post para motivarse\n\nhttps://www.youtube.com/watch?v=6vkkzcN2x9Q","replies":[{"poster":"Unknown Helper","date":"2016-11-23T14:28:25.370+0000","up_votes":1,"down_votes":0,"body":"Toma mi like","replies":[]}]},{"poster":"Lucio22","date":"2016-11-23T08:11:28.055+0000","up_votes":3,"down_votes":0,"body":"aca te dejo una comparacion que suelo hacer (es la segunda vez que la copio, cada dia estoy mas vago jajajaja)\n- Los adc, apc y asesinos son como los actores principales de una obra de teatro, se llevan la atención de todos (y más de uno es una diva infernal).\nLos tanks son los actores secundarios, le dan más contexto y sentido a la obra, pero sin que se lleven las palmas de nadie.\n- Los jg serian los directores y/o escritores de la obra, pocas veces se los reconoce por algo salvo que sean o muuuuy buenos o muuuuy malos, pese a que tengan un papel tan importante.\n- Los supp son los de iluminación, sonido y/o efectos especiales, NADIE se da cuenta de la importancia de los mismos hasta que ven a uno que realmente la caga. Sin embargo, sin ellos, la obra empieza a desbaratarse ya que la esencia de los actores principales se pierde para el público.\n---\n\npor otro lado, discrepo en \n- lo de los items, ya que no soy de usar ninguno de esos items y tengo preferencia por otros (actualmente de forma teorica, ya que hace mucho que no juego normals) como el rendention para aumentar curas y escudos (si tenes alguien que se base mucho en vel de ataque, te creo que uses el pebetero)\n- en cuanto al item de sup (el que da guita), suelo elegir la moneda por el tema que el shurelya y la regeneracion que da cada vez que matan a un minion cerca (incluso la elegia cuando iba con leo, porque es gritarle al adc contrario \"swiggity swooty, i'm coming for that booty\")\n\nsacando eso, no creo que discrepe mucho, la concidero una buena guia para los que inician siendo sup\nlo que si, pro tip, hay que elegir a leo, con el cc es un \"o me focusean o se quedan quietos\" casi constante jaja","replies":[{"poster":"Muñekko","date":"2016-11-23T15:38:54.279+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lucio22,realm=LAS,application-id=8sKIclmi,discussion-id=FQiVfpde,comment-id=0005,timestamp=2016-11-23T08:11:28.055+0000)\n>\n> - Los adc, apc y asesinos son como los actores principales de una obra de teatro, se llevan la atención de todos (y más de uno es una diva infernal).\n> Los tanks son los actores secundarios, le dan más contexto y sentido a la obra, pero sin que se lleven las palmas de nadie.\n> - Los jg serian los directores y/o escritores de la obra, pocas veces se los reconoce por algo salvo que sean o muuuuy buenos o muuuuy malos, pese a que tengan un papel tan importante.\n> - Los supp son los de iluminación, sonido y/o efectos especiales, NADIE se da cuenta de la importancia de los mismos hasta que ven a uno que realmente la caga. Sin embargo, sin ellos, la obra empieza a desbaratarse ya que la esencia de los actores principales se pierde para el público.\n\n\n\nExcelente\n{{sticker:zombie-brand-clap}}","replies":[]},{"poster":"Unknown Helper","date":"2016-11-23T14:29:32.278+0000","up_votes":1,"down_votes":0,"body":"Me gusto mucho tu comparacion, es bastante cierta de hecho. No se me habia ocurrido esa idea, muy buena {{sticker:zombie-brand-clap}}","replies":[{"poster":"Lucio22","date":"2016-11-23T14:32:11.819+0000","up_votes":1,"down_votes":0,"body":"https://i.ytimg.com/vi/X_J6TsE7S4w/maxresdefault.jpg","replies":[]}]}]},{"poster":"Ks Erwyn","date":"2016-11-23T08:39:08.843+0000","up_votes":1,"down_votes":6,"body":"decepcionante para lo largo del post...","replies":[{"poster":"Unknown Helper","date":"2016-11-23T14:28:47.851+0000","up_votes":4,"down_votes":0,"body":"Descepcionante es que entres para decir \"decepcionante para lo largo del post...\"","replies":[]}]},{"poster":"Amenotejikara","date":"2016-11-24T07:59:11.009+0000","up_votes":2,"down_votes":0,"body":"Buenos consejos! No soy main support, sin embargo disfruto jugar el rol y a la hora de buildearme tengo muchas dudas, y seguramente debo hacerlo mal (a pesar de que uso los ítems de supp y el zhonya en ocasiones). Que pensas del ítem Pebetero ardiente? De este nuevo ítem Redención? Por que Solari y no el estandarte? En todo caso, en que ocasión usarías el estandarte? Espero puedas resolver mis dudas, saludos!","replies":[{"poster":"Unknown Helper","date":"2016-11-26T00:34:21.923+0000","up_votes":2,"down_votes":0,"body":"Hola que tal, primero gracias por tu elogio. \nSegundo.\n1) Que pensas del pebetero? \nPienso que es un item muy util en personajes que tienen varias skill para activarlo. Janna por ejemplo, soraka, lulu. Creo que es muy buen item para personajes con estas caracteristicas y en especial cuando se tiene un adc que depende de la velocidad de ataque, como por ejemplo Twitch, Vayne, Lucian. \n\n2) Respecto al redencion.\nMe parece un item bastante fuerte de hecho, que combina muy bien con personajes como taric (aunque todavia me cuesta adaptarme a comprarlo, prefiero el vow jaja). Tiene una utilidad muy estrategica, ya que se lo puede utilizar combinado con una rilay teniendo zyra, para combinar la ult, el el Redencion y el slow, para generar buen dmg y darle la posibilidad a tu equipo de lograr ganar una pelea o darla vuelta.\n\n3) El estandarte es un item para mi gusto MUY dependiente de la situacion. Es como un ZZ. Es util en ocasiones que notas que NO hay posibilidad de ganar una pelea y necesitas empezar a generar push por alguna linea para aliviar a tu equipo.\n\nCualquier otra consulta preguntame!","replies":[{"poster":"Amenotejikara","date":"2016-11-26T06:23:35.417+0000","up_votes":1,"down_votes":0,"body":"Siempre me generó duda el estandarte, además que hace un buen tiempo que no veo un support buildearselo. Tendré en cuenta tus consejos, por ahora no tengo nada que agregar. Muchas gracias!","replies":[]}]}]},{"poster":"El Misionero 14","date":"2016-11-24T04:14:39.087+0000","up_votes":2,"down_votes":0,"body":"Yo la verdad, juego en ligas bajas, quede en B2, ascendiendo de B4, pero juegaba 2 ranked por semana, y tenia la teoria de que siendo suport no se podia subir de liga.\n\n\nTodo cambio con las flex en pretemporada, teams incarreables, adc que prefieren pelear a dar peel al Jungla, y jugando entre 4 o 5 partidas diarias ya llegue con las flex a B1 en Brasil, y ahora me detuve porque tengo que renidir de la U. \nIgual este season pienso jugar mas, minimo 2 ranked por noche, y creo cambie mi vision a que el suport es el carry de la bot lane, por lo menos los primeros 20 minutos, y me enamore de {{champion:43}} creo que, de utilidad, es el mejor suport que hay, tiene un kit re bully en bot, y si te gankean R+E, tengo los conceptos claves y estoy bien dentro de todo, me faltaria mas que nada, mejorar en el wardeo creo yo, como que siento que 4 wards se quedan cortos en esas ligas donde nadie te ayuda con la vision, estaria bueno, si podes y tenes un tiempo, una especie de guia con puntos especificos para sacarle 100% de provecho a la vision de los wards.\n\nSaludos de un Main Suport a partir de esta S7, y voy a ir en camino a mejorar mi elo en esta cuenta. {{summoner:3}} {{summoner:4}} \n\nPD: {{item:3107}} Esta ROTO. y veo suports que no se lo arman DAT.","replies":[{"poster":"Unknown Helper","date":"2016-11-26T00:28:30.641+0000","up_votes":1,"down_votes":0,"body":"Sip, la voy a armar! Dame un dia y te la preparo <3","replies":[]}]},{"poster":"Sir AZØR","date":"2016-11-23T10:55:25.752+0000","up_votes":2,"down_votes":0,"body":"Yo soy main support sison juan y bueno nada eso jejox","replies":[]},{"poster":"MLCPWhatsApp","date":"2016-11-23T14:35:44.526+0000","up_votes":2,"down_votes":1,"body":"Respondiendo a tu pregunta, hasta challenger, hasta el puesto 1 de LAS y a ser la Sona #1 de LAS también... esas son mis metas...\n\ndesde que baje hasta bronce 5 por ser nuevo y aprendi y segui aprendiendo.. llege a  platino 5 y voy por más...\n\ncon un win rate del 59% con Sona, que es el unico campeón que juego en Ranked.. pienso llegar y cumplir todas mis metas.\n\nSALUDOS","replies":[{"poster":"Unknown Helper","date":"2016-11-23T14:55:52.423+0000","up_votes":1,"down_votes":0,"body":"Felicitaciones, es lo unico que puedo decir ^^","replies":[]}]},{"poster":"FedecarboneroUY","date":"2016-11-23T06:25:12.222+0000","up_votes":1,"down_votes":0,"body":"Te doy like porque te mataste escribiendo.\n\nAunque deje de leer cuando vi que decía esto:\n\nDesde mi punto de vista, la lista de dificultad por rol seria algo asi\n\nADC. Debido a que el posicionamiento, promedio de farm y mecanicas son un gran factor en tu equipo.","replies":[{"poster":"Unknown Helper","date":"2016-11-23T06:27:25.245+0000","up_votes":1,"down_votes":0,"body":"Sep, es bastante estupido como lo defini, pero no sabia como plasmar mi punto de vista del rol JAJAJA\nVoy a tratar de mejorarlo.","replies":[{"poster":"Unknown Helper","date":"2016-11-23T06:28:16.100+0000","up_votes":1,"down_votes":0,"body":"Btw, creo que te conozco. No era jugador de lineage junto con Martin Andiorena (nunca me acuerdo bien el apellido) y Franco ?","replies":[{"poster":"FedecarboneroUY","date":"2016-11-23T17:10:44.040+0000","up_votes":1,"down_votes":0,"body":"Jaja, no es que simplemente el rol de adc no me parece el más difícil.\n\nY no, nunca jugué al Lineage xD","replies":[]}]}]}]},{"poster":"LastHope17","date":"2016-11-23T07:21:12.672+0000","up_votes":1,"down_votes":0,"body":"¿Lo de Thresh era joda o es enserio? 1 de cada 50 Threshs que veo se arma moneda","replies":[{"poster":"Lucio22","date":"2016-11-23T08:13:28.931+0000","up_votes":1,"down_votes":0,"body":"se, ya que el verde no le ayuda mucho. si bien thresy es tank, como es a distancia, el coso verde lo obliga a recibir daño para poder ejecutar a los minions, si estas full vida no haces mas que cagarle el farm al adc (ya sea que te lo lleves vos o que se lo coman los minions)","replies":[{"poster":"LastHope17","date":"2016-11-23T08:16:14.503+0000","up_votes":1,"down_votes":0,"body":"Si es verdad, pero con la nueva pasiva del targon que aplica para vos y un aliado mas nose si es tan worth armartelo con moneda, a menos que en vez de terminar el targon te armes {{item:2303}} en ese caso si creo que seria mejor la moneda xD","replies":[{"poster":"Unknown Helper","date":"2016-11-23T14:30:52.555+0000","up_votes":1,"down_votes":0,"body":"Mira, uso bastante thresh y me he dado cuenta que el relic no rinde tanto por el hecho que comenta Lucio, ademas de que considero que es mejor tener un ingreso de oro constante y una cura, y ademas cuando termino el shurelia tener ese extra de armor que no le viene mal a thresh siendo que en early game su armadura es un asco.","replies":[]}]}]}]},{"poster":"Omnipaws","date":"2016-11-23T06:39:23.008+0000","up_votes":2,"down_votes":4,"body":"No se, yo voy lux con ignite y trueno y que se arregle, apenas me robo un kill saco lagrima y a espamear los ks","replies":[]}]}