{"poster":"AndominateU","date":"2018-02-05T07:20:04.218+0000","title":"FLOOD RIOT SUPPORT WITH TICKETS ABOUT BOTTING FORCE THEM TO ACT","subforum":"Player Behaviour","up_votes":4,"down_votes":8,"body":"BASICALLY SICK OF THE SUMMONERS CODE THAT RIOT CLEARLY DOESN'T FOLLOW. I REPORT BOTS EVERYTIME I SEE THEM BUT THEN I SEE THE SAME ONES WEKKES AND MONTHS LATER STILL BOTTING MOSTLY IN ARAM HAVE SEEN IT IN RANKED AS WELL WHICH IS A MAJOR CONCERN FOR PLAYERS, BUT CLEARLY NOT A CONCERN FOR RIOT.\r\n\r\nSO I AM ASKING THE PLAYERS TO 1 FLOOD THE RIOT SUPPORT WITH REPORTS REGARDING BOTTING ACCOUNTS YOU COME ACROSS THAT WAY THEY WILL SEE PLAYERS ARE ANGRY AND WILL HAVE TO TAKE ACTION.\r\n\r\nAND 2 CEASE ALL REAL $$$$$ SPENDING ON THE GAME DON'T BUY RP UNTIL THEY FIX THERE REPORTING SYSTEMS TO BE EXTREMELY STRICT ON BOTTING DO BASICALLY IMMEDIATELY PERMA BAN THE ACCOUNT\r\n\r\nRIOT ALSO NEEDS TO STOP TREATING A BOT AS A HUMAN IT IS ARTIFICIAL INTELLIGENCE  THAT A HUMAN HAS PROGRAMMED TO DO A SET TASK THEREFORE NOT HUMAN AND SHOULD NOT BE TREATED AS SUCH AND IF THE HUMAN WHO CREATED IT WANTS TO COMPLAIN... GUESS WHAT \"SUMMONERS CODE\" THIS WAY BOTS WOULD EVENTUALLY BE PHASHED OUT ALMOST COMPLETELY FROM PVP (IDC ABOUT COOP V AI) 1 REAL PERSON IS ENOUGH TO BEAT RIOTS BOTS\r\n\r\nBECAUSE THESE BOTS ARE BETTER THEN RIOTS IF PROGRAMMED WELL ENOUGH.\r\n\r\nANYWAY THAT'S MY VENT I HOPE TO SEE CHANGES ON THE RIFT FROM THIS \r\n\r\nP.S IF YOU WORK FOR RIOT PLS DON'T RESPOND I HAVE NOTHING NICE TO SAY TO YOU.","replies":[{"poster":"SOOM","date":"2018-02-05T07:57:15.861+0000","up_votes":5,"down_votes":2,"body":"Go away","replies":[{"poster":"Fitzky","date":"2018-02-05T08:35:17.902+0000","up_votes":3,"down_votes":1,"body":"And why should he? He is talking about a legitimate issue, just because he is yelling in all caps? Maybe he should, otherwise people just look over stuff like this and deem it toxic. People are clearly fed up, maybe you should start taking stuff like this seriously.","replies":[{"poster":"SOOM","date":"2018-02-05T12:03:31.475+0000","up_votes":3,"down_votes":2,"body":"Why lol I read it and it’s useless flame XD","replies":[{"poster":"00shots00","date":"2018-02-05T20:20:24.604+0000","up_votes":1,"down_votes":2,"body":"do you even care for the game ?","replies":[{"poster":"SOOM","date":"2018-02-06T21:40:24.934+0000","up_votes":1,"down_votes":0,"body":"Yea","replies":[{"poster":"00shots00","date":"2018-02-06T21:40:55.225+0000","up_votes":1,"down_votes":2,"body":"that's a change of heart","replies":[{"poster":"SOOM","date":"2018-02-07T02:35:43.039+0000","up_votes":1,"down_votes":0,"body":"Just answering your question lel","replies":[]}]}]}]}]}]}]},{"poster":"Outis","date":"2018-02-06T06:02:19.290+0000","up_votes":1,"down_votes":0,"body":"considering their support is also mostly automated (ie bots) i doubt it would actually make a difference.\n\nnow if the population as a whole stopped spending then yeah that would trigger massive changes, but that is never going to happen is it.","replies":[]},{"poster":"TheDemonEmperor","date":"2018-02-06T01:16:20.464+0000","up_votes":1,"down_votes":0,"body":"Wait, what mode do you play to encounter bots? I dont think i have encountered bots outside the co-op vs AI game; Which doesnt bother me, because it is a pve map any way.","replies":[{"poster":"Ingénue","date":"2018-02-06T02:43:31.135+0000","up_votes":1,"down_votes":0,"body":"Probably ARAM","replies":[]}]}]}