{"poster":"KingofTitan24","date":"2016-03-12T18:37:22.774+0000","title":"League of Legends Suchtpotential","subforum":"Spielerverhalten & Moderation","embed":{"description":null,"url":"https://www.umfrageonline.ch/s/5c4c689","image":"https://d2w99t1r5l1pc2.cloudfront.net/scripts/images/favicon-large.png"},"up_votes":2,"down_votes":12,"body":"Hallo zusammen\r\nIch schreibe eine Arbeit zum Suchtpotential von League of Legends und m&ouml;chte dabei eine Umfrage machen. Ziel der Umfrage ist es herauszufinden, ob League of Legends s&uuml;chtig macht und was ein Spieler dagegen tun kann. Es ist durchaus auch m&ouml;glich, dass die Suchgefahr extrem klein ist. Es w&uuml;rde mich sehr freuen, wenn ihr euch kurz Zeit um nehmen w&uuml;rdet meine Fragen zu beantworten, es dauert nicht lange.\r\nMit freundlichen Gr&uuml;ssen\r\nLucas","replies":[{"poster":"legofreak1","date":"2016-03-12T18:52:36.636+0000","up_votes":4,"down_votes":0,"body":"> Welchen Einfluss hat die schlechte Community von League of Legends auf die gross Masse der Spieler?\n\nIst es nicht schlecht, implizite Fragen bei einer Umfrage zu stellen? Abgesehen davon, dass du die Community von vorneherein als schlecht abstempelst, was nicht meiner Meinung zu diesem Thema entspricht.\n\nUnd warum gibst du bei \"Was hemmt/stärkt die Suchtgefahr\" unterschiedliche Faktoren an? Die hemmenden Faktoren kann ich mir vorstellen, dass diese auch einen verstärkenden Faktor haben können.\n\nIch bin kein Experte für Psychology, meiner Meinung nach sieht diese Umfrage aber so aus, dass du uns nach unserer Meinung fragst, ob lol süchtig machst, aber keine Rückschlüsse ziehen kannst, ob lol tatsächlich süchtig macht.\nWenn du eine Umfrage erstellen würdest, ob lol-Spieler einen Zusammenhang zwischen Flaming und Alter sehen, wird ein großer Teil auch die \"Flame-Kiddies\" angeben, eine direkte Korellation zwischen Alter und schlechtem Verhalten gibt es aber nicht.","replies":[{"poster":"KingofTitan24","date":"2016-03-13T17:32:17.357+0000","up_votes":1,"down_votes":2,"body":"1. Ja du hast recht, die Frage ist wahrscheinlich nicht die beste und ich hätte sie besser zu den Faktoren genommen, bzw. einfach nur Community schreiben sollen.\n\n2. Die befragten haben immer die Möglichkeit ihre eigenen Punkte hinzuschreiben.\n\n3. Nach allem, was ich gelesen habe ist es grundsätzlich sehr schwierig zu sagen, ob eine Spiel süchtig macht oder nicht. Ich probiere mit der Umfrage etwas aus und mache das zum ersten Mal eine Umfrage. Trotzdem danke für deine Kritik, die zeigt mir sehr gut wo ich noch zu wenig überlegt habe.\n\nMit freundlichen Grüßen\nLucas","replies":[{"poster":"ThisOneDiesALot","date":"2016-03-14T11:34:17.241+0000","up_votes":1,"down_votes":0,"body":"_\" Trotzdem danke für deine Kritik, die zeigt mir sehr gut wo ich noch zu wenig überlegt habe.\"_\nAls jemand der von Berufswegen auch mal sich mit Umfragen beschäftigt (sowohl wenns darum geht eine zu erstellen als auch die Zahlen auszuwerten), bin ich auch etwas von der Umfrage irritiert gewesen. Ich habe sie mitgemacht konnte aber nur recht wenig beitragen, da ich keine Meinung hätte, die ich mit den Fragen hätte beantworten können. Vor allem was Suchtpotential verstärkt/hemmt.","replies":[]}]}]},{"poster":"Pandaphiri","date":"2016-03-13T09:41:12.568+0000","up_votes":1,"down_votes":1,"body":"im prinzip hat jedes spiel suchtpotential wenn es einem sehr gefällt. solche umfragen sind daher der größte schwachsin und letten endes nur dafürda Gaming schlecht hinzustellen oder bessergesagt noch schlechter als es ohnehin schon  hingestellt wird und genau danach riecht das ganze hier einfach. \n\nSry o.o ich gebe mich nicht für nen Studienzweck eines kleinen (vielleicht) Studenten hin. viel glück bei deiner Studie","replies":[{"poster":"KingofTitan24","date":"2016-03-13T17:35:10.645+0000","up_votes":1,"down_votes":2,"body":"Es geht nicht darum, das Spiel schlecht zu machen oder Gaming an sich schlecht darzustellen. Das Ziel meiner Arbeit ist es eher die positiven Seiten zu zeigen und das Gegenteil zu beweisen. Ich kann deinen Frust aber verstehen.","replies":[{"poster":"ThisOneDiesALot","date":"2016-03-14T11:39:40.154+0000","up_votes":3,"down_votes":1,"body":"_\"Das Ziel meiner Arbeit ist es eher die positiven Seiten zu zeigen und das Gegenteil zu beweisen.\"_\nLass das mit dem Beweisen sein. Wissenschaftliches Arbeiten geht von der grundsätzlichen Falsifizierbarkeit jeder Annahme aus. Du \"beweist\" nix. Harald Lesch hat das mal ganz pragmatisch auf den Punkt gebracht: Wissenschaft kann nicht sagen was etwas ist. Es kann immer nur sagen, was es nicht ist. (Zitat paraphrasiert)\n\nFalls ich mal nachfragen darf, warum machst du diese Umfrage? Semester-Arbeit oder dergleichen?\n\n_\"Ich kann deinen Frust aber verstehen.\"_\nIch nicht. Ziemlich viel Pamphlet seine Antwort und wenig konstruktiver Inhalt. Alles voll mit Unterstellungen.","replies":[{"poster":"KingofTitan24","date":"2016-03-14T16:11:15.437+0000","up_votes":1,"down_votes":0,"body":"Mehr oder weniger eine Semesterarbeit, nur habe ich die Umfrage ziemlich unterschätzt. Mein Professor sagte etwas von 3-4 Fragen und das es ganz einfach sei...","replies":[{"poster":"ThisOneDiesALot","date":"2016-03-15T09:28:43.879+0000","up_votes":2,"down_votes":0,"body":"_\"Mein Professor sagte etwas von 3-4 Fragen und das es ganz einfach sei...\"_\nDas habe ich damals auch gedacht als ich im Studium meine erste Umfrage zusammenbastelte :D\n\nGib Bescheid, falls du Fragen hast. Bin, wie gesagt, auch auf der Arbeit mit Umfragen beschäftigt. Da kann ich dir noch viel Einblick geben, falls gewünscht ;)","replies":[{"poster":"KingofTitan24","date":"2016-03-15T21:15:50.207+0000","up_votes":1,"down_votes":0,"body":"ich hab die Umfrage nochmal komplett neu gestaltet und probiert sie möglichst einfach zu halten. Könntest Du mir ein kurzes Feedback dazu geben? Reicht schon, wenn du schreibst: Ist in Ordnung/ Ist Müll \nLink: https://www.umfrageonline.ch/s/5c4c689\nMfG \nLucas\n\nPs: die Arbeit ist qualitativ nicht besonders hochstehend, bzw es ist eine kleinere Arbeit, deshalb erwarte nicht zuviel ;)","replies":[{"poster":"ThisOneDiesALot","date":"2016-03-16T15:12:11.311+0000","up_votes":2,"down_votes":0,"body":"_\"Könntest Du mir ein kurzes Feedback dazu geben? \"_\nJa, kann ich gerne machen :)\n\n_\"Reicht schon, wenn du schreibst: Ist in Ordnung/ Ist Müll\"_\nDas möchte ich hingegen nicht. Da beides nicht konstruktiv wäre. Wenn ich dir bloß sage \"Ist in Ordnung\" hat das was von Absolution, die ich nicht willens und nicht fähig bin zu erteilen :P\nWenn ich dir bloß sage \"Ist Müll\" bin ich keinen Deut besser als jemand, der ingame \"noob xy, pls uninstall\" schreibt.\n\nIch möchte dir ganz konkret antworten. Aber nicht direkt hier auf einem öffentlichen Forum. Ich wollte dir ne PM schreiben, aber offenbar geht das hier in den Foren nicht :D\n\nIch hab dich mal ingame auf EUW geadded. Schreib mich einfach an und ich geb dir noch einpaar nützliche Hinweise was die Umfrage angeht.\n\nVorab aber schon mal: Ich empfinde sie jetzt als wesentlich besser durchdacht als die vorherige.","replies":[]}]}]}]}]}]}]},{"poster":"Zulwar","date":"2016-03-14T12:02:08.884+0000","up_votes":2,"down_votes":0,"body":"Wenn du eine Arbeit zum Thema Suchtpotenzial schreibst, hast du im Grunde die falschen Fragen gestellt. \nDenn um Faktoren, die zu einer Sucht führen könnten, bei League of Legends zu finden, hättest du die Leute eher fragen müssen, was ihnen an LOL gefällt und weshalb sie dieses Spiel spielen. Wenn man so die richtigen fragen stellt, kann man mit genug antworten, auf eine mögliche Suchtgefahr Rückschlüsse ziehen. Mit deinen Fragen kannst du nur Rückschlüsse ziehen, was die Leute für Suchtgefährlich halten, aber ob dies dann wirklich süchtig macht, ist eher fragwürdig. \nDies wäre im Grunde, als ob du einen Drogenkonsumenten fragen würdest, was er für die Suchtgefahr hält. Er wird da wahrscheinlich sagen, das es nicht Süchtig macht oder er gibt dir einen Grund, der sich aber mit anders gestellten Fragen, zu einem ganz anderen Punkt kommen würde.\nSomit überlege dir hiernach, ob du es nicht nochmal machen möchtest, aber vorher informierst du dich, woran macht Süchte erkennt und welche Fragen man stellen muss, um sowas rauszufinden, wie viele der befragten dann nun Süchtig sind.\nDas ist dann denke ich eher was, was dir hilft, als das was du da derzeit gemacht hast.","replies":[{"poster":"Eibert Rümmel","date":"2016-03-14T22:49:27.912+0000","up_votes":2,"down_votes":0,"body":"hast mir in einen anderen Thread ausführlich zum Thema MMR reset geantwortet. Da ich den thread nicht mehr öffnen kann, sag ich einfach hier kurz danke für die Erläuterung ;)","replies":[{"poster":"Zulwar","date":"2016-03-15T05:35:24.328+0000","up_votes":1,"down_votes":0,"body":":D Immer wieder gern.","replies":[]}]}]},{"poster":"Rainbow Dashie","date":"2016-03-14T16:19:51.063+0000","up_votes":2,"down_votes":0,"body":"ich denke ich schreibe auch noch mal ein klein wenig was als Betroffener des pathologischen PC Gebrauchs (umgangssprachlich PC oder Online Sucht)\n\nPrinzipiell bietet jedes Spiel Suchtpotential, ich habe von MMOs, MOBAs bis hin zu einfachen Simulatoren schon eigentlich alles gesehen.\n\nEs sollte bei einer Forschung über den pathologischen PC Gebrauch, meiner Meinung nach, auch nicht um das Spiel bzw das Element des Konsums handeln, sondern viel eher um die Hintergründe.\n\nSo ziemlich jede Droge (ich zähle den PC mal kurz da rein) kann den einen süchtig machen und den anderen nicht. (ok bei Drogren tragen noch etwaige abhängig machende Stoffe bei).\n\nJetzt ist aber die große Frage warum ist das so? Vereinfacht ausgedrückt liegt es am ehesten daran das die Süchtigen einen gewissen Fluchtreflex erzeugen und diesem Nachkommen in den Spielen.\nDieser kann durch etwaige andere Psychische Erkrankungen entstehen, muss aber auch nicht zwangsläufig nur 1 Grund sein.\n\nEin weiterer wäre bspw. auch das Ausleben von gewissen Eigenschaften, oder teilweise auch des Geschlechts in den Online Welten, welches man im real life nicht machen kann, aufgrund der vorherrschenden moralischen Ordnung.\n\n\nSo viel zu dem Thema von mir als Betroffener der 1 Reha dagegen unternommen hat und etwaige weitere Dinge dadurch auch erlebt hat.\n\nKurz um es sollte immer noch eher an die Hintergründe gehen und nicht um das Suchtmittel.\n\nAlles geschriebene besteht aus meiner Meinung, meinen Erlebnissen und Erfahrungen und muss sich nicht zwangsläufig mit der vorherrschenden Meinung decken.","replies":[]},{"poster":"Revelate","date":"2016-03-12T18:43:53.454+0000","up_votes":1,"down_votes":0,"body":"Suchtgefahr 1/10\n10/10 ohne Bugs und Beleidigungen und mit immer perfekt gleich starken Teams :D","replies":[]}]}