{"poster":"xHaerusx","date":"2020-02-12T23:30:49.983+0000","title":"Höhere Strafe für das Verlassen von Spielen","subforum":"Spielerverhalten & Moderation","up_votes":5,"down_votes":6,"body":"Geht es nur mir so oder wird es immer mehr, dass Leute Spiele einfach verlassen? Gestern hatte ich vier Spiele davon in Folge. 2 ARURF und sogar 2 ranked Spiele, in denen jemand einfach das Spiel verlassen hat. Mir geht das so auf den ****! Man \"beraubt\" jedes Mal 9 andere Leute 30 Minuten Lebenszeit, mal ganz abgesehen von den LP im ranked. Ich finde, dass die Strafe für das Verlassen von Spielen deutlich zu gering ist. Ich finde, wer sich willentlich entschiedet, 9 andere Spieler so hängen zu lassen, der sollte mindestens 3 Tage gebannt werden. Einfach automatisch. Es ist auch nicht wichtig, ob afk oder verlassen, oder einfach nur in base stehen. Das erkennt das Spiel ja auch von selbst. Einen autobann vom Klienten und gut ist. Keine aufwendigen Moderatorenprüfungen, die Personal benötigen, einfach die Nachricht die im Prizip sagt \"du hast das Spiel verlassen, das ist nicht gut, bitte bitte bitte mach das nicht wieder\", die das Spiel einem schickt, durch einen \"davon geht das Spiel kaputt, du hast jetzt erst mal 3 Tage Auszeit\" Nachricht ersetzen. Sowas sollte es nicht mehr geben. Ruiniert meiner Meinung nach das Spiel. Man kann noch drüber reden, dass diejenigen, die disconnecten keine/eine andere Strafe erhalten, weil hier nicht jeder was dafür kann. Aber um zu vermeiden, dass alle leaver dann einfach den Internetstecker ziehen, sollte man hier meiner Meinung nach nicht differenzieren. Wer mit schlechtem Internet Multiplayerspiele spielt, der geht immer wieder das Risiko ein, 9 andere hängen zu lassen. \r\n\r\nWie sehen das denn die Anderen?","replies":[{"poster":"Megamaexx","date":"2020-02-13T08:42:54.388+0000","up_votes":4,"down_votes":0,"body":"Höhere Strafe ja. Wer sich von Wartezeiten von 20 Minuten vor jedem Spiel nicht abschrecken lässt, sollte gebannt werden. Allerdings für das einmalige Verlassen direkt nen 3 Tage Bann ist übertrieben. Dann hätte ich jetzt ich glaub 4x so eine Strafe erhalten, ohne wirklich was dafür zu können (denn wie soll man auf Fehler des PCs oder des Internetanbieters reagieren, wenn nicht erst, nachdem der Fehler bekannt ist?)","replies":[]},{"poster":"Yuiwara","date":"2020-02-12T23:55:40.219+0000","up_votes":4,"down_votes":0,"body":"ABSICHTLICHES Leaven sollte härter bestraft werden. Unabsichtiges Leaven (Hardware-, verbindungsprobleme, etc) nicht. das problem ist: Wie soll man darunter unterscheiden. das kann man eig nur, wenn das leaven zuvor im chat angekündigt wurde oder wer bereits zuvor mit afk gedroht hat.","replies":[{"poster":"eingew","date":"2020-02-13T17:59:19.641+0000","up_votes":3,"down_votes":0,"body":"Das Problem beim Leaven ist aber ja, dass es sich im Gegensatz zum unabsichtlichen Feeden durchaus vermeiden lässt.\nNatürlich hast du völlig Recht, dass wenn man nur Ausnahmsweise aufgrund von unvorhersehbaren Fehlern das Spiel verlässt auf keinen Fall eine Strafe bekommen sollte. Und auch das Strafmaß, welches der TE fordert ist natürlich viel zu hoch. Wenn man sich aber nicht um die Probleme kümmert und dennoch immer weiter spielt, dann ist da ja durchaus zumindest eine Fahrlässigkeit dabei, die mMn durchaus bestrafungswürdig ist, weil man wider besseren Wissens Spiele sabotiert.","replies":[]},{"poster":"Zavolta","date":"2020-02-13T06:04:05.354+0000","up_votes":2,"down_votes":5,"body":"> [{quoted}](name=Yuiwara,realm=EUW,application-id=KYnfKGf0,discussion-id=WAXEJXOQ,comment-id=0001,timestamp=2020-02-12T23:55:40.219+0000)\n>\n> ABSICHTLICHES Leaven sollte härter bestraft werden. Unabsichtiges Leaven (Hardware-, verbindungsprobleme, etc) nicht. das problem ist: Wie soll man darunter unterscheiden. das kann man eig nur, wenn das leaven zuvor im chat angekündigt wurde oder wer bereits zuvor mit afk gedroht hat.\n\nIch spiele seit 11 Jahren LOL. Die einzigen male, in denen ich aus dem Spiel geflogen bin, ist, wenn ich kurz vor der Serverwartung ein Spiel begonnen habe und die Wartung dann mittendrin beginnt...\n\nIch halte das für eine dämliche Ausrede, dieses \"PC Probleme\"... gibt ja auch genug Diskussionen, in denen von den Tricks erzählt wird, wie man durch \"Kabel zum Router ziehen\" einen DC vortäuschen kann... um dann mit dem Zweitaccount das nächste Spiel zu spielen, während man wartet, bis das ungewollte Spiel mit dem Erstaccount vorbei ist...","replies":[{"poster":"Yuiwara","date":"2020-02-13T14:12:28.511+0000","up_votes":2,"down_votes":1,"body":"> Ich halte das für eine dämliche Ausrede, dieses \"PC Probleme\"...\n\nIst es nicht. ich hatte auch schon mal ne zeit, da hat lol nicht ganz richtig funktioniert. da bin ich häufiger nach ca 10 min aus game geflogen und musste pc neu starten, weil pc durchs game eingefroren war und taskmanager sich nicht mehr öffnen wollte (bzw der haken bei immer im vordergrund öffnen war damals nicht im taskmanager drin, weshalb er sich immer im hintergrund des offenen vollbildgames geöffnet hat, was eingefroren war). Folglich mit neustart usw war ich häufiger als afk gewertet worden, weil ich zu lange zum reconnecten brauchte.\n\nMan sollte also nicht mit unsinn um sich werfen und alles als lüge abstempeln.\n{{sticker:sg-lulu}} ","replies":[{"poster":"Zavolta","date":"2020-02-13T15:41:36.860+0000","up_votes":5,"down_votes":3,"body":"> [{quoted}](name=Yuiwara,realm=EUW,application-id=KYnfKGf0,discussion-id=WAXEJXOQ,comment-id=000100000000,timestamp=2020-02-13T14:12:28.511+0000)\n>\n> Ist es nicht. ich hatte auch schon mal ne zeit, da hat lol nicht ganz richtig funktioniert. da bin ich häufiger nach ca 10 min aus game geflogen und musste pc neu starten, weil pc durchs game eingefroren war und taskmanager sich nicht mehr öffnen wollte (bzw der haken bei immer im vordergrund öffnen war damals nicht im taskmanager drin, weshalb er sich immer im hintergrund des offenen vollbildgames geöffnet hat, was eingefroren war). Folglich mit neustart usw war ich häufiger als afk gewertet worden, weil ich zu lange zum reconnecten brauchte.\n> \n> Man sollte also nicht mit unsinn um sich werfen und alles als lüge abstempeln.\n> {{sticker:sg-lulu}}\n\nDas sind mir die liebsten... wissen, dass ihre Spielinstallation fehlerhaft ist und sie dauernd rausfliegen... aber trotzdem Spiel starten und dann das Spiel für 4 andere ruinieren.\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Yuiwara","date":"2020-02-13T15:45:32.087+0000","up_votes":2,"down_votes":1,"body":"nope spielinstallation ist komplett und vollständig, nicht fehlerhaft. sowas kann durch neue patch, windowspatches usw auch ausgelöst werden. hat nichts mit fehlerhafter spielinstallation zu tun.","replies":[]}]},{"poster":"xHaerusx","date":"2020-02-19T12:27:20.826+0000","up_votes":1,"down_votes":1,"body":"Wenn du solche Probleme hast, dann solltest du das beheben, bevor du dich auf ein Spiel mit 9 anderen Leuten einlässt. Wenn bei dir die Heizung nicht geht, dann lädst du doch auch keine Leute zu dir ein und sagst dann \"sorry, dass ihr friert, das ist jetzt halt so\"..","replies":[{"poster":"Yuiwara","date":"2020-02-19T12:59:46.150+0000","up_votes":1,"down_votes":0,"body":"die probleme sind wegen eines patches aufgetreten, der kurz vorher statt fand, da gibt es nichts zu \"beheben\". Steht btw auch in ner anderen antwort von mir bereits halb drin.\n\n> nope spielinstallation ist komplett und vollständig, nicht fehlerhaft. sowas kann durch neue patch, windowspatches usw auch ausgelöst werden. hat nichts mit fehlerhafter spielinstallation zu tun.","replies":[]}]}]}]},{"poster":"Phoenixale","date":"2020-02-13T17:57:23.440+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yuiwara,realm=EUW,application-id=KYnfKGf0,discussion-id=WAXEJXOQ,comment-id=0001,timestamp=2020-02-12T23:55:40.219+0000)\n>\n> ABSICHTLICHES Leaven sollte härter bestraft werden. Unabsichtiges Leaven (Hardware-, verbindungsprobleme, etc) nicht. das problem ist: Wie soll man darunter unterscheiden. das kann man eig nur, wenn das leaven zuvor im chat angekündigt wurde oder wer bereits zuvor mit afk gedroht hat.\n\njo ich leave \"unabsichtlich\" indem ich meine wlan verbindung deaktiviere oder den rj45 stecker ziehe. du kannst es nicht unterscheiden.","replies":[]}]},{"poster":"Phoenixale","date":"2020-02-12T23:39:05.869+0000","up_votes":5,"down_votes":4,"body":"real Life ist wichtiger. Es kann immer etwas dazwischen kommen. Daher bleibts auch so - leider...","replies":[{"poster":"Zavolta","date":"2020-02-13T06:01:44.193+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=Phoenixale,realm=EUW,application-id=KYnfKGf0,discussion-id=WAXEJXOQ,comment-id=0000,timestamp=2020-02-12T23:39:05.869+0000)\n>\n> real Life ist wichtiger. Es kann immer etwas dazwischen kommen. Daher bleibts auch so - leider...\n\nWenn man keine Zeit hat, sollte man nicht spielen. So einfach ist das. Wie oft hatte ich schon spiele, in denen jemand \"I have to go in 5 Minutes. End or FF\" geschrieben hat. Das kommt ja immer sooo überraschend, dass man zum Verein muss oder es plötzlich (wie an jedem Tag zu dieser Zeit...) Essen gibt, etc. ...","replies":[{"poster":"Megamaexx","date":"2020-02-13T08:38:39.178+0000","up_votes":2,"down_votes":2,"body":"Oder Mutti ruft. Das kann man wirklich nicht kalkulieren. Leider war derjenige in meinem Team :/","replies":[{"poster":"Zavolta","date":"2020-02-13T15:43:28.095+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=KYnfKGf0,discussion-id=WAXEJXOQ,comment-id=000000000000,timestamp=2020-02-13T08:38:39.178+0000)\n>\n> Oder Mutti ruft. Das kann man wirklich nicht kalkulieren. Leider war derjenige in meinem Team :/\n\nDann darf sich der aber auch nicht über einen Bann wegen AFK beschweren. Alles hat nunmal Konsequenzen... wer Spiele startet ohne zu wissen, dass er sie auch spielen kann...","replies":[{"poster":"Megamaexx","date":"2020-02-13T16:03:43.755+0000","up_votes":4,"down_votes":1,"body":"Naja, so einfach ist das da nun doch wieder nicht. Demnach dürftest du ja auch kein Spiel starten, schließlich weißt du ja nicht, ob du gleich nen Stromausfall bekommst. Ebenso läuft es auch mit der Familie. Manchmal rechnet man einfach nicht damit, dass da jemand mich gerade jetzt unbedingt braucht.","replies":[]}]}]},{"poster":"Moonéyé","date":"2020-02-13T17:29:29.627+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Zavolta,realm=EUW,application-id=KYnfKGf0,discussion-id=WAXEJXOQ,comment-id=00000000,timestamp=2020-02-13T06:01:44.193+0000)\n>\n> Wenn man keine Zeit hat, sollte man nicht spielen. So einfach ist das. Wie oft hatte ich schon spiele, in denen jemand \"I have to go in 5 Minutes. End or FF\" geschrieben hat. Das kommt ja immer sooo überraschend, dass man zum Verein muss oder es plötzlich (wie an jedem Tag zu dieser Zeit...) Essen gibt, etc. ...\n\nEntschuldige Mal, natürlich hat mein Reales Leben Vorrang und nur weil ich gerade in nem Spiel bin, mach ich jetzt die Tür nicht auf, wenn es klingelt? Aber sonst geht's noch, ja? :D Ja, es passiert sehr, sehr selten, aber natürlich kann auch real was dazwischen kommen. Da sag ich sicher nicht \"och ne sorry, setz Dich mal 30 Minuten da hin und stör mich nicht, ich muss erst mein Rankedgame zu ende spielen...\". Also ja, ich hab wenig Verständnis, wenn man weiß, es ist naheliegend, dass man 'weg muss' oder denkt 'Och ich hab 30 Minuten Zeit, wird schon reichen...', aber es ist verdammt nochmal nur ein Spiel...","replies":[{"poster":"Zavolta","date":"2020-02-13T17:54:21.773+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Moonéyé,realm=EUW,application-id=KYnfKGf0,discussion-id=WAXEJXOQ,comment-id=000000000001,timestamp=2020-02-13T17:29:29.627+0000)\n>\n> Entschuldige Mal, natürlich hat mein Reales Leben Vorrang und nur weil ich gerade in nem Spiel bin, mach ich jetzt die Tür nicht auf, wenn es klingelt? Aber sonst geht's noch, ja? :D Ja, es passiert sehr, sehr selten, aber natürlich kann auch real was dazwischen kommen. Da sag ich sicher nicht \"och ne sorry, setz Dich mal 30 Minuten da hin und stör mich nicht, ich muss erst mein Rankedgame zu ende spielen...\". Also ja, ich hab wenig Verständnis, wenn man weiß, es ist naheliegend, dass man 'weg muss' oder denkt 'Och ich hab 30 Minuten Zeit, wird schon reichen...', aber es ist verdammt nochmal nur ein Spiel...\n\nKannst du alles machen. Ändert nichts an den Tatsachen, dass du ein Spiel verlässt. Letztendlich ist es egal, warum jemand geht... wenn er geht und seinem Team das Spiel versaut und die Lebenszeit klaut, gehört er entsprechend bestraft.","replies":[]}]}]}]},{"poster":"Eroticat Nimar","date":"2020-02-13T15:40:57.323+0000","up_votes":4,"down_votes":1,"body":"Nö.\nNur weil einmal bei mir auch der Router neu startet oder die Kinder mit dem Herd Spielen und ich jetzt aus dem Game raus bin soll ich 3 Tage nicht spielen können ?\n\nWenn sowas öfter vorkommt, ja.\nEin oder zweimalig im Monat ?\n\nZiemlich irrelephant","replies":[]},{"poster":"Icebergslasher","date":"2020-02-13T14:17:18.334+0000","up_votes":1,"down_votes":7,"body":"ich finde, dass es sagen wir nach 2 mal afk in 48 h, einen 10 spiele ranked ban gibt. \n\nbzw was noch besser wäre, wenn einer afk geht, und das team daraufhin verliert, verlieren die mitglieder nur 50% lp. also statt 20 dann 10. un der afkler geht auf 0 lp in seiner division.  das würde sicherlich ordentlich weh tun.","replies":[{"poster":"Yuiwara","date":"2020-02-13T14:18:13.918+0000","up_votes":5,"down_votes":0,"body":"nein verminderter lp verlust darf niemals der fall sein. man könnte die mechanik ansonsten abusen. Außerdem den afkler mit lp-verlust zu bestrafen halte ich für falsch, weil es immer Hardware- und internetprobleme geben kann.","replies":[{"poster":"Icebergslasher","date":"2020-02-14T11:25:51.239+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yuiwara,realm=EUW,application-id=KYnfKGf0,discussion-id=WAXEJXOQ,comment-id=00040000,timestamp=2020-02-13T14:18:13.918+0000)\n>\n> nein verminderter lp verlust darf niemals der fall sein. man könnte die mechanik ansonsten abusen. Außerdem den afkler mit lp-verlust zu bestrafen halte ich für falsch, weil es immer Hardware- und internetprobleme geben kann.\n\nnaja wenn ich internetprobleme habe, danm geh ich nicht ranked.  und wenn ich nach dem ersten game eo ich probleme habe noch mal ein ranked starte dann ist dass eig troll.","replies":[]},{"poster":"611FVNKBlv","date":"2020-02-14T11:02:19.934+0000","up_votes":1,"down_votes":3,"body":"Dieses weird Argument mit diesem Lp-Abuse. \n\nEinfach uff....\n\nNein es gibt keine Abuse-Möglichkeit. Wenn überhaupt dann maximal ab High-Dia bzw alle Ligen wo es wahrscheinlich ist das man auf die selben Spieler öfters treffen könnte. Und außerdem würde auch hier die MMR gleichermaßend sinken und nicht halbiert. DH selbst wenn man Abuse durch Premade nicht verhindern würde seitens riot, dann wäre die MMR eines entsprechenden Spielers ziemlich schnell so extrem weird das er sich lieber gewünscht hätte die volle LP zu verlieren.\n\nund den afkler mit LP-Verlust zu bestrafen ist falsch? Aha AFK sein ist richtig aber die Strafe dafür ist immer falsch.\n\n1. Sind es maximal 100 LP\n\n2. Wird lediglich die LP verringert und nicht die MMR. Sollte der Spieler also eine Winrate haben von mindestens 50% wird er sowieso wieder zu seinen alten LP kommen. Wenn nicht hat er den drop sowieso verdient . Wo ist das Problem ? \n\nEUWler sind einfach nach 10 Jahren immer noch komplett lost {{sticker:slayer-jinx-unamused}}","replies":[]}]}]},{"poster":"Alry FireBlade","date":"2020-02-13T19:34:15.652+0000","up_votes":2,"down_votes":2,"body":"Leaves der Champ Select sind absolut ätzend. Ich hätte gern höhere Strafen.","replies":[{"poster":"xYunalescax","date":"2020-02-14T11:25:26.326+0000","up_votes":3,"down_votes":0,"body":"Es geht hier aber nicht um die Champselect.","replies":[]},{"poster":"Randori89","date":"2020-02-14T12:50:06.353+0000","up_votes":1,"down_votes":0,"body":"Es ist nervig, aber es gibt halt gute Gründe, warum man sie manchmal leavt!","replies":[]}]},{"poster":"Phoenixale","date":"2020-02-14T10:00:46.666+0000","up_votes":1,"down_votes":1,"body":"Hoffentlich setzt sich bald die konkrete Registrierung durch personenbezogene Daten wie Name und Anschrift mit Persobeleg etc im Internet durch! Dann kann man die direkt aussortieren, indem man all ihre accounts bannt und nicht nur den, mit dem sie gerade beleidigen. im anschluss können sie sich ruhig neue erstellen....vielleicht benehmen sie sich dann","replies":[{"poster":"Randori89","date":"2020-02-14T12:58:10.415+0000","up_votes":2,"down_votes":0,"body":"Schon mal was von der DSGVO gehört?\nDas wird sich daher zum Glück nicht durchsetzen!","replies":[]}]},{"poster":"00 M4ddin 00","date":"2020-02-13T07:24:00.384+0000","up_votes":2,"down_votes":6,"body":"Lustig wie das runter gevotet wird wie alle theards dieser Art ^^ \n\nIch lass das mal da \n\nhttps://www.reddit.com/r/leagueoflegends/comments/f2bzr5/people_that_go_afk_and_spamm_ff15_in_ranked/","replies":[{"poster":"Aymira","date":"2020-02-13T07:32:08.097+0000","up_votes":4,"down_votes":3,"body":"Hab dir ein Daumen hoch gegeben um die Relevanz dieser Mechanik zu repräsentieren! :`]","replies":[{"poster":"HHaie tabbian","date":"2020-02-13T07:59:31.855+0000","up_votes":4,"down_votes":3,"body":"Für das destruktive Benutzen dieser Mechanik kriegst du erstmal einen Downvote.","replies":[{"poster":"00 M4ddin 00","date":"2020-02-13T08:43:20.752+0000","up_votes":2,"down_votes":2,"body":"Daumen für alle!","replies":[]}]},{"poster":"00 M4ddin 00","date":"2020-02-13T08:42:55.604+0000","up_votes":2,"down_votes":2,"body":"Daumen für alle ! \nDamit jeder weiß wie wichtig Daumen sind :D","replies":[]}]}]},{"poster":"xHaerusx","date":"2020-02-19T12:38:54.056+0000","up_votes":1,"down_votes":0,"body":"Ich spiele jetzt seit fast 12 Jahren Computerspiele und nicht ein einziges Mal hatte ich einen Ausfall des Computers oder des Stroms oder der Internetverbindung. Ich halte das in den meisten Fällen für faule Ausreden. Wenn man sowas öfter hat und es bekannt ist, dass der Router sich ab und zu mal abschaltet, oder Ähnliches, dann sollte man das Problem beheben, bevor man wieder und wieder aus Spielen raus fliegt und dann sagt \"naja, das ist jetzt zwar total scheiße für 9 Leute, aber ich konnte ja nichts dafür\". Und für die 0,1% die tatsächlich einen Stromausfall haben, oder ein Feuer in der Küche, oder solche Notfälle, für die ist es dann unverdient und kacke, aber für 99,9% der Leaver würde es heißen, dass man sich deutlich gründlicher überlegen muss, ob man jetzt das Spiel verlassen möchte. Ich glaube, dass das das Leaven deutlich reduzieren würde. Und wer noch 35 Minuten Zeit hat, bis er zum Zug muss, und ein Spiel anfängt, was dann 40 Minuten dauert, der hat es meiner Meinung nach nicht besser verdient. Die Spielzeiten lassen sich ziemlich klar einschätzen und wer nicht sicherstellen kann, dass er in der nächsten Stunde nichts vor hat, der soll Super Mario auf dem Gameboy spielen, da kann man Pause drücken. \n\nMan belohnt aktuell die Spieler, denen das Spiel und die Community egal sind, indem sie ein Spiel, dass in den ersten 8 Minuten nicht toll für sie läuft einfach verlassen können und man bestraft diejenigen, denen was daran liegt, dass alle Spaß haben können, weil sie wieder und wieder 4v5 spielen müssen und meistens dann verlieren.\n\nJA, natürlich hat reallife Vorrang vor Zocken! Das bestreitet ja keiner! Aber wenn ich Pläne habe, dann fange ich einfach kein Spiel an! Und Post habe ich auch schon entgegengenommen OHNE zu leaven. Eine Minute in Base ist nichts gegen ein 4v5 für 20 Minuten.","replies":[{"poster":"Angel Ayume","date":"2020-02-19T13:06:39.813+0000","up_votes":1,"down_votes":1,"body":"In den 5 Jahren in denen ich jetzt LoL spiele und auch in den 15 Jahren in denen ich allgemein zocke hatte ich durchaus schon Internetausfälle oder aber auch mal einen PC Absturz. \nNur, weil das auf dich nicht zutrifft heißt das nicht, dass es auf alle anderen zutrifft und es nur faule Ausreden wären. \n\nWenn ich für jedes Mal nen Bann bekommen hätte wo ich wegen PC Absturz oder Verlust des Internets afk gegangen bin, dann wäre ich sicher schon 3 oder 4x gebannt. Von der Zeit vor LoL brauche ich nicht reden. Hätte ich auch da Strafen bekommen, wäre ich wahrscheinlich nicht bei Onlinegames geblieben.","replies":[]}]},{"poster":"HairyAsianWife","date":"2020-02-13T23:41:37.389+0000","up_votes":1,"down_votes":0,"body":"Du wirst die Spieler nicht daran hindern es immer wieder zu tun. Die meisten Leute die konstant Spiele verlassen sind neue Accounts und es ihnen dadurch egal ist ob sie nun eine Strafe bekommen oder nicht,wenn sie sowieso wieder einen anderen Account in der Rückhand haben und damit weiter machen können. \n\nNehmen wir mal an das es höhere Strafen gibt,was würde es bewirken? \nEine temporäre Eindämmung die nicht zur Lösung des eigentlichen Problems beiträgt.\n\nAußerdem gibt es schon den LeaverBuster der solche Fälle schon rausfiltert,also hat Riot schon etwas dagegen gemacht,die nächste drastische Maßnahme wäre IP Banns zu verteilen die aber umstritten sind.","replies":[{"poster":"Randori89","date":"2020-02-14T13:00:15.238+0000","up_votes":1,"down_votes":0,"body":"Und was soll ein IP-Ban bringen?\nSelbst ohne Technisches Wissen, nach einem Tag hat sich die IP eh geändert!","replies":[{"poster":"HairyAsianWife","date":"2020-02-15T08:34:51.973+0000","up_votes":1,"down_votes":0,"body":"Durch deine IP kann man Zugriff auf alles was hinter deiner IP ist einlesen,klar ändert sich deine IP aber die Daten die dahinter sind nicht. \n\nEinfach erklärt.","replies":[]}]}]},{"poster":"611FVNKBlv","date":"2020-02-14T10:52:16.925+0000","up_votes":1,"down_votes":3,"body":"Hachja mein Lieblings-Thema mal wieder.\n\nIch glaube man wird nie alle zufriedenstellen können egal wie die Strafe ausfällt.\n\nErst einmal zu deiner Hauptfrage \" Leaven sollte härter geahndet werden\"\n\nLässt sich ganz eindeutig mit einem Ja beantworten.\n\nDas leaven zu lasch bestraft wird ist ganz klar , jedoch darf man auch nicht außer acht lassen das es durchaus immer mal Schwierigkeiten geben kann.\n\nGerade in diesen Zeiten wo der Müllhaufen , der uns fälschlicherweise als \"CLIENT\" verkauft wird, wirklich mehr Bugs hat als jedes Indie-Game auf der Welt zusammen kann man nunmal nicht unterscheiden ob es sich um einen bewussten DC handelt oder eben nicht. 3 Tage bei einmaligem AFK-Gehen halte selbst ich für unrealistisch und absolut übertrieben.\n\nAllerdings finde ich die Idee eines schnellen Bans für nicht zwingend schlecht. Toleranz ist schön und gut , doch wie viel soll man tolerieren? Es gibt leute die gehen etliche games am stück afk und kriegen was für eine Strafe? 5x5 Min queuesperre- - 5x20 min Queue-Sperre. mindestens 80% von den leuten die bewusst afk gehen wird das n feuchten Furz jucken ob die einfach lol 20 min im Hintergrund offen lassen müssen oder nicht. Bannstrafen finde ich dort deutlich Wirksamer alleine zum \"Schutz\" der restlichen Community.\n\nErst einmal sollte generell das Strafmaß fürs afk gehen überarbeitet werden. AFK sein hat eine riesen auswirkung, mehr als Beleidigungen ( Die man einfach muten kann ) und sollte dementsprechend auch in etwa genau , wenn nicht noch stärker , bestraft werden.\n\nAnfangen könnte man zumindest schon damit das der 5x5, 5x10 und 5x15 LB wegfällt und stattdessen 5x 20 , 5x 60 LB vergeben wird. Als nächsten Schritt würde dann der Ban ( 2 Wochen , 4 Wochen , 3 Monate , Permanent) erfolgen.\n\nJenachdem wie hoch die toleranzen sind halte ich diese Strafen für absolut fair und angemessen.\n\nIch kanns nachvollziehen wenn mal was dazwischen kommt , ich kanns nachvollziehen wenn man auch mal n tilt-Tag hat und vllt einfach mal in games wo dein Team einfach abfall ist auch einfach nur noch lust dazu hat sich auszuloggen. Das sollte sich dann aber auch ganz stark begrenzen auf  1x n bisschen negativ gestimmt und nicht auf permanent \" i dont give a fck\".\n\naber genau das bietet das aktuelle Strafsystem da fürs AFK gehen sogut wie nie eine Ban-Sperre ausgehändigt wird. die leute die fürs AFK gehen gesperrt werden haben teilweise auf 100 Games 95 AFK-Games. Das ist extrem unverschämt vor allem gegenüber den Mitspielern die diesen Teammate hatten , haben werden und falls der Gegner einigermaßen Fair ist auch für diese da sie vielleicht ein schönes 5v5 Game erwarten und nicht ein \"lass ma eben finishen\"\n\nMan muss einfach immer noch bedenken : Man kann AFK´s nicht mit einem Knopf muten. Also bestraft die Leute auch endlich nach dem Impact den sie für das Game haben.\n\n\nAktuell nimmt das AFK/Leaven in League of Legends dermaßend zu das die Ausmaße nicht nur auf dem eigenen Account zu spüren sind.\n\nAlleine wenn ich auf Twitch unterwegs bin sehe ich in jeden 2. Stream in den ich reinschaue das wieder mal jemand afk ist. Ich selber habe im Moment wieder knapp alle 2 Games 1 afk . Wenns gut läuft alle 4 . Ein kleiner Fehler reicht und die Leute loggen sich aus . und warum ? Die Leute schreiben alle am Ende das es eh nichts bringt weil Riot sowieso niemanden fürs AFK gehen bestraft.\n\nAllein das die AFKs genau diese Ansicht vertreten zeigt das es wirklich so ist. Und ja ich gebe zu : Mittlerweile gehe ich selbst auch wieder afk.\n\nNormalerweise bin ich jemand der sich sofort n Perma für jeden AFK wünscht und ja ich hätte kein Problem damit das ich dafür gesperrt werde\n\nIch sehe es aber nicht länger ein das ich 10 20 Games pro Tag spiele , in vllt 10 davon ein 5v5 existiert das dann durch etliche feeder und trolls auf vllt 3 von 20 Games 5v5 reduziert wird, und dafür noch von mir erwartet wird das ich mich an irgendwelche Regeln halten soll. die 30 Min Zeitverschwendung werde ich mir jetzt wesentlich seltener geben. Ist zwar jetzt nicht so das ich jedes Game einfach sage \" Ne kein Bock mehr\" aber wenn man 10 Games am Stück runtergerannt wird und das 11. Game genau so anfängt dann bin ich auch mal langsam am Ende.\n\nIch wollte diese Season eigentlich ganz gezielt meinen Fokus darauf setzen GM zu erreichen. Die Lust hab ich einfach dazu aber verloren. Ich brauche gefühlt 100 Games pro Division und nein das liegt nicht an meinen Stats oder sonstigem. Klar ich mache auch Fehler die sich ein GM-Spieler nicht erlauben sollte aber diese sorgen nicht dafür das ich eine WR unter 50 % hab. Wenn du aber permanent jemanden hast der Disconnected weil er seine Lane scheiße spielt und diese zurecht verliert oder wenn dir auf einmal ne 25:2 (Und ja diese Werte sind ziemlich realistisch im Moment) Qiyana in die Fresse springt und dich mit 3k Damage ausm leben tilted dann ist der WR-Einbuß eher zu erklären. Davon das Leute bestraft werden merke ich leider nichts. \n\nAlleine das ich eine WR unter 50% habe ist wirklich extrem ungewöhnlich . Ich glaube das hatte ich nach  4 Jahren LoL exakt 1x und zwar als ich in S7 ebenfalls von einer Welle an AFK-Spielern überrollt wurde.\n\nUnd es werden sicherlich typische EUW-Kommentare kommen:\n\nHast kein Recht dich zu beschweren \nWürdest diese Strafen auch für dich wollen\nSpiel halt besser\nJaja immer die anderen schuld\n\n1. Doch habe ich\n2. Exakt. Ich habe gegen die Regeln verstoßen und würde die Konsequenzen hinnehmen sofern jeder die selben Konsequenzen haben würde.\n3. Könnte ich , für Platin ist meine Spielweise aber sicherlich zu den 0,1 % Top gehörend genau wie meine Stats. Realistisch betrachtet also gut genug um mir den climb zu verdienen.\nNoch dazu wenn man regelmäßig von den Gegnern \" Smurf \" zu hören bekommt oder wenn meine Mates im Chat zum report aufrufen (gegen mich) und die Gegner so etwas sagen wir \" Report the best player in your team for inting makes no sense\" bestätigt mich immer sehr darin das ich gut genug spiele , zumindest für meine Elo.\n4. Bin ich etwa Schuld wenn andere Leute AFK gehen oder 0:20 stehen? Ich sehe da meine Schuld ehrlich gesagt nicht.\nAls Zusatz könnte man Punkt 3 nehmen um diesen Standpunkt meinerseits zu verdeutlichen.\n\n\nAls Schluss möchte ich gerne anmerken das man teilweise erstaunliches entdeckt wenn man auf manch op.gg-Profile schaut.\n\nEs gibt durchaus Leute die ausnahmsweise mal Afk gegangen sind  und ja das nervt zwar , ist aber für mich ok. Dann gibt es aber diese Profile wo ich mir nur denke \" Jo danke Riot\"\n\nDie werte auf 100te Games sind sehr schlecht , die Stats würden die Leute maximal für Botgames befähigen. Muss nicht heißen das diese Leute regelmäßig trollen aber die Wahrscheinlichkeit ist dafür sehr hoch. Wer als Jungler in Platin ein AVG- CS von 2/ Min hat oder als Adc oder Top-Main ebenfalls auf 2 CS/Min kommt ist für mich jemand der entweder ab einem Punkt nicht mehr farmt sondern nur noch auf Kills geiert ( Wenn das aber das Platin-Niveau ist dann pls ..... Fix this ) oder die Leute gehen regelmäßig afk , trollen oder inten rein. Das gleiche gilt für die KDA´s die dort teilweise wirklich uff sind. Klar stats sind nicht alles aber es ist halt legit n unterschied ob man jetzt ne KDA hat die avg bei ca 0,7 liegt oder in meinem Fall ne KDA avg hat die zwischen 3,0 und zu spitzenzeiten 5,5 liegt. Und das obwohl ich Champs spiele die ich nach 4 Jahren vllt 1-2x gepickt habe. zb Elise-Support o.ä\n\nFür mich steht einfach fest: So lange AFK sein nicht härter bestraft wird , werde ich mindestens genau so handeln. Ich werde weiterhin Spiele verlassen wenn ich aufgrund von etlichen AFK-Games am Stück zu getilted bin um noch 1 Game mehr zu ertragen , ich werde weiterhin die Mitte runterlaufen wenn ich sehe das meine Mates auf die 0:20 zugehen und und und. Ich hab einfach kein Bock mehr auf diese Matches die einfach nur noch Mental oneshotten. League ist durchaus ein geiles Game und es gibt wirklich Runden da würde ich am liebsten 10x Ehrung raushauen für jeden Spieler im Game und auf genau diese Matches werde ich jetzt warten bevor ich \" Spiele\".","replies":[]}]}