{"poster":"TheRod97","date":"2019-12-30T00:04:15.464+0000","title":"Yummi, E","subforum":"Jugabilidad, balance y narrativa","up_votes":6,"down_votes":2,"body":"Yo creo que deberian de volverle la carga de la E, es muy absurdo que ahora solo sea una ya que solo cura, yo creo que deben devolver le esa segunda carga pero como la antigua","replies":[{"poster":"Bae","date":"2020-01-02T15:08:12.008+0000","up_votes":1,"down_votes":0,"body":"{{champion:350}} \nNo deberian regresarle la E de por si esta muy roto eso, lo que si deberian volver a buffearle o cambiarlo, es la W para que no tarde en entrar a un aliado, o no pueda ser cortado por habilidades como el muro de {{champion:78}} o algunos choques (Ej;{{champion:113}} {{champion:79}} ).\nSi le devolvieran la E deberia tener mas CD, y sin dar velocidad de ataque, solo de movimiento como siempre.{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Tsuyeon","date":"2019-12-30T06:00:42.537+0000","up_votes":1,"down_votes":1,"body":"La E se vio fuertemente buffeada, (cura mas que las 2 cargas de antes y da velocidad de ataque) pero la gracia de yuumi era el ir saltando entre aliados curandolos, ahora no lo haces, pero creo que agarrar ponerle la mitad de curacion pero 2 cargas en el estado que esta yuumi en este momento me parece muy op (splitear la cura, buffear a 2 con el pebetero y tu E en si, total curas muchisimo de por si por tener un grial)","replies":[]},{"poster":"Gonk","date":"2019-12-30T03:24:15.867+0000","up_votes":1,"down_votes":1,"body":"En sí lo que hicieron ahora fue meter esas 2 cargas en 1 y que ya no se base en vida faltante (además de dar velocidad de ataque ahora). Ahora es horrible para los enemigos porque te cura una bocha","replies":[]},{"poster":"CaballoSilvestre","date":"2019-12-30T02:08:30.560+0000","up_votes":1,"down_votes":1,"body":"Al principio no me gusto pero ya me acostumbre. Me gustaba mas que sea por cargas pero no es para tanto y en total los cambios a la E fueron un buff grande.","replies":[]}]}