{"poster":"TheRod97","date":"2020-01-23T05:46:56.517+0000","title":"Aatrox Actualmente Es Una Basura De Campeon","subforum":"Jugabilidad, balance y narrativa","up_votes":4,"down_votes":2,"body":"Sinceramente para mi opinion aatrox ya esta muy debil ante campeones con movilidad como {{champion:84}} {{champion:157}} {{champion:11}} {{champion:64}} {{champion:245}} {{champion:131}} {{champion:114}}  lo counterean demasiado por no atinar bien sus Q aparte que en lade decae, peor aun no tiene ni un stun para encestar sus Q .\nAparte que en su W hay un fallo que e los costados te sales facil, osea no sirve la habilidad\nLo que yo propongo para que le den un buff a aatrox o un rework son :\n-Cuando tenga su pasiva tenga velocidad de ataque, osea para que la use mas rapido, ya que se tarda mucho la animacion\n-Ahora que su W por lo menos de un stun o relentize mas\n-Que no dependa mucho de su Q o bajenle el enfriamiento en lade o en early\n1. -La E que tenga menos enfriamiento, ya que es la unica habilidad de aatrox que ayuda a encestar Q pero el dash es muy corto por lo menos bajenle el enfriamiento o de vuelvanle la doble carga {{champion:266}} {{champion:266}}","replies":[{"poster":"Gonk","date":"2020-01-23T19:55:37.483+0000","up_votes":2,"down_votes":0,"body":"Pero estás nombrando campeones que tienen movilidad y obviamente son counters de el xD. Es como si tuvieras que buffear a zoe porque malzhahar no le deja tirar tranquilamente la E porque tiene su pasiva.\n AAtrox depende de su Q principalmente, porque es de lo que se destaca el. Es como si dijeras que tienen que buffear a ezreal para que su Q sea targeteable y no un skillshot porque es dificil de acertar xDD.\n En late si llegas a tirar bien las Q's o tenes cd, lo tenes cada 4 o 5 seg, que eso no es nada a comparacion de el cd de lo normal. \n Además de la E, tiene su W para acertar su Q, su W tiene que tener algo de counter, no vas a hacer que tenga todo regalado para que pueda usar su Q facilmente xd","replies":[{"poster":"TheRod97","date":"2020-01-23T22:42:08.150+0000","up_votes":1,"down_votes":1,"body":"aver bro, si digo que eso champs tienen movilidad pero no te has puesto a pensar que la Q de aatrox tarda en animacion, pero con zreal puede fucionar la W con la Q y lo tiras al mismo tiempo sin tan larga animacion como la de aatrox, aparte que es a distancia puede pockear cuando quiera, la W de aatrox su slow es uno de los peores del juego casi no relentiza  por los costados te sales y eazy aatrox, ejemplo la E de Morde alto en Hitbox, tambien la Q de zoe es su unica habilidad de daño, pero tiene su E que si stunea o dueme y eso si es una Q de Zoe asegurada, y Si la Q de aatox merece ser atinada mas veces","replies":[{"poster":"Gonk","date":"2020-01-24T19:08:07.180+0000","up_votes":1,"down_votes":0,"body":"Pero que, queres que aatrox ya deje de tener los counters que son de movilidad? Si sabes usar a aatrox, podes llegar a saberle jugar bien a algunos counters tuyo y a otros no (puede ser o no). Se supone que tenes que saber eso, es como si me quejara que siendo cait, le den mas buffeos porque sivir me saca las trampas facil con su E.","replies":[{"poster":"TheRod97","date":"2020-01-24T20:26:02.296+0000","up_votes":1,"down_votes":1,"body":"no estoy diciendo eso, ya se que tiene counter pero ahora en el mete actual aatrox ya no es como antes actualmente no sirve decae en lade y lo champs tanques y movilidad lo dejan fuera a aatrox, hasta hashinshi ya se quejo por este aatrox\n","replies":[{"poster":"Gonk","date":"2020-01-25T02:33:59.936+0000","up_votes":1,"down_votes":0,"body":"Será porque los de movilidad son los que dominan top lane ahora? Si ellos son los que dominan está dificil que pueda hacer algo el. Aunque creo que todavía no sabes sacarle el provecho, porque sabiendo usar bien la E y la Q, podes ganarles bien a algunos counters","replies":[{"poster":"TheRod97","date":"2020-01-25T16:18:53.890+0000","up_votes":1,"down_votes":1,"body":"Soy main Aatrox y sigo a hashishin ya desde hace tiempo, ahora eh visto que se ah quejado por este aatrox, si se hacer el combo de E + Q pero el dash es muy corto para no alanzar a nadie no cree?","replies":[{"poster":"Gonk","date":"2020-01-25T17:00:34.319+0000","up_votes":3,"down_votes":0,"body":"Juego a este aatrox desde que sacaron este rework porque no me gustaba para nada el otro. Que tiene que ver que sigas a hashinshi y te quejes porque el se queja?, yo lo unico que le veo algo incomodo a aatrox es el daño de la Q con los minions y ya, lo otro lo veo bastante cómodo y es fácil de atinar tu Q si sabes usarla (además hacia adelante), hacia los costados o hacia atrás.","replies":[]}]}]}]}]}]}]},{"poster":"KFCooper","date":"2020-01-23T16:36:53.744+0000","up_votes":3,"down_votes":0,"body":"Yo creo que todavía no lo sabes usar a su potencial. Es un campeón que tiene todas sus herramientas para dar sus Q; la R que da velocidad de movimiento, la E que por si no alcanza la Q, los propios stuns de la Q que con eso no se te deben escapar, y la W que es para dar una Q aunque sea con el slow.","replies":[{"poster":"TheRod97","date":"2020-01-23T17:27:08.118+0000","up_votes":1,"down_votes":1,"body":"bueno, la velocidad de su ulti decae y peor cuando peleas haci que no sirve mucho la velocidad, ni te asegura una Q, la E es un dash lo se pero, como ya lo dije campeones con movilidad como los de arriba se lo pasa esquivando las Q de aatrox, haci pierde su daño literalmente, La W te da slow pero no te das cuanta que campeones con dash o sin dash se salen por los costados \ncomo estos {{champion:114}} {{champion:103}} {{champion:157}} {{champion:23}} {{champion:6}} {{champion:58}} {{champion:24}} {{champion:104}} {{champion:245}} {{champion:164}}","replies":[{"poster":"KFCooper","date":"2020-01-23T17:59:03.506+0000","up_votes":1,"down_votes":0,"body":"La mayoría de esos campeones tienen un solo dash, así que tienes más herramientas si te esquivan una Q.\nTe recomiendo ver algunos streamers que tengan mucha maestría con Aatrox y aprenderas como se enfrentan a esos campeones que te molesten. Por ejemplo Hashinshin","replies":[]}]}]},{"poster":"Sabanur","date":"2020-01-23T08:17:51.860+0000","up_votes":2,"down_votes":0,"body":"Pero a los demás le hace bullying, por eso siempre baneo atrox es de los campeones más molestos que pueden existir, su maldita Q no te deja tomar un Minion en paz, a menos que seas akali o alguna de esas mierdas","replies":[{"poster":"TheRod97","date":"2020-01-23T14:19:49.971+0000","up_votes":1,"down_votes":2,"body":"men tambien los stuns hacen mucho counter a aatrox porque no puede usar la Q su unica fuente de daño, aparte los stuns lo counterean, un mini stun y adios Q como los que tiene {{champion:90}} {{champion:58}} {{champion:14}} {{champion:86}} , bueno garen solo por el silencio {{champion:24}}","replies":[]}]},{"poster":"US iWhy","date":"2020-01-23T06:31:33.169+0000","up_votes":3,"down_votes":2,"body":"Yo preferiría que lo revirtieran junto a Mordekaiser y Akali.","replies":[{"poster":"TheRod97","date":"2020-01-23T14:21:23.151+0000","up_votes":1,"down_votes":3,"body":"Mordekaiser lo piden que lo nerfeen haci que no tengo mucha ezperanza para el, pero akali si necesita un buff urgente","replies":[]}]},{"poster":"RikiFsn","date":"2020-01-23T08:33:46.015+0000","up_votes":2,"down_votes":1,"body":"Que pueda revivir de nuevo era divertida esa mecánica","replies":[]},{"poster":"doomguy2003","date":"2020-01-25T21:59:17.302+0000","up_votes":1,"down_votes":0,"body":"No creo que sea una basura, yo lo veo bastante viable a dia de hoy. Tiene todo lo que un champ requiere: movilidad, daño, cc, sustain, y tankiness","replies":[]},{"poster":"WhiteMax","date":"2020-01-23T17:59:14.569+0000","up_votes":1,"down_votes":0,"body":"Juga Riven, es lo mismo.","replies":[]}]}