{"poster":"Chiicho0x","date":"2016-08-22T00:57:23.570+0000","title":"El rehacer no existe.","subforum":"Comportamiento del jugador","up_votes":10,"down_votes":2,"body":"Hola vengo de ganar 13 de 15 con mi main udyr... Acabo de jugar una ranked en donde el mid se va afk al minuto 3 y jugamos hasta cuando pudimos... ibamos 10-2 ganando en kills pero no llego alfinal terminamos tirando SURR, pero rito como es posible que si alguien se va al minuto 2 o 3 el rehacer ya no exista? Por favor hazte ver y espero me responda un rioter....","replies":[{"poster":"Jobax","date":"2016-08-22T02:01:26.728+0000","up_votes":5,"down_votes":0,"body":"También he perdido partidas porque se quedan afk en base, están conectados pero no están jugando, para explicar mejor: es como que entran a la partida y algo pasa que no juegan pero tienen el lol abierto, entonces no te deja tirar remake, aunque claramente se vea que esta afk.\nEso también jode Caleta y es super injusto.","replies":[{"poster":"Tazztania","date":"2016-08-24T18:50:09.524+0000","up_votes":1,"down_votes":0,"body":"yo una vez entré a jugar y me demoré 3 mins en llegar (mi personaje ya habia cargado pero yo seguía en la fuente) y cuando volví y estaba camino a la línea tiraron remake :(","replies":[]}]},{"poster":"Bienzahar","date":"2016-08-22T01:03:17.547+0000","up_votes":5,"down_votes":15,"body":"Alguien no leyo como es el remake al parecer.","replies":[{"poster":"Dr Lukas","date":"2016-08-22T01:45:59.118+0000","up_votes":13,"down_votes":3,"body":"Alguien no comprendió lo que quiso transmitir el autor","replies":[{"poster":"José Larralde","date":"2016-08-22T01:50:58.389+0000","up_votes":2,"down_votes":0,"body":"Valar Morghulis","replies":[{"poster":"Matichq117","date":"2016-08-22T12:53:56.932+0000","up_votes":2,"down_votes":0,"body":"Valar dohaeris","replies":[]}]},{"poster":"Bienzahar","date":"2016-08-22T01:54:35.480+0000","up_votes":3,"down_votes":7,"body":"Alguien se cree super herooooo xDD","replies":[]}]}]},{"poster":"Zabivaka","date":"2016-08-22T02:01:52.415+0000","up_votes":4,"down_votes":1,"body":"Pasa que si nos ponemos en el lugar de riot, tienen razón, si nos dan más tiempo de remake se vuelva abusable, supongamos que tenemos 10 minutos para hacer el remake, y para ese tiempo tu equipo va 2/16 y el enemigo tiene 3 dragones y ya casi estan tirando inhibidor, hacer que alguien se vaya afk para remakear seria injusto.\nCreo que para solucionar yo le pondría un sistema así al remake:\nSe puede hacer remake en cualquier momento de la partida\nEl jugador tiene que haberse ausentado al menos 3 minutos para que el equipo pueda remakear\nSe debería poner un sistema para que el juego detecte como se desconecto un jugador, por ejemplo que salga en el chat El jugador X (Elise) se ha desconectado, causa: Desconección intensional (el jugador se desconecto por su cuenta presionando el botón abandonar o cerrando el programa lol) o causa: Problemas de conección (Si el jugador abandona intencionalmente la partida si sus ms son superiores a 500 o el servidor esta experimentando fallos)\nSi el jugador se desconecto intencionalmente recibirá un castigo mucho mayor (yo le mando 50 partidas de baja prioridad y 10 minutos de espera para cada una en vez de 5, los trolls se lo pensaran 2 veces antes de abandonar)","replies":[{"poster":"mocoso","date":"2016-08-22T03:22:44.573+0000","up_votes":2,"down_votes":0,"body":"Me hace mucho daño leer palabras como \"conección\" o \"intensional\" {{item:3151}} {{summoner:11}}\n\nHablando en serio, creo que después de que un jugador se ausentó por más de 3 minutos se tiene que poder tirar surrender en cualquier momento, incluso antes del minuto 20. Así no se pierde tiempo pero tampoco se es injusto con el equipo rival. Imagina sino que un jugador queda afk a partir del minuto 15, y al minuto 18 tiran remake y se pierde todo lo logrado, lo que se presta a abusos.\n\nEl sistema de penalización según el \"tipo\" de desconexión es algo que me gustaría que estuviera implementado hace tiempo ya.\n\nSaludos!","replies":[{"poster":"Zabivaka","date":"2016-08-22T22:04:03.691+0000","up_votes":2,"down_votes":0,"body":"Hola! Gracias por tu opinión y perdón por las faltas de ortografía, estudio medicina. :c","replies":[{"poster":"Sirek","date":"2016-08-23T18:39:08.228+0000","up_votes":1,"down_votes":0,"body":"Pobre farmacéutico que reciba tus recetas xD","replies":[{"poster":"Zabivaka","date":"2016-08-23T21:17:42.996+0000","up_votes":2,"down_votes":0,"body":"TODOS los médicos escriben para el ojete.","replies":[]}]}]}]},{"poster":"Kyousuke","date":"2016-08-22T03:25:33.685+0000","up_votes":2,"down_votes":1,"body":"te falla algo ahí que pasa si se corta directamente el Internet? que pasa si se corta la luz?  por que debería sufrir mas por \"desconexion intencional\" siendo que no fue culpa suya?","replies":[{"poster":"Zabivaka","date":"2016-08-22T22:02:39.476+0000","up_votes":1,"down_votes":0,"body":"Es una idea nomás, tampoco me pude poner a pensar en todo pero aproximadamente seria así, obvio que no seria justo que un jugador que se le corta el internet o la luz se coma tremendo castigo.","replies":[]}]},{"poster":"GameMode","date":"2016-08-22T11:53:17.220+0000","up_votes":1,"down_votes":1,"body":"Si te vas afk te reportan.","replies":[]}]},{"poster":"TapateLasPatitas","date":"2016-08-22T17:44:01.845+0000","up_votes":1,"down_votes":0,"body":"Siendo honesto, lo que menos importa es tu racha de victorias x'D\n\n\nEl sistema es una \"ayuda\" para prevenir, dentro de un margen, afks, considero que el remake está super bien, afks van a estar en todas partes, en todas las divisiones, en todos los modos, entonces, prolongar la duración de remake o darle más \"peros\" a el comando, se podría prestar para muchos abusos, en serio.\n\nPara evitarme preguntas como ¿Y cuales serían esos?\nUn invade catastrofico, donde matan a uno o todos, alguien ragea porque no salió bien, se va afk, remake, todo el mérito del otro team por jugarles bien en contra, se pierde, y lo peor, todo el tiempo perdido entre encontrar partida, que no se salgan, entre los bans y selección, todo eso suma y que en cada partida donde se hace remake ambos equipos, pierdan solo tiempo, no es la gran cosa, pero solo beneficia a quienes tuvieron un inconveniente desigual durante el inicio.","replies":[]},{"poster":"D Godyr Gates","date":"2016-08-22T12:31:29.167+0000","up_votes":1,"down_votes":0,"body":"Capaz un ZZrot rusheado de primer item los hubiese ayudado un poco mas a aguantar mid?","replies":[]},{"poster":"Conejito Fufu","date":"2016-08-22T07:40:36.497+0000","up_votes":1,"down_votes":0,"body":"Para mi se deberia poder tirar remake si el que esta afk no recibio NADA de exp.","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-08-22T01:53:33.164+0000","up_votes":1,"down_votes":0,"body":"Con tu misma build ¿Que me dices de usar fantasmal y escaramuzo? en vez de flash y acechador.","replies":[{"poster":"Chiicho0x","date":"2016-08-22T02:02:20.459+0000","up_votes":1,"down_votes":0,"body":"No viene al tema :( jaajja  y no pq flasheo en la cara al ap carry o adc y deleted!","replies":[]}]}]}