{"poster":"x Fabii","date":"2017-10-16T13:05:17.066+0000","title":"FEEDBACK an die ENTWICKLER zur Sperre von Ranglistenbelohnungen","subforum":"Spielerverhalten & Moderation","up_votes":8,"down_votes":11,"body":"Hallo an alle Leser, Spieler und hoffentlich auch an ein paar Entwickler des Spiels,\r\n\r\nIch habe eine kleine Kritik am derzeitigen Bestrafungsverfahren f&uuml;r die Ranglistenbelohnungen.\r\n\r\nVorab m&ouml;chte ich sagen das ich es gr&ouml;&szlig;tenteils in Ordnung und berechtigt finde wie Summoner f&uuml;r negatives verhalten bestraft werden, und auch ich bin kein Unschuldslamm und will mich gar nicht vor einer Art von Bestrafung dr&uuml;cken.\r\n\r\nMein Fall kurz zusammengefasst:\r\n\r\nIch spiele zu 99 % nur Ranked.\r\nIch spiele seit Season 2 Ranked.\r\nIch bin in dieser Season ERSTMALIG nach grob gesagt 6 jahren arbeit DIAMANT.\r\n\r\nNun wurde ich am 12.10.2017 f&uuml;r Negatives Chatverhalten Zeitlich gebannt.\r\n\r\nDas bedeutet wiederrumm ich werde keinerlei Season Belohnungen f&uuml;r das Jahr 2017 erhalten ( &gt;&gt;&gt;Nichtmal einen Rahmen f&uuml;r Diamant&lt;&lt;&lt; )\r\n\r\nMeine Kritik:\r\n\r\nDas Ranked spielen, trotz der Resets am ende einer Season ist ein Kontinuierlicher Prozess.\r\nIch habe seit season 2 Ranked gespielt und habe es nun in Season 7 nach 6 Jahren Arbeit und kontinuierlichem Spielen geschafft das Diamant Tier zu erreichen.\r\n\r\n&gt;&gt;&gt;&gt;Warum erh&auml;hlt man nicht zumindest den Rahmen f&uuml;r das ERSTMALIGE erreichen von Diamant ?&lt;&lt;&lt;&lt;\r\n\r\n&gt;&gt;&gt;&gt;Das erreichen des Tiers an sich am ende einer Season bezieht sich schon lange nicht mehr nur auf die Leistung eines einzelnen Jahres. Jede Season startet man mehr oder weniger dort, wo man es in der Season davor hingeschafft hat (Elo). Jede Season bildet eine Grundlage f&uuml;r die n&auml;chste Season\r\nDa ich nun nach der Deadline Zeitlich gesperrt wurde und mich Fehlverhalten habe, wird mir Selbst der Rahmen f&uuml;r das erstmalige erreichen von Diamant und somit die Arbeit von 6 Jahren genommen.&lt;&lt;&lt;&lt;\r\n\r\nIch finde es vollkommen Gerechtfertigt keinen Skin/Wardskin etc zu erhalten! Dies ist die Belohnung f&uuml;r EINE SEASON alleine an sich.\r\n\r\n&gt;&gt;&gt;&gt;Aber die Rahmen sind meiner Meinung und Ansicht die Arbeit mehrerer Jahre und stetigen Wachstums.&lt;&lt;&lt;&lt;\r\n\r\nVon daher finde ich es Unfair spielern die Erstmalig in einer Season ein Neues Ranked Tier erreichen den Rahmen hierf&uuml;r zu verwehren.\r\n\r\nGr&uuml;&szlig;e Fabii","replies":[{"poster":"Gin","date":"2017-10-16T13:25:38.337+0000","up_votes":5,"down_votes":1,"body":"> Das Ranked spielen, trotz der Resets am ende einer Season ist ein Kontinuierlicher Prozess.\nIch habe seit season 2 Ranked gespielt und habe es nun in Season 7 nach 6 Jahren Arbeit und kontinuierlichem Spielen geschafft das Diamant Tier zu erreichen.\n\nDas ist schön und gut, die Belohnungen am Ende einer Saison repräsentieren allerdings wie gut du im letzten Jahr warst, und dass du dich das ganze Jahr über sportlich verhalten hast und keine/kaum Strafen kassiert hast.\n\n> Das erreichen des Tiers an sich am ende einer Season bezieht sich schon lange nicht mehr nur auf die Leistung eines einzelnen Jahres.\n\nDoch. Doch das tut es. Gerade als langjähriger Spieler solltest du das wissen.\n\n> Ich finde es vollkommen Gerechtfertigt keinen Skin/Wardskin etc zu erhalten! Dies ist die Belohnung für EINE SEASON alleine an sich.\n> \n> Aber die Rahmen sind meiner Meinung und Ansicht die Arbeit mehrerer Jahre und stetigen Wachstums.\n\nNein. Ein Rahmen ist genau so eine Repräsentation für deine Leistungen und für sportliches Verhalten wie ein Ward Skin oder der Siegreich Skin.\n\n> Von daher finde ich es Unfair spielern die Erstmalig in einer Season ein Neues Ranked Tier erreichen den Rahmen hierfür zu verwehren\n\nDann benehme dich in Zukunft. Wie du zum [offiziellen Beitrag](http://euw.leagueoflegends.com/de/page/2017-ranked-season-ends) zu den Belohnungen nachlesen kannst:\n\n> - Spieler, die am Ende der Saison gesperrt sind oder aktiven Chatbeschränkungen unterliegen. \n> - Spieler, die ab dem 22.08.2017 für mindestens sieben Tage gesperrt wurden. \n> - Spieler, die während der Saison 2017 für eine Manipulation an der ELO-Wertung gesperrt wurden.\n\nWenn deine Chatsperre bis zum Saisonende am 07.11. abläuft, solltest du deine Belohnungen noch kriegen - wenn ich es richtig verstanden habe.\n\nSolltest du deine Belohnungen allerdings nicht mehr bekommen können weil die Strafe über den 07.11 hinaus geht, ist das genau so gerechtfertigt.\n\nUnd wie andere bereits geschrieben haben: Es soll weh tun. Das ist der Zweck von Strafen.","replies":[{"poster":"Janna best Waifu","date":"2017-10-16T17:17:25.153+0000","up_votes":1,"down_votes":3,"body":"Mich würd einfach nur mal intressieren wieso Riot das Rad neu erfinden muss, und nicht einfach nen normales chatfilter system/sofort punish system verwendet wies 99% der anderen hersteller durchziehen? Wo is der haken? Wieso will riot es unöttig kompliziert machen.","replies":[{"poster":"legofreak1","date":"2017-10-16T17:24:43.227+0000","up_votes":5,"down_votes":0,"body":"Deine Annahmen sind leider vollkommen falsch. Das instant Feedback System hat seinen Namen, weil es binnen Minuten eine Strafe ausspricht. Dabei liefert es außerdem **immer** einen Chatlog mit, man kennt also immer den Grund. 24-Stunden Bans wurden durch CR ersetzt, weil diese einen besseren Effekt haben, wiederholte kurze Strafen wurden abgeschafft, weil diese überhaupt keinen Effekt mehr hatten.\nSpieler, welche viele wiederholte Bans erhielten, sind nie davon ausgegangen, jemals permanent gesperrt zu werden, da es aus ihrer Sicht immer noch eine weitere Strafe geben wird. Momentan ist die vierte Eskalationsstufe bereits der Permaban, mit der expliziten Warnung nach der dritten.","replies":[{"poster":"Janna best Waifu","date":"2017-10-16T17:30:22.587+0000","up_votes":1,"down_votes":3,"body":"-Seitdem das Neu Ehren system da ist klingt das so als ob alle spieler bei 0 anfangen also eine weiße weste haben, stimmt dies? Sind accounts die kurz vorm permbann waren wieder bei der 10 spiele chatsperre? Oder nicht? aus dem support artickel kann man der info leider nicht entnehmen. \n\n\nHeist neuanfang alles resettet oder nicht?\n\nhttps://support.riotgames.com/hc/de/articles/115008474148-H%C3%A4ufig-gestellte-Fragen-zu-den-Ehrungen\n\n> Die Aktualisierung der Ehrungen stellt für alle einen Neustart dar. Falls du keine aktive Strafe absitzen musst, ist das der perfekte Zeitpunkt, um ein neues Kapitel aufzuschlagen und kostenlose Beute zu erhalten, wenn du auf Sieg spielst.","replies":[{"poster":"legofreak1","date":"2017-10-16T17:49:09.375+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Luxienna,realm=EUW,application-id=KYnfKGf0,discussion-id=uvEEzUTP,comment-id=0004000100000000,timestamp=2017-10-16T17:30:22.587+0000)\n>\n> Kannd er support da einsicht gewähren?\n\nJa.\n\n> Heist neuanfang alles resettet oder nicht?\n\nNein, das bezog sich nur auf Ehrungen. Strafen wurden davon nicht beeinflusst. Der einzige Zeitpunkt, zu dem ähnliches gemacht wurde, war mit der erstmaligen Einführung des IFS vor inzwischen ungefähr 2 Jahren, wenn ich das gerade so richtig im Kopf habe.","replies":[]}]}]},{"poster":"Sirrkas","date":"2017-10-16T18:19:02.864+0000","up_votes":2,"down_votes":1,"body":"> Da macht man nen halbes jahr lolpause, und dann 1 spiel wirs 14 tage gebannt wenn du pech hast. (ist nem bekanten passiert) \n\nDer hatte kein Pech. Entweder hat er verdrängt/vergessen, dass er eine 25er CR hat oder sich wie die Axt im Walde aufgeführt. Wenn er die Pause gemacht hat, weil er die CR nicht vertragen hat, ist das halt blöd für ihn gelaufen, aber den Grund für die Pause müsste er doch wissen. \n\n> Weist man nach nem halben jahr noch ob man toxisch war oder nicht? Oder vorallem wofür? Nein. Es ist teilweise komplett wilkür wie das system entscheidet.\n\nJa, das sollte man schon noch wissen, ob man sich benommen hat oder nicht. Was kann Riot denn dafür, wenn sich jemand denkt \"bäh, 2 wochenbann ist gemein ich spiel nimmer\". Kommt nach nem Jahr wieder, ist noch immer toxisch und kriegt dann den Perma. Sollen die ihm wirklich eine Extrawurst geben und beim einloggen daran erinnern, dass er sich gefälligst zu benehmen hat, weil er ein Jahr nicht mehr gespielt hat und der Bann davor erhalten wurde?\n\n>Es ist teilweise komplett wilkür wie das system entscheidet. \n\nDas ist falsch. Wer sich benimmt, wird nicht bestraft. Nur weil du dich nicht benommen hast und glaubst, du hättest die CR nicht verdient, wird das nicht wahr. \n\n> In sogut wie jedem anderen Spiel gibt es änliche system, mit dem einzigen unterschied das du Sofort gepunisht wirst, Und dann auch weist wofür.\n\nEigentlich ist das eher bei Riot so. 15 Minuten nach einem Spiel ist ziemlich fix. \n\n>Einfach einführen, Wer ingame \"cancer\" schreibt, kriegt ersmal direkt Life im game den Beschränkten Chat, und nachdem das Spiel vorbei ist, wird er vom Clienten gekickt ne Chatbox popt auf \"24 stunden gesperrt wegen beleidigung\" Dann wüst jeder Spieler wieso man gepunisht wurde. Genau wegen dem einen grund.\n\nMal ehrlich, ich kenne kein einziges spiel, in dem es je so schnell ging. \n\n>Von einem 7 tage 14 tage bann oder sonswas hat NIEMAND was.\n\nDoch. Der 14 Tagebann hat sich als der effektivste aller nicht permanenten Banns erwiesen. Danach haben die meisten Spieler Besserung gezeigt. Während beim 1 Tagesbann Leute den durchaus übersehen könnten. \n\n>Im realife collected dein cheff ja auch nicht monatelang daten, um dich dann nachnem halben jahr rauszuschmeisen\n\nDu hast keine Ahnung, wie aufwändig es ist jemandem Diebstahl in einem Lager so nachzuweisen, dass man ihn fristlos entlassen kann. Meine Chefs wussten schon lange, wer wann was genascht hatte. Als die mal darüber geredet haben wurde aber schnell klar, dass das nicht das Problem ist, sondern die Beweislast vor Gericht. \n\n> (Was garnit legal wäre, da diebstahl/fristloses sachen Zeitnahm nach dem vorfall geahndet werden müssen). Da wirst auch entweder sofort rausgeschmissen, in zwanks urlaubt geschickt oder sonstiges.\n\nBist du Anwalt in dem Bereich oder anderweitig auf Arbeitsrecht spezialisiert? Hörensagen ist meist keine sehr gute Quelle für Rechtsstreitigkeiten. \n\n>Mich würd einfach nur mal intressieren wieso Riot das Rad neu erfinden muss, und nicht einfach nen normales chatfilter system/sofort punish system verwendet wies 99% der anderen hersteller durchziehen? Wo is der haken? Wieso will riot es unöttig kompliziert machen.\n\nGib doch endlich mal anständige Beispiele für die anderen. Das was du letztes mal angegeben hast, hat das nicht belegt. Minecraft Mods und ein Fun-Chatfilter sind nicht das, was du hier beschreibst.","replies":[{"poster":"Janna best Waifu","date":"2017-10-16T18:52:08.920+0000","up_votes":1,"down_votes":1,"body":"\n\n-Jedes MMO hat nen chatfilter den man einstellen kann oder schon eingestellt ist.\n\nUnd man weist nie ob man meckern darf oder nit.\n\n\nBespiel;\nGerade vor 30 min im rannked passiert:\nDie sagen mir ich soll defensiv spielen. \n\nIch schreib \"Cant play more def, then i am sitting in base....\" wette deswegen wurd ich wieder gemeldet. einfach wil ich normal was geschrieben/geantwortet hab.","replies":[{"poster":"Sirrkas","date":"2017-10-16T19:18:47.728+0000","up_votes":4,"down_votes":1,"body":">p.s. zu der sache mit dem anwalt. ich glaub nit das man anwalt sein muss um sowas zu wissen, ich lern sowas zumindens in der schule, weil ich sowas für die abschluss prüfung brauche ;)\n\nArbeitsrecht? Was für eine Schule soll das denn sein? Wie ist das denn bei Diebstahl mit Verjährung. Du meintest ja es muss Zeitnah geahndet werden. Was passiert denn, wenn der Vorfall ein Jahr zurück liegt und das jetzt erst bekannt wird? \n\n>Bei Blizzard undco weis ich nur von screenshots wie die bestrafung da aussieht. Bei LoL brauchts keine 10 tage um direkt son chatbann zu kriegen? Da stell ich mir halt die frage wieso? Mein verhalten kann nich so schlecht sein, sons würd ich woanders auch sanktioniert werden, dem ist aber nicht so. Manchmal hab ich einfach das gefühl bei Riot sitzt irgendjemand der mich nit leiden kann und mir dann ordentlich mit chatsperren zuschmeist oder sonswas.\n\nDu hast deinen Chatlog doch schon geteilt. Dir wurde unmissverständlich erklärt, wofür du die Strafe erhalten hast. Vielleicht nimmt Riot Fehlverhalten einfach ernster als Blizzard das macht. \n\n>Erklärs mir, wie das möglich ist, vielleicht is LoL auch einfach das falsche spiel für mich? Glaube es aber nicht, Damals Saison 1,2,3 als es das Stink normale Tribunal gab, hatte ich NIE probleme. Seitdem das komische IFS da ist. scheint das system was gegen meine persönlichkeit zu haben.\n\nDas liegt daran, dass das Tribunal nie alle Fälle bearbeiten konnte. Das Instantfeedbacksystem ist dazu in der Lage und wenn du jetzt seit Jahren Strafen erhältst, verhältst du dich offensichtlich falsch. Du hast doch schon einen Thread dazu erstellt. Leider ist dir nur wichtig, ob und wann du wieder eine S Marke für Lux erhalten kannst. Die Strafe und dein Verhalten interessieren dich offensichtlich nicht. \n\n>Ich möcht gernmal die meinung von anderen spielern wissen, den es eben so ergeht wie mir. das sie dauernt bestraft werden aber nicht blicken wieso.\n\nDie sind halt leider wie du. Die halten sowas dann für guten Umgangston:\n\n>Luxienna: no idea why u destroy the game fun on purpose.\nLuxienna: ful ad twitch, Tristana with armor and shield?\nLuxienna: nothing\nLuxienna: pointless\n>Luxienna: again a troll enemy\nLuxienna: why u destriyiung game fun on purpose?\nLuxienna: tell me\nLuxienna: tell me Jarvan\nLuxienna: +\nLuxienna: staking armor sure\nLuxienna: go torll someowhere else\nLuxienna: atleast i try to finish my quest\nLuxienna: i still want to know why u destroying game fun on purpose?\nLuxienna: our jax is assisting enemy team\nLuxienna: 4 bot go home tryhards\nLuxienna: VEIGAR\nLuxienna: BOT\nLuxienna: stun?\nLuxienna: drake\nLuxienna: ncie help team\nLuxienna: nope\nLuxienna: not with this veigar and garen\nLuxienna: again no help\nLuxienna: mid and top is a desaster\nLuxienna: and i need midaler or toplaner who protect me\nLuxienna: but they never help\nLuxienna: and?\nLuxienna: i cant support when our tank never help\nLuxienna: support needs tank whop tanks frontline\nLuxienna: no tank. no supp\nLuxienna: reported\nLuxienna: syndra is scripting\nLuxienna: itslife\nLuxienna: Eve u are drunken\n\nDu bist da dauernd negativ. Wirfst den Leuten vor Trolle zu sein, nur weil sie auf Sieg spielen und beschwerst dich dauernd, dass dein Team nutzlos sei. Das ist eben kein normaler Chat. Das stört die anderen, so wie es dich sicher stört, wenn man dir vorwirft, du  wärst ein Troll. \n\nBei dem einen Spiel beschwerst du dich über Jarvan, Twitch, Tristana, Jax und Eve. 3 davon waren deine Gegner und für mich sieht das so aus, als beschwerst du dich nur, weil sie gerade  besser sind als du und gewinnen. Der Jax hat auch nicht getrollt, soweit ich das beurteilen kann. \n\n>Ich möcht einfach nur stink normal das spiel spielen, und spaß haben, ich möcht kein Diamond, ich möcht kein master ich möcht auch kein challanger, Ich möcht spaß haben, und mit gleichgesinnten über das Spiel diskutieren/schreiben/reden können und theoriecrafting zur meta betreiben, Mehr nicht.\n\nDann benimm dich einfach. Schon kriegst du keine Strafen mehr. \n\nEs fehlt ja nicht viel. Du musst nur den milden störenden Chat abschaffen. Dann passiert dir nichts mehr. Das Problem ist, wenn du der Spieler bist, an den ich mich noch vom alten öffentlichen Gentlemenchat erinnere, wird dir das leider nicht gelingen.","replies":[{"poster":"Qbert","date":"2017-10-17T07:27:40.170+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=uvEEzUTP,comment-id=00040001000100000000,timestamp=2017-10-16T19:18:47.728+0000)\n>\n> Arbeitsrecht? Was für eine Schule soll das denn sein? Wie ist das denn bei Diebstahl mit Verjährung. Du meintest ja es muss Zeitnah geahndet werden. Was passiert denn, wenn der Vorfall ein Jahr zurück liegt und das jetzt erst bekannt wird? \n\nIch kann dich beruhigen, ich hatte auch Rechtswissenschaften im Abitur, als Wahlfach =)\n\nDie Annahme von Luxienna ist übrigens Quark, Fristlose Kündigungen wegen bspw. Diebstahl müssen nicht unverzüglich nach Bekanntwerden getätigt werden. Lass dich nicht beirren.^^ Wie du schon sagtest geht es da nämlich um die Beweisfähigkeit.\nAber wer \"Zwanks Urlaubt\" schreibt, dem kann ich wirklich wenig Vertrauen über fachkundige Aussagen entgegen bringen.","replies":[{"poster":"Sirrkas","date":"2017-10-17T08:59:30.442+0000","up_votes":1,"down_votes":1,"body":"Keine Angst, das mit dem beirren ist nicht so leicht. Ich bin das LoL-Forum doch gewohnt. Wobei ich aber die Möglichkeit in Betracht gezogen habe, dass Threory und Praxis das unterschiedlich handhaben. Wobei Recht da dann doch nicht so anfällig dafür ist.\n\nDazu kommt noch die Möglichkeit, dass das hier angesprochene Schulwissen durchaus stark vom aktuellen Stand abweichen kann oder auch komplett falsch ist. Wobei ich aber sagen muss, dass an meiner Schule damals das doch ernst genommen wurde. Aber es gibt immer auch die Chance, dass jemand da was falsch verstanden hat. ","replies":[]}]}]}]}]}]},{"poster":"x Fabii","date":"2017-10-16T13:48:55.550+0000","up_votes":1,"down_votes":1,"body":"Danke für deine ausführliche und sachliche Antwort Gin!\n\nIm Punkt mit den Rahmen ( der Anzeige des Aktuellen Rangs ) sehe ich es trotzdem anders (wie von mir beschrieben). \n\nUnd auch im Punkt der Gesamtleistung wiederspreche ich dir aus meiner Erfahrung, denn ich durfte nach jeder Season wieder in einem Bereich starten der meiner Leistung des Vorjahres entsprach.\n\nEs handelt sich um keine Chatsperre sondern um eine Spielzeitsperre da ist nichts zu machen. \nAber danke für die Information (auch wenn ich es schon wusste)\n\nIch werde mein bestes tun um negatives Verhalten in Zukunft zu vermeiden, und wie gesagt aktzeptiere ich Bestrafungen und sehe mein Fehlverhalten auch ein. Ich finde lediglich einen Bestrafungspunkt \"unpassend\".","replies":[{"poster":"Gin","date":"2017-10-16T13:53:02.817+0000","up_votes":4,"down_votes":1,"body":"Du findest ihn nicht \"unpassend\", das ist der einzige Punkt den du als \"Strafe\" empfindest.\n\nUnd wenn das dafür sorgt dass du dich in Zukunft zurück hältst und dich besserst damit du nächstes Jahr die Belohnungen und den Rahmen kriegst, scheint sie angemessen gewesen zu sein.\n\nIch wünsche dir ansonsten noch viel Spaß und hoffe dass du nächstes Jahr deinen Diamant Rahmen bekommen wirst ^^","replies":[{"poster":"Janna best Waifu","date":"2017-10-16T17:23:52.641+0000","up_votes":1,"down_votes":4,"body":"Das System is untransparent, man brauch ne möglichkeit strafen egal wie alt sie sind nachzusehen und genau zu wissen wieos man gepunisht wurde (änlich wie konto transaktionen sone liste halt)","replies":[{"poster":"legofreak1","date":"2017-10-16T17:30:40.019+0000","up_votes":4,"down_votes":1,"body":"Du musst nur Angst haben gebannt zu werden, wenn du auch die Regeln brichst.\n\nIch behaupte außerdem, dass man nicht so einfach vergisst für 2 Wochen gebannt zu werden, es sei denn, man hat so viele Accounts, dass man die Übersicht verliert oder es ist einem vollkommen egal. In letzterem Fall sollte man sich dann nicht über die Konsequenzen beschweren.","replies":[{"poster":"Janna best Waifu","date":"2017-10-16T17:36:22.595+0000","up_votes":1,"down_votes":3,"body":"Ich hab eigentlich damit gerechnet das ich das Popup krieg \"Du wurdest vor kurzem von mehreren spielern wegen schlechter einstellung gemeldet, bitte denk daran freundlich zu sein\" . Hatte die meldung aber Nicht gekriegt, \nGibs die überhaupt noch?","replies":[{"poster":"legofreak1","date":"2017-10-16T17:47:24.267+0000","up_votes":4,"down_votes":0,"body":"Die Meldungen gibt es recht lange nicht mehr, da diese zu inkonsistent waren. Die Meldungen wurden ohne Überprüfung dann herausgegeben, wenn man häufiger als im Durchschnitt gemeldet wurde. Spieler, welche so gut wie nie gemeldet werden, haben dann zB die Meldung erhalten, nachdem sie aus Frust von einem Premade-Team gemeldet wurden, obwohl sie sich im Spiel regelkonform verhalten haben, während andere Spieler aus ähnlichen Gründen die Nachricht nicht erhielten, obwohl sie angebracht war.\nDass dein Verhalten nicht angebracht war, hat dir in deinem Fall dann hoffentlich die 10-Spiele CR gezeigt. Diese ist nur eine geringe Strafe, lässt sich schnell abspielen und hat noch wenig Einfluss auf loot, sodass sie ihre Funktion als Warnung gut erfüllt.","replies":[]}]}]}]},{"poster":"x Fabii","date":"2017-10-16T14:15:13.768+0000","up_votes":2,"down_votes":1,"body":"Ich stimme nicht zu.\n\nDenn umso mehr ich mich mit diesem Thema befasse, umso mehr wird mir persönlich egal das ich diesen Rahmen nicht habe. \nEr wird den Fakt das ich trotzdem Diamond erreicht habe und  jeder der auf mein Profil schaut dies auch sieht nicht ändern.\n\nMein Ban liegt schon 5 tage zurück und ich hatte in der Zeit schon einige Diskussionen darüber, auch mit dem Support von Riot. \n\nTrotzdem mache ich diesen Post und nehme mir Zeit weil ich es wirklich so ansehe wie von mir geschildert.\n\nIn vollen WISSEN darüber das dies REIN GAR NICHTS an der Tatsache das ich keinen Rahmen bekomme werde ändern wird, denn ich bin nicht auf den kopf gefallen. \n\nAlso vielleicht ist dies ja wirklich meine MEINUNG hierzu und nicht der einzige Punkt den ich als Strafe empfinde.\n\n\n>>>Ich wünsche dir ansonsten noch viel Spaß und hoffe dass du nächstes Jahr deinen Diamant Rahmen bekommen wirst.<<<<\n\nUnd vielen Dank dafür.","replies":[]}]}]}]},{"poster":"Janna best Waifu","date":"2017-10-16T16:55:35.563+0000","up_votes":7,"down_votes":11,"body":"Ich stimme dir voll und ganz zu xFabii leider stößt man hier im forum aber nur auf leuten die dir sagen werden \"gerechtigkeit/richtig so\".\n\nRechne auch damit das du hier im forum gedownvoted wirst, wenn du anderer Meinung bist als die Whiteknights. \n{{sticker:sg-lux}}","replies":[{"poster":"Sirrkas","date":"2017-10-16T18:23:47.188+0000","up_votes":3,"down_votes":1,"body":"Sei ehrlich. Du bist jetzt nur gegen das System, weil du eine CR erhalten hast und deshalb erstmal keine Stufe 7 mit Lux erhalten kannst.\n\n>League of Legends vergisst leider immer gerne das Es nur ein Spiel ist. Und das jeder Mensch emotional ist. Und solange man nicht beleidigt oder sonstiges macht, sollte man anspruch auf Belohnungen haben. Egal ob man den gegner tilted. gg easy schreib, oder outplayed.\n\nWarum kann sich der Flamer dann nicht einfach benehmen, wenn es nur ein Spiel ist?\n\nAußerdem ist der 14 Tagebann keine Lapalie und wird nicht einfach so verteilt. \n\n>Hat nix mit unsportlich zu tun, wenn ich nachdem spiel sag, die runde hat mir kein spaß gemacht. Das is meine meinung, und da ich damit niemanden beleidige oder gegen sonstiges verstoße ist das auch vollkommen ok.\n\nDafür wurde auch noch nie jemand bestraft. \n\n>gewöhn dich halt dran das du hier im forum nicht sachlich diskutieren kanns, sondern sämtliche kritik downgevoted wird.\n\nDu bist leider nicht sachlich. Dann kann man nicht sachlich mit dir diskutieren. Ansonsten würdest du jetzt wohl kaum mit Beleidigungen um dich werfen.","replies":[{"poster":"Janna best Waifu","date":"2017-10-16T19:01:53.584+0000","up_votes":1,"down_votes":0,"body":"ich bin gerne offen für tipps.","replies":[{"poster":"Sirrkas","date":"2017-10-16T19:20:11.178+0000","up_votes":5,"down_votes":1,"body":"Dann lies dir nochmal deinen Thread durch, in dem du dich über die CR beschwerst. Schau dir deinen Chatlog an. Bemerke die ganzen Zeilen, in denen du dich über Mitspieler beschwerst, für die wurdest du bestraft. Und schreib so was nicht wieder.","replies":[]},{"poster":"Qbert","date":"2017-10-17T07:17:26.169+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Luxienna,realm=EUW,application-id=KYnfKGf0,discussion-id=uvEEzUTP,comment-id=000600000000,timestamp=2017-10-16T19:01:53.584+0000)\n>\n> ich bin gerne offen für tipps was ich anders machen kann, das ich nich sanktioniert werde.\n> \n\nLerne dich zu beherrschen und behandle Leute mit Respekt, auch wenn sie dich ohne selbigen behandeln.","replies":[]}]}]},{"poster":"Angel Ayume","date":"2017-10-16T23:28:36.332+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Luxienna,realm=EUW,application-id=KYnfKGf0,discussion-id=uvEEzUTP,comment-id=0006,timestamp=2017-10-16T16:55:35.563+0000)\n>\n\n> Wenn man sich die kommentatoren beim Fußball oder anderen Sportarten ansieht, wird man feststellen das dort ziemlich viel getrashtalkt/gehatet/getriggert wird. Warum? Weils einfach dabei gehört.\n\nIch gucke regelmäßig Fußball, du scheinbar nicht, denn dann wüsstest du, dass das mit dem Haten absoluter Schwachsinn ist, die meisten Kommentatoren sind sehr neutral. Es gibt natürlich den ein oder anderen dem man es anmerkt, dass er parteiisch ist, aber das macht keiner ganz offiziell und sehr offensichtlich. Und Trashtalk oder jemanden triggern ist nicht gerne gesehen, das gehört nicht dazu. Das alles gehört zum unsportlichen Verhalten und ein Spieler kann dafür durchaus eine gelbe Karte bekommen. Ein Spieler der den Schiedsrichter verhöhnt indem er klatscht, weil dieser gepfiffen hat oder dem Schiedsrichter den Vogel zeigt, erhält eine gelbe Karte. Genauso wie ein Spieler eine Karte bekommt, wenn er den Ball nach einem Pfiff einfach weg schießt. \n \n> Im Fußball hört man öfter kommentare &quot;Das war aber ziemlich schlecht gespielt von...&quot; &quot;Nein, da schiest er daneben&quot; &quot;Sehr schwache leistung!&quot; &quot;Das war ja schon fast ein skandal&quot;.\n\nUnd wenn Kommentatoren das machen, dann ist das was vollkommen anderes als wenn das ständig der eigene Mitspieler einem unter die Nase reibt. Die Spieler bekommen die Aussagen der Kommentatoren nicht mit und es ist nunmal Sinn und Zweck eines Kommentators, dass er das Spiel kommentiert und gewisse Aktionen auch beurteilt. Und da gehört nunmal auch die Beurteilung eines bestimmten Spielers zu. \nDas sieht man in jeder Sportart, auch bei LoL ist das so. Die Caster bei LoL reden auch darüber und sagen, dass dies und jenes schlecht war oder der Spieler heute gar nicht gut drauf ist. \nDas machen die Spieler aber nicht untereinander. Was glaubst du was los wäre, wenn der Kapitän seinen Mitspielern ständig unter die Nase reiben würden, wie schlecht der doch heute spielt. Hast du jemals miterlebt, dass ein Spieler von seinem Mitspielern angemault und fertig gemacht wurde, weil dieser einen Elfmeter verschossen hat? Also ich nicht. \nDu musst da schon ein bisschen differenzieren. \nDu kannst nicht sagen, in den Sportarten ist das aber so, wenn es absolut gar nicht der Fall ist. Und das ist wahrscheinlich in keiner Sportart so. Unsportliches Verhalten heißt sicher nicht so, weil es normal ist und gerne gesehen ist. In jeder Sportart wird unsportliches Verhalten irgendwie geahndet. \nUnd wie gesagt, Kommentator und Spieler die sagen, dass dies uns jenes schlecht oder scheiße läuft ist ein himmelweiter Unterschied. ;)","replies":[]}]},{"poster":"manial fly","date":"2017-10-16T13:23:07.305+0000","up_votes":2,"down_votes":1,"body":"Was mich ehrlich gesagt stört ist das jemand der sich im Oktober toxisch verhält praktisch ne härtere Strafe bekommt als jemand der im Juli bestraft wird. \nDer TE hat schon in dem Punkt recht das viele wirklich die ganze Saison darauf hinarbeiten nen bestimmten Rang zu erreichen. Demnach sollten doch eig alle die während der Saison bestraft wurden keine Belohnung erhalten.","replies":[{"poster":"Darkr3sQ","date":"2017-10-16T14:06:56.349+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=manial fly,realm=EUW,application-id=KYnfKGf0,discussion-id=uvEEzUTP,comment-id=0002,timestamp=2017-10-16T13:23:07.305+0000)\n>\n> Was mich ehrlich gesagt stört ist das jemand der sich im Oktober toxisch verhält praktisch ne härtere Strafe bekommt als jemand der im Juli bestraft wird. \n> Der TE hat schon in dem Punkt recht das viele wirklich die ganze Saison darauf hinarbeiten nen bestimmten Rang zu erreichen. Demnach sollten doch eig alle die während der Saison bestraft wurden keine Belohnung erhalten.\n\nDafür wird so etwas rechtzeitig von RIOT angekündigt. Jeder Spieler weiß **vor** dem Stichtag, was für Konsequenzen drohen, wenn er sich nicht an die Regeln hält. Zumal ist es dieses Jahr nicht das erste mal, dass RIOT dies so macht. Von daher weiß eigentlich jeder Spieler, womit er rechnen muss, wenn er es zum Seasonende nicht schafft sich an die Regeln zu halten.","replies":[{"poster":"Lasse Laufen","date":"2017-10-17T11:33:11.154+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=R3sQ,realm=EUW,application-id=KYnfKGf0,discussion-id=uvEEzUTP,comment-id=00020000,timestamp=2017-10-16T14:06:56.349+0000)\n>\n> Dafür wird so etwas rechtzeitig von RIOT angekündigt. Jeder Spieler weiß **vor** dem Stichtag, was für Konsequenzen drohen, wenn er sich nicht an die Regeln hält. Zumal ist es dieses Jahr nicht das erste mal, dass RIOT dies so macht. Von daher weiß eigentlich jeder Spieler, womit er rechnen muss, wenn er es zum Seasonende nicht schafft sich an die Regeln zu halten.\n\nWas ist denn das für ne Ausrede. Stell dir mal vor der Staat würde ankündigen \"Jeder der ab dem 1.12.2017 bis zum 1.1.2018 Straffällig wird, verliert seinen Lohn von diesem Jahr\"\n\nIch will mal einen sehen der das mit dem Argument \"es wurde frühzeitig angekündigt\" verteidigt.\n\nZudem will ich das jeder der nen Bann hatte keine Belohnungen erhält. Die Saison geht das ganze Jahr lang.\n\nOder eben keiner, aber das Ganze nur an einem Datum festzulegen ist meiner Ansicht nach einfach Falsch.","replies":[{"poster":"Darkr3sQ","date":"2017-10-17T11:51:45.341+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheSinged27,realm=EUW,application-id=KYnfKGf0,discussion-id=uvEEzUTP,comment-id=000200000000,timestamp=2017-10-17T11:33:11.154+0000)\n>\n> Was ist denn das für ne Ausrede. Stell dir mal vor der Staat würde ankündigen &quot;Jeder der ab dem 1.12.2017 bis zum 1.1.2018 Straffällig wird, verliert seinen Lohn von diesem Jahr&quot;\n> \n> Ich will mal einen sehen der das mit dem Argument &quot;es wurde frühzeitig angekündigt&quot; verteidigt.\n> \n> Zudem will ich das jeder der nen Bann hatte keine Belohnungen erhält. Die Saison geht das ganze Jahr lang.\n> \n> Oder eben keiner, aber das Ganze nur an einem Datum festzulegen ist meiner Ansicht nach einfach Falsch.\n\nDen Lohn, wenn Du arbeitest, verdienst Du Dir. Von daher ist dieser Vergleich nicht wirklich stimmig. Bei LOL bekommst Du ja auch nichts weggenommen, was Du Dir verdient hast. Die MMR und die ELO behältst Du ja. Auch kann man nachschauen, auf welchem Rang man abgeschlossen hatte.\nWas entfällt sind zusätzliche Belohnungen wie den Rahmen oder der Skin.\n\nNormalerweise sollte es so sein, dass jeder, der eine Strafe erhalten hatte, keine Anrecht mehr auf diese Belohnungen bekommen sollte. Allerdings geht RIOT hin und versucht - auch bei toxischen Spielern - eine Motivation zu bringen sich zu bessern. Dies machen sie, indem sie eben diesen Stichtag setzen -  den es übrigens jedes Jahr gibt - und daran dann den Erhalt der Belohnung - wie schon geschrieben ist der Rahmen und der Skin nichts anderes - daran fest machen.","replies":[{"poster":"Lasse Laufen","date":"2017-10-17T12:04:42.544+0000","up_votes":1,"down_votes":0,"body":"Und in welchem Zusammenhang steht der Versuch von Riot \"toxische Spieler sollen sich verbessern\" und der zusätzlichen Bestrafung im Einklang? Also wenn ich wegen ner Strafe keine Belohnungen bekommen würde, aber der andere für die gleiche Strafe schon, nur weil er 1 Tag früher die Strafe kassiert hatte, hätte ich keine Lust mich zu verbessern.\n\nAber das liegt ja im Auge des Betrachters.","replies":[{"poster":"legofreak1","date":"2017-10-17T12:38:45.515+0000","up_votes":2,"down_votes":0,"body":"RIOT möchte, dass toxische Spieler keine Belohnung erhalten, wohingegen reformierte Spieler - also diejenigen, welche toxisch waren aber sich deutlich gebessert haben - wieder die Möglichkeit erhalten. Wird ein Spieler am Anfang des Jahres für 2 Wochen gebannt worden und hat dieser es bis zum Ende der Season geschafft nicht gebannt zu werden, kann man davon ausgehen, dass dieser Spieler sich gebessert hat, nicht mehr toxisch ist und damit seine Belohnung erhalten sollte. Toxische Spieler hingegen sollen keine Belohnung erhalten und haben in diesem kurzem Zeitraum einfach keine Möglichkeit mehr, unter Beweis zu stellen, sich zu bessern.\nhttp://en.volu-eu.org/pbkb_general_user_view.php?art=18\nDazu kommt auch, dass es während des Seasonendes vermehrt zu toxicity kommt. Ich vermute (!), dass der Druck eine bestimmte Leistung zu erreichen und dies u.U. nicht zu schaffen hier keine unerhebliche Rolle spielt. Es soll damit also fair-play verstärkt durchgesetzt werden. Spieler, welche gegen Ende der Season rücksichtslos werden und flamen, um ihre Ziele zu erreichen, sollen für ihr Verhalten nicht belohnt werden und zusätzlich sollen fair-spielende Spieler extra geschützt werden.","replies":[]},{"poster":"Darkr3sQ","date":"2017-10-17T12:37:34.049+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheSinged27,realm=EUW,application-id=KYnfKGf0,discussion-id=uvEEzUTP,comment-id=00020000000000020000,timestamp=2017-10-17T12:04:42.544+0000)\n>\n> Und in welchem Zusammenhang steht der Versuch von Riot &quot;toxische Spieler sollen sich verbessern&quot; und der zusätzlichen Bestrafung im Einklang? Also wenn ich wegen ner Strafe keine Belohnungen bekommen würde, aber der andere für die gleiche Strafe schon, nur weil er 1 Tag früher die Strafe kassiert hatte, hätte ich keine Lust mich zu verbessern.\n> \n> Aber das liegt ja im Auge des Betrachters.\n\nEs ist keine zusätzliche Strafe. RIOT will dahingehend die Motivation schaffen, dass sie sagen: Wenn Du Dich jetzt besserst, bekommst Du auch die Season-Rewards. Allerdings muss auch irgendwann einmal Schluss damit sein. Und hier sagt RIOT - wie jedes Jahr aufs Neue - 3 Monate vor Season-Ende ist dieser Stichtag. Wenn Ihr Euch danach nicht benehmt, bekommt Ihr keine der Belohnungen.\nWie gesagt: Es ist jetzt nichts, was RIOT mal so und mal so macht. Es ist etwas jedes Jahr Wiederkehrendes. Ich meine klar sollte es eigentlich die gute Erziehung nicht notwendig machen, aber trotz allem scheint es halt Personen zu geben, die sich im Internet nicht benehmen können und vergessen, dass sie wildfremde Menschen durchaus beleidigend gegenüber treten.","replies":[]}]}]},{"poster":"BlackAjani","date":"2017-10-17T11:49:10.806+0000","up_votes":1,"down_votes":0,"body":"gebe ich dir recht. Regelbruch -> Strafe für alle.\nJedoch glaube ich das du dich damit zu sehr aufhängst. Denn es ist halt besonders doof meiner Ansicht nach, wenn er wirklich so lange daraufhin gearbeitet hat, dann hat er es geschafft und dann kommen die Ankündigungen. Und man bringt es dann noch fertig sich selbst das Bein zu stellen, obwohl er ja quasi im Ziel stand.","replies":[{"poster":"Angel Ayume","date":"2017-10-17T12:24:00.183+0000","up_votes":1,"down_votes":0,"body":"Zudem ist es bisher jede Season so gewesen, dass bei einer Strafe am Ende der Season die Belohnungen verwehrt werden. Er spielt lange genug LoL um genau das zu wissen. Es kommt also absolut nicht unerwartet.","replies":[]},{"poster":"Qbert","date":"2017-10-17T11:53:35.463+0000","up_votes":1,"down_votes":0,"body":"Aber er ist doch selber Schuld.\nEgal wie lange und hart man für etwas arbeitet, Regelbrüche müssen ungeachtet dessen geahndet werden; in voller Härte.","replies":[{"poster":"BlackAjani","date":"2017-10-17T12:01:21.043+0000","up_votes":1,"down_votes":0,"body":"Ja natürlich, falls mein vorheriger Text einen anderen Eindruck vermittelt hat = war unbeabsichtigt. Wollte nur mal zusammenfassen, wie ich den Flame in diesem Fall halt überhaupt nicht verstehen kann. Selbst wenn es mal kacke läuft.","replies":[]}]}]},{"poster":"Qbert","date":"2017-10-17T11:51:38.995+0000","up_votes":1,"down_votes":0,"body":"Da gebe ich dir uneingeschränkt recht.\nJeder der gebannt wurde, sollte für diese Saison keine Belohnung erhalten. Wie man dann die CR handhabt, müsste man überlegen ... vielleicht eine geminderte Belohnung oder so.\n\nWird Riot nur sicherlich nicht machen, da sie natürlich daran interessiert sind, so viele Spieler(Geldgeber) wie möglich zu haben. Jeder der meint \"bla die sind ja so sensibel\" würde aufhören zu spielen(oder dazu gezwungen werden, via Bann^^).","replies":[]}]}]}]},{"poster":"BlackAjani","date":"2017-10-16T13:09:47.488+0000","up_votes":2,"down_votes":1,"body":"Warum fängst du dann kurz vor dem Ziel das flamen an? \nWarst du zu besessen vom climben oder woran liegt es?","replies":[{"poster":"x Fabii","date":"2017-10-16T13:21:15.875+0000","up_votes":2,"down_votes":0,"body":"Ich habe mich Fehlverhalten. Und ich weiß das.  \n\nAber das ist nicht der Punkt dieser Forum-Diskussion","replies":[{"poster":"BlackAjani","date":"2017-10-16T13:31:13.745+0000","up_votes":2,"down_votes":0,"body":"Ja ich finde es auch nicht korrekt, dass jemand der am 01.08 einen 2 Wochen Bann bekommen hat, nicht so bestraft wird, wie du es wirst. Jedoch war es dir doch selbst bewusst, das es kurz vor Ende der Season ist und vor ca. 10 Tagen wurden erst die Preise vorgestellt und die, die keine erhalten. Zum Schluss möchte ich noch sagen, dass wir zum Urteilen auch den Chatlog bräuchten, da man so schwer urteilen kann.","replies":[]}]}]},{"poster":"Qbert","date":"2017-10-17T07:18:51.981+0000","up_votes":3,"down_votes":1,"body":"Auch zu dir:\nHör auf zu weinen und lerne dich zu benehmen. Im wahren Leben bekommst du auch keine Medaille, nur weil du \"erst 1x in deinen 20 Jahren Lebenszeit jemanden beklaut hast\".\nLeb mit der Strafe wie ein Erwachsener, statt dich darüber zu beschweren, dass du bestraft wirst.","replies":[]},{"poster":"Oriius","date":"2017-10-16T13:30:57.010+0000","up_votes":5,"down_votes":4,"body":"Finde die Bestrafungen absolut gerechtfertigt und je nach Verstoß sogar für zu minimal.\n\nWer sich nicht an die Regeln hält sollte sich nicht über die Bestrafungen beschweren denn schließlich spielst du bereits seit 6 Jahren und weißt dementsprechend an was für Regeln du dich zu halten hast. Dafür sind Bestrafungen eben da damit sie einen ärgern. Finde es allerdings akzeptabel wenn die belohnungssperren wesentlich schneller bzw durch aktives zeigen von sportsgeist noch wieder aufgehoben werden können . bsp 50 Games ohne Report oder oder oder","replies":[{"poster":"x Fabii","date":"2017-10-16T14:01:10.895+0000","up_votes":2,"down_votes":3,"body":"Ich gebe dir in dem Punkt das ich die Regeln gut genug kennen sollte vollkommen Recht.\nAber es gibt noch eine andere seite dieser von dir genannten Ansicht. \n\nWir alle sind nur Menschen.  \nDas ein Mensch sich in 6 jahren bei einer fast täglichen Tätigkeit immer Perfekt und Fehlerfrei verhält, ist äußerst unwahrscheinlich. \n\nAußerdem akzeptiere ich mein Fehlverhalten ich weiß das ich nicht Unschuldig bin. Und weitere Kommentare in diesem Bezug werde ich nicht mehr beantworten.\n\nRahmensperren ja oder nein.  \nDas ist die Frage, nichts anderes.","replies":[{"poster":"Allerbester Biss","date":"2017-10-16T15:32:02.360+0000","up_votes":2,"down_votes":3,"body":"Umm und wieso schaffen es so viele seit 7 Jahren kein mal gebannt zu werden?","replies":[{"poster":"Qbert","date":"2017-10-17T07:20:24.894+0000","up_votes":2,"down_votes":1,"body":"wir sind alles dumme Mitläufer des Systems!\nHast du nicht die Kommentare gelesen? Wir im Forum sind alle blöde Schäfchen, die nur Riot verteidigen!\n\n*mäh*","replies":[{"poster":"Sirrkas","date":"2017-10-17T08:57:14.395+0000","up_votes":1,"down_votes":1,"body":"Schafe sind mächtig. Wo wäre Blizzard bloß, ohne Schafe?","replies":[{"poster":"Qbert","date":"2017-10-17T09:01:44.973+0000","up_votes":2,"down_votes":1,"body":"Hallo?\nDAS Spiel in dem Schafe mächtig sind, ist ja wohl immer noch Age of Empires 2! :D","replies":[{"poster":"BlackAjani","date":"2017-10-17T09:25:35.488+0000","up_votes":1,"down_votes":1,"body":"Nope,\n\neindeutig ->Worms!!!\n\nhttps://youtu.be/k8-JVn37nJk","replies":[{"poster":"Qbert","date":"2017-10-17T09:29:43.155+0000","up_votes":2,"down_votes":1,"body":"Lol, du hast nie AoE gespielt, hm?! \n\nIn AoE 1 und 2 waren die superkrasse und schnelle Nahrungslieferanten, das war weit vor Worms! :O\nWobei... kurz Dr. Google befragt:\nWorms 2 - 1998 (EU)\nAoE  - Oktober 1997\n\nAlso, AoE hatte die OPness von Schafen schon früher entdeckt und gefördert!","replies":[]}]}]}]}]}]}]}]}]}