{"poster":"SquinoX","date":"2016-11-03T07:15:28.596+0000","title":"EU/NE Lag's","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello...I will post this here because i can't post on forum's anymore idk what's happening\r\n5 time is go on League of Legends Player Support to ask someone to help me with LAG...And they say 'your buffering is high please turn off (Torrent,Skype,Curse,TS......) and that's all send them network analysis.... And i'm just like ok..\r\nEverything is turned off,every time i go to play LoL all programs are turned off (Skype,torrent,curse)..I say to them 'everything is turned off all time,I leave torrent just when i'm downloading some stuff and then i turn that off too.\r\nToday i played match and poof 105 ms :) instead of 29 ms.And 5 day's it's normal and 10 day's is bad :).\r\nI restart my network,my pc nobody is on the wifi and 105 ms why?\r\nwhen i run speed test for my network everything is normal i call my network operators and they say nothing's wrong with your network it's working good.What now who is r%%%%%ed here?!?!?\r\n{{sticker:zombie-brand-mindblown}} {{sticker:zombie-brand-facepalm}} \r\n \r\nI got bored all time i'm on Player support and trying to get help or to find what is causing game to lag..\r\nAnd please don't tell me turn off Torrent,Skype or something like that because everything is turned off.\r\nThank You\r\n(Sorry if my english is bad).\r\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"LostFr0st","date":"2016-11-03T18:29:58.941+0000","up_votes":1,"down_votes":0,"body":"Hi OP, I had a similar problem with my network~ 6 months ago.\n\nIf support hasn't asked you to do so already, I highly recommend running a tracert https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs and attaching it to your support ticket.  With that info you'll be able to tell exactly at which step on the way to the server the most trouble is coming from.\n\nNetwork operators will almost always shove the blame on someone else until you can prove it to them that it's on their end.\n\nFor me it was that the modem my isp gave me was super outdated (where I live we can't connect our own modems; need to use the isp's) so after I got evidence that it was the problem they replaced it with a newer model and it fixed the problem.\nI unfortunately don't know what address you need to ping for a tracert on EUNE :(\nYou'll have to find that out first.","replies":[{"poster":"SquinoX","date":"2016-11-04T07:01:23.023+0000","up_votes":1,"down_votes":0,"body":"Thank you for answer but i did everything there you said \n{{sticker:zombie-nunu-tears}}","replies":[{"poster":"LostFr0st","date":"2016-11-04T07:07:57.623+0000","up_votes":1,"down_votes":0,"body":"You didn't see anything fishy in the tracert? QQ\nand it was a tracert you did, not a speed test right?","replies":[{"poster":"SquinoX","date":"2016-11-04T08:15:09.563+0000","up_votes":1,"down_votes":0,"body":"Bro i'm not that  stupid {{sticker:slayer-jinx-wink}}","replies":[{"poster":"LostFr0st","date":"2016-11-04T22:57:12.961+0000","up_votes":1,"down_votes":0,"body":"I didn't mean it that way...\n{{sticker:zombie-nunu-tears}} {{sticker:zombie-nunu-bummed}}","replies":[]}]}]}]}]},{"poster":"Porocles","date":"2016-11-03T17:55:05.844+0000","up_votes":1,"down_votes":0,"body":"If these lag spikes are sudden, you run a [log reader](https://support.riotgames.com/hc/en-us/articles/209765743-Connection-Troubleshooting-Log-Reader) for a better break down of your connection as well as any packet loss.  The results should also provide some troubleshooting steps.  It does sound like you are having a network problem maintaining a connection, so in general I recommend going over each step of the [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to tune things up.  Hope that helps!","replies":[{"poster":"SquinoX","date":"2016-11-04T07:02:35.756+0000","up_votes":1,"down_votes":0,"body":"Thank you for answer i'll do everything u said","replies":[]}]}]}