{"poster":"OnPoint","date":"2017-08-06T03:14:47.804+0000","title":"¿Quién Más Tiene Lag?","subforum":"Problemas Técnicos","up_votes":22,"down_votes":0,"body":"Yo casi siempre jugaba con 50ms, dentro de lo com&uacute;n era algo bueno, al caso hace casi 1 semana y medio o 2 estoy jugando entre 100 ms y 150ms, no es tanto pero lo noto, que puede ser, el servidor o los paquetes de conexiones, o como se digan, del los proveedores de internet.\r\n PD: Soy de Argentina.","replies":[{"poster":"PasoPackXHonores","date":"2017-08-06T04:01:50.093+0000","up_votes":4,"down_votes":0,"body":"Siempre juego con 70/80 aproximadamente. Eso ahora solo me pasa de día. De noche me tira 170/190 (? una cagad.. el server la verdad.","replies":[]},{"poster":"Rinnegän","date":"2017-08-06T04:01:46.515+0000","up_votes":3,"down_votes":0,"body":"Soy de Argentina. Tengo este problema hace una semana o más. Tengo dos internets diferente, en uno juego con 31 y en otro con 50. Tengo 80+ y 100+ respectivamente con los dos casi todo el dia. Insoportable. Es ping estable y a un amigo que tiene otro proveedor de internet le pasa lo mismo siempre que me pasa a mi... Espero hagan algo al respecto, manden tickets al soporte a ver si nos toman en cuenta","replies":[]},{"poster":"FINGERTIP","date":"2017-08-06T03:59:55.497+0000","up_votes":3,"down_votes":0,"body":"Me está pasando lo mismo últimamente, a partir de cierta hora 20:00 hs aproximadamente, el ping de la nada sube y se queda en los 118 o 110 permanentemente. La verdad que es muy incómodo e injugable debido a que la mayoría está jugando con 20 o menos, ya hace más de una semana y media que esto pasa y ni siquiera hay un cartel o algo que nos saque las dudas o nos avise que va a empezar a subir el ping de una partida a la otra, me gustaría que pronto lo arreglen. Soy de Argentina también.","replies":[{"poster":"miXergaMes","date":"2017-08-06T20:24:04.212+0000","up_votes":1,"down_votes":0,"body":"Probaste eliminar el reservado de ancho de banda de QoS de windos?, suele ser del 30% de la limitacion de datos de red por defecto. Saludos bro :)","replies":[]}]},{"poster":"GankingaLoL","date":"2017-08-06T23:15:14.378+0000","up_votes":2,"down_votes":0,"body":"57 ms ejecutando 500 ping a 500 ip de diferentes lugares de chile cubriendo todo el territorio, con pocos, algunos y muchos saltos intermedios para probar la variacion (Speedy). Pero es el isp eh? :)","replies":[]},{"poster":"Rasmus","date":"2017-08-06T03:50:52.643+0000","up_votes":2,"down_votes":0,"body":"Me agrego, pero voy a ser mas especifico.\nYo usualmente juego a la mañana mas o menos despues del mantenimiento hasta las 12, donde siempre poseo un ping de 47 clavado sin subidas ni bajadas, pero cuanto mas tarde se va haciendo peor es el ping llegando a los 90 en tarde- noche y recien cuando el sv recibe mantenimiento vuelve a los 47 ms. \nRealmente no es problema del proveedor, junto a un par de amigos hemos hecho 5 partidas con arnet, telecentro, fibertel y demas compañias chilenas sacando (aunque no tan exagerado) una diferencia de entre 30 a 50 ms entre la mañana y la noche delatando los problemas con los servidores que hay. Recien habiamos salido de un problema de conexion y volvemos a otro, por que en vez de sacar animaciones de lo obvio trabajan realmente en los servidores que ni derrota evitada mandan?\nAtte\nMaxVairoleto","replies":[]},{"poster":"Kawatori","date":"2017-08-06T03:47:05.230+0000","up_votes":2,"down_votes":0,"body":"Que esperas si el sv esta hecho de escarbadientes","replies":[]},{"poster":"talkcrazy","date":"2017-08-07T02:48:37.565+0000","up_votes":1,"down_votes":0,"body":"me encanta como riot nos \"ayuda\" dándonos respuestas acabo de leer un post diciendo si xayah se embaraza tiene huevo o un bebe y un rioter fue el primero que respondio ese vendria ciendo uno de los primeros problemas para arreglar  tendrian que poner mas  gente competente a trabajar","replies":[]},{"poster":"HS xEmIlIaNoF","date":"2017-08-07T00:59:13.997+0000","up_votes":1,"down_votes":0,"body":"Yo soy de arg y tambien a partir de cierto horario me sube a 115 de ping cuando antes tenia 55","replies":[]},{"poster":"Rolandfc","date":"2017-08-06T23:31:48.475+0000","up_votes":1,"down_votes":0,"body":"Esta  claro  que  es  el  server  quien  tiene  problemas  pero  como  siempre  RIOT  se  desligara  de  su  responsabilidad  y  culpara  a  nuestros  probeedores  del  problema  ,  soy  de  Valparaiso  en  Chile  .","replies":[]},{"poster":"Kobalth","date":"2017-08-06T23:02:47.687+0000","up_votes":1,"down_votes":0,"body":"lo mismo pase de 45-50 ms a 110-125 ms constantes, pero no pasa durante todo el día, hay algunos horarios en los que anda normal.","replies":[]},{"poster":"El Raw","date":"2017-08-06T20:23:10.938+0000","up_votes":1,"down_votes":0,"body":"yo tambien  hace 1 semana y media mas o  juego hasta con 200 de ping  XD  es un poco molesto pero no todas las conexiones de internet son iguales creo que influye mucho en el proveedor arnet por ej es una m...... 24/7","replies":[]},{"poster":"Alex098","date":"2017-08-06T19:36:25.045+0000","up_votes":1,"down_votes":0,"body":"ami se me corta a veces y me sale reanudando conexion, tambien me tiene arto jugar asi. Nose que pasa con el servidor de riot y speedy y demas","replies":[]},{"poster":"Áriman","date":"2017-08-06T17:50:38.340+0000","up_votes":1,"down_votes":0,"body":"yo tengo fibertel a 18 megas, y de tirarme 39 ms en las ultimas semanas me tira 110-150 con subidas de hasta 500 o desconexiones directamente, mi internet no es ya que anda excelente, lo tengo por cable directo y en mi familia nadie usa, asi que gg server","replies":[]},{"poster":"Angus IV","date":"2017-08-06T17:26:07.066+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa también.. juego con 40/50MS pero últimamente estoy teniendo 100/120MS y ya comprobé reiteradas veces que NO es mi Internet, también le pasa a algunos amigos los cuales tienen distinto proovedor de Internet así que definitivamente es el server.. con la plata que he invertido en RP por lo menos quisiera jugar en un sv \"estable\" pero bueno.. calculo que riot nos ve como un número y no como clientes para después callarnos con un icono o cosas así","replies":[]},{"poster":"Cârlømâgnø","date":"2017-08-06T16:59:31.252+0000","up_votes":1,"down_votes":0,"body":"Ami por ratos me tira 60ms y de la nada me salta de 500ms a 2500ms. Es desesperante, y estoy muy seguro que mi proveedor no es el problema.\nhttps://ibb.co/c7Y96a","replies":[]},{"poster":"Shiroi Tsuki","date":"2017-08-06T16:00:58.513+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa que cuando juego a la noche en vez de tener 60 ms a 80ms tengo de 100 ms a 200 ms\ny también soy de argentina {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Deucalion","date":"2017-08-06T15:09:21.201+0000","up_votes":1,"down_votes":0,"body":"Hola gente recuerden que en argentina se nos corto el cable submarino de las toninas y todas las compañias de red estan tirando esos ms les recomiendo solo jugar bot hasta que el problema se solucione dentro de 1 o 2 semanas parece que fue un daño bastante grande","replies":[]},{"poster":"Yunox","date":"2017-08-06T14:08:56.624+0000","up_votes":1,"down_votes":0,"body":"Hay mucha gente con este problema.\n\nPor lo general se juega bien hasta las 19:00 hs y alrededor de la 1 AM vuelve a su estabilidad normal.\n\nProblema: De ms estables a +100.\n\nSolución: Cacería indiscriminada de alpacas","replies":[]},{"poster":"denis12345","date":"2017-08-06T13:22:28.737+0000","up_votes":1,"down_votes":0,"body":"yo tambien tengo lag , casi siempre 100 pero ahora se me aumenta a 500 y soy el unico usando internet , es raro{{champion:99}} {{summoner:1}}","replies":[]},{"poster":"Zemper5","date":"2017-08-06T05:34:12.091+0000","up_votes":1,"down_votes":0,"body":"Yo siempre juego con 55 ms fijos y esta semana comencé a tener los mismos problemas que estuve leyendo por el foro, ahora que quiero jugar tengo 115 ms... No sé que habrá pasado pero ojalá lo puedan arreglar. {{summoner:4}} {{summoner:3}}","replies":[]},{"poster":"ImLeeSmurfing","date":"2017-08-06T04:45:36.169+0000","up_votes":1,"down_votes":0,"body":"Yo soy de uruguay y es injugable la pta madre ademas no baja solo se queda de 120 a 180","replies":[]},{"poster":"ArgNachox","date":"2017-08-06T03:53:49.780+0000","up_votes":1,"down_votes":0,"body":"Yo igual, entre al foro para ver si alguien más tenía algún problema similar, generalmente juego con 56 de ms ... En estos momentos tengo subidones de 130-150ms y bajas a 90 ms (NO baja a menos de 90). Soy de Argentina.","replies":[]},{"poster":"Exsubasa07","date":"2017-08-06T03:32:58.216+0000","up_votes":1,"down_votes":0,"body":"Me vengo a sumar, generalmente juego en 60ms y ahora se clava en 115 y sube hasta 300 y baja a 115 de nuevo.\n\nTambién soy de Argentina.","replies":[]},{"poster":"ELM Emperor","date":"2017-08-06T03:22:12.959+0000","up_votes":1,"down_votes":0,"body":"Yo tambien estoy teniendo lag en estos momentos, 160 ms no se que sera, y tambien soy de argentina!","replies":[]}]}