{"poster":"AporroGrantz","date":"2015-07-12T01:27:41.331+0000","title":"campeones que merecen buff","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"creo que hay campeones que quedan muy atras de otros, que merecen buff a mi opinion son estos {{champion:30}} {{champion:143}} {{champion:4}} {{champion:6}} {{champion:26}} {{champion:38}} , que opinan? si quieren agregar  a alguno comentenlo xD","replies":[{"poster":"kique1","date":"2015-07-12T01:40:58.506+0000","up_votes":3,"down_votes":0,"body":"De todos los que dijiste, creo que ninguno lo amerita xD\n\nDeberían hacerle un rework a {{champion:44}} ya que no lo coge ni dios.","replies":[{"poster":"come vidas","date":"2015-07-12T02:00:05.991+0000","up_votes":1,"down_votes":1,"body":"el rework despues de los de gp y miss es alistar","replies":[]}]},{"poster":"Kyousuke","date":"2015-07-12T01:55:45.006+0000","up_votes":2,"down_votes":0,"body":"de esos ninguno merece buff XD tf en un stun te explota urgot esta rotisimo pero mal, kassadin ya lo nerfearon y buffaron XD","replies":[{"poster":"come vidas","date":"2015-07-12T01:59:36.970+0000","up_votes":1,"down_votes":1,"body":"y zyra esta fuerte como karma en mid XD","replies":[]}]},{"poster":"oh95","date":"2015-07-12T11:14:46.621+0000","up_votes":1,"down_votes":1,"body":"TF debe estar entre los mejores mid laners actualmente, los otros quizá pero con Karthus por ejemplo se puede crear una aberración","replies":[{"poster":"AporroGrantz","date":"2015-07-12T14:41:44.638+0000","up_votes":1,"down_votes":1,"body":"tf de los mejores mid? que juego  jugas vos? le esquibas todo, pega poco, poca movilidad, ulti inutil en fase de linea","replies":[{"poster":"kique1","date":"2015-07-13T19:30:11.660+0000","up_votes":1,"down_votes":0,"body":"Cómo esquivas un target stun capo???","replies":[{"poster":"AporroGrantz","date":"2015-07-13T23:21:06.186+0000","up_votes":1,"down_votes":0,"body":"una estupides, te alejas cuando este eligiendo la carta","replies":[{"poster":"kique1","date":"2015-07-14T02:22:54.805+0000","up_votes":1,"down_votes":0,"body":"Claro, siempre vas a estar fuera de rango, y él nunca llevará flash...","replies":[]}]}]},{"poster":"oh95","date":"2015-07-13T02:11:14.354+0000","up_votes":1,"down_votes":0,"body":"Linea muy safe, pasiva que le da oro que si quedas un poco atrás de farm te deja igualado con el otro mid, sustain de mana, muy buen wave clear, stun de 2 segundos, una presión de mapa impresionante, ulti de gran rango, y muy buen daño una vez itemizado, tranquilo que hace un tiempito no era un top 5 de mid, pero ahora con los cambios y nerfeos a otros mid quedó muy bien y más con esos junglas que estan con el devourer por lo que no recibe mucha presión en la linea del jungler.","replies":[]},{"poster":"Immeryse","date":"2015-07-12T15:41:48.041+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AporroGrantz,realm=LAS,application-id=v7qsfXsE,discussion-id=o2zkdBkA,comment-id=00040000,timestamp=2015-07-12T14:41:44.638+0000)\n>\n> tf de los mejores mid? que juego  jugas vos? le esquibas todo, pega poco, poca movilidad, ulti inutil en fase de linea\n\n*esquivás\nDe hecho esa ulti \"inútil\" te puede carrear una partida fácilmente. Solo que no lo va a sufrir la línea de mid, sino las otras. Es mas o menos como Shen, es raro que gane una línea, pero bien jugado(De esos Shen que saben cuando tirar un ulti) con su ulti carreas a las otras líneas.\n\nY los dos tienen esa facilidad de irse a hacer splitpush y llegar a una pelea de equipo sin necesidad de hacer TP en cuanto tienen disponible su ulti, lo que en general obliga a alguien del equipo contrario(sino a todos) a replegarse para defender.","replies":[]}]}]},{"poster":"FayelZ","date":"2015-07-13T02:20:11.811+0000","up_votes":1,"down_votes":0,"body":"Karthus? Ese man saca una banda, hay que tener manos para usar a ese porque haces mas daño cuando le pegas a 1 a la vez con la Q, es mas para mi ese Karthus necesita un nerf imposible de roto el early ese.\nDespues Twisted Fate y Kassadin no necesitan un buff, pero tampoco un nerf, ahora mismo estan totalmente balanceados... espero que a esos 2 no los toquen hasta el año que viene, o hasta que venga un campeon nuevo super desbalanceado\nPor los demas nose, jamas los use :v","replies":[]},{"poster":"nahuelmazo","date":"2015-07-12T03:42:03.196+0000","up_votes":1,"down_votes":1,"body":"par ami twisted, zilean, urgot y khartus estan bien, a zilean lo mejoraron con las bonmbas, es mas dificil usarlos nomas jajajaja los otros no los use asi que no se","replies":[]},{"poster":"arondightFTW","date":"2015-07-12T01:34:26.512+0000","up_votes":1,"down_votes":3,"body":"blitz, la W no sirve para nada.","replies":[]}]}