{"poster":"S7AkaliWasFunner","date":"2017-07-31T14:55:45.490+0000","title":"Kiste bekommen, trotz Wartezeit ?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Servus,\r\nIch habe ebend mal meine zweite runde im Flex Ranked mit Warwick gespielt.\r\nZuvor nur gegen die KI oder in Normals, da ich nicht zu denen geh&ouml;re, die sich sofort mit einem neuen Champ in ein Ranked Game rein st&uuml;rzen.\r\n(Ist aber ein anderes Thema).\r\nDas Spiel ging in der 31. Minute mit einem 9/1/7 und 138 Farm + Sieg aus.\r\nDa ich ein S- bekommen habe, habe ich eine ganz Normale Hextech Kiste bekommen.\r\nWitziger weise habe ich vor 3 tagen aber schon eine bekommen.\r\nSprich:\r\nIch m&uuml;sste noch 4 Tage warten.\r\nDa ich das Spiel jedoch auf Englisch habe und zu schnell auf &quot;ok&quot; Geklickt habe, konnte ich nicht nachvollziehen, weshalb ich die Kiste bekommen habe.\r\nHat jemand evtl schon mal das gleiche erlebt?\r\nIch m&ouml;chte mich hier nat&uuml;rlich nicht beschweren ;P , jedoch w&uuml;rde mich es mal Interessieren, wieso ich diese bekommen habe.\r\nIch hoffe, mir kann das mal einer erkl&auml;ren :D","replies":[{"poster":"Wekra","date":"2017-07-31T15:34:54.728+0000","up_votes":1,"down_votes":0,"body":"Wieso solltest du nur alle 7 Tage eine Kiste bekommen?\n\nDu kannst 4 im Monat bekommen..das ist zwar im Schnitt 1/Woche aber du kannst auch in der ersten Woche die 4 bekommen","replies":[{"poster":"S7AkaliWasFunner","date":"2017-07-31T16:05:12.311+0000","up_votes":1,"down_votes":0,"body":"Es steht ja klar und deutlich da, nächste Truhe, in so und so vielen Tagen verfügbar, daher bin ich davon ausgegangen, das man jede Woche nur eine Bekommen kann.\nAber danke für die Info.\nDann weis ich ja jetzt bescheid.","replies":[{"poster":"OT Riku","date":"2017-07-31T20:01:39.740+0000","up_votes":1,"down_votes":0,"body":"Die Truhen können sich auch stacken, sprich wenn du 4 Wochen keine bekommen hast, kannst du theoretisch nach 4 Games 4 Truhen erhalten natürlich nur mit S und 4 verschiedenen Champions.","replies":[{"poster":"S7AkaliWasFunner","date":"2017-08-04T17:12:10.048+0000","up_votes":1,"down_votes":0,"body":"Okey, danke^^\nWar nur leicht verwundert.\nIch mein wenn da steht \"Nächste Truhe in 6 Tagen\" wundert man sich leicht.^^\n\nWie ist das eigentlich wenn keine Truhen mehr übrig sind ?\nHat man dann erst in der nächsten Season neue, oder füllen die sich automatisch wieder auf?","replies":[]}]}]}]}]}