{"poster":"Apokàlypsis","date":"2017-01-02T15:35:29.104+0000","title":"Set oggetti personalizzato","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"So gi&agrave; che nel nuovo client questa funzione non esiste ancora e verr&agrave; inserita solo nelle prossime patch ed &egrave; per questo che per modificare i miei vecchi set sono entrata nel vecchio client. Rientrata poi nel nuovo ho notato in partita che non mi aveva modificato nulla e, in un match in cui ho utilizzato un champion in rotazione gratuita e che non possedevo, mi visualizzava addirittura dei vecchissimi set di mesi e mesi fa (e che teoricamente non dovrebbero esistere pi&ugrave; dato che erano quelli creati quando ho cominciato a giocare a lol). \r\nSono poi rientrata a controllare nel vecchio client e le modifiche che avevo apportato e salvato erano ancora tutte l&agrave;!\r\nPer sistemare i set devo aspettare quindi l&#039;arrivo di questa funzione sul nuovo client? Oppure c&#039;&egrave; stato qualche bug?","replies":[{"poster":"Chroniicles","date":"2017-01-03T17:51:05.982+0000","up_votes":2,"down_votes":0,"body":"Ah ecco, buono a sapersi allora se ricapitasse anche ad altri ;)","replies":[]},{"poster":"Chroniicles","date":"2017-01-02T15:38:39.976+0000","up_votes":1,"down_votes":0,"body":"Credo sia normale, non essendo implementati nel nuovo client. Sinceramente non ho mai provato, non li ho mai usati, avevo letto in giro però che con molta probabilità sarebbero stati addirittura rimossi del tutto perchè _poco pratici e poco utilizzati_, non so dove tu abbia letto che invece verranno inseriti, non mi pare di aver letto novità a riguardo ma potrei sbagliarmi ^^","replies":[{"poster":"BluCobalto92","date":"2017-01-03T07:40:36.925+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Chroniicles,realm=EUW,application-id=98NGV4Al,discussion-id=h2v190cA,comment-id=0000,timestamp=2017-01-02T15:38:39.976+0000)\n>\n> Credo sia normale, non essendo implementati nel nuovo client. Sinceramente non ho mai provato, non li ho mai usati, avevo letto in giro però che con molta probabilità sarebbero stati addirittura rimossi del tutto perchè _poco pratici e poco utilizzati_, non so dove tu abbia letto che invece verranno inseriti, non mi pare di aver letto novità a riguardo ma potrei sbagliarmi ^^\n\nIo l ho letto tra le novità della riot...dicevano proprio loro che rimetteranno questa funzione ma specificavano che sarebbe stata una delle ultime cose dato che ha meno importanza di altre....poi la certezza che la rimettano credo la si possa avere dal fatto che tutti i vecchi set personalizzati ce li ritroviamo gia nel nuovo client mentre penso che se nn avessero intenzione di rimetterla avrebbero azzerato qualsiasi modifica","replies":[{"poster":"Apokàlypsis","date":"2017-01-03T13:22:11.769+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BluCobalto92,realm=EUW,application-id=98NGV4Al,discussion-id=h2v190cA,comment-id=00000000,timestamp=2017-01-03T07:40:36.925+0000)\n>\n> Io l ho letto tra le novità della riot...dicevano proprio loro che rimetteranno questa funzione ma specificavano che sarebbe stata una delle ultime cose dato che ha meno importanza di altre....poi la certezza che la rimettano credo la si possa avere dal fatto che tutti i vecchi set personalizzati ce li ritroviamo gia nel nuovo client mentre penso che se nn avessero intenzione di rimetterla avrebbero azzerato qualsiasi modifica\n\nEsatto, non verranno tolti del tutto ma non sono affatto tra le priorità da implementare nel nuovo client. \nQui http://na.leagueoflegends.com/en/news/game-updates/features/client-open-beta-update-1\nho letto che verranno aggiunti dopo la beta ma non da troppe notizie.\nUso i set personalizzati per comodità (si, son pigra) dato che mi permette di avere tutto quel che mi serve a portata di mano senza cercarlo nel negozio. Grazie per il suggerimento, proverò la personalizzata! ^^","replies":[]}]}]},{"poster":"BluCobalto92","date":"2017-01-02T17:47:17.035+0000","up_votes":1,"down_votes":0,"body":"Non ne sono sicuro ma avevo letto che se facevi una partita anche personalizzata o contro i bot dal vecchio client poi li trovavi anche da te....io personalmente non ho provato tanto gli oggetti me li ricordo....GL","replies":[]}]}