{"poster":"Oblivion awaits","date":"2019-01-27T22:51:22.030+0000","title":"¿Qué pasa con Sylas?","subforum":"Charlas Generales","up_votes":5,"down_votes":0,"body":"&iquest;Se han dado cuenta que Sylas tiene un winrate extremadamente bajo? En Probuilds.com donde exponen los juegos de jugadores PRO, tiene un 38% y en ChampionGG.com que toma datos generales, es el peor en cada una de las lineas. Sin m&aacute;s, la &uacute;nica ranked que perd&iacute; de mis diez de posicionamiento fue con un Sylas aliado. &iquest;El campe&oacute;n est&aacute; tan d&eacute;bil o simplemente aun no se ha encontrado la manera m&aacute;s eficaz de jugarlo? \r\n{{champion:517}}","replies":[{"poster":"AxElL93","date":"2019-01-28T00:16:46.496+0000","up_votes":3,"down_votes":0,"body":"yo lo encuentro debil","replies":[{"poster":"I Wolfy","date":"2019-01-28T00:34:13.441+0000","up_votes":1,"down_votes":0,"body":"Yo igual, lo veo muuuy debil, no en cuento al daño (lo que por cierto pega una barbaridad) sino que es demasiado flan. En la que le metés un Stun está muerto.","replies":[]}]},{"poster":"Jeffront","date":"2019-01-27T23:44:10.892+0000","up_votes":2,"down_votes":0,"body":"Bro, es un campeón nuevo. Es lógico que tenga poco WinRate en sus principios.","replies":[]},{"poster":"Wúxíng","date":"2019-01-28T01:53:17.782+0000","up_votes":1,"down_votes":0,"body":"Es nuevo por eso nadie tiene m7","replies":[]},{"poster":"Yo sin Ella","date":"2019-01-27T23:29:22.886+0000","up_votes":1,"down_votes":0,"body":"No,no esta nada debil. El tema esta en que estan aprendiendo a jugarlo,nada más. \n\nHe estado espameando Sylas y al principio tuve el problema de  \"Que rol tiene este personaje? Es un offtank AP?\". Y hay gente que recomienda maxear la Q primero,esto es un completo error porque todo el daño de Sylas esta en su W,matarreyes.\n\nSylas brilla realmente en mid-late y full AP,como un mago de burst. El combo es EWQ metiendo siempre la pasiva. Con thunderlord de runa. Y zhonya es un core item,te salva al tener que robarle ulti a Morgana o Amumu al meterte entre todos.\n\nYo creo que los pros se estan acostumbrando,nada más. Y concuerdo con tu comentario de los Sylas,los que me han tocado dicen \"jg campeame pls\" minuto 1 y despues no saben que hacer,van con malas maestrias o malas builds.\n\n\nPersonalmente creo que Sylas es el campeon más versatil de todo el juego,tienes 1000 posibilidades diferentes y depende todo de tomar la Ulti correcta. Copiarles a su soraka,o a su amumu,o a su morgana destruye al equipo enemigo.Personalmente,en lo poco que he podido jugar a Sylas,es mi campeon favorito.\n\nNo olvidemos que tiene una dificultad de 3 estrellas,la cual comparte con campeones como{{champion:268}}  {{champion:67}}  entre otros","replies":[{"poster":"Maxiuss","date":"2019-01-27T23:39:30.265+0000","up_votes":1,"down_votes":0,"body":"10/10 lince, lo único es que más que mid late, te llegaría a decir que unicamente late, por el simple hecho de tener una R con 15 segundos de cooldown que puede utilizar cosas como las de karthus que superan los 100 xd","replies":[{"poster":"Yo sin Ella","date":"2019-01-27T23:42:21.018+0000","up_votes":1,"down_votes":0,"body":"La verdad es que Sylas va aumentando en poder asi como vaya progresando la partida,no es useless en early,pero no es su mejor etapa. Lo malo de su early es que no tiene mucho pokeo,es facil evadir el segundo daño de la Q. Asi que tiene que tirarse all-in si o si","replies":[{"poster":"Maxiuss","date":"2019-01-27T23:53:38.386+0000","up_votes":1,"down_votes":0,"body":"PD que nombre más sad hijo de tu buena madre :'v","replies":[]},{"poster":"Maxiuss","date":"2019-01-27T23:52:57.979+0000","up_votes":1,"down_votes":0,"body":"de hecho tiene un buen pokeo en la toplane contra campeones melee, llega a ser muy molesto por el ralentizado de la Q que si te la comes de lleno el segundo golpe te lo comerás asegurado, aún así, su fase de lineas tiene el problema que dijiste, sino puede hacerte un all-in estará en problemas y desventajado contra otros campeones de burst que en el early y midgame si pueden sacar provecho como lo harían zed o talon","replies":[]}]}]}]},{"poster":"Zinc","date":"2019-01-27T22:57:39.177+0000","up_votes":1,"down_votes":0,"body":"No descarto que le llegue un buff, pero creo que va pasar lo mismo que con Zoe. \nCuando se acostumbren a su modo de juego sera distinto.","replies":[{"poster":"Oblivion awaits","date":"2019-01-27T23:11:37.071+0000","up_votes":1,"down_votes":0,"body":"Creo que solo una persona experimentada con el campeón será el que le pueda sacar partida, ya que el Sylas FULL AP pega mucho pero al ser un campeón melee sin ningún escape y el FULL tanque no tiene mucha utilidad. Creo que es campeón bruiser, por mi poca experiencia,","replies":[]}]}]}