{"poster":"MysticFlameHaze","date":"2015-04-22T02:32:38.642+0000","title":"Jinx nerfs too extreme","subforum":"Gameplay","up_votes":3,"down_votes":11,"body":"please say that this coming nerf to jinx&#039;s ult is not true, 45 damage max rank at point blank range with .1 AD scaling is going to kill nothing. Yes it makes sense that it should be weaker at close range which it is because it scales but nerfing it 200 damage and 40% of its scaling is ridiculous. If you&#039;re going to nerf it lower the scaling by .1 or .2 not destroy the base damage and scaling.","replies":[{"poster":"Voluug13","date":"2015-04-22T05:51:32.783+0000","up_votes":2,"down_votes":0,"body":"Its supposed to be a global ultimate, not an AoE ranged Execute.","replies":[]},{"poster":"Venowolf","date":"2015-04-22T04:13:08.001+0000","up_votes":2,"down_votes":0,"body":"Its a fair nerf, she have a high pic rate, and win rate for a long time, maybe with this we see another adc's rises.","replies":[]},{"poster":"Lord Dusteon","date":"2015-04-22T02:41:57.991+0000","up_votes":2,"down_votes":0,"body":"It still has the 35% enemy missing hp; only thing it lost close range is the great base and ratio.\n\nHere's a tip: it gains full damage value after 1 second, and now that damage upgrade is actually noticeable. She needed some nerfs, and this is a great one to do. Now you don't get your great base unless you actually add some skill to the global skillshot.","replies":[]},{"poster":"MysticFlameHaze","date":"2015-04-22T19:05:19.107+0000","up_votes":1,"down_votes":0,"body":"i kinda take back what i said after reading Gypsylord's reasons for the nerf and its understandable but i sure do hope it really doesn't impact her that largely because they are currently unsure if it will as well","replies":[]},{"poster":"UberAffe","date":"2015-04-22T03:40:13.018+0000","up_votes":1,"down_votes":2,"body":"they should reduce the amount of time it takes to scale up to full if they do this, otherwise they are severely damaging her laning phase kill potential.\nAlso I'm pretty sure this would hurt her team fight as her ult needs to travel for a full second before reaching max damage and it travels pretty far in 1 second.","replies":[]}]}