{"poster":"Re Sombra","date":"2016-01-12T20:16:54.693+0000","title":"ok mi sono perso","subforum":"Discussioni generali","up_votes":3,"down_votes":1,"body":"http://euw.leagueoflegends.com/it/page/presentazione-campione-jhin-il-virtuoso\r\n \r\n\r\nqualcuno mi spiega la passiva.\r\nparlo della 2, quella delle rune ecc; perche la  proprio mi sono perso.","replies":[{"poster":"franz94","date":"2016-01-13T02:01:00.510+0000","up_votes":1,"down_votes":0,"body":"Nella presentazione manca anche un altra passiva XD\n\nAllora la prima passiva  sono i 4 colpi facile da capire, piú il fatto che il 4 aa é sempre un critico e fa danno in base agli HP mancanti.\n\nLa seconda passiva  fa si che:\n 1) i critici di jhin facciano meno danno(probabilmente avranno un ratio ridotto tipo 150% ma i numeri non si sanno per ora)\n 2) se jhin compra item che danno velocita di attacco o critico, lui li converte in ad (il ratio ancora non si sa) pero non guadagna ne velocitá di attacco ne critico o li guadagna in maniera molto ridotta.\n3 ) Effettuare un critico fa in modo che guadagni velocita di movimento in base alla velocita di attacco.\n\nLa passiva terza che non é stata scritta nella presentazione ma confermata su reddit e sul sito americano dal rioter che ha creato jhin, fa in modo che quando jhin uccide un champ su questo nasce un fiore che dopo un paio di secondi esplode facendo danni aoe e rallentando i nemici vicini.","replies":[]},{"poster":"MasterKeaton98","date":"2016-01-12T22:12:44.887+0000","up_votes":1,"down_votes":0,"body":"Da quel che ho capito:\n\nI critici infliggono meno danni e la sua attack speed non scala (o scala poco, non ho capito) con l'attack speed. Jhin ottiene attacco fisico tramite oggetti, e rune, che gli forniscono attack speed e probabilità di colpo critico. Infliggere colpi critici gli fa' aumentare la velocità di movimento.\nDa quello che ho letto dalla descrizione, si dovrebbe trattare di un champion che non fa' danni sostenuti come un normale adc che scala con l'attack speed ma è un caster (?) che porta utility al team insieme ad un burst che dovrebbe avvenire col 4 colpo dei suoi attacchi base.\n\nForse sto dicendo solo stupidaggini, il che è molto probabile visto che anche non ci ho capito un cazzo.\n\nFatemi sapere se ho detto cose giuste.","replies":[]}]}