{"poster":"Re Sombra","date":"2015-12-31T19:50:08.939+0000","title":"2 oggetti da fixare.","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Nell&#039;elenco oggetti a mio parere ci sono due oggetti difettosi, entrambi interagiscono coi  migninion, solo che non interagiscono in maniera corretta.\r\nEssi sono: il mietitore; giocando con gp ho notato che questo oggetto non conta bene i mion presi dato che molto spesso mi ritrovavo ad avere 114 minion e il mietitore ancora con 15/20 stack;non so se lo fa solo cn gp ma cmq e un problema grosso.\r\nL altro oggetto e il volto della montagna; oggetto fondamentale per i support tank e di recente lo da consigliato pure su tresh,ed e esattamente su di lui che fa difetto perche  i mion che uccidi cn quell oggetto addosso, anche se hai  le stack molto spesso non vengono applicate e il mion viene assegnato solo al support; questo e un grosso problema  perche rende un oggetto completamente inutile su di lui che tra l altro e pure consigliato.\r\nSecondo me questi sono degli enormi problemi, ed anche un po ironico che degli oggetti consigliati funzionino in maniera difettosa su di essi.","replies":[{"poster":"Ringiel","date":"2015-12-31T20:16:58.582+0000","up_votes":1,"down_votes":0,"body":">il volto della montagna\n\nsui ranged,bisogna lasthittare i minion per passarli ... è sempre stato così quell'item\n\n>il mietitore\n\nc'è realmente qualcuno che utilizza quell'item? più che fixarlo dovrebbero rimuoverlo xD","replies":[{"poster":"Re Sombra","date":"2015-12-31T20:31:48.173+0000","up_votes":1,"down_votes":0,"body":"Riguardo al mietitore non mi trovo d accordo, se la riot ha messo quell itrm vuoldire che a qualcosa serve, riguardo al volto invece non e solo un fatto di kast hittare perche a volte non viene proprio assegnato in maniera corretta anche se viene last ittato","replies":[{"poster":"dreadful despair","date":"2015-12-31T21:00:06.009+0000","up_votes":1,"down_votes":0,"body":"La rito ha introdotto nel gioco molti item inutili che nessuno giocava ed è stata poi costretta a rimuoverli dal gioco.Mi ricordo ancora quel item che aumentava l'ad in base a quanta vita avevi(Impalatore di Atma?).Insomma,gli item a distanza di tempo se smettono di essere giocati per un po di tempo vengono tolti per una ragione.","replies":[{"poster":"ubercodlegend200","date":"2016-01-01T15:06:00.802+0000","up_votes":2,"down_votes":0,"body":"Dava critico e ad in base alla vita  su garen era di-vi-no, ma inutile su ogni altro champ, apparte mundo credo. Comunue si è semplicemente reincarnato nella titanic","replies":[]}]},{"poster":"Ringiel","date":"2015-12-31T21:31:32.464+0000","up_votes":1,"down_votes":0,"body":"la {{item:1055}}  è nettamente superiore sugli adc,visto che da 80 hp;\nper tornare a gp e ai top,solitamente si startano con {{item:2033}} perchè aiuta a traddare meglio e recca mana ... gp,a maggior ragione, ora che ha problemi di mana in early è costretto a startare con quell'item","replies":[{"poster":"Re Sombra","date":"2015-12-31T21:35:17.046+0000","up_votes":1,"down_votes":0,"body":"Resta cmq il fatto che quell item e da fixare","replies":[]}]}]},{"poster":"Etoclas","date":"2016-01-01T12:14:18.777+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Re Sombra,realm=EUW,application-id=98NGV4Al,discussion-id=AhWAF7In,comment-id=00000000,timestamp=2015-12-31T20:31:48.173+0000)\n>\n> Riguardo al mietitore non mi trovo d accordo, se la riot ha messo quell itrm vuoldire che a qualcosa serve, riguardo al volto invece non e solo un fatto di kast hittare perche a volte non viene proprio assegnato in maniera corretta anche se viene last ittato\n\nRe Sombra ha ragione, il Volto della Montagna {{item:3401}} giustizia solo in MISCHIA, e THRESH è un RANGED.","replies":[]}]},{"poster":"twitchtv Vodky","date":"2015-12-31T21:01:09.045+0000","up_votes":1,"down_votes":0,"body":"Il mietitore conta solo i minion in corsia e non quelli dati dalla jung o river. \nIl volto devi lasthittare. Magari hai mandato i minion a 1 hp e i tuoi lo hanno killato ma comunuqe non è buggato ^^.","replies":[{"poster":"Re Sombra","date":"2015-12-31T21:17:15.499+0000","up_votes":1,"down_votes":0,"body":"Cio che accade col mietitore infatti accade in corsia e l ho notato perche quando lo uso cn gank plank che guarda caso e un top non mi calcola molti minion, se non ci credi fai una prova usalo e farma con gp , anche con la e, scoprirai che molti minion non vengono calcolati.","replies":[]}]}]}