{"poster":"Seebaah","date":"2016-08-06T00:20:06.432+0000","title":"Consejos para Salir de Plata?","subforum":"Guias y consejos","up_votes":1,"down_votes":1,"body":"Bueno, como dice el titulo, algunos consejos para salir de plata? no me sirve jugar bien, no morir en linea si tengo a 4 personas que no saben jugar, fedean y flamean, eh bajado 2 veces de plata 2 a plata 5 por esa gente, eh jugado todas las lineas pero siempre salen flamer y ratas etc, algun champ hyper carry que sirva para ganar 1 vs 5?","replies":[{"poster":"lordeman10","date":"2016-08-06T01:52:16.188+0000","up_votes":2,"down_votes":0,"body":"pasa que ponele te tiro heimerdinger es el mejor champ de esa liga (no lo es ni menos) vas a ponerte a aprender a jugar heimerdinger? ñe, vos ya sabés usar re bien 2 o 3 campeones agarrá esos y spamealos por más que te aburras de jugarlos, porque si ya tenés un buen winrate con ellos es probable que puedas mantenerlo o como mucho decaerá un poquito pero de pronto no vas a pasar de tener un 60% a un 40%, vas a seguir ganando la mayoría y con eso vas a subir... no te conviene buscarte un campeón op, solo agarrás, a ver to op.gg\n\njinx\n62%\n99 jugado\n\nyo se que llega un punto que te hartás pero si querés subir, dale con jinx que sabés que mínimo vas a ganar la mitad de las que juegues y es muy probable que ganes alguna demás\n\nPERO SPAMEALA ENSERIO, si te quemás jugando un campeón que ya sabés jugar bien, llegau n punto que estás como fusionado, sabés cada trade, cada rango, cada tiempo.. bueno hay muchos consejos pero ese me parece el más práctico","replies":[{"poster":"Seebaah","date":"2016-08-06T02:49:25.550+0000","up_votes":1,"down_votes":0,"body":"gracias, vamos a spamear a la Jinx como nunca.","replies":[{"poster":"JayInc","date":"2016-08-06T04:52:40.514+0000","up_votes":1,"down_votes":0,"body":"El mejor consejo. Tienes 62% de win rate con jinx. Con ese % de victoria deberias estar subiendo muy rápido. Spamea los campeones con los que te va bien.","replies":[]}]}]},{"poster":"Sonya Kyron","date":"2016-08-06T01:02:31.030+0000","up_votes":2,"down_votes":0,"body":"divertite, pero salis de plata y entras en bronce.","replies":[]},{"poster":"lPikachu","date":"2016-08-06T00:26:09.060+0000","up_votes":2,"down_votes":0,"body":"Si quieres alguna persona que vivió experiencia, pásate por [acá](http://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/OdHeBydw-mi-camino-de-bronce-a-oro-como-se-debe-ser-para-mejorar)...\nSi quieres una guía perfecta pásate por [acá](http://boards.las.leagueoflegends.com/es/c/guias-y-consejos/LoGlkvhR-la-mejor-guaua-de-league-of-legends-camo-subir-de-bronce-a-diamante-todo-explicado-100-paginas)...","replies":[]},{"poster":"Rolando Magic","date":"2016-08-06T00:21:49.700+0000","up_votes":2,"down_votes":0,"body":"Lo que tenes que hacer es ser autocritico, jugar tus partidas fijandote en lo que hacas vos, analizar que hiciste mal en un derrota y que pudiste haber hecho para evitarla, tambien te recomiendo que juegues solo dos lineas y 2 o 3 campeones en cada una","replies":[{"poster":"Seebaah","date":"2016-08-06T01:01:33.396+0000","up_votes":1,"down_votes":0,"body":"Si hago una autocritica, en que hice mal, eso no me ayudara a que mis 4 compañeros mejoren \nActualmente En estas linea uso estos Supp\n\nTop: Poppy, Gnar, Rumble\nJg: Gragas, Nau, Graves\nMid: Leblanc, Xerath, Annie\nAdc: Jinx, Varus, Cait\nSupp: Alistar, Tresh, Morgana\n\nestan bien para el meta actual?","replies":[{"poster":"Rolando Magic","date":"2016-08-06T02:53:55.111+0000","up_votes":1,"down_votes":0,"body":"Si vos queres subir tenes que procuparte por vos y mejorar vos, si tus compañeros son malos problema de ello, es una excusa barata que no te ayuda en nada. Ademas tus acciones van a influir mucho en la partida, tanto de forma positiva como negativa, por eso tense que fijarte en vos\nEso esta mal si lo que vos queres es subir, ya que es estaria mejor que juegues un champion pool pequeño y solo dos roles, no mas de 6 o 7 campeones en total. Tampoco te dejes llevar por el meta, juga lo que te guste y con lo que te sientas cómodo, si coincide que esta en el meta bueno bien, pero no te bases en el meta si o si porque no te ayuda tanto.","replies":[]}]}]},{"poster":"DERGONokay","date":"2016-08-07T12:59:29.004+0000","up_votes":1,"down_votes":0,"body":"\"Siempre pierdo por los afk y los trolls\" ¿Cuántas veces escuche eso? No lo se, pero te puedo asegurar una cosa, si perdes es por merito propio, cuando entiendas que sos un manco (sin ofender) que no sos ningún pro y que para ganar una partida necesitas de tu equipo vas a subir de liga, hasta entonces seguí echandole la culpa a los demas. \n\n    Suerte.","replies":[]},{"poster":"Destrjj","date":"2016-08-06T19:03:19.992+0000","up_votes":1,"down_votes":0,"body":"Antes que nada, tu premisa ya está mal de entrada. Siempre te van a tocar trolls, afk, flammers, etc. Cuál es la única diferencia que hace a las partidas que jugás? Es muy simple la respuesta. VOS. Solamente VOS estas en TODAS las partidas que jugás. Por ende lo de flammer, trolls, afk, te pueden tocar. si, pero no siempre te van a tocar. Ahora bien sabiendo lo anterior dicho. Pensa que tenes mas probabilidades que haya un troll,afk,etc. del otro equipo, que en el tuyo (es muy simple porque vos estas en todas las partidas, por ende en tu team habría uno menos). \n\nSegundo y te va a ayudar muchisimo reconocé tus errores en el juego. Todos tenemos errores en el juego, la diferencia está en asumirlos o no.\n\nTercero. Si tenes un sup Blit por ejemplo y no mete una Q. Sirve que le digas que es un manco, que no mete una Q, que no tenes sup, gg no sup, etc? La respuesta es NO. Decile tranki man la proxima ya va a salir. con eso le das confianza a tu sup en este caso,(se aplica a cualquier parte del mapa este ejemplo). Porque el mismo ya se da cuenta que está errando las Q, los skilles etc.\n\nCuarto si te gankean entre 4 y nadie te avisó, NO ES CULPA de tu equipo avisarte las MIAS. Solo y exclusivamente si te moriste por un gank. es tuya absolutamente tu culpa. Miralo de otra manera estas de adc te gankea, el top jg y mid mas los dos que ya tenes en linea(adc, y sup) basicamente te cayeron todos. te gankearon y te mataron. perfecto, tu top esta solo y tu mid esta solo(con esto pueden tirar torre pushear, y sacar exp farm y oro que el otro team gastó en matarte a vos. Osea buscá sacar provecho o lo mejor que puedas de un momento malo.\n\nQuinto y ya termino. Fijate en tus estadisticas. Un campeon con el que tenes 0 /10 partidas ganadas, no lo uses, porque estadisticamente ya perdiste esa partida.\n\nEspero que te sirvan.  \n\n\nSaludos \n\n\nDestrjj","replies":[]},{"poster":"Rynx","date":"2016-08-06T01:31:08.614+0000","up_votes":1,"down_votes":0,"body":"Experiencia personal: juga con lo que te gusta. \nPara bronce es jugar con lo que carree solo, pense que era lo mismo en plata pero cuando volvi a divertirme jugando, pude salir de plata 1","replies":[]}]}