{"poster":"SukiSuki1MoTime","date":"2018-05-23T09:52:24.828+0000","title":"Permabann ohne Vorbelastung, Einloggen im Support nicht möglich","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi! Ich habe innerhalb der letzten 12 Stunden ohne ersichtlichen Grund oder Erkl&auml;rung einen Permabann verpasst bekommen und w&uuml;rde gerne mit dem Support in Kontakt treten. \r\n\r\nAllerdings ist es mir nicht einmal m&ouml;glich mich dort einzuloggen. Die Meldung auf der Supportpage: &quot;Es ist ein unbekannter Fehler aufgetreten. Bitte versuche es in ungef&auml;hr einer Minute erneut.&quot;\r\n\r\nHoffe hier kann mir wer weiterhelfen.","replies":[{"poster":"RainerKilltKeina","date":"2018-05-23T09:57:52.362+0000","up_votes":1,"down_votes":0,"body":"hast du kürzlich vllt Rp gekauft und dein Konto war nicht gedeckt oder so etwas?\nWenn du eventuell Riot Geld schuldest, dann kann das daran liegen.\nAuf jeden Fall = Ruhe bewaren. Wird schon gelöst werden.\nProbier es in einer halben Std nochmal","replies":[]},{"poster":"Gin","date":"2018-05-23T09:57:47.416+0000","up_votes":1,"down_votes":0,"body":"Wenn du dich im Client einloggst sollte dort stehen weshalb du gebannt wurdest.\n\nMögliche Gründe für deinen Ban:\n\n* Flame - Durch besonders schwere Fälle ist es möglich sofort einen Permaban zu kassieren. Das sind allerdings sehr seltene Ausnahmen, und ich hoffe mal das ist nicht der Fall.\n* 3rd Party Programme/Hacks/Scripts: Hast du irgendwelche Programme/Plugins installiert gehabt die mit Lol interagieren oder Änderungen am Client vorgenommen?\n* Geld - Wenn du einen nicht beglichen Betrag hast, wird dein Account so lange permanent gesperrt bis du diesen beglichen hast. Dies kann vor allem durch Rückbuchungen der Bank leicht zustande kommen.\n\n---\n\nUnd was dein Problem mit der Support-Seite betrifft: Hast du mal probiert dich auf der Seite auszuloggen und wieder neu einzuloggen?\n\nBrowser-Cache mal geleert oder mit einem anderen Browser probiert?","replies":[]},{"poster":"legofreak1","date":"2018-05-23T09:56:43.061+0000","up_votes":1,"down_votes":0,"body":"Logge dich bitte von der Website aus und versuch dich dann neu einzuloggen. Wenn das nicht hilft, lösche Cookies und Cache deines Browsers oder versuche es mit einem anderen Browser. Wenn dann immer noch Probleme auftreten, liegen diese wahrscheinlich auf Seiten des Supports. Meist wird dies recht zügig behoben. Da du wahrscheinlich nicht abwarten möchtest, kannst du auch eine E-Mail an **lol_de@riotgames.com** schreiben. Dies kommt dem Erstellen eines Tickets gleich. Bitte verwende dazu aber die E-Mailadresse unter der auch dein Konto läuft, da dir sonst wahrscheinlich nicht geholfen wird. Das Ticket sollte wenn du dich wieder einloggen kannst für dich auch unter \"Meine Anfragen\" im Supportbereich sichtbar sein.","replies":[]}]}