{"poster":"PapaJLBaer","date":"2015-10-27T17:41:46.828+0000","title":"Smurf Premad = Ok / Smurf Premad = ELO Boost   beides möglich ?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":3,"body":"Moin.\r\n\r\nIch habe ein Problem auf das ich keine vern&uuml;nftige Antwort finde.\r\n\r\nAlso wenn ich und mein Freund z.B Silber2 sind und einen Challenger Spieler bitte mich mit einen anderen Silber Smurf von Ihm auf\r\nPlatin zu Boosten und seien dann auch zu Platin gewordenen ACC meinen Freund zu geben. So das wir beide ein Patin Acc habe.\r\nDas ist doch ganz klar Boosting oder ?\r\n\r\nWenn mein Freund jetzt aber der Challenger ist und mich mit einen Silber Smurf zu Platin Boostet.\r\nDas ist laut Riot jetzt kein Boosting mehr.\r\n\r\nIn beiden Fallen Boostet mich ein Hight ELo Smurf .\r\n\r\nWer kann mir bitte sagen warum das so ist ?\r\nIch sehe da keinen unterschied.","replies":[{"poster":"Der Großmugister","date":"2015-10-28T07:54:15.509+0000","up_votes":4,"down_votes":0,"body":"Nochmal in aller Deutlichkeit:\n\nEs verstößt immer dann gegen Riots AGBs und wird daher geahndet, wenn mehrere Spieler EINEN Account spielen.\nDabei ist die Elo der Accounts oder Spieler vollkommen belanglos.\nDieses so genannte \"Accountsharing\" ist es auch, was das Boosten im eigentlichen Sinne, \"illegal\" macht. Es ist also nur dann ein Problem, wenn der ganannte Challanger direkt auf deinen Account zugreifen würde, wenn er mit einem Smurf, gemeinsam mit dir spielt, ist es kein \"Boosten\" im eigentlichen Sinne, sondern einfach DuoQ und daher kein Problem.\nZum Problem wird es erst, wenn du wie von dir beschrieben, diesen Account dann an eine dritte Person weitergibst, denn damit wären wir wieder beim \"Accountsharing\".\nOder ganz einfach ausgedrückt:\nEin Spieler darf so viele Accounts haben wie er will, ein Account darf jedoch immer nur einen Spieler haben.","replies":[]},{"poster":"Skagerak","date":"2015-10-27T17:57:02.019+0000","up_votes":1,"down_votes":0,"body":"Wenn der Silber acc dem Challenger Spieler gehört ist es kein boosten weil ihr so gesehen die gleiche Elo habt. Wenn der Challenger Spieler auf deinem acc spielen würde und diesen so hochzieht ist es boosten/accountsharing was beidees verboten ist. Das 2te Beispiel ergibt keinen Sinn da du als silber nur mit einem Gold/Silber/Bronze spieler duoqen kannst.","replies":[{"poster":"PapaJLBaer","date":"2015-10-27T21:32:34.671+0000","up_votes":1,"down_votes":4,"body":"Falsch.\nEin Challenger Spieler ist ein Challenger Spieler egal welche ELO sein Smurf hat.\n\nAber genau darum geht es doch.\nIch würde doch nie ein ( echten ) Silber Spieler fragen ob er mich auf Platin bringt, das währ doch dumm.\n\nWenn der Challenger Spieler auf deinem acc spielen würde und diesen so hochzieht ist es boosten/accountsharing was beidees verboten ist. \nDes wegen spiele ich ja auch auf meinen ACC, er carryt mich halt nur. Ein Challenger Spieler  ist so gut das man quasi jedes Game gewinnt und somit automatisch auf steigt.\n\nDas aber völlig Legal wie es scheint.","replies":[{"poster":"OrangeBubble","date":"2015-10-28T01:19:19.070+0000","up_votes":3,"down_votes":0,"body":"Es scheint nicht nur so, es ist lega. Smurfing ist legal und DuoQ ist lega, also ist auch das zusammenspielen mit einem Challenger Smurf legal. \nBei DuoQ muss du ja tdm noch im Spiel etwas leisten, sei jetzt mal dahin gestellt, dass in der Regel der Challenger Smurf euch carried, aber tdm bist du ja in den Spielen anwesend und erbringst eine gewisse Leistung.\n\nBeim klassischen Boosting gibst du  deine Account Daten weiter und du erbringst selber keine Leistung. \n\nOb man DuoQ mit einem Smurf oder generell gut findet, ist jedem das seine, aber Riot wird es nicht verbieten, da müssten sie generell Smurfing verbieten.","replies":[{"poster":"PapaJLBaer","date":"2015-10-29T15:23:28.413+0000","up_votes":1,"down_votes":1,"body":"Die Chance das man gegen eine Challenger Smurf gewinnt ist doch = 0 in der Low ELo.\nDas macht doch das ganze Spiel kaputt.\n\nWenn ich anderen das Spiel versaut in dem AfK gehe werde ich gebannt.\nWenn ein Challenger Smurf anderen das Spiel versaut wied er nicht gebannt.\n\nDas ist doch dumm.\n\nRiot sollte wenigsten anzeigen das es ein Challenger Smurf ist, und jeder dann sagen kann ob er das Spiel annimmt oder nicht.","replies":[{"poster":"OrangeBubble","date":"2015-10-29T16:11:11.343+0000","up_votes":1,"down_votes":0,"body":"Nope, ich hab schon gegen einen Challenger gewonnen, weil er kurz vor seinem Win so überheblich wurde, dass er gestorben ist und die 4 anderen es nicht geschafft haben, die Base einzureißen. Wärendessen hab ich als Jinx bis zum Nexus gepusht und so gewonnen. Möglich ist es also, sehr unwahrscheinlich, wenn dieser tryhardet, aber möglich.\n\nAußerdem wie wahrscheinlich ist es bitte, dass jemand wirklich mit einem Challenger DuoQ spielt? Das ist ebenso sehr unwahrscheinlich.....","replies":[]}]},{"poster":"Skagerak","date":"2015-10-28T19:16:39.831+0000","up_votes":1,"down_votes":1,"body":"Außerdem wäre es echt doof wenn man nur noch auf seinem main zocken dürfte ich weiß nämlich jetzt schon das ich net höher als dia kommen werde, da ist ein smurf eine gute Abwechslung (meiner war nach 3 tagen Platin also beschwert euch nicht über low elo smurfs die gibt es so gut wie garnet).","replies":[]}]}]}]},{"poster":"Eibert Rümmel","date":"2015-10-27T22:34:33.651+0000","up_votes":1,"down_votes":0,"body":"die Frage ist doch eher wie man als challenger an einen siler acc kommen soll. Sabotage oder Accountsharing vlt? Der Regelverstoß besteht schon bevor er dich boostet ;)","replies":[{"poster":"PapaJLBaer","date":"2015-10-27T23:14:12.034+0000","up_votes":1,"down_votes":2,"body":"Ist doch einfach.\nWas glaubst du wie viele Hight Elo Spieler haben mehr als 1 ACC ?`\nHaben die sich alle Strafbar gemacht ?\nWenn nein hast du deine Antwort","replies":[{"poster":"Eibert Rümmel","date":"2015-10-28T06:07:05.351+0000","up_votes":1,"down_votes":0,"body":"nö","replies":[]},{"poster":"LZ Flame","date":"2015-10-27T23:41:45.865+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PapaJLBaer,realm=EUW,application-id=KYnfKGf0,discussion-id=FxrnmEKw,comment-id=00020000,timestamp=2015-10-27T23:14:12.034+0000)\n>\n> Ist doch einfach.\n> Was glaubst du wie viele Hight Elo Spieler haben mehr als 1 ACC ?`\n> Haben die sich alle Strafbar gemacht ?\n> Wenn nein hast du deine Antwort\n\nwem interessierts dich wird eh kein challenger spieler boosten auf nen silver acc boosten","replies":[]},{"poster":"Patter91","date":"2015-10-28T07:56:42.957+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=PapaJLBaer,realm=EUW,application-id=KYnfKGf0,discussion-id=FxrnmEKw,comment-id=00020000,timestamp=2015-10-27T23:14:12.034+0000)\n>\n> Was glaubst du wie viele Hight Elo Spieler haben mehr als 1 ACC ?`\n\nUnd wie soll ein High Elo-Spieler diesen Acc auf Silber halten?\nEntweder, er spielt ordentlich, dann ist er innerhalb kürzester Zeit raus aus Silber. Oder er trollt, was bannbar ist. Dann ist er auch innerhalb kürzester Zeit \"raus\" aus Silber, indem der Account einfach gebannt wird.","replies":[{"poster":"Crounty","date":"2015-10-28T09:12:51.307+0000","up_votes":1,"down_votes":1,"body":"Oder er failed halt die Placements falls es ein neuer Account ist und ist in silber Oo","replies":[]}]}]}]},{"poster":"eingew","date":"2015-10-27T18:25:05.574+0000","up_votes":1,"down_votes":0,"body":"Der wichtige Punkt ist das Accountsharing. Sobald du deinen Account an einen fremden Mitspieler weitergibst, kann das nicht von der MMR vernünftig verarbeitet werden und hat erst Recht große Nachteile, weil Riot weniger Geld verdient, sofern schon viele Skins auf diesem Account gekauft wurden. Verständlicherweise hat Riot weder auf das eine, noch auf das andere große Lust, weil beides Geldverlust bedeutet.","replies":[]}]}