{"poster":"Strohhut2X","date":"2020-01-03T22:45:39.984+0000","title":"Trolle in Champselect... / Allgemeines Spielerverhalten","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":3,"body":"ich weis nicht wies euch dabei geht oder wie oft euch das passiert, aber gefühlt ist es bei mir in Ranked zur Zeit echt nurnoch Kindergarten -.-\r\nAktuellstes Bsp aus der Champselect:\r\n\r\nA: teemo banned? pfft\r\nA: i'll troll then!\r\nB: lol\r\nB: lemme adc\r\nB: u supp\r\nA: never\r\nC: pls. I wanted to ask to fuk up my match\r\n\r\nich mein Spieler A hat zwar dann einigermaßen normal gespielt, dafür hat B Ahri support (is ja ok) gespielt und ist nach 10min einfach zu mir in die mitte und dachte sich sie ist jetz midlaner.\r\nund man sieht ja an der reaktion von C schon das durch den sch*** den der schreibt schonwieder die stimmung mega ist im team -.-\r\n-----------------------------\r\nIch bin auch immernoch dafür nen button einzuführen mit dem man dodgen kann ohne den client zu schließen und dann auch nen grund angeben zu können / jmd wegen sowas wie oben beschrieben zu reporten. Die LP können mir meinetwegen trotzdem abgezogen werden (sonst wird es nur ausgenutzt).\r\nLieber verlier ich am tag -3 oder auch mal -3 + -10 LP wegen dodgen als sowas dann zu spielen nur um den reporten zu können. \r\n-----------------------------\r\nOder allgemein das spielverständnis von manchen Leuten:\r\nIch {{champion:136}} mein Gegner {{champion:80}} Midlane. teemo top und diana jungle geben ihm im early 2 kills obwohl ich min. 5x gepinged hab das panteon nach oben roamed und die stehen drotzdem unter dem gegnerischen tower statt sich zurückzuziehen.\r\n10min später wundert sich der Jhin das Pantheon so stark ist weil er 1. noch besser roamen kann als ich mir ASol. und 2. ich ihn auch nicht 1v1 kann auch nicht wenn ich 40farm ahead bin. -.-\r\n\r\nUnd das ist hat jedes 2te game so. \r\nich mein - jedem passieren mal Fehler und ich bin ja auch selbst nicht Profi, da sag ich ja auch garnix, aber so ein bisschen Hirn einschalten und sich nicht verhalten wie der letze A**** kann doch nicht so schwer sein oder ?","replies":[{"poster":"Zavolta","date":"2020-01-04T05:55:23.559+0000","up_votes":2,"down_votes":0,"body":"Das wäre das dümmste, was man einführen könnte... ein strafloses Leave-System für die Heldenauswahl... dann wird jeder immer leaven, wenn er nicht seine Wunschposition und/oder Wunschhelden bekommt. Gerade in deinem Elo-Bereich gibt es so viele \"OTPs\", die genau einen Helden spielen wollen/können... es geht so schon lange genug, bis man dann endlich mal im Spiel ist. Absolut dagegen.\n\nAbgesehen davon... da man inzwischen seit Ewigkeiten seine Rolle vor der Heldenauswahl angeben muss und vom Spiel auf eine Rolle festgelegt wird, kommt es nur noch sehr selten vor, dass jemand seine Rolle nicht akzeptiert. Manchmal wird zwar nett nachgefragt, ob man vielleicht tauschen möchte... aber Hardcore-Trolle, die dann auch im Spiel trollen, finden sich nur noch selten... oft sind das nur solche Spieler, die jemand anderes zum leaven bringen möchten, wenn sie so etwas im Chat ankündigen und die dann schön brav ihre Rolle im Spiel spielen, wenn es doch keiner macht.","replies":[{"poster":"Strohhut2X","date":"2020-01-05T15:07:04.256+0000","up_votes":1,"down_votes":1,"body":"Deswege sag ich: \n> \"Die LP können mir meinetwegen trotzdem abgezogen werden (sonst wird es nur ausgenutzt).\"\n_(Zeile: 21)_\n\nDamit genau das eben nicht gemacht wird.","replies":[]}]},{"poster":"611FVNKBlv","date":"2020-01-03T23:46:36.758+0000","up_votes":3,"down_votes":2,"body":"Die Reportfunktion in der Lobby würde ich persönlich ziemlich begrüßen vorrausgesetzt dass das Reportsystem auch greift. gefühlt ist das Reportsystem hier useless sofern keine gewissen Black-Listed-Wörter fallen und dann würde halt auch n report in CS nichts bringen.\n\nWurde bereits mehrfach gefordert. wieso das für Riot scheinbar ein problem ist ? Keine ahnung.  Vermutlich wieder schlichtweg desinteresse gegenüber Community\n\nDodgen ohne Client-Close hätte ich auch nichts gegen. Dodgen muss man nunmal ab und zu wenn man chance auf Elo haben möchte. Für langsame pc´s und aufgrund des aktuellen dodge-bugs wäre das natürlich nicht gerade eine schlechte Funktion. Hätte aber auch nichts dagegen wenn dodgen gänzlich abgeschafft würde sofern Regelverstöße in CS/Game dann aber ebenfalls geahndet werden. Ich zieh lieber n Game mit 2 Trolls durch um die am Ende banned zu sehen als das Game zu dodgen damit die weiter ihre Tour durchziehen können.\n\nDa aber auch hier das Reportsystem wieder mangelhaft ist .. naja ist dodgen halt manchmal echt pflicht.\n\nAllerdings glaube ich das andere Dinge priorität haben als diese nice2have-funktionen denn seien wir mal ehrlich ... es würde halt nichts ändern.","replies":[]}]}