{"poster":"Ruzel Free","date":"2015-07-28T02:12:21.803+0000","title":"Campeón nuevo","subforum":"Creaciones de la comunidad","up_votes":2,"down_votes":0,"body":"Hola , vengo a recomendar una idea que me salio de la cabeza al estar estudiando un tema bastante practico , venia a darles la recomendaci&oacute;n de un campe&oacute;n que se relacione con el animal mitol&oacute;gico &#039;&#039;HIDRA&#039;&#039; , tiene varias cabezas de dragones , estar&iacute;a bueno que los dragones se modifiquen un poco y se relacionen con el &#039;&#039;BARON NASHOR&#039;&#039; y que sea un personaje mujer seria mucho mas carism&aacute;tico para los que visualizan a la misma , por ac&aacute; les dejo una imagen , espero que el aporte les sirva de algo , muchas gracias. []\n(https://www.google.com.ar/search?q=hidra+mitologia&biw=1137&bih=752&source=lnms&tbm=isch&sa=X&ved=0CAYQ_AUoAWoVChMIiP2z2eH8xgIVRomQCh0SqwYk&dpr=0.9#imgrc=74mpp6t-lt56jM%3A)","replies":[{"poster":"LagunaStein","date":"2015-07-28T02:17:06.640+0000","up_votes":1,"down_votes":0,"body":"se ve bastante bien se sale me la compro XD","replies":[{"poster":"Ruzel Free","date":"2015-07-28T02:26:23.121+0000","up_votes":1,"down_votes":0,"body":"Estaria muy bueno meter mitologías en los campeones , ojala usen mi idea xD","replies":[{"poster":"Kyousuke","date":"2015-07-28T02:43:45.430+0000","up_votes":3,"down_votes":1,"body":"si queres mitología anda a smite XD ya tenes a {{champion:69}}  {{champion:103}}  {{champion:266}} {{champion:12}} {{champion:34}} {{champion:63}} {{champion:201}} {{champion:122}}  y mas XD","replies":[{"poster":"Devoto Lunari","date":"2015-08-02T05:59:07.137+0000","up_votes":1,"down_votes":0,"body":"brand, braum y darius?","replies":[{"poster":"Kyousuke","date":"2015-08-02T14:44:39.383+0000","up_votes":1,"down_votes":0,"body":"Brand está inspirado en Surt, gigante de fuego de la mitologia nórdica que, según la tradición, tendrá un papel fundamental en el Ragnarok.\n\n Braum basa su diseño en la imagen estereotípica de los nórdicos. Así, en Braum podemos apreciar toques de la cultura vikinga \n\nEl general noxiano está basado en Darío I, también llamado Darío el Grande.ue el padre de Jerjes. Sí, ese Jerjes, el que combatió contra Leónidas y sus espartanos las Termópilas","replies":[]}]},{"poster":"Ruzel Free","date":"2015-07-28T08:39:00.662+0000","up_votes":1,"down_votes":0,"body":"no me gusta smite pipo :C","replies":[]}]}]}]},{"poster":"Spartan Phoenix","date":"2015-07-30T23:44:07.881+0000","up_votes":1,"down_votes":0,"body":"Yo expuse ya una idea para un hidra como campeón nuevo. A mi también me atrae mucho la idea.","replies":[{"poster":"Spartan Phoenix","date":"2015-08-01T19:38:59.936+0000","up_votes":1,"down_votes":0,"body":"Este es mi post: http://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/EYPK034o-idea-nuevo-campean-hidra","replies":[]}]},{"poster":"Nakomy Gird","date":"2015-07-31T15:18:03.382+0000","up_votes":1,"down_votes":0,"body":"La idea esta buena, pero me interesaría saber mas, como que seria, (mago,luchador,tanque,tirador o soporte) supongo que seria mejor saber si es de cuerpo a cuerpo o a distancia, por que eso cambiaría el splashart, y bueno, si es a distancia cambia la cosa. Sus habilidades me llamaría mas la atención saber si cambia de forma (Como shivana) o siempre es igual. En caso de que sea cuerpo a cuerpo su ítem core es la Hidra voraz {{item:3074}} **(Badum pssss)** Oka, chiste malo. Creo que se me entiende. Igual, te recomendaría que contactes con alguien para hacer a la \"Campeona\" dentro de juego y su splashart en devianart. Si tienes suerte, y todo sale bien, ponlo en el foro de euw (o NA creo que era xD). Si crees que tienes todo (Como para ya hacer un parche para agregarla xD) si Riot hace uno de esos eventos, la publicas y contrado (?\n\nCreo que ahora que termino de escribir todo, es un laaaaaaaaaargo camino, pero si crees es eso lo lograras ^^\nSuerte :'D","replies":[]},{"poster":"Yudel","date":"2015-07-28T19:19:54.683+0000","up_votes":1,"down_votes":0,"body":"No es mala la idea, pero hay que tener en cuenta que hacer un campeón con muchas cabezas y que sea largo seria difícil de realizar. Digo que funcione en la grieta sin errores, como aquel campeón que era un dragon largo que ya nadie recuerda el nombre(?\nlos campeones asi hablando de temas de programación y eso causan errores, no se exacto del tema, pero me lo dijo un amigo que estudia eso, habria que pensar bien su forma para que entre sin problemas en la grieta :c","replies":[]}]}