{"poster":"StuckInLimb0","date":"2020-01-29T04:01:56.933+0000","title":"How does reporting work","subforum":"Player Behavior","up_votes":3,"down_votes":4,"body":"Okay , last game i had an awful experience in a ranked match , he cursed every other message and was extremely toxic \"useless bitch\" \"fuck you\" numerous times all game ,he then said it was part of the game ,  i told him i was gonna report him , and asked the other team to do so . i signed off and signed back on and i was the one who got a punishment ... how is this possible . Also how can i pull chat logs ... ridiculous.","replies":[{"poster":"Imperial Pandaa","date":"2020-01-29T04:18:56.318+0000","up_votes":5,"down_votes":0,"body":"You can get your chat logs by opening the client again if you haven't finished the punishment.\n\n1 report acts the same as 9, so you don't need to ask for reports. Additionally, repeatedly asking for others to report and telling someone you are going to report them is a form of harassment. Without seeing your logs, couldn't really help anymore than that.","replies":[{"poster":"Urinetrouble07","date":"2020-01-30T00:41:38.714+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=RUMwmF0B,comment-id=0000,timestamp=2020-01-29T04:18:56.318+0000)\n>\n> You can get your chat logs by opening the client again if you haven't finished the punishment.\n> \n> 1 report acts the same as 9, so you don't need to ask for reports. Additionally, repeatedly asking for others to report and telling someone you are going to report them is a form of harassment. Without seeing your logs, couldn't really help anymore than that.\n\n\nThis is a 2 part question.  1) How can 1 report act as 9 that legit doesn't make sense and if it's true then why is rito so lazy not to redo the system so it actually works ?  and 2) How is telling someone you're going to report them harassment ?  How can someone who's the actual problem in the game be harassed for letting them know you're tatteling on them ?  Non of your response makes sense to me.","replies":[{"poster":"Imperial Pandaa","date":"2020-01-30T01:42:03.136+0000","up_votes":2,"down_votes":0,"body":"1. It makes more sense when you think about it from a programmer perspective.  Pre-IFS was the Tribunal. Report weight existed to dissuade frivolous reporting as the process was already slow due to human review. IFS implementation makes verbal reports automated via Machine Learning.\nThis means Riot needs to decide how the system will review chat. Either do it automatically every game, which could punish 5 men premades who were okay with everything in Team chat; or set it up to review a game when reported. \nWhen it comes to programming, simpler can be better at times. A basic program function is the \"if... then...\" Which is just how it sounds; should criteria be met, action follows. So while they could certainly input more codes/conditions, that would also raise the risk of bugs. So taken the word of one of the architects for the IFS that an example of the code is:\n\"if reports >0 then flag for review\"\nThis^ basically makes it so as long as the number of reports is greater than 0, means the game will be reviewed. So 1 report does the same as 9.\n\n2. The best way I can explain it isn't great. There are three different ways I can explain. The first, the person isn't actually doing anything wrong. People sometimes threaten to report someone who is having a bad game. The second, think an irate customer is yelling at you constantly saying they are going to tell the manager/home office/etc that you are a terrible employee. Instead of either going to the manager or waiting for the manager to get there quietly, they continue to yell and berate you as you try to do your job still. The third explanation, is the person uses the threat of reporting as a means to try and strongarm/bully someone into something. Maybe someone doesn't like the support hover and so someone begins threatening to report them post game for trolling. Then continues during the entire match. \n\nTo be clear though and consistent with Riot statements before. Asking once probably won't result in a penalty. It is like \"gg ez\" where a single instance, while technically negative, isn't bad enough alone to cause a punishment.","replies":[]},{"poster":"Kei143","date":"2020-01-30T01:08:05.722+0000","up_votes":1,"down_votes":0,"body":"Thats because all a report does is to flag the system to review the game. **The toxicity score returned from the review will be the same regardless of how many times a player was reported within the same game.** It is also possible for the system to return a toxicity score of 0 if there was no toxicity found within the game. \n\n  That's why 1 report does the same thing as 9 reports and it's pointless to ask for reports.\n\nIt's purposely programmed that way to prevent premades from abusing solo players.\n\n---\n---\n---\n\nAsking/threatening for reports is considered a harassment because (you are thinking that) it threatens the safety of the account and no one wants to be threatened. \n\nIf something isn't cool, you tell them that their actions aren't cool, not threaten their account saftey. ","replies":[]}]},{"poster":"StuckInLimb0","date":"2020-01-29T04:43:32.419+0000","up_votes":1,"down_votes":2,"body":"sweet thanks, continuing to climb ! /muteall","replies":[]}]},{"poster":"KFCeytron","date":"2020-01-29T04:58:09.224+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=StuckInLimb0,realm=NA,application-id=ZGEFLEUQ,discussion-id=RUMwmF0B,comment-id=,timestamp=2020-01-29T04:01:56.933+0000)\n>\n> i told him i was gonna report him , and asked the other team to do so .\n\nWhy?","replies":[{"poster":"Urinetrouble07","date":"2020-01-30T00:38:13.545+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=ZGEFLEUQ,discussion-id=RUMwmF0B,comment-id=0002,timestamp=2020-01-29T04:58:09.224+0000)\n>\n> Why?\n\ndid you even read the post ?  Another troll runs rampid in the world of Lol and rito doesnt give a damn.  please read before posting","replies":[{"poster":"KFCeytron","date":"2020-01-30T00:58:12.319+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Urinetrouble07,realm=NA,application-id=ZGEFLEUQ,discussion-id=RUMwmF0B,comment-id=00020000,timestamp=2020-01-30T00:38:13.545+0000)\n>\n> did you even read the post ?  Another troll runs rampid in the world of Lol and rito doesnt give a damn.  please read before posting\n\nI did read it. My post stands. What was the purpose of telling that teammate that they would be reported, and what was the purpose of asking the team to report as well?","replies":[{"poster":"Urinetrouble07","date":"2020-01-31T20:25:48.522+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=KFCeytron,realm=NA,application-id=ZGEFLEUQ,discussion-id=RUMwmF0B,comment-id=000200000000,timestamp=2020-01-30T00:58:12.319+0000)\n>\n> I did read it. My post stands. What was the purpose of telling that teammate that they would be reported, and what was the purpose of asking the team to report as welI\n\nI'll ask again to read the post because you still haven't it states right in the post why.  Gotta love these trolls. GG","replies":[{"poster":"KFCeytron","date":"2020-01-31T22:41:01.412+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Urinetrouble07,realm=NA,application-id=ZGEFLEUQ,discussion-id=RUMwmF0B,comment-id=0002000000000000,timestamp=2020-01-31T20:25:48.522+0000)\n>\n> I'll ask again to read the post because you still haven't it states right in the post why.  Gotta love these trolls. GG\n\nNope, doesn't say why. Just says they did so, and then got punished. I'm asking why. Can you tell me why? Explain to me why telling someone you're going to report them and then encouraging everyone else in the match to report as well is the correct course of action to take.","replies":[]}]}]}]}]},{"poster":"Doofy The Yam","date":"2020-02-06T23:39:37.407+0000","up_votes":1,"down_votes":0,"body":"Everytime someone makes a post like this, its just brilliant. Just top being toxic lmaoooooo. Its so obvious you HAD to throw shade at him. The system doesnt falsely ban people. If it does, just submit a ticket and they are very quick to assist.","replies":[]},{"poster":"Kei143","date":"2020-01-29T12:59:02.381+0000","up_votes":1,"down_votes":0,"body":"The system punishes based on consistency x severity, meaning you can be punished for 1 game of extreme toxicity or many many games of mild toxicity. \n\n\n\nThink of behavioral system like a health bar (or tension meter) in music games. When you hit the note at an off beat,  your tension meter  increases. When you completely miss a note, the meter increases by alot. When you hit the note at good timings, it reduces the meter.\n\nRiot's behavior system works the same way, as in we all have a toxicity meter attached to our accounts. When players are mildly toxic, it goes up a tad. When people use hate speech, it pretty much fills up the meter. of course, clean games reduce the meter. \n\n\n\nIt is possible for playerA to get punished and playerB not to, even though playerB was waaayyyyy more toxic . Let's say playerA started the game with the toxicity meter at 95% and playerB's at 35%. Ingame, playerB said some pretty nasty shit and playerA responds with some small shit as well. After the game, playerA gains 10% toxicity and playerB gains 50%. Now playerA is at 105% toxicity and gets punished, whereas playerB is at 85%, and not punished in that specific game, even though playerB was found to be 5x more toxic than playerA in that game. \n\nTypically,  report callers don't know that asking for reports is considered a harassment,  so they do that over many games and eventually they get punished. \n\nBtw, 1 report does the same thing as 9 reports. All a report does is to flag the system to review the game. The toxicity score returned from the review will be the same regardless of how many times a player was reported within the same game. It is also possible for the system to return a toxicity score of 0 if there was no toxicity found within the game.","replies":[]},{"poster":"Inkling Commando","date":"2020-01-29T04:20:33.551+0000","up_votes":3,"down_votes":5,"body":"short version: riot looks at it then throws it away.\n\nlong version: asking for reports in itself is toxic and is more likely to get you punished than the actual toxic player. as for chat logs, there should be a button saying copy text and it'll be attached to your mouse where you right click and hit paste. but don't bother. that'll just earn you a mountain of downvotes and as many players saying you deserved it without even reading the chat logs to begin with.","replies":[{"poster":"StuckInLimb0","date":"2020-01-29T04:43:59.155+0000","up_votes":1,"down_votes":3,"body":"awesome man /muteall *continues climb . LoL is literally like a movie haha","replies":[]}]}]}