{"poster":"ACHER0NTE","date":"2019-12-31T11:04:48.453+0000","title":"ATTENZIONE! LA SQUADRA HULK HA APERTO I BATTENTI!  Cerco giocatori Per team serio","subforum":"Reclutamento","up_votes":1,"down_votes":0,"body":"Buon giorno!\r\nIl  mio Nickname è Acher0nte e sono main top gold 3 (il mio ruolo preferito è il tank), con la nuova stagione in arrivo e grazie all'esperienza acquisita sono pronto a formare una squadra , probabilmente con un mister.\r\nIl ritrovo avviene 2 volte a settimana per allenamenti, si svolgeranno tornei con data concordata.\r\nL'obiettivo di questa squadra è migliorare insieme e condividere questa esperienza , infatti mi auguro che grazie all'aiuto di squadra sarà possibile migliorare principalmente la meccanica del giocatore e nel macro game.\r\nCerco giocatori seri pronti a condividere questa bella e faticosa esperienza.  (gold/platino) 3 regole soltanto: serietà negli allenamenti, ascoltarsi tutti (per ammettere e migliorare dagli errori commessi) , no flammer.  \r\n\r\nSe siete interessati mandatemi la richiesta e scrivetemi su lol o direttamente qua. \r\nCi saranno provini per valutare principalmente la vostra mentalità e conoscenza del gioco, in modo da formare una squadra efficace nel miglioramento data la sintonia tra i membri.","replies":[{"poster":"xSoLDaTiNo","date":"2020-01-02T17:27:31.091+0000","up_votes":2,"down_votes":0,"body":"bell'educazione ciccio...","replies":[]},{"poster":"Akashä","date":"2020-01-09T12:56:54.432+0000","up_votes":1,"down_votes":0,"body":"Ciao, ti ho aggiunto su lol, siamo adc e supp g1 e g2, cerchiamo anche noi un team serio!","replies":[]},{"poster":"Reformed Godless","date":"2020-01-03T19:57:10.953+0000","up_votes":1,"down_votes":0,"body":"Credo di rispettare tutto quello che hai scritto.\nIgn: Reformed Godless \nAggiungimi anche solo per conoscerci","replies":[]},{"poster":"parky82","date":"2020-01-03T17:12:13.291+0000","up_votes":1,"down_votes":0,"body":"sono b4 raggiunto con le mie sole forze ho 37 anni mi reputo una persona seria non so se puoi considerare anche elo inferiori da quelli postati gli altri requisiti sono sicuro di poterli soddisfare tutti main mid / secondario supp","replies":[]},{"poster":"Kryshiva","date":"2020-01-01T14:41:09.831+0000","up_votes":1,"down_votes":0,"body":"Ciao sono KuchikiByakuya88 sono adc/supp","replies":[]}]}