{"poster":"luke11","date":"2015-08-12T01:25:59.185+0000","title":"¿¿Por que la culpa siempre es del jg??","subforum":"Comportamiento del jugador","up_votes":8,"down_votes":1,"body":"No se ustedes pero ya me canse ser Jg y que mis compa&ntilde;eros nunca quieran asumir la culpa de sus actos, realmente esto genera que cada ves tenga menos ganas de jugar Jg que es mi rol preferido\r\nSi alguien lee este post no flamee al Jg por que no te gankeo, piensa lo que hiciste mal y trata de mejorar en ves de salirte por la tangente y echarle la culpa otro, aparte si tu Jg no gankea o esta en otra linea no empezes a flamearlo, ya se que el Jg esta para ayudar pero si lo molestan menos lo va a hacer{{item:3151}}","replies":[{"poster":"César","date":"2015-08-12T20:05:11.601+0000","up_votes":3,"down_votes":0,"body":"porq este juego en realidad se deberia llamar, el jungla+4. los otros 4 rellenan el mapa mientras el jungla hace todo. Un gran poder conlleva una gran responsabilidad.","replies":[]},{"poster":"Neo Gaussrik","date":"2015-08-12T14:04:59.418+0000","up_votes":2,"down_votes":0,"body":"Siento que es porque el junglero es el jugador con mayor influencia en todo el mapa; por eso, cuando las cosas estan mal, y no quieres admitir que es tu culpa, lo mas facil es culpar a la siguiente persona que podria ser responsable de este fracaso.\n\nEn el caso de bot, es el compañero (support / ADC). Alternativamente, para todos, es \"valido\" decir que podria haberles ido mejor si el junglero lo hubiera apoyado...","replies":[{"poster":"warrior530","date":"2015-08-12T15:34:17.602+0000","up_votes":2,"down_votes":0,"body":"Que haces cuando el ADC se tira 1 vs 2 y es \"tu culpa\", dejando de lado que estabas en base y era tu culpa igualmente","replies":[]},{"poster":"luke11","date":"2015-08-12T15:00:42.355+0000","up_votes":1,"down_votes":0,"body":"Como el jungla va a poder ayudar a su equipo si no son capases de hacer seguimiento a las jugadas?, aparte el jg no siempre puede estar en todos lados o esta en top o esta en mid o esta en la parte de arriba del mapa farmeando y aparte el jungla no tiene por que hacerse responsable de las cosas mal que hiciero su equipo\nY creeme que es muy dificil gankear a alguien que en el fondo no quiere ser gankeado por que o no te ayudan o cuando te ayudan se van para atras en la jugada\nY otra cosa, es muy difcil gankear un enemigo que al min 5 va 4/0 y que a tu mid laner le saca 2 lvl y a vos 3","replies":[{"poster":"Neo Gaussrik","date":"2015-08-12T15:27:30.487+0000","up_votes":1,"down_votes":0,"body":"Hm, creo que malentendiste la intencion de mi comentario.\n\nNo estoy justificando la actitud de culpar al junglero; es una actitud no justificada.\n\nDicho eso, si necesitas entender el \"porque\", es basicamente porque:\n\n* Tu objetivo es culpar a alguien, y no quieres culparte a ti mismo\n* El junglero siempre pudo, en potencia, haber hecho una diferencia en tu linea\n\nY por eso es que estas personas le echan la culpa al jg. No les estoy dando la razon.","replies":[{"poster":"luke11","date":"2015-08-12T22:17:55.377+0000","up_votes":1,"down_votes":0,"body":"Segun usted no entendi el mensaje, pero como no voy a entender el mensaje si me encanta ser jg ya se que el jg hace la diferencia pero no cuesta mucho ganar linea\nyo me jugue una con lee sin en top carrea la partida yo mi mid al min 10 0/5 adc 0/4 sup 0/6 jg 0/2 y lo peor que el jg murio para salvar a bot\nen toda la partida insultaron al rammus que era el jg y yo que hacia lo defendia por que se lo que es que siempre sea culpa del jg y es muy molesta ver gente que no gana linea siendo un juego de farmear, y si te van ganando solo juga pasivo no sigas fedeando","replies":[{"poster":"Rayxah","date":"2015-08-13T03:12:05.294+0000","up_votes":1,"down_votes":0,"body":"Seguis sin entender lo que te quiso decir. Te lo resumo:\n\nLo que quiere decir, es que es mucho más fácil echarle la culpa al jungla, que aceptar que te mataron por pushear 24/7 sin visión alguna, por divear bajo torre con 100 de vida, o algún otro error que hayas podido cometer. Si te gankean mucho porque no dejas de pushear, la culpa es de tu jungla por no ir, morir bajo torre pero regalarle el doble kill a él.\n\nMucha gente se enoja \"porque no los ayudas\" cuando los primeros 10 minutos de la partida estuvieron jugando en el límite del rango de la torre enemiga, sin ward's, yendo 0/5/0 y comprando más daño pese a que estas perdiendo por paliza.\n\nNo está justificando nada, sino al contrario.","replies":[{"poster":"luke11","date":"2015-08-13T03:41:17.061+0000","up_votes":1,"down_votes":0,"body":"Te denuncio por sabiondo :c","replies":[{"poster":"Rayxah","date":"2015-08-13T04:30:07.286+0000","up_votes":1,"down_votes":0,"body":"Eee report, afk.","replies":[]}]}]},{"poster":"GodOfTheDarkness","date":"2015-08-13T03:43:25.180+0000","up_votes":1,"down_votes":0,"body":"Parece que no entendes lo que te quiso decir","replies":[]}]}]}]},{"poster":"More Powder CLEO","date":"2015-08-12T17:08:22.751+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=PJAKt7ph,discussion-id=kxJanIj6,comment-id=000a,timestamp=2015-08-12T14:04:59.418+0000)\n>\n> Siento que es porque el junglero es el jugador con mayor influencia en todo el mapa; por eso, cuando las cosas estan mal, y no quieres admitir que es tu culpa, lo mas facil es culpar a la siguiente persona que podria ser responsable de este fracaso.\n> \n> En el caso de bot, es el compañero (support / ADC). Alternativamente, para todos, es \"valido\" decir que podria haberles ido mejor si el junglero lo hubiera apoyado...\n\ndisculpe señor rito..\nYo en la ultima partida cuando hiba jax jg...el top era un feeeder.no farmeo nada..yo tenia que bancarme al heca que se me metia a la jg lo mataba y venia el top rival(el WU)a rematarme.Tanto mid y top me acharon la culpa....claro yo voy a poder contra dos yo solito\nAl final la ganamos gracias a mi!...pero claro los yasou piensan que son los carreer de la partida y nos faltan el respeto a todos los jg\nGracias","replies":[]}]},{"poster":"xBlackOut","date":"2015-08-12T04:57:05.891+0000","up_votes":2,"down_votes":0,"body":"El jungler es el que pone presion en el mapa, el que ayuda a todas las lanes, el que controla los objetivos, el jungler es el 5to que no esta en ninguna lane, es el que hace la diferencia, si tu team no pone wards y el otro jungler gankea free sigue siendo tu culpa por no imaginarte donde va a ir el jungler enemigo y hacer countergank. Si es que tu team no es demasiado desastrozo y todas las lanes enemigas hacen snowball el jungler siempre carrea.. Siempre se puede campear al que pensas que te puede ayudar a carrear y ganar el game de a 2","replies":[{"poster":"luke11","date":"2015-08-12T15:04:23.398+0000","up_votes":1,"down_votes":0,"body":"No es culpa del jungla yo leo a los junglas enemigos y les aviso e igual mi equipo se come el gank, compro piedra de vision para poner ward no solo para hacer jugadas con lee sin y es muy molesto que el otro jg haga ganks malos y que tu equipo se lo coma por no tener a vision aparte no es que sean ganks malos es que es un pj que no tiene enganche a eso me referi no tiene enganche ni acercamiento pero cuando te das cuenta el jg enemigo va 2/0 o mas","replies":[{"poster":"NGreppi","date":"2015-08-17T21:01:10.741+0000","up_votes":1,"down_votes":0,"body":"Lo que dijo \"The Eve Cookie\" es lo que diferencia un jungler bronce a uno diamond, la cosa no es avisar, es estar AHÍ, esperando para luego destrozarlo cuando gaste todo en el laner o lo agarren 2v1 cuando el laner enemigo esta distraído.","replies":[]}]},{"poster":"Taxonometrist","date":"2015-08-12T10:26:16.007+0000","up_votes":1,"down_votes":0,"body":"\"si tu team no pone wards y el otro jungler gankea free sigue siendo tu culpa por no imaginarte donde va a ir el jungler enemigo y hacer countergank\"\nsi no hay ni un ward, maestro, como podes al menos saber por donde anda el otro jungla? si el mid pone un ward y evita ser gankeado, al menos ves q el jungla salio para bot o top y podes ir a contrajunglear. pero si no hay vision con la imaginacion no alcanza. PONE WARDS","replies":[{"poster":"xBlackOut","date":"2015-08-13T00:59:39.928+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Taxonometrist,realm=LAS,application-id=PJAKt7ph,discussion-id=kxJanIj6,comment-id=00060000,timestamp=2015-08-12T10:26:16.007+0000)\n>\n> \"si tu team no pone wards y el otro jungler gankea free sigue siendo tu culpa por no imaginarte donde va a ir el jungler enemigo y hacer countergank\"\n> si no hay ni un ward, maestro, como podes al menos saber por donde anda el otro jungla? si el mid pone un ward y evita ser gankeado, al menos ves q el jungla salio para bot o top y podes ir a contrajunglear. pero si no hay vision con la imaginacion no alcanza. PONE WARDS\n\nCulpa del jungler por no wardear las entradas a la jungla enemiga, ademas, con experiencia, si tenes a bot pusheado hace 5 minutos y sabes que la vi enemiga empezo en golems, si la vi es viva, va a hacer golems, espectros, red y va a ir bot a sacar el fb. Si tenes experiencia en la jungla, vas a saber que ruta va a hacer el otro jungler o al menos imaginarla y saber por donde va a ir y donde va a intentar gankear, si necesitas wards para saber eso, falta experiencia. Mil veces fui a una lane y me tiran back y yo les escribo \"espero a *jungler enemigo* y el jungler enemigo siempre viene, se gastan todo en mi laner, cuando se confian en que lo van a matar aparezco full hp y los matamos o les hacemos quemar spells, no es tan dificil. El jungler es el que hace la diferencia, tiene el control de moverse por todo el mapa, el top tambien puede marcar la diferencia con buenos tps y el mid con un buen roaming, la diferencia es que podes avisar los \"mias\" de esas lanes, del jungler no podes, y si jugas shaco, evelynn o rengar (lvl6) es muchisimo mas facil gankear y hacer snowball","replies":[]}]}]},{"poster":"Rayxah","date":"2015-08-12T01:31:35.087+0000","up_votes":2,"down_votes":0,"body":"Sí, por ahi te cansa un poco. A mi también me encanta ir jungla, pero siempre tenes el que pierde la línea y se queja de \"no tener jungla\" porque les pushea bajo torre, lo gankean y lo matan todo el rato... \n\nNo te ayudan al inicio, no te ayudan en la contra jungla o te dejan tirado en los gank's y después porque tenes que estar 45 minutos farmeando para alcanzar a un Master Yi que va 45/0/0 porque se cansó de matarte mientras tu compañero pasaba por al lado tuyo, y ENCIMA te echen la culpa xD...","replies":[{"poster":"luke11","date":"2015-08-12T02:12:30.031+0000","up_votes":1,"down_votes":0,"body":"Gracias por entender mi problema\nsi queres algun dia jugamos una partida","replies":[{"poster":"Rayxah","date":"2015-08-12T02:57:28.697+0000","up_votes":1,"down_votes":0,"body":"Dale, aunque si no me gankeas te reporto (?).","replies":[{"poster":"luke11","date":"2015-08-12T03:02:06.237+0000","up_votes":1,"down_votes":0,"body":"Report\nAfk","replies":[{"poster":"GodOfTheDarkness","date":"2015-08-13T03:45:30.847+0000","up_votes":1,"down_votes":0,"body":"Yo siempre dije que el amor si se puede encontrar en el LoL. (?","replies":[]}]}]}]}]},{"poster":"LPG Erwinheimer","date":"2017-11-23T20:21:34.576+0000","up_votes":1,"down_votes":0,"body":"Sos un ascoo chabon, sos el tipico rata que no le ve nada de malo al JG... Entonces si jg segun TÙ no tiene nada de malo y es un ser PERFECTO. Para que mier!Q!\"· lo puse riot games?... \nClaro, todos los jg dicen y salen con la misma excusa...","replies":[]},{"poster":"GRoiNa","date":"2015-08-17T21:23:08.578+0000","up_votes":1,"down_votes":0,"body":"La culpa es del equipo o de uno mismo. La gente que echa la culpa a un solo jugador es la típica que no puede ver sus propios errores.\nReconocer las cosas propias es un avance si se quiere mejorar en el juego.\nTodas las personas que acusan a alguien de perder deberían ser reportadas, a mi parecer.","replies":[]},{"poster":"NGreppi","date":"2015-08-16T16:33:07.057+0000","up_votes":1,"down_votes":0,"body":"Porque? Porque no quieren tener la culpa. Como solucionarlo? /mute all. Preocúpate en tu propio juego, asi estoy mejorando yo. Ah, y te recomiendo Nigthblue y su serie de Bronce a Chalenger, uso a casi todos los junglas y te da consejos. Espero haberte ayudado.","replies":[{"poster":"DieOrSovngarde","date":"2015-08-17T02:54:31.935+0000","up_votes":1,"down_votes":1,"body":"Mutear no es la soluicion; es más fomentas a que todos se nieguen a coperar. Pero bueno, tu solucione es básica. No aporta nada.","replies":[{"poster":"NGreppi","date":"2015-08-17T20:56:28.226+0000","up_votes":1,"down_votes":0,"body":"Y que vas a hacer? Ir a la casa y pedirle al nene que deje de echar la culpa cuando el se diveo a nivel 2? Los pings ya son bastante comunicación.","replies":[]}]}]},{"poster":"Wutso","date":"2015-08-17T18:57:22.363+0000","up_votes":1,"down_votes":0,"body":"ademas de que el jungla no es omnipresente y no puede gankear las tres lineas a la vez... miren el mapa que para algo lo pusieron si no lo ven y ustedes estan pusheados jueguen con cabeza y compren wards que no solamente se los venden al supp.. y si pierden lineas no culpen al jungla que no gankea.. pidanle ayuda pero dense cuenta que es tu culpa y que el te podria estar diciendo que no ira por que tu enemigo va 0 10... y no le parece razonable... pero va y te ayuda..","replies":[]},{"poster":"N0pe","date":"2015-08-14T17:34:35.309+0000","up_votes":1,"down_votes":0,"body":"No siempre es la culpa del jungla, y no siempre es la culpa del que esté en la linea.\n\nHay veces que con asomarte apenas en una línea la ganas (si te sabés bien cuando es fuerte cada campeón y cuando no)\n\nY también hay otras veces en las que podés tranquilamente farmear bajo torre porque el jungla tiene que estar en otro lugar o simplemente no puede ganar las 3 líneas si pierden.","replies":[]},{"poster":"MzaArg","date":"2015-08-12T16:25:50.326+0000","up_votes":1,"down_votes":0,"body":"Creo que para ser buen jg tenés que ir a gankear desde el nivel 2 o 3. Si sos de los típicos junglas que solo van a gankear a partir del nivel 6, salvo que a tu equipo le esté yendo bien en las líneas, vas a ser punto de críticas fijo. De lo contrario pasas desapercibido, pero me parece que la idea del JG es gankear constantemente y ser de ayuda en todas las líneas desde los 5 minutos de juego, para obtener asistencias, kills, torres y de esa forma someter al equipo rival.","replies":[{"poster":"luke11","date":"2015-08-12T22:27:31.258+0000","up_votes":1,"down_votes":0,"body":"SI gankeas sin parar te quedas atras de lvl vos sos lvl 6 y el otro el lvl 8 como le podras hacer un 1 vs 1?","replies":[{"poster":"MzaArg","date":"2015-08-13T00:17:53.293+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=luke11,realm=LAS,application-id=PJAKt7ph,discussion-id=kxJanIj6,comment-id=000d0000,timestamp=2015-08-12T22:27:31.258+0000)\n>\n> SI gankeas sin parar te quedas atras de lvl vos sos lvl 6 y el otro el lvl 8 como le podras hacer un 1 vs 1?\n\nNo se trata de gankear sin parar, y no perdés lvl, o yo nunca pierdo lvl, no me ha pasado. Se trata de ayudar un poco en cada línea y vas a ver cómo lo ayudas a tomar un poco mas de confianza al equipo y al equipo rival le marcas un poco la cancha demostrando que sos un jg presente, eso los vuelve mas defensivos y no avasallan tanto en las lineas..","replies":[]}]}]},{"poster":"Murder Dealer","date":"2015-08-12T03:33:26.322+0000","up_votes":1,"down_votes":0,"body":"Osea mientras estemos hablando de flameo sin razón esta todo bien, otra cosa es pickear lee sin por ejemplo que es un jungler de early y no hacer nada, y solo farmear la jungla... tambien si ves que el otro jungler esta gankeando top y le esta haciendo la vida imposible y vos no gankeas ni mid ni bot, o lo ayudas... y si te vas a tener que aguantar el flameo, porque tampoco es culpa del top si lo están tryhardeando.\nSer jungler es manejar los tiempos de las lineas, ademas de los monstruos. Es lo mas difícil de lol.","replies":[{"poster":"luke11","date":"2015-08-12T23:32:39.238+0000","up_votes":1,"down_votes":0,"body":"Mi main es lee y creeme que si no podes gankear con lee es por que o esta todo pusheado o el enemigo ya va 2/0","replies":[]}]},{"poster":"MANOLOL0909","date":"2015-08-12T23:27:31.377+0000","up_votes":1,"down_votes":0,"body":"ES CULPA DEL JUNGLER","replies":[]},{"poster":"Yrox the Third","date":"2015-08-12T21:18:22.640+0000","up_votes":1,"down_votes":0,"body":"Si vemos la influencia que tiene cada uno en la partida seria: (de mayor a menor)\n1)Jungla: Su role literalmente es ayudar a las otras lineas.\n2)MID: Los mid (mas asesinos que magos pero no los deja afuera) ademas de intentar ganar su linea, son los que tienen la mejor posicion para ayudar a TOP y BOT.\n3)TOP con TP: Gracias al TP y que generalmente o lleva un TOP tanke otorga la mayor resistencia al team y deberia ser el personaje que llegue a un punto que sea indestructible, empezar Team fights, y separar o \"zonear\" a los que hagan mayor daño (Generalmente ADC y MID, pero pueden ser algunos JG y pocas veces [conociendo el meta actual] el TOP).\n4)Support: Los supports van ayudando por todo el mapa ya que (aunque todos deberian wardear, los sups generalmente son los unicos que se compran el objeto de wards) wardean todo el mapa, mantienen la vision ahi, protejen a sus aliados y aseguran las Kills.\n5)TOP sin TP: La ayuda que aporta al team es bastante baja, en el caso de que sea un Top sin tp contra otro Top sin tp espera a que lleguen al minuto 20 los 2 0/0/0 con mas de 150 de farm y aun con un objeto ya que no han podido volver ni matar al otro.\n6)ADC: Espera a que tu team le baje 99,99999999999999% a un objetivo y dale el ultimo golpe, repetir hasta poder matar a alguien 1 vs 1.","replies":[]},{"poster":"GødLîkë","date":"2015-08-12T21:09:07.162+0000","up_votes":1,"down_votes":0,"body":"porque lo usan de chivo expiatorio cuando no ganan su linea y no saben admitir sus propios errores, deje de mainear jg por esto.","replies":[]},{"poster":"onlyprox","date":"2015-08-12T19:43:58.215+0000","up_votes":1,"down_votes":0,"body":"Para mi, lo que pasa es que ultimamente la gente busca culpar a otro de su equipo, porque a ellos no les fue bien en su linea...muchos de los que jugamos jg nos pasa esto de que nos flameen o nos echen la culpa a nosotros por que no gankeamos o por estamos en otra linea.Lo que pasa es que la mayoria de las personas no entienden que el juego no se basa en una sola linea feed sino en que todas esten lo mejor posible, si una esta mal porque les fue mal en la fase de lineas, no por eso tiene que culpar al jg, sino que deben asumir su equivocacion y ayudar a las demas lineas.","replies":[]},{"poster":"Ode to dark","date":"2015-08-12T19:35:53.556+0000","up_votes":1,"down_votes":0,"body":"El \"mute all\" siempre lo soluciona todo :3","replies":[]},{"poster":"Sirek","date":"2015-08-12T18:16:36.707+0000","up_votes":1,"down_votes":0,"body":"_**\"El junglero siempre pudo, en potencia, haber hecho una diferencia en tu linea\"**_\n\nDisculpa, ¿Como vas a marcar la diferencia si tu TOP mantiene la linea push en la torre enemiga? ¿Me quedo cerca para que no lo gankeen? \n\nRespuesta 1, Gankeao bot y mid para asi asegurar el dragon, pero el TOP no lo entenderan y lo mataran 5 veces al minuto 15 por que constantemente lo gankearon. La culpa sera del Jungler, resultado, empieza a trollear.\n\nRespuesta 2, me quedo cerca protegiendolo, le compro un Pink y le doy visión con el escarabajo del rio, Lo matan por que lo gankearon y no miro el mapa... La culpa es del jungler y del mid por no hacer MIA....\n\nDa lo mismo lo que hagas, la culpa siempre sera del Jungler para los demás.","replies":[]},{"poster":"I am bl4z","date":"2015-08-12T17:59:18.857+0000","up_votes":1,"down_votes":0,"body":"Cuando jugaba Yi Jg me dedicaba a farmear y farmear me puteaban y todo, pero engordaba tanto a este champ que en late la ganaba solo, depende que juegues, creo yo. Por ejemplo jugando {{champion:64}}  o {{champion:5}} la idea es aprovechar su early y preferir gankear a farmear ya que decaen en late game y tendrás que tanquearte.\nSiempre actuó según lo conveniente para el equipo, les parezca bien o mal si logro carrear tendría mi tarea hecha, si empieza uno a flamearte apoya a los que veas con futuro durante la partida y listo, tiltea al top para que se vaya afk y GG","replies":[]},{"poster":"TORRESjr","date":"2015-08-12T17:14:08.403+0000","up_votes":1,"down_votes":0,"body":"El tema es que la gente ama los junglas de early. el que al level 3 te gankea, un shaco, eve, xin, pantheon. jax. No vayas a pickear ww por favor! ww no te gankea hasta el 6 y ahi se mueren.\nPD: me encanta ir con ww","replies":[]},{"poster":"JaviSpike","date":"2015-08-12T16:01:42.012+0000","up_votes":1,"down_votes":0,"body":"a veces, solo a veces, en particulares situaciones el jg tiene q saber identificar q linea pierde el early y ayudarlo, pero gralmente pierden la linea por culpa propia y hechan la culpa al jg que no tiene nada que ver xD el clasico\" el jg de ellos me gankeo x veces\"","replies":[]},{"poster":"Blooder X","date":"2015-08-12T15:41:08.741+0000","up_votes":1,"down_votes":0,"body":"Es más fácil escribir \"jungler puto no gankea y se va a la B metro\" que asumir la responsabilidad y aprender a jugar.","replies":[]},{"poster":"ReinhardtVon","date":"2015-08-12T11:13:29.680+0000","up_votes":1,"down_votes":0,"body":"por que muchos ponen reglas ridiculas, gank a x nivel, gank bot, mid, top,  en el min tal, te gank con dos de vida y regalan buff , o por q simplemnete ignoran tu linea ayer en una partida lo llame al minuto 10 por q me superaba el otro, no fedee pero con uno o dos gank se ganaba la linea, desde el minuto 10 hasta lo 20 lo debo haber llamado unas 7 u 8 veces solo moti una vez y gank recien en el min 30 cuando se dio cuenta hace rato no estabe en linea y qu tiraron las dos torretas de esa linea en ese momento me llamaba y acordaba se excusaba que estaba en otra lineas que no podia venir pero en 30 min, solo un gank y por las torretas mis llamados los ignoro pero si campeo toda la partida bot y mid","replies":[{"poster":"luke11","date":"2015-08-12T15:05:18.098+0000","up_votes":1,"down_votes":0,"body":"Ganaste¿¿","replies":[{"poster":"ReinhardtVon","date":"2015-08-12T15:37:55.133+0000","up_votes":1,"down_votes":0,"body":"dificil, cualdo se avivo no habia les faltama una torreta para el inhibidos en top y la linea q campeaba daban pena, se pedio a los 25 por surrender","replies":[]}]}]},{"poster":"ThunderFOX","date":"2015-08-12T01:31:01.420+0000","up_votes":1,"down_votes":0,"body":"es cierto eso... dicen \"el jungla no gankea\" cuando gankeas miles de veces y ellos no ven el minimapa ni las señales","replies":[{"poster":"ReinhardtVon","date":"2015-08-12T11:21:55.341+0000","up_votes":1,"down_votes":0,"body":"el jg no gank cuando no aparece en tu linea y llega hasta el sapo cerca de top y vuelve a mid o bot, muchos hacen esto dejan al top solo, y si este comienza a fedear con o sin culpa putean, es funcion del jg elegir q linea ganken en funcion de como se desarrolla el juego","replies":[]}]},{"poster":"Lucrexio","date":"2015-08-12T03:40:55.966+0000","up_votes":1,"down_votes":0,"body":"La gente lo justifica por el hecho de que si los ayudabas en algún momento, tal vez no les hubiera ido tan mal. Algunas veces me sentido culpable porque estuve haciendo ganks en mid y bot, pero no en top, y mas si pierde la línea, pero la realidad es que los errores de la línea son culpa del que está en esa línea y punto.\nSi vos gankeas, lo haces mal, y encima le das una kill, ahi si es culpa del JG porque estas beneficiando al contrario. Tampoco hay q estar afk farm las 24 horas, alguna presencia tenes que tener.\nPero aun asi tenes razón, muchos se agarran de eso para reducir la culpa.","replies":[{"poster":"ReinhardtVon","date":"2015-08-12T11:17:00.973+0000","up_votes":1,"down_votes":0,"body":"es culpa tuya si no gank, es simple, el jg gank todo el mapa no solo una parte y si en la situacion que describis el otro jg si gank top y el otro top o el jg se fedea es responsabilidad del top si, pero tambien del jg que no gank como corresponde","replies":[]}]}]}