{"poster":"ExcAntimeta","date":"2018-06-22T06:03:02.848+0000","title":"Lo que sufre un Antimeta - Darius Supp \"FEEDER\"","subforum":"Comportamiento del jugador","up_votes":25,"down_votes":5,"body":"[](https://i.gyazo.com/fc40f9078c6b83285618350a95d28809.jpg)\n\nComo el nombre de mi cuenta lo dice... soy antimeta...\nNo voy a trollearte la partida ni nada de eso, solo iré antimeta...\n\nRecién jugé una partida como Darius Supp teniendo una Cait adc, EN NORMAL OCULTA... un pick que no es débil, pero su early es super lento como soporte. Por suerte, ibamos contra una composición de Draven-Alistar, lo que, a pesar de ser fuerte, se asemeja al pick (es más complejo un soporte de rango y mago en este caso)\n\nTuvimos una primera pelea algo atascada, por que me mande de cabeza al adc cuando lo vi desprotegido y a la vez alistar hizo lo mismo con mi cait, decidí retroceder y ayudarla, cosa que fue un error, por que deje volver al draven... muere mi adc, muere el draven, y las cosas quedan ahi.\n\nhttps://youtu.be/v2a-LwjSpGE\n\nLuego, en la siguiente pelea:\n \n-  Khazix se extiende mucho por el rio, y lo persiguen cassio y graves, al intentar ayudarle, cait se queda 1v1 contra alistar, y draven nos persigue al rio.\n- Muere Khazix, pero sin antes tomar la vida de Draven a cambio, en eso llega Riven desde top con tp, lo que deja la batalla 4v2 con cait a punto de morir solo por el alistar. \n- Por intentar ayudarle, tomo otra kill (mato a alistar) y cait se salva con un poquito de vida. (en este momento me llama KS por haber hecho eso, lo que asumo por que pudo habersela llevado ella, pero no se si moría o no por los otros 3)\n- ~~A todo esto, LB que debía estar a cargo de Cassio, estaba bajando, pero no terminó de bajar y fue a farmear. (Pero yo no vi esto)~~\n- Yo quede solo contra Riven, quien intento hacer una persecución fallida contra Cait quién estaba backeando. \n- Me puse a pelear contra Riven, y me percato que Cassio viene de vuelta con muy poco maná, pero yo pensaba, que LB venía bajando, entonces traté de baitearlos para que llegara alguien a matarlos intentando en todo momento quedarme bajo de torre. \n- Cuando veo que cait se reincorpora y Khazix viene en camino pensé \"_4vs2, si muero pueden matar a ambas_\", asi que tiro extenuar y me lanzo primero a morir para recibir el daño, pero acá fue cuando me di cuenta que LB no venía, y Khazix junto con Cait no siguieron la pelea por lo mismo. (en este punto le escribi por chat a LB que por que estaba farmeando)\n- Khazix quedando solo, intenta tomar la vida de Riven, lo cual falla completamente (por que riven estaba 2 lvls sobre el), y sufre un diveo de Draven que ya habia revivido.\n\nhttps://youtu.be/UVibWbpNlsI\n\nEsta pelea nos dejo a bot con:\n\n- Cait : 0/1/2 ............... // ...  Draven: 2/2/0\n- Darius (Yo): 2/1/1 ... // ... Alistar: 0/1/1\n\nLuego de esto, Cait me llama troll y feeder, lo que me descuadra totalmente, siendo que es la primera muerte que tuve, y fue LB la que no bajó a ayudar en todo ese desmadre que quedó... en realidad la culpé bastante por ello, dado que Cassio quedó mucho tiempo en bot y pudo haber llegado a matarla al menos.\n\nCuano Cait revive y seguimos discutiendo mi \"feedeo\" por chat, aviso de que voy a limpiar wards que habían puesto en el tribush, y ella avisa que atacara a alistar quien había entrado al primer bush de bot... se extiende, quedando entre draven y alistar quienes no pierden la oportunidad y la matan. OBVIAMENTE, me culpa a mi por haber ido a limpiar el ward...\n\nhttps://youtu.be/Wsc-RDw14A4\n\nLuego de eso, cait se va a top, y la partida prosigue hasta nuestra derrota\nCait termina 2/5/7 con 181 de farm nivel 13\ny yo... 6/5/7 con 141 de farm nivel 15\n\nLuego de la partida, me flammea, me trata como novato, que debo aprender, etc, etc, etc... y la única crítica que tome fue:\n> No te mandes de cabeza por la kill al adc mientras a mi me matan\n\nLo cual lo dijo luego de la primera kill que sufrimos en bot, y si acepto ese error.\n\n###### Videos en baja calidad y a 15 fps por razones de hacer ediciones rapidas.","replies":[{"poster":"Cacatúa Asesina","date":"2018-06-22T14:28:44.993+0000","up_votes":9,"down_votes":0,"body":"sinceramente en este meta encuentro mas troll que elijan caitlyn adc que darius supp xD","replies":[]},{"poster":"Quinntakill","date":"2018-06-22T06:55:36.445+0000","up_votes":7,"down_votes":2,"body":"Es una latima, pero es la comunidad que tenemos... varias veces mi adc se ha ido afk porque pickeo Quinn supp y para peor generalmente el resto del team lo apoya y termino comiendome los reports yo.\n\nEn mi opinión no hay nada que hacer aparte de ignorar los insultos y jugar lo mejor que puedas, ya que aunque empiecen con pesimismo, si ven que juegas bien empiezan a ponerle ganas.\n\nSuerte y sigue jugando lo que te guste y te divierta, no dejes que te desmotiven situaciones y jugadores como los que presentaste acá.\n\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Onslaught","date":"2018-06-22T06:13:59.550+0000","up_votes":4,"down_votes":0,"body":"Buenas, yo tambien juego antimeta para entretenerme .Y si he pasado eso XD .\n \nEn general es mas dificil en bot si te toca supp y vas algo que no es ''normal'' .Porque el adc generalmente se predispone mal ,y ni es que piensa que van a perder ,sino que parece que hacen todo lo posible para llevarte la contra y perder (si es consciente o inconsciente ya lo ignoro) .Al final como decis ,no perdes porque fuiste anti meta ,ni porque se feedearon del otro lado o en tu equipo feedearon y jugaron mal ,sino porque 1 directamente la vende por haber 1 personaje no meta .\n\nSi vas a otras lineas la tipica es que el jg no te gankee porque no sos un buen pick ,o que te dejen morir a proposito ,generalmente desperdiciando oportundiades de matar y hasta hacer exterminio ,solo para que te mueras por ser antimeta jajaja. Es divertido ,pero es riesgoso ,no tanto por ganar o perder sino por la actitud de tu team que te puede llegar a reportar ,por mas que termines muy positivo y siendo el unico bueno (si me ha pasado)\n\nEl mayor enemigo de un anti meta no es el win rate ,sino el desgano de sus compañeros","replies":[{"poster":"Pablincho","date":"2018-06-22T09:58:11.707+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Onslaught,realm=LAS,application-id=PJAKt7ph,discussion-id=1kTObEaF,comment-id=0000,timestamp=2018-06-22T06:13:59.550+0000)\n\n> Si vas a otras lineas la tipica es que el jg no te gankee porque no sos un buen pick ,o que te dejen morir a proposito ,generalmente desperdiciando oportundiades de matar y hasta hacer exterminio ,solo para que te mueras por ser antimeta jajaja. Es divertido ,pero es riesgoso ,no tanto por ganar o perder sino por la actitud de tu team que te puede llegar a reportar ,por mas que termines muy positivo y siendo el unico bueno (si me ha pasado)\n> \n> El mayor enemigo de un anti meta no es el win rate ,sino el desgano de sus compañeros\n\nEn base a lo que expones ¨el reporte¨ como riesgo, quiere decir que recibir reporte de manera injusta por asi decirlo reresenta una sancion indebidamente recibida por consecuencia de la falta de pericia del juego de determinados jugadores faltos de habilidad?\nEsto es elo frustrante que el sistema de reportes no diferencie entre personas que realmente tienen un mal comportamiento y otras que por desagrado de los demas simplemente son victimas de bulling mediante el reporte.\nDemas esta decir que el sistema es precario pero es tan basico como tomarse el tiempo de leer los reportes nada mas ni nada menos, nosotros invertimos tiempo de nuestras vidas en jugar esto que es invaluable, minimamente esperas ser juzgado de manera justa y no por un sistema hecho para que los caprichosos faltos de habilidad frustrados por perder o no entender el juego desidan sancionarte.","replies":[{"poster":"Onslaught","date":"2018-06-22T15:36:00.093+0000","up_votes":2,"down_votes":1,"body":"Bueno esta el caso de ese tipo que maineaba singed que lo banearon ...EL tipo jugaba bien y ganaba ,pero lo reportaban porque iba singed nada mas \n\n El sistema parece mas armado para defender al casual que al jugador que busca aprender e incluso profesionalizarse .Penaliza tan gravemente que te enfades e insultes o dictes ordenes para ganar que te obliga a jugar desinteresado .Desinteresado como esa gente que va cualquier cosa ,la juega mal ,se muere porque mira el cel  o directamente trollea .Te lleva a jugar igual porque tomar en serio el juego ,con todo lo que conlleva ,te lleva a malos ratos .\n\nYo con un amigo vamos duo bot random desde hace bocha ,antes de este cambio de meta ,y mas alla de todo terminabamos ganando si ibamos en igualdad ,perdiamos de tanto  en tanto era obvio ,pero en general ganabamos al duo clasico .El problema era que las que perdiamos ,era porque el jg enemigo y el mid venian a gankearnos dejandonos un 4v2 y nuestros respectivos compañeros no se molestaban en ayudarnos porque eramos ''trolls'' .Trolls que terminaban mejor de kda que todos los demas ,y los unicos con torres tiradas ,pero bueno ...asi es la vida del antimeta","replies":[]}]}]},{"poster":"DIOS TUTI","date":"2018-06-22T13:57:57.175+0000","up_votes":3,"down_votes":4,"body":"darius support? son normales o rankeds? si es rankeds, estas trolleando.","replies":[{"poster":"Excorpion","date":"2018-06-22T15:28:17.518+0000","up_votes":3,"down_votes":1,"body":"Dice normales en grande ahi..  .-.","replies":[{"poster":"DIOS TUTI","date":"2018-06-22T15:34:27.424+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Excorpion,realm=LAS,application-id=PJAKt7ph,discussion-id=1kTObEaF,comment-id=00070000,timestamp=2018-06-22T15:28:17.518+0000)\n>\n> Dice normales en grande ahi..  .-.\n\nse me paso, entre tanta victimizacion.\n\npd: son todos hipocritas aca, porque si les toca en ranked con darius support, no le van a venir a poner un positivo y a decirle ay pobresito lo flamean.","replies":[{"poster":"ExcAntimeta","date":"2018-06-22T16:06:18.723+0000","up_votes":1,"down_votes":0,"body":"La idea mia es llevar todos mis picks jg y supp.. a rankeds","replies":[{"poster":"DIOS TUTI","date":"2018-06-22T16:58:55.650+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=ExcAntimeta,realm=LAS,application-id=PJAKt7ph,discussion-id=1kTObEaF,comment-id=0007000000000000,timestamp=2018-06-22T16:06:18.723+0000)\n>\n> La idea mia es llevar todos mis picks jg y supp.. a rankeds\n\npobre del que te toque de aliado, porque mira tu op.gg, partida que vas antimeta, partida que fedeas.\n\nhttp://las.op.gg/summoner/userName=ExcAntimeta\n\n(partida que fuiste con champs meta, o en la posicion donde se deberian jugar, stompeaste)","replies":[{"poster":"ExcAntimeta","date":"2018-06-22T17:26:08.783+0000","up_votes":1,"down_votes":0,"body":"Eso tiene 2 explicaciones \n1 . No tengo aun a mis champs antimeta \n2 . Estoy en low lvl y normales por lo que entreno otros picks animeta igual.","replies":[]}]}]}]}]},{"poster":"Onslaught","date":"2018-06-22T15:50:39.628+0000","up_votes":1,"down_votes":3,"body":"Amigo...Darius en bot tiene mas win rate que casi cualquier supp clasico actualmente .Es mas ,si vas un tirador para mi estas trolleando y si vas un supp de utilidad lo mismo ...","replies":[{"poster":"DIOS TUTI","date":"2018-06-22T17:06:36.259+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Onslaught,realm=LAS,application-id=PJAKt7ph,discussion-id=1kTObEaF,comment-id=00070001,timestamp=2018-06-22T15:50:39.628+0000)\n>\n> Amigo...Darius en bot tiene mas win rate que casi cualquier supp clasico actualmente .Es mas ,si vas un tirador para mi estas trolleando y si vas un supp de utilidad lo mismo ...\n\npasame link de las estadisticas que decis, porque yo no encontre, darius support ni figura, lo mismo que en adcarry.","replies":[]}]}]},{"poster":"Salvor","date":"2018-06-22T12:04:04.653+0000","up_votes":3,"down_votes":0,"body":"Yo tambien juego sups antimeta ({{champion:3}} {{champion:59}} {{champion:33}} {{champion:516}} {{champion:79}} ) y cuando va mal te tratan de troll, es lo que un antimeta tiene que soportar, así como el jungla soporta todos los \"gg jg no gankea\" del que va 0/4 min 6.","replies":[]},{"poster":"Deus Fenrir","date":"2018-06-22T07:27:26.453+0000","up_votes":3,"down_votes":0,"body":"Darius Supp no lo veo tan fiable como un Darius adc jaja \nCon este meta el bruiser o Juggernaut se lleva en el rol de adc. Ya que con un supp \"con gancho\" {{champion:111}} {{champion:412}} {{champion:53}} etc,  tenes un monton de posibilidades de estompear la linea ya que el cc te permite meterle todas las cargas de la pasiva y partirle la nuca con tu R\nY Mejor si empezas con {{item:3078}} como primer item a buildear luego del {{item:3302}} para mantenerte en linea junto a tu sup con las pequeñas curaciones. ","replies":[]},{"poster":"Nuke","date":"2018-06-22T15:20:53.146+0000","up_votes":1,"down_votes":1,"body":"> y fue LB la que no bajó a ayudar en todo ese desmadre que quedó... en realidad la culpé bastante\n\nMal ahi, te ganaste mi -1\nIgual, si es Normal oculta mutea y jugá. Listo, no tenés que sufrir nada. Si sufrís es porque querés xD.","replies":[{"poster":"Excorpion","date":"2018-06-22T15:27:43.718+0000","up_votes":1,"down_votes":2,"body":"A mi me gusta sufrir: c","replies":[{"poster":"Nuke","date":"2018-06-22T18:43:24.155+0000","up_votes":1,"down_votes":0,"body":"VIVA LOS MASOQUISTAS!","replies":[{"poster":"Excorpion","date":"2018-06-22T19:11:35.740+0000","up_votes":2,"down_votes":0,"body":"Naaah si yo no los muteo.\nAsi veo que dicen para reportarlos mejor. La diferencia es que no respondo a esas personas.","replies":[]}]}]},{"poster":"ExcAntimeta","date":"2018-06-22T16:07:11.583+0000","up_votes":1,"down_votes":0,"body":"La culpe no significa que la haya insultado... solo el tipico:\n> LB cuando rayos dejas de farmear y bajas a ayudar??","replies":[{"poster":"Nuke","date":"2018-06-22T18:43:48.559+0000","up_votes":1,"down_votes":1,"body":"¿Qué tiene que ver que no hayas insultado? xD\nEchar la culpa a los demás me parece algo infantil. Y aun mas si es NORMAL selección oculta.","replies":[{"poster":"ExcAntimeta","date":"2018-06-22T19:07:08.391+0000","up_votes":2,"down_votes":0,"body":"Es un juego 5v5, cada uno hace su parte.\nSi yo veo que mi liner se fue hacia bot, no me quedo farmeando, congelo la linea y voy a contragankear para que la otra línea no se vea afectada. O respondo tomando torre, o gankeando la otra linea contraria.\nPero quedarse farmeando solo es una perdida para el equipo.\nO me equivoco ?","replies":[{"poster":"Nabuze","date":"2018-06-22T21:40:41.094+0000","up_votes":1,"down_votes":0,"body":"Podés hacer slow push o estampar la wave contra la torre enemiga pero para congelar tenés que estar si o si en la línea.","replies":[{"poster":"ExcAntimeta","date":"2018-06-22T21:44:36.124+0000","up_votes":1,"down_votes":0,"body":"Mata a los mage minions y la linea queda a tu favor\nHablamos de al menos 1 minuto que cassio estuvo libre casi sin mana y nadie la mato","replies":[{"poster":"Nabuze","date":"2018-06-22T21:50:09.164+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ExcAntimeta,realm=LAS,application-id=PJAKt7ph,discussion-id=1kTObEaF,comment-id=000a00020000000000000000,timestamp=2018-06-22T21:44:36.124+0000)\n>\n> Mata a los mage minions y la linea queda a tu favor\n\n\nEsto se llama slow push, congelar es algo distinto, lo demás que agregaste no venía al tema solo quería destacar ese error de concepto.","replies":[{"poster":"ExcAntimeta","date":"2018-06-22T22:20:38.084+0000","up_votes":1,"down_votes":0,"body":"Ahh yo pense que defendías la estrategia de LB...","replies":[{"poster":"Nabuze","date":"2018-06-23T00:31:17.679+0000","up_votes":1,"down_votes":0,"body":"- No se cuanto mana tenia.\n- Ni cuanto oro tenia.\n- Ni la ventaja o desventaja en items tenia.\n- Tampoco se que cooldowns tenia.\n- Tampoco se su nivel de confianza con el champ ya que es un lvl bajo.\n- Tampoco se que nivel de juego tiene dado que no jugo rankeds si es lvl bajo.\n\nNada que criticar por aqui. No suelo pedir que mis teamates hagan cosas que no corresponden con sus elos y tampoco cosas que \"si corresponden\" a sus elos. \nMe gusta jugar una partida sin discusiones por chats y se muy bien que hay muchas formas distintas de llegar a una cierta liga sin necesariamente estar balanceado en macro y micro y una cierta cantidad de champs.","replies":[]}]}]}]}]}]}]}]},{"poster":"Onslaught","date":"2018-06-22T15:49:47.858+0000","up_votes":1,"down_votes":0,"body":"Mutear hace que tus compañeros bajen a ayudar ,jueguen bien y no se suiciden o vayan a otras lineas a tirar la partida?","replies":[{"poster":"Nuke","date":"2018-06-22T18:45:55.426+0000","up_votes":1,"down_votes":1,"body":"> Mutear hace que tus compañeros bajen a ayudar ,jueguen bien y no se suiciden o vayan a otras lineas a tirar la partida?\n\nNo.\n Si tanto te molesta que jueguen mal, carrealos y ya está. Y si no sabés carrear, no les eches la culpa n.n","replies":[{"poster":"Onslaught","date":"2018-06-22T19:25:51.321+0000","up_votes":1,"down_votes":0,"body":"Osea...si tengo a 2 que se estan suicidando y regalan torres y objetivos ...No es que les estoy echando la culpa...Ellos TIENEN la culpa .Ademas no gana el mejor, sino el que tenga los menos malos .Ya paso la epoca de oro de lol donde si eras buenop podias stompear ,necesitas un minimo de coperacion .","replies":[{"poster":"Nabuze","date":"2018-06-22T21:43:32.307+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Onslaught,realm=LAS,application-id=PJAKt7ph,discussion-id=1kTObEaF,comment-id=000a000100000001,timestamp=2018-06-22T19:25:51.321+0000)\n>\n>Ademas no gana el mejor, sino el que tenga los menos malos\n\nSi estabas citando a faker era \"No gana el mejor jugador sino el que mejor carrea\" haciendo referencia a que el emparejamiento estaba mal y el que carreaba a sus malos jugadores podía subir de ligas / ganar pl.","replies":[{"poster":"Nuke","date":"2018-06-22T22:55:11.189+0000","up_votes":1,"down_votes":0,"body":"Estoy deacuerdo con Faker, pero...\n¿Qué diferencia hay entre uno y otro?","replies":[{"poster":"Nabuze","date":"2018-06-23T00:26:44.068+0000","up_votes":1,"down_votes":0,"body":"La verdad tambien me parecio redundante pero creo que se referia que al estar todos al mismo nivel se nota mas quien es mejor jugador.\nAl ser un mal emparejamiento es el que se aprovecha mejor de los malos jugadores del enemigo por eso seria el que mejor carrea y no el que mejor juega.\nAmbos equipos tienen jugadores peores no es como que todos los malos toquen de un lado pero no se nota cuando el que mejor carrea saca la ventaja antes. \nNo se me parece complicado.\nEn resumen quiere que el emparejamiento no tenga tanta diferencia de nivel diamantes y maestros bajos con challengers de muchisimos pl.\nSi todos tuvieran el mismo nivel se notaria mucho mas el juego en equipo que es en lo que se supone se basa league y no podria carrear 1 solo sin un equipo.\n\nPero definitivamente podes seguir carreando y mas si estas en una liga baja ahi tenes para aprovechar cosas a rolete.","replies":[]}]}]},{"poster":"Nuke","date":"2018-06-22T21:16:42.779+0000","up_votes":1,"down_votes":0,"body":"Si se suicidan, reportalos por Soporte.\nOjo, suicidarse no es tener una mala partida...","replies":[{"poster":"ExcAntimeta","date":"2018-06-22T21:20:44.896+0000","up_votes":1,"down_votes":1,"body":"Pero tu mismo hablas de feedear.. eso abarca lo intencional y no intencional...","replies":[{"poster":"Nuke","date":"2018-06-22T22:56:43.406+0000","up_votes":1,"down_votes":0,"body":"Yo hablo de gente que feedea. La que feedea por mala partida es aceptable y está bien. La que lo hace intencionalmente esta MAL y es reportable.\nHe tenido compañeros que iban 1/20 y solo por eso la gente ya le decía que era troll: NO. No estaba feedeando intencionalmente. Otra cosa sea que esté mal visto por vos, pero es un hecho que NO ES REPORTABLE.","replies":[{"poster":"ExcAntimeta","date":"2018-06-22T23:05:38.612+0000","up_votes":1,"down_votes":0,"body":"Tendrías que mencionar eso en el comentario anterior entonces, asi no causar confusion.\n\n> Otra cosa sea que esté mal visto por vos, pero es un hecho que NO ES REPORTABLE.\n\nPor que dices que es mal visto por mi... si no denuncio a ningun feeder ni nada de eso ???","replies":[{"poster":"Nuke","date":"2018-06-22T23:51:15.216+0000","up_votes":1,"down_votes":0,"body":"> Tendrías que mencionar eso en el comentario anterior entonces, asi no causar confusion.\n\n{{sticker:zombie-brand-facepalm}} \n\nVOS te confundiste.\nPor eso pongo esto en respuesta a TU comentario.\n\n> Por que dices que es mal visto por mi... si no denuncio a ningun feeder ni nada de eso ???\n\n1- No necesariamente tienes que hacerlo para eso.\n2- Es un ejemplo, no digo que sea asi.","replies":[]}]}]}]}]}]},{"poster":"ExcAntimeta","date":"2018-06-22T19:09:43.609+0000","up_votes":1,"down_votes":0,"body":"Disculpe señor challengur que puede carrear una partida en la season donde todos reclaman que el juego lo decide el mas malo de la partida y no el mas bueno.\n\nSe nota que usted sabe mas del juego que todos los profesionales juntos.","replies":[{"poster":"Nuke","date":"2018-06-22T21:17:45.007+0000","up_votes":1,"down_votes":0,"body":"A diferencia de vos, a mi me da completamente igual ganar o perder en una Normal...\nYo solo me divierto, me da igual si mi equipo feedea todos 0/20, con que yo me divierta me da igual. Y, si quiero ganar (como en rankeds), a la vez de perder el tiempo esperando que mi equipo me deje servida la partida, intento ganar YO y mejorar YO.\n\n¿Que el mid no hizo mias y me mato el midlaner enemigo por eso? Uf, bueno la próxima le presto mas atención al mapa.\n¿El top muere mucho? Debí haberlo gankeado mas seguido.\n¿Mi equipo no va por objetivos? Entonces los hago yo.\n\n\n","replies":[{"poster":"ExcAntimeta","date":"2018-06-22T21:19:55.700+0000","up_votes":1,"down_votes":0,"body":"A diferencia??? Me da igual ganar o perder .. mas si estoy entrenando un antimeta que nunca he usado... por que dices algo que no sabes ?\n\nSeguro yo no intento mejorar mid selecciones...","replies":[{"poster":"Nuke","date":"2018-06-22T22:57:08.049+0000","up_votes":1,"down_votes":0,"body":"Entonces si te da igual perder o ganar, ¿Por qué te quejas de los malos teams? ¿No te dejan divertirte? Come on xD","replies":[{"poster":"ExcAntimeta","date":"2018-06-22T23:06:34.866+0000","up_votes":1,"down_votes":0,"body":"Y quien se ha quejado de malos teams ???\nYo lo que cuento en este post, es la actitud del adc Caitlin, acusandome de Feeder por tener UNA muerte... que LB no haya bajado a ayudar, es algo que paso durante la partida, se menciono en 1 comentario, y fue...\n\nEstas leyendo este post Nuke ??","replies":[{"poster":"Nuke","date":"2018-06-22T23:48:43.573+0000","up_votes":1,"down_votes":0,"body":"¿Vos leés tu comentario?\n\n> que LB no haya bajado a ayudar, es algo que paso durante la partida, se menciono en 1 comentario\n\nTe quejás de LB, le echas la culpa. Entonces, no es que \"no te interesa perder o ganar\". Si no, no te hubieras quejado.","replies":[{"poster":"ExcAntimeta","date":"2018-06-23T00:18:08.850+0000","up_votes":1,"down_votes":0,"body":"Entiende que 1 accion no decidirá la partida, pero si hará que a la siguiente ocasión, ese jugador no se quede farmeando en mid y SI baje a ayudar... aún así podemos perder o ganar, pero el tipo aprendió de su equivocación de todos modos.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Mecha Sétt","date":"2018-06-22T07:09:23.458+0000","up_votes":2,"down_votes":0,"body":"Hola, creo que igual cabe destacar para la gente que no sepa que antimeta y trolear son cosas muy distintas. Antimeta es que juega algo poco comun en un rol poco visto. Ejemplo : Leona jungla; sin embargo son personas que tienen toda la intencion de ganar y hacen su mejor esfuerzo. Fuera de eso  puedes ser reportador por molestia en \"actitud negativa\" por jugadores, pero fuera de eso no deberias tener problemas, a veces hasta se carrea, ayer jugue con un singued ADC que carreo junto a mi.","replies":[]},{"poster":"Casel2","date":"2018-06-22T07:43:12.261+0000","up_votes":5,"down_votes":7,"body":"Con toda la variedad de pick raros en pocisiones nuevas que hay vas darius supp enserio? puedes excusarte con decir que eres un antimeta pero para la gente que juega para sacarse un cofre o un S para maestria eres una molestia total, no importa que sea una normal y es reportable tu pick fuera de lugar.\nAlfin se pueden jugar soportes de pockeo, morde adc, aparece karthus en mid, y todos los luchadores de adc y vos vas darius supp? para eso mandalo de adc que ese es el meta actual.\nPero decir que pickeas eso porque eres un antimeta para la gente que juega para ganar, para sacar cofre o maestria es como decir, \"me dejo matar porque el enemigo me mato ya 3 veces y creo que merece matarme mas, pero no es trolleo ni muerte intencional ee\" porfavor papu.","replies":[{"poster":"ExcAntimeta","date":"2018-06-22T16:05:19.051+0000","up_votes":1,"down_votes":0,"body":"Esa es la idea de mi cuenta.. ir antimeta.\nNo es trollear y juego para ganar.\nPuedes ver como termine mejor que el adc que me insultaba.","replies":[{"poster":"Casel2","date":"2018-06-23T09:58:15.863+0000","up_votes":1,"down_votes":1,"body":"Bro, entendi lo que dijiste y entendi perfectamente tu punto de vista pero a lo que yo iba es el punto de vista de la gente que se enoja por tus picks que sigue siendo valido para el reporte, no digo que lo hagas por trollear pero a los ojos de los demas claro que lo sera","replies":[{"poster":"ExcAntimeta","date":"2018-06-23T18:23:13.710+0000","up_votes":1,"down_votes":0,"body":"Un pick antimeta, no es razón de report...","replies":[]}]}]}]}]}