{"poster":"Sterbehelfer","date":"2015-09-09T15:31:30.414+0000","title":"Fixes flame freies familienfreundliches 5er Team sucht ADC","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Liebe Community,\n\nWir suchen einen netten AD Carry\n\nUnser Team legt gro&szlig;en Wert auf einen wertsch&auml;tzenden Umgang miteinander. Das ist nicht so dahergesagt, sondern aus meiner 15 J&auml;hrigen Erfahrung kann ich sagen dass ein gutes Team (in den unteren Ligen) sich weniger durch Elo, Matchmaking und Verbissenheit auszeichnet, sondern eher durch einen netten und wertsch&auml;tzenden Umgang miteinander, in deen man Fehler auch mal problemlos zugeben kann.\n\nWas wir bieten,\n\n- Einen Organisator mit sehr viel Erfahrung und beruflichem Hintergrund bez&uuml;glich wertsch&auml;tzender Kommunikation.\n- Familienfreundliche Trainingszeiten (welche noch ausgemacht werden wenn die Member stehen) 20 Uhr Beginn max 2,5 - 3h.\n- Einen Multigaming Clan mit sehr gro&szlig;er Community\n- Forum / Ts und alles was dazugeh&ouml;rt\n\nZus&auml;tzlich haben wir noch einen \"Pro Gamer\" im Clan, welcher gelegentlich unsere Spiele anschaut und entsprechend Hilfestellungen leistet.\n\nWas wird von euch erwartet\n- Mindestalter 18 Jahre\n- Sozialer Umgang mit euren Teamspielern\n- Zuverl&auml;ssigkeit bez&uuml;glich Terminabsprachen\n- SIlber/Gold Bereich w&auml;re optimal - Abweichungen k&ouml;nnen besprochen werden\n- Funktionierender PC/Headset/Ts und eine gewisse Forenaktivit&auml;t\n\nWenn ihr Interesse haben sollet addet Sterbehelfer IG und ich mache alles weitere &uuml;ber Ts mit euch aus :). Nat&uuml;rlich k&ouml;nnt ihr auch in diesem Post entsprechende Fragen stellen oder die n&auml;chste Stunde mit uns ein Trainingsspiel machen :)\n\nWICHTIG:\nAnscheinend ist Lol leider ein bisschen unzuverl&auml;ssig geworden was Mitspieler und Abmachungen angeht. Mir ist Loyalit&auml;t und Zusammenhalt insofern wichtig, da nur so eine Verbesserung auch stattfinden kann. Wenn ihr schnellen Erfolg sucht und euch von Looses oder mangelndem Skill gleich abschrecken l&auml;sst bitte nicht bei mir melden\n\nVielen Dank\nLg","replies":[]}