{"poster":"LaRazaa","date":"2017-05-19T10:52:44.400+0000","title":"Problema Vs IA","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve...da ieri noto che quando vado per giocare vs IA per fare pratica non mi da piu&#039; una squadra di 5 player ma siamo in 2 vs IA....e i nostri Bot vanno sempre al suicidio e anche se giochi bene si fa una fatica enorme finire la partita ma e&#039; un BUG ??? mai successo prima della 7.10","replies":[{"poster":"LaRazaa","date":"2017-05-19T15:29:26.617+0000","up_votes":1,"down_votes":0,"body":"Si ok ma in 1 anno e mezzo che gioco non mi era mai capitata una cosa cosi......","replies":[{"poster":"FuryTheFenix ITA","date":"2017-05-19T20:08:50.738+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LaRazaa,realm=EUW,application-id=MJVj50Jw,discussion-id=rkwG27p5,comment-id=0003,timestamp=2017-05-19T15:29:26.617+0000)\n>\n> Si ok ma in 1 anno e mezzo che gioco non mi era mai capitata una cosa cosi......\n\nA me capita in quasi ogni co-op da più tempo.\nMinimo 1 persona è in realtà un bot","replies":[]}]},{"poster":"Lord Valotz","date":"2017-05-19T14:41:56.454+0000","up_votes":1,"down_votes":0,"body":"Si le coop vs Ia sono piene di bot. Ieri sera avevo preso rammus totalmente a caso dicendomi tanto è contro i bot. Io e l'altro mio premade abbiamo fatto quasi la stessa fatica di un pvp i 3 bot suicidi hanno dato solo 31 kill a brand bot... vi lascio immaginare. Comunque consiglio lo zzrot che i bot praticamente ignorano e pushare su più lane.","replies":[]},{"poster":"Jon Moxley","date":"2017-05-19T14:09:21.574+0000","up_votes":1,"down_votes":0,"body":"L'ho fatta anch'io giusto 5 minuti fa finito un game vs IA per prendere il bonus giornaliero degli IP.. io e un jax e 3 bot. Assurdo che mo pure nelle co op devi prendere un main e farti 1 o 2 vs 8.\nSe vuoi un consiglio, in questi casi prenditi uno split pusher potente tipo tryndamere o fiora e splitta nelle sight lanes fino a prendere l'inib. Da li in poi i super minion faranno il tutto","replies":[]},{"poster":"MisogiKumagawa","date":"2017-05-19T11:10:22.706+0000","up_votes":1,"down_votes":0,"body":"Praticamente,in Aram e in Vs IA la gente butta i Bot per livellare account sotto al 30 e appena arrivano al 30 li vendono","replies":[]}]}