{"poster":"CrackLifesMatter","date":"2018-09-15T00:07:46.510+0000","title":"League of Legends Matchmaking","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":1,"body":"**League of Legends Matchmaking**\n\nSehr geehrte liebe Mitspieler und Riotmitarbeiter,\nich bin mittlerweile seit vielen Jahren ein begeisterter Spieler von League of Legends und habe seitdem ich angefangen habe bereits \nso einige Stunden Spielzeit angesammelt. Ich war nie ein besonders guter Spieler im Diamant bereich aber hab es genossen sowohl mit Freunden\nim damals noch Team-Rank oder heutzutage im Flex und SoloQ zu spielen. Auch wenn ich weiterhin gerne versuche mich in der Rangliste hoch zu arbeiten und ein neues hoch zu erreichen muss ich leider sagen, dass es einen wichtigen Faktor gibt der mir den Spa&szlig; am Spiel vollkommen nimmt und ich denke ich bin nicht die einzige Person mit diesem Problem. Es handelt sich hierbei um das Matchmaking. Nein ich beschwere mich nicht &uuml;ber Teammates die beleidigen, trollen, &quot;schlecht&quot; sind oder nur eine schlechte Runde abliefern, es geht mir hierbei ganz konkret um Spieler die noch keine all zu gro&szlig;e Erfahrung in dem Spiel haben. Gerade zwischen Bronze und Gold Elo passiert es leider zu oft, dass Spieler welche frisch das 30. Level erreicht haben oder nur halbwegs dar&uuml;ber sind, mit Leuten gematcht werden die durchaus weit &uuml;ber 1000 Spiele vorweisen k&ouml;nnen. Da ist es dann auch (bei mir zumindest) oftmals egal ob die Spieler sich im eigenen oder im gegnerischen Team befinden, ein fl&uuml;ssiges, faires und ausgeglichenes Spiel kommt dadurch einfach nicht zu stande. Nicht nur f&uuml;r die Mitspieler ist das ein Problem, f&uuml;r die Neulinge selbst ist das auch nicht gut, st&auml;ndig Spiele verlieren, geflamed zu werden oder falls man doch gecarried wird als einer der wenigen Spieler negative Stats zu haben kann einen extrem frustrieren was auch nicht gut f&uuml;r eine lange &quot;Spielerkarriere&quot; w&auml;re. Eine &Auml;nderung des Matchmakings, ob es nun in Richtung Erh&ouml;hung des Mindestlevels ist (von 30 auf 50 f&uuml;r Ranked games), eine bestimmte anzahl an Draft-Games die man vorher absolviert haben muss oder sonst eine Alternative k&ouml;nnte einem gro&szlig;teil der Spieler helfen endlich mal wieder anspruchsvolle Spiele die einen alles an Know-How abverlangen, ohne dabei im Hinterkopf haben zu m&uuml;ssen dass man quasi 4 gegen 5 spielt, zu haben. Auch im Low-Elo bereich.\n\nIch bedanke mich f&uuml;r&#039;s durchlesen,\n\nMfG,\n\neuer DingDong","replies":[{"poster":"Angel Ayume","date":"2018-09-15T09:06:53.166+0000","up_votes":2,"down_votes":1,"body":"Ich verstehe was du meinst, aber woher weißt du denn, dass es sich tatsächlich um einen neuen Spieler handelt? Es könnte genauso gut ein Spieler sein, der einen neuen Account hochgezogen hat, ein Smurf, oder jemand dessen Main Account gebannt wurde und er deswegen auf einem komplett neuen Account spielen muss. \nUnd wenn deren Elo nicht viel höher ist, dann ist es nur logisch, dass die dann nicht jedes Game rasieren sondern auch mal schlechte Games aufweisen. \n\nZudem erkennt man einen guten Spieler nicht an der Menge der gespielten Spiele. Es gibt tatsächlich Bronzespieler mit über Lvl 100, gute Spieler sind die deswegen trotzdem nicht.\n\nAndered Beispiel: Ich habe einen Bronze 5 Spieler gesehen, der 4000 Rankedgames gespielt hat. Bronze 5 und 4000 Spiele. Das zeigt schon, dass die Menge an gespielten Spielen nicht automatisch einen guten Spieler ausmacht. (Gesehen hab ich das übrigens letzte Season)","replies":[]},{"poster":"Pilze","date":"2018-09-16T17:15:23.893+0000","up_votes":1,"down_votes":0,"body":"Leider ist es im Moment so das viele sich für den Rank nicht interessieren. Das kann man an den Threads hier im Forum gut sehen und am ingame verhalten vieler Spieler.\nMatchmaking, Meta, Game play oder Team play interessiert hier kaum noch einen. Einige wenige halten die Fahne noch hoch, einige spielen nur noch Modus und andere ( wie ich) machen eine Pause. Vielen ist der Sinn abhanden gekommen warum sie überhaupt aufsteigen sollen?\nMan sieht es wie es ist. Man spielt Ranked Games etwa 100 und man sieht schon das es für die nächste Liga nicht reichen wird. Also sagen sich viele, warum noch anstrengen am Ende ist Silber 1 das gleiche wie Silber 5. Das gleiche gilt für alle Ligen. \nErgo ist das Matchmaking völlig egal, es fehlt einfach an der Motivation um Rankeds zu spielen. Da wird ein besseres Matchmaking nicht viel helfen. \nWas glaubst du warum so viele Mods jetzt rauskommen?","replies":[]},{"poster":"three stodges","date":"2018-09-15T09:42:26.627+0000","up_votes":1,"down_votes":0,"body":"Hier  im Forum tobt ja echt das Leben :).\n\nPs: Völlig egal und das interessiert eh kaum noch einen was deine Veränderungen betrifft.","replies":[]}]}