{"poster":"Roubiron","date":"2015-03-17T16:39:18.739+0000","title":"Historia narrada de akali..... si, akali","subforum":"Creaciones de la comunidad","embed":{"description":"¡Un gran LIKE por esa voz de Akali! Muchas gracias, Esther :D Nueeeeeeeeva historia, chicos. Esta vez viajamos a Jonia con Akali. Es un personaje que me lo habéis pedido varios, en especial uno (iarjona :D). Si te gusta mi trabajo, no olvides suscribirte y compartirlo con tus amigos ^^ Podéis decirme en los comentarios qué campeón queréis que traiga la próxima vez.","url":"https://www.youtube.com/watch?v=reGFqrtq1jM","image":"http://i.ytimg.com/vi/reGFqrtq1jM/hqdefault.jpg"},"up_votes":3,"down_votes":1,"body":"Saludos invocadores: {{summoner:31}} \r\nel mundo se consume en historias las historias son historias las historias son historias las historias son historias las historias son historias aprende algo historia\r\n\r\npos hola¡¡¡\r\nsoy roubiron (tambien conocido como tu vecino) y vengo a mostrarles a ustedes una nueva, fresca, y zukulenta historia narrada\r\n~~supondre que no hacen falta explicaciones porque es como la cuarta historia que posteo~~\r\npues empezare explicandoles sin rodeos:\r\nhay algunas personas que les gusta el lore del lol... tambien hay personas que no le gusta el lol pero ellos que se vayan al maincra\r\nsi eres de los que te gusta el lol, alguna vez... en tu vida... has querido ESCUCHAR una historia? (porque leer no es de challengers) \r\npues si dijiste que si (como todo un challenger) te traigo a *imaginate un sonido de presentacion* SIIIIIIIIIR MORIAAAAAAARTYYYYYY\r\npues eso, un chavo muy feeder que se dedica a narrar historias muy cheveres sobre el lore de nuestro juego, a pesar de que lamentablemente no son oficiales, almenos tienen una calidad que mereceria ser oficial \r\n\r\nhasta ahora les eh enseñado alrededor de 3 historias, asique ahora les traigo una cuarta:\r\nen jonia hay muchos (EXTREMADAMENTE MUCHOS) campeones, muchos de ellos tienen muy buenas historias: {{champion:98}} {{champion:238}} {{champion:157}} {{champion:110}} {{champion:134}} {{champion:11}} {{champion:62}} etc, etc, etc\r\npero hay otros que aunque tienen buenas historias... en el lore, como que no muchos la tienen en cuenta, como el caso de nuestra querida {{champion:84}} \r\npues en este caso, de ella se trata la historia, es mas larga de lo habitual, pero eso no quita el ehcho de que sea MUY buena, (no es exageracion)\r\nte invito a verla, si te gusto, dale me gusta para poder colaborar en ste proyecto y poder seguir haciendo historias, y tambien te invito a subscribirte para estar atento a mas historias espectaculares ;)\r\n\r\npues eso, saludos y azucarudos¡¡\r\nsi te gusto la historia dejalo en comentarios y avisame si quieres que te compre unas gomitas o algo","replies":[{"poster":"Riot Cóndor","date":"2015-03-17T17:52:18.940+0000","up_votes":5,"down_votes":0,"body":"Pero...pero...es la versión de España y estamos en Latinoamérica.\n\nTengo una duda, ¿le pediste a la actriz que leyera la historia de su personaje?","replies":[{"poster":"Roubiron","date":"2015-03-17T23:52:05.934+0000","up_votes":1,"down_votes":0,"body":"UN RIOTER SALVAJE APARECIO¡¡¡\nna, señor condor, esuqeee. no hay version latinoamericana, es solo esta version española :P, pero si no le gusta porfavor no me quite mis porogalletas D:\n\nsobre la actriz... ella unicamente presto su voz para la historia, ella creo que ni juega al lol XDDD, todo el guion y eso fue escrito por otra persona.\nsi no le guto, le ruego con mi alma no quitarme mis porogalletas plz {{item:2052}}","replies":[]},{"poster":"LaPerchaMultiuso","date":"2015-03-17T21:46:42.231+0000","up_votes":1,"down_votes":0,"body":"Riot condor haciendo preguntas, cuando se invirtieron los roles D:?","replies":[]}]},{"poster":"Monserrat tu sup","date":"2015-03-17T17:31:28.604+0000","up_votes":1,"down_votes":0,"body":"op","replies":[{"poster":"el Loko Deniss","date":"2015-03-17T17:33:31.190+0000","up_votes":1,"down_votes":0,"body":"op","replies":[{"poster":"Roubiron","date":"2015-03-18T12:26:11.645+0000","up_votes":1,"down_votes":0,"body":"AP","replies":[{"poster":"LeooSc","date":"2015-03-18T13:43:38.268+0000","up_votes":1,"down_votes":0,"body":"AD","replies":[]}]},{"poster":"AgusBS2","date":"2015-03-18T21:30:59.847+0000","up_votes":1,"down_votes":0,"body":"Tanque :c","replies":[]}]}]}]}