{"poster":"Gresh","date":"2015-04-16T18:23:30.602+0000","title":"Botlane gesucht am besten prem8 botlane","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hi wie der Titel schon sagt sucht Team Cyborg (TeCy) eine botlane es w&auml;re nicht schlecht wen es vll sogar eine prem8 botlane w&auml;re da sie schon Erfahrung im zusammenspiel haben muss aber nicht unbedingt sein =) \r\n\r\ndie Voraussetzungen w&auml;ren :\r\n\r\nMin silber elo \r\nTS3 mit funktionst&uuml;chtigen Headset\r\nkeine flamer \r\nLeute die Kritik und Verbesserungs Vorschl&auml;ge  annehmen \r\nEinen gewissen championpoll besitzt in seiner rolle \r\n\r\nwir geben :\r\n\r\nTS3 server \r\neine nette community \r\n3 spieler die auf ihrer rolle einen gro&szlig;en championpoll haben \r\n\r\nTop : Xeldros          Gold 3 letzte Season Gold\r\nMid : Baby Ahri x3  Gold 3 letzte Season Platin  \r\nJgl   : Zybrix             Gold 3 Letze Season Silber\r\nSup: ???\r\nADC: ???\r\n\r\nBei Interesse  einfach ins Forum schreiben oder ingame etwa Xeldors oder Zybrix @ \r\n\r\n{{summoner:2}}","replies":[{"poster":"Napfelsine","date":"2015-04-16T18:31:47.600+0000","up_votes":1,"down_votes":0,"body":"Hi, falls Interesse vorhanden ist würde ich mich als ADC anbieten.","replies":[]},{"poster":"I Go Cinderhulk","date":"2015-04-16T18:29:19.412+0000","up_votes":1,"down_votes":0,"body":"Hi,\nich und mein mate haben schon \neinige erfahrung zusammen.\nHaben schon in verschiedenen rankedteams zusammen gespielt die leider nie von dauer waren\nSind s1 und s2 \nVersuchen momentan auch selber ein rankedteam auf die reihe zu stellen aber haut nicht so hin \nwann wären denn so eure zeiten?\n\nMfg,\nNero PrimeOmega\n{{champion:412}}","replies":[]},{"poster":"Sockbat911","date":"2015-04-16T18:25:30.476+0000","up_votes":1,"down_votes":0,"body":"hallo leute,\n\nfalls es keine botlane premade sein muss, würde ich mich gerne als supporter anbieten\n29 jahre alt\nsilber 3\nlieblingschamps thresh,leona, morgana\n\nhab auch schon ein bisschen team ranked erfahrung","replies":[]},{"poster":"MikhaONE","date":"2015-04-16T18:48:14.924+0000","up_votes":0,"down_votes":2,"body":"moin, mein name ist Robert, bin 21 und ich maine die rolles des supports \nich spiele lol seit season1 bzw seit der beta momentan befinde ich mich wieder in s5 da ich nach meinem letzten soloque game gedroppt bin.\nlol war für mich speziel in den letzten seasons eher ein game was ich nebenher gespielt habe, daher und aus diversen anderen gründen, sei es feeder, trolle, schlechte kommunikation im ranked game, fehler meiner seits oder einfach ein schlechter tag (den hat denke ich jeder mal egal wie gut man ist^^) habe ich es nicht weiter als s2 geschafft. \nAllerdings sehe ich für mich noch eine menge potenzial was das spielen in Ranglisten angeht, vorallem in einem Team. \n\nTs3 Headset etc alles vorhanden \nfavorisierte champions: Thresh, Sona, Braum, Bard, Nami, Leona \nallerdings kann ich auch diverse andere champions als support zur verfügung stellen. \n\nLG Mikha","replies":[]}]}