{"poster":"Mecha Sett","date":"2019-12-24T20:26:21.882+0000","title":"Tan importante son las normales???","subforum":"Charlas Generales","up_votes":4,"down_votes":4,"body":"mi hermanito entro sin querer a jugar normales con mi cuenta, y como es la segunda vez que juega no entiende nada, es tan importante ganar en normal que insultan sin parar? 6 años tiene que gente de mierda loco, en ranked te puedo entender que si te cagan una partida digas algo....\r\nno se como es popular este juego con la cantidad de insultos a la que te sometes, gente super toxica te toca en este juego loco piensen un poco antes de escribir ahora esta llorando x simplemente no saber jugar","replies":[{"poster":"RikiFsn","date":"2019-12-24T22:24:06.147+0000","up_votes":6,"down_votes":0,"body":"A ver pensa que pierdes como 30 minutos por partida y no da que venga un nenito de 6 años a TROLLEAR porque el tontito del hermano mayor lo pone a jugar normales y no contra bots\n\nEstán mal tanto los insultos como que vos pongas a **TROLLEAR** tu hermano en partidas normales :)","replies":[]},{"poster":"xXYorksXx ","date":"2019-12-24T21:54:35.049+0000","up_votes":4,"down_votes":0,"body":"Personalmente me da mucha pena que jugadores insulten a otros jugadores dentro del juego, pero lamentablemente, es común ver este tipo de actitudes en ambientes competitivos (aunque no sean rankeds). \n\nTambién tú tienes que entender que este juego está diseñado para personas mayores de 13 años, con una mentalidad distinta. Tú hermano todavía no tiene la madurez mental suficiente y la tolerancia a ciertas cosas negativas para jugar a League of Legends.","replies":[{"poster":"RikiFsn","date":"2019-12-24T22:26:03.202+0000","up_votes":2,"down_votes":0,"body":"Te olvidaste de lo más importante si el hermano no sabe jugar que lo ponga contra bots, no a trollearle la partida a gente que quiere ganar :)","replies":[]}]},{"poster":"SHADOWEYE","date":"2019-12-24T21:06:20.140+0000","up_votes":4,"down_votes":0,"body":"arruinar la experiencia de juego no se justifica en rankeds o en normales, pero tampoco se justifica flamear, si tanto quiere jugar lol tu hermanito, que se haga una cuenta, y que otra persona use tu cuenta, independientemente si es tu hermanito o no, es sancionado.","replies":[]},{"poster":"xaxesis","date":"2019-12-24T20:49:56.759+0000","up_votes":5,"down_votes":1,"body":"Prestar cuentas = sancionado\nFlamear insultar ostigar = sancionado\nNo hay metodo de juego donde te permitan romper el codigo y entre ellas los normales\n\nAlgo mas que quieras confesar????","replies":[{"poster":"Mecha Sett","date":"2019-12-24T21:00:28.313+0000","up_votes":2,"down_votes":8,"body":"prestar cuenta? es mi pc, mi cuenta si la usa mi hermano es prestar? a sos de esos flamer al parecer","replies":[{"poster":"xaxesis","date":"2019-12-24T21:04:56.531+0000","up_votes":5,"down_votes":0,"body":"Creo que debes ir a soporte de riot games a que te expliquen el tema\n\nTu cuenta es personal no la puede usar tu hermano ni tu tio ni tu abuela no nadie caso contrario SANCION\n\nVe a soporte a qie te digan lo mismo","replies":[]},{"poster":"Necrosis","date":"2019-12-25T00:08:23.767+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Mecha Sett,realm=LAS,application-id=v7qsfXsE,discussion-id=mT5gXVTu,comment-id=00010000,timestamp=2019-12-24T21:00:28.313+0000)\n>\n> prestar cuenta? es mi pc, mi cuenta si la usa mi hermano es prestar? a sos de esos flamer al parecer\n\nLamentablement '**Mecha Sett**' tiene razón, lo que pase con tu cuenta es tu responsabilidad... No podes dejar el ingreso a tu cuenta al alcance de cualquiera si no te pueden banear, tenes que ser más precavido en ese sentido, para algo están las contraseñas. El recordatorio de contraseñas sólo se utiliza si la computadora la usas tan sólo vos y nadie más.","replies":[]}]}]},{"poster":"Arsig","date":"2019-12-25T02:49:36.644+0000","up_votes":3,"down_votes":0,"body":"A ver , si ya sos lv 30 sabes maso menos como jugar , si tu hermano entra en partida con tu cuenta va a morir una y otra ves , los demas invocadores pensaran que es un troll , lo que significa 30 minutos perdidos , y hay gente que puede jugar 1 o 2 partidas por dia nomas y que venga un niño a joderte la experiencia de juego es normal que moleste y hay mucha gente que no se controla, enfin es tu culpa , no dejes que tu hermano use la cuenta, es privada y es sancionable que alguien mas la use.","replies":[]},{"poster":"SeanFelices","date":"2019-12-24T20:42:07.813+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mecha Sett,realm=LAS,application-id=v7qsfXsE,discussion-id=mT5gXVTu,comment-id=,timestamp=2019-12-24T20:26:21.882+0000)\n>\n> mi hermanito entro sin querer a jugar normales con mi cuenta, y como es la segunda vez que juega no entiende nada, es tan importante ganar en normal que insultan sin parar? 6 años tiene que gente de mierda loco, en ranked te puedo entender que si te cagan una partida digas algo....\n> no se como es popular este juego con la cantidad de insultos a la que te sometes, gente super toxica te toca en este juego loco piensen un poco antes de escribir ahora esta llorando x simplemente no saber jugar\n\nNo lo apoyo la actitud negativa, pero el mundo es así. Despertalo a tu hermano.\n\nDe última, enseñale a mutear.\n\nSaludos .","replies":[{"poster":"Mecha Sett","date":"2019-12-24T21:01:05.626+0000","up_votes":1,"down_votes":3,"body":"que tiene que ver? entonces porque te vas a morir en algun momento porque no despertas a la situacion y te suicidas? a no estoy exagerando...","replies":[{"poster":"SeanFelices","date":"2019-12-24T21:03:21.990+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mecha Sett,realm=LAS,application-id=v7qsfXsE,discussion-id=mT5gXVTu,comment-id=00000000,timestamp=2019-12-24T21:01:05.626+0000)\n>\n> que tiene que ver? entonces porque te vas a morir en algun momento porque no despertas a la situacion y te suicidas? a no estoy exagerando...\n\nPorque tengo asumido que todos en algún momento morimos, pero ni vos ni tu hermano tienen asumido que el mundo es así y que está llorando por una partida de LoL.\n\nEdito: si mal no recuerdo, hay una edad mínima recomendada para jugar a esto.\n\nSaludos .","replies":[]}]}]},{"poster":"Aegis","date":"2019-12-25T03:17:44.439+0000","up_votes":1,"down_votes":0,"body":"Tienen su importancia, no como las ranked pero las tienen. Ahora, tu hermanito tiene recien 6 años, no deberia siquiera estar en internet o caso contrario deberia de ser supervisado, porque asi como se metio  a jugar puede hacer otras cosas en tu pc, ten más cuidado de ahora en adelante.","replies":[]},{"poster":"Necrosis","date":"2019-12-25T00:06:41.361+0000","up_votes":1,"down_votes":2,"body":"Hay gente que juega Normales para ir aprendiendo a jugar, razón por la que se toma esas partidas de manera seria... Pero no hay excusa alguna para los insultos, el rage, etc.\nComo muuuuucho se reporta lo que cada uno quiera siempre y cuando haga uso del razonamiento lógico al momento de reportar, y fue. La gente debería aprender a jugar callados.","replies":[]}]}