{"poster":"Kahl Drogo98","date":"2017-08-09T03:16:34.220+0000","title":"Ornn interactions with champs","subforum":"Story, Art, & Sound","up_votes":13,"down_votes":0,"body":"If my count is correct Ornn only has 9 special interactions with champs, and none of them are with Braum, Ashe, Lissandra, or Sejuani. I think Riot really missed a great opportunity here. I was really really hoping for there at least to be some interactions with Braum about his sheild. And fizz too since Ornn made the trident.","replies":[{"poster":"FauxSchizzle","date":"2017-08-09T13:59:36.344+0000","up_votes":8,"down_votes":0,"body":"He does have one for Braum. I wrote one for Braum. It may have gotten cut for timing restrictions. Who knows? \n\nOr it might be in the attacks section -- taunting specific champions (after listening to feedback we got here) wasn't always super-meaningful in game. But ATTACKING a specific champion would happen and could show something. Unsure of what happened with the Braum one, I'll look into it.","replies":[{"poster":"TimX24968B","date":"2017-08-09T19:09:01.229+0000","up_votes":2,"down_votes":1,"body":"I was hoping to see SOMETHING involving tryndamere, another frelijord champion.  any kind of lore (or even an interaction) would be appreciated, especially when he wields a gian't sword, even though you already said Ornn didn't forge it.","replies":[]},{"poster":"Ralanr","date":"2017-08-14T22:58:47.300+0000","up_votes":1,"down_votes":0,"body":"Please do. Braum is using his door incorrectly!  Ornn has to talk about its misuse.","replies":[]},{"poster":"Tyler1 With Nips","date":"2017-08-09T21:44:04.560+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FauxSchizzle,realm=NA,application-id=6kFXY1kR,discussion-id=PA7e1g7R,comment-id=0005,timestamp=2017-08-09T13:59:36.344+0000)\n>\n> He does have one for Braum. I wrote one for Braum. It may have gotten cut for timing restrictions. Who knows? \n> \n> Or it might be in the attacks section -- taunting specific champions (after listening to feedback we got here) wasn&#x27;t always super-meaningful in game. But ATTACKING a specific champion would happen and could show something. Unsure of what happened with the Braum one, I&#x27;ll look into it.\n\nAs a {{champion:53}}  main I feel interactions are a must and that champions with such unique gameplay and style should have more interactions. Like take for example {{champion:223}} who has a taunt or interaction for nearly every existing thing in league, is it possible for the creation of more taunts, voice lines and jokes to be incorporated after the official release of champions like ornn? Or should we be expecting more champion individuality with such interactions?","replies":[{"poster":"Kloqdq","date":"2017-08-14T18:45:43.283+0000","up_votes":1,"down_votes":0,"body":"We saw it with Lux just recently so it's always possible.","replies":[]}]}]},{"poster":"Horidas","date":"2017-08-09T03:22:20.373+0000","up_votes":5,"down_votes":0,"body":"I don't think he even has anything special to say about the Howling Abyss - which he made himself.","replies":[{"poster":"Kahl Drogo98","date":"2017-08-09T03:24:52.115+0000","up_votes":8,"down_votes":0,"body":"I agree, I didnt even think of that! I think it would be so cool to have some lines, especially with his personality. like: \"hmm, looks familiar\" or when the bridge starts to crumble he could say something like \"I told them magic ruins craftsmanship\"","replies":[{"poster":"Horidas","date":"2017-08-09T03:54:54.911+0000","up_votes":3,"down_votes":1,"body":"Also may have been nice to get confirmation that Yorick's shovel is actually the spade Ornn threw \"to the west.\"","replies":[{"poster":"Kahl Drogo98","date":"2017-08-09T07:32:02.632+0000","up_votes":1,"down_votes":1,"body":"agreed. Are the Shadow isles to the West of the Frelijord?","replies":[{"poster":"SolarisCorvus","date":"2017-08-09T09:01:34.347+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kahl Drogo98,realm=NA,application-id=6kFXY1kR,discussion-id=PA7e1g7R,comment-id=0000000000000000,timestamp=2017-08-09T07:32:02.632+0000)\n>\n> agreed. Are the Shadow isles to the West of the Frelijord?\n\nCheck the piltover map. should whether or not the SL are west of the freljord.","replies":[]}]}]}]}]},{"poster":"SomeDudeJoe","date":"2017-08-09T06:11:36.052+0000","up_votes":4,"down_votes":0,"body":"I don't think Ornn is much of a talker in general.","replies":[{"poster":"Kahl Drogo98","date":"2017-08-09T07:31:11.338+0000","up_votes":1,"down_votes":0,"body":"I understand that, but imagine the funny lines we could have if he talked to braum about him having the door","replies":[]}]},{"poster":"Whyte Lyon","date":"2017-08-09T04:00:09.134+0000","up_votes":3,"down_votes":0,"body":"Ornn's not the kind of person to make remarks at mortal people, like at all. If his attitude is don't bother me, then why would he bother others?\n\n Although I would like to have seen an interaction with Galio and show some fascination or disgust at Piltover/Zaun related champs, particularly their advance technology.","replies":[]},{"poster":"Variks the Loyal","date":"2017-08-09T03:57:08.651+0000","up_votes":2,"down_votes":0,"body":"I don't think Fizz's trident is Ornn's fork.\n\nIt doesn't look like a fork, and Fizz isn't a king, he's a trickster.","replies":[{"poster":"Killaburn","date":"2017-08-09T05:29:49.306+0000","up_votes":2,"down_votes":0,"body":"well, fizz just got the trident in a lost ruin so who might know if fizz just steals that","replies":[]},{"poster":"Ralanr","date":"2017-08-14T22:59:40.578+0000","up_votes":1,"down_votes":0,"body":"A trickster could trick people into thinking he's a king.","replies":[]},{"poster":"VelvetCrotch","date":"2017-08-09T11:01:34.336+0000","up_votes":1,"down_votes":0,"body":"think so too.","replies":[]}]},{"poster":"VelvetCrotch","date":"2017-08-09T11:00:32.356+0000","up_votes":1,"down_votes":0,"body":"yes. i waited for braum interaction. and maybe lissandra too.","replies":[{"poster":"Camille Ferrøs","date":"2017-08-09T22:02:24.455+0000","up_votes":1,"down_votes":0,"body":"For Braum yeah but why for Lissandra I think they haven't met yet","replies":[{"poster":"VelvetCrotch","date":"2017-08-11T23:24:04.390+0000","up_votes":1,"down_votes":0,"body":"lissandra cause she is blind by ursines (i guess the race which Ornn is from) and maybe he could skit her ^^","replies":[{"poster":"Camille Ferrøs","date":"2017-08-16T17:55:47.923+0000","up_votes":1,"down_votes":0,"body":"What¿!","replies":[]}]},{"poster":"Frivolous Fossa","date":"2017-08-11T23:43:32.168+0000","up_votes":1,"down_votes":0,"body":"Did you even read the lore? He built the bridge for her. Come now!","replies":[{"poster":"Camille Ferrøs","date":"2017-08-12T23:52:46.473+0000","up_votes":1,"down_votes":0,"body":"Lissandra is in her human form when she is with her sisters.Ornn hasn't met the real her.","replies":[{"poster":"Frivolous Fossa","date":"2017-08-14T18:21:32.651+0000","up_votes":1,"down_votes":0,"body":"It mentions her icy nature, I'm just saying there could be some sort of interaction. Vague recollection  or something, even if he doesn't completely recognize her. A \"have we met\" is perfectly reasonable, I think.","replies":[{"poster":"Camille Ferrøs","date":"2017-08-14T22:12:11.076+0000","up_votes":1,"down_votes":0,"body":"I don't think \"have we met\" interaction would be fitting because I think Ornn can't find a thing similar to a human with icy nature to Lissandra in game.But that is just my opinion.","replies":[{"poster":"Frivolous Fossa","date":"2017-08-15T00:00:31.293+0000","up_votes":1,"down_votes":0,"body":"I wouldn't like it much either, I was just saying it made a kind of sense. Just a kind of tribute to his past, if they could think of something clever enough, though I don't think there would be anything good to put in there, tbh.","replies":[]}]}]}]}]}]}]}]}