{"poster":"Do0m77","date":"2018-11-15T01:29:11.457+0000","title":"Alguien que me diga como reportar un soporte al jugador? ja!","subforum":"Charlas Generales","up_votes":1,"down_votes":3,"body":"Me suspendieron la cuenta por SMURFEARLA jajajajaja, tengo 3 cuentas, de las cuales 2 lleve a diamante, y estaba con esta hasta que paso el tiempo y nunca la subi y practicamente no la uso, pero este a&ntilde;o se me dio por llevarla a platino del cual la lleve muy facilmente, pero ME SUSPENDIERON POR ELOBOOST JAJAJAJAJAJA!!!, y segun ellos hace una &quot;HACEN UNA EXTENSA INVESTIGACION&quot; , de la cual nunca te dicen cuales son. Y para el colmo muestro pruebas de las cuales la cuenta es mia  es mi e-mail la uso solamente yo y no tiene casi partidas en normal porque la uso para rankear jajajaj divino soporteeee!! &quot;&quot;Dr. Banyitos Soporte al Jugador&quot;&quot;   El buen hombre maduro para responder reportes al jugador. Falta edad ah&iacute; amigo, tengo 29 yo... no me boludees....","replies":[{"poster":"One Single","date":"2018-11-15T01:33:26.382+0000","up_votes":3,"down_votes":1,"body":"por algo es amigo, seguro te conectaste en muchas pcs o a la vez desde otro lado, o en pocos minutos te conectaste desde africa del norte","replies":[{"poster":"fenakz","date":"2018-11-15T01:40:49.635+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=One Single,realm=LAS,application-id=v7qsfXsE,discussion-id=a71BJMlu,comment-id=0000,timestamp=2018-11-15T01:33:26.382+0000)\n>\n> por algo es amigo, seguro te conectaste en muchas pcs o a la vez desde otro lado, o en pocos minutos te conectaste desde africa del norte\n\nQue tiene que ver? el conectarse desde diferentes PC no es señal de eloboost.","replies":[{"poster":"Do0m77","date":"2018-11-15T01:47:05.412+0000","up_votes":1,"down_votes":1,"body":"Claro que no, y  la suspension que te hacen no es correcta. Porque no tienen ningun motivo al menos en mi caso, me creo otra cuenta y la subo a diamante de una, eso no es normal.. oohh... hay que suspenderla... esta raro eso amigo, jajajajaja que injusto lo que hacen, realmente es una cuenta smurf de la cual no uso no me interesa , pero si me interesa la clase baja de soporte al jugador que hay...","replies":[]}]},{"poster":"Do0m77","date":"2018-11-15T01:42:19.640+0000","up_votes":1,"down_votes":1,"body":"Jajaja quien mas que seguro que yo?, suspenden porque se les canta suspender cuentas. Por mas que me conecte en mi casa en la casa de un amigo, en la casa de mi vieja, en la casa de mi hermano, en cualquier lugar, no tienen una explicación de la cual sea justificativa a la suspensión estoy 100 % seguro que nadie usa mi cuenta, solo yo...","replies":[]}]}]}