{"poster":"FenrirWolff","date":"2016-03-21T13:32:04.562+0000","title":"Danke RIOT Games","subforum":"Spielerverhalten & Moderation","up_votes":18,"down_votes":10,"body":"Da man ja hier sehr oft nur Beschwerden &uuml;ber Riot liest und wie schlecht sie denn nicht sind, m&ouml;chte ich mich hier einfach einmal bedanken.\r\n\r\nDanke, liebes Team von Riot f&uuml;r dieses Spiel das Ihr uns geschenkt habt. \r\nEin Spiel, welches v&ouml;llig Kostenfrei von allen gespielt werden kann.  Niemand muss hier Geld ausgeben um das Spiel zu Spielen. \r\nAuch gebt Ihr euch alle m&uuml;he, das Spiel zu verbessern und zu ver&auml;ndern. \r\nViele sehen dies als schlechte Sache an, Ich f&uuml;r meinen Teil finde dies jedoch eine tolle Sache, da es etwas Abwechslung in die Sache bringt :)\r\nFortwehrend neue Champions zu gestalten, dabei die Alten zu Reworken und auch immer wieder &Auml;nderungen &uuml;ber Patches zu bringen ist eine menge Arbeit. Das ist etwas das man zu sch&auml;tzen wissen sollte\r\n\r\nAuch m&ouml;chte ich mich bei der (meistens) freundlichen Community bedanken!\r\nGerade weil ich fast t&auml;glich sehr unterhalten von den &quot;Ich verdiene diesen Permabann nicht&quot; Threads bin, weis ich das sowohl die Community, als auch das Bannsystem funktionieren und das macht mich froh ^^ \r\n\r\nDieser Post war mir Pers&ouml;nlich ein anliegen und ich w&uuml;rde mich &uuml;ber Eure Meinungen Freuen :)\r\n\r\nLG &amp; Viel Spa&szlig; beim Spiel :D\r\n\r\nPS: Rechtschreibfehler bitte behalten ^^ danke","replies":[{"poster":"Maíko","date":"2016-03-21T13:57:26.551+0000","up_votes":6,"down_votes":0,"body":"Danke für die 8 Rechtschreibfehler...Die packe ich erstmal in meine Spardose^^\n\nEs gibt zwar schon mehrere solcher Threads...aber es freut mich doch immer wieder wenn sich hier mal jemand positiv äußert^^\n\nRiot sollte wesentlich mehr Anerkennung für das erhalten, was sie tagtäglich leisten und uns zur Verfügung stellen.\nAber leider wissen bzw. interessieren sich die meisten Leute nicht dafür, wie viel Arbeit hinter einem so großen Projekt wie League of Legends steckt.\n\nAlso auch von mir mal ein großes Dankeschön an Riot und die Community, die dieses Spiel zum besten Spiel unserer Zeit machen{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Lematique","date":"2016-03-22T12:15:17.467+0000","up_votes":3,"down_votes":0,"body":"Wie wahr!\n\nIch liebe Riot Games für ihre Leidenschaft. Bei Riot habe ich das Gefühl, es ist wirklich noch \"von Spielern für Spieler\", was viele Entwickler verloren haben.\nAlleine die kostenlose Musik, die sie uns immer wieder zur Verfügung stellen. Sona bekommt nicht nur einen genialen Skin, nein, es werden auch noch drei Lieder dazu produziert. ♥\nAmumus Lied ist der Wahnsinn, Jinx Lied und Video feiere ich, ich liebe Riot einfach dafür.\n\nDanke danke danke für alles!","replies":[]},{"poster":"Entrails64","date":"2016-03-21T16:42:27.636+0000","up_votes":1,"down_votes":7,"body":"Da fragt man sich auf welcher Gehaltsliste du stehst, Kritiken an Riot findet man doch garnicht so häufig die werden dank der Zensur nämlich ständig gelöscht hat man den Eindruck.Der Hauptgrund das es diese Free to Play spiele gibt ist der das man damit auch Geld verdienen möchte,da macht Riot keine Ausnahme soll auch alles so sein aber bitte man möchte auch mal ein bissel auf die Leute eingehen und nicht stumpf sein Ding durchziehn und gut ist und wem das nicht passt der kann ja aufhören zu Spielen, gehts noch man wir leben im 21 Jahrhundert da sollte man Kritiken auch mal ernst nehmen und wenn Riot das nicht Passt dann sollen sie ihr Spiel nicht überall und jeden zugänglich machen.\nUnd diese Permanent gebannten Schreihälse die das nicht richtig finden,man sollte viel schneller durchgreifen und diese ständigen afk geher viel schneller bannen,desgleichen mit Spielern die von Anfang an vor haben das Spiel den anderen Kaputt zumachen.","replies":[{"poster":"Temudschinn","date":"2016-03-21T19:36:16.953+0000","up_votes":3,"down_votes":0,"body":"Er steht auf meiner Gehaltsliste. Und zwar im Rahmen eines Programmes, welches von der Merkel-Regierung gestartet wurde und zum Ziel hat, mehr Leute zum zocken zu animieren, damit keine kritische Öffentlichkeit mehr besteht und die Privatisierung der deutschen Spitäler ohne Probleme fortgesetzt werden kann. Da brauchen wir halt positive Presse für einzelne Spiele, damit die Leute mit zocken beginnen...\n\nFür das Eröffnen dieses Threads hat er überigens 127 Euro erhalten, abzüglich Sozialleistungen.","replies":[{"poster":"Sirrkas","date":"2016-03-21T20:51:01.583+0000","up_votes":3,"down_votes":0,"body":"Ich schätze mal er darf die Stromrechnung nicht als Werbungskosten von der Steuer absetzen?","replies":[{"poster":"Temudschinn","date":"2016-03-21T21:01:19.638+0000","up_votes":2,"down_votes":0,"body":"Nein, aber als Spesen verrechnen.","replies":[]}]}]},{"poster":"FenrirWolff","date":"2016-03-22T07:05:18.974+0000","up_votes":3,"down_votes":0,"body":"Ja unbedingt. Riot zahlt mir viel Geld damit ich sie Lobe für ein Spiel welches ich Persönlich toll finde. Wie sonst soll ein Gamer seine Rechnungen Bezahlen? *sarcasm off*\n\nKleiner Tipp: Versuchs mal mit Satzzeichen {{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"K0reanSupp","date":"2016-03-21T18:19:09.432+0000","up_votes":1,"down_votes":5,"body":"das spiel ist zwar toll aber die comunity ist müll (meistens)","replies":[{"poster":"Rainbow Dashie","date":"2016-03-22T02:42:33.183+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=xThugGhost,realm=EUW,application-id=KYnfKGf0,discussion-id=BWhfYery,comment-id=0003,timestamp=2016-03-21T18:19:09.432+0000)\n>\n> das spiel ist toll und die comunity auch (meistens)\n\nich habs mal berichtigt.","replies":[{"poster":"Lance90","date":"2016-03-22T17:04:59.119+0000","up_votes":1,"down_votes":0,"body":"Musste grade schmunzeln, als ich mir vorgestellt hab wie das Spielerverhalten-Forum aussehen würde wenn du Editierrechte hättest.","replies":[]}]}]},{"poster":"Fermi Paradox","date":"2016-03-21T15:11:59.086+0000","up_votes":2,"down_votes":0,"body":"Leider ist die Community so verkommen, dass ich beim Titel erst dachte, dies sei wieder irgendein sarkastischer Hass-Thread.\nUmso mehr freut es mich natürlich, genau das Gegenteil davon vorzufinden :)\n\nIch hoffe, du behältst deine Einstellung genauso bei und wünsche dir weiterhin noch viel Spaß in der Kluft x)\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"FenrirWolff","date":"2016-03-21T15:58:16.978+0000","up_votes":2,"down_votes":0,"body":"Ich habs befürchtet xD Na wenigstens hast du dem Thread die Chance gegeben und reingesehen ^^","replies":[{"poster":"Fermi Paradox","date":"2016-03-21T16:18:07.225+0000","up_votes":2,"down_votes":0,"body":"\"never judge a book by its cover\" ;)","replies":[]}]},{"poster":"BloodCrystalx3","date":"2016-03-21T16:34:39.125+0000","up_votes":1,"down_votes":0,"body":"Schließe ich mich an :)","replies":[]}]}]}