{"poster":"Offen","date":"2015-03-19T00:31:52.956+0000","title":"Recomendacion con estos champs que me llaman la atencion","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"saludos gente aqui yo nuevamente con una duda como dice el titulo con unos champs que me andan dando vueltas en la cabeza.\r\n \r\nlos champs son {{champion:61}} {{champion:76}} ,{{champion:112}} ,{{champion:50}} ,{{champion:161}} ,{{champion:134}} .\r\n\r\nla cosa es que me gustaria saber cual de estos obviamente dominado bien(con el tiempo porque ahora soy un manco en el juego) podria ser de una utilidad tanto para el juego(aprender mecanicas y demases) como para tambien las partidas en si, en este caso creo que la mejor opcion seria {{champion:61}} , pero creo que sus mecanicas son algo complicadas obviamente con el uso y el tiempo se podria ir mejorando eso, aunque {{champion:112}}  con su ulti y el stun que tiene tmb genera utilidad al team.\r\n\r\n{{champion:50}}  es un champ por lo que he visto que se mantiene mucho rato en linea y es viable tanto en top como en mid tiene buen CC.Igual que {{champion:134}}  que tiene su stun y su deleto con ulti a uno del team enemigo.\r\n\r\n{{champion:161}}  y {{champion:76}}  me llaman la atencion por su pokeo ademas de la Ulti de {{champion:161}}  y {{champion:76}}  que es viable en 3 lineas Mid/top/JG aunque de momento solo la usaria en Mid.\r\n\r\nnose si sirva como orientacion pero los champs que ultimamente trato de jugar son {{champion:90}}  y {{champion:38}} \r\n\r\nbueno eso ahi esta el testamento, espero recibir algun consejo o experiencia de los mas experimentados en el juegito","replies":[{"poster":"Tatsuya","date":"2015-03-19T15:15:50.887+0000","up_votes":1,"down_votes":0,"body":"{{champion:61}}  de cabeza. es un pick que encaja con cualquier composicion, tiene escudo, CC, daño y sobretodo, una fuerte iniciacion para las teamfights.\n\nEl resto tienen sus atributos y sus fuertes, pero entre todos ellos, la Orianna es el pick mas logico a la hora de elegir, lo unico malo, es que su kit es TAN unico que por ahi se dificulta a la hora de usarse las primeras veces.","replies":[]},{"poster":"Ruphian","date":"2015-03-19T02:35:10.154+0000","up_votes":1,"down_votes":0,"body":"Nidalee no se si se la usa top, pero se la de support de poke. Como ya se dijo, Swain tiene mucho sustain y carrea mucho, mientras que Syndra tiene un winrate muy bajo, pero podes meter dos combos casi seguidos.","replies":[]},{"poster":"VR Jaeger","date":"2015-03-19T01:16:26.284+0000","up_votes":1,"down_votes":0,"body":"aunque no me guste mucho te recomendaria a swain, carrea muuucho","replies":[]},{"poster":"KaiserJäger","date":"2015-03-19T00:32:30.797+0000","up_votes":1,"down_votes":0,"body":"saludos te saludamos","replies":[]}]}