{"poster":"nikoiver","date":"2016-03-05T02:02:49.158+0000","title":"Campeones Melee","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Qu&eacute; opinan de como debe usarse correctamente campeones Mele&eacute; estilo Aatrox {{champion:266}} , Fiora {{champion:114}} , Maestro Yi {{champion:11}} , Tryndamere {{champion:23}} , Jax {{champion:24}}  por nombrar algunos, principalmente en la linea de Top o de Jungla. A&uacute;n no logro encontrar el punto de como jugarlos correctamente. \r\n\r\n\r\nSaludos !!!","replies":[{"poster":"Ks Erwyn","date":"2016-03-05T03:23:06.614+0000","up_votes":2,"down_votes":0,"body":"Debieras ser mas especifico, de cual es tu problematica, por lo general la gran mayoría de melés ,gozan de mayor capacidad de duelo que otros campeones ya sean de rango o basados en desgaste y full tankes, estan los que se basan en el error rival para realizar contrajugadas o los full iniciadores, un consejo para saber tradear siendo melé contra campeoens de rango, haslo siempre teniendo cerca tu oleada de subditos, han cambiado no hace mucho las mecanicas de agresion de estos, en especial de los de rango, que son los que mas pegan, haciéndolos mas insistentes y constantes en asistir a la agresión a campeones y de ellos mismos, anteriormente los ranged abusaban de la mecanicas de reseteo de agresion para harrasear gratuitamente sin consecuencias de comerse mucho agro de los subditos estos se cambio para hacer mas peligorsos los trades alrededor de ellos en especial a lvl bajos dodne una oleada o un par de hit de los de rango te destrozan.","replies":[{"poster":"nikoiver","date":"2016-03-05T18:19:02.689+0000","up_votes":1,"down_votes":0,"body":"Mi problema básicamente es el tradeo, y conocer el power spike de cada uno de los que nombré. También como ganar la linea contra campeones con rango en su autoataque como Gnar {{champion:150}} , Vladimir {{champion:8}} , cuando saber entrar en una Team Fight siendo Maestro Yi {{champion:11}} , o Aatrox {{champion:266}} por ejemplo. Entiendo el punto de las oleadas y de tradear con los mayor súbditos aliados posible.\n\nYo soy Main Adc, por lo que aprender a usar este tipo de campeones lo estoy tomando como un desafío personal debido a la enorme diferencia entre éstos y ser tirador.","replies":[{"poster":"erwinchelo","date":"2016-03-13T21:56:36.726+0000","up_votes":2,"down_votes":0,"body":"{{champion:266}} suele beneficiarse de los trades largos, por lo general el rival evitara esto, una de la debilidades de el es lo predecible de sus iniaciones mediante su Q, a pesar que estar orientados a duelos, el kit de aatrox lo hace relativamente kiteable, por eso donde as brilla es en peleas de equipo, donde las cadenas de CC aportan el continuo dps de el, asi como Yi o jax el no inicia las pelea suele entrar tras empezada esta.\n\nJax tiene sus problemáticas, el error mas casual con él, es el iniciar con el famoso helicóptero, algo que lo afecta y mucho si el rival evade el stun, no siempre podrás iniciar así y en general no es recomendable ,dado que es esperado tal jugada por parte de el","replies":[]}]}]},{"poster":"necromonicom","date":"2016-03-05T02:14:23.898+0000","up_votes":2,"down_votes":0,"body":"Mira para mi con el tema de los campeones melee Tenes q sabes como es su mecánica y estilo de juego no es la misma biuld de un trynda q de 1 jax x ejemplo además con las nuevas maestrías Tenes q ver x. Ejemplo si voy trynda top lo uso con fervor si voy con darius con la maestría de defensa eso depende de quien tengas en frente también en resumidas cuentas no podes pickear un campeón solo x q esta roto si no conoces sus mecánicas o cual es su función en el mapa","replies":[]}]}