{"poster":"KneeI","date":"2019-04-08T09:36:48.947+0000","title":"lack of punishment for griefing","subforum":"Player Behavior","up_votes":136,"down_votes":12,"body":"so i just got to plat 4 promos with a 75% winrate. at which point, my jungle ran down mid from min 1 then left, then my adc admitted to griefing, then my top and mid both inted and rage quit. 3 games in a row, 3 games lost due to blatant griefing, i was given a chat restriction for flaming them for losing my promos, but riot won't even do the courtesy of rewatching the games, instead leaving it all to an automated chat filter system. the smallest of indy companies at work\n\nUPDATE: my mental has snapped and i have now griefed for several hours straight. people can admit to griefing in chat without being banned, i wonder if the same is true for the forums","replies":[{"poster":"Soul Dealer","date":"2019-04-08T10:08:11.015+0000","up_votes":59,"down_votes":6,"body":"The worse part is by trying so hard to ban toxic players riot makes more people grief and troll. Unfortunately the white knights and mods will come in here soon and defend riot but we will keep posting until riot listens.","replies":[{"poster":"KneeI","date":"2019-04-08T10:15:24.480+0000","up_votes":37,"down_votes":2,"body":"Like my adc legit didn't leave bot lane for 30 minutes, said \"stay plat youll never win promos\" and afk pushed until dead all game. If a single human being even read the chat logs, they'll see me as toxic but my adc as obviously griefing. I don't care if I'm labeled as toxic, the day Riot punishes players for soft inting and intentionally throwing games through their gameplay is the day I won't flame again","replies":[{"poster":"Soul Dealer","date":"2019-04-08T10:17:59.499+0000","up_votes":30,"down_votes":3,"body":"> [{quoted}](name=One Punch Ví,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=00000000,timestamp=2019-04-08T10:15:24.480+0000)\n>\n> Like my adc legit didn't leave bot lane for 30 minutes, said \"stay plat youll never win promos\" and afk pushed until dead all game. If a single human being even read the chat logs, they'll see me as toxic but my adc as obviously griefing. I don't care if I'm labeled as toxic, the day Riot punishes players for soft inting and intentionally throwing games through their gameplay is the day I won't flame again\n\nYup. The mods and riot all think context does not matter but that is just not true at all. Context is the most important thing in any situation no matter what.","replies":[{"poster":"Disembark","date":"2019-04-08T12:44:54.714+0000","up_votes":27,"down_votes":2,"body":"My favorite response from mods  is: \"you wouldn't say this to someone in real life\". Complete BS. \n\nImagine you're playing football, competitively, and one of your team mates is like \"haha I'm not even really trying, I'm gonna just kick the ball into our goal haha\". \n\nYeah, we'd have a few choice words with him. I'd be surprised if he doesn't get punched in the face.","replies":[{"poster":"Spidii","date":"2019-04-08T17:10:17.182+0000","up_votes":5,"down_votes":0,"body":"Right, I guarantee that if someone came up and just started pissing on a riotors leg they would not be friendly or ignore it or keep their mouth shut in real life.","replies":[{"poster":"kushinshin","date":"2019-04-08T18:47:06.378+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Spidii,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=00000000000000000000,timestamp=2019-04-08T17:10:17.182+0000)\n>\n> Right, I guarantee that if someone came up and just started pissing on a riotors leg they would not be friendly or ignore it or keep their mouth shut in real life.\n\nActually, given how most of them act online, they probably would keep their mouths shut for fear of getting their jaw broken.","replies":[{"poster":"Spidii","date":"2019-04-08T19:25:40.967+0000","up_votes":3,"down_votes":0,"body":"Lol you right you right, forgot their snowflakes that's why they cater to other snowflakes even if it eventually tanks their game lol. thank you for setting me straight haha","replies":[]}]}]}]},{"poster":"Rowanstar","date":"2019-04-08T13:57:29.377+0000","up_votes":11,"down_votes":4,"body":"> [{quoted}](name=Soul Dealer,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=000000000000,timestamp=2019-04-08T10:17:59.499+0000)\n>\n> Yup. The mods and riot all think context does not matter but that is just not true at all. Context is the most important thing in any situation no matter what.\n\nALL of us? Because I am new and I certainly think context is important (unless you are being outright horrid). I cant speak for anyone else though.","replies":[{"poster":"Quáx","date":"2019-04-08T14:07:48.502+0000","up_votes":4,"down_votes":2,"body":"Wait you have moderator rank. But you're new to the game?","replies":[{"poster":"Rowanstar","date":"2019-04-08T14:15:13.512+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=Quáx,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=00000000000000010000,timestamp=2019-04-08T14:07:48.502+0000)\n>\n> Wait you have moderator rank. But you're new to the game?\n\nNo. I am new to being a Moderator.","replies":[{"poster":"y0r1ck","date":"2019-04-08T14:24:13.244+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Rowanstar,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=000000000000000100000000,timestamp=2019-04-08T14:15:13.512+0000)\n>\n> No. I am new to being a Moderator.\n\nCan you explain how context matters to you?","replies":[{"poster":"Rowanstar","date":"2019-04-08T14:29:33.551+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=y0r1ck,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=0000000000000001000000000001,timestamp=2019-04-08T14:24:13.244+0000)\n>\n> Can you explain how context matters to you?\n\nThere is a difference between friends teasing and playing, or even teammates bantering and joking, and flamers and trolls. I get that you can get mad about game trollers and afkers so i think getting rid of those people will reduce single-time or soft flamers. Now trolls and people who purposfully act badly should be punished period. But I can understand a case by case basis.","replies":[{"poster":"Spidii","date":"2019-04-08T17:09:05.943+0000","up_votes":1,"down_votes":0,"body":"really because I just got a 14 day ban fir a first time soft flaming of two teams verbally abusing me all game. They are still playing right this moment, seems fair right.","replies":[{"poster":"Volta1337","date":"2019-04-08T19:26:27.096+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Spidii,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=000000000000000100000000000100000001,timestamp=2019-04-08T17:09:05.943+0000)\n>\n> really because I just got a 14 day ban fir a first time soft flaming of two teams verbally abusing me all game. They are still playing right this moment, seems fair right.\n\nIn the eyes of the automated tribunal, moderators and Riot employees alike, everyone is expected to have the patience, wisdom, and discipline of a buddhist monk when dealing with legitimately toxic players who's sole purpose is to treat everyone else poorly. Riot likes to think that the majority of their players (at least the ones with the most time invested) are not toxic in any way, shape or form and use this as a foundation with which to judge people. They further like to think that their system prevents people from being toxic, which it definitely does not. People get banned, make a new account but this time they are angrier and have a more cynical approach to the game in general.\n\nEventually these people figure out ways to be JUST toxic enough to fly under the radar and never get punished. However, you get punished for replying to them, even if there was no profanity used. If you spend any time at all talking instead of playing the game, you become a griefer to the players who originally griefed you. I've gotten a chat suspension for ONLY replying to people while I was dead with no profanity.\n\nMy solution? I edited the text file that holds game settings to have my chat scale be -100 or something like that so I never see a single thing anyone else says. My end result is that I stay 100% more focused to the map and pings and overall I play much better.\n\nThe only con I have is that sometimes I think I have the chat window open and end up using my summs but hey, least I don't deal with the toxicity of other players anymore.","replies":[]}]},{"poster":"Spidii","date":"2019-04-08T19:55:03.106+0000","up_votes":4,"down_votes":6,"body":"*cricket* *cricket* no response from moderator or rioter about a 14 day ban for a first time soft \"flaming\" *cricket**cricket*","replies":[{"poster":"Rowanstar","date":"2019-04-08T21:32:11.126+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=Spidii,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=000000000000000100000000000100000002,timestamp=2019-04-08T19:55:03.106+0000)\n>\n> *cricket* *cricket* no response from moderator or rioter about a 14 day ban for a first time soft \"flaming\" *cricket**cricket*\n\nYou have had 5 previous violation, one which resulted in a ban. So not a first time offense by any means. I also noticed you tend to flame and troll in comments repeatedly and it has caught up to you. I understand it can be difficult to remain calm especially when dealing with other people on the internet, but I do have a suggestion to prevent you getting banned in the future. Just take a deep breath and remember that you can ignore those who upset you. If you are angry, explain WHY as calmly as possible. You can be firm without being aggressive.","replies":[]}]}]}]}]}]},{"poster":"Soul Dealer","date":"2019-04-08T20:35:27.845+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Rowanstar,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=0000000000000001,timestamp=2019-04-08T13:57:29.377+0000)\n>\n> ALL of us? Because I am new and I certainly think context is important (unless you are being outright horrid). I cant speak for anyone else though.\n\nWell then, welcome to the boards. I said all because a majority of the time mods will say context does not matter and should not matter and it gets frustrating. If you believe context matters then good on you and keep up the good work.","replies":[]}]}]},{"poster":"GreenHydralisk","date":"2019-04-09T18:27:59.959+0000","up_votes":3,"down_votes":0,"body":"Ya dude sometimes I'm amazed at how someone could possibly be that ignorant at a champion. Yesterday I had a Jinx adc (she was m6 or m7). Her first item was the 400g crit glove and she rushed a zeal plus some daggers and glove while the enemy adc had a bf sword. Also she spammed her choppers on cool down. She let the tower hit her when she threw the choppers on the enemy under their tower. By the end of the game she did not have a single ad item. But it goes unnoticed since she didn't say anything in chat","replies":[]}]},{"poster":"Rowanstar","date":"2019-04-08T13:56:14.057+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Soul Dealer,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=0000,timestamp=2019-04-08T10:08:11.015+0000)\n>\n> The worse part is by trying so hard to ban toxic players riot makes more people grief and troll. Unfortunately the white knights and mods will come in here soon and defend riot but we will keep posting until riot listens.\n\nWhat do you mean, that banning toxic players makes more people toxic?","replies":[{"poster":"Serika Zero","date":"2019-04-09T10:31:30.766+0000","up_votes":4,"down_votes":0,"body":"I used to play a mmo a few years ago. It was called mabinogi, and we didn't really have a report function and reporting players was quite difficult.\n\nOverall the atmosphere was chill. Sure we had people cursing and assholes, but it wasn't to bad.\nand honestly it was quite friendly game.\n\nThen they introduced vindictus, which was another mmo but based on action gameplay. And at the start it was sort of ok. \nThen they introduced a report function on forums. And that game turned into a bunch of elitists and crybabies.\nThe \"toxicity\" skyrocketed.\nand compared with the other mmo I was playing it was a huge difference.\n\nTo put it simply, if you allow easy reporting, people will report almost anything and the general social fabric will degrade.\n-------------------------------------\nLoL was or still is reknown as the most toxic game community.\n\nAnd honestly the fault for this doesn't belong with just the community. I don't see how this game would attract only the worst people out there.\nBut I do see decisions made by riot that would encourage bad behavior.","replies":[]},{"poster":"Spidii","date":"2019-04-08T17:18:10.275+0000","up_votes":4,"down_votes":0,"body":"Yes, you have people that are frustrated with trolls, afks, intentional feeders, people intentionally trying to make them lose who don't even get punished, yet soon as they say something they get punished. Anyone is going to be more frustrated and upset when you take away their ability or punish them for expressing how they feel. less people would feel upset if you just let people express themselves and let the ones who don't want to hear it just use the mute button. If riot tried that for a month I bet that they would see a large amount of players reduce their anger and toxicity. Yea you would still have the group that are just ragers but you will always have that. It's human nature sometimes people just need to blow off a little steam and if you don't want to hear it just mute them. However banning the players does not get rid of them, and riot knows this, that's why they don't restrict a single account to an email, players buy or create another account and come back even more angry and upset. Riot isn't addressing the underlying problem they are just putting a band-aid on a sunburn it isn't even using the right solution. \n\nIf riot punished the griefers, afkers, quitters, trolls, intent feeders, and people who make you intentionally lose. I mean going after them really heavy, you watch how quickly your community would see it's toxicity levels drop, that plus allowing people to express themselves would do wonders. I have been playing this game since season one and yes more people have joined since then, but the toxicity only gets worse every season, and yes I get that will grow with a growing game and yes there were toxic players before but not to this level, and the harder the ban hammer the more toxicity and trolling I notice.","replies":[]},{"poster":"Soul Dealer","date":"2019-04-08T20:33:34.454+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Rowanstar,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=00000002,timestamp=2019-04-08T13:56:14.057+0000)\n>\n> What do you mean, that banning toxic players makes more people toxic?\n\nI mean that when you ban people for being toxic in chat the people who still want to be toxic find other, often times worse, ways of being toxic to their team. Examples are inting, afking, and trolling.","replies":[]},{"poster":"Kazekiba","date":"2019-04-08T14:51:40.228+0000","up_votes":4,"down_votes":1,"body":"I actually kinda get this. \n\nPlayers understand that they cant drop N-bombs or talk about Korean Maplestory in game, so they take their anger out in other ways instead. \nLike intentionally overextending and AFK pushing knowing it gets them killed, and the other behaviors OP experienced. \n\nThere's no leniency for 'toxicity' and it ends up with an extreme leniency for behaviors that ACTUALLY NEGATIVELY IMPACT OUTCOMES, rather than the mental state of the players. Don't get me wrong, I'm glad Riot punishes as hard as they do, although it's not a perfect system either (No punishment forgiveness for instance. If you get a 2 week ban at any point, for any reason, your next punishment is GUARANTEED Permanent and there's nothing you can do about it, even if you havent been punished in 4 **years**.) Aside from a few tweaks, every time someone goes online to complain about being perma'd, they post chat logs and they absolutely deserved it. \nBut 8, 9 years or so of punishing toxicity hasn't done much for making League less toxic, now has it? \n\nThe system doesn't work.","replies":[]},{"poster":"Ph03n1xb1rd","date":"2019-04-09T15:48:38.861+0000","up_votes":2,"down_votes":0,"body":"They are just converting chat toxicity to gameplay toxicity.\n\nYou were punished for telling an idiot how much he sucks, good. The next time just int the game and finish as fast as possible (since you know this way you will not get banned.) While saying how good your team is, just to add some salt ;)","replies":[]}]},{"poster":"Jennifer420","date":"2019-04-08T13:19:09.069+0000","up_votes":5,"down_votes":2,"body":"***","replies":[{"poster":"Disembark","date":"2019-04-08T17:56:39.906+0000","up_votes":3,"down_votes":0,"body":"- someone that never goes on reddit\n\nlmao. Reddit doesn't suck riots dick at all. They bitch and complain plenty. Just because every thread isn't to bitch and complain doesn't mean it doesn't happen.","replies":[{"poster":"Jennifer420","date":"2019-04-08T18:33:17.760+0000","up_votes":2,"down_votes":0,"body":"EVERYWHERE on the internet you will find complains. \nbut on lol reddit most of them go unnoticed.\n\nand yeah they suck riots dick 24/7. they are like season 1-6 NA boards: defending everything riot does no matter what and hating on everyone who says anything against riot.","replies":[{"poster":"Disembark","date":"2019-04-08T18:41:35.649+0000","up_votes":2,"down_votes":0,"body":"You don't use reddit often then. There is literally no other way to put it. Any time there aren't a lot of competitive games going you'll see reddit filled with equivalent garbage to the boards. \\\n\nIt's okay if you don't use reddit. Reddit is better off for it.\n","replies":[]}]}]}]}]},{"poster":"RebeccaUCuber","date":"2019-04-08T12:17:11.687+0000","up_votes":11,"down_votes":0,"body":"same happened to me before...\nEven in Diamond, a Friend of mine said The level of play is so underwhelming! The problem is...this is not a lack of skill, but Just ppl that really dont want to play the game or don't even try To not die 15 times.\n\nThis griefers Just don't care about the game FROM START most of the times, and find The cheapest  excuse to run It down, or more often, afk push.\n\nAfk push never gets them punished but it's The exactly same thing as running it down in terms of game experience.\nYou just have to not write anything in chat and you'll never be punished. And This is awful! \n\nMy \"personal record\" is one teamate Who wanted to ff and afk pushed from 3.30 Min...\nNot even 4 minutes...","replies":[]},{"poster":"General Esdeath ","date":"2019-04-09T03:29:57.567+0000","up_votes":7,"down_votes":0,"body":"I've said it before and I'll say it again;\n\nRiot needs to bring back Tribunal and have video playback for reports of griefing. Automated system can stay for reports of hate speech but bring back Tribunal.\n\nI don't care if that guy who inted in my game is banned 8 months later, as long as I know he's banned. Imagine saying the justice system is flawed because people are arrested months after their crime.","replies":[{"poster":"Karunamon","date":"2019-04-11T15:57:44.931+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AngusBoomPants,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=001b,timestamp=2019-04-09T03:29:57.567+0000)\n>\n> I've said it before and I'll say it again;\n> \n> Riot needs to bring back Tribunal and have video playback for reports of griefing. Automated system can stay for reports of hate speech but bring back Tribunal.\n> \n> I don't care if that guy who inted in my game is banned 8 months later, as long as I know he's banned. Imagine saying the justice system is flawed because people are arrested months after their crime.\n\nI get what you're saying, but 8 months represents a **metric fuckton** of ruined games. Given how cheap and easy level30 accounts are to get, they need to be banned faster. Anything less isn't justice.","replies":[{"poster":"General Esdeath ","date":"2019-04-11T16:27:14.796+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Karunamon,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=001b0000,timestamp=2019-04-11T15:57:44.931+0000)\n>\n> I get what you're saying, but 8 months represents a **metric fuckton** of ruined games. Given how cheap and easy level30 accounts are to get, they need to be banned faster. Anything less isn't justice.\n\nThe problem is you think these people int and grief every game, but they don't. Only when someone makes them mad. The automated system passes it as a bad game. Tribunal could be a lot faster, especially with how much the player base has grown.","replies":[]}]}]},{"poster":"woodvsmurph","date":"2019-04-09T00:26:23.270+0000","up_votes":7,"down_votes":0,"body":"You know... I spent over 2 years explaining this exact type of thing with detailed EVIDENCE and got nothing but grief from the boards.\nI could still be playing despite having gotten chat restricted a couple times for losing my temper over seeing that type of crap over and over and nothing being done about it, but I'm done with it.\n\nI applaud anyone who will still fight for the idea that Riot needs to step up to the plate and actually start dealing with griefing instead of excusing it. I'm happy to see that for once the boards are upvoting such a post rather than spam downvoting and writing mindless stupid replies that show they didn't even bother reading half of what you wrote like I've faced for over 2 years campaigning to fix this issue.\n\nBut until I see meaningful improvement in the way they treat players and the way they deal with griefing, I refuse to play anymore. Sad because I just found an irl friend who actually plays lol about a year ago, but playing the game even just for fun with them suggest that I support their horrible lazy policy in regards to griefing and their overly harsh policy towards \"toxicity\" which can be muted. Funny how toxicity of griefing which cannot be muted is not only ignored, but outright defended and excused by Riot while anything explicit in chat gets brought to the gallows even if it was deserved based on what was done and said to the player who snapped from being repeatedly abused both in chat and by gameplay such as your griefing teammates.\n\nBest of luck to you, but I don't see anything changing any time soon.","replies":[{"poster":"Mathgodpi","date":"2019-04-10T22:23:22.677+0000","up_votes":2,"down_votes":0,"body":"They can do something about the griefers and soft-inters by using an algorithm to deal with the problem in an automated fashion. If your stats were enormously worse than the stats of your teammates, you should not be allowed to access ranked queues for 1 hour.","replies":[]}]},{"poster":"Zardo","date":"2019-04-08T12:14:02.815+0000","up_votes":7,"down_votes":0,"body":"I'd say submit a support ticket, but that even doesn't work all the time.","replies":[]},{"poster":"Ph03n1xb1rd","date":"2019-04-09T15:44:44.789+0000","up_votes":5,"down_votes":0,"body":"What the heck happened on the Boards in the last 5 months?\n\n5 months ago a post like this would be flooded with \"just a bad game\", \"if you cant carry you don't deserve to win\" etc...\n\nDid the general view on this issue change, or this is just a lucky post? :D Maybe if the opinion of the community shifts, Rito might start to do something with this problem O.o Is it time to come back to the game? :O\n\nAnyway, just so you can feel what it was some time ago:\n- It wAs jUsT A BaD GaMe fOr tHeM\n- GeT BeTtEr aNd cArRy tHeM\n- ThE EnEmY HaS TrOlLs tOo, I DoN'T SeE YoU CoMpLaInInG WhEn yOu gEt tHe fReE Lp\n- yOu cAnT PuNiSh pLaYeRs fOr pLaYiNg bAd\n- iT'S HaRd tO DeTeCt\n- yOu aRe sTiLl nOt aLlOwEd tO FlAmE, sInCe tHaT RuInS ThE GaMe, EvEn mOrE ThAn tRoLlS","replies":[{"poster":"KneeI","date":"2019-04-09T16:49:56.950+0000","up_votes":2,"down_votes":1,"body":"don't come back. i repeat, do not come back.","replies":[{"poster":"KneeI","date":"2019-04-09T16:53:04.153+0000","up_votes":8,"down_votes":1,"body":"also my best guess is more and more people are being griefed because trolls have realized as long as they don't type, they'll never be punished. riot might finally make a change, but lets not forget that this is the company that was sexist towards women for years and decided being sexist towards men for a pax event would be the best apology","replies":[]}]}]},{"poster":"Sugarlicious","date":"2019-04-08T15:22:16.961+0000","up_votes":5,"down_votes":0,"body":"Upvote so hard. It hurts so much seeing your games ruined by kids and knowing that no matter what you do, the chances are that they won't be punished. Heck, I'd rather have a manual review system that takes a month to go through a report but actually does something about it than this system that gives you a false feeling of doing something when everybody knows it does nothing.","replies":[]},{"poster":"KirbyCake","date":"2019-04-09T18:45:48.432+0000","up_votes":6,"down_votes":1,"body":"Hard inting is perfectly fine by riots standard as long as it isn't on a famous stream.\n\nHowever, gl flaming your teammates once and getting a chat restriction.","replies":[]},{"poster":"Destaice","date":"2019-04-08T20:40:48.238+0000","up_votes":2,"down_votes":7,"body":"Flaming isn't allowed regardless of the situation.\n\nGriefing has to be investigated which takes time.\n\nYou are part of the problem.","replies":[{"poster":"KneeI","date":"2019-04-09T04:40:07.830+0000","up_votes":4,"down_votes":0,"body":"I'm not saying I shouldn't be banned, all I'm saying is it takes 15 minutes to watch a replay and see someone is blatantly griefing. If you're going to ban me for toxic, have a real person watch the gameplay of the person I flamed","replies":[]}]},{"poster":"DerankingInter","date":"2019-04-10T00:45:37.822+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=One Punch Ví,realm=NA,application-id=ZGEFLEUQ,discussion-id=WBhq1rL7,comment-id=,timestamp=2019-04-08T09:36:48.947+0000)\n>\n> so i just got to plat 4 promos with a 75% winrate. at which point, my jungle ran down mid from min 1 then left, then my adc admitted to griefing, then my top and mid both inted and rage quit. 3 games in a row, 3 games lost due to blatant griefing, i was given a chat restriction for flaming them for losing my promos, but riot won't even do the courtesy of rewatching the games, instead leaving it all to an automated chat filter system. the smallest of indy companies at work\n> \n> UPDATE: my mental has snapped and i have now griefed for several hours straight. people can admit to griefing in chat without being banned, i wonder if the same is true for the forums\n\nI don't believe this is likely,  I almost never see griefing or toxicity so unless you want to show the game i'm gonna assume you are just pulling our legs.  The idea that you got matched with 4 people who inted  while *you* lost *Your* promos seems a little bit sus ;)","replies":[{"poster":"KneeI","date":"2019-04-10T07:23:11.398+0000","up_votes":4,"down_votes":0,"body":"You misread it bud, I didn't say I had just me with 4 trolls on my team. In my first game, just my jungle was a troll. Then just my adc. Then I got an intentionally feeding top and a rage quit mid. This post is regarding a 3 game span, which did coincide to be promos which wouldn't have meant anything except it removes my ability to dodge, which I would have the 2nd and 3rd game.","replies":[]}]},{"poster":"Vreivai","date":"2019-04-09T01:05:49.643+0000","up_votes":3,"down_votes":0,"body":"Can't put that revenue into hiring and training more moderators, gotta put that into researching new ways to charge $100 for something in a way that won't piss the entire playerbase off and run a 100% automated moderation system instead.","replies":[]},{"poster":"Galaxyburstz","date":"2019-04-08T17:07:09.711+0000","up_votes":3,"down_votes":0,"body":"Can I, the 800 cs at 60 minutes Yasuo carry the 2 / 34 Shyvana who didn't get her lane?\n\nhttps://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/3016197169/242976320?tab=overview\n\nDid I get instant feedback? No","replies":[]},{"poster":"marchezee","date":"2019-04-08T15:02:14.041+0000","up_votes":3,"down_votes":0,"body":"First game today. \n\nMy jungle legit said he was trying lower his mmr. \n\nHe got a kill tho so nothing will happen probably. \n\nI feel u","replies":[]},{"poster":"FOR JUSTICE","date":"2019-04-08T14:07:55.550+0000","up_votes":3,"down_votes":0,"body":"bro, same here. if you dont have some kind of major boards posts and then linking it in your support ticket, riot wont do a thing.\n\nliterally had an someone admit:\n\n\"oh im running it down\"\n\"btw\"\n\nstill playing a week later. here was the game:\nhttps://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/3011449187/233787954?tab=overview\n\nand i know its ignored unless you get mass upvoted cause the first guy i ever reported for inting was a cho gath, had been playing for two weeks after the fact. it wasn't until i linked my post to the very same rioter. he was then \"suddenly\"  banned for 14 days.","replies":[]},{"poster":"Starcraft243ver","date":"2019-04-08T15:44:42.295+0000","up_votes":1,"down_votes":0,"body":"So you flammed your toplaner, he went AFK, and then you went afk as well ? \nhttps://i.imgur.com/QHUoJdL.png","replies":[{"poster":"KneeI","date":"2019-04-09T04:36:26.327+0000","up_votes":2,"down_votes":0,"body":"Team voted to open due to AFK, so I stopped playing","replies":[]}]}]}