{"poster":"MrMurkasaurus","date":"2016-10-12T05:02:19.976+0000","title":"Unfair punishment. Help Riot!","subforum":"Player Behavior","up_votes":1,"down_votes":5,"body":"I recently played a ranked game that went extremely well for my team, and extremely bad for the other. Once it&#039;s obvious we start winning the allchat starts FILLING up with uncensored rage. I mean, this is the kind of thing you only see in taehocsiD youtube videos. My team all laughs and thinks its funny, then they start saying they are ALL going to report us for verbal abuse etc. And lo and behold, I get a chat restriction starting the next game. I&#039;ve never gotten any kind of penalty or punishment in League. So this is really crappy. I know I didn&#039;t do anything to deserve it but since all of them reported me because they were salty I&#039;m being punished. I hope riot can go back and read the chat logs, because it is certain once they see it their jaw will drop.","replies":[{"poster":"Zombiemaster","date":"2016-10-12T05:13:41.358+0000","up_votes":2,"down_votes":1,"body":"Have you checked the e-mail associated with your account (including the spam folder) to see if you received anything from Riot? Also, if you were punished by the Instant Feedback System, then logging into the client should yield 1-3 games of chat logs to show examples of what you said that lead to your chat restriction. If you wouldn't mind posting those chat logs, I or someone else could look over them and point out what may have lead to your punishment.\n\nAlso, something to note about punishments, like DTN said, you don't get punished by simply being reported. You get punished based on the behavior you exhibit in your reported matches.","replies":[]},{"poster":"Zezockary","date":"2016-10-12T05:11:01.910+0000","up_votes":1,"down_votes":0,"body":"Punishments through the automated system don't consider how many times you were reported per game, it is just treated as one game you were reported in.\n\nThat being said if you want the community to tell you why you were banned post the chat logs that were provided in your email.\n\nIf you wish to contest your ban with a member of Riot, submit a support ticket. Keep in mind they will not overturn any punishment unless it was an error.","replies":[{"poster":"orange1368","date":"2017-10-08T02:14:18.696+0000","up_votes":1,"down_votes":0,"body":"my friend got unreasonably banned and would like to take it up with riot how would he go about doing this","replies":[{"poster":"Zezockary","date":"2017-10-08T05:11:38.861+0000","up_votes":1,"down_votes":0,"body":"Make a support ticket. It is best if you don't update it unless you have to, as that will put it at the back of the line.\n\nhttps://support.riotgames.com/hc/en-us","replies":[]}]}]},{"poster":"Deep Terror Nami","date":"2016-10-12T05:08:06.502+0000","up_votes":1,"down_votes":0,"body":"If you were punished for chat offenses by the Instant Feedback System, you would've received your chat logs of up to 3 games that contributed to the punishment through an in-client reform card. Did you get one, and can you post it if so? You don't get punished just because people reported you, all reports do is flag your match for review; what matters is your behavior in those matches reviewed.","replies":[]}]}