{"poster":"oOoDezoOo","date":"2015-11-02T16:24:00.092+0000","title":"IL SUPPORTO DELLA RIOT LASCIA A DESIDERARE","subforum":"Discussioni generali","up_votes":3,"down_votes":3,"body":"Alcuni giorni fa ho avuto un problema con il profilo, ho mandato  numerosi ticket alla riot, ma  essa continua a darmi le stesse identiche risposte nonostante gli abbia ribadito il mio problema... continuo sempre di pi&ugrave; a pensare che dietro al supporto ci siano dei bot con risposte memorizzate...  GRAZIE MILLE ANCORA PER NON AVERMI RISOLTO IL PROBLEMA {{summoner:14}}","replies":[{"poster":"StayM","date":"2015-11-02T20:24:01.275+0000","up_votes":2,"down_votes":0,"body":"sì ma se continui a mndare ticket con richieste ancora pendenti perdi la priorità, quindi:\napri un ticket, poi non sicuro ne apri un'altro e quindi 2 ticket nel cesso, poi non contento ne apri un'altro ancora? ancora nel cesso. Apri 3 ticket e stanno tutti come l'ultimo aperto.\naspetta.","replies":[{"poster":"UnknownEV","date":"2015-11-03T09:43:11.041+0000","up_votes":1,"down_votes":0,"body":"Esatto.\nMaaa lui non lo sà lel","replies":[]}]},{"poster":"PrinceUsuiTakumi","date":"2015-11-02T23:47:32.349+0000","up_votes":1,"down_votes":0,"body":"La scoperta dell'acqua calda....la prima risposta è quasi sempre di un bot","replies":[]},{"poster":"oOoDezoOo","date":"2015-11-02T20:25:46.706+0000","up_votes":1,"down_votes":0,"body":"mi dicono sempre di scrivere alla loro email (e-i-a-a-t--@libero.it) ma non rispondono mai\ncome faccio a risolvere i problemi in questo modo","replies":[]},{"poster":"Sorcio84","date":"2015-11-02T18:35:08.646+0000","up_votes":1,"down_votes":0,"body":"> ontinuo sempre di più a pensare che dietro al supporto ci siano dei bot con risposte memorizzate\n\nhttp://truevoicemedia.com/wp-content/uploads/2015/01/you-dont-say.jpg\n___\nho reportato 20 siti che vendevano profili. se entro gennaio non li eliminano, apro un nuovo ticket. quei siti sono la principale causa di bot nella selva e dominion","replies":[]},{"poster":"Lucouss","date":"2015-11-02T18:25:17.451+0000","up_votes":1,"down_votes":0,"body":"Aprire più di un ticket è inutile, continua a discutere con il supporto su un ticket unico e vedrai che prima o poi si giunge a una soluzione :)","replies":[]},{"poster":"SKFF1R SubZero","date":"2015-11-02T16:25:39.782+0000","up_votes":1,"down_votes":0,"body":"La sezione del Forum in cui postare questa cosa non sarebbe tipo \"Aiuto e Supporto\"?","replies":[{"poster":"Heavenly Yasha","date":"2015-11-02T16:58:26.001+0000","up_votes":1,"down_votes":0,"body":"Perchè questo è un forum con regole severissime eh","replies":[]}]},{"poster":"AnDGames","date":"2015-11-02T16:47:35.130+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=oOoDezoOo,realm=EUW,application-id=MJVj50Jw,discussion-id=s9ALZBxM,comment-id=,timestamp=2015-11-02T16:24:00.092+0000)\n>\n> ci siano dei bot con risposte memorizzate...  GRAZIE MILLE ANCORA PER NON AVERMI RISOLTO IL PROBLEMA {{summoner:14}}\n\nci sono dei bot che rispondono in automatico in base a parole chiave presenti nelle domande\nse non ti hanno risolto il problema ti basta rimandare il ticket, non aprirne uno nuovo però altrimenti riavvii sempre la procedura.\ne ricordati che se apri un ticket con ticket ancora pendente, perderai la priorità acquisita","replies":[{"poster":"oOoDezoOo","date":"2015-11-02T17:46:48.145+0000","up_votes":1,"down_votes":1,"body":"grazie ma come ho scritto continuano sempre a darmi la stessa risposta... non si potrebbe parlare con una persona dello staff della riot?","replies":[]}]},{"poster":"oOoDezoOo","date":"2015-11-02T16:28:44.532+0000","up_votes":1,"down_votes":0,"body":"va beh basta che qualcuno della riot lo legga","replies":[]}]}