{"poster":"Nabr","date":"2017-03-23T00:57:54.374+0000","title":"Toxicidad en jugador profesional (ISG QQmore)","subforum":"Comportamiento del jugador","embed":{"description":"QQamor Dando todo su amor <3 - Clipped by t0il","url":"https://clips.twitch.tv/PlausibleQuaintPelicanGivePLZ","image":"https://clips-media-assets.twitch.tv/24844635872-offset-766-21-preview.jpg"},"up_votes":53,"down_votes":34,"body":"Buenas tardes, \n\nA diario en league of legends encontramos jugadores t&oacute;xicos que no aportan nada la comunidad m&aacute;s que ofensas gratuitamente. Esto, es por lo que Riot Games viene luchando hace bastante tiempo para poder erradicar lo m&aacute;ximo posible de sus servidores. \n\nEs por esto, que cada jugador de la comunidad deber&iacute;a aportar su granito de arena reportando al final de la partida a quien hizo de esta diversi&oacute;n un desagrado, por ello creo que los jugadores profesionales quienes son un referente para muchos deber&iacute;an comportarse como tal y dar el ejemplo, ya que son miles de personas quienes vibran  con sus jugadas, las intentan imitar y por cierto copian muchas de sus conductas. \n\nEl d&iacute;a de ayer (21-03-2017) el jugador de Isurus Gaming QQmore durante su transmisi&oacute;n en la plataforma  twitch se encontraba  jugando Lee sin en una partida clasificatoria. En el minuto 04:55 podemos ver como el support aliado  lo pingea un par de veces a lo que su reacci&oacute;n fue un poco desmedida dese&aacute;ndole incluso la muerte a su madre. Creo que ley pareja no es dura y as&iacute; como puede caerle una sanci&oacute;n ya sea de chat o el ban permanente de una cuenta a un jugador com&uacute;n y corriente, se deber&iacute;a hacer lo mismo con quien debe ser un ejemplo para sus seguidores y se comporta de una manera tan repugnante como la que en el v&iacute;deo enlazado se puede apreciar. Recordemos ademas que ya existe antecedente de sanciones a pro players como Ocelote en el a&ntilde;o 2013 si no me falla la memoria existe un v&iacute;deo el cual se titula &quot;Controlling the beast&quot; donde explica lo respecto a su sanci&oacute;n y ademas aparecen im&aacute;genes donde se ve su conducta antideportiva, esto no se aleja mucho de la realidad ya que hace unas semanas jugadores del servidor LAS fueron castigados tambi&eacute;n con penas pecuniarias por su toxicidad.\n\nEspero por &uacute;ltimo que cada jugador se atreva a intentar mejorar esta comunidad, recuerden que el principal objetivo es divertirse y ese sentido no se puede desvirtuar.\n\nLink del clip actualizado:\nhttps://clips.twitch.tv/AcceptableGentleWrenThunBeast\n\nDejo un extra también -hablando de filopo- :\nhttps://clips.twitch.tv/AnimatedHelpfulDuckOhMyDog\n\nSaludos.\n","replies":[{"poster":"reboxer","date":"2017-03-23T01:17:56.857+0000","up_votes":38,"down_votes":29,"body":"***","replies":[{"poster":"Hnk Kenshiro","date":"2017-03-23T01:31:18.420+0000","up_votes":32,"down_votes":5,"body":"La diferencia es que Riot es más estricto con profesionales, ya que supuestamente deben ser buenos ejemplos.","replies":[{"poster":"Snow Kath","date":"2017-03-24T00:10:02.882+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=PJAKt7ph,discussion-id=qn9HqvaP,comment-id=00010000,timestamp=2017-03-23T01:31:18.420+0000)\n>\n> La diferencia es que Riot es más estricto con profesionales, ya que supuestamente deben ser buenos ejemplos.\n\nsi Kenshi código invocador a nivel profesional dice esto \n\npágina 52, sección 10.1.2 Profanity and Hate Speech. \n\n\"A Team Member may not use language that is obscene, foul, vulgar, insulting, threatening, abusive, [...] A Team Member may not use this type of language on social media or during any public facing events such as streaming.\"\n\n\"Un miembro de un equipo no puede usar lenguaje que sea obsceno, hostil, vulgar, ofensivo, amenazante, abusivo [...] Un miembro de un equipo no puede usar este lenguaje en medios sociales o durante cualquier evento público como streaming.\"","replies":[]},{"poster":"ordinvrio","date":"2017-03-23T04:12:27.755+0000","up_votes":15,"down_votes":12,"body":"pero no todo el mundo ve stremear a QQ , aparte nadie obliga a actuar como el , todos son libres de flamear pero no escribir en el chat , aparte por que no lo reportaron los de su equipo? por que no flameo a nadie en el jueguito","replies":[{"poster":"Im Stackman","date":"2017-03-23T06:49:10.211+0000","up_votes":4,"down_votes":7,"body":"yo opino que está MUY sobreexagerando, osea, está bien, manda puteadas gratuitas a travez de un stream xd pero loco no es el unico en hacerlo porque si, hay que pensar que cada streamer tiene una onda y perso para hacer streams y en esas el humor de este tipo es asi xd hay que analizar arto primero","replies":[{"poster":"Hnk Kenshiro","date":"2017-03-23T13:47:29.575+0000","up_votes":6,"down_votes":0,"body":"Pero los pro tienen contrato :s\n\n\nSi fuera cualquiera pos nada, si me gusta lo sigo y si no no, pero es la postura de riot.","replies":[]}]}]}]},{"poster":"xDonatellox","date":"2017-03-23T19:48:42.606+0000","up_votes":3,"down_votes":6,"body":"Concuerdo con REBOXER, mientras no flammee en el chat del juego, no hay problema. Yo vivo putendo a voz cuando juego, pero nunca flameo el chat y en muchas ocasiones felicito al team por una buena jugada. Todos flameamos por que es una manera de descargar la impotencia que estas sintiendo en el momento.\nEs un juego si, pero también es competitivo, por lo que es muy propenso al flameo como todo deporte competitivo y no todos podemos con el mal genio, a mi por lo menos me es imposible no flamear cuando nos están stompeando, o cuando un team y me incluyo, hace mal las cosas,\nClaro que todo esto hablo bajo el contexto de flamear a voz y no en el chat.","replies":[{"poster":"Snow Kath","date":"2017-03-24T00:09:29.878+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Facundo IV,realm=LAS,application-id=PJAKt7ph,discussion-id=qn9HqvaP,comment-id=00010001,timestamp=2017-03-23T19:48:42.606+0000)\n>\n> Concuerdo con REBOXER, mientras no flammee en el chat del juego, no hay problema. Yo vivo putendo a voz cuando juego, pero nunca flameo el chat y en muchas ocasiones felicito al team por una buena jugada. Todos flameamos por que es una manera de descargar la impotencia que estas sintiendo en el momento.\n> Es un juego si, pero también es competitivo, por lo que es muy propenso al flameo como todo deporte competitivo y no todos podemos con el mal genio, a mi por lo menos me es imposible no flamear cuando nos están stompeando, o cuando un team y me incluyo, hace mal las cosas,\n> Claro que todo esto hablo bajo el contexto de flamear a voz y no en el chat.\n\nCodigo invocador página 52, sección 10.1.2 Profanity and Hate Speech. \n\n\"A Team Member may not use language that is obscene, foul, vulgar, insulting, threatening, abusive, [...] A Team Member may not use this type of language on social media or during any public facing events such as streaming.\"\n\nTraduzco: \"Un miembro de un equipo no puede usar lenguaje que sea obsceno, hostil, vulgar, ofensivo, amenazante, abusivo [...] Un miembro de un equipo no puede usar este lenguaje en medios sociales o durante cualquier evento público como streaming.\"","replies":[]}]}]},{"poster":"kALAVAR","date":"2017-03-23T03:23:38.165+0000","up_votes":31,"down_votes":102,"body":"Hola soy el manager de Isurus Gaming. Lo que vengo a decir es que la gente que no va a mejorar la comunidad de LoL ni la sociedad del mundo es la gente tal cual sos vos. En vez de entrenar o intentar ser mejor solo venis aca a reportar gente que se parte el alma entrenando para que la región sea reconocida a nivel mundial.\n\nMirate la pelicula Perfume de Mujer a ver si empezas a entender un poco la vida.\n\nSaludos","replies":[{"poster":"Excalibeer","date":"2017-03-23T13:51:14.190+0000","up_votes":61,"down_votes":4,"body":"Wow, que pena tu respuesta.  Lo bueno es que así sabemos quienes son parte del problema y quiénes de la solución.  \n\n-Excalibeer","replies":[{"poster":"DoReMiFaSolLaSí","date":"2017-03-23T17:22:06.234+0000","up_votes":5,"down_votes":13,"body":"Yo lo apoyo no es solo un miembro del equipo tambien en su amigo y es normal que lo defienda mas de alguno hariamos lo mismo en esta situacion aparte de tener razon en algunos aspectos como si queremos mejorar la comunidad mejor partir primero por cambiar uno mismo y no influerciarnos por las actitudes de los demas y eso se logra a travez de la educacion un buen ejemplo de esto es helior. Algo mas yo vi su stream anoche y sus puteadas fueron una buena humorada lo pase bien viendolo y compartiendo en su chat ojala que con esto no deje de hacer stream.","replies":[{"poster":"Excalibeer","date":"2017-03-23T18:05:47.123+0000","up_votes":22,"down_votes":2,"body":"Defender a un amigo = aceptable.  \nAtacar a los que tienen una crítica razonable= no.  \n\n> si queremos mejorar la comunidad mejor partir primero por cambiar uno mismo  \n\nExactamente a lo que me refiero con \"parte de la solución\" o \"parte del problema\" :-)\n\n-Excalibeer","replies":[{"poster":"Emma Zunz","date":"2017-03-23T19:32:43.533+0000","up_votes":3,"down_votes":27,"body":"En qué lugar del código del invocador sale un artículo sobre eso? Qué penoso y poco profesional tu comentario. Pensé que Riot tenía a gente más preparada dentro de su personal. \nLa situación de denunciar a un jugador por lo que dice en su stream personal, y la de un trabajador de Riot que llama \"penoso\" a alguien en un foro me parecen lo mismo. Si QQ recibe sanción, entonces tú también debieras recibirla, me parece igual de flamer. \nSaludos.","replies":[{"poster":"Excalibeer","date":"2017-03-23T20:11:36.350+0000","up_votes":22,"down_votes":1,"body":"> En qué lugar del código del invocador sale un artículo sobre eso?   \n\nEl código del invocador regula el comportamiento en juego.  Si no tuvo mal comportamiento *en juego*, el código del invocador no tienen nada que decir sobre eso.  \n\nSin embargo, si es un pro player, hay otro reglamento en juego del que quizás no estás al tanto:  \n\n[Aquí hay una copia del 2016 en inglés que quizá quieras leer.](https://riot-web-static.s3.amazonaws.com/lolesports/Rule%20Sets/2016%20Spring%20LCS%20Rule%20Setv3_01.pdf)\n\nPara ahorrarte tiempo, página 52, sección 10.1.2 Profanity and Hate Speech. \n\n\"A Team Member may not use language that is obscene, foul, vulgar, insulting, threatening, abusive, [...] A Team Member may not use this type of language on social media or during any public facing events such as streaming.\"\n\nTraduzco: \"Un miembro de un equipo no puede usar lenguaje que sea obsceno, hostil, vulgar, ofensivo, amenazante, abusivo [...]  Un miembro de un equipo no puede usar este lenguaje en medios sociales o durante cualquier evento público como streaming.\"  \n\nSi te refieres al post de Kala, este es el foro de LoL y tiene su reglamento [aquí](https://boards.las.leagueoflegends.com/es/c/charlas-generales/tYVHLRE9-como-usar-nuestro-foro-reglas-para-el-bienestar-general).  \n\nEse mensaje no fue eliminado, entonces no viola las reglas del foro, pero puedo señalar que es un comentario penoso.  \n\nDe hecho no te parece un poco contradictorio atacar el adjetivo \"penoso\" y usarlo en el mismo post?   Ojalá le des una vuelta y en vez de ser agresivo busques un entendimiento de la situación.\n\n-Excalibeer","replies":[{"poster":"Negrodelwsp","date":"2017-03-23T23:57:38.313+0000","up_votes":2,"down_votes":4,"body":"Pero en un foro en ingles, se menciona que ese reglamento es exclusivo de la \"LCS\" en la introduccion del documento se menciona eso \"These Official Rules (“Rules”) of the League of Legends Championship Series (“LCS”) apply to each of the teams who have qualified to play in the LCS in 2016, as well as theirhead coach, managers,owners, Starters, Reserve players (collectively “Team Members”),and other employees. The 2016Season of the LCS will be divided into two halves (“splits”).\" Entonces, el documento firmado es un timo porque ahora aplica a todo?","replies":[{"poster":"Excalibeer","date":"2017-03-24T02:27:46.179+0000","up_votes":6,"down_votes":0,"body":"Cierto, pero es para ilustrar que los pro players sí tienen reglas que los jugadores regulares no.  En LAS hay reglamentos similares que eSports podrá publicar.\n\n-Excalibeer","replies":[{"poster":"Negrodelwsp","date":"2017-03-24T03:32:50.480+0000","up_votes":1,"down_votes":4,"body":"Segun los bans mas publicos sobre profesionales todos tienen por motivo principal ser toxicos en el chat dentro del juego, ninguno es mencionado por flamear en un stream sin comunicacion con el team. La pagina de lolesport asi lo menciona y lo aclara, nunca han mostrado un documento donde a los profesionales se les exija como actuar en un stream, te dejo la web en ingles donde hablan del ban de forgiven.\n\nhttp://2015.na.lolesports.com/articles/competitive-ruling-konstantinos-%E2%80%98forg1ven%E2%80%99-tzortziou","replies":[{"poster":"Excalibeer","date":"2017-03-24T03:43:45.362+0000","up_votes":4,"down_votes":0,"body":"> nunca han mostrado un documento donde a los profesionales se les exija como actuar en un stream  \n\nMira tu link.  \n\nBaja a \"Relevant rules\"  \n\nAhí está el artículo 10.1.2 que cité arriba.  Sip, el mismo.  \n\nAhí dice al final del párrafo: \"Un miembro de un equipo no puede usar este lenguaje en medios sociales o durante cualquier evento público como streaming.\"\n\n-Excalibeer","replies":[{"poster":"Negrodelwsp","date":"2017-03-24T04:00:39.054+0000","up_votes":1,"down_votes":1,"body":"Si pero ese parrafo hace mencion a las reglas de lcs, en eventos publicos o streaming de la lcs, en el punto anterior de relevant rules es mencionado lo que todos conocemos, esta prohibido ser toxico y bla bla bla dentro del juego.\n\nSi tomamos como correcto lo tuyo dentro del stream y otras cosas, jugadores no profesionales pero aun mas populares en donde sus videos \"putean\" literalmente al team enemigo y aliado como barbakhan por ejemeplo, no son expulsados, podemos decir que un streamer no profesional, esta por arriba de un jugador comun, y un profesional?","replies":[{"poster":"Excalibeer","date":"2017-03-24T04:22:35.640+0000","up_votes":2,"down_votes":0,"body":"> en eventos publicos o streaming de la lcs  \n\nHmmm, no lo interpreto de esa forma.  Tendríamos que preguntarle a los de eSports para cerciorarnos.\n\n> podemos decir que un streamer no profesional, esta por arriba de un jugador comun, y un profesional?  \n\nNo soy experto en los contratos de eSports, pero diría que no.  \nUn jugador profesional tiene un contrato formado con Riot y se acoge a ese reglamento.  \nOtro streamer probablemente no tiene ningún contrato que regule su stream, por lo tanto se acoge a: la ley de su país, los términos de uso de la plataforma con la que stremea, los términos de uso del software que usa y los del juego.  \nMientras no viole esos no veo como pueda recibir castigos, excepto que la mayoría de estas plataformas se reservan el derecho a suspender una cuenta o acceso a discreción.  \n\n-Excalibeer","replies":[]}]}]}]}]}]},{"poster":"WhiteMax","date":"2017-03-23T23:14:06.312+0000","up_votes":3,"down_votes":2,"body":"Por que pones siempre tu nombre al final si se lee al arriba del comentario? :v.","replies":[{"poster":"Excalibeer","date":"2017-03-24T02:29:06.589+0000","up_votes":4,"down_votes":0,"body":"Jajaja, tienes razón...quizá es inseguridad porque me gusta leerlo?  Cuando se me ocurrió estaba tan orgulloso :-)\n\nAhora me siento tonto al escribirlo de nuevo XD","replies":[]}]}]}]}]}]},{"poster":"fideoscountdooku","date":"2017-03-24T00:30:52.800+0000","up_votes":13,"down_votes":0,"body":"Me parece muy sano para League of Legends (más allá de los sentimientos que genere en algunos) que su representante tome partido en este tema; y encima lo haga de esta manera.\nRealmente no podría coincidir mas con Excalibeer. El aporte de Kala es realmente desafortunado, y eso solo empeora la grave situación que ya nos encontramos debatiendo.\nMás allá de que haya sanción o no me preocupa que gran parte de la comunidad justifique la acción de QQmore. Esta sensación empeora cuando alegan que \"uno también insulta en su silla y no perjudica al agredido ya que este no escucha\": Si yo fuera el agredido y llegara a ver este video me sentiría públicamente ofendido y humillado.\nPor otro lado \"es su amigo y es normal que lo defienda\" (justificando a Kala) es una excusa realmente pobre, estamos hablando de nada más y nada menos que un manager, de quien uno esperaría una actitud sumamente correcta, objetiva y diplomática.\nEn definitiva me entristece el comportamiento de QQmore y me preocupa el comentario de Kala. Independiente a lo anterior me tranquiliza la actitud de Excalibeer, a quién me gustaría agradecer.\nCon respecto a la sanción o no, será cosa de Riot y mi opinión no vale; aunque en lo que a mí respecta, ya estan recibiendo una sanción social.\nSaludos a todos y que viva el LoL.\nArgentina y Chile <3","replies":[{"poster":"Excalibeer","date":"2017-03-24T02:31:28.230+0000","up_votes":2,"down_votes":0,"body":"Me da gusto que alguien lo explique mejor que yo, gracias.\n\n-Excalibeer","replies":[]}]},{"poster":"iNGENiO","date":"2017-03-23T14:05:06.441+0000","up_votes":4,"down_votes":21,"body":"Suena a amenaza, querido excalibeer :-)\n\nPor otro lado, la respuesta del manager, me parece penosa también. Podría explicar la situación y clarificar. En vez de generar tensión con el chico que reporta.\n\nAhora bien. Decir cosas al aire mientras uno juega, no es reportable. Si lo hubiera escrito en el chat, seria otra cosa.\n\nMe confieso culpable de putear muchas veces al aire por jugadas del juego que me salen mal a mi o a los demas. Pero claramente eso no es reportable.","replies":[{"poster":"Excalibeer","date":"2017-03-23T17:15:47.177+0000","up_votes":13,"down_votes":1,"body":"No me referí al comportamiento en juego del \"acusado\".  \nLo que dije es que la respuesta es penosa, nada más, y en eso parecemos estar de acuerdo.  \n\n-Excalibeer","replies":[]},{"poster":"rokushoger","date":"2017-03-23T14:34:02.428+0000","up_votes":7,"down_votes":2,"body":"Sanción no creo que haya, pero sigue siendo una actitud reprobable, porque es un pro player e inspiración para muchísimos jugadores. Si los que nos representan en el mundo son así a mi sinceramente me da verguenza.","replies":[{"poster":"Romte","date":"2017-03-23T16:19:31.061+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=PJAKt7ph,discussion-id=qn9HqvaP,comment-id=0009000800000001,timestamp=2017-03-23T14:34:02.428+0000)\n>\n> Sanción no creo que haya, pero sigue siendo una actitud reprobable, porque es un pro player e inspiración para muchísimos jugadores. Si los que nos representan en el mundo son así a mi sinceramente me da verguenza.\n\nEsto no es nada comparado con lo que hacen varios profesionales del servidor, se que los usuarios normales somos muchos y es difícil controlar que todos se comporten bien, pero con los que deberían ser el ejemplo no tienen excusa alguna, no pasan ni de 100 jugadores. \n\nNo voy a decir nombres pero mas de una vez me encontré con jugadores profesionales en clasificatorias, y no todos pero algunos no muestran respeto alguno por los demás, entre ellos son amigos y se tratan bien (o al menos eso parecía) pero con un \"random\" como llaman ellos a los jugadores desconocidos tienen un trato muy diferente, y es una pena que una empresa seria permita que sus representantes a nivel competitivo sean tan poco profesionales en ese sentido, se merecen mínimamente una sanción como ocurre en otros servidores.","replies":[{"poster":"rokushoger","date":"2017-03-23T17:05:49.775+0000","up_votes":2,"down_votes":1,"body":"Ta pero ahí es diferente, porque vos mismo tenés la fuerza de hacer algo reportándolo. En cambio cuando un famoso hace esto por stream sin escribir en chat no solo no hay forma de reportarlo, sino que además eso se está transmitiendo a cientos de personas. Es castigable? No, porque in game no afectó a nadie, pero es muy despreciable a mi gusto.\n\nSi por mi fuera les meto ban de una al ver estos casos, gracias a dios soy solo un voluntario y no tengo herramientas de moderación o comportamiento XD","replies":[{"poster":"Romte","date":"2017-03-23T21:26:23.751+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=PJAKt7ph,discussion-id=qn9HqvaP,comment-id=000900080000000100010000,timestamp=2017-03-23T17:05:49.775+0000)\n>\n> Ta pero ahí es diferente, porque vos mismo tenés la fuerza de hacer algo reportándolo. En cambio cuando un famoso hace esto por stream sin escribir en chat no solo no hay forma de reportarlo, sino que además eso se está transmitiendo a cientos de personas. Es castigable? No, porque in game no afectó a nadie, pero es muy despreciable a mi gusto.\n> \n> Si por mi fuera les meto ban de una al ver estos casos, gracias a dios soy solo un voluntario y no tengo herramientas de moderación o comportamiento XD\n\nLos reporté, pero el sistema es lento y el castigo máximo que va a tener es perder la cuenta. Además, aunque sea baneado, va a seguir jugando y flameando como siempre sucede con este tipo de gente. Insisto, como cualquier jugador profesional, del deporte que sea, tiene que actuar siempre con valores positivos, de lo contrario le quita mucha seriedad a la organización, yo personalmente no voy a ver ni apoyar a alguien que trata mal al resto por creerse un ser superior, por muy hábil que sea.","replies":[]}]}]}]}]}]},{"poster":"Nabr","date":"2017-03-23T03:53:36.660+0000","up_votes":33,"down_votes":10,"body":"Buenas, me parece totalmente absurdo que digas que la gente no va a mejorar la comunidad siendo que son ellos los que le dan vida a esto. Ademas creo que yo u cualquier está en todo su derecho a reportar actos que van en contra de las reglas de la \"comunidad\". En ningún minuto del post he mencionado algo respecto al entrenamiento, pero ese no es el punto, lo importante es que ustedes -Me refiero a los jugadores no al manager propiamente tal- lo siguen muchas personas por ende su comportamiento debería ser ejemplar y se prohíbe cualquier tipo de \"flameo\" aunque tal vez esa parte del contrato se la saltaron.\n\nPD: Gracias por la recomendación, cuando vea la película te hablo para que la comentemos porque defender lo indefendible también es no entender la vida. \n\nSaludos.","replies":[{"poster":"WKH4 Sans","date":"2017-03-23T04:59:59.310+0000","up_votes":26,"down_votes":7,"body":"La pelicula no es buena, ni es nada del otro mundo.\nAl parecer hasta el manager tiene una actitud toxica y muy Petulante.\nGracias por el aporte, saludos.","replies":[]},{"poster":"Durbatuluk","date":"2017-03-24T00:34:04.140+0000","up_votes":7,"down_votes":1,"body":"Realmente agradezco tu aporte. Creo que este es el camino a una mejor comunidad. Sin lugar a duda sos alguien que hace algo para que League of Legends se vea beneficiado, y eso es muy groso.\nGracias compañero de la Grieta, saludos.","replies":[]}]},{"poster":"incúbus","date":"2017-03-23T03:49:21.757+0000","up_votes":27,"down_votes":7,"body":"Ah entonces si yo me esfuerzo en algo tengo el derecho de putear a los demas? o porque represento a mi País/Región tengo derecho a putear? ese es la imagen que quieres que tus players den al resto de la región y gente que esta aprendiendo a jugar? esforzarse para representar a mi región/país etc y así puedo pasar por encima de todos los demás, que tal? soy un representante já que buen pensamiento llevas por la vida amigo","replies":[{"poster":"Blindfold N","date":"2017-03-23T03:51:57.455+0000","up_votes":5,"down_votes":1,"body":"{{champion:3}}","replies":[]}]}]},{"poster":"Ra Horajty","date":"2017-03-23T07:33:22.674+0000","up_votes":15,"down_votes":0,"body":"ojalá actúen conforme a las reglas......","replies":[{"poster":"Dureniox","date":"2017-03-23T21:35:11.758+0000","up_votes":7,"down_votes":0,"body":"Opino lo Mismo , la verdad es que insultar dentro de el juego como juego son parte de las reglas , más aún cuando estas Transmitiendo en vivo ante muchas personas y demuestras esa actitud.","replies":[]}]},{"poster":"Capri","date":"2017-03-23T04:41:19.024+0000","up_votes":20,"down_votes":28,"body":"Lo que realmente me entristece de este post es que sacan de contexto la puteada, hay personas tan mal intencionadas que solo miran el stream de jugadores profesionales buscando esto. ¿Conoces la comunidad de Twitch? Podrá parecer un poco tóxica en canales de público masivo en torneos o de alguna marca, pero por lo general el público de streamers que tienen su propia comunidad, como de QQmore en este caso, se entienden así, tienen sus propias bromas y humor, sin justificar el poema de insultos que envió, estoy segura que no afectó a nadie directamente, seguro que el que estaba en su contra ni se enteró de esto hasta ver este post.\n\nSoy frecuente viewer de QQ y enseña muchas cosas para los que quieren mejorar ¿Por qué no dedicas tu tiempo a hacer un compilado de eso mejor? \nTe invito a ver su stream, además de un buen rato seguramente mejorarás como jugador.\n\nInsisto, creo que es más tóxico mostrar videos así a un público que no tiene idea de cómo funciona la dinámica de la transmisión. Si hubiese quedado ahí seguro habrían sido más personas que se rieron con eso, que a las que les debió haber afectado. En esa misma transmisión que estas dando a entender que es terriblemente tóxica, se han formado amistades, comunidades y mejores jugadores. Sentiría mucha impotencia de que esto termine en una sanción.\n\nSigo sintiendo que esto lo hacen apropósito. Y así como castigan y acusan; También deberían dedicarse a premiar y reconocer.","replies":[{"poster":"OG xDrugs","date":"2017-03-23T22:57:14.999+0000","up_votes":17,"down_votes":0,"body":"Claramente como eres una fans lovers de en este caso ISG obviamente defenderás a QQ. lamentablemente es un jugador profesional que esta bajo ciertos códigos que debe cumplir como tales. en el Segundo video  muestran con la arrogancia que se dirige a filopo ¿crees que esta bien? eso es un ejemplo de un supuesto pro player no lo creo.  la toxicidad cada día es peor en este querido juego para que lo sigan fomentando los  \"PRO\" Saludos {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"ZothGG","date":"2017-03-23T18:18:50.388+0000","up_votes":13,"down_votes":0,"body":"> Lo que realmente me entristece de este post es que sacan de contexto la puteada,\n\nDefender lo indefendible, cada streamer tiene su comunidad ps wow. tener una comunidad toxica donde las puteadeas sean normales es bueno? para un \"proplayer\" ; el no es coscu o lindsan, el es empleado de una compañia, y tu ya se sabes porq lo defiendes...","replies":[]},{"poster":"happyeo","date":"2017-03-23T12:59:13.600+0000","up_votes":12,"down_votes":0,"body":"A lo que se viene el tema del reporte, es que su expresión como jugador profesional no es la indicada, y por lo que le pagan, al igual que las personas ven los stream por diversión, también hay gente que lo hace para aprender, por lo que hay personas que creerán que el flameo es \"chistoso\", y la idea es avanzar como región y poder madurar para no terminar como otros servidores, para darte un ejemplo esta Oceanía que cada día se puede ver como banean a jugadores profesionales por motivos de toxicidad como este.\n\nComo dice el jugador JPN Tom misaki, dejen de tratar de defender lo indefendible solo por que es de su escuadra.","replies":[]}]},{"poster":"Nabr","date":"2017-03-23T02:24:12.328+0000","up_votes":17,"down_votes":4,"body":"Riot es muy estricto con sus jugadores profesionales, de los últimos baneos en este Servidor no ha sido necesariamente por insultar vía chat, sino que por actitudes flamers. Por ejemplo no recuerdo exactamente a que player fue que por levantar el dedo en un partido de la CLS también fue penalizado. \n\nRiot repudia cualquier tipo de agresión, ya sea de forma textual o de otra manera cualquier esta sea.","replies":[{"poster":"SeveeeN","date":"2017-03-23T04:20:39.593+0000","up_votes":2,"down_votes":13,"body":"> [{quoted}](name=JPN Tom Misaki,realm=LAS,application-id=PJAKt7ph,discussion-id=qn9HqvaP,comment-id=0006,timestamp=2017-03-23T02:24:12.328+0000)\n>\n> Riot es muy estricto con sus jugadores profesionales, de los últimos baneos en este Servidor no ha sido necesariamente por insultar vía chat, sino que por actitudes flamers. Por ejemplo no recuerdo exactamente a que player fue que por levantar el dedo en un partido de la CLS también fue penalizado. \n> \n> Riot repudia cualquier tipo de agresión, ya sea de forma textual o de otra manera cualquier esta sea.\n\n No es lo mismo una transmision de riot  que es 100% oficial a un stream que es mas personal creo que estas exagerando mucho el lo dijo al stream no le dijo a el por el juego ni nada si lo analizas bien si el no hubiera estado en stream (algo personal de el ) sabrias que lo hubiera dichoo?? No es imposible ,el flameo o toxicidad es por el chat no tiene nada que ver un stream de un jugador","replies":[{"poster":"WKH4 Sans","date":"2017-03-23T05:00:20.353+0000","up_votes":12,"down_votes":0,"body":"La toxicidad la tiene igual.","replies":[]}]}]},{"poster":"AuroraExecution","date":"2017-03-23T03:46:47.283+0000","up_votes":16,"down_votes":6,"body":"Por favor sancionenlo y que de el ejemplo. Gente asi merece ser baneada.","replies":[]},{"poster":"Inori","date":"2017-03-23T06:00:18.423+0000","up_votes":6,"down_votes":15,"body":"Ni fue en el chat, todos tiran putias al aire  cuando juegan, cualquier color la mamita.","replies":[{"poster":"ZothGG","date":"2017-03-23T18:21:54.862+0000","up_votes":12,"down_votes":0,"body":"pero no todos somos \"proplayers\" ni tenemos salario de riot papa","replies":[]}]},{"poster":"LukasNegro","date":"2017-03-23T04:29:17.332+0000","up_votes":12,"down_votes":5,"body":"sendo cumbion {{champion:84}}","replies":[]},{"poster":"ReppiZ","date":"2017-03-23T19:49:14.443+0000","up_votes":6,"down_votes":0,"body":"que buenos memes","replies":[]}]}