{"poster":"GhostClownMurder","date":"2015-03-27T15:47:58.087+0000","title":"shaco esta muy flojo","subforum":"Charlas Generales","embed":{"description":"No puede ser que un shaco con 3 kills y mas farmeo que un hecarim con 0 kills el caballito venga y te parta la cara es ilógico, no tiene ningún sentido, por muy counter que sea, si tu a un tío le sacas 3 kills , le vas delante en farm y tienes mas objetos si o si te lo tienes que comer en 1 vs 1.","url":"http://boards.euw.leagueoflegends.com/es/c/miscelanea-es/56zXEZ8s-shaco-esta-muy-flojo","image":"http://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":3,"down_votes":4,"body":"Shaco esta floj&iacute;simo en LAS y en otros servidores la gente opina exactamente igual, no puede ser que con todas las modificaciones que se hicieron en la jungla este campeon no reciba ni un leve buff.\r\n\r\nTiene un buen early pero podes terminar 5/0/5 y al minuto 20 pasas a ser obsoleto, ni siquiera tiene la capacidad de deletear a un carry como corresponde.\r\n\r\nNi hablemos del win rate que es uno de los mas bajos del juego, esta bien que el campe&oacute;n sea viejo pero deber&iacute;an prestarle mas atenci&oacute;n asi como hacen con todos","replies":[{"poster":"LGBT Valentina","date":"2015-03-27T22:14:58.301+0000","up_votes":1,"down_votes":0,"body":"Shaco buff? LOL\n\nShaco actualmente, es uno de los jg mas fuertes en esta Season no se que decis...","replies":[{"poster":"SrElite","date":"2015-05-17T18:46:21.680+0000","up_votes":1,"down_votes":0,"body":"{{item:3751}} {{item:3751}} {{item:3751}} {{item:3751}}","replies":[]}]},{"poster":"Revolución","date":"2015-03-27T23:30:58.377+0000","up_votes":1,"down_votes":0,"body":"El tema original que estás citando tiene un balance de un voto negativo, y está hecho por un jugador de Europa Oeste bronce 5. Tomar algo y darle énfasis porque es de otro lado no es buena idea, yo las pocas veces que traje discusiones de otros servidores revisé que sean temas muy populares o bien planteados, este no es el caso.\n\nQue venga un Hecarim y mate a Shaco en un 1vs1 donde Shaco se planta a pegar nomás no es nada raro, Shaco es un campeón que se juega con inteligencia y con jukes, lo suyo no es plantarse de cabeza contra un tanque que se cura y tiene control de masas. Shaco lo mata a Heca paséandolo por la jungla en las circunstancias que citó (a la diferencia de oro me refiero).\n\nCada campeón tiene su propia ciencia y su propio estilo, Shaco no es un campeón para plantarse o con gran control de masas para peleas de equipo, un buen Shaco donde ve que está siendo superado hace un fuerte split push y asegura objetivos, en eso es implacable. Su early es bestial, es una amenaza permanente para impedir el crecimiento de campeones poderosos en fases tardías.\n\nLas cajitas de Shaco son herramientas MUY fuertes bien utilizadas, me parece que el campeón en sí está perfecto, nada más hay que saber cuándo usarlo y cómo.","replies":[]},{"poster":"RikoFang","date":"2015-03-27T22:09:35.340+0000","up_votes":1,"down_votes":0,"body":"Tengo un amigo que llego a platino jugandoi shaco jungla, creo que el campeon requiere \"manos\"\nla cosa es que si lo dejas sin kills en early en late no sirve,\npero esto es las y a la gete le encanta pushear sin wards, sin pinks y solo para molestar....","replies":[{"poster":"Revolución","date":"2015-03-27T23:21:20.378+0000","up_votes":1,"down_votes":0,"body":"No requiere manos, requiere cabeza. Son cosas diferentes, Shaco es más estratégico que buscar rivales con poca vida y ejecutarlos estando invisible, alguien con buena lectura del juego le saca buen provecho.","replies":[]}]},{"poster":"RNGesus","date":"2015-03-27T21:44:47.468+0000","up_votes":1,"down_votes":0,"body":"{{item:3707}} {{item:3074}} {{item:3087}} {{item:3031}} {{item:3078}}  vos decis que ni en late con estos items deletea a un carry?","replies":[]},{"poster":"GhostClownMurder","date":"2015-03-27T20:45:57.943+0000","up_votes":1,"down_votes":0,"body":"Usen lo en competitivo chicos.. después me dicen vamos a ver q hace cuando el otro team te saca un sup tan y un jungla tan ya es gg","replies":[]},{"poster":"Monserrat tu sup","date":"2015-03-27T16:15:51.572+0000","up_votes":1,"down_votes":0,"body":"shaco esta bien, (si se usa bien claro) y ayudas a que tu team se fedee los primeros minutos cumplió el objetivo como campeón ademas si se deletea a un adc. o un champ blando","replies":[]},{"poster":"Runth","date":"2015-03-27T23:33:55.072+0000","up_votes":1,"down_votes":1,"body":".......\n\nShaco enemigo o jugador seco con Shaco:\n\n{{champion:35}}  Ahora me ves , Ahora no.... Contrajungleado y.....\n\n {{champion:35}} Primera Sangre {{champion:113}} \n\nUn Gank en bot:\n\n{{champion:35}}  Dobre Kill {{champion:67}} {{champion:412}} \n\nEn una TF:\n\n{{champion:35}}  Pentakill... ACE  y gg shaco 8000/0/0(mas de 8 mil!!!)\n\nShaco aliado o usas primera vez a shaco\n\n{{champion:35}} Ejecucion","replies":[]},{"poster":"Sirek","date":"2015-03-27T18:59:49.184+0000","up_votes":1,"down_votes":1,"body":"Shaco es es un Glass Canon, es el champ que puede jugarle un 1 vs 1 a cualquier champ adc (Incluso puedes counterear a un zed si sabes cuando tirar al clon), pero a personajes tanques u OffTank no puedes plantarte 1 vs 1, (solo con algunos y con el clon disponible). \n\nTen en cuenta que la pasiva de Shaco funciona en la espalda del oponente, y es realmente su fuerte, aparacer por la espalda y hacer el mayor daño posible, hacer el Snowball en las lineas de tu team, tratar de hacer counter jg los primeros minutos contra jg debiles en el early que pierden mucha vida en ella, ser la escoba y reventar ADC y APC en las TF, no meterte cuando recien inicia la TF, Split pushear por su capacidad de escapar, etc..... Las cosas que puedes hacer con el son muchisimas, solo es aprender a usarlo y que equiparle en cada partida (Hydra, Penetracion de armadura, Trynity, AP, AD, ETC...... tienes muchas configuraciones de Items dependiendo del team enemigo). \n\nShaco esta perfect, por mi que no lo buffearan, nerfearan y menos reworkearan.....","replies":[]}]}