{"poster":"Tortuguita","date":"2018-01-23T18:12:57.445+0000","title":"¿Cuanto en Pociones Gastas?","subforum":"Off-topic y temas personales","up_votes":5,"down_votes":1,"body":"Es algo que me ha estado dando vueltas en la cabeza por much&iacute;simos meses y es la pregunta &iquest;Cuando gaste de oro en todas mis partidas al comprar la pocion de 500?. Realmente cada vez que vuelvo a base y me sobra esa cantidad o simplemente antes de comprar una espada de 350 revendo las pociones reutilizables para comprarla nuevamente , es que me parece insane la cantidad de veces que la compre.\n\nA lo que voy . &iquest;Ustedes con que frecuencia compran las pociones y si lo hacen muy seguido piensan que seria mejor utilizar ese dinero en otros items?\n\n\nPD: Esto esta en off-topic por que me parece que poner esto que no tiene ninguna importancia en otra seccion seria muy feo.\n\nTortuguita - \"Nunca Dejes De Sonreir\"","replies":[{"poster":"Turing Test","date":"2018-01-24T00:39:04.529+0000","up_votes":2,"down_votes":0,"body":"Comprar pociones es un malgasto de oro. Morir es gratis y recarga tu vida por 0 de oro. Este juego tiene vidas infinitas","replies":[{"poster":"Ks Erwyn","date":"2018-01-24T02:59:57.260+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lulu}}","replies":[]}]},{"poster":"Ks Erwyn","date":"2018-01-23T18:28:00.610+0000","up_votes":2,"down_votes":0,"body":"No man ,es parte de jugabilidad debiste publicarlo allí, ya que en definitiva esta hablando sobre algo dentro del juego...\n\n\nActualmente la {{item:2031}}  es uno de los objetos con coste-eficiencia del juego, tiene un valor real de compra de 90 de oro(vender a 60) lo cual lo hace mas barato que 2 {{item:2003}}, potenciado con la Runa de la galletas, vas sobrado en sustain en base a pociones, a la larga es un ahorro importante en pociones y oro destinado a otros items.\n\nSobre si mejorar la {{item:2031}}  a {{item:2033}} depende de algunos factores, asi como del campeón que estés usando o de su rama de itemizacion, que tan continuos son tu trades en linea?los estas ganando? es tu intención contestar los  trades o evitarlos? implemente  buscas ganar sustain para mantenerte farmeando?\n\nLa {{item:2033}}  solo genera un sustain realmente efectivo cuando intercambias daño con el rival, si es el igualdad de poder, mejor por lo que los ganaras siempre ya que ademas de aplicar mas daño te curaras en el proceso, pero si lo que buscas es evitar tales trades, invertir por {{item:3211}} {{item:3801}} , {{item:3010}} , que dan sustain contante y pasivo, no es mala idea....","replies":[]},{"poster":"Tortuguita","date":"2018-01-23T21:00:51.131+0000","up_votes":1,"down_votes":0,"body":"Gracias a todos por contestar y responderse entre ustedes , aunque en realidad mi thread era de hablar **sobre las pociones de 500** (las de los buffos) esas son las cuales compro de forma totalmente compulsiva en la mayoría de mis partidas ( tal vez exagere un poco pero es que son muchas) **y que tan efectivo es hacer esto** y **por supuesto si piensan cuantos objetos te puedes comprar con esa cantidad de oro en Elixires de Ira** xD.","replies":[]},{"poster":"lllHeisenberglll","date":"2018-01-23T20:07:26.430+0000","up_votes":1,"down_votes":0,"body":"Yo usualmente compro las primeras basicas {{item:2003}} \nLuego {{item:2031}} para no volver a gastar en pociones \n\nY usualmente a las pociones las uso cuando se que estoy a punto de pelear, ponele te cae el jg, pocion. Tu jungla te da un gank, pocion. Hago un trade largo con el otro adc pocion (durante la pelea), Peleamos con la otra botlane a muerte pocion (lo mismo que el anterior parentesis coño) y nada mas xD","replies":[{"poster":"furikake","date":"2018-01-23T20:23:15.886+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=lllHeisenberglll,realm=LAS,application-id=J8qpiO2I,discussion-id=4uQEZvby,comment-id=0006,timestamp=2018-01-23T20:07:26.430+0000)\n>\n> Yo usualmente compro las primeras basicas {{item:2003}} \n> Luego {{item:2031}} para no volver a gastar en pociones \n> \n> Y usualmente a las pociones las uso cuando se que estoy a punto de pelear, ponele te cae el jg, pocion. Tu jungla te da un gank, pocion. Hago un trade largo con el otro adc pocion (durante la pelea), Peleamos con la otra botlane a muerte pocion (lo mismo que el anterior parentesis coño) y nada mas xD\n\nEstas gastando mucho. En lugar de eso, busca directamente {{item:2031}}  y te ahorras 50 de oro.","replies":[{"poster":"lllHeisenberglll","date":"2018-01-23T20:30:07.964+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=furikake,realm=LAS,application-id=J8qpiO2I,discussion-id=4uQEZvby,comment-id=00060000,timestamp=2018-01-23T20:23:15.886+0000)\n>\n> Estas gastando mucho. En lugar de eso, busca directamente {{item:2031}}  y te ahorras 50 de oro.\n\nSe puede comprar apenas salis de base (osea apenas entras a la grieta por primera vez cuando spawnean todos por primera vez) esta pocion {{item:2031}} ? porque las rojas solo las compro al empezar la partida, luego nunca","replies":[]}]}]},{"poster":"Qiyãnã ","date":"2018-01-23T19:57:15.604+0000","up_votes":1,"down_votes":0,"body":"Lo mejor es comprar {{item:2031}} y usar la maestria cleptomancia, esa maestria te da muchisimas pociones y no solo de cura o de mana si no que pociones buenisimas de daño, de un punto de habilidad,etc.","replies":[{"poster":"furikake","date":"2018-01-23T20:24:08.732+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OzrakLogin Smurf,realm=LAS,application-id=J8qpiO2I,discussion-id=4uQEZvby,comment-id=0005,timestamp=2018-01-23T19:57:15.604+0000)\n>\n> Lo mejor es comprar {{item:2031}} y usar la maestria cleptomancia, esa maestria te da muchisimas pociones y no solo de cura o de mana si no que pociones buenisimas de daño, de un punto de habilidad,etc.\n\nusar cleptomancia depende del campeón, no tiene nada que ver con comprar o no {{item:2031}} .","replies":[]}]},{"poster":"furikake","date":"2018-01-23T20:22:19.169+0000","up_votes":1,"down_votes":0,"body":"Siempre que puedas, compra {{item:2031}}  o {{item:2033}}  ya que el hecho de que sean recargables (más objetos/runas/habilidades que recuperen vida) lo hace muy rentable.\nEvita comprar muchas {{item:2003}}  ya que son muy caras y, con el oro que te ahorres, puedes llegar más rápido a otros objetos.\n\nRecorda que el objetivo siempre es conseguir objetos útiles para la partida y ahorrar oro siempre es bueno.\n\nTe recomiendo que compres de {{item:2003}}  un maximo de 3 (más de esa cantidad es desperdiciar oro) por partida: 1 o 2 al comienzo de partida y 1 o 2 extra si volviste a base muy rápido por presión del rival (solo en esta situación extrema, evita pociones extra si no sufris mucho).\nLas pociones recargables ({{item:2031}} {{item:2033}} ) son muy buenas si vas a pelear mucho en fase de líneas o pierdes mucha vida en la jungla ({{item:2032}} ).","replies":[]},{"poster":"MythicLunarFlare","date":"2018-01-23T19:52:07.652+0000","up_votes":1,"down_votes":0,"body":"Yo siempre compro potis comunes al inicio, normalmente compro alguno de los items iniciales de supp (Tema aparte, {{item:3302}} {{item:3307}} Ya estan los nuevos items para los foros, lul) y 3 potis normales, en el primer back mejoro el item de supp y compro la {{item:2031}}","replies":[]},{"poster":"Shion Archimago","date":"2018-01-23T19:46:15.906+0000","up_votes":1,"down_votes":0,"body":"en aram compro 5 potas siempre q puedo\nen grieta una o dos al primer back\n\ncreo q gasto mas en comprar {{item:2055}}, cuando ni siquiera les doy utilidad","replies":[]},{"poster":"Main Cocina S3","date":"2018-01-23T18:52:11.758+0000","up_votes":1,"down_votes":0,"body":"siempre compro una de G50 y la vida la voy recuperando con trades, runas, robo de vida, pasivas, etc","replies":[]},{"poster":"Ootel","date":"2018-01-23T18:20:22.958+0000","up_votes":1,"down_votes":0,"body":"yo creo que la mayoria de veces, las posiciones solo se compran al inicio por costumbre pero luego ya no necesitas mas.\n\nLa unica razon para comprar mas, es que estes en un duelo de desgaste y debas permanecer en linea, solo esa razon mas probable veo para seguir gastando dinero en posiones, comprar mas sin ninguna razon concreta por partida, me parece que estas botando el dinero.","replies":[]}]}