{"poster":"Senpai Yatogami","date":"2015-10-06T15:12:27.893+0000","title":"Suche DuoQ Partner für Gold/Plat","subforum":"Ligen & gewertete Spiele","embed":{"description":"Create & discover new Champion builds/strategies, check your Summoner statistics and try our powerful LoL charts.","url":"http://www.lolking.net/summoner/euw/23700732","image":"http://lkimg.zamimg.com/images/logo-urf.png"},"up_votes":1,"down_votes":0,"body":"Suche einen guten Duoq Partner in Gold/Plat bereich die das gleiche Problem wie ich haben, unzwar nicht alleine Carrien k&ouml;nnen ^^.\nAber zuerst stelle ich mich vor.\n\nName: Volkan T.  (23 Jahre alt)\n\nLane´s: Top/mid/Jungle\n\nAccounts (Senpai Yatogami): Mein Main Account ist gerade eben auf Gold 2 gedroppt weil wie immer ich nicht alleine Carrien konnte obwohl ich ganz ok gespielt habe ^^ zb. generischen gromp gemacht Blue gestohlen und kills abgegeben habe als Lee sin. Und grade 6 games oder so hintereinander verloren und 2 davon afk games weil main LoL Client rumgespackt hat :( (Firewall Bug, Tipp: lol Repair hilft oft)\n\n2 Account (Riven B&uuml;rst):  Zurzeit auf Gold 1 gerankt mit 99 lp auf diesem Account spiele ich haupts&auml;chlich Riven und war schon auf der Plat promo und da das gleiche Problem ^^ gewinne oft meine Lane helfe mid oder bot gerne aus aber selten weil ich oft keine Gelegenheit bekomme zu roamen, weil der Gegner oft in die lane kommt mit tp oder ich zu wenig leben habe.\n\nZiel: mein Hauptziel ist zurzeit in dieser Season auf Platin zu kommen wegen dem Rahmen haupts&auml;chlich.\n\nSuche: Einen guten Spieler (mind. 18 Jahre alt) auf meinem Niveau der Deutsch sprechen kann, gut als ADC ist aber auch andere lanes sielen kann.\nEr sollte nicht ragen denn ich rage auch nicht :).\nTs3 lieber als Skype haben xD und bitte keine Internet Probleme :) die versauen oft viele Games.\nNat&uuml;rlich auch viel viel Zeit haben :D because No Game no Life.\n\nMind 2-3 Spiele zusammen machen und schauen ob die Synergie stimmt :).","replies":[{"poster":"BKT Sky","date":"2015-10-09T14:19:41.141+0000","up_votes":1,"down_votes":0,"body":"> Ich kann sehr gut als Adc carrien aber alleine zu spielen ist langweilig {{champion:67}}","replies":[]},{"poster":"Ranzeherbert","date":"2015-10-08T08:56:56.722+0000","up_votes":1,"down_votes":0,"body":"Hi,\n\nich habe ein fast aehnliches Problem wie du. Ein Game Carrien kann ich zwar, doch leider gerate ich nur in Teams wo die Mentalitaet \"Yolo\" lautet. Sprich, no Teamwork und blos kein Ehrgeiz gewinnen zu wollen.\n\nIch maine Jungle/Mid, kann aber auch ADC/Sup spielen wenn es sein muss.\nSteht gerade noch bei Gold 1.","replies":[{"poster":"Senpai Yatogami","date":"2015-10-08T11:42:35.647+0000","up_votes":1,"down_votes":0,"body":"einfach adden für probe games ^^","replies":[]}]}]}