{"poster":"ABlueQuaker","date":"2017-02-04T12:45:35.136+0000","title":"The Ranked reset actually BROKE my MMR this season.","subforum":"Miscellaneous","up_votes":1,"down_votes":2,"body":"3v3 I get matched with my own rank.\r\n5v5 Normals I get matched with my own rank.\r\nARAM I fucking get matched with my own rank.\r\n\r\nSolo/Duo and Flex? I&#039;m stuck with actual silvers.\r\n\r\nDid Riot just like, retroactively fuck everyone above Gold because that many people got boosted in Dynamic Queue? I only Soloed and Duoed last season to keep my MMR &#039;pure&#039; so that I wouldn&#039;t get any surprises when I did my placements this season and now I&#039;m stuck playing with players I couldn&#039;t carry with a fucking fleet of forklifts.","replies":[{"poster":"fattyhotdogs","date":"2017-02-04T21:40:19.819+0000","up_votes":1,"down_votes":0,"body":"You haven't notices the flaw in your argument? If so many gold+ got dropped down, and all the silvers got dropped down to bronze.. Then you're still fucking playing with last seasons gold players","replies":[{"poster":"Nightjar","date":"2017-02-05T02:54:33.902+0000","up_votes":1,"down_votes":0,"body":"except there is also bronze trash like me that end up in silver sometimes. \n\nThat said, I don't think we're uncarryable by any means since in a silver vs silver matchup, simply high elo shotcalling should be enough to lead to one side dominating the other. \n\nGood warding, rotations, tp ganks, coordinated skirmishes, good dragon or baron calls, ect... if you have a high elo border in the loadout screen, us silver/bronze scum will generally follow orders diligently (unless upon checking match history you have like a 30% winrate, then we'll just assume you're boosted).","replies":[]},{"poster":"Main Line","date":"2017-02-05T06:21:34.972+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=fattyhotdogs,realm=OCE,application-id=Ntey9fRZ,discussion-id=i3ymkA7d,comment-id=0000,timestamp=2017-02-04T21:40:19.819+0000)\n>\n> Then you&#x27;re still fucking playing with last seasons gold players\n\nLast season's gold 5 players were all bronzers essentially.","replies":[]}]}]}