{"poster":"ABlueQuaker","date":"2015-09-29T10:15:07.846+0000","title":"Really not happy with what looks to be the OCE Skin.","subforum":"Miscellaneous","up_votes":5,"down_votes":1,"body":"Riot: &quot;We want the skin to be representative of the region as a whole.&quot;\n*Churns out the most generic-looking PoS possible and slaps on a Southern Cross logo*\n\nI&#039;m sure we all would have been perfectly content with some sort of sea animal, or a cockatoo. They&#039;re distinctly Oceanian/Australasian. I&#039;d really rather something cool but not 100% accurate, than something bland and uninspired.\n\nGIVE ME A F*CKING GO I CAN COME UP WITH SOMETHING BETTER ON THE SPOT\n\nOCE Quinn - Valor is a Cockatoo.\nOCE Swain - Beatrice is a Lorikeet.\nOCE Heimerdinger - His wrenches are tongs, and his turrets are barbecues and they fire sausages.\nOCE &lt;Insert Void Creature Here&gt; - Is a Shark/Fish/Octopus.\n\nHoly shit you guys are lazy. All this community input and you completely f%cking ignore it.","replies":[{"poster":"Maraudaur","date":"2015-09-30T00:52:02.162+0000","up_votes":1,"down_votes":3,"body":"Hey man,\n\nI'm sorry you feel that way. Hopefully you can still enjoy the skin though!\n\nHave you checked this post by **Insanity Kiwi**?\n\nhttp://boards.oce.leagueoflegends.com/en/c/miscellaneous/xeYRo0OH-my-initial-thoughts-on-the-new-skin\n\n> Okay, so when I first looked at this picture, I failed to see how this skin had a connection to OCE. Kassadin's attire seemed to be rather not matching the culture of the region as I know it.\n> \n> That was before I realized that the art contained stars, many stars. The stars appearing on his costume and in the background suggested to me that the skin is meant to be very celestial inspired. Certainly stars are not uncommon on the flags of the region (particularly the Southern Cross), but that's not really anything special. In that case, we have to look at the cultures of indigenous peoples.\n> \n> I first looked at the Maori people of New Zealand, already knowing they have some folklore around the stars and have used them to navigatre the oceans way back in the past. I did some light digging and found this: http://www.astronomynz.org.nz/maori-astronomy/taatai-arorangi-maori-astronomy-2.html\n> \n> For Australia, this: http://astrogeo.oxfordjournals.org/content/47/5/5.27.full \n> Papua New Guinea has some mountains called the Star Mountains. That's all I was able to find quickly.\n> \n> Most other countries in the region are small island nations, which probably at least used the stars for navigation. Astronomy is therefore likely an appropriate theme for Oceania, though I await further information on the skin.","replies":[{"poster":"Kieshwa","date":"2015-10-01T12:12:33.600+0000","up_votes":3,"down_votes":0,"body":"Haha, Marauder, stop posting that awful spin as a response to it.\n\nAstronomy was not unique to Oceania and wasn't as progressed here as the rest of the world.\n\nCan you explain two years in development for an unthemed skin that we still have to pay for with only 25% discount","replies":[]},{"poster":"ABlueQuaker","date":"2015-09-30T07:38:09.664+0000","up_votes":2,"down_votes":0,"body":"But that doesn't make it any better. Look. Stars. Wow.\n\nWhen I think of Oceania, I think of the culture and the animals and the landscapes. Not constellations.\n\nAnd no, I'm not getting the skin. It's not free. I don't play Mid. There is no conceivable reason for me to want it.\n\nThis is why it needs to be free. Unless you make one for every Role (Top, Mid, Jungle, ADC, Support) at least 1/5th of your playerbase isn't going to want it. I main ADC, with Top as my second preference. It would be incredibly pointless for me to purchase a skin for a role I very rarely play.","replies":[]}]},{"poster":"ƒamous","date":"2015-09-29T10:25:25.976+0000","up_votes":2,"down_votes":0,"body":"I kinda wasn't happy either. It really looks like Shadow Prince Malzahar with a Southern Cross logo. It doesn't represent anything. It's like they made it up and were like \"shit, we've got nothing.. better slap a southern cross on it\" to make it remotely Oceanic themed. The Pool Party skins remind me more of Oceania than this crap.\n\n+1 to your Heimerdinger suggestion, although I don't really like the champion the skin idea is pretty great.","replies":[{"poster":"GigaPube","date":"2015-09-29T15:36:41.059+0000","up_votes":1,"down_votes":0,"body":"holy shit it does look like shadow prince malzahar. i really think its kassadin too so maybe riots going for some sort of \"rivalling\" skin since apparently rivals in the void or whatever.\n\ni also like the donger suggestion","replies":[]}]},{"poster":"Rocka","date":"2015-10-02T08:31:06.268+0000","up_votes":1,"down_votes":2,"body":"your opinion is wrong!","replies":[{"poster":"ABlueQuaker","date":"2015-10-03T16:32:23.353+0000","up_votes":2,"down_votes":0,"body":"That's an oxymoron and a half. By nature, an opinion cannot be wrong or right unless it is supported or dismissed by a known fact.","replies":[{"poster":"Rocka","date":"2015-10-06T16:19:06.751+0000","up_votes":1,"down_votes":1,"body":"Skin is good gg","replies":[]}]}]},{"poster":"SEKAI","date":"2015-09-29T10:21:32.523+0000","up_votes":3,"down_votes":2,"body":"OCE skin is **meant** to be generic due to the region they're trying to cover.\n\nAlso, more ideas =/= better ideas. I don't think your suggestions here are anything better.","replies":[{"poster":"ABlueQuaker","date":"2015-09-29T12:59:09.527+0000","up_votes":2,"down_votes":1,"body":"But at least they're something distinct. From the sounds of things, this skin is gonna be a recolour with some fancy particles and a Southern Cross slapped onto it.\n\nRiot was so scared not accurately representing the region that they didn't end up representing the region at all.","replies":[]}]},{"poster":"Tundra Fizz","date":"2015-10-06T17:04:52.986+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=A Blue Quaker,realm=OCE,application-id=Ntey9fRZ,discussion-id=yQFPkNiM,comment-id=,timestamp=2015-09-29T10:15:07.846+0000)\n>\n>  Is a Shark/Fish/Octopus.\n\n\nI'd be really happy if Riot did a fish-themed Fizz skin ♥","replies":[]},{"poster":"Gunslinger744","date":"2015-09-29T14:14:46.225+0000","up_votes":1,"down_votes":0,"body":"Meanwhile EUBest \"We're sorry the servers were shit for 2 years, have a free 4 win IP boost\". {{item:3070}}","replies":[]},{"poster":"Talon12","date":"2015-09-29T10:50:39.737+0000","up_votes":1,"down_votes":0,"body":"how you get the icon?","replies":[{"poster":"Project Xayah","date":"2015-09-29T10:51:33.939+0000","up_votes":1,"down_votes":0,"body":"If you've been restricted or banned in the past 2 months you can't get it. It was a reward for \"good behaviour\".","replies":[{"poster":"Talon12","date":"2015-09-29T10:58:20.588+0000","up_votes":1,"down_votes":0,"body":"k, most my friends didn't get it either, and I don't think they were restricted/banned","replies":[{"poster":"Project Xayah","date":"2015-09-29T11:03:21.225+0000","up_votes":1,"down_votes":0,"body":"Thing is, the only requirements Riot has mentioned is \"no restrictions or bans\" between 15/6 and 15/9. Sometimes \"mass unlocks\" such as this can take a few days to take full effect, so it may just be a matter of being patient. If you or your friend think you should've got the skin but haven't at that point it's best to contact support.","replies":[{"poster":"Talon12","date":"2015-09-29T11:05:16.446+0000","up_votes":1,"down_votes":0,"body":"I thought it was an icon... but a skin is nice 2 :3","replies":[{"poster":"Project Xayah","date":"2015-09-29T11:08:44.738+0000","up_votes":1,"down_votes":0,"body":"Not skin, icon. Why'd I type skin?\n\nPS If you go onto the sup[port section of the site you actually get a banner at the top of the patch stating the icon giveaway will conclude when patch 5.19 is up (early tomorrow), so you don't have to wait long to get it if you met the requirements.","replies":[{"poster":"Talon12","date":"2015-09-29T11:48:51.112+0000","up_votes":1,"down_votes":0,"body":"ooohh sup[port, fancy words :3","replies":[{"poster":"Project Xayah","date":"2015-09-29T11:53:02.199+0000","up_votes":1,"down_votes":0,"body":"I should really start checking my posts before I post them...\n\n*Quickly checks through post for spelling errors*","replies":[]}]}]}]}]}]}]}]},{"poster":"Nijel","date":"2015-09-29T10:39:49.851+0000","up_votes":1,"down_votes":0,"body":"Since it's Oceania I just assumed it would be along the lines of: \n\nfish {{champion:267}} \nfish {{champion:105}} \nwater{{champion:154}}","replies":[]}]}