{"poster":"JustLie","date":"2016-04-08T09:45:10.238+0000","title":"Warum Smurfen?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"Hallo Leute,\n\nwollte hier einfach mal eine Diskussion starten, da ich immer wieder etwas von Smurfs zu h&ouml;ren/lesen bekomme.\n\nWieso smurft man eigentlich? Reicht nicht 1 Account? M&ouml;chte mal eure Meinungen dar&uuml;ber h&ouml;ren. Wurde evtl. mal diskutiert, doch vielleicht sollte man das Thema nochmal auffrischen.\n\nHabe &uuml;ber die Suchfunktion schon etwas gefunden, indem Abun mal sagte:\n\n&quot;Die Frage ist ja warum Spieler eigentlich smurfen? Und dort scheint es 2 Gruppen zu geben:\n1. die Gruppe die einfach Dampf ablassen m&ouml;chte und ein entspanntes Spiel m&ouml;chte\n=&gt; daf&uuml;r gibt es normale Spiele, wo man sich keine Gedanken &uuml;ber sein rating o.&Auml;. machen muss\n2. diese Gruppe bringt die Argumente: in gold / diamant / platin dauert es vieeel zu lange bis mal ein Spiel startet und die Leute in Bronze k&ouml;nnen ja was von uns lernen\n=&gt; nat&uuml;rlich k&ouml;nnen wir von euch lernen, aber wir k&ouml;nnen es auch lassen! Wenn ich lernen will kann ich mir eure livestreams bei twitch oder sonstwo angucken.&quot;\n\nKann ihm da nur zustimmen. Wie denkt ihr über die Sache?","replies":[{"poster":"Untouchable ProX","date":"2016-04-08T10:25:33.553+0000","up_votes":2,"down_votes":0,"body":"Es gibt da glaube ich weitaus mehrere Punkte.\n\nViele sind in ihrer Elo (oft Bronze-Gold) unzufrieden und smurfen auf einen low-lvl um irgendwas in ihrere Gefühlslage wieder zu pushen.\n\nAber man muss klar unterscheiden ob smurs von lvl 1-29 oder auch höhere.\n\nMeine Smurfs sind mitlerweile 3/4 auf Platin und 1 auf lvl 12.\nMan muss hier klar unterscheiden und kommt auch auf mehrere gesichtspunkte.\n\nAuf meinen lvl 30 Smurfs spiele ich nur rank, hier spiele ich Champs/lanes die ich auf meinen Main weniger spiele.\nEs macht einfach spaß. Ohne Druck (man können wichtige Lp verlieren) rankeds zu spielen.\n\nMein low Lvl acc habe ich für gratis RP und auch damalig für das **Werb dein Freund** geschenkt\nerschaffen.\n\nWas mir dort anmeisten auffiehl waren andere möchtegern Smurfs..\nSie prahlen mit Silber-Mains und machen sich über jeden lustig.\n\nWenn ich Smurfe, schreibe ich nichts. Sowas geht garnicht, neuen spielern den Spaß zuberauben mit flame.\n\nMan muss dies aus mehreren Perspektiven betrachen.\nIch finde es grundsätzlich nicht falsch zu smurfen.","replies":[{"poster":"JustLie","date":"2016-04-08T10:55:11.999+0000","up_votes":1,"down_votes":0,"body":"Kann ich sehr gut verstehen, dass es sich gut anfühlt nicht diesen Druck zu haben. Würde ich gerne auch haben, aber ich bleibe bei meinen Main. ^^\n\nWow, 3 Accounts hast du schon bis auf Platin gebracht? Ist das Gefühl so viel besser die Accounts von Bronze bis auf Platin zu pushen als seinen Main bis beispielsweise Dia I hochzuranken? Du hattest es ja wahrscheinlich sehr leicht, da du ja gegen unerfahrene Spieler gespielt hattest.\n\nIch finde es als Genugtuung, wenn man gegen einen guten, wenn nicht sogar besseren Spieler als man selbst, mal zeigen kann, dass man auch gegen ihn eine Chance hat. ^^","replies":[{"poster":"Untouchable ProX","date":"2016-04-08T11:20:45.016+0000","up_votes":1,"down_votes":0,"body":"Das hat mit Main acc pushen nichts zu tun.\nIch spielte mit mein Smurf lediglich um die 30-50games und war halt PLatin und spielte auch nur gegen meines gleichen also auch Gold/Platin Leute.\n\nEs dauert nur ab Platin länger und ist auch schwerer als <Platin. \nKeine free Wins, mehr abgezogen ec.\nIch spiele mein main acc auch immer weiter, aber es ist ein riesen Unterschied von Gold/Platin zu spüren. Es geht einfach nicht mehr soo schnell vorran.","replies":[{"poster":"JustLie","date":"2016-04-08T11:37:27.731+0000","up_votes":1,"down_votes":0,"body":"Ja, wie Riot das mit den Smurfs macht, damit habe ich mich noch nicht mit befasst. Man wird wahrscheinlich, wie hier schon gesagt wurde, schneller hochgeranked.\n\nDas mit dem \"nicht schnell voran gehen\" kann ich nachvollziehen. Würde mich aber nicht davon unterkriegen lassen und einfach weiter versuchen hoch zu kommen. :)\nDas versuchst du ja anscheinend noch mit deinem Main. ^^","replies":[{"poster":"Untouchable ProX","date":"2016-04-08T12:00:14.384+0000","up_votes":2,"down_votes":0,"body":"Soweit ich weiß, werden Smurfs (vorallem u30) relativ schnell erkannt vom System.\n\nIch spiele auch immer weiter, aufgeben gibs nicht. :D\nAber ist echt zähh :D","replies":[{"poster":"JustLie","date":"2016-04-08T12:06:12.503+0000","up_votes":1,"down_votes":0,"body":"Kopf hoch, wird schon.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]}]},{"poster":"OSaftKiller","date":"2016-04-08T11:41:43.237+0000","up_votes":2,"down_votes":0,"body":"Ich hab nen Smurf als SIlber 5 weil eine Freundin und ein paar andere Freunde das Spiel anfangen wollten und die mit mir spielen wollten. Wollte denen keine Level 30er antun.","replies":[]},{"poster":"Eisvogel","date":"2016-04-08T09:57:51.323+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nMein ersten Smurf habe ich mir erstellt nachdem ich Ca. 4 Wochen gespielt hatte und keine Ahnung hatte dass man nicht leaven darf. Und dass hab ich ziemlich häufig. ^^ Somit wurde ich 2 Wochen gebannt.  Somit habe ich mir einen Zweiaccount erstellt. Nach den zwei Wochen bin ich dann zurück auf meinen eigentlichen Hauptaccount und hab ihn auf 30 gespielt. Mein Problem war ich hab immer nur die seltenen Champion gespielt. (Ashe Lux Blitz) mehr konnte ich nicht. Weil du aber ab 30 permanent gefällt wirst wenn du einen neuen Champ im normal ausprobierst und eben nicht 12/0 stehst bin ich wieder auf meinen Smurf um neue Champs zu lernen. Inzwischen habe ich ziemlich viele Accounts. Mir macht es auch SPAS sie auf 30 zu lvl einzuranken und schauen wie weit ich komm. \n\nLg","replies":[{"poster":"JustLie","date":"2016-04-08T10:44:51.844+0000","up_votes":1,"down_votes":0,"body":"Schön, dass es dir Spaß macht die Accounts bis LvL 30 hochzuleveln. :)\nKenne nur wenige, die darauf abfahren. :D\n\nWenn die dich flamen, mute sie. Du brauchst dir das nicht antun. Spiele so wie du gerne spielen möchtest und lerne daraus.\n\nAber auch hier hätten wir das Problem, dass du durch deine Accounts sehr viel Erfahrung mitbringst und du gegen Anfänger einen Vorteil hast. :/\n\nLässt sich wahrscheinlich eh nicht mehr vermeiden, aber vielleicht kann man ja ein Modus einführen, indem sich wirklich nur Anfänger finden. Aber wie?","replies":[{"poster":"Shiggyvara","date":"2016-04-08T10:47:25.695+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=JustLie,realm=EUW,application-id=YnZkMR0R,discussion-id=Qi4GG297,comment-id=00020000,timestamp=2016-04-08T10:44:51.844+0000)\n> Lässt sich wahrscheinlich eh nicht mehr vermeiden, aber vielleicht kann man ja ein Modus einführen, indem sich wirklich nur Anfänger finden. Aber wie?\n\nKönnte man quasi nur, wenn man einen Anreiz schafft mit Smurfs schneller zu leveln z.B. doppelte Erfahrung, wenn man angibt \"Smurf/Sehr erfahren\" zu sein und dann aber auch nur matchen mit solchen.","replies":[{"poster":"JustLie","date":"2016-04-08T11:41:34.261+0000","up_votes":1,"down_votes":0,"body":"Wäre ne Idee. Riot könnte sich ja mal so etwas in der Art überlegen. ^^","replies":[]}]},{"poster":"Alustus","date":"2016-04-08T11:53:56.551+0000","up_votes":2,"down_votes":1,"body":"Man wird sowieso als Smurf recht schnell nur noch mit smurfs spielen.\n\n\nGründe für Smufs:\n\n- Bestrafungen\n- Freunde\n- Wartezeiten\n- Entspannteres spielen wenn man beispielsweise Körperlich oder geistig nicht mehr auf 100% ist kann man dennoch noch spielen ohne angst um seine MMR haben zu müssen.\n- Training wenn man eine neue Postion oder neue Champs im tryhard modus(Rank) lernen möchte aber seine MMR nicht verlieren will.","replies":[]},{"poster":"Eisvogel","date":"2016-04-09T09:10:48.104+0000","up_votes":1,"down_votes":0,"body":"Ich denke dass ist einfach ein Kreislauf. Wo ich angefangen habe gab es auch Smurfs in meinem und im Gegner Team. Klar ist dass schon unfair, allerdings härtet es dich auch ab. Ich mein später ist es ja auch nicht anders oder? Ich bin derzeit g4 und sehe auch noch welche die smurfen von Platin aufwärts mit einem Silbersccount. Das ist halt so. Der Bot Intro Modus ist glaub ich einer der wenigen Sachen wo wirklich nur Anfänger sind, da ab (glaub) lvl 12 weniger bis gar keine Einflusspunkter mehr bekommst. \nEinen reinen Anfängermodus wird es denke ich nie geben. Riot kann ja nicht sagen \"Dieser neue Account ist ein Anfänger\" und \"Dieser Account ist ein Smurf\"","replies":[]}]}]},{"poster":"Abasin","date":"2016-04-08T11:52:58.520+0000","up_votes":2,"down_votes":1,"body":"1. Es ist nicht verboten\n2. Gewohnheit aus anderen Spielen. Bei 9Dragons zum Beispiel gab es 6 Klassen, aber nur 3 Charakterslots pro Account. Wenn man also alle ausprobieren wollte, musste man sich 2 Accounts anlegen.\n3. Man will manchmal einfach \"alleine\" spielen und nicht beim Login schon mit Anfragen aus der FL zugeschüttet werden.\n4. Sammlertrieb.","replies":[{"poster":"Bob Kelso 30cm","date":"2016-04-08T12:56:00.213+0000","up_votes":1,"down_votes":0,"body":"+1\nPunkt 1 und 2 eher nicht meine Beweggründe.\nEs sind die IP die auf dem Mainaccount überquellen, darüberhinaus will ich hin und wieder meine Ruhe haben beim spielen.\nUnd zu guterletzt ist die MMR auf jedem meiner Accounts verschieden. Wenns auf dem einen grad nicht läuft dann auf dem anderen vllt.\nPlat 2 - 73% winrate, anderer Plat 2 - 54% winrate. Achja und der aktuell wichtigste Grund zum \"smurfen\" - habe jede Menge Kumpels\nin anderen Elo-Bereichen, ohne meine Smurfs könnte ich nur normals und dann nur \"unfaire\" normals mit denen spielen. Ja, auch normal \nGames haben eine MMR und die ist auf meinem Main Account bedeutend höher als auf meinen smurfs. Kein Silber/Bronze Spieler legt \nwert darauf (und sei es nur ein normal game) von einem Diamond/High Platin verhauen zu werden.\n\nDas ist alles. Smurfs sind absolut nicht das Problem in League. Das Problem sind die Massen an Boosting Diensten, welche die Elo verfälschen\nund dann in Platin Games irgendwelche Silber Spieler rumturnen die meinten auf eBay ein wenig Geld rauszuwerfen.","replies":[]}]},{"poster":"Pure Cynicism","date":"2016-04-08T09:51:18.610+0000","up_votes":1,"down_votes":1,"body":"Da kann es einige Gründe geben:\n\n- ein Freund, der noch im Low-Level-Bereich ist. Würde man hier mit einem hohem Ranking mit diesem spielen, bekäme er Gegner, gegen die er keine Chance hätte.\n- man möchte mit Freunden ranken, diese sind jedoch auf einer niedrigeren Elo - gerade aktuell durch den neuen Patch\n- man möchte eine neue Rolle üben, die man bisher kaum gespielt hat. Wenn man bisher in Normals oft seine Mainrolle gespielt hat, hat man hier auch eine hohe MMR. In dieser kann man aber ggf. auf einer neuen Rolle nicht bestehen.","replies":[{"poster":"JustLie","date":"2016-04-08T10:31:18.361+0000","up_votes":1,"down_votes":1,"body":"Dass man mit Freunde, die im Low-Elo-Bereich sind, gerne ranken möchte, kann ich verstehen. Letzten Endes leiden aber die Anfänger, die dann gegen einen Veteranen spielen müssen.\n\nAlso, um eine neue Rolle zu üben reichen doch die Normals? Zwar wird man wegen der MMR gegen gleichgestufte Spieler antreten, aber ich sehe da jetzt keinen trifftigen Grund dafür extra einen neuen Account zu erstellen. Auch wenn man anfangs nicht gut mit der Rolle klar kommt, i-wann hat man's raus. ^^","replies":[{"poster":"MeMyselfandBaal","date":"2018-10-31T07:14:36.222+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JustLie,realm=EUW,application-id=YnZkMR0R,discussion-id=Qi4GG297,comment-id=00000000,timestamp=2016-04-08T10:31:18.361+0000)\n> \n> Also, um eine neue Rolle zu üben reichen doch die Normals? Zwar wird man wegen der MMR gegen gleichgestufte Spieler antreten, aber ich sehe da jetzt keinen trifftigen Grund dafür extra einen neuen Account zu erstellen. Auch wenn man anfangs nicht gut mit der Rolle klar kommt, i-wann hat man's raus. ^^\n\nDas funktioniert halt nur bedingt, weil der Unterschied zwischen Platin Solo Que und Normal Draft zu gewaltig ist.\n\nAlso ich habe mir meinen Smurf damals (vor FlexQue als Pseudoranked und der Rollenauswahl) geholt, weil ich für mein Team eine absolute Last war, wenn ich mal nicht Support bekommen habe. Und das, obwohl ich vorher Gragas Top in der Normal Draft Que ausprobiert habe und das da sogar gut funktioniert hat. Dennoch wurde ich im Ranked immer böse verprügelt, wenn der Gegner mal wirklich am Tryharden war.\n\nMittlerweile kann man dann natürlich einfach in die ein wenig seriösere FlexQue gehen. Und spätestens wenn die nächstes Jahr wirklich für jede Rolle eine eigene MMR verteilen, auch wenn ich das noch nicht funktionieren sehe. Dann werde ich meinen Smurf wahrscheinlich wirklich nur noch nutzen, um mit meinem besten Freund Ranked zu spielen...","replies":[]},{"poster":"Awsane","date":"2016-04-08T11:15:25.846+0000","up_votes":1,"down_votes":0,"body":"aloha\n\nhmm ich bin nicht der Meinung, dass normal games zum üben reichen auf dem main\nwenn man wirklich eine rolle komplett neu üben möchte, die man vorher garnicht gespielt hat ist es viel effektiver am anfang auf einem smurf die zu üben als auf einem main, weil man mehr Spielraum für fehler hat und man nicht nach den ersten 5 Minuten wenn man gegen einen main gegner spielt total usless wird. \nAuf einem smurf sieht man meistens den ganzen teil vom game und was zur rolle gehört weil man mithalten kann und nicht nur das early laning sieht und wie man dann Schadensbegrenzung betreibt.\n\nZudem kommt der psychologische Effekt, das man wenn man etwas üben möchte mit gefolgserfühlen schneller vorankommt als wenn man sich dauerhaft besiegen lässt, da ist das hirn eine ganz komische Sache\n\naber um dich zu besänftigen ich selber smurfe nicht und smurfs werden sehr schnell vom System erkannt und die erreichen sehr schnell  die elo in die sie gehören. \n\nLG Awsane","replies":[{"poster":"JustLie","date":"2016-04-08T11:30:06.283+0000","up_votes":1,"down_votes":0,"body":"Super, einen sehr nachvollziehbaren Grund einen Smurf zu erstellen. Schön, dass du auch bei deinem Main bleibst. :)\n\nIch selbst kann die ADC-Rolle zum Verrecken nicht gut. ^^\nMan könne sich hier überlegen einen neuen Account zu erstellen, um die ADC-Rolle zu üben. Dadurch hat man evtl. die Chance auch gegen unerfahrene ADCs zu treffen, um so sich stetig zu steigern. Somit besteht auch eine höhere Wahrscheinlichkeit dem Hirn den positiven Erfolg abzuliefern. :D\n\nOder aber man bleibt bei seinem Main und versucht sich in die Rolle. Würde ich auch so machen. Ich kenne ja schon die ganzen \"Mäkäniks\" der ADCs und hätte somit ja auch schon wieder einen Vorteil gegenüber Anfänger. Auch andere Punkte, wie z.B. das Warden, das richtige Flashen und sonst die allgemeinen Spielzüge sind gegenüber Anfänger unfair. \n\nAlso, still the MAIN! \n\n{{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"Shiggyvara","date":"2016-04-08T10:43:00.567+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ceiwyn,realm=EUW,application-id=YnZkMR0R,discussion-id=Qi4GG297,comment-id=0000,timestamp=2016-04-08T09:51:18.610+0000)\n>\n> Da kann es einige Gründe geben:\n> \n> - ein Freund, der noch im Low-Level-Bereich ist. Würde man hier mit einem hohem Ranking mit diesem spielen, bekäme er Gegner, gegen die er keine Chance hätte.\n> - man möchte mit Freunden ranken, diese sind jedoch auf einer niedrigeren Elo - gerade aktuell durch den neuen Patch\n> - man möchte eine neue Rolle üben, die man bisher kaum gespielt hat. Wenn man bisher in Normals oft seine Mainrolle gespielt hat, hat man hier auch eine hohe MMR. In dieser kann man aber ggf. auf einer neuen Rolle nicht bestehen.\n\nAlso auf gut deutsch für deinen Punkt 1 und 2: Man möchte das Matchmakingsystem bescheißen.","replies":[{"poster":"SeaHorseCalamity","date":"2016-04-08T11:14:05.409+0000","up_votes":1,"down_votes":0,"body":"1. man möchte mit seinen freunden spielen, ohne ihnen den spielspaß zu nehmen\n2. man möchte mit freunden ranked spielen, wird aber durch rito fast unmöglich gemacht.\n\nsehe keinen bewussten betrugsversuch...","replies":[{"poster":"Shiggyvara","date":"2016-04-08T11:59:44.826+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bIoody Encore,realm=EUW,application-id=YnZkMR0R,discussion-id=Qi4GG297,comment-id=000000010000,timestamp=2016-04-08T11:14:05.409+0000)\n>\n> 1. man möchte mit seinen freunden spielen, ohne ihnen den spielspaß zu nehmen\n> 2. man möchte mit freunden ranked spielen, wird aber durch rito fast unmöglich gemacht.\n> \n> sehe keinen bewussten betrugsversuch...\n\nBei 1 geht es darum, dass selbst wenn ein gemeinsames Spielen möglich wäre würde der Smurf genutzt werden, da der Freund ja sonst \"unfair\" schwere Gegner vorgesetzt bekommt. \nAm Ende führt es nur dazu, dass anstatt des Freundes halt die Gegner unfair schwere Gegner vorgesetzt bekommen und im Endeffekt hat der Freund nicht mal was davon, da er zu Siegen gecarriet wird, die er in ausgeglichenen Teams vielleicht nie geschafft hätte -> Erhöhte Rate an verlorenen Spielen, wenn er dann doch mal allein spielen muss.\n\n2 ist quasi das gleiche in grün.","replies":[{"poster":"SeaHorseCalamity","date":"2016-04-08T12:07:19.772+0000","up_votes":1,"down_votes":0,"body":"wobei ich bei 1 stark bezweifle, dass irgendjemand tryharden würde....\n\nbei 2. kann man darüber streiten... es gibt ja immer leute, die das system austricksen wollen. die frage ist nur, zu welcher gruppe man selbst gehört.","replies":[]}]}]}]}]},{"poster":"xSmokeWeed","date":"2018-10-31T02:14:06.491+0000","up_votes":1,"down_votes":0,"body":"DIe smurfs in lol gehen mir schon eh am arsch vorbei riot ist nur da um geld einzunehmen aber low elo leuten helfen aus bronze oder silber ist schon läöcherlich die sitzen mit ihrn fetten ärschen eh nur da und unternehmen nicht und millionen spieler was riot hat das sind 500k nur smurfs!","replies":[]},{"poster":"Killerkante","date":"2016-04-08T14:43:04.925+0000","up_votes":1,"down_votes":0,"body":"Also hier Gründe wieso ich smurfe:\n\n-Ich hab keine Lust auf bestimmte Leute\n-Ich nehm die ranking Spiele auf die leichtere Schulter (ich spiel nicht weniger tryhard sondern ich Fiebere weniger bis garnicht mit, mir ists lediglich auch mal Piepschnurz wenn ich ne losestreak habe)\n-Übe Champs die ich in meinen Champion pool einbeziehen will\n-Ich hab schon alles freigeschaltet auf meinem Main und habe bis auf mit Skins zu spielen wenig Motivation weiter normal games dort zu spammen\n-Ranked warmup für MainAcc\n\n\nGut, du soltest vielleicht differenzieren dass du evtl über smurfer sprichst die sich als Anfänger anmelden und einfach nur Neulinge stompen, sind tatsächlich meist welche, die ihr ego aufbauen wollen weil sie auf ihren MainAcc keinen Erfolg haben. (is das selbe wie mit Leuten, die in normals ganz übel tryharden)\nIch bekomme nämlich höhere Gegner als auf meinem MainAccount bei meinem smurf. (in normals wohlgemerkt)\n\nIch kanns ehrlich gesagt nicht ganz nachvollziehen dass du dich darüber aufregst.\n\nIrgendwie gehe Ich davon aus dass du schon einige als smurfer betitelt hast die einfach nur ein gutes Spiel hatten.","replies":[{"poster":"JustLie","date":"2016-04-11T13:43:43.539+0000","up_votes":1,"down_votes":0,"body":"Ich rege mich nicht darüber auf. ^^\n\nFinde es halt zum Größtenteil überflüssig. Ich selbst erlebe es auch ehrlich gesagt nur selten, dass sich welche als Smurf betiteln oder ich es i-wie merke.\n\n_\"-Ich nehm die ranking Spiele auf die leichtere Schulter (ich spiel nicht weniger tryhard sondern ich Fiebere weniger bis garnicht mit, mir ists lediglich auch mal Piepschnurz wenn ich ne losestreak habe)\"_\n\nIst sicherlich ein angenehmes Gefühl nicht Tryharden zu müssen, aber ist es dennoch nicht blöd gegenüber deinen Mitspielern, die evtl. tryharden und sehr gerne aufsteigen wollen (besonders für die Leute, die in der Promo stecken)?. Bin der Meinung im Ranked sollte man schon alles geben, was man in den Normals gelernt hat. ^^","replies":[{"poster":"Killerkante","date":"2016-04-11T19:24:50.835+0000","up_votes":1,"down_votes":0,"body":"Lies den zitierten Satz bitte nochmal durch.","replies":[{"poster":"JustLie","date":"2016-04-12T19:31:44.992+0000","up_votes":1,"down_votes":0,"body":"Haha jo, mein Fehler. ^^\n\nIst dann natürlich ein psychologischer Aspekt. Man fiebert nicht mit, man bleibt locker, spielt trotzdem relativ gut und gewinnt evtl.  mehr Games, da man diesen Druck nicht hat. Denke aber der Druck steigt, sobald man in einer höheren bzw. gleichen Elo wie der Main ist.","replies":[]}]}]}]},{"poster":"Coinﬂip Jungler","date":"2016-04-08T16:21:13.120+0000","up_votes":1,"down_votes":0,"body":"Ich selbst habe 4 Accounts. Man smurft eben wenn man einen Champ testen will/ein Itembuilds oder einfach mal nicht Tryharden will und entspannt spielen will. Warum man dann keine Normals spielen? Ganz einfach - Normals machen keinen Spaß. Keiner Tryhardet da - im Normalfall - weil es nichtmal Punkte gibt. Es mag vielleicht Spieler geben, die League nur aus Spaß spielen und dann hauptsächlich mit ihren Freunden Normals spielen, aber dass reizt einfach nicht.","replies":[]},{"poster":"ZeeDrakon","date":"2016-04-08T15:19:30.798+0000","up_votes":1,"down_votes":0,"body":"zu sagen der erste punkt ist quatsch weils normal games gibt zeigt dass du (oder der den du zitierst) das problem eben nicht verstehen. wenn man platin oder diamond ist und freunde hat die bronze, silber oder nicht geranked aber genauso schlecht sind, helfen einem normals überhaupt nicht. da wird dann jedes game dadurch komplett unwitzig dass deine freunde von diamond spielern gestomped werden und sich (ja auch nicht ganz zu unrecht) beschweren dass sie nichts machen können, während man selber meistens auch gg jmd weitaus schlechteren spielt was wenig spaß macht und einem auch wenig bringt. also geht man auf nen smurf, trollt n bisschen rum aber die premade hat wenigstens spaß.\n\nzum zweiten punkt: ja, 10-20 minuten Queue times sind nervig, aber hauptsächlich smurfen viele um mit rollen oder champions die sie auf dem main nicht spielen in die selbe elo zu kommen. ich hab neben meinem main der (bevor ich räudig decayed bin) P1 war einen mid-only und einen nidalee-und-riven smurf mit denen ich auch platin/dia kommen will.\n\nich verstehe auch nicht so ganz wo das problem ist. alleine durch die anzahl der high elo spieler könnt ihr gar nicht auf soo viele smurfs treffen, und wenn, dann verliert man halt mal n game, lernt mehr wenn man aufpasst...","replies":[]},{"poster":"Revilous","date":"2016-04-08T13:50:50.425+0000","up_votes":1,"down_votes":0,"body":"Ich bin auf meinem Smurf ein dreckiger Riven Main :D Auf meinem Main habe ich noch kein einziges Riven Game diese Season. Naja aber der Smurf Acc ist auch schon Platin und war nie in Bronze. Keine Ahnung wie man in Bronze reinkommt ohne mit Absicht zu feeden und zu trollen und dafür wird man doch gebannt ?","replies":[]},{"poster":"MilliDieFrau","date":"2016-04-08T10:43:10.275+0000","up_votes":1,"down_votes":0,"body":"Ich bringe mal meine persönlichen zwei Gründe ein:\n\n- Auf diesem Account habe ich eine Zeit lang nur ARAM gespielt; als ich dann mal wieder in der Kluft vorbeigeschaut habe, habe ich tierisch auf die Schn**** gekriegt. Verunsichert habe ich weiter ARAM gespielt.. um danach noch mehr auf die Nase zu fallen. Die Mechanics waren einfach raus, Laning und farmen konnte ich überhaupt nicht, meine gematcheten Gegner aber schon (war ja dann auch irgendwann LvL 30). Deswegen habe ich einen zweiten Account erstellt, um nochmal \"von vorne\" anzufangen. Als ich mich dann sicherer gefühlt habe, habe ich den Account sein gelassen und wieder diesen hier genutzt.\n\n- Ich habe ein paar Freunde, die neu in League sind. Also ganz Anfänger. Ich nehme da lieber den kleinen Account damit die dann nicht Gegner auf meinem Level bekommen (wobei ich gehört hab, dass das System Smurfs erkennt und es im Endeffekt keinen Unterschied macht, aber ich bleib mal bei meiner Illusion).\n\nEine emotionale Bindung zu diesem Account besteht bei mir nicht, ich möchte damit nicht mein Ego pushen oder sonstewas :D\nDer eine Account reicht mir vollkommen, das ist der, wo Geld drinsteckt und mit dem ich spielen möchte.","replies":[{"poster":"JustLie","date":"2016-04-08T11:08:03.370+0000","up_votes":1,"down_votes":0,"body":"Deinen zweiten Punkt kann ich sehr gut nachvollziehen und ich selbst hatte gestern das gleiche Dilemma. :D\nLetzlich bin ich auf meinen Account geblieben, da er gegen bessere Spieler antreten wollte. ^^\n\nAlso, dass Smurfs nur negative Sachen beinhalten, stimmt in gewissen Punkten dann auch nicht. Ist wirklich schwierig. Um bei deinem zweiten Punkt zu bleiben:\n\nMan möchte, dass der/die gute Freund/in etwas lernt. Wenn man bei seinem Main-Account bleibt, kriegen die anderen einen auf die Mütze, da sie nicht gegen andere Anfänger spielen. Man möchte ja auch als Anfänger ein paar positive Erfolgserlebnisse erzielen. ^^","replies":[{"poster":"MilliDieFrau","date":"2016-04-08T12:22:26.315+0000","up_votes":1,"down_votes":0,"body":"Ich habs tatsächlich noch nicht gehört, dass das wer macht, um mal ein paar Kiddies runterzuputzen ^^ Ich glaub, das mit den Freunden ist tatsächlich der Hauptgrund (neben \"mein Account wurde gebannt, ich brauch nen neuen\").\n\nIch bin mit dem Smurf dann aber tatsächlich fast nur mit anderen Smurfs gematcht worden (nach einer Weile), deswegen weiß ich nicht, ob ich für den Fall nicht auch wieder einen neuen machen sollte...?\n\nUnd ja, League ist halt vorallem am Anfang kompliziert und aufwendig, wenn man dann nur gegen Experten spielt, hören die meisten auch schnell wieder auf :D und das will man ja als einsamer LoL-Suchti vermeiden ^^","replies":[]}]}]},{"poster":"Alustus","date":"2016-04-08T12:00:37.414+0000","up_votes":1,"down_votes":0,"body":"> diese Gruppe bringt die Argumente: in gold / diamant / platin dauert es vieeel zu lange bis mal ein Spiel startet und die Leute in Bronze können ja was von uns lernen\n> => natürlich können wir von euch lernen, aber wir können es auch lassen! Wenn ich lernen will kann ich mir eure livestreams bei twitch oder sonstwo angucken.\"\n\nGold Platin hat da weniger probleme.\nUnd ein Dia Smurf wird mich in Bronze starten und wenn doch ist er innerhalb von 20 SPielen raus wenn man bedenkt das ca. 1% der community dia ist sollte man als normaler spieler kaum etwas von diesen mitbekommen.\nEs gibt auch viele Bronze Smurf die denken wenn sie nur bessere Placements haben kommen sie aus der \"Elo Hell\" raus.\n\nUnd nicht zu vergessen gibt es noch einige Spieler die einfach sagen dass sie smurfen ohne das sie es wirklich tun.\nEin anderer großer teil sind Booster bzw. Accounts die gerade geboostet werden und da liegt der Grund im Finanz bereich.","replies":[{"poster":"JustLie","date":"2016-04-08T12:12:10.851+0000","up_votes":1,"down_votes":0,"body":"Sein Beitrag ist glaube ich ca. 1 Jahr alt. ^^\n\nMittlerweile sieht es natürlich schon anders aus. \n\nJa, stimmt. Kenne das auch, dass viele schon in der Championselect schreiben, wenn Sie nicht Ihre Rolle bekommen \"Let me mid, i am smurfing. Main Dia II\"...\n\nTja, das mit dem Boosten ist auch so ne Sache. Viele verdienen damit auch schon ne Menge Kohle nebenbei. Wird sich wohl auch nicht mehr vermeiden lassen.","replies":[]}]},{"poster":"top lane cringe","date":"2016-04-08T10:36:03.271+0000","up_votes":1,"down_votes":0,"body":"Mein main ist diamant V und mein Smurf gerade gold 3, letzte season war der nach glaub 20 games direkt plat 2 (weil alle 10 placements auch gewonnen) \nIch smurfe weil,\n- ich manchmal keine lust habe auf 5-10min queues da ich top und jungle auswähle und das gut mal dauern kann\n- ich schauen will ob ich es noch einmal in die elo schaffe\n- entspannt spielen will ab und zu","replies":[]},{"poster":"lnSêc","date":"2016-04-08T09:53:11.157+0000","up_votes":1,"down_votes":4,"body":"Eigentlich smurffe ich zb. um positionen die ich nicht gut genug für meine elo kann zu lernen(verbessern)\n\n- die Q ist erst ab hohem dia bereich zu lange. und solche leute triffst du nicht in bronze/silber. wenn ja dann sind die auch keine dia spieler oder carryn freunde.\n\n\nzum thema \"natürlich können wir von euch lernen, aber wir können es auch lassen\"\n\nkann ich auch sagen: \"natürlich kann ich auf meinem main spielen, aber ich kann es genauso gut lassen\"\n\n\naber keine sorge. in bronze sind nur maximal irgendwelche silber 5 smurffs. und da bronze - gold das selbe ist , hat das auch wenig mit smurffen zutun","replies":[{"poster":"Shadow l Eagle","date":"2016-04-08T09:59:30.932+0000","up_votes":1,"down_votes":1,"body":"Jetzt werden sowieso die meisten in der High-Elo dazu gezwungen runterzugehen daher die meisten ja mit Master, Diamond 1 usw zusammen spielen. Grade viele High Elos gibts da oben ja nun nicht, ist Platin / Gold momentan wohl besser wenn man in diesem jahr noch spielen möchte ^^","replies":[]}]}]}