{"poster":"deadlychuck","date":"2014-08-01T16:05:46.906+0000","title":"Quinn Range Being posted","subforum":"Gameplay","up_votes":6,"down_votes":2,"body":"I'm sure you at riot know this already, but quinn seems to have a bug with her E at the moment, where when she uses her E it will post in all chat the range at which she used it from. It's kinda annoying, nothing major or game changing, just annoying.","replies":[{"poster":"FeralPony","date":"2014-08-02T03:56:11.031+0000","up_votes":8,"down_votes":0,"body":"Thanks for the report! Looking into this now.","replies":[{"poster":"ShadowCleave212","date":"2014-08-02T11:33:31.862+0000","up_votes":1,"down_votes":0,"body":"Also noticed a mysterious similarity to this bug. However, I can't seem to replicate it, and it's only happened three times so far. Twice in a single game, and one time in a second game which I have posted in this thread: http://forums.na.leagueoflegends.com/board/showthread.php?p=48977362#post48977362","replies":[{"poster":"Nameless Voice","date":"2014-08-02T17:33:41.381+0000","up_votes":1,"down_votes":0,"body":"I saw this second bug in a game just now a well.  I didn't see what actually caused it, but the number \"3\" was printed to the chat log on its own.  I only noticed it once in the game.\n\nWe did have an Irelia on our team, though I wasn't playing her.  I think she was attacking the enemy inhibitor when it happened, but I was not nearby and she was not on my screen.\n\nFull champion roster for the game was (Katarina, Irelia, Hecarim, Thresh, Twitch) vs (Tristana, Vladimir, Elise, Teemo, Sona.)","replies":[]}]},{"poster":"Lasersniped","date":"2014-08-02T15:49:07.533+0000","up_votes":1,"down_votes":0,"body":"Bug is also occuring with Fiora.  Might be an issue with how their dashes are being handled.","replies":[]},{"poster":"Saint Tyrone ","date":"2014-08-02T04:00:57.271+0000","up_votes":1,"down_votes":6,"body":"Can you show us Sion's reworked kit right now?","replies":[]}]},{"poster":"El Dez","date":"2014-08-02T19:12:27.781+0000","up_votes":1,"down_votes":0,"body":"I also have had this issue in a game I just played with Maokai. It seemed to happen when I used Sapling Toss, the chat would say something liike \"DistanceB 123.45678\" or something similar.","replies":[]},{"poster":"Knight SoIaire ","date":"2014-08-01T17:20:47.059+0000","up_votes":1,"down_votes":1,"body":"noticed it yesterday \n\nbbut nobody cares abut buggs on this forum \ni already made a thread about master yi automaticaly spamming his taunts all game, and it got buried in an hour","replies":[]}]}