{"poster":"deadlychuck","date":"2017-04-09T21:21:35.202+0000","title":"Can we never release a Lee Sin skin again?","subforum":"Gameplay","up_votes":7,"down_votes":6,"body":"He already has a high enough play rate. The last thing that&#039;s needed is to have him in even more game than he already is. \r\n\r\nThe same applies to yasuo, please these champions with obscenely high play rates should be ban from getting skins.","replies":[{"poster":"redfeenix","date":"2017-04-09T21:43:59.999+0000","up_votes":1,"down_votes":0,"body":"They sell skins which they know for sure will have buyers. \n\nLee sin, yasuo , vayne skins etc, are GUARANTEED to be hugely popular and since these are the most popular champions, and their mains (and a lot of other players) will buy these skins right on the spot.\n\nFor riot its not enough to sell 10 skins etc. They have sales targets that are probably in the six figures. \n\nTHats why these champions get skins, and will continue getting more and more skins. It makes good money.... much better money than less popular champions. \n\nIts just common sense, if you sell a skin for a champion that MOST people play, you will sell more copies of that skin compared to a less popular champion.\n\n","replies":[{"poster":"deadlychuck","date":"2017-04-09T21:53:14.358+0000","up_votes":1,"down_votes":0,"body":"> And a skin's sales rate is less based on the number of people who play that particular champion than the appeal of the skin. Elemental lux sold a ton, but many of the people who bought it still hardly ever play her.\n\nMind you, people who play the champion regularly clearly have preference for the champion's mechanics more than the appearance of the champion. Where as you will see a popularity spike after a skin, as a result of people who care about the skins playing with their new skin more.","replies":[{"poster":"redfeenix","date":"2017-04-09T21:58:22.211+0000","up_votes":2,"down_votes":0,"body":"The champion in question is a huge part of the appeal of skins.\n\nImagine  they made a new project skin. \n\nWHich skin are YOU most likely to buy? Project VI or Project Thresh. \n\nThe answer depends on which champion you like more. So while the appeal of the skin and how cool/epic it is a huge factor, the identity of the champion involved is the biggest factor of all.\n\nLux is also one of the most popular / iconic champions in League. Thats why the skin sold so well.\nI doubt Elementalist skarner would have done half as well.","replies":[{"poster":"Limmie","date":"2017-04-10T01:59:08.116+0000","up_votes":1,"down_votes":0,"body":"Yeah, you're right. But I hate that you are right because that kind of thinking kept Urgod from getting his well deserved and long waited Star Guardian skin.","replies":[]}]},{"poster":"Chønklord","date":"2017-04-10T02:09:07.374+0000","up_votes":1,"down_votes":0,"body":"I bought god fist lee sin _because of the GOD(damn) amazing skin_, not because I liked the champion. I mean, who doesn't want to play a monk-turned-god whose taunts are eloquent shit talking lines, glows gold, and IS A FUCKING GOD?\n\nMe please.\n\nLearned how to play Lee Sin just for this skin.","replies":[]}]}]},{"poster":"ScissorsNstuff","date":"2017-04-09T21:24:51.348+0000","up_votes":3,"down_votes":2,"body":"could you stop making the same mistake people have been making for years and just not whine about what you don't want?\n\nLee sin players want skins and they are spending money to prove it.\n\nYou? You're just some whiney... whatever a chuck is. And you want nothing and you have no money to give apparently. What else should be made? Look at you here talking about lee sin, clearly it is very attention grabbing. Your salt makes it worth it for lee sin players.","replies":[{"poster":"deadlychuck","date":"2017-04-09T21:40:21.342+0000","up_votes":2,"down_votes":0,"body":"What are you even on about?\n\n> Lee sin players want skins and they are spending money to prove it.\n\nthis statement is applicable to literally every champion. \nAnd a skin's sales rate is less based on the number of people who play that particular champion than the appeal of the skin. Elemental lux sold a ton, but many of the people who bought it still hardly ever play her.\n\nI really don't care if the champions become played more, the problem comes for the fact that they've existed as cancer in the game for a long time, but while the balance and design teams refuse to touch them, the art team will release skins which make their poor design all the more common, as if it wasn't common enough already.\n\nOver the past week\n\n{{champion:64}} 40.54%\n\n{{champion:157}}  34.74%","replies":[{"poster":"Yaśuo Main","date":"2017-04-09T22:22:35.999+0000","up_votes":1,"down_votes":0,"body":"Over the past week\n\n{{champion:64}}  40.54%\n\n {{champion:157}} 34.74%\n\n\n\n^ Is that play rate? \n\nAnd if we did take your logic into account, Yasuo would have not have only 3 skins. It's actually under whelming since his play rate once spiked up to 50%.","replies":[{"poster":"deadlychuck","date":"2017-04-10T00:59:07.053+0000","up_votes":1,"down_votes":0,"body":"What are you talking about? I said that the champions get a spike in play rate when a skin is released for them. The only point i'm really making is that this also applies to the most played champions. \n\nThis doesn't imply that high play rates have a lot of skins. \n\nIf you compare the play rate for the month to the past week, lee sin has gone from 31.21% up to 40.54%. Now mind you that 31.21% is actually inflated from the 40% spike from the past week being factored into the calculation.","replies":[]}]}]}]},{"poster":"Glîtchy","date":"2017-04-09T21:43:37.141+0000","up_votes":1,"down_votes":0,"body":"https://img.memesuper.com/7771fdb7f89b9f8eab2a309c417cf047_preach-meme-memesuper-preach-brotha-meme_450-313.jpeg","replies":[]},{"poster":"OverpoweredSoap","date":"2017-04-09T21:24:03.631+0000","up_votes":1,"down_votes":0,"body":"More people playing that champion means more people buying the skins tho","replies":[]},{"poster":"Tormentula","date":"2017-04-09T21:22:58.550+0000","up_votes":1,"down_votes":0,"body":"Lmao and yasuo is getting another skin soon too.","replies":[]}]}