{"poster":"Sebasaurio REX","date":"2019-09-05T04:41:42.255+0000","title":"emparejen con gente decente porfa","subforum":"Off-topic y temas personales","up_votes":11,"down_votes":1,"body":"primera partida una riven, voy a salir 2/20 no se quejen ya avise mute hall, segunda partida, un darius yo soy tanke asi que me tiro solo contra 5, si muero total les hago gastar os recurso y voy a probar como me va con fantasmal{{sticker:zombie-brand-facepalm}} \r\n\r\nporfa, en serio ya aburre esta bien tener una mala partida, se intento, pero que te emparejen desde que llegaste a oro con esta pila de ... porfa paren el leseo ya aburre.\r\nllego a 80 pl y se repite los mismos tipos 20 pl, vuelvo a 80 otra vez los mismos, parece que si uno no juega con duo, rito automáticamente te empareja con gente que ... nada que decir después se quejan si uno dice algo.\r\nParece que para subir ahora es obligación tener un duo con el cual al menos intentar salvar dos lineas, y jugar en serio.","replies":[{"poster":"Te voy a Trolear","date":"2019-09-05T05:46:22.603+0000","up_votes":8,"down_votes":0,"body":"emparejar?\nSolo ponen a 10 jugadores aleatorios con diferencia de 1 liga, en una partida random en la que gana el que tiene menos trolls o el que tiene algo parecido a un equipo.","replies":[{"poster":"Teniente Wea","date":"2019-09-05T13:38:23.304+0000","up_votes":1,"down_votes":0,"body":"¿Entonces los smurf como hacen? Nosotros no subimos por malos o porque no nos da todavía para carrear como hacen ellos, pero echarle la culpa a los trolls y todo eso... No sé","replies":[{"poster":"WhiteMax","date":"2019-09-05T14:12:51.733+0000","up_votes":1,"down_votes":0,"body":"Juegan en premade y/o van hipercarrys que no necesitan team, y como son ligas bajas lo mas probable es que el team contrario no sepa como ganarles (la tipica del smurf en mid y el jg rival no gankea nunca mid dejando que se fedee).","replies":[{"poster":"Teniente Wea","date":"2019-09-05T14:40:50.630+0000","up_votes":1,"down_votes":0,"body":"No necesariamente, te pongo de ejemplo a TF Blade que subió en Turquía jugando cosas como Corki , Teemo, Vayne, todo en top ¿te parece Teemo un hypercarry? Además subió jugando **solo**  y sin ningún dúo.","replies":[{"poster":"Te voy a Trolear","date":"2019-09-06T12:57:46.997+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Teniente Wea,realm=LAS,application-id=J8qpiO2I,discussion-id=lRjbB0Gd,comment-id=0001000000000000,timestamp=2019-09-05T14:40:50.630+0000)\n>\n> No necesariamente, te pongo de ejemplo a TF Blade que subió en Turquía jugando cosas como Corki , Teemo, Vayne, todo en top ¿te parece Teemo un hypercarry? Además subió jugando **solo**  y sin ningún dúo.\n\nes una excepción de la mayoria.","replies":[]},{"poster":"WhiteMax","date":"2019-09-06T00:15:41.328+0000","up_votes":1,"down_votes":0,"body":"Me hablas de Turquia pero esto es Las, so...","replies":[]},{"poster":"ALLMUTEFULL","date":"2019-09-05T23:20:14.401+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Teniente Wea,realm=LAS,application-id=J8qpiO2I,discussion-id=lRjbB0Gd,comment-id=0001000000000000,timestamp=2019-09-05T14:40:50.630+0000)\n>\n> No necesariamente, te pongo de ejemplo a TF Blade que subió en Turquía jugando cosas como Corki , Teemo, Vayne, todo en top ¿te parece Teemo un hypercarry? Además subió jugando **solo**  y sin ningún dúo.\n\nman el nivel en Turquía es mas bajo que en las. te lo digo yo que jugué 10 años ahí.\npd: teemo si es un hypercarry.","replies":[]},{"poster":"DoteroProdigio","date":"2019-09-05T20:07:00.982+0000","up_votes":1,"down_votes":0,"body":"La diferencia de conocimiento de macro y micro juego así como experiencia entre un challenger y una dividision como diamante e inferiores es bastante grande. Siempre van a estar en el top de farmeo y juntamente a su ventaja mecánica hacen que puedan terminar la partida solos, solo pierden bajo condiciones excepcionales como jugar con support o que sus aliados fedeen excesivamente.","replies":[]},{"poster":"Flánn","date":"2019-09-05T17:35:07.570+0000","up_votes":1,"down_votes":0,"body":"pero tf blade es challenger y ademas top 1, peor ejemplo no había creo jaja","replies":[]}]}]}]}]},{"poster":"ChronoGrandpa","date":"2019-09-05T06:15:27.099+0000","up_votes":8,"down_votes":1,"body":"Lo voy a sostener siempre:\nCuando dejen de comprar RP a modo de huelga a nivel servidor al menos (cosa que nunca va a pasar), en serio se van a \"interesar\" en el estado del servidor y de la comunidad.\n\nPero como nunca va a pasar esto, nunca se van a interesar en esas cosas :/","replies":[{"poster":"TF Blade fangirl","date":"2019-09-05T11:14:34.660+0000","up_votes":3,"down_votes":0,"body":"Amigo, si eso llegara a pasar, unifican todo latam y BR en un solo server.\nLAS y LAN no le significan ganancias a riot, es mas, le significamos perdidas, por algo se juntaron las ligas, reduciendo prácticamente a la mitad los empleados de la parte de esports.","replies":[]}]},{"poster":"CryForMee","date":"2019-09-05T17:30:19.229+0000","up_votes":1,"down_votes":0,"body":"Yo lo único que quiero es que bajen el precio de los RP así me voy a la bosta de este servidor lleno de gente así y que la verdad nadie hace nada aca, incluso el foro está abandonado... Prefiero irme a otro av y jugar con lag que seguir acá, pero ni en p2 pago 1500$ para transferirme... Wp riot de mierda","replies":[]}]}