{"poster":"alojen","date":"2017-02-02T21:51:24.934+0000","title":"Fui permabaneado","subforum":"Problemas Técnicos","up_votes":48,"down_votes":8,"body":"Buenas tardes me presento mi nombre es Facundo, bueno tuve un incoveniente con la cuenta, les paso a comentar que sucedio, resulta que hace aproximadamente 4 a&ntilde;os empece a jugar lol, un amigo me regala su cuenta que era lvl 10, inclusive hicimos cambio de mail y todo. A esta cuenta la tengo desde 2013 finales creo, hasta la semana pasada que me fui baneado permanentemente por que me dijieron que la cuenta no era mia, bien, si bien los terminos de uso de juego dice que :\r\n&quot;D. Venta de la Cuenta. La Cuenta facilitada es personal. Riot Games proh&iacute;be expresamente la transferencia de Cuentas de usuario, no reconociendo su validez. El Usuario no comprar&aacute;, vender&aacute;, regalar&aacute; o realizar&aacute; transacciones con ninguna Cuenta ni har&aacute; ofertas dirigidas a este fin, cualquier tentativa de hacerlo ser&aacute; nula e inv&aacute;lida. La distribuci&oacute;n del Usuario de su cuenta y/o de sus Credenciales de inicio de sesi&oacute;n (excepto en lo se prevea expresamente en este acuerdo o en lo que Riot Games apruebe de forma expresa) ser&aacute; causa de suspensi&oacute;n o cancelaci&oacute;n de su Cuenta.&quot;\r\nEso lo entiendo, pero la verdad  si eso se cumpliera yo creo que me tuve que haber ido baneado en 2013, NO AHORA, ya que a esta cuenta le inverti mucho tiempo y dinero (255 skins, todos los champs, todas las runas, 20 paginas de runas) quisiera saber por que el ban es ahora?  Y NO EN 2013 que fue cuando adquiri la cuenta, por favor si algun rioter me pudiera ayudar o dar una respuesta y no un copypaste, se los agradeceria, muchas gracias por leer!","replies":[{"poster":"Excalibeer","date":"2017-02-02T22:51:18.740+0000","up_votes":31,"down_votes":4,"body":"Gracias por traer el caso.  \nDe momento no te puedo dar una respuesta sin hablar con el que realizó la investigación, pero sí te puedo decir que al violar los términos de uso estás ya bajo una situación delicada.  \nEsto no significa que suspendemos a TODOS los que comparten cuentas, pero al compartir cuentas puede ocurrir una suspensión cuando hay una disputa, cuando vemos que tienes sesiones en común con un flamer o troll serial, cuando vemos scripting o eloboost, etc.  \n\nUn ejemplo es scripting.  De momento estamos suspendiendo todas las semanas por uso de programas no autorizados.  Si la persona hace un reclamo revisamos bien las causas.  Sin embargo si la cuenta es compartida no revisamos nada, pues no sabemos si estamos hablando con el propietario de la cuenta, el scripter o cualquier otra persona.  Simplemente le decimos que se la banque y mala suerte.  \n\nTu caso es un poco distinto, así que te pido paciencia a ver si en el ticket te respondemos con más info, te parece?\nPondré esta misma respuesta en el ticket.\n\n-Excalibeer","replies":[{"poster":"Khada J","date":"2017-02-03T02:08:34.109+0000","up_votes":53,"down_votes":2,"body":"Devuelvanle la cuenta, el no la parió, pero la crió como si fuese su propia hijo :(","replies":[{"poster":"TheFalc","date":"2017-02-03T02:29:55.341+0000","up_votes":4,"down_votes":0,"body":"hay una decir judio que es: padre no es el que engendra sino el que cria","replies":[{"poster":"Turing Test","date":"2017-02-03T02:55:08.338+0000","up_votes":15,"down_votes":2,"body":"***","replies":[{"poster":"TheFalc","date":"2017-02-03T04:12:41.802+0000","up_votes":2,"down_votes":1,"body":"intente contener la risa porque con hitler no se rie\n\npero no pude xD","replies":[]}]},{"poster":"Conejito Fufu","date":"2017-02-03T15:51:32.767+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TheFalc,realm=LAS,application-id=X54mVVp0,discussion-id=6fmpNkYV,comment-id=000900000000,timestamp=2017-02-03T02:29:55.341+0000)\n>\n> hay una decir judio que es: padre no es el que engendra sino el que cria\n\nMe hiciste reir JAJAJAJAJA.\n\nIgual posta, si es como dice el chabon lo veo muy extricto, ojala la desbaneen.","replies":[]}]},{"poster":"Excalibeer","date":"2017-02-03T19:23:57.403+0000","up_votes":1,"down_votes":0,"body":"Solté una lagrimita...","replies":[{"poster":"Yitán","date":"2017-02-04T00:11:46.126+0000","up_votes":1,"down_votes":1,"body":"era necesario borrar el comentario con la foto de hitler riendose?\nse que quizas no lo hiciste vos, peeeero, nose, viendo que la mayoria de por aca son taringueros y eso, por que no hacer un foro a parte donde se pueda ser un poco mas \"tolerante\" con los comentarios, por lo menos +16 y no +12 como son ahora\n.\n.\n.\nPD: piensan dar la opcion de desactivar el filtro de palabras? me resulta MUY molesto","replies":[{"poster":"Excalibeer","date":"2017-02-04T03:36:14.569+0000","up_votes":2,"down_votes":0,"body":"Si la reportan, no aporta mucho y es controversial, se borra.  \n\nEstoy de acuerdo contigo, pero tenemos que dejar que la comunidad madure un poquito tambien, no?\n\n-Excalibeer","replies":[]}]}]}]}]},{"poster":"Excalibeer","date":"2017-02-03T20:02:54.565+0000","up_votes":21,"down_votes":1,"body":"Ahora tengo la respuesta.  Esta vez la cuenta la tendrás de vuelta, pero es importante que todos entiendan lo siguiente:\n\n- compartir y traspasar cuentas viola los términos de uso\n- la cuenta pertenece al creador.  si estas usando una cuenta y no eres el creador, tu situación está sumamente comprometida y puedes perder la cuenta en cualquier momento \n- no suspendemos inmediatamente por el sólo hecho compartir cuentas POR AHORA, esto puede cambiar y pueden tomar esto como un anuncio que se está estudiando una iniciativa al respecto\n- en este caso en particular la información que nos das no es exactamente precisa, pero quedaste en un área gris y decidimos darte el beneficio de la duda\n- esto no significa que desbanearemos más cuentas en situación similar, en casi todos los casos cuando una cuenta tiene más de un jugador y frente a la mínima disputa, esta cuenta queda suspendida permanentemente\n- quedas suspendido dos semanas por motivos detallados en el ticket\n- si no cuidas esta cuenta, la puedes perder definitivamente: NO compartirla y mantén un comportamiento bueno, sugiero un cambio de contraseña\n\nOjalá estés satisfecho con la medida, y a los demás lectores, ni por un segundo piensen que esto es condonar el traspaso, préstamos o venta de cuentas...recuerden que la mayoría de la toxicidad (flameo troleo) y problemas en el emparejamiento que experimenta LAS es debido al excesivo hábito de compartir cuentas.  \n\n-Excalibeer","replies":[{"poster":"198","date":"2017-02-04T06:24:50.225+0000","up_votes":2,"down_votes":5,"body":"\"recuerden que la mayoría de la toxicidad (flameo troleo) y problemas en el emparejamiento que experimenta LAS es debido al excesivo hábito de compartir cuentas\"\ncon todo respeto decir que el problema del troleo y toxicidad en las es por el prestamo de cuenta, es como que me tomes el pelo seamos sinceros el problema de toxicidad y troleo en las es por la falta de mantenimiento dentro del server, hablo de la falta de penalizaciones en vez de estar tanto tiempo en el foro los rioteros baneando personas por simples comentarios porque no trabajan con la gente que se come millones de reportes y no les pasa nada.\nNo me podes decir que se banea gente, cuando todos los dias vemos practicamente en el 90% de las partidas gente asi no por algo se dice que es la peor comunidad, la realidad es que el sistema de penalizaciones es pesimo y ustedes mucha importancia no le dan. es sensillo la gente trolea y es toxica porque sabe que no les va a pasar nada, si las penalizaciones fueran mas rigurosas, mas constantes la gente lo dejaria de hacer.\nAhora el tema del emparejamiento tambien, en serio ? eso es un problema de su sistema no del prestamo de cuenta, decime como una partida competitiva puede tener un retadores y platinos en una misma partida, eso es su sistema que esta mal que tiene que ver el prestamo de cuenta es totalmente ilogico.\nY otro tema que no se desvia mucho, hay dos post con mas de 1k de positivos sobre el tema de transpaso de cuentas mucha gente no quiere jugar en este servidor porque la comunidad es mala y porque los rioteros no les interesa mejorarla, estan mas pendiente de los comentarios en el foro que en mejorar el servidor, entonces porque no dan respuesta sobre eso ? no estoy agusto en este servidor, porque tengo que pagar para cambiarme de servidor? porque tengo que dejar plata en un server que tiene uno de los peores mantenimientos de todos? \n\nSeguro me van a eliminar el comentario porque siempre hacen eso, es su prioridad no ? eliminar comentarios y si me responden dudo que sea una respuesta directa, excusando todo lo antes dicho llega a ser asi y la verdad tristeza de que se crean sus propias mentiras sobre que estan haciendo algo para mejorar el server.","replies":[{"poster":"GatóMonstruo","date":"2017-02-04T10:38:01.115+0000","up_votes":3,"down_votes":2,"body":"Estaba por ignorar tu mensaje, pero, realmente me molestaron algunos puntos donde aplicás el \"hablamos sin saber\" al 95%\n\n---\n>\"recuerden que la mayoría de la toxicidad (flameo troleo) y problemas en el emparejamiento que experimenta LAS es debido al excesivo hábito de compartir cuentas\"\ncon todo respeto decir que el problema del troleo y toxicidad en las es por el prestamo de cuenta, es como que me tomes el pelo seamos sinceros el problema de toxicidad y troleo en las \n\nCreo sinceramente que Excalibeer se expresó de mala manera en ese punto, a lo que hace referencia es que en las cuentas compartidas se nota un nivel mayor de comportamientos negativos. Y, en LAS, las cuentas compartidas son moneda corriente. Lo que ha querido decir es que si, en efecto, hay flammeo y actitudes tóxicas, pero, en las personas que comparten cuenta son más propensas a estos comportamientos.\n\n>es por la falta de mantenimiento dentro del server, hablo de la falta de penalizaciones en vez de estar tanto tiempo en el foro los rioteros baneando personas por simples comentarios porque no trabajan con la gente que se come millones de reportes y no les pasa nada.\n\nDe nuevo, estás caminando fuera de la ruta. Te explico. Primero, respecto a la división de tareas dentro de Riot:  Hay diferentes sectores, como en toda gran empresa, y cada uno se ocupad de un labor particular. En este caso, Excalibeer, es el Manager de Player Support para LAS. Es decir, si el servidor se cae, no es su culpa ni su responsabilidad. Si, claro, al pertencer a Player Support es quien se comerá siempre las pedradas, pues, su labor es esa, atender al jugador.  Entonces, mantener el servidor =/ toxicos. No tiene nada que ver una cosa con la otra ¿Me explico?\nLuego, hablas de \"rioters en el foro baneando personas\". Ha decir verdad, quienes aplican las sanciones en el foro son los moderadores y no los Rioters, los rioters pueden banear pero no es su labor. Los moderadores son empleados que trabajan únicamente para moderar el foro y su responsabilidad es mantener el foro en orden. Si has tenido algún inconveniente tendrías que contactar a algún mod :)\n\n>No me podes decir que se banea gente, cuando todos los dias vemos practicamente en el 90% de las partidas gente asi no por algo se dice que es la peor comunidad,\n\nAhí vamos en dos partes. De hecho, si, te lo puede decir, porque es así. Pero, suspender una cuenta no es la solución al problema del comportamiento negativo en LAS. Diario se suspenden cuentas por un millón y medio de razones diferentes. En segundo lugar, que afirmes que en el 90% de las partidas hay jugadores tóxicos me parece un poco exagerado. Juego absolutamente TODOS los días a League, sin embargo,  son muy pocas las ocasiones donde me encuentro con gente realmente tóxica.\n\n> la realidad es que el sistema de penalizaciones es pesimo y ustedes mucha importancia no le dan. es sensillo la gente trolea y es toxica porque sabe que no les va a pasar nada,\n\nTrollea 10 partidas y veamos cómo te va :) Las sanciones SI funcionan y el sistema también, quienes NO funcionan correctamente son los usuarios.  Muchísimos usuarios alegan reportar en cada oportunidad que se les presente, sin embargo, la gran mayoría, lo hace de mala manera. Se ha explicado un millón de veces en el foro que un report _es invalidado cuando se lo hace de manera incorrecta_ ¿qué quiero decir con esto? Que NO debes reportar a un jugador por _Abandono de Partida_ siendo que en partida insultó a todo el mundo. Si lo haces de esta manera, el reporte pasará por alto. \nSecreto: Ese conocido tip de \"reportar por tres cosas siempre\" es mentira, sólo invalida tu reporte :) \n\n>Y otro tema que no se desvia mucho, hay dos post con mas de 1k de positivos sobre el tema de transpaso de cuentas mucha gente no quiere jugar en este servidor\n\nEse tema que mencionás es de hace más de un año, cuando, por aquellos días, los Argentinos tuvimos muchísimos problemas con el servidor.   La gran mayoría de los jugadores nos encontramos un día con más de 200ms en una partida y estuvo así durante 2 semanas. Fue tal el enojo que tuvimos por aquellos días. \n\nEntiendo que estás enojado, pero creo que no te tomaste ni dos segundos para pensar lo que escribías, ni siquiera te has tomado la molestia de revisar el foro para encontrar información sobre TODOS los puntos que mencionás.","replies":[{"poster":"Desaroll","date":"2017-02-04T14:03:29.843+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=GatoMonstruo,realm=LAS,application-id=X54mVVp0,discussion-id=6fmpNkYV,comment-id=001d00030000,timestamp=2017-02-04T10:38:01.115+0000)\n>\n> Trollea 10 partidas y veamos cómo te va :)\n\nSi me lo encuentro trolleando lo reporto a él y a tí. :V","replies":[]},{"poster":"Excalibeer","date":"2017-02-05T01:25:20.593+0000","up_votes":2,"down_votes":0,"body":"Mi comentario sobre el compartir cuentas es un poco más profundo que el \"soy tóxico porque no es mi cuenta\".  \n\nAl pasar tu cuenta a otra persona, el sistema lo emparejará con personas que deberían estar jugando contigo.  Se rompe el caro y sofisticado sistema de emparejamiento.  \nEl resultado normalmente es que fedee o carree, ocasionando una mala experiencia para sus compañeros o adversarios.  Eso da una sensación de injusticia.  \nEl principal valor de un jugador competitivo en equipo es el espíritu deportivo: \"vamos compañeros, hagamos las cosas bien y tratemos de ganar, ánimo!!\".  \nLos dos enemigos del espíritu deportivo son el estrés y la injusticia.  Sobre el estrés, uno debe crear resiliencia, en el fondo si el equipo enemigo te gana, o cometiste un error, o un compañero lo hizo, bancársela.  Esto es trabajo de cada uno.  \nPero la sensación de injusticia es algo que destruye el espíritu competitivo, y ahí aflora la toxicidad más fuerte que nunca.  \nImagina un árbitro que sólo da los goles a U de Chile y cobra fouls en contra de Boca Juniors...la hinchada, jugadores y hasta la policía terminará con lesionados graves en cantidades.  \nUn tipo fedea (ya sea porque es más malo que el que leveleó la cuenta, o está en un carril contra alguien mucho mejor que el que leveleó la contraria) y lo flamean, y parte el círculo vicioso: flameo porque trolean, troelo porque flamean, comunidad de la \"·$%\"·$, riot de ·\"$%\"·$% y blablabalh.  \n\nPodemos banear como locos (y hay días que permabaneamos a cientos), pero es como lanzar agua a las llamas y no al combustible.  \nCuando pasas tu contraseña a otro, estás destruyendo la comunidad.  \n\nEsto lo digo después de ver decenas de reportes, reclamos y registros al día durante y amás de un año...\n\n-Excalibeer","replies":[]}]}]},{"poster":"Doctor Jasfold","date":"2017-02-04T10:21:33.458+0000","up_votes":2,"down_votes":1,"body":"leyendo esto me entro una duda.\nque sucedería si una persona,crea su cuenta y solo el la usa, pero, esta persona tiene doble personalidad . Es la misma persona que reacciona de dos formas completamente distintas a la misma situacion (tengo un conocido con doble personalidad )\neste tambien seria baneado si jugara lol?{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Excalibeer","date":"2017-02-05T01:27:33.240+0000","up_votes":2,"down_votes":0,"body":"Depende.  Si los efectos de esta doble personalidad arruinan la partida a los demás, merece castigo.  \n\nIgual es difícil que una persona tenga una personalidad con un CS de 170 y kda de 10/3/5 y su alter ego consistentemente la mitad, no?  \n\n-Excalibeer","replies":[]}]},{"poster":"Shyphoniths","date":"2017-02-04T00:32:00.742+0000","up_votes":2,"down_votes":1,"body":"Por qué le devolvieron la cuenta? si confesó que no es suya originalmente osea wtf","replies":[{"poster":"Excalibeer","date":"2017-02-04T03:34:58.506+0000","up_votes":3,"down_votes":1,"body":"Simplemente traspasar una cuenta no es motivo de permaban.  \nPero si pasa CUALQUIER controversia sobre la cuenta, lo más probable es que termina permabaneada.  \nEn este caso no había mucha controversia, y banear esta implicaba banear 13 mil cuentas más.  \n\nHay varios que queremos hacer esto, pero no es el momento.\n\nNo - compartan - cuentas.\n\n-Excalibeer","replies":[]}]},{"poster":"Yitán","date":"2017-02-04T00:13:42.862+0000","up_votes":2,"down_votes":1,"body":"PREGUNTA: el tema de compartir cuentas, que parece ser \"legal\" por ahora, lo es solo para normales, verdad?\ndigo, no me copa que rankeen con cuenta prestada...","replies":[{"poster":"Excalibeer","date":"2017-02-04T03:33:22.430+0000","up_votes":2,"down_votes":1,"body":"No es legal, como dice Gatomonstruo que a estas alturas lo explica mil veces mejor que yo XD","replies":[]},{"poster":"GatóMonstruo","date":"2017-02-04T02:27:20.220+0000","up_votes":2,"down_votes":1,"body":"Hola Yitán.\n\nNo, realmente NO es legal compartir la cuenta. De hecho, los  términos y condiciones así lo dicen. Sin embargo, hoy en día, no se están aplicando sanciones por hacerlo. ¿Se entiende el punto? \nPuede que, a partir de mañana, se comiencen a analizar y aplicar sanciones permanentes a todas aquellas cuentas compartidas, o puede que no. \nHoy en día se castiga fuertemente el eloboost, que, si lo vemos a medias, también es un uso compartido de cuenta. Por lo que sé, no se conocen sanciones cuya única razón sea el prestar la cuenta.","replies":[]}]},{"poster":"amaro532","date":"2017-02-04T04:49:42.184+0000","up_votes":1,"down_votes":0,"body":"Tendría que haber una forma legal de vender una cuenta, yo me aburrí del juego y tengo plata invertida, en CS:GO si me pasa eso agarro y tradeo o vendo todas las skins. Entiendo que los términos hablen de que las cuentas son de Riot, pero igualmente hay todo un mercado negro de cuentas a causa de esto.","replies":[]}]},{"poster":"NynMentioN","date":"2017-02-02T22:01:28.742+0000","up_votes":5,"down_votes":37,"body":"Exactamente, mínimo te tienen que dar una prueba de como ellos se enteraron de que la cuenta no es tuya. Tienen que tener un poco de tacto con la gente que juega a este juego, no dar mas explicaciones es una falta de respeto y muestra mucho como tratan a la comunidad en este juego.\nSi ellos esperaron 4 años para hacer valer sus \"REGLAS\", que las usan cuando les conviene y cuando no se hacen los que no ven nada, es mas un error de ellos que tuyo.\nSeguí reclamando para saber cual es el motivo por el cual ellos creen que vos no sos el dueño original de la cuenta hasta que te lo indiquen, por que si no es tu palabra contra la de ellos. \n\nNo a los ban injustificados, menos contra la gente que hace que la comunidad sea mas agradable.\n\nTERRIBLE ERROR POR RIOT.\n\nTOTALMENTE INJUSTIFICADO.","replies":[{"poster":"Excalibeer","date":"2017-02-02T22:53:38.532+0000","up_votes":32,"down_votes":3,"body":"...","replies":[]},{"poster":"Locked ULIvE","date":"2017-02-02T23:42:00.941+0000","up_votes":4,"down_votes":8,"body":"el bann es justificado, el meollo es por que no fue el bann el 2013 pero si el 2017 cuantos años son ? son casi 4 años.","replies":[{"poster":"Akalimaster","date":"2017-02-02T23:47:36.616+0000","up_votes":12,"down_votes":3,"body":"> [{quoted}](name=Locked ULIvE,realm=LAS,application-id=X54mVVp0,discussion-id=6fmpNkYV,comment-id=00010002,timestamp=2017-02-02T23:42:00.941+0000)\n>\n> el bann es justificado, el meollo es por que no fue el bann el 2013 pero si el 2017 cuantos años son ? son casi 4 años.\n\nEs que si lo pensas es una estafa porque en esos 4 años la persona habra gastado muchisimo dinero y tiempo en la cuenta para que se la baneen sin previo aviso, Es lo mismo que yo te regalo un auto en malas condiciones y en 4 años cuando este mejor y reparado te denuncie y te lo saque {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Desaroll","date":"2017-02-03T00:07:16.711+0000","up_votes":7,"down_votes":27,"body":"Mhhh...\n\nÉl eligió invertir en una cuenta que le podían sacar en cualquier momento, nadie lo obligó. Hasta podía hacerse una cuenta nueva sin problemas en cualquier momento.\n\nSi en ese país hay una ley que prohíbe que se regalen autos, es tu culpa por haberlo aceptado y encima luego invertido plata en él.\n\nNadie te obligó a aceptarlo ni a invertir allí.\n\nSuerte!","replies":[{"poster":"Una Nutrinha","date":"2017-02-03T00:27:24.862+0000","up_votes":8,"down_votes":2,"body":"Me parece muy jodida esa cosa, ni que fuera como los que venden una cuenta lv 30 con todos los champs o cosas así, o sea le regalo una cuenta lv 10 en 2013 que no tenía nada\nUn poco absurdo es, no digan que no","replies":[{"poster":"Búbaloo","date":"2017-02-03T00:36:35.002+0000","up_votes":12,"down_votes":1,"body":"> [{quoted}](name=xDeadxDeadx,realm=LAS,application-id=X54mVVp0,discussion-id=6fmpNkYV,comment-id=00010002000000010000,timestamp=2017-02-03T00:27:24.862+0000)\n>\n> Me parece muy jodida esa cosa, ni que fuera como los que venden una cuenta lv 30 con todos los champs o cosas así, o sea le regalo una cuenta lv 10 en 2013 que no tenía nada\n> Un poco absurdo es, no digan que no\n\ntotalmente de acuerdo, para mi deberían revertir el BANEO, es un caso especial, por lo que de riot deberían ver el asunto.. Ademas ni siquiera compro la cuenta, se la regalo un amigo de el, uno cuando comienza a jugar tampoco tiene mucha idea, y si vamos a ser sinceros,... quien carajo lee los términos y condiciones ? vamo arriba gurises. NO AL PERMABAN DE ESTE USUARIO!","replies":[]},{"poster":"Desaroll","date":"2017-02-03T00:39:20.214+0000","up_votes":3,"down_votes":9,"body":"Dudo MUCHO que se la hayan cerrado solo por compartir la cuenta. Normalmente lo de \"La cuenta es compartida, no podemos devolverla\" viene cuando la cuenta fue baneada por cualquier otro motivo, y alguien que no es el creador acude a Soporte a reclamar. Pero incluso si así fuera, está en las reglas.\n\nSi la cuenta era de nivel bajo, menos motivo aún para hacer el intercambio. No termino de entender el por qué de ese intercambio. Tan absurdo el baneo (Si es solo por cuenta compartida) como el intercambio, si me preguntas a mí.\n\nLa diferencia es que el baneo respeta las normas establecidas, el intercambio no.\n\nSuerte!","replies":[{"poster":"CG Teo","date":"2017-02-03T06:41:31.392+0000","up_votes":4,"down_votes":0,"body":"El problema no es que esté o no en los términos y condiciones, y como está la regla vos como jugador te comprometes sabiendo que te pueden banear la cuenta, pero la gente pasaba cuentas en ese momento porque no había tanta repercusión en pasarle la cuenta a tu amigo para que juegue normales o incluso regalar una cuenta lvl 10 porque al amigo no le gusto el juego. \nAcá la injusticia está en que antes no había tanto problema, y por ignorancia el leveleo esa cuenta y compró todo ahí como  si la hubiera creado el; que básicamente lo hizo porque su amigo no jugó nada en la cuenta, y el juego simplemente no le gustó el lol; y para gustos, colores.\nSigo viento tu punto, de que como está en la EULA hay que respetarlo, pero lo mismo no había tanta repercusión ni opresión por parte de Riot para que la comunidad lo siga y respete; cómo ahora. Cómo le comento Excalibeer ellos banean a quienes pasan la cuenta y ven una gran diferencia entre el dueño y la persona que usa temporalmente la cuenta (flammea, usa scripts) incluso en una cuenta que no sirve, estás arruinando la experiencia de juego de otros jugadores.\n\nAVISO: No te quiero confrontar ni llegar a una pelea, hay algunos de tus comentarios con los que estoy de acuerdo y otros que no, como este.  Yo dije mi opinión y respeto tu punto de vista, aunque no lo comparta. \n\nSalu3","replies":[]}]}]},{"poster":"Yitán","date":"2017-02-03T17:35:55.340+0000","up_votes":1,"down_votes":0,"body":"pero se la dio hace 4 años siendo lvl 10 la cuenta, capo, ahi si que falta tacto, ahora hay que ver la \"verdadera\" version, como que la cuenta siguiera siendo compartida o como dijo el rioter, que esté asociada a algo ilegal","replies":[{"poster":"Desaroll","date":"2017-02-03T18:01:36.596+0000","up_votes":1,"down_votes":0,"body":"Como ya le respondí a otro:\n\n> Si la cuenta era de nivel bajo, menos motivo aún para hacer el intercambio. No termino de entender el por qué de ese intercambio. Tan absurdo el baneo (Si es solo por cuenta compartida) como el intercambio, si me preguntas a mí.\n> \n> La diferencia es que el baneo respeta las normas establecidas, el intercambio no.\n\nSí, si el castigo es solo por ser cuenta compartida me parece ridículo. Pero también me lo parece pasarse cuentas nivel bajo en un juego gratuito.\n\nY lo mismo para invertir en un juego sin saber que podes hacer y que no.\n\nYo lo admito, no leo los Términos y Condiciones de la mayoría de los sitios a los que entro. Pero sí, antes de meter plata en algo, me aseguro que no tengan motivos para cagarme.","replies":[{"poster":"Yitán","date":"2017-02-03T19:06:51.015+0000","up_votes":1,"down_votes":0,"body":"a lo que voy es que no justificaria un ban permanente, ya si bien rompe el protocolo, el mismo fue hecho para garantizar un mejor desempeño en partidas y tal, la clausula fue colocada con el fin de ser equitativo y no ser eloboosteado, porque vamos, a nadie le gusta invertir años de juego para que otro en 1 dia tenga lo mismo que vos,aunque la regla creo que esta mas para que no desestabilice al sistema de emparejamientos, dejando a un bronce en cuenta diamante o un recien empezado a lvl 30, lo que arruinaria el juego de todos sus compañeros de equipo, pero tampoco da llevar las reglas como palabra sagrada, ya que una cuenta a lvl 10 no me parece que sea mucha injusticia, el nivel de juego casi no va a variar con tus compañeros, y mas al haber tenido esa cuenta por tanto tiempo","replies":[{"poster":"Desaroll","date":"2017-02-03T19:15:26.546+0000","up_votes":2,"down_votes":0,"body":"Yo fui quien les pasó este caso a los Rioters para que lo vieran.\n\nLiteralmente, mis palabras en el chat que tenemos los voluntarios con ellos fueron:\n\n> Si la cuenta fue entregada casi desde un inicio, y pasaron años desde entonces, no veo a quien perjudica. Si hubo otro motivo, como supongo que hubo, creo que debería aclararse, y a estas alturas tal vez sería conveniente que sea públicamente.\n> Como dije, las normas están del lado de la sanción, pero así como no aplican lo de \"prohibido modificar los archivos del juego\" para las custom skins o modificaciones que no dan ventaja, creo que las normas están para ser aplicadas cuando es necesario.\nEste caso se tornó público, y, a simple vista, con la info que da el usuario, sí, parece una aplicación arbitraria de una regla que usualmente solo se efectiviza en contra del eloboost o cuando hay reclamos entre varios \"dueños\".\nSí, creo que el usuario hizo mal y sé que no tiene \"derecho\" según las normas a reclamar nada (La cuenta ni siquiera es suya), pero lo que no entiendo es como llegamos a esto xD\n\nCritico a ambos lados por hacer lo incorrecto, no tomo partido.\n\nLa diferencia es que Riot está respetando las reglas (Quizás demasiado arbitrariamente), y el usuario no.","replies":[]}]}]}]}]},{"poster":"Locked ULIvE","date":"2017-02-02T23:56:27.621+0000","up_votes":4,"down_votes":2,"body":"Una falta es una falta. No es una estafa. uno lo acepta cuando instala el lol, fue advertido si que no le veo la estafa. Si uno no lee y solo acepta es responsabilidad de uno. ","replies":[]}]}]}]},{"poster":"Cool As Me","date":"2017-02-03T03:02:09.130+0000","up_votes":9,"down_votes":2,"body":"si bien violaste una parte del termino de uso del juego, te permabanearon mucho tiempo despues del debido, justo cuando ellos ya se llenaron los bolsillos con el dinero que invertiste en la cuenta. para colmo era una cuenta lvl10, practicamente con lo que la jugaste e invertiste es toda tuya. así trabajan en rito por lo visto...\n{{summoner:11}}","replies":[]},{"poster":"Ufaaaaaaaaaa","date":"2017-02-02T22:16:07.086+0000","up_votes":4,"down_votes":9,"body":"en realidad es irrelevante. Violaste los terminos de uso, estás en falta, y tuviste el castigo correspondiente. El hecho de que hayan tardado en darse cuenta es irrelevante.\nSi bien no coincido en que te la hayan quitado ya que llevas 4 años usandola y el correcto razonamiento que (se supone) hace riot para no permitir el cambio de cuentas en tu caso no aplica, ya que el mmr de la cuenta es todo tuyo porque ni el rastro debe quedar del mmr con el cual la tomaste y no afectas a la gente que juega.\nPero no es menos cierto que las reglas son las reglas, estás en falta, y el castigo te corresponde.","replies":[{"poster":"alojen","date":"2017-02-02T22:19:37.879+0000","up_votes":5,"down_votes":6,"body":"Si pero ponete en mi lugar un segundo, y decime que harias vos, si me decis \"yo aceptaria el ban ya que estoy en falta\" creo que me estarias mintiendo, ya que si hay reglas son para cumplirlas, pero despues de 4 años? me parece un poquito injusto, gracias por cometar!","replies":[{"poster":"Ufaaaaaaaaaa","date":"2017-02-02T22:34:35.690+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Cordobéz,realm=LAS,application-id=X54mVVp0,discussion-id=6fmpNkYV,comment-id=00050000,timestamp=2017-02-02T22:19:37.879+0000)\n>\n> Si pero ponete en mi lugar un segundo, y decime que harias vos, si me decis &quot;yo aceptaria el ban ya que estoy en falta&quot; creo que me estarias mintiendo, ya que si hay reglas son para cumplirlas, pero despues de 4 años? me parece un poquito injusto, gracias por cometar!\n\nY si, la como. Pero vamos a comenzar por el hecho de que conozco las reglas, entonces lo que a vos te pasó a mi no me pasaría nunca (aparte tengo 3 cuentas y casi ni bola le doy al juego ultimamente). Pero si me pasara a mi, lo aceptaría, porque entiendo que las reglas son las reglas, y la excepción a uno implica el pedido de excepción de otros, y se hace la pelotita \"ah, al que llevaba 4 años se la dejaron y a mi porque llevo 3 me la quitan, es injusto\" entonces también se la dejan y viene el \"ah, el que llevaba 3 se la dejaron y a mi que llevo 2 me la quitan, es injusto\", entonces también se la dejan y viene el \"ah, el que llevaba 2 se la dejaron y a mi que llevo 1 me la quitan, es injusto\" y así hasta que terminan reclamando porque a uno le dejaron una cuenta de hace 15 minutos y al de 10 minutos se la banearon.\nDesde un punto de vista tecnico, es justo que todas las personas que no cumplen con las reglas obtengan el castigo correspondiente. \nTe reitero, yo creo que riot debería apelar al sentido común y devolvertela, pero tu queja no es valida. Las reglas son las reglas y están para ser cumplidas.","replies":[{"poster":"franco400","date":"2017-02-02T22:40:03.589+0000","up_votes":3,"down_votes":5,"body":"> [{quoted}](name=Ufaaaaaaaaaa,realm=LAS,application-id=X54mVVp0,discussion-id=6fmpNkYV,comment-id=000500000000,timestamp=2017-02-02T22:34:35.690+0000)\n>\n> Y si, la como. Pero vamos a comenzar por el hecho de que conozco las reglas, entonces lo que a vos te pasó a mi no me pasaría nunca (aparte tengo 3 cuentas y casi ni bola le doy al juego ultimamente). Pero si me pasara a mi, lo aceptaría, porque entiendo que las reglas son las reglas, y la excepción a uno implica el pedido de excepción de otros, y se hace la pelotita &quot;ah, al que llevaba 4 años se la dejaron y a mi porque llevo 3 me la quitan, es injusto&quot; entonces también se la dejan y viene el &quot;ah, el que llevaba 3 se la dejaron y a mi que llevo 2 me la quitan, es injusto&quot;, entonces también se la dejan y viene el &quot;ah, el que llevaba 2 se la dejaron y a mi que llevo 1 me la quitan, es injusto&quot; y así hasta que terminan reclamando porque a uno le dejaron una cuenta de hace 15 minutos y al de 10 minutos se la banearon.\n> Desde un punto de vista tecnico, es justo que todas las personas que no cumplen con las reglas obtengan el castigo correspondiente. \n> Te reitero, yo creo que riot debería apelar al sentido común y devolvertela, pero tu queja no es valida. Las reglas son las reglas y están para ser cumplidas.\n\nQuien te entiende, en un momento decís que el ban esta justificado, en otro decís que deben devolverla. Pone en una línea derecha tus pensamientos y después trata de compartirlos, por que no generas nada mas que desvirtuar el tema del que se esta hablando.\nGracias por intentar aportar pero no lo haces.","replies":[{"poster":"Ufaaaaaaaaaa","date":"2017-02-02T22:55:32.315+0000","up_votes":9,"down_votes":2,"body":"> [{quoted}](name=franco400,realm=LAS,application-id=X54mVVp0,discussion-id=6fmpNkYV,comment-id=0005000000000000,timestamp=2017-02-02T22:40:03.589+0000)\n>\n> Quien te entiende, en un momento decís que el ban esta justificado, en otro decís que deben devolverla. Pone en una línea derecha tus pensamientos y después trata de compartirlos, por que no generas nada mas que desvirtuar el tema del que se esta hablando.\n> Gracias por intentar aportar pero no lo haces.\n\ntenés que saber la diferencia entre una opinión y un hecho (cálculo que te lo enseñarán cuando llegues a la secundaria). En mi **opinión** deberían devolversela, por una cuestión de sentido común. Eso no quita el **hecho** de que la cuenta está baneada correctamente. Opinión, hechos, objetividad, subjetividad, deberías familiarizarte con esos conceptos antes de encarar una discusión.","replies":[]}]}]}]},{"poster":"LaReDurmio","date":"2017-02-02T22:19:57.849+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Ufaaaaaaaaaa,realm=LAS,application-id=X54mVVp0,discussion-id=6fmpNkYV,comment-id=0005,timestamp=2017-02-02T22:16:07.086+0000)\n>\n> en realidad es irrelevante. Violaste los terminos de uso, estás en falta, y tuviste el castigo correspondiente. El hecho de que hayan tardado en darse cuenta es irrelevante.\n> Si bien no coincido en que te la hayan quitado ya que llevas 4 años usandola y el correcto razonamiento que (se supone) hace riot para no permitir el cambio de cuentas en tu caso no aplica, ya que el mmr de la cuenta es todo tuyo porque ni el rastro debe quedar del mmr con el cual la tomaste y no afectas a la gente que juega.\n> Pero no es menos cierto que las reglas son las reglas, estás en falta, y el castigo te corresponde.\n\nNo corresponde, claramente dice que no le dan una justificación que demuestre la acusación por la cual se lo baneo.\nSiempre que uno es sancionado sea cual sea la sanción, se tiene que mostrar, si no es totalmente arbitrario el uso de esta y es meramente una opinión personal del RIOTER quien debe ser baneado y quien no.\nUna comunidad tan grande, debe manejarse como tal, además de decir que se esta hablando de una cuenta con uso económico.\n\nEl ban no esta justificado, hasta que se justifique. Lee un poco y te das cuenta de eso.","replies":[{"poster":"Ufaaaaaaaaaa","date":"2017-02-02T22:26:02.702+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=LaReDurmio,realm=LAS,application-id=X54mVVp0,discussion-id=6fmpNkYV,comment-id=00050001,timestamp=2017-02-02T22:19:57.849+0000)\n>\n> No corresponde, claramente dice que no le dan una justificación que demuestre la acusación por la cual se lo baneo.\n> Siempre que uno es sancionado sea cual sea la sanción, se tiene que mostrar, si no es totalmente arbitrario el uso de esta y es meramente una opinión personal del RIOTER quien debe ser baneado y quien no.\n> Una comunidad tan grande, debe manejarse como tal, además de decir que se esta hablando de una cuenta con uso económico.\n> \n> El ban no esta justificado, hasta que se justifique. Lee un poco y te das cuenta de eso.\n\nel mismo abre el thread diciendo que el obtuvo la cuenta de otra persona en el año 2013.","replies":[{"poster":"franco400","date":"2017-02-02T22:36:04.843+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ufaaaaaaaaaa,realm=LAS,application-id=X54mVVp0,discussion-id=6fmpNkYV,comment-id=000500010000,timestamp=2017-02-02T22:26:02.702+0000)\n>\n> el mismo abre el thread diciendo que el obtuvo la cuenta de otra persona en el año 2013.\n\nNo tiene nada que ver, ellos tienen que dar su prueba que demuestre el uso indebido de la cuenta.\nDeja de defender a RIOT ellos tienen un STAFF pago el cual no da explicaciones de nada. Lo que se espera es que ellos den las justificaciones no vos.","replies":[{"poster":"Forero","date":"2017-02-02T22:40:21.491+0000","up_votes":3,"down_votes":0,"body":"Oye, el mismo usuario lo reconoce, y riot lo detecto, pero sobre todo el usuario lo reconoce ¿Como es que pides más pruebas?","replies":[{"poster":"alojen","date":"2017-02-02T22:47:58.355+0000","up_votes":5,"down_votes":1,"body":"Las pruebas que pido es que me digan como se enteraron que la cuenta no es mia, por que si taaaaanto investigaron ahora, por que no lo hicieron hace 4 años atras cuando empece a jugar, por que ponete a pensar, son 4 años en lo que venis jugando en la cuenta y lo peor es nunca fui baneado, solo 1 vez en tooooooooodo los 4 años tuve restriccion de chat.\nGracias por comentar!","replies":[{"poster":"Forero","date":"2017-02-02T23:03:19.160+0000","up_votes":2,"down_votes":1,"body":"Por supuesto, lo de la prueba ya lo verán en el ticket con excalibeer.\n\nLo que digo es que el pide prueba algo que ya sabemos que paso.","replies":[]}]}]}]}]}]}]}]}