{"poster":"Taxonometrist","date":"2015-09-11T02:29:28.537+0000","title":"medida por parte de los jugadores con respecto a la toxicidad","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":3,"body":"esto ya se salio de control. las partidas con trolls, afk, ni&ntilde;os rata, flammer, etc no terminan nunca. de cada 10, en 7 u 8 te toca esa clase de gente. y si no se ponen asi es por q ganas por paliza. para ellos es asi: en 10 minutos estas dando una paliza increible o es gg.\r\npropongo algo simple: una huelga de jugadores, q se les vacie el server, sencillo. somos el principal recurso q tiene esto para existir. sin jugadores el server no existe. NO JUGUEMOS HASTA Q TOMEN MEDIDAS REALES! BASTA DE CHAMUYOS!\r\nentras a los historiales de los troles y se ve q ya vienen jugando asi desde muuuuuucho tiempo atras. cuanto se tarda en detectar estos comportamientos? con una sola partida tendria q ser suficiente! este mismo foro es un ejemplo de como funcionan las cosas en todos lados: alguien dice una mala palabra o se dirige incorrectamente hacia alguien y te banean de inmediato, sin discusion, sin preambulos, recibis un ban de 3 dias. por q en el juego no es asi?\r\npongamonos las pilas nosotros, mostremos q de verdad estamos cansados de esta situacion!\r\nte dicen: mejora tu juego y vas a subir. pero expliquenme: &iquest;como puedo mejorar mi juego, como puedo practicar estrategias mas complicadas, farmear mejor, preocuparme de las cosas q se tiene q preocupar un jugador q quiere mejorar, si antes tengo q preocuparme de q hay 3 discutiendo de quien tiene la culpa de algo q paso hace 15 minutos, si tengo q estar viendo si tengo ping antes de cada jugada, etc?\r\n\r\npongamonos de acuerdo entre nosotros! demostremos q podemos estar unidos! q los jugadores con compa&ntilde;erismos existen!","replies":[{"poster":"Nutria Deliciosa","date":"2015-09-11T02:50:48.394+0000","up_votes":1,"down_votes":1,"body":"A mi los flamers no me molestan mientras juegue bien. Por un lado los trolls, afk, etc me sirven que esten en el otro equipo. Es para pensar","replies":[]},{"poster":"EzrealSupportOP","date":"2015-09-12T21:09:52.772+0000","up_votes":2,"down_votes":0,"body":"Yo juego sin problemas, sin trolls o afk hace muchisimo tiempo.\n\nA cada quien lo emparejan con sus semejantes.","replies":[{"poster":"Taxonometrist","date":"2015-09-13T06:49:41.792+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"EzrealSupportOP","date":"2015-09-13T15:41:58.377+0000","up_votes":2,"down_votes":0,"body":"No tengas envidia de mi talento superior, yo no pedi nacer con este regalo para la humanidad","replies":[]}]}]},{"poster":"The Inkanus","date":"2015-09-11T03:19:05.739+0000","up_votes":2,"down_votes":0,"body":"**Propongo otra medida:** seguir jugando igual que siempre, reportar eficientemente y con cabeza a quienes se lo merezcan, limpiar la comunidad y enormizar esta galería: https://500px.com/Chirimbola/sets/tribunal\n\nMejuí! {{summoner:4}}","replies":[{"poster":"Taxonometrist","date":"2015-09-11T03:35:27.233+0000","up_votes":1,"down_votes":1,"body":"sabes hace cuanto q vengo reportando?\nsabes cuantos troles q se merecen mas de una de las categorias de report por partida te tocan, q estas seguro q en la anterior q jugaron fueron igual de insportables, q murieron tanto aunque les pedias por favor q se dejen de tirar 1 vs 5, y q ver su historial lo confirma y q no pase nada?\nriot tiene q implementar un sistema q destaque a los jugadores q se comportan en vez de solo castigar a los q se portan mal, es un sistema basado en la toxicidad en vez de estar basado en el buen comportamiento. las medidas son, a priori, teniendo la mala conducta de los jugadores como base y no al revez. esto q pasa en el lol es un errado punto de vista q tiene el sistema moral q propone el juego. y es un sistema moral, claro q si! hay un codigo q se debe respetar (el codigodel invocador, donde se dice como comportarse y cuales son los valores q se admiran y se esperan en la grieta, o sea, el jugador ideal al q todos deben aspirar, o sea, un sistema moral) el tema es, q hace riot para EDUCAR a la gente a q se comporte de esa manera, por q toda moral requiere de una educacion: nada. simplemente se espera q \"limpiando\" el server se reduzca la toxicidad.\ny si mejor implementan algo esperando lo mejor de la gente en vez de lo peor? por q eso hace esta sistema de castigo q tienen: esperan lo peor del jugador para q empiece a funcionar. y con lo mejor de cada uno q hacen? respuesta: nada.\nla paciencia se pierde, hermano. q se pongan a trabajar con psicologos, sociologos, filosofos, o cualquier otra clase de humanista, por q, evidentemente, de base, estan errados.","replies":[{"poster":"Marz","date":"2015-09-11T05:11:45.168+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Taxonometrist","date":"2015-09-11T06:37:51.700+0000","up_votes":1,"down_votes":1,"body":"por q pensas q es abstracto? para mi es cuestion de agregar una sola cosa muy simple:\npublicidad de honor/reports en el champ select. de q serviria esto? ante el encuentro con gente desconocida ya sabes q tendencia de comportamiento va a tener ingame. si tiene muchos reports quiteas, o si tenes huevos como para aguantar lo q viene jugas. q lograria esto? si en cada partida q el q entra con 200 reports alguien sale de la cola quedara auto excluido por la comunida.\npor otro lado los q tienen buen comportamiento tambien serian reconocidos por tal cosa y el incentivo a tener honor seria el motor de querer dar honor y recibirlo, cosa q se hace poco en la comunidad. al mismo tiempo, tener muchos reports causaria verguenza al invocador. q te parece esto, mi amigo invocador?","replies":[{"poster":"Marz","date":"2015-09-11T14:24:31.754+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Taxonometrist","date":"2015-09-11T17:22:30.253+0000","up_votes":1,"down_votes":1,"body":"no solo los reportes serian publicos, tambien el honor, eso haria q haya presion de grupo. el sistema de este juego esta basado en una psicologia conductisca clasica, y mal aplicada. porq mal aplicada? la psicologia conductista aplica un refuerzo negativo ante las conductas q no se buscan en el individuo al q se aplica (y hablo de individuo por q en esta psicologia no hay sujeto) y un refuerzo positivo a las conductas q se busca q se repitan. cual es el refuerzo q tenemos en este juego para ser buenos? ninguno. simplemente se espera q pase, q los trolls dejen de estar y los demas empiecen a ser santos.\naca hay un problema de fondo, el server espera lo peor de nosotros para empezar a actuar sobre nuestro comportamiento ya q las medida empiezan ahi, a partir de lo malo. se ve tambien en la cantidad de cosas por la q alguien puede ser reportado, son mas de 10; pero por cuantas csoas podemos dar honor? solo por cuatro. si tenes mas de 10 maneras de ver lo malo y solo 4 de ver lo bueno, vas a ver al demonio en cada rincon","replies":[{"poster":"Marz","date":"2015-09-12T02:26:31.951+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Taxonometrist","date":"2015-09-12T18:22:14.840+0000","up_votes":1,"down_votes":0,"body":"Primer punto que criticas: no habria motivacion por mejorar. creo haber explicado de donde surgiria la motivacion a mejorar, esta es, no sentir la presion de grupo por tener muchos reports, no sentir verguenza de tener muchos reports, q no te agregue nadie por ser toxico, q nadie quiera jugar con vos. Que te suspenda un sistema que es una computadora en algun lugar remoto de un pais es una cosa, pero que te anule la misma gente que te rodea es otra muy distinta. El toxico no esta frustrado, el toxico piensa que tiene razon cuando muere 9 veces en 15 minutos y dice que es culpa del jungla; el toxico frustra a los demas.\n¿De donde surge la presuncion de que no queremos cambiar la psicologia de las personas? En este foro se leen post TODO el tiempo de gente frustrada, enojada, harta, que empieza a afectar su vida cotidiana. Si bien parece muy extremista su punto, ¿por que no tratar de que los jugadores esten mas felices? Aca sucede algo de fondo que necesita un cambio, el juego tiene una perspectiva NEGATIVA de los jugadores y la negatividad surge de ahi.\nNo creo que esto sea lo mismo que linchar a un delincuente en la calle, simplemente llevalo a un caso mas cotidiano, no se, un partido de futbol: Muchas veces existe el pibe que se queja de todos, que grita, que se enoja y dice que no le hicieron un paso. Al principio nadie le dice nada, capaz le piden que se calme, como muchas veces pasa en el juego pero en vez de hacerlo siguen con su toxicidad. A ese pibe lo invitan una vez, dos veces, tres veces. la ultima vez que lo invitaron ya seguro alguno le hace una cara de que esta siendo pesado, capaz mas de uno, capaz hablaron entre todos de el y, por ejemplo, surge un gesto espontaneo grupal como darle la espalda mientras habla. el pibe ahi se da cuenta que capaz su actitud no esta siendo buena y tal vez cambie. O, tal vez, directamente no lo invitan mas.\n¿Para que deberiamos saber quien es un jugador toxico? Para saber de antemano con quien nos vamos a cruzar. En este juego con la cantidad de gente toxica que hay uno entre ESPERANDO, como hace el mismo sistema que nos juzga, que los jugadores sean  toxicos; no entras a una partida esperando que sean buena onda. Entonces, si con medidas se incentiva el crecimiento del uso del honor y esto se refleja en el champ select uno entra y dice \"ahh mira, este loco es buena onda\", \"este chabon siempre ayuda\", etc.  Y entras a una partida ANIMADO, RELAJADO, sin mirar de reojo a nadie. Y si alguien tiene 1000 reports tomara cada unos sus medidas ante el caso.\nOtro problema: le decis a alguien, sin mayores palabras ni peor tono que este: \"loco, necesitamos un tanque, el adc te baja de dos tiros y sos un j4 en top, hacete armor por favor\", y se lo pedis a los 20 minutos, a los 25, y te dicen flammer, cuando en realidad solo estas, primero que nada, dando un consejo ante una situacion especifica y segundo, actuando como un buen compañero ante las necesidades del team entero.\nNo es que este seguro de que estas medidas vayan a funcionar, no me baso en nada para decirlo lo que digo, Podrian aplicarse otras que tal vez tambien serian efectivas. Pero si me baso en la experiencia en general que tuve yo en el server y que tienen muchos otros jugadores para decir por que el server nos ve, ante todo, como toxicos potenciales; no da ningun incentivo al buen comportamiento y por que creo que la toxicidad surge del sistema mismo.\nHay algo que esta por detras de los sujetos, antes de las personas, que los atraviesa y genera tendencias sobre como actuar ante ciertas situaciones. En este caso, el del lol, el fondo es este sistema toxico que se usa para juzgarnos, que de entrada esta basado en la toxicidad y no en el buen comportamiento.","replies":[{"poster":"Marz","date":"2015-09-12T22:52:05.889+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Taxonometrist","date":"2015-09-13T06:48:54.981+0000","up_votes":1,"down_votes":1,"body":"no pretendo que se eliminen los reportes ni los ban, eso nunca lo dije, lo asumiste. lo demas es solo para saber a quien tenes al lado y q medidas tomar al respecto. el hecho de quitear no es lo primordial de mi planteo y no se por q lo interpretaste asi.","replies":[]}]}]}]}]}]}]}]}]}]}]}