{"poster":"Adam4everything","date":"2019-04-27T20:54:55.435+0000","title":"Bambini del matchmaking","subforum":"Discussioni generali","up_votes":6,"down_votes":11,"body":"Oggi mi è capitato di fare una partita in cui un giocatore mi chiedeva di fare a cambio di lane. Ho risposto educatamente che preferivo stare dove stavo, risultato? Banna il champ che avevo selezionato prima della scelta definitiva. La mia domanda è: Non sarebbe meglio aggiungere una forma di report contro queste persone? Perchè va a finire che o si trolla o si usa un champ non voluto, finendo per non divertirci? \r\n          {","replies":[{"poster":"Retardo DiCaprio","date":"2019-04-28T10:36:45.429+0000","up_votes":4,"down_votes":0,"body":"Le champion pool esistono per un motivo. Sai quante volte ho bannato vayne anche se il mio 4/5 pick la voleva ma nessuno poteva tradare con lui e io non volevo avere il rischio di avere vayne contro? Non mi interessa cosa vogliono i miei compagni, se voglio fare un ban e non sono sicuro che loro possano prenderlo prima degli avversari non rischio e banno. Ci sono 140 champion nel gioco, capisco l'esser main e avere un champ preferito e tutto, ma se ne sai giocare soltanto uno meriti di non salire, non tanto per cattiveria ma perchè lo possono bannare anche gli avversari e a quel punto che si fa? \n\nPoi se l'intenzione di quella persona è esser toxic nei tuoi confronti perchè non hai lasciato la lane non preoccuparti, al 99% delle probabilità ti flammerà anche in game ed ecco il tuo report {{summoner:11}}","replies":[{"poster":"Adam4everything","date":"2019-04-28T17:11:34.483+0000","up_votes":1,"down_votes":0,"body":"Infatti io mi riferivo alla seconda cosa che hai detto, ovvero il ban del champ perchè non ho lasciato la nane. XD","replies":[]}]},{"poster":"Erax157","date":"2019-04-27T22:06:25.171+0000","up_votes":2,"down_votes":1,"body":"È un po complessa la questione, se per una funzionalità di gioco come il ban fosse necessario un report apposito la situazione dovrebbe essere davvero grave. È fastidioso ma tu vorresti fargli prendere il ban perche ti hanno bannato il tuo champ, so che è fastidioso ma cavolo che misure drastiche.","replies":[{"poster":"Croffins","date":"2019-04-28T12:34:34.815+0000","up_votes":2,"down_votes":0,"body":"Non è drastica, se fai lo stronzo e sei tossico non vedo perchè dovresti continuare a giocare, a me sembra più che giusto punirlo, anche perchè è pieno di gente che fa i dispetti da bimbi xd in champ select e sarebbe ora di fare pulizia.","replies":[]},{"poster":"Adam4everything","date":"2019-04-28T17:10:06.394+0000","up_votes":1,"down_votes":0,"body":"Un conto è quando qualcuno banna perchè non è detto che io riesca a selezionare quel champ, un'altro è quando il giocatore banna per motivi futili, come il rifiutare di scambiare le lane.","replies":[]}]},{"poster":"vondarck","date":"2019-04-29T11:15:23.113+0000","up_votes":2,"down_votes":1,"body":"Non svelo mai il mio champ neanche ad i miei compagni di team.\n\nIo banno sempre vayn, se uno me lo vorrà pikkare ed è tra gli.ultimi in ordine di pick pikkero lee sin/jax, banno vayn.\nAl che vayn mi bannera per contro lee/jax e mi trovo con 2 ban per me perché li bannerei entrambi.\nE la cosa più bella è che penserá che così siamo pari :D\n\n#powerofmind","replies":[{"poster":"Adam4everything","date":"2019-04-29T18:02:18.143+0000","up_votes":1,"down_votes":0,"body":"E poi si ritrova confuso nel vedere che lo ringrazi pure, non capendo. XD","replies":[{"poster":"vondarck","date":"2019-04-30T07:03:32.004+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Adam4everything,realm=EUW,application-id=MJVj50Jw,discussion-id=s8r2OVJN,comment-id=00020000,timestamp=2019-04-29T18:02:18.143+0000)\n>\n> E poi si ritrova confuso nel vedere che lo ringrazi pure, non capendo. XD\n\nMagari mi onora pure a fine partita U_U","replies":[]}]}]}]}