{"poster":"Wholesalespy52","date":"2015-01-26T17:26:26.469+0000","title":"client/crash on start","subforum":"Report a Bug","up_votes":1,"down_votes":0,"body":"The game won't start for me anymore. I've rebooted my computer but it's still not working. When I look around in the files I can't find any uninstaller. So  don't know what to do now. When I start it windows gives me a little window that says  \"PVP.net Patcher Kernel has stopped working\"\r\n\r\nThe next step  I always take when trying to fix something on my computer is to uninstall then re-install. I've found quite a few people who have tutorials on uninstalling it. But I haven't found one from the developers. I don't want to risk deleting it in that way, mainly because I once nearly deleted desktop.ini. So do you guys have an uninstaller I could use?","replies":[{"poster":"bumsnnoses","date":"2015-01-26T20:16:39.355+0000","up_votes":1,"down_votes":0,"body":"literally it's simple go to your installation directory and delete everything with riot games in the name, or use control panel to do the exact same thing for you.","replies":[{"poster":"zane yalgir","date":"2015-01-27T08:57:18.078+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bumsnnoses,realm=NA,application-id=LqLKtMpN,discussion-id=jEr2FrKE,comment-id=0000,timestamp=2015-01-26T20:16:39.355+0000)\n>\n> literally it's simple go to your installation directory and delete everything with riot games in the name, or use control panel to do the exact same thing for you.\n\ni like this one theyve done a shitty job over all jsut got a leaver buster flag from a clear freeze at loading screen","replies":[]}]},{"poster":"Riot Exgeniar","date":"2015-01-26T22:45:24.920+0000","up_votes":1,"down_votes":0,"body":"Hey Wholesalespy52,\n\nI think you might just have a few corrupted files. Have you tried repairing your client? \n\n> From: https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes\n> \n> REPAIRING CORRUPT GAME FILES\n> Occasionally, crashes may occur when certain game files become corrupt. Using the repair function in the game launcher (the first window that appears when you run League of Legends) will fix any corrupted files.\n> \n> To run the repair function:\n> \n> Run League of Legends.\n> Click on the button with a gear that is located in the top right corner of the window.\n> Click Repair.\n> Wait. The repair function can take anywhere from 5 minutes to over 30 depending on the number of corrupt files it has to repair.","replies":[]}]}