{"poster":"BloodyKisha","date":"2019-05-15T20:59:22.637+0000","title":"Gebannt wegen schlechtem spielens in normals","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":0,"body":"Hallo/abend/morgen xD \n\nIch hab ne frage an euch ich sag es frei raus ich bin unterirdisch in dem Spiel gebe aber immer mein bestes (spiele deshalb auch nur Normals) und raked Fass ich nicht an \n\nIch hab heute mehrere runden Riven gespielt weil ich sie mal ausprobieren Wollte hatte dann eine quinn gegen über die sehr gut war Ende von game stand ich 0/10/0 weil ich garnichts hinbekommen habe indem game \n\nDarauf hin wurde mir von 2 Team m8s direkt wieder das schöne Wort Report \"riven\" (charakter halt denn ich spiele in der Runde)\n\nSo nun meine Frage kann ich ehrlich dafür gesperrt werden ? Ich spiele das game aus Spaß und nicht um zu Feeden oder sonst was ich bin einfach nur schlecht xD gebe aber wie gesagt immer mein bestes nur bekomme nun jedesmal wenn eine runde kacke für mich läuft das Wörtchen Report ins gesicht geknallt nun habe ich Angst das ich gebannt werde habe schließlich Geld inveStiert in denn acc für skins und ich bin nicht wirklich ritch xD \n\n(Ja ich weiß 0/10/0 wo ist da die Mühe?)\n\nIch hab ehrlich rein geschissen in der Runde ich hab nichts hinbekommen mein gegner konnte mich einfach perfekt outplayen \n\nDanke für die antwort/en \n\nGuten Abend/tag/morgen noch =3","replies":[{"poster":"Dontpickyasorint","date":"2019-05-16T02:49:04.965+0000","up_votes":3,"down_votes":4,"body":"Du Stehst 0/11/0 mit nem bf und dem lifesteal item.....\nSieht eher so aus als ob du jemanden den tag vermießen wolltest......\nStart item ist auch keins vorhanden und wo du gestorben bist ist ein bisschen komisch....","replies":[{"poster":"BloodyKisha","date":"2019-05-16T05:15:14.126+0000","up_votes":1,"down_votes":0,"body":"ich hatte anfangs dorans schild drin hab es dann verkauft gehabt weil ich mir nenn besseres item gekauft hatte mein kollege sagte mir dann das das nicht gut gegen quinn ist also bin ich hingegangen und hab das dann wieder verkauft und habe mir die letzten beiden items gekauft die du am ende sehen kannst und mag sein das es komisch ist wo ich gestorben bin ich wollte sie einfach klein bekommen hab es halt nie geschafft und ich habe nichts davon anderen denn tag zu vermiesen ich will das spiel einfach nur endspannt spielen :D mehr nicht","replies":[{"poster":"Dontpickyasorint","date":"2019-05-16T06:02:53.144+0000","up_votes":2,"down_votes":1,"body":"Man verkauft das Start Item nicht so früh das lohnt sich nicht\nItems zu  kaufen und dann zu verkaufen ist auch unsinnig  damit bist du automatisch schlechter selbst wenn das neu gekaufte item \" besser \" ist für den gegner\nEs wirkt einfach komplett strange auch keinen einzigen assist zu haben aber ohne replay anzuschauen kann ich das  nicht beurteilen","replies":[{"poster":"MidlaneGod115","date":"2019-05-16T06:31:03.818+0000","up_votes":6,"down_votes":0,"body":"Hallo? Er ist ein Anfänger?","replies":[{"poster":"Dontpickyasorint","date":"2019-05-16T07:54:24.750+0000","up_votes":1,"down_votes":3,"body":"Und weil er ein Anfänger ist darf ich das jetzt nicht sagen?\nIst das etwa verboten anfängern tipps zu geben?`\nHätte ich sagen sollen ja super verkauf deine items und kauf neue why not?\nAlder Alder Menschen gibts.","replies":[{"poster":"Rena","date":"2019-05-16T08:47:06.616+0000","up_votes":2,"down_votes":0,"body":"Klar darfst du ihm Tipps geben, ist sogar nett von dir.\n\"Sieht eher so aus als ob du jemanden den tag vermießen wolltest\"\nDas finde ich halt einfach ein wenig bescheuert xD\nIch meine man sieht das er ein Anfänger ist.","replies":[{"poster":"Dontpickyasorint","date":"2019-05-16T10:55:04.340+0000","up_votes":1,"down_votes":1,"body":"Warum es ist meine meinung. \nes  gab schon oft den fall das  sich jemals als neuling ausgab um bestätigung zu erhalten \nund die frage ging ja  nicht an dich sondern an \" midlanegod \"","replies":[{"poster":"Rena","date":"2019-05-16T12:58:57.648+0000","up_votes":4,"down_votes":0,"body":"Ich halte es für sehr unwahrscheinlich, dass der Spieler kein Anfänger ist.\nIch glaube niemand würde soviele Games spielen und dazu noch extra feeden, nur um als Anfänger dazustehen.\n\nDie Frage ist ja nicht nur auf ihn bezogen. Würde eh nichts an dem Thema ändern.","replies":[{"poster":"Dontpickyasorint","date":"2019-05-16T13:10:32.093+0000","up_votes":2,"down_votes":0,"body":"Doch es gibt solche menschen nicht viele aber es gibt sie \nUnd die frage die ich meinte war zbs \" darf ich keine tipps geben \" ging an den \"midlanegod\" da er es direkt als negativ sah","replies":[{"poster":"BloodyKisha","date":"2019-05-18T21:40:38.416+0000","up_votes":2,"down_votes":0,"body":"ich kann dir direkt sagen ich bin ein anfänger und hab meistens einfach keine ahnung  was ich machen muss mein kollege ist mit mir in ein 1gegen 1 gegangen und hat mir ein bisschen was erklärt wie ich denn tower besser def/en kann.\n\ner hat mir auch statt riven mal poppy empfohlen mit der ich besser klar komme :D \n\nklar ich kann deine bedenken verstehen das manche leute sich als neuling ausgeben \n\naber ich sag dir das hab ich nicht nötig und was würde es mir bringen so kacke zu spielen mit absicht und dann dafür nenn ban zubekommen ich würde denn sinn nicht verstehen :D \n\naber dennoch danke für die kritik/tipps die du mir gegeben hast \n\nich hatte einfach nur angst das ich dafür wirklich gesperrt werden kann weil ich einfach scheiße in dem spiel bin xD \n\nweil ich schon viele skins hab etc und ich das nicht verlieren will :D \n\nund mein kollege guckt mir meist nun über die schulter und sagt mir was ich machen muss bei meinen 1v1 z.b. gegen teemo oder so und was für items ich mir kaufen muss wann ich mehr defensiver spielen muss etc dafür bin ich im auch dankbar :D","replies":[]}]}]}]}]}]}]}]}]},{"poster":"PXCell","date":"2019-05-16T06:35:02.287+0000","up_votes":3,"down_votes":0,"body":"> Sieht eher so aus als ob du jemanden den tag vermießen wolltest......\n\nIch kenne Kisha und habe mit ihm ein paar games auf der Bot-Lane gespielt, er hat zwar kaum Ahnung von Positioning, Wavecontrol und von den Champions/Skills/Laningverhalten aber ich weiss dass er ganz sicher nicht spielt um anderen den Tag zu versauen. Ich kenne ihn seit einem Jahr wie bereits erwähnt und ich kenne ihn als sehr ehrgeizig und auch als person die immer ihr bestes gibt, dies fiel mir damals auf der Bot Lane auf als er Morgana gespielt hat.","replies":[]}]},{"poster":"Girokonto","date":"2019-05-16T05:52:14.201+0000","up_votes":6,"down_votes":0,"body":"Ganz ehrlich... die Comunity in lol ist einfach toxic, immer wenn man mal ein schlechtes Game hat wird man zu grunde geflamet wodurch sowas auch nicht besser wird. Die die flamen sind meistens auch nicht besser und haben nicht sonderlich viel Ahnung. Mach dir da keine gedanken, die die gebannt werden sind die die dich tod flamen.\nSchau dir Guides zu Champions an die du lernen möchtest, jeder champ ist anders in der Laning phase zu behandeln und das muss man, gerade am anfang, lernen.\n\nHeutzutage ist es auch ziemlich schwer lol neu anzufangen, es gibt zu viele smurfs. Das schlimme ist auch das die Smurfs sich dann noch krass fühlen, weil Sie jemanden zerstört haben der um einiges schlechter ist als man selbst.","replies":[]},{"poster":"KaffeeJunkie","date":"2019-05-16T19:35:54.304+0000","up_votes":3,"down_votes":0,"body":"Hey,\nIch hoffe ich kann Dich einwenig beruhigen. Als ich mit Lol angefangen hab, war ich sehr schlecht. Lol war das erste Spiel dieser Art und ist zudem sehr komplex und nicht über Nacht zu erlernen. Ich hab über 1 Jahr gebraucht um grob jeden Champion zu kennen.\n\nAnfangs hab ich nur Ashe gespielt und praktisch sofort mein Heal und Flash  gezogen, wenn ein Gegener auf mich zu kam. \nIch hatte am Anfang nur mit meinem  damaligen Freund zusammen gezockt und ihm vor jedem Game gefragt, was mein Gegener kann und Wie er mir am gefährlichsten werden kann. \nAuch hier mein Rat spiel  weiterhin mit anderen Premades zusammen.\n\nAuch ich hatte eine schlechte KDA und hab sehr schlecht gespielt. In jedem 2ten Game wurde praktisch wegen Inting zum Report aufgerufen. Das eine Game bin ich sogar kurz AFK gegangen, weil mein Team mich so hart geflamed hat. Bin dann wieder kommen und hab's dann doch noch bis zum Lose geschafft weiter zu spielen. Selbst da wurde ich nicht gebannt! Ich hab daraufhin aber den Support angeschrieben. \nSolange Du dich bemühst dazu zu lernen und versuchst aus schlechten Games zu lernen, denke ich nicht, dass du Angst vor einem Bann haben musst. Jeder braucht unterschiedlich lange um zu lernen oder ganz neue Sachen/Games zu lernen. Aber man halt bereit sein, die Fehler bei sich zu suchen. \n\nIch hab immer wieder Botgames gemacht. Bis Sie mir \"zu langweilig\" waren. Und ich hab immer wieder Champions ausprobiert und bin auf verschiedene Lanes gegangen. Wenn ich den Champion nicht mochte wusste ich wenigstens was er kann und worauf ich achten muss, wenn ich gegen ihn spiele.\nDazu bietet sich auch der Übungsmodus an. \nGenerell würde ich auch YouTube Videos empfehlen bevor du einen Campion zum ersten mal spielst oder wenn du auf der Toplane bleiben möchtest ein Youtuber, der die Lane auch nur spielt, damit du dir allgemeine Sachen gut an eignen kannst.","replies":[{"poster":"need elo police","date":"2019-05-16T21:01:57.313+0000","up_votes":5,"down_votes":0,"body":"Gut gesagt! Aber die meisten geben gleich am Anfang auf. Die Community macht es da nicht leichter.","replies":[{"poster":"KaffeeJunkie","date":"2019-05-17T13:38:27.118+0000","up_votes":3,"down_votes":0,"body":"Ich kann die, die aufgeben gut verstehen. Wenn man einfach in den ersten Normals eh überfordert/aufgeregt/unsicher/nervös ist, die Champions plötzlich ein Gehirn haben und man dann die blödesten und miesesten Flamer Ingame hat. Wahrscheinlich ja auch Smurfer, die sich den 20. Acc hochziehen müssen wegen Permabanns. \nHätte ich meinem Ex damals nicht gehabt, dann hätte ich auch wahrscheinlich aufgegeben...","replies":[]}]}]},{"poster":"Noxempire","date":"2019-05-15T22:20:43.316+0000","up_votes":4,"down_votes":0,"body":"Dein Matchverlauf sieht zwar ein bisschen desaströs aus, aber wenn du wirklich davon überzeugt bist, dass du nur schlecht gespielt hast, kannst ein Ticket an den Support schreiben. \n\nhttps://support.riotgames.com/hc/de/requests/new\n\nDer wird sich das ganze nochmal genauer angucken. Wenn der Ban unberechtigt ist, wird er aufgehoben. Schlechte Games zu haben ist per se nicht verboten. ^^ ","replies":[{"poster":"BloodyKisha","date":"2019-05-15T22:37:05.545+0000","up_votes":1,"down_votes":0,"body":"Danke für die schnelle Antwort kann es Vllt auch daran liegen das ich mit Freunden spiele die lvl 220+ sind das ich in denn Normals sagen wir mal falsche gematcht werde ? Also wenn ich in einer Gruppe mit dennen spiele ? Und überzeugt muss ich nicht sein ich war einfach nur grotten schlecht in der Runde richtig unterirdisch \n\nIch muss lernen richtig zu last hiten \n\nDenn jungler am Anfang helfen etc \n\nKann ich alles nicht perfect vieles vergesse ich auch z.b. JungLer beim buff helfen am Anfang \n\nUnd ich mag Leute die anderen denn Spiel Spaß verderben wollen durch mit Absicht denn Gegner helfen nicht daher mache ich das nicht \n\nUnd ich entschuldige mich auch meistens dafür wenn ich merke ich hab nenn Spiel Fehler gemacht oder wenn ich auf was nicht reagiere schreib ich auch sry und das ich kacke bin aber ich merke es mir fürs nächste game ;)","replies":[{"poster":"eingew","date":"2019-05-16T06:54:21.095+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=BloodyKisha,realm=EUW,application-id=KYnfKGf0,discussion-id=n4ubP5qu,comment-id=00010000,timestamp=2019-05-15T22:37:05.545+0000)\n>\n> Danke für die schnelle Antwort kann es Vllt auch daran liegen das ich mit Freunden spiele die lvl 220+ sind das ich in denn Normals sagen wir mal falsche gematcht werde ? Also wenn ich in einer Gruppe mit dennen spiele ? Und überzeugt muss ich nicht sein ich war einfach nur grotten schlecht in der Runde richtig unterirdisch \n\nKlar, auf jeden Fall hat das auch einen Einfluss, das macht es sicherlich deutlich wahrscheinlicher, dass du komplett zerstört wirst. In meiner Anfangszeit war das auch so, vor allem wenn man dann neue Champs ausprobiert wird man normalerweise komplett auseinander genommen.\n\nGenerell würde ich das mit der Gruppe aber beibehalten an deiner Stelle, man lernt einfach deutlich mehr, wenn man erfahrene Spieler an seiner Seite hat und letztlich auch, wenn man gegen erfahrene Gegner spielt, da gewöhnt man sich einige Fehler, die man sonst machen könnte, gar nicht erst an, weil die gnadenlos vom Gegner ausgenutzt werden.\n\n> Ich muss lernen richtig zu last hiten \n> \n> Denn jungler am Anfang helfen etc \n> \n> Kann ich alles nicht perfect vieles vergesse ich auch z.b. JungLer beim buff helfen am Anfang \n> \n> Und ich mag Leute die anderen denn Spiel Spaß verderben wollen durch mit Absicht denn Gegner helfen nicht daher mache ich das nicht \n> \n> Und ich entschuldige mich auch meistens dafür wenn ich merke ich hab nenn Spiel Fehler gemacht oder wenn ich auf was nicht reagiere schreib ich auch sry und das ich kacke bin aber ich merke es mir fürs nächste game ;)\n\nEs ist noch kein Meister vom Himmel gefallen. Solange du immer versuchst, an alles zu denken und dein bestes zu geben (in einem Rahmen, in dem du natürlich noch Spaß bei der Sache hast) kann dir da keiner ernsthaft einen Vorwurf machen denke ich.","replies":[{"poster":"SSI CptHaunted","date":"2019-05-17T18:59:34.063+0000","up_votes":1,"down_votes":0,"body":"> Generell würde ich das mit der Gruppe aber beibehalten an deiner Stelle, man lernt einfach deutlich mehr, wenn man erfahrene Spieler an seiner Seite hat und letztlich auch, wenn man gegen erfahrene Gegner spielt, da gewöhnt man sich einige Fehler, die man sonst machen könnte, gar nicht erst an, weil die gnadenlos vom Gegner ausgenutzt werden.\n\nAls Anfänger von erfahrenen Spielern gestompt zu werden bringt dir gar nichts, schließlich weißt du selbst in keiner Weise was du falsch gemacht hast. Auch seine Premade-Mitspieler werden nicht die Zeit haben ihm auf seiner Lane die ganze Zeit zuzuschauen und ihn auf jeden seiner Fehler hinzuweisen. Am Meisten lernt man wenn man gegen Spieler spielt die ein kleines bisschen besser sind als man selbst, da sie eben nur die gröberen Fehler ausnutzen, die man im Lernprozess nunmal auch als erstes eliminieren muss, jedoch kann man davon ausgehen, dass Normals mit ihrem katastrophalen Matchmaking da keine große Hilfe sind. Dass man gewisse Fehler gar nicht erst angewöhnt wenn man gegen deutlich bessere Spieler spielt ist, sorry, einfach nur Blödsinn, einfach schon weil diese Fehler weder ins Gewicht noch überhaupt auffallen. Eine solche Solo-Lane ist meist nach 5 Minuten vorüber und der schwächere kann den Rest des Spiels in der Base stehen, oder eben einen solchen Score am Ende haben + den Flame weil du als der Hauptgrund angesehen wirst warum das Spiel verloren geht.","replies":[{"poster":"need elo police","date":"2019-05-17T19:52:30.602+0000","up_votes":2,"down_votes":0,"body":"Was würdest du am Matchmaking ändern? Es spielen Teams gegeneinander, die ungefähr die gleiche Elo haben. Wenn aber ein Challenger Spieler der nur Ranked spielt halt dann mal ein Normal Game spielt, hat der eben in der Normal Warteschlange eine Elo von einem Silber Spieler oder ähnlichem. Daran kann man nichts ändern, und der Challenger Spieler dominiert das Spiel. Das gleiche wenn du die Normal Elo mit der Ranked Elo nimmst ... ein Smurf der Silber Elo hat wird genauso in Normal gewinnen, weil er zwar in Ranked Silber Elo hat, aber eigentlich viel besser als diese Elo ist. Du kannst es drehen wie du willst, aber ein faires Matchmaking wird es nicht geben, dafür sorgen Smurfs, verschiedene Elos und so weiter.","replies":[]},{"poster":"eingew","date":"2019-05-18T05:46:07.390+0000","up_votes":1,"down_votes":0,"body":"Mag sein, dass du das nicht kannst, bei mir hat das sehr gut funktioniert - sowohl das Lernen als auch das Hilfe von mitspielenden Mitspielern zu erhalten.\nHat dazu geführt, dass ich wenn ich mal alleine in die Queue gegangen bin, wenn keiner Zeit hatte, ich mein Team normalerweise recht einfach carryn konnte, weil auf niedrigem Level eben keiner einen Plan hat und alle noch enorm viele Fehler machen, die ich mir gar nicht erst angewohnt hatte, weil die eben von erfahrenen Lanegegnern entsprechend bestraft wurden.","replies":[{"poster":"FeederIee","date":"2019-05-19T20:30:15.882+0000","up_votes":1,"down_votes":0,"body":"Warte hast du ihm gerade geraten sich an den support auszuliefern nachdem er schonmal gesperrt wurde :D\n\nwürde ich davon abraten","replies":[{"poster":"eingew","date":"2019-05-20T04:51:31.664+0000","up_votes":1,"down_votes":0,"body":"Nur, dass der TE nicht gesperrt wurde?","replies":[]}]}]}]}]}]}]},{"poster":"Veezey","date":"2019-05-16T21:45:29.075+0000","up_votes":3,"down_votes":0,"body":"Solange du nicht wirklich intest und niemanden flamest wirst du auch nicht gebannt.","replies":[]},{"poster":"Abasin","date":"2019-05-16T07:10:00.161+0000","up_votes":3,"down_votes":0,"body":"Gegenfrage, wurdest Du denn jetzt gebannt oder fragst Du nur das Procedere ab?\n\nMan kann und wird übrigens für jeden Schwachsinn reportet, viele lassen hier einfach Dampf ab. Aber schlecht spielen ist erstmal kein bannwürdiges Handeln, es sei denn, dass man absichtlich (intentional) schlecht spielt. \nHier sind halt einige Spieler sehr radikal in ihrer Sicht und schauen nur auf den Score. Wenn der in ihren Augen zu schlecht ist, reporten die einfach für intentional feeding, selbst wenn klar ist, dass da auch mal Bronze gegen Platin/Diamond steht und Bronze einfach keine Chance hat. An der Stelle wird \"Report\" schon zum Meme.\n\nWie auch immer, wenn Du \"nur\" unfähig bist, ist das kein Banngrund. Wenn Du ein Spiel absichtlich sabotierst, und es fällt auf, dann kannst Du mit Sicherheit erwarten, dass der Report zu einem Bann führt.","replies":[{"poster":"BloodyKisha","date":"2019-05-16T07:26:09.747+0000","up_votes":2,"down_votes":0,"body":"Noch bin ich nicht gebannt nur die Angst ist/war da weil ich halt oft gemeldet worden bin  weil (wie du schon geschrieben hattest) ich einfach unfähig bin xD ich mag das game halt sehr und hab mir halt skins etc geholt ohne ende und es wäre halt schade das diese durch mein übermäßig schlechtes Spiel Verständnisses nun weg wären und mein acc gebannt werden würde \n\nIch bin kein Spieler der andere denn tag vermiesen will weil mir das selber keinen Spaß machen würde so jemanden in meinem Team zu haben und davon haben tuhe ich auch nicht =3","replies":[]},{"poster":"BloodyKisha","date":"2019-05-16T07:28:59.844+0000","up_votes":1,"down_votes":0,"body":"Noch bin ich nicht gebannt nur die Angst ist/war da weil ich halt oft gemeldet worden bin  weil (wie du schon geschrieben hattest) ich einfach unfähig bin xD ich mag das game halt sehr und hab mir halt skins etc geholt ohne ende und es wäre halt schade das diese durch mein übermäßig schlechtes Spiel Verständnisses nun weg wären und mein acc gebannt werden würde \n\nIch bin kein Spieler der andere denn tag vermiesen will weil mir das selber keinen Spaß machen würde so jemanden in meinem Team zu haben und davon haben tuhe ich auch nicht =3\n\nIch sehe gerade aber auch warum du gefragt hast mein Handy hat statt \n\n\"Gebannt wegen schlechtem spielens in normals möglich?\"\n\nDas möglich weg gelassen -_-\"\n\nIm sorry","replies":[]}]},{"poster":"Nordwolf87","date":"2019-05-16T04:47:34.543+0000","up_votes":3,"down_votes":0,"body":"Auch wenn du - sorry - wirklich sehr schlecht spielst (kaum ein Game mit weniger als 10 Toden), schaut mir, vom Itemkauf und den Stellen wo du gestorben bist, dein letztes Game nicht intentional feeding aus. Sieht eher so aus als hättest du immer wieder gefightet obwohl du sehr weit hinten warst. Das kann man natürlich auch als \"inten\" ansehen, wenn dir die Aussichtslosigkeit der Fights klar war und du trotzdem wieder und wieder den Gegner angreifst. Ich weiß aber nicht wie Riot das sieht. Nixempire hat dir schon den Link gegeben, da kannst du dein Glück versuchen =)","replies":[{"poster":"BloodyKisha","date":"2019-05-16T05:18:00.948+0000","up_votes":2,"down_votes":0,"body":"ich weiß nicht was inten bedeutet sry xD \n\naber ich hab immer wieder versucht sie zufighten ja das stimmt ich wollte halt nicht aufgeben und an machen punkten dachte ich mir ich kann sie zurück drängen damit sie weniger farm bekommt aber da hat sie mich bei gekillt xD also ja aber dennoch danke für dein feedback wie gesagt ich lerne das game noch und bin ja bereit mich zu verbessern :D","replies":[{"poster":"Nordwolf87","date":"2019-05-16T05:26:08.284+0000","up_votes":3,"down_votes":0,"body":"\"inten\" ist kurz für INTENtional Feeding sprich absichtlich sterben und den Gegner mit Kills/Gold feeden (füttern) ;)\n\nJo das dacht ich mir schon, solltest du wieder spielen empfehle ich dir, dir ein paar youtube guides anzuschauen zum Thema \"sicher farmen\" (\"safe farming in Lol\") oder wie man spielt wenn man behind ist (zb lane kurz vorm Turm freezen oder so sicher wie möglich unterm turm farmen und den Jgler um einen Gank bitten - der kommt natürlich nur so lange du /2 oder 0/3 stehst, kaum ein Jgler wird eine 0/6 lane ganken und dem Gegner nochmal 1-2 Kills geben ;))","replies":[{"poster":"BloodyKisha","date":"2019-05-16T05:35:36.993+0000","up_votes":1,"down_votes":0,"body":"alles klar danke werde ich mir mal ein paar videos zu angucken Dankeschön =D","replies":[]}]}]}]},{"poster":"silinji","date":"2019-05-31T10:07:36.509+0000","up_votes":2,"down_votes":0,"body":"1. Du wirst nicht gebannt weil Du schlecht spielst. Hab ich zumindest noch nie gehört.\n2. Wenn Spieler schreibe \"report XY\" dann kannst Du sie reporten Grund: Report calls. Würde ich in die Begründung tippen, ist nämlich nicht gestattet.\n3. Wenn Dich Riven Spiele frustrieren, versuche es mit einem Champion der für Anfänger -erstmal- etwas einfacher ist und lerne das Makrogame und dann, wenn Du das drauf hast, gehe zurück zu Riven wenn Du sie sehr magst.\n4. Wenn Du große Angst um den Account hast in den Du bisher soviel Geld gesteckt hast, level Dir noch einen Zweitaccount hoch (wichtig mit anderer E-Mail Adresse anmelden) mit dem Du dann eine zeitlang etwas entspannter spielst, weil der Verlust kleiner wäre. \n5. Mute all \n6. Hab Spass :-)","replies":[]},{"poster":"Mister Nyuni","date":"2019-05-16T14:04:27.745+0000","up_votes":2,"down_votes":0,"body":"solange der support sieht, dass du dich irgendwie bemüht hast das spiel zu gewinnen wirst du auch nicht gebannt. vielleicht als kleiner tipp: wenn du champs etwas lernen möchtest, spiel 1-2 runden co op vs. ai. mache ich bis heute. auch einfach zum entspannen. und wenn du dich bereit fühlst, kannst du dich in normals stürmen.","replies":[{"poster":"BloodyKisha","date":"2019-05-18T21:42:23.049+0000","up_votes":2,"down_votes":0,"body":"okay danke :D habe nun poppy angetestet und komme besser mit ihr klar das sieht man auch an denn runden mein kollege geht mir zur hand mit denn items und was ich wann machen kann.\n\ner hat mir das mit dem schaden-traiden erklärt und wann ich wohin muss um nicht gekillt zu werden und besser def/en kann :D","replies":[]}]},{"poster":"SuicidePlank","date":"2019-05-15T21:01:44.467+0000","up_votes":2,"down_votes":0,"body":"> Darauf hin wurde mir von 2 Team m8s direkt wieder das schöne Wort Report \"riven\" (charakter halt denn ich spiele in der Runde)\n\nWat.\n\nUnd nein, wenn es nicht intentional war ist, wird es nicht bestraft. Meine Lethality Ivern Games haben mich auch nicht gebannt gekriegt, sind so zwischen 4/13 bis open end.","replies":[{"poster":"BloodyKisha","date":"2019-05-15T22:42:45.578+0000","up_votes":1,"down_votes":0,"body":"Ja ich spiele ja mit Freunden ab und zu und die geben mir auch Tipps nur dennoch komm ich durch mein nicht vorhandenes Verständnisses mit 3/11/8 oder so raus oder das ich Mega scheiße spiele weil mit ein Charakter nicht liegt wie z.b. quinn ich kann die garnicht spielen und als Gegner mag ich die auch nicht xD genau so {{champion:517}} mag ich überhaubt nicht (als gegner) xD und ja wenn die lain fällt heißt es direkt der und der Held  (ich) würde direkt Feeden etc aber danke für die schnelle Antwort =3","replies":[{"poster":"eingew","date":"2019-05-16T06:55:23.810+0000","up_votes":2,"down_votes":0,"body":"Am besten man spielt möglichst wenige Champs in diesem Spiel ^^.","replies":[{"poster":"BloodyKisha","date":"2019-05-16T07:08:11.865+0000","up_votes":2,"down_votes":0,"body":"Meinst du damit das man sich auf Champs fokusen soll die einem gefallen ? Und diese dann nur spielt ?\n\nOder war das Sarkasmus? XD","replies":[{"poster":"Metalmonni","date":"2019-05-16T07:54:44.580+0000","up_votes":2,"down_votes":0,"body":"Kein Sarkasmus... Übung macht den Meister, einen Champion erstmal wirklich zu beherrschen ist der beste Weg, die Grundzüge des Spieles zu lernen und keine so katastrophalen Scores mehr abzuliefern. \n\nWenn du dann erstmal eine Position gelernt hast und auf dieser 1 - 2 Champs wirklich beherrschst hilft dir das auch im allgemeinen Spielverständnis so weit, dass du dich mit deinem neuen Hintergrundwissen auch mal guten Gewissens an andere Positionen herantrauen kannst. \n\nWenn du z.b. auf der Toplane gelernt hast, wann du z.b. behind bist und eher sicher unter dem Turm farmen solltest (und wie das mit Nah- und Fernkampf Champions geht), kannst du das Verfahren auch auf die Mitte übertragen. \n\nWenn du ein Gefühl entwickelt hast, wann ein Gegner wo sein wird und entsprechendes Warding beherrscht hilft dir das im Jungle usw... Gibt unzählige Beispiele.","replies":[{"poster":"BloodyKisha","date":"2019-05-16T08:28:48.580+0000","up_votes":1,"down_votes":0,"body":"okay mache ich danke schön :D","replies":[]}]}]}]}]}]},{"poster":"MentalWukong","date":"2019-05-16T07:58:35.004+0000","up_votes":1,"down_votes":4,"body":"***","replies":[{"poster":"Metalmonni","date":"2019-05-16T08:08:29.604+0000","up_votes":2,"down_votes":0,"body":"Wenn du weißt, was du falsch machst, warum tust du es?\nDer TE kann hier ganz offensichtlich seine mangelnder Erfahrung für seine Fehler im Spiel anführen.","replies":[{"poster":"Rena","date":"2019-05-16T08:50:57.127+0000","up_votes":1,"down_votes":2,"body":"Wenn du an einen Gank stirbst, weisst du auch was du falsch machst.\nWarum stirbst du dann noch an Ganks?","replies":[{"poster":"Metalmonni","date":"2019-05-16T09:02:16.609+0000","up_votes":2,"down_votes":0,"body":"Der Ersteller schrieb: \n\n> hab auch teilweise 17 bis 20 tode in nen spiel ohne zu inten. Einfach weil ich 24/7 agressiv ohne wards und positioning spiele\n\nOffensichtlich hat er erkannt, dass das aggressive Spielen ohne warding und positioning eine schlechte Taktik ist und zum Feeden führt, laut seiner eigenen Aussage 17 - 20 Tode im Spiel. \n\nDein Gegenbeispiel mit dem Gank ist ein sehr schlechtes, wenn man es überhaupt vergleichen kann. Sterbe ich an einem Gank unternehme ich Gegenmaßnahmen durch Wars, defensives Spielen, Hilfe suchen beim eigenen Jungler o.ä.. Das alles verschafft natürlich keine absolute Sicherheit, da nichts absolut sicher ist. Wichtig ist nur, dass ich Gegenmaßnahmen einleite um weiteren Feed zu vermeiden. \n\nWenn der Autor der oben stehenden Aussage 17 - 20 mal stirbt (und das offensichtlich in mehreren Spielen), hat er das Einleiten dieser Gegenmaßnahmen unterlassen. Passende Gegenmaßnahmen währen z.b. das Aufbauen ausreichender Vision, rechtzeitige Rückzüge, das Picken mobiler Champs oder einfach nur das Unterlassen stumpfen pushens ohne Mehrwert. \n\nDer TE unterlässt dies offenbar absichtlich, was aktiver Sabotage gleichkommt. Er weiß, was er tun müsste und entscheidet sich aktiv dagegen. \n\nWenn ich an einem Gank sterbe *versuche* ich, das gleiche Ergebnis in Zukunft zu vermeiden. Eine 100prozentige Sicherheit kann es dabei selbstverständlich nicht geben. Dennoch ist das absolut nicht damit vergleichbar, 17 mal stumpf die Lane rauszupushen, wenn man die resultierende Konsequenz bereits vorhersieht.\n\nEdit:\nHier muss man auch bedenken, dass der Autor des oben stehenden Beitrages kein Anfänger ist. Laut seiner Aussagen in einem anderen Thema verfügt er über mehrere permanent gesperrte Accounts. Hier liegt genügend Erfahrung vor um zu Wissen dass das eigene Handeln Quatsch ist. ","replies":[{"poster":"Rena","date":"2019-05-16T12:51:26.088+0000","up_votes":1,"down_votes":0,"body":"Ich glaube du verstehst mich falsch.\n\nSich in sowas zu verbessern, ist viel schwerer als du schreibst.\n\n\"Wenn du weißt, was du falsch machst, warum tust du es?\"\n\nDarum habe ich diesen Vergleich geschrieben.\n\nJa er weiss es aber im Spiel ist es sehr schwer, diese Fehler zu korrigieren.\nGenau so wie wir alle wissen, dass wir nicht geganked werden sollten. (weil wir overextended).","replies":[{"poster":"Metalmonni","date":"2019-05-16T12:57:45.307+0000","up_votes":2,"down_votes":1,"body":"Da bin ich anderer Meinung. \n\nNicht dauerhaft zu sterben indem man das (offensichtlich als Ursache erkannte) pausenlose pushen und nicht warden einfach unterlässt ist nicht schwer. Etwas nicht zu tun ist leicht umzusetzen, nachdem man es als Fehlerquelle erkannt hat. \n\nDer werte Herr Mental Wukong *könnte* mit seinem Feeding aufhören. Er *will* nur nicht.","replies":[]}]}]}]},{"poster":"MentalWukong","date":"2019-05-16T09:02:44.670+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"Metalmonni","date":"2019-05-16T09:09:33.919+0000","up_votes":2,"down_votes":1,"body":"Und Tod Nummer 15 im Spiel bringt dich nicht auf den Gedanken, die Sache etwas anders anzugehen?","replies":[]}]}]},{"poster":"GretaStoleMyCar","date":"2019-05-16T08:29:45.343+0000","up_votes":2,"down_votes":0,"body":"Ist es aber nicht genau dann inten, wenn man weiß, was man falsch macht und es trotzdem tut?","replies":[]}]}]}