{"poster":"Laloooo","date":"2015-12-13T01:18:44.243+0000","title":"No me deja regalar un aspecto a alguien en particular","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Es simple... quer&iacute;a regalarle un skin a una persona en particular y no me deja... intento con cualquier otra persona y me deja, pero con la que quiero no... Que es lo que pasa? alguna soluci&oacute;n?","replies":[{"poster":"Laloooo","date":"2015-12-14T23:31:09.777+0000","up_votes":1,"down_votes":0,"body":"...","replies":[]},{"poster":"Laloooo","date":"2015-12-13T20:15:20.429+0000","up_votes":1,"down_votes":0,"body":"He intentado de todo y no a cambiado nada... Espero que arreglen esto rápido antes de navidad xd","replies":[]},{"poster":"InsTicC","date":"2015-12-13T17:51:09.806+0000","up_votes":1,"down_votes":0,"body":"Es un bug o un problemas pero solo sucede con algunas personas y eso es lo extraño porque si puedes enviar otro tipo de regalo.\nIntenta lo siguiente q a mi si me resulto \n\nLo q debes hacer es seleccionar una cuenta \"X\" q tenga el campeon de la skin q quieras regalar...\nLuego al seleccionar vuelves rapidamente antes q se abra la lista de skin, a la lista de amigos...\nSi lo haces se abrira directamente el listado de skins en la cuenta q se supone no puedes seleccionar para regalar la skin...\n\nPD: Antes de confirmar el envio, fijate si el nombre de la cuenta es el correcto.","replies":[]},{"poster":"Laloooo","date":"2015-12-13T01:21:53.334+0000","up_votes":1,"down_votes":0,"body":"Una solución rápida plz....","replies":[{"poster":"GhostBlade01","date":"2015-12-13T04:10:51.906+0000","up_votes":1,"down_votes":0,"body":"Me esta pasando exactamente lo mismo, pero no es con uno, es con 2 amigos, e intentado de todo pero no pasa nada. Me mando un mensaje un Rioter comentando de que están trabajando en ello pero no hay mucho avance :/","replies":[]}]},{"poster":"Sebatano","date":"2015-12-13T04:09:17.599+0000","up_votes":1,"down_votes":0,"body":"Comento para mantenerlo activo, me pasa lo mismo.","replies":[]}]}