{"poster":"Syndicate Riven","date":"2019-04-23T21:36:03.591+0000","title":"Dia4 Lp","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Servus an alle\r\n\r\nIch hätte mal eine frage und zwar bin ich im ranked dia4 und bekomme pro win ca 12-14lp und verliere 22-24lp ist es ein bug oder ist meine mmr so am arsch? ich hab \"nur\" 200 games mit dem account falls das eine Rolle spielt \r\n\r\nMFG","replies":[{"poster":"MidlaneGod115","date":"2019-04-23T21:55:55.893+0000","up_votes":2,"down_votes":0,"body":"Wenn du keine insane hohe Wr hast (so wie ich :p ) bekommst du direkt nach der Dia4 Promo weniger Lp, also so 15-16 und verlierst so ca 21...\nDa muss man durch!\n\nDu hast aber prob schon einiges dort verloren, weswegen du noch weniger bekommst...","replies":[{"poster":"HavannaCoke","date":"2019-05-04T22:34:34.681+0000","up_votes":1,"down_votes":0,"body":"so insane ist 68 jetzt aber auch wieder net, hattest du damit wircklich sofort +20 in low dia?","replies":[{"poster":"MidlaneGod115","date":"2019-05-05T09:22:47.067+0000","up_votes":1,"down_votes":0,"body":"Ne aber ich hatte bis nach Dia3 ca 82%  und dann hatte ich haufenweise schlechte Games xD\n\nAber plus 20 war schon Standard...","replies":[]}]}]},{"poster":"Saphane","date":"2019-04-24T12:26:08.282+0000","up_votes":1,"down_votes":0,"body":"Glaube, dass das ganze normal ist. Ich bin mit einer 15 Wins Winningstreak nach Dia 4 gekommen und habe jetzt eine 54% Winrate und ich bekomme trotzdem nur +14 und verliere -22, was das climben stark erschwert. Aber wie manche hier schon gesagt haben: da muss man durch.","replies":[]},{"poster":"Dechsa","date":"2019-04-24T11:49:22.758+0000","up_votes":1,"down_votes":0,"body":"Naja, ab einem bestimmten Punkt muss man gute Spieler von casual Spielern unterscheiden. Jetzt kommt´s drauf an ob du Platin bzw. Dia 4 Leute je nach deiner MMR, tragen kannst. Wenn du´s nicht schaffst, gehörst du auch nicht in ne andere Liga :/. Oder hast du noch nie von anderen gehört wie schlimm Dia 4 ist ? Ab da splitten sich immer weiter richtig gute Spieler von normalen Spielern. Der Sprung von Dia 4 nach Dia 3 ist genau so wie der von Gold nach Platin. Sind halt paar Sachen die du lernen musst. Falls du nicht weiß, was du lernen musst, bräuchtest du nen Coach. :)","replies":[]},{"poster":"Syndicate Riven","date":"2019-04-23T22:12:38.360+0000","up_votes":1,"down_votes":1,"body":"wer hat sich die kacke ausgedacht? du gewinnst 3 games verlierst eins und hast wieder 0Lp wie ist es dann ab dia 2-1 dann bekommt man pro win 2-3lp? lel 200iq system","replies":[{"poster":"MidlaneGod115","date":"2019-04-24T07:26:44.434+0000","up_votes":1,"down_votes":0,"body":"Irgendwo muss es ja eine Heraisforderung sein...\nSonst könnte ja jeder daher gelaufene Dia4 Spieler aufeinmal Master sein..\n\nACH DA WAR JA WAS XD","replies":[]},{"poster":"eingew","date":"2019-04-24T05:32:47.019+0000","up_votes":1,"down_votes":0,"body":"Offenbar ist da jemand bei Riot der Meinung, dass man für Dia etwas mehr tun muss, als für die anderen \"normalen\" Elos. Wie könnte ^^.","replies":[]}]},{"poster":"OrvilleyNuU","date":"2019-04-23T21:48:25.322+0000","up_votes":1,"down_votes":0,"body":"Habe das auch auf meinem Main Account. Kriege 12-14Lp verliere 20-22Lp :c \nIst denk ich mal normal hatte das auch vom Anfang an als ich Dia 4 gekommen bin","replies":[]}]}