{"poster":"ORElTirador","date":"2015-06-29T04:30:44.341+0000","title":"Propuesta de campeón: Shane Graves","subforum":"Creaciones de la comunidad","up_votes":4,"down_votes":0,"body":"El hermano desconocido de Graves llega a la grieta.  \n\nHistoria:\n\n Luego de que su hermano mayor haya sido abandonado en Aguas Estancadas, el peque&ntilde;o Shane, huy&oacute; de su familia apenas a los 7 a&ntilde;os, indignado.  El chico supo sobrevivir como su hermano gracias a la gente de los pueblos que visitaba que de vez en cuando, le tiraban alg&uacute;n pan o le daban un poco de agua. El peque&ntilde;o Shane demostr&oacute; ser un gran superviviente y a la vez un gran ladr&oacute;n, puesto que tambi&eacute;n se dedicaba a robar carteras o billeteras a quien fuera que se le pasara por adelante. De ciudad en ciudad, Shane fue traslad&aacute;ndose hasta llegar a Pilt&oacute;ver. Sin embargo, cierto d&iacute;a, mientras realizaba su rutina diaria de robos, fue sorprendido por una de las oficiales de Pilt&oacute;ver, Vi. Tal vez por hacerle recordar su dura infancia, o tal vez por notar una gran agilidad, Vi no s&oacute;lo perdon&oacute; a Shane, sino que adem&aacute;s le ense&ntilde;o a manejar armas y a defenderse. Pronto, Shane Graves se convertir&iacute;a en uno de los agentes oficiales m&aacute;s importantes de la fuerza polic&iacute;aca de Piltover. A Caitlyn, nunca le agrad&oacute; Shane, probablemente por su oscuro pasado. Shane utiliza una armadura forjada por si mismo muy tecnol&oacute;gica capaz de adaptarse a situaciones extremas y modificarse para aumentar el da&ntilde;o o reducir el recibido. Hoy en d&iacute;a Shane Graves lucha contra el crimen y sue&ntilde;a con abatir todo tipo de delincuencia en toda Runaterra y poder encontrar a su hermano perdido Malcolm Graves.\n \nDescripci&oacute;n para que se imaginen al champ: Es un champ muy parecido a Graves, y utiliza una armadura que seg&uacute;n la situaci&oacute;n en la que se encuentre Shane, se modifica. Es un champ que ser&iacute;a muy bueno para top por su kit de habilidades y su resistencia.\n\nPasiva: TODOTERRENO\nLa armadura de Shane se modifica seg&uacute;n la situaci&oacute;n en que se encuentre, alternando entre 4 posibles situaciones\n\n-Estado normal: En este estado, Shane tiene todas sus estad&iacute;sticas base.\n\n-Punto cr&iacute;tico: Cuando la vida de Shane se reduce a m&aacute;s del +20, su armadura aumenta en tama&ntilde;o, su cabeza, brazos y piernas son cubiertas por ella y obtiene un +20 de armadura y un +20 de resistencia m&aacute;gica. De todos modos, su velocidad de movimiento se ve reducida un 5+ debido al peso de &eacute;sta. Las bonificaciones duran 10 segundos.\n\n-A por &eacute;l: Cuando un enemigo cercano se encuentra con menos del +10 de la vida, Shane activa los propulsores de su armadura y obtiene %15 de velocidad de movimiento y +25 de da&ntilde;o de ataque. Para aumentar su velocidad de movimiento, Shane debe reducir el peso de su armadura, por lo tanto pierde +15 de armadura y +15 de resistencia m&aacute;gica.\n\n-A la carga: Cuando cerca de Shane hay 4 aliados, su armadura aumenta de tama&ntilde;o y emana un grito de guerra que inspira a sus aliados. Tanto &eacute;l como sus aliados reciben ciertos beneficios. Shane obtiene +20 de da&ntilde;o de ataque, +20 de armadura, +10 de vel de ataque y +10 de vel de movimiento. Por otra parte sus aliados reciben +10 de da&ntilde;o de ataque, +10 de poder de habilidad, +20 de armadura y +5 de vel de movimiento.\n\nNOTA: Shane no puede tener dos estados de la pasiva a la vez, por lo tanto, siempre va a mantener el que tuvo primero, es decir, si ten&iacute;a en su estado PUNTO CR&Iacute;TICO en un principio, no va a poder cambiar a A POR &Eacute;L hasta que vuelva a su estado normal. Shane no puede evitar el cambio de armadura, es como la pasiva de Gnar.\n\nEsta es la primera parte, espero que les haya gustado. Si veo que tiene buena recibida por parte del p&uacute;blico voy a continuar el campe&oacute;n. Dejen sus opiniones, contesto dudas y reviso cr&iacute;ticas, siempre y cuando sean constructivas. Abajo tienen un pequeño splash art XD","replies":[{"poster":"FallenDemonX","date":"2015-07-01T21:14:59.446+0000","up_votes":1,"down_votes":0,"body":"Esta bueno, aunque la bonificacion de las TF es casi como una {{item:3105}} y un {{item:3050}} gratis.","replies":[]},{"poster":"Missamofacu","date":"2015-07-01T02:40:13.262+0000","up_votes":1,"down_votes":0,"body":"Muy buena","replies":[]},{"poster":"I RIVEN WE TRUST","date":"2015-06-29T17:26:09.572+0000","up_votes":1,"down_votes":0,"body":"Malisimo man,te das cuenta que estas sacando un champ rotísimo por las pasivas que tiene y lo demás,etc.","replies":[{"poster":"ORElTirador","date":"2015-06-29T20:02:51.070+0000","up_votes":1,"down_votes":0,"body":"Me parece que estas exagerando demasiado. Tiene una muy buena pasiva, si sin embargo las bonificaciones que da no son tan grandes como para mostrar una amplia ventaja.","replies":[]}]},{"poster":"rokushoger","date":"2015-06-29T17:30:42.380+0000","up_votes":1,"down_votes":0,"body":"Está muy buena la idea, la pregunta es como vuelve a su estado normal?","replies":[]},{"poster":"CarrilloLalo","date":"2015-06-29T16:55:17.211+0000","up_votes":1,"down_votes":0,"body":"me gusta","replies":[]}]}